{"id": "http://arxiv.org/abs/1008.2207v2", "guidislink": true, "updated": "2011-07-14T19:45:28Z", "updated_parsed": [2011, 7, 14, 19, 45, 28, 3, 195, 0], "published": "2010-08-12T20:02:54Z", "published_parsed": [2010, 8, 12, 20, 2, 54, 3, 224, 0], "title": "Generalized Borcea-Voisin Construction", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.4121%2C1008.2663%2C1008.2936%2C1008.2790%2C1008.2451%2C1008.1530%2C1008.1041%2C1008.5330%2C1008.4148%2C1008.1259%2C1008.1584%2C1008.3413%2C1008.3275%2C1008.1246%2C1008.1915%2C1008.5356%2C1008.1278%2C1008.4397%2C1008.4013%2C1008.2321%2C1008.2207%2C1008.2868%2C1008.1412%2C1008.4392%2C1008.4749%2C1008.2119%2C1008.0585%2C1008.4829%2C1008.4786%2C1008.2113%2C1008.2361%2C1008.0539%2C1008.3780%2C1008.0208%2C1008.2909%2C1008.1815%2C1008.2244%2C1008.4052%2C1008.5005%2C1008.1038%2C1008.4824%2C1008.5078%2C1008.4482%2C1008.4258%2C1008.1242%2C1008.1388%2C1008.3201%2C1008.4106%2C1008.2145%2C1008.2224%2C1008.0761%2C1008.0697%2C1008.1003%2C1008.2824%2C1008.4334%2C1008.3582%2C1008.4296%2C1008.1122%2C1008.4616%2C1008.4163%2C1008.5229%2C1008.1298%2C1008.1883%2C1008.3584%2C1008.3604%2C1008.4212%2C1008.2962%2C1008.3886%2C1008.2579%2C1008.4472%2C1008.2652%2C1008.4661%2C1008.3392%2C1008.3645%2C1008.2875%2C1008.0591%2C1008.0580%2C1008.4953%2C1008.3579%2C1008.0216%2C1008.5260%2C1008.1323%2C1008.1674%2C1008.2249%2C1008.1058%2C1008.0791%2C1008.2162%2C1008.3386%2C1008.4597%2C1008.2800%2C1008.3983%2C1008.0345%2C1008.3823%2C1008.4625%2C1008.1680%2C1008.2456%2C1008.4614%2C1008.0975%2C1008.2723%2C1008.3108%2C1008.0597&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Generalized Borcea-Voisin Construction"}, "summary": "C. Voisin and C. Borcea have constructed mirror pairs of families of\nCalabi-Yau threefolds by taking the quotient of the product of an elliptic\ncurve with a K3 surface endowed with a non-symplectic involution. In this\npaper, we generalize the construction of Borcea and Voisin to any prime order\nand build three and four dimensional Calabi-Yau orbifolds. We classify the\ntopological types that are obtained and show that, in dimension 4, orbifolds\nbuilt with an involution admit a crepant resolution and come in topological\nmirror pairs. We show that for odd primes, there are generically no minimal\nresolutions and the mirror pairing is lost.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.4121%2C1008.2663%2C1008.2936%2C1008.2790%2C1008.2451%2C1008.1530%2C1008.1041%2C1008.5330%2C1008.4148%2C1008.1259%2C1008.1584%2C1008.3413%2C1008.3275%2C1008.1246%2C1008.1915%2C1008.5356%2C1008.1278%2C1008.4397%2C1008.4013%2C1008.2321%2C1008.2207%2C1008.2868%2C1008.1412%2C1008.4392%2C1008.4749%2C1008.2119%2C1008.0585%2C1008.4829%2C1008.4786%2C1008.2113%2C1008.2361%2C1008.0539%2C1008.3780%2C1008.0208%2C1008.2909%2C1008.1815%2C1008.2244%2C1008.4052%2C1008.5005%2C1008.1038%2C1008.4824%2C1008.5078%2C1008.4482%2C1008.4258%2C1008.1242%2C1008.1388%2C1008.3201%2C1008.4106%2C1008.2145%2C1008.2224%2C1008.0761%2C1008.0697%2C1008.1003%2C1008.2824%2C1008.4334%2C1008.3582%2C1008.4296%2C1008.1122%2C1008.4616%2C1008.4163%2C1008.5229%2C1008.1298%2C1008.1883%2C1008.3584%2C1008.3604%2C1008.4212%2C1008.2962%2C1008.3886%2C1008.2579%2C1008.4472%2C1008.2652%2C1008.4661%2C1008.3392%2C1008.3645%2C1008.2875%2C1008.0591%2C1008.0580%2C1008.4953%2C1008.3579%2C1008.0216%2C1008.5260%2C1008.1323%2C1008.1674%2C1008.2249%2C1008.1058%2C1008.0791%2C1008.2162%2C1008.3386%2C1008.4597%2C1008.2800%2C1008.3983%2C1008.0345%2C1008.3823%2C1008.4625%2C1008.1680%2C1008.2456%2C1008.4614%2C1008.0975%2C1008.2723%2C1008.3108%2C1008.0597&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "C. Voisin and C. Borcea have constructed mirror pairs of families of\nCalabi-Yau threefolds by taking the quotient of the product of an elliptic\ncurve with a K3 surface endowed with a non-symplectic involution. In this\npaper, we generalize the construction of Borcea and Voisin to any prime order\nand build three and four dimensional Calabi-Yau orbifolds. We classify the\ntopological types that are obtained and show that, in dimension 4, orbifolds\nbuilt with an involution admit a crepant resolution and come in topological\nmirror pairs. We show that for odd primes, there are generically no minimal\nresolutions and the mirror pairing is lost."}, "authors": ["Jimmy Dillies"], "author_detail": {"name": "Jimmy Dillies"}, "author": "Jimmy Dillies", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s11005-011-0528-3", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.2207v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.2207v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 2 figures. v2: typos corrected & references added", "arxiv_primary_category": {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14J38, 14J32, 14J30, 14J35", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.2207v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.2207v2", "journal_reference": "Lett. Math. Phys. 12 (2012), no. 1", "doi": "10.1007/s11005-011-0528-3", "fulltext": "GENERALIZED BORCEA-VOISIN CONSTRUCTION\n\narXiv:1008.2207v2 [math.AG] 14 Jul 2011\n\nJIMMY DILLIES\nAbstract. C. Voisin and C. Borcea have constructed mirror pairs of families of Calabi-Yau\nthreefolds by taking the quotient of the product of an elliptic curve with a K3 surface endowed\nwith a non-symplectic involution. In this paper, we generalize the construction of Borcea and\nVoisin to any prime order and build three and four dimensional Calabi-Yau orbifolds. We classify\nthe topological types that are obtained and show that, in dimension 4, orbifolds built with an\ninvolution admit a crepant resolution and come in topological mirror pairs. We show that for odd\nprimes, there are generically no minimal resolutions and the mirror pairing is lost.\n\nContents\n1. Introduction\n2. Plan\n3. Notation\n4. Results\n5. Construction\n6. Orbifold cohomology\n7. Topological types\n8. On the mirror map\nAppendix A. Possible non-symplectic actions on K3 surfaces\nReferences\n\n1\n2\n2\n2\n3\n3\n7\n11\n13\n15\n\n1. Introduction\nThe first family of mirror varieties which were neither toric, nor complete intersections, was\nintroduced independently by Borcea [5] and Voisin [24]. They construct Calabi-Yau threefolds and\nfourfolds by taking the quotient by an appropriate involution of the product of lower dimensional\nCalabi-Yau varieties (with Z/2Z symmetry, or larger symmetry in the case of Borcea). Their\nconstruction and the closedness under ther mirror map of the manifolds they build, rely on the\nduality between K3 surfaces endowed with a non-symplectic involution, which was discovered by\nNikulin [16].\nThe Borcea-Voisin construction is actually similar to the one of Vafa and Witten [23] who take the\nquotient of the product of three tori by a group of automorphisms which preserve the volume form\nto study interesting physical models. In both cases, the procedure consists of taking as building\nblocks varieties X1 , . . . , Xn , each endowed with a unique volume form, and then taking the quotient\nof their product by some subgroup of the product of automorphism groups consisting of symmetries\npreserving the total volume form. This approach has given rise to semi-realistic heterotic models\nwhose study was pioneered by Dixon, Harvey, Vafa and Witten in [10]. All possible varieties\nobtained as quotients of products of tori were classified by Donagi and Faraggi [11], Donagi and\nWendland [12], and Dillies [9].\n2000 Mathematics Subject Classification. Primary 14J38; Secondary 14J32, 14J30, 14J35 .\nKey words and phrases. Calabi-Yau, Borcea-Voisin construction, non-symplectic automorphism.\nThe author would like to thank Professor Ron Donagi for informing him of the existence of references [4] and [19],\nMax Pumperla for pointing out a typo in an earlier version and the anonymous referees for thoughtful suggestions.\n1\n\n\fIn this paper, we study and classify the Calabi-Yaus obtained through the construction of Borcea\nand Voisin in two directions. First, we allow cyclic groups of arbitrary prime order, that is, any\nprime less than or equal to 19, as shown in [16]. Second, we construct both three and fourfolds. Our\naim is, first, to find new mirror manifolds, second, to illustrate what could go wrong in constructing\nmirror maps when using higher order automorphisms.\nNote that some of the examples which appear in our classification were known before. For\nexample, Borcea [5, 6] constructs several examples of Calabi-Yau varieties in higher dimension. In\n[1], Mitsuko and Masamichi consider threefolds and fourfolds which can be studied through toric\ngeometry. They obtain a small subset of the classification which we obtain hereunder. Cynk and\nHulek [8] construct and study examples of threefolds and fourfolds using involutions and higher\norder automorphisms and prove modularity for classes with complex multiplication. In [21], Rohde\nstudies, among others, Calabi-Yau threefolds obtained by taking the quotient of the product of an\nelliptic curve and a K3 surface by an automorphism of order 3 fixing only points or rational curves\non the K3 surface. Garbagnati and van Geemen [14] study explicitly the Picard-Fuchs equation\nof a certain familiy constructed by Rohde. Finally, in [13], Garbagnati constructs examples of\nCalabi-Yau threefolds by using automorphisms of order 4.\n2. Plan\nAfter giving a brief description of the notation in Section 3, we will start by an overview of\nthe results in Section 4. In Section 5, we describe the generalized construction of Borcea-Voisin\norbifolds. In Section 6, we compute the orbifold cohomology of our varieties and in Section 7\nwe list all possible topological types of Borcea-Voisin spaces which we obtain and describe their\nfundamental group. Finally, in Section 8, we discuss how much of the mirror map established for\nBorcea-Voisin threefolds in [6, 24] remains true for our construction.\nThe appendix synthesizes the results about non-symplectic automorphisms of prime order on K3\nsurfaces which are needed for the classification.\n3. Notation\nIn this paper, we will denote by X the product of the Calabi-Yau manifolds X1 and X2 . The\nsurface Xi is endowed with a non-symplectic automorphism ρi of order p that fixes a curve of\ngenus g, li rational curves, and pi isolated points.1. These points will be further characterized by\nthe linearized form of ρ along their tangent space. We will call ni the number of points of type\n1\np (i + 1, p − i). Each surface Xi will be characterized by a triple (p, ri , ai ) where p is the order of the\nnon-symplectic automorphism ρi , ri the rank of the invariant part S of H 2 (Xi ) and det(S) = pai .\ni\nMoreover, λi will be a shorthand notation for 22−r\np−1 . Also, at times, we will use the symbol α as\ndefined in [3] or in Table 3.\n4. Results\nUsing the recent classification of non-symplectic automorphisms of prime order on K3 surfaces\n(see [3], or Appendix A for a working synopsis) we construct families of generalized Calabi-Yau\norbifolds in dimensions 3 and 4. We classify all topological families and see that for p odd, distinct\npairs of K3 surfaces yield distinct Calabi-Yau orbifolds.\nIn dimension 4, the family attached to the prime 2 consists of orbifolds admitting crepant resolutions\nand the set of Calabi-Yau manifolds which we obtain is closed under the topological mirror map,\ni.e. for each X in our family, there exists another variety X̌ such that hp,q (X) = hd−p,q (X̌).\n1\n\n\u007f\n\nWhen a K3 surface has no fixed points, we will set g = 0 and, following the convention of [3], l = −1.\n2\n\n\fFor the other primes, we show that except in two cases, there is no crepant resolution, and that\nthese Calabi-Yau orbifolds do not come in mirror pairs.\n5. Construction\nConsider two pairs (X1 , ρ1 ) and (X2 , ρ2 ) each consisting of a Calabi-Yau manifold and a primitive\nnon-symplectic automorphism of order p. Pick a volume form ωi on each surface. Without loss\nof generality, we can assume that the characters induced by the action on the volume forms are\nidentical, i.e. ρ∗1 ω1 = ζp ω1 and ρ∗2 ω2 = ζp ω2 , for the same pth root of unity ζp . On the product\nvariety X = X1 × X2 , we get an induced action of Z/pZ × Z/pZ and a character map\nχ : Z/pZ × Z/pZ → C× : (ρi1 , ρj2 ) 7→ ζpi+j\nwhich determines the action on the volume form of X. Let G ∼\n= Z/pZ be the kernel of χ.\nDefinition 5.1. Given two pairs (X1 , ρ1 ) and (X2 , ρ2 ) as above, we call X/G the associated Borcea] of the quotient exists, we call it the associated BorceaVoisin orbifold. If a crepant resolution X/G\nVoisin manifold.\nThe case where p = 2, dim X1 = 1 and dim X2 = 2 is the classical Borcea-Voisin construction.\nNote that since G consists of automorphisms preserving the volume form of the product, the\nquotient still has a volume form. Moreover, all singularities are Gorenstein, thus, by the work of\nRoan [20], we can conclude that if the codimension of each component of the fixed locus of (ρ1 , ρ2 )\nhas codimension strictly less than 4, then such a resolution exists. In particular, this is the case\nwhen dim X ≤ 3.\n6. Orbifold cohomology\nWe start from the orbifold cohomology formula of Chen and Ruan [7]\nM\nM\n(6.1)\nH*,*\nH ∗−κ(g,Λ),∗−κ(g,Λ) (Λ)G\norb (X/G) =\ng∈Conj(G) Λ∈Φ(g)\n\nwhere Φ(g) is the set of irreducible components fixed by g, and κ(g, Λ) is the age of g at a point of\nΛ. Since the group G is cyclic of prime order, we can pick a generator γ and the formula simplifies\nto\np−1\nM M\ni\ni\nG\n∗,∗\nH ∗−κ(γ ,Λ),∗−κ(γ ,Λ) (Λ) .\nH*,*\n(X/G)\n=\nH\n(X)\n⊕\norb\nΛ∈Φ(γ) i=1\n\nTo linearize the notation we will make use of Hodge polynomials, i.e. h(X)(s, t) is an integral\npolynomial whose coefficient of bi-degree (i, j) is the dimension dim H i,j (X). Hence, what we need\nto determine, for each orbifold X, is the following Hodge polynomial:\n(6.2)\n\nhorb (X/G)(s, t) = h(X)G (s, t) +\n\np−1\nX X\ni\n(st)κ(γ ,Λ) h (Λ) (s, t).\n\nΛ∈Φ(γ) i=1\n\nIn the following sections we will compute individually each summand. We will start by the invariant\npart and then focus on the contribution coming from the fixed components together with their\ni\nassociated weight (st)κ(γ ,Λ) . Fixed components will be separated according to their codimension.\n3\n\n\f6.1. G-invariant part.\nLemma 6.1. Given p, assume that the K3 surface Xi is defined by the pair (ri , ai ) and let\ni\nλi = 22−r\np−1 . If Xi is an elliptic curve, p ∈ {2, 3} and Xi is unique.\n• When both Xi 's are K3 surfaces, the G-invariant part, h(X)G (s, t), decomposes as\n(6.3)\n1+(st)4 +s4 +t4 +(st3 +ts3 )(λ1 +λ2 −2)+(st+(st)3 )(r1 +r2 )+(st)2 (4−2(λ1 +λ2 )+r1 r2 +(p−1)λ1 λ2 )\nwhen p is odd, and as\n(6.4) 1+(st)4 +s4 +t4 +(st3 +ts3 )(λ1 +λ2 −4)+(st+(st)3 )(r1 +r2 )+(st)2 (8−2(λ1 +λ2 )+r1 r2 +λ1 λ2 )\nwhen p = 2.\n• When X1 is a K3 surface and X2 is an elliptic curve, the G-invariant part, h(X)G (s, t),\ndecomposes as\n(6.5)\n\n1 + (st)3 + s3 + t3 + (r1 + 1)(st + (st)2 ) + (λ1 − 1)(st2 + s2 t).\n\nProof. By Künneth's formula one can decompose the G-invariant cohomology of X as\nG\n\nh(X) (s, t) =\n\np−1\nX\n\nh(X1 )[ζpi ](s, t) × h(X2 )[ζpi ](s, t)\n\ni=0\n\nwhere H(Xi )[ζ] is the ζ eigenspace associated to the action of Gi = Z/pZ, generated by ρi . When\nXi is a K3 surface, we define λi,l = dim(H 1,1 (Xi ) ∩ H(Xi )[ζpl ]). Since the trace of ζ ∗ is integral, we\ni\nconclude that for l > 0, λi,1 = * * * = λi,p−1 = λi = 22−r\np−1 . Therefore, if p > 2,\n1. h(Xi )[1](s, t) = (1 + (st)2 ) + ri st,\n2. h(Xi )[ζ](s, t) = h(Xi )[ζ p−1 ](t, s) = s2 + (λi − 1)st, and\n3. h(Xi )[ζ l ](s, t) = λi st for 2 ≤ l ≤ p − 2\nwhile, if p = 2\n1. h(Xi )[1](s, t) = (1 + (st)2 ) + ri st,\n2. h(Xi )[−1](s, t) = h(Xi )[ζ p−1 ](t, s) = s2 + (λi − 2)st + t2 .\nWhen Xi is an elliptic curve, we only need to deal with p = 3 as this is the only possible prime\norder of complex multiplication besides 2. In that case,\n1. h(Xi )[1](s, t) = 1 + st,\n2. h(Xi )[ζ](s, t) = h(Xi )[ζ p−1 ](t, s) = s.\nThe final result follows from a direct computation.\n\n\u0003\n\n6.2. Contribution of fixed locus. Since the codimension of the fixed locus contributes to a\ndifference in grading in the contribution to cohomology, we will split the fixed locus accordingly.\nFor threefolds, we will have codimension 2 and 3 fixed loci and for fourfolds, we will have fixed loci\nof codimension 2,3 or 4. Before we proceed with our analysis, we will begin by a short study of the\npossible ages along the fixed components.\n6.2.1. Preamble on age. Let ρ be an automorphism of X\nthe linearization of the action of ρ at P as\n 2πik\n1\ne\n0\n0\n\n.\n..\n\n0\n\n0\n4\n\ne2πikn\n\nwhich fixes a point P . If we diagonalize\n\n\n\n\n\fwith 0 ≤ ki < 1, then we define the age of ρ along the fixed component Λ containing P as\nκ(ρ, Λ) =\n\nn\nX\n\nki .\n\ni=1\n\nLemma 6.2. The age of an element and its inverse at a given point are related by κ(ρ, Λ) +\nκ(ρ−1 , Λ) = codim(Λ, X).\nProof. If ρ linearizes to diag(1, . . . , 1, e2πikj+1 , . . . , e2πikn ), then, with respect to the same basis, ρ−1\ntakes the form diag(1, . . . , 1, e2πi(1−kj+1 ) , . . . , e2πi(1−kn ) ), where j = dim(Λ) and kl > 0 for l > j. \u0003\nCorollary 6.3. Let G be a group acting faithfully on a manifold X of dimension n ≥ 3, and whose\ntangent action at a fixed point lies in the special linear group. Take g an element different from the\nidentity, and Λ an irreducible component of the fixed locus of g. We have:\n1. κ(g, Λ) = 1 if Λ is of codimension 2.\n2. κ(g, Λ) ∈ {1, 2} if Λ is of codimension 3.\n3. κ(g, Λ) ∈ {1, 2, 3} if Λ is of codimension 4.\nProof. Note that when g ∈ G is a finite subgroup of SL, the age of g is an integer. Since g is\ndifferent from the identity and the action is faithful, κ(g, .) ≥ 1. The rest follows from the previous\nlemma.\n\u0003\n6.3. Threefolds. Given that the only possible prime orders for complex multiplication are 2 and 3,\nin this section we will only make use of K3 surfaces endowed with non-symplectic automorphisms of\norder 3. Also recall that an elliptic curve with complex multiplication of order 3 is defined uniquely.\nMoreover, the automorphism fixes 3 isolated points.\n6.3.1. Codimension 2.\nLemma 6.4. The contribution to the cohomology from the fixed curves on X is\n(6.6)\n\nh(S)(s, t) = 3 ((1 + st)(l1 + 1) + (s + t)g1 )\n\nProof. We know from [2] that for p = 3 there is at most one curve of non-zero genus. Recalling\nthat there are 3 fixed points on the elliptic curve, the result is immediate.\n\u0003\nFrom Lemma 6.2, we know that the age of any element along a fixed curve is 1 and this polynomial\nis thus weighted by (p − 1)st.\n6.3.2. Codimension 3. In this case, we are dealing with points and the Hodge polynomial for each\nfixed point is equal to 1. Counting them all, we get a contribution of\nh(P)(s, t) = 3p1 .\nMoreover, since we are in codimension 3, Lemma 6.2 tells us that if an element has age 1 at a point\nP , its inverse will have age 2. The weight of the contribution of the fixed points is thus\n(p − 1)\n\nst + (st)2\n.\n2\n\n6.4. Fourfolds.\n5\n\n\f6.4.1. Codimension 2. The dimension 2 part of the fixed locus on X consists of the product of\nthe fixed curves on each Xi . The fixed curves on Xi have as total Hodge polynomial h(Ci )(s, t) =\n(1 + st)(li + 1) + (s + t)(gi ). From Künneth's formula we get directly:\nLemma 6.5. The contribution to the cohomology from the fixed surfaces on X is\n(6.7)\nh(S)(s, t) = (1+(st)2 )(l1 +1)(l2 +1)+(s+t+s2 t+t2 s)[(1+l1 )g2 +(1+l2 )g1 ]+2st[(1+l1 )(1+l2 )+g1 g2 ].\nMoreover, we know from Corollary 6.3 that κ(., S) is identically equal to 1 and thus the above\npolynomial is weighted by (p − 1)(st).\n6.4.2. Codimension 3.\nLemma 6.6. The contribution to the cohomology from the fixed curves on X is\n(6.8)\n\nh(S)(s, t) = (1 + st) ((l1 + 1)p2 + (l2 + 1)p1 ) + (s + t) (g1 p2 + g2 p1 ) .\n\nProof. The result follows once again from Künneth's formula:\nh(C)(s, t) =\n\n2\nX\n\nh(Ci )(s, t) × h(P3−i )(s, t).\n\ni=1\n\n\u0003\n2\n\nSince κ(g, C) = 3−κ(g −1 , C) (Corollary 6.3), the above polynomial is weighted by (p−1) (st)+(st)\n.\n2\n6.4.3. Codimension 4. In this case, we are dealing with points and the Hodge polynomial for each\nfixed point is trivial:\nh(P)(s, t) = 1.\nOn the other hand, it is not automatic to deduce the weight coming from the age of the powers of\nthe generator at a given point. In this section, given a variety X, we will determine the integers\nNi (p), which are the number of times a power of the group generator has an age of i ∈ {1, 2, 3} at\nan isolated fixed point. The contribution to the cohomology will then be of\n3\nX\n\n(6.9)\n\nNi (p)(st)i .\n\ni=1\n\nFrom Lemma 6.2 and Corollary 6.3, we know that we only need to determine the number of times\na point comes with a shift of 2. Indeed, we have the relations\nN1 (p) = N3 (p)\nand\n3\nX\n\nNi (p) = (p − 1) × #{fixed points}.\n\ni=1\n\nLemma 6.7. The number of shifts of 2 given by powers of a generator γ at a fixed point of X of\ntype 1p (q1 + 1, −q1 ) × 1p (q2 + 1, −q2 ) is given by the entry (q1 , q2 ) of the matrix P2 (p):\n\n\n\u0013\n\u0012\n6 4 4\n\u0001\n4 2\n,\nP2 (7) = 4 6 2\nP2 (3) = 2 ,\nP2 (5) =\n2 4\n4 2 6\n6\n\n\f\n\n\n\n12 8 10 8 10 6\n10 6 8 8 6\n 8 12 6 8 10 6 \n 6 10 4 8 6 \n\n\n\n\n10 6 12 6 8 8 \n\n\n\n\nP2 (11) =  8 4 10 6 4  ,\nP2 (13) = \n\n8\n8\n6\n12\n6\n6\n\n\n 8 8 6 10 4 \n10 10 8 6 12 4 \n6 6 4 4 10\n6 6 8 6 4 12\n\n\n16 10 14 10 12 12 14 8\n10 16 8 12 10 10 12 10\n\n\n14 8 16 8 10 14 12 6 \n\n\n10 12 8 16 6 10 12 10\n\n,\nP2 (17) = \n\n12 10 10 6 16 8 10 8 \n12 10 14 10 8 16 10 8 \n\n\n14 12 12 12 10 10 16 6 \n8 10 6 10 8 8 6 16\n\n\n18 12 14 12 16 12 14 14 10\n12 18 8 14 14 10 12 16 8 \n\n\n14 8 18 8 12 12 14 10 10\n\n\n12 14 8 18 10 10 12 12 12\n\n\n\n16\n14\n12\n10\n18\n10\n12\n16\n8\nP2 (19) = \n\n\n12 10 12 10 10 18 8 12 8 \n\n\n14 12 14 12 12 8 18 10 10\n\n\n14 16 10 12 16 12 10 18 6 \n10 8 10 12 8 8 10 6 18\nProof. The computations are long and tedious but trivial. For example, one can notice that along\na diagonal, an element will always have a linearization of the form (ni + 1, p − ni , p − ni − 1, ni ) and\nthat the age will always be 2. Therefore, any element different from the identity in G will have the\nsame age at such a point.\n\u0003\nDefinition 6.8. Given a non-symplectic automorphism of order p acting on a K3 surface defined\nby the pair (r, a), we define vp (r) to be the p−1\n2 dimensional row vector of natural numbers whose\nth\ni entry is the number of fixed points of type 1p (i + 1, −i).\nThis vector can be read from Table 3 in the Appendix. Given P2 (p) and vp (ri ), it is easy to\ndetermine the number of times an element acts at a fixed point of X with a given age:\nLemma 6.9. The number of shifts by 2 is equal to\nN2 (p) = vp (r1 )P2 (p)vp (r2 )t\nLet αi be as in Table 3. We obtain as a direct consequence:\nCorollary 6.10. Given a pair of K3 surfaces defined by (r1 , a1 ) and (r2 , a2 ), we define αi as in\nTable 2. The number of shifts by 2 on the product is\n7. Topological types\nIn this section, we give the Hodge diamonds of the generalized Borcea-Voisin orbifolds. We write\ndown a formula for the Euler characteristic and give the range of values that are taken. All possible\nvalues that can be taken for (r1 , a1 ) and (r2 , a2 ) are listed in Appendix A.\n7.1. Dimension 3.\n7\n\n\fN2 (p)\n\np\n\n2N1 (p) = 2N3 (p)\n\n3\n2(α1 + 3)(α2 + 3)\n0\n5\n28α1 α2 + 38α1 + 38α2 + 52\n8α1 α2 + 10α1 + 10α2 + 12\n7\n110α1 α2 + 70α1 + 70α2 + 46\n20α2 + 8 + 40α1 α2 + 20α1\n11\n36 + 138α2 + 138α1 + 570α1 α2\n4 + 42α2 + 42α1 + 240α1 α2\n13\n28 − 154α2 − 154α1 + 1012α1 α2\n20 − 110α2 − 110α1 + 440α1 α2\n17 2480α1 α2 + 1150α2 + 1150α1 + 536 530α2 + 1120α1 α2 + 530α1 + 248\n19 314 + 1054α1 + 1054α2 + 3570α1 α2 476α1 + 476α2 + 136 + 1632α1 α2\nTable 1. Number of isolated points with an action of a given weight.\n\n7.1.1. Order 3.\n\u0001\nhi−1,j−1 (X/G) i,j=1... dim X+1\n\n\n\n1\n0\n0\n 0 7 + 4r − 3a 43 − 2r − 3a\n=\n 0 43 − 2r − 3a 7 + 4r − 3a\n1\n0\n0\n\nχ = −72 + 12r\n7.2. Dimension 4. The Hodge diamond of\n\n1\n 0\n\n 0\n\n 0\n1\nwhere a, . . . , f are defined below:\n\n\n1\n0 \n\n0 \n1\n\nthe Borcea-Voisin orbifold has the form\n\n0 0 0 1\na d e 0 \n\nd b d 0 \n\ne d a 0 \n0 0 0 1\n\n7.2.1. Order 2. For p = 2, unless (ri , ai ) = (10, 10) for either value of i, then\nr1 r2 r1 a2 a1 r2 a1 a2 3r1 a1 3r2 a2\n−\n−\n+\n+\n−\n+\n−\na = 1+\n4\n4\n4\n4\n2\n2\n2\n2\nb = 648 + a1 a2 − 30r2 − 30r1 − 12a2 − 12a1 + 3r1 r2\nr1 r2 a1 a2\nd = 22 −\n+\n+ 5r2 − 6a2 + 5r1 − 6a1\n2\n2\n11a1 11a2\nr1 a2 a1 a2 r1 r2 a1 r2 13r2 13r1\n+\n+\n+\n−\n−\n−\n−\ne = 161 +\n4\n4\n4\n4\n2\n2\n2\n2\nχ = 888 − 60r2 − 60r1 + 6r1 r2\nMoreover, −92 ≤ χ ≤ 888 and the smallest values of χ in absolute value are −6, 0 and 18.\nRemark. For p = 2, we have two special cases which correspond to either (ri , ai ) being either\nequal to (10, 8) or (10, 10).\n1. If (r1 , a1 ) = (10, 10), then S = U (2)⊕E8 (2) and the automorphism acts without fixed points.\nIn that case, only the first summand in Formula 6.2 contributes to the cohomology, and the\nHodge diamond simplifies to\n\n\n1\n0\n0\n0 1\n 0 10 + r2\n0 30 − r2 0 \n\n\n 0\n0 204\n0 0 \n\n\n 0 30 − r2\n0 10 + r2 0 \n1\n0\n0\n0 1\n8\n\n\fχ = 288\nNote that in this case, when r2 = 10, the Hodge diamond is completely symmetric and the\nmirror pairing is preserved as this topological class maps to itself.\n2. If (r1 , a1 ) = (10, 8), then S = U ⊕ E8 (2), and the fixed locus consists of two disjoint genus 1\ncurves. However, Table 2 and the genus formula A.1 tell us that the fixed locus consists of a\ngenus 2 curve and an isolated rational curve. This discrepancy between the prediction made\nby the formula and the actual fixed locus is however totally harmless for our calculations:\nthe total Hodge diamond in both cases is the same\n\u0014\n\u0015\n2 2\n2 2\nand our final results are not altered.\n7.2.2. Order 3. For p = 3,\n3 9r1\n9r2\n3r1 r2 r1 a2 a1 r2 a1 a2\na =\n+\n− a1 +\n− a2 +\n−\n−\n+\n2\n4\n4\n8\n2\n2\n2\nr1 a2 a1 r2\n−\n+ 2a1 a2\nb = 328 − 14r2 − 13a2 − 14r1 − 13a1 + 3r1 r2 −\n2\n2\n13a1 r1 r2 r1 a2 a1 r2\n13a2\n+ 5r1 −\n−\n−\n−\n+ a1 a2\nd = 22 + 5r2 −\n2\n2\n2\n4\n4\na1 r2 a1 a2 13r1\n11a1 13r2\n11a2 r1 a2 r1 r2 161\ne =\n+\n−\n−\n−\n−\n+\n+\n+\n4\n2\n4\n2\n4\n2\n4\n8\n2\nχ = 408 − 36r2 − 36r1 + 6r1 r2\nMoreover, there are 299 distinct topological families with −144 ≤ χ ≤ 1368 and the values of χ\nwhich are the closest to 0 are −48, 0 and 24.\n7.2.3. Order 5. For p = 5,\n25r2\n11r1 r2\n15 25r1\n+\n− 2a1 +\n− 2a2 +\n− r1 a2 − a1 r2 + a1 a2\na =\n4\n8\n8\n16\n3r1 a2 3a1 r2\n−\n+ 4a1 a2\nb = 172 − 4r2 − 15a2 − 4r1 − 15a1 + 4r1 r2 −\n2\n2\n15a2\n15a1 r1 r2 3r1 a2 3a1 r2\nd = 22 + 5r2 −\n+ 5r1 −\n−\n−\n−\n+ 2a1 a2\n2\n2\n2\n4\n4\n13r1\n11a1 13r2\n11a2 r1 a2 r1 r2 157\na1 r2\n+ a1 a2 −\n−\n−\n−\n+\n+\n+\ne =\n4\n8\n2\n8\n2\n4\n16\n4\n15\nχ = 174 − 21r2 − 21r1 + r1 r2\n2\nMoreover, there are 28 distinct topological families with 24 ≤ χ ≤ 1848.\n7.2.4. Order 7. For p = 7,\n139r2\n73r1 r2 3r1 a2 3a1 r2 3a1 a2\n97 139r1\n+\n− 3a1 +\n− 3a2 +\n−\n−\n+\na =\n18\n36\n36\n72\n2\n2\n2\n1112 10r2\n10r1\n47r1 r2 5r1 a2 5a1 r2\nb =\n+\n− 17a2 +\n− 17a1 +\n−\n−\n+ 6a1 a2\n9\n9\n9\n9\n2\n2\n17a1\nr1 r2 5r1 a2 5a1 r2\n17a2\n+ 5r1 −\n−\n−\n−\n+ 3a1 a2\nd = 22 + 5r2 −\n2\n2\n2\n4\n4\n11a1 13r2\n11a2 r1 a2 r1 r2 51\na1 r2 3a1 a2 13r1\n+\n−\n−\n−\n−\n+\n+\n+\ne =\n4\n2\n12\n2\n12\n2\n4\n24\n2\n9\n\n\f304 40\n40\n28\n− r2 − r1 + r1 r2\n3\n3\n3\n3\nMoreover, there are 15 distinct topological families 144 ≤ χ ≤ 2064.\nχ=\n\n7.2.5. Order 11. For p = 11,\n21r2\n67r1 r2 5r1 a2 5a1 r2 5a1 a2\n83 21r1\n+\n− 5a1 +\n− 5a2 +\n−\n−\n+\n10\n4\n4\n40\n2\n2\n2\n456 42r2\n42r1\n39r1 r2 9r1 a2 9a1 r2\nb =\n+\n− 21a2 +\n− 21a1 +\n−\n−\n+ 10a1 a2\n5\n5\n5\n5\n2\n2\n21a1\nr1 r2 9r1 a2 9a1 r2\n21a2\n+ 5r1 −\n−\n−\n−\n+ 5a1 a2\nd = 22 + 5r2 −\n2\n2\n2\n4\n4\na1 r2 5a1 a2 13r1\n11a1 13r2\n11a2 r1 a2 r1 r2 29\ne =\n+\n−\n−\n−\n−\n+\n+\n+\n4\n2\n20\n2\n20\n2\n4\n40\n2\n\na =\n\n12\n66\n264 12\n− r2 − r1 + r1 r2\n5\n5\n5\n5\nMoreover, there are 6 distinct topological families satisfying 96 ≤ χ ≤ 1896.\nχ=\n\n7.2.6. Order 13.\n\n\n\n\n\n\n\n1\n0\n0\n0 1\n0 404\n0\n0 0\n0\n0 1372\n0 0\n0\n0\n0 404 0\n1\n0\n0\n0 1\n\n\n\n\n\n\n\n\nχ = 2184\n7.2.7. Order 17.\n\n\n\n\n\n\n\n1\n0\n0\n0 1\n0 264\n0\n0 0\n0\n0 844\n0 0\n0\n0\n0 264 0\n1\n0\n0\n0 1\n\n\n\n\n\n\n\n\nχ = 1376\n7.2.8. Order 19.\n\n\n\n\n\n\n\n1\n0\n0\n0 1\n0 184\n0\n0 0\n0\n0 564\n0 0\n0\n0\n0 184 0\n1\n0\n0\n0 1\n\n\n\n\n\n\n\n\nχ = 936\n7.3. Fundamental groups. It follows from the argument in [10] that the fundamental group of\nour orbifolds is isomorphic to the quotient of G by the subgroup generated by elements fixing at\nleast a point. Since G is cyclic of prime order, either the fundamental group will be trivial, or it\nwill be cyclic of order p. Actually, all orbifolds will be simply connected except for p = 2 when at\nleast one of the surfaces is defined by (r = 10, a = 10), in which case there are no fixed points and\nthe fundamental group is Z/2Z.\n10\n\n\f8. On the mirror map\nVoisin [24] and Borcea [6] show how the Calabi-Yau threefolds which they construct come in\ntopological mirror pairs. It is easy to check from the above data that their result extends to\nfourfolds. Generalized Borcea-Voisin orbifolds with p = 2 admit crepant resolutions and come in\ntopological mirror pairs.\nProposition 8.1. The Borcea-Voisin fourfolds X and X̌ defined respectively by (r1 , a1 , r2 , a2 ) and\n(20 − r1 , a1 , 20 − r2 , a2 ) for p = 2 are topological mirrors, i.e.\nhp,q (X) = h4−p,q (X̌)\nMoreover, from the Euler characteristic formulas for the Borcea-Voisin orbifolds, one deduces\nimmediately that the above does not hold anymore for p odd2. Indeed, it is easy to check that\nthere is no integral constant m such that the map (r1 , r2 ) 7→ (m − r1 , m − r2 ) leaves the Euler\ncharacteristic invariant. Therefore, we can abandon any hope of finding a mirror map between\nBorcea-Voisin orbifolds for p > 2 in dimension 4. Similarly, one checks readily that for p = 3,\nBorcea-Voisin threefolds do not come in mirror pairs; there is no involution on the set of pairs (r, a)\nwhich sends a Hodge diamond to its reflection.\nThe non-closedness of the Borcea-Voisin family under mirror symmetry has several possible\nexplanations. We enumerate here the three main obstacles.\n1. For p > 5, there is no more symmetry of the type r ↔ 20 − r between the possible pairs\n(r, a) defining K3 surfaces with an order p non-symplectic automorphism. See e.g. Figure\n1. For p = 3 or 5, one can find an axis of symmetry (up to a few elements) among the pairs\n(r, a) but one can check that there is no topological relation binding the orbifolds which are\nbased on symmetric pairs.\n2. Mirror symmetry is predicted to exist for Calabi-Yau manifolds near a large complex structure\npoint. For the threefold case, p = 3, the elliptic curve is rigid. It is the quotient of the complex\nplane by the lattice generated by 1 and a primitive sixth root of unity. One can not endow\nit with a large complex structure. For p = 2, the involution exists for any complex curve of\ngenus 1 and there is thus no obstruction to deforming the complex structure.\n3. For the fourfolds, except when p = 2, the fixed locus contains isolated fixed points and there\nis, for that reason, no guaranteed crepant resolution. Actually, we can show that most of the\norbifolds which we construct have no crepant resolution:\nProposition 8.2. Let p > 2 and X be the Borcea-Voisin orbifold defined by (r1 , a1 , r2 , a2 ),\nthen X does not have a crepant resolution except when p = 3 and r1 = r2 = 2.\nProof. If X has a fixed point of type 1p (2, p − 1, 1, p − 2), we know from Batyrev-Dais [4] and\nReid [19] that there does not exist a crepant resolution. Such points exist as soon as both\nsurfaces involved in the construction have a fixed point of type 1p (2, p−1). Indeed, the product\npoint will have a linearized action under the product element in G of (2, p−1)×(2, p−1)−1 =\n(2, p − 1, p − 2, 1).\nFrom Table 3, we see that for p ∈ {3, 5, 7, 11}, any K3 surface admitting a non-symplectic\nautomorphism of order p has a fixed point of type 1p (2, p − 1) except for the surfaces where\np = 3 and r = 2. In the latter case, there are only fixed curves on each K3 surface and the\nassociated Borcea-Voisin orbifolds admit a crepant resolution.\n\u0003\n2For p = 3, one notices however that if two threefolds (resp. fourfolds) are based on the data (r, a) and (12 − r, a)\n(resp. (r1 , a1 , r2 , a2 ) and (12 − r1 , a1 , 12 − r2 , a2 )), their Euler characteristics are opposite (resp. identical).\n11\n\n\fThe above indices lead us to the belief that the mirrors of generalized Borcea-Voisin\norbifolds with p ≥ 3 will not come under this form. It would be interesting to see if they\ncould be englobed into a larger construction.\n\n12\n\n\fAppendix A. Possible non-symplectic actions on K3 surfaces\nWe enumerate hereunder (A.1) all possible primes p for which there exists a non-symplectic\nZ/pZ action on a K3 surface. Also, we enumerate all pairs (r, a) which determine the lattice of the\nK3 surfaces admitting such an action. The integer r gives the rank of the invariant part S of the\ncohomology under the group action and a is defined as det(S) = pa . For p = 2, a third invariant\nδ ∈ {0, 1} is needed. The elements corresponding to δ = 0 have been marked with a ∗ in the list.\nThe importance of r and a is that these two natural numbers completely determine the fixed\nlocus of the group action. Theorem A.1 hereunder, due to Artebani, Sarti and Taki, gives an\noverview of the state of the art. It encompasses the classification of involutions, done by Nikulin\n[16], of automorphisms of order 3, done by Artebani-Sarti [2] and Taki [22], of automorphisms of\norder 5 and 7, done by Artebani-Sarti-Taki [3], of automorphisms of order 11, done by OguisoZhang [17], and of automorphisms of order 13, 17 and 19 done by Vorontsov [25], Kondō [15] and\nby Oguiso-Zhang [18].\nTheorem A.1. [3, Theorem 0.1] Let S be a hyperbolic p-elementary lattice (p prime) of rank r\nwith det(S) = pa . Then S is isometric to the invariant lattice of a non-symplectic automorphism σ\nof order p on a K3 surface if and only if\n22 − r − (p − 1)a ∈ 2(p − 1)Z≥0\nMoreover, if σ is such automorphism, then its fixed locus X σ is the disjoint union of smooth curves\nand isolated points, and has the following form:\n\n\nifS ∼\n= U (2) ⊕ E8 (2)\n∅\nσ\nX = E1 ∪ E2\nifS ∼\n= U ⊕ E8 (2)\n\n\nC ∪ R1 ∪ . . . ∪ Rk ∪ {p1 , . . . , pn } otherwise\n\nwhere Ei is a smooth elliptic curve, Ri is a smooth rational curve, pi is a an isolated point, C is a\ncurve of genus\n22 − r − (p − 1)a\n(A.1)\ng=\n2(p − 1)\nand\np\n\n2\n\n3, 5, 7\n\n11\n\nn\n\n0\n\nk\n\nr−a\n2\n\n−2+(p−2)r\np−1\n2+r−(p−1)a\n2(p−1)\n\n2+9r\n10\n−2+r−10a\n20\n\n13 17 19\n9\n\n7\n\n5\n\n1\n\n0\n\n0\n\nTable 2. Number of fixed points and rational curves\nwith the convention that X σ contains no fixed curves if k = −1.\nTo determine the topological type of our Borcea-Voisin orbifolds, we also need to characterize\nthe fixed points of each action. Namely, given a prime p, an isolated fixed point of a non-symplectic\nautomorphism will be called of type 1p (i + 1, p − i)(i ∈ {0, . . . , p − 2}), if the action can locally be\nlinearized as\n\u0013\n\u0012 i+1\n0\nζp\n0\nζpp−1\nWe will denote by ni the number of such points. Artebani, Sarti and Taki [3] give us a complete\nlist of the number of such points in Table 3.\n13\n\n\fp\n\nα\n\n2 r − 10\nr−8\n3\n2\nr−6\n5\n4\nr−4\n7\n6\nr−2\n11\n10\nr+2\n13\n12\nr−6\n17\n16\nr−4\n19\n18\n\nn1\n\nn2\n\nα+3\n2α + 3 1 + α\n2α + 2 1 + 2α\n1 + 2α\n2α\n1 + 2α 1 + 2α\n2α\n2α\n2α\n2α\n\nn3\n\nn4\n\nn5\n\nn6\n\nn7\n\nn8\n\nα\n2α 1 + 2α\nα\n2α 2α − 1 2α − 2 α − 1\n2α\n2α\n2α + 1 2α + 2 2α + 3 α + 1\n2α 2α + 1 2α + 2 2α + 1 2α + 1\n2α\n\nn9\n\np\n\nα\n\n0\nα+3\n3α + 4\n5α + 3\n9α + 2\n11α − 2\n15α + 7\n17α + 5\n\nTable 3. Types of isolated fixed points\n\nA.1. Enumeration of cases.\nA.1.1. Order 2. (64 cases) (2,0)* (2,2)* (3,1) (3,3) (4,2) (4,4) (5,3) (5,5) (6,2)* (6,4)* (6,6) (7,3)\n(7,5) (7,7) (8,2) (8,4) (8,6) (8,8) (9,1) (9,3) (9,5) (9,7) (9,9) (10,0)* (10,2)* (10,4)* (10,6)* (10,8)*3\n(10,10)*4 (11,1) (11,3) (11,5) (11,7) (11,9) (11,11) (12,2) (12,4) (12,6) (12,8) (12,10) (13,3) (13,5)\n(13,7) (13,9) (14,2)* (14,4)* (14,6)* (14,8) (15,3) (15,5) (15,7) (16,2) (16,4) (16,6) (17,1) (17,3)\n(17,5) (18,0)* (18,2)* (18,4)* (19,1) (19,3) (20,2)\nA.1.2. Order 3. (24 cases) (2,0) (2,4) (4,1) (4,3) (6,2) (6,4) (8,1) (8,3) (8,5) (8,7) (10,0) (10,2)\n(10,4) (10,6) (12,1) (12,3) (12,5) (14,2) (14,4) (16,1) (16,3) (18,0) (18,2) (20,1)\nA.1.3. Order 5. (7 cases) (2,1) (6,2) (6,4) (10,1) (10,3) (14,2) (18,1)\nA.1.4. Order 7. (5 cases) (4,1) (4,3) (10,0) (10,2) (16,1)\nA.1.5. Order 11. (3 cases) (2,0) (2,2) (12,1)\nA.1.6. Order 13. (1 case) (10,1)\nA.1.7. Order 17. (1 case) (6,1)\nA.1.8. Order 19. (1 case) (4,1)\nAlternatively, all cases are displayed on Figure 1 for p = 2 and Figure 2 for p > 2.\nPSfrag replacements\n\na\n10\n\n1\nr 20\n\n0\n\n10\nδ=1\nδ=0\n\nFigure 1. All possible pairs (r, a) for p = 2\n3Fixed locus consists of two disjoint genus 1 curves.\n4Fixed locus is empty.\n14\n\n\fa\n5\n\n1\nr\n\n18\np=3\np=5\np=7\np=13\np=17\n\n0\n\n10\np=11\np=19\n\nFigure 2. All possible pairs (r, a) for p > 2\nReferences\n[1] Mitsuko Abe and Masamichi Sato. Calabi-Yau manifolds by Borcea-Voisin method. J. Math. Phys., 41(5):3045–\n3056, 2000.\n[2] Michela Artebani and Alessandra Sarti. Non-symplectic automorphisms of order 3 on K3 surfaces. Math. Ann.,\n342(4):903–921, 2008.\n[3] Michela Artebani, Alessandra Sarti, and Shingo Taki. K3 surfaces with non-symplectic automorphisms of prime\norder. 2009, arXiv:0903.3481.\n[4] Victor V. Batyrev and Dimitrios I. Dais. Strong McKay correspondence, string-theoretic Hodge numbers and\nmirror symmetry. Topology, 35(4):901–929, 1996.\n[5] Ciprian Borcea. Calabi-Yau threefolds and complex multiplication. In Essays on mirror manifolds, pages 489–\n502. Int. Press, Hong Kong, 1992.\n[6] Ciprian Borcea. K3 surfaces with involution and mirror pairs of Calabi-Yau manifolds. In Mirror symmetry, II,\nvolume 1 of AMS/IP Stud. Adv. Math., pages 717–743. Amer. Math. Soc., Providence, RI, 1997.\n[7] Weimin Chen and Yongbin Ruan. A new cohomology theory of orbifold. Comm. Math. Phys., 248(1):1–31, 2004.\n[8] S. Cynk and K. Hulek. Higher-dimensional modular Calabi-Yau manifolds. Canad. Math. Bull., 50(4):486–503,\n2007.\n[9] Jimmy Dillies. Toroidal orbifolds à la Vafa-Witten. Adv. Theor. Math. Phys., 11(4):683–705, 2007.\n[10] L. Dixon, J. A. Harvey, C. Vafa, and E. Witten. Strings on orbifolds. Nuclear Phys. B, 261(4):678–686, 1985.\n[11] Ron Donagi and Alon E. Faraggi. On the number of chiral generations in Z 2 × Z 2 orbifolds. Nuclear Phys. B,\n694(1-2):187–205, 2004.\n[12] Ron Donagi and Katrin Wendland. On orbifolds and free fermion constructions. J. Geom. Phys., 59(7):942–968,\n2009.\n[13] Alice Garbagnati. New families of calabi-yau 3-folds without maximal unipotent monodromy, May 2010.\n[14] Alice Garbagnati and Bert van Geemen. The Picard-Fuchs equation of a family of Calabi-Yau threefolds without\nmaximal unipotent monodromy. Int. Math. Res. Not. IMRN, (16):3134–3143, 2010.\n[15] Shigeyuki Kondō. Automorphisms of algebraic K3 surfaces which act trivially on Picard groups. J. Math. Soc.\nJapan, 44(1):75–98, 1992.\n[16] V. V. Nikulin. Quotient-groups of groups of automorphisms of hyperbolic forms by subgroups generated by\n2-reflections. Algebro-geometric applications. In Current problems in mathematics, Vol. 18, pages 3–114. Akad.\nNauk SSSR, Vsesoyuz. Inst. Nauchn. i Tekhn. Informatsii, Moscow, 1981.\n[17] Keiji Oguiso and De-Qi Zhang. K3 surfaces with order 11 automorphisms. 1999, arXiv:math/9907020v1.\n[18] Keiji Oguiso and De-Qi Zhang. On Vorontsov's theorem on K3 surfaces with non-symplectic group actions. Proc.\nAmer. Math. Soc., 128(6):1571–1580, 2000.\n[19] Miles Reid. La correspondance de McKay. Astérisque, (276):53–72, 2002. Séminaire Bourbaki, Vol. 1999/2000.\n[20] Shi-Shyr Roan. Minimal resolutions of Gorenstein orbifolds in dimension three. Topology, 35(2):489–508, 1996.\n[21] Jan Christian Rohde. Maximal automorphisms of Calabi-Yau manifolds versus maximally unipotent monodromy.\nManuscripta Math., 131(3-4):459–474, 2010.\n[22] Shingo Taki. Classification of non-symplectic automorphisms of order 3 on K3 surfaces. 2008, arXiv:0802.1956.\n[23] Cumrun Vafa and Edward Witten. On orbifolds with discrete torsion. J. Geom. Phys., 15(3):189–214, 1995.\n[24] Claire Voisin. Miroirs et involutions sur les surfaces K3. Astérisque, (218):273–323, 1993. Journées de Géométrie\nAlgébrique d'Orsay (Orsay, 1992).\n[25] S. P. Vorontsov. Automorphisms of even lattices arising in connection with automorphisms of algebraic K3surfaces. Vestnik Moskov. Univ. Ser. I Mat. Mekh., (2):19–21, 1983.\n15\n\n\fUniversity of Utah, Department of Mathematics, Salt Lake City, UT,\nE-mail address: dillies@math.utah.edu\n\n16\n\n\f"}