{"id": "http://arxiv.org/abs/0811.0512v1", "guidislink": true, "updated": "2008-11-04T14:07:54Z", "updated_parsed": [2008, 11, 4, 14, 7, 54, 1, 309, 0], "published": "2008-11-04T14:07:54Z", "published_parsed": [2008, 11, 4, 14, 7, 54, 1, 309, 0], "title": "Polarimetric Diagnostics of Unresolved Chromospheric Magnetic Fields", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.0602%2C0811.3045%2C0811.0512%2C0811.3898%2C0811.0684%2C0811.1650%2C0811.4511%2C0811.0355%2C0811.3264%2C0811.0583%2C0811.1813%2C0811.1918%2C0811.2582%2C0811.3609%2C0811.3602%2C0811.2897%2C0811.2189%2C0811.2838%2C0811.1862%2C0811.2944%2C0811.0241%2C0811.1599%2C0811.2430%2C0811.0760%2C0811.0367%2C0811.2527%2C0811.4328%2C0811.4262%2C0811.3901%2C0811.4220%2C0811.2456%2C0811.2144%2C0811.2003%2C0811.3706%2C0811.3006%2C0811.0118%2C0811.0113%2C0811.0846%2C0811.1517%2C0811.1983%2C0811.4677%2C0811.3940%2C0811.3894%2C0811.1563%2C0811.4465%2C0811.3433%2C0811.2668%2C0811.3943%2C0811.1354%2C0811.2343%2C0811.1140%2C0811.0080%2C0811.4581%2C0811.2412%2C0811.4238%2C0811.4181%2C0811.4295%2C0811.2611%2C0811.0317%2C0811.2546%2C0811.3998%2C0811.2467%2C0811.2776%2C0811.4245%2C0811.3983%2C0811.2497%2C0811.4296%2C0811.1180%2C0811.3072%2C0811.2111%2C0811.0322%2C0811.1807%2C0811.0565%2C0811.2437%2C0811.2432%2C0811.1267%2C0811.1708%2C0811.0388%2C0811.2230%2C0811.1801%2C0811.2816%2C0811.0465%2C0811.1660%2C0811.2907%2C0811.2705%2C0811.1870%2C0811.2951%2C0811.4552%2C0811.2092%2C0811.2399%2C0811.2594%2C0811.0021%2C0811.2295%2C0811.1518%2C0811.1052%2C0811.3878%2C0811.2936%2C0811.2240%2C0811.0122%2C0811.4394%2C0811.2261&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Polarimetric Diagnostics of Unresolved Chromospheric Magnetic Fields"}, "summary": "For about a decade, spectro-polarimetry of HeI 10830 has been applied to the\nmagnetic diagnostics of the solar chromosphere. This resonance line is very\nversatile, as it is visible both on disk and in off-limb structures, and it has\na good sensitivity to both the weak-field Hanle effect and the strong-field\nZeeman effect. Recent observations of an active-region filament showed that the\nlinear polarization was dominated by the transverse Zeeman effect, with very\nlittle or no hint of scattering polarization. This is surprising, since the HeI\nlevels should be significantly polarized in a conventional scattering scenario.\nTo explain the observed level of atomic depolarization by collisional or\nradiative processes, one must invoke plasma densities larger by several orders\nof magnitude than currently known values for prominences. We show that such\ndepolarization can be explained quite naturally by the presence of an\nunresolved, highly entangled magnetic field, which averages to give the ordered\nfield inferred from spectro-polarimetric data, over the typical temporal and\nspatial scales of the observations. We present a modeling of the polarized HeI\n10830 in this scenario, and discuss its implications for the magnetic\ndiagnostics of prominences and spicules, and for the general study of\nunresolved magnetic field distributions in the solar atmosphere.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.0602%2C0811.3045%2C0811.0512%2C0811.3898%2C0811.0684%2C0811.1650%2C0811.4511%2C0811.0355%2C0811.3264%2C0811.0583%2C0811.1813%2C0811.1918%2C0811.2582%2C0811.3609%2C0811.3602%2C0811.2897%2C0811.2189%2C0811.2838%2C0811.1862%2C0811.2944%2C0811.0241%2C0811.1599%2C0811.2430%2C0811.0760%2C0811.0367%2C0811.2527%2C0811.4328%2C0811.4262%2C0811.3901%2C0811.4220%2C0811.2456%2C0811.2144%2C0811.2003%2C0811.3706%2C0811.3006%2C0811.0118%2C0811.0113%2C0811.0846%2C0811.1517%2C0811.1983%2C0811.4677%2C0811.3940%2C0811.3894%2C0811.1563%2C0811.4465%2C0811.3433%2C0811.2668%2C0811.3943%2C0811.1354%2C0811.2343%2C0811.1140%2C0811.0080%2C0811.4581%2C0811.2412%2C0811.4238%2C0811.4181%2C0811.4295%2C0811.2611%2C0811.0317%2C0811.2546%2C0811.3998%2C0811.2467%2C0811.2776%2C0811.4245%2C0811.3983%2C0811.2497%2C0811.4296%2C0811.1180%2C0811.3072%2C0811.2111%2C0811.0322%2C0811.1807%2C0811.0565%2C0811.2437%2C0811.2432%2C0811.1267%2C0811.1708%2C0811.0388%2C0811.2230%2C0811.1801%2C0811.2816%2C0811.0465%2C0811.1660%2C0811.2907%2C0811.2705%2C0811.1870%2C0811.2951%2C0811.4552%2C0811.2092%2C0811.2399%2C0811.2594%2C0811.0021%2C0811.2295%2C0811.1518%2C0811.1052%2C0811.3878%2C0811.2936%2C0811.2240%2C0811.0122%2C0811.4394%2C0811.2261&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "For about a decade, spectro-polarimetry of HeI 10830 has been applied to the\nmagnetic diagnostics of the solar chromosphere. This resonance line is very\nversatile, as it is visible both on disk and in off-limb structures, and it has\na good sensitivity to both the weak-field Hanle effect and the strong-field\nZeeman effect. Recent observations of an active-region filament showed that the\nlinear polarization was dominated by the transverse Zeeman effect, with very\nlittle or no hint of scattering polarization. This is surprising, since the HeI\nlevels should be significantly polarized in a conventional scattering scenario.\nTo explain the observed level of atomic depolarization by collisional or\nradiative processes, one must invoke plasma densities larger by several orders\nof magnitude than currently known values for prominences. We show that such\ndepolarization can be explained quite naturally by the presence of an\nunresolved, highly entangled magnetic field, which averages to give the ordered\nfield inferred from spectro-polarimetric data, over the typical temporal and\nspatial scales of the observations. We present a modeling of the polarized HeI\n10830 in this scenario, and discuss its implications for the magnetic\ndiagnostics of prominences and spicules, and for the general study of\nunresolved magnetic field distributions in the solar atmosphere."}, "authors": ["R. Casini", "R. Manso Sainz", "B. C. Low"], "author_detail": {"name": "B. C. Low"}, "author": "B. C. Low", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/701/1/L43", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0811.0512v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.0512v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.0512v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.0512v1", "arxiv_comment": null, "journal_reference": "Astrophys.J.701:L43-L46,2009", "doi": "10.1088/0004-637X/701/1/L43", "fulltext": "Polarimetric Diagnostics of Unresolved Chromospheric Magnetic Fields\nR. Casini,a R. Manso Sainz,b B. C. Lowa\n\narXiv:0811.0512v1 [astro-ph] 4 Nov 2008\n\na High\n\nAltitude Observatory, National Center for Atmospheric Research,1 P.O. Box 3000,\nBoulder, CO 80307-3000\nb Instituto de Astrofı́sica de Canarias, c/ Vı́a Láctea s/n, La Laguna, Tenerife, E-38200 Spain\nABSTRACT\nFor about a decade, spectro-polarimetry of He I λ10830 has been applied to the\nmagnetic diagnostics of the solar chromosphere. This resonance line is very versatile,\nas it is visible both on disk and in off-limb structures, and it has a good sensitivity\nto both the weak-field Hanle effect and the strong-field Zeeman effect. Recent observations of an active-region filament showed that the linear polarization was dominated\nby the transverse Zeeman effect, with very little or no hint of scattering polarization.\nThis is surprising, since the He I levels should be significantly polarized in a conventional scattering scenario. To explain the observed level of atomic depolarization by\ncollisional or radiative processes, one must invoke plasma densities larger by several\norders of magnitude than currently known values for prominences. We show that such\ndepolarization can be explained quite naturally by the presence of an unresolved, highly\nentangled magnetic field, which averages to give the ordered field inferred from spectropolarimetric data, over the typical temporal and spatial scales of the observations. We\npresent a modeling of the polarized He I λ10830 in this scenario, and discuss its implications for the magnetic diagnostics of prominences and spicules, and for the general\nstudy of unresolved magnetic field distributions in the solar atmosphere.\nSubject headings: Sun: chromosphere – Sun: prominences – Sun: magnetic fields – line:\nprofiles – polarimetry\nMagnetic diagnostics of the chromosphere, and in particular of prominences and spicules, is\nreceiving increasing attention and motivation from the solar community. There is in fact a growing agreement that mapping the magnetic field in these critical regions of the solar atmosphere is\nfundamental for our understanding of processes like coronal heating, the acceleration of the solar\nwind, and the release of coronal mass ejections, that have a direct influence on the heliosphere and\non the associated phenomena of space weather. Despite the strong demand for these critical observations, there have been relatively few attempts to measure magnetic fields in the chromosphere\nand corona. This is mainly due to the heavy science requirements imposed on spectro-polarimetric\n1\n\nThe National Center for Atmospheric Research is sponsored by the National Science Foundation.\n\n\f–2–\ninstrumentation by this type of observations, and to the intrinsic difficulty of the inversion and\ninterpretation of scattering polarization data.\nSpectral line polarization is produced when symmetry-breaking processes occur in the interaction of radiation with matter. These can be due to the presence of external magnetic or electric\nfields (Zeeman and Stark effects), or an anisotropy in the excitation of the atoms (by radiation or\nparticles) leading to scattering polarization. We can expect both types of processes to be always\npresent in the solar atmosphere. However, their corresponding polarization signals differ significantly. In particular, the presence of unresolved fields affects those signals in characteristic ways.\nFor example, for a completely random distribution of magnetic fields within the resolution element\nof the observations, the polarization by the Zeeman effect must vanish in the mean, whereas the\nscattering polarization is only reduced in amplitude by a characteristic factor of 1/5 with respect\nto the zero-field case. When both processes occur, and the random magnetic field has a non-zero\nmean, the observed signal will be a complex mix of Zeeman effect and scattering polarization, with\na significant depolarization contributed by the random part of the magnetic field.\nRecent observations of the He I multiplet at 1083 nm in an active-region (AR) filament (Kuckein et al.\n2009) have shown that the linear polarization was dominated by the transverse Zeeman effect, corresponding to magnetic fields in the 500 G–1000 G range. The modeling of the forward-scattered\nradiation of He I λ10830, under the assumption that the filament plasma is illuminated by the\nunderlying photosphere, indicates instead that the linear polarization should be significantly affected by the atomic alignment of the upper term 2 3 P, induced by radiation anisotropy, even in\nthe presence of field strengths of the order of 103 G. A basic assumption of the Zeeman-effect model\nis that the atomic levels of He I are \"naturally\" populated, and therefore completely depolarized. In\ncontrast, in the scattering-polarization model, which includes atomic polarization, we were forced\nto introduce an ad-hoc reduction factor for the radiation anisotropy (varying between 0 and 1) in\norder to reproduce the observed depolarization of the He I levels. Obviously both models lack a\nphysical basis for such depolarization, which is the question taken up in this Letter.\nThe characteristic rate, γ, at which atomic polarization is generated in the levels of a spectral\nline by resonance scattering, is inversely proportional to the radiative lifetimes of the levels. In\nparticular, for He I λ10830, γu ∼ Aul ≈ 107 s−1 and γl ∼ Blu J, where Aul and Blu are the\nEinstein coefficients, respectively for spontaneous emission and absorption, between the upper (u)\nand lower (l) levels, and J is the average intensity of the radiation field. If we assume J ≈\n(1/2) Bν (T =5800 K), then γl ≈ (3/20) γu .\nOnce created, atomic polarization is not easily destroyed, unless competing processes (e.g.,\nexternal fields, collisions, radiative ionization and recombination) modify the polarization of the\natomic levels at a much higher rate than both γl and γu . A strong magnetic field (i.e., with\nLarmor frequency νL ≫ γl,u ) can depolarize atomic levels (through the Hanle effect) very efficiently,\nalthough the degree of residual polarization strongly depends on the geometry of the field. For\nexample, scattering polarization is completely destroyed by a strong magnetic field with inclination\n\n\f–3–\n3\n\nS\n\n(H e\n1\n\n+\n\n+ e -)\n3\n\n3 4 2 .2 n m\n\n3\n\n3\n\nS\n\n3\n\n3\n\nP\n\n3\n\nD\n\n3 2 1\n\n2 1 0\n\n1\n\n5 8 7 .6 n m\n7 0 6 .5 n m\n\n3 8 8 .9 n m\n\n2\n\n3\n\nP\n\n2 1 0\n\n1 0 8 3 n m\n\n2\n\n3\n\nS\n1\n\nFig. 1.- Model atom for the statistical equilibrium of the triplet species of He I. The lowest\nfive terms constitute the system of bound-bound transitions. The model is extended to include\nphoto-ionization and recombination involving the 3 P states, by adding a fictitious bound state 3 S1\ncorresponding to the ground state of He II.\n√\nθB = arccos 1/ 3 ≈ 54.7◦ from the direction of illumination. This effect may be invoked to explain\nthe AR filament observations described in Kuckein et al. (2009). However, those authors report\nprofiles showing strong atomic depolarization even for nearly horizontal magnetic fields.\nAtomic collisions with an isotropic distribution of perturbers (neutral or charged) are a possible\nmechanism of atomic depolarization. 1) Inelastic collisions with electrons are not significant for the\nstatistical equilibrium of He I at the typical densities of prominences (N ∼ 1010 –1011 cm−3 ). The\nobservation of scattering polarization at the limb in these structures also points to the fact that\natomic excitation is dominated by resonance scattering rather than thermal processes. It is possible\nthat AR filaments may be significantly denser than quiescent prominences, leading to a larger\ncontribution of thermal processes. However, following van Regemorter (1962), collisional excitation\nof He I λ10830 by electrons would require ne ≈ 4 × 1013 cm−3 , in order to be comparable with\nradiative excitation. This would imply gas densities 3 to 4 orders of magnitude larger than currently\nknown values in quiescent prominences (e.g., Tandberg-Hannsen 1995) for electron collisions to\ndominate the formation of He I. 2) We can estimate the rate of elastic collisions of He I atoms in the\n3 P state with neutral hydrogen, using γ ∼ hσvi n ≈ 8×10−9 n cm3 s−1 (Lamb & Ter Haar 1971).\nH\nH\nH\nHence, to efficiently depolarize the upper levels of He I λ10830 by collisions with neutral hydrogen\nit should be nH ≫ 1015 cm−3 . 3) Elastic collisions with electrons have received little attention in\nthe literature. Hirabayashi et al. (1988) report experimental cross-sections at T = 2000 K for Ne I\nin the 2p2 level. If we extend their results to the case of He I at plasma temperatures T ∼ 10 000 K,\n\n\f–4–\n\nFig. 2.- Photo-ionization rates for the lowest 3 P terms (left) and 3 S terms (right) of neutral\nhelium, as a function of the temperature of a Planckian illumination. The thick lines correspond\nto the 2 3 X terms, and the thin lines to the 3 3 X terms.\nwe find γeel. ∼ 10−6 ne cm3 s−1 . Efficient depolarization of the upper state of He I λ10830 would\nthen imply ne ≫ 1013 cm−3 , at which line excitation by thermal electrons should dominate over\nradiative excitation (see above). In conclusion, collisional depolarization of the He I levels seems\nto consistently require plasma densities that are exceptionally large for a typical prominence. On\nthe other hand, the densities of AR filaments are poorly known, and the possibility of such high\nplasma densities merits further investigation.\nWe consider next the role of radiative processes like photo-ionization and recombination for\nthe depolarization of He I levels. Figure 1 illustrates the atomic model commonly employed\nfor the study of resonance scattering polarization in He I lines (e.g., Landi Degl'Innocenti 1982;\nLópez Ariste & Casini 2002; Asensio Ramos, Trujillo Bueno, & Landi Degl'Innocenti 2008). This\nmodel has been successfully applied to interpret the Stokes profiles of the D3 line at 587.6 nm in\nsolar prominences (Bommier & Sahal-Bréchot 1978; Landi Degl'Innocenti 1982; Casini et al. 2003),\nand in more recent years to the magnetic diagnostics of quiescent prominences and filaments observed at 1083 nm (Trujillo Bueno et al. 2002; Merenda et al. 2006). The system of bound-bound\ntransitions involves the lowest five terms of the triplet species of He I. In order to include photoioniziation and recombination in this model, we added a fictitious bound state, 3 S1 , corresponding\nto the ground level of He II plus a free electron (with spin parallel to that of the He II ion). The\nR∞\ndepopulation rate by photo-ionization is given by γpi = χ/h dν (4πaν /hν) J(ν), where J(ν) is the\nintensity of the ionizing radiation averaged over the unit sphere, and χ is the ionization potential.\nThe ionization cross-section, aν , for various atomic terms of He I is tabulated by the TOPbase\nproject (e.g., Bauman et al. 2005). In the case of the 2 3 P term, the frequency range over which\nthe cross-section is tabulated goes from the ionization threshold up to ∼ 3.7 nm. Unfortunately,\n\n\f–5–\nthe mean intensity of the solar radiation below the ionization wavelength of 342.2 nm is not well\nknown. UV observations of the solar atmosphere have traditionally focused on limited spectral\nranges of particular interest. More complete datasets, covering the whole UV spectrum down to\nλ ∼ 1 nm (Eparvier & Woods 2003), are integrated over the solar disk, and do not distinguish\nthe output of the quiet Sun from that of active regions (although they account for variability of\nthe irradiance during the solar cycle). Figure 2 shows the photo-ionization rate, γpi , of the He I\nterms as a function of the effective (Planckian) temperature of the plasma contributing the ionizing\nradiation. We see that γpi ∼ γu at effective temperatures of 105 K or larger. On the other hand,\nthe effective temperature of the UV emitting solar plasma, as estimated by the integrated number\nof UV photons detected above the Earth's atmosphere (Eparvier & Woods 2003), is smaller by at\nleast one order of magnitude. Therefore the ionizing UV radiation cannot play a major role in the\ndepolarization of the He I λ10830 levels.\nThe depolarizing mechanisms considered above seem unable to efficiently destroy atomic polarization generated by resonance scattering, unless one can accept a radical revision of plasma\ndensity estimates in AR filaments. The possibility remains that in the AR filament described by\nKuckein et al. (2009) atomic polarization was not generated at all. We considered whether the\ncenter-to-limb variation (CLV) of the solar atmosphere, which dominates the anisotropy of the\nilluminating radiation at low heights, may be significantly different in an active region, because of\nenhanced lateral illumination coming from plages and/or a brighter transition region. However,\nthe few measurements of the CLV in active regions (e.g., Sánchez Cuberes et al. 2002) covering the\nnear-infrared solar spectrum do not seem to support this possibility.\nTrujillo Bueno & Asensio Ramos (2007) have proposed that the radiation inside an optically\nthick filament could be nearly isotropic, and therefore unable to induce atomic polarization. By\nmodeling the filament as a free-standing, plane-parallel slab of optical thickness τ ∼ 1 and constant\nsource function, S, illuminated by the underlying photosphere with intensity I0 , they find that\nthe radiation anisotropy inside the slab may be significantly reduced and even become negative\n(because the illumination is predominantly horizontal). In particular, when S ≈ I0 , the anisotropy\ninside the filament vanishes. However, if the formation of He I λ10830 is dominated by scattering\n(γeinel. /γu ∼ 0.002 for ne ∼ 1011 cm−3 typical of prominences), the source function must be modH\neled accordingly. For example, simply assuming S ≈ (dΩ/4π) p(cos Θ) I, where p(cos Θ) is the\nRayleigh phase function, the anisotropy rises sharply from about 40% of its optically thin limit close\nto the lower boundary, to well above the optically thin limit at the free upper boundary. Thus, the\nanisotropy inside the slab does fall below the optically thin limit, but complete isotropy is never\nattained. Therefore, although a careful radiative transfer treatment of this problem is important,\nthe atomic depolarization of He I may not depend only on that. Moreover, the inversions presented\nby Kuckein et al. (2009) indicated that the average optical depth of the filament was sizably smaller\nthan 1, further reducing the depolarizing role of radiative transfer.\nThe preceeding analysis motivated us to consider a mechanism of depolarization not commonly\nincluded in polarimetric diagnostics, namely, that the depolarization of the He I levels is due\n\n\f–6–\n\nFig. 3.- Quasi-random magnetic field model (right), obtained by adding a perfectly isotropic\n(random) field, Biso , to the inferred mean field, hBi (left).\nto the presence of a significant random component in the magnetic field inferred from spectropolarimetric observations. Both observation and theory support the idea that solar magnetic fields,\neven in the quasi-steady state, are chaotic and dynamic on small spatial and temporal scales. The\nquiescent-prominence movies made by Hinode/SOT at unprecedented high temporal and spatial\nresolutions have revealed the extreme complexity and rapid evolution of filamentary prominence\nplasma (Berger et al. 2008). The long lifetime of a quiescent prominence, days to weeks, implies\na large-scale, stable magnetic topology, but which is separate from its significantly entangled and\nrapidly evolving structures at subarsecond scales. MHD waves and oscillations, together with rising\nand descending plumes, develop ceaselessly in the macroscopic prominence structure. Although the\nAR filament described by Kuckein et al. (2009) is a class of prominence distinct from the quiescent\nprominences, we may expect the average field inferred from observation to be co-existing with a\nsmall-scale, random component of a comparable field intensity. In the extremely low-β, electrically\nhighly conducting environment of the AR atmosphere above the photosphere, current sheets are\nexpected to form densely within any volume pervaded by a magnetic field endowed with a complex\ntopology (Parker 1994; Janse & Low 2009). As these sheets dissipate to heat the atmosphere\nquiescently, new sheets form without necessarily producing a major flare. The small-scale and\nrapidly evolving fields associated with a complexity of current sheets are naturally of an intensity\ncomparable to the mean field, and could be the origin of the quasi-random magnetic field we\nconsider here.\nFollowing this picture, we have calculated the emergent Stokes profiles from a homogeneous\nslab, assuming that the He I atoms are subject to the mean field inferred from the observations\nplus a completely random (hence, isotropic) field of a given strength. This is also equivalent to\nassuming a specific non-isotropic distribution of magnetic fields with varying strength, resulting\nexactly in the observed mean field (Fig. 3). It can be argued that this model is very likely an\noversimplification of the real, quasi-random field occurring in prominences. However, its main\n\n\f–7–\n\nFig. 4.- Examples of Stokes profiles of He I λ10830 observed on the disk, in the presence of a nearly\nhorizontal magnetic field plus a completely isotropic field of various strengths. Left: hBi = 700 G,\nBiso = 0 G (continuous curve), 200 G (dotted curve), 500 G (dashed curve), 1000 G (dashed-dotted\ncurve). Right: hBi = 20 G, Biso = 0 G (continuous curve), 10 G (dotted curve), 20 G (dashed\ncurve), 100 G (dashed-dotted curve).\npurpose is to illustrate in the simplest way the depolarizing effect of such a field. There is no\ndifficulty in principle in calculating the same effect also for more complicated field distributions.\nFigure 4 (left) shows the emergent Stokes profiles for such a distribution of magnetic fields, resulting\nin an almost horizontal mean field of 700 G, similar to those described by Kuckein et al. (2009). The\nfour overplotted profiles illustrate the depolarizing effect induced by the inclusion of an isotropic\nfield of 200, 500, and 1000 G, as well as the case where only the mean field is present. The level\nof atomic depolarization inferred from the observations corresponds to an isotropic field between\n500 and 1000 G, in agreement with the proposed picture of a very entangled, strong field occurring\nin the filament plasma. Figure 4 (right) also shows the expected effects of atomic depolarization\nin the presence of a quasi-random field averaging to a nearly horizontal, ordered magnetic field\nwith a strength of 20 G, typical of quiescent prominences and spicules. Especially at such small\nfield strengths, the inference of the magnetic field by the Hanle effect becomes very sensitive to the\npresence of additional atomic depolarizing processes.\nThe successful explanation of atomic depolarization by a quasi-random magnetic field stresses\nthe importance to include unresolved fields in the polarimetric diagnostic investigation of the solar\natmosphere. The depolarization effect of a completely turbulent magnetic field has been studied in\ndetail (e.g., Stenflo 1994; Landi Degl'Innocenti & Landolfi 2004), and has also found many applications in the study of quiet-Sun magnetism (see, e.g., the review by Trujillo Bueno, Asensio Ramos, & Shchukina\n2006). In contrast, to our knowledge, no general account has been given in the past of similar depolarization effects produced by a field that is significantly entangled at scales below the temporal\nand spatial resolutions of spectro-polarimetric observations, but which averages at a finite, mean\nfield when integrated over those scales. Such mean field, which determines the large-scale evolution\n\n\f–8–\nof the plasma, remains within the grasp of the traditional diagnostics based on the Zeeman and\nHanle effects. On the other hand, the signature of atomic depolarization-like in the observations\ndescribed by Kuckein et al. (2009)-finds a very simple and direct interpretation in terms of the\nstrength of a completely random field unresolved to the observations. This scenario provides a very\nappealing interpretational framework for the highly dynamical events observed at high temporal\nand spatial resolution with Hinode/SOT, e.g., in quiescent prominences and spicules (Berger et al.\n2008), thus opening a new path for the polarimetric study of highly structured plasmas.\nOf course, this new insight comes at the cost of introducing an additional degree of freedom\nin the magnetic diagnostics of chromospheric fields. For this reason, we strongly advocate that\nfuture research programs need to take full advantage of multi-line spectro-polarimetry, e.g., through\nsimultaneous observations of He I λ10830 and D3 in prominences and spicules, or He I λ10830 and\nHα λ6563 in filaments and the chromosphere. In fact, such capability is already been pursued at\nthe French-Italian solar telescope THÉMIS, and will be the normal mode of operation of HAO's\nPromincence Magnetometer (ProMag; Elmore et al. 2008), soon to be deployed. We expect that\nthis type of multi-line diagnostics of chromospheric fields will fully come to fruition with the large\nsolar facilities of the next generation, like ATST, EST, and COSMO.\nWe thank R. Centeno Elliott (HAO) and V. Martı́nex Pillet (IAC) for useful comments. RMS\nacknowledges support by the Spanish MCYT through project AYA2007-63881.\n\nREFERENCES\nAsensio Ramos, A., Trujillo Bueno, J., & Landi Degl'Innocenti, E. 2008, ApJ, 683, 542\nBauman, R. P., Porter, R. L., Ferland, G. J., & MacAdam, K. B. 2005, ApJ, 628, 541\nBerger, T. E., Shine, R. A., Slater, G. L., et al. 2008, ApJ, 676, L89\nBommier, V., & Sahal-Bréchot, S. 1978, A&A, 69, 57\nCasini, R., López Ariste, A., Tomczyk, S., & Lites, B. W. 2003, ApJ, 598, 67L\nElmore, D. F., Casini, R., Card, G. L., et al. 2008, SPIE, 7014, 39\nEparvier, F. G., & Woods, T. N. 2003, in ISCS Symposium, ESA SP-535, 209\nHirabayashi, A., Nambu, Y., Hasuo, M., & Fujimoto, T. 1988, Phys. Rev. A, 37, 83\nJanse, Å. M., & Low, B. C. 2009, ApJ (in press)\nKuckein, C., Centeno Elliott, R., Martı́nez Pillet, V., et al. 2009 (in preparation)\nLamb, F. K., & Ter Haar, D. 1971, Phys. Rep., 2, 253\n\n\f–9–\nLandi Degl'Innocenti, E. 1982, Sol. Phys., 79, 291\nLandi Degl'Innocenti, E., & Landolfi, M. 2004, Polarization in Spectral Lines (Dordrecht: Kluwer)\nLópez Ariste, A., & Casini, R. 2002, ApJ, 575, 529\nMerenda, L., Trujillo Bueno, J., Landi Degl'Innocenti, E., & Collados, M. 2006, ApJ, 642, 554\nParker, E. N. 1994, Spontaneous Current Sheets in Magnetic Fields (Oxford: Oxford University)\nSánchez Cuberes, M., Vázquez, M., Bonet, J. A., & Sobotka, M. 2002, ApJ, 570, 886\nStenflo, J. O. 1994, Solar Magneti Fields (Dordrecht: Kluwer)\nTandberg-Hanssen, E. 1995, The Nature of Solar Prominences (Dordrecht: Kluwer)\nTrujillo Bueno, J., Landi Degl'Innocenti, E., Collados, M., Merenda, L., & Manso Sainz, R. 2002,\nNature, 415, 403\nTrujillo Bueno, J., & Asensio Ramos, A. 2007, ApJ, 655, 642\nTrujillo Bueno, J., Asensio Ramos, A., & Shchukina, N. 2007, in ASP Conf. Ser. Vol. 358, Solar\nPolarization 4, ed. R. Casini & B. W. Lites (San Francisco: ASP), 269\nvan Regemorter, H. 1962, ApJ, 136, 906\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f"}