{"id": "http://arxiv.org/abs/1004.4088v1", "guidislink": true, "updated": "2010-04-23T10:18:01Z", "updated_parsed": [2010, 4, 23, 10, 18, 1, 4, 113, 0], "published": "2010-04-23T10:18:01Z", "published_parsed": [2010, 4, 23, 10, 18, 1, 4, 113, 0], "title": "Domain wall structure in magnetic bilayers with perpendicular anisotropy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5203%2C1004.4104%2C1004.2382%2C1004.3803%2C1004.1801%2C1004.1380%2C1004.4669%2C1004.1323%2C1004.0860%2C1004.3470%2C1004.3832%2C1004.1296%2C1004.0638%2C1004.3336%2C1004.0883%2C1004.2564%2C1004.2223%2C1004.3338%2C1004.2176%2C1004.3302%2C1004.2888%2C1004.3903%2C1004.3706%2C1004.3181%2C1004.0061%2C1004.5013%2C1004.0415%2C1004.1881%2C1004.3501%2C1004.2739%2C1004.0779%2C1004.4841%2C1004.2115%2C1004.2156%2C1004.0968%2C1004.4865%2C1004.0925%2C1004.1571%2C1004.2865%2C1004.4354%2C1004.1193%2C1004.4621%2C1004.4335%2C1004.2038%2C1004.1705%2C1004.0577%2C1004.4651%2C1004.3048%2C1004.0517%2C1004.5448%2C1004.5324%2C1004.0473%2C1004.0311%2C1004.1644%2C1004.1757%2C1004.4146%2C1004.2383%2C1004.2135%2C1004.3393%2C1004.5461%2C1004.5064%2C1004.3849%2C1004.3613%2C1004.4982%2C1004.2032%2C1004.5403%2C1004.1457%2C1004.4449%2C1004.3499%2C1004.2759%2C1004.0783%2C1004.4614%2C1004.4606%2C1004.1880%2C1004.3453%2C1004.2882%2C1004.3682%2C1004.5411%2C1004.2612%2C1004.4769%2C1004.1789%2C1004.5506%2C1004.1445%2C1004.0038%2C1004.2531%2C1004.5559%2C1004.5541%2C1004.0866%2C1004.3683%2C1004.4595%2C1004.4088%2C1004.4244%2C1004.1132%2C1004.5120%2C1004.1292%2C1004.3668%2C1004.0768%2C1004.0119%2C1004.4007%2C1004.4380%2C1004.3197&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Domain wall structure in magnetic bilayers with perpendicular anisotropy"}, "summary": "We study the magnetic domain wall structure in magnetic bilayers (two\nultrathin ferromagnetic layers separated by a non magnetic spacer) with\nperpendicular magnetization. Combining magnetic force and ballistic electron\nemission microscopies, we are able to reveal the details of the magnetic\nstructure of the wall with a high spatial accuracy. In these layers, we show\nthat the classical Bloch wall observed in single layers transforms into\nsuperposed N\\'eel walls due to the magnetic coupling between the ferromagnetic\nlayers. Quantitative agreement with micromagnetic calculations is achieved.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5203%2C1004.4104%2C1004.2382%2C1004.3803%2C1004.1801%2C1004.1380%2C1004.4669%2C1004.1323%2C1004.0860%2C1004.3470%2C1004.3832%2C1004.1296%2C1004.0638%2C1004.3336%2C1004.0883%2C1004.2564%2C1004.2223%2C1004.3338%2C1004.2176%2C1004.3302%2C1004.2888%2C1004.3903%2C1004.3706%2C1004.3181%2C1004.0061%2C1004.5013%2C1004.0415%2C1004.1881%2C1004.3501%2C1004.2739%2C1004.0779%2C1004.4841%2C1004.2115%2C1004.2156%2C1004.0968%2C1004.4865%2C1004.0925%2C1004.1571%2C1004.2865%2C1004.4354%2C1004.1193%2C1004.4621%2C1004.4335%2C1004.2038%2C1004.1705%2C1004.0577%2C1004.4651%2C1004.3048%2C1004.0517%2C1004.5448%2C1004.5324%2C1004.0473%2C1004.0311%2C1004.1644%2C1004.1757%2C1004.4146%2C1004.2383%2C1004.2135%2C1004.3393%2C1004.5461%2C1004.5064%2C1004.3849%2C1004.3613%2C1004.4982%2C1004.2032%2C1004.5403%2C1004.1457%2C1004.4449%2C1004.3499%2C1004.2759%2C1004.0783%2C1004.4614%2C1004.4606%2C1004.1880%2C1004.3453%2C1004.2882%2C1004.3682%2C1004.5411%2C1004.2612%2C1004.4769%2C1004.1789%2C1004.5506%2C1004.1445%2C1004.0038%2C1004.2531%2C1004.5559%2C1004.5541%2C1004.0866%2C1004.3683%2C1004.4595%2C1004.4088%2C1004.4244%2C1004.1132%2C1004.5120%2C1004.1292%2C1004.3668%2C1004.0768%2C1004.0119%2C1004.4007%2C1004.4380%2C1004.3197&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the magnetic domain wall structure in magnetic bilayers (two\nultrathin ferromagnetic layers separated by a non magnetic spacer) with\nperpendicular magnetization. Combining magnetic force and ballistic electron\nemission microscopies, we are able to reveal the details of the magnetic\nstructure of the wall with a high spatial accuracy. In these layers, we show\nthat the classical Bloch wall observed in single layers transforms into\nsuperposed N\\'eel walls due to the magnetic coupling between the ferromagnetic\nlayers. Quantitative agreement with micromagnetic calculations is achieved."}, "authors": ["Amandine Bellec", "Stanislas Rohart", "Michel Labrune", "Jacques Miltat", "André Thiaville"], "author_detail": {"name": "André Thiaville"}, "author": "André Thiaville", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/0295-5075/91/17009", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.4088v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.4088v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Author adresses AB, SR, JM and AT: Laboratoire de Physique des\n  Solides, CNRS, Universit\\'e Paris Sud, UMR 8502, 91405 Orsay Cedex, France ML\n  : Laboratoire PMTM, Institut Galil\\'ee, CNRS, Universit\\'e Paris-13, UPR\n  9001, 93430 Villetaneuse, France", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.4088v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.4088v1", "journal_reference": null, "doi": "10.1209/0295-5075/91/17009", "fulltext": "epl draft\n\narXiv:1004.4088v1 [cond-mat.mes-hall] 23 Apr 2010\n\nDomain wall structure in magnetic bilayers with perpendicular\nanisotropy\nAmandine Bellec1 , Stanislas Rohart1\n1\n2\n\n(a)\n\n, Michel Labrune2 Jacques Miltat1 and André Thiaville1\n\nLaboratoire de Physique des Solides, CNRS, Université Paris Sud, UMR 8502, 91405 Orsay Cedex, France\nLaboratoire PMTM, Institut Galilée, CNRS, Université Paris-13, UPR 9001, 93430 Villetaneuse, France\n\nPACS\nPACS\nPACS\n\n75.60.Ch – Domain walls and domain structure\n75.70.-i – Magnetic properties of thin films, surfaces, and interfaces\n68.37.Ef – Scanning tunneling microscopy (including chemistry induced with STM)\n\nAbstract. - We study the magnetic domain wall structure in magnetic bilayers (two ultrathin\nferromagnetic layers separated by a non magnetic spacer) with perpendicular magnetization. Combining magnetic force and ballistic electron emission microscopies, we are able to reveal the details\nof the magnetic structure of the wall with a high spatial accuracy. In these layers, we show that\nthe classical Bloch wall observed in single layers transforms into superposed Néel walls due to the\nmagnetic coupling between the ferromagnetic layers. Quantitative agreement with micromagnetic\ncalculations is achieved.\n\nIntroduction. – Magnetic domain walls (DW) are\nattracting a sustained interest both from a fundamental\nperspective and for applications, especially in the context\nof innovative magnetic memories [1,2]. The aim is to control the DW motion using magnetic fields or spin polarized currents. The dynamics of these walls is intrinsically\nlinked to their micromagnetic structures, which impact\ntheir mobility and the so-called Walker velocity (the critical field or current above which the DW magnetization\nprecesses when moving) [3, 4]. In magnetic films with planar magnetization, the DW are generally large and are well\ncharacterized using classical tools such as magnetic force\nmicroscopy (MFM) [5], scanning electron microscopy with\nspin polarization analysis (SEMPA) [6] or x-ray photoemission electron microscopy (X-PEEM) [7]. On the contrary, in materials presenting a perpendicular magnetic\nanisotropy (PMA), the high magnetic anisotropy leads to\nnarrow DW (width of few tens of nanometers or even less),\nwhich are difficult to measure and only the domains are\nobserved [8–10]. Based on micromagnetic arguments, in\nultrathin films (thickness below the exchange length) the\nDW are generally thought to be Bloch walls [10–13], which\nminimize the wall internal dipolar energy. However, this\nfact has never been explicitly proved by direct observation. This lack of evidence is surprising as these materials\nare widely studied, since they present original phenomena\n(a) E-mail:\n\nrohart@lps.u-psud.fr\n\nsuch as creep in small field [14] and since their DW are\nthought to be easily moved using spin polarized current.\nIn this Letter, we present a study of DW in magnetic\nbilayers (two ferromagnetic layers separated by a non magnetic spacer) with perpendicular magnetization. Such\nstructures have been recently studied and the dynamics\nunder field or current has been shown to be original due to\nthe coupling between the two layers [15]. In order to gain\nprecise information on their structure, we use a combination of MFM and ballistic electron emission microscopy\n(BEEM), a recent technique that allows high spatial resolution magnetization imaging. With the help of complementary micromagnetic calculations, we show that, contrary to intuition, the DW turn out to be Néel walls, due\nto the magneto-static coupling between the two ferromagnetic layers. Beyond this result, this study is also the first\ndemonstration that BEEM can be applied to magnetic\nsamples with perpendicular magnetization.\nExperimental details. – For the study of domain\nwall structure, high resolution magnetic imaging techniques have to be used. We have chosen to use the ballistic\nelectron emission microscope (BEEM) [16], a STM based\ntechnique with a theoretical resolution of few nanometers [17]. One advantage of this technique is that it is\nnot restricted to samples grown and observed in a ultrahigh vacuum (UHV) environment, a fact that, e.g. enables\ncomplementary magnetic force microscopy (MFM) mea-\n\np-1\n\n\fA. Bellec et al.\nsurements. However, the BEEM technique also imposes\nsome restrictions on the sample. In order to get enough\nsignal, the magnetic layers have to be rather transparent\nto hot electrons in the 1-2 eV energy range. This forbids\nusing Pt/Co multilayers, which is the archetypical example of multilayers with PMA, as the hot electron attenuation in Pt is very strong (more than 10 times higher than\nin Au [18]). Instead, we use Au/Co multilayers, which\nprovide similar magnetic anisotropies as Pt/Co multilayers but with a much better hot electron transparency.\nThe samples have been grown using electron-beam evaporation in UHV (base pressure 2 × 10−10 mbar) on a\nhydrogenated n type Si(111) substrate. The substrate\nhas been cleaned and prepared using wet chemistry following the procedure described in Ref. [19], and displays atomically flat terraces prior to metal deposition.\nThe first 5 nm thick Au layer ensures the formation\nof a high quality Schottky diode (barrier height ΦB =\n0.8 eV, ideality factor < 1.1), which is a necessary condition for BEEM experiments. The following layers are\nCo(1.6 nm)/Au(5.0 nm)/Co(1.4 nm)/Au(5.0 nm) (the last\nlayer is a capping layer which ensures the stability of the\nsample outside the UHV environment). The effective magnetic anisotropy is expected to be rather low (but positive)\ndue to the rather large Co thickness. The advantage is that\nthe domain wall energy is expected to be small enough to\nallow for the nucleation of small domains, thus facilitating\nBEEM experiments.\nThe BEEM experiments have been conducted using a\nmodified Omicron-1 STM [20] at room temperature and\nin a UHV chamber (different from the evaporation chamber). A magnetic field up to 60 Oe and perpendicular to\nthe surface can be applied from outside the UHV chamber.\nFor a positive tunneling voltage VT , hot electrons are collected in the Si substrate and the transmission T defined\nas the hot electron current IB to tunneling current IT is\nmeasured. The MFM experiments have been conducted\nin ambient conditions on a Dimension 3000 Veeco AFM\nusing home-made Co-Cr coated tips.\nResults. – The sample have first been studied using \"classical\" techniques, namely magneto-optical Kerr\neffect (MOKE) and MFM. The magnetic hysteresis loop\nmeasured in polar geometry shows that the sample indeed\nhas a perpendicular magnetic anisotropy with a saturating field of 500 Oe, but does not have a 100 % remanent magnetization (MR /MS ≈ 20 %). This is an indication that in zero magnetic field, spontaneous nucleation of\nmagnetic domains occurs. This phenomenon, observed in\nmany samples like garnets, is attributed to a low DW energy, which allows minimizing the dipolar energy through\nthe nucleation of small domains [21]. These domains have\nbeen revealed by MFM: the image (Fig. 1a) shows two\ntypes of domains with opposite magnetization (perpendicular to the surface), each domain brand occupying 50% of\nthe surface in zero magnetic field. The domain structure\ncorresponds to segmented stripes with alternate magne-\n\n(a)\n\n(b)\n\nFig.\n1:\nImages\n(2 × 2\nμm2 )\nof\nthe\nCo(1.6 nm)/Au(5 nm)/Co(1.4 nm) sample.\n(a) MFM\nphase image (inset topography) (b) BEEM (Ballistic current)\nimage (inset topography) (imaging conditions: VT = 1.5 V,\nIT = 20 nA)\n\ntization direction but with a rather disordered structure.\nThe average width of the stripes is 350 ± 50 nm. As only\ntwo contrast levels are seen in the MFM image, the magnetic state of the sample corresponds to either (i) one saturated layer and one layer with domains or (ii) a replication of the domains in the two layers. BEEM experiments\nhave then been performed as the two hypotheses should\ngive very different results, since BEEM probes the local\nalignment between the magnetization of the two layers.\nIn the first case, we expect images similar to MFM images, whereas in the second case, we expect no contrast\nas the magnetization directions are always parallel to each\nother.\nBEEM imaging has been first performed in zero magnetic field as shown in Fig. 1b. The images are clearly\ndifferent from MFM images but a clear contrast, uncor-\n\np-2\n\n\fDomain wall structure in magnetic bilayers with perpendicular anisotropy\n100\n\n0.12\n\nbright areas\ndark areas\n\nIB/IT (%)\n\n0.04\n25\n\n0.00\n0.8\n\n1.0\n\n1.2\n\n(b) H=0 Oe\n\n75\n\n50\n\n0.6\n\nTopography\n\n1.4\n\n1.6\n\n1.8\n\n2.0\n\nContrast (%)\n\n0.08\n\n(a)\n\n(c) H=60 Oe\n\n(d) H=-60 Oe\n\n0\n\nTunneling voltage (VT)\nFig. 2: Hot electron transmission (IB /IT ) versus tunneling\nvoltage, recorded on the bright areas and on the dark areas.\nThe transmission raises above 0.8 V, which corresponds to the\nSchottky barrier height at the Au/Si interface. The contrast\nevaluated with the help of equation 1 is also presented. The\ntunneling current is IT = 20 nA.\n\nrelated with the STM topography is observed: dark lines\n(low local ballistic electron transmission) with a width of\nfew tens of nanometers are present. One important characteristic is that the lines never cross each other and thus\ndelimit closed areas, which is typical of a border. As explained before, such a result is unexpected. Assuming\nthat the lines display the DW, these images correspond\nto a sample with a replication of the domains in the two\nlayers: inside the domains the magnetization of the two\nlayers are always parallel giving rise to a high transmission\n(bright areas).\nTo quantify the transmission and the magnetic contrast\nof our sample we performed BEEM spectroscopy measurements and compared the curves registered over the dark\nfeatures and over the bright areas (Fig. 2). Below 0.8 eV,\nno ballistic electrons are collected as their energy is lower\nthan the Schottky energy barrier (this threshold is the\nsame in both regions, which proves that the contrast does\nnot arise from defects at the interface). Above 0.8 eV,\nwe can clearly see the difference of transmission between\nthe bright and the dark areas. We define the magnetic\ncontrast C (in percent) as\nC = 100 ×\n\nTbright − Tdark\nTdark\n\n(1)\n\nwhere Tbright (resp. Tdark ) is the transmission measured\non a bright (resp. dark) area. This contrast is nearly\nenergy independent, and is about 40 ± 10%. Using the\nhot electron attenuation length obtained in previous work\nfor Co [16, 19], the magnetic contrast for our sample is\nestimated to range between 40 % and 60 % at 1.5V. This\ngood agreement proves that the magnetization of the two\nlayers are indeed locally anti-parallel in the dark zones.\nIn order to prove that these dark lines are DW, we have\nalso performed BEEM imaging under magnetic field, ap-\n\nReduced domain\n\nEnlarged domain\n\nFig. 3: Evolution of the BEEM images with magnetic field\n(H). (a) STM topography, BEEM images at (b) H= 0 Oe, (c)\nH= 60 Oe and (d) H= −60 Oe (VT = 1.5 V, IT = 20 nA,\n1 × 1 μm2 ). The arrow in (b) indicates the profile shown in\nFig. 6.\n\nplied perpendicularly to the sample surface. Fig. 3 compares ballistic current images recorded at the same position without magnetic field (b) and with a field of 60 Oe\n(c) and −60 Oe (d). Compared to H= 0 Oe (Fig. 3b),\nthe central domain is reduced for a positive magnetic field\n(Fig. 3c) while it is enlarged for a negative field (Fig. 3d).\nThus, it has been possible to move the dark lines without\nchanging their width, which is typical of DW. Comparing\nBEEM images with the sample topography (Fig 3a), it is\npossible to move one step further. Some defects (higher\ngrains) can be observed in the topography and seem to act\nas pinning centers: the domain walls are \"linking\" some\nof these defects and only move in the defect free zones.\nThis incidentally proves that the sample microstructure\ndetermines the coercivity.\nDiscussion: origin of the contrast. – The origin of\nthe anti-parallel alignment in the domain walls should now\nbe explained. The interpretation is based on the dipolar\ncoupling only, as the Au spacer thickness (5 nm) is sufficient to neglect any direct coupling [22]. We can rule out\nthat domains are misaligned (Fig. 4a), which could give\nrise to an AP alignment near the domains border. Indeed,\nthe width of the observed lines is very regular and field independent (in the small field range < 100 Oe). Moreover,\nthe stray field around the domain walls tends to stabilize\nthe alignment of the domain walls as depicted in Fig. 4a.\nWe thus rather claim that the dark lines correspond to\ndomain walls having opposite chirality in the two layers,\nleading to the local AP alignment. In single ultrathin\nmagnetic layers, DW are Bloch walls (helicoidal rotation\n\np-3\n\n\fA. Bellec et al.\n\n(a) Misaligned domains\n\n(b) Bloch walls with opposite chiralities\n\n(c) Néel walls with opposite orientation\n\nFig. 4: Possible configurations explaining the contrasts observed. (a) Misalignment of magnetic domains, (b) Bloch walls\nor (c) Néel walls with opposite chirality. The dashed lines\nsketch the flow of the stray field.\n\nof the spins in the DW plane) so that no magnetic charges\nare present, which minimizes the DW internal dipolar energy. These walls may have two chiralities (left or right\nhanded). However, as no specific stray field is associated\nwith these walls, they cannot couple to each other (neither ferro- nor antiferromagnetically). In our multilayer\nsystem, the probability to get opposite chiralities is then\n≈ 50 %. Since the size of domains observed by BEEM\nis in agreement with MFM observations, we know that\nall the walls are characterized by an AP alignment of the\nmagnetization of the two layers.\nFurthermore, it is easy to see that Bloch walls are unstable in this multilayer sample. As shown in Fig. 4b, at the\ncenter of one wall the stray field of the domains in the other\nlayer is aligned along the x direction (perpendicular to the\nwall plane). Since, at that position, the magnetization of\nBloch walls is along the y direction, this field creates a\ntorque, which destabilizes the magnetization toward the\nx direction. Due to this field, the walls may transform to\nNéel walls with a magnetization along the x direction, as\nshown in Fig. 4c. More interestingly, the torques developed in each layer have an opposite direction, which leads\nto an opposite chirality in the two Néel walls. Moreover,\nas Néel walls are charged, an additional stray field, specific to the walls, is induced, which even strengthens the\nAP alignment of the two layer magnetization in the walls.\nThis effect is at the origin of the contrast observed in the\nBEEM images. Such configurations can be reproduced\neasily using micromagnetic calculations for magnetic layers with a uniaxial perpendicular magnetic anisotropy K,\nwith any value of parameters (i.e. thickness, anisotropy,\nmagnetization...), provided that the magnetic anisotropy\n\nis larger than or equal to the shape anisotropy ( 12 μ0 MS2 ,\nwith MS the layer magnetization) and that the thickness\nis below the exchange length.\nWe now try to get a quantitative analysis of our images using numerical micromagnetic calculations. Using the bulk Co values for exchange interaction (A =\n3 × 10−11 J/m) and magnetization (MS = 1.4 × 106 A/m),\nthe only unknown parameter is K which is difficult to\nmeasure, since our sample is not in a saturated state in\nzero magnetic field. We have performed 2D calculations\n(x, z plane), with infinite dimensions in the y direction\n(along the DW axis) for a system with stripes. In our\nin-house code [23], the sample periodicity in the x direction is enforced. For a given K, the value of the period is\nthen adjusted such as to minimize the energy density. The\nsimulations reproduce well the model proposed in Fig. 4c\nwith Néel walls with opposite chirality in the two layers\n(see Fig. 5a and b). In order to get a quantitative comparison, the goal is first to determine the value of K that\nreproduces the experimental periodicity P and compare\nthe experimental and calculated DW profile. In a first approximation, we consider two identical layers (same thickness, same magnetic anisotropy). In the range where K is\nof the same order of magnitude as the shape anisotropy,\nthe period is a very good criterion, as P depends strongly\non K as shown in Fig. 5c.\nExperimentally, the periodicity (assumed to be at equilibrium) is 350 ± 50 nm so that, according to Fig. 5c the\nquality factor is permitted to range (see Fig. 5c) between\n1.011 and 1.037 (K = 1.24 − 1.28 × 106 J/m3 ). From\nthe calculated magnetization profile, the BEEM signal can\nnow be simulated. Supposing that the two spin conduction channels in the spacer are independent, the BEEM\nsignal is estimated to be [19]\nTBEEM =\n→\n\nTP − TAP →\nTP + TAP\n→\nm1 (x). m2 (x),\n+\n2\n2\n→\n\n(2)\n\nwhere m1 (x) and m2 (x) are the local magnetization orientations in the top and bottom layers. Across the DW,\nthe BEEM signal shows a deep minimum corresponding to\nthe anti-parallel alignment of the magnetization. The DW\nwidth, defined as the full width at half minimum of the\nBEEM signal, is shown in Fig. 5c. For Q between 1.011\nand 1.037, we estimate a DW width of 40 ± 5 nm, close\nto the experimental value (43 ± 5 nm). In the experimental BEEM images, we have recorded a profile in order to\ncompare with the calculation as shown in Fig. 6 (note that\nseveral profiles on various images have been taken and they\nall show the same DW shapes). The very good agreement\nbetween the experimental and calculated profile strongly\nsupports the magnetic structure model proposed here.\nIn the sample, the actual Co layers thicknesses are\nslightly different (respectively 1.4 and 1.6 nm). To better describe the sample reality, we now consider two\ndifferent layers in the simulations. Since the magnetic\nanisotropy has an interfacial origin, the total magnetic\nanisotropy of a film with a thickness t can be written as\n\np-4\n\n\fDomain wall structure in magnetic bilayers with perpendicular anisotropy\n\n(a)\n\nz\n\n0.08\n\ny\n\nBEEM transmission (%)\n\nx\n\n(b)\n1.0\n\nmx (top layer)\n\nmz\n\nmx (bottom layer)\n\nMi/MS\n\n0.5\n\n0.0\n\n0.06\n\n0.04\n\n0.02\n\n0.00\n\n-0.5\n\nExperiment\nSimulation :\nIdentical thicknesses\nDifferent thicknesses\n\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\nx (nm)\nFig. 6: Comparison between the experimental profile (taken\nalong the arrow in the BEEM image Fig 3b) and the calculations. The profile has been taken through two DW and thus\nshows two minima. For the calculated profiles, the distance\nbetween the two DW has been adjusted manually after the\ncalculation so that to correspond exactly to this experimental\ncase.\n\n-1.0\n0\n\n(c)\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nx (nm)\n3\nK (J/m )\n6\n\n6\n\n1.20x10\n550\n\n6\n\n1.25x10\n\n1.30x10\n\n60\n\n50\n\n450\n\n400\n\n40\n\n350\n\nBEEM profile reproduces very well the experimental one,\nas shown in Fig. 6.\n\nDW width (nm)\n\nStripe Periodicity, P (nm)\n\n500\n\n300\n\n250\n0.98\n\n1.00\n\n1.02\n\n1.04\n\n30\n1.06\n\n2\n\nQ = 2K/μ0MS\n\nFig. 5: Micromagnetic calculation of a stripe network for two\nidentical ferromagnetic layers (1.5 nm thick) separated by a non\nmagnetic spacer (5 nm thick). (a) Schematic configuration of\none stripe period (not to the scale) and (b) calculation result\nfor K = 1.26 × 106 J/m3 . (c) Stripe periodicity P and DW\nwidth (see definition below) variation vs. quality factor Q =\n2K/μ0 MS2 .\n\nConclusion. – In conclusion, we have shown that in\na magnetic multilayer with perpendicular magnetization,\nthe usual Bloch walls turn out to be unstable. A new\ntype of wall is found consisting of one Néel wall in each\nlayer, with opposite chirality. The details of these walls\nhave been revealed with a high spatial resolution using the\nballistic electron emission microscope. The simulations\nreproduce very well the observed features and show that\nthis type of wall occurs in such layers for any magnitude\nof magnetic anisotropies, consistent with the existence of\na perpendicular magnetization. The consequences of such\nDW structure modification on their dynamics ought to be\ndetectable.\n∗∗∗\n\nWe gratefully acknowledge the help of T. Maroutian for\ne-beam\nevaporation and the loan of his deposition setup.\nK = KV + 2KS /t, where KV is the cobalt volume magne3\nFinancial\nsupport was provided by C'Nano Île-de-France\ntocrystalline anisotropy (0.4 MJ/m [24]) and KS is the\nsurface anisotropy. Thus, the thicker film is expected to (STCalib project).\nhave a smaller anisotropy than the thinner one. Considering that the anisotropy found in the first calculations\nREFERENCES\ncorresponds to the average of the anisotropies of the two\nfilms, we estimate KS = 0.66 ± 0.02 mJ/m2 in good agree[1] Allwood D. A., Xiong G., Faulkner C. C., Atkinson\nment with values found from the literature [24]. The simD., Petit D. and Cowburn R. P., Science , 309 (2005)\nulation using KS = 0.66 mJ/m2 and those different film\n1688.\nthicknesses provides results almost identical to those pre[2] Parkin S. S. P., Hayashi M. and Thomas L., Science\nsented above, but with a larger DW width in the thicker\n, 320 (2008) 190.\nlayer. The equilibrium period is found to be 340 nm in\n[3] Schryer N. L. and Walker L. R., J. Appl. Phys. , 45\n(1974) 5406.\ngood agreement with the experiments, and the simulated\np-5\n\n\fA. Bellec et al.\n[4] Mougin A., Cormier M., Adam J.-P., Metaxas P. J.\nand ferré J., Europhys. Lett. , 78 (2007) 57007.\n[5] Garcı́a J. M., Thiaville A., Miltat J., Kirk K. J.,\nChapman J. N. and Alouges F., Appl. Phys. Lett. , 79\n(2001) 656.\n[6] Berger A. and Oepen H. P., Phys. Rev. B , 45 (1992)\n12596.\n[7] Laufenberg M., Backes D., Bührer W., Bedau D.,\nKläui M., Rüdiger U., Vaz C. A. F., Bland J. A. C.,\nHeyderman L. J., Nolting F., Cherifi S., Locatelli\nA., Belkhou R., Heun S. and Bauer E., Appl. Phys.\nLett. , 88 (2006) 052507.\n[8] Pommier J., Meyer P., Pénissard G., Ferré J.,\nBruno P. and Renard D., Phys. Rev. Lett. , 65 (1990)\n2054.\n[9] Allenspach R., Stampanoni M. and Bischof A., Phys.\nRev. Lett. , 65 (1990) 3344.\n[10] Bochi G., Hug H. J., Paul D. I., Stiefel B., Moser\nA., Parashikov I., Günterodt H.-J. and O'Handley\nR. C., Phys. Rev. Lett. , 75 (1995) 1839.\n[11] Bloch, Z. Physik , 74 (1932) 295.\n[12] Néel L., Compt. Rend. Acad. Sci , 241 (1955) 533.\n[13] Sobolev V. L., J. Mag. Mag. Mat , 177-181 (1998) 195.\n[14] Metaxas P. J., Jamet J. P., Mougin A., Cormier\nM., Ferré J., Baltz V., Rodmacq B., Dieny B. and\nStamps R. L., Phys. Rev. Lett. , 99 (2007) 217208.\n[15] Metaxas P. J., submitted to Phys. Rev. Lett. , (2010) .\n[16] Rippard W. H. and Buhrman R. A., Phys. Rev. Lett. ,\n84 (2000) 971.\n[17] Prietsch M., Phys. Rep. , 253 (1995) 163.\n[18] Zhukov V. P., Chulkov E. V. and Echenique P. M.,\nPhys. Rev. B , 73 (2006) 125105.\n[19] Kaidatzis A., Rohart S., Thiaville A. and Miltat\nJ., Phys. Rev. B , 78 (2008) 174426.\n[20] Thiaville A., Caud F., Vouille C. and Miltat J.,\nEur. Phys. J. B , 55 (2007) 29.\n[21] Kooy C. and Enz U., Phillips Res. Rep. , 15 (1960) 7.\n[22] Grolier V., Renard D., Bartenlian B., Beauvillain\nP., Chappert C., Dupas C., Ferré J., Galtier M.,\nKolb E., Mulloy M., Renard J. P. and Veillet P.,\nPhys. Rev. Lett. , 71 (1993) 3023.\n[23] Labrune M. and Miltat J., J. Appl. Phys. , 75 (1994)\n2156.\n[24] Beauvillain P., Bounouh A., Chappert C., Mégy\nR., Ould-Mahfoud S., Renard J. P., Veillet P.,\nWeller D. and Corno J., J. Appl. Phys. , 76 (1994)\n6078.\n\np-6\n\n\f"}