{"id": "http://arxiv.org/abs/1005.2571v2", "guidislink": true, "updated": "2010-09-21T16:38:55Z", "updated_parsed": [2010, 9, 21, 16, 38, 55, 1, 264, 0], "published": "2010-05-14T17:00:03Z", "published_parsed": [2010, 5, 14, 17, 0, 3, 4, 134, 0], "title": "Spin State Transfer in Laterally Coupled Quantum Dot Chains with\n  Disorders", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.1117%2C1005.3566%2C1005.0101%2C1005.4812%2C1005.3985%2C1005.3454%2C1005.1754%2C1005.2444%2C1005.3265%2C1005.1152%2C1005.0224%2C1005.2466%2C1005.5467%2C1005.1454%2C1005.5402%2C1005.4569%2C1005.2293%2C1005.4028%2C1005.2571%2C1005.2537%2C1005.3142%2C1005.2840%2C1005.2615%2C1005.1543%2C1005.1213%2C1005.1939%2C1005.1474%2C1005.5630%2C1005.3459%2C1005.2633%2C1005.3922%2C1005.4230%2C1005.3256%2C1005.3873%2C1005.3680%2C1005.0543%2C1005.1326%2C1005.3761%2C1005.3194%2C1005.0411%2C1005.1183%2C1005.2810%2C1005.1320%2C1005.0975%2C1005.1231%2C1005.4782%2C1005.1664%2C1005.3293%2C1005.3589%2C1005.2946%2C1005.2303%2C1005.0666%2C1005.1050%2C1005.2492%2C1005.1443%2C1005.3673%2C1005.2202%2C1005.0337%2C1005.5590%2C1005.4424%2C1005.1899%2C1005.5545%2C1005.0067%2C1005.4784%2C1005.2323%2C1005.4986%2C1005.4860%2C1005.5621%2C1005.5179%2C1005.4505%2C1005.1105%2C1005.2232%2C1005.4215%2C1005.0415%2C1005.5708%2C1005.2817%2C1005.5258%2C1005.1235%2C1005.1565%2C1005.5550%2C1005.0491%2C1005.0898%2C1005.4597%2C1005.4343%2C1005.0959%2C1005.4694%2C1005.0801%2C1005.3745%2C1005.4315%2C1005.1707%2C1005.2140%2C1005.0602%2C1005.1467%2C1005.3750%2C1005.2493%2C1005.5470%2C1005.1056%2C1005.0362%2C1005.1997%2C1005.5242%2C1005.5286&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spin State Transfer in Laterally Coupled Quantum Dot Chains with\n  Disorders"}, "summary": "Quantum dot arrays are a promising media for transferring quantum information\nbetween two distant points without resorting to mobile qubits. Here we study\ntwo most common disorders namely, hyperfine interaction and exchange coupling\nfluctuations, in quantum dot arrays and their effects on quantum communication\nthrough these chains. Our results show that the hyperfine interaction is more\ndestructive than the exchange coupling fluctuations. The average optimal time\nfor communication is not affected by any disorder in the system and our\nsimulations show that anti-ferromagnetic chains are much more resistive than\nthe ferromagnetic ones against both kind of disorders. Even when time\nmodulation of a coupling and optimal control is employed to improve the\ntransmission, the anti-ferromagnetic chain performs much better. We have\nassumed the quasi-static approximation for hyperfine interaction and time\ndependent fluctuations in the exchange couplings. Particularly, for studying\nexchange coupling fluctuations we have considered the static disorder, white\nnoise and $1/f$ noise.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.1117%2C1005.3566%2C1005.0101%2C1005.4812%2C1005.3985%2C1005.3454%2C1005.1754%2C1005.2444%2C1005.3265%2C1005.1152%2C1005.0224%2C1005.2466%2C1005.5467%2C1005.1454%2C1005.5402%2C1005.4569%2C1005.2293%2C1005.4028%2C1005.2571%2C1005.2537%2C1005.3142%2C1005.2840%2C1005.2615%2C1005.1543%2C1005.1213%2C1005.1939%2C1005.1474%2C1005.5630%2C1005.3459%2C1005.2633%2C1005.3922%2C1005.4230%2C1005.3256%2C1005.3873%2C1005.3680%2C1005.0543%2C1005.1326%2C1005.3761%2C1005.3194%2C1005.0411%2C1005.1183%2C1005.2810%2C1005.1320%2C1005.0975%2C1005.1231%2C1005.4782%2C1005.1664%2C1005.3293%2C1005.3589%2C1005.2946%2C1005.2303%2C1005.0666%2C1005.1050%2C1005.2492%2C1005.1443%2C1005.3673%2C1005.2202%2C1005.0337%2C1005.5590%2C1005.4424%2C1005.1899%2C1005.5545%2C1005.0067%2C1005.4784%2C1005.2323%2C1005.4986%2C1005.4860%2C1005.5621%2C1005.5179%2C1005.4505%2C1005.1105%2C1005.2232%2C1005.4215%2C1005.0415%2C1005.5708%2C1005.2817%2C1005.5258%2C1005.1235%2C1005.1565%2C1005.5550%2C1005.0491%2C1005.0898%2C1005.4597%2C1005.4343%2C1005.0959%2C1005.4694%2C1005.0801%2C1005.3745%2C1005.4315%2C1005.1707%2C1005.2140%2C1005.0602%2C1005.1467%2C1005.3750%2C1005.2493%2C1005.5470%2C1005.1056%2C1005.0362%2C1005.1997%2C1005.5242%2C1005.5286&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum dot arrays are a promising media for transferring quantum information\nbetween two distant points without resorting to mobile qubits. Here we study\ntwo most common disorders namely, hyperfine interaction and exchange coupling\nfluctuations, in quantum dot arrays and their effects on quantum communication\nthrough these chains. Our results show that the hyperfine interaction is more\ndestructive than the exchange coupling fluctuations. The average optimal time\nfor communication is not affected by any disorder in the system and our\nsimulations show that anti-ferromagnetic chains are much more resistive than\nthe ferromagnetic ones against both kind of disorders. Even when time\nmodulation of a coupling and optimal control is employed to improve the\ntransmission, the anti-ferromagnetic chain performs much better. We have\nassumed the quasi-static approximation for hyperfine interaction and time\ndependent fluctuations in the exchange couplings. Particularly, for studying\nexchange coupling fluctuations we have considered the static disorder, white\nnoise and $1/f$ noise."}, "authors": ["Song Yang", "Abolfazl Bayat", "Sougato Bose"], "author_detail": {"name": "Sougato Bose"}, "author": "Sougato Bose", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.82.022336", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.2571v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.2571v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 12 figures. Comments are welcome!", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.2571v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.2571v2", "journal_reference": "Phys. Rev. A 82, 022336 (2010)", "doi": "10.1103/PhysRevA.82.022336", "fulltext": "Spin State Transfer in Laterally Coupled Quantum Dot Chains with Disorders\nSong Yang,1, 2 Abolfazl Bayat,1 and Sougato Bose1\n\narXiv:1005.2571v2 [quant-ph] 21 Sep 2010\n\n2\n\n1\nDepartment of Physics and Astronomy, University College London, Gower St., London WC1E 6BT, United Kingdom\nKey Laboratory of Quantum Information, University of Science and Technology of China, Hefei, 230026, People's Republic of China\n(Dated: November 18, 2018)\n\nQuantum dot arrays are a promising media for transferring quantum information between two distant points\nwithout resorting to mobile qubits. Here we study two most common disorders namely, hyperfine interaction and exchange coupling fluctuations, in quantum dot arrays and their effects on quantum communication\nthrough these chains. Our results show that the hyperfine interaction is more destructive than the exchange coupling fluctuations. The average optimal time for communication is not affected by any disorder in the system\nand our simulations show that anti-ferromagnetic chains are much more resistive than the ferromagnetic ones\nagainst both kind of disorders. Even when time modulation of a coupling and optimal control is employed to\nimprove the transmission, the anti-ferromagnetic chain performs much better. We have assumed the quasi-static\napproximation for hyperfine interaction and time dependent fluctuations in the exchange couplings. Particularly,\nfor studying exchange coupling fluctuations we have considered the static disorder, white noise and 1/f noise.\n\nI.\n\nINTRODUCTION\n\nThe transmission of quantum information between two\nwell separated parties via quantum channel is prerequisite for\nquantum communication and scalable quantum computation.\nSpin chains are of great interest in quantum information science since they are natural candidates for quantum channels\n[1] in atomic scales. In the use of spin chains for quantum\ncommunication a sender can send a quantum state or share\nentanglement with another separated set of spins at a distant\npoint of the spin chain just through the natural evolution of the\nsystem. Besides controlling the sender and the receiver spins,\nno extra controls are needed for communication so that system can be shielded from the environment to minimize decoherence. Based on the physical implementation of spin chains\nseveral imperfections can affect the communication process.\nThermal fluctuations [2] and decoherence [3–5] have been\nstudied as external effects. Another important source of imperfection is disorder which is inevitable due to imperfect fabrication processes. In any physical implementation, always\nthere exist some parameters which cannot be tuned perfectly.\nFor instance in a spin chain one cannot guarantee to have precise couplings without disorder and also each spin can have\ndifferent energy splitting due to a fluctuating electric or magnetic field. In [6] the coherent dynamics of one and two electron transport in a linear array of tunnel-coupled quantum dots\nin the presence of imperfect fabrications have been studied.\nMoreover, the influences of the static disorders on XX spin\nchain model have been analyzed recently [7] and was shown\nthat locally controlling the couplings is more susceptible to\ndisorders than permanently coupled chains. On-site energy\nfluctuations in spin chains have been considered in [8] and it\nwas found that these fluctuations suppress the transmission in\na different way compared to the static disorders. Due to the\nrandom nature of disorder, they also may cause localization\nin long chains which restricts the communication length. This\nlocalization and communication beyond that length has been\ninvestigated in [9].\nChains of perpetually coupled spins or other qubits in solid\nstate systems, may be used to connect solid state quantum\n\nregisters without resorting to optics. Thus, proposals with\nchains of charge qubits [10], flux qubits [11] and quantum\ndot based excitonic qubits [12, 13] have been put forward.\nHowever, in this context spins in quantum dot arrays, look\nparticulary promising, since electron spins in quantum dots\nhave relatively long relaxation time [14–17], allow for coherent manipulations [18–21]. They will be ideal as connectors\nbetween quantum registers built with spin qubits in quantum\ndots [22–24]. The other advantage of using quantum dot arrays for realization of quantum channel is the easy and flexible\nmanipulation of the exchange couplings between neighboring\ndots. Theoretical [23] works has shown that the quantum dot\nchain might fairly easily transit from ferromagnetic (FM) to\nanti-ferromagnetic (AFM) phase by modulating the barrier of\nneighboring dot or external magnetic field and typically the\ninteraction is found to be anti-ferromagnetic [19].\nIt has been shown that the perfect state transfer can be\nachieved in a chain of spins interacting permanently through\nengineered couplings [25] or controlling a single local actuator which modulates one energy-level transition [26] in an\nXX Hamiltonian . However, in the chain of quantum dots the\nnatural interaction between neighboring spins is Heisenberg\nHamiltonian [22] and there is no way to convert it to a XX\nHamiltonian for achieving perfect state transfer. On the other\nhand it was shown that in the Heisenberg Hamiltonian without locally modulating the magnetic field one cannot achieve\nperfect state transferring [27].\nFor electron spins in a mesoscopic open quantum system,\nthe most significant interactions are the spin-orbit and the hyperfine interactions [28]. The first process can be efficiently\nsuppressed via reducing the temperature and also its time scale\nis so long such that for a fast coherent scheme, such as state\ntransferring, it does not have a significant effect. So, as the\nfirst important effect in quantum dot spin chain communication we focus on the hyperfine interaction which practically\ncan not be suppressed due to the permanent interaction with\nthe spins of nuclei in the host material.\nMoreover, having a strong spin exchange coupling, for a\nfast evolution, by means of external gates will introduce background charge fluctuations in the system. This charge fluctuation will induce variations of spin exchange coupling, which\n\n\f2\nalso lead to qubit dephasing. Unlike the hyperfine interaction the quasi static approximation is not valid for exchange\ncoupling fluctuations and they suffer from a time dependent\ndisorder which behaves like 1/f noise [29].\nIn this paper, we study the effect of hyperfine interaction\nand exchange coupling fluctuation over the quality of quantum communication through the quantum dot spin chains. We\nconsider linear lateral quantum dot arrays in both FM and\nAFM regimes and compare the destructive effects of these two\nsource of imperfections on the quality of communication. As\nhyperfine interactions lead to non-conservation of total magnetization of the chain here we require a general formula for\nthe fidelity of quantum state transfer in an arbitrary quantum\nchannel. Accordingly, we present and use such a formula,\nwhich to our knowledge, has not been used in the spin chain\nliterature.\nThe structure of the paper is as following. We first introduce the theoretical model to realize the state transfer based\non quantum dot arrays in Sec. II. Then the effects of hyperfine interaction and exchange interaction fluctuation are investigated in Sec. III A and Sec. III B. Moreover we investigate\nthe quantum state transfer in practical situation including hyperfine interaction, exchange interaction fluctuation as well as\nthermal fluctuations in Sec. IV. A possible improving strategy\nvia quantum control theory is discussed in Sec. V. Finally, our\nconclusion follows in Sec. VI.\nII. QUANTUM STATE TRANSFERRING IN AN IDEAL\nCHAIN WITHOUT DISORDER\n\nWe consider a linear array of lateral GaAs quantum dots,\nelectrostatically defined in a two-dimensional electron gas via\nmetallic gates on the top of a semiconductor heterostructures\n(GaAs/AlGaAs) [19, 28]. Here each dot is doped with a\nsingle excess electron, and qubit is encoded on the electron\nspin. When tunneling barrier is \"high\", the interactions between neighboring dots are forbidden; and if tunneling barrier\nis \"low\", the spins will experience an exchange interaction\nwhich can be described by the Heisenberg model [22]. An\nexternal magnetic field hz can be applied in the z direction to\nbreak the degeneracy between two spin levels, i.e. |0i = | ↓i\nand |1i = | ↑i with a Zeeman splitting ∆z = gμB hz .\nIn Fig. 1 (a) we have shown the schematic of the system.\nSpin 0 is initially decoupled from the others while the rest of\nthe system are interacting through the following Hamiltonian\nHch =\n\nN\n−1\nX\n\nJk Ŝk * Ŝk+1 ,\n\n(1)\n\nk=1\n\nwhere, Ŝk is the spin-1/2 operator for dot k. Jk denotes the\nexchange interaction between kth and (k + 1)th dots which\nis controlled using external gates. The exchange couplings\nJk decrease exponentially with the distance between quantum\ndots [23], so, just nearest neighbor interaction has been considered in Hamiltonian (1). Here Jk > 0 (∀k ∈ [1, N − 1]) is\nfor anti-ferromagnetic chain, while Jk < 0 (∀k ∈ [1, N − 1])\ndenotes the ferromagnetic chains.\n\nFIG. 1: (Color online) (a) Scheme for transferring an arbitrary pure\nstate through the quantum dot chain. Spin 0 is the sender qubit\nand initially is decoupled from the channel qubits (spins 1, 2, ..., N )\nwhich are prepared in their ground state. The sender places the quantum information on the 0th qubit, and switches on the interaction between the 0th and the 1st qubit of the channel in order to send the\ninformation to the N th qubit. (b) Scheme for entanglement distribution. At the beginning, the channel is initialized to its ground state,\n′\nand a singlet state is prepared between spin 0 and spin 0 . The sharing entangled information propagates from the 0th spin to the N th\none by switching on the coupling between the 0th spin and the 1st\n′\nspin while spin 0 remains decoupled from the rest of the system\nduring the evolution.\n\nJust as the initial proposal for the state transferring [1] we\nconsider an arbitrary state in the sender qubit (here spin 0)\nθ\nθ\n|ψin i = cos( )|0i + eiφ sin( )|1i,\n2\n2\n\n(2)\n\nwhere, 0 ≤ θ ≤ π and 0 ≤ φ < 2π determine the location of the quantum state on the surface of the Bloch sphere.\nThe other spins are initialized in |ψch i, the ground state of the\nHamiltonian (1). The initial state of the system is thus\n|ψ(0)i = |ψin i ⊗ |ψch i.\n\n(3)\n\nIn the FM and also AFM chains with odd N the ground state\nof the system is degenerate and to choose a single state we\nadd a small global magnetic field in the z direction to break\nthe symmetry and choose one of the ground states. To send the\nstate |ψin i through the chain one can switch on the interaction\nbetween the 0th and the 1st spin of the channel at t = 0 as\nshown in Fig. 1(a). The interaction Hamiltonian takes the\nform\nHI = J0 Ŝ0 * Ŝ1 .\n\n(4)\n\nSo, the overall Hamiltonian is\nH = Hch + HI .\n\n(5)\n\n\f3\nSince, the initial state (3) is not an eigenvector of the Hamiltonian H, the whole system evolves as\n|ψ(t)i = T e−i\n\nRt\n0\n\nH(τ )dτ\n\n|ψ(0)i,\n\n(6)\n\nwhere, T denotes the time ordering operator and ~ has set to\nbe one. The time dependence of H(τ ) may stem from random\ntime dependent fluctuations. State of the receiver qubit ρN (t)\ncan be computed by tracing out the other spins. So that we can\ndefine the channel ξ as ρN (t) = ξ(ρ0 (0)), where, ρ0 (0) =\n|ψin ihψin | is the density matrix of the input state at t = 0. To\nquantify the quality of the state transferring we compute the\nfidelity between the sent and the received state F (θ, φ; t) =\nhψin |ρN (t)|ψin i. For a general quantum channel, including\nspin chains, we get\nθ\nθ\nF (θ, φ; t) = cos4 ( )h0|ξ(|0ih0|)|0i + sin4 ( )h1|ξ(|1ih1|)|1i\n2\n2\n1\n+ sin2 (θ)(h1|ξ(|0ih0|)|1i + h0|ξ(|1ih1|)|0i)\n4\n1\n+ sin2 (θ)(h1|ξ(|1ih0|)|0i + h0|ξ(|0ih1|)|1i). (7)\n4\nAs it is clear from Eq. (7) this quantity is dependent on the\ninitial state and we average over all possible input states, i.e.\nover the surface of the Bloch sphere, to get an input independent quantity\n1\nFav (t) =\n4π\n\nZ\n\nφ=2π\n\nφ=0\n\nZ\n\nθ=π\n\nF (θ, φ; t)sin(θ)dθdφ.\n\n(8)\n\nθ=0\n\nFor an arbitrary channel we can write the average fidelity,\nFav , in a simple general way\n1\n(h0|ξ(|0ih0|)|0i + h1|ξ(|1ih1|)|1i)\n3\n1\n+ (h1|ξ(|0ih0|)|1i + h0|ξ(|1ih1|)|0i)\n6\n1\n+ (h1|ξ(|1ih0|)|0i + h0|ξ(|0ih1|)|1i).\n6\n\n(11)\n\nwhere, we have considered the transmission of state |0i. Unfortunately, such compact results does not exist for AFM\nchains with odd N , however, Hamiltonian still have the symmetry of conserving the number of excitations.\nBesides the quantum state transferring, one can consider\nentanglement distribution as well. In this scheme, instead of\nsending a pure state through the spin chain we prepare a singlet state between spin 0 and and extra spin 0′ , shown in Fig.\n1 (b). The rest of the system is again initialized in |ψch i, the\nground state of Hch . At t = 0, spin 0 is coupled to the chain\n(as it was in the state transferring strategy) while spin 0′ remains decoupled during the evolution. As the result when the\nstate of the 0th spin goes through the chain and reaches the\nlast site we end up with an entangled state between spin 0′\nand spin N . For a general channel ξ the output state is:\nρ0′ ,N (t) =\n\n(9)\n\nNotice that in our case Fav is a function of time t and it takes\nits maximal value at a certain time t = topt . The general form\nof fidelity (9) can be sensibly simplified by choosing a particular state for |ψch i. For instance, in the FM regime (Jk < 0),\nQN\nthe initial state of the channel is |ψch (0)i = k=1 |0ik and\nPN\nz\nsince the operator Sz =\nk=0 Sk commutes with the total\nHamiltonian H the number of excitation is conserved at all\ntimes. Thus, evolution can be fully explained in the subspace\nQN\nincluding the ground state |0i = k=0 |0i and all single excitation states |1j i = σ̂j† |0i (j = 0, 1, ..., N ). The average\nfidelity of the ferromagnetic chain has been computed in Ref.\n[1] as\n1 |fN 0 |2\n|fN 0 | cos(γ − γ0 )\n+\n+\n,\n2\n6\n3\n\nAF M\nFav\n= h0|ξ(|0ih0|)|0i,\n\n1\n{|0ih0| ⊗ ξ(|1ih1|) + |1ih1| ⊗ ξ(|0ih0|)\n2\n− |1ih0| ⊗ ξ(|0ih1|) − |0ih1| ⊗ ξ(|1ih0|)},(12)\n\nFav =\n\nFM\nFav\n=\n\namplitude is fixed and defined as γ(t) = arg(fN 0 ). With a\nlocal unitary rotation to the N th spin, or equivalently applying a global magnetic field with a particular strength, one can\ncorrect this phase. So, we have subtracted the phase γ0 in the\nEq. (10) and ideally if all parameters of the Hamiltonian are\nknown we can tune γ0 such that cos(γ − γ0 ) = 1 at optimal\ntime t = topt . But as our target here is to consider the effect of noise, the above condition cannot be met for arbitrary\nunknown disorder.\nFor AFM exchange interaction (Jk > 0), when N is even\n(channel has a unique ground state) the effect of the channel\nis a fully symmetric depolarizing channel and all states are\ntransmitted with equal fidelity [5]. So, transmission of any\narbitrary state and its final fidelity specifies the average fidelity\nof even AFM chain\n\n(10)\n\nwhere, fN 0 (t) = h1N |U (t)|10 i is the transition amplitude\nfrom spin 0 to the last one and the phase of the transmission\n\nwhere, in each element the first part is the state of spin 0′ and\nthe second part represents the state of spin N . The entangle′\nment between 0 and N is usually measured by the concurrence C [30]. For the FM case, the concurrence has a very\nsimple form\nC F M = |fN 0 (t)|.\n\n(13)\n\nIn the case of AFM chains with even N again we have a\nsimple form for the concurrence as\nC AF M = 3h0|ξ(|0ih0|)|0i − 2.\n\n(14)\n\nIn compare to Eq. (11) we find a simple relationship between\nAF M\nthe average fidelity and the concurrence C AF M = 3Fav\n−\n2.\nIII.\n\nDISORDERED CHAINS\n\nIn the previous section, we have considered an ideal situation in which there is no disorder in the quantum dot chain.\n\n\f4\nExperimental [31, 32] and theoretical results [15, 29, 33–35]\nshow that the hyperfine interaction and the exchange interaction fluctuations are the most significant deleterious effects\non quantum dot chains. Thus, it is very important to give\na comparison of state transferring performance between FM\nand AFM spin chains in the presence of these two practically\nimportant disorders.\n\nA. Hyperfine Interaction\n\nFor electron spins in quantum dots, the most important destructive phenomenon is interaction with the spin of nuclei in\nthe bulk, i.e. hyperfine interaction. In this part we study this\neffect on the quality of state transferring in both FM and AFM\nchains.\nIn the mesoscopic quantum dot systems, the electron spin\ninteracts with many nuclear spins of its host material, and\nit can be described by the Hamiltonian of the Fermi contact\nM\nP\naj Îj .Ŝ, in\nhyperfine interaction [15, 28, 36] as HHF =\nj=1\n\nwhich Îj denotes the spin of the jth nucleus, Ŝ is the electron\nspin operator and aj represents the coupling strength between\nthe jth nucleus and the electron spin. An alternative way to\ndescribe the average effect of nuclear spins is to treat them as\nan effective magnetic field B̂, which is also called as the OverM\nP\naj Îj ) * Ŝ = B̂ * Ŝ. Introducing the hyperfine\nhauser field: (\nj=1\n\ninteraction into spin chain system, the channel Hamiltonian\nHch and total Hamiltonian H are changed accordingly to\nB\nHch\n= Hch +\n\nHB = H +\n\nN\nX\n\nB̂k * Ŝk ,\n\nk=1\nN\nX\n\nB̂k * Ŝk ,\n\n(15)\n\nk=0\n\nwhere the nuclear field B̂k is a three-dimensional random vector and Jk = J is assumed to be constant for all quantum dots.\nUnder the quasi-static approximation [15] the spin of nuclei\ndo not change in the state transferring time scale and B̂k is\nsupposed to be time independent. In the large M limit, the\nrandom vectors B̂k have a Gaussian distribution [15]\n\nP (B̂) =\n\n1\n2 )3/2\n(2πBnuc\n\nexp(−\n\nB̂ * B̂\n),\n2\n2Bnuc\n\n(16)\n\nwith expectation value hB̂i = 0 and standard deviation Bnuc .\nSince, the hyperfine interaction term does not commute\nwith Sz it breaks the conservation of spin-excitations so that\nwe have to consider the total Hilbert space for the evolution\nwhich restricts our simulation to rather short chains. We fix a\nrandom vector B̂k for each quantum dot according to the distribution (16) at t = 0. Spin 0 is initialized to |ψin i and the\nB\nchannel is set to be in ΠN\nk=1 |0i for FM chains and |ψch i, the\n\nFIG. 2: (Color online) Time evolutions of the average fidelity\nhFav iB as well as the concurrence hCiB in a chain of length N = 10\nin the presence of hyperfine interaction for FM (Figs. (a) and (c))\nand AFM quantum dot chains (Figs. (b) and (d)). Here J is absolute\nvalue of the exchange coupling between two dots.\nB\nreal ground state of Hch\n, for AFM chains. So, the initial state\nof the system is\nB\ni.\n|ψ(0)i = |ψin i ⊗ |ψch\n\n(17)\n\nThen, we switch on the interaction between spin 0 and spin\n1 and accordingly system evolves under action of the Hamiltonian H B . So, the average fidelity is computed for a fixed\nset of {B̂k } and since these are some random vectors we have\nto average over hundreds of different realizations (we choose\n500 times in our simulations) of random vectors {B̂k } to get\nhFav iB and hCiB .\nIn Fig. 2 we show the evolutions of average fidelity hFav iB\nand concurrence hCiB , which exhibit the performance of\nquantum information transferring, for FM and AFM quantum dot chains of length N = 10. As it is clear from Fig.\n2, the effect of the hyperfine interaction is always destructive\nand decreases the quality of classical transmission such that\nthe stronger the hyperfine interaction, the lower the quality\nof transmission. The average optimal time, where the peak of\nhFav iB and hCiB locate, is the same and does not change with\nincreasing the strength of the hyperfine interaction. Notice\nthat the optimal time for each realization of the chain might\nbe different due to the random nature of disorder, but since\nwe do not know how disorder changes the Hamiltonian, we\ncannot modify it according to the disorder, and we only can\nconsider its average value which our simulations show that\nit is not affected by disorder after many trials. Another feature of the Fig. 2 is the fact that in the presence of disorder\nthe first peak becomes the dominant peak in the evolution and\nhowever, the subsequent peaks may be higher for an ideal situation without disorder but in the presence of disorder one can\nconcentrate just on the first peak, as we will do in the rest of\n\n\f5\n\nFIG. 3: (Color online) Comparison of average fidelity hFav iB and\nconcurrence hCiB between FM (Figs. (a) and (c)) and AFM (Figs.\n(b) and (d)) quantum dot chains in terms of standard deviation Bnuc\nfor different lengths. The red straight solid line represents the highest\naverage fidelity accessible to the classical teleportation scheme.\n\nFIG. 4: (Color online) Comparison of average fidelity hFav iB and\nconcurrence hCiB in FM (Figs. (a) and (c)) and AFM (Figs. (b)\nand (d)) quantum dot chains as a function of length N for different\nvalues of Bnuc . The red straight solid line represents the highest\naverage fidelity accessible to the classical teleportation scheme.\n\nthe paper. The most significant results of the Fig. 2 come from\nthe comparison between FM and AFM chains. According to\nall quantities shown in Fig. 2 the quality of transmission in\nAFM chains is always higher and they give a higher value in\ntheir peak and a lower optimal time which peak occurs. Having a faster dynamics in the AFM regime is very important\nbecause disorder and all other decoherence sources have less\nopportunity to interfere with the evolution.\nIn Fig. 3 we have plotted hFav iB and hCiB in terms of\nhyperfine interaction strengths Bnuc in FM and AFM chains\nof length N = 8 and N = 10. As discussed above we just\nconsider t = topt where topt is the time in which the first peak\noccurs. As it has been shown in Fig. 3 (a) for FM chains\nthe average fidelity decreases very slowly for small values of\nBnuc and becomes less than the average fidelity of classical\nteleportation, which is equal to 2/3, when Bnuc = 0.08J\n(Bnuc = 0.06J) for the chain of length N = 8 (N = 10).\nFor AFM chains even for Bnuc = 0.1J (which is a very pessimistic estimation) average fidelity is still above the classical\nthreshold limit for the same length. Again Fig. 3 shows that\nthe quality of communication in AFM chains are better than\nFM ones according to both hFav iB and hCiB . Particularly,\nsmall amount of disorder (Bnuc < 0.01J) almost does not\nchange the quality of communication.\nIn Fig. 4 we show the performance of hFav iB and hCiB\nin terms of length for some fixed Bnuc in both FM and AFM\nchains. For FM chains, the average fidelity decreases by increasing the length and when Bnuc = 0.1J (which is quite a\npessimistic estimation) for chains up to N = 6 we can transfer our information better than 2/3, highest average fidelity of\nclassical communication. For Bnuc < 0.05 we are above the\nclassical threshold 2/3 even for a chain of N = 11 spins. For\n\nAFM chains, as it has been shown in Fig. 4(b) even when\nBnuc is very strong we are above the classical threshold for a\nchain of N = 11 and for more reasonable values of Bnuc we\nare far beyond the fidelity of 2/3. Here, due to the different\nsymmetry in the ground state of the even and odd chains we\nhave an even-odd effect and even chains give a higher quality in their transmission. This even-odd effect can be seen\nthrough the zigzag behavior of the average fidelity and entanglement in AFM chains. We also have considered the concurrence as a function of length N for chains of different Bnuc\nin Figs. 4 (c) and (d). As it was expected we found a higher\nentanglement in AFM chains with the same length than the\nFM ones and similar to the average fidelity we have even-odd\neffect for concurrence in AFM chains. This is an extension of\nthe results for non-disordered chains presented in [4, 5].\n\nB.\n\nExchange Coupling Fluctuations\n\nIn order to successfully accomplish state transferring before\nthe relaxation time of electron spins, the information propagation speed should be fast and exchange interaction need to be\nstrong. Exchange interaction in a chain of quantum dots can\nbe easily controlled by gate voltages. However, using external\ngates to control exchange interactions would inevitably introduce background charge fluctuation in the environment. The\ndeleterious effect of charge fluctuations on the quantum dot\nchains mainly has two aspects: (i) generating variations in the\nbarrier heights; (ii) causing a random bias potential between\nthe neighboring dots. Consequently, exchange couplings Jk in\ngated quantum dots unavoidably fluctuates with background\ncharge fluctuation such that spin qubits in quantum dot chain\n\n\f6\nsuffer dephasing [23, 34, 35].\nTo simulate the effect of these fluctuations on the quality\nof transmission we consider the couplings between neighboring dots as Jk = J(1 + δk (t)). The dimensionless parameters\nδk (t) are time-dependent random variables and have two main\nproperties: (i) disorder in each site is independent from the\nother sites; (ii) in each site k, the disorder parameter δk (t) is\ncorrelated in time such that the frequency spectrum behaves as\nS(f ) = σJ /f α , where σJ denotes the standard deviation and\nα defines the type of the noise. For instance, α = 0 represents\nthe white noise, α = 1 denotes the 1/f noise (pink noise),\nα = 2 is known as the Brownian noise and finally α = ∞\nis the static noise. In appendix A we have given a method to\ngenerate δk (t) such that their frequency spectrum behaves as\nS(f ) = σJ /f α . In Ref. [29] it was shown that the fluctuations of the coupling in a quantum dot chain mainly behaves\nlike 1/f noise (pink noise). In our simulation we consider the\nfollowing Hamiltonians for initializing the system\nJ\nHch\n= Hch ,\nN\n−1\nX\nJ\nH (t) =\nJ(1 + δk (t))Ŝk * Ŝk+1 .\n\n(18)\n\nk=0\n\nWe do not consider any noise effect in the channel Hamiltonian, which simply means that for both FM and AFM chains\nwe always consider an ideal state for the channel. It means\nthat we take the state given in Eq. (3) as the initial state of\nthe system. The reason that we ignore fluctuations in the initial state comes from the fact that in FM chains these fluctuations do not change the ground state and in the AFM chains\nwhen we consider an static random fluctuations even up to\nσJ = 0.1J the fidelity between the real ground state and the\nideal (without disorder) ground state is always above 0.99 for\nall lengths that we have considered in this paper.\nFor evolving the system, at each time step we generate\nδk (t) according to their frequency spectrum S(f ) and system\nevolves according to Hamiltonian H J (t). The important issue\nabout this particular Hamiltonian is that it does not break the\nsymmetry of the system and Hamiltonian still commutes with\nSz . Consequently, the average fidelity preserves its form of\nEq. (10) for FM chains and Eq. (11) for even AFM chains,\njust like the other quantities, i.e. entanglement and excitation\ntransmission amplitudes. The only difference is the fact that\nthe parameters in those formula are not deterministic anymore\nand they are random. So, similar to hyperfine interaction we\naverage over many realization of coupling disorders to get average fidelity hFav iJ and entanglement hCiJ .\nIn Fig. 5, we have plotted the average fidelity hFav iJ and\nconcurrence hCiJ for FM and AFM chains of length N = 10\nin terms of time t in the presence of exchange coupling fluctuations. Here we consider three kinds of exchange coupling\nnoises with hδk i = 0 and standard deviation σJ = 0.1J:\nwhite noise with Gaussian distribution, 1/f noise and the\nstatic noise, again with Gaussian distribution. We find that\nhFav iJ and hCiJ do not change under the action of white\nnoise. This can be explained in the way that δk (t) is a random variable which is independent at different times so, its\neffect is compensated at different time steps such that in av-\n\nFIG. 5: (Color online) Comparison of average fidelity hFav iJ and\nconcurrence hCiJ between FM (Figs. (a) and (c)) and AFM (Figs.\n(b) and (d)) chains of length N = 10 as a function of time for σJ =\n0.1J and different sort of noises such as α = 0 (white noise), α = 1\n(1/f noise) and α = ∞ (static noise). Here J is absolute value of\nthe exchange coupling between two dots.\n\nerage it does not affect the communication scheme at all. As\nit is clear from Fig. 5, the effect of 1/f noise on FM chains\nis quite similar to the static noise. These results show that\nthe faster the exchange coupling changes, the higher the fidelity and concurrence of state transfer through the quantum\ndot chain. It is worthwhile to say that the optimal time for\nhFav iJ and hCiJ , also does not change for exchange coupling fluctuations. However, for each realization the optimal\ntime might be different but since those changes are random\nwe do not have any prior knowledge about them and we have\nto take the average optimal time which is fully independent of\ndisorder in the limit of large number of trials.\nIn Fig. 6, we have shown the average fidelity hFav iJ and\nconcurrence hCiJ versus the standard deviation σJ in the\npresence of 1/f noise. hFav iJ and hCiJ decrease as the\nstrength σJ increases. For both FM and AFM chains, the\naverage fidelity hFav iJ is always beyond the classical threshold 2/3 for the length N = 10 even a disorder as strong as\nσJ = 0.2J. In comparison to FM chains, AFM chains have\nhigher average fidelity and concurrence. For instance, in the\ncase of AFM chains, hFav iJ = 0.8 while for FM chain it is\nhFav iJ = 0.66 in a chain of length N = 10 and σJ = 0.2J.\nJ\nIn Fig. 7, we give the simulation results for hFav\ni and hCiJ\nin terms of length N when considering 1/f noise. The evenodd effect of AFM chain also create the non-monotony evolutions of hFav iJ and hCiJ with respect to N . As Fig. 7 shows,\nfor very pessimistic situation σJ = 0.2J, the average fidelity\nhFav iJ in FM chains of N = 10 is equal to the classical average fidelity 2/3, while hFav iJ in AFM chains of N = 11 can\nachieve 0.75.\n\n\f7\n\nFIG. 6: (Color online) Average fidelity hFav iJ and concurrence\nhCiJ in terms of disorder strength σJ in both FM (Figs. (a) and\n(c)) and AFM chains (Figs. (b) and (d)) for different lengths. The\nred straight line at 2/3 shows the fidelity accessible to the classical\nteleportation scheme.\n\nFIG. 7: (Color online) Average fidelity hFav iJ and concurrence\nhCiJ versus the length N in both FM (Figs. (a) and (c)) and AFM\n(Figs. (b) and (d)) chains for different values of σJ . The red straight\nline at 2/3 shows the fidelity accessible to the classical teleportation\nscheme.\n\nIV.\n\nREALISTIC SCENARIO FOR QUANTUM STATE\nTRANSFERRING\n\nIn a practical case we suffer from both main sources of\nnoise simultaneously, i.e. hyperfine interaction and exchange\ncoupling fluctuations. We have considered both of these\nnoises together in Fig. 8. As it can be seen from Fig. 8,\n\nFIG. 8: (Color online) Average fidelity hFav i and concurrence hCi\nin FM (Figs. (a) and (c)) and AFM (Figs. (b) and (d)) noisy chains\nversus both Bnuc and σJ in a chain of length N = 8.\n\nboth the hyperfine interaction and exchange coupling fluctuations give a destructive impact on quantum information transmission. Comparing the influence of hyperfine interaction\nand exchange coupling fluctuation on average fidelity hFav i\nand concurrence hCi, we find that the hyperfine interaction\nis more destructive to state transfer than exchange coupling\nnoise and AFM chains is more robust against disorders than\nFM ones. The reason that the hyperfine interaction is more\ndestructive is due to the fact that it breaks the symmetry of\nthe system and changes the number of excitations during the\nevolution. This put the system out of the subspace of the initial state and gives more destructive result. Another important point to note is the fact that for the even AFM channels\nthe output state ρ0′ N remains a Werner state (a mixed state in\nwhich the singlet is mixed with identity) even in the presence\nof the hyperfine noise as it is in a random direction. For example, by averaging over 500 different noise profiles we found\nthat the deviation from the Werner state at optimal time is less\nthan 0.1% according to the matrix elements. As these states\nallow entanglement distillation according to known protocols\n[37] using even AFM quantum dot chains should be highly\ndesirable.\nAnother challenging problem for implementing quantum\nstate transfer in the laboratory is initializing the system to its\nground state. It has been shown that in the limit of large N\ncooling the system to its ground state takes an exponentially\nlong time [38, 39]. This is truly an important problem for\ngapless systems, such as ours, which the energy separation\nbetween the ground state and the excited states vanishes for\nlong chains and approaching the ground state adiabatically\nbecomes challenged. However, in our scheme we consider\nonly finite chains and there is always an energy gap between\nthe ground state and the excited states manifold. If we can\nprepare the system in a temperature T such that its thermal\n\n\f8\n\nFIG. 9: (Color online) Average fidelity hFav i (Fig (a)) and concurrence hCi (Fig (b)) in AFM chains versus temperature T in a chain\nof length N = 6 in the presence of disorder.\n\nenergy kB T , where kB is the Boltzmann constant, is less than\nits energy gap then, system is well explained by its ground\nstate. Otherwise, in thermal equilibrium at temperature T the\ninitial state of the channel is described by\nρch =\n\nexp(−Hch /(kB T ))\n.\nTr[exp(−Hch /(kB T ))]\n\n(19)\n\nB\nWe note that Hch should be replaced by Hch\nin the case\nof having hyperfine interaction. In Fig. 9, we have plotted\nthe average fidelity hFav i and concurrence hCi as functions\nof temperature T in noiseless and different disordered AFM\nchains for length N = 6. It is shown that hyperfine interaction, exchange interaction fluctuation and increasing temperature are always the deleterious effects on quantum state\ntransfer, and the hyperfine interaction is more destructive to\nsystem than exchange interaction fluctuation. Moreover, the\nevolutions of hFav i and hCi versus thermal energy kB T show\na plateau in the regime of kB T ≤ 0.1J, before going down\nfor kB T > 0.1J. This width of this plateau shows the energy\ngap between the ground state and first excited state for the finite spin chain. If the thermal energy kB T is much smaller\nthan the energy gap, it is unlikely to populate excited states so\nthat the system remains in its ground state. For AFM chain of\nlength N = 6, when both hyperfine interaction Bnuc = 0.1J\nand exchange coupling σJ = 0.1J are taken into account, the\naverage fidelity hFav i is beyond the classical fidelity 2/3 for\nkB T < 0.7J, and hFav i and hCi is beyond 0.79 and 0.49 respectively at kB T = 0.1J. Here we only consider the thermal\neffect in AFM chains, since it has been reported that AFM\nchains performs better than FM ones in quantum state transfer\nunder the thermal fluctuations [5].\n\nV.\n\nEXPLOITING OPTIMAL CONTROL THEORY FOR\nIMPROVING THE RESULTS\n\nAn important question at this stage is whether the couplings\nin the chain can be tuned to certain values for maximizing the\nfidelity of state transfer. To a certain extent, it should be possible to tune the barriers between the dots using electrostatic\ngates and thereby tune the Heisenberg interactions between\nspins. It is however known that the engineering of static couplings cannot be used in a Heisenberg chain for taking the\n\nFIG. 10: (Color online) Time evolution of average fidelity hFav iB\nand concurrence hCiB in FM (Figs. (a) and (c)) and AFM (Figs. (b)\nand (d)) quantum dot chains with optimal control for different values\nof Bnuc .\n\nFIG. 11: (Color online) Time evolution of average fidelity hFav iJ\nand concurrence hCiJ in FM (Figs. (a) and (c)) and AFM (Figs. (b)\nand (d)) quantum dot chains with optimal control for different values\nof σJ .\n\nfidelity to unity even in the absence of disorder [27]. Thus,\none may modulate one coupling in time and think of using\noptimal control theory to achieve the maximal fidelity. Optimal control theory uses a time-dependent pulse optimized to\ndrive a system from a certain initial state to the target state.\nIn this section we use the optimal control theory to improve\nthe output while the initialization process is the same as before. We simply modulate the coupling J0 (t) between spin\n0 and spin 1, just as used in [26, 40], such that the perfect\n\n\f9\nquantum state transfer can be achieved in Quantum dot chain\nat a target time tf . We numerically search for the minimal\nvalue of tf to have a fast dynamics and give less opportunity\nto disorder and external noise for their destructive effect. In an\nideal situation, in the absence of disorder, we choose J0 as the\npiecewise constant controls that can be simply approximated\nby square pulses which are preferable in practical situation.\nWe divide the time interval [0, tf ] into k equal parts, and let\nJ0 be a constant value in each subinterval. Given a sequence\nof control pulses, the Hamiltonian of the system becomes as\nH = HI + Hch , where the control Hamiltonian is\nHI = J0 (t)Ŝ0 * Ŝ1 ,\n\n(20)\n\nand J0 (t) takes a constant value in each time subinterval. Here, we adopt optimization based on quasi-Newtonian\nmethod to numerically generate the sequence of control pulses\nfor FM and AFM chains of length N = 6. We set the time\nsteps to k = 50, and attempt to find the optimal set of J0 (t) to\nmaximize the average fidelity and concurrence at a minimum\ntarget time tf . We have plotted the results in Fig. 10. We\nfind that in noiseless FM (AFM) chains of length N = 6, it\nis indeed possible to implement state transfer with almost unit\n(above 0.99) average fidelity and concurrence. The minimal\nrequired time is found to be very different in FM (tf = 24)\nand AFM (tf = 8) chains.\nComparing the required time tf for FM and AFM chains\nshows a big advantage for AFM chains due to their fast dynamics. This advantage will be clear when we consider disorder in our setup. Fig. 10 shows the time evolution of average fidelity hFav i and concurrence hCi under different hyperfine interactions for FM and AFM chains when J0 (t) varies\naccording to its optimized pulse for the ideal situation. It\nis shown that AFM chain is more robust in the presence of\nhyperfine interaction. Comparing the results of Fig. 4 and\nFig. 10 for a FM chain when Bnuc = 0.1 shows that without optimizing any coupling we have hFav iB = 0.67 and\nhCiB = 0.46 while, using optimal pulse gives hFav iB = 0.55\nand hCiB = 0.25. This means that in the presence of a strong\nhyperfine interaction the optimal control is not effective for\nFM chains and even gives lower values of hFav iB and hCiB in\ncompare to the simple methodology used in previous sections.\nThis is because dynamics is so slow (tf is large) that disorder has enough opportunity to deteriorate the output quality\nand effectively there is no gain in using optimization. In contrast, in AFM chains even when Bnuc is very strong optimization improves the results. This is because the target time tf ,\nneeded for optimization process, is comparable with the time\nneeded for ordinary transmission without optimization.\nWe can also consider the effect of exchange coupling fluctuations in the optimized coupling strategy. In Fig. 11 we\nhave plotted the time evolution of hFav i and hCi in the presence of exchange coupling fluctuations. As we expect, AFM\nchains behave better than FM chain against exchange coupling\nfluctuations, and the deteriorative effect of exchange coupling\nfluctuations is not as serious as hyperfine interaction. For this\nkind of disorder comparing our results for optimized coupling\nand non-optimized one shows that even for a strong disorder,\nσJ = 0.2, the optimization can improve the output quite sig-\n\nnificantly for both FM and AFM chains.\nVI. CONCLUSION\n\nIn summary, we have considered two inevitable types of\ndisorders in quantum dot arrays for quantum communication, i.e. hyperfine interaction and exchange coupling fluctuation. We have considered quantum information transmission through the chain in both FM and AFM phases. Our results show that disorder always has a destructive effect on the\nquality of transmission however, the AFM chains are much\nmore resistive against disorder in the array of quantum dots\nthan the FM ones. In addition, AFM chains remain depolarizing channels in the presence of disorders which makes them\nuseful for entanglement distillation. Rough verdict of the paper is that it is possible to use chains up to 10 quantum dots\nfor quantum communication with fidelity exceeding 0.9 for\nAFM even in the presence of realistic noises. The average\noptimal communication time does not change with disorder\nand also it was shown that hyperfine interaction is more destructive than the exchange coupling fluctuations. This is due\nto the fact that hyperfine interaction breaks the symmetry of\nconserving the number of excitations and consequently decoheres the quantum information more. Furthermore, we have\nshown that quantum communication can be done robustly for\nthermal energies below the energy gap in a finite spin chain.\nFinally, we showed that it is possible to improve the results\nwith modulating the first coupling in time by the means of\noptimal control theory. However, because of a longer time\nneeded for optimization, this strategy is not practically effective in FM chains when hyperfine interaction is strong.\nAcknowledgments. We thank Xiaoting Wang for his valuable comments and in particular for his help in optimization part. SB is supported by the EPSRC ARF grant\nEP/D073421/1, through which AB is also supported. SB also\nacknowledges the Royal Society and the Wolfson Foundation. SY is supported by CSC, National Fundamental Research Program (Grant No. 2009CB929601), also by National\nNatural Science Foundation of China (Grant No. 10674128\nand 60121503) and the Innovation Funds and Hundreds of\nTalents program of Chinese Academy of Sciences and Doctor Foundation of Education Ministry of China (Grant No.\n20060358043).\nAppendix A: 1/f α noise generation\n\nHere we apply Inverse Discrete Fourier Transform (IDFT)\nmethod to generate 1/f α noise [41]. The frequency spectrum\nis S(f ) = σJ /f α where, σJ is the variance and α denotes\nthe type of the noise. For instance α = 0 represents the white\nnoise while α = 1 is for 1/f noise. The IDFT of S(f ) is\ndefined as\n\ns(t) =\n\nM−1\n1 X\nS(fk )ei2π(fk −ηk )t ,\nM\nk=0\n\n(A1)\n\n\f10\nwhere, ηk 's are independent random variables with mean 0\nk\nfmax is the discrete frequency\nand variance 1 and fk = M\nbetween 0 and some numerical upper bound fmax . To show\nthat Eq. (A1) produces 1/f α noise we can generate s(t) and\nthen compute its fourier transform according to deterministic\nfrequencies. Since we have random variables ηk in the Eq.\n(A1) one can repeat the process over hundreds of times (here\nwe have done it for 1000 times) and make the average. The\nresults have been shown in Fig. 12 for α = 0 (white noise) and\nα = 1 (1/f noise) in the logarithmic scale. Fig. 12 clearly\nshows that the signal s(t), given in Eq. (A1), generates the\ndesirable frequency spectrum S(f ).\n\nFIG. 12: (Color online) The spectral density S(f ) over 1000 realizations for white noise (α = 0, red dashed line) and 1/f noise (α = 1,\nblue solid line). We have set fmax = 1000 and M = 214 .\n\n[1] S. Bose, Phys. Rev. Lett. 91, 207901 (2003).\n[2] A. Bayat and V. Karimipour, Phys. Rev. A 71, 042330 (2005).\n[3] D. Burgarth and S. Bose, Phy. Rev. A 73, 062321 (2006); J.\nM. Cai, Z. W. Zhou, and G. C. Guo, Phys. Rev. A 74, 022328\n(2006).\n[4] A. Bayat and S. Bose, Advances in Mathematical Physics,\n2010, 127182 (2010).\n[5] A. Bayat and S. Bose, Phys. Rev. A 81, 012304 (2010).\n[6] G. M. Nikolopoulos, D. Petrosyan and P. Lambropoulos, J.\nPhys.: Condens. Matter 16, 4991 (2004); G. M. Nikolopoulos, D. Petrosyan and P. Lambropoulos, Europhys. Lett. 65, 297\n(2004).\n[7] D. Petrosyan, G. M. Nikolopoulos, and P. Lambropoulos, Phys.\nRev. A 81, 042307 (2010).\n[8] C. K. Burrell, J. Eisert, T. J. Osborne, Phys. Rev. A 80, 052319\n(2009).\n[9] J. Allcock and N. Linden, Phys. Rev. Lett. 102, 110501 (2009).\n[10] A. Romito, R. Fazio, and C. Bruder, Phys. Rev. B 71,\n100501(R) (2005).\n[11] A. O. Lyakhov, C. Bruder, New J. Phys. 7, 181 (2005).\n[12] I. D. Amico, B. W. Lovett, and T. P. Spiller, Phys. Rev. A 76,\n030302(R) (2007).\n[13] T. P. Spiller, I. D. Amico, and B. W. Lovett, New J. Phys. 9, 20\n(2007).\n[14] J. M. Elzerman, R. Hanson, L. H. Willems van Beveren, B.\nWitkamp, L. M. K. Vandersypen and L. P. Kouwenhoven, Nature 430, 431 (2004).\n[15] J. M. Taylor, J. R. Petta, A. C. Johnson, A. Yacoby, C. M. Marcus, and M. D. Lukin, Phys. Rev. B 76, 035315 (2007).\n[16] R. Hanson, B. Witkamp, L. M. K. Vandersypen, L. H. Willems\nvan Beveren, J. M. Elzerman, and L. P. Kouwenhoven, Phys.\nRev. Lett. 91, 196802 (2003).\n[17] M. Kroutvar, Y. Ducommun, D. Heiss, M. Bichler, D. Schuh,\nG. Abstreiter, and J. J. Finley, Nature 432, 81 (2004).\n[18] R. Hanson and D. D. Awschalom, Nature 453, 1043 (2008).\n[19] J. R. Petta, A. C. Johnson, J. M. Taylor, E. Laird, A. Yacoby,\nM. D. Lukin, and C. M. Marcus, Science 309, 2180 (2005).\n[20] K. C. Nowack, F. H. L. Koppens, Yu. V. Nazarov, L. M. K.\nVandersypen, Science 318, 1430 (2007).\n[21] F. H. L. Koppens, J. A. Folk, J. M. Elzerman, R. Hanson, L. H.\n\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n\n[39]\n[40]\n[41]\n\nWillems van Beveren, I. T. Vink, H.-P. Tranitz, W. Wegscheider,\nL. P. Kouwenhoven, and L. M. K. Vandersypen, Science 309,\n1346 (2005).\nD. Loss and D. P. DiVincenzo, Phys. Rev. A 57, 120 (1998).\nG. Burkard, D. Loss, and D. P. DiVincenzo, Phys. Rev. B 59,\n2070 (1999).\nR. Hanson, and G. Burkard, Phys. Rev. Lett. 98, 050502 (2007).\nM. Christandl, N. Datta, A. Ekert, and A. J. Landahl, Phys. Rev.\nLett 92, 187902 (2004).\nS. G. Schirmer, I. C. H. Pullen, and P. J. Pemberton-Ross, Phys.\nRev. A 78, 062339 (2008).\nM. Wiesniak, Phys. Rev. A 78, 052334 (2008).\nR. Hanson, L. P. Kouwenhoven, J. R. Petta, S. Tarucha, and L.\nM. K. Vandersypen, Rev. Mod. Phys. 79, 1217 (2007).\nC. Flindt, T. Novotný, and A. P. Jauho, Phys. Rev. B 70, 205334\n(2004).\nW. K. Wootters, Phys. Rev. Lett. 80, 2245 (1998).\nF. H. L. Koppens, C. Buizert, K. J. Tielrooij, I. T. Vink, K. C.\nNowack, T. Meunier, L. P. Kouwenhoven, and L. M. K. Vandersypen, Nature 442, 766 (2006).\nA. C. Johnson, J. Petta, J. M. Taylor, M. D. Lukin, C. M. Marcus, M. P. Hanson, and A. C. Gossard, Nature 435, 925 (2005).\nA. V. Khaetskii, D. Loss, and L. Glazman, Phys. Rev. Lett. 88,\n186802 (2002).\nX. D. Hu and S. D. Sarma, Phys. Rev. Lett. 96, 100501 (2006).\nQ. Z. Li, L. Cywiński, D. Culcer, X. D. Hu, and S. D. Sarma,\nPhys. Rev. B 81, 085313 (2010).\nD. Paget, G. Lampel, B. Sapoval, and V. Safarov, Phys. Rev. B\n15, 5780 (1977).\nC. H. Bennett, G. Brassard, S. Popescu, B. Schumacher, J. A.\nSmolin, and W. K. Wootters, Phys. Rev. Lett. 76, 722 (1996).\nD. Aharonov, D. Gottesman, S. Irani, and J. Kempe, Comm.\nMath. Phys. 287, 41 (2009); D. Gottesman, and S. Irani, arXiv:\n0905.2419 (2009).\nA. Kay, Phys. Rev. A 80, 040301(R) (2009).\nX. Wang, A. Bayat, S. G. Schirmer, S. Bose, Phys. Rev. A 81,\n032312 (2010).\nJ. J. Lennon, Ecography 23, 101 (2000).\n\n\f"}