{"id": "http://arxiv.org/abs/0801.1369v1", "guidislink": true, "updated": "2008-01-09T08:03:41Z", "updated_parsed": [2008, 1, 9, 8, 3, 41, 2, 9, 0], "published": "2008-01-09T08:03:41Z", "published_parsed": [2008, 1, 9, 8, 3, 41, 2, 9, 0], "title": "Solar supergranulation revealed by granule tracking", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.3677%2C0801.4521%2C0801.4250%2C0801.1652%2C0801.0241%2C0801.4333%2C0801.4057%2C0801.3136%2C0801.4188%2C0801.1906%2C0801.0278%2C0801.2062%2C0801.1765%2C0801.2084%2C0801.2564%2C0801.2697%2C0801.2696%2C0801.4489%2C0801.2121%2C0801.0739%2C0801.1970%2C0801.3269%2C0801.4958%2C0801.2567%2C0801.1556%2C0801.3597%2C0801.2592%2C0801.1664%2C0801.2291%2C0801.4553%2C0801.2177%2C0801.1070%2C0801.3987%2C0801.0809%2C0801.1579%2C0801.4705%2C0801.2921%2C0801.0382%2C0801.2369%2C0801.3071%2C0801.1285%2C0801.3048%2C0801.2939%2C0801.3388%2C0801.1053%2C0801.4437%2C0801.0702%2C0801.3317%2C0801.1996%2C0801.2015%2C0801.1585%2C0801.2658%2C0801.0946%2C0801.1635%2C0801.1336%2C0801.3559%2C0801.1762%2C0801.2173%2C0801.0078%2C0801.1562%2C0801.3057%2C0801.0930%2C0801.4282%2C0801.3235%2C0801.0423%2C0801.2351%2C0801.0571%2C0801.4100%2C0801.3335%2C0801.0188%2C0801.3024%2C0801.0488%2C0801.2325%2C0801.1435%2C0801.0551%2C0801.1130%2C0801.2061%2C0801.1369%2C0801.0826%2C0801.4261%2C0801.3453%2C0801.4943%2C0801.1768%2C0801.4910%2C0801.2599%2C0801.0245%2C0801.4499%2C0801.1063%2C0801.4026%2C0801.0830%2C0801.4286%2C0801.2656%2C0801.4252%2C0801.3675%2C0801.1333%2C0801.0608%2C0801.4869%2C0801.0473%2C0801.4150%2C0801.0209%2C0801.2359&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Solar supergranulation revealed by granule tracking"}, "summary": "Context: Supergranulation is a pattern of the velocity field at the surface\nof the Sun, which has been known about for more than fifty years, however, no\nsatisfactory explanation of its origin has been proposed. Aims: New\nobservational constraints are therefore needed to guide theoretical approaches\nwhich hesitate between scenarios that either invoke a large-scale instability\nof the surface turbulent convection or a direct forcing by buoyancy. Method:\nUsing the 14-Mpixel CALAS camera at the Pic-du-Midi observatory, we obtained a\n7.5h-long sequence of high resolution images with unprecedented field size.\nTracking granules, we have determined the velocity field at the Sun's surface\nin great detail from a scale of 2.5Mm up to 250Mm.\n  Results: The kinetic energy density spectrum shows that supergranulation\npeaks at 36Mm and spans on scales ranging between 20Mm and 75Mm. The decrease\nof supergranular flows in the small scales is close to a $k^{-2}$-power law,\nsteeper than the equipartition Kolmogorov one. The probability distribution\nfunction of the divergence field shows the signature of intermittency of the\nsupergranulation and thus its turbulent nature.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.3677%2C0801.4521%2C0801.4250%2C0801.1652%2C0801.0241%2C0801.4333%2C0801.4057%2C0801.3136%2C0801.4188%2C0801.1906%2C0801.0278%2C0801.2062%2C0801.1765%2C0801.2084%2C0801.2564%2C0801.2697%2C0801.2696%2C0801.4489%2C0801.2121%2C0801.0739%2C0801.1970%2C0801.3269%2C0801.4958%2C0801.2567%2C0801.1556%2C0801.3597%2C0801.2592%2C0801.1664%2C0801.2291%2C0801.4553%2C0801.2177%2C0801.1070%2C0801.3987%2C0801.0809%2C0801.1579%2C0801.4705%2C0801.2921%2C0801.0382%2C0801.2369%2C0801.3071%2C0801.1285%2C0801.3048%2C0801.2939%2C0801.3388%2C0801.1053%2C0801.4437%2C0801.0702%2C0801.3317%2C0801.1996%2C0801.2015%2C0801.1585%2C0801.2658%2C0801.0946%2C0801.1635%2C0801.1336%2C0801.3559%2C0801.1762%2C0801.2173%2C0801.0078%2C0801.1562%2C0801.3057%2C0801.0930%2C0801.4282%2C0801.3235%2C0801.0423%2C0801.2351%2C0801.0571%2C0801.4100%2C0801.3335%2C0801.0188%2C0801.3024%2C0801.0488%2C0801.2325%2C0801.1435%2C0801.0551%2C0801.1130%2C0801.2061%2C0801.1369%2C0801.0826%2C0801.4261%2C0801.3453%2C0801.4943%2C0801.1768%2C0801.4910%2C0801.2599%2C0801.0245%2C0801.4499%2C0801.1063%2C0801.4026%2C0801.0830%2C0801.4286%2C0801.2656%2C0801.4252%2C0801.3675%2C0801.1333%2C0801.0608%2C0801.4869%2C0801.0473%2C0801.4150%2C0801.0209%2C0801.2359&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Context: Supergranulation is a pattern of the velocity field at the surface\nof the Sun, which has been known about for more than fifty years, however, no\nsatisfactory explanation of its origin has been proposed. Aims: New\nobservational constraints are therefore needed to guide theoretical approaches\nwhich hesitate between scenarios that either invoke a large-scale instability\nof the surface turbulent convection or a direct forcing by buoyancy. Method:\nUsing the 14-Mpixel CALAS camera at the Pic-du-Midi observatory, we obtained a\n7.5h-long sequence of high resolution images with unprecedented field size.\nTracking granules, we have determined the velocity field at the Sun's surface\nin great detail from a scale of 2.5Mm up to 250Mm.\n  Results: The kinetic energy density spectrum shows that supergranulation\npeaks at 36Mm and spans on scales ranging between 20Mm and 75Mm. The decrease\nof supergranular flows in the small scales is close to a $k^{-2}$-power law,\nsteeper than the equipartition Kolmogorov one. The probability distribution\nfunction of the divergence field shows the signature of intermittency of the\nsupergranulation and thus its turbulent nature."}, "authors": ["Michel Rieutord", "Nadege Meunier", "Thierry Roudier", "Sylvain Rondi", "Francis Beigbeder", "Laurent Pares"], "author_detail": {"name": "Laurent Pares"}, "author": "Laurent Pares", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20079077", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.1369v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.1369v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, accepted in Astronomy and Astrophysics (Letters)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.1369v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.1369v1", "journal_reference": null, "doi": "10.1051/0004-6361:20079077", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 9077paper\nOctober 25, 2018\n\narXiv:0801.1369v1 [astro-ph] 9 Jan 2008\n\nSolar supergranulation revealed by granule tracking\nMichel Rieutord, Nadège Meunier⋆ , Thierry Roudier, Sylvain Rondi, Francis Beigbeder and Laurent Parès\nLaboratoire d'Astrophysique de Toulouse et Tarbes, UMR 5572, CNRS et Université Paul Sabatier Toulouse 3, 14 avenue E. Belin, 31400\nToulouse, France\ne-mail: [rieutord,roudier,francis.beigbeder,pares]@ast.obs-mip.fr, nmeunier@obs.ujf-grenoble.fr, rondi@wanadoo.fr\nOctober 25, 2018\nABSTRACT\n\nContext. Supergranulation is a pattern of the velocity field at the surface of the Sun, which has been known about for more than fifty years,\nhowever, no satisfactory explanation of its origin has been proposed.\nAims. New observational constraints are therefore needed to guide theoretical approaches which hesitate between scenarios that either invoke\na large-scale instability of the surface turbulent convection or a direct forcing by buoyancy.\nMethods. Using the 14-Mpixel CALAS camera at the Pic-du-Midi observatory, we obtained a 7.5 h-long sequence of high resolution images\nwith unprecedented field size. Tracking granules, we have determined the velocity field at the Sun's surface in great detail from a scale of\n2.5 Mm up to 250 Mm.\nResults. The kinetic energy density spectrum shows that supergranulation peaks at 36 Mm and spans on scales ranging between 20 Mm and\n75 Mm. The decrease of supergranular flows in the small scales is close to a k−2 -power law, steeper than the equipartition Kolmogorov one. The\nprobability distribution function of the divergence field shows the signature of intermittency of the supergranulation and thus its turbulent nature.\n\nKey words. Convection – Turbulence – Sun: photosphere\n\n1. Introduction\nSupergranulation was discovered by Hart (1954) using Doppler\nimages of the Sun. It appeared as an essentially horizontal\nflow field at a typical scale of 30 Mm. The origin of this flow\nfield was first thought to be related to the second ionization\nof helium, which provides some latent heat at a depth around\n10 Mm, compatible with their typical size (Simon & Weiss\n1968). This scenario has been much debated because of the\nweakness of the effect and the apparent vigour of the supergranular flow. Other ways of generating this velocity scale\nrely on large-scale instabilities of the surface turbulent flow\n(Rieutord et al. 2000), triggered by the strong density stratification. In this scenario, kinetic energy of granules, the small-scale\nconvective cells, is thought to be piped to a larger scale by an\nAKA-like effect (Gama et al. 1994). However, other kinds of\nlarge-scale instabilities are still possible, like a convective instability triggered by fixed-flux boundary conditions imposed\nby the small-scale granular convection (Rincon & Rieutord\n2003). In this approach, the cooling resulting from the granulation does not suppress the convective instability of the larger\nscales; because all the heat flux is carried by the small scale,\nnone is carried by the large scale instability, which shows litSend offprint requests to: M. Rieutord\n⋆\nPresent address: Laboratoire d'Astrophysique, Observatoire de\nGrenoble, BP 53, 38041 Grenoble cedex 9\n\ntle temperature fluctuations (see Meunier et al. 2007a). Besides\nthese scenarios, recent observations of Gizon et al. (2003)\nadded some wavelike properties to supergranulation.\nObviously, the supergranulation theory needs guidance\nfrom every available observational constraint. This letter\npresents the results of the observations issued from the CALAS\nproject (a CAmera for the LArge scales of the Sun; see\nMeunier et al. 2005), collecting a sequence of high resolution\nwide field images, which have allowed us to capture the evolution of a hundred supergranules at the disc centre during 7.5 h.\nWe can thus give new constraints on the dynamics of the solar\nsurface in the supergranulation range. After a brief description\nof the data set (Sect. 2), we show the spectral side of the supergranular flow (Sect. 3) as well as the probability distribution\nfunctions of the divergences (Sect. 4); first conclusions follow.\n\n2. Observational techniques and data reduction\n\n2.1. Data set\nOn 13 March 2007, we observed the Sun at disc centre during\n7.5 h using the Lunette Jean Rösch at Pic du Midi, a 50 cmrefractor. Images were taken at λ = 575±5nm, with a 14Mpixel\nCMOS-camera (4560×3048 pixels), with 0.115 arcsec/pixel,\nthus covering of 524×350 arcsec2 (see Fig. 1). 10811 images\nwere obtained with a regular cadence of one every 2.5s. Two in-\n\n\f2\n\nRieutord et al.: Solar supergranulation\n\n350\"\n524\"\n\nFig. 1. Bottom right: the CALAS field of view on the Sun; the large rectangle indicates the size of the images, the smaller one\nshows the field where the velocities could be computed, while the small square shows the field of view of the SOT instrument on\nthe Hinode satellite when tracking granules. Top: the supergranulation velocity field with the divergence contours superimposed\n(scales shorter than 8 Mm have been filtered out). A time-window of 150 min was used. Bottom left: a zoom on granulation\nshowing the relative sizes of granules and supergranules.\ndependent series of ∼ 1400 images were then extracted. They\nsample the same solar signal with a period of 20s but are noised\ndifferently by the Earth atmospheric perturbations. The comparison between the outputs of both series allows us to evaluate\nthe influence of the seeing and test the robustness of the results\nwith respect to this noise.\n\nBecause of tracking difficulties, the common field of each\nseries was reduced to ∼400×300 arcsec2 , thus covering a surface of 290×216 Mm2 on the Sun (Fig. 1).\n\nAfter recentering, subimages were k − ω filtered (with a\nthreshold of 7 km/s), so as to remove, as much as possible,\nEarth atmospheric distortion, which is the main source of noise\n\n\fRieutord et al.: Solar supergranulation\n\nFig. 2. Kinetic energy spectra obtained for various time windows. The vertical dotted line indicates the position of the peak\nat 36.4 Mm. The vertical dashed line emphasizes the 10 Mm\nscale, usually taken as the upper limit of mesogranular scale.\nTwo power laws are shown on each side of the peak, as well as\nthe one of small-scale noise.\n\n2.2. Velocity fields\nHorizontal velocity fields have been obtained using the CST\ngranule tracking algorithm (Roudier et al. 1999; Rieutord et al.\n2007). As shown in Rieutord et al. (2001), granules' motions\ntrace large-scale velocity fields when the scale is larger than\n2.5 Mm. Hence, we sampled the velocity field with a bin of 12\npixels (∼1 Mm).\nThe velocities are obtained by tracking the granules during\na given time window. Thus, we have access to average velocity components, namely v x (i, j) and vy (i, j), where the overline\nrefers to the time averaging imposed by the time window. This\naveraging improves the signal-to-noise ratio, but naturally decreases the time resolution. Typically, the shortest time window\nthat can be used is 30 min.\nAlthough the field is large, projection effects of the spherical Sun are still of weak influence. At most, in the field corners,\nthe correction on the velocity would be less than 4%, which is\nmuch less than the noise.\nWe show in Fig. 1 an example of these velocity fields. The\nsmall-scale components of the flow (with scales below 8 Mm)\nwere filtered out using Daubechies wavelets (see Rieutord et al.\n2007). Figure 1 shows that robust steady supergranules live\namong a wide variety of flow structures illustrating the turbulent nature of these scales and their wide spectral range.\n3. The kinetic energy spectrum\nA convenient way to view the dynamics of a flow is to examine the spectral content of the velocity field. We therefore\n\n3\n\nFig. 3. Same as in Fig. 2 but for the horizontal divergence of\nthe flow, ∂ x v x + ∂y vy (solid line), and for the vertical vorticity,\n∂ x vy − ∂y v x (dashed line); the supergranulation peak is clearly\nvisible at λ = 36 Mm in the divergence spectrum but absent in\nthe vorticity one. A k2 -power law is given for comparison.\ncomputed the spectral density of kinetic energy E(k) associated with the horizontal flows that we can measure. It is such\nthat\nZ ∞\n1\nE(k)dk .\n< v2 >=\n2\n0\nE(k), which is computed in the same way as in Rieutord et al.\n(2000), is displayed in Fig. 2 for the flows determined with various time-windows. The short time-windows of 45 min give us\n10 independent spectra, which are averaged together, while the\nwhole series 450 min time-window gives us only one spectrum.\nNote that no spatial filtering was applied to the velocity field.\nWe see that E(k) ∝ k at small scale, which is the signature of\ndecorrelated random noise.\nThese spectra clearly show the emergence of the spectral range of the supergranulation as the length of the timewindow increases. Let us point out the remarkable stability of\nthe wavenumber of the spectral peak when the time averaging is\nchanged. This demonstrates that supergranulation is a genuine\nvelocity field at the Sun's surface. It is not the consequence\nof time-averaging the small, fast turning-over small scales. Of\ncourse, if the averaging interval is long enough (i.e. of the order of the turn-over time scale of supergranulation), the spectral\npeak will move to ever larger scales before disappearing. The\nmaximum of the spectral density is at a wavelength of 36 Mm.\nThe FWHM of the peak indicates that supergranulation occupies the range of scales of [20, 75] Mm.\nThe present mean value of the diameter of supergranules is\nslightly higher than the previous determinations. For instance,\n\n\f4\n\nRieutord et al.: Solar supergranulation\n\nMeunier et al. (2007b) find a mean diameter of 31.4 Mm with a\ntechnique based on the segmentation of the divergence field derived from velocities issued from a local correlation technique\napplied to SOHO/MDI white light images. Del Moro et al.\n(2004) also use a divergence field but derived from timedistance helioseismology; they find a mean size of 27 Mm, significantly smaller than ours.\nBoth of these results are based on the divergence field and\nits segmentation. The histogram of sizes is then used to determine the mean diameter of a supergranule. Such a technique\nnecessarily underestimates the actual scale of supergranular\nflows as only part of it (the positive divergences) is used. Our\nspectra, which directly result from the measured horizontal velocities, incorporate all the components of the flow at supergranulation scale, and thus better reflect the dynamical state.\nNote that a blind use of the divergence spectrum in Fig. 3 would\npoint to a scale of ∼ 23 Mm.\nIn Fig. 2 we also indicate the best-fit power laws, which\nmimic the sides of the supergranulation peak. We find that\nE(k) ∼ k3 on the large-scale side and E(k) ∼ k−2 on the\nsmall-scale one. This latter power law is steeper than the −5/3\nKolmogorov one and may be an effect of density stratification.\nTo complete the spectral picture, we also show, in Fig. 3,\nthe spectra of the horizontal divergence of the velocity field and\nthe vertical vorticity. Beyond the k2 -dependence of the spectral\ndensities, which is a consequence of the derivative of uncorrelated noise, we can see that the divergence spectrum clearly\nshows the supergranulation peak, while the vertical vorticity\nshows no signal in this range. The vorticity does show some\nweak signal however, but in the mesogranulation range, below\n10 Mm.\n\n4. Probability density functions\nAnother way to look at the velocity fields is to consider the\nprobability density functions. Such distributions have been\ncomputed for the velocity field, its divergence and its curl. We\nshow in Fig. 4 the distribution of the divergence field when\nscales shorter than 8 Mm have been filtered out of the velocity\nfield. This distribution clearly shows a positive wing larger than\nthe Gaussian one, associated with a skewness of 0.38. We also\nnote that the noise of the Earth atmosphere is weak enough, and\ndoes not perturb the result. This trend to an exponential distribution is a signature of intermittency (e.g. Frisch 1995). This\nresult, with the same asymmetry between positive and negative values, was also observed by Meunier et al. (2007b) with\na completely different set of data and method. Thus, the intermittency of supergranulation seems to be a robust property.\nExponential wings are usually less visible on the velocity (e.g.\nVincent & Meneguzzi 1991), and, indeed, are barely noticeable\nin our data. As far as vorticity is concerned, the noise is unfortunately too high to give convincing measurements.\n\n5. Conclusions\nFor the first time, it has been possible to follow the motion\nof well-resolved granules in a large field of view. The spectral peak of supergranulation has thus been determined in a\nvery direct manner. According to our data, supergranulation\nhas the most energetic motions at a scale of 36 Mm and en-\n\nFig. 4. Histograms of the divergences; solid and dashed lines\nhave the same solar signal but a different noise from the Earth\natmosphere. Scales below 8 Mm have been filtered out. A\nGaussian distribution with the same standard deviation is overplotted for comparison.\n\ncompasses all the scales ranging from 20 to 75 Mm, as shown\nby the FWHM of the peak. Except for its amplitude, this peak is\nnot sensitive to the time window used to measure the granules'\nmotions. The signal also clearly appears in the divergence spectral density, but not in the vorticity; it is likely that vorticity at\nsupergranulation scale near the Sun's equator is much weaker\nand does not emerge from the noise.\nFinally, our data confirm the fact that supergranulation has\na noticeable degree of intermittency, clearly appearing in the\ndistribution of positive divergence values.\nAs far as the origin of supergranulation is concerned, the\nscenarios mentioned in the introduction can be tested with\nthese data, either in the real space with velocity fields like the\none shown in Fig. 1 or in the spectral space with the given spectra.\nFurther work on the observational side will focus on the\ndetermination of the third component of the velocity field, the\nincrease of the field size and the reduction of the noise, so as to\nfurther constrain the dynamics of scales from the granulation\none to the 100 Mm one.\nAcknowledgements. The CALAS project has been financially supported by the French ministery of education (ACI), by the Programme\nNational Soleil-Terre of CNRS and the Observatoire Midi-Pyrénées.\nWe are also very grateful to the \"Groupe d'Intrumentation des Grands\nTélescopes (GIGT)\" of the laboratory, for their technical help at various phase of the project, especially to Sébastien Baratchart and Elodie\nBourrec. We also wish to thank René Dorignac for his efficient support in mechanical realizations and Philippe Saby for his help in sorting out the right computing hardware. SR wishes to thank the CNRS\n\n\fRieutord et al.: Solar supergranulation\nfor its support during his PhD thesis which much contributed to the\nproject.\n\nReferences\nDel Moro, D., Berilli, F., Duvall, T., & Kosovichev, A. G. 2004,\nSolar Phys., 221, 23\nFrisch, U. 1995, Turbulence : the legacy of A. N. Kolmogorov\n(Cambridge University Press)\nGama, S., Vergassola, M., & Frisch, U. 1994, J. Fluid Mech.,\n260, 95\nGizon, L., Duvall, T. L., & Schou, J. 2003, Nature, 421, 43\nHart, A. B. 1954, MNRAS, 114, 17\nMeunier, N., Rondi, S., Tkaczuk, R., Rieutord, M., &\nBeigbeder, F. 2005, in Astronomical Society of the Pacific\nConference Series, Vol. 346, Large-scale Structures and their\nRole in Solar Activity, ed. K. Sankarasubramanian, M. Penn,\n& A. Pevtsov, 53\nMeunier, N., Tkaczuk, R., & Roudier, T. 2007a, A & A, 463,\n745\nMeunier, N., Tkaczuk, R., Roudier, T., & Rieutord, M. 2007b,\nA & A, 461, 1141\nRieutord, M., Roudier, T., Ludwig, H.-G., Nordlund, Å., &\nStein, R. 2001, A & A, 377, L14\nRieutord, M., Roudier, T., Malherbe, J. M., & Rincon, F. 2000,\nA & A, 357, 1063\nRieutord, M., Roudier, T., Roques, S., & Ducottet, C. 2007, A\n& A, 471, 687\nRincon, F. & Rieutord, M. 2003, in SF2A-2003: Semaine\nde l'Astrophysique Francaise, ed. F. Combes, D. Barret,\nT. Contini, & L. Pagani, 103\nRoudier, T., Rieutord, M., Malherbe, J., & Vigneau, J. 1999, A\n& A, 349, 301\nSimon, G. W. & Weiss, N. O. 1968, Zeit. für Astrophys., 69,\n435\nTkaczuk, R., Rieutord, M., Meunier, N., & Roudier, T. 2007, A\n& A, 471, 695\nVincent, A. & Meneguzzi, M. 1991, J. Fluid Mech., 225, 1\n\n5\n\n\f"}