{"id": "http://arxiv.org/abs/1011.4447v1", "guidislink": true, "updated": "2010-11-19T15:18:58Z", "updated_parsed": [2010, 11, 19, 15, 18, 58, 4, 323, 0], "published": "2010-11-19T15:18:58Z", "published_parsed": [2010, 11, 19, 15, 18, 58, 4, 323, 0], "title": "Spin canting as a result of the competition between stripes and spirals\n  in cuprates", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.1411%2C1011.5033%2C1011.2931%2C1011.3808%2C1011.1258%2C1011.6421%2C1011.5755%2C1011.0056%2C1011.2826%2C1011.0472%2C1011.5429%2C1011.5053%2C1011.0470%2C1011.3729%2C1011.1764%2C1011.5581%2C1011.1706%2C1011.5198%2C1011.4447%2C1011.5620%2C1011.6225%2C1011.5424%2C1011.1373%2C1011.1528%2C1011.4005%2C1011.0498%2C1011.0739%2C1011.2447%2C1011.4812%2C1011.0531%2C1011.4166%2C1011.4281%2C1011.0479%2C1011.3775%2C1011.3539%2C1011.1700%2C1011.6132%2C1011.2292%2C1011.5067%2C1011.3868%2C1011.0243%2C1011.4936%2C1011.1559%2C1011.3180%2C1011.6568%2C1011.1472%2C1011.1616%2C1011.0286%2C1011.6621%2C1011.4904%2C1011.3945%2C1011.0699%2C1011.1938%2C1011.0837%2C1011.3052%2C1011.4995%2C1011.2964%2C1011.3416%2C1011.5908%2C1011.0637%2C1011.3694%2C1011.6233%2C1011.3643%2C1011.0383%2C1011.6435%2C1011.3351%2C1011.2818%2C1011.4955%2C1011.2263%2C1011.5930%2C1011.6330%2C1011.3514%2C1011.3630%2C1011.4062%2C1011.0556%2C1011.2590%2C1011.3592%2C1011.4108%2C1011.1498%2C1011.6367%2C1011.5654%2C1011.0337%2C1011.5516%2C1011.3182%2C1011.1702%2C1011.6528%2C1011.6502%2C1011.2665%2C1011.0477%2C1011.3759%2C1011.2029%2C1011.5939%2C1011.2991%2C1011.3536%2C1011.3014%2C1011.1723%2C1011.2414%2C1011.3966%2C1011.5667%2C1011.2974%2C1011.5352&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spin canting as a result of the competition between stripes and spirals\n  in cuprates"}, "summary": "Based on the extended Hubbard model we calculate the energy of stripe and\nspiral ground states. We find that uniform spirals get favored by a large\n$t'/t$ ratio but are unstable at small doping towards stripes and checkerboard\ntextures with spin canting. The structure of these inhomogeneities also depends\non t'/t and the associated spin currents may induce a small lattice distortion\nassociated with local dipole moments. We discuss a new kind of stripe which\nappears as a domain wall of the antiferromagnetic (AF) order parameter with a\nfractional change of the phase of the AF order. For large |t'/t| spirals can be\nstabilized under certain conditions in the overdoped regime which may explain\nthe elastic incommensurate magnetic response recently observed in iron-codoped\nBi2201 materials.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.1411%2C1011.5033%2C1011.2931%2C1011.3808%2C1011.1258%2C1011.6421%2C1011.5755%2C1011.0056%2C1011.2826%2C1011.0472%2C1011.5429%2C1011.5053%2C1011.0470%2C1011.3729%2C1011.1764%2C1011.5581%2C1011.1706%2C1011.5198%2C1011.4447%2C1011.5620%2C1011.6225%2C1011.5424%2C1011.1373%2C1011.1528%2C1011.4005%2C1011.0498%2C1011.0739%2C1011.2447%2C1011.4812%2C1011.0531%2C1011.4166%2C1011.4281%2C1011.0479%2C1011.3775%2C1011.3539%2C1011.1700%2C1011.6132%2C1011.2292%2C1011.5067%2C1011.3868%2C1011.0243%2C1011.4936%2C1011.1559%2C1011.3180%2C1011.6568%2C1011.1472%2C1011.1616%2C1011.0286%2C1011.6621%2C1011.4904%2C1011.3945%2C1011.0699%2C1011.1938%2C1011.0837%2C1011.3052%2C1011.4995%2C1011.2964%2C1011.3416%2C1011.5908%2C1011.0637%2C1011.3694%2C1011.6233%2C1011.3643%2C1011.0383%2C1011.6435%2C1011.3351%2C1011.2818%2C1011.4955%2C1011.2263%2C1011.5930%2C1011.6330%2C1011.3514%2C1011.3630%2C1011.4062%2C1011.0556%2C1011.2590%2C1011.3592%2C1011.4108%2C1011.1498%2C1011.6367%2C1011.5654%2C1011.0337%2C1011.5516%2C1011.3182%2C1011.1702%2C1011.6528%2C1011.6502%2C1011.2665%2C1011.0477%2C1011.3759%2C1011.2029%2C1011.5939%2C1011.2991%2C1011.3536%2C1011.3014%2C1011.1723%2C1011.2414%2C1011.3966%2C1011.5667%2C1011.2974%2C1011.5352&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Based on the extended Hubbard model we calculate the energy of stripe and\nspiral ground states. We find that uniform spirals get favored by a large\n$t'/t$ ratio but are unstable at small doping towards stripes and checkerboard\ntextures with spin canting. The structure of these inhomogeneities also depends\non t'/t and the associated spin currents may induce a small lattice distortion\nassociated with local dipole moments. We discuss a new kind of stripe which\nappears as a domain wall of the antiferromagnetic (AF) order parameter with a\nfractional change of the phase of the AF order. For large |t'/t| spirals can be\nstabilized under certain conditions in the overdoped regime which may explain\nthe elastic incommensurate magnetic response recently observed in iron-codoped\nBi2201 materials."}, "authors": ["G. Seibold", "R. S. Markiewicz", "J. Lorenzana"], "author_detail": {"name": "J. Lorenzana"}, "author": "J. Lorenzana", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.83.205108", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.4447v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.4447v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.4447v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.4447v1", "journal_reference": "Phys. Rev. B 83, 205108 (2011)", "doi": "10.1103/PhysRevB.83.205108", "fulltext": "Spin canting as a result of the competition between stripes and spirals in cuprates\nG. Seibold,1 R.S. Markiewicz,2, 3 and J. Lorenzana3\n1\n\narXiv:1011.4447v1 [cond-mat.str-el] 19 Nov 2010\n\nInstitut Für Physik, BTU Cottbus, PBox 101344, 03013 Cottbus, Germany\n2\nPhysics Department, Northeastern University, Boston MA 02115, USA\n3\nISC-CNR and Dipartimento di Fisica, Università di Roma \"La Sapienza\", P. Aldo Moro 2, 00185 Roma, Italy\n(Dated: November 5, 2018)\nBased on the extended Hubbard model we calculate the energy of stripe and spiral ground states.\nWe find that uniform spirals get favored by a large t′ /t ratio but are unstable at small doping towards\nstripes and checkerboard textures with spin canting. The structure of these inhomogeneities also\ndepends on t′ /t and the associated spin currents may induce a small lattice distortion associated\nwith local dipole moments. We discuss a new kind of stripe which appears as a domain wall of the\nantiferromagnetic (AF) order parameter with a fractional change of the phase of the AF order. For\nlarge |t′ /t| spirals can be stabilized under certain conditions in the overdoped regime which may\nexplain the elastic incommensurate magnetic response recently observed in iron-codoped Bi2201\nmaterials.\nPACS numbers: 71.27.+a, 73.22.Gk, 75.10.Lp\n\nI.\n\nINTRODUCTION\n\nThe investigation of Hubbard type models with regard to solutions exhibiting modulated magnetic order is\nto a large extent motivated by (in)elastic neutron scattering experiments on high-temperature superconductors\n(for an overview cf. Ref. 1). Especially in the underdoped regime many compounds show a pronounced low\nenergy spin response which is peaked away from the antiferromagnetic wave-vector. For overdoped samples of\nlanthanum cuprates it has been shown2 that these low\nenergy incommensurate spin fluctuations vanish at the\nsame concentration where superconductivity disappears\nthus suggesting a close relation between both phenomena.\nThere are basically three possibilities which can account for the observed incommensurate spin response.\nFirst, the system can be close to a magnetic instability which in a random-phase approximation based treatment would strongly enhance the magnetic susceptibiliy\nat the corresponding wave-vectors. Moreover, in case of\na superconducting (SC) d-wave gap the depletion of low\nenergy spectral weight induces quasi undamped low energy incommensurate spin excitations which merge at the\nantiferromagnetic wave-vector into the famous resonance\npeak.3–5 This scenario is very popular in optimally doped\nYBCO, since the experimentally observed energy of the\nresonance peak scales with the SC transition temperature\nTc as expected for this model. However, one could also\nenvisage a situation of real symmetry breaking in the spin\nchannel where (in terms of the above counting) the second and third possibilities correspond to ordered phases\nin the transverse and longitudinal spin channel, respectively. Since the charge couples to the square of the magnetic order parameter one expects in the latter case also a\nconcomitant charge modulation. In lanthanum cuprates\n(LCO), doped with Ba or codoped with Nd or Eu, 6–8\nthe third scenario is now well established. In these compounds the spin response even becomes static and con-\n\ncomitant charge order appears, which first was evidenced\nthrough the coupling to the lattice6 but recently more directly through soft resonant x-ray scattering.9,10 The fact\nthat the periodicity of the charge modulation is half that\nof the spin strongly suggests that these materials have\na so called 'striped ground state', i.e. quasi one dimensional antiphase domain walls of the antiferromagnetic\norder host the doped charge carriers. A polarized neutron scattering study on La1.48 Nd0.4 Sr0.12 CuO4 11 in fact\nsuggests that the magnetic order is one-dimensionally\nmodulated although some two-dimensional noncollinear\nstructure12 may not be excluded.\nIt is worth noting that stripe textures have been predicted as stable Hartree-Fock (HF) saddle points of the\nHubbard model13–15 before they were found experimentally in cuprates (and nickelates). However, it was realized early on that one has to include correlations beyond\nHF in order to correctly describe the experimental data\nin lanthanum cuprates. In the past years two of us have\nperformed detailed investigations within the Gutzwiller\napproximation (GA) supplemented with Gaussian fluctuations which allowed for the explanation of the doping dependent incommensurability and various transport\nproperties16,17 , the optical conductivity18 and magnetic\nexcitations19,20 on the basis of striped ground states.\nNon codoped lanthanum cuprates show a low energy\ninelastic incommensurability with a doping dependence\nrather similar to that of the codoped compounds suggesting the existence of some form of fluctuating and\n(or) disordered stripe order. Moreover, below a doping\nδ = 0.055 the magnetic response rotates from vertical\n(i.e. along the Cu-O bond direction) to diagonal, becoming static and one-dimensional with the associated\nmodulation along the orthorombic b∗ -axis, also in agreement with the stripe picture. On the other hand, direct\nprobes of charge order are more difficult to obtain, leaving some room for the existence of incommensurate magnetic structures without charge order such as spirals. Although there are good hints from local probes like NMR,\n\n\f2\nNQR21–24 and tunneling25 that point to charge ordered\nstates, it is worth examining the possibility that transverse spin (spiral) textures exist.\nEven more controversial is the situation in YBCO, the\nsecond class of high-Tc compounds which have been intensively investigated by neutron scattering (NS) experiments.1 Since in optimally doped YBCO the low energy incommensurate magnetic response shows up below\nTc , one line of thought is that the signal corresponds to\nthe dispersion of a bound exciton which is formed inside\na d-wave superconducting gap.26–30 However, it should\nbe noted that for underdoped YBCO the observation of\nan incommensurate (and even static) spin response also\nabove Tc 31,32 raises questions about this interpretation.\nIn any case, the lack of experimental evidence for charge\nmodulation in YBCO (which if dynamic or disordered\nis of course hard to detect) makes it difficult to conclusively attribute the incommensurate magnetic response\nto stripes as in codoped LCO, though it has been successfully described within a model based on slowly fluctuating (or disordered) charge stripes.33 Also the quantum\noscillations found in underdoped YBCO34 are compatible\nwith a reconstruction of the Fermi surface due to stripe\norder.35,36\nDue to the lack of large single crystals other cuprate\nsuperconductors are less intensively studied by NS than\nthe aforementioned compounds. However, a recent\nstudy has revealed elastic incommensurate magnetic\npeaks in an overdoped Bi1.75 Pb0.35 Sr1.9 CuO6+z sample\n[(Bi,Pb)2201] codoped with iron.37 Within the error bars\nthe doping δ ≈ 0.23 and the measured incommensurability ε ≈ 0.21 seem to extend the relation ε ≈ δ\n(which holds for underdoped lanthanum cuprates38 ) to\nlarge doping without saturation at δ ≈ 0.12.\nAn alternative to stripes in order to account for the incommensurate spin response in cuprates is based on the\nformation of spirals. These textures are characterized by\na homogeneous periodic and planar rotation of the Cu\nmoments with no associated charge modulation. Thus at\nfirst glance spirals seem to be a promising candidate for\nthose cuprates in which incommensurate magnetic fluctuations have been observed without charge fluctuations,\nand corresponding theories have been recently put forward in Refs. 39–41.\nWithin Hubbard-type models spiral solutions have\nbeen investigated on the basis of HF,42–44 slave-boson (or\nGA)42,43,45–47 and dynamical mean-field48 calculations.\nThe energies of stripes and spirals have been computed\nwithin HF49 and slave-boson methods45,46 based on the\nHubbard model. These latter investigations have found\na strong influence of the ratio between next-nearest and\nnearest neighbor hopping t′ /t on the respective stability of both textures. Here our starting point is similar, however, we show that the low doping phase separation instability of spirals can lead to the formation\nof nanoscale charge and spin inhomogeneities with sub-\n\nstantial spin canting. Stripes and spirals should therefore\nbe viewed only as limiting cases of these more complex\nspin and charge textures. We discuss our findings with\nregard to recent neutron scattering experiments on ironcodoped lanthanum50 and bismuth37 cuprate superconductors. The paper is organized as follows. In Sec. II we\nintroduce the formalism and present our results in Sec.\nIII. Discussion and conclusions are presented in Sec. IV.\n\nII.\n\nFORMALISM\n\nOur starting point is the one-band Hubbard model\nX\nX\nni,↑ ni,↓ ,\n(1)\ntij c†i,σ cj,σ + U\nH=\ni,j,σ\n\ni\n\nwhere ci,σ (c†i,σ ) destroys (creates) an electron with spin\nσ at site i, and ni,σ = c†i,σ ci,σ . U is the on-site Hubbard repulsion and tij denotes the hopping parameter\nbetween sites i and j. We restrict to hopping between\nnearest (∼ t) and next-nearest (∼ t′ )neighbors. Our approach is based on the Gutzwiller variational wave function |Ψg i = Pg |SDi where Pg is the Gutzwiller projector and |SDi a Slater determinant. For |SDi we use\na state with arbitrary charge and spin order, including\nspin canting. We define the associated one-body denσ1 ,σ2\n= hSD|ĉ†jσ2 ĉiσ1 |SDi. The wave-function\nsity as ρij\noptimization problem leads to a generalized Gutzwiller\napproximation51 which on the saddle-point level is equivalent to the Kotliar-Ruckenstein slave-boson approach52.\nThe derivation of the spin-rotational invariant Gutzwiller\nenergy functional can be found in Ref. 53\nX\nX\nDi .\n(2)\ntij hΨi † zi zj Ψj i + U\nE GA =\ni,j\n\ni\n\nHere we have defined the spinor operators\n\u0012\n\u0013\nci↑\n†\n†\n†\nΨi = (ci↑ , ci↓ ) Ψi =\nci↓\nand the z-matrix\n\n\nSi−\nzi↑ cos2 φ2i + zi↓ sin2 φ2i\nz [zi↑ − zi↓ ] cos φi\n2S\ni\n\nzi =  S +\n2 φi\n2 φi\ni\n[z\n−\nz\n]\ncos\nφ\nz\nsin\n+\nz\ncos\nz\ni↑\ni↓\ni\ni↑\ni↓\n2S\n2\n2\ni\n\ntan2 φi =\n\nSi+ Si−\n.\n(Siz )2\n\nand for clarity spin expectation values in the Slater\n−\ndeterminant are denoted by Si+ = ρ↑,↓\n= ρ↓,↑\nii , Si\nii ,\n↑,↑\n↓,↓\n↑,↑\n↓,↓\nz\nSi = (ρii − ρii )/2, and ρii = ρii + ρii . In the limit\nof a vanishing rotation angle φ the z-matrix becomes diagonal and the renormalization factors\n\n\f3\n\nziσ\n\nq\nq\nSiz\n−\nD\n)\n+\n(1 − ρi + Di )( 12 ρi + cos(φ\nDi ( 21 ρi −\ni\n)\ni\nq\n=\nSiz\nSiz\n)(1 − 12 ρi − cos(φ\n)\n( 21 ρi + cos(φ\ni)\ni)\n\nreduce to those of the standard GA. Spiral solutions are\nthen computed by minimizing E GA with respect to a\nhomogeneous rotation of spins with wave-vector Q\nSix = S0 cos(QRi )\nSiy = S0 sin(QRi ).\n\n(3)\n\nIn the present paper we usually measure modulations\nwith respect to AF order QAF = (π, π) (lattice constant\na = 1) and set Q = QAF − q. Stripe solutions are obtained by restricting the magnetization to the z direction\nresulting in a modulation of Siz with Q and a simultaneous modulation of ρi with 2Q similar to our previous\nwork .54,55 However, we also consider stripes and other\ncharge ordered states with spin canting in Sec. III B.\nIII.\n\nRESULTS\n\nIn order to fix the value for the onsite repulsion U we\nrefer to a previous paper where we have shown that a\ntime-dependent extension of the GA with U/t = 8 can\naccurately reproduce the magnon excitations of undoped\nLCO20 as revealed by neutron scattering.56 Since U/t\nshould not vary among the cuprate materials we restrict\nto U/t = 8 but investigate the dependence on the nextnearest neighbor hopping t′ /t which from LDA computations has been shown to specify the various high-Tc\nfamilies.57 Note that the results of Refs. 45,46 have been\nobtained with a significantly larger value of U/t = 12.\nA.\n\nSpirals vs. stripe states\n\nFig. 1 shows the energy landscape for spiral solutions\n(hole doping measured from half-filling δ = 0.2) for different values of t′ /t. With increasing |t′ /t| one observes a\nshift of the minimum from the vertical (qx , 0) and (0, qy )\ndirections towards the diagonal. Thus in the parameter\nregime relevant for LCO compounds |t′ /t| ∼ 0.1 . . . 0.2\nthe incommensurate scattering direction for the corresponding doping is correctly reproduced.\nWe note that also for other dopings only vertical or\ndiagonal spiral textures correspond to minima of the energy landscape in agreement with previous investigations\n.42,43,45–47 This can be easily understood from the nesting curves58 which are also shown in Fig. 1 below the\nenergy contours. Basically these are q = 2kF plots (kF\nbeing the Fermi momentum) of the paramagnetic system backfolded in the 0 ≤ qx,y ≤ π quadrant. As discussed in Ref. 58 the dominant instabilities occur for\n\nSiz\ncos(φi )\n\n− Di )\n\nthose wave vectors which correspond to a crossing of two\nnesting curves ('double nesting'). These double nesting\npoints determine the maximum susceptibilities and are\nalways found to lie along high-symmetry directions. The\nchange from vertical to diagonal spirals upon increasing\nt′ /t can therefore be understood from the appearance of\nan additional 'antinodal' double nesting vector along the\n(0, 0) → (π, π) direction which starts to dominate over\nthose along the (π, π) → (π, 0), (0, π) directions.\nThe spiral is a realization of the corresponding instabilities, but the wave-vectors of energy minima and double\nnesting in Fig. 1 do not exactly coincide, as may be seen\nby comparing the nesting curves with the contour maps\nin lower parts of Fig. 1a,b,c. The Stoner criterion gives\nthe correct nesting vector at the instability threshold, but\nas U/t increases the optimal q can shift. From 1 it can\nbe seen that for U/t = 8 the spiral minimum coincides\nwith the nesting curve near t′ /t = −0.2, but is closer to\n(further from) (π, π) for large (smaller) t′ /t.\nFig. 2 compares the doping evolution of vertical and\ndiagonal spiral wave-vectors, for t′ /t = −0.2 and t′ /t =\n−0.4, with the corresponding values for vertical stripes\n(cf. also Ref. 54,59). The incommensurability is defined\nin terms of the wave-vector q of the dominant Fourier\ncomponent of the magnetization as\nε=\n\n|QAF − q|\n2π\n\nFor stripes we restrict to regular, periodic stripe ground\nstates with integer d (in terms of the lattice constant)\nseparation between the charge stripes which amounts to\na magnetic periodicity 2d and an incommensurability,\nε=\n\n1\n2d\n\nwhich develops a staircase structure, Fig. 2. The steps\noccur at the crossing of the corresponding energy curves\n(cf. Fig. 3). It is also convenient to define the number\nof doped holes per unit length along the stripe ν = δd\nwhich is related to the incommensurability by\nε=\n\nδ\n.\n2ν\n\n(4)\n\nGiven a certain number of holes one can ask if it is\nmore favorable to add them to a small number of stripes\nwith a large stripe filling or in a large number of stripes\nwith a small stripe filling. For widely separated stripes\none can determine an optimum linear density νo from\n\n\f4\nthe minimum of the energy per hole with respect to halffilling16,54\neh =\n\nENh − EAF\n.\nNh\n\n(5)\n\nHere ENh is the total energy of the system doped with Nh\nholes. We find it convenient to use eh to characterize the\ncompetition among the different phases at all dopings.\nFig. 3 compares eh for stripes and spirals as a function\nof doping for t′ /t = −0.2 and t′ /t = −0.4, respectively.\nFor stripes the individual curves correspond to vertically\noriented domain walls and are labeled by the charge periodicity d. The optimum filling for large d is given by\nνo = dδo with δo corresponding to the doping at the\ncurve minimum. Notice that νo becomes independent\nof d for large d and takes the value νo = 0.55(0.4) for\nt′ /t = −0.2(−0.4). The change of νo with t′ is expected\naccording to the results of Ref. 54.\nA constant νo implies via Eq. (4) a linear relation between doping and incommensurability. In other words\nthe optimum filling determines the slope in the famous\nYamada plot.38\nWhere does the linear relation breaks down? The\ncharged core of the stripe has a characteristic width ξ\nso that when the charge periodicity d is larger than ξ\nthere are negligible interstripe interactions and doping\nproceeds by increasing the number of stripes. Therefore\nthe relation is linear for d > ξ. In this regime the value\nof eh at the minimum is independent of doping.\nFor d . ξ stripe overlap becomes important and doping\nproceeds by increasing the charge of stripes. From Fig. 2\nwe see that ξ ∼ 4(5) for t′ /t = −0.2(−0.4) which can be\nchecked directly from the charge profile (see Ref. 54).\nAs mentioned above the incommensurability for stripes\nshows a staircase structure. For small doping (d > ξ),\nsince interstripe interactions are negligible, one can produce a practically continuous curve by considering combinations of solutions with periodicity d and d + 1. This\nbecomes very costly for d . ξ which is consistent with the\ntendency of the incommensurability to develop a plateau\nat doping larger than ν0 ξ ∼ 1/8.\nAs remarked before,16,20,54 the linear relation for small\ndoping and the plateau for large doping reproduce the\ndoping dependence of the incommensurate low energy\nmagnetic response of lanthanum cuprates as revealed\nby neutron scattering experiments38 and reproduced in\nFig. 2.\nFor spirals, a minimum of eh at doping δs indicates\nthat if the frustration due to the long-range Coulomb\ninteraction is ignored60 , the system will lower its energy\nby phase separating in undoped regions and spiral regions\nof doping δs . Contrary to the stripes, for spirals one\nobserves a continuous increase of ε(δ). Nevertheless, both\nphases show similar evolution of incommensurability with\ndoping and indeed fairly similar values of ε(δ) up to δ ∼\nνo ξ.\nFor larger doping this agreement is lost due to the tendency of stripes to make wide plateaus. In fact, both spi-\n\nrals and stripes originate from the same magnetic instability, the doping dependence of which has been analyzed\nfor cuprate parameters in Ref. 58. In particular, it is the\nplateau in the spin susceptibility close to QAF = (π, π)\n(cf. Fig. 1 in Ref. 58) which drives the system unstable\ntowards spiral or stripe order for sufficiently large on-site\nrepulsion U/t. We will come back to this point in the\nnext section when discussing recent elastic neutron scattering experiments on overdoped Fe-LSCO50 where the\nresulting incommensurabilities are shown as solid circles\nin Fig. 2.\nWe proceed by comparing the doping dependence of\nthe energy minima which determine the orientation and\nrespective stability of spirals and stripes. It should be\nnoted that at low doping diagonal stripes are almost accidentally degenerate with vertical stripes with a negligibly\npreference for diagonal textures.17 Therefore other mechanisms like long-range Coulomb interactions, multiband\neffects, and lattice distortions are decisive in determining\nthe exact stripe state in the very underdoped regime. In\nthe following we restrict for simplicity to vertical stripes.\nThe envelope (dashed-dotted line) for this set of curves\nrepresents the doping evolution for the stripe minimum\nenergy and determines the doping dependence of the incommensurability as shown in Fig. 2.\nThe energy minima of the spiral landscape (cf. Fig.\n1) are also shown in Fig. 3 as solid and dashed lines for\ndiagonal and vertical spirals, respectively. As anticipated\nfrom Fig. 1 the crossover from diagonal to vertical spirals\nshifts towards higher doping with increasing |t′ /t| and\nit is found that for t′ /t = −0.4 diagonal solutions are\nlower in energy over practically the whole doping range.\nHowever, for both diagonal and vertical spirals eh has a\nminimum at δs which means that for doping smaller than\nδs spiral ground states are unstable with respect to phase\nseparation as mentioned above. The resulting energy of\nthe phase separated solutions calculated from a Maxwell\nconstruction is shown as a thin horizontal solid line in\nFig. 3.\nAlso shown in Fig. 3 (full circle) is the energy of a single hole which is self-trapped in a spin-polaronic state.\nSince the corresponding charge is localized within a fivesite plaquette with small ferromagnetic polarization, eh\nfor a many-polaron state will be independent of doping up to the point where polaron-polaron interactions\nbecome noticeable. For t′ /t = −0.2, both spirals and\npolarons are unstable with respect to the stripe phase,\nwhereas (diagonal) spirals become the stable phase for\nlarger |t′ /t|, consistent with the results of Ref. 58.\n\nB.\n\nCharge order states with spin canting\n\nThe above finding that low doping spirals are unstable\ntowards phase separation does not require that macroscopic phase separation is the ground state. There could\nexist inhomogeneous solutions with even lower energy.\nOne could envisage e.g. an elliptical spiral61 correspond-\n\n\f5\n\na) t'/t=0\n\nLSCO\n(Bi,Pb)2201+Fe\n\n-0.81\nE/N-0.82\n\n-0.81\n\n-0.83\n\n-0.82\n\n0\nπ/2\nπ π\n\nπ/2\n\n0\n\nincommensurability [tetrag. units]\n\ndiag. spiral, t'/t=-0.2\n\n-0.8\n\nvert. spiral, t'/t=-0.2\n\n0.2\n\n0.1\ndiag. spiral, t'/t=-0.4\nvert. spiral, t'/t=-0.4\nstripe, t'/t=-0.2\nstripe, t'/t=-0.4\nFe-LSCO\n\nb) t'/t=−0.2\n\n0\n\n-0.75\n-0.75\nE/N-0.77\n-0.77\n-0.79\n-0.79\n\n0\nπ/2\nπ π\n\nπ/2\n\n0\n\n0\n\n0.05\n\n0.1\n\n0.15\n\ndoping δ\n\n0.2\n\n0.25\n\n0.3\n\nFIG. 2: (color online) Doping evolution of the spiral and stripe\nwave-vectors q for t′ /t = −0.2 and t′ /t = −0.4 expressed\nin terms of the incommensurability. Note that the staircase\nstructure of the stripe incommensurability is only explicitly\nshown for larger doping. The solid diamonds show the doping dependent incommensurability in LCO ('Yamada plot')\nand are reproduced from Ref. 38. The solid square corresponds to the elastic neutron scattering data on iron-codoped\n(Bi,Pb)2201 from Ref. 37. Solid circles report the incommensurability of Fe-LSCO from Ref. 50.\n\nc) t'/t=−0.4\n-0.75\n-0.77\nE/N\n-0.79\n-0.81\n\n-0.75\n-0.77\n-0.79\n-0.81\n\n0\nπ/2\nπ π\n\nπ/2\n\n0\n\nFIG. 1: (color online) Energy of spiral solutions (per lattice\nsite and in units of t) as a function of spiral momentum Q =\n(qx , qy ) (in units of the lattice constant a ≡ 1). Doping δ =\n0.2. The lines in the (qx , qy , 0)-plane correspond to the nesting\ncurves58 , obtained for the same doping in the paramagnetic\nstate.\n\ning to spin structure\nSix = S0 cos(α) cos(QRi )\nSiy = S0 sin(α) sin(QRi ).\n\n(6)\n\nwhich connects stripe and spiral states [cf. Eq. (3)] by\ntuning the eccentricity from α = 0 to α = π/4. As\ndiscussed below there are more complex structures which\nminimize the energy.\n\nBy performing an unconstrained minimization of the\nspin-rotational GA energy functional62 Eq. (2) on finite\nclusters, we find that for t′ /t = −0.4 the low doping solutions are diagonal stripes with significant spin canting.\nAn example is shown in Fig. 4(a) and the corresponding\nenergy is indicated by the full square in Fig. 3(b). This\ntexture is characterized by a domain wall of the antiferromagnetic order which has a fractional phase change of\nthe AF order parameter ∆θ < π (with θ the angle between the staggered magnetization and the quantization\naxis) contrary to collinear stripes which have ∆θ = π.\nThus instead of building up a macroscopic phase separation between undoped AF and doped spiral regions\n(doping δ ≈ 0.11 as can be read from Fig. 3b), the system prefers to separate these textures at the nanoscale,\ncorresponding to the modulated structure shown in Fig.\n4(a). The material has clearly separated into ferromagnetically ordered diagonal lines which are at the center\nof 3-site wide spiral stripes with an average doping of\nδ ≈ 0.11 and undoped AF regions located between these\nstripes.\nResearch on multiferroics63,64 has shown that spin\ncanting produces a force on the ligand ions via the\nDzyaloshinskii-Moriya (DM) interaction65–68 which in\nsome cases can lead to a uniform dipole moment. For the\ncomplicate textures we find the distortion is not uniform\nbut can act as an experimental signature of the canted\nphases which we describe in some detail.\nIf we think of the one-band Hubbard model as embed-\n\n\f6\n-1.2\n\nenergy per hole [t]\n\n-1.4\n-1.5\n\na)\n\ndiag. spiral\nvert. spiral\nPolaron\nstripes\n\n-1.3\n\nd=10\n8\n\n3\n\n5\n\n6\n\n4\n\n-1.6\n\na) t'/t=-0.2\ncanted diag. stripe\n\n-1.4\n3\n\n-1.6\n\nd=10\n\n5\n\n4\n\nb) t'/t=-0.4\n-1.8\n\n0\n\n0.1\n\ndoping δ\n\n0.2\n\nFIG. 3: (color online) Comparison of diagonal (blue solid) and\nvertical (red dashed) spirals with the energy of stripes (thin\ngrey lines) for t′ /t = −0.2 (a) and t′ /t = −0.4 (b). The enveloping curve (dash–dotted) of the stripe energies is a guide\nto the eye. Vertical dotted lines indicate the concentration\nof zero compressibility for diagonal spirals and the thin solid\nline follows from the Maxwell construction. The full circle\ncorresponds to the energy of a single spin polaron and the\nsquare is the energy of the spin-canted diagonal stripe which\nis shown in Fig. 4.\n\nb)\n\nded in the cuprate lattice, then the spin canting causes\na force on the oxygen atoms, leading to a structural distortion of the CuO2 planes. In the presence of spin-orbit\ninteractions one can add to the Hamiltonian the following\nDM and elastic term:\nHDM =\n\nX\n\nDM\nλun+1/2 * fn,n+1\n,\n\n(7)\n\nn\n\nHE =\n\nXk\nn\n\n2\n\n|un+1/2 |2\n\nwhere u are the oxygen displacements and the DM force\nfield is given by fijDM ≡ ei,j × Si × Sj . Here en,n+1 is\na unit vector joining nearest neighbor Cu atoms. The\nproduct Si × Sj is also known as the chiral vector order\nparameter.70\nFor definiteness, we assume that the spins lie in the\nCuO2 plane, as is approximately true for the cuprates. In\nthis case, only the components of Si × Sj perpendicular\nto this plane are finite, and fijDM lies in the plane at\nright angles to the Cu-O-Cu bond. Once fijDM becomes\nfinite, HE + HDM is minimized by developing a finite inplane oxygen displacement perpendicular to the Cu-Cu\nbond. Due to the breaking of inversion symmetry around\nthe oxygen atoms, this relaxation creates a local dipole\nmoment.\n\nFIG. 4: a) Diagonal stripe solution with spin canting. The\n(hole) charge is accumulated on the lines with ferromagnetically aligned spins (parallel to the z-direction). b) Corresponding pattern of DM spin-currents jDM\nwhich are assigned\ni\nto the lattice by summing the in- P\nand outgoing currents of\nthe connecting bonds, i.e. jDM\n= j jDM\ni\nij . 16 × 16 system\nwith 16 holes corresponding to doping x = 1/16. U/t = 8,\nt′ /t = −0.4.\n\nIn the following we use the 'DM current' (or force flux)\njDM\n≡ |fijDM |ei,j = |Si × Sj |ei,j\nij\n\n(8)\n\nin order to characterize the ground state magnetization\npattern.71,72 These currents lie in the same plane as the\nspins and for the canted diagonal stripes are shown in\n\n\f7\nFig. 4(b). One observes a maximal current perpendicular to the stripes with its direction alternating from stripe\nto stripe, so that the periodicity is the same as for the\nunderlying spin structure. In contrast to the elliptic spirals, Eq. (6), which have a finite net force flux, the total\nspin force vanishes for our diagonal solution with an even\nnumber of stripes. The structure of the texture shown in\nFig. 4 can be decomposed in harmonics as\nX\nSix =\nSnx cos(Q(n) Ri )\n\na)\n\nn\n\nSiy =\n\nX\n\nSny cos(Q(n) Ri )\n\n(9)\n\nn\n\n2π\n(n)\n= QAF − nq.\nwith q = ( 2π\n16 , 16 ) and we have set Q\nThe solution breaks spin rotational symmetry, so the relative weights of the Fourier components on the x and y\nmagnetization directions depend on the particular solution or quantization axis. For the choice shown in Fig. 4\nthe amplitudes are zero in the x (y) direction for n even\n(odd). The nonzero amplitudes are given by S1x ≈ 0.24,\nS0y ≈ 0.03, and S2y ≈ 0.1. Therefore the x-component\nof the spin structure [Fig. 4(a)] induces incommensurate\n2π\ncorrelations at Q = (π − 2π\n16 , π − 16 ) and weaker ones at\n4π\nhigher harmonics, Q = (π − 16 , π − 4π\n16 ), etc. In addition,\nthe y-component leads to (weaker) commensurate corre3π\nlations at Q = (π, π) and Q = (π − 3π\n16 , π − 16 ), etc.. Interestingly, this implies that in neutron scattering a weak\ncommensurate peak will appear, a feature that may be\nhard to distinguish experimentally from phase separation\nbetween commensurate and incommensurate stripes.\nFor smaller values of |t′ /t|, stripes do not profit from\nthe transverse spin degrees of freedom and the energy\nof the spin canted solution is approximately that for the\ncollinear solutions (cf. square symbol in Fig. 3(a)). Nevertheless, the finding that very different patterns are so\nclose in energy suggests that stripes will be very susceptible to quenched disorder, inducing charge-spin glass\nbehavior and making it difficult to obtain clear stripes\nsignatures.\n\nC.\n\nb)\n\nCheckerboard order for larger |t′ /t|\n\nIn general, the spin canting allows the system to make\na compromise between ferromagnetic order (which is favored for large |t′ /t|73,74 and AF order induced by the\nlocal correlations. The fact that local ferromagnetism occurs for large values of the next-nearest neighbor hopping\nwas also found to play a role in the stabilization of twodimensional checkerboard textures with small ferron type\nclusters for large values of t′ /t = −0.5.59 These structures\noptimize the gain in kinetic energy for a collinear twodimensional spin arrangement and turn out to be more\nstable than (collinear) stripes in this parameter regime.\nBased on our present findings it is thus natural to investigate the stability of spin-canted checkerboard textures.\nFig. 5(a) shows the minimum energy solution for 16\nholes on a 16 × 16 lattice for t′ /t = −0.5. Similar to our\n\nFIG. 5: Spin structure (a) and DM spin currents (b) for the\ntwo dimensional 'checkerboard' structure with spin canting.\nRegions with larger hole density are enclosed by boxes. 16 ×\n16 system with 16 holes corresponding to doping x = 1/16.\nU/t = 8, t′ /t = −0.5.\n\nprevious findings in Ref. 59 it is only for such large values of t′ /t that two-dimensional textures are stabilized\nover the (spin-canted) stripe solutions. The doped holes\nare confined to 2 × 2 plaquettes which are indicated by\nthe dashed squares in Fig. 5(a). The overall pattern consists of a 'checkerboard' array of boxes each containing\nfour charge plaquettes. The planar spin structure is no\nlonger incommensurate but has dominant correlations at\nthe AF wave-vector together with a finite ferromagnetic\n\n\f8\nmoment. Again, the spin structure can be characterized\nby the associated \"DM spin currents\" which are shown\nin Fig. 5(b). Here the centers of each box appear as a\nspin current sink whereas the center and corners of the\nlattice between boxes appear as sources for the spin current. Note that: 1) there is no net DM spin current as\nfor a spiral so there will be no net dipole moment, 2) according to our definition the DM spin currents are useful\nto visualize the expected lattice distortions but do not\ncorrespond to currents of a conserved quantity.\nWe have also investigated the stability of vortex lattices which have been proposed by Fine12 but found\nthem always higher in energy than the checkerboard-type\nstructures.\n\nIV.\n\nDISCUSSION AND CONCLUSIONS\n\nIn a recent publication,58 the magnetic phase diagram\nof cuprates was computed in terms of Fermi surface nesting, which determined the critical interactions U as a\nfunction of doping, and the leading incommensurate Q\nvectors at threshold. The present calculations work at\nfixed U above threshold, but in general find very similar\nQ values at fixed doping. Thus, for t′ /t = −0.4, Fig. 3(b)\nshows a crossover from diagonal to vertical Q as doping\nδ decreases. While Ref. 58 correctly predicted this local\nminimum, it missed the fact that the global minimum is\ndetermined by (nanoscale) phase separation. Similarly\nfor t′ /t = −0.2, the Q of the vertical stripes is consistent with Fermi surface nesting58 for δ ≥ 1/8, but not at\nlower doping.\nOur investigations have revealed that the nature of\nsymmetry-broken states in underdoped cuprates strongly\ndepends on the strength of the next-nearest neighbor\nhopping. A value of t′ /t, which is appropriate for lanthanum cuprates57 stabilizes striped ground states so\nthat the present analysis supports our related calculations on charge and magnetic excitations18–20 as well as\ntransport properties16 in these compounds. Naturally\nthe wave-function of such inhomogeneous textures is determined by states far from the Fermi energy so that\none may question the present single-band analysis. However, we have checked by explicitly evaluating spirals and\nstripes within the three-band model that the conclusions\nof the present paper stay valid but the role of t′ /t is\nplayed by the oxygen-oxygen hopping parameter.\nIn Fig. 2 we also show data from recent neutron scattering experiments50 on Fe-LSCO. In these overdoped\nsamples an elastic incommensurate spin response was\nfound close to the dominant nesting vectors as extracted\nfrom ARPES experiments. It was thus concluded that\nthe induced incommensurate response signals an inherent\ninstability of the itinerant charge carriers, being different\nfrom the low doping stripes arising from localized Cu\nspins. Within our calculations (cf. Fig. 2) the data are\nrather close to the incommensurability curve of stripes\nobtained for t′ /t = −0.2, which is the appropriate value\n\nfor LSCO.\nSince our calculations are based on an itinerant approach, there is no 'dichotomy' between low doping 'localized' spin stripes and large doping itinerant ones, but\nboth appear as different limits of the same model. In\nfact, at these large dopings one can also regard the stripes\nas arising from an instability of the 'nearby' (in energy)\nparamagnet similar to the spiral case as discussed in context to Fig. 1. In other words, increasing the doping one\ncan go continuously from a stripe state at low doping\nto an itinerant spin-density wave (SDW) at high doping\nwhich disappears at a second order transition to become\na uniform paramagnet.\nAt fixed doping one finds an analogous SDW instability with increasing U . For t′ /t = −0.2 and δ = 0.3 the\nspin density wave instability occurs at Q = (0.67π, π)\nand critical interaction Uc /t ∼ 2. We can therefore view\nthe d = 3 stripes (which have a similar periodicity) as the\nrealization of this instability whereas spirals for these parameters have higher energy. Our GA calculations yield\na charge modulation of only 8% for the d = 3 stripes at\nδ ∼ 0.25 which should be considered as an upper bound\nsince our calculation neglects the effect of fluctuations. It\nmay be therefore experimentally difficult to distinguish\nbetween a stripe and spiral state in this doping range.\nFor larger values of |t′ /t| as relevant for e.g. bismuthate\nhigh-Tc cuprates we have found that spiral textures are\nlower in energy than stripes in which canting is not allowed. If this latter restriction is relaxed, stripes and\ncheckerboard states with a substantial spin canting become again more stable. This can be understood from\nthe fact that spirals are unstable at low doping towards\nphase separation so that stripes and checkerboard states\ncan be seen as nanoscale phase separated states.\nIt is interesting to remark that the more stable stripe\nat small doping is a novel kind of stripe with a fractional\nchange in the phase of the order parameter as opposed to\nthe usual π change. These states can be experimentally\ndetected because they have a finite Bragg peak weight\nboth at the commensurate AF wave vector QAF = π, π\nand at the incommensurate positions but can also be easily confused with phase separation among stripes and the\ncommensurate antiferromagnet phase.\nAs shown in Figs. 4(b) and 5(b) the spin canting induces the flow of DM spin currents along the bonds of\nthe lattice which are associated with the force flux fijDM .\nDue to the breaking of inversion symmetry arising from\nthe oxygen displacements, such DM spin currents may\nbe associated with an electric polarization P ∼ fijDM .75\nFor the diagonal structure shown in Fig. 4(b), P would\npoint along the stripe but in alternate directions from\nstripe to stripe. On the other hand, in the nearly AF\nordered regions between the domain walls the DM spin\ncurrents and thus the electric polarization almost vanish.\nThe spin canted stripe can therefore also be considered\nas a one-dimensional 'antiferroelectric' with a vanishing\nnet polarization.76\nIn the overdoped regime and for sufficiently large |t′ /t|\n\n\f9\nspirals do not phase separate and under certain conditions may constitute the ground state in cuprate superconductors. In this regard, the recent elastic NS\nstudy37 on (Bi,Pb)2201 codoped with iron is interesting since it reveals incommensurate magnetic correlations with ε ≈ 0.21 at a doping concentration δ ≈ 0.23.\nOur present computations shown in Fig. 2 suggest that\nthe elastic neutron scattering data from Ref. 37 are\ncompatible with vertical spirals provided that the value\nof the next-nearest hopping for Bi2201 is in the range\n−0.4 < t′ /t < −0.2. LDA calculations by Pavarini and\ncoworkers57 yield a value of t′ /t ≈ −0.25 for Bi2 Sr2 CuO6\nwhere our results (cf. Fig. 3) suggest that vertical spirals are still more favorable than diagonal ones and may\neven dominate over stripes. Naturally, our computations\nwhich are for perfectly modulated spirals, can only be\nqualitative since the measured coherence length of the\nmagnetic modulation37 is of the order of the iron distance. Therefore additional effects like disorder and the\nmagnetic moments arising from the Fe dopants should\nalso be taken into account which is, however, beyond the\nscope of the present paper.\nIn the underdoped regime it is unlikely that uniform\nspirals will survive. Although for large |t′ /t| the phase\nseparated spiral has nominally lower energy than the\nstripes, the macroscopically phase separated state implies\na charge imbalance ∼ 0.1e per Cu which would result in\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n13\n\nR. Birgeneau, C. Stock, J. M. Tranquada, and K. Yamada,\nJ. Phys. Soc. Jpn. 75, 111003 (2006).\nS. Wakimoto, H. Zhang, K. Yamada, I. Swainson,\nHyunkyung Kim, and R. J. Birgeneau, Phys. Rev. Lett.\n92, 217004 (2004).\nJ. Rossat-Mignod, L.P. Regnault, C. Vettier, P. Bourges,\nP. Burlet, J. Bossy, J.Y. Henry, and G. Lapertot, Physica\nC 185-189, 86 (1991).\nH.A. Mook, M. Yethiraj, G. Aeppli, T.E. Mason, and T.\nArmstrong, Phys. Rev. Lett. 70, 3490 (1993).\nH.F. Fong, B. Keimer, P.W. Anderson, D. Reznik, F. Dogan, and I.A. Aksay, Phys. Rev. Lett. 75, 316 (1995).\nJ. M. Tranquada, B. J. Sternlieb, J. D. Axe, Y. Nakamura,\nand S. Uchida, Nature (London) 375, 561 (1995).\nM. Fujita, H. Goka, K. Yamada, and M. Matsuda, Phys.\nRev. Lett. 88, 167008 (2002).\nKlauss, H.-H. and Wagener, W. and Hillberg, M. and Kopmann, W. and Walf, H. and Litterst, F. J. and Hücker, M.\nand Büchner, B., Phys. Rev. Lett. 85, 4590 (2000).\nP. Abbamonte, A. Rusydi, S. Smadici, G. D. Gu, G. A.\nSawatzky, and D. L. Feng, Nature Phys. 1, 155 (2005).\nJ. Fink, E. Schierle, E. Weschke, J. Geck, D. Hawthorn,\nV. Soltwisch, H. Wadati and H.-H. Wu, Phys. Rev. B 79,\n100502 (2009).\nN.B. Christensen, H. M. Rønnow, J. Mesot, R. A. Ewings,\nN. Momono, M. Oda, M. Ido, M. Enderle, D. F. McMorrow, and A. T. Boothroyd, Phys. Rev. Lett. 98, 197003\n(2007).\nB. V. Fine, Phys. Rev. B 75, 060504(R) (2007)\nK. Machida, Physica C 158, 192 (1989).\n\na prohibitive Coulomb cost.60 Even without long-range\nCoulomb interaction a nanoscale phase separated state\nhas lower energy.\nClearly the spin polarons, the checkerboard states as\nwell as stripes, having charge inhomogeneities, will couple with impurities resulting in a spin and charge spin\nglass state consistent with experiments. Since this state\nwill have substantial spin-canting it becomes rather semantic to distinguish it from the disordered spiral ground\nstate as proposed by Sushkov.39–41 For small |t′ /t| we expect that short-range diagonal stripes order dominates\nin this state as observed experimentally although with a\ncorrelation length of the static incommensurate response\nof the same order as the periodicity.77 One should therefore rather think of a disordered state with meandering\nstripe which can profit from the impurity potential.\n\nAcknowledgments\n\nG.S. acknowledges financial support from the Deutsche\nForschungsgemeinschaft. RSM's research is supported by\nthe U.S.D.O.E contracts DE-FG02-07ER46352 and DEAC03-76SF00098. J. Lorenzana's research is partially\nsupported by the Italian Institute of Technology-Seed\nproject NEWDFESCM.\n\n14\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\nH. J. Schulz, Phys. Rev. Lett. 64, 1445 (1990).\nJ. Zaanen and O. Gunnarsson, Phys. Rev. B40, 7391\n(1989).\nJ. Lorenzana and G. Seibold, Phys. Rev. Lett. 89, 136401\n(2002).\nG. Seibold and J. Lorenzana, Phys. Rev. B 80, 012509\n(2009); G. Seibold and J. Lorenzana, to appear in Physica\nC.\nJ. Lorenzana and G. Seibold, Phys. Rev. Lett. 90, 66404\n(2003).\nG. Seibold and J. Lorenzana, Phys. Rev. Lett. 94, 107006\n(2005).\nG. Seibold and J. Lorenzana, Phys. Rev. B 73, 144515\n(2006).\nS. Krämer and M. Mehring, Phys. Rev. Lett. 83, 396\n(1999).\nP.M. Singer, A.W. Hunt, and T. Imai, Phys. Rev. Lett.\n88, 047602 (2002).\nJ. Haase, C.P. Slichter, and C.T. Milling, J. Supercond.\n15, 339 (2002).\nD. Rybicki, J. Haase, M. Greven, G. Yu, Y. li, Y. cho, and\nX. Zhao, J. Supercond. Nov. Magn. 22, 129 (2009).\nY. Kohsaka, C. Taylor, K. Fujita, A. Schmidt, C. Lupien,\nT. Hanaguri, M. Azuma, M. Takano, H. Eisaki, H. Takagi,\nS. Uchida, and J. C. Davis, Science 315 (2007).\nM. Lavagna and G. Stemmann, Phys. Rev. B 49, 4235\n(1994).\nD. Z. Liu, Y. Zha, and K. Levin, Phys. Rev. Lett. 75, 4130\n(1995).\nJ. Brinckmann and P. A. Lee, Phys. Rev. Lett. 82, 2915\n\n\f10\n\n29\n30\n\n31\n\n32\n\n33\n\n34\n\n35\n\n36\n\n37\n\n38\n\n39\n\n40\n\n41\n42\n\n43\n44\n\n45\n\n46\n\n47\n\n48\n\n49\n50\n\n51\n52\n\n53\n\n(1999).\nM. R. Norman, Phys. Rev. B 61, 14751 (2000).\nI. Eremin, D. K. Morr, A. V. Chubukov, K. Bennemann,\nand M. R. Norman, Phys. Rev. Lett. 94, 147001 (2005).\nS. M. Hayden, H. A. Mook, P. Dai, T. G. Perring, and F.\nDogan, Nature (London) 429, 531 (2004).\nV. Hinkov, P. Bourges, S. Pailhès, Y. Sidis, A. Ivanov, C.\nD. Frost, T. G. Perring, C. T. Lin, D. P. Chen, and B.\nKeimer, Nature Physics 3, 780 (2007).\nM. Vojta, T. Vojta, and R. K. Kaul, Phys. Rev. Lett. 97,\n097001 (2006).\nN. Doiron-Leyraud, C. Proust, D. LeBoeuf, J. Levallois,\nJ.-B. Bonnemaison, R. Liang, D. A. Bonn, W. N. Hardy,\nand Louis Taillefer, Nature 447, 565 (2007).\nA. J. Millis and M. R. Norman, Phys. Rev. B 76,\n220503(R) (2007).\nS.E. Sebastian, N. Harrison, P.A. Goddard, M.M. Altarawneh, C.H. Mielke, R. Liang, D.A. Bonn, W.N. Hardy,\nO.K. Andersen, and G.G. Lonzarich, arXiv:1001.5015.\nH. Hiraka, Y. Hayashi, S. Wakimoto, M. Takeda, K. Kakurai, T. Adachi, Y. Koike, I. Yamada, M. Miyazaki, M.\nHiraishi, S. Takeshita, A. Kohda, R. Kadono, J. M. Tranquada, and K. Yamada, arXiv:0907.3590.\nK. Yamada, C. H. Lee, K. Kurahashi, J. Wada, S. Wakimoto, S. Ueki, H. Kimura, Y. Endoh, S. Hosoya, G. Shirane, R. J. Birgeneau, M. Greven, M. A. Kastner, and Y.\nJ. Kim, Phys. Rev. B57, 6165 (1998).\nO. P. Sushkov and V. N. Kotov, Phys. Rev. Lett. 94,\n097005 (2005).\nA. Lüscher, A. I. Milstein, and O. P. Sushkov, Phys. Rev.\nLett. 98, 037001 (2007).\nO. P. Sushkov, Phys. Rev. B 79, 174519 (2009).\nE. Arrigoni and G. C. Strinati, Phys. Rev. B 44, 7455\n(1991).\nF. F. Assaad, Phys. Rev. B 47, 7910 (1993).\nA. V. Chubukov and K. A. Musalian, Phys. Rev. B 51,\n12605 (1995).\nM. Raczkowski, R. Frésard, and A. M. Oleś, Europhysics\nLetters 76, 128 (2006);\nM. Raczkowski, R. Frésard, and A. M. Oleś, Phys. Stat.\nSol. (b) 244, 2521 (2007).\nR. Frésard and P. Wölfle, J. Phys. Condens. Matter 4, 3625\n(1992).\nM. Fleck, A. I. Lichtenstein, A. M. Olés, and L. Hedin,\nPhys. Rev. B60, 1999.\nJ. Zaanen and A. J. Olès, Ann. Physik 5, 224 (1996).\nR.-H. He, M. Fujita, M. Enoki, M. Hashimoto, S. Iikubo,\nS.-K. Mo, H. Yao, T. Adachi, Y. Koike, Z. Hussain, Z.-X.\nShen, and K. Yamada, arXiv:1009.1417.\nF. Gebhard, Phys. Rev. B 41, 9452 (1990).\nG. Kotliar and A. E. Ruckenstein, Phys. Rev. Lett. 57,\n1362 (1986).\nJ. Lorenzana and G. Seibold, Low Temp. Physics, 32, 320\n(2006).\n\n54\n\n55\n\n56\n\n57\n\n58\n\n59\n\n60\n\n61\n\n62\n\n63\n64\n\n65\n66\n67\n\n68\n\n69\n\n70\n\n71\n\n72\n\n73\n\n74\n\n75\n\n76\n\n77\n\nG. Seibold and J. Lorenzana, Phys. Rev. B 69, 134513\n(2004).\nR. S. Markiewicz, J. Lorenzana, and G. Seibold, Phys. Rev.\nB 81, 014510 (2010).\nR. Coldea, S. M. Hayden, G. Aeppli, T. G. Perring, C. D.\nFrost, T. E. Mason, S.-W. Cheong, and Z. Fisk, Phys. Rev.\nLett. 86, 5377 (2001).\nE. Pavarini, I. Dasgupta, T. Saha-Dasgupta, O. Jepsen,\nand O.K. Andersen, Phys. Rev. Lett. 87, 047003.\nR. S. Markiewicz, J. Lorenzana, G. Seibold, and A. Bansil,\nPhys. Rev. B 81, 014509 (2010).\nG. Seibold, J. Lorenzana, and M. Grilli, Phys. Rev. B 75,\n100505(R) (2007).\nC. Ortix, J. Lorenzana, and C. Di Castro, Phys. Rev. B\n73, 245117 (2006).\nO. Zachar, S. A. Kivelson, and V. J. Emery, Phys. Rev. B\n57, 1422 (1998).\nG. Seibold, E. Sigmund, and V. Hizhnyakov, Phys. Rev.\nB 57, 6937 (1998); G. Seibold, Phys. Rev. B 58, 15520\n(1998).\nS. W. Cheong and M. Mostovoy, Nature Mat. 6, 13 (2007).\nM.I. Katsnelson, Y.O. Kvashnin, V.V. Mazurenko, and\nA.I. Lichtenstein, Phys. Rev. B82, 100403 (2010).\nI. Dzyaloshinskii, J. Phys. Chem. Solids 4, 241 (1958).\nT. Moriya, Phys. Rev. 120, 91 (1960).\nD. Coffey, T.M. Rice, and F.C. Zhang, Phys. Rev. B44,\n10112 (1991); N.E. Bonesteel, T.M. Rice, and F.C. Zhang,\nPhys. Rev. Lett. 68, 2684 (1992); N.E. Bonesteel, Phys.\nRev. B47, 11302 (1993).\nW. Koshibae, Y. Ohta, and S. Maekawa, Phys. Rev. B47,\n3391 (1993);\nT. Yildirim, A.B. Harris, A. Aharony, and O. EntinWohlman, Phys. Rev. B52, 10239 (1995).\nS. Onoda and N. Nagaosa, Phys. Rev. Lett. 99, 027206\n(2007).\nNote that jDM\ndiffers from the ground state spin current\nij\nwhich describes the flow of the conserved magnetization\nand vanishes in our GA mean-field approach72 .\nF. Schütz, P. Kopietz, and M. Kollar, Eur. Phys. J. B 41,\n557 (2004).\nT. Tohyama and S. Maekawa, Phys. Rev. B 49, 3596\n(1994).\nT. Hanisch, E. Müller-Hartmann, and G. S. Uhrig, Phys.\nRev. B 56, 13960 (1997).\nH. Katsura, N. Nagaosa, and A. V. Balatsky, Phys. Rev.\nLett. 95, 057205 (2005).\nThe 'antiferroelectric' situation depends of course on the\nperiodicity of the stripe structure. A different periodicity\nalong (1, 1) may also result in a ferroelectric state.\nS. Wakimoto, R. J. Birgeneau, M. A. Kastner, Y. S. Lee, R.\nErwin, P. M. Gehring, S. H. Lee, M. Fujita, Y. Yamada,\nY. Endoh, K. Hirota, and G. Shirane, Phys. Rev. B 61,\n3699 (2000).\n\n\f"}