{"id": "http://arxiv.org/abs/1103.1467v2", "guidislink": true, "updated": "2011-05-13T07:33:04Z", "updated_parsed": [2011, 5, 13, 7, 33, 4, 4, 133, 0], "published": "2011-03-08T09:01:21Z", "published_parsed": [2011, 3, 8, 9, 1, 21, 1, 67, 0], "title": "Transition from plasma- to Kerr-driven laser filamentation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.5046%2C1103.5021%2C1103.2534%2C1103.5193%2C1103.3486%2C1103.0153%2C1103.3214%2C1103.1881%2C1103.0617%2C1103.0957%2C1103.1741%2C1103.5675%2C1103.2857%2C1103.0789%2C1103.5096%2C1103.2876%2C1103.3974%2C1103.0975%2C1103.5072%2C1103.4924%2C1103.0288%2C1103.4400%2C1103.2875%2C1103.3467%2C1103.5386%2C1103.4599%2C1103.5606%2C1103.5329%2C1103.6130%2C1103.3824%2C1103.3885%2C1103.3263%2C1103.2965%2C1103.1121%2C1103.3129%2C1103.4195%2C1103.3128%2C1103.4991%2C1103.2568%2C1103.3361%2C1103.0444%2C1103.5883%2C1103.5211%2C1103.2809%2C1103.5352%2C1103.3402%2C1103.1578%2C1103.3403%2C1103.1508%2C1103.5911%2C1103.0102%2C1103.3002%2C1103.0325%2C1103.3735%2C1103.0411%2C1103.1101%2C1103.3187%2C1103.0420%2C1103.3198%2C1103.0402%2C1103.4527%2C1103.1924%2C1103.1576%2C1103.2311%2C1103.2461%2C1103.3699%2C1103.1597%2C1103.2354%2C1103.3054%2C1103.2854%2C1103.5010%2C1103.1476%2C1103.4864%2C1103.0713%2C1103.3907%2C1103.0536%2C1103.5318%2C1103.3333%2C1103.1467%2C1103.5750%2C1103.0885%2C1103.3813%2C1103.4351%2C1103.6045%2C1103.5538%2C1103.3669%2C1103.1591%2C1103.1842%2C1103.5519%2C1103.3177%2C1103.5907%2C1103.1295%2C1103.2737%2C1103.2547%2C1103.1058%2C1103.1563%2C1103.3836%2C1103.5271%2C1103.2864%2C1103.0959%2C1103.4533&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transition from plasma- to Kerr-driven laser filamentation"}, "summary": "While filaments are generally interpreted as a dynamic balance between Kerr\nfocusing and plasma defocusing, the role of the higher-order Kerr effect (HOKE)\nis actively debated as a potentially dominant defocusing contribution to\nfilament stabilization. In a pump-probe experiment supported by numerical\nsimulations, we demonstrate the transition between two distinct filamentation\nregimes at 800\\,nm. For long pulses (1.2 ps), the plasma substantially\ncontributes to filamentation, while this contribution vanishes for short pulses\n(70 fs). These results confirm the occurrence, in adequate conditions, of\nfilamentation driven by the HOKE rather than by plasma.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.5046%2C1103.5021%2C1103.2534%2C1103.5193%2C1103.3486%2C1103.0153%2C1103.3214%2C1103.1881%2C1103.0617%2C1103.0957%2C1103.1741%2C1103.5675%2C1103.2857%2C1103.0789%2C1103.5096%2C1103.2876%2C1103.3974%2C1103.0975%2C1103.5072%2C1103.4924%2C1103.0288%2C1103.4400%2C1103.2875%2C1103.3467%2C1103.5386%2C1103.4599%2C1103.5606%2C1103.5329%2C1103.6130%2C1103.3824%2C1103.3885%2C1103.3263%2C1103.2965%2C1103.1121%2C1103.3129%2C1103.4195%2C1103.3128%2C1103.4991%2C1103.2568%2C1103.3361%2C1103.0444%2C1103.5883%2C1103.5211%2C1103.2809%2C1103.5352%2C1103.3402%2C1103.1578%2C1103.3403%2C1103.1508%2C1103.5911%2C1103.0102%2C1103.3002%2C1103.0325%2C1103.3735%2C1103.0411%2C1103.1101%2C1103.3187%2C1103.0420%2C1103.3198%2C1103.0402%2C1103.4527%2C1103.1924%2C1103.1576%2C1103.2311%2C1103.2461%2C1103.3699%2C1103.1597%2C1103.2354%2C1103.3054%2C1103.2854%2C1103.5010%2C1103.1476%2C1103.4864%2C1103.0713%2C1103.3907%2C1103.0536%2C1103.5318%2C1103.3333%2C1103.1467%2C1103.5750%2C1103.0885%2C1103.3813%2C1103.4351%2C1103.6045%2C1103.5538%2C1103.3669%2C1103.1591%2C1103.1842%2C1103.5519%2C1103.3177%2C1103.5907%2C1103.1295%2C1103.2737%2C1103.2547%2C1103.1058%2C1103.1563%2C1103.3836%2C1103.5271%2C1103.2864%2C1103.0959%2C1103.4533&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "While filaments are generally interpreted as a dynamic balance between Kerr\nfocusing and plasma defocusing, the role of the higher-order Kerr effect (HOKE)\nis actively debated as a potentially dominant defocusing contribution to\nfilament stabilization. In a pump-probe experiment supported by numerical\nsimulations, we demonstrate the transition between two distinct filamentation\nregimes at 800\\,nm. For long pulses (1.2 ps), the plasma substantially\ncontributes to filamentation, while this contribution vanishes for short pulses\n(70 fs). These results confirm the occurrence, in adequate conditions, of\nfilamentation driven by the HOKE rather than by plasma."}, "authors": ["Pierre Béjot", "Edouard Hertz", "Jérôme Kasparian", "Bruno Lavorel", "Jean-Pierre Wolf", "Olivier Faucher"], "author_detail": {"name": "Olivier Faucher"}, "author": "Olivier Faucher", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.106.243902", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.1467v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.1467v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 4 figures. Accepted for publication in Physical Review\n  Letters", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.1467v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.1467v2", "journal_reference": "Physical Review Letters 106, 243902 (2011)", "doi": "10.1103/PhysRevLett.106.243902", "fulltext": "Transition from plasma- to Kerr-driven laser filamentation\nP. Béjot1,2 ,∗ E. Hertz1 , J. Kasparian2,† B. Lavorel1, J.-P. Wolf2 , and O. Faucher1\n(1) Laboratoire Interdisciplinaire Carnot de Bourgogne (ICB),\nUMR 5209 CNRS-Université de Bourgogne, BP 47870, F-21078 Dijon Cedex, France and\n(2) GAP-Biophotonics, Université de Genève, 20 rue de l'École de Médecine, 1211 Geneva 4, Switzerland\n\narXiv:1103.1467v2 [physics.optics] 13 May 2011\n\nWhile filaments are generally interpreted as a dynamic balance between Kerr focusing and plasma\ndefocusing, the role of the higher-order Kerr effect (HOKE) is actively debated as a potentially\ndominant defocusing contribution to filament stabilization. In a pump-probe experiment supported\nby numerical simulations, we demonstrate the transition between two distinct filamentation regimes\nat 800 nm. For long pulses (1.2 ps), the plasma substantially contributes to filamentation, while\nthis contribution vanishes for short pulses (70 fs). These results confirm the occurrence, in adequate\nconditions, of filamentation driven by the HOKE rather than by plasma.\n\n∗\n†\n\npierre.bejot@unige.ch\njerome.kasparian@unige.ch\n\n\f2\nFilamentation [1–4] is a self-guided propagation regime typical of high-power lasers, offering spectacular potential\napplications [5] like rainmaking [6] and lightning control [7]. We recently challenged its long-established mechanism\nby measuring the higher\nKerr effect (HOKE) in gases, implying that the non-linear refractive index must be\nP order\nwritten as ∆nKerr =\nn2j I j , where the non-linear indices n2j are related to the (2j + 1)th electric susceptibility\nχ(2j+1) . The inversion of ∆nKerr , due to negative n4 and n8 terms in air and argon, leads to a defocusing Kerr effect\nat an intensity close to those present within filaments [8, 9]. As a consequence, the HOKE can ensure self-defocusing\nin filaments and balance Kerr self-focusing [10], in place of the plasma, especially for short pulses [9]. This result\nraised an active controversy [11–16] in the lack of direct experimental confirmation.\nQuantitative differences between the predictions of filamentation models including or disregarding the HOKE are\nnot sufficient to distinguish between them. The intensity within filaments (∼50 TW/cm2 [17]) is compatible with\nregularization by either the plasma [18] or the HOKE [10], which balance the Kerr self-focusing in the same intensity\nrange. Furthermore the electron density is difficult to measure and highly dependent on initial conditions, resulting\nin a wide spread of the reported values from 1012 to 1017 cm−3 [18], although the latest measurements range from\n∼1015 cm−3 [19] to a few 1016 cm−3 [13].\nIn the present Letter, we therefore focus on experimental conditions where qualitatively different behaviors of\nplasma- and HOKE-driven filamentation allows to unambiguously distinguish between them. This discrimination\nproceeds from the intrinsically different temporal dynamics of these non-linear defocusing contributions. While the\nKerr effect is instantaneous at the timescale of the pulse envelope, the free electrons accumulated throughout the pulse\nduration survive for tens of picoseconds after the laser pulse has passed [20, 21]. In an atomic gas like argon, where\nno spatio-temporal modification of the refractive index due to molecular alignment occurs, two pulses separated by\na few picoseconds can therefore only be coupled if the free electron density left by the first one is sufficient to affect\nthe second one. This allows to distinguish between two scenarios. If the plasma is the dominant mechanism for the\nself-guiding of the pump pulse, then the electron density produced in its wake is necessarily affect the probe filament.\nOn the contrary, if the HOKE terms are predominant, then the probe filament is insensitive to the presence of the\npump.\nBased on these different temporal dynamics, we unambiguously observe experimentally the all Kerr-driven filamentation of ultrashort laser pulses, as well as the transition to a plasma-driven filamentation regime in the case of\nlong pulses. This new perspective on the filamentation physics critically revises the discussion of the optimal laser\nparameters for applications ranging from laser-controlled atmospheric experiments to harmonics generation [22, 23].\nIn our experimental setup (Fig. 1), two orthogonally polarized co-propagating laser pulses centered at 800 nm, are\nloosely focused by a f =3 m lens in a 2 m-long gas cell filled with argon. We investigate both short pulses (70 fs, 600 μJ,\n3 bar) and long pulses (1.2 ps, 6 mJ, 5 bar), keeping the peak power of each pulse equal to 2.5 critical powers. At this\npower level, each pulse produces a single filament when propagating alone. The probe pulse is temporally delayed\nwith regard to the pump by τ (τ =1 ps for short pulses and τ =2 ps for long pulses).\nThe influence of the plasma left by the pump on the probe filament is characterized by observing changes in its\nspectrum. The filament output spectrum is selected in the far-field (z ∼2 m) by a pinhole excluding the conical\nemission and most of the photon bath, and analyzed with a spectrometer (Ocean Optics HR4000, providing 0.5\nnm resolution and 14 bits of dynamic range) after separating the two pulses at the cell exit using a Glan-Thomson\npolarizer. To improve the signal-to-noise over the whole considered spectral range, each spectrum is reconstructed\nby assembling data from 3 spectral ranges. For each range, the integration time was adjusted between 2 and 2000\npulses to ensure the use of the full dynamics of the spectrometer in every spectral region. The resulting spectra were\nthen averaged over 20 realizations. The change in the probe spectra induced by the pump pulse is characterized by\ncalculating the contrast C(λ) = (S1 (λ) − S0 (λ))/(S1 (λ) + S0 (λ)) between the spectral densities with (S1 ) and without\nAdjustable delay τ\n\nCPA amplifier Lens\nf=3m\nPellicule\nbeam splitter\n\nBrewster\npolarizer\n\nτ\n\nFilaments\n\nLens\n\nPinhole\n\nHalf-waveplate\nGlan cube polarizer\n\nSpectrometer\n\nFigure 1. Experimental setup. Two orthogonally polarized identical pulses with an adjustable delay are focused in an argon-filled\ncell. At the output of the cell, the probe spectrum is selected by a Glan cube polarizer and analyzed with a spectrometer.\n\n\f3\nLong Pulse (1.2 ps FWHM)\n\nSpectrum (arb. units)\n\nInput spectrum\n\n−2\n\n0\n\nProbe alone\nProbe with pump\n(τ=2 ps)\n\n10\n\n(c)\n\n0\n−100\n550 600 650 700 750 800 850\nWavelength (nm)\n\nContrast (%)\n\nContrast (%)\n\n−2\n\n10\n\n10\n\n550 600 650 700 750 800 850\nWavelength (nm)\n\n100\n\n(b)\nInput spectrum\nProbe alone\nProbe with pump\n(τ=1 ps)\n\n−4\n\n−4\n\n10\n\nShort Pulse (70 fs FWHM)\n\n10\n\n(a)\nSpectrum (arb. units)\n\n0\n\n10\n\n400\n\n500 600 700 800\nWavelength (nm)\n\n100\n\n900\n\n(d)\n\n0\n−100\n400\n\n500\n\n600 700 800\nWavelength (nm)\n\n900\n\nFigure 2. (a,b) Experimental spectra of the filaments generated by a long (1.2 ps, a) and short (70 fs, b) pulse conveying 2.5\ncritical powers, both with and without a pump pulse τ =2 ps and τ =1 ps ahead of it, respectively. This delay ensures that\nthe pump pulse can only influence the probe pulse through the defocusing free electrons left behind by the pump. The input\nspectra are also given for reference. (c-d) Contrast between the spectra with and without pump pulse. The probe pulse is\naffected by the plasma left by the pump pulse only in the long-pulse regime.\n\n(S0 ) the pump pulse at each wavelength λ.\nSince the spatial overlap all along the propagation is crucial for the relevance of the measurements, it is optimized\nby maximizing the interference pattern produced by the unfocused pulses both before and after the cell. It is also\nconfirmed by the occurrence of multiple filamentation at zero delay, which is set by optimizing frequency doubling\nin a BBO crystal placed before the cell. Moreover, we checked that the alignment is conserved when translating the\nprobe pulse from τ =0 ps to τ =1 ps (resp. τ =2 ps) by inserting a 200 μm (resp. 400 μm) thick glass window in the\npath of the short (resp. long) pump pulse, delaying it by 1 ps (resp. 2 ps) and checking that the multi-filamentation is\nrestored. Let us note that the action of the pump pulse on the probe filaments may induce a longitudinal or transverse\ndisplacement. Such coupling, however, would mean that the plasma strongly affect the filamentation dynamics close\nto the non-linear focus, where a substantial part of the white-light continuum is generated. It would therefore result\nin significant changes in the output spectra. Finally, no broadening is recorded in vacuum, confirming that neither\ninput nor output windows of the cell have significant contributions on the spectral broadening.\nAs shown in Fig. 2a, the spectrum of the filament generated by a 1.2 ps long pulse narrows when it is preceded by a\npump filament τ =2 ps ahead of it. This coupling demonstrates that the probe pulse propagates through a pre-ionized\nmedium with a free electron density providing a significant negative contribution to the refractive index, i.e. a nonnegligible defocusing term: As expected from the Kerr-plasma balance model, the plasma density generated in the\nfilaments substantially contributes to the self-guiding. In this framework, the narrower spectrum of the probe filament\nis easily explained by the supplementary plasma density left by the pump pulse, which decreases the clamping intensity\nensuring the balance in the probe pulse between Kerr self-focusing and defocusing by the plasma, and consequently\nreduces the efficiency of its spectral broadening.\nConversely, in the case of short pulses (70 fs, Fig. 2b), the spectrum of the probe is nearly insensitive to the plasma\nleft by the pump. The decoupling between the two pulses separated by a delay (τ =1 ps) too short to allow electron\nrecombination unambiguously shows that the plasma density left in the wake of the pump pulse is too weak to significantly affect the filamentation process in the considered conditions. Plasma therefore plays no role in filamentation\nof 70 fs pulses, which is instead driven by the HOKE as predicted numerically [10]. Note that, if the two pulses\noverlap temporally (τ =0), their coupling is restored due to cross-phase modulation, confirming that the two pulses\nindeed overlap both longitudinally and transversely. These results therefore provide the experimental demonstration\nof the transition from plasma-driven filamentation in the case of long pulses to HOKE-driven filamentation for shorter\npulses, as expected from theoretical considerations [9].\nIn order to support this qualitative discussion and provide a closer look on the physical process at play, we numerically investigate the propagation of the pulses in the present experimental conditions. In a first step, we simulate\nthe propagation of the pump pulse. The plasma density left behind this pulse is then used as an initial condition for\ncalculating the probe pulse propagation.\nThe numerical model considers linearly polarized incident electric fields at a wavelength λ0 =800 nm with cylindrical\nsymmetry around the propagation axis z. According to the unidirectional propagation pulse equation [24], the scalar\n\n\f4\nLong pulse (1.2 ps FWHM)\n\n0\n\n(a)\n\nShort pulse (70 fs FWHM)\n\n0\n\n10\n\nInitial spectrum\nProbe alone\n\nSpectrum (arb. units)\n\nSpectrum (arb. units)\n\n10\n\nProbe with pump\n−2\n\n10\n\nInitial spectrum\n\n(b)\n\nProbe alone\nProbe with pump\n−2\n\n10\n\n−4\n\n10\n\n−4\n\n100\n\n650 700 750\nWavelength (nm)\n\n10\n\n800\n\n(c)\nContrast (%)\n\nContrast (%)\n\n550 600\n\n0\n\n−100\n550 600\n\n650 700 750\nWavelength (nm)\n\n800\n\n400\n\n500\n\n600 700 800\nWavelength (nm)\n\n900\n(d)\n\n100\n0\n−100\n400\n\n500\n\n600 700 800\nWavelength (nm)\n\n900\n\nFigure 3. (a,b) Spectra of the filaments generated by the long (a) and short (b) pulse, simulated by the full numerical model\nconsidering the HOKE. (c-d) Contrast between the spectra with and without pump pulse. The probe pulse is affected by the\nplasma left by the pump pulse only in the long-pulse regime.\n\nenvelope ε(r, t, z) (defined such that |ε(r, z, t)|2 = I(r, z, t), I being the intensity) evolves in the frame traveling at the\npulse velocity according to:\nq\n2 − k ′ ω)e\n∂z εe =i( k 2 (ω) − k⊥\nε\n\u0012 2\n\u0013\n(1)\niω e\nω e\n1\nP\n−\nJ\n−α\ne,\n+p\nNL\n2\n2\n2\n2ǫ0 c\nk 2 (ω) − k⊥ c\n\nwhere c is the velocity of light in vacuum, ω is the angular frequency, k(ω)=n(ω)ω/c, k ′ its derivative at ω0 =2πc/λ0 ,\nn(ω) is the linear refractive index at the frequency ω, k⊥ is the spatial angular frequency. PNL is the nonlinear\npolarization, J is the free-charge induced current and α is the nonlinear losses inducedR byRphoto-ionization. fe denotes\n∞ ∞\nsimultaneous temporal Fourier and spatial Hankel transforms of function f : fe = 0 −∞ rJ0 (k⊥ r)f (r, t)eiωt dtdr,\nP\nwhere J0 is the zeroth order Bessel function and f ≡ ε, PNL , J, or α. PNL is evaluated as PNL =\nn2j |ε|2j ε,\ne2\nth\n(νe +\nwhere n2j are the j -order nonlinear refractive indices as measured in [8]. The current is evaluated as Je = m\ne\n2\n2\niω)ρε/(ν\ne\ne + ω ), where e and me are the electron charge and mass respectively, ǫ0 is the vacuum permittivity, νe is\nthe effective electronic collisional frequency, and ρ is the electron density. Finally, α = W (|ε|2 )Ui (ρat − ρ) /(2|ε|2 ),\nρat is the neutral atoms density, W (|ε|2 ) is the photoionization probability modeled by the PPT (Perelomov, Popov,\nTerent'ev) formulation, with ionization potential Ui .\nThe propagation dynamics of the electric field is coupled with the electron density ρ, calculated as [2]\n∂t ρ = W (|ε|2 ) (ρat − ρ) +\n\nσ\nρ|ε|2 − βρ2 ,\nUi\n\n(2)\n\nwhere β is the electron recombination rate and σ is the inverse Bremsstrahlung cross-section of argon, also accounting\nfor avalanche ionization. The output spectrum is integrated over 2 mrad around the beam center to match the\nexperimental conditions.\nThe full model including the contribution of the HOKE together with the plasma response reproduces remarkably\nwell the experimentally observed behavior. In particular, as displayed in Fig. 3, the spectral broadening of the long\nprobe pulse is reduced when the pump pulse precedes it, in a ratio comparable with the experimental data, while the\nfilament generated by the 70 fs probe pulse is unaffected by the pump pulse. In contrast, disregarding the HOKE\n(Fig. 4) would lead us to expect that the filament output spectrum generated by probe pulses of any duration should\nbe affected by the presence of the pump pulse, in contradiction with the experimental results. Furthermore, this\ntruncated model inadequately predicts the wings of the spectral broadening, even for a single pulse. Comparing\nboth Figs. 3 and 4 with Fig. 2 clearly illustrates the need to consider the HOKE in numerical simulations of laser\nfilamentation, even in the plasma-driven, long-pulse filamentation regime.\nThis need is illustrated by comparing the electron densities predicted by both models. While the truncated model\nyields 1017 cm−3 for both 1.2 ps and 70 fs pulses, the full model yields 4×1016 cm−3 and 1015 cm−3 , respectively.\nThis strong dependence of the plasma contribution on the pulse duration explains both the contrasted behaviors\n\n\f5\n0\n\nLong pulse (1.2 ps FWHM)\nInitial spectrum\nProbe alone\n\n−2\n\n10\n\n(a)\nSpectrum (arb. units)\n\nSpectrum (arb. units)\n\n10\n\nProbe with pump\n\n10\n\n−4\n\n10\n\n(c)\n\n0\n\n−100\n550 600 650 700 750 800 850\nWavelength (nm)\n\nContrast (%)\n\nContrast (%)\n\n100\n\nShort pulse (70 fs FWHM)\nInitial spectrum\n\n(b)\n\nProbe alone\nProbe with pump\n\n10\n\n10\n\n550 600 650 700 750 800 850\nWavelength (nm)\n\n0\n\n−2\n\n−4\n\n400\n\n500 600 700 800\nWavelength (nm)\n\n100\n\n900\n\n(d)\n\n0\n−100\n400\n\n500 600 700 800\nWavelength (nm)\n\n900\n\nFigure 4. (a,b) Spectra of the filaments generated by the long (a) and short (b) pulse, simulated by the truncated numerical\nmodel disregarding the HOKE. (c-d) Contrast between the spectra with and without pump pulse. The probe pulse is affected\nby the plasma left by the pump pulse whatever the pulse duration.\n\nobserved in our experiment between the plasma- and HOKE-driven filamentation regimes, but also the wide spread\nof the experimentally measured electron densities in filaments [13, 18, 19]. Furthermore, we can estimate the relative\ncontributions of HOKE and plasma to defocusing by considering the ratio ξ = ∆nHOKE /∆nplasma of the HOKE- to\nplasma-induced refractive index change. For short pulses (70 fs), this ratio keeps well above 1 all along the filament\nlength (ξ ≥ 39), illustrating the negligible contribution of plasma to the filamentation process. In contrast, for 1.2 ps\nthis ratio keeps close to 1 (ξ & 0.72, except for a spike with ξ = 0.24 at the very filament onset), confirming that,\nwhile plasma provides the major defocusing contribution, the HOKE are far from negligible even in these conditions.\nAs a conclusion, a pump-probe experiment allowed us to unambiguously observe experimentally the theoretically\npredicted HOKE-driven filamentation for ultrashort pulses [10], as well as the transition from this regime to the longknown plasma-driven filamentation regime for long pulses [9]. This transition is similar to that observed in the context\nof high-harmonic generation (HHG), where the use of too long pulses results in gas ionization instead of HHG [23].\nFurthermore, comparing our results with numerical simulations show that, even in the plasma-driven filamentation\nregime of the present work, the contribution of the HOKE to the propagation dynamics cannot be neglected. This\nfinding provides a better understanding of filamentation, and therefore allows to improve its modelling. It further\nconfirms the relevance of the measured HOKE [8, 9], with implications ranging from spectral broadening in optical\nfibers [25] to the generation of few-cycle pulses [26], atmospheric applications [5–7], or fermionic light [27].\nAcknowlegments. This work was supported by the ANR COMOC ANR-07-BLAN-0152-01, FASTQUAST ITN\nProgram of the seventh FP and the Swiss NSF (contract number 200021-125315). We also acknowledge L. Bonacina,\nA. Rondi, J. Extermann, and M. Moret for their experimental support.\n\n[1] A. Braun, G. Korn, X. Liu, D. Du, J. Squier, G. Mourou. Optics Letters, 20, 73 (1995)\n[2] A. Couairon and A. Mysyrowicz. Phys. Rep. 441, 47 (2007).\n[3] S. L. Chin, S.A. Hosseini, W. Liu, Q. Luo, F. Théberge, N. Aközbek, A. Becker, V.P. Kandidov, O.G. Kosareva, and H.\nSchroeder. Can. J. Phys. 83, 863-905 (2005)\n[4] L. Bergé, S. Skupin, R. Nuter R, J. Kasparian, and J.-P. Wolf. Rep. Prog. Phys. 70, 1633-1713 (2007).\n[5] J. Kasparian and J.-P. Wolf. Opt. Express 16, 466-493 (2008)\n[6] P. Rohwetter, J. Kasparian, K. Stelmaszczyk, Z.Q. Hao, S. Henin, N. Lascoux, W.M. Nakaema, Y. Petit, M. Queisser M,\nR. Salamé, E. Salmon, L. Wöste, and J.-P. Wolf. Nat. Phot. 4, 451-456 (2010)\n[7] J. Kasparian, R. Ackermann, Y.-B. André, G. Méchain, G. Méjean, B. Prade, P. Rohwetter, E. Salmon, K. Stelmaszczyk,\nJ. Yu, A. Mysyrowicz, R. Sauerbrey, L. Wöste, and J.-P. Wolf. Opt. Express 16, 5757-5763 (2008)\n[8] V. Loriot, E. Hertz, O. Faucher, and B. Lavorel. Opt. Express. 17, 13429 (2009); Erratum in Opt. Express 18 3011 (2010)\n[9] V. Loriot, P. Béjot, W. Ettoumi, Y. Petit, J. Kasparian, S. Henin, E. Herz, B. Lavorel, O. Faucher, and J.-P. Wolf. Laser\nPhysics, to be published arXiv:1011.0841v1, 3 Nov 2010\n[10] P. Béjot, J. Kasparian, S. Henin, V. Loriot, T. Vieillard, E. Hertz, O. Faucher, B. Lavorel, and J.-P. Wolf. Phys. Rev.\nLett. 104, 103903 (2010)\n[11] M. Kolesik, E.M. Wright, and J.V. Moloney. Opt. Lett. 35, 2550-2552 (2010)\n\n\f6\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n\nM. Kolesik, D. Mirell, J.-C. Diels, and J.V. Moloney. Opt. Lett. 35, 3685-3687 (2010)\nY.-H. Chen, S. Varma, T. M. Antonsen, H. M. Milchberg Phys. Rev. Lett. 105, 215005 (2010)\nC. Brée, A. Demircan, and G. Steinmeyer, Phys. Rev. Lett. 106, 183902 (2011)\nP. Béjot, E. Hertz, B. Lavorel, J. Kasparian, J.-P. Wolf, and O. Faucher Opt. Lett. 36, 838 (2011)\nO. Kosareva, J.-F. Daigle, N. Panov, T. Wang, S. Hosseini, S. Yuan, G. Roy, V. Makarov, S. L. Chin, Optics Letters, 35,\n1035 (2011)\nA. Becker, N. Aközbek, K. Vijayalakshmi, E. Oral, C. M. Bowden, S. L. Chin, App. Phys. B, 73, 287 (2001)\nJ. Kasparian, R. Sauerbrey, and S.L. Chin. Appl. Phys. B 71, 877-879 (2000)\nF. Théberge, W.W. Liu, P.T. Simard, A. Becker, and S.L. Chin. Phys. Rev. E 74, 036406 (2006).\nS. Tzortzakis, B. Prade, M. Franco, A. Mysyrowicz. Optics Communications, 181, 123 (2000)\nV. Loriot, E. Hertz, B. Lavorel, and O. Faucher. J. Phys. B: At. Mol. Opt. Phys. 41, 015604 (2008)\nS. Suntsov, D. Abdollahpour, D. G. Papazoglou, S. Tzortzakis, Optics Express 17, 3190 (2009)\nA. L'Huillier, K. J. Schafer, and K. C. Kulander. J. Phys. B 24 3315 (1991).\nM. Kolesik and J.V. Moloney. Phys. Rev. E 70, 036604 (2004)\nT. Popmintchev, M.-C. Chen, P. Arpin, M. M. Murnane, and H. C. Kapteyn. Nature Photonics 4 822-832 (2010).\nC. P. Hauri, W. Kornelis, F. W. Helbing, A. Couairon, A. Mysyrowicz, J. Bieglert, and U. Keller. Applied Physics B:\nLasers and Optics, 79, 673 (2004)\nD. Novoa, H. Michinel, D. Tommasini Phys. Rev. Lett. 105, 203904 (2010)\n\n\f"}