{"id": "http://arxiv.org/abs/1105.2614v1", "guidislink": true, "updated": "2011-05-13T04:56:08Z", "updated_parsed": [2011, 5, 13, 4, 56, 8, 4, 133, 0], "published": "2011-05-13T04:56:08Z", "published_parsed": [2011, 5, 13, 4, 56, 8, 4, 133, 0], "title": "Growth and Optimality in Network Evolution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.2614%2C1105.3293%2C1105.0274%2C1105.2834%2C1105.2678%2C1105.1172%2C1105.5054%2C1105.5742%2C1105.4100%2C1105.5351%2C1105.0734%2C1105.5997%2C1105.0988%2C1105.4174%2C1105.4735%2C1105.2435%2C1105.3867%2C1105.3514%2C1105.4266%2C1105.4741%2C1105.0573%2C1105.1050%2C1105.4214%2C1105.1747%2C1105.5969%2C1105.1499%2C1105.2053%2C1105.1694%2C1105.3673%2C1105.1428%2C1105.4803%2C1105.2783%2C1105.3234%2C1105.0552%2C1105.0509%2C1105.0942%2C1105.4586%2C1105.4354%2C1105.6207%2C1105.2509%2C1105.2701%2C1105.3742%2C1105.2796%2C1105.2361%2C1105.0564%2C1105.2452%2C1105.3603%2C1105.3649%2C1105.5894%2C1105.1567%2C1105.3804%2C1105.1248%2C1105.5911%2C1105.1787%2C1105.1265%2C1105.0411%2C1105.0038%2C1105.0311%2C1105.1390%2C1105.1359%2C1105.5396%2C1105.2430%2C1105.1422%2C1105.1878%2C1105.5835%2C1105.5701%2C1105.5056%2C1105.1575%2C1105.5134%2C1105.2643%2C1105.4102%2C1105.6020%2C1105.2505%2C1105.1556%2C1105.4376%2C1105.3630%2C1105.5433%2C1105.0392%2C1105.5330%2C1105.4263%2C1105.0605%2C1105.3542%2C1105.2677%2C1105.6123%2C1105.3191%2C1105.5306%2C1105.4029%2C1105.1623%2C1105.2916%2C1105.2810%2C1105.3915%2C1105.5011%2C1105.3254%2C1105.2854%2C1105.3130%2C1105.5453%2C1105.2757%2C1105.5882%2C1105.3880%2C1105.0099%2C1105.4232&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Growth and Optimality in Network Evolution"}, "summary": "In this paper we investigate networks whose evolution is governed by the\ninteraction of a random assembly process and an optimization process. In the\nfirst process, new nodes are added one at a time and form connections to\nrandomly selected old nodes. In between node additions, the network is rewired\nto minimize its pathlength. For timescales, at which neither the assembly nor\nthe optimization processes are dominant, we find a rich variety of complex\nnetworks with power law tails in the degree distributions. These networks also\nexhibit non-trivial clustering, a hierarchical organization and interesting\ndegree mixing patterns.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.2614%2C1105.3293%2C1105.0274%2C1105.2834%2C1105.2678%2C1105.1172%2C1105.5054%2C1105.5742%2C1105.4100%2C1105.5351%2C1105.0734%2C1105.5997%2C1105.0988%2C1105.4174%2C1105.4735%2C1105.2435%2C1105.3867%2C1105.3514%2C1105.4266%2C1105.4741%2C1105.0573%2C1105.1050%2C1105.4214%2C1105.1747%2C1105.5969%2C1105.1499%2C1105.2053%2C1105.1694%2C1105.3673%2C1105.1428%2C1105.4803%2C1105.2783%2C1105.3234%2C1105.0552%2C1105.0509%2C1105.0942%2C1105.4586%2C1105.4354%2C1105.6207%2C1105.2509%2C1105.2701%2C1105.3742%2C1105.2796%2C1105.2361%2C1105.0564%2C1105.2452%2C1105.3603%2C1105.3649%2C1105.5894%2C1105.1567%2C1105.3804%2C1105.1248%2C1105.5911%2C1105.1787%2C1105.1265%2C1105.0411%2C1105.0038%2C1105.0311%2C1105.1390%2C1105.1359%2C1105.5396%2C1105.2430%2C1105.1422%2C1105.1878%2C1105.5835%2C1105.5701%2C1105.5056%2C1105.1575%2C1105.5134%2C1105.2643%2C1105.4102%2C1105.6020%2C1105.2505%2C1105.1556%2C1105.4376%2C1105.3630%2C1105.5433%2C1105.0392%2C1105.5330%2C1105.4263%2C1105.0605%2C1105.3542%2C1105.2677%2C1105.6123%2C1105.3191%2C1105.5306%2C1105.4029%2C1105.1623%2C1105.2916%2C1105.2810%2C1105.3915%2C1105.5011%2C1105.3254%2C1105.2854%2C1105.3130%2C1105.5453%2C1105.2757%2C1105.5882%2C1105.3880%2C1105.0099%2C1105.4232&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we investigate networks whose evolution is governed by the\ninteraction of a random assembly process and an optimization process. In the\nfirst process, new nodes are added one at a time and form connections to\nrandomly selected old nodes. In between node additions, the network is rewired\nto minimize its pathlength. For timescales, at which neither the assembly nor\nthe optimization processes are dominant, we find a rich variety of complex\nnetworks with power law tails in the degree distributions. These networks also\nexhibit non-trivial clustering, a hierarchical organization and interesting\ndegree mixing patterns."}, "authors": ["Markus Brede"], "author_detail": {"name": "Markus Brede"}, "author": "Markus Brede", "arxiv_comment": "To appear in Artificial Life (2011)", "links": [{"href": "http://arxiv.org/abs/1105.2614v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.2614v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.2614v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.2614v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1105.2614v1 [cond-mat.dis-nn] 13 May 2011\n\nGrowth and Optimality in Network Evolution\nMarkus Brede\nCSIRO Centre for Complex System Science,\nF C Pye Laboratory, GPO Box 3023, Clunies Ross Street\nCanberra ACT 2601, Australia\nemail:Markus.Brede@Csiro.au\nphone: +61 62465628\nNovember 13, 2018\n\nAbstract\nIn this paper we investigate networks whose evolution is governed by\nthe interaction of a random assembly process and an optimization process. In the first process, new nodes are added one at a time and form\nconnections to randomly selected old nodes. In between node additions,\nthe network is rewired to minimize its pathlength. For timescales, at\nwhich neither the assembly nor the optimization processes are dominant,\nwe find a rich variety of complex networks with power law tails in the\ndegree distributions. These networks also exhibit non-trivial clustering, a\nhierarchical organization and interesting degree mixing patterns.\n\n1\n\n\fkey words: complex networks, optimization, hierarchies, scalefree networks\n\n2\n\n\f1\n\nIntroduction\n\nInspired by the finding that the topologies of a surprisingly large class of complex\nsystems can be described by generic classes of networks, the last decade has seen\na very rapid development in network modelling, cf. [3] for reviews. A particular\nemphasis has been put on two ubiquitous classes of networks: scale-free (SF)\n[4] and small world (SW) [22] networks. Many real-world networks display both\nfeatures. SF networks are characterized by a degree distribution that has a\npower law tail of the form P (k) ∼ k −α with exponents α in the range between\n2 and 3. SW networks combine short average pathlengths with a strong local\ncohesiveness expressed by high densities of triangles.\nSo far, most efforts to explain the formation SF networks have concentrated\non assembly models using variants of preferential attachement. In these it is\nusually assumed that the network is assembled node by node over time, new\nnodes establishing connections to old nodes with attachment probabilities in\nproportion to the old nodes' degrees. The seminal studies which pioneered this\napproach are [4, 13, 17, 5].\nAnother line of thought to explain empirically observed network characteristics is via optimization models, assuming that the system under observation represents the end point of some optimization process. Examples to this approach\ninclude various models of link cost-pathlength optimization [14, 16, 8, 9], network models for optimal traffic [11], linearly stable dynamics [21, 7], and optimal\nsynchronization [12, 6]. All of these optimization models, however, consider systems that are static in size [1]. For specific parameters SF networks have been\n3\n\n\fobtained from an optimization model which minimized a trade-off between cost\nof links and average pathlengths [14]. However, SF networks from optimization\nprinciples only seem to arise at transition points between different parameter\nregimes. Thus, to find SF networks from static optimization usually requires\nthe fine tuning of some parameter – clearly not a robust explanation.\nIn this paper we consider networks where both processes: assembly and optimization play a role. Naturally, the ratio of time scales of network assembly\nand optimization will be important to understand the evolution of such systems. Clearly, if assembly is slow in comparison to the optimization process,\nthe topology of the evolved network can essentially be understood by a static\noptimization problem. Contrariwise, if network assembly is fast, the assembly\nmechanism will be the dominant process which shapes network topology. As we\ndiscussed above both of these limiting cases have been considered extensively\nin the literature before, in which it was always assumed that time scales for\nassembly and optimization are well separated and thus, that possible interactions between the two processes can be neglected. What, however, about the\ncontinuum of timescales in between, where both processes interact? This is the\nproblem we will address in the present study.\n\n4\n\n\f2\n\nModel Description\n\nAs an example for an optimization process to illustrate our point we consider\nthe optimization for shortest average shortest pathlength,\nd=\n\nX\n2\nd(i, j),\nN (N − 1) i<j\n\n(1)\n\nwhere d(i, j) is the length of the shortest path that connects the nodes i and j\non the network. As an assembly process we consider the addition of nodes which\nform links to randomly selected nodes from the old network. For simplicity, we\nrestrict the study to undirected binary links. The combination of an assembly\nand optimization mechanism appears of interest, since pathlength optimization\ntypically generates star networks with one dominant hub node [14, 7], while random node assembly generates networks with exponential degree distributions [4],\ni.e. networks without hub nodes. Thus two opposing tendencies are combined:\na pressure towards hub formation resulting from the optimization process and a\ntendency against link accumulation, stemming from the node assembly. Below\nwe will explore typical networks that are formed when the timescales of both\nprocesses are systematically varied.\nMore precisely, we consider a model of network assembly and evolution given\nby the following steps\n1. Start with a small random network.\n2. Add a new node. The new node forms k connections to randomly selected\n'old' nodes.\n\n5\n\n\f3. Let the network evolve for optimal shortest pathlength. In more detail,\nrandomly select a node n and rewire one of its links to a randomly chosen\nnew neighbor. If the average shortest pathlength of this node, i.e. dn =\n1/(N −1)\n\nP\n\ni6=n\n\nd(n, i) is reduced this way, the rewiring is accepted. If not,\n\nwe proceed with the original network configuration. The optimization step\n3. is repeated for T times, if T is not an integer or T < 1 the fractional part\nof T is interpreted as a probability that step 3. takes place an additional\ntime. By normalizing the timescale of the assembly process to one unit of\ntime, one can interpret the parameter T as the ratio of the timescales of\noptimization and assembly.\n4. Proceed with 2. until the final network size has been reached.\nLater, instead of step 3. we also consider a variant of the optimization, where\nthe search and rewiring is local. In this case we restrict new target nodes of\nthe rewired link from n to the neighborhood of n, i.e. nodes up to range r = 2\naway from n. An illustration of local rewiring schemes is given in figure 1. The\nmotivation for considering this local step is twofold. First, one may associate\nit with limited information of agents that try to improve their position in the\nnetwork, but only have local knowledge, i.e. knowledge about their neighbors.\nSecond, one may also think about it as resulting from resource limitations when\nthe nodes are embedded in space, such that agents can only form connections\nto nodes already close by.\nBefore proceeding, let us first briefly revisit the static problem, i.e. T ≫ 1,\ntreated, eg., in [14, 7]. Shortest pathlengths in a network with given number of\n6\n\n\fC\n\nA\n\nC\n\nA\n\nE\n\nE\n\nB\n\nB\n\nD\n\nD\n\nFigure 1: Illustration of the local rewiring. Node A is the target node and\nnode C, which is r = 2 steps away from A is chosen as the new destination\nnode. Extending the requirement for strictly local rewiring at range r = 2, new\ndestination nodes can be at distance a distance r > 2 from A. For instance,\nnode E would be a possibly choice for a destination node for r = 3.\n\nlinks are realized in star-like networks. Depending on the number of links, a core\nwith a dominant hub node, which links to all other nodes will form. Nodes other\nthan the hub node have low degrees and, apart from the connection to the hub\nnode, they have only a few connections to other such periphery nodes. Thus,\npathlength-optimal networks are very heterogeneous networks, distinguished by\nthe presence of a super hub node. It is worthwhile to note that the situation we\ntreat here differs from [14, 7] in that nodes optimize their respective shortest\npathlengths competitively, attempting to maximize individual fitnesses without\nconsideration for the global good. In principle, in particular when link costs\nare explicitely considered, under a competitive scheme globally optimal configurations can become unstable [10]. However, since the optimizing nodes only\n\n7\n\n\frewire their connections and do not eliminate links, numerical simulations indicate that the pathlength-optimal star-configuration is the only globally stable\nattractor of the dynamics.\nAs for the second limiting case T ≪ 1, random assembly, it is known that\ngrowing networks where new nodes form connections to old nodes with equal\nprobability leads to networks with exponentially decaying degree distributions\n[4]. Thus, importantly, the attachment process does not lead to hub formation,\nSF degree distributions or SW behaviour.\n\n3\n\nGlobal Optimization and Growth\n\nIn the following we numerically construct large networks of different sizes for systematically varied values of T . By displaying the degree distributions for some\nprototypical situations figure 2 summarizes some of the main results. Depending on the ratio between assembly and optimization timescales, four parameter\nregimes can be distinguished. In the first two regimes the degree distribution\ncan be described by\nP (k) ∝ k −α F (k/kN ),\n\n(2)\n\nwhere F (x) is a finite-size scaling function with F (x) ≈ const. for x ≪ 1 and\nF (x) ∝ exp(−x) for x ≫ 1. The quantity kN gives a typical system size\ndependent cut-off degree at which the power law behaviour breaks down due\nto the finite system size N and an exponential decay sets in. For SF networks\none has kN ∝ N δ , with δ > 0 such that the power law regime in the degree\n8\n\n\f10\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n(b)\n\nN=10000\nN=5000\nN=2500\nN=1250\n\nP(k)\n\nP(k)\n\n(a)\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\n10\n\nN=10000,T=0\nN=10000\nN=5000\nN=2500\nN=1250\n\n0\n\n10\n\nk\n10\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n(d)\n\nN=5000\nN=2500\nN=1250\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-5\n\n10\n\n-6\n\n10\n\n-6\n\n0\n\n10\n\n1\n\n2\n\n0\n\n10\n\n10\n\n10\n\nk\n\nP(k)\n\nP(k)\n\n(c)\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\nk\n\nN=5000\nN=2500\nN=1250\nN=625\n\nsuper hubs\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\nk\n\nFigure 2: Degree distributions of networks with hki = 2 evolved for (a) T = 10,\n(b) T = 70, (c) T = 350 and (d) T = 1000 for network sizes N = 625, N = 1250,\n2500, 5000 and 10000. The lines indicate power laws with exponent α = 2. Panel\n(b) additionally compares to a network of size N = 10000 constructed for T = 0\n(no optimization). Averages are over at least 10 networks and data have been\nbinned exponentially.\n\n9\n\n\fdistribution grows with increasing system size [3].\nThe first regime in figure 2 corresponds to the case of small optimization\ntimes T , cf. panel (a) for T = 10. One finds that the degree distributions are\nwell described by a power law with exponent α = 2 for small degrees. However,\nthe probabilities of larger degrees decay exponentially. The coincidence of the\ncurves for system sizes of different orders of magnitude in panel (a) demonstrates\nthat the cut-off length kN is independent of the system size, such that the\nresulting degree distributions have essentially exponentially decaying tails.\nWith increasing T , typical cut-offs for exponential behaviour are shifted towards larger degrees, till eventually power law behaviour with exponent α = 2\ngoverns all scales (and kN grows algebraically with the system size), cf. panel (b)\nfor T = 70. For larger T , low degree nodes start to lose connections disproportionately, while a fat tail of hub nodes extends to larger and larger degrees [panel\n(c) for T = 350]. Finally, 'super-hub' nodes appear, that are well-separated from\nthe hub nodes in the power law tail, cf. panel (d) for T = 1000.\nWe proceed with an analysis of the networks in the different regimes. To\ncharacterize the networks, we analyse them in terms of the maximum degree\nkmax = maxi ki , average clustering coefficient [22], degree correlations as measured by the assortativeness a defined in [18], and the average shortest pathlength d. Figure 3 gives the dependence of these key network statistics on T .\nNotably, increasing the timescales of the optimization process T promotes hub\nformation [cf. Fig. 3b], while also leading to more and more cliquish [cf. Fig.\n3a] and disassortative [cf. Fig. 3c] network arrangements. Not surprisingly\n\n10\n\n\f(a)\n\n(b)\n\n0.3\n\n1000\n\nkmax\n\n0.2\n\nC\n\n1400\n1200\n\n0.25\n\n0.15\n0.1\n\n800\n600\n400\n\n0.05\n\n200\n\n0\n\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n0\n\n200\n\n400\n\nT\n\n(c)\n\n600\n\n800\n\n1000\n\n600\n\n800\n\n1000\n\nT\n\n(d)\n\n0.3\n0.2\n\n6\n5.5\n\n4.5\n\nd\n\n5\n\n0\n\na\n\n0.1\n\n-0.1\n\n4\n\n-0.2\n\n3.5\n\n-0.3\n\n3\n\n-0.4\n\n2.5\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nT\n\n0\n\n200\n\n400\n\nT\n\nFigure 3: Dependence of network characteristics on the ratio of optimization\nand assembly time scales T : (a) clustering coefficient C, (b) max. degree kmax ,\n(c) assortativeness a, and (d) average shortest pathlength d. The data have\nbeen collected for networks of size N = 5000 and represent averages over at\nleast 100 independent runs per value of T .\n\n11\n\n\f102\n\nC(k)/C\n\n101\n\nT=200\nT=100\nT=70\nT=50\nT=20\n\n100\n\n10-1 0\n10\n\n101\n\n102\n\n103\n\nk\nFigure 4: Dependence of the normalized clustering coefficient on degree for\nN = 10000 and various values of T . Clustering coefficients are normalized by\ntheir averages C. Note the change at around T = 70, when clustering starts\nto decay with degree. Power-law behaviour C(k) ∼ k −β (straight lines indicate\nbest fits) for large k points to a hierarchical organization: β = 0.56 for T = 200,\n0.26 for T = 100, 0.07 for T = 70, −0.16 for T = 50 and −0.9 for T = 20.\n\nalso, larger shares of optimization time compared to assembly time cause the\nnetworks to become smaller and smaller [cf. Fig. 3d].\nIn many real-world systems, the cliquishness appears independent of system\nsize and the arrangement of cliques is hierarchical [20]. We have conducted a\nscaling analysis of the dependence of the clustering coefficient on the degree and\non the system size. The first is well described by a power law dependence\nC(k) ∼ k −β\n\n12\n\n(3)\n\n\ffor large k, with exponents β depending on T . Generally, for small T positive\nβ is found, but the exponents decrease quickly to values around β = 0.5 when\nT is increased, thus indicating a hierarchical organization of cliques for large\nT > 100, see figure 4. The parameters around T = 70 for which networks\nin which the power law dependence P (k) ∝ k −α with α ≈ 2 extends over\nall scales of the degree distribution [Fig. 2b] have been generated, represent\nthe boundary case between growth and decay in the C(k)-dependence. This\nindicates two different mechanisms to achieve small networks for small and large\nT . Essentially, for small T no tail of hubs is formed. The network evolution\ngenerates a strongly cliquish core of nodes with larger than average degree.\nFor large optimization times, the optimization procedure weeds out connections\nbetween hubs and hub competition leads to a less hierarchical organization of\nthe hubs. This organization can be further classified by correlations between\ndegrees of adjacent nodes.\nGiven the set of neighbors N (i) of a node i, let us define the average neighbor\ndegree of i via\nknn,i = 1/ki\n\nX\n\nkj\n\n(4)\n\nj∈N (i)\n\nand distinguish classes of nodes by degree. Following [19] we then introduce a\nnearest neighbor degree function knn (k), that gives the average over all nodes\nwith degree k. Simulation data for this function reveal that knn (k) generally\nfollows a power law\nknn (k) ∝ k −γ\n\n13\n\n(5)\n\n\fkn.n./K\n\n5 100\n\n100\n\nT=200\nT=100\nT=70\nT=50\nT=20\n\n5 10-1 0\n10\n\n101\n\n102\n\n103\n\nk\nFigure 5: Dependence of the average nearest neighbor degree on the degree for\nN = 10000 and various values of T . Average nearest neighbour degrees are\nnormalized by their average K. Note the change in the dependence at T = 70.\nThe straight lines indicate power laws with exponents γ = 0.35 for T = 200,\n0.15 for T = 100, 0.05 for T = 70, −0.09 for T = 50 and −0.4 for T = 20.\n\n14\n\n\ffor large k. As already expected from the dependence of the aggregate assortativeness on T (cf. figure 3c), a strong dependence of nearest neighbor correlations on T is notable. For small T one has γ < 0 and observes a transition\ntowards γ > 0 as T is increased, cf. figure 5. The range of parameters around\nT ≈ 70 again marks the boundary at which γ changes its sign. Hence, for\nT < 70 networks form a hierarchy of large degree nodes that are preferentially\nlinked to each other. Forming links to hub nodes of slightly smaller degrees the\nhub node with the largest degree is located in the centre. Hub nodes of this\nnext level form links to nodes of slightly smaller degree while low degree nodes\nare mostly linked to each other and are located at the periphery of the network.\nThis contrasts with typical network structures generated for large T , when the\noptimization process weeds out redundant connections between the hub nodes.\nIn this case, central hubs preferentially link to low degree nodes, entailing a\nstrongly disassortative arrangement.\nSimilar to the preferential attachment model [4] an analysis of the scaling\nwith system size manifests that the clustering eventually decays to zero in the\nlimit of very large systems (data not shown).\nIn sum, the interaction of assembly and global optimization processes at\nvarious timescales can generate very skewed network topologies. A transition\ntimescale ratio T ≈ 70 exists at which degree distributions follow a power law\nwith exponent α = 2. Similar to the model of Ref. [14], explaining power law\ndegree distributions by the above mechanism would require the fine-tuning of\nthe timescale ratio to T ≈ 70. Below, we will extend the model towards local\n\n15\n\n\frewiring procedures. As we will see, in this case a broad range of timescale ratios\nfor which degree distribitions follow power laws exists such that no fine-tuning\nof parameters to obtain power-laws is required.\n\n4\n\nLocal Optimization and Growth\n\nThe above finding motivates us to also consider a different optimization process,\nwhere rewirings are restricted to local connections (cf. figure 1 above). Note,\nthat in such a local rewiring process the number of triangles can only increase\n(if the rewired connection was not part of a triangle) or stay the same (if the\nrewired connection was part of a triangle). Nevertheless, since the presence of\ncommunities in sparse networks does not promote short pathlengths, clustering\ncoefficients stay well below their maximum values even for relatively large T .\nIt is also worthwhile pointing out that the rewiring process without selection does not lead to very skewed or SF degree distributions. The reason is\nthat even though nodes attract new connections in proportion to their degree,\nconnections are also chosen for rewiring in proportion to a node's degree. Both\neffects compensate such that the resulting degree distributions remain narrow.\nA further immediate observation is about characteristic timescales of network\noptimization subject to local or global rewiring. Essentially because in local\nrewiring new destination nodes are suggested in proportion to the destination\nnodes' degree the likelihood of accepting a rewiring suggestion is enhanced. For\nthis reason the local optimization is much more effective than the global process\n\n16\n\n\f(a)\n\n(b)\n\n100\n\nT=0.7\nT=1.0\nT=1.4\n\n-1\n\n10\n\n10-3\n\nP(k)\n\n10-3\n10-4\n\n10-4\n10-5\n\n-5\n\n10\n\n10-6\n\n10-6\n\n10-7\n\n10-7\n100\n\nT=3.0\nT=4.0\nT=5.0\n\n10-2\n\n10-2\n\nP(k)\n\n100\n10-1\n\n10-8\n101\n\n102\n\n100\n\nk\n\n101\n\n102\n\n103\n\n104\n\nk\n\nFigure 6: Degree distributions for networks of size N = 50000 constructed\nby the local optimization scheme with range r = 2 for (a) T = 0.7, 1.0 and\n1.4 and (b) T = 3.0, 4.0 and 5.0. In panel (a) the lines indicate power laws\nwith exponents α = 4.35, 3.69 and 3.3, in (b) they indicate power laws with\nα = 2.8 for small degrees and α = 2.0 for the tail of large degrees. At around\nT = 5.0 'super-hubs' start to emerge. Averages over 30 networks, distributions\nare binned logarithmically.\n\nand characteristic timescales of the local optimization are much shorter than for\nthe global process.\nWith the data for degree distributions of networks assembled subject to local\nrewiring in figure 6 we proceed with an analysis of the local optimization scheme\nfor range r = 2. Apart from different characteristic timescales, results for the\ndegree distributions are analogous to the case of globally optimized networks.\nVery short optimization timescales do not allow for the formation of networks\nwith very skewed degree distributions. However, from around T = 0.7 onwards,\ndegree distributions start to exhibit power law tails. Increasing the optimization\n\n17\n\n\ftimescale, the exponent characterizing the power law tails declines. However, as\npanel (a) of figure 6 demonstrates the distributions still clearly exhibit powerlaws over around two orders of magnitude. For example, we find power laws with\nexponents α = 4.35, 3.69 and 3.3 for T = 0.7, 1.0 and 1.4. At around T = 1.5 a\ntail of hub nodes that deviates from the power law behaviour for nodes of small\ndegree develops, cf. panel (b). For T ≤ 5 this tail is well-described by a power\nlaw with exponent α = 2. At around T ≈ 5 'super-hubs' emerge and gradually\nattract more and more connections when further increasing T .\nA diagram of further average network characteristics such as clustering coefficients, maximum degrees, assortativeness or pathlengths also displays very\nsimilar characteristics to the one for the global optimization scheme displayed\nin figure 3, but we don't discuss them in detail here.\nIt is of interest to note that, even though power law tails emerge for a\nbroad range of timescale ratios, local rewiring only allows for the assembly of\nnetworks with power-law degree distributions with exponents α > 3. However,\nmost real-world networks in biological and other applications have been found\nto have exponents in the range 2 < α < 3. Hence, optimization and strictly\nlocal rewiring with range r = 2 cannot provide explanation for the structure\nof real-world networks. However, as we will see below, relaxing the constraint\nof strictly local rewiring, a much larger configuration space of possible network\ntopologies can be explored.\n\n18\n\n\f5\n\nBetween local and global\n\nAbove, we considered a local rewiring scheme where rewirings were always directed towards nodes at distance r = 2 from the target node. One can extend\nthis concept by gradually extending the set of new destination nodes to nodes\nnot farther away than an arbitrary range r ≥ 2 [2] (and refer to figure 1 for an\nillustration). Since r → ∞ recovers the case of global optimization, tuning r\nallows to interpolate between the local and global optimization schemes. Let\nus assume a fixed timescale ratio T between network assembly and optimization. From the analysis of the limiting cases of global and local rewiring in the\nprevious sections, one can understand the implications of a rewiring parameter\nr > 2 on the evolved network topologies. Increasing r to values that are close\nto the characteristic pathlengths of the network reduces the \"efficiency\" of the\noptimization and dominant hub nodes are less likely to appear. Because of this\na scenario for a choice of r1 , T1 , corresponds to a scenario r2 < r1 with T2 < T1 .\nHence, one expects that an increase in r allows for the assembly of networks\nwith less skewed degree distributions. Trivially, relaxing the constraint for local\nrewiring will also reduce cliquishness.\nInterestingly, similar to what we observed for T < 1.5 for r = 2 above, for\ndifferent values of r networks with different steepness of the decay of the degree\ndistribution can be constructed. However, unlike for r = 2, for r > 2 degree\nexponents in the range 2 < α < 3 can be found. This is demonstrated by\nthe simulation data displayed in figure 7a, in which we compare some example\ndegree distributions for networks generated with r = 3 and different T . A\n19\n\n\f(a)\n\n100\n\n(b)\n\nT=10.0\nT=1.4\nT=0.7\n\n10-1\n\n4.5\nr=2.0\nr=2.5\nr=3.0\nr=4.0\n\n4\n3.5\n\n10-3\n\nα\n\nP(k)\n\n10-2\n\n10-4\n\n3\n\n10-5\n2.5\n\n10-6\n10-7 0\n10\n\n101\n\n102\n\n2\n\n103\n\n0\n\nk\n\n4\n\n8\n\n12\n\n16\n\n20\n\nT\n\nFigure 7: (a) Degree distributions of networks generated for N = 50000, r = 3\nand T = 0.7, 1.4 and 10.0. The lines indicate power laws with exponents\nα = 3.8, 3.0 and 2.28, respectively. (b) Dependence of the exponents α on\nthe optimization timescale T for different ranges r = 2 (squares), 2.5 (spheres),\nr = 3 (triangles), and r = 4 (diamonds). The values have been determined\nfrom best fits to the logarithmically binned tails of the degree distributions\nconstructed from at least 10 networks of size N = 50.000. For r = 2, 2.5, 3 and\n4 at approximately T = 1.5, 5, 10 and 20 the power laws describing small and\nlarge degrees start to diverge, cf. text.\n\n20\n\n\fmore comprehensive analysis of degree distributions that can be obtained for\nvarious choices of r and T is given in figure 7b. Two observations are in order.\nFirst, increasing r beyond strictly local rewiring for r = 2, degree distributions\nwith exponents α in the range 2.1 < α < 4.5 can be obtained. The larger r\nthe smaller the exponent characterizing the degree distribution. Second, the\npower law regime is again limited to a range between very low and large values\nof T , outside of which either the assembly process dominates or when hub\nformation sets in. It is difficult to give strict bounds for the range of T values\nfor which power-law behavior is found, but the interval covers about one order\nof magnitude for rewiring between global and strictly local rewiring (e.g. from\nabout T = 0.5 to T = 20 for r = 4). Clearly, no fine tuning of parameters is\nrequired to find scale-free networks.\nAnother important point is, that also for 2 ≤ r ≤ 3 strongly cliquish networks are formed. This is illustrated in figure 8, which gives some examples of\nthe change in cliquishness with growing system sizes for r = 3 and different T .\nIt is important to note that unlike the case of the dependence of clustering on\nthe system size for global optimization, for every T > 0 clustering coefficients\nconverge towards constant non-trivial values for large systems.\n\n6\n\nSummary and Conclusions\n\nIn summary, in this paper we have analyzed a class of networks that emerge from\nthe interplay of a network assembly process and an optimization process. A sys-\n\n21\n\n\f0.2\nT=1.0\nT=1.7\nT=3.0\n\nC\n\n0.15\n\n0.1\n\n0.05\n0\n\n10000 20000 30000 40000 50000\n\nN\nFigure 8: Scaling analysis of the average clustering coefficient C with system\nsize for local rewiring with r = 3. Note, that C converges to a constant value\nin the limit of large system sizes.\n\n22\n\n\ftematic investigation of the parameter space reveals that the ratio of timescales\nT between both processes is an important determinant of network structure. For\nlow T , network assembly dominates and the constructed networks have narrow\ndegree distributions. In the opposite case, for large T , network optimization\ndominates, leading to the formation of networks with bimodal degree distributions. These networks are characterized by a periphery of low degree nodes and\na core of a few \"super-hub\" nodes. For T → ∞ they evolve into star networks.\nInterestingly, we have found a parameter range \"in between\", in which the\nstructural influences of network assembly and network optimization are balanced. In this parameter regime we find network structures exhibiting power\nlaw degree distributions with exponent 2 which are further classified by a hierarchical organization, non-trivial degree mixing and very short pathlengths.\nAdditional to its characteristic timescale T , the network optimization process\ncan be classified by a second parameter, the locality r of the rewiring mechanism. The parameter can be understood as a measure for the information about\nthe system that is available to individual nodes. Varying r we have explored\nsituations ranging from strictly local rewiring (each node has only information\nabout and access to its immediate neighbors) to global rewiring (every node has\nglobal information and access). Our analysis points out that this mechanism\ncan generate a very rich variety of SF complex networks with various power law\nexponents in the range 2.1 < α < 4.5, all of which also exhibit non-trivial clustering and interesting patterns of degree mixing. Importantly, the mechanism\nleads to the emergence of power laws for a broad parameter range, such that\n\n23\n\n\fno fine-tuning of parameters is required to explain SF behaviour from network\noptimization.\n\nReferences\n[1] A notable exception to this are the studies [15] which consider growing networks, where new nodes attach and adjust their links to optimize a measure\nof synchronization. Distinct from [15], however, we consider optimization as\na process affecting the whole network and not only recently added nodes.\n[2] Non-integer values are interpreted as averages, i.e. for non-integer value r\nin an optimization step new connections are made to nodes not farther away\nthan distance ⌊r⌋ + 1 with prob. q = r − ⌊r⌋ and, alternatively, to nodes not\nfarther away than distance ⌊r⌋ with prob. 1 − q.\n[3] Albert, R., & Barabási, A.-L. (2002). Statistical mechanics of complex networks. Reviews of Modern Physics, 74, 47–97.\nNewman, M. J. E. (2003). The structure and function of complex networks,\nSIAM Review. 45, 167–256.\nBoccaletti, S., Latora, V., Moreno, Y., Chavez, M., & Hwang, D.-U. (2006).\nComplex networks: Structure and dynamics. Physics Reports, 424, 175–308.\n[4] Albert, R., & Barabási, A.-L. (1999). Emergence of scaling in random networks. Science, 286, 509–512.\n\n24\n\n\f[5] Bianconi, G., & Barabási, A.-L. (2001). Competition and multiscaling in\nevolving networks. Europhysics Letters, 54, 436–442.\n[6] Brede, M. (2008). Construction principles for highly synchronizable sparse\ndirected networks. Physics Letters A, 372, 5305–5308.\nBrede, M. (2008). Synchrony-optimized networks of non-identical Kuramoto\noscillators. Physics Letters A, 372, 2618–2622.\nBrede, M. (2008). Locals vs. global synchronization in networks of nonidentical Kuramoto oscillators. European Physical Journal B, 62, 87–94.\n[7] Brede, M., & de Vries, B. J. M., Networks that optimize a trade-off between\nefficiency and dynamical resilience. Physics Letters A, 373, 3910–3914.\n[8] Brede, M. (2010). Small worlds in space: Synchronization, spatial and relational modularity. Europhysics Letters, 90, 60005.\n[9] Brede, M. (2010). Optimal synchronization in space. Physical Review E, 81,\n025202.\n[10] Brede, M. (2010). Coordinated and uncoordinated optimization of networks. Physical Review E, 81, 066104.\n[11] Colizza, V., Banavar, J. R., Maritan, A., & Rinaldo, A. (2004). Network\nstructures from selection principles. Physical Review Letters, 92, 198701.\n[12] Donetti, L., Hurtado, P. I., & Muñoz, M. A. (2005). Entangled networks,\nsynchronization, and optimal network topology, Physical Review Letters. 95,\n188701.\n25\n\n\f[13] Dorogovtsev, S. N., & Mendes, J. F. F., & Samukhin, A. N. (2000). Structure of growing networks with preferential linking. Physical Review Letters,\n85, 4633.\n[14] Ferrer i Cancho, R., & Solé, R. V. (2003). Optimization in complex networks. In R. Pastor-Satorras, M. Rubi, & A. Diaz-Guilera (Eds.), Statistical\nmechanics of complex networks (pp. 114–126). Berlin: Springer.\n[15] Gomez Portillo, I. J., & Gleiser, P. M. (2009). An adaptive complex network\nmodel for brain functional networks. PLoS ONE, 4, e6863.\n[16] Mathias, N., & Gopal, V. (2001). Small worlds: How and why. Physical\nReview E, 63, 021117.\n[17] Krapivsky, P. L., & Redner, S., & Leyvraz, F. (2000). Connectivity of\ngrowing random networks. Physical Review Letters, 85, 4629–4632.\n[18] Newman, M. E. J. (2002). Assortative mixing in networks. Physical Review\nLetters, 85, 208701.\n[19] Pastor-Satorras, R., Vásquez, A., & Vespignani, A. (2001). Dynamical and\ncorrelation properties of the internet. Physical Review Letters, 87, 258701.\n[20] Ravasz, E., Somera, A. L., Mongru, D. A., Oltvai, Z. N., & Barabási,\nA.-L. (2002). Hierarchical organization of modularity in metabolic networks.\nScience, 297, 1551–1555.\n[21] Variano, E. A., McCoy, J. H., Lipson, H. (2004). Networks, dynamics, and\nmodularity. Physical Review Letters, 92, 188701.\n26\n\n\f[22] Watts, D. J., & Strogatz, S. H. (1998). Collective dynamics of 'small-world'\nnetworks. Nature, 393, 440–442.\n\n27\n\n\f"}