{"id": "http://arxiv.org/abs/1107.5577v1", "guidislink": true, "updated": "2011-07-27T08:53:44Z", "updated_parsed": [2011, 7, 27, 8, 53, 44, 2, 208, 0], "published": "2011-07-27T08:53:44Z", "published_parsed": [2011, 7, 27, 8, 53, 44, 2, 208, 0], "title": "Fluctuation and Order of Antiferromagnetism induced by Paramagnetic\n  Pair-Breaking in Superconducting Vortex Lattice", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.5662%2C1107.4448%2C1107.3118%2C1107.4599%2C1107.4774%2C1107.3656%2C1107.0170%2C1107.5559%2C1107.2033%2C1107.3113%2C1107.4239%2C1107.2022%2C1107.3208%2C1107.4850%2C1107.1320%2C1107.3317%2C1107.2440%2C1107.4402%2C1107.0989%2C1107.5252%2C1107.1087%2C1107.5600%2C1107.3437%2C1107.4341%2C1107.2307%2C1107.0997%2C1107.0004%2C1107.5131%2C1107.4894%2C1107.1719%2C1107.5464%2C1107.1869%2C1107.5861%2C1107.1177%2C1107.0427%2C1107.4809%2C1107.3499%2C1107.1799%2C1107.2948%2C1107.0131%2C1107.5067%2C1107.3771%2C1107.5261%2C1107.0418%2C1107.4134%2C1107.5912%2C1107.2289%2C1107.2711%2C1107.0991%2C1107.0262%2C1107.0124%2C1107.1900%2C1107.5823%2C1107.5429%2C1107.4734%2C1107.2939%2C1107.0003%2C1107.4533%2C1107.5663%2C1107.2383%2C1107.5577%2C1107.1220%2C1107.1359%2C1107.3338%2C1107.4979%2C1107.3562%2C1107.0873%2C1107.4189%2C1107.0206%2C1107.5141%2C1107.3505%2C1107.1093%2C1107.1167%2C1107.0225%2C1107.5345%2C1107.5593%2C1107.3428%2C1107.5786%2C1107.1648%2C1107.0354%2C1107.3090%2C1107.3761%2C1107.1717%2C1107.4236%2C1107.5736%2C1107.3763%2C1107.5233%2C1107.3779%2C1107.3502%2C1107.2783%2C1107.4945%2C1107.2538%2C1107.3946%2C1107.1131%2C1107.2467%2C1107.1137%2C1107.2725%2C1107.1471%2C1107.4384%2C1107.1385%2C1107.2624&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fluctuation and Order of Antiferromagnetism induced by Paramagnetic\n  Pair-Breaking in Superconducting Vortex Lattice"}, "summary": "Effects of the strong Pauli-paramagnetic pair-breaking (PPB) on the vortex\nlattice in d-wave superconductors are theoretically studied by putting emphasis\non consequences of the PPB-induced antiferromagnetic (AFM) ordering in the\nspatial modulation in the vortex lattice. It is shown that the PPB-induced AFM\nfluctuation in the superconducting state leads to an enhancement of the vortex\nlattice form factor which is a measure of spatial variations of the internal\nmagnetic field and that the enhancement becomes more remarkable as an AFM\ninstability is approached. It is also demonstrated that the PPB-induced AFM\nordering is assisted by the vortex-lattice modulation, and thus, that the\nresulting AFM order is spatially modulated, while it is not localized in the\nvortex cores but coexistent with the nonvanishing superconducting order\nparameter. These results are discussed in connection with two phenomena\nobserved in CeCoIn5, the anomalous field dependence of the vortex lattice form\nfactor and the AFM order appearing inside the high-field and low-temperature\nsuperconducting phase.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.5662%2C1107.4448%2C1107.3118%2C1107.4599%2C1107.4774%2C1107.3656%2C1107.0170%2C1107.5559%2C1107.2033%2C1107.3113%2C1107.4239%2C1107.2022%2C1107.3208%2C1107.4850%2C1107.1320%2C1107.3317%2C1107.2440%2C1107.4402%2C1107.0989%2C1107.5252%2C1107.1087%2C1107.5600%2C1107.3437%2C1107.4341%2C1107.2307%2C1107.0997%2C1107.0004%2C1107.5131%2C1107.4894%2C1107.1719%2C1107.5464%2C1107.1869%2C1107.5861%2C1107.1177%2C1107.0427%2C1107.4809%2C1107.3499%2C1107.1799%2C1107.2948%2C1107.0131%2C1107.5067%2C1107.3771%2C1107.5261%2C1107.0418%2C1107.4134%2C1107.5912%2C1107.2289%2C1107.2711%2C1107.0991%2C1107.0262%2C1107.0124%2C1107.1900%2C1107.5823%2C1107.5429%2C1107.4734%2C1107.2939%2C1107.0003%2C1107.4533%2C1107.5663%2C1107.2383%2C1107.5577%2C1107.1220%2C1107.1359%2C1107.3338%2C1107.4979%2C1107.3562%2C1107.0873%2C1107.4189%2C1107.0206%2C1107.5141%2C1107.3505%2C1107.1093%2C1107.1167%2C1107.0225%2C1107.5345%2C1107.5593%2C1107.3428%2C1107.5786%2C1107.1648%2C1107.0354%2C1107.3090%2C1107.3761%2C1107.1717%2C1107.4236%2C1107.5736%2C1107.3763%2C1107.5233%2C1107.3779%2C1107.3502%2C1107.2783%2C1107.4945%2C1107.2538%2C1107.3946%2C1107.1131%2C1107.2467%2C1107.1137%2C1107.2725%2C1107.1471%2C1107.4384%2C1107.1385%2C1107.2624&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects of the strong Pauli-paramagnetic pair-breaking (PPB) on the vortex\nlattice in d-wave superconductors are theoretically studied by putting emphasis\non consequences of the PPB-induced antiferromagnetic (AFM) ordering in the\nspatial modulation in the vortex lattice. It is shown that the PPB-induced AFM\nfluctuation in the superconducting state leads to an enhancement of the vortex\nlattice form factor which is a measure of spatial variations of the internal\nmagnetic field and that the enhancement becomes more remarkable as an AFM\ninstability is approached. It is also demonstrated that the PPB-induced AFM\nordering is assisted by the vortex-lattice modulation, and thus, that the\nresulting AFM order is spatially modulated, while it is not localized in the\nvortex cores but coexistent with the nonvanishing superconducting order\nparameter. These results are discussed in connection with two phenomena\nobserved in CeCoIn5, the anomalous field dependence of the vortex lattice form\nfactor and the AFM order appearing inside the high-field and low-temperature\nsuperconducting phase."}, "authors": ["Kazushi Aoyama", "Ryusuke Ikeda"], "author_detail": {"name": "Ryusuke Ikeda"}, "author": "Ryusuke Ikeda", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.84.184516", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.5577v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.5577v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "26 pages, 13 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.5577v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.5577v1", "journal_reference": "Phys. Rev. B 84, 184516 (2011)", "doi": "10.1103/PhysRevB.84.184516", "fulltext": "Fluctuation and Order of Antiferromagnetism induced by Paramagnetic\nPair-Breaking in Superconducting Vortex Lattice\n\narXiv:1107.5577v1 [cond-mat.supr-con] 27 Jul 2011\n\n1\n\nKazushi Aoyama1,2 and Ryusuke Ikeda2\nYoung Researcher Development Center, Kyoto University, Kyoto 606-8317, Japan\n2\nDepartment of Physics, Kyoto University, Kyoto 606-8502, Japan\n\nEffects of the strong Pauli-paramagnetic pair-breaking (PPB) on the vortex lattice in d-wave\nsuperconductors are theoretically studied by putting emphasis on consequences of the PPB-induced\nantiferromagnetic (AFM) ordering in the spatial modulation in the vortex lattice. It is shown that\nthe PPB-induced AFM fluctuation in the superconducting state leads to an enhancement of the\nvortex lattice form factor which is a measure of spatial variations of the internal magnetic field and\nthat the enhancement becomes more remarkable as an AFM instability is approached. It is also\ndemonstrated that the PPB-induced AFM ordering is assisted by the vortex-lattice modulation, and\nthus, that the resulting AFM order is spatially modulated, while it is not localized in the vortex cores\nbut coexistent with the nonvanishing superconducting order parameter. These results are discussed\nin connection with two phenomena observed in CeCoIn5 , the anomalous field dependence of the\nvortex lattice form factor and the AFM order appearing inside the high-field and low-temperature\nsuperconducting phase.\n\nI.\n\nINTRODUCTION\n\nAn antiferromagnetic (AFM) instability occurring near a superconducting (SC) phase with d-wave symmetry has\nbeen repeatedly detected in experiments and discussed theoretically. In zero field, the AFM and SC orders are\ncompetitive with each other and tend not to coexist with each other [1]. Recently, AFM quantum critical phenomena\nnear the SC pair-breaking field Hc2 (0) have been observed commonly in the heavy-fermion superconductors such as\nCeCoIn5 [2–4], pressured CeRhIn5 [5], NpPd5 Al2 [6], and Ce2 PdIn8 [7], which indicates field-tuned proximity of an\nAFM instability to the onset of the SC order. However, these materials do not show any magnetic order in the normal\nstate: An AFM fluctuation is merely enhanced with decreasing field toward Hc2 (0) in the nonmagnetic normal state.\nFurther, it has been also clarified in CeCoIn5 that the AFM fluctuation is enhanced as Hc2 (0) is approached by\nincreasing the field in the SC phase. A basic origin of the strong AFM fluctuation induced in the vicinity of Hc2 (0)\nseems to consist in characteristic features of these superconductors, i.e., the strong Pauli-paramagnetic pair-breaking\n(PPB) effect and a d-wave SC pairing symmetry. In our previous paper [8], we have shown that, in a SC phase with\na d-wave pairing symmetry, the PPB effect enhanced by increasing field and decreasing temperature tends to induce\nan AFM order and that the field-induced AFM fluctuation found below Hc2 (0) can be explained as a result of this\nnovel PPB effect. In this paper, we will extend our previous theory to describe spatial variations of the AFM order\nin a SC vortex lattice by bearing the experimental studies on CeCoIn5 in our mind.\nCeCoIn5 is a spin-singlet superconductor with a layered crystal structure along c-axis [9] and its SC pairing symmetry\nis believed to be of dx2 −y2 -type [10]. In the SC state in a magnetic field perpendicular to the basal plane (H k c),\nan anomalous field dependence of the vortex lattice form factor (VLFF), which is a measure of spatial distribution of\nthe internal magnetic field in vortex lattice states, has been observed in neutron scattering experiments. It has been\nknown that, although VLFF decreases with increasing field in the conventional type II superconductors [11, 12], it\nrather increases with increasing field in CeCoIn5 , and that the slope of VLFF in this material becomes sharp abruptly\nin higher fields near Hc2 (0) at low temperatures [13, 14]. First, this intriguing behavior has been explained as a result\nof strong PPB [15]. However, the origin of the abrupt increase in higher fields has not been sufficiently explained\nthere. In the preceding theoretical study on VLFF in Ref. [15], the strong AFM fluctuation induced in the SC state\njust below the Hc2 (T ) curve [3, 4, 18–20] is not taken into account. If the AFM order and fluctuation occurring in\nCeCoIn5 just below Hc2 (0) are of a SC origin, it is rather necessary to incorporate effects of the PPB-induced AFM\nfluctuation in explaining VLFF data. In addition, a possible relation between such a field-induced increase of VLFF\nand the proposed FFLO state [16, 17] at the high field end of the SC phase should be considered.\nOn the other hand, in a magnetic field parallel to the basal plane (H k ab), the existence of a high-field and\nlow-temperature (HFLT) SC phase has been clarified previously and has been identified with a spatially modulated\nFulde-Ferrell-Larkin-Ovchinnikov (FFLO) [21, 22] vortex lattice state [23, 24]. However, recent neutron scattering\nexperiments have shown that an AFM order with its staggered moment vector oriented along c-axis exists only inside\nthe HFLT phase [25, 26]. On the other hand, the doping experiment [27] indicating that the HFLT phase is quite\nsensitive to both the magnetic and nonmagnetic impurities and is destroyed by quite a small amount of nonmagnetic\nimpurities supports the FFLO picture on this HFLT phase [28]. Further, a recent NMR measurement has clarified\nthe presence in the HFLT phase of normal state regions possibly corresponding to the FFLO nodal planes of the SC\n\n\f2\norder parameter, while the AFM order in the HFLT phase is, at least in the higher field region of the HFLT phase,\napparently homogeneous in real space [29]. Although several microscopic pictures on an AFM order in the d-wave\nsuperconductors in high fields have been proposed so far [30–32], these experimental results are comprehensively\nexplained by the scenario that the HFLT phase is a realization of the longitudinal FFLO vortex lattice state [28], and\nthat the AFM order observed inside the HFLT phase is induced by PPB and favors coexistence with the SC order [30].\nIn Ref. [30], the spatial distributions of the PPB-induced AFM order in the presence of the FFLO modulation parallel\nto the applied magnetic field has been theoretically investigated in the Pauli limit where the effect of the in-plane\nvortex-lattice modulation is neglected. Although the result obtained in the Pauli limit seems to give a correct picture\non spatial orderings over larger scales, the vortex lattice modulation must be inevitably included to describe local\nproperties such as the internal magnetic field and the spatial distribution of the AFM order. In this paper, we will\ninvestigate the spatial distributions of the internal magnetic field brought by the AFM fluctuation and a possible AFM\norder in the presence of the vortex lattice, taking account of both the orbital and Pauli-paramagnetic pair-breaking\neffects in the Ginzburg-Landau (GL) approach where the perturbative expansion with respect to the SC and AFM\norder parameters is used. It will be shown that VLFF is enhanced by an additional magnetic screening brought by\nthe PPB-induced AFM fluctuation and that the enhancement becomes more remarkable as an AFM instability is\napproached, which suggests that the anomalous field dependence of VLFF observed in CeCoIn5 in H k c is due to the\nPPB-induced AFM critical fluctuation. It will also be discussed that the spatial modulation of the SC vortex lattice\nenhances the AFM fluctuation, and thus that an AFM order with a spatial modulation synchronized with the vortex\nlattice appears. The modulated AFM is not localized in the vortex core but prefers to coexist with a nonvanishing\nSC order, which is the same tendency as that of the AFM order modulated by the longitudinal FFLO structure of\nthe SC order parameter [8, 30].\nThe outline of this paper is as follows: In Sec. II, we introduce the theoretical model and derive a Ginzburg-Landau\n(GL) free-energy functional and a Maxwell equation for the internal magnetic field. The effect of the PPB-induced\nAFM fluctuation on VLFF in the case with H k c is discussed in Sec. III. This is followed by Sec. IV in which we\nargue the PPB-induced AFM order in the SC vortex lattice state in the case with H k ab. Summary is provided in\nSec. VI.\nII.\nA.\n\nFORMULATION\n\nElectronic Hamiltonian\n\nWe start from the electronic Hamiltonian involving a kinetic energy for noninteracting quasiparticles with the\nZeeman energy H0 and two interaction terms leading to d-wave superconductivity HSC and antiferromagnetism\nHAFM . It can be written as H = H0 + HSC + HAFM , where\n\u0014 \u0010\n\u0015\n\u0011\nXZ\nH0 =\nφ†σ (r) ε − i ∇ + |e|A(r) − σμB gB(r) φσ (r),\nr\n\nσ\n\nHSC = −|g|\n\nHAFM = −U\n\nX\n\nΨ̂† (q) Ψ̂(q),\n\nq\n\nX\nq\n\nŜ† (q) * Ŝ(q)\n\n(1)\n\nwith\n1 X\nφσ (r) = √\nĉp,σ ei(p⊥ *r⊥ +ipz d j) ,\nV p\n1 X\nΨ̂(q) =\n(−i σy )α,β wp ĉ−p+ q2 ,α ĉp+ q2 ,β ,\n2\np,α,β\nX\nŜ(q) =\nĉ†p,α (σ)α,β ĉp+Q0 +q,,β .\n\n(2)\n\np,α,β\n\nHere, the layered crystal structure with an interlayer distance d in the z direction is assumed, and a position of a\nquasiparticle r is defined by (r⊥ , d j) with an integer j specifying the location of the layer. The unit h̄ = c = kB = 1 is\nused throughout this paper. In the Hamiltonian, ĉp,α is the annihilation operator for a quasiparticle with momentum\np and spin projection α, ε(p) is a kinetic energy measured from the Fermi level EF , and the Zeeman energy is\n\n\f3\nexpressed as μB gB(r) with the magnetic flux B(r), a g-factor, and the Bohr magneton μB . The vector potential A(r)\nis expressed as A(r) = A0 (r) + a(r) and is related to the magnetic flux by the equation\nB(r) = ∇ × A(r) = H Ẑ + ∇ × a(r),\n\n(3)\n\nwhere ∇ × A0 (r) = H, and spatially varying internal magnetic fields are given in terms of a(r). The direction of the\nuniform external magnetic field H is denoted by Ẑ and will be fixed along the z axis (Ẑ = ẑ) in H k c case and the y\naxis (Ẑ = ŷ) in H k ab case. Concerning the interaction terms, |g| and U are coupling constants with positive values,\nσi (i = x, y, z) are the Pauli matrices, wp denotes a SC pairing symmetry, and Q0 = (π/a, π/a, π/d) with a lattice\nconstant a in the ab plane is the commensurate nesting vector. Since the pairing symmetry wp is assumed to be of\ndx2 −y2 -type, the identity\nwp+Q0 = −wp\n\n(4)\n\nis satisfied. In our model Hamiltonian, antiferromagnetism is induced by the nesting property of the dispersion\nε(p + Q0 ) = −ε(p) + Tc δIC ,\n\n(5)\n\nwhere the deviation from the perfect nesting condition is scaled by the SC transition temperature Tc and is measured\nby the dimensionless parameter δIC [33]. Although δIC is p-dependent in general, δIC is assumed to be a constant\nvalue since the details of the dispersion do not change our result qualitatively [30]. Then, the Fermi velocity vector\nvp defined by d ε(p)/d p satisfies the relation vp+Q0 = −vp .\nIn order to discuss AFM order and fluctuation in the SC state, we introduce the SC pair-field ∆(q) and the AFM\nstaggered field m(q) which are defined by\n∆(q) = |g|hΨ̂(q)i,\n\nm(q) = U hŜ(q)i,\n\n(6)\n\nwhere h i represents the statistical average. Here, ∆(q) (m(q)) plays a role of the SC (AFM) order parameter. In the\nmean-field approximation, the interaction terms in the Hamiltonian are expressed as\n\u0011\nX\u0010\n1 X\n|∆(q)|2 −\n∆(q) Ψ̂† (q) + H.c. ,\n|g| q\nq\n\u0011\nX\u0010\n1 X\nm(q) * Ŝ† (q) + H.c. .\n|m(q)|2 −\n=\nU q\nq\n\nHSC =\nHAFM\n\n(7)\n\nAlthough, in principle, the AFM moment vector m(q) can be oriented in any direction, the two typical configurations,\nm k H and m ⊥ H, will be considered since, in CeCoIn5 of our interest, the configuration m k c ⊥ H has been\nconfirmed in the AFM order observed inside the HFLT phase in H k ab case and m k H would be realized in H k c\ncase if m is locked in the c-axis.\nB.\n\nGinzburg-Landau free energy functional\n\n\u0002\n\u0003\u0001\nfree energy of this system is given by F = −T ln Trc,c† ,∆,∆∗ ,m exp − (H0 + HSC + HAFM )/T +\nR The\nd3 rB2 (r)/(8π). In this paper, we derive the Ginzburg-Landau (GL) free energy of a form expanded in powers\nof both |∆(q)| and |m(q)|, taking both the orbital and Pauli-paramagnetic pair-breaking effects into account. Formally, the mean-field GL free-energy density in the present system can be written as\n(2)\n\n(4)\n\n(6)\n\n(2,2)\n\n(2)\n(4)\nFGL (∆, m) = F∆ + F∆ + F∆ + Fm\n+ F∆,m + Fm\n,\n(l)\n\n(8)\n\n(l)\n\nwhere F∆ (Fm ) is the lth order term dependent only on |∆| (|m|), and the leading order SC-AFM coupling term\n(2,2)\nF∆,m , which is proportional to |∆|2 |m|2 , is incorporated. We note that, although the correction to the |m|4 term\n(2,4)\n\nF∆,m , which is proportional to |∆|2 |m|4 , should be also incorporated in examining the character of the AFM transition,\n(2,4)\n\nF∆,m is omitted here since we have already checked that it tends to make the AFM transition a continuous one [30].\nFirst, we determine the Hc2 (T ) curve and the amplitude of the spatially averaged gap function ∆2 ≡ h|∆(r)|2 isp from\n\n\f4\n(2)\n\n(6)\n\n(4)\n\nthe SC part of the GL free energy F∆ + F∆ + F∆ . This procedure in which ∆ and m are separately considered is\njustified at least near the second order AFM transition. Since FGL (∆, m = 0) takes the form\nFGL (∆, 0) = V2 |∆|2 +\n\nV6\nV4\n|∆|4 + |∆|6\n2\n3\n\n(9)\n\nwith the coefficients Vi whose expressions reflect the microscopic details, the discontinuous Hc2 (T ) curve is determined\nby\nV2 =\n\n3 V42\n16 V6\n\n(10)\n\nand the ∆ which minimizes FGL (∆, m = 0) is determined by\np\n−V4 + V42 − 4V2 V6\n.\n|∆0 |2 =\n2V6\n\n(11)\n\nNext, AFM fluctuation inside the SC phase determined by FGL (∆, 0) will be discussed based on the usual GL theory\n(2)\n(2,2)\n(4)\nfor the AFM part of the free energy Fm + F∆0 ,m + Fm . The AFM instability is determined by\n\u0011\n1 \u0010 (2)\n(2,2)\nF\n+\nF\n= 0,\nm\n∆\n,m\n0\nm2\n\n(12)\n\nwhere m2 ≡ h|m(r)|2 isp is the spatially averaged value of the AFM order parameter. The m minimizing FGL (∆0 , m)−\nFGL (∆0 , 0) is determined by\n(2)\n(2,2) \u0001\n2\n1 Fm + F∆0 ,m /m\n|m0 | = −\n.\n(4)\n2\nF m / m4\n2\n\n(13)\n\nTo derive the GL free-energy functional FGL , we will carry out the Feynman-diagrammatic\ncalculation. Regarding\nP\nthe field dependence of the quasiparticle Green's function −hTτ φσ (r, τ ) φ†σ (r′ , 0)i = T εn Gεn ,σ (r, r′ ) e−εn τ with a\nfermion Matsubara frequency εn = πT (2n + 1), we will use the quasi-classical approximation for the Green's function\ndefined in the normal state Gεn ,σ (r, r1 ), namely,\nR r1\ni|e|\nds*A(s)\nr\nGεn ,σ (r, r1 ) ≃ Gεn ,σ (r − r1 ) e\n,\n(14)\nwhere Gεn ,σ (r − r1 ) is defined in the uniform normal state and its Fourier transformation is given by\n\u0003\u0001−1\n\u0002\nGεn ,σ (p) = iεn − ε(p) − σ ITc\n\n(15)\nR\n\nwith I = μB gH/Tc . The orbital pair-breaking effect, which is brought by exp[i|e| ds * A(s)] in Eq. (14), can be fully\nincorporated in the diagrammatic calculation by using the relation [34]\nZ r1\n\u0011\n\u0010\nds * A(s) ∆(r1 ) = e−i(r−r1 )*Π(r) ∆(r)\n(16)\nexp i2|e|\nr\n\nwith\nΠ(r) = −i ∇ + 2|e|A(r).\n\n(17)\n\nThe quadratic, quartic, and sixth order terms with respect to |∆| have been already derived elsewhere [23, 35] and\nare written as\nZ\n\u0011\n\u0010 1\n1\n(2)\n(2)\nF∆ =\n− K̂∆ (Π) ∆(r),\n∆∗ (r)\nV r\n|g|\nT XX\n(2)\nK̂∆ (Π) =\n|wp |2 Gεn ,σ (p) G−εn ,−σ (−p + Π),\n2 ε ,σ p\nn\nZ\n1\n(4)\n(4)\nF∆ =\nK̂ (Πi )∆∗ (s1 )∆(s2 )∆∗ (s3 )∆(s4 ) si →r ,\n2V r ∆\n\n\f5\n\nFIG. 1: Feynman diagrams describing the second order terms with respect to the AFM order parameter |m| in the GL free\n(2)\n(2,2)\nenergy. The |m|2 term in the normal state Fm is described by (a) and the correction term brought by the SC order F∆,m\nconsists of the contributions coming from the two types of diagrams (b) and (c). A solid line denotes the quasiparticle Green's\nfunction defined in the normal state.\n\nT XX\n|wp |4 Gεn ,σ (p) G−εn ,−σ (−p + Π†1 ) G−εn ,−σ (−p + Π2 ) Gεn ,σ (p + Π†3 − Π2 ),\n2 ε ,σ p\nn\nZ\n1\n(6)\n(6)\nF∆ =\nK̂ (Πi )∆∗ (s1 )∆(s2 )∆∗ (s3 )∆(s4 )∆∗ (s5 )∆(s6 ) si →r ,\n3V r ∆\nT XX\n(6)\nK̂∆ (Πi ) = −\n|wp |6 Gεn ,σ (p) G−εn ,−σ (−p + Π†1 ) G−εn ,−σ (−p + Π6 )\n2 ε ,σ p\n(4)\n\nK̂∆ (Πi ) =\n\nn\n\n×Gεn ,σ (p − Π†1 + Π2 ) G−εn ,−σ (−p + Π†1 − Π2 + Π†3 ) Gεn ,σ (p − Π6 + Π†5 ).\n\n(18)\n\nThe concrete expressions of the coefficients Vi in Eq. (9) are given in Appendix II. The AFM contributions in the GL\nfree energy are formally written as\n\u0011\nX\u0010 1\n(2)\n(2)\n+ K̂m\n(q) |m(q)|2 ,\nFm\n=\nU\nq\nX\n(2,2)\n(2,2)\nK̂∆,m (q, q′ ) m(q)m∗ (q′ ),\nF∆,m =\nq,q′\n\n(4)\nFm\n=\n\n1\n2\n\nX\n\n(4)\nK̂m\n(qi ) m(q1 )m∗ (q2 )m(q3 )m∗ (q4 ).\n\n(19)\n\nqi (i=1−4)\n(2)\n\n(2,2)\n\nThe |m|2 terms are described by Feynman diagrams shown in Fig. 1. Figure 1 (a) corresponds to Fm , and F∆,m\n(2)\n\nconsists of the contributions described by the two types of diagrams (b) and (c) in Fig. 1. Then, K̂m (q) and\n(2,2)\nK̂∆,m (q, q′ ) are given by\n\u0013\n1 X XX\n1\n+\nGεn ,σ (p)Gεn ,σ (p + Q0 + q)\nT\nU\n2 σ\nεn p\n\u0012\n\u0015\u0013\nX\u0014 1\nT\n1 X X D i sεn E\n= N (0) ln\n+ 2πT\n−\n,\n(−) FS\nTN\n|εn | 2 σ s =±1 d+,q\nεn >0\nεn\nZ \u0014\n1 X XX 1\n(2,2)\n′\n2 |wp |2 Gεn ,σ (p) Gεn ,σ (p − Q0 − q) Gεn ,σ (p − (q − q′ )) G−εn ,−σ (−p + Π1 + (q − q′ ))\nT\nK̂∆,m (q, q ) = −\n2 σ\nV\nr\nεn p\n\u0015\n′\n− wp wp+Q0 Gεn ,σ (p) Gεn ,σ (p − Q0 − q) G−εn ,−σ (−p + Q0 + q + Π1 ) G−εn ,−σ (−p + Π1 + (q − q ))\n\n1\n(2)\n+ K̂m\n(q) =\nU\n\n\u0012\n\n′\n\n×ei r*(q−q ) ∆∗ (r) ∆(s1 )|s1 →r\n\u0014\n\u001c\nZ\nX\n1\n1X\ni r*(q−q′ ) ∗\n2\n∆ (r) 2 |wp |\n(i sεn ) e\n2πT N (0)\n= −\n(−)\n(−)\n(−)\n2 σ\nr\ndσ,Π1 dσ,Π1 +q−q′ d+,q\nεn\n\u0015\n\u001d\n\u0014\n\u0015\n1\n1\n1\n+ (−) (−) (−) − wp wp+Q0 − (−)\n− (+) (−) (+) ∆(s1 )\n(−) (+)\ndσ,Π1 d+,q d+,q′\ndσ,Π1 +q−q′ d+,q d+,q′\ndσ,Π1 d+,q d+,q′\nFS\n\ns1 →r\n\n(20)\nwith\n(±)\n\ndσ,Πi = 2i εn + 2σITc ± vp * Πi ,\n\n\f6\nTABLE I: Coefficients Pj , Aj , Bj , and Cj in Eqs. (24) and (30)\nj\n1\n2\n3\n4\n\nPj\nAj\nBj\nCj\n2 ρ1 + ρ2 ρ2 + ρ3\n−ρ2\n2\nρ1\nρ3\nρ2\n−1\nρ1\nρ1 + ρ3 −ρ1 − ρ2\n−1\nρ1\n−ρ3\nρ2\n\n(±)\n\nd+,q = 2i εn + (σ + σ)ITc ± (Tc δIC + vp * q),\n\n(21)\n\nsgn(εn ), the summation for the momentum p has been carried out by using the usual replacement\nwhere sεn represents\nR\nP\n, N (0) is the density of state per spin at the Fermi level, FS represents the angle average on\np → N (0) dε(p)\nFS\nthe Fermi surface, and the approximation ε(p + Π) ≃ ε(p) + vp * Π (|Π|/|p| ≪ 1) is used. TN is the AFM transition\ntemperature in the normal state. It should be noted that σ changes its sign depending on the orientation of m relative\nto the external magnetic field H, i.e., σ = σ for m k H and σ = −σ for m ⊥ H.\nBy using the transformation\nZ ∞\nh\ni\n1\n=\ndρ exp − D ρ (Re D > 0),\n(22)\nD\n0\nEq. (20) can be rewritten as\n\nand\n\nZ ∞ \u0014\n\u0010\nD\n\u0010\n\u0011E \u0015\u0011\n1\nT\n2πt\n(2)\n−1\ndρ\n+\n+ K̂m (q) = N (0) ln\n− fcos (ρ, 0) cos (δIC + Tc vp * q) ρ\nU\nTN\nsinh(2πt ρ)\nFS\n0\n\n(2,2)\nK̂∆,m (q, q′ )\n\nZ\n3\n4\n3 Z\nX\n\u0001\n1 X X\n1\nN (0) Y ∞\ni r*(q−q′ ) ∗\nρi , Aj\nP\nf\ne\n∆\n(r)\ndρ\n=\nj\ncos\ni\nTc2 i=1 0\nV r\n2 s =±1 j=1\ni=1\nεn\n\u001c\n\u001d\nh\ni\ni\nh\n′\nv\n*\nq\nv\n*\nq\np\np\n2\n−1\n× |wp | exp isεn (δIC (Bj + Cj ) +\nBj +\nCj exp isε Tc vp * Π1 Aj ∆(s1 )\nTc\nTc\nFS\n\n(23)\n\n(24)\n,\n\ns1 →r\n\nwhere the relation wp+Q0 = −wp is used, the functions\n\ni\u0011\n\u0010 h\n2πt\nσ+σ\n\u0002\n\u0003 cos I 2 y +\n(x − y) ,\nσ\nsinh 2πt x\ni\u0011\n\u0010\nh\n2πt\nσ+σ\n\u0002\n\u0003 sin I 2 y +\nfsin (x, y) =\n(x − y)\nσ\nsinh 2πt x\n\nfcos (x, y) =\n\n(25)\n\nare introduced for convenience, and the coefficients Pj , Aj , Bj , and Cj are shown in Table. I. In the same manner,\n(4)\nK̂m (qi ) in Eq. (19) is calculated as\nXX\n(4)\nK̂m\n(qi ) = T\nGεn ,σ (p) Gεn ,σ (p + Q0 + q2 ) Gεn ,σ (p + q2 − q3 ) Gεn ,σ (p + Q0 + q1 ) δΣq\nεn ,σ p\n\n3\n3 Z\n3\n\u0010\nX\nX\n\u0001\u0011\n\u0001\nN (0) Y ∞\nρ\n= δΣq\nρ\n,\n0\ncos\nδ\ndρ\nf\ni\ni\nIC\ni\ncos\nTc2 i=1 0\ni=1\ni=1\n\u001c\ni\u0011\nh\n\u0010\n× cos Tc−1 vp * q1 (ρ1 + ρ2 ) + vp * q2 (−ρ2 + ρ3 ) + vp * q3 ρ2\n\u0010\nh\ni\u0011\u001d\n+ cos Tc−1 vp * q1 ρ1 + vp * q2 (−ρ1 + ρ2 ) + vp * q3 (ρ1 + ρ3 )\n\n,\n\n(26)\n\nFS\n\nwhere δΣq denotes δq4 ,q1 −q2 +q3 .\n\u0003\n\u0002\nR\n′\nNext, we calculate r ei r*(q−q ) ∆∗ (r) exp isε A Tc−1 vp * Πi ∆(si )|si →r in Eq. (24). In the presence of a magnetic\nfield, the SC gap function ∆(r) has a spatial modulation due to vortices induced by the orbital pair-breaking effect.\nIn this paper, the SC gap function is assumed to take the form of a familiar Abrikosov vortex lattice\n∆(r) = ∆φ0 (X, Y )\n\n(27)\n\n\f7\nwith\nφ0 (X, Y ) =\n\ns\n\n\u0014 \u0010\n∞\n\u00112 \u0015\nπ \u0011 1\u0010 X\nsk\nk X\n√\nY + s2 −\n+ sk\n,\nexp i\nπ s=−∞\nrH\n2\n2 rH\n\n(28)\n\nwhere rH is the magnetic length defined by rH = (2|e|H)−1/2 and a structure of the vortex lattice is specified by k.\nThe coordinate (X, Y ) denotes that in the plane perpendicular to the magnetic field and is defined by (x, y) for Ẑ k ẑ\nand (γ 1/2 z, γ −1/2 x) for Ẑ k ŷ, where γ denotes\nto that in\nq the ratio of the SC coherence length in the basal (ab)pplane\n√\n2 i /hv 2 i . In our numerical calculation, k =\nthe direction along c-axis and is expressed as hvp,x\nπ\n3\ndescribing\nFS\np,z FS\n\nthe triangular lattice is used since, in the high field SC phase of CeCoIn5 in H k c, the square lattice characteristic of\nd-wave superconductors is deformed into nearly triangular ones due to the strong PPB effect [10, 13]. By using the\nidentity [23]\nh v * Πi\nh 1\ni\n√\np\nexp iA\nφ0 (X, Y ) = exp − A2 (|η|2 − η ∗2 ) φ0 (X + A η ∗ 2rH , Y )\n(29)\nTc\n2\n\u0001 √\n\u0001\n\u0001\n\u0001 √\nwith η = vp,x + i vp,y / 2 rH Tc for Ẑ k ẑ and η = γ 1/2 vp,z + i γ −1/2 vp,x / 2 rH Tc for Ẑ k ŷ, we obtain\n(2,2)\n\nZ\n3\n3 Z\n4\n\u0010\n\u0011\nX\nX\nX (2)\n\u0001\n|∆|2 Y ∞\n1\niK⊥ *(X,Y )\ni(q−q′ )*r\ncos\nδ\n(B\n+\nC\n)\nρ\n,\nA\nP\nf\ne\ndρ\ne\nT\nIC\nj\nj\ni\nj\nj\ncos\ni\nK⊥\nTc2 i=1 0\nV r\ni=1\nj=1\nK⊥\n\u001c\ni\n\u0010η * K r\n\u0011\n\u0010 (η × K r )\n\u0011\u001d\nh |η|2\n′\nvp * q\nvp * q\n⊥ H\n⊥ H z\n√\n√\n× |wp |2 exp −\n(30)\n,\nBj +\nCj cosh\nA2j cos\nAj +\nAj\n2\nTc\nTc\n2\n2\nFS\n\nK̂∆,m (q, q′ ) = N (0)\n\nwhere η = (Re η, Im η) and K⊥ = (Kx , Ky ) is a reciprocal lattice vector of the SC vortex lattice in the plane\nperpendicular to the magnetic field. The details of the calculation in incorporating the orbital pair-breaking effect\nand the useful identities which will be used below are shown in Appendix I.\nAccording to Eq. (30), the SC-AFM coupling term is nonvanishing only when (qx − qx′ , qy − qy′ , qz − qz′ ) is equal to\n−(Kx , Ky , 0) in Ẑ k ẑ and −(γ −1/2 Ky , 0, γ 1/2 Kx ) in Ẑ k ŷ.\nC.\n\nVortex lattice form factor and the internal magnetic field\n\nIn the vortex lattice state, the SC gap function is expressed as |∆(X, Y )|2 =\n\nthe longitudinal flux distribution B(X, Y ) Ẑ is also expressed with K⊥ ,\nh\ni\nX\nB(X, Y ) =\nFK⊥ exp i K⊥ * (X, Y ) .\n\nP\n\nK⊥\n\nh\ni\n(2)\nTK⊥ exp i K⊥ * (X, Y ) . Then,\n(31)\n\nK⊥\n\nThe Fourier component |FK⊥ | with the smallest |K⊥ | 6= 0 corresponds to VLFF which is, in the neutron scattering\nexperiment, obtained from the integrated intensity of a diffraction peak [13]. Since VLFF measures the inhomogeneous\npart of the magnetic flux, the problem results in obtaining the spatially varying internal magnetic field.\nWe derive a Maxwell equation relating the internal magnetic field b(r) ≡ ∇ × a(r) in Eq. (3) to screening currents\nfrom the saddle point equation of the total free energy with respect to A δF/δA = 0, i.e., δH0 /δA A=A0 + ∇ ×\n(∇ × A(r))/(4π) = 0. Then, the Maxwell equation is given by\n\u0010 XX\n\u0011\nXX\n\u0001\n1\n−\n− |e|vp Gεn ,σ (p; r) − ∇ × T\nμB g σ Gεn ,σ (p; r) Ẑ,\n∇ × B(r) ≃ T\n(32)\n4π\nε ,σ p\nε ,σ p\nn\n\nn\n\nwhere higher order terms in A have been dropped in Eq. (32) because their contributions are negligibly small within\nthe quasi-classical approximation, and Gεn ,σ (p; r) is a Fourier transformation of the quasiparticle Green's function\nGεn ,σ (r, r′ ) and will be given later. In the right-hand side of Eq. (32), the first term is the usual term expressing the\ncurrent density, while the second term arises from the Zeeman term [36]. In this paper, we will use the perturbative\nexpansion for the quasiparticle Green's function with respect to both |∆| and |m|. Then, Gεn ,σ (p; r) can be written\nas\n(4)\n(0,2)\n(2,2)\nGεn ,σ (p; r) = G(2)\nεn ,σ (p; r) + Gεn ,σ (p; r) + Gεn ,σ (p; r) + Gεn ,σ (p; r)\n\n(33)\n\n\f8\n\nFIG. 2: Feynman diagrams for the SC and AFM contributions to the internal magnetic field. Here, the diagrams (a), (b), (c),\nand (d)-(f) denote the contributions proportional to |∆|2 , |∆|4 , |m|2 , and |∆|2 |m|2 , respectively. For the |∆|2 |m|2 terms, not\nall the diagrams but only typical ones are shown: a diagram with two wavy lines on a single solid line (d), one with two wavy\nlines separated by the vertex (e), and one with two wavy lines separated by the pair field |∆| (f). The two diagrams (d) and\n(e), and the diagram (f) denote the internal fields arising from the free energies described by the diagram (b) in Fig. 1 and the\ndiagram (c) in Fig. 1, respectively.\n\nwith\n†\n2\n∗\nG(2)\nεn ,σ (p; r) = −Gεn ,σ (−p + Π1 ) G−εn ,−σ (p) Gεn ,σ (−p + Π2 ) |wp | ∆(s1 )∆ (s2 )\n\nsi →r\n\n,\n\n†\n†\n†\nG(4)\nεn ,σ (p; r) = Gεn ,σ (−p + Π1 − Π2 ) G−εn ,−σ (p + Π2 ) Gεn ,σ (−p) G−εn ,−σ (p + Π3 ) Gεn ,σ (−p − Π3 + Π4 )\n\n×|wp |4 ∆(s1 )∆∗ (s2 )∆(s3 )∆∗ (s4 ) si →r ,\nX\n′\nG(0,2)\nm(q) m∗ (q′ ) ei(q−q )*r Gεn ,σ (−p − q′ ) Gεn ,σ (−p − Q0 ) Gεn ,σ (−p − q),\nεn ,σ (p; r) =\nq,q′\n\nG(2,2)\nεn ,σ (p; r) = −\n\nX\nq,q′\n\n′\n\nm(q) m∗ (q′ ) ei(q−q )*r Gεn ,σ (−p + Π1 − q′ ) Gεn ,σ (−p + Π†2 − q)\n\n\u0014\no\nn\n× |wp |2 Gεn ,σ (−p − Q0 + Π1 ) Gεn ,σ (−p + Π1 − q) G−εn ,−σ (p + q) + (Π1 ↔ Π†2 , q ↔ q′ )\nn\n+|wp |2 G−εn ,−σ (p + q′ ) G−εn ,−σ (p + Q0 ) G−εn ,−σ (p + q)\no\n+Gεn ,σ (−p + Q0 + Π1 ) G−εn ,−σ (p − Q0 ) Gεn ,σ (−p + Q0 + Π†2 )\nn\no\u0015\n−wp wp+Q0 Gεn ,σ (−p + Q0 + Π1 ) G−εn ,−σ (p − Q0 ) G−εn ,−σ (p − q′ ) + (Π1 ↔ Π†2 , q ↔ q′ )\n×∆(s1 ) ∆∗ (s2 )\n\n(n)\n\nsi →r\n\n,\n\n(34)\n\n(n,2)\n\nwhere Gεn ,σ and Gεn ,σ denote the contributions proportional to |∆|n and |∆|n |m|2 , respectively. The contribution\n(0)\nGεn ,σ has been dropped since it only gives a spatially uniform flux. We note that the SC fourth order term G(4)\nis incorporated since, in the case with strong PPB of our interest, |∆| is finite even on the Hc2 (T ) curve at low\ntemperatures due to the first order Hc2 transition and higher order SC contributions are not safely negligible. The\ncontributions G(2) , G(4) , and G(0,2) are described by the Feynman diagrams (a), (b), and (c) in Fig. 2, respectively.\nThe SC-AFM coupling term G(2,2) consists of the contributions described by the three types of Feynman diagrams\n(d)-(f) in Fig. 2.\nEquation (32) indicates that the magnetic flux can be written as\n(2)\n\n(4)\n\n(2,2)\n\nB(r) = H Ẑ + b∆ (r) + b∆ (r) + b(0,2)\nm (r) + b∆,m (r),\n(l)\n\n(l)\n\n(l,m)\n\n(35)\n(l,m)\n\nwhere b∆ (r) and b∆,m (r) are the internal magnetic fields coming from Gεn ,σ and Gεn ,σ , respectively. First, the\n(2)\n\nsecond order contribution b∆ (r) will be calculated. By using the transformation (22), we have\nXZ\nX\n−2πi sε\nT\n|wp |2 (+) (+)n ∆(s1 )∆∗ (s2 ) si →r\ndε(p) G(2)\nεn ,σ (p; r) = T\ndσ,Π1 dσ,Π†\nεn\nεn\n2\n\n\f9\n∞\n\nh\ni\n1 X\n2πt\n\u0003\n(isεn ) exp isεn I 2σ(ρ1 + ρ2 )\nsinh 2πt(ρ1 + ρ2 ) 2 s =±1\n0\nεn\ni\nh\n×|wp |2 exp isεn Tc−1 (ρ1 vp * Π1 + ρ2 vp * Π†2 ) ∆(s1 )∆∗ (s2 ) si →r .\n=\n\n1\nTc\n\nZ\n\ndρ1 dρ2\n\n\u0002\n\n(36)\n\nFurther, with the help of Eq. (65), we obtain\n(2)\n\n−\n\nb∆ (r)\n2|e|vF rH N (0)|∆|2\n= Ẑ\n4π\nTc\n\n(2)\nb̂K⊥ ,vp (ρ1,2 )\n\nZ\n\n∞\n\ndρ1 dρ2\n\n0\n\nX\n\nK⊥ 6=0\n\nE\nD\n|η|2\n2\n(2)\n(2)\nTK⊥ eiK⊥ *(X,Y ) |wp |2 b̂K⊥ ,vp (ρ1,2 ) e− 2 (ρ1 +ρ2 )\n\nFS\n\n,\n\n\u0001\n\u0011\u0014\n\u0011\n\u0010 (η × K r )\n\u0010η * K r\n\u0001 vp × K̃ rH Ẑ\n⊥ H z\n⊥ H\n√\n√\n(ρ1 − ρ2 ) fcos ρ1 + ρ2 , ρ1 + ρ2\n(ρ1 + ρ2 )\nsinh\n= cos\n2\n2\nvF |K̃ rH |2\n\u0015\n\u0011\n\u0010\n\u0001\nI rH\n(η × K⊥ rH )z\n√\n+\n(ρ1 + ρ2 ) ,\n(37)\nfsin ρ1 + ρ2 , ρ1 + ρ2 cosh\nπ ξ0\n2\n\nwhere vF is the Fermi velocity in the pure two dimensional system and ξ0 is the SC coherence length at T = 0 defined\nby ξ0 = vF /(2π Tc ). Here, the term proportional to (i|e|vp ) is transformed, with the rotation operator ∇ × * * *, in the\nform\n\u0012 X\n\u0013\nX\n(vp × K̃)Ẑ\nivp fK⊥ (vp )eiK⊥ *(X,Y ) ≃ ∇ ×\n(38)\nfK⊥ (vp )eiK⊥ *(X,Y ) Ẑ,\n|K̃|2\nK 6=0\nK 6=0\n⊥\n\n⊥\n\nwhere K̃ is defined by K̃ = (Kx , Ky , 0) for Ẑ k ẑ and K̃ = (γ −1/2 Ky , 0, γ 1/2 Kx ) for Ẑ k ŷ.\nTo check the result obtained here, we consider the internal field near Tc at nearly zero magnetic field, i.e., in the GL\nregion. We take the limit t → 1 and H → 0 (or equivalently, η → 0) in Eq. (37) in H k c case. Then, the contribution\narising from the Zeeman term, which is proportional to I in Eq. (37), vanishes, and the remnant orbital contribution\nis expressed as\nlim\n\nT →Tc , H→0\n\n\u001c\n\u001d\nZ\n(2)\n−b∆ (r)\n(vp × K⊥ )2z\n2π|e|vF2 N (0)|∆|2 X (2) iK⊥ *r⊥ ∞\nρ1 + ρ2\n2\n\u0003 |wp |\n\u0002\n=\ndρ\nTK⊥ e\n4π\nTc2\nvF2 |K⊥ |2\nsinh 2πρ1 + ρ2\n0\nFS\nK⊥\n\u001d\n\u001c\n2\n2 X\n(vp × K⊥ )z\n|∆|\n(2)\n(39)\nTK⊥ eiK⊥ *r⊥ |wp |2 2\n= CGL 2\nTc\nvF |K⊥ |2\nFS\nK⊥\n\nwith\nCGL ≡\n\n4|e|vF2 N (0) 7\nζ(3),\n(2π)2\n8\n\n(40)\n\nR∞\nP\nwhere 0 dρ ρ2 / sinh[2π ρ] = 4 n≥0 1/[2π(2n + 1)]3 is used. Equation (39) is a well-known familiar form of the\ninternal magnetic field obtained in the GL region [34].\nR\n(4)\nNext, we will calculate the fourth order contribution b∆ (r). By carrying out the integral dε(p) and using the\ntransformation (22), we have\n\u0014\nXZ\nX\n1\n4\nT\n)|w\n|\n(−2π\nis\ndε(p) G(4)\n(p;\nr)\n=\nT\np\nεn\nεn ,σ\n(+)\n(+)\n(+)\n(+)\ndσ,Π1 dσ,Π† dσ,Π3 dσ,Π†\nεn\nεn\n2\n4\n\u0015\n1\n1\n∆(s1 )∆∗ (s2 ) ∆(s3 )∆∗ (s4 ) si →r\n+ (+) (+) (+) (+)\n+ (+) (+) (+) (+)\ndσ,Π1 dσ,Π† dσ,Π† dσ,Π† −Π +Π†\ndσ,Π1 dσ,Π3 dσ,Π† dσ,Π −Π† +Π\n2\n\n= −\n×\n\n1 1\nTc3 2 s\n\nX\n\n4\n\n(isεn )\n\nεn =±1\n\n3\nX\nj=1\n\n4\n\n|wp | exp\n\ni=1\n\n\u0014\n\n3\n\n2\n\n4 Z\nY\n\n∞\n\n0\n\ni sεn Tc−1\n\n4\n\n4\n\n1\n\n2\n\n3\n\n4\ni\nh\nX\n2πt\ndρi\nρi )\n\u0002\n\u0003 exp isεn I2σ(\nP4\nsinh 2πt( i=1 ρi )\ni=1\n\n\u0010\n\u0011\u0015\n†\n†\nvp * Π1 αj + vp * Π2 βj + vp * Π3 γj + vp * Π4 δj ∆(s1 )∆∗ (s2 ) ∆(s3 )∆∗ (s4 )\n\n(41)\n,\n\nsi →r\n\n\f10\nTABLE II: Coefficients αj , βj , γj , δj in Eqs. (41) and (42)\nj\nαj\nβj\nγj\nδj\n1\nρ1\nρ2\nρ3\nρ4\n2\nρ1\nρ2 + ρ3 −ρ3 ρ3 + ρ4\n3 ρ1 + ρ2 −ρ2 ρ2 + ρ3\nρ4\n\nwhere the coefficients αj , βj , γj , and δj are shown in table II. With the combined use of Eqs. (66) and (38), we\nobtain\n∞\n4 Z ∞\n(4)\nY\nb (r)\n8π rH |∆|4 k X (4) iK⊥ *(X,Y ) X\n(4)\n√\ne\nT\nT\n(l\n,\nl\n,\nK\n)\ndρi\n= − Ẑ\n− ∆\n1\n2\n⊥\nK\n4π CGL\n7ζ(3) ξ0 Tc4\n2π K 6=0 ⊥\ni=1 0\nl1 ,l2 =−∞\n⊥\n\u0014\n3 \u001c\n\u0011\u0015\nX\n|η|2 \u0010 2\n4 (4)\n2\n2\n2\n|wp | b̂k⊥ ,p (ρj ) exp −\n×\nαj + βj + γj + δj + (αj + γj )(βj + δj )\n2\nj=1\n\u0014\n\u0014\n\u0011\u0015\n\u0011\u0015\u001d\n\u0001\u0010\n\u0001\u0010\n1\n1\n× exp − Re η 2 (αj − γj )2 + (βj − δj )2 exp i Im η 2 (αj − γj )2 − (βj − δj )2\n,\n8\n8\nFS\n4\n4\nX\nX\n\u0001 (vp × K̃rH )Ẑ h\n\u0001i\n\u0001\n\u0001\n\u0001\n(4)\nρi\nρi ,\nb̂k⊥ ,p (ρj ) = fcos\ncos Vj sinh Wj − i sin Vj cosh Wj\nvF |K̃rH |2\ni=1\ni=1\n+\n\n4\n4\nX\nX\n\u0001i\n\u0001\n\u0001\n\u0001\n\u0001h\nI rH\nρi cos Vj cosh Wj − i sin Vj sinh Wj\nρi ,\nfsin\nπ ξ0\ni=1\ni=1\n\n(42)\n\nwith\n\u0001 k \b\n(η * K⊥ rH ) \b\nKy rH\n√\n(αj + γj ) − (βj + δj ) − Im η √ (l1 − l2 )(αj − γj ) − (l1 + l2 +\n)(βj − δj ) ,\nk\n2 2\n2\n\u0001 k \b\nKy rH\n(η × K⊥ rH )z \b\n√\n)(βj − δj ) . (43)\n=\n(αj + γj ) + (βj + δj ) − Re η √ (l1 − l2 )(αj − γj ) + (l1 + l2 +\nk\n2 2\n2\n\nVj =\nWj\n\nConcerning the internal magnetic field induced by the AFM order, the leading order |m|2 term which does not\ninclude |∆| is straightforwardly calculated as\nZ\n(0,2)\n\u0010\n\u0011\n2\nbm (r)\nI ∞\n8π rH\n−\n= Ẑ\ndρ\ndρ\nf\n(ρ\n+\nρ\n,\n0)\ncos\nδ\n(ρ\n+\nρ\n)\n1\n2\nsin\n1\n2\nIC\n1\n2\n4πCGL\n7ζ(3) ξ02 π 0\n\u001c\n\u0011\u001d\n\u0010\n1 X\n−1\n−1\n′\n∗ ′\ni(q−q′ )*r\n.\ncos Tc vp * q ρ1 + Tc vp * q ρ2\nm(q) m (q ) e\n× 2\nTc\n′\nFS\n\n(44)\n\nq,q\n\n(0,2)\n\nWe note that, when the AFM moment is perpendicular to a magnetic field (σ = −σ), bm (r) vanishes since\nfsin (x, 0) = 0 in m ⊥ H.\n(2,2)\nThe internal magnetic field brought by the SC-AFM coupling b∆,m (r) can be derived in the same manner as that\nP R\n(2,2)\n(2)\nused in obtaining b∆ (r). T εn dε(p) Gεn ,σ (p; r) is calculated as\n\u0014\n\u0012\nXZ\nX\nX\n1\n(2,2)\n2\n∗ ′\ni(q−q′ )*r\nT\ndε(p) Gεn ,σ (p; r) = −2π T\n|wp |\n(i sεn )\nm(q) m (q ) e\n(−)\n(+)\n(+) (+)\ndσ,Π1 d † dσ,Π1 +q−q′ d+,q′\nεn\nεn\nq,q′\nσ,Π2\n\u0014\n\u0015\n1\n1\n1\n+ (Π1 ↔ Π†2 , q ↔ q′ ) + |wp |2 (+) (+) (+)\n+ (+) (+) (−) (−) + (+) (−) (−) (−)\n(+)\ndσ,Π1 dσ,Π† d+,q′ d+,q\ndσ,Π† d+,q′ d+,q d+,Π −Π† +q\ndσ,Π1 dσ,Π† dσ,Π1 +q−q′ d+,q\n2\n\n+\n\n(+)\n\n(+)\n\n(+)\n\n2\n\n1\n(−)\n\n(−)\n\n(−) (−)\n\ndσ,Π† d+,q′ d+,q d+,−Π\n2\n\n1\n\n1\n\n2\n\n2\n\n1\n\n1\n\n+ (−) (−) (−) (−) + (−) (−) (−) (−)\n(+) (+) (+) (+)\ndσ,Π1 dσ,Π† d+,q′ d+,q\ndσ,Π1 dσ,Π† d+,q′ d+,q\ndσ,Π1 d+,q′ d+,q d+,Π −Π† +q\n1\n2\n2\n2\n\u0014\n\u0015\n1\n1\n− wp wp+Q0 − (−) (−) (+) (−)\n− (+) (−) (+) (−)\ndσ,Π1 d+,q′ d+,q d+,Π −Π† +q\ndσ,Π† d+,q′ d+,q d+,Π −Π† +q\n+Π† +q′\n(+)\n\ndσ,Π1 dσ,Π† dσ,Π† −q+q′ d+,q′\n2\n\n+\n\n1\n\n2\n\n1\n\n2\n\n+\n\n1\n\n2\n\n2\n\n1\n\n2\n\n\f11\nTABLE III: Coefficients pj , aj , bj , cj , dj in Eqs. (45) and (46)\nj\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n\n−\n\n1\n(+)\n\n(−)\n\n(+)\n\n(+)\n\ndσ,Π† dσ,Π1 +q−q′ d+,q′ d+,q\n\npj\n2\n2\n2\n1\n1\n1\n1\n1\n1\n−2\n−2\n−2\n\n+ (Π1 ↔\n\naj\n−ρ2\nρ1 + ρ3\nρ1\nρ1\nρ1 + ρ3\nρ1\n−ρ1 − ρ2\nρ2\n−ρ1\n−ρ1 − ρ2\n−ρ2\nρ1\n\nΠ†2 ,\n\n2\n\nbj\nρ1 + ρ2\nρ2\nρ2\nρ2 + ρ3\nρ2\nρ2\nρ2\n−ρ1 − ρ2\n−ρ2\nρ2\nρ1 + ρ2\nρ2\n\ncj\nρ4\nρ3 + ρ4\nρ4\n−ρ3 − ρ4\nρ3\n−ρ3\nρ3\nρ2 + ρ3\nρ3\nρ3\nρ3\nρ1 + ρ3\n\n\u0015\u0013\nq ↔ q ) ∆(s1 ) ∆∗ (s2 )\n′\n\ndj\nρ2 + ρ3\n−ρ3\nρ3\nρ3\n−ρ3 − ρ4\n−ρ4\nρ2 + ρ4\nρ4\nρ4\nρ2 − ρ4\nρ2 − ρ4\n−ρ1 − ρ4\n\nsi →r\n\n4 Z ∞\n4\n12\n\u0011i\nh\n\u0010\nY\nX\nX\n1 1 X\n2πt\n= − 3\n(isεn )\ndρi\nρi − |ej |)\nexp isεn I 2σej + (σ + σ)(\n\u0002\n\u0003×\nP4\nTc 2 s =±1\nsinh 2πt ( i=1 ρi )\ni=1 0\ni=1\nj=1\nεn\n\u0014\n\u0011\u0015\n\u0010\ni\nh\n× exp − isεn δIC (cj + dj ) exp i sεn Tc−1 vp * Π1 aj + vp * Π†2 bj − vp * qdj − vp * q′ cj\n\u0012\nh\ni\u0013\no\nh\ni\nn\n†\n†\n′\n′\n2\n,\n× |wp | δj,1−3 1 + (Π1 ↔ Π2 , q ↔ q ) + δj,4−9 + wp wp+Q0 δj,10−12 1 + (Π1 ↔ Π2 , q ↔ q ) ∆(s1 ) ∆∗ (s2 ) si(45)\n→r\n\nwhere ej = aj + bj and the coefficients pj , aj , bj , cj , and dj are shown in table III. Then, we obtain\n(2,2)\n\n−\n\nb∆,m (r)\n4πCGL\n\n(2,2)\n\nb̂K⊥ ,vp (ρj ; q, q′ )\n\n=−\n\nX (2)\n′\n8π rH |∆|2 X\n∗ ′\nm(q)\nm\n(q\n)\nTK⊥ eiK⊥ *(X,Y ) ei(q−q )*r\n7ζ(3) ξ0 Tc4\n′\n\n×\n=\n\ncos\n\n×\n\nK⊥ 6=0\n\nq,q\n\n4 Z\nY\ni=1\n\n0\n\n∞\n\ndρi\n\n12\nX\nj=1\n\nE\n\u0011D\n|η|2\n2\n(2,2)\npj cos δIC (cj + dj ) |wp |2 b̂K⊥ ,vp (ρj ; q, q′ ) e− 2 (aj +bj )\n\u0010\n\n\u0010 (η * K r )\nvp * q′\nvp * q \u0011\n⊥ H\n√\n(aj − bj ) +\ncj +\ndj\nTc\nTc\n2\n\u0014\n4\n\u0011\n\u0010 (η × K r )\nX\n\u0001 (vp × K̃′ rH )Ẑ\n⊥ H z\n√\nρi , e j\n(aj + bj )\nfcos\nsinh\n2\nvF |K̃′ rH |2\ni=1\n4\n\u0010 (η × K r )\n\u0011\u0015\nX\n\u0001\nI rH\n⊥ H z\n√\nρi , ej cosh\n(aj + bj ) ,\nfsin\n+\nπ ξ0\n2\ni=1\n\nFS\n\n,\n\n(46)\n\nwhere the relation wp+Q0 = wp is used and K̃′ is defined by K̃′ = (Kx + qx − qx′ , Ky + qy − qy′ , 0) for Ẑ k ẑ and\nK̃′ = (γ −1/2 Ky + qx − qx′ , 0, γ 1/2 Kx + qz − qz′ ) for Ẑ k ŷ.\nIn this paper, we use the following form of the reciprocal lattice vector:\nK⊥ rH = m1 (π/k, 0) + m2 (0, k)\nwith integers m1 and m2 . Then, the summation for K⊥ is replaced with\nEq. (42) are concretely given as follows:\n(2)\n\n(4)\n\nm1 ,m2 ,\n\n(2)\n\n\u0010π\n\n(4)\n\nand TK⊥ in Eq. (37) and TK⊥ in\n\n\u0011i\n\u0011\nh 1 \u0010 (m π)2\n1\n2\n,\n+\n(m\nk)\nm2 (m1 + m2 ) exp −\n2\n2\n4\nk2\n\u0010\nh\n\u0011i\ni\nh\nπ\n1 (m1 π)2\n2\n= δm1 +m2 ,even exp − i m2 (m1 + m2 ) exp −\n.\n+\n(m\nk)\n2\n4\n8\nk2\n\nTK⊥ = δm1 +m2 ,even cos\nTK⊥\n\nP\n\n(47)\n\n(48)\n\n\f12\np √\nSince the triangular lattice k = π 3 is assumed, there are six (m1 , m2 ) combinations with the shortest |K⊥ | 6= 0,\n±(1, 1), ±(1, −1), and ±(2, 0), so that the equality |F±1,1 | = |F1,±1 | = |F±2,0 | is satisfied in an isotropic system.\nHowever, in the present system, an asymmetry occurs in the six |Fm1 ,m2 | components because of the anisotropy\noriginating from the d-wave pairing symmetry or the layered crystal structure. As a result, the equality |F±2,0 | =\n|F1,±1 | is not satisfied any longer, while the equality |F±1,1 | = |F1,±1 | is still satisfied. Since the four (m1 , m2 ) points\nwith the same |Fm1 ,m2 | value, ±(1, 1) and ±(1, −1), correspond to the spots with the strongest neutron scattering\nintensity in the experiments, we will calculate |F1,1 | which is given by\nZ h\ni\nh\ni\n1\n(2,2)\n(4)\n(2)\nF1,1 =\n(r)\nexp\n−\ni\n(π/k,\nk)\n*\n(X,\nY\n)\n.\n(49)\n(r)\n+\nb\nb∆ (r) + b∆ (r) + b(0,2)\nm\n∆,m\nV r\n(l)\n\n(l,m)\n\nThe form factor |F1,1 | is easily obtained by using Eqs. (37), (42), (44), and (46) since b∆ and b∆,m in these equations\nare already expanded with the reciprocal lattice vector K⊥ . In the results of our calculation below, |F1,1 | is normalized\nby 4πCGL .\nIn the present theory, the layered crystal structure is reflected in the anisotropy of the Fermi velocity vector vp .\nAlthough the expression of vp should be derived from the realistic dispersion, for brevity we use the following simplified\nform of vp :\n\u0002\n\u0001\u00031/2\n(x̂ cos φ + ŷ sin φ) + Jd sin(pz d)ẑ,\nvp = vF 1 − (J/EF ) 1 − cos(pz d)\n\n(50)\n\nwhere J is an interlayer coupling constant. The Fermi velocity vector introduced here corresponds to that of the\ncorrugated\ncylindrical Fermi surface. Then, the anisotropy of the SC coherence length γ can be expressed as γ =\np\n2 1 − J/EF /(πJ/EF ) and the angle average on the Fermi surface is defined by\nA\n\nFS\n\n=\n\nZ\n\n0\n\n2π\n\ndφ\n2π\n\nZ\n\nπ\n\n−π\n\nd (pz d)\nA.\n2π\n\n(51)\n\nIn the numerical calculation below, J/EF = 0.2 and pF d = π are used, and then, γ = 2.85 is obtained.\nIn the numerical calculation, the magnetic field H is normalized by the orbital limiting field in the pure two\n(orb)\ndimensional system H2D (0) = 0.28/(|e|ξ02 ). Then, the two field-dependent energy scales μB gH and vF /(2π rH )\nwhich correspond to the paramagnetic pair-breaking effect and the orbital one, respectively are expressed as follows:\n(orb)\n\n(orb)\n\n(0)\n(0)\nH\nμB gH\nπ H\n= h αM,j γE 2D\n= 0.882 αM,j 2D\nh,\n(orb)\n(orb)\nTc\n2e H\n(0)\n(0)\nHj\nj\n√\n√\n√\nvF\nξ0\n(orb)\n(52)\n=\n= ξ0 2|e|H2D (0) h = 0.748 h,\nrH\n2π rH Tc\n√\n(orb)\nwhere the Maki parameter αM,j = 2 Hj\n(0)/Hp (0) measures the strength of the paramagnetic pair-breaking effect\n√\n(orb)\nand h = H/H2D (0) is the normalized magnetic field. Here, Hp (0) = πTc /( 2eγE μB g) ≃ 1.2 Tc/μB g is the Pauli\n(orb)\n(0) is the orbital limiting field at T = 0\nlimiting field at T = 0, where γE = 0.577 is the Euler constant, while Hj\nI=\n\n(orb)\n\nfor fields parallel to the j direction. For the parameters used in our calculation, Hc\n(orb)\n(orb)\nHab (0) = 4.871 H2D (0) are obtained.\nIII.\n\n(orb)\n\n(0) = 1.266 H2D (0) and\n\nANTIFERROMAGNETIC FLUCTUATION IN H k c\n\nIn this section, we consider effects of the PPB-induced AFM fluctuation on VLFF in H k c case and discuss the\norigin of the anomalous field dependence of VLFF observed in CeCoIn5 [13, 14]. Throughout this section, αM,c = 5.8\nis used in obtaining main results. The temperature-field phase diagram obtained by minimizing FGL (∆, m = 0) is\nshown in the inset in Fig. 5, where the Hc2 transition at low temperatures is of first order, and a possible FFLO\nvortex lattice state appearing just below the Hc2 (T ) curve as a narrow HFLT region [16, 17] is neglected because it\ndoes not affect the SC properties in the field range of our interest. In fact, we will demonstrate later in Sec. IV C\nthat, even if the FFLO vortex lattice is taken into account, VLFF in H k c case will be hardly affected by a FFLO\nspatial structure. Below, we will show results of our calculation in two cases, m ⊥ H and m k H, since the direction\nof m relative to the external magnetic field H has not been confirmed in H k c case.\n\n\f13\n1\n\n|F1,1|\n\n2\n\n-3\n\n1\u009810\n\n1\n\n0.006\n\n0.8\n\n-6\n\n1\u009810\n\n0.004\n\n0.6\n0.4\n\n0.002\n\n0.2\n0\n\n0.5\n\n0.6\n\n-9\n\n1\u009810\n\n0.5\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n0\n\nH/Hc2,c(0)\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nH/H c2,c (0)\nFIG. 3: (Color online) Logarithmic plots of VLFF |F1,1 |2 at t = 0.1 as a function of magnetic field scaled by the upper critical\nfield at T = 0 Hc2,c (0) for various values of Maki parameter αM,c . Here, |F1,1 |2 is normalized by (4πCGL )2 . Dotted, dashed,\nand solid curves correspond to the cases with αM,c = 0.01, αM,c = 3.5, and αM,c = 5.8, respectively. The form factor |F1,1 |2 is\nenhanced by strong PPB at high fields, and as a result, the slope changes its sign from negative to positive. The inset shows\nthe regular plot of the |F1,1 |2 curves shown in the main panel, where the results for αM,c = 0.01 (dotted curve) and αM,c = 5.8\n(solid one) are measured by the left and right vertical axes, respectively.\n\nA.\n\nParamagnetic pair-breaking effect on VLFF\n\nFirst, PPB effects on VLFF in the case without AFM fluctuation will be discussed. Figure 3 shows the field\ndependences of VLFF at t = 0.1 for αM,c = 0.01 (dotted curve), αM,c = 3.5 (dashed one), and αM,c = 5.8 (solid\none). As one can see in Fig. 3, VLFF is enhanced especially at high fields by the PPB effect. For the sufficiently\nlarge αM,c , VLFF increases with increasing field while it decreases in the case with the small αM,c . The inset in Fig.\n3 shows the regular plots of VLFF as a function of magnetic field scaled by Hc2,c (0) in the two cases, αM,c = 0.01\nand αM,c = 5.8. The difference in the field dependence of VLFF can be clearly seen. To see that VLFF measures\n(2)\n(4)\nspatial distributions of the internal magnetic field, the longitudinal internal magnetic fields b∆ (r) + b∆ (r) in the\ncases with αM,c = 0.01 and αM,c = 3.5 are shown in Fig. 4 (b) and (c), respectively. In the SC vortex lattice state\nshown in Fig. 4 (a), the internal field in the direction along the applied magnetic field is induced at the vortex core\n(4)\n(2)\nas a result of the magnetic screening outside the vortex core. The anisotropic structure of b∆ (r) + b∆ (r) around\nthe vortex core is due to the mismatch between the four-fold d-wave pairing symmetry and the six-fold triangular\nlattice symmetry. Comparing (b) with (c), one can see that, due to the PPB effect, the magnetic flux is concentrated\ninside the vortex core as a result of the enhanced magnetic screening outside the vortex core. The enhancement of\nVLFF shown in Fig. 3 is understood as a consequence of the concentration of the magnetic flux inside the vortex\ncore, or equivalently, the enhanced magnetic screening outside the vortex core [15]. The increasing behavior in the\nfield dependence of VLFF due to strong PPB has been already argued by Ichioka and Machida who discussed this\nissue quantitatively by using the quasi-classical approximation where the SC gap and both of the two pair-breaking\neffects are fully taken into account [15]. The qualitative consistency of our result with their result indicates that the\nperturbative expansion with respect to |∆| used here is valid in the discussion on VLFF.\nB.\n\nAFM fluctuation induced inside the SC phase\n\nNext, we will show that PPB enhanced sufficiently by increasing the external magnetic field induces AFM fluctuation\ninside the d-wave SC state. Since this novel PPB effect has been already studied thoroughly elsewhere [30] in both\nm ⊥ H and m k H, in this subsection, we will only give a brief review of this PPB effect with an example of our\nresult in the case with m ⊥ H.\n(2,2)\nFigure 5 shows the field dependence of the SC-AFM coupling term F∆0 ,m for δIC = 0.005 in m ⊥ H. Since Eq. (12)\n(2,2)\n\ndetermines the AFM instability, negative values of F∆0 ,m indicate that an AFM ordering or an enhancement of AFM\n(2,2)\n\nfluctuation tends to occur in the SC state. Noting the physical implication of F∆0 ,m , one can see that, due to PPB\nenhanced by decreasing temperature and increasing field, AFM fluctuation is induced in sufficiently low-temperature\nand high-field region, while, in higher-temperature and lower-field region, the AFM fluctuation is suppressed by the\nSC order. The field hCP at which the AFM fluctuation is strongest is fixed at the Hc2 transition. The jump seen at\n\n\f14\n\nFIG. 4: (Color online) Spatial structures of the SC gap |∆(r̃)|2 (a) and the longitudinal internal magnetic fields normalized\n(2)\n(4)\nby 4πCGL , b∆ (r̃) + b∆ (r̃), for weak PPB (αM,c = 0.01) (b) and slightly strong PPB (αM,c = 3.5) (c) at t = 0.1 and\nH/Hc2,c (0) = 0.96 in the case with no AFM fluctuation. r̃ denotes the dimensionlesss coordinate defined by r̃ = r/rH . Due to\nthe PPB effect, the magnetic flux is concentrated inside the vortex core as a result of the enhanced magnetic screening outside\nit, which is reflected in the enhancement of VLFF shown in Fig. 3. The anisotropy of the internal field around the vortex core\nis brought by the mismatch between the d-wave pairing symmetry and the triangular lattice one\n\n0.3\n\nh\n\n0.25\n\n0.22\n\n(2,2)\n\nFΔ 0, m /m 2\n\n0.2\n\n0.14\n0\n\n0.15\n\n0.1\n\nt\n\n0.2\n\n0.3\n\n0.1\n0.05\n0\n-0.05\n-0.1\n\n0.26\n\n0.27\n\n0.28\n\n0.29\n\n0.3\n\nh\n(2,2)\n\nFIG. 5: (Color online) Field dependences of the SC-AFM coupling term in the free energy F∆0 ,m in H k c case with m ⊥ H at\nt = 0.02 [lower (red) curve], t = 0.06 [middle (blue) one], and t = 0.1 [upper (green) one]. In obtaining the result, αM,c = 5.8\nand δIC = 0.005 are used. The Hc2 (T ) curve obtained is shown in the inset, where an arrow denotes the point at which the Hc2\ntransition changes its nature from the second order to the first one and the FFLO vortex lattice is neglected here. To make it\neasy to grasp which region in the phase diagram is considered, the temperatures t = 0.02, t = 0.06, and t = 0.1 are indicated\nby the left (red) vertical line, the center (blue) one, and the right (green) one, respectively in the inset. PPB enhanced strongly\n(2,2)\nby increasing field and decreasing temperature induces AFM fluctuation inside the SC state. The large energy gain in F∆0 ,m\njust below the Hc2 transition at the low temperature indicates that the AFM fluctuation gets stronger toward Hc2 (0).\n\nthe Hc2 transition is due to the finite SC energy gap |∆| originating from the first order nature of the Hc2 transition.\nThese results suggest that the PPB-induced AFM fluctuation gets stronger toward Hc2 (0) inside the d-wave SC state\nwith finite |∆| and that the strong AFM fluctuation with hCP located just below the Hc2 transition at the extremely\nlow temperature causes the quantum critical phenomena around Hc2 (0). It should be emphasized that the result\nobtained here is not accidental to the GL expansion but intrinsic to the present system. This novel effect of strong\nPPB has been theoretically confirmed in the Pauli limit case where |∆| is fully taken into account [30]. We note\nthat, in m k H, the AFM fluctuation is also induced inside the SC phase by the PPB effect (see Fig. 4 and Fig.\n9 in Ref. [30]). As a typical example of physical phenomena caused by the PPB-induced AFM fluctuation in the\nSC vortex state, we will discuss effects of the PPB-induced AFM quantum critical fluctuation on VLFF, bearing the\nexperimental data on CeCoIn5 in our mind.\nC.\n\nEffects of AFM fluctuation on VLFF\n\nBelow, we will examine effects of the AFM fluctuation on VLFF. Feynman diagrams for the internal field brought\n(0,2)\nby the AFM fluctuation are shown in Fig. 6 where a wavy line denotes the AFM fluctuation and bm has been\n\n\f15\n\nFIG. 6: Feynman diagrams for the contribution from the AFM fluctuation to the internal magnetic field. The diagrams (a),\n(b), and (c) are obtained by connecting two wavy lines in the diagrams (d), (e), and (f) in Fig. 2, respectively. A wavy line\nrepresents the AFM fluctuation.\n\ndropped since it only gives a spatially uniform contribution to the magnetic flux. Then, the spatially varying internal\n(2,2)\n(4)\n(2)\nmagnetic field is written as b∆ (r) + b∆ (r) + bfluc (r), where\n4 Z\n12\n(2,2)\nD\nE\nX\n|η|2\nbfluc (r)\n8π rH |∆|2 X h|m(q)|2 i X (2) iK⊥ *r⊥ Y ∞\n2 (2,2)\n− 2 (aj +bj )2\np\n=\n|w\n|\nb̂\n(ρ\n;\nq,\nq)\ne\nT\ne\ndρ\n.\nj\np\nj\ni\nK⊥ ,vp\nK⊥\n4πCGL\n7ζ(3) ξ0 Tc2 q\nTc2\nFS\ni=1 0\nj=1\nK⊥ 6=0\n\n(53)\nHere, the commensurate AFM fluctuation (δIC = 0) is assumed for brevity. The properties of the AFM fluctua2\ntion are specified by the AFM\nP correlation function h|m(q)| i which is introduced phenomenologically through the\n2\napproximation h|m(q)| i ≃ T ωn χ(q, iωn ) with the familiar form of the susceptibility [38–41]\nχ(q, i ωn ) =\n\n−2\nξ 2 (h, t) ξN\n1\n2 ),\nN (0) 1 + ξ 2 (h, t)|q × ẑ|2 + |ωn |/(Γ0 ξ −2 (h, t) ξN\n\n(54)\n\nwhere ξN and Γ0 are a length scale and an energy scale characteristic of the AFM fluctuation, respectively, ξ(h, t) is\nthe correlation length which diverges at an AFM instability, and the two dimensional fluctuation is assumed in Eq.\n(54) based on the experimental data [37]. Since, as we discussed in the previous subsection, the AFM fluctuation\nstrongly enhanced at hCP gets stronger with decreasing temperature, we assume that the AFM instability is located\nat an extremely low temperature and the high field hCP . Then, the correlation length is considered to take the form\nξ(h, t) = ξN (t + |1 − h/hCP |)−1/2 [41, 42]. We note that the condition ξ(h, t)−2 = 0 corresponds to Eq. (12) which\ndetermines the instability of the PPB-induced AFM order. Since χ(q, i ωn ) has a dominant contribution at q = 0, we\n(2,2)\n(2,2)\nwill calculate the right-hand side of Eq. (53) by using the evaluation b̂K⊥ ,vp (ρj ; q, q) ≃ b̂K⊥ ,vp (ρj ; 0, 0). Then, the\npart relevant to the summation for q in Eq. (53) is calculated as\nZ εc\n\u0010 ω \u0011 Z ∞ d(q 2 )\nX\nqc\n2\nh|m(q)| i ≃\nIm χR (q, ω)\ndω coth\n2\n(2π)\n2T\n4π\n−ε\n0\nc\nq\nZ 1\n\u0010 ε ξ 2 (h, t) \u0011\n\u0010ε \u0011\nqc εc\n1\nc\nc\n−1\nx\ntan\nx ,\n(55)\ndx\ncoth\n=\n2 (2π)3\n2\nN (0) ξN\n2T\nΓ0 ξN\n0\nR\nR\nR\nP\n1\ndqz dφ qdq is used. In the numerical\nwhere χR is the retarded susceptibility and the replacement q → (2π)\n3\n2\n2\ncalculation below, εc = 2TP\nc , Γ0 = EF , N (0) = pF /(2π vF ), qc = pF are used. We believe that the approximation\n2\nused here, h|m(q)| i ≃ T ωn χ(q, iωn ), which corresponds to setting ωn ≃ 0 in the quasiparticle Green's function\nwith an ωn -dependence, properly gives the AFM contribution since χ(q, i ωn ) has a dominant contribution at ωn = 0.\nOn the other hand, it is known that the ωn -dependence in the Green's function produces the imaginary part of the\nself energy of a quasiparticle described by the Feynman diagram (a) in Fig. 6. Since the imaginary part of the self\nenergy, namely, the quasiparticle damping suppresses the PPB effect [23], it cannot be neglected in examining any\nPPB effect. By carrying out the diagrammatic calculation, we can evaluate the imaginary part of the self energy near\nthe Fermi surface as follows:\n\nIm ΣR\nσ (kF , 0) ≃\n\nh ξ(h, t) \u0010 ∆ε \u0011i2 \u0011−1/2\nπ 2 T ξ(t, h) \u0010\n1\n+\n2\n4 pF ξN\n2πξ0 Tc\n\n(56)\n\nwith ∆ε = −Tc δIC + (σ + σ) ITc (for details, see Appendix III). In the expression (56), a familiar form of the\nquasiparticle damping caused by the AFM spin fluctuation near the hot spot [40] is extended so that it includes the\nZeeman energy shift. Noting that the direction of m relative to H is reflected in ∆ε, one can see in Eq. (56) that the\n\n\f16\n1.8\n(a)\n1.4\n2\n\n|F1,1 | 1.0\n0.6\n0.2\n2.0\n\n(b)\n\n1.4\n\n|F1,1 |\n\n2\n\n0.8\n\n0.2\n\n0.16\n\n0.2\n\n0.24\n\n0.28\n\nh\nFIG. 7: (Color online) The |F1,1 (h)|2 curves obtained numerically in H k c case with m ⊥ H (a) and with m k H (b), where\nsolid (dotted) curves correspond to the case with (without) the additional internal magnetic field brought by the PPB-induced\nAFM fluctuation. The form factor |F1,1 |2 is normalized by (4πCGL )2 . Highest (red), middle (blue), and lowest (green) curves\nare the |F1,1 (h)|2 ones obtained at t = 0.02, t = 0.06, and t = 0.1 in the inset in Fig. 5, respectively. Regarding the parameters\nrelevant to the AFM fluctuation, ξN = 0.6ξ0 with ξ0 pF = 7.0 and δIC = 0 are used and hCP = 0.289 is assumed so that the\nlocation of the AFM instability field is below Hc2 (0). In the high-field and low-temperature region, VLFF is enhanced by the\nPPB-induced AFM critical fluctuation.\n\nquasiparticle damping is more effective in m ⊥ H than in m k H. In examining effects of the AFM fluctuation, we\ntake the quasiparticle damping into account with the substitution εn → εn + sgn(εn ) Im ΣR\nσ (kF , 0) which is equivalent\nto the replacement\n\u0002\n\u0003\nexp − 2 x Im ΣR\n1\nσ (kF , 0)\n\u0002\n\u0003 →\n(57)\nsinh[2πt x]\nsinh 2πt x\n\nin Eqs. (25). In the evaluation of the amplitude of the SC order parameter ∆0 , the replacement (57) is also used.\nFigure 7 shows the field dependences of VLFF |F1,1 |2 in H k c case with m ⊥ H (a) and m k H (b), where solid\nand dotted curves correspond to the cases with and without the internal magnetic field brought by the PPB-induced\nAFM fluctuation, respectively, at t = 0.02 [highest (red) curves], t = 0.06 [middle (blue) ones], and t = 0.1 [lowest\n(green) ones]. The AFM instability field hCP is assumed to be located below Hc2 (0) so that hCP is consistent with\nboth the experimental result suggestive of the AFM critical point below Hc2 (0) [3, 18, 19] and our theoretical result\nshown in Fig. 5. In both m ⊥ H and m k H, VLFF at the low temperature t = 0.02 is remarkably enhanced in\nthe high-field range by the PPB-induced AFM critical fluctuation, and as a result, the slope of the |F1,1 (h)|2 curve\nbecomes sharper. On the other hand, in m ⊥ H (Fig. 7 (a)), VLFF is rather suppressed by the PPB-induced\nAFM fluctuation at t = 0.06, while, in m k H (Fig. 7 (b)), the enhancement of VLFF due to the AFM fluctuation\ncan be seen at the same temperature. To understand the physical origin of the enhancement and the suppression\nof VLFF due to the PPB-induced AFM fluctuation, spatial distributions of the internal field brought by the AFM\n(2,2)\nfluctuation bfluc (r) in m k H and m ⊥ H at t = 0.06 and h = 0.25 are shown in Fig. 8 (b) and (c), respectively. For\n(4)\n(2)\ncomparison, the internal field without the AFM contribution b∆ (r) + b∆ (r) at the same temperature and field is\nalso shown in Fig. 8 (a). In Fig. 8, the contributions from the six Fourier components with the shortest |K⊥ |, ±(2, 0),\n±(1, 1), and ±(1, −1), are extracted from the full summation for K⊥ so that one can easily grasp the tendency of\n(2)\n(4)\nthe flux distribution. Although, as shown in the inset in (a), b∆ (r) + b∆ (r) with the full summation for K⊥ has\na short length scale structure due to relatively large higher Fourier components, the tendency of the distribution is\n\n\f17\n(a)\n(2)\n\n(2)\n\n~\n\n(4)\n\n~\n\n4\n\n~\n\nbΔ (r) +bΔ (r)\n\n(c)\n\n(b)\n\n8\n\n(4)\n\nbΔ+bΔ -80\n\ny\n\n(2,2) ~\n\n2\n0\n\n8\n4\n0\n-4\n\n-2\n\n0\n\nx~\n\n2\n\n4\n\n(2,2) ~\n\nb fluc (r)\n\nb fluc (r)\n\n0.5\n0.1\n-0.3\n\n0.3\n0\n-0.3\n\n5\n\n5\n\n4\n\n4\n\n~\n\ny\n\n5\n4\n\n3\n\n3\n\n~\n\n2\n1\n0\n-1 -2 -1\n\n0\n\n1\n\n2\n\n3\n\ny\n\n4\n\n3\n\n2\n1\n0\n-1 -2 -1\n\n~\n\nx\n\n0\n\n1\n\n2\n\n~\n\nx\n\n3\n\n4\n\n~\n\ny\n\n2\n1\n0\n-1-2 -1\n\n0\n\n1\n\n2\n\n3\n\n4\n\n~\n\nx\n\nFIG. 8: (Color online) Spatial distributions of the longitudinal internal magnetic field normalized by 4πCGL without the AFM\n(2)\n(4)\n(2,2)\n(2,2)\ncontribution b∆ (r̃) + b∆ (r̃) (a), the internal field brought by the AFM fluctuation bfluc (r̃) in m k H (b), and bfluc (r̃) in\nm ⊥ H (c) at t = 0.06 and h = 0.25 in the case with αM,c = 5.8, where dominant contributions coming from the Fourier\ncomponents ±(2, 0), ±(1, 1), and ±(−1, 1) are extracted from the full internal fields. The inset of (a) shows the full internal field\n(2)\n(4)\nb∆ + b∆ . Although higher Fourier components become relatively large at low temperatures and express the flux distribution\nat short length scales, the tendency of the distribution is well described by the six components listed above. Enhancement of\n(2)\n(4)\nthe magnetic flux in the vortex core region and its reduction outside the vortex core are commonly seen in both b∆ (r̃) + b∆ (r̃)\n(2,2)\n(2,2)\nand bfluc (r̃) in m k H, while, in bfluc (r̃) in m ⊥ H, the magnetic flux is enhanced outside the vortex core. The difference in\n(2,2)\nbfluc (r̃) in two cases, m k H and m ⊥ H, is reflected in VLFF shown in Fig. 7.\n\nwell described by the six components listed above. As one can see in Fig. 8, enhancement of the magnetic flux in the\n(2)\n(4)\n(2,2)\nvortex core region and its reduction outside the vortex core are commonly seen in both b∆ (r) + b∆ (r) and bfluc (r)\n(2,2)\nin m k H, while, in bfluc (r) in m ⊥ H, the magnetic flux is enhanced outside the vortex core, in other words, the\nmagnetic screening outside the vortex core is suppressed. This result suggests that the enhancement (suppression)\nof VLFF due to the AFM fluctuation corresponds to the promotion (reduction) of the magnetic screening outside\nthe vortex core. Further, comparing Fig. 7 (a) with Fig. 5, we can see that it depends on a sign of the SC-AFM\n(2,2)\n(2,2)\ncoupling term F∆0 ,m whether the AFM contribution bfluc (r) promotes the magnetic screening or prevents it. In the\n(2,2)\n\n(2,2)\n\nhigh-field and low-temperature region where F∆0 ,m is negative, bfluc (r) enhances VLFF, while, in lower-field and\n(2,2)\n\n(2,2)\n\nhigher-temperature region where F∆0 ,m is positive, bfluc (r) suppresses VLFF. Noting that, from the viewpoint of the\n(2,2)\n\nSC order, negative values of F∆0 ,m indicate that the stability of the SC order is enhanced by the AFM fluctuation,\nwe can understand the mechanism of the enhancement of VLFF due to the PPB-induced AFM fluctuation as follows:\nthe SC state becomes more stable due to the PPB-induced AFM fluctuation, then the SC magnetic screening is\npromoted, and as a result, VLFF is enhanced by the internal magnetic field originating from the promoted screening\ncurrent. The falling-down behavior toward the Hc2 transition in the |F1,1 (h)|2 curves is more remarkable in m ⊥ H\nthan in m k H, which is due to the fact that the amplitude of the SC energy gap is much suppressed by the stronger\nquasiparticle damping in m ⊥ H.\nThe increasing behavior in the field dependence of VLFF becomes remarkable due to the enhanced magnetic\nscreening caused by the PPB-induced AFM fluctuation. Further, the obtained field dependences of VLFF in lowering\ntemperature in both m ⊥ H and m k H, are consistent with the experimental data on CeCoIn5 [14]. Considering\nthese fact, we could conclude that the strong AFM fluctuation around Hc2 (0) observed in CeCoIn5 in H k c is the\nPPB-induced AFM fluctuation enhanced strongly by increasing field and decreasing temperature and that the abrupt\nincrease of VLFF at high fields is a consequence of the magnetic screening enhanced by the PPB-induced AFM critical\nfluctuation.\nConcerning the direction of the AFM moment vector m, we cannot rule out alternative possibilities of m ⊥ H or\nm k H by comparing our theoretical result with the experimental data. However, from the experimental data showing\nthat the configuration m k c is realized in H k ab [25, 26], it is inferred that m is locked along c-axis. Further, noting\nthat the AFM fluctuation in the normal state is suppressed by the Zeeman effect in m k H while it is not affected by\nthe Zeeman effect in m ⊥ H, the absence of the AFM order in the SC phase in H k c seems to be understood as a\nresult of the suppression of the AFM fluctuation with m k c in the normal state.\n\n\f18\nIV.\n\nANTIFERROMAGNETIC ORDER IN H k ab\n\nIn this section, we discuss a possible AFM order realized in vortex states in the d-wave superconductor with\nstrong PPB. Throughout this section, we assume that the AFM moment vector is perpendicular to the magnetic field\nm ⊥ H k ab, since the configuration m k c has been established in the AFM order observed in the HFLT phase of\nCeCoIn5 in H k ab case. In the parallel field, strong PPB induces the longitudinal FFLO vortex lattice state in the\nHFLT corner in the phase diagram [35] and the FFLO region is large so that it may not be ignored. Although the\nFFLO state is not taken into account in the analysis on the PPB-induced AFM order in the SC vortex lattice, we\nwill discuss effects of FFLO spatial structures on the AFM order and also on VLFF later.\nA.\n\nModulated antiferromagnetic order in the SC vortex lattice\n\nBelow, we consider the situation where the PPB-induced AFM fluctuation becomes so strong that an AFM order\n(2)\n(2,2) \u0001\nappears inside the SC state, i.e., Fm + F∆0 ,m /m2 < 0. Because the SC gap function has the vortex-lattice\nmodulation, an AFM order with a spatial modulation synchronized with the vortex lattice is expected to appear\ninstead of the spatially uniform AFM order. Possible modulated AFM orders are classified into two types: the AFM\norder localized in the normal-state region, namely, in vortex cores and the one coexistent with the SC order. Since\nwe consider the spatial distribution of the PPB-induced AFM order in the presence of a potential brought by the SC\n(2,2)\nvortex lattice through the SC-AFM coupling term F∆,m , it is natural to assume that m(r) takes the following form:\n\u0012\nh\ni\u0013\nX\nm\n′ (2)\nm(X, Y ) = q\n1+ w\nTK⊥ exp iK⊥ * (X, Y ) ,\n(58)\nP′\n(2) 2\nK⊥ 6=0\n1 + w2\nK⊥ 6=0 |TK⊥ |\n\nor equivalently,\n\nm(q) = q\n1 + w2\n\nm\nP′\n\n(2) 2\nK⊥ 6=0 |TK⊥ |\n\n\u0013\n\u0012\n(2)\nδq,0 + w TK⊥ δq,K̃⊥ 6=0 ,\n\n(59)\n\nP′\n(2)\n(2,2)\nwhere w is a variational parameter to be determined by minimizing (Fm + F∆0 ,m )/m2 , and K⊥ 6=0 denotes the\nK⊥ -summation only for the lowest Fourier components, (m1 , m2 ) = ±(1, 1), ±(1, −1), and ±(2, 0). We believe that\nthe restricted summation for K⊥ gives correct results because the contribution from higher Fourier components will\nbe negligibly small and will not affect the results. It should be noted that negative (positive) values of w indicate the\nAFM order enhanced (suppressed) in the vortex core.\nIn obtaining spatial structures of AFM orders, we assume that the magnetic flux is uniform. Since, in general,\nan inhomogeneous internal field is induced by a spatially modulated AFM order, the induced inhomogeneous field\nmay affect the spatial structure of the AFM order. In this study, however, we neglect the internal field brought by\n(0,2)\nthe AFM order for the following two reasons: First, the leading order AFM contribution bm (r) vanishes because\nof the configuration m ⊥ H and does not affect the magnetic flux at all. Second, the internal field brought by the\n(2,2)\nAFM order thorough the SC-AFM coupling b∆,m (r) is considered to be negligibly small since, as we will see later,\nthe transition to the AFM order occurs at a relatively high field so that the amplitude of the AFM order parameter\nwill not grow up to a large value with increasing field.\nFigure 9 shows an example of the temperature-field phase diagram of the PPB-induced AFM order inside the d-wave\nSC vortex lattice state in H k ab, where a thin (red) solid curve and a dashed (red) one denote the transition curve to\nthe AFM order with a vortex-lattice modulation and the one to the spatially uniform AFM order, respectively, and\nboth of them are second order transition curves. As one can see in the main panel of Fig. 9, the stability region of\nthe PPB-induced AFM order is expanded by the modulation synchronized with the vortex lattice, and an example\nof the spatial structure of the modulated AFM order is shown in the inset of Fig. 9. As we will discuss later, the\nPPB-induced AFM order is not localized in the vortex core but coexistent with the SC order. Figures 10 (a) and (b)\n(2)\n(2,2)\nshow the field dependence of Fm + F∆0 ,m and that of the variational parameter w at t = 0.03 in Fig. 9, respectively.\nFor comparison, results in the case with αM,ab = 0.01 are shown in the figures as dotted (green) curves. Figure 10\nsuggests two important results. First, the AFM order with the vortex-lattice modulation becomes more stable in the\nvortex state than the uniform one. Second, as clearly seen in Fig. 10 (a), in the case with αM,ab = 7.5, the AFM\norder appearing inside the SC state lowers the free energy, while, in the case with αM,ab = 0.01, it never lowers the\nfree energy. In the case with weak PPB, the conventional competitive nature between SC and AFM orders is reflected\nin the free energy cost and negative values of w, which suggests that, in systems with a sufficiently large TN /Tc in\n\n\f19\n\n0.85\n0.75\n\nh\n\n1.2\n\n~ 2\n|Δ(x)|\u0002/Δ2\n\n0.8\n\n0.65\n\nvortex core\n\n~ 2 2\n0.4 |m(x)| / m\n\n0.55\n\n0\n0.5\n\n0.03\n\n0.04\n\n1.5\n\n1\n\n2\n\n~\nx\n\n0.05\n\nt\n\n2.5\n\n3\n\n3.5\n\n0.06\n\n(2)\n\n(2,2)\n\n(Fm + FΔ0 , m )/m2\n\nFIG. 9: (Color online) Example of the numerically obtained temperature-field phase diagram of the PPB-induced AFM order\ninside the d-wave SC vortex lattice state in H k ab case, where a thick (black) solid curve and a thin (red) solid one denote the\nfirst order Hc2 transition and the second order transition to the AFM order with a spatial modulation commensurate with the\nvortex lattice structure, respectively. For comparison, the onset of the spatially uniform AFM order in the SC vortex lattice\nis also shown as a dashed (red) curve. The parameters used in obtaining the phase diagram are αM,ab = 7.5, δIC = 0.001,\nand TN /Tc = 0.027. The PPB-induced AFM order becomes more stable in the vortex state with the spatial modulation\ncommensurate with the vortex-lattice structure. The inset shows the spatial profiles of the SC gap |∆(x̃)|2 (dashed curve)\nand the modulated AFM order |m(x̃)|2 [solid (red) one] along the trajectory x̃ between neighboring vortex centers. The PPBinduced AFM order realized in the d-wave SC vortex state is not localized in the vortex core but coexistent with the SC order.\n\n0.6\n0.4\n\n(a)\n\n0.2\n0\n-0.2\n-0.4\n\n0.6 (b)\n0.4\n0.2\nw\n0\n-0.2\n-0.4\n-0.6\n0.4 0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\nH/Hc2,ab(0)\n(2)\n\n(2,2)\n\nFIG. 10: (Color online) Field dependences of Fm + F∆0 ,m (a) and the variational parameter w (b) at t = 0.03 in Fig. 9. For\ncomparison, results in the case with αM,ab = 0.01 are also shown in the figures as dotted (green) curves. In (a), one can see\nthat the occurrence of the AFM order in the high-field SC phase lowers the free energy in the case with strong PPB, while, in\nthe case with weak PPB, it never lowers the free energy. Further, as shown in (b), the optimized value of w is positive in the\ncase with strong PPB, suggesting the AFM order coexistent with the SC order, while, in the case with weak PPB, the familiar\ncompetition between the two orders is indicated by negative values of w.\n\nzero field, the AFM order localized in the vortex cores, i.e., in the normal-state region where |∆| = 0 can appear\n[43, 44] as shown in Fig. 11 (c). In contrast, as denoted by a solid curve in Fig. 10 (b), optimized values of the\nvariational parameter in the case with strong PPB are positive, indicating the AFM order coexistent with the SC\norder. An example of the spatial distribution of this PPB-induced AFM order is shown in Fig. 11 (b), where the\nspatial structure of the vortex lattice is shown in Fig. 11 (a). The AFM order is suppressed in the vortex core and\nenhanced in the region with large |∆|. The profiles of the SC gap |∆(x)|2 and the PPB-induced AFM order |m(x)|2\nalong the trajectory x between neighboring vortex centers are shown in the inset of Fig. 9.\nAlthough we have used a small value for δIC in the above numerical calculation, the PPB-induced AFM order\n\n\f20\n(a)\n\n(b)\n\n~ 2\n\n(c)\n\n~ 2\n\n~ 2\n\n|m(r)| / m 2\n\n2\n\n|Δ(r)|\u0002/Δ\n\n|m(r)| / m 2\n\n1.8\n1.2\n0.6\n0\n\n1.6\n0.8\n0\n5\n\n1.35\n1.1\n0.85\n\n5\n\n4\n\n4\n\n3\n\n~\n\n4\n\n4\n\n3\n2\n\nx\n\n2\n1\n\n1\n\n0\n\n0\n-1 -2\n\n-1\n\n~\n\nx\n\n~\n\nz\n\n3\n\n3\n\n2\n2\n\n1\n\n1\n\n0\n0\n\n-1 -2\n\n-1\n\n4\n3\n\n5\n4\n\nz~\n\n2\n\n3\n\n~\n\nx\n\n1\n\n2\n\n0\n\n1\n0\n\n-1\n\nz~\n\n-1 -2\n\nFIG. 11: (Color online) Spatial structures of the SC gap |∆(r̃)|2 (a) and the modulated AFM order |m(r̃)|2 in the cases with\nαM,ab = 7.5 (b) and αM,ab = 0.01 (c) at t = 0.03 and H/Hc2,ab (0) = 0.75 in Fig. 10. The coordinates x̃ and z̃ are dimensionless\nand defined as x̃ = γ −1/2 x/rH and z̃ = γ 1/2 z/rH , respectively. The figures (b) and (c) correspond to w = 0.63 and w = −0.15,\nrespectively. In the case with strong PPB, the AFM order coexists with the SC order while, in the case with weak PPB, the\nAFM order competes with the SC order and is localized in the vortex cores.\n\nbecomes much stable in the SC phase as |δIC | is increased [8]. On the other hand, the incommensurate wave vector\nobserved in the AFM order appearing inside the HFLT phase of CeCoIn5 [25, 26] seems to originate from the deviation\nfrom the perfect nesting condition of the Fermi surface [30], which suggests that the deviation |δIC | is large enough\nand the momentum dependence in |δIC | should be taken into account in the detailed discussion on the AFM order in\nthe HFLT SC phase.\nOur result obtained here for the PPB-induced AFM order in the SC vortex lattice is consistent with recent NMR\ndata suggesting that the AFM order in the HFLT phase of CeCoIn5 is spatially extended without being localized in\nthe normal-state region [29]. Although the longitudinal FFLO vortex lattice state is ignored in the above calculation,\nthe theoretical study taking account of the longitudinal FFLO modulation along H without in-plane vortex-lattice\nstructures included shows that, at least in the high-field side of the FFLO state, the AFM order is not localized in\nthe FFLO nodal planes on which |∆| = 0, but coexistent with the SC order [30]. These results obtained in the two\napproaches, which are complementary to each other, suggest that the PPB-induced AFM order coexistent with the\nSC order may be stabilized at least in the high-field side of the longitudinal FFLO vortex lattice state.\nB.\n\nVLFF in the modulated AFM order\n\nWe will briefly discuss effects of the PPB-induced AFM order on VLFF. A red solid (dashed) curve in Fig. 12\ndenotes the field dependence of VLFF at t = 0.03 in Fig. 9 in the presence (absence) of the PPB-induced AFM\norder modulating with the vortex lattice. Here, the variational parameter w in Eq.(58) is determined by minimizing\nFGL (∆0 , m) − FGL (∆0 , 0), while the amplitude of the AFM order parameter |m| is obtained by using Eq. (13). The\nform factor is enhanced by the PPB-induced AFM order as a result of the additional magnetic screening brought\nby the occurrence of the PPB-induced AFM order, like in the case only with the PPB-induced AFM fluctuation\nexamined in Sec. III. However, the enhancement of VLFF brought by the AFM order is quite small compared with\nthat brought by the AFM critical fluctuation. We expect an additional AFM fluctuation around the nonvanishing\nAFM order parameter, which has not been taken into account in obtaining Fig. 12, to further enhance VLFF.\nC.\n\nInternal magnetic field in the longitudinal FFLO vortex lattice state\n\nSo far, we have not examined effects of the longitudinal FFLO structure of the SC order parameter on the internal\nfield and VLFF which should be seen in the HFLT corner in the phase diagram [35]. Below, we examine the flux\ndistribution in the longitudinal FFLO vortex lattice although, in turn, an AFM order will be neglected for brevity in\ncontrast to the case of Fig.12.\nIn the longitudinal FFLO vortex lattice state, the SC gap function is expressed in the form\n√\n\u0001\n∆(r) = ∆φ0 (X, Y ) 2 cos Q Z\n(60)\n\nwith the modulation wave vector QẐ parallel to the magnetic field. This FFLO modulation\nin\norder parameter\n\u0002\n\u0003 the SC √\n\u0002\naffects the internal field through the operator acting on the SC gap function exp iAvp * Π ∆(r) = 2∆ exp iAvp *\n\n\f21\n0.7\n0.6\n\n|F1,1|2\n0.5\n0.4\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nh\nFIG. 12: (Color online) Field dependence of VLFF |F1,1 |2 at t = 0.03 in Fig. 9 obtained in the mean-field approximation,\nwhere |F1,1 |2 is normalized by (4πCGL )2 . A red solid (dashed) curve corresponds to the result in the presence (absence) of\nthe PPB-induced AFM order with the vortex-lattice modulation. Although VLFF is enhanced by the occurrence of the AFM\norder, the enhancement is not so remarkable compared with that brought by the PPB-induced AFM fluctuation. The |F1,1 (h)|2\ncurves including the longitudinal FFLO spatial variation of the SC order parameter ignored here are shown in Fig. 13.\n\n\u0003\n\u0002\n\u0001\n\u0003\n\u0001\n(2)\nΠ⊥ φ0 (X, Y ) exp iA vp * Ẑ (−i ∇Z ) cos Q Z , and then, the Maxwell equation −∇ × b∆ (r)/(4πCGL ) = ∇ ×\n\u0001\u0003\n\u0001\n\u0002 (+)\nP\n(−)\ni K⊥ *(X,Y )\nẐ is obtained. It can be shown that the Maxwell equation has\nK⊥ 6=0 mK⊥ ,Q + mK⊥ ,Q cos 2 Q Z e\n(2)\n\na solution with a transverse component in b∆ (r) [36]. The resulting O(|∆|2 ) contribution to the internal field is\nexpressed in the form\n\n(−)\n(−)\n(2)\nX 2 i Q K̃⊥ mK\nX h (+)\n|K̃⊥ |2 mK⊥ ,Q\n\u0001i\n\u0001\n−b∆ (r)\n⊥ ,Q\n= Ẑ\ncos 2 Q Z ei K⊥ *(X,Y ) −\nsin 2 Q Z ei K⊥ *(X,Y ) ,\nmK⊥ ,Q +\n2\n2\n2\n2\n4πCGL\n|K̃⊥ | + (2Q)\n|K̃⊥ | + (2Q)\nK⊥ 6=0\nK⊥ 6=0\n(61)\nwhere\nZ\nD\n\u0001\n\u0001E\n|η|2\n8π rH |∆|2 ∞\n(2)\n(±)\n− 2 (ρ1 +ρ2 )2\n2 (2)\ncos\nQ\nv\n*\nẐ\n(ρ\n±\nρ\n)\n.\n(62)\n(ρ\n)\ne\nb̂\n|w\n|\ndρ\ndρ\nT\nmK⊥ ,Q =\np\n1\n2\n1,2\np\n1\n2\nK⊥ ,vp\nK⊥\n7ζ(3) ξ0 Tc2 0\nFS\n\nAs one can see in Eq. (61), the transverse magnetic field is induced by the finite FFLO modulation (Q 6= 0) and the\nlongitudinal magnetic flux varies along the FFLO modulation. An example of the flux distribution in the longitudinal\nFFLO vortex lattice is shown in Fig. 13 (a). One can see that outgoing and incoming fields are induced and\ncorrespondingly, the longitudinal magnetic flux varies along the FFLO modulation. The experimentally measured\nVLFF is expected to reflect the internal field which is spatially averaged over the range [−π/Q, π/Q] in the Z direction.\nThen, the transverse incoming and outgoing fields cancel each other. The |∆|4 contribution to the spatially averaged\n\u0002\n\u0001\n(4)\n(4)\ninternal magnetic field is given by replacing b̂K⊥ ,vp (ρj ) in Eq. (42) by b̂K⊥ ,vp (ρj ) cos Q vp * Ẑ (αj − βj − γj +\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\u0003\nδj ) /2 + cos Q vp * Ẑ (αj + βj ) cos Q vp * Ẑ (γj + δj ) . Figure 13 (b) shows typical |F1,1 (h)|2 curves in the\nlongitudinal FFLO vortex lattice without an AFM order, where solid (blue) and dotted curves correspond to the\nresults with and without the FFLO longitudinal modulation, respectively, and the arrow denotes the FFLO transition\nfield. In obtaining the result, the modulation Q is determined selfconsistently from the GL free energy functional\n[35], and further, it is confirmed that the FFLO transition is of second order. As one can see in the figure, VLFF\nis suppressed by the longitudinal FFLO modulation and the slope of the |F1,1 (h)|2 curve changes its sign quite close\nto the FFLO transition field. An abrupt falling down behavior in VLFF has been experimentally observed near the\ntransition between the low field SC phase and the HFLT one in H k ab case [45], which seems to imply the formation of\nthe longitudinal FFLO vortex lattice state in the HFLT phase. On the other hand, an AFM order and corresponding\nAFM fluctuation which are not taken into account in the above argument about the FFLO state may affect the result.\nIt should be noted, however, that the quasiparticle damping brought by the AFM critical fluctuation should suppress\nthe PPB effect so that the onset of the FFLO transition field in the above calculation should be shifted to a higher\nfield and that the FFLO region should be narrower. In order to investigate the high-field and low-temperature SC\nphase in H k ab, further studies taking account of the longitudinal FFLO vortex lattice, the PPB-induced AFM order,\nand fluctuation around the AFM transition consistently will be needed.\nIn the last of this subsection, we will discuss effects of the longitudinal FFLO modulation on VLFF in H k c case.\nThe HFLT phase appearing just below the Hc2 (T ) curve as a narrow region in H k c case [16, 24] has been considered\n\n\f22\n\n(a)\n\n(b)\n\n0.2\n\nFFLO\n~\nz\n\n0.15\n\n|F1,1|\n\n2π/Q\n\n~\nx\n\n2\n\n0.1\n0.05\n\n~\nz\n\n0\n\nvortex\n~\nx\n\n0.3\n\n0.5\n\nh\n\n0.7\n\n0.9\n\nFIG. 13: (Color online) Spatial flux distribution (a) and the |F1,1 (h)|2 curves normalized by (4πCGL )2 (b) in the longitudinal\nFFLO vortex lattice state. The AFM order and fluctuation are not taken into account in obtaining these results. The structure\nof this state is schematically shown in (a) where a solid (black) vertical line, a vertical wavy (green) curve, and horizontal dashed\nlines indicate a vortex line extending along the applied field, the FFLO modulation, and the nodal planes on which |∆| = 0,\nrespectively. The left upper (lower) panel in (a) shows the numerically obtained transverse field on the surface QZ = π/4\n(QZ = −π/4) in the FFLO state with 2πξ0 Q = 0.55 appearing at t = 0.1 and h = 0.65, where a (black) dot denotes the vortex\ncenter. An outgoing field from the vortex center is seen at QZ = π/4, while, on the surface QZ = −π/4, rather an incoming\nfield is induced. Correspondingly, the longitudinal magnetic flux at the vortex core denoted by vertical (blue) arrows varies\nalong the applied field with its minimum at the nodal plane and maximum at the surface on which |∆| is the largest. In (b),\n(blue) solid and (blue and black) dotted curves denote the |F1,1 (h)|2 ones with and without the longitudinal FFLO modulation\nat t = 0.1, respectively, and the arrow denotes the corresponding second order transition field to the longitudinal FFLO vortex\nstate. The VLFF is suppressed due to the FFLO spatial modulation of the SC order parameter.\n\nto be a realization of the longitudinal FFLO vortex lattice [17]. On the other hand, VLFF obtained in the neutron\nscattering experiment does not show any structure around the transition between the HFLT phase and the lower field\nphase [14], in contrast to the abrupt falling down behavior in H k ab case discussed above. The absence of a precursor\nof the FFLO state in VLFF in H k c case may be due to the fact that the effect of the FFLO modulation on VLFF is\ntoo small just above the FFLO transition to be seen. Although VLFF should be suppressed by the FFLO modulation\nQ, drastic suppression cannot be seen because, in H k c case, the stability region of the FFLO state is quite narrow\nand Q cannot grow up to a large value. We believe that, if VLFF is detected in sufficiently high resolution, the onset\nof the FFLO transition should be observed in VLFF in H k c case.\nV.\n\nSUMMARY\n\nAntiferromagnetic (AFM) fluctuation and order induced inside a d-wave superconducting (SC) phase by strong\nPauli-paramagnetic pair-breaking (PPB) [8] have been theoretically studied, focusing on how they are affected by\nspatial modulations of a SC vortex lattice. Based on the microscopic calculation taking account of both orbital and\nparamagnetic pair-breaking effects, we have shown that, with increasing field and decreasing temperature, the SC\nvortex lattice state becomes more stable by inducing AFM fluctuation inside it: From the viewpoint of the SC order,\nthe magnetic screening is promoted by the induced AFM fluctuation in the high-field SC phase. In other words, the\nAFM order can more easily appear inside the SC vortex lattice state than in the normal state. These implications have\nbeen concretely discussed in connection with the anomalous SC phenomena observed in CeCoIn5 . First, in H k c case\nwhere the AFM quantum critical behavior around Hc2 (0) is experimentally observed, such appearance of the AFM\nfluctuation in the SC state in higher fields has been explained as a result of the PPB enhanced with increasing the\nfield. Then, it is found that the vortex lattice form factor (VLFF) is enhanced by the additional magnetic screening\nbrought by the coupling between the induced AFM fluctuation and the spatial modulation of the SC vortex lattice\nand that the VLFF's enhancement becomes much remarkable as the AFM instability is approached. The obtained\ntemperature and field dependences of VLFF are consistent with the experimental result [13, 14], which suggests the\nanomalous field dependence of VLFF observed in the experiments is a consequence of the PPB-induced AFM critical\nfluctuation. Second, in H k ab case where an AFM order with m ⊥ H appears inside the SC phase in CeCoIn5 , it is\nfound that the vortex-lattice modulation promotes the AFM fluctuation and that, as a result, a spatially modulated\nAFM order synchronized with the vortex lattice is stabilized in the SC vortex state. In contrast to the conventional\n\n\f23\ncompetitive nature between the AFM and SC orders, the PPB-induced AFM order in the vortex lattice coexists with\nthe nonvanishing SC order parameter and does not localize in the vortex cores. The spatial modulation peculiar to\nthe longitudinal FFLO state, which seems to be realized in the HFLT phase of CeCoIn5 [29], has been neglected in our\nanalysis on the AFM order. According to the theoretical study taking account of the longitudinal FFLO modulation\nin the Pauli limit without vortex lattice structures included [30], a possible PPB-induced AFM order in the highfield side of the FFLO state is not localized in the FFLO nodal plane but prefers to coexist with the nonvanishing\nSC order parameter. The unconventional coexistence of the AFM and SC orders, obtained in the two approaches\ncomplementary to each other, is consistent with a picture on the HFLT phase of CeCoIn5 suggested from the recent\nNMR data [29]. Further, our study on effects of the longitudinal FFLO spatial modulation and the AFM order\non VLFF performed additionally has shown that, as well as the AFM fluctuation, the AFM order enhances VLFF,\nwhile the longitudinal FFLO modulation leads to a significant reduction of VLFF similar to that seen in CeCoIn5 .\nThese results on the magnetic properties in high field superconductors with strong PPB imply that the HFLT state\nof CeCoIn5 is a coupled phase composed of a PPB-induced AFM order and the d-wave SC order accompanied by the\nlongitudinal FFLO modulation.\nVI.\n\nACKNOWLEDGEMENT\n\nWe are grateful to Y. Matsuda, K. Kumagai, T. Shibauchi, M. Eskildsen, M. Kenzelmann, S. Gerber, and M. Sigrist\nfor usefufl discussions and A. Bianchi for providing us with a copy of Ref. [45] and discussion on the vortex lattice in\nthe HFLT phase. This work was partly supported by Grant-in-Aid for Scientific Research [No. 21540360] from JSPS,\nJapan.\nVII.\nA.\n\nAPPENDIX\n\nOrbital pair-breaking effect\n\nHere, we show the details of the calculation in obtaining Eq. (29) and derive equations useful in incorporating the\norbital pair-breaking effect. In the case with H k ẑ (H k ŷ), the vector potential can be expressed as A0 = (0, Hx, 0)\n−2\n−2\n(A0 = (Hz, 0, 0)), and then, [Π√x , Πy ] = −irH\n([Πz , Πx ] = −irH\n) is satisfied. In H k ẑ case, by introducing the\noperators Π± = rH (Πx ± iΠy )/ 2, we obtain\nh\ni\n|η|2\n2\n∗\nexp iA Tc−1 vp * Π = e− 2 A eiA η Π+ eiA ηΠ− ,\neiA η\n\n∗\n\nΠ+\n\n= e(iAη\n\n∗\n\n√\nrH /2)2 [Πx ,iΠy ] −(A η ∗ rH / 2) Πy\n\ne\n\nei(A η\n\n∗\n\n√\nrH / 2) Πx\n\n,\n\n(63)\n\nwhere the operator identity e[Â,B̂] = e−[Â,B̂]/2 eÂ eB̂ is used. In H k ŷ case, (Πx , Πy ) is replaced by (γ −1/2 Πz , γ 1/2 Πx )\nin Eq. (63). Equation (29) is obtained by using Eq. (63). Since the Fourier transformation of φ0 (X + αrH , Y )φ∗0 (X +\nβrH , Y ) with the reciprocal lattice vector K⊥ = (Kx , Ky ) is calculated as\nZ\nh K r\ni\nh K r\ni\n2\ndX dY\n1\nx H\ny H\n(2)\nφ0 (X + αrH , Y )φ∗0 (X + βrH , Y )e−iK⊥ *(X,Y ) = TK⊥ e− 4 (α−β) exp i\n(α + β) exp −\n(α − β) ,\nLX LY\n2\n2\n\u0012\ni\u0013\nh 1\ni\nπ Ky rH h Ky rH\nk\n(2)\nexp − |K⊥ rH |2 ,\n(64)\nTK⊥ = δ Ky rH + k K r ,even | Ky rH :integer cos\n+ Kx rH\nx H\nk\nπ\nk\n2 k\nk\nπ\n4\nwe obtain\n\n\u0010\n\u0011\u0015\n†\nvp * Π1 α + vp * Π2 β φ0 (s1 )φ∗0 (s2 )|si →(X,Y )\nexp\n\u0002\n\u0003\n√\n√\n2\n2\n∗2\n2\n2\n1\n= e− 2 α (|η| −η )+β (|η|−η ) φ0 (X + sε αη ∗ 2rH , Y )φ∗0 (X − sε βη 2rH , Y )\n\u0014\n\u0011\u0015\niX\n\u0010 (η * K r )\nh |η|2\n(η × K⊥ rH )z\n⊥ H\n(2) iK⊥ *(X,Y )\n2\n√\n√\n(α − β) + i\n(α + β) . (65)\n(α + β)\nTK⊥ e\nexp isεn\n= exp −\n2\n2\n2\nK\n\u0014\n\nisεn Tc−1\n\n⊥\n\nIn the same manner, the identity corresponding to the fourth order term is given by\n\u0014\n\u0010\n\u0011\u0015\n†\n†\n−1\nexp i sεn Tc vp * Π1 α + vp * Π2 β + vp * Π3 γ + vp * Π4 δ φ0 (s1 )φ∗0 (s2 )φ(s3 )φ∗0 (s4 )|si →(X,Y )\n\n\f24\n\u0014\n\u0014\n\u0011\u0015\n\u0011\u0015\n1\u0010\n|η|2 \u0010 2\nα + β 2 + γ 2 + δ 2 + (α + γ)(β + δ) exp −\n(α − γ)2 η ∗ 2 + (β − δ)2 η 2\n= exp −\n2\n4\n∞\nX\nX\nk\n(4)\nTK⊥ eiK⊥ *(X,Y )\nT (4) (l1 , l2 , K⊥ )\n×√\n2π K\nl1 ,l2 =−∞\n⊥\n\u0014\n\u0010\n\u0011\u0015\nk\nk\nKy rH\n∗\n×exp isεn − iη √ (l1 − l2 )(α − γ) − iη √ (l1 + l2 +\n)(β − δ)\nk\n2\n2\n\u0014\n\u0011\u0015\n\u0010 (η * K r ) \b\n(η × K⊥ rH )z \b\n⊥ H\n√\n√\n,\n(α + γ) − (β + δ) + i\n(α + γ) + (β + δ)\n×exp isεn\n2 2\n2 2\n\u0014\n\u0015\nh 1\ni\nπ Ky rH \u0010 k\nKy rH \u0011\n(4)\nTK⊥ = δ k K r + Ky rH ,even | Ky rH :integer exp − i\nexp − |K⊥ rH |2 ,\nKx rH +\nx H\nπ\nk\nk\n4 k\nπ\nk\n8\n\u0010π k\n\u0011\nK\nr\ny\nH\nT (4) (l1 , l2 , K⊥ ) = cos\n( Kx rH +\n)(l1 + l2 )\nk\n\u0015\n\u0014\n\u0015\n\u0014 2 \u0010π\nKy rH 2 \u0011\nKy rH 2 \u0011\nk2 \u0010\nπ\n(l1 − l2 )2 + (l1 + l2 +\nexp −\n,(66)\n)\n)\n×exp i (l1 − l2 )2 − (l1 + l2 +\n4\nk\n4\nk\nwhere l1 and l2 are integers.\nB.\n\nGL coefficients Vi in Eq. (9)\n\nSince the GL coefficients Vi in Eq. (9) have been already derived elsewhere [23, 35], we only show the final\nexpressions of Vi which are given by\nZ ∞ \u0014\nD\n\u0010 |η|2 \u0011E \u0015\n\u0010 π2 ξ 2 \u0011\n1\n1\n,\ndρ\nln(h) +\nexp − 2 0 ρ2 − fcos (ρ, ρ) |wp |2 exp −\nρ2\nV2 =\n2\nρ\nr\n2\nFS\n0\nH\n\u0014\n3\n3 Z ∞\n3\n\u0011\u0015\nE\nX\nY\nX\n\u0001D\n1\u0010 1\nρi |wp |4 exp −\n− R24 + R14 cos(I4 )\n,\nρi ,\nV4 = = 2\ndρi fcos\n2\n2\nFS\ni=1\ni=1 0\ni=1\n\u0014\n5\n5 Z ∞\n5\n\u0011\u0015\nE\nX\nY\nX\n\u0001D\n1\u0010\n6\nρi |wp | exp −\n,\n(67)\nR16 + R26 cos(I6 )\nρi ,\nV6 = −6\ndρi fcos\n2\nFS\ni=1\ni=1 0\ni=1\nwhere\nR14 = |η|2\n\n3\n\u0010X\ni=1\n\n\u0011\nρ2i + ρ2 (ρ3 + ρ1 ) ,\n\nR24 = Re(η 2 )[ρ22 + (ρ3 − ρ1 )2 ],\nIm(η 2 ) 2\nI4 =\n[ρ2 − (ρ3 − ρ1 )2 ],\n4\n\u0011\n\u0010\n2\nR16 = |η|2 e1 + e2 + e3 + e4 e5 ,\n3\n\u0010\n\u0011\ne2 + e25\n2\nR26 = Re(η 2 ) e1 + e2 + e3 − 4\n− (e6 + e7 + e8 + e9 ) ,\n3\n3\n\u0011\ne24 − e25\n2\nIm(η 2 ) \u0010\ne1 + e2 − e3 −\n− (e6 + e7 − e8 − e9 ) ,\nI6 =\n4\n3\n3\ne1 = (ρ3 + ρ5 )2 + (ρ3 + ρ4 )2 ,\ne2 = (ρ1 + ρ4 + ρ5 )2 ,\ne3 = ρ23 + ρ24 + (ρ2 − ρ5 )2 ,\ne4 = ρ1 + 2(ρ3 + ρ4 + ρ5 ),\ne 5 = ρ2 − ρ3 − ρ4 − ρ5 ,\ne6 = (ρ4 − ρ5 )2 + (ρ1 + ρ5 − ρ3 )2 ,\ne7 = (ρ1 + ρ4 − ρ3 )2 ,\n\n\f25\ne8 = (ρ3 − ρ4 )2 + (ρ2 + ρ3 − ρ5 )2 ,\ne9 = (ρ2 + ρ4 − ρ5 )2 .\nC.\n\n(68)\n\nImaginary part of the self energy\n\nThe self energy of a quasiparticle is expressed as [39]\nXX\nΣσ (k, iεn ) = T\nGε1 ,σ (k + Q0 − q) χ(q, i(εn − ε1 )).\nε1\n\n(69)\n\nq\n\nAfter carrying out an analytic continuation, we obtain the imaginary part of the self energy on the Fermi surface as\nfollows:\nZ\nh\n\u0010 x \u0011\n\u0010 x \u0011i\n1 X ∞\nR\nR\n− tanh\nIm ΣR\n(k,\n0)\n=\ndx Im G−i\nσ\nx,σ (k + Q0 − q) Im χ (q, x) coth\n2π q −∞\n2T\n2T\nZ\nZ\n\u0011 ξ 2 (h, t)\n\u0010\nqc\ndφ\n2T\n≃\n(70)\nd(q 2 ) δ ε(k + Q0 + q) + σI Tc\n2 1 + ξ 2 (h, t) q 2 ,\n2\n4(2π)\n2π\nN (0)ξN\nwhere ΣR is the retarded self energy, G R is the retarded Green's function, and the inequality |x|/2T ≪ 1 is used.\nSince the δ-function in Eq. (70) is reduced to\n\nwith φ0 = cos−1\n\n\u0010\n\u0011\nθ(q 2 − [∆ε/vF ]2 )\nδ(φ − φ0 )\nδ Tc δIC + vk * q − (σ + σ)I Tc =\nq vF | sin φ0 |\n\u0001\n∆ε/(q vF ) , we obtain\nZ ∞\nπT\n1\nqc\n1\n1\nIm ΣR\n(k\n,\n0)\n=\ndq 2 p\nF\nσ\n2\n2\n−2\n2\n2\n2 N (0)ξN (2π) vF (∆ε/vF )2\nq − (∆ε/vF ) ξ (h, t) + q 2\n\u0011−1/2\nπ2 T\nqc pF\n1 \u0010 −2\n.\nξ (h, t) + (∆ε/vF )2\n=\n2\n2\n2(2π) N (0) vF pF ξN\n\n(71)\n\n(72)\n\n[1] R. Konno and K. Ueda, Phys. Rev. B 40, 4329 (1989) and references therein.\n[2] J. Paglione, M. A. Tanatar, D. G. Hawthorn, Etienne Boaknin, R. W. Hill, F. Ronning, M. Sutherland, L. Taillefer, C.\nPetrovic, and P. C. Canfield, Phys. Rev. Lett. 91, 246405 (2003).\n[3] S. Singh, C. Capan, M. Nicklas, M. Rams, A. Gladun, H. Lee, J. F. DiTusa, Z. Fisk, F. Steglich, and S. Wirth, Phys. Rev.\nLett. 98, 057001 (2007).\n[4] F. Ronning, C. Capan, A. Bianchi, R. Movshovich, A. Lacerda, M. F. Hundley, J. D. Thompson, P. G. Pagliuso, and J. L.\nSarrao, Phys. Rev. B 71, 104528 (2005).\n[5] T. Park, Y. Tokiwa, F. Ronning, H. Lee, E. D. Bauer, R. Movshovich, J. D. Thompson, Phys. Status Solidi B 247, 553\n(2010).\n[6] F. Honda, R. Settai, D. Aoki, Y. Haga, T. D. Matsuda, N. Tateiwa, S. Ikeda, Y. Homma, H. Sakai, Y. Shiokawa, E.\nYamamoto, A. Nakamura, and Y. Onuki, J. Phys. Soc. Jpn. Suppl. A 77, 339 (2008).\n[7] V. H. Tran, D. Kaczorowski, R. T. Khan, and E. Bauer, Phys. Rev. B 83, 064504 (2011).\n[8] R. Ikeda, Y. Hatakeyama, and K. Aoyama, Phys. Rev. B 82, 060510(R) (2010).\n[9] H. Shishido, R. Settai, D. Aoki, S. Ikeda, H. Nakawaki, N. Nakamura, T. Iizuka, Y. Inada, K. Sugiyama, T. Takeuchi,\nK. Kindo, T. C. Kobayashi, Y. Haga, H. Harima, Y. Aoki, T. Namiki, H. Sato and Y. Onuki, J. Phys. Soc. Jpn. 71, 162\n(2002).\n[10] N. Hiasa and R. Ikeda, Phys. Rev. Lett. 101, 027001 (2008).\n[11] J. Schelten, H. Ullmaier, W. Schmatz, Phys. Status Solidi B 48, 619 (1971).\n[12] J. R. Clem, J. Low Temp. Phys. 18, 427 (1975).\n[13] A. D. Bianchi, M. Kenzelmann, L. DeBeer-Schmitt, J. S. White, E. M. Forgan, J. Mesot, M. Zolliker, J. Kohlbrecher, R.\nMovshovich, E. D. Bauer, J. L. Sarrao, Z. Fisk, C. Petrovic, and M. R. Eskildsen, Science 319, 177 (2008).\n[14] J. S. White, P. Das, M. R. Eskildsen, L. DeBeer-Schmitt, E. M. Forgan, A. D. Bianchi, M. Kenzelmann, M. Zolliker, S.\nGerber, J. L. Gavilano, J. Mesot, R. Movshovich, E. D. Bauer, J. L. Sarrao, and C. Petrovic, New J. Phys. 12, 023026\n(2010) .\n\n\f26\n[15] M. Ichioka and K. Machida, Phys. Rev. B 76 064502 (2007).\n[16] K. Kumagai, M. Saitoh, T. Oyaizu, Y. Furukawa, S. Takashima, M. Nohara, H. Takagi, and Y. Matsuda, Phys. Rev. Lett.\n97, 227002 (2006).\n[17] R. Ikeda, Phys. Rev. B 76, 134504 (2007).\n[18] Y. Kasahara, Y. Nakajima, K. Izawa, Y. Matsuda, K. Behnia, H. Shishido, R. Settai, and Y. Onuki, Phys. Rev. B 72,\n214515(R) (2005).\n[19] J. Spehling, R. H. Heffner, J. E. Sonier, N. Curro, C. H. Wang, B. Hitti, G. Morris, E. D. Bauer, J. L. Sarrao, F. J.\nLitterst, and H.-H. Klauss, Phys. Rev. Lett. 103, 237003 (2009).\n[20] C. Paulsen, D. Aoki, G. Knebel, and J. Flouquet, J. Phys. Soc. Jpn. 80, 053701 (2011).\n[21] P. Fulde and R. A. Ferrell, Phys. Rev. 135, A550 (1964).\n[22] A. I. Larkin and Yu. N. Ovchinnikov, Sov. Phys. JETP 20, 762 (1965).\n[23] H. Adachi and R. Ikeda, Phys. Rev. B 68, 184510 (2003).\n[24] A. Bianchi, R. Movshovich, C. Capan, P. G. Pagliuso, and J. L. Sarrao, Phys. Rev. Lett. 91, 187004 (2003).\n[25] M. Kenzelmann, Th. Strassle, C. Niedermayer, M. Sigrist, B. Padmanabhan, M. Zolliker, A. D. Bianchi, R. Movshovich,\nE. D. Bauer, J. L. Sarrao, and J. D. Thompson, Science 321, 1652 (2008).\n[26] M. Kenzelmann, S. Gerber, N. Egetenmeyer, J. L. Gavilano, Th. Strassle, A. D. Bianchi, E. Ressouche, R. Movshovich,\nE. D. Bauer, J. L. Sarrao, and J. D. Thompson, Phys. Rev. Lett. 104, 127001 (2010).\n[27] Y. Tokiwa, R. Movshovich, F. Ronning, E. D. Bauer, A. D. Bianchi, Z. Fisk, and J. D. Thompson, Phys. Rev. B 82,\n220502 (2010) .\n[28] R. Ikeda, Phys. Rev. B 81, 060510(R) (2010).\n[29] K. Kumagai, H. Shishido, T. Shibauchi, Y. Matsuda, Phys. Rev. Lett. 106, 137004 (2011).\n[30] Y. Hatakeyama and R. Ikeda, Phys. Rev. B 83 224518 (2011).\n[31] Y. Yanase and M. Sigrist, J. Phys. Soc. Jpn. 78, 114715 (2009).\n[32] A. Aperis, G. Varelogiannis, and P. B. Littlewood, Phys. Rev. Lett. 104, 216403 (2010).\n[33] A. B. Vorontsov, M. G. Vavilov, and A. V. Chubukov, Phys. Rev. B 79, 060508(R) (2009).\n[34] N. R. Werthamer, 'The Ginzburg-Landau Equations and Their Extensions' in Superconductivity, ed. by R. D. Parks (Marcel\nDekker, New York, 1969), p. 321.\n[35] R. Ikeda, Phys. Rev. B 76, 054517 (2007).\n[36] M. Houzet and V. P. Mineev, Phys. Rev. B 76, 224508 (2007).\n[37] N. J. Curro, J. L. Sarrao, J. D. Thompson, P. G. Pagliuso, S. Kos, A. Abanov, and D. Pines, Phys. Rev. Lett. 90, 227202\n(2003).\n[38] A. J. Millis, H. Monien, and D. Pines, Phys. Rev. B 42, 167 (1990).\n[39] A. V. Chubukov, D. Pines, and B. P. Stojkovic, J. Phys. Condens. Matter 8, 10017 (1996).\n[40] B. P. Stojkovic and D. Pines, Phys. Rev. B 55, 8576 (1997).\n[41] T. Moriya and K. Ueda, Rep. Prog. Phys. 66, 1299 (2003).\n[42] A. J. Millis, Phys. Rev. B 48, 7183 (1993).\n[43] M. Ogata, Int. J. Mod. Phys. B 13, 3560 (1999); D. P. Arovas, A. J. Berlinsky, C. Kallin, and Shou-Cheng Zhang, Phys.\nRev. Lett. 79, 2871 (1997).\n[44] K. Kakuyanagi, K. Kumagai, Y. Matsuda, and M. Hasegawa, Phys. Rev. Lett. 90, 197003 (2003).\n[45] J. S. White, thesis (The Universty of Birmingham, 2009). See Fig.4.41 there.\n\n\f"}