{"id": "http://arxiv.org/abs/0802.0684v1", "guidislink": true, "updated": "2008-02-05T18:02:48Z", "updated_parsed": [2008, 2, 5, 18, 2, 48, 1, 36, 0], "published": "2008-02-05T18:02:48Z", "published_parsed": [2008, 2, 5, 18, 2, 48, 1, 36, 0], "title": "From Hadronic Parity Violation to Parity-Violating Electron Scattering\n  and Tests of the Standard Model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2988%2C0802.3615%2C0802.3208%2C0802.0684%2C0802.2142%2C0802.2676%2C0802.2868%2C0802.1476%2C0802.1390%2C0802.4435%2C0802.4286%2C0802.2283%2C0802.0540%2C0802.2450%2C0802.2556%2C0802.3247%2C0802.0929%2C0802.2024%2C0802.0399%2C0802.3147%2C0802.1017%2C0802.4102%2C0802.0837%2C0802.0196%2C0802.4378%2C0802.0627%2C0802.3729%2C0802.0116%2C0802.2917%2C0802.2693%2C0802.2672%2C0802.3390%2C0802.2095%2C0802.0490%2C0802.4290%2C0802.4402%2C0802.0177%2C0802.3695%2C0802.0037%2C0802.3746%2C0802.0993%2C0802.1127%2C0802.0924%2C0802.0122%2C0802.0727%2C0802.4428%2C0802.3114%2C0802.0589%2C0802.1596%2C0802.4027%2C0802.3719%2C0802.3600%2C0802.3050%2C0802.1643%2C0802.0061%2C0802.2130%2C0802.3657%2C0802.3899%2C0802.1423%2C0802.2311%2C0802.0215%2C0802.1194%2C0802.1384%2C0802.1754%2C0802.4005%2C0802.3605%2C0802.2993%2C0802.1265%2C0802.3496%2C0802.3666%2C0802.2065%2C0802.4123%2C0802.3949%2C0802.1841%2C0802.2236%2C0802.3339%2C0802.2522%2C0802.0051%2C0802.4176%2C0802.0694%2C0802.1187%2C0802.2317%2C0802.2664%2C0802.2532%2C0802.3062%2C0802.3422%2C0802.1696%2C0802.2105%2C0802.1676%2C0802.3282%2C0802.0255%2C0802.2166%2C0802.2387%2C0802.3777%2C0802.2853%2C0802.2985%2C0802.1653%2C0802.4461%2C0802.4310%2C0802.0413%2C0802.2660&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "From Hadronic Parity Violation to Parity-Violating Electron Scattering\n  and Tests of the Standard Model"}, "summary": "After almost five decades of study of parity violation in hadronic systems,\nthe determination of the seven weak meson-nucleon couplings is still\nincomplete. Whereas parity violation in nuclear systems is complicated by the\nintricacies of QCD, measurements of parity violation in the much simpler\nproton-proton system are more straightforward to interpret. We now have three\nsuch precision pp experiments at 13.6, at 45, and 221 MeV. Today there are also\nbetter possibilities for theoretical interpretation using effective field\ntheory. In electron-proton scattering, parity violating ep experiments such as\nSAMPLE, G0, HAPPEX, and PVA4 have already shown that the strange quark\ncontributions to the charge and magnetization distributions of the nucleon are\ntiny. When analyzed together, the results have also greatly improved knowledge\nof the proton's \"weak charge\" (Q^p_weak = 1-4sin^2\\theta_W at tree level). The\nQ^p_weak experiment at JLab will further improve this, determining the proton's\nweak charge to a precision of about 4%. Such a precision will either establish\nconformity with the Standard Model of quarks and leptons or point to New\nPhysics. Following the upgrade of CEBAF at JLab to 12 GeV, a parity violating\nelectron-electron (Moller) scattering experiment similar to SLAC E158, will\nmeasure the weak charge of the electron and hence sin^2\\theta_W at low energy\nwith a precision comparable to the most precise individual measurements at the\nZ0 pole (to about +/- 0.00025). This experiment will be complementary to\nQ^p_weak in terms of sensitivity to New Physics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2988%2C0802.3615%2C0802.3208%2C0802.0684%2C0802.2142%2C0802.2676%2C0802.2868%2C0802.1476%2C0802.1390%2C0802.4435%2C0802.4286%2C0802.2283%2C0802.0540%2C0802.2450%2C0802.2556%2C0802.3247%2C0802.0929%2C0802.2024%2C0802.0399%2C0802.3147%2C0802.1017%2C0802.4102%2C0802.0837%2C0802.0196%2C0802.4378%2C0802.0627%2C0802.3729%2C0802.0116%2C0802.2917%2C0802.2693%2C0802.2672%2C0802.3390%2C0802.2095%2C0802.0490%2C0802.4290%2C0802.4402%2C0802.0177%2C0802.3695%2C0802.0037%2C0802.3746%2C0802.0993%2C0802.1127%2C0802.0924%2C0802.0122%2C0802.0727%2C0802.4428%2C0802.3114%2C0802.0589%2C0802.1596%2C0802.4027%2C0802.3719%2C0802.3600%2C0802.3050%2C0802.1643%2C0802.0061%2C0802.2130%2C0802.3657%2C0802.3899%2C0802.1423%2C0802.2311%2C0802.0215%2C0802.1194%2C0802.1384%2C0802.1754%2C0802.4005%2C0802.3605%2C0802.2993%2C0802.1265%2C0802.3496%2C0802.3666%2C0802.2065%2C0802.4123%2C0802.3949%2C0802.1841%2C0802.2236%2C0802.3339%2C0802.2522%2C0802.0051%2C0802.4176%2C0802.0694%2C0802.1187%2C0802.2317%2C0802.2664%2C0802.2532%2C0802.3062%2C0802.3422%2C0802.1696%2C0802.2105%2C0802.1676%2C0802.3282%2C0802.0255%2C0802.2166%2C0802.2387%2C0802.3777%2C0802.2853%2C0802.2985%2C0802.1653%2C0802.4461%2C0802.4310%2C0802.0413%2C0802.2660&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "After almost five decades of study of parity violation in hadronic systems,\nthe determination of the seven weak meson-nucleon couplings is still\nincomplete. Whereas parity violation in nuclear systems is complicated by the\nintricacies of QCD, measurements of parity violation in the much simpler\nproton-proton system are more straightforward to interpret. We now have three\nsuch precision pp experiments at 13.6, at 45, and 221 MeV. Today there are also\nbetter possibilities for theoretical interpretation using effective field\ntheory. In electron-proton scattering, parity violating ep experiments such as\nSAMPLE, G0, HAPPEX, and PVA4 have already shown that the strange quark\ncontributions to the charge and magnetization distributions of the nucleon are\ntiny. When analyzed together, the results have also greatly improved knowledge\nof the proton's \"weak charge\" (Q^p_weak = 1-4sin^2\\theta_W at tree level). The\nQ^p_weak experiment at JLab will further improve this, determining the proton's\nweak charge to a precision of about 4%. Such a precision will either establish\nconformity with the Standard Model of quarks and leptons or point to New\nPhysics. Following the upgrade of CEBAF at JLab to 12 GeV, a parity violating\nelectron-electron (Moller) scattering experiment similar to SLAC E158, will\nmeasure the weak charge of the electron and hence sin^2\\theta_W at low energy\nwith a precision comparable to the most precise individual measurements at the\nZ0 pole (to about +/- 0.00025). This experiment will be complementary to\nQ^p_weak in terms of sensitivity to New Physics."}, "authors": ["Willem T. H. van Oers"], "author_detail": {"name": "Willem T. H. van Oers"}, "author": "Willem T. H. van Oers", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S0217732308027643", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.0684v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.0684v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 8 figures, LaTeX. Invited talk at the International\n  Symposium on Cosmology and Particle Astrophysics (CosPA07), Taipei, Taiwan,\n  Nov 13-15, 2007", "arxiv_primary_category": {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.0684v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.0684v1", "journal_reference": null, "doi": "10.1142/S0217732308027643", "fulltext": "October 25, 2018 5:41 WSPC/INSTRUCTION FILE\ncospa07\n\nvanoers-\n\narXiv:0802.0684v1 [nucl-ex] 5 Feb 2008\n\nModern Physics Letters A\nc World Scientific Publishing Company\n\nFROM HADRONIC PARITY VIOLATION TO\nPARITY-VIOLATING ELECTRON SCATTERING AND TESTS OF\nTHE STANDARD MODEL ∗\n\nWILLEM T. H. VAN OERS\nDepartment of Physics and Astronomy, University of Manitoba,\nWinnipeg, MB, Canada R3T 2N2\nand\nTRIUMF, 4004 Wesbrook Mall, Vancouver, BC, Canada V6T 2A3†\n\nReceived (Day Month Year)\nRevised (Day Month Year)\nSearches for parity violation in hadronic systems started soon after the evidence for parity\nviolation in β -decay of 60 Co was presented by Madame Chien-Shiung Wu and in π and\nμ decay by Leon Lederman in 1957. The early searches for parity violation in hadronic\nsystems did not reach the sensitivity required and only after technological advances in\nlater years was parity violation unambiguously established. Within the meson-exchange\ndescription of the strong interaction, theory and experiment meet in a set of seven weak\nmeson-nucleon coupling constants. Even today, after almost five decades, the determination of the seven weak meson-nucleon couplings is incomplete. Parity violation in nuclear\nsystems is rather complex due to the intricacies of QCD. More straight forward in terms of\ninterpretation are measurements of the proton-proton parity-violating analyzing power\n(normalized differences in scattering yields for positive and negative helicity incident\nbeams), for which there exist three precision experiments (at 13.6, at 45, and 221 MeV).\nTo-date, there are better possibilities for theoretical interpretation using effective field\ntheory approaches.\nThe situation with regard to the measurement of the parity-violating analyzing\npower or asymmetry in polarized electron scattering is quite different. Although the\noriginal measurements were intended to determine the electro-weak mixing angle, with\nthe current knowledge of the electro-weak interaction and the great precision with which\nelectro-weak radiative corrections can be calculated, the emphasis has been to study the\nstructure of the nucleon, and in particular the strangeness content of the nucleon. A\nwhole series of experiments (the SAMPLE experiment at MIT-Bates, the G0 experiment\nand HAPPEX experiments at Jefferson Laboratory (JLab), and the PVA4 experiment\nat MAMI) have indicated that the strange quark contributions to the charge and magnetization distributions of the nucleon are tiny. These measurements if extrapolated to\nzero degrees and zero momentum transfer have also provided a factor five improvement\nin the knowledge of the neutral weak couplings to the quarks.\nChoosing appropriate kinematics in parity-violating electron-proton scattering permits\nnucleon structure effects on the measured analyzing power to be precisely controlled.\nConsequently, a precise measurement of the 'running' of sin2 θW or the electro-weak\n∗ Work\n† email:\n\nsupported in part by NSERC (Canada) and TRIUMF\nvanoers@triumf.ca\n1\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\n2\n\nvanoers-cospa07\n\nW.T.H. van Oers\nmixing angle has become within reach. The Qpweak experiment at Jefferson Laboratory\nis to measure this quantity to a precision of about 4%. This will either establish conformity with the Standard Model of quarks and leptons or point to New Physics as the\nStandard Model must be encompassed in a more general theory required, for instance, by\na convergence of the three couplings (strong, electromagnetic, and weak) to a common\nvalue at the GUT scale.\nThe upgrade of CEBAF at Jefferson Laboratory to 12 GeV, will allow a new measurement\nof sin2 θW in parity-violating electron-electron scattering with an improved precision to\nthe current better measurement (the SLAC E158 experiment) of the 'running' of sin2 θW\naway from the Z 0 pole. Preliminary design studies of such an experiment show that a precision comparable to the most precise individual measurements at the Z 0 pole (to about\n±0.00025) can be reached. The result of this experiment will be rather complementary\nto the Qpweak experiment in terms of sensitivity to New Physics.\nKeywords: Parity Violation\nPACS Nos.: 11.30.En; 12.60.-i; 1420.Dh\n\n1. Hadronic Parity Violation\nManifestations of the weak interaction of quarks have been searched for since\nMadame Chien-Shiung Wu presented the evidence for parity violation in β-decay of\n60\nCo and Leon Lederman for parity violation in π and μ decay. For instance, Neil\nTanner shortly thereafter, studied the 340 keV resonance in the 19 F (p, α) reaction\nto the 16 O ground state forbidden by angular momentum and parity conservation.[1]\nThe hadronic weak interaction is studied by observing non-leptonic flavor changing\ndecays of mesons and baryons and by measuring observables that conserve flavor but\nthat violate reflection symmetry of the strong and electromagnetic interactions. One\napproach that has been pursued is the study of parity forbidden transitions between\nnuclear states in particular in the light nuclei. It was realized that two accidental\naspects of nuclear structure in certain nuclei could amplify the expected effects\nof parity violation by several orders of magnitude beyond the nominal O(10−7 ).\nThe amplification arises from the near-degeneracy of opposite parity states that\nare mixed by the hadronic weak interaction and from the interference of an otherwise by parity conservation forbidden transition amplitude with a much stronger\nparity allowed transition amplitude. Although the weak quark-quark interaction\nhas been well established its appearance in nuclear systems is clouded by effects of\nnuclear structure and by the dynamics of quantum chromodynamics (QCD) in the\nnon-perturbative regime. Within the meson exchange description of the strong interaction, theory and experiment meet in a set of seven weak meson-nucleon coupling\nconstants as defined in the seminal paper by Desplanques, Donoghue, and Holstein\n(DDH). [2] It is assumed that the parity violating N-N interaction is governed by\nthe exchange of the pion and the two lightest vector mesons. The seven weak meson\n′\n0,1\nnucleon coupling constants are designated h1π , h0,1,2\n, h1ρ , and hω\n, where the superρ\n′\nscript indicates the isospin and the subscript the exchanged meson. Of these h1ρ was\nomitted from further consideration due to the difficulty calculating it. Desplanques,\nDonoghue, and Holstein provided 'reasonable ranges' and 'best values' for the weak\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\nvanoers-cospa07\n\nFROM HADRONIC PARITY VIOLATION TO PARITY-VIOLATING ELECTRON...\n\n3\n\nTable 1. Theoretical 'reasonable ranges' (second column) and 'best\nvalues' columns (three to five) for the parity violating meson-nucleon\ncoupling constants from Desplanques, Donoghue, and Holstein, from\nDubovic and Zenkin, and from Feldman\n√ et al.. All values are given in\nunits of gπ = 3.8 × 10−8 ≈ GF Fπ2 /(2 2).\nCoupling constant\n\nDDH range\n\nDDH best value\n\nDZ\n\nFCDH\n\nh1π\nh0ρ\nh1ρ\nh2ρ\nh0ω\nh1ω\n\n0 → −30\n30 → −81\n−1 → 0\n−20 → −29\n15 → −27\n−5 → −2\n\n+12\n−30\n−0.5\n−25\n−5\n−3\n\n+3\n−22\n+1\n−18\n−10\n−6\n\n+7\n−10\n−1\n−18\n−13\n−6\n\nmeson nucleon couplings constants. These are given in Table 1 together with values\nfor the latter from two similar theoretical approaches (Dubovic and Zenkin [3], and\nFeldman et al. [4]).\nThe experimental results from the nuclear parity violating measurements have\nbeen analyzed using the framework of Desplanques, Donoghue, and Holstein leading to constraints on combinations of the weak meson nucleon coupling constants.\nThere is a measure of agreement with the theoretical 'reasonable ranges' although\nalso experimentally the allowed ranges of values are large. Note that there exist two\nexperimental inconsistencies as depicted in Fig. 1: the value of h1π deduced from the\nγ-decays of 18 F is consistent with zero while the result deduced from the anapole\nmoment of 133 Cs indicates a difference from zero with several standard deviations.\nThe other inconsistency is possibly in the results deduced from the anapole moments\nof 205 Tl and 133 Cs. More straightforward in terms of interpretation are the measurements of the proton-proton parity violating analyzing powers or asymmetries (the\nnormalized differences in scattering yields for positive and negative helicity incident\nbeams) for which there exist three precision experiments (from the University of\nBonn at 13.6 MeV [6], from PSI at 45 MeV [7], and from TRIUMF at 221 MeV [8]).\nThese experiments required unprecedented precision in controlling systematic errors and in particular those due to helicity correlated false asymmetries. The parity\nviolating analyzing powers are compared to more recent theoretical calculations in\nthe framework of weak meson-nucleon couplings in Fig. 2. (see [8]) Carlson et al. [9]\ndeduced the constraints on the two combinations of\n√ weak meson-nucleon coupling\n0\n1\npp\n0\n1\n2\n6) from the proton-proton anconstants: hpp\n=\nh\n+\nh\nand\nh\n=\n(h\n+\nh\n+\nh\n/\nω\nω\nω\nρ\nρ\nρ\nρ\nalyzing power data. Clearly even more precise measurements of the proton-proton\nanalyzing powers are required in order to better constrain the weak meson-nucleon\ncoupling constants (see Fig. 3).\nThe extensive development of chiral perturbation theory and N-N effective field\ntheory and substantial progress in performing lattice QCD calculations have opened\nup new approaches of studying the hadronic weak interaction. For a recent review\nsee Ref. 10. In principle it is now possible to make QCD based predictions for weak\nhadronic interaction phenomena. On the experimental side there are several promis-\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\n4\n\nvanoers-cospa07\n\nW.T.H. van Oers\n\nFig. 1. Constraints on effective DDH weak meson-nucleon coupling constants deduced from parity\nviolating observables in light nuclei and anapole moments of heavy atoms (see [5]). The combi= h1π − 0.12h1ρ − 0.18h1ω and\nnations of the weak meson-nucleon coupling constants are: hnuc\nV\n0\n0\nnuc\nhS = −(hρ + 0.7hω )\n\ning precision parity violation measurements in progress. Foremost to be mentioned\nis the measurement of the parity violating asymmetry in the capture of polarized\nneutrons on hydrogen (the NPDGAMMA experiment). Others are the parity violating neutron spin rotation in helium and in hydrogen. (see Ref. 10)\n2. Parity Violating Electron Scattering\nThe situation with regard to parity violating analyzing power measurements in\npolarized electron scattering is quite different. Originally, in the low energy regime,\nthese measurements were made to determine the weak mixing angle or sin2 θW . Soon\nthereafter these measurements were overtaken by measurements at the Z 0 pole at\nLEP of CERN and SLC of SLAC. Given the current knowledge of the electroweak\ninteraction and the great precision with which electroweak radiative corrections can\nbe calculated, the current round of parity violating electron scattering experiments\nhas as one of its objectives to probe the structure of the nucleon and in particular\nthe contributions of the strange quarks (the quark-antiquark pairs of the sea) to the\nweak charge and magnetization distributions of the nucleons. With the couplings\nof both photons and Z bosons to point-like quarks well defined (see Table 2), it is\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\nvanoers-cospa07\n\nFROM HADRONIC PARITY VIOLATION TO PARITY-VIOLATING ELECTRON...\n\n5\n\nFig. 2. The three most precise proton-proton parity violation measurements (at 13.6, 45, and\n221 MeV) and theoretical predictions. The solid curve shows the calculation by Carlson et al.[9]\nin which the weak meson nucleon coupling constants were fitted to the data.\n\npossible to separate the contributions of the various flavors. The electromagnetic\nand weak charge and magnetic form factors of the proton can be written:\np\nu u\nd d\nd s\nGγ,Z\nE,M = 2q GE,M + q GE,M + q GE,M\n\nHeavier flavor contributions are neglected. Assuming charge symmetry in the quark\ndistributions, one can write an analogous expression for the neutron:\nn\nd d\nu u\nd s\nGγ,Z\nE,M = 2q GE,M + q GE,M + q GE,M\n\nClearly, in addition to the electromagnetic form factors for the proton and the\nneutron one needs one further relation, which is provided by the parity violating\nanalyzing power Az :\nAz = (1/P )[N + − N − ]/[N + + N − ]\n√\nγ\n2\nZ\n′ γ\ne\n= −[GF Q2 /(4 2πα)] × [ǫGγE GZ\nE + τ GM GM − (1 − 4 sin θW )ǫ GM GA ]/D\nwhere N + and N − are the normalized scattering yields and\nτ = Q2 /(4Mp2 ) ,\nǫ = 1/(1 + 2(1 + τ ) tan2 (θ/2)) ,\nD = ǫ(GγE )2 + τ (GγM )2 ,\np\nǫ′ = τ (1 + τ )(1 − ǫ2 ) ,\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\n6\n\nvanoers-cospa07\n\nW.T.H. van Oers\n\npp\nFig. 3. Constraints on the weak meson-nucleon coupling constants, combinations hpp\nω and hρ as\ndeduced from the proton-proton parity violating analyzing powers. [9] The figure shows contours\nof constant total χ2 = 1, 2, 3, 4, 5. The axes scales are in units of 10−7 .\n\nand Q2 is the squared four-momentum transfer, GF is the Fermi coupling constant\nZ\ne\nand α is the fine structure constant. The three new form factors GZ\nE , GM , and GA\ncan be determined by measuring parity violating electron elastic scattering from\nthe proton at forward and backward angles, and quasi-elastic scattering from the\ndeuteron at backward angles.\nTable 2. Electroweak charge phenomenology. Note the accidental suppression of the weak charge of the proton. The two charges of the proton\nand the neutron are to a large extent interchanged.\nElectromagnetic Charge\nqu\nqd\nQp = 2q u + 1q d\nQn = 1q u + 2q d\n\n+2/3\n−1/3\n+1\n0\n\nWeak Charge\n1 − (8/3) sin2 θW ≈ 1/3\n−1 + (4/3) sin2 θW ≈ −2/3\n1 − 4 sin2 θW = 0.0716\n−1\n\nPresently there exist published data on a combination GsE + ηGSM , with η a\ncoefficient dependent on the four-momentum transfer, from the SAMPLE experi-\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\nvanoers-cospa07\n\nFROM HADRONIC PARITY VIOLATION TO PARITY-VIOLATING ELECTRON...\n\n7\n\nFig. 4. The combination GsE + ηGsM as deduced from the G0, HAPPEX, and PVA4 experiments.\nThe blue-gray band indicates the dominant systematic uncertainty in the G0 results.\n\nment at MIT-Bates [11], the HAPPEX [12] and G0 [13] experiments at JLab, and\nthe PVA4 experiment at MAMI 14 (see Fig. 4). There is consistency between the\nvarious experimental results. The data indicate tiny non-zero values for the combination GsE + ηGSM . The backward angle data on hydrogen and deuterium of the G0\nexperiment are being analyzed, while further measurements are on the schedules of\nJLab (HAPPEX) and of MAMI (PVA4). Extrapolating the forward angle results\ntowards zero four-momentum transfer and zero scattering angle, has provided a factor of five improvement in the knowledge of the neutral weak couplings to the 'up'\nand 'down' quarks [15] compared to the entries in the PDG Handbook of 2006.\n\n3. Tests of the Standard Model\nIn going to lower and lower four-momentum transfer and small scattering angle in\nparity violating electron elastic scattering from the proton, the contributions due to\nthe finite size of the proton become smaller and smaller and one is able to measure\nthen the weak charge of the proton, which constitutes the sum of the weak charges\nof the two 'up' quarks and the 'down' quark. However, the analyzing power becomes\nzero at zero momentum transfer and therefore optimum values of four-momentum\ntransfer and incident energy need to be sought. A high precision measurement of the\nparity violating analyzing power determines the value of sin2 θW and consequently\nthe variation of sin2 θW with four-momentum transfer or the 'running' of sin2 θW .\nThe Standard Model makes a definitive prediction of the 'running' of sin2 θW taking\ninto account electroweak radiative corrections once the value of sin2 θW at the Z 0\npole has been reproduced. As with the QED and QCD couplings, α(μ2 ) and αs (μ2 )\n(which exhibit screening and anti-screening, respectively), in going to higher and\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\n8\n\nvanoers-cospa07\n\nW.T.H. van Oers\n\nFig. 5. The neutral weak effective couplings to the quarks. The dotted contour displays the\nprevious experimental limits (95%) as reported by the PDG in 2006 together with the prediction\nof the Standard Model (black star). The filled ellipse gives the new constraint provided by the\nrecent parity violation electron scattering measurements on hydrogen, deuterium, and helium (at 1\nstandard deviation). The solid contour (95% CL) presents the constraint based on all experimental\nresults. All other experimental limits shown are displayed at 1 standard deviation. The heavy line\nrepresents the anticipated constraint imposed by the Qweak experiment at JLab assuming that\nthe experimental result agrees with the Standard Model.\n\nhigher four-momentum transfer, sin2 θW is an effective parameter also varying with\nμ2 ≈ Q2 . In this case the behaviour with Q2 is more subtle since sin2 θW is a function\nof the electroweak couplings gV l and gAl : (gV l /gAl ) = 1 − 4 sin2 θW . Any deviation\nof sin2 θW from its Standard Model value points to new physics, which needs to\nbe incorporated through a set of new diagrams. In going to very high energies it is\nplausible that the strong, electromagnetic, and weak interactions become the same.\nIn fact extrapolations to very high energies of the three coupling constants show a\n'near-miss' towards having a common intersection (see Fig. 6). Extensions of the\nStandard Model are therefore in order.\nMeasurements at the Z 0 pole have established the value of sin2 θW with great\nprecision although it must be remarked that the leptonic and semi-leptonic values of sin2 θW differ by 3σ. The Standard Model 'running' of sin2 θW has been\ncalculated by Erler, Kurylov, and Ramsey-Musolf [16] in the modified minimal\nsubtraction scheme (see Fig. 7). The theoretical uncertainties in the 'running' of\nsin2 θW are represented by the width of the curve. Hence the interpretability is\ncurrently limited by the normalization of the curve at the Z 0 pole, which is arguably as small as ±0.00016. Note the shift of +0.007 at low Q2 with respect to\nthe Z 0 pole best fit value of 0.23113 ± 0.00015. There have been reported several\nlow energy measurements of the value of sin2 θW . The first one is from an atomic\nparity violation measurement in Cesium [17], which agrees with the Standard Model\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\nvanoers-cospa07\n\nFROM HADRONIC PARITY VIOLATION TO PARITY-VIOLATING ELECTRON...\n\n9\n\nFig. 6. Extrapolation of the reciprocals of the three coupling constants (electromagnetic, weak,\nand strong interaction) to the GUT scale\n\nprediction within 1σ after many refinements detailing the atomic structure of Cesium were introduced. The second one is from a measurement of parity violating\nMøller scattering [18], which also agrees with the Standard Model prediction within\napproximately 1σ. This is at present the better measurement in constraining extensions of the Standard Model. The third one is from a measurement of neutrino\nand antineutrino scattering from iron [19] with a roughly 3σ deviation from the\nStandard Model prediction. For this result there remain various uncertainties in the\ntheoretical corrections that need to be applied (among other two distinct effects\nof charge symmetry breaking in the quark distributions of the nucleons [20]). It\nis quite apparent that much higher precision experiments are needed in order to\nsearch for possible extensions of the Standard Model. One of these is a precision\nmeasurement of the weak charge of the proton, QpW = 1 − 4 sin2 θW , currently being\nprepared for execution starting in 2009 in Hall C of Jefferson Laboratory [21]. The\nextraction of the value of sin2 θW is free of many-body theoretical uncertainties and\nhas the virtue of being able to reach much higher precision (note that at a Q2 value\n2\nof 0.03 (GeV/c) , 1 − 4 sin2 θW equals 0.07 giving a large boost in the precision\nthat may be obtained). The dominant hydronic effects that must be accounted for\nin extracting QpW from the measured analyzing power are contained in form factor\ncontributions which are sufficiently constrained from the recent programs of parity\nviolating electron scattering (at MIT-Bates, JLab, and MAMI) without reliance on\ntheoretical nucleon structure calculations, with the exception possibly of very small\ntwo-photon exchange contributions). The Standard Model evolution of sin2 θW corresponds to a 10 standard deviation effect in the planned Qweak experiment at\nJLab. The Qweak experiment, the first ever precision measurement of the weak\ncharge of the proton and more precise than the existing low energy measurements,\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\n10\n\nvanoers-cospa07\n\nW.T.H. van Oers\n\nFig. 7. Calculated 'running' of the weak mixing angle in the Standard Model, as defined in the\nminimal subtraction scheme. [16] The black points with 1σ error bars show the existing experimental values, while the red points with error bars refer to the 4% QpW measurement in preparation\nand a 2.5% 1 GeV Møller measurement under consideration.\n\nis crucial in testing the Standard Model.\nIn the Qweak experiment the weak charge of the proton, QpW = 1 − 4 sin2 θW ,\nwill be deduced from the parity violating analyzing power, defined as:\nAz = (1/P )[N + − N − ]/[N + + N − ]\nwhere P is the polarization of the longitudinally polarized electron beam and N +\nand N − are the normalized scattering yields. It was shown in [22] that for forward\nangle scattering, where θ → 0, the analyzing power can be written:\n√\nAz = (−GF /(4 2πα))[Q2 QpW + Q4 B(Q2 )]\nHere GF denotes the Fermi coupling constant and α is the fine structure constant.\nOne should note the dependence on P , which requires precision polarimetry, and the\ndependence on the average value of Q2 over the finite acceptance of the magnetic\nspectrometer based detector system for scattered electrons, which requires the averaged value to be determined through specific ancillary control measurements. The\nleading term in the equation is the weak charge of the proton, QpW = 1 − 4 sin2 θW .\nThe quantity B(Q2 ) represents the finite size nucleon structure and contains the\nproton and neutron electromagnetic and weak form factors. The value of B(Q2 )\ncan be determined experimentally by extrapolation from the ongoing program of\nforward angle parity violating electron scattering experiments at higher values of\nQ2 , discussed above, or by specific control measurements. The incident energy and\nthe four-momentum transfer value (mean scattering angle) followed from careful\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\nvanoers-cospa07\n\nFROM HADRONIC PARITY VIOLATION TO PARITY-VIOLATING ELECTRON...\n\n11\n\nFig. 8. Layout of the Qweak experiment. The beam is incident from the left and scattered electrons exit the target and pass through the first collimator, the region-1 GEM detectors, the two\nstage second precision collimator which surrounds the region-2 drift chambers, the toroidal magnet, the shielding wall, the region-3 drift chambers , the trigger scintillators, and finally the ersatz\nquartz Čerenkov detectors. The tracking system chambers and the trigger scintillators, mounted\non rotatable wheels, will be retracted outwards during high current data taking to measure Az .\nThe luminosity monitors, which will be used to monitor target density fluctuations and to provide\nsensitive null tests, are located downstream of the main apparatus very close to the through going\nbeam. Further luminosity monitors are placed just downstream of the LH2 target.\n\nconsiderations of the figure of merit. The optimum values are an incident energy of\n2\n1.165 GeV and a four-momentum transfer of 0.03 (GeV/c) . One can then write for\nthe longitudinal analyzing power:\nAz (0.03 (GeV/c)2 ) = A(QpW ) + A(HadV ) + A(HadA )\n= −0.19ppm − 0.09ppm − 0.01ppm\nwhere the hadronic structure contributions are separated in vector and axial vector\ncomponents. Clearly, the analyzing power is very small (−0.3ppm) and one must\narrive at an overall uncertainty of 2% to meet the precision objective of 0.3% in\nsin2 θW . Consequently, high statistics data are a prerequisite requiring high luminosity and high beam polarization, and an integrating low-noise detector system of\nlarge acceptance. As indicated above, the longitudinal beam polarization must be\nprecisely known as well as the hadronic structure contribution B(Q2 ) to be subtracted from the measured analyzing power (A(HadV ) + A(HadA )) The Qweak\nexperiment requires 2200 hours of data taking of the longitudinal analyzing power\nAz in elastic electron proton scattering at a momentum transfer of 0.03 (GeV/c)2\nwith 180 μA of 85% polarized beam incident on a 0.35 m long LH2 target to determine sin2 θW at the 0.03% level at low Q2 . A layout of the Qweak experiment is\n\n\fOctober 25, 2018 5:41 WSPC/INSTRUCTION FILE\n\n12\n\nvanoers-cospa07\n\nW.T.H. van Oers\n\ngiven in Fig. 8.\nThe Qweak experiment is complementary to a parity violating electron-electron\nscattering experiment, under consideration to be performed at 11 GeV with an upgraded CEBAF at JLab, with an envisaged precision in sin2 θW equal to or better\nthan that from any individual measurement at the Z 0 pole. This implies a considerable reduction in the error of the SLAC Møller experiment. Needless to state:\nthe electroweak radiative corrections to a pure leptonic measurement are more contained. In the search for physics beyond the Standard Model, precision measurements of the weak charge of the proton and of the weak charge of the electron are\nrather complementary.\n4. Acknowledgement\nThe author would like to thank W. Desmond Ramsay for critical reading of the\nmanuscript.\nReferences\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n21.\n22.\n\nN. Tanner, Phys. Rev. 107, 1203 (1957).\nB. Desplanques, J.F. Donoghue, and B.R. Holstein, Ann. Phys. 124, 449 (1980).\nV.M. Dubovik and S.V. Zenkin, Ann. Phys. 172, 100 (1986).\nG.B. Feldman, G.A. Crawford, J. Dubach, B.R. Holstein, Phys. Rev. C43, 863 (1991).\nW.C. Haxton, C.-P. Liu, M.J. Ramsey-Musolf, Phys. Rev. C65, 045502 (2002).\nP.D. Eversheim, et al., Phys. Lett. B256, 11 (1991).\nS. Kistryn et al., Phys. Rev. Lett. 58, 1616 (1987).\nA.R. Berdoz et al. (TRIUMF E497 Collaboration), Phys. Rev. C68, 034004 (2003).\nJ. Carlson et al., Phys. Rev. C65, 035502 (2002).\nM.J. Ramsey-Musolf and S.A. Page, Ann. Rev. Nucl. Part. Sci. 56, 1 (2006).\nT.M. Ito et al., (SAMPLE Collaboration), Phys. Rev. Lett. 92, 102003 (2004);\nD.T. Spayde et al., (SAMPLE Collaboration), Phys. Lett., B583, 79 (2004).\nK.A. Aniol et al., (HAPPEX Collaboration), Phys. Rev. Lett., 96, 022003 (2006);\nK.A. Aniol et al., (HAPPEX Collaboration), Phys. Lett., B635, 275 (2006); A. Acha\net al., (HAPPEX Collaboration), Phys. Rev. Lett., 98, 032301 (2007).\nD.S. Armstrong et al., (G0 Collaboration), Phys. Rev. Lett., 95, 092001 (2005).\nF.E. Maas et al., (PVA4 Collaboration), Phys. Rev. Lett., 93, 022002 (2004);\nF.E. Maas et al., (PVA4 Collaboration), Phys. Rev. Lett., 94, 152001 (2005).\nR.D. Young et al., Phys. Rev. Lett., 99, 122003 (2007).\nJ. Erler, A. Kurylov, and M.J. Ramsey-Musolf, Phys. Rev., D68, 016006 (2003).\nS.C. Bennett and C.E. Wieman, Phys. Rev. Lett., 82, 2484 (1999); C.S. Wood et al.,\nScience, 275, 1759 (1997).\nP.L. Anthony et al., (SLAC E158 Collaboration),Phys. Rev. Lett., 95, 081601 (2005).\nG.P. Zeller et al., (NuTeV Collaboration), Phys. Rev. Lett., 88, 091802 (2002).\nJ.T. Londergan, hep-ph/0408243; Nucl. Phys. Proc. Suppl. 141, 68 (2005).\nR.D. Carlini et al., The Qweak Experiment, JLab Proposal 08-016, Thomas Jefferson\nNational Accelerator Laboratory.\nM.J. Musolf et al., Phys. Rep., 239, 1 (1994).\n\n\f"}