{"id": "http://arxiv.org/abs/0707.0973v1", "guidislink": true, "updated": "2007-07-06T13:59:32Z", "updated_parsed": [2007, 7, 6, 13, 59, 32, 4, 187, 0], "published": "2007-07-06T13:59:32Z", "published_parsed": [2007, 7, 6, 13, 59, 32, 4, 187, 0], "title": "The formation of extreme mass ratio binary stars: a tribute to Eduardo\n  De lgado Donate", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0973%2C0707.2088%2C0707.2381%2C0707.0906%2C0707.4589%2C0707.0589%2C0707.0980%2C0707.4576%2C0707.3643%2C0707.2607%2C0707.4296%2C0707.1411%2C0707.4464%2C0707.3975%2C0707.1740%2C0707.3933%2C0707.3507%2C0707.1088%2C0707.1582%2C0707.1058%2C0707.4096%2C0707.4562%2C0707.3531%2C0707.1641%2C0707.0039%2C0707.1831%2C0707.0819%2C0707.3829%2C0707.2520%2C0707.0064%2C0707.0200%2C0707.2799%2C0707.3562%2C0707.0078%2C0707.1373%2C0707.3959%2C0707.0188%2C0707.4158%2C0707.0812%2C0707.4059%2C0707.3542%2C0707.2059%2C0707.0046%2C0707.1694%2C0707.2198%2C0707.4509%2C0707.4191%2C0707.2560%2C0707.3969%2C0707.3383%2C0707.2790%2C0707.4294%2C0707.1298%2C0707.1471%2C0707.2123%2C0707.1321%2C0707.2263%2C0707.4177%2C0707.1810%2C0707.2802%2C0707.2115%2C0707.4129%2C0707.0879%2C0707.4551%2C0707.0113%2C0707.4418%2C0707.2241%2C0707.3306%2C0707.1330%2C0707.3634%2C0707.4211%2C0707.0418%2C0707.3689%2C0707.1422%2C0707.2236%2C0707.3663%2C0707.1529%2C0707.4338%2C0707.1036%2C0707.2472%2C0707.3775%2C0707.1585%2C0707.2497%2C0707.4184%2C0707.0476%2C0707.0490%2C0707.3425%2C0707.1064%2C0707.0084%2C0707.2640%2C0707.4271%2C0707.4628%2C0707.1941%2C0707.1993%2C0707.1118%2C0707.3137%2C0707.4324%2C0707.1606%2C0707.3855%2C0707.0989%2C0707.3676&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The formation of extreme mass ratio binary stars: a tribute to Eduardo\n  De lgado Donate"}, "summary": "Eduardo Delgado was due to have presented a poster at this meeting on his\nlatest results on the formation of extreme mass ratio binaries. Tragically,\nEduardo was among those killed in a hiking accident in Tenerife earlier this\nyear. As his PhD supervisor, and as a longstanding collaborator, the organisers\nof this meeting kindly invited me to incorporate a report on his most recent\nwork into a more general tribute to his life and work.\n  I will reflect on Eduardo's scientific career, the problems that motivated\nhim and his achievements, focusing particularly on a problem which had\nintrigued us both for several years and on which Eduardo was making important\nprogress at the time of his death. Finally, I will mention the personal\nqualities that Eduardo brought to his work and the acute sense of loss that is\nshared by all those - friends and collaborators - who were privileged to know\nhim.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0973%2C0707.2088%2C0707.2381%2C0707.0906%2C0707.4589%2C0707.0589%2C0707.0980%2C0707.4576%2C0707.3643%2C0707.2607%2C0707.4296%2C0707.1411%2C0707.4464%2C0707.3975%2C0707.1740%2C0707.3933%2C0707.3507%2C0707.1088%2C0707.1582%2C0707.1058%2C0707.4096%2C0707.4562%2C0707.3531%2C0707.1641%2C0707.0039%2C0707.1831%2C0707.0819%2C0707.3829%2C0707.2520%2C0707.0064%2C0707.0200%2C0707.2799%2C0707.3562%2C0707.0078%2C0707.1373%2C0707.3959%2C0707.0188%2C0707.4158%2C0707.0812%2C0707.4059%2C0707.3542%2C0707.2059%2C0707.0046%2C0707.1694%2C0707.2198%2C0707.4509%2C0707.4191%2C0707.2560%2C0707.3969%2C0707.3383%2C0707.2790%2C0707.4294%2C0707.1298%2C0707.1471%2C0707.2123%2C0707.1321%2C0707.2263%2C0707.4177%2C0707.1810%2C0707.2802%2C0707.2115%2C0707.4129%2C0707.0879%2C0707.4551%2C0707.0113%2C0707.4418%2C0707.2241%2C0707.3306%2C0707.1330%2C0707.3634%2C0707.4211%2C0707.0418%2C0707.3689%2C0707.1422%2C0707.2236%2C0707.3663%2C0707.1529%2C0707.4338%2C0707.1036%2C0707.2472%2C0707.3775%2C0707.1585%2C0707.2497%2C0707.4184%2C0707.0476%2C0707.0490%2C0707.3425%2C0707.1064%2C0707.0084%2C0707.2640%2C0707.4271%2C0707.4628%2C0707.1941%2C0707.1993%2C0707.1118%2C0707.3137%2C0707.4324%2C0707.1606%2C0707.3855%2C0707.0989%2C0707.3676&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Eduardo Delgado was due to have presented a poster at this meeting on his\nlatest results on the formation of extreme mass ratio binaries. Tragically,\nEduardo was among those killed in a hiking accident in Tenerife earlier this\nyear. As his PhD supervisor, and as a longstanding collaborator, the organisers\nof this meeting kindly invited me to incorporate a report on his most recent\nwork into a more general tribute to his life and work.\n  I will reflect on Eduardo's scientific career, the problems that motivated\nhim and his achievements, focusing particularly on a problem which had\nintrigued us both for several years and on which Eduardo was making important\nprogress at the time of his death. Finally, I will mention the personal\nqualities that Eduardo brought to his work and the acute sense of loss that is\nshared by all those - friends and collaborators - who were privileged to know\nhim."}, "authors": ["C. J. Clarke"], "author_detail": {"name": "C. J. Clarke"}, "author": "C. J. Clarke", "arxiv_comment": "To appear in Pathways through an eclectic Universe, J. H. Knapen, T.\n  J. Mahoney, and A. Vazdekis (Eds.), ASP Conf. Ser., 2007", "links": [{"href": "http://arxiv.org/abs/0707.0973v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.0973v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.0973v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.0973v1", "journal_reference": null, "doi": null, "fulltext": "**FULL TITLE**\nASP Conference Series, Vol. **VOLUME**, **YEAR OF PUBLICATION**\n**NAMES OF EDITORS**\n\nThe formation of extreme mass ratio binary stars: a\ntribute to Eduardo Delgado Donate\n\narXiv:0707.0973v1 [astro-ph] 6 Jul 2007\n\nC. J. Clarke\nInstite of Astronomy, Cambridge, CB3 OHA, U.K.\nAbstract.\nEduardo Delgado was due to have presented a poster at this\nmeeting on his latest results on the formation of extreme mass ratio binaries.\nTragically, Eduardo was among those killed in a hiking accident in Tenerife\nearlier this year. As his PhD supervisor, and as a longstanding collaborator,\nthe organisers of this meeting kindly invited me to incorporate a report on\nhis most recent work into a more general tribute to his life and work. I will\nreflect on Eduardo's scientific career, the problems that motivated him and his\nachievements, focusing particularly on a problem which had intrigued us both\nfor several years and on which Eduardo was making important progress at the\ntime of his death. Finally, I will mention the personal qualities that Eduardo\nbrought to his work and the acute sense of loss that is shared by all those friends and collaborators - who were privileged to know him.\n\n1.\n\nCambridge days: predictions and puzzles in multiple star formation\n\nEduardo came to Cambridge from his native Tenerife in 2000, in order to work\non hydrodynamic (SPH) star formation simulations under my supervision. He\nwas funded by an E.U. PhD studentship as part of the 'Young Stellar Cluster'\nNetwork. Anyone who has been involved in these Networks will know that it\nis not always easy to find students of suitable calibre to fill these posts, given\ntheir restrictive nationality and residence requirements, and can therefore imagine my delight at receiving such a strong application from Eduardo. He went\non to fulfil my high expectations, quickly developing into a fine numericist and\nastrophysicist. (I should add that I was often struck by the fact that Eduardo's\nwritten English was far more eloquent than anything that his British contemporaries could manage - although I'm afraid that this says something not only\nabout Eduardo but also about the British educational system!)\nEduardo arrived in Cambridge when Matthew Bate was still a postdoc there\nand Matthew was a great help to Eduardo in helping him to master his SPH\ncode. This was an exciting time for Eduardo to be working in numerical star\nformation, as this was the time that Matthew was producing the first turbulent\nfragmentation calculations which have generated so much interest (and controversy!) ever since. It was clearly going to be a challenge for Eduardo to do\nanything in this field which was going to have a distinct impact. I think the\ncollection of well cited papers that Eduardo produced during his thesis shows\nthat he met this challenge most successfully.\nEduardo became known in the field for his series of turbulent fragmentation\ncalculations which explored the production of multiple star systems and brown\ndwarfs in small N ensembles. My own vote for the part of his thesis that will be\n1\n\n\f2\n\nClarke\n\nFigure 1.\nExamples of some of the system architectures of complex multiple\nstar systems formed in the hydrodynamical simulations of Delgado et al 2004.\nThe numbers refer to separations in A.U..\n\nhis biggest contribution to the field would go to his calculations which were the\nfirst to make predictions about the properties of higher order multiple systems\n(see some of the complex system architectures generated in Figure 1). He was\nable to do this because rather than focusing his computational effort on system\nscale (as Matthew Bate did with his 50 solar mass calculation), Eduardo followed\nsmall (5 solar mass) clouds and - in compensation - was able to follow the\ncalculation for much longer. Thus Eduardo's simulations could follow even wide\nsystems to the point of dynamical stability. Evidently this is important, not only\nbecause wide binaries are numerous in nature (half of all binaries with solar type\nprimaries are wider than 30 A.U.) but because in this way one can start to make\npronouncements about higher order multiples (which necessarily involve wide,\nas well as close, components).\nThus Eduardo entered uncharted waters in terms of simulations (and indeed his paper on this, Delgado et al 2004 is still the only one on this topic in\nexistence). Moreover, the characterisation of multiple star systems is far from\ncomplete observationally, as it is a laborious task to collate complete statistics\non components with a wide dynamic range of separations (e.g. Tokovinin et al\n2006). Indeed, the motivation for such observational studies has always been\nundermined by the fact that - until Eduardo's work - there were no theoretical\npredictions with which to compare the data.\n\n\fEduardo Delgado tribute\n\n3\n\nThis brings me to one of Eduardo's most important characteristics as a\nscientist, that in addition to being technically accomplished as a numericist, he\nhad a strong interest in - and respect for - observations. One would never hear\nEduardo implying that observations much be wrong if they contradicted his simulations - or that observers should simply go and 'look harder'. He understood,\nbetter than most, that it's actually the areas of disagreement that illuminate\nyour calculations. And, moreover, he understood that the range of diagnostic\ninformation that is contained in multiple star statistics would ultimately provide\na very stringent - arguably the most stringent - test of star formation theories.\nThus Eduardo became intrigued by an obvious area of discrepancy between\nobservations and all star formation simulations. In the simulations, all the binaries were within a factor of two of being of unit mass ratio (with the exception\nof a few weakly bound very low mass 'outliers' at large separations). Moreover,\nthis result extended to every level of the hierarchy (i.e. in a triple, a nearly\nequal mass binary would be bound to a third star with mass nearly equal to\nthe binary). Evidently nature does not work like that! It is true that there\nare categories of binaries that favour more nearly equal masses, arguably OB\nstars (Garcia & Mermilliod 2001), very low mass binaries (Bouy et al 2003) and\nshort period spectroscopic binaries among solar type stars (Mazeh et al 1992).\nHowever, for the bulk of solar type binaries, the median mass ratio is ∼ 0.4\n(Duquennoy & Mayor 1991), a result which - given that it is based partly on\npairs from the visual binary literature which are almost certainly selectively incomplete at low mass ratios - must, if anything, underestimate the incidence of\npairs with very disparate masses.\nEarly in 2003, Eduardo started writing a paper with me, alas never to be\npublished, entitled 'On the problem of forming extreme mass ratio binaries,.\nI told him to start by writing a few pages setting up the problem (which he\ndid) and then, by the time he'd written that, his simulations would have run to\nthe point where he could unveil the solution (or at any rate a solution) in the\nconcluding sections. But the latter proved to be impossible. None of the fixes\nto initial conditions which he attempted (such as adjusting the power spectrum\nof the initial velocity field or changing the geometry) were ultimately successful.\nHe would excitedly tell me that yes, he'd managed to make a binary with q of\n0.1, only to return a week later to tell me that, no, it had now evolved to q of\n0.7.... Thus it turned out that the problem was not the initial creation of such\nsystems, but the effect of continued accretion onto the protobinary, which drove\nup the mass ratio.\nIt has been known since at least the work of Artymowicz 1981 (and note\nthat Eduardo went on to spend two years in Stockholm working with Pawel\nArtymowicz as a postdoc, although never on this problem) that accretion of gas\nwhose specific angular momentum exceeds that of the binary leads to preferential\naccretion onto the secondary. This commonsense result, which was apparent in\nthese early ballistic calculations and was backed up by the subsequent SPH\nsimulations of Bate & Bonnell 1997 and Bate 2000, occurs simply because the\nsecondary's Roche lobe is further from the system's centre of mass, and is thus\nmore likely to intercept high angular momentum material. Since in the case\nof any plausible binary formation scenario, higher angular momentum material\nwill fall in later, the binary mass ratio, q, should therefore rise with time.\n\n\f4\n2.\n\nClarke\nNumerical controversy: latest results\n\nWhile Eduardo and I abandonned this question, discouraged, (and Eduardo\ntook up a position in Stockholm where he worked mainly on codes for planet\nformation), there meanwhile appeared the paper of Ochi, Sugimoto & Hanawa\n2005. This claimed, using a grid based code, that actually material of high\nspecific angular momentum is preferentially accreted on to the binary primary\nand thus that the mass ratio should fall. This study did not contradict the\nwidely acknowledged result that the flow preferentially enters the secondary's\nRoche lobe, but argued instead that, after half an orbit around the secondary,\nit crosses via the L1 point into the primary's Roche lobe and is then accreted.\nOchi et al conjectured that the failure of SPH calculations to demonstrate this\nbehaviour stemmed from the excessively viscous nature of SPH, which might\ncause the SPH particles to spiral in sufficiently, in half an orbit, so that they\ncould avoid the L1 region. In the same spirit, proponents of SPH countered that\nOchi et al's flows were too warm (with sound speed of 0.25× the orbital velocity\nof the binary) and that this caused artificial acceleration of the flow through\nthe L1 point. Clearly these issues had to be investigated further, using both\nLagrangian and Eulerian codes. At the time of his death, Eduardo was close to\ncompleting a suite of high resolution SPH calculations which were beginning to\nilluminate the problem and whose results I summarise below.\nHis repetition, at higher resolution, of the SPH calculation of Bonnell &\nBate 1997 (which modeled accretion onto a protobinary of a flow with fixed\nspecific angular momentum ) demonstrated that the rate of increase of q is indeed\nsomewhat resolution dependent and is over-estimated at low resolution (about\n5 × 104 particles in the discs) compared with the highest resolution (a hundred\ntimes more particles, which has achieved numerical convergence) by about a\nfactor two. This can be traced to the fact that at low resolution, particles in\nthe outer part of the primary's Roche lobe are not behaving in a fuly fluid-like\nmanner and, through precession of their elliptical orbits, are able to tip back\nthrough the L1 point into the secondary's Roche lobe. Nevertheless, q increases\n(for this value of specific angular momentum of the flow) at all resolutions, in\ncontrast to the results of Ochi et al.\nEduardo found that at high resolution, the shocks are well delineated (see\nleft hand panel of Figure 2) and, indeed, that the Jacobi constant (i.e. the\nBernoulli function in the co-rotating frame) is well conserved along streamlines\nexcept in shocks. This result goes against the hypothesis of Ochi et al that the\nSPH results are driven by artificial viscosity in the secondary's disc flow, since\nunder these cirumstances the action of artifical viscosity should cause changes\nin the Jacobi constant, even away from shocks. Crucially, however, the shock\ngeometry is quite different in Eduardo's simulations compared with those of\nOchi et al. In the SPH calculation, loosely bound material in the secondary's\nRoche lobe encounters a shock with material flowing in from the direciton of\nthe primary (see dense structure to the East of the secondary in left hand panel\nof Figure 2) and it is dissipation in this shock which prevents material flowing\nthrough L1 and into the primary's Roche lobe. This shock is simply not there in\nOchi et al's caclulation, so that material entering via L2 retains enough energy\nto smoothly transit through L1.\n\n\fEduardo Delgado tribute\n\n5\n\nFigure 2. Density and flow structure in the co-rotating frame around an\naccreting proto-binary, contrasting a cold three dimensional simulation (left)\nand a warm two dimensional simulation (right). The secondary is to the left.\nNote the pronounced shock to the East of the secondary in the left hand panel.\nUnpublished simulations by E. Delgado\n\n.\nThus while both simulations are apparently self-consistent, given the location of the shocks, one has to enquire why the shock morphology is so different\nin the two cases. One possibility is that - although the SPH and Eulerian simulations are matched in terms of specific angular momentum of the accretion flow\nand mass ratio of the binary - there are two potentially important differences.\nFirstly, the Eulerian calculation is much warmer (about a factor 25 in temperature). Secondly, it is strictly two dimensional whereas the SPH calculation although highly flattened near the binary - is fully three dimensional and introduces particles on the surface of a sphere at large radius. An indication that\none, or both, of these effects may be important is provided by one of Eduardo's\nsimulations which mimicked as closely as possible the precise conditions of Ochi\net al, being both 2D and warm. The right hand panel of Figure 2 demonstrates\nthat the shock has in this case moved away from the secondary's Roche lobe, in\nqualitative agreement with the flow morphology of Ochi et al. Although quantitative agreement between the SPH and Eulerian codes is not achieved even here,\nthe sign of the change is encouraging. This shift in flow morphology is reflected\nin a change in the relative accretion rates on to the primary and secondary.\nAlthough q still increases in these warm 2D SPH calculations, q̇ is reduced by\nan order of magnitude compared with the cold 3D calculation.\nThis was the situation at the time of Eduardo's death and there is evidently\nstill much for his collaborators to do. We now suspect that gas temperature\n\n\f6\n\nClarke\n\nand/or flow dimensionality are important determinants of the shock morphology,\nand we must now discover which of these two effects is the critical one. One\nthen has to judge which set of conditions is more realistic. Ultimately, this will\ntell us whether the old 'simple' idea is correct - i.e. that the flow simply enters\nthe secondary's Roche lobe and remains therein - or whether the more complex\noutcome of Ochi et al - involving flow between Roche lobes - is closer to the\ntruth.\nAll this has implications for the extreme mass ratio binary problem which\nEduardo had been trying to solve for years. If the result is closer to that of\nOchi et al, then this could solve the problem at a stroke. If the results instead\nsupport the old SPH results, then the puzzle remains (although if low resolution\nsimulations have over-estimated the magnitude of the growth of q, then binaries\nmay remain at low q, even if the sign of q̇ is positive). Otherwise, one has to\nthink harder about how to prevent the infall of gas with high specific angular\nmomentum onto protobinaries. Although it is tempting to invoke feedback for\nthis, it is not obvious why this should be so important in the low mass binaries\nwhich we are largely trying to explain.\n3.\n\nEduardo the person\n\nHaving talked about the problems that motivated Eduardo as a scientist, it\nleadss me to how much can one discern of Eduardo the person in all this? An\nunexpected death leads one to analyse what one saw of a person in the daily\ncontacts of studentship and collaboration. Eduardo was always calm, always\ngentle, always attentive. He was never arrogant, never distorted the problem at\nhand, or his relations with those around him, by the obtrusion of his own ego.\nHe commanded the respect of all those who came into contact with him through\nthis obvious intellectual and personal integrity. He was a joy to work with.\nI see great continuity between those characteristics as a collaborator and the\npersonal testimonies from his friends, many of which are movingly collected on\nhis blogspot (http://eduardo-delgado.blogspot.com/) I was aware that Eduardo\nwas very popular with his peers in Cambridge and that he belonged to a big\ncrowd of friends of all nationalities whose joyful social life never got in the way\nof Eduardo's scientific activities. But these messages - and the evidence of the\nconversations I have had with so many - speak of a very special warmth of\naffection and regard. Unfortunately I can only dimly decipher the majority\nin Spanish but they clearly tell the same story as those I can read (in Italian\nand English). So many speak of the gentleness of his eyes, the warmth of his\nfriendship, his calmness (one Italian friend exclaimed 'You even played football\nwith calm' ( incredible!)). He was, to put it simply, much loved.\nAll this is very particular to Eduardo, but I should end on a note that\nperhaps has relevance to all those gathered for this meeting and to astronomers\neverywhere. In the last months of his life, Eduardo was particularly happy.\nA former Cambridge colleague, who stayed with him on an observing run at\nChristmas time, told me 'You know, Edu was just so happy when I last saw\nhim'. He had everything he dreamed of, living in the island he loved, starting new\nprojects in his new postdoc with Casiana Munoz, also continuing his independent\nresearch (he felt he was so close to cracking the extreme mass ratio binary\n\n\fEduardo Delgado tribute\n\n7\n\nproblem). We're perhaps not all in one of those special moments in life when\neverything seems to be working, but I reckon that if any one of us suffered the\nsame awful and random misfortune as Eduardo, then they would be able to say\nof us that we'd spent our lives doing what we loved. This is a rare privilege.\nSo, in keeping with the celebratory mood of this conference, let us recall that,\nwhile mourning Eduardo no less, we can also celebrate a life spent - like ours in doing something we believe to be intrinsically valuable. To do this in a spirit\nof calm and integrity was Eduardo's gift. We miss him immensely.\n\nFigure 3.\n\nEdu emanating his characteristic calm\n\nReferences\nArtymowicz, P. 1983 Acta Astron. 33,223\nDelgado-Donate, E. J., Clarke, C. J., Bate, M. R. & Hodgkin, S. T. 2004, MNRAS\n351,617\nDuquennoy, A. & Mayor, M. 1991, A & A 248,485\nBate, M. R. 2000, MNRAS 314,33\nBate, M. R & Bonnell, I. A. 1997, MNRAS 285,33\nBouy, H., Brandner, W., Martin, E., Delfosse, X., Allard, F. & Basri, G. 2003, AJ\n126,1526\n\n\f8\n\nClarke\n\nMazeh T., Goldberg D., Duquennoy A., Mayor M. 1992, ApJ, 401, 265\nGarcia, B. & Mermilliod, J. 2001, A & A 368,122\nOchi, Y., Sugimoto, K. & Hanawa, T. 2005, ApJ 623,922\nTokovinin, A., Thomas, S., Sterzik, M. & Udry, S. 2006, A & A 450,681\n\n\f"}