{"id": "http://arxiv.org/abs/0911.2946v2", "guidislink": true, "updated": "2010-03-01T17:56:38Z", "updated_parsed": [2010, 3, 1, 17, 56, 38, 0, 60, 0], "published": "2009-11-16T03:58:42Z", "published_parsed": [2009, 11, 16, 3, 58, 42, 0, 320, 0], "title": "Non-minimal coupling of photons and axions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.3845%2C0911.0721%2C0911.2567%2C0911.2237%2C0911.4346%2C0911.3810%2C0911.2582%2C0911.1260%2C0911.5237%2C0911.2735%2C0911.5117%2C0911.1180%2C0911.0797%2C0911.0707%2C0911.3068%2C0911.5298%2C0911.2885%2C0911.3734%2C0911.4691%2C0911.1772%2C0911.0777%2C0911.4311%2C0911.1977%2C0911.1196%2C0911.1110%2C0911.4936%2C0911.1603%2C0911.1318%2C0911.2225%2C0911.3408%2C0911.5413%2C0911.4465%2C0911.1486%2C0911.4479%2C0911.4995%2C0911.4790%2C0911.4959%2C0911.0025%2C0911.5309%2C0911.0510%2C0911.2736%2C0911.4229%2C0911.5645%2C0911.4457%2C0911.2581%2C0911.1610%2C0911.4304%2C0911.4770%2C0911.5496%2C0911.2367%2C0911.4890%2C0911.3316%2C0911.3943%2C0911.0787%2C0911.2386%2C0911.0382%2C0911.2501%2C0911.1813%2C0911.2035%2C0911.5314%2C0911.0789%2C0911.1986%2C0911.2694%2C0911.1088%2C0911.0313%2C0911.3123%2C0911.3903%2C0911.2250%2C0911.3158%2C0911.1830%2C0911.4854%2C0911.2266%2C0911.2160%2C0911.5426%2C0911.2946%2C0911.1336%2C0911.2470%2C0911.4809%2C0911.0239%2C0911.1734%2C0911.5680%2C0911.2892%2C0911.1836%2C0911.1937%2C0911.5138%2C0911.0301%2C0911.5532%2C0911.4235%2C0911.1034%2C0911.2847%2C0911.2630%2C0911.2762%2C0911.1909%2C0911.2602%2C0911.4221%2C0911.4152%2C0911.0119%2C0911.3331%2C0911.2974%2C0911.2780%2C0911.0433&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-minimal coupling of photons and axions"}, "summary": "We establish a new self-consistent system of equations accounting for a\nnon-minimal interaction of gravitational, electromagnetic and axion fields. The\nprocedure is based on a non-minimal extension of the standard\nEinstein-Maxwell-axion action. The general properties of a ten-parameter family\nof non-minimal linear models are discussed. We apply this theory to the models\nwith pp-wave symmetry and consider propagation of electromagnetic waves\nnon-minimally coupled to the gravitational and axion fields. We focus on exact\nsolutions of electrodynamic equations, which describe quasi-minimal and\nnon-minimal optical activity induced by the axion field. We also discuss\nempirical constraints on coupling parameters from astrophysical birefringence\nand polarization rotation observations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.3845%2C0911.0721%2C0911.2567%2C0911.2237%2C0911.4346%2C0911.3810%2C0911.2582%2C0911.1260%2C0911.5237%2C0911.2735%2C0911.5117%2C0911.1180%2C0911.0797%2C0911.0707%2C0911.3068%2C0911.5298%2C0911.2885%2C0911.3734%2C0911.4691%2C0911.1772%2C0911.0777%2C0911.4311%2C0911.1977%2C0911.1196%2C0911.1110%2C0911.4936%2C0911.1603%2C0911.1318%2C0911.2225%2C0911.3408%2C0911.5413%2C0911.4465%2C0911.1486%2C0911.4479%2C0911.4995%2C0911.4790%2C0911.4959%2C0911.0025%2C0911.5309%2C0911.0510%2C0911.2736%2C0911.4229%2C0911.5645%2C0911.4457%2C0911.2581%2C0911.1610%2C0911.4304%2C0911.4770%2C0911.5496%2C0911.2367%2C0911.4890%2C0911.3316%2C0911.3943%2C0911.0787%2C0911.2386%2C0911.0382%2C0911.2501%2C0911.1813%2C0911.2035%2C0911.5314%2C0911.0789%2C0911.1986%2C0911.2694%2C0911.1088%2C0911.0313%2C0911.3123%2C0911.3903%2C0911.2250%2C0911.3158%2C0911.1830%2C0911.4854%2C0911.2266%2C0911.2160%2C0911.5426%2C0911.2946%2C0911.1336%2C0911.2470%2C0911.4809%2C0911.0239%2C0911.1734%2C0911.5680%2C0911.2892%2C0911.1836%2C0911.1937%2C0911.5138%2C0911.0301%2C0911.5532%2C0911.4235%2C0911.1034%2C0911.2847%2C0911.2630%2C0911.2762%2C0911.1909%2C0911.2602%2C0911.4221%2C0911.4152%2C0911.0119%2C0911.3331%2C0911.2974%2C0911.2780%2C0911.0433&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We establish a new self-consistent system of equations accounting for a\nnon-minimal interaction of gravitational, electromagnetic and axion fields. The\nprocedure is based on a non-minimal extension of the standard\nEinstein-Maxwell-axion action. The general properties of a ten-parameter family\nof non-minimal linear models are discussed. We apply this theory to the models\nwith pp-wave symmetry and consider propagation of electromagnetic waves\nnon-minimally coupled to the gravitational and axion fields. We focus on exact\nsolutions of electrodynamic equations, which describe quasi-minimal and\nnon-minimal optical activity induced by the axion field. We also discuss\nempirical constraints on coupling parameters from astrophysical birefringence\nand polarization rotation observations."}, "authors": ["Alexander B. Balakin", "Wei-Tou Ni"], "author_detail": {"name": "Wei-Tou Ni"}, "author": "Wei-Tou Ni", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/27/5/055003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0911.2946v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.2946v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "31 pages, 2 Tables; replaced with the final version published in\n  Classical and Quantum Gravity", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.2946v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.2946v2", "journal_reference": "Class.Quant.Grav.27:055003,2010", "doi": "10.1088/0264-9381/27/5/055003", "fulltext": "NON-MINIMAL COUPLING OF PHOTONS AND AXIONS\n\nAlexander B. Balakin1\n\narXiv:0911.2946v2 [gr-qc] 1 Mar 2010\n\nKazan State University, Kremlevskaya street 18, 420008, Kazan, Russia,\nand\nWei-Tou Ni2\nCenter for Gravitation and Cosmology, Purple Mountain Observatory,\nChinese Academy of Sciences, Nanjing, 210008, People's Republic of China, and\nNational Astronomical Observatories, Chinese Academy of Sciences,\nBeijing, 100006, People's Republic of China\n\nAbstract We establish a new self-consistent system of equations accounting for a nonminimal interaction of gravitational, electromagnetic and axion fields. The procedure is based on\na non-minimal extension of the standard Einstein-Maxwell-axion action. The general properties of\na ten-parameter family of non-minimal linear models are discussed. We apply this theory to the\nmodels with pp-wave symmetry and consider propagation of electromagnetic waves non-minimally\ncoupled to the gravitational and axion fields. We focus on exact solutions of electrodynamic equations, which describe quasi-minimal and non-minimal optical activity induced by the axion field.\nWe also discuss empirical constraints on coupling parameters from astrophysical birefringence and\npolarization rotation observations.\nPACS numbers: 04.20.-q, 04.40.-b, 04.40.Nr\nKey words: Non-minimal interactions, axion field, birefringence, polarization rotation\n1\n2\n\ne-mail: Alexander.Balakin@ksu.ru\ne-mail: wtni@pmo.ac.cn\n\n1\n\n\f1\n\nIntroduction\n\nThe topic of pseudoscalar-photon interaction and axion theory is a very attractive branch\nof modern physics, and there are two reasons for this interest. First of all, it is an interest\nto axions as hypothetical particles, which appear in the context of the strong CP-violation\nproblem and spontaneous breaking of symmetry in the early universe (see, e.g., [1, 2] for\nreview and basic references), and which are considered as one of the Dark Matter candidates\n(see, e.g., [3, 4] and references therein). The direct detection of the axions is formulated to\nbe one of goals of modern experiments in High Energy Physics (see, e.g., [5]).\nThe second reason is connected with an interest to the theoretical concept of pseudoscalar\nfield φ (axion field) associated with pseudoscalar-photon interaction. This occurs first in the\nstudy of electromagnetism and equivalence principles [6, 7, 8]. This concept is a base for the\nso-called Einstein-Maxwell-axion theory, Einstein-Maxwell-dilaton-axion theory and their\ngeneralizations (see, e.g., [6]-[18]).\nOne of the most significant item in the theory of axion fields is the problem of interaction of electromagnetic and pseudoscalar (axion) fields, the well-known application of the\nphoton-axion coupling being the effect of polarization rotation [6, 19, 20] in the observations of Cosmic Microwave Background (CMB) radiation (see, e.g., [21, 22] and references\ntherein). Several groups are working on the experiments with vacuum birefringence and\nvacuum dichroism to look for the photon-axion coupling [23]-[26].\nIt is well-known that the standard effect of optical activity induced by the axion field\ntakes place when the pseudoscalar field φ has a non-vanishing four-gradient [8, 27], i.e. when\n∂k φ 6= 0. This effect can be described in the framework of classical electrodynamics in terms\nof linear constitutive equations [8, 27, 28], linking an excitation tensor H ik and the Maxwell\ntensor Fmn . When the pseudo-scalar field is constant, φ = φ0 , and thus does not contribute\nto the vacuum Maxwell equations, new possibilities for the axion-photon interaction exist:\none of them is discussed in the work [29], which focuses on reflection and transmission of\na wave at an interface between two media. We discuss here another possibility related to\nnon-minimal optical activity induced by photon-axion coupling, which also can occur in the\ncase of a constant pseudoscalar field.\nThe standard description of the non-minimal coupling of the gravitational field with\nscalar, electromagnetic and gauge fields is based on the introduction of specific cross-terms\ninto the Lagrangian, which contain the Riemann tensor Rikmn , the Ricci tensor, Rkn , and\nRicci scalar, R, on the one hand, and the corresponding fields and their derivatives, on the\nother hand. The theory of non-minimal coupling is elaborated in detail for the scalar field\n(real and complex fields, as well as Higgs multiplets)(see, e.g., [30] for review and references).\nSpecial attention in these investigations is focused on two models, the first of them has the\nξRΦ2 coupling, and the second has the so-called non-minimal derivative coupling [31]-[33].\nThe study of a non-minimal coupling of gravity with electromagnetic field started in [34] and\nthis theory has been developed by many authors (see, e.g., [35]-[48]). The generalization of\nthe idea of non-minimal interactions to the case of torsion coupled to the electromagnetic\nfield has been made in [49, 50]. Exact solutions in the framework of non-minimal EinsteinYang-Mills and Einstein-Yang-Mills-Higgs theories are discussed in [51]-[56].\nIn this paper we focus on the non-minimal generalization of the Einstein-Maxwell-axion\n2\n\n\ftheory. The derivation of master equations is fulfilled in analogy with non-minimal scalar\nfield theory and non-minimal electromagnetic field theory. The items which are specific for\nthe pseudoscalar field theory are discussed in detail. The paper is organized as follows. In\nsection 2, we discuss a formalism of non-minimal Einstein-Maxwell-axion theory; a brief\nintroduction to the minimal theory is given in subsection 2.1; the non-minimal extension of\nthe Lagrangian and the derivation of the corresponding master equations are presented in\nsubsection 2.2; subsection 2.3 contains the description of the model in terms of constitutive\nequations. In section 3 we apply the obtained master equations to the models with pp-wave\nsymmetry and discuss examples of the exact solutions for the gravitational, pseudoscalar\nand electromagnetic fields. In section 4 we consider the propagation of test electromagnetic\nwaves coupled to pseudoscalar field in the pp-wave background and focus on the effect of\nnon-minimal optical activity induced by the axion field. In section 5 we summarize the\nresults.\n\n2\n2.1\n\nNon-minimal coupling of gravitational,\nelectromagnetic and axion fields\nMinimal model as a starting point\n\nIn order to explain the novelty of our approach, let us first introduce the case of gravitationalelectromagnetic-axion fields minimally coupled. The simplest minimal action functional is\nS(M) =\n\nZ\n\n\u0015\n√ \u0014 R 1 mn\n1 ∗mn\nmn\n2\n2\nd x −g\n+ F Fmn + φF\nFmn −g ∇m φ∇n φ+m(A) φ ,\nκ 2\n2\n4\n\n(1)\n\nwhere g is the determinant of the metric tensor gik , ∇m is a covariant derivative, R is the\nRicci scalar. The Maxwell tensor Fmn is given by\nFmn ≡ ∇m An − ∇n Am ,\n\n(2)\n\nwhere Am is an electromagnetic potential four-vector; F ∗mn ≡ 21 ǫmnpq Fpq is the tensor dual\nto Fpq ; ǫmnpq ≡ √1−g E mnpq is the Levi-Civita tensor, E mnpq is the absolutely antisymmetric\nLevi-Civita symbol with E 0123 = 1. The dual Maxwell tensor satisfies the condition\n∇k F ∗ik = 0 .\n\n(3)\n\nThe first term in the brackets is the Hilbert-Einstein Lagrangian; the second term is the\nstandard Lagrangian for an electromagnetic field; the third term is the pseudoscalar-photon\ninteraction Lagrangian [6, 7, 8]; the fourth and fifth terms constitute the pseudoscalar Lagrangian.\nThe symbol φ stands for a pseudoscalar field; this quantity is dimensionless providing the\nterms 21 F mn Fmn and 12 φF ∗mn Fmn to have the same dimensionality. The axion field itself, Φ,\nis considered to be proportional to this quantity Φ = Ψ0 φ with a constant Ψ0 . In order to\nsimplify the calculations we replace the potential of electromagnetic field Ai with the term\n8πGΨ2\nAi /Ψ0 , and consider the constant κ to be equal to κ = c4 0 . The term m(A) is proportional\n3\n\n\fto a (hypothetical) mass of an axion, m(A) = 2πc m(axion) /h; h is the Planck constant. We\nuse the signature + − −−.\nThe variation of the action functional (1) with respect to the four-vector potential Ai\ngives the minimal (vacuum) Maxwell equations\ni\n\nh\n\n∇k F ik + φF ∗ik = 0 ,\n\n(4)\n\n∇k F ik + F ∗ik ∇k φ = 0\n\n(5)\n\nwhich can be transformed into\n\ndue to the equation (3). Equivalently, equation (4) can be written as\n∇k H ik = 0 ,\n\nH ik = C ikmn Fmn ,\n\n(6)\n\nwhere C ikmn is the constitutive tensor\nC ikmn =\n\n\u0011\n1 \u0010 im kn\n1\ng g − g in g km + φǫikmn ,\n2\n2\n\n(7)\n\nand H ik is the excitation tensor [8, 27]. Minimal equations for the axion field can be obtained\nfrom the action (1) by the variation with respect to the pseudoscalar field φ, yielding\ni\n1\n∇k ∇k +m2(A) φ = − F ∗mn Fmn .\n4\n\nh\n\n(8)\n\nMinimal equations for the gravitational field obtained by the variation of (1) with respect\nto metric g ik are\nh\ni\n1\n(EM)\n(A)\nRik − Rgik = κ Tik + Tik .\n(9)\n2\n(EM)\n\nHere Tik\n\nis the standard stress-energy tensor of pure electromagnetic field:\n(EM)\n\nTik\n\n1\n≡ gik F mn Fmn − Fim Fk m ,\n4\n\n(10)\n\n(A)\n\nand Tik , given by\ni\n1 h\n(A)\nTik ≡ ∇i φ∇k φ − gik ∇m φ∇m φ − m2(A) φ2 ,\n2\n\n(11)\n\nis the stress-energy tensor of the pseudoscalar (axion) field φ.\n\n2.2\n2.2.1\n\nNon-minimal extension of the model\nLagrangian and non-minimal susceptibilities\n\nWe consider the total action functional as a sum of minimal and non-minimal contributions:\nS = S(M) + S(NM) ,\n4\n\n(12)\n\n\fwhere S(M) is given by (1). The non-minimal contribution S(NM) is, generally, a nonlinear\nfunction of all independent invariants containing Riemann tensor Riklm and the dual ones\n∗\n∗\nRiklm , Riklm\n, Ricci tensor Rmn and Ricci scalar R in convolutions with the Maxwell tensor\nand its dual, as well as with derivatives of pseudoscalar field. The set of such invariants for\npure electromagnetic field was discussed in [47]; then it was supplemented by the invariants\ncontaining scalar Higgs fields in [53, 54, 56]. For the axion field, this set of invariants can be\nconstructed analogously, and here we focus only on the following Lagrangian linear in the\ncurvature:\nS(NM) =\n\nZ\n\n\u001b\n√ \u001a 1 ikmn\n1\n∗\nmn\n2\n.\nd4 x −g\nR\nFik Fmn + χikmn\nφ\nF\nF\n−R\n∇\nφ∇\nφ+η\nRφ\nik mn\nn\n(A)\n(A) m\n2\n2 (A)\n\n(13)\n\nThe quantity Rikmn is a non-minimal three-parameter susceptibility tensor [47], which has\na form\nRikmn = q1 Rg ikmn + q2 Rikmn + q3 Rikmn ,\n(14)\nwhere\n\n1\ng ikmn ≡ (g im g kn −g in g km) ,\n(15)\n2\n1\n(16)\nRikmn ≡ (Rim g kn −Rin g km +Rkn g im −Rkm g in ) .\n2\nThe constants q1 , q2 and q3 are non-minimal parameters describing the linear coupling of\nthe Maxwell tensor Fmn with curvature [47]. The quantity χikmn\n(A) given by\nikmn\nχikmn\n+Q2 Rikmn +Q3 Rikmn ,\n(A) =Q1 Rg\n\n(17)\n\nwhere Q1 , Q2 and Q3 are also constants, is the non-minimal susceptibility tensor describing\n∗\nthe linear coupling of the dual tensor Fmn\nwith curvature. As in the previous case, the\n∗\ncombination φFmn gives the tensor quantity. The tensor\n\u0011\n1 \u0010 ml n\nnl m\nmn\nRmn\n≡\nη\nF\nR\n+\nF\nR\n+ η3 Rmn\n1\n(A)\nl\nl + η2 Rg\n2\n\n(18)\n\ndescribes a non-minimal susceptibility for the pseudoscalar field in analogy with [53], but in\nthis case it contains a term linear in the Maxwell tensor. This term describes effects analogous\nto the so-called derivative coupling in the non-minimal scalar field theory [31, 32, 33]. As for\nthe tenth coupling constant η(A) , it is a direct analog of the well-known coupling constant ξ\nin the non-minimal scalar field theory (see, e.g., [30] for review and references).\nThe tensors Rikmn and χikmn\n(A) , defined by (14) and (17), are skew-symmetric with respect\nto transposition of the indices i and k, as well as m and n. In addition, the following relations\ntake place\nmnik\nRikmn = Rmnik , χikmn\n(19)\n(A) = χ(A) ,\nwhich guarantee that the model under consideration does not contain the solutions of the\nmn\nnm\nskewon type [27]. The tensor Rmn\n(A) is explicitly symmetric, i.e. R(A) = R(A) .\n\n5\n\n\f2.2.2\n\nNon-minimal electrodynamic equations\n\nElectrodynamic equations, which correspond to the Lagrangian (12) with (1) and (13), are\nlinear and have the standard form\n∇k H ik = I i .\n(20)\nThe excitation tensor H ik and the Maxwell tensor Fmn are linked by the linear constitutive\nlaw\nh \u0010\n\u0011i\n∗\nH ik ≡ F ik + Rikmn Fmn + φ F ∗ik + χikmn\nF\n.\n(21)\n(A)\nmn\n\nThe second term on the right-hand side is the curvature-induced polarization-magnetization,\nappearing in the non-minimally extended pure Einstein-Maxwell model [47]. The contribution detailed in square brackets is the one of the axion type, the terms φ and F ∗ik enter the\nequations in the multiplicative form only (see, e.g., [8, 35] for more details). The non-minimal\n∗\naxion contribution φχikmn\n(A) Fmn is a new term proposed here.\nThe four-vector of an effective electric current\nh\u0010\n\u0011\ni\n1\nI i ≡ η1 ∇k Rkm ∇i φ − Rim ∇k φ ∇m φ\n2\n\n(22)\n\nis proportional to the coupling parameter η1 and is due to the first term in (18). This\nfour-vector does not contain Maxwell tensor and satisfies the conservation law ∇i I i = 0.\nIt contains both the Ricci tensor and the pseudoscalar field; thus, it describes the electric\ncurrent induced by curvature and axion field derivatives.\n2.2.3\n\nNon-minimal equation for the pseudoscalar field\n\nNon-minimally extended master equation for the pseudoscalar φ takes the form\n∇m\n\n\u0011\ni h\ni\n1 mn ∗\n1\n2\n∗\ng mn + Rmn\nFmn − χikmn\n(A) ∇n φ + m(A) + η(A) R φ = − F\n(A) Fik Fmn ,\n4\n4\n\nh\u0010\n\n(23)\n\nikmn\nwhere Rmn\n(A) and χ(A) are given by (18) and (17), respectively. This equation is a non-minimal\ngeneralization of (8).\n\n2.2.4\n\nNon-minimal equations for the gravitational field\n\nVariation of the action functional (12) with (1) and (13) with respect to g ik gives the nonminimally extended equations for the gravitational field\nh\ni\n1\n(EM)\n(A)\n(NMEM)\n(NMA)\nRik − Rgik (1+κΘ) =κ Tik +Tik +Tik\n+Tik\n.\n2\n\n\u0012\n\n\u0013\n\n(24)\n\nHere the scalar Θ stands for the quantity\n1\n1\n1\n∗\nΘ ≡ η(A) φ + q1 Fmn F mn + Q1 φFmn\nF mn + η3 −η2 ∇m φ∇m φ ,\n2\n2\n2\n\u0012\n\n2\n\n(EM)\n\n(A)\n\n\u0013\n\n(25)\n\nwith the tensors Tik\nand Tik given by (10) and (11), respectively. The non-minimal\n(NMEM)\nextension of the stress-energy tensor contains two contributions: first, Tik\ndescribing\n6\n\n\fpure non-minimal electromagnetic part (see, e.g., [47] for details); second, the non-minimal\n(NMA)\naxion part Tik\n. These tensors can be specified as follows:\n(NMEM)\n\nTik\n(NMA)\n\nTik\n\n(1)\n\n(1)\n\n(2)\n\n(3)\n\n= q1 Tik + q2 Tik + q3 Tik ,\n\n(2)\n\n(3)\n\n(4)\n\n(5)\n\n(26)\n(6)\n\n(7)\n\n= Q1 Tik + Q2 Tik + Q3 Tik + η1 Tik + η2 Tik + η3 Tik + η(A) Tik ,\n\nwhere\n\n(27)\n\ni\n1h\n∇i ∇k − gik ∇l ∇l [Fmn F mn ] ,\n2\n\n(28)\n\nTik = R∇i φ∇k φ + (gik ∇n ∇n − ∇i ∇k ) [∇m φ∇m φ] ,\n\n(35)\n\n(1)\n\nTik = −RFim Fk m +\n\ni\n\u0011\n\u0010\n1 h\n(2)\nTik = − gik ∇m ∇l F mn F ln − Rlm F mn F ln\n2\n1\n−F ln (Ril Fkn + Rkl Fin ) − Rmn Fim Fkn − ∇m ∇m (Fin Fk n )\n2\n\u0011i\n\u0011\n\u0010\nh\n\u0010\n1\n+ ∇l ∇i Fkn F ln + ∇k Fin F ln ,\n(29)\n2\n3\n1\n(3)\nTik = gik Rmnls Fmn Fls − F ls (Fi n Rknls + Fk n Rinls )\n4\n4\n1\n− ∇m ∇n [Fi n Fk m + Fk n Fi m ] ,\n(30)\n2\ni\n1\n1h\n(1)\n∗\n∗\n∇i ∇k −gik ∇l ∇l [φFmn\nF mn ] − gik RφFmn\nF mn ,\n(31)\nTik ≡\n2\n4\n1\n(2)\nTik ≡ − φF ∗mn (Rim Fkn +Rkm Fin ) +\n2\n\u0011io\n\u0011i\nh \u0010\nn\nh\n\u0010\n1\n∗ ln\n∗\n−\nF\nF ln +∇k φ Fin F ∗ln +Fin\n+ ∇l ∇i φ Fkn F ∗ln +Fkn\n4\nh \u0010\n\u0011i 1\n1\n∗\n− gik ∇n ∇m φ F nl F ∗ml +F ∗nl F ml − ∇m ∇m [φ (Fin Fk∗n +Fin\nFk n )] ,\n(32)\n4\n4\n\u0011\n\u0010\n1\n1\n(3)\nTik ≡ − ∇m ∇n [φ (F ∗n i F mk +F ∗n k F mi )] + φF ∗mn Fil Rl kmn +Fkl Rl imn ,\n(33)\n2\n4\n\u0011\n1\n1 \u0010\n(4)\nTik ≡ gik Rnl −∇l ∇n (F nm ∇m φ∇l φ) + Rnl ∇l φ (Fi n ∇k φ+Fk n ∇i φ) +\n2\n2\n1\n1\n+ ∇l ∇l [∇m φ (F mi ∇k φ+F mk ∇i φ)] + ∇l [∇i (Fk m ∇m φ∇l φ) +∇k (Fi m ∇m φ∇l φ)] +\n4\n4\n1\n+ ∇m [∇i (F mn ∇k φ∇n φ) +∇k (F mn ∇i φ∇n φ)] +\n4\n1 mn\n1\n+ F (Rin ∇k φ+Rkn ∇i φ) ∇m φ+ (Rim F nk +Rkm F ni ) ∇m φ∇n φ ,\n(34)\n2\n2\n(5)\n\n1\n(6)\nTik = ∇m φ [Rim ∇k φ + Rkm ∇i φ] − Rgik ∇m φ∇m φ+\n4\n\n7\n\n\f1\n+ gik ∇m ∇n [∇m φ∇n φ] − ∇m [∇m φ (∇i ∇k φ)] .\n2\n(7)\n\nTik = (∇i ∇k − gik ∇m ∇m ) φ2 .\n\n(36)\n(37)\n\nStraightforward calculations show that the following identity takes place:\nn\n\nh\n\n(EM)\n\n∇k (1+κΘ)−1 Tik\n\n(A)\n\n(NMEM)\n\n+Tik +Tik\n\n(NMA)\n\n+Tik\n\nio\n\n= 0,\n\n(38)\n\ni.e. the total effective stress-energy tensor written in the braces is a conserved quantity.\n\n2.3\n\nNon-minimal constitutive equations for electromagnetic field\n\nRelation (21) is a linear constitutive equation [57, 27, 8] of the following type:\nH ik = C ikmn Fmn\n\n(39)\n\nwhere\n\ni\n1\n1 h\n∗ ikmn\nC ikmn = g ikmn + φǫikmn + Rikmn + φ χ∗ikmn\n.\n+\nχ\n(A)\n(A)\n2\n2\nHere we use the standard definitions for the right and left dualization:\n\n1\nmn\nχ∗ikmn\n≡ χikpq\n,\n(A)\n(A) ǫpq\n2\n\n∗ ikmn\nχ(A)\n\n1\n≡ ǫik pq χpqmn\n(A) .\n2\n\n(40)\n\n(41)\n\nThe tensor C ikmn describes the linear response of the material to the electromagnetic field\naction and contains the information about non-minimal dielectric permittivity and magnetic\nimpermeability, as well as about the non-minimal magneto-electric coefficients in analogy\nwith the standard continuum electrodynamics [57, 58, 59].\nLet us mention that in many works (e.g., in [27], [60]-[62]), a constitutive tensor density\n√\nχ̂ikmn = −g C ikmn is used for the description of linear response instead of true tensor\nC ikmn . In terms of the quantity χ̂ikmn the condition for no birefringence (no splitting, no\nretardation) for electromagnetic wave propagation in all directions in the weak field limit\ngives ten constraint equations on the components of constitutive tensor density (see, e.g.,\n[60]-[63]). With these ten constraints χ̂ikmn can be rewritten in the following form\nχ̂ikmn =\n\ni\nh\n1√\n−H ψ H im H kn − H in H km + φE ikmn ,\n2\n\n(42)\n\nwhere H = det(Hik ) is a determinant of an effective metric Hik , which generates the light\ncone for electromagnetic wave propagation; ψ is some dilation factor; φ differs from our φ\nby the coefficient two φ = 2φ. In case when (42) is not satisfied, birefringence will occur. In\ncase when (42) is satisfied, a pseudoscalar field φ will give a polarization rotation (an optical\nactivity induced by φ). The effects of birefringence and polarization rotation described in\nterms of constitutive tensor density are studied in the 1970's and 1980's. In particular,\nconstraints on birefringence from pulsar signal observations give the following estimates for\nthe birefringence part δ χ̂ikmn of χ̂ikmn in a weak field:\nδ χ̂ikmn < 10−14 − 10−16 .\n8\n\n(43)\n\n\fUsing the medium velocity four-vector U i , normalized by U i Ui = 1, one can decompose\nC ikmn uniquely as\nh\n\nC ikmn =\n\n1\n2\n\n\u0011\n\n\u0010\n\nεim U k U n − εin U k U m + εkn U i U m − εkm U i U n +\n\ni\n\n+ 12 −η ikl (μ−1 )ls η mns + η ikl (U m νl n − U n νl m ) + η lmn (U i νl k − U k νl i ) .\n\n(44)\n\nHere εim is the dielectric permittivity tensor, (μ−1 )pq is the magnetic impermeability tensor,\nand νp m* is the tensor of magneto-electric coefficients. These quantities are defined as follows:\n1\n(μ−1 )pq = − ηpik C ikmn ηmnq ,\n2\n\nεim = 2C ikmn Uk Un ,\n\nνp m = ηpik C ikmn Un = Uk C mkln ηlnp .\n\n(45)\n\nWe use the symbols ηmnl and ∆ik for the tensors\nηmnl ≡ ǫmnls U s ,\n\n∆ik = g ik − U i U k ,\n\n(46)\n\northogonal to U i . The tensors εik and (μ−1 )ik are symmetric, but νlk is in general nonsymmetric. These three tensors are orthogonal to U i ,\nεik U k = 0,\n\n(μ−1 )ik U k = 0,\n\nνl k U l = 0 = νl k Uk .\n\n(47)\n\nUsing expression (40) one can calculate the tensors εim , (μ−1 )im and ν pm explicitly. The\nsymmetric dielectric permittivity tensor\nεim = ∆im [1+q1 R+q2 Rpq Up Uq ] + q2 Rpq ∆ip ∆mq +\n+2q3 Ripmq Up Uq +Q3 φ Up Uq\n\n\u0010\n\n∗\n\nas well as the symmetric magnetic impermeability tensor\n\u0010\n\nμ−1\n\n\u0011im\n\n\u0011\n\nRipmq +R∗ipmq ,\n\n(48)\n\n= ∆im [1+q1 R+q2 Rpq Up Uq ] −q2 Rpq ∆ip ∆mq −\n\n−2q3 ∗ R∗ipmq Up Uq +Q3 φ Up Uq\n\n\u0010\n\n∗\n\nRipmq +R∗ipmq\n\ndo not contain coupling parameters Q1 and Q2 . The cross-tensor\n\n\u0011\n\n(49)\n\nν pm = q2 η pmk Rkl U l + 2q3 ∗ Rplmn Ul Un +\n\u0010\n\u0011\n1\n− ∆ φ 1+ Q1 + Q2 R +Q3 φUl Un ∗ R∗plmn −Rplmn ,\n(50)\n2\nwhich gives the optical activity effects (see, e.g., [59]), contains two explicitly distinguished\nparts. The first part does not contain pseudoscalar field φ, is linear in the parameters q2 and\nq3 and describes optical activity induced by direct non-minimal interaction between electromagnetic and gravitational fields (such a model was analyzed in [65, 54]). It is important to\nmention that this part of the cross-tensor ν pm contains both: skew-symmetric and symmetric\nterms (see the terms with ηpmk and ∗ Rplmn Ul Un ). The second contribution to ν pm , which is\npm\n\n\u0014\n\n\u0012\n\n\u0013\n\n\u0015\n\n9\n\n\fproportional to the pseudoscalar field φ, is symmetric with respect to transposition of indices\n(see the terms, containing the projector ∆pm and the tensor ∗ R∗plmn −Rplmn ). It describes\nan optical activity induced by the axion field, the term ∆pm φ relates to the minimal effects,\nthe terms proportional to Q1 , Q2 and Q3 relates to non-minimal effects. It is well-known\nthat the non-vanishing cross-tensor ν ik indicates that the medium is optically active, and the\nrotation of the Faraday type takes place in the course of electromagnetic wave propagation.\nThus, one can see directly from (50), that the non-minimal interaction between electromagnetic and axion fields produces curvature-induced optical activity of a new type. Below we\nconsider this effect explicitly by the example of model with pp-wave symmetry.\nIn table 1, we summarize briefly the information about non-minimal coupling constants.\n\nq1\nq2\nq3\nQ1\nQ2\nQ3\nη1\nη2\nη3\nη(A)\n\nTerm in the\nLagrangian\n1\nRF mn Fmn\n2\nRmn Fmk Fn k\n1 ikmn\nR\nFik Fmn\n2\n1\nmn ∗\nφRF Fmn\n2\nφRmn Fmk Fn∗k\n1\n∗\nφRikmn Fik Fmn\n2\n−Rnl F ml ∇m φ∇n φ\n−R∇m φ∇m φ\n−Rmn ∇m φ∇n φ\nRφ2\n\nPhysical meaning\nNMEM susceptibility linear in the Ricci scalar\nNMEM susceptibility linear in the Ricci tensor\nNMEM susceptibility linear in the Riemann tensor\nNMEM susceptibility induced by the axion with the Ricci scalar\nNMEM susceptibility induced by the axion with the Ricci tensor\nNMEM susceptibility induced by the axion with the Riemann tensor\nNMEM current induced by the axion field gradient\nNM axion-graviton derivative coupling with the Ricci scalar\nNM axion-graviton derivative coupling with the Ricci tensor\nNM correction to the mass square of the axion\n\nTable I. Ten non-minimal (NM) coupling parameters are divided into four subgroups: the first\nq1 , q2 , q3 ; second Q1 , Q2 , Q3 ; third η1 , η2 , η3 ; and fourth η(A) . In the second column the terms in the\nLagrangian are given in front of which the corresponding coupling parameters are introduced; the\nparameters of the first subgroup introduce the terms without the pseudoscalar field φ; the parameters of the second subgroup relate to the terms linear in φ; the terms indicated by η1 , η2 , η3 , are\nquadratic in the four-gradient of φ; and finally, η(A) introduces the term quadratic in φ. In the last\ncolumn, we point out the physical meaning of these non-minimal terms, based on decompositions\nof the constitutive tensors for the electromagnetic (EM) and pseudoscalar fields.\n\n3\n3.1\n\nNon-minimal models with pp-wave symmetry\nReduced non-minimal field equations\n\nWe consider the line element for the spacetime with pp-wave symmetry in the form [66]\nn\n\ni\n\nh\n\no\n\nds2 = 2dudv − L2 cosh 2γ e2β (dx2 )2 + e−2β (dx3 )2 + 2 sinh 2γdx2 dx3 ,\n1\n\n1\n\n(51)\n\n√\n√\nwhere u= ct−x\nand v= ct+x\nare the retarded and the advanced times, respectively; β(u) and\n2\n2\nγ(u) are functions of retarded time only, they determine the polarization of gravitational\nwave field. The case when the gravitational pp-wave field is characterized by one polarization\n\n10\n\n\fonly (γ = 0) is investigated in detail in [64]. Various properties of pp-waves are discussed,\ne.g., in [67, 68, 69]. For the metric (51), the Riemann tensor has only three non-vanishing\ncomponents R2u2u , R3u3u and R2u3u . The Ricci tensor has only one (generally) non-vanishing\ncomponent Ruu and the Ricci scalar is equal to zero identically R = 0. For this metric the\nthree Killing vectors, which form an Abelian subgroup of the group G5 [69], are\ni\nξ(v)\n= δvi ,\n\ni\nξ(2)\n= δ2i ,\n\ni\nξ(3)\n= δ3i .\n\n(52)\n\ni\ni\ni\nThe Killing vector ξ(v)\nis a covariant constant null vector orthogonal to ξ(2)\nand ξ(3)\n. We suggest here that the axion and electromagnetic field potentials inherit the spacetime symmetry,\ni.e. the Lie derivatives satisfy the following relations:\n\n£ξ(a) φ = 0 ,\n\n£ξ(a) Am = 0 ,\n\n(53)\n\nwhere (a) take the values (v), (2) and (3). As a consequence of (53), the pseudoscalar field and\nelectromagnetic field potential depend on the retarded time only, φ = φ(u), Am = Am (u).\nTaking into account the Lorentz gauge ∇k Ak = 0, we can choose the potential in the form\nAu = Av = 0 ,\n\nA2 = A2 (u) ,\n\nA3 = A3 (u) .\n\n(54)\n\nThe next step is to verify that pp-wave symmetry is admitted by the total system of nonminimal master equations. Direct calculations show that for such an ansatz about symmetry\nthe non-minimal equation for pseudoscalar field φ(u), i.e. the equations (23) with (18), are\nsatisfied identically for arbitrary Q1 ,...η3 and η(A) , when the axion field is massless, i.e.\nm(A) = 0. Also, the non-minimal electrodynamic equations (20) with (21) and (22) are\nsatisfied identically for arbitrary coupling constants, when the potential takes the form (54).\nFinally, the non-minimal equations for the gravitational field (24) with (25)-(37) can be\nreduced to one equation only, namely\n\"\n\n#\n\n\u0010\n\u0011\ni\nh\n2 L′′\n2\n2\n2\n−\n+ (β ′ ) cosh2 2γ+ (γ ′ ) 1+κη(A) φ2 = (φ′ ) 1+2η(A) +2η(A) φφ′′ +\nκ L\n\u0011\n\u0011\n\u0010\n\u0010\n1\n′ −β 2\n′ β 2\n(55)\n−2 sinh 2γ A′2 A′3 .\ncosh\n2γ\nA\ne\n+\nA\ne\n2\n3\nL2\nThe prime denotes here and below the derivative with respect to the retarded time u. The\nright-hand side of this equation includes, as usual, the minimal contributions from the tensors\n(A)\n(EM)\n(7)\nTik and Tik . Only two non-minimal contributions came from the term Tik (37) and from\nthe term κη(A) φ2 in the expression for Θ (25). The non-minimal coupling constants q1 , q2 ,\nq3 , Q1 Q2 , Q3 , η1 , η2 , η3 are non-vanishing, but they happen to be hidden in this pp-wave\nmodel. Thus, in the presented model, six functions φ(u), A2 (u), A3 (u), β(u), γ(u) and\nL(u) are linked by one equation (55) only, and this model admits very wide possibilities in\nsearching for exact solutions.\n\n+\n\n\u001a\n\n\u0015\n\n\u0014\n\n11\n\n\u001b\n\n\f3.2\n\nExact solutions of the pp-wave type:\nquasi-minimal models with η(A) = 0\n\nWhen the non-minimal parameter η(A) is vanishing, we deal with a model which looks like\nminimal, i.e. the key equation for the pp-wave gravitational field\n−\n\nκ\nL′′\n2\n2\n2\n= (β ′ ) cosh2 2γ+ (γ ′ ) + (φ′ ) +\nL\n2\n\n\u00112 \u0010\n\u0010\n\u00112\nκ\n+ 2 cosh 2γ A′2 e−β + A′3 eβ\n−2 sinh 2γ A′2 A′3\n(56)\n2L\ndoes not contain non-minimal parameters at all. That is why we indicate this case with\narbitrary but hidden parameters\u0010 q1 , q\u00112 , q3 , Q1 Q2 , Q3 , η1 , η2 , η3 and vanishing η(A) as quasi′′\nminimal. Clearly, the quantity − LL in the left-hand side of (56) has to be non-negative.\nThis property of L(u), which has initial value L(0) = 1, provides L(u) to vanish at some\nmoment u = u∗ (L(u∗ ) = 0)(see, e.g., [68]). This moment of the retarded time relates to\nthe well-known singularity, the physical sense of which is discussed in detail in many books.\nIn [69], a number of papers are quoted, in which exact solutions of (56) are obtained for\nthe pure electromagnetic source (φ = 0). In addition, exact solutions of the model of this\ntype are known for vanishing Ak , when the (pure)scalar field Φ is the source of the pp-wave\ngravity field (see, e.g., [70]). Finally, when Ak = 0 and φ = 0, we deal with the so-called\npure gravitational pp-wave (see, e.g., [64, 67, 68, 69]). We would like to list here only three\nexamples from the wide collection of minimal solutions of the equation (56), which relates\nto the models with symmetric spacetime of the pp-wave type. The models with symmetric\nspacetime are characterized by the condition ([67, 69])\n\u001a\n\n\u0014\n\n\u0015\n\n\u001b\n\n∇k Ri mnl = 0 .\n\n(57)\n\nIn particular, when γ(u) = 0, one obtains from (57) that\n\"\n\n#\n\n\"\n\n#\n\nR2u2u\n\nL′′\nL′\n=−\n+ (β ′ )2 − 2 β ′ + β ′′ = λ1 ,\nL\nL\n\n(58)\n\nR3u3u\n\nL′\nL′′\n+ (β ′ )2 + 2 β ′ + β ′′ = λ2 ,\n=−\nL\nL\n\n(59)\n\n#\n\n\"\n\n\"\n\n#\n\nwhere λ1 and λ2 are some constants. The summation of (58) and (59) yields\nRuu\n\n\"\n\n#\n\nL′′\n=−\n+ (β ′)2 = λ1 + λ2 .\nL\n\n(60)\n\nThus, for the symmetric spacetime, the key equation for the (quasi)minimal model can be\nreduced to\n\u0015\n\u0014\n1 \u0010 ′ −β \u00112 \u0010 ′ β \u00112\n2\n′ 2\n.\n(61)\n+ A3 e\n(λ1 +λ2 ) = (φ ) + 2 A2 e\nκ\nL\nIn more appropriate terms, when\nL2 = F (u) G(u) ,\n12\n\n2β = log\n\nF\n,\nG\n\n(62)\n\n\f(58), (59) give two independent equations\nF ′′ (u) + λ1 F = 0 ,\n\nG′′ (u) + λ2 G = 0 ,\n\n(63)\n\nwhich can be easily solved if the signs of the constants λ1 and λ2 are fixed.\n(i) First example\nThe first model of such type relates to the pure gravitational wave, i.e. to the case when\nRuu = 0. Suggesting that λ1 = −λ2 ≡ ν 2 , we obtain immediately from (63) the well-known\nPetrov's solution [67]\nwith\n\nds2 = 2dudv− cos2 νu(dx2 )2 − cosh2 νu(dx3 )2 ,\nF (u) = cos νu ,\n\nG(u) = cosh νu .\n\nThis solution is admissible, when φ=φ0 =const, Ak =0. The quantity\nvanishes at u∗ = π/2ν.\n\n(64)\n\n√\n\n(65)\n−g ≡ cos νu cosh νu\n\n(ii) Second example\nWhen A2 = A3 = 0, β = γ = 0 and function φ(u) is linear in the retarded time, i.e.\nφ(u) = φ0 + ωu, then (56) gives\nr\nκ\nL(u) = cos\nωu , L(0) = 1 , L′ (0) = 0 .\n(66)\n2\nFor such a metric one obtains that\nκω 2\nL′′\n2\n3\n=\n= λ1 = λ2 .\n(67)\nR u2u = R u3u = −\nL\n2\nThe first zero of the function L is u = u∗ = ω√π2κ .\n(iii) Third example\nWhen λ1 = ν 2 , λ1 = −μ2 and φ = 0, there is an exact solution\nF (u) = cos νu ,\n\nG(u) = cosh μu ,\n\n(68)\n\nwith\n\nκE02\n.\n(69)\n2\nThe electromagnetic field in this model is presented by the following potentials:\nE0\nA2 (u)= 2 2 [ω sin ωu cos νu−ν sin νu cos ωu] ,\n(70)\n(ω −ν )\nE0\nA3 (u)= 2 2 [μ sin ωu sinh μu−ω cos ωu cosh μu] .\n(71)\n(ω +μ )\nThis electromagnetic wave can be considered as a circularly polarized wave, since the physical\ncomponents of the electric field satisfy the following conditions:\nν 2 = μ2 +\n\nE⊥2 ≡ −(E2 E 2 + E3 E 3 ) ≡ −g αβ A′α A′β = E02 ,\n\u0010\n\n\u0011\n′′\n\n(α, β = 2, 3) .\n\n(72)\n\nWhen η(A) 6= 0, the quantity − LL can change the sign, since the term η(A) (φ2 )′′ in the righthand side of (55) is not positively defined in general case. This means that the singularity\nL = 0 can, in principle, be avoided.\n13\n\n\f3.3\n\nExact solutions of the pp-wave type:\nNon-minimal models with η(A) 6= 0\n\nConsider now exactly solvable models with non-vanishing coupling constant η(A) .\n3.3.1\n\nRegular model\n\nLet us consider a model with L(u) ≡ 1 and γ(u) ≡ 0. It can be indicated as the regular one,\nsince det(gik ) = −L4 ≡ −1 and can not vanish. Equation for β reduces to\ni\n\u00112 \u0010\nh\n\u0010 \u0011′′ \u0010\n\u00112\n2\n2\n2\n− (β ′ ) 1+κη(A) φ2 = (φ′ ) +η(A) φ2 + A′2 e−β + A′3 eβ .\nκ\n\n(73)\n\nWhen η(A) = 0 there is no real solutions of this equation, but such a possibility appears\nin the non-minimal case. We consider only one example of the exact regular models, it is\ncharacterized by\nA2 (u) = A2 (0)eβ(u) ,\n\nφ = φ0 ,\n\nA3 (u) = A3 (0)e−β(u) ,\n\n(74)\n\nand is possible, when η(A) < 0 and\nφ20 |η(A) | = 1 +\n\ni\nκh 2\nA2 (0) + A23 (0) .\n2\n\n(75)\n\nThe function β(u) is arbitrary; we prefer to use the following periodic finite function:\n1\nβ(u) = β(max) (1 − cos 2λu) ,\n2\n\nβ(0) = 0 ,\n\nβ ′ (0) = 0 .\n\n(76)\n\nThe metric for this non-minimal model is regular:\nn\n\nh\n\ni\n\nh\n\ni\n\no\n\nds2 =2dudv− exp 2β(max) sin2 λu (dx2 )2 + exp −2β(max) sin2 λu (dx3 )2 ,\n\n(77)\n\nthe potentials of the electromagnetic field and their derivatives are also periodic and regular.\n3.3.2\n\nNon-minimal models with symmetric spacetime of the pp-wave type\n\nThe key equation for the metric coefficients can be reduced in this case to the relation\n\u0014\n\u0015\n\u0010\ni\nh\n\u0011\n1 \u0010 ′ −β \u00112 \u0010 ′ β \u00112\n2\n′ 2\n2\n′′\n(λ1 +λ2 ) 1+κη(A) φ = (φ ) 1+2η(A) +2η(A) φφ + 2 A2 e\n.\n+ A3 e\nκ\nL\n\n(78)\n\nLet us consider three exact solutions of this equation, which can be indicated as the nonminimal ones.\n(1) First exact solution\nLet us suppose that λ1 = −λ2 ≡ ν 2 , and we again deal with the Petrov solution (64). This\nsolution is admissible when\nn\n\n(φ′ )\n\n2\n\n\u0010\n\n\u0011\n\n\u0014\n\no\n\n2\n\n\u0010\n\n1+2η(A) +2η(A) φφ′′ cos2 νu cosh2 νu+ (A′2 cosh νu) + A′3 cos2 νu\n14\n\n\u00112 \u0015\n\n= 0 . (79)\n\n\fOne of the solutions of this equation, which relates to the case η(A) =− 14 , is given by\nφ(u)=φ0 cosh σu ,\nA2 (u)=\nA3 (u)=\n\nφ0 = ±\n\n√ E0\n,\n2\nσ\n\n(80)\n\nE0\n[ω sin ωu cos νu−ν sin νu cos ωu] ,\n(ω 2−ν 2 )\n\nE0\n2\n(ω +ν 2 )\n\n(81)\n\n[ν sin ωu sinh νu−ω cos ωu cosh νu] .\n\n(82)\n\nHere E0 , σ, ω and ν are arbitrary constant. When ω 2 = ν 2 , the expression for A2 (u) should\nbe replaced by A2 (u) = E4ν0 (2νu + sin 2νu). Let us mention that in the paper [70], the case\nξ = 1/4 is also indicated as the special one (η(A) in our notations corresponds to ξ in [70]).\n(2) Second exact solution\nIn the case λ1 = λ2 = −μ2 , an appropriate example of the model is characterized by\nβ(u) = 0 ,\n\nL(u) = F (u) = G(u) = cosh μu ,\nR2u2u\n\n=\n\nR3u3u\n\nL(0) = 1 ,\n\nL′ (0) = 0 ,\n\nL′′\n= −μ2 ,\n=−\nL\n\n(83)\n(84)\n\nA2 (u)=\n\nE0\n[ω sin ωu cosh μu+μ sinh μu cos ωu] ,\n(ω 2+μ2 )\n\n(85)\n\nA3 (u)=\n\nE0\n2\n(ω +μ2 )\n\n(86)\n\nφ(u) = φ0 = const ,\n\n[μ sin ωu sinh μu−ω cos ωu cosh νu] ,\n\u0010\n\n\u0011\n\nκE02 = 4μ2 |η(A) |κφ20 − 1 > 0 .\n\nη(A) < 0 ,\n\n(87)\n\nAgain, we deal with circularly polarized electromagnetic wave, whose amplitude E0 is connected with constant pseudoscalar field by a special manner (87), which is admissible at the\nnon-minimal case only.\n(3) Third exact solution\nWhen λ1 = ν 2 , λ2 = −μ2 , there is a simple non-minimal modification of the solution (68),\n(69) with constant non-vanishing pseudoscalar field\nF (u) = cos νu ,\n\nG(u) = cosh μu ,\n\nν 2 = μ2 +\n\nφ(u) = φ0 ,\n\nκE02\n,\n2(1 + κη(A) φ20 )\n\nwith electromagnetic potentials, given by (70), (71).\n\n15\n\n(88)\n(89)\n\n\f3.3.3\n\nSpecial model\n\nWhen a pseudoscalar field is constant, i.e. φ(u) = φ0 , and electromagnetic field is absent,\nthe equation for the gravitational field takes the form\n\"\n\n#\ni\nh\nL′′\n2\n′ 2\n′ 2\n+ (β ) cosh 2γ+ (γ ) 1+κη(A) φ20 =0 .\nL\n\n(90)\n\nWhen φ20 = −1/κη(A) , the equations for gravity field are satisfied for arbitrary L(u), β(u)\nand γ(u), and we deal with a non-trivial special case. It corresponds to the case when the\nRicci scalar disappears from the Lagrangian.\n3.3.4\n\nCheshire smile\n\nWhen the spacetime is the Minkowski one, and L = 1, β = 0, γ = 0, the equation (56) yields\n2\n\n\u0010\n\n0= (φ′ ) +η(A) φ2\n\n\u0011′′\n\n2\n\n2\n\n+ (A′2 ) + (A′3 ) ,\n\n(91)\n\nand this equation admits real solutions when the non-minimal parameter η(A) is non-vanishing.\nThe exotic situation when (pure) scalar field does not curve the spacetime, is called in [71]\nas gravitational Cheshire smile. Here we deal with pseudoscalar field instead of pure scalar\none; nevertheless, the physical sense of such a solution remains the same as in [71]. When\nthe electromagnetic field is described by the circularly polarized wave with\nA2 (u) =\n\nE\ncos λu ,\nλ\n\nA3 (u) =\n\nE\nsin λu ,\nλ\n\n(92)\n\nthen the pseudoscalar field satisfies the equation\n2\n\n\u0010\n\n(φ′ ) +η(A) φ2\n\n\u0011′′\n\n+E 2 = 0 ,\n\n(93)\n\nwhose solution can be represented in quadratures as\n± (u + C2 ) =\n\nZ\n\ndφ\ns\n\nC1 φ\n\n1+2η(A)\n− η\n(A)\n\n.\n−\n\n(94)\n\nE2\n1+2η(A)\n\nOne of the explicit particular solutions to (94) is\nφ = φ0 cosh ku ,\n\n1\nη(A) = − ,\n4\n\nφ0 =\n\n√ E\n2 .\nk\n\n(95)\n\nAgain we used the special value of the non-minimal parameter η(A) = − 41 as in [70]. This\nsolution is infinite at u → ∞.\nIn table 2, we summarize and classify exact solutions obtained above for the model with\npp-wave symmetry.\n\n16\n\n\fφ(u)=φ0\nφ0 6= 0\n\nη(A) = 0\nGW of Petrov's type (64)\n\nφ′ (u) 6= 0 Symmetric spacetime of GW type\nwith axion field linear in time (66)\nφ(u) ≡ 0 Co-moving GEMW (68)\n\nη(A) 6= 0\nRegular periodic GEMW (74)\nRegular aperiodic GEMW (83)\nGW with periodic EMW (88)\nSpecial solution (90)\nAxion-GEMW of Petrov's type (80)\nAxion-EMW Cheshire smile (91)\nCo-moving GEMW (68)\n\nTable 2. All the obtained solutions are classified with respect to the pseudoscalar field type:\nφ is a non-vanishing constant φ0 ; φ depends on retarded time and φ′ (u) 6= 0; φ vanishes (see\nhorizontal lines); as well as, with respect to values of the guiding parameter: η(A) =0 or η(A) 6= 0.\nWe distinguish solutions of pure gravitational wave type (GW), co-moving gravito-electromagnetic\nwaves (GEMW), as well as axion-GEMW and axion-EMW. The cases indicated as the solutions for\nsymmetric spacetime relate to the model with covariantly constant Riemann tensor, the solutions\nof the Petrov type being the particular subcase of such spacetime with vanishing Ricci tensor. In\nparentheses we indicate the initial formula in the text related to the corresponding solution. The\nsolutions with φ(u) ≡ 0 are not new; they are introduced to complete the table. The solutions with\nη(A) =0 have, formally speaking, the same structure as the known minimal solutions for the true\nscalar field; we focus our attention to these solutions since they are also valid for the pseudoscalar\nfield with arbitrary non-vanishing non-minimal coupling parameters q1 , q2 , q3 , Q1 Q2 , Q3 , η1 , η2 ,\nη3 , thus belonging to the class of non-minimal solutions.\n\n4\n\n4.1\n\nPropagation of electromagnetic waves\ncoupled to the background axion and\ngravitational pp-wave fields\nEvolutionary equations for the potentials\n\nConsider now test electromagnetic waves propagating in an arbitrary direction in the pure\npp-wave background with γ(u) = 0. The test electromagnetic field satisfies the non-minimal\nevolutionary equations (20), (21) with a vanishing current on the right-hand side, and the\nsolutions, describing the axion field φ(u) and pp-wave gravitational field, are assumed to\nbe unperturbed. We deal below with pure gravitational waves; thus, the Ricci scalar and\nthe Ricci tensor vanish (R = 0, Ruu = 0), providing that the nonvanishing components of\nthe Riemann tensor are of opposite signs (R2u2u = −R3u3u ). Also, we require the potential\nfour-vector to satisfy the Lorentz gauge condition\n∇k Ak = 0\n\n⇒\n\n∂v Au +∂u Av +g αβ ∂α Aβ +\n\n2L′\nAv =0 .\nL\n\n(96)\n\nLet us mention that the problem of propagation of electromagnetic waves coupled to axions\nin the geometric optics approximation is studied in the paper [72] on the basis of investigation\nof the Fresnel equation. Here we do not restrict ourselves by this approximation and consider\n17\n\n\fexact solutions of the equations of axion electrodynamics in analogy with solutions of the\nmodel of non-minimal optical activity discussed in [73].\nDue to condition (96) the first equation from (20) (with i = u) accounting for (21) gives\ni\nthe following simple equation for the longitudinal potential Av = ξ(v)\nAi :\nD̂Av = −\n\n2L′\n∂v Av ,\nL\n\n(97)\n\nwhere D̂ is the differential operator:\n\u0011\n\n\u0010\n\nD̂ ≡ g mn ∂m ∂n = 2∂u ∂v −L−2 e−2β ∂22 + e2β ∂32 .\n\n(98)\n\nClearly, (97) is an equation for Av only; it does not include other components of the potential\nfour-vector. The exact solution of this equation takes the form (see [74])\nAv = L−1 (u) Bv (W ) ,\n\n(99)\n\nwhere Bv (W ) is an arbitrary function of the phase scalar W , given by\nZ\nZ\n1\n−2 −2β\n2\n2\nW ≡ W0 +\nduL e\n+ k3 duL−2 e2β +kv v+k2 x2 +k3 x3 ,\nk\n2kv 2\n\u0015\n\n\u0014\n\n(100)\n\nwith arbitrary constant values of W0 , k2 , k3 and kv . The wave four-vector Ki\nKi ≡ ∇i W = −δiu\n\n\u0011\n1 \u0010 22 2\ng k2 + g 33 k32 + δiv kv + δi2 k2 + δi3 k3 ,\n2kv\n\n(101)\n\nis the null four-vector, i.e. g im Ki Km = 0 and the longitudinal component of the electromagnetic potential Av propagates with the speed of light in vacuum. A special solution\nBv (W ) = 0 has been motivated in [74]. This solution relates to the Landau gauge condition\ni\nξ(v)\nAi = 0, and we will use it below. Equations for the transversal components A2 and A3\nform a coupled system\nh\n\ni\n\nh\n\ni\n\nh\n\ni\n\nD̂ + 2q3 R2u2u ∂v2 − 2β ′ ∂v A2 + e2β φ′ ∂v + 2Q3 φR2u2u ∂v2 A3 = 0 ,\nh\n\ni\n\nD̂ + 2q3 R3u3u ∂v2 + 2β ′ ∂v A3 − e−2β φ′ ∂v + 2Q3 φR3u3u ∂v2 A2 = 0 .\n\nThe replacement\n\nA2 = eβ B2 ,\n\nA3 = e−β B3\n\n(102)\n(103)\n(104)\n\nsimplifies these equations yielding\nh\n\ni\n\nh\n\ni\n\n(105)\n\ni\n\nh\n\ni\n\n(106)\n\nD̂ + 2q3 R2u2u ∂v2 B2 + φ′ ∂v + 2Q3 φR2u2u ∂v2 B3 = 0 ,\n\nh\n\nD̂ + 2q3 R3u3u ∂v2 B3 − φ′ ∂v + 2Q3 φR3u3u ∂v2 B2 = 0 .\n\nBelow we obtain and discuss exact solutions of these equations, suggesting that the functions\nφ(u), L(u) and β(u) are presented by one of the exact solutions listed in the previous Section.\n18\n\n\f4.2\n\nBirefringence induced by curvature in the case\nof vanishing pseudoscalar field (φ = 0)\n\nIn order to clarify a physical meaning of the parameter q3 , let us consider the simplest model\nwith φ = 0, i.e. the model without axion-photon interaction. As it was shown in [74], the\nsolution of (102) and (103) at φ = 0 are\nA2 = eβ B(2) (W(2) ) ,\n\n(107)\n\ni\n1 h −β\nβ\nk\ne\nB\n(W\n)\n+\nk\ne\nB\n(W\n)\n.\n(108)\n2\n3\n(2)\n(2)\n(3)\n(3)\nkv L2\nare arbitrary functions of their arguments, W(2) and W(3) , given by\n\nAv = 0 ,\nHere B(2) and B(3)\n\nA3 = e−β B(3) (W(3) ) ,\n\nAu =\n\nW(2) = W − q3 kv\n\nZ\n\n0\n\nu\n\ndũR2u2u (ũ) ,\n\nW(3) = W − q3 kv\n\nZ\n\nu\n\n0\n\ndũR3u3u (ũ) ,\n\n(109)\n\nwith the phase W found in (100). The numbers (2) and (3) indicate here the electromagnetic waves with polarization vectors directed along Ox2 and Ox3 axes, respectively. For\nestimations it is convenient to consider a particular case with harmonic functions\n0\nB(2) = B(2)\ncos W(2) ,\n\n0\nB(3) = B(3)\ncos W(3) ,\n\n(110)\n\nand parameter kv\n\nω(EM)\n√ (1− cos θ)\n(111)\nc 2\nexplicitly expressed in terms of the electromagnetic wave frequency ω(EM) and angle θ between the directions of propagation of the gravitational wave (0x1 in our case) and of the\nelectromagnetic one.\nClearly, W(2) 6= W(3) , when the corresponding components of the curvature tensor do\nnot coincide, R2u2u 6= R3u3u , and thus we deal with the birefringence effect induced by the\n(2)\n(3)\ncurvature. The wave four-vectors Ki = ∇i W(2) and Ki = ∇i W(3) can be represented as\nfollows:\n(2)\n(3)\nKi = Ki − δiu q3 kv R2u2u , Ki = Ki − δiu q3 kv R3u3u ,\n(112)\nkv =\n\n(2)\n\nwhere Ki is given by (101). The wave four-vectors Ki\nvectors, since\n(2)\n\n(2)\n\ng il Ki Kl\n\n(3)\n\n= −2q3 kv2 R2u2u ,\n\n(3)\n\ng il Ki Kl\n\n(3)\n\nand Ki\n\nare not longer null four-\n\n= −2q3 kv2 R3u3u .\n\n(113)\n\nThe frequencies of the waves with polarization along Ox2 and Ox3 , respectively, (see, e.g.,\n[75] for details), are\n\"\n\n#\n\n\"\n\n#\n\nω(2)\n\n\u0011\nckv\n1 \u0010\n= √ 1 − 2 g 22 k22 + g 33 k32 − q3 R2u2u ,\n2kv\n2\n\nω(3)\n\n\u0011\n1 \u0010\nckv\n= √ 1 − 2 g 22 k22 + g 33 k32 − q3 R3u3u .\n2kv\n2\n\n19\n\n(114)\n\n\fThese frequencies differ when R2u3u 6= R3u3u . The refraction indices n(2) and n(3) can be\ncalculated as follows (see, e.g., [75] for details):\nn2(2)\n\nc\n≡1−\nω(2)\n\n!2\n\nn2(3)\n\nc\n≡1−\nω(3)\n\n!2\n\ng\n\nil\n\n(2) (2)\nKi K l\n\ng\n\nil\n\n(3) (3)\nKi K l\n\n= 1 + 2q3\n\nckv\nω(2)\n\n!2\n\nR2u2u ,\n\n= 1 + 2q3\n\nckv\nω(3)\n\n!2\n\nR3u3u .\n\n(115)\n\nThe difference ∆n ≡ n(2) −n(3) can be calculated for all model mentioned in the previous\nsection, but we focus now on one example only. Let the test electromagnetic wave propagate\nin the direction −x1 , and the solution for the gravitational field be of the Petrov type, i.e.\nR2u2u = −R3u3u = ν 2 . Then one obtains the explicit expressions for the phase velocities:\n(2)\n\nvph\nω(2)\n=\n= 1 − q3 ν 2 ,\nc\nkc\n\n(3)\n\nvph\nω(3)\n=\n= 1 + q3 ν 2 ,\nc\nkc\n\nkv\nk≡√ ,\n2\n\n(116)\n\nand for the refraction indices:\n1 + q3 ν 2\n,\n1 − q3 ν 2\n\nn(2) =\n\nn(3) =\n\n1 − q3 ν 2\n,\n1 + q3 ν 2\n\n∆n =\n\n4q3 ν 2\n.\n1 − q32 ν 4\n\n(117)\n\nThis means, first, that the phase velocities differ from each other, one of them being less than\nthe speed of light in vacuum c, while the second being bigger than c. Second, the non-minimal\n(curvature induced) difference between the refraction indices for the waves with orthogonal\npolarizations depends on the curvature ν 2 and the non-minimal coupling parameter q3 . Thus,\nin this illustration, we deal with birefringence in the absence of polarization rotation.\nThe constraints on the non-minimal coupling parameter from solar system observations\nand from pulsar data analysis were studied in [76] (the parameter λ in this paper relates\nto q3 /4 in our case). From the timing observations of the binary pulsar PSR B1534+12\nsignals, Prasanna and Mohanty gave a constraint on q3 to be |q3 | < 2.4 * 1011 cm2 . From\nmore precise observations of the double pulsar system PSR J0737-3039 A/B, the Shapiro\ntime delay (passing PSR J0737-3039 B of mass 1.25 MSun and radius 10 km) is measured to\nbe 6.21 ± 0.33 μs [77]. The theoretical estimate using general relativity is 6.153 ± 0.26 μs. If\nwe take an upper limit of 0.1 μs for the maximum contribution of the polarization-dependent\ncorrection, we have an upper bound |q3 | < 2.4 * 1010 cm2 .\n\n4.3\n\nQuasi-minimal model of optical activity (q3 = 0, Q3 = 0)\ninduced by varying pseudoscalar field (φ 6= φ0 )\n\nNow we consider the model in which the birefringence is absent, but the rotation of polarization is present. Let two non-minimal coefficients q3 and Q3 be vanishing; then the exact\nsolutions of (96), (97), (102), (103) are\nβ(u)\n\nA2 = e\n\n1\n1\nE(W ) cos [φ(u)−φ(0)] + F (W ) sin [φ(u)−φ(0)] ,\n2\n2\n\n\u001a\n\n\u001b\n\n20\n\n(118)\n\n\f1\n1\nE(W ) sin [φ(u)−φ(0)] − F (W ) cos [φ(u)−φ(0)] ,\nA3 = e\n2\n2\nh\ni\n1\n−2β(u)\n2β(u)\nk\ne\nA\n+\nk\ne\nA\n.\nAv = 0 , Au =\n2\n2\n3\n3\nkv L2\n−β(u)\n\n\u001a\n\n\u001b\n\n(119)\n(120)\n\nHere E(W ) and F (W ) are arbitrary functions of one phase scalar W (100); thus, there is no\nbirefringence. But now we deal with the effect of Faraday rotation, induced by the photonaxion interactions. This is a kind of optical activity induced by the axion field. The effect of\nthe Faraday rotation is described by the rotation phase φ(u)−φ(0), so this effect disappears\nwhen the pseudoscalar field is constant. When the pseudoscalar field is a linear function\nof retarded time (see (66), (67)), the Faraday rotation is uniform. Let us mention again\nthat we indicate this model as quasi-minimal since we suppose that only two non-minimal\nparameter are vanishing, but other ones are non-vanishing.\n\n4.4\n\nNon-minimal optical activity induced by photon-axion\ninteraction in the case of a constant pseudoscalar field φ = φ0\n\nWhen non-minimal coupling constants are non-vanishing, i.e. q3 6= 0 and Q3 6= 0, we search\nfor exact solutions to the system (105), (106) as follows:\nB2 = h1 (u) cos W + h2 (u) sin W ,\n\nB3 = −h3 (u) sin W + h4 (u) cos W .\n\n(121)\n\nAgain W is given by (100), and four functions of the retarded time h1 , h2 , h3 and h4 satisfy\nthe following system of linear ordinary first-order differential equations with a coefficient\ndepending on retarded time u:\n1\nh′1 (u) = − φ′ h4 − q3 kv R2u2u h2 + Q3 φ kv R2u2u h3 ,\n2\n1\nh′2 (u) = + φ′ h3 + q3 kv R2u2u h1 + Q3 φ kv R2u2u h4 ,\n2\n1\nh′3 (u) = − φ′ h2 − q3 kv R3u3u h4 + Q3 φ kv R3u3u h1 ,\n2\n1\n(122)\nh′4 (u) = + φ′ h1 + q3 kv R3u3u h3 + Q3 φ kv R3u3u h2 .\n2\nLet the function φ(u) be presented by a constant value φ(u) = φ0 . Introducing a new\nconvenient variable τ\nZ u\nτ ≡ kv\nR2u2u (ũ)dũ ,\n(123)\n0\n\nwe reduce the system (122) to the following system with constant coefficients:\nḣ1 (τ ) = −q3 h2 + Q3 φ0 h3 ,\nḣ3 (τ ) = −Q3 φ0 h1 + q3 h4 ,\n\nḣ2 (τ ) = q3 h1 + Q3 φ0 h4 ,\nḣ4 (τ ) = −Q3 φ0 h2 − q3 h3 ,\n\n21\n\n(124)\n\n\fwhere the dot denotes the derivative with respect to τ . The characteristic equation for this\nsystem of equations with constant coefficients takes the form\n\u0010\n\nλ2 + Q23 φ20 + q32\n\n\u00112\n\n= 0,\n\n(125)\n\nand its solutions λ = ±iΩ are the double ones, where\nΩ≡\n\nq\n\nq32 + Q23 φ20 .\n\n(126)\n\nLet us mention that (124) in this case can be rewritten in terms of second-order equations:\nḧa + Ω2 ha = 0 ,\n\n(127)\n\nwhere a = 1, 2, 3, 4. That is why the exact solution of the system (124)\nh1 (τ ) = h1 (0) cos Ωτ −\n\n1\nsin Ωτ [q3 h2 (0) − Q3 φ0 h3 (0)] ,\nΩ\n\n1\nsin Ωτ [q3 h1 (0) + Q3 φ0 h4 (0)] ,\nΩ\n1\nh3 (τ ) = h3 (0) cos Ωτ + sin Ωτ [q3 h4 (0) − Q3 φ0 h1 (0)] ,\nΩ\n1\nh4 (τ ) = h4 (0) cos Ωτ − sin Ωτ [q3 h3 (0) + Q3 φ0 h2 (0)] ,\n(128)\nΩ\ncontains the trigonometric functions cos Ωτ and sin Ωτ only. Thus, the quantity Ω plays\na role of frequency of the curvature-induced rotation of the Faraday type. Let us stress\nthat in this model the non-minimal coupling parameters Q3 and q3 play equivalent roles,\npredetermining the pure rotation of the polarization vector without damping. When the ppwave spacetime is symmetric, i.e. the component R2u2u is constant, one obtains immediately\nfrom (123) that τ is linear in the retarded time, e.g. for solution (64) one obtains τ = ν 2 kv u.\nh2 (τ ) = h2 (0) cos Ωτ +\n\n4.4.1\n\nConstraints on the non-minimal coupling parameters from CMB polarization observations\n\nThe parameter Q3 enters the key formulas in the product Q3 φ0 and thus relates to the nonminimal axion contribution to the effect of polarization rotation. Let us assume that q3 = 0\nand the following simple initial conditions take place\nh1 (0) = h3 (0) = h4 (0) = 0 ,\n\nh2 (0) = B0 → B2 = B0 sin W ,\n\nB3 = 0 ,\n\n(129)\n\ni.e. initially the electromagnetic wave was polarized along the 0x2 axis only. Then we obtain\nfrom (128)\nA2 = B0 eβ cos (Q3 φ0 τ ) sin W ,\n\nA3 = −B0 e−β sin (Q3 φ0 τ ) cos W .\n\n22\n\n(130)\n\n\fClearly, when Q3 φ0 6= 0, the orthogonal component of the electromagnetic potential A3\nappears; thus, the polarization rotation can exist when the parameter Q3 φ0 is non-vanishing.\nThe polarization ellipticity can be described in this case by the formula\n\u0010\n\nA2 e−β /B0\n\n\u00112\n\n\u0010\n\n+\n\ncos2 (Q3 φ0 τ )\n\nA3 eβ /B0\n\n\u00112\n\nsin2 (Q3 φ0 τ )\n\n= 1.\n\n(131)\n\nThus, the polarization rotation rate is predetermined by the function Q3 φ0 τ , and the quantity\n[∇φ]effective = Q3 φ0\n\n√\n\n\n\n\n\nH(GW)  ω(EM )\n2  2\n(1− cos θ)\nλ(GW)\nc\n\n(132)\n\ncan be considered as an equivalent of the gradient of the pseudoscalar field for the estimates\nof the effect. The frequency dependence is different from the Faraday rotation in an ionized\nmedium. From (132), the order of magnitude of [∇φ]effective from a microwave of frequency\n100 GHz is\n\n\nH\n(GW) \ncm−1 ,\n(133)\n[∇φ]effective ≃ 4.7 Q3 φ0  2\nλ(GW)\n\nhence,\n\n−1\n\n|∆φeffective | ≃ 4.7 cm Q3 φ0\n\n\"\n\n#\n\nH(GW)\n.\nλ(GW)\n\n(134)\n\nLet H(GW) = 10−15 ξ, where ξ ≤ 1; then for\nλ(GW) = Hubble Distance = 1.3 * 1028 cm\n\n(135)\n\n|∆φeffective | ≃ 3.6 * 10−43 ξcm−2 Q3 φ0 .\n\n(136)\n\n∆φ = 0.0096 ± 0.0143 ± 0.008 rad .\n\n(137)\n\nwe have\nConstraints on cosmic polarization rotation angle φ come from three kinds of observations:\n(i) polarization observations of radio galaxies; (ii) optical/UV polarization observations of\nradio galaxies; (iii) CMB polarization observations. Radio observations put a limit of ∆φ ≤\n0.17 − 1.0 rad over cosmological distance from various types of analysis (see, e.g., [21] for\na review). Optical/UV observations put a limit of ∆φ ≤ 0.17 rad [78, 79]. The QUaD\nobservations [80] on CMB polarization give the most stringent constraint on ∆φ [81]\n\nFor gravitational waves with a wavelength of the order of the Hubble distance, this is the\nconstraint, ∆φHD ; for shorter wavelength, λ, we have to use the estimate\n∆φλ ≃ ∆φHD\n\n(\n\nλ\nHubble Distance\n\n)\n\n.\n\n(138)\n\nIn the general case, ∆φ depends on directions [22]. Constraints on polarization rotation\ncould also come from solar system observations: the analysis of these data are under study.\nCombining the estimate (136) with (138) and using the relation φ = 2φ, we have the constraint Q3 φ0 < 2 * 1041 ξ −1 cm2 .\n23\n\n\f5\n\nConclusions\n\n1. We formulated a new non-minimal ten-parameter Einstein-Maxwell-axion model, i.e. on\nthe basis of the Lagrangian approach, we derived a non-minimally extended self-consistent\n(coupled) system of equations for electromagnetic (see equations (20),(21),(22)), pseudoscalar\n(see equation (23)) and gravitational (see (24)-(37)) fields. The Lagrangian is linear in the\ncurvature tensor and its contractions, and is quadratic in the Maxwell tensor, i.e. we deal\nwith one of the versions of non-minimal linear axion electrodynamics.\n2. The constitutive tensor (see (40) with (14)-(18)), associated with this model, is manifestly\nsymmetric with respect to transposition of pairs of indices, i.e. this model excludes skewons\n[27] and describes non-minimal interaction of photons and axions only. An extension of the\nmodel accounting for skewon-type interactions will be considered separately.\n3. Decomposition of the constitutive tensor demonstrates explicitly that the dielectric\npermittivity, magnetic impermeability tensors and the tensor of cross-effects (or tensor of\nmagneto-electric coefficients, in other words) acquire non-minimal contributions, including\nterms proportional to the pseudoscalar (axion) field. Since the tensor of non-minimal crosseffects is non-vanishing, one may conclude that, generally, the curvature-induced effect of\noptical activity is expected, even if the pseudoscalar (axion) field is constant.\n4. We applied the non-minimal Einstein-Maxwell-axion model to the case when the spacetime has the pp-wave symmetry and all the physical fields inherit this symmetry. The\nreduced system of equations contains in this case only one key-equation (55). We presented\nnine examples of exact solutions for the non-minimally coupled electromagnetic, axion and\ngravitational fields with pp-wave symmetry. One can emphasize three new solutions among\nthem. First, there is a new regular solution (see section 3.3.1.), which can appear in the\nnon-minimal model only; the term regularity means that gravitational, electromagnetic and\npseudoscalar fields have no singularities and are described by the functions finite everywhere.\nSecond, there exist exact solutions describing circularly polarized electromagnetic waves coupled non-minimally to the axion field and plane gravitational waves (see (80)-(82)). Third,\nthe solution which is known as Cheshire smile is also admissible in this model (see section\n3.3.4).\n5. Discussing the optical activity induced by photon-axion interaction, we solved exactly the\nproblem of propagation of test electromagnetic waves coupled non-minimally to the pseudoscalar and gravitational fields in the pp-wave background. According to the classification\nof the models of photon-axion interaction given in the paper [72], we deal here with the case\nwhen the four-gradient of the pseudoscalar field is a null four-vector, i.e. ∇k φ∇k φ = 0. We\nshow explicitly that the non-minimal coupling of the photon and axions with gravitational\nfield generally leads to the birefringence effect. We discussed explicit exact solutions which\ndescribe the effect of optical activity.\n6. Non-minimal Einstein-Maxwell-axion model can give the cosmological solutions of the\nFLRW and Bianchi-I type, as well as static spherically symmetric solutions of the ReissnerNordström type. We intend to consider the corresponding exact solutions in the near future.\n\n24\n\n\fAcknowledgments\nWe thank the National Natural Science Foundation of China (Grant No. 10875171) and\nRussian Foundation for Basic Research (Grants No. 08-02-00325-a and 09-05-99015) for\nsupport. A.B. is grateful to colleagues from the Center for Gravitation and Cosmology of\nPurple Mountain Observatory of Chinese Academy of Science for hospitality.\n\nReferences\n[1] Kallosh R, Linde A, Linde D and Susskind L 1995 Gravity and global symmetries Phys.\nRev. D52 912 (arXiv:hep-th/9502069)\n[2] Peccei R D 2008 The Strong CP problem and axions Lect. Notes Phys. 741 3\n(arXiv:hep-ph/0607268)\n[3] Raffelt G G 1990 Astrophysical methods to constrain axions and other novel particle\nphenomena Phys. Rep. 198 1-113\n[4] Turner M S 1990 Windows on the axion Phys. Rep. 197 67-97\n[5] Battesti R et al 2008 Axion searches in the past, at present, and in the near future Lect.\nNotes Phys. 741 199 (arXiv:0705.0615)\n[6] Ni W-T 1973 Nonmetric theory of gravity preprint (Montana, USA: Montana State\nUniversity, Bozeman) (http://cgc.pmo.ac.cn)\n[7] Ni W-T 1974 Weak equivalence principles and gravitational coupling Bull. Am. Phys.\nSoc. 19 655\n[8] Ni W-T 1977 Equivalence principles and electromagnetism Phys. Rev. Lett. 38 301\n[9] Peccei R D and Quinn H R 1977 CP conservation in the presence of pseudoparticles\nPhys. Rev. Lett. 38 1440\n[10] Weinberg S 1978 A new light boson? Phys. Rev. Lett. 40 223\n[11] Wilczek F 1978 Problem of strong P and T invariance in the presence of instantons\nPhys. Rev. Lett. 40 279\n[12] Wilczek F 1987 Two applications of axion electrodynamics Phys. Rev. Lett. 58 1799\n[13] Bretón N 2000 Exact solutions in Einstein-Maxwell-dilaton-axion theory Recent developments in gravitation ed J Ibáñez (España: Univ. Paı́s Vasco Proceedings of ERE 99)\np 179\n[14] Sur S, Das S and SenGupta S 2005 Charged black holes in generalized dilaton-axion\ngravity JHEP 0510 064 (arXiv: hep-th/050815)\n\n25\n\n\f[15] Bassett B A and Kunz M 2004 Cosmic acceleration vs axion-photon mixing Astrophys.\nJ. 607 661 (arXiv: astro-ph/0311495)\n[16] Halilsoy M and Sakalli I 2003 Collision of electromagnetic shock waves coupled with\naxion waves: An Example Class. Quantum Grav. 20 1417 (arXiv: gr-qc/0303102)\n[17] Nojiri S, Odintsov S D, Ogushi S, Sugamoto A and Yamamoto M 1999 Axiondilatonic conformal anomaly from Ads/CFT correspondence Phys.Lett. B 465 128\n(arXiv:hep-th/9908066)\n[18] López L A and Bretón N 2007 Asymptotic singular behaviour of inhomogeneous cosmologies in Einstein-Maxwell-dilaton-axion theory Gen. Relat. Grav. 39 153 (arXiv:\ngr-qc/0608125)\n[19] Carroll S M, Field G B and Jackiw R 1990 Limits on a Lorentz- and parity-violating\nmodification of electrodynamics Phys. Rev. D 41 1231\n[20] Carroll S M and Field G B 1991 Einstein equivalence principle and the polarization of\nradio galaxies Phys. Rev. D 43 3789\n[21] Ni W-T 2008 From equivalence principles to cosmology: cosmic polarization rotation,\nCMB observation, neutrino number asymmetry, Lorentz invariance and CPT Prog.\nTheor. Phys. Suppl. 172 49 (arXiv:0712.4082)\n[22] Ni W-T 2009 Cosmic polarization rotation, cosmological models, and the detectability\nof primordial gravitational waves Int. J. Mod. Phys. A 18 & 19 3493 (arXiv:0903.0756)\n[23] Zavattini E et al (PVLAS Collaboration) 2006 Experimental observation of optical\nrotation generated in vacuum by a magnetic field Phys. Rev. Lett. 96 110406\n[24] Chen S-J, Mei H-H and Ni W-T 2007 Q & A experiment to search for vacuum dichroism,\npseudoscalar-photon interaction and millicharged fermions Mod. Phys. Lett. A 22 2815\n(arXiv:hep-ex/0611050)\n[25] Zavattini E et al 2008 New PVLAS results and limits on magnetically induced optical\nrotation and ellipticity in vacuum Phys. Rev. D 77 032006 (arXiv:0706.3419)\n[26] Battesti R et al 2008 The BMV experiment: a novel apparatus to study the propagation\nof light in a transverse magnetic field Eur. Phys. J. D 46 323 (arXiv:0710.1703)\n[27] Hehl F W and Obukhov Yu N 2003 Foundations of classical electrodynamics: Charge,\nflux, and metric (Boston: Birkhäuser)\n[28] Hehl F W and Obukhov Yu N 2005 Linear media in classical electrodynamics and the\nPost constraint Phys. Lett. A 334 249 (arXiv:physics/0411038)\n[29] Hehl F W and Obukhov Yu N 2005 Measuring a piecewise constant axion field in\nclassical electrodynamics Phys. Lett. A 341 357 (arXiv:physics/0504172)\n26\n\n\f[30] Faraoni V, Gunzig E and Nardone P 1999 Conformal transformations in classical gravitational theories and in cosmology Fundam. Cosm. Phys. 20 121 (arXiv:gr-qc/9811047)\n[31] Amendola L 1993 Cosmology with non-minimal derivative couplings Phys. Lett. B 301\n175\n[32] Capozziello S and Lambiase G 1999 Non-minimal derivative coupling and the recovering\nof cosmological constant Gen. Rel. Grav. 31 1005 (arXiv:gr-qc/9901051)\n[33] Capozziello S, Lambiase G and Schmidt H-J 2000 Non-minimal derivative couplings and\ninflation in generalized theories of gravity Annalen Phys. 9 39 (arXiv:gr-qc/9906051)\n[34] Prasanna A R 1971 A new invariant for electromagnetic fields in curved spacetime Phys.\nLett. A 37 331\n[35] Hehl F W and Obukhov Yu N 2001 How does the electromagnetic field couple to gravity,\nin particular to metric, nonmetricity, torsion, and curvature? Lect. Notes Phys. 562\n479 (arXiv:gr-qc/0001010)\n[36] Novello M and Salim J M 1979 Nonlinear photons in the universe Phys. Rev. D 20 377\n[37] Drummond I T and Hathrell S J 1980 QED vacuum polarization in a background\ngravitational field and its effect on the velocity of photons Phys. Rev. D 22 343\n[38] Accioly A J, Vaidya A N and Som M M 1983 Non-minimal coupling and Bianchi type-I\ncosmologies Phys. Rev. D 28 1853\n[39] Goenner H F M 1984 Theories of gravitation with non-minimal coupling of matter and\nthe gravitational field Found. Phys. 14 865\n[40] Turner M S and Widrow L M 1988 Inflation-produced, large-scale magnetic fields Phys.\nRev. D 37 2743\n[41] Mohanty S and Prasanna A R 1998 Photon propagation in Einstein and higher derivative\ngravity Nucl. Phys. B 526 501 (arXiv:gr-qc/9804017)\n[42] Teyssandier P 2004 Variation of the speed of light due to non-minimal coupling between\nelectromagnetism and gravity Annales Fond. Broglie 29 173 (arXiv:gr-qc/0303081)\n[43] Lafrance R and Myers R C 1995 Gravity's rainbow: Limits for the applicability of the\nequivalence principle Phys. Rev. D 51 2584 (arXiv:hep-th/9411018)\n[44] Solanki S K et al 2004 Solar constraints on new couplings between electromagnetism\nand gravity Phys. Rev. D 69 062001 (arXiv:gr-qc/0402055)\n[45] Kostelecky A and Mewes M 2002 Signals for Lorentz violation in electrodynamics Phys.\nRev. D 66 056005 (arXiv:hep-ph/0205211)\n\n27\n\n\f[46] Bamba K and Odintsov S D 2008 Inflation and late-time cosmic acceleration in nonminimal Maxwell-F (R) gravity and the generation of large-scale magnetic fields JCAP\n0804 024 (arXiv:0801.0954)\n[47] Balakin A B and Lemos J P S 2005 Non-minimal coupling for the gravitational and\nelectromagnetic fields: A general system of equations Class. Quant. Grav. 22 1867\n(arXiv:gr-qc/0503076)\n[48] Balakin A B, Bochkarev V V and Lemos J P S 2008 Non-minimal coupling for the\ngravitational and electromagnetic fields: black hole solutions and solitons Phys. Rev. D\n77 084013 (arXiv:0712.4066)\n[49] Rubilar G F, Obukhov Yu N and Hehl F W 2003 Torsion non-minimally coupled to the electromagnetic field and birefringence Class. Quantum Grav. 20 L185\n(arXiv:gr-qc/0305049)\n[50] Itin Ya and Hehl F W 2003 Maxwell's field coupled non-minimally to quadratic torsion: Induced axion field and birefringence of the vacuum Phys. Rev. D 68 127701\n(arXiv:gr-qc/0307063)\n[51] Balakin A B and Zayats A E 2007 Non-minimal Wu-Yang monopole Phys. Lett. B 644\n294 (arXiv:gr-qc/0612019)\n[52] Balakin A B, Sushkov S V and Zayats A E 2007 Non-minimal Wu-Yang wormhole Phys.\nRev. D 75 084042 (arXiv:0704.1224)\n[53] Balakin A B, Dehnen H and Zayats A E 2007 Non-minimal Einstein-Yang-Mills-Higgs\ntheory: Associated, color and color-acoustic metrics for the Wu-Yang monopole model\nPhys. Rev. D 76 124011 (arXiv:0710.5070)\n[54] Balakin A B, Dehnen H and Zayats A E 2008 Non-minimal pp-wave Einstein-YangMills-Higgs model: color cross-effects induced by curvature Gen. Relat. Grav. 40 2493\n(arXiv:0803.3442)\n[55] Bamba K, Nojiri S and Odintsov S D 2008 Inflationary cosmology and the late-time\naccelerated expansion of the universe in non-minimal Yang-Mills-F (R) gravity and nonminimal vector-F (R) gravity Phys. Rev. D77 123532 (arXiv:0803.3384)\n[56] Balakin A B, Dehnen H and Zayats A E 2008 Effective metrics in the non-minimal\nEinstein-Yang-Mills-Higgs theory Annals of Physics 323 2183 (arXiv:0804.2196)\n[57] Eringen A C and Maugin G A 1989 Electrodynamics of continua (New York: SpringerVerlag)\n[58] Landau L D, Lifshitz E M and Pitaevskii L P 1996 Electrodynamics of continuous media\n(Oxford: Butterworth Heinemann)\n[59] O'Dell T H 1970 The electrodynamics of magneto-electric media (Amsterdam: NorthHolland)\n28\n\n\f[60] Ni W-T 1983 Equivalence principles, their empirical foundations, and the role of precision experiments to test them Precision measurement and gravity experiment ed W-T\nNi (Taipei, Republic of China: National Tsing Hua Univ.) p 491\n[61] Ni W-T 1984 Equivalence principles and precision experiments Precision measurement\nand fundamental constants II eds B N Taylor and W D Phillips (Washington D C,\nUSA: National Bureau of Standarts special publication No 617 US Government printing\nOffice) p 647\n[62] Ni W-T 1984 Timing observations of the pulsar propagations in the galactic gravitational field as precision tests of the Einstein equivalence principle Proceedings of the\nSecond Asian-Pacific Regional Meeting of the International astronomical Union eds B\nHidayat and M W Feast (Jakarta, Indonesia: Tira Pustaka) p 441\n[63] Lämmerzahl C and Hehl F W 2004 Riemannian light cone from vanishing birefringence\nin premetric vacuum electrodynamics Phys. Rev. D 70 105022 (arXiv:gr-qc/0409072)\n[64] Misner C W, Thorne K S and Wheeler J A 1973 Gravitation (San Francisco: Freeman)\n[65] Balakin A B and Lemos J P S 2001 Singular behaviour of electric and magnetic fields in\ndielectric media in a non-linear gravitational wave background Class. Quantum Grav.\n18 941 (arXiv:gr-qc/0101123)\n[66] Bondi H, Pirani F A E and Robinson I 1959 Gravitational waves in general relativity,\nIII, Exact plane waves Proc. Roy Soc. A 251 519\n[67] Petrov A Z 1969 Einstein spaces (Oxford UK: Pergamon Press)\n[68] Synge J L 1971 Relativity: the general theory (Amsterdam: North-Holland)\n[69] Stephani H, Kramer D, MacCallum M, Hoenselaers C and Herlt E 2003 Exact solutions\nof Einstein's field equations (Cambridge, UK: University Press)\n[70] Ayón-Beato E and Hossaïne M 2005 Scalar fields non-minimally coupled to pp waves\nPhys. Rev. D 71 084004 (arXiv:hep-th/0501040)\n[71] Ayón-Beato E, Martı́nez C, Troncoso R and Zanelli J 2005 Gravitational Cheshire effect:\nNon-minimally coupled scalar fields may not curve spacetime Phys. Rev. D 71, 104037\n(arXiv:hep-th/0505086)\n[72] Itin Y 2008 Wave propagation in axion electrodynamics Gen. Relat. Grav. 40 1219\n(arXiv:0706.2991)\n[73] Balakin A B and Lemos J P S 2002 Optical activity induced by curvature in a gravitational pp-wave background Class. Quantum Grav. 19 4897 (arXiv:gr-qc/0209062)\n[74] Balakin A B 1997 Gravitational radiation and birefringence induced by curvature Class.\nQuantum Grav. 14 2881\n29\n\n\f[75] Balakin A B, Kerner R and Lemos J P S 2001 Cherenkov radiation in a gravitational\nwave background Class. Quantum Grav. 18 2217 (arXiv:gr-qc/0012101)\n[76] Prasanna A R and Mohanty S 2003 Constraints on non-minimally coupled curved\nspace electrodynamics from astrophysical observations Class. Quant. Grav. 20 3023\n(arXiv:gr-qc/0306021)\n[77] Kramer M et al 2006 Tests of general relativity from timing the double pulsar Science\n314 97 (arXiv:astro-ph/060941)\n[78] Cimatti A, di Serego Alighieri S, Field G B and Fosbury R A E 1994 Stellar and\nscattered light in a radio galaxy at z = 2.63 Astrophys. J. 422 562\n[79] di Serego Alighieri S, Field G B and Cimatti A 1995 The physics of the interstellar\nmedium and intergalactic medium ASP Conference Series 80 276\n[80] Pryke C et al 2009 Second and third season QUaD CMB temperature and polarization\npower spectra Astrophys. J 692 1247 (arXiv:0805.1944)\n[81] Wu E-Y-S et al 2009 Parity violation constraints using cosmic microwave background\npolarization spectra from 2006 and 2007 observations by the QUaD polarimeter Phys.\nRev. Lett. 102 161302 (arXiv:0811.0618)\n\n30\n\n\f"}