{"id": "http://arxiv.org/abs/0905.1634v1", "guidislink": true, "updated": "2009-05-11T15:11:28Z", "updated_parsed": [2009, 5, 11, 15, 11, 28, 0, 131, 0], "published": "2009-05-11T15:11:28Z", "published_parsed": [2009, 5, 11, 15, 11, 28, 0, 131, 0], "title": "A model for liquid-striped liquid phase separation in liquids of\n  anisotropic polarons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.1361%2C0905.4424%2C0905.1759%2C0905.1015%2C0905.4839%2C0905.2769%2C0905.0066%2C0905.0760%2C0905.2083%2C0905.3007%2C0905.4165%2C0905.3761%2C0905.2724%2C0905.0238%2C0905.1898%2C0905.4104%2C0905.4140%2C0905.4226%2C0905.0715%2C0905.3755%2C0905.0422%2C0905.1475%2C0905.1132%2C0905.1831%2C0905.3561%2C0905.0864%2C0905.0697%2C0905.4832%2C0905.1879%2C0905.2664%2C0905.3969%2C0905.0573%2C0905.2129%2C0905.4528%2C0905.0575%2C0905.4415%2C0905.0847%2C0905.0435%2C0905.1684%2C0905.1848%2C0905.0965%2C0905.0276%2C0905.1230%2C0905.1781%2C0905.0789%2C0905.1379%2C0905.0882%2C0905.1715%2C0905.4514%2C0905.4157%2C0905.0252%2C0905.4156%2C0905.3434%2C0905.4421%2C0905.4070%2C0905.1669%2C0905.2089%2C0905.1559%2C0905.3121%2C0905.0963%2C0905.1053%2C0905.4206%2C0905.0350%2C0905.3544%2C0905.2385%2C0905.0714%2C0905.3971%2C0905.4387%2C0905.4355%2C0905.1829%2C0905.1318%2C0905.0538%2C0905.2489%2C0905.2540%2C0905.1617%2C0905.0099%2C0905.2173%2C0905.2882%2C0905.4320%2C0905.3468%2C0905.3713%2C0905.2135%2C0905.0437%2C0905.2341%2C0905.2476%2C0905.2779%2C0905.4061%2C0905.1067%2C0905.0615%2C0905.2388%2C0905.4395%2C0905.2342%2C0905.1634%2C0905.1498%2C0905.2768%2C0905.2009%2C0905.3877%2C0905.1339%2C0905.2900%2C0905.0150%2C0905.2867&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A model for liquid-striped liquid phase separation in liquids of\n  anisotropic polarons"}, "summary": "The phase separation between a striped polaron liquid at the particular\ndensity and a high density polaron liquid is described by a modified Van der\nWaals scheme. The striped polaron liquid represents the pseudo gap matter or\nWigner-like polaron phase at 1/8 doping in cuprate superconductors. The model\nincludes the tendency of pseudo- Jahn-Teller polarons to form anisotropic\ndirectional bonds at a preferential volume with the formation of different\nliquid phases. The model gives the coexistence of a first low density polaron\nstriped liquid and a second high density liquid that appears in cuprate\nsuperconductors for doping larger than 1/8. We discuss how the strength of\nanisotropic bonds controls the variation the phase separation scenarios for\ncomplex systems in the presence of a quantum critical point where the phase\nseparation vanishes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.1361%2C0905.4424%2C0905.1759%2C0905.1015%2C0905.4839%2C0905.2769%2C0905.0066%2C0905.0760%2C0905.2083%2C0905.3007%2C0905.4165%2C0905.3761%2C0905.2724%2C0905.0238%2C0905.1898%2C0905.4104%2C0905.4140%2C0905.4226%2C0905.0715%2C0905.3755%2C0905.0422%2C0905.1475%2C0905.1132%2C0905.1831%2C0905.3561%2C0905.0864%2C0905.0697%2C0905.4832%2C0905.1879%2C0905.2664%2C0905.3969%2C0905.0573%2C0905.2129%2C0905.4528%2C0905.0575%2C0905.4415%2C0905.0847%2C0905.0435%2C0905.1684%2C0905.1848%2C0905.0965%2C0905.0276%2C0905.1230%2C0905.1781%2C0905.0789%2C0905.1379%2C0905.0882%2C0905.1715%2C0905.4514%2C0905.4157%2C0905.0252%2C0905.4156%2C0905.3434%2C0905.4421%2C0905.4070%2C0905.1669%2C0905.2089%2C0905.1559%2C0905.3121%2C0905.0963%2C0905.1053%2C0905.4206%2C0905.0350%2C0905.3544%2C0905.2385%2C0905.0714%2C0905.3971%2C0905.4387%2C0905.4355%2C0905.1829%2C0905.1318%2C0905.0538%2C0905.2489%2C0905.2540%2C0905.1617%2C0905.0099%2C0905.2173%2C0905.2882%2C0905.4320%2C0905.3468%2C0905.3713%2C0905.2135%2C0905.0437%2C0905.2341%2C0905.2476%2C0905.2779%2C0905.4061%2C0905.1067%2C0905.0615%2C0905.2388%2C0905.4395%2C0905.2342%2C0905.1634%2C0905.1498%2C0905.2768%2C0905.2009%2C0905.3877%2C0905.1339%2C0905.2900%2C0905.0150%2C0905.2867&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The phase separation between a striped polaron liquid at the particular\ndensity and a high density polaron liquid is described by a modified Van der\nWaals scheme. The striped polaron liquid represents the pseudo gap matter or\nWigner-like polaron phase at 1/8 doping in cuprate superconductors. The model\nincludes the tendency of pseudo- Jahn-Teller polarons to form anisotropic\ndirectional bonds at a preferential volume with the formation of different\nliquid phases. The model gives the coexistence of a first low density polaron\nstriped liquid and a second high density liquid that appears in cuprate\nsuperconductors for doping larger than 1/8. We discuss how the strength of\nanisotropic bonds controls the variation the phase separation scenarios for\ncomplex systems in the presence of a quantum critical point where the phase\nseparation vanishes."}, "authors": ["D. Innocenti", "A. Ricci", "N. Poccia", "G. Campi", "M. Fratini", "Antonio Bianconi"], "author_detail": {"name": "Antonio Bianconi"}, "author": "Antonio Bianconi", "arxiv_comment": "10 pages, 3 figures", "links": [{"href": "http://arxiv.org/abs/0905.1634v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.1634v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.1634v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.1634v1", "journal_reference": null, "doi": null, "fulltext": "A model for liquid-striped liquid phase separation\nin liquids of anisotropic polarons\nD. Innocenti1, A. Ricci1, N. Poccia1, G. Campi2, M. Fratini1, Antonio Bianconi1*\n1\n\nDepartment of Physics, Sapienza University of Rome, P. Aldo Moro 2, 00185 Rome, Italy\n2\nIstituto di Cristallografia, CNR, Via Salaria Km 29, 300, 00016 Monterotond,Rome, Italy\n\nAbstract: The phase separation between a striped polaron liquid at the particular\ndensity and a high density polaron liquid is described by a modified Van der Waals\nscheme. The striped polaron liquid represents the pseudo gap matter or Wigner-lke\npolaron phase at 1/8 doping in cuprate superconductors. The model includes the\ntendency of pseudo-Jahn Teller polarons to form anisotropic directional bonds at a\npreferential volume with the formation of different \"liquid phases\". The model\ngives the co-existence of the polaron striped-liquids – high density liquid that\nappears in cuprate superconductors for doping larger than 1/8. We discuss as the\nstrength of anisotropic bonds controls the variation the phase separation scenarios\nfor complex systems with the presence of quantum critical point where the phase\nseparation vanishes.\nKey words: Phase Separation, Critical Point, Spinodal Lines, Phase Diagrams, Van der Waals,\nAnisotropic Interactions, Polaron liquids.\nCorresponding author Antonio Bianconi\nEmail Antonio.bianconi@roma1.infn.it\n\n\f1.\n\nIntroduction\n\nThe Van der Waals scheme is the simplest scheme to describe the spinodal phase separation in\ncomplex system such as polaron liquids. It has been used to study the phase separation in a polaron\nliquid by Emin [1,2]. We propose to extend the Van der Walls scheme to describe the complex\nphase separation in cuprates appearing for doping larger than 1/8 where a polaron striped metallic\nphase with doping larger than 1/8 co-exists with a high density phase [3-6]. This phase separation\nhas been shown to be driven by the co-existence of pseudo Jahn-Teller polarons (PJTP), associated\nwith the rombic distortion of the CuO4 square plane and its tilting in the vertical o horizontal\ndirection or antinodal directions.[7-10] These PJTP polarons are in the intermediate coupling range\nbetween large and small polarons, having an area of about 8 Cu sites. [11] These PJTP coexist with\nitinerant particles moving in the nodal direction. [12,13]\nThe PJTP get self organized below a critical temperature T* with the formation of electronic\npolaron striped phases at critical density close to 1/8 holes per Cu site, giving the so called\npseudogap phase. [14-21] The interaction between the PJTP is clearly anisotropic because of the\nassociated rombic distortion therefore they have the tendency to form linear polaron strings. [22,\n23] The polaronic electron-phonon interaction depends in these heterostructrures at the atomic limit\n[24-26] on the lattice misfit strain between the active CuO2 layers and the spacer layers. [27-31] that\nplays a key role also in diborides [32] and iron pnictides [33].\nThe phase diagram of cuprate superconductors shows that a PJTP polarons striped phase called also\na quasi 1D generalized Wigner polaron crystal is formed at critical values of the charge density (1/8\nholes per Cu site and a critical strength of the elastic field due to the misfit strain. The critical\ndensity for the formation of a electronic polaronic crystal depends on the effective volume occupied\nby the polaron carriers. The anisotropic interactions between the polarons produce the stripe phases.\nIn order to give account of the new emerging complex phase diagram, where phase separation is\ncontrolled by doping and misfit strain [27-33], we have extended the model of Poole et al. [34] for\nsupercooled water, as proposed by Campi et al. [35], to describe the 3D phase diagram including all\ndifferent HTcS families.\n\n2.\n\nThe model\n\nWe use a modified Van der Waals interaction model, analogously to the one introduced for the\nphase diagram of supercooled water [34,35]. In fact, supercooled water, a prototype of complex\nmatter, shows a phase separation driven by the tendency of water molecules to form quasi 1D arrays\nof hydrogen bonds. This tendency gives fluctuating clusters made of a low density liquid (LDL) that\ncoexists with the high density liquid water (HDL). In order to describe this anomalous phase\nseparation in water, the model of Poole et al. [35] implements the standard Van der Waals model by\nincluding a characteristic gain in energy \"γ\" for the formation of clusters with directional hydrogen\nbonds at a particular preferential volume \"Vγ\". The introduction of this anisotropic interaction\nprovides a phase diagram with the coexistence of a high density liquid (HDL) and a low density\nliquid (LDL) when γ is larger than a threshold value.\nHere we have extended the Poole model in order to describe the phase separation in the polaron\nliquid in cuprates. The free energy of a complex system in which a phase separation is observed, is\nobtained by adding the term Aγ, to the Van der Waals free energy AVDW yielding a total free energy:\nA = AVDW + Aγ\n\n(1)\n\n\fwhere AVDW and Aγ are given by:\nAVdW = −RT{ln[(V − b) / Λ3 ]+ 1}− a 2 /V\n\n(2)\n\n\n γ \nAγ = − RTf ln Ω + exp −\n − RT (1 − f )(Ω + 1) (3)\n RT \n\nHere a and b are the standard Van der Waals constants. The Van der Waals constant a is associated\nwith the isotropic inter-particle attraction and the constant b is associated to the volume occupied by\nfluid particle. These parameter are used to define the critical values of thermodynamic variables Tc,\nPc and Vc and the standard parameter γ0 = a/b for the Van der Waals model. The value of the\nparameter Ω is defined as Ω = exp(-Sγ/R), where Sγ is entropy of formation for a mole of\nanisotropic bonds. The intermediate phase is characterized by the anisotropic inter-particle\ninteraction γ. In this approach there are Ω>>1 configurations all having γ = 0 and only a single\nconfiguration in which the formation of the anisotropic bonds with energy γ is allowed. The\nanisotropic interaction is most likely to occur when the bulk molar volume is consistent with the\npreferential volume Vγ. In fact, each particle has an optimal local volume for the formation of\nanisotropic bonds to its neighbors. Changing the particle density, when V ≠ Vγ, the anisotropic\ninteractions are only a fraction f of the total, since V is no longer consistent with the possibility that\nall anisotropic interactions are saturated at the optimal volume. The remaining fraction of bonds, 1f, occurs in an unfavorable local volume and therefore, they cannot form the anisotropic bonds of\nthe phase. The term f is given by:\n\n  V − Vγ\nf = − \n  σ\n\n\n\n\n\n2\n\n\n\n\n\n(4)\n\nwhere σ characterizes the width of the region of volume around Vγ over which a significant fraction\nof anisotropic bonds can be described by Eq. (3).\nTo describe the phase diagram of xuprates where we observe two phase separations, we consider a\nPoole model with one anisotropic interaction γ giving rise to the intermediate phase with\npreferential volume Vγ. that simulate the striped polaron phase in cuprates at doping 1/8.\nThe inclusion in the model of the optimum volume Vγ for the anisotropic bond introduces a new\nminimum in the free energy when V approaches Vγ. In Fig. 1 we have plotted the normalized free\nenergy A/γ0 as functions of the normalized volume V/Vc at the fixed normalized interaction energy\nγ/γc = 1. We observe in the phase diagram that the new minimum occurs only for temperature lower\nthan the critical value T/Tc = 0.68.\nWe observe that the effect of the Aγ term in Eq. (1), related with the strength of the anisotropic\ninteractions, is to \"split\" the normal Van der Waals spinodal curve by imposing thermodynamic\nstability in the region of states centered at the reduced density b/V = 0.5 where the intermediate\nphase is stable. As a result, two spinodal lines occur, each terminating at a critical point producing\ntwo phase separation regions. As the directional bond energy γ decrease respect with the Van der\nWaals interaction γ0, the phase separations generated by the strength of the directional bond\ndecrease and the stabilizing effect of Aγ set in only at lower temperature. The critical points merge\nwith the high density spinodal of the main Van der Waals spinodal line that is formed when γ go to\nzero.\nIn the phase diagrams of panel a), b), c) of Fig. 2 we change the γ value in order to show the effects\nof the strength of the anisotropic interaction on the thermodynamic behavior of the system.\n\n\fIn panel a), we have used the value γ/γ0 = 3.0, in fact for a value of γ/γ0 > γc we observe that appear\na second phase separation that becomes more defined when we continue to increase γ interaction.\nWhen γ decreasing to the critical value (γ=γc) γ/γ0 = 1.48, the two spinodal lines, (1+2) and (2+3),\nare going to overlap in a point (panel b), and then, when γ becomes lower than the threshold γ0, a\nphase separation merges with the other in a greater region of phase coexistence and the intermediate\nphase (2) becomes an isolated pocket of stability completely enclosed within a spinodal line as\nshow in the panel c). If we continue to decrease the strength of the anisotropic interaction we obtain\na more isolated pocket with a lower critical temperature until when the anisotropic interaction\nγ/γ0 go to zero we reach a quantum critical point where we obtain the standard Van der Waals phase\ndiagram.\n\n3. Interaction energy phase diagram\nHere present the phase diagram at constant low temperature as a function of the directional\ninteraction energy and the reduced density. We have used the previous phase diagrams to get the\nnew one, in fact we calculate the value of each interaction energy normalized γ/γc at a certain\nreduced density b/V with the temperature fixed at a fixed value.\nAs we have normalized all the thermodynamic variables and energies respect with their critical\nvalues we obtain a universal phase diagram.\nWe obtain that three different phases occur, separated by three regions of phase coexistence. As the\ntemperature increases, the phase separations generated by the strength of the directional bond\ndecrease and the different phases are no longer well separated.\nIn the phase diagram of Fig. 3 we use value T/Tc = 0.4 and we observe the occurrence of three\ndifferent phases, well separated by three regions of phase coexistence.\n\n4.\n\nConclusions\n\nIn conclusion we have presented a model for an electronic complex system that simulate the phase\ndiagram of the polaron liquid in cuprates with coexistence of different electronic phases at critical\ndensities and coexistence of different liquids described by the modified Van der Waals model.\nWe discuss the critical values of the anisotropic interactions for the spinodal lines and we find that\nthis model is able to describe a generic complex system with a variable anisotropic energy\ninteraction.\nFinally we have shown a phase diagram for complex system where critical temperature depends on\nthe density and the energy of the anisotropic interaction.\nThis approach might be useful to study complex phased separations like that in high Tc\nsuperconductors\n\nAknowledgements: This work was supported by European project 517039 \"Controlling\nMesoscopic phase separation\" (COMEPHS) (2005).\n\n\fReferences\n1.\n2.\n3.\n\n4.\n5.\n\n6.\n\n7.\n\n8.\n9.\n\n10.\n\n11.\n\n12.\n13.\n\n14.\n\n15.\n\n16.\n\nD. Emin, Phys. Rev. B, 49, 9157 (1994).\nD. Emin, Phys. Rev. Lett. 72, 1052 (1994).\nF. V. Kusmartsev, D. Di Castro, G. Bianconi and A. Bianconi, Transformation of strings\ninto an inhomogeneous phase of stripes and itinerant carriers Physics Letters A 275,\n118 (2000).\nF. V. Kusmartsev and Mikko Saarela Two-component physics of cuprates and\nsuperconductor–insulator transitions Supercond. Sci. Technol. 22, 014008 (2009)\nK. I. Kugel, A. L. Rakhmanov, A. O. Sboychakov, Nicola Poccia and Antonio Bianconi\nA model for the phase separation controlled by doping and the internal chemical\npressure in different cuprate superconductors. Phys. Rev. B 78, 165124 (2008)\nK I Kugel, A L Rakhmanov, A O Sboychakov, F V Kusmartsev, Nicola Poccia and\nAntonio Bianconi A two-band model for the phase separation induced by the chemical\nmismatch pressure in different cuprate superconductors Supercond. Sci. Technol. 22,\n014007 (200\nA. Bianconi, A.-M. Flank, P. Lagarde, C. Li, I. Pettiti, M. Pompa, and D. Udron On the\nCu 3d holes in high Tc superconductors. Is a Cu 3dz2-r2 bipolaron the superconducting\npair? in \"Electronic Structure and Mechanisms of High Temperature\nSuperconductivity\", J. Askenazi, and G. Vezzoli editors, Plenum, New York (1992)\n(Proc. of the Miami Workshop, Miami 3-9 January 1991.\nA. Bianconi N. L Saini, A. Lanzara, M. Missori, T. Rossetti, H. Oyanagi, H. Yamaguchi,\nK. Oka, T.Ito Phys. Rev. Lett 76, 3412-3415 (1996)\nK. A. Müller Essential Heterogeneities in Hole-Doped Cuprate Superconductors in\n\"Superconductivity in Complex Systems\" (Springer, Berlin) Book Series Structure &\nBonding 114, 1-11 (2005) DOI 10.1007/b101015\nK. A. Müller From Phase Separation to Stripes in \"Stripes and Related Phenomena\"\nedited by A. Bianconi and N. L. Saini, (Kluwer – Plenum, New York, 2002) Book\nSeries: Selected Topics in Superconductivity vol. 8, 1-8 (2002) DOI 10.1007/b119246\nA. Bianconi, M. Missori, H.Oyanagi, and H. Yamaguchi D. H. Ha, Y. Nishiara and S.\nDella Longa The measurement of the polaron size in the metallic phase of cuprate\nsuperconductors Europhysics Letters 31, 411 (1995)\nK. A. Müller, G.-M. Zhao, K. Conder and H. Keller Journal of Physics: Condensed\nMatter 10, L291 (1998)\nK. M. Shen, F. Ronning, D.H. Lu, F. Baumberger, N.J.C. Ingle, W.S. Lee, W.\nMeevasana, Y. Kohsaka, M. Azuma, M. Takano, H. Takagi, Z.X. Shen, Science 307,\n901 (2005).\nM. Missori, A Bianconi, N. L. Saini and H. Oyanagi High Critical Temperature by\nResonant Quantum Confinement: Evidence for Polarons Ordering at T*~1.5Tc in Bi2212 and La-214 by EXAFS Il Nuovo Cimento D 16, 1815 (1994)\nA. Bianconi and M. Missori The Coupling of a Wigner Charge Density Wave with Fermi\nLiquid from the Instability of a Wigner Polaron Crystal: A Possible Pairing Mechanism\nin High Tc Superconductors in \"Phase Separation in Cuprate Superconductors\", E.\nSigmund and K. A. Müller, editors Springer Verlag, Berlin-Heidelberg,. 272-289 (1994).\nProc. of the Workshop held at Cottbus, Germany Sept 4-10, 1993\nG. Campi, D. Di Castro, G. Bianconi, S. Agrestini, N. L. Saini, H. Oyanagy, and A.\nBianconi Photo-Induced phase transition to a striped polaron crystal in cuprates Phase\nTransitions, 75, 927 (2002)\n\n\f17.\n\n18.\n\n19.\n\n20.\n21.\n\n22.\n23.\n24.\n\n25.\n\n26.\n\n27.\n28.\n29.\n\n30.\n\n31.\n32.\n33.\n\n34.\n35.\n\nA. Bianconi, D. Di Castro, G. Bianconi, A. Pifferi, N. L. Saini, F. C. Chou, D. C.\nJohnston, and M. Colapietro, Coexistence of stripes and superconductivity: Tc\namplification in a superlattice of superconducting stripes, Physica C 341, 1719 (2000).\nD. Di Castro, M. Colapietro and G. Bianconi, Metallic stripes in oxygen doped La2CuO4\nInternational Journal of Modern Physics B 14, 3438 (2000).\nDOI:10.1142/S0217979200003927\nA. Bianconi The Instability Close to the 2D Generalized Wigner Polaron Crystal\nDensity: A possible Pairing Mechanism Indicated by a Key Experiment Physica C 235240, 269 (1994)\nA. Bianconi On the Fermi Liquid Coupled with a Generalized Wigner Polaronic CDW\nGiving High Tc Superconductivity Sol. State Commun. 91, 1 (1994)\nA. Bianconi, M. Missori The instability of a 2D Electron Gas Near the Critical Density\nfor a Wigner Polaron Crystal Giving the Quantum State of Cuprate Superconductors\nSol. State Commun. 91, 287 (1994).\nF. V. Kusmartsev Phys. Rev. Lett. 84, 530 (2000); ibidem 84, 5026 (2000).\nF. V. Kusmartsev, Europhys. Lett. 54, 786 (2001).\nA. Bianconi \"Process of increasing the critical temperature Tc of a bulk superconductor\nby making metal heterostructures at the atomic limit'' United State Patent No.:US6, 265,\n019 B1, (2001).\nY. Tokura and T. Arima \"New Classification Method for Layered Copper Oxide\nCompounds and Its Application to Design of New High Tc Superconductors\" Jpn. J.\nAppl. Phys. 29 2388 (1990) DOI: 10.1143/JJAP.29.2388\nA. Bianconi On the possibility of new high Tc superconductors by producing metal\nheterostructures as in the cuprate perovskites Solid state communications 89, 933\n(1994).\nM. Fratini, N. Poccia, and A. Bianconi Journal of Physics Conference Series 108,\n012036 (2008).\nA. Bianconi, N. L. Saini, S. Agrestini, D. Di Castro, and G. Bianconi Int. Jour. of\nModern Physics B 14, 3342 (2000).\nS. Agrestini, N L Saini, G Bianconi, and A Bianconi The strain of CuO2 lattice: the\nsecond variable for the phase diagram of cuprate perovskites Journal of Physics A:\nMathematical and General 36, 9133 (2003).\nN. Poccia and M. Fratini \"The Misfit Strain Critical Point in the 3D Phase Diagrams of\nCuprates\" Journal of Superconductivity and Novel Magnetism, 22, 1557 (2009). DOI\n10.1007/s10948-008-0435-8.\nA. Bianconi, G. Bianconi, S. Caprara, D. Di Castro, H Oyanagi, and N. L. Saini, J.\nPhys.: Condens. Matter, 12 10655 (2000).\nS. Agrestini et al. \"High Tc superconductivity in a critical range of micro-strain and\ncharge density in diborides\" J. Phys.: Condens. Matter 13, 11689 (2001)\nRocchina Caivano, et. al. Feshbach resonance and mesoscopic phase separation near a\nquantum critical point in multiband FeAs-based superconductors Supercond. Sci.\nTechnol. 22, 014004 (2009).\nP. H. Poole, F. Sciortino, T. Grande, H. E. Stanley, and C. A. Angell, Phys. Rev. Lett.\n73, 1632 (1994) and references therein.\nG. Campi and A. Bianconi, in Symmetry and Heterogeneity in High Temperature\nSuperconductors (Springer, Dordrecht, The Netherlands) NATO Science Series II\nMathematics, Physics and Chemistry Vol. 214, 147 (2006).\n\n\fFigure captions\nFigure 1. The normalized free energy as a function of reduced volume V/Vc at different\ntemperatures. In this way the novel minimum of the free energy occurs at a reduced density\ndifferent respect the minimum of the VdW model. This new minimum, indicates the occurrence of\nthe intermediate phase, become deeper when the temperature decreases, as shown in the plots for\nT/Tc = 0.40, 0.44, 0.48, 0.56, 0.60, 0.68 and 0.76.\nFigure 2. The phase diagrams obtained by computing the spinodal lines from Eq. (1). We can\nobserve the occurrence of two phase separations indicated by the two spinodal lines in panel a). In\nthe panel b) and c) we show the effect of the decreasing strength of the directional bond.\nFigure 3. The normalized energy of the directional interaction γ/γc as a function of reduced density\nb/V at T/Tc=0.4. We identify three different phases, well separated by three regions of phase\ncoexistence with a critical minimum value of the directional interaction γ/γc, below this minimum\nvalue the a pure phase (2) assigned to the PJT striped polaron phase, or pseudo gap phase, is not\nobserved.\n\n\fFigure 1.\n\n\fFigure 2\n\n\fFigure 3.\n\n\f"}