{"id": "http://arxiv.org/abs/1108.3231v1", "guidislink": true, "updated": "2011-08-16T12:59:41Z", "updated_parsed": [2011, 8, 16, 12, 59, 41, 1, 228, 0], "published": "2011-08-16T12:59:41Z", "published_parsed": [2011, 8, 16, 12, 59, 41, 1, 228, 0], "title": "Non-perturbative dynamics and charge fluctuations in effective chiral\n  models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.1271%2C1108.0451%2C1108.5276%2C1108.3400%2C1108.0106%2C1108.0191%2C1108.2436%2C1108.0933%2C1108.5742%2C1108.6201%2C1108.5895%2C1108.0962%2C1108.1277%2C1108.6115%2C1108.1611%2C1108.0478%2C1108.0273%2C1108.4610%2C1108.0534%2C1108.3088%2C1108.5460%2C1108.2338%2C1108.4673%2C1108.4123%2C1108.4387%2C1108.6198%2C1108.6064%2C1108.2343%2C1108.4376%2C1108.6269%2C1108.4054%2C1108.5050%2C1108.4525%2C1108.1433%2C1108.2884%2C1108.4285%2C1108.3829%2C1108.2295%2C1108.1343%2C1108.2171%2C1108.4198%2C1108.3563%2C1108.1709%2C1108.3464%2C1108.1970%2C1108.5003%2C1108.0377%2C1108.5699%2C1108.3231%2C1108.1459%2C1108.2296%2C1108.1596%2C1108.2964%2C1108.4037%2C1108.3788%2C1108.0967%2C1108.4417%2C1108.0699%2C1108.1263%2C1108.0276%2C1108.5415%2C1108.3897%2C1108.3142%2C1108.3205%2C1108.1858%2C1108.0263%2C1108.4944%2C1108.5390%2C1108.5760%2C1108.5025%2C1108.5695%2C1108.1570%2C1108.2829%2C1108.4173%2C1108.3772%2C1108.0737%2C1108.3072%2C1108.1713%2C1108.2021%2C1108.3017%2C1108.0297%2C1108.1153%2C1108.3377%2C1108.5655%2C1108.3863%2C1108.4605%2C1108.2415%2C1108.5195%2C1108.2648%2C1108.2744%2C1108.1821%2C1108.6005%2C1108.6260%2C1108.4402%2C1108.1176%2C1108.3795%2C1108.0134%2C1108.3074%2C1108.2688%2C1108.2762%2C1108.2604&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-perturbative dynamics and charge fluctuations in effective chiral\n  models"}, "summary": "We discuss the properties of fluctuations of the electric charge in the\nvicinity of the chiral crossover transition within effective chiral models at\nfinite temperature and vanishing net baryon density. The calculation includes\nnon-perturbative dynamics implemented within the functional renormalization\ngroup approach. We study the temperature dependence of the electric charge\nsusceptibilities in the linear sigma model and explore the role of quantum\nstatistics. Within the Polyakov loop extended quark-meson model, we study the\ninfluence of the coupling of quarks to mesons and to an effective gluon field\non charge fluctuations. We find a clear signal for the chiral crossover\ntransition in the fluctuations of the electric charge. Accordingly, we stress\nthe role of higher order cumulants as probes of criticality related to the\nrestoration of chiral symmetry and deconfinement.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.1271%2C1108.0451%2C1108.5276%2C1108.3400%2C1108.0106%2C1108.0191%2C1108.2436%2C1108.0933%2C1108.5742%2C1108.6201%2C1108.5895%2C1108.0962%2C1108.1277%2C1108.6115%2C1108.1611%2C1108.0478%2C1108.0273%2C1108.4610%2C1108.0534%2C1108.3088%2C1108.5460%2C1108.2338%2C1108.4673%2C1108.4123%2C1108.4387%2C1108.6198%2C1108.6064%2C1108.2343%2C1108.4376%2C1108.6269%2C1108.4054%2C1108.5050%2C1108.4525%2C1108.1433%2C1108.2884%2C1108.4285%2C1108.3829%2C1108.2295%2C1108.1343%2C1108.2171%2C1108.4198%2C1108.3563%2C1108.1709%2C1108.3464%2C1108.1970%2C1108.5003%2C1108.0377%2C1108.5699%2C1108.3231%2C1108.1459%2C1108.2296%2C1108.1596%2C1108.2964%2C1108.4037%2C1108.3788%2C1108.0967%2C1108.4417%2C1108.0699%2C1108.1263%2C1108.0276%2C1108.5415%2C1108.3897%2C1108.3142%2C1108.3205%2C1108.1858%2C1108.0263%2C1108.4944%2C1108.5390%2C1108.5760%2C1108.5025%2C1108.5695%2C1108.1570%2C1108.2829%2C1108.4173%2C1108.3772%2C1108.0737%2C1108.3072%2C1108.1713%2C1108.2021%2C1108.3017%2C1108.0297%2C1108.1153%2C1108.3377%2C1108.5655%2C1108.3863%2C1108.4605%2C1108.2415%2C1108.5195%2C1108.2648%2C1108.2744%2C1108.1821%2C1108.6005%2C1108.6260%2C1108.4402%2C1108.1176%2C1108.3795%2C1108.0134%2C1108.3074%2C1108.2688%2C1108.2762%2C1108.2604&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the properties of fluctuations of the electric charge in the\nvicinity of the chiral crossover transition within effective chiral models at\nfinite temperature and vanishing net baryon density. The calculation includes\nnon-perturbative dynamics implemented within the functional renormalization\ngroup approach. We study the temperature dependence of the electric charge\nsusceptibilities in the linear sigma model and explore the role of quantum\nstatistics. Within the Polyakov loop extended quark-meson model, we study the\ninfluence of the coupling of quarks to mesons and to an effective gluon field\non charge fluctuations. We find a clear signal for the chiral crossover\ntransition in the fluctuations of the electric charge. Accordingly, we stress\nthe role of higher order cumulants as probes of criticality related to the\nrestoration of chiral symmetry and deconfinement."}, "authors": ["V. Skokov", "B. Friman", "K. Redlich"], "author_detail": {"name": "K. Redlich"}, "author": "K. Redlich", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physletb.2012.01.022", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.3231v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.3231v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 3 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.3231v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.3231v1", "journal_reference": null, "doi": "10.1016/j.physletb.2012.01.022", "fulltext": "Non-perturbative dynamics and charge fluctuations in\neffective chiral models\n\narXiv:1108.3231v1 [hep-ph] 16 Aug 2011\n\nV. Skokova, B. Frimana , and K. Redlichb,c\na GSI\n\nHelmholtzzentrum für Schwerionenforschung, D-64291 Darmstadt, Germany\nof Theoretical Physics, University of Wroclaw, PL–50204 Wroclaw, Poland\nc ExtreMe Matter Institute EMMI, GSI, D-64291 Darmstadt, Germany\n\nb Institute\n\nAbstract\nWe discuss the properties of fluctuations of the electric charge in the vicinity of\nthe chiral crossover transition within effective chiral models at finite temperature\nand vanishing net baryon density. The calculation includes non-perturbative\ndynamics implemented within the functional renormalization group approach.\nWe study the temperature dependence of the electric charge susceptibilities in\nthe linear sigma model and explore the role of quantum statistics. Within the\nPolyakov loop extended quark-meson model, we study the influence of the coupling of quarks to mesons and to an effective gluon field on charge fluctuations.\nWe find a clear signal for the chiral crossover transition in the fluctuations of\nthe electric charge. Accordingly, we stress the role of higher order cumulants\nas probes of criticality related to the restoration of chiral symmetry and deconfinement.\nKeywords: QCD phase diagram; Heavy ion collisions; Chiral phase transition;\nCharge fluctuations; Particle freeze-out; Hadron resonance gas\n\n1. Introduction\nThermodynamics of strongly interacting matter has been explored numerically within Lattice Quantum Chromodynamics (LQCD) [1, 2, 3, 4] as well as\nexperimentally in heavy-ion collisions [5]. The fundamental goal of these studies is to reveal the structure of the QCD phase diagram and to investigate the\ncritical properties of QCD.\nLQCD results show that at finite temperatures QCD exhibits restoration\nof chiral symmetry and deconfinement in a crossover transition. The LQCD\nequation of state indicates a clear separation between the confined hadronic\nphase and the deconfined quark–gluon plasma. The temperature separation of\nthe phases of QCD is very transparent when one considers fluctuations of conserved charges [2, 6, 7, 8, 9, 10]. At vanishing chemical potential the variance\nof both the net baryon number and the electric charge exhibits a rapid change\nin a narrow temperature interval. This behavior is attributed to the deconfinement of quarks [11, 12, 13]. On the other hand, the fourth order cumulants of\n\nPreprint submitted to Physics Letters B\n\nNovember 25, 2018\n\n\fthese charges show peak-like structures, whereas the sixth order cumulants are\nnegative in a narrow temperature interval [6].\nThese properties of the fluctuations observed in LQCD at finite temperature\nand for small masses of the up– and down–quarks can be attributed to the\ncritical dynamics of the explicitly broken chiral symmetry, which is characterized\nby the O(4) universality class of QCD [6, 14]. As noted in [14, 15], this could have\ninteresting phenomenological implications: it has been suggested, that the sixth\nand eight order cumulants of the net baryon number and electric charge may\nallow an experimental verification of the chiral crossover transition in heavy-ion\ncollisions [15].\nThe critical behavior of strongly interacting matter related with chiral dynamics should be common to all models which exhibit the underlying chiral\nsymmetry of QCD and the same patterns of spontaneous chiral symmetry breaking at finite temperature. Thus, such effective models have been used to study\nthe thermodynamics near the chiral phase transition and to explore observables\nwhich are sensitive to the critical behavior [16, 17, 18, 19, 20, 21, 22, 23]. In this\ncontext, models which include the coupling of quarks to an effective gluon field,\nsuch as the Polyakov loop extended Nambu–Jona–Lasinio (PNJL) [18, 21] and\nthe quark–meson (PQM) [24] models, are very useful. Both models reproduce\nthe essential features of the QCD thermodynamics already in the mean-field\napproximation [16, 17, 18, 19, 21]. However, to correctly account for the critical dynamics, it is necessary to go beyond the mean-field approximation and\ninclude non-perturbative fluctuations. This can be achieved e.g. by employing\nmethods based on the functional renormalization group (FRG) [25, 26, 27, 28].\nThe FRG has been applied to study the fluctuations of the net baryon number\nnear the chiral phase transition at finite and at vanishing baryon chemical potential [14, 29, 11, 13, 30]. However, so far such studies are not available for the\nelectric charge fluctuations.\nIn this work, we study fluctuations of the electric charge near the chiral phase\ntransition at finite temperature and at vanishing chemical potential within the\nFRG approach to the linear sigma and PQM models. We explore the temperature dependence of these fluctuations and the role of quantum statistics.\nFurthermore, the influence of quark- and gluon-dynamics on the properties of\nthe electric charge fluctuations near the chiral crossover transition, including the\neffect of mesonic fluctuations, is discussed. We find a strong sensitivity of higher\norder cumulants of the electric charge to chiral symmetry breaking and deconfinemenet. We also show, that these cumulants exhibit a characteristic O(4)\nstructure, similar to that found in the fluctuations of the net baryon charge. In\nparticular, the cumulants turn negative in the vicinity of the chiral transition\nalso at vanishing net charge.\nIn the subsequent section we introduce the non-perturbative thermodynamic\npotential in the FRG approach to the PQM model formulated at finite electriccharge chemical potential. In section 3 we present our results on fluctuations of\nthe electric charge, including higher cumulants, in the linear sigma and PQM\nmodels. Finally, in section 4 we present our conclusions.\n\n2\n\n\f2. The thermodynamic potential in the Polyakov-quark-meson model\nThe quark–meson model is an effective realization of the low–energy sector of QCD, which incorporates chiral symmetry and exhibits a global SU (Nc )\ncolor symmetry. Hence, it does not describe quark confinement. Nevertheless, by introducing a coupling of the quarks to a uniform temporal color gauge\nfield, represented by the Polyakov loop, one obtains an equation of state with\nproperties that closely resemble those of QCD matter, including a change of\neffective degrees of freedom with increasing temperature, thus mimicking the\nconfinement-deconfinement transition [17, 19, 21, 24]. This is sometimes referred to a statistical confinement.\nA formulation of the thermodynamics of the PQM model, which remains\nvalid near the chiral phase transition, requires the use of non-perturbative methods. In an analysis of electric charge fluctuations, it is of particular importance\nto account for mesonic fluctuations, including specifically interacting pions as\ncarriers of electric charge. We employ a method based on the functional renormalization group (FRG) to compute the thermodynamic potential in the PQM\nmodel. This method involves an infrared regularization of the fluctuations at\na sliding momentum scale k, resulting in a scale-dependent effective action Γk\n[25, 26, 27, 28]. We treat the Polyakov loop as a background field, which is\nintroduced self-consistently on the mean-field level while the quark and meson\nfields, fluctuations are accounted for by solving the FRG flow equations.\nWe follow the procedure used in Ref. [29] in the formulation of the flow equation for the scale-dependent grand canonical potential density, Ωk = T Γk /V , for\nthe quark and meson subsystems at finite temperature and for a non-vanishing\nelectric charge chemical potential. The thermodynamic potential is obtained by\nsolving the flow equation\n(\n\"\n#\n4\n1\nk\n1 + 2nB (Eπ ; T )\n∂k Ωk (l, l∗ ; T, μ) =\n12π 2 Eπ\n\"\n#\n\"\n#\n1\n1\n+\n1 + 2nB (Eπ − μπ ; T ) +\n1 + 2nB (Eπ + μπ ; T )\n(1)\nEπ\nEπ\n\"\n#\n\"\n#\n\nX\n1\n4Nc\n+\n1 + 2nB (Eσ ; T ) −\n1 − N (l, l∗ ; T, μf ) − N̄ (l, l∗ ; T, μf )\n.\n\nEσ\nEq\nf =u,d\n\nHere nB (E; T ) is the bosonic distribution function\nnB (E; T ) =\n\n1\n,\nexp(E/T ) − 1\n\nμπ = eπ μQ is the charge pion chemical potential and eπ = 1 the charge of a π + .\nThe pion and sigma energies are given by\nq\nq\n′\n′\n′′\nEπ = k 2 + Ωk , Eσ = k 2 + Ωk + 2ρ Ωk ,\n3\n\n\fwhere the primes denote derivatives with respect to ρ = (σ 2 + ~π 2 )/2 of Ω =\nΩ + cσ. The fermion distribution functions N (l, l∗ ; T, μf ) and N̄ (l, l∗ ; T, μf ),\n1 + 2l∗ eβ(Eq −μf ) + le2β(Eq −μf )\n,\n1 + 3le2β(Eq −μf ) + 3l∗ eβ(Eq −μf ) + e3β(Eq −μf )\nN (l∗ , l; T, −μf ),\n\nN (l, l∗ ; T, μf ) =\nN̄ (l, l∗ ; T, μf ) =\n\n(2)\n(3)\n\nare modified because of the coupling to the gluon field. Finally, the quark energy\nreads\np\nEq = k 2 + 2g 2 ρ\n(4)\n\nand the quark chemical potentials are defined by\nμu =\n\n1\nμB + e u μQ ,\n3\n\nμd =\n\n1\nμB + e d μQ\n3\n\n(5)\n\nwith eu = 2/3 and ed = −1/3.\nThe flow equation (1) is solved numerically with the ultraviolet cutoff Λ = 1.2\nGeV using the polynomial method described in Ref. [29]. In this scheme, the\nstationarity condition\ndΩk\ndσ\n\n=\nσ=σk\n\ndΩk\ndσ\n\n−c=0\n\n(6)\n\nσ=σk\n\nis implemented in the flow equation. The initial conditions for the flow are\nchosen to reproduce the following vacuum properties: the physical pion mass\nmπ = 138 MeV, the pion decay constant fπ = 93 MeV, the sigma mass mσ =\n600 MeV, and the constituent quark mass mq = 300 MeV at the scale k → 0.\nThe symmetry breaking term, c = m2π fπ , is treated as an external field which\ndoes not flow. The flow of the Yukawa coupling g is neglected because it is not\nexpected to be significant for the present studies (see e.g. Refs. [31]).\nBy solving Eq. (1) one obtains the thermodynamic potential Ωk→0 (l, l∗ ; T, μ)\nas a function of the Polyakov loop variables l and l∗ . The full thermodynamic\npotential Ω(l, l∗ ; T, μ) in the PQM model, including quark, meson and gluon\ndegrees of freedom, is obtained by adding the effective gluon potential U(l, l∗ ),\nΩ(l, l∗ ; T, μ) = Ωk→0 (l, l∗ ; T, μ) + U(l, l∗ ).\n\n(7)\n\nAt a given temperature and chemical potential, the Polyakov loop variables, l\nand l∗ , are then determined by the stationarity conditions:\n∂\nΩ(l, l∗ ; T, μ) = 0.\n∂l∗\n\n∂\nΩ(l, l∗ ; T, μ) = 0,\n∂l\n\n(8)\n\nThe thermodynamic potential (7) does not contain contributions of thermal\nmodes with momenta larger than the cutoff Λ. In order to obtain the correct\nhigh-temperature behavior of the thermodynamic functions, we supplement the\nFRG potential with the contribution of the high-momentum states. A procedure\nfor implementing this was proposed in Ref. [32] for the QM model and extended\nto the PQM model in Ref. [29], by including the flow of quarks interacting with\nthe Polyakov loop for momenta k > Λ.\n4\n\n\f3. Electric charge density fluctuations\nThe thermodynamic potential obtained by solving the flow equation (1) correctly reproduces the critical O(4) scaling near the chiral phase transition. Thus,\nusing this potential one can compute the temperature dependence of the electric\ncharge fluctuations and their higher cumulants.\nThe fluctuations of the electric charge are characterized by the generalized\nsusceptibilities,\n∂ n [p (T, μQ )/T 4 ]\nχQ\n.\n(9)\nn (T ) =\n∂(μQ /T )n\n3\nThe first cumulant, χQ\n1 = nQ /T , is given by the electric charge density nQ =\nNQ /V , while the second cumulant\n\nχQ\n2 =\n\n1\nh(δNQ )2 i\nV T3\n\n(10)\n\nwith δNQ = NQ − hNQ i, is proportional to the variance of the electric charge.\nFurthermore, the fourth and sixth order cumulants can be expressed through\nmoments of δNQ\nχQ\n4\n\n=\n\nχQ\n6\n\n=\n+\n\n\u0003\n1 \u0002\nh(δNQ )4 i − 3h(δNQ )2 i2 ,\n3\nVT\n1 \u0002\nh(δNQ )6 i − 15h(δNQ )4 ih(δNQ )2 i − 10h(δNQ )3 i2\nV T3\n\u0003\n30h(δNQ )2 i3 .\n\n(11)\n(12)\n\nBased on LQCD results [33], one expects that in the region of the crossover\ntransition, the fluctuations of the electric charge should reflect the critical scaling of the underlying O(4) symmetry. For the O(4) universality class, the singular part of thermodynamic pressure, at small values of the baryon chemical\npotential, scales as\np ∝ (T /Tc − 1 + κμ2B )2−α ,\n(13)\nwhere Tc is the temperature of the second-order phase transition at μ = 0 in\nthe chiral limit. The exponent α ≈ −0.21 is the critical exponent of the specific\nheat in the O(4) universality class in three-dimensions. Therefore, at vanishing\nchemical potential, the cumulants χB\nn of the net baryon number diverge at the\ntransition temperature for all even n ≥ 6,\n2−n−α\n.\nχB\n2n ∝ (T /Tc − 1)\n\n(14)\n\nFluctuations of the electric charge are related to the net baryon and isospin\nfluctuations by\n\"\n#\nn−1\nX \u0012i\u0013\n1\n∂ n (pβ 4 )\nQ\nB\nI\nχn = n χn + χn +\n.\n(15)\nn ∂(βμI )i ∂(βμB )n−i\n2\ni=1\n5\n\n\f0.3\n\n0.5\n\n0.4\n\n0.2\n\nQ\n\n\u0002\n\n4\n\n2\n\nQ\n\n0.3\n\n0.2\n0.1\nFRG\n\nFRG\n\nlmax =1\nlmax =2\nlmax = \u0001\n0.0\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nlmax =1\nlmax =2\nlmax = \u0003\n\n0.1\n\n0.0\n0.0\n\n2.0\n\nT/Tpc\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\nT/Tpc\n\nQ\nFigure 1: (Color online) The second χQ\n2 and the fourth χ4 order cumulant of the net electric\ncharge fluctuations in the linear sigma model obtained within the functional renormalisation\ngroup approach (solid lines). The dotted line is the contribution of an ideal pion gas in the\nBoltzmann approximation. The dash-dotted (lmax = 1) and dashed (lmax = 2) lines show the\nfirst and the second terms in the series (17), respectively. The temperature axis is normalized\nby Tpc = 180.5 MeV which is the pseudo-critical temperature in the model within the FRG\napproach.\n\nThe isovector fluctuations are regular at the chiral phase transition in an isospin\nsymmetric system. Thus, the χIn remain finite at the phase transition. The last\nterm, which correlates isospin with baryon number, can diverge for sufficiently\nlarge n. However, these terms give subleading contributions to criticality of χQ\nn.\nThus, the leading singular part of the electric-charge cumulants χQ\nis\nsolely\nn\ndetermined by χB\nn . Consequently, at small quark masses, the contributions\nfrom the singular part of the thermodynamic pressure to the net electric charge\nfluctuations should be similar to that found for the net baryon fluctuations.\nThe expected residual O(4) scaling in χB\nn at finite quark masses is indeed\nobserved in the PQM model in the FRG approach. However, since the regular\ncontributions to the electric charge and to the baryon number fluctuations are\ndifferent, it is not a priori clear that this will be the case also for cumulants χQ\nn\nof the electric charge.\nIn the following, we compute the temperature dependence of χQ\nn in the PQM\nmodel with the thermodynamic potential obtained from Eq. (7). We also discuss\nthe contributions of individual modes to the properties of χQ\nn near the chiral\ntransition.\n3.1. Fluctuations in an interacting pion gas\nWe first consider the contribution of mesonic degrees of freedom to the fluctuations of the net electric charge. Clearly, in such studies pionic interactions\nshould be included. A suitable model for exploring the meson contribution is\nthe mesonic linear sigma model. The thermodynamic potential for this model\n\n6\n\n\f0.6\nFRG\n\nFRG\n\n0.5\n\nHRG\n\nFRG:\n\n\u0006\n\n0.3\n\n2\n\n0.2\n\n0.2\n\n1\n\n0.1\n\n0.1\n\n0\n\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n1.4\n\n0.0\n0.0\n\ne =0\nef =0\n\n3\n\nQ\n\nQ\n\n0.3\n\nFRG:\nHRG\n\n0.4\n\n4\n\nQ\n\n2\n\nFRG\n\n4\n\nHRG\n\n0.4\n\n\u0004\n\n\u0007\n\ne =0\nFRG: ef =0\nFRG:\n\n6\n\n0.5\n\n5\n\n0.6\n\n\u0005\n\ne =0\nFRG: ef =0\nFRG:\n\n0.2\n\n0.4\n\nT/Tpc\n\n0.6\n\n0.8\n\nT/Tpc\n\n1.0\n\n1.2\n\n1.4\n\n\b\n\n1\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n1.4\n\nT/Tpc\n\nFigure 2: (Color online) The cumulants of the electric charge fluctuations in the Polyakov loop\nextended quark-meson model calculated within the functional renormalisation group approach\n(solid lines). The results are also shown for only charged quarks eπ = 0 and only charged\npions ef = 0 (see text). The hadron resonance gas contribution is shown as dotted lines.\n\nis obtained directly from the flow equation (7) in the limit of Nc → 0. The\nfluctuations of the electric charge are then due only to the charged pion degrees\nof freedom.\nIn the mean-field approximation to the linear sigma model, fluctuations of\nthe electric charge are absent. They can be included perturbatively [34, 35,\n36] or non-perturbatively within the FRG approach, where fluctuations due\nto interacting pions are included [11, 12, 29, 37]. Here we employ the FRG\napproach to account for meson fluctuations.\nThe second and the fourth order cumulants obtained in the FRG approach\nare shown in Fig. 1. Although the chiral symmetry is explicitly broken by the\nvacuum pion mass, a clear signature of the chiral crossover transition is seen\nin the susceptibilities. In particular, we note the non-monotonic temperature\ndependence of the fourth order cumulant, resulting in a peaked structure near\nthe chiral transition. This behavior is due mostly to the temperature dependence of the pion mass, which up to the chiral transition remains close to its\nvacuum value, while above the transition mπ grows strongly with temperature.\nConsequently, above the pseudo-critical temperature (Tpc ), all cumulants of the\nnet-charge fluctuations decrease with temperature. Note that this effect is not\na consequence of the cut off, which suppresses high momentum modes in the\nmodel. Due to the large value of Λ = 1.2 GeV, this suppression sets in only at\nmuch higher temperatures.\nIt is interesting to asses at which temperature pionic interactions start influencing the charge fluctuations. This can be estimated by comparing the FRG\nQ\nresults for the χQ\n2 and χ4 with those obtained for an ideal gas of charged pions.\nThe pressure of the latter is given by\n∞\n\u0001\npπ + + pπ −\nm2 X 1\n=\nK2 (lβm) elβμq + e−lβμq ,\n4\n2\n2\n2\nT\n2π T\nl\n\n(16)\n\nl=1\n\nwhere K2 (x) is a modified Bessel function and μq is the electric chemical potential. In an ideal pion gas, the odd-order cumulants of the electric charge vanish\n7\n\n\fat μq = 0, while even cumulants are given by\nχQ\nn =\n\n∞\nm2 X n−2\nl\nK2 (lβm).\nπ2 T 2\n\n(17)\n\nl=1\n\nThis can be considered as an approximation to the regular part of the fluctuations of the electric charge.\nIn Fig. 1 the contributions of the regular part to the second and fourth\ncumulants are shown. At low temperatures the FRG and ideal pion gas results\nagree. This indicates that the FRG method correctly accounts for the pionic\ncontribution to the thermodynamics.\nThe effect of quantum statistics can be studied by truncating the series in\nEq. (17) at a given order l = lmax . This is illustrated in Fig. 1, where we\nconfront the lmax = 1 and 2 truncations for the second and the fourth order cumulants of the free pion gas with the full (lmax = ∞) result. Clearly, the leading\ncontribution, which corresponds to Boltzmann statistics, deviates considerably\nfrom the full quantum statistics results, except at very low temperatures. The\nhigher-order terms in the series contribute effectively as multiply charged particles. Hence, their contribution increases with the order of the cumulant. This\nexpectation is confirmed by Fig. 1, which shows that the deviation is stronger\nQ\nfor χQ\n4 than for χ2 . Thus, the effect of quantum statistics cannot be neglected\nin the calculation of fluctuations of the electric charge. This is a reflection of\nthe fact that multi-charged particles can yield a dominant contribution to the\nfluctuations of conserved charges [6]. In QCD this is the case for fluctuations of\nthe electric charge and strangeness, where double- and triple-charged baryons\nplay an important role.\n3.2. Electric charge cumulants in the PQM model\nThe dynamics of the PQM model and its particle content is more relevant for\nQCD than the mesonic linear sigma model described above. The PQM model\ncontains charged-quarks as dynamical degrees of freedom and exhibits statistical\nconfinement through the coupling of the quarks to the effective gluon field.\nQ\nQ\nIn Fig. 2 we show the first three non-trivial cumulants χQ\n2 , χ4 and χ6 of\nthe electric charge for vanishing baryon- and electric charge chemical potential\nobtained from Eq. (7). We also show separately the contributions of quarks or\npions. This separation is made by setting the electric charge of pions eπ and\nthen that of quarks ef to zero, respectively.\nThe second-order cumulant χQ\n2 shows a rapid increase near the pseudocritical temperature, interpolating between the pion and quark contributions.\nSince χQ\n2 is not influenced by the singular part of the thermodynamic pressure\n(13), the behavior seen in Fig. 2 is due to the \"statistical confinement\" of the\nPQM model. The rapid increase with temperature is a consequence of the rapid\nunleashing of single- and double-quarks states at the crossover temperature.\nThe pion contribution, on the other hand, is suppressed above Tpc , owing to the\nincreasing thermal mass.\n\n8\n\n\f3.0\n\n25\nFRG\n\nFRG\n\nHRG\n\nHRG\n\n2.5\n\n20\n\n2.0\n\n15\n\nQ\n2\n\n/\n\n10\n\nQ\n6\n\n\u000e\n\nQ\n4\n\n/\n\nQ\n2\n\n\u000f\n\n1.5\n\n1.0\n\n5\n\n0.5\n\n0\n\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n5\n0.0\n\n1.4\n\nT/Tpc\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n1.2\n\n1.4\n\nT/Tpc\n\nQ\nQ\nQ\nFigure 3: (Color online) The kurtosis (χQ\n4 /χ2 ) and the (χ4 /χ2 ) ratio calculated in the\nPolyakov loop extended quark-meson model. The arrow shows the corresponding StefanBoltzmann limits. The hadron resonance gas model results are indicated as dotted-lines.\n\nThe fourth- and sixth-order cumulants exhibit a peak, which increases in\nstrength with the order of the cumulant. This can be understood in terms\nof the critical dynamics of the chiral transition; with increasing order of the\ncumulant, the contribution of the singular part of the pressure (13) becomes\nmore and more dominant. The negative structure of the χQ\n6 near Tpc is similar\nto that observed for the sixth order cumulant of net baryon number fluctuations\nand is due to the particular form of the O(4) scaling function [14]. The peak\nQ\nin χQ\n4 appears as a sum of quark and pion contributions, while the peak in χ6\nQ\nis dominantly due to pions. The negative region of χ6 near Tpc is due to the\nquark contribution.\nIn Fig. 2 we also compare the PQM results with that of the hadron resonance\ngas (HRG) model, which includes the contributions of all charged hadrons and\nresonances. The HRG model reproduces the thermodynamics of LQCD in the\nhadronic phase up to T ≃ 0.9Tpc .\nThere is good agreement between the PQM and HRG model results at low\ntemperatures, where in both cases pions are the dominant degrees of freedom.\nFor higher temperatures the HRG overshoots the PQM model results. Thus,\nthe PQM model does not yield a quantitative description of the LQCD results\non thermodynamics. Nevertheless, this model can provide useful insights into\nthe critical dynamics of universal quantities near the chiral phase transition.\nIn order to reduce the contribution of the non-singular part to the fluctuations and to focus on the critical behavior, ratios of χQ\nn to the second-order\nQ\ncumulant χ2 , which is not influenced by the critical chiral dynamics at μ = 0\n[6], have been studied. In Fig. 3 we show the temperature dependence of the\nQ\nQ\nQ\nkurtosis κ = χQ\n4 /χ2 and of the ratio χ6 /χ2 near the chiral crossover transition. At low temperatures, κ → 1, as expected for a non-interacting Boltzmann\ngas. For higher temperatures, the kurtosis increases owing to the contribution\n\n9\n\n\fof double-charged baryons and to higher order quantum corrections to the pion\ndistribution. Near Tpc and above the quarks dominate, because of the increasing pion mass, resulting in κ decreasing towards the Stefan-Boltzmann limit of\nQ\nfree quark gas. The ratio χQ\n6 /χ2 exhibits a much stronger peak, which diverges\nat the critical temperature in the chiral limit. In analogy with the net baryon\nfluctuations [14, 15], this ratio also develops a negative region near Tpc , owing\nto the chiral critical dynamics encoded in the O(4) scaling function.\nQ\nQ\nQ\nAs shown in Fig. 2, in the PQM model both ratios χQ\n4 /χ2 and χ6 /χ2\novershoot the HRG model predictions. This indicates that in the HRG model,\nthe contribution of multi-charged states to fluctuations is reduced relative to\nthat of singly-charged particles more than in the PQM model.\n4. Summary and conclusions\nWe have computed the electric charge fluctuations in the vicinity of the chiral\ncrossover transition within effective chiral models. Our calculations include\nnon-perturbative dynamics implemented within the functional renormalization\ngroup approach at finite temperature and at vanishing baryon density. We\nhave performed our studies in the linear sigma model and in the Polyakov–loop\nextended quark-meson model.\nWe find a strong sensitivity of the fluctuations of the electric charge to the\nchiral transition. We have also explored the influence of multi-charged states\nand quantum statistics on the temperature dependence of cumulants of the\nelectric charge.\nOur results show that at physical pion and quark masses, the higher order\ncumulants of the electric charge fluctuations exhibit properties which can be\nlinked to the chiral critical dynamics expected in the O(4) universality class.\nThe qualitative structure of fluctuations in the PQM model is similar to that\nobtained in lattice QCD. This confirms the phenomenological importance of\nelectric charge fluctuations, in particular the sixth- and higher-order cumulants,\nas signatures for the chiral crossover transition in heavy-ion collisions.\nAcknowledgments\nWe acknowledge stimulating discussions with Frithjof Karsch, Kenji Morita\nand Christian Schmidt. V. Skokov acknowledges the support by the Frankfurt\nInstitute for Advanced Studies (FIAS). K. Redlich acknowledges partial support\nfrom the Polish Ministry of Science (MEN). B. Friman acknowledges partial\nsupport by EMMI.\nReferences\n[1] C. R. Allton et al., Phys. Rev. D68, 014507 (2003).\n[2] C. R. Allton et al., Phys. Rev. D71, 054508 (2005)\n\n10\n\n\f[3] M. Cheng et al., Phys. Rev. D77, 014511 (2008).\n[4] Y. Aoki et al., Nature 443, 675 (2006).\n[5] See e.g., \"Quark Matter\". Proceedings, 20th International Conference on\nUltra-Relativistic Nucleus-Nucleus Collisions, J. Phys. G35 (2008) No. 10.\n[6] S. Ejiri, F. Karsch and K. Redlich, Phys. Lett. B633, 275 (2006).\n[7] S. Ejiri et al., Nucl. Phys. Proc. Suppl. 140, 505 (2005).\n[8] M. Cheng et al., Phys. Rev. D79, 074505 (2009).\n[9] F. Karsch, PoS CPOD07,026 (2007); C. Schmidt [for the RBC-Bielefeld\nCollaboration], J. Phys. G35, 104093 (2008); F. Karsch, Talk given at the\nINT Conference \"The QCD Critical Point\" (INT-08-2b) (2008).\n[10] S. Borsanyi et al., [Wuppertal-Budapest Collaboration], Nucl. Phys. A855,\n253 (2011).\n[11] V. Skokov, B. Friman and K. Redlich, Phys. Rev. C83, 054904 (2011).\n[12] B. Stokic, B. Friman and K. Redlich, Phys. Lett. B673, 192 (2009).\n[13] K. Redlich, B. Friman and V. Skokov, Prog. Theor. Phys. Suppl. 186, 485\n(2010).\n[14] B. Friman, F. Karsch, K. Redlich and V. Skokov, Eur. Phys. J. C71, 1694\n(2011).\n[15] F. Karsch and K. Redlich, Phys. Lett. B695, 136 (2011).\n[16] M. Buballa, Phys. Rept. 407, 205 (2005).\n[17] K. Fukushima, Phys. Lett. B 591, 277 (2004).\n[18] C. Ratti, M. A. Thaler and W. Weise, Phys. Rev. D 73, 014019 (2006).\n[19] C. Sasaki, B. Friman and K. Redlich, Phys. Rev. D 77, 034024 (2008);\nPhys. Rev. Lett. 99, 232301 (2007); Phys. Rev. D 75, 074013 (2007).\n[20] T. Hell, K. Kashiwa and W. Weise, Phys. Rev. D83, 114008 (2011).\n[21] K. Fukushima, Phys. Lett. B 553, 38 (2003); Phys. Rev. D 68, 045004\n(2003).\n[22] W. J. Fu, Y. X. Liu and Y. L. Wu, Phys. Rev. D 81, 014028 (2010).\n[23] C. Sasaki, Prog. Theor. Phys. Suppl. 186, 545 (2010); Acta Phys. Polon.\nSupp. 3, 803 (2010); Acta Phys. Polon. Supp. 3, 659 (2010).\n[24] B.-J. Schaefer, J. M. Pawlowski and J. Wambach, Phys. Rev. D 76, 074023\n(2007).\n11\n\n\f[25] C. Wetterich, Phys. Lett. B 301, 90 (1993).\n[26] T. R. Morris, Int. J. Mod. Phys. A 9, 2411 (1994).\n[27] U. Ellwanger, Z. Phys. C 62, 503 (1994).\n[28] J. Berges, N. Tetradis and C. Wetterich, Phys. Rept. 363, 223 (2002).\n[29] V. Skokov, B. Stokic, B. Friman and K. Redlich, Phys. Rev. C 82, 015206\n(2010)\n[30] V. Skokov, B. Friman, F. Karsch and K. Redlich, arXiv:1108.1300.\n[31] D. U. Jungnickel and C. Wetterich, Phys. Rev. D 53, 5142 (1996).\n[32] J. Braun, K. Schwenzer and H. J. Pirner, Phys. Rev. D 70, 085016 (2004).\n[33] O. Kaczmarek et al., Phys. Rev. D83, 014504 (2011).\n[34] D. Blaschke, M. Buballa, A. E. Radzhabov and M. K. Volkov, Yad. Fiz.\n71, 2012 (2008).\n[35] A. E. Radzhabov, D. Blaschke, M. Buballa and M. K. Volkov, Phys. Rev.\nD83, 116004 (2011).\n[36] M. Cristoforetti, T. Hell, B. Klein and W. Weise, Phys. Rev. D81, 114017\n(2010).\n[37] T. K. Herbst, J. M. Pawlowski and B.-J. Schaefer, Phys. Lett. B695, 58\n(2011).\n\n12\n\n\f"}