{"id": "http://arxiv.org/abs/0812.0054v1", "guidislink": true, "updated": "2008-11-29T06:59:21Z", "updated_parsed": [2008, 11, 29, 6, 59, 21, 5, 334, 0], "published": "2008-11-29T06:59:21Z", "published_parsed": [2008, 11, 29, 6, 59, 21, 5, 334, 0], "title": "Multi-pronged events from Coulomb fission of nuclei at very low energies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.3334%2C0812.4857%2C0812.3913%2C0812.0833%2C0812.1287%2C0812.0667%2C0812.2491%2C0812.2120%2C0812.1729%2C0812.3563%2C0812.2874%2C0812.1630%2C0812.3792%2C0812.2087%2C0812.4670%2C0812.4295%2C0812.3640%2C0812.5050%2C0812.4052%2C0812.4279%2C0812.2591%2C0812.5003%2C0812.2218%2C0812.2975%2C0812.0784%2C0812.1758%2C0812.1660%2C0812.2419%2C0812.4207%2C0812.0914%2C0812.2620%2C0812.2776%2C0812.0403%2C0812.2350%2C0812.3868%2C0812.2988%2C0812.3775%2C0812.2259%2C0812.0054%2C0812.0448%2C0812.4314%2C0812.3589%2C0812.2457%2C0812.1829%2C0812.1346%2C0812.4282%2C0812.2947%2C0812.4006%2C0812.3226%2C0812.2600%2C0812.4497%2C0812.3723%2C0812.3446%2C0812.3964%2C0812.3101%2C0812.1746%2C0812.1691%2C0812.0447%2C0812.0935%2C0812.3986%2C0812.3528%2C0812.1301%2C0812.4758%2C0812.4514%2C0812.0466%2C0812.1138%2C0812.0023%2C0812.2242%2C0812.2360%2C0812.4648%2C0812.0969%2C0812.4882%2C0812.1095%2C0812.2473%2C0812.2599%2C0812.5082%2C0812.4744%2C0812.0934%2C0812.2507%2C0812.3409%2C0812.2375%2C0812.2247%2C0812.4819%2C0812.1591%2C0812.0456%2C0812.4105%2C0812.1882%2C0812.5072%2C0812.2434%2C0812.3566%2C0812.2598%2C0812.0022%2C0812.3580%2C0812.1254%2C0812.4677%2C0812.1386%2C0812.0303%2C0812.3949%2C0812.4028%2C0812.3466%2C0812.3283&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multi-pronged events from Coulomb fission of nuclei at very low energies"}, "summary": "Multi-pronged tracks have been recorded in the polyethylene terephthalate\n(C$_{10}$H$_8$O$_4$)$_n$ solid state nuclear track detector by exposure to a\n$^{252}$Cf fission source. After chemical etching, two-prong to six-pronged\ntracks along with single tracks have been observed under the optical\nmicroscope. We carried out a systematic study to understand the origin of the\nprongs. The track detectors were coated with metals (Cu, Ag and Pb) and were\nexposed to $^{252}$Cf source. After chemical etching two-prong to four pronged\ntracks were observed in each plate. We believe that at this very low energy of\nthe order of 1 MeV/A, Coulomb fission is the only plausible explanation for the\norigin of such multi-pronged tracks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.3334%2C0812.4857%2C0812.3913%2C0812.0833%2C0812.1287%2C0812.0667%2C0812.2491%2C0812.2120%2C0812.1729%2C0812.3563%2C0812.2874%2C0812.1630%2C0812.3792%2C0812.2087%2C0812.4670%2C0812.4295%2C0812.3640%2C0812.5050%2C0812.4052%2C0812.4279%2C0812.2591%2C0812.5003%2C0812.2218%2C0812.2975%2C0812.0784%2C0812.1758%2C0812.1660%2C0812.2419%2C0812.4207%2C0812.0914%2C0812.2620%2C0812.2776%2C0812.0403%2C0812.2350%2C0812.3868%2C0812.2988%2C0812.3775%2C0812.2259%2C0812.0054%2C0812.0448%2C0812.4314%2C0812.3589%2C0812.2457%2C0812.1829%2C0812.1346%2C0812.4282%2C0812.2947%2C0812.4006%2C0812.3226%2C0812.2600%2C0812.4497%2C0812.3723%2C0812.3446%2C0812.3964%2C0812.3101%2C0812.1746%2C0812.1691%2C0812.0447%2C0812.0935%2C0812.3986%2C0812.3528%2C0812.1301%2C0812.4758%2C0812.4514%2C0812.0466%2C0812.1138%2C0812.0023%2C0812.2242%2C0812.2360%2C0812.4648%2C0812.0969%2C0812.4882%2C0812.1095%2C0812.2473%2C0812.2599%2C0812.5082%2C0812.4744%2C0812.0934%2C0812.2507%2C0812.3409%2C0812.2375%2C0812.2247%2C0812.4819%2C0812.1591%2C0812.0456%2C0812.4105%2C0812.1882%2C0812.5072%2C0812.2434%2C0812.3566%2C0812.2598%2C0812.0022%2C0812.3580%2C0812.1254%2C0812.4677%2C0812.1386%2C0812.0303%2C0812.3949%2C0812.4028%2C0812.3466%2C0812.3283&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multi-pronged tracks have been recorded in the polyethylene terephthalate\n(C$_{10}$H$_8$O$_4$)$_n$ solid state nuclear track detector by exposure to a\n$^{252}$Cf fission source. After chemical etching, two-prong to six-pronged\ntracks along with single tracks have been observed under the optical\nmicroscope. We carried out a systematic study to understand the origin of the\nprongs. The track detectors were coated with metals (Cu, Ag and Pb) and were\nexposed to $^{252}$Cf source. After chemical etching two-prong to four pronged\ntracks were observed in each plate. We believe that at this very low energy of\nthe order of 1 MeV/A, Coulomb fission is the only plausible explanation for the\norigin of such multi-pronged tracks."}, "authors": ["B. Basu", "S. Dey", "D. Gupta", "A. Maulik", "S. Raha", "Swapan K. Saha", "D. Syam"], "author_detail": {"name": "D. Syam"}, "author": "D. Syam", "arxiv_comment": "4 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/0812.0054v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.0054v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.0054v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.0054v1", "journal_reference": null, "doi": null, "fulltext": "Multi-pronged events from Coulomb fission of nuclei at very low energies\nB. Basu1,2 , S. Dey1 , D. Gupta1,2 , A. Maulik1 , S. Raha1,2 , Swapan K. Saha1,2 , D. Syam3\n\narXiv:0812.0054v1 [nucl-ex] 29 Nov 2008\n\n1\n\nCentre for Astroparticle Physics and Space Science, Bose Institute, Kolkata 700091, India\n2\nDepartment of Physics, Bose Institute, Kolkata 700009, India\n3\nDepartment of Physics, Barasat Government College, Kolkata 700124, India\n(Dated: October 23, 2018)\n\nMulti-pronged tracks have been recorded in the polyethylene terephthalate (C10 H8 O4 )n solid state\nnuclear track detector by exposure to a 252 Cf fission source. After chemical etching, two-prong to\nsix-pronged tracks along with single tracks have been observed under the optical microscope. We\ncarried out a systematic study to understand the origin of the prongs. The track detectors were\ncoated with metals (Cu, Ag and Pb) and were exposed to 252 Cf source. After chemical etching\ntwo-prong to four pronged tracks were observed in each plate. We believe that at this very low\nenergy of the order of 1 MeV/A, Coulomb fission is the only plausible explanation for the origin of\nsuch multi-pronged tracks.\nPACS numbers: 29.40.Gx, 25.70.De, 25.70.Mn\n\nThe study of nuclear particles through track etching\nin solid state nuclear track detectors (SSNTD) is widely\npractised [1, 2] in the field of cosmic rays. The polyethylene terephthalate (C10 H8 O4 )n solid state nuclear track\ndetector, commercially known as PET, has been used for\nthe detection of heavy charged particles for many years\n[3]. This detector has some important advantages over\nthe standard solid state nuclear track detectors CR-39,\nLexan etc. The PET has a much higher detection threshold (Z/β = 150) [5] than that of CR-39 (Z/β = 6) and\nLexan (Z/β = 57). The Z and β are, respectively, the\ncharge and velocity (v/c) of a nuclear particle incident on\nthe track detector. Our earlier studies [3] show that PET\ndoes not detect 6 MeV alpha particles from 252 Cf fission source. Further experiments confirmed that it does\nnot detect 650 keV (Z/β = 107) alpha particles which\nhas the highest stopping power in the detector material.\nThe lower energy alpha particles were obtained by the\ndegradation of energy. It may be noted that efficient detection of heavy cosmic ray particles requires that light\ncharged particles including protons and alpha particles\nbe eliminated, which are present as a large background.\nIn this regard, the use of the PET detector is very advantageous [6]. Another big advantage of PET over CR-39 is\nthat PET is a low cost detector and therefore very useful\nwhen large area exposure is required. As a PET detector,\nwe have chosen a particular PET brand of CENTURY\nde'Smart, India, which is commonly used as over-head\nprojector transparencies (OHP).\nDuring a systematic study of PET characteristics, it\nwas exposed to a 252 Cf fission source. Two plates each\nof CR-39 and PET were exposed to the fission source.\nOne of the plates of PET detectors registered clear multipronged charged particle tracks (Fig. 1) along with single tracks, while the other detector registered only single\ntracks of fission fragments. The CR-39 registered both\nfission fragments and alpha particles and all are single\ntracks. These multi-pronged tracks of nuclei have been\nstudied with the help of the calibration curve (dE/dx vs\nV t /V g ). The dE/dx is the stopping power of the charged\n\nparticle in the detector material, V t is the track etch\nrate and V g is the general etch rate. The dE/dx values\nwere obtained using SRIM [4]. The calibration curve was\nobtained from studies of the tracks of different charged\nparticles from radioactive sources (252 Cf) as well as ion\nbeams from the accelerators. The charge response of this\nPET detector to light nuclei has been studied using 3.4\nMeV/A 16 O-ions [5], using the air gap between the flange\nof the beam pipe and the detector as the energy degrader.\nThe charge response has also been studied for heavy nuclei using 11.1 MeV/A U-ion beam, with aluminium foils\nof different thickness to degrade the incident energy to\nseveral values [5]. Calibration has also been carried out\nusing 3.9 MeV/A 32 S and 2.7 MeV/A 56 Fe beams. In the\npresent work, the data reduction was based on the measurement of the geometrical track parameters (lengths,\nangles and etched pit diameters). The estimation of the\ncharge, mass and energy of the detected fragments show\nthat the fragments lie between Oxygen and Cobalt.\nThe CR-39 (Intercast Europe Co., Italy) and PET\nfilms, each of area 3.5 x 3.5 cm2 were exposed in vacuum\n(10−5 bar) for two minutes to the incident alpha particles and fission fragments from a 252 Cf source of strength\n1 μCi. The thickness of the PET detector was 100 ±\n5 μm and that of CR-39 was 600 μm. The etching of\nexposed PET and CR-39 detectors were carried out in\n6.25N NaOH solution at temperatures of 550 C and 700 C\nrespectively. Etching time was 4 hours which produced\nwell developed tracks. The plates were scanned under different dry objectives (x100, x50, x20) of a Leica digital\nmicroscope, interfaced with a computer for image analysis. Two to six pronged tracks were observed in one of the\nPET films, along with single tracks (Fig. 1). The multipronged tracks were observed in a localized area of the\ndetector. Figures of two-pronged tracks are not shown, as\nthe tracks may correspond to elastically scattered particles. Fig. 1 (a-f) show spectacular multi-pronged events\nin uncoated PET. The numbers in (a-f) correspond to\nfragments, as depicted in Table 1. Fragmentation apparently resulted from the collision of the projectile with the\n\n\f2\n\n4\n5\n\n4\n\n4\n\n3\n\n5\n\n3\n\n1\n\n1\n\n6 1\n\n3\n\n2\n\n2\n\n(a)\n\n(b)\n\n(c)\n\n2\n\n3\n3\n2\n\n2\n\n1\n2\n\n(d)\n\n(g)\n\n(h)\n\n(j)\n\n(m)\n\n1\n\n3\n\n(e)\n\n(k)\n\n(n)\n\n1\n\n(f)\n\n(i)\n\n(l)\n\n(o)\n\nFIG. 1: Multi-pronged tracks in uncoated PET (a-f), Pbcoated PET (g-i) and coated CR-39 on the surface (j-l) and\nat a depth of 3 μm, 4 μm and 4 μm (m-o). The numbers in\n(a-f) correspond to fragments, as depicted in Table 1.\n\ncollimator (6 mm diameter, made of aluminium), shutter (made of lead) or the target holder (made of aluminium). To confirm the reactions we exposed a PET\ndetector covered with 1 μm thick aluminized mylar foil.\nAfter etching, it showed a few two-pronged tracks, one\nthree-pronged track and one four-pronged track. Photographs of multi-pronged tracks show that the tracks\noriginate from single vertex. We have constructed the\nvertex for a few three-pronged events. A least square-fit\ncalculation yields a vertex at a height of about 4 μm.\nThe thickness loss due to etching is about 3 μm for four\nhours. Then it can be concluded that the fragmentation\noccurred on the detector surface or just above it. The\nobservation of these multi-pronged tracks prompted us\nto initiate a systematic study on PET and standardized\nCR-39 detectors by coating them with different metals\n(coatings about 200 μg/cm2 ) to see if these fragments\nare the result of the presence of these metals.\nFig. 1 shows the projections of the tracks on a horizontal plane. The actual angles between the directions of\n\nemission of the fragments causing the tracks are given in\nTable 1, which also includes fragment charge and energy.\nFig. 1 (g-i) show tracks formed in Pb-coated PET. We\nalso used CR-39 coated with Cu, Ag and Pb. Fig. 1(jl) show the tracks in Cu-, Ag-, Pb-coated CR-39 on the\nsurface of the detector as well as more prominent projections of the tracks when focussed at 3 μm, 4 μm and 4\nμm depth respectively (Fig. 1 (m-o)).\nTo calculate the errors in the data, we find that the\nstandard deviation in the mean of the measurement of\nthe depth of the tip of the etch cone beneath the surface\nis about 10 % (depth resolution of the microscope is 1\nμm). The error in the general etch rate V g , determined\nby the thickness loss method, is related to the number of\nmeasurements made at various points of the PET sheet\nand the average value of V g . Error is taken as the standard deviation in the mean, which gives a value of about\n5%. Combining these errors we get an error of about 1015% in the determination of V t /V g which leads to similar\nerrors in the determination of dE/dx from the dE/dx vs\nV t /V g calibration curve. The error in dE/dx leads to an\nerror of about ± 3 in the determination of Z from the\ncurve between dE/dx and R obtained using SRIM [4],\nwhere R is the range of the fragment in the SSNTD. This\nerror in Z also leads to an error in the determination of\nenergies of the fragments up to a maximum of about ±\n30%.\nAs to the origin of these multi-pronged events, it appears that at this extremely low energy (energy of fission\nfragments being about 1 MeV/A) fragmentation of nuclei by the Coulomb force may be possible. It was proposed [7, 8, 9] that the Coulomb field of a heavy ion may\ndistort a fissile nucleus so that it is slowly carried over the\nbarrier with little internal excitation. Since the projectile\nenergies are much lower than the Coulomb barrier, only\nelectric forces are involved in inducing the process. If we\ncompare Coulomb excitation with Coulomb fission, in the\nformer case the nucleus is shot up to an excited state. In\nthe latter case the nucleus is lifted through many states of\ncollective excitation. If it reaches the barrier state, fission\noccurs. The Coulomb field actually exerts a torque which\nstrongly aligns the nuclear symmetry axis perpendicular to the projectile direction. The maximum alignment\noccurs shortly after closest approach [9]. Consequently,\nin the rest frame of the fragmenting nucleus, the fission\nfragment distribution should peak at 90o relative to the\nprojectile direction for binary fission. For fission resulting in three or more fragments the angles of emission can\nbe quite different from 90o . Since in our case the projectiles are fission fragments of 252 Cf which are deformed\nand neutron rich, it is the projectile rather than the target (plastic track detectors in our case) which undergoes\nCoulomb fission. So in the lab frame the peaking of the\ndistribution should occur at angles less than 90o .\nWe conclude by reiterating that the initial observation\nof the multi-pronged tracks was in a plain (uncoated)\nPET detector exposed to 252 Cf source while no multipronged tracks were seen in unexposed plates. In or-\n\n\f3\nder to check this conclusion, we got the plastic films\ncoated with various metals before exposure to the fission\nfragments. The metal-coated detectors indeed reproduce\nmulti-pronged tracks.\nThe present work may be the first observation of multipronged events from Coulomb fission at such a low energy. Further studies in this area as well as detailed theoretical analysis is presently being pursued.\nOne of the authors (B.B) is thankful to the Department\n\nof Science and Technology (DST), Government of India,\nNew Delhi, for the award of Women Scientist Project\n(No. SR/WOS-A/PS/-78/2003). The authors thank Sujit K. Basu for technical assistance. This work has been\nsupported by the IRHPA (Intensification of Research in\nHigh Priority Areas) Project (IR/S2/PF-01/2003) of the\nScience and Engineering Council (SERC), DST, Government of India, New Delhi.\n\n[1] R. L. Fleischer, P. B. Price, R. M. Walker, Nuclear Tracks\nin Solids, University of California Press (1975)\n[2] S. A. Durrani, R. K. Bull, Solid State Nuclear Track\ndetection- Principles, Methods and Applications, Pergamon Press (1987)\n[3] B.Basu, S.Banik, A.Mazumdar, S.Raha, S.Saha,\nS.K.Saha, D.Syam, Indian J.Phys. 79, 279 (2005).\n[4] J. F. Ziegler, J. P. Biersack, The stopping and range of\nions in matter (SRIM Computer Code), Version: 2003.26\n(2003)\n[5] B. Basu, S. Dey, B. Fischer, A. Maulik, A. Mazumdar,\n\nS. Raha, S. Saha, Swapan K. Saha, D. Syam, Radiation\nMeasurements 43, S95 (2008)\nB. Basu, S. Biswas, S. Dey, A. Maulik, A. Mazumdar,\nS. Raha, S. Saha, Swapan K. Saha, D. Syam, Radiation\nMeasurements 43, S262 (2008)\nL. Wilets, E. Guth, J. S. Tenn, Phys. Rev. 156, 1349 (1967)\nH. Holm, W. Greiner, Phys. Rev. Lett. 26, 1647 (1971)\nH. Kruse, W. T. Pinkston, W. Greiner, V. Oberacker,\nPhys. Rev. C 22, 2465 (1980)\n\n[6]\n[7]\n[8]\n[9]\n\n\fTable 1: The charge, energy and angle between fragments. The first and second columns correspond to pictures (a-f) for PET(uncoated), as shown in Figure 1.\nFig. 1\n\nNo. of fragments\nE\n18\n\nCharge and energy (MeV) of the fragments\n2\n3\n4\n5\nZ\nE\nZ\nE\nZ\nE\nZ\nE\n14\n35\n14\n37\n14\n40\n16\n45\n\n1\na\n\n6\n\nZ\n10\n\nb\n\n5\n\n18\n\n60\n\n20\n\n30\n\n17\n\n50\n\n9\n\n16\n\nc\n\n4\n\n21\n\n65\n\n12\n\n25\n\n16\n\n45\n\n17\n\n50\n\nd\ne\nf\n\n3\n3\n3\n\n13\n12\n12\n\n25\n20\n20\n\n15\n10\n10\n\n43\n15\n17\n\n19\n10\n11\n\n52\n15\n18\n\n13\n\n30\n\nAngle between tracks\n6\nZ\n11\n\nE\n20\n\nθ12 =31o , θ23 =105o , θ34 =54o\nθ45 =83o , θ56 =31o , θ61 =25o\nθ12 =86o , θ23 =52o , θ34 =37o\nθ45 =83o , θ51 =54o\nθ12 =87o , θ23 =50o , θ34 =100o\nθ41 =62o\nθ12 =99o , θ23 =93o , θ31 =83o\nθ12 =108o , θ23 =58o , θ31 =73o\nθ12 =101o , θ23 =105o , θ31 =58o\n\n4\n\n\f"}