{"id": "http://arxiv.org/abs/0705.0261v1", "guidislink": true, "updated": "2007-05-02T17:02:03Z", "updated_parsed": [2007, 5, 2, 17, 2, 3, 2, 122, 0], "published": "2007-05-02T17:02:03Z", "published_parsed": [2007, 5, 2, 17, 2, 3, 2, 122, 0], "title": "Exact dimer ground states for a continuous family of quantum spin chains", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.4142%2C0705.4249%2C0705.4563%2C0705.4197%2C0705.4229%2C0705.3631%2C0705.4526%2C0705.2507%2C0705.3091%2C0705.3540%2C0705.2997%2C0705.1209%2C0705.1362%2C0705.2671%2C0705.2183%2C0705.2495%2C0705.4239%2C0705.4617%2C0705.2267%2C0705.1141%2C0705.0578%2C0705.3830%2C0705.1281%2C0705.3674%2C0705.1699%2C0705.2944%2C0705.3671%2C0705.0473%2C0705.1254%2C0705.0182%2C0705.3053%2C0705.3501%2C0705.0691%2C0705.0398%2C0705.1870%2C0705.0607%2C0705.1133%2C0705.4283%2C0705.1693%2C0705.2348%2C0705.1812%2C0705.3487%2C0705.0849%2C0705.2779%2C0705.0261%2C0705.3615%2C0705.2316%2C0705.1861%2C0705.1438%2C0705.4156%2C0705.1220%2C0705.2401%2C0705.3087%2C0705.0319%2C0705.1199%2C0705.4154%2C0705.0017%2C0705.2081%2C0705.2444%2C0705.0128%2C0705.2682%2C0705.4411%2C0705.3147%2C0705.0279%2C0705.3740%2C0705.4681%2C0705.3844%2C0705.3712%2C0705.2968%2C0705.1632%2C0705.2805%2C0705.0072%2C0705.1953%2C0705.3293%2C0705.0993%2C0705.0004%2C0705.1547%2C0705.1304%2C0705.0748%2C0705.1793%2C0705.1850%2C0705.3116%2C0705.2945%2C0705.0282%2C0705.1426%2C0705.1713%2C0705.3225%2C0705.3144%2C0705.3852%2C0705.1709%2C0705.0836%2C0705.1090%2C0705.2645%2C0705.3861%2C0705.1448%2C0705.1510%2C0705.2259%2C0705.3650%2C0705.0377%2C0705.2584%2C0705.0408&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exact dimer ground states for a continuous family of quantum spin chains"}, "summary": "Using the matrix product formalism, we define a multi-parameter family of\nspin models on one dimensional chains, with nearest and next-nearest neighbor\nanti-ferromagnetic interaction for which exact analytical expressions can be\nfound for its doubly degenerate ground states. The family of Hamiltonians which\nwe define, depend on 5 continuous parameters and the Majumdar-Ghosh model is a\nparticular point in this parameter space. Like the Majumdar-Ghosh model, the\ndoubly degenerate ground states of our models have a very simple structure,\nthey are the product of entangled states on adjacent sites. In each of these\nstates there is a non-zero staggered magnetization, which vanishes when we take\ntheir translation-invariant combination as the new ground states. At the\nMajumdar-Ghosh point, these entangled states become the spin-singlets\npertaining to this model. We will also calculate in closed form the two point\ncorrelation functions, both for finite size of the chain and in the\nthermodynamic limit.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.4142%2C0705.4249%2C0705.4563%2C0705.4197%2C0705.4229%2C0705.3631%2C0705.4526%2C0705.2507%2C0705.3091%2C0705.3540%2C0705.2997%2C0705.1209%2C0705.1362%2C0705.2671%2C0705.2183%2C0705.2495%2C0705.4239%2C0705.4617%2C0705.2267%2C0705.1141%2C0705.0578%2C0705.3830%2C0705.1281%2C0705.3674%2C0705.1699%2C0705.2944%2C0705.3671%2C0705.0473%2C0705.1254%2C0705.0182%2C0705.3053%2C0705.3501%2C0705.0691%2C0705.0398%2C0705.1870%2C0705.0607%2C0705.1133%2C0705.4283%2C0705.1693%2C0705.2348%2C0705.1812%2C0705.3487%2C0705.0849%2C0705.2779%2C0705.0261%2C0705.3615%2C0705.2316%2C0705.1861%2C0705.1438%2C0705.4156%2C0705.1220%2C0705.2401%2C0705.3087%2C0705.0319%2C0705.1199%2C0705.4154%2C0705.0017%2C0705.2081%2C0705.2444%2C0705.0128%2C0705.2682%2C0705.4411%2C0705.3147%2C0705.0279%2C0705.3740%2C0705.4681%2C0705.3844%2C0705.3712%2C0705.2968%2C0705.1632%2C0705.2805%2C0705.0072%2C0705.1953%2C0705.3293%2C0705.0993%2C0705.0004%2C0705.1547%2C0705.1304%2C0705.0748%2C0705.1793%2C0705.1850%2C0705.3116%2C0705.2945%2C0705.0282%2C0705.1426%2C0705.1713%2C0705.3225%2C0705.3144%2C0705.3852%2C0705.1709%2C0705.0836%2C0705.1090%2C0705.2645%2C0705.3861%2C0705.1448%2C0705.1510%2C0705.2259%2C0705.3650%2C0705.0377%2C0705.2584%2C0705.0408&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using the matrix product formalism, we define a multi-parameter family of\nspin models on one dimensional chains, with nearest and next-nearest neighbor\nanti-ferromagnetic interaction for which exact analytical expressions can be\nfound for its doubly degenerate ground states. The family of Hamiltonians which\nwe define, depend on 5 continuous parameters and the Majumdar-Ghosh model is a\nparticular point in this parameter space. Like the Majumdar-Ghosh model, the\ndoubly degenerate ground states of our models have a very simple structure,\nthey are the product of entangled states on adjacent sites. In each of these\nstates there is a non-zero staggered magnetization, which vanishes when we take\ntheir translation-invariant combination as the new ground states. At the\nMajumdar-Ghosh point, these entangled states become the spin-singlets\npertaining to this model. We will also calculate in closed form the two point\ncorrelation functions, both for finite size of the chain and in the\nthermodynamic limit."}, "authors": ["M. Asoudeh", "V. Karimipour", "A. Sadrolashrafi"], "author_detail": {"name": "A. Sadrolashrafi"}, "author": "A. Sadrolashrafi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.76.064433", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0705.0261v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0705.0261v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0705.0261v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0705.0261v1", "journal_reference": "Phys. Rev. B 76, 064433 (2007).", "doi": "10.1103/PhysRevB.76.064433", "fulltext": "arXiv:0705.0261v1 [cond-mat.str-el] 2 May 2007\n\nExact dimer ground states for a continuous family of\nquantum spin chains\n\nM. Asoudeh1 ,\n\nV. Karimipour 2 ,\n\nL. A. Sadrolashrafi3 ,\n\n†,‡ Department\n\nof Physics, Sharif University of Technology,\nP.O. Box 11365-9161, Tehran, Iran\n\nAbstract\nUsing the matrix product formalism, we define a multi-parameter family of\nspin models on one dimensional chains, with nearest and next-nearest neighbor\nanti-ferromagnetic interaction for which exact analytical expressions can be found\nfor its doubly degenerate ground states. The family of Hamiltonians which we\ndefine, depend on 5 continuous parameters and the Majumdar-Ghosh model is\na particular point in this parameter space. Like the Majumdar-Ghosh model,\nthe doubly degenerate ground states of our models have a very simple structure,\nthey are the product of entangled (dimer) states on adjacent sites. In each of\nthese states there is a non-zero staggered magnetization, which vanishes when\nwe take their translation-invariant combination as the new ground states. At the\nMajumdar-Ghosh point, these entangled states become the spin-singlets pertaining to this model. We will also calculate in closed form the two point correlation\nfunctions, both for finite size of the chain and in the thermodynamic limit.\n\nPACS: 03.67.-a, 75.10 Jm.\n\n1\n\nemail:salipour@physics.iust.ac.ir\nCorresponding author:vahid@sharif.edu\n3\nemail:laleh@physics.sharif.edu\n2\n\n\f1\n\nIntroduction\n\nOne of the basic problems of many body physics is to use analytical and numerical\ntools to find the ground state of a many-body system governed by a given Hamiltonian. Unfortunately, except for a few exactly solvable examples, the task of finding\nthe exact ground state of a given Hamiltonian is notoriously difficult. Moreover in\nsome cases also like the anti-ferromagnetic Heisenberg chain, although the ground\nstate is known, its structure turns out to be quite complicated, making the calculation of correlation functions very difficult.\nIn dealing with difficult problems, one way round the difficulty is to investigate\nthe inverse problem, that is to start from states with pre-determined properties and\nfind the family of Hamiltonians for which such a state is an exact ground state. The\nsuitable formalism for following this path is the matrix product formalism, which was\nfirst realized in the work of [1], then formalized in finitely correlated states [2, 3], also\nknown as optimal [4, 5] or matrix product states. This formalism has been followed\nin recent years both constructing various models of interacting spins on chains, [4, 5],\nladders [6, 7] and some two dimensional lattices [8].\nIt has also been studied to gain a better understanding of many phenomena in correlated systems, i.e. quantum phase transitions [9], renormalization group algorithms\n[10], and entanglement [11].\nOf particular interest to us in this paper is the so called Majumdar-Ghosh model\ndefined on a ring of 2N sites by the following Hamiltonian\nH0 =\n\n2N\nX\ni=1\n\n2σi * σi+1 + σi * σi+2 ,\n\n(1)\n\nwhich has been introduced and solved exactly in a series of papers long ago [12, 13, 14],\nbefore the advent of the matrix product formalism, and later found to have a matrix\nproduct representation [15]. It was shown in the original papers that the ground\nstate of this system is doubly degenerate, and each of these states has a very simple\nstructure, that is, it is a product of singlets on adjacent sites. Let us call these\nground states |φ1 i and |φ2 i, and denote a singlet state on two adjacent sites by\nS = √12 (|01i − |10i), where |0i and |1i denote the up and down spin in the z direction,\ni.e. |0i = |z, +i, |1i = |z, −i. Then the degenerate ground states of (1) are:\n|φ1 i = S1,2 S3,4 * * * S2N −1,2N ,\n|φ2 i = S2N,1 S2,3 * * * S2N −2,2N −1 ,\n\n(2)\n\nwith H0 |φ1,2 i = −6N |φ1,2 i. From these two states, one can form the new states\n|Ψ± i := |φ1 i ± |φ2 i, which are eigenstates of the single-unit translation operator T\non the ring, i.e. T |Ψ± i = ±|Ψ± i. The correlation functions on these new translation\ninvariant ground states, denoted by the subscripts ±, are defined as:\nhσ1a σra i± =\n\n±\na a\nhΨ±\n0 |σ1 σr |Ψ0 i\n,\n±\nhΨ±\n0 |Ψ0 i\n\n1\n\na = x, y, z.\n\n\fThese were calculated in thermodynamic limit (N −→ ∞) in [12] and were found to\nbe\n1\nhσ1a σra i± = − δr,2\na = x, y, z.\n(3)\n2\nSince then many works have been done on different aspects of this model[16], including\nstudies of spontaneous dimereization, excitation spectrum [17] and renormalization\ngroup study [18] of this or very closely related models (i.e. models with anisotropy).\nIt has also been shown [19] that the Majumdar-Ghosh model is the first member of a\ndiscrete series of models, all having exact dimer ground states, where exchange coupling decreases linearly with the separation of spins, and vanishes beyond a certain\nrange, ν (ν = 2 for the Majumdar-Ghosh model).\nThe aim of this paper is to study the Majumdar Ghosh model in the context of\nmatrix product formalism and in this way introduce a a multi-parameter deformations\nof this model and prove that its ground state is still doubly degenerate and dimerized.\nAs is clear from (1), the Majumdar-Ghosh model is rotationally invariant. What we\nwill do in this paper is that we reduce this symmetry to rotations in the x − y plane\nonly and ask what are the Hamiltonians on the chain with nearest and next-nearest\nneighbor interactions, which are still exactly solvable.\nWe will find a multi-parameter family of such exactly solvable Hamiltonians and\nshow that their ground states are doubly degenerate and of dimer type. Both the\nHamiltonian and their ground states will reduce to those of the Majumdar-Ghosh\nmodel in a certain limit. We will calculate all the correlation functions not only in\nthermodynamic limit, but for any finite N . Our generalization of this model may shed\nlight on some aspects of the Majumdar-Ghosh model and provide different proofs for\nsome of its properties.\nMoreover, since the model is less symmetric and has 5 tunable parameters, it may be\nmore flexible for matching with real experimental situations.\nThe structure of this paper is as follows: first we review briefly the matrix product\nformalism in section (2) and then in section (3) we derive the Majumdar-Ghosh model\nby using the matrix product formalism. In section (4) we use the same formalism to\nconstruct a continuous multi-parameter family of models, and show that the original\nMajumdar-Ghosh model corresponds to a specific point in this parameter space. In\nvarious subsections of this section we make a detailed study of this model, derive its\nHamiltonian, determine the structure of its ground state and prove that the doubly\ndegenerate ground states of this model have a simple structure, that is, they are products of entangled spin states on adjacent sites, in the same way that the ground states\nof the Majumdar-Ghosh model are products of singlets on adjacent sites. We also\ncalculate all the one and the two point- functions of this model. In particular we show\nthat each of the degenerate ground states has a non-zero staggered magnetization,\nhowever the translation-invariant ground states have zero staggered magnetization.\nWe conclude the paper with a discussion.\n\n2\n\n\f2\n\nMatrix Product States\n\nLet us first make a quick review of the matrix product states in a language which we\nfind convenient [9]. For more detailed reviews of the subject, the reader can consult\nmore comprehensive review articles [15]. Consider a ring of N sites, where each site\ndescribes a d−level state. The Hilbert space of each site is spanned by the basis\nvectors |ii, i = 0, * * * , d − 1. A state\n|Ψi =\n\nX\n\ni1 ,i2 ,***,iN\n\nΨi1 i2 ***iN |i1 i2 * * * iN i\n\nis called a matrix product state if there exist matrices Ai ,\ndimension D), such that\n1\nΨi1 i2 ***iN = √ tr(Ai1 Ai2 * * * AiN ),\nZ\n\ni = 0, * * * , d − 1 (of\n(4)\n\nwhere Z is a normalization constant. This constant is given by\nZ = tr(E N ),\nwhere\nE=\n\nd−1\nX\ni=0\n\nA∗i ⊗ Ai .\n\nNote that we are here considering homogeneous matrix product states (MPS) where\nthe matrices depend on the value of the spin at each site and not on the site itself.\nMore general MPS's can be defined where the matrices depend also on the sites [15].\nIt has been shown that such states can represent any quantum state on a chain [?].\nThe collection of matrices {Ai } and {μU Ai U −1 }, where μ is an arbitrary complex\nnumber, both lead to the same matrix product state, the freedom in scaling with μ, is\ndue to its cancelation with Z in the denominator of (4). This freedom will be useful\nwhen we discuss symmetries.\nSymmetries: The state |Ψi is reflection symmetric if there exists a matrix Π and\na scalar σ such that\nATi = σΠAi Π−1\n∀ i.\nIt is invariant under spin flip transformation if there exists a matrix X and a scalar\nλ, such that\n∀ i.\nAi = λXAi X −1\nFinally, it is time-reversal invariant if there exists a matrix V , and a scalar τ such\nthat\nA∗i = τ V Ai V −1 ,\n∀ i.\nIn this article, we work with real matrices so that the last condition is automatically\nsatisfied. Let us now turn to continuous symmetries.\n\n3\n\n\fConsider a local symmetry operator R acting on a site as R|ii = Rji |ji where\nsummation convention is being used. R is a d dimensional unitary representation of\nthe symmetry. A global symmetry operator R := R⊗N will then change this state to\nanother matrix product state\nΨi1 i2 ***iN −→ Ψ′i1 i2 ***iN := tr(A′i1 A′i2 * * * A′iN ),\nwhere\nA′i := Rij Aj .\nThe state |Ψi is invariant under this symmetry if there exist an operator U (R) and a\nscalar λR such that\nRij Aj = λR U −1 (R)Ai U (R).\n(5)\nRepeating this transformation puts the constraint\nλR′ λR UR′ UR = λR′ R UR′ R .\nThus U (R) is a D dimensional projective representation of the symmetry R. In case\nthat R is a continuous symmetry with generators Ta , equation (5), leads to\n(Ta )ij Aj = [Ai , Ta ] + μa Ai ,\n\n(6)\n\nwhere Ta and Ta are the d− and D−dimensional representations of the Lie algebra\nof the symmetry, and μa are numbers. In this paper we will restrict our study to the\ncase of μa = 0. Equations (5) and (6) will be our guiding lines in defining states with\nprescribed symmetries.\nThe Hamiltonian: Given a matrix product state, the reduced density matrix of\none site is given by\ntr((A∗i ⊗ Aj )E N −1 )\n.\nρij =\ntr(E N )\nThis density matrix has at least d − D 2 zero eigenvalues. To see this, suppose that\nwe can find complex numbers cj such that\nd−1\nX\n\ncj Aj = 0.\n\n(7)\n\nj=0\n\nThis is a system of D 2 equations for d unknowns which has at least d−D 2 independent\nsolutions. Any solution cj gives a null eigenvector of ρij . Thus the null space of the\nreduced density matrix of one site comprises a subspace of at least d − D 2 dimension,\nspanned by the independent solutions of equation (7).\nThe same reasoning applies to reduced density matrices of k consecutive sites which\nare given by\ntr((A∗i1 * * * A∗ik ⊗ Aj1 * * * Ajk )E N −k )\n.\nρi1 ***ik ,j1***jk =\ntr(E N )\n4\n\n\fIn this case the null space of the reduced density matrix of k sites is spanned by the\nsolutions of\nd−1\nX\n\nj1 ,***,jk =0\n\ncj1 ***jk Aj1 * * * Ajk = 0.\n\n(8)\n\nThe number of independent solutions of this system of equation is now dk − D 2 . Thus\nfor the density matrix of k sites to have a null space it is sufficient (but not necessary\nand this is a crucial point) that the following inequality holds\ndk > D 2 .\nLet the null space of the reduced density matrix be spanned by the orthogonal vectors\n|eα i, (α = 1, * * * , s ≥ dk − D 2 ). Then we can construct the local hamiltonian acting\non k consecutive sites as\ns\nh :=\n\nX\n\nα=1\n\nλα |eα iheα |,\n\nwhere λα 's are positive constants. These constants together with the parameters of\nthe vectors |eα i inherited from those of the original matrices Ai , determine the total\nnumber of coupling constants of the Hamiltonian. If we call the embedding of this\nlocal Hamiltonian into the sites l to l + k by hl,l+k then the full Hamiltonian on the\nchain is written as\nN\nX\n\nH=\n\nhl,l+k .\n\nl=1\n\nThe state |Ψi is then a ground state of this hamiltonian with vanishing energy. The\nreason is as follows:\nhΨ|H|Ψi = tr(H|ΨihΨ|) =\n\nN\nX\n\ntr(hl,l+k ρl,l+k ) = 0,\n\nl=1\n\nwhere ρl,k+l is the reduced density matrix of sites l to l +k and in the last line we have\nused the fact that h is constructed from the null eigenvectors of ρ for k consecutive\nsites. Given that H is a positive operator, this proves the assertion.\nCorrelation functions: Let O be any local operator acting on a single site. Then\nwe can obtain the one point function on site k of the chain hΨ|O(k)|Ψi as follows:\nhΨ|O(k)|Ψi =\nwhere\nEO :=\n\nd−1\nX\n\ntr(E k−1 EO E N −k )\n,\ntr(E N )\n\nhi|O|jiA∗i ⊗ Aj .\n\ni,j=0\n\nIn the thermodynamic limit N −→ ∞, equation (9) gives\nhΨ|O|Ψi =\n\nhλmax |EO |λmax i\nλmax\n5\n\n(9)\n\n\fwhere we have used the translation invariance of the model and λmax is the eigenvalue\nof E with the largest absolute value, for which the matrix element is non-vanishing,\nand |λmax i and hλmax | are the right and left eigenvectors corresponding to this eigenvalue, normalized such that hλmax |λmax i = 1. Here we are assuming that the largest\neigenvalue of E is non-degenerate.\nThe n-point functions can be obtained in a similar way. For example, the two-point\nfunction hΨ|O(k)O(l)|Ψi can be obtained as\nhΨ|O(k)O(l)|Ψi =\n\ntr(EO (k)EO (l)E N )\ntr(E N )\n\n(10)\n\nwhere EO (k) := E k−1 EO E −k . Note that this is a formal notation which allows us\nto write the n-point functions in a uniform way, it does not require that E is an\ninvertible matrix. In the thermodynamic limit the two point function turns out to be\nhΨ|O(1)O(r)|Ψi =\n\n3\n\n1 X\n\nλrmax i\n\nλir−2 hλmax |EO |λi ihλi |EO |λmax i.\n\nThe Majumdar-Ghosh model\n\nWe take the size of the ring an even number 2N . Let us also choose d = 2 (spin 1/2\nparticles), k = 3 (interactions up to next-nearest neighbors) and work with D = 3\ndimensional matrices. Note that the condition dk > D 2 is not satisfied here, but in\nview of the fact that this is a sufficient and not necessary condition, this will not be a\nsource of concern. The basic symmetry that we demand is the rotational symmetry\naround the z axis, which according to (6) demands that there be a matrix Sz such\nthat\n1\n1\n[A1 , Sz ] = − A1 .\n[A0 , Sz ] = A0 ,\n2\n2\nWorking in a basis where Sz = diagonal(−1/2, 0, 1/2), these equations immediately\nshow that A0 and A1 should be of the following form:\n\n\n\n\n0 p 0\n\n\nA0 :=  0 0 q \n0 0 0\n\n,\n\n\n\n\n\n0 0 0\n\n\nA1 :=  h 0 0  .\n0 g 0\n\nBy a similarity transformation Ai −→ SAi S −1 where S = diagonal(1, p, pq), the\nparameters of the matrix A0 are both set equal to 1, (the parameters of A1 change\nwhich we again denote them by g and h.) At this stage no similarity transformation or\nre-scaling, can reduce the number of parameters, however we note that the matrices\nA0 and A1 act as raising and lowering operators on the 3 dimensional space they act\non, (i.e.A0 |ii = |i + 1i, A1 |ii ∝ |i − 1i) and hence the trace of any string of operators\nAi1 Ai2 * * * Ai2N is non-zero only if the number of A0 and A1 operators are equal in\nsuch a string. This implies first that any such string should be of even length (that\nis why we have taken a ring of even length), and second that a factor of hN will be\n6\n\n\fremoved from the numerator and denominator of (4) due to the normalization of the\nstate.\nThus the final matrices which will make a matrix product state with Sz symmetry,\nwill be of the form:\n\n\n\n\n0 1 0\n\n\nA0 :=  0 0 1 \n0 0 0\n\n,\n\n\n\n\n\n0 0 0\n\n\nA1 :=  1 0 0  .\n0 g 0\n\n(11)\n\nThis is all we can go with Sz symmetry and we will in fact make a detailed study of\nsuch models in the next section.\nWhat happens if we impose the discrete spin-flip symmetry on the state? This\ndemands that there be a matrix X and a scalar λ such that\nA0 = λXA1 X −1 ,\n\nA1 = λXA0 X −1 .\n\nA short calculation shows that the matrix\nequal to\n\n0\n\nX= 0\nλ2\n\nX which satisfies the above equation is\n\n\n0 1\n\nλ 0 ,\n0 0\n\nwhere λ2 = g = 1 . Thus spin-flip symmetry requires that the parameter g be a\ndiscrete parameter which we rename as g = ǫ, where ǫ = ±1.\nIt is now found that the parity symmetry imposes no new condition on the parameters, since with the following matrix\n\n\n\n\n0 0 1\n√\n\n\nǫ 0 ,\nΠ= 0\nǫ 0 0\n√\none can verify that ATi = ǫΠAi Π−1 . Therefore the final form of the matrices leading\nto a model with a continuous Sz symmetry plus two discrete parity and spin flip\nsymmetries will be of the form:\n\n\n\n\n0 1 0\n\n\nA0 :=  0 0 1 \n0 0 0\n\n,\n\n\n\n\n\n0 0 0\n\n\nA1 :=  1 0 0  .\n0 ǫ 0\n\n(12)\n\nHow is the matrix product state (4) with the above matrices is related to the\nstates |φ1,2 i? We will show in the next section, when we study the generalization\nof this model, that the matrix product state is equal to |φ1 i + |φ2 i, that is it is the\nlinear superposition of the ground states which is invariant under translation (with\neigenvalue 1). In fact it has been shown that both |φ1 i and |φ2 i are ground states\nand so translation invariant combinations of them, namely |Ψ± i := |φ1 i ± |φ2 i, are\n7\n\n\falso ground states. The point is that only |Ψ+ i has a matrix product representation.\nIt sometimes happens that from a single matrix product state, one can derive the\ndegenerate grounds states of a model not all of which have matrix product representations. The Majumdar-Ghosh model is one such case.\nLet us also find the Hamiltonian. With the matrices (12) we should solve the\nP\nequations 1i,j,k=0 cijk Ai Aj Ak = 0. It is readily found that the solution space of this\nsystem is spanned by the following four vectors:\n|e1 i\n|e2 i\n|e3 i\n|e4 i\n\n=\n=\n=\n=\n\n|000i\n|111i\n|001i − ǫ|010i + |100i\n|011i − ǫ|101i + |110i.\n\nThese vectors are parity invariant (invariant under left-right reflection) and are mapped\nto each other under spin-flip transformation (|0i → |1i, |1i → |0i). A Hamiltonian\nwith all three symmetries is constructed as:\nh = J(|e1 ihe1 | + |e2 ihe2 |) + K(|e3 ihe3 | + |e4 ihe4 |),\nwhich when expanded in terms of the spin operators, and embedded into the chain,\nmakes the total Hamiltonian equal to the following:\nH=\n\nN\nX\ni=1\n\n−Kǫσi * σi+1 +\n\nJ + (2ǫ − 1)K\nJ − 3K\nK\nσi * σi+2 +\nσi,z σi+1,z +\nσi,z σi+2,z .\n2\n2\n4\n\nFor ǫ = 1 this reduces to\nH1 =\n\n2N\nX\ni=1\n\n−Kσi * σi+1 +\n\nJ +K\nJ − 3K\nK\nσi * σi+2 +\nσi,z σi+1,z +\nσi,z σi+2,z ,\n2\n2\n4\n\nand for ǫ = −1 reduces to\nH−1 =\n\n2N\nX\ni=1\n\nKσi * σi+1 +\n\nK\nJ − 3K\nσi * σi+2 +\n(2σi,z σi+1,z + σi,z σi+2,z ).\n2\n4\n\nIt is the Hamiltonian H−1 which turns into the already familiar Majumdar-Ghosh\nmodel (1), by taking J = 3K. For general values of J and K it describes the\nz\nis the\nanisotropic Majumdar-Ghosh model, where the anisotropy parameter JxJ=J\ny\nsame for both the nearest and next-nearest neighbors.\nWe do not know whether this is already well-known that this model is also exactly\nsolvable. In fact one can check directly that the eigenstates (2) are also eigenstates\nof the operator\nHz :=\n\n2N\nX\n\nz\nz\n2σiz σi+1\n+ σiz σi+2\n,\n\ni=1\n\n8\n\n\fwith eigenvalue 2N . To see this one needs to invoke the following relations which\nhold true for any two consecutive singlets S12 and S34 :\nσ1z σ2z S1,2 S3,4\nσ1z σ3z S1,2 S3,4\nσ2z σ3z S1,2 S3,4\n\n= −S1,2 S3,4\n= U1,2 U3,4\n= −U1,2 U3,4 ,\n\nwhere U = √12 (|01i + |10i).\nUsing these relations one sees that in Hz |φ1,2 i all the terms containing the U terms\ncancel out and one is left with Hz |φ1,2 i = −2N |φ1,2 i.\nPutting all these together we find\nH−1 |φ1,2 i =\n\n−J − 3K\nN |φ1,2 i.\n2\n\nWhat is the Hamiltonian H1 ? Does it represent any new model? The answer is\nnegative. To see this we note that by rotating the even-numbered spins around the z\nx,y\nx,y\nz −→ σ z , while keeping the\naxis by an angle of π, under which σ2i\n−→ −σ2i\nand σ2i\n2i\nodd-numbered spins intact, the Hamiltonian H1 is mapped onto H−1 .\nThis transformation will map the states |φ1,2 i onto the states |χ1,2 i where\n|χ1 i = U1,2 U3,4 * * * U2N −1,2N ,\n|χ2 i = U2N,1 U2,3 * * * U2N −2,2N −1 .\nThese states are the doubly degenerate ground states of H1 .\n\n4\n\nDeformation of the Majumdar-Ghosh model\n\nIn the last section we have shown how the Majumdar-Ghosh Hamiltonian and its\nground states are derived in the matrix product formalism. Let us now relax the condition of parity symmetry, which automatically removes also the spin flip symmetry.\nThen the matrices will be of the form (11), which still have the continuous symmetry\nof rotation around the z axis. It is now easily verified that the solution space of the\nsystem of equations (8) with k = 3 is spanned by the following four vectors:\n|e1 i\n|e2 i\n|e3 i\n|e4 i\n\n=\n=\n=\n=\n\n|000i\n|111i\n|001i − g|010i + g 2 |100i\n|011i − g|101i + g 2 |110i.\n\nThe most general local Hamiltonian having the matrix product state as its ground\nstate is now given by\nh = J1 |e1 ihe1 | + J2 |e2 ihe2 | + J3 |e3 ihe3 | + J4 |e4 ihe4 |.\n\n9\n\n\fRewriting this in terms of spin operators we find after some rather lengthy calculations\nthe following form of the final Hamiltonian\nH=\n\nN\n1X\nz\nz\nz\nz\nK1 σi * σi+1 + K2 σi * σi+2 + K3 σiz σi+1\n+ K4 σiz σi+2\n+ K5 σiz + K6 σiz σi+1\nσi+2\n8 i=1\nz\nz\n+ K7 σiz σi+1 σi+2 + K8 σi * σi+1 σi+2\n+ K9 σi * σi+1\nσi+2 ,\n(13)\n\nwhere the couplings are\nK1\nK2\nK3\nK4\nK5\nK6\nK7\nK8\nK9\n\n=\n=\n=\n=\n=\n=\n=\n=\n=\n\n−2g(1 + g 2 )(J3 + J4 )\n2g2 (J3 + J4 )\n2(J1 + J2 ) + 2(J3 + J4 )(g − g2 + g3 )\nJ1 + J2 − (J3 + J4 )(1 + g 2 + g4 )\n3(J1 − J2 ) + (J3 − J4 )(1 + g2 + g 4 )\nJ1 − J2 − (J3 − J4 )(1 − g + g 2 )2\n−2gJ3 + 2g 3 J4\n−2g3 J3 + 2gJ4\n2g2 (J3 − J4 ).\n\nThis is a 5-parameter family of models with nearest neighbor and next-nearest neighbor interactions, whose ground state can be written down exactly. We will show that\nwith the couplings as above, this model has a doubly degenerate ground state, each\nof which has a simple product structure of dimers, like the one given in (2).\nNote that the Hamiltonian (13) will reduce to H−1 when we restrict the parameters\nas follows\ng = −1, J1 = J2 = J, J3 = J4 = K\nand to (1) when we further set J = 3K.\n\n4.1\n\nStructure of the matrix product state\n\nThe matrix product state (11) has a simple structure. We prove the following theorem:\nTheorem: The matrix product state (4) constructed from the matrices (11) which\nis a ground state of (13) has the following structure. Define a state\nS(g) := g|01i + |10i,\n|φ1 (g)i = S1,2 (g)S3,4 (g)S5,6 (g) * * * S2N−1,2N (g)\n\n|φ2 (g)i = S2N,1 (g)S2,3 (g)S4,5 (g) * * * S2N−2,2N−1 (g),\n\n(14)\n\nthat is |φ2 (g)i = T |φ1 (g)i, where T is the translation operator along the chain by one\nlattice unit. Then we have\n|Ψ(g)i = |φ1 (g)i + |φ2 (g)i.\n10\n\n\fProof: Consider the matrix product state |Ψ(g)i =\namplitudes Ψi1 i2 ***i2N are non-vanishing only when\n\nP\n\nΨi1 i2 ***i2N |i1 i2 * * * i2N i. The\n\ni) the number of 0 indices and 1 indices are equal (in view of the fact that the matrices A0 and A1 are raising and lowering operators), ii) no three consecutive indices\nare 0 or 1, (since A30 = A31 = 0), and iii) no substrings of the types * * * 11011 * * * or\n* * * 00100 * * * appear in the indices, (since A21 A0 A21 = A20 A1 A20 = 0.)\nLet us define the compact notations 0 := 01 and 1 := 10. In view of the above\nthree properties, we can divide the set of states |i1 , i2 , * * * i2N i into two types, type\n1, which are states of the form |00110i = |0101101001i, that is, strings of 0's and\n1,s in arbitrary order, and type 2, which are transformed to the above type by a\none-unit cyclic translation like |1010110100i. There is a one to one correspondence\nbetween these two types of states and hence the state |Ψi can be divided in two parts,\ndepending on the type of basis states |Ψ(g)i = |φ1 (g)i + |φ2 (g)i , where\nX\n\nφ1 (g) =\n\nα1 ,α2 ,***,αN =0,1\n\nφα1 α2 ***αN |α1 α2 * * * αN i\n\nand |φ2 (g)i = T |φ1 (g)i. We now note that\n\n\nA0 ≡ A0 A1 = \n\n\n1\ng\n\n\n\n\n\nA1 ≡ A1 A0 = \n\n\n\n\n\n\n\n1\ng\n\n\n.\n\n(15)\n\nThis means that A0 and A1 commute with each other, which immediately implies\nthat |φ1 (g)i is a product state, i.e.\n|φ1 (g)i =\n\nN\nX\n\nm=0\n\nN −m\ntr(Am\n)|0m 1N −m i\n0 A1\n\n=\n\nN\nX\n\nm=0\n\ngm |0m 1N −m i = (g|0i + |1i)⊗N ,\n\nwhere |0m 1N −m i denotes a uniform superposition of states each of which has m 0′ s\nand N − m 1's, in different positions. This completes the proof.\nAre the two individual states |φ1 (g)i and |φ2 (g)i the ground states of H? There\nare supports for thinking so. First we have checked this for low values of system\nsize N and second we know that as g −→ −1, these states approach the states\nof Majumdar-Ghosh (2) which are known to be ground states of the Hamiltonian\nH−1 . Therefore we can make two linear combinations of these ground states, namely\n|Ψ+ (g)i := |φ1 (g)i+|φ2 (g)i which has a matrix product representation and |Ψ− (g)i :=\n|φ1 (g)i − |φ2 (g)i which does not have such a representation. In the next subsection\nwe calculate the correlation functions on these translation invariant states and they\nagain approach the ones calculated in [12] in the limit g = −1 and N −→ ∞. For our\nfuture reference we need the following easily verified properties:\nhφ1 (g)|φ1 (g)i = hφ2 (g)|φ2 (g)i = (1 + g 2 )N\n11\n\nhφ1 (g)|φ2 (g)i = hφ2 (g)|φ1 (g)i = 2g N .\n\n\f4.2\n\nCorrelation functions\n\nIn the Majumdar-Ghosh model both the ground states (2) have anti-ferromagnetic\norder and hσix,y,z i = 0. This is clear from the fact that the states (2) are product of\nsinglets on adjacent sites. In our model, the states are no longer singlets and while\nthere is no magnetic order present, the staggered magnetization is non-vanishing.\nConsider the states |φ1 (g)i, and |φ2 (g)i. In view of their simple product structure, it\nis readily seen that\nhφ1 (g)|σ1z |φ1 (g)i = −hφ1 (g)|σ2z |φ1 (g)i = hS12 |σ1z |S12 i =\n\n1 − g2\n,\n1 + g2\n\nand\nhφ2 (g)|σ1z |φ2 (g)i = −hφ2 (g)|σ2z |φ2 (g)i = hS2N,1 |σ1z |S2N,1 i =\n\ng2 − 1\n.\n1 + g2\n\n(16)\n\n(17)\n\nThis means that the value of staggered magnetization defined as\n(ms )φi :=\n\nN\n1 X\nhφi |σz,2i−1 − σz,2i |φi i\n2N i=1\n\nis non-zero in these two states, i.e.\n(ms )φ1 =\n\n1 − g2\n,\n1 + g2\n\n(ms )φ2 =\n\ng2 − 1\n.\n1 + g2\n\nHowever there is no staggered magnetization in the translation invariant states\n|Ψ± i. To see this we can calculate σ1z for the state |Ψ+ i = |φ1 (g)i + |φ2 (g)i, either\nby using the matrix product formula (9) or by a direct calculation in which we use\n(16), (17) and\nhΨ± |O|Ψ± i =\n\nhφ1 |O|φ1 i + hφ2 |O|φ2 i ± 2hφ1 |O|φ2 i\n,\n2hφ1 |φ1 i ± 2hφ1 |φ2 i\n\n(18)\n\nin which O is any operator and we have abbreviated |φi (g)i to |φi i and used the\nfact that hφ1 |φ1 i = hφ2 |φ2 i to simplify terms in the denominator. For this direct\ncalculation, the only new quantity which is needed is hφ1 (g)|σ1z |φ2 (g)i. We know\nthat all the states in the expansion of |φ1 (g)i and |φ2 (g)i are different from each\nother except the states |010 * * * 1i and |101 * * * 0i which are common to both and\ntransformed into each other by the action of the translation operator T . So we find\nhφ1 (g)|σ1z |φ2 (g)i = (g n h01 * * * 1| + h10 * * * 0|)|σ1z |(gn |10 * * * 0i + |01 * * * 1i) = 0, (19)\nimplying that there is no staggered magnetization in |Ψ± i.\nThe two point functions can also be calculated along similar lines. We point out\nonly the general method. The product nature of |φ1 i and |φ2 i, formula (18) and\nthe reasoning used above for the calculation of the cross term hφ1 (g)|σ1z σrz |φ2 (g)i\nfacilitate calculations of hσ1z σrz i± . However the cross term hφ1 (g)|σ1x σrx |φ2 (g)i is hard\nto calculate in this way. Instead we calculate hσ1x σrx i+ (i.e. for the matrix product\n12\n\n\fstate |Ψ+ i) from (10) and infer the cross term from its result. We then use this cross\nterm for determining the correlation hσ1x σrx i− . The reader can verify these results\nby direct calculation for chains of small size. The interesting point is that all the\ncorrelation functions can be expressed in terms of a variable u := g + 1g which is\ninvariant under the interchange of g −→ 1g . The results are:\nhσ1z σ2z i± =\n\n−2 ± uN (2u−2 − 1)\n,\n2 ± uN\n\nand\nhσ1n σ2n i± =\n\nu ± uN −1\n,\n2 ± uN\n\nz\nhσ1z σr>2\ni = (−1)r\n\nn\ni=\nhσ1n σr>2\n\n−2 ± uN (4u−2 − 1)\n,\n2 ± uN\n\n2δr,odd + δr,even u\n.\n2 ± uN\n\nIt can be verified that these correlation functions reduce to (3) at the point g = −1\n(u = −2), after we take the thermodynamic limit (N −→ ∞).\n\n5\n\nDiscussion\n\nWe have constructed a 5-parameter family of spin-Hamiltonians with nearest and next\nnearest neighbor interactions and have found their exact ground states. The ground\nstates, depend on only one of these parameters, are doubly degenerate and have a very\nsimple structure. They are product of entangled states (dimers) on adjacent spins. We\nhave also calculated the one and the two point functions in closed analytic form both\nfor finite size of the chain and in the thermodynamic limit. The dimerized ground\nstates show staggered magnetization, but the translation-invariant combinations of\nthese states have no staggered magnetization.\n\n6\n\nAcknowledgement\n\nWe would like to thank A. Langari and R. Jafari, for very valuable discussions and the\nmembers of the Quantum information group of Sharif University, specially S. Alipour\nand L. Memarzadeh for instructive comments.\n\nReferences\n[1] I. Affleck, T. Kennedy, E.H. Lieb and H. Tasaki, Phys. Rev. Lett. 59, 799 (1987).\n[2] A. Klumper, A. Schadschneider and J. Sittartz, J. Phys. A (1991) L293; Z. Phys.\nB, 87 (1992) 281; Europhys. Lett., 24 (1993) 293.\n[3] M. Fannes, B. Nachtergaele and R. F. Werner, Commun. Math. Phys. 144, 443\n(1992).\n[4] M. A. Ahrens, A. Schadschneider, and J. Zittartz, Europhys. Lett. 59 6, 889\n(2002).\n\n13\n\n\f[5] E. Bartel, A. Schadschneider and J. Zittartz, Eur. Phys. Jour. B, 31, 2, 209-216\n(2003).\n[6] H. Niggemann, and J. Zittarz, Optimal ground states for spin 23 ladders with two\nlegs, cond-mat/9808342, A. K. Kolezhuk and H. J. Mikeska, Phys. Rev. Lett. 80,\n2709 (1998); Int. J. Mod. Phys. B, Vol.12, 2325-2348 (1998).\n[7] M. Asoudeh, V. Karimipour and A. Sadrolashrafi, Quantum Phase Transitions\nand Matrix Product States in Spin Ladders, quant-ph/0612207, To appear in Physical Review B.\n[8] M. A. Ahrens, A. Schadschneider and J. Zittartz, Phys. Rev. B, 71, 174432 (2005).\n[9] M. M. Wolf, G. Ortiz, F. Verstraete and I. Cirac, Phys. Rev. Lett.97, 110403\n(2006).\n[10] F. Verstraete et al., Phys. Rev. Lett. 94 (2005) 140601.\n[11] F. Verstraete, M. A. Martin-Delgado and J. I. Cirac, Phys. Rev. Lett. 92, 087201\n(2004).\n[12] C. K. Majumdar, J. Phys. C 3. 911(1969).\n[13] C. K. Majumdar and D. P. Ghosh, J. Math. Phys. 10 (1969)1388.\n[14] C. K. Majumdar and D. P. Ghosh, J. Math. Phys. 10 (1969)1399.\n[15] D. Peres Garcia, et al, Matrix Product State Representations, quant-ph/0608197.\n[16] P. M. Broek, Phys. Lett., 77A, no. 4, 1980.\n[17] B. S. Shastry and B. Sutherland, Phys. Rev. Lett. 47, 964 (1981).\n[18] R. Jafari, A. Langari, Physica A, vol. 364, p213-222 (2006).\n[19] B. Kumar, Phys. Rev. B 66, 024406 (2002).\n[20] S. Anders et al. Phys. Rev. Lett. 97, 107206 (2006); F. Verstraete and J. I. Cirac,\nPhys. Rev. B 73, 094423 (2006).\n\n14\n\n\f"}