{"id": "http://arxiv.org/abs/0807.1378v1", "guidislink": true, "updated": "2008-07-09T06:14:47Z", "updated_parsed": [2008, 7, 9, 6, 14, 47, 2, 191, 0], "published": "2008-07-09T06:14:47Z", "published_parsed": [2008, 7, 9, 6, 14, 47, 2, 191, 0], "title": "Stability of temporal solitons in uniform and \"managed\" quadratic\n  nonlinear media with opposite group-velocity dispersions at fundamental and\n  second harmonics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.4511%2C0807.1418%2C0807.1809%2C0807.4829%2C0807.3703%2C0807.3830%2C0807.2670%2C0807.0956%2C0807.4313%2C0807.2359%2C0807.1896%2C0807.2023%2C0807.0857%2C0807.3228%2C0807.3650%2C0807.0779%2C0807.4995%2C0807.1863%2C0807.3447%2C0807.4074%2C0807.4184%2C0807.2119%2C0807.3561%2C0807.4880%2C0807.1744%2C0807.3454%2C0807.1227%2C0807.2379%2C0807.3305%2C0807.0464%2C0807.1214%2C0807.2710%2C0807.2521%2C0807.3937%2C0807.0238%2C0807.0820%2C0807.2163%2C0807.1782%2C0807.1002%2C0807.3960%2C0807.0556%2C0807.1861%2C0807.2948%2C0807.3635%2C0807.0232%2C0807.4488%2C0807.0733%2C0807.0911%2C0807.3266%2C0807.3959%2C0807.4892%2C0807.4913%2C0807.1266%2C0807.1378%2C0807.0201%2C0807.0457%2C0807.1819%2C0807.2160%2C0807.4629%2C0807.3947%2C0807.1622%2C0807.2291%2C0807.0845%2C0807.1181%2C0807.2541%2C0807.3530%2C0807.0287%2C0807.0178%2C0807.3897%2C0807.3985%2C0807.4306%2C0807.4224%2C0807.1995%2C0807.4721%2C0807.1826%2C0807.1074%2C0807.4975%2C0807.3095%2C0807.3855%2C0807.2434%2C0807.0401%2C0807.0207%2C0807.2097%2C0807.2566%2C0807.3699%2C0807.4869%2C0807.3848%2C0807.4534%2C0807.4498%2C0807.2117%2C0807.0521%2C0807.1976%2C0807.2452%2C0807.3882%2C0807.1237%2C0807.1561%2C0807.3272%2C0807.5010%2C0807.2760%2C0807.4259%2C0807.1563&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stability of temporal solitons in uniform and \"managed\" quadratic\n  nonlinear media with opposite group-velocity dispersions at fundamental and\n  second harmonics"}, "summary": "The problem of the stability of solitons in second-harmonic-generating media\nwith normal group-velocity dispersion (GVD) in the second-harmonic (SH) field,\nwhich is generic to available chi^(2) materials, is revisited. Using an\niterative numerical scheme to construct stationary soliton solutions, and\ndirect simulations to test their stability, we identify a full\nsoliton-stability range in the space of the system's parameters, including the\ncoefficient of the group-velocity-mismatch (GVM). The soliton stability is\nlimited by an abrupt onset of growth of tails in the SH component, the relevant\nstability region being defined as that in which the energy loss to the tail\ngeneration is negligible under experimentally relevant conditions. We\ndemonstrate that the stability domain can be readily expanded with the help of\ntwo \"management\" techniques (spatially periodic compensation of destabilizing\neffects) - the dispersion management (DM) and GVM management. In comparison\nwith their counterparts in optical fibers, DM solitons in the chi^(2) medium\nfeature very weak intrinsic oscillations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.4511%2C0807.1418%2C0807.1809%2C0807.4829%2C0807.3703%2C0807.3830%2C0807.2670%2C0807.0956%2C0807.4313%2C0807.2359%2C0807.1896%2C0807.2023%2C0807.0857%2C0807.3228%2C0807.3650%2C0807.0779%2C0807.4995%2C0807.1863%2C0807.3447%2C0807.4074%2C0807.4184%2C0807.2119%2C0807.3561%2C0807.4880%2C0807.1744%2C0807.3454%2C0807.1227%2C0807.2379%2C0807.3305%2C0807.0464%2C0807.1214%2C0807.2710%2C0807.2521%2C0807.3937%2C0807.0238%2C0807.0820%2C0807.2163%2C0807.1782%2C0807.1002%2C0807.3960%2C0807.0556%2C0807.1861%2C0807.2948%2C0807.3635%2C0807.0232%2C0807.4488%2C0807.0733%2C0807.0911%2C0807.3266%2C0807.3959%2C0807.4892%2C0807.4913%2C0807.1266%2C0807.1378%2C0807.0201%2C0807.0457%2C0807.1819%2C0807.2160%2C0807.4629%2C0807.3947%2C0807.1622%2C0807.2291%2C0807.0845%2C0807.1181%2C0807.2541%2C0807.3530%2C0807.0287%2C0807.0178%2C0807.3897%2C0807.3985%2C0807.4306%2C0807.4224%2C0807.1995%2C0807.4721%2C0807.1826%2C0807.1074%2C0807.4975%2C0807.3095%2C0807.3855%2C0807.2434%2C0807.0401%2C0807.0207%2C0807.2097%2C0807.2566%2C0807.3699%2C0807.4869%2C0807.3848%2C0807.4534%2C0807.4498%2C0807.2117%2C0807.0521%2C0807.1976%2C0807.2452%2C0807.3882%2C0807.1237%2C0807.1561%2C0807.3272%2C0807.5010%2C0807.2760%2C0807.4259%2C0807.1563&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The problem of the stability of solitons in second-harmonic-generating media\nwith normal group-velocity dispersion (GVD) in the second-harmonic (SH) field,\nwhich is generic to available chi^(2) materials, is revisited. Using an\niterative numerical scheme to construct stationary soliton solutions, and\ndirect simulations to test their stability, we identify a full\nsoliton-stability range in the space of the system's parameters, including the\ncoefficient of the group-velocity-mismatch (GVM). The soliton stability is\nlimited by an abrupt onset of growth of tails in the SH component, the relevant\nstability region being defined as that in which the energy loss to the tail\ngeneration is negligible under experimentally relevant conditions. We\ndemonstrate that the stability domain can be readily expanded with the help of\ntwo \"management\" techniques (spatially periodic compensation of destabilizing\neffects) - the dispersion management (DM) and GVM management. In comparison\nwith their counterparts in optical fibers, DM solitons in the chi^(2) medium\nfeature very weak intrinsic oscillations."}, "authors": ["Peter Y. P. Chen", "Boris A. Malomed"], "author_detail": {"name": "Boris A. Malomed"}, "author": "Boris A. Malomed", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.optcom.2008.07.029", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0807.1378v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.1378v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Optics Communications, in press", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.PS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.1378v1", "affiliation": "Department of Physical Electronics, School of Electrical Engineering, Faculty of Engineering, Tel Aviv University, Tel Aviv, Israel", "arxiv_url": "http://arxiv.org/abs/0807.1378v1", "journal_reference": null, "doi": "10.1016/j.optcom.2008.07.029", "fulltext": "Stability of temporal solitons in uniform and \"managed\" quadratic nonlinear media\nwith opposite group-velocity dispersions at fundamental and second harmonics\nPeter Y. P. Chen1 and Boris A. Malomed2\n1\n\nSchool of Mechanical and Manufacturing Engineering,\nUniversity of New South Wales, Sydney 2052, Australia\n2\n\nDepartment of Physical Electronics, School of Electrical Engineering,\nFaculty of Engineering, Tel Aviv University\nTel Aviv 69979, Israel\n\nAbstract\nThe problem of the stability of solitons in second-harmonic-generating media with normal group-velocity\ndispersion (GVD) in the second-harmonic (SH) field, which is generic to available χ(2) materials, is\nrevisited. Using an iterative numerical scheme to construct stationary soliton solutions, and direct\nsimulations to test their stability, we identify a full soliton-stability range in the space of the system's\nparameters, including the coefficient of the group-velocity-mismatch (GVM). The soliton stability is\nlimited by an abrupt onset of growth of tails in the SH component, the relevant stability region being\ndefined as that in which the energy loss to the tail generation is negligible under experimentally relevant\nconditions. We demonstrate that the stability domain can be readily expanded with the help of two\n\"management\" techniques (spatially periodic compensation of destabilizing effects) ― the dispersion\nmanagement (DM) and GVM management. In comparison with their counterparts in optical fibers, DM\nsolitons in the χ(2) medium feature very weak intrinsic oscillations.\n\nI.\n\nIntroduction\n\nStudies of optical solitons in second-harmonic-generating media (those featuring the χ(2) nonlinearly) are a\nvast research area. Many experimental and theoretical aspects of the soliton dynamics solitons in this\nsetting have been understood well enough, as reviewed in Refs. [1]. Most experiments with χ(2) solitons\nwere performed in the spatial domain, where they represent planar or cylindrical beams composed of\nmutually locked fundamental-frequency (FF) and second-harmonic (SH) waves [2]. Experiments with χ(2)\nsolitons in the temporal domain are more difficult, due to the requirements of having anomalous groupvelocity dispersion (GVD) at both harmonics, and securing the group-velocity synchronism between them.\nEssential is not only the sign of the GVD, but also its size – it must be strong enough for the respective\ndispersion length to be less than ~ 1 cm, as the size of experimental samples is limited to a few centimeters.\nStrong GVD also provides a possibility to compensate the group-velocity mismatch (GVM) between the FF\nand the SH components, and control the soliton's walk [3]. In available χ(2) optical materials, sufficiently\nlarge anomalous GVD at the FF is accessible, without significant linear absorption, if the FF is chosen in\nthe infrared. However, the corresponding SH usually falls into a wavelength interval where the GVD\nranges from nearly zero to large normal values.\nAn experimental technique that allows one to emulate the missing strong anomalous GVD uses tilted wave\nfronts. This method has made it possible to create temporal χ(2) solitons [4], as well as spatiotemporal ones,\nwhich are self-trapped in the temporal and one transverse directions [5], while the other transverse direction\nwas sacrificed to create the tilted fronts. Prior to the experiment, spatiotemporal solitons in χ(2) media were\npredicted in Refs. [6] (see also review [7]). In addition to their fundamental significance, temporal and\nspatiotemporal solitons are of interest to potential applications, as they may provide switching rates in the\nTHz range, and other features promising to the implementation of all-optical data-processing schemes [8].\nIt is also worthy to note that the use of χ(2) effects, in a combination with the Kerr nonlinearity, makes it\n\n\fpossible to experimentally demonstrate a novel type of the evolution of temporally localized optical pulses,\nnamely, self-steepening without self-phase modulation [9].\nAlthough soliton solutions do not exist in the system of coupled-mode equations for the second-harmonic\ngeneration in the dispersive medium with normal GVD at the SH, it was demonstrated, by means of the\nvariational approximation and in a numerical form, that stable solitons, both spatiotemporal [10] and\ntemporal [11] ones, with tiny (virtually invisible) delocalized \"tails\" do exist in this case, in a limited range\nof parameters. In physical terms, such \"quasi-solitons\" do not differ from their counterparts described by\nrigorously localized solutions.\nIt is relevant to mention that the system of coupled-mode equations for the second-harmonic generation in\nthe temporal domain demonstrates the widest variety of (quasi-) solitary-wave solutions in the case of\nanomalous GVD at the FF and normal GVD at the SH [12] (although many of those solutions may be\nunstable). As said above, a crucially important issue for the physical implementation, as well as for\npotential applications, is to identify a parameter region where \"tails\", inevitably attached to the soliton's\n\"body\" in this case, may be effectively suppressed (we here consider only single-peak solitons, i.e.,\nfundamental ones). In other words, in this region the generation of the tails will not cause instability of\ntemporal solitons. These issues are the subject of the present work.\nThe paper is organized as follows. In Section II, we introduce the model and outline numerical methods\nused to construct numerically exact steady-state solutions, whose stability will then be tested. In Section III,\nwe focus on the analysis of the tail formation and soliton stability in the system with zero GVM. Results of\nthe stability investigation are summarized in the form of a relevant chart in the system's parameter space.\nOutside the stability domain, solitons lose energy to the generation of tails, which eventually leads to\ndestruction of the solitons.\nWell-known results from fiber and bulk optics with the cubic nonlinearity [13] suggest that the technique of\nthe dispersion management (DM) may help to increase the range of the normal GVD at the SH that admits\nstable transmission of the temporal solitons, without the generation of conspicuous tails. In this\nconnection, it is relevant to mention that the application of the \"management\" (periodic alternation) to the\nlocal wave-vector mismatch of second-harmonic generating systems exerts a stabilizing effect on spatial\nχ(2) solitons, as shown in recent work [14]. In Section IV, we demonstrate that the stability limits for\ntemporal solitons may indeed be substantially extended by means of the DM. Effects of the DM on the\npulse shape and its transmission characteristics are illustrated by means of generic examples. The\nsuppression of the tail generation by means of the DM is also illustrated (in Section IV) by means of a\ncrude analytical approximation.\nIn Section V, we include the GVM into the present model. After confirming results presented in Ref. [11],\naccording to which only a small size of the constant GVM coefficient admits steady transmission of the\nsolitons, we present a new model, based on GVM management, which is suggested by the DM scheme, as\nwell as by the tandem scheme [15 - 17]. It is demonstrated that large GVM may be tolerated if this\ntechnique is used. The paper is concluded by Section VI, where we also briefly discuss conditions for the\nexperimental realization of the proposed settings.\nII.\n\nThe model and numerical methods\n\nThe system of coupled-mode equations governing the co-transmission of the FF and SH waves in the\ndispersive χ(2) medium is well known. In the normalized form, it can be written as [1,3-5,11]:\n1\n(1)\niu z + D1uττ + vu* = 0.\n2\n1\n1\n2i (vz + cvτ ) + D2 vττ − qv + u 2 = 0.\n(2)\n2\n2\n\n\fHere, − D1 and − D2 are the GVD coefficients at the FF and the SH, respectively (i.e., positive\ncoefficients\n\n− D1,2 correspond to the anomalous dispersion), c is the GVM parameter, q represents the\n\nwave-vector mismatch between the FF and SH waves, and the asterisk stands for the complex conjugation.\nEquations (1) and (2) conserve the momentum, Hamiltonian, and the Manley-Rowe invariant, which is\nfrequently called energy, in terms of the temporal-domain optics,\n+∝\n\nE ≡ Eu + Ev =\n\n∫ [| u(τ ) |\n\n2\n\n+4 | v(τ ) |2 ]dτ .\n\n(3)\n\n−∝\n\nIn our numerical simulations, the integration in this expression will be limited to the actual computational\nwindow. It can be checked that the effect of this limitation on accuracy of the results is completely\nnegligible.\nFor c = 0, q < 0, and the GVD coefficients satisfying conditions\n\n0 < D2 < 4 D1 , Eqs. (1), (2) have a well-\n\nknown exact solution for temporal solitons [18],\nAeikz\nBe 2ikz\n,\n=\n,\nu=\nv\ncosh 2 (aτ )\ncosh 2 (aτ )\nk=\n\nD1q\nq\n, a2 =\n,\n2( D2 − 4 D1 )\nD2 − 4 D1\n\n(4)\nA2 =\n\n9 D1 D2 q 2\n\n, B=\n\n3D1q\n.\n2( D2 − 4 D1 )\n\n(5)\n2( D2 − 4 D1 )\nGeneral soliton solutions, in the form of u(z,τ) = eikzU(τ), v(z,τ) = e2ikzV(τ) with arbitrary positive\npropagation constant k, can be found in a numerical form, or described by means of the variational\napproximation [19].\n2\n\nFor c = 0, the stationary version of Eqs. (1) and (2) takes the form of the boundary-value problem, with the\nfields that should vanish (if this is possible) at |τ| → ∞:\nD d 2U\n− VU * = 0.\nkU − 1\n2 dτ 2\n(6)\nD2 d 2V\n1 2\n4kV −\n+ qV − U = 0.\n2 dτ 2\n2\n\nTo solve this problem, we used a finite-element-spectral method, that reduces Eqs. (6) to a set of nonlinear\nalgebraic equations [20]. The computations were performed in a domain sufficiently large to make the\nresults insensitive to the size of the domain, with zero boundary conditions at the edges. To get a formally\nclosed-form system, Eq. (3) was added to Eqs. (6), treating k as another unknown. Then, the standard\nNewton's iterative procedure could be used to solve the resultant set of algebraic equations.\nIn many previous works, Eqs. (6) were solved with normalization k = 1, see, e.g., Ref. [11]. We here\nchoose another normalization, looking for (quasi-) soliton solutions subject to condition E = 20 [recall E is\nthe total energy defined by Eq. (3)]. Actually, the latter normalization is more physically relevant, as the\nenergy, unlike the wavenumber, is a directly observable physical characteristic.\nBelow, we will also consider the DM version of Eqs. (1), (2), with the dispersion coefficients made\nperiodic functions of z. For this case, we have found quasi-stationary (regularly oscillating) solitary-wave\nsolutions, by means of a properly adjusted iterative method that was previously elaborated for the search of\nstable solitons in the DM model with the cubic nonlinearity [21] (if a stable DM soliton does not exist, the\niterative algorithm does not converge). Further, if the GVM term is present in Eq. (2), i.e., c ≠ 0 , we were\nable to use a variant of the iterative method, modified similar to how it was done in Ref. [22] for the\nanalysis of effects of the polarization-mode dispersion on DM solitons.\n\n\fIn addition to the DM scheme, we will analyze a model of the \"GVM management\", which is built as a\nperiodic chain of cells with opposite signs of the GVM, making the average value of the GVM coefficient\nequal to zero. As said above, a χ(2) model utilizing the mismatch management [14] was studied recently,\nbut, to the best of our knowledge, a similar scheme was not considered to effectively cancel the GVM,\nalthough the earlier proposed \"tandem scheme\" [15,16], based on the periodic alternation of χ(2) and linear\nsegments, pursued a somewhat similar idea. Similar to the case of the DM, the tandem setting was\npredicted to stabilize guiding-center (strongly pulsating) solitons [15]. The efficiency of the tandem scheme\nwas demonstrated experimentally [23], and its generalization was also elaborated for the compensation of\nthe GVM affecting spatiotemporal (multidimensional) solitons [17]\nAfter stationary (or quasi-stationary, in the DM model) soliton solutions were found, we have tested their\nstability in long simulations of Eqs. (1), (2), using the split-step algorithm. The typical transmission\ndistance in the simulations was z = 80, which is quite sufficient to distinguish between stable and unstable\nsolitons, see Fig. 7 below (in all cases, this distance exceeds 10 soliton's dispersion lengths, and it has been\nchecked, in typical cases, that the character of the soliton's stability does not alter in much longer\nsimulation runs). As concerns DM solitons, the convergence of the iterative method for them is not\nsufficient to conclude if they are stable, as this method actually involves a short propagation distance,\ntherefore the stability of the DM solitons was also tested in long simulations.\nIn fact, the main issue concerning the soliton's stability is not a possibility of the destruction of the soliton's\n\"body\" by small perturbations (it was easy to verify that all the solitons are stable in that respect), but, as\nsaid above, the effective destabilization through the energy loss to the generation of tails in the SH field, in\nthe case of D2 < 0. An adopted technical stability criterion was that, at the end of the simulation, the body\nof the pulse must not lose more than 5% of the initial energy in the SH field. The corresponding soliton will\nseem completely stable in any possible experimental setting.\nFor the advance of the simulations along z, the computations were carried out, in most cases, with a small\nstep of Δz = 0.001, which secured high accuracy of the split-step simulations. If the growth of the tails was\nconspicuous, Δz was further reduced to ensure that the growth rate did not depend on Δz.\nIII. Soliton stability in the absence of the group-velocity mismatch\n\nAs said above, we have identified stability borders of a family of stationary (quasi-) soliton solutions to\nEqs. (6), in the plane of parameters D2 < 0 and q, by means of systematic direct simulations of Eqs. (1) and\n(2). We present a summary of these results in the form of the stability diagram in Fig. 1, fixing the\nnormalization to D1 ≡ 2 (recall that the GVD at the FF is always anomalous, in situations relevant to the\nstudy of χ(2) solitons) and, as mentioned above, E = 20. The rightmost stability border, corresponding to the\nmodel with constant GVD coefficients, complies with results reported in Ref. [11], while the borders for\nthe DM model (which are discussed in detail below) represent essentially new\n\n\fresult\n\n6\n\nE = 20\n5\n4\n\nq\n\n3\n2\n\nDM numerical\nfor E = 20\nDM predicted\nfor E = 20\n\n1\n0\n-1\n-2\n\n-6\n\n-5\n\n-4\n\n-3\n\n-2\n\n-1\n\n0\n\nD2\nFigure 1. Stability borders for temporal solitons in the system without GVM (c = 0), and\nnormalization D1 ≡ 2 . Solitons are stable to the right of the curves corresponding to fixed energy E = 20.\nThe rightmost border corresponds to the system with constant GVD coefficients, while two other borders\nare obtained in the model with the dispersion management (see Section IV).\n\nA noteworthy feature of the diagram is that the stability border can be pushed farther into the region of the\nnormal second-harmonic GVD by increasing mismatch parameter q. This finding is not surprising, as, for\nlarge |q|, Eq. (2) yields v ≈ u 2 / ( 2q ) in the well-known cascading approximation. The substitution of this\nrelation in Eq. (1) leads to the usual cubic nonlinear Schrödinger (NLS) equation for the FF field,\n\niu z + uττ + ( 2q ) | u |2 u = 0 (recall that D1 ≡ 2 ). Obviously, this equation gives rise to solitons for q > 0,\n−1\n\nand it does not admit bright solitons for q < 0, in agreement with Fig. 1.\nFigures 2 and 3, where we fix q = 2, demonstrate how the growth of the tails and the onset of the effective\ninstability of the solitons in the SH component are associated with the increase of the normal GVD\n\n\fcoefficient, − D2 . Well inside the stability region (but at D2 < 0 ), the solutions feature practically no tails,\nwhile the tail's amplitude drastically increases across the instability boundary. In Fig. 3, the same set of\npulses is shown after they have passed the distance of z = 40. Comparison with Fig. 2 demonstrates that,\ninside the stability region, viz., for D2 = 0 and D2 = −0.3 , the propagation gives rise to practically no\nchange in the shape of the solitons, including the absence of tails. For D2 = −0.7 , which is identified as\nthe stability limit, the tails have started to grow, absorbing the energy from the central portion of the pulse.\nThe energy loss is, however, smaller than the limit of 5% set above. Beyond the stability border, the loss of\nthe energy exceeds the limit.\n\n1\n\n0.8\nD2 = 0\n= - 0.3\n= - 0.7 (stability limit)\n\n0.6\n\n|v|\n\n= -1.0\n\n0.4\n\n0.2\n\n0\n0\n\n5\n\n10\n\nτ\n\n15\n\n20\n\nFigure 2. The shape of the second-harmonic component of stationary (quasi-) soliton solutions for\nD2 = 2, E = 20, and q = 2 . The development of tails with the increase of |D2| is obvious.\n\n\f1\n\n0.8\nD2 = 0\n= - 0.3\n= - 0.7 (stability limit)\n= - 1.0\n\n|v|\n\n0.6\n\n0.4\n\n0.2\n\n0\n0\n\n5\n\n10\n\nτ\n\n15\n\n20\n\nFigure 3. The shapes of the second-harmonic components in the set of solitary waves from Fig. 2 after\npassing distance z = 40.\n\nIn addition to Figs. 1 and 3, the growth of the share of the total energy in the tails with the increase of − D2\nis shown, for fixed mismatch q, in Fig. 4. This figure demonstrates the steep decrease of the energy loss as\nthe system shifts into the stability region. Together with Fig. 4, it is relevant to display the share of the total\n\n\f6\n\n5\n\nE tail/E v (%)\n\n4\n\nq=2\n\nq=4\n\n3\n\n2\n\n1\n\n0\n\n-1.5\n\n-1\n\n-0.5\n\n0\n\nD2\nFigure 4. The share of the total energy in the tails of the solitary waves which have passed the distance of\nz = 40, for different fixed values of mismatch q. The highest point of each plot corresponds to the stability\nlimit, as defined above.\n\n\fenergy of the soliton in its SH component. Figure 5 displays this share calculated along the stability border,\nwhich was identified in Fig. 1 (in accordance with the definition of the stability border, the part of the SH\nenergy transferred to its tails is still negligible, at these points). In accordance with the above-mentioned\ncascading approximation, the SH energy share sharply drops with the increase of mismatch. Additionally,\nFig. 6 shows the same energy share as a function of D2 , for fixed mismatch, q = 4. All points belonging to\nthe latter plot are taken at the border of or inside the stability region.\n\n70\n\n60\n\nE v/E (%)\n\n50\n\n40\n\n30\n\n20\n\n10\n-2\n\n0\n\n2\n\n4\n\n6\n\nq\nFigure 5. The share of the total soliton's energy, E = 20, in the second-harmonic component, along the\nborder of the stability region, which was identified in Fig. 1.\n\n\f13\n\nE v/E (%)\n\n12.5\n\n12\n\n11.5\n\n11\n-1.8\n\n-1.6\n\n-1.4\n\n-1.2\n\n-1\n\nD2\nFigure 6. The same energy share as in Fig. 5 versus the second-harmonic GVD coefficient (in the region\nof the normal dispersion), for a fixed (typical) value of the mismatch, q = 4.\n\nIn the experiment, the soliton cannot be prepared with the exact shape prescribed by the solution to Eqs.\n(6). Therefore, it is relevant to additionally test the robustness of stable solitons by launching them at\n\"wrong\" values of parameters. A typical example of such a test is displayed in Fig. 7, where we take the\nsoliton obtained as a solution to Eqs. (6) at E = 20, q = 2, D1 = 2, and D1 = −0.7 (this point falls onto the\nstability border in Fig. 1), and simulate its propagation at these values of the system's parameters [in Fig.\n7(b)], as well as at \"wrong\" values, namely, for q = 2.5 (inside the stability region) and q = 1 (beyond the\nstability border), as shown in Figs. 7(a) and 7(c), respectively. It is seen that, in the former case, the pulse\nfeatures persistent intrinsic oscillations, due to the fact that it is not adjusted to the respective parameter\nvalues, but without development of any instability. On the other hand, in the latter case the pulse quickly\ndecays through intensive generation of tails.\n\n\f0.6\n0.5\n\n|v|2\n\n0.4\n0.3\n0.2\n0.1\n0\n80\n40\n\n60\n20\n\n40\n\nz\n\n0\n20\n\n−20\n0\n\n−40\n\n(a)\n\nτ\n\n\f0.7\n0.6\n0.5\n\n|v|2\n\n0.4\n0.3\n0.2\n0.1\n0\n80\n40\n\n60\n20\n\n40\n\nz\n\n0\n20\n\n−20\n0\n\n−40\n\n(b)\n\nτ\n\n\f0.8\n0.7\n0.6\n\n|v|2\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n80\n40\n\n60\n20\n\n40\n\nz\n\n0\n20\n\n−20\n0\n\nτ\n\n−40\n\n(c)\nFigure 7. (Color online) The propagation of the pulse prepared for parameter values\nE = 20, q = 2, D1 = 2, and D1 = −0.7 (this point belongs to the stability border in Fig. 1) and launched into\nthe system as follows: (a) with a \"wrong\" value of the mismatch, q = 2.5, which falls into the stability\nregion in Fig. 1; (b) with the \"correct\" mismatch, q = 2; (c) with a \"wrong\" mismatch, q = 1, that belongs to\nthe instability region.\nIV. Dispersion management\nA. Numerical results\n\nThe DM scheme, results for which are included in the stability diagram displayed in Fig. 1, is defined in\ni 2 > 0 in segments of\nterms of the respective map: the SH GVD coefficient takes values D2 < 0 and D\nlengths l and l\u0004 , respectively. This arrangement is repeated periodically, with period l + l\u0004 , the\ncorresponding path-average dispersion (PAD) coefficient being\ni2\nlD + l\u0004 D\nD2 = 2\nl + l\u0004\n\n(7)\n\n(the map does not include a difference in the values of the FF GVD coefficient, D1 , between the two\nsegments, but it can be readily included, if necessary for an accurate description of the experiment). For\nactual iterations of the soliton transmission in the DM system, the DM cell was defined as a \"sandwich\"\ncomposed of three segments, with lengths l / 2 = 1 / 4, l\u0004 = 1 / 2, l / 2 = 1 / 4 , the DM period being l + l\u0004 = 1 . In\ni 2 = 2 , while in the outer sections the GVD\nthe middle section, the GVD coefficient was set to be D\ncoefficient is negative (and subject to the variation), corresponding to the normal dispersion.\n\n\fFirst, we have used the iterative method, as elaborated in Ref. [18], to generate numerically exact solutions\nfor DM solitons in the χ(2) model. Then, simulating the transmission of these solitons, we could test their\nstability. The dashed curve in Fig. 1 shows the so identified stability border. The dotted curve, which runs\nquite close to the dashed one, represents the stability border which could be predicted, in a simple way, by\nequating the PAD value given by Eq. (7) to that which was found numerically as the stability border in the\nsystem with constant coefficients (the solid curve in Fig. 1).\nComparing the results with those obtained in the system with constant GVD, we conclude that the DM\nmakes it possible to considerably extend the stability region. Within the extended region, the tail formation\nand growth follow exactly the same pattern as in the system without the DM. In particular, the increase of\nthe energy share in the tail, as a function of D2, for the DM systems is shown in Fig. 8. The comparison\nwith Fig. 4 demonstrates that the dependence retains the same character as in the system with constant\nGVD, except for the shift to much larger values of − D2 .\n\n5\n\nE tait/E v (%)\n\n4\n\n3\nq=2\nq=4\n\n2\n\n1\n\n0\n\n-6\n\n-5\n\n-4\n\n-3\n\n-2\n\n-1\n\nD2\nFigure 8. The same as in Fig. 4, but in the system additionally stabilized by the dispersion management.\n\nIt is worthwhile to notice that, because of the FF-SH mode coupling, the DM solitons exhibit very little\n\"breathing\" (periodic shape oscillations) in comparison with the dispersion-managed solitons in the fiberoptic model with the χ(3) nonlinearity. A typical example demonstrating this feature is displayed in Fig. 9.\nThe DM also produces a little effect on shapes of both the FF and SH components of the solitons, and on\nthe energy distribution between them.\n\n\f0.25\n\n0.2\n\n|v|\n\n2\n\n0.15\n\n0.1\n\n0.05\n\n0\n2\n40\n\n1.5\n20\n\n1\n\nz\n\n0\n0.5\n\n−20\n0\n\nτ\n\n−40\n\nFigure 9. (Color online). The evolution of the second-harmonic component in the soliton within two\nadjacent cells of the dispersion-managed system with q = 4 and D2 = −4 .\nB. An analytical approach\n\nThe suppression of the tail generation by the DM can be illustrated by means of a crude approximation,\nin which the source of the SH radiation, i.e., term −(1/ 2)U in the second equation in system (6), is\napproximated by the delta function, assuming that we aim to analyze the SH tail on a temporal scale much\nlarger than the intrinsic width of the soliton:\n2\n\n1\n2ivz + D2 ( z )vττ = εδ (τ ),\n2\n\n(8)\n\nwhere ε is the strength of the effective source, and full matching between the source and the generated\nfield is assumed. The latter condition corresponds to the \"most dangerous\" regime of the strongest tail\ngeneration.\nA simple consequence of Eq. (8) is an exact evolution equation for the energy of the SH field\ncomponent, which is defined as per Eq. (3):\n\ndEv\n= −4ε Im ( v (τ = 0 ) ) .\ndz\n\n(9)\n\n\fEquation (9) can be used to calculate the rate at which the energy is pumped into the soliton's tail in the SH\nfield.\nOff the point τ = 0, linear equation (8) has a well-known solution in the form of the chirped Gaussian\n[13]:\n\n⎧\n⎫\nτ2\n⎪ 1\n⎪\nv(τ , z ) =\nexp ⎨− 2\n⎬,\n2\n1 + ( iΔ( z ) / 2τ 0 2 )\n⎪⎩ 2τ 0 1 + ( iΔ( z ) / 2τ 0 ) ⎪⎭\nA0\n\nwhere Δ ( z ) ≡\n\n∫\n\nz\n\n0\n\n(10)\n\nD2 ( z )dz is the accumulated dispersion, while τ 0 and A0 are arbitrary temporal scale\n\nand amplitude. The energy of the Gaussian field is\n\nEv = 4 π | A0 |2 τ 0 ,\n\n(11)\n\nsee Eq. (3). In the case of the standard piece-wise DM map which is defined above,\n\nτ0\n\ndetermines the DM\n\nstrength [13],\n\nS = 1.443\n\nD\u0004 2l\u00042 + | D2 | l2\n\n(12)\n\nτ 02\n\n(the numerical factor in this definition accounts for the difference between\n\nτ 0 and\n\nFWHM width of the\n\nGaussian pulse).\nThe substitution of expression (10) into Eq. (9) yields the following final expression for the rate of\npumping the energy into the tail:\n\ndEv\n=ε\ndz\n\n2 Ev\n\n1 + Δ 2 ( z ) / ( 4τ 0 2 ) + 1 − sgn ( Δ( z ) )\n\n1 + Δ 2 ( z ) / ( 4τ 0 2 ) − 1\n\n1 + Δ 2 ( z ) / ( 4τ 0 2 )\n\nπτ 0\n\n,\n\n(13)\n\nwhere relation (11) was used to express | A0 | in terms of Ev . This result is still cumbersome in the\ngeneral case. However, in the limit case of the strong DM, i.e., S \u0015 1 [13], and assuming zero PAD,\nD2 = 0 , i.e., full GVD compensation, see Eq. (7) (these are conditions which allow one to explore the\neffects of the DM in the pure form), the averaging of expression (13) over the DM map yields an\nasymptotic result,\n1/ 4\n\n⎛ 1.443 ⎞\ndEv\n= 4ε Ev ⎜\n⎟\ndz\n⎝ π | D2 | l2 ⎠\n\nS −1/ 4 .\n\nThe purport of the latter result is that, within the framework of the crude analytical model, the rate at which\nthe energy flows from the soliton's body into the SH tail decays\n\nV.\n\n~ S −1/ 4 in the regime of the strong DM.\n\nThe systems with the group-velocity mismatch (GVM)\n\nThe GVM term in Eqs. (2), which is proportional to coefficient c, breaks the symmetry of the soliton's\nshape with respect to change τ → −τ , as shown in Fig. 10 (cf. Fig. 2 for c = 0). Which is most essential,\n\n\fthe GVM imposes severe limitations of the size of the stability region, or, in other words, the simulations of\nthe soliton propagation make it possible to identify the maximum value of c beyond which the solitons\nloose their stability. These results are summarized in Fig. 11, which displays the largest value of the GVM\ncoefficient up to which the soliton remains stable, as a function of the mismatch parameter, q, for two\ncases: along the stability border in Fig. 1, and at a set of arbitrarily chosen points inside the stability region.\n\n0.3\n\n0.25\n\n|v|2\n\n0.2\n\nat z = 0\n\nat z = 40\n\n0.15\n\n0.1\n\n0.05\n\n0\n−30\n\n−25\n\n−20\n\n−15\n\n−10\n\nτ\n\n−5\n\n0\n\n5\n\n10\n\nFigure 10. Profiles of asymmetric solitons obtained by means of the iterative method from the stationary\nversion of Eqs. (1) and (2) with c = 1 .\n\n\f2.2\n\n(-0.4 0)\n\n2\n\n1.8\n\nInside stability border\n\nc\n\n(-0.8 0)\n(-3 -1)\n\n(-1.8 -1)\n\n1.6\nAt stability border\n\n1.4\n\n1.2\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nq\nFigure 11. The largest value of the group-velocity-mismatch parameter, c, beyond which the soliton loses\nits stability. Pairs of numbers in the brackets are values of D2 for pairs of points appertaining to common\nvalues of the wave-vector mismatch coefficient ( q = 0, 2, 4, 6 ) and taken, respectively, at the stability\nborder and inside the stability region.\nTo overcome the restriction imposed on the size of c, it is possible to develop a \"management\" scheme\nsimilar to the DM, viz., to consider a system built as a periodic alternation of segments with opposite values\nof c, so as to make the respective average value equal to zero. We have explored this possibility, carrying\nout systematic simulations of the propagation of solitons in the GVM-managed model. The system was\nbuilt as the periodic combination of segments of lengths l+ = l− = 1 that feature opposite values of the GVM\ncoefficient, hence its path-average value is zero, cf. Eq. (7). Again, the iterative method was used to\ngenerate appropriate pulses, whose transmission was then explored.\nAs expected, the GVM-management scheme readily provides for the stabilization of solitons. A generic\nexample is shown, for E = 20, D1 = 2, D2 = −0.6 and q = 3 , in Fig. 12. The soliton propagation is seen to\nbe completely stable, without any tangible generation of tails, even for very large local values of the GVM\nparameter, c+ = −c− = 14 (cf. Fig. 11, where, in the system with constant c, stable propagation is limited to\n| c | ≤ 2 ). A noticeable change in the shape of the SH component of the soliton, caused by the GVM\nmanagement, is an increase of its width, as seen in Fig. 13.\n\n\f0.06\n0.05\n\n|v|\n\n2\n\n0.04\n0.03\n0.02\n0.01\n0\n40\n30\n20\n\nz\n\n10\n0\n\n−80\n\n−60\n\n(a)\n\n−40\n\n−20\n\n0\n\n20\n\nτ\n\n40\n\n60\n\n80\n\n\f0.06\n0.05\n\n|v|\n\n2\n\n0.04\n0.03\n0.02\n0.01\n0\n4\n3\n2\n\nz\n\n1\n0\n\n−80\n\n−60\n\n−40\n\n−20\n\n0\n\n20\n\n40\n\n60\n\n80\n\nτ\n\n(b)\nFigure 12. (Color online). (a) The long-distance propagation of a typical soliton in the system with the\nstrong GVM management, corresponding to |c| = 14 (only the SH component is shown). (b) A detailed\npicture of the evolution of the pulse within two adjacent cells of the GVM-management scheme.\n\n\f0.7\n\n0.6\n\n0.5\n\nc=0\n\n|v|2\n\n0.4\n\n0.3\n\nc=4\n\n0.2\n\nc=8\n0.1\n\nc = 12\nc = 14\n\n0\n−40\n\n−30\n\n−20\n\n−10\n\n0\n\nτ\n\n10\n\n20\n\n30\n\n40\n\nFigure 13. The broadening of the second-harmonic component of stable pulses in the system with the\ngroup-velocity-mismatch management, with the increase of the absolute value of the CVM parameter, c .\nThe pulse shapes are displayed at the transmission stage when they are narrowest.\nVI. Conclusions\nWe have revisited the problem of the existence of temporal solitons in χ(2) media in the case when the GVD\n(group-velocity dispersion) at the SH (second harmonic) is normal, which is the situation occurring in\noptical materials available to the experiment, and is a major issue impeding experimental studies of such\nsolitons. A full range of essential parameters of the system was covered by the analysis, including the GVM\n(group-velocity mismatch) coefficient. The stability region for the solitons is limited by the onset of the fast\ngrowth of tails in the SH component (strictly speaking, some tail is always present in the solution if the\nGVD is normal at the SH, but the stability region can be defined so as to make the energy loss to the tail\ngeneration completely negligible under conditions relevant to any feasible experiment).\nWe have demonstrated that the stability region can be vastly expanded by means of two \"management\"\ntechniques, viz., the DM (dispersion management), and GVM management. In the former case, the normal\nGVD at the SH is periodically compensated by layers of a material with anomalous dispersion. In the latter\ncase, the solitons are readily stabilized by periodic mutual compensation of positive and negative GVM. A\npeculiarity of the DM scheme elaborated here for the χ(2) media, in comparison with the well-known\ncounterpart of this technique in χ(3) media, is that the DM-stabilized χ(2) solitons feature very weak intrinsic\noscillations. In addition to the systematic numerical results, a crude analytical approximation for the DM\nwas developed too, aimed at understanding the suppression of the tail formation under the action of this\ntechnique.\n\n\fExperimental conditions which should allow the realization of the proposed management schemes may be\nsimilar to those under which the walkoff-compensating tandem scheme has been realized [23]. That work\nused a set of ten alternating plates cut (at different orientations) from a KTP crystal, with the thickness of\neach plate 1 mm. Following the same work, it is expected that picosecond beams with the transverse waist\n~20 μm can be used to create the solitons.\n\nAcknowledgement\nWe appreciate valuable discussions with F. Wise.\n\nReferences\n[1] G. I. Stegeman, D. J. Hagan, L. Torner, Opt. Quant. Electr. 28, 1691 (1996);\nC. Etrich, F. Lederer, B. A. Malomed, T. Peschel and U. Peschel, in: Progr. Optics 41, 483 (ed. by E. Wolf, North-Holland:\nAmsterdam, 2000); A. V. Buryak, P. Di Trapani, D. V. Skryabin, S. Trillo, Phys. Rep. 370, 63 (2002).\n\n[2] W. E. Torruellas, Z. Wang, D. J. Hagan,, E. W. VanStryland, G. I. Stegeman, L. Torner, C. R.\nMenyuk, Phys. Rev. Lett. 74, 5036 (1995); R. Schiek, Y. Baek, G. I. Stegeman, Phys. Rev. 53, 1138\n(1996).\n[3] L. Torner, D. Mazilu, D. Mihalache, Phys. Rev. Lett. 77, 2455 (1996); C. Etrich, U. Peschel, F. Lederer,\nB. A. Malomed, Phys. Rev. E 55, 6155 (1997).\n[4] P. Di Trapani, D. Caironi, G. Valiulis, A. Dubietis, R. Danielius, A. Piskarskas, Phys. Rev. Lett. 81, 570\n(1998).\n[5] X. Liu, L. J. Qian, F. W. Wise, Phys. Rev. Lett. 82, 4631 (1999); X. Liu, K. Beckwitt, F. Wise, Phys.\nRev. E 62, 1328 (2000).\n[6] K. Hayata and M. Koshiba, Phys. Rev. Lett. 71, 3275 (1993); B. A. Malomed, P. Drummond, H. He,\nA. Berntson, D. Anderson, M. Lisak, Phys. Rev. E 56, 4725 (1997); D. V. Skryabin and W. J. Firth , Opt.\nCommun. 148, 79 (1998); D. Mihalache, D. Mazilu, B. A. Malomed, L. Torner, ibid. 152, 365 (1998); 169,\n341 (1999).\n[7] B. A Malomed, D. Mihalache, F. Wise, L. Torner, J. Opt. B: Quantum Semiclass. Opt. 7, R53 (2005).\n[8] R. McLeod, K. Wagner, S. Blair, Phys. Rev. A 52, 3254 (1995).\n[9] J. Moses, B. A. Malomed, F. W. Wise, Phys. Rev. A 76, 021802 (2007).\n[10] I. N. Towers, B. A. Malomed, F. W. Wise, Phys. Rev. Lett. 90, 123902 (2003)\n[11] K. Beckwitt, Y. F. Chen, F. W. Wise and B. A. Malomed, Phys. Rev. E 68, 057601 (2003).\n[12] H. He, M. J. Werner and P. D. Drummond, Phys. Rev. E 54, 896 (1996).\n[13] B. A. Malomed, Soliton Management in Periodic Systems (Springer: New York, 2006).\n[14] R. Driben, Y. Oz, B. A. Malomed, A. Gubeskys, Phys. Rev. E 75, 026612 (2007).\n[15] L. Torner, Opt. Lett. 23, 1256 (1998)\n[16] L. Torner, IEEE Phot. Tech. Lett. 11, 1268 (1999).\n[17] L. Torner, S. Carrasco, J. P. Torres, L.-C. Crasovan,, D. Mihalache, Opt. Commun. 199, 277 (2001).\n\n\f[18] Y. N. Karamzin and A P Sukhorukov, Pisma Zh. Exp. Teor. Fiz. 20, 730 (1074).\n[19] V. Steblina, Yu. S. Kivshar, M. Lisak, B. A. Malomed, Opt. Commun. 118, 345 (1995).\n[20] P. Y. P. Chen and B. A. Malomed, J. Phys. B. At. Mol. Opt. Phys. 38, 4221 (2006).\n[22] P. Y. P. Chen, B. A. Malomed, P. L. Chu, Opt. Commun. 245, 425 (2005).\n[22] P. Y. P. Chen, B. A. Malomed, P. L. Chu, Opt. Commun. 281, 2301 (2008).\n[23] S. Carrasco, D. V. Petrov, J. P. Torres, L. Torner, H, Kim, G. Stegeman, J.-J. Zondy, Opt. Lett. 29,\n382 (2004).\n\n\f"}