{"id": "http://arxiv.org/abs/1101.4366v1", "guidislink": true, "updated": "2011-01-23T12:40:18Z", "updated_parsed": [2011, 1, 23, 12, 40, 18, 6, 23, 0], "published": "2011-01-23T12:40:18Z", "published_parsed": [2011, 1, 23, 12, 40, 18, 6, 23, 0], "title": "Efficient quantum state tomography", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.2949%2C1101.4688%2C1101.2785%2C1101.1347%2C1101.2725%2C1101.5040%2C1101.5726%2C1101.4806%2C1101.0875%2C1101.2623%2C1101.1846%2C1101.0748%2C1101.1033%2C1101.4938%2C1101.3576%2C1101.5771%2C1101.0238%2C1101.2499%2C1101.1550%2C1101.3268%2C1101.3627%2C1101.1805%2C1101.2428%2C1101.2745%2C1101.3832%2C1101.3785%2C1101.4713%2C1101.2300%2C1101.0041%2C1101.5042%2C1101.1419%2C1101.5124%2C1101.1137%2C1101.4937%2C1101.4696%2C1101.5721%2C1101.3221%2C1101.1356%2C1101.2185%2C1101.2945%2C1101.3949%2C1101.1777%2C1101.4366%2C1101.5418%2C1101.5461%2C1101.3355%2C1101.2080%2C1101.4163%2C1101.5845%2C1101.2237%2C1101.4547%2C1101.1309%2C1101.3840%2C1101.5546%2C1101.4580%2C1101.2371%2C1101.5121%2C1101.0062%2C1101.0414%2C1101.0517%2C1101.3852%2C1101.4179%2C1101.0930%2C1101.2684%2C1101.4551%2C1101.0010%2C1101.1112%2C1101.3384%2C1101.4951%2C1101.4768%2C1101.3030%2C1101.2376%2C1101.3000%2C1101.3319%2C1101.3502%2C1101.5105%2C1101.1725%2C1101.5694%2C1101.2270%2C1101.0664%2C1101.0703%2C1101.2654%2C1101.1395%2C1101.0429%2C1101.4062%2C1101.1302%2C1101.1961%2C1101.3724%2C1101.4993%2C1101.0256%2C1101.4392%2C1101.5404%2C1101.3387%2C1101.2203%2C1101.1178%2C1101.2648%2C1101.6017%2C1101.3955%2C1101.2608%2C1101.2655%2C1101.5912&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Efficient quantum state tomography"}, "summary": "Quantum state tomography, the ability to deduce the state of a quantum system\nfrom measured data, is the gold standard for verification and benchmarking of\nquantum devices. It has been realized in systems with few components, but for\nlarger systems it becomes infeasible because the number of quantum measurements\nand the amount of computation required to process them grows exponentially in\nthe system size. Here we show that we can do exponentially better than direct\nstate tomography for a wide range of quantum states, in particular those that\nare well approximated by a matrix product state ansatz. We present two schemes\nfor tomography in 1-D quantum systems and touch on generalizations. One scheme\nrequires unitary operations on a constant number of subsystems, while the other\nrequires only local measurements together with more elaborate post-processing.\nBoth schemes rely only on a linear number of experimental operations and\nclassical postprocessing that is polynomial in the system size. A further\nstrength of the methods is that the accuracy of the reconstructed states can be\nrigorously certified without any a priori assumptions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.2949%2C1101.4688%2C1101.2785%2C1101.1347%2C1101.2725%2C1101.5040%2C1101.5726%2C1101.4806%2C1101.0875%2C1101.2623%2C1101.1846%2C1101.0748%2C1101.1033%2C1101.4938%2C1101.3576%2C1101.5771%2C1101.0238%2C1101.2499%2C1101.1550%2C1101.3268%2C1101.3627%2C1101.1805%2C1101.2428%2C1101.2745%2C1101.3832%2C1101.3785%2C1101.4713%2C1101.2300%2C1101.0041%2C1101.5042%2C1101.1419%2C1101.5124%2C1101.1137%2C1101.4937%2C1101.4696%2C1101.5721%2C1101.3221%2C1101.1356%2C1101.2185%2C1101.2945%2C1101.3949%2C1101.1777%2C1101.4366%2C1101.5418%2C1101.5461%2C1101.3355%2C1101.2080%2C1101.4163%2C1101.5845%2C1101.2237%2C1101.4547%2C1101.1309%2C1101.3840%2C1101.5546%2C1101.4580%2C1101.2371%2C1101.5121%2C1101.0062%2C1101.0414%2C1101.0517%2C1101.3852%2C1101.4179%2C1101.0930%2C1101.2684%2C1101.4551%2C1101.0010%2C1101.1112%2C1101.3384%2C1101.4951%2C1101.4768%2C1101.3030%2C1101.2376%2C1101.3000%2C1101.3319%2C1101.3502%2C1101.5105%2C1101.1725%2C1101.5694%2C1101.2270%2C1101.0664%2C1101.0703%2C1101.2654%2C1101.1395%2C1101.0429%2C1101.4062%2C1101.1302%2C1101.1961%2C1101.3724%2C1101.4993%2C1101.0256%2C1101.4392%2C1101.5404%2C1101.3387%2C1101.2203%2C1101.1178%2C1101.2648%2C1101.6017%2C1101.3955%2C1101.2608%2C1101.2655%2C1101.5912&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum state tomography, the ability to deduce the state of a quantum system\nfrom measured data, is the gold standard for verification and benchmarking of\nquantum devices. It has been realized in systems with few components, but for\nlarger systems it becomes infeasible because the number of quantum measurements\nand the amount of computation required to process them grows exponentially in\nthe system size. Here we show that we can do exponentially better than direct\nstate tomography for a wide range of quantum states, in particular those that\nare well approximated by a matrix product state ansatz. We present two schemes\nfor tomography in 1-D quantum systems and touch on generalizations. One scheme\nrequires unitary operations on a constant number of subsystems, while the other\nrequires only local measurements together with more elaborate post-processing.\nBoth schemes rely only on a linear number of experimental operations and\nclassical postprocessing that is polynomial in the system size. A further\nstrength of the methods is that the accuracy of the reconstructed states can be\nrigorously certified without any a priori assumptions."}, "authors": ["Marcus Cramer", "Martin B. Plenio", "Steven T. Flammia", "David Gross", "Stephen D. Bartlett", "Rolando Somma", "Olivier Landon-Cardinal", "Yi-Kai Liu", "David Poulin"], "author_detail": {"name": "David Poulin"}, "author": "David Poulin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/ncomms1147", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.4366v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.4366v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 4 figures. Combines many of the results in arXiv:1002.3780,\n  arXiv:1002.3839, and arXiv:1002.4632 into one unified exposition", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.4366v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.4366v1", "journal_reference": "Nat. Commun., 1 (9) 149, Dec 2010", "doi": "10.1038/ncomms1147", "fulltext": "Efficient quantum state tomography\nMarcus Cramer and Martin B. Plenio\nInstitut für Theoretische Physik, Albert-Einstein Allee 11, Universität Ulm, 89069 Ulm, Germany\n\nSteven T. Flammia and Rolando Somma\nPerimeter Institute for Theoretical Physics, Waterloo, Ontario, N2L 2Y5 Canada\n\nDavid Gross\nInstitute for Theoretical Physics, Leibniz University Hannover, 30167 Hannover, Germany\n\nStephen D. Bartlett\n\narXiv:1101.4366v1 [quant-ph] 23 Jan 2011\n\nSchool of Physics, The University of Sydney, Sydney, New South Wales 2006, Australia\n\nOlivier Landon-Cardinal and David Poulin\nDépartement de Physique, Université de Sherbrooke, Sherbrooke, Québec, Canada\n\nYi-Kai Liu\nInstitute for Quantum Information, California Institute of Technology, Pasadena, CA, USA\nQuantum state tomography [1], the ability to deduce the state of a quantum system from measured\ndata, is the gold standard for verification and benchmarking of quantum devices. It has been realized\nin systems with few components [2–7], but for larger systems it becomes infeasible because the\nnumber of quantum measurements and the amount of computation required to process them grows\nexponentially in the system size. Here we show that we can do exponentially better than direct state\ntomography for a wide range of quantum states, in particular those that are well approximated by\na matrix product state ansatz. We present two schemes for tomography in 1-D quantum systems\nand touch on generalizations. One scheme requires unitary operations on a constant number of\nsubsystems, while the other requires only local measurements together with more elaborate postprocessing. Both schemes rely only on a linear number of experimental operations and classical\npostprocessing that is polynomial in the system size. A further strength of the methods is that the\naccuracy of the reconstructed states can be rigorously certified without any a priori assumptions.\n\nI.\n\nINTRODUCTION\n\nOne of the principal features distinguishing classical\nfrom quantum many-body systems is that quantum systems require exponentially many parameters in the system size to fully specify the state, compared to only linearly many for classical systems. Put to use constructively, the exponential complexity enables the construction of information processing devices fundamentally superior to any classical device. At the same time, however, this \"curse of dimensionality\" makes engineering\ntasks-such as verifying that the quantum processing device functions as intended-a daunting challenge.\nThe full determination of the quantum state of a system, known as quantum state tomography [1], has already been achieved by measuring a complete set of observables whose expectation values determine the quantum state [2–7]. As it is typically formulated [8], simply\nto output an estimate for a generic state would take exponential time in the system size N , given that there are\nan exponential number of coefficients in a generic state's\ndescription. This is but one of several inefficiencies. Most\nquantum states have exponentially small amplitudes in\nalmost every basis, so to distinguish any one of those amplitudes from zero, one must take an exponential number\n\nof samples. Assuming one were able to collect all the data\nfrom an informationally complete measurement, one is\nleft with the intractable computational task of inverting\nthe measured frequencies to find an estimate of the state.\nHowever, the traditional representation of quantum\nstates is in a sense too general. Indeed, states which occur in many practical situations are specified by a small\nnumber of parameters. An efficient description could be\na practical preparation scheme which outputs the state;\nor, in the case of thermodynamical equilibrium states, a\nlocal Hamiltonian and a temperature. This insight is not\nnew: researchers in many-body physics and quantum information theory have found many classes of states which\nare described by a number of parameters scaling polynomially in N [9–13] and which closely approximate the\nkind of states found in physical systems [14, 15]. However, the question of whether these restricted classes can\nbe put to use in the context of tomography has remained\nlargely open.\nIn this work, we address the above challenge. The\nphysical system we have in mind is one where the constituents are arranged in a one-dimensional configuration (e.g., ions in a linear trap [3]). But the methods\nthat we are presenting here can be generalized to higherdimensional arrangements such as those realized in optical lattices [16]. It is highly plausible that in such a set-\n\n\f2\nting, correlations between neighboring particles are much\nmore pronounced (due to direct interaction) than correlations between distant systems (mediated e.g. by global\nfluctuations of control fields). An efficiently describable\nclass of states anticipating exactly this behavior has long\nbeen studied under the names of finitely correlated states\n(FCS) or matrix product states (MPS) [9, 10]. Importantly, restricting to this class is not a limitation since\nevery state may be written as a MPS with a suitable, albeit possibly large, matrix dimension. Since many states\nthat are relevant for quantum information processing or\nquantum many-body physics have a small (independent\nof N ) bond dimension, our methods are directly applicable to such states; examples include, but are not limited\nto, ground and thermal states, the GHZ, W, cluster, and\nAKLT states, the latter two being universal resources\nstates for quantum computing.\nGiven that standard tomography is no longer feasible\nin a range of recent and upcoming experiments involving\nlarge numbers of qubits, our results represent a significant advance in the ability to verify and quantitatively\nand efficiently benchmark systems of experimental importance.\n\nII.\n\nRESULTS\n\nIn the following we present two schemes for identifying systems that are well approximated by an MPS, initially focusing on pure states for simplicity. We will view\neach system as consisting of a linear chain of N qudits,\neach having dimension d. Both schemes require the measurement of linearly (in the system size N ) many local\nobservables within finite accuracy, polynomial classical\npost-processing of the data and can certify the accuracy\nof the reconstructed state without making any technical\nassumptions about the state in the laboratory. The first\nscheme requires unitary control and local measurements\nwhile the second scheme removes the need for unitary\ncontrol at the cost of more elaborate post-processing.\n\nA.\n\nScheme based on unitary transformations\n\nThe key idea of the method consists of a sequential\nprocedure to disentangle the left hand side of the chain\nfrom the right hand side, using a sequence of unitary\noperations with small interaction length independent of\nN . The result will be a product state and a sequence\nof local unitary operations from which to construct the\noriginal state.\nSuppose the ideal state in the laboratory is %̂ = |φihφ|,\nwhich we assume for clarity is a MPS of given bond dimension. This implies that the rank of reductions to\none part of a bipartite (left vs. right) split of the chain\nis bounded by a constant R. The protocol starts by\nestimating, through standard state tomography, the reduced density matrix of the first κ = dlogd (R)e + 1 sites,\n\nFIG. 1.\nQuantum circuit that transforms |φi into\n|0i⊗N −κ+1 ⊗ |ηi with κ = 3. The unitaries Ûi successively\ndisentangle the particles and the state |ηi on the last sites\nacts as a boundary condition to determine the MPS description of |φi.\n\nσ̂ ≈ trκ+1,...,N [%̂]. This reduced density matrix has the\nPR\neigendecomposition σ̂ = r=1 σr |φr ihφr | where the rank\nR ≤ dκ−1 . Hence there exists a density matrix with one\nfewer qudit that has the same rank R and eigenvalues σr\nas σ̂. Therefore we can disentangle the first site in σ̂ with\nthe following unitary acting on the first κ sites:\nκ−1\n\nÛ =\n\n−1\nd−1 d X\nX\ns=0\n\ns0 =0\n\n|si1 ⊗ |s0 i2,...,κ hφsdκ−1 +s0 +1 |1,...,κ ,\n\n(1)\n\nwhere |φ1 i, . . . , |φR i have been extended in some arbitrary way to get a complete basis for sites 1, . . . , κ. Applying Û produces the state Û |φi = |0i1 ⊗|vi2,...,N , where\n|vi is some pure state on sites 2, . . . , N . Hence Û disentangles the first qudit from all the others. Now, set aside\nthis first qudit, look at sites 2, . . . , κ + 1, and repeat the\nabove process as indicated on Fig. 1. In this way, one obtains a sequence of unitaries Û1 , . . . , ÛN −κ+1 , where each\nÛi acts on sites i, . . . , i + κ − 1. This sequence transforms\n|φi into ÛN −κ+1 * * * Û1 |φi = |0i⊗N −κ+1 ⊗ |ηi, where |ηi\nis some pure state on the last κ − 1 sites.\nIn summary, this scheme infers the quantum circuit\nused to prepare an MPS [17]. The MPS decomposition of\n|φi can then be obtained readily from the Ui and |ηi [18].\nIf the state in the laboratory %̂ is arbitrary, then the\nreduced density matrices σ̂ will generally have full rank.\nHence in each step we will need to truncate the κ qudit\nstate σ̂ to a rank R subspace with R < dκ−1 . Then the\nabove method will produce an MPS approximation to %̂.\nThe accuracy of this estimate can be certified, without\nany assumptions on the state, by keeping track of the\neffects of truncating each of the reduced states σ̂. As\nshown in the Methods, errors of magnitude \u000f due to finite\nmeasurement precision or truncation error (as measured\n\n\f3\nby the weight of the truncated space) accumulate at most\nlinearly with the number of sites, and can be evaluated\ndirectly from the data, leading to an estimate of accuracy\nN \u000f.\nThe present scheme requires unitary control of κ neighboring qudits, which is challenging to implement in many\ncurrent experimental settings. We now present a second\nscheme that avoids unitary control and requires only local measurements.\n\nB.\n\nScheme based on local measurements:\nCertification of estimated state\n\nConsider again the state %̂ in the laboratory and suppose that a tomographically-complete set of local measurements on all groups of k neighbouring qubits has\nbeen performed. Further suppose that sufficient data has\nbeen taken to yield estimates σ̂i of the local reductions\n%̂i = tr1,...,i;i+k+1,...,N [%̂] such that\nk%̂i − σ̂i ktr ≤ \u000fi .\n\n(2)\n\nDetermining these approximate reduced density operators σ̂i completes the experimental work. In the remainder we describe the classical post-processing that will result in a MPS estimate |ψi to %̂ and a lower bound to the\nfidelity hψ|%̂|ψi [19] that does not require assumptions on\nthe nature of the state %̂.\nWe start with the latter, since the following easy\ncalculation yields the fidelity bound we have in mind\nand hints at the MPS estimate we are after. Suppose,\nfor the sake of the argument, that |ψi is the unique\nground state (with energy zero) of a local Hamiltonian\nP\nĤ = i ĥi , where the ĥi is a projection operator acting only on sites i + 1, . . . , i + k (as it turns out, generic\nMPS are of this type). Then, expanding in the eigenbasis\nP2N −1\nĤ = n=0 En |En ihEn |,\ntr[Ĥ %̂] ≥ ∆E\n\nX\n\nn>0\n\nhEn |%̂|En i = ∆E(1 − hψ|%̂|ψi),\n\n(3)\n\nwhere we denoted by ∆E the energy gap above the\nground state |ψi. Hence, we have the fidelity bound\nP\n\u0011\ntr[hi ρ̂]\n1 \u0010X\nhψ|%̂|ψi ≥ 1 − i\n≥1−\ntr[ĥi σ̂i ] + \u000fi .\n∆E\n∆E\ni\n(4)\nIn other words, the Hamiltonian acts as a witness for its\nground state |ψi. This bound is tight: suppose the experimental estimates σ̂i and the reductions of the state\nin the laboratory %̂i coincide, that is \u000fi = 0. If, in addition, the reductions of |ψi match the σ̂i then, as |ψi was\nassumed to be the unique ground state with energy zero\nP\nP\nof i ĥi , we have i tr[ĥi σ̂i ] = 0, i.e., hψ|%̂|ψi = 1.\nThe goal is now clear: find a local gapped Hamiltonian Ĥ such that the reductions of its ground state are\n\nclose to the σ̂i . A priori it is unclear whether such a convenient witness always exists and how it could be found\nefficiently. However, using formal methods, one can show\nthat if the true state %̂ is close to a generic MPS, then\nsuch a witness Hamiltonian always exists [10]. What is\nmore, it can be constructed from the estimate of the algorithm sketched below. Its properties, chief among them\nthe gap, are efficiently computable. In the Methods section, we detail the efficient computation of these quantities, and we also consider how to treat states such as\nthe GHZ for which local marginals alone are not quite\nsufficient for complete characterization (they violate our\n\"generic\" condition).\n\nC.\n\nAn illustrative example\n\nWe illustrate how our certification procedure operates\nif our estimate for the state %̂ is a linear cluster state\n[20]. The cluster state is defined as the unique eigenstate\n(with eigenvalue +1) of stabilizers K̂i = Ẑi−1 X̂i Ẑi+1\nfor all i = 2, . . . , N − 1 (together with boundary terms\nX̂1 Ẑ2 and ẐN −1 X̂N , which we do not treat separately for\nsimplicity). Assume that we have performed standard\nquantum state tomography on sets of three neighbouring spins, k = 3, which is the smallest useful set because\nin a cluster state the rank of the reduced density matrices of contiguous blocks is upper bounded by R = 4.\nLet us now assume that on the basis of these data, our\nprocedure suggests that the linear cluster state is indeed\nour estimate. The local Hamiltonian in this case is given\nP\nby Ĥ = i (1 − K̂i )/2, where the (1 − K̂i )/2 = ĥi are\nprojectors, Ĥ has the cluster state as its unique ground\nstate (with energy zero) and an energy gap ∆E = 1. The\nfidelity between the cluster state |ψCS i and the state %̂ is\nP\nbounded by hψCS |%̂|ψCS i = 1 − i (tr[ĥi σ̂i ] + \u000fi ), where\n\u000fi from Eq. (3) quantifies the statistical and experimental error in the local experimental estimates, and tr[ĥi σ̂i ]\nquantifies how much the laboratory state %̂ deviates from\nan exact cluster state.\nTomography on a cluster state can also be performed\nwith the scheme based on unitary transformations. A\ncluster state is the output of a quantum circuit where\neach\n√ qubit is \u0001initially prepared in the state |+i =\n1/ 2 |0i + |1i and a controlled phase transformation\nCZ acts successfully on each pair of neighboring qubits.\nThe CZ gate changes the sign of state |11i and acts\ntrivially on the other states of the computational basis.\nThus, a cluster state is the output of a circuit whose\nstructure corresponds to the one indicated on Fig. 1 with\nκ = 2 and the scheme based on unitary transformations\ndirectly applies. Note that the unitary scheme takes advantage of the decreased rank of a reduced density matrix\non the boundary to save one qubit worth of local tomographic effort (κ = 2 vs. k = 3).\n\n\f4\nD.\n\nScheme based on local measurements: Efficient\ndetermination of an MPS estimate\n\n700\n\nWith the experimentally obtained σ̂i , we now turn to\nthe task of finding an MPS |ψi such that its reductions\ntr1,...,i;i+k+1,...,N [|ψihψ|] closely match the σ̂i . In other\ni,k\nwords: Let P̂m\nbe all possible products of Pauli operators (enumerated by m) that act non-trivially only on\ni\nsites i + 1, . . . , i + k. Then, as the P̂m\nare an orthogonal\nbasis, the σ̂i may be expanded as\n1 X\ni\ni\ntr[σ̂i P̂m\n]P̂m\n,\n(5)\nσ̂i = N\n2 m\n\ni\nwhere the expectations tr[σ̂ P̂m\n] ∈ R are obtained as results of tomographic measurements. Then we need to\nfind a matrix |ψihψ| such that for all m and i the exi\npectations tr[|ψihψ|P̂m\n] coincide with those of the tomoi\ni\ngraphic estimates, tr[|ψihψ|P̂m\n] = tr[σ̂i P̂m\n].\nThe method of choice for such a problem is singular\nvalue thresholding (SVT) [21, 22], which has been developed very recently in the context of classical compressive sampling or matrix completion [23] and may also be\napplied to the quantum setting [24–28]. SVT is a recursive algorithm that provably converges to a low-rank\ni\n]=\nmatrix satisfying constraints of the type tr[|ψihψ|P̂m\ni\ntr[σ̂i P̂m ]. Unfortunately, a straightforward application of\nSVT requires time and memory that scale exponentially\nwith the number of particles. However, a modification of\nthe algorithm allows us to overcome this problem.\ni\n] the algorithm may\nGiven the measured values tr[σ̂i P̂m\nthen P\nbe described as follows. First set up the operator\ni\ni\n/2N and initialize Ŷ0 to some arbiR̂ = m,i tr[σ̂i P̂m\n]P̂m\ntrary matrix (e.g., the zero matrix). Then proceed recursively by finding the eigenstate |yn i with largest eigenvalue, yn , of Ŷn and set\n\nX̂n = yn\n\nX hyn |P̂ i |yn i\nm\ni\nP̂m\n,\nN\n2\nm,i\n\n(6)\n\nŶn+1 = Ŷn + δn (R̂ − X̂n ).\n\nSo far, this algorithm still suffers from the fact that in every step the 2N × 2N matrix Ŷn needs to be diagonalized.\nPM\ni\nHowever, the Ŷn are of the form m,i am,i P̂m\n, am,i ∈ R,\ni\nwhere the P̂m act non-trivially only on sites i+1, . . . , i+k,\ni.e., they have the form of a local \"Hamiltonian\". Hence,\n|yn i can be determined as the highest energy state of\nthis Hamiltonian. For this task standard methods have\nbeen developed in condensed matter physics [13, 29] for\nwhich the number of parameters scale polynomially in\nthe system size and converge rapidly [30, 31] to the optimal MPS approximation. The standard but exponentially inefficient SVT algorithm possesses a convergence\nproof while our efficient modification does not. Hence,\nwe now present numerical examples for different target\nstates |φi to demonstrate the feasibility and efficiency of\nthe proposed algorithm.\n\n1\n1−fN,n\n\n500\n\n300\n\n100\n400\n\nn\n\n300\n\n200\n\n100\n\n1\n2\n1 12\n1 162\n2\n30\n\n1\n102\n\n1\n82\n\n1\nN2\n\nFIG. 2. Performance of the MPS-SVT algorithm for the\nground state (the target state |φi) of the critical Ising model.\nWe chose k = 2, i.e., only nearest neighbour reductions are\nused to reconstruct the state. Plot illustrates the scaling of\nthe error in the fidelity 1 − fN,n = 1 − |hφ|yn i|2 ∼ N 2 /n with\nthe number of spins N and the iterations n of the algorithm.\n\nThese numerical examples suggest convergence of our\nalgorithm to a MPS that closely matches the experimentally obtained reductions σ̂i . To arrive at the fidelity\nbound we follow the steps of Section II B: (i) Obtain estimates σ̂i of the reductions to k adjacent spins %̂i of the\nstate in the laboratory such that kσ̂i − %̂i ktr ≤ \u000fi , (ii)\ni\ncompute the expectations pmi = tr[σ̂i P̂m\n], which are the\ninput to the MPS-SVT algorithm, (iii) obtain a MPS estimate |yn i, the reductions of which closely match the\nσ̂i by utilizing the MPS-SVT algorithm. As |yn i is an\nMPS, one can then efficiently obtain a parent Hamiltonian [10] and a lower bound, ∆, on the energy gap above\nthe ground state (see Methods for details). Putting all\nthis together, the above programme returns a state |yn i,\nP\nits parent Hamiltonian Ĥ = i ĥi , and a number ∆ such\nthat\nP\n(\u000fi + tr[ĥi σ̂i ])\n.\n(7)\nhyn |%̂|yn i ≥ 1 − i\n∆\n\nE.\n\nExample: Strongly interacting quantum systems\n\nWe start with ground states of nearest-neighbor Hamiltonians on a chain, i.e., the |φi = |gsi are completely determined by all the reductions to two adjacent spins and\nwe expect the above algorithm not only to produce states\nthat match the reduced density matrices of the ground\nstates but, in fact, states that are themselves close to the\nground states. Among ground states of one-dimensional\nnearest-neighbor Hamiltonians, those at a critical point\nare the most challenging to approximate by MPS as they\nviolate the entanglement area law [32]. We demonstrate\n\n\f5\n\n�\n\ndetermine the ground state |gsi (our target state |φi)\nand its reductions and then computed the fidelity fN,n\nafter n iterations of the MPS-SVT algorithm, see Fig. 3.\n\n1 − fN,n\n\nF.\n\nExample: W-state preparation in ion traps\n\n0.2\n\n0.1\n\n15\n\n20\n\n25\n\n30\n\nN\n\nFIG. 3. Fidelity fN,n = |hφ|yn i|2 , for a fixed value n = 5, as\na function of the number of spins N for the ground state (the\ntarget state |φi) of the random nearest-neighbour Hamiltonians of Eq. 8. As in Fig. 2, we chose k = 2 to reconstruct the\nstate. The plot shows densities (arrows indicate the mean)\nobtained from 1000 random realizations. Similar to the Ising\nmodel, the scaling for fixed n of 1 − fN,n is better than ∼ N 2 .\n\nthe effectiveness of our algorithm for such an example:\nthe critical Ising model in a transverse field on a chain\nof length N with open boundary conditions. The ground\nstate of this Hamiltonian is unique and hence it is completely characterized by its reductions to k = 2 neighbouring sites. In other words, if we find an MPS that has\nthe same reductions, the fidelity will be one. We proceed\nas follows. (i) We obtain the reductions %̂i to two neighbouring sites of the true ground state, (ii) from these\nreductions we obtain the expectations pmi = tr[%̂i P̂mi ],\nwhich are the input to the MPS-SVT algorithm. In Fig. 2\nwe show the fidelity fN,n = |hyn |φi|2 of the true ground\nstate |φi and the n'th iterate of the above algorithm as\na function of n and the length N of the chain. It shows\nthat for fixed system size 1 − fN,n decreases as ∼ 1/n\nwhile for fixed n it increases slower than N 2 . This provides an indication that our algorithm is polynomial in\nthe system size.\nThe Ising model is solvable and, in order to show that\nwe are not considering a special case that is particularly favourable, we also consider one-dimensional random Hamiltonians of the form\nĤ =\n\nN\n−1\nX\n\n(i) (i)\n\nr̂i r̂i+1 ,\n\n(8)\n\ni=1\n\n(i)\n\n(i)\n\nwhere the r̂i , r̂i+1 act on spin i and i + 1, respectively,\nand are hermitian matrices with entries that have real\nand imaginary part picked from a uniform distribution\nover [−1, 1]. For each Hamiltonian, as before, we first\n\nOur method is of interest for many situations in which\nstandard tomography will not be feasible. This is the\ncase for the verification of state preparation in experiments with too many particles. An example is the recent\nion trap experiment [3] for the preparation of √\nW-states,\n|φi = (|10 * * * 0i + |010 * * * 0i + * * * + |0 * * * 01i)/ N , that\nwere limited to 8 qubits principally because the classical postprocessing of data became prohibitive for longer\nchains. Here we demonstrate the efficiency of our approach (we are not limited to few ions and demonstrate\nconvergence for up to 20 ions – even higher number of\nions are easily accessible due to the MPS alteration of\nthe SVT method) by illustrating how one would postprocess experimentally obtained reduced density matrices to\nguarantee the generation of |φi or a state very close to it.\nNote that, as in the above spin chain examples, one need\nonly take tomographic data on pairs (k = 2) of neighbouring qubits. We mimic experimental noise by adding\nGaussian distributed random numbers with zero mean\nto the pmi . After initializing the algorithm with Ŷ0 = R̂,\nwhere we obtain R̂ from the MPS representation of |φi,\nP\ni,k\nwe use xn := mi |pm,i −hyn |P̂m\n|yn i| as a figure of merit\nfor convergence, i.e., after a given number of iterations,\nwe pick the |yn i with minimum xn . The result of such a\nprocedure is shown in Fig. 4.\nIII.\n\nDISCUSSION\n\nWe have presented two schemes that efficiently produce\nan MPS description as a tomographic estimate of a quantum state, along with a tight fidelity bound. We emphasize that no assumptions are necessary for our scheme; if\nno such MPS description exists, this will be evident from\nthe local tomographic data and our schemes will herald\na failure. However, the enormous successes of MPS for\ndescribing both one-dimensional quantum systems found\nin nature as well as a host of states relevant to quantum\ninformation ensures that our methods will be very useful\nin practice.\nSo far we presented the method for pure states and onedimensional systems. Various generalizations are possible: Our first scheme using unitary control can also\nhandle mixed states corresponding to small ensembles\nof pure MPS. Suppose we are presented with a state %̂\nthat is a mixture of M pure states, each of which is an\nMPS having bond dimension D. Then the reduction of\n%̂ to any subsystem has rank at most M D. We can proceed as before, performing unitary operations on blocks\nof κ = dlogd (M D)e + 1 sites, in order to disentangle individual sites from the rest of the chain. At the end of\n\n\f6\n\nfN,n\n\n0.98\n\n0.96\n\n0.94\n\n0.92\n10\n\n15\n\n20\n\nN\n\nFIG. 4. Performance of the MPS-SVT algorithm√for Wstates, |φi = (|10 * * * 0i + |010 * * * 0i + * * * + |0 * * * 01i)/ N . We\nare not limited to few ions and demonstrate convergence for\nup to 20 ions – even higher number of ions are easily accessible due to the MPS alteration of the SVT method, demonstrating the efficiency of our approach. We mimic experimental noise by adding Gaussian distributed random numbers\nwith zero mean to the local expectations pmi = tr[σ̂i P̂mi ] and\nshow results for n = 4000 MPS-SVT iterations. Plot shows\nfN,n = |hφ|yn i|2 as a function of the number of ions, N , for no\nnoise (dots) and Gaussian noise (densities obtained from 100\nrealizations for each N , arrows indicate mean) with a standard deviation of 0.005 (blue; only even values of N plotted\nfor clarity) and 0.01 (black, odd N ).\n\nthe chain, we will find a mixed state η of rank M on the\nlast κ − 1 sites. We decompose η as a mixture of M pure\nstates. This yields a representation of %̂ as an ensemble of\nM pure MPS, each with bond dimension at most dM D.\nOur second scheme using local measurements can also\nbe extended to handle mixed states. While the k-particle\nreduced density matrices do not uniquely determine the\nmixed state %̂, reconstructions of better and better quality can be obtained by increasing k. As an example,\nsuppose %̂ is the Gibbs state corresponding to a k-local\nHamiltonian Ĥ, i.e. the state minimizing the free energy\ntr[%̂Ĥ] − T S(%̂).\n\ntended to mixed states by considering purifications and\ncan then, e.g., also handle thermal states of local Hamiltonians, under the physically reasonable assumption that\nthe entropy density exists [33]. In addition, it can be generalized to all mixed finitely correlated states (FCS) [9],\nthough it is not always possible to certify the resulting\nestimates.\nHigher-dimensional systems are more challenging, because the most straightforward generalization of MPS,\nknown as projected entangled-pair states (PEPS) [34],\ncannot be computed as efficiently. However, the certification method using a frustration-free parent Hamiltonian remains efficient in the case of qubits with nearestneighbor couplings [35]. Combinations of our techniques\ncan be used to reconstruct other classes of states, such\nas tree tensor networks [36] and multiscale entanglement\nrenormalization ansatz (MERA) states [37], for which efficient heuristics for minimizing local Hamiltonians are\navailable.\n\nACKNOWLEDGMENTS\n\nThe authors acknowledge discussion with F.G.S.L.\nBrandão at early stages of this project. The work at\nUlm University has been supported by the EU Integrated\nProject QAP, the EU STREP's CORNER and HIP and\nan Alexander von Humboldt Professorship. SDB acknowledges the support of the Australian Research Council and the Perimeter Institute. STF and RS were supported by the Perimeter Institute for Theoretical Physics.\nResearch at Perimeter is supported by the Government of\nCanada through Industry Canada and by the Province of\nOntario through the Ministry of Research & Innovation.\nDG is glad to acknowledge support from the EU (CORNER). OLC and DP are partially funded by NSERC and\nFQRNT. YKL is funded by the US ARO/NSA.\n\nIV.\n\nWe start by recalling the MPS representation of a state\n|ψi with open boundary conditions (generalisations to periodic boundary conditions are entirely straightforward).\n\n(9)\n\nThe first term is, as before, determined by the reduced\ndensity matrices. The entropy of the total state however can only be learned exactly from the complete density matrix. Yet, for essentially all reasonable physical\nsystems, the entropy density limk→∞ S(trk+1,... (%̂))/k in\nthe thermal state of a Hamiltonian exists [33] (In particular, finitely correlated states are precisely those states\nwhose entropy density is exactly equal to S(trk+1,... (%̂))−\nS(trk,... (%̂)) for some finite value of k). As a consequence,\nthe total entropy of the state can be estimated efficiently\nfrom knowledge of the reduced density matrices. Hence,\nour second scheme using local measurements may be ex-\n\nMETHODS\n\n|ψi =\n\ndX\n1 −1\ns1 =0\n\n***\n\ndX\nN −1\nsN =0\n\nM1 [s1 ] * * * MN [sN ]|s1 * * * sN i,\n\n(10)\n\nwhere the Mi [s] are Di × Di+1 matrices with D1 =\nDN +1 = 1. We denote the bond dimension by D =\nmax Di .\n\nA.\n\nDirect tomography\n\nThis method proceeds by disentangling all the qudits\nof the chain sequentially. Thus, it yields a valid MPS\n\n\f7\ndescription if every unitary exactly disentangles one qudit. Put another way, while it is crucial to obtain a good\nestimate of the dκ−1 -dimensional subspace on which σ̂ is\nsupported, it is not necessary to identify the eigenvectors\nof σ̂ exactly : any set of orthonormal vectors generating\nthe subspace is sufficient for our tomography procedure\nand leads to an MPS description in another gauge [10].\nThis property will be central to our error analysis.\nTo understand the effect of errors and imperfections in\nour tomography procedure, consider the very first step\nof the recursive procedure. Tomography is performed on\nthe first κ sites to ideally find a state with non-maximal\nsupport, and unitary Û1 is applied to rotate that state\ninto the subspace H1cutoff = |0i ⊗ (Cd )⊗n−1 . In any experimental setting, the resulting state Û1 |φi would surely\nnot lie entirely in that subspace. This can be either because the state of the system is not exactly an MPS with\nbond dimension D, but merely close to one or because\nour estimate of the density matrix σ̂ on sites 1 to κ is\nslightly wrong due to measurements that are, in practice, noisy and restricted to finite precision. Indeed, we\ncan expect that the reduced density matrix on the first κ\nsites will actually be full-rank, though most of its probability mass will lie on a subspace of dimension at most\nD. So, each time we apply a disentangling operation Ûi ,\nwe also want to truncate the reduced state to the desired\nsubspace. Similarly, a faulty estimate of σ̂ will result in\na small probability mass that lies outside the estimated\nsupport.\nGiven an estimated disentangling unitary Û1 , any state\n|φi can be expressed as\n|0i ⊗ |η1 i + |e1 i\nÛ1 |φi = p\n1 + he1 |e1 i\n\n(11)\n\nwhere |e1 i is some sub-normalized error vector supported\non the subspace orthogonal to H1cutoff . The unitary Û1\nis chosen to minimize the norm \u000f1 = he1 |e1 i of this error\nvector. It is possible to directly estimate the magnitude\nof the error \u000f1 by measuring the first qudit in the standard basis; the error is equal to the population of the\nnon-zero states.\nIn subsequent steps of the recursion, we are given a\nstate of the form\n|0i⊗i ⊗ |ηi i + |ecm\ni i\nÛi . . . Û1 |φi = p\ncm\ncm\n1 + hei |ei i\n\n|ecm\ni i\n\nbe\nÛi+1 Ûi . . . Û1 |φi =\n=\nwhere\n\n|0i⊗i ⊗ Ûi+1 |ηi i + Ûi+1 |ecm\ni i\np\ncm\ncm\n1 + hei |ei i\n|0i⊗i+1 ⊗ |ηi+1 i + |ecm\ni+1 i\nq\ncm\n1 + hecm\ni+1 |ei+1 i\n\n|ei i + Ui+1 |ecm\ni i\np\n|ecm\ni\n=\ni+1\ncm\ncm\n1 + hei |ei i\n\n(14)\n\n(15)\n\ncm\nand therefore \u000fcm\ni+1 ≤ \u000fi + \u000fi+1 .\nThus, we see that errors accumulate linearly with\nthe number of particles; if we denote |ψi =\n†\nN −κ+1\n|ηN −κ+1 i the estimated MPS, we\nÛ1† . . . ÛN\n−κ+1 |0i\nhave\n\n|φi − |ψi = |ecm\nN −κ+1 i ≤\n\nNX\n−κ+1\ni=1\n\n|ei i ≤ N \u000f (16)\n\nwhere \u000f = maxi |ei i . The overall error is at most the\nsum of the individual errors on each step. In addition,\neach of the \u000fi is revealed during the tomographic procedure because they correspond to the post-selection success probability. This provides a direct method to certify\nthe inferred state.\nB.\n\nParent Hamiltonians\n\nP\nLet |ψi be as in (10) and such that s Mi [s]Mi [s]† = 1\nfor all i = 1, . . . , N . This can always be achieved by\nsubsuming qudits at the beginning and end of the chain\ninto qudits with higher dimension and successive singular\nvalue decompositions [9, 10]. Now let N, k ∈ N such that\nN/k ∈ N, and assume that the MPS is injective [10] such\nthat for all j = k, . . . , N − 2k the set\n\u001a\n\u001b\nMj+1 [s1 ] * * * Mj+k [sk ] si = 1, . . . , di\n(17)\nspans CDj+1 ×Dj+k+1 . Then |ψi is the unique ground state\nof\nN/k−2\n\nĤ =\n(12)\n\nwhere\nis the accumulated error vector that lies in\nthe subspace orthogonal to Hicutoff = |0i⊗i ⊗ (Cd )⊗N −i .\nAs a first step, we can truncate this error vector by measuring the first i particles in the standard basis and postselect on the all-zero outcome. This occurs with a probability roughly 1 − \u000fcm\ni , and leaves the system in the state\n|0i⊗i ⊗ |ηi i. We then repeat the steps leading to Eq. 11\nwith the post-selected state |ηi i. The resulting state will\n\n(13)\n\nX\n\nP̂n ,\n\n(18)\n\nn=0\n\nwhere P̂n is the projector onto the subspace orthogonal\nto the range of the mapping Γn : CDnk+2k+1 ×Dnk+1 →\nCdnk+1 ***dnk+2k ,\ni\nX h\nΓn (X) =\ntr XMnk+1 [snk+1 ] * * * Mnk+2k [snk+2k ]\nsnk+1 ,\n...,\nsnk+2k\n\n×|snk+1 * * * snk+2k i.\n(19)\n\n\f8\nTo get an efficiently computable lower bound the energy\ngap, we use\n\u001b\n\u001a\n(20)\n∆E = max λ Ĥ(Ĥ − λ) ≥ 0 .\nWe find\nĤ 2 = Ĥ +\n\nX\n\nn,m\nn6=m\n\nP̂n P̂m ≥ Ĥ +\n\nX\n\nP̂n P̂m + P̂m P̂n\n,\n2\n\nn,m\n1≤|n−m|k≤2k\n\n(21)\nwhere we omitted non-negative summands. Now consider\nthe following quantity, which will bound the individual\nterms in the previous equation,\n\u001a\n\u001b\nγn,m = min λ P̂n P̂m + P̂m P̂n + λ(P̂n + P̂m ) ≥ 0\n\u001b\n\u001a\n2\n= min λ (P̂n + P̂m ) ≥ (1 − λ)(P̂n + P̂m )\n\u001a\n\u001b\n2\n= 1 − max λ (P̂n + P̂m ) ≥ λ(P̂n + P̂m ) ,\n(22)\n\nwhere the maximum is given by the smallest non-zero\neigenvalue of P̂n + P̂m . Hence\nX\nĤ 2 ≥ Ĥ −\nγn,m P̂n ≥ (1 − γ)Ĥ,\n(23)\n\nand therefore we have the lower bound ∆E ≥ 1 − γ,\nwhere\nγ = max\n\n0≤n≤N\n\nX\n\nγn,m .\nm\n1≤|n−m|k≤2k\n\n(24)\n\nInjectivity may fail to hold in certain singular cases.\nThe simplest example given by the family of GHZ-type\nstates √12 (|0, . . . , 0i + eiφ |1, . . . , 1i). Since any local reduced density matrix is independent of φ, it is impossible\nto distinguish the members of that family based on local\ninformation alone. Indeed, in this example, the ground\nstate space of Ĥ will be two-dimensional, spanned by\n|0, . . . , 0i and |1, . . . , 1i. One may check that the gap\nanalysis above continues to hold in the degenerate case\n(unlike the original in [9]), now certifying the overlap\nbetween %̂ and the ground-state space. This fact alone\nimplies an exponential reduction in the number of unknown parameters. It is easy to see that the small remaining uncertainty about %̂ can be lifted in our example\nby measuring the \"string operator\" σx ⊗ . . . ⊗ σx , which\nhas expectation value cos φ. Using e.g. the results of [38],\nthe method of this particular example immediately generalizes to any MPS with a two-fold degeneracy, such\nas the W state. Higher degeneracies may be treated by\nstraight-forward, but more tedious, methods.\n\nn,m\n1≤|n−m|k≤2k\n\n[1] Vogel, K. and Risken, H. Determination of quasiprobability distributions in terms of probability distributions\nfor the rotated quadrature phase. Phys. Rev. A 40, 2847–\n2849 (1989).\n[2] Smithey, D.T., Beck, M., Raymer, M.G. and Faridani, A.\nMeasurement of the Wigner distribution and the density\nmatrix of a light mode using optical homodyne tomography: Application to squeezed states and the vacuum.\nPhys. Rev. Lett. 70, 1244–1247 (1993).\n[3] Häffner, H., Hänsel, W., Roos, C.F., Benhelm, J., Chekal-kar, D., Chwalla, M., Körber, T., Rapol, U.D., Riebe,\nM., Schmidt, P.O., Becher, C., Gühne, O., Dür, W. and\nBlatt, R. Scalable multiparticle entanglement of trapped\nions. Nature 438, 643–646 (2005).\n[4] Leibfried, D., Knill, E., Seidelin, S., Britton, J.,\nBlakestad, R.B., Chiaverini, J., Hume, D.B., Itano,\nW.M., Jost, J.D., Langer, C., Ozeri, R., Reichle, R. and\nWineland, D.J. Creation of a six-atom 'Schrödinger cat'\nstate. Nature 438, 639–643 (2005).\n[5] James, D.F.V., Kwiat, P.G., Munro, W.J. and White,\nA.G. Measurement of qubits. Phys. Rev. A 64, 052312\n(2001).\n[6] Dunn, T. J. and Walmsley, I. A. and Mukamel, S. Experimental Determination of the Quantum-Mechanical State\nof a Molecular Vibrational Mode Using Fluorescence Tomography, Phys. Rev. Lett. 74, 884 (1995).\n[7] Lvovsky, A.I. and Raymer, M.G. Continuous-variable optical quantum-state tomography. Rev. Mod. Phys. 81,\n\n299–332 (2009).\n[8] Paris, M. and R̆ehác̆ek, J., eds., Quantum State Estimation, no. 649 in Lect. Notes Phys. (Springer, Heidelberg,\n2004).\n[9] Fannes, M., Nachtergaele, B. and Werner, R.F. Finitely\ncorrelated states on quantum spin chains. Comm. Math.\nPhys. 144, 443–490 (1992).\n[10] Perez-Garcia, D., Verstraete, F., Wolf, M.M and Cirac,\nJ.I. Matrix product state representations. Quant. Inf.\nComp. 7, 401–430 (2007).\n[11] Vidal, G. Entanglement Renormalization. Phys. Rev.\nLett. 99 220405 (2007).\n[12] Rizzi, M., Montangero, S. and Vidal, G. Simulation of\ntime evolution with multiscale entanglement renormalization ansatz. Phys. Rev. A 77, 052328 (2008).\n[13] Östlund, S. and Rommer, S. Thermodynamic Limit of\nDensity Matrix Renormalization. Phys. Rev. Lett. 75,\n3537–3540 (1995).\n[14] Hastings, M.B. Solving gapped Hamiltonians locally.\nPhys. Rev. B 73, 085115 (2006).\n[15] Hastings, M.B. An area law for one-dimensional quantum\nsystems. J. Stat. Mech. P08024 (2007).\n[16] Bloch, I., Dalibard, J. and Zwerger, W., Many-Body\nPhysics with Ultracold Gases, Rev. Mod. Phys. 80, 885\n(2008).\n[17] Schoen, C., Hammerer, K., Wolf, M.M., Cirac, J. I. and\nSolano, E. Sequential Generation of Entangled Multiqubit States. Phys. Rev. A 75, 032311 (2007).\n\n\f9\n[18] Vidal, G. Efficient Classical Simulation of Slightly Entangled Quantum Computations. Phys. Rev. Lett. 91,\n147902 (2003).\n[19] Gilchrist, A., Langford, A. K., Nielsen, M. A. Distance\nmeasures to compare real and ideal quantum processes,\nPhys. Rev. A 71, 062310 (2005).\n[20] Briegel, H. J. and Raussendorf, R. Persistent\nEntanglement in arrays of Interacting Particles.\nPhys. Rev. Lett. 86, 910–913 (2001).\n[21] Candes, E.J. and Recht, B. Exact Matrix Completion via\nConvex Optimization. arXiv:0805.4471 [cs.IT].\n[22] Cai, J-F., Candes, E.J. and Shen, Z. A Singular\nValue Thresholding Algorithm for Matrix Completion.\narXiv:0810.3286 [math.OC].\n[23] Candes, E.J. and Wakin, M.B. An introduction to compressive sampling. IEEE Sig. Proc. Mag. 25, 21–30\n(2008).\n[24] Kosut, R.L. Quantum Process Tomography via l1 -norm\nMinimization. arXiv:0812.4323 [quant-ph].\n[25] Gross, D., Liu, Y-K., Flammia, S.T., Becker, S. and Eisert, J. Quantum state tomography via compressed sensing. arXiv:0909.3304 [quant-ph]\n[26] Gross, D. Recovering low-rank matrices from few coefficients in any basis. arXiv:0910.1879 [cs.IT].\n[27] Shabani, A., Kosut, R.L. and Rabitz, H. Compressed\nQuantum Process Tomography. arXiv:0910.5498 [quantph].\n[28] Shabani, A., Mohseni, M., Lloyd, S., Kosut, R.L. and Rabitz, H. Efficient estimation of nearly sparse many-body\nquantum Hamiltonians. arXiv:1002.1330 [quant-ph].\n\n[29] Schollwöck, U. The density-matrix renormalization\ngroup. Rev. Mod. Phys. 77, 259–315 (2005).\n[30] Schuch, N. and Cirac, J.I. Matrix Product State and\nmean field solutions for one-dimensional systems can be\nfound efficiently. Phys. Rev. A 82, 012314 (2010).\n[31] Aharonov, D., Arad, I. and Irani, S. An Efficient Algorithm for approximating 1D Ground States. Phys. Rev.\nA 82, 012315 (2010).\n[32] Eisert, J., Cramer, M., and Plenio, M.B. Area laws for\nthe entanglement entropy - a review, Rev. Mod. Phys.\n82, 277 (2010).\n[33] Bratteli, O. and Robinson, D.W. Operator Algebras and\nQuantum Statistical Mechanics, Texts and Monographs\nin Physics Vol. 2 (Springer, New York) 1979.\n[34] Verstraete, F. and Cirac, J.I. Renormalization algorithms\nfor Quantum-Many Body Systems in two and higher dimensions. arXiv:cond-mat/0407066.\n[35] de Beaudrap, N., Ohliger, M., Osborne, T.J. and Eisert,\nJ. Solving frustration-free spin systems. arXiv:1005.3781\n(2010).\n[36] Tagliacozzo, L., Evenbly, G. and Vidal, G. Simulation\nof two-dimensional quantum systems using a tree tensor\nnetwork that exploits the entropic area law. Phys. Rev.\nB 80, 235127 (2009).\n[37] Evenbly, G. and Vidal, G. Algorithms for entanglement\nrenormalization. Phys. Rev. B 79, 144108 (2009).\n[38] Walgate, J., Short, A., Hardy, L. and Vedral, V. Local\nDistinguishability of Multipartite Orthogonal Quantum\nStates. Phys. Rev. Lett 85, 4972–4975 (2000).\n\n\f"}