{"id": "http://arxiv.org/abs/1109.1601v2", "guidislink": true, "updated": "2011-12-29T13:34:40Z", "updated_parsed": [2011, 12, 29, 13, 34, 40, 3, 363, 0], "published": "2011-09-07T23:22:21Z", "published_parsed": [2011, 9, 7, 23, 22, 21, 2, 250, 0], "title": "Additivity of the dp-rank", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.2929%2C1109.5486%2C1109.1768%2C1109.6114%2C1109.3518%2C1109.1150%2C1109.3389%2C1109.5192%2C1109.2404%2C1109.6850%2C1109.3839%2C1109.1935%2C1109.0078%2C1109.3269%2C1109.5035%2C1109.0745%2C1109.4705%2C1109.4126%2C1109.2499%2C1109.0795%2C1109.6271%2C1109.6473%2C1109.0832%2C1109.0487%2C1109.1040%2C1109.3501%2C1109.0261%2C1109.6041%2C1109.0012%2C1109.4523%2C1109.1212%2C1109.0094%2C1109.6882%2C1109.3986%2C1109.1550%2C1109.3345%2C1109.0247%2C1109.1796%2C1109.0565%2C1109.4194%2C1109.0108%2C1109.6615%2C1109.5845%2C1109.0374%2C1109.1532%2C1109.2869%2C1109.5438%2C1109.0061%2C1109.2237%2C1109.3288%2C1109.3049%2C1109.1921%2C1109.3100%2C1109.6030%2C1109.6797%2C1109.4242%2C1109.0817%2C1109.4650%2C1109.6800%2C1109.3048%2C1109.3455%2C1109.6743%2C1109.6894%2C1109.6374%2C1109.3794%2C1109.6404%2C1109.4003%2C1109.1339%2C1109.1204%2C1109.1401%2C1109.4854%2C1109.2155%2C1109.5243%2C1109.5789%2C1109.1741%2C1109.0685%2C1109.3846%2C1109.3317%2C1109.0479%2C1109.5744%2C1109.1291%2C1109.0217%2C1109.4519%2C1109.2439%2C1109.1326%2C1109.1313%2C1109.4156%2C1109.2637%2C1109.1601%2C1109.4450%2C1109.0899%2C1109.0144%2C1109.3529%2C1109.3062%2C1109.1990%2C1109.6893%2C1109.6517%2C1109.3058%2C1109.6175%2C1109.4949%2C1109.2925&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Additivity of the dp-rank"}, "summary": "The main result of this article is sub-additivity of the dp-rank. We also\nshow that the study of theories of finite dp-rank can not be reduced to the\nstudy of its dp-minimal types, and discuss the possible relations between\ndp-rank and VC-density.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.2929%2C1109.5486%2C1109.1768%2C1109.6114%2C1109.3518%2C1109.1150%2C1109.3389%2C1109.5192%2C1109.2404%2C1109.6850%2C1109.3839%2C1109.1935%2C1109.0078%2C1109.3269%2C1109.5035%2C1109.0745%2C1109.4705%2C1109.4126%2C1109.2499%2C1109.0795%2C1109.6271%2C1109.6473%2C1109.0832%2C1109.0487%2C1109.1040%2C1109.3501%2C1109.0261%2C1109.6041%2C1109.0012%2C1109.4523%2C1109.1212%2C1109.0094%2C1109.6882%2C1109.3986%2C1109.1550%2C1109.3345%2C1109.0247%2C1109.1796%2C1109.0565%2C1109.4194%2C1109.0108%2C1109.6615%2C1109.5845%2C1109.0374%2C1109.1532%2C1109.2869%2C1109.5438%2C1109.0061%2C1109.2237%2C1109.3288%2C1109.3049%2C1109.1921%2C1109.3100%2C1109.6030%2C1109.6797%2C1109.4242%2C1109.0817%2C1109.4650%2C1109.6800%2C1109.3048%2C1109.3455%2C1109.6743%2C1109.6894%2C1109.6374%2C1109.3794%2C1109.6404%2C1109.4003%2C1109.1339%2C1109.1204%2C1109.1401%2C1109.4854%2C1109.2155%2C1109.5243%2C1109.5789%2C1109.1741%2C1109.0685%2C1109.3846%2C1109.3317%2C1109.0479%2C1109.5744%2C1109.1291%2C1109.0217%2C1109.4519%2C1109.2439%2C1109.1326%2C1109.1313%2C1109.4156%2C1109.2637%2C1109.1601%2C1109.4450%2C1109.0899%2C1109.0144%2C1109.3529%2C1109.3062%2C1109.1990%2C1109.6893%2C1109.6517%2C1109.3058%2C1109.6175%2C1109.4949%2C1109.2925&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The main result of this article is sub-additivity of the dp-rank. We also\nshow that the study of theories of finite dp-rank can not be reduced to the\nstudy of its dp-minimal types, and discuss the possible relations between\ndp-rank and VC-density."}, "authors": ["Itay Kaplan", "Alf Onshuus", "Alexander Usvyatsov"], "author_detail": {"name": "Alexander Usvyatsov"}, "author": "Alexander Usvyatsov", "links": [{"href": "http://arxiv.org/abs/1109.1601v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1109.1601v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.LO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.LO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1109.1601v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1109.1601v2", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:1109.1601v2 [math.LO] 29 Dec 2011\n\nADDITIVITY OF THE DP-RANK\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\nAbstract. The main result of this article is sub-additivity of the dp-rank.\nWe also show that the study of theories of finite dp-rank can not be reduced\nto the study of its dp-minimal types, and discuss the possible relations between\ndp-rank and VC-density.\n\n1. introduction\nThis paper grew out of discussions that the authors had during a meeting in\nOberwolfach in January 2010, following a talk of Deirdre Haskell, and conversations\nwith Sergei Starchenko, on their recent joint work with Aschenbrenner, Dolich and\nMacpherson [2]. Haskell's talk made it apparent to us that the notion of VC-density\n(Vapnik-Chervonenkis density), investigated in [2], is closely related to \"dependence\nrank\" (dp-rank) introduced by the third author in [14]. Discussions with Starchenko\nhelped us realize that certain questions, such as additivity, which were (and still\nare, to our knowledge) open for VC-density, may be approached more easily in the\ncontext of dp-rank. This paper is the first step in the program of investigating basic\nproperties of dp-rank and its connections with VC-density.\nWhereas dp-rank is a relatively new notion, VC-density and related concepts\nhave been studied for quite some time in the frameworks of machine learning, computational geometry, and other branches of theoretical computer science. Recent\ndevelopments point to a connection between VC-density and dp-rank, strengthening\nthe bridge between model theory and these subjects. We believe that investigating\nproperties of dp-rank is important for discovering the nature of this connection.\nFurthermore, once this relation is better understood, theorems about dp-rank are\nlikely to prove useful in the study of finite and infinite combinatorics related to\nVC-classes.\nDp-rank was originally defined in [14] as an attempt to capture how far a certain\ntype (or a theory) is from having the independence property. It also helped us to\nisolate a minimality notion of dependence for types and theories (that is, having\nrank 1). We called this notion dp-minimality and investigated it in [7]. Both dprank and dp-minimality were simplifications of Shelah's various ranks from [12],\n1991 Mathematics Subject Classification. Primary 03C45, 03C98; Secondary 05D99, 68R05.\nKey words and phrases. dp-rank, dp-minimality, VC-density.\nThe third author was supported by FCT grant SFRH / BPD / 34893 / 2007 and FCT research\nproject PTDC/MAT/101740/2008.\nWe thank the organizers of the meeting \"Model theory: Around Valued Fields and Dependent\nTheories\" at Oberwolfach in January 2010. Special thanks to Sergei Starchenko for valuable\ndiscussions during and after the meeting. We would also like to thank John Goodrick, Alfred\nDolich, Pierre Simon and the anonymous referee for some very helpful remarks and comments on\nearlier drafts of this paper.\n1\n\n\f2\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nand appropriate minimality notions. Our simplified notion of rank turned out to\nbe very close to Shelah's κict , but localized to a type.\nA few characterizations of dp-minimality have since been given in the literature, and similar equivalences can also be applied to higher ranks. It seems clear\nat this point that part of the strength of this concept is the interaction between\nthose equivalent definitions. We are mainly referring to the \"standard\" (syntactic)\nindependent array definition as given in [14, 8] (see Definition 2.4), which is very\nuseful when one wants to deal with formulas, and a very simple \"semantic\" variant\n(see Definition 2.1), which can be found, for the dp-minimal case, in Simon's paper\n([13]), but which (as far as we know) has never been stated for a type with rank\ngreater than 1. In this paper, we will mainly work with the semantic definition,\nwhich proves useful and convenient for our purposes. However, throughout the\npaper we prove quite a few different characterizations of dp-rank, especially in the\nfinite rank case; we summarize them in Theorem 5.4.\nAs the word \"rank\" indicates, dp-rank is a certain measure of the \"size\" of a\ntype. It would probably be more accurate to say that dp-rank measures \"diversity\"\nof realizations of the type – how much the realizations differ from each other, as\ncan be seen by external parameters. We will elaborate on this below. Just as\nwith most rank notions, one wonders whether it has basic properties such as subadditivity: the rank of a tuple should be bounded by the sum of the ranks of its\nelements. This is the main result of Section 4. As a corollary, we obtain global\nbounds for alternation ranks of formulas in a theory of finite rank (so in particular\nin a dp-minimal theory).\nDp-rank is a notion which is related to weight in stable theories (and motivated\nby it), and to certain more recent notions of weight in dependent theories, e.g. [7],\n[8], and [6]. It is therefore natural to wonder whether dp-rank can play a role similar\nto weight in dependent theories. Although this is still a line of work which can be\npursued (and probably provides natural lines of research), in this paper we give\nlimitations to the analogy, showing that dp-rank fails to have certain properties\nthat one would hope for in a notion of weight, in at least two significant ways.\nOne of our original intentions (influenced greatly by the weight analogy) was to\nprove results for dp-minimal types, and then try to extend them to higher ranks\nby induction, at least for the finite rank case. The analogy with weight in stable\n(and even simple) theories led us to ask whether every type of finite dp-rank can\nbe \"analyzed\" to some extent by types of rank 1. This turns out to be not the case,\nand provides the first limitation to the weight comparison. Example 2.10 presents\na theory with types of finite rank but no dp-minimal types. This is a very \"tame\"\nstrongly dependent theory (hence of \"finite weight\" – in fact, of dp-rank 2), but\nthere are no types of \"weight\" 1 (whatever definition of weight one chooses to use;\nsee e.g. [7]).\nAnother direction where the analogy fails is the finite/infinite correspondence.\nHyttinen's results in [4], that yield a decomposition a type of finite weight in a stable\ntheory into types of weight 1, also imply that no type has infinite but \"rudimentarily\nfinite\" weight. In other words, if a type has weight א0 , then there exists an infinite\nset witnessing this. In Subsection 2.2 (particularly, Theorem 2.13) we observe\nthat this fails to be the case for dp-rank, even in stable theories. The example\npresented there also answers negatively an analogous question concerning Adler's\nnotion of burden in [1] (since burden is essentially the same as dp-rank in dependent\n\n\fADDITIVITY OF THE DP-RANK\n\n3\n\ntheories1). Specifically, this is an example of an א0 -stable theory (in particular,\nsuperstable) such that every type over ∅ has infinite dp-rank. Since in a superstable\ntheory weight of any given complete type is finite, Theorem 2.13 exemplifies a very\nimportant difference between weight and dp-rank: weight only takes into account\nnonforking extensions of the type; so when passing to a forking extension, weight\nmay grow. Dp-rank does not distinguish between different kinds of extensions, so\nit can only go down when the set of parameters is increased (as is the case with\nmost rank/dimension notions).\nIn a sense, with the notion of dp-rank, we capture a very particular aspect of\nthe size of the type, and our thesis is that it might be \"better\" to think of dp-rank\nin relation to finite combinatorial invariants of Vapnik-Chervonenkis (VC) classes,\nparticularly, VC-density, instead of in terms of weight.\nVC-density is one of the possible measures of growth rate of types over finite sets.\nSpecifically, assuming that ∆(x, y) is a finite set of dependent formulas (which is\nequivalent to the growth rate of the number of finite ∆-types being polynomial\nrather than exponential), VC-density bounds the degree of the corresponding polynomial. So VC-density 1 corresponds to linear growth of the number of ∆-types\nover finite sets. We prove in Section 5 that one way of looking at dp-rank is the following: dp-rank of a type p corresponds to the degree of a polynomial that measures\nhow many types can a realization c |= p realize over finite indiscernible sequences.\nIn other words, dp-rank of p is a measure of the number of realizations of p that\nhave different types over finite indiscernible sequences.\nSo in particular dp-minimality means that realizations of p realize only order of\nn types over any given indiscernible sequence of length n. This is equivalent, as\nis shown in Section 2, to the following: subsets of indiscernible sequences that a\nrealization of p can definably pick are simply intervals. These intervals can be, of\ncourse, of length 1 (that is, singletons). The important observation here is that\na dp-minimal element can not pick (definably) a finite tuple of size bigger than 1\nfrom an arbitrary indiscernible sequence. Or, more precisely, its alternation rank\ncan not be bigger than 2. In this respect the behavior of a dp-minimal element\nresembles an element in either an o-minimal theory, or the theory of equality.\nA number of distinctions between the notions of VC-density and dp-rank should\nbe pointed out. The obvious ones are that we only count number of types over\nindiscernible sequences (as opposed to arbitrary finite sets), and restrict ourselves\nto realizations of a given type (the second one is not important – one can look\nat dp-rank of a partial type as well). Another difference is that, when calculating\ndp-rank, we do not restrict the set of formulas that one is allowed to use to a finite\nset. This is why, even in a strongly dependent theory, one can end up with types\nof dp-rank ω (one obtains more and more types over indiscernible sequences by\nchanging the formulas), one more thing that Theorem 2.13 exemplifies.\nHowever, dp-rank is a very natural model theoretic analogue of VC-density.\nPart of the strength of model theoretic techniques is the ability to approximate\ncomplex phenomena in better behaved structures. Indiscernible sequences have\nalready proved very helpful for such approximations in various contexts. Seeking\nconnections between VC-density and dp-rank is another implementation of this\nidea.\n1If either is finite then the two coincide; for infinite cardinals the dp-rank of a type may be the\nsuccessor of the burden of the type.\n\n\f4\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nSince we work with the semantic definition of dp-rank, we need some technical\nresults on indiscernible sequences which are quite interesting on their own. In\nSection 3 we prove a proposition (Proposition 3.3) which provides a \"consistent\"\nway to extend indiscernible sequences in an arbitrary theory. Specifically, in the\nproofs in Section 4 we are sometimes faced with the following situation: a sequence\nI is indiscernible over various subsets of a set B, but not (necessarily) over B, and\nwe would like a uniform way of extending I to a longer sequence with the same\nproperties. If the theory is assumed to be dependent (and I is unbounded) one can\njust take the average type of I over B. However, we are not assuming dependence,\nand it seems of independent interest to find a general technique allowing this (and\nmore) in an arbitrary theory. Here Shelah's general notion of average type with\nrespect to an ultrafilter comes in handy.\n1.1. Structure of the paper. We begin Section 2 with definitions, characterizations, and basic properties. Then we proceed to a few examples, which point out\nwhat one can and can not expect from dp-rank.\nIn Section 3 we develop a consistent way of extending mutually indiscernible\nsequences, which serves us in Section 4.\nIn Section 4 we will prove the main result of the paper, the sub-additivity of the\ndp-rank. We start with the dp-minimal case, then proceed to types of finite rank,\nand finally the infinite case. There was no need, in fact, to give a separate proof for\ndp-minimal types: the general finite case can be easily modified to include rank 1 as\nwell. However, the proof for dp-minimal types is much less involved, so we include\nit in order to exemplify the general principles that are used, and then proceed to\nthe finite case by induction. The proof for infinite ranks is different, but easier –\ninfinite combinatorics is more flexible, and calls for much less precise computations.\nWe conclude the section with some corollaries, such as global bounds on alternation\nranks of formulas.\nIn Section 5 we discuss what is known about the relation between VC-density\nand dp-rank. Theorem 5.4 summarizes all the main equivalent ways of looking at\ndp-rank. We also pose a few questions and set up a framework for future work.\nThroughout the paper, we will work in a monster model of an arbitrary first\norder theory T . In particular, although the main object of study is a \"dependence\nrank\", at no point do we assume that T is dependent.\nWe will not distinguish between singletons and finite tuples in the notation. For\nexample, when writing φ(x), or \"a is in the sort of x\", if not specified otherwise, x\nand a could be tuples.\n2. Dp-rank: definitions and basic properties\nWe begin with the definition of the main notion investigated in this paper.\nDefinition 2.1. Let p(x) be a partial (consistent) type over a set A. We define\nthe dp-rank of p(x) as follows.\n• The dp-rank of p(x) is always greater or equal than 0. Let μ be a cardinal.\nWe will say that p(x) has dp-rank ≤ μ (which we write rk-dp(p) ≤ μ)\nif given any realization a of p and any 1 + μ mutually A-indiscernible\nsequences, at least one of them is indiscernible over Aa.\n\n\fADDITIVITY OF THE DP-RANK\n\n5\n\n• We say that p has dp-rank μ (or rk-dp(p) = μ) if it has dp-rank ≤ μ, but\nit is not the case that it has dp-rank ≤ λ for any λ < μ.\n• We call p dp-minimal if it has dp-rank 1.\n• We call p dependent if dp-rank of p exists, that is, if it is an ordinal. In\nthis case we write rk-dp(p) < ∞. Otherwise we write rk-dp(p) = ∞.\n• We call p strongly dependent if rk-dp(p) ≤ ω.\nRemark 2.2. It may seem that dp-rank of p depends on the set A; however, we\nwill see in Remark 2.7 below that this is not the case. Hence all the notions in\nDefinition 2.1 above are well defined.\nThe following is easy and standard.\nRemark 2.3. The following hold for any (partial) type p(x) and a set A.\n(i) p has dp-rank 0 if and only if it is algebraic.\n(ii) p is dependent if and only if the rk-dp(p) ≤ |T |+ .\n(iii) If p is a type over a set A, and p′ is a type over a set B ⊇ A that extends\np, then rk-dp(p′ ) ≤ rk-dp(p).\nIn particular, if p is dp-minimal, then any extension of it is either dp-minimal or\nalgebraic.\nDefinition 2.1 is a nice semantic characterization of the notion of dp-rank. We\nfind it more convenient for the purposes of this paper than the syntactic definition\nin [8]. It is also much easier to grasp, in case one is unfamiliar with the concept.\nHowever, when working with formulas, it is useful to have a more syntactic notion,\nand we would like to prove that our \"soft\" characterization is equivalent to the\noriginal one. In case the reader is unwilling to deal with technical concepts, it is\npossible to skip the following definition and Proposition 2.6 in the first reading.\nThese will not be used almost at all in the main body of the paper (Sections 3 and\n4), but they are key for understanding important characterizations of dp-rank in\nthe finite case and the connection to VC-density (Proposition 2.8 and Section 5),\nas well as the fact that dp-rank of a type does not depend on the set over which it\nis calculated.\nThe following definitions were motivated by the original definition of strong\ndependence by Shelah (see e.g. [12]) and appear in [14] and [7].\nDefinition 2.4. A randomness pattern of depth κ for a (partial) type p(x) over\na set A is an array hbα\ni : i < ωiα<κ and formulae φα (x, yα ) for α < κ such that:\nα\n(i) the sequences I α = hbα\ni ii<ω are mutually indiscernible over A; that is, I\n6=α\nis indiscernible over AI ,\n(ii) length(bα\ni ) = length(yα ),\n(iii) for every η ∈ κ ω, the set\nα\nΓη = {φα (x, bα\nη )}α<κ ∪ {¬φα (x, bi )}α<κ,i<ω,i6=η(α)\n\nis consistent with p.\nWe will omit A if it is clear from the context.\nThe following is standard.\nLemma 2.5. Let p be a (partial) type over a set A. Then there is a randomness\npattern of depth κ over A if and only if there exists an array hbα\ni : i < ωiα<κ and\nformulae φα (x, yα ) for α < κ that satisfy clauses (ii) and (iii) of Definition 2.4.\n\n\f6\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nProof. Without loss of generality A = ∅ (note that A contains the domain of p).\nGiven an array satisfying clauses (ii) and (iii) of Definition 2.4, we may assume by\nα\ncompactness that the all the κ sequences hbα\ni i are as long as we wish, hbi : i < λi\nfor λ arbitrarily big. Applying Ramsey's Theorem and compactness, one obtains\nnew sequences for which clause (i) of the definition of a randomness pattern holds\nas well.\n\u0003\nOne consequence of the Lemma is the following: let p be a type, and let A, B\nbe sets, both containing the domain of p. Then there is a randomness pattern of\ndepth κ for p over A if and only if there exists such a pattern over B.\nIn [8] we defined dp-rank of a type p(x) as the supremum of all κ such that there\nis a randomness pattern of depth κ for p(x). The following Proposition shows that\nDefinitions 2.1 above are equivalent to the original ones.\nThe first appearance of any such equivalence appeared for the dp-minimal case\nin Lemma 1.4 of [13]. We do not know that anyone has generalized this even for\nfinite dp-ranks (or randomness patterns of finite depth).\nProposition 2.6. The following are equivalent for a complete type p(x) over A.\nNotice that κ below may be a finite cardinal.\n(i) There is a randomness pattern of depth κ for p(x) over A.\n(ii) It is not the case that the dp-rank of p(x) is less than or equal to κ.\n(iii) There exists a set I := {I j } := {haji ii∈I | j ∈ κ} of κ infinite mutually\nindiscernible sequences over A, and a realization c of p(x) such that for all\nj there are i1 , i2 such that tp(aji1 /Ac) 6= tp(aji2 /Ac).\nProof. The proof of the equivalence of (ii) and (iii) in [13] works exactly for the\ngeneral case. Also, it is clear that (i) implies (iii).\nAssume (iii) and we will prove (i). Let Ij := haji i and we will assume that\nall such I j are indexed by Z, and let φj be the formula such that φj (c, ai1 ) and\n¬φj (c, ai2 ) holds.\nClaim 2.6.1. If {i | φj (c, aji )} is both coinitial and cofinal, then there is a subsequence I0j of I j such that (after re-enumerating the elements) I0j := ha0,j\ni ii∈Z and\n0,j\nj\n¬φ (c, ai ) holds if and only if i = 0.\nProof. The construction of I0j is immediate from the definition.\n\n\u0003\n\nNotice that if in every sequence I j we have that either {i | φj (c, aji )} or {i |\n¬φj (c, aji )} is coinitial and cofinal, then we can replace I j by the subsequence I0j\nand (replacing φj (x, y) for ¬φj (x, y) if necessary) we would have an instance of (i).\nNow, if for some j we have that both {i | φj (c, aji )} and {i | ¬φj (c, aji )} are not\ncoinitial and not cofinal, then we have that, for example, {i | φj (c, aji )} is coinitial\nand {i | ¬φj (c, aji )} is cofinal. In this case, if we define φj0 := φj (x, y1 ) ∧ ¬φj (x, y2 )\nand I0j as a sequence haj2i , aj2i+1 ii∈Z , we would preserve the mutual indiscernibility,\nwe would have instances of both φj0 (c, aj2i , aj2i+1 ) and ¬φj0 (c, aj2i , aj2i+1 ), and {i |\n¬φj (c, aj2i , aj2i+1 )} would be coinitial and cofinal. Applying the claim to all such\nsequences we would have an instance witnessing (i).\n\u0003\n\n\fADDITIVITY OF THE DP-RANK\n\n7\n\nRemark 2.7. It follows from Lemma 2.5 and the equivalence of (i) and (ii) in\nProposition 2.6 that dp-rank of a type does not depend on the set A over which it\nis computed. In other words, the notion rk-dp(p) in Definition 2.1 is well-defined.\nIn the finite rank case, we can prove another characterization of dp-rank, in\nterms of a natural generalization of the notion of alternation rank. Given a formula\np(x)\nφ(x, y), we define the p-alternation rank of φ(x, y) over A as follows: altA (φ(x, y)) ≥\nk if there exists an A-indiscernible sequence I and c |= p such that the truth value\nof φ(c, y) has k alternations in I. The p-alternation rank of φ(x, y) over A is the\np(x)\nmaximal k (if exists) such that altA (φ) ≥ k. As usual, if p ∈ S(A), we may omit\nA.\nProposition 2.8. The following are equivalent for a partial type p(x) over A and\nk < ω:\n(i) rk-dp(p) ≥ k.\n(ii) There exists a formula φ(x, y) and an A-indiscernible sequence I in the\nsort of y such that for every subset I ′ ⊆ I of size k, there is a c |= p such\nthat φ(c, y) ∩ I = I ′ .\np(x)\n(iii) There exists a formula φ(x, y) such that altA (φ(x, y)) ≥ 2k.\nAll the indiscernible sequences in the Proposition are presumed to be infinite.\nNotice also that what (ii) is essentially saying is that every k-tuple in I is φ(c, y)definable for some c |= p.\nProof. (i) =⇒ (ii). We will use the syntactic definition here. If rk-dp(p) ≥ k, then\nby Proposition 2.6 there is a randomness pattern of depth k for p(x); that is, there\nare c |= p, formulas φ1 (x, y1 ), . . . , φk (x, yk ) and A-mutually indiscernible sequences\nIi = haij : j < ωi in the sort of yi (for i = 1, . . . , k), such that for every j1 , . . . , jk\nthere is c = cj1 ,...,jk |= p such that φi (c, aij ) if and only if j = ji .\nWk\nLet φ(x, y1 . . . yk ) = i=1 φi (x, yi ), and let I be an A-indiscernible sequence in\nthe sort of y1 . . . yk defined as follows: I = haj : j < ωi, where aj = a1j . . . akj .\nChoose arbitrary k distinct indices j1 , . . . , jk . It is easy to see that c = cj1 ,...,jk\nis a realization of p such that φ(c, aj ) if and only if j ∈ {j1 , . . . , jk }, as required in\n(ii).\n(ii) =⇒ (iii) is trivial.\n(iii) =⇒ (i). Let I be an A-indiscernible sequence and c |= p such that φ(c, y)\nhas ≥ 2k alternations in I. We may assume that the number of alternation is finite,\nand in fact equal to 2k. We prove by induction on k the following claim:\nClaim. If I is an A-indiscernible sequence of order type Q, and φ(c, y) has 2k\nalternations in I, then there is a randomness pattern (I α , φα ) of depth k for tp(c/A)\nwith I α being segments of I, and φα = φ or φα = ¬φ for all α.\nThe base case k = 0 is trivial. So now given I = haq : q ∈ Qi and c as in the\nclaim, since the order type of I is Q, there is an infinite initial segment on which\nφ(c, y) is constant; assume for example that φ(c, y) holds, and let r ∈ R be the\nminimal cut such that for any q > r, the truth value of φ(c, y) has changed signs\ntwice in the interval (−∞, q). Let q > r be such that φ(c, aq ) holds, and there is\nno sign change between r and q. Let I 0 = ha<r i⌢ ha(r,q) i and φ0 = φ. Notice that\n\n\f8\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nby indiscernibility and compactness, given any ai ∈ I 0 the type\n^\nφ(x, aj )\n¬φ(x, ai ) ∧\nj∈I 0 \\{ai }\n\nis consistent.\nBy the induction hypothesis, since the order type of I>q = ha>q i is still Q, and\nsince I>q has at least 2k − 2 alternations of φ(c, y), we can find a randomness\npattern {I α }, {φα } for c over A, for α = 1, . . . , k − 1 and I α segments of I>q . Now\nclearly {I α }kα=0 are mutually A-indiscernible (since they are all segments of the\nsame A-indiscernible sequence), and it is easy to see that {I α }α≤k , {φα }α≤k is a\nrandomness pattern for c over A of depth k.\nThis finishes the proof of the claim, and the theorem.\n\u0003\nCorollary 2.9. Assume that in a theory T every type p(x) over ∅ in the sort of x\nhas dp-rank ≤ k. Then for every formula φ(x, y), the alternation rank of φ(x, y) is\nbounded by 2k + 1.\nProof. If alt(φ(x, y)) ≥ 2k + 2, then there is an indiscernible sequence in the sort\nof y and some c in the sort of x, that witness this. By (iii) ⇒(i) in Proposition 2.8,\nrk-dp(tp(c/∅)) ≥ k + 1.\n\u0003\nWe conclude this section with a a few examples that illustrate things which can\nnot be expected from dp-rank. We will leave some of the technical details of the\nexamples to the reader.\n2.1. Theory of dp-rank 2 with no dp-minimal types. As we mentioned above,\none might be drawn to think that all the study of theories of finite dp-rank (theories\nwhere all dp-ranks are finite) can be reduced to dp-minimal types. This, however\nis not the case.\nExample 2.10. Consider the theory of an infinite set with two dense linear orders\n<1 and <2 , and take the model completion of it. This is, the theory of a structure\nM in L := {<1 , <2 } such that any finite formula consistent with <1 and <2 being\ndense linear orders is realized in M .\nEvery one type has dp-rank 2, and there are no dp-rank 1 types:\nFirst of all, the model completion exists and by definition it is complete and\nhas elimination of quantifiers in the language L := {<1 , <2 }, so tp(a/A) can be\nunderstood by formulas of the form x <1 a, x <2 a, and x = a for suitable choices\nof a ∈ A.\nIt is not hard to show now that given any set A, any 1-variable type p(x) ∈ S(A)\nhas dp-rank 2. Given any such set and type, it is enough to find mutually Aindiscernible sequences hai i and hbj i such that for every k, l we have:\n• The set\np(x) ∪ {x >1 ai }i≤k ∪ {x <1 ai }i>k ∪ {x >2 bj }j≤l ∪ {x <2 bj }j>l\nis consistent.\nFor this, it is enough to find for every m < ω, sequences hai i and hbj i for i, j < m\nsuch that for every k, l < m we have:\n\n\fADDITIVITY OF THE DP-RANK\n\n9\n\n• The set\np(x) ∪ {x >1 ai }i≤k ∪ {x <1 ai }i>k ∪ {x >2 bi }i≤l ∪ {x <2 bj }j>l\nis consistent.\nSuch ai and bj can be found by the definition of a model companion.\nThis implies that every type in this theory has dp-rank at least 2, and in particular that there are no dp-minimal types. On the other hand, it is easy to see that\nno one-type (over any set) has dp-rank bigger than 2.\n2.2. Type of dp-rank ω in a theory with types of finite weight. People have\nasked whether or not strong dependence was equivalent to every type having finite\ndp-rank, in the same way that a stable theory is strongly dependent if and only if\nevery type has finite weight (some people asked this for Adler's notion of burden\n[1], which is essentially the same question). Specifically, the question is whether or\nnot it is possible to have randomness patterns of arbitrarily large finite depths but\nno randomness pattern of infinite depth for a given complete type p(x) (once one\nforgets the type and just asks whether there is a strongly dependent theory with\narbitrarily deep randomness patterns, the question becomes much easier).\nThe following provides an example that the above is possible even in stable\ntheories.\nLet\nS := {(m, n) ∈ N × N | m < n}\nand let <S (which we sometimes denote simply by < for simplicity) be the partial\norder on S defined by (m1 , n1 ) <S (m2 , n2 ) if and only if n1 < n2 .\nIf s = (m, n), we say that s is of level n, and write lev(s) = n. Note that s ≤ t\nif and only if s is of a smaller level than t (or s = t). So s 6= t are incomparable if\nand only if they are of the same level. Hence there are finitely many t's which are\nincomparable to a given s – in fact, the number is exactly the lev(s).\nSo we have:\nObservation 2.11. The following hold for (S, ≤S ).\n(i) For any s ∈ S there are finitely many s′ ∈ S which are not greater than s.\n(ii) For any n ∈ N there exists s1 , . . . , sn ∈ S such that si is incomparable to\nsj for all 1 ≤ i 6= j ≤ n.\nNow consider the theory T∀ in the language L := {Es }s∈S which states that all\nEs are equivalence relations and for any s ≤S t we have\n∀x, y, xEs y ⇒ xEt y.\nLet T be the model completion of T∀ , so in particular it is a complete theory\nwith elimination of quantifiers.\nT is axiomatized by the following axioms. In order to make things more uniform,\nlet us refer to equality as the unique s of level -1.\n• Every class of every Es for s ∈ S is infinite.\n• Every Es has infinitely many classes.\n• Whenever −1 ≤ n < m, lev(s) = n, lev(t1 ) = lev(t2 ) = . . . = lev(tk ) = m,\nAi is an equivalence class of Eti (for i = 1, . . . , k), then ∩ki=1 Ai contains\ninfinitely many classes of Es .\n\n\f10\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nEven without proving the existence of the model completion, one can show directly, given the above axioms and using a standard back and forth argument, that\nT is a complete theory with elimination of quantifiers.\nClaim 2.12. T is א0 -stable.\nProof. For every (non-generic) type p over a countable model M , let lev(p) be the\nleast n, such that there exists a ∈ M and s of level n, such that the formula xEs a\nis in p. Since this determines which Et classes p \"chooses\" for s < t, there are\nonly finitely many equivalence relations left to \"settle\" – specifically, all those Et\nfor which s 6< t (see Observation 2.11 above). It follows (by quantifier elimination)\nthat there are countably many types of each given level n. Since there are countably\nmany levels, we are done.\n\u0003\nWe can now show that T is an example of a theory with non finite dp-rank and\nno randomness pattern of depth ω for the unique type p(x) over the empty set.\nTheorem 2.13. For any element c and any natural number n, one can find I\nsuch that I is a set of n mutually indiscernible sequences (over ∅) none of which is\nindiscernible over c. However, no such example can be found with I infinite.\nProof. Let n be a natural number, and let s1 , . . . , sn be incomparable elements of\nS of level n (see Observation 2.11). By the axioms of T we can find I1 , . . . , In\nmutually indiscernible sequences of singletons with the following properties:\n• Elements of Ii are Esj -equivalent if and only if j 6= i,\n• c is Esi -equivalent to the first element of Ii for all i.\nClearly, none of the Ii 's is indiscernible over c, as required.\nOn the other hand, by Claim 2.12, T is superstable, hence strongly dependent\n(this is very easy to see directly, but see [12]). So there is no infinite randomness\npattern for any type in any model of T . (Alternatively, using quantifier elimination,\none can easily give a direct proof that there is no infinite randomness pattern.) \u0003\nRemark 2.14. In a similar fashion, one constructs an example of a theory which\nis not superstable, but still strongly dependent, with a type of dp-rank ω. This is\ndone by switching the \"nesting order\" of the equivalence relation in the example\nabove; that is, we demand in the universal theory that for s ≤S t we have\n∀x, y, xEt y ⇒ xEs y.\nHere one has to give a direct argument as to why there is no infinite randomness\npattern; but this quite straightforward, using quantifier elimination, and we leave\nit to the reader.\nRecall that in a strongly stable theory (strongly dependent and stable) every\ntype has finite weight ([1, 14]). However, in both examples discussed above, the\nunique (non-algebraic) type over ∅ has dp-rank ω. So we have two examples of\ntheories where every type has finite weight but there are no non algebraic types of\nfinite dp-rank over ∅. In fact, the generic type over any set will also have dp-rank\nω by a similar argument. In the example discussed in Remark 2.14 the situation\nis even more extreme, because almost all types have infinite dp-rank (besides the\nalgebraic and the strongly minimal ones).\n\n\fADDITIVITY OF THE DP-RANK\n\n11\n\n3. Extending indiscernible sequences\nSince the main definition of the paper involves mutually indiscernible sequences,\nit would be nice to have certain tools for handling such \"independent arrays\". Specifically, we would like to have a \"consistent\" way of extending indiscernible sequences.\nOur technique will make use of Shelah's notion of average types with respect to ultrafilters, which provides a way of constructing co-heir extensions. In spite of its\nusefulness, this notion does not yet seem to be widespread in the model theoretic\ncommunity.\nFirst, we recall the following easy observation.\nFact 3.1. Given a set A and an infinite indiscernible sequence I = hai : i ∈ Ii over\nA, there exists a unique complete type p over AI such that if a |= p, then I ⌢ hai is\nindiscernible over A.\nThis fact provides a natural and standard way to extend indiscernible sequences.\nHowever, it will not always be good enough for us, since, as mentioned in the introduction, we will need to extend sequences preserving indiscernibility over different\nsubsets.\nThis is why the definition of average types from Shelah becomes useful:\nDefinition 3.2. Let I = hai i be an indiscernible sequence and U an ultrafilter on\nthe index set of I. Given any set B we will define AvgU (I, B), the average type of\nI over B given by U, as the unique complete type p(x) such that for every formula\nφ(x, y) and b ∈ B we have\nφ(x, b) ∈ p(x) ⇔ {i | φ(x, ai )} ∈ U.\nThis definition will allow us to prove the following. The proof requires some\nknowledge of ultrafilters.\nProposition 3.3. Let I be an indiscernible sequence indexed by an order with\nno last element, and let B be any set. Then, for any indexing set λ, there is\nan indiscernible sequence I ∗ indexed by λ such that I ⌢ I ∗ is indiscernible over A\nwhenever A ⊆ B is a set such that I was already indiscernible over A.\nProof. We will prove the result for any finite I ∗ . The general case follows by\ncompactness.\nIf we take U to be an ultrafilter over I such that every set in U is unbounded in I,\nit follows from the definition that for any A such that I is indiscernible over A and\nany a0 |= AvgU (I, AI) we have I ⌢ hai is indiscernible over A. Since the definitions\nimply that AvgU (I, BI) extends AvgU (I, AI) for any such A ⊂ B, any realization\na0 of the type p(x) := AvgU (I, BI) will be such that I ⌢ ha0 i is indiscernible over\nA. Inductively, it follows from the properties of average types that if we let\nan+1 |= AvgU (I, BI ⌢ han , an−1 , . . . , a0 i)\nthen I ⌢ han+1 , an , an−1 , . . . , a0 i is an indiscernible sequence over A. This construction will therefore give us an indsicernible sequence I ′ , indexed by n, such that I ⌢ I ∗\nis indiscernible over any A over which I was indiscernible (for an arbitrarily large\nn); by compactness, given any indexing set λ, we can find an indiscernible sequence\nI ∗ indexed by λ such that I ⌢ I ∗ satisfies the conclusion of the proposition.\n\u0003\n\n\f12\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nProposition 3.3 is the only instance where we will use average types. If unwilling\nto think about ultrafilters, the reader can just assume the existence of a way to\nextend indiscernible sequences given by Proposition 3.3.\nCorollary 3.4. Let I and J be infinite mutually indiscernible sequences over A\nand let B ⊃ A. Let I ∗ be as in Proposition 3.3.\nThen I ⌢ I ∗ and J are mutually indiscernible over A.\nProof. It follows from Proposition 3.3 that I ⌢ I ∗ is indiscernible over AJ. Now, if\nJ was not indiscernible over I ⌢ I ∗ there would be a finite tuple ā⌢ b̄ with ā ∈ I and\nb̄ ∈ I ∗ such that J is not indiscernible over Aāb̄. Since I ⌢ I ∗ was indiscernible over\nAJ, and since I is infinite, we know that there are some ā′ , b̄′ ∈ I such that\ntp(ā′ b̄′ /AJ) = tp(āb̄/AJ).\nBut this would imply that J is not indiscernible over AI, contradicting our hypothesis.\n\u0003\n4. additivity of the dp-rank\nIn this section we will prove the (sub-)additivity of the dp-rank (Theorem 4.8),\nwhich is the main result of this paper.\n4.1. Warm up case: dp-minimal. The first technical lemma essentially deals\nwith sub-additivity for dp-minimal types. It will also form the induction base for\nthe general case. Although we could modify the proof of the general statement\nslightly so that it deals with rank 1 as well, we decided to include the simple base\ncase explicitly, since it exemplifies the general technique that we are using.\nLemma 4.1. Let a be any tuple such that tp(a/A) is dp-minimal, let B ⊃ A,\nand let I be a set of mutually B-indiscernible sequences. Then for any n, given\nany n + 1 mutually B-indiscernible sequences in I at least n of them are mutually\nindiscernible over Ba.\nProof. We will do an induction on n. Since any extension of a dp-minimal type is\ndp-minimal (or algebraic), if n = 1 there is nothing to prove.\nAssume now that I := {I1 , . . . , In+1 } is a set of mutually B-indiscernible sequences for B ⊃ A. By definition {I1 , . . . , In } are mutually indiscernible over\nBIn+1 so we can, by the induction hypothesis, find n − 1 of the Ij 's which are\nmutually indiscernible over BIn+1 a; we may assume without loss of generality that\n{I1 , . . . , In−1 } are\nS mutually indiscernible over BIn+1 a. If In+1 was indiscernible\nover {a} ∪ B ∪ {I1 , . . . , In−1 } the sequence {I1 , . . . , In−1 , In+1 } would satisfy the\nconditions of the claim, so we may assume that this is not the case. Since non\nindiscernibility can be witnessed by a finite sequence, we will assume\nS for the rest\nof the proof that In+1 is not indiscernible over Bab̄ for some b̄ ∈ {I1 , . . . , In−1 },\nand that {I1 , . . . , In−1 } are mutually indiscernible over In+1 Ba.\nClaim 4.1.1. It is enough to prove Lemma 4.1 under the assumption that In+1 is\nnot indiscernible over Ba.\nProof. For each k with 1 ≤ k < n we will inductively define a \"continuation\" Ik∗ of\nIk in the following way:\nSuppose we have picked Ij∗ for j < k, and define Ik∗ be a sequence indexed by ω\nSk−1\nSn\nas in Proposition 3.3 for I = I k and B = B ∪ i=1 Ii ∪ j=1 Ij∗ ∪ {a} so that given\n\n\fADDITIVITY OF THE DP-RANK\n\n13\n\nSn\nSk−1\nany subset A ⊆ B ∪ i=1 Ii ∪ j=1 Ij∗ ∪ {a}, the sequence Ik⌢ Ik∗ is indiscernible\nover A whenever Ik was indiscernible over A.\nIt follows from the construction and Corollary 3.4 that\n∗\n• {I1 ⌢ I1∗ , . . . , In−1 ⌢ In−1\n, In , In+1 } is a set of mutually B-indiscernible sequences,\n∗\n• {I1 ⌢ I1∗ , . . . , In−1 ⌢ In−1\n} is mutually indiscernible over In+1 Ba, and\nS\n• In+1 is not indiscernible over Bab̄ for some b̄ ∈ {I1 , . . . , In−1 }.\n\n∗\nSince the sequences in {I1 ⌢ I1∗ , . . . , In−1 ⌢ In−1\n} are mutually indiscernible over\nISn+1 Ba, there is an automorphism fixing In+1 Ba and sending b̄ to some b̄′ ∈\n∗\n{I1∗ , . . . , In−1\n}. Now we have\n\n• {I1 , . . . , In−1 , In , In+1 } is a set of B b̄′ -mutually indiscernible sequences,\n• {I1 , . . . , In−1 } is mutually indiscernible over In+1 B b̄′ a, and\n• In+1 is not indiscernible over Bb′ a,\n\nwhich, replacing B with B b̄′ , is precisely the conditions we started with plus the\nconclusion of the claim. Since any n-subset of mutually Bb′ a-indiscernible sequences\nof {I1 , . . . , In−1 , In , In+1 } would in particular be Ba-indiscernible, the claim is\nproved.\n\u0003\nNow the lemma follows almost immediately. Since {I2 , I3 . . . , In , In+1 } are mutually indiscernible over I1 B, there must, by induction hypothesis, be a subset of n−1\nmutually I1 Ba-indiscernible sequences. But such set cannot contain In+1 since, by\nhypothesis given in Claim 4.1.1, this sequence is not (by itself) indiscernible over\nBa. So {I2 , I3 . . . , In } are mutually indiscernible over I1 Ba. In exactly the same\nway we can prove that {I1 , I3 . . . , In } are mutually indiscernible over I2 Ba which\nin particular implies that I1 is indiscernible over B ∪ {I2 , I3 . . . , In } ∪ {a}. So\n{I1 , I2 , I3 . . . , In } are mutually indiscernible over Ba, as required.\n\u0003\nCorollary 4.2. (Sub-additivity of dp-rank for dp-minimal types) Let tp(ai /A) be\ndp-minimal for 1 ≤ i ≤ k. Then the dp-rank of tp(a1 . . . ak /A) is at most k.\nProof. By induction on k. For k = 1 there is nothing to do. Assume that the\nCorollary holds for all sets B and tuples of less than k dp-minimal (over B) elements.\nNow fix A and a1 , . . . , ak dp-minimal over A. Let I1 , . . . , Ik , Ik+1 be mutually\nindiscernible over A. By the lemma above, without loss of generality, I1 , . . . , Ik are\nmutually indiscernible over Aak , call it B.\nRecall that extensions of dp-minimal types have rank at most 1, so we may assume that a1 , . . . , ak−1 are dp-minimal over B. Hence by the induction hypothesis,\ndp-rank of the tuple a1 . . . ak−1 over B is at most k − 1. By definition, one of the\nsequences I1 , . . . , Ik is indiscernible over Ba1 . . . ak−1 = Aa1 . . . ak , which is exactly\nwhat we needed.\n\u0003\nRemark 4.3. Notice that in Claim 4.1.1 we did not assume that Ik is indiscernible\nover In ∪ {a}. That is, we know that Ik (for k < n) is indiscernible over BI6=k and\nover BI6=k,n a, but not necessarily BI6=k a. This (and the analogue issue in Lemma\n4.6) is the reason we could not work using just Fact 3.1, and decided to use the\nextensions described by Proposition 3.3.\n\n\f14\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\n4.2. The finite case. The following proposition, from which the main result of\nthis section will follow easily, is a generalization of Lemma 4.1.\nProposition 4.4. Let a be an element such that tp(a/A) has dp-rank at most k,\nand let I := {I1 , . . . Im } be mutually B-indiscernible sequences with m > k. Then\nthere is an m − k-subset of I of sequences which are mutually indiscernible over\nBa.\nTo prove Proposition 4.4, we rephrase the statement in a way that will allow us\nto do an easy induction. For this we will need to following definition.\nDefinition 4.5. Let I := {I1 , . . . Im } be mutually A-indiscernible sequences, and\nlet a be any tuple. We will say that the pair I, a satisfies Sk,n if the following\nconditions hold:\n• |I| ≥ k + n,\n• For any B ⊃ A such that I := {I1 , . . . Im } are still mutually indiscernible\nover B, given any n + k sequences in I at least n of them remain mutually\nindiscernible over Ba.\nSo in particular, with this notation, a type p(x) over A has dp-rank less than or\nequal to k if and only if for any realization a of p(x) and every set I of mutually\nindiscernible sequences where |I| > k, we have that I, a satisfies Sk,1 .\nWith this notation we can state a generalization of Proposition 4.4, the proof of\nwhich will admit a clear induction argument. We will start by proving the following\nanalogue of Claim 4.1.1.\nLemma 4.6. Let a be an element, and let I be a set of mutually A-indiscernible\nsequences. Let J be a subset of I and I ∈ I be such that J is mutually indiscernible\nover AIa and such that I is not indiscernible over AJ a. Then we can extend A to\na set B such that the following hold:\n• I is mutually indiscernible over B.\n• I is not indiscernible over Ba.\n• J is mutually indiscernible over Ba.\nProof. We will assume that J is finite, which is the case we need for Theorem\n4.8. However, the general case follows exactly in the same manner, using ordinal\nenumerations of the sequences in J and transfinite induction.\nWe can enumerate J := {J1 , . . . , Jn } and, as in the proof of Claim 4.1.1, define\na \"continuation\" Jt∗ := ha∗i ii∈ω for every sequence Jt ∈ J inductively (on t) having\nthat Jt⌢ Jt∗ is indiscernible over any\nC ⊆A∪\n\n[\n\nI∪\n\nt−1\n[\n\nJj∗ ∪ {a}\n\nj=1\n\nover which Jt was already indiscernible.\nBecause J was mutually indiscernible over AIa it follows from Corollary 3.4\nthat\n• {J1⌢ J1∗ , . . . , Jn⌢ Jn∗ }∪(I \\ J ) is a set of A-mutually indiscernible sequences,\n• {J1⌢ J1∗ , . . . , Jn⌢ Jn∗ , } is indiscernible over IAa,\nS and\n• I is not indiscernible over Aab̄ for some b̄ ∈ {J1 , . . . , Jn }.\nSince {J1⌢ J1∗ , . . . , Jn⌢ Jn∗ , } is indiscernible\nover IAa there is an automorphism\nS\nfixing IAa and sending b̄ to some b̄′ ∈ {J1∗ , . . . , Jn∗ }. Now we have\n\n\fADDITIVITY OF THE DP-RANK\n\n• I is a set of Ab̄′ -mutually indiscernible sequences,\n• {J1 , . . . , Jn } is indiscernible over IAb̄′ a, and\n• I is not indiscernible over Ab′ a.\nLetting B := Ab′ completes the claim.\n\n15\n\n\u0003\n\nProposition 4.7. Let a be an element, n be any natural number, and let I :=\n{I1 , . . . Im } be mutually A-indiscernible sequences with m ≥ k + n such that I, a\nsatisfies Sk,1 . Then I, a satisfies Sk,n .\nProof. Notice that we have already proved the result assuming k = 1. It is enough\nto show that Sk,n implies Sk,n+1 , and we will show this by induction on n (for a\nfixed k).\nSo let I be a set of m mutually B-indiscernible sequences, a be an element such\nthat I, a satisfies Sk,i for all 1 ≤ i ≤ n (so in particular, it satisfies Sk,n and Sk,1 )\nand let I ′ := {I1 , . . . Ik+n+1 } be a subset of I; we will prove that I ′ contains a\nsubset of size n + 1 of sequences which are mutually indiscernible over Ba.\nLet Ii be any sequence in I ′ . Since I ′ \\{Ii } is a set of n+k mutually indiscernible\nsequences over BIi , there is a subset Ii of size n which are mutually indiscernible\nover BIi a. If Ii is indiscernible over BIi a then we would have a set of size n + 1 of\nmutually indiscernible sequences over Ba and the proposition would be satisfied.\nSo we may assume towards a contradiction that for every i the sequence Ii is not\nindiscernible over BIi a.\nNow, for each i we apply Lemma 4.6 extending B until we get Ii not indiscernible\nover Ba for all i and I ′ are mutually indiscernible over B. This contradicts Sk,1 of\nI (and Sk,n too).\n\u0003\nThis completes the proof of Proposition 4.4.\nTheorem 4.8. Let a1 , a2 be tuples such that rk-dp(tp(ai /A)) ≤ ki for i ∈ {1, 2}.\nThen rk-dp(tp(a1 , a2 /A)) ≤ k1 + k2 .\nProof. Let I := {I1 , . . . , Ik1 +k2 +1 } be mutually A-indiscernible sequences. By\nProposition 4.4 applied to a1 , I, there is a subset I1 of I of size k2 + 1 of sequences which are mutually indiscernible over Aa1 . By definition of dp-rank of\ntp(a2 /Aa1 ), we get that there is a sequence I ′ ∈ I1 which is indiscernible over\nAa1 a2 . By definition of dp-rank, this completes the proof of the theorem.\n\u0003\nWe get the following corollary (compare with Corollary 4.12).\nCorollary 4.9. Let T be any theory.\nIf all the one variable types have finite dp-rank, then every type (with finitely\nmany variables) in the theory has finite dp-rank.\nIf all the one variable types have dp-rank ≤ k, then every type (with finitely many\nvariables) p(x) has dp-rank ≤ |x| * k.\nThe following follows immediately from Theorem 4.8 and Proposition 2.8.\nCorollary 4.10. Let T be any theory, and assume that all the one variable types\nhave dp-rank ≤ k. Then for every formula φ(x, y) we have alt(φ(x, y)) ≤ 2k|x| + 1.\nIn particular, if T is dp-minimal, then for every φ(x, y) we have alt(φ(x, y)) ≤\n2|x| + 1.\n\n\f16\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\n4.3. The infinite case. The proof of sub-additivity for the infinite case is in fact\nmuch easier than in the finite case.\nTheorem 4.11. Let I be a set of κ mutually indiscernible sequences over A and\na an element such that Sκ,1 holds for I, a. Then Sκ,κ holds for I, a. In particular\nfor any cardinal numbers κ, λ and any tuples a, b we have that\nrk-dp(ab/A) ≤ max(κ, λ),\nwhenever rk-dp(a/A) ≤ κ and rk-dp(b/A) ≤ λ.\nS\nProof. Let I, a be any pair satisfying Sκ,1 . We can partition I = α∈κ I α into a\ndisjoint union of κ many sets of κ many sequences. By\nS hypothesis we know that for\nany β the set I β are mutually indiscernible over A ∪ α6=β I α so by assumption we\nS\nhave that some sequence I β in I β is indiscernible over A ∪ α6=β I α ∪ {a}. Doing\nα\nβ\nthis for any\nS β ∈ κ we get a set of sequences {I }α∈κ such that I is indiscernible\nover A ∪ α6=β Iα ∪ {a} which by definition proves that I, a satisfies Sκ,κ . The rest\nof the proof follows exactly as in Theorem 4.8.\n\u0003\nSince this immediately implies that rk-dp(ab/A) ≤ ω whenever rk-dp(a/A) ≤ ω\nand rk-dp(b/A) ≤ ω, this theorem provides a very easy proof of the fact that\nstrong dependence (rk-dp(p(x)) ≤ ω for all p(x) or, equivalently, no randomness\npattern of depth ω) only needs to be verified in one variable. Summarizing, we get\nthe following (very) easy corollary, which was originally proved by Shelah in [12]\n(Observation 1.6).\nCorollary 4.12. A theory T is strongly dependent if and only if all the one variable\ntypes in T are strongly dependent.\nAlso, we get a dp-rank version of Shelah's theorem that T is dependent if and\nonly if the independence property cannot be witnessed by φ(x, y) with |x| = 1.\nRecall that a theory is dependent if and only if every type is dependent, that is,\nrk-dp(p(x)) ≤ |T |+ for any type p(x)2. So the following, which follows immediately\nfrom Theorem 4.11, is a new (and simpler) proof of Shelah's Theorem II.4.11 in [9].\nCorollary 4.13. A theory T is dependent (which is equivalent to every type being\ndependent) if and only if all the one variable types in T are dependent.\n5. VC-density\nRecent results by Aschenbrenner, Dolich, Haskell, Macpherson and Starchenko\n[2], show that in many of the well behaved dependent theories, the V C-density can\nbe calculated and, in many of the cases that they considered, it is linear. In this\nsection we define V C-density (or rather, a dual notion, which we call V C ∗ -density3),\nand discuss some connections between it and dp-rank.\nFor the sake of clarity, we introduce a few notations. Let p(x) be a type, and B\na set; we denote the set of all complete types over B which are consistent with p(x)\nby S p(x) (B). If φ(x, y) is a formula, or ∆(x, y) is a set of formulas, we can speak of\n2We are defining a type to be dependent depending of the behavior of the \"dual\" formula.\n\nReasons why this is the right notion can be found in Observation 2.7 in [7].\n3Given a family ∆(x, y), the V C ∗ -density will correspond to the V C-density of the family ∆\n∆\nafter we invert the roles of x and y.\n\n\fADDITIVITY OF THE DP-RANK\n\n17\n\nφ(x, y)-types, or ∆(x, y)-types (over B) consistent with p(x); these will be denoted\np(x)\np(x)\nby Sφ and S∆ , respectively.\nWe also remind the reader of some basic notation for asymptotic behavior of\nfunctions. Let f, g : N → R+ . We write that f = O(g) if for some constant r > 0\nfor any n large enough we have f (n) ≤ r * g(n).\nRecall that if f is a polynomial function, its order of magnitude is completely\ndetermined by its degree. That is, if f, g are polynomials, then f = O(g) if and\nonly if deg(f ) ≤ deg(g).\nDefinition 5.1. Let C be a large, saturated enough, model of T , let ∆(x, y) be a\nfinite set of formulas in the language of T , and let p(y) be a (partial) type over a\nset of parameters in C. The V C ∗ -dimension of p(y) with respect to ∆ is greater\nthan or equal to n if there is a set A of size n such that, for any A0 ⊂ A there is\nsome b |= p(y) and some δ(x, y) ∈ ∆ such that for any a′ ∈ A, we have\nC |= δ(a′ , b) ⇔ a′ ∈ A0 .\nWhenever this happens we will say that ∆ shatters A with realizations of p(y).\nWe will say that the V C ∗ -dimension of p(y) with respect to ∆ is n if the V C ∗ dimension is greater than or equal to n, but not greater than or equal to n + 1.\nNotice that if ∆ shatters a set A with respect to p(y) ∈ Sk (B), then every subset\nof A is (externally) definable as\nδ(C, b) ∩ A\nwhere b varies among realizations of p(y) (and δ ∈ ∆). If ∆ is a singleton (this\nis, if there is a single formula δ(x, y) in ∆) this is of course equivalent to saying\nthat p(y) is consistent with 2|A| different ∆-types over A. So, if instead of counting\nsubsets we count types, we will get a notion that, although it is not exactly the\nsame as V C ∗ -dimension when ∆ is not a singleton, it is closely related to this\np(y)\nnotion (particularly asymptotically). Recall that by S∆ (A) we denote the set of\nall ∆-types over A consistent with p(y). With this notation, we can look for the\nlargest n such that there is some set A of size n such that\np(y)\n\n|S∆ (A)| ≥ 2|A| .\nWe are slowly getting to the notion of V C-density that we will work with. It\nwas proved (apparently independently by Sauer, Shelah, and Vapnik-Chervonenkis)\nthat if the V C ∗ -dimension of ∆ with respect to p(y) is equal to d, then, for any\nA of size greater than d, the number π(∆,p) (A) of subsets of A externally definable\nwith realizations of p, satisfies\n\u0012 \u0013\n\u0012 \u0013\n|A|\n|A|\nπ∆,p (A) ≤\n+ ***+\n.\n0\nd\np(y)\n\nNow, |S∆ (A)| is bounded by |∆| times π∆,p (A). This implies that when the\nV C ∗ -dimension of ∆ with respect to p is d, then each formula in ∆ can define (using\nparameters in p), at most O(|A|d ) externally definable sets of A. It follows that if\nwe vary A among increasing subsets of an infinite set, we get polynomial growth\np(y)\nof the number of ∆-types |S∆ (A)| over A, and a very natural question to ask is\nwhether d is the best bound on the degree of the polynomial. This prompts the\n\n\f18\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\nfollowing definition of V C ∗ -density of a type. We will define (adapting the notions\n∗\nin [2]) the V C∆\n-density of a type p(y) over a set C to be\np(y)\n\ninf{r ∈ R≥0 | |S∆ (A)| = O(|A|r ) for all finite A ⊆ C |y| }.\nWhat we formally mean by this is that there exists a function f : N → R+ such\np(y)\nthat f = O(nr ), and | S∆ (A)| ≤ f (|A|) for all A ⊆ C finite.\nIf in the definition above A is allowed to range over all finite sets (that is, C = M\n∗\nfor some M |= T saturated enough), we omit \"over C\", and simply say \"V C∆\n-density\nof p\".\nUsing our present notation, Proposition 2.8 implies that if rk-dp(p(y)) ≥ k, then\nthere exists a formula φ(x, y) and an indiscernible sequence I in the sort of y, such\n\u0001\np(y)\nthat |Sφ (I ′ )| ≥ nk for every I ′ ⊆ I of size n ≥ k. This of course means that\nV Cφ∗ -density of p(y) is at least k. In order to make this connection between dp-rank\nand V C ∗ -density more precise, we state the following proposition.\nRecall (Proposition 2.6) that rk-dp(p) ≥ k if and only if there is a randomness\npattern Iα , φα of depth k for p. Below we will say that rk-dp(p) ≥ k is witnessed\nby formulas in ∆ (where ∆ is a set of formulas) if all φα are in ∆.\nProposition 5.2. Let p(y) be a type over A and ∆ be a set of formulas which is\nclosed under boolean combinations. Then the following are equivalent.\n(i) rk-dp(p) ≥ k, witnessed by formulas in ∆.\n(ii) There is an A-indiscernible sequence I and some formula φ(x, y) ∈ ∆ such\nthat p(x) has V Cφ∗ -density at least k over I.\n(iii) There is an A-indiscernible sequence I and some formula φ(x, y) ∈ ∆ such\nthat p(x) has V C ∗ -density bigger than k − 1 with respect to φ(x, y) over I.\nProof. (i) =⇒ (ii) by Proposition 2.8, as explained above (note that the formula\none gets in Proposition 2.8 is a boolean combination of ∆-formulas, hence is itself\nin ∆), and (ii) =⇒ (iii) is trivial.\n(iii ) =⇒ (i).\np(y)\nLet f : N → N be the following function: f (n) = |Sφ (I ′ )| for some/every I ′ ⊆ I\nof size n. It follows from the assumption that f is not O(nk−1 ). This means that\nfor every r > 0 there is n such that f (n) > r * nk−1 .\nWe may assume that the order type of I is R (indeed, all we need is to keep\np(y) ′\n|Sφ (I )| for all I ′ ⊆ I finite). We write I = har : r ∈ Ri.\nIn order to continue, we will need the following definition. Given some c |= p,\nan element r ∈ R will be defined to be a \"switch point in I for c\" if there is some\nǫ ∈ R such that either\nφ(c, ar−δ ) ⇔ ¬φ(c, ar )\nfor all δ < ǫ, or\nφ(c, ar+δ ) ⇔ ¬φ(c, ar )\nfor all δ < ǫ.\nClaim 5.2.1. There is some c |= p for which there are at least k switch points in I.\nProof of the claim: Assume this is not the case. Let I ′ ⊆ I finite, denote n =: |I ′ |.\np(y)\nLet q ∈ Sφ (I ′ ), c |= q. Below we refer to a cut of I ′ (by which we mean either an\nelement of I ′ or an interval between two adjacent elements in I ′ ) as a \"switch cut\nfor c in I ′ \", if the interval it induces in I contains a switch point of c in I. Note\n\n\fADDITIVITY OF THE DP-RANK\n\n19\n\n\u0001\nthat there are 2n + 1 cuts in I ′ , hence at most 2n+1\nk−1 choices for possible sequences\nof switch cuts (by the assumption towards contradiction).\nNotice that q is completely determined by knowing (1) the switch cuts for c in\nI ′ , (2) what are the signs of φ(c, y) of different segments between the switch cuts\u0001\nof c in I ′ , and (3) the sings of the cuts themselves. Since there are at most 2n+1\nk−1\nchoices for possible sequences of switch cuts, at most 2k possible sequences of signs\non the segments between the switch cuts, and at most 2k−1 possible signs for the\n′\n′ k−1\nswitch cuts, we would get that | Sp(y)\n) for all I ′ , contrary to the\nφ (I )| = O(|I |\nassumption. \u0003\nLet c |= p be such that there are at least k switch points in c. We can then\nchoose increasing indices q0 , . . . , q4k−1 in Q such that for all i < k the following\nhold:\n• The closed R-interval [q4i , q4i+1 ] contains a switch point, and |= φ(aq4i , c) ↔\n¬φ(aq4i+1 , c), and\n• the open R-interval (q4i+1 , q4(i+1) ) does not contain a switch point so that\nin particular |= φ(aq4i+2 , c) ↔ φ(aq4i+3 , c).\nNow, let J be the sequences of pairs of I\nJ = haq2i , aq2i+1 : i < 2ki,\nand let ψ(x1 , x2 ; y) be the formula φ(x1 , y) ↔ φ(x2 , y).\nClearly, J is an A-indiscernible sequences and since ∆ is closed under boolean\np(y)\ncombinations, ψ(x1 , x2 , y) ∈ ∆. Finally, by construction altA (ψ) is at least 2k\nwitnessed by J, so by Proposition 2.8, we have rk-dp(p) ≥ k, witnessed by ψ ∈ ∆,\nas required.\n\u0003\nRemark 5.3. Notice that we needed to define switch points, of which at first there\nmay seem to be as many as the alternation rank. But there is the subtle issue that\n\"isolated points\" only count as one switch point, even though they contribute to\ntwo for the alternation rank. In fact, by changing the sequence and the formula, we\nmanage to ensure that all those \"switch points\" happen on \"isolated\" points (now\npairs), each of which then contributes two alternations, hence obtaining alternation\nrank 2k.\nProposition 5.2 explains why in the example of non-integer V C-density presented\nin [2] one has to work over sets that are not indiscernible, and why over indiscernible\nsequences V C-density becomes an integer: in this case, V C-density simply equals\nthe appropriate dp-rank.\nWe now combine Propositions 2.6, 2.8, and 5.2, and summarize all the main\ncharacterizations of finite dp-rank that we have shown in this article.\nTheorem 5.4. The following are equivalent for a type p(y) over a set A:\n(i) rk-dp(p) ≥ k.\n(ii) There is a randomness pattern of depth k for p(x) over A.\n(iii) There is a formula φ(x, y) and an A-indiscernible sequence I in the sort\nof x such that the V Cφ∗ -density of p over I is at least k.\n(iv) There is a formula φ(x, y) and an A-indiscernible sequence I in the sort\nof x such that the V Cφ∗ -density of p over I is bigger than k − 1.\n\n\f20\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\n(v) There is a formula φ(x, y) and an A-indiscernible sequence I in the sort\nof x such that for every I ′ ⊆ I of size k there exists c |= p satisfying\nφ(x, c) ∩ I = I ′ (that is, every subset of I of size k is externally φ(x, y)definable by a realization of p).\np(y)\n(vi) There is a formula φ(x, y) with altA (φ) ≥ 2k.\nOne may obtain a more precise (but also more technical) version of the theorem\nby restricting to a set of formulas ∆ closed under boolean combinations, as in\nProposition 5.2.\nRemark 5.5. In the proof of (iii) =⇒ (i) in Proposition 5.2 we only needed that\np(y)\n|Sφ (I ′ )| is not O(|I ′ |k−1 ), whereas the assumption gives more: not O(|I ′ |s ) for\nsome s > k − 1. Along this line, we note that using clause (v) in Theorem 5.4, one\ncan deduce that the following statements are also equivalent to rk-dp(p) ≥ k. The\nstatements are more technical, but the equivalences are stronger.\np(y)\n\n(1) There is φ(x, y) and I such that |Sφ (I ′ )| = Ω(|I ′ |k ) for I ′ finite.\np(y)\n(2) There is φ(x, y) and I such that |Sφ (I ′ )| = ω(|I ′ |k−1 ) for I ′ finite.\np(y) ′\n(3) There is φ(x, y) and I such that |Sφ (I )| is not O(|I ′ |k−1 ) for I ′ finite.\nWhere f = Ω(g) means g = O(f ), whereas f = ω(g) means that f strictly dominates g up to any multiplicative constant, that is, for every constant r > 0 we have\nf (n) > r * g(n) for all n large enough.\nNote that in order to go from (3) to (1) one may need to change the formula\nand the indiscernible sequence (just like in the equivalence of (iv) and (v) in the\ntheorem), and this is crucial. One may ask whether similar statements hold with\nthe same formula and sequence. We have not given it much thought.\nWe have recently learned that Vincent Guingona and Cameron Hill have investigated V C ∗ -density (and other properties) over indiscernible sequences in much\ngreater detail in [3].\nNotice that although Proposition 5.2 demonstrates a nice connection between dprank and V C ∗ -density, it is still quite unsatisfactory. One would hope to connect\nV C ∗ -density in general to dp-rank. For example, all known example of dp-minimal\ntheories seem to have V C ∗ -density 1 (most of what is known has been proved in\n[2]). Is this a coincidence, or an example of a deep connection? Specifically, we ask:\nQuestion 5.6. Does every dp-minimal theory have V C ∗ -density 1?\nIt is not so clear how to approach the general question. The proofs in [2] are\nvery case-specific and difficult. Any statement which states a bound for the V C ∗ density in terms of the dp-rank, would need to involve achieving finite indiscernible\nsequences, hence require nontrivial combinatorial arguments. Some partial results\nhave been obtained by the authors in a subsequent work, but not much is known\nin general.\nThinking about the possible arguments, it came to our attention that things\ncould be much more manageable if we could concentrate in single variables; by this\nwe mean that both definitions –of dp-rank and V C ∗ -density– could be made by\nlooking at the behavior of the realizations of the type with respect to singletons\n(for precise statements, see the two questions that follow this discussion). This sort\nof result is not uncommon in model theory: A theory is dependent if arbitrarily\n\n\fADDITIVITY OF THE DP-RANK\n\n21\n\nlarge sets of elements (not tuples) can not be shattered; if a dependent theory is\nunstable then the strict order property can be witnessed with elements, etc. So it\nwould not be too surprising if both V C ∗ -density and dp-rank could be defined by\njust looking at the singletons. The following question appeared in a first version of\nthis paper.\nQuestion 5.7. If p(x) is a (partial) type over A of dp-rank greater than n, can this\nbe witnessed by indiscernible sequences of elements? This is, are there I1 , . . . , In\nmutually A-indiscernible sequences of singletons and some c |= p(x) such that Ij is\nnot indiscernible over Ac for all 1 ≤ j ≤ n?\nThis was proved to be false: there are theories which are not dp-minimal but such\nthat given any element and any two mutually indiscernible sequences of singletons\n(over the empty set), at least one of them is indiscernible over the element. However,\nsince the theory is not dp-minimal, you can find a type over the empty set with\ndp-rank bigger than 1, thus providing a counterexample to the question even with\nA = ∅.\nThe question, however, turned out to be the wrong question. The following was\nproved by Kaplan and Simon in [5]:\nFact 5.8. [5] If p(x) is a (partial) type over A of dp-rank greater than n, there\nis an extension q of p over some B ⊃ A such that q has dp-rank greater than n,\nwitnessed by indiscernible sequences of singletons.\nThe second questions is concerned with the behavior of V C ∗ -density:\nQuestion 5.9. Suppose that p(y) is a type such that for all\n∆(x, y) := {δ1 (x, y), δ2 (x, y), . . . , δn (x, y)}\nwhere x is a single variable, we have that the V C ∗ -density of p(y) with respect to\n∆ is greater than d. Is d the V C ∗ -density of p(y) with respect to any ∆?\nNotice that a positive answer to Question 5.9 would imply that we could define\nthe VC-density of a type by considering formulas ∆ for which x̄ is a singleton. If\nthis were true, we would have more tools and evidence for establishing a tighter\nconnection between dp-rank and V C ∗ -density.\nReferences\n[1] H. Adler. Strong theories, burden, and weight. preprint, 2007.\n[2] M. Aschenbrenner, A. Dolich, D. Haskell, D. MacPherson, and S. Starchenko. Vapnikchervonenkis density in some theories without the independence property. arXiv:1109.5438,\n2011.\n[3] V. Guingona and C. D. Hill. Local dp-rank and vc-density over indiscernible sequences.\narXiv:1108.2554, 2011.\n[4] T. Hyttinen. Remarks on structure theorems for ω1 -saturated models. Notre Dame J. Formal\nLogic, 36(2):269–278, 1995.\n[5] I. Kaplan and P. Simon. Unpublished notes, 2011.\n[6] I. Kaplan and A. Usvyatsov. Strict independence in dependent theories. preprint, 2011.\n[7] A. Onshuus and A. Usvyatsov. On dp-minimality, strong dependence, and weight. J. Symbolic\nLogic, 76(3):737–758, 2011.\n[8] A. Onshuus and A. Usvyatsov. Thorn orthogonality and domination in unstable theories.\nFund. Math., 214(3):241–268, 2011.\n[9] S. Shelah. Classification theory and the number of nonisomorphic models, volume 92 of Studies in Logic and the Foundations of Mathematics. North-Holland Publishing Co., Amsterdam,\nsecond edition, 1990.\n\n\f22\n\nITAY KAPLAN, ALF ONSHUUS, AND ALEXANDER USVYATSOV\n\n[10] S. Shelah. Classification theory for elementary classes with the dependence property-a modest beginning. Sci. Math. Jpn., 59(2):265–316, 2004. Special issue on set theory and algebraic\nmodel theory.\n[11] S. Shelah. Dependent first order theories, continued. Israel J. Math., 173:1–60, 2009.\n[12] S. Shelah. Strongly dependent theories. arXiv:0504197, 2009.\n[13] P. Simon. On dp-minimal ordered structures. J. Symbolic Logic, 76(2):448–460, 2011.\n[14] A. Usvyatsov. Generically stable types in dependent theories. J. Symbolic Logic, 74(1):216–\n250, 2009.\nItay Kaplan, Mathematischen Instituts, Universität Münster, Einsteinstrasse 62,\n48149 Münster, Germany\nAlf Onshuus, Departamento de Matemáticas, Universidad de los Andes, Cra 1 No.\n18A-10, Edificio H, Bogotá, 111711, Colombia\nURL: http://matematicas.uniandes.edu.co/aonshuus\nAlexander Usvyatsov, Universidade de Lisboa, Centro de Matemática e Aplicações\nFundamentais, Av. Prof. Gama Pinto,2, 1649-003 Lisboa, Portugal\nURL: http://ptmat.fc.ul.pt/~alexus\n\n\f"}