{"id": "http://arxiv.org/abs/1105.2434v3", "guidislink": true, "updated": "2012-04-26T15:04:25Z", "updated_parsed": [2012, 4, 26, 15, 4, 25, 3, 117, 0], "published": "2011-05-12T11:44:58Z", "published_parsed": [2011, 5, 12, 11, 44, 58, 3, 132, 0], "title": "Diffusion in Social Networks with Competing Products", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5315%2C1105.2434%2C1105.3205%2C1105.1813%2C1105.0524%2C1105.5983%2C1105.2244%2C1105.0712%2C1105.2981%2C1105.1888%2C1105.4375%2C1105.1188%2C1105.0641%2C1105.3652%2C1105.3580%2C1105.3990%2C1105.0630%2C1105.2423%2C1105.4170%2C1105.3610%2C1105.4650%2C1105.1614%2C1105.4850%2C1105.3568%2C1105.0439%2C1105.3754%2C1105.3785%2C1105.3643%2C1105.2363%2C1105.4286%2C1105.1213%2C1105.3334%2C1105.2668%2C1105.1678%2C1105.1908%2C1105.2843%2C1105.6178%2C1105.4669%2C1105.5027%2C1105.3586%2C1105.5506%2C1105.1577%2C1105.3752%2C1105.0485%2C1105.4257%2C1105.1098%2C1105.0553%2C1105.0529%2C1105.5544%2C1105.4999%2C1105.3883%2C1105.4216%2C1105.2332%2C1105.2770%2C1105.0558%2C1105.4655%2C1105.1792%2C1105.2703%2C1105.3876%2C1105.3707%2C1105.4427%2C1105.5278%2C1105.1235%2C1105.1820%2C1105.2578%2C1105.4533%2C1105.5482%2C1105.2299%2C1105.1441%2C1105.4264%2C1105.2333%2C1105.3307%2C1105.3297%2C1105.6140%2C1105.2177%2C1105.1022%2C1105.3793%2C1105.0348%2C1105.3469%2C1105.1543%2C1105.0805%2C1105.6049%2C1105.3047%2C1105.5550%2C1105.2845%2C1105.0302%2C1105.5028%2C1105.5467%2C1105.0961%2C1105.1663%2C1105.1471%2C1105.0081%2C1105.2198%2C1105.2212%2C1105.5017%2C1105.1453%2C1105.2821%2C1105.3695%2C1105.2780%2C1105.3550%2C1105.4518&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Diffusion in Social Networks with Competing Products"}, "summary": "We introduce a new threshold model of social networks, in which the nodes\ninfluenced by their neighbours can adopt one out of several alternatives. We\ncharacterize the graphs for which adoption of a product by the whole network is\npossible (respectively necessary) and the ones for which a unique outcome is\nguaranteed. These characterizations directly yield polynomial time algorithms\nthat allow us to determine whether a given social network satisfies one of the\nabove properties.\n  We also study algorithmic questions for networks without unique outcomes. We\nshow that the problem of computing the minimum possible spread of a product is\nNP-hard to approximate with an approximation ratio better than $\\Omega(n)$, in\ncontrast to the maximum spread, which is efficiently computable. We then move\non to questions regarding the behavior of a node with respect to adopting some\n(resp. a given) product. We show that the problem of determining whether a\ngiven node has to adopt some (resp. a given) product in all final networks is\nco-NP-complete.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.5315%2C1105.2434%2C1105.3205%2C1105.1813%2C1105.0524%2C1105.5983%2C1105.2244%2C1105.0712%2C1105.2981%2C1105.1888%2C1105.4375%2C1105.1188%2C1105.0641%2C1105.3652%2C1105.3580%2C1105.3990%2C1105.0630%2C1105.2423%2C1105.4170%2C1105.3610%2C1105.4650%2C1105.1614%2C1105.4850%2C1105.3568%2C1105.0439%2C1105.3754%2C1105.3785%2C1105.3643%2C1105.2363%2C1105.4286%2C1105.1213%2C1105.3334%2C1105.2668%2C1105.1678%2C1105.1908%2C1105.2843%2C1105.6178%2C1105.4669%2C1105.5027%2C1105.3586%2C1105.5506%2C1105.1577%2C1105.3752%2C1105.0485%2C1105.4257%2C1105.1098%2C1105.0553%2C1105.0529%2C1105.5544%2C1105.4999%2C1105.3883%2C1105.4216%2C1105.2332%2C1105.2770%2C1105.0558%2C1105.4655%2C1105.1792%2C1105.2703%2C1105.3876%2C1105.3707%2C1105.4427%2C1105.5278%2C1105.1235%2C1105.1820%2C1105.2578%2C1105.4533%2C1105.5482%2C1105.2299%2C1105.1441%2C1105.4264%2C1105.2333%2C1105.3307%2C1105.3297%2C1105.6140%2C1105.2177%2C1105.1022%2C1105.3793%2C1105.0348%2C1105.3469%2C1105.1543%2C1105.0805%2C1105.6049%2C1105.3047%2C1105.5550%2C1105.2845%2C1105.0302%2C1105.5028%2C1105.5467%2C1105.0961%2C1105.1663%2C1105.1471%2C1105.0081%2C1105.2198%2C1105.2212%2C1105.5017%2C1105.1453%2C1105.2821%2C1105.3695%2C1105.2780%2C1105.3550%2C1105.4518&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce a new threshold model of social networks, in which the nodes\ninfluenced by their neighbours can adopt one out of several alternatives. We\ncharacterize the graphs for which adoption of a product by the whole network is\npossible (respectively necessary) and the ones for which a unique outcome is\nguaranteed. These characterizations directly yield polynomial time algorithms\nthat allow us to determine whether a given social network satisfies one of the\nabove properties.\n  We also study algorithmic questions for networks without unique outcomes. We\nshow that the problem of computing the minimum possible spread of a product is\nNP-hard to approximate with an approximation ratio better than $\\Omega(n)$, in\ncontrast to the maximum spread, which is efficiently computable. We then move\non to questions regarding the behavior of a node with respect to adopting some\n(resp. a given) product. We show that the problem of determining whether a\ngiven node has to adopt some (resp. a given) product in all final networks is\nco-NP-complete."}, "authors": ["Krzysztof R. Apt", "Evangelos Markakis"], "author_detail": {"name": "Evangelos Markakis"}, "author": "Evangelos Markakis", "arxiv_comment": "13 pages. Appeared in Proc. 4th International Symposium on\n  Algorithmic Game Theory, (SAGT 2011), Lecture Notes in Computer Science 6982,\n  Springer, pp. 212-223", "links": [{"href": "http://arxiv.org/abs/1105.2434v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.2434v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.2434v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.2434v3", "journal_reference": null, "doi": null, "fulltext": "Diffusion in Social Networks with Competing\nProducts\nKrzysztof R. Apt1,2 and Evangelos Markakis3\n\narXiv:1105.2434v3 [cs.SI] 26 Apr 2012\n\n1\n\n3\n\nCWI, Amsterdam, the Netherlands,\n2\nUniversity of Amsterdam,\napt@cwi.nl,\nAthens University of Economics and Business,\nDept. of Informatics, Athens, Greece\nmarkakis@gmail.com\n\nAbstract. We introduce a new threshold model of social networks, in\nwhich the nodes influenced by their neighbours can adopt one out of\nseveral alternatives. We characterize the graphs for which adoption of a\nproduct by the whole network is possible (respectively necessary) and the\nones for which a unique outcome is guaranteed. These characterizations\ndirectly yield polynomial time algorithms that allow us to determine\nwhether a given social network satisfies one of the above properties.\nWe also study algorithmic questions for networks without unique outcomes. We show that the problem of computing the minimum possible\nspread of a product is NP-hard to approximate with an approximation\nratio better than Ω(n), in contrast to the maximum spread, which is efficiently computable. We then move on to questions regarding the behavior\nof a node with respect to adopting some (resp. a given) product. We show\nthat the problem of determining whether a given node has to adopt some\n(resp. a given) product in all final networks is co-NP-complete.\n\n1\n1.1\n\nIntroduction\nBackground\n\nSocial networks have become a huge interdisciplinary research area with important links to sociology, economics, epidemiology, computer science, and mathematics. A flurry of numerous articles and recent books [10,6] shows the growing\nrelevance of this field as it deals with such diverse topics as epidemics, spread\nof certain patterns of social behaviour, effects of advertising, and emergence of\n'bubbles' in financial markets.\nA large part of research on social networks focusses on the problem of diffusion, that is the spread of a certain event or information over the network,\ne.g., becoming infected or adopting a given product. In the remainder of the\npaper, we will use as a running example the adoption of a product, which is\nbeing marketed over a social network.\nTwo prevalent models have been considered for capturing diffusion: the threshold models introduced in [8] and [15] and the independent cascade models studied\n\n\fin [7]. In threshold models, which is the focus of our work, each node i has a\nthreshold θ(i) ∈ (0, 1] and it decides to adopt a product when the total weight\nof incoming edges from nodes that have already adopted a product reaches or\nexceeds θ(i). In a special case a node decides to adopt a product if at least the\nfraction θ(i) of its neighbours has done so. In cascade models, each node that\nadopts a product can activate each of his neighbours with a certain probability\nand each node has only one chance of activating a neighbour.\nMost of research has focussed on the situation in which the players face the\nchoice of adopting a specific product or not. In this setting, the algorithmic\nproblem of choosing an initial set of nodes so as to maximize the adoption of a\ngiven product and certain variants of this were studied initially in [11] and in\nseveral publications that followed, e.g., [5,14].\nWhen studying social networks from the point of view of adopting new products that come to the market, it is natural to lift the restriction of a single\nproduct. One natural example is when users choose among competing programs\nfrom providers of mobile telephones. Then, because of lower subscription costs,\neach owner of a mobile telephone naturally prefers to choose the same provider\nthat his friends choose. In such situations, the outcome of the adoption process does not need to be unique. Indeed, individuals with a low 'threshold' can\nadopt any product a small group of their friends adopts. As a result this leads\nto different considerations than before.\nIn the presence of multiple products, diffusion has been investigated recently\nfor cascade models in [2,4,12], where new approximation algorithms and hardness results have been proposed. For threshold models, an extension to two\nproducts has been recently proposed in [3], where the authors examine whether\nthe algorithmic approach of [11] can be extended. Algorithms and hardness of\napproximation results are provided for certain variants of the diffusion process.\nGame theoretic aspects have also been considered in the case of two products. In particular, the behavior of best response dynamics in infinite graphs is\nstudied in [13], when each node has to choose between two different products. An\nextension of this model is studied in [9] with a focus on notions of compatibility\nand bilinguality, i.e., having the option to adopt both products at an extra cost\nso as to be compatible with all your neighbours.\n1.2\n\nContributions\n\nWe study a new model of a social network in which nodes (agents) can choose\nout of several alternatives and in which various outcomes of the adoption process\nare possible. Our model combines a number of features present in various models\nof networks.\nIt is a threshold model and we assume that the threshold of a node is a fixed\nnumber as in [5] (and unlike [11,3], where they are random variables). This is in\ncontrast to Hebb's model of learning in networks of neurons, the focus of which\nis on learning, leading to strengthening of the connections (here thresholds). In\nour context threshold should be viewed as a fixed 'resistance level' of a node to\nadopt a product. In contrast to the SIR model, see, e.g., [10], in which a node\n2\n\n\fcan be in only two states, in our model each node can choose out of several\nstates (products). We also allow that not all nodes have exactly the same set\nof products to choose from, e.g. due to geographic or income restrictions some\nproducts may be available only to a subset of the nodes. If a node changes\nits state from the initial one, the new state (that corresponds to the adopted\nproduct) is final, as is the case with most of the related literature.\nOur work consists of two parts. In the first part (Sections 3, 4, 5) we study\nthree basic problems concerning this model. In particular, we find necessary and\nsufficient conditions for determining whether\n• a specific product will possibly be adopted by all nodes.\n• a specific product will necessarily be adopted by all nodes.\n• the adoption process of the products will yield a unique outcome.\nFor each of these questions, we obtain a characterization with respect to the\nstructure of the underlying graph.\nIn the second part (Section 6), we focus on networks that do not possess a\nunique outcome and investigate the complexity of various problems concerning\nthe adoption process. We start with estimating the minimum and maximum\nnumber of nodes that may adopt a given product. Then we move on to questions\nregarding the behavior of a given node in terms of adopting a given product or\nsome product from its list. We resolve the complexity of all these problems. As\nwe show, some of these problems are efficiently solvable, whereas the remaining\nones are either co-NP-complete or have strong inapproximability properties.\n\n2\n\nPreliminaries\n\nAssume a fixed weighted directed graph G = (V, E) (with no parallel edges and\nno self-loops), with n = |V | and wij ∈ [0, 1] being the weight of edge (i, j). Given\na node i of G we denote by N (i) the set of nodes from which there is an incoming\nedge to i. We call each j ∈ N (i)\nPa neighbour of i in G. We assume that for\neach node i such that N (i) 6= ∅, j∈N (i) wji ≤ 1. Further, we have a threshold\nfunction θ that assigns to each node i ∈ V a fixed value θ(i) ∈ (0, 1]. Finally,\nwe fix a finite set P of alternatives to which we shall refer as products.\nBy a social network we mean a tuple (G, P, p, θ), where p is a function\nthat assigns to each node of G a non-empty subset of P . The idea is that each\nnode i is offered a non-empty set p(i) ⊆ P of products from which it can make\nits choice. If p(i) is a singleton, say p(i) = {t}, the node adopted the product\nt. Otherwise it can adopt a product if the total weight of incoming edges from\nneighbours that have already adopted it is at least equal to the threshold θ(i).\nTo formalize the questions we want to address, we need to introduce a number\nof notions. Since G, P and θ are fixed, we often identify each social network with\nthe function p.\nConsider a binary relation → on social networks. Denote by →∗ the reflexive, transitive closure of → . We call a reduction sequence p →∗ p′ maximal if\nfor no p′′ we have p′ → p′′ . In that case we will say that p′ is a final network,\ngiven the initial network p.\n3\n\n\fDefinition 1. Assume an initial social network p and a network p′ . We say\nthat\n• p′ is reachable (from p) if p →∗ p′ ,\n• p′ is unavoidable (from p) if for all maximal sequences of reductions p →∗ p′′\nwe have p′ = p′′ ,\n• p has a unique outcome if some social network is unavoidable from p.\nFrom now on we specialize the relation → . Given a social network p, and a\nproduct t ∈ p(i) for some node i with N (i) 6= ∅, we use the abbreviation A(t, i)\n(for 'adoption condition of product t by node i') for\nX\nwji ≥ θ(i)\nj∈N (i)|p(j)={t}\n\nWhen N (i) = ∅, we stipulate that A(t, i) holds for every t ∈ p(i).\nDefinition 2.\n• We write p1 → p2 if p2 =\n6 p1 and for all nodes i, if p2 (i) 6= p1 (i), then\n|p1 (i)| ≥ 2 and for some t ∈ p1 (i)\np2 (i) = {t} and A(t, i) holds in p1 .\n• We say that node i in a social network p\n– adopted product t if p(i) = {t},\n– can adopt product t if t ∈ p(i), |p(i)| ≥ 2, and A(t, i) holds in p.\nIn particular, a node i with no neighbours and more than one product in p(i)\ncan adopt any product that is a possible choice for it. Note that each modification\nof the function p results in assigning to a node i a singleton set. Thus, if p1 →∗ p2 ,\nthen for all nodes i either p2 (i) = p1 (i) or p2 (i) is a singleton set.\nOne of the questions we are interested is whether a product t can spread to\nthe whole network. We will denote this final network by [t], where [t] denotes\nthe constant function p such that p(i) = {t} for all nodes i. Furthermore, given\na social network (G, P, p, θ) and a product t ∈ P we denote by Gp,t the weighted\ndirected graph obtained from G by removing from it all edges to nodes i with\np(i) = {t}. That is, in Gp,t for all such nodes i we have N (i) = ∅ and for all\nother nodes the set of neighbours in Gp,t and G is the same.\nIf each weight wj,i in the considered graph equals |N1(i)| , then we call the\ncorresponding social network equitable. Hence in equitable social networks the\nadoption condition, A(t, i), holds if at least a fraction θ(i) of the neighbours of\ni adopted in p product t.\nExample 1. As an example for illustrating the definitions, consider the equitable\nsocial networks in Figure 1, where P = {t1 , t2 } and where we mention next to\neach node the set of products available to it.\nIn the first social network, if θ(a) ≤ 13 , then the network in which node a\nadopts product t1 is reachable, and so is the case for product t2 . If 31 < θ(a) ≤ 32 ,\n4\n\n\fFig. 1. Two examples of social networks\n\nthen only the network in which node a adopts product t1 is reachable. Further,\nif θ(a) > 23 , then none of the above two networks is reachable. Finally, the initial\nnetwork has a unique outcome iff 31 < θ(a).\nFor the second social network the following more elaborate case distinction\nlists the possible values of p in the final reachable networks.\nθ(b) ≤ 13 ∧ θ(c) ≤ 21\nθ(b) ≤ 13 ∧ θ(c) > 21\n2\n1\n3 < θ(b) ≤ 3 ∧ θ(c) ≤\n1\n1\n3 < θ(b) ∧ θ(c) > 2\n1\n2\n3 < θ(b) ∧ θ(c) ≤ 2\n\n1\n2\n\n: (p(b) = {t1 } ∨ p(b) = {t2 }) ∧ (p(c) = {t1 } ∨ p(c) = {t2 })\n: (p(b) = {t1 } ∧ p(c) = P ) ∨ (p(b) = p(c) = {t2 })\n: p(b) = p(c) = {t2 }\n: p(b) = p(c) = P\n: p(b) = P ∧ p(c) = {t2 }\n\nIn particular, when 13 < θ(b) ≤\nonly after node c adopts it.\n\n3\n\n2\n3\n\nand θ(c) ≤\n\n1\n2,\n\nnode b adopts product t2\n\nReachable outcomes\n\nWe start with providing necessary and sufficient conditions for a product to be\nreachable by all nodes. This is achieved by a structural characterization of graphs\nthat allow products to spread to the whole graph, given the threshold function\nθ. In particular, we shall need the following notion.\nDefinition 3. Given a threshold function θ we call a weighted directed graph θwell-structured if for some function level that maps nodes to natural numbers,\nwe have that for all nodes i such that N (i) 6= ∅\nX\nwji ≥ θ(i).\n(1)\nj∈N (i)|level(j)<level(i)\n\nIn other words, a weighted directed graph is θ-well-structured if levels can\nbe assigned to its nodes in such a way that for each node i such that N (i) 6= ∅,\nthe sum of the weights of the incoming edges from lower levels is at least θ(i).\nWe will often refer to the function level as a certificate for the graph being\n5\n\n\fθ-well-structured. Note that there can be many certificates for a given graph.\nNote also that θ-well structured graphs can have cycles. For instance, it is easy\nto check that the second social network in Figure 1 is θ-well structured when\nθ(i) ≤ 13 for every node i.\nWe have the following characterization.\nTheorem 1. Assume a social network (G, P, p, θ) and a product top ∈ P . A\nsocial network (G, P, [top], θ) is reachable from (G, P, p, θ) iff\n– for all i, top ∈ p(i),\n– Gp,top is θ-well-structured.\nProof. ( ⇒ ) If for some node i we have top 6∈ p(i), then i cannot adopt product\ntop and [top] is not reachable.\nTo establish the second condition consider a reduction sequence\np1 → p2 → . . . → pm\nstarting in p and such that pm = [top].\nAssign now to each node i the minimal k such that pk+1 (i) = {top}. We claim\nthat this definition of the level function shows that Gp,top is θ-well-structured.\nConsider a node i.\nCase 1. level(i) = 0.\nThen p(i) = {top}, so by the definition of Gp,top we have N (i) = ∅ in Gp,top .\nHence we do not need to argue about these nodes since we only need to ensure\ncondition (1) for nodes with N (i) 6= ∅.\nCase 2. level(i) > 0.\nSuppose that N (i) 6= ∅ and that level(i) = k. By the definition of the reduction → the adoption condition A(top, i) holds in pk , i.e.,\nX\nwji ≥ θ(i).\nj∈N (i)|pk (j)={top}\n\nBut for each j ∈ N (i) such that pk (j) = {top} we have by definition\nlevel(j) < level(i). So (1) holds.\n( ⇐ ) Consider a certificate function level showing that Gp,top is θ-well-structured.\nWithout loss of generality we can assume that the nodes in Gp,top such that\nN (i) = ∅ are exactly the nodes of level 0. We construct by induction on the level\nm a reduction sequence p →∗ p′′ , such that for all nodes i we have top ∈ p′′ (i)\nand for all nodes i of level ≤ m we have p′′ (i) = {top}.\nConsider level 0. By definition of Gp,top , a node i is of level 0 iff it has no\nneighbours in G or p(i) = {top}. In the former case, by the first condition,\ntop ∈ p(i). So p →∗ p′′ , where the function p′′ is defined by\n\u001a\n{top} if level(i) = 0\np′′ (i) :=\np(i)\notherwise\n6\n\n\fThis establishes the induction basis.\nSuppose the claim holds for some level m. So we have p →∗ p′ , where for all\nnodes i we have top ∈ p′ (i) and for all nodes i of level ≤ m we have p′ (i) = {top}.\nConsider the nodes of level m + 1. For each such node i we have top ∈ p′ (i),\nN (i) 6= ∅ and\nX\nwji ≥ θ(i).\nj∈N (i)|level(j)<level(i)\n\nBy the definition of Gp,top the sets of neighbours of i in G and Gp,top are the\nsame. By the induction hypothesis for all nodes j such that level(j) < level(i)\nwe have p′ (j) = {top}.\nSo either node i adopted product top in p′ or can adopt product top in p′ .\nHence p′ →∗ p′′ , where the function p′′ is defined by\n\u001a\n{top} if level(i) = m + 1\np′′ (i) :=\np′ (i) otherwise\nConsequently p →∗ p′′ , which establishes the induction step. We conclude p →∗ [top].\nNext we show that testing if a graph is θ-well-structured can be efficiently\nsolved.\nTheorem 2. Given a weighted directed graph G and a threshold function θ, we\ncan decide whether G is θ-well-structured in time O(n2 ).\nProof. (Sketch) We claim that the following simple algorithm achieves this:\n• Given a weighted directed graph G, first assign level 0 to all nodes with\nN (i) = ∅. If no such node exists, output that the graph is not θ-wellstructured.\n• Inductively, at step i, assign level i to each node for which condition (1) from\nDefinition 3 is satisfied when considering only its neighbours that have been\nassigned levels 0, . . ., i − 1.\n• If by iterating this all nodes are assigned a level, then output that the graph\nis θ-well-structured. Otherwise, output that G is not θ-well-structured.\nThe above algorithm can be implemented in time O(n2 + |E|) = O(n2 ),\nby using the adjacency list representation. To prove correctness, note that if\nthe input graph is not θ-well-structured, then the algorithm will output No, as\notherwise, at termination it would have constructed a level function for a non-θwell-structured graph. For the reverse, suppose a graph G is θ-well-structured.\nThe idea of the proof is to use a certificate function, in which all nodes are\nassigned the minimum possible level. We then prove by induction that this is\nprecisely the level assignment produced by the algorithm and hence it outputs\nYes. Due to lack of space, we omit the proof.\nFinally, we end this section by observing that determining whether a network\n[top] is reachable can also be solved efficiently.\nTheorem 3. Assume a social network (G, P, p, θ) and a product top ∈ P . There\nis an algorithm running in time O(n2 ) that determines whether the social network\n(G, P, [top], θ) is reachable.\n7\n\n\f4\n\nUnavoidable outcomes\n\nNext, we focus on the notion of unavoidable outcomes. We establish the following\ncharacterization.\nTheorem 4. Assume a social network (G, P, p, θ) and a product top ∈ P . A\nsocial network (G, P, [top], θ) is unavoidable iff\n– for all i, if N (i) = ∅, then p(i) = {top},\n– for all i, top ∈ p(i),\n– Gp,top is θ-well-structured.\nTo prove this, we need first a few lemmas, the proofs of which we omit from\nthis version.\nLemma 1. Suppose that p →∗ p′ and for some node i we have p′ (i) = {t}. Then\nfor some node j such that N (j) = ∅ or p(j) is a singleton, we have t ∈ p(j).\nIntuitively, this means that each product eventually adopted can also be initially\nadopted (by a possibly different node).\nLemma 2. Assume a social network (G, P, p, θ) and a product top ∈ P . Suppose\nthat\n– for all i, if N (i) = ∅ or p(i) is a singleton, then p(i) = {top}.\nThen a unique outcome of (G, P, p, θ) exists.\nIntuitively, this means that if initially only one product can be adopted, then a\nunique outcome of the social network exists.\nProof of Theorem 4: (Sketch) By Theorem 1 and Lemma 2.\nIn analogy to Theorem 3, we also have the following simple fact.\nTheorem 5. Assume a social network (G, P, p, θ) and a product top ∈ P . There\nis an algorithm, running in time O(n2 ), that determines whether the social network (G, P, [top], θ) is unavoidable.\n\n5\n\nUnique outcomes\n\nWe now consider the question of when does a network admit a unique outcome.\nTo answer this, we introduce the following definitions.\nDefinition 4. Given social networks p, p′ based on the same graph we say that\n– node i can switch in p′ given p if i adopted in p′ a product t and for some\nt′ 6= t\nt′ ∈ p(i) ∧ A(t′ , i) holds in p′ ,\n– p′ is ambivalent given p if it contains a node that either can adopt more\nthan one product or can switch in p′ given p,\n8\n\n\f– the reduction p → p′ is fast if for each node i, if i can adopt a product\nin p then i adopted a product in p′ . Intuitively, p → p′ is then a 'maximal'\none-step reduction of p.\nDefinition 5. By the contraction sequence of a social network we mean the\nunique reduction sequence p →∗ p′ such that\n– each of its reduction steps is fast,\n– either p →∗ p′ is maximal or p′ is the first network in the sequence p →∗ p′\nthat is ambivalent given p.\nWe now formulate a characterization of social networks that admit a unique\noutcome. We omit the proof.\nTheorem 6. A social network admits a unique outcome iff its contraction sequence ends in a non-ambivalent social network.\nCorollary 1. Assume a social network (G, P, p, θ) such that\n– for all nodes i we have θ(i) > 12 ,\n– for all i, if N (i) = ∅, then p(i) is a singleton.\nThen (G, P, p, θ) admits a unique outcome.\nThe above corollary can be strengthened by assuming that the network is\nsuch that if θ(i) ≤ 21 then |N (i)| < 2 or |p(i)| = 1. The reason is that the nodes\nfor which |N (i)| < 2 or |p(i)| = 1 cannot introduce an ambivalence.\nWhen for some node i, θ(i) ≤ 12 holds and neither |N (i)| < 2 nor |p(i)| = 1,\nthe equitable social network still may admit a unique outcome but it does not\nhave to. For instance the second social network in Figure 1 admits a unique\noutcome for the last three alternatives (explained in Example 1), while for the\nfirst two is does not.\nTheorem 6 also yields an algorithm to test if a network has a unique outcome.\nThe algorithm simply has to simulate the contraction sequence of a network and\ndetermine whether it ends in a non-ambivalent network. The statement of the\nalgorithm and its analysis are omitted.\nTheorem 7. There exists a polynomial time algorithm, running in time O(n2 +\nn|P |), that determines whether a social network admits a unique outcome. Furthermore, if for all nodes i we have θ(i) > 21 , there is a O(n2 ) algorithm.\nFor all practical purposes we have |P | << n, so even for the general case the\nrunning time would typically be O(n2 ).\n\n6\n\nProduct adoption in networks without unique outcomes\n\nThe results of the previous section reveal that many social networks will not\nadmit a unique outcome. In this section, we consider some natural questions\n9\n\n\fregarding product adoption that are of interest for such networks. We start with\ntwo optimization problems.\nSuppose that a product top is neither unavoidable by all nodes nor reachable.\nWe would like then to estimate the worst and best-case scenario for the spread\nof this product. That is, starting from a given initial network p, what is the\nminimum (resp. maximum) number of nodes that will adopt this product in a\nfinal network (recall that a final network is one that has been obtained from\nsome initial network by a maximal sequence of reductions). Hence, the following\ntwo problems are of interest.\nMIN-ADOPTION: Given a social network (G, P, p, θ) and a product top, find\nthe minimum number of nodes that adopted top in a final network, starting from\n(G, P, p, θ).\nMAX-ADOPTION: Given a social network (G, P, p, θ) and a product top,\nfind the maximum number of nodes that adopted top in a final network, starting\nfrom (G, P, p, θ).\nWe show that these two problems are substantially different, the first being\nessentially inapproximable while the second efficiently solvable.\nTheorem 8. If n is the number of nodes of a network, then\n(i) It is NP-hard to approximate MIN-ADOPTION with an approximation ratio\nbetter than Ω(n).\n(ii) The MAX-ADOPTION problem can be solved in O(n2 ) time.\nProof. (i) We give a reduction from the PARTITION problem, which\nPis: given\nn\npositive\nrational\nnumbers\n(a\n,\n.\n.\n.,\na\n),\nis\nthere\na\nset\nS\nsuch\nthat\n1\nn\ni∈S ai =\nP\na\n?\nConsider\nan\ninstance\nI\nof\nPARTITION.\nWLOG,\nsuppose\nwe\nhave\ni\ni6∈S\nPn\nnormalized the numbers so that P\na\n=\n1.\nHence\nthe\nquestion\nis\nto\ndecide\ni=1 i\nP\nwhether there is a set S such that i∈S ai = i6∈S ai = 12 .\nWe build an instance of our problem with 3 products, namely P = {top, t, t′ },\nand with the graph shown in Figure 2. The number of nodes in the line that\nstarts to the right of node e is M = nO(1) , hence the reduction is of polynomial\ntime. The weights in those edges is 1. The thresholds of the nodes are θ(a) =\nθ(b) = θ(c) = θ(d) = 21 , θ(e) = 1/2 + ǫ, for some ǫ > 0 and for the nodes to\nthe right of e we can set the thresholds to an arbitrary positive number in (0, 1].\nFinally, for each node i ∈ {1, . . ., n}, we set wi,a = wi,b = ai . The weights of the\nother edges can be seen in the figure.\nWe claim that if there exists a solution to I, then a final network exists where\nthe number of nodes that adopted top equals 3, otherwise in all final networks\nthe number of nodes that adopted top equals M + 5. This directly yields the\ndesired result.\nSuppose there is a solution S to I. Then we can have the nodes corresponding\nto the set S adopt t and the remaining nodes from {1, . . ., n} adopt t′ . This\nimplies that node a can adopt t and node b can adopt t′ . Subsequently, node c\ncan adopt t and node d can adopt t′ , which implies that node e cannot adopt\nany product. Hence a final network exists in which only 3 nodes adopted top.\n10\n\n\fFig. 2. The graph of the reduction with P = {top, t, t′ } and R = {t, t′ }.\n\nFor the reverse direction, suppose there is no solution to the PARTITION\nproblem. Then, no matter how we partition the nodes {1, . . ., n},\nP into 2 sets\n1\nS, S ′ , it will always be that forPone of them, say S, we have\ni∈S ai > 2 ,\n1\nwhereas for the other we have i∈S ′ ai < 2 . Thus in each final network, no\nmatter which nodes from {1, . . ., n} adopted t or t′ , the nodes a and b adopted\nthe same product. Suppose that nodes a and b both adopted t (the same applies\nif they both adopt t′ ). This in turn implies that node c adopted t and node d did\nnot adopt t′ . Thus, the node d could only adopt top. But then the only choice\nfor node e was to adopt top and this propagates along the whole line to the right\nof e. This completes the proof of (i).\n(ii) The algorithm for MAX-ADOPTION resembles the one used in the proof of\nTheorem 7. Given the product top, it suffices to start with the nodes that have\nalready adopted the product and perform fast reductions but only with respect\nto top until no further adoption of top is possible.\nWe now move on to some decision problems that concern the behavior of\na specific node in a given social network. We consider the following natural\nquestions.\nADOPTION 1: (unavoidable adoption of some product)\nDetermine whether a given node has to adopt some product in all final networks.\nADOPTION 2: (unavoidable adoption of a given product)\nDetermine whether a given node has to adopt a given product in all final networks.\nADOPTION 3: (possible adoption of some product)\nDetermine whether a given node can adopt some product in some final network.\nADOPTION 4: (possible adoption of a given product)\nDetermine whether a given node can adopt a given product in some final network.\nTheorem 9. The complexity of the above problems is as follows:\n(i) ADOPTION 1 is co-NP-complete.\n(ii) ADOPTION 2 is co-NP-complete.\n(iii) ADOPTION 3 can be solved in O(n2 |P |) time.\n11\n\n\f(iv) ADOPTION 4 can be solved in O(n2 ) time.\nThe proofs of (i) and (ii) use the reduction given in the proof of Theorem 8.\nWe omit the proof due to lack of space.\n\n7\n\nConclusions and future work\n\nWe have introduced a diffusion model in the presence of multiple competing\nproducts and studied some basic questions. We have provided characterizations\nof the underlying graph structure for determining whether a product can spread\nor will necessarily spread to the whole graph, and of the networks that admit a\nunique outcome. We also studied the complexity of various problems that are of\ninterest for networks that do not admit a unique outcome, such as the problems\nof computing the minimum or maximum number of nodes that will adopt a given\nproduct, or determining whether a given node has to adopt some (resp. a given)\nproduct in all final networks.\nIn the proposed model, one could also incorporate game theoretic aspects by\nconsidering a strategic game either between the nodes who decide which product\nto choose, or between the producers who decide to offer their products for free\nto some selected nodes. In the former case, a game theoretic analysis for players\nchoosing between two products has been presented in [13]. An extension with\nthe additional option of adopting both products has been considered in [9]. The\nlatter case, with the producers being the players, has been recently studied in\n[1] in a different model than the threshold ones. We are particularly interested\nin analyzing the set of Nash equilibria in the presence of multiple products, as\nwell as in introducing threshold behavior in the model of [1].\n\nAcknowledgement\nWe would like to thank Berthold Vöcking for suggesting to us the first two\nproblems in Section 6.\n\nReferences\n1. N. Alon, M. Feldman, A. D. Procaccia, and M. Tennenholtz. A note on competitive\ndiffusion through social networks. Inf. Process. Lett., 110(6):221–225, 2010.\n2. S. Bharathi, D. Kempe, and M. Salek. Competitive influence maximization in\nsocial networks. In Proc. 3rd International Workshop on Internet and Network\nEconomics (WINE), pages 306–311, 2007.\n3. A. Borodin, Y. Filmus, and J. Oren. Threshold models for competitive influence\nin social networks. In Proc. 6th International Workshop on Internet and Network\nEconomics (WINE 2010), pages 539–550, 2010.\n4. T. Carnes, C. Nagarajan, S. M. Wild, and A. van Zuylen. Maximizing influence in\na competitive social network: A follower's perspective. In Proc. 9th International\nConference on Electronic Commerce (ICEC), pages 351–360, 2007.\n\n12\n\n\f5. N. Chen. On the approximability of influence in social networks. SIAM J. Discrete\nMath., 23(3):1400–1415, 2009.\n6. D. Easley and J. Kleinberg. Networks, Crowds, and Markets. Cambridge University\nPress, 2010.\n7. J. Goldenberg, B. Libai, and E. Muller. Talk of the network: A complex systems\nlook at the underlying process of word-of-mouth. Marketing Letters, 12(3):211–223,\n2001.\n8. M. Granovetter. Threshold models of collective behavior. American Journal of\nSociology, 83(6):1420–1443, 1978.\n9. N. Immorlica, J. M. Kleinberg, M. Mahdian, and T. Wexler. The role of compatibility in the diffusion of technologies through social networks. In ACM Conference\non Electronic Commerce, pages 75–83, 2007.\n10. M. Jackson. Social and Economic Networks. Princeton University Press, Princeton,\n2008.\n11. D. Kempe, J. M. Kleinberg, and É. Tardos. Maximizing the spread of influence\nthrough a social network. In L. Getoor, T. E. Senator, P. Domingos, and C. Faloutsos, editors, KDD, pages 137–146. ACM, 2003.\n12. J. Kostka, Y. A. Oswald, and R. Wattenhofer. Word of mouth: Rumor dissemination in social networks. In SIROCCO, pages 185–196, 2008.\n13. S. Morris. Contagion. The Review of Economic Studies, 67(1):57–78, 2000.\n14. E. Mossel and S. Roch. On the submodularity of influence in social networks. In\nSTOC, pages 128–134, 2007.\n15. T. Schelling. Micromotives and Macrobehavior. Norton, 1978.\n\n13\n\n\f"}