{"id": "http://arxiv.org/abs/1005.4551v1", "guidislink": true, "updated": "2010-05-25T12:37:17Z", "updated_parsed": [2010, 5, 25, 12, 37, 17, 1, 145, 0], "published": "2010-05-25T12:37:17Z", "published_parsed": [2010, 5, 25, 12, 37, 17, 1, 145, 0], "title": "Distinguishability of particles and its implications for peculiar mass\n  transport in inhomogeneous media", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3073%2C1005.1087%2C1005.3967%2C1005.0897%2C1005.0399%2C1005.0734%2C1005.1273%2C1005.5238%2C1005.4056%2C1005.1212%2C1005.4469%2C1005.1470%2C1005.1945%2C1005.3428%2C1005.4079%2C1005.2080%2C1005.3302%2C1005.2795%2C1005.1873%2C1005.1496%2C1005.3263%2C1005.4151%2C1005.3990%2C1005.0765%2C1005.4814%2C1005.2024%2C1005.4361%2C1005.1837%2C1005.3798%2C1005.1074%2C1005.1914%2C1005.4088%2C1005.1612%2C1005.1991%2C1005.5395%2C1005.1280%2C1005.1240%2C1005.3264%2C1005.0569%2C1005.3312%2C1005.0420%2C1005.3402%2C1005.5259%2C1005.1365%2C1005.2445%2C1005.3313%2C1005.1008%2C1005.4413%2C1005.4376%2C1005.1343%2C1005.1393%2C1005.1221%2C1005.3050%2C1005.2378%2C1005.1571%2C1005.1500%2C1005.2004%2C1005.2644%2C1005.1858%2C1005.5275%2C1005.3666%2C1005.5585%2C1005.1317%2C1005.3486%2C1005.4809%2C1005.1285%2C1005.4828%2C1005.1486%2C1005.0918%2C1005.3939%2C1005.1763%2C1005.2331%2C1005.5016%2C1005.3855%2C1005.4677%2C1005.1889%2C1005.2740%2C1005.3184%2C1005.3394%2C1005.5002%2C1005.1724%2C1005.2244%2C1005.0954%2C1005.1378%2C1005.0564%2C1005.1380%2C1005.0866%2C1005.2387%2C1005.3009%2C1005.2542%2C1005.1538%2C1005.2820%2C1005.4665%2C1005.2131%2C1005.4551%2C1005.4355%2C1005.5361%2C1005.1457%2C1005.4293%2C1005.5604%2C1005.0347&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Distinguishability of particles and its implications for peculiar mass\n  transport in inhomogeneous media"}, "summary": "A mass transport directed from low to high density region in an inhomogeneous\nmedium is modeled as a limiting case of a two-component lattice gas with\nexcluded volume constraint and one of the components fixed. In the\nlong-wavelength approximation, density relaxation of mobile particles is\ngoverned by a diffusion process and interaction with a medium inhomogeneity\nrepresented by a static component distribution. It is shown that density\nrelaxation can be locally accompanied by a density distribution compression. In\nquasi one-dimensional case, the compression dynamics manifests itself in a\nhopping-like motion of diffusing substance packet front position due to a\nstaged passing through inhomogeneity barriers and leads to a fragmentation of a\npacket and retardation of its spreading. A root-mean-square displacement\nreflects only an averaged packet front dynamics and becomes inappropriate as a\ntransport characteristic in this regime. In a stationary case mass transport\nthroughout a whole system may be directed from a boundary with low\nconcentration towards a boundary with that of high one. Implications of the\nexcluded volume constraint and particles distinguishability for these effects\nare discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3073%2C1005.1087%2C1005.3967%2C1005.0897%2C1005.0399%2C1005.0734%2C1005.1273%2C1005.5238%2C1005.4056%2C1005.1212%2C1005.4469%2C1005.1470%2C1005.1945%2C1005.3428%2C1005.4079%2C1005.2080%2C1005.3302%2C1005.2795%2C1005.1873%2C1005.1496%2C1005.3263%2C1005.4151%2C1005.3990%2C1005.0765%2C1005.4814%2C1005.2024%2C1005.4361%2C1005.1837%2C1005.3798%2C1005.1074%2C1005.1914%2C1005.4088%2C1005.1612%2C1005.1991%2C1005.5395%2C1005.1280%2C1005.1240%2C1005.3264%2C1005.0569%2C1005.3312%2C1005.0420%2C1005.3402%2C1005.5259%2C1005.1365%2C1005.2445%2C1005.3313%2C1005.1008%2C1005.4413%2C1005.4376%2C1005.1343%2C1005.1393%2C1005.1221%2C1005.3050%2C1005.2378%2C1005.1571%2C1005.1500%2C1005.2004%2C1005.2644%2C1005.1858%2C1005.5275%2C1005.3666%2C1005.5585%2C1005.1317%2C1005.3486%2C1005.4809%2C1005.1285%2C1005.4828%2C1005.1486%2C1005.0918%2C1005.3939%2C1005.1763%2C1005.2331%2C1005.5016%2C1005.3855%2C1005.4677%2C1005.1889%2C1005.2740%2C1005.3184%2C1005.3394%2C1005.5002%2C1005.1724%2C1005.2244%2C1005.0954%2C1005.1378%2C1005.0564%2C1005.1380%2C1005.0866%2C1005.2387%2C1005.3009%2C1005.2542%2C1005.1538%2C1005.2820%2C1005.4665%2C1005.2131%2C1005.4551%2C1005.4355%2C1005.5361%2C1005.1457%2C1005.4293%2C1005.5604%2C1005.0347&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A mass transport directed from low to high density region in an inhomogeneous\nmedium is modeled as a limiting case of a two-component lattice gas with\nexcluded volume constraint and one of the components fixed. In the\nlong-wavelength approximation, density relaxation of mobile particles is\ngoverned by a diffusion process and interaction with a medium inhomogeneity\nrepresented by a static component distribution. It is shown that density\nrelaxation can be locally accompanied by a density distribution compression. In\nquasi one-dimensional case, the compression dynamics manifests itself in a\nhopping-like motion of diffusing substance packet front position due to a\nstaged passing through inhomogeneity barriers and leads to a fragmentation of a\npacket and retardation of its spreading. A root-mean-square displacement\nreflects only an averaged packet front dynamics and becomes inappropriate as a\ntransport characteristic in this regime. In a stationary case mass transport\nthroughout a whole system may be directed from a boundary with low\nconcentration towards a boundary with that of high one. Implications of the\nexcluded volume constraint and particles distinguishability for these effects\nare discussed."}, "authors": ["Sergei P. Lukyanets", "Oleksandr V. Kliushnychenko"], "author_detail": {"name": "Oleksandr V. Kliushnychenko"}, "author": "Oleksandr V. Kliushnychenko", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.82.051111", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.4551v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.4551v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.4551v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.4551v1", "journal_reference": "Phys. Rev. E 85, 051111 (2010)", "doi": "10.1103/PhysRevE.82.051111", "fulltext": "Distinguishability of particles and its implications\nfor peculiar mass transport in inhomogeneous media\nSergei P. Lukyanets1, ∗ and Oleksandr V. Kliushnychenko2\n1\n\narXiv:1005.4551v1 [cond-mat.dis-nn] 25 May 2010\n\n2\n\nInstitute of Physics of National Academy of Sciences of Ukraine, Prospect Nauki 46, 03028 Kyı̈v, Ukraine\nDepartment of Natural Sciences, National University of Kyı̈v-Mohyla Academy, 2 Skovorody Str., 04655 Kyı̈v, Ukraine\nA mass transfer directed from low to high density region in an inhomogeneous medium is modeled\nas a limiting case of a two-component lattice gas with excluded volume constraint and one of the\ncomponents fixed. In the long-wavelength approximation, density relaxation of mobile particles\nis governed by a diffusion process and interaction with a medium inhomogeneity represented by\na static component distribution. It is shown that density relaxation can be locally accompanied\nby a density distribution compression. In quasi one-dimensional case, the compression dynamics\nmanifests itself in a hopping-like motion of diffusing substance packet front position due to a staged\npassing through inhomogeneity barriers and leads to a fragmentation of a packet and retardation\nof its spreading. A root-mean-square displacement reflects only an averaged packet front dynamics\nand becomes unappropriate as a transport characteristic in this regime. In a stationary case mass\ntransport throughout a whole system may be directed from a boundary with low concentration\ntowards a boundary with that of high one. Implications of the excluded volume constraint and\nparticles distinguishability for these effects are discussed.\nPACS numbers: 47.11.Qr; 68.35.Fx; 68.43.Jk\n\nI.\n\nINTRODUCTION\n\nMass transfer in inhomogeneous media and complex\nsystems is often governed by nonclassical diffusion laws\nand exhibits peculiar transport effects. Specific examples\ninclude sub- or superdiffusion processes of, for example,\nBrownian particles in hydrodynamic flow [1–4], and absolute negative mobility effect [5–13]. Very often, studying\nsuch effects we encounter a situation where relaxation\ngoes in counterintuitive way, namely, instead of expected\nspreading density distribution undergoes compression, at\nleast over certain time period, or even full collapse. In\nother words, mass transport is directed from low to high\ndensity region. In particular, such behavior occurs in\nsystems with absolute negative mobility or negative diffusion coefficient.\nThe phenomenon of absolute negative mobility or negative diffusion coefficient may be of different origin. In\nparticular, it can occur due to time- or particle-particle\ncorrelations, or nonequilibrium character of a process.\nThis effect was demonstrated, for example, in electronhole plasma, as an electron-drag effect arising from\nan electron-hole scattering [5], in models of interacting\nBrownian particles [11–13] or interacting lattice gas [14],\nand for nonequilibrium dynamics of Brownian particle\nin a periodic one-dimensional potential or a quasi onedimensional channel in a presence of external force periodic in time [7–9]. Note that the negative sign of diffusion coefficient entails absolute instability in a system\nand may signify the onset of a new phase formation, e.g.,\nnuclei growth at first order phase transition [14, 15] or\ncollapse of electron-hole plasma that may be a precursor\n\n∗ Email\n\naddress: lukyan@iop.kiev.ua\n\nfor a neutral exciton formation. [16].\nThe phenomenon of mass transfer from low to high\ndensity region also may be caused by an interaction of\nparticles with medium inhomogeneity. In this case density relaxation through this interaction may go much\nfaster than via diffusion process, and, as a result, the\nlatter may not be a main relaxation and entropy production mechanism [16]. A simple, although speculative,\nexample of such a density relaxation is a non-wettability\neffect, caused by interaction between a liquid drop and\na substrate (medium). Analogous effect in diffusive systems will be of primary interest in this paper.\nHere we demonstrate that such an effect may naturally\nappear for diffusing particles in inhomogeneous media.\nIn this case density relaxation dynamics in a subdiffusive regime can be locally accompanied by compression\nof density distribution. Moreover, in a stationary case,\nmass transport through the inhomogeneous sample can\ngo from a boundary with low concentration to a boundary with that of high one.\nIn order to demonstrate these effects we resort to the\nsimplest model of a two-component lattice gas assuming\nthat every lattice site can be occupied by one particle\nonly (excluded volume constraint). In the limiting case\nof a frozen or static component this model reduces to the\nmass transport of mobile component in the inhomogeneous medium. Another reason to use such a model is an\nappearance of a drag effects, which has been found in this\nframework in a presence of driving field and nonzero particle hopping rates of both components, see, e.g., [17, 18].\nIn addition, absolute negative mobility effect may appear\nin a case of non-Markov dynamics [10]. Two component\nlattice gas may also display memory effects. For example, correlation between jumps of tagged particle and its\ninfluence on tracer diffusion was examined in [19, 20].\nThis correlation represents the tendency of a tagged par-\n\n\f2\nticle to return to its previous position and it follows from:\n(i) a presence of different particle sort, i.e. particle distinguishability, and (ii) the excluded volume constraint.\nThe latter corresponds to infinite repulsion energy between particles at the same lattice site. Formally, such\n\"back correlations\" describe a repulsion of a tagged atom\nfrom the other gas component.\nII.\n\nTHE MODEL\n\nWe consider the simplest model of a two-component\nlattice gas on a regular lattice, see, e.g., [19]. It is assumed that every lattice site can be occupied by a single\nparticle of a sort m or n only. Particles can hop between\nneighboring sites separated by a distance a with rates νm\nand νn , respectively. Hopping events are assumed to be\ninstantaneous, i.e., particle spends most of the time being\nlocalized on a lattice site. Rate equations for occupation\nnumbers can be written as [19]\nX\ndm̂i\n[m̂j (1 − m̂i − n̂i ) − m̂i (1 − m̂j − n̂j )], (1a)\n= νm\ndτ\nj\nX\ndn̂i\n[n̂j (1 − n̂i − m̂i ) − n̂i (1 − n̂j − m̂j )]. (1b)\n= νn\ndτ\nj\nHere m̂i = {0, 1} and n̂i = {0, 1} are local occupation\nnumbers of m and n particles' sort at ith site, respectively, and sum is taken over nearest neighbors of ith site\nonly. Equations (1) are based on the assumption that\nit is possible to neglect fluctuations in the number of\njumps between sites i and j [21], and terms of the type\nνm m̂j (1 − m̂i − n̂i )dτ gives a mean number of jumps (of\nm-particle from site j to site i per time dτ in this particular case).\nIn what follows we shall restrict our study to a macroscopic dynamics. The simplest, if somewhat rough, way\nto obtain evolution equations for the average local occupation numbers mi = hm̂i i (h...i being statistical average)\nis to apply the mean field approximation [22] or the local\nequilibrium approximation [21]. The latter corresponds\nto the introduction of a local chemical potential associated with a given lattice site, or a coarsened Zubarev\nstatistical operator [23]. In this approach we lose all the\ninformation on fast (as compared to local equilibration\ntime) processes and neglect any correlations.\nNext, we apply the long-wavelength approximation assuming lattice constant a to be much smaller than characteristic inhomogeneity length scales lm and ln of m and\nn components, respectively, lm ∼ ln ≫ a. In the continuum limit, equations of motion for the densities take the\nform\n1 dm\n= ∇[∇m − (n∇m − m∇n)],\n(2a)\nνm dτ\n1 dn\n= ∇[∇n − (m∇n − n∇m)],\nνn dτ\n\n(2b)\n\nwhere we have introduced dimensionless coordinate r/a.\nObtained equations describe smooth density profiles and\ncan not be applied for length scales which are comparable with a lattice constant, lm ∼ ln ∼ a, where shortrange correlations become significant, as near percolation\nthreshold, see [19]. Note that in the case where inhomogeneity length scales of two components drastically differ, say lm ≫ ln ≫ a, higher orders of space derivatives\nshould be taken into account in Eqs. (2).\nMore general form of Eqs. (2) including terms taking\ninto account external driving field have been obtained\nusing mean field approximation [22] or phenomenological\napproach [17, 24], and exploited for investigation of phase\ntransitions [17, 22, 24], drifting spatial structures [25],\nand unusual transport effects in two-component driven\ndiffusive systems [18, 25].\nThe main difference of Eqs. (2) from the ordinary\ndiffusion equation is a presence of mixing flux jmn =\nn∇m − m∇n = −jnm . This flux describes mutual drag\nof particles of one sort by particles of another one. It is\ncaused by the two same reasons as a \"back correlations\"\n[19], mentioned above. The first one is a distinguishability of two different sorts of particles, e.g., by spin or\ncolor. The second one is a local interaction (repulsion)\nbetween particles created by excluded volume constraint.\nThe flows of gas components jm ≡ −νm ∇m +\nνm (n∇m − m∇n) and jn ≡ −νn ∇n + νn (m∇n − n∇m)\ncan be represented as sums of diffusive and hydrodynamic\nparts. For example, for m-component, jm = jdm + jhm , the\nflow jdm = −νm (1 − n)∇m ≡ −Dm ∇m describes diffusion of m-particles through vacant sites, unoccupied by nparticles, with local diffusion coefficient Dm ≡ νm (1 − n).\nTerm jhm = m(−νm ∇n) ≡ mVm may be associated with\ntransfer of m-particles by some hydrodynamic flow with\nvelocity Vm = −νm ∇n, where concentration n of another component plays a role of a velocity potential. jn\ncan be analyzed along the same line.\nThe drag of particles of one sort by particles of another\nsort directly follows from Eqs. (2). Consider the particular case where characteristic inhomogeneity length scale\nof one component is much smaller than that of another\ncomponent, say, lm ≫ ln ≫ a. To a first approximation,\ncurrents of both components are governed by a concentration gradient of the single component, ∇n, at least for\na certain period of time:\n1 dm\n≈ ∇(m∇n),\nνm dτ\n\n1 dn\n≈ ∇[(1 − m)∇n].\nνn dτ\n\n(3)\n\nThe drag effect particularly means that mass transfer\nof m-particles can be directed along their concentration\ngradient, ∇m, i.e., from region with low concentration to\nregion with that of high one.\nWe will be interested in consequences of the drag effect in the limiting case where hoping rate of n-particles\nis negligibly small in comparison with m-ones, νn ≪ νm .\nIt is intuitively clear that this is some approximation of\nmass transport in an inhomogeneous medium where diffusion of mobile m-particles occurs through vacant sites\n\n\f3\nunoccupied by \"heavy\" n-particles. Considering component n as a static one, we can write reduced equation of\nmotion for a density of mobile component m\ndm\n= ∇[(1−n)∇m+m∇n] = (1−n)∇2 m+m∇2 n, (4)\ndt\nwhere t = νm τ . Equation (4) describes advectiondiffusion with compressible flow (∇2 n 6= 0). Equation\nof this type is often used for the description of a transport in various systems [1, 2]. In a compressible flow,\ntransport may exhibit intriguing effects as it is in the\npresence of stable foci (traps) of the flow [1]. In our case,\nthe hydrodynamic flow, ∼ m∇n, is associated with a repulsion of mobile particles from the frozen component.\nThus, density relaxation of mobile particles is governed\nby both diffusive mechanism and their interaction with\n\"internal\" field ∇n.\n\nIII.\n\nINFLUENCE OF AN INTERNAL MEDIUM\nFIELD\n\nAs it is well known, the advection-diffusion can exhibit\nanomalous behavior that manifests itself, in particular,\nin non-classical dependence of a root-mean-square displacement on time, R = hr2 i1/2 ∼ tζ , where ζ 6= 1/2\nis the exponent of anomalous diffusion [1]. In the case\nof compressible flow considered here (∇2 n 6= 0), the exponent ζ may lose universality and may depend on the\ndegree of compressibility. Such anomalous phenomenon\nis not necessarily takes place asymptotically in the limit\nt → ∞, but can occur, at least, on a time scale that is\nless than a finite mixing time [1, 4]. On this time scale,\ndensity relaxation may strongly depend on initial state\nand demonstrate peculiar behavior.\nIn this section we show that mass transport from low\ndensity region towards a dense one in an inhomogeneous\nmedium may locally accompany subdiffusive (ζ < 1/2)\nprocess. Moreover, such integral characteristic as a rootmean-square displacement R does not describe relaxation\nprocess properly. Unlike in the case of ordinary diffusion,\nmotion of packet front rf (t) does not coincide with a\nroot-mean-square displacement time dependence and has\nphased behavior.\nIndeed, at relatively low values of gradient ∇m mass\ntransfer is determined by the second term in right hand\nside of Eq. (4), ṁ ≈ m∇2 n, which, at least over short\ntime period, leads to the dependence\nm(r, t) ≈ m(r, 0) exp(t∇2 n(r)).\n\n(5)\n\nBehavior of a density profile m(r, t) in the vicinity of\nfrozen component distribution n(r) local maxima and\nminima is different. Near minima, where n(rmin + δr) ≈\nnmin (1 + q 2 (δr)2 ), mobile particles tend to accumulate,\ni.e., initial density profile is squeezing,\nm(r, t) ≈ m(r, 0) exp(tq 2 nmin ),\n\n(6)\n\nwhich means that mass transfer may occur towards\nhigher concentration region. Contrary to that, mobile\nparticles tend to evacuate from regions close to maxima,\nwhere n(rmax +δr) ≈ nmax (1−q 2 (δr)2 ), which can be interpreted as forcing mobile component out by the frozen\none\nm(r, t) ≈ m(r, 0) exp(−tq 2 nmax ).\n\n(7)\n\nSuch exponential dynamics indicates a presence of the\nfaster process than that of diffusive, which locally, over\nshort time periods, leads to the dependence Rloc ∼ t,\nwhile in the case of anomalous diffusion R ∼ tζ , with\nζ < 1. In this regard, such global integral characteristic\nas root-mean-square displacement\n\u0012R 2\n\u00131/2\np\nx m(x, t) dx\nR\nR(t) = hx2 i =\n(8)\nm(x, t) dx\nmay be improper for the description of a diffusion process\ndue to loss of information on fast local dynamics.\nA.\n\nPacket fragmentation and hoping dynamics of\nits front position\n\nIn order to illustrate features of the transport phenomenon in an inhomogeneous medium described by\nEq. (4), we consider relaxation process in quasi onedimensional case, supposing that transverse size L⊥ of\na system is of the order of magnitude or less than characteristic inhomogeneity length scale of the densities m\nand n, L⊥ ≤ lm ∼ ln . Then equation (4) reduces to\nṁ = (1 − n)∂x2 m + m∂x2 n,\n\n(9)\n\nwhere ∂x labels one-dimensional derivative.\nWe will consider spreading of initial Gaussian distribution\nm(x, 0) = M exp(−x2 /4l2 )\n\n(10)\n\nin a periodic field of the frozen component\nn(x) = (N/2)(1 − cos k0 x).\n\n(11)\n\nDegree of medium inhomogeneity is determined by the\namplitude N and period 2πk0−1 of the frozen component.\nAs it can be seen from Fig. 1(a), presence of inhomogeneity slows down packet spreading. Such slowing down\nmay be caused by decreasing of effective diffusion coefficient (renormalization of time) and/or decreasing of index ζ, which characterizes subdiffusive regime (see inset\nat Fig. 1(a)). However, similar behavior of index ζ (see\ninset at Fig. 1(b)) is given by Eq. (9) with only diffusion\nterm included ṁ = ∂x [(1 − n)∂x m], where relaxation has\nanother character, Fig. 1(b). Packet fragmentation is associated with the second term in Eq. (4), which describes\nrepulsion of light atoms from heavy ones. If this term is\ndominant, mass transfer does not go through a diffusive\n\n\f4\n\nFIG. 1: a) Density distribution m(x, t) for different values of\nN at t = 31888; b) m1 (x) is the density distribution, given by\nequation ṁ1 = ∂x [(1 − n)∂x m1 ], m2 (x) obeys Eq. (9). Insets\ndisplay corresponding index behavior ζ(ln t) = ln R(t)/ ln t,\nwhere R(t) is given\n√ by Eq. (8). Initial amplitude M = 0.1,\ninitial half-width 2l = 14.14, and k0 = 0.1 are used in both\n(a) and (b) cases.\n\nmechanism, described by the first term in right hand side\nof Eq. (4), but instead occurs due to interaction with a\nheavy subsystem.\nAs it directly follows from Eq. (4), local flow jm of the\nmobile component is defined by two contributions,\njm = −(1 − n)∂x m − m∂x n.\n\n(12)\n\nThe first term, jdm = −(1 − n)∂x m ∼ −(1 − n)(m/lm ),\nwhere lm is typical length scale of m(x, t) variation near\nx, describes standard diffuse spreading, i.e., tendency of\ntransfer to be directed towards concentration lowering.\nPresence of the frozen component leads to a decrease\nof diffusion coefficient by the factor of 1 − n. Frozen\ncomponent plays the role of a barrier for mobile particles. As concentration n(x) (barrier height) increases\nthe velocity of penetration through the barrier by mobile atoms (diffusive flux jdm ) decrease as 1 − n. The flux\njhm = −m∂x n ∼ −m(nk0 ) describes repulsion of mobile\natoms from frozen one. Fluxes jdm and jhm , defined by a\n\ndensity gradients ∂x m and ∂x n, may have different signs\nand behave as two competing fluxes. If 1/n − 1 < lm k0 ,\nthen total flux jm may be locally directed towards region\nwith higher concentration, which means local compression of mobile atom distribution.\nFigure 2 illustrates dynamics of initial Gaussian distribution spreading, which has phased nature. Front\npropagation through the first barrier towards neighboring local profile minimum (depicted at Fig. 2(a)) consists of two stages. At first, particles locally accumulate\nin the minimum due to jhm domination until the condition 2/N − 1 > lm k0 for m(x, t) profile is met, or in\nother words, until local \"pressure\" (∝ ∂x m) gets high\nenough to overcome repulsion from next barrier. Expression 2/N − 1 > lm k0 defines the condition for diffusive\npenetration through the barrier. Then process repeats\nfor the next local minimum, while in the previous one\nparticles undergo usual spreading, Fig. 2(b). Such staged\nprocess describes motion of a packet front xf (t), which\nposition is determined by condition ṁ(xf , t) = 0, see\nFig. 2(c).\nFront xf (t) divides x-axis in two regions: (i) |x| < xf ,\nwhere concentration m(x, t) is decreasing for any x and\ndensity relaxation is going mainly due to diffusion with\ndiffusion coefficient renormalized by a profile of the frozen\ncomponent; (ii) |x| > xf , where concentration is increasing and relaxation is strongly affected by a repulsion from\nthe frozen component (medium inhomogeneity). The latter leads to a local compression and density increase.\nAs can be seen from Fig. 2(c), medium inhomogeneity,\nwhich in our case is determined by an amplitude N , leads\nto appearing of difference between packet's front motion\nxf (t) and root-mean-square displacement R(t) dynamics.\nFront xf (t) exhibits phased behavior and is governed by\ntwo linear in time, fast and slow processes. Packet front\nspends most of the time being localized inside a barrier\nand performs quick jumps into neighboring barriers while\nroot-mean-square displacement (Eq. (8)) gives only an\naveraged dynamics of front motion, see Fig. 2(c).\nB.\n\nCompressibility of initial density distribution\n\nCompression (growth) of density distribution also can\noccur for the central packet during certain initial time\ninterval. Indeed, from Eqs. (4),(10), and (11) it is easy to\nestimate behavior of distribution amplitude at the peak\nover short time periods,\nm(0, t) ≈ M +\n\nMt\n(N k02 l2 − 1).\n2l2\n\n(13)\n\nAmplitude m(0, t) tends to increase if N > (k0 l)−2 . On\nthe other hand, density distribution compression means\nthat velocity (time derivative) of a mean-square displacement v(t) = dhx2 i/dt is negative. The latter may be\nroughly estimated in Fourier domain\nv(t) = −\n\n1 2\n∂ ṁk\nm0 k\n\nk=0\n\n,\n\n(14)\n\n\f5\n\nFIG. 3: Central peak squeezing (growth) of a mobile component density profile during initial time interval [t0 , t1 ],\n(t0 = 0, t1 = 3 × 104 time units).\nInitial amplitude M = 0.1,\n√\nN = 0.9, initial half-width 2l = 1.7, and k0 = 1.05. Shaded\npattern shows density distribution profile of the frozen component n(x), given by Eq. (11), arrows indicate directions of\npacket evolution. Filled region at the inset is determined by\ninequality (19) and condition N < 1, and corresponds to a\nnegative velocity of packet motion.\n\nwhere mk (t) is the Fourier image of m(x, t) and obeys\nequation\nṁk = −(N/4)[(k 2 − 2kk0 )mk−k0 ] −\n−(N/4)[(k 2 + 2kk0 )mk+k0 ] − k 2 [1 − (N/2)]mk . (15)\nSince v(t) is determined by limit k → 0, it is reasonable\nto approximate Eq. (15) by its expansion for small k (k ≪\nk0 )\nṁk ≈ −k 2 [1 − (N/2)]mk − (N/2)k 2 mk0\n∂\n∂2\n−N k 2 k0\nmk0 − (1/4)N k 4 2 mk0 ,\n∂k0\n∂k0\n\n(16)\n\nwhere we have omitted terms with m2k0 ≈ 0 assuming\nthat typical scale of inhomogeneity for m(x, t) is of the\norder or less than that of for n(x), i.e., k ≤ k0 . Taking\nlimit k → 0 we obtain expression for velocity\n\u0012\n\u0013\n∂\nN\n(17)\n1 + 2k0\nmk0 .\nv ≈ (2 − N ) −\nm0\n∂k0\nFIG. 2: Packet dynamics during time intervals: a) [t0 , t1 ],\nb) [t1 , t2 ]; (t0 = 0, t1 = 14 × 103 , t2 = 45 × 103 time units).\nInitial amplitude M = 0.5, amplitude of the frozen component\nN = 0.7. Shaded pattern shows density distribution profile of\nthe frozen component n(x), given by Eq. (11), arrows denote\nwhether sub-packet is squeezing (growing) (↑) or spreading\n(↓) on certain time interval. Dashed lines xif denote region of\nmain localization during corresponding time interval.\nc) Time dependence of packet front xf (t) defined as a point\nwhere ṁ = 0, and a root-mean-square displacement R(t) defined by Eq. (8), for different values of N . Lines' labels correspond to values of N . Dotted lines xif correspond to the\ndotted lines at Figs. 2 (a) and (b).\n\nHere mk0 is defined by the equation\n\u0013\n\u0012\nN\nN\n2\nmk0 + m0 .\nṁk0 ≈ −k0 1 −\n2\n4\n\n(18)\n\nFrom (17) condition for packet squeezing (v < 0) directly\nfollows, see inset at Fig. 3,\n2/N < 1 + (4k02 l2 − 1) exp(−k02 l2 ).\n\n(19)\n\nNumerical solution of Eq. (9) corresponding to such a\ncase is shown at Figure 3. Initial compression lasts for\n\n\f6\ncertain time period after which diffusion goes by means\nof sequential overcoming of potential barriers (as it was\ndiscussed in previous subsection). Note that the estimate\n(19) is rough and initial packet squeezing actually appear\nat smaller values of amplitude N , as shown at Fig. 3.\n\nIV.\n\nTHE STATIONARY CASE\n\nAs it was shown in the previous section, interaction\nof diffusing particles with inhomogeneities of a medium\nleads to a local particle accumulation, i.e., local mass\ntransport towards higher concentration. It is interesting\nthat such transport effect can be realized at global scale,\nthroughout a whole system, with arbitrary distribution\nn(x). In order to illustrate such a possibility we consider\nquasi one-dimensional boundary problem\n(1 − n)∂x2 m + m∂x2 n = 0\n\n(20)\n\nwith boundary conditions\nm(0) = m(0),\n\nm(L) = m(L),\n\n(21)\n\nwhere L is a sample length. Solution of Eq. (20) has the\nform\n\u0012\n\u0013\nZ x\nm(0)\ndξ\nm(x) = (1−n(x))\n, (22)\n−J\n2\n1 − n(0)\n0 (1 − n(ξ))\nwhere J is a total particle flux through the system\nJ =−\n\n\u0012Z\n\nL\n0\n\ndξ\n[1 − n(ξ)]2\n\n\u0013−1 \u0012\n\nm(L)\nm(0)\n−\n1 − n(L) 1 − n(0)\nZ\n1 L\n=\njm (x) dx.\nL 0\n\n\u0013\n\n=\n(23)\n\nIn the last expression jm (x) is given by Eq. (12).\nAs we see, stationary density distribution m(x) may be\ninhomogeneous even if concentrations at the boundaries\nm(L) = m(0) are equal.\nAs it was mentioned above, mass transfer in such a\nsystem is governed not only by the mean field of m(x)\ngradient, but also by interaction of a mobile subsystem\nwith a frozen one. As it follows directly from Eq. (12)\nmass transfer may go from lower concentrations towards\nhigher one. Assuming m(L) > m(0) one gets, that flux J\nis directed towards the higher concentration region, i.e.,\nfrom the boundary x = 0 to the boundary x = L, if the\nfollowing condition is satisfied\n1 − n(L)\nm(L)\n<\n.\nm(0)\n1 − n(0)\n\n(24)\n\nThus total flux direction is determined by boundary conditions for m and n components.\n\nV.\n\nSUMMARY AND DISCUSSION\n\nThe presence of a second sort of particles in lattice gas\nleads to peculiar transport effects. In the case of a twocomponent gas mass transport is affected by an action of\nan additional flux, contrary to the case of a single component gas of indistinguishable particles. This flux is associated with mixing of different gas components (interdiffusion term) and in a presence of interaction between\nparticles such as excluded volume constraint in our case,\nand may lead to a drag of one sort of particles by another\none. If particles of one sort have negligibly small mobility in comparison with another sort, so that one sort is\nassumed to be static, then the mixing flux, or its part,\nof mobile particles transforms into a stationary hydrodynamic flow that may drag mobile particles. As a result,\ndensity relaxation of mobile particles occurs via diffusion\nprocess and/or via an interaction with a medium, i.e.,\nwith a frozen gas component.\nIn our paper we have presented a case of a system\nwhere diffusive mechanism cooperates with density relaxation under action of \"internal medium field\", given\nby a periodic distribution of a static component. Such\nmutual cooperation leads to unusual transport with local\nmass transfer resulting in an increase of concentration.\nIndeed, as it was shown, if medium is strongly inhomogeneous, its \"field\" leads to a local accumulation of\ndiffusing particles in minima of inhomogeneity profile.\nPresence of such a local processes is manifested by fragmentation of a packet during its spreading. The dynamics of a diffusive process also becomes peculiar and mass\ntransport occurs as sequential penetration through inhomogeneity barriers, i.e. regions with high concentration\nof the static component. This leads to a phased character\nof a packet front motion that consists of a sequence of fast\nand slow processes (moves) with linear in time coordinate\ndependence. Such front behavior is similar to motion\nof a defect (slow motion inside barrier and fast passing\nthrough inhomogeneity minima). Contrary to the case\nof ordinary diffusion behavior of a root-mean-square displacement R(t) and that of a packet front xf (t) do not\ncoincide. R(t) reflects only an averaged packet front dynamics. Local accumulation of particles, which accompanies diffusive process and sequential barriers overcoming, also slows down packet spreading. The latter entails\nsubdiffusive regime. In stationary case interaction of diffusing particles with medium inhomogeneity can lead to\nmass transport directed from a boundary with low concentration to a boundary with that of high one.\nNote, that quasi one-dimensional case considered in\nthis work is rather illustrative, because dimensionality reduction leads to enhancement of particle-particle correlations. In two- and three-dimensional cases demonstrated\neffects may not be so pronounced. However, accounting\nfor interparticle interaction on nearest neighboring sites\nleads to essential changes in mass transport [14] and may\nenhance discussed effects.\nNote, that assigning appropriate mobilities to compo-\n\n\f7\nnents in Eqs. (2) we can model not only inhomogeneous\nmedia but also systems with quenched randomness, as it\nwas pointed out in [17, 24], or, for example, quenched\ninhomogeneities, dynamically generated in glasses [26].\nDistinguishability of two sorts of particles and excluded volume constraint are responsible for unusual\ntransport effects appearing in two-component lattice gas.\nNote, these effects may speculatively be considered as a\npurely statistical consequence of particles' distinguishability in a multicomponent non-interacting Fermi gas.\nEquations (2) have been obtained using rough approximations, which entails certain limitations on their validity. First of all we neglect fast processes in the system, as\nit is generally the case for the diffusion approximation,\nthe framework basic Eqs. (1) are written in. In addition,\nLangevin source of fluctuations in a number of jumps\nbetween lattice sites was omitted in Eqs. (1). We also\nloose information on fast processes applying the meanfield approximation which is equivalent to the local equi-\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n\nM. B. Isichenko, Rev. Mod. Phys. 64, 961 (1992).\nM. Sahimi, Rev. Mod. Phys., 65, 1393 (1993).\nO. G. Bakunin, Sov. Phys. Usp. 46, 733 (2003).\nJ.-P. Bouchaud, A. Georges, Phys. Rep. 195, 127 (1990).\nR. A. Höpfel, J. Shah, P.A. Wolff, and A.C. Gossard,\nPhys. Rev. Lett. 56, 2736 (1986).\nL. Machura, M. Kostur, P. Talkner, J.Luczka, and\nP. Hänggi, Phys. Rev. Lett., 98, 040601 (2007)\nR. Eichhorn, P. Reimann, P. Hänggi, Physica A 325, 101\n(2003).\nR. Eichhorn, P. Reimann, P. Hänggi, Phys. Rev. Lett.\n88, 190 601(2002).\nR. Eichhorn, P. Reimann, P. Hänggi, Phys. Rev. E 66,\n066 132(2002).\nB. Cleuren, C. Van den Broeck, Phys. Rev. E 65,\n030101(R) (2002)\nS. E. Mangioni, R. R. Deza, H. S. Wio, Phys. Rev. E 63,\n041 115 (2001).\nB. Cleuren, C. Van den Broeck, Europhys. Lett. 54, 1\n(2001).\nJ. Buceta, J. M. Parrondo, C. Van den Broeck,\nF. J. de la Rubia, Phys. Rev. E, 61 6287 (2000).\nP. Argyrakis, A. A. Chumak, M. Maragakis, and\nN. Tsakiris, Phys. Rev. B 80, 104203 (2009).\n\nlibrium one. This approximation also means that we neglect any correlations in the system, in particular, shortrange \"back correlations\" (local memory effect) [19, 20]\nthat are known to contribute to effective diffusive process. The long-wavelength approximation does not allow\nto consider mass transport on length scales comparable\nwith the lattice distance. In particular, it is in a vicinity\nof percolation threshold where short-range correlations\nbecome significant.\n\nAcknowledgments\n\nAuthors thank P. M. Tomchuk, B. I. Lev,\nV. V. Ieliseieva, O. O. Chumak, K. S. Karplyuk,\nV. V. Obukhovsky, and D. A. Bevzenko for stimulating\ndiscussions and useful suggestions.\n\n[15] I. M. Lifshitz and V. V. Slyozov, J. Phys. Chem. Solids\n19, 35 (1961).\n[16] A. L. Efros, Phys. Rev. B 78, 155130 (2008).\n[17] B. Schmittmann and R. K. P. Zia, in Phase Transitions and Critical Phenomena, edited by C. Domb and\nJ. L. Lebowitz (Academic, New York, 1995), Vol. 17.\n[18] R. S. Hipolito, R. K. P. Zia, and B. Schmittmann,\nJ. Phys. A: Math. Gen. 36, 4963 (2003).\n[19] R. A. Tahir-Kheli and R. J. Elliott, Phys. Rev. B 27, 844\n(1983).\n[20] P. Argyrakis and A. A. Chumak, Phys. Rev. B 66, 054303\n(2002).\n[21] A. A. Chumak and A. A. Tarasenko, Surf. Sci. 91, 694\n(1980).\n[22] K.-t. Leung, Phys. Rev. Lett. 73, 2386 (1994).\n[23] D. N. Zubarev, Nonequilibrium statistical thermodynamics, (Plenum, New York, 1974).\n[24] B. Schmittmann, K. Hwang, and R. K. P. Zia, Europhys. Lett. 19, 19 (1992).\n[25] K.-t. Leung and R. K. P. Zia, Phys. Rev. E 56, 308\n(1997).\n[26] M. H. Vainstein, D. A. Stariolo, and J. J. Arenzon,\nJ. Phys. A 36, 10907 (2003).\n\n\f"}