{"id": "http://arxiv.org/abs/1004.5191v4", "guidislink": true, "updated": "2013-02-13T14:07:50Z", "updated_parsed": [2013, 2, 13, 14, 7, 50, 2, 44, 0], "published": "2010-04-29T06:33:05Z", "published_parsed": [2010, 4, 29, 6, 33, 5, 3, 119, 0], "title": "An Exact Connection between two Solvable SDEs and a Nonlinear Utility\n  Stochastic PDE", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5400%2C1004.0773%2C1004.0997%2C1004.5206%2C1004.2569%2C1004.2803%2C1004.5095%2C1004.1185%2C1004.2208%2C1004.5297%2C1004.0053%2C1004.4029%2C1004.4324%2C1004.3049%2C1004.2063%2C1004.0780%2C1004.2549%2C1004.2338%2C1004.5179%2C1004.1382%2C1004.2125%2C1004.2725%2C1004.5170%2C1004.5191%2C1004.3972%2C1004.2876%2C1004.4476%2C1004.1455%2C1004.1838%2C1004.4098%2C1004.5327%2C1004.0300%2C1004.1741%2C1004.5287%2C1004.1483%2C1004.5271%2C1004.0381%2C1004.5555%2C1004.0888%2C1004.1255%2C1004.5317%2C1004.2570%2C1004.5101%2C1004.0062%2C1004.2106%2C1004.0810%2C1004.0070%2C1004.3107%2C1004.1690%2C1004.2365%2C1004.2623%2C1004.2600%2C1004.2908%2C1004.0788%2C1004.3927%2C1004.4930%2C1004.1558%2C1004.5144%2C1004.0037%2C1004.2051%2C1004.4053%2C1004.4992%2C1004.0858%2C1004.4115%2C1004.1993%2C1004.0392%2C1004.2520%2C1004.0382%2C1004.4778%2C1004.5472%2C1004.0004%2C1004.4087%2C1004.3962%2C1004.4814%2C1004.0113%2C1004.2726%2C1004.1539%2C1004.5174%2C1004.0152%2C1004.2859%2C1004.1107%2C1004.1896%2C1004.3833%2C1004.2897%2C1004.4034%2C1004.4338%2C1004.1978%2C1004.2144%2C1004.1737%2C1004.1923%2C1004.4416%2C1004.3965%2C1004.0980%2C1004.0534%2C1004.2685%2C1004.2079%2C1004.1313%2C1004.5589%2C1004.4507%2C1004.4912%2C1004.4811&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An Exact Connection between two Solvable SDEs and a Nonlinear Utility\n  Stochastic PDE"}, "summary": "Motivated by the work of Musiela and Zariphopoulou \\cite{zar-03}, we study\nthe It\\^o random fields which are utility functions $U(t,x)$ for any\n$(\\omega,t)$. The main tool is the marginal utility $U_x(t,x)$ and its inverse\nexpressed as the opposite of the derivative of the Fenchel conjuguate\n$\\tU(t,y)$. Under regularity assumptions, we associate a $SDE(\\mu, \\sigma)$ and\nits adjoint SPDE$(\\mu, \\sigma)$ in divergence form whose $U_x(t,x)$ and its\ninverse $-\\tU_y(t,y)$ are monotonic solutions. More generally, special\nattention is paid to rigorous justification of the dynamics of inverse flow of\nSDE. So that, we are able to extend to the solution of similar SPDEs the\ndecomposition based on the solutions of two SDEs and their inverses. The second\npart is concerned with forward utilities, consistent with a given incomplete\nfinancial market, that can be observed but given exogenously to the investor.\nAs in \\cite{zar-03}, market dynamics are considered in an equilibrium state, so\nthat the investor becomes indifferent to any action she can take in such a\nmarket. After having made explicit the constraints induced on the local\ncharacteristics of consistent utility and its conjugate, we focus on the\nmarginal utility SPDE by showing that it belongs to the previous family of\nSPDEs. The associated two SDE's are related to the optimal wealth and the\noptimal state price density, given a pathwise explicit representation of the\nmarginal utility. This new approach addresses several issues with a new\nperspective: dynamic programming principle, risk tolerance properties, inverse\nproblems. Some examples and applications are given in the last section.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5400%2C1004.0773%2C1004.0997%2C1004.5206%2C1004.2569%2C1004.2803%2C1004.5095%2C1004.1185%2C1004.2208%2C1004.5297%2C1004.0053%2C1004.4029%2C1004.4324%2C1004.3049%2C1004.2063%2C1004.0780%2C1004.2549%2C1004.2338%2C1004.5179%2C1004.1382%2C1004.2125%2C1004.2725%2C1004.5170%2C1004.5191%2C1004.3972%2C1004.2876%2C1004.4476%2C1004.1455%2C1004.1838%2C1004.4098%2C1004.5327%2C1004.0300%2C1004.1741%2C1004.5287%2C1004.1483%2C1004.5271%2C1004.0381%2C1004.5555%2C1004.0888%2C1004.1255%2C1004.5317%2C1004.2570%2C1004.5101%2C1004.0062%2C1004.2106%2C1004.0810%2C1004.0070%2C1004.3107%2C1004.1690%2C1004.2365%2C1004.2623%2C1004.2600%2C1004.2908%2C1004.0788%2C1004.3927%2C1004.4930%2C1004.1558%2C1004.5144%2C1004.0037%2C1004.2051%2C1004.4053%2C1004.4992%2C1004.0858%2C1004.4115%2C1004.1993%2C1004.0392%2C1004.2520%2C1004.0382%2C1004.4778%2C1004.5472%2C1004.0004%2C1004.4087%2C1004.3962%2C1004.4814%2C1004.0113%2C1004.2726%2C1004.1539%2C1004.5174%2C1004.0152%2C1004.2859%2C1004.1107%2C1004.1896%2C1004.3833%2C1004.2897%2C1004.4034%2C1004.4338%2C1004.1978%2C1004.2144%2C1004.1737%2C1004.1923%2C1004.4416%2C1004.3965%2C1004.0980%2C1004.0534%2C1004.2685%2C1004.2079%2C1004.1313%2C1004.5589%2C1004.4507%2C1004.4912%2C1004.4811&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Motivated by the work of Musiela and Zariphopoulou \\cite{zar-03}, we study\nthe It\\^o random fields which are utility functions $U(t,x)$ for any\n$(\\omega,t)$. The main tool is the marginal utility $U_x(t,x)$ and its inverse\nexpressed as the opposite of the derivative of the Fenchel conjuguate\n$\\tU(t,y)$. Under regularity assumptions, we associate a $SDE(\\mu, \\sigma)$ and\nits adjoint SPDE$(\\mu, \\sigma)$ in divergence form whose $U_x(t,x)$ and its\ninverse $-\\tU_y(t,y)$ are monotonic solutions. More generally, special\nattention is paid to rigorous justification of the dynamics of inverse flow of\nSDE. So that, we are able to extend to the solution of similar SPDEs the\ndecomposition based on the solutions of two SDEs and their inverses. The second\npart is concerned with forward utilities, consistent with a given incomplete\nfinancial market, that can be observed but given exogenously to the investor.\nAs in \\cite{zar-03}, market dynamics are considered in an equilibrium state, so\nthat the investor becomes indifferent to any action she can take in such a\nmarket. After having made explicit the constraints induced on the local\ncharacteristics of consistent utility and its conjugate, we focus on the\nmarginal utility SPDE by showing that it belongs to the previous family of\nSPDEs. The associated two SDE's are related to the optimal wealth and the\noptimal state price density, given a pathwise explicit representation of the\nmarginal utility. This new approach addresses several issues with a new\nperspective: dynamic programming principle, risk tolerance properties, inverse\nproblems. Some examples and applications are given in the last section."}, "authors": ["Nicole El Karoui", "Mohamed Mrad"], "author_detail": {"name": "Mohamed Mrad"}, "author": "Mohamed Mrad", "links": [{"href": "http://arxiv.org/abs/1004.5191v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.5191v4", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.5191v4", "affiliation": "CMAP", "arxiv_url": "http://arxiv.org/abs/1004.5191v4", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "An Exact Connection between two Solvable SDEs and a Nonlinear\nUtility Stochastic PDE\n\narXiv:1004.5191v4 [math.PR] 13 Feb 2013\n\nEl Karoui Nicole,\n\n‡\n\n∗†\n\nMrad Mohamed\n\n§\n\nNovember 30, 2012\n\nAbstract\nMotivated by the work of Musiela and Zariphopoulou [24], we study the Itô random fields\nwhich are utility functions U (t, x) for any (ω, t). The main tool is the marginal utility Ux (t, x) and\ne (t, y). Under\nits inverse expressed as the opposite of the derivative of the Fenchel conjuguate U\nregularity assumptions, we associate a SDE(μ, σ) and its adjoint SPDE(μ, σ) in divergence form\ney (t, y) are monotonic solutions. More generally, special attention\nwhose Ux (t, x) and its inverse −U\nis paid to rigorous justification of the dynamics of inverse flow of SDE. So that, we are able to\nextend to the solution of similar SPDEs the decomposition based on the solutions of two SDEs\nand their inverses.\nThe second part is concerned with forward utilities, consistent with a given incomplete financial\nmarket, that can be observed but given exogenously to the investor. As in [24], market dynamics are considered in an equilibrium state, so that the investor becomes indifferent to any action\nshe can take in such a market. After having made explicit the constraints induced on the local\ncharacteristics of consistent utility and its conjugate, we focus on the marginal utility SPDE by\nshowing that it belongs to the previous family of SPDEs. The associated two SDE's are related\nto the optimal wealth and the optimal state price density, given a pathwise explicit representation of the marginal utility. This new approach addresses several issues with a new perspective:\ndynamic programming principle, risk tolerance properties, inverse problems. Some examples and\napplications are given in the last section\n\nIntroduction\nThe concept of forward dynamic utility has been introduced by M. Musiela and T. Zariphopoulou\n(2003-2008 [24, 25, 27, 29]), to model possible changes over the time of individual preferences\n∗\n\nWith the financial support of the \"Chaire Risque Financier of the Fondation du Risque\", the \" Chaire Dérivés du\n\nfutur\" of the \"Fédération des banques Françaises\".\n†\nKeywords: Forward utility, performance criteria, horizon-unbiased utility, consistent utility, progressive utility,\nportfolio optimization, optimal portfolio, duality, minimal martingale measure, stochastic flows, stochastic partial differential equations.\n‡\n§\n\nLPMA, UMR CNRS 6632, Université Pierre et Marie Curie, CMAP, UMR CNRS 7641, École Polytechnique\nCMAP, UMR CNRS 7641, École Polytechnique, LAGA, UMR CNRS 7539, Université Paris 13\n\n1\n\n\fof an agent. The economic agent will adjust its preferences in uncertain universe based on the\ninformation that is revealed over time and represented by a filtration F = (Ft )t≥0 , defined on\nthe probability space (Ω, P, A). In contrast to the classical literature, there is no pre-specified\ntrading horizon at the end of which the utility datum is assigned. Rather, the agent starts with\ntoday's specification of its utility, U (0, x) = u(x), and then builds the process U (t, x) for t > 0 in\nrelation to the information given by (Ft )t≥0 . This, together with the choice of an initial utility,\ndistinguishes forward dynamic utility from recursive utility first introduced by Duffie and Epstein,\n[4], (see also [7]) for which the aggregator can be specified exogenously and the value function is\nrecovered backward in time. Dynamic utility may be also defined in relation with a exogenous\ninvestment universe X , described as an incomplete market whose the parameters are known by\nthe investor. Following [24], market dynamics are considered in an equilibrium state, so that the\ninvestor becomes indifferent to any action she can take in such a market. She is forced to embed\ninto his dynamic utility, structure information describing the equilibrium market dynamics. Such\nX - consistent utilities will be studied in the second part of the paper.\nSuch concept has also been studied by Berrier, Tehranchi and Rogers (2009) [1] and Zitkovic\n[41]. Further works related to this problem are Choulli, Stricker and Jia (2007) [36], Henderson\nand Hobson (2007) [11].\nWe start by introducing the general notion of progressive utility and its Fenchel transform.\nHowever, we restrict our study to positive progressive utility which is a collection of Itô's semimartingales with respect to a d-dimensional Brownian motion W , depending on a spatial parameter\nx ∈ R+ , also called the wealth. As usual, they are specified through their local (drift, volatility)\ncharacteristics (β, γ) and their initial condition, a deterministic concave function u, by\ndU (t, x) = β(t, x)dt + γ(t, x).dWt ,\n\nU (0, x) = u(x).\n\n(0.1)\n\nApart regularity issues, the first question to be solved is to give conditions on the local characteristics (β, γ), insuring the properties of monotonicity and concavity of the progressive utility U\ndefined by the forward equation (1.1). The problem is equivalent to show that the progressive\nmarginal utility Ux is strictly decreasing and strictly positive, with range (0, ∞). At this stage,\ne of U whose the opposite of\nit is convenient to introduce the Fenchel conjugate random field U\ne y is the inverse flow of Ux . Following Kunita [19], we introduce sufficient condithe derivative U\ntions implying that Ux is also an Itô progressive random field, with local characteristics (βx , γx ).\n(Theorem 2.2. All regularity issues are presented in details in Section 2.)\nThen we show that the random field Ux is a monotonic with respect to its initial condition,\nstrong solution of a one dimensional stochastic differential equation. The random coefficients of\ney . We give in\nthe SDE(μ, σ) are expressed in terms of the local characteristics βx and γx , and −U\nparticular, under some Lipschitz assumptions on SDE's coefficients, a clear answer to the existence,\nmonotonicity, regularity and concavity of random fields defined from (0.1) satisfying the Inada's\nconditions, which until now remained an open question.\ne and its derivative U\ney\nAdditional regularity are need to show that the conjugate random field U\nare also families of Itô's semimartingales, and to identify its local characteristics. The Itô-Ventzel\nformula enables us to carry out computations in a stochastically modulated dynamic framework.\ney (t, y), Itô-Ventzel's formula provides us\nApplied to the random field U and the semimartingale U\n\n2\n\n\fe , and the characterization of U\ney (t, y) as monotonic\ntwo complementary results: the dynamics of U\nsolution of the SPDE generated by the adjoint elliptic operator in divergence form associated with\nthe SDE(μ, σ) satisfied by Ux . A first connection between SDE and SPDE is then established.\nSection 2 is more technical. Based on the reference book of Kunita [19], we provide additional\nresults in both regularity of random fields, and behavior of SDE with local Lipschitz property. The\naim is to provide conditions under which the inverse of a monotonic solution of SDE(μ, σ) (for\ney (t, y)) is an Itô semimartingale, solution of the second-order SPDE(μ, σ)\ninstance the process −U\n(Theorem 2.5). Conversely, a regular monotonic solution of SPDE(μ, σ) is identified with the\ninverse of the monotonic solution of SDE(μ, σ). The link between SDE and second order SPDE is\nextended to more complex SPDE in the main result of this section, Theorem 2.7.\nIn the second part of the paper, we turn to consistent stochastic utilities, where the preferences\nare no more defined in isolation with a financial market. The dynamics of the market can be\nobserved but are exogenously given to the investor, modulo estimation of the relevant parameters\nby the equilibrium considerations or other procedures. Following [24], market dynamics are considered in an equilibrium state, so that the investor becomes indifferent to any action she can take\nin such a market. But, once characterized, the criterion may be used to solve classical optimization\nproblems as optimal allocation, indifference pricing [33].\nWorking with positive wealth processes X κ in an incomplete market, we define a consistent stochastic utility as a progressive non-negative stochastic utility U (t, x), for which U (t, Xtκ ) is a supermartingale, and a (local) martingale for a certain portfolio called optimal wealth, or optimal\nbenchmark. Section 3 is dedicated to set-up the financial market, and to identify the constraints\ninduced on the local characteristics (β, γ) of U by the consistency property, using once again the\nItô-Ventzel formula. As in the classical Hamilton-Jacobi-Bellman framework, we proceed by verification to establish the dynamics of consistent utilities. Assuming a sufficient constraint on the\ndrift β of HJB type, we get the utility SPDE that we investigate in this paper. In particular, we\nstudy the role of the utility risk premium defined by η U (t, x) = γx (t, x)/Ux (t, x). Simultaneously,\nwe go into details on the duality questions and give a characterization of the nonlinear SPDE\ne of U , and its optimal coefficients.\nsatisfied by the progressive convex conjugate U\nOur most original contribution is provided in Section 4, using a characterization of X -consistent\ndynamic utility from its marginal utility. Based on ideas developed in Section 2, we show that,\nunder regularity assumptions on the random field U, Ux is solution of a SPDE(2.9) associated\nwith the optimal coefficients for the wealth and state price density processes. Then, a first result\nshows that under natural assumptions yielding to the existence of strong optimal solution of the\nconjugate problem Yt∗ (y), the only locally Lipschitz SDE(μ∗ , σ ∗ ) has a monotonic non-explosive\nsolution Xt∗ (x). A simple application of Theorem 2.7 yields to the closed form of the marginal\nutility as Ux (t, x) = Yt∗ (ux ((Xt∗ )−1 (x))).\nThen, we consider the converse problem of recovering a dynamic utility coherent with a given\noptimal portfolio. In the classical case, this problem is known in the financial literature as the\n\"inverse\" Merton problem; it has been considered by many authors in particular by H.He and\nC.Huang (1992), [10]. Since the class of dynamic utilities is larger than the class of Markovian\nutilities considered in [10], our problem is easier to solve. Given a monotonic admissible portfolio X, for any regular state price density process Yt (y) and any initial condition ux such that\nV (t, x) = Yt∗ (ux ((Xt )−1 (x))) is integrable near to 0, is the marginal utility of some consistent dy-\n\n3\n\n\fnamic utility. So, we are able to generate all the consistent utilities with a given optimal portfolio.\nIn Section 4, Theorem 4.1, we establish the most original contribution of this paper. Indeed,\nfrom Theorem 2.7, focusing on the dynamics of the marginal utility Ux , we can read directly and\n\u0001\nwithout difficulties that the process Ux t, Xt∗ (x) is equal to the optimal dual state price density\nprocess Y ∗ (t, ux (x)) with u is the initial utility function. From this dual identity, the idea is very\n\u0001\nsimple and natural: Suppose that the optimal portfolio denoted by Xt∗ (x) t is strictly increasing\n\u0001\nwith respect to the initial capital, and denote by X (t, x) t the adapted inverse process, defined by\n\u0001\n\u0001\nXt∗ X (t, x) = x then, we can find Ux (t, x) from Ux (t, x) = Yt∗ ux (X (t, x)) . Finally we get U by\nintegration. So, we are able to generate all the consistent utilities with a given optimal portfolio.\nWe recover easily the martingale property of the risk tolerance established in [10], in a complete\nmarket. Finally, in Section 5, we close the paper by some openness to other topics and works;\nwe show the stability of the notion of consistent utility by change of numeraire and then, without\nloss of generality, we can consider the martingale market where the portfolios are simple local\nmartingales and the stochastic PDE's are easier to deal with. We also apply our method to the\nspecific example of decreasing consistent utilities (see [1] and [28]) where the volatility vector γ is\ngiven equal to zero, given a new interpretation of the optimal wealth as solution of sup-convolution\nproblems in random power utilities.\nTo the best of our knowledge, the characterization of strictly concave increasing random fields,\nsatisfying Inada's conditions, from SDEs have neither studied in details nor established in the\nliterature. Moreover, the fully nonlinear utility stochastic PDE's established in this paper and\nsatisfied by forward utilities and their dual have not been established in a general way. Furthermore, there is no general consistent utilities construction proposed in the literature, expect the\ncase of power or exponential type, or decreasing utilities. Another main contribution of this paper\nis a connection between two solvable SDEs and the utility SPDE early established. In particular,\ngiven a volatility vector γ such that γx (t, x) = −xUxx κ∗t (x) − Ux (t, x)ηtR + Ux (t, x)νt∗ (Ux (t, x))\n(where η R is the market risk prime), we show the existence and uniqueness of a solution to the\nfully nonlinear second order SPDE from that of a pair of SDE's. In any case this, represents an\ninteresting result in the theory of stochastic partial differential equations.\nThe paper is organized as follows, in the next section we give the definition of the Itô progressive dynamic utilities and focus on the characterization of these concave Itô's random fields\nby establishing a link with SDEs. A special attention is paid to the dynamics of the Fenchel\nconjuguate utility random field. In the following section, we give sufficient conditions ensuring\nconcavity, monotonicity, differentiability both for random fields or for solution of SDE. The dynamics of the inverse of regular solution of SDE(μ, σ) is the first step in the links of SDE and\nSPDE. More complex situations are then studied.\nNext, we introduce the consistent utilities, the market model and the framework of the paper.\nIn Section 3, we provide, simultaneously, the dynamics of consistent utilities and their convex\nconjugate. We establish a closed form for the optimal policies. Thereafter, in Section 4, we\nestablish a fully characterization of the marginal utility. We end by reverse engineering problem\nand some openness to other topics.\n\n4\n\n\f1\n\nProgressive Utility\n\nIn a dynamic and stochastic environment, the classical notion of utility is not flexible enough to help\nus to make good choices in the long run. M.Musiela and T.Zariphopoulou were the first to suggest\nto use instead of the classical criterion the concept of progressive dynamic utility, consistent with\nrespect to a given investment universe in a sense specified in Section 3. The concept of progressive\nutility gives an adaptative way to include new information on environment evolution available to\neconomic agents. Recently, Fritelli [8] introduced very closed notion called stochastic dynamic\nutility, in view of study certainty equivalent. Since these utility functions are stochastic, time\ndependent and moving forward, we consider them as a family of (Itô) semimartingales depending\non a parameter, the wealth of the agent in the economic context.\n\n1.1\n\nDefinition and Properties of Progressive Dynamic Utility\n\nAll stochastic processes are defined on a standard filtered probability space (Ω, F, P), where the\nfiltration F = (Ft )t≥0 is assumed to be right continuous and complete. We first recall some notions\nrelative to stochastic processes depending of a parameter.\n\nGenerality on progressive random fields Stochastic processes in consideration are depending on a parameter, often called spatial parameter. For us, because of economic motivation,\nthis parameter is the wealth of an investor, taking non negative values in R∗+ = {x > 0}. Sometimes, we will use the vocabulary of random field theory, and refer to such processes as progressive\nrandom fields. As all random fields considered in the sequel are progressive, we will often omit the\nmention \" progressive\".\n(i) A progressive random field X = {X(t, x); t ≥ 0, x > 0} is a random variable measurable with\nrespect to F∞ ⊗ B(R+ ) ⊗ B(R∗+ ), which is a collection of progressive processes t 7→ X(t, x).\n(ii) A random field X is said to satisfy a property P with respect to x, if there exists N ∈ F∞\nwith P(N ) = 0, such that for any ω ∈ N c , and any t ≥ 0, x 7→ X(t, x)(ω) satisfies the property P.\nFor example, X is said to be concave, (resp. increasing) if there exists N ∈ F∞ with P(N ) = 0,\nsuch that for any ω ∈ N c , and any t ≥ 0 x 7→ X(t, x)(ω) is concave (resp. increasing).\n(iii) A random field X is said to be continuous if there exists N ∈ F∞ with P(N ) = 0, such that for\nany ω ∈ N c , and any t ≥ 0 x 7→ X(t, x)(ω) is continuous. In general, the existence of continuous\nmodification is based of the Kolmogorov's criterion, that we recall in Section 2.\nA random field X is said to be differentiable if there exists N ∈ F∞ with P(N ) = 0, such that for\nany ω ∈ N c , and any t ≥ 0 x 7→ X(t, x)(ω) is differentiable ; the derivative denoted Xx (t, x)(ω)\ngenerates the so-called derivative random field Xx . When Xx has a continuous version, X is said\nto be C 1 -regular.\n(iv) A d-dimensional random field X is said to be Lk - locally bounded if for any compact K ⊂]0, ∞[,\nRT\nthere exists N ∈ F∞ with P(N ) = 0, such that for any ω ∈ N c , 0 supx∈K kX(t, x)kk (ω)dt < ∞\nfor any T > 0.\nm\nIn the sequel, we are concerned with differentiable random fields said to be Kloc\n-regular (K for\nKunita) in the following sense.\n\n5\n\n\fm\n\nm\nDefinition 1.1. A d-dimensional random field X is said to be Kloc\n(resp. Kloc )-regular if X is\nm\nk\n1\na C -regular random field such that X/x, ∂x X, k ≤ m are L (resp. L2 )-locally bounded. Such\nm\nm\nrandom fields are also called of class Kloc\n(resp. Kloc ).\n\nAt this stage, we content ourselves with this definition to carry out calculations in this section;\nmore details are given in the next section.\n\nProgressive utility and its Fenchel conjugate We start with the definition of a progressive utility as progressive random field with concavity property.\nDefinition 1.2 (Progressive Utility). A progressive utility is a continuous progressive random\nfield on R∗+ , U = {U (t, x); t ≥ 0, x > 0} such that,\n(i) Utility property: U is strictly concave, strictly increasing, and non negative.\n(ii) Regularity property: U is a C 2 -random field, with continuous first and second derivatives random fields Ux and Uxx .\n(iii) Inada conditions: U goes to 0 when x goes to 0 and the derivative Ux goes to ∞ when\nx goes to 0, and to 0 when x goes to ∞.\nGiven its importance in convex analysis, we introduce together with any progressive utility\ne (also called conjugate progressive utility (CPU)), that is the Fenchel\nU, its convex conjugate U\nLegendre transform of the convex random field −U(, −.).\n\nDefinition 1.3 (Progressive conjugate utility). The convex conjugate of the progressive utility U\ne defined on R∗+ by U\ne = {U\ne (t, y); t ≥ 0, y > 0}, where U\ne (t, y) def\nis the progressive random field U\n=\n\u0001\nmaxx>0,x∈Q+ U (t, x) − x y .\ne is twice continuously differentiable, strictly convex, strictly\n(i) Under Inada condition, U\ne (., 0+ ) = U (+∞), U\ne (., +∞) = U (0+ ), a.s.\ndecreasing, with U\ne y,\n(ii) The marginal utility Ux is the inverse of the opposite of the marginal conjugate utility U\n−1\n+\ne\ne\ne\nthat is Ux (t, .) (y) = −Uy (t, y), with Inada conditions Uy (., 0 ) = −∞, Uy (., +∞) = 0\n\u0001\ne (t, y) + x y .\n(iii) The bi-dual relation holds true U (t, x) = inf y>0,y∈Q+ U\n\u0001\n\u0001\ne (t, y) = U t, −U\ne (t, y) + U\ney (t, y) y, and U (t, x) = U\ne t, Ux (t, x) + x Ux (t, x).\nMoreover U\n\n1.2\n\nItô Progressive Utility and SDE\n\nIn this paper, we focus on continuous progressive utilities U which are a collection of Itô semimartingales: for any x, U (., x) is a continuous Itô semimartingale, driven by a n-dimensional\nBrownian motion W = (W 1 , .., W n ) defined on the probability space (Ω, F, P). In general, the σfield F0 is assumed to be trivial and F0 - random variables are a.s. constant. We refer to the book\nof H.Kunita [19] and to the next section for all technical results concerning the theory of semimartingale random fields.The assumption of finite dimensional Brownian motion greatly simplifies\nthe theory.\nAs usual, an Itô random field F defined on R+ is specified through its decomposition F =\nF0 + BF + MF into two random fields, where BF is a finite variation random field B F (t, x) =\nRt F\nRt F\nF\nF\nF\nF\n0 φ (s, x)ds and M is a martingale random field M (t, x) = 0 ψ (s, x)dWs , where (φ , ψ ) =\n{(φF (t, x), ψ F (t, x)); t ≥ 0, x > 0} are the local characteristics of F assumed to be progressive random fields, with values in R and Rn respectively. φF is called the drift characteristic, and ψ F the\n\n6\n\n\fdiffusion characteristic. For simplicity, we often omit the index F . By convention, an Itô random\nm\nm\nfield F is said to be a Kloc\n-semimartingale, whenever BF is of class Kloc\n, and MF is of class\nm\nKloc . The reference to Km recall that F is a random field.\nLet us consider an Itô progressive utility U with initial condition u(x) = U (0, x), and local\ncharacteristics (β, γ), so that\ndU (t, x) = β(t, x)dt + γ(t, x).dWt ,\n\nU (0, x) = u(x)\n\n(1.1)\n\nApart regularity issues, the first question before going further is the following:\nHow to express by conditions on the local characteristics (β, γ) random fields, the properties of\nmonotonicity and concavity of the progressive utility U defined by (1.1)?\nThe problem is equivalent to show that the progressive marginal utility Ux is strictly decreasing\nand strictly positive, with range (0, ∞). Following Kunita [19], this can be done by assuming that,\n2\n(i) U is of class Kloc\n, which implies in particular (Theorem 2.2 below) that Ux is also an Itô\nprogressive random field, with local characteristics (βx , γx ).\n(ii) The random field Ux is a strong solution of a one dimensional stochastic differential equation\n(SDE), with random coefficient, monotonic with respect to its initial condition.\nWe summarize these ideas in the following theorem.\nTheorem 1.1. Let U be an Itô random field with dynamics\nd U (t, x) = β(t, x)dt + γ(t, x).dWt ,\n\nU (0, x) = u(x)\n\n(1.2)\n\ne and marginal\n(i) Necessary condition Let U be a progressive utility with conjugate utility U,\n2\ne\nutilities Ux (t, .) and −Uy (t, .). If U is a Kloc -semimartingale, the random field Z. (z) = Ux (., −ũy (z))\nis a strictly increasing (in z) solution of the SDE(μ, σ),\n\n\n= μ(t, Zt )dt + σ(t, Zt ) dWt ,\nZ0 = z\n dZt\n\u0001\ney (t, z) ,\n(1.3)\nμ(t, z) = βx t, −U\nμ(t, 0) = 0\n\n\u0001\n\ne\nσ(t, 0) = 0\nσ(t, z) := γx t, −Uy (t, z) ,\n\n(ii) Characterization as primitive of SDE Let consider a SDE(μ̂, σ̂), dZt = μ̂(t, Zt )dt +\nσ̂(t, Zt ) dWt , Z0 = z and assume the existence of a strong solution Z. (z), increasing and differentiable in z with range (0, ∞). Then, for any utility function u such that Z. (ux (x)) is integrable in a\nRx\nneighborhood of x = 0, the primitive U = {U (t, x) = 0 Zt (ux (z))dz, t ≥ 0, x > 0} is a progressive\nutility.\n\n2\nProof. By assumption, from Theorem 2.2 below, U is a Kloc\n-semimartingale implies that Ux is an\nItô semimartingale with local characteristics (βx , γx ), i.e., dUx (t, x) = βx (t, x)dt + γx (t, x).dWt .\nSince x 7→ U (t, x) is strictly concave and increasing, the marginal utility Ux (t, .) is strictly positive\nand decreasing from ∞ to 0. Consequently x 7→ Ux (t, x) has an inverse which is the opposite\n\u0001\ney (t, .) and σ(t, .) :=\ney (t, .). By denoting μ(t, .) := βx t, −U\nof the marginal conjugate utility −U\n\u0001\ney (t, .) , it follows that Ux satisfies the following SDE, with initial condition Ux (0, x) =\nγx t, −U\nux (x)\n\u0001\n\u0001\ndUx (t, x) = μ t, Ux (t, x) dt + σ t, Ux (t, x) .dWt\n\n7\n\n\fThe change of initial condition from ux (x) into z yields to the definition of the process Zt (z) =\nUx (t, −ũy (z)). The converse implication is obvious.\nIt remains to give sufficient conditions on the random coefficients (μ, σ) ensuring the existence\nof a strong, monotonic solution of SDE (1.3). We briefly recall some classical results on SDEs,\nuseful for our study; more details and additional results are provided in Section 2. An easy to\nread presentation of SDEs with stochastic coefficients is given in Protter [32]; for more exhaustive\nstudy, see Kunita [19].\nTheorem 1.2. Let us consider the one-dimensional stochastic differential equation, SDE(μ, σ)\ndZt = μ(t, Zt )dt + σ(t, Zt )dWt ,\n\n(1.4)\n\nWe assume that the R-valued drift coefficient μ = {μ(t, x); t ≥ 0, x ≥ 0} and the Rd - valued\ndiffusion coefficent σ = {σ(t, x); t ≥ 0, x ≥ 0} are Lipschitz random fields, with random Lipschitz\nRT\nRT\nbounds Ct and Kt , such that a.s 0 Ct dt < +∞ and 0 Kt2 dt < +∞ for any T . In other words,\nfor any ω outside of a negligible set N , for any t, x, y,\n(\n|μ(t, x, ω) − μ(t, y, ω)| ≤ Ct (ω)|x − y|,\nμ(t, 0) ≡ 0,\n(1.5)\nkσ(t, x, ω) − σ(t, y, ω)k ≤ Kt (ω)|x − y|,\nσ(t, 0) ≡ 0.\n(i) Then, for any z ∈ R+ there exists a unique strong solution Zz , also called global solution, of\nthe SDE(μ, σ) (1.4) (Z0z = z). Moreover, almost surely, the family of maps z 7→ Ztz (ω), t ≥ 0 is\ncontinuous and strictly increasing.\n(ii) The range of the map z 7→ Z(., z) is ]0, +∞[ and Z(., z) is integrable near to 0 and to ∞.\nMore precisely,\na) When z goes to ∞, almost surely, for any ε ∈ (0, 1), uniformly on [0, T ] ,\nlim\n\nz→+∞\n\n\u0010\n\nsup\n0≤t≤T\n\nZ(t, z) \u0011\n= 0 and\nz 1+ε\n\nlim\n\nz→+∞\n\n\u0010\n\nsup\n0≤t≤T\n\nZ(t, z) \u0011\n= +∞, for any T\nzε\n\n(1.6)\n\nb) When z goes to 0, for any ε ∈ (0, 1),\nlim\n\nz→0\n\n\u0010\n\nsup\n0≤t≤T\n\n\u0010\nZ(t, z) \u0011\nZ(t, z) \u0011\nsup\n=\n0\nand\nlim\n= +∞, for all T\nz→0 0≤t≤T z 1+ε\nzε\n\n(1.7)\n\nComment: (i) A constant Lipschitz bound C corresponds to the classical framework of Lipschitz\nSDE, and the assertion (i) is well-known.\n(ii) The asymptotic behavior (ii) a) (near to infinity) is less known except in the domain of\nstochastic flows, where several works and improvements are dealing with this behavior near of\ninfinity, but unlike Kunita [19] and Salah-Eldin & al [23], Imkeller & al [13] and Zongxia [21]\nconsider only the case of SDEs with deterministic coefficients .\n(iii) The notion of \"global solution\" expresses that the solution (Ztz ) exists for all t ≥ 0. Under\nweaker assumptions, the solution may be defined only up to a finite lifetime ζ(z). More details\nwill be given in the next section.\nSufficient conditions on local characteristics of an Itô random field to be a progressive utility may\nbe exhibited.\n\n8\n\n\fCorollary 1.3. Assume the framework of Theorem 1.1.\nRT\nRT\n(i) If there exist random Lipschitz bounds Ct and Kt with 0 Ct dt < +∞ and 0 Kt2 dt < +∞ for\nany T , such that a.s, for any x, x′ > 0\n(\n|βx (t, x) − βx (t, x′ )| ≤ Ct |Ux (t, x) − Ux (t, x′ )|, limx→∞ βx (t, x) ≡ 0,\n(1.8)\n|γx (t, x) − γx (t, x′ )k ≤ Kt |Ux (t, x) − Ux (t, x′ )|, limx→∞ γx (t, x) ≡ 0.\nthen U is a progressive utility.\n(ii) Moreover if (β, γ) are C 2 -regular random fields, Condition (1.8) is equivalent to\n(\n\n|βx (t, x) ≤ Ct |Ux (t, x)|,\n|βxx (t, x)| ≤ Ct1 |Uxx (t, x)|,\n\nkγx (t, x)k ≤ Kt |Ux (t, x)|\nkγxx (t, x)k ≤ Kt1 |Uxx (t, x)|\n\n(1.9)\n\nThen μ(t, x) and σ(t, x) have linear growth with random bounds Ct and Kt respectively, and μx\nand σx are spatially bounded by Ct1 and Kt1\nProof. The condition (1.8) is equivalent to the Lipschitz condition in Theorem 1.2 applied to the\ncoefficients μ and σ in Equation (1.3).\nRemark: In the following, we call stochastic flow any continuous and strictly monotonic solution Z\ndef\nof SDEs. Contrary to the classical theory, herein we are interested only in the process Zt = Zs=0,t\n−1\nstarting at time 0, and its inverse (Zt )−1 (y) = Zs=0,t\n(y) := Zt,s=0 , both considered in the forward\npoint of view. We don't use the general flow associated with the SDE, defined as the family Zs,t (z),\nsolution of the equation starting from z at time s, and the flow stability, that is for r < s < t,\nZs,t (Zr,s (z)) = Zr,t (z), except in the paragraph concerning a pathwise dynamic programming\nprinciple (p.32).\nFrom Theorem 1.1, a large part of our study returns to study strictly monotonic one dimensional\ne y ) plays also a major role in the\nrandom fields and their inverses. The inverse flow of Ux , (−U\ne of a progressive utility U.\nstudy of the conjugate U\n\n1.3\n\nDynamics of Convex Conjugate Progressive Utility\n\ne of a progressive utility U is based on the well-known identity\nThe study of the convex conjugate U\ne (t, y) = U (t, −U\ney (t, y)) + y U\ney (t, y), and request to know the dynamics of the\n(Definition 1.3) U\n2\ney (t, y). For this, an extension of the classical\nC -random field U (t, x) along the random process −U\nItô's formula, known as Itô-Ventzel's formula is needed. We refer to Ventzel [37] and Kunita [19]\n(Theorem 3.3.1) for different variants of this formula and theirs proofs.\n2\n-Itô semimartingale F with local\nTheorem 1.4 (Itô-Ventzel's Formula Weak). Consider a Kloc\ncharacteristics (φ, ψ). For any continuous Itô semimartingale X, F (., X. ) is a continuous Itô\nsemimartingale,\nZ t\nZ t\nF (t, Xt ) = F (0, X0 ) +\nφ(s, Xs )ds +\nψ(s, Xs ).dWs\n(1.10)\n0\n0\nZ t\nZ\nZ t\n1 t\n+\nFx (s, Xs )dXs +\nFxx (s, Xs )hdXs i +\nhdFx (s, x), dXs i|x=Xs\n2 0\n0\n0\n\n9\n\n\fComment The first line of the right hand side of the equation corresponds to the dynamics of the\nprocess (F (t, x))t≥0 taken on (Xt )t≥0 , when in the second line, the first two terms come from the\nclassical Itô's formula. The last term represents the quadratic covariation between dFx (t, x) and\ndXt , at x = Xt , which can be written as ψx (t, Xt ).σtX dt when the diffusion coefficient of X is the\nvector σtX .\nItô-Ventzel's formula and monotonic change of variable will help us to establish the relationship\nbetween local characteristics of U and U.\ne its progressive convex conjugate utility assumed\nTheorem 1.5. Let U a progressive utility and U\n2\nto be Kloc\n-Itô semimartingales with local characteristics (β, γ) and (β̃, γ̃).\ne is driven by the non linear second order SPDE,\n(i) The dynamics of U\n\u0001\ne (t, y) = γ(t, −U\ney (t, y)).dWt + β(t, −U\ney (t, y))dt + 1 U\ney (t, y) k2 dt\neyy (t, y)kγx t, −U\ndU\n(1.11)\n2\ne y are given by,\n(ii) The local characteristics of the random field U\n\ne\ne\n\n γ̃y (t, y) = −γx (t, −Uy (t, y))Uyy (t, y)\n2\n(1.12)\ney (t, y))U\neyy (t, y) + 1 ∂y ( kγ̃y (t, y)k )\n\n β̃y (t, y) = −βx (t, −U\ne\n2\nUyy (t, y)\n\nb σ,μ (f )(t, y) =\n(iii) Let (μ, σ) be the random coefficients of the SDE associated with Ux and L\n1\n2\n2 ∂y (kσ(t, y)k ∂y f (t, y))−μ(t, y)∂y f (t, y) the adjoint elliptic operator in divergence form associated\ne y is a monotonic solution of the Stochastic\nwith (μ, σ). Then the marginal conjugate utility U\nPartial Differential Equation with initial condition ũy (y),\ney (t, y) = −∂y (U\ney )(t, y)σ(t, y).dWt + L\nb σ,μ\ne\ndU\nt,y (Uy )dt\n\n(1.13)\n\ne requires the existence of a\nObserve that the derivability of the local characteristics (β̃, γ̃) of U\nthird derivative for U.\ne are K2 -semimartingales\" implies, from Kunita [19]\nProof. At first, the assumption \"U and U\nloc\n1\n1\ney\nTheorem 2.2 below, that (β, γ) and (β̃, γ̃) belong to the class ∈ Kloc\n× K̃loc\n. Moreover Ux and U\nare Itô semimartingales with local characteristics (βx , γx ) and (β̃, γ̃).\nLet now apply the Itô-Ventzel formula to the regular random field F (t, x) = U (t, x) − y x and to\ney (t, y). The following identities related to the change of variable will\nthe semimartingale Xt = −U\ne\ne (t, y), Uxx (t, −U\ney (t, y)) = −1/U\neyy (t, y).\nbe useful, F (t, −Uy (t, y)) = U\n\ney (t, y)) = Ux (−U\ney (t, y)) − y ≡ 0, so that the term in dX disappears.\n(i) a) Observe that Fx (t, −U\ne is γ̃(t, y) = γ(t, −U\ney (t, y)),\nTherefore, by Itô-Ventzel's formula, the volatility random field γ̃ of U\ney (t, y))U\neyy (t, y) is by assumption the volatility characteristic\nand its derivative γ̃y (t, y) = −γx (t, −U\ne y . Hence the covariation term is driven by hdFx (t, x), −dU\ney (t, y)i = −hγx (t, x).γ̃y (t, y)idt.\nof U\n(i) b) The Itô-Ventzel formula is then reduced to,\ne (t, y) −\ndU\n\ney (t, y))dt − γ(t, −U\ney (t, y)).dWt\nβ(t, −U\n\u0001\n1\ney (t, y) hdU\ney (t, y)i − hγx (t, −U\ney (t, y)).γ̃y (t, y)idt\n= Uxx t, −U\n2\n1\ney (t, y))kγ̃y (t, y)k2 dt − Uxx (t, −U\ney (t, y))kγ̃y (t, y)k2 dt\n= Uxx (t, −U\n2\n\u0001\n1\neyy (t, y)kγx t, −U\ney (t, y) k2\ney (t, y))kγ̃y (t, y)k2 dt = 1 U\n= − Uxx (t, −U\n2\n2\n\n10\n\n\fe y is obtained (by assumption and Theorem 2.2) by differentiating term\n(ii) The dynamics of U\n\u0001\ney (t, y) and μ(t, y) =\nby term in the previous equation. The use of coefficients σ(t, y) = γx t, −U\n\u0001\ney (t, y) of the SDE associated with Ux allows us to express U\ne y as the solution of a SPDE\nβx t, −U\nσ,μ\n1\nb\ndriven by the adjoint second order operator in y, Lt,y = ∂y (kσ(t, y)k2 ∂y ) − μ(t, y)∂y .\n2\n\ney (t, y) =\ndU\n\n=\n\nThe proof is achieved.\n\neyy (t, y)[μ(t, y)dt + σ(t, y).dWt ] + ∂y ( 1 U\neyy (t, y)kσ(t, y)k2 )dt\n−U\n2\ney (t, y)σ(t, y).dWt + L\nb σ,μ (U\ney )(t, y)dt\n−∂y U\n\nRemark Obviously, we are interested in the properties of the SDE(μ̃, σ̃) associated with the\ne y when (β, γ) are C 2 -regular random fields. Given that σ̃(t, −z) =\nmonotonic random field U\n\u0010\n\u0011\n2\u0001\nγx (t, z)\nand μ̃(t, −z) = Uxx1(t,z) βx (t, z) − 12 ∂x kγUxxx(t,z)k\n, it is clear that these coefficients are\n(t,z)\nUxx (t, z)\nnot globally Lipschitz and the previous results (Theorem 1.2) cannot be applied directly. So, we\nreport the study of this SDE in Section 2, Theorem 2.5, after introducing some additional tools.\n\n2\n\nRegular Random Fields and Stochastic Differential Equa-\n\ntions\nThere are several difficulties in the definition of semimartingales F (t, x) depending on a parameter,\nas explained in the books of Kunita [19] and Carmona & Nualart. [2], and their local characteristics\n(φF , ψ F ) (in short (φ, ψ) if there is no possible confusion).\n(i) The first one is relative to the existence of continuous version of the random field F; according\nto Kunita [19] (Theorem 3.1.2 p.75), this property is true when the local characteristics (φ, ψ) are\nlocally δ-Hölder for some δ > 0 by Kolmogorov's criterion.\n(ii) The second one is relative to differential properties: even if the random field F and its local\ncharacteristics (φ, ψ) are differentiable, it is not enough (as is shown in H. Kunita [19]), to get that\nthe local characteristics of the derivative random field Fx are (φx , ψx ).\n(iii) Based on the study of Section 1, we also need under which assumptions on the coefficients of\na SDE, the solution is a regular monotonic random field with respect to its initial condition.\nWe start with a more precise definition of regular random field spaces than in Section 1 by\nintroducing Hölder properties. The motivation is find in the Kolmogorov's continuity criterion\n([19]Theorem 1.4.1).\nTheorem 2.1. Let X(x), x ∈ D a random field with values in a Banach space B, where D is a\nPd\ndomain in Rd . Assume that there exist positive constants γ, C and αi , i = 1...d with i=1 α−1\n< 1,\ni\nsatisfying,\nd\nX\n\u0001\nγ\nfor any x, y ∈ D\n(2.1)\nkxi − yi kαi ,\nE[kX(x) − X(y)k ] ≤ C\ni=1\n\ne\n(i) Then X(x) has a continuous modification X(x).\n(ii) Let 0 < βi ≤ Aαi , i = 1...d arbitrary positive numbers where A = (α0 − d)/γα0 ), and\nPd\nα0−1 d = i=1 αi−1 . Then, for any hypercube H there exists a positive random variable K(ω) with\n\u0001\nPd\nβi\nfor any x, y ∈ H, a.s..\nE[K γ ] < ∞ such that kX(x) − X(y)k(ω) ≤ K(ω)\ni=1 kxi − yi k\n\n11\n\n\fRecently, new criteria based on different norms, or chaining methods have been developed to\nweaken the criterion. A interesting survey may be find in Scheutzow [35].\n\n2.1\n\nRegular Random Fields Spaces\n\nWe introduce a family of Sobolev type random semi-norms to control locally or globally the growth\nof the random field and its derivatives.\n\nNorms definition Let φ be a continuous Rk -valued progressive random field and let m be a\nnon-negative integer, and δ a number in (0, 1] . We need to control the asymptotic behavior in 0\nand ∞ of φ, and the regularity of its Hölder derivatives when there exist. More precisely, let φ be\nin the class C m,δ (]0, +∞[), i.e. (m, δ)-times continuously differentiable in x for any t, a.s.\n(i) For any subset K ⊂]0, +∞[, we define the family of random (Hölder) K-semi-norms\n\n\n\n\n\n\nkφkm:K (t, ω) = supx∈K\n\nkφ(t,x,ω)k\nx\n\n+\n\nP\n\nkφkm,δ:K (t, ω) = kφkm:K (t, ω) + sup\n\n1≤j≤m\n\nx,y∈K\n\nsupx∈K k∂xj φ(t, x, ω)k\n\nk∂xm φ(t, x, ω) − ∂xm φ(t, y, ω)k\n.\n|x − y|δ\n\n(2.2)\n\nThe case (m = 0, δ = 1) corresponds to the local version of the Lipschitz case used in Section 1.\nWhen K is all the domain ]0, +∞[, we simply write k.km (t, ω), or k.km,δ (t, ω).\n(ii) The first term of these random semi-norms differs slightly from the definition of Kunita seminorms (Equations (1) and (2) p.72) because instead of dividing by 1 + |x| we divide by x on the\nfirst terms. This does not change Kunita's results, but allows us to obtain reasonable behavior in\nthe neighborhood of x = 0 (Equation (1.7), Theorem 1.2) in addition to the traditional results in\nthe neighborhood of x = ∞.\n\nDifferent spaces of regular random fields The previous semi-norms are related to the\nspatial parameter. As in Definition 1.1, we add the temporal dimension in assuming these seminorms (or the square of the semi-norm) to be integrable in time with respect to the Lebesgue\nmeasure on [0, T ] for all T . Then, as in Lebesgue's Theorem, we can differentiate, pass to the\nlimit, commute limit and integral for the random fields. Calligraphic notation recalls that these\nsemi-norms are random.\nm,δ\nm,δ\n(i) Kloc\n(resp. Kloc ) denotes the set of all C m,δ -random fields such that for any compact\nRT\nRT\nK ⊂]0, +∞[, and any T , 0 kφkm,δ:K (t, ω) < ∞, (resp. 0 kψk2m,δ:K (t, ω)dt < ∞ ).\n(ii) When these different norms are well-defined on the whole space ]0, +∞[, the derivatives (up\nto a certain order) are bounded in the spatial parameter, with integrable (resp.square integrable)\nm\nm,δ\nin time random bound. In this case, we use the notations Kbm , Kb or Kbm,δ , Kb .\n\n2.2\n\nDifferentiability of Itô random fields\n\nWe shall discuss the regularity of a Itô semimartingale random field\nZ t\nZ t\nF(t, x) = F(0, x) +\nφ(s, x)ds +\nψ(s, x).dWs\n0\n\n0\n\nin connection with the regularity of its local characteristics (φ, ψ). As in Section 1, by convention,\nm,δ\nan Itô random field F is said to be a Kloc\n-semimartingale, whenever F (0, x) is of class C m,δ ,\n\n12\n\n\fRt\nRt\nm,δ\nm,δ\nB F (t, x) = 0 φ(s, x)ds is of class Kloc\n, and M F (t, x) = 0 ψ(s, x).dWs is of class Kloc . The\nreference to Km,δ recall that F is a random field. 1 As in Kunita [19], we are concerned both by\nthe regularity of F from the regularity of its local characteristics (φ, ψ) (Theorem 3.1.2 ) and by\nthe regularity of (φ, ψ) from that of F(t, x) (Theorem 3.1.3). To be concise, we also give a sufficient\nconditions ([19] Theorem 3.3.3) under which we can differentiate term by term the dynamics of an\nItô random field. This property is used in order to apply Itô-Ventzel's formula.\nTheorem 2.2 (Differential Rules). Let F be an Itô semimartingale random field with local charRt\nRt\nacteristics (φ, ψ), F (t, x) = F (0, x) + 0 φ(s, x)ds + 0 ψ(s, x).dWs\n\nm,δ\n(i) If F is a Kloc\n-semimartingale for some m ≥ 0, δ ∈ (0, 1], its local characteristics (φ, ψ) are\nm,ε\nm,ε\nof class Kloc × Kloc for any ε < δ.\nm,δ\n\nm,δ\nm,ε\n(ii) Conversely, if the local characteristics (φ, ψ) are of class Kloc\n× Kloc , then F is a Kloc\nsemimartingale for any ε < δ.\n(iii) In any cases, for m ≥ 1, δ ∈ (0, 1], the derivative random field Fx is an Itô random field with\nlocal characteristics (φx , ψx ).\n1,δ\n(iv) Moreover, if F is a Kloc\n∩ C 2 -semimartingale, for any Itô process X, F (., X. ) is a continuous\nItô semimartingale satisfying the Itô-Ventzel formula (1.10).\n\nAs previously mentioned, we also need results on the existence and the regularity of one dimensional random fields which are also solutions of stochastic differential equations (SDE). The\nspatial parameter in this case corresponds to the initial condition. Such random fields are also\ncalled stochastic flows and are the main subject (in the multidimensional case) of the Kunita's\nbook [19].\nThe question is now to make assumptions on the coefficients in place of local characteristics. An\nexample was given in Section 1, Theorem 1.2, where the global Lipschitz regularity of coefficients\nis used in proving the existence of monotonic solution. Next proposition, ([19] Theorem 4.6.5),\nfrequently used in the sequel, extends these results to differentiability properties.\nProposition 2.3. Let μ be a real valued process and σ be a d-dimensional process of the the class\nm,δ\nKbm,δ and Kb for some m ≥ 1, δ ∈ (0, 1]. Consider the following SDE(μ, σ),\ndXt = μ(t, Xt )dt + σ(t, Xt ).dWt ,\n\nX0 = x\n\n(2.3)\n\n0,1 \u0001\non the existence and\nThen, in addition to the results of Theorem 1.2 (μ, σ) ∈ Kb0,1 × Kb\nuniqueness of global monotonic solution, we have:\nm,ε\n(i) The unique solution X = (Xtx , x > 0) is a Kloc\nsemimartingale for any ε < δ. The inverse\n−1\nm\nX of X is also of class C .\n\n(ii) X is strictly increasing in x, and its derivative Xx is solution of a linear equation, with\n1\n\nNote, in the case of general semimartingales F studied by Kunita, the notion of local characteristics makes reference\n\nto the triplet (φ(t, x), a(t, x, y), At ) for x, y > 0, where the joint quadratic variation of F (t, x), F (t, y) satisfy the relation\nRt\n< F (t, x), F (t, y) >= 0 a(s, x, y)dAs with the process A is F−adapted increasing and continuous. Here, as there is a\nfinite number of Brownian motions, At = t and a(t, x, y) := ψ(t, x).ψ(t, y) where, as before, the \".\" denote the inner\nscalar product. From this, all assumptions on the matrix \"a\" (in Kunita) are adapted to the present framework and\nreplaced by our equivalent hypothesis on the diffusion characteristic vector ψ.\n\n13\n\n\fspatially bounded stochastic parameters (μx (t, Xtx ), σx (t, Xtx )) given by\n\u0002\n\u0003\ndXx (t, x) = Xx (t, x) μx (t, Xtx )dt + σx (t, Xtx ).dWt , Xx (0, x) = 1\n\n(2.4)\n\n1/Xx is solution of the same kind of linear equation\n\n\u0003\n\u0002\ndZt = Zt (−μx (t, Xtx ) + ||σx (t, Xtx )||2 )dt − σx (t, Xtx ).dWt\n\n(2.5)\n\nm−1,ε\nThen, Xx and 1/Xx are Kloc\n-semimartingales.\n(iii) The local characteristics of X, λX (t, x) = μ(t, Xtx ) and θX (t, x) = σ(t, Xtx ) have only local\nm,ε\nm,ε\nproperties and belong to Kloc\n× Kloc for any ε < δ.\n\nRemark . This technical result shows clearly the interest of using Hölder property: the solution\nis fractionally less regular than the coefficients (going from δ in ε < δ). Otherwise, if we are only\ninterested with processes of class Km (m integer) without worrying about the Hölder's dimension,\nm,ε\nthen we will lose a hole order in the regularity: instead of solution of class Kloc\n, we will only\nm−1\nobtain solution of class Kloc .\nIn the last proposition, we have made global regularity assumptions on the coefficients (μ, σ)\nin order to prove that the SDE (2.3) has a regular, non-exploding (global), strictly monotonic\nm,ε\nsolution X. Observe that the solution itself as random field is only in Kloc\nin general. In Section\n1, Paragraph 1.3, we have shown that even if the progressive marginal utility satisfies a SDE(μ, σ)\ney of Ux , assumed to be an Itô\nwith global regularity, the SDE(μ̃, σ̃) satisfied by the inverse −U\nprocess, has only local regularity. So, we are also concerned with SDE whose the coefficients are of\n0,1\nm,δ\nm,δ\n0,1\n×Kloc , m ≥ 1, δ ∈]0, 1]. Then, the SDE can not have global solution and\nclass Kloc\n×Kloc or Kloc\nexplosion can occur at finite time ζ(x). Nevertheless, several properties are maintained as shown\nin [19] Theorems 4.7.1 and 4.7.2.\nTheorem 2.4 (Local assumptions). Let us consider a SDE with only locally Lipschitz coefficients\n0,1 \u0001\n0,1\n(μ, σ) ∈ Kloc\n× Kloc .\n(i) For any initial condition x, the SDE has a unique maximal solution (Xtx ) up to an explosion\ntime ζ(x), that is on [0, ζ(x)),\ndXtx = 1{t<ζ(x)} μ(t, Xtx )dt + 1{t<ζ(x)} σ(t, Xtx )dWt ,\n\na.s.\n\n(2.6)\n\n(ii) For given t, as function of x, Xtx is defined on its domain Dt = {x : ζ(x) > t}, with finite\nvalues on its range Rt (ω) = {Xtx (ω); x ∈ Dt (ω)}. Furthermore, x 7→ Xtx : Dt → Rt is a continuous\nstrictly monotonic random field with continuous inverse Xt−1 : Rt → Dt .\n(iii) (Xtx ) is a global solution (Theorem 1.2) if and only if the explosion time ζ(x) is equal to ∞\nfor all x ∈ R+ = [0, ∞) a.s., (or equivalently if for any time t, the domain Dt is the whole space\nR+ a.s.). Hence the range Rt is also the whole space R+ for any t.\nm,δ\nm,δ\n(iv) Moreover, if (μ, σ) ∈ Kloc\n× Kloc (m ≥ 1, δ ∈ (0, 1]) Xt (.) is of class C m,ε , ε < δ on Dt .\n(v) If (Xtx ) is a global solution, then all assertions of Proposition 2.3 hold true.\nWe recall the proof of Kunita to present the truncation method which is the base of many proofs\nwhen only local properties hold true.\n\n14\n\n\fProof. (i) Following Kunita, we shall apply the method of truncation on R+ . For each positive\ninteger N , take a C ∞ -function ψ N (x), x ∈ R+ such that ψ N (x) = 1 if x ≤ N , 0 ≤ ψ N (x) ≤ 1\nif N ≤ x ≤ N + 1 and ψ N (x) = 0 if x > N . Define μN (t, x) = μ(t, x)ψ N (x) and σ N (t, x) =\nm,δ\nσ(t, x)ψ N (x) which belong to Lm,δ\nand Kb . Therefore, the SDE(μN , σ N ) has a unique solution\nb\nX N of class Km,ǫ (ǫ < δ) satisfying assertions of Proposition 2.3. Let us introduce the family\nof stopping times for each x, ζN (x) := inf{t : X N (t, x) ≥ N }. By uniqueness, for M < N the\nsolutions X.M (x) and X.N (x) coincide on [0, ζM (x)). Then, the family ζN (x) is increasing with\nlimit ζ(x) := limN →∞ ζN (x). We can define Xt (x), t < ζ(x) by Xt (x) = XtN (x) if t < ζN (x). It\nis a maximal solution of SDE(μ, σ) starting at x at t = 0.\n(ii) We shall prove that the above X. (x) is a continuous strictly increasing flow. Take any sample\nω such that XtN (ω, .) defines a continuous map strictly increasing in x for any N . Probability of\nthe set of all such samples is 1. We first note that each ζN (ω, x) is lower semicontinuous in x i.e.\nDtN (ω) = {x : ζN (ω, x) > t} is open for any t > 0, since on this set XsN (ω, x) < N for all s ≤ t.\nHence, the same inequality holds for any x′ in the neighborhood of x. Now since ζ(ω, x) is the upper\nlimit of ζN (ω, x) it is also lower semicontinuous. Set Dt (ω) = ∪N DtN (ω). Since X(t, x) = X N (t, x)\nholds on DtN (ω), the map X(t, x) : Dt (ω) → R+ is continuous strictly increasing with continuous\ninverse.\n(iii)The differentiability properties are showed similarly by truncation techniques, using derivability\nof processes X N .\nComment Recently, several papers address the question: under which minimal assumptions on\nthe SDE's coefficients, the solution is non-explosive? For example, when the coefficients μ and\nσ are a deterministic functions independent of the time, the property holds true under global\nlog-Lipschitz type conditions as it is showed in Zongxia [20] and Fang [12]. But these new results\nand many others can not be applied directly to our study because the coefficients of SDE's we are\nconcerned are structurally stochastic.\nLocal regularity on SDEs coefficients appears as a kind of minimal assumption to ensure the\nregularity of a global solution if there exists. Because of its importance in the sequel, we give a\nname to this class of SDE's.\nDefinition 2.1. A SDE(μ, σ) is said to be of class S m,δ if\nm,δ\nm,δ\na) the coefficients (μ, σ) are in the spaces (Kloc\n, Kloc ))\nb) the maximal solution X is non explosive.\nBy Theorem 2.4, the unique solution X is strictly monotonic with range [0, ∞) and of class\nm,ε\nKloc\n, ε < δ.\nm\n\nClassical examples of S m,δ SDEs are given by SDE(μ, σ) when (μ, σ) are in the spaces (Kbm , Kb ),\n0\nm,δ\nm,δ\n, Kloc ). Moreover, in these last two cases, the asymptotic behavior of\nor even in (Kb0 , Kb ) ∩ (Kloc\nthe solution is given by Theorem 1.2, Equation (1.6) and Equation (1.7).\n\n2.3\n\nSolvable SPDEs via SDEs\n\nIn the utility framework, under\ne\nthe strong assumptions of Theorem 1.5, we have shown that Uy , the inverse flow of (−Ux (t, x)),\nis solution of a SPDE and a SDE(μ̃, σ̃) simultaneously. We want to relax the a priori assumption\n\nDynamics of inverse flow of regular SDE solution\n\n15\n\n\fey is an Itô random field. So, we proceed differently, by starting from the\nthat the inverse flow U\nmaximal solution of the local SDE (μ̃, σ̃) with explosion time ζ(x), and by verifying that up to\nζ(x) this process is the inverse flow of the solution of the SDE(μ, σ). By an easy argument base\non the uniqueness of non-explosive solution of the SDE(μ, σ), we deduce ζ(x) = ∞, a.s.. Some\nregularity on the SDE(μ, σ) is required to conduct calculation and conclude.\nTheorem 2.5 (Inverse flow SDE). Let (Xtx ) be the monotonic solution of a SDE(μ, σ) of class\nS m,δ , m ≥ 3, δ ∈]0, 1], so that as random field (Xtx ) and its local characteristics (λ(t, x) = μ(t, Xtx ))\nm,ε\nm,ε\nand (θ(t, x) = σ(t, Xtx )) are of class Kloc\nand Lm,ε\nloc × K loc for any 0 < ε < 1.\nWe are concerned with the SDE(μ̃, σ̃)\ndξt = −\nwhere σ̃(t, z) = −\n\nh\ni\n\u0001\n1\n1\nkθk2 \u0001\nλ(t, ξt ) − ∂x\n(t, ξt ) dt + θ(t, ξt ).dWt , ξ0 = z,\nXx (t, ξt )\n2\nXx\n\n(2.7)\n\n\u00101\n\u0011\nθ(t, z)\nkθk2 \u0001\n1\nand μ̃(t, z) =\n∂x\n(t, z) − λ(t, z) .\nXx (t, z)\nXx (t, z) 2\nXx\n\n(i) The SDE(μ̃, σ̃) is of class S m−2,ε (0 < ε < δ) and its unique monotonic solution ξ z is the\ninverse flow X −1 of X.\nm−2,ε\n(ii) Consequently, the inverse X −1 of X is a semimartingale and belongs to the class Kloc\n∩C m .\nProof. The proof is in several steps, by first proving the local regularity of the coefficients (μ̃, σ̃),\nand then the existence of a monotonic solution ξ z up to a explosion time ζ(z). The main step is\nthen to prove that ζ(z) = ∞ a.s. by showing that locally ξ z is the inverse X −1 .\nm,ε\n\nm,ε\nm,ε\nm−1,ε\n(i) Since X ∈ Kloc\nand (λ, θ) ∈ Kloc\n× Kloc , by Proposition 2.3 1/Xx ∈ Kloc\nand so\n2\nm−1,ε\nm−2,ε\nkθk\nm−1,ε\nand ∂x ( Xx ) ∈ Kloc . Consequently the coefficients (μ̃, σ̃) are\n(λ/Xx , θ/Xx ) ∈ Kloc\n× Kloc\nm−1,ε\n\nm−2,ε\nof class Kloc\n× Kloc\n\n.\n\n(ii) Since the coefficients (μ̃, σ̃) satisfy the assumptions of Theorem 2.4, the SDE(μ̃, σ̃) has a\nunique maximal solution ξ z , up to an explosion time ζ(z).\na) We claim that the solution ξtz is the inverse flow X −1 (t, z) for t ∈ [0, ζ(z)) of the SDE(μ, σ)\nm,ǫ\nmonotonic solution Xtx := X(t, x). Since by assumption X is of class Kloc\nand its local characterm,ε\nm,ε\nistics (λ, θ) are of class (λ, θ) ∈ Kloc × Kloc (m ≥ 3, ǫ ∈]0, δ[), we can apply Itô-Ventzel's formula\nto X(t, ξtz ) up to the time ζ(z). Then, on [0, ζ(z)), by using the short notation ξ in place of ξ z ,\ndX(t, ξt ) =\n+\n+\n=\n=\n\nh\n\n−θ(t, ξt ) i\n.dWt\nXx (t, ξt )\n\u0010\nh\n\u0010\n\u0011\u0011i\n1\n1\nkθk2 \u0001\nλ(t, ξt ) − ∂x\nλ(t, ξt ) + Xx (t, ξt ) −\n(t, ξt )\ndt\nXx (t, ξt )\n2\nXx\ni\nh1\n−θ \u0001\nkθk2 \u0001\n(t,\nξ\n)\n+\nθ\n(t,\nξ\n).\nXxx (t, ξt )\n(t,\nξ\n)\ndt\nt\nx\nt\nt\n2\nXx2\nXx\ni\nh1\n\u0001\n\u0001\n\u0002 \u0003\n1\n1\nkθk2 \u0001\n1 1\n∂x kθk2 (t, ξt )) − ∂x (\n)kθk2 (t, ξt ) dt\n0 .dWt + ∂x\n(t, ξt ) −\n2\nXx\n2 Xx\n2\nXx\n0\nθ(t, ξt ) + Xx (t, ξt )\n\nb) Then the continuous (in time) process X(t, ξtz ) is constant a.s. on [0, ζ(z)). At time t = ζ(z) <\n∞, ξtz = ∞ and X(t, ∞) = ∞. On the other hand, by continuity, X(t, ξtz ) = z if t = ζ(z) < ∞.\nTo avoid contradiction, necessarily ζ(z) = ∞, a.s..\n\n16\n\n\fAs in Theorem 1.5, we can also characterize the inverse process in terms of monotonic solution of\nnon-linear stochastic partial differential equation (SPDE). This point of view is well-suited to the\nstudy of consistent dynamic utilities developed in the next sections.\n\nSolvable SPDEs via SDEs Now we show how to solve some non-linear SPDEs via SDEs. A\nfirst link is obtained by the transformation of the SDE (2.7) into a SPDE. Recall that conditions\nm,δ\nof type S m,δ are related to the coefficients of the SDE, when conditions of type Kloc\nare related\nto the local characteristics of the solution.\nTheorem 2.6 (SPDE point of view). Let us consider a SDE (μ, σ) of class S m,δ with m ≥\n1\n2\nb σ,μ\n2, δ ∈ (0, 1], and its adjoint operator L\nt,z = 2 ∂z (kσ(t, z)k ∂z ) − μ(t, z)∂z . Denote by X its unique\nsolution.\nm−2,δ\n(i) For m ≥ 3, the inverse flow X −1 = ξ X of X is a strictly monotonic solution of class Kloc\n∩C m\nb σ,μ , −σ∂z ), with initial condition ξ0 (z) = z,\nof SPDE(L\nb σ,μ\ndξ(t, z) = −ξz (t, z)σ(t, z).dWt + L\nt,z (ξ)dt\n\n(2.8)\n\n1,δ\nb σ,μ , −σ∂z ) (2.8). Then,\n(ii) Conversely, (m ≥ 2), let ξ be a Kloc\n∩ C 2 -regular solution of SPDE(L\nξ(t, X(t, x)) ≡ x and ξ is the strictly monotonic inverse flow X −1 := ξ X of X. Moreover, uniqueb σ,μ , −σ∂z ) in the class of K1,δ ∩ C 2 -regular solutions.\nness holds true for the SPDE(L\nloc\n\nComment When the coefficients (μ, σ) of the SDE are non random, in a multi-dimensional case,\nb σ,μ , −σ∂z ) is known as the stochastic transport equation in Zhang [40] or in Constantin\nthe SPDE(L\nand Iyer [3].\nProof. (i) According to notations of Theorem 2.5, since ξ X is the inverse of X, we have:\n\u0010\n\u0001\u0011\n1\nλ(t, ξ X (t, z)) = μ t, X t, ξ X (t, z) = μ(t, z),\nξzX (t, z) =\n,\nXx (t, ξ X (t, z))\n\u0011\n\u0010\n\u0001\nσ t, X t, ξ X (t, z)\n= −ξzX (t, z)σ(t, z)\nθ(t, ξ X (t, x)) = −\nXx (t, ξ X (t, z))\n\nb σ,μ (ξ X )(t, z). So ξ X is solution of the SPDE (2.8).\nwhich easily leads to μ̃(t, ξ X (t, z)) = L\nt,z\n(ii) Let now turn to the converse implication by starting from a given monotonic solution ξ of\n1,δ\nb σ,μ (ξ)dt.\nclass Kloc\n∩ C 2 of the SPDE: dξ(t, z) = −ξz (t, z)σ(t, z).dWt + L\nt,z\na) From Theorem 2.2, ξ is regular enough to use Itô-Ventzel's formula with the solution X(t, x) =\nXtx of the SDE(μ, σ) to compute the dynamics of H(t, x) = ξ(t, X(t, x)). In the next equation, we\ndo not recall the parameter x.\ndHt\n\n=\n+\n=\n=\n\n\u0001\n− ξz (t, Xt )σ(t, Xt ) − ξz (t, Xt )σ(t, Xt ) .dWt\n\u0010\n\u0011\nb σ,μ (ξ) + 1 ξzz kσk2 + μ ξz + ∂z (−ξz σ).σ (t, Xt )dt\nL\n2\n\u0010\n\u0011\n1\n1\nξzz kσk2 + ξz (∂z kσk2 ) − ∂z (ξz )kσk2 − ξz (∂z kσk2 ) (t, Xt )dt\n2\n2\n0\n\nThe random field H(t, x) = ξ(t, X(t, x)) is constant in time and equal to its initial condition x.\nThis finishes the proof that X is the inverse flow of ξ.\n\n17\n\n\fb) Since SDE(μ, σ) is of S m,δ , there is only one solution X. Then any \"regular\" solution ξ of the\nSPDE is the inverse of X and then is unique.\nNext result, useful for applications, is a slight extension of the previous one. It establishes a connection between a more general second order SPDE and two SDEs. As discussed in the following,\nthis connection is in the core of the study of consistent dynamic utilities. It is based on the observation that if ξ is the inverse of SDE(μX , σ X ) monotonic solution X and if φ ∈ C 2 a regular\nmonotonic function, the process X(., φ(x)) satisfies the same SDE(μX , σ X ), and so its inverse\nφ−1 (ξ. (z)) satisfies the same SPDE than ξ. The extension, given in the following result describes\nthe dynamics of compound processes Y (t, ξ(t, z)) and ξ(t, X(t, x) for regular Itô semimartingales\nY and X and show how to solve the associated SPDEs.\n1,δ\nTheorem 2.7. Let X be a solution of SDE(μX , σ X ) and ξ a Kloc\n∩ C 2 -regular solution (δ > 0) of\nX\nX\nσ\n,μ\n1\nX\n2\nX\nX\nX\nb , −σ ∂z ), where L\nb =L\nb\n= ∂z (kσ (t, z)k ∂z ) − μX (t, z)∂z .\nthe SPDE(L\nt,z\n1,δ\nKloc\n\nt,z\n\n2\n\n(i) Let Y be a solution of class\n∩ C of SDE(μY , σ Y ) with initial condition φ ∈ C 2 . Then the\nrandom field Y (t, ξ(t, z)) = G(t, z) evolves as,\ndG(t, z) =\n−\n\n2\n\nσ Y (t, G(t, z)).dWt + μY (t, G(t, z))dt\n\u0002\nb X (G)(t, z))dt\n∂z G(t, z)σ X (t, z) dWt + σyY (t, G(t, z))dt] + L\nt,z\n\n(2.9)\n\n(ii) Let X be a solution of SDE(μ, σ) with initial condition ψ(x). Denote by ∆μ(t, z) := μX (t, z)−\nμ(t, X t ) and ∆σ(t, z) := σ X (t, z) − σ(t, X t ). Then the random field ξ(t, X t ) evolves as\n\u0002\n\u0001\n\u0003\nb ∆ (ξ)(t, X t ).\ndξ(t, X t ) = −ξz (t, X t ) σ X (t, X t ) − σ(t, X t ) .(dWt − σ x (t, X t )dt) + L\n\n(2.10)\n\n1,δ\n(iii) Solvable SPDE: Let G be a solution of class Kloc\n∩ C 2 -regular of the SPDE (2.9); then the\nprocess G(t, X t (x)) with initial condition G(0, ψ(x)) evolves as\n\ndG(t, X t ) =\n−\n\nσ Y (t, G(t, X t )).dWt + μY (t, G(t, X t ))dt\n(2.11)\n\u0002\n\u0003\nX\nY\n∆\nb (G)(t, X t )dt\nGz (t, X t ) σ − σ)(t, X t ). dWt + (σy (G) − σ x )(t, X t )dt + L\n\n(iv) In particular, G(t, Xt (φ(y)) is a solution of the SDE(μY , σ Y ) with initial condition φ(y). If\nuniqueness holds true for this equation, then G(t, z) = Yt (t, ξ(t, z)) and uniqueness also holds true\nfor the SPDE (2.9).\n\nNote the different nature of assumptions (which may be equivalent) in the assertions of this theorem. In (i), we assume that the coefficients are regular enough such that Y satisfies the Itô-Ventzel\nassumptions and such that the inverse ξ of X is an Itô semimartingale, while in (ii) we only suppose the existence of X (without regularity), but in return we assume the existence of a smooth\nsolution G of the SPDE (2.9).\nOtherwise, remark that the first line in (2.9), associated with Y , is purely the SDE part of the\ndynamics of G while the second corresponds to the partial differential part. This writing suggests\na simple method for solving such equations. Indeed, when considering any SPDE, if we are able\nto rewrite it in the form (2.9), then we can hope solve it (if regularity of the identified coefficients\nholds) by associating two SDEs, and then by composing with the solution associated with the\npartial differential part (X in our result); this is the aim of assertions ((iii), (iv)).\n\n18\n\n\fProof. (i) The proof is based on the Itô-Ventzel formula, applied to Y as random field, and ξ(t, z)\nas semimartingale; that leads to\n\u0001\n= μY (t, G(t, z))dt + σ Y (t, G(t, z)) − Yy (t, ξ(t, z))ξz (t, z)σ X (t, z) .dWt\n1\nb Z (ξ)dt\n+\nYyy (t, ξ(t, z))k − ξz (t, z)σ X (t, z)k2 + Xx (t, ξ(t, y))L\nt,z\n2\n+ < dYy (t, y), dξ(t, z) > |y=ξ(t,z)\n\u0001\n= μY (t, ξ(t, z))dt + σ Y (., G) − Yy (., ξ)ξz σ X (t, z).dWt\n\u00021\n\u0003\nb X (ξ) − Gz σyY (., G).σ X (t, z)dt\n+\nYyy (., ξ)kξz σ X k2 + Yy (., G)L\n2\n\u0001\u0001\nNow using identity ∂z Yy t, ξ(t, z) = Yyy (t, ξ(t, z))ξz (t, z) and Gz (t, z) = Yy (t, ξ(t, z))ξz (t, z), it\nfollows, at first, that\ndG(t, z)\n\nYyy (., ξ)k − ξz σ X k2 + Yy (., ξ)∂z kσ X k2 ξz\n\n\u0001\n\n=\n=\n\n\u0001\u0001\n\u0001\n\u0001\n∂z Yy (., ξ) ξz kσ X k2 + Yy (., ξ)∂z kσ X k2 ξz\n\u0001\n\u0001\n∂z Yy (., ξ)ξz kσ X k2 = ∂z kσ X k2 Gz\n\nSecond, by injecting this identity in the dynamics of G, we obtain\n\n\u0001\nσtY (G(t, z)) − Gz (t, z)σtX (z) .dWt\n\u0010\n\u0001\u0011\nb X (G) + μY (G(t, z)) − ∂z σ Y (t, G(t, z)).σ X (t, z) dt\n+\nL\nt,z\nt\n\ndG(t, z) =\n\nIn a simpler formulation, that is equivalent to,\ndG(t, z) =\n−\n\nσ Y (t, G(t, z)).dWt + μY (t, G(t, z))dt\n\u0002\nb X (G)(t, z)dt\n∂z G(t, z)σ X (t, z) dWt + σyY (t, G(t, z)] + L\n\nIn the particular case, where Y (t, x) = F (x), μY ≡ 0 and σ Y ≡ 0 and the result is obvious.\n(ii) Again, Itô-Ventzel calculus yields to\nh1\ni\n\u0001\ndξ(t, X t ) =\n∂y ||σ X (t, y)||2 ξ(t, y) (t, X t ) − μX (t, X t )ξz (t, X t ) dt\n2\nh\n1\n+ ξz (t, X t )σ(t, X t )dWt + ξz (t, X t )μX (t, X t ) + ξzz (t, X t )||σ(t, X t )||2\n2\ni\n\u0001\nX\nX\n− ξyy (t, X t )σ (t, X t ) + ξy (t, X t )σz (t, X t ) .σ(t, X t ) dt\n−\n\nξz (t, X t )σ X (t, X t )dWt\n\nand by arranging the terms properly we get\n\u0010\n\u0011\n\u0001\ndξ(t, X t ) = −ξz (t, X t ) σ X (t, X t ) − σ(t, X t ) dWt − ξz (t, X t ) μX (t, X t ) − μ(t, X t ) dt\n\u0010\n\u0011\n1\nξzz (t, X t ) ||σ(t, X t )||2 + ||σ X (t, X t )||2 − 2σ X (t, X t ).σ(t, X t ) dt\n+\n2\n\u0010\n\u0011\n+ ξz (t, X t ) σ X (t, X t ) − σ(t, X t ) .σzX (t, X t )dt\n\u0010\n\u0011\n\u0001\n= −ξz (t, X t ) σ X (t, X t ) − σ(t, X t ) dWt − ξz (t, X t ) μX (t, X t ) − μ(t, X t ) dt\n+\n\n1\nξzz (t, X t )||σ(t, X t ) − σ X (t, X t )||2 dt\n2\n\u0010\n\u0011\n\n+ ξz (t, X t ) σ X (t, X t ) − σ(t, X t ) .σxX (t, X t )dt\n\n19\n\n\fSubsequently, by introducing new coefficients ∆μ and ∆σ as follows:\n∆μ(t, y) := μX (t, y) − μ(t, X t ) et ∆σ(t, y) := σ X (t, y) − σ(t, X t )\n\u0001\nthe last line becomes ∂y ||∆σ(t, y)||2 ξz (t, X t ) which yields to the desired formula:\n\u0010\n\u0011\nb ∆ (ξ)(t, X t )dt\ndξ(t, X t ) = −ξz (t, X t ) σ X (t, X t ) − σ(t, X t ) dWt + L\n=\n\nb ∆ (ξ)(t, X t )dt\n−ξz (t, X t )σ̂(t, X t )dWt + L\n\n(iii) The properties of the random field G(t, X t ) are obtained once again from Itô-Ventzel's formula,\nin a very similar way than for ξ(t, X t ), since the second line of Equation (2.9) has the same form\nthan the SPDE of ξ except that the Brownian dW is replaced by dW. + σxY (G)dt. So we obtain\nEquation (2.11).\n\nBack to Progressive Utilities Let now come back to progressive utilities U. The results\nof this section will be of great use in the rest of this work, especially when we focus on dynamic\noptimal portfolios. We give sufficient conditions on progressive dynamic utilities so that assumpey of Ux is a semimartingale.\ntions of Theorem 1.1 are satisfied, in particular that the inverse −U\nThese assumptions are made on the coefficients of the intrinsic SDE(μ, σ) and not on the local\ncharacteristics (β, γ), since essential results are obtained from SDEs properties.\nTheorem 2.8. Consider SDE(μ, σ) of class S 1,δ , δ ∈ (0, 1] and let Z be its unique monotonic\n1,ε\nsolution of class Kloc\nfor any 0 < ε < δ . For any deterministic utility function u s.t. ux is\nRx\nintegrable near to x = 0, define U (t, x) = 0 Zt (ux (z))dz. Then\nRx\n(i) U (t, x) is an Itô semimartingale with local characteristics β(t, x) = 0 μ(t, Zt (ux (z))dz and\nRx\nγ(t, x) = 0 σ(t, Zt (ux (z))dz.\n\n2,ε\n(ii) U is a progressive utility with derivative Ux (t, x) = Zt (ux (x)). Moreover, U is a Kloc\n2,ε\n2,ε\nsemimartingale for any 0 < ε < δ, with local characteristics (β, γ) are of class Kloc × Kloc for\nany ε < δ.\n\n(iii) If the SDE(μ, σ) is of class S m,δ , (m ≥ 3, δ ∈ (0, 1]), then, the progressive convex conjugate\ne of U is a Km−1,ε -semimartingale.\nutility U\nloc\ney = −(Ux )−1 is a Km−2,ε -semimartingale, solution of the SDE(σ̃, μ̃) in S m,ε for\n− Its derivative U\nloc\nany 0 < ε < δ, where\nσ̃(t, −z) =\n\nγx (t, z)\n,\nUxx (t, z)\n\nμ̃(t, −z) =\n\n\u0010\n1\nkγx (t, z)k2 \u0001\u0011\n1\nβx (t, z) − ∂x\nUxx (t, z)\n2\nUxx (t, z)\n\n(2.12)\n\ne and U\ney are,\n− Assumptions of Theorem 1.5 are satisfied and the dynamics of U\ne (t, y) =\ndU\n\ney (t, y) =\ndU\n\n\u0001\neyy (t, y)kσt (y) k2 dt\ney (t, y)).dWt + β(t, −U\ney (t, y))dt + 1 U\nγ(t, −U\n2\n\u00101\n\u0011\n\u0001\n2\neyy (t, y)σ(t, y).dWt +\ney ) (t, y) − μ(t, y)∂y (U\ney )(t, y)) dt\n−U\n∂y kσk ∂y (U\n2\n\nConcluding remarks on these two sections Having introduced the progressive utilities and\ntheir convex conjugate in Section 1, we have studied in detail conditions ensuring concavity and\nInada conditions, by using that Ux is a monotonic solution of a \"regular\" SDE. But the main\n\n20\n\n\fresult given in Section 2 concerns the inverse flow ξ of the monotonic solution X of a SDE, and the\nsufficient conditions on the coefficients ensuring the semimartingale property of the inverse flow ξ.\nThe introduction of the adjoint SPDE satisfied by ξ and the result of Theorem 2.7 are a powerful\ntool for that follows. We turn now to the study of additional condition called consistency property\nthat we introduce in the next section.\n\n3\n3.1\n\nConsistent Dynamic Utilities\nDefinition of Consistent Dynamic Utilities\n\nThe notion of progressive utility is very general and should be specified so as to represent more\nrealistically the dynamic evolution of the individual preferences of an investor in a given financial\nmarket. The utility input provides a differential constraint on the risk attitude of the investor in\nx (x,t)\nterms of preference for higher or lower wealth, through the local risk tolerance τ U (x, t) = − UUxx\n(x,t) ,\nand, that we call, utility market risk premium η U (t, x) = Uγxx(t,x)\n(x,t) , revealing the interplay between\nthe investment universe and the risk attitude.\nThe market input is described by a vector space X of portfolios incorporating feasibility\nand trading constraints and high liquidity. Several interpretations of the subclass of admissible\nportfolios can be done. The first one, proposed by Musiela and Zariphopoulou is that this class\ndescribes all investment universe. The second one is as follows: the market inputs may be viewed as\na calibration universe, and the class X as a test-class of processes. The existence of an admissible\nportfolio giving the maximal satisfaction to the investor, which will be preserved at all times in the\nfuture, explains the martingale property in the definition below. On the other hand if the strategy\nin X fails to be optimal then it is better not to make investment. The optimal portfolio may\nbe viewed as a benchmark for the investor using the utility U . Once his consistent progressive\nutility is defined, an investor can then turn to a portfolio optimization problem in a larger financial\nmarket or to calculate indifference prices. Following [25, 29], a X -consistent dynamic utility is\ndefined as follows.\nDefinition 3.1 (X -consistent dynamic utility). A X -consistent dynamic utility U = {U (t, x); t ≥\n0, x > 0} is a progressive utility with the following additional properties:\nConsistency with the test-class: For any admissible wealth process X ∈ X ,\nE(U (t, Xt )/Fs ) ≤ U (s, Xs ), ∀s ≤ t a.s.\nExistence of optimal wealth: For any initial wealth x > 0, there exists an optimal wealth\nprocess X ∗ ∈ X such that X0∗ = x, and for all s ≤ t,\nU (s, Xs∗ ) = E(U (t, Xt∗ )/Fs ) ∀s ≤ t a.s.\nIn short for any admissible wealth X ∈ X , U (., X. ) is a positive supermartingale and a martingale\nfor the optimal-benchmark wealth X ∗ .\nRemark 3.1. (i) The martingale property can be weakened by the following localization procedure, if there exists a sequence of increasing stopping times Tn (X0 ) ր ∞ on the random interval\n\n21\n\n\f[0, Tn (X0 )], U (., X.∗ ) is a martingale.\n(ii) Note that the initial condition U (0, .) = u(.) is part of the definition, in particular u is a\ndeterministic utility function which is fixed a priori independently of the given financial market\nand in particular of X .\n(iii) So a X -consistent dynamic utility is a constant in time deterministic function only when the\ntest-portfolios are local martingales. In this case, the optimal strategy is to do nothing.\n(iv) Our definition differs slightly from the original ([25]) since we do not require that the wealth\nprocesses X are discounted. This variation offers more options and allows us to study the invariance of the class of dynamic utilities by change of numeraire. In any case, there is no fixed\nhorizon.\n\n3.2\n\nThe investment universe\n\nWe consider a incomplete Itô market, equipped with a n-standard Brownian motion, W with\nBrownian coordinates (W1 , W2 , ..., Wn )T (n ≥ d) and characterized by a short rate (rt ) and a\nn-dimensional risk premium vector (η). All these processes are defined on the filtered probability\nspace (Ω, Ft≥0 , P) satisfying usual assumptions, with minimal integrability assumptions. Since\nwe only need to know the class of admissible portfolios, we immediately give the mathematical\ndefinition of this class, based on the self-financing equation without arbitrage. The market incompleteness is modeled as in Lehoczky, Karatzas, Shreve & Xu [16]. The notations are the same\nthan in Karatzas and Shreve [17] where the interested reader may be find all complementary\ninformation.\nDefinition 3.2 (Test portfolios). (i) A positive Itô semimartingale X κ is called a portfolio, or\nadmissible wealth process if\n\u0002\n\u0003\ndXtκ = Xtκ rt dt + κt .(dWt + ηt dt) , κt ∈ Rt .\n\n(3.1)\n\nRT\nwhere κ is a n-dimensional vector, progressive such that 0 kκt k2 dt < ∞, a.s., measuring the\nvolatility vector of the wealth X κ .\n(ii) The family of admissible wealth processes, also called test portfolios is defined by some restrictions on the volatility vector κ; we assume there exists progressive family of vector spaces (Rt )\nsuch that for any t, κt ∈ Rt .\n(iii) The family of test portfolios is denoted by X . It may be easy to verify that X is convex.\nThe following short notations will be used extensively. Let R be a vector subspace of Rn . For any\nx ∈ Rn , xR is the orthogonal projection of the vector x onto R and x⊥ is the orthogonal projection\nonto R⊥ .\nThe existence of a risk premium η is a possible formulation of the absence of arbitrage opportunity.\nSince from (3.1), the impact of the risk premium on the wealth dynamics only appears through\nthe term κt .ηt for κt ∈ Rt , there is a \"minimal\" risk premium (ηtR ), the projection of ηt on the\nspace Rt (κt .ηt = κt .ηtR ), to which we refer in the sequel. Moreover, the existence of η R is not\nenough to insure the existence of equivalent martingale measure, since in general we do not know if\nRt\nRt\nR\nthe exponential local martingale Lηt = exp( 0 −ηsR .dWs − 12 0 |ηsR |2 ds) is a uniformly integrable\nmartingale, density of an equivalent martingale measure. Nevertheless, we are interested into the\n\n22\n\n\fclass of the so-called state price density processes Y ν (taking into account the discount factor)\nwho will play the same role for the dynamic conjugate utility, than the wealth processes X κ for\nthe dynamic utility U .\nDefinition 3.3 (State price density process). (i) A Itô semimartingale Y ν is called a state price\ndensity process if for any wealth process X κ , κ ∈ R, Y ν X κ is a local martingale. It follows that\nY ν satisfies,\ndYtν = Ytν [−rt dt + (νt − ηtR ).dWt ], νt ∈ R⊥\nY0ν = y\n(3.2)\nt ,\n(ii) Denote Y the convex family of all state density processes Y ν where ν ∈ R⊥ and observe that\nRt\nRt\n\u0001\nY ν is the product of Y 0 (ν = 0) by the density martingale Lνt = exp 0 νs .dWs − 1/2 0 |νs |2 ds .\n\n3.3\n\nConsistent Dynamic Utility and Portfolio Optimization\n\nX -consistent dynamic utility and HJB constraint In Paragraph 1.2, more precisely\nin Theorem 1.1, we have characterized progressive utilities in terms of their local characteristics\n(β, γ) as well as in terms of the parameters (μ, σ) of the intrinsic SDE (1.3) satisfied by Ux . In this\nsection, we are concerned with the constraint induced on the drift characteristic β of the dynamic\nutility by the consistency property. The consistency property plays the same role that the dynamic\nprogramming principle in the classical theory of backward expected utility maximization, (see for\nexample H. Pham [30]). Thanks to Itô-Ventzel's formula (Theorem 1.4), constraints on the local\ncharacteristics (β, γ) of U lead to non standard Hamilton-Jacobi-Bellman Stochastic PDE. As in\nthe classical case, the main parameters of the SPDE are the risk tolerance process and the utility\nmarket risk premium.\nDefinition 3.4 (Utility risk tolerance and risk premium). In this financial framework, the utility\nx (t,x)\nrisk tolerance random field is defined by τ U (t, x) = − UUxx\n(t,x) and the utility risk premium random\nfield by η U (t, x) =\n\nγx (t,x)\nUx (t,x)\n\nwith its two components η U,R ∈ R, η U,⊥ ∈ R⊥ .\n\nObserve that Condition (1.8) in Corollary 1.3 states that η U is bounded in x with random bound.\nThe supermartingale property of U (., X κ ) implies that the drift of these processes must be negative\nfor all κ ∈ R, and equal to 0 for some κ∗ . We proceed by verification as in the classical case.\n2,δ\nTheorem 3.1 (Utility-SPDE). Let U be a progressive utility which is a Kloc\n-semimartingale\n(δ ∈ (0, 1]) with local characteristics (β, γ). Assume the drift constraint to be of HJB type,\n\nn\n1\nUx (t, x)ηtR + γx (t, x) \u0001o\n.\nβ(t, x) = −Ux (t, x)rt x − Uxx (t, x) inf kxκk2 + 2xκ.\nκ∈R\n2\nUxx (t, x)\n\n(i) The minimum of the quadratic form (3.3) is achieved at the optimal policy κ∗ given by\n(\nxκ∗t (x)\n= − Uxx1(t,x) (Ux (t, x)ηtR + γxR (t, x))\nand β(t, x)\n\n= −Ux (t, x)xrt + 12 Uxx (t, x)kxκ∗ (t, x)k2\n\n(3.3)\n\n(3.4)\n\n(ii) For any κ ∈ R, the process U (., X.κ ) is a supermartingale, and a local martingale for any\n\u0001\nsolution (if there exists) X ∗ of the SDE dXt∗ = Xt∗ rt dt+κ∗ (t, Xt∗ ).(dWt +ηtσ dt) . Under additional\nintegrability assumptions, the X -consistency property is satisfied.\n\n23\n\n\fRemark 3.2. In the classical backward framework, similar SPDE is investigated by Mania and\nTevzadze[22] using BSDE tools, and by Englezios and Karatzas [14]. (See also Remark 4.2)\nProof. By Itô-Ventzel's formula (Theorem 1.4), for any admissible portfolio X κ ,\n\u0010\n\u0011\ndU (t, Xtκ ) =\nUx (t, Xtκ )Xtκ κt + γ(t, Xtκ ) .dWt\n\u0010\n\u0011\n1\n+\nβ(t, Xtκ ) + Ux (t, Xtκ )rt Xtκ + Uxx (t, Xtκ )Q(t, Xtκ , κt ) dt,\n2\nR\nU\n(t,\nx)η\n+\nγ\n(t,\nx) \u0001\nx\nx\nt\nwhere Q(t, x, κ) := kxκk2 + 2xκ.\n.\nUxx (t, x)\n\nSince κ ∈ R, Q(t, x, κ) is only depending on γxR (t, x), the orthogonal projection of γx (t, x) on\nRt . The minimum Q∗ (t, x) = inf κ∈R Q(t, x, κ) of the quadratic form Q(t, x, κ) is achieved at the\noptimal policy κ∗ given by\n(\n\u0001\nxκ∗t (x) = − Uxx1(t,x) Ux (t, x)ηtR + γxR (t, x)\n(3.5)\n1\nR\nR\n2\n∗\n2\nQ∗ (t, x) = − Uxx (t,x)\n2 kUx (t, x)ηt + γx (t, x))k = −kxκt (x)k .\nThen the drift of the semimartingale U (t, Xtκ ) satisfies\n\n≤\n=\n\n1\nβ(t, Xtκ ) + Ux (t, Xtκ )rt Xtκ + Uxx (t, Xtκ )Q(t, Xtκ , κt )\n2\n1\nβ(t, Xtκ ) + Ux (t, Xtκ )rt Xtκ + Uxx (t, Xtκ )Q∗ (t, Xtκ , κt )\n2\n1\nβ(t, Xtκ ) + Ux (t, Xtκ )rt Xtκ − Uxx (t, Xtκ )kXtκ κ∗t (Xtκ )k2\n2\n\nThe proof is complete.\nThe characteristics of the conjugate progrese\nsive utility U can be computed directly from Theorem 1.5. Given that β is associated with an\noptimization program, we show that the dual drift β̃ is also constrained by a HJB type relation\ne is consistent with a family of state price\nin the new variables. So, the convex conjugate utility U\ndensity processes (Definition 3.3). As observed in Theorem 2.8 (ii), the study of the conjugate\ne requires stronger assumptions than the study of U .\nutility U\n\nConjugate of consistent dynamic utility\n\nTheorem 3.2. Let U a progressive utility with characteristics (β, γ) satisfying Assumptions of\ne and its marginal conjugate utility\nTheorem 2.8. Then its progressive convex conjugate utility U\ne y are Itô random fields with local characteristics (β̃, γ̃) and (β̃y , γ̃y ) respectively. Assume the\nU\ndrift constraint of U to be of HJB type (3.3).\ne are given by:\n(i) The local characteristics of the convex conjugate U\n\ney (t, y)), γ̃y (t, y) := −γx (t, −U\ney (t, y)).U\neyy (y)\n\n γ̃(t, y) := γ(t, −U\n\u0001\n(3.6)\n1\neyy (t, y)ηtR k2\ney (t, y)rt +\n\nkγ̃y (t, y)k2 − kγ̃yR (t, y) + y U\n β̃(t, y) = y U\ne\n2Uyy (t, y)\n\n(ii) The non linear drift β̃(t, y) is associated with the following optimization program:\n\u0001\n\u0001\ney (t, y)rt − 1 y 2 U\neyy (t, y) inf {kνt − ηtR k2 + 2 νt − ηtR . γ̃y (t, y) }\nβ̃(t, y) = y U\n⊥\neyy (t, y)\n2\nνt ∈R\nyU\n\n24\n\n(3.7)\n\n\f(iii) The minimum of this quadratic form is achieved at the optimal policy\nyνt∗ (y) =\n\n\u0001\n−γ̃y⊥ (t, y)\ney (t, y) = yη U,⊥ (t, −U\ney (t, y)).\n= γx⊥ t, −U\neyy (t, y)\nU\n\n(iv) Rewritten in terms of optimal strategy, β̃(t, y) becomes\ni\nh\ney (t, y)rt − 1 U\neyy (t, y) kyνt∗ (y) − yηtR k2 − 2(yνt∗ (y) − yηtR ). γ̃y (t, y) .\nβ̃(t, y) = y U\neyy (t, y)\n2\nU\n\n(3.8)\n\ne (t, Ytν ) is a submartingale,\n(v)For any admissible state price density process Y ν ∈ Y with ν ∈ R⊥ , U\nand a local martingale for any solution Y ∗ (if there exists) of the equation dYt∗ = Yt∗ [−rt dt +\n(ν ∗ (t, Yt∗ ) − ηtR ).dWt ].\nProof. (i) By Theorem 1.5, the local characteristics (β̃, γ̃) of the conjugate random field\ne (t, y)) and β̃(t, y) = β 1 (t, −U\ne (t, y)) where β 1 (t, x) = β(t, x)\nare given by γ̃(t, y) = γ(t, −U\n1\n2\n2Uxx (t,x) kγx (t, x)k . Combining this identity with the HJB-constraint β(t, x) = −Ux (t, x)xrt\n1\n∗\n2\n2 Uxx (t, x)kxκ (t, x)k yields to\n\u0011\n\u0010\n1\nkγx (t, x)k2 − kUx (t, x)ηtR + γxR (t, x)k2 .\nβ 1 (t, x) = −xUx (t, x)rt −\n2Uxx (t, x)\n\ne\nU\n−\n+\n\n(ii) & (iii) Since the norm of the projection on Rt is the distance to the orthogonal vector space\nR⊥\nt ,\nγ R (t, x)\nk x\n+ ηtR k2 := kη U,R (t, x) + ηtR k2 = inf kν − (η U,R + ηtR )k2 .\nUx (t, x)\nν∈R⊥\nt\n\nUsing the relation |x|2 − |y|2 = |x − y|2 + 2(x − y).y, we get:\nkη U,R (t, x) + ηtR k2 − kη U (t, x)k2\n\n=\n\ninf {kν − ηtR k2 + 2(ν − ηtR ).η U (t, x)}\n\nν∈R⊥\nU,⊥\n\n= kη\n\n(t, x) − ηtR k2 + 2(η U,⊥ (t, x) − ηtR ).η U (t, x).\n\nBy coming back to β 1 , we can make the minimization program to be explicit,\nβ 1 (t, x) + xUx (t, x)rt\n\n=\n=\n\n\u0001\nUx2 (t, x)\ninf {kν − ηtR k2 + 2(ν − ηtR ).η U (t, x)}\n⊥\nUxx t, x) ν∈R\n\u0001\nUx2 (t, x)\nkη U,⊥ (t, x) − ηtR k2 + 2(η U,⊥ (t, x) − ηtR ).η U (t, x) .\nUxx t, x)\n\nThe minimum in the quadratic form is achieved at η U,⊥ (t, x), corresponding the optimal strategy\ney (t, y)). From this and the identities,\nνt∗ (y) = η U,⊥ (t, −U\ney (t, y))\nUx2 (t, −U\n1 e\n= − y2U\nyy (t, y),\ney (t, y))\n2\n2Uxx (t, −U\n\ney (t, y)) = − γ̃y (t, y)\nη U (t, −U\neyy (t, y)\nyU\n\nwe get the desired formula for β̃ both in (3.6) and in (3.8), i.e.\nβ̃(t, y)\n\ney (t, y)rt +\n= yU\n\n1\n\neyy (t, y)ηtR k2\nkγ̃y (t, y)k2 − kγ̃yR (t, y) + y U\n\n\u0001\n\neyy (t, y)\n2U\ni\nh\neyy (t, y) kyνt∗ (y) − yηtR k2 − 2(yνt∗ (y) − yηtR ). γ̃y (t, y) .\ney (t, y)rt − 1 U\n= yU\neyy (t, y)\n2\nU\n\n(iv) is a simple rewriting of the HJB constraint on β̃.\n(v) The supermartingale property is proved in very similar manner than for dynamic utility, (proof\nof Proposition 3.2 (ii) and (iii)).\n\n25\n\n\f4\n\nMarginal Utility SPDE and Optimal SDEs\n\nAs seen in Section 1 and 2, our utility characterization is based on the marginal utility. So, we\nfocus now on the dynamics of the random field Ux . As established in Theorem 3.1, the drift\ncharacteristic of X -consistent utility is constraint by a HJB type condition (3.3)\nβ(t, x) = −Ux (t, x)xrt + 12 Uxx (t, x)kxκ∗t (x)k2 .\nThe diffusion characteristic γx is explained by the optimal policies of the primal and dual problems,\nTheorem 3.1 and Theorem 3.2:\nγx (t, x) = −Uxx (t, x)xκ∗t (x) − Ux ηtR + Ux (t, x)νt∗ (Ux (t, x))\nThe characteristic γx (t, x) may be rewritten in a more convenient form, using the diffusion coefficient of the optimal policy σt∗ (x) := xκ∗t (x), and the diffusion coefficient of the optimal state price\ney (t, y)) as,\ndensity σ̃t∗ (y) = −yηtR + γx⊥ (t, −U\nγx (t, x) = −∂x (Ux )(t, x)σt∗ (x) − Ux (t, x)ηtR + σ̃t∗ (Ux (t, x))\n\nIt is easy to recognize the diffusion coefficient of the SPDE (2.9) in Theorem 2.7 associated with\nthe SDEs with diffusion parameters σt∗ (x) and σ̃t∗ (y). Moreover, by taking the x-derivative in the\ndrift constraint β(t, x) = −Ux (t, x)xrt + 12 Uxx (t, x)kxκ∗t (x)k2 = −Ux (t, x)xrt + 21 Uxx (t, x)kσt∗ (x)k2 ,\nit appears naturally a divergence term associated with the optimal policy σt∗ (x) = xκ∗t (x) in the\ndrift characteristic of Ux which suggests to use the main theorem (Theorem 2.7) applied to the\noptimal SDEs.\n\n4.1\n\nMain result : solving marginal utility SPDE via optimal SDEs\n\nTo be closer to the notation of Theorem 2.7, we recall all the coefficients of SDEs associated with\nthe optimal policies X ∗ and Y ∗ if they exist:\n\n∗\n∗\nR\n∗\n∗\n\n μt (x) := rt x + xκt (x).ηt , σt (x) := xκt (x)\ney (t, y))\n(4.1)\nμ̃∗t (y) := −rt y,\nσ̃t∗ (y) = −ηtR y + γx⊥ (t, −U\n\n b∗\n1\n∗\n2\n∗\nLt,x\n:= 2 ∂x (kσt (x)k ∂x ) − μt (x)∂x\n\nWe start with the identification of the SPDE satisfied by the marginal utility of a consistent\ndynamic utility imposing only regularity condition on the utility random field and its local characteristics. We will then give additional conditions that guarantee the existence of solution to SDEs\nwith coefficients (μ∗ , σ ∗ ) and (μ̃∗ , σ̃ ∗ ).\n\n2,δ\nProposition 4.1. Let U be a Kloc\n∩ C 3 -regular (δ > 0) progressive utility U , whose the local\ncharacteristics (β, γ) satisfy the HJB constraints,\n(\nγx (t, x) := −Uxx (t, x)σt∗ (x) + ηtR Ux (t, x) + σ̃t∗ (Ux (t, x))\n(4.2)\nβ(t, x) := −Ux (t, x)x rt + 12 Uxx (t, x)kσt∗ (x)k2\n\nThe marginal utility Ux is a decreasing solution of the SPDE (2.9) with coefficients (μ∗ , σ ∗ ) and\n(μ̃∗ , σ̃ ∗ )\ndUx (t, x)\n\n=\n\nσ̃t∗ (Ux (t, x)).dWt + μ̃∗t (Ux (t, x))dt\n\n−\n\nb ∗t,x (Ux )dt\n∂x Ux (t, x)σt∗ (x). dWt + σ̃y∗ (t, Ux (t, x))dt) + L\n\n26\n\n(4.3)\n\n\f2,δ\n1,δ\nProof. At first, as U is assumed to be Kloc\n∩ C (3) -regular, Ux is of class Kloc\nand its local\n1\n∗\n∗\ncharacteristics (βx , γx ) are of class C in x; then, the vectors σt (x) = xκt (x) = −(γxR (t, x) +\ney (t, y)) are also of class C 1 , necessary condiηtR Ux (t, x))/Uxx (t, x) and σ̃t∗ (y) = −ηtR y + γx⊥ (t, −U\n∗\nb\ntion to define L . By derivation of the local characteristics, it is clear that βx contains a second\norder term in divergence form associated with xκ∗t (x) = σt∗ (x), which leads us to introduce the\nb ∗t,x associated with (μ∗ , σ ∗ ). It remains to make some slight transformations on\nadjoint operator L\nthe drift characteristic. Observe that\n\u0001\nβx (t, x) = −∂x (Ux (t, x)xrt ) + ∂x 12 Uxx (t, x)kσt∗ (x)k2\nb ∗ (Ux ) − rt Ux (t, x) + ∂x Ux (t, x)σ ∗ (x).η R\n(4.4)\n=L\nt,x\nt\nt\n∗\n∗\n∗\nR\nb\n= Lt,x (Ux ) + μ̃t (Ux ) + ∂x Ux (t, x)σt (x).ηt\n\nLet us give another interpretation of σt∗ (x).ηtR . Since σ̃ ∗ (t, y) + ηtR y belongs to the vector space\n∗\nR\n⊥\nR⊥\nt the spatial derivative σ̃y (t, y) + ηt is also in Rt , yielding to the relation on the scalar products\n−σt∗ (x).ηtR = σt∗ (x).σ̃y∗ (t, y). Then, Identity (4.3) holds true.\n\nComment (i) There is a fairly subtle relation between the SDE(μU , σ U ) introduced in Theo\u0001\ney (t, z) and σ U (t, z) =\nrem 1.1 to characterize the marginal utility Ux where μU (t, z) = βx t, −U\n\u0001\ney (t, z) , and the coefficients of the two optimal SDEs, in particular in terms of diffusion\nγxU t, −U\ncoefficients. The HJB constraint γxU (t, x) = −Uxx (t, x)σt∗ (x) + ηtR Ux (t, x)) + σ̃t∗ (Ux (t, x)) becomes\nσ U (t, z) =\n\ney (t, z))\nσt∗ (−U\n+ ηtR z + σ̃t∗ (z)\neyy (t, z)\nU\n\nIn particular, since σ̃t∗ (z) = σ U,⊥ (t, z), any regularity property on σ U are immediately transferred by linear projection on σ̃t∗ (−z). But, only some local regularity on σt∗ (t, z) may be deduced\nfrom global regularity of σ U . Nevertheless, we can justify the existence of a global optimal wealth\nsolution in a similar way than for the inverse process.\n(ii) Observe also that we obtained a way to generated X -consistent utility only from their local\ncharacteristics and the SPDE 4.3, since we do not use a priori the concavity assumption in the\nfollowing theorem.\n2,δ\nTheorem 4.2 (Main theorem). Let U be a Kloc\n∩ C 3 -semimartingale progressive utility U ,\nwhose the local characteristics (β, γ) satisfy the HJB constraints (4.2); then, the derivative Ux (t, x)\nis solution of the SPDE (4.3).\nAssume, in addition, the existence of two positive adapted stochastic bounds (K 1 , K 2 ) such that\n⊥\n(t, x)k ≤ Kt2 |Uxx (t, x)|, a.s., (K 1 , K 2 ) ∈ L2 (dt)\nkγx⊥ (t, x)k ≤ Kt1 |Ux (t, x)|, kγxx\n\n(4.5)\n\nExistence of optimal processes: (i) The conjuguate SDE(μ̃∗ , σ̃ ∗ ) is uniformly Lipschitz and\nhas a unique strong solution Yt∗ (y), which is strictly positive, and strictly monotonic, with range\n[0, ∞).\n(ii) The SDE(μ∗ , σ ∗ ) has only local Lipschitz property, and admits a maximal monotonic solution\nX ∗ defined a priori only up to a stopping times ζ ∗ (x). But, the explosion time ζ ∗ (x) = ∞ a.s.\nsince the processes Ux (., X.∗ (x)) is distinguishable from the solution Y.∗ (ux (x)).\nConsistency and marginal utility characterization: The random field U is a X -consistent\n\n27\n\n\futility, with optimal wealth X ∗ . Furthermore, the derivative random field Ux (t, x), solution of the\nSPDE (4.3) is given by Ux (t, x) = Yt∗ (ux ((Xt∗ )−1 (x))). So Ux (t, x) is a strictly decreasing and\npositive process with range [∞, 0].\nRemark 4.1. In this framework, we do not need that the inverse process X (t, x) is a semimartingale. Nevertheless, if γx⊥ ≡ 0, then Yt∗ (y) = yYt0 and as Ux (t, x) is a semimartingale, ux (X (t, x))\nis also semimartingale, consequently X (., x) is a semimartingale since U (t, x) and u are assumed\nto be of class C 3 .\nProof. (i) The assumption (4.5) implies as above observed that the coefficients (μ̃∗ , σ̃ ∗ ) are uniformly Lipschitz in space, and then the SDE has an unique monotonic strong solution Yt∗ (y). Since\n∗\nby assumption kγx (t, x)k ≤ Kt1 |Ux (t, x)|, then kα̃∗ (t, y)k = kσ̃ (t,y)k\n≤ Kt1 . As K 1 ∈ L2 (dt), Y ∗\ny\nwhich is also solution of the SDE dYt∗ = Yt∗ [rt dt + α̃∗ (t, Yt∗ ).dWt is strictly positive.\n2,δ\n(ii) Under the same assumption in addition to the property of U of class Kloc\n, the coefficients\n\u0001\n0,1\n0,1\n∗\n∗\n(μ , σ ) are only in Kloc × Kloc , and then by Theorem 2.4, there exists a monotonic maximal\nsolution Xt∗ (x) up to explosion time ζ ∗ (x).\n(iii) a) We show together the property( Ux (t, Xt∗ (x)) = Yt∗ (ux )) )and the fact that ζ ∗ (x) = ∞.\nWe are applying, up to ζ ∗ (x), Theorem 2.7 iv) to Ux (t, x), solution of the SDPE (4.3), and to the\nprocess Xt∗ .Then, it follows that Ux (t, Xt∗ (x)) is solution of SDE(μ̃∗ , σ̃ ∗ ) up to ζ ∗ (x) with initial\ncondition ux . In other words, Ux (t, Xt∗ (x)) = Yt∗ (ux (x))); t < ζ ∗ (x).\nb) When t 7→ ζ ∗ (x) on ζ ∗ (x) < ∞, Ux (t, Xt∗ (x)) 7→ 0, and Yt∗ (ux (x))) 7→ Yζ∗∗ (x) , then Yζ∗∗ (x) (ux (x))) =\n0, but since Yt∗ (y) is a strictly positive process, a contradiction occurs if P(ζ ∗ (x) < ∞) > 0.\n(iv) The property of U are deduced of the identity Ux (t, Xt∗ (x)) = Yt∗ (ux (x))) and from Theorem\n2.8.\nRemark 4.2. In [14] the authors have also shown that the solution of the backward SPDE can\nbe represented through the composition of two invertible processes. The main difference with the\napproach proposed here is that their processes are given as conditional expectation of monotonic\nfunctions as we describe them in path-wise form as SDE solutions.\nComment: Obviously the main result, Theorem 4.2, gives us only sufficient conditions to generate\nX -consistent utility from their characteristics. In fact, the assumptions gives us the existence\nof a monotonic strictly positive strong solution Y ∗ of SDE(μ̃∗ , σ̃ ∗ ), and by local regularity, the\nexistence of a monotonic solution X ∗ of SDE(μ̃∗ , σ̃ ∗ ) up to explosion time ζ x . Obviously, we\ncan interchange the roles of Y ∗ and X ∗ . Indeed, in line with Section 2, given the existence of a\nsolution of the SPDE (4.3), by assertion (iii) of Theorem 2.7, the existence of a solution X.∗ (x)\nstarting from x to the SDE(μ∗ , σ ∗ ) implies that Ux (t, Xt∗ (x)) is solution of the SDE(μ̃∗ , σ̃ ∗ ) and so\nis a state price density process Ybt∗ (ux (x)), starting from ux (x). Moreover, existence of a solution\nto SDE(μ∗ , σ ∗ ) is equivalent to existence of a solution to SDE(μ̃∗ , σ̃ ∗ ). Otherwise, if we give\nourselves X ∗ monotone solution of SDE(μ∗ , σ ∗ ) with a semimartingale inverse X and Y ∗ a K2\nregular solution to SDE(μ̃∗ , σ̃ ∗ ) then, from assertion (i) of Theorem 2.7, the compound process\n\u0001\u0001\nYbt∗ ux X (t, x) is an obvious solution of SPDE (4.3).\n\n28\n\n\f4.2\n\nReverse Engineering Problem\n\nWe consider the converse point of view of the marginal utility characterization given by Theorem\n4.1. More precisely, by taking as input an initial condition U (0, .) = u(.) and some monotonic\nsolution of SDE(μ, σ) and SDE(μ̃, σ̃), we propose an explicit way to recover all consistent utility U\ngenerating this wealth as optimal process. In the classical expected utility framework, this reverse\nengineering problem has been considered by He and Huang [10] (1992) in a complete market.\nSince the class of dynamic utilities is larger than the class of Markovian utilities considered in [10],\nour problem is easier to solve. In particular, we establish that the only assumption we need is\nthe monotonicity of the wealth process with respect to the initial wealth, plus some integrability\nconditions.\nIn the following theorem, we try to introduce minimum assumptions used in the different problems.\nEither we assume the strong assumption that the SDE(μ, σ) is regular enough to have a unique\nmonotonic strong solution X whose the inverse X is a semimartingale or we make the existence of\nb μ,σ\nX in addition to the existence of a solution X to the SPDE(L\nt,x , −σ∂x ).\n\nTheorem 4.3. Let κ ∈ R be a volatility vector and σt (x) = xκt (x), μt (x) := rt x + σt (x).ηtR\nb μ,σ\nthe coefficients of the SDE defining an admissible wealth process. As previously, let L\nt,x :=\n1\n2\n2 ∂x (kσt (x)k ∂x ) − μt (x)∂x be its adjoint operator.\nSimilarly, let ν ∈ R⊥ be an orthogonal volatility vector, and μ̃(t, y) := −yrt , σ̃(t, y) = y(νt (y) −\n\u0001\nηtR ) the coefficients of the SDE defining an admissible state price density process.\nAssumptions a) Strong assumptions Assume the SDE(μ, σ) in the class S 3,δ (δ ∈ (0, 1]), so\nthat SDE(μ, σ) has a unique monotonic solution X, whose the inverse X is solution of the SPDE\nb t,x (X )dt.\ndX (t, x) = −Xx (t, x)σt (x).dWt + L\n\n(4.6)\n\nb) or Weak assumptions Assume only the SDE(μ, σ) in the class S 1,δ (δ ∈ (0, 1]), and the\nb t,x , −σ∂x )\nexistence of a solution X of the SPDE(L\nc) Assume the SDE (μ̃, σ̃) in the class S 2,δ with monotonic solution Y .\n\nmain Result (i) For any initial utility function u, the stochastic random field V defined by\n\u0001\u0001\nV (t, x) = Yt ux X (t, x) , if it is integrable near to zero, is the derivative of a consistent stochastic utility U, solution of the SPDE (4.3) with optimal wealth process X = X −1 , solution of the\nSDE(μ, σ).\ne of U is U\ne y := −V−1 with U\ney (t, y) = Xt −\n(ii) The derivative of the convex conjugate U\n\u0001\u0001\nũy Y(t, y) where Y denote the inverse flow of Y. Moreover, if the SDE(μ̃, σ̃) belongs to S 3,δ ,\ney (t, y)) and (U\ne (t, y)) are Itô's semimartingales.\nthe processes (U\n\nProof. Calculations are easy consequence of Theorem 2.7 (ii), applied to the processes X solution\nof the SPDE (4.6), and Y in place of X with initial condition ux .\n(i) With the notations of Theorem 4.7, we have\ndV (t, x)\n\n= σ̃t (V (t, x)).dWt + μ̃t (V (t, x))dt\n\u0002\nb t,x (V )dt\n− ∂x V (t, x)σt (x) dWt + σ̃t (V (t, x))/V (t, x)dt + L\n\nRecall that σ̃t (y) = y(νt (y) − ηtR ), so that σ̃t (y).σt (x) = −yηtR .σt (x). So, the process V satisfies\n\n29\n\n\fthe SPDE (4.3). As in the proof of Theorem 4.1, the drift β V may be transformed into\nβ V (t, x)\n\n\u0001\n1\nVx (t, x)kσt (x)k2 − μt (x)Vx (t, x)\n2\n\u0001\n1\nR\n= −[rt V (t, x) + Vx (t, x)(−xrt + ηt .σt (x) − ηtR .σt (x)) + ∂x Vx (t, x)kσt (x)k2 ]\n2\n\u0001\n1\n2\n= −∂x (V (t, x)x rt ) + ∂x Vx (t, x)kσ(t, x)k\n2\n\n= μ̃t (V (t, x)) − ηtR .σt (x)Vx (t, x)) + ∂x\n\nSimilarly, the diffusion characteristic of V , γ V is given by\nγ V (t, x)\n\n=\n\nσ̃t (V (t, x)) − Vx (t, x)σt (x)\n\n=\n\nV (t, x)νt (V (t, x)) − ηtR .V (t, x) − Vx (t, x)σt (t, x)\n\n(ii) We recognize that V has the same local characteristics that marginal of consistent utility\n(Theorem 4.1 ). Taking\nthe primitive\nof V , (if that makes sense) we define a random field U (t, x) =\n\u0001\u0011\nRx\nRx \u0010\ndz\nwhich is a progressive utility satisfying the HJB constraint,\nX\n(t,\nz)\nV\n(t,\nz)dz\n=\nY\nt,\nu\nx\n0\n0\nβ U (t, x) = −Ux (t, x)xrt + 12 Uxx (t, x)kσt (t, x)k2 and the diffusion constraint γxU (t, x) = γ V (t, x) =\nUx (t, x)νt (Ux (t, x)) − ηtR .Ux (t, x) − Uxx (t, x)xκ(t, x). So, U is a consistent dynamic utility.\n\nCorollary 4.4. With the same notations as in Theorem 4.7, assume in addition global Lipschitz\n3,δ\n2,δ\nregularity on (μ, σ), that is σ ∈ K̃b0,1 ∩ K̃loc\n, ν ∈ K̃b0,1 ∩ K̃loc\nfor δ ∈ (0, 1]. Let us also consider a\nutility function u satisfying Inada's conditions, such that ux ∼ x−ζ (ζ < 1) in the neighborhood of\nz = 0.\n\u0001\u0001\nThe composite random field Yt ux X (t, x) is integrable near to zero and it is the derivative of a\nconsistent stochastic utility U .\n3,δ\n2,δ\nProof. Since σt (x) = xκt (x) ∈ K̃b0,1 ∩ K̃loc\n, νt (y) ∈ K̃b0,1 ∩ K̃loc\nfor δ ∈ (0, 1] one can easily shows\n2,δ \u0001\n2,δ \u0001\n0,1\n3,δ \u0001\n0,1\n3,δ \u0001\n.\n× K̃b0,1 ∩ K̃loc\nthat the pair (μ, σ) belong to Kb ∩Kloc × K̃b ∩ K̃loc and (μ̃, σ̃) to Kb0,1 ∩Kloc\nThen, all assumptions of Theorem 4.7 are satisfied. Moreover, from Theorem 1.2, the unique strong\nmonotonic solutions X and Y satisfy the following asymptotic behavior (equation (1.7))\n\u0010\n\u0010\nZ(t, z) \u0011\nZ(t, z) \u0011\nsup\nlim\nsup\n=\n0\nand\nlim\n= +∞, for all T\nz→0 0≤t≤T\nz→0 0≤t≤T z 1+ε\nzε\n\nConsequently, one can easily shows that, for any utility function u satisfying Inada's conditions\n\u0001\u0001\ns.t. ux (x) < x−ζ for some ζ < 1, the composite random field Yt ux X (t, x) is also integrable\nnear to zero. Indeed, it suffices to write that for any α, β, γ > 0 we have\n\u0001\u0001\n\u0001\nlim xα Yt ux X (t, x)\n= lim (Xt (x))α Yt ux (x) = lim (Xt (−ũy (y)))α Yt (y)\nx→0\n\ny→+∞\n\nx→0\n\nYt (y)\nXt (−ũy (y)) α\n) (−ũy (y)y γ )αβ αβγ\n=\nlim (\ny→+∞ (−ũy (y))β\ny\n1\n\n′\n\nAs ux (x) ∼ x−ζ , we have limx→0 xγ ux (x) = limy→+∞ −y γ ′ ũy (y) = 0 for any ζ < γ ′ < 1. Taking\nγ = γ1′ > 1, ε > 0 and β = 1 + ε we deduce, from the asymptotic behavior of X ∗ and Y ∗ and\nInada's conditions, that\n\u0001\u0001\nXt (−ũy (y)) α\nYt (y)\n1\nlim xα Yt ux X (t, x) = lim (\n) (−ũy (y)y γ )αβ αβγ = 0, ∀α ∈ (0,\n) ⊂ (0, 1),\ny→+∞ (−ũy (y))β\nx→0\ny\nβγ\n\u0001\u0001\nwhich shows the integrability near to zero of Yt ux X (t, x) .\n\n30\n\n\fRisk tolerance dynamics With the utility characterization given in Theorem 4.7 the study\nof the risk tolerance coefficient, taken along the optimal wealth, is greatly simplified. In particular,\nthe martingale property established in He and Huang in [10] in a complete market, Y ∗ = yY 0 is\neasy to understand. A similar study has been performed by Zariphopoulou & Zhou [39] in the\nspecial case of dynamic utility deduced by change of numeraire (see next section) and stochastic\nenvironment from a deterministic time depending utility function.\nProposition 4.5. Assume the optimal state density process to be the minimal one Y ∗ (., y) = yY.0 ,\nor equivalently the orthogonal risk premium to be 0. Let U be a consistent dynamic utility with\noptimal regular wealth X ∗ with derivative Xx∗ .\nx (t,x)\n(i) The path of the risk tolerance coefficient τ U (t, x) = − UUxx\n(t,x) at benchmark optimal wealth is\ngiven by τ U (t, Xt∗ (x)) := τ ∗ (t, x) = τ u (x)Xx∗ (t, x).\n(ii) τ U (t, Xt∗ (x)) = τ ∗ (t, x) is an admissible portfolio with initial wealth τ u (x) and admissible\nallocation κdt = κ∗t (Xt∗ ) + Xt∗ κ∗x (t, Xt∗ ). In particular, Yt0 τ ∗ (t, x) is a local martingale.\n(iii) As in [39], the pair (X ∗ , τ ∗ ) is solution of two dimensional SDE with random coefficients.\n\u0001\u0001\nProof. (i) We start with the representation of the marginal utility as Ux (t, x) = Yt0 ux X (t, x) ,\n\u0001\n\u0001\n\u0001\nand of its derivative Uxx (t, x) = Yt0 uxx X (t, x) ∂x X (t, x) = Yt0 uxx X (t, x) /Xx∗ (t, X (t, x)). By\ntaking the ratio of these two quantities, we have that\nτ U (t, x) = τ u (X (t, x))Xx∗ (t, X (t, x))\n\nor equivalently\n\nτ U (t, Xt∗ (x)) = τ u (x)Xx∗ (t, x)\n\n(ii) This last characterization is interesting since from Equation (2.4)\n\u0003\n\u0002\ndXx∗ (t, x) = Xx∗ (t, x) rt dt + σx∗ (t, Xt∗ ).(dWt + ηtR dt)\n\n(4.7)\n\nAs in the proof of Theorem 4.1, assertion i), since R is a vector space, Xx∗ (t, x) is still an admissible\nportfolio with allocation policy κdt = σx∗ (t, Xt∗ ) = κ∗t (Xt∗ ) + Xt∗ κ∗x (t, Xt∗ ).\n(iii) The pairs of processes (X ∗ (t, x), Xx∗ (t, x)), and (X ∗ (t, x), τ ∗ (t, x)) are solutions of the same\n2-dimensional SDE.\nAll results of the proposition can be extended to the general case, where Yt∗ (y) is no more a linear\nfunction of y, but the interpretation of the results is more difficult.\n2,δ\nProposition 4.6. Let U be a Kloc\n∩ C 3 -consistent dynamic utility (δ > 0), then\n(i) The risk tolerance coefficient τ U is given by\n\nτ U (t, x) =\n\n\u0010\nYt∗ (ux (X )Xx∗ (t, X ) \u0011\nYt∗ (ux (X ))Xx∗ (t, X )\nu\n(t, x).\n=\nτ\n(X\n)\nuxx (X )Yx∗ (t, ux (X ))\nux (X )Yy∗ (t, ux (X ))\nY ∗ (u (x))\n\n(4.8)\n\nx\nand, along the optimal wealth, τ U (t, Xt∗ (x)) = Y ∗ (t,ut x (x))u\nXx∗ (t, x).\nxx (x)\ny\n(ii) The derivative of the optimal wealth is an admissible portfolio associated with the allocation\nκdt = κ∗t (Xt∗ ) + Xt∗ κ∗x (t, Xt∗ ) and initial wealth 1.\n(iii) The process Yy∗ (t, y)τ U (t, Xt∗ (x)) is a local martingale.\n\nThe proof of this proposition is obvious.\n\n31\n\n\fPathwise dynamic programming principle In this paragraph we are interested in using\nthe previous marginal utility characterization from a backward point of view. Unlike the standard\ncase, we obtain a pathwise dynamic programming principle.\n\u0001\nFor this, observe that the identity Ux (t, x) = Yt∗ ux (X (t, x)) leads to the following identity based\n\u0001\non the inverse flow Y of Y ∗ , ux (x) = Yt (Ux (t, Xt∗ (x)) . This explains how to recover the marginal\nutility at time 0 from the stochastic terminal one at a time t. This point of view is interesting,\nbecause in this case the initial condition ux is simply the derivative of the value function of\na classical optimization problem. To go further into this idea, properties of stochastic flows,\npreviously not used (as explained above), will be essential.\nFlow property.\n(i) Let (Zt (x)) be a strictly monotonic random field with respect to x with range [0, ∞) whose\nthe inverse random field is denoted by Zt (z). We extend the random field Z to intermediate dates\n(0 ≤ s ≤ t) by defining Zt (s, x) = Zt (Zs (x)). The following classical notation Zt (s, x) := Zs,t (x) is\nuseful to express the semi-group property, that is for s ≤ t ≤ u, Zt,t (x) = x and Zt,u ◦ Zs,t = Zs,u .\nNote that Zt (x) = Z0,t (x).\nSimilarly, we can extended the random field Z to intermediate dates by taking the inverse of\n(Zt (s, x)) such that Zt (s, z) = Zs (Zt (z)) := Zs,t (z). Then Zt (s, z) = Zs,t (z) is a backward flow\nachieving the amount z at date s. Then, the semi-group property holds true with the inverse order\nof the dates, that is for s ≤ t ≤ u, Zs,t ◦ Zt,u = Zs ◦ Zt ◦ Zt ◦ Zu = Zs,u .\n(ii) When the flow Zt (x) is the monotonic solution of some SDE(μ, σ) starting from x at time\n0, a classical result states that Zs,t (x) is a solution defined on [s, ∞) of the same SDE(μ, σ) starting\nfrom x at time s. When the SDE(μ, σ) is regular enough so that Zt (z) is the monotonic solution\nof the SPDE(μ, σ), then Zs,t (z) is solution on [s, ∞) of the same SPDE with initial condition z at\ntime s. Given that Zs,t (z) = Zs (Zt (z)), this result may be viewed as a consequence of Theorem\n2.7 (i), applied to the regular function G(y) = Zs (y) considered as deterministic after the time s.\nBut, it is more natural to consider Zs,t (z) as a process in s and so to introduce, time reversal and\nbackward integration as in Kunita [19] Section 4.5, or Carmona & Nualart [2]. We do not develop\nthis point of view here.\nLet us come back to consistent utility framework.\nProposition 4.7. We adopt the same framework as in Theorem with the monotonic solutions X\nand Y of two SDE(μ, σ) and SDE(μ̃, σ̃). As usual the inverse processes are denoted by X and Y.\n\u0001\nThe marginal utility is defined as Ux (t, x) = Yt ux (Xt (x)) .\n\u0001\n(i) For any t, the pathwise identity holds true, ux (x) = Yt Ux (t, Xt (x)) . This property is close\nto the following one, also true on the classical backward point of view,\n\u0001\n\u0001\n(4.9)\nux (x) = Yt Ux (t, Xt (x)) , ux (x) = E Ux (t, X(t, x))Xx (t, x)\n\ny\nx\nz\nu\n(ii) More generally, using the stochastic flows Xs,t\n, Ys,t\n, Xs,t\n, Ys,t\n, we have the pathwise dynamic\nprinciple\n\u0001\n\u0001\n(4.10)\nUx (t, x) = Ys,t Ux (s, Xs,t (x)) , Ux (s, x) = Ys,t Ux (t, Xs,t (x)) ,\n\nProof. The both identities are easily deduced from the identity\n\nux (Xt (x)) = Yt (Ux (t, x)) = ux (Xs (Xt,s (x)) = Ys (Ux (s, Xt,s (x))).\n\n32\n\n\fComment The link between HJB SPDE and the inverse flows of some SDEs has received little\nattention in the literature to our knowledge, may be essentially because people are more interested\nby the Markovian case.\n\n5\n\nOpenness to other topics and works\n\nWe close the paper by some openness to other topics and works; we show the stability of the\nnotion of consistent utility by change of numeraire and then, without loss of generality, we can\nconsider the martingale market where the portfolios are simple local martingales and the stochastic\nPDE's are easier to deal with. We also apply our method to the specific example of decreasing\nconsistent utilities (see [1] and [28]) where the volatility vector γ is given equal to zero, given a\nnew interpretation of the optimal wealth as solution of inf-convolution problems in random power\nutilities.\n\n5.1\n\nChange of numeraire\n\nNotations about the investment universe are the same as in Section 3. A numeraire is a monetary\nreference used as payment instrument. When transactions take place in a given country, the domestic currency is used as numeraire, but in an international setting, a common numeraire is used\nin general for all the transactions. Because an investor is often faced with investing in different\nmarkets, we are concerned in this paragraph, by the impact of the change of numeraire on its\nprogressive utility random field.\nIt is well-known (see Geman, El Karoui, and Rochet [9]) that the self-financing property is invariant by change of numeraire. So, if N is an Itô positive continuous semimartingale, solution\nof linear equation with coefficients (μN x, δ N x), it is well-known (see also Platen and Heath, or\nKaratzas and Kardaras, [9, 31, 15]) that using N as new numeraire transforms an Itô market with\nrisk premium η R and short rate rt into an investment universe, where the admissible portfolios\nb κ̂ = X κ /N and the state price density processes are the processes Yb ν = N.Y ν .\nare the processes X\nThe parameters of this new market are η̂ = η R − δ N , for the risk premium and r̂ = r − μN + δ N .η R\nfor the short rate.\n(i) By the previous results, any X -consistent dynamic utility U defines a X N -consistent dynamic\ne N is given by\nutility U N by the transformation U N (t, x̂) = U (t, x̂Nt ). Then the conjugate U\ne N (ŷ) = U\ne (t, ŷ/Nt ).\nU\n(ii) The class X N of the admissible portfolios is characterized by the processes κ̂ = κ − δ N . The\nb t = Rt −δ N . Nevertheless if δ N ∈ Rt ,\nvector spaces (Rt ; t ≥ 0) are transformed into affine spaces R\nt\nt\nb t in the new market are the same than the constraint spaces\nfor any time t, the constraint spaces R\nRt in the initial market.\n(iii) The associated optimal portfolio is X N,∗ = X ∗ /N and the optimal state price density process\nis Y N,∗ = Y ∗ /N .\n(iv) The diffusion characteristic γ N (t, x̂) is obtained from Itô-Ventzel's formula, γ N (t, x̂) = γ(t, x̂.Nt )+\nx̂Ux̂N (t, x̂)δtN . The new drift β N (t, x̂) is more complicated to described, and the explicit form is\n\n33\n\n\fnot of great interest in the general case.\n(v) In the usual case, the market numeraire (Y 0 )−1 = M (also called numeraire portfolio, or\ngrowth optimal portfolio as in Platen and Heath [31]) is chosen as numeraire Y 0 . Since M is an\nadmissible portfolio with volatility η R , the market parameters η̂ and r̂ are identically zero, and\nany admissible portfolio and any admissible state price density is a local martingale (under the\nhistorical probability).\nThe optimal policies are simply given by\nx̂κ̂∗t (x̂)\n\nγ M,R (t, x̂)\n= x̂ M\n,\nUx̂x̂ (t, x̂)\n\nŷ ν̂t∗ (ŷ)\n\nγ̃ŷM,⊥ (t, ŷ)\n=\ne M (t, ŷ)\nU\nŷ ŷ\n\ne M (t, ŷ) are given by,\nwhile, the drift characteristics of the utility U M (t, x̂) and U\n\n1 M\n1\nβ M (t, x̂) = − Ux̂x̂\n(t, x̂)kx̂κt∗,M (x̂)k2 , β̃ M (t, ŷ) = − ŨŷMŷ (t, ŷ)kŷνt∗,N (ŷ)k2 ,\n2\n2\n\ne M is a submartingale. Moreover, if γ M ∈ R the\nConsequently, U M is a supermartingale and U\nx̂\ne M is a local martingale and the optimal dual process is constant, Y M,∗ ≡ 1.\nconjugate utility U\nBy symmetry, if γx̂M ∈ R⊥ , U M (., x̂) is a local martingale for any x̂, and the optimal wealth\nXtM,∗ (x̂) ≡ x̂.\n\n5.2\n\nDecreasing Consistent Utilities\n\nIn this section, all prices of the investment universe are assumed to be discounted, corresponding\nto the case where r ≡ 0. An interesting class of consistent utilities is the class of decreasing\nconsistent utilities, which was studied and fully characterized in the literature by Musiela & al.\n[28] and Berrier & al. [1]. This utilities have a volatility characteristic γ identically zero. It is an\nexample where the dual SPDE is easier to study than the primal one, since by taking γ = 0, it\ne are solutions of the following SPDEs\nfollows from Theorem 3.2 (3.6), that U and U\ndU (t, x) =\n\n1 Ux (t, x)2 R 2\n||η || dt,\n2 Uxx (t, x) t\n\ne (t, y) = − 1 y 2 U\neyy (t, y)||η R ||2 dt.\ndU\nt\n2\n\n(5.1)\n\ne (t, y) are decreasing functions.\nwhich implies by convexity, that t 7→ U (t, .), U\n\nExample of power utilities (i) It is easy to verify that the power dual utility functions\ne θ (t, y) = 1 (1 − C̃tθ y 1−θ ), (θ > 0), where as usual the parameter θ is the risk tolerance\nU\n1−θ\ncoefficient, are 5.1, if and only if C̃tθ (ω) is solution of the ordinary equation dC̃tθ (ω) = −C̃tθ (ω)θ(1−\nθ)||ηtσ (ω)||2 dt. In other words,\nZ t\ne θ (t, y) = 1 (1 − C̃ θ y 1−θ ), C̃ θ = exp(−ǫ̃(θ)Aη ), with Aη =\n||ηsR ||2 ds, ǫ̃(θ) = (1 − θ)θ > 0.\nU\nt\nt\nt\nt\n1−θ\n0\n1−θ\n\ne θ (t, yYt0 ) − 1 = − y (Yt0 )1−θ C̃tθ is a martingale, since yYt0 is the optimal state price\nThen, U\n1−θ\n1−θ\ndensity.\neyθ (t, y) = −C̃tθ y −θ\n(ii) Let us observe that at any time t > 0 the marginal conjugate utility U\nis no longer a monotonic function of the risk tolerance coefficient θ since the function θ 7→\nǫ̃(θ)Aηt + θ ln(y) is no monotonic.\n\n34\n\n\f(iii) The marginal power utility Uxθ (t, x) is given by Uxθ (t, x) = (C̃tθ )1/θ x−1/θ . Since (Yt0 )1−θ C̃tθ\nis a local martingale, the process Xt∗,θ (x) = xC̃tθ (Yt0 )−θ is an admissible portfolio, and it is\nθ\neasy to see that it is the optimal one. Using the notation X t = Xt∗,θ (1) = C̃tθ (Yt0 )−θ , we have\nθ\nXt∗,θ (x) = xX t .\n(iv) As in the deterministic case, the optimal strategy κ∗,θ (t, x) is collinear to the risk premium\nηtR with factor θ, κ∗,θ (t, x) = θηtR . Then, we recover the characterization of the marginal utility\ne θ (t, yY 0 ) = −C̃ θ y −θ (Y 0 )−θ = ũθ X θ .\nat the optimal state price density yYt0 as U\ny\nt\nt\nt\ny t\n\nCharacterization of decreasing conjugate utilities (i) The set of positive solutions Ue\n\nto the dual linear PDE 5.1 is a convex cone, stable by positive linear combination. From this, it\nis natural to consider the integral of conjugate power utilities, with respect to some positive Borel\nmeasure m, including the initial condition. The avoid the problem related to the constants, we\nR\nformulate the problem on the marginal conjugate utilities and assume that R∗ y −θ dm(θ) < ∞,\n+\nto define the new conjugate marginal utility\nZ\nZ\nθ\nθ\nm\nm\ne\ne\ny −θ dm(θ)\n(5.2)\nUy (t, y)C̃t dm(θ), ũy (y) = −\nUy (t, y) =\nR∗\n+\n\nR∗\n+\n\nSuch assumption on the initial condition ũy (y) (then denoted ũm\ny (y)) is equivalent to say that\nm z\nũy (e ) is a completely monotonic function. All conjugate utility functions ũ(y) do not verify this\ncondition, but if it the case and if m is compactly supported, it is easy to check that any primie m (t, y) verifies the random PDE (5.1), since the property is true for the power conjuguate\ntive U\neyθ (t, y) using Dirac measure at θ as shown in page 34. In other words, U\ne m (t, y)(ω)\nfunctions U\nis a space-time harmonic function of a geometrical Brownian motion with variance At (ω). By a\ngeneralization of Widder's Theorem [38], Musiela & al. [28] and Berrier & al. [1] showed that\nthere is no other solution to the random PDE (5.1).\n\nSup-convolution interpretation (i) There is an interesting interpretation of these stochastic utilities: one can imagine an investor starting with power utility, with some ambiguity on its\nrisk tolerance coefficient. At time 0, she starts with a mixture of marginal conjugate power utilities,\nweighted by some measure m. At time t, the marginal conjugate consistent utility is still a mixture\nof power conjugate utilities with respect to the measure mt (dθ) := C̃tθ dm(θ), with decreasing in\ntime random density C̃tθ . The stochastic measure mt (dθ) is the unique measure which ensure that\ne m constructed in equation (5.2) is the derivative of the conjugate of a consistent\nthe process U\ny\nutility.\ne m (t, yY 0 ) along\n(ii) Optimal wealth The characterization of the marginal conjugate utility U\nt\ny\neym (t, yYt0 ) = Xt∗,m (−ũm\nthe optimal density process yYt0 as U\ny (y)) is useful to characterize the\noptimal wealth Xt∗,m (x), since the same property is true for the standard power utility functions,\nZ\nZ\nZ\nθ\n∗,θ\n∗,m\nθ\nm\nθ\n0\ne\nXt (−ũy (y))dmt (θ) =\nXt (−ũy (y)) =\nUy (t, yYt )dmt (θ) =\nX t y −θ dmt (θ),\nR∗\n+\n\nR∗\n+\n\nR∗\n+\n\nTo give a decomposition directly in terms of x, we start with a family of well-chosen initial wealths\nR\nm\nxθ,m (x))dm(θ) = −ũm\nxθ,m satisfying xθ,m (x) = −ũθy (um\ny (ux (x)) = x. So, the\nx (x)) so that R∗\n+\nm\noptimal wealth process Xt∗,m issued from x = −ũm\ny (ux (x)) is given by the closed formula\nZ ∞\nZ ∞\nZ ∞\nθ\n∗,θ θ\n∗,m\nθ\nx (x)X t mt (dθ), with\nXt (x (x))mt (dθ) =\nXt (x) =\nxθ (x)m(dθ) = x. (5.3)\n0\n\n0\n\n0\n\n35\n\n\fXt∗,m (x) is strictly increasing and regular with respect to its initial condition x, since any function\netm (y), U m (t, x) is a consistent utility with\nxθ,m (x) is monotonic and regular. The conjuguate of U\n∗,m\noptimal wealth Xt (x).\n(iii) The risk tolerance coefficient We are concerned with the risk tolerance coefficient\nU m (x)\nτUm (t, x) = − xm\nof the utility function U m (t, x), given that for power utility τ θ (t, x) = θx.\nUxx (x)\nAccording to assertion (i) of Proposition 4.5 stating that τUm (t, Xt∗,m (x)) = τum (x)Xx∗,m (t, x), we\nsee that\nZ ∞\n∗,m\nm\nm\n∗,m\nτU (t, Xt (x)) = τu (x)Xx (t, x) =\nτum (x)xθx (x)Xx∗,θ (t, xθ (x))mt (dθ)\n0\n\nθ\nm\nOn the other hand, by the fact that xθx (x) = −um\nxx (x)ũyy (ux (x)), we easily get the equality\nτ θ (xθ (x)) = xθx (x)τ U (x), and so and hence,\nZ ∞\nτUm (t, Xt∗,m (x)) =\nτ θ (t, Xt∗,θ (xθ (x)))mt (dθ)\n(5.4)\n0\n\nWe still have some mixture properties along the optimal processes.\n(iv) Sup-convolution interpretation Classical result in convex analysis shows the link\nbetween mixture of conjuguate utility functions and inf-convolution problem, in the following form:\nassume that the derivative of some conjuguate utility function ũm\ny (y) may be represented as the\nθ\nintegral of some family of marginal conjuguate utility functions ũy (y), with respect to some positive\nR∞ θ\nm\nBorel measure m, ũm\nis the\ny (y) = 0 ũy (y)m(dθ), where the integral is finite for any y. Then, ũ\nconvex conjuguate of the sup-convolution problem associated with\nZ ∞\nnZ ∞\no\nm\nθ\nu (x) = sup\nu (xθ )m(dθ) (xθ ) such that\nxθ m(dθ) = x\n(5.5)\n0\n\nThe optimal solution (x∗θ ) that achieves\nexplicitly as xθ,m (x) = ũθy (−um\nx (x)).\n\n0\n\nthe maximum in the optimization problem 5.5 is given\n\nCome back to our problem of decreasing consistent utility random field. The strategy associated\nwith the initial condition xθ,m (x) may be interpreted as the deterministic optimal allocations of the\ninitial wealth with respect to the parameter θ, in a Pareto optimal equilibrium where a continuum\nof agents with different risk aversion are in competition. The same interpretation holds true at\ntime t, with the family of wealth Xt∗,θ (xθ (x)) and the random measure mt (dθ).\nMoreover, the decreasing consistent utility random field is given at any time t as,\nZ ∞\nnZ ∞\no\nm\nθ\nU (t, x) = sup\nU (t, Xθ (t, x))mt (dθ) (Xθ (t, x)) such that\nXθ (t, x)mt (dθ) = x (5.6)\n0\n\n0\n\n(v)The role of the initial utility function In the study of decreasing utilities, we introduced\nR\ny −θ dm(θ). The Borel measure m is\nan assumption on the initial condition, that is ũm\ny (y) = − R∗\n+\ndetermining in the definition of the optimal wealth. This may seem at odds with the rest of the\npaper. This is not the case and even this is a nice example to illustrate our results.\nIndeed, starting from the optimal portfolio X ∗,m defining in Equation (5.3), it is easy to construct a new consistent utility (more easily its Fenchel conjuguate Ṽ (t, y)) having (X ∗,m , yY 0 ) as\noptimal processes, starting from an initial concave function v with Fenchel conjuguate ṽ. Thanks\n\n36\n\n\fto the dual characterization Veym (t, yYt0 ) = Xt∗,m (−ṽy (y)) of the marginal conjuguate utility, the\neym yields to the following relation Veym (t, yYt0 ) = Xt∗,m (−ṽy (y)) =\nsame identity applied to U\n\u0001\ne m t, um (−ṽy (y))Y 0 . It remains to make the change of variable y 7→ y/Y 0 , to obtain the\nU\nt\nx\nt\ny\nmarginal dual conjuguate\n\u0001\ne m t, um (−ṽy (y/Y 0 ))Y 0 .\nVeym (t, y) = Xt∗,m (−ṽy (y/Yt0 )) = U\nx\nt\nt\ny\n\nObviously, by this transformation we lose the decreasing property in time of Veym (t, y) since\n0\n0\num\nx (−ṽy (y/Yt ))Yt is no more a decreasing process. The same kind of construction may be made\nwhen the optimal dual process yYt0 is replaced by a monotonic one.\nNote, similar ideas are developed in [5] to build richer classes of utilities.\n\nConclusion In this new approach, the solution of the utility SPDE have a pathwise representation, unlike to the characteristics method where the solutions are represented as a conditional\nexpectation. There are several advantages of this connection between SPDEs and SDEs due to the\nmany results of the SDE theory. To the best of our knowledge, there are no or few results that\nassert the monotonicity or the convexity of such solutions. Also, there may be other advantages\nin numerical methods and simulations of the SDE than of SPDE.\nOtherwise, this paper investigates consistent stochastic utilities from the SPDE point of view.\nThis leads therefore to make strong regularity assumptions: the market is a Brownian market\nand securities are modeled as continuous semimartingales. Utilities are at least of class K2 in the\nsense of Kunita in order to apply Itô-Ventzel's formula and to deduce the SPDEs. Moreover, the\nmethod of stochastic utilities construction is based on the dynamics of stochastic flows and their\ninverses, and therefore additional regularity assumptions on X ∗ and Y ∗ are required. However,\none can take a direct approach still based on monotonicity assumptions on optimal processes for\nthe primal and dual problem, and on compound flows formula ; it is showed in [6], that these\nassumptions can be considerably weakened. Indeed, considering any financial market in which\nthe securities are modeled as bounded semimartingales, the stochastic utilities are of class K1 and\nwealth process are required to lie in a convex class X ⊂ X+ , the monotonicity assumption of X ∗\nand Y ∗ is sufficient to show the validity of the construction proposed in this work, using analysis\nmethods and optimality conditions.\n\nReferences\n[1] F. Berrier, C. Rogers, and M. Tehranchi. A characterization of forward utility functions.\nPreprint, 2009.\n[2] R.A. Carmona and D. Nualart. Nonlinear stochastic integrators, equations and flows, volume 6\nof Stochastics Monographs. Gordon and Breach Science Publishers, New York, 1990.\n[3] P. Constantin and G. Iyer. Stochastic lagrangian transport and generalized relative entropies.\nCommun.Math.Sci, 4:767–777, 2006.\n[4] D. Duffie and L. Epstein. Stochastic differential utility. Econometrica, 60(2):353–394, 1992.\nWith an appendix by the authors and C. Skiadas.\n\n37\n\n\f[5] N. El Karoui and M. Mrad. Mixture of consistent stochastic utilities, and a priori randomness.\nPreprint., 2010.\n[6] N. El Karoui and M. Mrad. Stochastic utilities with a given optimal portfolio : approach by\nstochastic flows. Preprint., 2010.\n[7] N. El Karoui, S. Peng, and M.C. Quenez. A dynamic maximum principle for the optimization\nof recursive utilities under constraints. Ann. Appl. Probab., 11(3):664–693, 2001.\n[8] M. Frittelli and M. Maggis. Conditional certainty equivalent. International Journal of Theoretical and Applied Finance (IJTAF), 14(01):41–59, 2011.\n[9] H. Geman, N. El Karoui, and J.C. Rochet. Change of numeraire, change of probability\nmeasure and option pricing. Journal of Applied Probability, 32:443–458, 1995.\n[10] H. He and C. Huang. Consumption-portfolio policies: An inverse optimal problem. Journal\nof Economic Theory, 62(2):257 – 293, 1994.\n[11] V. Henderson and D. Hobson. Horizon-unbiased utility functions. Stochastic Process. Appl.,\n117(11):1621–1641, 2007.\n[12] P. Imkeller, S. Fang, and T. Zhang. Global flows for stochastic differential equations without\nglobal Lipschitz conditions. Ann. Probab., 35(1):180–205, 2007.\n[13] P. Imkeller and M.K. Scheutzow. On the spatial asymptotic behavior of stochastic flows in\nEuclidean space. Ann. Probab., 27:109–129, 1999.\n[14] I. Karatzas and N. Englezos. Utility maximization with habit formation: Dynamic programming and stochastic pdes. SIAM J. Control Optim., 48(2):481–520, 2009.\n[15] I. Karatzas and C. Kardaras. The numéraire portfolio in semimartingale financial models.\nFinance Stoch., 11(4):447–493, 2007.\n[16] I. Karatzas, J.P. Lehoczky, S.E. Shreve, and G.L. Xu. Martingale and duality methods for\nutility maximization in an incomplete market. SIAM J. Control Optim., 29(3):702–730, 1991.\n[17] I. Karatzas and S.E. Shreve. Methods of Mathematical Finance. Springer, September 2001.\n[18] D. Kramkov and W. Schachermayer. The asymptotic elasticity of utility functions and optimal\ninvestment in incomplete markets. Annals of Applied Probability, 9:904–950, 1999.\n[19] H. Kunita. Stochastic flows and stochastic differential equations, volume 24 of Cambridge\nStudies in Advanced Mathematics. Cambridge University Press, 1997.\n[20] Z. Liang. Stochastic differential equations driven by spatial parameters semimartingale with\nnon-lipschitz local characteristic. Potential Analysis, 26:307–322, 2007.\n[21] Z. Liang. Spatial asymptotic behavior of homeomorphic global flows for non-Lipschitz SDEs.\nBull. Sci. Math., 132:146–163, 2008.\n\n38\n\n\f[22] M. Mania and R. Tevzadze. Backward stochastic PDEs related to the utility maximization\nproblem. Georgian Mathematical Journal, 17:705–740, 2010.\n[23] S.E.A. Mohammed and M.K. Scheutzow. Spatial estimates for stochastic flows in Euclidean\nspace. Ann. Probab., 26:56–77, 1998.\n[24] M. Musiela and T. Zariphopoulou. Backward and forward utilities and the associated pricing\nsystems: The case study of the binomial model. pages 3–44. Princeton University Press,\n2005-2009.\n[25] M. Musiela and T. Zariphopoulou. Investment and valuation under backward and forward\ndynamic exponential utilities in a stochastic factor model. In Advances in mathematical\nfinance, pages 303–334. Birkhäuser Boston, 2007.\n[26] M. Musiela and T. Zariphopoulou. Optimal asset allocation under forward exponential performance criteria. volume 4, pages 285–300. Institute of Mathematical Statistics, 2008.\n[27] M. Musiela and T. Zariphopoulou. Portfolio choice under dynamic investment performance\ncriteria. Quantitative Finance, 9(2):161–170, 2009.\n[28] M. Musiela and T. Zariphopoulou. Portfolio choice under space-time monotone performance\ncriteria. SIAM J. Financial Math., 1:326–365, 2010.\n[29] M. Musiela and T. Zariphopoulou. Stochastic partial differential equations in portfolio choice.\nIn Contemporary Quantitative Finance, pages 195–3216, 2010.\n[30] H. Pham. Optimisation et contrôle stochastique appliqués à la finance, volume 61 of Mathématiques & Applications (Berlin). Springer, Berlin, 2007.\n[31] E. Platen and D. Heath. A benchmark approach to quantitative finance. Springer Finance.\nSpringer-Verlag, Berlin, 2006.\n[32] P. Protter. Stochastic integration and differential equations, volume 21 of Stochastic Modelling\nand Applied Probability. Springer-Verlag, Berlin, 2005.\n[33] R. Rouge and N.El Karoui. Pricing via utility maximization and entropy. Math. Finance,\n10(2):259–276, 2000. INFORMS Applied Probability Conference (Ulm, 1999).\n[34] W. Schachermayer. Optimal investment in incomplete financial markets. In Mathematical\nFinance: Bachelier Congress 2000, pages 427–462. Springer, 2001.\n[35] M.K. Scheutzow. Chaining techniques and their application to stochastic flows. In London Mathematical Society Lecture Note Series (No. 353), pages 35–64. Cambridge University\nPress, 2009.\n[36] C. Stricker, T. Choulli, and J. Li. Minimal Hellinger martingale measures of order q. Finance\nStoch., 11(3):399–427, 2007.\n\n39\n\n\f[37] A.D. Ventzel. On equations of the theory of conditional Markov. Theory of Probability and\nits Applications, 10:357–361, 1965.\n[38] D. Widder. The heat equation. Academic Press Inc., U.S., 1976.\n[39] T. Zariphopoulou and T. Zhou. Investment performance measurement under asymptotically linear local risk tolerance. In Handbook of numerical analysis. Vol XV, pages 227–253.\nElsevier/North-Holland, 2009.\n[40] X. Zhang. Stochastic flows of sdes with irregular coefficients and stochastic transport equations. Bulletin des Sciences MathÃ c matiques, 134(4):340 – 378, 2010.\n[41] G. Zitkovic. A dual characterization of self-generation and log-affine forward performances.\nPreprint, 2008.\n\n40\n\n\f"}