{"id": "http://arxiv.org/abs/1005.2158v1", "guidislink": true, "updated": "2010-05-12T17:08:18Z", "updated_parsed": [2010, 5, 12, 17, 8, 18, 2, 132, 0], "published": "2010-05-12T17:08:18Z", "published_parsed": [2010, 5, 12, 17, 8, 18, 2, 132, 0], "title": "Dipole strength in 144Sm studied via (gamma,n), (gamma,p) and\n  (gamma,alpha) reactions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.4787%2C1005.3751%2C1005.4731%2C1005.1742%2C1005.1537%2C1005.2248%2C1005.3195%2C1005.5339%2C1005.5534%2C1005.2158%2C1005.0497%2C1005.4575%2C1005.1484%2C1005.4313%2C1005.2064%2C1005.4429%2C1005.0087%2C1005.4046%2C1005.4521%2C1005.0659%2C1005.5678%2C1005.3560%2C1005.4832%2C1005.0804%2C1005.2327%2C1005.2029%2C1005.2773%2C1005.2718%2C1005.2528%2C1005.3694%2C1005.0515%2C1005.2799%2C1005.0756%2C1005.0746%2C1005.4766%2C1005.4853%2C1005.0352%2C1005.1757%2C1005.4797%2C1005.0122%2C1005.3932%2C1005.2245%2C1005.0163%2C1005.3557%2C1005.0295%2C1005.3744%2C1005.0955%2C1005.2242%2C1005.5289%2C1005.4613%2C1005.3121%2C1005.1913%2C1005.3207%2C1005.1348%2C1005.0211%2C1005.5253%2C1005.0054%2C1005.1798%2C1005.1127%2C1005.4697%2C1005.5500%2C1005.2490%2C1005.3344%2C1005.0366%2C1005.5669%2C1005.3978%2C1005.4516%2C1005.1204%2C1005.5607%2C1005.3629%2C1005.4928%2C1005.3135%2C1005.2926%2C1005.4133%2C1005.4942%2C1005.5225%2C1005.3729%2C1005.3174%2C1005.2911%2C1005.4191%2C1005.4965%2C1005.4612%2C1005.0202%2C1005.0966%2C1005.4304%2C1005.3869%2C1005.4659%2C1005.5306%2C1005.0608%2C1005.4465%2C1005.5059%2C1005.2509%2C1005.4738%2C1005.1154%2C1005.4260%2C1005.3804%2C1005.4301%2C1005.1233%2C1005.4262%2C1005.0386%2C1005.5735&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dipole strength in 144Sm studied via (gamma,n), (gamma,p) and\n  (gamma,alpha) reactions"}, "summary": "Photoactivation measurements on 144Sm have been performed with bremsstrahlung\nendpoint energies from 10.0 to 15.5 MeV at the bremsstrahlung facility of the\nsuperconducting electron accelerator ELBE of Forschungszentrum\nDresden-Rossendorf. The measured activation yield for the 144Sm(gamma,n)\nreaction is compared with the calculated yield using cross sections from\nprevious photoneutron experiments. The activation yields measured for all\ndisintegration channels 144Sm(gamma,n), (gamma,p) and (gamma,alpha) are\ncompared to the yield calculated by using Hauser-Feshbach statistical models. A\nnew parametrization of the photon strength function is presented and the yield\nsimulated by using the modified photon strength parameters are compared to the\nexperimental data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.4787%2C1005.3751%2C1005.4731%2C1005.1742%2C1005.1537%2C1005.2248%2C1005.3195%2C1005.5339%2C1005.5534%2C1005.2158%2C1005.0497%2C1005.4575%2C1005.1484%2C1005.4313%2C1005.2064%2C1005.4429%2C1005.0087%2C1005.4046%2C1005.4521%2C1005.0659%2C1005.5678%2C1005.3560%2C1005.4832%2C1005.0804%2C1005.2327%2C1005.2029%2C1005.2773%2C1005.2718%2C1005.2528%2C1005.3694%2C1005.0515%2C1005.2799%2C1005.0756%2C1005.0746%2C1005.4766%2C1005.4853%2C1005.0352%2C1005.1757%2C1005.4797%2C1005.0122%2C1005.3932%2C1005.2245%2C1005.0163%2C1005.3557%2C1005.0295%2C1005.3744%2C1005.0955%2C1005.2242%2C1005.5289%2C1005.4613%2C1005.3121%2C1005.1913%2C1005.3207%2C1005.1348%2C1005.0211%2C1005.5253%2C1005.0054%2C1005.1798%2C1005.1127%2C1005.4697%2C1005.5500%2C1005.2490%2C1005.3344%2C1005.0366%2C1005.5669%2C1005.3978%2C1005.4516%2C1005.1204%2C1005.5607%2C1005.3629%2C1005.4928%2C1005.3135%2C1005.2926%2C1005.4133%2C1005.4942%2C1005.5225%2C1005.3729%2C1005.3174%2C1005.2911%2C1005.4191%2C1005.4965%2C1005.4612%2C1005.0202%2C1005.0966%2C1005.4304%2C1005.3869%2C1005.4659%2C1005.5306%2C1005.0608%2C1005.4465%2C1005.5059%2C1005.2509%2C1005.4738%2C1005.1154%2C1005.4260%2C1005.3804%2C1005.4301%2C1005.1233%2C1005.4262%2C1005.0386%2C1005.5735&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Photoactivation measurements on 144Sm have been performed with bremsstrahlung\nendpoint energies from 10.0 to 15.5 MeV at the bremsstrahlung facility of the\nsuperconducting electron accelerator ELBE of Forschungszentrum\nDresden-Rossendorf. The measured activation yield for the 144Sm(gamma,n)\nreaction is compared with the calculated yield using cross sections from\nprevious photoneutron experiments. The activation yields measured for all\ndisintegration channels 144Sm(gamma,n), (gamma,p) and (gamma,alpha) are\ncompared to the yield calculated by using Hauser-Feshbach statistical models. A\nnew parametrization of the photon strength function is presented and the yield\nsimulated by using the modified photon strength parameters are compared to the\nexperimental data."}, "authors": ["Chithra Nair", "Arnd R. Junghans", "Martin Erhard", "Daniel Bemmerer", "Roland Beyer", "Eckart Grosse", "Krasimir Kosev", "Michele Marta", "Gencho Rusev", "Klaus-Dieter Schilling", "Ronald Schwengner", "Andreas Wagner"], "author_detail": {"name": "Andreas Wagner"}, "author": "Andreas Wagner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.81.055806", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.2158v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.2158v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Phys Rev C, Accepted for publication", "arxiv_primary_category": {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.2158v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.2158v1", "journal_reference": "Phys.Rev.C81:055806,2010", "doi": "10.1103/PhysRevC.81.055806", "fulltext": "Dipole strength in\n\n144\n\nSm studied via (γ,n), (γ,p) and (γ, α) reactions\n\nC. Nair,1, ∗ A. R. Junghans,1 M. Erhard,1, † D. Bemmerer,1 R. Beyer,1 E. Grosse,1, 2 K.\nKosev,1 M. Marta,1 G. Rusev,1, ‡ K. D. Schilling,1 R. Schwengner,1 and A. Wagner1\n\narXiv:1005.2158v1 [nucl-ex] 12 May 2010\n\n2\n\n1\nInstitut für Strahlenphysik, Forschungszentrum Dresden-Rossendorf, D-01314 Dresden, Germany\nInstitut für Kern- und Teilchenphysik, Technische Universität Dresden, D-01062 Dresden, Germany\n(Dated: November 17, 2018)\n\nPhotoactivation measurements on 144 Sm have been performed with bremsstrahlung endpoint energies from 10.0 to 15.5 MeV at the bremsstrahlung facility of the superconducting electron accelerator\nELBE of Forschungszentrum Dresden-Rossendorf. The measured activation yield for the 144 Sm(γ,n)\nreaction is compared with the calculated yield using cross sections from previous photoneutron experiments. The activation yields measured for all disintegration channels 144 Sm(γ, n), (γ, p) and\n(γ, α) are compared to the yield calculated by using Hauser-Feshbach statistical models. A new\nparametrization of the photon strength function is presented and the yield simulated by using the\nmodified photon strength parameters are compared to the experimental data.\nPACS numbers: 25.20.-x, 25.20.Dc, 26.30.-k\n\nI.\n\nINTRODUCTION\n\nThe nuclei heavier than iron (Z > 26) are synthesized\nmainly by neutron-capture reactions- the astrophysical\nr- and s-processes. There are about 35 neutron deficient\nstable isotopes between Se and Hg that are shielded from\nthe rapid neutron capture by stable isobars. These nuclei, classically referred to as the p-nuclei, are produced\nvia chains of photodisintegrations such as (γ, n) (γ, p)\nand (γ, α) on r- or s-seed nuclei [1, 2]. The best possible sites that have been proposed for the production of\np-nuclei are the O/Ne-rich layers of type II supernova\nexplosions [3].\nFor the calculation of p-process abundances, a comprehensive network involving thousands of reaction rates is\nnecessary. Despite the efforts in recent years, the experimental information on the reaction rates involved in the\np-process nuclear flows is very scarce. The p-process reaction rates presently used in the astrophysical network\ncalculations are based on the cross sections obtained from\nHauser-Feshbach statistical model calculations.\nFor the network calculations involving the p-nuclei, the\nprecise knowledge of the photon strength especially in the\nclose-threshold regions is very important. In contrast to\nthe rather detailed knowledge [4] of the photon strength\nin the isovector giant dipole resonance (GDR) region well\nabove the particle separation energies, the corresponding\ninformation for the excitation region near threshold is\nstill surprisingly uncertain due to the much smaller cross\nsection. Accurate information on weaker channels with\nprotons or alpha particles in the exit channels is also\n\n∗ Present address: Nuclear Engineering Division, Argonne National\nLaboratory, Argonne, Illinois 60439, USA.\n† Present address: Istituto Nazionale di Fisica Nucleare, Sezione di\nPadova, 35131 Padova PD, Italy.\n‡ Present address: Department of Physics, Duke University and Triangle Universities Nuclear Laboratory, Durham, NC 27708, USA.\n\nnecessary.\n\nThe experimental information available for the pnucleosynthesis so far is either from the reactions that\ninvolve neutrons or charged particles. The work described here presents experimental data for the photodisintegration of one nucleus into four different channels as observed in a wide range of bremsstrahlung endpoint energies, i.e, the 144 Sm(γ, n) to 143 Sm and 143m Sm,\nthe 144 Sm(γ, p) and 144 Sm(γ, α) reactions. The nuclide\n144\nSm has been discussed in the frame of the p-process\nchronometer 146 Sm [5, 6]. There were several efforts to\ndetermine the 146 Sm/144 Sm production ratio experimentally which varies due to uncertainties in different inputs\nentering into the calculation, see Ref. [7]. The nuclearphysics-related uncertainties in the p-process model predictions were investigated recently by Rapp et al. [8]. A\nlist of the most critical p-process reaction rates (with\ntheir respective inverse reactions), which will influence\nthe final p-abundances, have been given (see Table 2 and\nTable 3, Ref. [8]). In general, a systematic investigation\nof the (γ,α) reactions in the mass region A≥140 is found\nto be very important. Therefore, experimental information on the photodisintegration rates in 144 Sm helps to\nreduce the inherent nuclear model uncertainties.\n\nThe photoactivation experiments presented here cover\na substantial range of excitation. The experimental setup\nis described in Sec. II and Sec. III explains the method of\nphotoactivation yield determination. The experimental\nresults of the 144 Sm(γ, n), 144 Sm(γ, p) and 144 Sm(γ, α)\nreactions are discussed in detail under Sec. IV. The photoactivation experiments are performed such that an absolute yield can be extracted which allows the derivation\nof an absolute strength. This strength function is used\nin statistical calculations of Hauser-Feshbach type as an\ninput parameter. This point is worked out in detail in\nSec. IV B of this paper.\n\n\f2\nII.\n\nconcrete shielding\n\nEXPERIMENTAL SETUP\n\nThe photodisintegration experiments discussed here\nwere performed at the bremsstrahlung facility of the superconducting electron accelerator ELBE (Electron Linear accelerator of high Brilliance and low Emittance)\nof Forschungszentrum Dresden-Rossendorf. At ELBE,\nbremsstrahlung endpoint energies up to 20 MeV and average currents up to 1 mA are available which is appropriate for probing photon-induced reactions. The\nbremsstrahlung facility has been extensively used for\nphoton scattering as well as photoactivation studies [9–\n15]. The experimental setup at ELBE has been described\nin detail elsewhere [16, 17].\nA schematic layout of the photoactivation facility is\ngiven in Fig. 1. The primary electron beam is focused\nonto a thin radiator foil which produces bremsstrahlung\nvia deceleration of electrons. The radiator is made of\nniobium with areal densities varying between 1.7 mg/cm2\nand 10 mg/cm2 corresponding to 1.6 × 10−4 and 1 × 10−3\nradiation lengths. Behind the radiator, the electrons\nare deflected by a dipole magnet and dumped into\na graphite cylinder with a conical recess (see Fig. 1,\nphotoactivation site). The length of the cylinder is 600\nmm and diameter is 200 mm. The photoactivation target (Sm) is irradiated here together with the activation\nstandard target 197 Au.\nThe bremsstrahlung beam goes straight ahead through\nthe collimator to the photon scattering site. The photonscattering site is separated from the photoactivation site\nby a 1.6 m thick heavy-concrete wall. The collimator\nmade of high-purity aluminum is placed 1 m behind the\nradiator. The collimator shapes a beam with defined diameter from the spatial distribution of photons. For the\nenergy range of interest, the flux at the photon scattering site is about 108 cm−2 s−1 MeV−1 . The endpoint\nenergy of the bremsstrahlung distribution is determined\nby measuring protons from the photodisintegration of the\ndeuteron (see Fig. 1, deuteron breakup target) with silicon detectors. From the maximum energy of the emitted\nprotons, the maximum energy of the incident photons\nwas deduced. For a detailed description of the beam energy determination procedure, see Sec. III C of Ref. [15].\nAt the photon scattering site, a 11 B sample is irradiated together with the activation standard target 197 Au.\nThe activation standard reaction 197 Au(γ, n) has been\ncompared to photoneutron studies using monochromatic\nphotons from positron annihilation in flight technique\n(see [15], and the references therein). The photon flux\nat this site is experimentally determined by means of the\nknown integrated cross sections of the states in 11 B depopulating via γ rays. The thin target bremsstrahlung\nand photon flux determination procedure has been discussed in detail in Ref. [15].\nAt the photoactivation site, the available photon flux\nis about 50 to 100 times higher compared to the photon\nscattering site. At this high-flux area, it is technically\nnot possible to determine the photon flux online. The\n\nelectron\nbeam\ndump\n\n1m\n\nphotoactivation\nsite (Mo/Sm+197Au)\n\nphoton scattering\nsite (11B+197Au)\n\npurging magnet\nPb walls\n\nelectron\nbeam\nsteering\nmagnets\n\ncollimator\nradiator\n\ng beam\ndeuteron\nbreakup\ntarget\n\ng beam\ndump\n\nHPGe+BGO\n\nFIG. 1: (Color online) Photoactivation setup at ELBE accelerator [16]. The electron beam is deflected from the main\nbeam line and creates bremsstrahlung in the radiator. There\nare two target sites: at the photoactivation site, Sm target is\nirradiated together with 197 Au which is used as a reference.\nAt the photon scattering site, the scattered photons from 11 B\nare observed using HPGe detectors. Another 197 Au reference\ntarget is sandwiched with 11 B for flux calibration purposes.\n\nbremsstrahlung distribution by the graphite is described\nby MCNP4C2 [18] simulations which are based on the\nbremsstrahlung cross sections by Seltzer and Berger [19].\nFor the activation measurements, the Sm/Au samples\nused were of natural isotopic composition with masses\n∼200 mg (Au) and ∼2 g (Sm). The Sm powder was\npressed into samples of cylindrical shape and the masses\nwere determined prior to the irradiation. After irradiation, the decay of the daughter nuclei resulting from\nphotoactivation is studied with HPGe detectors of relative efficiency 90% or 60% situated in a lead-shielded\nlow-background environment. Between the sample and\nthe endcap of the detector, a cadmium absorber with\na thickness of 1.535 mm is inserted to block the X-ray\nsumming with the γ-rays. To maximize the absolute efficiency of the detector, the source/target is put on top of\nthe Cd absorber which is situated directly on the HPGe\ncapsule.\nIn case the resulting radioactive nuclei are short-lived,\na rapid transport system (rabbit system) was used for activation experiments. The rabbit system uses compressed\nair to transport the samples between the photoactivation\nsite and the measuring site [20]. The samples to be irradiated are enclosed in polyethylene cassettes and are\nshot to the high photon flux area (photoactivation site,\nFig. 1). After irradiation, the samples are transported\nwithin about 15 s to the detector for decay measurements. For the evaluation of fast decaying samples, a\nlist mode data acquisition system has been used which\nenabled us to account for the rapidly changing dead time\nfractions during the course of the measurement.\nThe measurements demanding low background\nwere performed at the underground laboratory\n'Felsenkeller' [21] in Dresden where 98% of the cosmic\nmuons are shielded by a 47 m thick rock layer. At\nFelsenkeller, the γ-decay was measured with a HPGe\ndetector of 30% relative efficiency.\n\n\f3\nIII.\n\nmeasurement (tloss ). τ denotes the mean life time of the\nradioactive nucleus formed during photoactivation.\n\nDATA ANALYSIS\n\nThe data analysis method is explained in the following\nsections. The discussion is divided into two parts:\n(A) the method of photoactivation and the photoactivation yield determination; and\n\nFor the (γ, x) reaction (x = n, p or α), the activation\nyield is denoted by Yact and is expressed as the ratio of\nthe number of activated nuclei to the number of target\natoms in the sample. For example, for the 144 Sm(γ, n)\nreaction,\n\n(B) the photodisintegration reactions (γ, n), (γ, p) and\n(γ, α) in 144 Sm.\nThe decay properties of the radioactive nuclei resulting\nfrom photoactivation are given in Table I.\nA.\n\nThe photoactivation yield\n\nThe photoactivation method essentially consists of two\nsteps\n144\n\n(i) irradiation of the target nuclei (\n\nSm )\n\n(ii) measurement of decay of the daughter nuclei resulting from photoactivation\nThe irradiation is performed at the photoactivation site\nshown in Fig. 1. The number of activated nuclei Nact (E0 )\nproduced is proportional to the integral of the absolute\nphoton fluence (time integrated flux) Φγ (E, E0 ) times the\nphotodisintegration cross section σ(γ,x) (E). The integral\nruns from the reaction threshold energy Ethr up to the\nendpoint energy E0 of the bremsstrahlung spectrum. The\nsymbol x = n, p, α denotes the emitted particle. The\nnumber of target atoms in the sample is denoted by Ntar .\nNact (E0 ) = Ntar *\n\nZ\n\nE0\n\nσ(γ,x) (E) * Φγ (E, E0 ) dE\n\n(1)\n\nEthr\n\nAfter irradiation, the γ-rays following the β-decays of the\nradioactive sample are measured using HPGe detectors.\nThe number of activated nuclei Nact (E0 ) is determined\nusing the relation:\nNact (E0 ) =\n\nNγ (Eγ , E0 ) * κcorr\nε(Eγ ) * p(Eγ )\n\n(2)\n\nNγ (Eγ , E0 ), ε(Eγ ) and p(Eγ ) denote the dead-time and\npile-up corrected full-energy peak intensity of the observed transition, the absolute efficiency of the detector\nat the energy Eγ and the emission probability of the photon with energy Eγ respectively.\nThe factor κcorr in Eq. (2) is given by\nκcorr =\n\ntirr\nexp ( tloss\nτ )\nτ\n*\n)\n1 − exp ( −tmeas\n1\n−\nexp\n( −tτirr )\nτ\n\n(3)\n\nThis expression determines the number of radioactive nuclei from their decays measured during the time tmeas . It\nalso takes into account decay losses during irradiation\n(tirr ) and in between end of irradiation and beginning of\n\nYact (143 Sm) =\n\nNact (143 Sm)\nNtar (144 Sm)\n\n(4)\n\nUsing Eq. (1), the activation yield can be calculated from\nσ(γ,n) (E) data with the known bremsstrahlung spectrum.\nIn this way measured activation yields can be compared\nwith the experimental or theoretical cross section data.\nTo compare the activation yield measured at different\nendpoint energies with the calculated yield using cross\nsections from theory/previous experiments, the experimental data need to be normalized to the photon fluence at the irradiation site (the photoactivation site, see\nFig. 1). As already mentioned, it is not possible to measure the photon fluence at this site directly. The fluence at a fixed energy EγX is given by the ratio of the\nmeasured 197 Au(γ, n) activation yield and the calculated\nactivation yield using the known σ(γ,n) from 197 Au and\na simulated thick target bremsstrahlung spectrum using\nthe code MCNP. For the experiments discussed in this paper, the normalization has been done to the fluence at EγX\n= 7.288 MeV which is well below the bremsstrahlung endpoint energies for the photodisintegration experiments\nunder discussion.\nFor the precise and accurate analysis of the decay spectra, the HPGe detectors were calibrated with a certified\nset of calibration sources in the energy range from 0.12\nto 1.9 MeV. The efficiency curve for the detector with\n90% relative efficiency is shown in Fig. 2. For multigamma emitting nuclides, coincidence summing corrections have been applied. The fit to the data points is a\ncurve based on a GEANT3 [23] simulation with realistic\ndetector geometry. The detector dimensions have been\ndetermined independently by performing a 200 keV Xray scan. The simulated and measured efficiencies agree\nwithin 1.01±0.02 for the considered energy range. In the\nestimation of errors, both statistical and systematic uncertainties are taken into account. The systematic uncertainties in the activity as given in the source certificates\namount to 0.6-1.5% in the energy range from 0.12 to 1.9\nMeV. The statistical uncertainty mainly originates from\nthe peak fit for the calculation of peak areas and the\ndead-time and pile-up corrections. The statistical uncertainty contribution is in the order of 0.2-0.5%. However,\nfor the photoactivation experiment described here, the\ntargets used were not point-like and the appropriate correction for volume-effects has been applied. This will be\ndescribed in the next section.\n\n\f4\nTABLE I: Decay properties of the daughter nuclei stemming from the respective photodisintegration reactions in 144 Sm. The\nvalues are adopted from the Evaluated Nuclear Structure Data Files of the National Nuclear Data Center online service [22].\nreaction\n144\n\nSm(γ, n)\n\nSm(γ, α)\n\n144\n\nSm(γ, p)\n\np\n\n1056.58\n\n0.019(2)\n\n1173.18\n\n0.004161(544)\n\n1514.98\n\n0.006593(75)\n\n1403.06\n\n0.003496(414)\n\n66(2) s\n\n754.4\n\n0.8988(6)\n\ndecay\n\nt1/2\n\n10.5200(24)\n\n143\n\n8.75(8) min\n\n143\n144\n\nEγ c (keV)\n\nb\n\nSx a (MeV)\n\n-0.145\n6.295(3)\n\n140\n\nSm(EC+β + )143 Pm\n\nSm IT decay\n140\n\nd\n\nNd(EC) Pr(no γ)\nPr(β + )140 Ce\n\n3.37(2) d\n\n1596.11\n\n0.0050(4)\n\n140\n143\n\nPm(EC)143 Nd\n\n265(7) d\n\n741.98\n\n0.385(24)\n\na separation\n\nenergy for the proton or neutron emission; Q-value\nfor alpha emission\nb half-life of the corresponding decay with absolute uncertainty\ngiven in parentheses\nc γ-energy of the analyzed transitions\nd photon emission probability per decay with absolute uncertainty\ngiven in parentheses\n\nFIG. 2: Full-energy peak efficiency curve for a HPGe detector\nwith 90% efficiency. The upper part is the fit curve based on\nGEANT3 simulations normalized to the experimental data\nand the lower part shows the relative residuals.\n\nB.\n\nPhotodisintegration of\n\n144\n\nSm\n\nIn this experiment, the photodisintegration reactions\n(γ, n), (γ, p) and (γ, α) on 144 Sm were studied. The cross\nsection predictions for the (γ, n), (γ, p) and (γ, α) reactions by the statistical models TALYS [24] and NONSMOKER [25] are given in Fig. 3. The 144 Sm(γ, n) reaction produces 143 Sm or 143m Sm. The NON-SMOKER\n\nFIG. 3: (Color online) 144 Sm(γ, γ ′ ) (green),144 Sm(γ, n) (blue\nto the ground state, black to the isomer), 144 Sm(γ, p) (purple) and 144 Sm(γ, α) (red) cross sections from model calculations. TALYS and NON-SMOKER predictions are shown\nwith dashed and solid lines respectively. The TALYS calculations were performed with the default input parameter set\nin the version TALYS-1.0.\n\nmodel doesn't provide the cross section data for the\nground and isomeric states in 144 Sm separately. Above\n11 MeV, the (γ, p) and (γ, α) cross sections are orders\nof magnitude lower than the (γ, n) cross sections due to\nthe suppressive effect of the Coulomb barrier. The reaction thresholds and decay properties of the respective\nphotodisintegrations in 144 Sm are given in Table I.\nFor studying the 144 Sm(γ, n) reaction, the irradiation\n\n\f5\nwas performed for various endpoint energies starting with\nE0 = 11.00 MeV which is approximately 480 keV above\nthe neutron separation energy. The daughter nucleus\nproduced is 143 Sm, partially in its isomeric state 143 Smm .\nThe 144 Sm(γ, n)143 Smm reaction is identified with the\nisomeric transition at 754 keV and the 144 Sm(γ, n)143 Smg\nwith transitions above 1000 keV (see Table I). Since both\nradionuclides are short-lived, the irradiation was carried\nout using the rabbit system. The activations for this\nexperiment lasted between 15-45 minutes. The sample\nspectrum of an irradiated Sm target and the half-life measurement using the exponential decay of the ground state\nof 143 Sm have been presented in Fig. 2 of Ref. [20].\nFor the activation using the rabbit system, the targets\nused were not point-like. For the irradiation of samarium,\nwe used fine Sm2 O3 powder filled in a cylinder (length 16\nmm, diameter 10 mm) of about 2-3 g mass. The 197 Au\nactivation standard targets were made of Au-metal foils\nof about 200-250 mg mass rolled into a cylindrical shape\n(length 36 mm, diameter 5 mm). Therefore, the fullenergy peak efficiencies measured with point sources have\nto be corrected for source-extension and self-absorption\neffects. To account for the volume source effect, detailed\nsimulations using GEANT3 were performed. The absolute full-energy peak efficiency of the target is given by\nεtarget (Eγ ) = εpoint (Eγ ) *\n\nεsim\ntarget (Eγ )\nεsim\npoint (Eγ )\n\n(5)\n\nεpoint denotes the efficiencies measured with point-like\nsources at a distance corresponding to the distance of\nthe center of the volume source to the HPGe crystal.\nThe simulated full-energy peak efficiencies for volume\nsim\nand point-like sources are denoted by εsim\ntarget and εpoint\nrespectively. The ratio is the correction to be applied for\nthe volume source effect. For example, for the transition\nat 754 keV\u0010resulting from\nthe 143m Sm decay, the correc\u0011\ntion factor\n\nεsim\ntarget (Eγ )\nεsim\npoint (Eγ )\n\namounts to about 0.97±0.03. For\n\nthe transition at 356 keV following the decay of 196 Au,\nthe correction factor was about 0.93±0.02.\nThe 144 Sm(γ, p) and 144 Sm(γ, α) activation yields were\nmeasured for the first time at astrophysically relevant energies. In the context of this work, these are categorized\nas manual measurements, indicating that the rabbit system was not necessary for the transport of the rather\nlong-lived isotopes to the counting setup.\nFor the energy range considered in these experiments,\nthe 144 Sm(γ, p) and (γ, α) cross sections are rather very\nsmall compared to the (γ, n) cross sections (see Fig. 3).\nThis results in a decay spectrum with weak counting\nstatistics. Therefore, the decay measurements were performed under optimized background conditions in the\n'Felsenkeller' underground laboratory.\nIn the photoactivation of 144 Sm, the (γ, n) and (γ, p)\nreaction yields cannot be distinguished at high energies\nabove the neutron separation energy (Sn = 10.52 MeV)\nsince the (γ, n) daughter nucleus decays very quickly to\nthe (γ, p) daughter nucleus. Therefore, to measure the\n\nFIG. 4: The spectrum of an irradiated Sm2 O3 target in which\nthe decays following the 144 Sm(γ, p) and 144 Sm(γ, α) disintegrations are observed. The strongest γ-transitions following\nthe β-decays of 143 Pm and 140 Pr are marked. The target was\nplaced on top of the 30% HPGe detector at the underground\nlaboratory. The other peaks are from the contamination reactions like 154 Sm(γ, n) etc. The target was irradiated at a\nbremsstrahlung endpoint energy of 15.0 MeV and the spectrum shown here was recorded for a period of 1 day.\n\npure (γ, p) reactions, we used bremsstrahlung energies\nsufficiently below 10.52 MeV.\nA sample spectrum of an irradiated samarium target is\ngiven in Fig. 4. The Sm2 O3 target was placed on top of\nthe 30% HPGe detector. In this measurement, the target was irradiated at a bremsstrahlung endpoint energy\nof 15.0 MeV and was brought to the underground laboratory on the next day of irradiation. The spectrum shown\nhere was recorded for a period of 1 day. The 144 Sm(γ, p)\nreaction is identified by the transition at 742 keV from\n143\nPm decay (EC) with a half-life of 265 days, see figure.\nThe 144 Sm(γ,α) reaction was identified by the transition\nat 1596 keV following the decay of 140 Pr which is the\ndaughter of the (γ,α) product 140 Nd. In the spectrum\nshown in Fig. 4, the 1596 keV transition is also marked.\nThe other peaks in the spectrum stem from the contaminating reactions in the other samarium isotopes (e.g.,\n154\nSm(γ, n)).\nFor the manual measurements, we used Sm2 O3 powder filled into discs of radius 9 mm and thickness 5 mm.\nTo correct the full-energy peak efficiencies for the volume\nsource effect, we used the Monte-Carlo efficiency transfer code EFFTRAN [26]. The point source efficiency\nhas been measured with the point source shifted to a\ndistance which corresponds to the center of the volume\nsource. The point source efficiency is reduced by 7%\nwhen the point source is shifted and put in the middle of\nthe volume target. The volume source effect is only 4%,\ncomparing the point source at the center of the Sm2 O3\nsample and a volume target Sm2 O3 placed on the top of\nthe cadmium absorber. The 197 Au activation standard\n\n\f6\ntargets were very thin discs (mass∼100 mg, thickness-0.2\nmm, radius-9 mm) and the volume source effect was not\nsignificant.\nThe activation yield relative to the photon fluence are\npresented in the next sections in detail.\nIV.\nA.\n\nRESULTS AND DISCUSSION\n\nActivation yield for 144 Sm(γ, n) reaction:\nComparison to previous experiments\n\nThe activation yield for the 144 Sm(γ, n) reaction was\ndetermined using the method discussed in Sec. III A. The\nexperimental activation yield for the 144 Sm(γ,n)143 Sm\nreaction (Yg ) relative to the photon fluence is given in\nFig. 5.\nThe activation yield is compared to the yield calculated\nusing cross sections from previous experiments. The photoneutron cross sections of the Sm isotopes have been\nmeasured by Carlos et al. [27] using positron annihilation in flight beams at Saclay. In particular, Carlos et al.\npresent a study of the transition from spherical to deformed shape for isotopes in the samarium region. The\npartial photoneutron cross sections - [σ(γ,n)+σ(γ,np)]\nand σ(γ,2n) of 144 Sm are given in Fig. 2 of [27].\n\nFIG. 6: The isomeric yield ratio η =\n\nYm\nYm +Yg\n\nmeasured at\n\n144\n\nELBE (diamonds) for the\nSm(γ,n) reaction is compared\nto the isomeric yield ratio given by Mazur et al. (open diamonds).\n\ndata obtained with natural Sm at the same laboratory [28] at the same photon energies. For the\nenergy range 11-16 MeV, the correction factor for\nthe isotopic contamination is 0.8 to 0.9.\n2. As shown in a precision experiment by Berman\net al. [29], the cross sections measured at Saclay\nfor nuclei with A < 150 are larger by approximately 20% in all cases except 141 Pr for which a\ncomparison was made. For this particular case, an\nadditional correction factor of 0.8 was applied.\n\nFIG. 5: The experimental activation yield from ELBE\n(squares) for the 144 Sm(γ, n)143 Sm reaction normalized to the\nphoton fluence is compared to the yield calculated using cross\nsections measured by Carlos et al. (open circles). The data\nfrom Carlos et al. [27] have been scaled by factor of 0.8, following the recommendations by Berman et al. [29] (see text).\nThe downward arrow denotes the neutron emission threshold.\n\nFor calculating the activation yield, the cross section\ndata from Carlos et al. were renormalized by us to correct for two effects:\n1. The target used by Carlos et al. had a contamination of 11.4% of other Sm-isotopes. We have\nsubtracted the possible contamination using earlier\n\nThe corrected cross sections were then used to calculate\nthe activation yield which compares to our experimental\nyield as shown in Fig. 5.\nIn addition, the activation yield Ym for the\n144\nSm(γ,n)143m Sm reaction has been determined using\nthe method described in Sec. III A. With known Yg and\nm\nwas determined\nYm , the isomeric yield ratio η = YmY+Y\ng\n(see Fig. 6).\nIn an activation experiment by Mazur et al. [30] using bremsstrahlung beams from the M-30 microtron facility at Uzhgorod (Ukraine), the isomeric-state excitations\nhave been investigated for several N = 82 closed-shell nuclei in the energy range 8-18 MeV. The (γ, n)m cross sections were deduced using the Penfold-Leiss method [31],\nsee Fig. 1 of Ref. [30]. Mazur et al. have also measured\nm\nthe isomeric yield ratio η = YmY+Y\n[32] as a function of\ng\n144\n143g,m\nenergy for the\nSm(γ,n)\nSm reaction. The experimental isomeric yield ratio from the ELBE is in good\nagreement with the data from Mazur et al, see Fig. 6.\nAt low energies close to the reaction threshold, the activation yield is influenced by the different experimental\nconditions (e.g, use of a hardener, thin/thick radiators\netc).\n\n\f7\nB.\n\nModel calculations in the Hauser-Feshbach\nformalism\n\nThis section is dedicated to the comparison of experimental results to the predictions of the two advanced model codes TALYS and NON-SMOKER which\nare based on the Hauser-Feshbach formalism. The NONSMOKER code uses the neutron optical-model potential\nby Jeukenne et al. [33] with a low-energy modification\nby Lejeune [34]. The γ-ray strength function is taken\nfrom Thielemann and Arnould [35]. The low-energy\nmodification of the GDR Lorentzian is by McCullagh\net al. [36]. The nuclear level density implemented in the\nNON-SMOKER code is based on a global parametrization by Rauscher et al. [37] within the back-shifted Fermigas formalism.\nThe TALYS calculations presented in this paper were\nperformed with the current version of the code TALYS1.0. The default option of this code uses the neutron\noptical-model potential parameterizations by Koning and\nDelaroche [38]. The E1 photon strength function is from\nthe compilation by Kopecky and Uhl [39]. The nuclear\nlevel density model is based on an approach using the\nFermi-gas model [40].\nThe measured activation yield (Yg ) is compared to the\nsimulated yield from Hauser-Feshbach models as shown\nin Fig. 7. It is observed that the experimental yield\nroughly agrees to the simulated yield using cross sections\npredicted by the default inputs to TALYS (agrees within\n20%) and NON-SMOKER (agrees within a factor of 2).\nThe statistical model calculations are sensitive to the\nbasic input ingredients like optical potentials, strength\nfunctions and level densities. In the case of (γ,n) reactions, the influence of the neutron optical potential is\nweak, whereas the photon strength function is a crucial\ningredient of the model calculations. We modified the deformation dependent parameters of the E1 strength function used in TALYS according to a new parametrization\nexplained below (see also Ref. [41]).\nThe strength function f1 (Eγ ) is related to the average\nphotoabsorption cross section σγ (Eγ ) over a large number of levels with same spin and parity by the equation\n2J0 + 1 σγ (Eγ )\n= f1 (Eγ )\n*\n2Jx + 1 (π~c)2 Eγ\n\ndeformation parameter β and triaxiality parameter γ is\nparameterized as:\nEk =\n\nE0\nE0 * R0\n=\ni\nhq\nRk\n2\n5\n*\nβ\n*\ncos(γ\n−\nkπ)\nexp\n4π\n3\n\nHere, R0 denotes the nuclear radius and E0 is the GDR\ncentroid energy. For a spherical nucleus with mass A, R0\nis given by R0 = 1.16A1/3 fm and E0 is calculated with\nan effective nucleon mass m∗ = 874 MeV/c2 .\nIn the proposed phenomenological ansatz we parameterize the strength function by a sum of three Lorentzians\ntailing down from the GDR. The centroid energy of the\nGDR is directly related to parameters of the finite range\ndroplet model with one extra parameter which is equal\nfor all heavy nuclei, the reduced nucleon mass m* [45].\nAs was shown theoretically [46] a description of the E1\nphotoabsorption cross section by a Lorentzian is appropriate although the total width Γ of a GDR in a heavy\nnucleus is dominated by spreading and not by escape, i.e.\ndirect decay.\nThe average absorption cross section in the GDR is\ngiven by\nσγ (Eγ ) =\n\n3\nEγ2 Γk\n1.29 * Z * N X\nA\n(Ek2 − Eγ2 )2 + Eγ2 Γ2k\n\nJ0 and Jx denote the spins of ground and excited states\nrespectively [42]. Eq. 6 can be applied to a wide energy\nrange around the GDR, including the low energy tail of\nit. In even nuclei, the spin Jx is equal to the multipolarity\nof the GDR, i.e., λ = 1.\nIn nearly all types of heavy nuclei, the GDR can be\ntreated as splitted into two or three components, whose\nenergies are well predicted by the finite range droplet\nmodel (FRDM) [43]. Making use of the fact that the vibrational frequency Ek /~ along a given axis k is inversely\nproportional to the corresponding semi-axis length Rk ,\nand the splitting [44] is due to the three different axes\nof the ellipsoid, the nuclear shape with its quadrupole\n\n(8)\n\nk=1\n\nHere we assume that the GDR width Γk to be used in the\nsum of the three Lorentzians depends on the resonance\nenergy Ek only, in contrast to earlier descriptions [39, 47].\nThe photon energy Eγ is given in MeV and σγ (Eγ ) in\nfm2 .\nIn this description, the Thomas-Reiche-Kuhn sum rule\nas determined from general quantum mechanical arguments [48] is included for obtaining the average photoabsorption cross section on an absolute scale. We use results from hydrodynamical considerations [44] by adapting surface dissipation to the Goldhaber-Teller model of\nthe GDR. This results in a power law dependence of the\nresonance width on the respective resonance energy Ek .\nIn general, for all stable nuclei with A > 80,\nδ\n\n(6)\n\n(7)\n\nΓk (Ek ) = 0.05 * (Ek ) ,\n\n(9)\n\nFor the exponent, the value δ = 1.6 was derived from the\none-body dissipation model [44] and the proportionality\nparameter stems from a fit to many nuclei including axially as well as triaxially deformed nuclei where the GDR\nis split into three components with well defined distances\nfrom the centroid and relative intensities. We generalize\nthis by using the proposed [44] power law dependence for\ndifferent nuclei and thus reduce the number of parameters\nfor the description of the GDR's by relating the spreading width in all nuclei with mass A > 80 to the respective\nresonance energy of their GDR. It is stressed here again\nthat the Lorentzian photon strength function f (Er ) is\nparameterized in each nucleus by a constant spreading\nwidth Γ(Ek ) not depending on the photon energy.\n\n\f8\nThe above parametrization has been discussed in detail\nwith examples from experimental studies of 8 nuclides between A = 80 and 238 in a recent publication [41]. The\nnew phenomenological description based on the ground\nstate deformation parameters describes well the electric\ndipole excitations for nuclei with A > 80 from Ex ≈ 4\nMeV up to several MeV above the GDR. In addition, the\ndipole strength function for the case of 197 Au was determined using the proposed parametrization and compared\nwith experimental results from ELBE [15].\nThe yield for the 144 Sm(γ, n) reaction calculated using\nthe TALYS code with modified E1 photon strength functions derived on the basis of the above discussion is shown\nin Fig. 7. As in the quasi-spherical 144 Sm the three GDR\ncomponents coincide, the splitting is negligible and the\nfollowing resonance parameters were used: E0 = 14.84\nMeV, σ0 = 356.6 mb and Γ0 = 3.74 MeV. In Fig. 8, the\nisomeric yield ratio η measured at ELBE is compared\nto the isomeric yield ratio calculated using cross sections\npredicted by the TALYS code with default and modified\ninputs. The NON-SMOKER model does not provide the\ncross sections arising from the decay of the metastable\nstate in 143 Sm separately and hence it was not possible\nto calculate a yield ratio.\n\nFIG. 7: Experimental activation yield relative to the photon\nfluence for the 144 Sm(γ, n) reaction compared to theoretical\nmodel calculations. The experimental data are denoted by\nsquares with a downward arrow denoting the neutron emission\nthreshold. The dashed and dotted lines denote yield calculations using cross sections from TALYS and NON-SMOKER\ncodes respectively. The solid line represents a TALYS calculation with modified inputs, see text.\n\nC.\n\nActivation yield for 144 Sm(γ, p) and\nreactions\n\n144\n\nSm(γ, α)\n\nThe activation yields for the 144 Sm(γ, p) and\nSm(γ, α) reactions compared to the simulated yields\n\n144\n\nFIG. 8: The isomeric yield ratio η =\n\nYm\nYm +Yg\n\nmeasured at\n\n144\n\nELBE for the\nSm(γ,n) reaction (diamonds) is compared to\nthe isomeric yield ratio calculated using cross sections predicted by the TALYS code (dashed line). The solid line represents the yield ratio calculated using modified inputs to the\nphoton strength functions, see text.\n\nFIG. 9: Experimental activation yield relative to the photon fluence for the (γ,p) and (γ, α) reactions in 144 Sm. The\nyields for 144 Sm (γ,p) (squares) and 144 Sm(γ,α) (diamonds)\nare shown. The dashed and dotted lines denote yield calculations using cross sections from TALYS and NON-SMOKER\ncodes with default inputs whereas the solid line represents a\nTALYS calculation with modified inputs, see text.\n\nusing cross sections predicted by the TALYS and NONSMOKER calculations are shown in Fig. 9. The predictions given by the TALYS code with modified inputs to\nthe E1 photon strength function is also shown.\nThe uncertainties in the experimental yield shown in\nFig. 9 are mainly the statistical uncertainties. The systematic uncertainties arise from the photon emission\nprobabilities for the decays stemming from the (γ, p)\n(6%) and (γ, α) (8%) reactions (see Table I) and from\nthe full-energy peak efficiency calculations (2%).\n\n\f9\n\nFIG. 10: The photoneutron cross sections σ [σ(γ,n)+σ(γ,np)] for Sm-isotopes as described by the photon strength parametrization (solid lines) from Junghans et al. [41]. The original cross sections from Carlos et al. [27] have been scaled by a correction\nfactor of 0.8, see text. The dashed lines denote yield calculations using cross sections from the NON-SMOKER code with\ndefault nuclear physics inputs.\n\nV.\n\nCONCLUSIONS\n\nActivation experiments of the kind described - especially when performed with a transport system allowing\nthe study of short half-lives deliver exact photon strength\ndata. Thus they allow a verification of data obtained\npreviously by direct absorption experiments or by detecting the neutrons from the process. In Fig. 10, the photoneutron cross sections of the Sm-isotopes as described\nby the photon strength parametrization from Junghans\net al. [41] is shown.\nFrom the figure, it is obvious that the parametrization\ndescribes all the isotopes well except 144 Sm in which the\ncontribution from 144 Sm(γ, γ ′ ) and 144 Sm(γ, p) is of significant magnitude at low energies close-around Sn (see\nFig. 3). For all cross section data from Carlos et al.,\na correction factor of 0.8 based on Berman et al. [29]\nexperiments was applied. For the 144 Sm cross sections,\nthe additional correction factor arising from isotopic contaminations was also necessary (see Sec. IV A). The\nyield calculations using cross sections from the NONSMOKER code with default nuclear physics inputs are\nalso shown. It is clear the calculations incorporating the\nnew parametrization provides a better description to the\nexperimental data than default NON-SMOKER results.\nThe agreement between the parametrization and experimental data is surprisingly good- taking into account\nthat all parameters (except β) were obtained from global\nfits to all nuclei with A > 70 (as long as respective data\n\nare available for them). The only non-global parameter,\nthe deformation β was directly derived from the electric\nquadrupole transition strength to the first 2+ state [49].\nThe approximation for the triaxiality γ is from the systematics presented by [50]. The values of β and γ used\nfor each isotope are shown in the respective figure. The\nLorentzian resonance integral corresponds to the TRK\nsum rule and the resonance energies are calculated using\nthe symmetry energy J=32.7 MeV and surface stiffness\nQ=29.2 MeV [45].\nTo summarize, this paper presents the photodisintegration of 144 Sm to four exit channels. The 144 Sm(γ,n)\nreaction yield has been compared to the yield calculated\nusing cross sections from previous photoneutron experiments and a comparison of the two data sets leads to a\nconclusion on the inaccuracies in previous data. It has\nbeen verified that the recommendations based on Berman\net al. [29] experiments are necessary to correct the cross\nsection measurements at Saclay.\nThe activation yield for all the photodisintegration\nreactions has been compared with TALYS and NONSMOKER models. In general, the experimental activation yields agree within a factor of 2 to the simulated\nyield using statistical model predictions. In view of the\nfact, that the codes NON-SMOKER and TALYS are\nbased on the same theory-the Hauser-Feshbach model,\neventual differences appearing in the model predictions\nare strongly related to their nuclear physics inputs. The\neffect of using different photon strength functions in the\n\n\f10\nTALYS model calculations has been discussed here. For\nthe 144 Sm(γ,α)reaction, the statistical model description\nfaces the additional problem of the possible emission of\nlow energy photons prior to the alpha emission. In a\nforthcoming paper the respective data for 144 Sm will be\npresented together with results for a different mass region, and the proper treatment of that process by the\ntwo codes will be examined.\nThe new proposed phenomenological parametrization\ndescribes very well the photoneutron cross section data\nfor Sm isotopes. A similar investigation has been performed for the stable even isotopes of Mo and same effects\nhas been observed [51]. It is thus worthwhile to point out\nagain that this new fit only needs a very limited number\nof fit parameters to describe the electric dipole strength\n\nin all nuclei with A > 70, for which nuclear photoeffect\ndata exist.\n\n[1] E. M. Burbidge, G. R. Burbidge, W. A. Fowler et al.,\nRev. Mod. Phys. 29, 547 (1957).\n[2] D. L. Lambert, Astron. Astrophys. Rev. 3, 201 (1992).\n[3] M. Arnould and S. Goriely, Phys. Rep. 384, 1 (2003).\n[4] S. S. Dietrich and B. L. Berman, At. Data Nucl. Data\nTables 38, 199 (1988).\n[5] J. Audouze and D. N. Schramm, Nature 237, 447 (1972).\n[6] R. Andreasen and M. Sharma, Science 314, 806 (2006).\n[7] E. Somorjai, Z. Fülöp, A. Z. Kiss, et al., Astron. Astrophys. 333, 1112 (1998).\n[8] W. Rapp, J. Gorres, M. Wiescher, et al., Astrophys. J.\n653, 474 (2006).\n[9] G. Rusev, R. Schwengner, F. Dönau et al., Phys. Rev. C\n73, 044308 (2006).\n[10] R. Schwengner, G. Rusev, N. Benouaret et al., Phys. Rev.\nC 76, 034321 (2007).\n[11] R. Schwengner, G. Rusev, N. Tsoneva et al., Phys. Rev.\nC 78, 064314 (2008).\n[12] G. Rusev, R. Schwengner, F. Dönau et al., Phys. Rev. C\n77, 064321 (2008).\n[13] G. Rusev, R. Schwengner, R. Beyer et al., Phys. Rev. C\n79, 061302 (2009).\n[14] N. Benouaret, R. Schwengner, G. Rusev et al., Phys. Rev.\nC 79, 014303 (2009).\n[15] C. Nair, M. Erhard, A. R. Junghans et al., Phys. Rev. C\n78, 055802 (2008).\n[16] R. Schwengner, R. Beyer, F. Dönau et al., Nucl. Instrum.\nMethods A 555, 211 (2005).\n[17] A. Wagner, R. Beyer, M. Erhard et al., J. Phys. G: Nucl.\nPart. 31, S1969 (2005).\n[18] MCNP - Monte Carlo N-Particle Transport Code,\nhttp://mcnp-green.lanl.gov/; Version 4C2 obtainable\nfrom http://www.nea.fr/abs/html/ccc-0701.html.\n[19] S. M. Seltzer and M. J. Berger, At. Data Nucl. Data\nTables 35, 345 (1986).\n[20] C. Nair, A. R. Junghans, M. Erhard et al., J. Phys. G:\nNucl. Part. 35, 014036 (2008).\n[21] M. Köhler, D.Degering, M.Laubenstein et al., Appl. Rad.\nIsot. 67, 736 (2009).\n[22] Evaluated Nuclear Structure Data Files (ENDSF). The\ndatabase service of National Nuclear Data Center\n(NNDC). http://www.nndc.bnl.gov/ensdf/\n[23] GEANT3: CERN program Library Long Writeup Q121,\n\nCERN, Geneva (CH), 1994.\n[24] A.J. Koning, S. Hilaire and M.C. Duijvestijn, Proceedings of the International Conference on Nuclear\nData for Science and Technology, April 22-27, 2007,\nNice, France, editors O.Bersillon, F.Gunsing, E.Bauge,\nR.Jacqmin, and S.Leray, EDP Sciences, p. 211-214\n(2008); http://www.talys.eu\n[25] T. Rauscher and F. -K. Thielemann, At. Data Nucl. Data\nTables 88, 1 (2004).\n[26] T. Vidmar, Nucl. Instrum. Methods A 550, 603 (2005).\n[27] P. Carlos, H. Beil, R. Bergère, et al., Nucl. Phys. A 225,\n171 (1974).\n[28] R. Bergère, H. Beil, P. Carlos, et al., Nucl. Phys. A 133,\n417 (1969).\n[29] B. L. Berman, R. E. Pywell, S. S. Dietrich et al., Phys.\nRev. C 36, 1286 (1987).\n[30] V. M. Mazur, V. A. Zheltonozhskii, and Z. M. Bigan,\nPhys. of Atomic Nuclei 58, 898 (1995).\n[31] A. S. Penfold and J. E. Leiss, Phys. Rev. 114, 1332\n(1959).\n[32] R. Vanska and R. Rieppo, Nucl. Instrum. Methods 179,\n525 (1981).\n[33] J. P. Jeukenne, A. Lejeune, and C. Mahaux, Phys. Rev.\nC 15, 10 (1977). J. P. Jeukenne, A. Lejeune, and C. Mahaux, Phys. Rev. C 16, 80 (1977). J. P. Jeukenne, A.\nLejeune, and C. Mahaux, Phys. Rep. 25, 83 (1976).\n[34] A. Lejeune, Phys. Rev. C 21, 1107 (1980).\n[35] F. -K. Thielemann, and M. Arnould, Proc. Int. Conf.\nNucl. Data for Science and Technology, edited by K.\nBöckhoff, D. Reidel Publ. Co, Brussels, 762 (1983).\n[36] C. M. McCullagh, M. L. Stelts, and R. E. Chrien, Phys.\nRev. C 23, 1394 (1981).\n[37] T. Rauscher, F.-K. Thielemann, and K. L. Kratz, Phys.\nRev. C 56, 1613 (1997).\n[38] A. J. Koning and J. P. Delaroche, Nucl. Phys. A 713,\n231 (2003).\n[39] J. Kopecky and M. Uhl, Phys. Rev. C 41, 1941 (1990).\n[40] A. J. Koning, S. Hilaire and S. Goriely, Nucl. Phys. A\n810, 13 (2008).\n[41] A. R. Junghans, G. Rusev, R. Schwengner et al., Phys.\nLett. B 670, 200 (2008).\n[42] G. A. Bartholomew, E. D. Earle, A. J. Ferguson et al.,\nAdv. Nucl. Phys. 7, 229 (Plenum Press, New York, 1973).\n\nVI.\n\nACKNOWLEDGEMENTS\n\nWe thank P. Michel and the ELBE team for providing a stable beam during activation experiments. We are\nindebted to J. Klug for the MCNP simulations of the\nbremsstrahlung spectra at the photoactivation site. Special thanks are due to M. Köhler and D. Degering, for\ntheir help with the measurements at the underground\nlaboratory Felsenkeller, Dresden. The technical assistance of A. Hartmann is gratefully acknowledged.\n\n\f11\n[43] W. D. Myers, W. J. Swiatecki, T. Kodama et al., Phys.\nRev. C 15, 2032 (1977).\n[44] B. Bush and Y. Alhassid, Nucl. Phys. A 531, 27 (1991).\n[45] P. Möller, J. R. Nix, W. D. Myers et al., At. Data Nucl.\nData Tables 59 185 (1995).\n[46] C. B. Dover, R. H. Lemmer and F. J. W. Hahne, Ann.\nPhys. 70 458 (1972).\n[47] L. Zanini, F. Corvi, H. Postma et al., Phys. Rev. C 68,\n014320 (2003).\n[48] J. M. Eisenberg and W. Greiner, Nuclear Theory Vol.\n\n2: Excitation mechanisms of the nucleus, Third edition,\nNorth Holland Physics Publ., Amsterdam (1988).\n[49] S. Raman, C. W. Nestor, Jr., and P. Tikkanen, At. Data\nNucl. Data Tables 78, 1 (2001).\n[50] W. Andrejtscheff and P. Petkov, Phys. Rev. C 48, 2531\n(1993).\n[51] M. Erhard, A. R. Junghans, C. Nair et al., Phys. Rev. C\n81, 034319 (2010).\n\n\f"}