{"id": "http://arxiv.org/abs/1111.3914v2", "guidislink": true, "updated": "2012-09-10T22:30:21Z", "updated_parsed": [2012, 9, 10, 22, 30, 21, 0, 254, 0], "published": "2011-11-16T19:28:07Z", "published_parsed": [2011, 11, 16, 19, 28, 7, 2, 320, 0], "title": "Relaxation in driven integer quantum Hall edge states", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.2911%2C1111.2812%2C1111.0611%2C1111.2707%2C1111.3647%2C1111.5367%2C1111.2088%2C1111.4202%2C1111.3125%2C1111.6981%2C1111.1499%2C1111.0430%2C1111.6583%2C1111.0883%2C1111.3914%2C1111.1250%2C1111.6886%2C1111.2179%2C1111.2149%2C1111.3674%2C1111.4047%2C1111.4548%2C1111.6703%2C1111.3622%2C1111.2208%2C1111.5619%2C1111.1725%2C1111.3937%2C1111.3364%2C1111.1642%2C1111.3041%2C1111.3629%2C1111.6688%2C1111.6380%2C1111.4481%2C1111.5981%2C1111.3534%2C1111.0990%2C1111.2154%2C1111.2785%2C1111.5838%2C1111.2635%2C1111.1058%2C1111.6742%2C1111.7186%2C1111.2508%2C1111.5162%2C1111.2737%2C1111.5599%2C1111.6809%2C1111.2639%2C1111.1520%2C1111.5356%2C1111.5275%2C1111.3305%2C1111.1094%2C1111.0621%2C1111.3709%2C1111.1152%2C1111.5408%2C1111.5569%2C1111.0824%2C1111.1999%2C1111.1126%2C1111.3390%2C1111.3777%2C1111.3628%2C1111.1692%2C1111.3952%2C1111.6198%2C1111.6754%2C1111.4257%2C1111.4117%2C1111.1428%2C1111.4377%2C1111.3959%2C1111.6473%2C1111.4364%2C1111.1421%2C1111.1106%2C1111.0763%2C1111.0947%2C1111.0565%2C1111.5204%2C1111.3926%2C1111.2753%2C1111.3552%2C1111.3066%2C1111.6899%2C1111.0263%2C1111.4788%2C1111.7187%2C1111.0272%2C1111.0017%2C1111.6468%2C1111.2898%2C1111.3617%2C1111.4203%2C1111.1790%2C1111.3605%2C1111.4426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Relaxation in driven integer quantum Hall edge states"}, "summary": "A highly non-thermal electron distribution is generated when quantum Hall\nedge states originating from sources at different potentials meet at a quantum\npoint contact. The relaxation of this distribution to a stationary form as a\nfunction of distance downstream from the contact has been observed in recent\nexperiments [Phys. Rev. Lett. 105, 056803 (2010)]. Here we present an exact\ntreatment of a minimal model for the system at filling factor \\nu=2, with\nresults that account well for the observations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.2911%2C1111.2812%2C1111.0611%2C1111.2707%2C1111.3647%2C1111.5367%2C1111.2088%2C1111.4202%2C1111.3125%2C1111.6981%2C1111.1499%2C1111.0430%2C1111.6583%2C1111.0883%2C1111.3914%2C1111.1250%2C1111.6886%2C1111.2179%2C1111.2149%2C1111.3674%2C1111.4047%2C1111.4548%2C1111.6703%2C1111.3622%2C1111.2208%2C1111.5619%2C1111.1725%2C1111.3937%2C1111.3364%2C1111.1642%2C1111.3041%2C1111.3629%2C1111.6688%2C1111.6380%2C1111.4481%2C1111.5981%2C1111.3534%2C1111.0990%2C1111.2154%2C1111.2785%2C1111.5838%2C1111.2635%2C1111.1058%2C1111.6742%2C1111.7186%2C1111.2508%2C1111.5162%2C1111.2737%2C1111.5599%2C1111.6809%2C1111.2639%2C1111.1520%2C1111.5356%2C1111.5275%2C1111.3305%2C1111.1094%2C1111.0621%2C1111.3709%2C1111.1152%2C1111.5408%2C1111.5569%2C1111.0824%2C1111.1999%2C1111.1126%2C1111.3390%2C1111.3777%2C1111.3628%2C1111.1692%2C1111.3952%2C1111.6198%2C1111.6754%2C1111.4257%2C1111.4117%2C1111.1428%2C1111.4377%2C1111.3959%2C1111.6473%2C1111.4364%2C1111.1421%2C1111.1106%2C1111.0763%2C1111.0947%2C1111.0565%2C1111.5204%2C1111.3926%2C1111.2753%2C1111.3552%2C1111.3066%2C1111.6899%2C1111.0263%2C1111.4788%2C1111.7187%2C1111.0272%2C1111.0017%2C1111.6468%2C1111.2898%2C1111.3617%2C1111.4203%2C1111.1790%2C1111.3605%2C1111.4426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A highly non-thermal electron distribution is generated when quantum Hall\nedge states originating from sources at different potentials meet at a quantum\npoint contact. The relaxation of this distribution to a stationary form as a\nfunction of distance downstream from the contact has been observed in recent\nexperiments [Phys. Rev. Lett. 105, 056803 (2010)]. Here we present an exact\ntreatment of a minimal model for the system at filling factor \\nu=2, with\nresults that account well for the observations."}, "authors": ["D. L. Kovrizhin", "J. T. Chalker"], "author_detail": {"name": "J. T. Chalker"}, "author": "J. T. Chalker", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.109.106403", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.3914v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.3914v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 6 figures, including 4 pages of supplementary material,\n  final version as published", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.3914v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.3914v2", "journal_reference": "Phys. Rev. Lett. 109, 106403 (2012)", "doi": "10.1103/PhysRevLett.109.106403", "fulltext": "Relaxation in driven integer quantum Hall edge states\n1\n\nD. L. Kovrizhin1 and J. T. Chalker2\nMax Planck Institute for the Physics of Complex Systems, Nöthnitzer str. 38, Dresden, D-01187, Germany and\n2\nTheoretical Physics, Oxford University, 1, Keble Road, Oxford, OX1 3NP, United Kingdom\n(Dated: November 9, 2018)\n\narXiv:1111.3914v2 [cond-mat.str-el] 10 Sep 2012\n\nA highly non-thermal electron distribution is generated when quantum Hall edge states originating from\nsources at different potentials meet at a quantum point contact. The relaxation of this distribution to a stationary\nform as a function of distance downstream from the contact has been observed in recent experiments [C. Altimiras et al. Phys. Rev. Lett. 105, 056803 (2010)]. Here we present an exact treatment of a minimal model for\nthe system at filling factor ν=2, with results that account well for the observations.\nPACS numbers: 71.10.Pm, 73.23.-b, 73.43.-f, 42.25.Hz\n\nIntroduction. The importance of understanding nonequilibrium dynamics and relaxation in many-body quantum\nsystems has been recognised since the early years of quantum mechanics [1, 2]. Settings in which such problems are of\nhigh current interest include, among others, cold atomic gases\n[2] and nanoscale electronic devices. [3–14] As a particular\nexample, recent experiments [3] on quantum Hall (QH) edge\nstates driven out of equilibrium at a quantum point contact\n(QPC) provide very detailed information on the approach to\na steady state in an electron system that appears to be wellisolated from other degrees of freedom. In this paper we describe the exact solution of a simple model for these experiments and compare our results with the measurements.\nIn outline, the experiments we are concerned with [3] involve two sets of integer QH edge states, which meet at a\nQPC. When a bias voltage is applied to the QPC, tunneling\nbetween the edge states generates a non-equilibrium electron\ndistribution. The form of this distribution in energy and its\nevolution as a function of distance downstream from the QPC\nare probed by monitoring the tunneling current from a point\non the edge, through a quantum dot that has an isolated level\nof controllable energy. Close to the QPC, the measured distribution has two steps, reflecting the different energies of Fermi\nsteps in each of the incident edges. With increasing distance\nfrom the QPC, the distribution relaxes to a single, broad step.\nThe theoretical challenge presented by these observations is\nto understand and model this relaxation process.\nThe relationship between these edge state experiments and\nother recent work on many-body quantum dynamics far from\nequilibrium has several aspects worth emphasising. First, in\nthe context of QH edge states, these are the most recent of\na series of striking observations of non-equilibrium effects in\ninterferometers [6] and in thermal transport [7]. They are also\nthe equivalent for a ballistic system of earlier studies [8] of local distributions in diffusive wires. Second, the measurements\nstand apart from earlier theory [13] and experiment [14] on\nnon-equilibrium transport between fractional QH edge states,\nbecause they probe local distribution functions, rather than\nthe global non-linear current-voltage characteristic. Third,\nand more broadly, the system studied is different in important ways from quantum impurity problems [9–12], as there is\nno impurity degree of freedom and interactions are not con-\n\nfined to an impurity site but instead operate in the ingoing\nand outgoing channels. Fourth, there is an analogy between\nedge state relaxation and cold atom experiments in the time\ndomain [2], since distance from the QPC translates roughly as\ntime, using the edge state velocity as a conversion factor. In\nthat sense the experiment we consider, probing relaxation as\nelectrons propagate, is equivalent to a quantum quench [15],\nin which time evolution is studied following a sudden change\nin the Hamiltonian. An important question in this context is\nwhether a system thermalises at long times. Since integrability is an obstacle to thermalisation, it is noteworthy that the\nconventional model [16] of a QH edge state as a chiral Luttinger liquid is an integrable one.\nAny attempt to model theoretically the experiments of\nRef. 3 starting from a chiral Luttinger liquid description faces\nan obvious difficulty, since interactions are most naturally described in terms of collective modes using bosonization, but\ntunnelling at the QPC is simple only in terms of fermionic\nvariables. In pioneering work, two alternative approaches\nhave been developed: one based on a Boltzmann-like equation\nfor the electron distribution [17]; and the other using a phenomenological model for the plasmon distribution generated\nat the QPC [18]. From [18], and from subsequent discussion\nof a quantum quench in an isolated QH edge (with an initial\nstate chosen to emulate the effects of a QPC) by the present\nauthors [19], a physical picture has emerged, in which relaxation is seen as a consequence of plasmon dispersion or the\npresence at ν = 2 of two plasmon modes with distinct velocities. In summary, an electron that tunnels at the QPC can be\nviewed as a superposition of plasmons. Dispersion or multiple\nplasmon velocities cause such a wavepacket to broaden as it\npropagates. The lengthscale for relaxation of the electron distribution downstream from the QPC is the distance at which\nthe width of this wavepacket is comparable to the characteristic separation between tunnelling electrons. The argument\nidentifies relevant scales but does not generate a prediction for\nthe electron distribution and its dependence on distance from\nthe QPC. One of our main aims here is to calculate this central\nquantity.\nAn overview of our treatment is as follows: we make key\nuse of the fact that, since experiments are at Landau level\nfilling factor ν=2, each QH edge carries two co-propagating\n\n\f2\n\nη,s\n\nand\nĤint = 2π~g\n\nXZ\nη\n\nρ̂η↑ (x)ρ̂η↓ (x) dx .\n\n(2)\n\nd\n\n2\n2\nn(E)\nE\n\neV\n\n1\n\n1\n\n-1\n\n(mV )\n\n4\n\n2\n\nmax\n\n(dIQD/dVG)/IQD\n\nchannels. Interactions mix excitations in different channels,\nand in the minimal model eigenmodes are charactised using two velocities. Our approach combines refermionisation\n[20, 21] with non-equilibrium bosonization methods [22–26]:\nby first bosonizing, then recombining bosons to form a new\nset of fermions, we transform the Hamiltonian for the interacting system into one for free particles. Under this transformation, the measured distribution (or more accurately, the\nspectral function probed by the tunnelling conductance) is expressed as a free-fermion determinant. This determinant has\na form similar to that appearing in the the theory [27, 28] of\nfull counting statistics [FCS], and related quantities appear in\na variety of other non-equilibrium problems [29]. Its numerical evaluation can be done accurately and efficiently, yielding\nthe results we present below. In addition, simple analytical expressions can be found for some quantities, and we give one\nfor the total energy in each channel as a function of distance\nfrom the QPC, thus providing a Hamiltonian derivation of a\nresult obtained previously in the phenomenological treatment\nof Ref. 18.\nThe work we set out here is related in a variety of ways to\nother studies of devices built from integer QH edge states. In\nparticular, experiments that revealed striking non-equilibrium\neffects in Mach Zehnder interferometers [6] have stimulated\nextensive theoretical research, [25, 30–37] including calculations [33] of interferometer dephasing based on the same\nbosonized model [16] for edge states at ν = 2 with contact\ninteractions that we adopt in the following. In the context\nof edge state relaxation a parallel development to the present\npaper, described in Ref. 26, is based on an approximation (involving a factorisation of bosonic correlators) that is expected\nto be accurate sufficiently far from the QPC. Our solution recovers such a factorisation, but only at distances large compared to the relaxation length for the model.\nModel. The experimental system is illustrated in the upper\npanels of Figs. 1 and 2: two alternative geometries arise, according to whether the tunnelling conductance is measured in\nthe same or the opposite channel to that coupled by the QPC.\nWe take a Hamiltonian with kinetic, interaction and tunneling terms, in the form Ĥ = Ĥkin + Ĥint + Ĥtun . Using\nthe labels η = 1, 2 to distinguish edges according to their\nsource, and s =↑, ↓ to differentiate between the two channels\non a given edge, the fermion creation operator at point x for\n†\nchannel η, s is ψ̂ηs\n(x). It obeys the standard anticommutation\n†\nrelation {ψ̂ηs (x)ψ̂η′ s′ (x′ )} = δss′ δηη′ δ(x − x′ ). The density\n†\noperator is ρ̂ηs (x) = ψ̂ηs\n(x)ψ̂ηs (x). Taking all four channels\nη, s to have the same bare velocity v, and assuming a contact\ninteraction of strength g between electrons in different channels on the same edge, we have [16]\nXZ\n†\n(1)\nψ̂ηs\n(x)∂x ψ̂ηs (x) dx\nĤkin = −i~v\n\n0\n0.8 μm\n2.2 μm\n4 μm\n10 μm\n30 μm\n\n-2\n0\nVG (mV)\n\n-0.5\n\n0.5\n\nFIG. 1: (Color online) Top: sketch of the experimental geometry\nin which the tunnelling conductance is measured in the same channel as that coupled by the QPC. Bottom: differential conductance\ncalculated (lines) and measured [3] (symbols) in this geometry at indicated distances from QPC. Fits use T = 44 mK, V = 30.3 μV\n(βeV = 8), and p = 0.545. Black lines: calculations (full) and data\n(dashed) for V =0.\n\nNote that short-range intrachannel interactions can simply be\nabsorbed into the value of v. Tunneling with amplitude tQPC\nat the QPC between channels 1↓ and 2↓ is described by\n†\n(0)ψ̂2↓ (0) + h.c. .\nĤtun = tQPC ψ̂1↓\n\n(3)\n\nA bias voltage V generates a chemical potential difference eV\nbetween incident electrons on edge 1 and those on edge 2.\nThe observable of interest is the tunnelling conductance as\na function of energy E and distance d > 0 from the QPC, in\nchannel 2, s. This is the Fourier transform of the correlator\n†\n(d)e−iĤτ /~ ψ̂2s (d)i,\nGs (d, τ ) = heiĤτ /~ ψ̂2s\n\n(4)\n\nwhere the average is taken in the non-equilibrium steady state,\nwith s=↓ in the geometry of Fig. 1 and s=↑ in that of Fig. 2.\nThe tunnelling conductance is determined by a measurement\nof the current IQD (E) through a quantum dot with a single\nlevel at energy E weakly coupled to the channel. With tunnelling amplitude tD to the dot, this is [19]\nZ\ne|tD |2\nIQD (E) =\nGs (d, τ )e−iEτ /~ dτ.\n(5)\n~2\nResults. We show in [38] that the Hamiltonian Ĥ can be\nbrought into a free particle form by introducing transformed\nfermion operators Ψ̂α (x) with index α = A± , S± and eigenmode velocities vα ≡ v± = v ± g. Using these new operators\nX Z\nĤ = −i~\nvα Ψ̂†α ∂x Ψ̂α dx\nα\n\n−[tQPC Ψ̂†A+ (0)Ψ̂A− (0) + h.c.] .\n\n(6)\n\n\f3\nMoreover the tunnelling conductance is obtained from\n(7)\n\nd\n\ncount electrons within the spatial intervals d ≤ y ≤ d + v± τ\non the channels A± .\nEquations (6) - (8) form the central results of this paper:\nthey express the observable of interest in an interacting, nonequilibrium system, in terms of the expectation value of a\nsingle-particle operator, evaluated as an average in a stationary scattering state of a single-particle Hamiltonian. We now\nuse these equations to discuss the physics of relaxation in this\nsystem and to calculate the tunnelling conductance.\nA simple physical picture of the relaxation process, and an\nidentification of relevant length scales, follows from the form\nof Eq. (7). This picture has the same content as our discussion\n(above and in Ref. 19) of relaxation arising from two plasmon\nvelocities, but is phrased in terms of the transformed fermions.\nNote first that the operators N̂± (d, τ ) count fermions that pass\nthrough the QPC in two time windows, both of duration τ , but\nwith a relative delay of d/veff , where\n(9)\n\nAt d = 0 the two windows exactly overlap. Then, for example, G↑ (0, τ ) acquires the same contribution from each\nfermion inside the window, regardless of tunneling. In consequence, and as expected, the electron distribution at d = 0\nin the ↑ channel is unaffected by tunneling, since the QPC\ncouples ↓ channels. (Conversely, it is clear that G↓ (d, τ ) is\naffected by tunnelling even for d → 0, since it depends on\nthe difference and not the sum of the fermion numbers in\nthe two windows). Far downstream from the QPC, by contrast, d/veff ≫ τ , the two windows are widely separated in\ntime, and the fermion numbers in each are uncorrelated. In\nthis case, the right side of Eq. (7) is the product of independent factors, each with the form of a FCS generating function\n[27, 28]. At large d the tunnelling conductance is the same\nin both channels. It matches exactly the result obtained previously [19] by considering a quantum quench, with the important consequence that even the limiting distribution far from\nthe QPC is non-thermal, although deviations from a FermiDirac form are small. [19] The velocity veff can be combined\nwith voltage V or temperature T to define two lengths:\nlV = ~veff /e|V | and lT = ~veff /2πkB T.\n\nn(E)\nE\n\n(10)\n\nThese set the scale for relaxation, and diverge in the noninteracting limit.\n\n1 1\n\n-1\n\n(mV )\n\n2\n\nmax\n\nwhere upper sign is taken in the first term of the exponent for\ns= ↑ and the lower sign for s= ↓. This expectation value is\ntaken in the stationary scattering state of Ĥ specified by the\ntemperature and chemical potentials of incident channels, and\nthe operators\nZ d+v± τ\nN̂α (d, τ ) =\nΨ̂†α (y)Ψ̂α (y)dy\n(8)\n\n1/veff = 1/v − − 1/v + = 2g/(v 2 + g 2 ).\n\n2\n2\n\neV\n\n(dIQD/dVG)/IQD\n\nGs (d, τ ) ∝ he−iπ[±N̂A− (d,τ )+N̂A+ (d,τ )]i ,\n\nd\n\n0\n\n2.2 μm\n4 μm\n10 μm\n\n-2\n\n-4\n-0.5\n\n0\nVG(mV)\n\n0.5\n\nFIG. 2: (Color online) Top: sketch of the experimental geometry in\nwhich the tunneling conductance is measured in the opposite channel\nto that coupled by the QPC. Bottom: differential conductance calculated (lines) and measured [3] (symbols) in this geometry at indicated\ndistances from the QPC. Fits use T = 44 mK, V = 45.5 μV, and\np = 0.545. Black lines: calculations (full) and data (dashed) for\nV = 0.\n\nDetailed comparison of our results with the measurements\nof Ref. 3 requires an evaluation of the tunnelling conductance\nat general d. For this we compute Gs (d, τ ) from Eq. (7) as\nsummarised in [38]. The outcome is shown for the two alternative geometries in Figs. 1 and 2. The theoretical curves\nmatch the data well, except for the smallest value of d in\nFig. 1. Four parameters enter the calculations: veff , T , V and\nthe tunneling probability p at the QPC. In addition, one further\nparameter is needed to set the energy scale for the data: the\ngate voltage-to-energy lever arm ηG (defined in Ref. 3, supplemental material). Of these parameters, only veff is unconstrained by independent measurements. We arrive at the fits in\nFigs. 1 and 2 as follows. We fix ηG = 0.062 and p ≃ 0.5 (consistent with the values determined in Refs. 3 and 4) and obtain\nthe bath temperature T = 44 mK (close to the experimental\nvalue of T = 40 mK) by fitting data at zero bias voltage to a\nthermal Fermi-Dirac distribution. We then compare numerical results at large d with data measured in the ↓ channel at the\nmaximum distance from the QPC (30 μm). We obtain a good\nfit at βeV = 8, and use this value for computations shown\nin Fig. 1 at all other d. Finally, we fix the interaction scale\nveff by fitting data at one intermediate distance (4 μm). The\ntheoretical predictions at other distances are then fully determined. (Our specific value for p [0.545 rather than 0.500] is\nsignificant for the fit only at intermediate d and small energy.)\nData for the geometry of Fig. 2 were taken using a different\nbias voltage from that in Fig. 1 and we calculate the theoretical\ncurves shown in Fig. 2 using the same values of ηG , T and veff\nas for Fig. 1, but scaling the value of βeV by the ratio of ex-\n\n\f4\nperimental voltages. Both values of βeV are 25% lower than\nthe experimental ones, and this discrepancy is consistent with\nthe 'missing energy' reported in Ref. 3. Possible interpretations of this discrepancy include loss of energy at the QPC\nor the existence of additional, neutral edge modes,[3, 17, 18]\nor invoke [19, 26] the distinction in an interacting system between the measured spectral function and the electron distribution in energy. The fact that we obtain good fits to all data\nexcept that in Fig. 1 for the smallest d suggests that, if energy\nis lost from the edge modes in the experimental system, this\nprobably happens very close to the QPC. The most significant\noutcome from this fitting process is a value for the interaction\nparameter: veff = 6.5 × 104 ms−1 . A roughly comparable\nresult (veff = 105 ms−1 ) was obtained from the same data in\nRef.18, but we believe our fitting procedure is more precise.\nBoth determinations are in the range measured for edge state\nvelocities in gated samples.[3]\nAn additional quantity of interest is the energy density\nεs (d) in channel s: it characterises with a single value the\nelectron distribution [3]. Moreover, we can evaluate it explicitly from Eq. (7) because (see Ref. 19) it is proportional\nto ∂τ G± (d, τ )|τ =0 and G± (d, τ ) has an expansion for small\nτ in cumulants of N̂± (d, τ ). Interactions cause energy exchange between channels, so that εs (d) evolves with d. We\nobtain\n\u0015\n\u0014\nl2 sin2 d/2lV\nεV\n.\n(11)\n1∓ V\nε± (d) = εT +\n2\n2\nlT\nsinh2 d/2lT\nHere εV ≡ p(1 − p)eV /4π~v is the excess energy in a single\nchannel due to a double-step electron distribution generated\nby a QPC with tunneling probability p. Eq. (11), derived using\na different approach in Ref. 18, shows that the energy densities\ninterpolate between values just after the QPC of ε− (0) = εT +\nεV and ε+ (0) = εT , and values at large d of ε± (d) = εT +\nεV /2. The relaxation length is set by the smaller of lT and\nlV . This relaxation is oscillatory, but oscillations are strongly\nsuppressed if eV ≪ kB T .\nDetails of calculations are given in Supplementary Material\n[38]. We thank F. Pierre for extensive discussions and for providing access to the data of Ref. 3. The work was supported\nin part by EPSRC grant EP/I032487/1.\n\n[1] J. von Neumann, Z. Phys. 57, 30 (1929), available in a translation\nby R. Tumulka as: European Phys. J. H 35, 201 (2010).\n[2] A. Polkovnikov, K. Sengupta, A. Silva, and M. Vengalattore,\nRev. Mod. Phys. 83, 863 (2011).\n[3] H. le Sueur, C. Altimiras, U. Gennser, A. Cavanna, D. Mailly,\nF. Pierre, Phys. Rev. Lett. 105, 056803 (2010).\n[4] C. Altimiras, H. le Sueur, U. Gennser, A. Cavanna, D. Mailly\nand F. Pierre, Nature Physics 6, 34 (2009).\n[5] C. Altimiras, H. le Sueur, U. Gennser, A. Cavanna, D. Mailly,\nF. Pierre, Phys. Rev. Lett. 105, 226804 (2010).\n\n[6] I. Neder, M. Heiblum, Y. Levinson, D. Mahalu, and V. Umansky,\nPhys. Rev. Lett. 96, 016804, (2006).\n[7] G. Granger, J. P. Eisenstein, and J. L. Reno, Phys. Rev. Lett. 102,\n086803 (2009).\n[8] H. Pothier, S. Gužron, N. O. Birge, D. Esteve, and M. H. Devoret,\nPhys. Rev. Lett. 79, 3490-3493 (1997).\n[9] Y. Meir, N. S. Wingreen, and P. A. Lee, Phys. Rev. Lett. 70, 2601\n(1993).\n[10] R. M. Konik, H. Saleur, and A. Ludwig, Phys. Rev. B 66,\n125304 (2002).\n[11] P. Mehta and N. Andrei, Phys. Rev. Lett. 96, 216802 (2006).\n[12] S. De Franceschi et al., Phys. Rev. Lett. 89, 156801 (2002).\n[13] P. Fendley, A. W. W. Ludwig, and H. Saleur Phys. Rev. Lett.\n74, 3005 (1995).\n[14] A. M. Chang, Rev. Mod. Phys. 75, 1449 (2003).\n[15] P. Calabrese and J. Cardy, Phys. Rev. Lett. 96, 136801 (2006).\n[16] X. G. Wen, Phys. Rev. Lett. 64, 2206 (1990); Phys. Rev. B 43,\n11025 (1991).\n[17] A. M. Lunde, S. E. Nigg, and M. Büttiker, Phys. Rev. B 81,\n041311(R) (2010).\n[18] P. Degiovanni, C. Grenier, G. Fève, C. Altimiras, H. le Sueur,\nF. Pierre, Phys. Rev. B 81, 121302(R) (2010).\n[19] D. L. Kovrizhin and J. T. Chalker, Phys. Rev. B 84, 085105\n(2011).\n[20] M. Fabrizio and A. Parola, Phys. Rev. Lett. 70, 226 (1993).\n[21] J. von Delft, G. Zarand and M. Fabrizio, Phys Rev. Lett, 81,\n196 (1998); G. Zarand and J. von Delft, Phys. Rev. B, 61, 6918\n(2000); arXiv:cond-mat/9812182.\n[22] M.A. Cazalilla, Phys. Rev. Lett. 97, 156403 (2006).\n[23] D. B. Gutman, Y. Gefen, and A. D. Mirlin, Phys. Rev. Lett. 101,\n126802 (2008); Phys. Rev. B 81, 085436 (2010).\n[24] I. P. Levkivskyi and E. V. Sukhorukov, Phys. Rev. Lett. 103,\n036801 (2009).\n[25] D. L. Kovrizhin and J. T. Chalker, Phys. Rev. B 80, 161306(R)\n(2009); Phys. Rev. B 81, 155318 (2010).\n[26] I. P. Levkivskyi and E. V. Sukhorukov, Phys. Rev. B 85, 075309\n(2012).\n[27] L. S. Levitov and G. B. Lesovik, JETP Lett. 58, 230 (1993); L.\nS. Levitov in Quantum Noise in Mesoscopic Systems, ed. Yu. V.\nNazarov (Kluwer, Amsterdam, 2003); I. Klich ibid.\n[28] D. A. Abanin and L. S. Levitov, Phys. Rev. Lett. 94, 186803\n(2005).\n[29] D. B. Gutman, Yuval Gefen and A. D. Mirlin, J. Phys. A\n44, 165003 (2011); A. Abanov, D. A. Ivanov, and Y. Qian,\narXiv:1108.1355.\n[30] I. Neder, F. Marquardt, M. Heiblum, D. Mahalu and V. Umansky, Nature Physics, 3, 534 (2007).\n[31] J. T. Chalker, Y. Gefen, and M. Y. Veillette, Phys. Rev. B 76,\n085320 (2007).\n[32] E. V. Sukhorukov and V. V. Cheianov, Phys. Rev. Lett. 99,\n156801 (2007).\n[33] I. P. Levkivskyi and E. V. Sukhorukov, Phys. Rev. B 78, 045322\n(2008).\n[34] I. Neder and E. Ginossar, Phys. Rev. Lett. 100, 196806 (2008).\n[35] S.-C. Youn, H.-W. Lee, and H.-S. Sim, Phys. Rev. Lett. 100\n196807 (2008).\n[36] M. Schneider, D. Bagrets and A. Mirlin, Phys. Rev. B 84,\n075401 (2011).\n[37] I. Neder, Phys. Rev. Lett. 108, 186404 (2012).\n[38] Supplementary Material.\n\n\f5\nSUPPLEMENTARY MATERIAL\n\nMODEL\n\nWe take a Hamiltonian with kinetic, interaction and tunnelling terms, in the form Ĥ = Ĥkin + Ĥint + Ĥtun . Using the labels η = 1, 2 to distinguish edges according to\ntheir source, and s =↑, ↓ to differentiate between the two\nchannels on a given edge, the fermion creation operator at\n†\npoint x for channel η, s is ψ̂ηs\n(x). The density operator is\n†\nρ̂ηs (x) = ψ̂ηs (x)ψ̂ηs (x). Taking all four channels η, s to have\nthe same bare velocity v, and assuming a contact interaction\nof strength g between electrons in different channels on the\nsame edge, we have [1]\nXZ\n†\n(12)\nψ̂ηs\n(x)∂x ψ̂ηs (x) dx\nĤkin = −i~v\nη,s\n\nand\n\nwhere, as usual, a is a short-distance cut-off, N̂ηs is the\nfermion number operator, and L is the length of the edge.\nAfter bosonization, the combination Ĥkin + Ĥint is diagonalized by a rotation to new bosonic fields χ̂α , where\n(χ̂S+ χ̂A− χ̂A+ χ̂S− )T = U (φ̂1↑ φ̂1↓ φ̂2↓ φ̂2↑ )T and\n\n\n1 1 1 1\n1  1 −1 1 −1 \n.\n(18)\nU= \n2  1 1 −1 −1 \n1 −1 −1 1\nNext we use the fields χ̂α to define new fermion operators[4,\n5] Ψ̂α . Crucially, besides diagonalising Ĥkin + Ĥint , the transformations ensure that Ĥtun remains a single-particle operator\nwhen expressed in terms of Ψ̂α . Specifically, after bosonization\n†\nF̂2↓ ei[φ̂1↓ (0)−φ̂2↓ (0)] + h.c.,\nĤtun = tQPC F̂1↓\n\nĤint = 2π~g\n\nXZ\n\nρ̂η↑ (x)ρ̂η↓ (x) dx .\n\n(13)\n\nη\n\nTunneling with amplitude tQPC at the QPC between channels\n1↓ and 2↓ is described by\n†\n(0)ψ̂2↓ (0) + h.c. .\nĤtun = tQPC ψ̂1↓\n\n(14)\n\nA bias voltage V generates a chemical potential difference eV\nbetween incident electrons on edge 1 and those on edge 2.\nThe observable of interest is the tunnelling conductance as\na function of energy E and distance d > 0 from the QPC, in\nchannel 2, s. This is the Fourier transform of the correlator\n†\n(d)e−iĤτ /~ ψ̂2s (d)i,\nGs (d, τ ) = heiĤτ /~ ψ̂2s\n\n(15)\n\nwhere the average is taken in the non-equilibrium steady state.\nThe tunnelling conductance is determined by a measurement\nof the current IQD (E) through a quantum dot with a single\nlevel at energy E weakly coupled to the channel. With tunnelling amplitude tD to the dot, this is [2]\nZ\ne|tD |2\nGs (d, τ )e−iEτ /~ dτ.\n(16)\nIQD (E) =\n~2\nREFERMIONIZATION\n\nThe steps required to derive Eqns. (6) - (8) of the main text\nare as follows. First we bosonize the Hamiltonian in the standard way [3], introducing bosonic fields φ̂ηs (x) with commutation relations [φ̂ηs (x), ∂y φ̂ηs′ (x′ )] = −2πiδηη′ δss′ δ(x−\nx′ ), and Klein factors F̂ηs , and representing the fermion operators via the relation\n2π\n\nψ̂ηs (x) = (2πa)−1/2 F̂ηs ei L N̂ηs e−iφ̂ηs (x) ,\n\n(17)\n\n(19)\n\nwhile under rotation φ̂1↓ (0) − φ̂2↓ (0) = χ̂A+ (0) − χ̂A− (0).\nSince χ̂A± (0) appear in this expression with unit coefficients,\nwe can introduce new Klein factors F̂α and new fermion fields\nΨα ∼ F̂α e−iχ̂α to obtain the expression for Ĥ displayed\nin Eq. (6) of the main text. The required transformation of\nKlein factors has been given previously in the context of a\ntwo-channel Kondo model:[5] since fermion number operators should transform following Eq. (18), we require\n†\nF̂S†− F̂A† − = F̂1↑\nF̂1↓ ,\n\n†\nF̂S− F̂A† − = F̂2↓\nF̂2↑ ,\n\n†\nF̂2↓ ,\nF̂S†− F̂A† + = F̂1↑\n\n†\n†\nF̂2↓\n.\nF̂S†+ F̂A† − = F̂1↑\n\n(20)\n\nThis implies that the combination appearing in Ĥtun has the\n†\ntransformation F̂1↓\nF̂2↓ = −F̂A† + F̂A− . Note that a unit change\nin the occupation number of one of the new fermions results\nin changes of one half for the occupation numbers of the original fermions. Physical states in the new basis must therefore\nsatisfy certain selection rules, to ensure that fermion occupation numbers in the original basis are integer. These selection\nrules are set out in Ref. 5. For our purposes the key point is\nthat Ĥtun does not connect the physical and unphysical sectors, because the new fermion operators appear in it in pairs.\nWe can also transform in this way the operators that are required to generate an incident state with a density difference\n†\n†\n†\n†\nF̂2↑\n=\nbetween channels. Since F̂1↑\nF̂1↓\n= F̂A† + F̂S†+ and F̂2↓\nF̂A+ F̂S†+ , a bias voltage V between channels 1 and 2 is represented by setting the chemical potential to be eV in channel\nA+ and zero in channels A− and S± .\nThe task now is to evaluate the correlation function\nGs (d, t). For this it is convenient to work in the interaction representation, with Ĥtun as the 'interaction' and Ĥ0 ≡\nĤkin + Ĥint , using a superscript I to indicate operators in this\nrepresentation: AI (t) = eiĤ0 t Ae−iĤ0 t . Time evolution of\n\n\f6\nthe new bosonic and fermionic fields fields is simple in this\npicture: we have\nχ̂IA± (x, t) = χ̂A± (x − v± t) ,\n\nwhere the signs ± correspond to the choices s =↑, ↓. Since\nŜ I (t) transforms only the channels A± and not S±, we can\nextract a normalisation factor to arrive at\n\nΨ̂IA± (x, t) = Ψ̂A± (x − v± t) ,\n\nGs (d, τ ) = G0 (τ )\n\nI\nand similarly for χ̂IS± (x, t) and ψ̂S±\n(x, t).\nThe time evolution operator in the interaction representation is\n\u0014\n\u0015\nZ\ni t\nI\nŜ I (t) = exp −\nĤtun\n(τ )dτ ,\n(21)\n~ −∞\n\n(the usual time-ordering is not required here because\nI\nI\n[Ĥtun\n(t1 ), Ĥtun\n(t2 )] = 0 for all t1 and t2 ). Scattering states\nare generated by the action of Ŝ I (t): Eq. (15) takes the form\nGs (d, τ ) = hQi0 , where\nI\nI\n(d, 0)Ŝ I (0)\nQ ≡ [Ŝ I (τ )]† [ψ̂2s\n(d, τ )]† Ŝ I (τ )[Ŝ I (0)]† ψ̂2s\n\nand h. . .i0 denotes a conventional thermal average, with\nHamiltonian Ĥ0 and chemical potentials μ1 and μ2 on the two\nedges, defined by\no\nn\n(22)\nh. . . i0 = Z −1 Tr e−β(Ĥ0 −μ1 N̂1 −μ2 N̂2 ) . . . ,\nwhere Z = Tr{e−β(Ĥ0 −μ1 N̂1 −μ2 N̂2 ) } and N̂1 ≡ N̂1↑ + N̂1↓ ,\nthe number operator for edge 1 (and correspondingly for N̂2 ).\nWe now describe how the quantity Q may be simplified.\nFirst, by a straightforward though lengthy calculation one can\nshow that\nI\nI\n(d, t2 )] = 0 for t1 ∈\n/ [t2 −d/v+ , t2 −d/v− ] .\n(t1 ), ψ̂2s\n[Ĥtun\n\nNext, we insert [Ŝ I (∞)]† Ŝ I (∞) between the factors of Ŝ I (τ )\nand [Ŝ I (0)]† in our expression for Q. We then commute\nŜ I (τ )[Ŝ I (∞)]† to the left, and Ŝ I (∞)[Ŝ I (0)]† to the right,\nto obtain\nI\nI\n(d, 0)Ŝ I (∞) .\nQ = [Ŝ I (∞)]† [ψ̂2s\n(d, τ )]† ψ̂2s\n\nwhere h. . .i ≡ h[Ŝ I (∞)]† . . . Ŝ I (∞)i0 and\n†\nG0 (τ ) ≡ hψ̂2s\n(d, τ )ψ̂2s (d, 0)i0\n1\ni\n=\n1 ×\n1\nπ\n2β~(v+ v− ) 2\nsinh 2 [ β~v+ (−v+ τ + ia)]\n\n×\n\n1\nsinh\n\n1\n2\n\nπ\n[ β~v\n(−v− τ\n−\n\n+ ia)]\n\n.\n\n(25)\n\nA final step is to consider the effect of the evolution operators [Ŝ I (∞)]† and Ŝ I (∞) on the basis states in which the expectation value is calculated. As these states are generated by\nthe action of the operators Ψ̂A± (x) on the vacuum, we must\nfind how these operators transform. We do this by solving the\nSchrödinger equation with the Hamiltonian of Eq. (6) of the\nmain text. The solution involves the scattering amplitudes at\n√\nthe QPC: introducing θ = tQPC /~ v+ v− , the tunnelling and\nreflection probabilities are sin2 θ and cos2 θ, while\n[Ŝ I (∞)]† Ψ̂A+ (x)Ŝ I (∞) =\ncos θ Ψ̂A+ (x) − i sin θ [v− /v+ ]\n\n1/2\n\nΨ̂†A− (v− x/v+ )\n\n(26)\n\nand\n[Ŝ I (∞)]† Ψ̂A− (x)Ŝ I (∞) =\ncos θ Ψ̂A− (x) − i sin θ [v+ /v− ]\n\n1/2\n\nΨ̂†A+ (v+ x/v− ) . (27)\n\nHence the average h. . . i in a scattering state is evaluated by\ncombining the rotation between channels defined in Eqns. (26)\nand (27) with the thermal average h. . .i0 .\nNUMERICAL EVALUATION OF THE TUNNELLING\nCONDUCTANCE\n\nI\n\n2π\n\nI\n\nI\nI\n(d, 0) = (2πa)−1 eiφ̂2s (d,τ ) e−i L N̂2s (τ )\n[ψ̂2s\n(d, τ )]† ψ̂2s\nI\ni 2π\nL N̂2s (0)\n\ne\n\n−iφI2s (d,0)\n\n.\n\nRotating to the new fields and using\nχ̂Iα (d, 0) − χ̂Iα (d, τ ) +\n\n(24)\n\n(23)\n\nBosonizing using Eq. (17) we have\n\nI\nI\n× [F̂2s\n(τ )]† F̂2s\n(0)e\n\nhe−iπ[NA+ (d,τ )±NA− (d,τ )]i\nhe−iπ[NA+ (d,τ )±NA− (d,τ )] i0\n\n2π I\n[N̂ (τ ) − N̂αI (0)] = 2π N̂α (d, τ )\nL α\n\nwith N̂α (d, τ ) defined in Eq. (8) of the main text, and setting\nI\nμ2 = 0 so that F̂2s\n(τ ) = F̂2s , we find\nI\nI\n(d, 0) =\n[ψ̂2s\n(d, τ )]† ψ̂2s\n\n(2πa)−1 e−iπ[(NA+ (d,τ )±NA− (d,τ ))−(NS+(d,τ )±NS− (d,τ )]\n\nIn the following we outline the methods we use for numerical evaluation of the correlation function defined in Eq. (7)\nof the main text, and hence the differential tunnelling conductance shown in Figs. 1 and 2 of the main text. The central\nproblem is to evaluate the normalised expectation value appearing on the right hand side of Eq. (24), which has the form\nhXinorm ≡ hXi/hXi0\n\n(28)\n\nwith X = e−iπ[NA+ (d,τ )±NA− (d,τ )]. In the limit of large distance d from the QPC, contributions to the two time windows\nappearing in the exponent in X are independent and it is convenient to use the approach described in Ref. 6. At finite d\nthere is no such factorisation and we resort instead to a method\n\n\f7\n1\n\nsimilar to one described in Ref.2, appropriately modified to\ntake account of finite temperature.\n(i) Long distance limit. At large d the expectation value\nfactorizes into a product of two functions, each of which count\nnumber of particles in a fixed time window, so that\n\n0.6\n\n|χ± (π, τ )|2\n\nhe−iπ[NA+ (d,τ )±NA− (d,τ )]inorm = χ− (∓π, τ )χ+ (−π, τ )\n\n0.8\n\n0.4\n\nwith\nχ± (δ, τ ) = heiδN̂± (d,τ ) inorm .\n\n0.2\n\n(29)\n\nThe functions χ± (δ, τ ) have a FCS form and can be written\nin terms of determinants for non-interacting fermions. One\nhas[7]\ni = det{[1 − P̂ (e\n\n−iδ\n\n− 1)n̂± (ε)P̂ ]} .\n\n(30)\n\nHere n± (ε) is the corresponding electron energy distribution\nin a given channel at finite temperature and bias voltage after\nthe action of Ŝ I (∞) (i.e. a double-step) while P̂ is a projection operator that is diagonal in the time domain, having the\naction on a time-dependent function y(t): P̂ y(t) = y(t) if\nt ∈ [0, τ ] and P̂ y(t) = 0 otherwise. Using the regularization\nprocedure proposed in Ref. 6 we can write the determinant\n(30) in the form\nheiδN̂± (τ ) i = det[f (ti − tj )] ,\n\n(31)\n\nwhere the function f (t) is defined as a Fourier transform of\nδ ε\nf ̃(ε) = [1 − n± (ε)(e−iδ − 1)]e−i 2 Λ ,\n\n(32)\n\nwhich is periodic in the domain [−Λ, Λ], with Λ a high energy\ncutoff on single-particle states and tj = jπ/Λ. Note that the\nδ ε\nphase factor e−i 2 Λ appearing here is crucial, since without it\none would wrongly obtain a result periodic in δ.\nThe normalisation heiδN̂± (d,τ ) i0 is obtained from similar\nexpressions in which the non-equilibrium distribution n± (ε)\nis replaced by a thermal one, and in practice we evaluate directly the ratio χ± (δ, τ ). We check numerical convergence\nby changing the value of the cutoff Λ. The size of the matrices required grows linearly with τ , the largest necessary being\n2000 × 2000. Some results obtained using this approach are\nshown in Figs. 3 and 4. The numerical calculations can be\ntested at large τ by comparison with the asymptotic analytic\nresults derived in Ref. 6: as shown in Fig. 3 the agreement\nis excellent. An incidental by-product of our calculations is\nthe discovery of an interesting new feature of the asymptotic\nbehaviour. According to Ref. 6 this is exponential in τ , with\na rate that diverges for δ = π and p = 1/2. In fact we find\nnumerically that decay at these parameter values is not exponential but Gaussian in τ . It would be interesting to search for\nan analytical derivation of that form.\n(ii) Finite distance. At finite distance d the correlation function Gs (d, τ ) is not simply a product of independent contributions from the two channels A±, and so cannot be expressed\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\neV τ /2π v\n\nFIG. 3: The quantity |χ± (π, τ )|2 [see Eq. (29)] as a function of time\nτ for different values of parameter βeV at tunneling probability p =\n0.5 Thick solid line: βeV = 2; dashed line: βeV = 5; dot-dashed\nline: βeV = 10; circles: βeV = 100. Thin solid line corresponds\nto asymptotic behaviour at large βeV , which is represented within\n1 2 2\nnumerical errors by the function exp[− 12\nπ τ (kB Tds )2 /~2 ].\n0\n\n-5\n\nL g|χ± (π, τ)|2\n\nhe\n\niδ N̂± (d,τ )\n\n0\n\n-10\n\n-15\n\n-20\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\neV τ /2π v\n\nFIG. 4: (Color online). Comparison of the asymptotic behaviour of\n|χ± (π, τ )|2 [see Eq. (29)] from Ref.6, (solid lines) with results obtained numerically using Eq. (31) (dashed lines), at tunneling probability p = 0.5 for different values of δ. From top right to bottom left:\nred lines δ = π/2, green lines (δ = 3π/4), blue lines (δ = π − 0.1)\nand violet lines (δ = π − 0.01).\n\nin terms of quantities familiar from the theory of FCS. We require instead a different numerical approach. Using Levitov's\ndeterminant formula [7], we have\nh[Ŝ I (∞)]† e−iπ[NA+ (d,τ )±NA− (d,τ )]Ŝ I (∞)i0\n\n= det[1−n(ε)[[Ŝ(∞)]† e−iπ[±N̂A− (d,τ )+N̂A+ (d,τ )]Ŝ I (∞)−1].\nHere the determinant is in the two-channel Fock space and\nn(ε) is a Fermi-Dirac distribution in each channel, but with\ntwo distinct chemical potentials. To evaluate this determinant\nwe express N̂A± (d, τ ) as bilinears in the fermion creation\nand annihilation operators Ψ̂†A± (x) and Ψ̂A± (x). We evaluate this determinant in a basis of eigenstates of Ĥkin , con-\n\n\f8\n\nhe−iπ[NA+ (d,τ )−NA− (d,τ )]inorm\n\n1\n\n0.5\n\n0\n\n-0.5\n\n-1\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\neV τ /2π v\n\nFIG. 5:\nTime dependence of the normalised correlator\nhe−iπ[NA+ (d,τ )−NA− (d,τ )] inorm for the same channel as that\ncoupled by the QPC. Curves are for tunnelling probability p = 1/2,\neV /kB T = 5 and different distances d from the QPC: (thin solid\nline) d/lv = 0; (dashed line) d/lv = 2.5; (dotted line) d/lv = 5;\n(dot-dashed line) d/lv = 10; and (thick solid line) x/lv = 20.\n\nsidering edges of finite length with periodic boundary conditions and imposing energy cut-offs to obtain a matrix of finite\nsize. For adequate convergence with increasing system size,\nwe find that it is necessary to scale the lengths L± of the two\nchannels according to the velocity, setting v+ /L+ = v− /L− .\nWith this choice, a basis of a few thousand states is sufficient\nto obtain the results we present here.\nWe show representative results for the normalised correlator he−iπ[NA+ (d,τ )±NA− (d,τ )]inorm at finite d in Figs. 5 and\n6. The most distinctive feature is an oscillatory time dependence of the correlator in the channel that is coupled by the\nQPC, which at d = 0 and T = 0 can be obtained exactly as\nhe−iπ[NA+ (0,τ )±NA− (0,τ )] inorm = cos( 12 eV τ /2π~).\n\nhe−iπ[NA+ (d,τ )+NA− (d,τ )]inorm\n\n1.25\n\n1\n\n0.75\n\n0.5\n\n0.25\n\n0\n\n0\n\n1\n\n2\n\n3\n\n4\n\neV τ /2π v\n\nFIG. 6:\nTime dependence of the normalised correlator\nhe−iπ[NA+ (d,τ )+NA− (d,τ )] inorm for the channel not coupled\nby the QPC. Other parameters as for Fig. 5.\n\n[1] X. G. Wen, Phys. Rev. Lett. 64, 2206 (1990); Phys. Rev. B 43,\n11025 (1991).\n[2] D. L. Kovrizhin and J. T. Chalker, Phys. Rev. B 84, 085105\n(2011).\n[3] See: J. von Delft and H. Schoeller, Annalen Phys. 7 225 (1998);\nT. Giamarchi, Quantum Physics in One Dimension (Oxford\nUniv. Press, Oxford, 2004).\n[4] M. Fabrizio and A. Parola, Phys. Rev. Lett. 70, 226 (1993).\n[5] J. von Delft, G. Zarand and M. Fabrizio, Phys Rev. Lett, 81,\n196 (1998); G. Zarand and J. von Delft, Phys. Rev. B, 61, 6918\n(2000); arXiv:cond-mat/9812182.\n[6] D. B. Gutman, Yuval Gefen and A. D. Mirlin, J. Phys. A\n44, 165003 (2011); A. Abanov, D. A. Ivanov, and Y. Qian,\narXiv:1108.1355.\n[7] L. S. Levitov and G. B. Lesovik, JETP Lett. 58, 230 (1993); L.\nS. Levitov in Quantum Noise in Mesoscopic Systems, ed. Yu. V.\nNazarov (Kluwer, Amsterdam, 2003); I. Klich ibid.\n\n\f"}