{"id": "http://arxiv.org/abs/1103.2393v1", "guidislink": true, "updated": "2011-03-11T22:45:47Z", "updated_parsed": [2011, 3, 11, 22, 45, 47, 4, 70, 0], "published": "2011-03-11T22:45:47Z", "published_parsed": [2011, 3, 11, 22, 45, 47, 4, 70, 0], "title": "Quantum coherent negative bend resistance in InSb mesoscopic structures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.5580%2C1103.6066%2C1103.5480%2C1103.1662%2C1103.0630%2C1103.1824%2C1103.0331%2C1103.0030%2C1103.1247%2C1103.3287%2C1103.0513%2C1103.5731%2C1103.2841%2C1103.3808%2C1103.3746%2C1103.0291%2C1103.1456%2C1103.0522%2C1103.2805%2C1103.5459%2C1103.5777%2C1103.5017%2C1103.6048%2C1103.5725%2C1103.1919%2C1103.5677%2C1103.4104%2C1103.0850%2C1103.4992%2C1103.1235%2C1103.1423%2C1103.5656%2C1103.3451%2C1103.0375%2C1103.0010%2C1103.3132%2C1103.4945%2C1103.0329%2C1103.0090%2C1103.5904%2C1103.1360%2C1103.4089%2C1103.4655%2C1103.3841%2C1103.1655%2C1103.1142%2C1103.6275%2C1103.3984%2C1103.5124%2C1103.2227%2C1103.5864%2C1103.2975%2C1103.0322%2C1103.2412%2C1103.2959%2C1103.5664%2C1103.0503%2C1103.4720%2C1103.3692%2C1103.0809%2C1103.1153%2C1103.1016%2C1103.0733%2C1103.2743%2C1103.2034%2C1103.5097%2C1103.0479%2C1103.4932%2C1103.0651%2C1103.3341%2C1103.5817%2C1103.1183%2C1103.5089%2C1103.2403%2C1103.4184%2C1103.5898%2C1103.3752%2C1103.3981%2C1103.5657%2C1103.4773%2C1103.2475%2C1103.5068%2C1103.2411%2C1103.5836%2C1103.6208%2C1103.2225%2C1103.2663%2C1103.5062%2C1103.5633%2C1103.2554%2C1103.1365%2C1103.2479%2C1103.1468%2C1103.4196%2C1103.3902%2C1103.4677%2C1103.3794%2C1103.0022%2C1103.2393%2C1103.2170%2C1103.1588&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum coherent negative bend resistance in InSb mesoscopic structures"}, "summary": "Transport measurements were made on four-terminal devices fabricated from\nInSb/Al_xIn_(1-x)Sb quantum well structures at temperatures from 1.5 to 300K.\nNegative bend resistance, which is characteristic of ballistic transport, was\nobserved in devices of channel widths 0.2 or 0.5 {\\mu}m. We have improved upon\nthe existing implementations of R-matrix theory in device physics by\nintroducing boundary conditions that dramatically speed convergence. By\ncomparison with R-matrix calculations, we show that the experimental\nobservations are consistent with quantum coherent transport.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.5580%2C1103.6066%2C1103.5480%2C1103.1662%2C1103.0630%2C1103.1824%2C1103.0331%2C1103.0030%2C1103.1247%2C1103.3287%2C1103.0513%2C1103.5731%2C1103.2841%2C1103.3808%2C1103.3746%2C1103.0291%2C1103.1456%2C1103.0522%2C1103.2805%2C1103.5459%2C1103.5777%2C1103.5017%2C1103.6048%2C1103.5725%2C1103.1919%2C1103.5677%2C1103.4104%2C1103.0850%2C1103.4992%2C1103.1235%2C1103.1423%2C1103.5656%2C1103.3451%2C1103.0375%2C1103.0010%2C1103.3132%2C1103.4945%2C1103.0329%2C1103.0090%2C1103.5904%2C1103.1360%2C1103.4089%2C1103.4655%2C1103.3841%2C1103.1655%2C1103.1142%2C1103.6275%2C1103.3984%2C1103.5124%2C1103.2227%2C1103.5864%2C1103.2975%2C1103.0322%2C1103.2412%2C1103.2959%2C1103.5664%2C1103.0503%2C1103.4720%2C1103.3692%2C1103.0809%2C1103.1153%2C1103.1016%2C1103.0733%2C1103.2743%2C1103.2034%2C1103.5097%2C1103.0479%2C1103.4932%2C1103.0651%2C1103.3341%2C1103.5817%2C1103.1183%2C1103.5089%2C1103.2403%2C1103.4184%2C1103.5898%2C1103.3752%2C1103.3981%2C1103.5657%2C1103.4773%2C1103.2475%2C1103.5068%2C1103.2411%2C1103.5836%2C1103.6208%2C1103.2225%2C1103.2663%2C1103.5062%2C1103.5633%2C1103.2554%2C1103.1365%2C1103.2479%2C1103.1468%2C1103.4196%2C1103.3902%2C1103.4677%2C1103.3794%2C1103.0022%2C1103.2393%2C1103.2170%2C1103.1588&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transport measurements were made on four-terminal devices fabricated from\nInSb/Al_xIn_(1-x)Sb quantum well structures at temperatures from 1.5 to 300K.\nNegative bend resistance, which is characteristic of ballistic transport, was\nobserved in devices of channel widths 0.2 or 0.5 {\\mu}m. We have improved upon\nthe existing implementations of R-matrix theory in device physics by\nintroducing boundary conditions that dramatically speed convergence. By\ncomparison with R-matrix calculations, we show that the experimental\nobservations are consistent with quantum coherent transport."}, "authors": ["N. Goel", "T. Jayasekera", "K. Mullen", "M. B. Santos", "K. Suzuki", "S. Miyashita", "Y. Hirayama"], "author_detail": {"name": "Y. Hirayama"}, "author": "Y. Hirayama", "links": [{"href": "http://arxiv.org/abs/1103.2393v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.2393v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.2393v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.2393v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Quantum coherent negative bend resistance in InSb mesoscopic structures\nN. Goel, T. Jayasekera, K. Mullen, M.B. Santos\nHomer L. Dodge Department of Physics and Astronomy,\nand Center for Semiconductor Physics in Nanostructures\nThe University of Oklahoma, 440 West Brooks, Norman OK 73019\nK. Suzuki, S. Miyashita\nNTT Basic Research Laboratories\n3-1 Morinosato Wakamiya, Atsugi-shi, Kanagawa 243-0198, Japan\nY. Hirayama\nNTT Basic Research Laboratories\n3-1 Morinosato Wakamiya, Atsugi-shi, Kanagawa 243-0198, Japan\nSORST-JST, 4-1-8 Honmachi, Kawaguchi, Saitama 331-0012, Japan\nAbstract\nTransport measurements were made on four-terminal devices fabricated from\nInSb/AlxIn1-xSb quantum well structures at temperatures from 1.5 to 300K. Negative\nbend resistance, which is characteristic of ballistic transport, was observed in devices of\nchannel widths 0.2 or 0.5 μm. We have improved upon the existing implementations of\nR-matrix theory in device physics by introducing boundary conditions that dramatically\nspeed convergence.\n\nBy comparison with R-matrix calculations, we show that the\n\nexperimental observations are consistent with quantum coherent transport.\n\n1\n\n\fAs semiconductor devices shrink in size, they are governed by different physical\nprocesses. When the dimensions of a device become less than the mean free path\nelectron transport enters the \"classical ballistic\" regime where boundary scattering starts\nto dominate. When device features are smaller than the wavelength of the carriers,\nelectrons are in a \"quantum ballistic\" regime where coherent dynamics become\nimportant. Negative bend resistance (NBR) can be modeled with quantum or classical\nballistic transport.\n\nQuantized conductance in a quantum point contact [1] requires\n\ncoherence in the region of the point contact.\nCoherent transport may persist up to high temperatures in InSb since this material\nhas the smallest electron effective mass (m*= 0.0139 m0) and the highest roomtemperature electron mobility of all binary III-V semiconductors. The two-terminal\nconductance of a narrow constriction (quantum point contact) in a two-dimensional\nelectron gas in InSb at low temperature has been reported earlier [2]. In this paper we\nreport the experimental observation of ballistic transport through NBR in Si-δ-doped\nInSb/AlxIn1-xSb quantum well structures at temperatures up to 185 K. We show that\nthese observations are consistent with quantum coherent transport.\nIn a four-terminal structure, bend resistance is defined as RB = V14/I23, where V14\nis the voltage across terminals 1 and 4 and I23 is the positive current passed from terminal\n2 to terminal 3 (see inset to Fig. 1b). When the mean free path of the electrons is longer\nthan the channel length, electrons injected from terminal 3 will travel in straight lines (i.e.\nballistically) to terminal 1. This continues until enough charge accumulates in terminal 1\nto deflect the electrons to terminal 4. This produces a potential difference between\nterminals 1 and 4 (V14) that is negative and hence RB < 0 (NBR).\n\n2\n\n\fAn experiment on GaAs four-terminal devices was earlier modeled using a semiclassical billiard ball model [3]. However due to its smaller m*, electrons in InSb are\nmore likely to follow a quantum mechanical (QM) model. In a QM system, the transport\nproperties are related to the transmission coefficients of electrons through the LandauerButtiker formula [4], which gives the bend resistance in a four-terminal device as,\nRB =\n\nh T41T21 − T312\nS\n2e 2\n\n(1)\n\nwhere S is given by [5],\nS = (T21 + T41 )[(T21 + T31 ) 2 + (T41 + T31 )]\n\n(2)\n\nHere the Tij are the transmission coefficients of electrons to lead j from lead i. In the\nsemi-classical approach, the Tij's are calculated by a classical billiard ball model. In\ncontrast we calculate RB assuming the electron transport is ballistic and can be modeled\nby a single electron Schrodinger equation. The transmission coefficients of the electrons\nin the system are calculated by R-matrix theory [6] and RB is then determined by\nEqn. (1).\nA single InSb quantum-well structure with Al0.09In0.81Sb barrier layers was grown\non a semi-insulating GaAs (001) substrate.\n\nThe sample layer sequence above the\n\nsubstrate is described elsewhere [7]. For characterizing the mobility and density of the\nquantum-well structures, Hall bar devices with channel widths of 50 μm were defined\nthrough photolithography and wet chemical etching. Ohmic contacts were made by\nthermal evaporation of Indium on contact pads and subsequent annealing at 225 oC for 5\nm in a N2 (80%)/ H2 (20%) environment. The longitudinal and the transverse (Hall)\nresistances as functions of magnetic field at ~1.5 K observed in a sample of van der pauw\ngeometry are given in Fig. 1a. The density (n) and mobility (μ) for electrons in the\n3\n\n\fquantum well at 1.65 K were measured to be 2.4 x 1011 cm-2 and 1.1 x 106 cm2/Vs. At\nthis temperature, we deduce a mobility mean free path of 0.84 μm. To demonstrate\nballistic transport, devices with four terminals were defined on several Hall bars by\nelectron beam lithography and reactive ion etching. The etch depth of the trenches that\nseparate the terminals was ~ 0.23 μm. A scanning electron microscope image of a fourterminal structure is shown in the inset to Fig. 1b.\n\nHall resistance through the\n\nconstriction, given by RH (= V42/ I13), at 1.5 K for a lithographic 0.2 μm-wide terminal\nstructure is shown in Fig. 1b.\nFig. 2a shows experimental RB at 1.5 K as a function of magnetic field for fourterminal structures with a 0.2 or 0.5 μm lithographic device width (w). NBR clearly\nindicates ballistic transport in an InSb quantum well. The NBR amplitude decreases with\nincreasing w.\n\nThe magnetic field bends the trajectory of the electrons away from\n\nterminal 1 and the voltage becomes less negative. The 0.2 μm device was pinched off in\nthe second cooling cycle suggestive of nearly 0.1 μm wide depletion widths around the\nedges of the terminals. A QPC of width 0.2 μm has ~6 occupied states below the Fermi\nlevel implying that a QM treatment of a four-terminal device with similar proportions is\nreasonable [7]. Fig. 2b shows the calculated bend resistance at zero temperature for\ndevices with different widths. The width of the model-device is less than the lithographic\nwidths and the assumed density is 1.9 x 1011cm-2. Both effects arise from depletion,\nconsistent with the results of Fig. 1. At zero temperature, all the energy levels below the\nFermi energy are completely full and the ones above are empty, thus Tij  Tij (EF). Since\nat zero magnetic field, the coefficient T21 > T31, a large bend resistance is obtained. Our\ncalculation shows that, when the junctions have sharp corners and the subband energy\n\n4\n\n\fequals or in integral multiples of the subband energies, the difference in T21 and T31\nbecomes higher and thus the negative bend resistance is larger. With wedge shaped\ncorners, the sharp resonance features in the transmission coefficients disappear and we\nsee a large bend resistance only for devices with small widths.\nThe bend resistance of a 0.5 μm- wide four-terminal structure as a function of\nperpendicular magnetic field at various temperatures is shown in Fig. 3a.\n\nAs the\n\ntemperature is raised the NBR amplitude decreases, a consequence of the reduction of the\naverage mean free path. Nonetheless, NBR is observed up to 185 K. We believe the\nobservation of NBR at still higher temperatures is masked by the presence of a lower\nmean free path, parallel conduction channel in the structure [7]. To calculate RB at T > 0,\nwe use the effect of Fermi function broadening.\n\nThe result is shown in Fig. 3b.\n\nAccording to the calculations, the amplitude of RB becomes less negative as the\ntemperature is increased. Since there are no sharp resonances for the transmission for\nthis geometry, our calculation does not show a strong effect on temperature.\n\nThe\n\npresence of sharp resonances would have increased the contribution to the transport from\nthe electrons near the Fermi energy with the increase in temperature. Furthermore, at\nsome temperature the transport is no longer coherent and a semi-classical treatment is\nrequired.\nWhile the theoretical results are comparable to the experimental measurements,\nuncertainty in the confining potential and the exact carrier density preclude quantitative\ncomparison. The theoretical calculations allows for three qualitative predictions: (1) a\ndevice with straight terminal leads rather than wedge shaped ones will show a larger\nNBR, (2) it is possible for the temperature dependence of the NBR to be non-monotonic\n\n5\n\n\fif there are sharp resonances in transmission amplitude and (3) if the feature size is made\nslightly smaller we should see structures arising from the quantum wire subband spacing.\nWe thank Michael Morrison for his help in applying R-matrix theory to devices.\nThis work was supported by the National Science Foundation under Grant Nos. DMR0520550 and DMR-0510056.\n\n6\n\n\fReferences:\n[1] B.J. van Wees, H. van Houten, C.W.J. Beenakker, J.G. Williamson, L.P.\nKouwenhoven, D. van der Marel and C.T. Foxon, Phys. Rev. Lett. 60, 848 (1988).\n[2] N. Goel, J. Graham, J.C. Keay, K. Suzuki, S. Miyashita, M.B. Santos and Y.\nHirayama, Physica E 26, 455 (2005).\n[3] S. Tarucha, T. Saku, Y. Hirayama and Y. Horikoshi, Phys. Rev. B 45, 13465 (1992).\n[4] R. Landauer. IBM J. Res. Dev. 1, 233 (1957); R. Landauer, Philos. Mag. 21, 863\n(1970); M. Buttiker, Phys. Rev. B 38, 9375 (1988).\n[5] S. Datta, Superlattices Microstructures 6, 83 (1989) or S. Datta and M. J, McLennan,\nRep. Prog. Phys. 53, 1003 (1990).\n[6] Thushari Jayasekera, Niti Goel, Michael A. Morrison and Kieran Mullen, Physica E\n34, 5584, 2006.\n[7] N. Goel, S.J. Chung, M.B. Santos, K. Suzuki, S. Miyashita and Y. Hirayama, Physica\nE 21, 761 (2004); 20, 251 (2004).\n\n7\n\n\fFIG. 1: (a) Hall resistance and longitudinal resistance in InSb single quantum well\nwith Al0.09In0.91Sb barriers as measured on a Hall bar at 1.65 K. b) RH (= V42/ I13) as a\nfunction of B-field at 1.5 K for a lithographic 0.2 μm-wide four-terminal structure\nfabricated from an InSb/Al0.09In0.91Sb quantum well.\n\n8\n\n\fFIG. 2: (a) Experimental bend resistance as a function of magnetic field, B, for two\nfour-terminal structures with 0.2 and 0.5 μm lithographic device width. (b) Calculated\nbend resistance as a function of B for various device widths (dot- 0.038 μm, solid0.045μm, long dash-dot- 0.052 μm, dash- 0.077 μm and short dash-dot- 0.113 μm).\nThe calculation considers the device geometry as shown in the inset to (b) and electron\ndensity of 1.9x1011 cm-2.\n\n9\n\n\fFIG. 3: Experimental (a) and calculated (b) bend resistance as\nfunctions of the magnetic field and temperature. The lithographically\ndefined device width for the experimental curve is 0.5 μm. The\ncalculation assumes a device width = 0.045 μm. Different curves are\nfor different temperatures (Line- 4 K, dash- 40 K, Dot- 75 K, Dash-dot100 K, solid 150 K, dot 200 K).\n\n10\n\n\f"}