{"id": "http://arxiv.org/abs/0802.4212v2", "guidislink": true, "updated": "2008-03-14T14:23:18Z", "updated_parsed": [2008, 3, 14, 14, 23, 18, 4, 74, 0], "published": "2008-02-28T15:19:46Z", "published_parsed": [2008, 2, 28, 15, 19, 46, 3, 59, 0], "title": "Interference Effects in the Brain", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2407%2C0802.2225%2C0802.0738%2C0802.1904%2C0802.3815%2C0802.3117%2C0802.3083%2C0802.1294%2C0802.0845%2C0802.3750%2C0802.1332%2C0802.3331%2C0802.2709%2C0802.3720%2C0802.3594%2C0802.4282%2C0802.0049%2C0802.3210%2C0802.2850%2C0802.0875%2C0802.0902%2C0802.3652%2C0802.0897%2C0802.1430%2C0802.2011%2C0802.1562%2C0802.2746%2C0802.3738%2C0802.0851%2C0802.0407%2C0802.1525%2C0802.3483%2C0802.0483%2C0802.2796%2C0802.1306%2C0802.1151%2C0802.2482%2C0802.4208%2C0802.4383%2C0802.0583%2C0802.1442%2C0802.1447%2C0802.4347%2C0802.0305%2C0802.0904%2C0802.0321%2C0802.0714%2C0802.3742%2C0802.1099%2C0802.0189%2C0802.0579%2C0802.4447%2C0802.2171%2C0802.1649%2C0802.3715%2C0802.1768%2C0802.3213%2C0802.3731%2C0802.2698%2C0802.4440%2C0802.1072%2C0802.0557%2C0802.0293%2C0802.0440%2C0802.2073%2C0802.3847%2C0802.3370%2C0802.1080%2C0802.4212%2C0802.0372%2C0802.2593%2C0802.4408%2C0802.2630%2C0802.4380%2C0802.3908%2C0802.3499%2C0802.3721%2C0802.0411%2C0802.2326%2C0802.0359%2C0802.1748%2C0802.2020%2C0802.1851%2C0802.1996%2C0802.0424%2C0802.4356%2C0802.3379%2C0802.3754%2C0802.3959%2C0802.0203%2C0802.1039%2C0802.0240%2C0802.4249%2C0802.3886%2C0802.0316%2C0802.3216%2C0802.2423%2C0802.1523%2C0802.3466%2C0802.2030%2C0802.3672&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interference Effects in the Brain"}, "summary": "Interference effects are the most spectacular manifestation of the wave\nnature of phenomena. This note proposes a systematic search for such effects in\nthe brain.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2407%2C0802.2225%2C0802.0738%2C0802.1904%2C0802.3815%2C0802.3117%2C0802.3083%2C0802.1294%2C0802.0845%2C0802.3750%2C0802.1332%2C0802.3331%2C0802.2709%2C0802.3720%2C0802.3594%2C0802.4282%2C0802.0049%2C0802.3210%2C0802.2850%2C0802.0875%2C0802.0902%2C0802.3652%2C0802.0897%2C0802.1430%2C0802.2011%2C0802.1562%2C0802.2746%2C0802.3738%2C0802.0851%2C0802.0407%2C0802.1525%2C0802.3483%2C0802.0483%2C0802.2796%2C0802.1306%2C0802.1151%2C0802.2482%2C0802.4208%2C0802.4383%2C0802.0583%2C0802.1442%2C0802.1447%2C0802.4347%2C0802.0305%2C0802.0904%2C0802.0321%2C0802.0714%2C0802.3742%2C0802.1099%2C0802.0189%2C0802.0579%2C0802.4447%2C0802.2171%2C0802.1649%2C0802.3715%2C0802.1768%2C0802.3213%2C0802.3731%2C0802.2698%2C0802.4440%2C0802.1072%2C0802.0557%2C0802.0293%2C0802.0440%2C0802.2073%2C0802.3847%2C0802.3370%2C0802.1080%2C0802.4212%2C0802.0372%2C0802.2593%2C0802.4408%2C0802.2630%2C0802.4380%2C0802.3908%2C0802.3499%2C0802.3721%2C0802.0411%2C0802.2326%2C0802.0359%2C0802.1748%2C0802.2020%2C0802.1851%2C0802.1996%2C0802.0424%2C0802.4356%2C0802.3379%2C0802.3754%2C0802.3959%2C0802.0203%2C0802.1039%2C0802.0240%2C0802.4249%2C0802.3886%2C0802.0316%2C0802.3216%2C0802.2423%2C0802.1523%2C0802.3466%2C0802.2030%2C0802.3672&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interference effects are the most spectacular manifestation of the wave\nnature of phenomena. This note proposes a systematic search for such effects in\nthe brain."}, "authors": ["Jerzy Szwed"], "author_detail": {"name": "Jerzy Szwed"}, "author": "Jerzy Szwed", "arxiv_comment": "7 pages, 3 figures", "links": [{"href": "http://arxiv.org/abs/0802.4212v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.4212v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.4212v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.4212v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0802.4212v2 [physics.gen-ph] 14 Mar 2008\n\nInterference Effects in the Brain.\nJerzy Szwed∗\nInstitute of Physics, Jagellonian University,\nReymonta 4, 30-059 Kraków, Poland\nOctober 26, 2018\n\nTPJU - 1/2008\nAbstract\nInterference effects are the most spectacular manifestation of the\nwave nature of phenomena. This note proposes a systematic search for\nsuch effects in the brain.\n\n1. The current discussion on possible new effects playing an important role\nin neural processes in the brain is provoking many speculative hypotheses.\nAmong them the suggestion of nonalgorithmic processes taking place in the\nmind or the quantum nature of information processing is perhaps the most\nexciting [1]. In our opinion further theoretical development of these ideas\nrequires definite feedback from experiment. In this note we propose a series\nof experiments testing the possibility of wave phenomena taking place and\nplaying an important role in the brain. Inspiration for these proposals comes\nfrom analogous experiments in physics.\n2. The fundamental experiment proving the wave nature of light was performed by Thomas Young in 1801 [2]. Although well known to physicists we\ndescribe it briefly because of its central role in further considerations. Put\nsimply, the experimental setup consisted of a (nearly) pointlike light source\nand two slits between the source and screen (see Fig. 1). Covering one of\nthe two slits (Fig. 1a) the light travelled through the second slit and hit\nthe screen producing a (slightly diffused) picture opposite the opened slit.\nToday we know that what we observe is the Huygens principle at work -\nthe open slit works as the source of a spherical wave. Analogically, covering\nthe second slit we observe the picture on the screen opposite the first slit\n(Fig. 1b). With both slits opened a spectacular result is observed (Fig. 1c).\nIt is not the simple sum of both previous pictures, instead an interference\npattern of dark and light bands appears. Moreover, at maximum brightness,\nthe signal is not just twice as strong (as one would expect from summing\n∗\nWork supported in part by the Marie Curie Actions Transfer of Knowledge project\nCOCOS (contract MTKD-CT-2004-517186).\n\n1\n\n\fthe two separate signals) but 4 times stronger. Today the explanation is\nwell known - what is travelling between the source and screen are the light\n(electromagnetic) waves. On the screen these waves meet having covered in\ngeneral different distance when travelling through the first and the second\nslit. If the path difference is equal to the integer number of the wave lengths\n- the waves interfere positively and produce maximum, in the other extreme case when the path difference is half the integer number of the wave\nlengths - the waves interfere negatively and produce minimum. The result\non the screen is a characteristic interference pattern. The second important\neffect is the strength of the signal. This depends on the energy deposited\non the screen and this energy is proportional to the square of the incoming\nwave.\nsignal ∼ (wave1 + wave2 )2\n(1)\n\na)\n\n4\n\n3\n\n4\n\n2\n\n2.5\n\n3.5\n\n2\n\n3\n\n2.5\n\n-3\n\n3.5\n\n0\n\n1\n\n0.5\n\n1.5\n\n-2\n-1\n0\n1\n2\n3\n\nb)\n\n1\n\n0\n\n1.5\n\n0.5\n\n-3\n-2\n-1\n0\n1\n2\n3\n\nc)\n\n4\n\n3\n\n2\n\n3.5\n\n2.5\n\n1\n\n0\n\n1.5\n\n0.5\n\n-3\n-2\n-1\n0\n1\n2\n3\n\nFigure 1: Schematic setup of the two slit interference experiment.\nTherefore, when two equal waves meet \"in phase\" the effective wave is twice\nas high but the signal strength is 4 times stronger. Finally one should stress\nan important detail of the experimental setup which makes the observation\npossible. The interference pattern of light waves is extended in space due\nto the large distance L between the slits and screen as compared to the\nslit separation d - approximately by a factor of L/d . This is why we do\nnot need the accuracy of the order of the wave length λ but rather λL/d.\nChoosing properly the slit separation d and the distance 'slits–target' L\nwe are able to see interference taking place on a nanometric scale (light)\n2\n\n\fmagnified to a distance in centimetres on the screen.\nTo summarize the description of double slit experiment, the interference pattern following from adding two different waves and \"abnormal\" amplification\nof signal at the maximum are the pronounced features of wave phenomena.\n3. The original double slit experiment was repeated more than a century\nlater in its new version contributing crucially to our understanding of quantum mechanics. In 1909 G.I. Taylor used single photons as signal source\n[3]. Analogical experiments with \"quantum waves\" of matter were also performed with electrons [4] in 1961, with single electrons [5] in 1989, with\nneutrons [6] in 1988, with helium atoms [7] in 1991 and with fulleren (C60)\nmolecules [8] in 1999. This series of experiments differs substantially from\nthe \"classical wave\" phenomenon. In the quantum version what we control\ndirectly is the source of photons or massive particles and the effect on the\ntarget (screen). Emitting the single photon or electron we are unable to\nanswer the question (without additional measurement) which slit has been\nused by the travelling quantum object. The measurement occurs at the\ntarget where the photon/electron appears as a nearly pointlike signal. It\nis only after gathering substantial statistics that these single particles build\nup an interference pattern. This pattern is produced by the quantum mechanical probability amplitude which travels between the source and target.\nThe cited experiments support the double, wave-particle nature of emitted\nobjects and demonstrate quantum interference phenomena at scales as large\nas fulleren molecules.\n4. The double slit interference experiment sketched above has turned out\nto be a powerful tool in the search for wave phenomena for more than two\ncenturies. The aim of this note is to propose an analogical experiment for\nthe brain. We do not attempt to join the speculations on the origins of wave\nphenomena, on whether they are classical or quantum-like. Instead we would\nlike to concentrate on the experimental feasibility of such experiments. In\ngeneral, we should like to investigate the spatial and/or temporal structure\nof effective signals resulting from two different sources. The main unknown\nwhich determines the experimental setup is the scale (in distance and in\ntime) at which the phenomenon manifests itself. Therefore, one is forced\nto perform tests at levels ranging from intercellular (nm) distances, trough\nsingle neuron (μm) to multi neuron (mm) distances and corresponding time\nscales. These scales determine the signal source and the target.\nThere are two general setups leading to possible interference effects. The first\none is exactly copied from the Young experiment, we call it \"spatial\" setup.\nA single source (or two correlated/coherent sources) emits the signal which\nis carried to the target via two distinct ways. Before hitting the target both\nsignal carriers mix in some overlapping volume where they possibly interfere.\nThe target is spatially large enough that our detectors distinguish details\nwithin it (the space resolution of our detector should be much smaller than\nthe area reached by the signal). As in the Young experiment, due to different\ndistances covered by the two signal carriers, the effective signal will show\n3\n\n\fenhanced and suppressed interference bands as we move across the target.\nMoreover, the strength of the enhanced signal is higher than the simple sum\nof two single signals. Nota bene to check this, we should be able to send\nsingle signal via each single path as well (corresponding to the Young setup\nwith one slit covered).\nThe second setup uses time difference rather than path difference, we call\nit therefore the \"temporal\" setup. It assumes two sources which can emit\nsignals at different (in general), well controlled instants. The detector in the\ntarget, where the effective signal is measured, can be simpler than in the\nspatial setup, it can be just a single measuring unit. The possible interference effect will be observed by shifting the relative time of emission of the\ntwo signals. The characteristic enhancement-suppression pattern emerges\nhere as a function of time difference. As compared to the \"spatial\" case the\n\"temporal\" setup looks simpler but requires more precision. The resolution\nshould be high enough so that we are able to distinguish details at times\ncomparable to the wave period. In the \"spatial\" case the interference pattern can be extended in space due to the magnification factor mentioned\nabove.\nBoth presented setups can be refined or combined to make the search as complete as possible. This is especially important due to our ignorance of the\nscale (wavelength, frequency) of the phenomenon. The possible quantumlike behaviour requires even more attention - systematic built up of statistics.\n5. How can we look for interference effects in brain? We suggest a few\nexamples at various scales, the list is by no means complete. Let us start\nwith difficulties: the main ones seem to be connected with the coherence of\nthe sources and the choice of the target. The signal sources can be relatively\neasily defined, they can be external (sensory, vision, sound, ...) or internal\n(direct stimulation of brain cells), the control over their relative correlation\nis very important. The brain as the target is much more complicated than\na photographic plate, luminescent screen or electronic detector. Therefore\nthe correct preparation of the target and the removal, as much as possible,\nof side effects will be a real challenge.\nOne of the best systems ready for both \"spatial\" and \"temporal\" experiments is the sensory system of the rat. The signal sources here are the rat's\nvibrissa and the target - the barrel cortex. To facilitate the detection of interference pattern the signal sources should be preferably of equal strength.\nIn order to perform the \"spatial\" experiment one needs a multi-electrode\ndetector which allows for spatial resolution of effective signals. The scale at\nwhich the effect is searched can be chosen by the magnitude and separation\nof electrodes, and ranges from single neurons to multi neuron systems. The\n\"temporal\" experiment seems slightly simpler, it can be performed with single electrode but the time (in particular time shift) control must be very\naccurate. Performing the experiment in vivo one is able to experiment with\nthe brain at rest or in an active state. Similar setups can be arranged with\n4\n\n\fthe visionary system. The signal sources can be 2 light signals separated in\nspace and/or time, their coherence is relatively easy to achieve. Again the\nright choice of the target and multi-electrode detector would be crucial.\nGoing down with scale one can test the signal transmission inside the neuron. Although this process seems to be understood at the electrochemical\nlevel some brave hypotheses [1] may be verified in this system. Coherence\nof the signal emission and transmission could be the main problems here.\nIncreasing the scale one may use such techniques as EEG, MEG or high precision MRI to experiment at multi neuronal systems. These devices allow\nfor a wide choice of sources and targets, their resolution is however much\nlower - at present in the millimetre (and second) range. The suggestions\npresented above are very much first guess proposals. But even with this set\nof experiments we are able to cover quite a broad spectrum of wavelengths\nand frequencies.\n6. Let us illustrate the above consideration with a simple model. Assume\nthe signal carrier to be a wave packet of the form (Fig.2 upper left)\nu2\nf1 (u) = exp − 2\na\n\n!\n\nu\ncos 2π\nλ\n\u0012\n\n\u0013\n\n.\n\n(2)\n\nAccording to our previous remarks the signal detected from such a wave is\nproportional to the square of the wave (Fig. 2 upper right)\nS1 ∼ [f1 (u)]2\n\n(3)\n\nand the total strength of such signal is proportional to the integral over the\nwhole signal\nS1int\n\n∼\n\nZ∞\n\nS1 du .\n\n(4)\n\n−∞\n\nLet us add the second carrier of the same shape but shifted by a given ∆u\nThe resulting signal is\nS1+2 ∼ [f1 (u) + f2 (u + ∆u)]2\n\n(5)\n\nThe above formulae are illustrated in Fig. 2 for a few selected shifts ∆u.\nOne can see the interference at work, for some shifts the effective signal\nnearly disappears.\nThere are several integral measures of relative influence of two signals on\neach other. In Fig. 3 we present one of them - the facilitation index F I\ndefined as the ratio of the integrated effective signal strength over the sum\nof two separate integrated signals\nFI =\n\nint\nS1+2\nS1int + S2int\n\n(6)\n\nIn any case where the signals do not influence each other, this index should\n5\n\n\f4\n\nS1\n3\n\narbitrary units\n\narbitrary units\n\n3\n\n4\n\nf1(u)\n\n(a)\n\n2\n\n1\n\n0\n\n-1\n\n2\n\n1\n\n0\n\n-1\n\n-2\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\n-2\n\n4\n\n1\n\n0\n\n8\n\n2\n\n1\n\n0\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\n-2\n\n4\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\n4\n\nf1(u)+f2(u+∆u)\n\n(c)\n\nS1+2\n3\n\narbitrary units\n\narbitrary units\n\n6\n\n-1\n\n-2\n\n2\n\n1\n\n0\n\n-1\n\n2\n\n1\n\n0\n\n-1\n\n-2\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\n-2\n\n4\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\n4\n\nf1(u)+f2(u+10∆u)\n\n(d)\n\nS1+2\n3\n\narbitrary units\n\narbitrary units\n\n4\n\nS1+2\n\n-1\n\n3\n\nu\n\n3\n\n2\n\n3\n\n2\n\nf1(u)+f2(u)\n\n(b)\n\narbitrary units\n\narbitrary units\n\n3\n\n0\n\n4\n\n2\n\n1\n\n0\n\n-1\n\n2\n\n1\n\n0\n\n-1\n\n-2\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\n-2\n\n0\n\n2\n\nu\n\n4\n\n6\n\n8\n\nFigure 2: (a) Example wave packet and signal. (b)-(d) Interference of two\nwaves and two signals for reletive shifts: (b) 0, (c) ∆u and (d) 10∆u.\n\n2\n\n1.5\n\nFI\n\n1\n\n0.5\n\n0\n-3\n\n-2\n\n-1\n\n∆u\n0\n\n1\n\n2\n\n3\n\nFigure 3: The facilitation index FI as a function of relative shift ∆u.\n\n6\n\n\fbe constant and equal to 1. In our example it shows a characteristic oscillatory behaviour of FI and supralinear enhancement, The ratio FI is thus\nsensitive to the most prominent features of interference. One should note\nthat the variable u (and ∆u) does not necessarily mean the spatial dimension. This is so in the original Young (\"spatial\") setup, in the case of the\n\"temporal\" setup these variables are rather the time and the time shift,\nrespectively.\n7. To summarize, this note advocates a systematic search for wave effects\nin the brain. Following the spectacular double slit interference experiment,\nwhich has been successful so many times and in so many systems, we point\nout the most characteristic features of the interference pattern. Without\nknowing the scale of possible effects it is reasonable to test as many experimental systems as possible where multi stimulus sources and spatiotemporaly extended targets are at our disposal. Since we are dealing with\na very complex system, the removal of side effects so that we are as close\nas possible to the original two slit experiment will be probably the hardest\ntask. However, in the case of a positive result - the discovery of the wave\nnature of information processing will certainly be a breakthrough in our\nunderstanding of the brain.\n8. The author would like to thank Marian H. Lewandowski and Marcin\nSzwed for discussions.\n\nReferences\n[1] R. Penrose \"The Emoperors's New Mind\", Oxford University Press\n1989.\n[2] T. Young, \"A Course of Lectures on Natural Philosophy and Mechanical\nArts\" (1807).\n[3] G. I. Taylor, \"Interference Fringes with Feeble Light\", Proc. Cam. Phil.\nSoc. 15, 114 (1909).\n[4] C. Jönsson, \"Elektroneninterferenzen an mehreren knstlich hergestellten Feinspalten\", Zeit. Phys. 161, 454 (1961).\n[5] A. Tonomura et al., \"Demonstration of single-electron builtup of interference pattern\", Am. J. Phys. 57, 117 (1989).\n[6] A. Zeilinger et al., \"Single and Double Slit Diffraction of Neutrons\",\nRev. Mod. Phys. 60, 1067 (1988).\n[7] O. Carnal and J. Mlynek, \"Young's double slit experiment with atoms:\nA simple atom interferometer\", Phys. Rev. Lett. 66, 2689 (1991).\n[8] M. Arndt et al., \"Wave-Particle Duality of C60 Molecules\", Nature\n401, 680 (1999).\n\n7\n\n\f"}