{"id": "http://arxiv.org/abs/1004.2469v1", "guidislink": true, "updated": "2010-04-14T18:32:21Z", "updated_parsed": [2010, 4, 14, 18, 32, 21, 2, 104, 0], "published": "2010-04-14T18:32:21Z", "published_parsed": [2010, 4, 14, 18, 32, 21, 2, 104, 0], "title": "Impedance-matched cavity quantum memory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.2177%2C1004.5142%2C1004.4986%2C1004.1544%2C1004.0092%2C1004.2741%2C1004.0728%2C1004.1824%2C1004.4393%2C1004.4836%2C1004.1391%2C1004.4751%2C1004.1114%2C1004.3935%2C1004.0597%2C1004.4207%2C1004.5117%2C1004.1886%2C1004.3116%2C1004.4265%2C1004.1743%2C1004.4543%2C1004.3822%2C1004.3983%2C1004.0425%2C1004.1858%2C1004.1326%2C1004.2528%2C1004.3210%2C1004.3180%2C1004.3275%2C1004.0471%2C1004.1671%2C1004.4242%2C1004.2488%2C1004.2492%2C1004.0421%2C1004.1725%2C1004.0912%2C1004.1738%2C1004.1547%2C1004.2008%2C1004.0789%2C1004.4360%2C1004.3911%2C1004.5510%2C1004.5004%2C1004.2469%2C1004.4277%2C1004.0989%2C1004.2866%2C1004.1167%2C1004.1888%2C1004.4844%2C1004.4056%2C1004.4623%2C1004.4560%2C1004.4299%2C1004.3414%2C1004.3914%2C1004.0018%2C1004.1642%2C1004.1726%2C1004.1345%2C1004.2638%2C1004.3137%2C1004.4910%2C1004.0646%2C1004.4405%2C1004.5037%2C1004.0854%2C1004.0506%2C1004.0671%2C1004.1332%2C1004.2020%2C1004.3978%2C1004.1151%2C1004.4200%2C1004.2042%2C1004.5388%2C1004.0949%2C1004.4730%2C1004.0625%2C1004.3564%2C1004.1982%2C1004.5585%2C1004.0668%2C1004.5045%2C1004.2967%2C1004.2990%2C1004.2513%2C1004.3628%2C1004.2942%2C1004.4411%2C1004.2160%2C1004.2127%2C1004.4946%2C1004.0985%2C1004.0716%2C1004.3823%2C1004.0760&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Impedance-matched cavity quantum memory"}, "summary": "We consider an atomic frequency comb based quantum memory inside an\nasymmetric optical cavity. In this configuration it is possible to absorb the\ninput light completely in a system with an effective optical depth of one,\nprovided that the absorption per cavity round trip exactly matches the\ntransmission of the coupling mirror (\"impedance matching\"). We show that the\nimpedance matching results in a readout efficiency only limited by irreversible\natomic dephasing, whose effect can be made very small in systems with large\ninhomogeneous broadening. Our proposal opens up an attractive route towards\nquantum memories with close to unit efficiency.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.2177%2C1004.5142%2C1004.4986%2C1004.1544%2C1004.0092%2C1004.2741%2C1004.0728%2C1004.1824%2C1004.4393%2C1004.4836%2C1004.1391%2C1004.4751%2C1004.1114%2C1004.3935%2C1004.0597%2C1004.4207%2C1004.5117%2C1004.1886%2C1004.3116%2C1004.4265%2C1004.1743%2C1004.4543%2C1004.3822%2C1004.3983%2C1004.0425%2C1004.1858%2C1004.1326%2C1004.2528%2C1004.3210%2C1004.3180%2C1004.3275%2C1004.0471%2C1004.1671%2C1004.4242%2C1004.2488%2C1004.2492%2C1004.0421%2C1004.1725%2C1004.0912%2C1004.1738%2C1004.1547%2C1004.2008%2C1004.0789%2C1004.4360%2C1004.3911%2C1004.5510%2C1004.5004%2C1004.2469%2C1004.4277%2C1004.0989%2C1004.2866%2C1004.1167%2C1004.1888%2C1004.4844%2C1004.4056%2C1004.4623%2C1004.4560%2C1004.4299%2C1004.3414%2C1004.3914%2C1004.0018%2C1004.1642%2C1004.1726%2C1004.1345%2C1004.2638%2C1004.3137%2C1004.4910%2C1004.0646%2C1004.4405%2C1004.5037%2C1004.0854%2C1004.0506%2C1004.0671%2C1004.1332%2C1004.2020%2C1004.3978%2C1004.1151%2C1004.4200%2C1004.2042%2C1004.5388%2C1004.0949%2C1004.4730%2C1004.0625%2C1004.3564%2C1004.1982%2C1004.5585%2C1004.0668%2C1004.5045%2C1004.2967%2C1004.2990%2C1004.2513%2C1004.3628%2C1004.2942%2C1004.4411%2C1004.2160%2C1004.2127%2C1004.4946%2C1004.0985%2C1004.0716%2C1004.3823%2C1004.0760&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider an atomic frequency comb based quantum memory inside an\nasymmetric optical cavity. In this configuration it is possible to absorb the\ninput light completely in a system with an effective optical depth of one,\nprovided that the absorption per cavity round trip exactly matches the\ntransmission of the coupling mirror (\"impedance matching\"). We show that the\nimpedance matching results in a readout efficiency only limited by irreversible\natomic dephasing, whose effect can be made very small in systems with large\ninhomogeneous broadening. Our proposal opens up an attractive route towards\nquantum memories with close to unit efficiency."}, "authors": ["Mikael Afzelius", "Christoph Simon"], "author_detail": {"name": "Christoph Simon"}, "author": "Christoph Simon", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.82.022310", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.2469v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.2469v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 2 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.2469v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.2469v1", "journal_reference": "Phys. Rev. A 82, 022310 (2010)", "doi": "10.1103/PhysRevA.82.022310", "fulltext": "Impedance-matched cavity quantum memory\nMikael Afzelius1 and Christoph Simon2\n1\n\n2\n\nGroup of Applied Physics, University of Geneva, CH-1211 Geneva 4, Switzerland\nInstitute for Quantum Information Science and Department of Physics and Astronomy,\nUniversity of Calgary, Calgary T2N 1N4, Alberta, Canada\n(Dated: October 27, 2018)\n\nWe consider an atomic frequency comb based quantum memory inside an asymmetric optical\ncavity. In this configuration it is possible to absorb the input light completely in a system with an\neffective optical depth of one, provided that the absorption per cavity round trip exactly matches\nthe transmission of the coupling mirror (\"impedance matching\"). We show that the impedance\nmatching results in a readout efficiency only limited by irreversible atomic dephasing, whose effect\ncan be made very small in systems with large inhomogeneous broadening. Our proposal opens up\nan attractive route towards quantum memories with close to unit efficiency.\n\narXiv:1004.2469v1 [quant-ph] 14 Apr 2010\n\nPACS numbers:\n\nQuantum memories for photons [1–4] are essential elements for many applications in quantum information\nprocessing, including quantum repeaters [5] and linearoptics quantum computing [6]. Most conceivable applications require memories with storage and readout efficiencies that are at or above the 90 % level (and likely far\nabove that level for quantum computing). While quantum memory experiments have progressed impressively\nover the last few years, efficiencies typically range from\na few percent to a few tens of percent [7–16]. Only a\nfew experiments have reached efficiencies above the 50%\nlevel [17, 18], most notably a storage and readout efficiency close to 70% has been achieved [18] in a highly\nabsorbing solid-state atomic ensemble using the gradient\necho memory protocol [19].\nIt is usually thought that implementing memories in\natomic ensembles [3] with efficiencies close to unity will\nrequire optical depths much greater than one [18, 20, 21].\nHowever, reaching high optical depth is difficult in practice, in particular for the most attractive solid-state systems, such as rare-earth ion doped crystals [4]. Individual crystals with realistic dimensions and doping levels\noften have very limited optical depth. One exception is\npraseodymium-doped Y2 SiO5 crystals [18]. But in order\nto fully exploit the potential of other materials, having\nconsiderably lower optical depth but otherwise interesting coherence properties, it would be of great interest to\nfind a general method to overcome this crucial limitation.\nHere we show that memories with unit efficiency can be\nrealized in a cavity-memory system with an optical depth\nof one, by using the impedance matching condition. This\ncondition is attained [22] when the absorption, per cavity round trip, is exactly matched to the transmission of\nthe coupling mirror of the (asymmetric) cavity. The result is a complete absorption of the incoming light and\nwe show that the resulting memory readout efficiency\nreaches 100% for optical depths around 1. The use of\nimpedance matching had previously been suggested for\nquantum memories in homogeneously broadened systems\n\n[23], however, the results of Ref. [20] later showed that\nin such systems high effective optical depth is always required for high efficiency, because the effect of spontaneous decay cannot be ignored. In homogeneous systems\nthe efficiency roughly scales with 1 − 1/d [20], where d is\nthe optical depth.\nHere we show that the situation is different in systems\nwith inhomogeneous broadening, for instance in solidstate approaches [4, 21]. In such systems there is an additional timescale given by the inverse of the inhomogeneously broadened bandwidth. This can be much shorter\nthan the spontaneous decay time. As a consequence, the\neffects of spontaneous decay can be negligible during absorption and re-emission even for moderate optical depth.\nLong storage times are nevertheless possible because the\ninhomogeneous component of the dephasing can be made\nto be reversible, e.g. by tailoring the spectral density in\nthe form of a frequency comb (AFC) [21] or by using an\nexternally controlled reversible inhomogeneous broadening (CRIB) [4, 19]. As a consequence, the principle of\nimpedance matching can develop its full potential in inhomogeneously broadened systems, as we will now show\nin more detail.\nLet us start by considering the absorption of light by\nan inhomogeneously broadened atomic ensemble in a onesided cavity, see Fig. 1. The readout step will be treated\nlater, for the case of an AFC-based control of the inhomogeneous dephasing. The dynamical equation for the\ncavity field E is\nZ\n√\n(1)\nE ̇ = −κE + 2κEin + iP̃ dωn(ω)σω ,\nwhere κ is the cavity decay rate, P̃ is proportional to\nthe dipole moment [21], ω is the detuning, n(ω) is the\ninhomogeneous atomic spectral distribution and σω is the\natomic polarization at detuning ω. The equation for the\natomic polarization is\nσ ̇ω = −iωσω − γh σω + iPE,\n\n(2)\n\n\f2\n\nε in\n\nR1\n\nPBS\n\nR2 ≈ 1\n\nQM\n\nE=\n\nλ/4\n\nε out\n\n√\n2κ\nEin .\nκ+Γ\n\n(6)\n\nPlugging this into Eq. (3) results in\n\n∆\n\nG\n\nwhich gives\n\nγ\nδ\n\nFIG. 1: (Color online) We consider a quantum memory (QM)\nbased on an atomic frequency comb which is placed in an\nasymmetric optical cavity with reflectivity R1 < R2 ≈ 1.\nThe input and output fields Ein and Eout are separated by\na quarter-wave plate (λ/4) and a polarization beam splitter\n(PBS). If the QM strongly absorbs only a particular linear\npolarization mode, one can also use a Faraday rotator and\na half-wave plate as in Ref. [16]. The atomic comb memory is based on an inhomogeneously broadened transition,\nwhere the absorption depth d is shaped into a comb structure as function of detuning δ with periodicity ∆ and tooth\nwidth γ. The interaction between the atomic comb structure\nand a incoming light pulse leads to a coherent re-emission at\nt = 2π/∆. Longer storage times can be achieved by using\nadditional ground state levels [21, 24].\n\nwhere γh is the homogeneous linewidth and P is the\ndipole moment. Finally the input-output relation for the\ncavity is\n√\n(3)\nEout = −Ein + 2κE,\nwhich is valid for relatively high cavity finesse. (We will\ndrop this simplifying assumption later on.)\nPutting the solution of Eq. (2) into Eq. (1) gives\n√\nĖ(t) = −κE(t) + 2κEin (t) −\nZt\n′\nP P̃\ndt′ ñ(t − t′ )e−γh (t−t ) E(t′ ),\n(4)\n−∞\n\nwhere ñ(t) is the Fourier transform of n(ω). If γi ≫ γh ,\nwhere γi is the width of the inhomogeneous distribution\nn(ω), then the exponential containing γh can be ignored\nover the relevant timescales. If moreover γi is significantly larger than the bandwidth of the input light, then\nñ(t − t′ ) can be approximated as γNi δ(t − t′ ) (for times\naround t = 0, i.e. when the absorption happens,\ncf. beR\nlow for much later times), where N = dωn(ω) is the\ntotal number of atoms, yielding\n√\n(5)\nE ̇ = −κE + 2κEin − ΓE,\nwhere Γ = NγPi P̃ emerges as the absorption rate of the\ncavity field by the atomic ensemble.\nUnder conditions where the input field varies much\nmore slowly than the cavity lifetime, i.e. when the input\nspectrum is in resonance with the cavity, one can now\nadiabatically eliminate the cavity mode (i.e. set Ė = 0),\n\nEout =\n\nκ−Γ\nEin .\nκ+Γ\n\n(7)\n\nTotal absorption, corresponding to Eout = 0, can thus\nbe achieved for κ = Γ, which is the impedance matching condition in our case. The intuitive explanation is\nthat in this situation the absorption losses have exactly\nthe same effect as a second identical mirror would. To\nthe input field the cavity-memory system therefore looks\nexactly like a symmetric Fabry-Perot cavity, leading to\nzero reflection on resonance [22]. The ratio Γ/κ is exactly\nthe effective optical depth, or the cooperativity C in the\nnotation of Ref. [20]. Perfect absorption is thus achieved\nfor an optical depth of one, a very moderate value. Our\nresults are nevertheless consistent with those of Ref. [20]\nin the sense that if all N atoms were concentrated into\nthe homogeneous linewidth γh rather than the inhomogeneous linewidth γi , the resulting cooperativity would be\nvery large, given our assumption that γi ≫ γh . However,\nfortunately there is no need for all the N atoms to actually have the same frequency in the quantum memory\nschemes based on control of inhomogeneous dephasing.\nIn the context of quantum memories it is crucial to\nalso obtain an efficient readout of the stored excitation.\nHere we will limit our analysis to the case of an AFCbased [21] quantum memory. We only briefly remind\nthe reader of the essential features, for details we refer\nto Ref. [21]. The inhomogeneous absorption is shaped\ninto a comb structure, by optical pumping techniques,\nhaving periodicity ∆ and peak width γ (see Fig. 1).\nThe interaction between an incoming light pulse in resonance with the comb results in a coherent re-emission\nafter a time t = 2π/∆, due to a periodic rephasing of the\natomic coherence (we assume that the input spectrum\nis larger than ∆). Note that freely controllable storage\ntimes far beyond 2π/∆ can be achieved by using an additional ground state level [21], as recently also shown\nexperimentally [24].\nIn the case of a high AFC comb finesse FA = ∆/γ, the\nefficiency of this echo-type emission can be very large for\nlarge optical depths [21]. For a forward readout configuration it is limited to 54% due to re-absorption in the\nsample, while for a backward readout it can reach 100%\ndue to an interference effect that is well-understood [21].\nWe will show below that in our proposed cavity arrangement, the efficiency can reach 100% for a much lower\noptical depth, also without having to resort to the backward recall procedure [21].\nWe thus assume that n(∆) has the shape of a comb, as\nin Fig. 1. As a consequence ñ(t) has peaks not only at\n\n\f3\nt = 0 (as we used before), but also at integer multiples of\n2π/∆. Following Ref. [21] one can derive the following\nequation for the cavity field around the first rephasing at\nt = 2π/∆,\nZ0\n\ndt′ ñ(t − t′ )Ein (t′ )\n\n−∞\n\n−P P̃\n\nZt\n0\n\ndt′ ñ(t − t′ )E(t′ ),\n\n(8)\n\nsimilar to Eq. (A15) in Ref. [21]. Using similar arguments as for the absorption, this reduces to\n√\nΓ ηF\n2π\n ̇\n√\n) − ΓE(t),\n(9)\nE(t) = −κE(t) − 2\nEin (t −\n∆\n2κ\nwhich is analogous to Eq. (A16) in Ref. [21]. Here ηF\ndescribes the reduction in efficiency due to the fact that\nthe individual teeth in the frequency comb have finite\nwidth, which leads to irreversible atomic dephasing. In\n2\nthe case of Gaussian peaks [21] one finds ηF ≈ e−7/FA .\nThis should not be confused with the cavity finesse FC =\n1\n\nπ(R1 R2 ) 4\n√\n.\n1− R1 R2\n\nAdiabatically eliminating the cavity mode as before\nand using the fact that there is no input field at t = 2π/∆\nwe find\n√\n2Γ ηF\n2π\n2π\n√\nEout (t) = −\nEin (t −\n) = − ηF Ein (t −\n),\nκ+Γ\n∆\n∆\n(10)\nwhere the last equality holds under the impedance\nmatching condition (κ = Γ). One sees that the readout efficiency is only limited by the finesse of the atomic\nfrequency comb, which without the cavity would correspond to an infinitely high optical depth d [21].\nThe above treatment applies to the regime where R1 ≈\n1 and R2 = 1. More precise results for a general asymmetric cavity can be obtained in the following way. For\nthe absorption it is sufficient to include absorption factors into the usual \"sum over all roundtrips\" treatment\nof a Fabry-Perot cavity. This yields\nEout\n\n√\n√\n− R1 + R2 e−d̃\n= Ein\n√\n1 − R1 R2 e−d̃\n\n0.8\n\nEfficiency\n\nP P̃\n ̇ = −κE(t) − √\nE(t)\n2κ\n\n1.0\n\n(11)\n\non resonance, where d ̃ is the optical depth of the crystal inside the cavity (averaged over the frequency comb,\ncf. Ref. [21]). One sees that perfect absorption is still\n√\n√\nachievable provided that R1 = R2 e−d̃ , which is the\nimpedance condition [22].\nA similar treatment is possible for the memory readout. From Ref. [21] it is known that the readout efficiency can be obtained via a \"sum over all amplitudes\"\napproach. For example, for forward readout the relevant\n\n0.6\n0.4\n0.2\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nMirror reflectivity R1\nFIG. 2: (Color online) We here show the efficiency of an AFCcavity quantum memory in an asymmetric cavity (R2 =0.999)\nas a function of the input mirror reflectivity R1 , based on\nEq. 14. We show the result for different comb finesse FA =10\n(solid line), FA =6 (dashed line) and FA =4 (dashed-dotted\nline). The single-pass effective absorption depth was set to\n ̃\nd=0.1,\nwhich in a memory without cavity would bound the\nefficiency to ∼1% (by use of Eq. 12). In the figure one clearly\nobserves the great enhancement of memory efficiency using\n ̃ ≈ 0.82,\nan impedance-matched cavity, i.e. at R1 = exp(−2d)\nreaching η ∼92% for FA =10. At this point the efficiency is\nonly limited by irreversible atomic dephasing due to the finite\ncomb finesse FA . We also plot the reflectivity of the combined AFC-cavity system (dotted line), showing the complete\nabsorption of light at the optimal point.\n\nefficiency factor is given by Eq. (A19) of Ref. [21],\nZL\n\ndze−α̃z/2 α̃e−α̃(L−z)/2 = α̃Le−α̃L/2 ,\n\n(12)\n\n0\n\nwhere L is the length of the crystal, α̃ is the absorption\n ̃ and one integrates over all possible\ncoefficient (α̃L = d),\npoints of absorption z. The first factor under the integral corresponds to the amplitude for the photon to be\ntransmitted to the point z, the second factor can be interpreted as the amplitude for absorption and re-emission\n(in z), and the third factor is the amplitude to be transmitted from z to the end of the crystal after re-emission.\nThis can be generalized for a Fabry-Perot cavity, taking\ninto account the fact that the photon can do an arbitrary\nnumber of round trips in the cavity before absorption and\nafter re-emission. The result is\n√\n√\nZ\ne−α̃(L−z)/2 e−α̃L/2 T1 R2\nT1 e−α̃z/2\nα̃\n, (13)\n2 dz\n√\n√\n1 − R1 R2 e−d̃\n1 − R1 R2 e−d̃\nwhere T1 = 1 − R1 is the transmission of the first mirror.\nAgain the first factor under the integral corresponds to\npropagation before absorption, the second factor is the\n\n\f4\nabsorption and re-emission amplitude, and the third factor is for propagation after re-emission. The factor of 2 in\nfront of the integral stems from the fact that the photon\ncan be absorbed while propagating either in forward or\nin backward direction. Note that inside the cavity there\nis no change of direction upon re-emission. (Of course,\nthe output field of the asymmetric cavity propagates predominantly in the opposite direction to the input field,\nbut this is an automatic consequence of the interference\nbetween all the possible paths.) Simplifying the above\n√\nexpression, and multiplying by ηF to take into account\nthe irreversible component of the atomic dephasing, one\nobtains the following expression for the square root of the\ntotal memory efficiency η (as is customary for quantum\nmemories, we define efficiencies with respect to intensities, not amplitudes),\n√\n ̃ −d̃ T1 R2 √ηF\n2de\n√\n.\nη=\n√\n(1 − R1 R2 e−d̃ )2\n\nIn conclusion, we have shown that impedance matching\nto an optical cavity allows the implementation of highly\nefficient quantum memories for an effective optical depth\nof only one. Our proposal should make it much easier for\nexperiments to reach the truly high efficiency regime.\nThe authors acknowledge useful discussions with H. de\nRiedmatten, N. Sangouard, N. Gisin and J.-L. Le Gouët.\nThis work was supported by the Swiss NCCR Quantum\nPhotonics, the EU projects Quessence and QuRep.\nNote added. When this work was completed, we became aware of a recent related proposal [25].\n\n(14)\n\n√\nOur previous results correspond to the limit R1 = 1 − ǫ\nwith ǫ ≪ 1, R2 = 1, d ̃ ≪ 1. In this case Eq. (14) becomes\n√\n2d ̃ ηF\n√\nη=\n,\nǫ + d ̃\n\nreflectivity of the second mirror R2 , thus introducing a\nloss to the environment. For the example above, R2 =0.99\ninstead of R2 =0.999 would reduce the efficiency to 84%.\nPractically a good AR-coating on the crystal should keep\nthe losses low enough.\n\n(15)\n\nso that we recover our previous result (η = ηF ) under the\nimpedance matching condition, which is now expressed\n ̃\nas ǫ = d.\nThe total memory efficiency η (which includes absorption and re-emission) is shown in Fig. 2 as a function\nof input mirror reflectivity R1 . Clearly one can achieve\nvery high efficiency for low reflectivities (in the context of\noptical cavities) and for very reasonable optical depths.\nFor example, a memory with a peak optical depth d=1\nand AFC finesse FA =10, such that d ̃ = 0.1, has an efficiency of only 1% without cavity, but can be boosted to\n92% efficiency by an impedance-matched cavity of finesse\nFC ≈ 31.\nAn impedance-matched cavity memory can be operated for a large variety of conditions. Equation (14) allows us to find the best working conditions for a particular situation. There are some assumptions, however,\nthat must be fulfilled. The quantum memory bandwidth\nmust be significantly smaller than the width of the optical cavity in order to fulfill the resonance condition used\nabove. As an example, if we assume a cavity length L=1\ncm (reasonable for typical crystal dimensions) the cavity\nwidth would be ≈480 MHz for the example above. We\nhave also assumed that the cavity has no losses. In general the losses must clearly be significantly lower than the\nmemory absorption probability (per single pass). The effect of losses can be evaluated, however, by changing the\n\n[1] C. Simon et al., arXiv:1003.1107, to appear in Eur. Phys.\nJ. D.\n[2] A.I. Lvovsky, B.C. Sanders, and W. Tittel, Nat. Phot. 3,\n706 (2009).\n[3] K. Hammerer, A.S. Sørensen, and E.S. Polzik,\narXiv:0807.3358, to appear in Rev. Mod. Phys.\n[4] W. Tittel et al., Laser and Photon. Rev. 4, 244 (2010).\n[5] H.-J. Briegel et al., Phys. Rev. Lett. 81, 5932 (1998); N.\nSangouard et al., arXiv:0906.2699.\n[6] P. Kok et al., Rev. Mod. Phys. 79, 135 (2007).\n[7] T. Chanelière et al., Nature 438, 833 (2005).\n[8] M. D. Eisaman et al., Nature 438, 837 (2005).\n[9] I. Novikova et al., Phys. Rev. Lett 98, 243602 (2007).\n[10] K. S. Choi et al., Nature 452, 67 (2008).\n[11] H. de Riedmatten et al., Nature 456, 773 (2008)\n[12] M. Hosseini et al., Nature 461, 241 (2009).\n[13] K. F. Reim et al., Nature Photonics 4, 218 (2010).\n[14] M. Sabooni et al., arXiv:0912.2525\n[15] T. Chanelière et al., New J. Phys. 12, 023025 (2010).\n[16] I. Usmani et al., Nature Communications 1, 12 (2010).\n[17] J. Simon et al., Phys. Rev. Lett. 98, 183601 (2007).\n[18] M. P. Hedges, M. J. Sellars, Y.-M. Li, and J. J. Longdell,\nA Solid State Quantum Memory, poster shown at International Conference on Hole Burning, Single Molecule,\nand Related Spectroscopies (HBSM 2009), Palm Cove,\nAustralia, 22 to 27 June 2009.\n[19] G. Hétet et al., Phys. Rev. Lett. 100, 023601 (2008).\n[20] A. V. Gorshkov et al., Phys. Rev. A 76, 033804 (2007).\n[21] M. Afzelius et al., Phys. Rev. A 79, 052329 (2009).\n[22] A. E. Siegman, Lasers (University of Science Books,\nSausalito, Calif., 1986).\n[23] M. Fleischhauer, S. F. Yelin, M. D. Lukin, Opt. Comm.\n179, 395 (2000).\n[24] M. Afzelius et al., Phys. Rev. Lett 104, 040503 (2010).\n[25] S. A. Moiseev, S. N. Andrianov, F. F. Gubaidullin,\narXiv:1004.1370.\n\n\f"}