{"id": "http://arxiv.org/abs/0907.1929v1", "guidislink": true, "updated": "2009-07-11T00:16:03Z", "updated_parsed": [2009, 7, 11, 0, 16, 3, 5, 192, 0], "published": "2009-07-11T00:16:03Z", "published_parsed": [2009, 7, 11, 0, 16, 3, 5, 192, 0], "title": "A search for p-modes and other variability in the binary system 85\n  Pegasi using MOST photometry", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4631%2C0907.5207%2C0907.4201%2C0907.5536%2C0907.1354%2C0907.4654%2C0907.5246%2C0907.3426%2C0907.2069%2C0907.2670%2C0907.0434%2C0907.1328%2C0907.1061%2C0907.4226%2C0907.2547%2C0907.1590%2C0907.0485%2C0907.4426%2C0907.3134%2C0907.1620%2C0907.1261%2C0907.1235%2C0907.1403%2C0907.0383%2C0907.1449%2C0907.2225%2C0907.2802%2C0907.1565%2C0907.5113%2C0907.4133%2C0907.0341%2C0907.1968%2C0907.3285%2C0907.3847%2C0907.1684%2C0907.5522%2C0907.4154%2C0907.4965%2C0907.3153%2C0907.5566%2C0907.0779%2C0907.4987%2C0907.2441%2C0907.2964%2C0907.5015%2C0907.3506%2C0907.4636%2C0907.5122%2C0907.0302%2C0907.5395%2C0907.4967%2C0907.3318%2C0907.1131%2C0907.4030%2C0907.1929%2C0907.1115%2C0907.1961%2C0907.0646%2C0907.4608%2C0907.2665%2C0907.4404%2C0907.3843%2C0907.4937%2C0907.1604%2C0907.4817%2C0907.2044%2C0907.4164%2C0907.2445%2C0907.1016%2C0907.3997%2C0907.4691%2C0907.1009%2C0907.3598%2C0907.4180%2C0907.1303%2C0907.3534%2C0907.2626%2C0907.1529%2C0907.1455%2C0907.4619%2C0907.2776%2C0907.2221%2C0907.4687%2C0907.0533%2C0907.4082%2C0907.0210%2C0907.1374%2C0907.2381%2C0907.0095%2C0907.2600%2C0907.4810%2C0907.2856%2C0907.2476%2C0907.1355%2C0907.0579%2C0907.2871%2C0907.1519%2C0907.2066%2C0907.3041%2C0907.2357%2C0907.4790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A search for p-modes and other variability in the binary system 85\n  Pegasi using MOST photometry"}, "summary": "Context: Asteroseismology has great potential for the study of metal-poor\nstars due to its sensitivity to determine stellar ages. Aims: Our goal was to\ndetect p-mode oscillations in the metal-poor sub-dwarf 85 Peg A and to search\nfor other variability on longer timescales. Methods: We have obtained\ncontinuous high-precision photometry of the binary system 85 Pegasi with the\nMOST space telescope in two seasons (2005 & 2007). Furthermore, we redetermined\nvsini for 85 Peg A using high resolution spectra obtained through the ESO\narchive, and used photometric spot modeling to interpret long periodic\nvariations. Results: Our frequency analysis yields no convincing evidence for\np-modes significantly above a noise level of 4 ppm. Using simulated p-mode\npatterns we provide upper RMS amplitude limits for 85 Peg A. The light curve\nshows evidence for variability with a period of about 11 d and this periodicity\nis also seen in the follow up run in 2007; however, as different methods to\nremove instrumental trends in the 2005 run yield vastly different results, the\nexact shape and periodicity of the 2005 variability remain uncertain. Our\nre-determined vsini value for 85 Peg A is comparable to previous studies and we\nprovide realistic uncertainties for this parameter. Using these values in\ncombination with simple photometric spot models we are able to reconstruct the\nobserved variations. Conclusions: The null-detection of p-modes in 85 Peg A is\nconsistent with theoretical values for pulsation amplitudes in this star. The\ndetected long-periodic variation must await confirmation by further\nobservations with similar or better precision and long-term stability. If the\n11 d periodicity is real, rotational modulation of surface features on one of\nthe components is the most likely explanation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.4631%2C0907.5207%2C0907.4201%2C0907.5536%2C0907.1354%2C0907.4654%2C0907.5246%2C0907.3426%2C0907.2069%2C0907.2670%2C0907.0434%2C0907.1328%2C0907.1061%2C0907.4226%2C0907.2547%2C0907.1590%2C0907.0485%2C0907.4426%2C0907.3134%2C0907.1620%2C0907.1261%2C0907.1235%2C0907.1403%2C0907.0383%2C0907.1449%2C0907.2225%2C0907.2802%2C0907.1565%2C0907.5113%2C0907.4133%2C0907.0341%2C0907.1968%2C0907.3285%2C0907.3847%2C0907.1684%2C0907.5522%2C0907.4154%2C0907.4965%2C0907.3153%2C0907.5566%2C0907.0779%2C0907.4987%2C0907.2441%2C0907.2964%2C0907.5015%2C0907.3506%2C0907.4636%2C0907.5122%2C0907.0302%2C0907.5395%2C0907.4967%2C0907.3318%2C0907.1131%2C0907.4030%2C0907.1929%2C0907.1115%2C0907.1961%2C0907.0646%2C0907.4608%2C0907.2665%2C0907.4404%2C0907.3843%2C0907.4937%2C0907.1604%2C0907.4817%2C0907.2044%2C0907.4164%2C0907.2445%2C0907.1016%2C0907.3997%2C0907.4691%2C0907.1009%2C0907.3598%2C0907.4180%2C0907.1303%2C0907.3534%2C0907.2626%2C0907.1529%2C0907.1455%2C0907.4619%2C0907.2776%2C0907.2221%2C0907.4687%2C0907.0533%2C0907.4082%2C0907.0210%2C0907.1374%2C0907.2381%2C0907.0095%2C0907.2600%2C0907.4810%2C0907.2856%2C0907.2476%2C0907.1355%2C0907.0579%2C0907.2871%2C0907.1519%2C0907.2066%2C0907.3041%2C0907.2357%2C0907.4790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Context: Asteroseismology has great potential for the study of metal-poor\nstars due to its sensitivity to determine stellar ages. Aims: Our goal was to\ndetect p-mode oscillations in the metal-poor sub-dwarf 85 Peg A and to search\nfor other variability on longer timescales. Methods: We have obtained\ncontinuous high-precision photometry of the binary system 85 Pegasi with the\nMOST space telescope in two seasons (2005 & 2007). Furthermore, we redetermined\nvsini for 85 Peg A using high resolution spectra obtained through the ESO\narchive, and used photometric spot modeling to interpret long periodic\nvariations. Results: Our frequency analysis yields no convincing evidence for\np-modes significantly above a noise level of 4 ppm. Using simulated p-mode\npatterns we provide upper RMS amplitude limits for 85 Peg A. The light curve\nshows evidence for variability with a period of about 11 d and this periodicity\nis also seen in the follow up run in 2007; however, as different methods to\nremove instrumental trends in the 2005 run yield vastly different results, the\nexact shape and periodicity of the 2005 variability remain uncertain. Our\nre-determined vsini value for 85 Peg A is comparable to previous studies and we\nprovide realistic uncertainties for this parameter. Using these values in\ncombination with simple photometric spot models we are able to reconstruct the\nobserved variations. Conclusions: The null-detection of p-modes in 85 Peg A is\nconsistent with theoretical values for pulsation amplitudes in this star. The\ndetected long-periodic variation must await confirmation by further\nobservations with similar or better precision and long-term stability. If the\n11 d periodicity is real, rotational modulation of surface features on one of\nthe components is the most likely explanation."}, "authors": ["D. Huber", "J. M. Matthews", "B. Croll", "M. Obbrugger", "M. Gruberbauer", "D. B. Guenther", "W. W. Weiss", "J. F. Rowe", "T. Kallinger", "R. Kuschnig", "A. L. Scholtz", "A. F. J. Moffat", "S. Rucinski", "D. Sasselov", "G. A. H. Walker"], "author_detail": {"name": "G. A. H. Walker"}, "author": "G. A. H. Walker", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200912139", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.1929v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.1929v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 9 figures, accepted for publication in A&A", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.1929v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.1929v1", "journal_reference": null, "doi": "10.1051/0004-6361/200912139", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 85Peg ̇arxiv ̇v1\nNovember 17, 2018\n\nA search for p-modes and other variability in the binary system\n85 Pegasi using MOST⋆ photometry\n\narXiv:0907.1929v1 [astro-ph.SR] 11 Jul 2009\n\nD. Huber1,10 , J.M. Matthews2 , B. Croll3 , M. Obbrugger1 , M. Gruberbauer1 , D.B. Guenther4 , W.W. Weiss1 , J.F. Rowe5 ,\nT. Kallinger1 , R. Kuschnig1 , A.L. Scholtz6 , A.F.J. Moffat7 , S. Rucinski3 , D. Sasselov8 , and G.A.H. Walker9\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\nInstitute for Astronomy, University of Vienna, Türkenschanzstrasse 17, 1180 Vienna, Austria\nDept. of Physics and Astronomy, University of British Columbia, 6224 Agricultural Road, Vancouver, BC V6T 1Z1, Canada\nDept. of Astronomy and Astrophysics, University of Toronto, 50 St. George Street, Toronto, ON M5S 3H4, Canada\nDept. of Astronomy and Physics, St. Mary's University, Halifax, NS B3H 3C3, Canada\nNASA-Ames Research Park, Mail Stop 244-30, Moffett Field, CA 94035-1000, USA\nInstitute for Communications and Radio-Frequency Engineering, Vienna University of Technology, Gusshausstrasse 25-29,\nVienna, Austria\nDépt. de physique, Univ. de Montréal C.P. 6128, Succ. Centre-Ville, Montréal, QC H3C 3J7, Canada\nHarvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138, USA\n1234 Hewlett Place, Victoria, BC V8S 4P7, Canada\nSydney Institute for Astronomy, School of Physics, University of Sydney, NSW 2006, Australia\n\nReceived; accepted\nABSTRACT\n\nContext. Asteroseismology has great potential for the study of metal-poor stars due to its sensitivity to determine stellar ages. Solid\ndetections of oscillation frequencies in stars with well constrained fundamental parameters, combined with a known rotation period,\nshould significantly advance our understanding of stellar structure and evolution in context with metallicity effects.\nAims. Our goal was to detect p-mode oscillations in the metal-poor sub-dwarf 85 Peg A and to search for other variability on longer\ntimescales.\nMethods. We have obtained continuous high-precision optical photometry of the binary system 85 Pegasi with the MOST\n(Microvariability & Oscillations of STars) space telescope in two seasons (2005 & 2007). The light curves were analyzed using\ntraditional Fourier techniques. Furthermore, we redetermined v sin i for 85 Peg A using high resolution spectra obtained through the\nESO archive, and used photometric spot modeling to interpret long periodic variations.\nResults. Our frequency analysis yields no convincing evidence for p-modes significantly above a noise level of 4 ppm. Using simulated p-mode patterns we provide upper RMS amplitude limits for 85 Peg A. After removal of instrumental trends the light curve\nshows evidence for variability with a period of about 11 d and this periodicity is also seen in the follow up run in 2007; however,\nas different methods to remove instrumental trends in the 2005 run yield vastly different results, the exact shape and periodicity of\nthe 2005 variability remain uncertain. Our re-determined v sin i value for 85 Peg A is comparable to previous studies and we provide\nrealistic uncertainties for this parameter. Using these values in combination with simple photometric spot models we are able to reconstruct the observed variations.\nConclusions. The null-detection of p-modes in 85 Peg A is consistent with theoretical values for pulsation amplitudes in this star. The\ndetected long-periodic variation in the 85 Peg system must await confirmation by further observations with similar or better precision\nand long-term stability. If the 11 d periodicity is real, rotational modulation of surface features on one of the components is the most\nlikely explanation.\nKey words. techniques: photometric – stars: individual: HD 224930 – stars: individual: 85 Peg – stars: oscillations – stars: rotation –\nstarspots – binaries:general\n\n1. Introduction\nWith observations dating back to the mid-19th century by Baily\n(1845), 85 Pegasi (HD 224930) is a very well studied visual binary system with an angular separation of 0.83 arcseconds. Due\nto its proximity (d = 12 pc) and brightness (V = 5.75), the orbital elements have been determined to high accuracy through\nphotometry and spectroscopy. Griffin (2004) provides a comprehensive review of the wealth of data obtained for the 85 Peg sysSend offprint requests to: Daniel Huber, huber@astro.univie.ac.at\n⋆\nBased on data from the MOST satellite, a Canadian Space Agency\nmission, jointly operated by Dynacon Inc., the University of Toronto\nInstitute for Aerospace Studies and the University of British Columbia,\nwith the assistance of the University of Vienna.\n\ntem, including a spectroscopic orbital solution with an orbital\nperiod of 26.31 years and a total mass of 1.49 M⊙ . The dynamically measured relative masses of the binary system, however,\nindicating a secondary equally or only slightly less massive than\n85 Peg A, disagree with the observed magnitude difference of\n∆mV ≃ 3 between the components. It was suggested as early\nas 1948 by Hall (1948) that the secondary star in 85 Peg may be\nitself a binary system. Evolutionary models by Fernandes et al.\n(2002), D'Antona et al. (2005) and Bach et al. (2007) all support\nthe binarity of 85 Peg B.\nThe primary 85 Peg A is metal-poor, with measurements\nof [Fe/H] = −0.88 (Allende Prieto et al. 2004), −0.78\n(Holmberg et al. 2007) and [M/H] = −0.69 (van't Veer 2000; cf.\nFernandes et al. 2002). The space velocity of the star, along with\n\n\f2\n\nD. Huber et al.: MOST photometry of 85 Pegasi\n\nTable 1. Main parameters of 85 Peg A and B compiled\nfrom the literature. Values in brackets for component B\nare suggested values by D'Antona et al. (2005) for the suspected binary system 85 Peg Ba and Bb. Reference coding:\n(1) ten Brummelaar et al. (2000), (2) Fulbright (2000), (3)\nGriffin (2004), (4) D'Antona et al. (2005), (5) Bach et al. (2007),\n(6) Fernandes et al. (2002), (7) van't Veer et al. (2005); cf.\nD'Antona et al. (2005), (8) Holmberg et al. (2007)\nparameter\nV [mag]\nSp.Type\nM/M⊙\nL/L⊙\nT eff [K]\nlog g\n[Fe/H]\nage [Gyr]\n\n85 Peg A\n5.81 ± 0.03\nG5 IV\n0.77 ± 0.05\n0.617 ± 0.02\n5600 ± 50\n4.6 ± 0.1\n−0.78\n9.3 ± 0.5\n\n85 Peg B [a,b]\n8.89 ± 0.29\nK6–8 V\n0.72 ± 0.05 [0.5,0.2]\n0.072 ± 0.03 [0.064,0.0085]\n4200 ± 200\n4.8 ± 0.2\n-\n\nRef\n1\n2\n3,4,5\n4,6\n6\n4,7\n8\n4\n\nits low metallicity, qualify it as a sub-dwarf. 85 Peg A was classified as a G5 sub-dwarf by Fulbright (2000). Based on only the\nvisual magnitude difference (neglecting the contradicting mass\nratio from the orbital solution), 85 Peg B is usually assumed to\nbe a K6–8 dwarf.\nFernandes et al. (2002) modeled the initial abundances, age\nand mixing-length parameters of 85 Peg A and estimated an age\nof 9.3 ± 0.5 Gyr. Using effective temperatures derived from spectroscopy and the measured Hipparcos parallax, D'Antona et al.\n(2005) computed evolutionary tracks for a set of possible metallicities and ages of the system. Their evolutionary models allow ages between about 8 and 14 Gyr. They generated pulsational eigenspectra from their models, predicting that solar-like\np-modes of low degree (l = 0–3) in 85 Peg A could occur across\na frequency range of 1–5 mHz (≃ 80–400 d−1 ). Table 1 lists\nall important parameters concerning the binary system 85 Peg\nwhich are relevant for this paper.\nThe detection of oscillations in stars like 85 Peg A is particularly interesting due to the sensitivity of asteroseismology\nto determine stellar ages. While the small frequency separation is the more sensitive observable for this purpose, even a\nmeasurement of the large separation considerably constrains\nthe parameter space which often is more uncertain for metalpoor objects than for other stars. The first successful application of asteroseismology to constrain the age of a metal-poor\nstar has been performed by Bedding et al. (2006) using Doppler\nvelocity observations of the subgiant ν Indi ([Fe/H] = −1.4).\nEven before that, Mosser et al. (2005) detected oscillations in\nvelocity measurements of HD 49933 ([Fe/H] = −0.4) which\nwere confirmed photometrically by the CoRoT space telescope\n(Appourchaux et al. 2008; Michel et al. 2008). The rich oscillation spectrum of HD 49933 has recently been subject to some\ndiscussion, in particular in context with its fundamental parameters (Bruntt et al. 2008; Ryabchikova et al. 2009; Bruntt et al.\n2009, accepted) and the ability to model the oscillation frequencies (Kallinger et al. 2008a), underlining the importance of\nstudying stellar oscillations in metal-poor objects with well constrained parameters. Further recent detections of solar-like oscillations in metal-poor stars include the CoRoT timeseries of\nHD 181906 ([Fe/H] = −0.1) (Michel et al. 2008) and Doppler\nmeasurements of HD 203608 (Mosser et al. 2008) ([Fe/H] =\n−0.65).\nThe detection of p-modes and the measurement of the large\nand small frequency spacings in the high-overtone eigenspec-\n\ntrum of 85 Peg A would put important constraints on its mass\nand age. If the star were as old as 12 Gyr or more, this would\nalso place a meaningful lower limit on the age of the Galaxy. For\nthese reasons, even before the work of Fernandes et al. (2002)\nand D'Antona et al. (2005), 85 Peg was selected as a primary science target for the MOST space mission, to search for p-modes\nin the metal-poor sub-dwarf component of the binary. The continuous time coverage, high sampling rate and high photometric\nprecision of the MOST photometry also make the data suited to\nsearch for other variability in the binary system.\n\n2. MOST observations & data reduction\nThe MOST (Microvariability & Oscillations of STars) space\nmission is the first satellite designed to specifically conduct asteroseismic observations of stars (Walker et al. 2003; Matthews\n2007). Equipped with a 15 cm Rumak-Maksutov telescope feeding a CCD photometer through a custom broadband optical filter\n(350–700 nm), MOST can collect rapid high-precision photometry of bright stars with nearly uninterrupted coverage for up to\n2 months.\nDepending on the brightness of the target of interest, MOST\nuses two different observing modes. In the primary mode, the\ntarget starlight enters a field stop about 1 arcmin in diameter and\nilluminates an extended fixed image of the telescope pupil on the\nscience CCD detector using a Fabry microlens. For fainter stars,\ndirect photometry of stars is obtained corresponding to traditional CCD photometry with a FWHM of about 2–3 pixels. With\na pixel scale of ∼ 3 arcsec, the binary nature of 85 Peg remains\nunresolved (the integrated signal, however, being dominated by\n85 Peg A which is about 16× brighter than its companion based\non the observed visual magnitude difference).\nMOST observed 85 Peg in 2005 and 2007. In 2005, the visual brightness limit for the primary observing mode was V ∼ 6,\nmaking 85 Peg (V = 5.75) the faintest star ever observed using Fabry imaging. In early 2006, the satellite tracking CCD\nstopped functioning, most likely due to a strong particle hit.\nConsequently, guide star observations had to be relocated to\nthe science CCD, limiting the exposure times for the program\nstars and constraining the brightness limit for Fabry Imaging.\nTherefore, 85 Peg was observed using direct imaging in the\nfollow-up run in 2007.\nFor both observation modes, data reduction pipelines have\nbeen developed and are fully described by Reegen et al.\n(2006) for Fabry imaging and Rowe et al. (2006) as well as\nHuber & Reegen (2008) for direct imaging. The main issue in\nMOST data reduction is the removal of stray light influences\nfrom the data. In all programs, the concept of decorrelation is\nused which is based on the comparison of intensities originating from the star with intensities of background readings. The\n85 Peg datasets were reduced according to the routines described\nby Reegen et al. (2006) and Huber & Reegen (2008).\n85 Peg was observed by MOST in 2005 for 25.6 days with\nalmost no interruptions. The exposure time was 50 seconds with\na sampling interval of 55 seconds. After outlier corrections in\nthe reduction pipeline the final light curve consisted of 34,323\nmeasurements in total. The reduced light curve shows very good\nquality with point-to-point scatter of 0.48 mmag, making it well\nsuited to search for p-mode oscillations. In 2007, MOST returned to 85 Peg for another run spanning a total of 25.5 days,\nthis time with observations being performed in direct imaging mode with considerably shorter exposure times and images\nmostly being obtained every fifth MOST orbit. Due to the more\ndifficult thermal conditions caused by target switching, the data\n\n\fD. Huber et al.: MOST photometry of 85 Pegasi\n\nTable 2. Observation log of the MOST 85 Peg runs in 2005 and\n2007. Values in brackets for the 2007 run correspond to the light\ncurve with 4 datapoint bins (in order to make the scatter comparable to the 2005 run).\n2005\n2085.43\n2111.01\n25.58\n34,323\n85\n50\n55\n0.48\n\n2007\n2830.81\n2842.50\n11.69\n5 738\n14\n13.25 [53]\n25 [100]\n0.83 [0.51]\n\n50\n\n1\n0.8\n\nw(f)\n\n40\n\nAmplitude [ppm]\n\nobservation run\nstart date [HJD-2451545]\nend date [HJD-2451545]\ntotal obs. time [d]\nnumber of exposures\nduty cycle [%]\nexposure time [sec]\nsampling time [sec]\npoint-to-point scatter [mmag]\n\n3\n\n30\n\n0.6\n0.4\n0.2\n0\n-1\n\n0\n\n-0.5\n\n0.5\n\n1\n\nFrequency [mHz]\n\n20\n\n10\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nFrequency [mHz]\n\nare influenced by strong instrumental trends, which in particular\naffected the beginning and end of the run. Therefore, only the\ncentral part of the light curve spanning over about 12 days was\nused for the analysis. The data also show a slightly higher scatter than the earlier run, with an increased point-to-point spread\nof the light curve binned to about the same exposure time as the\n2005 data. An observation log for both runs is given in Table 2.\n\nFig. 1. Fourier amplitude spectrum of the 2005 MOST light\ncurve of 85 Peg in the frequency region where p-modes have\nbeen predicted. Vertical dotted lines correspond to harmonics\nof the orbital frequency of the MOST satellite. The horizontal dashed line shows the 3.5 σ detection limit (corresponding\nroughly to a spectral significance of 4) for the noise level in this\nfrequency region. The insert displays the window function of the\nlight curve.\n\n3. The search for p-modes\n3.1. Frequency analysis\n\nDue to the data quality difference, the search for p-modes was\nonly performed in the 2005 data, using Fourier analysis and least\nsquares fitting. The significances of identified peaks were estimated with SigSpec (Reegen 2007) which, based on a falsealarm probability, incorporates frequency, amplitude and phase\ninformation into the calculation. Significant frequencies are\nidentified through consecutive prewhitening and least squares\nfits. The analysis was performed up to the Nyquist frequency\nof the data set (νNyq ≃ 9 mHz ≃ 780 d−1 ).\nFigure 1 shows the Fourier amplitude spectrum in the frequency region where p-modes have been predicted. The amplitudes have been normalized by N/2 where N is the number of\ndatapoints in the light curve. The largest peaks in the amplitude\nspectrum are residuals of the background variation at the orbital\nfrequency of the MOST satellite (164 μHz = 14.19 d−1 ) and its\nharmonics, marked in Figure 1 by vertically dotted lines. Note\nthat even the largest of these has an amplitude of only about\n35 ppm (0.035 mmag), and above a frequency of 2.5 mHz, there\nis only one with an amplitude as high as 15 ppm. There is also\nsome power in sidelobes of the harmonics of the satellite orbital\nfrequency, spaced by 1 and 2 d−1 , due to the daily modulation of\nscattered earthshine.\nAside from these instrumental frequencies, there is no apparent power excess above the noise level visible in the spectrum.\nThe SigSpec analysis shows that, above 0.57 mHz (50 d−1 ), there\nare only two peaks (not associated with MOST orbital harmonics or 1 d−1 sidelobes) with a significance greater than 4 (corresponding to an amplitude S/N of about 3.5). One of these peaks\ncan be seen in Figure 1 near 2.55 mHz.\n3.2. Estimation of the detection limit\n\nThe MOST observations constitute the first large-scale dedicated\nobserving effort to detect p-mode oscillations in the 85 Peg system. Despite the null-result, the data should allow us to draw\nvaluable conclusions for future efforts by setting firm limits on\nthe possible pulsation properties of 85 Peg A.\n\nConsidering the average noise level of 4 ppm in the amplitude spectra at a frequency range where the p-modes are predicted by theory, we can set an upper limit of pulsation in the\nMOST observations in Fourier domain to about 14–18 ppm, assuming a 3.5–4.5 σ detection limit. Simulations of 11 coherent\nsinusoidal variations inserted into the MOST photometry spaced\nby ∆ν = 170 μHz (a value lying in the range of the models calculated by D'Antona et al. (2005)) and centered around 3.4 mHz\n(using the relation of Kjeldsen & Bedding (1995) for the estimated mass, radius and effective temperature of 85 Peg A)\nshowed that peaks with amplitudes of 15 ppm are securely recovered using the same approach as in the real data using SigSpec.\nNote that this limit is only valid under the assumption that the\nmode lifetimes are longer than the observation timebase and\ntherefore can be modelled as coherent sinusoidal variations.\nGoing one step further, we have also included the nature of\nthe pulsation in the simulations. It is widely accepted that pmode oscillations in sun-like stars are driven by turbulent motions in the convective layers in the stars, causing a stochastic\nexcitation and subsequent damping of the pulsation modes rather\nthan a coherent oscillation. It has been shown that the lifetimes\nof the oscillations for sun-like stars are very short, i.e. on the\norder of a couple of days (e.g. for α Cen A, see Bedding et al.\n2004), while both short as well as substantially longer lifetimes\n(i.e. on the order of weeks or months) have been detected in\ngiant and subgiant stars (Stello et al. 2006; Carrier et al. 2007;\nKallinger et al. 2008b). While the situation of subdwarf stars remains undetermined, it seems appropriate from these results that\nwith a dataset as long as the MOST observations the effects of\nstochastically driven pulsation should not be neglected.\nThe main effect when analyzing such signals in the Fourier\ndomain is that the oscillation will not be described purely by the\nwindow function of the dataset, but rather by a series of peaks\nscattered around the true frequency value. The shape of this distribution is commonly described by a Lorentzian profile with the\nFWHM of the profile being correlated to the mode lifetime and\nthe height, in combination with the width, being related to the\ntotal energy of the pulsation mode (Houdek 2006). Hence, the\n\n\f4\n\nD. Huber et al.: MOST photometry of 85 Pegasi\n\nresulting amplitude of a mode in a Fourier spectrum is not only\nsimply dependent on the maximum displacement in the time series, but also on the amount of damping and the resulting mean\nvariation in the data set. As given by Baudin et al. (2005) and\nBarban et al. (2007), the mean mode amplitude A can be expressed as\n1\nT\nH= H\n4τ\n4τ\n\n(1)\n\nwith T denoting the effective length of the dataset, τ is the\nmode lifetime, H the height of the Lorentzian profile in power\n(ppm2) and H the height of the Lorentzian profile in power density (ppm2 Hz−1 )1 . The effective dataset length T is evaluated as\nthe reciprocal value of the area under the spectral window (in\npower), and in the case of the MOST 85 Peg observations gives\nT = 1.8895 Msec = 21.869 d.\nTo investigate limits on the mean mode amplitude for\n85 Peg A, we simulated solar-like oscillations implementing the\nconcept by Chaplin et al. (1997) adapted to the sampling of the\nMOST 85 Peg 2005 time series. Using the same input frequencies as in the simulations containing coherent signal as described\nabove, about 1000 datasets were generated for mode lifetimes\nranging from 1–26 d in steps of 1 d and for mean amplitudes\nfrom 1–40 ppm in steps of 1 ppm. Note that in order to keep\nthe computation time reasonable and to solely study the effects of different amplitudes and mode lifetimes, each simulation\nwas computed as a single realization (i.e. the stochastic excitation/damping pattern was the same for each simulated data set).\nThe mean mode amplitude (which was set to the same value for\nall frequencies) was simulated by setting the time-domain standard deviation of a single realization to a fixed value Arms . Note\nthat this value is not the same as the maximum peak height in the\nresulting Fourier spectrum, which is a priori unknown. In the following, the standard deviation of the variation in the time domain\nwill be denoted RMS amplitude, while the resulting peak height\nin the Fourier spectrum will be referred to as Fourier amplitude.\nFor each simulation, the mean S/N ratio of the six highest peaks\nwas calculated (i.e., we assumed 6 out of 11 frequencies to be\na successful detection of p-mode pulsation). The results of the\nsimulations are shown in Figure 2.\nNot surprisingly, the simulations show that oscillations with\nlarger amplitudes and longer mode lifetimes would be easier to\ndetect. For example, an RMS amplitude of 16 ppm of the oscillations would remain undetected if the mode lifetimes are\nvery short, even though Fourier domain noise would in principle allow a 4 σ detection. Only for lifetimes getting closer to the\nlength of the dataset are the expected S/N ratios as known for\na coherent signal fulfilled (e.g., a coherent sinusoidal variation\nwith a RMS amplitude of 15 ppm produces a peak amplitude of\nabout 20 ppm, corresponding to a S/N ∼ 5 in the 85 Peg data).\nThe positive influence of longer lifetimes, however, decreases\nrapidly as the lifetime approaches the length of the dataset,\nreaching a detection level of about 10 ppm at τ > 10 d. Note\nthat in Equation 1, H is only representative of the power excess\nheight for large values of T/τ, i.e. when the Lorentzian profile\nis well resolved. This explains why a signal formally described\nby, e.g., H = 18 ppm can remain undetected for long lifetimes\n(i.e. small T/τ) in the MOST photometry simulations. With this\nin mind, the following conclusions on the oscillation properties\nof 85 Peg can be drawn: 1) Independent of the amplitude or the\n\n4\n\n6\n\n8\n\nS/N\n\n10\n\n12\n\n14\n\n16\n\n35\nRMS amplitude [ppm]\n\nA2 =\n\n2\n40\n\n30\n25\n20\n15\n10\n5\n5\n\n10\n15\nMode lifetime [d]\n\n20\n\n25\n\nFig. 2. Signal-to-Noise ratio of the six highest peaks of simulated\nsolar-like pulsation using the MOST 85 Peg data as a function of\nmode lifetime and RMS amplitude in the time domain. Points of\nconstant Lorentzian profile height H are shown as dashed green\nlines (from the top right to the bottom left: 50 ppm, 30 ppm,\n15 ppm and 5 ppm). The thick solid red line shows a power law\nfit to bins of data points with S/N=3.5–4.5.\nmode lifetime of the oscillations, the height of the Lorentzian\nprofiles must be lower than about 20 ppm to remain undetected\nin the MOST data; 2) If the mode lifetimes in 85 Peg are very\nshort (∼ days), the RMS amplitude of the signal must lie below\na level of about 12–18 ppm. If the lifetimes are long (∼ weeks),\nthis limit lies at approximately 10 ppm.\nIn order to predict upper limits for the height of the\nLorentzian profiles for 85 Peg A which are independent of the\nobservation timebase, we converted the values derived from the\nsimulations into power density. The top panel of Figure 4 shows,\nfor each mode lifetime bin of the simulations, data points with\nS/N=3.5–4.5 and the corresponding power law fit in power density. Combined with the Fourier amplitude limit of ∼ 16 ppm set\nby MOST, this provides firm limits on the oscillation properties\nof 85 Peg A and could be used as a prior information to plan and\nanalyze further observations with the goal of detecting solar-like\noscillations in this star.\n3.3. Comparison with theoretical values\n\nIn order to compare our upper limits on the oscillation amplitudes with predictions, we follow the method by Michel et al.\n(2009) to calculate bolometric amplitudes, which are independent of the instrument being used. Using the transmission curve\nof the MOST filter and an effective temperature of 5600 K for\n85 Peg A, we calculate a response function for radial modes of\nR0 = 4.787. Following the convention by Michel et al. (2009),\nwe then convert our upper RMS amplitude limits as derived in\nthe previous section into bolometric amplitudes per radial mode\nas\n!\n4 δI\nAbol,l=0 =\n(t) .\n(2)\nR0 I\n\n1\n\nNote that this relation is only valid when the amplitude spectrum\nis normalized by N/2, where N is the number of datapoints in the time\nseries.\n\nwhere the last term denotes the observed RMS intensity fluctuations, which we identify as our definition of the RMS amplitude.\n\n\fHeight of Lorentzian Profile\n2\n-1\n[ppm Hz ]\n\nD. Huber et al.: MOST photometry of 85 Pegasi\n\n5\n\n800\n600\n400\n200\n\nBolometric Amplitude per\nRadial Mode [ppm]\n\n0\n\n15\n\n10\n\n5\n\n0\n\n0\n\n5\n\n10\n15\nMode Lifetime [d]\n\n20\n\n25\n\nFig. 3. Upper limits on oscillation properties of 85 Peg A as a\nfunction of mode lifetime, based on simulations using MOST\nphotometry. Top panel: Upper limit on the height of the\nLorentzian profile in power density. Bottom panel: Upper limit\non the bolometric amplitude per radial mode. The open square\nshows the expected value based on theoretical scaling relations\nwith 3 σ error bars.\nTheoretical values calibrated to observations indicate\n−1\nthat bolometric photometric amplitudes scale as (L/M)α T eff\n(Kjeldsen & Bedding 1995), with numerical simulations suggesting a value of α ∼ 0.7 (Samadi et al. 2007). Using the solar\nreference value of 2.53 ± 0.11 ppm for Abol,l=0 by Michel et al.\n(2009), the mass, luminosity and effective temperature (with a\nmore conservative error of 100 K) of 85 Peg A yield an expected\ntheoretical amplitude of 2.2±0.2 ppm. As an estimate for the expected mode lifetime we use the recently suggested scaling rela−4\ntion by Chaplin et al. (2009) proposing τ ∝ T eff\n, and with a solar\nreference value of τ⊙ = 3.2 ± 0.2 d (Chaplin et al. 2005) arrive\nat τ = 3.6 ± 0.3 d for the expected mode lifetime of 85 Peg A.\nThe bottom panel of Figure 3 shows the upper limits for\n85 Peg A as derived from the simulations converted to bolometric amplitudes per radial mode, compared to the theoretical values. Clearly, the low value for the theoretical amplitude\nwould in any case remain undetected in the MOST 85 Peg data.\nThis is also true for the mean velocity amplitude of 9 cm s−1\nestimated by Houdek (cf. D'Antona et al. 2005) for a model\nof 85 Peg A, which, using the relation by Kjeldsen & Bedding\n(1995), would translate in a bolometric luminosity amplitude of\n∼1 ppm. Considering these estimated values, we are not able to\ndraw any conclusions about the mode lifetimes for this star and\ncan conclude that our results as upper limits are in agreement\nwith predictions.\n3.4. Solar-type oscillations or wishful thinking?\n\nIn a further investigation of the 2005 data, a relaxed spectral significance limit of 3 (corresponding to a S/N of about 3) was used\n\nFig. 4. Model fitting results as a function of mass using frequencies extracted from randomly generated datasets with a limit of\nS/N ≥ 3. Line labels indicate the number of frequencies out of\nthe total number of detected frequencies in a given dataset used\nfor the fit. The fitting result using the real MOST dataset is also\nshown.\n\nto search for p-modes in the 85 Peg data. In this case, SigSpec\nidentified several peaks which were mostly located in two distinct frequency regions, one reaching from 1–3 mHz, the other\nfrom about 5–7 mHz. Eliminating all signals which are due to\nknown instrumental artifacts and considering only values in the\nfrequency range where p-modes are predicted, these frequency\ncandidates were fitted to a dense grid of 300 000 stellar models (Guenther et al. 1992). The quality of the fit was evaluated\nby a χ2 test, with a value of χ2 ≤ 1 meaning that, on average,\nthe model frequencies that are used in the fit are within the uncertainties of the observed frequencies (see Guenther & Brown\n2004 for details). This attempt resulted in a model fitting to about\n65% of the observed frequencies with a χ2 ≤ 1. This model is in\nagreement with the previously estimated position of 85 Peg A in\nthe HR-Diagram, with a large frequency separation of 172 μHz.\nTo test the credibility of this model fit, we generated 8 simulated datasets, 4 using gaussian distributed random numbers, the\nother half by randomly shuffling the 2005 light curve. In both\ncases the same sampling, frequency analysis and model fitting\nprocedure as for the real light curve was applied. The results of\nthis test are shown in Figure 4, with the fit quality χ2 given as a\nfunction of mass. As the Figure shows, there is indeed one random dataset where frequencies could be extracted that also fit\nwith a χ2 ≤ 1, indicating a similar fit quality as the best model\nderived for the real data.\nThe result of this test underlines that when searching for\nlow-amplitude p-mode oscillations, it is extremely important to\ndiscern real evidence from wishful thinking. In a recent analysis of MOST data on Procyon, Guenther et al. (2008) have\ndemonstrated the risks when searching for comb-like structures\nin power spectra of sun-like stars using a priori assumptions. The\ntest presented here is yet another example for this, showing that\na S/N limit of 3 in amplitude (hence S/N ≥ 9 in power, which is\nmore widely used) is not sufficient to distinguish real signal from\n\n\fAlthough designed as a non-differential photometer, the MOST\nspace telescope has proven to be remarkably stable over long\ntimescales, making it also suited to search for long-periodic variability. Instrumental trends, if present, can in many cases be\nidentified, reconstructed and corrected by analyzing the satellites telemetry data such as board or preamplifier temperature.\nThe 2005 light curve of 85 Peg shows a dominant long-term\ninstrumental trend which is confirmed by inspection of both the\nboard and preamplifier temperature data. All three datasets are\ndisplayed in panels (a), (b) and (c) of Figure 5. In a first attempt\nto correct the trend seen in panel (a), we fitted a polynomial function to the data (dashed line). The residuals of this fit, low-pass\nfiltered to remove residual variability with periods of one day\nand averaged into bins of length 101 min (about one MOST orbital period), show two cycles of a variability with a period of\nabout 11 d and an amplitude of 0.3 mmag (panel (d) of Figure 5).\nThe 2007 data, which showed a less complex instrumental trend\ncorrected by a simple linear fit, seems to confirm this variability detected in 2005, showing one full cycle of a light variation\nwith a comparable period and amplitude (Figure 5, panel (f)).\nCombining the 2005 and 2007 data, a Fourier analysis yields a\nbest fit period of 11.6 d for the variation.\nIn a later stage of the analysis, an attempt was made to correct the 2005 data trend by directly using and fitting the variations seen in the satellite telemetry data2 . For this purpose,\nthe telemetry data were binned to two orbital period means and\nheavily smoothed, so only long-periodic features remain present.\nThese smoothed versions (shown as solid lines in panels (b) and\n(c) of Figure 5) were then correlated to the light curve in two segments of the run, and using the comparison set showing the highest correlation coefficient (in both cases the preamplifier temperature, see panel (b) of Figure 5) all correlations were removed\nusing linear regressions. The resulting fit which was subtracted\nis shown as a solid line in panel (a) of Figure 5. The resulting\nlight curve (panel (e) in Figure 5) shows a much more complex\nbehaviour, with the first cycle of the 11 d variability almost entirely removed.\nThe considerable discrepancy between the results of the two\nbackground removal methods is obviously alarming. However,\nas the variability of the first reduction method was confirmed in\nthe 2007 dataset, we feel that we have observed the ∼ 11 d periodicity in both epochs of data. We stress that without followup observations to confirm the observed variability we cannot\nrule out the possibility that the correlation between the 2005 and\n2007 epochs of data is purely coincidental, and that the variability changed considerably between 2005 and 2007 as illustrated\nwith our second reduction method. It must be noted that the usage of the decorrelation technique in this case assumes a linear relationship of temperature and intensity variability, which\nmight be an oversimplification of the problem. Indeed recent\nresults on the low frequency variability of the MOST data on\nProcyon has shown evidence that telemetry data decorrelation\nseems to overcorrect existing intrinsic variability (Huber et al.,\nin preparation). Thus we feel that the most likely possibility is\nthat we have observed a common ∼ 11 d variability in our two\n2\n\nNote that the brightest star simultaneously observed in the 2005\nrun is ∼ 3 mag fainter and hence no comparison stars can be used for\nthis correction.\n\n0\n-0.002\n-0.004\n258\n\nT [K]\n\n4. Long periodic variability\n\na\n\n0.002\n\nb\n\n259\n260\n261\n306\n\nT [K]\n\npeaks generated from random noise, and can lead to misleading\nresults.\n\nrelative magnitude\n\nD. Huber et al.: MOST photometry of 85 Pegasi\n\nc\n\n308\n310\n312\n2085\n\n5×10\n\n2090\n\n2095\n\n2100\n\n2105\n\n2110\n\n-4\n\nd\n0\n\n-5×10\n\nrelative magnitude\n\n6\n\n5×10\n\n-4\n\n-4\n\ne\n0\n\n-5×10\n\n-4\n\n2085\n\n5×10\n\n2090\n\n2095\n\n2100\n\n2105\n\n-4\n\n2110\n\nf\n\n0\n-5×10\n\n-4\n\n2825\n\n2830\n\n2835\n\n2840\n\n2845\n\n2850\n\nHJD - 2451545\n\nFig. 5. Panel (a): Original 2005 85 Peg light curve (every tenth\ndata point is shown) together with different fits used to correct\nthe instrumental trend (see text). Panel (b): Satellite preamplifier temperature curve (every tenth data point is shown). The\nsolid line shows a smoothed version. Panel (c): Same as panel\n(b) but for satellite board temperature. Panel (d): Binned and\nlow-pass filtered 2005 85 Peg light curve derived by subtracting\na polynomial fit (dashed line in panel (a)). Panel (e): Same as\nin panel (d), but derived by decorrelating variations found in the\nsatellite telemetry data (solid line in Figure panel (a)). Panel (f):\nCorrected 2007 85 Peg light curve. Note that the y-axis scale for\npanels (d), (e) and (f) is the same, but differs from the scale in\npanel (a).\n\nepochs of data. In the following sections we present attempts\nto interpret the variability assuming that the 2005 light curve in\npanel (d) of Figure 5 is indeed intrinsic.\n\n\fD. Huber et al.: MOST photometry of 85 Pegasi\n\nThe variability could originate in either of the two stars in the\nbinary, since the MOST photometry does not resolve the individual components. If it is due to star A, then the amplitude of the\nvariability is 0.3 mmag. If it is due to star B, then the amplitude\nwe observe has been diluted significantly by the light of star A.\nThe intrinsic amplitude would be approximately 5 mmag, based\non the visual magnitude difference of 85 Peg A and 85 Peg B.\nWe have considered two possible explanations of the periodicity: (1) light effects due to the possible binarity of component\nB, and (2) rotational modulation of the light of either star A or B\ndue to surface spots.\n4.1. Binarity of 85 Peg B\n\n85 Peg B has long been suspected to be a multiple system due\nto the discrepancy between the dynamically determined masses\nand the magnitude difference between stars A and B. The shape\nof the light curves in panels (d) and (f) of Figure 5 is not consistent with a simple detached eclipsing binary, but it could be due\nto tidal distortions or backheating in a slightly eccentric binary\nsystem with a period of 11.6 d. Indeed, Griffin (2004) points out\nthat the period of a putative 85 Peg Bb of less than a few weeks\nwould be possible.\nBased on the location of 85 Peg B in the HR diagram and\nby applying a mass-luminosity relation, D'Antona et al. (2005)\nsuggested the luminosities of a possible secondary system to be\nLBa ∼ 0.064 L⊙ and LBb ∼ 0.0085 L⊙ (with the luminosity of the\nprimary LA ∼ 0.617 L⊙). The masses of the components of the\npossible 85 Peg Bab binary are estimated to be MBa ∼ 0.5 M⊙\nand MBb ∼ 0.2 M⊙ (Bach et al. 2007; D'Antona et al. 2005).\nTherefore, an orbital period P = 11.6 d means a semi-major axis\na ∼ 0.09 AU (about 20 R⊙ ). If the stars in 85 Peg B are on the\nmain sequence, then this separation would be about 20× the expected diameter of star Ba.\nThe amplitude of the light variation is about 5 mmag (allowing for dilution by star A), which means the 85 Peg Bab binary\nmust produce a peak-to-peak variation of about 1%. If the light\nvariation is primarily a geometrical effect of tidal distortion, the\nlight curve would be a double wave (with two maxima and two\nminima) during each binary orbit. The latter would mean the binary period would be 2 × 11.6 = 23.2 d. However, for such a\nperiod, the semi-major axis of the orbit would be a ∼ 0.14 AU,\nor about 30× the diameter of star Ba. At this separation, the geometrical distortion of star Ba by tides would be far below 1% and\ncould not account for the full amplitude of the observed variation.\nThe bolometric flux on the surface of star Ba due to star\nBb (LBb ∼ 0.0085 L⊙ at a distance of about 0.1 AU) would be\n∼ 1.5 × 104 W/m2 . The surface flux of star Ba (LBa ∼ 0.064 L⊙;\nR ∼ 0.6 R⊙) would be roughly 1.4×108 W/m2 . Therefore the flux\nratio due to backheating by a putative star Bb is only about 10−4 ,\nand the expected peak-to-peak amplitude would be in the order\nof 120 ppm. This is two orders of magnitude smaller than the observed peak variation in brightness, if that modulation originates\nin component B of the 85 Peg system.\nIs it possible that the brightness ratio of stars A and B is not\n∼16 due to the custom design of the MOST bandpass, and that\nvariability due to star B would not be diluted as much as we have\nassumed? We tested this possibility by generating stellar models\nacross a range of masses, for ages of 8 Gyr, and determining their\nflux ratios measured through the MOST filter (Table 3).\nTo change the flux ratio measured by MOST significantly,\nthe temperature of star A would have to be considerably cooler\nthan measured for this relatively bright star. Even if the the ratio\n\n7\n\nTable 3. Model parameters for several possible configurations\nof the 85 Peg system and flux ratios as measured through the\nMOST custom filter. The deviations in temperature to the observed value given in D'Antona et al. (2005) are given in terms\nof the standard deviation σ. Aobs indicates the observed amplitude scaled with the corresponding flux ratio. The expected amplitude due to backheating of star Bb on star Ba is about 0.1–\n0.2 mmag.\nStar\n\nM\n(M⊙ )\n\nR\n(R⊙ )\n\nT eff\n(K)\n\n∆T\n(σ)\n\nFlux ratio\nA/B\n\nAobs\n(mmag)\n\nA\nBa\nBb\nA\nBa\nBb\nA\nBa\nBb\nA\nBa\nBb\n\n0.90\n0.55\n0.77\n0.72\n0.90\n0.52\n0.20\n0.77\n0.52\n0.20\n\n0.92\n0.48\n0.74\n0.68\n0.92\n0.46\n0.21\n0.74\n0.46\n0.21\n\n5460\n4200\n4845\n4605\n5460\n4160\n3650\n4845\n4160\n3650\n\n3\n0\n15\n2\n3\n0.2\n15\n0.2\n-\n\n14.1\n\n4.5\n\n1.5\n\n0.48\n\n15.2\n\n4.9\n\n5.4\n\n1.7\n\nis lowered by a factor of 3 (last row of Table 3), the observed\namplitude would still be (in the most optimistic case) by about a\nfactor of 9 too low. Therefore, it is unlikely that illumination of\na component Ba by a putative star Bb can easily account for the\namplitude of the observed variation.\n4.2. Rotational modulation\n4.2.1. Determination of rotational velocity\n\nIn order to interpret the variation in terms of rotational modulation, a good knowledge of the projected rotational velocity v sin i is essential. Searching the literature we found measurements in the catalogues of Bernacca & Perinotto (1970) and\nUesugi & Fukuda (1970) giving v sin i values of 3 ± 3 and <\n6 km s−1 , respectively, for 85 Peg A. More recently, Wolff et al.\n(1985) measured v sini ≃ 4 km s−1 and Hale (1994) gives a value\nof 1.8 ± 0.6 km s−1 . The discrepancy between all these measurements is evident, and hence v sin i of 85 Peg A remains a rather\npoorly determined parameter. Note that due to the close separation, no measurements for 85 Peg B are available.\nWith the goal to arrive at an independent v sin i measurement including statistically meaningful uncertainty estimates,\nwe extracted high-resolution (R ∼ 60000) spectra taken with\nthe UVES spectrograph from the ESO archive which were previously used to study star formation in the galaxy through abundance ratios (project number 076.B-0133).\nAfter the pipeline reduction and continuum normalization,\nsynthetic spectra were computed using the program synth3\n(Kochukhov 2007) in conjunction with VALD (Piskunov et al.\n1995; Kupka et al. 1999; Ryabchikova et al. 1999). The fitting\nof the syntheses to the observed Hα line, which can be seen in\nFigure 6, resulted in log g = 4.5 and an effective temperature\nT eff = 5500 K.\nBased on this effective temperature, MARCS model atmospheres (Gustafsson et al. 2008) were chosen for the subsequent analysis. After the equivalent widths were determined using a modified version (Tsymbal 1996) of the WIDTH9 code\n(Kurucz 1993), a microturbulence velocity (vmic ) of 1.3 km s−1\n\n\f8\n\nD. Huber et al.: MOST photometry of 85 Pegasi\n\nFig. 6. Observed UVES spectrum (thick black line) and fitted\nsynthetic spectrum with log g = 4.5 and T eff = 5500 K (thin red\nline).\n\nFig. 8. The marginal distribution of the v sin i parameter derived\nas described in §4.2.1. There is no evidence for a v sin i above\n2.5 km s−1 according to the UVES data we used for our analysis.\ntion pipeline, were interpreted as 1σ-confidence limits and the\nprobability for each model value was calculated according to\n!\n(dO,i − dM,i )2\np(dO,i ) = exp −\n,\n(3)\n2σi 2\n\nFig. 7. The goodness-of-fit of observed to synthetic spectrum of\none Fe line as a function of v sin i and vmac . Bright areas indicate\na good fit.\n\nwas determined by eliminating any abundance-equivalent width\ncorrelation. Specific Fe lines with highly accurate log gf (T.\nRyabchikova, private communication) were used for the v sin i\ndetermination. An Fe abundance of − 0.35 ± 0.05 dex relative\nto the solar value (Asplund et al. 2005) and a radial velocity of\n34.6 km s−1 were adopted to enable a good comparison of observation and synthesis. Since the effects of macroturbulence velocity (vmac ) and v sin i on the goodness-of-fit in the spectrum are\nindistinguishable to the naked eye (see Figure 7), we pursued to\napproximate the marginal distribution of v sin i.\nFor this purpose, we calculated a 2D-grid of synthetic spectra, using the parameter values mentioned above, but with v sin i\nranging from 0 to 4 km s−1 and vmac ranging from 1 to 4 km s−1\nin steps of 0.05. Subsequently, we compared this grid of models\nto the four most clearly defined iron lines in the observed spectrum. However, each of these lines was treated as an independent\nobservation to overall create four probability distributions. The\nerror bars of each observed data point, as delivered by the reduc-\n\nwere dO,i is the i-th observed data point, dM,i is the corresponding model value, and σi the aforementioned 1σ-uncertainty. The\nprobability pM for each model then is the product of the probabilities for all data points.\nWe calculated the marginal distributions of v sin i for each\nline by integrating out the vmac parameter. Since we used a discrete parameter space in our 2D-grid, we summed up the model\nprobabilities over the whole parameter range of vmac for each\nspecific value of v sin i, and normalized the distribution so that\nthe sum of all resulting probabilities is unity. Finally, we combined the marginal distributions of all Fe lines by calculating the\njoint probabilities for all models and, again, normalized the resulting distribution. The final distribution is shown in Figure 8. It\nwas subsequently used as a prior3 for the v sin i parameter in the\nspot model analysis described in the next section. Judging from\nthe distribution alone, we obtain v sin i = 1.40+0.15\n−1.10 (with the uncertainties roughly corresponding to a 1σ confidence limit).\n4.2.2. Spot model fitting\n\nTo test the possibility of rotational modulation, we fit the 2005\nand 2007 light curves (panels (d) and (f) of Figure 5) with simple\nspot models. We employ the StarSpotz functionality discussed\nin Croll et al. (2006a) and Croll (2006), which adopts circular\nspots and applies analytic models described by Budding (1977).\nStarSpotz has been used to measure the differential rotation profile of another MOST target, the young active solar-type star\nκ1 Ceti (Walker et al. 2007) and it was able to account for the\nphotometric variations detected by MOST and constrain the differential rotation coefficient of the exoplanet-hosting star ǫ Eri\n3\n\nIn Bayesian probability analysis, the prior is a probability distribution conveying already existing knowledge about a quantity. The information contained in the prior is used to constrain and assess the final\nprobability of the outcome (see Bayesian inference textbooks for details).\n\n\fD. Huber et al.: MOST photometry of 85 Pegasi\n\n(Croll et al. 2006b). The reader is reminded at this point that in\nthe following modeling efforts we explicitly assume that the variation seen in panel (d) of Figure 5 is intrinsic, and disregard evidence for more complex variability as seen in panel (e) of Figure\n5.\nA separate spot model was generated for components A and\nB of the 85 Peg system. Linear limb darkening coefficients for\nboth stars were estimated using the closest grid points to the\nphysical parameters from D'Antona et al. (2005) in the catalog\nof Claret (2000); these were u ∼ 0.86 for 85 Peg A and u ∼ 0.80\nfor 85 Peg B. Note that considering the uncertainty of the observed variation and the fact that we are only intending to provide a first approximation to model the observed variation, we\nrefrain from using a more complex limb-darkening model in this\napplication. We used a flux contrast between the spotted and\nunspotted photosphere of κw = 0.30 for 85 Peg A and κw = 0.35\nfor 85 Peg B. We are unable to independently determine κw , and\nsmall variations in κw will only serve to decrease or increase the\nsize of the modeled spots. The value for 85 Peg A is appropriate\nfor a G5IV star as it is comparable to that of the Sun and for the\nvalue chosen for κ1 Ceti (Walker et al. 2007). We assumed a similar value for the K6-8V star 85 Peg B. For the 85 Peg B model,\nthe light curve was scaled to an amplitude of 5 mmag to allow for\nthe dilution by star A. For our 85 Peg A spot-model fit we place\na priori constraint on the resulting v sin i value (thus a joint prior\ninformation on the rotation period and the rotational inclination\nangle of the star) based on the values calculated in §4.2.1. For\n85 Peg B we do not use such a prior constraint since the v sin i\nvalue of this target is unknown.\nIf the modulation is due to a single spot rotating on star A, the\nnear-sinusoidal shape and low amplitude (0.3 mmag) of the light\ncurves require this spot to be small (for the adopted flux contrast)\nand for it to be visible for the duration of the light curve. Our\ndetermination of v sin i rules out edge-on and near edge-on inclinations for 85 Peg A; however, the uncertainty in v sin i is still\nsignificant and thus our spot models of this star could vary from\nnear pole-on inclination angles to much more moderate values\n(i ∼ 30◦ ). Also, the observed modulation could be due to many\nspots or more complicated spot geometries. The spot model that\nfollows should thus be in no way considered unique, but simply an example of a possible one-spot spot model that could be\ncausing the observed modulation.\nThe best model for star A using the 2005 data features a spot\nof diameter 2◦ at a latitude of about 50◦ , while the 2007 data\nfeatures a spot of diameter 2◦ at a latitude of about 46◦ relative\nto the equator. Our spot model has a rotational inclination angle of i ∼ 21◦ . Note that since changing the inclination angle of\n85 Peg A does not significantly affect the χ2 of the spot model,\nour best fit model has an inclination angle that results in a v sin i\nsimilar to the mean of the distribution determined by our analysis in §4.2.1. For the radius of RA = 0.82 ± 0.02 R⊙ – modeled by\nD'Antona et al. (2005) for the range of possible ages of 85 Peg A\nand close to the value of 0.846 R⊙ estimated by Fernandes et al.\n(2002) – and a rotation period P = 11.6 d, the equatorial rotation\nvelocity of the star would be 3.6 km s−1 . The spot model inclination results in a value of v sin i of about 1.3 km/s (compared to\nour v sin i ∼ 1.40+0.15\n−1.10 value determined in §4.2.1).\nFor star B, the intrinsic amplitude of the light variation\nshould be closer to 5 mmag, requiring a larger spot if the contrast\nratio between the spotted and unspotted photosphere is similar\nto that of other K6-8V stars. The best-fit model is presented in\nFigure 9 (note that the best-fit model for star A is very similar,\nexcept with a larger inclination angle and smaller spot diameter).\nIn this case, the inclination of the star for the best fitted model\n\n9\n\nis i ≃ 11◦ . In 2005 the spot in the best-fit model has a diameter of 8◦ at a latitude of 27◦ . In 2007 the spot has a diameter of\n9◦ at a latitude of 20◦ . The equatorial rotation velocity of star B\nwould be about 4.7 km/s and the resulting v sin i of the model is\nabout 0.9 km s−1 . We could find no measurements of v sin i for\n85 Peg B in the literature.\n\n5. Conclusions\nNearly continuous photometry of the binary system 85 Peg obtained with the MOST space telescope in 2005 yields a null\nresult for the detection of p-modes in the metal-poor subdwarf\n85 Peg A. Spanning over 25 days and reaching down to a noise\nlevel of about 4 ppm in the frequency region of interest, the high\nprecision data present the most complete photometry of the system collected so far and enable us to set an upper limit for the\ndetection of such oscillations. Based on simulations of stochastically excited and damped p-mode signal, we conclude that the\nRMS amplitude of oscillations in 85 Peg A must lie below ∼ 12–\n18 ppm if the mode lifetimes are short (i.e. on the order of days)\nand below ∼ 10 ppm if the mode lifetimes are long (i.e. on the\norder of weeks). Based on these results, we provide upper limits\nfor the Lorentzian profile height and the bolometric amplitude\nper radial mode as a function of mode lifetime and find these\nlimits to be in agreement with theoretical scaling relations. Due\nto the fact that the expected theoretical amplitude is a factor 4–\n5 lower than the detection threshold, however, we are unable to\ncomment further on the comparison of theoretical and observed\namlitudes as recently done by Michel et al. (2008) for CoRoT\nobservations.\nWe detect light variations in the 85 Peg system with a period\nof about 11 d and a peak amplitude of 0.3 mmag in our 2005\nepoch of data and confirm this variability in the 2007 epoch of\ndata. However, as different methods to remove the instrumental background in the 2005 data yield vastly different results,\nwe cannot exclude the possibility that we do not know the exact shape and period of the 2005 variability. Nevertheless, as\nthe 2005 and 2007 data yield similar results we believe it is\nlikely that 85 Peg displayed consistent variability over these two\nepochs.\nThe observed peak amplitude of the periodicity can in any\ncase not be explained by effects of a possible undetected binary\n85 Peg B. Ignoring correlations with telemetry data which exist\nbut cannot be interpreted beyond doubt, we fitted simple models\nto the residual data under the assumption that the variation is\ncaused by star spots modulated with the rotation period of one\nof the components. To facilitate the search for such models we\nanalyzed high-resolution UVES spectra of 85 Peg found in the\nESO archive and derived a new estimate of v sin i = 1.40+0.15\n−1.10 for\n85 Peg A. While we are able to reproduce the light curves of both\ndatasets well with single-spot models, it must be emphasized that\nthe solutions presented here are by no means unique, and there\nis no evidence that rules out more complex models.\nAssuming that our simple models are realistic, this would\nindicate a rotation period of 11.6 d for either one of the components. Noyes et al. (1984) derived a rotation period for 85 Peg A\nof 23.8 days indirectly based on its chromospheric activity index.\nThe evolutionary models of D'Antona et al. (2005) allow ages\nfrom 8–14 Gyr, while those of Bach et al. (2007) result in an age\nof 8.4 ± 0.5 Gyr for both stars in the 85 Peg system. Component\nB is expected to be coeval with star A and should share the\nsame age. All of these age estimates suggest that the stars\nshould have a slower rotation period than the observed variation\nshows. For example, the much younger active G5 dwarfs κ1 Ceti\n\n\f10\n\nD. Huber et al.: MOST photometry of 85 Pegasi\n\n1.0000\n\n1.0000\n\n0.9998\n\n0.9998\n\n0.9996\n\n0.9996\n\nNormalized Signal\n\n0.9994\n\n0.9994\n\n0.9992\n\n0.9992\n\n0.9990\n\n0.0004\n\n0.0004\n\n0.0002\n\n0.0002\n0.0000\n\n0.0000\n\n-0.0002\n\n-0.0002\n\n-0.0004\n2085.0\n\n-0.0004\n2090.0\n\n2095.0\n2100.0\nHJD - 2451545\n\n2105.0\n\n2110.0\n\n2830.0\n\n2832.0\n\n2834.0\n\n2836.0\n2838.0\nHJD - 2451545\n\n2840.0\n\n2842.0\n\nFig. 9. Spot models of the periodic light variation observed by MOST in the 85 Peg system if caused by 85 Peg B. Top: The best\nfitting one-spot configurations for 85 Peg B with the spot facing the viewer for 2005 (left) and 2007 (right) Bottom left: The top\npanel shows the observed (binned) 2005 light curve and the model fit for 85 Peg B, while the bottom panel displays the residuals to\nthe fit. Bottom right: Same as the middle panel except for the 2007 light curve.\n(Walker et al. 2007) and HD 189733 (Henry & Winn 2008) have\nrotation periods of 9 and 11.8 days, respectively - comparable\nto the 11.6 days rotation period suggested for 85 Peg despite the\nfact that the 85 Peg system is much older and should have a much\nlonger rotation period.\nThe spectroscopic binary solution summarized by Griffin\n(2004) yields an orbit inclination of | i | ∼ 50◦ . While we do not\nexplicitly assume a spin-orbit coupling in the system to constrain\nthe inclination in the spot models described above, it is worth\nnoting that for 85 Peg A, a rotation period of twice the observed\nperiod (23.2 d) with such an inclination would result in a v sin i\nof 1.4 km s−1 , which is also consistent with the values derived in\n§4.2.1 and might be a more realistic rotation period (suggesting\nthat indeed a more complex spot model is required to explain\nthe variation). Another, maybe more exotic explanation for the\nshort period might be that the rotational modulation is produced\nin star B (the cooler and potentially more active component) and\nthat its rotation is synchronized with the long suspected binary\ncompanion with an orbital period of 11.6 d.\nLastly, we strongly encourage follow-up observations to confirm the 11.6 d observed variability.\n\nAcknowledgments\nWe are grateful for discussions with Pierre Demarque. We are\nalso thankful to Gerald Handler for critical discussions concerning the p-mode detection limit. MG, MO, TK, WWW and RK\nare supported by the Austrian Fonds zur Förderung der wissenschaftlichen Forschung, project number P17580-N02. The\nAustrian participation in the MOST project is funded by the\nAustrian Research Promotion Agency (FFG). BC, DBG, JMM,\nAFJM, and SR acknowledge funding from the Natural Sciences\n& Engineering Research Council (NSERC) Canada.\n\nReferences\nAllende Prieto, C., Barklem, P. S., Lambert, D. L., & Cunha, K. 2004, A&A,\n420, 183\nAppourchaux, T., Michel, E., Auvergne, M., et al. 2008, A&A, 488, 705\nAsplund, M., Grevesse, N., & Sauval, A. J. 2005, in Astronomical Society of\nthe Pacific Conference Series, Vol. 336, Cosmic Abundances as Records of\nStellar Evolution and Nucleosynthesis, ed. T. G. Barnes, III & F. N. Bash, 25\nBach, K., Kim, Y.-C., & Demarque, P. 2007, Journal of Astronomy and Space\nSciences, 24, 31\nBaily, F. 1845, The catalogue of the British Association for the advancement of\nscience (London : R. a. J. E. Taylor, 1845; 444 p. ; in 4.; DCCC. f. 87)\nBarban, C., Matthews, J. M., de Ridder, J., et al. 2007, A&A, 468, 1033\nBaudin, F., Samadi, R., Goupil, M.-J., et al. 2005, A&A, 433, 349\n\n\fD. Huber et al.: MOST photometry of 85 Pegasi\nBedding, T. R., Butler, R. P., Carrier, F., et al. 2006, ApJ, 647, 558\nBedding, T. R., Kjeldsen, H., Butler, R. P., et al. 2004, ApJ, 614, 380\nBernacca, P. L. & Perinotto, M. 1970, Contributions dell'Osservatorio\nAstrofisica dell'Universita di Padova in Asiago, 239, 1\nBruntt, H., De Cat, P., & Aerts, C. 2008, A&A, 478, 487\nBudding, E. 1977, Ap&SS, 48, 249\nCarrier, F., Kjeldsen, H., Bedding, T. R., et al. 2007, A&A, 470, 1059\nChaplin, W. J., Elsworth, Y., Howe, R., et al. 1997, MNRAS, 287, 51\nChaplin, W. J., Houdek, G., Elsworth, Y., et al. 2005, MNRAS, 360, 859\nChaplin, W. J., Houdek, G., Karoff, C., Elsworth, Y., & New, R. 2009, ArXiv\ne-prints\nClaret, A. 2000, VizieR Online Data Catalog, 336, 31081\nCroll, B. 2006, PASP, 118, 1351\nCroll, B., Walker, G. A., Kuschnig, R., et al. 2006a, in Bulletin of the American\nAstronomical Society, Vol. 38, Bulletin of the American Astronomical\nSociety, 1217\nCroll, B., Walker, G. A. H., Kuschnig, R., et al. 2006b, ApJ, 648, 607\nD'Antona, F., Cardini, D., Di Mauro, M. P., et al. 2005, MNRAS, 363, 847\nFernandes, J., Morel, P., & Lebreton, Y. 2002, A&A, 392, 529\nFulbright, J. P. 2000, AJ, 120, 1841\nGriffin, R. F. 2004, The Observatory, 124, 429\nGuenther, D. B., Demarque, P., Kim, Y.-C., & Pinsonneault, M. H. 1992, ApJ,\n387, 372\nGuenther, D. B., Kallinger, T., Gruberbauer, M., et al. 2008, ApJ, 687, 1448\nGustafsson, B., Edvardsson, B., Eriksson, K., et al. 2008, A&A, 486, 951\nHale, A. 1994, AJ, 107, 306\nHall, Jr., R. G. 1948, AJ, 54, 102\nHenry, G. W. & Winn, J. N. 2008, AJ, 135, 68\nHolmberg, J., Nordström, B., & Andersen, J. 2007, A&A, 475, 519\nHoudek, G. 2006, in ESA Special Publication, Vol. 624, Proceedings of SOHO\n18/GONG 2006/HELAS I, Beyond the spherical Sun\nHuber, D. & Reegen, P. 2008, Communications in Asteroseismology, 152, 77\nKallinger, T., Gruberbauer, M., Guenther, D. B., Fossati, L., & Weiss, W. W.\n2008a, ArXiv e-prints\nKallinger, T., Guenther, D. B., Matthews, J. M., et al. 2008b, A&A, 478, 497\nKjeldsen, H. & Bedding, T. R. 1995, A&A, 293, 87\nKochukhov, O. P. 2007, in Physics of Magnetic Stars, 109–118\nKupka, F., Piskunov, N., Ryabchikova, T. A., Stempels, H. C., & Weiss, W. W.\n1999, A&AS, 138, 119\nKurucz, R. 1993, ATLAS9 Stellar Atmosphere Programs and 2 km/s\ngrid. Kurucz CD-ROM No. 13.\nCambridge, Mass.: Smithsonian\nAstrophysical Observatory, 1993., 13\nMatthews, J. M. 2007, Communications in Asteroseismology, 150, 333\nMichel, E., Baglin, A., Auvergne, M., et al. 2008, Science, 322, 558\nMichel, E., Samadi, R., Baudin, F., et al. 2009, A&A, 495, 979\nMosser, B., Bouchy, F., Catala, C., et al. 2005, A&A, 431, L13\nMosser, B., Deheuvels, S., Michel, E., et al. 2008, A&A, 488, 635\nNoyes, R. W., Hartmann, L. W., Baliunas, S. L., Duncan, D. K., & Vaughan,\nA. H. 1984, ApJ, 279, 763\nPiskunov, N. E., Kupka, F., Ryabchikova, T. A., Weiss, W. W., & Jeffery, C. S.\n1995, A&AS, 112, 525\nReegen, P. 2007, A&A, 467, 1353\nReegen, P., Kallinger, T., Frast, D., et al. 2006, MNRAS, 367, 1417\nRowe, J. F., Matthews, J. M., Kuschnig, R., et al. 2006, Memorie della Societa\nAstronomica Italiana, 77, 282\nRyabchikova, T., Fossati, L., & Shulyak, D. 2009, ArXiv e-prints\nRyabchikova, T., Piskunov, N., Savanov, I., Kupka, F., & Malanushenko, V.\n1999, A&A, 343, 229\nSamadi, R., Georgobiani, D., Trampedach, R., et al. 2007, A&A, 463, 297\nStello, D., Kjeldsen, H., Bedding, T. R., & Buzasi, D. 2006, A&A, 448, 709\nten Brummelaar, T., Mason, B. D., McAlister, H. A., et al. 2000, AJ, 119, 2403\nTsymbal, V. 1996, in Astronomical Society of the Pacific Conference Series,\nVol. 108, M.A.S.S., Model Atmospheres and Spectrum Synthesis, ed. S. J.\nAdelman, F. Kupka, & W. W. Weiss, 198\nUesugi, A. & Fukuda, I. 1970, Catalogue of rotational velocities of the stars\n(Contributions from the Institute of Astrophysics and Kwasan Observatory,\nUniversity of Kyoto, Kyoto: University, Kwasan Observatory, Institute of\nAstrophysics, 1970)\nWalker, G., Matthews, J., Kuschnig, R., et al. 2003, PASP, 115, 1023\nWalker, G. A. H., Croll, B., Kuschnig, R., et al. 2007, ApJ, 659, 1611\nWolff, S. C., Heasley, J. N., & Varsik, J. 1985, PASP, 97, 707\n\n11\n\n\f"}