{"id": "http://arxiv.org/abs/1105.4524v1", "guidislink": true, "updated": "2011-05-23T14:58:18Z", "updated_parsed": [2011, 5, 23, 14, 58, 18, 0, 143, 0], "published": "2011-05-23T14:58:18Z", "published_parsed": [2011, 5, 23, 14, 58, 18, 0, 143, 0], "title": "Search for WIMPs in liquid argon", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4507%2C1105.1204%2C1105.3317%2C1105.1979%2C1105.3025%2C1105.4742%2C1105.0310%2C1105.4540%2C1105.3353%2C1105.3668%2C1105.4193%2C1105.2564%2C1105.3698%2C1105.1297%2C1105.3914%2C1105.4889%2C1105.5945%2C1105.3068%2C1105.0294%2C1105.1517%2C1105.5774%2C1105.6003%2C1105.6129%2C1105.5231%2C1105.1072%2C1105.5625%2C1105.4502%2C1105.5954%2C1105.0436%2C1105.2898%2C1105.3332%2C1105.6071%2C1105.4549%2C1105.0475%2C1105.5796%2C1105.5822%2C1105.4524%2C1105.0490%2C1105.1487%2C1105.0991%2C1105.2628%2C1105.3970%2C1105.2634%2C1105.0732%2C1105.0120%2C1105.0628%2C1105.1693%2C1105.4612%2C1105.4819%2C1105.5919%2C1105.5096%2C1105.4912%2C1105.4128%2C1105.0862%2C1105.3028%2C1105.5776%2C1105.4562%2C1105.5166%2C1105.1620%2C1105.1439%2C1105.6342%2C1105.4601%2C1105.5768%2C1105.6033%2C1105.5031%2C1105.2166%2C1105.4198%2C1105.4673%2C1105.2143%2C1105.1190%2C1105.2401%2C1105.6285%2C1105.1194%2C1105.4565%2C1105.6202%2C1105.2174%2C1105.0243%2C1105.5637%2C1105.4313%2C1105.1574%2C1105.1884%2C1105.0651%2C1105.3164%2C1105.1940%2C1105.3443%2C1105.0095%2C1105.1937%2C1105.3058%2C1105.4552%2C1105.1959%2C1105.4706%2C1105.0976%2C1105.5497%2C1105.3809%2C1105.4183%2C1105.0059%2C1105.0409%2C1105.1228%2C1105.1930%2C1105.2774%2C1105.3621&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Search for WIMPs in liquid argon"}, "summary": "Our group from the University of Zurich is performing R&D work towards the\ndesign of a large liquid argon detector to detect Weakly Interacting Massive\nParticles (WIMPs). This project is developed within the DARWIN Collaboration\nfunded by ASPERA to prepare a proposal for the next generation of WIMP searches\nusing noble liquids. We are performing R&D to detect the VUV light from\nrecoiling argon nuclei. Results obtained with one ton of liquid argon (ArDM\nprototype) and prospects using a monoenergetic neutron source are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.4507%2C1105.1204%2C1105.3317%2C1105.1979%2C1105.3025%2C1105.4742%2C1105.0310%2C1105.4540%2C1105.3353%2C1105.3668%2C1105.4193%2C1105.2564%2C1105.3698%2C1105.1297%2C1105.3914%2C1105.4889%2C1105.5945%2C1105.3068%2C1105.0294%2C1105.1517%2C1105.5774%2C1105.6003%2C1105.6129%2C1105.5231%2C1105.1072%2C1105.5625%2C1105.4502%2C1105.5954%2C1105.0436%2C1105.2898%2C1105.3332%2C1105.6071%2C1105.4549%2C1105.0475%2C1105.5796%2C1105.5822%2C1105.4524%2C1105.0490%2C1105.1487%2C1105.0991%2C1105.2628%2C1105.3970%2C1105.2634%2C1105.0732%2C1105.0120%2C1105.0628%2C1105.1693%2C1105.4612%2C1105.4819%2C1105.5919%2C1105.5096%2C1105.4912%2C1105.4128%2C1105.0862%2C1105.3028%2C1105.5776%2C1105.4562%2C1105.5166%2C1105.1620%2C1105.1439%2C1105.6342%2C1105.4601%2C1105.5768%2C1105.6033%2C1105.5031%2C1105.2166%2C1105.4198%2C1105.4673%2C1105.2143%2C1105.1190%2C1105.2401%2C1105.6285%2C1105.1194%2C1105.4565%2C1105.6202%2C1105.2174%2C1105.0243%2C1105.5637%2C1105.4313%2C1105.1574%2C1105.1884%2C1105.0651%2C1105.3164%2C1105.1940%2C1105.3443%2C1105.0095%2C1105.1937%2C1105.3058%2C1105.4552%2C1105.1959%2C1105.4706%2C1105.0976%2C1105.5497%2C1105.3809%2C1105.4183%2C1105.0059%2C1105.0409%2C1105.1228%2C1105.1930%2C1105.2774%2C1105.3621&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Our group from the University of Zurich is performing R&D work towards the\ndesign of a large liquid argon detector to detect Weakly Interacting Massive\nParticles (WIMPs). This project is developed within the DARWIN Collaboration\nfunded by ASPERA to prepare a proposal for the next generation of WIMP searches\nusing noble liquids. We are performing R&D to detect the VUV light from\nrecoiling argon nuclei. Results obtained with one ton of liquid argon (ArDM\nprototype) and prospects using a monoenergetic neutron source are discussed."}, "authors": ["C. Amsler"], "author_detail": {"name": "C. Amsler"}, "author": "C. Amsler", "arxiv_comment": "Proceedings of the WIN'11 Conference, Cape Town, 2011, 13 pages, 12\n  figures", "links": [{"href": "http://arxiv.org/abs/1105.4524v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.4524v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.4524v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1105.4524v1", "journal_reference": null, "doi": null, "fulltext": "Search for WIMPs in liquid argon1\n\narXiv:1105.4524v1 [physics.ins-det] 23 May 2011\n\nC. AMSLER2\nPhysik-Institut der Universität Zürich\nCH-8057 Zürich, Switzerland\nAbstract:\nOur group from the University of Zurich is performing R&D work towards the design of a large\nliquid argon detector to detect Weakly Interacting Massive Particles (WIMPs). This project is\ndeveloped within the DARWIN Collaboration funded by ASPERA to prepare a proposal for the\nnext generation of WIMP searches using noble liquids. We are performing R&D to detect the\nVUV light from recoiling argon nuclei. Results obtained with one ton of liquid argon (ArDM\nprototype) and prospects using a monoenergetic neutron source are discussed.\n\n1 Introduction\nFrom astronomical observations it is known that most of the gravitational mass in the universe\ndoes not couple to electromagnetic radiation and is therefore not directly observable with telescopes. Recent measurements lead to the conclusion that about 72% of the mass density is due\nto dark energy, 23% to dark matter (DM), and only 5% to baryons [1]. The contribution from\nneutrinos is less than 1%. Baryons are mostly located in the intergalactic gases with only about\n10% contributing to star masses. Roughly 15% of the DM may be due to MACHOS or cold\nmolecular clouds. Although exotic mecanisms (such as modifications of Newton's gravitational\nlaw [2]) that do not require DM have been postulated, the natural assumption is that DM indeed\nexists as some form of elementary particles, axions or Weakly Interacting Massive Particles\n(WIMPs), or possibly as primordial black holes (having formed before nucleosynthesis). The\ndirect laboratory observation of dark matter (DM) is one of the most pressing issues in Particle\nPhysics, which can be addressed at the LHC and with non-accelerator experiments.\nBecause DM has survived since the birth of the universe it has to be stable and only weakly\ninteracting. As mentioned already, the most popular candidates for DM are axions and WIMPs.\nHeavy neutrinos would qualify as WIMPs, although there is no obvious reasons as to why\nthey should be stable. The lightest superparticle in SUSY models conserving R-parity is the\nmost popular WIMP candidate, the spin 1/2 neutralino χ̃01 with mass in the 10 GeV to 10 TeV\nrange. R-parity conservation ensures that the χ̃01 is stable. Also, the χ̃01 cannot transform into\nother SUSY particles when interacting with matter, due to its low mass. At the LHC the χ̃01\nwill therefore manifest itself by a large missing energy. On the other hand, the χ̃01 can scatter\ne.g. on constituent quarks in nucleons or nuclei (Fig. 1, left), leading to nuclear recoils in\nthe range of 1 – 100 keV. Non-accelerator laboratory searches are all based on the detection\nof such nuclear recoils. The scattering cross section on nucleons is tiny, in the range 10−5 to\n10−12 pb, comparable to that for neutrino interactions. The differential cross section decreases\n1\n2\n\nProceedings of the WIN'11 Conference, Cape Town (2011)\nE-mail: claude.amsler@cern.ch, http://amsler.web.cern.ch/amsler/\n\n1\n\n\fexponentially with recoil energy (see Fig. 3 below) which makes WIMP detection difficult\ndue to the low energy background. Hence massive detectors with low detection thresholds are\nneeded, among them cryogenic ones using liquid argon (LAr) or liquid xenon (LXe).\n\nχ\n\nχ\nZ0, H, h\n\nq\n\nq\nq\n\nχ\n\nχ\n~q\n\nq\nSUSY\n\nFigure 1: Left: Feynman graphs of χ ≡ χ̃01 interactions with quarks in the nucleon. Right:\nWIMP-nucleon cross section as a function of WIMP mass showing the most stringent upper\nlimit (90% CL) from XENON-100 (adapted from ref. [3]). Theoretical predictions from supersymmetry [4] are also shown.\nWIMPs can annihilate in the galactic halo, leading to the production of e.g. positrons,\nantiprotons, neutrinos or photons. For instance, an excess of γ-rays consistent with 80 GeV\nWIMPS has been reported in a re-analysis of EGRET data [5]. Satellite experiments such\nas GLAST, AMS2, PAMELA, Čerenkov detectors such as MAGIC and VERITAS, or large\nneutrino telescopes such as ICE CUBE, might reveal signals from WIMP annihilations [1]. An\nannual modulation (6.3σ effect) was reported by the DAMA experiment with 100 kg of NaI\ndetectors [6], and more recently confirmed by the same group (8.2σ effect with 250 kg of NaI).\nThe signal was, however, not observed by other experiments. In particular, the spin-dependent\nsignal was recently ruled out by COUPP [7].\nFig. 1 (right) shows upper limits for WIMPs from recent experiments. Since one does not\nknow precisely the cross section, one usually shows the limits in a two dimensional plot cross\nsection vs. mass. For low masses the sensitivity decreases, due to the low recoil energy and\nthe detection threshold. For high masses the loss of sensitivity is due to the diminishing WIMP\nflux. The best upper limits are obtained for a WIMP mass comparable to the atomic number A\nof the target. The spin independent rate provides the current best upper limits for WIMPs and\nis also the relevant interaction for our developments with liquid argon since 40 Ar is a spin zero\nnucleus. The XENON-100 [3] and CDMS [8] experiments have produced the best upper limits\nso far, the former even reaching 7 × 10−9 pb for masses around 50 GeV. The current upper\nlimits now reach into the relevant region of theoretical predictions based on supersymmetry [4].\nMost WIMP searches can be classified in two classes, (1) those using pure semiconductors\nand, (2) those using noble liquids such as LXe or LAr. In semiconductors operating at very\nlow temperatures one measures the phonons and/or the ionization generated by recoiling nuclei. Representatives of this class are CDMS, CRESST, EDELWEISS. In noble liquids (ArDM,\n2\n\n\fDEAP, WARP, XENON, ZEPLIN) one mesures the UV light and possibly also the electric\ncharge produced by the ionizing recoils. Sensitivites will have to be improved by at least two\norders of magnitude in future projects. This requires massive detectors operated by large international collaborations. Accordingly, ASPERA has funded two projects, EURECA [9] based\non solid state detectors, and DARWIN [10] using noble liquids. The latter consortium is to\ndeliver the concept for a multiton LAr/LXe detector by 2013 which could become operational\naround 2016, reaching a final sensitivity of 10−11 pb. Fig. 2 shows the possible layout of such\na detector.\n\nFigure 2: Left: Institutions participating in DARWIN. Right: Possible layout of a large underground detector using 8t of LAr and 5t of LXe, surrounded by water Čerenkov veto shields [11].\n\n2 Experimental sensitivities in noble liquids\nOne often assumes that DM is distributed within a non-rotating spherical halo larger than the\nMilky Way. The velocity distribution is taken as Maxwell-Boltzmann with a dispersion of 220\nkm/s. The solar system rotates around the galactic center with a velocity of 230 km/s and the\nearth around the sun with a velocity of 30 km/s. Taking into account the 60◦ inclination of the\necliptic one then finds that the average velocity of WIMPs entering a terrestrial detector is ∼245\nkm/s in June and ∼215 km/s in December. The differential scattering cross section on a nucleus\nis given by [12]\ndσ\nG2F CF 2 (q 2 )\n=\n,\n(1)\ndq 2\nv2\nwhere q 2 is the momentum transfer to the nucleus, GF the Fermi coupling constant, C a constant\ndescribing details of the interaction, F a nuclear form factor and v the WIMP velocity in the\ndetector. The event rate in a detector can be calculated [13] by folding the cross section with\nthe Boltzmann distribution, assuming a density of WIMPs of about 0.3 GeV/cm3 . The cross\nsection consists of two components, a nuclear spin dependent part and a spin independent part.\nThe former is larger on single nucleons, but constructive interference enhances the latter by\n3\n\n\fa factor of A2 for nuclei. Small WIMP velocities are favored by the cross section (eq. 1)\nand the form factor suppresses large recoil energies. Hence the distribution falls off (roughly\nexponentially) as a function of nuclear recoil energy. This makes WIMP detection difficult due\nto the low energy background. Fig. 3 shows the recoil energy distribution in 1t of liquid argon\nand liquid xenon detectors assuming a cross section of 10−8 pb. Recoil energy spectra in LAr\nand LXe are different. These liquids are therefore complementary in providing a crosscheck in\ncase a WIMP signal is observed. With a nuclear recoil energy threshold of 30 keV, a WIMPnucleon cross section of 10−8 pb would yield 1 event per day and per ton of LAr. Even a 1t\nLAr detector could improve significantly the current upper limits, provided that the threshold\nof 30 keV and sufficient background rejection can be achieved. Statistics permitting, the annual\nvariation could even be used as additional evidence for the detection of WIMPs.\n\nEvent rate /day\n\n10\n\n1\nArgon\n\n0.1\n\nXenon\n\n0.01\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\nThreshold [keV]\n\nFigure 3: Daily WIMP detection rate for a 1t detector as a function of detection threshold for\nLXe and LAr, assuming a WIMP mass of 100 GeV and a cross section of 10−8 pb. The top and\nbottom curves show the limits of annual variations due to the rotation of the Earth around the\nSun (after ref. [13]).\n\n3 Light detection in a 1t liquid argon detector\nThe ArDM Collaboration [14] uses the double-phase argon technique pioneered by the WARP\ncollaboration [15]. ArDM envisages a much larger and more ambitious detector (1t of LAr). In\ncontrast to WARP one plans to detect both charge and luminescence from WIMP interactions.\nCharged particles lead to ionization and excitation of argon atoms, forming excimers with the\nlowest singlet and the triplet excited states decaying by VUV photon emission in a narrow band\naround 128 nm. The singlet and the triplet states have different decay times, respectively τ1 ≃ 5\nns and τ2 ≃ 1.6 μs in liquid argon (LAr) [16]. The slow component is very sensitive to the\npurity of the argon [17]. Heavily ionizing particles such as α's or nuclear recoils contribute\nmostly to the fast (< 50 ns) decaying component, while the contribution of electrons and γ's\nto the slow component is larger. For minimum ionizing projectiles, such as electrons and γ's,\n4\n\n\fthe component ratio CR (fast to total intensity) is ≈ 0.3, while for α's and nuclear recoils\nCR ≃ 0.8 [16]. In addition, the ionization yield is much lower for nuclear than for minimum\nionizing particles, due to quick recombination. Both features can be used in LAr to reduce\nbackground in WIMP searches.\nLAr has a density of 1.4 g/cm3 , a refractive index of 1.24 and boils at 87 K. LAr generates\nabout 5 × 104 VUV photons/MeV for minimum ionizing particles (in the absence of electric\nfield). LAr is cheap (1.5 CHF/l) compared to xenon, but has the disadvantage of containing the\nradioactive nuclide 39 Ar (β - emitter with a half life of 269 yrs and 565 keV endpoint energy).\nThe activity of natural argon is 1 Bq/kg which induces a background rate of roughly 1 kHz in a\n1t detector [18].\n\nFigure 4: Left: Detector concept. Middle: PMT array and HV divider chain. Right: WLS-foils\nand PMTs under UV illumination [20].\nDetails on the ArDM detector can be found in recent publications [19, 20]. Briefly, the\nworking principle is as follows (Fig. 4, left): in LAr a WIMP collision leading to 30 keV nuclear recoils produces about 400 VUV (128 nm) photons, together with a few free electrons.\nThe latter are drifted in a strong vertical electric field and are detected in the gas phase by a\nlarge electron multiplier (LEM) above the surface of the liquid, while the VUV scintillation\nlight is shifted into blue light by a wavelength shifter (WLS) and detected by cryogenic photomultipliers at the bottom of the vessel. Fig. 4 (middle) shows a sketch of the detector with the\n400 kV HV divider. The detector and its recirculation and purification systems are currently\ninstalled in building 182 at CERN for preliminary readout tests. The detector for the charge\nextracted from the liquid into the gas phase with subsequent multiplication in a prototype LEM\nstill needs to be installed.\nAt the University of Zurich we have designed and built the light readout system for the 1t\nLAr detector. We measured the light yield dependence on the WLS thickness of evaporated\n5\n\n\fLight yield (τ2 =3200ns) [pe]\n\n140\n120\n100\n80\n60\n40\n20\n0\n\n0\n\n0.5\n\n1\n1.5\n2\n2.5\nTPB layer [mg/cm2]\n\n3\n\nFigure 5: Left: disks of ESR-foils covered with TPB under ambient and UV light. Right: Light\nyield in photoelectrons (pe) as a function of WLS thickness.\n\nspecular reflectors foils. The measurements were made with a small cell containing gaseous\nargon at atmospheric pressure. Two materials were selected, Tetratex and ESR-foils from 3M,\nand the optimum thickness of the TPB layer on the reflector was determined experimentally\n[21]. The best conversion efficiency, uniformity and reproducibility were achieved by evaporating TPB on the reflector. Several disks of ESR foils (diameter 70 mm) were covered with\nTPB layers of different thicknesses. The TPB thickness was determined by weighing the disks\nbefore and after evaporation. The increase in brightness with TPB thickness is apparent under\nUV illumination (300 nm) (Fig. 5, left). The response to 128 nm light was determined using\nscintillation light from gaseous argon and an α-source. The light yield of the slow component\n(τ2 = 3.2 μs in gas [17]) is shown in Fig. 5 (right) as a function of thickness. The data are\nconsistent with a saturation of VUV conversion efficiency above 1 mg * cm−2 . Accordingly,\nfifteen Tetratex WLS sheets (120 × 25 cm2 ) were coated with 1 mg * cm−2 TPB to cover the\ncylindrical side walls inside the electric field shapers (Fig. 4, middle).\nThe light detection system consists of fourteen 8\" hemispherical photomultipliers (PMT) in\na staggered arrangement at the bottom of the vessel. We have investigated PMTs for their functionality and quantum efficiency at low temperature. The best result was obtained with Hamamatsu PMTs (R5912-MOD) manufactured with Pt-underlay. A light but sufficiently strong mechanical support was constructed to withstand the buoyant force (≈1kN) acting on the PMTs in\nliquid argon. The PMT glass was coated with a thin WLS layer of a transparent TPB-paraloid\ncompound to increase the VUV light yield. Fig. 4 (right) shows the mounted foils and the\nPMTs under UV illumination. Many details can be found in a recent thesis [22].\nThe ArDM detector was filled for the first time with 1t of LAr in 2009. Several important\nparameters such as stable cryogenic operation in high LAr purity, high scintillation light yield,\nand detection of events down to energies of tens of keV's could be verified. The test was\nperformed with a partial light readout assembly consisting of half of the PMTs, no electric field\nand no charge readout. The LAr purity was found to be constant over the measurement time of\nthree weeks by monitoring the decay time τ2 of the slow component of the light signal [20].\nThe measurements were done with external sources such as 22 Na, delivering positrons (annihilating into two 511 keV γ's) and monochromatic 1275 keV γ's. The light yield produced by\n6\n\n\fFigure 6: Light yield in the 1t LAr detector for 511 keV γ's (in photoelectrons, p.e.) at two\npositions of the 22 Na- source. The measurements are in black, the simulated data in red (from\nref. [20]).\n\none of the 511 keV γ's, following (multiple) Compton scattering, was measured by triggering\nwith a 4\" Na(Tl) crystal on the second 511 keV emitted in the opposite direction, and on the\n1275 keV γ. Fig. 6 shows the light yield distributions for the source located at two different\nvertical distances from the photomultiplier array (black bars) [20]. The light yield (in photoelectrons, p.e.) was calculated by Monte Carlo simulation as a function of energy deposit, and\nthe distributions (red bars) compared to the measured ones. Good agreement was found with\nan average light yield of typically 0.4 p.e./keV, which is roughly half of the yield that would be\nobtained with a completed detector (14 PMTs). Note that the light yield for nuclear recoils is\nlower due to quenching, typically 30% of that for electrons in the few 10 keV range, see Fig.\n12 below. We are therefore confident to be able to reach our goal of 30 keV threshold in 1t of\nLAr for WIMP detection.\n\n4 LAr response to neutrons\nThe light yield of nuclear recoils in LAr are poorly known, especially below 50 keV (see e.g.\nref. [23]). A good way to calibrate the light output and to study the response of LAr or LXe to\nnuclear recoils is to scatter a beam of monoenergetic neutrons of energy Tn on argon or xenon\nnuclei and to measure the light yield as a function of scattering angle θ, from which the recoil\nenergy Tr can be calculated according to the formula\n\nTr =\n\nh\ni\n√\n2Tn 1 + A − cos2 θ − cos θ A2 + cos2 θ − 1\n\n(1 + A)2\n\n≃\n\n2Tn A\n(1 − cos θ) ,\n(1 + A)2\n\n(2)\n\nwhere A is the atomic mass (A ≫ 1). The method is illustrated in fig. 7 (left) and the energy\ndeposits are plotted in Fig. 7 (right) as a function of scattering angle for Tn = 2.45 MeV incident\nneutrons.\nIn fact, neutrons (mainly from cosmic ray induced spallation) are a serious source of background in WIMP searches, due to the huge cross sections for neutron-nucleus scattering, many\n7\n\n\fNuclear recoil energy [keV]\n\n250\n\nScintillation light\n\n^\nNeutron\ngenerator\nn (2.45nMeV)\nNeutron generator\n(D D fusion)\n\nTarget\nTarget\n(Ar or Xe)\n\nScattered\nn\nneutron\n\nθ\n\nNeutron\ndetector\n(Liquid\n(tagging)\n\nscintillator)\n\nRecoil\nNuclear\nnucleus\n\nrecoil\n\nArgon\n\n200\n\n150\n\n100\n\nXenon\n50\n\n0\n0\n\n20\n\n40\n\n60\n\n80\n\n100 120 140 160 180\n\nScattering angle θ [o]\n\nFigure 7: Left: Principle of a scattering experiment with monoenergetic neutrons. Right: nuclear recoil energies in argon and xenon for neutron energies of 2.45 MeV.\n\norders of magnitude larger than the ones for WIMP-nucleus scattering. This background contribution can be reduced by operating underground and by shielding the detector with low-Z\nmaterials. However, the large neutron-nucleus cross section also means that the mean free path\nof neutrons is of the order of a few cm, leading to multiple scattering, quite in contrast to\nWIMPs which interact only once in the target. This gives an additional way to suppress neutron\ninduced background, provided that multiple scattering can be detected from the enhanced light\nyield, and/or by identifying the multiple interaction vertices in the detector, e.g. with a charge\ndetection device.\n\nFigure 8: Sketch of the neutron generator, the LAr cell, the cryocooler and the four liquid\nscintillators (LSCs) to detect scattered neutrons. The right picture shows the LAr cell with its 2\nPMTs on top and bottom of the LAr volume.\nWe have therefore purchased a monoenergetic neutron source [24] based on the reaction\ndd →3 He n, and are setting up a scattering experiment with collimated 2.45 MeV neutrons.\n8\n\n\fThe target is a small (<1l) test cell (77 mm high and 74 mm in diameter) and liquid scintillation\ncounters (LSC, EJ301 from SCIONIX) detect the scattered neutrons in coincidence as a function\nof scattering angle (Fig. 8). To reduce the measurement time we use four LSCs to cover various\nangles in parallel.\nThe fusion chamber is surrounded by a 90 cm diameter shield of borated polyester and the\nexperiment confined within a radiation controlled fence in our laboratory at CERN (Fig. 9, left).\nResidual radiation (mainly from scattered neutrons and X-rays) is well below the authorized\nlimit of 2.5 μSv/h. The neutrons are collimated through a polyethylene orifice within roughly\n1% × 4π sr. The neutron flux (up to 5×106 n/s in 4π, according to specifications) is controlled\nthrough the applied high voltage and discharge current.\n\nn/s\n\nNG Flux in 4π\n\nIG = 10mA\n\nX-ray contamination\n(insuf. Pb shielding)\n\nIG = 14mA\n\nIG = 15mA (NSD manual)\n\n7\n\n10\n\nIG = 10mA (NSD manual)\n\nIG = 14/15 mA\n\n106\n\nIG = 10 mA\n\nRates measured with 5\" organic scintillator cell,\ncorrected for solid angles and acceptance (0.8)\nwith coll., using MPD4\n\nIG = 10 mA\n\nwithout coll., 1mm Pb, using MPD4\nwith Coll., 1mm Pb, using MPD4\nwithout Coll., 2.5cm Pb, MatLab\n\nIG = 14/15mA\n\n105\n\nwithout coll., MatLab\nwithout coll., 1mm Pb, using MPD4\nwithout coll., 2.5cm Pb, MatLab\nwithout coll., 2mm Pb, MatLab\n\n60\n\n70\n\n80\n\n90\n\n100\nVoltage [kV]\n\nFigure 9: Left: 2.45 MeV neutron fusion generator inside its safety fence in our laboratory\nat CERN. The source itself is shown in the inset. Visible are also the X/γ-ray monitor (top\nwhite box), the neutron radiation detector (black sphere) and the electronic rack (right) with\nthe measuring electronics and the HV control units. Right: Neutron generator flux into 4π (see\ntext). Straight lines are drawn to guide the eye.\nThe neutron flux was measured with a 5\" LSC located at the collimator exit. The polyethylene collimator was surrounded by a 2 mm thick lead box against X-rays, inserted into the\npolyester shielding. According to NSD-Fusion [24], the highest possible voltage and current\nare 100 kV, resp. 15 mA, corresponding to a flux of 107 n/s into 4π. The flux increases proportionally to the current and to the voltage V2.8 . Measurements were made with and without\npolyethylene collimator and the rates corrected for the solid angle, assuming a detection efficiency of the LSC of 80%. A NIM MPD-4 module was used to discriminate between neutrons\nand X-rays. Figure 9 (right) shows the measured neutron intensity (blue, red and orange dots)\ncompared with the values specified by NSD-Fusion (green crosses for 10mA and orange crosses\nfor 15mA [24]). Insufficient lead shielding leads to a strong X-ray contamination. The measured\nflux (red dots) was roughly one order magnitude smaller than anticipated, with a maximum of\n106 n/s.\nThe neutron energy distribution (smeared by collimator scattering) must be known to measure the light yield from LAr accurately. Fig. 10 (left) shows the neutron energy distribution\nmeasured by a 5\" LSC placed at the exit of the collimator. Ideally the spectrum should be flat\n9\n\n\f500\n\n40\n\n450\n\n35\n\n400\n\n30\n\n350\n\n25\n\nEntries per 200 keV\n\nEntries per 200pVs\n\n(without collimator scattering, with infinite resolution and single n-scattering). The spectrum\nof Fig. 10 (right) was obtained by unfolding the response of the LSC to neutrons from a radioactive source. The response was obtained with an AmBe-source, by measuring the neutron\nenergy through the time-of-flight between the source and the neutron counter over a distance\nof 1 m. The start time was determined from the 4.4 MeV γ detected in a BGO crystal located\nclose to the AmBe-source.\n\n300\n250\n200\n150\n\nNeutron spectrum\n(preliminary)\n\n20\n15\n10\n\nLow energy tail ~ 16%\n\n5\n\n100\n\n0\n\n50\n0\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n-5\n0\n\n18\n\nIntegrated pulse hight [nVs]\n\n0.5\n\n1\n\n1.5\n2\nEnergy [MeV]\n\n2.5\n\n3\n\nFigure 10: Left: Pulse height distribution induced by neutrons in the LSC at the exit of the\ncollimator. Right: Incident neutron energy spectrum obtained after unfolding the response of\nthe LSC.\n\nFigure 11: Component ratio CR in LAr for 2.45 MeV neutrons, 5.3 MeV α's and 1.3 MeV\nelectrons and cosmic muons.\nWe have started to measure the scintillation response of LAr to nuclear recoils with the\nLAr cell shown in Fig. 8 (right). Wavelength shifting reflectors (Tetraphenyl-Butadiene, TPB,\non Tyvek foils) were mounted on the inner walls of the cell to convert the 128 nm light into\n400 nm. The cell was read out by two Hamamatsu R6091-01MOD PMTs with Pt-underlay\nfor cryogenic operation. An internal 210 Pb-source emitted 5.3 MeV α's and up to 1.2 MeV\n10\n\n\felectrons. We recall that the component ratio CR is the ratio of integrated light yield during\nthe first 50 ns to the total light yield. Thus a high CR corresponds to the emission of light\nwith mainly the fast component. As mentioned above, heavily ionizing particles such as α's or\nnuclear recoils lead to a large CR value. Fig. 11 shows the component ratio CR from one of\nour first measurements of argon luminescence with the fusion generator. A clear contribution\nfrom neutron induced nuclear recoils is observed at CR ∼ 0.8.\nA first measurement of the scintillation efficiency for nuclear recoils relative to electrons was\nperformed with a 5\" LSC at 65◦ from the incident beam direction, at a distance of 50 cm from\nthe LAr cell. The time-of-flight between the LAr cell and the LSC could be determined off-line\nand used to remove background, e.g. from multiple neutron scattering in the cell. The reference\ntime was determined with a Na-source located at equal distance from the LAr-cell and the LSC,\nand using the two back-to-back 511 keV γ's. At 65◦ the argon recoil energy is 69 keV with 2.45\nMeV incident neutrons. This corresponds to a time-of-flight of 23 ns for 2.38 MeV neutrons\nflying to the LSC. Good pulse shape separation between proton and background (γ-induced\nelectron recoils) could be achieved with the LSC by analogue pulse shape discrimination.\nRelative scintillation efficiency Leff\n\n0.8\n\nLindhard\n\nLAr\n\nLindhard + Birk's law\n\n0.7\n\nMcKinsey\nD.\nGastler et al. [23]\nWARP\n\n0.6\n\nOur value\n\n0.5\n0.4\n0.3\n0.2\n\nAverage of\n\nData (0.25±0.2)\n\n0.1\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\nNuclear Recoil Energy (keVr)\n\nFigure 12: Left: Measurement of the relative scintillation efficiency in LAr as a function of\nrecoil energy (from ref. [23]). Our preliminary measurement is shown by the red data point.\nRight: Energy spectrum from Am-decay measured with the refurbished LAr cell, showing the\n60 keV line.\nSeveral cuts were applied in the offline analysis. For example, we required the component\nratio CR to be larger than 0.6 (see Fig. 11). We also rejected events close to the PMT windows\nby comparing the signals from the two PMTs. A time-of-flight window between 18 and 31 ns\nwas selected. We obtained a scintillation efficiency of 0.27 (with about 25% error) in this first\nattempt. Fig. 12 (left) shows our data point compared with data from ref. [23].\nLight yields of nuclear recoils are usually determined relative to electronic recoils. The\nelectronic light yield is determined with various external γ-sources and also with a 83 Krm source\nwhich can be connected directly to the gaseous phase in our setup.\nTo improve the light yield and the measurements with radioactive sources we upgraded our\nLAr cell to reduce the thickness of the stainless steel vessel and the LAr volume. Tetratex foils\n(from Donaldson Membranes) were used instead of the Tyvek reflectors, and TPB-Paraloid\ncoating was replaced by 0.08 mg*cm−2 of evaporated TPB. Fig. 12 (right) shows the spectrum\n11\n\n\fof the 60 keV line from Am-decay. During data taking the mean life of the slow component\nwas much lower than the established value of 1.6 μs, due to the impurity of the LAr (see e.g.\nref. [20]). By extrapolating the light yield to maximum purity we could set a lower limit of 3.2\np.e./keV.\nThe setup has now been improved by the addition of a cryocooler (Gifford-McMahon-type)\nmounted on top of the LAr cell. A cooling serpentine is bonded to the temperature regulated\ncold head and provides the liquefaction of the recirculated gas. Gas purification is achieved by\ntwo cleaning cartridges. They reduce the O2 and H2 O contamination below 20 ppm. A further\nupgrade of the LAr cell with a smaller active volume (and less surrounding material) to reduce\nmultiple scattering and enhance the light yield is in progress.\n\n5 Conclusions\nThe current experimental sensitivity on WIMPs is around 10−8 pb for masses of ∼100 GeV.\nThe goal of future experiments using solid state detectors or noble liquids such as LAr or LXe\nis to reach 10−10 – 10−11 pb, a sensitivity within theoretical predictions from supersymmetry.\nThe goal of the DARWIN consortium is to deliver the design for a LXe/LAr detector to become\noperational around 2016. Liquid argon technology is still in its infancy and intensive R&D is\nongoing, in particular to determine the light yield from heavily ionizing nuclear recoils. For the\nfirst time a large 1t LAr argon prototype detector (ArDM) was operated on the surface with a\nlight yield of 0.8 photoelectrons/keV electron equivalent. These are encouraging prospects to\ndetect WIMPs in LAr with a threshold below 50 keV.\n\nAcknowledgments\nThis work was performed together with the ArDM [14] and DARWIN [10] collaborations.\nContributions from my collaborators of the Physik-Institut (Y. Allkofer, V. Boccone, W. Creus,\nA. Ferella, P. Otyugova, C. Regenfus, J. Rochet, L. Scotto Lavina, and M. Walter) are gratefully\nacknowledged.\n\nReferences\n[1] For recent reviews see M. Drees and G. Gerbier, J. Phys. G: Nuclear and Particle Physics\n37, 075201 (2010) p. 255; R. Gaitskell, Ann. Rev. Nucl. Part. Sci. 54, 315 (2004).\n[2] See e.g. M. Milgrom, Scientific American, August 2002.\n[3] E. Aprile et al. (XENON100 Collaboration) prep. arXiv:1104.2549v1 [astro-ph.CO].\n[4] O. Buchmueller et al., prep. arXiv:1102.4585v1.\n[5] E. de Boer et al., Phys. Lett. B 636, 13 (2006).\n[6] R. Bernabei et al., Phys. Lett. B 480 (2000) 23; Eur. Phys. J. C56, 333 (2008).\n[7] R. Behnke et al., Science 319, 933 (2008).\n[8] Z. Ahmed et al. (CDMS collaboration), Phys. Rev. Lett.102, 01130 (2009).\n12\n\n\f[9] http://www.eureca.ox.ac.uk.\n[10] http://darwin.physik.uzh.ch.\n[11] L. Baudis, prep. arXiv:1012.4764v1 [astro-ph.IM].\n[12] G. Jungman et al., Physics Reports 267, 195 (1966).\n[13] R. Chandrasekharan, PhD Thesis, ETHZ, Nr. 16985 (2007).\n[14] http://neutrino.ethz.ch/ArDM/.\n[15] E. Calligarich et al., Int. Eur. Conf. HEP, Lisboa (2005).\n[16] A. Hitachi et al., Phys. Rev. B 27, 5279 (1983).\n[17] C. Amsler et al., Journal of Instrumentation 3, P02001 (2008).\n[18] P. Benetti at al., Nucl. Instrum. Meth. in Phys. Res. A 574, 83 (2007).\n[19] V. Boccone et al., Journal of Instrumentation 4, P06001 (2009).\n[20] C. Amsler et al., Journal of Instrumentation 5, P11003 (2010).\n[21] H. Cabrera, Master Thesis, Universität Zürich (2007).\n[22] V. Boccone, PhD-Thesis, Universität Zürich (2010).\n[23] D. Gastler et al., prep. arXiv:1004.0373v1 [physics.ins-det].\n[24] NSD-Fusion: http://www.nsd-fusion.com.\n\n13\n\n\f"}