{"id": "http://arxiv.org/abs/0802.3755v2", "guidislink": true, "updated": "2008-06-13T17:37:46Z", "updated_parsed": [2008, 6, 13, 17, 37, 46, 4, 165, 0], "published": "2008-02-26T07:14:06Z", "published_parsed": [2008, 2, 26, 7, 14, 6, 1, 57, 0], "title": "Spatial fluorescence cross correlation spectroscopy by means of a\n  spatial light modulator", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2667%2C0802.1482%2C0802.1821%2C0802.2416%2C0802.4033%2C0802.3465%2C0802.3728%2C0802.0940%2C0802.3818%2C0802.2791%2C0802.3165%2C0802.1984%2C0802.1652%2C0802.2867%2C0802.3503%2C0802.2270%2C0802.2830%2C0802.0033%2C0802.2087%2C0802.0347%2C0802.3120%2C0802.1898%2C0802.2607%2C0802.4324%2C0802.0282%2C0802.2232%2C0802.3224%2C0802.1271%2C0802.0531%2C0802.1371%2C0802.4441%2C0802.4382%2C0802.0214%2C0802.4242%2C0802.4296%2C0802.0200%2C0802.3912%2C0802.0006%2C0802.1219%2C0802.1170%2C0802.0500%2C0802.2568%2C0802.4329%2C0802.1569%2C0802.3293%2C0802.3807%2C0802.1666%2C0802.3178%2C0802.2033%2C0802.2458%2C0802.2611%2C0802.1471%2C0802.4300%2C0802.4301%2C0802.1182%2C0802.0802%2C0802.4065%2C0802.3305%2C0802.3468%2C0802.3059%2C0802.1742%2C0802.4195%2C0802.1738%2C0802.0476%2C0802.0047%2C0802.2964%2C0802.1704%2C0802.3755%2C0802.4239%2C0802.2256%2C0802.0798%2C0802.4437%2C0802.2318%2C0802.2566%2C0802.2744%2C0802.3351%2C0802.1796%2C0802.3097%2C0802.4342%2C0802.0373%2C0802.3685%2C0802.2968%2C0802.3991%2C0802.3937%2C0802.2389%2C0802.1966%2C0802.4273%2C0802.1241%2C0802.1274%2C0802.0468%2C0802.3511%2C0802.2962%2C0802.0076%2C0802.0868%2C0802.0913%2C0802.0773%2C0802.2958%2C0802.4080%2C0802.3687%2C0802.1248%2C0802.4237&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spatial fluorescence cross correlation spectroscopy by means of a\n  spatial light modulator"}, "summary": "Spatial Fluorescence Cross Correlation Spectroscopy is a rarely investigated\nversion of Fluorescence Correlation Spectroscopy, in which the fluorescence\nsignals from different observation volumes are cross-correlated. In the\nreported experiments, two observation volumes, typically shifted by a few\n$\\mu$m, are produced, with a Spatial Light Modulator and two adjustable\npinholes. We illustrated the feasibility and potentiality of this technique by:\ni) measuring molecular flows, in the range 0.2 - 1.5 $\\mu$m/ms, of so-lutions\nseeded with fluorescent nanobeads or rhodamine molecules (simulating active\ntransport phenomenons); ii) investigating the permeability of the\nphospholipidic membrane of Giant Unilamellar Vesicles versus hydrophilic or\nhydrophobic molecules (in that case the laser spots were set on both sides of\nthe membrane). Theoretical descriptions are proposed together with a\ndiscus-sion about Fluorescence Correlation Spectroscopy based, alternative\nmethods.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2667%2C0802.1482%2C0802.1821%2C0802.2416%2C0802.4033%2C0802.3465%2C0802.3728%2C0802.0940%2C0802.3818%2C0802.2791%2C0802.3165%2C0802.1984%2C0802.1652%2C0802.2867%2C0802.3503%2C0802.2270%2C0802.2830%2C0802.0033%2C0802.2087%2C0802.0347%2C0802.3120%2C0802.1898%2C0802.2607%2C0802.4324%2C0802.0282%2C0802.2232%2C0802.3224%2C0802.1271%2C0802.0531%2C0802.1371%2C0802.4441%2C0802.4382%2C0802.0214%2C0802.4242%2C0802.4296%2C0802.0200%2C0802.3912%2C0802.0006%2C0802.1219%2C0802.1170%2C0802.0500%2C0802.2568%2C0802.4329%2C0802.1569%2C0802.3293%2C0802.3807%2C0802.1666%2C0802.3178%2C0802.2033%2C0802.2458%2C0802.2611%2C0802.1471%2C0802.4300%2C0802.4301%2C0802.1182%2C0802.0802%2C0802.4065%2C0802.3305%2C0802.3468%2C0802.3059%2C0802.1742%2C0802.4195%2C0802.1738%2C0802.0476%2C0802.0047%2C0802.2964%2C0802.1704%2C0802.3755%2C0802.4239%2C0802.2256%2C0802.0798%2C0802.4437%2C0802.2318%2C0802.2566%2C0802.2744%2C0802.3351%2C0802.1796%2C0802.3097%2C0802.4342%2C0802.0373%2C0802.3685%2C0802.2968%2C0802.3991%2C0802.3937%2C0802.2389%2C0802.1966%2C0802.4273%2C0802.1241%2C0802.1274%2C0802.0468%2C0802.3511%2C0802.2962%2C0802.0076%2C0802.0868%2C0802.0913%2C0802.0773%2C0802.2958%2C0802.4080%2C0802.3687%2C0802.1248%2C0802.4237&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spatial Fluorescence Cross Correlation Spectroscopy is a rarely investigated\nversion of Fluorescence Correlation Spectroscopy, in which the fluorescence\nsignals from different observation volumes are cross-correlated. In the\nreported experiments, two observation volumes, typically shifted by a few\n$\\mu$m, are produced, with a Spatial Light Modulator and two adjustable\npinholes. We illustrated the feasibility and potentiality of this technique by:\ni) measuring molecular flows, in the range 0.2 - 1.5 $\\mu$m/ms, of so-lutions\nseeded with fluorescent nanobeads or rhodamine molecules (simulating active\ntransport phenomenons); ii) investigating the permeability of the\nphospholipidic membrane of Giant Unilamellar Vesicles versus hydrophilic or\nhydrophobic molecules (in that case the laser spots were set on both sides of\nthe membrane). Theoretical descriptions are proposed together with a\ndiscus-sion about Fluorescence Correlation Spectroscopy based, alternative\nmethods."}, "authors": ["Yoann Blancquaert", "Jie Gao", "Jacques Derouard", "Antoine Delon"], "author_detail": {"name": "Antoine Delon"}, "author": "Antoine Delon", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/jbio.200810506", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.3755v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.3755v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 6 figures, 1 tableau", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.3755v2", "affiliation": "LSP", "arxiv_url": "http://arxiv.org/abs/0802.3755v2", "journal_reference": "J. Biophotonics (2008) 1-12", "doi": "10.1002/jbio.200810506", "fulltext": "Journal of Biophotonics header will be provided by the publisher\n\nSPATIAL FLUORESCENCE CROSS CORRELATION\nSPECTROSCOPY BY MEANS OF A SPATIAL LIGHT\nMODULATOR\nYoann Blancquaert, Jie Gao, Jacques Derouard and Antoine Delon*\nLaboratoire de Spectrométrie Physique\nUniversité Grenoble I - UMR 5588 CNRS\nBP 87, 38402, Saint Martin d'Hères Cedex, France\nReceived zzz, revised zzz, accepted zzz\nPublished online zzz\n\nShort title: Y. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\nKey words: confocal microscopy, spatial light modulator, photonics, fluorescence correlation spectroscopy, single molecules,\nPACS: 87.64.mk, 42.40.Eq, 87.64.kv, 82.37.Vb\n\nSpatial Fluorescence Cross Correlation Spectroscopy is a rarely investigated version of Fluorescence Correlation Spectroscopy,\nin which the fluorescence signals from different observation volumes are cross-correlated. In the reported experiments, two observation volumes, typically shifted by a few μm, are produced, with a Spatial Light Modulator and two adjustable pinholes. We\nillustrated the feasibility and potentiality of this technique by: i) measuring molecular flows, in the range 0.2 – 1.5 μm/ms, of solutions seeded with fluorescent nanobeads or rhodamine molecules (simulating active transport phenomenons); ii) investigating\nthe permeability of the phospholipidic membrane of Giant Unilamellar Vesicles versus hydrophilic or hydrophobic molecules (in\nthat case the laser spots were set on both sides of the membrane). Theoretical descriptions are proposed together with a discussion about Fluorescence Correlation Spectroscopy based, alternative methods.\n\nCopyright line will be provided by the publisher\n\n* Corresponding author: adelon@ujf-grenoble.fr, Phone: +(33) 4 76 63 58 01, Fax: (33) 4 76 63 54 95\nCopyright line will be provided by the publisher\n\n\f2\n\nY. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\n\n1. Introduction\nSince its invention in the early seventies [1], Fluorescence Correlation Spectroscopy (FCS) has been used\nmostly to measure diffusion coefficients and concentrations. About ten years ago it has been extended to spatial\ncross-correlation spectroscopy (sFCCS), which is based\non a time and spatial dual correlation. It usually implies\ntwo shifted laser spots, creating two separate observation\nvolumes from which the fluorescence signals are detected. This method can thus assess the directional transport of molecules or particles between these volumes.\nOne key point, when performing sFCCS, is the fabrication of separate laser spots. Several techniques have\nbeen already used for doing this. In one of the pioneering\nexperiments, based on elastic scattering of light by latex\nspheres, the two volumes were obtained with two different Ar+ laser lines (458 and 514 nm) [2]. A few years\nlater, two papers reported sFCCS under confocal geometry [3,4]. Interestingly enough, it has been demonstrated\nthat time gated, two photon excitation, significantly lowers the undesired cross-talk between the two observation\nvolumes [4]. However, all these experiments used polarizing beam splitters and/or Wollaston prisms to split and\nrecombine the two, almost parallel, laser beams [3-5].\nThis made the adjustment of the separation between the\ntwo observation volumes not possible. Nevertheless, a\nWollaston prism is an interesting optical component because it can be easily inserted in the illumination path of\ncommercial FCS systems, providing a fixed and known\ndistance between the two foci which can therefore be\nused as an external ruler [5,6]. Passive Diffractive Optical Elements (DOE) have also been used to produce\ngaussian foci of submicrometer diameter and perform\nFCS and sFCCS experiments [7,8]. However, here also\nthere is some lack of flexibility, since each DOE is fabricated once and for all by electron beam lithography. A\nsignificant improvement has been recently brought to\nspatial measurements by scanning FCS [9]. This technique has been applied with various modalities [10-12]\nand can even be extended by exploiting the time structure present in images obtained with laser scanning confocal microscopes [13]. Finally, on the route towards\nmulticonfocal FCS we note the promising approaches using either EM-CCD camera [14], where each pixel is a\nunitary pixel, or spinning disk confocal microscopes [15],\nwhere up to ∼ 105 independent locations are available.\nTherefore, it appears clearly that the ideal multiconfocal\nFCS experiment would involve: i) a flexible way to address, simultaneously, the desired laser spots at various\nlocations within the biological medium; ii) a matrix of\nfast, point-like detectors. Concerning the first aspect,\nSpatial Light Modulators (SLM) became recently commercially available, opening new possibilities, especially\nfor optical tweezers [16], since these devices make it\npossible to control the laser illumination geometry.\n\nCopyright line will be provided by the publisher\n\nIn this paper we demonstrate the possibility of controlling the illumination with a SLM, by performing\nsFCCS measurement of active flow and permeability\nthrough the membrane of Giant Unilameller Vesicles\n(GUV). The article is organised as follows: in the following section 2) we present the experimental set-up with its\nmain characteristics, the spatial properties of the laser\nbeam after reflexion on the SLM and the corresponding\nconsequences for FCS data; section 3) is mainly devoted\nto the theoretical approach of permeability measurement\nwith sFCCS; the experimental results are presented in\nsection 4); finally we conclude in section 5).\n\n2. Experimental\n2.1 Experimental set-up\nIn our experimental set-up (Fig. 1), the fibered incident laser beam of power ≅ 200 μW (488 nm, KYMA,\nMelles Griot), was firstly collimated and expanded\n(2.4×) through a telescope (lenses 1 and 2), then sent to\nthe SLM device (LC-R 720, Holoeye), by means of mirrors 1 and 2. A λ/2 plate and a polarizer were introduced\nbefore the SLM to optimize the relative intensity of the\nvarious spots at the focus plane of the objective. Our\nSLM device (a reflective LCOS microdisplay) has\n1280×768 pixels, a pitch of 20 μm and can modulate the\nphase (encoded on 8 bits) between 0 and π. When necessary, the SLM could be bypassed by tilting mirrors 1 and\n3.\nThen, the laser beam, reflected by a periscope (not\nshown) and a dichroic mirror was focused within the\nsample, through the water objective (60×, NA 1.2) of an\ninverted microscope (Olympus IX70). The fluorescence\nlight was spectrally filtered, separated in two equivalent\npaths by means of a beam splitter and focused on two\nmultimode fibers (core diameter 100 μm), used as point\ndetectors. Note that the pairs of lenses 3, 4 and 3, 5 produce an additional 3× magnification, such that the total\nmagnification was about 180×. Finally, the two single\nphoton detectors (Avalanche Photodiodes, APD) were\nconnected to a home made data acquisition system and\ncorrelator.\nWe imaged various phase gratings on the SLM: echelette grating, where the phase varies linearly from 0 to π\nover a period of Pxl pixels; binary grating, where 1⁄2Pxl\npixels have no phase shift, followed by 1⁄2Pxl pixels with\na phase shift of π (period of Pxl pixels); phase step 0-π. It\nis interesting to note that the distance d between the 0th\nand 1rst order spots of an echelette grating of period Pxl is\nthe same than the distance between the two spots of orders ±1 of a binary grating of period Pxl (a binary 0-π\n\n\fJournal of Biophotonics header will be provided by the publisher\n\ngrating has, theoretically, no 0th order spot, but a tiny\nspot could nevertheless be observed).\nThe distance d between the centers of the laser spots\ncould be varied between 9.2 μm and 0.8 μm. The longer\ndistance was obtained with a binary grating of period Pxl\n= 20 pixels (corresponding to a spatial period, on the\nSLM, of 20×20μm = 400 μm) and the shorter one with a\n0-π phase step.\nFor flow measurements, a piezoelectric device (Piezosystem, Jena) has been used, the speed of which lies in\nthe range 200 – 1500 μm/s. In that case a droplet of solution, seeded with a nM concentration of the molecules or\nparticles of interest, was deposited on a cover slit attached to the piezoelectric device.\n\n2.2 Spatial properties of the laser beam\nSince it is known that SLM devices introduce geometrical aberrations [17], we have characterized the intensity\nprofile of the laser beam with a CCD camera (Spot Insight B/W, Diagnostic Instruments) and its wave-front\nwith a Shack-Hartmann sensor (HASO32, Imagine Optics). Note that these optical devices, inserted before the\nentrance of the microscope, are not shown in the Fig. 1\nscheme. We first recorded images of the beam profile at\nvarious distances from the focal plane of an achromatic\ndoublet (FL300, Melles Griot). Calculating the moments\nof the intensity distribution [18] and using the standard\nequations for the gaussian beam propagation [19], we\nobtained reliable values of the M2 parameters along two\nperpendicular directions, as shown in Table 1. The M2\nfactor, also called the beam quality, is the ratio of the\nbeam's divergence to that of a diffraction-limited beam\nof the same waist diameter [19]. When the laser beam\nwas reflected by the SLM, a blank or flat signal (i.e. no\nspatial variation of the phase shift) was addressed to it.\nTable 1 clearly indicates that geometrical aberrations\nare introduced, among which there must be, at least, astigmatism. Therefore, we measured these aberrations by\nusing the HASO device (Fig. 2). We quantified these aberrations with the Zernike polynomial expansion. Getting\nrid of the tilt parameters which are not relevant in the\npresent study, we found that the next and dominant, lowest order terms of the Zernike expansion, are the focus\nand the astigmatism coefficients [20], the values of each\nof them were of the order of 0.1 μm. The exact values\nwere dependent upon the location of the laser beam on\nthe LCOS micro display and upon the flatness of its surface, which is mechanically deformable. Then, we investigated the possibility of correcting the distorted wavefront by addressing spherical and astigmatism corrections to the SLM [21]. However, the efficiency of this\nmethod was found to be quite limited because the amplitude of the phase modulation of our LCOS device is λ/2,\n\n3\n\nwhile the total wave-front distortion overcomes this value (see Fig. 2).\n\n2.3 Fluorescent probes and sample preparation\nExperiments about permeability have been performed\nwith single dye molecules, the lipophilic Rhodamine 6G\n(R6G) and the hydrophilic Sulforhodamine G (SRG),\nboth from Radiant Dyes. These molecules were used\nwithout further purification and diluted at concentrations\nbetween 1 and 10 nM. In addition, to study active transport, we also used fluorescent nanobeads of diameter 20\nnm (Fluospheres F-8888, Invitrogen).\nThe Giant Unilameller Vesicles (GUV) used for permeability assessment were swollen from a lipid solution\n(DOPC) using the electroformation method [22]. They\nwere prepared in sucrose solutions of concentration 270\nmM. The GUV were then diluted in glucose solutions\n(300 mM) of equal osmolalities, in order to sediment on\nthe bottom of the perfusion chamber, where they could\nbe observed. The concentrations of fluorophores (SRG or\nR6G) inside and outside the GUV, were adjusted so that\nthe inner one matches the outer one.\n\n2.4 Properties of the FCS confocal volume\nIt appeared interesting to evaluate the influence of the\noptical aberrations upon the FCS measurements in solution, that is upon the corresponding confocal (or observation) volume. By fitting, with the standard diffusion\nmodel, the autocorrelation function of the fluorescence\nsignal [23], we could determine the characteristic diffusion time, τD = ωr2/4D (ωr being the radius of the usual\ngaussian describing the confocal volume and D the diffusion constant). Firstly, when the laser beam bypassed the\nSLM, the measured diffusion time of R6G in pure water,\nτD, was about 29 μs. This corresponded to ωr = 0.18 μm,\nassuming D = 280 μm2/s for the diffusion constant, at\nroom temperature, of R6G in water [24]. Secondly, when\nthe laser beam was reflected by the SLM (with a blank or\nflat signal), the diffusion time increased to about 45 μs.\nThis corresponded to an increase of ωr to 0.22 μm, due\nto the aberrations introduced by the SLM reflecting the\nlaser wave-front. In practice, any deformation of the\nwavefront and, henceforth of the intensity distribution at\nthe focal point of the objective, corresponds to an increase of the effective confocal volume, since it is the\nproduct of the illumination function and of the detection\none. However, theoretically, one must make a distinction\nbetween: i) the focus, that changes the beam crosssection at the focal point and that could be corrected by\nadjusting the convergence of the incident beam; ii) the\nastigmatism, that breaks the anisotropy of the confocal\nvolume.\n\nCopyright line will be provided by the publisher\n\n\f4\n\nY. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\n\nIt must also be noted that the viscosity of the sucrose\n(270 mM) and glucose (300 mM) solutions used for the\npermeability experiments, is significantly different from\nthat of pure water [25]. As a first consequence, the corresponding diffusion time increased to 52 μs for glucose (η\n= 1.16×10-3 Pa.s) and 65 μs for sucrose (η = 1.29×10-3\nPa.s). In addition, the change of the solution refraction\nindex, pure water versus sugar solutions, might have also\ncorrupted the value of τD, since the refraction index\nmodifies the laser focalization and fluorescence collection and, in turn, the radius, ωr, of the observation volume.\nFrom a practical point of view, the enlargement of\nthe confocal volumes increases their overlap. However,\ndespite this phenomenon, sFCCS could be used to access\npermeability and to measure active transport, providing\nthe observation volumes are farther apart than ≅ 1 μm.\n\n3. Theoretical background about sFCCS\n\n(1)\n\nwhere δI1,2(t) = I1,2(t) - <I1,2(t)> are the deviations from\nthe temporal averages of the signals. These deviations\narise from the fluctuations of the concentration of fluorescent molecules, δC, within the observation volumes,\nW1 and W2:\n(2)\nδI1,2 (t) = A1,2 ∫W1,2 (r)δC(r, t )dr\nwhere the constant A1,2 takes into account the laser\nintensity, the fluorescence cross-section and the overall\nfluorescence detection efficiency. The observation volumes are themselves the product of an illumination function and of the detection one [26]. Without entering\nwithin the details, we stress the fact that the illumination\nfunction is controlled by the laser excitation shaped by\nmeans of the SLM, while the detection one corresponds\nto the pinhole adjustment.\nTo describe our experimental situation, we consider\ntwo shifted, but equivalent, observation volumes, described by the same volume W and the same constant A.\nTherefore, the cross-correlation function reads:\nW(r'+Δ / 2)W(r\"−Δ / 2) δC(r', t)δC(r\", t +τ ) dr'dr\"\nGCC(Δ,τ ) =1+ ∫∫\n2\n2\nC [∫ W(r')dr']\n\n(3)\nwhere C is the mean value of the concentration.\n\nCopyright line will be provided by the publisher\n\nThe two laser spots being on a line parallel to the molecular flow of speed V, the cross correlation function is\nfound to be, in presence of diffusion [3]:\nG CC (Δ , τ ) = 1 +\n\n⎡ ⎛ Δ\n1\nexp ⎢ − ⎜⎜\nN\n⎢ ⎝ ωr\n⎣\n\n⎞\n⎟⎟\n⎠\n\n2\n\n(1 − τ / τ V )2 ⎤⎥\n(1 + τ τ D ) ⎥ (1 + τ\n⎦\n\n1\n\nτ D ) 1 + τ S 2τ D\n\n(4)\nwhere: ωr and τD are the same parameters as those defined in section 2.4; ωz is the elongation of the observation volume; S = ωz/ωr is the so called structure parameter; N = C π3/2ωr2 ωz is the number of molecules in the\neffective observation volume; τV = Δ/V is the characteristic flow time between the two observation volumes.\n\n3.2 sFCCS with permeability and diffusion\n\nLets us consider the general definition of the sFCCS\nfunction, obtained by cross-correlating the fluorescence\nsignals, I1(t) and I2(t), emanating from two different observation volumes, spatially shifted by Δ :\nI (t ) I (t +τ )\nδI (t )δI 2 (t +τ )\nGCC (Δ,τ ) = 1 2\n=1+ 1\nI1(t ) I 2 (t )\nI1(t ) I 2 (t )\n\n3.1 sFCCS with flow and diffusion\n\nIn presence of permeability, the propagator, that appears within the numerator of the above Eq. 3, contains\ntwo contributions. The first one, along the x direction,\nstands both for the diffusion, with constant D and for the\npermeability across the phospholipidic membrane, with\nconstant P [27]; the second one stands for the diffusion\nparallel to the y, z plane [28]:\n(\n\n)\n\n⎧\n⎡ r \"− r ' 2 ⎤ ⎫\nyz\n⎪ exp ⎢ − yz\n⎥⎪\n⎪\n4 Dτ\n⎢\n⎥ ⎪⎪\nP⎧\n⎛ 4 Pτ + x\" − x ' ⎞ ⎫⎪\n⎤\n⎡ 2P\n⎣\n⎦\nδC (r' , t )δC (r\" , t + τ ) = C\n(2 Pτ + x ' ' − x ')⎥ erfc ⎜\n⎟ ⎬⎨\n⎨exp ⎢\n⎬\nD⎩\n4πDτ\n⎦\n⎣D\n⎝ 2 Dτ\n⎠ ⎭⎪\n⎪\n⎪\n⎪\n⎩⎪\n⎭⎪\n\n(5)\nwhere the subscripts yz correspond to vectorial components in the y, z plane of the membrane (located at x =\n0). Using ref. [29], one can check that when the permeability P goes to infinity, the corresponding onedimensional contribution recovers the usual free diffusion expression. Inserting Eq. (5) within Eq. (3) and assuming (as usual) a gaussian shape for W does not lead\nto an analytical expression of the cross-correlation function. Although the corresponding numerical solution\ncould be fit with a multi-parameter analytical expression,\nthe latter would be painful to manipulate and discuss, so\nthat we prefer to represent W by a delta function to obtain a simple analytical solution:\n2\n2\n2\n2\n2\n2\nr\n⎛π ⎞\nW (r ) = e−2x / ωr × e−2 y / ωr × e−2z / ωz →⎜ ⎟\n⎝2⎠\n\n3/ 2\n\nωr 2ωzδ (x)δ (ryz )\n\n(6)\nNote that the integration of W still leads to a finite\nobservation volume containing the same number of\n\n\fJournal of Biophotonics header will be provided by the publisher\n\nmolecules as above mentioned, i.e. N = C π3/2ωr2 ωz.\nUsing this approximation for the observation volumes\n(symmetrically shifted by ±Δ/2 on both sides of the\nmembrane) and inserting it in the cross-correlation expression (Eq. 3), together with the propagator (Eq. 5), led\nto the following result:\nG CC (Δ , τ ) = 1 +\n\n1\nN\n\nπ ωr\n\n⎫⎧\nP⎧\n1\n⎡ 2P\n(2 Pτ + Δ )⎤⎥ erfc ⎛⎜⎜ 4 Pτ + Δ ⎞⎟⎟ ⎬⎪⎨\n⎨exp ⎢\nD⎩\n⎦\n⎣D\n⎝ 2 Dτ ⎠ ⎭⎪ τ τ D τ S 2τ D\n⎩\n\n⎫\n⎪\n⎬\n⎪⎭\n\n5\n\n200 μm/s, the amplitude of the cross-correlation function\nis very weak; conversely when P is much larger than 200\nμm/s the difference with the free diffusion case becomes\nsmall.\n\n4. Results and discussion\n\n(7)\n\n4.1 Flow measurements\nOnce again, this expression contains two contributions,\none for the permeability and one for the diffusion. It is\ninteresting to compare the expression of the diffusion\ncontribution (last factor of Eq. 7) with the exact expression for two-dimensional diffusion, that involves the\nterm (1 + τ/τD)-1/2(1 + τ/S2τD)-1/2. One clearly sees that\nthe approximation made for the observation volumes (Eq.\n6) is correct as long as the observation time, τ, is much\nlarger than the diffusion time through the observation\nvolume, τD. We will see in the experimental section that\nthe observed features fulfil this condition, thus justifying\nthe corresponding approximation. It is worthwhile to\nmake a practical remark about the utilization of the Eq.\n7: since the argument of the error function is always\npositive, the approximation by excess presented in ref.\n[29] is very useful to evaluate the cross correlation function, whatever are the parameters and variable values, P,\nD, Δ and τ .\nAs a result, we present in Fig. 3 a series of crosscorrelation functions calculated with parameters consistent with the experimental values: the permeability, P, is\nranging from 10 to 103 μm/s (solid curves); D = 280\nμm2/s; Δ = 1.4 μm; ωr = 0.22 μm and S = 5. In addition,\nthe limiting case of infinite permeability (dashed curves)\nis also shown. The first remark concerns the overall amplitude of these curves. Despite the fact that they are calculated for a density that corresponds to an average of\nN=1 molecule in the observation volume (thus corresponding to an auto-correlation function of amplitude 1),\ntheir amplitudes are much weaker than 1. This is because\nthe molecules diffuse in a three-dimensional space, implying that only a small fraction of them pass from one\nobservation volume to the other. The second and also\ndisappointing remark is that the location, in time, of the\nmaximum of the correlation functions is weakly dependent upon the permeability, thus preventing one to easily\nestimate the permeability by measuring this time. The\nlast, but more salient, feature concerns the evolution of\nthe amplitude of the cross-correlation function versus the\npermeability. One observes that when P = 1000 μm/s,\nthe amplitude of the cross-correlation function is close to\nthat of the asymptotic value (P = ∞, i.e. free diffusion),\nwhile, when P = 10 μm/s, its amplitude is negligible. The\ntransition, as a function of P, towards the limiting case of\nfree diffusion is governed by the value of the ratio D/Δ:\nconsequently, in our case, when P is much lower than\n\nAs presented in the Experimental section, we addressed various kinds of phase modulations to the SLM.\nThe 0-π phase step is the phase pattern that produces the\nshortest distance between the two laser spots (0.76 μm,\nmeasured with a calibrated CCD camera). As comparison, the larger separation was obtained with a binary\ngrating of period Pxl = 20 pixels, that produces two laser\nspots shifted by 9.2 μm. Varying the speed of the flow, V,\nfrom 0.5 to 1.5 μm/ms, we could easily observed cross\ncorrelation functions GCC(Δ,τ), the maxima of which being shifted towards shorter times when the speed, V, increases (Fig. 4). Typically, 10 acquisitions of 30 s have\nbeen recorded, in order to provide averaged values and\nerror bars.\nSince the goal of the present work is to demonstrate\nthat SLM makes it possible to produce laser spots (and\nhenceforth observation volumes) of tuneable separations\nand to make use of it for sFCCS experiments, we have\nsimply characterised the cross-correlation functions by\nthe time of their maxima, τmax and did not fit the experimental data to get the transport time τV (Eq. 4). One observes, in the insert of Fig. 4, a linear relation between\nτmax, and 1/V, from which one can estimate the separation\nbetween the two observation volumes, Δ = 0.94 μm for\nthe 0-π phase step and 8.5 μm for the binary grating of\nperiod Pxl = 20 pixels. The difference between these distances and those measured between the corresponding laser spots with the CCD camera (0.76 and 9.2 μm) is\npartly due to the fact that, when the two spots are closed,\nthe two pinholes do not match exactly the two laser spots,\nin order to limit the optical cross-talk between the two\nchannels. This cross-talk, sometimes called pseudo autocorrelation [4], appears as a back-ground signal at times\nshorter than the maxima of the cross-correlation functions. As a consequence, the theoretical cross-correlation\nfunction given by Eq. 4 does not match properly the observed data when the two spots are closed to each other\n(data not shown), so that, to obtain a good fit, it would be\nnecessary to introduce an autocorrelation contribution of\nadjustable weight and appropriate effective autocorrelation time [30]. This is the reason why it was simpler to characterise the cross-correlation functions by the\ntime of their maxima, τmax.\nCross-correlation data similar to those of Fig. 4 have\nbeen obtained using a echelette grating. The practical dif-\n\nCopyright line will be provided by the publisher\n\n\f6\n\nY. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\n\nference being that the two pinholes must, in that case, fit\nthe 0th and 1rst order laser spots, rather than the laser\nspots of orders ±1.\nWe also used molecular probes (R6G) to perform\ncross-correlations (data not shown). The important feature is that, compared to fluorescent nanobeads, the amplitude of the signal was much weaker because, simultaneously to the active transport of the molecules between\nthe two volumes, diffusion took place much faster. For\ninstance, using the Stokes-Einstein relation, one can estimate the diffusion constant of the 20 nm beads to be\nabout 20 μm2/s at room temperature, that is about 15\ntimes slower than that of R6G (280 μm2/s [24]). Consequently, the diffusion time, τD, of beads through the observation volume is about 500 μs (versus about 30 μs for\nR6G), that is of the order of the transport time, τV, between the two volumes separated by a few μm, with a\nflow speed of about 1 μm/ms. This situation is favourable for the observation of nanobeads flow, contrarily to\nthe case of fast diffusing - small molecules such as R6G:\nas a matter of fact, Eq. 4 immediately indicates that the\namplitude of the cross-correlation function, at time τ =\nτV (which is close to the time of the maximum, τmax), varies as ~ (τD/τV)3/2.\n\n4.2 Permeability assessment\nWe have assessed the permeability of GUV membranes versus the hydrophilic or lipophilic nature of the\nmolecules, by setting one of the spots within the GUV\nand the other one outside. These experiments have been\nperformed using a echelette grating of period 60 pixels,\noptimised to produce two spots of order 0 and 1, shifted\nby Δ = 1.35±0.10 μm (other orders were almost invisible). This can be seen in Fig. 5, together with two GUV.\nIn order to provide averaged values and error bars 10\nacquisitions of 30 s have been recorded. Note that in all\ncases (see Fig. 6) we observed a relatively large value of\nthe cross-correlation function at short times (< 102 μs),\nalso called pseudo autocorrelation, once again due to the\npartial overlap between the two observation volumes [4].\nThis overlap depended drastically upon the distance between the two volumes. In our experiment, their separation resulted from a compromise: if the separation is\nsmaller, the pseudo autocorrelation becomes too large;\nconversely, if the separation is larger, not enough molecules diffuse from one volume to the other and the amplitude of the corresponding cross-correlation bump becomes too small. Note that the pulsed laser technique,\nthat is sometimes used to significantly decrease the\npseudo autocorrelation [4,6], cannot be combined with a\nSLM, since in this kind of experiment a unique incident\nlaser beam is diffracted by the SLM to produce the two\nobservation volumes.\nWe first considered the case of hydrophilic molecules,\nSRG, that do not pass through a lipidic bilayer. We\n\nCopyright line will be provided by the publisher\n\nclearly see in Fig. 6 that, while a bump is clearly observable when both spots are set within the glucose solution,\nthis correlation bump disappears as soon as the two spots\nare set on each side of the membrane. This bump corresponds to the time it takes for the molecules to diffuse\nfrom one observation volume to the other. Note that this\ntime (≅ 103 μs) is much larger that the diffusion time\nthrough one observation volume (τD ≅ 50 – 60 μs) thus\nvalidating the approximation made in the theoretical section to calculate the cross correlation function (τ τD).\nTaking into account the overlap between the two observation volumes as a pseudo autocorrelation contribution\nof characteristic time τac and weight p, we performed a\nfit of the sFCCS function, with D = 241 μm2/s (instead of\n280 μm2/s, because of the glucose viscosity), ωr = 0.22\nμm, S = 5 and assuming a free diffusion in the three directions of the space [30]:\n\nGCC ( Δ , τ ) = 1 +\n\n⎡\n1 ⎢ ⎛\nτ\np⎜1 +\nN ⎢ ⎜⎝ τ ac\n⎢\n\n⎞\n⎟⎟\n⎠\n\n−3 / 2\n\n⎡ Δ2 ⎛\nτ\n⎜1 +\n+ (1 − p ) exp ⎢ −\n⎢ ω r 2 ⎜⎝ τ D\n⎣\n\n⎞\n⎟⎟\n⎠\n\n−1 ⎤\n\n⎛\n⎞\n⎥⎜1 + τ ⎟\n⎥ ⎜⎝ τ D ⎟⎠\n⎦\n\n−1\n\n⎛\n⎜1 + τ\n⎜\nS 2τ D\n⎝\n\n⎞\n⎟\n⎟\n⎠\n\n−1 / 2 ⎤\n\n⎥\n⎥\n⎥\n\n(8)\nOne can show that the cross correlation contribution of\nthis formula corresponds to the infinite permeability\nlimit of Eq. 7. As can be seen in Fig. 6, this fit (solid\ncurve) provides a reasonable value of the distance Δ between the two volumes: 1.16 ± 0.02 μm, compared to the\nmeasured spot separation (1.35 ± 0.10 μm). These two\nquantities are not expected to be the same, since the observation volumes result from the combination of the laser illumination (i.e. the spot location) and the pinhole\ndetection. We believe that the overlap between the two\nvolumes and the approximate expression, Eq. (8), used to\ndescribe the cross correlation also contribute to the difference. Let us now turn to lipophilic molecules, like\nR6G. Contrarily to SRG, lipidic bilayers are very permeable to these molecules, as shown in the insert of Fig. 6,\nwhere one does not observe any significant difference\nbetween the cross-correlation curves recorded with, either the two spots embedded within the solution, or set\nacross the membrane. This is because the probability to\nfind lipidic molecules within the membrane is high, as\ncan be easily checked with wide field fluorescence imaging (data not shown). As a consequence, these molecules\nvery quickly pass the membrane. This can be rationalized\nwith the following equation:\nP = KDL/Δx\n\n(9)\n\nthat relates the permeability, P, to the partition coefficient, K and to the diffusion constant, DL, of the molecules of interest in the lipidic bilayer of thickness Δx [31].\nThe (lipids-water) partition coefficient of a given species\nis the ratio of the concentrations of this species in lipids\nand in water, at equilibrium. Assuming that the diffusion\nconstants, DL, of R6G and SRG are close together, the\n\n\fJournal of Biophotonics header will be provided by the publisher\n\ndifference of their permeability is mainly dependent\nupon their partition coefficients, K. As a matter of fact,\nwhile K is close to 104 for R6G [32], that of SRG is\nsmaller than 0.01 [33], that corresponds to a much higher\nsolubility of R6G in the lipidic phase. Using the StokesEinstein equation and a viscosity η within the phospholipidic bilayer of about 0.01 Pa.s [34], the diffusion constant, DL, is set to 30 μm2/s. Assuming that the thickness,\nΔx, of the phospholipidic bilayer is 3 nm, we derived P =\n108 μm/s for R6G and P < 100 μm/s for SRG. As discussed in the theoretical section, the cross-correlation\nbump cannot be observed if the permeability if much\nlower than 200 μm/s, which is consistent with our observations for SRG (see the Fig. 6). Conversely, the permeability of the membrane to R6G is so large that it does\nnot modify the cross-correlation function, compared to\nits bulk value, as can be seen in the insert of Fig. 6.\n\n5. Conclusion\nIn this paper we have shown that a SLM device can\nbe used in sFCCS experiments to measure active or passive transport. The principle consists in cross-correlating\nthe intensity fluctuations coming from two nearby observation volumes, the separation of which being controllable by varying the parameters of the computeraddressed phase grating.\nThanks to sFCCS, directional transport can be measured much more easily than can be done with FCS [35].\nThe technique presented in this manuscript could be applied to flow velocity measurements in micro-scale miniaturized structures in the fields of chemical analysis\nand biological sciences. Other important applications are\nthe measurements of active transport in living cells, for\ninstance along internal tubular network [36] and the\nmeasurements of flow profiles in living tissues and organisms [37]. We also want to stress the fact that our\ntechnique could also be used for multi-point FCS measurements, i.e. without cross-correlating the photons\nstreams emanating from the different laser volumes. A\nliving cell being a highly inhomogeneous medium, the\npossibility to assess, by FCS, concentration and diffusion\nat different places, but simultaneously, is very promising.\nDespite the aberrations introduced by the SLM in the\noptical path, we could easily measure flow speeds of a\nfew μm/ms or less, providing the diffusion time (within\neach of the confocal volumes) is not too small compared\nto the transport time between these volumes. The advantage brought by the SLM device is the possibility to optimise the distance between the volumes and to re-orient\nthem, according to the specific geometry of the sample.\nOur approach can be compared with the one based on\nscanning FCS and recently implemented on a Laser\nScanning Confocal Microscope [12]. The shorter dis-\n\n7\n\ntance we could achieve (0.94 μm) was limited by the\noverlap between the confocal volumes. However, shorter\nseparations should be attainable if aberration corrections\nare made (which was not possible with our device, limited to 0-π phase shifts).\nBecause the permeability is an important property of\ncellular membrane, that governs exchanges between\nvarious domains, we also tested our instrument with\nGUV, the permeability of which varying with the more\nor less hydrophobic character of the molecules. Although\nour results are rather on a yes or not basis, we showed,\nfor the first time, at a single molecule level, the influence\nof the permeability upon the sFCCS data, by comparing\nhydrophobic molecules (R6G) that do quickly pass a\nlipidic membrane and hydrophilic ones (SRG), that do\nnot. One may think about applying the sFCCS technique\nto cell membranes, such as the nuclear envelope[38] or\nthe membrane connecting neighbouring cells [39]. However, the average permeability of the membranes, that\ndepends upon the area density of transporters (or pores)\nspanning the membrane (~50 pores / μm2), the structure\nof the pores (~10 nm in diameter and 40 nm long) and\nthe size of the molecular permeant, is probably too low\n(< 100 μm/s) to be assessable by sFCCS [see e.g. 38-40].\nIn contrast, the nuclear envelope breakdown occurring\nduring cell division [38] is a situation where the sFCCS\ntechnique should be appropriate to measure the density\nand permeability of disassembled pores.\nThe two presented experiments are to be considered\nas proofs of principle that sFCCS is doable with a SLM.\nClearly the justification of such a technique comes from\nlive cell studies, where it is highly desirable to perform\nmultiplexed acquisitions, in order to measure, at the\nsame time, molecular concentrations and transport properties at various locations within the cellular environment. An alternative and well established technique\nwould be scanning FCS, but it is limited to the study of\nrelatively slow processes when a large portion of the\nfield of view has to be characterised [9-11]. For this reason, the potentialities offered by EM-CCD cameras, as\narrays of pixels, is especially interesting for sFCCS [14],\neven if, at the moment, these devices are not able to\nreach high acquisition speeds (to our knowledge, the\nmaximum rate is about 500 images / s for a 128×128\npixel area). Four years ago, it has been shown that a 2×2\narray of CMOS-Single Photon Avalanche Detector\n(SPAD) can be combined with a DOE to perform multiconfocal FCS [41]. Therefore, the emergence, in a\nprobably close future, of CMOS-SPAD cameras with\nlarger number of pixels is very exciting. By combining\nsuch a detector with an illumination controlled by SLM,\nthere is, virtually, no limit for sFCCS.\n\nCopyright line will be provided by the publisher\n\n\f8\n\nY. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\n\n6. Acknowledgement\nWe thank J.P. Pique for the loan of the ShackHartmann sensor.\n\nCopyright line will be provided by the publisher\n\n\fJournal of Biophotonics header will be provided by the publisher\n\n9\n\nYoann Blancquaert, born 3 August,\n1979 in Brest, France. Education: M. Sc\nin Physical Engineering, Université Grenoble I, France. 2006 PhD in Physical\nEngineering, Université Grenoble I,\nFrance. Current position in a microelectronic company.\nJie GAO, born 21 December, 1981 in\nWuhan, China. Education: M. Sc in\nPhysical Engineering, Université Grenoble I, France. PhD student in Laboratoire de Spectrométrie Physique from\ndecember 2007, Université Grenoble I,\nFrance. Current research interests: Fluorescence Correlation Spectroscopy, cellular biomechanics, microfabrication of polymer structures.\nJacques DEROUARD, born 19 June,\n1953, is professor at Université Grenoble I, France. Education: 1974 graduated from Ecole Normale Supérieure\nand University Paris VI. 1983 \"Doctorat\nd'Etat es Sciences\", Université Grenoble I, France. Current research interests: optical\nspectroscopic methods, biomedical optics, single molecule imaging. He has been awarded from CNRS\n(bronze medal, 1983), and was member of the Institut\nUniversitaire de France (1993-1998)\nAntoine DELON, born 8 December,\n1963, is professor at Université Grenoble I, France. Education: 1991 PhD\nUniversité Grenoble I, France. Current\nresearch interests: Fluorescence Correlation Spectroscopy, single molecule\nimaging, continuous photobleaching in\nliving cells. He was member of the Institut Universitaire de France (1997- 2002).\n\nCopyright line will be provided by the publisher\n\n\f10\n\nY. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\n\nReferences\n[1] D. Madge, E. Elson, and W. W. Webb, Phys. Rev. Lett.\n29, 705 (1972)\n[2] K.-Q. Xia and Y.-B. Xin, P. Tong, J. Opt. Soc. Am. A 12,\n1571 (1995)\n[3] M. Brinkmeier, K. Dörre, J. Stephan, and M. Eigen, Anal.\nChem. 71, 609 (1999)\n[4] P. Dittrich, and P. Schwille, Anal. Chem. 74, 4472–4479\n(2002)\n[5] D. Lumma, A. Best, A. Gansen, F. Feuillebois, J. O.\nRädler, and O. I. Vinogradova1, Phys. Rev E 67, 0563131 (2003)\n[6] T. Dertinger, V. Pacheco, I. von der Hocht, R. Hartmann, I.\nGregor, and J. Enderlein, Chem. Phys. Chem. 8, 433\n(2007)\n[7] H. Blom, M. Johansson, A.-S. Hedman, L. Lundberg, A.\nHanning, Sverker Hård, and Rudolf Rigler, App. Opt. 41,\n3336 (2002)\n[8] H. Blom, M. Johansson, M. Gösch, T. Sigmundsson, J.\nHolm, S. Hård, and R. Rigler, App. Opt. 41, 6614 (2002)\n[9] Q. Ruan, M. A. Cheng, M. Levi, E. Gratton and W. W.\nMantulin, Biophys. J. 87, 1260 (2004)\n[10] J.P. Skinner, Y. Chen and J.D. Müller, Biophys. J. 89,\n1288 (2005)\n[11] J. Ries and P. Schwille, Biophys. J. 91, 1915 (2006)\n[12] X. Pan, H. Yu, X. Shi, V. Korzh and T. Wohland, J.\nBiomed. Opt. 12, 014034 (2007)\n[13] M. A. Digman, C. M. Brown, P. Sengupta, P. W. Wiseman, A. R. Horwitz and E. Gratton, Biophys. J 89, 1317\n(2005)\n[14] M. Burkhardt, and P. Schwille, Opt. Exp. 14, 5013\n(2006) .\n[15] D. R. Sisan, R. Arevalo, C. Graves, R. McAlllister and J.\nS. Urbach, Biophys. J. 91, 4241 (2006)\n[16] J. E. Curtis, B. A. Koss and D. G. Grier, Opt. Com. 207,\n169 (2002)\n[17] E. Martin-Bendosa, M. Montes-Usategui, A. Carnicer, J.\nAndilla, E. Pleguezuelos and I. Juvells, J. Opt. A : Pure\nAppl. Opt. 9, S267 (2007)\n[18]\nhttp://rsb.info.nih.gov/ij/plugins/download/moment_calcu\nlator.Java\n[19] T. F. Johnston, Jr, Appl. Opt. 37, 4840 (1998)\n[20] G. D. Love, Appl. Opt. 36, 1517 (1997)\n[21] K. D. Wulff, D. G. Cole, R. L. Clarck, R. DiLeonardo, J.\nLeach, J. Cooper, G. Gibson and M. J. Padgett, Opt. Express 14, 4170 (2006)\n\nCopyright line will be provided by the publisher\n\n[22] M. I. Angelova, S. Soléau, P. Méléard, J. Faucon and P.\nBothorel, Progr. Coll. Pol. Sci. 89, 127 (1992)\n[23] W. W. Webb, Appl. Opt. 40, 3969 (2001)\n[24] J. Schuster, F. Cichos, J. Wrachtrup and C. von Borczyskowski, Single Mol. 1, 299 (2000)\n[25] D. R. Lide (eds), Handbook of Chemistry and Physics\n(CRC Press, 2006)\n[26] S. T. Hess, and W. W. Webb, Biophys. J. 83, 2300\n(2002)\n[27] P. N. Sen, J. Chem. Phys. 119, 9871 (2003)\n[28] M. Weiss, H. Hashimoto, and T. Nilsson, Biophys. J. 84,\n4043 (2003)\n[29] W. Gautschi, M. Abramowitz, I. A. Stegun (eds), \"Error\nFunction and Fresnel Integrals\" in Handbook of Mathematical Functions (National Bureau of Standards, Washington, 1972), p297\n[30] R. Jaffiol, Y. Blancquaert, A. Delon and J. Derouard,\nAppl. Opt. 45, 1225 (2006)\n[31] B. Yu, C. Y. Dong, P.T. So, D. Blankschtein, and R.\nLanger, J. Invest Dermatol. 117, 16 (2001)\n[32] N.P. Cheruvu, U.B. Kompella, Invest Ophthalmol. Vis.\nSci. 47, 4513-4522 (2006)\n[33] J.C. Vial, Laboratoire de Spectrométrie Physique, BP 87,\n38402 Saint Martin d'Hères Cedex 9, France (personal\ncommunication, 2007)\n[34] M. A. França Faria, C. F. de Sa ́, G. R. Lima, J. I. B. C.\nFilho, R. J. Martins, M. J. E. de M. Cardoso, and O. E.\nBarcia, J. Chem. Eng. Data. 50, 1938 (2005)\n[35] P.-F. Lenne, D. Colombo, H. Giovannini and H.\nRigneault, Single Mol., 3, 194 (2002)\n[36] R.H. Kohler, P. Schwille, W.W. Webb and M.R. Hason,\nJ. Cell Sci. 113, 3921 (2000)\n[37] X. Pan, H. Yu, X. Shi, V. Korzh and T. Wohland, J.\nBiomed. Opt. 12, p14034 ( 2007)\n[38] P. Lénart and J. Ellenberg, Methods 38, 17 (2006)\n[39] J. M. Nitsche, H.-C. Chang, P. A. Weber and B. J.\nNicholson, Biophys. J. 86, 2058 (2004)\n[40] O. Keminer and R. Peters, Biophys. J. 77, 217 (1999)\n[41] M. Gösch, A. Serov, T. Anhut, T. Lasser, A. Rochas, P.A.\nBesse, R. S. Popovic, H. Blom and R. Rigler, J. Biomed.\nOpt. 9, 913 (2004)\n\n\fJournal of Biophotonics header will be provided by the publisher\n\nTable and figures\n\n11\n\n----------------------------------------------------------------------------\n\nTable 1 M2 measurements along horizontal (x) and vertical (y)\ndirections.\nLaser beam\n\nM2(x)\n\nNon reflected by the 1.03\nSLM\nReflected by the\n2.33\nSLM\n\nM2(y)\n1.08\n5.28\n\nFigure 1 Experimental set-up, showing the excitation path with\nthe laser shaping optics (beam expander, polarizing elements\nand SLM device) and the fluorescence path with the spectral\nfiltering, additional magnification and the two independent\nchannels with their adjustable pinholes (optical fibers).\n----------------------------------------------------------------------------\n\nFigure 2 Laser wavefront, incident (a) or reflected by the SLM\n(b). Note that the amplitude, peak to peak, of the distortion introduced by the SLM (b) is equal to 0.405 μm (0.295 + 0.119),\nwhich is larger than λ/2 = 0.244 μm. This amplitude (0.405\nμm) is also much larger than that of the distortion of the incident beam (a).\n----------------------------------------------------------------------------\n\nCopyright line will be provided by the publisher\n\n\f12\n\nY. Blancquaert, J. Gao, J. Derouard and A. Delon: spatial fluorescence cross correlation spectroscopy\n\n--------------------------------------------------------------------------\n\nFigure 3 Calculated cross-correlation functions between two\nobservation volumes shifted by 1.4 μm, assuming a diffusion\ncoefficient of 280 μm2/s and an observation volume radius ωr =\n0.22 μm. The permeability constant, P, is set to 10, 102 and 103\nμm/s, in addition to the free diffusion case, i.e. P = ∞.\n---------------------------------------------------------------------------\n\n----------------------------------------------------------------------------\n\nFigure 5 Wide field view of two GUVs, a few tens of μm in\ndiameter, together with a pair of spots created by the SLM.\nThese two spots, far apart by about Δ = 1.4 μm, can be oriented\nand placed, either within the inner or outer solution, or across\nthe membrane.\n---------------------------------------------------------------------------\n\nFigure 4 Cross correlation functions obtained with two observation volumes produced with a binary grating of period Pxl =\n20 pixels on the spatial light modulator. The fluorescent entities\nare 20 nm beads and the velocity of the flow is 1.5, 1.2, 1, 0.7\nand 0.5 μm/ms. Error bars are standard errors of the mean. The\ninsert shows the times, τmax, of the maxima of the cross correlation functions, versus the inverse of the flow speed V, for the\nbinary grating and for a 0-π phase step (cross-correlation data\nnot shown). The effective distances between the observation\nvolumes were deduced from linear regressions (straight lines):\n0.94 μm for the 0-π phase step and 8.5 μm for the binary grating.\n\nFigure 6 Cross-correlation functions obtained with SRG, by\nsetting the two spots, either in the external glucose solution, or\nacross the membrane of a GUV. The solid lines are the fits of\nthe cross-correlation functions obtained in solution and across\nthe membrane, taking into account the pseudo auto-correlation\nand the free diffusion between the two observation volumes.\nError bars are standard errors of the mean. The insert shows,\nfor comparison, the cross-correlation functions obtained with\nR6G; the two curves are closer to each others because of the\nvery large permeability of the membrane for R6G.\n\n----------------------------------------------------------------------------\n\n----------------------------------------------------------------------------\n\nCopyright line will be provided by the publisher\n\n\f"}