{"id": "http://arxiv.org/abs/1107.0665v1", "guidislink": true, "updated": "2011-07-04T15:47:48Z", "updated_parsed": [2011, 7, 4, 15, 47, 48, 0, 185, 0], "published": "2011-07-04T15:47:48Z", "published_parsed": [2011, 7, 4, 15, 47, 48, 0, 185, 0], "title": "Coherent Cherenkov Radiation from Cosmic-Ray-Induced Air Showers", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.2572%2C1107.0505%2C1107.4479%2C1107.3945%2C1107.2877%2C1107.1810%2C1107.1380%2C1107.0266%2C1107.4496%2C1107.3558%2C1107.3822%2C1107.0665%2C1107.5289%2C1107.4846%2C1107.5316%2C1107.5044%2C1107.4589%2C1107.0082%2C1107.2579%2C1107.2216%2C1107.4491%2C1107.0431%2C1107.4989%2C1107.1966%2C1107.2100%2C1107.3202%2C1107.0714%2C1107.5925%2C1107.4460%2C1107.2093%2C1107.1737%2C1107.5709%2C1107.4964%2C1107.4416%2C1107.2368%2C1107.5879%2C1107.0267%2C1107.4515%2C1107.0358%2C1107.4699%2C1107.0556%2C1107.1043%2C1107.4133%2C1107.1329%2C1107.0799%2C1107.0392%2C1107.3591%2C1107.2314%2C1107.0272%2C1107.2083%2C1107.1016%2C1107.4691%2C1107.3842%2C1107.4898%2C1107.4911%2C1107.2964%2C1107.0977%2C1107.0847%2C1107.4216%2C1107.1401%2C1107.4913%2C1107.5569%2C1107.5840%2C1107.5504%2C1107.5206%2C1107.4585%2C1107.5654%2C1107.2852%2C1107.1493%2C1107.0996%2C1107.3804%2C1107.3936%2C1107.4131%2C1107.3737%2C1107.2189%2C1107.2103%2C1107.3233%2C1107.0672%2C1107.1772%2C1107.0453%2C1107.0973%2C1107.1628%2C1107.3873%2C1107.2047%2C1107.3100%2C1107.2966%2C1107.5939%2C1107.1100%2C1107.4112%2C1107.1594%2C1107.5728%2C1107.5579%2C1107.0520%2C1107.2338%2C1107.5908%2C1107.4757%2C1107.1767%2C1107.0074%2C1107.2204%2C1107.0043%2C1107.4203&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Coherent Cherenkov Radiation from Cosmic-Ray-Induced Air Showers"}, "summary": "Very energetic cosmic rays entering the atmosphere of the Earth will create a\nplasma cloud moving with almost the speed of light. The magnetic field of the\nEarth induces an electric current in this cloud which is responsible for the\nemission of coherent electromagnetic radiation. We propose to search for a new\neffect: due to the index of refraction of air this radiation is collimated in a\nCherenkov cone. To express the difference from usual Cherenkov radiation, i.e.\nthe emission from a fast moving electric charge, we call this\nmagnetically-induced Cherenkov radiation. We indicate its signature and\npossible experimental verification.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.2572%2C1107.0505%2C1107.4479%2C1107.3945%2C1107.2877%2C1107.1810%2C1107.1380%2C1107.0266%2C1107.4496%2C1107.3558%2C1107.3822%2C1107.0665%2C1107.5289%2C1107.4846%2C1107.5316%2C1107.5044%2C1107.4589%2C1107.0082%2C1107.2579%2C1107.2216%2C1107.4491%2C1107.0431%2C1107.4989%2C1107.1966%2C1107.2100%2C1107.3202%2C1107.0714%2C1107.5925%2C1107.4460%2C1107.2093%2C1107.1737%2C1107.5709%2C1107.4964%2C1107.4416%2C1107.2368%2C1107.5879%2C1107.0267%2C1107.4515%2C1107.0358%2C1107.4699%2C1107.0556%2C1107.1043%2C1107.4133%2C1107.1329%2C1107.0799%2C1107.0392%2C1107.3591%2C1107.2314%2C1107.0272%2C1107.2083%2C1107.1016%2C1107.4691%2C1107.3842%2C1107.4898%2C1107.4911%2C1107.2964%2C1107.0977%2C1107.0847%2C1107.4216%2C1107.1401%2C1107.4913%2C1107.5569%2C1107.5840%2C1107.5504%2C1107.5206%2C1107.4585%2C1107.5654%2C1107.2852%2C1107.1493%2C1107.0996%2C1107.3804%2C1107.3936%2C1107.4131%2C1107.3737%2C1107.2189%2C1107.2103%2C1107.3233%2C1107.0672%2C1107.1772%2C1107.0453%2C1107.0973%2C1107.1628%2C1107.3873%2C1107.2047%2C1107.3100%2C1107.2966%2C1107.5939%2C1107.1100%2C1107.4112%2C1107.1594%2C1107.5728%2C1107.5579%2C1107.0520%2C1107.2338%2C1107.5908%2C1107.4757%2C1107.1767%2C1107.0074%2C1107.2204%2C1107.0043%2C1107.4203&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Very energetic cosmic rays entering the atmosphere of the Earth will create a\nplasma cloud moving with almost the speed of light. The magnetic field of the\nEarth induces an electric current in this cloud which is responsible for the\nemission of coherent electromagnetic radiation. We propose to search for a new\neffect: due to the index of refraction of air this radiation is collimated in a\nCherenkov cone. To express the difference from usual Cherenkov radiation, i.e.\nthe emission from a fast moving electric charge, we call this\nmagnetically-induced Cherenkov radiation. We indicate its signature and\npossible experimental verification."}, "authors": ["K. D. de Vries", "A. M. van den Berg", "O. Scholten", "K. Werner"], "author_detail": {"name": "K. Werner"}, "author": "K. Werner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.107.061101", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.0665v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.0665v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to Phys. Rev. Lett", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.0665v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.0665v1", "journal_reference": "Phys.Rev.Lett.107:061101,2011", "doi": "10.1103/PhysRevLett.107.061101", "fulltext": "Coherent Cherenkov Radiation from Cosmic-Ray-Induced Air Showers\nK.D. de Vries,1 A.M. van den Berg,1 O. Scholten,1 and K. Werner2\n1\n\nKernfysisch Versneller Instituut, University of Groningen, 9747 AA, Groningen, The Netherlands\n2\nSUBATECH, University of Nantes – IN2P3/CNRS– EMN, Nantes, France\n(Dated: October 28, 2018)\n\narXiv:1107.0665v1 [astro-ph.HE] 4 Jul 2011\n\nVery energetic cosmic rays entering the atmosphere of the Earth will create a plasma cloud moving\nwith almost the speed of light. The magnetic field of the Earth induces an electric current in this\ncloud which is responsible for the emission of coherent electromagnetic radiation. We propose to\nsearch for a new effect: due to the index of refraction of air this radiation is collimated in a Cherenkov\ncone. To express the difference from usual Cherenkov radiation, i.e. the emission from a fast moving\nelectric charge, we call this magnetically-induced Cherenkov radiation. We indicate its signature\nand possible experimental verification.\n\nINTRODUCTION\n\nIt is a well-known fact that an emitting source moving\nat a velocity exceeding the wave-propagation velocity in\nthe medium will induce a shock-wave. Prime examples\nof this phenomenon are the sonic boom emitted by a\nsuper-sonic airplane, a bow-wave from a moving ship,\nand Cherenkov radiation emitted by an electric charge\nmoving at almost the vacuum speed of light in a medium\nwith an appreciable index of refraction. In this work we\nshow that a similar effect occurs in the emission from\na fast moving electric current. It is suggested that this\neffect manifests itself in the emission of electromagnetic\nwaves from particle cascades in the atmosphere of the\nEarth initiated by ultra-high energy (UHE) cosmic rays,\nwith energies in excess of 1017 eV.\nAn UHE cosmic ray entering the atmosphere of the\nEarth creates a cascade of particles, called an extensive air shower (EAS). In this cascade there are copious\namounts (> 106 , depending on the initial energy of the\ncosmic ray) of electrons and positrons forming a small\nplasma cloud. This cloud, with a typical size of less than\n1 m, moves with almost the light velocity towards Earth.\nThe magnetic field of the Earth, by means of the Lorentz\nforce, induces a drift velocity for the leptons which is\nperpendicular to the direction of the initial cosmic ray\nand opposite for electrons and positrons. As a result\nan electric current is created in the fast moving plasma\ncloud. The strength of the induced electric current is\nroughly proportional to the number of charged particles\nin the plasma cloud as the induced drift velocity is varying little with height. This macroscopic picture [1] was\nrecently confirmed [2] to agree with a microscopic description [3]. Even when the index of refraction of air\nwould be equal to that of vacuum this varying electric\ncurrent emits electromagnetic waves and coherent emission occurs at a wavelength longer than the size of the\ncharge cloud, i.e. for radio frequencies ν < 300 MHz [4].\nThe geomagnetic emission mechanism [5] has been confirmed from data [6]. In addition to the induced current the plasma cloud has a net charge excess which also\n\nradiates. The polarization direction of radiation distinguishes the emission due to the charge excess and the\ngeomagnetic current [7, 8]. Since charge-excess radiation\nis generally smaller in intensity we will concentrate in\nthis work on geomagnetic emission.\nAs is well known the propagation speed of electromagnetic waves is c/n where c denotes the velocity of light\nin vacuum. In this work we investigate the effect of the\nindex of refraction of air, n, on the emission following\nRef. [9]. The effects of Cherenkov radiation from EAS\nhave also been addressed in Ref. [10]. In this work we\nshow that for realistic values for n the Cherenkov effect\nintroduces distinct features in the ground pattern of the\nemitted radiation.\nRADIO WAVE EMISSION\n\nAs described, a cosmic ray entering the atmosphere induces an EAS, a plasma cloud moving at almost the light\nvelocity, where the magnetic field of the Earth induces\na net electric current in the plasma [1]. From classical\nelectrodynamics [11] we obtain the Liénard-Wiechert po~ 0 ) and\ntentials for a point source following a trajectory ξ(t\nan observer at rest at (t, ~x),\n~ 0 )) =\nAμP L (t, ~x − ξ(t\n\nμ0 JPμ L\n4π |D|\n\nt=t0\n\n,\n\n(1)\n\nwhere t0 denotes the retarded time corresponding to the\ntime the signal was emitted from the moving charge distribution and D is the retarded distance [9]. In the pointlike approximation (denoted by P L ) where the size of the\nplasma cloud is infinitesimal the four-current is,\n~ 0 )) ,\nJPμ L (t0 , ~x) = J μ (t0 )δ 3 (~x − ξ(t\n\n(2)\n\n~ 0 ) = −ct0~ez and JP L carries a longitudinal comwhere ξ(t\nponent due to the net charge excess (which we will ignore)\nand a transverse component due to the opposite drift\nof electrons and positrons induced by the Earth magnetic field. The transverse component is proportional\nto the number of charged particles at a given height,\n\n\f2\nJ ⊥ (t0 ) ∝ Ne (z) where z = −c t0 is the distance to the\nEarth's surface as measured along the shower path.\nThe electromagnetic fields at the observer are given as,\nE i = c(∂ i A0 − ∂ 0 Ai ) ,\n\n(3)\n\nwith i = x, y, z, an observer located at ~x = (x, y, z = 0),\nand where at tp\n= t0 = 0 the shower hits the Earth. The\nx2 + y 2 is equal to the transverse disdistance d =\ntance to the shower axis. The velocity of the charge\ncloud is cβ where we set β = 1 in the following. For\nthe\np special case n = 1, the retarded distance D =\n(−βct)2 + (1 − n2 β 2 )d2 reduces to D = βct which is\nfinite.\nThe retarded time is defined by the light-cone condi~ 0 )) , where the distance L = L(~x, ξ)\n~\ntion c(t−t0 ) = L(~x, ξ(t\nis the optical path length between the source located at\nξ~ and the observer at ~x. In reality the index of refraction of air depends on density and thus height, n = n(z),\nhence light\nR will follow curved trajectories where L is the\nintegral ds along the light curve from ξ~ to ~x.\n8\n\nNe (10 )\n0\n\n5\n\n10\n\n15\n\n20\n\n10\n\nz (km)\n\n8\n\nd=100 m\nn=1\nn=1.0003\nn=n(z)\nNe(z)\n\n6\n\n4\n\n2\n\nt\n\nc\n\nc\n\nt\n\nn=n(z)\n\nn=1.0003\n\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nt (ns)\nFIG. 1: The emission height z = −c t0 as function of the\nobserver time t for three different values of the index of refraction. The dashed line gives the shower-profile as function\nof z for a E = 5 × 1017 eV proton-induced shower.\n\nIn Fig. 1 the emission height, z = −c t0 , is plotted as\na function of the observer time t for an observer 100 m\nfrom the shower axis for three choices for the index of\nrefraction n. For the case n = 1 the plot of the retarded\ntime (red drawn curve) shows that the retarded time is a\nsingle valued function and that the earliest signals come\nfrom the top of the shower. For an index of refraction deviating from unity (n = 1.0003, n = n(z)) the function is\ncomposed out of several branches (dashed-magenta and\ndotted-blue curves in Fig. 1) limited by the critical times\nt = tc , where the derivative dt0 /dt becomes infinite. In [9]\nit was already shown that a singularity in this derivative\nis related to a singularity in our vector potential since\nD = R/(dt0 /dt). This singularity (the branch point)\n\nis well known and corresponds to Cherenkov emission.\nSince the critical time is the time the Cherenkov radiation is seen by the observer, it is henceforth called the\nCherenkov time. In the case of a constant and finite refractivity N = n − 1 the Cherenkov time tc is given as,\np\n(4)\nctc = d (n2 − 1) ,\nwith corresponding retarded time −t0c = tc /(n2 −1). The\nretarded time can readily be converted into an emission\nheight zc = −c t0c and it can be seen that the expressions are consistent with the expression of the angle for\nCherenkov emission, cos θc = 1/n. For the general case\nit has to be calculated numerically.\nTo calculate the realistic pulse form for n 6= 1 it is\nessential to include the fact that the emitting plasma\ncloud has a finite size,\nZ\nZ\n~\nAμw (t, ~x) = d2~r dh ρ(h, ~r) AμP L (t, ~x − ξ)\n(5)\nwhere ~r = r1~ex + r2~ey is the relative transverse coordinate to the shower axis and the source is at the position\n~ 0 , h, ri ) = (−c t0 + h) ~ez + ~r. The density profile is\nξ(t\nparameterized as [12, 13]\nw(r, h) = 2πrρ(h, ~r) = N (r + r0 )−3.5 h e−2h/L\n\n(6)\n\nat a fixed shower time t0 and where h is the longitudinal\ndistance from the shower front that, by definition, moves\nwith the vacuum speed of light c.R The\nR normalization\nconstant, N , is chosen such that dr dh w(r, h) = 1.\nPositive values of h mean a position behind the shower\nfront, hence w is zero for values of h < 0. The parameters\nare taken as r0 = 80 m, L = 0.5 m following the results of\nsimulations using the cascade mode of the CONEX-MCGEO shower simulation and analysis package [9]. The results of these simulations indicate that the pancake thickness parameter L has to be considerably smaller than\nthe value of L = 3.9 m used in previous calculations [7].\nRetaining the terms pertinent to geomagnetic radiation\nand using partial integration to have the derivatives in\nEq. (5) operate on the density distribution exclusively,\nthe electromagnetic field can be expressed as\n\u0012\n\u0013\nZ\nZ\n1\n∂w i\n∂J i\nμ0 c\nd2~r dh\nJP L + w P0L . (7)\nEi = −\n4π\n|D| ∂h\n∂t\nThe complication in Eq. (7) is now reduced to the integration of inverse square-root divergencies over smoothly\nvarying functions giving finite results. We will argue later\nthat the first term is important for Cherenkov radiation\nwhile the second is dominant for n = 1.\nTo get a better appreciation of the structure of the\npulse and the influence of the index of refraction we will\ndiscuss in some detail the results for an observer at a distance d = 100 m from a shower with E = 5×1017 eV at an\nangle θ = 27◦ . To simplify the discussion we will -for the\n\n\f3\npanel of Fig. 3 gives the complete geomagnetic result and\nshould be compared with Fig. 2. The differences between\nthe three different choices for the index of refraction have\ndiminished, instead of being three times as large the pulse\nheight is increased by a factor two only.\n\n40\n20\n\n-20\n-40\n-60\n\nd=100 m\nn=1\nn=1.0003\nn=n(z)\n\n-100\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\n30\n\n20\n\n20\n\n0\n\n10\n\n-20\n\n20\n\nt(ns)\n\nE(mV/m)\n\n-80\n\n40\n\n0\n\nE(mV/m)\n\nE(mV/m)\n\n0\n\n-40\n-60\n-80\n\n-120\n\nd=50 m\nn=1\nn=1.0003\nn=n(z)\n\n-40\n-50\n\n-140\n\n-60\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n0\n\n10\n\n2\n\n4\n\n6\n\n10\n\n0.1\n\n5\n\n0.05\n\n10\n\n12\n\n14\n\n0.0\n\n-5\n\nE(mV/m)\n\nE(mV/m)\n\n8\n\nt(ns)\n\nt(ns)\n\n0\n\ntime being- ignore the radial extent of the charge cloud.\nEssential for the structure of the pulse is the longitudinal\nshower profile Ne (z), as shown by the thinly-dotted black\ncurve in Fig. 1.\nFor the case that n = 1 the denominator D is a\nsmoothly changing function over the integration regime\nand the dominant contribution is derived from the last\nterm in Eq. (7). Since the derivative of the shower profile reaches a maximum at z = 6 km it can be seen from\nFig. 1 that the peak of the pulse occurs at t ≈ 3 ns which\nagrees with the result in Fig. 2. The integral of the first\nterm, being a derivative, almost vanishes.\nFor the cases that n 6= 1 the reasoning is rather different. The denominator D vanishes at the Cherenkov time,\nindicated by the vertical arrows in Fig. 1, and thus 1/D\nvaries strongly as function of h. The contribution from\nthe first term in the integral Eq. (7) is large (in contrast\nto the case n = 1) and results in an enhanced contribution from the corresponding emission height. The pulse\nheight will thus be proportional to Ne (zc ) while the peak\nis observed a little after tc in agreement with the results shown in Fig. 2. Since J ⊥ (t0c ) ∝ Ne (zc ) is large for\nd = 100 m this results in a strong pulse. The remaining\ncontributions in the integral are of secondary importance\nin this case.\nIn reality the refractivity is equal to N (0) = 3 × 10−4\nat ground level and decreases exponentially with height,\nN (z) = n(z) − 1. The values of the retarded time thus\nlie in between those obtained with n = 1 and n = 1.0003\nand are shown as the dotted-blue curve in Fig. 1. Also\nfor this case there is a clear Cherenkov time which is\nslightly smaller than that for n = 1.0003 resulting is a\nvery similar pulse as for the case of a fixed-finite n.\nThe main effect of including the radial extent of the\nshower is to smooth the time structure of the pulse and\nthus to wash-out some of the effects of n 6= 1. The third\n\n-20\n-30\n\nd=20 m\nn=1\nn=1.0003\nn=n(z)\n\n-100\n\nFIG. 2: Pulse due to geomagnetic radiation at d = 100 m\nfrom the core for different values of the index of refraction as\ndiscussed in the text, n = 1, n = 1.0003 fixed, and n = n(z)\nrealistic. In this calculation the lateral extent of the shower\nis ignored.\n\n-10\n\n-10\n-15\n\n-25\n\n-0.1\n-0.15\n\nd=100 m\nn=1\nn=1.0003\nn=n(z)\n\n-20\n\n-0.05\n\nd=400 m\nn=1\nn=1.0003\nn=n(z)\n\n-0.2\n\n-30\n\n-0.25\n0\n\n4\n\n8\n\n12\n\nt(ns)\n\n16\n\n20\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\nt(ns)\n\nFIG. 3: Pulse due to geomagnetic radiation at at several distances from the core for different values of the index of refraction as discussed in the text (n = 1, n = 1.0003 fixed, and\nn = n(z) realistic), including the lateral extent of the shower.\n\nThe Cherenkov effect is strongly distance dependent as\nshown in Fig. 3. As expressed in the discussion following Eq. (4) emission at the Cherenkov angle cos θc = 1/n\nrelates a distance d from the shower core to a particular\nemission height. For an observer close to the shower,\nd = 20 m, this Cherenkov height lies well below the\nshower maximum where Ne (z) has fallen considerably\nand the intensity of the emitted radiation is low. It\nincreases with increasing distance to reach a maximum\naround d = 100 m where the Cherenkov point lies at the\nheight of the shower maximum. At even larger distances\nthe Cherenkov point lies above the shower maximum and\nthe amplitude decreases rapidly. The position of the\nCherenkov maximum thus reflects the shower maximum\nand is thus sensitive for the composition of the cosmic\nray. For n = 1 the main strength of the pulse is emitted\nat the height where the derivative of the shower profile\nis large. Since the retarded distance, |D|, corresponding to this height in the shower evolution increases for\nobservers further away from the shower core, the amplitude of the pulse is a monotonically decreasing function\nwith distance.\nCalculations confirm that for charge-excess radiation\n\n\f4\n(not reported here) the effect of the index of refraction is\nvery similar as for geomagnetic radiation where there are\nsubtle differences due to the somewhat different weighting over shower height. For the chosen geometry the geomagnetic effect is however dominant. This shows that\nthe Cherenkov effect applies equally to radiation from a\nmoving charge, to which it is usually applied, as to that\nfrom a moving electric current, which is at the focus here.\nEXPERIMENTAL VERIFICATION\n\nThe polarization of the radio signal, which distinguishes geomagnetic and charge-excess radiation, is not\naffected by the Cherenkov effect. The principal signature of the Cherenkov effect is that the pulse at a certain distance, 100 m for the present example, is considerably larger than it would have been for the case that\nn = 1. This feature is especially clear from Fig. 4 where\nthe height of the pulse is plotted at various distances from\nthe core. At short distances the pulse height diverges for\nthe case of n = 1 where it should be noted that this divergence is strongly dependent on the pancake thickness\nparameter L, smaller values give a stronger divergence at\nd = 0. Apart from an overall scaling factor the picture\nis not affected by L for d & 50 m. For the realistic case\nwhere n 6= 1 a marked deviation is predicted with a clear\nenhancement in peak intensity at distances ranging from\n50 till about 100 m from the core. This peak results from\nthe fact that the Cherenkov point lies close to the shower\nmaximum for d =100 m.\n2\n\nEmax(mV/m)\n\n10\n\nd=100 m\nn=1\nn=1.0003\nn=n(z)\n\n2\n\n5\n\n2\n\n10\n5\n\n20\n\n40\n\n60\n\n80 100 120 140 160 180 200\n\nd(m)\n\nFIG. 4: Pulse height as function of distance to the shower core\nfor the three choices for the index of refraction as discussed\nin the text (n = 1, n = 1.0003 fixed, and n = n(z) realistic).\n\nThe feature shown in Fig. 4, an increase of the amplitude of the geomagnetic radiation with distance for n 6= 1\ninstead of the monotonic decrease predicted for n = 1,\nremains for showers at a large angle with the vertical.\nFor these inclined showers the shower maximum will occur at a larger values of z, the distance to the point of\nimpact on Earth, and the maximum in the intensity will\nthus be observed at larger distances from the shower core,\nconsistent with the angle for Cherenkov emission.\n\nSome hints of this effect may have been seen in recent results from the LOPES [14] collaboration showing that for certain events the pulse height follows the\ntrend shown by the dotted-blue line in Fig. 4. More detailed measurements are necessary where full attention is\ngiven to polarization observables which are crucial to distinguish geomagnetic and charge-excess radiation. Such\nmeasurements are planned for new and renovated setups at LOPES, CODALEMA [15], and recently also new\nset-ups at the Pierre Auger Observatory (MAXIMA [16],\nAERA [17]), and LOFAR [18].\n\nACKNOWLEDGMENTS\n\nThis work is part of the research program of the 'Stichting voor Fundamenteel Onderzoek der Materie (FOM)',\nwhich is financially supported by the 'Nederlandse Organisatie voor Wetenschappelijk Onderzoek (NWO)'.\n\n[1] O. Scholten, K. Werner, and F. Rusydi, Astropart. Phys. 29, 94 (2008).\n[2] T.\nHuege\net al.,\nproceedings\nof\nARENA\n2010, Nucl. Instr. and Meth. A (in print);\ndoi:10.1016/j.nima.2010.11.041 .\n[3] M. Ludwig and T. Huege, proceedings of ARENA\n2010, Nucl. Instr. and Meth. A (in print);\ndoi:10.1016/j.nima.2010.10.115 .\n[4] O. Scholten and K. Werner, Nucl. Instr. and Meth. A\n604, S24 (2009).\n[5] F.D. Kahn and I.Lerche, Proc. Royal Soc. London A289,\n206 (1966).\n[6] H. Falcke et al.[LOPES], Nature 435, 313 (2005).\n[7] K.D. de Vries, et al., Astropart. Phys. 34, 267 (2010).\n[8] H. Schoorlemmer et al.[Pierre Auger Coll.], proceedings\nof ARENA 2010, Nucl. Instr. and Meth. A (in print);\ndoi:10.1016/j.nima.2010.11.145\n[9] K. Werner and O. Scholten, Astropart. Phys. 29, 393\n(2008).\n[10] N.N. Kalmykov, A.A. Konstantinov, and R. Engel,\nNucl. Phys. B 151, 347 (2006); Phys. of At. Nuclei, 73,\n1191 (2010).\n[11] J.D. Jackson, Classical Electrodynamics, Wiley, New\nYork, 1999.\n[12] G. Agnetta et al., Astropart. Phys. 6, 301 (2003)\n[13] T. Huege, H. Falcke, Astronomy & Astrophysics 412, 19\n(2003).\n[14] W.D. Apel et al.[LOPES], Astropart. Phys. 32, 294\n(2010).\n[15] D. Ardouin et al.[CODALEMA], Astropart. Phys. 31,\n192 (2009).\n[16] J. Coppens et al.[Pierre Auger Coll.], Nucl. Instr. and\nMeth. A 604, S41 (2009).\n[17] S. Fliescher et al.[Pierre Auger Coll.], Contribution to the\n2010 ARENA conference, Nucl. Instr. and Meth. A (in\nprint); http://dx.doi.org/10.1016/j.nima.2010.11.045 .\n[18] A.\nHorneffer\net al.[LOFAR\nCR-KSP],\nNucl. Inst. Meth. A617, 482 (2010).\n\n\f"}