{"id": "http://arxiv.org/abs/0811.1478v1", "guidislink": true, "updated": "2008-11-10T14:26:07Z", "updated_parsed": [2008, 11, 10, 14, 26, 7, 0, 315, 0], "published": "2008-11-10T14:26:07Z", "published_parsed": [2008, 11, 10, 14, 26, 7, 0, 315, 0], "title": "General Relativistic Rotation Curves in a Post-Newtonian Light", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.1060%2C0811.3788%2C0811.1278%2C0811.1827%2C0811.1035%2C0811.0287%2C0811.0301%2C0811.0022%2C0811.4174%2C0811.1839%2C0811.2167%2C0811.0321%2C0811.3494%2C0811.3705%2C0811.3034%2C0811.2487%2C0811.0325%2C0811.2934%2C0811.3472%2C0811.2842%2C0811.1478%2C0811.4768%2C0811.2768%2C0811.4468%2C0811.2335%2C0811.3674%2C0811.0094%2C0811.0674%2C0811.3872%2C0811.0424%2C0811.4335%2C0811.3084%2C0811.4667%2C0811.4746%2C0811.2988%2C0811.3256%2C0811.2845%2C0811.0594%2C0811.4540%2C0811.0834%2C0811.3663%2C0811.3490%2C0811.1540%2C0811.0926%2C0811.3719%2C0811.3219%2C0811.1007%2C0811.1377%2C0811.1276%2C0811.4368%2C0811.1189%2C0811.1188%2C0811.1799%2C0811.1031%2C0811.0519%2C0811.3471%2C0811.0838%2C0811.4453%2C0811.2323%2C0811.2016%2C0811.3662%2C0811.1940%2C0811.1233%2C0811.0888%2C0811.1678%2C0811.2434%2C0811.2227%2C0811.1887%2C0811.1079%2C0811.0962%2C0811.3829%2C0811.4704%2C0811.3573%2C0811.1527%2C0811.2510%2C0811.4301%2C0811.1953%2C0811.1101%2C0811.0958%2C0811.2802%2C0811.1709%2C0811.2903%2C0811.1767%2C0811.0256%2C0811.3698%2C0811.1988%2C0811.1148%2C0811.3086%2C0811.1370%2C0811.0944%2C0811.3915%2C0811.0442%2C0811.1843%2C0811.3121%2C1111.0818%2C1111.5883%2C1111.0886%2C1111.3359%2C1111.2768%2C1111.6539%2C1111.6857&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "General Relativistic Rotation Curves in a Post-Newtonian Light"}, "summary": "The missing of a Keplerian fall-off in the observed galaxy rotation curves\nrepresents classical evidence for the existence of dark matter on galactic\nscales. There has been some recent activity concerning the potential of\nmodelling galactic systems with the help of general relativity. This was\nmotivated by claims that by the use of full general relativity dark matter\ncould be made superfluous. Here we focus on possible axisymmetric and\nstationary solutions of Einstein's equations with rotating dust. After a short\nreview of the current debate we pursue the idea of approaching such\nrelativistic models in a Newtonian language. We analyse rigidly as well as\ndifferentially rotating Newtonian and Post-Newtonian spacetimes and find that\nit is necessary to incorporate a Post-Newtonian term in order to make physical\nsense.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.1060%2C0811.3788%2C0811.1278%2C0811.1827%2C0811.1035%2C0811.0287%2C0811.0301%2C0811.0022%2C0811.4174%2C0811.1839%2C0811.2167%2C0811.0321%2C0811.3494%2C0811.3705%2C0811.3034%2C0811.2487%2C0811.0325%2C0811.2934%2C0811.3472%2C0811.2842%2C0811.1478%2C0811.4768%2C0811.2768%2C0811.4468%2C0811.2335%2C0811.3674%2C0811.0094%2C0811.0674%2C0811.3872%2C0811.0424%2C0811.4335%2C0811.3084%2C0811.4667%2C0811.4746%2C0811.2988%2C0811.3256%2C0811.2845%2C0811.0594%2C0811.4540%2C0811.0834%2C0811.3663%2C0811.3490%2C0811.1540%2C0811.0926%2C0811.3719%2C0811.3219%2C0811.1007%2C0811.1377%2C0811.1276%2C0811.4368%2C0811.1189%2C0811.1188%2C0811.1799%2C0811.1031%2C0811.0519%2C0811.3471%2C0811.0838%2C0811.4453%2C0811.2323%2C0811.2016%2C0811.3662%2C0811.1940%2C0811.1233%2C0811.0888%2C0811.1678%2C0811.2434%2C0811.2227%2C0811.1887%2C0811.1079%2C0811.0962%2C0811.3829%2C0811.4704%2C0811.3573%2C0811.1527%2C0811.2510%2C0811.4301%2C0811.1953%2C0811.1101%2C0811.0958%2C0811.2802%2C0811.1709%2C0811.2903%2C0811.1767%2C0811.0256%2C0811.3698%2C0811.1988%2C0811.1148%2C0811.3086%2C0811.1370%2C0811.0944%2C0811.3915%2C0811.0442%2C0811.1843%2C0811.3121%2C1111.0818%2C1111.5883%2C1111.0886%2C1111.3359%2C1111.2768%2C1111.6539%2C1111.6857&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The missing of a Keplerian fall-off in the observed galaxy rotation curves\nrepresents classical evidence for the existence of dark matter on galactic\nscales. There has been some recent activity concerning the potential of\nmodelling galactic systems with the help of general relativity. This was\nmotivated by claims that by the use of full general relativity dark matter\ncould be made superfluous. Here we focus on possible axisymmetric and\nstationary solutions of Einstein's equations with rotating dust. After a short\nreview of the current debate we pursue the idea of approaching such\nrelativistic models in a Newtonian language. We analyse rigidly as well as\ndifferentially rotating Newtonian and Post-Newtonian spacetimes and find that\nit is necessary to incorporate a Post-Newtonian term in order to make physical\nsense."}, "authors": ["Aleksandar Rakic", "Dominik J. Schwarz"], "author_detail": {"name": "Dominik J. Schwarz"}, "author": "Dominik J. Schwarz", "arxiv_comment": "5 pages PoS style, no figures, talk given at the Identification of\n  Dark Matter conference (idm2008) Stockholm, 18-22 August 2008", "links": [{"href": "http://arxiv.org/abs/0811.1478v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.1478v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.1478v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.1478v1", "journal_reference": "PoS idm2008:096,2008", "doi": null, "fulltext": "arXiv:0811.1478v1 [gr-qc] 10 Nov 2008\n\nGeneral Relativistic Rotation Curves in a\nPost-Newtonian Light\n\nAleksandar Rakić∗\nInstitut für Theoretische Physik und Astrophysik, Universität Würzburg, D-97074 Würzburg,\nGermany\nE-mail: rakic_at_astro.uni-wuerzburg.de\n\nDominik J. Schwarz\nFakultät für Physik, Universität Bielefeld, D-33501 Bielefeld, Germany\nE-mail: dschwarz_at_physik.uni-bielefeld.de\nThe missing of a Keplerian fall-off in the observed galaxy rotation curves represents classical\nevidence for the existence of dark matter on galactic scales. There has been some recent activity\nconcerning the potential of modelling galactic systems with the help of general relativity. This\nwas motivated by claims that by the use of full general relativity dark matter could be made superfluous. Here we focus on possible axisymmetric and stationary solutions of Einstein's equations\nwith rotating dust. After a short review of the current debate we pursue the idea of approaching\nsuch relativistic models in a Newtonian language. We analyse rigidly as well as differentially\nrotating Newtonian and Post-Newtonian spacetimes and find that it is necessary to incorporate a\nPost-Newtonian term in order to make physical sense.\n\nIdentification of dark matter 2008\nAugust 18-22, 2008\nStockholm, Sweden\n∗ Speaker.\n\nc Copyright owned by the author(s) under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike Licence.\n\nhttp://pos.sissa.it/\n\n\fGeneral Relativistic Rotation Curves in a Post-Newtonian Light\n\nAleksandar Rakić\n\n1. Motivation\nThe evidence for dark matter stems from various observations at various scales but it is not\nnecessary that the effects have all the same origin. This paper is motivated by the galactic dark\nmatter problem: in contrast1 to the expectation from Newtonian dynamics the tangential velocities\nof spirals are found to be approximately flat and not decreasing up to large radii.\nThe standard resolution lies in postulating a large halo of dark matter around galaxies. In\ncontrast to this Cooperstock and Tieu (CT) recently suggested that the proper modelling of a galaxy\nthrough full general relativity (GR) explains the findings without dark matter [2]. Their galaxy\nmodel is a stationary axisymmetric (comoving dust) solution based upon the following metric\n\u0001\nds2 = eν −w dr2 + dz2 + r2 e−w dφ 2 − ew (dt + Ndφ )2 .\n\n(1.1)\n\nEven though fields and velocities in the galaxy are small, according to CT, the Newtonian approximation would not be valid for a galactic system that is under the influence of gravity alone because\nof intrinsic non-linear contributions of non-negligible size from GR. The GR model would then\nbe able to reproduce realistic density profiles after fitting flat rotation curves. The according total\ngalactic mass comes out of modest value, c.f. [2], that is smaller than the newtonianly required\nvalue and larger than values from Modified Newtonian Dynamics (MOND).\nBy now various authors have pointed to problems with the consistency of the CT model. In [3]\nthe Komar mass within the CT model is analysed and it is found that the energy momentum tensor\nbecomes ill-behaved at z = 0, revealing the existence of an additional exotic matter source. Thus, in\nthe CT model, the location of exotic matter would only be transfered to the galactic plane, a finding\nalso supported in [4]. In [5] it is argued that Post-Newtonian corrections should already enfold\nnon-linear effects if they are present and that corrections should intrinsically be small in the weak\nfield limit. In [6] an inconsistency between the CT comoving frame and the condition of differential\nrotation is revealed; if the inconsistency is removed the rotation curve became ordinarily Keplerian.\nIt is argued in [7] that the CT model gives wrong predictions for the lateral density profile of the\nMilky Way and for its local density. On the other hand, in [8] it is found that the CT model seems\nto hide infinite mass at large distances. Generally it is shown in [9] that interior stationary and\naxisymmetric solutions - like CT - cannot be continued into according exterior solutions in order\nto become global solutions without evoking singularities.\nIt is interesting to note that viable disk models for galactic systems with differential rotation do\nnot exist in GR by now. For the case of rigid rotation [10] an exact solution is known which has been\nobtained via the inverse scattering method; already its formulation is technically rather elaborate.\nThough problematic, the CT hypothesis has initiated further alternative ideas on galactic rotation\ncurves. Using a similar GR model in [11] it is found that the amount of dark matter needed is\nreduced by 30%. In [12] an axisymmetric disk solution of the Einstein equations in six dimensions\nis constructed. The modification of gravity via extra dimensions then leads to flat rotation curves if\norbits within the disk are stable.\nHere we want to compare the CT model with a rotating (Post-) Newtonian model. For this we\nfirst have to ask some general questions on axially symmetric and stationary solutions in GR.\n1 In\n\nNewtonian gravity a flat rotation curve is possible, see Mestel's disk [1]. But the price is an infinite total mass.\n\n2\n\n\fGeneral Relativistic Rotation Curves in a Post-Newtonian Light\n\nAleksandar Rakić\n\n2. Rotating (Post-) Newtonian Spacetimes\nIn notation (x0 , x1 , x2 , x3 ) = (t, r, φ , z) and signature (−, +, +, +) the most general axisymmetric (∂φ gμν = 0) and stationary (∂t gμν = 0) spacetime in GR with the four free metric functions\nU (r, z), k(r, z),W (r, z), A(r, z) is named after Lewis and Papapetrou (LP) and reads [13]\nh\ni\nds2 = e−2U e2k (dr2 + dz2 ) +W 2 dφ 2 − e2U (dt + Adφ )2 .\n(2.1)\nWe can simplify (2.1) a bit more, but only under crucial assumptions. If and only if the metric\nfunction W is harmonic it can be transformed to W = r . Consider a complex coordinate transformation f (r + iz) = W + iV introducing an additional potential V . Then we have from ρ ≡ W (r, z)\nand h ≡ V (r, z) the differentials dρ = ∂∂Wr dr + ∂∂Wz dz and dh = ∂∂Vr dr + ∂∂Vz dz . After inserting into\n(2.1), written in terms of ρ , h , and requiring formal invariance as compared to the original metric\nwe see that the mixing terms have to vanish. That is exactly provided by the Cauchy-Riemann\nequations for W and V : ∂∂Wr = ∂∂Vz and ∂∂Wz = − ∂∂Vr . Moreover, with the help of these equations, we\nsee that the coefficients of dr2 and dz2 can be combined and so we reobtain (2.1).\nThus we have shown that it is possible to simplify the general LP form (2.1) by allowing\nW = r , which is only possible if W (and V ) be harmonic2 : ∆(2)W = 0 . Upon this constraint we can\nwrite down the LP metric in isotropic coordinates (or Weyl gauge)\ni\nh\n(2.2)\nds2 = e−2U e2k (dr2 + dz2 ) + r2 dφ 2 − e2U (dt + Adφ )2 .\nThe spacetime applied in the CT model was (1.1). Obviously, the CT metric does not belong to the\nclass of the most general stationary and axisymmetric spacetimes; it only belongs to the subclass\nof LP solutions in the Weyl gauge, and is therefore less general.\nNow we ask what solution could potentially be a Newtonian counterpart to the CT model (1.1).\nThe 'Newtonian approximation'[14] that is the metric that reproduces Newtonian physics is\nds2 = −(1 + 2φ )dt 2 + dr2 + r2 dφ 2 + dz2 ,\n\n(2.3)\n\nwhere φ = φ (r, z) is the Newtonian gravitational potential. For simplicity, we start with rigid\nrotation in (2.3) via φ = φ ′ − ω t and ω =const. The exact result can be brought to the form\n\u00152\n\u0014\nr2 ω\n1 + 2φ\n2\n2\n2 2\nφ\nφ\n−\nω\nφ\nr\nd\nd\n. (2.4)\n−\n(1\n+\n2\nr\n)\ndt\n+\nds2 = (dr2 + dz2 ) +\n(1 + 2φ − ω 2 r2 )\n(1 + 2φ − ω 2 r2 )\nIn this form we can directly compare it with the LP metric in Weyl gauge (2.2), and we notice a\ndiscrepancy at linear order in φ , looking at the dφ 2 term. Interestingly, the rigidly rotated Newton\nmetric (2.4) is not consistent with the Weyl subclass of the LP solution (2.2).\nOne could now ask whether the situation might be easily cured with the help of a coordinate\ntransformation. We show that this is not possible. Above we have derived the exact conditions\nunder which the general and the isotropic LP metric can be transformed into each other, that is the\nfunction W must fulfil the two-dimensional Laplace equation ∆(2)W = 0 . In the case of (2.4) we\n√\nidentify W = r 1 + 2φ . Expanding to linear order and applying the Laplacian yields\n∆(2)W = r∆(3) φ + φ,r = 4π Gρ r + φ,r\n2 This\n\n(2.5)\n\ncondition for W holds for exterior (vacuum) solutions that are stationary and axisymmetric, c.f. [15, 16].\n\n3\n\n\fGeneral Relativistic Rotation Curves in a Post-Newtonian Light\n\nAleksandar Rakić\n\nafter using the Poisson equation. We will now show that ∆(2)W does not vanish in general.\nGiven the problem of solving the Laplace equation with boundary conditions for a disk-like\ndistribution of matter, the solution for the potential can be obtained [17] via separation of variables:\nR\nφ (r, z) = 0∞ S(k)J0 (kr)e−k|z| dk . A surface mass density Σ(r) is then characterised by its Hankel\nR\ntransform S(k) = −2π G 0∞ J0 (kr)Σ(r)rdr . We use these expressions for the evaluation of (2.5).\nCase (I) z 6= 0 . Outside the disk the Newtonian potential fulfils the Laplace equation, such that\nR\n(2.5) becomes ∆(2)W = − 0∞ S(k)J1 (kr)ke−k|z| dk which will not vanish in general. We demonstrate\nthis e.g. with the Mestel model [1] which is characterised by a surface mass density that falls off\ninversely with the distance Σ(r) = Σ0 r0 /r and Hankel-transforms\n\u0010\n\u0011 as S(k) = −2π GΣ0 r0 /k. Using\n|z|\n1\n(2)\nthis we can integrate and obtain ∆ W = 2π GΣ0 r0 r − r√r2 +z2 at z 6= 0 .\nCase (II) z = 0 . We want to show that (2.5) is non-zero also here. Let us assume the contrary\nand see what happens. If we assume that ∆(2)W = 0 was true then equation (2.5) gives an identity.\nThis we integrate over z for some ε > 0 and then revoke the operation with the appropriate limit,\nR\nR R\n−4π Gr limε →0 −ε ε δ (z)Σ(r)dz = limε →0 −ε ε 0∞ S(k)J1 (kr)ke−k|z| dkdz . Since the exponential term\non the right hand side serves as a damping factor, the modulus of the integrand will reach its\nmaximum at z = 0. Thus, as an upper estimate, we can set the integrand of the right hand side to be\nconstant in z and therefore the integration and limit procedure give zero. Then, for all other z the\nexpression will be zero more than ever and we have 4π GΣ(r)r = 0 : this will not hold generally for\nany realistic model, and thus ∆(2)W (r, z) = 0 is not true at the surface z = 0 either.\nNotably, the classical Newton metric (2.3) cannot be made compatible with the LP metric in\nWeyl form and is thus also not compatible with the CT model. Additionally, as all stationary and\naxisymmetric vacuum solutions belong to the Weyl class [16], it follows that such a galaxy does not\nhave a rotating classically Newtonian exterior solution. We go one step further and consider the\nPost-Newtonian3 (PN) metric with an additional PN potential ψ = ψ (r, z) ,\nds2 = −(1 + 2φ )dt 2 + (1 − 2ψ )(dr2 + r2 dφ 2 + dz2 ) .\n\n(2.6)\n\nTo include one more complication we consider the differential rotation of this metric via ω =\nω (r, z) and arrive at a lengthy expression. Unfortunately, the resulting metric exhibits direct time\ndependence in some coefficients and is therefore only reasonable in a strictly local sense. To\npreserve stationarity we approximate it by allowing for only small time intervals or equivalently\nfor small angles of rotation. We find that for the simplest PN case, i.e. φ = ψ , the differentially\n(and the rigidly) rotated metric is consistent - neglecting terms O(φ 2 ) - with the Weyl form (2.2).\n\n3. Summary and Conclusion\nUp to day, there does not exist an intuitive and applicable GR solution which could help to\nrealistically model a galactic system - except for the complicated solution [10] with stiff rotation.\nCT have proposed a solution but as we have seen arguments from various directions have revealed\nthis metric with ψ = φ is referred to as the 'Newton metric' in the literature. The reason for this\nnomenclature might be that the order of magnitude of the coefficient of the spatial part and the order of the Newtonian\ncorrection are the same. However, conceptually this makes a considerable difference. In classical Newton Gravity there\nexists no curvature of space, the three-space is always euclidian. This is exactly reflected in the Newton metric (2.3) and\ntherefore we refer to (2.6) as the PN approximation; for an extensive discussion see e.g. chp. 39 of [14].\n3 Sometimes,\n\n4\n\n\fGeneral Relativistic Rotation Curves in a Post-Newtonian Light\n\nAleksandar Rakić\n\nunphysical features in the model. We have shown that the CT solution does not belong to the class\nof the most general axially symmetric and stationary solutions, the LP class. Therefore the CT\nsolution is less general and this restriction might be connected with the problems of the model.\nA more intuitive understanding of the CT model and its breakdown would be instructive.\nFor this we approached the CT model by Newtonian means. We found the interesting result that\nthe classical Newton metric after rotation does not lie in the same class as the CT metric but is\nmore general and cannot be simplified. Only the incorporation of a PN potential gives rise - after\ndifferential or rigid rotation - to equivalent metrics. Thus the proper weak field limit of such a\ngalaxy must be Post-Newtonian. A complete analysis of the resulting dynamics via the ArnowittDeser-Misner formalism is the concluding step and is going to be published elsewhere.\n\nReferences\n[1] L. Mestel, On the galactic law of rotation, Mon. Not. Roy. Astron. Soc. 126 (1963) 553.\n[2] F. I. Cooperstock & S. Tieu, General relativity resolves galactic rotation without exotic dark matter,\n[astro-ph/0507619]; Galactic Dynamics via General Relativity: A Compilation and New\nDevelopments, [astro-ph/0610370]; Galactic dynamics via general relativity and the exotic\ndark matter enigma, Mod. Phys. Lett. A21 (2006) 2133 [astro-ph/0610370].\n[3] M. Korzyński, Singular disk of matter in the Cooperstock and Tieu galaxy model,\n[astro-ph/0508377].\n[4] D. Vogt & P. S. Letelier, Presence of exotic matter in the cooperstock and tieu galaxy model,\n[astro-ph/0510750].\n[5] D. Garfinkle, The need for dark matter in galaxies, Class. Quant. Grav. 23 (2006) 1391\n[gr-qc/0511082].\n[6] D. J. Cross, Comments on the Cooperstock-Tieu Galaxy Model, [astro-ph/0601191].\n[7] B. Fuchs and S. Phleps, Comment on 'General relativity resolves galactic rotation without exotic dark\nmatter', New Astron. 11 (2006) 608 [astro-ph/0604022].\n[8] D. Menzies and G. J. Mathews, General relativistic galaxy rotation curves: Implications for dark\nmatter distribution, [gr-qc/0604092].\n[9] T. Zingg, A. Aste and D. Trautmann, Just dust : About the (in)applicability of rotating dust solutions\nas realistic galaxy models, Adv. Stud. Theor. Phys. 1 (2007) 409 [astro-ph/0608299].\n[10] G. Neugebauer and R. Meinel, General relativistic gravitational field of a rigidly rotating disk of dust:\nSolution in terms of ultraelliptic functions, Phys. Rev. Lett. 75 (1995) 3046 [gr-qc/0302060].\n[11] H. Balasin and D. Grumiller, Significant reduction of galactic dark matter by general relativity,\nInt. J. Mod. Phys. D 17 (2008) 475 [astro-ph/0602519].\n[12] C. H. Coimbra-Araujo and P. S. Letelier, Thin disk in higher dimensional space-time and dark matter\ninterpretation, Phys. Rev. D 76 (2007) 043522.\n[13] H. Stephani et al., Exact solutions of Einstein's field equations, Cambridge Univ. Pr. 2003.\n[14] C. W. Misner, K. S. Thorne and J. A. Wheeler, Gravitation, Palgrave Macmillan 1973.\n[15] J. N. Islam, Rotating Fields in General Relativity, Cambridge Univ. Pr. 1985.\n[16] R. M. Wald, General Relativity, Chicago Univ. Pr. 1984.\n[17] J. Binney & S. Tremaine, Galactic Dynamics, Princeton Univ. Pr. 1994.\n\n5\n\n\f"}