{"id": "http://arxiv.org/abs/1004.5096v1", "guidislink": true, "updated": "2010-04-28T18:02:29Z", "updated_parsed": [2010, 4, 28, 18, 2, 29, 2, 118, 0], "published": "2010-04-28T18:02:29Z", "published_parsed": [2010, 4, 28, 18, 2, 29, 2, 118, 0], "title": "Observation of cooperative Mie scattering from an ultracold atomic cloud", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.2411%2C1004.0909%2C1004.2831%2C1004.4889%2C1004.4140%2C1004.5596%2C1004.1780%2C1004.0627%2C1004.3638%2C1004.5348%2C1004.3809%2C1004.1854%2C1004.2625%2C1004.1310%2C1004.4420%2C1004.0831%2C1004.3735%2C1004.0497%2C1004.1604%2C1004.4347%2C1004.2535%2C1004.4994%2C1004.0556%2C1004.1796%2C1004.1279%2C1004.2815%2C1004.1449%2C1004.0021%2C1004.1599%2C1004.4653%2C1004.3341%2C1004.5321%2C1004.1225%2C1004.2316%2C1004.1953%2C1004.3204%2C1004.4346%2C1004.1756%2C1004.0590%2C1004.1437%2C1004.0143%2C1004.3786%2C1004.2211%2C1004.5259%2C1004.5143%2C1004.3300%2C1004.2267%2C1004.5335%2C1004.0379%2C1004.2701%2C1004.2325%2C1004.5059%2C1004.4576%2C1004.1870%2C1004.1277%2C1004.4675%2C1004.4248%2C1004.5439%2C1004.5482%2C1004.1190%2C1004.3721%2C1004.4326%2C1004.5096%2C1004.1773%2C1004.5176%2C1004.5489%2C1004.1187%2C1004.2690%2C1004.5384%2C1004.0613%2C1004.2562%2C1004.1830%2C1004.1486%2C1004.3546%2C1004.0712%2C1004.0352%2C1004.1681%2C1004.2833%2C1004.5173%2C1004.3379%2C1004.1631%2C1004.4847%2C1004.1324%2C1004.4470%2C1004.1458%2C1004.5330%2C1004.1266%2C1004.3602%2C1004.5031%2C1004.1300%2C1004.0406%2C1004.1584%2C1004.2714%2C1004.0511%2C1004.5473%2C1004.4018%2C1004.3887%2C1004.1289%2C1004.1204%2C1004.2226%2C1004.1426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observation of cooperative Mie scattering from an ultracold atomic cloud"}, "summary": "Scattering of light at a distribution of scatterers is an intrinsically\ncooperative process, which means that the scattering rate and the angular\ndistribution of the scattered light are essentially governed by bulk properties\nof the distribution, such as its size, shape, and density, although local\ndisorder and density fluctuations may have an important impact on the\ncooperativity. Via measurements of the radiation pressure exerted by a\nfar-detuned laser beam on a very small and dense cloud of ultracold atoms, we\nare able to identify the respective roles of superradiant acceleration of the\nscattering rate and of Mie scattering in the cooperative process. They lead\nrespectively to a suppression or an enhancement of the radiation pressure. We\nobserve a maximum in the radiation pressure as a function of the induced phase\nshift, marking the borderline of the validity of the Rayleigh-Debye-Gans\napproximation from a regime, where Mie scattering is more complex. Our\nobservations thus help to clarify the intricate relationship between Rayleigh\nscattering of light at a coarse-grained ensemble of individual scatterers and\nMie scattering at the bulk density distribution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.2411%2C1004.0909%2C1004.2831%2C1004.4889%2C1004.4140%2C1004.5596%2C1004.1780%2C1004.0627%2C1004.3638%2C1004.5348%2C1004.3809%2C1004.1854%2C1004.2625%2C1004.1310%2C1004.4420%2C1004.0831%2C1004.3735%2C1004.0497%2C1004.1604%2C1004.4347%2C1004.2535%2C1004.4994%2C1004.0556%2C1004.1796%2C1004.1279%2C1004.2815%2C1004.1449%2C1004.0021%2C1004.1599%2C1004.4653%2C1004.3341%2C1004.5321%2C1004.1225%2C1004.2316%2C1004.1953%2C1004.3204%2C1004.4346%2C1004.1756%2C1004.0590%2C1004.1437%2C1004.0143%2C1004.3786%2C1004.2211%2C1004.5259%2C1004.5143%2C1004.3300%2C1004.2267%2C1004.5335%2C1004.0379%2C1004.2701%2C1004.2325%2C1004.5059%2C1004.4576%2C1004.1870%2C1004.1277%2C1004.4675%2C1004.4248%2C1004.5439%2C1004.5482%2C1004.1190%2C1004.3721%2C1004.4326%2C1004.5096%2C1004.1773%2C1004.5176%2C1004.5489%2C1004.1187%2C1004.2690%2C1004.5384%2C1004.0613%2C1004.2562%2C1004.1830%2C1004.1486%2C1004.3546%2C1004.0712%2C1004.0352%2C1004.1681%2C1004.2833%2C1004.5173%2C1004.3379%2C1004.1631%2C1004.4847%2C1004.1324%2C1004.4470%2C1004.1458%2C1004.5330%2C1004.1266%2C1004.3602%2C1004.5031%2C1004.1300%2C1004.0406%2C1004.1584%2C1004.2714%2C1004.0511%2C1004.5473%2C1004.4018%2C1004.3887%2C1004.1289%2C1004.1204%2C1004.2226%2C1004.1426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Scattering of light at a distribution of scatterers is an intrinsically\ncooperative process, which means that the scattering rate and the angular\ndistribution of the scattered light are essentially governed by bulk properties\nof the distribution, such as its size, shape, and density, although local\ndisorder and density fluctuations may have an important impact on the\ncooperativity. Via measurements of the radiation pressure exerted by a\nfar-detuned laser beam on a very small and dense cloud of ultracold atoms, we\nare able to identify the respective roles of superradiant acceleration of the\nscattering rate and of Mie scattering in the cooperative process. They lead\nrespectively to a suppression or an enhancement of the radiation pressure. We\nobserve a maximum in the radiation pressure as a function of the induced phase\nshift, marking the borderline of the validity of the Rayleigh-Debye-Gans\napproximation from a regime, where Mie scattering is more complex. Our\nobservations thus help to clarify the intricate relationship between Rayleigh\nscattering of light at a coarse-grained ensemble of individual scatterers and\nMie scattering at the bulk density distribution."}, "authors": ["H. Bender", "C. Stehle", "S. Slama", "R. Kaiser", "N. Piovella", "C. Zimmermann", "Ph. W. Courteille"], "author_detail": {"name": "Ph. W. Courteille"}, "author": "Ph. W. Courteille", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.82.011404", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.5096v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.5096v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.5096v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.5096v1", "journal_reference": null, "doi": "10.1103/PhysRevA.82.011404", "fulltext": "APS/123-QED\n\nObservation of cooperative Mie scattering from an ultracold atomic cloud\nH. Bendera , C. Stehlea , S. Slamaa , R. Kaiserc , N. Piovellab , C. Zimmermanna , and Ph.W. Courteilleacd\na\nPhysikalisches Institut, Eberhardt-Karls-Universität Tübingen, D-72076 Tübingen, Germany.\nDipartimento di Fisica, Università Degli Studi di Milano, Via Celoria 16, I-20133 Milano, Italy.\nc\nInstitut Non Linéaire de Nice, CNRS, Université de Nice Sophia-Antipolis, F-06560 Valbonne, France.\nd\nInstituto de Fı́sica de São Carlos, Universidade de São Paulo, 13560-970 São Carlos, SP, Brazil.\n(Dated: October 22, 2018)\n\narXiv:1004.5096v1 [physics.atom-ph] 28 Apr 2010\n\nb\n\nScattering of light at a distribution of scatterers is an intrinsically cooperative process, which\nmeans that the scattering rate and the angular distribution of the scattered light are essentially\ngoverned by bulk properties of the distribution, such as its size, shape, and density, although local\ndisorder and density fluctuations may have an important impact on the cooperativity. Via measurements of the radiation pressure exerted by a far-detuned laser beam on a very small and dense\ncloud of ultracold atoms, we are able to identify the respective roles of superradiant acceleration\nof the scattering rate and of Mie scattering in the cooperative process. They lead respectively to\na suppression or an enhancement of the radiation pressure. We observe a maximum in the radiation pressure as a function of the induced phase shift, marking the borderline of the validity of the\nRayleigh-Debye-Gans approximation from a regime, where Mie scattering is more complex. Our\nobservations thus help to clarify the intricate relationship between Rayleigh scattering of light at a\ncoarse-grained ensemble of individual scatterers and Mie scattering at the bulk density distribution.\nPACS numbers: 42.50.Ct, 42.25.Fx, 32.80.Qk\n\nAt first sight Rayleigh scattering from point-like particles and Mie scattering from extended objects are quite\ndifferent phenomena. For example, Rayleigh scattering\nexhibits resonances due to the internal energy structure\nof the particles, e.g. atoms, while Mie scattering shows\nresonances induced by the boundary conditions, the target imposes to the incident light field [1, 2]. On the other\nhand, any extended object, e.g. a dielectric sphere, is an\nassembly of microscopic scattering particles. This raises\nquestions concerning the description of Mie scattering at\nobjects with coarse-grained density distributions. Another interesting question is, whether small ensembles of\nparticles exhibit scattering features normally attributed\nto Mie scattering.\nWhile Mie scattering is obviously a cooperative process\ninvolving a macroscopic particle distribution, in quantum\noptics Rayleigh scattering is often described as a single\nparticle effect. That this concept is erroneous in the case\nof ensembles of scatterers, has been recognized as early\nas 1954 by Dicke [3]. Rather, collective effects play a\ndominant role even on the level of single-photon scattering [4–7] provided, as has been demonstrated in a recent\nexperiment [8], the coarse graining of the cloud's density\ndistribution is negligible.\nThe scattering of light is usually studied via its angular distribution. However if the target is an atomic cloud\nwith temperature below the recoil limit, the modification\nof the atomic momentum distribution due to radiation\npressure can conveniently be mapped by time-of-flight\nimaging techniques and may yield valuable information\nabout the nature of the scattering process. Momentum\nimages are routinely analyzed in experiments with ultracold or Bose-condensed atoms, however mostly in regimes\nwhere local atomic disorder dominates over global Mie\nscattering. In this letter, we present an experimental approach emphasizing the role of Mie scattering. The idea\n\nconsists in using ultracold atomic clouds compressed to\nvolumes so small, that the whole cloud acts itself as an\ninhomogeneity at which light is diffracted like at a very\nsmall dielectric sphere. Furthermore, instead of analyzing the whole momentum distribution, which is blurred\nby the frequent occurrence of interatomic collisions in the\ndense cloud, we concentrate on its first moment, i.e. the\ncenter-of-mass acceleration under the influence of radiation pressure. We discover, as a clear signatures of Mie\nscattering, an up to three-fold increase of the cooperative\nradiation pressure with respect to single-atom radiation\npressure. Exploiting the fact that the index of refraction\nof an atomic cloud can be tuned over huge ranges by\nchanging the cloud's density and volume, or by tuning\nthe light frequency, we are able to address the RayleighDebye-Gans limit of small phase-shifts for the incident\nlaser beam or to enter the Mie regime of large phase\nshifts.\nForce on the center-of-mass.- We start with a brief\nreminder of the model of collective radiation pressure exerted by a low intensity incident laser beam on a cloud of\nN two-level atoms [7, 8] concentrating on cases of large\npush beam detunings, ∆0 \u001d Γ, where multiple scattering\nand collective saturation can be neglected. In this limit,\nthe modification of the radiation pressure Fc acting on\nthe center-of-mass of the ensemble of atoms with respect\nto the radiation pressure F1 acting on isolated atoms can\nbe expressed as [7, 8],\n4∆20\nFc\n=\n× N (sN − fN ) .\nF1\n4∆20 + N 2 Γ2 s2N\n\n(1)\n\nThe averages sN = h|SN |2 iθ,φ and fN = h|SN |2 cos θiθ,φ\nPN\nof the structure factor SN (k) = N1 j=1 e(k−k0 )*rj are\ntaken over the total solid angle of emission of a photon with wavevector k, at an angle θ with the incident\n\n\f2\nwavevector k0 [7]. They account for the role of the geometry in the photon absorption and reemission process,\nrespectively. As stated in Ref. [8], they are well approximated by sN ' 1/N + s∞ and fN ' f∞ , where s∞\nand f∞ are calculated for a smooth density distribution,\ni.e. neglecting disorder and coarse-graining in the atomic\ncloud. The averages s∞ and f∞ have been calculated\nin Ref. [7] for ellipsoidal Gaussian density distributions,\nn(r) = n0 exp[−(x2 + y 2 )/2σr2 − z 2 /2σz2 ], with the size\nσr = σ/k and the aspect ratio η = σz /σr .\nFurther approximations.- In order to simplify the interpretation of Eq. (1), we restrict ourselves to regimes\nof negligible multiple scattering, 4∆20 /Γ2 > b0 , where\nb0 ≡ 3N/σ 2 is the resonant optical density. This condition implies the inequality\n4∆20 /Γ2 > N s∞ ,\n\n(2)\n(η=1)\n\nsince for large (σ \u001d 1) spherical clouds s∞ ≡ s∞\n=\n(η>1)\n(η=1)\n(2σ)−2 and for elongated clouds s∞\n< s∞\n[7]. Using the inequality (2), we can approximate the radiation\npressure modification (1) as\n4∆20\nFc\n× (1 + N s∞ − N f∞ ) .\n'\n2\nF1\n4∆0 + N 2 Γ2 s2∞\n\n(3)\n\nThe fraction in this equation describes the role of the\nsuperradiant enhancement of the scattering rate Γ −→\nN ΓsN . The fact that the fraction is obtained from the\nfraction in Eq. (1) by substituting the factor sN by s∞\nsignifies that, in the single scattering regime and for\nlarge detunings, ∆0 \u001d Γ, disorder does not influence the\nsuperradiant acceleration of scattering significantly. In\ncontrast disorder does shape the scattering through the\nbracket in Eq. (3), which represents a geometrical factor\naccounting for the angular distribution of the reemitted\nlight. This bracket is responsible for Mie scattering, as\nwe will see in the following.\nFig. 1(a) shows the dependence of the radiation pressure modification on ∆0 and N . The multiple scattering\nregime to be avoided lies in the narrow gap separating\nthe regimes of red and blue detuning.\n\nFIG. 1: (color online) (a) Radiation pressure modification as\na function of ∆0 and N . Here σ = 10.4 and η = 6.3. (b)\nDependence of s∞ − f∞ on σ and η.\n\nReduction and enhancement of radiation pressure.-\nFor large cloud volumes, σ \u001d 1, the inhomogeneity represented by the shape of the cloud is negligible, so that\n\nreemission occurs predominantly into forward direction.\nSimilarly, elongated clouds, η \u001d 1, bundle the emitted light into forward direction. Both features result in\ns∞ −f∞ ' 0. Hence, the geometrical factor is dominated\nby disorder, and the radiation pressure modification is\nwell approximated by just the fraction of Eq. (3). In\nthis regime, the role of collectivity is limited to a superradiant enhancement of the decay rate Γ. In that case,\nthe radiation pressure Fc /F1 drops monotonically with\nincreasing N . Hence, for extended clouds there is only\ncooperative reduction of the radiation pressure with respect to uncorrelated radiation pressure. Measurements\nof this effect have already been published in Refs. [8].\nIn order to get noticeable cooperative radiation pressure enhancement, two conditions must be fulfilled.\nFirstly, the fraction in Eq. (3) has to be close to unity,\n2∆0 \u001d N Γs∞ , and secondly the bracket must be larger\nthan unity, N (s∞ − f∞ ) > 1. The first condition is true\nfor sufficiently large detunings or small atom numbers.\nIn this case, the radiation pressure modification is well\napproximated by just the bracket of Eq. (3). The dependency of s∞ − f∞ on σ and η is plotted in Fig. 1(b).\nThe figure shows that smaller cloud sizes yield larger\ns∞ −f∞ . Furthermore, for a strong radiation pressure enhancement, spherical clouds are more advantageous than\nelongated ones. The bracket of Eq. (3) describes the role\nof cooperative Mie scattering and its interplay with disorder. In the regime where the bracket is considerably\ngreater than 1, Mie scattering overwhelms the impact of\ndisorder. The observation of an increase of the radiation\npressure above the single-atom value thus constitutes a\nclear indication of Mie scattering, which has never been\nobserved before.\nThe relative importance of the two effects, superradiance or Mie scattering, can be adjusted via judicious\nchoice of the push beam detuning, ∆0 , with respect to\nN Γs∞ . This allows us to address both limits in the following measurements.\nExperiment.- In principle, reducing the volume of a\ntrapped gas to sizes not much larger than an optical\nwavelength is just a matter of cooling and compression.\nHowever, the compression of atomic clouds to very small\nvolumes is not trivial, because the increased density leads\nto high three-body collision rates. Furthermore, below\na critical temperature, the cloud crosses the threshold\nto Bose-Einstein condensation and develops a repulsive\nmean-field, which resists compression [9].\nWe prepare a 87 Rb atomic cloud in the |F, mF i =\n|2, 2i hyperfine state in a magnetic trap and evaporatively cool it down to quantum degeneracy. Typically\nwe have N = 104 ..106 atoms at temperatures between\nT = 100..1000 nK. The atom number is controlled by\nmanipulating the initial atom number before applying\nthe evaporation ramp. The cold atomic cloud is now\nloaded into a crossed beam dipole trap by ramping up the\nlight fields within 100 ms, and then slowly ramping down\n\n\f3\ndipole\nbeam\n\nCCD camera\n\ntrapped cloud\ndipole beam\npush beam\n\ng\n\na\n\nexpanded cloud\nprobe beam\n\nFIG. 2: (color online) Scheme of the experiment showing the\ndipolar trapping beams, the push beam, and the imaging\nbeam. The directions of radiation pressure, ~a, and gravity,\n~g , are also shown.\n\nthe magnetic trap. The horizontal beam of the crossed\ndipole trap is generated by a fiber laser at λr = 1080 nm.\nThe power of the horizontal beam is Pr = 2 W and its\nwaist wr = 25 μm. The corresponding trap depth is\n2\nΓ\nI ' kB × 250 μK and the trap frequency\nUr = 3πc\n2ω 3 ∆r h\n\nFIG. 3: (a) Typical absorption images taken on a cloud released from the dipole trap without (upper half) and with\n(lower half) push beam sequence. Note that about 16% of\nthe atoms are lost under the action of the push beam. (b)\nVertical integration of the images shown in (a). The flatter\ncurve, which corresponds to the cloud after the push beam\nsequence, is shifted towards the right by an amount ∆zcm .\n\nsure from\nFc =\n\n0\n\n4Ur /mwr2\n\n= (2π) 1900 Hz. The vertical beam is\nis ωr =\ngenerated by a titanium-sapphire laser at λz = 820 nm.\nIts power is Pz = 230 mW and its waist wz = 100 μm.\nThe corresponding trap depth is Uz ' kB × 90 μK and\nthe trap frequency ωz = (2π) 300 Hz. The aspect ratio\nof the trap is thus η = 6.3.\nThe temperature of the cloud after evaporation depends on the atom number. However upon transfer into\nthe dipole trap, the cloud is non-adiabatically heated to\na temperature of T ' 2.5 μK, which is almost independent from the atom number. For that reason the cloud\nis thermal.\nFrom this, we estimate a cloud radius of\np\nσ = k kB T /mωr2 ' 10.4.\nTo perform the measurement, we now apply along\nthe weak trapping (axial) direction ωz a σ+ -polarized\nlight pulse of duration τ0 = 20 μs and intensity I0 =\n2\n95..730 mW/cm detuned from the D2 line by ∆0 /2π =\n0.5..4 GHz. Immediately after the pulse (within 100 μs)\nthe trap is switched off. The cloud falls in free expansion\nfor τtof = 20 ms before we apply an imaging pulse in\ntransversal (radial) direction.\n\nObservations.- Fig. 3(a) shows a typical time-of-flight\nabsorption image reflecting the momentum distribution\nof the trapped atomic cloud. With N = 5 * 105 atoms\nwe expect high densities of n0 ' 4 * 1015 cm−3 and\nlarge collision rates of γcoll ' 25000 s−1 . I.e. during\nthe time τ0 every atom undergoes almost one collision,\nwhich smears out and broadens the momentum distribution. This does however not affect the center-of-mass\nmomentum imparted to the atomic cloud.\nWe compare the center-of-mass positions of absorption\nimages of the atomic cloud with and without push beam\nsequence and determine their relative displacement ∆zcm\n[see Fig. 3(b)]. We estimate the collective radiation pres-\n\nm∆zcm\nτ0 τtof\n\n(4)\n\nand the single-atom radiation pressure from\nF1 = ~k\n\nΓ2\nI0 3λ2\n.\n~ω 2π 4∆2 + Γ2\n\n(5)\n\nThe calculated N -dependence of the cooperative modification of the radiation pressure force acting on the\ncenter-of-mass of a trapped cloud, Eq.(3), is compared\nto measurement in Fig. 4(a). The N -dependence is flat\nin the disorder-dominated regime of low atom numbers.\nFor larger atom numbers, the force increases first, exhibits a maximum and drops for large atom numbers.\nFor increased detunings ∆0 , the maximum shifts toward\nlarger atom numbers and becomes more pronounced. For\n∆0 = (2π) 0.5 GHz the experimentally accessible atom\nnumbers, N = 104 ..106 , are in a regime, where radiation pressure is strongly reduced by up to a factor of\n10 [see red solid curve and symbols in Fig. 4(a)]. For\n∆0 = (2π) 4 GHz we expect an increased radiation pressure, i.e. Fc /F1 is larger than one, which is confirmed by\nthe data [see blue solid curve and symbols in Fig. 4(a)].\nDuring the push beam irradiation, a fraction of typically 20% of the atoms is lost due to hyperfine pumping\ninto the F = 1 state. This is caused by a misalignment\nof the push beam with respect to the magnetic field direction resulting in a deviation of the polarization from\nperfect σ+ . The resulting uncertainty in atom number is\nillustrated by the horizontal error bars in Figs. 4. Also\nshown in Figs. 4 are the curves representing the separate\ncontributions of superradiance and Mie scattering. Obviously, the data corresponding to ∆0 = (2π) 0.5 GHz are\nbetter explained by the impact of superradiance, while\nthe data corresponding to ∆0 = (2π) 4 GHz can be interpreted as being due to Mie scattering.\nFor the push beam the atomic cloud represents a dielectric medium whose mean refraction index can be approximated by nrf = 1 − φ/σ + ib/2σ, where the off-resonant\n\n\f4\n(a)\n\n(b)\n\n1\n\nFc/F1\n\nFc/F1\n\n'0/2S = 4 GHz\n\n0.5 GHz\n\n0.1\n\nMie\n\n1\nRDG\n\n0.1\n4\n\n5\nlg N\n\n6\n\n-1\n\n0\nlg I/2S\n\n1\n\nFIG. 4: (color online) (a) Double-logarithmic plot of the\nmeasured (symbols) and calculated (lines) N -dependence of\nradiation pressure. The red symbols and lines correspond\nto the detuning ∆0 = (2π) 500 MHz and the intensity\nI0 = 95 mW/cm2 . For the blue symbols and lines, ∆0 =\n(2π) 4 GHz and I0 = 730 mW/cm2 . The red and blue solid\nlines show calculations based on the full radiation pressure expression (3) without adjustable parameters. The red and blue\ndotted lines represent just the fraction of the expression. The\ndash-dotted lines representing just the bracket coincide for\nboth values of ∆0 . The horizontal error bars result from uncertainties in the measurement of the atom number and also\nfrom the fact that, during the push time, τ0 the atoms are\npumped into a dark hyperfine state. The vertical error bars\ninclude an assumed uncertainty of 20% for the push beam\nintensity I0 . (b) Same radiation pressure data as (a), but\nplotted as a function of the push beam phase shift φ. In this\ndiagram the dotted lines representing the fraction coincide for\nboth values of ∆0 .\n\noptical density is b = b0 Γ2 /(4∆2 + Γ2 ) and the phase\nshift φ = b∆0 /Γ. Plotting the radiation pressure force as\na function of the push beam phase shift [see Fig. 4(b)],\nwe infer that the data taken at large detunings are in\nthe so-called Rayleigh-Debye-Gans regime of Mie scattering, characterized by small phase shifts φ < 2π. The\ndata taken at small detunings are in the Mie regime of\nlarge phase shifts, φ > 2π. However in this regime, the\nobserved rapid decrease with φ of the radiation pressure\nis dominated by superradiant enhancement of scattering and not by Mie scattering. This is reflected in the\nabsence of a maximum in the φ-dependence of the radiation pressure. The appearance of a maximum for large\n\n[1] H. C. van de Hulst, \"Light Scattering by Small Particles\",\nDover Publications Inc., New York (1981).\n[2] C. F. Bohren and D. R. Huffman, \"Absorption and Scattering of Light by Small Particles\", John Wiley & Sons\n(1983).\n[3] R. H. Dicke, Phys. Rev. 93, 99 (1954).\n[4] M. O. Scully, E. S. Fry, C. H. R. Ooi, and K. Wod́kiewicz,\nPhys. Rev. Lett. 96, 010501 (2006).\n[5] J. H. Eberly, J. Phys. B: At. Mol. Opt. Phys. 39, S599\n(2006).\n[6] A. A. Svidzinsky, J.-T. Chang, and M. O. Scully, Phys.\nRev. Lett. 100, 160504 (2008).\n[7] Ph. W. Courteille et al., Eur. J. Phys. D 58, 69 (2010).\n[8] T. Bienaimé et al., Phys. Rev. Lett. accepted (2010).\n\ndetunings suggests a strong relationship to the first Mie\nresonance [11, 12], which needs however to be confirmed\nby a more detailed theoretical model. The model, which\nis presently under investigation, would have to include\nthe phase shift for the push beam induced by the cloud's\nrefractive index. We expect that this model should also\nbe able to predict the occurrence of high-order Mie resonances, which could be experimentally observed in even\nmore compact atomic clouds.\nConclusion.- We have presented measurements on ultracold atoms proving that, in the limit of the approximation made, the expression (3) correctly describes the radiation pressure force on atomic clouds. More generally,\nit applies to extended objects that can either be ensembles of scatterers like homogeneous, ordered or disordered\natomic clouds of arbitrary shapes and volumes, or macroscopic objects like dielectric spheres. This expression\nthus represents a bridge between microscopic Rayleigh\nscattering and macroscopic Mie scattering. Nevertheless, at high densities, near-field effects may come into\nplay, calling for further corrections to the present simple\nmodel.\nAtomic clouds with small atom numbers basically represents a randomly distributed bunch of scatterers, whose\nintrinsic disorder spoils cooperativity. The radiation\npressure is then well described by the single-atom value.\nAt large atom numbers, the atomic cloud forms a smooth\ndensity distribution characterized by an almost perfect\ncooperativity. In this regime, depending on the laser detuning, the cooperativity is either dominated by superradiant acceleration of the decay rate, for which case we\nexperimentally observed an up to 10-fold reduction of the\nradiation pressure. Or it is dominated by Mie scattering\nleading to an observed up to 3-fold enhancement of the\nradiation pressure.\nThis work has been supported by the Deutsche\nForschungsgemeinschaft (DFG) under Contract No.\nCo 229/3-1.\n\n[9] Alternatively, one could think of compressing the radial direction σ only, but this prompts the mean-field\nto increase η. The elongated condensate then acts like a\nwaveguide for scattered photons and the impact of Mie\nscattering is reduced. The only way seems to be to reduce\nthe interaction in the vicinity of a Feshbach resonance.\n[10] Note that at ∆ = (2π) 500 MHz for high atom numbers,\nN > 106 , multiple scattering starts to set in and may\nweakly affect the data.\n[11] C. M. Sorensen and D. J. Fischbach, Opt. Comm. 173,\n145 (2000).\n[12] M. J. Berg and C. M. Sorensen and A. Chakrabarti, Appl.\nOpt. 44, 7487 (2005).\n\n\f"}