{"id": "http://arxiv.org/abs/0902.1392v1", "guidislink": true, "updated": "2009-02-09T09:54:02Z", "updated_parsed": [2009, 2, 9, 9, 54, 2, 0, 40, 0], "published": "2009-02-09T09:54:02Z", "published_parsed": [2009, 2, 9, 9, 54, 2, 0, 40, 0], "title": "Dirac-field model of inflation in Einstein-Cartan theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.0052%2C0902.3147%2C0902.1583%2C0902.1336%2C0902.3690%2C0902.4306%2C0902.0633%2C0902.4447%2C0902.3698%2C0902.2455%2C0902.3555%2C0902.2308%2C0902.2478%2C0902.3146%2C0902.4196%2C0902.1546%2C0902.2147%2C0902.1016%2C0902.2217%2C0902.3164%2C0902.0713%2C0902.4327%2C0902.0990%2C0902.1556%2C0902.3365%2C0902.4378%2C0902.4547%2C0902.0420%2C0902.0994%2C0902.1888%2C0902.2539%2C0902.0529%2C0902.2343%2C0902.4622%2C0902.2787%2C0902.3217%2C0902.3054%2C0902.4536%2C0902.0783%2C0902.0245%2C0902.4022%2C0902.1921%2C0902.0005%2C0902.2099%2C0902.0018%2C0902.1868%2C0902.4289%2C0902.0091%2C0902.4717%2C0902.2118%2C0902.0818%2C0902.3326%2C0902.3282%2C0902.0102%2C0902.3999%2C0902.1594%2C0902.1825%2C0902.1752%2C0902.2819%2C0902.4112%2C0902.2932%2C0902.4227%2C0902.2208%2C0902.1555%2C0902.2926%2C0902.1912%2C0902.4144%2C0902.0862%2C0902.1103%2C0902.2657%2C0902.1392%2C0902.2377%2C0902.2570%2C0902.1851%2C0902.3155%2C0902.4426%2C0902.4504%2C0902.3675%2C0902.1169%2C0902.3771%2C0902.0386%2C0902.1271%2C0902.3449%2C0902.0055%2C0902.2167%2C0902.0722%2C0902.3356%2C0902.0761%2C0902.1151%2C0902.3770%2C0902.3258%2C0902.1250%2C0902.3629%2C0902.3766%2C0902.1107%2C0902.2847%2C0902.3990%2C0902.0469%2C0902.3088%2C0902.2323%2C0902.2511&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dirac-field model of inflation in Einstein-Cartan theory"}, "summary": "We present a cosmological model in which a single Dirac field with a flat\npotential can give rise to inflation within the framework of the\nEinstein-Cartan theory. It is shown that our Dirac-field model leads to a\nnearly scale-invariant spectrum of density fluctuations owing to the\nspin-interaction which naturally arises from the field equations of the\nEinstein-Cartan theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.0052%2C0902.3147%2C0902.1583%2C0902.1336%2C0902.3690%2C0902.4306%2C0902.0633%2C0902.4447%2C0902.3698%2C0902.2455%2C0902.3555%2C0902.2308%2C0902.2478%2C0902.3146%2C0902.4196%2C0902.1546%2C0902.2147%2C0902.1016%2C0902.2217%2C0902.3164%2C0902.0713%2C0902.4327%2C0902.0990%2C0902.1556%2C0902.3365%2C0902.4378%2C0902.4547%2C0902.0420%2C0902.0994%2C0902.1888%2C0902.2539%2C0902.0529%2C0902.2343%2C0902.4622%2C0902.2787%2C0902.3217%2C0902.3054%2C0902.4536%2C0902.0783%2C0902.0245%2C0902.4022%2C0902.1921%2C0902.0005%2C0902.2099%2C0902.0018%2C0902.1868%2C0902.4289%2C0902.0091%2C0902.4717%2C0902.2118%2C0902.0818%2C0902.3326%2C0902.3282%2C0902.0102%2C0902.3999%2C0902.1594%2C0902.1825%2C0902.1752%2C0902.2819%2C0902.4112%2C0902.2932%2C0902.4227%2C0902.2208%2C0902.1555%2C0902.2926%2C0902.1912%2C0902.4144%2C0902.0862%2C0902.1103%2C0902.2657%2C0902.1392%2C0902.2377%2C0902.2570%2C0902.1851%2C0902.3155%2C0902.4426%2C0902.4504%2C0902.3675%2C0902.1169%2C0902.3771%2C0902.0386%2C0902.1271%2C0902.3449%2C0902.0055%2C0902.2167%2C0902.0722%2C0902.3356%2C0902.0761%2C0902.1151%2C0902.3770%2C0902.3258%2C0902.1250%2C0902.3629%2C0902.3766%2C0902.1107%2C0902.2847%2C0902.3990%2C0902.0469%2C0902.3088%2C0902.2323%2C0902.2511&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a cosmological model in which a single Dirac field with a flat\npotential can give rise to inflation within the framework of the\nEinstein-Cartan theory. It is shown that our Dirac-field model leads to a\nnearly scale-invariant spectrum of density fluctuations owing to the\nspin-interaction which naturally arises from the field equations of the\nEinstein-Cartan theory."}, "authors": ["Tomoki Watanabe"], "author_detail": {"name": "Tomoki Watanabe"}, "author": "Tomoki Watanabe", "arxiv_comment": "9 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/0902.1392v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.1392v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.1392v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.1392v1", "journal_reference": null, "doi": null, "fulltext": "Dirac-field model of inflation in Einstein-Cartan theory\nTomoki Watanabe∗\nDepartment of Physics, Tokai University,\n1117 Kitakaname, Hiratsuka,\nKanagawa 259-1292, Japan\n(Dated: October 23, 2018)\n\narXiv:0902.1392v1 [astro-ph.CO] 9 Feb 2009\n\nWe present a cosmological model in which a single Dirac field with a flat potential can give rise to\ninflation within the framework of the Einstein-Cartan theory. It is shown that our Dirac-field model\nleads to a nearly scale-invariant spectrum of density fluctuations owing to the spin-interaction which\nnaturally arises from the field equations of the Einstein-Cartan theory.\nPACS numbers: 98.80.Cq, 98.80.-k, 04.50.Kd\n\nI.\n\nINTRODUCTION\n\nNowadays, it is widely accepted that inflation of the\nearly universe [1] is due to one or more slow-rolling scalar\nfields, called inflaton, which typically lead to a nearly\nscale-invariant power spectrum of primordial density fluctuations with the spectral index n ≈ 1 in good agreement\nwith recent, increasingly accurate observations of cosmic\nmicrowave background anisotropy [2, 3, 4, 5]. However, it\nremains a fundamental task to identify the inflaton with a\ncertain particle in promising particle-physics models theoretically and experimentally. Then the question arises:\ncannot other fields drive inflation? Particularly we focus\non Dirac spinor fields.\nAs the scalar field is often necessary in various theories\nof nature, so the Dirac field is essential to a satisfactory\ndescription of relativistic fermions. Thus, it is of considerable importance and interest to investigate roles of the\nDirac field in cosmology.\nOn this subject, much remarkable work has been done\nwithin general relativity by various authors. For example, quantization of a Dirac field and studies of particle\ncreation in the expanding Friedmann-Robertson-Walker\n(FRW) universe were presented in Refs. [6, 7, 8]; quantization of the system where a Dirac field couples to the\nFRW metric was discussed in Refs. [9, 10]; the explicit\nsolutions of the Dirac equation in the FRW universe were\nderived in Refs. [11, 12].\nMoreover, as for the issue of the accelerating universe,\nit was shown that a self-interacting or nonlinear Dirac\nfield can yield negative pressure and thereby accelerate\nthe early and the late-time expansion of the universe\n[13, 14]. However, when we discuss whether a Dirac field\ncan be an alternative to the inflaton, we should pay attention to Armendáriz-Picón and Greene's work [15] which\nconcluded that, although the de Sitter expansion can be\ndriven by a flat potential of a Dirac field, such models lead to a scale-dependent spectrum with n = 4, and\nthus are incompatible with the observations. As other\nways not to rely on the inflaton, one can introduce vec-\n\n∗ Electronic\n\naddress: tomoki@tokai-u.jp\n\ntor fields [16, 17], or non-Dirac spinors that have some\nunusual properties [18].\nOn the other hand, since Dirac fields have spin-1/2\nin contrast to scalar fields, it is also of great interest to\nstudy cosmological effects of the spin. Then, one needs\ngravitational theories that naturally bring spin of matter\nfields to the geometry of spacetime, since in general relativity microscopic quantities such as the spin are usually\nneglected. For this purpose, as one of such extended theories, we will adopt the Einstein-Cartan theory [19] in\nwhich nonvanishing torsion is algebraically equivalent to\nspin of matter fields through the field equation and, as\na result, a spin-interaction is generated. Generally, one\ncan suppose affine connections in spacetime to be asymmetric, thereby naturally obtaining a modified theory of\ngeneral relativity. Since, from the viewpoint of high energy physics, general relativity should appropriately be\nextended so as to be able to describe the very early universe, the Einstein-Cartan theory can be a reasonable\nframework for considering inflation. We can then expect\nthat the spin has a crucial role in inflationary cosmology.\nMany authors have also presented a variety of cosmological models based on non-Riemannian gravity [20, 21],\nas exhaustively listed in Ref. [22]. The subject of early\ninvestigations based on the Einstein-Cartan theory was\nmainly to construct exact solutions and to avoid the initial singularity in the presence of torsion [22, 23, 24].\nSubsequently, after the advent of inflationary cosmology,\ninflationary solutions were obtained also in the EinsteinCartan models, some of which [25, 26, 27, 28] relied on\nspin effects of the so-called spinning fluid [29, 30, 31].\nIn this paper, we show that a single Dirac field can give\nrise to inflation within the Einstein-Cartan theory, and\nprove compatibility of the Dirac-field model with the observations by calculating the power spectrum of density\nfluctuations of the Dirac field.\nWe will take the Dirac Lagrangian as the source of\nmetric and torsion because we are only concerned with\nseeking the origin of inflation in the context of particlephysics. It should be noted that we will deal with the\nhomogeneous Dirac field classically, namely, as a set of\ncomplex-valued functions that transform according to the\nspinor representation of the Lorentz group and fulfill the\nDirac equation. We here consider the expectation value\n\n\f2\nof a spinor operator-valued field to be the corresponding\nclassical spinor; a possible justification for the existence\nof classical spinors is made in Ref. [15]. In addition to the\nfact that the classical spinors are mathematically consistent, as shown in Ref. [15], such classical treatment for\na physical state can be a good approximation in some\ncases.\nThe organization of this paper is as follows: in section\nII, we briefly review the description of a Dirac field coupled to gravity in the Einstein-Cartan theory and derive\ncosmological equations in the flat FRW universe. Within\nthis framework, in section III, after showing that a flat\npotential of the Dirac field leads to the de Sitter expansion of the universe, we compute the power spectrum of\ndensity fluctuations of the Dirac field. We will observe\nthat the obtained spectrum is nearly scale-invariant owing to the existence of the spin-interaction. We present\nour conclusion in section IV.\n\nII.\n\nFORMALISM\n\nIn this section, we summarize how the Einstein-Cartan\ntheory describes interactions between a Dirac field and\ngravity, and present the cosmological equations that form\nthe basis of our Dirac-field model of inflation.\nIn order to deal with a Dirac field ψ coupled to gravity,\none requires that the action of the Dirac field be invariant under local Lorentz transformations, with the help\nof the vierbein formalism [32, 33] in which vierbeins eμa\nand spin connections ωμab are introduced as the fundamental variables. The vierbein satisfies ηab eμa eν b = gμν\nwith the Minkowski metric ηab , where the signature we\nuse is ηab = diag(+1, −1, −1, −1). (The Greek and\nLatin indices denote spacetime and Lorentz indices respectively.) The spin connection ωμab is defined by\nb]\n\nωμab ≡ eν[a ∇μ eν , where ∇μ is a covariant derivative\nbased on affine connections of spacetime Γρ μν and acts\non tensors. For the Dirac field, the covariant derivative\nbased on the spin connection is defined by\ni\nDμ ψ ≡ ∂μ ψ − ωμab σab ψ,\n4\n\n(1)\n\nwhere σ ab ≡ (i/2)[γ a , γ b ] is the generator of the spinor\nrepresentation of the Lorentz group and the constant γmatrices γ a satisfy the Clifford algebra {γ a , γ b } = 2η ab ;\nthe covariant derivative acting on the Dirac adjoint ψ̄ ≡\nψ † γ 0 is\ni\nDμ ψ̄ ≡ ∂μ ψ̄ + ωμab ψ̄σab .\n4\n\n(2)\n\nIn this paper, for explicit calculations, we will choose the\nDirac representation\n\u0013\n\u0013\n\u0012\n\u0012\n0 σm\n1 0\nm\n0\n,\n(3)\n,\nγ =\nγ =\n−σ m 0\n0 −1\n\nwhere σ m are the conventional 2 × 2 Pauli matrices. For\nlater convenience, we also define the additional γ-matrix\nas γ5 ≡ iγ 0 γ 1 γ 2 γ 3 . It is obvious that the covariant\nderivative defined by Eq. (1) transforms as a vector under diffeomorphisms and as a spinor under local Lorentz\ntransformations. The coordinate components of γ a are\ndefined by\nγ μ ≡ eμa γ a ,\n\n(4)\n\nwhich are shown to give a new set of γ-matrices that\nsatisfy the algebra {γ μ , γ ν } = 2g μν .\nThus, the Dirac Lagrangian generalized into a curved\nspacetime background is given by\nLψ =\n\n\u0003\ni\u0002 μ\nψ̄γ Dμ ψ − (Dμ ψ̄)γ μ ψ − V,\n2\n\n(5)\n\nwhere the term V generically represents a scalar potential of the Dirac field including a mass term and selfinteractions, and consists of arbitrary functions of invariants generated from ψ and ψ̄; in what follows, we assume\nV = V (s) with s ≡ ψ̄ψ for simplicity.\nOn the other hand, for gravity, we take the EinsteinHilbert Lagrangian\nLg = −\n\n1\neμ eν Rab ,\n16πG a b μν\n\n(6)\n\nwhere Rabμν is the curvature of the spacetime given by\nRabμν = ∂μ ων ab − ∂ν ωμab + ωμac ωνc b − ων ac ωμc b . (7)\nIn order to take into account effects of the spin of a\nDirac field on gravity, it is necessary to extend general\nrelativity. In this paper, for this purpose, we introduce\nthe Einstein-Cartan theory [19] in which nonvanishing\ntorsion C ρμν ≡ 2Γρ [μν] is related with spin of matter\nfields. (For a very brief review of the Einstein-Cartan\ntheory, see Appendix .)\nWithin this framework, we consider a system in which\na Dirac field provides the unique source of metric and torsion of spacetime. Since the existence of torsion leads to\nthe spin-interaction in the curvature (7) and the kinetic\nterms of the Lagrangian (5), the conventional Einstein\nequation is modified as\n\u0012\n\u0013\n3πG\n(tot)\nG̃μν = 8πG T̃(μν) −\nφa φa gμν ≡ 8πGTμν\n. (8)\n2\nThe additional term −3πGφa φa gμν /2 with φa ≡ ψ̄γ5 γ a ψ\nis the spin term prescribed by the Einstein-Cartan theory,\nand can be regarded as a correction due to the spin of\nthe Dirac field. Here, the tilde indicates quantities free\nfrom torsion; G̃μν is the Einstein tensor composed of the\nRiemannian (Levi-Civita) connection; T̃(μν) is the usual,\nsymmetric energy-momentum tensor of the Dirac field,\ngiven by\ni\nih\nψ̄γ(μ D̃ν) ψ − (D̃(ν ψ̄)γμ) ψ − gμν L̃ψ , (9)\nT̃(μν) =\n2\n\n\f3\nwhere D̃μ is the covariant derivative based on the Rie ̃ μ eν b] , and L̃ψ is\nmannian spin connection ω̃μab ≡ eν[a ∇\nthe torsion-free Lagrangian of the Dirac field defined by\nL̃ψ ≡\n\ni\nih μ\nψ̄γ D̃μ ψ − (D̃μ ψ̄)γ μ ψ − V.\n2\n\n(10)\n\nIt is interesting that, in Eq. (8), the spin correction to\nthe energy-momentum tensor of the Dirac field is proportional to both the metric gμν and the gravitational\nconstant G; such a simple form strongly motivates us to\nstudy the Dirac-gravity system including effects of the\nspin.\nSimilarly, the conventional Dirac equation in curved\nspacetime is also modified so as to include the spininteraction term:\niγ μ D̃μ ψ − V ′ ψ + 3πGφa γ5 γ a ψ = 0,\n\n(11)\n\nwhere the prime denotes the derivative with respect to\ns. As can be seen from Eqs. (8) and (11), one can arrive\nat the usual general-relativistic equations whenever the\nenergy scale of the spin-interaction Gφa φa is negligible in\ncomparison with typical energy scales of the kinetic term\nor the potential.\nWith the general formalism described above, we are\nnow interested to investigate cosmology. Let us consider\nthe flat FRW universe, in which the metric is given by\n2\n\n2\n\n2\n\n2\n\nds = dt − a (t)dx ,\n\n(12)\n\nIt should be noted that φa φa is always negative, and\nconsequently that the spin component in Eq. (16) contributes as extra positive pressure. In terms of these\nvariables, the cosmological evolution equations are given\nby\n\u0012\n\u0013\n3πG\n8πG\nφa φa ,\nV −\n(17)\nH2 =\n3\n2\n4πG\nä\n= −\n(−2V + 3sV ′ − 6πGφa φa ) , (18)\na\n3\nwhich are linked through the conservation law\nρ̇tot + 3H(ρtot + ptot ) = 0.\n\n(19)\n\nOne can verify that the conservation law (19) is equivalent to the Dirac equation (14). Therefore, the system\nthat consists of a Dirac field and the flat FRW spacetime\nis self-consistent in the Einstein-Cartan theory as well as\nin general relativity.\nFinally, we define the equation of state w as\nw≡\n\nptot\nsV ′ − V − 3πGφa φa /2\n=\n.\nρtot\nV − 3πGφa φa /2\n\n(20)\n\nIt is worth mentioning that, by taking the torsion-free\nlimit Gφa φa /V → 0, we can always reproduce the cosmological equations in general relativity formulated by\nArmendáriz-Picón and Greene [15]. As an important example, the equation of state they found is\nwGR = s\n\nV′\n− 1.\nV\n\n(21)\n\nand the vierbein is chosen to be\n(eμa ) = diag[1, a(t), a(t), a(t)],\n\nwhere t is the cosmic time and a(t) is the scale factor.\n(See Refs. [9, 10] for the nonflat FRW universe.) Then\nwe should exclude any spatial dependence of the Dirac\nfield for consistency with homogeneity of the spacetime:\n∂i ψ = 0. Consequently, we obtain the following Dirac\nequation:\n3\nψ̇ + Hψ + iγ 0 V ′ ψ − 3iπGφa γ 0 γ5 γ a ψ = 0,\n2\n\n(14)\n\nwhere H ≡ ȧ/a is the Hubble parameter and the dot\ndenotes the derivative with respect to t. From Eq. (14),\nthe anisotropic components T̃(0i) can be shown to vanish,\nwhich is consistent with isotropy of the spacetime, G̃0i =\n0.\nNow the energy density and pressure, which must\nbe specified to describe cosmological dynamics, can be\nfound from the total energy-momentum tensor defined\nin Eq. (8) as\nρtot ≡\n\n(tot)\n\n3πG\nφa φa ,\n2\n3πG\nφa φa .\n= sV ′ − V −\n2\n\nT0 0 = V −\n\nptot ≡ −(tot) Ti\n\ni\n\nIII.\n\nINFLATION\n\nA.\n\nBackground\n\n(13)\n\n(15)\n(16)\n\nIn this subsection, we show that a Dirac field can cause\nthe de Sitter expansion of the background universe on\nthe basis of the cosmological equations collected in the\nprevious section.\nIn general relativity, from Eq. (21), one can discuss\nde Sitter inflation driven by a Dirac field, as done in\nRef. [15]. In this case, V is assumed to be sufficiently flat\nbecause wGR ≈ −1 is guaranteed by\nd ln V\n≪ 1,\nd ln s\n\n(22)\n\nwhich is a similar requirement to the slow-roll condition\nfor conventional scalar-field models of inflation. The condition (22) is satisfied if V is asymptotic to a positive constant for large s. For example, ln(1 + sn ), tanh(ns), and\nsn /(1 + s)n with positive n are candidates for a potential\nthat realizes the de Sitter expansion.\nAlso in our case, the flatness of V is a basic premise\nfor considering inflation. First, in the evolution equation\nfor φa φa ,\nd\n(φa φa ) + 6Hφa φa + 4iV ′ φ0 ψ̄γ5 ψ = 0,\ndt\n\n(23)\n\n\f4\n\nṡ + 3Hs + 6iπGφ0 ψ̄γ5 ψ = 0,\n\n(24)\n\nwhere the third term on the left hand side arises from the\nspin-interaction, and hence approximately vanishes when\ninflation begins. Consequently, number of e-foldings between a time t1 and a later time t2 is given by\nN=\n\n1 s(t1 )\nln\n.\n3 s(t2 )\n\n(25)\n\nTherefore, if one requires N ≈ 60 in order to solve the\nhorizon problem, then s must change by approximately\neighty orders of magnitude. In this study we assume the\npotential to be so sufficiently flat as to satisfy Eq. (22)\nfor such a wide range of s regardless of its origin; our\npurpose is to investigate whether the Dirac field with a\nflat potential can be a source of inflation in the EinsteinCartan theory.\nSimilarly to the scalar s, the pseudoscalar s5 defined by\ns5 ≡ ψ̄γ5 ψ evolves according to s5 ∝ a−3 during inflation\nbecause s5 fulfills the evolution equation\nṡ5 + 3Hs5 + 2iV ′ φ0 + 6iπGφ0 s = 0,\n\n(26)\n\nwhere both the last and the penultimate terms on the\nleft hand side are negligible under our assumption. We\nalso note that, in terms of the rescaled field defined by\nΨ ≡ a3/2 ψ, these scalars, s and s5 , can be rewritten as\ns = a−3 Ψ̄Ψ, s5 = a−3 Ψ̄γ5 Ψ respectively, where Ψ̄Ψ and\nΨ̄γ5 Ψ are constant as long as the sufficient flatness of the\npotential holds.\n\n1\n0.5\nw\n\nwhich is derived from Eq. (14), the flatness condition\nallows us to ignore the third term on the left hand side\nand hence leads to φa φa ∝ a−6 . Then it follows that\nall the spin components, which are incorporated in the\nform of Gφa φa in the background equations presented\npreviously, decrease faster than the other terms in those\nequations as the universe expands.\nWhen the spin components become so small as to be\nnegligible, all the background equations in the previous\nsection arrive back at those of Ref. [15]. If the potential\nretains the sufficient flatness until that time, then the\nequation of state eventually becomes w ≈ wGR ≈ −1.\nThus, a flat potential guarantees de Sitter inflation in our\nmodel as well. In FIG. 1, we have numerically demonstrated that w approaches the value of −1 as the spin\ncomponents decrease under a sufficiently flat potential.\nMeanwhile, we can also speculate about the early universe before the inflation era. The result that the spin\ncomponents evolve as φa φa ∝ a−6 also means that these\nbecome greater in earlier stages of the universe. Thus it\ncan be seen that the very early universe is dominated by\nthe spin components in our model, and also that, from\nEq. (20), during such an early epoch the Dirac field satisfies w ≈ 1 which corresponds to the equation of state\nfor a stiff fluid. Therefore, our model suggests that inflation begins when the spin-dominated era ends, which\ncan be seen also from FIG. 1. Since the Einstein-Cartan\ntheory is expected to be relevant to high energy physics,\nespecially theories of supergravity [34, 35] in which the algebraic equivalence between torsion and spin is necessary\nfor the construction of supersymmetric transformations,\nit is acceptable that the spin components dominate the\nvery early universe which should be considered to be at\nhigh temperature.\nOn the other hand, the evolution of s is given by s ∝\na−3 during inflation because Eq. (14) can be recast as\n\n0\n-0.5\n-1\ntime\n\nFIG. 1: Typical time evolution of the equation of state w.\nThe solid curve represents w for the solution of the cosmological equations (14) and (18) with the potential of the form\nln(1 + s2 ), and shows that its value which is initially w ≈ 1\ncomes close to −1 as time progresses. The dashed curve represents the simultaneous evolution of the spin components in w,\n(−3πGφa φa /2)(V − 3πGφa φa /2)−1 , disappearing with time.\n\nB.\n\nPerturbation\n\nIn this subsection, we discuss perturbations of the\nDirac field that brings about de Sitter inflation via the\ndynamics explained above.\nThe conventional scalar-field models of inflation [1]\nhave an important feature of predicting a nearly scaleinvariant spectrum of density fluctuations in excellent\nagreement with recent observations [2, 3, 4, 5]. Our next\ntask is thus to examine the consistency of the Dirac-field\nmodel of inflation with the observations, namely, whether\nour model can derive a nearly scale-invariant spectrum,\nby computing the power spectrum of density perturbations of the Dirac field. Although a proper analysis for\nthis purpose should be based on gauge-invariant perturbation theories [36, 37, 38, 39] where both spacetime and\nmatter fields are perturbed, we will not consider the metric perturbations but only the perturbed field δψ for simplicity.\nOur key strategy is to perturb the spin components of\nthe background equations. Whereas Armendáriz-Picón\nand Greene [15] showed that, within the framework of\ngeneral relativity, Dirac-field models of inflation with a\nflat potential lead to a scale-dependent spectrum and\nhence are inconsistent with the observations, our model\nbased on the Einstein-Cartan theory possesses in the first\nplace the spin-interaction, which opens the possibility of\n\n\f5\nimproving their result. It should be noted that the terms\nrelated to the spin in our model appear as a consequence\nof a natural extension of general relativity. As discussed\npreviously, the inflationary expansion itself can be shown\nto occur by simply assuming the flat potential, whether\nthe Dirac field has the spin-interaction or not; however, if\nthe spin terms exist, then their fluctuations must also exist. We will show below that our model predicts a nearly\nscale-invariant spectrum owing to these fluctuations.\nIn what follows, we mark the background quantities\nwith B, and for convenience, use the identity\nφa φa = −(ψ̄ψ)2 − (iψ̄γ5 ψ)2 ≡ −s2 + s25 .\n\n(27)\n\nThe scalar s = ψ̄ψ and the pseudoscalar s5 = ψ̄γ5 ψ are\nnow perturbed as\ns = ψ̄B ψB + ψ̄B δψ + δ ψ̄ψB ≡ sB + δs,\n(28)\ns5 = ψ̄B γ5 ψB + ψ̄B γ5 δψ + δ ψ̄γ5 ψB ≡ sB\n+\nδs\n.(29)\n5\n5\nThe equation of motion for δψ is then given by\n\u0012\n\u0013\n3\n1\n0\niγ δ ψ̇ + Hδψ + i γ m ∂m δψ − mδψ\n2\na\n\u0003\n\u0002\n−3πG (sB − sB\n5 γ5 )δψ + (δs − δs5 γ5 )ψB = 0, (30)\n\nwhere m ≡ V ′ and we have ignored V ′′ because of the\nflatness of V , from which it follows that m is approximately constant. Again we note that the term proportional to G is the correction due to torsion or equivalently spin; i.e., one can take the limit G → 0 as a\nmethod to render the perturbed equations torsion-free in\nthe dynamics of perturbations, while, in the background\nequations, the torsion-free equations are reproduced as\na result of rapid disappearance of the spin components\nof the form Gφa φa . On the other hand, taking account\nof the fact that general relativity provides a successful\ndescription of the present universe, one can consider the\ncorrection coming from torsion to be generally small. In\nother words, we can regard the term proportional to G\nas a first-order correction to general relativity, and will\nignore higher-order corrections in G whenever the quantities derived below include such terms.\nIn the limit G → 0, the torsion-free equation of motion\nis found to be\niγ μ D̃μ δ ψ̃ − mδ ψ̃ = 0,\n\n(31)\n\nwhich can be solved analytically [11]. For H ≈ const.,\nthe plane-wave solution us (k, t) of Eq. (31) is generally\ngiven by\n!\nr\n(1)\n+ (2)\n−πkη α+\nH\n(−kη)\n+\nβ\nH\n(−kη)\nν\nν\n−3/2\nk\nk\n,\nus = a\n(1)\n− (2)\n2\nα−\nk Hν ∗ (−kη) + βk Hν ∗ (−kη)\n(32)\n(1,2)\nwhere η is the conformal time and Hν (−kη) are the\nHankel functions of the first and the second kind with\n±\nν = 1/2 − im/H ≈ const.; α±\nk and βk are arbitrary\n\nconstant two-spinors. The solution of Eq. (31) can then\nbe expanded as\nδ ψ̃ =\n\nZ\n\n2\nd3 k X \u0002\nus (k, t)as (k)eik*x\n(2π)3/2 s=1\n\u0003\n+vs (k, t)b†s (k)e−ik*x ,\n\n(33)\n\nwhere the mode function vs (k, t) corresponding to negative energy solutions is of the same form as Eq. (32).\nNow, for the purpose of investigating the changes due\nto the spin from the torsion-free case, it is useful to introduce scalar functions A(k, t) and B(k, t), and to express\nthe plane-wave expansion of the solution of Eq. (30) in\nterms of the analytical solution (32) as\nδψ =\n\nZ\n\n2\nd3 k X \u0002\nA(k, t)us (k, t)as (k)eik*x\n(2π)3/2 s=1\n\u0003\n(34)\n+B(k, t)vs (k, t)b†s (k)e−ik*x ,\n\nin which expression, A and B play a role to represent\nthe modifications to the torsion-free case; i.e., by substituting Eq. (34) into Eq. (30), one can see that the\nevolution of A and B is governed by the spin-interaction\npart of Eq. (30), and also that both A and B are constant in the limit G → 0. Here, as and bs are the particle\nand antiparticle operators satisfying {as (k), a†s′ (k′ )} =\n{bs (k), b†s′ (k′ )} = δss′ δ 3 (k − k′ ) under an appropriate orthonormality. Then, the vacuum expectation value of the\nsquare of δψ is\nZ\nX\nd3 k\n|B|2\nv̄s (k)vs (k).\n(35)\nhδ ψ̄δψi =\n3\n(2π)\ns\nNext, we characterize density perturbations δρ by the\nvariable\nζ≡\n\nδρ\n,\nρ+p\n\n(36)\n\nThis quantity is the one employed in Ref. [15], defined analogously to the gauge-invariant Bardeen variable, which is conserved for adiabatic perturbations on\nsufficiently large scales [36, 40]. For our model, we have\nρ + p = msB and\nδρ = mδs + 3πG(sB δs − sB\n5 δs5 ),\n\n(37)\n\nfrom which we compute the power spectrum P of the\nvariable ζ on comoving scales 1/k, defined by\nZ\ndk sin kr\nhζ(x, t)ζ(x + r, t)i =\nP(k).\n(38)\nk kr\nWe have supposed that the Fourier transform of the correlation function on the left hand side depends only on k\nand not on k itself, for consistency with the isotropy of\nthe background spacetime.\nIn order to evaluate the isotropic power spectrum of\nhζ 2 i, following the method of Ref. [15], we apply the Fierz\n\n\f6\ntransformation to hζ 2 i and expand the vacuum expectation values of the quadratic term of δs and δs5 in terms\nof perturbation bilinears. For example, the vacuum expectation value of δs2 can be expressed as\nhδs2 i =\n\nψ̄B γ a ψB\nsB\nhδ ψ̄δψi +\nhδ ψ̄γa δψi + * * * .\n2\n2\n\n(39)\n\nAfter that, as noted in Ref. [15], we concentrate on\nthe perturbations of the scalar bilinear form hδ ψ̄δψi\nand discard the remaining vectorial bilinears that may\nbreak isotropy of the power spectrum because we are\nonly concerned with determining the amplitude and kdependence of P. In this way, P is obtained as\n\u0012\n\u0013\n|B|2 k 3\n3πGC1 a−3 X\nP(k) =\n1\n+\nV̄s Vs , (40)\nm\n4π 2 Ψ̄B ΨB\ns\nwhere Vs is the rescaled mode function defined by Vs ≡\na3/2 vs and C1 = 2Ψ̄B ΨB − (Ψ̄B γ5 ΨB )2 /Ψ̄B ΨB is a constant. We have here ignored the terms of O(G2 ) as mentioned before. In comparison with the result of Ref. [15],\nthe extra factor |B|2 appears in addition to the first-order\ncorrection in the parentheses in the above equation. The\neffective part of B that contributes to the isotropic power\nspectrum fulfills the following equation:\nḂ\n3iπG X\n0\nsB V̄s γ 0 Vs − sB\n= −P\n5 V̄s γ γ5 Vs\nB\nV̄\nV\ns\ns\ns\ns\n\u0001\n+ψ̄B Vs V̄s γ 0 ψB − ψ̄B γ5 Vs V̄s γ 0 γ5 ψB , (41)\n\nwhich is obtained by multiplying Eq. (30) by δ ψ̄ with\nEq. (34) and evaluating in a vacuum.\nNow we have to determine the mode function Vs and\nB. We here take the Bunch-Davies vacuum as an appropriate initial vacuum state [33], and choose the constants\nin Vs so that Vs coincides with the Minkowski solution\nVs ∝ eikη on sufficiently short scales k → ∞:\n!\n√\n−πkη e−πm/2H Hν(2) (−kη) k*σ\nωs\nk\n,\n(42)\nVs =\n(2)\n2\neπm/2H Hν ∗ (−kη)ω s\nwhere ω s is the constant two-spinor defined by ωαs = δαs .\nWith this choice, in order to solve Eq. (41), we use the\nexplicit background solutions during inflation,\na = a∗ eHt\n\u0012\n\u0013\nφ0 e−imt\nΨB =\n,\nχ0 eimt\n\n3iπ 2 GH 2\nP\n2 s V̄s Vs k 3\n\n\u001a\u0012\n\nwhere 2 F3 (a1 , a2 ; b1 , b2 , b3 ; x) is the regularized hypergeometric function defined by\n2 F3 (a1 , a2 ; b1 , b2 , b3 ; x)\n∞\nX\n\n1\n≡\nΓ(b1 )Γ(b2 )Γ(b3 )\n\nk=0\n\n(44)\n\nwhere φ0 and χ0 are arbitrary constants. P\nMoreover, fortunately, we can make use of the fact that s V̄s Vs is approximately constant with respect\nto z = −kη. P\nRoughly\nP\nspeaking, the relation |d( s V̄s Vs )/dz| ≪ | s V̄s Vs |\nholds for z > 1 and near z = 0 independently of m.\nIn fact, the asymptotic\nformulae of the Hankel functions\nP\nV̄\nV\n∼\n−2(m/H)z −1 for large z and\n[41]\nlead\nto\ns\ns\ns\nP\ns V̄s Vs ∼ −2 tanh(πm/H) for small z. We can safely\nemploy this relation because, as discussed below, we only\nneed to find the asymptotic behavior of |B|2 on large and\nsmall scales. Then Eq. (41) can be integrated to give\n\n\u00132im/H †\nφ0 χ0 z 3\nk\na∗ H\ncosh2 πm\nH\n\u0012\n\u0013\n\u0013\n\u0012\n\u0014\n3\n3\n3\n5\nπm\n2ν\n∗\n2\nz 2 F3\nΓ ν+\n, ν + ; ν + 1, ν + 1, ν + ; −z\n× − i sinh\nH\n2\n2\n2\n2\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013\n\u0012\n−4im/H\n1\n1\n1\n1\n3\nz\n2\nΓ 2ν +\nΓ ν+\n− √\n2 F3 ν + , 2ν + ; ν, 2ν, 2ν + ; −z\nπ\n2\n2\n2\n2\n2\n\u001b\n\u0013\n\u0012\n\u0013\u0015\n\u0012\n1\n3 ∗ 1 5 ∗\n1\n+ Γ ν∗ +\n− h.c. + C2 ,\n, ν + ; , ν , 2ν ∗ ; −z 2\n2 F3\n2\n2\n2\n2 2\n\n|B|2 ≈ 1 +\n\n(43)\n\n(a1 )k (a2 )k xk\n, (46)\n(b1 )k (b2 )k (b3 )k k!\n\nwith the Pochhammer symbol (a)k ≡ Γ(a + k)/Γ(a), and\nwe have dropped the higher-order terms in G. The integration constant C2 should be chosen so that |B|2 → 1\non sufficiently short scales k → ∞. Using the asymptotic\n\n(45)\n\nexpansion of 2 F3 (a1 , a2 ; b1 , b2 , b3 ; x) for |x| → ∞,\n2 F3 (a1 , a2 ; b1 , b2 , b3 ; x)\n\u0010\nc\n\n∼\n\n\u0011\n√\n√\n(−x)\n√\ne−i(πc+2 −x) + ei(πc+2 −x)\n2 πΓ(a1 )Γ(a2 )\nΓ(a2 − a1 )(−x)−a1\n+\nΓ(b1 − a1 )Γ(b2 − a1 )Γ(b3 − a1 )Γ(a2 )\nΓ(a1 − a2 )(−x)−a2\n+\n,\n(47)\nΓ(b1 − a2 )Γ(b2 − a2 )Γ(b3 − a2 )Γ(a1 )\n\n\f7\nwith c = (a1 + a2 − b1 − b2 − b3 + 1/2)/2, we have\nC2\n\n\u0012\n\u0014\n\u00132im/H\nk\nφ†0 χ0 Γ (−ν)\n2πm\n\u0001\n\u0001\n= sech\nH Γ −ν − 12 Γ 21 − 2ν\na∗ H\n\u0012\n\u0013\n−2im/H \u0015\nχ†0 φ0 Γ (−ν ∗ )\nk\n\u0001\n\u0001\n−\n.(48)\na∗ H\nΓ −ν ∗ − 21 Γ 12 − 2ν ∗\n\nby evaluating Eq. (40) on large scales k → 0 with\nEq. (45), in which we can use the asymptotic formula\n−1\nfor x → 0.\n2 F3 (a1 , a2 ; b1 , b2 , b3 ; x) ∼ (Γ(b1 )Γ(b2 )Γ(b3 ))\nSince the observed spectral index at horizon crossing is\ndefined by n − 1 ≡ d ln P/d ln k|k=aH , we subsequently\nestimate P at k = aH. For simplicity, let us here utilize an approximation m/H ≪ 1, which is allowed by the\nflatness of V . Thus we find\n\nThe power spectrum P outside horizon is obtained\n\nP|k=aH\n\n\u0013\n\u0012\n\u0012\nm †\n3\n1\nGH 2 3\n†\nC1 + (φ0 χ0 + χ0 φ0 )\n(3γ + ln 8 − 1) −\n≈ −\nH\n3π\n8\nΨ̄B ΨB 2\n\u0013\n\u001a\n\u0014\n\u0012\n\u0013 \u0012\n2\n2\nm π\n2\n3\nk\n†\n†\n− 2\nC1 + i(φ0 χ0 − χ0 φ0 )\n−\n(3γ + ln 8 − 1) ln\nH\n2\n4 3π\na∗ H\n\u0013\n\u0015\u001b\u0013\n2\n3\n− (3γ + ln 8 − 2) + (2γ + ln 4 − 3)\n,\n9π\n8\n\nwhere γ is Euler's constant, γ ≈ 0.577. Therefore, the\nspectral index is\nm2\nn − 1 = 2 i(φ†0 χ0 − χ†0 φ0 )\nH C1\n\n\u0013\n1\n4\n,\n(3γ + ln 8 − 1) −\n9π\n2\n(50)\nwhich is our final result. It should be emphasized that\nthe k-dependence of P is naturally suppressed by the\ncondition m/H ≪ 1 which follows from the flatness of\nthe potential, and hence that n is nearly equal to 1. We\nalso note that the running index α = dn/d ln k is further\nsuppressed, of the order O(m3 ). Therefore, we are led\nto the conclusion that our Dirac-field model of inflation\ncan predict a nearly scale-invariant spectrum of density\nfluctuations in agreement with the observations.\n\nIV.\n\n\u0012\n\nSUMMARY\n\nWe have shown that the Dirac-field model of inflation\nleads to a nearly scale-invariant spectral index consistent\nwith the observations, by naturally extending the theoretical framework beyond general relativity. It is usually\nbelieved that general relativity does not hold in the very\nearly universe and then should be extended appropriately to high energy physics; the Einstein-Cartan theory\nadopted here is one of such extended theories.\nIn the framework of general relativity, ArmendárizPicón and Greene [15] found that a Dirac field with a flat\npotential can give rise to the de Sitter expansion of the\nuniverse, but concluded that the Dirac field itself cannot\nbe an alternative to the conventional inflaton field as the\nunique source of inflation because the spectral index obtained from density fluctuations of the Dirac field, n = 4,\nis in strong disagreement with the observations. The key\n\n(49)\n\ningredient for improving their result, namely, obtaining\nn ≈ 1, is to introduce a spin-interaction, which naturally\nappears in the Einstein-Cartan theory, into the dynamics\nof the Dirac field that has the inflationary potential.\nBecause of the existence of the spin-interaction, the\nnew terms of the form Gφa φa must be added to both\nthe cosmological background equations and the equation\nof motion for the perturbed field presented in Ref. [15].\nHowever, we have seen that, according to Eq. (23), the\nspin terms in the background equations decrease fast as\nthe universe expands; therefore, during inflation, we can\nignore the effects due to the spin on the background.\nWithout any change in the basic idea that a flat potential\nof a Dirac field leads to an inflationary expansion, we\nhave been able to gain the possibility to solve the problem\nof the spectral index, which is an issue in perturbation\ntheories, not in background dynamics.\nThe spectral index obtained in our model, n = 1 +\nO(m2 ), is nearly scale-invariant by virtue of the flatness\nof the potential, which is similar to the situation in the\nconventional inflaton models. In this regard, so far, the\nDirac-field model does not provide such novel features as\nthe typical inflaton models do not have. However, it is\nimportant to recognize that a Dirac field can drive inflation of the universe. As is well known, the spinor fields\nare indispensable not only in the description of relativistic quantum fields, but also in the context of supersymmetric unification of all fundamental interactions at high\nenergy scales. Therefore, in the construction of realistic\ncosmological models containing various matter fields and\ninteractions between them, attention should be paid to\nthe behavior or properties of the spinor fields that significantly affect the geometry of spacetime and consequently\ncan have a central role in the evolution of the universe.\n\n\f8\nAPPENDIX: EINSTEIN-CARTAN THEORY\n\nFor completeness, in this appendix we briefly review\nthe Einstein-Cartan theory [19]. The Einstein-Cartan\ntheory is a natural extension of Einstein's gravity theory,\nand is one of theories that give a dynamical role to both\nspin and mass of matter.\nThe spacetime in this theory is described by RiemannCartan geometry known as a generalization of Riemann\ngeometry to include torsion. In the Riemann-Cartan geometry, from asymmetric affine connections Γρ μν , the\ncovariant derivative for tensors is defined by ∇ν V μ =\n∂ν V μ + Γμρν V ρ . The connection is constrained by the\nmetricity condition ∇ρ gμν = 0, which is postulated in\norder for a local Minkowski structure to be guaranteed.\nThe curvature tensor is constructed from such connections as\nRρσμν ≡ ∂μ Γρ σν −∂ν Γρ σμ +Γρ λμ Γλσν −Γρ λν Γλσμ . (A.1)\nThe difference from the Riemann geometry is that Γρ μν\nis asymmetric. Actually, if we demand the connection be\nsymmetric, it can be fixed as the well-known Riemannian\nconnection\nΓ̃ρ μν =\n\n1 ρσ\ng (∂ν gσμ + ∂μ gσν − ∂σ gμν ).\n2\n\n(A.2)\n\nThere is, however, no a priori reason that we suppose\nΓρ μν to be symmetric in general. In the Riemann-Cartan\ngeometry, the antisymmetric part is kept as\nC ρμν\n\n≡ 2Γ\n\nρ\n[μν]\n\n≡Γ\n\nρ\n\nμν\n\n−Γ\n\nρ\n\nνμ ,\n\n(A.3)\n\nwhich can be shown to transform as a tensor, a purely geometrical quantity. Since the infinitesimal parallelograms\ndo not close in this spacetime and the closure failure is\nproportional to C ρμν , this tensor serves as the torsion of\nthe spacetime.\nThese geometrical quantities, the curvature and the\ntorsion, can be understood from the local Poincaré gauge\ntheory [19, 21, 42, 43, 44] in which vierbeins eμa and spin\nconnections ωμab are introduced as the gauge fields of the\ntheory. In terms of the gauge fields, we can define the\ntranslational field strength corresponding to the torsion\nas well as the rotational field strength corresponding to\nthe curvature [45].\nFrom the correspondence between a coordinate basis\nand a tetrad, the vierbein satisfies\n∂ν eμa + Γμρν eρa + ων ab eμb = 0.\n\n(A.4)\n\nThe above equation guarantees a conversion ∇μ V ν =\neνa Dμ V a , where Dμ is the Lorentz covariant derivative\nbased on ωμab .\nBy virtue of the metricity condition, Γρ μν can be\ndecomposed into the Riemannian piece and the nonRiemannian piece as\n1\nΓρ μν = Γ̃ρ μν + (C ρμν + Cμν ρ + Cνμρ ),\n2\n\n(A.5)\n\nfrom which it is clear that the connection reduces to the\nRiemannian one when torsion vanishes. Such decomposition holds also for the spin connection with the aid of\nEq. (A.4).\nThe basic field equations of the Einstein-Cartan theory\nare derived from the simplest Lagrangian of a gravitymatter system\nL(eμa , ωμab , φ, ∂μ φ) = −\n\nR\n+Lm (eμa , φ, Dμ φ), (A.6)\n16πG\n\nwhere R ≡ eμa eνb Rabμν is the scalar curvature in the\nRiemann-Cartan spacetime and φ generically represents\nmatter fields minimally coupled to gravity. Here, by making use of the relation (A.4), not only the matter Lagrangian Lm , but also the Einstein-Hilbert Lagrangian\ncan be expressed as a function of eμa and ωμab .\nFor a derivation of the field equations, it is useful to\nadopt the so-called Palatini approach where eμa and ωμab\nare treated as independent variables. Varying the Lagrangian (A.6) with respect to both, one obtains\n1\nGμa ≡ Rμa − eμa R = 8πG Tμa ,\n2\n\n(A.7)\n\n∂Lm\n(Sab )AB φB\n∂Dμ φA\n≡ −16πGS μab ,\n(A.8)\n\nC μab + 2eμ[a C νb]ν = −8πGi\n\nwhere Rμa ≡ eνb Rbaνμ is the asymmetric Ricci tensor and\nSab is the generator of the Lorentz group. (The capital\nindices are spacetime or spinor indices.)\nOne of the resulting equations, Eq. (A.7), is a generalized version of the familiar Einstein equation in the\nsense that the Einstein tensor Gμa which consists of the\nmetric-compatible and asymmetric connection is related\nwith the canonical energy-momentum tensor Tμa . The\nother equation (A.8) exhibits that the spin density S μab\nof matter induce torsion of the spacetime.\nSince the second field equation (A.8) is algebraic, we\ncan substitute everywhere spin for torsion. Then, according to Eq. (A.5), the non-Riemannian part of the covariant derivatives in Lm produces an interaction between\nS μab and φ, called a spin-interaction, in the equation of\nmotion for φ.\nMoreover, Eq. (A.5) can also be applied to splitting\nthe Einstein tensor Gμa defined by Eq. (A.7) into the\nRiemannian piece and the non-Riemannian piece. Therefore, all the terms including the torsion in Eq. (A.7) can\nbe interpreted as a spin correction to the usual, symmetric energy-momentum tensor T̃(μν) through the following\nexpression:\n\u0010\n\u0011\n(spin)\nG̃μν = 8πG T̃(μν) + Tμν\n,\n(A.9)\nwhere G̃μν is the Einstein tensor composed of the Rie(spin)\nmannian connection Γ̃ρ μν . The explicit form of Tμν\nis\n\n\f9\ngiven by\n\u0014\n(spin)\nTμν\n= 8πG Sμρσ Sνρσ + 2S ρμρ S σνσ − 4S (ρσ)μ S(ρσ)ν\n\u0011\u0015\n\u0010\n1\n(ρσ)λ\nρσλ\nσρ\nλ\nS(ρσ)λ − S Sρσλ − 2S σ S ρλ\n+ gμν 4S\n2\n\u0001\n(kin)\n(A.10)\n+2 ∇ρ − 8πGS σρσ S(μν)ρ + T(μν) ,\n(kin)\n\nwhere Tμν arises from the coupling of φ to S μab in the\ncovariantized kinetic terms of Lm .\n\n[1] A. R. Liddle and D. H. Lyth, Cosmological Inflation\nand Large-Scale Structure (Cambridge University Press,\nCambridge, England, 2000).\n[2] E. Komatsu et al. \"Five-Year Wilkinson Microwave\nAnisotropy Probe (WMAP) Observations: Cosmological\nInterpretation\", arXiv: 0803.0547.\n[3] D. N. Spergel et al. Astrophys. J. Suppl. Ser. 170, 377\n(2007).\n[4] D. N. Spergel et al. Astrophys. J. Suppl. Ser. 148, 175\n(2003).\n[5] H. V. Peiris et al. Astrophys. J. Suppl. Ser. 148, 213\n(2003).\n[6] L. Parker, Phys. Rev. D 3, 346 (1971).\n[7] J. Audretsch and G. Schäfer, J. Phys. A: Math. Gen. 11,\n1583 (1978).\n[8] L. P. Chimento and M. S. Mollerach, Phys. Rev. D 34,\n3689 (1986).\n[9] C. J. Isham and J. E. Nelson, Phys. Rev. D 10, 3226\n(1974).\n[10] T. Christodoulakis and J. Zanelli, Phys. Rev D 29, 2738\n(1984).\n[11] A. O. Barut and I. H. Duru, Phys. Rev. D 36, 3705\n(1987).\n[12] M. Kovalyov and M. Légaré, J. Math. Phys. 31, 191\n(1990).\n[13] M. O. Ribas, F. P. Devecchi, and G. M. Kremer, Phys.\nRev. D 72, 123502 (2005).\n[14] B. Saha, Phys. Rev. D 74, 124030 (2006).\n[15] C. Armendáriz-Picón and P. B. Greene, Gen. Relativ.\nGravit. 35, 1637 (2003).\n[16] L. H. Ford, Phys. Rev. D 40, 967 (1989).\n[17] A. Golovnev, V. Mukhanov, and V. Vanchurin, JCAP\n0806, 009 (2008).\n[18] C. G. Böhmer, Phys. Rev. D 77, 123535 (2008).\n[19] F. W. Hehl, P. von der Heyde, G. D. Kerlick, and\nJ. M. Nester, Rev. Mod. Phys. 48, 393 (1976).\n[20] F. W. Hehl, J. D. McCrea, E. W. Mielke, and\nY. Ne'eman, Phys. Rep. 258, 1 (1995).\n[21] R. T. Hammond, Rep. Prog. Phys. 65, 599 (2002).\n\nThe Einstein-Cartan theory is constructed in this way.\nSince, as can be seen from the above equation, the spin\nsquares contribute to the energy-momentum in the form\nproportional to G, the predictions of the Einstein-Cartan\ntheory deviate from those of general relativity only when\nthe matter fields are coupled to gravity at high energy\nscales. Therefore, it is reasonable to take the EinsteinCartan theory as a suitable framework for considering\nearly stages of the universe, in which general relativity is\nusually not believed to be valid.\n\n[22] D. Puetzfeld, New Astron. Rev. 49, 59 (2005), and references therein.\n[23] F. W. Hehl, P. von der Heyde, and G. D. Kerlick, Phys.\nRev. D 10, 1066 (1974).\n[24] G. D. Kerlick, Ann. Phys. 99, 127 (1976).\n[25] M. Gasperini, Phys. Rev. Lett. 56, 2873 (1986).\n[26] A. J. Fennelly, J. C. Bradas, and L. L. Smalley, Phys.\nLett. A 129, 195 (1988).\n[27] M. J. D. Assad and P. S. Letelier, Phys. Lett. A 145, 74\n(1990).\n[28] Y. N. Obukhov, Phys. Lett. A 182, 214 (1993).\n[29] J. R. Ray and L. L. Smalley, Phys. Rev. D 27, 1383\n(1983).\n[30] M. Mohseni, Phys. Lett. B 663 165 (2008).\n[31] M. Szydlowski and A. Krawiec, Phys. Rev. D 70, 043510\n(2004).\n[32] S. Weinberg, Gravitation and Cosmology (Wiley, New\nYork, 1972).\n[33] N. D. Birrell and P. C. W. Davies, Quantum Fields in\nCurved Space (Cambridge University Press, Cambridge,\nEngland, 1982).\n[34] P. van Nieuwenhuizen, Phys. Rep. 68, 189 (1981).\n[35] H. P. Nilles, Phys. Rep. 110, 1 (1984).\n[36] S. Weinberg, Cosmology (Oxford University Press, New\nYork, 2008).\n[37] H. Kodama and M. Sasaki, Prog. Theor. Phys. Suppl.\n78, 1 (1984).\n[38] M. Sasaki, Prog. Theor. Phys. 76, 1036 (1986).\n[39] V. F. Mukhanov, H. A. Feldman, and R. H. Brandenberger, Phys. Rep. 215, 203 (1992).\n[40] D. Wands, K. A. Malik, D. H. Lyth, and A. R. Liddle,\nPhys. Rev. D 62, 043527 (2000).\n[41] M. Abramowitz and I. A. Stegun, Handbook of Mathematical Functions (Dover, New York, 1965).\n[42] R. Utiyama, Phys. Rev. 101, 1597 (1956).\n[43] T. W. B. Kibble, J. Math. Phys. 2, 212 (1961).\n[44] D. W. Sciama, Rev. Mod. Phys. 36, 463 (1964).\n[45] F. W. Hehl, Found. Phys. 15, 451 (1985).\n\n\f"}