{"id": "http://arxiv.org/abs/1107.0459v3", "guidislink": true, "updated": "2012-05-29T05:18:22Z", "updated_parsed": [2012, 5, 29, 5, 18, 22, 1, 150, 0], "published": "2011-07-03T13:19:44Z", "published_parsed": [2011, 7, 3, 13, 19, 44, 6, 184, 0], "title": "Theory of water and charged liquid bridges", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3147%2C1107.5466%2C1107.1672%2C1107.0466%2C1107.0278%2C1107.3974%2C1107.2376%2C1107.0697%2C1107.2137%2C1107.2615%2C1107.3456%2C1107.1335%2C1107.0950%2C1107.5274%2C1107.2797%2C1107.3521%2C1107.5863%2C1107.0943%2C1107.2205%2C1107.2124%2C1107.3306%2C1107.3318%2C1107.0582%2C1107.0349%2C1107.4174%2C1107.2903%2C1107.4003%2C1107.3254%2C1107.0078%2C1107.1227%2C1107.1319%2C1107.2352%2C1107.4842%2C1107.4171%2C1107.5835%2C1107.5977%2C1107.3021%2C1107.4409%2C1107.3234%2C1107.0936%2C1107.5615%2C1107.2741%2C1107.2222%2C1107.2555%2C1107.5185%2C1107.2157%2C1107.5872%2C1107.3089%2C1107.4765%2C1107.0908%2C1107.5929%2C1107.0459%2C1107.0518%2C1107.5186%2C1107.5890%2C1107.0094%2C1107.0675%2C1107.3423%2C1107.3098%2C1107.1793%2C1107.4528%2C1107.1733%2C1107.5546%2C1107.4703%2C1107.5479%2C1107.1574%2C1107.1323%2C1107.5491%2C1107.2816%2C1107.1706%2C1107.3942%2C1107.2304%2C1107.0127%2C1107.5056%2C1107.2759%2C1107.0860%2C1107.5829%2C1107.5336%2C1107.5744%2C1107.5299%2C1107.3956%2C1107.1775%2C1107.0869%2C1107.0589%2C1107.4446%2C1107.4166%2C1107.1050%2C1107.0450%2C1107.0113%2C1107.4393%2C1107.1000%2C1107.2140%2C1107.3900%2C1107.1627%2C1107.3362%2C1107.4401%2C1107.4159%2C1107.1232%2C1107.2625%2C1107.3999%2C1107.5516&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Theory of water and charged liquid bridges"}, "summary": "The phenomena of liquid bridge formation due to an applied electric field is\ninvestigated. A new solution for the charged catenary is presented which allows\nto determine the static and dynamical stability conditions where charged liquid\nbridges are possible. The creeping height, the bridge radius and length as well\nas the shape of the bridge is calculated showing an asymmetric profile in\nagreement with observations. The flow profile is calculated from the Navier\nStokes equation leading to a mean velocity which combines charge transport with\nneutral mass flow and which describes recent experiments on water bridges.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3147%2C1107.5466%2C1107.1672%2C1107.0466%2C1107.0278%2C1107.3974%2C1107.2376%2C1107.0697%2C1107.2137%2C1107.2615%2C1107.3456%2C1107.1335%2C1107.0950%2C1107.5274%2C1107.2797%2C1107.3521%2C1107.5863%2C1107.0943%2C1107.2205%2C1107.2124%2C1107.3306%2C1107.3318%2C1107.0582%2C1107.0349%2C1107.4174%2C1107.2903%2C1107.4003%2C1107.3254%2C1107.0078%2C1107.1227%2C1107.1319%2C1107.2352%2C1107.4842%2C1107.4171%2C1107.5835%2C1107.5977%2C1107.3021%2C1107.4409%2C1107.3234%2C1107.0936%2C1107.5615%2C1107.2741%2C1107.2222%2C1107.2555%2C1107.5185%2C1107.2157%2C1107.5872%2C1107.3089%2C1107.4765%2C1107.0908%2C1107.5929%2C1107.0459%2C1107.0518%2C1107.5186%2C1107.5890%2C1107.0094%2C1107.0675%2C1107.3423%2C1107.3098%2C1107.1793%2C1107.4528%2C1107.1733%2C1107.5546%2C1107.4703%2C1107.5479%2C1107.1574%2C1107.1323%2C1107.5491%2C1107.2816%2C1107.1706%2C1107.3942%2C1107.2304%2C1107.0127%2C1107.5056%2C1107.2759%2C1107.0860%2C1107.5829%2C1107.5336%2C1107.5744%2C1107.5299%2C1107.3956%2C1107.1775%2C1107.0869%2C1107.0589%2C1107.4446%2C1107.4166%2C1107.1050%2C1107.0450%2C1107.0113%2C1107.4393%2C1107.1000%2C1107.2140%2C1107.3900%2C1107.1627%2C1107.3362%2C1107.4401%2C1107.4159%2C1107.1232%2C1107.2625%2C1107.3999%2C1107.5516&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The phenomena of liquid bridge formation due to an applied electric field is\ninvestigated. A new solution for the charged catenary is presented which allows\nto determine the static and dynamical stability conditions where charged liquid\nbridges are possible. The creeping height, the bridge radius and length as well\nas the shape of the bridge is calculated showing an asymmetric profile in\nagreement with observations. The flow profile is calculated from the Navier\nStokes equation leading to a mean velocity which combines charge transport with\nneutral mass flow and which describes recent experiments on water bridges."}, "authors": ["Klaus Morawetz"], "author_detail": {"name": "Klaus Morawetz"}, "author": "Klaus Morawetz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.86.026302", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.0459v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.0459v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages 12 figures, misprints corrected, assumptions more\n  transparent", "arxiv_primary_category": {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.0459v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.0459v3", "journal_reference": "Phys. Rev. E86 (2012) 026302-1-9 errata: Phys. Rev. E86 (2012)\n  069904-1", "doi": "10.1103/PhysRevE.86.026302", "fulltext": "Theory of water and charged liquid bridges\nK. Morawetz1,2,3\n1\n\narXiv:1107.0459v3 [physics.class-ph] 29 May 2012\n\nMünster University of Applied Science, Stegerwaldstrasse 39, 48565 Steinfurt, Germany\n2\nInternational Institute of Physics (IIP) Federal University of Rio Grande\ndo Norte Av. Odilon Gomes de Lima 1722, 59078-400 Natal, Brazil and\n3\nMax-Planck-Institute for the Physics of Complex Systems, 01187 Dresden, Germany\n\nThe phenomena of liquid bridge formation due to an applied electric field is investigated. A new\nsolution of a charged catenary is presented which allows to determine the static and dynamical\nstability conditions where charged liquid bridges are possible. The creeping height, the bridge\nradius and length as well as the shape of the bridge is calculated showing an asymmetric profile in\nagreement with observations. The flow profile is calculated from the Navier Stokes equation leading\nto a mean velocity which combines charge transport with neutral mass flow and which describes\nrecent experiments on water bridges.\nPACS numbers: 05.60.Cd, 47.57.jd,47.65.-d, 83.80.Gv,\n\nI.\nA.\n\nINTRODUCTION\nThe phenomenon\n\nThe formation of a water bridge between two beakers\nunder high voltage is a phenomenon known since over 100\nyears [1]. When two vessels brought in close contact and\na high electric field is applied between the vessels, the\nwater starts creeping up the beakers and forms a bridge\nwhich is maintained over a certain distance as schematically illustrated in figure 1. Due to the voltage applied\nby the vessels the electric field is longitudinally oriented\ninside the cylindrical bridge. It has remained attractive\nto current experimental activities [2, 3]. On the one side\nthe properties of water are such complex that a complete\nmicroscopic theory of this effect is still lacking. On the\nother side the formation of water bridges on nanoscales\nare of interest both for fundamental understanding of\nelectrohydrodynamics and for applications ranging from\natomic force microscopy [4] to electrowetting problems\n[5]. Microscopically the nanoscale wetting is important\nto confine chemical reactions [6] which reveals an interesting interplay between field-induced polarization, surface\ntension, and condensation [7, 8].\nMolecular dynamical simulations have been performed\nin order to explore the mechanism of water bridges at\nz\nf(x)\nzmax\n\nL\nR\n\nx\n\nFIG. 1: The schematic picture of water bridge between two\nbeakers.\n\nthe molecular level leading to the formation of aligned\ndipolar filaments between the boundaries of nanoscale\nconfinements [9]. A competition was found of orientation of molecular dipoles and the electric field leading\nto a threshold where the rise of a pillar overcomes the\nsurface tension [8]. In this respect the understanding of\nthe microscopic structure is essential to explain such phenomena in micro-fluidics [10]. The problem is connected\nwith the dynamics of charged liquids which is important\nfor capillary jets [11], current applications in ink printers\nand electrosprays [12, 13]. Consequently the nonlinear\ndynamics of breakup of free surfaces and flows has been\nstudied intensively [14, 15].\nMuch physical insight can be gained already on the\nmacroscopic scale, where the phenomena of liquid bridging is not restricted to water but can be observed in\nother liquids too [16] which shows that it has its origin\nin electrohydrodynamics [17] rather then in molecularspecific structures. The traditional treatment is based\non the Maxwell pressure tensor where the electric field\neffects comes from the ponderomotoric forces and due\nto boundary conditions of electrodynamics [18]. This\nis based exclusively on the fact that bulk-charge states\ndecay on a time scale of the dielectric constant divided\nby the conductivity, ǫǫ0 /σ, which takes for pure water\n0.14ms. This decay-time of bulk charges follows from\nthe continuity of charge density ρ̇c = −∇ * j combined\nwith Ohm's law j = σE = −σ∇φ where the source of the\nelectric field is given by the potential ∇2 φ = −ρc /ǫǫ0 .\nAn overview about the different forces occurring in microelectrode structures are discussed in [19].\nThis simple Ohm picture leads to a problem in partially charged liquids. Following the Ohm picture one\nhas a constant velocity or current density of charged particles caused by the external field and limited by friction.\nContrary, for incompressible fluids the total mass flux\ncannot be constant but is dependent on the area where\nit is forced to flow through. Both pictures seem to be impossible to reconcile. Here in this paper we will present\na discussion of this seemingly contradiction leading to a\ndynamical stability criterion for the water bridge and a\n\n\f2\ncombined flow expression. This is in line with the idea\nof [17] where the bulk charges have been assumed to be\nrealized in a surface sheet. While there the migration\nof charges to the surface has been considered forming a\ncharged surface sheet, we adopt here the view point of homogeneously distributed bulk charges which flow in field\ndirection rather than forming a surface sheet.\nIn the absence of bulk charges the forces on the water\nstream are caused by the pressure due to the polarizability of water described by the high dielectric susceptibility ǫ. This pressure leads to the catenary form of water\nbridge like a hanging chain [20]. While already the simplified model of [16] employing a capacitor picture leads\nto a critical field strength for the formation of the water\nbridge, the catenary model [20] has not been reported\nto yield such a critical field. In this paper we will show\nthat even the uncharged catenary provides indeed a minimal critical field strength for the water bridge formation\nin dependence on the length of the bridge. This critical field strength is modified if charges are present in the\nbridge which we will discuss here with the help of a new\ncharged catenary solution. This allows us to explain the\nasymmetry found in the bridge profile [3].\n\nB.\n\nOverview about the paper\n\nThe scenario of water or other dielectric bridges is\nthought as follows. Applying an electric field parallel\nto two attached vessels the water creeps up the beaker\nand form a bridge as it is nicely observed and pictured\nin [2]. This bridge can be elongated up to a critical field\nstrength and it forms a catenary which becomes asymmetric for higher gravitation to electric field ratios [3].\nThe critical value for stability is sensitively dependent\non ion concentrations breaking off already at very low\nconcentrations. The amount of mass flow through the\nbridge does not follow simple Ohmic transport as we will\nsee in this paper. The schematic picture of the water\nbridge is given in figure 1.\nIn this paper we want to advocate the following picture. Imaging a snapshot of the charges flowing through\nthe bridge we cannot decide whether the observed charges\nare due to static bulk charges or due to the floating motion of Ohmic bulk charges. This flow of charges within\nthe liquid bridge we can associate with a dynamical bulk\ncharge in the mass motion which is not covered by the\ndecay of Ohmic bulk charges discussed above. Such a\npicture is supported by the experimental observation of\npossible copper ion motion [21] and by the observation\nthat the water bridge is highly sensitive to additional external electric fields [22]. Strong fields even create small\ncone jets [2]. This dynamical bulk charge will lead us\nto the necessity to solve the catenary problem including\nbulk charges. Though charged membranes have been discussed in the literature [23], a new analytical solution of\nthe charged catenary is discussed in this paper.\nThe picture of Ohmic resistors and capacitor as de-\n\ndensity\ndielectric susceptibility\nsurface tension\nviscosity\nconductivity of\nclean water\nmolecular conductivity\nof NaCl\nheat capacity\n\nρ\nǫ\nσs\nη\n\n=\n=\n=\n=\n\nσ0 =\n\n103 kg/m3\n81\n7.27×10−2 N/m\n1.5×10−3 Ns/m2\n5×10−6 A/Vm\n\nλ = 12.6×10−3 Am2 /Vmol\ncp =\n4.187 J/gK\n\nTABLE I: Variables and parameters used within this paper\nfor water.\n\nscribed above is not sufficient, as one can see from the\nobservation that adding a small amount of electrolytes to\nthe clean water destroys the water bridge almost immediately. In other words good conducting liquids should\nnot form a water bridge. We will derive an upper bound\nfor charges possibly carried in water in order to remain in\nstable liquid bridges. Though we present all calculations\nfor water parameters summarized in table I, the theory\napplies as well to any dielectric liquid in electric fields.\nFour theoretical questions have to be answered: (i)\nHow is the electric field influencing the height zmax water can creep up? (ii) What is the radius R(x) along the\nbridge? (iii) What is the form z = f (x) of the water\nbridge? What are the static constraints on the bridge?\n(iv) Which dynamical constraints can be found for possible bridge formation?\nWe will address all four questions with the help of four\nparameters composed of the properties summarized in\ntable I of water. The first one is the capillary height\nr\n2σs\na=\n= 3.8 mm\n(1)\nρg\nwith the surface tension σs , the particle density ρ and\nthe gravitational acceleration g. The second parameter is\nthe water column height balancing the dielectric pressure\ncalled creeping height in the following\nb(E) =\n\nǫ0 (ǫ − 1)E 2\n= 7.22Ē 2 cm\nρg\n\n(2)\n\nwhere the dimensionless electric field Ē is in units of\n104 V/cm. The third one is the dimensionless ratio of\nthe force density on the charges by the field to the gravitational force density\nc(ρc , E) =\n\nρc E\n= 15.97Ē ρ̄c\nρg\n\n(3)\n\nwhere the charge density ρ̄c is in units of ng/l. For dynamical consideration the characteristic velocity\nu0 =\n\nρga2\n≈ 3.02m/s\n32η\n\n(4)\n\nwill be useful as the fourth parameter.\nThe outline of the paper is as follows. In the next section we repeat shortly the standard treatment of creeping\n\n\f3\nheight and bubble radius of a liquid but add the pressure\nby the external electric field on the dielectric liquid. Then\nwe present the form of the bridge in terms of a new solution of the catenary equation due to bulk charges in\nsection IV. In section V we present the flow calculation\nproposing the picture of moving charged particles due to\nthe field which drag the neutral particles. This will lead\nto a dynamical stability criterion. Then we compare with\nthe experimental data and show the superiority of the\npresent treatment. Summary and conclusion ends up the\ndiscussion in section VI.\nII.\n\nz\nE\n\nz max α\nθ\n\nx\n\nANSWER TO QUESTION (I): CREEPING\nHEIGHT AND (II): RADIUS OF BRIDGE\n\nWe start to calculate the possible creeping height and\nuse the pressure tensor for dielectric media [18]\n\u0012\n\u0013\n1\n1\n1\nik\nσ = −pδik −σs\n+\n+ǫǫ0 Ei Ek − ǫ̃ǫ0 E 2 δik (5)\nR1 R2\n2\nwhere p is the pressure in the system, R1 , R2 the principal\nradii of curvature such that the second term on the right\nhand side describe the contribution due to surface tension\nand the last terms are the parts due to the forces in the\ndielectric medium. We assume a density-homogeneous\nliquid such that for the dielectric susceptibility ǫ̃ = ǫ −\nρ(dǫ/dρ)T ≈ ǫ. Further we consider first the stationary\nproblem which means that viscous forces can be neglected\nin (5).\nDenoting the components of the normal vector by ek ,\nthe stability condition between water (W) and air (A) is\ngiven by\nik k\ne(A)\nσ(A)\n\n=\n\nk\nik\n−σ(W\n) e(W )\n\n=\n\nik k\ne(W ) .\n−σ(A)\n\n(6)\n\nSince the principal curvature of the tube is much larger\nradially than parallel, we have R2 ∼ ∞ and denoting\nthe coordinate in the direction of the height with z, the\npressure difference between water and air is pW − pL =\nρgz. We employ the boundary conditions for the normal\nE n and tangential E t components of the electric field\nn\nn\n= ǫE(W\nE(A)\n) = ǫEn ,\n\nt\nt\n= E(W\nE(A)\n) = Et .\n\n(7)\n\nand the balance (6) with (5) reads\nρgz +\n\nσs\n1\n= ǫ0 (ǫ − 1)(ǫEn2 + Et2 ).\nR1\n2\n\n(8)\n\nPlease note that due to the migration of charges to the\nsurface one should consider a surface charge here in principle. We adopt thorough the paper the simplified picture that the charges remain bulk-like due to the preferred motion along the field and no surface charges are\nformed. The influence of such surface charges is considered as marginal since the curvature of the bridge is\nminimal leading to preferential tangential components of\nelectric fields.\n\nFIG. 2: The schematic picture of water bridge creeping up\nthe vessel due to the applied electric field.\n\nWe assume the electric field in x-direction such that\nEt = −E cos α, En = E sin α where z ′ (x) = tan α is the\nincrease of the surface line of the water as illustrated in\nfigure 2. Using the parameters (1) and (2) we obtain\nfrom the stability condition (8) the differential equation\n2z − a2\n\nz ′′\nǫ0 (ǫ − 1)\n(ǫEn2 + Et2 ) ≈ b\n=\n′2\n3/2\nρg\n(1 + z )\n\n(9)\n\nwhere we used the approximation of small normal electric\nfields justified if there are no surface charges. This shows\nthe modification of the standard treatment of capillary\nheight by the applied field condensed on the right hand\nside. The first integral of (9) is\n1\nbz\nz2\n+√\n− 2 =1\n2\n′2\na\na\n1+z\n\n(10)\n\nand we have used the condition that for x → ∞ the surface is z = z ′ = 0. The explicit solution of the surface\ncurve z(x) is quite lengthy and not necessary here. Instead we can give directly the maximally reachable height\nin dependence on the electric field. Therefore we use the\nangle θ = 90 − α of the liquid surface with the wall such\nthat z ′ (x) = − cot θ and from (10) we obtain\nr\nr\nb2\nb2\nb\nb\nz= +\n+a2 (1−sin θ) ≤ +\n+a2 = zmax (11)\n2\n4\n2\n4\nwhich shows that without electric field the maximal\ncreeping height is just the capillary length (1) as it is\nwell known. The other extreme of very high fields leads\nto the field-dependent length (2) which justifies the name\ncreeping height. This answers the first question concerning creep heights.\nThe second question, how large the radius of the bridge\nis, one finds by equating the pressure due to surface tension with the gravitational force density\nσs\n= ρgz ≈ ρg2R\nR\n\n(12)\n\n\f4\nsuch that the radius of the water bridge is at the beaker\nR ≈ a/2.\n\n(13)\n\nWithout using this approximation we could express the\ncurvature again by differential expressions in z(x) defining a radial profile, as it can be found in text books [18].\nThe radius of the bridge at the beaker is nearly independent on the applied electric field but only dependent on\nthe surface tension and gravitational force. Along the\nbridge the radius will change with the applied electric\nfield as we will see later in section IV.C.\n\nB.\n\nStatic stability criteria\n\nWithout dynamical bulk charges, c = 0, d = 1, the\nsolution (15) is just the well known catenary [20]. The\nboundary condition (17) reads in this case\n2b\n2ξ\nL\n=\ncosh\n≥ ξc = 1.5088...\nL\nL\n2ξ\n\nwhich means that without bulk charges the condition for\na stable bridge is\nb>\n\nIII.\n\nANSWER TO QUESTION (III): LIQUID\nBRIDGE SHAPE\nA.\n\nCharged catenary\n\nNow we turn to the question which form the water\nbridge will take. Therefore we consider the center of\nmass line of the bridge being described by z = f (x)\nwith the ends at f (0) = f (L) = 0. The force densities are\np multiplied with the area and the length element\nds = 1 + f ′2 dx to form the free energy. We have the\ngravitational force densityρgf and the volume tension\nρgb as well as the force density by dynamical charges\nρc Ex which contributes. The surface tension is negligible here. The form of the bridge will be then determined\nby the extreme value of the free energy\nZL\n0\n\nF (x)dx = ρg\n\nZL\n0\n\np\n(f (x) + b − cx) 1 + f ′2 dx → extr.\n\n(14)\n\nwhere c is given by (3) and b defined in (2).\nAs shown in [24] and shortly outlines in appendix A\nthe solution can be represented parametrically as\n\u0013\n\u0012 \u0013\u0015\u001b\n\u001a\n\u0014\n\u0012\nLd\nt Ld\n1\n−cosh\nc\nt+ξ\ncosh\n−\n2\n1+c\nξ 2ξ\n2ξ\nx(t) = t − cf (t),\nt ∈ (0, L).\n(15)\n\nf (t) =\n\n(18)\n\n1\nLξc .\n2\n\n(19)\n\nTogether with (2) this condition provides a lower bound\nfor the electric field in order to enable a bridge of length\nL. This lower bound for an applied field appears obviously already for the standard catenary and has been not\ndiscussed so far.\nLets now return to the more involved case of bulk\ncharges and the new solution of charged catenary (15).\nThe field-dependent lower bound condition (17) is plotted in figure 3. One see that in order to complete (17)\nthe bulk charge parameter c has to be lower than the\nmaximal value of cm which reads\nc ≤ cm (ξ0 , b)\n\n(20)\n\nand which is plotted in the inset of figure 3. Remembering the definition of the bulk charge parameter (3) we\nsee that (20) sets an upper bound for the bulk charge in\ndependence on the electric field. The lower bound (19) of\nthe electric field for the case of no bulk charges is obeyed\nas well since the curve in the inset of figure 3 starts at\nb > Lξc /2 which is the lower bound already present for\nuncharged catenaries (19).\nThis completes the third question concerning static\nstability of the bridge. We have found a new catenary\nsolution even for bulk charges in the bridge.\n\nIV. ANSWER TO QUESTION (IV):\nDYNAMICAL CONSIDERATION\nA.\n\nMass flow of the bridge\n\nwith\nξ\nb\nd = 2 arcosh\nL\nξ\n\n(16)\n\nand ξ to be the solution of the equation\nc = cm (ξ, b)\nL\n2ξ\ncm (ξ, b) = − sinh\nL\n2ξ\n\nb\nL\nsinh −\nξ\n2ξ\n\ns\n\nL\nb2\n− 1 cosh\nξ2\n2ξ\n\n!\n\n.\n\n(17)\n\nWe consider now the actual motion of the liquid in\nthe bridge. Here we want to propose the picture that\npossible charges in the water will move according to the\napplied electric field and will drag water particles such\nthat a mean mass motion starts. Due to the low Reynolds\nnumbers (40-100) for water we can consider the motion\nas laminar and we can neglect the convection term u∇u\nin the Navier Stokes equation [25] which reads then for\nthe stationary case\nη∇2 u − ∇p + ρc E = 0.\n\n(21)\n\n\f5\n\n100\nL=1cm\n\n2\n\nI [ml/s]\n\n0\n1,5\n\n-2\ncm(ξ0,b)\n\ncm(ξ,b)\n\nL=2cm\n\n80\n\n-4\n\n1\n\nρc=0 ng/l\nρc=1 ng/l\n\n60\n\n40\n\n0,5\n\n20\n\n-6\n\n2b/L = ξc\n2b/L = ξc+2\n2b/L = ξc+4\n\n-8\n-10\n0\n\n0,2\n\n0\n\n0,8\n\n1 1,2 1,4 1,6 1,8\nb[L]\n\n0\n0\n\n0,4\n\nξ[L]\n\nb\nǫ0 (ǫ − 1)E 2\n=\nρg.\n2L\n2L\n\n(22)\n\nHere we can adopt the stationary pressure since the viscous pressure is accounted for by the Navier-Stoke equation. Assuming that the flow in the bridge has only a\ntransverse component which is radial dependent, u(r),\nwe can write the Navier Stokes equation (21) as\n\u0012\n\u0013\n\u0012\n\u0013\nη d\ndu\nb\nr\n+r\n+c =0\n(23)\nρg dr\ndr\n2L\nwith the resulting velocity profile in the direction of the\nbridge\n\u0012\n\u0013\n\u0013\u0012\nb\nr2\nu(r) − u(R) = 2u0\n(24)\n+c\n1− 2\n2L\nR\nwhere R is the radius of the bridge and we have introduced the characteristic velocity (4). Please note that\nwe keep the undetermined velocity at the surface of the\nbridge u(R). We will assume in the follwoing that it is\nnegligible. The resulting profile (24) has the form of a\nPoiseullie flow but with an interplay between forces due\nto bulk charges and dielectric pressure in relation to gravity.\nThe mean current relative to the surface motion is easily calculated\n\nI = 2πρ\n\n0\n\n3\n\n4\n\n5\n\n0,6\n\nThe gradient of the electric pressure (8) can be given in\nthe direction of the bridge by\n\nZR\n\n2\nE [kV/cm]\n\nFIG. 3: The upper critical bound for the parameter c according to (17). The inset shows the maximum in dependence on\nthe creeping parameter b.\n\n− ∇p =\n\n1\n\ndrr[u(r) − u(R)] ≡ ρvπR2\n\n(25)\n\nFIG. 4: The mean mass current through the bridge in dependence on the electric field and for two different bulk charge\ndensities. The thick lines are for a bridge length of 1cm and\nthe thin lines for the corresponding length of 2cm. The minimal field strength for stability (19) are indicated by corresponding vertical lines.\n\nproviding the mean velocity of the bridge from (24) as\n\u0012\n\u0013\nb\nv = u0\n+c .\n(26)\n2L\nOne sees that the ratio of the field-dependent creeping\nheight (2) to the bridge length determines the mean velocity together with possible dynamical bulk charges described by (3). Since we have presently no good control\nover the surface velocity u(R) we approximate it in the\nfollowing as zero.\nPlease note that the bulk charge transport described\nby (3) leads to Ohmic behavior and the neutral particle\ntransport due to dielectric pressure leads to a quadratic\nfield dependence condensed in (2). The formula (26)\ncombines the effect of charge transport and neutral particle mass transport. It answers the problem raised in\nthe introduction how the two pictures can be brought\ntogether, the one of an incompressible fluids where the\nvelocity is dependent of the area and the one of Ohmic\ntransport where the velocity is only dependent on the\nelectric field.\nThe resulting total mass current is given in figure 4.\nThe current increases basically with the square of the\napplied field scaled by the bridge length. For additional\nbulk densities the mass flow is higher.\n\nB.\n\nComparison with the experiment\n\nTo convince the reader about the validity of the velocity formula (26) we compare now with the mass flow and\nthe charge flow measurements. The experimental values\nof Figure 4 in [2] are reported to be 40mg/s for a bridge\n\n\f6\nU@kVD\n14\n13\n\nU@kVD\n20\nHOhmic 1013 ΡcL\n18\n\nI=40ml\u0090s\n\nI=0.5 mA\n\n12\n16\n11\n14\n10\n12\n\n9\n\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nΡc@ng\u0090lD\n\nFIG. 5: The necessary applied voltage versus bulk charge\ndensities in order to maintain a mass current of 40ml/s. Following [2] the length of the bridge was L = 1cm and the\ndiameter 2.5mm. The result using the flow expression (26) of\nthe present paper (solid line) is compared to an Ohmic transport (dashed line). For the latter one the bulk charge has\nbeen multiplied with 13 orders of magnitude.\n\nof 1cm length, a diameter of 2.5mm for the stationary\nregime. For this situation we compare in figure 5 the\nresults obtained from (26) with a pure Ohmic transport\nusing the lowest-order conductivity expression\nρc\nσ=λ\n+ σ0\neNA\n\n(27)\n\nwhere for clean water the conductivity is σ0 , λ is the\nmolecular conductivity of the solved charge (electrolyte),\nand NA the Avogadro constant, see table I. We see that\nour formula (26) leads to a realistic necessary voltage which was 12.5kV in the experiment - even if no bulk\ncharge is presented. In contrast, for the Ohmic transport\none has to assume 13 orders of magnitude higher bulk\ncharges to come into the same range. This illustrates the\nadvantage of the here presented model.\nConsidering the charge transport we do not expect\nsuch big differences of our model to the pure Ohmic picture since the charged particles matters. To this end we\ncompare the applied voltage versus bridge length with\na constant charge current as it was given in figure 6 of\n[2]. In figure 6 we compare the result from (26) with the\npure Ohmic transport. We use a bulk charge of 2.3ng/l.\nIn order to obtain a comparable Ohmic result we had to\nmultiply the bulk charge with a factor of 3 × 103 which illustrates the difference between our model and the Ohmic\ntransport.\nWhile the difference in charge transport is not very\nsignificant provided the fact that the conductivity of water varies in the order of 3 magnitudes, the mass flow of\nfigure 5 has shown that our result here with (26) is superior since it considers the drag of neutral particles due\nto dielectric pressure together with the charge transport.\nHaving the current at hand one estimates the Joule\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nL@mmD\n16\n\nFIG. 6: The necessary applied voltage versus bridge length\nin order to maintain a charge current of 0.5mA. The data are\nfrom figure 6 of [2]. The result using the flow expression (26)\nand a bulk charge of 2.3ng/l (solid line) is compared to an\nOhmic transport (dashed line). For the Ohmic transport the\nbulk charge has been multiplied with a factor of 3 × 103 . The\nsame offset of U0 = 8kV is used as in the experiments.\n\nheating easily as\njE\n∆T\n.\n=\n∆t\nρcp\n\n(28)\n\nFrom figure 5 of [2] one sees that the reported increase\nof 10K in 30min would translate into field strengths of\n0.7kV/cm in our calculation. This is much lower than\nour result. We would obtain here 2-3 orders of magnitude higher heating rates. Please note that the cooling\nmechanisms like evaporating and cooling due to water\nflow is beyond the present consideration. Since these are\nprobably the major cooling effects in the experiments [26]\nwe cannot compare seriously the theoretical heating rate\nwith the experimentally observed ones.\nC.\n\nProfile of bridge\n\nLet us now calculate the profile of the bridge along\nthe length. We consider to this end the total mass flow\nof the bridge and neglect the viscous term compared to\nthe kinetic energy (which includes part of the convection\nterm), u∇u = 12 ∇u2 + curlu × u ≈ 21 ∇u2 . Then one\narrives at the Bernoulli equation\nρ\n\n1\n1\nv2\nv(x)2\n+ρgf (x)+σs (\n)−ρc Ex = ρ +σs . (29)\n2\nR(x)\n2\nR\n\nHere we have neglected the curvature of the bridge compared to the curvature due to the radius and have compared the position-dependent radius R(x) and velocity v(x) in the bridge with the situation at the beaker\n(x = 0). The Bernoulli equation (29) can be rewritten in\nterms of the capillary height (1) and the velocity (26) as\nf (x) − cx =\n\na2\nv 2 − v 2 (x)\n+a−\n2g\n2R(x)\n\n(30)\n\n\f7\nwhich determines the radius R(x) from the profile of the\nbridge (15) and the velocity v(x) if we observe the current\nconservation through an area\n\nThe results are presented figures 7 and 8. We plot the\nshape of the bridge, the radius and the velocity together\nwith a 3D plot. The case of no bulk charges which leads\nto the standard catenary can be found in figure 7 and\nfigure 7 shows the situation for extreme bulk charges almost at the stability edge (20). We see a deformation of\nthe catenary due to the applied field. This deformation\nis observed, e.g. if an additional field is brought near\nthe bridge [2, 22]. One sees that the radius is becoming smaller at one end of the bridge accompanied with\nhigher velocities as it is known from falling water pipes\n[27]. The bulk charge leads to deformations of this profile which are exaggerated in the plot due to the choice\nof unequal scales.\nInterestingly such asymmetry is experimentally observed [2], where after 3 min of operation the asymmetry\nfor the bridge of 0.9cm length ranges from a diameter of\n2.1mm to 2.6mm. This is in agreement with the profile\ncalculated in figure 8. Also the measured asymmetry in\nthe left and right catenary angle [3] in glycerine can be\nexplained with the present model.\nD.\n\nf [L]\n\n-0.04\n-0.06\n-0.08\n0.2\n0.19\n\nr [L]\n\n(31)\n\n-0.02\n\n0.18\n0.17\n0.16\n6.5\n\nv [m/s]\n\nR(x)2 v(x) = R2 v.\n\n0\n\n6\n5.5\n5\n4.5\n4\n0\n\n0.2\n\n0.6\n\n0.4\n\n0.8\n\n1\n\nx[L]\n\nDynamical stability\n\nWe turn now to the question of dynamical stability\nof the flow and consider the motion of water together\nwith the motion of charged particles characterized by the\nmass mi and charge ei . This charge current is given by\nOhm's law σE and the corresponding mass current can\nbe written\nmi\nρ\nji =\nj = xi σE\n(32)\nei\nρc\nwhere we introduced the mass ratio of the number of\ncharged particles (e.g. NaCl) to the water particles\nxi =\n\n#i mNaCl\nρc m i\n=\n.\n#w mH2 0\nρei\n\n(33)\n\nThe mass current of the neutral (water) particles are then\njn = ρn vn = (ρ −\n\nmi\nρc )vn = (1 − xi )ρvn\nei\n\nsuch that the total mass current reads\nρ\nρv = ji + jn = xi σE + (1 − xi )ρvn .\nρc\n\n(34)\n\n(35)\n\nThe total current (left side) should be larger than the\ncurrent only from the charged particles (last term on the\nright side). However the velocity of charged particles,\nσE/ρc should be larger than the velocity of the dragged\n\nFIG. 7: The center of mass coordinate (above), the radius\n(middle) and the velocity (bottom) together with the 3D plot\nof water bridge (in cm) for no bulk charges c = 0. The parameter are b = 1.5cm and according to table I. Please note\nthe different length scales in x and y, z direction.\n\nwater molecules vn and therefore larger than the mean\nvelocity v of the mass motion. Together with (26) this is\nexpressed by the inequalities\nσE\n> u0\nρc\n\n\u0012\n\nb\n+c\nL\n\n\u0013\n\n> xi\n\nσE\nρc\n\n(36)\n\n\f8\n0\n\nf [L]\n\n-0,05\n-0,1\n-0,15\n\nc=1\nc=0\n\n0,2\n-0,2\n\nr [L]\n\n0,18\n0,16\n0,14\n0,12\n0,1\n40\n\nv [m/s]\n\n30\n20\n10\n0\n0\n\n0,2\n\n0,6\n\n0,4\n\n0,8\n\n1\n\nFIG. 9: The range of possible water bridges for an electric\nfield of E = 0.64kV/cm. The upper limit is due to the static\nstability condition (20) and the lower cut is due to the dynamical condition (37). The bulk-charge-free condition is the\nupper straight line.\n\nx[L]\n\nsmall charge densities solved in water which allows to\nconsider the lowest order dependence of the conductivity\non the bulk charge concentration (27).\nNoting the charge-density dependencies of xi , b and c\nvia (33), (2) and (3) one obtains from (36) the dynamical\nrestriction on possible bulk charges\nq\nρc ∈ ρ1 − ρ2 ± (ρ1 − ρ2 )2 + ρ23\nρc (1 − 2ρ2 /ρi ) > ρ23 /ρi − 2ρ1\n\n(37)\n\nwith the auxiliary densities\nρ1 = ǫ0 (ǫ − 1)\nρ23 =\nFIG. 8: The center of mass coordinate (above), the radius\n(middle) and the velocity (bottom) together with the 3D plot\nof water bridge (in cm) with bulk charges c = 1. The parameter are b = 1cm and according to table I.\n\nwhich gives an upper and lower bound on the possible\nmass motion created by the drag of particles due to the\nforce on charged particles.\nIf we now take into account the dependence of the conductivity on the density of the solved ions in water we\ncan find a condition on possible bulk charges in water to\nmaintain a stable bridge. To this aim we consider very\n\n32ησ0\n,\na2\n\nE\n,\n2L\nρi =\n\nρ2 =\nei ρ\n.\nmi\n\n16ηλ\neNA a2\n(38)\n\nThe results for NaCl in water (table I) are plotted in\nfigures 9-10. The static stability condition (19) gives the\nupper and charge-density-independent limit in figure 10.\nThe static condition (20) with bulk charges leads to the\nborder of maximal densities on the right side which agrees\nwith (19) at zero densities, of course. The lower minimal\nlength of the bridge at a given field strength and bulk\ncharge is provided by the dynamical condition (37). For\nno bulk charge the possible range of lengths of the bridge\nstarts at zero and is limited by the upper length (19).\nIf there are charges present, there is a minimal length\nrequired to have a stable bridge.\nFrom the 3D plot in figure 10 one can see that for\nfinite charges and for fixed bridge lengths there is a lower\n\n\f9\n50 ng/l. As a further an asymmetric profile in the diameter along the bridge is obtained which was observed by\nasymmetric heating.\nFor the dynamical consideration a picture is proposed\nof dragged liquid particles due to the motion of the\ncharged ones besides the ponderomotoric forces due to\nthe dielectric character of the liquid. The resulting consideration of dynamical stability restricts the possible parameter range of bridge formation. The resulting mass\nflow combines the charge transport and the neutral mass\nflow dragged by dielectric pressure and is in agreement\nwith the experimental data.\nThe presented simple classical theory applies for\ncharged liquids as long as the Reynolds number is such\nlow that laminar flow can be assumed.\nAcknowledgments\n\nFIG. 10: The range of possible water bridges in dependence\non the bridge length, the electric field and the electrolyte bulk\ncharges.\n\nand an upper critical field where bridges can only be\nstable. From the experiments [2] it is seen that the bridge\nforms jets for fields higher than 15kV/cm and therefore\nbecomes unstable. With a bridge length of 0.5cm this\ntranslates into a bulk charge of 4ng/l according to our\nfound boundary conditions. This is in agreement with\nthe value needed to reproduce the flow measurements\ndescribed in section IV.B.\n\nThe discussions with Bernd Kutschan who pointed out\nthis interesting effect to me and the clarifying comments\nof Jacob Woisetschläger are gratefully mentioned. This\nwork was supported by DFG-CNPq project 444BRA113/57/0-1 and the DAAD-PPP (BMBF) program. The\nfinancial support by the Brazilian Ministry of Science and\nTechnology is acknowledged.\nAppendix A: Solution of charged catenary\n\nHere the drivation of the charged catenary [24] is\nshortly sketched. We solve the variation problem (14)\nZL\n0\n\nV.\n\nSUMMARY\n\nThe formation of water bridges between two vessels\nwhen an electric field is applied has been investigated\nmacroscopically. Electrohydrodynamics is sufficient to\ndescribe the phenomena in agreement with the experimental data. The four necessary parameters which are\nbuild up from microscopic properties of the charged liquid are the capillary height (1), the creeping height (2),\nthe dimensionless ratio between field and gravitational\nforce density (3), and the characteristic velocity (4).\nAs new contribution to the discussion, an exact solution has been found of a charged catenary. This leads\nto a static stability criterion for possible charges in the\nliquid dependent on the applied field strengths and on\nthe length of the bridge. With no bulk charges present\nthe maximal bridge length is determined and no minimal\nlength occurs. This changes if bulk charges are present.\nThen also a minimal length is required. However, only\nvery small concentrations of bulk charges are possible and\nthe bridge is easily destroyed when bulk charges exceed\n\nF (x)dx → extr.\n\n(A1)\np\nwith the functional F (x) = ρg [f (x) + b − cx] 1 + f ′ (x)2\nand the boundary conditions f (0) = f (L) = 0.\nIt is useful to introduce\nt(x) = f (x) + b − cx\n\n(A2)\n\np\nF (x) = ρg t(x) 1 + [t′ (x) + c]2 .\n\n(A3)\n\nsuch that\n\nThe corresponding Lagrange equation\nδF\nd δF\n−\n=0\ndx δt′ (x) δt(x)\n\n(A4)\n\npossesses a first integral\nt′ (x)\n\np\nδF\n− F = const = −ξ 1 + c2\n′\nδt (x)\n\n(A5)\n\nwhere we introduced the first integration constant ξ in a\nconvenient way.\n\n\f10\nThe resulting differential equation\np\nt(x̄)[ct′ (x̄) + 1] = ξ t′ (x̄)2 + (ct′ (x̄) + 1)2\n\nwith x̄ = x(1 + c2 ) is solved in an implicit way\n\u0015\u001b\n\u001a \u0014\nL\n1\nx̄ + ct(x̄) − cb + d\nt(x̄) = ξ cosh\nξ\n2\n\n(A6)\n\n(A7)\n\nwith a second integration constants d. The profile is\ntherefore given by the implicit equation\n\u0015\u001b\n\u001a \u0014\nL\n1\nx + cf (x) + d . (A8)\nf (x) = cx − b + ξ cosh\nξ\n2\nThe boundary condition f (0) = 0 leads to the determination of the integration constant\n\u0012 \u0013\nξ\nb\n(A9)\nd = 2 arcosh\nL\nξ\n\nThe boundary condition f (L) = 0 lead to the determination of the remaining constant ξ to be the solution of\nthe equation\n\nL\n2ξ\nc = − sinh\nL\n2ξ\n\nb\nL\nsinh\n−\nξ\n2ξ\n\ns\n\nL\nb2\n− 1 cosh\n2\nξ\n2ξ\n\n!\n\n.\n\n(A11)\n\nFinally we can rewrite the implicit solution (A10) in\nparametric form. Therefore we choose as parameter\nt = x + cf (x) which runs obviously through the interval t ∈ (0, L) and we obtain the solution (15)\n\nin terms of the yet unknown ξ constant. The solution\n(A8) can be written with the help of (A9) as\n\u001a\n\u0014\n\u0015\n\u0012 \u0013\u001b\nx+cf (x) Ld\nLd\nf (x) = cx+ξ cosh\n−cosh\n.\n−\nξ\n2ξ\n2ξ\n(A10)\n\n\u0013\n\u0012 \u0013\u0015\u001b\n\u001a\n\u0014\n\u0012\n1\nLd\nt Ld\nf (t) =\n−cosh\nc t+ξ cosh\n−\n2\n1+c\nξ 2ξ\n2ξ\nx(t) = t − cf (t),\nt ∈ (0, L).\n(A12)\n\n[1] W. G. Armstrong, The Electrical Engineer (The Newcastle Literary and Philosophical Society, New Castle,\n1893), pp. 154–155, 18 February 1893.\n[2] J. Woisetschlager, K. Gatterer, and E. C. Fuchs, Exp. in\nFluids 48, 121 (2010).\n[3] A. G. Marin and D. Lohse, Phys. of Fluids 22, 122104\n(2010).\n[4] G. M. Sacha, A. Verdaguer, and M. Salmeron, J. Phys.\nChem. B 110, 14870 (2006).\n[5] J. M. Oh, S. H. Ko, and K. H. Kang, Physics of Fluids\np. 032002 (2010).\n[6] A. Garcia-Martin and R. Garcia, Appl. Phys. Lett. 88,\n123115 (2006).\n[7] S. Gomez-Monivas, J. J. Saenz, M. Calleja, and R. Garcia, Phys. Rev. Lett. 91 (2003).\n[8] T. Cramer, F. Zerbetto, and R. Garcia, Langmuir 24,\n6116 (2008).\n[9] S. Chen, X. Huang, N. F. A. van der Vegt, W. Wen, and\nP. Sheng, Phys. Rev. Lett. 105, 046001 (2010).\n[10] T. M. Squires and S. R. Quake, Rev. Mod. Phys. 77, 977\n(2005).\n[11] A. M. Ganancalvo, J. of Fluid Mechanics 335, 165\n(1997).\n[12] M. Gamero-Castano, J. of Fluid Mechanics 662, 493\n(2010).\n[13] F. Higuera, Physics of Fluids p. 112107 (9 pp.) (2010).\n[14] J. Eggers, Phys. Rev. Lett. 71, 3458 (1993).\n[15] J. Eggers, Rev. Mod. Phys. 69, 865 (1997).\n\n[16] F. Saija, F. Aliotta, M. E. Fontanella, M. Pochylski,\nG. Salvato, C. Vasi, and R. C. Ponterio, J. of Chem.\nPhys. 133, 081104 (2010).\n[17] J. R. Melcher and G. I. Taylor, Ann. Rev. of Fluid Mech.\n1, 111 (1969).\n[18] L. D. Landau and E. M. Lifschitz, Lehrbuch der Theoretischen Physik: Elektrodynamik der Kontinua, vol. VIII\n(Akademie-Verlag, Berlin, 1990).\n[19] A. Ramos, H. Morgan, N. G. Green, and A. Castellanos,\nJ. Phys. D - Appl. Phys. 31, 2338 (1998).\n[20] A. Widom, J. Swain, J. Silverberg, S. Sivasubramanian,\nand Y. N. Srivastava, Phys. Rev. E 80, 016301 (2009).\n[21] L. Giuliani, E. D'emilia, A. Lisi, S. Grimaldi, A. Foletti, and E. Del Giudice, Neural Network World 19, 393\n(2009).\n[22] E. C. Fuchs, J. Woisetschlager, K. Gatterer, E. Maier,\nR. Pecnik, G. Holler, and H. Eisenkolbl, J. Phys. D Appl. Phys. 40, 6112 (2007).\n[23] D. E. Moulton and J. A. Pelesko, Siam J. on Appl. Math.\n70, 212 (2009).\n[24] K. Morawetz, AIP Advances (2012), in press.\n[25] D. S. Chandrasekharaiah, Continuum mechanics (Academic Press, Boston, 1994).\n[26] J. Woisetschlager, priv. communication.\n[27] M. J. Hancock and J. W. Bush, J. Fluid Mech. 466, 285\n(2002).\n\n\f"}