{"id": "http://arxiv.org/abs/1101.5732v1", "guidislink": true, "updated": "2011-01-29T23:22:02Z", "updated_parsed": [2011, 1, 29, 23, 22, 2, 5, 29, 0], "published": "2011-01-29T23:22:02Z", "published_parsed": [2011, 1, 29, 23, 22, 2, 5, 29, 0], "title": "Equations for two-phase flows: a primer", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5758%2C1101.0887%2C1101.1891%2C1101.1091%2C1101.3179%2C1101.5400%2C1101.1136%2C1101.5806%2C1101.1500%2C1101.4921%2C1101.5089%2C1101.4809%2C1101.0165%2C1101.0412%2C1101.2260%2C1101.0331%2C1101.3694%2C1101.1744%2C1101.5167%2C1101.1594%2C1101.1082%2C1101.1639%2C1101.5732%2C1101.2277%2C1101.2846%2C1101.0650%2C1101.3135%2C1101.2781%2C1101.2070%2C1101.6047%2C1101.3213%2C1101.5802%2C1101.2624%2C1101.2574%2C1101.0902%2C1101.5835%2C1101.5312%2C1101.1809%2C1101.3919%2C1101.5146%2C1101.4869%2C1101.6028%2C1101.4217%2C1101.5881%2C1101.3013%2C1101.0584%2C1101.4673%2C1101.0597%2C1101.5710%2C1101.0401%2C1101.2097%2C1101.2215%2C1101.0029%2C1101.2022%2C1101.5392%2C1101.0190%2C1101.4948%2C1101.1026%2C1101.5921%2C1101.3884%2C1101.0070%2C1101.0224%2C1101.5901%2C1101.4103%2C1101.3143%2C1101.0931%2C1101.5072%2C1101.3527%2C1101.2716%2C1101.3945%2C1101.2967%2C1101.3070%2C1101.4934%2C1101.1262%2C1101.3241%2C1101.2041%2C1101.5384%2C1101.5107%2C1101.5975%2C1101.0616%2C1101.0148%2C1101.1864%2C1101.2538%2C1101.5164%2C1101.5564%2C1101.3524%2C1101.4151%2C1101.1697%2C1101.0783%2C1101.5413%2C1101.4052%2C1101.2820%2C1101.2782%2C1101.3939%2C1101.2389%2C1101.6046%2C1101.1435%2C1101.1603%2C1101.3075%2C1101.1617%2C1101.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Equations for two-phase flows: a primer"}, "summary": "The main goal of these notes is to give a review of the equations for two\nphase flow problems with an interface between the two phases in a\nself-contained way, and, in particular, to properly include surface tension\ninto the interface balance equations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5758%2C1101.0887%2C1101.1891%2C1101.1091%2C1101.3179%2C1101.5400%2C1101.1136%2C1101.5806%2C1101.1500%2C1101.4921%2C1101.5089%2C1101.4809%2C1101.0165%2C1101.0412%2C1101.2260%2C1101.0331%2C1101.3694%2C1101.1744%2C1101.5167%2C1101.1594%2C1101.1082%2C1101.1639%2C1101.5732%2C1101.2277%2C1101.2846%2C1101.0650%2C1101.3135%2C1101.2781%2C1101.2070%2C1101.6047%2C1101.3213%2C1101.5802%2C1101.2624%2C1101.2574%2C1101.0902%2C1101.5835%2C1101.5312%2C1101.1809%2C1101.3919%2C1101.5146%2C1101.4869%2C1101.6028%2C1101.4217%2C1101.5881%2C1101.3013%2C1101.0584%2C1101.4673%2C1101.0597%2C1101.5710%2C1101.0401%2C1101.2097%2C1101.2215%2C1101.0029%2C1101.2022%2C1101.5392%2C1101.0190%2C1101.4948%2C1101.1026%2C1101.5921%2C1101.3884%2C1101.0070%2C1101.0224%2C1101.5901%2C1101.4103%2C1101.3143%2C1101.0931%2C1101.5072%2C1101.3527%2C1101.2716%2C1101.3945%2C1101.2967%2C1101.3070%2C1101.4934%2C1101.1262%2C1101.3241%2C1101.2041%2C1101.5384%2C1101.5107%2C1101.5975%2C1101.0616%2C1101.0148%2C1101.1864%2C1101.2538%2C1101.5164%2C1101.5564%2C1101.3524%2C1101.4151%2C1101.1697%2C1101.0783%2C1101.5413%2C1101.4052%2C1101.2820%2C1101.2782%2C1101.3939%2C1101.2389%2C1101.6046%2C1101.1435%2C1101.1603%2C1101.3075%2C1101.1617%2C1101.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The main goal of these notes is to give a review of the equations for two\nphase flow problems with an interface between the two phases in a\nself-contained way, and, in particular, to properly include surface tension\ninto the interface balance equations."}, "authors": ["Andrea Dziubek"], "author_detail": {"name": "Andrea Dziubek"}, "author": "Andrea Dziubek", "links": [{"href": "http://arxiv.org/abs/1101.5732v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.5732v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.5732v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.5732v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:1101.5732v1 [physics.flu-dyn] 29 Jan 2011\n\nEquations for two-phase flows: a primer\nAndrea Dziubek\nJune 2, 2018\n\nContents\n1 Introduction\n\n2\n\n2 Geometry of a moving interface\n2.1 Curvilinear coordinate systems . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2 Mean curvature . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.3 Implicit parameterized surface . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n4\n4\n7\n7\n\n3 Kinematics of bulk fluids and of the moving interface\n3.1 Kinematics of a material volume . . . . . . . . . . . . . . . . . . . .\n3.2 Reynolds transport theorem for a material volume with an interface\n3.3 Kinematics of a moving interface and velocities . . . . . . . . . . . .\n3.4 Reynolds transport theorem and divergence theorem for a surface . .\n\n.\n.\n.\n.\n\n10\n10\n13\n15\n19\n\ntension\n. . . . . . . . . . . . . .\n. . . . . . . . . . . . . .\ntension . . . . . . . . .\n\n21\n21\n23\n24\n\n5 Model equations with phase change and surface tension\n5.1 Mass, momentum and energy equation . . . . . . . . . . . . . . . . . . . . . . .\n5.2 Mass, momentum and energy jump conditions . . . . . . . . . . . . . . . . . . .\n5.3 Summary of the model equations . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n26\n26\n28\n30\n\n4 Generic model equations for two-phase flows with surface\n4.1 Balance equations for bulk fluids . . . . . . . . . . . .\n4.2 Jump conditions at an interface between two fluids . .\n4.3 Balance equation and jump condition including surface\n\n1\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n\f1 Introduction\nThe subject of Physics of fluids and heat transfer have been well established during the last\ncentury, and has been intensively studied for a wide range of hydrodynamical problems. Many\ncurrent efficient computational fluid dynamics (CFD) software packages offer great flexibility\nin geometry and material properties. However, two-phase flow problems with moving boundaries still present a major challenge to the current state of computational fluid dynamics.\nAlthough an interface is a three-dimensional region with a thickness of the order of molecular\ndiameters it is conveniently modeled as a two dimensional surface (Cosserat surface). Surface\ntension, being a geometrical property of a two dimensional surface, is proportional to the\ncurvature of the interface. It is also a material property of the two adjoined materials, thus\nit is an intrinsic property of the surface. In order to include surface tension properly into the\nmodeling we need to formulate an additional balance equation for the surface and add it to\nthe volume balance equation.\nInterfacial dynamics for Newtonian surface fluids was first described by Scriven in [Sc] using\ntensor notation. However, tensor notation is not part of a typical engineering education. Also,\nthere is scarce literature on interface balance equations covering surface tension, most use a\nsource term instead.\nThe main goal of these notes is to give a review of the equations for two phase flow problems with an interface between the two phases in a self-contained way, and, in particular, to\nproperly include surface tension into the interface balance equations.\nBalance equations at an interface involve geometrical quantities, such as normal and tangential vectors on the interface and mean curvature of the interface. We recall them in section 2.\nFor the balance equations and the jump conditions we need Reynolds' transport theorems\nfor a material body and for a material body with an internal interface. We review them in\nsection 3.1 and 3.2. The kinematics of a moving surface are described in section 3.3.\nIn section 4.1 and 4.2 we recall balance equations for single phase problems and ordinary\njump conditions for an interface, where the adjacent phases are incompressible Newtonian fluids. Taking surface tension into account increases the complexity. The normal and tangential\nvectors on the interface can be derived by a simple geometric demonstration. However, to describe mean curvature (in a physical, intuitive way) use of tensor notation becomes inevitable.\nThe jump condition from section 4.2 does not cover surface tension.\nSurface tension is proportional to the curvature of the interface, being a geometrical property of a surface. It is also a material property of the two related materials, thus it is an\n\n2\n\n\fintrinsic property of the surface. In order to include surface tension properly into a jump\ncondition we need to formulate an additional balance equation for the surface and add it to\nthe volume balance equation. This is done in section 4.3. In return it involves kinematic\nrelations of the interface and the Reynolds transport theorem for surfaces. They are given in\nsection 3.3 and 3.4.\nFinally, in section 5, the generic balance equations are applied to mass momentum and\nenergy and common simplifications and boundary conditions are discussed.\nPreliminaries In this text we use Einstein summation convention, which states a repeated\nindex implies a sum over all possible values for that index. When the index takes only the\nvalues 1, 2, Greek letters are used and when the index takes the values 1, 2, 3, Latin letters\nare used. A vector in a general curvilinear coordinate system can be referred to the standard\n\b\nbasis {ei } or to the dual basis ei and we can write v = v i ei or v = vi ei . The v i are called\ncontravariant components and the vi are called covariant components of the vector v. The\ndual basis is defined by ei * ej = δi j . In a Cartesian coordinate system there is no difference\nbetween standard and dual basis and the contravariant and covariant coordinates of a vector\nare the same. In a curvilinear coordinate system the basis vectors carry a part of the length\ninformation of a vector.\nThe tensor (outer) product is defined by its action\n(u ⊗ v) w = u (v * w)\n\nor\n\nu (v ⊗ w) = (u * v) w .\n\nComputing the outer products of the base vectors a second order tensor can be represented\nas T = T ij ei ⊗ ej = T ij ei ⊗ ej = Ti j ei ⊗ ej = Tij ei ⊗ ej . The scalar (dot) product between\ntwo tensors is defined as\n(v 1 ⊗ v 2 ) • (w1 ⊗ w2 ) = (v 1 * w1 ) (v2 * w2 ) .\nThe gradient of a vector is defined as\n∂\n∇v = ei i ⊗ v ,\n∂x\nand the divergence of a second order tensor is defined as\n\u0012\n\u0013\n\u0001\n∂\n∂\n∂S ij\nij\nij\n∇ * S = ek k S ei ⊗ ej = ek k * S ei ej =\nej .\n∂x\n∂x\n∂xi\nAlternatively one could first take the derivative and then compute the dot or tensor product,\n∂v\n∂S\ni.e. ∇v = ∂x\nk ⊗ ek or ∇ * S = ∂xk * ek . Note that both definitions are possible and are used in\nthe literature. Our definition is more common in fluid dynamics, the later definition is more\ncommon in elasticity.\n\n3\n\n\f2 Geometry of a moving interface\nIn this section we summarize the geometrical properties of the moving interface between two\nphases. First, the formulas for normal and tangential vectors, mean curvature and interface\nvelocity are given. Then, using an implicit representation of the surface, the geometrical\nproperties of two phases at the interface are computed. Two formulas to compute the normal\nvector and two formulas to compute the mean curvature are given.\nThe material in this section is mainly based on [Ed], [Ar], [TrTo] and [Er]. They present a\nformulation of classical continuum physics using tensor calculus. For an introduction in tensor\ncalculus we refer to [Scha]. [Sl07], [Sl99] and [De] present transport phenomena (including\ninterphase transport phenomena) using moderate tensor notation. [Kü] is a differential geometry book written more for mathematicians, [Op] has an easier notation but lack some\nderivations. For advanced calculus we refer to [Ap] and [Ka].\n\n2.1 Curvilinear coordinate systems\nA two-dimensional surface can best be anz\nalyzed by covering the surface with a grid,\nsee figure 1. The grid is obtained by the\ncurves where u1 and u2 are constant. The\nposition of a point on the surface can be\nreplacements\ngiven intrinsically in terms of the twoPSfrag\ncurvilinear surface coordinates (or parameters) u1\nx\nand u2 , or extrinsically by a position vector\nto the point. This defines a curvilinear coordinate system which is not orthogonal in\ngeneral.\n\nn\n\na2\n\nu2 =const.\n\na1\nu1 =const. y\n\nx\n\nFigure 1: Tangent space on a surface\nTangential and normal vectors If the interface between the two phases is not stationary the\nposition vector to a point on the interface is given in cartesian coordinates as\nx(u1 , u2 , t) = x1 (u1 , u2 , t) e1 + x2 (u1 , u2 , t) e2 + x3 (u1 , u2 , t) e3 ,\n\n(1)\n\nor in index notation as\nx(uα , t) = xi (uα , t) ei ,\n\n(2)\n\n4\n\n\fwhere uα = u1 , u2 .\nA Taylor series expansion of x in the surface variables uα up to the linear term yields the\ntotal derivative\nx(uα + duα ) − x(uα ) = dx =\n\n∂x\nduα .\n∂uα\n\n∂x\nAlong u1 -curves, u2 = constant (du2 = 0), ∂u\n1 defines the tangent vector along this curves;\n∂x\nsimilarly ∂u2 defines the tangent vector along the u2 curve. The derivatives with respect to\nthe curvilinear coordinates uα are called covariant derivatives. The covariant derivatives of a\nposition vector\n\naα =\n\n∂x\n∂xi\n=\ne\ni\n∂uα\n∂uα\n\n(3)\n\nform the base vectors of a local surface coordinate system. In terms of the covariant base\nvectors the surface metric tensor is defined as\naαβ = aα * aβ .\n\n(4)\n\nThe metric tensor is also called the first fundamental form. The local unit normal vector at\na point (u1 , u2 ) normal to the surface is defined by\nn=\n\na1 × a2\n.\n|a1 × a2 |\n\nDual basis\n\n(5)\n\n\b\nAnother set of base vectors aβ , is defined by the surface Kronecker delta,\n\naα * aβ = δαβ ,\n\nthey are called dual base vectors or reciprocal or contravariant base vectors respectively. This\ncondition orthogonality relation defines a vector a1 that lies in the plane formed by the vectors\na1 , a2 , is perpendicular to a2 , forms an acute angle with a1 . This is also the definition of the\ngradient ∇u1 of the surface coordinate, which is perpendicular to the level surface defined by\nu1 (x1 , x2 , x3 , t) = constant. Similarly the orthogonality relation defines the vector a2 . Then\nthe dual or contravariant base vectors are given by\naα = ∇uα = ei\n\n∂uα\n.\n∂xi\n\n(6)\n\nWith the contravariant base vectors the covariant surface metric tensor is\naαβ = aα * aβ .\n\n(7)\n\n5\n\n\fHowever, often the dual basis is more conveniently calculated by means of the local unit\nnormal vector\na1 =\n\na2 × n\n,\n[a1 , a2 , n]\n\na2 =\n\nn × a1\n.\n[a1 , a2 , n]\n\n(8)\n\n[a1 , a2 , n] = [a1 × a2 ] * n is the scalar triple product.\nOrthogonal curvilinear coordinate systems If the base vectors of a curvilinear coordinate\nsystem are mutually orthogonal (a1 * a2 = 0), then the covariant and contravariant metric\ntensor reduce simply to\n#\n\"\n\"\n#\n11\na\n0\na11 0\n,\naαβ =\naαβ =\n.\n0 a22\n0 a22\nFor such orthogonal systems the normalized surface vectors are called self reciprocal, in the\n1\n2\nsense that √aa111 = √a 11 and √aa222 = √a 22 . It is convenient to introduce unit vectors\na\n\na1\n,\ne1 = √\na11\nSurface gradient\n\na\n\na2\ne2 = √\n.\na22\nThe identity tensor is defined by\n\nI = a1 ⊗ a1 + a2 ⊗ a2 + n ⊗ n .\nIt possesses the property Ix = x for any x. This relation is also called orthogonality relation.\nBy subtracting the part related to the normal vector from I the surface identity tensor is\ndefined as\nI S = I − n ⊗ n = aα ⊗ aα .\n\n(9)\n\nSimilarly the surface gradient is defined by the projection in normal direction subtracted from\nthe gradient\n∇S = I S ∇ = (I − n ⊗ n) ∇ = ∇ − (n ⊗ n) ∇ .\n\n(10)\n\nBy this we get\n∇S\n\nα\n\n= a ⊗ aα\n= aα\n\n\u0012\n\n∂\n.\n∂uα\n\n∂\nej\n∂xj\n\n\u0013\n\n=a\n\nα\n\n\u0012\n\n∂xj\naα * ej\n∂uα\n\n\u0013\n\n\u0013\n\u0012\n∂\n∂xi\n= a ei α * ej\n∂u\n∂xj\nα\n\n(11)\n(12)\n\n6\n\n\f2.2 Mean curvature\nThe mean curvature is proportional to the rate of change of the local normal vector with\nrespect to the surface coordinates.\n\u0013\n\u0012\n1\n1\nα ∂\n*n.\n(13)\na\nH = − ∇S * n = −\n2\n2\n∂uα\n\n2.3 Implicit parameterized surface\nTo compute the normal and tangential vectors and the mean curvature of the moving interface\nit is necessary to choose a parametrization of the interface. For example, if a vertical tube\nis assumed where a thin film is flowing down along the inner walls (without waves), then\nthe problem has rotational symmetry and the interface between the liquid and the gas can\nbe parameterized with the surface coordinates u1 = z and u2 = θ. To assume an implicit\nparameterized surface is more general.\nNormal and tangential vectors of an implicit parametrized surface Every moving surface\ncan be locally described by a real-valued function of two variables and time\nz = h(u, v, t)\n\nor implicitly\n\nF (u, v, z, t) = z − h(u, v, t) = 0 .\n\nFor convenience we write u1 = u, u2 = v. By this parametrization the position vector to any\npoint on the surface becomes\nx(u, v, t) = u e1 + v e2 + h(u, v, t) e 3 .\nThe tangential vectors are given by the covariant base vectors (3) as\n \n \n1\n0\n∂x  \n∂x  \na2 =\na1 =\n=0 ,\n=1 .\n∂u\n∂v\n∂h\n∂h\n∂u\n\n(14)\n\n∂v\n\nThe local unit normal vector is the cross product of the tangent vectors, scaled by its length.\nAlternatively, if the surface is given by z = h(u, v, t), the unit normal vector can be obtained\nfrom the gradient of the implicit function F (u, v, z, t) = 0. Expanding F (u, v, z, t) in a Taylor\nseries up to the linear term for the variables u, v, z leads to the total derivative\ndF =\n\n∂F\n∂F\n∂F\ndu +\ndv +\ndz ,\n∂u\n∂v\n∂z\n\n7\n\n\fwhich is zero because F = 0. Writing the total derivative as ∇F * du = 0 where du =\n[du, dv, dz] shows that the gradient ∇F is perpendicular to the level surface defined by\nF (u, v, z, t) = 0. The local unit normal vector reads then\n\n\n∂h\n− ∂u\n1\n∇F\n\n\n.\n(15)\n= − ∂h\nn=\nq\n∂v\n\u0001\n\u0001\n|∇F |\n∂h 2\n∂h 2\n+\n+\n1\n1\n∂u\n∂v\nMean curvature of an implicit parametrized surface The mean curvature is given by (13)\nas\n\u0012\n\u0013\n1\n∂n\n∂n\nH=−\n+ a2 *\na1 *\n.\n2\n∂u\n∂v\n\nAlternatively the mean curvature is often computed more conveniently by means of the first\nand second fundamental form as explained below. For the implicit surface parametrization\nthe covariant metric tensor, or first fundamental form (4), reads in matrix form\n#\n# \"\n\"\n∂h ∂h\n∂h 2\n)\n1 + ( ∂u\na1 * a1 a1 * a2\n∂u ∂v\n.\n=\naαβ =\n∂h ∂h\n2\n1\n+\n( ∂h\na2 * a1 a2 * a2\n∂v ∂u\n∂v )\nThe contravariant metric tensor aαγ is defined as the inverse of the covariant metric tensor,\naαγ aγβ = δαβ . An element of the inverse of a matrix is given by the transpose of the cofactor\nmatrix (denoted by a tilde), divided by the determinant of the matrix. This yields for a (2×2)\nmatrix\n\"\n#\nãαβ\n1\na22 −a12\nαβ\n−1\na = (aαβ ) =\n=\n,\ndet aαβ\na11 a22 − a12 a21 −a21 a11\nand for the implicit surface parametrization\n\"\n#\n∂h ∂h\n2\n)\n−\n1 + ( ∂h\n1\nαβ\n∂v\n∂u ∂v\na =\n∂h ∂h\n∂h 2 .\n2 + ( ∂h )2\n−\n1\n+\n(\n)\n1 + ( ∂h\n)\n∂u\n∂v\n∂u\n∂u\n∂v\nBoth metric tensors are evidently symmetric. They are also positive definite.1\nNext, the second fundamental form is defined as\nbαβ =\n1\n\n∂aα\n*n\n∂uβ\n\nor alternatively\n\nbαβ = −aα *\n\n∂n\n.\n∂uβ\n\n(16)\n\nThe condition that a matrix is positive definite is that all upper left determinants are positive, a11 =\n∂h\n∂h ∂h\n∂h ∂h\n∂h 2\n) > 0 and a11 a22 − (a12 )2 = (1 + ( ∂h\n)2 )(1 + ( ∂h\n)2 ) − ∂h\n= 1 + ( ∂h\n)2 + ( ∂h\n)2 + ∂u\n− ∂u\n> 0.\n1 + ( ∂u\n∂u\n∂v\n∂u ∂v\n∂u\n∂u\n∂v\n∂v\n\n8\n\n\fThe first equation of (16) yields for our parametrization\n\"\n\" 2\n#\n∂a1\n∂a1\n∂ h\n1\n*\nn\n*\nn\n∂aα\n∂u\n∂v\n∂u2\n* n = − ∂a\n=\nbαβ =\n∂a2\n∂2 h\n∂h 2\n∂h 2\n2\n∂β\n*\nn\n*\nn\n1\n+\n(\n)\n+\n(\n)\n∂u\n∂v\n∂v∂u\n∂u\n∂v\n\n∂2 h\n∂u∂v\n∂2 h\n∂v2\n\n#\n\n.\n\nThe second fundamental form is also symmetric but not necessarily positive definite. From\nthe first and second fundamental form the shape operator or Weingarten map is defined\n#\n\"\n#\n\"\n1\nb11 b12\na22 −a12\nγβ\nL = bαγ a =\n.\n(17)\nb21 b22 det aαβ −a21 a11\nIt becomes for the implicit surface parametrization\n\" ∂2 h\n\u0001\n\u0001 ∂2 h ∂h ∂h #\n∂h 2\n∂2 h ∂h ∂h\n∂2 h\n∂h 2\n1\n+\n(\n)\n−\n1\n+\n(\n)\n− ∂u2 ∂u ∂v\n2\n1\n∂v\n∂u∂v ∂u ∂v\n∂v∂u\n∂u\n∂u\n,\nL= √\n\u0001\n\u0001\n2\n2\n2\no ∂ h 1 + ( ∂h )2 − ∂ h2 ∂h ∂h ∂ h2 1 + ( ∂h )2 − ∂2 h ∂h ∂h\n∂u∂v\n∂v\n∂u\n∂u∂v ∂u ∂v\n∂v ∂u ∂v\n∂v\nq\n√\n∂h 2\n2\nwith o = 1 + ( ∂u\n) + ( ∂h\n∂v ) . L is the product of a symmetric positive definite matrix and\na symmetric matrix and the eigenvalues of such a product are all real.\nThe two eigenvalues κ1 and κ2 of L are called principal curvatures. The mean curvature\nand the Gauss curvature K are defined by\n1\n1\ntrace L = bαβ aαβ = κ1 + κ2 ,\n2\n2\ndet bαβ\nK = det L =\n= κ1 κ2 .\ndet aαβ\nH =\n\nSo that finally the mean curvature becomes for our parametrization\n\n\u0001\n\u0001\n∂h 2\n∂h 2\n∂2 h ∂h ∂h\n∂2 h\n∂2 h\n1 + ( ∂v ) − 2 ∂u∂v ∂u ∂v + ∂v2 1 + ( ∂u )\n1\n2\n .\nH =  ∂u\n\u0001 23\n2\n∂h 2\n∂h 2\n) +( ) +1\n∂u\n\n(18)\n(19)\n\n(20)\n\n∂v\n\nFrom the two equations for the mean curvature, (18) involves only the covariant base vectors\nand the derivatives of the covariant base vectors, whereas (13) involves also the contravariant\nbase vectors and their derivatives, so that is often easier to use(18) to compute the mean\ncurvature, especially in the case of orthogonal coordinate systems. However, the definition of\nthe mean curvature with (13) is more physically intuitive.\nFor the computation of the mean curvature with (18) only the covariant base vectors and\nthe derivatives of the covariant base vectors need to be computed. If (13) is used to compute\nthe mean curvature, the contravariant base vectors and their derivatives will also need to\nbe computed. Using the shape operator to compute the mean curvature often simplifies the\ncomputations, especially in the case of orthogonal coordinate systems.\n\n9\n\n\f3 Kinematics of bulk fluids and of the moving interface\nIn this section we present kinematical relations that are necessary to formulate the balance\nequations at an interface between two phases. Experiments show that a fluid interface is in\nfact a three-dimensional region with a thickness on the micro-scale level. Following [Gi], such\nan interface can be regarded as a two-dimensional dividing surface where the effects of the\ninterface on the adjoining bulk phases are represented by surface excess mass, momentum and\nenergy.\nFirst we give kinematical relations for the bulk fluids, then we consider a material volume\nwith an internal interface. Next we discuss the kinematical relations of the two-dimensional\nmoving interface and in the last section we deal with kinematical relations related to the\ncurvature of the interface.\nThe first part of this section is mainly based on [Ar], [Scha] and [TrTo]. For the interface\nrelated sections see also [Sl07], [Sl99] and [Ed].\n\n3.1 Kinematics of a material volume\nTo clarify terminology we first recall some kinematics of bulk fluids and give the Reynolds\ntransport theorem for a material volume.\nFrom the basic assumption of continuum theory, a body consists of infinitely many particles\nwithout dimension and no space between them and every particle corresponds to a position\nin space. A particle is represented at a given initial time, by a position vector ξ, as shown\nin figure 2. The coordinates of ξ are called material coordinates. At another time the same\nparticle is represented by another position vector as a function of the initial position of the\nparticle and time\nx = x(ξ, t)\n\n(21)\n\nThe coordinates of x are called spatial coordinates.\nThe initial position of the particle is taken as a reference configuration. Equation (21)\ndefines the motion of a particle. Assuming continuous motion and that a particle can not\noccupy two places at the same time the relation is a one-to-one mapping and we can also\nwrite conversely\nξ = ξ(x, t) .\n\n10\n\n\fPhysical quantities like density, velocity and temperature, which are functions of space and\ntime, are called field variables and they are here denoted by φ. A field variable can also be\ngiven as a function of particle and time. The representation of a field variable as a function\nof space and time is called spatial (or Euler) representation, that is\nφ = φ(x, t)\n\nor\n\nφ = φ(ξ(x, t), t) .\n\nThe representation of a field variable as a function of particle and time is called material (or\nLagrange) representation, that is\nφ = φ(ξ, t)\n\nor\n\nφ = φ(x(ξ, t), t) .\n\nBalance equations of mass, momentum and energy are appropriately described in an Eulerian\nframework.\n\nz\nMaterial derivative and velocity Field variables are functions of several variables, so their\nderivatives are partial derivatives. Partial derivatives where spatial coordinates are held constant are denoted by ∂. Partial derivatives where material coordinates are held constant we\n2 The partial\nreplacements\ndenote with an uppercase D. PSfrag\nderivative with respect to time\n\u0012 \u0013\n∂φ\n∂φ(ξ, t)\nDφ\n=\n=\n.\nx(ξ, t)\nξ\nDt\n∂t\n∂t ξ\nis called material (or convected) derivative and gives the rate of change which an observer\nmoving with the particle would see. The material derivative of a position vector is the velocity\ny\nof a given particle\nx\nDx\n.\n(22)\nFigure 2: Moving particle\nDt\nBalance equations are given in spatial coordinates. To obtain the material derivative of a field\nvariable φ(x(ξ, t), t) in spatial variables the chain rule has to be applied\nv=\n\n∂φ\n∂φ Dxi\n+ i\n,\n∂t\n∂x Dt\n∂φ\n=\n+ v * ∇φ .\n(23)\n∂t\nThe material derivative is the local rate of change of a given particle at a given position and\nat a given time plus the convective rate of change related to the moving volume.\nDφ\nDt\n\n2\n\n=\n\nAnother common notation for the material derivative is a dot on the variable ẋ.\n\n11\n\n\fReynolds transport theorem for a material volume For the derivation of the balance equations we need the Reynolds transport theorem for a material volume. A mass conserving\nvolume is called material volume (or material body) and here denoted by V0 . It is moving\nwith time and deforming in general. A quantity B0 continuously defined over a material volR\nume V0 is given by B0 = V0 φ dV . The rate of change of B0 with respect to time is given\nby\nZ\ndB0 (t)\nd\nφ(x, t) dV .\n=\ndt\ndt\nV0 (x,t)\n\nIn an Eulerian representation V0 (x, t) depends on time, so \u0010that\u0011integration and differentiation\ni\nthe volume element can be\ncan not be interchanged. With the Jacobian J = det ∂x\n∂ξj\ntransformed from spatial coordinates into material coordinates dV = J dV0 . The material\nvolume element dV0 does not depend on time, so that then integration and differentiation can\nbe interchanged. The time derivative becomes the material derivative\nZ\nZ\n\u0011\nd\nD\u0010\nφ(x, t) dV =\nφ(ξ) J dV0 .\ndt\nDt\nV0 (x,t)\n\nV0 (ξ,t)\n\nUsing the material derivative of the Jacobian DJ\nDt = J ∇ * v we get\n\u0012\n\u0013\n\u0013\nZ\nZ\nZ \u0012\nDφ\nD\u0010 \u0011\nDJ\nDφ\nφ J dV0 =\nJ +φ\n+ φ ∇ * v J dV0 ,\ndV0 =\nDt\nDt\nDt\nDt\n\nwhere we have dropped the integration limits for simplicity. After transforming the volume\nelement back into spatial variables and by using the material derivative (23) of a field variable\nwe get for the rate of change with time of B0\n\u0013\nZ \u0012\nZ\nDφ\nd\n+ φ ∇ * v dV ,\n(24)\nφ dV =\ndt\nDt\nV0\n\u0013\nZ \u0012\n∂φ\n+ ∇ * [φ v] dV .\n=\n∂t\n\nNote that when the derivative of the integral is taken the integration domain has to be\nindicated. By using Gauss theorem3 , the divergence term in the volume integral can be\nchanged into an area integral\nI\nZ\nZ\nd\n∂φ\ndV + φ v * n dA ,\n(25)\nφ dV =\ndt\n∂t\nV0\n\n3\n\nThe Gauss theorem or divergence theorem for a vector f is given as:\n\n12\n\nR\n\n∇*f dV =\n\nH\n\nf *n dA.\n\n\fwhere the normal vector is directed outwards on the surface. The velocity v is the velocity\nof mass while moving across the surface. Equations (24) – (25) are called Reynolds transport\ntheorem. In the form of (25) the Reynolds transport theorem has a physical meaning: The\nrate of accumulation of a quantity in a material volume can be interpreted as the rate of\naccumulation of the quantity in a volume that equals the material volume at a given time\nplus convective flux (connected to mass) leaving the volume through the surface at that time.\n\n3.2 Reynolds transport theorem for a material volume with an interface\nreplacements\nWe consider a material volume VPSfrag\n0 = Vl +\nVg , where the field variable has the value φl\nng\nn\n(l for liquid phase) in the volume Vl and the\nÃ\nvalue φg (g for gas phase) in the volume Vg ,\nVg\nAl\nas shown in figure 3. An interface between\ntwo immiscible fluids is called a material inVl\nAg\nterface, it is formed by the same material\nelements or particles at all times. If phase\nnl\nchange occurs at an interface between two\naggregate states of a fluid, as is the case of\ncondensation or evaporation, the surface veFigure 3: Material volume with interface\nlocity u of the interface differs from the velocity v of the mass, and the interface is called a singular interface.\nThe difference between the two values at the surface is denoted by\nhh i\nφ := φg − φl\n\nand called the jump of φ across the interface.\nThe rate of change of B0 with respect to time is the sum of the rate of change of Bl and Bg\nwith respect to time\ndBl (t) dBg (t)\ndB0 (t)\n=\n+\n,\ndt\ndt\ndt\nthat is\nZ\nZ\nZ\nd\nd\nd\nφ dV =\nφl dV +\nφg dV .\ndt\ndt\ndt\nV0\n\nVl\n\nVg\n\nThe volumes Vl and Vg are not material, so that we need the Reynolds transport theorem in\na modified version for an arbitrary volume.\n\n13\n\n\fReynolds transport theorem for two arbitrary volumes A quantity Bu which is continuously\nR\ndefined over an arbitrary volume Vu is given by Bu = Vu φ dV . The volume Vu is assumed to\nconsist of fictive mass and shall be material (conserving the fictive mass). Then the rate of\nchange with time of Bu , according to the Reynolds transport theorem (25), is given as\nI\nZ\nZ\nd\n∂φ\ndV + φ u * n dA ,\n(26)\nφ dV =\ndt\n∂t\nVu\n\nwhere u is the velocity of the boundary of the considered volume.\nApplying the general formula to the two control volumes together with (26) yields Reynolds\ntransport theorems for each of the two volumes Vl and Vg as\nZ\nZ\nZ\nZ\n∂φ\nd\n(27)\nφ dV =\ndV + φ v * dA + φl u * n dÃ ,\ndt\n∂t\nVl\n\nVl\n\nAl\n\nÃ\n\nand\nd\ndt\n\nZ\n\nVg\n\nφ dV\n\n=\n\nZ\n\nVg\n\n∂φ\ndV +\n∂t\n\nZ\n\nφ v * dA +\n\nAg\n\nZ\n\nφg u * (−n) dÃ .\n\n(28)\n\nÃ\n\nBy adding (27) and (28) we obtain a Reynolds transport theorem for the entire volume\nV0 = Vl + Vg as\nZ\nI\nZ hh i\nZ\nd\n∂φ\nφ dV =\nφ u * n dÃ .\n(29)\ndV + φ v * dA −\ndt\n∂t\nV0\n\nÃ\n\nEquation (29) is the Reynolds transport theorem for a material volume with a singular interface. It states that the rate of accumulation of a quantity in a material volume, where φ\nundergoes a jump on an interface can be interpreted as the rate of accumulation of the quantity in a volume that equals the material volume at a given time plus convective flow of the\nquantities φl and φg leaving the volume through the outer surface and the interface at that\ntime. Here again the integration limits are dropped where the integrals are evaluated at\na given time. Only the integration domain of the integral along the interface Ã has to be\nindicated.\n\n14\n\n\fBy using Gauss theorem4 , the Reynolds transport theorem (29) for a material volume with\na singular interface can be rewritten as\n\u0013\nZ hh\nZ \u0012\nZ\ni\nd\n∂φ\nφ (v − u) * n dÃ .\n(30)\n+ ∇ * [φ v] dV +\nφ dV =\ndt\n∂t\nV0\n\nÃ\n\n3.3 Kinematics of a moving interface and velocities\nIn this section we present the kinematics of the moving interface and discuss the material (or\nconvected) surface derivative, fluid velocity and interface velocity.\nKinematics of the moving interface If we consider phase change, the interface is not composed of a fixed set of particles, there will be mass transfer between the interface and the two\nadjoining phases. According to the basic assumption of continuum theory a surface consists\nat every moment of infinitely many particles. In particular, a particle joining the interface\ncoincides with the particle that was at that position before. For a particle which is leaving the\ninterface instantaneously another particle emerges. So although there is a many-to-one mapping between particles and the region in the surface that is occupied by them, we can assign\none representing particle for all possible particles at one point. We will call the representing\nparticle simply particle (see [TrTo]).\nThe position vector to a point on the surface was given in section 2 as a function of surface\ncoordinates and time (1) and is here denoted by a lower index S\nxS = xS (uα , t)\n\nwith α = 1, 2 .\n\n(31)\n\nAt a given time a particle on the surface is represented by a position vector, which is here\nalso denoted by a lower index S\nξ S = ξ S (uα0 ) .\n\n(32)\n\nWe take this position as the initial position and call it intrinsic surface reference configuration.\nConversely at a given time every position in the surface corresponds to a particle\nuα0 = uα0 (ξ S ) .\n\n4\n\n(33)\n\nFor a material volume with an internal interface Gauss theorem becomes (compare footnote 3)\nR\nH\nR\n∇*[φ v] dV = φ v*dA − Ã[[ φ ]] v*n dÃ.\n\n15\n\n\fObviously the initial position of a particle in the surface can be identified either by (32) or\nby (33). At another time the particle is given by another set of coordinates as a function of\nthe reference configuration of the particle and time\nuα = uα (uα0 , t) .\n\n(34)\n\nWith the assumption of a representing surface particle we established a one-to-one mapping\nbetween the coordinates of a surface particle and the surface coordinates, so that we can write\nreversely\nuα0 = uα0 (uα , t) .\n\n(35)\n\nEquations (34) and (35) describe the intrinsic motion of a surface particle within the surface,\nwithout knowing how the surface itself is moving.\nThe motion of a surface particle in space we get from the motion of the surface (31) and\nthe intrinsic motion of the surface particles on the surface (34), (35) as\nxS = xS (uα0 , t)\n\nor\n\nxS = xS (uα (uα0 , t), t) .\n\n(36)\n\nEquation (36) is not reversible in general. A position in space is corresponding to every surface\nparticle, but the converse is not true (as explained for phase change).\nA surface field variable is here denoted by φS . It can be given with (31) as a function of\nspace and time\nφS = φS (xS , t) .\n\nor\n\nφS = φS (uα , t) .\n\nOr it can be given with (36) as a function of particle and time\nφS = φS (uα0 , t)\n\nor\n\nφS = φS (uα (uα0 , t), t) .\n\nMaterial surface derivative The partial derivative of a surface field variable with respect to\ntime where the material surface coordinates are held constant is called material (or convected)\nsurface derivative and it is here denoted with DS\n\u0012\n\u0013\n∂φS\n∂φS (uα0 , t)\nDS φS\n=\n=\n.\nDt\n∂t\n∂t uα\n0\n\nIt is the rate of change of a surface field variable with respect to time an observer moving\nwith a surface particle would see. The material surface derivative of a position vector is the\nvelocity of a given surface particle\nv=\n\nDS xS\n.\nDt\n\n(37)\n\n16\n\n\fHere we did not denote v with a lower index S to be consistent with the balance equations\nas they will be given later. Surface balance equations are often conveniently given in spatial\nsurface coordinates. To obtain the surface material derivative of a surface field variable\nφS (uα (uα0 , t), t) in spatial surface coordinates the chain rule has to be applied\n∂φS\n∂φ Duα\nDS φS\n=\n+ αS\n.\nDt\n∂t\n∂u Dt\nWith the surface gradient (11)\n∂\n∂uα\nand the intrinsic surface velocity\n∇S = aα\n\nDuα\naα\n(38)\nDt\nthe material surface derivative becomes\n∂φS\nDS φS\n=\n+ w * ∇S φS .\n(39)\nDt\n∂t\nThe material surface derivative is the local rate of change at a position of a given surface\nparticle at a given time plus the convective rate of change related to the moving surface.\nw=\n\nVelocity of an interface particle relative to the velocity of a moving interface The material\nsurface derivative of the surface position vector xS (uα (uα0 , t), t) is by (39) given as\n∂xS\nDS xS\n=\n+ w * ∇S xS .\n(40)\nDt\n∂t\nThe partial derivative of the surface position vector with respect to time (where uα held\nconstant) is the velocity of the moving interface\n∂xS\n.\n(41)\n∂t\nFor the second term on the right hand side we have (w * ∇) xS = w (∇S ⊗ xS ) and the surface\ngradient (11) of the surface position vector is the surface identity tensor\nu=\n\n∂\n∂xS\n⊗ xS = a α ⊗\n= aα ⊗ aα = I S ,\n∂uα\n∂uα\nso that the material derivative of the surface position vector becomes\n∇S ⊗ xS = aα\n\n∂xS\nDS xS\n=\n+ w * ∇S xS ,\nDt\n∂t\nv = u+w .\n\n(42)\n\n(43)\n\n17\n\n\fThe intrinsic surface velocity is the velocity of a surface particle relative to the velocity of the\nsurface\nw =v−u.\n\n(44)\n\nNote that in general u has a normal and a tangential part, so that w is not necessarily the\ntangential part of v.\nSurface velocity for an implicit surface parametrization In section 2.3 we discussed the\ngeometrical properties of a surface defined by an implicit function F (xS (uα , t), t) = 0. Differentiating F = 0 with respect to time gives\n∂F ∂xi\n∂F\n∂F\n+ i\n=0\nand equivalently\n+ u * ∇F = 0 ,\n∂t\n∂x ∂t\n∂t\nwhere we dropped the subscript S at xS for simplicity.\n∇F\nWith the normal vector n = |∇F\n| as derived in (15) we can write either\nu*n=−\n\n∂F\n∂t\n\n|∇F |\n\nor\n\nu*n=u*\n\n∇F\n.\n|∇F |\n\n(45)\n\n(46)\n\nThe first equation is independent of the parametrization, so that all possible surface velocities\nhave the same normal component u * n, which is called the speed of displacement. It is\nconvenient to choose a parametrization such that the surface velocity becomes the surface\nnormal velocity\nu = (n ⊗ n) u = (u * n) n .\nThe surface defined by F (u, v, z, t) = z − h(u, v, t) has the surface position vector\nxS (u, v, t) = u ex + v ey + h(u, v, t) e z .\nFor an implicit surface parametrization the surface velocity is the surface normal velocity and\nis given by\n \n0\n∂xS\n \n(47)\nu=\n=0 .\n∂t\n∂h\n∂t\n\nDotting (43) with n gives\nvs * n = u * n +\n= u*n.\n\nDuα\naα * n\nDt\n\n18\n\n\f3.4 Reynolds transport theorem and divergence theorem for a surface\nIn the balance equations we also need the Reynolds transport theorem for an interface, which\nis not material if we allow phase change. However, we can always assume the interface to be\ncomposed of a fixed set of particles, as in section 3.3. For a quantity S0 continuously defined\nR\nover such an interface Ã0 , we write S0 = Ã0 φS dÃ. The rate of change of S0 with respect to\ntime is given by\nZ\nd\ndS0 (t)\nφS (xS , t) dÃ .\n=\ndt\ndt\nÃ0 (xS ,t)\n\nIn an Eulerian representation Ã0 (xS , t) depends on time. As for the Reynolds transport\ntheorem for a material\nthe area element is transformed with the surface Jacobian\n\u0012 volume\n\u0013\ndeterminant j = det\n\n∂xi\nS\ni\n∂ξS\n\nfrom spatial coordinates into material coordinates dÃ = j dÃ0 .\n\nThen Ã0 (ξ S ) does not depend on time and integration and differentiation can be interchanged,\nso that the time derivative becomes the material surface derivative (39)\nZ\nZ\n\u0011\nd\nDS \u0010\nφS j dÃ0 .\nφS dÃ =\ndt\nDt\nA0\n\nD j\n\nS\n= j ∇S * vS we get\nUsing the material surface derivative of the surface Jacobian Dt\n\u0012\n\u0013\n\u0013\n\u0012\nZ\nZ\nZ\n\u0011\nDS φS\nDS φS\nDS j\nDS \u0010\nφ j dÃ0 =\nj + φS\n+ φS ∇ * v S j dÃ0 .\ndÃ0 =\nDt S\nDt\nDt\nDt\n\nAfter transforming the area element back into spatial coordinates and by using the material\nsurface derivative (39) with the relative velocity (44) we get for the rate of change of S0 with\nrespect to time\n\u0013\nZ \u0012\nZ\nd\nDS φS\nφS dÃ =\n+ φS ∇ * v S dÃ ,\ndt\nDt\nÃ0\n\n=\n\nZ \u0012\n\n∂φS\n+ [vS − u] * ∇S φS + φS ∇ * v S\n∂t\n\n=\n\nZ \u0012\n\n∂φS\n+ ∇S * [φS v S ] − u * ∇S φS\n∂t\n\n\u0013\n\n\u0013\n\ndÃ ,\n\n(48)\n\ndÃ .\n\nThis is the Reynolds transport theorem for surfaces. Comparing the last equation with the\nReynolds transport theorem for material volumes (24) shows an additional term related to\nthe moving surface.\n\n19\n\n\fThe last equation of (48) can be transformed further. In this section we derive the divergence theorem for surfaces, which will be used here and again in section 4.3, so that we\nderive it using the abbreviation f = φS v S . Splitting f in normal and tangential part the\narea integral of the surface divergence of f becomes\nZ\nZ\nZ\n∇S * f dÃ = ∇S * [(f * n) n] dÃ + ∇S * [(f * b) b] dÃ .\n(49)\nApplying Product Rule to the first integrand on the right hand side gives\n∇S * [(f * n) n] = n * ∇S (f * n) + (f * n) ∇S * n = −2 H f * n ,\n| {z }\n=0\n\nwhere we invoked the definition of mean curvature (13) in section 2.2, and the fact that the\nsurface gradient (9) is perpendicular to the normal vector on the surface.\nThe second integral is an intrinsic area integral. The binormal vector b = t × n is\nn\nperpendicular to both the tangential vector\nt\nt along the curve and to the surface normal\nPSfrag replacements\nb\nvector, and therefore is the outward normal\nto the boundary curve as shown in figure 4.\nUsing Stokes theorem5 to transform the area\nFigure 4: Base vectors on a bounded surface\nintegral into a line integral\nZ\nI\n∇S * [(f * b) b] dÃ = (f * b) dC̃ .\nequation (49) becomes\nZ\nZ\nI\n∇S * f dÃ = − 2 H f * n dÃ + f * b dC̃ .\n\n(50)\n\nThis equation is called the divergence theorem for surfaces. (It should not be confused with\nthe divergence theorem in footnote 5.)\n\nAlternative version of the Reynolds transport theorem for surfaces Substituting (50) into\nthe last equation of (48) gives an alternative version of the Reynolds transport theorem for\nsurfaces\n\u0013\nZ \u0012\nI\nZ\n∂φS\nd\nφS dÃ =\n−u * ∇S φS −2 H φS v S * n dÃ+ φS v S * b dC̃.\n(51)\ndt\n∂t\nÃ0\n\n5\n\nStokes theorem entirely defined in surface vectors is given as:\n\n20\n\nR\n\n∇S * f dA =\n\nH\n\nf * b dC.\n\n\fThe rate of accumulation of a quantity in a surface can be interpreted as the rate of accumulation of the quantity in a material surface that equals the surface at a given time plus flux\narising from the moving surface, plus convective flux normal to the surface (curvature term)\nand convective flux through the boundary curve of the area.\n\n4 Generic model equations for two-phase flows with surface tension\nIn this section we derive the generic model equations for a problem with a moving interface.\nFirst we recall the balance equations for incompressible fluids and then we derive a differential\nbalance equation for a moving interface between two fluids, a so called jump condition. This\ninterface balance equation includes phase change, but to also include surface tension, a balance\nequation for the interface itself has to be formulated, which is then added to the balance\nequation for the bulk phases.\nThe material about balance equations in general is mainly based on [BiStLi] and [Sl99].\nFurther on [De] and [Hu]. The material about interface balance equations is mainly based\non [TrTo], [Sl07] and [Ed]. Some recent references on two phase flow problems are [IsHi], [Ko]\nand [GaPr].\n\n4.1 Balance equations for bulk fluids\nBalance equations are formulated for physical quantities that are continuously defined over a\nspatial region (for instances a volume), such as mass, momentum or energy. We denote those\nR\nquantities by B = V φ dV .\n\nBalance equation for a material volume A material (mass conserving) volume V0 is in\nR\ngeneral moving with time. A balance equation for a physical quantity B0 = V0 φ dV in a\nmaterial volume states that the rate of accumulation of the quantity in the material volume\nis given by an conductive flux of the quantity (not connected to mass) that enters the volume\nacross the surface plus supply of the quantity to the material volume6\nI\nZ\nZ\nd\nφ dV = − ζ * dA + π dV ,\n(52)\ndt\nV0\n\n6\n\nSome authors distinguish between supply of quantity to the volume and production of quantity within the\nvolume. Then conservation equations can be defined as balance equations without a production term.\nHowever, it is more intuitive to distinguish only between surface terms and volume terms.\n\n21\n\n\fwhere ζ is the efflux density and π is the supply density. The surface element vector dA =\nn dA is directed outwards, normal to the surface. As before we drop the integration limits\nexcept in the case, where the derivative of the integral is taken. With the Reynolds transport\ntheorem (24) the balance equation (52) for a material volume becomes\n\u0013\nZ \u0012\nI\nZ\n∂φ\n+ ∇ * [φ v] dV = − ζ * dA + π dV .\n(53)\n∂t\nBalance equation for a stationary volume To derive a balance equation for a stationary\nvolume the Reynolds transport theorem in the form of (25) is substituted for the right hand\nside of (52)\nI\nI\nZ\nZ\n∂φ\ndV + φ v * dA = − ζ * dA + π dV .\n∂t\nNow the integration domain of the volume integral on the left hand side is constant and\ndifferentiation and integration can be interchanged. This gives the balance equation for a\nstationary volume\nZ\nI\nI\nZ\nd\nφ dV = − φ v * dA − ζ * dA + π dV .\n(54)\ndt\nR\nThis equation has again a physical meaning: The accumulation of B = φ dV in a stationary\nvolume is given by convective and conductive flux of quantity across the surface to the volume\nplus supply of quantity to the volume.\nDifferential balance equation For numerical computations a differential version of the balance equation is preferable. The starting point is equation (53)\n\u0013\nI\nZ\nZ \u0012\n∂φ\n+ ∇ * [φ v] dV = − ζ * dA + π dV .\n∂t\n\nUsing the divergence theorem (see footnote 3 in section 3.1) for the surface integral, we get\n\u0013\nZ \u0012\n\u0002\n\u0003\n∂φ\n+ ∇ * φ v + ζ − π dV = 0 .\n∂t\nThis equation must hold for any arbitrary volume so that we get the differential balance\nequation\n∂φ\n+ ∇ * (φ v) = −∇ * ζ + π .\n(55)\n∂t\nAlthough this equation represent the same physical phenomenon as before (accumulation,\nflux, supply) the various terms cannot be interpreted in the same way as the integral balance\nequations.\n\n22\n\n\f4.2 Jump conditions at an interface between two fluids\nNext we derive balance equations for an interface between two homogeneous bulk phases with\nphase change (condensation or evaporation).\nBalance equation for a material volume with a singular interface\n(52) for a quantity B0 in a material volume\nI\nZ\nZ\nd\nφ dV = − ζ * dA + π dV\ndt\n\nThe balance equation\n\nV0\n\nholds for a material volume whether or not the volume has a singular interface. The rate of\naccumulation in V0 = Vl + Vg is the sum of the rate of accumulation in the volumes Vl and Vg\nZ\nZ\nZ\nd\nd\nd\nφ dV =\nφ dV +\nφ dV .\ndt\ndt\ndt\nV0\n\nVl\n\nVg\n\nThe volumes Vl and Vg are not material, so we use Reynolds transport theorem for an arbitrary\nvolume with a singular interface (30). Substituting (30) for the left hand side of (52) gives\nthe balance equation for a material volume with a singular interface\n\u0013\nI\nZ\nZ hh\nZ \u0012\ni\n∂φ\nφ (v − u) * n dÃ = − ζ * dA + π dV .\n(56)\n+ ∇ * [φ v] dV +\n∂t\nÃ\n\nThe double brackets denote again the difference between the two values at the surface.\nTo derive a differential form of (56), a special volume in a form of a small box is considered, which is moving together with the\nn\nAh\ninterface as shown in figure 5. Two faces of\nthe box are parallel to the interface. By taking the limit of the shorter side faces AhPSfrag\n→ 0 replacements\nthe volume integrals vanish and Al and Ag\nmerge with Ã. For the volume integrals to\nvanish their integrands must be limited (but\nFigure 5: Volume in form of a box\nnot necessary continuous). Then the normal vectors of the two outer faces of the box\n\n23\n\n\ftransform into either n or −n and only the surface integral over the interface Ã remains\nZ \u0010h\nh\ni\nh\ni\u0011\nφ (v − u) * n + ζ l * (−n) − ζ g * n dÃ = 0 .\nÃ\n\nThe integral must hold for any arbitrary surface so that the integrand must be zero\nhh\ni hh\ni\nφ [v − u] * n + ζ * n = 0 .\n\n(57)\n\nEquation (57) is called a jump condition and describes the phase change at the interface and\nthe conductive flux across the interface [Sl07].\nThis jump condition describes phase change and conductive flux across the surface, but it\ndoes not allow for modeling intrinsic surface properties such as surface tension (we took the\nlimit of Ah → 0).\n\n4.3 Balance equation and jump condition including surface tension\nBased on the assumption that a fluid interface is actually a three-dimensional region with a\nthickness of maybe one or more molecule diameters, the effect of the interface on the adjoining\nbulk fluids can be represented by assuming a two-dimensional interface consisting of surface\nexcess mass. Surface mass is assumed to have similar properties as three-dimensional mass,\nsuch as surface density, surface viscosity, surface tension and so on. Then, analogous to the\nbalance equation of three dimensional continua, a balance equation for the interface can be\ngiven. Adding this derived interface balance equation to the balance equation for a material\nvolume with a singular interface gives a balance equation which includes surface tension.\n\nBalance equation for a surface The interface between condensate and vapor is not material,\nthe fluid velocity differs from the velocity of the surface. Nevertheless a balance equation\nsimilar to the balance equation (52) for a material volume can be given, as explained in\nR\nsection 3.3. For a quantity S0 continuously defined over a surface Ã we write S0 = Ã φS dÃ.\nThen a balance equation for S0 states that the rate of accumulation of surface quantity in\nthe surface Ã is given by conductive flux of surface quantity across the boundary curve of the\n\n24\n\n\fsurface plus supply of surface quantity at the surface\nI\nZ\nZ\nd\nφS dÃ = − ζ S * dC̃ + πS dÃ ,\ndt\n\n(58)\n\nÃ\n\nwhere ζ S is the surface flux density and πS is the surface supply density. The line element\nvector dC̃ = m dC̃ is directed outwards normal on the boundary curve, see figure 4 in\nsection 3.4. Using Reynolds theorem for a surface (48), equation (58) becomes\n\u0013\nZ \u0012\nI\nZ\n∂φS\n+ ∇S * [φS v S ] − u * ∇S φS dÃ = − ζ S * dC̃ + πS dÃ .\n(59)\n∂t\nDifferential balance equation for a surface To derive a differential version of (59) we transform the line integral into an area integral using the surface divergence theorem (50)\n\u0013\nZ \u0012\n\u0002\n\u0003\n∂φS\n+ ∇S * [φS v S ] − u * ∇S φS + ∇S * ζ S + 2 H ζ S * n − πS dÃ = 0 ,\n∂t\n\nwhere H is the mean curvature. This equation must hold for any arbitrary area so that the\ndifferential surface balance equation is given as\n\u0002\n\u0003\n∂φS\n+ ∇S * [φS v S ] − u * ∇S φS = − ∇S * ζ S + 2 H ζ S * n + πS .\n∂t\n\n(60)\n\nBalance equation including phase change and surface tension Adding the surface balance\nequation (59) to the balance equation for a material volume with a singular interface (56)\ngives a balance equation that includes phase change and surface tension\nZ \u0012\n+\n\n\u0013\nZ hh\ni\n∂φ\nφ (v − u) * n dÃ\n+ ∇ * [φ v] dV +\n∂t\n\nZ \u0012\n\nÃ\n\n\u0013\n∂φS\n+ ∇S * [φS v S ] − u * ∇S φS dÃ\n∂t\nI\nI\nZ\nZ\n= − ζ * dA − ζ S * dC̃ + π dV + πS dÃ . (61)\n\nJump condition including phase change and surface tension From (61) we derive a jump\ncondition in the same way as discussed in the last section. Transforming the line integral into\nan area integral using the surface divergence theorem (50) and considering a small volume\n\n25\n\n\fenclosing the interface which we let shrink into a surface gives\nhh\n\ni hh\ni\n∂φ\nφ [v − u] * n + ζ * n = − S − ∇S * [φS v S ] + u * ∇S φS\n∂t\n\u0002\n\u0003\n− ∇S * ζ S + 2 H ζ S * n + πS .\n\nIf there is no material accumulation (no mass) in the surface, the surface density variables φS\nand πS are zero and from the right hand side, only the underlined terms remain:\nhh\ni hh\ni\nφ [v − u] * n + ζ * n = −∇S * ζ S − 2 H n * ζ S .\n(62)\n\nThis jump condition describes conductive flux across the interface, phase change and surface\ntension. We made no additional assumption other than assume a continuous surface, in\nparticular we do not allow the interface to break off.\n\n5 Model equations with phase change and surface tension\nIn this section the balance equations for mass, momentum and energy for two incompressible\nfluids and for the interface between them are obtained and we discuss appropriate simplifications. In the last section we summarize the deduced system of partial differential equations\nincluding the jump conditions and discuss boundary conditions for the system of partial differential equations.\n\n5.1 Mass, momentum and energy equation\nMass The mass balance equation for an incompressible fluid is given by (55) with φ = ρ\nand ζ = π = 0\n∂ρ\n+ ∇ * (ρ v) = 0 ,\n∂t\n\n(63)\n\nwhich gives with the assumption of constant density\n∇*v =0.\n\n(64)\n\nIf the Mach number of a fluid is small compared to unity the fluid can be considered as an\nincompressible fluid [BiStLi].\nFor momentum and energy another balance equation which makes use of (63) is more\npreferable. For that we substitute φ in (55) by ρ ψ, apply product rule on both terms on the\n\n26\n\n\fleft side and receive\n∂(ρ ψ)\n+ ∇ * [(ρ ψ) v] = ψ\n∂t\n\n\u0014\n\u0015\n\u0015\n∂ψ\n∂ρ\n+ ∇ * (ρ v) +ρ\n+ v * ∇ψ .\n∂t\n∂t\n{z\n}\n|\n\u0014\n\n=0\n\nThe first bracket is zero according to (63). The second bracket is the material derivative of ψ\nas derived in section 3.1.\n∂ψ\nDψ\n=\n+ v * ∇ψ .\nDt\n∂t\nThus we get the generic balance equation (55) in an equivalent form\nρ\n\nDψ\nDt\n\n= −∇ * ζ + π ,\n\n(65)\n\nMomentum The momentum equation we get by substituting in (65) ψ = v, ζ = −S and\nπ = ρ g (where ψ and π are vectors and ζ is a second order tensor)\n\u0015\n\u0014\n∂v\n+ v * ∇v = ∇ * S + ρ g .\n(66)\nρ\n∂t\nThe stress tensor can be divided into a contribution of the fluid at rest and the fluid in motion,\nS = −p I + T . The body force vector is the gravity vector g assuming that there are no other\nbody forces.\nIf the fluids are Newtonian (linearly viscous) fluids the (deviatoric part of the) stress tensor\n\u0002\n\u0003\n′\nfor both phases is given by T = μ ∇v + (∇v)T + μ3 (∇ * v), with shear viscosity μ and\nmodified bulk viscosity μ′ . Together with the incompressibility condition the momentum\nequation\n\u0015\n\u0014\n∂v\n+ v * ∇v = −∇p + μ ∇2 v + ρ g\nρ\n∂t\nthen forms the well known Navier-Stokes equations.\nNote that if we had derived the momentum equation from (55), the divergence term in the\nconvective term would be nonlinear. The advantage of deriving the momentum equation from\n(65) is that the divergence term is then linear which makes numerical discretization easier.\n\n27\n\n\fEnergy According to the first law of thermodynamics the increase of internal and kinetic\nenergy in a material control volume is given by heat supply plus power due to work acting on\nthe fluid. The differential equation governing the energy is\n\u0012\n\u0013\nv2\nD\ne+\n= (∇ * [Sv] + ρ g * v) + (−∇ * q + ρ z) ,\n(67)\nρ\nDt\n2\n\nwhere e is the internal energy per unit mass, Sv is the power due to surface forces per unit\narea, ρ g * v is the gravity power per unit volume, q the heat flux per unit area and z the heat\n2\nproduction per unit volume, which is zero in our case. Here ψ = e + v2 , ζ = −Sv + q and\nπ = ρ g *v +ρ z. To get the energy in a more commonly used form, we subtract the mechanical\nenergy equation from (67). The mechanical energy equation is formed by the scalar product\nof momentum equation and velocity. By this we get7\n\u0014\n\u0015\n∂e\nρ\n+ v * ∇e = −∇ * q + S • ∇v .\n∂t\n\nAssuming that the heating effect of friction can be neglected, the dissipative term T • ∇v is\nzero. Moreover, S • ∇v vanishes since S • ∇v = T • ∇v − p (I • ∇v) = −p (∇ * v) = 0.\nConstitutive equations for internal energy and heat flux complete the equations. For small\ntemperature differences internal energy can be described by a linear function e = c (T − T0 ) +\ne(T0 ), where c is the specific heat capacity. The heat flux is given by Fourier's law q = −λ∇T ,\nwhere λ is the heat conductivity. This results in the heat equation\n\u0014\n\u0015\n∂T\nρc\n+ v * ∇T\n= λ ∇2 T .\n∂t\n\nThe material properties viscosity, heat capacity and heat conductivity are in general functions of density, pressure and temperature, but for incompressible fluids only temperature\ndependency need to be considered. If the temperature interval between the two phases is\nsmall the material properties can be assumed to be constant.\n\n5.2 Mass, momentum and energy jump conditions\nMass We start with (62). Assuming the bulk variables φ = ρ and ζ = 0, and the surface\nvariable ζ S = 0, gives for the mass jump condition at the interface\nhh\ni\nρ [v − u] * n = 0 .\n(68)\n\nEquation (68) states that the amount of mass flux that enters the interface must also leave\nthe interface ṁl = ṁg (so we can omit the index).\n7\n\nHere we used the identity ∇ * (Sv) = (∇ * S) * v + S\n\n•\n\n28\n\n∇v\n\n\fMomentum To get the momentum jump condition at the surface between condensate and\nvapor, we set in (62) φ = ρ v, ζ = −S and ζ S = −S S . As for the stress tensor, the surface\nstress tensor can be divided into two components S S = σI S + T S , where I S is the surface\nidentity tensor (9). Assuming a surface without mass we have T S = 0 and from the surface\nstress tensor, only the interfacial tension remains S S = σ I S , where σ is the surface tension\ncoefficient, see section 4.3. Surface tension can be understood as the counterpart of the\npressure in the bulk fluid. With this substitution the momentum jump condition becomes\ni hh\ni\nhh\nρv [v − u] * n − Sn = ∇S σ + 2 H σ n .\n(69)\n\nIf we neglect temperature dependency of the surface tension coefficient (no Marangony effects)\nσ is constant within the surface.\nWe split the vector equation (69) into three scalar equations by multiplying it first with the\nnormal vector and then with the two tangential vectors. The tangential equations are equal,\nso we skip the third equation and use the symbol t to denote both hhtangential\nvectors. Further\ni\nwe make use of (68) and the assumption of no-slip at the surface v * t = 0. Then we get\nhh\n\ni hh i hh\ni\nṁ v * n + p − n * T n = 2 H σ ,\nhh\ni\nt * Tn = 0 .\n\n(70)\n(71)\n2\n\nEnergy The energy jump condition is with φ = ρ (e+ v2 ), ζ = −Sv+q, ζ S = (−σ I S + T S ) u =\n−σ u and by making the same assumptions as for the momentum jump condition given by\n\u0013\nhh \u0012\ni hh\ni h\ni\n\u0001\nv2\nρ e+\n[v − u] * n − n * Sv + q * n = ∇S * σ u + 2 H σ n * u ,\n(72)\n2\nwhere e is the internal energy. Instead of a balance equation for the internal energy a formulation with the enthalpy h = e + pρ is more convenient, because enthalpy is a measurable\nquantity whereas internal energy is not easy to measure.\nWriting n * Sv = v * Sn (S is symmetric), splitting the vectors on the left side of (72) into\ntheir normal and tangential components according to a * b = (a * n)(b * n) + (a * t)(b * t), and\n\u0001\napplying the chain rule to ∇S * σ u gives\nhh\n\n\u0012\n\n(v * n)2 (v * t)2\nṁ e +\n+\n2\n2\n\n\u0013i\n\nhh\nii hh\ni\n− (v * n) (n * Sn) + (v * t) (t * Sn) + q * n\n\n= σ ∇S * u + u * ∇S σ + 2 H σ n * u . (73)\n\n29\n\n\fSubtracting from the energy jump condition (73) the scalar product of surface velocity u =\n(u * n) n and momentum jump condition (69)\nhh\ni hh\ni\nṁ (u * n)(v * n) − (u * n) (n * Sn) = u * [∇S σ + 2 H σ * n]\n\ngives together with the no-slip condition and the tangential momentum jump condition (71)\nafter rearranging the pressure term\nhh\n\n\u0012\n\n\u0013 i hh\ni h\ni\np (v * n)2\n− [v − u] * n (n * T n) + q * n\nṁ e + +\n− (u * n)(v * n)\nρ\n2\n= σ ∇S * u .\n\nUsing again Chain Rule and that n * ∇S = 0 we get for the right hand side\nσ∇S * u = σ∇S * (u * n) n = σ (u * n) ∇S * n = 2 σ H u * n\nExpanding the kinetic energy term\nhh (v * n)2 i\n2\n\n=\n\nhh (v * n − u * n)2\n2\n\n+ (v * n)(u * n) −\n\n(u * n)2 i\n2\n\nand noting that the surface velocity jump is zero gives the energy jump condition as\nhh\n\ni hh ([v − u] * n)2 i hh\ni hh\ni\nṁ h + ṁ\n− [v − u] * n (n * T n) + q * n = 2 σ H u * n .\n2\n\n(74)\n\nIf kinetic energy, viscous energy and the effect of surface tension can be neglected, the energy\njump condition for an interface between two fluids becomes\nhh\ni\nṁ ∆h + q * n = 0 ,\n(75)\n\nhh i\nwhere ∆h = h is the latent heat of vaporization.\n\n5.3 Summary of the model equations\nThe two fluids (i = l, g) are described by the continuity equation for an incompressible fluid,\nthe momentum equation and the energy equation:\nContinuity equation\n\nconst. density\n\n∇ * vi = 0\n\n30\n\n\fNewtonian fluid\nconst. viscosity\n\nMomentum equation\n\u0013\n\u0012\n∂v i\n+ v i * ∇v i = − ∇pi + μi ∇2 vi + ρi g\nρi\n∂t\npressure\ngravity\nfriction\ninertia\n\nEnergy equation\n\u0012\n\u0013\n∂Ti\nρi ci\n+ v i * ∇Ti =\n∂t\n\nno dissipation\nconst. heat conductivity\nconst. thermal capacity\n\nλi ∇2 Ti\n\nheat conduction\n\ntransient + convection\n\nThe jump conditions\nat the interface between the two fluids for mass, momentum and\nhh i\nenergy are with φ := φg − φl (dropping the tilde on the normal and tangential vectors):\nMass\n\nhh\n\nρ [v − u] * n\n\ni\n\n=\n\nhh\n\nṁ\n\ni\n\nmass flux\n\nconst. surface tension coefficient\nno slip between both phases\n\nMomentum\nhh\n\nṁ v * n\n\ni\n\nmomentum\ndue to\ncondensation\n\nhh i\np\n\n+\n\nsurface pressure\n\nhh\ni\n− n*T *n =\nhh\n\nt*T *n\n\ni\n\n2H σ\n\nsurface tension\n\n= 0\n\nshear stress\n\nEnergy\nṁ ∆h\n\ncondensation\n\n=\n\nhh\n\nq*n\n\ni\n\nheat flux\n\n\u0002\n\u0003\nwith T = μ ∇v + (∇v)T and q = −λ∇T .\n\n31\n\nno kinetic energy\nno dissipation\n\n\fBoundary conditions As many boundary conditions for each coordinate of an unknown are\nnecessary as the equation has derivatives of this unknown. One more equation is missing and\nfor this we take the condition of thermodynamic equilibrium at the interface, according to\nwhich the fluid temperatures are equal at the moving surface\nTl = Tg .\n\n(76)\n\nFrom the five jump conditions we need one equation to calculate the mass flux, so that\nfour equations remain to calculate the boundary conditions for three velocity components,\npressure and temperature. We can use either the mass jump condition or the energy jump\ncondition to calculate the mass flux.\nFrom the remaining equations either the mass jump condition or the normal momentum\njump condition can be used to calculate one velocity boundary condition, depending on which\nequation is used to compute the mass flux. Which of the two equations is used depends on\nfurther simplifications of the problem. Often the term with the mass flux in the normal\nmomentum jump condition is small and can be dropped, then this equation is not available\nto calculate the mass flux.\nThe second and third velocity boundary condition are taken from the tangential momentum\njump conditions.\nSI Units of some variables and material properties\n\n32\n\n\fH\nS\nT\nT\nc\ne\ng\nα\n∆h\nṁ\np\nq\nu, v\nμ\nλ\nρ\nσ\n\nm−1\nN m−2\nN m−2\nK\nJ kg−1 K−1\nJ kg−1\nm s−2\nW m−2 K−1\nJ kg−1\nkg s−1 m3\nN m−2\nJ m−2 s−1\nm s−1\nkg m−1 s−1\nW m−1 K−1\nkg m−3\nN m−1\n\nmean curvature\nstress tensor (J = kg m s−2 )\nviscous stress tensor\ntemperature (C = K - 273,15)\nspecific heat capacity (J = N m)\nspecific internal energy\ngravity vector (g = 9, 81 m s−2 )\nheat transfer coefficient (W = J s−2 )\nlatent heat of vaporization\nvolume specific mass flux\npressure\nheat flux vector\nvelocity\ndynamical viscosity\nthermal conductivity\ndensity\nsurface tension\n\nReferences\n[Ap]\n\nTom M. Apostol, Calculus, Wiley, Vol. 2, 2nd ed. 1969.\n\n[Ar]\n\nRutherford Aris, Vectors, Tensors and the Basic Equations of Fluid Mechanics,\nDover Publications, 1989.\n\n[BiStLi] R. Byron Bird and Warren E. Stewart and Edwin N. Lightfoot, Transport phenomena, Wiley and Sons, 2002 (1960).\n[ChMa] Alexandre J. Chorin and Jerrold E. Marsden, A Mathematical Introduction to Fluid\nMechanics, Springer, 1993 (1990, 1979).\n[De]\n\nWilliam M. Deen, Analysis of Transport Phenomena, Oxford University Press, 1998.\n\n[Ed]\n\nDavid A. Edwards and Howard Brenner and Darsh T. Wasan, Interfacial transport\nprocesses and rheology, Butterworth-Heinemann, 1991.\n\n[Er]\n\nA. Cemal Eringen, Continuum Physics, Academic Press, Vol. 1, 1971.\n\n33\n\n\f[GaPr]\n\nRene Gatignol and Roger Prud'homme, Mechanical and hermodynamical modeling\nof fluid interfaces, World Scientific Publishing, 2001.\n\n[Gi]\n\nJ. Willard Gibbs, Collected Works, Longmanns, Vol. 1, p,218, 1828.\n\n[Hu]\n\nKolumban Hutter and Klaus D. Jöhnk, Continuum Methods of Physical Modeling,\nSpringer, 2005.\n\n[IsHi]\n\nMamrou Ishii and Takashi Hibiki, Thermo-fluid Dynamics of Two-Phase Flow,\nSpringer, 2006.\n\n[Ka]\n\nWilfried Kaplan, Advanced Calculus, Addison-Wesley, 2002 (..., 1993).\n\n[Ko]\n\nNikolay I. Kolev, Multiphase Flow Dynamics 1: Fundamentals, Springer, 2007.\n\n[Kü]\n\nWolfgang Kühnel, Differential Geometry: Curves - Surfaces - Manifolds, American\nMathematical Societey, 2005, (2003).\n\n[Op]\n\nJohn Oprea, The mathematics of soap films: Explorations with Maple, American\nMathematical Societey, 2000.\n\n[Scha]\n\nHeinz Schade and Klaus Neemann, Tensoranalysis, de Gruyter, 2006 (1997).\n\n[Sc]\n\nL.E. Scriven, Dynamics of a fluid interface, Chem. Eng. Sci., Vol. 12, p. 98-108,\n1960.\n\n[Sl99]\n\nJohn C. Slattery, Advanced Transport Phenomena, Cambridge University Press,\n1999.\n\n[Sl07]\n\nJohn C. Slattery, Interfacial transport phenomena, Springer, 2007 (1990),\n\n[TrTo]\n\nClifford A. Truesdell and Richard Toupin, The classical field theories, in Handbuch\nder Physik, Bd.III/1, Springer, 1960.\n\n34\n\n\f"}