{"id": "http://arxiv.org/abs/0709.2732v2", "guidislink": true, "updated": "2008-05-12T18:57:29Z", "updated_parsed": [2008, 5, 12, 18, 57, 29, 0, 133, 0], "published": "2007-09-17T22:16:15Z", "published_parsed": [2007, 9, 17, 22, 16, 15, 0, 260, 0], "title": "Radial flow afterburner for event generators and the baryon puzzle", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1696%2C0709.3998%2C0709.2376%2C0709.3897%2C0709.2459%2C0709.0309%2C0709.3569%2C0709.4650%2C0709.3296%2C0709.2129%2C0709.2495%2C0709.2595%2C0709.1185%2C0709.2559%2C0709.0970%2C0709.4505%2C0709.0085%2C0709.0918%2C0709.2116%2C0709.0180%2C0709.2160%2C0709.3843%2C0709.1264%2C0709.0516%2C0709.1092%2C0709.2146%2C0709.0842%2C0709.3743%2C0709.3056%2C0709.0785%2C0709.0147%2C0709.2100%2C0709.0245%2C0709.4549%2C0709.3406%2C0709.2807%2C0709.3737%2C0709.1595%2C0709.4528%2C0709.2055%2C0709.2852%2C0709.1066%2C0709.3793%2C0709.0197%2C0709.3237%2C0709.2203%2C0709.4246%2C0709.1549%2C0709.0579%2C0709.4577%2C0709.3442%2C0709.1539%2C0709.2714%2C0709.0937%2C0709.0964%2C0709.3966%2C0709.1634%2C0709.1808%2C0709.3397%2C0709.3828%2C0709.3492%2C0709.0403%2C0709.0877%2C0709.3177%2C0709.2022%2C0709.3950%2C0709.1883%2C0709.2196%2C0709.1545%2C0709.1753%2C0709.4492%2C0709.0423%2C0709.2709%2C0709.4621%2C0709.4642%2C0709.3340%2C0709.4441%2C0709.0678%2C0709.4179%2C0709.2732%2C0709.1638%2C0709.2227%2C0709.2468%2C0709.0684%2C0709.3536%2C0709.0479%2C0709.3224%2C0709.1002%2C0709.1360%2C0709.0752%2C0709.4228%2C0709.3574%2C0709.0622%2C0709.0992%2C0709.0114%2C0709.1024%2C0709.3055%2C0709.2683%2C0709.4637%2C0709.2952%2C0709.2668&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Radial flow afterburner for event generators and the baryon puzzle"}, "summary": "A simple afterburner including radial flow to the randomized transverse\nmomentum obtained from event generators, Pythia and Hijing, has been\nimplemented to calculate the $p/\\pi$ ratios and compare them with available\ndata. A coherent trend of qualitative agreement has been obtained in $pp$\ncollisions and in $Au+Au$ for various centralities. Those results indicate that\nthe radial flow does play an important role in the so called baryon puzzle\nanomaly.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.1696%2C0709.3998%2C0709.2376%2C0709.3897%2C0709.2459%2C0709.0309%2C0709.3569%2C0709.4650%2C0709.3296%2C0709.2129%2C0709.2495%2C0709.2595%2C0709.1185%2C0709.2559%2C0709.0970%2C0709.4505%2C0709.0085%2C0709.0918%2C0709.2116%2C0709.0180%2C0709.2160%2C0709.3843%2C0709.1264%2C0709.0516%2C0709.1092%2C0709.2146%2C0709.0842%2C0709.3743%2C0709.3056%2C0709.0785%2C0709.0147%2C0709.2100%2C0709.0245%2C0709.4549%2C0709.3406%2C0709.2807%2C0709.3737%2C0709.1595%2C0709.4528%2C0709.2055%2C0709.2852%2C0709.1066%2C0709.3793%2C0709.0197%2C0709.3237%2C0709.2203%2C0709.4246%2C0709.1549%2C0709.0579%2C0709.4577%2C0709.3442%2C0709.1539%2C0709.2714%2C0709.0937%2C0709.0964%2C0709.3966%2C0709.1634%2C0709.1808%2C0709.3397%2C0709.3828%2C0709.3492%2C0709.0403%2C0709.0877%2C0709.3177%2C0709.2022%2C0709.3950%2C0709.1883%2C0709.2196%2C0709.1545%2C0709.1753%2C0709.4492%2C0709.0423%2C0709.2709%2C0709.4621%2C0709.4642%2C0709.3340%2C0709.4441%2C0709.0678%2C0709.4179%2C0709.2732%2C0709.1638%2C0709.2227%2C0709.2468%2C0709.0684%2C0709.3536%2C0709.0479%2C0709.3224%2C0709.1002%2C0709.1360%2C0709.0752%2C0709.4228%2C0709.3574%2C0709.0622%2C0709.0992%2C0709.0114%2C0709.1024%2C0709.3055%2C0709.2683%2C0709.4637%2C0709.2952%2C0709.2668&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A simple afterburner including radial flow to the randomized transverse\nmomentum obtained from event generators, Pythia and Hijing, has been\nimplemented to calculate the $p/\\pi$ ratios and compare them with available\ndata. A coherent trend of qualitative agreement has been obtained in $pp$\ncollisions and in $Au+Au$ for various centralities. Those results indicate that\nthe radial flow does play an important role in the so called baryon puzzle\nanomaly."}, "authors": ["Eleazar Cuautle", "Guy Paic"], "author_detail": {"name": "Guy Paic"}, "author": "Guy Paic", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0954-3899/35/7/075103", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.2732v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.2732v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 5 figures. To appear in Journal of Physics G", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.2732v2", "affiliation": "ICN-UNAM", "arxiv_url": "http://arxiv.org/abs/0709.2732v2", "journal_reference": "J.Phys.G35:075103,2008", "doi": "10.1088/0954-3899/35/7/075103", "fulltext": "arXiv:0709.2732v2 [hep-ph] 12 May 2008\n\nRadial flow afterburner for event generators and the\nbaryon puzzle\nE. Cuautle and G. Paic\nDepartamento de Fı́sica de Altas Energı́as\nInstituto de Ciencias Nucleares,\nUniversidad Nacional Autónoma de México, México D.F., C.P. 04510.\nE-mail: ecuautle@nucleares.unam.mx,guypaic@nucleares.unam.mx\nAbstract. A simple afterburner to add radial flow to the randomized transverse\nmomentum obtained from event generators, PYTHIA and HIJING, has been\nimplemented to calculate the p/π ratios and compare them with available data. A\ncoherent trend of qualitative agreement has been obtained in pp collisions and in\nAu + Au for various centralities. Those results indicate that the radial flow does\nplay an important role in the so called baryon puzzle anomaly.\n(Some figures in this article are in color only in the electronic version)\n\nPACS numbers: 25.75.Ld,13.60.Le,13.60.Rj\n\nSubmitted to: J. Phys. G: Nucl. Part. Phys.\n\n\fRadial flow afterburner for event generators and the baryon puzzle\n\n2\n\n1. Introduction\nThe study of heavy ion collisions at the Relativistic Heavy Ion Collider (RHIC) has\nbrought about very strong evidence for the creation of a very high energy density,\nlow baryon chemical potential, medium which cannot simply be described in terms of\nhadrons [1]. Prominent demonstrations of this new medium created are: parton energy\nloss, evidence for very rapid thermalization of the hot plasma created in collisions from\nthe measurement of azimuthal flow, and abundant production of baryons compared to\nthe case of the some yields observed in proton proton collisions. The first effect we\nmention i.e. the parton energy loss in the hot plasma results in a suppression of the\nyield of high pt (pt > 4 GeV/c) mesons by a factor of ≈ 5 compared to the one measured\nin pp collisions. This is quantified by the parameter RAA given by\nRAA =\n\n)AA\n( d2dN\npT dy\n)pp\nTAA (b)( d2dN\npT dy\n\n(1)\n\nand/or the measurement of the disappearance of \"away side\" jets. TA A(b) is the\noverlap function between the two nucleons, as function of the impact parameter, b.\nThe measurement of the same ratio for baryons (p, p̄,Λ and Λ̄) have brought a surprise:\nthe value of RAA was completely different from the one observed for pions indicating a\nmuch lesser apparent suppression or, what is more probable, an increase in the baryon\nproduction in the range where the excess is observed. This effect was not predicted by\ntheory contrary to the parton energy loss and the azimuthal flow, and up to date does\nnot have a completely satisfactory explanation. This somewhat anomalous behavior\nof the baryon production is called the baryon puzzle and refers to the p/π + and p̄/π −\nratios measured in the heavy ion collisions and even in pp collisions.\nThe studies of particle production as a function of pt , in the momentum regions\nwhere identification is possible at RHIC, exhibit the following behavior: the p/π + and\np̄/π − ratios increase with pt up to ≈ 2 GeV/c and then start to decrease for higher pt\nin both pp [2] and Au + Au [2, 3, 4] collisions, reaching a value which corresponds to\nthe fragmentation value observed in e+ e− collisions for quarks and gluons [5].\nThe spectra at pt < 2 GeV/c have been observed to follow a mt [6] and xT [2] scaling,\nconsistent with a transition between soft and hard processes at around pt ≈ 2 GeV/c.\nThe surprise lies in the fact that one would expect a ratio that does not exceed the\nfragmentation value i.e. ≈ 0.2 as observed in e+ e− collisions, while in the experiment\nthe ratio rises up to more than one!\nIn the literature two possible explanation are prominently put forward:\n• the hydrodynamical approach [7, 8, 9] where one assumes a local thermal\nequilibrium of partonic/hadronic matter at an initial time, describing the spacetime evolution of thermalized matter by solving the equations for energy-momentum\nconservation in the hydro picture. Another model, where the radial flow and the\nsize of the system of emitting particles are taking into account [10], can describe\nthe proton to pion ratio for different centralities.\n\n\fRadial flow afterburner for event generators and the baryon puzzle\n\n3\n\nThe hydrodynamical picture has been used to explain the broad features of the\nincrease in the baryon/meson ratio with limited success by Kolb and Heinz [11].\n• A large class of models called generically \"coalescence\" where the particle species\nratios observed in the intermediate pT regime (2-6 GeV/c) of heavy ion collisions\nare explained by a collective production mechanism, namely recombination or\ncoalescence [12]. In most coalescence models hadrons are assumed to form from\nessentially collinear partons. The parton overlap function is sometimes simply\nassumed to be a delta function, or at best in some cases small finite transverse\nwidths have been used, assuming an xT distribution like one expects to see in\nthe final state hadron, such that the partons do not have to undergo a change in\nmomentum when forming a hadron. Although the coalescence models have been\naccepted, they do not provide a satisfactory response to many questions [13].\nFurthermore in our opinion there also is a fundamental contradiction between the fitting\nof the spectra with the coalescence approach which involves also some flow contribution and the thermal analysis where, by a simultaneous fit to the slopes of pions, kaons\nand protons one extracts the temperature and the corresponding flow [14]. Since the\ncoalescence approach does change the proton slope with respect to the one of the\nmesons even in absence of flow, the temperature–flow analysis should be reconsidered if\nthe coalescence model is to be accepted. Recently, experimental data measured at two\ndifferent energies also indicate that the trend of the coalescence models do no fit the\ndata [15]\nIt is a fact that none of the models have been tested in a wide centrality and energy\nrange or with different projectiles, so that the success of this approach should be questioned.\nWe present a toy model that illustrates the possibility to reproduce the observed\nratios for p/π + using a model to incorporate the flow in the existing event generators.\nThe aim is to demonstrate that the radial flow, as claimed in hydro calculations, does\nhave a considerable influence on p/π + ratios in a wide range of centralities starting from\npp collisions. One might ask why are we including the proton collisions in these considerations - knowing that it is difficult to expect flow in so light a colliding system. We\ninclude the pp collisions because in the conventional radial flow analysis of STAR [16],\nmaking a simultaneous fit to the slopes of pion, kaon and proton spectra an \"equivalent\nflow\" of ≈ 0.2c is found. The measured value is of course much smaller than the one\nobtained in the most central Au + Au collisions where the value of flow reaches ≈ 0.6c.\nThe remainder of this work is organized as follows: in section 2, we give a brief\ndescription of the event generators, the section 3 describes our toy model of flow used to\ndescribe experimental data. In section 4, the results of our model and their comparison\nto experimental Au + Au and p + p results are presented. Finally some conclusion are\ndrawn in section 5.\n\n\fRadial flow afterburner for event generators and the baryon puzzle\n\n4\n\n2. The event generators\nThe main tool of comparison of the measured with the existing knowledge is compiled\nin the so called event generators. Among them the most prominent is the PYTHIA[17]\ngenerator for the proton-proton collisions and the HIJING [18] generator for the heavy\nion collisions. We should mention that even proton-proton collision can be studied\nusing HIJING. The version 6.2 of PYTHIA, does not reproduce the proton to pion\nratio [2] with its default parameters. The possibility to improve the situation by\nincluding the Leading Order(LO) and Next to Leading Order (NLO) corrections which\nare implemented in PYTHIA by the so called K-factor, has been explored. The\nrequirement of a K-factor may indicate collective phenomena in pp collisions as in heavy\nions data [19]. The K-factor as function of the energy has been extracted [9] together\nwith other phenomena as energy loss for hard partons and temperature effects to explain\nthe pt spectra. Those studies indicate that while the pion spectra can be described with\nthe default PYTHIA settings, (i.e. QCD processes at leading order) the proton spectra\nrequire the inclusion of a K-factor [19]!! (QCD processes with higher order corrections).\nHence it is not possible to reach a consistent reproduction of the experimental data.\nThe HIJING generator dedicated to heavy ion reactions does not reproduce the proton\nspectra in a similar way as PYTHIA. One has to add that neither of them includes\nthe radial flow in the simulation, an important issue to describe results of heavy ions\ncollisions.\nWe use the PYTHIA 6.3 generator with the popcorn baryon production mechanism. One can change parameters in the event generator, like the fragmentation function, and/or the hadronization mechanism. Recently it has been shown [20] that the\ndifferences in the proton/pion ratio at 200 GeV among different baryon production\nmechanisms are not very large so that we limit ourselves to the use of the popcorn\nhadronization mechanism in the PYTHIA generator - the one that is expected to give\nthe best conditions for proton production. The HIJING 1.32 event generator has been\nused to generate Au + Au and pp events, with default values of the parameters, for\ninstance, including partonic energy loss, shadowing effects, among other phenomena.\nThe pp collision with HIJING was generated with the default set of parameters.\n\n3. Radial flow: our model\nThe radial flow is understood as representing the azimuthally symmetric collective\naspects of the interacting hadronic medium [14], depending on the collision energy. The\nrelevant observable to study the radial flow is the transverse momentum of the particles.\nFor each particle, the random thermal motion is superimposed onto the collective radial\nflow velocity. Consequently, the invariant pt distributions depends on the temperature\nat freeze out, the particle mass, and the velocity profile of the flow. The experimental\ndata on radial flow at RHIC indicate that the kinetic freeze out temperature and the\n\n\fRadial flow afterburner for event generators and the baryon puzzle\n\n5\n\nobserved flow are anti-correlated. The temperature decreases with centrality while the\nflow velocity increases [16, 20, 21]. From the most peripheral to the most central the\nflow for heavy ions collisions rises from ≈ 0.3c to ≈ 0.6c.\nWe propose to introduce radial flow, to event generators as follow: in a first step we\ngenerate flow-free pion and proton spectra using an event generator to produce particles.\nWe are assuming that a fireball, thermalized, and expanding was created in the collision.\nThe expansion produces an additional momentum to the one created in the collisions\nusing event generators. This contribution we call momentum of the radial flow pt,f given\nby pt,f = γmβ, where γ is the Lorentz factor, β is the profile velocity and m is the mass\nof the particle under consideration. This radial component is generated in a random way\nin the transverse plane and is added vectorially to the transverse momenta produced\nby the generators, supposed not to contain flow. Once the vector sum is achieved, the\ntransverse momentum pt , of each particle generated includes now the radial flow. Then\nwe can select the pions and protons and estimate the ratio comparing the results with\nand without flow versus experimental data.\nThe radial flow described above can be added to any event generator in order to compare\namong them and with the experimental data.\n4. Results from our model versus data\nThe flow contribution considerably alters, as expected, the shape of the momentum\nspectra in the range 0 to ∼ 4 GeV/c. The Fig. 1 represents a typical momentum\nspectrum for pions (left) and protons (right), obtained for central Au + Au collisions\nwith a velocity profile of the flow, β = 0.5c. In the same figure we show the PHENIX\nspectra [3] to show the degree of agreement between the spectra obtained with our\nmodel and data. Spectra for pp collisions using HIJING or PYTHIA shown in the Fig. 2\nindicate that there are notable differences above 1 GeV/c, between the two generators.\nThe differences are probably due to the parton distribution functions used and/or the\nfragmentation functions.\n4.1. Au + Au collisions at 200 GeV\nFig. 3 shows the results of our calculation including the flow in the generator, for the\nproton to pion ratio for Au + Au collisions, compared to two experimental results,\nPHENIX [3] and STAR [15] for the most central collision. We also plotted the results\nwithout flow (β = 0.0c), to illustrate the importance of the flow the contribution to the\nratio. The other centralities are also reasonably described using lower flow parameters,\nfollowing the experimental results, as shown in Fig. 4. Without trying to get the best\nfit, the distributions show a qualitative agreement with the experimental results with a\nrise and a subsequent decrease of the ratio at pt values from ≈ 2.5 − 3 GeV/c onwards,\nfor the three different centralities.\n\n\f6\n\nRadial flow afterburner for event generators and the baryon puzzle\n\n104\n\n104\n\nt\n\n3\n\nt\n\n3\n\n10\n\n10\n\n102\n\n102\n\n10\n\n10\n\n1\n\n1\n\n10-1\n\n10-1\n\n10-2\n\n10-2\n\n-3\n\n-3\n\n10\n\n10\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\n4.5\n\n5\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\np (GeV/c)\n\n2.5\n\n3\n\n3.5\n\n4\n\n4.5\n\n5\n\np (GeV/c)\n\nt\n\nt\n\nFigure 1. pt spectra for pions (left) and protons (right) obtained applying the\nafterburner to Au + Au central collisions generated by HIJING with a flow of 0.5c.\n\n106\n\ndN/dpt\n\n0\n\np: p spectrum\nt\np: p PHENIX Data\n\nt\n\ndN/dp\n\ndN/dp\n\nt\n\nπ+ : p spectrum\nt\nπ+ : p PHENIX Data\n\nPt for π from Pythia\nPt for π from Hijing pp\n\n105\n\n104\n103\n\n102\n\n10\n0\n\n0.5\n\n1 1.5\n\n2\n\n2.5\n\n3\n\n3.5 4 4.5 5\nPt (GeV/c)\n\nFigure 2. pt spectra of pions as, generated for pp collisions with PYTHIA and\nHIJING event generators.\n\n\f7\n\nP/π+\n\nRadial flow afterburner for event generators and the baryon puzzle\n\n2\n\nPHENIX data (0-10)%\nSTAR data (0-12)%\nRatio with flow, β=0.0 c\nRatio with flow, β=0.5 c\n\n1.8\n1.6\n1.4\n1.2\n1\n0.8\n0.6\n0.4\n0.2\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n8\nPt (GeV/c)\n\nFigure 3. Proton to pion ratios obtained with the present model with and without\nflow, compared to data from PHENIX and STAR for most central collisions.\n\n1.2\n\n1.2\n\nPHENIX data (20-30)%\n\nPHENIX data (60-92)%\n\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nRatio with flow, β=0.3 c\n\nP/π+\n\nP/π+\n\nRatio with flow, β=0.43 c\n\n3.5\n\n4 4.5 5\nPt (GeV/c)\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n6\nPt (GeV/c)\n\nFigure 4. Proton to pion ratios obtained with the present model compared to data at\ntwo different centralities. The data are from PHENIX. The solid lines were obtained\nas the ratio of the fits to the simulated proton and pion spectra.\n\n\f8\n\n4\n\nRatio with flow, β=0.5 c ; 62.4 GeV\nRatio with flow, β=0.0 c; 62.4 GeV\nSTAR data (0-10)%;\n62.4 GeV\n\n3.5\n\n1.8\n\nRatio with flow, β=0.5 c ; 62.4 GeV\nRatio with flow, β=0.0 c; 62.4 GeV\nSTAR data (0-10)%;\n62.4 GeV\n\nP / π-\n\nP/π+\n\nRadial flow afterburner for event generators and the baryon puzzle\n\n1.6\n1.4\n\n3\n\n1.2\n2.5\n1\n2\n0.8\n1.5\n0.6\n1\n\n0.4\n\n0.5\n0\n0\n\n0.2\n1\n\n2\n\n3\n\n4\n\n5\nPt (GeV/c)\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n8\nPt (GeV/c)\n\nFigure 5. Proton to pion ratio from our model compared to central Au + Au data\nat 62.4 GeV. The left part shows the results for p/π + while the right part shows the\np̄/π − ratio.\n\n4.2. Au + Au collisions at 62.4 GeV\nThe data for protons at 62.4 GeV are difficult to analyze using HIJING. The HIJING\ngenerator at this energy, namely, overestimates grossly the proton production with\nrespect to pions. This is due, in our opinion, to the fact that HIJING overestimates the\ncontribution of valence quarks at these momenta thus grossly overestimating the proton\nproduction compared to the antiproton one, in the same way as it underestimates the\np̄/p ratio at these momenta. In the left part of the Fig. 5, we show the results of the\nHIJING predictions of p/π compared with and without the afterburner versus data.\nThe results are completely different for anti-proton to pion ratio. The right part of the\nFig. 5, show the p̄/π − data of STAR[15] with the HIJING predictions with and without\nafterburner. It is visible that the two predictions are completely different and that the\nafterburner again qualitatively reproduces the data although they suggests perhaps a\nsomewhat larger flow. Let us note that the trend of our model is to predict the position\nof the maximum ratio at lower momenta than at 200 GeV in agreement with the data,\nwhile the coalescence models used in ref [15] show an opposite behavior.\n4.3. pp collisions\nThe fact that even the ratios obtained in pp collisions cannot be satisfactorily explained\nwith current generators as discussed by [2], prompted us to apply our model to them\nsince the experimental analysis of the spectra in pp yields a value of 0.2c like in the\ncase of peripheral Au + Au collisions. We show in Fig. 6 the results obtained for\n\n\f9\n\nRadial flow afterburner for event generators and the baryon puzzle\n\n1.2\n\n1.2\n\nPHENIX data (60-92)%\n\nPHENIX data (60-92)%\n\n1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0\n0\n\n1\n\n2\n\n3\n\nRatio with flow, β=0.6 c\n\nP/π+\n\nP/π+\n\nRatio with flow, β=0.2 c\n\n4\n\n5\n6\nPt (GeV/c)\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n6\nPt (GeV/c)\n\nFigure 6. Proton to pion ratio from HIJING compared to peripheral Au + Au data\n(left). The same data compared with PYTHIA generation and flow 0.6c is shown in\nthe right. The solid lines were obtained as the ratio of the fits to the simulated proton\nand pion spectra.\n\nthe very peripheral - quasi pp like collisions using our afterburner one with HIJING\n(left) and one with PYTHIA (right). We find that PYTHIA requires a very large\nflow to fit the data while HIJING with a moderate flow similar to the one extracted\nfrom the experiments, fits reasonably well. This illustrates that the ratio depends\ncrucially on the \"initial spectrum\", as discussed in section 2 (fragmentation functions,\nparton distribution functions, etc.). Also it should be mentioned that the HIJING\nevent generator implements the nuclear effects like shadowing, energy loss, etc. even in\nperipheral collisions.\nResults from STAR [2] pp collisions have been compared with HIJING events. In Fig. 7\nwe show this ratio. As in the case of peripheral data a good agreement is achieved\nincorporating the radial flow to the HIJING spectra, albeit the flow used is somewhat\nlarger than the one found experimentally.\n5. Conclusions\nWe have introduced radial flow in existing event generators (PYTHIA and HIJING) via\nan afterburner. The flow parameters that fit reasonably well the experimental results\nboth in the proton to pion ratio and the pt spectra are very close to the ones extracted\nfrom experiments in a thermal analysis. The success in reproducing qualitatively the\ndata in a wide range of centralities, and in a large range of transverse momentum\nindicates that the presence of radial flow should be taken in consideration in any attempt\nto explain the so called proton puzzle.\n\n\fRadial flow afterburner for event generators and the baryon puzzle\n\n1.2\n\n10\n\nP/π+\n\nRatio with flow, β=0.3 c\nSTAR (pp )\n\n1\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n6\nPt (GeV/c)\n\nFigure 7. Proton to pion ratio from pp collisions using HIJING, compared to pp data\nfrom STAR experiment. The solid line was obtained as the ratio of the fits to to the\nsimulated proton and pion spectra.\n\nIn the present work we did not try to reproduce in details the ratios experimentally\nobserved for two reasons; first the systematical and statistical errors of the experimental\nresults and second as has been shown the \"initial condition\" of the generator\nhave influences on the shape of the spectra leads to difference in the results after\nimplementation of the radial flow.\nThe inclusion of a flow in pp reactions is not justified in terms of an expanding thermal\nsystem, but since the analysis of the pion kaon and proton spectra do yield something\nthat may be termed \"flow\" we can perhaps infer that the outward motion of jets produces\nan effect which does modify the hadron spectra in pp collisions.\n6. Acknowledgments\nWe would like to thank A. Morsch for helpful discussions. This work was supported\nin part by PAPIIT project IN116508 and CONACyT under grant numbers 52162-F,\n40025-F, 44268-F .\nReferences\n[1] BRAHMS Collaboration, I. Arsene et al., Nucl. Phys. A 757 (2005) 1; PHOBOS Collaboration,\nB.B. Back et al., Nucl. Phys. A 757 (2005) 28; STAR Collaboration, J. Adams et al., Nucl.\nPhys. A 757 (2005) 102; PHENIX Collaboration, K. Adcox et al., Nucl. Phys. A 757 (2005)\n184.\n[2] STAR Collaboration, J. Adams, et. al., Phys.Lett. B 637 (2006) 161.\n[3] PHENIX Collaboration, S.S. Adler, et. al., Phys.Rev. 69 (2004) 034909\n\n\fRadial flow afterburner for event generators and the baryon puzzle\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n\n[13]\n[14]\n[15]\n\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\n11\n\nSTAR Collaboration,. J. Adams et. al., Phys. Rev. Lett. 92 (2004) 052302.\nOPAL Collaboration, G. Abbiendi et. al., Eur. Phys. J. C 16 (2000) 407.\nM. Heinz (for STAR Collaboration), J. Phys. G. 31 (2005) S1011.\nT. Hirano and Y. Nara, Phys.Rev. C 69 (2004) 034908.\nT. Peitzmann, Nucl. Phys. A 727 (2003) 179.\nK. J. Eskola, H. Honkanen, H. Niemi, P.V. Ruuskanen, and S.S Rasanen, Phys. Rev. C 72, (2005)\n044904\nA. Ayala, E. Cuautle, J. Magnin, L.M Montaño, Phys.Rev. C 74 (2006) 064903., A. Ayala, E.\nCuautle, J. Magnin, L.M. Montaño, A. Raya, Phys.Lett. B 634 (2006) 200.\nP. F. Kolb and U. W. Heinz, nucl-th/0305084.\nD. Molnar,Nucl. Phys. A 774 (2006) 266; R. J. Fries, B. Muller, C. Nonaka and S. A. Bass,\nPhys. Rev. Lett. 90 (2003) 202303; Phys.Rev. C68,044902(2003); Rudolph. C. Hwa and C.B.\nYang.Phys. Rev. C70 (2004) 024905.\nT. Peitzmann, Acta Phys. Hug. A27 (2006) 363.\nNA44 Collaboration, I.G. Bearden, et. al., Phys. Rev. Lett. 78 (1997) 2080.\nSTAR Collaboration, B. I. Abelev, et. al., Phys. Lett. B655 (2007) 104.\nV. Greco, C.M. Ko and I Vitev, Phys. Rev. C 71 (2005) 041901(R).\nI. Vitev and M. Gyulassy, Phys. Rev. C 65 (2002) 041902(R); Nucl. Phys. A 715 (2003) 779c.\nSTAR Collaboration, J. Adams et. al., Nucl. Phys. A757 (2005) 102, and references therein.\nT. Sjöstrand et. al., PYTHIA 6.3 Physics and Manual (hep-ph/0308153).\nMiklos Gyulassy, Xin-Nian Wang, Comput. Phys. Commun. 83 (1994) 307.\nMark T. Heinz (for STAR collaboration), hep-ex/0606020.\nALICE Collaboration, B. Alessandro, et. al., J. Phys. G 30 (2006) 1295-2040.\nO. Y. Barannikova,(for STAR Collaboration), J. Phys. G 31 (2005) S93.\n\n\f"}