{"id": "http://arxiv.org/abs/1201.6452v2", "guidislink": true, "updated": "2012-04-27T20:01:49Z", "updated_parsed": [2012, 4, 27, 20, 1, 49, 4, 118, 0], "published": "2012-01-31T06:06:06Z", "published_parsed": [2012, 1, 31, 6, 6, 6, 1, 31, 0], "title": "Four Point Functions of the Stress Tensor and Conserved Currents in\n  AdS_4/CFT_3", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.2119%2C1201.5258%2C1201.3886%2C1201.4572%2C1201.5784%2C1201.1711%2C1201.2816%2C1201.3790%2C1201.1300%2C1201.5363%2C1201.2286%2C1201.4192%2C1201.6665%2C1201.1381%2C1201.4742%2C1201.6253%2C1201.1764%2C1201.4217%2C1201.1091%2C1201.4393%2C1201.5288%2C1201.1311%2C1201.4832%2C1201.5131%2C1201.5599%2C1201.5122%2C1201.6466%2C1201.1925%2C1201.1078%2C1201.6484%2C1201.5992%2C1201.0571%2C1201.1144%2C1201.4150%2C1201.5341%2C1201.2774%2C1201.3923%2C1201.0716%2C1201.4114%2C1201.2352%2C1201.3439%2C1201.1642%2C1201.1786%2C1201.0709%2C1201.0725%2C1201.1934%2C1201.6375%2C1201.1696%2C1201.2059%2C1201.4630%2C1201.5063%2C1201.6685%2C1201.1239%2C1201.5081%2C1201.2697%2C1201.1216%2C1201.1205%2C1201.3369%2C1201.4770%2C1201.4428%2C1201.4129%2C1201.6003%2C1201.3816%2C1201.1128%2C1201.0956%2C1201.1268%2C1201.0256%2C1201.3928%2C1201.6441%2C1201.3785%2C1201.5707%2C1201.0109%2C1201.4027%2C1201.5606%2C1201.2757%2C1201.4432%2C1201.0338%2C1201.3472%2C1201.2521%2C1201.2178%2C1201.0644%2C1201.5898%2C1201.6431%2C1201.0435%2C1201.4850%2C1201.4729%2C1201.3062%2C1201.4914%2C1201.6386%2C1201.0719%2C1201.5878%2C1201.5268%2C1201.4199%2C1201.6452%2C1201.1766%2C1201.2193%2C1201.6235%2C1201.0697%2C1201.1421%2C1201.1617%2C1201.0340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Four Point Functions of the Stress Tensor and Conserved Currents in\n  AdS_4/CFT_3"}, "summary": "We compute four point functions of the stress tensor and conserved currents\nin AdS_4/CFT_3 using bulk perturbation theory. We work at treel level in the\nbulk theory, which we take to be either pure gravity or Yang Mills theory in\nAdS. We bypass the tedious evaluation of Witten diagrams using recently\ndeveloped recursion relations for these correlators. In this approach, the four\npoint function is obtained as the sum of residues of a rational function at\neasily identifiable poles. We write down an explicit formula for the four point\ncorrelator with arbitrary external helicities and momenta. We verify that,\nprecisely as conjectured in a companion paper, the Maximally Helicity Violating\n(MHV) amplitude of gravitons or gluons appears as the coefficient of a\nspecified singularity in the MHV stress-tensor or current correlator. We\ncomment on the remarkably simple analytic structure of our answers in momentum\nspace.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1201.2119%2C1201.5258%2C1201.3886%2C1201.4572%2C1201.5784%2C1201.1711%2C1201.2816%2C1201.3790%2C1201.1300%2C1201.5363%2C1201.2286%2C1201.4192%2C1201.6665%2C1201.1381%2C1201.4742%2C1201.6253%2C1201.1764%2C1201.4217%2C1201.1091%2C1201.4393%2C1201.5288%2C1201.1311%2C1201.4832%2C1201.5131%2C1201.5599%2C1201.5122%2C1201.6466%2C1201.1925%2C1201.1078%2C1201.6484%2C1201.5992%2C1201.0571%2C1201.1144%2C1201.4150%2C1201.5341%2C1201.2774%2C1201.3923%2C1201.0716%2C1201.4114%2C1201.2352%2C1201.3439%2C1201.1642%2C1201.1786%2C1201.0709%2C1201.0725%2C1201.1934%2C1201.6375%2C1201.1696%2C1201.2059%2C1201.4630%2C1201.5063%2C1201.6685%2C1201.1239%2C1201.5081%2C1201.2697%2C1201.1216%2C1201.1205%2C1201.3369%2C1201.4770%2C1201.4428%2C1201.4129%2C1201.6003%2C1201.3816%2C1201.1128%2C1201.0956%2C1201.1268%2C1201.0256%2C1201.3928%2C1201.6441%2C1201.3785%2C1201.5707%2C1201.0109%2C1201.4027%2C1201.5606%2C1201.2757%2C1201.4432%2C1201.0338%2C1201.3472%2C1201.2521%2C1201.2178%2C1201.0644%2C1201.5898%2C1201.6431%2C1201.0435%2C1201.4850%2C1201.4729%2C1201.3062%2C1201.4914%2C1201.6386%2C1201.0719%2C1201.5878%2C1201.5268%2C1201.4199%2C1201.6452%2C1201.1766%2C1201.2193%2C1201.6235%2C1201.0697%2C1201.1421%2C1201.1617%2C1201.0340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We compute four point functions of the stress tensor and conserved currents\nin AdS_4/CFT_3 using bulk perturbation theory. We work at treel level in the\nbulk theory, which we take to be either pure gravity or Yang Mills theory in\nAdS. We bypass the tedious evaluation of Witten diagrams using recently\ndeveloped recursion relations for these correlators. In this approach, the four\npoint function is obtained as the sum of residues of a rational function at\neasily identifiable poles. We write down an explicit formula for the four point\ncorrelator with arbitrary external helicities and momenta. We verify that,\nprecisely as conjectured in a companion paper, the Maximally Helicity Violating\n(MHV) amplitude of gravitons or gluons appears as the coefficient of a\nspecified singularity in the MHV stress-tensor or current correlator. We\ncomment on the remarkably simple analytic structure of our answers in momentum\nspace."}, "authors": ["Suvrat Raju"], "author_detail": {"name": "Suvrat Raju"}, "author": "Suvrat Raju", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.85.126008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1201.6452v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1201.6452v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "44 pages. Zipped source includes a Mathematica notebook (v2)\n  discussion section revised", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1201.6452v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1201.6452v2", "journal_reference": null, "doi": "10.1103/PhysRevD.85.126008", "fulltext": "arXiv:1201.6452v2 [hep-th] 27 Apr 2012\n\nPreprint typeset in JHEP style - HYPER VERSION\n\nHRI/ST/1202\n\nFour Point Functions of the Stress Tensor and\nConserved Currents in AdS4 /CFT3\n\nSuvrat Raju\nHarish-Chandra Research Institute,\nChatnag Road, Jhunsi,\nAllahabad 211019.\n\nAbstract: We compute four point functions of the stress tensor and conserved currents in\nAdS4 /CFT3 using bulk perturbation theory. We work at treel level in the bulk theory, which\nwe take to be either pure gravity or Yang Mills theory in AdS. We bypass the tedious evaluation of Witten diagrams using recently developed recursion relations for these correlators. In\nthis approach, the four point function is obtained as the sum of residues of a rational function\nat easily identifiable poles. We write down an explicit formula for the four point correlator\nwith arbitrary external helicities and momenta. We verify that, precisely as conjectured in a\ncompanion paper, the Maximally Helicity Violating (MHV) amplitude of gravitons or gluons\nappears as the coefficient of a specified singularity in the MHV stress-tensor or current correlator. We comment on the remarkably simple analytic structure of our answers in momentum\nspace.\nKeywords: AdS/CFT, correlation functions, recursion relations, S-matrix.\n\n\fContents\n1. Introduction\n\n1\n\n2. Spinor Helicity Formalism\n\n3\n\n3. Three Point Transition Amplitudes\n\n5\n\n4. Formulas for Four Point Functions\n\n16\n\n5. MHV Correlators for Conserved Currents\n\n22\n\n6. MHV Correlators for the Stress Tensor\n\n32\n\n7. Discussion\n\n40\n\n1. Introduction\nIt is remarkable that even fifteen years after AdS/CFT was discovered [1] there are very few\nexplicit computations of boundary correlation functions, at four points or higher, from the\nbulk point of view [2]. In principle, such computations are straightforward: we need to link\ninteraction vertices with bulk-bulk and bulk-boundary propagators, and integrate over their\npositions [3]. However, in practice these computations are difficult for two reasons. First, it\nis hard to do the bulk integrals in closed form, although this can be sidestepped by using\nclever tricks [4] or by transforming to Mellin space [5]. However, in theories like gravity the\ninteraction vertices themselves are very complicated. For example, the four point vertex, even\nin four dimensional flat space, contains 2,850 terms [6] and is even more complicated in AdS.\nConsequently, the four point function of the stress tensor has never before been computed\nexplicitly.\nIn this paper, we point out that going to momentum space on the boundary in AdS4\nsolves both these problems at once for correlators of conserved currents of the stress tensor.\nIn AdS4 , the momentum-space bulk to boundary and bulk to bulk propagators for gluons\nand gravitons can be written in terms of elementary functions and so doing z-integrals is very\nsimple.\nFurthermore, by generalizing insights from flat space computations of gravity and YangMills amplitudes [7, 8], we are able to sidestep the tedious evaluation of interaction vertices.\nInstead, we compute explicit expressions for the four point functions of the stress tensor by\n\n–1–\n\n\fusing the known three point functions as input and combining this with a knowledge of the\nanalytic properties of the correlators.\nMore specifically, we implement the recursion relations proposed in a companion paper\n[9]. These relations allow us to write down a formula for the four point function in terms of\nresidues of a rational function, at specific poles. This rational function is obtained through\nthe product of two deformed three point \"transition amplitudes\" as we explain in more detail\nin section 4.\nIn [9], it was pointed out that momentum space also allows us to take an elegant \"flat\nspace limit.\" Here we take the flat space limit of our results for correlation functions of the\nstress tensor and obtain exactly the famous formulas for maximally helicity violating (MHV)\namplitudes of gluons and gravitons in 4 dimensional flat space.\nTo facilitate this comparison, we write our results for MHV correlators in the spinor\nhelicity formalism that was originally developed for four dimensional flat space amplitudes\nbut, as pointed out in [10], is also useful for computations in AdS4 .\nApart from this flat space limit, our answers have some other interesting structural properties. For example, we can immediately see the contribution of the entire conformal block\nof the stress tensor itself in the correlator. Once again momentum space makes this simple.\nHere, we just have to multiply correlators to get the contribution of the primary and all its\ndescendants rather than worrying about the complicated expressions for conformal blocks in\nposition space.\nSecond, the transition amplitudes that appear in our computations are finite. So we\navoid the divergences that appear in momentum space AdS integrals from the region near\nthe boundary. An interesting consequence of this is that the correlators can be written as\nrational functions of the external spinors, and norms of partial sums of the external momenta.\nIn particular we do not find any logarithms in our answers. We comment more on this\ninteresting fact in the discussion section\nA brief overview of this paper is as follows. We start by reviewing the spinor helicity\nformalism in section 2. The four point computations require three point transition amplitudes,\nwhich are very similar to correlators, but are obtained by replacing a bulk to boundary\npropagator with a normalizable mode. We compute these three point functions for Yang-Mills\ntheory and gravity in section 3. In section 4, we use these results to write down an explicit\nformula for the four point function in terms of residues of a rational function at pre-specified\npoles. In section 5, we evaluate this formula for correlators of conserved currents, with\ntwo positive helicity and two negative helicity insertions, using the spinor helicity formalism\nand verify that, in the flat space limit, it reduces to the scattering amplitude of gluons, as\nconjectured in [9]. In section 6, we evaluate this formula for stress tensor correlators, with the\nsame combination of helicities, and, once again verify, that in the flat space limit it reduces\nto the maximally helicity violating amplitude of gravitons.\nThe main idea of this paper is presented in 4 and the reader who is not interested in the\nfine details of four point correlators can skip straight to this section. Moreover, we should\nwarn the reader that some of the computations in section 5 and 6 are a little heavy on algebra.\n\n–2–\n\n\fFor this reason, we have provided a Mathematica program (available from the source of the\narXiv version of this paper) that can be used to automate the formulas that are implemented\nthere.\n\n2. Spinor Helicity Formalism\nWe start by reviewing the spinor helicity formalism for correlation functions in 3 dimensional\nconformal field theories that was introduced in [10].\nWe will use the mostly positive metric. So, for two vectors on the boundary\nk * k = (k1 )2 + (k2 )2 − (k0 )2 .\n\n(2.1)\n\nIn this paper, just as in [9] we use bold-face for vectors but not their components. We use i, j\netc. for boundary spacetime indices and μ, ν etc. for bulk spacetime indices. We use m, n etc.\nto index particle-number but one difference from [9] is that here it is convenient to place this\nindex in subscripts rather than superscripts. Also, the components of a momentum vector\ncome with a naturally lowered index.\nOur σ matrix conventions are the following\n!\n!\n10\n01\n0\n1\nσαα̇ =\n, σαα̇ =\n,\n01\n10\n!\n!\n(2.2)\n0 −i\n1 0\n2\n3\nσαα̇ =\n, σαα̇ =\n.\ni 0\n0 −1\nGiven a three momentum k = (k0 , k1 , k2 ), we convert it into spinors using\nkαα̇ = k0 σα0 α̇ + k1 σ 1 + k2 σ 2 + i|k|σ 3 = λα λ̄α̇ ,\nwhere\n|k| ≡\n\nq\n√\nk * k = k12 + k22 − k02 .\n\n(2.3)\n\n(2.4)\n\nIf k is spacelike to start with, then the σ 3 component will be imaginary.\nIn components, we have the following expressions for the spinors\nk1 + ik2 \u0001\n,\nk0 + i|k|, p\nk0 + i|k|\np\nk1 − ik2 \u0001\nλ̄ =\n.\nk0 + i|k|, p\nk0 + i|k|\n\nλ=\n\np\n\n(2.5)\n\nWe have the freedom to rescale the spinors by any complex number: λ → αλ, λ̄ → α1 λ̄\nwithout changing the momentum. If we do this with spinors corresponding to an external\nparticle, then this rescales the polarization vectors and amplitudes pick up a simple phase.\nHowever, when we use the recursion relations, we also need spinors for an internal particle\nwhen we cut a propagator to form the product of two amplitudes. In such cases, λint and\n\n–3–\n\n\fλ̄int always come together and so we can rescale them without any physical effect at all. For\nexample, we could choose:\nλint = 1,\n\nk1 + ik2 \u0001\n,\nk0 + i|k|\n\n(2.6)\n\u0001\n\nλ̄int = k0 + i|k|, k1 − ik2 .\nWe can raise and lower spinor indices using the ǫ tensor. We choose the ǫ tensor to be\niσ2 for both the dotted and the undotted indices. This means that\nǫ01 = 1 = −ǫ10 ,\n\n(2.7)\n\nand spinor dot products are defined via\nhλ1 , λ2 i = ǫαβ λ1α λ2β , = λ1α λα2 ,\n\nλ̄1 , λ̄2 = ǫα̇β̇ λ̄1α̇ λ̄2β̇ = λ1α̇ λ̄α̇1 .\n\n(2.8)\n\nHowever, we should expect our expressions for CFT3 correlators to only have a manifest\nSO(2, 1) invariance. This means that we might have mixed products between dotted and\nundotted indices. Such a mixed product extracts the z-component of vector and is performed\nby contracting with σ 3\n\u0002\n\u0003\n2i|k| = (σ 3 )αα̇ kαα̇ ≡ λ, λ̄ ,\n(2.9)\nThe reader should note that we use square brackets only for this mixed product; products of\nboth left and right handed spinors are denoted by angular brackets. Second, we note that\nthis mixed dot product is symmetric:\n\u0002\n\u0003 \u0002\n\u0003\nλ, λ̄ = λ̄, λ .\n(2.10)\nWhen we take the dot products of two 3-momenta, we have\n\u0001\nk * q ≡ k1 q1 + k2 q2 − k0 q0\n\u0003\u0011\n\u0003\u0002\n1\u0010\n1\u0002\n= − hλk , λq i λ̄k , λ̄q +\nλk , λ̄k λq , λ̄q .\n2\n2\n\n(2.11)\n\nNote that we have made a choice of the metric that is mostly positive.\nAnother fact to keep in mind is that\nk1 + k2 = k3\n⇒ λ1 λ̄1 + λ2 λ̄2 = λ3 λ̄3 +\n\n\u0003\u0001\n\u0003 \u0002\n\u0003 \u0002\n1 \u0002\nλ1 , λ̄1 + λ2 , λ̄2 − λ3 , λ̄3 σ 3 .\n2\n\n(2.12)\n\nWe also need a way to convert dotted to undotted indices. We write\nλ̂α̇ = σα3 α̇ λα ,\nThis has the property that\n\nD\n\nˆ = σ 3 λ̄α̇ .\nλ̄\nα\nαα̇\n\nE\nμ̄, λ̂ = [μ̄, λ] ,\n\n–4–\n\n(2.13)\n\n(2.14)\n\n\fwhere the quantity on the right hand side is defined in (2.9).\nWith all this, we can write down polarization vectors for conserved currents. The polarization vectors for a momentum vector k associated with spinors λ, λ̄ are given by\nˆ λ̄\nˆ λ̄\nλ̄\nλ̄\nα α̇\nα α̇\n\u0002\n\u0003\n,\nǫ+\n=\n2\n=\nαα̇\ni|k|\nλ, λ̄\nǫ−\nαα̇\n\nThese vectors are normalized so that\n\nλ λ̂\nλα λ̂α̇\n\u0003 = α α̇ .\n= 2\u0002\ni|k|\nλ, λ̄\n\nǫ+ * ǫ+ = ǫ− * ǫ− = 0,\n\nǫ+ * ǫ− = 2.\n\n(2.15)\n\n(2.16)\n\nPolarization tensors for the stress tensor are just outer-products of these vectors with themselves:\n± ±\ne±\n(2.17)\nij = ǫi ǫj .\nIn this paper, we will compute three and four point functions functions of the stress\ntensor and conserved currents in momentum space:\nT (e1 , k1 , . . . , en , kn ) = e1i1 j1 . . . enin jn hT i1 j1 (k1 ) . . . T in jn (kn ),\n\n(2.18)\n\nwhere\nhT\n\ni1 j 1\n\n1\n\n(k ) . . . T\n\nin j n\n\nn\n\n(k )i ≡\n\nZ\n\no Pn\nn\nhT T i1 j1 (x1 ) . . . T in jn (xn ) iei m=1 km *xm dd xm ,\n\n(2.19)\n\nand T is the time-ordering symbol. Given the explicit formulas for polarization vectors,\nwe can also label correlators using the helicity and momenta of the various insertions. For\nexample:\n\u0001\n+\n−\n(2.20)\nT (+, k1 , +, k2 , −, k3 ) ≡ T e+\n1 , k1 , e2 , k2 , e3 , k3 .\n\nWe will use the same notation to refer to correlators of conserved currents, and the meaning\nshould be clear from the context.\n\n3. Three Point Transition Amplitudes\nIn this section we compute three point transition amplitudes that are an essential building\nblock for the four point computation. We start with Yang-Mills theory where the Feynman\nrules are quite easy to establish and then move on to gravity.\nWe remind the reader that transition amplitudes are computed by replacing one bulk\nto boundary propagator with a normalizable mode. Below, we use spinors λ1 , . . . λ3 , and\nλ̄1 , . . . λ̄3 to specify the three momenta in the amplitude. We will use p = −i|k3 | to indicate\nthat this leg is distinguished because it is the one that is associated with the normalizable\nmode.\n\n–5–\n\n\f3.1 Yang Mills Theory\nLet us first review the form of the gauge-boson bulk to boundary propagator in AdS4 . As\nwe will see below for both gauge-bosons and gravitons propagating in AdS4 , the bulk to\nboundary and bulk to bulk propagators are very simple in momentum space. This allows us\nto easily perform the z-integrals that appear in transition amplitudes.\nIt is convenient to work in \"axial gauge\" where we set the radial-component to 0. In this\ngauge, the non-normalizable free wave-functions in AdS (these are the same as the bulk to\nboundary propagators) are given by\nr\n1\n2\nǫi (|k|z) 2 eik*x K 1 (|k|z) = ǫi e−|k|z eik*x ; A0 = 0; ǫ * k = 0,\nAi =\n(3.1)\n2\nπ\nfor k2 > 0 i.e. for spacelike momenta. For timelike momenta, the modified Bessel function\nK should replaced by a Hankel function of the first kind - H (1) (|k|z). However, it is more\nconvenient to continue using the expressions above and simply interpret |k| as an imaginary\nquantity when k is timelike.1\nThis normalization of the bulk-boundary propagators is chosen so that the two point\nfunction of the currents is normalized as:\n\u0001\n(3.2)\nT (ǫ1 , k1 , ǫ2 , k2 ) = −(2π)3 iδ3 (k1 − k2 ) ǫ1 * ǫ2 |k1 |.\nBelow, we will also need the normalizable free wave-function of the gauge field, which is:\n1\n\nAi = ǫi z 2 eik*x J 1 (|k|z);\n2\n\nA0 = 0;\n\nǫ * k = 0,\n\n(3.3)\n\nand exists only for timelike momenta, k2 < 0. We caution the reader that we have normalized\nthis solution differently from the bulk to boundary propagator.\nNext, we need the Feynman rules for Yang Mills theory in AdS. For simplicity, let us\nconsider color-ordered correlators, which correspond to color-ordered amplitudes in the bulk.\nThe Feynman rules for color-ordered diagrams, as generalized to AdS, have a three and a four\npoint vertex, which is given by:\n\u0014\u0012\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013 \u0015\n↔\n↔\n↔\n1\naμ1 ∇ν (a2 )μ aν3 + aμ3 ∇ν (a1 )μ aν2 + aμ2 ∇ν (a3 )μ aν1 ,\nV3 = √\n2\n\u0014\n\u0015\n(3.4)\n1\n1\nV4 = i (a1 * a3 )(a2 * a4 ) − (a1 * a2 )(a3 * a4 ) − (a1 * a4 )(a2 * a3 ) ,\n2\n2\n↔\n\nwhere the an represent the external lines that meet at the vertex and A∇B ≡ A∇B − B∇A\nfor two vector fields A and B. The connection coefficients are given by:\n\u0011\n1\u0010 ρ\n1\n(3.5)\nδ0 ηαβ − δα0 δβρ − δβ0 δαρ .\nΓραβ = gρδ (∂α gβδ + ∂β gαδ − ∂δ gαβ ) =\n2\nz\n1\n\n(1)\n\nStrictly speaking, the identity, Hα (x) =\nnegative imaginary part for timelike momenta.\n\n2\n(−i)α+1 Kα (−ix)\nπ\n\n–6–\n\ntells us that we should take |k| to have a\n\n\fHere 0 represents the radial direction in AdS.\nBelow we work out the the three point transition amplitudes for the different combinations\nof helicities. We will use the symbol Ep below to mean:\nEp ≡ (|k1 | + |k2 | + |k3 |) = |k1 | + |k2 | + ip.\n\n(3.6)\n\nFirst, we note that for every amplitude we have a leading factor that comes from the z\nintegrals\np\nZ\n2 |k1 ||k2 | ∞ 3\nYM\nz 2 K1/2 (|k1 |z)K1/2 (|k2 |z)J1/2 (pz)dz\nR (|k1 |, |k2 |, p) =\nπ\n0\nq\n(3.7)\n2p\n=\n\nπ\n\n|k1 |2 + 2|k2 ||k1 | + |k2 |2 + p2\n\n.\n\nWe should remind the reader that the answers for correlators worked out in [10] involve\nthe radial integral:\nYM\nRPM\n(|k1 |, |k2 |, |k3 |)\n\n\u0012 \u00133\nZ ∞\n3\n2 2p\nz 2 K1/2 (|k1 |z)K1/2 (|k2 |z)K1/2 (|k3 |z)dz\n|k1 ||k2 ||k3 |\n=\nπ\n0\n1\n=\n.\n|k1 | + |k2 | + |k3 |\n(3.8)\n\nApart from a normalization factor that arises because the normalizable mode in the transition\namplitude is normalized differently compared to the bulk-boundary propagators, the answers\nfor transition amplitudes and correlators are related by the following simple substitution in\nthe term that comes from the radial integral:\nRYM (|k1 |, |k2 |, |p|) = √\n\n\u0001\n1\nYM\nYM\nRPM\n(|k1 |, |k2 |, −i|p|) − RPM\n(|k1 |, |k2 |, i|p|) .\n2πp\n\n(3.9)\n\nThe tensor structures that we need to compute is given by:\n\ni \b\nT3∗ = RYM (|k1 |, |k2 |, p) √ (ǫ1 *ǫ2 )(k2 −k1 )*ǫ3 +(2ǫ2 *k1 )(ǫ1 *ǫ3 )−2(ǫ1 *k2 )(ǫ2 *ǫ3 ) . (3.10)\n2\n\n(Here the dependence of T on the momenta and polarizations is not shown explicitly although\nwe are using the subscript 3 to remind the reader that this is a three-point function and the\nsuperscript ∗ to indicate that this is a transition amplitude.) Except for the radial part,\nwhich is modified as explained above, the spinor expressions that we obtain from polarization\ncontractions are the same as the expressions for correlators in [10].\n3.1.1 + + − Amplitude\n\nWe use the polarization vectors given in section 2. Notice that there is a leading factor of √12\nfrom the interaction vertex that gets multiplied with the norm factors from the denominator of\n\n–7–\n\n\fthe polarizations. We get another factor of 2 in the denominator when we convert momentum\ndot products to spinor contractions. With these observations, we see that the ++− amplitude\nis given by:\nT3∗ (+, +, −) =\n\niRYM (|k1 |, |k2 |, p) \u0010\n√\nλ̄1 , λ̄2\n2 2|k1 ||k2 |p\n\n\u00032\n\u0003\u0002\n\u0002\n\u0003\n\u0002\nhλ2 , λ3 i λ̄2 , λ3 + λ̄2 , λ̄1 λ̄2 , λ1 λ̄1 , λ3\n\u00032 \u0011\n\u0003\u0002\n\u0002\n− λ̄1 , λ̄2 λ̄1 , λ2 λ̄2 , λ3 .\n2\n\n(3.11)\n\nActually each term inside the brackets is proportional to the same quantity and we can\nwrite the whole amplitude in the flat space MHV form multiplied by a pre-factor. To see this,\nwe note the following relations:\nλ1 λ̄1 + λ2 λ̄2 + λ3 λ̄3 = iEp σ 3 ,\n\n(3.12)\n\n\u0002\n\u0003\nhλ1 , λ3 i λ̄3 , λ̄2 = −iEp λ1 , λ̄2 ,\n\n(3.13)\n\nwhich leads to\nand similar identities for other pairs of spinors. Moreover, we also have the identity\n\u0001\nhλ1 , λ2 i λ̄1 , λ̄2 = −2 (k1 * k2 ) − |k1 ||k2 | = (|k1 | + |k2 |)2 − (k1 + k2 )2\n= −iEp (p + i(|k1 | + |k2 |)).\n\n(3.14)\n\nSubstituting this we find that\nT3∗ (+, +, −) =\n\n\u0001\n\u0001\n\u0001\n−RYM (|k1 |, |k2 |, p)\n√\n|k2 | + ip − |k1 | ip + |k1 | − |k2 | |k1 | + |k2 | − ip\n2 2|k1 ||k2 |p\n×\n\nλ̄1 , λ̄2\n\nλ̄1 , λ̄2\nλ̄2 , λ̄3\n\n4\n\nλ̄3 , λ̄1\n\n.\n(3.15)\n\n3.1.2 + + + Amplitude\nThe + + + amplitude is given by\nT3∗ (+, +, +) =\n\niRYM (|k1 |, |k2 |, p) \u0010\n√\nλ̄1 , λ̄2\n2 2|k1 ||k2 |p\n\n2\u0002\n\n− 2 λ̄1 , λ̄2\n\n\u0003\n\nλ̄2 , λ̄3 + λ̄2 , λ̄1\n\u0011\n\u0002\n\u0003\n2\nλ̄1 , λ2 λ̄2 , λ̄3\n.\n\nλ2 , λ̄3\n\n\u0002\n\nλ̄2 , λ1\n\n\u0003\n\nλ̄1 , λ̄3\n\n2\n\n(3.16)\n\nAfter using the identities above, we find that\nT3∗ (+, +, +) =\n\n−RYM (|k1 |, |k2 |, p)\n√\nEp λ̄1 , λ̄2\n2 2|k1 ||k2 |p\n\n–8–\n\nλ̄2 , λ̄3\n\nλ̄3 , λ̄1 .\n\n(3.17)\n\n\f3.1.3 − − − Amplitude\nThe − − − amplitude is related to the + + + amplitude by parity and is given by\nT3∗ (−, −, −) =\n3.1.4 − − + Amplitude\n\n−RYM (|k1 |, |k2 |, p)\n√\nEp hλ1 , λ2 i hλ2 , λ3 i hλ3 , λ1 i .\n2 2|k1 ||k2 |p\n\n(3.18)\n\nThe − − + amplitude is related to the + + − amplitude by parity and is given by\nT3∗ (−, −, +) =\n\n\u0001\n\u0001\n\u0001\n−RYM (|k1 |, |k2 |, p)\n√\n|k2 | + ip − |k1 | ip + |k1 | − |k2 | |k1 | + |k2 | − ip\n2 2|k1 ||k2 |p\n×\n\nhλ1 , λ2 i4\n.\nhλ1 , λ2 i hλ2 , λ3 i hλ3 , λ1 i\n\n(3.19)\n\nThe list above covers all possible three point transition amplitudes. The amplitude for\nany other combination of helicities can be obtained by just cyclically permuting the spinor\nexpressions, while keeping RYM unchanged.\n3.1.5 Flat Space Limit\nWhen the three point amplitudes are written in the forms above, it is manifest that the flat\nspace limit described in [9] holds. Let us remind the reader that in [9], we conjectured that\nthe n-point conserved current correlator in 3 dimensions and the flat space gluon scattering\namplitude in 4 dimensions should be related, at tree level, through:\n\u0010X\n\u0011\nM (ǫ1 , k̃1 , . . . ǫn , k̃n ) = P lim\n|km | T (ǫ1 , k1 , . . . ǫn , kn ).\n(3.20)\n(\n\n|km |)→0\n\nHere k̃m are the on-shell 4 dimensional vectors produced by taking the 3-dimensional vector\nkm and appending its norm to form the 4-dimensional vector k̃m = {km , i|km |}\nNow, as we mentioned above, to compute correlators rather than transition amplitudes\nYM defined in (3.8).\nall we need to do is to replace RYM above with RPM\nFor example, looking at the + + − correlator (the − − + case works in exactly the same\nway), we see that:\n√\n4\nλ̄1 , λ̄2\n2 2\n.\n(3.21)\nT3 (+, +, −) −→ i\nEp →0 Ep λ̄1 , λ̄2\nλ̄2 , λ̄3 λ̄3 , λ̄1\n2 |−ip\n= −2i and so the numerator in\nThis is because at Ep = 0, we can replace |k1 |+|k\np\nYM neatly cancels with the denominator leaving behind the factor of 1 . Of course this is\nRPM\nEp\nmultiplied with the famous 3-pt gluon amplitude in four dimensions, which is precisely what\nwe expect from our flat-space conjecture.2\n\n√\nThe careful reader might note that we have an extra factor of 2 2. This is present because our polarization\nvectors are unconventionally normalized as shown in (2.16) so that ǫ+ (k) * ǫ− (k) = 2. This normalization\nis convenient because below we will extend momentum vectors by their polarizations and this helps remove\n√\nfactors of 2 there; however these factors sometimes reappear in final results as above.\n2\n\n–9–\n\n\f3.2 Gravity\nWe now turn to the computation of three point transition amplitudes in the pure gravity\ntheory, using the Hilbert action in the bulk. Just as we found above, we find that the answers\nfor transition amplitudes are very similar to the answers for correlators, except that the part\nof the answer that comes from the radial integral over the bulk-boundary propagators gets\nmodified as in (3.9).\nThe bulk to boundary propagator for gravity is given by the expression:\nr\nd\neij\neij\n2\nik*x\nK 3 (|k|z) = 2 (1 + |k|z)e−|k|z eik*x\n(3.22)\nhij (e, k, x, z) = 2 (|k|z) 2 e\nz\nπ 2\nz\nIt is important to note that in (3.22), both indices on h are lowered. If one index had been\nraised the leading factor of z12 would be absent. As explained above, this form of the bulk to\nboundary propagator is correct for spacelike momentum k * k > 0. For timelike momentum,\nwe should analytically continue the expression above while taking |k| to have a negative\nimaginary part.\nWhen we refer to the \"normalizable mode\" that enters transition amplitudes, we are\nreferring to the solution:\nhij (e, k, x, z) =\n\n3\n1\neij z 2 J 3 (|k|z)eik*x .\n2\n2\nz\n\n(3.23)\n\nThis is because it is this term that naturally enters the bulk to bulk propagator. We will have\nto be careful about these different normalizations when we compare correlators to transition\namplitudes below.\n3.2.1 Interaction Vertices\nTo obtain the three point gravity transition amplitude, we first need to expand the Hilbert\naction out to third order in fluctuations.3 The computations in this subsection were performed\nusing the excellent program Xact [12] that allowed us to automate the tensor manipulations\nbelow.\nWe start with the cubic action given in [13]\nZ\n−1 p\n1\nS=\n(3.24)\n|g|(Vμν − gμν V )hμν ,\n6\n2\nwhere\n\nV μν = −∇ρ (hρσ (∇μ hνσ + ∇ν hμσ − ∇σ hμν )) + ∇ν (hρσ ∇μ hρσ )\n1\n1\n+ (∇μ hνρ + ∇ν hμρ − ∇ρ hμν )∇ρ hab gab − ∇μ hρσ ∇ν hρσ + ∇ρ hμσ ∇ρ hσν\n2\n2\nμ ρ σν\n− ∇σ hρ ∇ h .\n3\n\n(3.25)\n\nIt is possible to obtain the three-point on shell amplitude without going through this process, and by using\nthe flat space result, as was done in [11]. Our approach is more direct. It also has the advantage that it helps\nus keep track of the boundary terms that we are adding to the action. It also lets us see how the on-shell\ncomputation is much simpler than using Feynman rules.\n\n– 10 –\n\n\fThis term still contains various terms with a double derivative. To remove these we need\nto add the two-derivative terms\n1\n1\nB = − g cd gμν ∇d (hμν hρσ ∇c hρσ ) + ∇ν (hμν hρσ ∇μ hρσ ) + gcd gμν ∇ρ (hμν hρσ ∇c hdσ )\n2\n2\n1 cd\nμν ρσ\nμν ρσ\n(3.26)\n+ g gμν ∇ρ (h h ∇d hcσ ) − ∇ρ (h h ∇μ hνσ ) − ∇ρ (hμν hρσ ∇ν hμσ )\n2\n1\n− g cd gμν ∇ρ (hμν hρσ ∇σ hcd ) + ∇ρ (hμν hρσ ∇σ hμν ) .\n2\nHere, we should note that although in position space these terms can only give a delta function\ncontribution to boundary correlators, we could have been worried about them in momentum\nspace. This is because the recursion relations involve multiplying two three-point functions in\nmomentum space, or convoluting two three-point functions in position space; in this manner\nwhat was a delta function contribution may become important. However, fortuitously, when\nwe evaluate this boundary term on linearized solutions to the equations of motion in the\ngauge\nh0μ = 0, hμμ = 0,\n(3.27)\nand on shell, so that\n∂μ hμν = 0,\n\n(3.28)\n\nthe boundary terms in B genuinely vanish upon integration. We find then that\n1\n1\n1\n(Vμν − gμν V )hμν − B = g cd gμν hρσ ∇c hρσ ∇d hμν + gcd gμν hμν ∇c hρσ ∇d hρσ\n2\n2\n4\n1 μν\n1 cd\nρσ\nμν\nρσ\n− h ∇μ hρσ ∇ν h − h ∇μ hρσ ∇ν h − g gμν hρσ ∇c hdσ ∇ρ hμν\n2\n2\n1 cd\n− g gμν hρσ ∇d hcσ ∇ρ hμν + hρσ ∇μ hνσ ∇ρ hμν − hμν ∇ν hμσ ∇ρ hρσ\n2\n1\n1\n− gab gcd gμν hμν ∇c hdρ ∇ρ hab − gab g cd gμν hμν ∇d hcρ ∇ρ hab\n4\n4\n1\n1\n1\nμν\nρ ab\nμν\n+ gab h ∇μ hνρ ∇ h + gab h ∇ν hμρ ∇ρ hab + gab gcd gμν hμν ∇ρ hcd ∇ρ hab\n2\n2\n4\n1\n1\n− gab hμν ∇ρ hμν ∇ρ hab − gcd gμν hμν ∇ρ hcσ ∇ρ hσ d + hμν ∇ρ hμσ ∇ρ hσ ν\n2\n2\n1 cd\n1\nρσ\nμν\n+ g gμν h ∇ρ h ∇σ hcd + gcd gμν hμν ∇ρ hσ d ∇σ hcρ − hρσ ∇ρ hμν ∇σ hμν\n2\n2\nμν ρ σ\n− h ∇ h ν ∇σ hμρ .\n\n(3.29)\n\nWe write this term out in gory detail because this is what we would have to use if we\nwere to try and compute an exchange Feynman diagram. Fortunately, in our method we only\nneed the on-shell three point function. When we impose just the traceless conditions from\n(3.27), we find a remarkable simplification:\n3\n1\n(Vμν − gμν V )hμν − B = −hμν ∇μ hρσ ∇ν hρσ + +∇ρ hμν ∇σ hρ σ\n2\n2\n\u0001 (3.30)\n− 2∇ν hρσ ∇σ hμ ρ + ∇ρ hνσ ∇σ hμ ρ − ∇σ hνρ ∇σ hμ ρ .\n– 11 –\n\n\fWe now convert all covariant derivatives to partial derivatives using the connection coefficients (3.5), and again impose the tracelessness condition on h. This leads to\n3\n1\n(Vμν − gμν V )hμν − B = 4ha c hab hbc − hab ∂a hcd ∂b hcd − hab ∂ c hab ∂d hdc\n2\n2\n+ 2hab ∂b hcd ∂ d ha c − hab ∂c hbd ∂ d ha c + hab ∂d hbc ∂ d ha c + 2zha c hab ∂0 hbc .\n\n(3.31)\n(3.32)\n\nIf we now also use the on-shell condition ∂a hab = 0, then the third term in the first line above\n(Eqn. (3.31)) drops out. This results in\n3\n1\n(Vμν − gμν V )hμν − B =4ha c hab hbc − hab ∂a hcd ∂b hcd + 2hab ∂b hcd ∂ d ha c\n2\n2\n− hab ∂c hbd ∂ d ha c + hab ∂d hbc ∂ d ha c + 2zha c hab ∂0 hbc .\nBy adding another total derivative term, which vanishes on-shell we find\n\u0011\n\u0010\n3\n1\n(Vμν − gμν V )hμν − B + ∂c hab hbd ∂d hca = 4ha c hab hbc − hab ∂a hcd ∂b hcd\n2\n2\nab\nd c\nab\nd c\n+ 3h ∂b hcd ∂ ha + h ∂d hbc ∂ ha + 2zha c hab ∂0 hbc .\n\n(3.33)\n\n(3.34)\n\nWe can make this even simpler and get rid of the z derivatives, if we remember that in\n√\n1\n(3.24), this term is multiplied by −g = z d+1\n. Now,\n\u0010\n\u0011\n1\nc ab\nab\nd c\nc ab\n4h\nh\nh\n+\nh\n∂\nh\n∂\nh\n+\n2zh\nh\n∂\nh\na\na\na\n0 bc\nbc\nd bc\nz d+1\n\u0012 c\u0013\n\u0012\n\u0012 b \u0013\u0013\n\u0011\n\u0010\nhb\nhc\n1\nc\n4 b\nb\n2 ij a\nc a b\na\n3 c a\n∂0 hc + 2z ha hb ∂0\n= d+1 4ha hb hc + z η hb ∂i hc ∂j ha + z ha ∂0\n2\nz\nz\nz2\n\u0013\n\u0012\n\u0011 1\n\u0010\n\u0010 \u0011\n1\n1\n= d+1 z 2 η ij hab ∂i hbc ∂j hca + z 2 ∂0 hba hcb ∂0 hac − z 2 hba hcb ∂02 hac\n(3.35)\n2\n2\nz\n\u0012\n\u0013\n\u0011\n\u0010\n1\n1\n1 b c\n1\n= d−1 η ij ∂i hab hbc ∂j hca + d−1 hab hbc η ij ∂i ∂j hca + ∂0\nha hb ∂0 hac\nd−1\n2z\n2z\n2\nz\n\u0013\n\u0012\n1 b c\n1\na\n− ha hb ∂0\n∂0 hc .\n2\nz d−1\nHowever, on shell, h precisely satisfies the equation (see, for example, the detailed review of\nperturbation theory in [14])\n\u0012\n\u0013\n1 a b ij\n1\n1 b c\nc\na\nh h η ∂i ∂j ha − ha hb ∂0\n∂0 hc = 0.\n(3.36)\nz d−1 b c\n2\nz d−1\nAfter recalling the factor of\npoint function.\nT (e1 , k1 , e2 , k2 , e3 , k3 ) =\n\n−1\n6\n\nXZ\nπ\n\n\u00101\n\nin (3.24),this leads to the following expression for the three\nFπ\nz d−1\n\n\u0011\n1\nFπ =\n(ǫπ1 * kπ2 )(ǫπ1 * kπ3 )(ǫπ2 * ǫπ3 ) − (ǫπ1 * kπ2 )(ǫπ1 * ǫπ3 )(ǫπ2 * kπ3 )(ǫπ2 * ǫπ3 )\n4\n2\n× φ(|k1 |z)φ(|k2 |z)φ(|k3 |z),\n(3.37)\n2\n\n– 12 –\n\n\fwhere π runs over the permutation group of 3 elements and φ is the radial part of the wavefunction defined by\nhij (e, k, x, z) ≡ z 2 η il ǫl ǫj eik*x φ(|k|z),\n(3.38)\nwith the linearized solutions hij defined in (3.22). Note that φ carries information about\nwhether any of the wave functions we are using is normalizable.\n3.2.2 Answers for Three Point Stress Tensor Transition Amplitudes\nLet us now compute the three-point transition amplitudes of the stress-tensor that we need\nto compute 4-pt correlators. First we need the radial integral; this gives a polarizationindependent part of the answer, which is then multiplied by some function that depends on\nthe polarizations.\nThe radial integral gives us\nZ\ndz\ngr\nR (|k1 |, |k2 |, p) = φ(|k1 |z)φ(|k2 |z)φ(|k3 |z) 2\nz\nZ\n\u00013\n3\n3\n3\ndz\n2\nz 2 K 3 (|k1 |z)z 2 K 3 (|k2 |z)z 2 J 3 (pz)\n|k1 ||k2 | 2\n=\n2\n(3.39)\n2\n2\n2\nπ\nz\nq\n\u0001\n2\np3/2 |k1 |2 + 4|k2 ||k1 | + |k2 |2 + p2\nπ\n=\n.\n(|k1 |2 + 2|k2 ||k1 | + |k2 |2 + p2 )2\nThe pre-factor that enters the correlator was calculated in [10] and is given by:\nZ\n\u00013 ∞ 1 3\n3\n3\n2\ngr\n2\n|k1 ||k2 ||k3 |\nz 2 K 3 (|k1 |z)z 2 K 3 (|k2 |z)z 2 K 3 (|k3 |z)\nRPM (|k1 |, |k2 |, |k3 |) =\n2\n2\n2\n2\nπ\nz\n0\n|k1 ||k2 | + |k3 ||k2 | + |k1 ||k3 |\n|k2 ||k3 ||k1 |\n+ |k1 | + |k2 | + |k3 | −\n.\n=−\n(|k1 | + |k2 | + |k3 |)2\n|k1 | + |k2 | + |k3 |\n(3.40)\nThe radial integral for the transition amplitude is convergent but, in the case of the correlator,\nit is divergent; the value in (3.40) comes from cutting it off at z = ǫ and picking up the ǫ0\npiece. In this respect, transition amplitudes are nicer than correlators. We discuss this in\nsome more detail below.\nApart from an overall normalization, which appears because the normalizable mode is\nnormalized differently from the bulk-boundary propagator, note that the answer for the radial\nintegral that enters the transition amplitude is closely related to the term that enters the\ncorrelator:\nr\n\u0011\n2 −3 \u0010 gr\ngr\ngr\nR (|k1 |, |k2 |, p) = −i\n(|k1 |, |k2 |, −ip) .\n(3.41)\np 2 RPM (k1 , k2 , ip) − RPM\nπ\nWe adopt the same notation as (3.6) for the variable Ep . With this definition, we find that,\nexcept for the part the comes from the radial integrals, the graviton transition amplitudes can\nbe written as the \"square\" of the gauge boson amplitudes explored in the previous subsection.\n\n– 13 –\n\n\f+ + − Amplitude\nLet us consider the first term in the sum over permutations of (3.37), and take particles 1\nand 2 to have positive helicity, and particle 3 to have negative helicity. Then we find\n\u00033\n\u0003\u0002\n\u0003\u0002\n\u0002\n−Rgr (k1 , k2 , p)\nλ̄1 , λ̄2 λ̄1 , λ2 λ̄1 , λ3 λ̄2 , λ3\n2\n2\n2\n16|k1 | |k2 | p\n\u0012\n\u0013\n\u0002\n\u0003\n\u0003 1\u0002\n−1\n×\nλ̄1 , λ̄3 λ̄2 , λ3 −\nλ̄1 , λ3 λ̄2 , λ̄3 .\n4\n2\n\nF1 =\n\n(3.42)\n\nThen, after summing over permutations and using the identities of (3.1.1) we find that the\n+ + − amplitude is given by:\nT3∗ (+, +, −) =\n\n\u00012\n\u00012\n\u00012\nRgr (|k1 |, |k2 |, p)\n|k2 | + ip − |k1 | ip + |k1 | − |k2 | |k1 | + |k2 | − ip\n2\n2\n2\n32|k1 | |k2 | p\n!2\n4\nλ̄1 , λ̄2\n×\nλ̄1 , λ̄2 λ̄2 , λ̄3 λ̄3 , λ̄1\n(3.43)\n\n+ + + Amplitude\nThe + + + amplitude is given by\nT3∗ (+, +, +) =\n\nRgr (|k1 |, |k2 |, p) 2\nE\n32|k1 |2 |k2 |2 p2 p\n\nλ̄1 , λ̄2\n\nλ̄2 , λ̄3\n\nλ̄3 , λ̄1\n\n\u00012\n\n.\n\n(3.44)\n\n− − − Amplitude\nThe − − − amplitude is related to the + + + amplitude by parity and is given by\nT3∗ (−, −, −) =\n\nRgr (|k1 |, |k2 |, p) 2\nEp (hλ1 , λ2 i hλ2 , λ3 i hλ3 , λ1 i)2 .\n2\n2\n2\n32|k1 | |k2 | p\n\n(3.45)\n\n− − + Amplitude\nThe − − + amplitude is related to the + + − amplitude by parity and is given by\nT3∗ (−, −, +) =\n\n\u00012\n\u00012\n\u00012\nRgr (|k1 |, |k2 |, p)\n|k2 | + ip − |k1 | ip + |k1 | − |k2 | |k1 | + |k2 | − ip\n2\n2\n2\n32|k1 | |k2 | p\n!2\nhλ1 , λ2 i4\n×\nhλ1 , λ2 i hλ2 , λ3 i hλ3 , λ1 i\n\n(3.46)\n\nOne point that might cause some confusion is the asymmetry between p and −p in the\nformulae above. This asymmetry arises from the choice of polarization-vectors, which require\nus to choose a sign for the norm of the third momentum. However, recall that in obtaining\nthe four-point function we always sum over the polarizations of the intermediate state, and\nin doing this, the asymmetry will disappear.\n\n– 14 –\n\n\fNo divergences from the boundary\nA common property of AdS/CFT correlators in momentum space is that they must be\nregulated to get rid of divergences from the boundary at z = 0. This is true of the correlation\nfunction computations of [10] and also of (3.40). However, it is remarkable that simple power\ncounting tells us that the radial integrals that enter transition amplitudes are convergent.\nThis is clear from (3.37). A non-normalizable wavefunction behaves like z 0 near the\nboundary (this is true provided one index is raised and another is lowered), while the normal√\nizable mode behaves like z 3 . Although we would have obtained a z14 from the −g factor,\nwe also get one factors of z 2 that comes from the inverse metric required to contract the\nderivatives in the interaction vertex. Consequently, the integrand Fπ in (3.37) goes like z\nnear the boundary, and leads to a convergent integral.\nThis removes a possible complication in using the recursion relations. The computation\nof the four-point function involves the product of two transition amplitudes. So, naively one\nmight have worried a 1ǫ term from one amplitude could have combined with a ǫ term from\nanother amplitude to give a finite contribution. there are no 1ǫ terms at all.\n3.2.3 Flat Space Limit\nIn [9], we conjectured that the correlation function of the stress tensor and the graviton\namplitude should be related, at tree level, through\nP\n( |km |)n−1\nQ\nT (e1 , k1 , . . . en , kn ).\nM (e1 , k̃1 , . . . en , k̃n ) = P lim\n|km |) Γ(n − 1)\n|km |→0 (\n\n(3.47)\n\nJust as in the conserved-current case k̃m are on-shell 4 dimensional vectors produced related\nto the 3-dimensions vectors through k̃m = {km , i|km |}\nTo compute correlators rather than transition amplitudes all we need to do is to replace\ngr\ngr\nR by RPM\ndefined in (3.40). With this replacement, let us consider the + + − stress tensor\ncorrelator. We see that when we take Ep → 0, the correlator becomes:\nT\n\n++−\n\n|k1 ||k2 ||k3 |\n=2\nEp2\n\nλ̄1 , λ̄2\n\nλ̄1 , λ̄2\nλ̄2 , λ̄3\n\n4\n\nλ̄3 , λ̄1\n\n!2\n\n,\n\n(3.48)\n\nwhich is consistent with our conjecture.\nOn the other hand, if we consider the T +++ correlator, then we find that it has no pole at\nEp = 0 at all, which reflects that fact that the all-plus graviton scattering amplitude vanishes\nfor the Hilbert action.\nNote that as we explained in [9], flat space S-matrix elements can be extracted even if\nwe go beyond the Hilbert action. For example if we compute correlation functions using a\nW 3 action in flat space, this gives a non-zero all-plus scattering amplitude. Corresponding\nto this, the W 3 action gives a correlator in AdS4 that has a singularity of order Ep6 . (See\nEquation 2.18 of [10].)\n\n– 15 –\n\n\f4. Formulas for Four Point Functions\nWe will now use the recursion relations developed in [9] to write down formulas for the four\npoint functions of stress tensors and currents. This process proceeds in the following steps.\nFirst, we describe, in detail, a one-parameter deformation of each external momentum by a\nnull vector with the property that it preserves the norm of them momentum. The analytic\nproperties of the correlator under this extension can be used to obtain recursion relations for\nthe four point function in terms of deformed three point functions; we describe this procedure\nnext. In the next section we evaluate these formulas for correlators of both the stress tensor\nand conserved currents and verify that the answers have the correct flat space limit.\n4.1 Extending the Momenta\nFor the four point function, we start by deforming all four momenta through\nkm → km + αm ǫm w,\n\n(4.1)\n\nwhere there is no sum on the m in the second term. The four α's are fixed by the equation\n4\nX\n\nαp ǫp = 0.\n\n(4.2)\n\np=1\n\nThis has a unique solution up to one complex multiplicative parameter that can be absorbed\nin the definition of w.\nIn fact the extension (4.1) can be conveniently rephrased in terms of spinors. For each\nmomentum, only one of the spinors - either λm or λ̄m is extended - as shown below, where\nαm\n.\nwe use the notation βm = i|k\nm|\nnegative polarization: λm (w) = λm ;\n\nλ̄m (w) = λ̄m + βm λ̂m w;\n\nˆ w;\npositive polarization: λm (w) = λm + βm λ̄\nm\n\nλ̄m (w) = λ̄m .\n\n(4.3)\n\nExplicit Expressions for βm It is quite easy to find explicit expressions for the βm given\na set of external helicities. We enumerate these expressions for different possible external\nhelicities.\n1. {h1 , h2 , h3 , h4 } = {1, −1, 1, −1}\nIn terms of the βm variables we have the equations:\nˆ λ̄ + β λ λ̂ + β λ̄\nˆ\nβ1 λ̄\n1 1\n2 2 2\n3 3 λ̄3 + β4 λ4 λ̂4 = 0.\n\n(4.4)\n\nDotting this equation with λ4 λ̄3 , and then λ2 λ̄3 and then λ2 λ̂4 we find that\n\u0002\n\u0002\n\u0002\n\u0003\n\u0003\u0002\n\u0003\n\u0003\n− λ̄1 , λ4 λ̄1 , λ̄3\n− λ2 , λ̄1 λ4 , λ̄1 β4\n− λ̄1 , λ2 λ̄1 , λ̄3\nβ2\nβ3\n\u0003 ;\n\u0003 . (4.5)\n\u0002\n\u0003 ;\n\u0002\n\u0003\u0002\n=\n= \u0002\n=\nβ1\nβ1\nβ1\nhλ2 , λ4 i λ2 , λ̄3\nhλ4 , λ2 i λ4 , λ̄3\nλ2 , λ̄3 λ4 , λ̄3\n\nIt is this combination of helicities that we will use in sections 5 and 6, and all appearances\nof βm in that section refer to the quantities defined above.\n\n– 16 –\n\n\f2. {h1 , h2 , h3 , h4 } = {1, 1, 1, −1}\nWe now have the equations\nˆ λ̄ + β λ̄\nˆ\nˆ\nβ1 λ̄\n1 1\n2 2 λ̄2 + β3 λ̄3 λ̄3 + β4 λ4 λ̂4 = 0.\n\n(4.6)\n\nThis leads to\n\u0002\n\u0002\n\u0003\n\u0003\nλ̄1 , λ̄3 λ4 , λ̄1 β3\nλ̄1 , λ̄2 λ4 , λ̄1 β4\nλ̄1 , λ̄2 λ̄1 , λ̄3\nβ2\n\u0003;\n\u0003;\n\u0003 . (4.7)\n\u0002\n\u0002\n\u0003\u0002\n=−\n=−\n=−\u0002\nβ1\nλ̄2 , λ̄3 λ4 , λ̄2 β1\nλ̄3 , λ̄2 λ4 , λ̄3 β1\nλ4 , λ̄2 λ4 , λ̄3\n\n3. {h1 , h2 , h3 , h4 } = {1, 1, 1, 1} This gives rise to\n\nˆ λ̄ + β λ̄\nˆ\nˆ\nˆ\nβ1 λ̄\n1 1\n2 2 λ̄2 + β3 λ̄3 λ̄3 + β4 λ̄4 λ̄4 = 0,\n\n(4.8)\n\nwhich has the solution\nλ̄1 , λ̄4\nβ2\n=−\nβ1\nλ̄2 , λ̄4\n\nλ̄1 , λ̄3\nλ̄1 , λ̄4\nβ3\n;\n=−\nβ1\nλ̄2 , λ̄3\nλ̄3 , λ̄4\n\nλ̄1 , λ̄2\nλ̄1 , λ̄2\nβ4\n;\n=−\nβ1\nλ̄3 , λ̄2\nλ̄4 , λ̄2\n\nλ̄1 , λ̄3\n. (4.9)\nλ̄4 , λ̄3\n\nAll other helicity combinations can be obtained through interchanges in the expressions above\nor using parity.\n4.2 Recursion Relations\nWith this extension, we can now write down the recursion relations derived in [9]. However,\nwhen the boundary dimension is odd, as it is in this case, we find an important simplification.\nTo see this we rewrite the expression for the bulk to bulk propagator given in [15, 14] and\nused in [9] as follows:\n\n=\n\nZ\n\n∞\n0\n\n1\n=\n2\n\n1\n\nh (zz ′ ) 2 J 1 (pz)J 1 (pz ′ )Tij δab i\n2\n2\n\u0001\n−ipdp\n=\n2\n2\nk + p − iǫ\n0\nZ ∞\n−2idp h sin(pz) sin(pz ′ )Tij δab i\n−idp h sin(pz) sin(pz ′ )Tij δab i\n\u0001\n\u0001\n=\nπ\nk2 + p2 − iǫ\nk2 + p2 − iǫ\n−∞ π\n\n(k, z, z ′ )\nGaxial,ab\nij\n\nZ\n\n∞\n\n(4.10)\n\n1\n\nh (zz ′ ) 2 J 1 (pz)J 1 (pz ′ )Tij δab i\n2\n2\n\u0001\n.\n−ipdp\n2\n2 − iǫ\nk\n+\np\n−∞\n\nZ\n\n∞\n\nHere, we have used the fact that J 1 is just a sine function in disguise, then obsered that the\n2\nintegrand is manifestly even in p and used this to rewrite the propagator as an integral from\n(−∞, ∞). The graviton propagator can be similarly written as an integral over the entire\nreal line.\n\"\n\u0012\n\u0013\u0015\nZ ∞\nsin(pz) sin(pz ′ )\n2Tij Tkl\n−idp\n1\ngrav\n\u0001\nT\nT\n+\nT\nT\n−\n.\n(4.11)\n×\nGij,kl =\nik jl\nil jk\n2\nd−1\nz 2 (z ′ )2 k2 + p2 − iǫ\n−∞ π\n\nThe advantage of writing the propagator as the third line of (4.10) is that when we now\nobtain p-integrals in Witten diagrams these can be done just through an algebraic procedure\n\n– 17 –\n\n\fof extracting residues. These simplifications happen for all odd boundary dimensions. With\nthis observation the recursion relations of [9], specialized to d = 3, can be written as:\n#\nZ ∞ \"X\nIπ (w, p) + B(w, p) dp\nT (h1 , k1 (w), . . . h4 , k4 (w)) =\n−∞\n\nIπ (w, p) =\n∗\n\np\n2 * 2s\n\nX\n\nhint ,±\n\nπ\n2\n\n−iT\nw − w∓ (p)\np2 + (kπ1 (w) + kπ2 (w))2 w± (p) − w∓ (p)\n\n(4.12)\n\nT ≡ T (hπ1 , kπ1 (p), hπ2 , kπ2 (p), hint , kint )T ∗ (−hint , −kint , hπ3 , kπ3 (p), hπ4 , kπ4 (p)).\n2\n\nHere T (h1 , k1 (w), . . . h4 , k4 (w)) is the four point correlator with momenta km (w) extended\naccording to (4.1) and polarization vectors that are specified in terms of the helicity by (2.15).\nThe T ∗ that appear on the right-hand sides are three point transition amplitudes that were\ncomputed in section 3. As explained in [9], B is a polynomial in w with coefficients that\nare rational functions of p; this term ensures that the p-integral converges and also that the\ncorrelator to have the right behaviour at large w. We show below that we do not need to\nevaluate this term explicitly for the four point function.\n1\nThe reader should also note that we have a leading factor of 2*2\ns in the definition of Iπ\ncompared to [9]. Here s = 1 for currents and s = 2 for the stress tensor. The factor of 21\ncomes from the fact that our integral runs over (−∞, ∞) instead of (0, ∞). The second factor\nof 21s comes from the normalization of our polarization vectors in (2.16).\nWe are actually interested in the original undeformed correlator, which is recovered by\nsetting w = 0 in (4.12). We have:\nIπ (0, p) =\n\np X\niT 2\nw∓ (p)\n.\ns\n2\n±\n2\n2*2\np + (kπ1 + kπ2 ) w (p) − w∓ (p)\n\n(4.13)\n\nhint ,±\n\nPartitions: The recursion relations (4.12) involve a sum over partitions. For a non-colorordered amplitude, we need to sum over three partitions in the four point function. These\nthree partitions are\nn\no\nπ ∈ {1, 2, 3, 4}, {1, 3, 2, 4}, {1, 4, 3, 2} .\n(4.14)\nWe will also call these partitions the s, t, and u partitions respectively.\n\nw± as a function of p: To use the recursion relations we need to specify w± as a function\nof p. Consider a partition of the four external legs, described by π. Then the pole under the\nextension (4.1) is at the value of w = w± where\n\u00012\n(4.15)\nkπ1 + απ1 ǫπ1 w± + kπ2 + απ2 ǫπ2 w± + p2 = 0.\n\nWe can write w± = u ± v, where we have defined the auxiliary quantities\n\nαπ (ǫπ * kπ2 ) + απ2 (ǫπ2 * kπ1 )\nu=− 1 1\n,\n2απ1 απ2 (ǫπ1 * ǫπ2 )\np\n(4.16)\n(απ1 (ǫπ1 * kπ2 ) + απ2 (ǫπ2 * kπ1 ))2 − 4απ1 απ2 (ǫπ1 * ǫπ2 ) (p2 + (kπ1 + kπ2 )2 )\n.\nv=\n2απ1 απ2 (ǫπ1 * ǫπ2 )\n\n– 18 –\n\n\fAs we will see below, we need to evaluate these expressions only at specific values of p and\nin those cases, they often simplify considerably.\nWe should also stress that what is important is that there are two solutions for w, given\na value of p. Which solution we call w+ and which we call w− is of no relevance and we will\nbe somewhat cavalier about this below.\nRational Integrands: The integrands Iπ (w, p) in (4.12) might seem to have square-roots\nbut, in fact, all these square roots cancel. This is because of the sum in front, which takes\nv ↔ −v. As a consequence, all the integrands depend only on even powers of v, which means\nthat there are no square-roots after accounting for both terms.\nIntermediate Spinors: Now, let us consider the spinors for the intermediate leg. The\nintermediate momentum is just\nkint = −kπ1 (w± ) − kπ2 (w± ) = kπ3 (w± ) + kπ4 (w± ).\n\n(4.17)\n\nThe three point amplitudes above are written in terms of spinors. However, the key point\nis that in choosing a decomposition of kint into spinors, we can rescale λint → αλint and\nλ̄int → α−1 λ̄int by any complex number α without affecting the final answer. This is because\nin the recursion relations above when we have hint on the left, we have −hint on the right and\nso λint and λ̄int always come together. Consequently, we can choose the intermediate spinors\nusing (2.6), and avoid any square roots.\nOther, more covariant looking, choices are possible. For example one could take\ni (|kπ1 | − |kπ2 | − ip)\n\u0003\nλint = λπ2 (w± ) + λπ1 (w± ) \u0002\nλ̄π2 (w± ), λπ1 (w± )\ni (|kπ1 | + |kπ2 | − ip)\nλ̄int = −λ̄π2 (w± ) −\nλ̂π (w± ).\nhλπ1 (w± ), λπ2 (w± )i 1\n\n(4.18)\n\nIn fact in the calculations of sections 5 and 6, we will never need the intermediate spinors\nexplicitly. Instead we will use identities like (5.2) to rewrite expressions that involve λint like\n(5.1) as expressions that are free of these terms like (5.3).\nBoundary Term B: Now, we have argued above that the integrand term in (4.12) is\nrational and even in p. So, merely by polynomial division, we can write it in the following\nform:\nX\nN (p2 , w)\n+ Q(p2 , w),\n(4.19)\nIπ (w, p) =\n2 , w)\nD(p\nπ\n1\nwhere N , D, Q are polynomials and N\nD dies off at least as fast as p2 for large p. The fact that\nQ is polynomial in w follows from the fact that the highest power of p in D is independent of\nw. (Note that T 2 is purely a function of p and the only dependence on w in Iπ (w, p) comes\nthrough the factors that are explicitly displayed.)\n\n– 19 –\n\n\fTo ensure the convergence of the integral at large p and the correct behaviour of the\ncorrelator at large w, we need to set:\nX\nB(p, w) = −Q(p2 , w) +\nbm (p)wm ,\n(4.20)\nm\n\nwhere bm (p) are rational functions of p with a convergent integral over the real line. For\nconserved currents, we can take bm (p) = 0 since the correlator vanishes at large w.\nFor stress tensor correlators, the behaviour of the correlator at large w is completely fixed\nby the Ward identities as shown in [9] and we can take the bm (p) to be any functions that\nsatisfy:\nZ ∞\nX\nT (h1 , k1 (w), . . . h4 , k4 (w)) −→\nwm\nbm (p)dp.\n(4.21)\nw→∞\n\nm\n\n−∞\n\nHowever, we know that the Ward identities contribute only local terms at large w; in momentum space, this corresponds to terms that are analytic in at least two momenta. These terms\nare not themselves of physical interest and so, at the level of the four point function, we can\njust forget about the bm functions.\n\nAlgebraic Evaluation of the p Integral: We now show that the entire p integral can be\ndone just by picking out residues of the integrand at pre-specified poles. Now that we have\ndealt with the behaviour of the integrand at large w, we will specialize to w = 0 for simplicity.\nSince, with the addition of B the integrand vanishes at large p by construction, we can\nclose the contour through either the upper or the lower half plane. This leaves us just with\nthe task of evaluating some residues. In fact we do not need to evaluate Q explicitly either:\nZ ∞\nX\nN (p2 , w)\ndp = 2πi\nRes [Iπ (w, p)] ,\n(4.22)\n2\n−∞ D(p , w)\npoles\n\nwhere we sum over the poles of the integrand at finite p in the upper half plane.\nSecond, it is, in fact, quite easy to specify the locations of all poles in the integrand. There\nare two sources of poles: (a) the poles in the three point function where p = ±i(|kπ1 | + |kπ2 |)\n(b) the pole where the propagator vanishes p2 + (kπ1 + kπ2 )2 = 0.\nSo, for each partition π, there are exactly three poles in the upper half plane. This set is\ngiven by:\n\u001b\n\u001a\nq\n\u00012\n.\n(4.23)\nPπ = i(|kπ1 | + |kπ2 |), i(|kπ3 | + |kπ4 |), i kπ1 + kπ2\nThis leads to our final formula for the four point function:\nT (h1 , k1 , . . . h4 , k4 ) = 2πi\n\nX X\n\nπ p0 ∈Pπ\n\nRes [Iπ (0, p)] ,\n\np=p0\n\n(4.24)\n\nHere I(0, p) is specified in (4.13). The three point transition amplitudes that appear there\nare specified in section 3, with intermediate momenta and spinors given by (4.17) and (4.18).\n\n– 20 –\n\n\fMoreover, w± (p) is specified by (4.15), the set of partitions π is specified by (4.14), and the\nset of poles P is specified by (4.23).\nThis leads to a straightforward algorithm that is implemented in the attached Mathematica code. We also evaluate this formula in several cases below.\nAn Aside: Before we conclude this section, let us comment briefly on the various kinds of\nterms that appear in the formula above. First, note that the residue at p = i(|kπ1 | + |kπ2 |)\nor p = i(|kπ3 | + |kπ4 |) is a rational function of the external spinors. This is guaranteed since\nIπ is a rational function and so is the location of the pole. Furthermore, the analysis of [9]\n(and our explicit computations below) tells us that when we take the flat space limit, it is\nthese two terms that give us the correct singularity in the final answer.\nOn the other hand the last entry in the set (4.23) is not important in the flat space limit.\nIt also has a different analytic structure, and it can be written as a rational function of the\nexternal spinors and the norms of the sums of momenta. If we choose to write it purely as\na function of the original spinors then we get square roots in this term, which arise because\nthe location of the pole involves a square root.\nHowever, this term has an interesting relation to the operator product expansion that we\nshould mention. First, it is easy to check that for this pole one of the possible solutions for\nw± (p) is just w− = 0. (There is another solution to (4.15) but since one solution is 0 this\n∓\ndoes not contribute due to the wpmw−w∓ factor in front of the integrand.) The residue at this\npole is merely:\n2πi\n\nX\nhint\n\n\u0001\n\u0001i\nT ∗ h1 , kπ1 , h2 , kπ2 , hint , kπ1 + kπ2 T ∗ h1 , kπ1 , h2 , kπ2 , −hint , kπ1 + kπ2\n4\n\nNow the correlator is obtained by contracting the bulk vertices with a bulk-boundary propagator. From the relations between Bessel functions:\nz ν Jν (pz) =\n\n−2i\n(−ipz)ν Kν (−ipz) − iz ν Nν (pz),\nπpν\n\n(4.25)\n\nit is easy to check that one term in the transition amplitude is the correlator:\nr\n\u0001\n\u0001\nT\nh\n,\nk\n,\nh\n,\nk\n,\nh\n,\nk\n+\nk\n2\n1\nπ\n2\nπ\nint\nπ\nπ\n1\n2\n1\n2\n\u0001ν\n+. . . (4.26)\nT ∗ h1 , kπ1 , h2 , kπ2 , hint , kπ1 +kπ2 = −i\nπ\ni|kπ1 + kπ2 |\n\nwhere ν = 12 for currents and ν = 23 for the stress tensor and where . . . is the term that comes\nfrom the Neumann function above. So we see that one term in our final answer is exactly the\nproduct of the three point functions divided by the two point function as predicted by the\noperator product expansion.\nWe should emphasize that although this conformal block drops out in the flat space limit,\nthe Witten diagram involving the exchange of a graviton does not. The flat space limit of [9]\nwas derived diagram by diagram; so the exchange Witten diagram goes over to the flat space\nexchange diagram. This is consistent because the exchange Witten diagram involves more\n\n– 21 –\n\n\fthan just the conformal block of the stress-tensor (as is discussed, for example, in section 6.4\nof [16]) and so it survives in the flat space limit.\nHere should caution the reader that although the pole at p = i|kπ1 + kπ2 | accounts for\nthe contribution of the conformal block of the stress tensor or the conserved current itself,\nwe have not shown that the remainder of the correlator including the . . . in (4.26) and the\ncontribution from the other poles can be exactly accounted for by the contribution of all\ndouble trace operators.4 This deserves some further study.\n\n5. MHV Correlators for Conserved Currents\n\nIn this section, we will expand the formula above in terms of spinors for the four point\nfunction of currents. We start by analyzing the color-ordered MHV correlator + − +−, and\nthen describe the full (i.e. non-color-ordered) MHV correlator. Although the calculations\nbelow might seem tedious, our final answer for the color ordered MHV correlator is quite\nsimple and is given in (5.16). The expressions below are also implemented in the attached\nMathematica program (available from the source file in the arXiv submission), which may be\nuseful while following this analysis. We show, explicitly, for both the color ordered and full\nMHV amplitude that taking the flat space limit just leads to the Parke-Taylor formula for\nfour-gluon scattering.\n\n5.1 Color-Ordered MHV Correlator\nTo obtain the color ordered amplitude we only need to sum over two partitions: the (12)(34)\npartition and the (41)(23) partition.\nLet us start by analyzing the (12)(34) partition, which we will call the \"s\" partition. In\nfact the \"t\" partition: (14)(23) is just obtained by taking all the results here and interchanging\n2 ↔ 4. So that will not require a separate calculation.\nLet us expand out the three point functions that appear in the formula above. Doing\n4\n\nThere is, of course, an infinite sequence of such double trace operators whose exact spectrum can be easily\nworked out using character decomposition [17]. For example, below conformal weight 8, we find the spectrum\nof double trace operators of the stress tensor (in the notation [weight, spin]): (6, 0) ⊕ (6, 1) ⊕ (6, 2) ⊕ (6, 3) ⊕\n(6, 4) ⊕ (7, 0) ⊕ (7, 1) ⊕ (7, 2) ⊕ (7, 3) ⊕ 2(7, 4) ⊕ (7, 5).\n\n– 22 –\n\n\fthis, we find:\n(\nX RYM (|k1 |, |k2 |, p)\n\u0001\n\u0001\n\u0001\n√\n|k2 | + ip − |k1 | ip + |k1 | − |k2 | |k1 | + |k2 | − ip\nIs =\n2 2|k1 ||k2 |p\n±\n\n\u0001\n\u0001\n\u0001\nRYM (|k3 |, |k4 |, −p)\n√\n|k4 | − ip − |k3 | −ip + |k3 | − |k4 | |k3 | + |k4 | + ip\n2 2|k3 ||k4 |p\n!\n\"\n3\nλ̄1 , λ̄int\nhλ4 , λint i3\n×\nλ̄1 , λ̄2 (w± ) λ̄2 (w± ), λ̄int hλ3 (w± ), λ4 i hλ3 (w± ), λint i\n! #)\n3\nλ̄3 , λ̄int\nhλ2 , λint i3\n+\nhλ1 (w± ), λ2 i hλ1 (w± ), λint i λ̄3 , λ̄4 (w± ) λ̄4 (w± ), λ̄int\n×\n\n(5.1)\n\n1\nip\nw∓\n4 (p2 + (k1 + k2 )2 ) w± − w∓\n\nWe can simplify by expanding out RYM and also recognizing that\nλ1 (w± )λ̄1 + λ2 λ̄2 (w± ) + λint λ̄int = i(|k1 | + |k2 | + ip)σ 3 .\n\n(5.2)\n\nThis leads to\n(\n\u0001\n\u0001\n\u0001\n\u0001\nX\n|k2 | + ip − |k1 | ip + |k1 | − |k2 | |k3 | + ip − |k4 | ip + |k4 | − |k3 |\nIs =\n16π|k1 ||k2 ||k3 ||k4 | (|k1 | + |k2 | + ip) (|k3 | + |k4 | − ip)\n±\n\u0010\n\u0002\n\u0003 \u00113\n\"\nλ̄1 , λ̄2 (w± ) hλ4 , λ2 i + iEp12 λ̄1 , λ4\n\u0002\n\u0003\u0001\n×\nλ̄1 , λ̄2 (w± ) hλ4 , λ3 (w± )i λ̄2 (w± ), λ̄1 hλ1 (w± ), λ3 (w± )i − iEp12 λ3 (w± ), λ̄2 (w± )\n#\n\u0002\n\u0003\u00013\nhλ2 , λ1 (w± )i λ̄3 , λ̄1 + iEp12 λ2 , λ̄3\n\u0002\n\u0003\u0001\n+\nhλ1 (w± ), λ2 i hλ1 (w± ), λ2 i λ̄4 (w± ), λ̄2 (w± ) + iEp12 λ1 (w± ), λ̄4 (w± )\nλ̄3 , λ̄4 (w± )\n)\nw∓\n−i\n.\n× 2\np + (k1 + k2 )2 w± − w∓\n(5.3)\n\nwhere we have defined\nEpnm ≡ ip + |kn | + |km |.\n\n(5.4)\n\nAs we described in section 4, it is clear that there are two kinds of poles that appear\nin Is . One type is the pole that appears from the constituent three point amplitudes: the\nexistence of such a pole is required by the fact that the three point amplitude must have the\ncorrect flat space limit i.e. the flat space three point amplitude must appear as the coefficient\nof singularities at ip + |k1 | + |k2 | = 0 and ip + |k3 | + |k4 | = 0. The second kind of pole\nappears when the propagator factor above p2 + (k1 + k2 )2 vanishes.\n\n– 23 –\n\n\fPoles from the three point amplitude:\nWe have written the expression above so that\n12\nit is very easy to extract the pole at Ep = 0. First, let us note that when Ep12 = 0, the value\nof w± (p) simplifies. Denoting this value by w± (p = i(|k1 | + |k2 |)) ≡ ws±1 , we have\n\u0010\n\u0011\nˆ w± )λ̄ + λ (λ̄ + β λ̂ w± ) 2 = 0.\n(λ1 + β1 λ̄\n1 s1 1\n2 2\n2 2 s1\n\nThis condition requires either\nE\nD\nˆ w± , λ = 0,\nλ1 + β1 λ̄\n1 s1\n2\n\nD\nE\nλ̄1 , λ̄2 + β2 λ̂2 ws±1 = 0.\n\nor\n\nThese equations are solved by\n\nhλ2 , λ1 i\n\u0003;\nβ1 ws+1 = − \u0002\nλ2 , λ̄1\n\nor\n\nβ2 ws−1 = − \u0002\n\nλ̄1 , λ̄2\n\u0003.\nλ̄1 , λ2\n\n(5.5)\n\n(5.6)\n\n(5.7)\n\n(5.8)\n\nWe remind the reader that the βm are given by (4.5).\nTo proceed further we recognize that at the pole ws+1 the second line of the big square\nbracket in (5.3), which corresponds to hint = −1, vanishes. So we only need to evaluate the\nfirst line in the big square bracket at the point where Ep12 = 0.\nSome short calculations tell us that, the propagator factor simplifies\nws∓1\nws∓1\ni\ni\n=\n−(|k1 | + |k2 |)2 + (k1 + k2 ) ws±1 − ws∓1\nhλ1 , λ1 i λ̄1 , λ̄2 ws±1 − ws∓1\n1\n.\n=\n+\nλ̄1 , λ̄2 (ws1 ) hλ1 , λ2 i\nAnother short calculation tells us that\n\u0003\n\u0002\nλ1 , λ̄1\n+\n\u0003,\nλ1 (ws1 ) = λ2 \u0002\nλ2 , λ̄1\n\u0003\n\u0003 \u0002\n\u0002\n\u0003\n\u0002\nλ3 , λ̄3 + λ4 , λ̄4 − iE T\nλ4 , λ̄4 − iE T\n+\n\u0002\n\u0002\n\u0003\n\u0003\nλ3 (ws1 ) =\nλ2 − λ4\n.\nλ2 , λ̄3\nλ4 , λ̄3\n\n(5.9)\n\n(5.10)\n\nPlugging these factors in, we find that\n(2πi)\n\nRes\n\n\u0002\n\np=i(|k1 |+|k2 |)\n\n\u0003\nIs (p) =\n\n\u0003\n\u0003\u0002\n\u0003\u0002\n\u0002\nhλ2 , λ4 i λ4 , λ̄3 λ2 , λ̄3 λ2 , λ̄1\nE 124,3\n4|k3 ||k4 ||k1 |\nE 12,34 hλ1 , λ2 i E T\n\n+ (λ1 , λ2 , λ3 , λ4 ) ↔ (λ̄2 , λ̄1 , λ̄4 , λ̄3 ).\n\n(5.11)\n(5.12)\n\nHere in (5.12) we have recognized that the contribution from (5.8) is just obtained by the\ninterchange indicated.\n\n– 24 –\n\n\fPoles from the propagator: We now turn to the second kind of pole, which comes when\nthe propagator\nvanishes. When\np2 + (k1 + k2 )2 = 0, one of the solutions - which we will\n\u0011\n\u0010p\n(k1 + k2 )2 - is just 0. The other solution is complicated, but it does not\ndenote by w−\n\ncontribute to the answer at all; the factor\nat this value of p.\nAs = (2πi)\n\np=i\n\nw−\nw + −w −\n\nthat appears in (5.3) vanishes since w− = 0\n\ni\niE 1,2s E 2,1s E 4,3s E 3,4s\nIs (p) =\n16E 12,s E 34s |k1 + k2 |\n(k1 +k2 )2\n\"\n\u0002\n\u0003\u00013\nhλ2 , λ1 i λ̄3 , λ̄1 + iE 12,s λ2 , λ̄3\n\u0001\n\u0003\n\u0002\n×\nhλ1 , λ2 i λ̄3 , λ̄4 hλ1 , λ2 i λ̄4 , λ̄2 + iE 12,s λ1 , λ̄4\n#\n\u0002\n\u0003\n(hλ4 , λ2 i λ̄1 , λ̄2 + iE 12,s λ4 , λ̄1 )3\n\u0003 .\n\u0002\n+\nhλ4 , λ3 i λ̄1 , λ̄2 (hλ1 , λ3 i λ̄2 , λ̄1 − iE 12,s λ3 , λ̄2 )\n\n√Res\n\nh\n\n(5.13)\n(5.14)\n(5.15)\n\nAs we mentioned above,this residue is quite interesting since it contributes exactly the\nproduct of the undeformed transition amplitude on the left and the right. This contains the\ncontribution of the conformal block of the current itself and is consistent with what we would\nexpect from the operator product expansion applied in momentum space. However, we repeat\nthe caveat that it is necessary to also show that the remaining terms are consistent with the\ncontribution of double trace operators.\n5.1.1 Final answer for the color ordered current correlator\nThe final answer for the color ordered MHV current correlator can now just be obtained by\ninterchanges from the answer above. The answer for the four point amplitude is given by\nT +−+− (k1 , k2 , k3 , k4 ) =\n\nF\n+ A,\nET\n\n(5.16)\n\nwhere F is the term with a pole that corresponds to the flat space limit and A is an intrinsically\nAdS term that would vanish in flat space. We have,\n\u0003\n\u0003\u0002\n\u0003\u0002\n\u0002\nhλ2 , λ4 i λ4 , λ̄3 λ2 , λ̄3 λ2 , λ̄1\nE 124,3\nF=\n4|k3 ||k4 ||k1 |\nE 12,34 hλ1 , λ2 i\n\n(5.17)\n\n+ (λ1 , λ2 , λ3 , λ4 ) ↔ (λ̄2 , λ̄1 , λ̄4 , λ̄3 )\n\n(5.18)\n\n+ (λ1 , λ2 , λ3 , λ4 , λ̄1 , λ̄2 , λ̄3 , λ̄4 ) ↔ (λ3 , λ4 , λ1 , λ2 , λ̄3 , λ̄4 , λ̄1 , λ̄2 )\n#\n\n(5.19)\n\n+ (λ1 , λ2 , λ3 , λ4 , λ̄1 , λ̄2 , λ̄3 , λ̄4 ) ↔ (λ̄4 , λ̄3 , λ̄2 , λ̄1 , λ4 , λ3 , λ2 , λ1 )\n\n(5.20)\n\n+ (λ2 , λ̄2 ) ↔ (λ4 , λ̄4 ).\n\n(5.21)\n\nNote that within the big square bracket, all interchanges correspond to the expression in\n(5.17). So, for example to get (5.20) we take (5.17) and perform the interchanges indicated.\n\n– 25 –\n\n\fHowever to get (5.21) we take the whole square bracket and perform the interchange indicated.\nFor A we have\nA = As + (λ2 , λ̄2 ) ↔ (λ4 , λ̄4 ),\n(5.22)\nwhere As is specified in the three lines (5.13), (5.14), and (5.15). We take all three lines and\nperform the substitution indicated.\n5.1.2 Flat Space Limit of the Answer\nWe can, quite easily, take the flat space limit of the answer above. We just need to look at\nthe F term above. Second, at E T = 0, various spinor identities can be used to simplify the\nfunction.\nHowever, here we will take a different route that is somewhat more elegant, and also gives\nus a check on the final answer. Consider the functions\nM MHV (w) =\n\nhλ2 , λ4 i4\n,\nhλ1 (w), λ2 i hλ2 , λ3 (w)i hλ3 (w), λ4 i hλ4 , λ1 (w)i\n\n(5.23)\n\n4\n\nM\n\nMHV\n\n(w) =\n\nλ̄1 , λ̄2 (w)\n\nλ̄1 , λ̄3\nλ̄2 (w), λ̄3 λ̄3 , λ̄4 (w)\n\nλ̄4 (w), λ̄1\n\n,\n\nwhere the spinors are extended as above. Note that, as above, λ2 , λ4 , λ̄1 , λ̄4 do not change in\nthis extension.\nThen (5.17) is actually just proportional to the residue of M MHV (w) at ws+1 , while (5.18)\nis just proportional to the residue of M MHV (w) at ws−1 In fact, we have\n(5.17) =\n\nhλ1 (w), λ2 i MHV\nE 123,4 E 124,3\nlim\nM\n(w),\nT\n2|k3 ||k4 |E w→ws+1 hλ1 (0), λ2 i\n\nλ̄1 , λ̄2 (w)\nE 123,4 E 124,3\nM MHV (w).\n(5.18) =\nlim\nT\n−\n2|k3 ||k4 |E w→ws1 λ̄1 , λ̄2 (0)\n\n(5.24)\n\nThese are true as exact statements without setting E T = 0. However, when we set E T = 0,\nthe factor in front of the limit just becomes 1. Then we can see that by adding together\nthe various terms in the expression for F, we will just get the sum of the holomorphic and\nanti-holomorphic MHV amplitudes as the residue of the pole at E T = 0. These amplitudes\nare, of course, equal in the flat space limit.\nTo prove the assertion (5.24), consider the expression for the integrand (5.1). At the pole\n+\nws1 , we have λ1 (ws+1 ) ∝ λ2 . So, the spinor expressions that appear in (5.1) are\n3\n\nλ̄1 , λ̄int\n+\nλ̄1 , λ̄2 (ws1 ) λ̄2 (ws+1 ), λ̄int\n\nhλ4 , λint i3\n1\n,\n+\n+\nλ3 (ws1 ), λ4 λint , λ3 (ws1 ) hλ1 , λ2 i λ̄1 , λ̄2 (ws+1 )\n\n(5.25)\n\nwhere the third term comes from the propagator after using (5.9).\nHowever, we can write\nλ̄1 , λ̄int hλ4 , λint i = − λ̄1 , λ̄2 (ws+1 ) hλ4 , λ2 i ,\n\n– 26 –\n\n(5.26)\n\n\fwhere we have just used the fact that\n−λint λ̄int = λ1 (ws+1 )λ̄1 + λ2 λ̄2 (ws+1 ).\n\n(5.27)\n\nUsing this to simplify both the numerator and the denominator we find that the spinor\nexpression becomes\n3\n\nλ̄1 , λ̄2 (ws+1 )\n(5.25) =\nλ̄1 , λ̄2 (ws+1 ) λ̄2 (ws+1 ), λ̄1\n=\n=\n\nhλ4 , λ2 i3\nhλ1 , λ2 i λ1 (ws+1 ), λ3 (ws+1 )\n\nhλ4 , λ2 i3\n1\n+\n+\n+\nλ3 (ws1 ), λ4 λ1 (ws1 ), λ3 (ws1 ) hλ1 , λ2 i λ̄1 , λ̄2 (ws+1 )\nλ3 (ws+1 ), λ4\n\nhλ4 , λ2 i4\nhλ1 , λ2 i λ2 , λ3 (ws+1 ) λ2 , λ3 (ws+1 )\n\nλ4 , λ1 (ws+1 )\n\n,\n(5.28)\n\nwhere in the last step we have used the identity that\nhλ2 , λ4 i λ1 (ws+1 ), λ3 (ws+1 ) = λ1 (ws+1 ), λ4\n\nλ2 , λ3 (ws+1 ) .\n\n(5.29)\n\nEquation (5.24) now follows immediately when we recognize the pre-factor that appears in\nthe correlator.\nWe can now use (5.24) to independently reconstruct an expression for the amplitude.\nThis is because given the function M (w) defined in (5.23), we can force it have the correct\nresidues at the four poles ws+1 , ws+2 , wt+1 , wt+2 . The simplest way to do this is by Lagrange\ninterpolation.\nWe construct the rational function\nM AdS (w) = M MHV (w)P + (w)\nM AdS (w) = M MHV (w)P − (w)\n±\n\nP (w) ≡\n+\n+\n+\n\n(w − ws±2 )(w − wt±1 )(w − wt±2 )\n\n(ws±1 − ws±2 )(ws±1 − wt±1 )(ws±1\n\nE 123,4 E 124,3\n− wt±2 ) 2|k3 ||k4 |\n\n(w − ws±1 )(w − wt±1 )(w − wt±2 )\n\n(ws±2 − ws±1 )(ws±2 − wt±1 )(ws±2\n\nE 134,2 E 234,1\n− wt±2 ) 2|k1 ||k2 |\n\n(w − ws±1 )(w − ws±2 )(w − wt±1 )\n\n(5.30)\n\nE 134,2 E 124,3\n\n− wt±2 ) 2|k3 ||k2 |\n−\n−\n(w − ws±1 )(w − ws±2 )(w − wt±2 ) E 134,2 E 234,1\n.\n(wt±2 − ws±1 )(wt±2 − ws±2 )(wt±2 − wt±1 ) 2|k1 ||k2 |\n(wt±1\n\nws±2 )(wt±1\n\nws±2 )(wt±1\n\nP + (w) is a Lagrange polynomial with the property that modulates the residues of M MHV (w)\nto produce the correct residues required in M AdS (w). Note that M AdS (w) still has the desired\nfalloff at infinity because M MHV (w) → w14 at large w and P + (w) → w3 at large w.\n\n– 27 –\n\n\fIn terms of these functions, we have\nF = M AdS (0) + M AdS (0).\n\n(5.31)\n\nIn the flat space limit, we have the identity\nP + (w) = P − (w) = 2,\n\nat E T = 0.\n\nSo, it is clear that in the flat space limit, we have\n4\n4\nT +−+− −→\nM MHV = T M MHV ,\nT\nE\nE T →0 E\n\n(5.32)\n\n(5.33)\n\nwhich is exactly what we expect from the flat space conjecture.5\nFinally we notice that this method provides a check on our answer in (5.17). We can\nnow do some algebra given the explicit positions of the poles. We have already computed the\nvalues of ws±1 in (5.7) and all other poles are given by obvious substitutions in those equations.\nFor example, we have\nhλ4 , λ3 i\n+\n\u0003,\nβ3 ws2\n= −\u0002\nλ4 , λ̄3\n\n−\nβ4 ws2\n= −\u0002\n\nWe see that\n\n−1\nhλ2 , λ1 i[λ4 , λ̄1 ]\n−1\n+1\nhλ4 , λ3 ihλ2 , λ̄3 i\n\u0003\n\u0002\nhλ4 , λ3 i λ2 , λ̄3\n\u0003\n\u0003\n\u0002\n\u0002\n=−\nhλ2 , λ1 i λ4 , λ̄1 + hλ4 , λ3 i λ2 , λ̄3\n\u0003\n\u0002\nhλ4 , λ3 i λ2 , λ̄3\n=−\n.\ni hλ2 , λ4 i E 12,34\n\n1\nws+1\nws+2\n\nSimilarly,\n\nλ̄3 , λ̄4\n\u0003.\nλ̄3 , λ4\n\n(5.34)\n(5.35)\n\n=\n\n\u0003\nλ2 , λ̄1 hλ4 , λ1 i\n\u0002\n\u0003,\n=\nhλ\n,\nλ\ni\nλ\n,\nλ̄\n2\n4\n1\n1\n−1\n\n1\nws+1\nwt+\n1\n\nand\n\n\u0002\n\n\u0002\n\u0003\nλ4 , λ̄3 hλ2 , λ3 i\n=−\n.\ni hλ2 , λ4 i E 123,4\n−1\n\n1\nws+1\nwt+\n2\n\n(5.36)\n\n(5.37)\n\n(5.38)\n\nWe can now substitute (5.36) – (5.38) in (5.31) and (5.30) to recover our expression for\nF.\n\n\u0003\n\u0003\u0002\n\u0003\u0002\n\u0002\nhλ2 , λ4 i λ4 , λ̄3 λ2 , λ̄3 λ2 , λ̄1\nE 124,3\n+ ...\nF=\n4|k3 ||k4 ||k1 |\n(E 12,34 ) hλ1 , λ2 i\n\n(5.39)\n\nwhere the . . . indicate the various interchanges indicated in (5.18) – (5.21). This matches\nprecisely with our previous answer.\n5\n\nThe extra factor of 4 comes, once again, from the unconventional normalization of our polarization vectors.\n\n– 28 –\n\n\f5.2 Full MHV Amplitude\nTo evaluate the full MHV amplitude we also need to consider the (13)(24) partition, which\nwe will call the \"u\" partition. With the value of w being given by (4.15), we can write down\nan expression for the integrand.\n(\nX RYM (|k1 |, |k3 |, p) RYM (|k2 |, |k4 |, p)\n√\n√\nIu =\n2\n2|k\n||k\n|p\n2\n2|k2 ||k4 |p\n1\n3\n±\n\"\n\u00012\n\u0001\n\u0001\n\u0001\n× |k1 | + ip − |k3 | ip + |k3 | − |k1 | |k1 | + |k3 | − ip |k4 | + ip − |k2 |\n3\n\n\u0001\n\u0001\nip + |k2 | − |k4 | |k2 | + |k4 | + ip\n24\n+ (Ep13 )(E−p\n)\n\n×\n\nλ̄1 , λ̄3\n\nλ̄1 , λ̄int\n\nip\nw∓\n1\n.\n4 (p2 + (k1 + k3 )2 ) w± − w∓\n\nλ̄1 , λ̄3\nhλ4 , λ2 i3\nλ̄1 , λ̄int λ̄3 , λ̄int hλ2 , λint i hλ4 , λint i\n#)\n\u0001\nλ̄3 , λ̄int hλ2 , λ4 i hλ2 , λint i hλ4 , λint i\n\n(5.40)\n\nWe can now simplify this, as above by using the identities\nλ1 λ̄1 + λ3 λ̄3 + λint λ̄int = iEp13 σ 3 ,\n\n(5.41)\n\n24 3\niE−p\nσ .\n\n(5.42)\n\nλ2 λ̄2 + λ4 λ̄4 − λint λ̄int =\n\nRewriting terms that involve |λint ihλ̄int | using this, we find:\n(\n\"\n\u0001\n\u0001\n\u0001\nX\n|k1 | + ip − |k3 | ip + |k3 | − |k1 | |k4 | + ip − |k2 |\n−i\nIu =\n(5.43)\n24 )\n16π|k1 ||k2 ||k3 ||k4 |\n(Ep13 )(E−p\n±\n\u0001\n3\nip + |k2 | − |k4 | λ̄1 , λ̄3 hλ2 , λ4 i3\n\u0002\n\u0003\u0001\n\u0002\n\u0003\u0001\n×\nλ̄1 , λ̄3 hλ2 , λ3 (w± (p)i + iEp13 λ̄1 , λ2\nλ̄3 , λ̄1 hλ4 , λ1 (w± (p))i + iEp13 λ̄3 , λ4\n(5.44)\n\u0003\u0001\n\u0002\n±\n24\nλ̄1 , λ̄3 hλ2 , λ4 i λ̄3 , λ̄2 (w ) hλ4 , λ2 i + iE−p λ̄3 , λ4\n(5.45)\n+\n(|k1 | + |k3 | − ip)(|k2 | + |k4 | + ip)\n)\n#\n\u0003\u0001\n\u0002\nw∓\n1\n24\n.\n(5.46)\n× 2\n× λ̄1 , λ̄4 (w± ) hλ2 , λ4 i + iE−p\nλ̄1 , λ2\np + (k1 + k3 )2 w± − w∓\nWe now see that at the pole Ep13 = 0, only the term with hint = −1 contributes with\nTu1 = (2πi)\n\nRes\n\nh\n\np=i(|k1 |+|k3 |)\n\n=\n\nIu\n\ni\n\nwu∓1\nhλ2 , λ4 i3\n−i E 123,4 E 134,2 X\n.\n2 E T |k4 ||k2 | ± λ2 , λ3 (wu±1 ) λ4 , λ1 (wu±1 ) hλ1 , λ3 i wu±1 − wu±1\n\n– 29 –\n\n(5.47)\n\n\fHere wu±1 are the two solutions to the quadratic equation\nλ1 (wu±1 ), λ3 (wu±1 ) = 0.\n\n(5.48)\n\nAlthough these individual solutions involve square roots as we have pointed out above, we\nare always summing over both solutions, which gets rid of all the roots and leaves us with\na rational function of the spinors. The reader may, if she prefers, easily use this to rewrite\n(5.47) as a rational function of the un-extended spinors.\nFrom the formula for the integrand above, it is easier to extract the residue at p =\n−i(|k2 | + |k4 |), which is, in any case, the same as the residue at p = i(|k2 | + |k4 |) since the\nintegrand is even in p. To do this, we write (5.44) using (5.42). (We can also extract the\nresidue at Ep24 directly using (5.45) and (5.46) but that is less convenient.) When we do this\nwe find that\nh i h i\nTu2 = (2πi)\nRes\nIu = Tu1\np=i(|k2 |+|k4 |)\n\n1↔2̄,3↔4̄\n\n3\nλ̄1 , λ̄3\nwu∓2\n−i E 124,3 E 234,1 X\n.\n=\n2 E T |k3 ||k1 | ± λ̄1 , λ̄4 (wu±2 ) λ̄3 , λ̄2 (wu±2 ) hλ2 , λ4 i wu±2 − wu∓2\n\n(5.49)\n\nwhere wu±2 are defined by the quadratic equation λ̄2 (wu±2 ), λ̄4 (wu±4 ) = 0.\nThe full amplitude also involves the pole at p = i|k1 + k3 |. This is given by\nh i\ni\nTu3 = (2πi) Res\nIu =\n16|k1 ||k2 ||k3 ||k4 ||k1 + k3 |\np=i|k1 +k3 |\n\"\n3\nE 3s,1 E 1s,3 E 4,s2 E 2,s4 λ̄1 , λ̄3 hλ2 , λ4 i3\n\u0002\n\u0003\u0001\n\u0002\n\u0003\u0001\n×\nE 13,s E 24s λ̄1 , λ̄3 hλ2 , λ3 i + iE 13,s λ̄1 , λ2\nλ̄3 , λ̄1 hλ4 , λ1 i + iE 13,s λ̄3 , λ4\n\u0003\u0001 #\n\u0002\n\u0003\u0001\n\u0002\nλ̄1 , λ̄4 hλ2 , λ4 i + iE 24s λ̄1 , λ2\nλ̄1 , λ̄3 hλ2 , λ4 i λ̄3 , λ̄2 hλ4 , λ2 i + iE 24s λ̄3 , λ4\n.\n+\nE 13s E 24,s\n(5.50)\nThe full contribution of this partition is given by Tu1 + Tu2 + Tu3 .\nTo get the full MHV current correlator we just need to add the contributions from the\ns and t partitions that we have already computed above. One note of caution is that each\nof these terms now comes with the appropriate color-factor. For example, the s-channel\npartition is multiplied by the color-factor f 12e f e34 and similarly for the t and u channels.\nWe see now that the flat space limit is manifest. In analogy to the color ordered correlators, let us define:\n\u0011\n\u0010\nMAdS (w) = M MHV (w)P + (w) + M MHV (w)P − (w) f 12e f e34\n\u0010\n\u0011\n+ M̃ MHV (w)P̃ + (w) + M̃ MHV P̃ − (w) f 14e f e23 .\n\n– 30 –\n\n(5.51)\n\n\fHere\nM̃ MHV (w) =\n\nhλ2 , λ4 i3\n,\nhλ1 (w), λ4 i hλ2 , λ3 (w)i hλ3 (w), λ1 (w)i\n\n(5.52)\n\n3\n\nM̃\n\nMHV\n\n(w) =\n\nλ̄1 , λ̄4 (w)\n\nλ̄1 , λ̄3\nλ̄4 (w), λ̄2 (w)\n\nλ̄2 (w), λ̄3\n\n,\n\nIf we adopt the notation:\nwy+1 = wu+1 ;\n\nwy+2 = wu−1 ; wy−1 = wu+2 ; wy−2 = wu−2 ,\n\n(5.53)\n\nthen we can define the P̃ functions using\n+\n\nP̃ (w) ≡\n+\n\n(w − wy+2 )(w − wt+1 )(w − wt+2 )\n\n(wy+1 − wy+2 )(wy+1 − wt+1 )(wy+1\n\nE 123,4 E 134,2\n− wt+2 ) 2|k2 ||k4 |\n\n(w − wy+1 )(w − wt+1 )(w − wt+2 )\n\n(wy+2 − wy+1 )(wy+2 − wt+1 )(wy+2\n\nE 123,4 E 134,2\n− wt+2 ) 2|k2 ||k4 |\n\n(w − wy+1 )(w − wy+2 )(w − wt+1 )\n\nE 124,3 E 134,2\n+ +\n(wt1 − wy+2 )(wt+1 − wy+2 )(wt+1 − wt+2 ) 2|k3 ||k2 |\n+\n\n(5.54)\n\n(w − wy+1 )(w − wy+2 )(w − wt+1 )\n\nE 234,1 E 123,4\n.\n(wt+2 − wy+1 )(wt+2 − wy+2 )(wt+2 − wt+1 ) 2|k1 ||k4 |\n\nThe other interpolating function P̃ − is defined similarly:\nP̃ − (w) ≡\n+\n\n(w − wy−2 )(w − wt−1 )(w − wt−2 )\n\n(wy−1 − wy−2 )(wy−1 − wt−1 )(wy−1\n\nE 124,3 E 234,1\n− wt−2 ) 2|k1 ||k3 |\n\n(w − wy−1 )(w − wt−1 )(w − wt−2 )\n\n(wy−2 − wy−1 )(wy−2 − wt−1 )(wy−2\n\nE 124,3 E 234,1\n− wt−2 ) 2|k1 ||k3 |\n\n(w − wy−1 )(w − wy−2 )(w − wt−1 )\n\nE 124,3 E 134,2\n+ −\n(wt1 − wy−2 )(wt−1 − wy−2 )(wt−1 − wt−2 ) 2|k3 ||k2 |\n+\n\n(5.55)\n\n(w − wy−1 )(w − wy−2 )(w − wt−1 )\n\nE 234,1 E 123,4\n.\n(wt−2 − wy−1 )(wt−2 − wy−2 )(wt−2 − wt−1 ) 2|k1 ||k4 |\n\nIt is this term evaluated at w = 0 - MAdS (0) - that plays the role that F played in\n(5.16). Just as in the case above, near E T = 0, we find that P̃ ± = 2. So the full MHV\namplitude (including contributions from other partitions) goes like:\n\u0011\n4 \u0010 MHV\n12e e34\nMHV\n14e e23\n+ ...\nM\n(0)f\nf\n+\nM̃\n(0)f\nf\nET\nwhere . . . are terms that are non-singular at E T = 0. This is exactly what we need.\n\n– 31 –\n\n\f6. MHV Correlators for the Stress Tensor\nWe now turn to correlation functions of the stress tensor. Our objective in this section is to\nwrite out the formula (4.24) explicitly in terms of spinors and check that the MHV graviton\namplitude appears in the flat space limit. We will achieve this in two steps. First we expand\nout the integrand that appears in (4.24). Then we expand out the residues that appear in\nthat formula. The procedure for writing down the integrand is almost identical to the case\nof conserved currents. However, there is one important difference in the final result; this is\nthe fact that the poles that appear from the three point amplitudes are now double poles.\nConsequently, to extract the residue we need to take a derivative. This complicates our final\nformulas.\nWe will carry out this procedure with the same configuration of external polarizations\nthat we used for conserved currents. Namely, we will take {h1 , h2 , h3 , h4 } = {1, −1, 1, −1}.\nThe generalization to other helicity configurations involves a straightforward procedure that\nis very similar to the one that we present in detail below. The reader may also use the\ncomputer program that accompanies this paper to generate answers for any combination of\nexternal helicities either analytically or numerically.\nWe will first write down the integrands for the three different partitions that appear in\n(4.24). These are the (12)(34) partition, the (14)(23) partition, and the (13)(24) partition.\nIn each case, we then extract the residue at the poles specified in (4.23)\n6.1 (12)(34) Partition:\nLet us start by considering the (12)(34) partition. We can write down an expression for the\np-integrand corresponding to this partition, using the three-point amplitudes above. This\nexpression is given by\n(\nX Rgr (|k1 |, |k2 |, p)\n\u00012\n\u00012\n\u00012\n|k\n|\n+\nip\n−\n|k\n|\nip\n+\n|k\n|\n−\n|k\n|\n|k\n|\n+\n|k\n|\n−\nip\nIs =\n2\n1\n1\n2\n1\n2\n32|k1 |2 |k2 |2 p2\n±\n\u00012\n\u00012\n\u00012\nRgr (|k3 |, |k4 |, −p)\n|k4 | − ip − |k3 | −ip + |k3 | − |k4 | |k3 | + |k4 | + ip\n2\n2\n2\n32|k3 | |k4 | p\n!2\n\"\n3\nλ̄1 , λ̄int\nhλ4 , λint i3\n×\nλ̄1 , λ̄2 (ws± ) λ̄2 (ws± ), λ̄int λ3 (ws± ), λ4 λ3 (ws± ), λint\n!2 #\n3\nλ̄3 , λ̄int\nhλ2 , λint i3\n+\nλ1 (ws± ), λ2 λ1 (ws± ), λint λ̄3 , λ̄4 (ws± ) λ̄4 (ws± ), λ̄int\n)\nws∓\nip\n×\n.\n8 (p2 + (k1 + k2 )2 ) ws± − ws∓\n\n(6.1)\n\nNote that if, on the left hand side, we use the norm |kint | = ip, on the right hand side we\nneed to use (−ip). We also need to flip the sign of λint , but this does not matter because of\n\n– 32 –\n\n\fthe fact that the integrand involves only the \"square\" of this term. By expanding out Rgr\nand recalling the identity (5.2), we find\n(\n\u0001\n\u0001\nX 1\n|k1 |2 + 4|k2 ||k1 | + |k2 |2 + p2 |k3 |2 + 4|k4 ||k3 | + |k4 |2 + p2\nIs =\n212 π\n(|k1 ||k2 ||k3 ||k4 |)2 (|k1 | + |k2 | + ip)2 (|k3 | + |k4 | − ip)2\n±\n\u00012\n\u00012\n\u00012\n\u00012\n× |k2 | + ip − |k1 | ip + |k1 | − |k2 | |k3 | + ip − |k4 | ip + |k4 | − |k3 |\n\u0010\n\u0002\n\u0003 \u00116\n\"\nλ̄1 , λ̄2 (ws± ) hλ4 , λ2 i + iEp12 λ̄1 , λ4\n×\n\u0002\n\u0003\u00012\n2\n2\nλ4 , λ3 (ws± )\nλ̄1 , λ̄2 (ws± )\nλ̄2 (ws± ), λ̄1 λ1 (ws± ), λ3 (ws± ) − iEp12 λ3 (ws± ), λ̄2 (ws± )\n#\n\u0003\u00016\n\u0002\nhλ2 , λ1 (ws± )i λ̄3 , λ̄1 + iEp12 λ2 , λ̄3\n+\n\u0002\n\u0003\u00012\n2\n2\nλ̄3 , λ̄4 (ws± )\nλ1 (ws± ), λ2 λ̄4 (ws± ), λ̄2 (ws± ) + iEp12 λ1 (ws± ), λ̄4 (ws± )\nλ1 (ws± ), λ2\n)\ni\nws∓\n× 2\n,\np + (k1 + k2 )2 ws± − ws∓\n(6.2)\n\nwhere we have remind the reader that Epnm ≡ ip + |kn | + |km |.\nExtracting the Residues:\nWe now proceed to implement (4.24) and extract the residue\nfrom the integrand above. An important difference from the conserved current computation\nis that, as we mentioned above, the poles that appear from three point amplitudes are double\npoles. So extracting the residue involves taking a derivative of the integrand with respect to\np at the pole.\nIt seems more convenient to perform this procedure through \"logarithmic differentiation\":\nfirst we write down an expression for the value of the integrand, with the singular term\nstripped off, at the pole. Next we write down an expression for the ratio of the derivative of\nthis term to the term itself.\nThe procedure of extracting the value of the integrand is almost identical to the one we\nfollowed to obtain (5.11). The difference is that various terms are squared. When Ep12 = 0 the\nvalue of w± (p) for this partition is still defined by (5.7) and (5.8). To simplify the integrand\nwe throw away all terms proportional to Ep12 . Apart from (5.10), we need one more explicit\nexpression for an extended spinor:\n\u0003\n\u0002\n\u0003\n\u0003 \u0002\n\u0002\nλ1 , λ̄1\nλ2 , λ̄2 + λ1 , λ̄1 − iE T\niE T\n+\n\u0002\n\u0003\n\u0003 λ̄1 +\n−\u0002\nλ̂4 .\n(6.3)\nλ̄2 (ws1 ) = λ̄3\nhλ2 , λ4 i\nλ2 , λ̄3\nλ2 , λ̄1\nFrom these expressions, we find\n\u00012\nVs+1 =(2πi) lim Ep12 Is\nEp12 →0\n\nh −i|k | E 34,12 (E T ) + 2|k ||k |\u0001 (E 3,124 )2 i\n\u0002\n\u00032\n2\n3\n4\nhλ\n,\nλ\ni\nλ\n,\nλ̄\n=\n2\n4\n2\n1\n256|k1 ||k3 |2 |k4 |2 (E T )2 (E 34,12 )2 hλ1 , λ2 i\n\u0002\n\u0003\u0002\n\u0003\u0001 \u0002\n\u00032 \u0002\n\u0003\n× λ̄1 , λ̄3 hλ2 , λ4 i E 12,34 + E T λ̄1 , λ4 λ2 , λ̄3\nλ4 , λ̄3 λ2 , λ̄3 .\n– 33 –\n\n(6.4)\n\n\fWe now turn to an evaluation of the derivative. As we mentioned above it is convenient\nto work with the quantity:\n\u0002\n\u00012 \u0003\nd\nlog Ep12 Is ,\nEp12 →0 dp\n\nDs+1 = lim\n\n(6.5)\n\nwhere it is understood that the limit is taken at the value of w± (p) in (6.2) corresponding to\nws+1 .\nBefore we evaluate this expression, note that we can also define w± through\nhλ1 (ws ), λ2 i λ̄1 , λ̄2 (ws ) = −(|k1 | + |k2 | − ip)Ep12 .\n\n(6.6)\n\nAt a pole in the p-integral, where Ep12 = 0, one of the terms on the left hand side must\nvanish. We have defined ws+1 to be the pole where the first dot product vanishes and ws−1 to\nbe the pole where the second dot product vanishes. With a slight abuse of notation, defining\ndw ±\ndp\n\n≡\n\ndws±1\ndp\n\nat this point, we have\n\n\u0003\ndws+1 \u0002\nλ̄1 , λ2 λ̄1 , λ̄2 (ws+ ) = −2i(|k1 | + |k2 |)\ndp\ndws+1\n−2i(|k1 | + |k2 |)\n−2i(|k1 | + |k2 |)\n\u0003\n\u0001.\n\u0002\n\u0003\n=\n=\u0002\n⇒ γ1+ ≡\n+\ndp\nλ̄\n,\nλ\nβ1 λ̄1 , λ2 λ̄1 , λ̄2 (ws1 )\n1\n2 β1 λ̄1 , λ̄2 + β2 hλ1 , λ2 i\n\nβ1\n\n(6.7)\n(6.8)\n\nFurthermore\n\n\u0002\n\u0003\ndws−1\nhλ1 (ws ), λ2 i λ̄1 , λ2 = −2i(|k1 | + |k2 |)\ndp\ndws−1\n−2i(|k1 | + |k2 |)\n\u0003 = −γ1+ .\n\u0002\n=\n⇒ γ1− ≡\ndp\nβ2 λ1 (ws−1 ), λ2 λ̄1 , λ2\n\nβ2\n\n(6.9)\n(6.10)\n\nWith this observation and notation, Ds+1 is given by\n\n!\n1\n1\nDs+1 = 2i (|k1 | + |k2 |)\n+\nE 34,12 E T + 2|k3 ||k4 | hλ1 , λ2 i λ̄1 , λ̄2\n\u0003\n\u0002\n\u0002\n\u0003!\n\u0012\n\u0013\n6 λ̄1 , λ4\n2 λ3 (ws+1 ), λ̄2 (ws+1 )\n2\n2\n2\n1\n+i\n−\n+ 4,123 + T −\nE 3,124\nE\nE\nhλ4 , λ2 i\nλ̄1 , λ̄2 (ws+1 )\nλ1 (ws+1 ), λ3 (ws+1 )\n(6.11)\n(\n\u0003\n\u0003)\n\u0002\n\u0003\n\u0002\n\u0002\n\u0002\n\u0003\n+ ) − β λ (w + ), λ̄\nλ̄\n,\nλ\nβ\nλ̄\n,\nλ\nλ̄\n,\nλ\n(w\nβ\nβ\n1\n2\n1\n3\n2\n3\n4\n1\n3\n3\n3\n1\ns1\ns1\n+ 2γ1+\n−\n+\nλ̄1 , λ̄2 (ws+1 )\nλ4 , λ3 (ws+1 )\nλ1 (ws+1 ), λ3 (ws+1 )\n− γ1+\n\nws+1 + ws−1\n\u0001.\nws−1 ws+1 − ws−1\n\nIf the reader wishes to expand this expression out in terms of un-extended spinors, she can\ndo so using (5.10), (6.3) and the additional identity:\n\u0002\n\u0003\n\u0002\n\u0003 \u0002\n\u0003\nλ4 , λ̄4 − iE T\nλ3 , λ̄3 + λ4 , λ̄4 − iE T\n+\n\u0003\n\u0003\n\u0002\n\u0002\nλ2 − λ4\n.\n(6.12)\nλ3 (ws1 ) =\nλ2 , λ̄3\nλ4 , λ̄3\n– 34 –\n\n\fHowever, this does not provide much additional insight so we have left the expression above\nas is.\nNote that the contribution of Vs−1 Ds−1 , which is just the residue at Ep12 = 0 but with\n±\nw (p) = ws−1 in (6.2) can be easily incorporated, just through some substitutions. We have\n\u0002 \u0003\n(6.13)\nIs = Vs+1 Ds+1 + (λ1 , λ2 , λ3 , λ4 ) ↔ (λ̄2 , λ̄1 , λ̄4 , λ̄3 ).\nTs1 = (2πi)\nRes\np=i(|k1 |+|k2 |)\n\nThere is another pole in Is at Ep34 = 0.6 The contribution of this pole is just obtained\nby interchanging (12) with (34):\nh i\nTs2 = Ts1\n.\n(6.14)\n1↔3,2↔4\n\nWe now turn to the second kind of contribution to the correlator from this partition,\nwhich comes from the pole where the denominator of the propagator vanishes. Fortunately,\nthis is a simple pole! This pole occurs at:\np = i|k1 + k2 |.\n\n(6.15)\n\n+\n\nNote that the factor w+w−w− becomes the identity, since w− = 0. Also, we do not need the\nother pole w+ at all, since that contribution vanishes because of this factor (which, in that\n−\ncase, would be w+w−w− ). We have already seen this in the calculation for current-correlators.\nPicking up the pole at w = 0, we have\nTs3 = (2πi)\n\nRes\n\np=i|k1 +k2 |\n\nIs\n\n\u0001\n\u0001\n−i E 12,s E 12s + 2|k2 ||k1 | E 34,s E 34s + 2|k4 ||k3 | (E 1s,2 )2 (E 2s,1 )2 (E 3s,4 )2 (E 4s,3 )2\n=\n212 (|k1 ||k2 ||k3 ||k4 |)2 (E 12,s )2 (E 34s )2 |k1 + k2 |\n\u0010\n\u0003 \u00116\n\u0002\n\"\nλ̄1 , λ̄2 hλ4 , λ2 i + iE 12,s λ̄1 , λ4\n×\n\u0002\n\u0003\u00012\n2\nλ̄1 , λ̄2\nλ̄2 , λ̄1 hλ1 , λ3 i − iE 12,s λ3 , λ̄2\nhλ3 , λ4 i2\n#\n\u0002\n\u0003\u00016\nhλ2 , λ1 i λ̄3 , λ̄1 + iE 12,s λ2 , λ̄3\n+\n\u0002\n\u0003\u00012\n2 ,\nhλ1 , λ2 i2 hλ1 , λ2 i λ̄4 , λ̄2 + iE 12,s λ1 , λ̄4\nλ̄3 , λ̄4\n(6.16)\nwhere we remind the reader that s stands for sum and so, for example,\nE 12,s ≡ |k1 | + |k2 | − |k1 + k2 |.\n\n(6.17)\n\nTo sum up the contribution of the (12)(34) partition is given by\nTs = Ts1 + Ts2 + Ts3 ,\n\n(6.18)\n\nwhere the three terms on the right are given by (6.13), (6.14) and (6.16).\n6\n\n34\nAlthough the pole that is manifest in (6.2) is actually at E−p\n= 0, we should remember that the integrand\n34\nis even in p and we can rewrite it to make the pole at Ep = 0 manifest instead.\n\n– 35 –\n\n\f6.2 (14)(23) Partition\nThis leads to the same expression as above with the substitution 2 ↔ 4. The computation of\nthe residue is exactly the same as the one for the (12)(34) partition with 4 ↔ 2:\n\u0002 \u0003\nTt = Ts λ4 ↔λ2 ,λ̄4 ↔λ̄2 .\n\n6.3 (13)(24) Partition\n\n(6.19)\n\nThis partition has a slightly different structure. We can write the integrand for this partition\nP\nas Iu = ± Iu± , corresponding to the two different values of w where\nwu±\nip\nRgr (|k1 |, |k3 |, p) Rgr (|k2 |, |k4 |, p)\n×\n.\nIu± =\n±\n32|k1 |2 |k3 |2 p2 32|k2 |2 |k4 |2 p2\n8 (p2 + (k1 + k3 )2 ) wu − wu∓\n\"\n\u00012\n\u00012\n\u00012\n\u00012\n× |k1 | + ip − |k3 | ip + |k3 | − |k1 | |k1 | + |k3 | − ip |k4 | + ip − |k2 |\n3\n\n\u00012\n\u00012\nip + |k2 | − |k4 | |k2 | + |k4 | + ip\n24 2\n+ (Ep13 )2 (E−p\n)\n\nλ̄1 , λ̄3\n\nλ̄1 , λ̄int\n\nλ̄1 , λ̄3\nhλ4 , λ2 i3\nλ̄1 , λ̄int λ̄3 , λ̄int hλ2 , λint i hλ4 , λint i\n#\n\u00012\nλ̄3 , λ̄int hλ2 , λ4 i hλ2 , λint i hλ4 , λint i\n.\n\n!2 (6.20)\n\nWe can write this expression as\n\u0001\n\u0001\n|k1 |2 + 4|k3 ||k1 | + |k3 |2 + p2 |k2 |2 + 4|k2 ||k4 | + |k4 |2 + p2\n=\n212 π(|k1 ||k4 ||k3 ||k2 |)2\n\"\n\u00012\n\u00012\n\u00012\n\u00012\n|k1 | + ip − |k3 | ip + |k3 | − |k1 | |k4 | + ip − |k2 | ip + |k2 | − |k4 |\n×\n24 )2\n(Ep13 )2 (E−p\nIu±\n\n6\n\n×\n\nλ̄1 , λ̄3\n\nλ̄1 , λ̄3 hλ4 , λ2 i6\n\u0003\u00012\n\u0003\u00012\n\u0002\n\u0002\nλ2 , λ3 (wu± ) + iEp13 λ̄1 , λ2\nλ̄3 , λ̄1 λ4 , λ1 (wu± ) + iEp13 λ̄3 , λ4\n2\n\nλ̄1 , λ̄3 hλ2 , λ4 i2\n+\n(|k1 | + |k3 | − ip)2 (|k2 | + |k4 | + ip)2\n×\n×\n\nλ̄3 , λ̄2 (wu±\n\nhλ4 , λ2 i +\n\nwu∓\n.\np2 + (k1 + k3 )2 wu± − wu∓\ni\n\n24\niE−p\n\n\u0002\n\nλ̄3 , λ4\n\n\u0003\u00012\n\nλ̄1 , λ̄4 (wu± )\n\nhλ2 , λ4 i +\n\n24\niE−p\n\n\u0002\n\nλ̄1 , λ2\n\n\u0003\u00012\n\n#\n\n(6.21)\n\nExtracting the Residues: Let us start by picking up the residue at p = i(|k1 |+|k3 |). We\nsee from the expression above that only the term with hint = −1 contributes to this residue;\n\n– 36 –\n\n\fhowever, both values of w are important. We have\nVu±1 = (2πi) lim\n\nEp13 →0\n\n=\n\nEp12\n\n\u00012\n\nIu±\n\n\u0001\n|k1 ||k3 | E 24,13 E T + 2|k2 ||k4 | (E 4,123 )2 (E 2,134 )2 λ̄1 , λ̄3 hλ4 , λ2 i6\n2\n\n64(|k4 ||k2 |)2 (E T )2 λ2 , λ3 (wu± )\n\nλ4 , λ1 (wu± )\n\n2\n\nhλ1 , λ3 i\n\nwu∓1\n.\nwu±1 − wu∓1\n\n(6.22)\n\nNow we need the derivative of the log of the integrand. Recall that w can be defined\nthrough\nD\nE\nˆ β w± , λ + λ̄\nˆ β w± λ̄ , λ̄ = − ((|k | + |k | − ip) E 13 ,\n(6.23)\nλ1 + λ̄\n1\n3\n1 1\n3\n1\n3\n3 3\np\nand this also leads to an expression for the derivative when Ep13 = 0:\nγ3± ≡\n\ndwu±1\n=\ndp\nλ̄1 , λ̄3\n\nWe have γ3+ = −γ3− .\n\nβ3\n\n\u0002\n\n2i(|k1 | + |k3 |)\n\u0003\n\u0002\n\u0003\u0001 .\nλ1 (w± ), λ̄3 − β1 λ3 (w± ), λ̄1\n\n(6.24)\n\nWe can now evaluate the derivative that we need\nDu+1 = lim\n\nEp13 →0\n\n\u0002\n\u00012 \u0003\nd\nlog Ep13 Iu+\ndp\n\n2i\n2i(|k1 | + |k3 |)\n2i\n2i\n+ 4,123 + 2,134 + T\nE\nE\nE\nhλ1 , λ3 i λ̄1 , λ̄3\n!\n\u0003\n\u0002\n\u0003\n\u0002\n2β1 λ4 , λ̄1\nw+ + w−\n2β3 λ2 , λ̄3\n+\n+ − u1 + u1 − \u0001\n− γ3+\n±\n±\nwu1 wu1 − wu1\nλ2 , λ3 (wu )\nλ4 , λ1 (wu )\n\u0003\n\u0002\n\u0003 !\n\u0002\nλ̄1 , λ2\nλ̄3 , λ4\n2\n+\n−\n.\n±\nλ̄1 , λ̄3\nλ2 , λ3 (wu )\nλ4 , λ1 (wu± )\n=\n\n2i(|k1 | + |k3 |)\n24,13\nE\nE T + 2|k2 ||k4 |\n\n+\n\n(6.25)\n\nWe can now write\nTu1 =\n\nX\n±\n\nVu±1 Du±1 .\n\n(6.26)\n\nThe residue at p = i(|k2 | + |k4 |) can be obtained by interchanges in the expression above:\nh i\nTu2 = Tu1\n\n1↔2̄,3↔4̄\n\n.\n\n(It is understood that alongside we also take 1̄ ↔ 2, 3̄ ↔ 4.)\n\n– 37 –\n\n(6.27)\n\n\fFinally, we turn to the contribution from the pole at p2 = −(k2 + k4 )2 = −(k1 + k3 )2 ,\nwhich occurs at w = 0. This is a first order pole and we can evaluate it as above.\nTu3 = (2πi)\n\nRes\n\np=i|k1 +k3 |\n\nIu\n\n\u0001\n\u0001\n−i E 13,s E 13s + 2|k1 ||k3 | E 24,s E 24s + 2|k2 ||k4 |\n=\n212 (|k1 ||k4 ||k3 ||k2 |)2 |k1 + k3 |\n\"\n\u00012\n\u00012\n\u00012\n\u00012\n2\nE 1s,3 E 3s,1 E 2s,4 E 24s\nλ̄1 , λ̄3 hλ4 , λ2 i6\n(6.28)\n×\n\u00132 \u0012\n\u00132\n\u0012\n\u00012\n\u00012\nλ̄\n,\nλ\nλ̄\n,\nλ\n[\n]\n[\n]\n3\n4\n1\n2\nhλ4 , λ1 i + iE 13,s λ̄ , λ̄\nE 13,s E 24,s\nhλ2 , λ3 i + iE 13,s λ̄ , λ̄\nh 1 3i\nh 3 1i\n!\n\u0003 !2 #\n\u0002\n\u0003\n\u0002\n2\n2\nλ̄1 , λ̄3 hλ2 , λ4 i6\nλ̄\n,\nλ\nλ̄\n,\nλ\n1\n2\n3\n4\n+\n.\nλ̄1 , λ̄4 + iE 24s\nλ̄3 , λ̄2 + iE 24s\n(E 13s )2 (E 24,s )2\nhλ4 , λ2 i\nhλ2 , λ4 i\nThe contribution from this partition can be written as\nTu = Tu1 + Tu2 + Tu3 ,\n\n(6.29)\n\nsumming the contributions of the three terms on the right hand side, which are computed\nabove.\n6.4 Final Answer\nThe final answer for the stress tensor correlator can now be written in terms of all the\ncontributions above:\nT +−+− (k1 , . . . k4 ) = Ts + Tt + Tu ,\n(6.30)\nwhere the contributions from the three partitions are given in (6.18), (6.19), and (6.29). The\nformula above involves only four structurally distinct expressions. These are the expressions\nfor the residue at ws+1 , at ws3 , at wu+1 and wu3 . The formula above tells us that all other\nexpressions are given by simple interchanges in these expressions.\n6.5 Flat Space Limit\nAlthough the final formulas above are more complicated than the corresponding formulas for\ncurrents, it is not difficult to extract the MHV graviton amplitude from them. Our analysis\nis very similar to subsection 5.1.2, so we will be brief here.\nFirst let us recall some facts about the flat space MHV graviton amplitude. Consider the\nrational functions of w:\nMMHV (w) = i\n\nhλ4 , λ2 i6 λ̄1 , λ̄3\n,\nhλ3 (w), λ4 i hλ1 (w), λ2 i hλ2 , λ3 (w)i hλ1 (w), λ4 i hλ1 (w), λ3 (w)i\n\n(6.31)\n\n6\n\nMMHV (w) = i\n\nλ̄3 , λ̄4 (w)\n\nλ̄3 , λ̄1 hλ2 , λ4 i\nλ̄1 , λ̄2 (w) λ̄1 , λ̄4 (w) λ̄2 (w), λ̄3\n\nλ̄2 (w), λ̄4 (w)\n\n,\n\nwith w extended according to (4.1). The usual MHV graviton amplitude is given by M MHV (0) =\nM MHV (0) [18, 8].\n\n– 38 –\n\n\fThe trick is to break M MHV (0) into partial fractions. This can be achieved by using the\nCauchy theorem and writing M MHV (0) as the sum of the residues of M MHV (w) at its poles.\nHowever, these poles are precisely at the values of w considered in our previous subsection.\nIn particular, we have\n\"\nhλ1 (w), λ4 i\nhλ3 (w), λ4 i\nhλ1 (w), λ2 i\n+ lim\n+ lim\nM MHV (0) =\nlim\n+\n+\n+\nhλ1 , λ2 i\nhλ1 , λ4 i\nhλ3 , λ4 i\nw→wt\nw→ws2\nw→ws1\n1\n#\n(6.32)\nwu∓1\nhλ3 (w), λ1 (w)i\nhλ3 (w), λ2 i X\nMHV\nM\n(w),\n+\nlim\n+ lim\n∓\n±\n±\nhλ3 , λ2 i\nhλ\n,\nλ\ni\nw\n−\nw\n3\n1\nw→w\nw→wt+\nu\nu\nu\n1\n1\n1\n±\n2\n\nwhich is just the sum of the residues of M MHV (w) at all its poles. We can write down an\nanalogous expression for M MHV (w).\nNow, let us turn to our computations of the stress tensor correlator. To check the\nflat space limit, we need to focus on the coefficient of (E T )−3 and check that it matches\nthe expressions above. However, a term of this kind only comes from the E1T term in the\nderivatives. We can see a term of this form in (6.11) and (6.25). So, to check the coefficient\nwe must only look at the values of the integrands (with the poles stripped off) at E T = 0.\nThis is easy to do. For example, consider (6.2). Near E T = 0, we can see that\nVs+1\n\nλ̄1 , λ̄2 (ws+1 ) hλ4 , λ2 i6\n|k1 ||k2 ||k3 ||k4 |\n+ ...\n=\n2\n2\n2(E T )2\nλ1 (ws+1 ), λ3 (ws+1 )\nλ4 , λ3 (ws+1 ) hλ1 , λ2 i\n\n(6.33)\n\nwhere the . . . are terms less singular in E T . Here, we have just dropped the Ep12 terms in\n(6.2) and simplified other factors using E T = 0. Now, using the fact that λ(ws+1 ) ∝ λ2 , we\ncan write\nVs+1\n\n=\n\n|k1 ||k2 ||k3 ||k4 | λ̄1 , λ̄2 (ws+1 ) hλ4 , λ2 i6 hλ2 , λ4 i\n\n2(E T )2 λ1 (ws+1 ), λ3 (ws+1 )\n\nλ2 , λ3 (ws+1 )\n\nDropping terms that are less singular at\nVs+1\n\n1\n=\n2(E T )2 λ1 (ws+1 ), λ3 (ws+1 )\n\nCombining this with the\n\n2i\nET\n\nET\n\nλ1 (ws+1 ), λ4\n\nfrom\n\n2\n\nhλ1 , λ2 i\n\n+ ...\n(6.34)\n\n= 0, this becomes:\n\nλ̄1 , λ̄3 hλ4 , λ2 i6\nλ2 , λ3 (ws+1 ) λ1 (ws+1 ), λ4\nDs+1\n\nλ4 , λ3 (ws+1 )\n\nλ3 (ws+1 ), λ4 hλ1 , λ2 i\n\n+ ...\n(6.35)\n\nin (6.11), we see that\n\n|k1 ||k2 ||k3 ||k4 | λ̄1 , λ̄3 hλ4 , λ2 i6\n+ ...\n(E T )3 λ1 (ws+1 ), λ3 (ws+1 ) λ2 , λ3 (ws+1 ) λ1 (ws+1 ), λ4 λ3 (ws+1 ), λ4 hλ1 , λ2 i\n(6.36)\nHowever, this is exactly the first term in (6.32)! Working through the other terms we see that\nthe full gravitational correlator can be written\n\u0011\n|k1 ||k2 ||k3 ||k4 | \u0010 MHV\nMHV\nT +−+− (k1 , . . . k4 ) =\n(0)\n+ ...\n(6.37)\nM\n(0)\n+\nM\n(E T )3\nTs1 =\n\ni\n\n– 39 –\n\n\fwhere . . . are terms less singular in E T . This is precisely consistent with the flat space limit\nconjectured in [9], which we remind the reader was:\n(E T )3\nT +−+− (k1 , . . . k4 ).\nQ\n4\nT\nE →0 2\nm=1 |km |\n\nM +−+− (k1 , . . . , k4 ) = lim\n\n(6.38)\n\nThis concludes our discussion of the flat space limit of the MHV graviton correlator. It is\nnot difficult to see that for NMHV and N2 MHV configurations, the graviton correlator (with\na pure Hilbert action) has no (E1T )3 singularities and so its flat space limit vanishes just as\none would expect.\n\n7. Discussion\nIn this paper, we have obtained four point functions of the stress-tensor in AdS4 /CFT3 from\na bulk gravity computation. Although the evaluation of Witten diagrams in AdS is very\ncomplicated, we utilized the technique devised in a companion paper to directly obtain the\nfinal answer using three point functions as an input. To our knowledge, this is the first time\nexplicit expressions for the four point function of the stress-tensor have been written down.\nTo summarize briefly, we wrote down a general formula for the four point function for\narbitrary external helicities and momenta in terms of the residues of a rational integrand at\npre-specified poles. This formula is given in (4.24). In the case of the MHV current and stress\ntensor correlators, we evaluated this formula in terms of the external spinors. The answer for\nthe color-ordered MHV correlator is given in (5.16) and for the full MHV correlator is given\nin (5.51). The answer for the full MHV stress tensor correlator is given in (6.30). We also\nverified that, in the flat space limit, these answers give exactly the flat space MHV gluon and\ngraviton amplitudes.\nFrom a structural perspective, it is interesting that our recursion relations also remove\nthe divergences that usually appear in momentum space computations from the region near\nthe boundary. What is striking, and related to this, is that our final answers are purely\nrational functions of the momenta, their norms, and the norms of the sum of the momenta i.e.\nkm , |km | and |km1 + km2 |. In particular, our answers are free of logarithms in momentum\nspace.\nThe fact that stress tensor correlators have such an analytic structure is also supported\nby the observation that their correlators in AdS4 can be obtained by doing a flat space\ncomputation (on half of flat space) using conformal gravity [19]. Similarly, current correlators\nin AdS4 with pure Yang-Mills in the bulk can also be obtained by doing a computation on\n4-dimensional flat space, cut off at z = 0. These computations do not lead to any logarithms\nin momentum space.\nNow logarithms in position space come from the fact that when we expand a four point\ncorrelator of some operator φ in a large-N theory, hφ(0)φ(x)φ(y1 )φ(y2 )i, in terms of the contribution of various operators in the OPE when x is close to 0, we get terms like |x|∆0 −2∆φ +δ\nwhere ∆φ is the dimension of φ, ∆O is the dimension of the operator in the OPE-channel\n\n– 40 –\n\n\funder consideration, and δ is a small \"anomalous dimension\" proportional to a negative\npower of N . Expanding this term in a N1 expansion we get logarithms. From the fact that\nthe Fourier transform of |x|∆O −2∆φ +δ is proportional to |k|−d−∆O +2∆φ −δ , one might naively\nsuspect that the absence of logarithms in momentum space is indicative of the absence of\nanomalous dimensions for double trace operators of the stress tensor.\nHowever, this logic is not quite correct.7 In the case where ∆O − 2∆φ is a positive even\ninteger, if we carefully consider this Fourier transform we find that we can get logarithms in\nposition space without corresponding logarithms in momentum space. This is related to the\n1\nin 3 dimensions, where m is a non-negative integer,\nfact that the Fourier transform of |k|2m+3\n2m\nis proportional to |x| log (|x|) plus some terms that are analytic in x and depend on the\nprecise iǫ prescription that we use while performing the Fourier transform. In fact, the double\ntrace operators of the stress tensor that appear in the four point correlator, which we have\ncomputed, give a contribution that is of this form. Their contribution in the OPE can be\nwritten in the form Q(x, y1 , y2 )|x|2m+δ where Q is a polynomial in x. Consequently, they\nare subject to the subtlety above. It would be nice to perform this Fourier transform in full\ndetail and extract the anomalous dimensions and OPE coefficients of double trace operators\nfrom our results.\nAs we mentioned above, the OPE provides another check on our final answer. The\nresidue from the third pole in the list (4.23) automatically contains the product of three\npoint functions of the stress tensor multiplied with the appropriate power of the two point\nfunction. This accounts for the entire contribution of the conformal block of the stress tensor\nitself.8 It would be nice to show explicitly that the rest of the correlator is consistent with\nthe expectation that it comes from the contribution of double trace operators.\nTurning now to finer details in the four point correlator, we notice that our answers for\ncurrent correlators are relatively simple but our expressions for stress-tensor correlators are\nstill somewhat unwieldy. It would be nice to put these answers in their \"simplest possible\"\nform. One complication is that in momentum space it is only the Lorentz subgroup SO(2, 1),\nof the conformal group on the boundary, that is manifest. For scattering amplitudes in\nfour dimensional flat space, the Lorentz group SO(3, 1) and a knowledge of how amplitudes\nscale under dilatations at tree-level is sufficient to ensure that four point function essentially\ndepends only on one variable - the scattering angle. This simplification cannot be obtained\nhere just by using the Lorentz group of the boundary.\nOf course the full conformal group is far more powerful but the constraints of special conformal invariance are differential equations in momentum space. This makes these constraints\nrather tedious to implement.\nOne could also ask whether a knowledge of the flat space limit of the correlator, and\nsome further assumptions about its analytic structure are enough to determine it completely.\n7\n\nI would like to thank Liam Fitzpatrick, Jared Kaplan and Joao Penedones for a discussion on this question.\nAs we mentioned above, an advantage of momentum space is that we do not have to worry about conformal\nblocks: the contribution of all descendants in a channel is just obtained by multiplying correlators, on the left\nand the right, involving the primary.\n8\n\n– 41 –\n\n\fThis deserves further attention. It is also possible that the simplest form of the four point\ncorrelators will be obtained by using another formalism, such as twistor space or a simpler\nset of recursion relations. We hope that the results presented here will be useful as inputs\nand checks on any such new method. So we have included a Mathematica program with\nthe source of the arXiv version of this paper that allows for the automated evaluation of the\nformulas in this paper.\nWe should mention that it is quite easy to generalize this formalism to supersymmetric\ntheories. While graviton tree-amplitudes are the same in supergravity and pure gravity, it is\npossible that expressing the amplitude in a manifestly supersymmetric form will make it more\ncompact and also reveal links between correlators for different possible external helicities. We\nleave these investigations to future work.\nFinally, we should point out that in this paper we have observed several advantages of\ngoing to momentum space in AdS4 for computations involving massless fields with spin. The\nwave-functions are very simple, and so z-integrals are easy to do; complicated interactions\ncan be analyzed by generalizing flat space techniques in momentum space; conformal blocks\nare trivial and it is also easy to take a flat space limit. This suggests that it would be very\nuseful to analyze the Vasiliev theory in AdS4 - which contain massless higher spin fields -\nin momentum space. We leave this to future work.\n\nAcknowledgments\nI am grateful to Juan Maldacena and Guilherme Pimentel for collaboration in the early\nstages of this work. I would like to thank Sayantani Bhattacharyya, Bobby Ezhuthachan,\nRajesh Gopakumar, Shiraz Minwalla, Kyriakos Papadodimas, Sandip Trivedi and Ashoke\nSen for useful discussions. This work was primarily supported by a Ramanujan Fellowship\nof the Department of Science and Technology. I would also like to acknowledge the support\nof the Harvard University Department of Physics. I would like to thank the Institute for\nAdvanced Study (Princeton), the Institute of Mathematical Sciences (Chennai), the\nChennai Mathematical Institute, Delhi University and the Tata Institute of Fundamental\nResearch (Mumbai) for their hospitality while this work was being completed.\n\nReferences\n[1] J. M. Maldacena, The Large N limit of superconformal field theories and supergravity,\nAdv.Theor.Math.Phys. 2 (1998) 231–252, [hep-th/9711200].\n[2] H. Liu and A. A. Tseytlin, On four-point functions in the CFT/AdS correspondence, Phys. Rev.\nD59 (1999) 086002, [hep-th/9807097]. ;D. Z. Freedman, S. D. Mathur, A. Matusis, and\nL. Rastelli, Correlation functions in the CFT(d) / AdS(d+1) correspondence, Nucl.Phys. B546\n(1999) 96–118, [hep-th/9804058]. ;G. Arutyunov and S. Frolov, Four point functions of lowest\nweight CPOs in N=4 SYM(4) in supergravity approximation, Phys.Rev. D62 (2000) 064016,\n[hep-th/0002170]. ;J. Bartels, J. Kotanski, A.-M. Mischler, and V. Schomerus, R-current\nsix-point correlators in AdS(5) Supergravity, Nucl.Phys. B832 (2010) 382–413,\n[arXiv:0912.3072].\n\n– 42 –\n\n\f[3] E. Witten, Anti-de Sitter space and holography, Adv. Theor. Math. Phys. 2 (1998) 253–291,\n[hep-th/9802150]. ;S. Gubser, I. R. Klebanov, and A. M. Polyakov, Gauge theory correlators\nfrom noncritical string theory, Phys.Lett. B428 (1998) 105–114, [hep-th/9802109].\n[4] E. D'Hoker, D. Z. Freedman, and L. Rastelli, AdS / CFT four point functions: How to succeed\nat z integrals without really trying, Nucl.Phys. B562 (1999) 395–411, [hep-th/9905049].\n[5] A. L. Fitzpatrick, J. Kaplan, J. Penedones, S. Raju, and B. C. van Rees, A Natural Language\nfor AdS/CFT Correlators, arXiv:1107.1499. ;J. Penedones, Writing CFT correlation functions\nas AdS scattering amplitudes, arXiv:1011.1485. ;M. F. Paulos, Towards Feynman rules for\nMellin amplitudes, arXiv:1107.1504. ;G. Mack, D-independent representation of Conformal\nField Theories in D dimensions via transformation to auxiliary Dual Resonance Models. Scalar\namplitudes, arXiv:0907.2407. ;G. Mack, D-dimensional Conformal Field Theories with\nanomalous dimensions as Dual Resonance Models, arXiv:0909.1024. ;M. S. Costa,\nJ. Penedones, D. Poland, and S. Rychkov, Spinning Conformal Blocks, JHEP 1111 (2011) 154,\n[arXiv:1109.6321]. ;M. S. Costa, J. Penedones, D. Poland, and S. Rychkov, Spinning\nConformal Correlators, JHEP 1111 (2011) 071, [arXiv:1107.3554]. 46 pages, 3 figures/ V2:\nreferences added.\n[6] B. S. DeWitt, Quantum theory of gravity. III. Applications of the covariant theory, Phys. Rev.\n162 (1967) 1239–1256.\n[7] E. Witten, Perturbative gauge theory as a string theory in twistor space, Commun. Math. Phys.\n252 (2004) 189–258, [hep-th/0312171]. ;R. Britto, F. Cachazo, and B. Feng, New recursion\nrelations for tree amplitudes of gluons, Nucl. Phys. B715 (2005) 499–522, [hep-th/0412308].\n;R. Britto, F. Cachazo, B. Feng, and E. Witten, Direct proof of tree-level recursion relation in\nYang- Mills theory, Phys. Rev. Lett. 94 (2005) 181602, [hep-th/0501052]. ;N. Arkani-Hamed,\nF. Cachazo, and J. Kaplan, What is the Simplest Quantum Field Theory?, JHEP 09 (2010) 016,\n[arXiv:0808.1446]. ;N. Arkani-Hamed, F. Cachazo, C. Cheung, and J. Kaplan, A Duality For\nThe S Matrix, JHEP 1003 (2010) 020, [arXiv:0907.5418]. ;D. Forde, Direct extraction of\none-loop integral coefficients, Phys. Rev. D75 (2007) 125019, [arXiv:0704.1835]. ;M. Spradlin,\nA. Volovich, and C. Wen, Three Applications of a Bonus Relation for Gravity Amplitudes,\nPhys.Lett. B674 (2009) 69–72, [arXiv:0812.4767]. ;S. Raju, The Noncommutative S-Matrix,\nJHEP 06 (2009) 005, [arXiv:0903.0380]. ;S. Lal and S. Raju, The Next-to-Simplest Quantum\nField Theories, Phys. Rev. D81 (2010) 105002, [arXiv:0910.0930]. ;S. Lal and S. Raju,\nRational Terms in Theories with Matter, JHEP 08 (2010) 022, [arXiv:1003.5264]. ;R. H.\nBoels, On BCFW shifts of integrands and integrals, JHEP 1011 (2010) 113, [arXiv:1008.3101].\n[8] L. Mason and D. Skinner, Gravity, Twistors and the MHV Formalism, Commun.Math.Phys.\n294 (2010) 827–862, [arXiv:0808.3907]. ;D. Nguyen, M. Spradlin, A. Volovich, and C. Wen,\nThe Tree Formula for MHV Graviton Amplitudes, arXiv:0907.2276.\n[9] S. Raju, New Recursion Relations and a Flat Space Limit for AdS/CFT Correlators,\narXiv:1201.6449.\n[10] J. M. Maldacena and G. L. Pimentel, On graviton non-Gaussianities during inflation,\narXiv:1104.2846.\n[11] J. M. Maldacena, Non-Gaussian features of primordial fluctuations in single field inflationary\nmodels, JHEP 0305 (2003) 013, [astro-ph/0210603].\n\n– 43 –\n\n\f[12] J. Martı́n-Garcı́a, \"xAct: Efficient tensor computer algebra for Mathematica.\"\nhttp://www.xact.es/index.html, May, 2011. [accessed on 9 July 2011]. ;J. Martı́n-Garcı́a,\nD. Yllanes, and R. Portugal, The invar tensor package: Differential invariants of riemann,\nComputer Physics Communications 179 (2008), no. 8 586–590. ;J. Martı́n-Garcı́a, R. Portugal,\nand L. Manssur, The invar tensor package, Computer Physics Communications 177 (2007),\nno. 8 640–648. ;D. Brizuela, J. Martı́n-Garcı́a, and G. Mena Marugán, xpert: computer algebra\nfor metric perturbation theory, General Relativity and Gravitation 41 (2009), no. 10 2415–2431.\n[13] G. Arutyunov and S. Frolov, Three point Green function of the stress energy tensor in the AdS /\nCFT correspondence, Phys.Rev. D60 (1999) 026004, [hep-th/9901121].\n[14] S. Raju, Recursion Relations for AdS/CFT Correlators, arXiv:1102.4724.\n[15] S. Raju, BCFW for Witten Diagrams, Phys. Rev. Lett. 106 (2011) 091601, [arXiv:1011.0780].\n[16] S. El-Showk and K. Papadodimas, Emergent Spacetime and Holographic CFTs,\narXiv:1101.4163.\n[17] A. Barabanschikov, L. Grant, L. L. Huang, and S. Raju, The spectrum of Yang Mills on a\nsphere, JHEP 01 (2006) 160, [hep-th/0501063].\n[18] F. A. Berends, W. Giele, and H. Kuijf, On relations between multi - gluon and multigraviton\nscattering, Phys.Lett. B211 (1988) 91.\n[19] J. Maldacena, Einstein Gravity from Conformal Gravity, arXiv:1105.5632.\n\n– 44 –\n\n\f"}