{"id": "http://arxiv.org/abs/0801.1007v1", "guidislink": true, "updated": "2008-01-07T14:50:22Z", "updated_parsed": [2008, 1, 7, 14, 50, 22, 0, 7, 0], "published": "2008-01-07T14:50:22Z", "published_parsed": [2008, 1, 7, 14, 50, 22, 0, 7, 0], "title": "Short time die attach characterisation of semiconductor devices", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2791%2C0904.3961%2C0904.0260%2C0904.1874%2C0904.2259%2C0904.2459%2C0904.2682%2C0904.0214%2C0904.3065%2C0904.3640%2C0904.1928%2C0904.2843%2C0904.0996%2C0904.1780%2C0904.1348%2C0904.4189%2C0904.1312%2C0904.1774%2C0904.0970%2C0904.2488%2C0904.2653%2C0904.3336%2C0904.1779%2C0904.2668%2C0904.1332%2C0904.4343%2C0904.3566%2C0904.4096%2C0904.4756%2C0801.3702%2C0801.0768%2C0801.4550%2C0801.2849%2C0801.2013%2C0801.2426%2C0801.0952%2C0801.4682%2C0801.1496%2C0801.4532%2C0801.3551%2C0801.0007%2C0801.0732%2C0801.4385%2C0801.2255%2C0801.0607%2C0801.3693%2C0801.3369%2C0801.1964%2C0801.1007%2C0801.1148%2C0801.0797%2C0801.3000%2C0801.0431%2C0801.3107%2C0801.2340%2C0801.2964%2C0801.0144%2C0801.0352%2C0801.4891%2C0801.3356%2C0801.2117%2C0801.4346%2C0801.3577%2C0801.2911%2C0801.4269%2C0801.3474%2C0801.4917%2C0801.4748%2C0801.1631%2C0801.0348%2C0801.0252%2C0801.3717%2C0801.2500%2C0801.1979%2C0801.4366%2C0801.3846%2C0801.3131%2C0801.2026%2C0801.2100%2C0801.4397%2C0801.1083%2C0801.0419%2C0801.3243%2C0801.4865%2C0801.3547%2C0801.2892%2C0801.2006%2C0801.3396%2C0801.3514%2C0801.0304%2C0801.2293%2C0801.1439%2C0801.0437%2C0801.1920%2C0801.1084%2C0801.1356%2C0801.4021%2C0801.1005%2C0801.0762%2C0801.1944%2C0801.2537&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Short time die attach characterisation of semiconductor devices"}, "summary": "Thermal qualification of the die attach of semiconductor devices is a very\nimportant element in the device characterization as the temperature of the chip\nis strongly affected by the quality of the die attach. Voids or delaminations\nin this layer may cause higher temperature elevation and thus damage or shorter\nlifetime. Thermal test of each device in the manufacturing process would be the\nbest solution for eliminating the devices with wrong die attach layer. In this\npaper we will present the short time thermal transient measurement method and\nthe structure function evaluation through simulations and measurements for die\nattach characterization. We will also present a method for eliminating the very\ntime consuming calibration process. Using the proposed methods even the in-line\ntesting of LEDs can be accomplished.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2791%2C0904.3961%2C0904.0260%2C0904.1874%2C0904.2259%2C0904.2459%2C0904.2682%2C0904.0214%2C0904.3065%2C0904.3640%2C0904.1928%2C0904.2843%2C0904.0996%2C0904.1780%2C0904.1348%2C0904.4189%2C0904.1312%2C0904.1774%2C0904.0970%2C0904.2488%2C0904.2653%2C0904.3336%2C0904.1779%2C0904.2668%2C0904.1332%2C0904.4343%2C0904.3566%2C0904.4096%2C0904.4756%2C0801.3702%2C0801.0768%2C0801.4550%2C0801.2849%2C0801.2013%2C0801.2426%2C0801.0952%2C0801.4682%2C0801.1496%2C0801.4532%2C0801.3551%2C0801.0007%2C0801.0732%2C0801.4385%2C0801.2255%2C0801.0607%2C0801.3693%2C0801.3369%2C0801.1964%2C0801.1007%2C0801.1148%2C0801.0797%2C0801.3000%2C0801.0431%2C0801.3107%2C0801.2340%2C0801.2964%2C0801.0144%2C0801.0352%2C0801.4891%2C0801.3356%2C0801.2117%2C0801.4346%2C0801.3577%2C0801.2911%2C0801.4269%2C0801.3474%2C0801.4917%2C0801.4748%2C0801.1631%2C0801.0348%2C0801.0252%2C0801.3717%2C0801.2500%2C0801.1979%2C0801.4366%2C0801.3846%2C0801.3131%2C0801.2026%2C0801.2100%2C0801.4397%2C0801.1083%2C0801.0419%2C0801.3243%2C0801.4865%2C0801.3547%2C0801.2892%2C0801.2006%2C0801.3396%2C0801.3514%2C0801.0304%2C0801.2293%2C0801.1439%2C0801.0437%2C0801.1920%2C0801.1084%2C0801.1356%2C0801.4021%2C0801.1005%2C0801.0762%2C0801.1944%2C0801.2537&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal qualification of the die attach of semiconductor devices is a very\nimportant element in the device characterization as the temperature of the chip\nis strongly affected by the quality of the die attach. Voids or delaminations\nin this layer may cause higher temperature elevation and thus damage or shorter\nlifetime. Thermal test of each device in the manufacturing process would be the\nbest solution for eliminating the devices with wrong die attach layer. In this\npaper we will present the short time thermal transient measurement method and\nthe structure function evaluation through simulations and measurements for die\nattach characterization. We will also present a method for eliminating the very\ntime consuming calibration process. Using the proposed methods even the in-line\ntesting of LEDs can be accomplished."}, "authors": ["P. Szabo", "M. Rencz"], "author_detail": {"name": "M. Rencz"}, "author": "M. Rencz", "arxiv_comment": "Submitted on behalf of TIMA Editions\n  (http://irevues.inist.fr/tima-editions)", "links": [{"href": "http://arxiv.org/abs/0801.1007v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.1007v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.1007v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.1007v1", "journal_reference": "Dans 13th International Worshop on THERMal INvestigations of ICs\n  and Systems - THERMINIC 2007, Budapest : Hongrie (2007)", "doi": null, "fulltext": "Budapest, Hungary, 17-19 September 2007\n\nSHORT TIME DIE ATTACH CHARACTERIZATION OF SEMICONDUCTOR DEVICES\nPéter Szabó1,2, Márta Rencz1,2\n1\n\nBudapest University of Technology, Department of Electron Devices, Budapest XI.,\nGoldman György tér 3. H-1111 Hungary, tel.:(+36-1) 463-2727\n2\nMicReD Ltd, Budapest XI., Etele út 59-61, H-1119 Hungary, tel.: (+36-1) 481-1369\nABSTRACT\nThermal qualification of the die attach of semiconductor\ndevices is a very important element in the device\ncharacterization as the temperature of the chip is strongly\naffected by the quality of the die attach. Voids or\ndelaminations in this layer may cause higher temperature\nelevation and thus damage or shorter lifetime. Thermal test\nof each device in the manufacturing process would be the\nbest solution for eliminating the devices with wrong die\nattach layer.\nIn this paper we will present the short time thermal\ntransient measurement method and the structure function\nevaluation through simulations and measurements for die\nattach characterization. We will also present a method for\neliminating the very time consuming calibration process.\nUsing the proposed methods even the in-line testing of LEDs\ncan be accomplished.\n1.\n\nINTRODUCTION\n\nIn case of power switches, LED and stacked die devices\nthe thermal characterisation of the die attach is inevitable to\ndiminish the chance of failure [1][2][3]. Testing each device\nduring the manufacturing process would be the best solution\nfor eliminating the devices with Poor die attach layer [5].\nThermal characterization of packaged devices can be\neasily done by the Structure Function evaluation method [4].\nTo create the structure function of a device we need the\nthermal transient heating or cooling curve of the sample.\nReaching the needed steady states at the beginning and the\nend of the measurement may take minutes or even longer\ntime. The transient measurement also demands sensitivity\ncalibration process for temperature measurement. The time\ninterval of this process is in the range of minutes too.\nUnfortunately in most of the cases the method is too long to\nbe useful for in-line (manufacturing) testing.\nMeasuring the thermal transient for shorter time may be\nusable for establishing the thermal property of the die attach\nas the early section of the transient describes the early section\nof the measured structure. The loss of information about the\nfurther parts of structure is inevitable in this type of\nmeasurement. It was experienced in our simulations and\nmeasurements that the early section of the thermal transient is\nreally affected by the thermal property of the die attach. It\nwas also experienced that the end of the transient is mainly\naffected by the thermal boundary conditions.\n\n©EDA Publishing/THERMINIC 2007\n\n-page-\n\nWe also found that the structure function evaluation\nmethod can give the detailed model of the early section of the\nmeasured structure even though the transient was not\nmeasured between steady states (it was short) [5].\nThe only problem we found a bit astonishing in this type of\nmeasurement is the calibration procedure. In case of in line\ntesting the exact value of the thermal resistance is not\ndemanded. It is enough to establish the difference between\nthe measured sample and a so called \"golden sample\". We\ncould solve this problem using the similarity at the very early\nsection of the transients between different samples from the\nsame type. With this method we found that the needed\nmeasurement time of a device is in some 10ms time range.\n2.\n\nTHERMAL SIMULATIONS\n\nTo check the feasibility of the short time die attach\ncharacterization we simulated a silicon power device with the\ncross sectional view and dimensions of Figure 1. The\nSUNRED thermal simulator was used in this process [6].\nTwo simulations have been evaluated for the temperature\ndistribution by changing the thermal conductivity of the die\nattach, see Figure 2 and Figure 3. In case of Figure 2 the die\nattach layer has low thermal conductivity representing good\nthermal die attach quality. In case of Figure 3 the layer has\npoor conductivity property modelling the presence of voids\nand/or delaminations, wrong thermal die attach quality.\n\nFigure 1. Cross sectional view of the mirror-symmetrical\nmodel, equidistant mesh\n\nISBN: 978-2-35500-002-7\n\n\fPéter Szabó, Márta Rencz\nShort time die attach characterization of semiconductor devices\nIn the simulation process we began heating the structure by\n1W (step-like heating) and captured the temperature\ndistribution. We compared the temperature distribution at 1.2\nms. The simulation in Figure 3 shows larger temperature\nelevation at the top of the chip (heated surface). The larger\ndie attach thermal resistance obstacles the heat.\n\nDie attach\n\napproximately 10ms as the heat spreads again in similar\nstructures: copper case, TIM, copper cold plate.\nFigure 5 shows the structure functions calculated from the\nthermal impedance curves. We can notice that the effect is\nsimilar to the Zth curves at the beginning: the heat spreading\nways are similar up to approximately 0.1K/W. After this\nsection there is a slope up to about 0.3K/W in case of the\ngood, and up to about 0.07K/W in case of the Poor die\nattach. These sections show the heat spreading in the die\nattach layers of the two models. The Poor die attach case\nshows a longer horizontal section meaning larger thermal\nresistance. After this section the structure functions\npractically run parallel similarly to the Zth curves and\nmeaning the heat path is similar.\n\nFigure 2. Cross sectional view of the distribution of the\ntemperature change of the Good die attach model after\n1.2ms at 1W step-like heating, equidistant mesh\nFigure 4. Thermal impedance curves of the Good and\nPoor die attach cases\n\nDie attach\n\nFigure 3. Cross sectional view of the distribution of the\ntemperature change of the Poor die attach model after\n1.2ms at 1W step-like heating, equidistant mesh, larger\ntemperature elevation\nIn Figure 4 we compared the thermal impedance curves\n(Zth) of the monitoring point located in the middle of the\nheated area of the chip (Figure 1). The curves are running\ntogether till 100μs describing the similar heat spreading in\nthe two cases. The chip regions are the same in both cases.\nThe curve of Poor die attach shows larger temperature\nelevation. The curves are running parallel after\n\n©EDA Publishing/THERMINIC 2007\n\n-page-\n\nFigure 5. Enlarged view of the structure functions\ncalculated from the Zth curves of Figure 4\nFor further discussions one important property of the\nstructure function has to be taken into consideration: the\ncharacteristic time constant of any section can be easily\nestablished from the structure function [4]. Eg.: if the thermal\nresistance of the end of the chip section is multiplied by its\nthermal capacitance, then the result is the average time\nconstant of the chip region.\nThe calculation for the simulation gives about 100μs:\n(1)\n\nτchip = Rth*Cth = 0.01K/W*0.01Ws/K = 100μs\n\nISBN: 978-2-35500-002-7\n\n\fPéter Szabó, Márta Rencz\nShort time die attach characterization of semiconductor devices\nThis value is equals to the time value of the beginning of\nthe separation in the Zth curves, see Figure 4.\nThe time needed for the characterisation of the die attach\nis in the range of the time constant of the chip+die attach\nsection:\n(2) τchip+die attach = 0.06K/W*0.02Ws/K = 1.2ms\nIn Figure 4 the difference between the Zth curves can be\nseen well at 1.2ms. The difference shows the different\nthermal die attach quality.\n3.\n\nMEASUREMENTS OF TO-LIKE PAKAGES\n\nWe presented above that both the Zth curve and the\nCumulative structure function are applicable for the\nexamination of the die attach quality. Let us find out how\nmuch time is needed for the short time measurement of the\ndie attach qualities of usual packages of power devices.\nThree TO type packages were measured using the steady\nto steady state thermal transient measurement method. We\ncalculated the structure functions and the necessary time for\nshort time die attach characterization. The three results are\nshown in Figure 6, Figure 7 and Figure 8. Two functions can\nbe seen in each Figure. One has \"No ceramic\" notation, this\nwas calculated from the transient measured in a thermal setup\nin which the device was pressed against the cold plate by its\ncopper case and thermal grease was applied between the\nsurfaces. In the other case the name is \"Ceramic\". In this case\nceramic sheet was placed between the surfaces. As\nconsequence of the different thermal setup the functions are\nalso different. The point where they begin diverging\ncorresponds to the case [7].\n\nFigure 7. TO220, τ ≈ 10mWs/K * 0.1K/W = 1ms\n\nFigure 8. TO218, τ ≈ 50mWs/K* 0.15K/W = 7.5ms\nThe results showed that the characteristic time of the die\nattach is in the ms range in case of these three typical\npackages. 10 ms long thermal transient measurement seems\nto be enough to establish the die attach quality.\n4.\n\nFigure 6. TO252 package, τ ≈ 1mWs/K* 2K/W = 2ms\nOn the left hand side of this point a steep curving section\ncan be found representing the heat spreading in the copper\ncase of the package. The section before this having smaller\nsteepness represents the die attach region. The point where\nthe steepness is changing is the end of the die attach. Its time\nconstant gives the minimal necessary time for the short time\ndie attach measurement\n\n©EDA Publishing/THERMINIC 2007\n\n-page-\n\nELIMINATION OF THE CALIBRATION\nPROCESS\n\nThe steady to steady thermal transient measurement\ndemands several appliances: Thermal transient tester,\nthermostat, control computer, evaluation software [4][7]. The\nmethod is more or less the same for the short time die attach\ncharacterization, so the needed appliances are also the same:\nwe heat up the device electronically for some ms and capture\nthe change of the temperature dependent electrical parameter\n[5].\nIn short time die attach characterization there is an\nadditional problem coming from the unknown sensitivity of\nthe temperature dependent electrical parameter that has to be\nknown for temperature calculation. The temperature sensitive\nparameter can be e.g.: the threshold voltage of diode or the\ngate-source threshold voltage of MOS device. The electron\ndevices show different sensitivities; even they were made by\nthe same fabrication process. For this reason in the short time\ndie attach characterisation devices may show different\nvoltage change not only because of different die attach\n\nISBN: 978-2-35500-002-7\n\n\fPéter Szabó, Márta Rencz\nShort time die attach characterization of semiconductor devices\nquality but also because of the presence of different\nsensitivity values. This effect can be eliminated by using the\nsimilarity of the chip region of the devices of the same type.\nThe thermal properties of the chips are usually very stabile as\nthe thickness and the heat conductivity and capacity values of\nthe single crystal silicon are very similar. So, the measured\nthermal transient curves have to be the same at their\nbeginnings. If the temperature transient caused voltage\ntransient response is different at the early region we can take\nthe assumption that the difference is coming from the\nsensitivity difference. Applying a linear transformation at\neach measured voltage curve we can fit them at their\nbeginnings to one curve measured at a sample having good\ndie attach quality. After the fitting the comparison between\nthe fitted curves can be done by the structure function\nevaluation method.\n5. SHORT TIME DIE ATTACH\nCHARACTERIZATION OF LED SAMPLES\nThe power dissipated in LEDs is growing strongly\nnowadays. Thermal characterisation of each device would be\nthe best even the large number of the devices in the\nmanufacturing process [5].\nTwo LEDs from the same type were investigated; one had\ndie attach problem (Poor die attach), the other was known\ngood (Good die attach) [3]. We carried out thermal transient\nmeasurements on the samples. The devices were placed on\ncold plate. Approximately 0.5 W power excitation was used\nand the emitted optical power was measured too. The Zth\ncurves are running together up to about 1ms describing the\nsimilarity of the chip region, see Figure 9. After the diverging\npoint the divergence holds up to about 4ms and after this\npoint the curves begin running together again.\n\nFigure 10. Cumulative structure functions of the two\nLED samples\nWe calculated the time needed for short time die attach\ncharacterisation of the Poor device:\n(3)\nτchip+die attach = 8K/W*0.5mWs/K =4 ms.\nIt correlates well with the transient results. The 4ms was\nthe time where the curves began to run parallel.\nIn the next step we used a special mode of heating: the\ndevice was driven during 10 ms by the 0.5W and the thermal\ntransient was captured during 50ms immediately after the\nexcitation was switched off. The reason why this driving\nmethod was chosen is the smaller cross-electrical effect at the\nbeginning of the transient after switching of the driving\ncurrent. The other reasons are: the power step is more ideal\nafter the switching off, the sensitivity calibration is easier for\nlater comparison. This measurement is of course different\nfrom the steady to steady state one. Figure 11 shows the\ndifference between the transients of steady to steady state and\nshort type measurements. They are running well together up\nto 4ms. This type of short time driving is applicable for\nestablishing differences in the die attach layer.\nAt the early sections of the short Zth curves of the Poor and\nGood devices are very similar. They show the difference at\n4ms well.\n\nFigure 9. Steady to steady state Zth curves of the two\nLED samples having Good and Poor die attach layers\nFor better identification of the die attach regions we\ncalculated the cumulative structure functions from the Zth\ncurves. The difference presents in the die attach layer too,\nsee Figure 10. 3K/W is the thermal resistance of the die\nattach of the Good device and 6K/W of the Poor device.\n\n©EDA Publishing/THERMINIC 2007\n\n-page-\n\nFigure 11. Comparison of the Zth curves of the steady to\nsteady state and short time transient measurements\nWe calculated the structure functions from the short time\ntransients to examine the effect of the length of the thermal\n\nISBN: 978-2-35500-002-7\n\n\fPéter Szabó, Márta Rencz\nShort time die attach characterization of semiconductor devices\ntransient measurement to the die attach region, see\nFigure 12. The structure functions calculated from the short\ntime transient measurements are also applicable to establish\nthe thermal resistances and capacitances of the early regions.\n\n1\n\n2\n3\n\nFigure 14. Zth curves with good sensitivity\nFigure 12. Cumulative structure functions calculated\nfrom the steady to steady and short time measurements\nWe have measured large number of LEDs from the same\ntype in the same way. The temperature change transients\ncaused threshold voltage change transients can be seen in\nFigure 13. The curves show large variation at their ends. The\ncurves also show large variation at their beginnings from\n10μs to 1ms that corresponds to the chip region. From these\nmeasurements we can not draw any conclusions in this form.\n\n1\n\nThese measurements proved that the difference at the\nbeginnings is coming form the different sensitivity values.\nIn the next step we calculated the structure functions of the\nthree typical curves of Figure 14 (1, 2, and 3) using same\nsensitivity, see Figure 15. The difference at their beginnings\ncan be experienced well. We calculated the structure\nfunctions from the thermal transient curves using the\nsensitivities from the calibration process, see Figure 16. The\ngood fit at their beginning can be seen well. We choose two\npoints (crosses sign) in this region for linear fitting. The three\nstructure functions of Figure 15 were fitted to these two\npoints. The result, the fitted structure functions can be seen in\nFigure 17.\n\n3\n\n2\n\n2\n\n1\n\n3\n\nFigure 13. Thershold voltage change of LEDs from the\nsame type after 10ms driving\nIn order to find out the origin of the variations, we\nmeasured the sensitivities of the devices and calculated the\nthermal impedance curves, see Figure 14. They are\npractically similar at their beginnings. The good fitting\n(similarity) at the beginnings is coming from the similarity of\nthe chip regions of the LEDs.\n\n©EDA Publishing/THERMINIC 2007\n\n-page-\n\nFigure 15. Structure functions of the three characteristic\nsamples (1,2,3) calculated from the thermal impedance\ncurves using same sensitivity\nThe fitting method gives good results as the beginning of\nthe fitted curves are nearly the same and the order of the ends\nare similar to the ends of the structure functions calculated\nwith good sensitivities. Devices having die attach problems\ncan be dropped out by reading the thermal resistance at a\ngiven thermal capacitance, now e.g. at 1 Ws/K, and\ncomparing to the desired thermal resistance.\n\nISBN: 978-2-35500-002-7\n\n\fPéter Szabó, Márta Rencz\nShort time die attach characterization of semiconductor devices\n7.\n\n2\n\n3\n\nFigure 16. Structure functions of the three characteristic\nsamples calculated from the thermal transient curves\nwith good sensitivities, two points at the early section for\nlinear fitting\n\n3\n\n2\n\n1\n\nFigure 17. Structure functions of the three characteristic\nsamples fitted to the two points at the early section\n6.\n\nREFERENCES\n\n1\n[1]\n\nM. Rencz, V. Székely, B .Courtois, L. Zhang, N. Howard, L.\nNguyen: \"Die attach quality control of 3D stacked dies\",\nProceeding of the IEMT Symposium of SEMICON West,\nSan Jose, Jul 12-16, CA, USA, 2004, Proceedings pp 78-84.\n\n[2]\n\nLi Zhang, Noella Howard, Vijaylaxmi Gumaste, Amindya\nPoddar, Luu Nguyen: \"Thermal Characterization of StackedDie Packages\", 20th IEEE SEMI-THERM Symposium, pp.\n55-63\n\n[3]\n\nG. Farkas, Q. van Voorst Vader, A. Poppe, Gy. Bognár\n\"Thermal investigation of high power optical devices by\ntransient testing\", Proc. of the 9th THERMINIC, Aix-enProvence, France, Sep 2003\n\n[4]\n\nV. Szekely and Tran Van Bien: \"Fine structure of heat flow\npath in semiconductor devices: a measurement and\nidentification method\", Solid-State Electronics, V.31, pp.\n1363-1368 (1988)\n\n[5]\n\nPéter Szabó, Márta Rencz, Gábor Farkas, András Poppe:\n\"Short time die attach characterization of LEDs for in-line\ntesting application\", Electornics Packaging Technologies\nConference, Singapore, 6-8 December 2006\n\n[6]\n\nV. Székely, A. Páhi, M. Rosenthal, M. Rencz: \"SUNRED: a\nfield solver and compact model generator tool based on\nsuccessive mode reduction\", MSM'99, April 19-21, 1999,\nSan Juan, Puerto Rico, USA, pp. 342-345\n\n[7]\n\nO. Steffens, P. Szabo, M. Lenz, G. Farkas: \"Junction to case\ncharacterization methodology for single and multiple chip\nstructures based on thermal transient measurements\",\nProceedings of the XXIth SEMI-THERM Symposium, San\nJose, CA, USA, 14-16 March 2005.\n\nCONCLUSIONS\n\nIn this paper we presented our investigations on how much\ntime is needed for the thermal transient measurements to\nachieve short time die attach characterization to enable inline die attach testing. We examined the question with\nsimulations, calculations and measurements. It was\ndemonstrated that decision about the die attach quality can be\nmade within some 10ms.\nTo achieve such short measurements we have to eliminate\nthe need of the individual calibration of the temperature\nsensitive element, in most cases the diode. We showed how\nthe calibration of the temperature dependent parameter of\neach device can be replaced by applying a linear fitting\nmethod in the early range of the measured results.\nUsing this method the die attach characterisation may\nbecome extremely fast. With these investigations it is proven\nthat the structure function based die attach qualification\nmethod is applicable for measuring die attach differences\nbetween samples from the same type in the fabrication\nprocess in some 10ms time interval.\n\n©EDA Publishing/THERMINIC 2007\n\n-page-\n\nISBN: 978-2-35500-002-7\n\n\f"}