{"id": "http://arxiv.org/abs/0802.3387v1", "guidislink": true, "updated": "2008-02-22T21:21:58Z", "updated_parsed": [2008, 2, 22, 21, 21, 58, 4, 53, 0], "published": "2008-02-22T21:21:58Z", "published_parsed": [2008, 2, 22, 21, 21, 58, 4, 53, 0], "title": "An alternative method to study star cluster disruption", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.0506%2C0802.1500%2C0802.0596%2C0802.3307%2C0802.3217%2C0802.2546%2C0802.0783%2C0802.1058%2C0802.1994%2C0802.2612%2C0802.4086%2C0802.3387%2C0802.1793%2C0802.4371%2C0802.3589%2C0802.3199%2C0802.1963%2C0802.2267%2C0802.1492%2C0802.0826%2C0802.2295%2C0802.1006%2C0802.0146%2C0802.3054%2C0802.3587%2C0802.4379%2C0802.2639%2C0802.3096%2C0802.0852%2C0802.1512%2C0802.1164%2C0802.2885%2C0802.0890%2C0802.2137%2C0802.2719%2C0802.2126%2C0802.2226%2C0802.0679%2C0802.0701%2C0802.3324%2C0802.2614%2C0802.3523%2C0802.1377%2C0802.1865%2C0802.0112%2C0802.2665%2C0802.3338%2C0802.3796%2C0802.0518%2C0802.3841%2C0802.3822%2C0802.0833%2C0802.3251%2C0802.0901%2C0802.3325%2C0802.1353%2C0802.0477%2C0802.3954%2C0802.3947%2C0802.0516%2C0802.3927%2C0802.4013%2C0802.4455%2C0802.3595%2C0802.3344%2C0802.3023%2C0802.1576%2C0802.0486%2C0802.1467%2C0802.1887%2C0802.3416%2C0802.3569%2C0802.1893%2C0802.0453%2C0802.0054%2C0802.3211%2C0802.0603%2C0802.2237%2C0802.2013%2C0802.3756%2C0802.2953%2C0802.1682%2C0802.4421%2C0802.2799%2C0802.0090%2C0802.0457%2C0802.3399%2C0802.0787%2C0802.1146%2C0802.2929%2C0802.3302%2C0802.3185%2C0802.1101%2C0802.4219%2C0802.2528%2C0802.0762%2C0802.3315%2C0802.3323%2C0802.2157%2C0802.4081%2C0802.1711&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An alternative method to study star cluster disruption"}, "summary": "Many embedded star clusters do not evolve into long-lived bound clusters. The\nmost popular explanation for this \"infant mortality\" of young clusters is the\nexpulsion of natal gas by stellar winds and supernovae, which leaves up to 90%\nof them unbound. A cluster disruption model has recently been proposed in which\nthis mass- independent disruption of clusters proceeds for another Gyr after\ngas expulsion. In this scenario, the survival chances of massive clusters are\nmuch smaller than in the traditional mass-dependent disruption models. The most\ncommon way to study cluster disruption is to use the cluster age distribution,\nwhich, however, can be heavily affected by incompleteness. To avoid this, we\nintroduce a new method, based on size-of-sample effects, namely the relation\nbetween the most massive cluster, M_max, and the age range sampled. Assuming\nthat clusters are sampled from a power-law initial mass function, with index -2\nand that the cluster formation rate is constant, M_max scales with the age\nrange sampled, such that the slope in a log(M_max) vs. log(age) plot is equal\nto unity. This slope decreases if mass-independent disruption is included. For\n90% mass-independent cluster disruption per age dex, the predicted slope is\nzero. For the solar neighbourhood, SMC, LMC, M33, and M83, based on ages and\nmasses taken from the literature, we find slopes consistent with the expected\nsize-of-sample correlations for the first 100 Myr, hence ruling out the 90%\nmass-independent cluster disruption scenario. For M51, however, the increase of\nlog(M_max) with log(age) is slightly shallower and for the Antennae galaxies it\nis flat. This simple method shows that the formation and/or disruption of\nclusters in the Antennae must have been very different from that of the other\ngalaxies studied here, so it should not be taken as a representative case.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.0506%2C0802.1500%2C0802.0596%2C0802.3307%2C0802.3217%2C0802.2546%2C0802.0783%2C0802.1058%2C0802.1994%2C0802.2612%2C0802.4086%2C0802.3387%2C0802.1793%2C0802.4371%2C0802.3589%2C0802.3199%2C0802.1963%2C0802.2267%2C0802.1492%2C0802.0826%2C0802.2295%2C0802.1006%2C0802.0146%2C0802.3054%2C0802.3587%2C0802.4379%2C0802.2639%2C0802.3096%2C0802.0852%2C0802.1512%2C0802.1164%2C0802.2885%2C0802.0890%2C0802.2137%2C0802.2719%2C0802.2126%2C0802.2226%2C0802.0679%2C0802.0701%2C0802.3324%2C0802.2614%2C0802.3523%2C0802.1377%2C0802.1865%2C0802.0112%2C0802.2665%2C0802.3338%2C0802.3796%2C0802.0518%2C0802.3841%2C0802.3822%2C0802.0833%2C0802.3251%2C0802.0901%2C0802.3325%2C0802.1353%2C0802.0477%2C0802.3954%2C0802.3947%2C0802.0516%2C0802.3927%2C0802.4013%2C0802.4455%2C0802.3595%2C0802.3344%2C0802.3023%2C0802.1576%2C0802.0486%2C0802.1467%2C0802.1887%2C0802.3416%2C0802.3569%2C0802.1893%2C0802.0453%2C0802.0054%2C0802.3211%2C0802.0603%2C0802.2237%2C0802.2013%2C0802.3756%2C0802.2953%2C0802.1682%2C0802.4421%2C0802.2799%2C0802.0090%2C0802.0457%2C0802.3399%2C0802.0787%2C0802.1146%2C0802.2929%2C0802.3302%2C0802.3185%2C0802.1101%2C0802.4219%2C0802.2528%2C0802.0762%2C0802.3315%2C0802.3323%2C0802.2157%2C0802.4081%2C0802.1711&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Many embedded star clusters do not evolve into long-lived bound clusters. The\nmost popular explanation for this \"infant mortality\" of young clusters is the\nexpulsion of natal gas by stellar winds and supernovae, which leaves up to 90%\nof them unbound. A cluster disruption model has recently been proposed in which\nthis mass- independent disruption of clusters proceeds for another Gyr after\ngas expulsion. In this scenario, the survival chances of massive clusters are\nmuch smaller than in the traditional mass-dependent disruption models. The most\ncommon way to study cluster disruption is to use the cluster age distribution,\nwhich, however, can be heavily affected by incompleteness. To avoid this, we\nintroduce a new method, based on size-of-sample effects, namely the relation\nbetween the most massive cluster, M_max, and the age range sampled. Assuming\nthat clusters are sampled from a power-law initial mass function, with index -2\nand that the cluster formation rate is constant, M_max scales with the age\nrange sampled, such that the slope in a log(M_max) vs. log(age) plot is equal\nto unity. This slope decreases if mass-independent disruption is included. For\n90% mass-independent cluster disruption per age dex, the predicted slope is\nzero. For the solar neighbourhood, SMC, LMC, M33, and M83, based on ages and\nmasses taken from the literature, we find slopes consistent with the expected\nsize-of-sample correlations for the first 100 Myr, hence ruling out the 90%\nmass-independent cluster disruption scenario. For M51, however, the increase of\nlog(M_max) with log(age) is slightly shallower and for the Antennae galaxies it\nis flat. This simple method shows that the formation and/or disruption of\nclusters in the Antennae must have been very different from that of the other\ngalaxies studied here, so it should not be taken as a representative case."}, "authors": ["Mark Gieles", "Nate Bastian"], "author_detail": {"name": "Nate Bastian"}, "author": "Nate Bastian", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20078909", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.3387v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.3387v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 2 figures, accepted by A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.3387v1", "affiliation": "UCL London", "arxiv_url": "http://arxiv.org/abs/0802.3387v1", "journal_reference": null, "doi": "10.1051/0004-6361:20078909", "fulltext": "Astronomy & Astrophysics manuscript no. lma\n(DOI: will be inserted by hand later)\n\nNovember 8, 2018\n\narXiv:0802.3387v1 [astro-ph] 22 Feb 2008\n\nAn alternative method to study star cluster disruption\nM. Gieles1 and N. Bastian2\n1\n\n2\n\nEuropean Southern Observatory, Casilla 19001, Santiago 19, Chile\ne-mail: mgieles@eso.org\nDepartment of Physics and Astronomy, University College London, Gower Street, London WC1E 6BT\ne-mail: bastian@star.ucl.ac.uk\n\nReceived October 23, 2007; February 16, 2008\nAbstract. Many embedded star clusters do not evolve into long-lived bound clusters. The most popular explanation for this\n\n\"infant mortality\" of young (few Myrs) clusters is the expulsion of natal gas by stellar winds and supernovae, which perturbs\nthe clusters' potential and leaves up to 90% of them unbound. A cluster disruption model has recently been proposed in which\nthis mass-independent disruption of clusters proceeds for another Gyr after gas expulsion. In this scenario, the survival chances\nof massive clusters are much smaller than in the traditional mass-dependent disruption models. The most common way to\nstudy cluster disruption is to use the cluster age distribution, which, however, can be heavily affected by incompleteness. To\navoid this pitfall we introduce a new method of studying cluster disruption based on size-of-sample effects, namely the relation\nbetween the most massive cluster, Mmax , and the age range sampled. Assuming that clusters are stochastically sampled from a\npower-law cluster initial mass function, with index −2 and that the cluster formation rate is constant, Mmax scales with the age\nrange sampled, such that the slope in a log(Mmax ) vs. log(age) plot is equal to unity. This slope decreases if mass-independent\ndisruption is included. For 90% mass-independent cluster disruption per age dex, the predicted slope is zero. For the solar\nneighbourhood, SMC, LMC, M33, and M83, based on ages and masses taken from the literature, we find slopes consistent with\nthe expected size-of-sample correlations for the first 100 Myr, hence ruling out the 90% mass-independent cluster disruption\nscenario. For M51, however, the increase of log(Mmax ) with log(age) is slightly shallower and for the Antennae galaxies it is\nflat. This simple method shows that the formation and/or disruption of clusters in the Antennae must have been very different\nfrom that of the other galaxies studied here, so it should not be taken as a representative case.\nKey words. galaxies: star cluster – galaxies: evolution\n\n1. Introduction\nIn this study we propose an alternative method of studying the\nnature of cluster disruption, by using only a small number of\nmassive clusters and a few simple assumptions. This study is\nmotivated by the recent debate on the duration of the \"infant\nmortality\" phase of clusters.\nThe term infant mortality was coined by Lada &\nLada (2003, LL03), who noticed from a comparison of the\nnumber of embedded clusters per unit time (dN/dt) to the\ndN/dt of optically detected clusters in the solar neighbourhood, that up to 90% of the embedded clusters do not survive the gas expulsion phase. This rapid expulsion of gas is\ndriven by stellar winds, ionisation and supernovae of early type\nstars. Due to the expanding gas shells the binding energy of\nthe initial system of stars and gas is reduced and the stars that\nhave remained in place (assuming instantaneous gas expulsion)\nsuddenly have velocities higher than the local escape velocity\n(Tutukov 1978; Hills 1980; Lada et al. 1984; Goodwin 1997;\nGeyer & Burkert 2001; Kroupa 2005). Under the assumption\nSend offprint requests to: mgieles@eso.org\n\nof a constant, or mass-independent, star formation efficiency,\nthe fraction of clusters that becomes unbound (infant mortality rate), or the fraction of mass lost from each cluster (\"infant\nweight loss\") is independent of the mass of the embedded cluster. Theory predicts that the effects of gas expulsion should be\nlargely over within 20 Myr (Goodwin & Bastian 2006).\nMore recently, the infant mortality scenario has also been\nused to explain the steep drop in dN/dt around ∼ 10 − 20 Myr\nof clusters in M51. Around 70% of the clusters in M51 do\nnot survive past 20 Myr, roughly independent of cluster mass\n(Bastian et al. 2005; Gieles et al. 2005). It is noteworthy that\nthe study of M51 clusters was based on optically detected clusters only, while the study of the solar neighbourhood (LL03)\nused a comparison between young embedded and older optically visible clusters to determine the infant mortality fraction.\nThe dN/dt distribution of optically detected clusters in the solar\nneighbourhood is nearly flat for ages . 100 Myr1 (Lamers et al.\n2005a), i.e. very different than that of the M51 clusters.\n1\n\nFor a sample limited to clusters within 600 pc from the sun and\nwith masses > 100 M⊙ . When plotting dN/dt of all clusters, as in\nWhitmore et al. (2007), it declines due to incompleteness effects.\n\n\f2\n\nM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\nFall et al. (2005) find that the dN/dt distribution of a\nmass limited cluster sample of the Antennae galaxies declines\nroughly as t−1 up to ∼ 1 Gyr. They explain this decline by\ninfant mortality, removing 90% each age dex independent of\ncluster mass over the full age range of the dN/dt distribution.\nSince this time-scale is two orders of magnitudes longer than\nthe time-scale involved in the original definition of infant mortality by LL03, we will refer to this disruption model as \"massindependent dissolution\" (MID).\nBased on the Magellanic Cloud Photometric Survey,\nRafelski & Zaritsky (2005) presented a set of structural parameters of clusters in the Small Magellanic Cloud (SMC). Their\nversion of the dN/dt distribution was declining and this was interpreted by Chandar et al. (2006) as MID removing the same\nfraction (90%) of clusters each age dex as in the Antennae during the first 1 Gyr.\nThe interpretation of Chandar et al. (2006) is surprising\nfor two reasons: a) it is in disagreement with earlier studies on the dN/dt distribution of SMC clusters, who found a\nflat dN/dt up to ∼ 1 Gyr (Hodge 1987; Chiosi et al. 2006)\nand b) they are the first to suggest a disruption scenario in\nwhich the life-time of star clusters during the first Gyr does\nnot depend on their mass or local environment. This contradicts the existing theoretical understanding of cluster disruption. Clusters in the SMC should survive much longer\nthan clusters with similar masses in the Antennae galaxies, due to the much lower tidal field strength and molecular cloud density in the SMC (e.g. Spitzer 1958; Wielen\n1988; Vesperini & Heggie 1997; Baumgardt & Makino 2003;\nGieles et al. 2006c). From comparisons between the age and\nmass distributions of clusters in different galaxies this scenario is also supported by observations (e.g. Elson & Fall\n1985; Hodge 1987; Boutloukos & Lamers 2003; Lamers et al.\n2005b). The decline of the dN/dt distribution of SMC clusters\nreported by Chandar et al. (2006) is most probably the result\nof detection incompleteness since they derive the slope of the\ndN/dt distribution from a fit to the full cluster sample, without\nmaking a mass cut. Gieles et al. (2007) showed that a mass limited sub-sample has a flat dN/dt up to 1 Gyr. This is because at\nolder ages clusters are intrinsically fainter, causing the number\nof observed clusters in the full (luminosity limited) sample to\ndrop with increasing age.\nThe interpretation of results based on dN/dt distributions\nwill always be heavily dependent on how incompleteness is determined or corrected for. To remedy these shortcomings we\nhave developed a method that can serve as an independent\ncheck of the universal MID scenario proposed by Fall et al.\n(2005), Chandar et al. (2006) and Whitmore et al. (2007) and\nthe traditional disruption scenario in which the disruption time\ndepends on mass.\nOur new method is based on a few very elementary assumptions and needs only a handful of massive clusters at various ages, i.e. well above the detection limit, avoiding problems with incompleteness of faint clusters at old ages. An additional advantage of our method is that age dating of massive\nclusters is more accurate than for clusters with lower masses\nsince the stellar IMF is well populated, so stochastic fluctuations in the cluster colours due to IMF sampling are small. The\n\nmethod is similar, but under different assumptions, to that used\nby Maschberger & Kroupa (2007) who used the most massive\ncluster as a function age to derive the star formation history of\ngalaxies. It is fundamentally similar to the study of Hunter et al.\n(2003) who used the most massive cluster per logarithmic age\nbin to constrain the initial mass function of clusters.\nUsing the size-of-sample effect of cluster populations, in\nparticular the most massive cluster per logarithmic time interval, we will address the following points in this paper:\n– Is cluster disruption independent of cluster mass and environment?\n– How does the observed relation between the most cluster\nfound and the linear time interval probed depend on cluster\ndisruption and the cluster formation history of the galaxy?\n– What is the relative fraction of stellar mass in bound and\nlong lived (& 10 Myr) clusters?\nThe proposed method is meant to compliment, and provide\nan independent check, of existing methods, which are normally\nbased on the observed age distribution of full cluster populations.\nIn § 2 we present the statistical considerations of the sizeof-sample effect and compare the expected behavior to observed cluster populations in § 3. A discussion and our conclusions are presented in § 4 and § 5, respectively.\n\n2. The maximum cluster mass from statistical\nconsiderations: size-of-sample effect\n\n2.1. The mass of the most massive cluster\nWe assume that masses of clusters follow from random sampling of a power-law cluster initial mass function (CIMF):\nφ(M) =\n\ndN\n= A M −α ,\ndM\n\n(1)\n\nwith α ≃ 2 (Zhang & Fall 1999; Bik et al. 2003; Whitmore\n2003; de Grijs et al. 2003; Gieles et al. 2006a).\nFor α ≤ 2 the total mass diverges to infinity when integrating to infinity, so a maximum mass has to be chosen, which can\nbe interpreted as a physical maximum above which no clusters\ncan exist. We will refer to this mass as Mup (i.e. the upper limit)\nand to the most massive cluster observed, i.e. the most massive\ncluster actually formed, as Mmax .\nThe value of Mmax depends on the constant A in Eq. 1 and\ncan be found by integrating φ(M) from Mmax to Mup and setting\nthis equal to 1. For α > 1 and Mup >> Mmax , which is probably\nα−1\ntrue for most galaxies, this results in A = (α − 1) Mmax\n. For\nα = 2 this reduces to A = Mmax . The relation between Mup\nand Mmax depends on the number of clusters formed (N) which\nis proportional to A. The larger N, the closer the statistically\nprobable Mmax will be to Mup . We can relate Mmax to N as\n\nN =\n\nZ Mup\n\nA M −α dM\n\nMmin\nα−1\nMmax\n≃\n,α > 1\nM α−1\n\n(2)\n(3)\n\n\fM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\n≃\n\nMmax\n, α = 2,\nMmin\n\n3\n\n(4)\n\nwhere in the last steps we again assumed Mup /Mmax >> 1. For\na constant Mmin we see from Eq. 3 that Mmax scales with N as\nMmax ∝ N 1/(α−1) .\n\n(5)\n\nThe scaling of Mmax with N for clusters (Eq. 5) is analogous\nto what Oey & Clarke (2005) found for stars. Assuming a constant cluster formation rate (CFR), dN/dt=constant, the number of clusters in each equal logarithmic time interval, Nbin ,\nincreases linearly with age, since\nNbin ∝\n\ndN\ndN\n=t\nd ln(t)\ndt\n\n(6)\n\nand so Nbin (t) ∝ t. The same holds for dN/d log(t) apart from\nan additional constant ln(10). Therefore Mmax in logarithmic\nage bins scales as\n1/(α−1)\nMmax ∝ Nbin\n∝ t1/(α−1) .\n\n(7)\n\nThe above derivation was based on a constant CFR and no disruption. Hunter et al. (2003) already noticed that a power-law\nrelation for the CFR with age (CFR∝ tη , with η negative for a\nCFR that was lower in the past) would change the relation for\nMmax to\nMmax ∝ t(1+η)/(α−1) .\n\nFig. 1. Predicted slopes for log(Mmax ) vs. log(age) for different\nMID fractions ( fMID ) and three different indices of the CIMF\n(α) (Eq. 11).\n\nof the form dN/dt ∝ tλ , with λ = log(1 − fMID ), which is t−1\nfor fMID = 0.9. For fMID =0, 0.5 and 0.8 we find λ = 0, −0.3 and\n−0.7, in agreement with the values quoted by Whitmore et al.\n(2007). From this relation for dN/dt and Eq. 6 we find that the\nnumber of clusters per logarithmic age bin, Nbin , depends on\nfMID as\n\n(8)\n\nThe scaling of Mmax with age appears since Nbin increases\nin equal sized logarithim age bins. Our assumptions are fundamentally different from those of Maschberger & Kroupa\n(2007), since in their model Mmax is set by the star formation\nrate and a time-scale of formation of an entire cluster population of 10 Myr. Though they do randomly sample Mmax from\na probability density function, allowing some influence of the\nsize of the sample, they on average predict a constant Mmax\nin logarithmic age bins for a constant CFR, rather than the increase predicted by Eq. 7. Also, they assume a cluster disruption law and solve for the cluster formation history. We, on the\nother hand, take the cluster formation rate as constant and test\na theory of cluster disruption.\nFor the moment we consider the simplified scenario of a\nconstant CFR and no mass-dependent disruption (Eq. 7). In the\nnext section (§ 2.2) we will add the MID scenario to this. In\n§ 4 we discuss the effects of mass-dependent disruption and\nvariations in the cluster formation history.\n\n2.2. The effect of mass-independent dissolution on\nMmax\nWe consider the scenario proposed by Fall et al. (2005),\nChandar et al. (2006) and Whitmore et al. (2007), in which\neach age dex a fixed fraction of the number of clusters gets destroyed, independent of the cluster mass. We refer to this fraction as fMID . They argue that 90% of the clusters are destroyed\neach age dex, so fMID = 0.9. This reduction in number results\nin an expression for the remaining clusters as a function of time\n\nNbin ∝\n\ndN\n∝ t1+log(1− fMID ) .\nd log(t)\n\n(9)\n\nWe now substitute this expression in Eq. 5 for N to find the\ntrend of Mmax with age when MID is included:\n\nMmax ∝ t(1+log(1− fMID ))/(α−1) ,\n\n(10)\n\nwhich gives the result as in Eq. 8 for no disruption ( fMID =\n0) and a constant CFR (η = 0). From a comparison between\nEq. 8 and Eq. 10 it is directly visible that there is a degeneracy\nbetween a CFR that has been increasing (η < 0) and MID.\nMID reduces the number of clusters with increasing age. Due\nto the mass-independent nature of this disruption model, it is\nimpossible to distinguish between an increasing CFR and MID.\nIn a plot of log(Mmax ) vs. log(age) we thus expect a slope\n1 + log(1 − fMID )\nα−1\n= +1\n= 0\n\nslope =\n\n(11)\nfor fMID = 0, α = 2,\nfor fMID = 0.9 and all α.\n\n(12)\n(13)\n\nIn Fig. 1 we show the predicted slopes following from\nEq. 11 for three different values for α. For the universal fMID =\n0.9 scenario, which was proposed by Whitmore et al. (2007),\nthe predicted slope is 0 for all values of α. For lower values\nof fMID , we expect noticeably different slopes than +1, providing an independent strong constraint of the acceptable values\nof fMID .\n\n\f4\n\nM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\n3. Comparison to the observations\n\n3.1. Description of the data used\nWe collect cluster ages and masses in seven different galaxies from the literature: the Milky Way (solar neighbourhood),\nSMC, LMC, M33, M83, M51 and the Antennae galaxies. Here\nwe briefly mention the origin of the data and we refer the reader\nto these papers for details on the data reduction and age fitting\ntechniques.\nFor the clusters in the solar neighbourhood we use ages\nfrom the catalogue of Kharchenko et al. (2005) and corresponding masses derived and kindly provided to us by\nLamers et al. (2005a). The mass estimates are derived from the\nnumber of stars with high membership probability and an extrapolation of the stellar initial mass function. We limit ourselves to the 209 clusters in the catalogue that are within a distance of 1 kpc from the sun, for which the mass estimates are\nbelieved to be accurate and the sample is not severely affected\nby distance incompleteness.\nFor the SMC and the LMC we use the results of\nHunter et al. (2003), who kindly provided us with a table\nof ages and luminosities of 191 SMC clusters and 748\nLMC clusters. We derived the masses of the clusters using\nthe age-dependent mass-to-light ratios of the GALEV models (Schulz et al. 2002; Anders & Fritze-v. Alvensleben 2003)\nwith Z = 0.004 for the SMC and Z = 0.008 for the LMC.\nFor NGC 5236 (M83) we used the ages and masses derived by Mora et al. (2008, in prep), who kindly provided\nus with a table containing ages and masses of 219 clusters.\nFor M33 we used a recent catalogue of 201 clusters published by Sarajedini & Mancone (2007). The M51 data were\ntaken from Bastian et al. (2005). We derive the ages and masses\nof Antennae clusters from Fig. 2 of Zhang & Fall (1999),\nand converted luminosities to masses using the Bruzual &\nCharlot (1996, unpublished) SSP models, which were used by\nZhang & Fall (1999) to derive the ages.\n\nconsistent with the size of sample prediction without disruption (Eqs. 7&12). The slopes are not exactly +1, but we can\nconstrain fMID using Eq. 11 to fMID < 0.2 for the solar neighbourhood, SMC and LMC and fMID < 0.4 for M33 and M83.\nThis rules out the long term 90% ( fMID = 0.9) MID proposed by\nWhitmore et al. (2007) as a universal cluster disruption mechanism for these galaxies. For this to be true, Mmax had to be\nconstant with log(age) (Eq. 13) for all galaxies.\nThe trends for M51 and the Antennae are clearly different\nfrom the other five galaxies. The slow or lack of increase of\nlog(Mmax ) for M51 in the first ∼ 10 − 20 Myr is consistent with\nthe 70% infant mortality, independent of mass, over that time\nrange as determined by Bastian et al. (2005). After log(age)=7\nthe value of Mmax is increasing again, confirming that the infant mortality phase lasts for about 10 Myr only. The flat slope\nbeyond 100 Myr in M51 was interpreted as a truncation of the\nCIMF around Mup ≃ 5 × 105 M⊙ (Gieles et al. 2006a,b). Note\nthat these three phases can not be derived from the trend of\nMmax with log(age) only, since we have only five data points.\nThe trend does support the results derived from the dN/dt distribution and the luminosity function by Bastian et al. (2005)\nand Gieles et al. (2006a,b)\nThe flat relation for the Antennae galaxies is consistent with\n90% disruption each age dex ( fMID =0.9) during a Gyr. Note,\nhowever, that if this result is attributed entirely to fMID =0.9\n(Whitmore et al. 2007), which implies that there is no truncation of the CIMF and that the CFR has been constant over\nthis age range, which was proposed by Whitmore et al. (2007),\nthen based on size-of-sample effects we would expect that the\ngalaxy was producing clusters with masses up to 109 M⊙ in the\noldest log(age) bin, but they have been destroyed due to MID.\nThis seems unlikely given what we know about other galactic mergers. Namely, the major burst of star formation in the\nAntennae still has to happen,which will be when the nuclei coalesce (e.g. Cox et al. 2006) and there are no star cluster known\nwith masses in excess of 108 M⊙ .\n\n3.2. Observed trends of log(Mmax ) vs. log(age)\n\n3.3. Deriving the formation rate in bound clusters\n\nIn Fig. 2 we show Mmax as a function of log(age) in bins of 0.5\ndex as open circles. We also show the third most massive cluster in each age bin (Mmax,3rd ) as filled circles, which is expected\nto follow the same relations as the most massive, though with\nless scatter. We note that the trends for the second, fourth and\nfifth most massive cluster are all similar to the trend of Mmax,3rd .\nThe full lines represent the result of fits of log(Mmax,3rd ) with\nlog(age) over the first 100 Myr and the dashed lines consider\na time range of 3 Gyr. The scatter of the data points around\nthe fit is most likely due to stochastic effects and should not\nbe interpreted as variations in the CFR. The probability density\nfunction (PDF) of the most massive object drawn from a powerlaw distribution has an asymmetric spread around the mean, but\nin logarithmic units the shape and width PDF is independent\nof the value of Mmax (Larsen 2002; Maschberger & Kroupa\n2007). Stochastic effects will therefore not affect our results.\nFor the solar neighbourhood, SMC, LMC, M33 and M83\nthe observed increase of log(Mmax,3rd ) in the first 100 Myr is\n\nUnder the assumption of a constant formation rate, a power-law\nCIMF with index −2 and no disruption of clusters, the values\nof Mmax are indicative of the amount of stellar mass formed in\nbound clusters. Here we will use the SMC as an example, since\nit has been shown that for the clusters in this galaxy the disruption time-scale is long (Hodge 1987; Boutloukos & Lamers\n2003; Gieles et al. 2007). In addition, this is one of the only\ngalaxies for which a global star formation rate (SFR) has been\ndetermined and the full galaxy has been imaged for its cluster\npopulation. This is necessary since Mmax scales with the total\nnumber of observed clusters and therefore with the fraction of\nthe galaxy that has been imaged.\nFor α = 2 the total mass formed in clusters, Mtot , can be\nfound from\n\nMtot =\n\nZ Mup\nM\n\nM φ(M) dM\n\n(14)\n\n\fM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\n5\n\nFig. 2. Evolution of Mmax with equal size log(age) bins for the seven galaxies in our sample (open circles). The third most massive\nclusters (Mmax,3rd ) in each bin are shown as filled circles. Fits to log(Mmax,3rd ) vs. log(age) on two different age ranges are shown\nas dashed and full lines.\nMup\n≃ Mmax ln\nMmin\n≃ 10 Mmax ,\n\n!\n\n(15)\n(16)\n\nwhere we again assume Mup >> Mmax and Mup /Mmin = 105 ,\ne.g. Mmin = 102 M⊙ and Mup = 107 M⊙ . For α = 2 the predicted\nMmax,3rd is simply one third of Mmax .\nWhen representing the data as in Fig. 2, we need to assume\na CFR, i.e. the amount of mass formed in bound clusters per\nunit of time. With this and the width of the age bins we can\ncalculate Mtot =CFR×∆t. We find good agreement between the\nSMC data in Fig. 2 and a prediction for Mmax and Mmax,3rd with\nCFR≃ 2 × 10−3 M⊙ yr−1 . Due to the scatter in the data this is\nonly a rough prediction, accurate to within a factor of two.\nWe can compare the prediction of the CFR to the star formation rate (SFR). Harris & Zaritsky (2004) derive a mean\nglobal star formation rate of 0.1 M⊙ yr−1 based on the field star\npopulation and Wilke et al. (2004) derive SFR=0.05 M⊙ yr−1\nbased on far-infrared observations of the SMC. Our derived\nCFR of 2 × 10−3 M⊙ yr−1 represents only 2 − 4 % of the total\nSFR. This implies that ∼97% of the star formation occurs in a\ndispersed fashion, or, that the infant mortality rate in the SMC\nis close to 97%. This data does not allow to tell these two scenarios apart.\nFor the solar neighbourhood, a similar ratio of CFR/SFR≃\n0.05 was found (Lamers & Gieles 2006, 2007) from a comparison of the star formation rate in (optical detected) clusters relative to the star formation in field stars, consistent with the infant\nmortality rate derived by LL03.\n\n4. Discussion\n\n4.1. Is there no infant mortality of clusters in some\ngalaxies?\nWe conclude that the slopes for the first 100 Myr in the solar\nneighbourhood, SMC, LMC, M33 and M83 are consistent with\na complete lack of mass-independent disruption. This implies\nthat the dN/dt of mass limited cluster samples should be flat\nover this age range and that a luminosity limited cluster sample\nshould follow the decline predicted by the fading of clusters,\ni.e. dN/dt ∝ t−ζ , with −1.0 < ζ < −0.7 (Boutloukos & Lamers\n2003; Gieles et al. 2007). For the SMC this was recently shown\nto be the case by Gieles et al. (2007) and de Grijs & Goodwin\n(2008). The dN/dt of the LMC clusters also follows the fading prediction in the first 100 Myr (de Grijs & Anders 2006).\nParmentier & de Grijs (2008) show that the dN/dt of massive\nclusters is nearly flat. Both these findings and the near linear\nincrease of log(Mmax ) with log(age) we see in Fig. 2 suggest\nthat there can not be 90% MID of clusters in the LMC.\nThe dN/dt of M33 clusters declines as t−1.1±0.1\n(Sarajedini & Mancone 2007), which was interpreted by\nthe authors as rapid dissolution. However, the authors also note\nthat their sample is luminosity limited. When the sample is\nlimited by a detection in a blue filter, such as B or U, the dN/dt\ndistribution of a sample that is not affected by any disruption\ndeclines as t−1 . This means that both the dN/dt distribution as\nshown by Sarajedini & Mancone (2007) and the nearly linear\nincrease of log(Mmax ) with log(age) (Fig. 2) are in agreement\nand imply no mass independent disruption (i.e. fMID =0) in the\nfirst 100 Myr in M33.\n\n\f6\n\nM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\nThe flat dN/dt distributions of mass-limited cluster samples and the results presented in this work are not to be interpreted as no infant mortality of clusters in these galaxies. This\nis because all of the cluster populations used in this study were\noptically selected, i.e. no embedded clusters were included. In\nfact, our findings are in perfect agreement with the 90% infant\nmortality scenario for the solar neighbourhood by LL03, since\nthey derived this from a comparison between embedded clusters to open clusters (see § 3.3). Our results suggest that for\nsome galaxies the infant mortality of clusters can not be observed from optically selected clusters. The cluster samples of\nM51 and the Antennae are the only ones for which it has been\nshown that there is a steep drop in dN/dt around ∼ 10 Myr in a\nmass limited, optically selected sample.\n\n4.2. What happens after 100 Myr?\nThe slopes determined over 3 Gyr (Fig. 2) are shallower for\nmost samples, but it is difficult, if not impossible, to come up\nwith an explanation where MID disruption starts after 100 Myr.\nThere are several culprits for the observed flattening: stellar evolution combined with \"standard\" mass-dependent disruption, a CIMF that is steeper or truncated at high masses\n(∼ 106 M⊙ ) or a non-constant CFR. Below we will discuss each\nof these effects in turn.\n\nThere will always be a natural bias to studies of star cluster populations in galaxies which are actively forming stars and\nclusters at the present day, such as the Antennae galaxies, simply because they are more attractive to study. The degeneracy in\nthis method between changes in the CFR and disruption and/or\na truncation in the CIMF is hard to quantify. A note of caution\nshould be placed that the assumption of a constant CFR can\nlead to false detections of MID. This is not only the case when\nstudying dN/dt, but as well as Mmax it vs. log(age).\n\n4.2.2. Mass dependent disruption\nTo flatten the relation between log(Mmax ) and log(age) by mass\ndependent disruption, the dependence of the disruption time\n(tdis ) on mass has to be weaker than linear, i.e. tdis ∝ M γ where\nγ < 1. When tdis ∝ M and Mmax scales also linear with age\ndue to size of sample effects, than all clusters lose the same\nfraction of their initial mass, which would not flatten the relation. From observations and theory it is expected that tdis scales\nas M 0.6 (Lamers et al. 2005b; Gieles et al. 2006c), from which\na flattening of Mmax with age is expected. Gieles et al. (2006a)\nshowed that the trends of Mmax with age for the SMC and LMC\ncan be explained by mass loss at old ages due to stellar evolution and tidal effects.\n\n4.2.3. The cluster initial mass function\n4.2.1. The effect of a non-constant cluster formation\nhistory\nSo far we have assumed, for simplicity, that the star/cluster formation rate has been constant in time. For the age range of\n10 − 100 Myr this is probably a reasonable assumption for most\nof the galaxies considered in this study. However, for the age\nrange of 3 Gyr, as considered in Fig. 2, this assumption may\nnot hold and can lead to a confusion between cluster disruption\nand variations in the formation history. For example, for the\nSMC it is generally believed that the assumption of a constant\nCFR is not too bad. However, when approximating the result\nof Harris & Zaritsky (2004) for the global SFR(t) as tη , we find\nη = −0.15. Assuming that the CFR follows the SFR, this partially explains the small difference between the observed slope\nof +0.75 (Fig. 2) and the predicted slope of +1 (Eq. 7), since\nincluding the effect of this increasing CFR(t) predicts a slope\nof +0.85 (Eq. 8).\nFor the Antennae galaxies the assumption of a constant\nCFR over the past Gyr (Fall et al. 2005; Whitmore et al. 2007)\nis less likely. According to the numerical models of Barnes\n(1988) the first encounter between NGC 4038 and NGC 4039\nwas around ∼ 200 Myr ago and the models of Mihos et al.\n(1993) predicted that the SFR has been increasing by at least\na factor of five since then. The t−1 disruption model introduced\nby Fall et al. (2005) was derived from only 3 or 4 histogram\npoints of the dN/dt of the Antennae clusters. A combination\nof 90% infant mortality in the first 10-30 Myr and a CFR that\nstarted increasing a few 100 Myrs ago could also very well explain the trend in Fig. 2 and the steep decline in dN/dt reported\nby Fall et al. (2005).\n\nSince the measured slope in Fig. 2 is a combination of the index\nof the CIMF and disruption (Eq. 11), the shallower slopes could\nalso be explained by a steeper CIMF.\nWe note that a slope of +0.75 in Fig. 2 follows from\nα ≃ 2.35 (Eq. 7, Hunter et al. 2003.). The same high value,\ni.e. larger than 2, for the index of the CIMF was found from the\nanalyses of young (< 10 Myr) clusters through the increase of\nMmax as a function of number of clusters in different galaxies\n(Weidner et al. 2004). A value of −2.3 was also found for the\nindex of the cluster luminosity function through the increase\nof the most luminous cluster as a function of the number of\nclusters (Larsen 2002; Whitmore 2003; Gieles et al. 2006a).\nSince these studies consider young clusters, i.e. not affected\nby disruption yet, a Schechter type upper mass limit to the\nCIMF is a logical scenario that can also explain the slopes\nslightly shallower than +1 in Fig. 2 for the fits on the 3 Gyr\nage range. Random sampling from a CIMF that is a power-law\nwith an exponential cut-off around M∗ = 106 M⊙ (Gieles et al.\n2006a,b) can result in a slope of ∼ 0.75 in the log(Mmax ) vs\nage relation. When sampling cluster masses from such a CIMF,\nthe relation of Mmax with N still resembles a straight line, i.e.\nthe cut-off is not detectable as such as long as Mmax . M∗ . In\nthis scenario slightly steeper slopes at young ages are expected,\nsince there the masses are well below the cut-off mass. This can\nalso explain the nearly flat slopes of M51 and the Antennae,\nsince the mass of the most massive cluster is already close to\nM∗ at young ages and can therefore not increase more with age.\nWe refer to Gieles (2008) for a more detailed discussion on how\na physical maximum to the cluster mass can be derived using\nthe method presented in § 2.\n\n\fM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\n5. Conclusions\nWe have studied the evolution of the maximum cluster mass\n(Mmax ) in bins constant in log(age) (i.e. increasing width in linear age) in different galaxies. Under the assumption of a constant cluster formation rate, a power-law cluster initial mass\nfunction (CIMF) with index −2, and no mass loss of clusters due to disruptive effects, we predict a linear increase of\nlog(Mmax ) with log(age), a slope of +1, when sampling the\ncluster masses stochastically from the CIMF. Including the effects of mass independent disruption (MID) causes the slope to\ndecrease in proportion to the fraction of clusters removed per\nage dex, fMID (Eq. 12). This results in a flat relation between\nlog(Mmax ) with log(age) when fMID = 0.9, the value reported\nby Fall et al. (2005), Chandar et al. (2006) and Whitmore et al.\n(2007).\nBased on a comparison with observed cluster populations\nin seven galaxies we conclude that:\n1. The predicted linear increase of log(Mmax ) with log(age)\nfor a power-law CIMF with index −2 and no disruption\nis observed in the first 100 Myr for clusters in the solar neighbourhood, SMC, LMC, M33 and M83. This implies that no significant disruption has taken place (after\nthe clusters have left the embedded phase) and with this\nwe can rule out the scenario in which 90% of the clusters are destroyed each age dex, independent of the cluster\nmass. Comparing the observed slopes with those predicted\nfor different mass independent disruption fractions, we can\nconstrain fMID < 0.2 for the solar neighbourhood, SMC and\nLMC and fMID < 0.4 for M33 and M83.\n2. For M51 the observed slope is slightly shallower, consistent with the observations of Bastian et al. (2005) who\nfound that 70% of the clusters in M51 do not survive the\nfirst 10 − 20 Myr. If we only look at ages between 20\nand 100 Myr the slope is steeper which agrees well with\nno mass-independent disruption, providing additional evidence that this mass independent disruption phase lasts\nonly 10-20 Myr and is due to the expulsion of gas.\n3. In the Antennae galaxies log(Mmax ) is flat in the first\n100 Myr and even decreasing for the full age range. These\nobservations are consistent with the scenario of 90% MID\neach age dex. We note, however, that a non-constant CFR\nor a truncation of the cluster mass function at the high mass\nend can produce the same effect.\n4. The SMC clusters show the best agreement with a prediction without disruption when assuming a CFR of 2 ×\n10−3 M⊙ yr−1 . This is only 2 or 4% of the global star formation rate in this galaxy, suggesting that the SMC is extremely inefficient in producing bound star clusters, but\nonce they are formed they are very stable against disruption.\nAcknowledgements. We thank an anonymous referee for constructive comments. We wish to thank Deidre Hunter, Henny Lamers and\nMarcelo Mora for providing their cluster measurements in electronic\nform. Bruce Elmegreen, Iraklis Konstantopoulos, Henny Lamers,\nSimon Goodwin, Sally Oey and Søren Larsen are acknowledged for\ninteresting discussions and comments on the manuscript. Additionally,\n\n7\n\nwe would like to thank the organisers of the workshop Young Massive\nStar Clusters: Initial Conditions and Environments, Enrique Pérez and\nRichard de Grijs, which provided an excellent forum to discuss this issue.\n\nReferences\nAnders, P. & Fritze-v. Alvensleben, U. 2003, A&A, 401, 1063\nBarnes, J. E. 1988, ApJ, 331, 699\nBastian, N., Gieles, M., Lamers, H. J. G. L. M., Scheepmaker,\nR. A., & de Grijs, R. 2005, A&A, 431, 905\nBaumgardt, H. & Makino, J. 2003, MNRAS, 340, 227\nBik, A., Lamers, H. J. G. L. M., Bastian, N., Panagia, N., &\nRomaniello, M. 2003, A&A, 397, 473\nBoutloukos, S. G. & Lamers, H. J. G. L. M. 2003, MNRAS,\n338, 717\nChandar, R., Fall, S. M., & Whitmore, B. C. 2006, ApJ, 650,\nL111\nChiosi, E., Vallenari, A., Held, E. V., Rizzi, L., & Moretti, A.\n2006, A&A, 452, 179\nCox, T. J., Jonsson, P., Primack, J. R., & Somerville, R. S. 2006,\nMNRAS, 373, 1013\nde Grijs, R. & Anders, P. 2006, MNRAS, 366, 295\nde Grijs, R., Anders, P., Bastian, N., et al. 2003, MNRAS, 343,\n1285\nde Grijs, R. & Goodwin, S. P. 2008, MNRAS, 383, 1000\nElson, R. A. W. & Fall, S. M. 1985, ApJ, 299, 211\nFall, S. M., Chandar, R., & Whitmore, B. C. 2005, ApJ, 631,\nL133\nGeyer, M. P. & Burkert, A. 2001, MNRAS, 323, 988\nGieles, M. 2008, in Young massive star clusters – Initial\nconditions and environments, Proc. of a workshop held\nin Granada, Spain, Eds. E. Perez, R. de Grijs and R. M.\nGonzalez Delgado (astro-ph/0801.2676)\nGieles, M., Bastian, N., Lamers, H. J. G. L. M., & Mout, J. N.\n2005, A&A, 441, 949\nGieles, M., Lamers, H. J. G. L. M., & Portegies Zwart, S. F.\n2007, ApJ, 668, 268\nGieles, M., Larsen, S. S., Bastian, N., & Stein, I. T. 2006a,\nA&A, 450, 129\nGieles, M., Larsen, S. S., Scheepmaker, R. A., et al. 2006b,\nA&A, 446, L9\nGieles, M., Portegies Zwart, S. F., Baumgardt, H., et al. 2006c,\nMNRAS, 371, 793\nGoodwin, S. P. 1997, MNRAS, 286, 669\nGoodwin, S. P. & Bastian, N. 2006, MNRAS, 373, 752\nHarris, J. & Zaritsky, D. 2004, AJ, 127, 1531\nHills, J. G. 1980, ApJ, 235, 986\nHodge, P. 1987, PASP, 99, 724\nHunter, D. A., Elmegreen, B. G., Dupuy, T. J., & Mortonson,\nM. 2003, AJ, 126, 1836\nKharchenko, N. V., Piskunov, A. E., Röser, S., Schilbach, E.,\n& Scholz, R.-D. 2005, A&A, 438, 1163\nKroupa, P. 2005, in ESA SP-576: The Three-Dimensional\nUniverse with Gaia, ed. C. Turon, K. S. O'Flaherty, &\nM. A. C. Perryman, 629\nLada, C. J. & Lada, E. A. 2003, ARA&A, 41, 57\nLada, C. J., Margulis, M., & Dearborn, D. 1984, ApJ, 285, 141\n\n\f8\n\nM. Gieles and N. Bastian: An alternative method to study star cluster disruption\n\nLamers, H. J. G. L. M. & Gieles, M. 2006, A&A, 455, L17\nLamers, H. J. G. L. M. & Gieles, M. 2007, in Mass loss from\nstars and the evolution of stellar clusters, Proc. of a workshop held in honour of H.J.G.L.M. Lamers, Lunteren, The\nNetherland. Eds. A. de Koter, L. Smith and R. Waters, San\nFransisco: ASP (astro-ph/0702166)\nLamers, H. J. G. L. M., Gieles, M., Bastian, N., et al. 2005a,\nA&A, 441, 117\nLamers, H. J. G. L. M., Gieles, M., & Portegies Zwart, S. F.\n2005b, A&A, 429, 173\nLarsen, S. S. 2002, AJ, 124, 1393\nMaschberger, T. & Kroupa, P. 2007, MNRAS, 379, 34\nMihos, J. C., Bothun, G. D., & Richstone, D. O. 1993, ApJ,\n418, 82\nOey, M. S. & Clarke, C. J. 2005, ApJ, 620, L43\nParmentier, G. & de Grijs, R. 2008, MNRAS, 383, 1103\nRafelski, M. & Zaritsky, D. 2005, AJ, 129, 2701\nSarajedini, A. & Mancone, C. L. 2007, AJ, 134, 447\nSchulz, J., Fritze-v. Alvensleben, U., Möller, C. S., & Fricke,\nK. J. 2002, A&A, 392, 1\nSpitzer, L. J. 1958, ApJ, 127, 17\nTutukov, A. V. 1978, A&A, 70, 57\nVesperini, E. & Heggie, D. C. 1997, MNRAS, 289, 898\nWeidner, C., Kroupa, P., & Larsen, S. S. 2004, MNRAS, 350,\n1503\nWhitmore, B. C. 2003, in A Decade of Hubble Space Telescope\nScience, 153–178\nWhitmore, B. C., Chandar, R., & Fall, S. M. 2007, AJ, 133,\n1067\nWielen, R. 1988, in IAU Symp. 126: The Harlow-Shapley\nSymposium on Globular Cluster Systems in Galaxies, ed.\nJ. E. Grindlay & A. G. D. Philip, 393–406\nWilke, K., Klaas, U., Lemke, D., et al. 2004, A&A, 414, 69\nZhang, Q. & Fall, S. M. 1999, ApJ, 527, L81\n\n\f"}