{"id": "http://arxiv.org/abs/1108.5791v1", "guidislink": true, "updated": "2011-08-30T01:34:31Z", "updated_parsed": [2011, 8, 30, 1, 34, 31, 1, 242, 0], "published": "2011-08-30T01:34:31Z", "published_parsed": [2011, 8, 30, 1, 34, 31, 1, 242, 0], "title": "Synchronization of flexible sheets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.2000%2C1108.1400%2C1108.5923%2C1108.5774%2C1108.0248%2C1108.0776%2C1108.0084%2C1108.3555%2C1108.4828%2C1108.1276%2C1108.3105%2C1108.2671%2C1108.0176%2C1108.0905%2C1108.1148%2C1108.4984%2C1108.0555%2C1108.2611%2C1108.4564%2C1108.1558%2C1108.2534%2C1108.3114%2C1108.1439%2C1108.4566%2C1108.4127%2C1108.3058%2C1108.5715%2C1108.0369%2C1108.0224%2C1108.6082%2C1108.0998%2C1108.0505%2C1108.5578%2C1108.4445%2C1108.5055%2C1108.2520%2C1108.6313%2C1108.2509%2C1108.5946%2C1108.0472%2C1108.0383%2C1108.4776%2C1108.2411%2C1108.4808%2C1108.5323%2C1108.2094%2C1108.0844%2C1108.3497%2C1108.4493%2C1108.1822%2C1108.3589%2C1108.1500%2C1108.2488%2C1108.6175%2C1108.5018%2C1108.0014%2C1108.2887%2C1108.6029%2C1108.1663%2C1108.0553%2C1108.0509%2C1108.1773%2C1108.4172%2C1108.4164%2C1108.0618%2C1108.1557%2C1108.1149%2C1108.4896%2C1108.6135%2C1108.4593%2C1108.0480%2C1108.1432%2C1108.2549%2C1108.5352%2C1108.5811%2C1108.6301%2C1108.1313%2C1108.4847%2C1108.2993%2C1108.0741%2C1108.6042%2C1108.1613%2C1108.6206%2C1108.0357%2C1108.3262%2C1108.4845%2C1108.3703%2C1108.0786%2C1108.0611%2C1108.4228%2C1108.0051%2C1108.2557%2C1108.1403%2C1108.1975%2C1108.4895%2C1108.6093%2C1108.5791%2C1108.5697%2C1108.0840%2C1108.2515%2C1108.4821&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Synchronization of flexible sheets"}, "summary": "When swimming in close proximity, some microorganisms such as spermatozoa\nsynchronize their flagella. Previous work on swimming sheets showed that such\nsynchronization requires a geometrical asymmetry in the flagellar waveforms.\nHere we inquire about a physical mechanism responsible for such\nsymmetry-breaking in nature. Using a two-dimensional model, we demonstrate that\nflexible sheets with symmetric internal forcing, deform when interacting with\neach other via a thin fluid layer in such a way as to systematically break the\noverall waveform symmetry, thereby always evolving to an in-phase conformation\nwhere energy dissipation is minimized. This dynamics is shown to be\nmathematically equivalent to that obtained for prescribed waveforms in\nviscoelastic fluids, emphasizing the crucial role of elasticity in\nsymmetry-breaking and synchronization.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.2000%2C1108.1400%2C1108.5923%2C1108.5774%2C1108.0248%2C1108.0776%2C1108.0084%2C1108.3555%2C1108.4828%2C1108.1276%2C1108.3105%2C1108.2671%2C1108.0176%2C1108.0905%2C1108.1148%2C1108.4984%2C1108.0555%2C1108.2611%2C1108.4564%2C1108.1558%2C1108.2534%2C1108.3114%2C1108.1439%2C1108.4566%2C1108.4127%2C1108.3058%2C1108.5715%2C1108.0369%2C1108.0224%2C1108.6082%2C1108.0998%2C1108.0505%2C1108.5578%2C1108.4445%2C1108.5055%2C1108.2520%2C1108.6313%2C1108.2509%2C1108.5946%2C1108.0472%2C1108.0383%2C1108.4776%2C1108.2411%2C1108.4808%2C1108.5323%2C1108.2094%2C1108.0844%2C1108.3497%2C1108.4493%2C1108.1822%2C1108.3589%2C1108.1500%2C1108.2488%2C1108.6175%2C1108.5018%2C1108.0014%2C1108.2887%2C1108.6029%2C1108.1663%2C1108.0553%2C1108.0509%2C1108.1773%2C1108.4172%2C1108.4164%2C1108.0618%2C1108.1557%2C1108.1149%2C1108.4896%2C1108.6135%2C1108.4593%2C1108.0480%2C1108.1432%2C1108.2549%2C1108.5352%2C1108.5811%2C1108.6301%2C1108.1313%2C1108.4847%2C1108.2993%2C1108.0741%2C1108.6042%2C1108.1613%2C1108.6206%2C1108.0357%2C1108.3262%2C1108.4845%2C1108.3703%2C1108.0786%2C1108.0611%2C1108.4228%2C1108.0051%2C1108.2557%2C1108.1403%2C1108.1975%2C1108.4895%2C1108.6093%2C1108.5791%2C1108.5697%2C1108.0840%2C1108.2515%2C1108.4821&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "When swimming in close proximity, some microorganisms such as spermatozoa\nsynchronize their flagella. Previous work on swimming sheets showed that such\nsynchronization requires a geometrical asymmetry in the flagellar waveforms.\nHere we inquire about a physical mechanism responsible for such\nsymmetry-breaking in nature. Using a two-dimensional model, we demonstrate that\nflexible sheets with symmetric internal forcing, deform when interacting with\neach other via a thin fluid layer in such a way as to systematically break the\noverall waveform symmetry, thereby always evolving to an in-phase conformation\nwhere energy dissipation is minimized. This dynamics is shown to be\nmathematically equivalent to that obtained for prescribed waveforms in\nviscoelastic fluids, emphasizing the crucial role of elasticity in\nsymmetry-breaking and synchronization."}, "authors": ["Gwynn J. Elfring", "Eric Lauga"], "author_detail": {"name": "Eric Lauga"}, "author": "Eric Lauga", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/S0022112011000814", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.5791v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.5791v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 4 figures", "arxiv_primary_category": {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.5791v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.5791v1", "journal_reference": "Journal of Fluid Mechanics 674 (2011) 163-173", "doi": "10.1017/S0022112011000814", "fulltext": "Synchronization of flexible sheets\nGwynn J. Elfring and Eric Laugaa\n\narXiv:1108.5791v1 [physics.flu-dyn] 30 Aug 2011\n\nDepartment of Mechanical and Aerospace Engineering,\nUniversity of California San Diego, 9500 Gilman Drive, La Jolla CA 92093-0411, USA.\n(Dated: June 15, 2018)\nWhen swimming in close proximity, some microorganisms such as spermatozoa synchronize their\nflagella. Previous work on swimming sheets showed that such synchronization requires a geometrical\nasymmetry in the flagellar waveforms. Here we inquire about a physical mechanism responsible for\nsuch symmetry-breaking in nature. Using a two-dimensional model, we demonstrate that flexible\nsheets with symmetric internal forcing, deform when interacting with each other via a thin fluid\nlayer in such a way as to systematically break the overall waveform symmetry, thereby always\nevolving to an in-phase conformation where energy dissipation is minimized. This dynamics is\nshown to be mathematically equivalent to that obtained for prescribed waveforms in viscoelastic\nfluids, emphasizing the crucial role of elasticity in symmetry-breaking and synchronization.\n\nI.\n\nINTRODUCTION\n\nMotile microorganisms swim in a fluid regime where inertia is unimportant and viscous stresses dominate. In this\nlimit the flow field due to a swimmer affects the motility of nearby cells [1], a fact which is biologically important\nas microorganisms such as spermatozoa are often found in high-density suspensions [2]. A particular consequence of\nthese fluid-based interactions is the synchronization of the flagella of some spermatozoa observed to occur when these\ncells are swimming in close proximity [3–5].\nG.I. Taylor provided the first quantitative analysis of this phenomenon in his landmark work on the mechanics\nof swimming microorganisms [6]. Using a two-dimensional model of sheets passing sinusoidal waves of transverse\ndisplacement, he showed that the energy dissipated by the fluid due to such motions, for two swimmers a fixed\ndistance apart, is minimized if they are in-phase [6]. Subsequent computational studies [7–9] have shown that such\nsynchronization can occur due to fluid forces alone.\nIn recent theoretical analysis it was demonstrated that two infinite sheets passing waves of a prescribed shape,\nwill not synchronize in a Newtonian fluid if the shape of the waveforms η1 and η2 satisfy η2 (x) = −η1 (−x + θ)\n(where θ is a fixed phase shift and x is the direction along the sheets) because of the kinematic reversibility of the\nStokes equations [10, 11]. The sinusoidal waveforms of Taylor's swimming sheet clearly fall into this category, and\nwill thus not dynamically synchronize in a Newtonian fluid. It has been observed that excess symmetry similarly\ncurbs synchronization in other models [12–16]. For a sinusoidal sheet, a geometric perturbation must therefore be\nadded (for example in the form of a higher order mode) to break the necessary front/back symmetry, and give rise\nto a time-evolution of phase toward the synchronized state [10, 11]. Alternatively, instead of a geometric symmetry\nbreaking, it has also been shown that synchronization can occur if the kinematic reversibility of the field equations is\nremoved, as is the case for a viscoelastic fluid [17]. In such a scenario the phase always evolves to a stable in-phase\nconformation where the energy dissipated by the swimmers is minimized.\nIn this paper we inquire about a physical mechanism responsible for symmetry-breaking in real biological cells.\nInstead of delineating a fixed waveform for the swimming sheets, we take the more realistic modeling approach of\npassing internal waves of bending as produced by a flagellum's internal structure (or axoneme) [18]. In the case of a\nsingle sheet, similar models have been employed to study swimming [19, 20] and peeling [21]. We use this model to\nshow that elastic deformation due to fluid body interactions, with purely sinusoidal forcing, always leads to in-phase\nsynchronization.\nFlexibility has long been considered as an avenue for symmetry breaking in Stokes flow. Purcell, in his celebrated\ntalk and paper [22], asserted that while a stiff oar undergoing reciprocal motion would produce no net motion, due to\nthe scallop theorem, a flexible oar would escape this conundrum because of a broken symmetry between forward and\nreverse strokes. This was first investigated analytically by Machin [23] while more recently a number of theoretical\nand experimental studies have further elucidated the effect of flexibility quantitively, both for boundary-driven [24–26]\nand internally-driven filaments [27–29].\nRecently, the analysis of a pair rotating helices as model for bacterial flagella has shown flexibility to be a crucial\ningredient for synchronization [30], as was similarly shown for a minimal model of interacting cilia [31]. Additionally\nflexibility has been found to be requisite for the synchronization of paddles that would otherwise be too symmetric to\n\na\n\nCorresponding author. Email: elauga@ucsd.edu\n\n\f2\n\ny\n\nφ=0\nin-phase\n\nφ=π\nopposite-phase\n\nU∆\nη2 (x, t)\n\nN\nM\n\nφ/k\n\np\nT\n\nh̄\n\nη1 (x, t)\n\nx\nh(x, t)\n\nFIG. 1. System of two infinite two-dimensional sheets, of shape described by the functions η1 and η2 , which are separated by\na fluid layer of thickness h (mean value, h̄), have a relative phase φ, and may move relative to each other with a velocity U∆ .\nAn infinitesimal material element on the top sheet is subject to fluid pressure p, normal force N , tension T and moment M .\nInset: schematic representation of in-phase and opposite-phase configurations.\n\nyield stable fixed points [32]. In these models and experiments, the bodies are rigid, but permitted to deviate from\ntheir trajectories, in an elastic manner in response to fluid forces. In contrast, here we allow the bodies themselves to\ndeform due to fluid stresses induced by the other swimmer.\nOur approach is organized as follows. For a pair of two-dimensional sheets in the lubrication limit, we derive\na system of nonlinear equations governing both the fluid stresses and the resulting swimmer shapes. We linearize\nthese equations to produce analytical solutions, and then solve the nonlinear equations numerically. We show that\nflexible sheets with symmetric sinusoidal forcing will deform when interacting with each other via a thin fluid layer\nin such a way as to break geometrical symmetry, and to evolve to an in-phase conformation where energy dissipation\nis minimized. Further, this evolution of phase is shown to be functionally equivalent to that found for prescribed\nwaveforms in viscoelastic fluids [17], illuminating the role of elasticity in symmetry-breaking and synchronization.\nII.\n\nMODEL SYSTEM\n\nWe consider the dynamics of two infinite two-dimensional elastic sheets which are separated by a fluid layer of\nmean distance h̄ (see figure 1). The sheets deform due to a balance between an active moment m, passive bending\n(elastic) resistance, and fluid stresses. The positions of the sheets are given by y1 = η1 (x, t) for the bottom sheet and\ny2 = h̄ + η2 (x, t) for the top sheet. We look to solve this problem in the limit that the fluid layer is thin compared to\nthe wavelength of the sheets, k h̄ ≪ 1, to make use of Reynolds' lubrication approximation for the fluid field equations\n[33].\nAn infinitesimal element along one sheet is subject to tension, T , normal force, N and moment, M (shown in\nfigure 1). Since the fluid layer is thin and lubrication forces are singular with the gap thickness, forces from the outer\nflow are safely ignored [20]. To capture the active bending of the sheet we use a model for the flagella of eukaryotes\nintroduced by Jülicher and co-workers [18, 28] where the bending of an elastic filament (flagellum) is caused by the\nconstrained sliding of microtubule doublets; the effect of the internal forces which induce sliding are here represented\nby an active moment density m. Given that we are in an over-damped limit we take the equilibrium shapes to arise\ninstantaneously [21]. Assuming reasonably small deflections such that the swimmers are linearly elastic [34], force (F)\nand moment (M) balance on the top sheet yield respectively\n∂F\n= −n * σ,\n∂x\n\n∂M\n= −N + m,\n∂x\n\n(1)\n\n\f3\nwhere n is the unit normal and σ is the fluid stress tensor. The relation between the moment and the sheet curvature\nis given by the constitutive relation M = B∂ 2 η/∂x2 , where B is the sheet bending stiffness. Combining with (1) we\nobtain the equations governing the shape of the sheets\n∂m\n∂4η\n=\n∓ n * σ * n,\n(2)\n4\n∂x\n∂x\nwhere ∓ are for the top and bottom sheets respectively. If resistive force theory is used for the fluid forces then we\nobtain the governing equation used by [18] for a single filament.\nThe internal forcing on the sheets is assumed to take the form m(x, t) = Ag(kx − kct) where k is the wavenumber,\nc is the wave speed, A is the amplitude of the moment and g is an arbitrary but 2π-periodic function. Because\nthe forcing is periodic, we will assume the shape η to also be periodic. We nondimensionalize vertical distances by\ny ∗ = y/h̄ and horizontal distances x∗ = kx (∗ indicates a dimensionless quantity). Nondimensionalizing the continuity\nequation we find that if the horizontal velocity is given by u = cu∗ then the vertical velocity must be v = ǫcv ∗ where\nǫ = k h̄. The Stokes equations then yield the lubrication equations to leading order in ǫ\nB\n\n∂p∗\n∂ 2 u∗\n∂p∗\n=\n,\n= 0,\n∂x∗\n∂y ∗2\n∂y ∗\n∂v ∗\n∂u∗\n+ ∗ = 0.\n∗\n∂x\n∂y\n\n(3)\n(4)\n\nwhere p∗ = ǫ2 p/μω. Forces (per unit depth) are nondimensionalized as f ∗ = f ǫ/μc, while energy dissipation rate per\nunit depth is Ė ∗ = ǫ2 Ė/μωch̄.\nIn the lubrication limit, ǫ ≪ 1, the normal force due to the fluid on the beam is to leading order merely the pressure,\n−n * σ * n = p. Since the field equations for the fluid yield the pressure gradient, we differentiate (2), and recasting\nthe equation in dimensionless form we obtain\nB∗\n\n2\n∂ 5 η∗\ndp∗\n∗ ∂ g\n=\nA\n±\n,\n∂x∗5\n∂x∗2\ndx∗\n\n(5)\n\nwhere B ∗ = Bǫ3 k 3 /μω is the dimensionless bending stiffness and A∗ = Aǫ2 k 2 /μω is the dimensionless amplitude of\nthe active bending moment. This equation allows us to solve for the shape of the sheets, η1,2 , and is coupled to the\nfluid field equations through the pressure gradient. We now drop the ∗ for convenience.\nIII.\n\nANALYSIS\n\nGiven the form of the forcing we expect post-transient solutions which are functions of a wave variable z = x− t and\nthus we write η = η(z). The top sheet may move relative to the bottom sheet with a horizontal velocity u = U∆ , hence\nthe boundary conditions for the fluid equations (4), in a frame moving with waveform are given by u(x, y1 ) = −1,\nv(x, y1 ) = −η1′ , u(x, y2 ) = U∆ − 1 and v(x, y2 ) = −η2′ . Given the above boundary conditions the solution for the\nvelocity field is found to be\nu(x, y) =\n\ny − y1\n1 dp\n− 1.\n(y − y1 )(y − y2 ) + U∆\n2 dx\ny2 − y1\n\n(6)\n\nIf one integrates the continuity equation one finds\n∂\n∂x\n\nZ\n\ny2\n\ny1\n\nudy = U∆\n\ndη2\n*\ndx\n\n(7)\n\nIf U∆ = 0 then the flow rate between the sheets is constant. Integrating (7) and exploiting the periodicity of the\npressure [10], we obtain the equation for the pressure gradient\ndp\n(6U∆ − 12)I2 − 12U∆ J3\n6U∆ − 12 12U∆ y2\n−\n−\n,\n(8)\n=\n2\n3\ndx\nh\nh\nI3 h3\nR 2π\nR 2π\nwhere the distance between the two sheets is given h = 1 + η2 − η1 and Ij = 0 h−j dx and J3 = 0 y2 h−3 dx. Then\nthe force on the top sheet is given by\n\u0013\n\u0013\nZ 2π \u0012\nZ 2π \u0012\nU∆\n1 dp\ndp ∂u\ndx.\n(9)\ndx =\n−\n(η2 + η1 ) −\nfx =\ny2\ndx ∂y y=y2\n2 dx\n1 + η2 − η1\n0\n0\n\n\f4\nA.\n\nLinear regime: Statics\n\nWe first look at the case where we enforce U∆ = 0 (i.e. we fix the top sheet with respect to the bottom sheet) in\norder to determine under which condition a nonzero synchronization force will arise.\nIf we assume the dimensionless amplitude of the forcing A to be small, and the dimensionless bending stiffness B to\nbe large, then the shape amplitude (or maximum value of the shape) kηk∞ is expected to also be small. Linearizing\nthe pressure gradient for small η, with U∆ = 0 gives\ndp\n≈ −12(η2 − η1 ),\ndx\n\n(10)\n\nwhere we have invoked an integrated conservation of mass, hη2 − η1 i = 0 (angle brackets hi, denote the average over\na period). Our goal is now to determine whether two sheets which are equally and symmetrically forced but with a\nphase shift φ will synchronize in time. With this in mind we let g2 = g1 (z + φ) with g1 (z) = cos(z), and we set equal\nfor both sheets the bending stiffness B and the forcing amplitude A. The linearized governing equations are then\ngiven by\nd5 η1\n− 12(η2 − η1 ) = −A cos(z),\ndz 5\nd5 η2\nB 5 + 12(η2 − η1 ) = −A cos(z + φ).\ndz\nB\n\n(11a)\n(11b)\n\nTo solve these equations we apply periodic boundary conditions. The solution of this system of equations with the\nlinearized pressure gradient (10), can be found analytically to be\n\u0002\n\u0003 \u0002\n\u0001\n\u0003\n12B cos(z + φ) − cos z − 288 + B 2 sin z + 288 sin(z + φ)\nη1 (z) = A\n+ C,\n(12a)\nB (576 + B 2 )\n\u0002\n\u0001\n\u0003\n12B [cos z − cos(z + φ)] − 288 sin z + 288 + B 2 sin(z + φ)\n+ C.\n(12b)\nη2 (z) = A\nB (576 + B 2 )\nNote that nothing prevents the solution from including a uniform shift C(A, B); however, the relevant physics of the\nproblem are invariant under such a shift hence and hence the value of C is irrelevant (equivalently, we place our z-axis\nat hη1 i = 0).\nBoth shapes in (12) are delineated by the competition between bending rigidity, the pressure gradient in the fluid,\nand the internal forcing (with φ dependence). In this linear limit we note that the sheets are linear in the forcing\namplitude A, and when A = 0 then as expected they become straight, i.e. η = 0. In the limit where rigidity dominates,\nB → ∞, then the sheets also tend to become straight, η → 0. If the rigidity and forcing amplitude are both very large\n(A, B ≫ 1) then we can scale out the contribution from the fluid forces in (11) and we are left with η1 ≈ −(A/B) sin z\nand η2 ≈ −(A/B) sin(z + φ) as might be expected. Note finally that the solutions in (12) are only valid when B ≫ A\nas otherwise unphysical solutions may arise with the sheets overlapping; this is prevented when the full nonlinear\nform of the pressure gradient is kept, as it diverges when h → 0.\nSolutions to (12) for A = 1, B = 10, and three values of the phase difference (φ = π/4, π/2, 3π/4) are plotted in\nfigure 2 (left). We observe that the shapes are sinusoidal and hence individually remain symmetric both about the\nvertical axis and the horizontal axis. The global asymmetry that arises however is that the amplitudes of the two\nwaveforms are not equally modulated by the fluid pressure, as shown in figure 2 (right). We see indeed that the top\nsheet has smaller amplitude for positive φ (and by symmetry, this is reversed upon changing φ → −φ).\nThe phase locking force on the top sheet is, at leading order, given by\nZ 2π\nfx = −6\n(η2 − η1 )(η2 + η1 )dx = 2πα sin φ.\n(13)\n0\n\n2\n\n3\n\nwhere α = 144A /(576B + B ). Equation (13) is the main result of our paper. The phase locking force is proportional\nto the sine of the phase, meaning that the only stable fixed point is expected to occur at φ = 0, and hence all initial\nconformations will evolve to the stable in-phase conformation. We thus see that the elasticity of the swimmers, and\nthus fluid-structure interactions, can introduce the geometrical symmetry-breaking necessary to develop a nonzero\nphase locking force. The force is found to be quadratic in amplitude, reminiscent of viscoelastic symmetry-breaking\n[17]; by comparison, the phase-locking force arises at fourth order in amplitude for prescribed asymmetric waveforms\nin a Newtonian fluid. The reason for the difference is that with elastic deformation, the sheets are ultimately not the\nsame shape, despite having identical mechanical properties, and hence η12 6= η22 ; for prescribed waveforms this is\ndifferent as the same waveform is prescribed for both sheets, and the quadratic term of the force vanishes.\n\n\f5\n0.3\n\n0.1\n0.2\n\n0.08\n\n0.1\n\n0.06\n\n!η!∞\n\ny(z)\n\n0.04\n\n0\n\n0.02\n!0.1\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n0\n0\n\nz/π\n\n0.5\n\n1\n\nφ/π\n\nFIG. 2. Left: Solution shapes, (12), for various phase differences φ = π/4 (solid lines), π/2 (dashed lines), and 3π/4 (dash-dot\nlines), with A = 1 and B = 10. We observe that the amplitude is not evenly affected by the pressure (the plot is shown here\nwith h̄ = 0.2 rather than h̄ = 1 for display purposes only). Right: Shape amplitude, kηk∞ , vs. phase difference, φ (bottom\nsheet: solid line; top sheet: dashed line). Lines are reversed upon the change φ → −φ.\n\nThe energy dissipated by the fluid between the two swimming cells to leading order is\nZ 2π\n24πA2\n2\nĖ = 12\n(η2 − η1 ) dx =\n(1 − cos φ).\n576 + B 2\n0\n\n(14)\n\nWe see that the energy dissipation is a global minimum when φ = 0 and global maximum when φ = π. It follows then\nthat the cells will always evolve to a state of minimum energy dissipation. We observe that the form of the energy\ndissipation is precisely the same as that for fixed shapes (and taking the fixed wave amplitude A2f ixed = A2 /(576 + B 2)\nthey are equal) [11]. It is important to note that waveforms with a prescribed broken symmetry may evolve to either\nthe in-phase or opposite-phase conformation [10]; in contrast, the natural symmetry-breaking due to elasticity of the\nbodies, or in the fluid, leads to a conformation of minimum energy dissipation.\nB.\n\nLinear regime: Dynamics\n\nWhen the sheets are permitted to evolve in time in force-free swimming, the relative velocity U∆ will thus be\nnonzero. In order to determine the leading order component of the pressure field we must first find out how the\nrelative velocity scales with the sheet amplitudes. Given that the net force on the sheets in the dynamic case must\nnow be zero, we obtain at leading order the relative speed as given by\nZ\n3 2π\nU∆ = −\n(η2 − η1 )(η2 + η1 )dx.\n(15)\nπ 0\nWe see that the velocity is quadratic in amplitude and indeed is proportional to the static force U∆ = fxs /2π (we use\nhere the superscript s to indicate the static force given by (13) to avoid confusion). With this we thus know that at\nleading order the pressure field (for a given φ) is invariant between the static and dynamic case, and since the beam\nequation couples via the pressure field, our instantaneous shapes are found to be the same. The only difference is that\nnow the phase difference changes in time (geometrically) due to the presence of a nonzero relative velocity, according\nto dφ/dt = −U∆ . Using (15), we find the rate of change of the phase at leading order to be given by\ndφ\n= −α sin φ.\ndt\nEquation (16) can be integrated analytically, leading to a time-evolution of the phase given by\n\u0014\n\u0012 \u0013\n\u0015\nφ0\nφ(t) = 2 tan−1 tan\ne−αt .\n2\n\n(16)\n\n(17)\n\nAll initial conformations, φ0 , decay in time to the stable in-phase conformation, φ = 0. Notably, the time-evolution of\nthe phase for a sinusoidally forced elastic sheet we obtain here is mathematically similar to that for a fixed sinusoidal\nwaveform in a viscoelastic fluid [17] and for rigid bodies with flexible trajectories [31], emphasizing therefore the\ncrucial role of elasticity in synchronization.\n\n\f6\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\ny(z)\n\ny(z)\n0\n\n0\n\n!0.5\n\n!0.5\n\n!1\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n!1\n0\n\nz/π\n\n0.5\n\n1\n\n1.5\n\n2\n\nz/π\n\n0.15\n\n0.025\n0.02\n\n0.1\n\nfx\nA2\n\nU∆ 0.015\nA2 0.01\n\n0.05\n\n0.005\n0\n0\n\n0.5\n\n1\n\n0\n0\n\nφ/π\n\n0.5\n\n1\n\nφ/π\n\nFIG. 3. Top: solution shapes, η1 and η2 , for bending stiffness B = 10, phase difference φ = 3π/4, and amplitudes A = {1, 5, 10}\n(left: U∆ = 0; right fx = 0); linearized pressure approximation: solid lines; full pressure gradient: dashed lines. Bottom\nleft: phase locking force, fx /A2 , vs. phase difference, φ, when U∆ = 0; bottom right: relative velocity, U∆ /A2 , vs. φ, when\nfx = 0. Both plots are for numerical solutions of the nonlinear equations with B = 10 and A = 1 (circles), 5 (squares), and\n10 (diamonds); linearized solutions are shown as solid lines. Away from the linear regime, the rate of change of the phase is\naffected while the forces are not.\n\nFinally, if we allow a small difference in the wavespeeds of the sheets, ∆ω, then to leading order we have the same\nevolution of phase, (16) and (17), but now the rate of change of phase is defined as φ̇ = −U∆ − ∆ω and hence we see\na synchronization of shape but not of material points.\n\nC.\n\nNonlinear Case\n\nTo move beyond the linear regime, we now solve the nonlinear equations for the shapes (5) numerically, together\nwith (8), using Matlab's boundary value problem solver bvp4c, both for the static case, U∆ = 0, and the force free\ncase, fx = 0 using (9).\nWe find the linearized pressure gradient to be a capable approximation, particularly when the bending is of the\nsame order as the pressure B ∼ 1 and the phase difference is small; however, when A, B ≫ 1 the linearized pressure\nmay lead to unphysical solutions particularly if the sheets are near opposite-phase as the divergent nature of the full\nform of the pressure gradient is required to deform the sheets from contact.\nIn figure 3 we illustrate the breakdown of the linear regime. We plot the static shapes (U∆ = 0, top left), and\ndynamic shapes (fx = 0, top right), both with a phase difference of φ = 3π/4, bending stiffness B = 10, and with\nforcing amplitudes A = {1, 5, 10}. We see that for increasing amplitude the shapes predicted by linearized equations\n(solid) and nonlinear equations (dashed) begin to diverge. In particular the nonlinear equations lead to a pronounced\nleft-right asymmetry in the individual shape. In the lower left plot of figure 3 we display the phase locking force\nvs. phase, while in the lower right plot we show the relative velocity vs. phase, both with B = 10 and A = {1, 5, 10}\n(circles, squares and diamonds respectively) for the numerical solutions to the nonlinear equations; the analytical\nsolutions for the linear equations are shown solid. The synchronizing hydrodynamic force, fx , found by either method\nremains remarkably consistent even for very large forcing amplitude, A. In contrast, the rate of change of the phase\n\n\f7\n\n1\n0.8\n0.6\n\nφ/π\n0.4\n0.2\n0\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n2\n\nA t\nFIG. 4. Time-evolution of the phase difference, φ, in the nonlinear problem for B = 10 starting from an initial angle of\nφ/π = .99 and with forcing amplitude A = 1 (circles), 5 (squares) and 10 (diamonds); the linear estimate is shown solid. As\nthe forcing amplitude increases, the linear solution increasingly underestimates the time scale to synchronize.\n\ndecreases markedly from the linear approximation for large amplitude waves. Because the force is virtually unaffected\nwe know therefore that the resistance to motion is dramatically increased by the change in shape.\nIn figure 4 we integrate the instantaneous relative velocity to obtain the evolution of the phase in time. We show\nsolution to both the linear equations (solid) and nonlinear equations (dashed) for B = 10 and A = {1, 5, 10} starting\nfrom an initial phase difference of just less than π. We see that, as the forcing amplitude increases, the nonlinear\nequations yield an increasingly slower evolution to a synchronized conformation than that predicted by the linear\nregime; however, the general behavior remains qualitatively unchanged.\nIV.\n\nCONCLUSION\n\nIn this paper we inquired about a physical mechanism responsible for symmetry-breaking and synchronization in\nthe flagella of biological cells such as spermatozoa. In a Newtonian fluid, two swimming sheets passing waveforms of\na prescribed sinusoidal shape will not synchronize due to an excess of symmetry; however, here we have demonstrated\nthat identical flexible sheets with symmetric sinusoidal forcing will deform, when interacting with each other via a thin\nfluid layer, in such a way as to systematically break the overall geometrical symmetry. This system will always evolve\nto an in-phase conformation where energy dissipation is minimized, in contrast to a prescribed asymmetry, which\nmay maximize energy dissipation. In addition, this time-evolution of the relative phase is shown to be equivalent\nto that obtained for prescribed waveforms in viscoelastic fluids [17], emphasizing the crucial role of elasticity in\nsymmetry-breaking and synchronization – be it that of the fluid, or the swimmers themselves.\nACKNOWLEDGMENTS\n\nFunding by the NSF (CBET-0746285) and NSERC (PGS D3-374202) is gratefully acknowledged.\n\n[1] E. Lauga and T. R. Powers, \"The hydrodynamics of swimming microorganisms,\" Rep. Prog. Phys. 72, 096601 (2009).\n[2] S. S. Suarez and A. A. Pacey, \"Sperm transport in the female reproductive tract,\" Human Reprod. Update 12, 23–37\n(2006).\n[3] D. M. Woolley, R. F. Crockett, W. D. I. Groom, and S. G. Revell, \"A study of synchronisation between the flagella of bull\nspermatozoa, with related observations,\" J. Exp. Biol. 212, 2215–2223 (2009).\n[4] F. Hayashi, \"Sperm co-operation in the fishfly, parachauliodes japonicus,\" Functional Ecology 12, 347–350 (1998).\n[5] I. H. Riedel, K. Kruse, and J. Howard, \"A self-organized vortex array of hydrodynamically entrained sperm cells,\" Science\n309, 300–303 (2005).\n[6] G. I. Taylor, \"Analysis of the swimming of microscopic organisms,\" Proc. R. Soc. Lond. A 209, 447–461 (1951).\n[7] Y. Yang, J. Elgeti, and G. Gompper, \"Cooperation of sperm in two dimensions: Synchronization, attraction, and aggregation through hydrodynamic interactions,\" Phys. Rev. E 78, 061903 (2008).\n[8] L. J. Fauci, \"Interaction of oscillating filaments - A computational study,\" J. Comput. Phys. 86, 294–313 (1990).\n\n\f8\n[9] L. J. Fauci and A. McDonald, \"Sperm motility in the presence of boundaries,\" Bull. Math. Biol. 57, 679–699 (1995).\n[10] G. J. Elfring and E. Lauga, \"Hydrodynamic phase locking of swimming microorganisms,\" Phys. Rev. Lett. 103, 088101\n(2009).\n[11] G. J. Elfring and E. Lauga, \"Passive hydrodynamic synchronization of two-dimensional swimming cells,\" Phys. Fluids 23,\n011902 (2011).\n[12] M. Kim and T. R. Powers, \"Hydrodynamic interactions between rotating helices,\" Phys. Rev. E 69, 061910 (2004).\n[13] C. M. Pooley, G. P. Alexander, and J. M. Yeomans, \"Hydrodynamic interaction between two swimmers at low Reynolds\nnumber,\" Phys. Rev. Lett. 99, 228103 (2007).\n[14] V. B. Putz and J. M. Yeomans, \"Hydrodynamic synchronisation of model microswimmers,\" J. Stat. Phys. 137, 13 (2009).\n[15] Nariya Uchida and Ramin Golestanian, \"Generic conditions for hydrodynamic synchronization,\" Phys. Rev. Lett. 106,\n058104 (2011).\n[16] Ramin Golestanian, Julia M. Yeomans, and Nariya Uchida, \"Hydrodynamic synchronization at low Reynolds number,\"\nSoft Matter 7, 3074–3082 (2011).\n[17] G. J. Elfring, O. S. Pak, and E. Lauga, \"Two-dimensional flagellar synchronization in viscoelastic fluids..\" J. Fluid Mech.\n646, 505–515 (2010).\n[18] I. H. Riedel-Kruse, A. Hilfinger, J. Howard, and F. Jülicher, \"How molecular motors shape the flagellar beat,\" HFSP J. 1,\n192–208 (2007).\n[19] M. Argentina, J. Skotheim, and L. Mahadevan, \"Settling and swimming of flexible fluid-lubricated foils,\" Phys. Rev. Lett.\n99, 224503 (2007).\n[20] N. J. Balmforth, D. Coombs, and S. Pachmann, \"Microelastohydrodynamics of Swimming Organisms Near Solid Boundaries\nin Complex Fluids,\" Q.J. Mechanics Appl. Math. 63, 267–294 (2010).\n[21] A. E. Hosoi and L. Mahadevan, \"Peeling, healing, and bursting in a lubricated elastic sheet,\" Phys. Rev. Lett. 93, 137802\n(2004).\n[22] E.M. Purcell, \"Life at low Reynolds number,\" Am. J. Phys. 45, 11 (1977).\n[23] K. E. Machin, \"Wave propagation along flagella,\" J. Exp. Biol. 35, 796–806 (1958).\n[24] C. H. Wiggins and R. E. Goldstein, \"Flexive and propulsive dynamics of elastica at low Reynolds number,\" Phys. Rev.\nLett. 80, 3879–3882 (1998).\n[25] T. S. Yu, E. Lauga, and A. E. Hosoi, \"Experimental investigations of elastic tail propulsion at low Reynolds number,\"\nPhys. Fluids 18, 091701 (2006).\n[26] E. Lauga, \"Propulsion in a viscoelastic fluid,\" Phys. Fluids 19, 083104 (2007).\n[27] S. Camalet, F. Jülicher, and J. Prost, \"Self-organized beating and swimming of internally driven filaments,\" Phys. Rev.\nLett. 82, 1590–1593 (1999).\n[28] S. Camalet and F. Jülicher, \"Generic aspects of axonemal beating,\" New J. Phys. 2, 24 (2000).\n[29] R. Dreyfus, J. Baudry, M. L. Roper, M. Fermigier, H. A. Stone, and J. Bibette, \"Microscopic artificial swimmers,\" Nature\n437, 862–865 (2005).\n[30] M. Reichert and H. Stark, \"Synchronization of rotating helices by hydrodynamic interactions,\" Eur. Phys. J. E 17, 493–500\n(2005).\n[31] T. Niedermayer, B. Eckhardt, and P. Lenz, \"Synchronization, phase locking, and metachronal wave formation in ciliary\nchains,\" Chaos: An Interdisciplinary Journal of Nonlinear Science 18, 037128 (2008).\n[32] B. Qian, H. Jiang, D. A. Gagnon, K. S. Breuer, and T. R. Powers, \"Minimal model for synchronization induced by\nhydrodynamic interactions,\" Phys. Rev. E 80, 061919 (2009).\n[33] O. Reynolds, \"On the Theory of Lubrication and Its Application to Mr. Beauchamp Tower's Experiments, Including an\nExperimental Determination of the Viscosity of Olive Oil,\" Phil. Trans. R. Soc. Lond. 177, 157–234 (1886).\n[34] L. D. Landau and E. M. Lifshitz, Theory of Elasticity: Vol. 7 of Course of Theoretical Physics (Butterworth-Heineman,\n1986).\n\n\f"}