{"id": "http://arxiv.org/abs/0904.4099v2", "guidislink": true, "updated": "2011-02-09T02:47:10Z", "updated_parsed": [2011, 2, 9, 2, 47, 10, 2, 40, 0], "published": "2009-04-27T07:46:12Z", "published_parsed": [2009, 4, 27, 7, 46, 12, 0, 117, 0], "title": "Local Risk Decomposition for High-frequency Trading Systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1078%2C0904.0005%2C0904.2642%2C0904.4227%2C0904.4537%2C0904.1307%2C0904.4177%2C0904.3543%2C0904.3076%2C0904.3542%2C0904.2670%2C0904.2588%2C0904.2958%2C0904.4918%2C0904.2966%2C0904.1468%2C0904.3963%2C0904.2260%2C0904.1715%2C0904.1945%2C0904.2777%2C0904.4282%2C0904.1651%2C0904.1869%2C0904.4128%2C0904.2246%2C0904.2880%2C0904.3940%2C0904.4898%2C0904.1967%2C0904.2875%2C0904.1310%2C0904.0937%2C0904.4925%2C0904.4008%2C0904.3205%2C0904.4829%2C0904.3999%2C0904.4376%2C0904.4726%2C0904.1275%2C0904.2879%2C0904.2180%2C0904.1364%2C0904.4590%2C0904.1146%2C0904.1940%2C0904.3532%2C0904.1280%2C0904.1284%2C0904.0396%2C0904.3106%2C0904.3525%2C0904.1100%2C0904.0183%2C0904.2824%2C0904.3679%2C0904.1820%2C0904.0809%2C0904.3884%2C0904.1862%2C0904.0914%2C0904.4097%2C0904.3142%2C0904.1313%2C0904.3728%2C0904.2003%2C0904.4146%2C0904.0794%2C0904.1000%2C0904.1720%2C0904.3686%2C0904.4452%2C0904.4099%2C0904.1209%2C0904.2328%2C0904.4451%2C0904.2521%2C0904.4644%2C0904.2200%2C0904.0797%2C0904.3235%2C0904.0521%2C0904.0212%2C0904.3628%2C0904.0412%2C0904.3445%2C0904.1943%2C0904.4762%2C0904.3931%2C0904.0928%2C0904.3367%2C0904.0298%2C0904.0920%2C0904.1860%2C0904.0216%2C0904.2947%2C0904.2917%2C0904.4632%2C0904.3510%2C0904.0277&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Local Risk Decomposition for High-frequency Trading Systems"}, "summary": "In the present work we address the problem of evaluating the historical\nperformance of a trading strategy or a certain portfolio of assets. Common\nindicators such as the Sharpe ratio and the risk adjusted return have\nsignificant drawbacks. In particular, they are global indices, that is they do\nnot preserve any 'local' information about the performance dynamics either in\ntime or for a particular investment horizon. This information could be\nfundamental for practitioners as the past performance can be affected by the\nnon-stationarity of financial market. In order to highlight this feature, we\nintroduce the 'local risk decomposition' (LRD) formalism, where dynamical\ninformation about a strategy's performance is retained. This framework,\nmotivated by the multi-scaling techniques used in complex system theory, is\nparticularly suitable for high-frequency trading systems and can be applied\ninto problems of strategy optimization.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1078%2C0904.0005%2C0904.2642%2C0904.4227%2C0904.4537%2C0904.1307%2C0904.4177%2C0904.3543%2C0904.3076%2C0904.3542%2C0904.2670%2C0904.2588%2C0904.2958%2C0904.4918%2C0904.2966%2C0904.1468%2C0904.3963%2C0904.2260%2C0904.1715%2C0904.1945%2C0904.2777%2C0904.4282%2C0904.1651%2C0904.1869%2C0904.4128%2C0904.2246%2C0904.2880%2C0904.3940%2C0904.4898%2C0904.1967%2C0904.2875%2C0904.1310%2C0904.0937%2C0904.4925%2C0904.4008%2C0904.3205%2C0904.4829%2C0904.3999%2C0904.4376%2C0904.4726%2C0904.1275%2C0904.2879%2C0904.2180%2C0904.1364%2C0904.4590%2C0904.1146%2C0904.1940%2C0904.3532%2C0904.1280%2C0904.1284%2C0904.0396%2C0904.3106%2C0904.3525%2C0904.1100%2C0904.0183%2C0904.2824%2C0904.3679%2C0904.1820%2C0904.0809%2C0904.3884%2C0904.1862%2C0904.0914%2C0904.4097%2C0904.3142%2C0904.1313%2C0904.3728%2C0904.2003%2C0904.4146%2C0904.0794%2C0904.1000%2C0904.1720%2C0904.3686%2C0904.4452%2C0904.4099%2C0904.1209%2C0904.2328%2C0904.4451%2C0904.2521%2C0904.4644%2C0904.2200%2C0904.0797%2C0904.3235%2C0904.0521%2C0904.0212%2C0904.3628%2C0904.0412%2C0904.3445%2C0904.1943%2C0904.4762%2C0904.3931%2C0904.0928%2C0904.3367%2C0904.0298%2C0904.0920%2C0904.1860%2C0904.0216%2C0904.2947%2C0904.2917%2C0904.4632%2C0904.3510%2C0904.0277&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the present work we address the problem of evaluating the historical\nperformance of a trading strategy or a certain portfolio of assets. Common\nindicators such as the Sharpe ratio and the risk adjusted return have\nsignificant drawbacks. In particular, they are global indices, that is they do\nnot preserve any 'local' information about the performance dynamics either in\ntime or for a particular investment horizon. This information could be\nfundamental for practitioners as the past performance can be affected by the\nnon-stationarity of financial market. In order to highlight this feature, we\nintroduce the 'local risk decomposition' (LRD) formalism, where dynamical\ninformation about a strategy's performance is retained. This framework,\nmotivated by the multi-scaling techniques used in complex system theory, is\nparticularly suitable for high-frequency trading systems and can be applied\ninto problems of strategy optimization."}, "authors": ["M. Bartolozzi", "C. Mellen"], "author_detail": {"name": "C. Mellen"}, "author": "C. Mellen", "arxiv_comment": "12 pages and 4 figures", "links": [{"href": "http://arxiv.org/abs/0904.4099v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.4099v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-fin.RM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-fin.RM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-fin.TR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.4099v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.4099v2", "journal_reference": null, "doi": null, "fulltext": "September\n11,\nmultiscaleRiskSub\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\narXiv:0904.4099v2 [q-fin.RM] 9 Feb 2011\n\nc\n\nLocal Risk Decomposition for High-frequency Trading Systems\n\nM. Bartolozzi\nResearch Group, Boronia Capital, Sydney NSW 2065, Australia\nSpecial Research Centre for the Subatomic Structure of Matter (CSSM), University of Adelaide,\nAdelaide SA 5005, Australia\nmbartolo@physics.adelaide.edu.au\nC. Mellen\nResearch Group, Boronia Capital, Sydney NSW 2065, Australia\nchris.mellen@boroniacapital.com.au\nReceived (Day Month Year)\nRevised (Day Month Year)\nIn the present work we address the problem of evaluating the historical performance of a\ntrading strategy or a certain portfolio of assets. Common indicators such as the Sharpe\nratio and the risk adjusted return have significant drawbacks. In particular, they are\nglobal indices, that is they do not preserve any local information about the performance\ndynamics either in time or for a particular investment horizon. This information could\nbe fundamental for practitioners as the past performance can be affected by the nonstationarity of financial market. In order to highlight this feature, we introduce the local\nrisk decomposition (LRD) formalism, where dynamical information about a strategy's\nperformance is retained. This framework, motivated by the multi-scaling techniques used\nin complex system theory, is particularly suitable for high-frequency trading systems and\ncan be applied into problems of strategy optimization.\nKeywords: Financial Markets; Risk; Multi-scale Systems; Complex Systems.\n\n1. Introduction\nMeasuring the past performance of a trading system or a portfolio of assets is\none of the most important issues for financial practitioners and portfolio managers.\nEvaluating performances heavily depends on estimating \"risk\"a . In the past different\nmeasures has been proposed but there is no general agreement about which one is\nthe most robust estimator for the \"quality\" of a trading strategy [10].\nIn this paper, we contribute to the risk-adjusted performance measurement subject by introducing a two dimensional decomposition of the profit and loss series,\na The definition of \"risk\" can be subjective and, in fact, it does not exist a generally accepted\ndefinition. It is often associated with the fluctuation of returns around their mean value and thus\nto their standard deviation. However, fluctuation towards positive returns may not be considered\na form of risk. Therefore, one sided definitions of standard deviation are also used by practitioners.\nFor general references on the subject the reader is referred to [10, 2, 23].\n\n1\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n2\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nM. Bartolozzi and C. Mellen\n\nPandL, of a trading strategy. Based on this decomposition we can define a set of local\nperformance indicators, where \"local\" refers to both time and investment horizon.\nGlobal indicators are then obtained via the convolution of the decomposed signal\nwith user-specified kernels. The choice of the kernels, as well as their parameters,\ncan highlight specific features of the trading dynamics.\nThe relevance of this multi-scale framework, originally developed in physics for\nthe study of complex system [6, 29, 31], in the contest of risk-adjusted measures is\njustified by the possible non-stationarity of the trading performances. In fact, it is\na well known fact that some strategies work well just under some specific market\ncondition or for a limited period of time when the related arbitrage inefficiency has\nnot extensively exploited yet.\nThe issue of stability in performance metrics when facing non-stationary returns\nhas been also addressed in econometric literature, with particular emphasis on the\nSharpe ratio [27], where different nonparametric methods have been proposed in\norder to give more \"stable\" estimates, see [11, 24, 32, 19] for example. Our approach\ndiffers from the formers in many respects. Firstly, we do not introduce a new specific\nrisk-adjusted measure but rather a framework where to apply the already existing\nones. Secondly, the risk associated with a strategy is not only considered as time\ndependent but also as \"scale\" dependent. Lastly, the fluctuations related to the risk\nperformance are estimated around local trends in order to remove any possible bias\ndue to some particular market condition during the period under consideration.\nThe paper is structured as following: in the next section we briefly introduce\nsome standard indicators and point out their drawbacks. In Sec. 3 we introduce\nour local risk decomposition, LRD, while in Sec. 4 we apply the method to the\nperformance of different trading systems and we highlight the advantages of using\nthe LRD method if compared to standard indicators. Discussions and conclusions\nare left for the last section.\n2. Risk performance measures\nThe performance of a trading strategy are characterized by two key quantities: the\ncumulative return over time, represented by the PandL time series, and the risk\nincurred in using it. While it is intuitive to associate profitability with the goodness\nof a trading strategy, high profits can be due to lucky trades or temporary favorable\nmarket conditions. This is the reason why investors tend to monitor the performance\nof their trading systems in time in order to recognize a possible deterioration in\ntheir strategy. The risk-adjusted performance measures proposed in literature, see\nfor example [10], attempt to assert the quality of a trading system by assuming\nthat an investor will make his/her decision based not only on the past returns but\nalso on their fluctuations. Clearly the \"amplitude\" of fluctuations that a trader\ncan tolerate depends on his/her personal appetite for risk and is thus subjective.\nHowever, investors tend to be risk adverse and, in practice, a trading strategy in\norder to be \"acceptable\" will have to display not only a good annualized profit but\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nLocal Risk Decomposition for High-frequency Trading Systems\n\n3\n\nalso a smooth cumulative return or PandL. In other words, the risk related to the\nfluctuation around the average return has to be small.\nOne of the most popular risk performance measures used in finance is the Sharpe\nratio [27], defined as\nhri\n,\n(2.1)\nσr\nwhere hri is the\nis its standard deviation. The annualization\n√ average return and σr √\nfactor, A, is 252 for daily returns or 12 for monthly. The Sharpe ratio, despite\nbeing widely used, has two notable drawbacks [10] among which\nS=A\n\n(1) It is numerically unstable for small values of σr ,\n(2) It does not reveal any information about the dynamics of the returns.\nThe last point is of central interest in the present work. In fact, since the highfrequency dynamics of the stock market is not stationary in time [3, 5, 4], the\nperformance of trading systems can be subjected to similar trendsb .\nAnother widely used performance measure is the risk adjusted return, defined\nas\nRβ = hri − β σr .\n\n(2.2)\n\nThis indicator, derived from utility theory [10, 2], is not affected by numerical singularities. However, it depends on the subjective risk strength factor, β. Furthermore,\nalong with the Sharpe ratio, it does not reveal any information about the evolution\nof the PandL.\nIn the next section we introduce a multi-scale framework for estimating a riskadjusted performance measure based on recent work in complex system theory [29].\nThis framework, while employing elementary block measures similar to Eqs. (2.1)\nand (2.2), also retains time and horizon information which can be fundamental in\na strategy selection problem.\n3. The Local Risk Decomposition\nIn order to tackle the problem of non-stationarity of the performance of market\nstrategies, we introduce the Local Risk Decomposition (LRD). The underlying idea\nof this method is to extrapolate a risk measure based on the local fluctuations of\nthe PandL, both in time and scale (or investment horizon). This concept is similar\nto the detrended fluctuation analysis, recently proposed to extract correlations from\nnon-stationary time series in the context of DNA nucleotides sequences [26], and\nsuccessively applied in finance by several authors [8, 20, 30, 21, 17, 14, 13, 25, 22,\n9, 15, 16, 12, 5].\nThe LRD method works as follows:\nb Frequently, trading strategies outperform some benchmark during a period of time by exploiting\ntemporary inefficiencies. Once these inefficiencies are dissipated the performances of a trading\nstrategy tend to deteriorate along.\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n4\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nM. Bartolozzi and C. Mellen\n\n(1) The PandL time series, which for high-frequency trading we can reasonably\nassume to be daily updatedc , x(k) where k = 1, ..., N , is divided into M =\nN/h non-overlapping boxes of equal sample size h, corresponding to different\ninvestment horizons. In our notation xih (k̄), given i = 1, ..., M and k̄ = (i−1)h+\n1, ..., ih, represents the PandL of the strategy under consideration associated\nwith the ith box of length h.\n(2) For each box, first we perform a linear fit (that is, we look for the local trend)\nof the PandL, yhi (k), as well as the fluctuations around it,\nv\nu\nih\nu1\nX\nu\ni\n(xih (k̄) − yhi (k̄))2 .\n(3.1)\nσ̃h = t\nh\nk̄=(i−1)h+1\n\nwhich we take as the local risk. The difference between the first and last point\nof the fit represents the local return, r̃hi = yhi (ih) − yhi ((i − 1)h + 1), at scale h\nfor the ith box.\n(3) The procedure of points (1) and (2) is iterated over different investment horizons\nh, in order to compare how the trading performance changes at different scales.\nIt is worth noting that our measures defined above, r̃hi and σ̃hi , are local both\nin time and scale. Furthermore, the decision of taking the extremes of the fit as a\nmeasure of the local return is to avoid overestimating outliers of returns that may\nnot give a fair value to the strategy under exam.\nThe next step involves the definition of the local performance measures. In\nanalogy with Eqs. (2.1) and (2.2), we define the local Sharpe ratio (LSR) as\nShi =\n\nr̃hi\n,\nσ̃hi\n\n(3.2)\n\nand the local risk adjusted return (LRA) as\nRhi = r̃hi − βφh σ̃hi ,\n\n(3.3)\n\nwhere β is the risk aversion of the trader (equivalent to the β in Eq. (2.2)) and φh\nis a scaling factor, defined as\nφh =\n\nhr̃hi iM\n.\nhσ̃hi iM\n\n(3.4)\n\nNow we have two dimensional representations of performance measures that are\nlocalized both in time and investment horizon. It is important to underline at this\nstage that despite their similarities, the measures proposed in Eqs. (3.2) and (3.3)\nare not equivalent to those in Eqs. (2.1) and (2.2).\nIn the next section we apply our LRD to PandL curves generated by different\ntrading strategies.\nc Note\n\nthat in high-frequency trading there is no reason for the PandL not to be updated intra-day\nor in a per-trade basis.\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nLocal Risk Decomposition for High-frequency Trading Systems\n\n5\n\n4. Local Risk Decomposition in trading systems: applications\nNow we consider two examples of the LRD when applied to PandL time series\ngenerated by different strategies. In particular, the first time series, Fig. 1 (top),\nshows relatively stationary performance over the period under consideration, with\nthe exception of two \"bumps\" in the middle of 2007 and at the beginning of 2008.\nThese \"bumps\" are highlighted as a valley and a peak in the LRD, as it can be seen\nin the contour plots for the LRA (Fig. 1, middle-right, β = 0.75) and for the LSR\n(Fig. 1, bottom-right). The second time series, instead, Fig. 2 (top), is more volatile\nif compared to the first: we have good performances up to the end of 2006 when\nsuddenly the system starts to lose money. However, at the end of 2007 a comeback\nis observed. Both LRA, (Fig. 2, middle-right, β = 0.75), and LSR, (Fig. 2, bottomright), capture this dynamics very faithfully: a deep valley followed by an high peak\ncan be observed in the last part of the time series. The LRD framework, therefore,\nallows the practitioner to identify and stress easily specific periods in time as well\nas specific investment horizons that have been particularly significant during the\nlife (or testing) of a trading system.\nIt is important to notice that LRA and LSR magnify differently the features of\nthe time series presented in the former examples. This fact is due related to the\ninvestor's particular appetite for risk, parameterized by β and fixed to 0.75 in Figs. 1\nand 2, that appears in the LRA. An aggressive trader would give more importance\nto the returns than to their fluctuations and, therefore, β ≈ 0. By contrast, a risk\nadverse trader highlights the fluctuations, so to have β ≈ 1. Examples of the LRA\nresponse to different sensitivities are shown in Fig. 3 for the first time series.\n\n5. Extracting performance indices from the LRD\nIn the previous section, we introduced a framework to estimate local risk measures\nfrom the PandL of a trading strategy. The complete time/scale decomposition,\ndespite being a faithful representation of the PandL's dynamics, as well as visually\nappealing, can be cumbersome to use in practical applications, such as algorithms\nfor strategies optimization. It is, therefore, of interest to derive a single performance\nindicator from the information provided by the LRD.\nThe advantage of having a LRD of the PandL signal lies in the possibility to\n\"customize\" the final indicator according to the user's specific need. In other words,\ndifferent traders may focus on different investment horizons or could be more interested in limited periods of time characterized by specific market condition: these\npreferences can be encoded in the integration of the LRD. In fact, for a generic local performance measure, f , (LRA or LSR, for example) we define our indicator as\nthe convolution of this quantity with time/scale kernels over the ranges of interest\nas, for instance, from T0 to T for time and from hmin to hmax for the investment\nhorizon. In order to ease the notation, we assume a continuous decomposition for\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n6\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nM. Bartolozzi and C. Mellen\n\n5\n\n5\n\nx 10\n\n2\n\n2\n\n1.5\n\n1.5\n\nPandL\n\nPandL\n\nx 10\n\n1\n0.5\n\n0\n\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Return\n\nScale (Log days)\n\nScale (Log days)\n\n0\n\n1\n0.5\n\n6\n5\n4\n3\n\n6\n5\n4\n3\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Sharpe Ratio\n\nScale (Log days)\n\nScale (Log days)\n\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Risk\n6\n5\n4\n3\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\n\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Risk Adjusted\n\n6\n5\n4\n3\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\n\nFig. 1. The two top plots are the same daily PandL generated by a certain trading strategy. The\ntime series is shown twice in order to ease the comparison with the LRD contour plots reported\nunderneath. On the right-hand side, we report the LRA (middle-right, β = 0.75) and the LSR\n(bottom-right). Both representations capture the \"bumps\" observed in 2007 and 2008. On the\ni , (middle) and the local risk, σ̃ i ,\nleft-hand side, for completeness, we show the local return, r̃h\nh\n(bottom). The contour scale goes from the dark colors for the minima to the light ones for the\nmaxima.\n\nthe PandL , that is i → t and h → s, and we define an LRD indicator as\nR hmax\nds Ks ( s−ρ\nδs ) ηf (τ, s)\nf\n,\nΦτ,ρ = hmin\nR hmax\nds Ks ( s−ρ\nδs )\nhmin\n\n(5.1)\n\nwhere\nηf (τ, s) =\n\nRT\n\nT0\n\ndt Kt ( t−τ\nδt ) f (t, s)\n,\nRT\ndt Kt ( t−τ\nδt )\nT0\n\n(5.2)\n\nbeing Ks and Kt convolution kernels, ρ and τ representing the \"principal\" investment horizon and time while δt and δs are dilatation coefficients [28]. These\nparameters can be tuned for different investor's requirements, making the method\nparticularly flexible. For example, by using hard kernels such as the Heaviside function, it is possible to cut the contribution of the performance beyond some specified\nlook-back period. Otherwise, if it is preferred to give a weight to whole the historical\nperformance of the trading strategy, a Gaussian kernel would be suitable.\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nLocal Risk Decomposition for High-frequency Trading Systems\n\n4\n\n4\n\nx 10\n4\n\n2\n\n2\n\nPandL\n\nPandL\n\nx 10\n4\n\n0\n−2\n\n0\n−2\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Risk Adjusted\n\nScale (Log days)\n\nScale (Log days)\n\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Return\n6\n5\n4\n3\n\n6\n5\n4\n3\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Sharpe Ratio\n\nScale (Log days)\n\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\nLocal Risk\n\nScale (Log days)\n\n7\n\n6\n5\n4\n3\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\n\n6\n5\n4\n3\n2005.5 2006 2006.5 2007 2007.5 2008\nTime\n\nFig. 2. The plots are equivalent to those in Fig. 1 but for a different trading system. The performance, in this case, starts being relatively volatile from the middle of 2006. This change in\ndynamics is encoded, with different emphasis, by the LRA (β = 0.75) and the LSR measures.\n\nIn order to underline the flexibility of our indicator Φfτ,ρ , we perform a numerical test on two artificial PandL time series for different choices of the parameters\nin Eqs. (5.1) and (5.2). We restrict the range of choices by fixing τ = max(t),\nsince investors tend to give more importance on the recent performance of their\nstrategies. The dilatation coefficients are selected according to: δs = 100ρ and\nδt = [max(t) − min(t)] /4. The errors on the estimates have been calculated via the\njacknife method [18] and indicated between brackets as uncertainty in the last digit.\nThe LRD of two artificially generated PandL, each with 2000 data points, with\ndifferent linear drifts as well as a different superimposed noise amplitude, is shown in\nFig. 4. The first time series (blue) provides a better return at the expenses of higher\nvolatility. The second time series (green), in contrast, exhibits a relatively stable\ngrowth. Despite the intrinsic differences, the annualized Sharpe ratio, Eq.(2.1), results to be the same for the two time series, namely S = 0.7(2), making them look\nequivalent from its prospective. On the other hand, the LRD framework gives a much\nbroader picture regarding the performances of the two time series. The results are\nsummarized in Table 1 and Table 2. In the first one, we report for different principal\ninvestment horizons, ρ, the values of ΦLRA\nand ΦLSR\nτ,ρ\nτ,ρ for the two trading systems\nwhen a uniform kernel is used, Kr ≡ Kt ≡ 1. In the second table, instead, we show\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n8\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nM. Bartolozzi and C. Mellen\n\n5\n\nPandL\n\nx 10\n2\n1\n\nScale (Log days)\n\nScale (Log days)\n\nScale (Log days)\n\n0\n\n2005.5\n\n2006\n\n2006.5\n2007\nTime\nLocal Risk Adjusted β::0.3\n\n2007.5\n\n2008\n\n2005.5\n\n2006\n\n2006.5\n2007\nTime\nLocal Risk Adjusted β::0.6\n\n2007.5\n\n2008\n\n2005.5\n\n2006\n\n2006.5\n2007\nTime\nLocal Risk Adjusted β::1\n\n2007.5\n\n2008\n\n2005.5\n\n2006\n\n2007.5\n\n2008\n\n6\n4\n\n6\n4\n\n6\n4\n2006.5\nTime\n\n2007\n\nFig. 3. Different contour plots of the LRA related to the PandL time series of Fig. 1 (top). The\ndifferent values of β (0.3, 0.6 and 1 from top to bottom) smooth or emphasize volatile periods\naccording to the different appetite for risk chosen by the investor.\n\nthe same results for Gaussian kernels. We also report the values of ηLRA (τ, s) and\nηLSR (τ, s) at the scale of main interest, that is for s ≡ ρ. The reason behind this\nis that these two quantities, which are nothing but kernel weighted averages of a\nrisk-adjusted performance, f , over time being the scale s fixed, Eq.(5.2), can be\nconsidered as further performance indicator when the strategy has a characteristic\ntime scale (holding period), ρ in this cased .\nThe results show that when we do not apply any convolution kernel, Table 1,\nthe performance indicators ΦLRA\nand ΦLSR\nwould pick the blue strategy, that\nτ,ρ\nτ,ρ\nis, the one with the highest return, as the best out of the two. However, if we\nconsider the indicator at a specific investment horizon ρ, that is ηLRA (τ, ρ) and\nηLSR (τ, ρ), the situation is not as clear. On the other hand, when the indicators\nare extracted via two Gaussian kernels centered in the last day of trade and at the\nhorizon ρ, explicitly giving more importance to a particular time/scale region, the\nbest performing system would be the green one. This result is due to the fact that\nthe blue strategy is not performing well in the last period of the PandL series where\nthe time kernel is centerede . This simple example highlights the flexibility of the\nd In the discrete algorithm described in Sec. 3 the weighted average would be over the M riskadjusted measures estimated over the boxes of length h.\ne It is also worth to notice that the differences between the estimates of the risk-performance\nmeasures discussed in this paragraph are significant based on the error estimates, obtained via the\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nLocal Risk Decomposition for High-frequency Trading Systems\n\nPandL\n\nPandL\n\n400\n200\n\n400\n200\n\n0\n\n0\n500\n\n1000\n1500\nTime\nLocal Risk Adjusted (Blue System)\n\n0\n\nScale (Log days)\n\nScale (Log days)\n\n0\n\n7\n6\n5\n4\n3\n\n5\n4\n3\n500\n\n1000\n1500\nTime\nLocal Sharpe Ratio (Green System)\n\nScale (Log days)\n\n6\n5\n4\n3\n500\n\n1000\nTime\n\n1000\n1500\nTime\nLocal Risk Adjusted (Green System)\n\n6\n\n1000\n1500\nTime\nLocal Sharpe Ratio (Blue System)\n7\n\n500\n\n7\n\n500\n\nScale (Log days)\n\n9\n\n7\n6\n5\n4\n3\n\n1500\n\n500\n\n1000\nTime\n\n1500\n\nFig. 4. LRD for two simulated PandL . The left hand side corresponds to the blue time series and\nthe right hand side to the green. The noise amplitude for the blue time series is 1.5 times the green\none. The Sharpe ratio, calculated via Eq. (2.1) is 0.7(2) for both time series and, therefore, they\nare undistinguishable according to this performance indicator. For the LRA we used β = 0.75.\n\nLRD framework when compared to global quantities such as the Sharpe ratio which\nignore the dynamics of the performance.\n\nTable 1. The values for ΦLRA\nand ΦLSR\nalong with ηLRA (τ, ρ) and ηLSR (τ, ρ) for different ρ. The values\nτ,ρ\nτ,ρ\non the left refer to the first time series (blue) in Fig. 4, while the values on the right refer to the second time\nseries (green). The kernel used for the integration of Eq. (5.1) is uniform with Kr ≡ Kt ≡ 1. The LRA has\nbeen normalized by its standard deviation over the time/scale boxes. This procedure is not fundamental for\nasserting the performances of a strategy. In brackets is the error of the last digit calculated via the jacknife\nmethod.\n\nΦLRA\nτ,ρ\nΦLSR\nτ,ρ\nηLRA (τ, ρ)\nηLSR (τ, ρ)\n\nρ = 50\n\nρ = 100\n\nρ = 250\n\nρ = 500\n\nρ = 1000\n\n0.36(1)/0.34(1)\n2.71(7)/2.4(1)\n0.018(6)/0.02(1)\n0.5(2)/0.5(2)\n\n0.36(1)/0.34(1)\n2.71(8)/2.4(1)\n0.040(4)/0.04(1)\n0.64(8)/0.6(2)\n\n0.364(9)/0.34(1)\n2.7(1)/2.37(9)\n0.05(1)/0.097(9)\n0.5(1)/0.9(2)\n\n0.36(1)/0.34(1)\n2.71(6)/2.37(9)\n0.23(1)/0.33(2)\n1.53(9)/2.2(2)\n\n0.36(1)/0.34(1)\n2.7(1)/2.4(9)\n0.42(2)/0.51(2)\n2.19(6)/2.6(1)\n\njacknife method, reported in the same tables.\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n10\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nM. Bartolozzi and C. Mellen\n\nTable 2. Same as Table 1 but using two Gaussian kernels in Eqs. (5.1)-(5.2). For the calculation, τ = max(t) while\nδs = 100ρ, and δt = [max(t) − min(t)] /4.\n\nΦLRA\nτ,ρ\nΦLSR\nτ,ρ\nηLRA (τ, ρ)\nηLSR (τ, ρ)\n\nρ = 50\n\nρ = 100\n\nρ = 250\n\nρ = 500\n\nρ = 1000\n\n−0.12(2)/0.21(2)\n1.60(6)/1.9(1)\n0.00(2)/0.017(9)\n0.4(1)/0.3(1)\n\n−0.12(2)/0.21(4)\n1.63(6)/1.9(2)\n−0.12(3)/ − 0.03(3)\n−0.1(2)/0.2(3)\n\n−0.11(2)/0.21(4)\n1.64(5)/1.9(1)\n0.13(7)/ − 0.02(7)\n0.1(1)/0.6(1)\n\n−0.11(1)/0.22(4)\n1.64(4)/1.9(1)\n−0.58(3)/0.2(1)\n0.1(1)/2.5(3)\n\n−0.11(2)/0.22(3)\n1.64(8)/1.9(1)\n0.02(5)/0.43(2)\n1.72(9)/2.5(1)\n\nAs for more traditional indicators, the LDR framework can be used in the contest of investment optimization. In high-frequency trading, for example, a typical\nproblem could be how to distribute the capital allocation among several different\nindependent trading strategies applied over the same contractf . In this case the\nweight vector is determined via an optimization procedure of one or more of the\nrisk-adjusted measures, the target variables, estimated from the PandL curves obtained in the backtesting. In this contest, the use of the LRD as target variable can\nbe interpreted as a \"weighted\" optimization where more emphasis can be placed, for\nexample, on the last performance period and on a characteristic time scale associated with the strategies in question. For some more detailed discussions on trading\nstrategies optimization in the high-frequency space, which goes beyond the scope\nof this work, the interested reader can refer to [7, 1].\n6. Discussion and conclusions\nIn the present paper we have introduced a local risk decomposition framework\nthat retains dynamical information about the performance of a trading strategy.\nThis framework is very useful for practitioners who work at high-frequencies as it\nprovides a map of the non-stationarity and multiscale features of the PandL time\nseries. Moreover, from the LRD it is possible to construct a single indicator for\nthe performance of the trading system, as shown in Sec. 5. The advantage of this\nindicator when compared to more traditional ones, such as the Sharpe ratio for\nexample, lies in the fact that the user can choose to put more emphasis on some\nperiod in time or some specific investment horizons according to his/her preference.\nIt is also important to stress the local detrending procedure in the risk estimate\nwhich we have used in order to take into account for the possible non-stationarity\nof the time series.\nOn the other hand, in order to have a reliable estimation of the dynamics at\ndifferent scales, the LRD requires a reasonable amount of samples in the PandL.\nThis drawback makes the LRD more suitable for high/medium frequency trading\nf Usually\n\nhigh-frequency strategies have a relatively small volume capacity for each single contact\ngiven that they rely on a market impact close to zero at any moment in time. One way to get\naround this issue and push more volume into the market is to scale up the number of trading\nstrategies and, effectively, to build a portfolio of them.\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nREFERENCES\n\n11\n\nsystems rather than log term ones.\nIn conclusion, the LRD framework can be a useful alternative to more traditional risk-adjusted performance indicators and, consequently, it can be applied to\noptimization problems such as the creation of a portfolio of different high-frequency\ntrading systems.\nAcknowledgement\nThe authors would like to thank Richard Grinham and David Fussell for a careful\nreading of the manuscript.\nReferences\n[1] Irene Aldridge. High-frequency trading: a practical guide to algorithmic strategies and trading systems. Wiley & Sons, New Jersey, 2010.\n[2] Roy E. Bailey. The economics of financial markets. Cambridge University\nPress, Cambridge, UK, 2005.\n[3] Marco Bartolozzi, Derek B. Leinweber, and Anthony W. Thomas. Scale-free\navalanche dynamics in the stock market. Physica A, 370:132–139, 2006.\n[4] Marco Bartolozzi, Christopher Mellen, Francis Chan, David Oliver, Tiziana\nDi Matteo, and Tomaso Aste. Applications of physical methods in highfrequency futures markets. Proc. of SPIE, 6802:680203, 2007.\n[5] Marco Bartolozzi, Christopher Mellen, Tiziana Di Matteo, and Tomaso Aste.\nMulti-scale correlations in different futures markets. The European Physical\nJournal B, 58(2):207–220, 2007.\n[6] J.-P. Bouchaud and M. Potters. Theory of financial risk. Cambridge University\nPress, Cambridge, 1999.\n[7] Ernest P. Chan. Quantitative Trading. Wiley & Sons, New Jersey, 2009.\n[8] Liu Y.H. Cizeau, P. and, M. Meyer, K.C. Peng, and H.E. Stanley. Volatility\ndistribution in the s&p stock index. Physica A, 245:441–445, 1997.\n[9] R.L. Costa and G.L. Vasconcelos. Long-range correlations and nonstationarity\nin the brazilian stock market. Physica A, 329:231–248, 2003.\n[10] Michael M. Dacorogna, Ramazan Gençay, Ulrich Müller, Richard B. Olsen,\nand Olivier V. Pictet. An introduction to high-frequency finance. Academic\nPress, San Diego, 2001.\n[11] Kevin Dowd. Adjusting for risk: an improved sharpe ratio. International\nReview of Economics and Finance, 9:209–222, 2004.\n[12] Z. Eisler and J. Kertész. Liquidity and the multiscaling properties of the volume\ntraded on the stock market. Europhys. Lett., 77:28001, 2007.\n[13] P. Gopikrishnan, V. Plerou, X. Gabaix, L.A.N. Amaral, and H.E. Stanley. Price\nfluctuations and market activity. Physica A, 299:137–143, 2001.\n[14] P. Gopikrishnan, V. Plerou, Y.H. Liu, Gabaix X. Amaral, L.A.N. and, and H.E.\nStanley. Scaling and correlation in financial time series. Physica A, 287:362–\n373, 2000.\n\n\fSeptember\n11,\nmultiscaleRiskSub\n\n12\n\n2018 4:40 WSPC/INSTRUCTION\n\nFILE\n\nREFERENCES\n\n[15] D. Grech and Z. Mazur. Can one make any crash prediction in finance using\nthe local hurst exponent idea? Physica A, 336:113–145, 2004.\n[16] Plamen Ch. Ivanov, Ainslie Yuen, Boris Podobnik, and Youngki Lee. Common\nscaling patterns in intertrade times of u.s. stocks. Phys. Rev. E, 69:56107, 2004.\n[17] I.M. Jánosi, B. Janecskó, and I. Kondor. Statistical analysis of 5 s index data\nof the budapest stock exchange. Physica A, 269:111–124, 1999.\n[18] H. R. Kunsch. The jacknife and the bootstrap for general stationary observations. The Annals of Statistics, 17:1217–1241, 1989.\n[19] Oliver Ledoit and Michael Wolf. Robust performance hypotesis testing with\nthe sharpe ratio. Journal of Empirical Finance, 15:850–859, 2008.\n[20] Y.H. Liu, P. Cizeau, M. Meyer, K.C. Peng, and H.E. Stanley. Scaling behavior\nin economic time series. Physica A, 245:437–440, 1997.\n[21] Y.H. Liu, P. Gopikrishnan, P. Cizeau, M. Meyer, K.C. Peng, and H.E. Stanley.\nThe statistical properties of the volatility price fluctuations. Phys. Rev. E,\n60:1390–1400, 1990.\n[22] K. Matia, L.A.N. Amaral, S.P. Goodwin, and H.E. Stanley. Different scaling\nbehaviors of commodity spot and future prices. Phys. Rev. E, 66:045103(R),\n2002.\n[23] Attilio Meucci. Risk and Asset Allocation (third edition). Springer, Berlin,\n2007.\n[24] D. Mukherjee and A. Ullah. Nonparametric sharpe ratio. Journal of Quantitative Economics, 2(2):172–185, 2004.\n[25] S.V. Muniandy, S.C. Lim, and R. Murugan. Inhomogeneous scaling behaviors\nin malaysian foreign currency exchange rates. Physica A, 301:407–428, 2001.\n[26] C.-K. Peng, S. V. Buldyrev, S. Havlin, M. Simons, H. E. Stanley, and A. L.\nGoldberger. Mosaic organization of DNA nucleotides. Physical Review E,\n49(2):1685–1689, Feb 1994.\n[27] W.F. Sharpe. The sharpe ratio. Journal of Portfolio Managment, 21:49–59,\n1994.\n[28] B.W. Silverman. Density estimation for statistics and data analysis. ChapmanHall, London, 1996.\n[29] Didier Sornette. Critical phenomena in natural sciences. Springer-Verlag,\nBerlin, 2004.\n[30] N. Vandewalle and M. Ausloos. Coherent and random sequences in financial\nfluctuations. Physica A, 246:454–459, 1997.\n[31] Johannes Voit. The Statistical Mechanics of Financial Markets. Spriger-Verlag,\nBerlin, 2005.\n[32] Peter Woehrmann, Willy Semmler, and Martin Lettau. Nonparametric estimation of time-varying sharpe ratio in dynamic asset pricing models. Working\npaper 225, Institute for Empirical Research in Economics University of Zurich,\n2005.\n\n\f"}