{"id": "http://arxiv.org/abs/0809.3393v1", "guidislink": true, "updated": "2008-09-19T14:51:35Z", "updated_parsed": [2008, 9, 19, 14, 51, 35, 4, 263, 0], "published": "2008-09-19T14:51:35Z", "published_parsed": [2008, 9, 19, 14, 51, 35, 4, 263, 0], "title": "Combined microstructural and magneto optical study of current flow in\n  polycrystalline forms of Nd and Sm Fe-oxypnictides", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.0345%2C0809.1035%2C0809.1722%2C0809.5040%2C0809.4294%2C0809.3860%2C0809.1616%2C0809.3717%2C0809.5266%2C0809.2192%2C0809.3814%2C0809.3270%2C0809.0360%2C0809.3055%2C0809.2204%2C0809.4771%2C0809.4615%2C0809.1579%2C0809.2340%2C0809.3393%2C0809.2900%2C0809.3727%2C0809.2814%2C0809.3954%2C0809.5117%2C0809.3654%2C0809.2162%2C0809.4078%2C0809.4432%2C0809.1118%2C0809.3011%2C0809.0718%2C0809.3856%2C0809.4627%2C0809.1264%2C0809.1074%2C0809.1569%2C0809.1819%2C0809.4540%2C0809.1539%2C0809.5015%2C0809.0803%2C0809.2270%2C0809.0898%2C0809.1668%2C0809.3592%2C0809.3912%2C0809.4581%2C0809.2808%2C0809.2680%2C0809.4203%2C0809.4894%2C0809.3806%2C0809.5039%2C0809.2499%2C0809.3456%2C0809.3579%2C0809.1779%2C0809.3754%2C0809.0902%2C0809.4442%2C0809.0930%2C0809.3577%2C0809.1409%2C0809.2387%2C0809.0071%2C0809.3389%2C0809.2172%2C0809.1063%2C0809.3209%2C0809.5105%2C0809.1288%2C0809.4019%2C0809.4490%2C0809.1134%2C0809.4817%2C0809.1766%2C0809.2516%2C0809.4529%2C0809.0204%2C0809.2190%2C0809.2793%2C0809.1562%2C0809.2001%2C0809.3033%2C0809.3300%2C0809.0831%2C0809.2057%2C0809.2188%2C0809.3388%2C0809.3012%2C0809.4489%2C0809.3738%2C0809.4986%2C0809.2481%2C0809.0186%2C0809.2532%2C0809.1021%2C0809.2693%2C0809.0266%2C0809.1834&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Combined microstructural and magneto optical study of current flow in\n  polycrystalline forms of Nd and Sm Fe-oxypnictides"}, "summary": "In order to understand why the inter- and intra-granular current densities of\npolycrystalline superconducting oxypnictides differ by three orders of\nmagnitude, we have conducted combined magneto-optical and microstructural\nexaminations of representative randomly oriented polycrystalline Nd and Sm\nsingle-layer oxypnictides. Magneto optical images show that the highest Jc\nvalues are observed within single grains oriented with their c axes\nperpendicular to the observation plane, implying that the intragranular current\nis anisotropic. The much lower intergranular Jc is at least partially due to\nmany extrinsic factors, because cracks and a ubiquitous wetting As-Fe phase are\nfound at many grain boundaries. However, some grain boundaries are structurally\nclean under high resolution transmission electron microscopy examination.\nBecause the whole-sample global Jc(5K) values of the two samples examined are\n1000-4000 A/cm2, some 10-40 times that found in random, polycrystalline\nYBa2Cu3O7-x, it appears that the dominant obstruction to intergranular current\nflow of many present samples is extrinsic, though some intrinsic limitation of\ncurrent flow across grain boundaries cannot yet be ruled out.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0809.0345%2C0809.1035%2C0809.1722%2C0809.5040%2C0809.4294%2C0809.3860%2C0809.1616%2C0809.3717%2C0809.5266%2C0809.2192%2C0809.3814%2C0809.3270%2C0809.0360%2C0809.3055%2C0809.2204%2C0809.4771%2C0809.4615%2C0809.1579%2C0809.2340%2C0809.3393%2C0809.2900%2C0809.3727%2C0809.2814%2C0809.3954%2C0809.5117%2C0809.3654%2C0809.2162%2C0809.4078%2C0809.4432%2C0809.1118%2C0809.3011%2C0809.0718%2C0809.3856%2C0809.4627%2C0809.1264%2C0809.1074%2C0809.1569%2C0809.1819%2C0809.4540%2C0809.1539%2C0809.5015%2C0809.0803%2C0809.2270%2C0809.0898%2C0809.1668%2C0809.3592%2C0809.3912%2C0809.4581%2C0809.2808%2C0809.2680%2C0809.4203%2C0809.4894%2C0809.3806%2C0809.5039%2C0809.2499%2C0809.3456%2C0809.3579%2C0809.1779%2C0809.3754%2C0809.0902%2C0809.4442%2C0809.0930%2C0809.3577%2C0809.1409%2C0809.2387%2C0809.0071%2C0809.3389%2C0809.2172%2C0809.1063%2C0809.3209%2C0809.5105%2C0809.1288%2C0809.4019%2C0809.4490%2C0809.1134%2C0809.4817%2C0809.1766%2C0809.2516%2C0809.4529%2C0809.0204%2C0809.2190%2C0809.2793%2C0809.1562%2C0809.2001%2C0809.3033%2C0809.3300%2C0809.0831%2C0809.2057%2C0809.2188%2C0809.3388%2C0809.3012%2C0809.4489%2C0809.3738%2C0809.4986%2C0809.2481%2C0809.0186%2C0809.2532%2C0809.1021%2C0809.2693%2C0809.0266%2C0809.1834&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In order to understand why the inter- and intra-granular current densities of\npolycrystalline superconducting oxypnictides differ by three orders of\nmagnitude, we have conducted combined magneto-optical and microstructural\nexaminations of representative randomly oriented polycrystalline Nd and Sm\nsingle-layer oxypnictides. Magneto optical images show that the highest Jc\nvalues are observed within single grains oriented with their c axes\nperpendicular to the observation plane, implying that the intragranular current\nis anisotropic. The much lower intergranular Jc is at least partially due to\nmany extrinsic factors, because cracks and a ubiquitous wetting As-Fe phase are\nfound at many grain boundaries. However, some grain boundaries are structurally\nclean under high resolution transmission electron microscopy examination.\nBecause the whole-sample global Jc(5K) values of the two samples examined are\n1000-4000 A/cm2, some 10-40 times that found in random, polycrystalline\nYBa2Cu3O7-x, it appears that the dominant obstruction to intergranular current\nflow of many present samples is extrinsic, though some intrinsic limitation of\ncurrent flow across grain boundaries cannot yet be ruled out."}, "authors": ["F. Kametani", "A. A. Polyanskii", "A. Yamamoto", "J. Jiang", "E. E. Hellstrom", "A. Gurevich", "D. C. Larbalestier", "Z. A. Ren", "J. Yang", "X. L. Dong", "W. Lu", "Z. X. Zhao"], "author_detail": {"name": "Z. X. Zhao"}, "author": "Z. X. Zhao", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-2048/22/1/015010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0809.3393v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0809.3393v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to SUST", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0809.3393v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0809.3393v1", "journal_reference": null, "doi": "10.1088/0953-2048/22/1/015010", "fulltext": "Combined microstructural and magneto optical study of current flow in\npolycrystalline forms of Nd and Sm Fe-oxypnictides\nFumitake Kametani, A. A. Polyanskii, A. Yamamoto, J. Jiang, E. E. Hellstrom, A.\nGurevich and D. C. Larbalestier\nApplied Superconductivity Center, National High Magnetic Field Laboratory, Florida\nState University, Tallahassee FL 32310, USA\nZ. A. Ren, J. Yang, X. L. Dong, W. Lu and Z. X. Zhao\nNational Laboratory for Superconductivity, Institute of Physics and Beijing National\nLaboratory for Condensed Matter Physics, Chinese Academy of Science, P.O. Box 603,\nBeijing 100190, P.R. China\nAbstract\nIn order to understand why the inter- and intra-granular current densities of\npolycrystalline superconducting oxypnictides differ by three orders of magnitude, we\nhave conducted combined magneto-optical and microstructural examinations of\nrepresentative randomly oriented polycrystalline Nd and Sm single-layer oxypnictides.\nMagneto optical images show that the highest Jc values are observed within single\ngrains oriented with their c axes perpendicular to the observation plane, implying that\nthe intragranular current is anisotropic. The much lower intergranular Jc is at least\npartially due to many extrinsic factors, because cracks and a ubiquitous wetting As-Fe\nphase are found at many grain boundaries. However, some grain boundaries are\nstructurally clean under high resolution transmission electron microscopy examination.\nBecause the whole-sample global Jc(5K) values of the two samples examined are\n1000-4000 A/cm2, some 10-40 times that found in random, polycrystalline\nYBa2Cu3O7-x, it appears that the dominant obstruction to intergranular current flow of\nmany present samples is extrinsic, though some intrinsic limitation of current flow\nacross grain boundaries cannot yet be ruled out.\n\n1\n\n\fIntroduction\nThe discovery of superconductivity in the LaFeAsO1-xFx compound [1] has been\nfollowed by rapid exploration of many aspects of the superconducting behaviour of the\nbroad class of rare earth iron oxypnictides [2-17] whose transition temperature Tc can\nreach above 40 K when La is replaced by Ce [5] and above 50 K when the rare earth is\nPr, Nd, Sm and Gd [7-11]. Hunte et al. reported that even the La Fe-oxypnictide with\nTc ~ 26 K exhibits a very high upper critical field Hc2 of ~65 T [6] while Hc2 over 200\nT was deduced for the Sm and Nd Fe-oxypnictides [17], strongly suggesting a large\nhigh field domain for the Fe-oxypnictides. Foreseeing practical applications, there has\nbeen immediate interest in the critical current density too. But all polycrystalline\nsamples of La, Sm and Nd Fe-oxypnictides [12-16] examined to date show signs of\nless than full grain-to-grain connectivity, raising the same concern of depression of\nsuperconducting order parameter at grain boundaries that has so greatly complicated\napplications of the cuprates [18]. Grain boundary order parameter suppression is\nfundamental detriment to applications since it means that a randomly aligned grain\nstructure will not pass the full current that can be sustained by intragrain vortex\npinning, thus reducing the global or whole-sample current density below that\ncirculating in the grains. In cuprates this depression is very significant causing Jcgb, the\ncurrent crossing the grain boundary, depressed exponentially (Jcgb ~ Jc e-(θ/θc)) as the\nmisorientation θ rises beyond a critical angle θc, where θc is about 3-5° for most\ncuprate grain boundaries [19][20].\nIn a recent study of the magnetization of bulk and powdered samples of\npolycrystalline La Fe-oxypnictide by Yamamoto et al., very low global current was\ndeduced [12] to flow, leaving open the possibility of an intrinsic granularity similar or\neven worse than in the cuprates. However this conclusion could not be tested\nexplicitly since the smallest powder size evaluated was ~50μm, several times the grain\nsize. Subsequent study of Sm-[13] and Nd-oxypnictide [14][16] polycrystalline bulks\nalso uncovered evidence for reduced connectivity of polycrystalline sample forms.\nOur own follow-on study [15] of polycrystalline Sm and Nd oxypnictides showed\nconsiderable enhancement of the hysteretic magnetization compared to La-oxypnictide\n[12]. From sample-size dependent measurements of the magnetization and wholesample, magneto optical images, we deduced that a significant global current was\nflowing. However, the intergranular and intragranular current densities had\ndistinctively different temperature dependences and differed in magnitude by a factor\nof 1000. We also observed that the intergranular current density (global Jc) of the Sm\nsample (~ 4000 A/cm2 at 4.2 K) was almost twice higher than that of the Nd sample\n( ~2000 A/cm2) whereas the intragranular current density (local Jc) was quite similar\n[15]. In this follow on study, we provide a more detailed and more local correlation\nbetween current flow and the microstructure so as to address in greater detail the\ncauses of granularity in the rare earth Fe-oxypnictides.\nExperimental details\nThe polycrystalline SmFeAsO0.85 and NdFeAsO0.94F0.06 bulk samples were\nsynthesized by solid state reaction under high pressure. SmAs (or NdAs) pre-sintered\n\n2\n\n\fpowder and Fe, Fe2O3, and FeF2 powders were mixed together according to the\nnominal stoichiometric ratio, then ground thoroughly and pressed into small pellets,\nwhich were sealed in boron nitride crucibles and sintered under a pressure of 6 GPa at\n1250°C for 2 hours [8][10]. This synthesis produces sharp resistive and magnetic Tc\ntransitions, even though the microstructure is far from single phase [15].\nMO imaging with a 5 um thick Bi-doped iron-garnet indicator film was used to\nobserve the normal field component Bz produced by magnetization currents induced by\napplying external fields up to 120 mT perpendicular to the imaging surface [21][22].\nSamples were imaged in various states, but the principal one used was that of zero field\ncooling (ZFC) to the superconducting state, application of fields up to 120 mT, then\nremoval of the field to zero. Such a procedure induces currents to flow throughout the\nwhole sample and allows direct observation of the uniformity of the currents flowing\nin the sample.\nBack scattered electron (BSE) imaging and orientation imaging microscopy (OIM)\nusing electron back scattering diffraction (EBSD) were carried out on well-polished\nsample surfaces in two scanning electron microscopes (Carl Zeiss 1540 EsB or XB).\nInverse pole figure maps were obtained by OIM, in order to highlight the principal\n(001), (110) and (100) planes intersecting the surface.\nThin lamellae ~10 x 20 um in size were prepared with the focused ion beam tool of\nthe 1540EsB for subsequent transmission electron microscope (TEM) and high\nresolution TEM (HREM) observation in a JEOL 2011.\nResults and discussion\nFig 1 shows whole-sample BSE and MO images of the Sm and Nd Fe-oxypnictide\nsamples. Both samples are multi-phase, consisting of the RE Fe-oxypnictide phase\n(intermediate gray contrast), a glassy Fe-As phase (dark contrast) and Sm2O3 or Nd2O3\n(white contrast), as seen in Fig.1 (a) and (c). The area fraction of the Fe-oxypnictide\nphase calculated with the ImageJ software is ~ 80 % in both samples. The impurity\nphases are distributed more finely and uniformly in the Sm than in the Nd sample,\nwhere the 2nd phase is more inhomogeneous and on a much larger scale of 30-200 um.\nMO images of the residual magnetic flux of the remnant state in the Sm sample (b) and\nthe Nd sample (d) were taken after zero field cooling (ZFC) to 6 K and applying 120\nmT in order to induce whole sample current flow. The bright spots correspond to\nregions of strongly trapped flux produced by locally high Jc regions. The MO images\nshow that flux penetrated into the center of the Nd sample under an external field of\n~10 mT at 6 K while flux reached the center of the Sm sample at the higher external\nfield of ~15 mT, indicating a smaller global circulating current in the Nd sample. The\nwhite rectangles in Fig.1 are the areas where we correlate the MO images and the\nmicrostructure in detail in Fig.2 and 3.\nTypical high Jc bright spots of the Sm sample seen in Fig.1 (b) are black-circled in\nFig.2 (a). We should first note that the straight line contrasts visible in the MO images\nare due to scratches on the MO indicator film and irrelevant to further discussion. Fig.2\n(b) shows the inverse pole figure map of the grain orientations in exactly the same\n\n3\n\n\fregion. Several points are clear from this local comparison of MO and OIM images.\nOne is that the grain orientation is essentially random. A second is that the grains are\nplate-shaped, with an average grain size of ~14 × 6 μm with an aspect ratio of ~0.4\ncalculated within the OIM scanning area of 105000 μm2 total (not all of which is\nshown in the figure). Noise on the grain map corresponds to impurity phases such as\nFe-As and Sm2O3. It is clear that most of the bright spots correspond to individual\ngrains of intermediate to large size. Comparing Fig.2(a) and 2(b) where typical high Jc\nspots A ~ E are marked also suggests that the grains with colours close to red are more\nlikely (i.e. those with grain normal close to [001]) to be high Jc spots, indicating that\nthe strongest MO signals tend to come from the currents circulating on the ab-plane.\nSome of the bright MO spots also come from intermediate size grains with no\npreferred crystal orientation, which may imply that grain connectivity in these spots is\nbetter than other lower Jc regions, although unfortunately the resolution of the MO\nimages is not quite high enough to show how much current crosses grain boundaries.\nIn Fig.3, typical high Jc spots in the Nd sample taken from Fig.1 (d) are blackcircled in Fig.3 (a) and compared to the inverse pole figure map on exactly the same\nregion in Fig.3 (b). Like the Sm sample, the grain orientation is essentially random.\nThe average grain size of ~7 × 2.8 μm is about half that of the Sm sample but the\naspect ratio is also ~0.4. Comparing Fig.3 (a) with (b), the left bright spot comes from\nthe circled large grain whose crystal orientation is shown in the orientation box. The\nright circle contains two distinct bright spots from two adjacent grains whose\norientations are both near [001] and are colored red and pink.\nThe strong correlation between the microstructure and the high Jc regions in the MO\nimages does suggest that highest density current flows locally within individual grains\nof both Sm and Nd samples and also that high Jc regions are found preferentially in\ngrains with plane normal close to [001], which also suggests that high Jc occurs for\ncurrents flowing on ab-planes, consistent with some superconducting anisotropy. The\ninverse pole figure maps of Fig.2 (b) and 3 (b) also show clearly that both samples are\nrandom polycrystals, meaning that global currents must flow across high angle\nboundaries.\nIn spite of the multi-phase microstructure, clean grain boundaries do exist. Fig.4\nshows a TEM image of a typical, clean grain boundary in the Sm sample. The image\nhas sharp contrast which rules out any wetting amorphous or impurity phase at the\ngrain boundary. The inset of Fig.4 shows a HREM image of the same grain boundary,\nin which the sample was tilted so that the grain boundary was almost parallel to the\nincident electron beam. The lattice fringes of the upper and lower grains impinge at the\ngrain boundary without any diffuse contrast provided by any thin wetting amorphous\nlayer.\nHowever, there are still many non-superconducting obstructions at grain boundaries\nas clearly seen in the BSE images of Fig.5. Although connected clean grain boundaries\nare seen in both (a) the Sm and (b) the Nd sample in Fig.5, the Fe-As glassy phase\nlying between grains and cracks isolate individual grains, limiting the current paths.\nAccording to the estimation from Fig.5 (a) and (b) by ImageJ, the length fraction of\nclean grain boundaries is strongly suppressed down to only ~ 25 % in both Sm and Nd\nsample, because of this amorphous Fe-As phase, cracks and Sm2O3 or Nd2O3.\n4\n\n\fThe two TEM images of Fig.6 (a) and (b) show typical structures of obstructed grain\nboundaries in the Nd sample. In Fig.6 (a), a current-obstructing crack can be seen at a\nlarge angle grain boundary. However, this grain boundary is well-connected at the\nright side of the same image, at least showing how local the transition from extrinsic\nlimitation of Jc across the grain boundary may be. As shown in Fig.6 (b), while most\ngrain boundaries show solid contrast indicating that they are structurally wellconnected, the dark contrast in the BSE image Fig.5 (b) suggests a grain boundary\nwetted by amorphous phase, providing a second reason for extrinsic obstruction of\ncurrent at grain boundaries as also indicated in Fig.6 (b). There is also an impurity\nphase at the GB junction.\nThe glassy Fe-As phase and Sm2O3 or Nd2O3 impurities lying between Feoxypnictide grains significantly reduce the current paths in the Sm and Nd samples.\nThe macroscopic inhomogeneity on the scale of several hundreds μm (see Fig.1)\nsubstantially disturbs the bulk current over the whole Nd sample as we found in the\nMO images [15]. In addition, percolation of the supercurrent through a minority of\ngood intergranular connections will be forced by the cracks and wetting amorphous\nphase found at grain boundaries, a state reminiscent of MgB2 where MgO insulating\nlayers at grain boundaries seriously suppress the intergranular current [23][24]. In the\ncase of Bi2Sr2Ca2Cu3Ox textured polycrystalline tapes that are also multi-phase, there\nis a clear correlation between phase purity and the whole-sample Jc, which can\nsuddenly increase by a factor up to 10 times when the volume fraction of the\nsuperconducting phase exceeds a certain threshold [25][26]. Based on the differences\nof microstructure and MO response observed here for the Nd and Sm samples, we\nsuppose that the difference of ~2 between the whole-sample Jc of the Sm and Nd\nsamples results from differences in the extrinsic factors (macroscopic phase\ninhomogeneity, grain boundary cracks, and wetting amorphous Fe-As phase at grain\nboundaries) rather than intrinsic property variation.\nAt this stage of Fe-oxypnictide studies, rather few reports of the phase state and its\ninfluence on Jc have yet been made, making firm conclusions hard to draw. Prozorov\net al. carried out MO imaging on a NdFeAsO0.9F0.1 bulk in which remnant field was\ntrapped only in individual grains, showing strong granularity too [14]. Moore et al also\nshowed that only small current flows over macroscopic dimensions in a NdFeAsO0.85\nbulk. They too found a wetting phase around the Nd oxypnictide grains [16]. Senatore\net al. reported impurity phases in their SmO0.85F0.15FeAs sample which also showed a\nsignificant sign of weak-link behaviour [13]. In fact a reasonable conclusion is that all\npolycrystalline RE Fe-oxypnictide samples reported so far are multi-phase. In this\nimportant respect, therefore, we believe that the samples described here are fully\nrepresentative of present polycrystalline materials.\nEven with the intergranular Jc limitation by multiple extrinsic factors, the global Jc\nis at least 10 times higher than that in a random polycrystalline ReBCO [27][28],\nwhere values of Jc(4K) ~ 100 A/cm2 are found in single-phase samples with clean grain\nboundaries. This comparison suggests a much less strong intrinsic weak-link effect at\ngrain boundaries in the oxypnictides than in the cuprates. In these samples, Sm2O3 and\nNd2O3 are completely insulating and serious blocks to intergranular current flow. Nor\ncan we expect large current flow across the glassy Fe-As phase even though\n\n5\n\n\fYamamoto et al. found an SNS component to the intergranular flow that is consistent\nwith SNS coupling across this phase. Considering that only a few of the grain\nboundaries are cleanly coupled without extensive secondary phase of the type seen in\nFigs. 5 and 6, it is reasonable to think that the global Jc of the Sm and Nd samples is\npotentially much higher than what we have reported [15]. In order to better understand\nthe intrinsic weak-link effects at grain boundaries, we need to make bulk samples of\nmuch higher phase purity and to examine current dissipation on single grain\nboundaries [29] of defined misorientation.\nConclusion\nWe have investigated the causes of two distinct scale of current and different\nintergranular current density observed in the polycrystalline Sm and Nd Feoxypnictides. We find that impurity phases extrinsically limit the intergranular current\non the macro scale. High-density current flows locally within individual grains,\npreferentially circulating on ab-planes. However, clean grain boundaries without any\nwetting amorphous phase were found too. The difference of global Jc between the Nd\nand Sm samples appears to result from macroscopic inhomogeneity, and cracks and\nwetting amorphous at grain boundaries. Considering their random polycrystalline form,\nwe conclude that extrinsic limitation of current is still dominant in these Sm and Nd\nFe-oxypnictides and that the intergranular intrinsic limitation is less severe than in the\ncuprates.\n.\nAcknowledgments\nWork at the NHMFL was supported by IHRP 227000-520-003597-5063 under NSF\nCooperative Agreement DMR-0084173, by the State of Florida, by the DOE, by the\nNSF Focused Research Group on Magnesium Diboride (FRG) DMR-0514592 and by\nAFOSR under grant FA9550-06-1-0474.\n\n6\n\n\fReferences\n[1] Kamihara Y, Watanabe T, Hirano M and Hosono H 2008 Iron-based layered\nsuperconductor La[O1-xFx]FeAs (x = 0.05-0.12) with Tc = 26 K J. Am. Chem. Soc.\n130 3296\n[2] Day C 2008 New family of quaternary iron-based compounds superconductors at\ntens of kelvin Physics Today 61 11\n[3] Takahashi H, Igawa K, Arii K, Kamihara Y, Hirano M and Hosono H 2008\nSuperconductivity at 43 K in an iron-based layered compound LaO1-xFxFeAs Nature\n453 376\n[4] Sefat A S, McGuire M A, Sales B C, Jin R, Howe J Y and Mandrus D 2008\nElectronic correlations in the superconductor LaFeAsO0.89F0.11 with low carrier\ndensity Phys. Rev. B 77 174503 (Cond-mat arXiv:0803.2528v1)\n[5] Chen G F, Li Z, Wu D, Li G, Hu W Z, Dong J, Zheng P, Luo J L and Wang N L\n2008 Superconductivity at 41 K and its competition with spin-density-wave\ninstability in layered CeO1-XFXFeAs Cond-mat arXiv:0803.3790v1\n[6] Hunte F, Jaroszynski J, Gurevich A, Larbalestier D C, Jin R, Sefat A S, McGuire M\nA, Sales B C, Christen D K and Mandrus D 2008 Very high field two-band\nsuperconductivity in LaFeAO0.89F0.11 Nature 453 903\n[7] Chen X H, Wu T, Wu G, Liu R H, Chen H and Fang D F 2008 Superconductivity at\n43 K in Samarium-arsenide Oxides SmFeAsO1-xFx Nature doi:10.1038/nature07045\n(Cond-mat arXiv:0803.3603v1)\n[8] Ren Z A, Yang J, Lu W, Yi W, Shen X L, Li Z C, Che G C, Dong X L, Sun L L,\nZhou F and Zhao Z X 2008 Superconductivity in iron-based F-doped layered\nquaternary compound Nd[O1-xFx]FeAs Europhys. Lett. 82 57002 (Cond-mat,\narXiv:0803.4234v1)\n[9] Ren Z A, Yang J, Lu W, Yi W, Che G C, Dong X L, Sun L L and Zhao Z X 2008\nSuperconductivity at 52 K in iron-based F-doped layered quaternary compound\nPr[O1-xFx]FeAs Cond-mat arXiv:0803.4283v1\n[10] Ren Z A, Lu W, Yang J, Yi W, Shen X L, Li Z C, Che G C, Dong X L, Sun L L,\nZhou F and Zhao Z X 2008 Superconductivity at 55 K in iron-based F-doped layered\nquaternary compound Sm[O1-xFx]FeAs Chin. Phys. Lett. 25 2215 (Cond-mat,\narXiv:0804.2053 v1)\n[11] Yang J, Li Z C, Lu W, Yi W, Shen X L, Ren Z A, Che G C, Dong X L, Sun L L,\nZhou F and Zhao Z X 2008 Superconductivity at 53.5 K in GdFeAsO1-δ Supercond.\nSci. Technol. 21 082001 (Cond-mat, arXiv:0804.3727v1)\n[12] Yamamoto A, Jiang J, Tarantini C, Craig N, Polyanskii A A, Kametani F, Hunte F,\nJaroszynski J, Hellstrom E E, Larbalestier D C, Jin R, Sefat A S, McGuire M A,\nSales B C, Christen D K and Mandrus D 2008 Evidence for electromagnetic\ngranularity in the polycrystalline iron-based superconductor LaO0.89F0.11FeAs Appl.\nPhys. Lett. 92 252501\n[13] Senatore C, Wu G, Liu R H, Chen X H and Flukiger R 2008 Upper critical fields\nwell above 100 T for the superconductor SmO0.85F0.15FeAs with Tc = 46 K Cond-mat\narXiv:0805.2389v2\n[14] Prozorov R, Tillman M E, Mun E D and Canfield P C 2008 Intrinsic magnetic\nproperties of Nd(O0.9F0.1)FeAs superconductor from local and global measurements\nCond-mat arXiv:0805.2783v1\n\n7\n\n\f[15] Yamamoto A, Polyanskii A A, Jaing J, Kametani F, Tarantini C, Hunte F,\nJaroszynski J, Hellstrom E E, Lee P J, Gurevich A, Larbalestier D C, Ren Z A, Yang\nJ, Dong X L, Lu W and Zhao Z X 2008 Evidence for two distinct scales of current\nflow in polycrystalline Sm and Nd iron oxypnictides Supercond. Sci. Technol. 21 No\n9 095008\n[16] Moore J D, Morrison K, Yates K A, Caplin A D, Yeshurun Y, Cohen L F, Perkins J\nM, McGilvery C M, McComb D W, Ren Z A, Yang J, Lu W, Dong W L and Zhao Z\nX 2008 Supercond. Sci. Technol. 21 No 9 092004\n[17] Jaroszynski J, Riggs S C, Hunte F, Gurevich A, Larbalestier D C, Beobinger G S,\nBalakirev F F, Migliori A, Ren Z A, Lu W, Yang J, Shen X L, Dong X L, Zhao Z X,\nJin R, Sefat A S, McGuire M A, Sales B C, Christen D K, Mandrus D 2008\nComparative high field magneto-transport of rare earth oxypnictides with maximum\ntransition temperatures Condmat arXiv:0806.1352\n[18] Larbalestier D C, Gurevich A, Feldmann D M and Polyanskii A 2001 High-Tc\nsuperconducting materials for electric power applications Nature 414 368\n[19] Hilgenkamp H and Mannhart J 2002 Grain boundaries in high-Tc superconductors\nRev. Mod. Phys. 74 485\n[20] Feldmann D M, Holesinger T G, Feenstra R, Cantoni C, Zhang W, Rupich M, Li X,\nDurrell J H, Gurevich A and Larbalestier D C 2007 Mechanisms for enhanced\nsupercurrent across meandered grain boundaries in high-temperature\nsuperconductors J. Appl. Phys. 102 083912\n[21] Polyanskii A A, Gurevich A, Pashitski A E, Heinig N F, Redwing R D, Nordman J E\nand Larbalestier D C 1996 Magneto-optical study of flux penetration and critical\ncurrent densities in [001] tilt YBa2Cu3O7-δ thin-film bicrystals Phys. Rev. B 53 8687\n[22] Polyanskii A A, Feldmann D M and Larbalestier D C 2003 Magneto-Optical\ncharacterization techniques Chapter D3.4 of Handbook of Superconducting Materials\nEd. D. Cardwell, University of Cambridge, UK; D. Ginley, NREL.IOP publishing\nLtd pp1551-1567\n[23] Rowell J M 2003 The widely variable resistivity of MgB2 samples Supercond.\nSci.Technol. 16 R17\n[24] Yamamoto A, Shimoyama J, Kishio K and Matsushita T 2007 Limiting factors of\nnormal-state conductivity in superconducting MgB2: an application of mean-field\ntheory for a site percolation problem Supercond. Sci. Technol. 20 658\n[25] Luo J S, Dorris SE, Fischer A K, LeBoy J S, Maroni V A, Fengz Y and Larbalestier\nD C 1996 Mode of lead addition and its effects on phase formation and\nmicrostructure development in Ag/(Bi, Pb)2Sr2Ca2Cu3OX composite conductors\nSupercond. Sci. Technol. 9 412\n[26] Osamura K, Nonaka S, Matsui M, Oku T, Ochiai S and Hampshire D P 1996 Factors\nsuppressing transport critical current in Ag/Bi2223 tapes J. Appl. Phys. 79 7877\n[27] Larbalestier D C, Daeumling M, Cai X, Seuntjens J, McKinnell J, Hampshire D, Lee\nP, Meingast C, Willis T, Muller H, Ray R D, Dillenburg R G, Hellstrom E E and\nJoynt R 1987 Experiments concerning the connective nature of superconductivity in\nYBa2Cu3O7 J. Appl. Phys. 62 3308\n[28] Seuntjens J M and Larbalestier D C 1990 On the improvement of DyBa2Cu3O7-δ\nproperties through better sintering J. Appl. Phys. 67 2007\n[29] Abraimov D, Feldmann D M, Polyanskii A A, Gurevich A, Daniels G, Larbalestier\n\n8\n\n\fD C, Zhuravel A P, and Ustinov A V 2004 Scanning laser imaging of dissipation in\nYBa2Cu3O7-δ coated conductors Appl. Phys. Lett. 85 2568\n\n9\n\n\fFigure captions\nFig.1 Back scatter electron (BSE) and magneto optical (MO) images of the Sm sample\n(a) (b), and on the Nd sample (c) (d), respectively. MO imaging was done after ZFC to 6\nK, then applying 120 mT and then reducing the field to 0 mT.\nFig.2 (a) Typical high Jc bright spots in the MO image of the Sm sample taken from Fig.1\n(b). The straight line contrasts visible in the MO images are due to scratches on the MO\nindicator film and irrelevant to further discussion. (b) Inverse pole figure map of the\nexact same region. Black-circled areas correspond to the high Jc spots in (a).\nFig.3 (a) Typical high Jc bright spots of the MO image on the Nd sample taken from\nFig.1 (d). (b) Inverse pole figure map of the exact same region. Black-circled areas\ncorrespond to the high Jc spots in (a).\nFig.4 TEM image showing a clean grain boundary in the Sm sample. The inset of HREM\nimage of the same grain boundary proves no thin wetting amorphous on GB.\nFig.5 BSE image of the (a) Sm and (b) Nd sample at high magnification. Although some\ngrain boundaries are well-connected, others are clearly obstructed by the Fe-As phase\n(dark contrast), Sm2O3 or Nd2O3 (white contrast) and cracks.\nFig.6 TEM images showing grain boundaries in the Nd sample obstructed by (a) cracks\nand (b) the wetting amorphous phase and Nd2O3.\n\n10\n\n\fFigure 1\n\n11\n\n\fFigure 2\n\n12\n\n\fFigure 3\n\n13\n\n\fFigure 4\n\n14\n\n\fFigure 5\n\n(b)\n\n15\n\n\fFigure6\n\n(a)\n\n(b)\n\n16\n\n\f"}