{"id": "http://arxiv.org/abs/1108.4093v2", "guidislink": true, "updated": "2011-10-24T14:41:28Z", "updated_parsed": [2011, 10, 24, 14, 41, 28, 0, 297, 0], "published": "2011-08-20T06:58:04Z", "published_parsed": [2011, 8, 20, 6, 58, 4, 5, 232, 0], "title": "Structural properties of hard disks in a narrow tube", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5706%2C1108.4916%2C1108.4763%2C1108.3730%2C1108.0116%2C1108.5625%2C1108.2325%2C1108.2752%2C1108.1895%2C1108.0830%2C1108.5422%2C1108.5912%2C1108.3731%2C1108.2854%2C1108.2495%2C1108.2118%2C1108.2133%2C1108.1804%2C1108.1502%2C1108.0876%2C1108.2630%2C1108.1245%2C1108.0721%2C1108.1020%2C1108.5071%2C1108.3676%2C1108.3507%2C1108.5894%2C1108.5547%2C1108.4296%2C1108.0913%2C1108.5037%2C1108.4967%2C1108.3252%2C1108.2743%2C1108.1255%2C1108.5757%2C1108.2635%2C1108.5298%2C1108.5968%2C1108.2248%2C1108.4679%2C1108.2740%2C1108.5620%2C1108.4820%2C1108.1712%2C1108.4588%2C1108.3005%2C1108.5667%2C1108.0979%2C1108.0616%2C1108.4034%2C1108.5150%2C1108.0546%2C1108.3221%2C1108.0728%2C1108.4320%2C1108.4093%2C1108.3554%2C1108.5198%2C1108.6306%2C1108.4081%2C1108.5027%2C1108.4082%2C1108.1397%2C1108.6039%2C1108.3964%2C1108.5244%2C1108.2681%2C1108.5585%2C1108.2015%2C1108.2050%2C1108.5320%2C1108.1018%2C1108.1104%2C1108.3264%2C1108.4443%2C1108.0086%2C1108.4304%2C1108.3572%2C1108.4016%2C1108.0262%2C1108.1024%2C1108.4477%2C1108.5432%2C1108.0576%2C1108.0457%2C1108.3294%2C1108.0935%2C1108.3631%2C1108.4322%2C1108.4746%2C1108.3769%2C1108.5822%2C1108.5844%2C1108.4070%2C1108.2270%2C1108.1154%2C1108.0349%2C1108.6162%2C1108.0188&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Structural properties of hard disks in a narrow tube"}, "summary": "Positional ordering of a two-dimensional fluid of hard disks is examined in\nsuch narrow tubes where only the nearest-neighbor interactions take place.\nUsing the exact transfer-matrix method the transverse and longitudinal pressure\ncomponents and the correlation function are determined numerically. Fluid-solid\nphase transition does not occur even in the widest tube, where the method just\nloses its exactness, but the appearance of the dramatic change in the equation\nof state and the longitudinal correlation function shows that the system\nundergoes a structural change from a fluid to a solid-like order. The pressure\ncomponents show that the collisions are dominantly longitudinal at low\ndensities, while they are transverse in the vicinity of close packing density.\nThe transverse correlation function shows that the size of solid-like domains\ngrows exponentially with increasing pressure and the correlation length\ndiverges at close packing. It is managed to find an analytically solvable model\nby expanding the contact distance up to first order. The approximate model,\nwhich corresponds to the system of hard parallel rhombuses, behaves very\nsimilarly to the system of hard disks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5706%2C1108.4916%2C1108.4763%2C1108.3730%2C1108.0116%2C1108.5625%2C1108.2325%2C1108.2752%2C1108.1895%2C1108.0830%2C1108.5422%2C1108.5912%2C1108.3731%2C1108.2854%2C1108.2495%2C1108.2118%2C1108.2133%2C1108.1804%2C1108.1502%2C1108.0876%2C1108.2630%2C1108.1245%2C1108.0721%2C1108.1020%2C1108.5071%2C1108.3676%2C1108.3507%2C1108.5894%2C1108.5547%2C1108.4296%2C1108.0913%2C1108.5037%2C1108.4967%2C1108.3252%2C1108.2743%2C1108.1255%2C1108.5757%2C1108.2635%2C1108.5298%2C1108.5968%2C1108.2248%2C1108.4679%2C1108.2740%2C1108.5620%2C1108.4820%2C1108.1712%2C1108.4588%2C1108.3005%2C1108.5667%2C1108.0979%2C1108.0616%2C1108.4034%2C1108.5150%2C1108.0546%2C1108.3221%2C1108.0728%2C1108.4320%2C1108.4093%2C1108.3554%2C1108.5198%2C1108.6306%2C1108.4081%2C1108.5027%2C1108.4082%2C1108.1397%2C1108.6039%2C1108.3964%2C1108.5244%2C1108.2681%2C1108.5585%2C1108.2015%2C1108.2050%2C1108.5320%2C1108.1018%2C1108.1104%2C1108.3264%2C1108.4443%2C1108.0086%2C1108.4304%2C1108.3572%2C1108.4016%2C1108.0262%2C1108.1024%2C1108.4477%2C1108.5432%2C1108.0576%2C1108.0457%2C1108.3294%2C1108.0935%2C1108.3631%2C1108.4322%2C1108.4746%2C1108.3769%2C1108.5822%2C1108.5844%2C1108.4070%2C1108.2270%2C1108.1154%2C1108.0349%2C1108.6162%2C1108.0188&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Positional ordering of a two-dimensional fluid of hard disks is examined in\nsuch narrow tubes where only the nearest-neighbor interactions take place.\nUsing the exact transfer-matrix method the transverse and longitudinal pressure\ncomponents and the correlation function are determined numerically. Fluid-solid\nphase transition does not occur even in the widest tube, where the method just\nloses its exactness, but the appearance of the dramatic change in the equation\nof state and the longitudinal correlation function shows that the system\nundergoes a structural change from a fluid to a solid-like order. The pressure\ncomponents show that the collisions are dominantly longitudinal at low\ndensities, while they are transverse in the vicinity of close packing density.\nThe transverse correlation function shows that the size of solid-like domains\ngrows exponentially with increasing pressure and the correlation length\ndiverges at close packing. It is managed to find an analytically solvable model\nby expanding the contact distance up to first order. The approximate model,\nwhich corresponds to the system of hard parallel rhombuses, behaves very\nsimilarly to the system of hard disks."}, "authors": ["S. Varga", "G. Balló", "P. Gurin"], "author_detail": {"name": "P. Gurin"}, "author": "P. Gurin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-5468/2011/11/P11006", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.4093v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.4093v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Acceped in Journal of Statistical Mechanics: Theory and Experiment", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.4093v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.4093v2", "journal_reference": null, "doi": "10.1088/1742-5468/2011/11/P11006", "fulltext": "arXiv:1108.4093v2 [cond-mat.stat-mech] 24 Oct 2011\n\nStructural properties of hard disks in a narrow tube\nS Varga1 , G Balló2 and P Gurin1\n1\n\nInstitute of Physics and Mechatronics, University of Pannonia, PO Box 158, H-8201\nVeszprém, Hungary\n2\nDepartment of Electrical Engineering and Information Systems, University of\nPannonia, Egyetem u. 11, H-8201 Veszprém, Hungary\n\nE-mail: vargasz@almos.vein.hu, ballo.g@virt.uni-pannon.hu,\ngurin@almos.vein.hu\nAbstract. Positional ordering of a two-dimensional fluid of hard disks is examined\nin such narrow tubes where only the nearest-neighbor interactions take place. Using\nthe exact transfer-matrix method the transverse and longitudinal pressure components\nand the correlation function are determined numerically. Fluid-solid phase transition\ndoes not occur even in the widest tube, where the method just loses its exactness, but\nthe appearance of the dramatic change in the equation of state and the longitudinal\ncorrelation function shows that the system undergoes a structural change from a fluid\nto a solid-like order. The pressure components show that the collisions are dominantly\nlongitudinal at low densities, while they are transverse in the vicinity of close packing\ndensity. The transverse correlation function shows that the size of solid-like domains\ngrows exponentially with increasing pressure and the correlation length diverges at\nclose packing. It is managed to find an analytically solvable model by expanding the\ncontact distance up to first order. The approximate model, which corresponds to the\nsystem of hard parallel rhombuses, behaves very similarly to the system of hard disks.\n\nKeywords: confined systems, positional order, transfer matrix method, exactly solvable\nmodels\n\n\fStructural properties of hard disks in a narrow tube\n\n2\n\n1. Introduction\nThe knowledge of the thermodynamics of fluids in extreme confinements has a great\nimportance due to the wide range of chemical and biological applications and the\nappearance of nanoscale-fluids in nature [1]. The most important examples are the\nmicro- and nanofluidic devices [2, 3], carbon nanotubes [4, 5], biological ion-channels\n[6] and adsorption in porous materials such as the zeolite [7]. To capture the essence\nof the rather complex behaviour of such confined systems it is important to apply some\nsimplifying assumptions for the particle-particle and particle-confining wall interactions.\nUsing hard body molecular models and hard confining walls it is possible to study purely\nthe geometrical packing effects as the energetic effect are not included in these models.\nIn this regard much attention has been paid to understand the structure and the phase\nbehaviour of several confined systems such as the ordering of hard spheres in narrow\ncylindrical pore [8, 9, 10] and slit pores [11] and the helical packing of soft spheres in\nnanotubes [12, 13]. The rapid development of the X-ray techniques makes also possible\nto study extremely confined fluids, where the particles are confined between two hard\nwalls with thickness just slightly higher than the diameter of the particle [14]. These\nsystems can be often modeled as quasi-one-dimensional systems.\nSince the seminal work of Tonks [15] considerable progress has been made to\nunderstand the thermodynamic and structural properties of one-dimensional systems.\nThe pair correlation function was determined in various systems interacting with shortrange pair potentials [16, 17, 18], the link between the short-ranged pair potential and\nthe pair correlation functions was examined in a charged- stabilized colloidal system\ntrapped to one dimension [19] and the long-range interaction induced freezing transition\nof hard rods was studied by [20]. Even our knowledge of the ordering properties of onedimensional hard rod fluid (Tonks gas) has been widened by the exact determination of\nthe percolation size [21] and by the study of the residual multiparticle entropy at the\nonset of solidlike behaviour [22].\nThe examination of confined two-dimensional (2D) hard particle fluids can be\nconsidered as a natural extension of the one-dimensional studies, if the available space\nfor the particles is infinitely long in one dimension, but it is very restricted in other\ndimension. This condition guarantees that the phase behaviour of the confined fluid\ndoes not deviate substantially from that of Tonks gas. Of course, with weakening\nconfinement the system gets naturally closer to the two-dimensional bulk fluid and the\nthermodynamic properties of such fluids get very far from that of Tonks gas [23, 24].\nSeveral studies are devoted to extend the exact Tonks theory of one-dimensional fluid\nto the confined two-dimensional one [25, 26, 27, 28]. If the confinement and the pair\ninteraction does allow only nearest neighbor interactions, it is possible to derive such an\nintegral equation which provides the exact thermodynamics of the system. In the system\nof 2D hard disks confined into a narrow tube, the equation of state has been determined\nby the iterative solution of the corresponding eigenvalue equation [27]. Later analytical\nequation has been derived for the equation of state in the high pressure limit, which is not\n\n\f3\n\nStructural properties of hard disks in a narrow tube\ny\nW +D\n\nD\nx\n\nFigure 1: Schematic representation of the system of hard disks confined between two\nhard walls, where D is the diameter of the disks and W +D is the wall-to-wall separation.\nOverlaps are not allowed between the disks and the vertical position of the disks is\nconfined in the interval of −W/2 < y < W/2.\nvalid at low densities [29, 30]. Recently both the transverse and the longitudinal pressure\ncomponents of the hard and soft disk have been determined at such low densities, where\nthe second virial theory is still valid [31, 32]. In this paper we extend the previous\nstudies to examine the local structure of the hard disk fluid at both low and high\npressures and we devise an analytically solvable model system which follows closely\nthe phase behaviour of the hard disks. We calculate the transverse density profile, the\npair correlation function and the longitudinal pair distribution function to examine the\ngrowth of the solid-like clusters with increasing pressure. We pay special attention to\nthe effects of the structural change from a Tonks gas behaviour to a solid-like one.\nOur paper is organized as follows: the transfer matrix method is presented for\nthe confined hard disks in the next section. The eigenvalue equation is derived for the\ndetermination of the Gibbs free energy, the equation of state, the correlation function\nand the local density. Moreover we present the details of our MC simulation study\nfor the pair correlation function measured in the direction of the tube' s long axis. In\nsection 3 we show that analytical results can be derived for both thermodynamic and\nstructural properties if the contact distance is expanded up to the first order. The\nresults are shown to be exact for the system of parallel hard rhombuses placed into\na very narrow tube, but it is approximate for hard disks even in the vicinity of the\nclose packing limit. We compare our numerical, analytical and MC results and we also\nexamine the fluid-solid like structural change, which takes place with increasing density\nin section 4. Conclusions are given in section 5.\n2. Transfer matrix method of the confined two-dimensional hard disks\nWe consider an isobaric ensemble of N freely moving two-dimensional hard disks in such\na restricted geometry where only nearest neighbor interactions are allowed (see figure\n1). The interaction potential between two neighboring hard disks is defined by\nu(ri,i+1) =\n\n(\n\n∞, ri,i+1 ≤ D\n0, ri,i+1 > D\n\n,\n\n(1)\n\n\f4\n\nStructural properties of hard disks in a narrow tube\n\nwhere ri,i+1 = |ri+1 − ri | is the length of the centre-to-centre distance vector between\nparticles i and i + 1, ri = (xi , yi ), xi and yi denote cartesian coordinates of the position\nvector of the particle i and D is the diameter of the disk. Equation (1) precludes the\noverlap between the particles. To restrict the number of interactions only to the nearest\nneighbors a confining external field is applied, which acts only on the y coordinates of\nthe particle's centers and allows the particles to stay in a very narrow tube such that\nuext (yi ) =\n\n(\n\n0, |yi | ≤ W/2\n∞, |yi | > W/2\n\n(2)\n\n,\n\nwhere W is practically the width of the tube even if there is an additional D distance\nin the tube which is inaccessible for the centers of the particles (see figure 1). It is easy\n√\nto show that the tube width must be in the interval 0 < W < D 3/2 to exclude the\nnext-nearest neighbor interactions. In such a narrow tube the system is anisotropic,\ni.e. the horizontal and vertical pressure components Pxx and Pyy are different. From\nthe two possible options to define the Gibbs free energy (G) from the Helmholtz free\nenergy (F ) we choose the horizontal pressure component to get G from the Legendre\ntransformation, i.e. G = F + Pxx A, where A = LW is the accessible area for the centre\nof the particle and L is the length of the system along the x axis. The corresponding\nisobaric partition function of the confined system can be written as\nZN Pxx T\n\n1\n= 2N\nΛ\n\nZ∞\n0\n\ndx1 * * * dxN\n\nW/2\nZ\n\n−W/2\n\ndy1 * * * dyN exp −β\n\nN\nX\ni=1\n\n!\n\n(u(ri,i+1 ) + Pxx W xi,i+1 ) , (3)\n\nwhere β = 1/kB T (T being the temperature and kB the Boltzmann constant) and\n√\nΛ = h/ 2πkB T m is the thermal de Broglie wavelength. Note that the missing N! term\nin the partition function is due to the use of the fixed x1 ≤ x2 ≤ * * * ≤ xN order. This\norder can be fixed because the tube is enough narrow. Furthermore the finite integral in\nxi is replaced by the integral with infinite upper bound in the isobaric ensemble and we\nP\nuse the fact that L = N\ni=1 xi,i+1 where xi,i+1 = xi+1 −xi . Changing from the integration\nvariable xi to xi,i+1 and using equation (1) it is easy to prove that\nZN Pxx T\n\n1\n= 2N\nΛ\n\nW/2\nZ\n\n−W/2\nZ∞\n\nσ(y1 ,y2 )\n\ndy1 * * * dyN\ndx1,2 exp (−βPxx W x1,2 ) * * *\n\nZ∞\n\ndxN,1 exp (−βPxx W xN,1 ) , (4)\n\nσ(yN ,y1 )\n\nq\n\nwhere σ(yi , yi+1 ) = D 2 − (yi − yi+1 )2 is the horizontal projection of the contact\ndistance between two hard disks being at the positions yi and yi+1 . The lower bound of\nthe integrals in xi comes from the overlap condition, which prescribes that ri,i+1 ≥ D.\nWe have exploited the periodic boundary condition in the x direction, too, which means\nthat rN +1 = r1 . Now we are in the position to perform the positional integrations in\n\n\f5\n\nStructural properties of hard disks in a narrow tube\nxi,i+1 analytically, i.e.\nZN Pxx T\n\nD\n=\nΛ2\n\u0012\n\n\u0013N W/2\nZ\n−W/2\n\ndy1 * * * dyN K(y1 , y2)K(y2 , y3 ) * * * K(yN , y1 ) ,\n\n(5)\n\nwhere K(yi , yi+1 ) = exp(−βPxx W σ(yi , yi+1 ))/βPxxW D can be considered as an element\nof an infinite-dimensional matrix (K̂). In this formalism the matrix product is given by\nK 2 (yi , yi+2 ) =\n\nW/2\nR\n\ndyi+1 K(yi , yi+1)K(yi+1 , yi+2 ). Therefore the partition function can\n\n−W/2\n\nbe considered as the trace of the matrix K̂ N , that is ZN Pxx T = TrK̂ N =\n\nW/2\nR\n\ndyK N (y, y).\n\n−W/2\n\nDue to the fact that the result of trace operation is independent of the used basis, it is\nmost convenient to evaluate the partition function in the eigenfunction basis where the\nmatrix K̂ is diagonal. Denoting the eigenvalues of K̂ in decreasing order in the absolute\nP\nN\nvalue as |λ0 | > |λ1 | > |λ2 | . . ., equation (5) reduces to ZN Pxx T = ∞\nk=0 λk , where the\neigenvalues are the solutions of the following eigenvalue equations\nW/2\nZ\n\ndy ′ K(y, y ′)ψk (y ′) = λk ψk (y) ,\n\n(6)\n\n−W/2\n\nwhere ψk (y) is the kth eigenfunction (k = 0, 1, 2, . . .) and K(y, y ′) is the integral kernel\ndefined in equation (5). To our best knowledge, the above eigenvalue equation does not\nhave analytical solutions for hard disks. Therefore we solve it by the iteration using the\ntrapezoidal quadrature for the numerical integration. We can obtain the working form\nof equation (6) by the use of the normalization constraint of the eigenfunctions, that is\nW/2\nR\n\ndyψk (y)2 = 1. In this way we write the equations of the eigenfunctions and the\n\n−W/2\n\ncorresponding eigenvalues as follows\nW/2\nR\n\ndy ′ K(y, y ′)ψk (y ′ )\n\n−W/2\n\nψk (y) =\n\nW/2\nR\n\n,\n\n(7)\n\ndy ′dy ′′ K(y ′ , y ′′)ψk (y ′′)ψk (y ′ )\n\n−W/2\n\nand\nλk =\n\nW/2\nZ\n\ndydy ′K(y, y ′)ψk (y ′ )ψk (y) .\n\n(8)\n\n−W/2\n\nIn the thermodynamic limit (N → ∞) the largest eigenvalue (λ0 ) has the most\nsignificant contribution to the Gibbs partition function, i.e. the Gibbs free energy\ntakes the following form: βG/N = − ln(λ0 /D), where the constant term proportional\nto ln(Λ/D) is omitted. The equation of state can be obtained form the standard\nthermodynamic relation between the Gibbs free energy and the pressure, which is now\n\n\f6\n\nStructural properties of hard disks in a narrow tube\n\nW/ρ = ∂g/∂Pxx , where ρ = N/L is the linear density and g = G/N. Similarly the\ntransverse pressure can be also derived from the Gibbs free energy as follows\nPyy = Pxx − ρ\n\n∂g\n∂W\n\n(9)\n\n.\nPxx\n\nRegarding the positional distributions of the disks, ψ0 (y) eigenfunction gives\naccount of the positional ordering along the vertical direction, because ψ02 (y) is the\nprobability density distribution function and ρ(y) = ρψ02 (y) is the particle number\ndensity distribution function along y axis. Other important function which measures the\nposititional Dcorrelation in the vertical\ndirections between two particles i and j is defined\nE\nas g(i, j) = (yi − hyi i)(yj − hyj i) . For the present case we only need to calculate the\nNPxx T ensemble average of the products of the horizontal positions of particles i and j\n(g(i, j) = hyi yj i), because the average position of the particles is trivially zero (hyi i = 0).\nIt can be shown by using the eigenvalues and eigenfunctions that\ng(i, j) =\n\n∞\nX\n\nk=1\n\nλk\nλ0\n\n!|i−j|\n\n\n\n\n\nW/2\nZ\n\n−W/2\n\n2\n\n(10)\n\ndy ψ0 (y) y ψk (y) .\n\n\nNote that the fluctuation in the vertical position is given by\nW/2\nZ\n\ng(i, i) =\n\ndy ψ02 (y) y 2 .\n\n(11)\n\n−W/2\n\nIt can be seen from equation (10) that the correlation function decays exponentially for\n|i − j| → ∞, i.e. we can write that g(i, j) ∼ exp(−|i − j|/ξ), where the correlation\nlength (ξ) is given by ξ = (ln |λ0 /λ1 |)−1 . Besides the transverse correlations it is also\nnecessary to get information about the longitudinal positional order to characterize the\nstructure of the confined disks. We do this by the MC simulation of the longitudinal pair\ndistribution function. This function is computed by our own Monte Carlo simulation in\ncanonical ensemble (NAT) from the expression\n\u0012\n\n′\n\n′′\n\n\u0013\n\n−2\n\ng x = |x − x | = ρ\n\n*\n\nXX\ni\n\nj6=i\n\n′\n\n′′\n\nδ(xi − x ) δ(xj − x )\n\n+\n\n.\n\n(12)\n\nNAT\n\nIn this expression the configurations are collected from the simulation of 1000 hard\ndisks, which are sampled from 105 configurations beyond an equilibration process of 105\nconfigurations. The starting configuration is a triangular lattice, where the particles are\nat the two walls in alternating up-down sequence. In addition, the periodic boundary\ncondition is used in the horizontal direction in all studied cases. Using the Metropolis\nsampling, the particles are chosen and moved randomly with an adjusted maximum\ndisplacement to ensure the requirement of 40-50% acceptance probability of all trials.\nDue to the simple form of the pair potential and the external field, one trial move of a\nchosen particle is accepted if the particle does not overlap with its neighbors and the\nwalls.\n\n\f7\n\nStructural properties of hard disks in a narrow tube\n3. Analytically solvable model\n\nIn this section we proceed by searching for the analytical solution of the eigenvalue\nequation (6). We are facing an integral equation which corresponds to a homogeneous\nFredholm equation of the second type. Due the non-separable form of the contact\ndistance σ(yi , yi+1) and the integral kernel, it is well-known that the Fredholm equation\ndoes not have a general solution. In previous studies, Kofke and Post [27] solved equation\n(6) by the standard iterative solution, while Kamenetskiy et al. [30] considered only the\nhigh pressure limit and performed a perturbative calculation.\nHere we show that equation (6) has analytical solutions in a closed form if the\nhorizontal projection of the contact distance is given in the following form\n(13)\n\nσ(yi , yi+1 ) = c0 + c|yi − yi+1 | ,\n\nwhere c0 and c are constants. This formula can be seen as an approximative expression\nfor the contact distance of confined hard disks. Expanding the exact contact distance\nof disks around yi − yi+1 = ±W up to first order in yi − yi+1 we obtain\n\nW\nD2\n,\nc = −√ 2\n.\n(14)\n2\n2\nD −W\nD − W2\nThe reliability of the first order Taylor expansion is presented in figure 2, where the\ncurve of the exact contact distance is compared to the approximate formula (13) at\ndifferent widths of the tube. We can see that the equation (13) works quite accurately\nfor narrow tubes, but the error of (13) can even exceed 60% for W = 0.8D at zero\ndistance. However, at close packing limit this expansion is justified even at wider tubes\nbecause the neighboring disks are forced to be at the opposite walls to fill in the space\nmost efficiently. Furthermore, equation (13) gives exact formula for the hard rhombuses\nwhich can not rotate and one of their diagonal axes is constrained to be parallel to the\nwall. Denoting the lengths of the transverse and longitudinal axes of a rhombus as a and\nb respectively, it is easy to show that σ = b − b|yi − yi+1 |/a. Now we are at the stage to\npresent the solutions of equation (6), which is now supplemented by equation (13) with\nc0 and c < 0 constants. The largest eigenvalue and the corresponding eigenfunction are\ngiven by\n\u0013\n\u0012\nc0 P ∗\n2c\n,\n(15a)\nexp −\nλ0 = D\n(cP ∗ )2 − κ20\nD\nc0 = √\n\n!1/2\n\n1\n2κ0\ny\nψ0 (y) = √\n,\n(15b)\ncosh κ0\nD\nD sinh(κ0 W/D) + κ0 W/D\nwhere κ0 is the unique positive solution of the following equation\n\u0012\n\u0013\nW\n∗\nκ0 = −cP coth κ0\n,\n(15c)\n2D\nand P ∗ = βPxx W D is the dimensionless preassure. Using the above eigenvalue we can\ndetermine the Gibbs free energy, linear density and the transverse pressure component,\nwhile the transverse density profile can be obtained with the aid of ψ0 eigenfunction.\nIt is important to know the other solutions of the eigenvalue equation, because the\n\u0012\n\n\u0013\n\n\f8\n\nStructural properties of hard disks in a narrow tube\n1.8\n\nW/D = 0.8\nW/D = 0.5\nW/D = 0.2\n\n1.6\n\nσ(yi, yi+1)/D\n\n1.4\n\n1.2\n\n1.0\n\n0.8\n\n0.6\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n(yi − yi+1)/D\n\nFigure 2: Horizontal projection of the contact distance between two disks as a function\nof their vertical distance. The first order approximation of the excluded distance is\nshown for different tube widths.\npair correlation function (10) contains them. In absolute value the second largest\neigenvalue, λ1 , and the corresponding eigenfunction, ψ1 , depend on the pressure. In\nthe high pressure case, when −cP ∗ W/D > 2,\nλ1 = D\n\nc0 P ∗\n2c\n,\nexp\n−\n(cP ∗ )2 − κ21\nD\n\u0012\n\n\u0013\n\n(16a)\n!1/2\n\n1\n2κ1\ny\nψ1 (y) = √\n,\nsinh κ1\nD\nD sinh(κ1 W/D) − κ1 W/D\nwhere κ1 is the unique positive solution of the following equation\n\u0012\n\u0013\nW\n∗\nκ1 = −cP tanh κ1\n.\n2D\nIn the low pressure case, when −cP ∗ W/D < 2,\nλ1 = D\n\n\u0013\n\n\u0012\n\nc0 P ∗\n2c\n,\nexp\n−\n(cP ∗ )2 + κ21\nD\n\u0012\n\n1\nψ1 (y) = √\nD\n\n\u0013\n\n2κ1\nκ1 W/D − sin(κ1 W/D)\n\n(16b)\n\n(16c)\n\n(17a)\n!1/2\n\n\u0012\n\nsin κ1\n\ny\n,\nD\n\u0013\n\n(17b)\n\nwhere κ1 is the unique solution of the following equation in the interval κ1 ∈ [0, πD/W ]\nW\nκ1 = −cP tan κ1\n2D\n∗\n\n\u0012\n\n\u0013\n\n.\n\n(17c)\n\n\f9\n\nStructural properties of hard disks in a narrow tube\n\nIn the case of −cP ∗ W/D = 2 the above two groups of formulas (16) and (17) give\n√\nthe same limit: λ1 = D 2c exp (−c0 P ∗ /D) /(cP ∗ )2 , and ψ1 (y) = 2 3W −3/2 y. We must\nmention that λ1 < 0 in all cases. This is the reason why the correlation function shows\nalternating behaviour.\nAll of the remaining eigenvalues and eigenfunctions can be summarized for odd and\neven indices as follows.\n\u0013\n\u0012\nc0 P ∗\n2c\n,\ni = 2, 3, . . .\n(18a)\nexp\n−\nλi = D\n(cP ∗ )2 + κ2i\nD\nψi (y) =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n√\nD\n\n2κi\nκi W/D + sin(κi W/D)\n\n!1/2\n\ncos κi\n\ny\n,\nD\n\nif i is even\n\n1\n√\nD\n\n2κi\nκi W/D − sin(κi W/D)\n\n!1/2\n\ny\n,\nsin κi\nD\n\nif i is odd\n\n\u0012\n\n\u0012\n\n\u0013\n\n\u0013\n\n(18b)\n\nwhere κi (i = 2, 3, . . .) are the unique solutions of the following equation in the intervals\nκi ∈ [(i − 1)πD/W, iπD/W ]\nκi =\n\n\n\u0012\n\u0013\nW\n\n∗\n\n +cP cot κi\n\n2D\n\u0013\n\u0012\n\nW\n\n\n −cP ∗ tan κi\n\n,\n\nif i is even\n(18c)\n\n,\nif i is odd.\n2D\nFinally we mention that equation (6) has also analitic solution for c > 0, but they\nare different and have relevance for the system of freely rotating hard needles in one\ndimension [33].\n4. Results and discussions\nIn this section we begin with the presentation of our numerical results for the pressure\ncomponents, density profiles and some structural properties. To do this we make a\nconnection between the present model and an analytically solvable reference system.\nIn the limit of W → 0, the system becomes a one-dimensional fluid of hard rods with\ndiameter D, which is the well-know Tonks gas [15]. We can achieve the Tonks gas\nbehaviour at finite width, too, by equating the contact distance to D at any transverse\nseparation, i.e. σ(yi , yi+1 ) = D for all horizontal positions. This case corresponds\nto the system of parallel\nhard squares in a tube. It is easy to show that equation\n√\n(6) gives ψ0 = 1/ W and λ0 = exp(−βPxx W D)/(βPxxD) for the squares and the\nrelation between the pressure and the Gibbs free energy gives back the Tonks equation\nfor the pressure, which is βPxx W = ρ/(1 − ρD). From the equation of transverse\npressure (9) we get that the squares behaves as an ideal gas between the two walls,\ni.e. βPyy = N/(LW ). Since the contact distance deviates only slightly from D in\nvery narrow tubes (see figure 2), the confined parallel hard squares can considered as\na reference system of the hard disks. Our numerical results show that the system of\nhard disks follows the phase behaviour of hard squares in narrow tubes. This can be\nobserved even in figure 3 for W = D/2, where the transverse and longitudinal pressure\n\n\fStructural properties of hard disks in a narrow tube\n\n10\n\n√\ncomponents are shown as a function of linear packing fraction (η = ρ D 2 − W 2 ).\nThe longitudinal pressure follows the Tonks equation, while the transverse one can\nbe described by the ideal gas law up to 80% occupation of the longitudinal direction\n(η ≈ 0.8). The transverse density profile also shows\n√ that the density is almost constant\nacross the tube for βPxx W D = 5, i.e. ψ0 = 1/ W is a reasonable approximation up\nto η ≈ 0.8 for hard disks. For higher pressures (packing fractions) the density profile is\npeaked at the walls and there are less particles in the centre of the tube, which is shown\nat βPxx W D = 25. The results are more interesting at the possible widest tube width\n√\n(W = D 3/2), which can be studied exactly taking into account the nearest neighbour\ninteractions only. The Tonks gas and the ideal gas behaviour are lost at much lower\npacking and the derivative of the longitudinal pressure shows non-monotonic behaviour\nwith the density. It has two inflection points at intermediate packing fractions and it\nis crossed by the transverse pressure in the vicinity of larger inflection point. These\nresults suggest that some positional rearrangement must take place in the system to\ngive rise a big change in the pressure. Especially the cross point between the two\npressure components is very informative. It means that the particles must interact\nwith each other very strongly along the transverse direction, which can only happen\nif the particles are in alternating arrangement at the walls. This speculation is also\nsupported by the density profiles shown in the inset of figure 3. A deeper understanding\nof the positional ordering can be gained from the transverse pair correlation function\n(10), which measures the propagation of the fluctuations between the particles. Figure\n4 highlights two important features of the positional ordering. Firstly the correlation\nlength diverges with the pressure (density), which shows that the size of the ordered\nclusters increases and a solid-like structure may emerge at the close packing. Secondly\nthe oscillatory behaviour of the correlation function gives information about the spatial\narrangement of the disks, namely if one particle moves into one given transverse direction\nits neighbor does it in the opposite way. This type of correlation can occur only if the\nparticles are located in an alternating up-down sequence. At low pressures only short\nrange alternating arrangement takes place, but the ordered clusters grows exponentially\nat higher pressures and the arrangement become similar to a section of a triangular\nlattice. As the correlation length does not diverge below the close packing, no phase\ntransition between fluid and solid phases can occur in the physical meaningful density\nrange. We can also see that the transverse correlation becomes stronger in wider tubes,\nas the alternating packing becomes entropically more favored and it is getting harder\nto make jumps between the two walls.\nThe longitudinal pair distribution function also helps us to understand the\nstructural changes occurring in the tube. The results of our canonical MC simulation\nshows that in case of low pressures the average distance between the neighboring disks\nis in the order of D for both narrow and wide tubes. This means that at low packing the\nconfined hard disk systems behave like the Tonks gas. Figure 5 shows that one additional\nfirst peak emerges in the pair distribution function at intermediate packing, which means\nthat the system is just between the Tonks gas and solid-like behaviours. In the very dense\n\n\f11\n\nStructural properties of hard disks in a narrow tube\n50\n\n∗\nPxx\n∗\nPyy\n40\n\n∗\nPxx\n= 25\n\n10\n\nPii∗\n\n30\n\nρ∗(y)\n\n8\n6\n4\n∗\nPxx\n=5\n\n2\n0\n\n20\n\n-0.25-0.15-0.05 0.05 0.15 0.25\n\ny∗\n10\n\n0\n0.0\n\n0.2\n\n0.4\n\nη\n\n0.6\n\n0.8\n\n1.0\n\n(a)\n\n20\n\n∗\nPxx\n∗\nPyy\n16\n\n8\n\n1.1\n1.0\n0.9\n0.8\n0.7\n0.6\n-0.5\n\n0.0\n\n√\n\n3\n\n√\n∗\nPxx\n=6 3\n\n0.5\n\ny∗\n\n20\n\nρ∗(y)\n\nPii∗\n\n12\n\nρ∗(y)\n\n∗\nPxx\n=\n\n4\n\n15\n10\n5\n0\n-0.5\n\n0.0\n\n0.5\n\ny∗\n0\n0.0\n\n0.2\n\n0.4\n\nη\n\n0.6\n\n0.8\n\n1.0\n\n(b)\n\nFigure 3: Horizontal (Pxx ) and vertical pressure (Pyy ) components as a function\n√\nof packing fraction for W = D/2 (upper panel) and W = D 3/2 (lower panel).\nThe density profiles (ρ∗ (y) = ρ(y)D) along y axis are shown in the insets. The\ninflection points are marked by diamond symbols. The pressure components are\nmade dimensionless as follows Pii∗ = βPii DW , while the packing fraction is defined\n√\nas η = ρ D 2 − W 2 .\n\n\f12\n\nStructural properties of hard disks in a narrow tube\n100.0\n∗\nPxx\n= 50\n\ng(i, j)\n\n0.05\n\n0.0\n\n-0.05\n\n10.0\n\n0\n\n4\n\n8\n\n12\n\n16\n\n20\n\nξ∗\n\n|i − j|\n∗\nPxx\n= 25\n\n0.04\n\ng(i, j)\n\n1.0\n\n0.0\n\n-0.04\n0\n\n4\n\n8\n\n12\n\n16\n\n20\n\n|i − j|\n0.1\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n∗\nPxx\n\n(a)\n\n10000.0\n∗\nPxx\n= 14\n\ng(i, j)\n\n0.2\n\n1000.0\n\n0.0\n\n-0.2\n0\n\n100.0\n\n4\n\n8\n\n12\n\n16\n\n20\n\nξ∗\n\n|i − j|\n∗\nPxx\n=8\n\n10.0\n\ng(i, j)\n\n0.2\n\n0.0\n\n1.0\n-0.2\n0\n\n4\n\n8\n\n12\n\n16\n\n20\n\n|i − j|\n0.1\n0\n\n4\n\n8\n\n12\n\n16\n\n20\n\n∗\nPxx\n\n(b)\n\nFigure 4: Vertical correlation length (ξ ∗ = ξ/D) as a function of linear pressure\n√\n(P ∗ = βPxx W D) for W = D/2 (upper panel) and W = D 3/2 (lower panel). Vertical\npair correlation function (g(i, j) = hyi yj i) are shown as a function of pair separation\n(|i − j|) in the insets.\n\n\f13\n\nStructural properties of hard disks in a narrow tube\n17.0\n\nη = 0.779\nη = 0.883\nη = 0.952\n\n13.6\n\nη = 0.779\n\ng(x∗)\n\n10.2\n\nη = 0.883\n6.8\n\n3.4\n\nη = 0.952\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nx∗\n\n(a)\n\n3.0\n\nη = 0.5\nη = 0.6\nη = 0.7\n\n2.5\n\nη = 0.5\n\ng(x∗)\n\n2.0\n\nη = 0.6\n\n1.5\n\n1.0\n\n0.5\n\nη = 0.7\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nx∗\n\n(b)\n\nFigure 5: Pair distribution function (g(x)) as a function of distance (x∗ = x/D) for\n√\nW = D/2 (upper panel) and W = D 3/2 (lower panel). MC simulation snapshots are\nshown at the corresponding packing fractions.\n\n\f14\n\nStructural properties of hard disks in a narrow tube\n20\n\nanalitical solution\nnumerical solution\n16\n\n∗\nPxx\n\n12\n\n8\n\n4\n\n0\n0.0\n\n0.2\n\n0.4\n\nη\n\n0.6\n\n0.8\n\n1.0\n\nFigure 6: Equation of state (longitudinal pressure component vs. packing fraction)\nof the confined hard disks and that of analytical model where P ∗ = βPxx W D and\n√\nη = ρ D2 − W 2.\nsystems, the second peak completely disappears, the distribution function is extremely\npeaked and the distance between the peaks is less than D. This can only happen if the\nparticles are in the alternating solid-like structure. These results are confirmed by the\ncorresponding simulation snapshots presented in figure 5, too. Note that the locations\nof the inflection points in the transverse pressure are in accordance with the structural\nchanges of the pair distribution function and the simulations snapshots.\nIn the rest of this section our analytical and the numerical results are compared and\nwe discuss the strength and the weakness of the applied approximation for the contact\ndistance. Figure 6 shows the analytical and the numerical longitudinal pressures as\na function of packing fraction for W = 0.8D. We can see that the low and high\ndensity behaviours of both solutions agree very well. This is not surprising because\nboth are ideal gas at low density and both are packed in the same alternating (triangular\nlattice-like) structure at the close packing. However, the two pressure curves deviate\nsubstantially at the intermediate pressures and even a crossover takes place between\nthem at η ≈ 0.5. It is easy to understand that these behaviours stem from the\nexaggeration of the contact distance for small transverse positional differences. Figure\n2 shows that the contact distance is overestimated by about 70% for |yi − yi+1 | = 0\nin the case of W = 0.8D. Consequently the particles of the analytical model always\ninteract with larger contact distances in all horizontal positions and they occupy larger\n\n\f15\n\nStructural properties of hard disks in a narrow tube\n100.0\n\nξ∗\n\n10.0\n\n1.0\n\nW/D = 0.5\nW/D = 0.8\n0.1\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n∗\nPxx\n\nFigure 7: Comparison of the correlation lengths of the confined hard disks and that of\nthe analytical model, where ξ ∗ = ξ/D and P ∗ = βPxx W D. Solid curves corresponds to\nthe analytical model, dashed curve to the asymptotic formula for the analytical model\nand short dashed curve for the hard disks.\nregions of the space. As a result, the analytical model possess higher pressure in the\nTonks gas regime and it undergoes the fluid-solid structural change at lower densities\nthan the system of hard disks. We can also see that the particles are pushed more\nstrongly to the walls in the analytical model than in the numerical one to produce lower\npressures at high densities. In the analytical model it is feasible to determine\nthe high\u0011\n\u0010\n√\n2\ndensity limit of the pressures analytically. We get that βPxx W = 2ρ/ 1 − ρ D − W 2\n\u0010\n\n\u0011\n\nand Pyy /Pxx = 12 1 + 1/(1 − W 2 /D 2 ) . The first expression tells us that the structural\nchange gives an extra factor two in the well-known Tonks equations, while the second\none shows that the transverse pressure becomes higher than the longitudinal one for\nall possible widths at the close packing. Note that the above relation between Pxx and\nPyy is probably not true for hard disks and the phase behaviour of the two systems is\nnot the same at high densities. We cannot prove it, because the eigenvalue equation\n(6) cannot be solved numerically at very high pressures. However the examination of\nthe correlation length reveals the differences residing in the two models (see figure 7).\nFor the analytical model an expression can be derived for very high pressures, which\nis given by ξ = − exp(−cβPxx W 2 )/(4cβPxx W 2 ), while ξ is determined from equations\n(15a) and (16a). Apart from the low-density limit the numerical and the analytical\ncorrelation lengths diverges with different slope with increasing pressure. We can see\n\n\f16\n\nStructural properties of hard disks in a narrow tube\n12\n\nρ(y)\n\n8\n\ng(i, j)\n\n0.04\n\n0.0\n\n-0.04\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n|i − j|\n\n4\n\n0\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\ny∗\n\nFigure 8: Density profile of confined hard disks (solid curve) and that of analytical model\n√\n(dashed curve) at pore width W = D/2 for η = 3/2. Inset shows the corresponding\ntransverse pair correlation function, where diamonds correspond to the confined hard\ndisks, while the filled circles to the analytical model.\nthat the analytical model is more correlated than the numerical one at the same pressure.\nIt is also clear that the pressure is sufficiently high for the comparison because the\nanalytical expression for the high pressure limit of the correlation length fits the exact\none. The reason for the difference in the high pressure limit of the correlations is that\nthe analytical model can pack more efficiently than the numerical one. The numerical\nmodel corresponds to the confined system of hard rhombuses with longer horizontal\nextension, i.e. it is harder for them to move between the two walls without overlapping\nwith the neighbors. The uncorrelated movement is much easier for the disks, because\nthey are more rounded than the rhombuses. Therefore the first order expansion of\nthe contact distance gives rise to a stronger tendency for positional ordering and the\ntwo systems do not behave identically for very high pressures. Finally we compare the\ndensity profiles and the correlation functions of the two models in figure 8. It confirms\nour present results that the analytical model is more ordered than the hard disks at\nthe walls, the correlations are also stronger in the analytical model and the structure of\nsolid-like clusters are triangular lattice-like in both models.\nIn summary we can say that apart from some quantitative differences between the\ntwo models, it is proved very useful to devise the analytical model because it follows\nclosely the phase behaviour of the confined hard disks. Furthermore analytical equations\n\n\fStructural properties of hard disks in a narrow tube\n\n17\n\ncan be derived for the pressure, density profile and correlation function, which make\npossible to examine the high pressure limit of the equation of state and the correlation\nlength.\n5. Conclusions\nIn this paper we have studied the phase behaviour of two-dimensional hard disks confined\nbetween two parallel lines by the transfer-matrix method and MC simulations. The\n√\nwidth of the tube is restricted to the range of 0 < W < D 3/2 to guarantee the\nexact statistical mechanical treatment of the system by taking into account the nearest\nneighbour interactions only. In summary the following important results are obtained:\n(i) The numerical investigation of the thermodynamic and structural properties has\nshown that no phase transition occurs in very narrow tubes. However there are\nsome indications of the structural change between a fluid-like and the solid-like\nstructures. These are the followings:\n(a) the longitudinal pressure component may possess two inflection points,\n(b) the longitudinal pressure deviates from the ideal gas law and it may exceed\nthe transverse pressure component,\n(c) the pair correlation function shows damped oscillation, decays exponentially\nwith the distance and it becomes infinitely long-ranged in the close packing\nlimit,\n(d) the pair distribution function changes from the typical Tonks gas behaviour\nto a solid-like one having shorter period.\n(ii) It has been managed to device an exactly solvable system, which is obtained\nby the first order Taylor expansion of the contact distance between two hard\ndisks. It has been shown that the new system corresponds to the system of\nparallel rhombuses between parallel walls. The eigenfunctions and eigenvalues and\nthe corresponding pressure components, density distribution and pair correlation\nfunction are determined in analytical form. The analytically solvable model\nreproduces all important properties of the confined hard disks and makes possible\nto determine the close packing properties of the pressure and the correlation length.\n(iii) The numerical, analytical and simulation studies show together that the disks\narrange themselves into an up-down sequence, where the neighboring particles\nare forced to stay at the opposite walls. The size of the alternating (triangular\nlattice-like) clusters becomes larger with increasing density and diverges at the\nclose packing density. At such packing where the dominant interactions changes\ntheir directions from the horizontal direction to the vertical one, the longitudinal\npressure and the pair distribution function shows unexpected behaviours.\nEven though our present study is exact only for very narrow tubes we believe that it is\na step forward to understand the crystallization of two-dimensional bulk and confined\nfluids. It would be especially interesting to go beyond the nearest neighbor restriction\n\n\fStructural properties of hard disks in a narrow tube\n\n18\n\nand examine the effect of the width on the nature of the structural rearrangement. It\nmay happen that the correlation length diverges at finite density and first order phase\ntransition takes place between a fluid and solid phases. In very narrow pores it may\npossible to examine the dynamical properties of the hard disk analytically, which may\ngive deeper insight into the triangular lattice solidification of the fluid. One step ahead in\nthis direction is the recent study of Arenzon et. al. [34], where the dynamical properties\nof the one-dimensional system of rotating hard rectangles have been examined. In the\nvery recent study of Herrera-Velarde et al. [35], common structural and dynamical\nbehaviors have been found at the transitions from fluid-like to solid-like structures in\nsome repulsive one-dimensional systems.\nReferences\n[1] Gelb L D, Gubbins K E, Radhakrishnan R, and Sliwinska-Bartkowiak M, 1999 Rep. Prog. Phys.\n62 1573\n[2] Romanowsky M B, Heymann M, Abate A R, Krummel A T, Fraden S, and Weitz D A, 2010 Lab\nChip 10 1521\n[3] Smith R L, Demers C J, Collins S D, 2010 Microfluid Nanofluid 9 613\n[4] Majumde M, Chopra N, Hinds B J, 2011 ACS Nano 5 3867\n[5] Kyakuno H, Matsuda K, Yahiro H, Inami Y, Fukuoka T, Miyata Y, Yanagi K, Maniwa Y, Kataura\nH, Saito T, Yumura M and Iijima S, 2011 J. Chem. Phys. 134 244501\n[6] Boda D, Nonner W, Henderson D, Eisenberg B and Gillespie D, 2008 Biophys. J. 94 3486\n[7] Rutkai G, Csanyi E and Kristof T, 2008 Microporous and Mesoporous Materials 114 455\n[8] Gordillo M C, Martínez-Haya B and Romero-Enrique J M, 2006 J. Chem. Phys. 125 144702\n[9] Durán-Olivencia F J and Gordillo M C, 2009 Phys. Rev. E 79 061111\n[10] Mughal A, Chan H K and Weare D, 2011 Phys. Rev. Lett. 106 115704\n[11] Kim H, Goddard III W A, Han K H, Kim C, Lee E K, Talkner P and Hanggi P, 2011 J. Chem.\nPhys. 134 114502\n[12] Pickett G T, Gross M, and Okuyama H, 2000 Phys. Rev. Lett. 85 3652\n[13] Lohr M A, Alsayed A M, Chen B G, Zhang Z, Kamien R D and Yodl A G, 2010 Phys. Rev. E 81\n040401\n[14] Nygard K, Satapathy D K, Buitenuis J, Perret E, Bunk O, David C and van der Veen J F, 2009\nEPL 86 66001\n[15] Tonks L, 1936 Phys. Rev. , 50, 955\n[16] Salsburg Z W, Zwanzig R W and Kirkwood J G, 1953 J. Chem. Phys. 21 1098\n[17] Vo T T M, Chen L-J and Robert M, 2003 J. Chem. Phys. 119 5607\n[18] Fantoni R, Giacometti A, Malijevský A, and Santos A, 2010 J. Chem. Phys. 133 024101\n[19] Hansen-Goos H, Lutz C, Bechinger C and Roth R, 2006 Europhysics Letters 74 8\n[20] Carraro C, 2003 Phys. Rev. E 67 051502\n[21] Drory A, 1997 Phys. Rev. E 55 3878\n[22] Giaquinta P V, 2008 Entropy 10 248\n[23] Jaster A, 1999 Phys. Rev. E 59 2594\n[24] Mak C H, 2006 Phys. Rev. E 73 065104(R)\n[25] Barker J A, 1962 Aust. J. Phys. 15 127\n[26] Post A J and Kofke D A, 1992 Phys. Rev. A 45 939\n[27] Kofke D A and Post A J, 1993 J. Chem. Phys. 98 4853\n[28] Schwartz M, 2010 Physica A 389 731\n[29] Percus J K, 2002 Mol. Phys. 100 2417\n[30] Kamenetskiy I E, Mon K K and Percus J K, 2004 J. Chem. Phys. 121 7355\n\n\fStructural properties of hard disks in a narrow tube\n[31]\n[32]\n[33]\n[34]\n[35]\n\nForster Ch, Mukamel D and Posch H A, 2004 Phys. Rev. E 69 066124\nMukamel D and Posch H A, 2009 J. Stat. Mech.: Theory Exp. P03014\nGurin P and Varga S, 2011 Phys. Rev. E 83 061710\nArenzon J J, Dhar D, Dickman R, 2011 Phys. Rev. E 84 011505\nHerrera-Velarde S, Zamudio-Ojeda A, Castañeda-Priego R, 2010 J. Chem. Phys. 133 114902\n\n19\n\n\f"}