{"id": "http://arxiv.org/abs/1006.3797v1", "guidislink": true, "updated": "2010-06-18T20:15:01Z", "updated_parsed": [2010, 6, 18, 20, 15, 1, 4, 169, 0], "published": "2010-06-18T20:15:01Z", "published_parsed": [2010, 6, 18, 20, 15, 1, 4, 169, 0], "title": "Can periodicity in low altitude cloud cover be induced by cosmic ray\n  variability in the extragalactic shock model?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1852%2C1006.2620%2C1006.2947%2C1006.0952%2C1006.5068%2C1006.4197%2C1006.0440%2C1006.5490%2C1006.4713%2C1006.3356%2C1006.0408%2C1006.1626%2C1006.5134%2C1006.4384%2C1006.0090%2C1006.3520%2C1006.4513%2C1006.3822%2C1006.5296%2C1006.1860%2C1006.4657%2C1006.0684%2C1006.0017%2C1006.2609%2C1006.1377%2C1006.5064%2C1006.5888%2C1006.1511%2C1006.4609%2C1006.2830%2C1006.2770%2C1006.3306%2C1006.0897%2C1006.5347%2C1006.5422%2C1006.0073%2C1006.2214%2C1006.0953%2C1006.4030%2C1006.3547%2C1006.3522%2C1006.0035%2C1006.0497%2C1006.0031%2C1006.5869%2C1006.0742%2C1006.5591%2C1006.4789%2C1006.2081%2C1006.4427%2C1006.0865%2C1006.5001%2C1006.5830%2C1006.1176%2C1006.3463%2C1006.1899%2C1006.3134%2C1006.4403%2C1006.5278%2C1006.3369%2C1006.0395%2C1006.2265%2C1006.2778%2C1006.5237%2C1006.2961%2C1006.4064%2C1006.5890%2C1006.5118%2C1006.2472%2C1006.1312%2C1006.2668%2C1006.4041%2C1006.1331%2C1006.0977%2C1006.3667%2C1006.1060%2C1006.0985%2C1006.5583%2C1006.1684%2C1006.1756%2C1006.1588%2C1006.5864%2C1006.2314%2C1006.1695%2C1006.1106%2C1006.2584%2C1006.4542%2C1006.4150%2C1006.2991%2C1006.0288%2C1006.4468%2C1006.0358%2C1006.2939%2C1006.1545%2C1006.4071%2C1006.1339%2C1006.3044%2C1006.3279%2C1006.0550%2C1006.3797%2C1006.2560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Can periodicity in low altitude cloud cover be induced by cosmic ray\n  variability in the extragalactic shock model?"}, "summary": "Variation in high energy cosmic rays (HECRs) has been proposed to explain a\n62 My periodicity in terrestrial fossil biodiversity. It has been suggested\nthat the infall of our galaxy toward the Virgo cluster could generate an\nextragalactic shock, accelerating charged particles and exposing the earth to a\nflux of high energy cosmic rays (HECRs). The oscillation of the Sun\nperpendicular to the galactic plane could induce 62 My periodicity in the HECR\nflux on the Earth, with a magnitude much higher than the Galactic cosmic ray\nchange we see in a solar cycle. This mechanism could potentially explain the\nobserved 62 My periodicity in terrestrial biodiversity over the past 500 My. In\naddition to direct effects on life from secondaries, HECRs induced air showers\nionize the atmosphere leading to changes in atmospheric chemistry and\nmicrophysical processes that can lead to cloud formation including low altitude\ncloud cover. An increase in ionization changes the global electric circuit\nwhich could enhance the formation of cloud condensation nuclei (CCN) through\nmicrophysical processes such as electroscavenging and ion mediated nucleation,\nleading to an increase in the cloud cover. This could increase the albedo and\nreduce the solar flux reaching the ground, reducing the global temperature.\nUsing an existing model, we have calculated the enhancement in atmospheric\nionization at low altitudes resulting from exposure to HECRs. We use a\nconservative model to estimate the change in low altitude cloud cover from this\nincreased ionization.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1852%2C1006.2620%2C1006.2947%2C1006.0952%2C1006.5068%2C1006.4197%2C1006.0440%2C1006.5490%2C1006.4713%2C1006.3356%2C1006.0408%2C1006.1626%2C1006.5134%2C1006.4384%2C1006.0090%2C1006.3520%2C1006.4513%2C1006.3822%2C1006.5296%2C1006.1860%2C1006.4657%2C1006.0684%2C1006.0017%2C1006.2609%2C1006.1377%2C1006.5064%2C1006.5888%2C1006.1511%2C1006.4609%2C1006.2830%2C1006.2770%2C1006.3306%2C1006.0897%2C1006.5347%2C1006.5422%2C1006.0073%2C1006.2214%2C1006.0953%2C1006.4030%2C1006.3547%2C1006.3522%2C1006.0035%2C1006.0497%2C1006.0031%2C1006.5869%2C1006.0742%2C1006.5591%2C1006.4789%2C1006.2081%2C1006.4427%2C1006.0865%2C1006.5001%2C1006.5830%2C1006.1176%2C1006.3463%2C1006.1899%2C1006.3134%2C1006.4403%2C1006.5278%2C1006.3369%2C1006.0395%2C1006.2265%2C1006.2778%2C1006.5237%2C1006.2961%2C1006.4064%2C1006.5890%2C1006.5118%2C1006.2472%2C1006.1312%2C1006.2668%2C1006.4041%2C1006.1331%2C1006.0977%2C1006.3667%2C1006.1060%2C1006.0985%2C1006.5583%2C1006.1684%2C1006.1756%2C1006.1588%2C1006.5864%2C1006.2314%2C1006.1695%2C1006.1106%2C1006.2584%2C1006.4542%2C1006.4150%2C1006.2991%2C1006.0288%2C1006.4468%2C1006.0358%2C1006.2939%2C1006.1545%2C1006.4071%2C1006.1339%2C1006.3044%2C1006.3279%2C1006.0550%2C1006.3797%2C1006.2560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Variation in high energy cosmic rays (HECRs) has been proposed to explain a\n62 My periodicity in terrestrial fossil biodiversity. It has been suggested\nthat the infall of our galaxy toward the Virgo cluster could generate an\nextragalactic shock, accelerating charged particles and exposing the earth to a\nflux of high energy cosmic rays (HECRs). The oscillation of the Sun\nperpendicular to the galactic plane could induce 62 My periodicity in the HECR\nflux on the Earth, with a magnitude much higher than the Galactic cosmic ray\nchange we see in a solar cycle. This mechanism could potentially explain the\nobserved 62 My periodicity in terrestrial biodiversity over the past 500 My. In\naddition to direct effects on life from secondaries, HECRs induced air showers\nionize the atmosphere leading to changes in atmospheric chemistry and\nmicrophysical processes that can lead to cloud formation including low altitude\ncloud cover. An increase in ionization changes the global electric circuit\nwhich could enhance the formation of cloud condensation nuclei (CCN) through\nmicrophysical processes such as electroscavenging and ion mediated nucleation,\nleading to an increase in the cloud cover. This could increase the albedo and\nreduce the solar flux reaching the ground, reducing the global temperature.\nUsing an existing model, we have calculated the enhancement in atmospheric\nionization at low altitudes resulting from exposure to HECRs. We use a\nconservative model to estimate the change in low altitude cloud cover from this\nincreased ionization."}, "authors": ["Dimitra Atri", "Brian C. Thomas", "Adrian L. Melott", "University of Kansas", "Washburn University"], "author_detail": {"name": "Washburn University"}, "author": "Washburn University", "arxiv_comment": "10 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/1006.3797v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.3797v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.3797v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.3797v1", "journal_reference": null, "doi": null, "fulltext": "Can periodicity in low altitude cloud cover be induced by\ncosmic ray variability in the extragalactic shock model?\nDimitra Atri1, Brian C. Thomas2, and Adrian L. Melott1\n1. Department of Physics and Astronomy, University of Kansas, Lawrence, Kansas 66045, USA\n2. Department of Physics and Astronomy, Washburn University, Topeka, Kansas 66621, USA\nABSTRACT\nVariation in high energy cosmic rays (HECRs) has been proposed to explain a 62 My\nperiodicity in terrestrial fossil biodiversity. It has been suggested that the infall of our galaxy\ntoward the Virgo cluster could generate an extragalactic shock, accelerating charged particles\nand exposing the earth to a flux of high energy cosmic rays (HECRs). The oscillation of the Sun\nperpendicular to the galactic plane could induce 62 My periodicity in the HECR flux on the\nEarth, with a magnitude much higher than the Galactic cosmic ray change we see in a solar\ncycle. This mechanism could potentially explain the observed 62 My periodicity in terrestrial\nbiodiversity over the past 500 My. In addition to direct effects on life from secondaries, HECRs\ninduced air showers ionize the atmosphere leading to changes in atmospheric chemistry and\nmicrophysical processes that can lead to cloud formation including low altitude cloud cover. An\nincrease in ionization changes the global electric circuit which could enhance the formation of\ncloud condensation nuclei (CCN) through microphysical processes such as electroscavenging\nand ion mediated nucleation, leading to an increase in the cloud cover. This could increase the\nalbedo and reduce the solar flux reaching the ground, reducing the global temperature. Using an\nexisting model, we have calculated the enhancement in atmospheric ionization at low altitudes\nresulting from exposure to HECRs. We use a conservative model to estimate the change in low\n1\n\n\faltitude cloud cover from this increased ionization.\nINTRODUCTION\nA strong ~62 My periodicity in marine biodiversity has been observed in independent\npaleobiological databases, going back to 500 My (Rhode and Muller, 2005; Melott and\nBambach, 2010 and references therein). There are two major hypotheses to explain this\nphenomenon. Certain features of the data suggest that uplift or sea level change may be involved,\nbut this does not account for periodicity (Melott and Bambach, 2010). The extragalactic shock\nmodel hypothesis (Medvedev and Melott, 2007) can account for the periodicity by the infall of\nour galaxy toward the Virgo cluster coupled with the known solar oscillation perpendicular to the\ngalactic plane (Gies and Helsel, 2005) with a period of about 62 My. The possible causal\nmechanisms, which need work, are based on enhancement of the HECR flux on the Earth\n(Medvedev and Melott, 2007). This enhanced flux results in an increase in the ionization rate in\nthe atmosphere which leads to changes in the atmospheric chemistry (not unique to radiation\nevents-see, e.g. Melott et al 2010a) These changes result in ozone depletion in the upper\nstratosphere, which increases the solar UVB flux on the ground, directly affecting the biosphere\n(Melott et al., 2010b). An ozone crisis can seriously impact life through the mechanism of a\nfood-chain crash in the oceans (Melott and Thomas, 2009, and references therein.) HECRs will\nalso result in an increased flux of high energy muons on the ground, which could directly affect\nliving organisms. Muons also have the capability to penetrate deep below the land surface as\nwell as through water. There will be an increase in thermal neutrons at ground level, which are\nalso hazardous due to their very large cross sections. The magnitude of this damage is also under\ninvestigation. Based on the results of Juckett (2007, 2009) it should be far from negligible.\nThere is some evidence that cosmic ray induced atmospheric ionization could enhance\n\n2\n\n\fthe low altitude cloud cover (Svensmark and Friis-Christensen, 1997; Enghoff and Svensmark,\n2008;Harrison et al., 2003; Harrison, 2000). Although the field of cloud microphysics is still in\nits infancy, preliminary experimentation suggests a correlation between the atmospheric\nionization and cloud formation (Dulipssy et al., 2010). This ionization change will affect the\nglobal ionosphere-earth current density Jz , which has effects on cloud microphysical processes\nsuch as electroscavenging and ion mediated nucleation (Tinsley, 2008). Change in ionization\nfrom the cosmic ray variability has been previously computed for a solar cycle, which indicates a\nlinear relationship between ionization and the low altitude cloud cover (Usoskin et al., 2004).\nHowever, other studies show a much lesser effect on the low altitude cloud cover. Most\nconservative estimates give between 10% (Kulmala et al., 2010) and 20% (Erlykin et al., 2009;\nSloan and Wolfendale, 2008) contribution to the total change in cloud cover from galactic\ncosmic rays . We note that the cosmic rays in the extragalactic hypothesis (Medvedev and\nMelott, 2007) are of higher energy, and will penetrate deeper in the atmosphere (Atri et al., 2010)\nand should have a greater effect than the galactic cosmic rays. We therefore regard 10% as a\nlower limit to the correlation.\nMuons are the primary source of atmospheric ionization at low altitudes. With an\nenhancement of HECR flux, there will be an increase in the flux of high energy muons at low\naltitudes, thereby enhancing atmospheric ionization there. This could lead to increased low\naltitude cloud cover resulting from HECR exposure, as predicted by the extragalactic shock\nmodel.\nMETHOD\nThe enhanced spectra from the extragalactic shock model results in an increase in the flux\nof primaries up to about 1 PeV. Because of the uncertainty in the values of the magnetic field\n\n3\n\n\fparameters in this model, it gives a range of possible results. Here, we explore the maxima and\nminima of HECR exposure obtained from the model. As shown in Fig 1, the minimum flux (case\n1) has the flux enhanced by a factor of 4 at a TeV and by a factor of 25 for the maximum flux\n(case 2). These primaries collide with the nuclei of N2 and O2 in the atmosphere, producing air\nshowers. These consist of charged particles and photons which ionize the atmosphere, neutrons\nand other short-lived unstable particles. The component which ionizes the atmosphere is called\nthe electromagnetic component of the shower and can break molecular bonds, leading to\natmospheric chemistry changes. As the energy of protons hitting the atmosphere goes up, the\ntotal atmospheric ionization increases and so does the ionization in the lower atmosphere. We\nhave used an existing model to compute atmospheric ionization as a function of altitude resulting\nfrom the HECR enhancement (Atri et al., 2010). This model provides the atmospheric ionization\nprofiles from 10 GeV to 1 PeV primaries. Convolving the enhanced spectra from the\nextragalactic shock model with the cosmic ray ionization model thus gives us the corresponding\nmaxima and minima of atmospheric ionization. The normal atmospheric ionization values\ncorresponding to lower energies are calculated using an existing model (Usoskin and Kovaltsov,\n2006). We concentrate on the increase in ionization from these two cases at an altitude of 3 km\n(~700 g cm-2), where most low altitude clouds reside.\nRESULTS AND DISCUSSION\nWe compared the values of atmospheric ionization from the two cases with that at the\ntime of the cosmic ray maxima in a solar cycle. Looking at the total energy deposited in the\natmosphere, case 1 has a global enhancement factor of 3.2 and case 2 a factor of 30.7 (Figure 1).\nBut most of the ionization is above 10 km altitude and the enhancement at lower altitudes is\nmuch lower, as expected. At the 3 km level, for case 1 (minimal), we found an average increase\n\n4\n\n\fin ionization of 38% with 79.6% enhancement at the equator and 20.4 % at the poles. For case 2\n(maximal), the average enhancement was by a factor of 6, with 7.7 at the equator and 5.32 at the\npoles at 3 km altitude. Since higher energy primaries are unaffected by the geomagnetic field,\none gets almost the same flux of particles globally. When compared to the normal GCR flux, the\ndifference at the equator is much higher than at the poles because the normal particle flux at the\nequator is much lower than at the poles. For case 2, the flux of high energy primaries is even\nhigher, which translates to an increase in the flux of high energy muons. High energy muons,\nbecause of their very small cross sections, can penetrate deeper into the atmosphere increasing\nionization in the lower atmosphere. Using the most conservative estimates of low altitude cloud\ncover changes (10% contribution), we estimate about 4% average increase in the low altitude\ncloud cover from the minimal case and by 60% from the maximal case.\nThis large difference in our estimates is due to the large uncertainty in the HECR flux\ncalculated from the model. For the minimal case, the change in cloud cover is probably not\nenough to cause a significant global temperature change. On the other hand, the cloud cover\nchange from the maximal case is large and can certainly lead to a large drop in the global\ntemperature and increase in precipitation. The actual cloud cover change can be anywhere\nbetween the two cases discussed here. As with earlier ozone depletion computations (Melott et\nal., 2010b) the estimates of effects which may impact biodiversity appear in this case to span the\nrange from unimportant to serious.\nAn interesting aspect of this question concerns strontium isotope ratios. Melott and\nBambach (in preparation) have noted a strong 62 My periodicity in the fluctuations of the\n87\n\nSr/86Sr ratio, with the sense that this ratio rises when biodiversity drops. Such an increase\n\nwould typically be associated with uplift, but Li et al. (2007) have argued that there should be a\n\n5\n\n\fstrong temperature effect due to erosion rates of mica, raising this isotope ratio for cooler\ntemperatures. We speculate that this effect might provide a link between the natural oscillation\nfrequency and phase agreement of the extragalactic shock scenario and geoisotope data which is\nsynchronous with the biodiversity signal.\nMore accurate computations of the atmospheric chemistry effects from cosmic rays will\nbe possible in the future with better measurements of parameters used in the extragalactic shock\nmodel and especially with improvement in the understanding of cloud microphysics.\nACKNOWLEDGEMENTS\nThis research was supported by the NASA Program Astrobiology: Exobiology and\nEvolutionary Biology under grant number NNX09AM85G.\nREFERENCES CITED\nAtri, D., Melott, A.L., and Thomas, B.C., 2010, Lookup tables to compute high energy cosmic\nray induced atmospheric ionization and changes in atmospheric chemistry: Journal of\nCosmology and Astroparticle Physics, JCAP05(2010)008 DOI: 10.1088/14757516/2010/05/008.\nDuplissy, J., Enghoff, and 45 others., 2010,,Results from the CERN pilot CLOUD experiment:\nAtmospheric Chemistry and Physics: v. 10, p.1635-1647.\nEnghoff, M. B. and H. Svensmark., 2008, The role of atmospheric ions in aerosol nucleation – a\nreview: Atmospheric Chemistry and Physics, v. 8, p. 4911–4923.\nErlykin, A.D.; Gyalai, G., Kudela, K., Sloan, T., and Wolfendale, A.W., 2009, On the correlation\nbetween cosmic ray intensity and cloud cover: Journal of Atmospheric and Solar-Terrestrial\nPhysics, v. 71, p. 1794-1806.\nGies, D.R., and J.W. Helsel, 2005, Ice Age Epochs and the Sun's Path through the Galaxy:\n\n6\n\n\fAstrophysical Journal, v. 626, p. 844-847.\nHarrison, R. G, 2000, Cloud formation and the possible significance of charge for atmospheric\ncondensation and ice nuclei: Space Science Reviews, v. 626, p. 381–396.\nHarrison, R. G. and Carslaw, K.S., 2003, Ion-aerosol-cloud processes in the lower atmosphere:\nReviews of Geophysics, v. 41, 3/1012,doi:10.1029/2002RG000114.\nJuckett, D.A. (2007), Correlation of a 140-year global time signature in cancer mortality\nbirth cohorts with galactic cosmic ray variation, International Journal of Astrobiology, v.\n6, p. 307-319.\nJuckett, D.A. (2009), A 17-year oscillation in cancer mortality birth cohorts on three\ncontinents – synchrony to cosmic ray modulations one generation earlier,\nInternational Journal of Biometerology, DOI 10.1007/s00484-009-0237-0 .\nKirkby, J., 2007, Cosmic rays and climate: Surveys in Geophysics, v. 28, p. 333–375, doi:\n10.1007/s10712-008-9030-6.\nKulmala, M., and 20 others, 2010, Atmospheric data over a solar cycle: no connection between\ngalactic cosmic rays and new particle formation: Atmospheric Chemistry and Physics, v. 10,\np.1885-1898.\nLee, S.H., Reeves, J.M., Wilson, J.C., Hunton, D.E., Viggiano, A.A., Miller, T.M., Ballenthin,\nJ.O., Lait, L.R.,2003, Particle Formation by Ion Nucleation in the Upper Troposphere and\nLower Stratosphere: Science, v. 301, p. 1886-1889, DOI: 10.1126/science.1087236.\nLi, G., Chen, J., Ji, J., Liu, L., Yang, J., and Sheng, X., 2007, Global cooling forced increase in\nmarine strontium isotopic ratios: Importance of mica weathering and a kinetic approach:\nEarth and Planetary Science Letters, v. 254, p. 303-312.\nMedvedev, M.V., Melott, A.L., 2007, Do Extragalactic Cosmic Rays Induce Cycles in Fossil\n\n7\n\n\fDiversity?: Astrophysical Journal, v. 664, p. 879-889. DOI:10.1086/518757.\nMelott, A.L., Bambach, R.K., 2010, An ubiquitous ~62 Myr periodic fluctuation superimposed\non general trends in fossil biodiversity: Part I, Documentation: Paleobiology, in press.\nMelott, A.L, Thomas, B.C., Dreschhoff, G.A., and Johnson, C.K., 2010a, Cometary airbursts and\natmospheric chemistry: Tunguska and a candidate Younger Dryas event: Geology, v. 38, p.\n355-358, doi: 10.1130/G30508.1.\nMelott, A.L., Atri, D., Thomas, B.C., Medvedev, M.V., Wilson, G.W., and Murray, M.J.,\n2010b, Atmospheric consequences of cosmic ray variability in the extragalactic shock model:\nII Revised ionization levels and their consequences: Journal of Geophysical Research.,\ndoi:10.1029/2010JE003591, in press.\nMelott, A.L., and Thomas, B.C., 2009, Late Ordovician geographic patterns of extinction\ncompared with simulations of astrophysical ionizing radiation damage: Paleobiology, v. 35,\np. 311–320, doi: 10.1666/0094-8373-35.3.311.\nRam, M., Stolz, M.R.., Tinsley, B.A., 2009, Eos, The Terrestrial Cosmic Ray Flux: Its\nImportance for Climate: Transactions American Geophysical Union, v. 90, p. 397-398.\nRohde, R.A., and Muller, R.A., 2005, Cycles in fossil diversity: Nature, v. 434, p. 208-210. DOI:\n10.1038/nature03339.\nSloan, T.,, and Wolfendale, A.W., 2008, Testing the proposed causal link between cosmic rays\nand cloud cover: Environmental Research Letters, v3, 024001.\nSvensmark, H., and Friis-Christensen, E., 1997, Variation of cosmic ray flux and global cloud\ncoverage-a missing link in solar-climate relationships: Journal of Atmospheric and Terrestrial\nPhysics, v. 59, p. 1225-1232.\nTinsley, B.A., 2008, The global atmospheric electric circuit and its effects on cloud\n\n8\n\n\fmicrophysics: Reports on Progress in Physics, v. 71, DOI: doi:10.1088/00344885/71/6/066801.\nUsoskin,I.G., Marsh, N., Kovaltsov, G.A., Mursula, K., and Gladysheva, O.G., Latitudinal\ndependence of low cloud amount on cosmic ray induced ionization: Geophysical Research\nLetters, v. 31, L16109, doi:10.1029/2004GL019507.\nUsoskin, I.G., and Kovaltsov, G.A., 2006, Cosmic ray induced ionization in the atmosphere: Full\nmodeling and practical applications: Journal of Geophysical Research, v. 111, D21206,\ndoi:10.1029/2006JD007150.\n\n9\n\n\fFigure 1: Percent increase in atmospheric ionization for case 1 (solid) and case 2 (dotted) at 3 km\naltitude. The enhancement is greater at the equator than the poles because many normal cosmic\nrays are guided toward the poles by the geomagnetic field, while the cosmic rays in the extragalactic model are typically too energetic to be redirected.\n\n10\n\n\f"}