{"id": "http://arxiv.org/abs/0802.0155v1", "guidislink": true, "updated": "2008-02-01T16:19:08Z", "updated_parsed": [2008, 2, 1, 16, 19, 8, 4, 32, 0], "published": "2008-02-01T16:19:08Z", "published_parsed": [2008, 2, 1, 16, 19, 8, 4, 32, 0], "title": "Topics on bar and bulge formation and evolution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.4413%2C0802.0328%2C0802.4158%2C0802.1923%2C0802.3827%2C0802.2559%2C0802.2329%2C0802.0391%2C0802.4178%2C0802.0446%2C0802.3806%2C0802.2718%2C0802.1656%2C0802.2979%2C0802.0465%2C0802.3961%2C0802.2915%2C0802.0365%2C0802.1078%2C0802.2248%2C0802.4144%2C0802.2018%2C0802.0155%2C0802.3138%2C0802.4430%2C0802.3976%2C0802.2589%2C0802.2760%2C0802.3971%2C0802.4106%2C0802.3438%2C0802.4089%2C0802.3566%2C0802.2253%2C0802.0917%2C0802.1486%2C0802.1883%2C0802.1746%2C0802.2353%2C0802.2669%2C0802.1461%2C0802.0786%2C0802.3683%2C0802.0353%2C0802.1012%2C0802.1116%2C0802.2682%2C0802.3364%2C0802.1611%2C0802.0892%2C0802.2894%2C0802.1894%2C0802.2195%2C0802.4456%2C0802.1185%2C0802.3710%2C0802.4298%2C0802.1036%2C0802.4327%2C0802.2222%2C0802.0300%2C0802.1280%2C0802.3179%2C0802.3865%2C0802.2010%2C0802.1686%2C0802.2661%2C0802.4063%2C0802.1540%2C0802.3769%2C0802.2152%2C0802.3636%2C0802.1620%2C0802.0780%2C0802.3261%2C0802.1415%2C0802.3673%2C0802.3736%2C0802.3243%2C0802.4244%2C0802.3258%2C0802.0641%2C0802.4246%2C0802.0821%2C0802.0988%2C0802.2872%2C0802.2883%2C0802.0910%2C0802.3170%2C0802.1052%2C0802.2327%2C0802.1771%2C0802.1837%2C0802.3378%2C0802.2780%2C0802.0715%2C0802.2357%2C0802.2440%2C0802.4427%2C0802.3776%2C0802.4130&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Topics on bar and bulge formation and evolution"}, "summary": "I discuss results from the COSMOS survey, showing that the fraction of disc\ngalaxies that is barred decreases considerably with look-back time from z ~ 0.2\nto z ~ 0.8. This decrease is more important for small mass and low luminosity\nspirals. Classical bar formation theory provides a promising framework for\nunderstanding these results.\n  I also discuss the formation of discy bulges using N-body simulations\nreproducing well the properties of observed discy bulges. Thus, these simulated\ndiscy bulges have the shape of a disc, they have Sersic profiles with small\nvalues of the shape index and their size is of the order of a kpc. They are\nformed by radial inflow of material driven by the bar and are thus composed of\nboth gas and stars and have a considerable fraction of young stars. They can\nharbour spiral structure, or an inner bar.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.4413%2C0802.0328%2C0802.4158%2C0802.1923%2C0802.3827%2C0802.2559%2C0802.2329%2C0802.0391%2C0802.4178%2C0802.0446%2C0802.3806%2C0802.2718%2C0802.1656%2C0802.2979%2C0802.0465%2C0802.3961%2C0802.2915%2C0802.0365%2C0802.1078%2C0802.2248%2C0802.4144%2C0802.2018%2C0802.0155%2C0802.3138%2C0802.4430%2C0802.3976%2C0802.2589%2C0802.2760%2C0802.3971%2C0802.4106%2C0802.3438%2C0802.4089%2C0802.3566%2C0802.2253%2C0802.0917%2C0802.1486%2C0802.1883%2C0802.1746%2C0802.2353%2C0802.2669%2C0802.1461%2C0802.0786%2C0802.3683%2C0802.0353%2C0802.1012%2C0802.1116%2C0802.2682%2C0802.3364%2C0802.1611%2C0802.0892%2C0802.2894%2C0802.1894%2C0802.2195%2C0802.4456%2C0802.1185%2C0802.3710%2C0802.4298%2C0802.1036%2C0802.4327%2C0802.2222%2C0802.0300%2C0802.1280%2C0802.3179%2C0802.3865%2C0802.2010%2C0802.1686%2C0802.2661%2C0802.4063%2C0802.1540%2C0802.3769%2C0802.2152%2C0802.3636%2C0802.1620%2C0802.0780%2C0802.3261%2C0802.1415%2C0802.3673%2C0802.3736%2C0802.3243%2C0802.4244%2C0802.3258%2C0802.0641%2C0802.4246%2C0802.0821%2C0802.0988%2C0802.2872%2C0802.2883%2C0802.0910%2C0802.3170%2C0802.1052%2C0802.2327%2C0802.1771%2C0802.1837%2C0802.3378%2C0802.2780%2C0802.0715%2C0802.2357%2C0802.2440%2C0802.4427%2C0802.3776%2C0802.4130&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I discuss results from the COSMOS survey, showing that the fraction of disc\ngalaxies that is barred decreases considerably with look-back time from z ~ 0.2\nto z ~ 0.8. This decrease is more important for small mass and low luminosity\nspirals. Classical bar formation theory provides a promising framework for\nunderstanding these results.\n  I also discuss the formation of discy bulges using N-body simulations\nreproducing well the properties of observed discy bulges. Thus, these simulated\ndiscy bulges have the shape of a disc, they have Sersic profiles with small\nvalues of the shape index and their size is of the order of a kpc. They are\nformed by radial inflow of material driven by the bar and are thus composed of\nboth gas and stars and have a considerable fraction of young stars. They can\nharbour spiral structure, or an inner bar."}, "authors": ["E. Athanassoula"], "author_detail": {"name": "E. Athanassoula"}, "author": "E. Athanassoula", "arxiv_comment": "4 pages, 2 figures, contributed paper to the Rome meeting on\n  \"Formation and Evolution of Galaxy Disks\", eds, J. Funes, S.J. and E.M.\n  Corsini", "links": [{"href": "http://arxiv.org/abs/0802.0155v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.0155v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.0155v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.0155v1", "journal_reference": null, "doi": null, "fulltext": "**FULL TITLE**\nASP Conference Series, Vol. **VOLUME**, **YEAR OF PUBLICATION**\n**NAMES OF EDITORS**\n\nTopics on bar and bulge formation and evolution\n\narXiv:0802.0155v1 [astro-ph] 1 Feb 2008\n\nAthanassoula E.\nLAM, OAMP, 2 place Le Verrier, 13248 Marseille cedex 04, France\nAbstract.\nI discuss results from the COSMOS survey, showing that the\nfraction of disc galaxies that is barred decreases considerably with look-back\ntime from z ∼ 0.2 to z ∼ 0.8. This decrease is more important for small mass\nand low luminosity spirals. Classical bar formation theory provides a promising\nframework for understanding these results.\nI also discuss the formation of discy bulges using N -body simulations reproducing well the properties of observed discy bulges. Thus, these simulated\ndiscy bulges have the shape of a disc, they have Sérsic profiles with small values\nof the shape index and their size is of the order of a kpc. They are formed by\nradial inflow of material driven by the bar and are thus composed of both gas\nand stars and have a considerable fraction of young stars. They can harbour\nspiral structure, or an inner bar.\n\n1.\n\nIntroduction\n\nI will discuss two specific topics on bar and bulge formation and evolution. The\nfirst one concerns the formation of bars in time, measured from a large sample\nof disc galaxies observed with COSMOS. My collaborators for this work are\nKartik Sheth, Debra Meloy Elmegreen, Bruce Elmegreen, Peter Capak, Roberto\nAbraham. Richard Ellis, Bahram Mobasher, Mara Salvato, Eva Schinnerer,\nNick Scoville, Lori Spalsbury, Linda Strubbe, Marcella Carollo, Michael Rich\nand Andrew West. The second one discusses results of N -body simulations\ndescribing the formation of discy bulges. My collaborators for this work are\nClayton Heller and Isaac Shlosman.\n\n2.\n\nEvolution of the bar fraction in COSMOS: Quantifying the assembly of the Hubble sequence\n\nBars drive the angular momentum exchange between the various components of\ndisc galaxies and therefore drive their evolution. When did they form? Where all\nbars formed at the same time, or not? Did specific types of barred galaxies form\ntheir bars before others? To answer questions such as the above, my collaborators and I analysed the fraction of disc galaxies that are barred in a large sample\nof galaxies from the COSMOS 2-square degree field (Scoville et al. 2007a,b). Setting thresholds for brightness, photometric accuracy, redshift, type and inclination angle, we obtain a sample of 2157 luminous, far from edge-on, spiral galaxies.\nThus, our sample is an order of magnitude larger and is based on substantially\ndeeper imaging data than other samples used in previous bar fraction investi1\n\n\f2\n\nAthanassoula\n\nFigure 1. Fraction of disc galaxies that are barred (open squares), or\nstrongly barred (open diamonds) as a function of redshift. The left panel gives\nresults from the visual classification, while the right panel gives results from\nthe classification based on the ellipse fits (see text). The error bars reflect the\n1/2\nstatistical uncertainty and are obtained from the expression (f [1 − f ] /N ) ,\nwhere f is the fraction and N is the number of galaxies.\n\ngations (Abraham et al. 1999; Sheth et al. 2003; Elmegreen, Elmegreen & Hirst\n2004; Jogee et al. 2004).\nEach galaxy in our sample was analysed for the existence of a bar with two\ndifferent methods and the results were cross-checked. For the first method we\nfitted ellipses on the isophotes of the galaxy images and identified bars from dual\ncriteria on the profiles of the ellipticity and of the position angle of the ellipses.\nWe also identified bars visually.\nFrom this analysis we find that the fraction of disc galaxies which is barred\nis not constant with time, but increases strongly with decreasing redshift from\nz = 0.84 to z = 0.2. The size of our sample allows us to use six time bins and\nstill have sufficient galaxies in each bin to reach statistically safe results. These\nresults can be visualised in Fig. 1, where I show both the total fraction of bars\nand the fraction of strong bars. I also show separately the results from the visual\nclassification (left panel) and the classification from ellipse fitting (right panel).\nAlthough the thresholds for strong bars and the threshold between barred and\nnon-barred galaxies may differ somewhat between the two classifications, it is\nevident that the increase of the bar fraction with decreasing redshift is equally\nclear in both cases.\nWe also find that the bar fraction in spiral galaxies depends on the stellar\nmass. Thus, the bar fraction in very massive, luminous spirals is about constant\nout to z ∼ 0.84, whereas for the low mass spirals it declines significantly with\n\n\fTopics on bar and bulge formation and evolution\n\n3\n\nincreasing redshift beyond z = 0.3 (see Figures 2 and 3 in Sheth et al. 2007).\nThis result is a signature of downsizing and is intimately connected with what\nwe may call the dynamical maturity of discs.\nThe increase in the bar fraction with decreasing redshift from z = 0.84 to z\n= 0.2 can be understood within the framework of classical bar formation theory.\nN -body simulations have long suggested that bars form spontaneously in galactic\ndiscs, usually on relatively short dynamical timescales. There are, however, two\nways of slowing this down. One is to increase the halo mass fraction within the\ndisc radius, and the other is to heat up the disc (Athanassoula & Sellwood 1986;\nAthanassoula 2002, 2003). Although in many ways very different, both these\neffects allow to slow down the formation of the bar. Thus, the time it takes for an\nunbarred disc galaxy to become barred can vary widely. In cold, disc-dominated\ncases, the bar forms within a Gyr or less. Sufficiently hot discs embedded in\nvery massive halos can stay unbarred several Gyrs. Such a delay might well\nexplain the time evolution of barred galaxy fraction shown in Fig. 1. It could\nalso explain the downsizing signature found here, for two reasons. Observations\nshow that the halo-to-disc mass ratio is higher in low mass, low luminosity\ngalaxies than in bright, massive galaxies (Bosma 2004; Kranz, Slyz & Rix 2003)\nso that bars are expected to grow later in the former, as we indeed find here.\nFurthermore, there are suggestions that the former are dynamically hotter than\nthe latter (Kassin et al. 2007). Although this picture could be complicated by\ninteractions, or eventually by bar dissolution, it can, nevertheless, provide a\nframework within which our results can be understood.\nMore discussion and analysis of these results can be found in Sheth et al.\n(2007).\n3.\n\nFormation of discy bulges\n\nBulges are not a homogeneous class of objects, to a large extent due to the different definitions used so far. Athanassoula (2005) distinguished three different\ntypes of bulges : Classical, which resemble ellipticals in many ways; boxy/peanut\nbulges, which are just parts of bars seen near edge-on; and discy bulges, which\nare given the name 'bulges' because of their contributions to the inner parts of\nthe radial luminosity profiles.\nI present here results from simulations similar to those of Heller, Shlosman & Athanassoula\n(2007a) and (2007b), i.e. simulations including gas, stars and dark matter, as\nwell as star formation, cooling and feedback. Several non-axisymmetric components – such as a triaxial halo, an oval disc, an inner and/or an outer bar – form\nduring these simulations. Their interactions give very interesting dynamical\nphenomena (Heller et al. 2007a, b), while they induce considerable inflow and\ngaseous high density inner discs. This high gas concentration in the central area\ntriggers considerable star formation, resulting in a disc-like central, high-density\nobject, which, seen face-on, is often somewhat oval. It has many properties similar to those of discy-bulges. For example, it has, in many cases, sub-structures,\nlike an inner bar. Furthermore, a decomposition of the stellar radial density\nprofiles gives results in good agreement with observations. An example of such\na radial projected surface density profile is given in Fig. 3., together with a fit\nby an exponential disc and a Sérsic component. Note that\n\n\f4\n\nAthanassoula\n\nFigure 2.\nRadial\nprojected stellar density profile in arbitrary\nunits. Radii are measured in kpc. The dots\ngive the simulation results and the solid line\nthe fit by an exponential disc and a Sérsic\ncomponent.\n\nthe fit is excellent, all the way to the outer parts of the disc, roughly at 10\nkpc. In this example, the disc scale-length is ∼2.7 kpc, i.e. very realistic,\nwhile the Sérsic index is ∼1, in good agreement with observed discy bulges (see\nKormendy & Kennicutt (2004) for a review).\nAcknowledgments. I thank the Agence Nationale de la Recherche for\ngrant ANR-06-BLAN-0172. The HST COSMOS Treasury program was supported through NASA grant HST-GO- 09822.\nReferences\nAbraham, R. G., Merrifield, M. R., Ellis, R. S., Tanvir, N. R., Brinchmann, J. 1999,\nMNRAS, 308, 569\nAthanassoula, E. 2002, ApJ, 569, L83\nAthanassoula, E. 2003, MNRAS, 341, 1179\nAthanassoula, E. 2005, MNRAS, 358, 1477\nAthanassoula, E., Sellwood, J. A. 1986, MNRAS, 221, 213\nBosma, A. 2004, in 'Dark Matter in Galaxies', IAU Symp. 220, Eds. S. D. Ryder, D. J.\nPisano, M. A. Walker and K. C. Freeman, PASP, San Francisco, 39\nElmegreen, B. G., Elmegreen, D. M. 1985, Hirst, A.C. 2004, ApJ, 612, 191\nHeller, C., Shlosman, I. Athanassoula, E. 2007, ApJ, 657, L65\nHeller, C., Shlosman, I. Athanassoula, E. 2007, ApJ, 671, 226\nJogee, S., et al. 2004, ApJ, 615, L105\nKassin, S. A., et al. 2007, ApJ, 660, L35\nKormendy, J., Kennicutt, R. C. 2004, ARA&A, 42, 603\nKranz, T., Slyz, A., Rix, H.W. 2003, ApJ, 586, 143\nScoville, N.Z. et al. 2007a, COSMOS Special Issue, ApJ, 172, 38\nScoville, N.Z. et al. 2007b, COSMOS Special Issue, ApJ, 172, 150\nSheth, K., Regan, M.W., Scoville, N.Z., & Strubbe, L.E. 2003, ApJ, 592, L13\nSheth, K. et al. 2007, ApJ in press and astro-ph/0710.4552\n\n\f"}