{"id": "http://arxiv.org/abs/0808.2468v2", "guidislink": true, "updated": "2008-09-12T18:53:31Z", "updated_parsed": [2008, 9, 12, 18, 53, 31, 4, 256, 0], "published": "2008-08-19T19:55:09Z", "published_parsed": [2008, 8, 19, 19, 55, 9, 1, 232, 0], "title": "Distinguishing seesaw models at LHC with multi-lepton signals", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.3855%2C0808.4126%2C0808.1567%2C0808.0460%2C0808.2306%2C0808.4078%2C0808.0634%2C0808.3110%2C0808.0194%2C0808.0788%2C0808.1491%2C0808.2532%2C0808.1638%2C0808.2795%2C0808.2839%2C0808.2407%2C0808.1317%2C0808.2134%2C0808.3218%2C0808.1807%2C0808.3108%2C0808.2064%2C0808.2771%2C0808.2264%2C0808.3253%2C0808.0987%2C0808.2469%2C0808.2627%2C0808.3296%2C0808.4157%2C0808.1685%2C0808.3477%2C0808.3867%2C0808.0199%2C0808.2046%2C0808.0886%2C0808.3410%2C0808.1999%2C0808.2195%2C0808.3865%2C0808.2756%2C0808.1686%2C0808.2579%2C0808.3821%2C0808.3784%2C0808.0354%2C0808.2797%2C0808.1850%2C0808.2086%2C0808.4124%2C0808.2483%2C0808.1447%2C0808.0893%2C0808.2298%2C0808.0830%2C0808.0303%2C0808.2845%2C0808.3102%2C0808.1875%2C0808.3599%2C0808.1131%2C0808.2386%2C0808.3900%2C0808.3467%2C0808.1507%2C0808.2887%2C0808.2234%2C0808.0721%2C0808.2493%2C0808.0962%2C0808.3310%2C0808.1268%2C0808.3912%2C0808.1056%2C0808.1170%2C0808.0459%2C0808.4147%2C0808.3318%2C0808.1661%2C0808.0352%2C0808.2777%2C0808.4118%2C0808.0915%2C0808.3789%2C0808.3844%2C0808.1202%2C0808.2002%2C0808.1653%2C0808.4049%2C0808.1707%2C0808.2815%2C0808.0726%2C0808.2484%2C0808.2204%2C0808.2468%2C0808.2699%2C0808.0243%2C0808.1716%2C0808.1654%2C0808.3358%2C0808.1476&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Distinguishing seesaw models at LHC with multi-lepton signals"}, "summary": "We investigate the LHC discovery potential for electroweak scale heavy\nneutrino singlets (seesaw I), scalar triplets (seesaw II) and fermion triplets\n(seesaw III). For seesaw I we consider a heavy Majorana neutrino coupling to\nthe electron or muon. For seesaw II we concentrate on the likely scenario where\nthe new scalars decay to two leptons. For seesaw III we restrict ourselves to\nheavy Majorana fermion triplets decaying to light leptons plus gauge or Higgs\nbosons, which are dominant except for unnaturally small mixings. The possible\nsignals are classified in terms of the charged lepton multiplicity, studying\nnine different final states ranging from one to six charged leptons. Using a\nfast detector simulation of signals and backgrounds, it is found that the\ntrilepton channel l+- l+- l-+ is by far the best one for scalar triplet\ndiscovery, and for fermion triplets it is as good as the like-sign dilepton\nchannel l+- l+-. For heavy neutrinos with a mass O(100) GeV, this trilepton\nchannel is also better than the usually studied like-sign dilepton mode. In\naddition to evaluating the discovery potential, we make special emphasis on the\ndiscrimination among seesaw models if a positive signal is observed. This could\nbe accomplished not only by searching for signals in different final states,\nbut also by reconstructing the mass and determining the charge of the new\nresonances, which is possible in several cases. For high luminosities, further\nevidence is provided by the analysis of the production angular distributions in\nthe cleanest channels with three or four leptons.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.3855%2C0808.4126%2C0808.1567%2C0808.0460%2C0808.2306%2C0808.4078%2C0808.0634%2C0808.3110%2C0808.0194%2C0808.0788%2C0808.1491%2C0808.2532%2C0808.1638%2C0808.2795%2C0808.2839%2C0808.2407%2C0808.1317%2C0808.2134%2C0808.3218%2C0808.1807%2C0808.3108%2C0808.2064%2C0808.2771%2C0808.2264%2C0808.3253%2C0808.0987%2C0808.2469%2C0808.2627%2C0808.3296%2C0808.4157%2C0808.1685%2C0808.3477%2C0808.3867%2C0808.0199%2C0808.2046%2C0808.0886%2C0808.3410%2C0808.1999%2C0808.2195%2C0808.3865%2C0808.2756%2C0808.1686%2C0808.2579%2C0808.3821%2C0808.3784%2C0808.0354%2C0808.2797%2C0808.1850%2C0808.2086%2C0808.4124%2C0808.2483%2C0808.1447%2C0808.0893%2C0808.2298%2C0808.0830%2C0808.0303%2C0808.2845%2C0808.3102%2C0808.1875%2C0808.3599%2C0808.1131%2C0808.2386%2C0808.3900%2C0808.3467%2C0808.1507%2C0808.2887%2C0808.2234%2C0808.0721%2C0808.2493%2C0808.0962%2C0808.3310%2C0808.1268%2C0808.3912%2C0808.1056%2C0808.1170%2C0808.0459%2C0808.4147%2C0808.3318%2C0808.1661%2C0808.0352%2C0808.2777%2C0808.4118%2C0808.0915%2C0808.3789%2C0808.3844%2C0808.1202%2C0808.2002%2C0808.1653%2C0808.4049%2C0808.1707%2C0808.2815%2C0808.0726%2C0808.2484%2C0808.2204%2C0808.2468%2C0808.2699%2C0808.0243%2C0808.1716%2C0808.1654%2C0808.3358%2C0808.1476&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the LHC discovery potential for electroweak scale heavy\nneutrino singlets (seesaw I), scalar triplets (seesaw II) and fermion triplets\n(seesaw III). For seesaw I we consider a heavy Majorana neutrino coupling to\nthe electron or muon. For seesaw II we concentrate on the likely scenario where\nthe new scalars decay to two leptons. For seesaw III we restrict ourselves to\nheavy Majorana fermion triplets decaying to light leptons plus gauge or Higgs\nbosons, which are dominant except for unnaturally small mixings. The possible\nsignals are classified in terms of the charged lepton multiplicity, studying\nnine different final states ranging from one to six charged leptons. Using a\nfast detector simulation of signals and backgrounds, it is found that the\ntrilepton channel l+- l+- l-+ is by far the best one for scalar triplet\ndiscovery, and for fermion triplets it is as good as the like-sign dilepton\nchannel l+- l+-. For heavy neutrinos with a mass O(100) GeV, this trilepton\nchannel is also better than the usually studied like-sign dilepton mode. In\naddition to evaluating the discovery potential, we make special emphasis on the\ndiscrimination among seesaw models if a positive signal is observed. This could\nbe accomplished not only by searching for signals in different final states,\nbut also by reconstructing the mass and determining the charge of the new\nresonances, which is possible in several cases. For high luminosities, further\nevidence is provided by the analysis of the production angular distributions in\nthe cleanest channels with three or four leptons."}, "authors": ["F. del Aguila", "J. A. Aguilar-Saavedra"], "author_detail": {"name": "J. A. Aguilar-Saavedra"}, "author": "J. A. Aguilar-Saavedra", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysb.2008.12.029", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0808.2468v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0808.2468v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTeX 90 pages, 116 PS figures. Typos fixed, comments and references\n  added", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0808.2468v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0808.2468v2", "journal_reference": null, "doi": "10.1016/j.nuclphysb.2008.12.029", "fulltext": "Distinguishing seesaw models at LHC\nwith multi-lepton signals\nF. del Aguila, J. A. Aguilar\u0015Saavedra\nDepartamento de Físi a Teóri a y del Cosmos and CAFPE,\nUniversidad de Granada, E-18071 Granada, Spain\n\nAbstra t\n\narXiv:0808.2468v2 [hep-ph] 12 Sep 2008\n\nWe investigate the LHC dis overy potential for ele troweak s ale heavy neutrino singlets (seesaw I), s alar triplets (seesaw II) and fermion triplets (seesaw\nIII). For seesaw I we onsider a heavy Majorana neutrino oupling to the ele tron or muon. For seesaw II we on entrate on the likely s enario where the\nnew s alars de ay to two leptons. For seesaw III we restri t ourselves to heavy\nMajorana fermion triplets de aying to light leptons plus gauge or Higgs bosons,\nwhi h are dominant ex ept for unnaturally small mixings. The possible signals\nare lassi\u001ced in terms of the harged lepton multipli ity, studying nine di\u001berent\n\u001cnal states ranging from one to six harged leptons. Using a fast dete tor simulation of signals and ba kgrounds, it is found that the trilepton hannel l± l± l∓\nis by far the best one for s alar triplet dis overy, and for fermion triplets it is as\ngood as the like-sign dilepton hannel l± l± . For heavy neutrinos with a mass\nO(100) GeV, this trilepton hannel is also better than the usually studied likesign dilepton mode. In addition to evaluating the dis overy potential, we make\nspe ial emphasis on the dis rimination among seesaw models if a positive signal\nis observed. This ould be a omplished not only by sear hing for signals in\ndi\u001berent \u001cnal states, but also by re onstru ting the mass and determining the\nharge of the new resonan es, whi h is possible in several ases. For high luminosities, further eviden e is provided by the analysis of the produ tion angular\ndistributions in the leanest hannels with three or four leptons.\n\n1\n\nIntrodu tion\n\nThe near operation of the Large Hadron Collider (LHC) represents a remarkable opportunity to explore physi s beyond the ele troweak s ale.\nhigher s ales\n\nIn parti ular, physi s at\n\nan be explored in the lepton se tor [1℄, where the only eviden e of physi s\n\nbeyond the Standard Model (SM) has been found up to now, namely massive neutrinos. Many theories have been proposed to enlarge the SM in orporating tiny neutrino\nmasses, as required by experimental data [2℄.\n\n1\n\nAmong them, seesaw models explain\n\n\ftheir smallness by introdu ing extra matter at a high s ale. After integration of these\nheavy \u001celds, the lepton number violating (LNV) dimension \u001cve operator [3℄\n\n(O5 )ij = LciL φ̃∗ φ̃† LjL\n\n(1)\n\nis generated, where\n\nνiL\nliL\n\nLiL =\n\nare the SM left-handed lepton doublets,\n\n!\n\n,\n\ni = 1, 2, 3\n\n(2)\n\nφ the SM Higgs and φ̃ = iτ2 φ∗ , with τi the Pauli\n\nmatri es. This operator yields Majorana masses for the neutrinos after spontaneous\nsymmetry breaking. At higher energies neutrino masses\n\nan be generated from higher\n\ndimension operators involving extra \u001celds (see for example Ref. [4℄) but when all heavy\ndegrees of freedom are integrated the operator in Eq. (1) is re overed.\nThere are three types of tree-level seesaw me hanisms whi h originate the operator\nin Eq. (1), whi h is the only \u001cve-dimensional one allowed by the SU(3)× SU(2)L × U(1)Y\n\ngauge symmetry. The original seesaw [5\u00158℄, also known as seesaw of type I, introdu es\nright-handed neutrino singlets\nSM with a\nintrodu es\n\nN\n\nomplex s alar triplet\nolourless fermioni\n\nat a high s ale. Type II seesaw [9\u001513℄ enlarges the\n\n∆\n\nwith hyper harge\n\ntriplets\n\nΣ with Y = 0.\n\nY = 1,\n\nand seesaw III [14, 15℄\n\nBoth seesaw I and II are present\n\nin left-right models [16, 17℄. Combinations of seesaw I and III are predi ted in some\ngrand uni\u001ced theories [18\u001520℄, and\n\nan be implemented in left-right models as well [21℄.\n\nThe three types of seesaw me hanism generate not only the dimension \u001cve operator\nwhi h gives light neutrino masses, but also additional lepton number\n\nonserving (LNC)\n\ndimension six operators, whi h are di\u001berent in ea h seesaw s enario [22, 23℄ (see also\nRef. [24℄). Therefore, seesaw models may in prin iple be dis riminated, albeit indire tly,\nwith pre ise low-energy measurements sensitive to these dimension six operators. The\nseesaw messengers\n\nN , ∆, Σ\n\nan also be produ ed at LHC if their masses are not very\n\nlarge but of the order of the ele troweak s ale and, in the\ntheir mixing with the SM leptons is of order\nunique\n\n10\n\n−2\n\nase of neutrino singlets, if\n\nor larger. Therefore, LHC gives a\n\nhan e to un over the me hanism of neutrino mass generation if these heavy\n\nstates are dire tly observed.\nThe produ tion of heavy neutrinos [25\u001530℄, s alar triplets [31\u001536℄ and fermion\ntriplets [37℄ and their possible signals have been extensively studied in the literature.\nIn this paper we take a novel approa h to their analysis. Instead of\n\nlassifying signals in\n\nterms of the parti les produ ed in the hard pro ess and studying one or more parti ular\nhannels, we\n\nlassify them by the signatures a tually seen at the experiment, generat-\n\ning all the signal\n\nontributions. As the number of jets in the \u001cnal state is not a good\n\n2\n\n\fdis riminant due to radiation and pile-up, signals are\nlepton multipli ity, and the number of hard jets is\n\nlassi\u001ced in terms of the\n\nharged\n\nonsidered only in few spe ial\n\nases\n\nas an extra information for the kinemati al re onstru tion. We believe that this is a\nmore appropriate\n\nhoi e from the experimental point of view. An essential feature of a\n\nreal experiment is that the observed \u001cnal states re eive in general\nseveral signal pro esses and,\n\nonversely, one given signal pro ess\n\n\u001cnal states if, for example, one or more\nBoth e\u001be ts are taken into a\n\nontributions from\n\nontributes to several\n\nharged leptons are missed by the dete tor.\n\nount in our analysis, whi h in ludes the e\u001be ts of ra-\n\ndiation, pile-up and hadronisation, performed by a parton shower Monte Carlo, and\nuses a fast dete tor simulation. Within a given seesaw s enario we simulate all signal\npro esses and then examine thoroughly the relevant \u001cnal states, nine in total, ranging\nfrom one to six\n\nharged leptons.\n\nA se ond di\u001beren e with respe t to previous literature on erns the guiding prin iple\nof the analyses performed. Due to the profusion of new physi s s enarios to be tested\nat the LHC it is expe ted that, at least in a \u001crst phase, sear hes will be in lusive to\nsome extent and rather model-independent, in order to be sensitive to di\u001berent types\nof new physi s\n\nontributing to a given\n\nabsen e of a strong physi s\n\nhannel. For example, it is not likely that, in the\n\nase, a \u001cnal state with two like-sign leptons, large missing\n\nenergy, two jets with an invariant mass\n\nonsistent with the\n\nW\n\nmass and two additional\n\njets will be examined right from the beginning of LHC operation. On the\n\nontrary,\n\nsear hes are expe ted, for example, for in lusive \u001cnal states with two like-sign leptons,\nas it has already been done at Tevatron [38℄. (With this philosophy, our\n\nlassi\u001c ation\n\nof signals in terms of lepton multipli ity is perfe tly suited.) Then, in our analyses we\nwill not set \u001cne-tuned kinemati al\nour\n\nuts on many variables to enhan e the signals, but\n\nriteria for variable sele tion and ba kground suppression will be rather general,\n\nand in most\n\nases valid for seesaw I, II and III signals. In this way, our results and\n\npro edures will be adequate for model-independent sear hes in the multi-lepton \u001cnal\nstates.\n\nOf\n\nourse, if some hint of new physi s is found the analyses\n\nan be re\u001cned\n\nand adapted to some parti ular s enario, in order to re onstru t the resonan e masses\nand/or enhan e the sensitivity.\nFinally, we pay a spe ial attention to the dis rimination among models if a positive\nsignal is found. This study is far more involved than the \u0010simple\u0011 observation of a new\nphysi s signal from seesaw messengers in one or few parti ular hannels, to whi h most\nprevious literature has been devoted. On the\na systemati\n\nontrary, model dis rimination requires\n\nanalysis of all possible \u001cnal states and the re onstru tion of the new\n\nresonan es when possible. The three types of seesaw\nand three\n\nan give signals with one, two\n\nharged leptons, plus a variable number of jets (whi h, as stressed before, is\n\n3\n\n\fnot very indi ative be ause of radiation and pile-up, added to the di\u001e ulty of the mass\nre onstru tion in hadroni\n(with\n\nl = e, μ,\n\nhannels). Final states with four\n\nin luding all \u001davour\n\nseesaw II and III s enarios, and\n\nharged leptons\n\nl+ l+ l− l−\n\nombinations of the four leptons) only arise in\n\nl± l± l± l∓\n\nsignals only in seesaw III, as well as \u001cve\n\nand six lepton \u001cnal states. Therefore, a \u001crst straightforward dis rimination of seesaw\nmodels results from\n\nonsidering the \u001cnal states in whi h the signals\n\nan be seen and\n\ntheir statisti al signi\u001c an e, whi h are not the same for seesaw I, II and III. Moreover,\nif a positive signal is found in a given\nresonan e\n\nhannel, the mass re onstru tion of the heavy\n\nan be often performed and its\n\nfor the produ tion of the new parti le.\n\nharge measured, giving\nFor example, doubly\n\nlear dire t eviden e\nharged s alars\n\nprodu ed in seesaw II models often give from their de ay a signal\nlike-sign leptons with an invariant mass very\n\nlose to\n\nM∆++ ,\n\n∆++\n\nonsisting of two\n\nwhereas the spe trum of\n\nlike-sign dilepton invariant masses in seesaw I and III does not exhibit any peak. For\nhigh integrated luminosities, the opening angle distribution\nleanest\n\nhannels, giving eviden e for the s alar or fermioni\n\nan also be tested in the\nnature of the heavy states\n\nprodu ed.\nWe also have to point out that, sin e the main interest in the arrival of the LHC era\n\n−1\nwill not be available until several\nis in early dis overies (and a luminosity of 300 fb\nyears of LHC operation, in the optimisti\non seesaw messengers with masses\n\ns enarios), we have\n\non entrated our study\n\nlose to the ele troweak s ale, whi h in the\n\nase of\n\nseesaw II and III would be qui kly dis overed after quality data are available. Thus,\nfor heavy neutrino singlets we have assumed a mass\n\nmN = 100\n\nGeV, while for s alar\n\nand triplet fermions the mass has been taken as 300 GeV. We have found that the best\nhannel for dis overy, balan ing large signal bran hing ratios and small ba kgrounds,\nis the trilepton one\n\nl± l± l∓ .\n\npossible with only 3.6 fb\n0.9 fb\n\n−1\n\n−1\n\nFor s alar triplets of this mass,\n\n5σ\n\ndis overy would be\n\nof luminosity for normal neutrino mass hierar hy (NH) and\n\nfor inverted hierar hy (IH). For fermioni\n\ntriplets the luminosity needed is 2.5\n\n−1\n−1\nfb , while for heavy neutrino singlets it is mu h larger, around 180 fb .\nmodel dis rimination would be possible within the \u001crst LHC year with 10 fb\n\nA\n\n−1\n\nlean\n\n.\n\nIn this paper we work out the minimal seesaw I\u0015III s enarios without new intera tions. It is worth mentioning that the latter\n\nan mediate new produ tion me hanisms\n\nof seesaw messengers, for example, heavy neutrinos in models with left-right symmetry\nand an additional\n\nWR\n\nboson [39\u001542℄, models with an additional\n\nZ′\n\n[43, 44℄ or with new\n\ns alar doublets [45,46℄. The same type of signals an also be produ ed by fourth generation neutrinos [47℄. New intera tions\n\nan also lead to predi tive indire t seesaw signals,\n\nas for example in type II seesaw in the\n\nontext of supersymmetri\n\nmodels [48\u001550℄. Al-\n\nternatives to the seesaw me hanism are also possible, for example in\n\n4\n\nR-parity violating\n\n\fsupersymmetri\nand\n\nmodels, leading to interesting\n\nonne tions between neutrino physi s\n\nollider observables [51\u001553℄ (for reviews see Refs. [54, 55℄ and referen es there in).\n\nThe rest of this paper is organised as follows. In se tion 2 we write down the relevant Lagrangian terms for the three seesaw types. We\nmediating the produ tion and de ay pro esses\n\non entrate on the intera tions\n\nonsidered in this work using a notation\n\nthat, while being general, is intended to be standard and of easy use for readers not\nfamiliar with the models introdu ed. In se tion 3 we des ribe in detail the\n\nommon\n\nfeatures of the analyses, whi h are performed in se tions 4, 5 and 6 for heavy neutrinos, s alar triplets and fermion triplets, respe tively. We begin these se tions with a\nshort introdu tion, and\n\non lude them with a summary highlighting the main results,\n\nso that the reader may skip the details. Our\n\non lusions are drawn in se tion 7. In the\n\nAppendix we give the Feynman rules used in the Monte Carlo generators.\n\n2\n\nGeneral framework\n\nIn this se tion we introdu e the di\u001berent seesaw models, set our\n\nonventions and write\n\nthe Lagrangian terms relevant to the produ tion and de ay pro esses studied here. We\nkeep the notation as simple as possible and similar for the three types of seesaw me hanism. Constraints on the mixing of the new fermions and s alars are brie\u001dy reviewed\nat the end of ea h subse tion. The Feynman rules are\n\nolle ted in the Appendix.\n\n2.1 Seesaw I\nType-I seesaw is usually implemented by adding three right-handed\n\n′\nNiR\n,\n\ni = 1, 2, 3,\n\nurrent eigenstates\n\ntransforming as singlets under the SM gauge group. This allows to\n\nwrite a Yukawa intera tion for neutrinos analogous to the one for\n\nharged leptons,\n\n′\nLY = −Yij L′iL NjR\nφ̃ + H. . ,\nwhere\n\nY\n\nis a\n\n3×3\n\nmatrix of\n\nouplings and\n\nL′iL\n\n(3)\n\nthe SM lepton doublets (in the weak\n\neigenstate basis). This intera tion generates a mass term upon spontaneous symmetry\nbreaking\n\nφ=\nwith\nterm\n\nv = 246 GeV. Sin\n\nφ+\nφ0\ne\n\n!\n\n′\nNiR\n\n1\n→√\n2\n\n0\nv\n\n!\n\n,\n\n1\nφ̃ ≡ iτ2 φ → √\n2\n∗\n\nv\n0\n\n!\n\n,\n\n(4)\n\nare SM singlets, gauge symmetry allows a Majorana mass\n\n1\n′\n′\nLM = − Mij NiL\nNjR\n+ H. . ,\n2\n5\n\n(5)\n\n\fwith\n\nM\n\na\n\n3×3\n\nsymmetri\n\nmatrix and\n\n′\nNiL\n≡ NiRc .1\n′\n\nDe\u001cning\n\n′\n\n′\nνiR\n≡ νiLc ,\n\nwhere\n\n′\nνiL\n\nare\n\nthe SM neutrino eigenstates, the full neutrino mass term reads\n\n\u0001\n1\n= − ν̄L′ N̄L′\n2\n\nLmass\n\n0\n\n√v Y\n2\n\n√v Y T\n2\n\nM\n\n!\n\nνR′\nNR′\n\n!\n\n+ H.c. .\n\n(6)\n\nThe neutrino gauge intera tions are the same as in the SM,\n\n\u0001\ng ′ μ ′\n′\n′\nLW = − √  ̄liL\nγ νiL Wμ− + ν̄iL\nγ μ liL\nWμ+ ,\n2\ng ′ μ ′\nLZ = −\nν̄ γ νiL Zμ ,\n2cW iL\nwith\n\n′\nliL\n\nangle.\n\nthe\n\nharged lepton weak eigenstates and\n\nThe intera tion with the Higgs boson\n\n√\n\n(v + H + iχ)/ 2,\n\nH,\n\ncW\n\nthe\n\n(7)\n\nosine of the weak mixing\n\nwith the usual normalisation\n\nis\n\n\u0011\n1 \u0010 ′\n′\n′\n′\nLH = − √ ν̄iL\nH.\nYij NjR\n+ N̄jR\nYji† νiL\n2\n\n(8)\n\nThen, the relevant intera tion terms for the heavy neutrino mass eigenstates\n\n′\nNiR\n\nφ0 =\n\nNi ≃\n\nan be obtained by diagonalising the mass matrix in Eq. (6) and rewriting the\n\nintera tions in the mass eigenstate basis (for details see for example Refs. [56, 57℄). For\na heavy Majorana neutrino\n\nwhere\n\nmN\n\nN\n\n(dropping the subindex) and\n\nl = e, μ, τ\n\nwe have\n\n\u0001\ng\n∗\nLW = − √ VlN  ̄lγ μ PL N Wμ− + VlN\nN̄γ μ PL l Wμ+ ,\n2\n\u0001\ng\n∗\nLZ = −\nVlN ν̄l γ μ PL N + VlN\nN̄γ μ PL νl Zμ ,\n2cW\n\u0001\ng mN\n∗\nVlN ν̄l PR N + VlN\nN̄ PL νl H ,\nLH = −\n2MW\n\n(9)\n\nis the heavy neutrino mass and\n\nYlN v\nVlN ≃ √\n2mN\nis the mixing between the\nMajorana\n\nhara ter of\n\nN\n\nharged lepton\nand\n\nνl ,\n\nl\n\n(10)\n\nand the heavy neutrino\n\nthe last terms in the\n\nZ, H\n\nN.\n\nDue to the\n\nLagrangians\n\nan be\n\nrewritten,\n\ng\n∗\nν̄l γ μ (VlN PL − VlN\nPR ) N Z μ ,\n2cW\ng mN\n∗\n= −\nν̄l (VlN PR + VlN\nPL ) N H .\n2MW\n\nLZ = −\nLH\n1 We\n\n(11)\n\navoid writing parentheses in harge onjugate \u001celds to simplify the notation, and write ψLc ≡\nc\n(ψL )c , ψR\n≡ (ψR )c .\n6\n\n\fIn the absen e of any parti ular symmetry in the Yukawa\n\nmν\nmν /mN .\n\n2 2\n\nVlN ∼\nHen e, for a heavy neutrino within LHC rea h, say with a mass mN ∼ 100\n2\nGeV, its seesaw-type ontribution to light neutrino masses is of the order of 300 Y GeV,\n−6\nto reprodu e light neutrino masses mν ∼ 0.1\nrequiring very small Yukawas Y ∼ 10\n−6\neV. Moreover, the natural order of magnitude of the mixings is O(10 ), too small\nmasses\n\np\n\nare of the order\n\nto give observable signals.\ntal\n\n2 2\n\nY v /2mN\n\nY v /2mN ,\n\nouplings, light neutrino\n\nand the heavy neutrino mixings are\n\nIn models with approximate \u001davour symmetries the to-\n\nontribution to light neutrino masses\n\nan be suppressed [58\u001561℄ and the\n\nmixings de oupled from the light/heavy mass ratio [62℄. In the spe i\u001c\n\nrealisations\n\non-\n\nsidered in the literature, the symmetry advo ated to naturally reprodu e light neutrino\nmasses with ele troweak s ale heavy neutrinos is lepton number [63℄, in whi h\nheavy neutrinos are quasi-Dira\n\nase the\n\ninstead of Majorana parti les and the phenomenology\n\nis di\u001berent, in parti ular their de ays. In this work we will not address how to build a\nrealisti\n\nmodel in whi h heavy Majorana neutrinos appear with non-negligible mixings,\n\nbut we will simply take the Lagrangian in Eqs. (9) as a phenomenologi al one, in order\nto investigate the LHC potential to dis over heavy Majorana neutrinos. The prospe ts\nfor Dira\n\nneutrinos at the ele troweak s ale, whi h appear more naturally in seesaw\n\nmodels, are dis ussed elsewhere [64℄.\nEven if we put aside the\n\nonne tion between heavy neutrino mixing and light neu-\n\ntrino masses, the former must be small due to present experimental\ntroweak pre ision data set limits on mixings involving a single\nUsing the latest experimental data, the\n\n3\nX\ni=1\n\n|VeNi |2 ≤ 0.0030 ,\n\nwhi h in parti ular imply\n\nN.\n\nThese\n\n3\nX\ni=1\n\non\u001cden e level (CL) are [69℄\n\n3\nX\ni=1\n\n|Vτ Ni |2 ≤ 0.0062 ,\n\nonstraints on the individual mixings\n\nVlN\n\n(12)\n\nof a heavy neutrino\n\nross se tions at LHC (see next se tion). From lepton \u001davour-violating\n\n(LFV) pro esses [62, 70\u001572℄ one has\n\ni=1\n\n|VμNi |2 ≤ 0.0032 ,\n\nharged lepton [65\u001569℄.\n\nonstraints are parti ularly important sin e they determine the heavy neu-\n\ntrino produ tion\n\n3\nX\n\nonstraints at 90%\n\nonstraints. Ele -\n\n∗\nVeNi VμN\ni\n\n≤ 0.0001 ,\n\nIn the absen e of some\n\n3\nX\n\nonstraints involving two\n\nVeNi Vτ∗Ni\n\ni=1\n\n≤ 0.01 ,\n\n3\nX\ni=1\n\nan ellation among heavy neutrino\n\nbe possible [73℄) this bound implies that a heavy neutrino\n\nharged leptons,\n\nVμNi Vτ∗Ni ≤ 0.01 .\n\n(13)\n\nontributions (whi h\n\nould\n\nannot have sizeable mixings\n\nwith the ele tron and muon simultaneously. Noti e that the\n\nonstraints in Eqs. (13)\n\nan be easily evaded, for example, if ea h heavy neutrino mixes with a di\u001berent\nlepton.\n\n7\n\nharged\n\n\fFor Majorana neutrinos\n\noupling to the ele tron the experimental bound on neu-\n\ntrinoless double beta de ay also\n\n3\nX\ni=1\n\nonstrains their dire t ex hange [74℄\n\n2\nVeN\ni\n\n1\nmNi\n\n< 5 × 10−8 GeV−1 .\n\nVeNj saturate the bound in Eq. (12), this limit an\nthat mNj are at the TeV s ale [75℄ and then beyond\n\nIf\n\na\n\n(14)\n\nbe ful\u001clled either demanding\nLHC rea h, or that there is\n\nan ellation among the di\u001berent terms in Eq. (14), as it may happen in de\u001cnite\n\nmodels [59℄, in parti ular for (quasi)Dira\n\nneutrinos.\n\n2.2 Seesaw II\nIn type II seesaw light neutrinos a quire masses from a gauge-invariant Yukawa intera tion of the left-handed lepton doublets with a s alar triplet\n(with\n\nQ = T3 + Y ).\n\nWriting the triplet in Cartesian\n\n∆\n\nY =1\n~ = (∆ , ∆ , ∆3 ),\n∆\n\nof hyper harge\n\nomponents\n\n1\n\n2\n\nthe Yukawa intera tion reads\n\n1\n~ LjL + H.c. ,\nLY = √ Yij L̃iL (~τ * ∆)\n2\nwith\n\nL̃jL = iτ2\nand\n\nY\n\na symmetri\n\nthat the\n\nmatrix of Yukawa\n\n!\n\n(16)\n\nouplings. We assume without loss of generality\n\nharged lepton mass matrix is diagonal, and drop primes on the neutrino\n\n\u001celds, whi h are taken in the \u001davour basis\nrelated to the Cartesian\n\nWhen the neutral triplet\n\nνe , νμ , ντ .\n\nThe triplet\n\nharge eigenstates are\n\nomponents by\n\n1\n∆++ = √ (∆1 − i∆2 ) ,\n2\nv∆ ,\n\nc\nνjL\nc\nljL\n\n(15)\n\n∆+ = ∆3 ,\n\n1\n∆0 = √ (∆1 + i∆2 ) .\n2\n\nomponent a quires a va uum expe tation value (vev)\n\nthe Yukawa intera tion in Eq. (15) indu es a neutrino mass term\n\nLmass = −Yij∗ v∆ ν̄iL νjR + H.c.\n1\n≡ − Mij ν̄iL νjR + H.c. ,\n2\nwhere we have again introdu ed the notation\n\nc\nνiR ≡ νiL\n,\n\nMij = 2Yij∗ v∆\n8\n\n(17)\n\nh∆0 i =\n\n(18)\n\nand\n(19)\n\n\fare the matrix elements of the light neutrino Majorana mass matrix. These equations\nimply the relation\n\nYij =\n\n1\n†\n∗\n(VMNS\nM diag VMNS\n)ij\n2v∆\n\nwhi h allows to determine the triplet Yukawa\nmatrix\n\nM\n\ndiag\n\n(20)\n\nouplings from the diagonal neutrino mass\n\n, the triplet vev and the Maki-Nakagawa-Sakata mixing matrix [76, 77℄\n\nVMNS .\nThe triplet Yukawa intera tion in Eq. (15) also generates triplet\n\nouplings to the\n\nharged leptons. The relevant terms for our analysis are\n\nc\nc\nL∆ll = Yij liL\nljL ∆++ + Yij∗ ljL liL\n∆−− ,\n√\n√\nL∆lν =\n2Yij νiR ljL ∆+ + 2Yij ljL νiR ∆− ,\nwhere\n\n∆−− = (∆++ )†\n\nand\n\n∆− = (∆+ )† ,\n\nThe gauge intera tions of the triplet\n\nas usual.\nomponents are obtained from the kineti\n\n~ † * (Dμ ∆)\n~ ,\nLK = (D μ ∆)\nwhere the\n\nand\n\nterm\n(22)\n\novariant derivative is\n\n~ μ + ig ′ Y Bμ\nDμ = ∂μ + ig T~ * W\nwith\n\n(21)\n\n\n0 0 0\n\n\nT1 =  0 0 −i  ,\n0 i 0\n\n\n~ μ = (W 1 , W 2 , W 3 ),\nW\nμ\nμ\nμ\n\n\n0 0 i\n\n\nT2 =  0 0 0  ,\n−i 0 0\n\n\n(23)\n\n\n0 −i 0\n\n\nT3 =  i 0 0  ,\n0 0 0\n\n\n(24)\n\nthe SU(2)L gauge \u001celds, with\n\n1\nWμ+ = √ (Wμ1 − iWμ2 ) ,\n2\n\n1\nWμ− = √ (Wμ1 + iWμ2 ) .\n2\n\n(25)\n\nThe gauge intera tions mediating s alar triplet pair produ tion pro esses in our analysis\nare\n\n\u0002\n\u0003\nLW = −ig (∂ μ ∆−− )∆+ − ∆−− (∂ μ ∆+ ) Wμ+ ,\n\u0002\n\u0003\n−ig (∂ μ ∆− )∆++ − ∆− (∂ μ ∆++ ) Wμ− ,\n\u0002\n\u0003\nig\n(1 − 2s2W ) (∂ μ ∆−− )∆++ − ∆−− (∂ μ ∆++ ) Zμ\nLZ =\ncW\n\u0002\n\u0003\nig\n− s2W (∂ μ ∆− )∆+ − ∆− (∂ μ ∆+ ) Zμ ,\ncW\n\u0002\n\u0003\nLγ = i2e (∂ μ ∆−− )∆++ − ∆−− (∂ μ ∆++ ) Aμ\n\u0002\n\u0003\n+ie (∂ μ ∆− )∆+ − ∆− (∂ μ ∆+ ) Aμ .\n9\n\n(26)\n\n\fConstraints on the triplet parameters are mu h less important than for heavy neutrino singlets, be ause the new s alars\n\nan be produ ed at LHC by unsuppressed gauge\n\nintera tions. Ele troweak pre ision data set an upper limit on the triplet vev\n\nv∆ .\n\nThe\n\nmost re ent bound obtained from a global \u001ct is [78℄\n\nv∆ < 2\n\nGeV ,\n\n(27)\n\nwhi h is mu h less stringent than the one derived from neutrino masses, Eq. (19), if\nare of the order of the\n\nYij ,\n\nharged lepton Yukawa\n\nouplings. The relative values of\n\nv∆\n\nYij\n\nand\n\nwhose produ t is \u001cxed by Eq. (19), determine the de ays of the s alars (a detailed\n\ndis ussion\n\nan be found in se tion 5). Limits on\n\nYij\n\narise from four-fermion pro esses\n\n+ − −\n\n−\n\nμ → e e e , τ → 3l, as well as LFV pro esses as μ → eγ [23, 79℄. Constraints on\n−2\nor larger [23℄, mu h weaker than the expe ted\nprodu ts of two Yij are of the order 10\n\nlike\n\nsize for these\n\nouplings, ex ept for the produ t\n\n∗\n|Yee Yeμ\n| < 2.4 × 10−5 ,\nwhi h is obtained from\n\nYij\n\nare of order\n\ndominate the\n\n10\n\n−3\n\nμ− → e+ e− e− .\n\n, whi h is\n\nThese\n\n(28)\n\nonstraints are automati ally satis\u001ced if\n\nonsistent with our assumption that the dilepton modes\n\nharged s alar de ays (see se tion 5).\n\n2.3 Seesaw III\nIn type III seesaw the SM is usually enlarged with three leptoni\nomposed by three Weyl spinors of zero hyper harge.\n\nWe\n\ntriplets\n\nΣj ,\n\nea h\n\nhoose the spinors to be\n\nright-handed under Lorentz transformations, following the notation in Refs. [23, 80℄\nto some extent. Writing the triplets in Cartesian\n\nomponents\n\n~ j = (Σ1 , Σ2 , Σ3 )\nΣ\nj\nj\nj\n\nand\n\nusing standard four- omponent notation, the triplet Yukawa intera tion with the lepton\ndoublets takes the form\n\n~ j * ~τ ) φ̃ + H. . ,\nLY = −Yij L̄′iL (Σ\nwith\n\nY\n\na\n\n3 ×3 matrix of Yukawa\n\nthe seesaw is\n\nwith\n\nΣj\n\nM\n\na\n\nouplings. The triplet Majorana mass term mediating\n\n1\n~c *Σ\n~ j + H. . ,\nLM = − Mij Σ\ni\n2\n\n3×3 symmetri\n\nmatrix. Noti e that all the members\n\nhave the same mass term. For ea h triplet\n\nthe Cartesian\n\n(29)\n\nΣj ,\n\nthe\n\n(30)\n\nΣ1j , Σ2j , Σ3j\n\nof the triplet\n\nharge eigenstates are related to\n\nomponents by\n\n1\n1\n2\nΣ+\nj = √ (Σj − iΣj ) ,\n2\n\nΣ0j = Σ3j ,\n10\n\n1\n1\n2\nΣ−\nj = √ (Σj + iΣj ) .\n2\n\n(31)\n\n\fThe physi al parti les are\n\nharged Dira\n\nfermions\n\nEj′\n\nand neutral Majorana fermions\n\nNj′ (as before, we use primes for the weak intera tion eigenstates),\n+c\nEj′ = Σ−\nj + Σj ,\nThen, for our\n\nhoi e of right-handed\n\n′\nEjL\n= Σ+c\nj ,\n\nNj′ = Σ0j + Σ0c\nj .\n\n(32)\n\nhirality for the triplets we have\n\n′\nNjL\n= Σ0c\nj ,\n\n′\nEjR\n= Σ−\nj ,\n\n′\nNjR\n= Σ0j .\n\n(33)\n\nAfter spontaneous symmetry breaking the terms in Eqs. (29), (30) lead to the neutrino\nmass matrix\n\nLν,mass\n\n\u0001\n1\n= − ν̄L′ N̄L′\n2\n\n0\n\n√v Y\n2\n\n√v Y T\n2\n\nM\n\n!\n\nνR′\nNR′\n\n!\n\n+ H.c. ,\n\nsimilar to the one for type-I seesaw in Eq. (6). The mass matrix for\nalso in luding the\n\n3×3\n\nY\n\nSM Yukawa matrix\n\nLl,mass = − l ̄L′ ĒL\n\n\u0001\n′\n\nl\n\nharged leptons,\n\n, reads\n\n√v Y l\n2\n\nvY\n\n0\n\nM\n\nThe gauge intera tions of the new triplets\n\n(34)\n\n!\n\n′\nlR\nER′\n\n!\n\n+ H.c.\n\nan be obtained from the kineti\n\n(35)\n\nterm\n\n~ j * γ μ Dμ Σ\n~j ,\nLK = i Σ\nwhere a sum over\n\nj = 1, 2, 3\n\nis understood. The\n\novariant derivative is\n\n~μ,\nDμ = ∂μ + ig T~ * W\nwith the\n\nT\n\nmatri es de\u001cned in Eqs. (24). The\n\n(36)\n\nBμ\n\n(37)\n\nterm is absent be ause the triplets\n\nhave zero hyper harge. With the de\u001cnitions in Eqs. (31) and (32), the gauge intera tions in the weak eigenstate basis are\n\n\u0001\nLW = −g Ēj′ γ μ Nj′ Wμ− + N̄j′ γ μ Ej′ Wμ+ ,\nLZ = gcW Ēj′ γ μ Ej′ Zμ ,\nLγ = e Ēj′ γ μ Ej′ Aμ ,\n\n(38)\n\nIn the mass eigenstate basis, the intera tions with the photon are obviously the same.\nFor the\n\nW\n\nand\n\nZ\n\nbosons they\n\nan be obtained after diagonalisation of the\n\nharged\n\nlepton and neutrino mass matri es. Rewriting Eqs. (38) and the SM intera tions in\nterms of the mass eigenstates\n\nE, N\n\n(dropping the subindi es) and SM leptons l ,\n\nrelevant terms are\n\n\u0001\nLW = −g Ēγ μ N Wμ− + N̄γ μ E Wμ+\n\u0001\ng\n∗\n− √ VlN  ̄lγ μ PL N Wμ− + VlN\nN̄γ μ PL l Wμ+\n2\n\u0001\n∗\n− g VlN Ēγ μ PR νl Wμ− + VlN\nν̄l γ μ PR E Wμ+ ,\n11\n\nνl , the\n\n\fLZ = gcW Ēγ μ E Zμ\n\u0001\ng\n∗\n+\nVlN ν̄l γ μ PL N + VlN\nN̄ γ μ PL νl Zμ\n2cW\n\u0001\ng\n∗\nVlN  ̄lγ μ PL E + VlN\nĒγ μ PL l Zμ ,\n+√\n2cW\nLγ = e Ēγ μ E Aμ ,\n\n(39)\n\nat \u001crst order in the small mixing\n\nYlN v\nVlN ≃ − √\n.\n2mN\nNoti e that the\n\nouplings of the heavy neutrino\n\nin seesaw I ex ept for a sign\n\nhange in the neutral\n\nlepton they are similar but a fa tor\nopposite\n\nhirality.\n\nN\n\n√\n\n2\n\n(40)\n\nto the SM leptons are the same as\nurrent term. For the heavy\n\nlarger, and the\n\nharged\n\nThe intera tions with the SM Higgs\n\nurrent\n\nharged\n\noupling has\n\nan be obtained from the\n\nYukawa term in Eq. (29),\n\n\u0011\n1 \u0010 ′\n′\n′\n′\nYij NjR\n+ N̄jR\nYji† νiL\nH\nLH = − √ ν̄iL\n2\n\u0010\n\u0011\n′\n′\n′\n′\n−  ̄liL\nYij EjR\n+ ĒjR\nYji† liL\nH.\n\n(41)\n\nRewriting the weak eigenstates as a fun tion of the mass eigenstates\n\nE, N , l\n\nand\n\nνl\n\nwe\n\n\u001cnd the intera tions\n\nLH =\n\nwhere\n\nνl\n\nmΣ = mE = mN\n\nis the\n\n\u0001\ng mΣ\n∗\nVlN ν̄l PR N + VlN\nN̄PL νl H\n2MW\n\u0001\ng mΣ\n∗\n+√\nVlN  ̄lPR E + VlN\nĒPL l H ,\n2MW\n\nommon triplet mass. Finally, using the fa t that\n\nare Majorana fermions their neutral and s alar intera tions\n\n(42)\n\nN\n\nand\n\nan be rewritten,\n\ng\n∗\nν̄l γ μ (VlN PL − VlN\nPR ) N Z μ ,\n2cW\ng mΣ\n∗\n=\nν̄l (VlN PR + VlN\nPL ) N H .\n2MW\n\nLZνN =\nLHνN\nAs in the\n\nase of heavy neutrino singlets, limits on the mixing of new fermion\n\ntriplets arise from ele troweak pre ision data. The most re ent\n\n3\nX\ni=1\n\n(43)\n\n|VeNi |2 ≤ 0.00036 ,\n\n3\nX\ni=1\n\n|VμNi |2 ≤ 0.00029 ,\n\n12\n\n3\nX\ni=1\n\nonstraints are [69℄\n\n|Vτ Ni |2 ≤ 0.00073\n\n(44)\n\n\fat 90% CL. Additional limits result from the non-observation of LFV pro esses like\n\nμ → eγ , τ → eγ\n3\nX\ni=1\n\nand\n\nτ → μγ .\n\nA global \u001ct allows to obtain the 90% CL bounds [23, 80℄\n\n3\nX\n\n∗\n≤ 1.1 × 10−6 ,\nVeNi VμN\ni\n\ni=1\n\nVeNi Vτ∗Ni ≤ 0.0012 ,\n\n3\nX\ni=1\n\nVμNi Vτ∗Ni ≤ 0.0012 ,\n(45)\n\nalthough the limits in Eqs. (44) and the S hwarz inequality imply stronger\n\nonstraints\n\nby a fa tor of two for the produ ts of the mixing with the tau lepton and the ele tron\nor muon,\n\n3\nX\ni=1\n\n|VeNi Vτ∗Ni\n\n3\nX\n\n≤ 0.0005 ,\n\ni=1\n\n|VμNi Vτ∗Ni ≤ 0.0005 .\n\n(46)\n\nThese limits are not relevant for heavy triplet produ tion at LHC, whi h takes pla e\nthrough gauge intera tions of order unity. For the de ay, the bounds on the mixing are\nsix orders of magnitude above the\n\nriti al values\n\nVlN ∼ O(10−8)\n\nfor whi h the gauge\n\nboson de ay modes begin to be suppressed with respe t to other de ays.\n\n3\n\nGeneral features of the analyses\n\nOur estimations of the dis overy potential for seesaw messengers are performed by\nsimulating their produ tion at LHC, together with the SM pro esses whi h may\nstitute a ba kground. The signals and ba kgrounds are\n\non-\n\nal ulated with matrix element\n\ngenerators, whi h produ e event samples whi h are feeded into\n\nPythia 6.4 [81℄ to add\n\ninitial and \u001cnal state radiation (ISR, FSR) and pile-up, and perform hadronisation for\nea h event. After this, a fast dete tor simulation program [82℄ is used, whose purpose\nis to simulate how the event would be seen in the ATLAS dete tor. The tagging of\nand\n\nτ\n\njets is performed with the\n\n50%, respe tively, and the\nfor light jets and 15% for\n\nc\n\nATLFASTB\n\npa kage, sele ting e\u001e ien ies of 60% and\n\norresponding mistag rates: for\njets, and for\n\nτ\n\nb\n\nb\n\ntagging, it is about 1%\n\ntagging it is about 1% for non-tau jets. The\n\nanalysis of the events is then performed in terms of\n\nharged leptons, jets and missing\n\nenergy.\nThe heavy neutrino singlet signals, des ribed further in se tion 4, are generated\n\nAlpgen extension of Ref. [29℄. For s alar and fermion triplet produ tion a new\n++ −−\n∆ , ∆±± ∆∓\ngenerator Triada has been developed. For seesaw II it al ulates ∆\n+ −\n±±\nand ∆ ∆ produ tion with subsequent leptoni de ays ∆\n→ li± lj± , ∆± → li± ν (see\nse tion 5), where li = e, μ, τ . (We will use l when referring to ele trons, muons and tau\n+ −\nleptons, reserving l for ele trons and muons only.) For seesaw III it al ulates E E\n±\nand E N produ tion with all de ays to light leptons and gauge or Higgs bosons, as\nwith the\n\n13\n\n\fdes ribed in detail in se tion 6. This is a\n\numbersome task sin e it involves 289 di\u001berent\n\n\u001cnal states with 128 di\u001berent matrix elements for\n\nE +E −\n\nand 748 \u001cnal states with 72\n\n±\n\nE N , whi h have to be generated with their orresponding weights.\nMatrix elements for the 2 → n pro esses (n = 4 for s alar triplet and n = 6 for fermion\ntriplet produ tion) are al ulated using HELAS [83℄, in luding all spin and \u001cnite width\ne\u001be ts. Integration in phase spa e is performed with VEGAS [84℄. The output of the\nmatrix elements for\n\nprogram, in the form of unweighted events, in ludes the\ninterfa e it with\n\nolour stru ture ne essary to\n\nPythia.\n\nAn equally important ingredient for a\n\norre t estimation of the dis overy potential\n\nof a signal is the ba kground evaluation. Re ent parton-level\nunderestimate SM ba kgrounds be ause they\n\nannot a\n\nal ulations [28, 35\u001537℄\n\nount for several physi al e\u001be ts\n\npresent in real experiments. One su h e\u001be t is the appearan e of extra jets in the \u001cnal\nstate from ISR, FSR and espe ially pile-up. In this way, pro esses with a small number\nof partons (and typi ally larger\n\nross se tions) give important\n\nstates with a larger number of jets, due to pile-up.\nfound in se tion 6.9:\n\n4/5 of the total\n\nontribution of\n\nontributions to \u001cnal\n\nAn illustrative example will be\n\nW nj\n\nprodu tion (where\n\nnj\n\nstands\n\nn jets at the partoni level) to a \u001cnal state with four hard jets is due to multipli ities\nn = 0, 1, 2 at the partoni level. Another physi al e\u001be t whi h annot be in luded\nin parton-level al ulations is the produ tion of isolated harged leptons from b quark\nde ays. As we found in previous work [29℄, tt̄nj and bb̄nj are the main SM ba kgrounds\n± ±\ngiving two like-sign leptons l l (l = e, μ). In the former ase, this happens when the\ntt̄ pair de ays semileptoni ally, and one b quark gives the se ond lepton, while in the\n± ± ∓\nlatter both harged leptons result from b de ays. Likewise, three leptons l l l\nan\nbe produ ed in the dilepton de ay of a tt̄ pair, the third lepton oming from a b quark.\nCharged leptons from b quark de ays typi ally have small transverse momentum, but\nthe ross se tion for tt̄nj produ tion is three orders of magnitude larger than for the\nsignals onsidered and even larger for bb̄nj , 1.4 μb. Besides, signals sometimes have\nleptons whi h are not very energeti , e.g. when they originate from τ de ays. In any\nfor\n\nase, suppressing these ba kgrounds without eliminating important signal ontributions\nis not easy. A third e\u001be t whi h makes a parton level\nsometimes a\n\nal ulation insu\u001e ient is that\n\nharged lepton is missed by the dete tor, for example be ause it is lo ated\n\ninside a hadroni\n\njet and thus it is not isolated. This is important, for instan e, for\n\nlike-sign dilepton signals, where one of the main ba kgrounds is\nwhen one of the leptons from the\n\nZ\n\nprodu tion\n\nde ay is missed by the dete tor.\n\nIn order to have predi tions for SM ba kgrounds as a\n\nAlpgen\n\nW Znj\n\n[85℄ to generate hard events whi h are interfa ed to\n\nurate as possible we use\n\nPythia\n\nusing the MLM\n\npres ription [86℄ to perform a mat hing between the \u0010soft\u0011 radiation generated by\n\n14\n\n\fPro ess\ntt̄nj , n = 0, . . . , 6\ntt̄nj , n = 0, . . . , 6\nbb̄nj , n = 0, . . . , 3\ncc̄nj , n = 0, . . . , 3\n\nDe ay\nsemileptoni\ndileptoni\nall\nall\n\ntj\ntb̄\ntW\ntt̄tt̄\ntt̄bb̄\nW nj , n = 0, 1, 2\nW nj , n = 3, . . . , 6\nW bb̄nj , n = 0, . . . , 4\nW cc̄nj , n = 0, . . . , 4\nW tt̄nj , n = 0, . . . , 4\nZ/γ nj , n = 0, 1, 2, mll < 120 GeV\nZ/γ nj , n = 3, . . . , 6, mll < 120 GeV\nZ/γ nj , n = 0, . . . , 6, mll > 120 GeV\nZbb̄nj , n = 0, . . . , 4\nZcc̄nj , n = 0, . . . , 4\nZtt̄nj , n = 0, . . . , 4\nW W nj , n = 0, . . . , 3\nW Znj , n = 0, . . . , 3\nZZnj , n = 0, . . . , 3\nW W W nj , n = 0, . . . , 3\nW W Znj , n = 0, . . . , 3\nW ZZnj , n = 0, . . . , 3\nZZZnj , n = 0, . . . , 3\n\nW → lν\nW → lν\n\nTable 1:\n\nBa kground pro esses\n\nfb−1\n\nall\nall\nall\n\nW → lν\nW → lν\nW → lν\nW → lν\nW → lν\nZ → l+ l−\nZ → l+ l−\nZ → l+ l−\nZ → l+ l−\nZ → l+ l−\nZ → l+ l−\nW → lν\nW → lν , Z → l+ l−\nZ → l+ l−\n2W → lν\n\nall\nall\n\n2Z → l+ l−\n\n300\n300 fb−1\n0.075 fb−1\n0.075 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n10 fb−1\n30 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n10 fb−1\n30 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n300 fb−1\n\nonsidered in the simulations.\n\nindi ates the de ay modes in luded (where\nluminosity equivalent generated. The last\n\njets generated by\n\nl = e, μ, τ ),\n\nolumn\n\nafter mat hing, with K and M standing for\n\nPythia and the \u0010hard\u0011\n\nL\n\n10\n\n3\n\nEvents\n60.8 M\n15.2 M\n116 M\n145 M\n9.5 M\n540 K\n16 M\n1.6 K\n340 K\n557.4 M\n10 M\n5.2 M\n5.5 M\n50.6 K\n54.9 M\n1.1 M\n17.3 M\n2M\n1.8 M\n18.7 K\n2.9 M\n377 K\n37.4 K\n14.7 K\n48.7 K\n15.3 K\n114\n\nThe se ond\n\nand the third\n\nolumn\n\nolumn the\n\norresponds to the number of events\n\nand\n\n106\n\nevents, respe tively.\n\nAlpgen avoiding double\n\nounting. Ba kground\n\n−1\nsamples are generated with large statisti s, often 300 fb , in order to avoid \u001du tuations\nin the \u001cnal sele ted samples. This is a demanding\n\nomputational task, whi h would\n\ntake around ten years in a modern single pro essor system. The ba kgrounds generated\nand the\n\norresponding luminosities are\n\nolle ted in Table 1.\n\n15\n\nFor\n\nbb̄nj\n\nand\n\ncc̄nj\n\nthe\n\n\fstatisti s is small but the samples are still very large, allowing to estimate\nthese ba kgrounds as des ribed in detail in appendix A of Ref. [29℄.\ngenerated with a statisti s of 3000 fb\n\n−1\n\norre tly\n\nSignals are all\n\n−1\n, and all results are res aled to 30 fb\nin the\n\nTables.\nThe pro edure used for estimating the statisti al signi\u001c an e of a signal is\nered\n\nase by\n\nase. In the absen e of any systemati\n\nthe statisti al signi\u001c an e would be\n\n√\n\nS0 ≡ S/ B ,\n\nonsid-\n\nun ertainty on the ba kground,\n\nwhere\n\nS\n\nsignal and ba kground events, or its analogous from the\n\nand\n\nB\n\nare the number of\n\nP -number\n\nfor small ba k-\n\ngrounds where Poisson statisti s must be applied. Nevertheless, there are systemati\nun ertainties in the ba kground evaluation from several sour es: the theoreti al\nlation, parton distribution fun tions (PDFs), the\nFSR, et . as well as some spe i\u001c\ns ale and\n\nb\n\nollider luminosity, pile-up, ISR and\n\nun ertainties related to the dete tor like the energy\n\ntagging e\u001e ien y. Provided that the signal manifests as a\n\ndistribution (as in doubly\n\nal u-\n\nlear peak in a\n\nharged s alar produ tion) or a long tail, it will be possi-\n\nble to normalise the ba kground dire tly from data, and extra t the peak signi\u001c an e.\nIn this\n\nase, we give estimators of the sensitivity\n\nonsidering two hypotheses for the\n\nba kground normalisation:\n(a) the SM ba kground normalisation does not have any un ertainty;\n(b) the SM ba kground is normalised dire tly from data.\nIn some of the\nground\n\nases examined the signal has a wide distribution and the SM ba k-\n\nannot be normalised from data. In su h situations we in lude a 20% ba k-\n\nground un ertainty in the signi\u001c an e summed in quadrature, using as estimator\n\nS/\n\np\n\n4\n\nB + (0.2B)2 .\n\nS20 ≡\n\nSeesaw I signals\n\nFor our study we\n\nonsider the single heavy neutrino produ tion pro ess\n\nq q̄ ′ → W ∗ → l± N ,\nwith\n\nl = e, μ, τ .\n\nIts\n\nross se tion depends on\n\nmN\n\nas well as on the small mixing\n\nto whi h the amplitude is proportional. Its dependen e on\nnormalised to\n2 The\n\n2\n\n2\n\n|VlN | = 1.\n\n(47)\n\nmN\n\nVlN ,\n\nis plotted in Fig. 1,\n\nHeavy Majorana neutrino singlets de ay to SM leptons plus\n\ntotal ross se tion plotted in Fig. 2 of Ref. [29℄ is underestimated by a fa tor of two, while the\nross se tions with N de ay and with kinemati al uts, as well as the numbers of events in luded in all\nTables, are orre t. We thank B. Gavela for bringing this in orre t normalisation into our attention.\n16\n\n\f5\n\n10\n\n4\n\n10\n\n3\n\n2\n\nσ / | VlN | (pb)\n\n10\n\n2\n\n10\n\n10\n\n1\n\n100\n\n50\n\nmN\n\n150\n\n200\n\nFigure 1: Cross se tion for produ tion of heavy neutrino singlets\n\nq q̄ → l± N\n\nat LHC.\n\na gauge or Higgs boson, with partial widths\n\nΓ(N → l− W + ) = Γ(N → l+ W − )\n\u0012\n\u0013\u0012\n\u0013\n3\n2\n2\n4\nMW\nMW\nMW\ng2\n2 mN\n|VlN |\n1− 2\n1+ 2 −2 4\n,\n=\n2\n64π\nMW\nmN\nmN\nmN\n\u0012\n\u0013\u0012\n\u0013\n3\ng2\nMZ2\nMZ2\nMZ4\n2 mN\nΓ(N → νl Z) =\n|VlN |\n1− 2\n1+ 2 −2 4 ,\n64πc2W\nMZ2\nmN\nmN\nmN\n\u0012\n\u00132\n3\nMH2\ng2\n2 mN\n|VlN |\n1− 2\n.\nΓ(N → νl H) =\n2\n64π\nMW\nmN\nFor\n\nmN < MW\n\nthese two body de ays are not possible and\n\nfermions, mediated by o\u001b-shell bosons.\n\nHowever, as it\n\nratio for ea h of the four\n\nan be\n\nl = e, μ, τ\n\nare in the ratios\n\n|VeN |2 :\n\nlearly seen from Eqs. (48), the total bran hing\n\nhannels above (summing over l ) is independent of the heavy\n\nneutrino mixing and determined only by\nHeavy neutrino produ tion\n\n2\n\nde ays into three\n\nWithin any of these four de ay modes, the\n\nbran hing fra tions for individual \u001cnal states\n\n|VμN |2 : |Vτ N |2 .\n\nN\n\n(48)\n\nmN\n\nand the gauge and Higgs boson masses.\n\nross se tions are suppressed by the small mixings\n\n2\n\n|VeN | ≤ 0.0030, |VμN | ≤ 0.0032, |Vτ N |2 ≤ 0.0062 [69℄, and then the observability\nof lN produ tion is limited to masses up to 150 GeV approximately due to the large\nba kgrounds [29℄.\nergeti\n\n3\n\nIn this situation, heavy neutrino de ay produ ts are not very en-\n\nand SM ba kgrounds are important. Among the possible \u001cnal states given by\n\nEqs. (48), only\n\nharged\n\nurrent de ays give \u001cnal states whi h may be observable in\n\n3 The\n\nmass rea h is mu h larger at e+ e− [56,73℄ and eγ [87℄ olliders, whose environment is leaner\n(see Ref. [57℄ for a review).\n\n17\n\n\fprin iple. Likewise, other single produ tion pro esses like\n\nq q̄ → Z ∗ → νN ,\ngg → H ∗ → νN\n\ngive\n\nl±\n\nand\n\nl+ l−\n\n(49)\n\n\u001cnal states whi h are unobservable due to the huge ba kgrounds.\n\nPair produ tion\n\nq q̄ → Z ∗ → NN\nhas its\n\nross se tion suppressed by\n\nthus negligible.\n\n|VlN |4 ,\n\n(50)\n\nphase spa e and the\n\nZ\n\npropagator, and is\n\nIn a previous work [29℄ we have studied in great detail the observability of heavy\nneutrino singlets in the like-sign dilepton \u001cnal state for\n\nmN < MW ,\nba kgrounds.\n\nmN > MW\n\nas well as for\n\nperforming sophisti ated likelihood analyses to e\u001be tively suppress the\nWe found that a heavy neutrino\n\noupling only to the ele tron with\n\n2\n\n|VeN | = 0.0054 ould be dis overed up to mN = 145 GeV, and if it ouples to the muon\n2\nwith |VμN | = 0.0096 it ould be dis overed up to 200 GeV. (If it ouples only to the tau\n\nthe signals are swamped by the SM ba kground.) For heavy neutrinos lighter than the\n\nW\n\nboson, we found that, for example, a 60 GeV neutrino\n\nbe dis overed up to\n\n|VμN |2 = 4.9 × 10−5.\n\noupling to the muon might\n\nThese limits, however, are obtained from very\n\noptimised analyses whi h use as input the heavy neutrino mass to build the probability\ndistributions for the heavy neutrino signal. In this se tion we will take the opposite\napproa h, following the philosophy of this paper:\n\u0010generi \u0011 model-independent\n\nwe will investigate whether with\n\nuts the heavy neutrino (as well as seesaw II and seesaw\n\nIII signals) might be observable. Of\narried out assuming some value for\n\nourse, dedi ated experimental sear hes\n\nmN\n\nan be\n\nand optimising the kinemati al distributions\n\nfor this mass to a hieve the best sensitivity. But, at least in a \u001crst step, LHC sear hes\nare likely to be performed with general and model-independent event sele tions.\nA major di\u001beren e between heavy neutrino signals studied in this se tion and s alar\ntriplet and fermion triplet signals\n\non erns lepton \u001davour.\n\nFor the latter, the SM\n\nba kgrounds involving ele trons and muons are alike at large transverse momenta,\nand it makes sense to perform \u0010\u001davour blind\u0011 sear hes summing ele trons and muons.\nThis is also sensible from the point of view of the signals, whi h have the same\nse tions if the new states\n\nross\n\nouple to the ele tron, the muon or both, as it will be argued\n\nin se tions 5 and 6. On the other hand, for heavy neutrino produ tion the situation is\nlearly di\u001berent. At low transverse momenta SM ba kgrounds involving ele trons are\nmu h larger than those involving muons, as shown in Ref. [29℄, and sear hes must be\nperformed independently in order to avoid that a possible signal in muon \u001cnal states is\n\n18\n\n\fhidden by ele tron ba kgrounds. Moreover, heavy neutrino signals are di\u001berent if the\nheavy neutrino\n\n±\n\ne N\n\nouples to the ele tron, the muon or both: if it\n\nprodu tion will take pla e, if it\n\nand if it\n\nouples to the ele tron\n\nouples to the muon we will have\n\nonvenient to divide \u001cnal states by lepton \u001davour.\n\nIn what follows we assume two s enarios: (i) a heavy neutrino\n\n2\n\n|VeN | = 0.0030, labelled as s enario\n|VμN | = 0.0032, labelled as s enario S2.\n\nthe ele tron with\nmuon with\n\n2\n\nGeV, between the two\n\nthe produ tion\n\nthree\n\nS1; (ii)\n\noupling only to\n\noupling only to the\n\nWe will take a mass\n\nmN =\n\nases previously studied. For su h a heavy neutrino mass\n\nross se tion is large, and the kinemati s of the signal is\n\ndi\u001berent from the other\nBr(N\n\nprodu tion,\n\nouples to both we will have the two pro esses simultaneously. Therefore, for\n\nheavy neutrino sear hes it is\n\n100\n\nμ± N\n\nases.\n\nThe de ay bran hing ratios are Br(N\n\nompletely\n\n→ l− W + ) =\n\n→ l+ W − ) = 0.43, Br(N → νZ) = 0.14. We will examine \u001cnal states with (a)\n± ± ∓\n± ±\nharged leptons l l l X ; (b) two like-sign dileptons l l X , where X denotes\n\npossible additional jets and the leptons\n\nan have di\u001berent \u001davour. Final states with\n\ntwo opposite-sign leptons or only one lepton are unobservable for these small\n\nross\n\nse tions.\n\n4.1 Final state l± l± l∓\nTrilepton signals are produ ed in the two\nneutrino, with subsequent leptoni\n\nharged\n\nde ay of the\n\nurrent de ay\n\nW\n\nhannels of the heavy\n\nboson, e.g.\n\nl+ N → l+ l− W + → l+ l− l+ ν̄ ,\n\nl+ N → l+ l+ W − → l+ l+ l− ν ,\n(and small additional\nlean on e that\n\nW Znj\n\nτ\n\nontributions from\nprodu tion\n\ninvariant mass of opposite\n\nleptoni\n\n(51)\n\nde ays). This \u001cnal state is very\n\nan be almost eliminated with a simple\n\nharge leptons.\n\nFor event pre-sele tion we require the presen e of two like-sign\nand\n\nl2\n\nut on the\n\n(ordered by de reasing\n\npT ) with transverse\n\nan additional lepton of opposite\n\nharge. The\n\nharged leptons\n\nl1\n\nmomentum larger than 30 GeV, and\n\nhoi e of the\n\npT\n\nut for like-sign leptons\n\nis motivated by the need to redu e ba kgrounds where soft leptons are produ ed in\nde ays, for example\n\ntt̄nj\n\nin the dilepton\n\nb\n\nhannel. For event sele tion, in a \u001crst step we\n\nonly require that neither of the two opposite-sign lepton pairs have an invariant mass\nloser to\n\nMZ\n\nthan 10 GeV. These pre-sele tion and sele tion\n\nriteria are the same as\n\nthose applied in the analysis of s alar and fermion triplet signals in the next se tions,\nbut in this subse tion we split the sample in two disjoint sets:\n\n\u001cnal states with at\n\nleast two ele trons (labelled as \u0010 2e\u0011) and with at least two muons (\u0010 2μ\u0011). The number\n19\n\n\fof events for the signal and the largest ba kgrounds is given in Table 2 for these two\nstages of event sele tion.\nPre-sele tion\n\nN (S1)\nN (S2)\ntt̄nj\ntW\nW tt̄nj\nZbb̄nj\nZtt̄nj\nW Znj\nZZnj\nW W W nj\nW W Znj\n\nof 30 fb\n\nImpr. sele tion\n\n2e\n\n2μ\n\n2e\n\n2μ\n\n2e\n\n2μ\n\n37.1\n\n0\n\n32.4\n\n0\n\n28.6\n\n0\n\n0\n\n37.8\n\n0\n\n33.1\n\n0\n\n29.6\n\n244.8\n\n78.0\n\n159.8\n\n52.4\n\n58.4\n\n16.3\n\n14.8\n\n3.0\n\n10.5\n\n1.7\n\n6.5\n\n0.6\n\n25.6\n\n19.9\n\n20.6\n\n14.5\n\n3.8\n\n2.6\n\n17.1\n\n16.2\n\n1.1\n\n0.9\n\n0.5\n\n0.1\n\n82.5\n\n69.9\n\n10.3\n\n6.5\n\n2.6\n\n1.1\n\n2166.4\n\n1947.3\n\n49.2\n\n24.3\n\n36.8\n\n17.8\n\n141.0\n\n135.0\n\n2.8\n\n1.4\n\n1.6\n\n1.2\n\n10.8\n\n12.0\n\n7.9\n\n8.9\n\n4.7\n\n5.3\n\n23.9\n\n18.8\n\n1.1\n\n0.7\n\n0.8\n\n0.4\n\nTable 2: Number of events for\n\n−1\n\nSele tion\n\nl± l± l∓\n\nsignals and main ba kgrounds with a luminosity\n\n.\n\nThe invariant mass of the like-sign leptons\ndi\u001berent sour es of new physi s giving\n\n± ± ∓\n\nl l l\n\nml1 l2\n\nis a good dis riminant among\n\nsignals. In the\n\nase of heavy neutrino\n\nprodu tion this distribution, presented in Fig. 2, is broad and without a long tail. For\nlarger\n\nN\n\nmasses the\n\nml1 l2\n\ntail will be longer, but in this\n\nase the\n\nross se tions are mu h\n\nsmaller. In dimuon \u001cnal states the ba kgrounds are very small and a signal in s enario\nS2 might be dete ted (although with a signi\u001c an e smaller than\n\n5σ )\n\nwithout the need\n\nof further improvements in the analysis, provided that the ba kground un ertainties are\nsmall. Negle ting them, the ex ess of events would amount to a statisti al signi\u001c an e\n\nS0 = 3.1σ ,\n\nwhereas if we\n\nsigni\u001c an e is smaller,\n\nonsider a 20% systemati\n\nS20 = 1.3σ .\n\nun ertainty in the ba kground the\n\nThis ex ess is distributed a ross the\n\nml1 l2\n\nrange, as\n\nit is shown on the right side of Fig. 2, and does not display a peak as it does in s alar\ntriplet produ tion (see next se tion) nor a long tail as in fermion triplet produ tion\n(see se tion 6). This fa t makes it di\u001e ult to normalise the ba kground dire tly from\ndata in a given \u0010 ontrol\u0011 region to extra t the signi\u001c an e of an ex ess in another phase\nspa e region, as it will be done in some of the\n\nases analysed in this paper.\n\nOther kinemati al distributions, for example the transverse momenta of the likesign leptons, exhibit analogous behaviour with the event ex ess distributed in a wide\nrange but without long tails whi h would be a\n20\n\nlear indi ation of the presen e of a\n\n\f20\n\n4\nN (S1)\nN (S2)\n\nSM bkg + N (S2)\nSM bkg\n\nEvents / 10 GeV\n\n15\n\n2\n\n1\n\n5\n\n0\n\n200\n\n100\n\nml l\n\n300\n\n± ±\n\n±\n\n± ±\n\nl l l\n0\n\n10\n\n400\n\nl l l\n0\n\n500\n\n0\n\n200\n\n100\n\n12\n\nml l\n\n300\n\n±\n\nEvents / 10 GeV\n\n3\n\n400\n\n500\n\n12\n\nFigure 2: Left: Kinemati al distribution at pre-sele tion of the like-sign dilepton invariant mass for the signals in the two heavy neutrino s enarios. Right: the same, for\nthe SM and the SM plus the signal in s enario S2 at the sele tion level. The luminosity\n\n−1\nis 30 fb .\n\nnew physi s signal. This implies that, in order to be dete ted, heavy neutrino signals\nrequire dedi ated analyses, often optimised for a given\nin Ref. [29℄. For this spe i\u001c\n\nmN\n\nvalue, as the one presented\n\nheavy neutrino signal there are additional\n\nbe imposed to further redu e ba kgrounds.\n\nuts whi h\n\nan\n\nFor an improved event sele tion we ask\n\nthat\n\n(i) no\n\nb\n\njets\n\nan be present in the \u001cnal state;\n\n(ii) the like-sign leptons must be ba k-to-ba k, with their angle in transverse plane\nlarger than\n\nThese sele tion\n\nπ/2.\nriteria are\n\nonvenient for this heavy neutrino singlet signal but rather\n\ninadequate for fermion triplet signals in the same \u001cnal state. The number of events\nafter these additional requirements is given in the last two\nstatisti al signi\u001c an e does not rea h\nand\n\nS20 = 2.6\n\n5σ\n\nin any of the\n\nin S2. The variable sele tion\n\nfor this parti ular value of\n\nmN ,\n\nobtaining\n\nS2 (allowing dis overy with 180 fb\nobtained with a probabilisti\n\n−1\n\nases:\n\nolumns of Table 2. The\n\nS20 = 1.1\n\nan still be improved and\n\nS20 = 1.7\n\nin s enario S1\nuts optimised\n\nin s enario S1 and\n\nS20 = 3.7\n\nin\n\n), and we expe t that mu h better results will be\n\nanalysis. This is in agreement with our statement that\n\nheavy neutrino singlets require dedi ated sear hes, optimised for their dete tion.\n\n21\n\n\f4.2 Final state l± l±\nHeavy neutrino signals in this \u001cnal state have been widely studied [25\u001529℄. They are\nprodu ed from the LNV neutrino de ay and subsequent hadroni\nde ay when the lepton is missed.\nbased on simple sele tion\n\nriteria\n\nould \u001cnd su h a signal. For event pre-sele tion we\nharged leptons with\n\nrelatively large transverse momentum\nhas been shown elsewhere [29℄. The\n\nheavy neutrino s enarios.\n\ne μ\n\nwith this\n\nut, SM ba kgrounds are non-negligible, as it\n\n± ±\n\ne e\n\nand\n\n± ±\n\nμ μ\n\nolle ted in\n\n\u001cnal states for ea h of the two\n\nsignals are not generated in any of them (although they\n\nare produ ed if a heavy neutrino simultaneously\nand hen e they are not\n\npT > 30 GeV. Even\n\norresponding numbers of events are\n\nonsider independently the\n\n± ±\n\nde ay, or leptoni\n\nIn this se tion we investigate whether a sear h\n\nrequire the presen e of two like-sign\n\nTable 3. We\n\nW\n\nouples to the ele tron and muon),\n\nonsidered.\nPre-sele tion\n\nN (S1)\nN (S2)\ntt̄nj\ntW\nW tt̄nj\nW W nj\nW Znj\nW W W nj\n\nSele tion\n\n2e\n\n2μ\n\n2e\n\n2μ\n\n28.1\n\n0\n\n13.5\n\n0\n\n0\n\n25.6\n\n0\n\n13.5\n\n620.0\n\n8.4\n\n36.7\n\n0.1\n\n39.3\n\n1.1\n\n4.2\n\n0.2\n\n53.7\n\n45.1\n\n1.1\n\n0.7\n\n54.2\n\n47.8\n\n5.2\n\n4.8\n\n269.9\n\n182.6\n\n23.7\n\n13.8\n\n21.2\n\n22.6\n\n1.2\n\n1.3\n\nTable 3: Number of events for the like-sign dilepton signals and main ba kgrounds for\n\n−1\na luminosity of 30 fb .\n\nDespite the larger bran hing ratio, the number of signal events is smaller than in\nthe previous trilepton\na mass\n\nhannel be ause the\n\nmN = 100 GeV) are not very\n\nGeV severely redu es the signal.\nlarger but signal\n\n4\n\nharged leptons from\n\nenergeti\n\nN → lW\n\nde ay (with\n\nin general, and the requirement\n\npT > 30\n\nFor larger heavy neutrino masses the e\u001e ien y is\n\nross se tions are smaller.\n\nFor event \u001cnal sele tion we also require:\n\n(i) at least two jets in the \u001cnal state with\n4 In\n\npT > 20\n\nGeV, and no\n\nb-tagged\n\njets;\n\nmost of the trilepton signal events the like-sign sub-leading lepton results from leptoni W\nde ay, and hen e the suppression is smaller.\n22\n\n\f(ii) missing energy smaller than 30 GeV;\n(iii) the transverse angle between the two leptons must be larger than\n\nThe number of events passing these\n\nπ/2.\n\nuts is also in luded in Table 3. After this simple\n\nevent sele tion the heavy neutrino signals in the diele tron\n\nS0 = 1.5σ , S20 = 0.7σ but in the dimuon hannel\nS0 = 2.9σ , S20 = 2.1σ , whi h would be noti ed if the\n\nwith\n\nhannel are not signi\u001c ant,\n\nthe event ex ess amounts to\nba kground normalisation is\n\npre ise enough. The invariant mass distribution of both signals (without ba kground)\n\nat pre-sele tion level is shown in Fig. 3 (left), and for s enario S2 the distribution also\nin luding the ba kground is shown in Fig. 3 (right) at sele tion level. We\n\nan observe\n\nthat again the signal dilepton distribution is very broad but without a long tail, whi h\ndistinguishes the neutrino singlet from s alar and fermion triplet produ tion.\n3.0\n\n6\nN (S1)\nN (S2)\n\n2.0\n1.5\n1.0\n± ±\n\n0.5\n0\n\n200\n\n100\n\nml l\n\n300\n\n400\n\n4\n3\n2\n± ±\n\nl l\n\n1\n\nl l\n\n0\n\nSM bkg + N (S2)\nSM bkg\n\n5\n\nEvents / 20 GeV\n\nEvents / 10 GeV\n\n2.5\n\n0\n\n500\n\n0\n\n100\n\n200\n\n12\n\nml l\n\n300\n\n400\n\n500\n\n12\n\nFigure 3: Left: Kinemati al distribution at pre-sele tion of the like-sign dilepton invariant mass for the signals in the two heavy neutrino s enarios. Right: the same, for\nthe SM and the SM plus the signal in s enario S2 at the sele tion level. The luminosity\n\n−1\nis 30 fb .\n\nThe re onstru tion of the signal may be useful for its identi\u001c ation when large\nluminosities are available. The\n\nW\n\nboson de aying hadroni ally\n\nan be re onstru ted\n\nto some extent from the two jets with largest transverse momentum, as it is shown in\nFig. 4 (up, left). As it happens for larger neutrino masses [29℄, the re onstru tion is\nnot very good and the dis riminating power against the ba kground is small, so that\nperforming a\n\nut on this variable results in a large signal loss. The reason for this bad\n\nre onstru tion is that for the heavy neutrino signal the jets from the\nhave small transverse momentum (on e that the\nsele tion to have\nthe\n\nW\n\npT > 30\n\nW\n\nde ay often\n\nharged lepton is required by pre-\n\nGeV), and often one or the two jets sele ted to re onstru t\n\nboson are produ ed from pile-up.\n\n23\n\n\fThe heavy neutrino mass\nharged leptons.\n\nan be re onstru ted from the\n\nIn prin iple, it\n\nmN ,\n\nboson and one of the\n\nan be found by taking both possibilities and\n\nstru ting a plot with two entries per event.\npeak near the true\n\nW\n\non-\n\nThe kinemati al distribution displays a\n\nas shown in Fig. 4 (up, right) whi h might be visible over\n\nthe ba ground (this Figure, down). The observability of this peak is\n\nompromised by\n\nthe large ba kground in s enario S1, and by the small statisti s in both\nheavy neutrino mass is known from other sour e then invariant mass\nformed, improving the signi\u001c an e to\n\nS20 = 1.2σ , S20 = 3.1σ\n\nuts\n\nases. If the\nan be per-\n\nin s enarios S1 and S2,\n\n−1\nan be dis overed with 180 fb .\n\nrespe tively. In the latter, the heavy neutrino signal\n\nFinally, it is worth remarking again that the results presented here\n\nan be improved if,\n\ninstead of a simple appli ation of kinemati al uts like we have done here, one performs\na likelihood analysis as in Ref. [29℄. But in any\n\nase heavy neutrino signals are very\n\nsmall and di\u001e ult to observe.\n3.0\n\n6\n\nN (S1)\nN (S2)\n\n4\n\n2.0\n\n3\n\n1.5\n\n2\n\n1.0\n± ±\n\n0.5\n0\n\n0\n\n50\n\n100\n\n200\n\n150\n\nmjj\n\n250\n\n± ±\n\n1\n\nl l\n\n0\n\n300\n\nl l\n\n0\n\n100\n\n200\n\nml jj + ml\n1\n\n20\n\n300\n\n2\n\n500\n\n2 × Events / 20 GeV\n\n10\n\n± ±\n\nl l\n\n5\n\nSM bkg + N (S2)\nSM bkg\n\n10\n\n15\n\n8\n6\n4\n± ±\n\nl l\n\n2\n0\n\n400\n\njj\n\n12\nSM bkg + N (S1)\nSM bkg\n\n2 × Events / 20 GeV\n\nN (S1)\nN (S2)\n\n5\n\n2 × Events / 20 GeV\n\nEvents / 10 GeV\n\n2.5\n\n0\n\n100\n\n200\n\nml jj + ml\n1\n\n300\n\n2\n\n400\n\n0\n\n500\n\n0\n\n200\n\n100\n\nml jj + ml\n\njj\n\nFigure 4: Up, left: re onstru ted\n\n1\n\nW\n\nmass. Up, right:\n\n+\n\nl2 jj\n\n400\n\n500\n\njj\n\ninvariant mass dis-\n\ntribution (two entries per event). Down:\n\nl1 jj\n\nin luding ba kground. All distributions\n\norrespond to sele tion level and a luminosity\n\n−1\nof 30 fb .\n\n24\n\n+\n\nl2 jj\n\nl1 jj\n\n300\n\n2\n\ndistribution for the two s enarios\n\n\f4.3 Outlook\nHeavy neutrino signals are limited by the small mixing of the heavy neutrino required\nby pre ision\nGeV are a\n\nonstraints [69℄. This fa t implies that only masses of the order of 100\n\nesible at LHC. For this mass range, SM ba kgrounds are larger and, sin e\n\nprodu tion ross se tions are relatively small, heavy neutrino singlets are rather di\u001e ult\nto observe.\nIn this se tion we have assumed a mass\n\nmN = 100\n\nGeV and examined the possible\n\nsignals in the like-sign dilepton \u001cnal state, whi h is the only\nmany studies, and also in the trilepton \u001cnal state.\nhas not been previously studied in the\n\nhannel\n\nonsidered in\n\nTo our knowledge, this\n\nhannel\n\nontext of heavy neutrino produ tion, possibly\n\ndue to its smaller\n\nross se tion. We have found that for this parti ular heavy neutrino\n\nmass the trilepton\n\nhannel is slightly better than the like-sign dilepton one. Although\n\nthis fa t may well be spe i\u001c\n\nfor the heavy neutrino mass assumed, it underlines the\n\nimportan e of sear hing for heavy neutrinos in all the\ngive observable signals. Indeed, the trilepton\n\nhannels in whi h they might\n\nhannel allows to dis over Dira\n\nneutrino\n\nsinglets [64℄, whi h do not give signi\u001c ant like-sign dilepton signals.\nHeavy neutrino signals are\n\nhara terised by low transverse momenta, and by a\n\nbroad like-sign dilepton invariant mass distribution whi h does not have peaks nor\nlong tails. This allows to distinguish them from s alar triplet (seesaw II) and fermion\ntriplet (seesaw III) signals . But, more importantly, s alar and fermion triplets lead\nto other \u001cnal states whi h are not present in heavy neutrino produ tion, and thus the\ndis rimination should be easy in\n\n5\nWe\n\nase that a positive signal is observed.\n\nSeesaw II signals\nonsider three pro esses in whi h the members of the s alar triplet\n\nin hadron\n\nan be produ ed\n\nollisions,\n\nq q̄ → Z ∗ / γ ∗ → ∆++ ∆−− ,\n\nq q̄ ′ → W ∗ → ∆±± ∆∓ ,\n\nq q̄ → Z ∗ / γ ∗ → ∆+ ∆− .\n\nTheir\n\n(52)\n\nross se tions only depend on the s alar masses, be ause the intera tions are\n\n\u001cxed by the triplet gauge\n\nouplings.\n\nWe assume for simpli ity that\n\n25\n\n∆++\n\nand\n\n∆+\n\n\fare degenerate.\n\n5\n\nThe\n\nross se tions are plotted in Fig. 5 (left) as a fun tion of the\n\nommon s alar mass. As emphasised in Ref. [33℄, the mixed\nlargest sour e of doubly\nfor\n\n∆++ ∆−− ,\n\nharged s alars, with a\n\nwhereas for\n\n∆+ ∆−\n\nthe vev\n\nprodu tion is the\n\nross se tion about twi e larger than\n\nit is smaller. Pro esses involving\n\nnot in luded be ause they do not\nThe\n\n∆±± ∆∓\n\n∆0\n\nprodu tion are\n\nontribute to the \u001cnal states studied.\n\nross se tion for four lepton \u001cnal states in whi h we are interested depends on\n\nv∆\n\nas well, through the de ay bran hing ratios. For the spe i\u001c\n\nase of\n\n∆++\n\nde ays, we have\n\nM∆++\n|Yij |2 ,\n4π(1 + δij )\n2\nM∆3 ++\ng 4 v∆\n2 1/2\n2\n4\n→ W +W + ) =\n(1 − 4rW\n) (1 − 4rW\n+ 12rW\n),\n4\n32π MW\n\nΓ(∆++ → li+ lj+ ) =\nΓ(∆++\nwhere li\n\n= e, μ, τ\n\nYukawa\n\nfor\n\nouplings\n\nYij\n\ni = 1, 2, 3, δij\n\nis the Krone ker delta and\n\n(53)\n\nrW = MW /M∆++ .\n\nThe\n\nare related to the neutrino masses by Eq. (20), so that the sum\n\nof partial widths to dilepton \u001cnal states is\n\nX\n\n++\n\nΓ(∆\n\nij\n\n→\n\nli+ lj+ )\n\nP\nM∆++ m2νi\n=\n,\n2\n8π\n4v∆\n\n(54)\n\nindependently of the details of light neutrino mixing. The de ay of\npla e inside the dete tor, be ause when\npressed the diboson\n\nv∆\n\nis large and the dilepton\n\nhannel is enhan ed [36℄, and vi e versa. For\n\nthe de ays of the doubly\n\n∆±±\n\nv∆\n\nalways takes\n\nhannel is sup-\n\nsu\u001e iently small\n\nharged s alar are dominated by the dilepton mode. Let us\n\nassume for the moment that light neutrino masses saturate the bound [2℄\n\nin whi h\n\n++\n\n∆\n(τ\n\n−−\n\n∆\n\nX\n\neV ,\n\n(55)\n\nase they are quasi-degenerate. Then, the dependen e of the\n\n+ + − −\n\n→l l l l\n\nprodu tion on\n\nM∆++\n\nand\n\nv∆ is as shown on the right side of Fig. 5\n\nomparison we plot the\n\nv∆\n\nband\n\norresponding to Yukawa\n\nount for\nouplings\n\nof the same order as the ele tron and tau Yukawas. Note, however, that there is no\n\nreason in prin iple to expe t that the triplet Yukawa\nin Eq. (15) are the same as the Dira\n\nv∆\n\nross se tion for\n\nleptons are in luded in the \u001cnal state but their de ay is not taken into a\n\nthe moment). For\n\nYij\n\nmνi < 0.4\n\noupling to the\n\nharged leptons\n\noupling to the Higgs doublet. These values for\n\nmust be regarded only as a hint, showing that if doublet and triplet Yukawas are\n\nof the same size, then the dilepton de ay mode\n5A\n\n∆++ → li+ lj+\n\ndominates. For neutrino\n\n~ † T i ∆)\n~ in the s alar potential indu es a mass splitting between the triplet\nterm λ5 (φ† τ i φ)(∆\n2\n2\nstates ∼ λ5 /g (MW /M∆ ), whi h is small enough to negle t s alar de ays into other triplet members\nif λ5 is smaller than 1 and the Yukawa ouplings Yij are not too small [33℄.\n26\n\n\f4\n\n10\n\n10\n\n±±\n\n10\n\n∆∆\n\n10\n\nv∆ (GeV)\n\nσ (fb)\n\n+ −\n\n2\n\n10\n1\n10\n\n10\n\n-1\n\n200\n\n300\n\n400\n\n500\n\n600\n\n700\n\n800\n\n900\n\n10\n\n1000\n\nYij = Ye\n\n50\n\n10\n\n-2\n\n-5\n\n-6\n\n10\n\n10 100\n\n20 10\n\n5\n\n1\n\n0.5\n\n0.2\n\n0.1\n\n-8\n\nYij = Yτ\n\n-9\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nM∆++ (GeV)\n\nFigure 5: Left: Cross se tion for produ tion of\n\n∆+ ∆−\n\n2\n\n-7\n\nM∆ (GeV)\n\nand\n\n+ +− −\n\n→ l l l l ) (fb)\n\n-4\n\n∆ ∆\n10\n\n++ −−\n\nσ ( pp → ∆ ∆\n\n++ −−\n\n∆ ∆\n\n3\n\n-3\n\n±\n\n10\n\nat LHC. Right:\n\nross se tion for\n\nharged s alar pairs\n\n∆++ ∆−−\n\n∆++ ∆−− , ∆±± ∆∓\n\nde aying into four lepton \u001cnal\n\nstates.\n\nmasses not saturating the bound in Eq. (55) the whole plot in Fig. 5 (right) s ales\nup or down with the neutrino mass sum, in luding the band\nthe same argument applies. We will then assume that doubly\ntwo\n\nYij = Ye , Yij = Yτ ,\n\nharged s alars de ay to\n\nharged leptons. Using an analogous argument, it follows that\n\nde ay into a\n\nand\n\n∆±\n\npredominantly\n\nharged lepton and a neutrino, with partial widths\n\nΓ(∆+ → li+ νj ) =\n\nM∆+\n|Yij |2 .\n8π\n\n(56)\n\nS alar triplets with masses of the order of 1 TeV or lighter are also predi ted in Little\nHiggs models [88℄ (see for a review Ref. [89℄) and some models of grand uni\u001c ation [90℄.\nIf we impose extra symmetries to make the heavy se tor of the model less sensitive to\nele troweak pre ision\nparity [91℄, the\n\nv∆ .\n\nIn this\n\nOne\n\nonstraints, as for instan e in the Littlest Higgs model with T-\n\noupling\n\n~ φ̃\nφ† (~τ * ∆)\n\nan be forbidden and,\n\nonsequently, a non-zero\n\nase our analysis fully applies but light neutrino masses are not generated.\n\nan imagine, however, a very weak breaking of T-parity and then a tiny\n\nv∆ ,\n\nin\n\nagreement with our assumption [34℄.\nThe relative abundan e of\n\nl = e, μ, τ\n\nin\n\n∆±±\n\nand\n\nlight neutrino mixing matrix [34℄, in luding the Dira\nit may be used to determine\na\n\nru ial\n\nVMNS\n\n∆±\n\nand Majorana phases, and in fa t\n\nfrom bran hing ratio measurements [92\u001594℄. Hen e,\n\nonsequen e of this relation is that the observability of s alar triplets strongly\n\ndepends on light neutrino mixing parameters. De ays\nvery\n\nlean, produ ing two energeti\n\nlose to\n\nde ays is determined by the\n\nM∆++ .\n\nOn the\n\nlike-sign\n\n∆±± → e± e± /μ± μ± /e± μ±\n\nare\n\nharged leptons with an invariant mass\n\nontrary, de ays to tau leptons are more di\u001e ult to identify and\n\nhave mu h larger ba kgrounds. Tau leptons\n\nan de ay leptoni ally\n\nτ → eν ν̄ , τ → μν ν̄\n\nwith a bran hing ratio around 17% ea h, giving ele trons and muons less energeti\n27\n\nthan\n\n\fthe parent\n\nτ.\n\nHadroni\n\nalways su\u001ber the\n(For example,\n\ntau de ays\n\nan only be tagged with a\n\nertain e\u001e ien y, and\n\nontamination from SM ba kgrounds with fake tau tags from jets.\n\norresponding to a\n\nτ\n\ntag e\u001e ien y of 50%, the fake rate is around 1%.)\n\nThe relevant quantity whi h determines the observability of\n\n∆±±\n\nis the bran hing ratio\n\nto ele trons and muons,\n\nreμ ≡ Br(∆±± → e± e± /μ± μ± /e± μ± ) .\n\n(57)\n\nFrom the point of view of the signal, ele trons and muons are quite alike, with similar\ndete tion e\u001e ien ies. From the point of view of SM ba kgrounds, at high transverse\nmomenta (su h as those involved in the de ay of\nsign diele tron and dimuon \u001cnal states are\n\n∆±±\n\nwith few hundreds of GeV) like-\n\nomparable, in\n\nontrast with the behaviour\n\nat lower transverse momenta, where diele trons are mu h more abundant [29℄. In our\nanalysis we will sum over \u001cnal states with ele trons and muons. A detailed examination\nof the relative number of ea h is\n\nru ial to re onstru t the MNS matrix [92\u001594℄ but\n\nhardly a\u001be ts the observability of doubly\n\nharged s alars.\n\nIn Fig. 6 we present the 67.3% CL allowed regions for\n\nreμ\n\nfor normal hierar hy\n\n(NH), inverted hierar hy (IH) and quasi-degenerate (QD) neutrino masses. In the \u001crst\nand se ond\n\nases we assume that the lightest neutrino is massless. The MNS mixing\n\nmatrix is parameterised as usual,\n\n\nc12 c13\ns12 c13\ns13 e−iδ\n\n\n=  −s12 c23 − c12 s23 s13 eiδ c12 c23 − s12 s23 s13 eiδ\ns23 c13 \ns12 s23 − c12 c23 s13 eiδ −c12 s23 − s12 c23 s13 eiδ c23 c13\n\n\nVMNS\n\n× diag (1, e−iβ2 /2 , e−iβ3 /2 ) .\n\n(58)\n\nWe use the best \u001ct values of mass di\u001beren es and mixing angles in Ref. [95℄ with the\nerrors quoted there, and for the unknown Majorana phases we assume a \u001dat probability.\nThe 67.3% CL regions are obtained with the a\nin detail in Ref. [96℄ for the program\non one phase or\n\nTopFit.\n\neptan e-reje tion method, as des ribed\nThe bands show the dependen e of\n\nreμ\n\nombination of phases, with the dependen e on the rest of parameters\n\ns13 , et .) re\u001de ted in the band width. For NH\ndi\u001beren e β2 − β3 but the variation is moderate. We\n\n(additional phases, the unknown value of\n\nreμ\n\nmainly depends on the phase\n\nobserve that the total bran hing ratio to ele trons and muons is modest, around 30%,\nand for\n\nβ2 − β3 = π\n\ndis over in this\nneutrinos\n\nreμ\n\nit\n\nan be as low as 5%, making the doubly\n\nase. For IH\n\nreμ\n\nharged s alars hard to\n\nis mu h larger, about 60%, depending on\n\ndepends on both phases and only the dependen e on\n\nstrongest) is shown. For this mass hierar hy\n\nreμ ∼ 0.45,\n\nβ2 − β3\n\nβ2 .\n\nFor QD\n\n(whi h is the\n\nbetween the values obtained\n\nfor NH and IH. For our simulations we sele t two ben hmark s enarios illustrating the\n28\n\n\f1.0\n\n1.0\n\nNH\n\nIH\n\n0.6\n\n0.6\n\nreμ\n\n0.8\n\nreμ\n\n0.8\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0\n\n0\n\n1\n\n0.5\n\n0\n\n2\n\n1.5\n\n(β2 − β3) / π\n\n0\n\n1\n\n0.5\n\n2\n\n1.5\n\nβ2 / π\n\n1.0\n\nQD\n0.8\n\nreμ\n\n0.6\n\n0.4\n\n0.2\n\n0\n\nFigure 6: Bran hing ratio\n\n0\n\nreμ\n\n1\n\n0.5\n\n2\n\n1.5\n\n(β2 − β3) / π\n\nto ele tron and muon \u001cnal states for normal and inverted\n\nhierar hy, and quasi-degenerate neutrinos.\n\ntwo extreme\n\ns13 = 0, β2 − β3 = π , for whi h reμ = 0.21;\nh reμ = 0.65. For squared mass di\u001beren es\n\nases: (i) NH with\n\ns13 = 0, β2 = β3 = 0,\nangles we take the\n\nfor whi\n\n(ii) IH with\nand mixing\n\nentral values in Ref. [95℄.\n\nIn the rest of this se tion we study the observability of the s alar triplets in several\n\u001cnal states, whi h we\n(a)\n\n+ + − −\n\nl l l l X;\n\n(b)\n\nlassify a\n\n± ± ∓\n\nl l l X;\n\nording to the number of harged leptons in the sample:\n( )\n\nl± l± X ;\n\n(d)\n\nl+ l− jτ X ;\n\n(e)\n\nl± jτ jτ jτ X ,\n\nwhere\n\nl\n\nonly\n\norresponds to ele trons and muons (but not ne essarily all with the same \u001davour),\n\nX refers to additional\n= M∆+ = 300 GeV.\n\ndenotes a jet tagged as a tau jet and\nassume a\n\nommon mass\n\nM∆++\n\njτ\n\njets, tagged or not. We\n\n5.1 Final state l+ l+ l− l−\nThis is a very good\n\nhannel for the observation of\n\npra ti ally absent SM ba kground.\n\n∆++ ∆−−\n\nprodu tion, be ause of its\n\nHowever, the s alar triplet signals in this de ay\n\nmode are smaller than in other \u001cnal states, be ause\n\n29\n\n\f1. Only\n\n∆++ ∆−−\n\nprodu tion\n\nontributes be ause\n\ntimes larger, gives at most three\n\nFour leptons\n\nwith a\n\nross se tion two\n\nharged leptons.\n\n2. For NH, requiring the presen e of four\nsignal.\n\n∆±± ∆∓ ,\n\nharged leptons signi\u001c antly redu es the\n\nan be produ ed (a) when both s alars de ay\n\n∆±± →\n\ne± e± , μ± μ± , e± μ± , whi h has a small total bran hing ratio ∼ (0.2)2 for NH, and;\n±±\n(b) in de ays ∆\n→ e± τ ± , μ± τ ± , τ ± τ ± , when the τ leptons de ay to ele trons\n\nand muons plus neutrinos, whi h happens with a bran hing ratio of 34%. Final\n\nstates with a smaller number of leptons have larger bran hing ratios, whi h also\nin lude\n\nombinatorial fa tors (see next subse tion).\n\n3. All four leptons have to be isolated, within the dete tor a\ntransverse momentum above a\ne\u001e ien y than in\n\neptan e and with\n\nertain threshold, leading to a lower dete tion\n\nhannels with a smaller number of leptons.\n\nAs pre-sele tion we require for signals and ba kgrounds the presen e of four isolated\nharged leptons, two positively and two negatively\n\nharged. Among the four leptons,\n\nat least two must have transverse momentum larger than 30 GeV. We also require\nthe absen e of additional non-isolated muons (from now on, this will be impli itly\nunderstood). For event sele tion we only ask that the event does not have two opposite\nharge pairs with an invariant mass\nlabelled as follows:\n\nl1\n\nloser to\n\nMZ\n\nthan 5 GeV. Charged leptons are\n\nis the one with highest transverse momentum,\n\nl2\n\nis the other\n\nl3 , l4 the remaining two leptons ordered by de reasing\npT . Then, neither the pairs (l1 , l3 ), (l2 , l4 ) nor (l1 , l4 ), (l2 , l3 ) an simultaneously have\n6\ninvariant mass within a 5 GeV interval around MZ . This requirement does not a\u001be t\nthe signal and is su\u001e ient to suppress ZZnj produ tion below the other ba kgrounds.\nThe remaining ba kgrounds, mainly tt̄nj , on entrate at lower invariant masses and are\nlepton with the same sign, and\n\nnot dangerous. The number of signal events and main ba kgrounds at the pre-sele tion\nand sele tion levels is\n\nolle ted in Table 4.\n\nThere are several interesting points to be learnt from the data in this table. For NH,\nthe \u001cnal number of events for four lepton signals at pre-sele tion is rather small, 34.9\nevents whi h\nis larger than\n\norrespond to only 7.4% of the\n\n2\nreμ\n= 4.6%\n\ndue to tau leptoni\n\n∆++ ∆−−\n\npairs produ ed. This fra tion\n\nde ays, whi h give additional four lepton\n\nevents but with a like-sign dilepton invariant mass smaller than\nbe\n\nlearly observed in Fig. 7 (left).\n\nThe peaks\n\n6A\n\norrespond to\n\nM∆++ .\n\n±±\n\n∆\n\nThis\n\nan\n\nde ays into two\n\nstronger ba kground suppression an be a hieved by demanding that neither of the opposite\nharge lepton pairs has an invariant mass onsistent with MZ , whi h eliminates Zbb̄nj and Ztt̄nj .\nThis slightly de reases the signal and leads to a smaller statisti al signi\u001c an e. Moreover, su h a ut\nwould suppress a possible fermion triplet signal in this hannel (see se tion 6.4).\n30\n\n\fPre-sele tion\n\nSele tion\n\n34.9\n\n34.9\n\n120.7\n\n120.7\n\n116.0\n\n115.7\n\n53.1\n\n53.1\n\n32.9\n\n31.5\n\n617.7\n\n98.7\n\n∆++ ∆−− (NH)\n∆++ ∆−− (IH)\ntt̄nj\nZbb̄nj\nZtt̄nj\nZZnj\n\nTable 4: Number of events for the four lepton signals and main ba kgrounds for a\nluminosity of 30 fb\n\n−1\n\n.\n60\n\n10\nl1 l2\n\n6\n\n4\n\n+ + − −\n\n2\n\n0\n\nl l l l (NH)\n\n0\n\n200\n\n100\n\nFigure 7:\n\nmll\n\n300\n\nl1 l2\n\n50\n\nl3 l4\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n8\n\n400\n\nl3 l4\n\n40\n30\n20\n+ + − −\n\nl l l l (IH)\n\n10\n0\n\n500\n\n0\n\n100\n\n200\n\nmll\n\n300\n\n400\n\n500\n\nKinemati al distribution at pre-sele tion of the two like-sign dilepton in-\n\nvariant masses for the NH (left) and IH (right) signals, assuming a luminosity of 30\n\n−1\nfb .\n\nele trons or muons, while the broad part of the distributions\nBy\n\nonstru tion, the\n\nl1 l2\n\npeak is higher be ause\n\nless energeti . The number of events where\n\n280 − 320\n\nGeV is 7.5,\n\nml1 l2\n\norresponding to only 1.6%\n\nout that the broad part of the\n\nmll\n\norrespond to\n\nharged leptons from\n\nτ\n\nτ\n\nde ays.\n\nde ays are\n\nml3 l4 are both in the windows\n++ −−\nof the ∆\n∆ pairs. We also point\nand\n\ndistributions behaves as\n\nombinatorial ba kground\n\nde reasing the height of the peak with respe t to the \u0010\u001dat\u0011 part. For IH the number of\nevents at pre-sele tion is four times larger than for NH, and the peaks are mu h more\npronoun ed, as it\nDis overing the\n\nM∆++\n\nan be observed in Fig. 7 (right).\n\n∆±± does not require to see both dilepton pairs with masses around\n\n(for whi h the number of events is mu h smaller), but on the\n\nto identify a\n\nlear peak in the\n\nml1 l2\n\nontrary it is enough\n\ndistribution, whi h is plotted in Fig. 8 for the SM\n\nba kgrounds only and for the SM ba kgrounds plus the NH signal (left) and the IH\nsignal (right). In both\n\nases the peaks are\n\nlearly visible, although for NH the number\n\n31\n\n\f70\n\n50\nSM bkg + ∆ (NH)\nSM bkg\n\n30\n\n20\n\n50\n40\n30\n20\n+ + − −\n\n+ + − −\n\n10\n\n0\n\nSM bkg + ∆ (IH)\nSM bkg\n\n60\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n40\n\nl l l l\n\n0\n\n200\n\n100\n\nml l\n\n300\n\n400\n\nl l l l\n\n10\n0\n\n500\n\n0\n\n100\n\n200\n\nFigure 8:\n\nl1 l2\n\nml l\n\n300\n\n400\n\n500\n\n12\n\n12\n\ninvariant mass distribution for the SM and the SM plus the s alar triplet\n\n−1\nases of NH (left) and IH (right). The luminosity is 30 fb .\n\nsignal in the\n\nof events at the peak is small even for 30 fb\n\n−1\n\n. In Table 5 we\n\nolle t the number of\n\nsignal and ba kground events at the peak, taken as the window\n\n280 < ml1 l2 < 320\n\nGeV ,\n\n(59)\n\nand making the two hypotheses for the ba kground normalisation mentioned in se tion 3:\n\n(a) The SM ba kground normalisation does not have any un ertainty, so that all the\nevent ex ess at the peak\n\nan be interpreted as signal.\n\n(b) The SM ba kground must be normalised dire tly from data, in whi h\npeak signal\n\nontributes as\n\nase the o\u001b-\n\nombinatorial ba kground, redu ing the signi\u001c an e of\n\nthe peak.\n\nThe situation in a real experiment will be between these two\nTable 5 the luminosity needed to have\nevent ex ess not\n10 signal (l\n\n5σ\n\nsigni\u001c an e, for whi h we require to have an\n\nompatible with a ba kground \u001du tuation at\n\n+ + − −\n\nl l l\n\n∆±±\n\n∆\n\nand to have at least\n\nan be established. We examine\n\nthe opening angle distribution, de\u001cned in terms of the angle\nof\n\n5σ ,\n\n) events.\n\nWe \u001cnally investigate if the s alar nature of\n\n++\n\nases. We also in lude in\n\nθ\n\nbetween the momenta\n\nand the estimated dire tion of the in oming quark (positive\n\nsystem moves in this dire tion or negative\n(CM) frame.\n\nz\n\notherwise) in the\n\nz\n\nif the\n\n∆++ ∆−−\n\n∆++ ∆−−\n\nentre of mass\n\nIn order to ensure a\n\norre t re onstru tion of this frame we require\n\nthat both dilepton pairs have a mass\n\nlose to the peak, between 280 and 320 GeV. The\n\ndependen e of the peak\n\nross se tion on the opening angle is presented in Fig. 9 for both\n\n32\n\n\fCase (a)\n\nCase (b)\n\nS\n\nB\n\nL\n\nS\n\nB\n\nNH\n\n20.4\n\n3.0\n\n−1\n14.7 fb\n\n18.1\n\n5.3\n\n18.6 fb\n\nIH\n\n110.4\n\n3.0\n\n107.3\n\n6.1\n\n2.8 fb\n\n2.7 fb\n\n−1\n\nL\n−1\n\n−1\n\nTable 5: Number of signal (S ) and ba kground (B ) events in the\nfb\n\n−1\n\nin\n\nL required\n\nases (a) and (b) explained in the text, and luminosity\n\ndis overy in the\n\n+ + − −\n\nl l l l\n\nml1 l2\n\npeak for 30\nto have a\n\n5σ\n\n\u001cnal state.\n\nNH and IH s enarios. We observe that the re onstru tion is very good even without\nintrodu ing\n\norre tion fun tions to a\n\nount for the dete tor e\u001be ts, and re\u001cnements\n\nsu h as using the Collins-Soper angle [97℄ are not ne essary either. The shape of the\ndistributions obtained, proportional to\n\n1 − cos2 θ,\n\norresponds to the produ tion of\n\ns alar parti les. However, the number of events at the peaks, whi h is 7.5 for NH and\n88.4 for IH with a luminosity of 30 fb\n\n−1\n\n, is too small to observe these distributions\n\nex ept for relatively large integrated luminosities. (In Fig. 9 the signal is simulated\nusing 3000 fb\n\n−1\n\n−1\n.) In Fig. 10 we show the possible results of an experiment with 30 fb .\n\nFor NH one has some hints pointing to a\nbe\n\n1 − cos2 θ\n\ndistribution, although nothing\n\nan\n\non luded with the small number of events observed. For IH the distribution seems\n\nsu\u001e iently good so as to establish the s alar nature of\n\n∆±± ,\n\nbut we do not address\n\nhere this issue quantitatively.\n0.10\n∆ (NH)\n∆ (IH)\n\nEvents (normalised)\n\n0.08\n\n0.06\n\n0.04\n\n0.02\n+ + − −\n\nl l l l\n0\n-1\n\nFigure 9: Normalised\n\n∆++\n\n-0.5\n\n0\n\ncos φ\n\n0.5\n\nopening angle distribution at the\n\nfor the four lepton signals.\n\n33\n\n1\n\nmll\n\npeaks for NH and IH,\n\n\f20\n\n4\n+ + − −\n\n+ + − −\n\n∆ (NH)\n\nl l l l\n\n-1\n\n15\n\nEvents for 30 fb\n\n-1\n\n3\n\nEvents for 30 fb\n\n∆ (IH)\n\nl l l l\n\n2\n\n10\n\n1\n\n5\n\n0\n-1\n\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\n\ncos θ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n0\n-1\n\n1\n\n-0.8\n\n∆++\n\nFigure 10: Possible experimental results for the\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\n\ncos θ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nopening angle distribution in the\n\nase of NH (left) and IH (right), for a luminosity of 30 fb\n\n−1\n\n. The number of events is\n\n8 and 88 for NH and IH, respe tively.\n\n5.2 Final state l± l± l∓\nThis \u001cnal state\n\nan be\n\nonsidered as the \u0010golden hannel\u0011 for s alar triplet dis overy. It\n\nhas very small SM ba kgrounds as the four lepton\nstru tion of the missing parti les\n\nhannel, and the kinemati al re on-\n\nan be a hieved. Moreover, an important advantage\n\nover the former is that three lepton \u001cnal states re eive\n\nontributions (whi h are a tu-\n\n∆±± ∆∓ produ tion, giving mu h larger signals and allowing for\n±±\nof ∆\n. For pre-sele tion we require two like-sign leptons l1 and\n\nally dominant) from\nan earlier dis overy\n\nl2\n\nwith transverse momentum larger than 30 GeV and an additional\n\nopposite\n\nharged lepton of\n\nharge. The number of events for the signal and main ba kgrounds is gath-\n\nered in Table 6. For sele tion we require that neither of the two opposite-sign lepton\npairs have an invariant mass\n\nloser to\n\nMZ\n\nthan 10 GeV. As expe ted, this requirement\n\nZ\n\nsigni\u001c antly redu es the ba kgrounds involving\n\nboson produ tion. The numbers of\n\nevents after sele tion are also listed in Table 6.\nComparing with the four lepton \u001cnal state we see that for NH the\n\n∆++ ∆−−\n\nis 2.5 times larger, mainly be ause of the larger bran hing ratios due to\nfa tors. The additional ontribution from\n\n±±\n\n∆\n\n∓\n\n∆\n\nombinatorial\n\nmakes the trilepton signal more than\n\n\u001cve times larger than the four lepton one in the previous subse tion. In the\nthe enhan ement is mainly due to the\n\n±±\n\n∆\n\n∓\n\n∆\n\nays give\n\nτ\n\nleptons, as it\n\n∆±± ∆∓\n\nare separated for\n\nontribution in whi h\n\nan be observed in the like-sign dilepton invariant mass\n\ndistribution, presented in Fig. 11 for both NH and IH. The\nand\n\nase of IH\n\npro ess, and gives a trilepton signal 3.5\n\ntimes larger than the four lepton one. The signals have a sizeable\n\n∆±± de\n\nsignal\n\nonvenien e.\n\nThe behaviour is\n\nto the one in Fig. 7 for the four lepton \u001cnal state.\n\n34\n\nontributions of\n\n∆++ ∆−−\n\nompletely analogous\n\nWe also point out that around\n\n\fPre-sele tion\n\nSele tion\n\n86.5\n\n79.2\n\n97.6\n\n89.9\n\n141.6\n\n133.2\n\n276.1\n\n260.8\n\n322.8\n\n212.2\n\n17.8\n\n12.2\n\n45.5\n\n35.1\n\n∆++ ∆−− (NH)\n∆±± ∆∓ (NH)\n∆++ ∆−− (IH)\n∆±± ∆∓ (IH)\ntt̄nj\ntW\nW tt̄nj\n\nPre-sele tion\n\nSele tion\n\n33.3\n\n2.0\n\n152.5\n\n16.8\n\n4113.8\n\n73.4\n\n276.1\n\n4.2\n\n22.7\n\n16.8\n\n42.7\n\n1.7\n\nZbb̄nj\nZtt̄nj\nW Znj\nZZnj\nW W W nj\nW W Znj\n\nTable 6: Number of events for the three-lepton signals and main ba kgrounds with a\nluminosity of 30 fb\n\n−1\n\n.\n\n40% of the total number of signal events (whi h in this\n\nase\n\norrespond to\n\nprodu tion) have jets in the \u001cnal state whi h are tagged as tau jets.\nplot the\n\nτ\n\nIn Fig. 12 we\n\nmultipli ity for the ba kground and the NH and IH signals at pre-sele tion\n\n(noti e that the trilepton signals\nappear due to mistags).\nis not\n\n∆++ ∆−−\n\nan have at most one tau jet, but a se ond one\n\nan\n\nAlthough the SM ba kgrounds rarely have tau leptons, it\n\nonvenient to ask for one\n\nτ\n\njet in event sele tion, sin e it de reases the signal\n\nonsiderably. On the other hand, separate analyses for ea h multipli ity\n\nNτ = 0, 1, 2\n\nan be performed in reasing the total sensitivity, but for brevity we do not present\nthem here.\n30\n\n150\n++ −−\n\n∆ ∆\n\nEvents / 10 GeV\n\n15\n10\n\n0\n\n0\n\n100\n\n50\n\n±\n\n± ±\n\nl l l (NH)\n100\n\n200\n\nml l\n\n300\n\n400\n\n± ±\n\n∆ ∆\n\n20\n\n5\n\n±±\n\n±\n\n±\n\n±±\n\n∆ ∆\n\n±\n\nEvents / 10 GeV\n\n++ −−\n\n∆ ∆\n\n25\n\nl l l (IH)\n0\n\n500\n\n0\n\n100\n\n200\n\n12\n\nml l\n\n300\n\n400\n\n500\n\n12\n\nFigure 11: Kinemati al distribution at pre-sele tion of the like-sign dilepton invariant\nmass for the\n\n∆++ ∆−− and ∆±± ∆∓ signals, for NH (left) and IH (right).\n\nThe luminosity\n\n−1\nis 30 fb .\n\nAfter event sele tion, trilepton SM ba kgrounds are almost four times larger than\nthose involving four leptons, but again they\nThe doubly\n\nharged s alars\n\nan be dis overed as a peak in\n35\n\nml1 l2 invariant masses.\nthe l1 l2 invariant mass,\n\non entrate at low\n\n\f1.0\nSM Bkg\n∆ (NH)\n∆ (IH)\n\nEvents (normalised)\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0\n\n0\n\n2\n\n1\n\n3\n\n4\n\n±\n\n± ±\n\nl l l\n\n5\n\nNτ\n\nFigure 12: Multipli ity of\n\nτ -tagged jets\n\nfor the SM ba kground and the NH, IH signals\n\nin trilepton \u001cnal states at pre-sele tion level.\n\nwhose distribution is plotted in Fig. 13 for the SM ba kgrounds only and for the SM\nba kgrounds plus the NH signal (left) and the IH signal (right) after event sele tion\nriteria.\n\nThe peaks are mu h more pronoun ed than in the four lepton \u001cnal state,\n\n60\n\n200\nSM bkg + ∆ (NH)\nSM bkg\n\n50\n\nSM bkg + ∆ (IH)\nSM bkg\n\nEvents / 10 GeV\n\n30\n20\n\n100\n\n50\n\n0\n\nl l l\n\n0\n\n200\n\n100\n\nml l\n\n300\n\n400\n\n± ±\n\n±\n\n± ±\n\n10\n\nl l l\n0\n\n500\n\n0\n\n100\n\n12\n\nFigure 13:\n\nl1 l2\n\n200\n\nml l\n\n300\n\n±\n\nEvents / 10 GeV\n\n150\n40\n\n400\n\n500\n\n12\n\ninvariant mass distribution for the SM and the SM plus the s alar\n\ntriplet signal in the\n\nases of NH (left) and IH (right). The luminosity is 30 fb\n\nmaking the dis overy of the\n\n∆±±\n\n−1\n\n.\n\nsignal in this \u001cnal state mu h easier. The number of\n\nsignal and ba kground events at the peak\n\n280 < ml1 l2 < 320\nis\n\nGeV\n\n(60)\n\nolle ted in Table 7, together with the luminosity ne essary for a\n\ndistinguish the two\n\nases: (a) if the SM ba kground\n\n5σ\n\ndis overy. We\n\nan be predi ted with negligible\n\nun ertainty and (b) if it is normalised from data. For NH the luminosity needed to\ndis over\n\n∆±±\n\nis\n\n4 − 5 times smaller than in the four lepton \u001cnal state,\n36\n\nand for IH three\n\n\ftimes smaller. This improvement is very signi\u001c ant, making the three lepton \u001cnal state\nthe best one for the dis overy of the doubly\n\nharged s alars at LHC.\n\nCase (a)\n\nCase (b)\n\nS\n\nB\n\nL\n\nNH\n\n94.5\n\n5.1\n\n3.2 fb\n\nIH\n\n353.0\n\n5.1\n\n0.85 fb\n\n−1\n−1\n\nS\n\nB\n\nL\n\n84.4\n\n15.2\n\n3.6 fb\n\n343.5\n\n14.4\n\n0.87 fb\n\nTable 7: Number of signal (S ) and ba kground (B ) events at the\nin\n\nases (a) and (b), and luminosity\n\nL\n\nneeded to have a\n\n5σ\n\n−1\n−1\n\nml1 l2\n\n−1\npeak for 30 fb\n\ndis overy in the\n\nl± l± l∓\n\n\u001cnal state.\nWe \u001cnally address the identi\u001c ation of the s alar nature of\n\n∆±± .\n\nThe re onstru tion\n\nof the \u001cnal state is more involved due to the presen e of two signal\n\nontributions with\n\ndi\u001berent kinemati s. Signal events involve two s alars, one of them (labelled as\nde ays to the like-sign pair and the other (labelled as\n\nl3\n\nplus an additional missed\n\nneutrino (if it is a\n\n±\n\n∆\n\nharged lepton or\n\nWe identify events\n\nthese\n\nriteria:\n\n1. If the event has a\n\norresponding to\n\nτ -tagged\n\njet\n\njτ ,\n\n2. If the event does not have\n\n∆\n\nregarded as\n\njet (if it is doubly\n\n−−\n\n∆\n\n∆++ ∆−−\n\nand\n\nharged) or a light\n\n∆±± ∆∓\n\nit is assumed that it\n\nprodu tion and it is re onstru ted a\n\ntaken as\n\nprodu es the third lepton\n\n). Both possibilities must be disentangled on an event by event\n\nbasis.\n\n++\n\nτ\n\n∆2 )\n\nprodu tion using\n\norresponds to\n\nτ -tagged\n\njets but has additional energeti\n\noming from a\n\nτ\n\nde ay, albeit not tagged) is larger than the missing\n\nevents are re onstru ted as follows. The third\n\nbeen dire tly produ ed in a\n\nτ\n\nde ay, in whi h\n\nmomentum\n\npν 1 ,\n\ntaken\n\njets, it is\n\nif the transverse momentum of the hardest jet (whi h is then\n\n∆±± ∆∓ .\n\n3. If the event does not have additional jets, it is re onstru ted as\n\nleptoni\n\n∆++ ∆−−\n\nordingly.\n\nenergy of the event. Otherwise the event is re onstru ted as\n\n∆++ ∆−−\n\n∆1 )\n\n±±\n\n∆\n\n∆±± ∆∓ .\n\nharged lepton\n\nde ay or may be a se ondary\n\nl3\n\nharged lepton from a\n\nase it is produ ed together with two neutrinos, of\n\nollinear to\n\npl 3 .\n\nmay have\n\nombined\n\nThe neutrino asso iated to the hadroni\n\nτ\n\npν2 ollinear to the jet. If the like-sign dilepton pair has an invariant\nthe M∆++ peak (a fa t whi h is enfor ed using a suitable kinemati al\n\nhas momentum\nmass\n\nlose to\n\nut), then all the missing energy of the event\n\n37\n\norresponds to these neutrinos, whose\n\n\fmomenta\n\npν1 = t1 pl3 , pν2 = t2 pjτ\n\nan be determined using the equations\n\nt1 (pl3 )x + t2 (pjτ )x = 6 px ,\nt1 (pl3 )y + t2 (pjτ )y = 6 py ,\n\nwhere\n\n6 px and 6 py\n\nare the two\n\n(61)\n\nomponents of the missing momentum\n\n6 pT .\n\nBoth t1 and t2\n\nmust be positive, otherwise the event is dis arded. The re onstru ted momenta of the\ntwo s alars are then\n\np∆ 1 = pl 1 + pl 2 ,\np∆ 2 = pl 3 + pj τ + pν 1 + pν 2 .\nRe onstru tion of events\nmomentum asso iated to\n\nl3\n\nlassi\u001ced as\n\n(62)\n\n∆±± ∆∓ is done negle\n\nting the possible missing\n\nand using the equations\n\n(pν2 )x = 6 px ,\n(pν2 )y = 6 py ,\n\n(pl3 + pν2 )2 = (pl1 + pl2 )2 ,\nplus the on-shell\n\nondition\n\np2ν2 = 0.\n\n(63)\n\nThe re onstru ted momenta of\n\n∆1\n\nand\n\n∆2\n\nare\n\np∆ 1 = pl 1 + pl 2 ,\np∆ 2 = pl 3 + pν 2 .\nThe quality of the re onstru tion is ensured by setting\n\n280\n\n(64)\nuts\n\n≤ ml1 l2 ≤ 320 GeV ,\nq\n280 GeV ≤ p2∆2 ≤ 320 GeV .\nWith these\n\nGeV\n\n(65)\n\nuts, the number of events at the peaks is 71.1 and 281.8 for the NH\n\nand IH signals, respe tively,\n\nlassi\u001ced as shown in Table 8.\n\nWe\n\nan observe that\n\nthe dis rimination method is good, although it may eventually be improved with a\nkinemati al \u001ct.\nThe opening angle\n\nθ\n\nis de\u001cned as the angle between the momentum of the\n\n∆++\n\n−−\n(∆\n) and the momentum of the initial quark (antiquark) in the CM frame. The latter\nis estimated as in the\n\nase of the four lepton signal in the previous subse tion, be ause\n\nthe improvement found using the Collins-Soper angle is very small.\n\nThe resulting\n\ndistribution is presented in Fig. 14 (left). The shape is similar to the \u0010true\u0011 one although\nthe extreme bins have a sizeable fra tion of events, and\n\n38\n\norre tion fun tions must be\n\n\fNH\n\n++\n\n∆\n\n−−\n\nIH\n\n±±\n\n∆\n\n∆\n\n++\n\n∓\n\n∆\n\n∆\n\n−−\n\n∆\n\n∆±± ∆∓\n\nTotal\n\n21.7\n\n49.4\n\n52.4\n\n229.4\n\n≥ 1 jτ\n1 j , pT > 6 pT\n1 j , pT < 6 pT\n0j\n\n4.5\n\n0.0\n\n7.4\n\n0.0\n\n2.6\n\n0.0\n\n6.6\n\n0.0\n\n7.6\n\n6.3\n\n11.7\n\n34.9\n\n7.0\n\n43.1\n\n26.7\n\n194.5\n\nTable 8: Number of signal events at the\n\nml1 l2\n\npeak for ea h of the\n\nlasses\n\nonsidered\n\nin the re onstru tion\n\nused in order to unfold the e\u001be t of the dete tor and re onstru tion (see for example\nRefs. [99, 100℄). Requiring the presen e of a tagged\n\nτ\n\njet redu es the signals to 4.5 and\n\n7.4 events for NH and IH, respe tively, but improves the quality of the re onstru tion.\nAs it\n\nan be observed in Fig. 14 (right), the distribution in this\n\nase is very similar to\n\nthe one found in the four lepton \u001cnal state, but in ludes a smaller number of events.\nPossible experimental results\n\norresponding to Fig. 14 (left) are shown in Fig. 15, taking\n\n−1\na luminosity of 30 fb . The distributions seem to indi ate that the\nproportional to\n\n2\n\n1 − cos θ,\n\nespe ially for the IH\n\nase, although the results must be\n\norre ted for dete tor e\u001be ts in order to draw a quantitative\n0.10\n∆ (NH)\n∆ (IH)\n\n0.08\n\nEvents (normalised)\n\nEvents (normalised)\n\n0.10\n\n0.06\n\n0.04\n\n0.02\n\n∆ (NH)\n∆ (IH)\n\n0.06\n\n0.04\n\n0.02\n\n-0.5\n\n0\n\n0.5\n\ncos θ\n\n± ±\n\n±\n\n± ±\n\nl l l\n0\n-1\n\non lusion.\n\n±\n\n0.08\n\nross se tion is\n\nl l l jτ\n0\n-1\n\n1\n\n-0.5\n\nFigure 14: Normalised opening angle distribution at the\n\nmll\n\n0\n\ncos θ\n\n1\n\n0.5\n\npeak for NH and IH. On\n\nthe right side we plot the same distribution but only for events with a tagged\n\nτ\n\njet.\n\nFinally, it is worth remarking that the presen e of re onstru ted trilepton events\nwith large missing energy is a signature of\nthe non-singlet nature of\n\n∆±± ∆∓\n\n∆.\n\n39\n\nprodu tion, providing eviden e of\n\n\f20\n\n60\n± ±\n\n∆ (NH)\n\n50\n\nl l l\n\n∆ (IH)\n\nEvents for 30 fb\n\n-1\n\n15\n\nEvents for 30 fb\n\n-1\n\n±\n\nl l l\n\n±\n\n± ±\n\n10\n\n40\n30\n20\n\n5\n10\n0\n-1\n\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\n\ncos θ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n0\n-1\n\n1\n\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\n\ncos θ\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nFigure 15: Possible experimental results for the opening angle distribution in the\nof NH (left) and IH (right), for a luminosity of 30 fb\n\n−1\n\n1\n\nase\n\n. The number of events is 71\n\nand 282 for NH and IH, respe tively.\n\n5.3 Final state l± l±\nS alar triplet produ tion gives like-sign dilepton signals when one doubly harged s alar\nde ays into two\n\nharged leptons while the a\n\nompanying s alar does into tau jets, neu-\n\ntrinos or harged leptons missed by the dete tor. Like-sign dilepton signals are\nto the three types of seesaw me hanism but in the\n\nase of the s alar triplet seesaw the\n\nlike-sign dilepton invariant mass spe trum exhibits a peak at\ndoubly\n\nharged s alars dire tly de ay to light\n\nommon\n\nM∆++ , produ\n\ned when the\n\nharged leptons (ele trons and muons).\n\nSM ba kgrounds in this\n\nhannel are larger than in the previous two modes, but the\n\nsignal signi\u001c an e is still\n\nomparable to the one a hieved in the four lepton\n\nhannel.\n\nFor event pre-sele tion we require two like-sign harged leptons l1 , l2 with transverse\nmomentum larger than 30 GeV and no additional leptons (otherwise events\nto the\n\nhannels studied in the previous se tions).\n\norrespond\n\nThe number of signal events are\n\nolle ted in Table 9, together with the main ba kgrounds. These pre-sele tion\nPre-sele tion\n\n∆++ ∆−− (NH)\n∆±± ∆∓ (NH)\n∆++ ∆−− (IH)\n∆±± ∆∓ (IH)\ntt̄nj\n\nPre-sele tion\n\nW tt̄nj\nW W nj\nW Znj\nW W W nj\n\n30.6\n72.2\n30.3\n97.4\n\nriteria\n\n194.0\n205.7\n892.2\n86.9\n\n1193.6\n\nTable 9: Number of events for the like-sign dilepton signals and main ba kgrounds for\n\n−1\na luminosity of 30 fb .\n\n40\n\n\fare su\u001e ient to observe the signals, and the improvement a hieved with further\n(e.g. requiring that the leptons are not ba k-to-ba k) is small. The\nfor the separate\n\n++\n\n∆\n\n−−\n\n∆\n\nand\n\n±±\n\n∆\n\n∓\n\n∆\n\nml1 l2\n\nuts\n\ndistribution\n\nsignals is presented in Fig. 16, for NH (left) and\n\nIH (right). The shape of the distributions is as in the two previous subse tions, but in\nthis\n\nase the\n\nombinatorial ba kground from\n\nτ\n\nde ays is less signi\u001c ant\n\nompared to\n\nthe SM ba kground. Like-sign dilepton signals from s alar triplet produ tion bene\u001ct\nfrom the presen e of\nthe sensitivity\nmultipli ity\n\nτ -tagged jets in the \u001cnal state, as it is shown in Fig. 17.\n\nTherefore,\n\nan be improved by splitting the like-sign dilepton sample by the\n\nNτ = 0, 1, 2\n\nτ\n\njet\n\nand performing an analysis for ea h subsample. For brevity\n\nwe do not present su h a study here.\n20\n\n50\n++ −−\n\n++ −−\n\n∆ ∆\n\n±\n\n∆ ∆\n\nEvents / 10 GeV\n\n15\n\nEvents / 10 GeV\n\n∆ ∆\n±±\n\n40\n\n10\n\n±\n\n±±\n\n∆ ∆\n\n30\n\n20\n\n5\n10\n\n± ±\n\nl l (NH)\n0\n\n0\n\n100\n\n200\n\nml l\n\n300\n\n400\n\n0\n\n500\n\n± ±\n\nl l (IH)\n0\n\n200\n\n100\n\n12\n\nml l\n\n300\n\n400\n\n500\n\n12\n\nFigure 16: Kinemati al distribution at pre-sele tion of the like-sign dilepton invariant\nmass for the\n\n∆++ ∆−−\n\nand\n\n∆±± ∆∓\n\nsignals, in NH (left) and IH (right). The luminosity\n\n−1\nis 30 fb .\n\n1.0\nSM Bkg\n∆ (NH)\n∆ (IH)\n\nEvents (normalised)\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n± ±\n\nl l\n0\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nNτ\n\nFigure 17: Multipli ity of\n\nτ -tagged jets\n\nfor the SM ba kground and the NH, IH signals\n\nin like-sign dilepton \u001cnal states at pre-sele tion level.\n\nIn this\n\nhannel SM ba kgrounds are mu h larger than the signals but, as it happens\n\n41\n\n\fwith trilepton and four lepton \u001cnal states, they\nmasses.\n\n±±\n\n∆\n\non entrate at low dilepton invariant\n\nHen e, even with the loose pre-sele tion\n\nresonan e\n\nuts used here, the presen e of a\n\nan be spotted with the examination of the\n\nml1 l2\n\ndistribution, shown\n\nin Fig. 18 for the SM ba kground alone and also in luding the NH and IH signals. The\n\n∆±±\n\npeaks are less pronoun ed than in the three and four lepton \u001cnal states. Despite\n\nthe larger ba kgrounds at the peak region\n\n280 < ml1 l2 < 320\n\nGeV\n\n(66)\n\n(see Table 10), the larger number of signal events provides a signal signi\u001c an e very\nsimilar to the one in the four lepton \u001cnal state, and the luminosities required for\ndis overy in both NH and IH s enarios, listed in Table 10, are\nfour lepton\n\nhannel. Nevertheless, a disadvantage of the\n\nfull event re onstru tion, with two\n\n± ±\n\nl l\n\n5σ\n\nomparable to the\n\n\u001cnal state is that the\n\nompeting signal pro esses and several missing\n\nparti les, is mu h more involved. The opening angle distribution obtained in this\n\nase\n\nis very distorted from the theoreti al value and a ba kground subtra tion must also be\nperformed. This study is beyond the s ope of the present work.\n300\n\n300\nSM bkg + ∆ (NH)\nSM bkg\n\n200\n150\n100\n± ±\n\nl l\n\n50\n0\n\n0\n\n200\n\n200\n150\n100\n± ±\n\nl l\n\n50\n0\n\n400\n\nml l\n\nSM bkg + ∆ (IH)\nSM bkg\n\n250\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n250\n\n0\n\n200\n\n12\n\nFigure 18:\n\nl1 l2\n\nsignal in the\n\n400\n\nml l\n\n12\n\ninvariant mass distribution for the SM and the SM plus the triplet\n\nases of NH (left) and IH (right). The luminosity is 30 fb\n\nCase (a)\n\nB\n\nNH\n\n56.5\n\n51.7\n\n15 fb\n\nIH\n\n114.3\n\n51.7\n\n4.4 fb\n\nL\n\nS\n\nB\n\nL\n\n−1\n\n53.4\n\n54.7\n\n17.4 fb\n\n−1\n\n114.3\n\n51.7\n\n4.4 fb\n\n−1\n\n−1\n\nTable 10: Number of signal (S ) and ba kground (B ) events at the\n\nL\n\n.\n\nCase (b)\n\nS\n\n−1\nfb\nand luminosity\n\n−1\n\nrequired to have a\n\n5σ\n\n42\n\ndis overy in the\n\n± ±\n\nl l\n\nml1 l2\n\npeak for 30\n\n\u001cnal state.\n\n\f5.4 Final state l+ l− jτ\nOpposite-sign dilepton ba kgrounds are huge at LHC, mainly\n\n∗\n\n∗\n\nZ /γ nj\n\ntt̄nj\n\noming from\n\nprodu tion, and make the observation of s alar triplet signals in the\n\nτ\n\nhannel virtually impossible. However, the requirement of an energeti\nis often present in the signals (ex ept in\n\n+\n\n−\n\n∆ ∆\n\nand\n\n+ −\n\nl l\n\njet, whi h\n\n) makes the ba kgrounds manageable.\n\nThe main obje tive of the study in this se tion is to show that s alar triplet signals are\nobservable in this di\u001e ult\n\nhannel too. A likelihood analysis taking advantage of the\n\ndi\u001beren es in the kinemati al distributions of signals and ba kgrounds will\n\nertainly\n\nimprove the results. We sele t the events with:\n\n(i) two oppositely\n\nharged leptons with invariant mass larger than 200 GeV, and no\n\nadditional leptons;\n(ii) at least one jet tagged as\n\nτ\n\njet, with transverse momentum larger than 20 GeV;\n\n(iii) not more than 2 additional untagged jets with\n\npT > 20\n\nGeV, and no\n\nb-tagged\n\njets.\n\nFor the s alar triplet signals the two\n\nharged leptons have a very broad invariant mass\n\ndistribution be ause they are produ ed in the de ay of di\u001berent parti les. The jet\nand one of the\n\nharged leptons (typi ally, the most energeti\n\nmass distribution whi h\nsignal\n\njτ\n\none) have an invariant\n\nM∆++ and below. Thus, the presen e of the\nin the ml1 jτ distribution. Nevertheless, the mass\nause of the missing energy from the τ de ay, and\n\non entrates at\n\nan be dete ted as a bump\n\nre onstru tion is not very good be\n\nwe will skip its presentation here. A better dis riminating variable is the transverse\nmomentum of the leading\n\nharged lepton\n\non e that SM ba kgrounds are\n\nplT1 ,\n\nwhose distribution exhibits a long tail\n\nonveniently redu ed.\n\nThe kinemati al\n\nuts applied\n\nwith this purpose are:\n\n(i) the missing energy\n(ii) at least one of the\n(iii) the angle\nthan\n\nφ\n\n6 pT\n\nmust be larger than 50 GeV;\n\nτ -tagged\n\nbetween the two\n\npT > 50\n\nGeV;\n\nharged leptons in transverse plane has to be larger\n\nπ/2.\n\nThe \u001crst requirement eliminates\ninvolve\n\njets must have transverse momentum\n\nharged leptons from\n\nW\n\nZ ∗ /γ ∗ nj\n\nprodu tion.\n\nde ays, so the number of\n\nThe remaining ba kgrounds\n\ne+ e− , μ+ μ− , e+ μ−\n\nand\n\nμ+ e−\n\nevents is similar. The number of signal and ba kground events at the pre-sele tion and\nsele tion levels\n\nan be read in Table 11.\n43\n\n\fPre-sele tion\n\nSele tion\n\n26.4\n\n16.2\n\n38.1\n\n28.3\n\n12.3\n\n6.6\n\n27.3\n\n19.5\n\n∆++ ∆−− (NH)\n∆±± ∆∓ (NH)\n∆++ ∆−− (IH)\n∆±± ∆∓ (IH)\n\nSele tion\n\n486.0\n\n55.2\n\n98.4\n\n9.0\n\n216.9\n\n7.0\n\n2424.5\n\n0.7\n\ntt̄nj\ntW\nW W nj\nZ ∗ /γ ∗ nj\n\nl+ l− jτ\n\nTable 11: Number of events for the\n\nPre-sele tion\n\nsignals and main ba kgrounds for a lumi-\n\n−1\nnosity of 30 fb .\n\nThe\n\nontribution of s alar triplets to the\n\nl+ l− jτ\n\n\u001cnal state\n\ntail in the transverse momentum distribution for the leading\nin Fig. 19 for the\n\nases of NH and IH. The signal\n\nan be dete ted as a long\nharged lepton, presented\n\nontributions are spread a ross a wide\n\nplT1 range, and normalising the SM ba kground seems non-trivial. In order to estimate\nthe signal signi\u001c an e in this hannel we assume a 20% un ertainty in the ba kgrounds,\nin orporated in the\n\nal ulation of the statisti al signi\u001c an e. Requiring\n\nplT1 > 200\n\nGeV\n\n(67)\n\nthe number of ba kground events is 10.1, while most of the signal survives, 34.4 events\nfor NH and 20.2 for IH, giving signi\u001c an es\n\nS20 = 5.3σ\n\n(IH).\n\nS0 = 10.6σ , S20 = 9.0σ (NH) and S0 = 6.2σ ,\n\n20\n\n20\nSM bkg + ∆ (NH)\nSM bkg\n\nSM bkg + ∆ (IH)\nSM bkg\n15\n\nEvents / 20 GeV\n\nEvents / 20 GeV\n\n15\n\n10\n\n5\n\n10\n\n5\n\n+ −\n\n+ −\n\nl l jτ\n0\n\n0\n\n100\n\n200\n\n300\n\n400\n\nl l jτ\n0\n\n500\n\n0\n\n100\n\nl\n\nFigure 19:\n\nplT1\n\n200\n\n300\n\n400\n\n500\n\nl\n\npT1\n\npT1\n\ndistributions for the SM and the SM plus the triplet signal in the\n\nof NH (left) and IH (right). The luminosity is 30 fb\n\n−1\n\nases\n\n.\n\n5.5 Final state l± jτ jτ jτ\nThe huge\n\nross se tion for\n\nW nj\n\nin \u001cnal states with only one\n\nprodu tion makes the signals in Eq. (52) unobservable\n\nharged lepton. In order to redu e this and the rest of\n44\n\n\fba kgrounds we require three tagged\nGeV, in addition to a\nluminosity of 30 fb\n\n−1\n\nτ\n\njets with transverse momentum larger than 20\n\nharged lepton with\n\npT > 30\n\nGeV. The number of events for a\n\nis gathered in Table 12 for the most relevant pro esses. It is\n\nthat even requiring three\n\nτ\n\nlear\n\n∼ 10−6 ,\n\njets, whi h imply a ba kground reje tion fa tor\n\nnot enough to make the signals observable.\n\nis\n\nPre-sele tion\n\n∆++ ∆−− (NH)\n∆±± ∆∓ (NH)\n∆++ ∆−− (IH)\n∆±± ∆∓ (IH)\ntt̄nj\nbb̄nj\nW nj\nTable 12: Number of events for the\n\n3.0\n0.3\n0.5\n0.1\n3069.8\n1200\n72740\n\nl± jτ jτ jτ\n\nsignals and main ba kgrounds for a lumi-\n\n−1\nnosity of 30 fb .\n\n5.6 Outlook\nIn this se tion we have examined the s alar triplet signals in the\nsu h that triplet de ays are dominated by the leptoni\nbeen di\u001berent from re ent studies [35, 36℄. Instead of\nprodu ed (e.g. light\n\n∆\n\n∓\n\n∆\n\nprodu tion, although these two pro esses\n\nWe have devoted spe ial attention to\n\nτ\n\n∆\n\nlassi\u001ced them by the\n\nontributions from\n\n± ±\n\n→ l l\n\n∆++ ∆−−\n\nand\n\nan be separated to some extent\n\nl± l± l∓\n\nhannel.\n\nlepton de ays. Indeed, the invariant mass\n\ndistribution of like-sign dileptons resulting from\npeak from dire t\n\nOur approa h has\n\nlassifying signals by the parti les\n\nwith an adequate re onstru tion, as the one performed for the\n\n±±\n\nv∆ ,\n\nWe believe that the latter is more adequate be ause most\n\n\u001cnal states (ex ept the one with four leptons) re eive\n\n±±\n\nhannels.\n\nharged leptons, taus, neutrinos) we have\n\nsignatures a tually seen.\n\nase of small vev\n\n∆±±\n\nde ays has, in addition to a\n\nde ays, a broad bump originated when\n\n∆\n\ninto one or two taus, whi h subsequently de ay leptoni ally. This bump\na \u0010 ombinatorial ba kground\u0011, whi h in the\n\nleanest\n\n+ + − −\n\nl l l l\n\nand\n\n± ± ∓\n\nl l l\n\n±±\n\nlear\n\nde ays\n\nonstitutes\nhannels is\n\na tually larger than the SM ba kground and de reases the relative height of the peaks.\n\n7\n\nIf the SM trilepton and four lepton ba kgrounds have to be normalised with data, then\n7 This\n\nis a pessimisti hypothesis, but perhaps it will be the ase in the \u001crst months of LHC running,\nwhen a 300 GeV s alar triplet would be dis overed.\n45\n\n\fthis\n\nombinatorial ba kground de reases the observability of the s alar triplet signals.\n\nThe e\u001be t is not very dramati , however.\nComparing the several\nthat the trilepton\n\n5σ\n\nhannels with two, three and four leptons we have\n\non luded\n\nhannel is by far the best one for both NH and IH, and\n\nould give\n\neviden e of doubly\n\nharged s alars with a luminosity \u001cve (for NH) or three (for\n\nIH) times smaller than the one required in the four lepton\nonly to the additional\n\nontribution of\n\nlarger bran hing ratio in\n\n++\n\n∆\n\n−−\n\n∆\n\n∆\n\nτ\n\n∓\n\n∆\n\nhannel. This is due not\n\nto trilepton \u001cnal states but also to the\n\nprodu tion. The like-sign dilepton and four lepton\n\nhannels have similar sensitivities. The\nand a tagged\n\n±±\n\nhannel with an opposite\n\njet is more di\u001e ult, although positive signals\n\nharge lepton pair\n\nan be observed in the tail\n\nof the leading lepton momentum distribution. Channels with only one\n\nharged lepton\n\nsu\u001ber from huge ba kgrounds and triplet signals are unobservable.\nFinally, we have addressed the identi\u001c ation of the s alar nature of the\nhave examined the opening angle distribution in the three and four lepton\n\n∆±± .\n\nhannels,\n\n\u001cnding that the dete tor e\u001be ts do not alter signi\u001c antly the distributions (whi h\nbe eventually\n\norre ted, anyway) and they are\n\n0 parti le. In the\n\n± ± ∓\n\nl l l\n\nmissing energy indi ates\nnature of\n\n6\n\nWe\n\nan\n\nompatible with the hypotesis of a spin\n\n\u001cnal state, the presen e of re onstru ted events with large\n\n∆±± ∆∓\n\nprodu tion, thus giving eviden e of the non-singlet\n\n∆.\n\nSeesaw III signals\n\nThe harged and neutral members of the fermion triplet an be produ ed in the partoni\npro esses\n\nq q̄ → Z ∗ / γ ∗ → E + E − ,\n\nq q̄ ′ → W ∗ → E ± N .\nNeutral lepton pairs are not produ ed be ause\ndo not\n\nE, N\n\nouple to the\n\nZ\n\nboson.\n\n8\n\nN\n\nThe produ tion\n\n(68)\nhas\n\nT3 = 0, Y = 0\n\nand thus they\n\nross se tion only depends on the\n\nmasses, sin e the triplet intera tions are \u001cxed by the gauge symmetry.\n\nThe\n\ntriplet splitting is expe ted to be very small, and the mass di\u001beren es are irrelevant for\nprodu tion. The dependen e of the\n\nmΣ\n\nross se tions on the\n\nis represented in Fig. 20.\n\n8 Similar\n\nommon mass\n\nmE = mN ≡\n\nanalyses an be performed to investigate the dis overy prospe ts for heavy leptons transforming as ele troweak doublets and harged singlets [98℄.\n\n46\n\n\f10\n10\n\n5\n\n±\n\n4\n\nE N\n+\n\nE E\n\nσ (fb)\n\n10\n10\n\n−\n\n3\n\n2\n\n10\n1\n-1\n\n10 100\n\n200\n\n300\n\n400\n\n500\n\n700\n\n600\n\n800\n\n900\n\n1000\n\nmΣ (GeV)\n\nFigure 20: Cross se tion for produ tion of heavy lepton pairs\n\nEx ept for tiny mixings\n\nVlN ∼ 10−8 , the new heavy leptons de\n\nto SM leptons plus a gauge or Higgs boson.\nassumed here\n\nE ±N , E +E −\n\nmE,N = 300 GeV the bran\n\nat LHC.\n\nay almost ex lusively\n\n(For mixings of this size and the mass\n\nhing ratios to de ays between triplet members,\n\nallowed by the small mass splitting, are below 10% [37℄.)\n\nThe partial widths for\n\nE\n\nde ays are\n\ng2\nm3\nΓ(E → ν̄W ) =\n|VlN |2 E2\n32π\nMW\n\n\u0012\n\u0013\u0012\n\u0013\n2\n2\n4\nMW\nMW\nMW\n1− 2\n1+ 2 −2 4\n,\nmE\nmE\nmE\n\u0012\n\u0013\u0012\n\u0013\n3\nMZ2\nMZ2\nMZ4\ng2\n2 mE\n+\n+\n|VlN |\n1− 2\n1+ 2 −2 4 ,\nΓ(E → l Z) =\n64πc2W\nMZ2\nmE\nmE\nmE\n\u0012\n\u00132\n3\nMH2\ng2\n2 mE\n+\n+\n|VlN |\n1− 2\n,\nΓ(E → l H) =\n2\n64π\nMW\nmE\n+\n\n+\n\nwhile the widths for\n\nN\n\nde ays are the same as for the heavy neutrino singlet in Eqs. (48).\n\nThe total bran hing ratios for the\n\nW, Z\n\nand\n\nH\n\nmodes, summing over light\n\nlepton and neutrino spe ies, do not depend on the value of the mixings\non the heavy masses\n\nmE,N .\n\nVlN\n\nThe observability of the new states\n\nenergeti\n\nharged\nbut only\n\nThe partial widths to di\u001berent \u001davours are in the ratios\n\nΓ(E + → ν̄l1 W + )\nΓ(E + → l1 Z)\nΓ(E + → l1 H)\n|Vl1 N |2\n=\n=\n=\n.\nΓ(E + → ν̄l2 W + )\nΓ(E + → l2 Z)\nΓ(E + → l2 H)\n|Vl2 N |2\nleptons. A triplet\n\n(69)\n\nE, N\n\nstrongly depends on their\n\n(70)\n\noupling to the SM\n\noupling to the ele tron and/or muon leads to \u001cnal states with very\n\nele trons and/or muons, whi h give\n\nlean signals. Sin e at high transverse\n\nmomenta the ba kgrounds involving ele trons and muons have roughly the same size,\nthe observability of the new signals is similar in these\ntriplet\n\noupling to the third generation gives\n\nτ\n\nases.\n\nOn the other hand, a\n\nleptons as de ay produ ts, whi h are\n\nmu h more di\u001e ult to observe. We will then sele t two s enarios for our analysis. In\n\n47\n\n\fs enario T1 we assume that\n\ne, νe\n\nE\n\nand\n\nN\n\nonly\n\nouple to\n\n(e, νe ),\n\nso that their de ays give\n\nin the \u001cnal states. As we have argued, the observability in\n\nase that\n\nE, N\n\nouple\n\nto the se ond generation as well (or only to it) is similar. S enario T2 assumes that\n\nN\n\nonly\n\nouple to\n\nEven with\n\n(τ, ντ ),\n\nE, N\n\nand it is the most pessimisti\n\nE,\n\none.\n\noupling to one lepton \u001davour, there is a plethora of possible \u001cnal\n\nE +E −\n\nE ±N\n\nprodu tion, given by the several de ay possi-\n\nbilities of ea h heavy lepton. They are\n\nolle ted in Table 13, not in luding the de ay\n\nstates resulting from\n\nof the\n\nW, Z\n\nand\n\nH\n\nbosons. These de ay\n\nE − → νW − (0.54)\nE − → l− Z (0.27)\nE − → l− H (0.19)\n\nl− ν̄W + W + (0.14)\nl+ ν̄W + W − (0.14)\nν ν̄ZW + (0.15)\nν ν̄HW + (0.10)\n\nTable 13: Final states for\n\nwhi h\n\nmE,N = 300\n\nan be\n\nhannels lead to many \u001cnal state signatures\n\nE + → ν̄W + (0.54) E + → l+ Z (0.27) E + → l+ H (0.19)\nν ν̄W + W − (0.29)\nl+ νZW − (0.15)\nl+ νHW − (0.10)\nl− ν̄ZW + (0.15)\nl+ l− ZZ (0.07)\nl+ l− ZH (0.05)\nl− ν̄HW + (0.10)\nl+ l− ZH (0.05)\nl+ l− HH (0.04)\n\nN → l− W + (0.27)\nN → l+ W − (0.27)\nN → νZ (0.27)\nN → νH (0.19)\n\ning ratio for\n\nand\n\nE +E −\n\nand\n\nE +N\n\nl+ l− ZW + (0.07)\nl+ l+ ZW − (0.07)\nl+ νZZ (0.07)\nl+ νZH (0.05)\n\nl+ l− HW + (0.05)\nl+ l+ HW − (0.05)\nl+ νZH (0.05)\nl+ νHH (0.04)\n\nprodu tion, with their approximate bran h-\n\nGeV.\n\nonveniently\n\nlassi\u001ced by their\n\nanalysis must take into a\n\nount all possible\n\nharged lepton multipli ity. A realisti\nontributions to a given signal. Indeed,\n\nin our analysis we \u001cnd that for most \u001cnal states there are several possible\nontributions from di\u001berent de ay\nton multipli ity re eive\n\nhains. Additionally, \u001cnal states with smaller lep-\n\nontributions from \u001cnal states with more leptons when one or\n\nmore are missed by the dete tor. In our study we\nby\n\nTriada\n\nompeting\n\nonsider all de ay\n\nhannels generated\n\nand passed through a parton shower Monte Carlo and a dete tor simula-\n\nl± l± l± l∓ X ;\nl+ l− jjjjX ; (i) l± jjjjX .\n\ntion. The \u001cnal states studied are: (a) six leptons; (b) \u001cve leptons; ( )\n\n(d)\n\nl+ l+ l− l− X ;\n\n(e)\n\nAs\n\nbefore, the\n\nharged leptons\n\nl± l± l± X ;\n\nl± l± l∓ X ; (g) l± l± X ; (h)\nare l = e, μ, in luding all \u001davour\n\n(f )\n\nombinations. Signals\n\nwith four like-sign leptons are in prin iple possible but they are found to be negligible.\n\n48\n\n\fWe take a\n\nommon mass\n\nmE,N = 300\n\nGeV, for whi h the de ay bran hing ratios are\n\nBr(E + → ν̄W + ) = 0.537 ,\nBr(E + → l+ Z) = 0.271 ,\n\nBr(E + → l+ H) = 0.192 ,\n\nBr(N → l− W + ) = Br(N → l+ W − ) = 0.269 ,\nBr(N → νZ) = 0.271 ,\n\nBr(N → νH) = 0.192 .\n\n(71)\n\nWe give results for both s enarios T1 and T2, summing ba kgrounds with ele trons\nand muons.\n\n6.1 Six lepton \u001cnal states\nThese \u001cnal states are the\n\u001cnal states\n\nleanest ones but the signal\n\nan only be produ ed in the\n\nE + E − → l+ Z l− Z ,\nE +E −\n\nhannel\n\nZ → l+ l−\n\nThe overall bran hing ratio is\nan\n\nal ulated for\n\nross se tion of 160 fb, this\n\nZ→τ τ\n\nwith the subsequent\n\nτ\n\n(Br = 3.5 × 10−4 ) .\n\nmE = 300 GeV\n\nleptoni\n\nontributions are also present from\n\nharged leptons, at least two of them\n\nhaving transverse momentum larger than 30 GeV and all of them with\n\npT > 10\n\nevents survive these sele tion\n\nde ay. For\n\nde ay.\n\nWe require for event sele tion six isolated\n\n(if they are ele trons) and\n\nZ\n\nand in ludes\n\n(72)\n\n−1\norresponds to 1.7 events in 30 fb , further\n\nredu ed by dete tion e\u001e ien ies. Minor additional\n\n+ −\n\nross se tions are tiny. Six lepton\n\nGeV (if they are muons).\n\npT > 15\n\nGeV\n\nNo SM ba kground\n\nriteria, while 0.6 signal events are found in s enario T1\n\nand 0.1 events in s enario T2. Therefore, this \u001cnal state is only relevant for very high\nintegrated luminosities, well above 300 fb\n\n−1\n\n.\n\n6.2 Five lepton \u001cnal states\nFermion triplet produ tion\n\nE + N → l+ Z l± W ∓ ,\n\nE + N → l+ Z νZ ,\nand similarly for\nto\n\nτ\n\nE −N\n\nan give \u001cve lepton \u001cnal states in several de ay\n\nZ → l+ l− , W → lν\n\nZ → l+ l−\n\nprodu tion. Small additional\n\nleptons are also present. Additionally, \u001cve leptons\n49\n\nhannels,\n\n(Br = 2.2 × 10−3 ) ,\n\n(Br = 3.5 × 10−4 ) ,\nontributions from\n\nW, Z\n\nan be produ ed in the\n\n(73)\nde ay\nhannel\n\n\fof Eq. (72) when a lepton is missed by the dete tor. Clearly, this is a general feature:\n\u001cnal states in whi h a given number of leptons are produ ed\n\nontribute to \u001cnal states\n\nwith a smaller lepton multipli ity when one or more of them are missed by the dete tor.\nFive lepton signals have bran hing ratios 7 times larger than six lepton signals, and so\nthey are expe ted to be more signi\u001c ant, be ause they still have tiny ba kgrounds.\nFor event sele tion we require, analogously to the previous\n\nase, \u001cve harged leptons,\n\nat least two of them having transverse momentum larger than 30 GeV and all of them\nwith\n\npT > 15\n\nGeV (for ele trons) and\n\nsignal and ba kground events is\nsele tion\n\npT > 10\n\nGeV (for muons).\n\nThe number of\n\nolle ted in Table 14. We do not set any additional\n\nriteria, sin e the ba kground is su\u001e iently small. For the s enario T1,\n\ndis overy\n\nan be rea hed with 28 fb\n\nbe observed even with 300 fb\n\n−1\n\n−1\n\n5σ\n\n, while for s enario T2 the signal is too small to\n\n. It is important to remark that neither neutrino singlet\n\nnor s alar triplet produ tion produ e \u001cve lepton \u001cnal states, so this mode\n\nan signal\n\nfermion triplet produ tion, although only for relatively large luminosities.\nSele tion\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\n\nSele tion\n\ntt̄nj\nW ZZnj\nZZZnj\n\n0.9\n9.7\n0.3\n\n0.1\n0.7\n0.1\n\n1.2\n\nTable 14: Number of events for the \u001cve lepton signals and main ba kgrounds for a\nluminosity of 30 fb\n\n−1\n\n.\n\n6.3 Final state l± l± l± l∓\nThe\n\nE ±N\n\nprodu tion pro ess with de ay\n\nE + N → l+ Z l+ W − ,\n(and its\n\nharge\n\nonjugate)\n\nZ → l+ l− , W → q q̄ ′\n\n\u001cve times smaller arises from\nleptoni ally. The\nso it\n\nl l l l\n\nonstitutes a very\n\n(74)\n\nan produ e this interesting \u001cnal state with three like-sign\n\nleptons and a fourth one of opposite sign. An additional\n\n± ± ± ∓\n\n(Br = 3.4 × 10−3) ,\n\n−\n\nN →l W\n\n\u001cnal state\n\nhara teristi\n\ntionally, this \u001cnal state provides a\n\n+\n\nwhen\n\nl\n\n−\n\nontribution approximately\n\nis missed and the\n\nW\n\nboson de ays\n\nannot be produ ed in seesaw I and II s enarios,\n\nsignature for fermion triplet produ tion. Addi-\n\nlean measurement of the heavy\n\nshow in this subse tion.\n\n50\n\nE\n\nmass, as we will\n\n\fSignal and ba kground events are sele ted by requiring four isolated harged leptons\nwith a total\n\nharge of\n\nWe do not apply veto\n\n±2,\n\ntwo of them with transverse momentum larger than 30 GeV.\n\nZ\n\nboson de ays. The number of signal and ba kground events\n\nuts on the invariant mass of opposite\n\nthe signal itself involves\n\nful\u001clling these requirements is\n\nolle ted in Table 15.\n\nharge lepton pairs, sin e\n\nThe SM ba kground is small\n\nenough so as to allow the observation of the signal (in s enario T1) by the analysis of\nkinemati al distributions, and further kinemati al\n\nuts are not ne essary.\n\nPre-sele tion\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\n\nluminosity of 30 fb\n\ntt̄nj\nZbb̄nj\nZtt̄nj\n\n0.7\n24.2\n0.4\n\n26.7\n18.8\n3.5\n\n4.5\n\nTable 15: Number of events for the\n\n−1\n\nPre-sele tion\n\nl± l± l± l∓\n\nsignals and main ba kgrounds with a\n\n.\n\nThere are several kinemati al distributions in whi h the presen e of the fermion\ntriplet signals may manifest. Among these, the mass re onstru tion of the heavy states\ndeserves spe ial attention. We follow a pro edure adapted for the\nwhi h gives the main\n\n1. First, the two\n\nontribution to the signal:\n\nharged leptons\n\noming from the\n\nZ\n\nboson de ay are identi\u001ced,\n\nsele ting among the three possibilities the opposite sign pair\ninvariant mass\n\nlosest to\n\ntails in this distribution\n\nMZ .\n\nThe re onstru ted\n\n−\nl+\na lb ld ,\nE mass mre\nE\nand\n\nlarity.\n\nharged lepton mass\n\nan determine whi h leptons are its de ay produ ts\n\n−\nl+\na lb lc\n\nwhi h has an\n\naused by signal hannels di\u001berent from that in Eq. (74).\n\n2. Assuming for the moment that the true heavy\n\npossibilities\n\n−\nl+\na lb\n\nAs the plot in Fig. 21 (left) shows, there are long\n\nThe ba kground has not been in luded in this plot for\n\nwe\n\nhannel in Eq. (74),\n\nmE\n\nis known,\n\nhoosing between the two\n\nthe one giving an invariant mass\n\nlosest to\n\nis then the three-lepton invariant mass.\n\nmE .\nThis\n\ndistribution is presented in Fig. 21 (right) for the signal alone, in order to see\nhow the re onstru tion pro edure works.\n\nThe re onstru ted\n\nE\n\nmass distribution is presented in Fig. 22 (left) for the SM\n\nba kground and the ba kground plus the heavy triplet signal in s enario T1 (in s enario\nT2 the peak is unobservable, as shown in Fig. 21). We noti e that the ba kground is\nnot signi\u001c antly biased by the sele tion of the\n51\n\nharged lepton giving\n\nmre\nE\n\nlosest to\n\n\f10\n\nEvents / 10 GeV\n\n5\n\n± ± ±\n\nl l l l\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\nml + l −\n\n120\n\n140\n\n160\n\n180\n\nΣ (T1)\nΣ (T2)\n\n8\n\n6\n\n4\n\n± ± ±\n\n2\n\n±\n\nEvents / 5 GeV\n\nΣ (T1)\nΣ (T2)\n\n0\n\n200\n\nl l l l\n\n0\n\n100\n\n200\n\n−\nl+\na lb\n\n400\n\n500\n\ninvariant mass distribution for the fermion triplet signal in the\n\ntwo s enarios T1 and T2.\nThe luminosity is 30 fb\n\nmE .\n\n300\n\nmE\n\na b\n\nFigure 21: Left:\n\nrec\n\n±\n\n10\n\n−1\n\nRight: re onstru ted\n\nE\n\nmass distribution (see the text).\n\n.\n\nmE ne essary for the re onstru tion an be found by plotting\n+ −\nthe invariant mass of la lb with ea h of the two remaining leptons, obtaining a plot\nThe input value of\n\nwith two entries per event shown in Fig. 22 (right). This plot displays a\nfrom whi h\n\nmE\n\nan be determined, although the low statisti s may\n\nlear peak\n\nompromise the\n\nN mass at this\n′\nin N → lW → lq q̄ ) in\n\ndetermination for low luminosities. Note that we do not re onstru t the\nstage be ause we do not require extra jets (whi h are produ ed\nevent pre-sele tion to keep the signal as large as possible.\n30\n\n15\n\nSM bkg + Σ (T1)\nSM bkg\n\n2 × Events / 10 GeV\n\n25\n\n10\n\n20\n15\n\n5\n\n10\n\nl l l l\n0\n\n0\n\n100\n\n200\n\nrec\n\n300\n\n±\n\n± ± ±\n\n400\n\n± ± ±\n\nl l l l\n\n5\n0\n\n500\n\n0\n\n100\n\nmE\n\nFigure 22: Left:\n\nmre\nE\n\nsignal in s enario T1.\nThe luminosity is 30 fb\n\n200\n\n300\n\nml + l − l , ml + l − l\na b c\n\n±\n\nEvents / 10 GeV\n\nSM bkg + Σ (T1)\nSM bkg\n\n400\n\n500\n\na b d\n\ndistribution for the SM and the SM plus the fermion triplet\nRight:\n\n−1\n\n−\nl+\na lb lc\n\n+\n\n−\nl+\na lb ld\n\ndistribution (two entries per event).\n\n.\n\nA more adequate variable for low statisti s is the mass distribution of the leading\nand sub-leading like-sign leptons, labelled as\nis a very good dis riminator, as it\n\nl1\n\nand\n\nl2 , respe\n\ntively. The variable\n\nml1 l2\n\nan be seen in Fig. 23. Sin e the signal almost always\n\n52\n\n\fhas two very energeti\n\nleptons, their invariant mass is large. The number of signal (in\n25\nSM bkg + Σ (T1)\nSM bkg\n\nEvents / 25 GeV\n\n15\n\n10\n\n± ± ±\n\n5\n\n0\n\nl l l l\n\n0\n\n100\n\n200\n\n300\n\n400\n\nml l\n\nSM bkg + Σ (T2)\nSM bkg\n\n20\n\n15\n\n10\n\n± ± ±\n\n5\n\n±\n\nEvents / 25 GeV\n\n20\n\n0\n\n600\n\n500\n\nl l l l\n\n0\n\n100\n\n200\n\nml l\n\n12\n\nFigure 23:\n\nl1 l2\n\n300\n\n±\n\n25\n\n400\n\n500\n\n12\n\ninvariant mass distribution for the SM and the SM plus the fermion\n\n−1\ntriplet signal in the s enarios T1 (left) and T2 (right). The luminosity is 30 fb .\n\ns enario T1) and ba kground events when\nmass or in\n\nml1 l2\n\nare\n\nuts are applied on the re onstru ted\n\nolle ted in Table 16. In the \u001crst\n\nase, we sele t a 20 GeV interval\n\nml1 l2 > 150\n\naround the peak, and in the se ond we require\n\nE\n\nGeV. We assume that\n\n(a) the SM ba kground is perfe tly known, and (b) it is normalised from data (for\n\nml1 l2\n\nwe use the region\n\nml1 l2 < 150).\n\nThe luminosity needed for\n\n5σ\n\ndis overy is also\n\ngiven. For the s enario T2, the event sele tion done here is not su\u001e ient to dis over\n\n−1\na signal with a luminosity of 300 fb . Moreover, the small size of this signal and its\ndistribution a ross all the\n\nmre\nE\n\nand\n\nml1 l2\n\nrange implies that the systemati\n\nun ertainty\n\nin ba kground normalisation has to be investigated in detail in order to draw a de\u001cnite\npredi tion for the sensitivity.\nCase (a)\n\nT1 ( ut on\nT1 ( ut on\n\nmre\nE )\nml1 l2 )\n\nCase (b)\n\nS\n\nB\n\nL\n\nS\n\nB\n\nL\n\n17.4\n\n2.5\n\n−1\n17.4 fb\n\n16.6\n\n3.3\n\n−1\n18.3 fb\n\n20.9\n\n2.6\n\n14.4 fb\n\n−1\n\n20.8\n\n2.7\n\n−1\n14.7 fb\n\nTable 16: Number of signal (S ) and ba kground (B ) events for 30 fb\n\n280 < mre\nE < 320 GeV (upper row) and ml1 l2 > 150 GeV (lower\nL required to have a 5σ dis overy in the l± l± l± l∓ \u001cnal state.\nOn e that a positive signal is dis overed, it\ning angle distribution\n\nin the regions\n\nrow), and luminosity\n\nan be investigated whether the open-\n\norresponds to the expe tation for\n\npro ess, the dependen e of the partoni\n\n−1\n\nE ±N\n\nprodu tion. For this\n\nross se tion on the polar angle\n\n53\n\nθ\n\nin the CM\n\n\fsystem is given by\n\nwhere\n\nE =\n\n√\n\nŝ/2,\n\nE 2 − m2Σ\ndσ\n∝1+ 2\ncos2 θ ,\nd cos θ\nE + m2Σ\nwith\n\nŝ\n\nthe partoni\n\n(75)\n\nCM energy. After weighting with phase spa e\n\nfa tors and PDFs, the resulting distribution depends little on the\nas it is shown in Fig. 24. The distribution approximately\n\n2\n\ndσ ∝ 1 + 0.28 cos θ,\ndσ ∝ 1 + cos2 θ.\n\nrather \u001dat\n\nommon mass\n\nmΣ ,\n\norresponds to a dependen e\n\nompared to the one for massless \u001cnal state fermions,\n\n0.07\n\nσ (normalised)\n\n0.06\n0.05\n0.04\n0.03\nmΣ = 150\nmΣ = 300\n\n0.02\n\nmΣ = 1000\n0.01\n0\n-1\n\nFigure 24: Dependen e of the\n\n0\n\n-0.5\n\ncos θ\n\nE ±N\n\ngenerator level, for di\u001berent values of\n\n0.5\n\n1\n\nross se tion on the CM polar angle\n\nθ,\n\nat the\n\nmΣ .\n\nIn the simulations we require for the re onstru tion of the CM system the presen e\nof two jets, as produ ed in the hannel whi h gives the largest ontribution to the signal,\n\nE + N → l+ Z(→ l+ l− )l± W ∓ (→ q q̄ ′ ).\n\nBoth jets must have transverse momentum larger\n\nE\n\nde ay. The heavy neutrino is re onstru ted from\n\nthan 20 GeV. The re onstru tion of the\nthe three leptons resulting from the\n\nE\n\nmomentum pro eeds as before, identifying\n\nthe two jets and the remaining lepton:\n\n1. First, the\n\nW\n\nboson momentum is re onstru ted using the two jets with larger\n\ntransverse momentum, and res aled so that their invariant mass is\n2. Then, the momentum of the remaining\n\nN\n\nMW .\n\nharged lepton is summed, to form the\n\nmomentum.\n\nThe quality of the re onstru tion is ensured by requiring that\n\nmre\nE\n\nlies between 280\n\nand 320 GeV, after whi h 10.4 signal events survive. Cuts are not applied on\n\nmre\nN\n\nin\n\norder to keep the signal as large as possible. The opening angle distribution after event\nsele tion and re onstru tion for the s enario T1 is shown in Fig. 25 (left). The result\n\n54\n\n\fseems\n\nompatible with the theoreti al expe tation even without using any\n\norre tion\n\nfun tion to parameterise the dete tor e\u001be ts, although the Monte Carlo statisti s is\n\n−1\ngenerated.\ninsu\u001e ient even with 3000 fb\n\nClearly, this distribution will be useful\n\nonly for very large integrated luminosities. In Fig. 25 (right), we present a possible\nexperimental result for 30 fb\nthis \u001cgure, and\n\n−1\n\n, generated from the distribution in the left side of\n\norresponding to 11 signal events.\n\nThis hypotheti al \u0010experimental\n\nresult\u0011 has little resemblan e with the theoreti al expe tation due pre isely to the\nsmall number of events.\n0.07\n\n5\n±\n\n± ± ±\n\nl l l l\n\n0.06\n\nΣ (T1)\n\n0.05\n\nEvents\n\n0.04\n0.03\n\n3\n\n2\n\n0.02\n0.01\n\n± ± ±\n\nl l l l\n\n0\n-1\n\n1\n\nΣ (T1)\n\n±\n\nEvents (normalised)\n\n4\n\n0\n\n-0.5\n\nFigure 25: Left: Normalised\n\n1\n\n0.5\n\ncos θ\n\nE±\n\n0\n-1\n\n-0.5\n\n0\n\nopening angle distribution for the\n\n1\n\n0.5\n\ncos θ\n\nl± l± l± l∓\n\nsignal in\n\n−1\n(with 11\ns enario T1. Right: Possible experimental result for a luminosity of 30 fb\nevents).\n\n6.4 Final state l+ l+ l− l−\nIn\n\nontrast with the previous\n\nQ = ±2\n\nfour lepton \u001cnal state, the\n\nommon to s alar and fermion triplet produ tion. In the latter\nresult from many de ay\n\nZZ → l+ l− q q̄/ν ν̄\n\nE + E − → νW + l− Z/l+ ZνW − ,\n\nZ → l+ l− , W → lν\n\nE + E − → l+ Z l− H/l+ H l− Z ,\n\nE ± N → l± Z l− W + ,\n\nhannels with\n\nτ\n\nE,\n\nZ → l+ l− , H → q q̄\n\nZ → l+ l− , W → q q̄ ′\n\nleptons, or more\n\nontribute. This \u001cnal state is\nharged lepton\n\nsignal is\n\nase, four leptons\n\nan\n\nhannels, namely\n\nE + E − → l+ Z l− Z ,\n\nAdditional\n\nl+ l+ l− l−\n\n(Br = 9.1 × 10−3 ) ,\n\n(Br = 6.9 × 10−3 ) ,\n\n(Br = 4.5 × 10−3 ) ,\n\n(Br = 3.4 × 10−3 ) .\n\n(76)\n\nharged leptons whi h are missed, also\n\nru ial in order to establish the produ tion of the heavy\n\nwhi h is seen as a sharp peak in a trilepton invariant mass distribu-\n\ntion. This distribution also\n\nan be used to experimentally measure\n55\n\nmE .\n\n\fIn order to better\n\nompare with the s alar triplet produ tion in se tion 5.1 we use\n\nthe same pre-sele tion and sele tion\nharged leptons with total\n\nharge\n\nriteria: for pre-sele tion we require four isolated\n\nQ = 0,\n\nat least two of them with transverse momen-\n\ntum larger than 30 GeV, and for event sele tion we ask that opposite\nannot be paired in su h a way that both pairs have a mass\n\nloser to\n\nThe number of events at pre-sele tion and sele tion levels are\n(ba kgrounds are the same as in Table 4 but quoted for\nPre-sele tion\n\nSele tion\n\n43.6\n\n42.9\n\n27.3\n\n26.8\n\n8.2\n\n7.7\n\n8.6\n\n7.6\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\n\ntt̄nj\nZbb̄nj\nZtt̄nj\nZZnj\n\nharge leptons\n\nMZ\n\nthan 5 GeV.\n\nolle ted in Table 17\n\nonvenien e).\nPre-sele tion\n\nSele tion\n\n116.0\n\n115.7\n\n53.1\n\n53.1\n\n32.9\n\n31.5\n\n617.7\n\n98.7\n\nTable 17: Number of events for the four-lepton signals and main ba kgrounds for a\nluminosity of 30 fb\n\n−1\n\n.\n\nThe pro esses in Eqs. (76) originate broad like-sign dilepton invariant mass distributions, shown in Fig. 26 at the pre-sele tion level. The distributions are mu h wider\nand\n\nompletely di\u001berent from the peaks found for the s alar triplet, plotted in Fig. 7 of\n\nse tion 5.1, and the dis rimination between both possibilities should be possible already\nwith a small number of events. To see this, in Fig. 26 we plot the\n\nml1 l2\n\ndistribution\n\nfor the SM ba kground and in the presen e of the fermion triplet signals in s enarios\nT1 (left) and T2 (right), after event sele tion.\nThe heavy\n\nE\n\nmass\n\n± ± ± ∓\n\nl l l l \u001cnal state.\nlZ → ll+ l− . The Z\n\nan be re onstru ted in a way analogous to that for the previous\nNoti e that all\nboson\n\nhannels in Eqs. (76) involve the de ay\n\nan be identi\u001ced sele ting among the four possibilities\n\n+ −\nthe opposite sign pair la lb with an invariant mass\nlepton produ ed in the\n\nE\n\nde ay is\n\nlosest to\n\nMZ .\n\nThen, the\n\nhosen among the remaining ones\n\ngiving a three-lepton invariant mass\n\nlosest to\n\nmE .\n\nlc , ld\n\nharged\n\nas the one\n\nThe resulting signal distributions\n\nare very similar to the ones in Fig. 21, and are not shown for brevity. The\n\n−\nl+\na lb lc +\n\nE →\n\nmre\nE\n\nand\n\n−\nl+\na lb ld distributions for s enario T1 (the latter with two entries per event)\n\nare shown in Fig. 27, in luding the ba kground. For s enario T2 the number of events\nis mu h smaller (see Table 17) and widely distributed (see Fig. 21), so the signal is not\nvisible in this\n\nhannel. For\n\nomparison, in the lower half of Fig. 27 we show the same\n\nvariables for s alar triplet produ tion in NH and IH. Clearly, this distribution together\nwith the\n\nml1 l2\n\ndistribution\n\nan serve to dis riminate among the two seesaw s enarios.\n\n56\n\n\f10\n\n4\nl1 l2\n\nl1 l2\n\nl3 l4\n\n6\n\n4\n\n0\n\n0\n\n200\n\n100\n\n300\n\nmll\n\n400\n\n0\n\n500\n\n50\n\n0\n\n200\n\n100\n\nmll\n\n300\n\n400\n\n500\n\n30\n\n20\n+ + − −\n\n10\n\n200\n\n100\n\nml l\n\n300\n\n30\n\n20\n+ + − −\n\n10\n\nl l l l\n\n0\n\nSM bkg + Σ (T2)\nSM bkg\n\n40\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n+ + − −\n\nl l l l (T2)\n\n50\nSM bkg + Σ (T1)\nSM bkg\n\n40\n\n0\n\n2\n\n1\n\n+ + − −\n\nl l l l (T1)\n\n2\n\nl3 l4\n\n3\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n8\n\n400\n\n0\n\n500\n\nl l l l\n\n0\n\n200\n\n100\n\n12\n\nml l\n\n300\n\n400\n\n500\n\n12\n\nFigure 26: Up: Kinemati al distribution at pre-sele tion of the two like-sign dilepton\n\nml1 l2 and ml3 l4 for the fermion triplet signal in s enarios T1 (left) and\nDown: ml1 l2 distribution for the SM and the SM plus the fermion triplet\n\ninvariant masses\nT2 (right).\n\nsignals in the s enarios T1 (left) and T2 (right). The luminosity in all plots is 30 fb\n\n−1\n\n.\n\nThe number of events at the peak\n\n280 < mre\nE < 320\nis\n\nolle ted in Table 18 for the\n\nGeV\n\n(77)\n\nases (a) and (b) used in the previous analysis, with the\n\nluminosity needed for dis overy in s enario T1. For s enario T2 the signal signi\u001c an e\nis smaller than\n\n1σ\n\nluminosities are\n\nfor 30 fb\n\n−1\n\n, and dis overy\n\nannot be a\n\nomplished unless very large\n\nolle ted and a very pre ise ba kground normalisation is a hieved.\nCase (a)\n\nT1\n\nCase (b)\n\nS\n\nB\n\nL\n\nS\n\nB\n\nL\n\n55.7\n\n14.3\n\n−1\n6 fb\n\n53.7\n\n16.3\n\n−1\n6.9 fb\n\nmre\nE peak for 30\n+ + − −\nl l l l \u001cnal state.\n\nTable 18: Number of signal (S ) and ba kground (B ) events at the\n\n−1\n\nfb\n\n, and luminosity\n\nL\n\nrequired to have a\n\n5σ\n57\n\ndis overy in the\n\n\f40\n\n2 × Events / 10 GeV\n\n30\n\nEvents / 10 GeV\n\nSM bkg + Σ (T1)\nSM bkg\n\n80\n\nSM bkg + Σ (T1)\nSM bkg\n\n60\n\n20\n\n40\n\n10\n\n20\n\n+ + − −\n\n+ + − −\n\nl l l l\n0\n\n0\n\n100\n\n200\n\n300\n\nrec\n\n400\n\nl l l l\n0\n\n600\n\n500\n\n0\n\n200\n\n100\n\n300\n\n400\n\nml + l − l , ml + l − l\n\nmE\n\na b c\n\n600\n\n500\n\n700\n\na b d\n\n30\n\n2 × Events / 10 GeV\n\nEvents / 10 GeV\n\nSM bkg + ∆ (NH)\nSM bkg + ∆ (IH)\nSM bkg\n\n80\n\nSM bkg + ∆ (NH)\nSM bkg + ∆ (IH)\nSM bkg\n\n25\n\n60\n\n20\n15\n\n40\n\n10\n\n0\n\n20\n\n+ + − −\n\n+ + − −\n\nl l l l\n\n5\n\n0\n\n100\n\n200\n\n300\n\nrec\n\n400\n\nl l l l\n0\n\n600\n\n500\n\n0\n\n200\n\n100\n\n300\n\nFigure 27: Up:\n\nmre\nE\n\n400\n\nml + l − l , ml + l − l\n\nmE\n\na b c\n\n600\n\n500\n\n700\n\na b d\n\ndistribution for the SM and the SM plus the fermion triplet signal\n\n−\n+ −\nl+\na lb lc + la lb ld invariant mass distribution\nalar triplet ∆, for NH and IH. The luminosity in all\n\nin s enario T1 (left) and\n\n(right). Down:\n\nthe same for the s\n\nases is 30 fb\n\nFinally, in this de ay\n\n−1\n\n.\n\nhannel the full re onstru tion of the \u001cnal state kinemati s\n\nan be done as in the previous subse tion, requiring two jets with\npoint out that the distribution is the same for\nresult is shown in Fig. 28.\n\n+\n\nE E\n\n−\n\nand\n\n±\n\nE N\n\npT > 20\n\nGeV. We\n\nprodu tion.\n\nThe\n\nAlthough the distribution after dete tor simulation and\n\nre onstru tion is \u001datter than in the\n\nl± l± l± l∓\n\n\u001cnal state the statisti s is three times\n\nbetter, and with an adequate parameterisation of the dete tor e\u001be ts this\n\nhannel may\n\nbe more useful to determine the opening angle distribution.\n\n6.5 Final state l± l± l±\nThis\n\nonspi uous \u001cnal state is produ ed when one or several\n\nby the dete tor, or from a de ay\n\n+ −\n\nZ → τ τ\n\nwith one\n\nτ\n\nharged leptons are missed\nde aying hadroni ally and\n\nthe other one leptoni ally. Both the signal and its SM ba kgrounds are small. Presele tion\n\nriteria are analogous to the other\n\ninvolve the presen e of three like-sign\n\nhannels studied, and in this\n\nharged leptons, two of them with\n\n58\n\nase they\n\npT > 30\n\nGeV.\n\n\f6\n\n0.06\n\n5\n\nΣ (T1)\n\n0.05\n4\n0.04\n\nEvents\n\nEvents (normalised)\n\n0.07\n\n0.03\n\n3\n2\n\n0.02\n0.01\n0\n-1\n\n+ + − −\n\nΣ (T1)\n\nl l l l\n\n-0.5\n\n0\n\n1\n\n0.5\n\ncos θ\n\nFigure 28: Left: Normalised\n\nE±\n\n+ + − −\n\n1\n\nl l l l\n\n0\n-1\n\n0\n\n-0.5\n\nopening angle distribution for the\n\n1\n\n0.5\n\ncos θ\n\nl+ l+ l− l−\n\nsignal in\n\n−1\n(with 32\ns enario T1. Right: Possible experimental result for a luminosity of 30 fb\nevents).\n\nThe number of like-sign trilepton signal and ba kground events at pre-sele tion\nread in Table 19. Ba kgrounds\n\nan be further suppressed by raising the\n\npT\n\nan be\n\nthreshold of\n\nthe leading and sub-leading leptons to 50 GeV, whi h redu es the total ba kground to\n1.9 events. Sin e in this\nsignal itself, we\n\nase the dis overy potential mainly depends on the size of the\n\nan negle t the SM ba kground normalisation un ertainty. Then, the\n\nsignal in s enario T1 has\n\n5σ\n\nsigni\u001c an e for a luminosity of 30 fb\n\nT2 the statisti al signi\u001c an e is of only\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\n\n−1\n\n, while in s enario\n\n1.5σ .\n\nPre-sele tion\n\nSele tion\n\n0.1\n\n0.0\n\n11.0\n\n10.2\n\n0.1\n\n0.0\n\n1.6\n\n0.9\n\ntt̄nj\nW bb̄nj\nW tt̄nj\nZtt̄nj\n\nPre-sele tion\n\nSele tion\n\n5.3\n\n0.1\n\n0.4\n\n0.0\n\n3.6\n\n1.8\n\n0.3\n\n0.0\n\nTable 19: Number of events for the like-sign trilepton signals and main ba kgrounds\nwith a luminosity of 30 fb\n\n−1\n\n.\n\n6.6 Final state l± l± l∓\nThis is an ex ellent \u001cnal state for the dis overy of fermion triplets (as it is also for\ns alar triplets), due to the relatively high signal rate and the small ba kground.\nprovides the same signal signi\u001c an e as the like-sign dilepton\n\nIt\n\nhannel studied in the\n\nnext se tion without the need of event re onstru tion, and has the advantage that it\n\n59\n\n\fserves to establish the produ tion of the heavy neutrino\nin the invariant mass distribution of two opposite\n\nN,\n\nwhi h is seen as a peak\n\nharge leptons plus the missing\n\nmomentum.\nThe\n\nl± l± l∓\n\nsignal re eives\n\nontributions from many\n\nE, N\n\nde ay\n\nhannels. Final\n\nstates with three leptons in lude\n\nE + N → l+ Z l± W ∓ ,\n\nE + N → l+ H l± W ∓ ,\n\n(Br = 2.2 × 10−2 ) ,\n\nH → q q̄, W → lν\n\nE + N → ν̄W + l± W ∓ ,\nwith similar\n\n(Br = 2.8 × 10−2 ) ,\n\nZ → q q̄/ν ν̄, W → lν\n\n(Br = 7.2 × 10−3 ) ,\n\nW → lν\n\nE − N , and additional de ay modes\n+ −\nays Z → l l . The latter are less\n\nhannels for\n\nleptons result from de\n\nwhere two of the\n\nOn the other hand, important additional\n\nriteria used for this\n\nontributions arise from de ay\n\nmodes with additional harged leptons missed by the dete tor, in parti ular from\nprodu tion. Despite the lower\nquite\n\nlean and has a\n\nIn order to\n\nharged\n\nimportant, be ause they\n\nhave smaller bran hing ratios and are suppressed by the sele tion\n\u001cnal state.\n\n(78)\n\nE+E−\n\nharged lepton multipli ity, this three lepton signal is\n\nross se tion mu h larger than those with more leptons.\n\nompare the s alar and fermion triplet signals, we use the same pre-\n\nsele tion and sele tion\n\nriteria as in se tion 5.2: for pre-sele tion we demand the pres-\n\nen e of two like-sign leptons\n\nl1\n\nand\n\nl2\n\nwith transverse momentum larger than 30 GeV\n\nand an additional lepton of opposite sign, and for sele tion we ask that neither of the\ntwo opposite-sign lepton pairs has an invariant mass\n\nloser to\n\nMZ\n\nthan 10 GeV. This\n\nut redu es the signal by about one \u001cfth, be ause some of the de ay\ntwo\n\nharged leptons from\n\nground from\n\nW Znj\n\nZ\n\nde ays, but it is\n\nprodu tion, as it is\n\nhannels involve\n\nru ial in order to remove the large ba k-\n\nlearly seen in Table 20, where the number of\n\nevents for ea h pro ess at the two stages of event sele tion is\n\nolle ted.\n\nThe simplest dis riminating variable between the s alar and fermion triplet signals\nis the like-sign dilepton invariant mass\n\nml1 l2 .\n\nIn Fig. 13 of se tion 5.2 we observed\n\nthat the s alar triplet signals produ e a sharp peak in this distribution, while for\nthe fermion triplet signals the distribution is very broad and has a long tail at large\n\nml1 l2 ,\n\nas shown in Fig. 29.\n\nFor the produ tion of a relatively light neutrino singlet\n\nthe ex ess of events is broad,\na tail. Thus, an ex ess of\ntail points towards\n\n+\n\nE E\n\n−\n\non entrating at intermediate\n\n± ± ∓\n\nl l l\n\nand/or\n\nevents with a broad\n\n±\n\nE N\n\nml1 l2\n\nvalues and without\n\ndistribution and a long\n\nprodu tion, a fa t whi h\n\nby the event re onstru tion performed below.\na\n\nml1 l2\n\non\u001crmed\n\nIf the trilepton ba kgrounds\n\nurately predi ted, the analysis of this distribution\n\n60\n\nan be\n\nan be\n\nan already signal the presen e\n\n\fPre-sele tion\n\nSele tion\n\n62.7\n\n21.2\n\n406.2\n\n298.5\n\n26.5\n\n4.5\n\n78.1\n\n34.4\n\n322.8\n\n212.2\n\n17.8\n\n12.2\n\n45.5\n\n35.1\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\ntt̄nj\ntW\nW tt̄nj\n\nTable 20: Number of events for\nof 30 fb\n\n−1\n\nl± l± l∓\n\n33.3\n\n2.0\n\n152.5\n\n16.8\n\n4113.8\n\n73.4\n\n276.1\n\n4.2\n\n22.7\n\n16.8\n\n42.7\n\n1.7\n\nsignals and main ba kgrounds for a luminosity\n\n.\n10\nE E\n\n+\n\n−\n\nE E\n\n±\n\nE N\n\nEvents / 20 GeV\n\n25\n20\n15\n10\n\n0\n\n200\n\n400\n\n6\n\n4\n\n0\n\n800\n\n600\n\nml l\n\nE N\n\n2\n\n±\n\n± ±\n\nl l l (T1)\n\n5\n\n± ±\n\nl l l (T2)\n0\n\n200\n\n600\n\n12\n\n50\nSM bkg + Σ (T1)\nSM bkg\n\n30\n\n20\n\nl l l\n\n0\n\n200\n\n100\n\nml l\n\n300\n\n400\n\n30\n\n20\n\n± ±\n\n10\n\n±\n\n± ±\n\n10\n\nSM bkg + Σ (T2)\nSM bkg\n\n40\n\nEvents / 10 GeV\n\n40\n\n0\n\n500\n\nl l l\n\n0\n\n100\n\n12\n\n200\n\nml l\n\n300\n\n400\n\n±\n\n50\n\nEvents / 10 GeV\n\n400\n\nml l\n\n12\n\n0\n\n−\n\n±\n\n8\n\n±\n\n+\n\n30\n\nEvents / 20 GeV\n\nSele tion\n\nZbb̄nj\nZtt̄nj\nW Znj\nZZnj\nW W W nj\nW W Znj\n\n35\n\n0\n\nPre-sele tion\n\n500\n\n12\n\nFigure 29: Up: Kinemati al distribution at pre-sele tion of the like-sign dilepton invariant mass\nDown:\n\nl1 l2\n\nml1 l2\n\nfor the\n\nE + E − and E ± N\n\nsignals in s enarios T1 (left) and T2 (right).\n\ninvariant mass distribution for the SM and the SM plus the fermion triplet\n\nsignal in the s enarios T1 (left) and T2 (right), at the sele tion level. The luminosity\n\n−1\nis 30 fb\nin all\n\nases.\n\nof new physi s with a high signi\u001c an e. We set the\n\nml1 l2 > 150\n61\n\nGeV\n\nut\n(79)\n\n\fand give in Table 21 the number of signal and ba kground events in this region, with the\nluminosity needed to a hieve\nSin e in the\n\nml1 l2\n\n5σ signi\u001c\n\nan e if the ba kground un ertainty is negle ted.\n\ndistribution the signal does not appear as a\n\nto estimate a priori to what extent the ba kground\n\nlear peak, it is di\u001e ult\n\nan be normalised from data in\n\nase that a signal is found. We will assume anyway that the ba kground is normalised\nin the region\n\nml1 l2 < 150\n\nGeV to give an approximate estimate of the dis overy limit.\n\n−1\nan be qui ky seen with few fb , while in s enario T2\n\nIn s enario T1 the triplet signal\n\nthe size of the signal is mu h smaller. However, the signal signi\u001c an e in s enario T2\nis better in this \u001cnal state than in the other ones studied, and this signal\n\nould be seen\n\nwith su\u001e ient luminosity provided that the ba kground is well understood. We also\nCase (a)\n\nT1 ( ut on\nT2 ( ut on\n\nml1 l2 )\nml1 l2 )\n\nCase (b)\n\nS\n\nB\n\nL\n\nS\n\nB\n\n228.6\n\n80.1\n\n−1\n1.7 fb\n\n204.6\n\n104.1\n\n18.1\n\n80.1\n\n186 fb\n\n12.5\n\n85.7\n\n−1\n\nL\n2.5 fb\n\n> 300\n\n−1\n\n−1\nfb\n\nTable 21: Number of signal (S ) and ba kground (B ) events with\n30 fb\n\n−1\n\n, and luminosity\n\nL\n\nrequired to have a\n\n5σ\n\ndis overy in\n\nml1 l2 > 150 GeV for\n± ± ∓\nthe l l l \u001cnal state,\n\nwithout event re onstru tion.\npoint out that requiring one or more jets in the \u001cnal state does not improve the signal\nobservability. In Eqs. (78) we observe that several de ay\n\nhannels do not involve the\n\nprodu tion of extra quarks in the \u001cnal state, so that requiring the presen e of extra\njets redu es the signal. This is easily observed in the multipli ity distribution, shown\nin Fig. 30 for the signals and the ba kround. Note that the dip at\n\nNj = 1\n\nin the signal\n\ndistributions is not a statisti al \u001du tuation but the e\u001be t of summing di\u001berent\n\nhannels\n\nwith di\u001berent quark multipli ities in the \u001cnal state.\nAlthough the trilepton ex ess at high\nsour e must be identi\u001ced. The\n\nml1 l2\n\nindi ates the presen e of new physi s, its\n\non\u001crmation that the ex ess is due to\n\nis given by the mass re onstru tion of the heavy\n\nN.\n\nharged lepton\n\nE\n\nE ±N\n\nprodu tion\n\nand the neutrino\n\nIn order to fully re onstru t the event kinemati s we must spe ify further sele tion\n\nriteria to restri t ourselves to some of the\n\nhannels in Eqs. (78). We ask the presen e\n\nof at least two jets with transverse momentum larger than 20 GeV, as produ ed in\nthe \u001crst two\n\nhannels listed with hadroni\n\nZ/H\n\nde ay.\n\nThis additional requirement\n\nredu es the signals to 190.8 events (T1) and 16.1 events (T2), and the ba kground\nto 258.0 events. With three leptons and two jets identi\u001ced, plus missing energy, the\nkinemati s\n\nan be re onstru ted as follows:\n\n62\n\n\f0.5\nΣ (T1)\nΣ (T2)\nSM Bkg\n\n0.3\n\n0.2\n\n± ±\n\n0.1\n\n0\n\n0\n\nl l l\n\n2\n\n1\n\n3\n\n4\n\n5\n\n6\n\n7\n\n±\n\nEvents (normalised)\n\n0.4\n\n8\n\n9\n\n10\n\nNj\n\nFigure 30: Jet multipli ity of the SM ba kground and the fermion triplet signals in\n\nl± l± l∓\n\n\u001cnal states at sele tion level.\n\n1. The momentum of the\n\nZ\n\nor\n\nH\n\nboson de aying hadroni ally is re onstru ted as\n\nthe sum of the momenta of the leading and sub-leading jets.\n2. The heavy\n\nharged lepton\n\nE\n\nan be re onstru ted from this boson and one of\n\nthe two like-sign leptons, and the heavy neutrino\n\nN\n\nfrom the two remaining\n\nleptons and the missing neutrino momentum (the longitudinal\n\nomponent of the\n\nneutrino momentum is negle ted for the moment, and the transverse\n\nomponent\n\nis taken as the missing energy). There are two possibilities for this pairing, and\nwe\n\nN.\n\nhoose the one giving\n\nIn s enario T1 this sele tion pro edure gives the\n\nases, as it\n\nE\n\nlosest invariant masses for the re onstru ted\norre t\n\nE\n\nand\n\nhoi e in most of the\n\nan be observed in the kinemati al distribution of the re onstru ted\n\nmass in Fig. 31. In s enario T2, due to the missing energy from the\n\nτ\n\nleptoni\n\nde ay, the distribution does not exhibit a peak.\n3. The\n\nN\n\nre onstru tion\n\nmentum.\n\nan be re\u001cned by in luding the longitudinal neutrino mo-\n\nWe sele t among the two\n\nharged leptons the least energeti\n\nand require that its invariant mass with the neutrino is\n\nomponents of\n\npν\n\nls ,\n\nMW ,\n\n2\n(pls + pν )2 = MW\n,\ntaking the transverse\n\none\n\n(80)\n\nas the missing energy.\n\nThis quadrati\n\nequation determines the longitudinal neutrino momentum up to a twofold ambiguity, whi h is resolved sele ting the solution with smaller\n\n(pν )z .\n\nIn\n\nase that no\n\nreal solution exists, the transverse neutrino momentum used in Eq. (80) is dereased until a real solution is found. The resulting\nis presented in Fig. 31.\n\n63\n\nN\n\ninvariant mass distribution\n\n\f30\n\n40\nΣ (T1)\nΣ (T2)\n\nΣ (T1)\nΣ (T2)\n\n25\n\nEvents / 10 GeV\n\n20\n\n± ±\n\nl l l\n0\n\n0\n\n200\n\n100\n\n300\n\nrec\n\n400\n\n±\n\n10\n\n20\n15\n10\n± ±\n\nl l l\n\n5\n0\n\n600\n\n500\n\n0\n\n100\n\n200\n\n300\n\nrec\n\nmE\n\nFigure 31: Re onstru ted\n\n400\n\n±\n\nEvents / 10 GeV\n\n30\n\n600\n\n500\n\nmN\n\nE\n\n(left) and\n\nN\n\n(right) masses for the fermion triplet signals\n\nin s enarios T1 and T2, without ba kground, in the\n\nl± l± l∓\n\n\u001cnal state. The luminosity\n\n−1\nis 30 fb .\n\nFig. 32 displays how the fermon triplet signal in s enario T1 would appear in the\npresen e of ba kground: the signal produ es\ndistributions. We do not in lude the\n\nlear peaks over the ba kground in both\n\norresponding distributions for s enario T2, where\n\nthe signal is mu h smaller and di\u001e ult to see. For\nthe distributions\n\nomparison, we also show in Fig. 32\n\norresponding to s alar triplet produ tion.\n\nIn the latter\n\nase the\n\nsignals are mu h smaller after the requirement of two extra jets, whi h are not produ ed\nat the partoni\n\nlevel. The statisti al signi\u001c an e of the peaks is very high, as it\n\nreadily be observed from the\n\norresponding distributions. We de\u001cne the peaks as\n\n240 < mre\nE < 360\n\nGeV ,\n\n240 < mre\nN < 360\n\nGeV .\n\nThe number of events at both peaks\nneeded for\n\n5σ\n\nan\n\n(81)\n\nan be found in Table 22, and the luminosity\n\ndis overy. We negle t the ba kground un ertainty, be ause the dis overy\n\nsigni\u001c an e in this\n\nase is mainly\n\nontrolled by the size of the signal itself.\nCase (a)\n\nT1 ( ut on\n\nre\nmre\nE , mN\n\n)\n\nS\n\nB\n\nL\n\n110.3\n\n15.9\n\n−1\n2.7 fb\n\nTable 22: Number of signal (S ) and ba kground (B ) events in the\n(de\u001cned in the text) for 30 fb\nthe\n\n± ± ∓\n\nl l l\n\n−1\n\n, and luminosity\n\nL\n\nmre\nE\n\nrequired to have a\n\nand\n\n5σ\n\nmre\nN\n\npeaks\n\ndis overy in\n\nplus two jet \u001cnal state.\n\nFinally, although the statisti s in this\n\nhannel is very good, the re onstru ted open-\n\ning angle distribution shows large deviations from the theoreti al expe tation due to\n64\n\n\f30\n\n40\nSM bkg + Σ (T1)\nSM bkg\n\nSM bkg + Σ (T1)\nSM bkg\n\n25\n\nEvents / 10 GeV\n\n20\n\n± ±\n\nl l l\n\n0\n\n200\n\n100\n\n300\n\nrec\n\n400\n\n15\n10\n± ±\n\nl l l\n\n5\n0\n\n600\n\n500\n\n0\n\n100\n\n200\n\nmE\n20\n\n400\n\n600\n\n500\n\nEvents / 10 GeV\n\n10\n\n5\n\n0\n\n± ±\n\nl l l\n\n200\n\n100\n\n300\n\nrec\n\n400\n\n500\n\nSM bkg + ∆ (NH)\nSM bkg + ∆ (IH)\nSM bkg\n\n20\n\n±\n\nEvents / 10 GeV\n\nrec\n\n25\n\nSM bkg + ∆ (NH)\nSM bkg + ∆ (IH)\nSM bkg\n\n15\n\n0\n\n300\n\nmN\n\n15\n\n10\n± ±\n\nl l l\n\n5\n\n0\n\n600\n\n0\n\n100\n\n200\n\nmE\n\nFigure 32: Up:\n\nmre\nE\n\n300\n\nrec\n\n400\n\n±\n\n0\n\n±\n\n10\n\n20\n\n±\n\nEvents / 10 GeV\n\n30\n\n500\n\n(left) and\n\nmre\nN\n\n(right) distributions for the SM and the SM plus\n\nthe fermion triplet signal in s enario T1. Down: the same for the s alar triplet\n\n−1\nNH and IH. The luminosity is 30 fb\nin all\n\ndete tor e\u001be ts, and the use of\nmeaningful\n\n600\n\nmN\n\n∆,\n\nfor\n\nases.\n\norre tion fun tions is\n\nompulsory in order to make a\n\nomparison. This issue will not be addressed here.\n\n6.7 Final state l± l±\nThis \u001cnal state has a similar dis overy potential as the previous one\n\nl± l± l∓ .\n\nDe ay\n\nhannels giving like-sign dileptons in lude\n\nE + N → l+ Z l+ W − ,\n\nZ → q q̄/ν ν̄, W → q q̄ ′\n\nE + N → l+ H l+ W − ,\n\nH → q q̄, W → q q̄ ′\n\nE + N → ν̄W + l+ W − ,\nand analogous\n\nhannels for\n\nW + → lν, W − → q q̄ ′\nE −N\n\nde ays. The\n\n(Br = 4.3 × 10−2 ) ,\n\n(Br = 3.3 × 10−2 ) ,\n\n(Br = 2.1 × 10−3 ) ,\n\n(82)\n\nontributions with \u001cnal state neutrinos\n\nhave not been in luded in Ref. [37℄, whi h fo uses on four jet \u001cnal states. As usual,\nadditional\n\nontributions arise from de ays with larger lepton multipli ities when one\n\nor more of them are not dete ted. For event pre-sele tion we use the same requirement\n65\n\n\fas for the s alar triplet analysis, that is, two like-sign leptons with\n\npT > 30\n\nGeV. The\n\nnumber of signal and ba kground events are gathered in Table 23.\nPre-sele tion\n\nSele tion\n\n13.0\n\n0.4\n\n678.1\n\n226.4\n\n6.8\n\n0.1\n\n114.7\n\n1.8\n\n1193.6\n\n166.0\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\ntt̄nj\n\nPre-sele tion\n\nSele tion\n\n194.0\n\n19.3\n\n205.7\n\n15.2\n\n892.2\n\n32.3\n\n86.9\n\n4.3\n\nW tt̄nj\nW W nj\nW Znj\nW W W nj\n\nTable 23: Number of events for the like-sign dilepton signals and main ba kgrounds\nfor a luminosity of 30 fb\n\n−1\n\n.\n\nAlready at the pre-sele tion level, the di\u001beren es between the s alar and fermion\ntriplet signals are evident by merely\n\nonsidering the dilepton invariant mass distribu-\n\ntion, whi h displays a sharp peak in the former\n\nase and a non-lo alised ex ess in the\n\nlatter, with a long tail. The distributions for the fermion triplet signal in s enarios T1\nand T2 are shown in Fig. 33, without and with the SM ba kground. This distribution\nan already be used to dis over the fermion triplet signal, whi h shows up as a dilepton\nex ess at large invariant mass. We will use, as in the previous subse tion, the\n\nml1 l2 > 150\n\nGeV .\n\nut\n(83)\n\nThe number of signal and ba kground events is given in Table 24 with the luminosity\nneeded for\n\n5σ\n\ndis overy, if the ba kground un ertainty is negle ted (a) or the ba k-\n\nml1 l2 < 150\n\nground is normalised from data in the region\nCase (a)\n\nT1 ( ut on\nT2 ( ut on\n\nml1 l2 )\nml1 l2 )\n\nGeV (b).\nCase (b)\n\nS\n\nB\n\nL\n\nS\n\nB\n\n525.3\n\n692.7\n\n2.2 fb\n\n−1\n\n471.5\n\n746.5\n\n56.2\n\n692.7\n\n165 fb\n\n−1\n\n35.1\n\n713.8\n\nL\n2.9 fb\n\n> 300\n\n−1\n\n−1\nfb\n\nTable 24: Number of signal (S ) and ba kground (B ) events with\n30 fb\n\n−1\n\n, and luminosity\n\nL\n\nrequired to have a\n\n5σ\n\ndis overy in\n\nml1 l2 > 150 GeV for\n± ±\nthe l l \u001cnal state, at\n\nthe pre-sele tion level without event re onstru tion.\nThe signal signi\u001c an e\n\nan be improved with signal sele tion\n\nmass re onstru tion. For event sele tion we require:\n(i) missing energy\n\n6pT < 30\n\nGeV;\n66\n\nriteria and invariant\n\n\f30\n\n10\n9\n8\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n25\n20\n15\n10\n± ±\n\n6\n5\n4\n3\n2\n\nl l (T1)\n\n5\n\n7\n\n± ±\n\nl l (T2)\n\n1\n0\n\n0\n\n200\n\n100\n\n300\n\n400\n\nml l\n\n500\n\n700\n\n600\n\n0\n\n800\n\n0\n\n200\n\n100\n\n300\n\n600\n\n300\nSM bkg + Σ (T1)\nSM bkg\n\n200\n150\n100\n± ±\n\nl l\n\n50\n\n0\n\n200\n\n100\n\nml l\n\n300\n\n400\n\nSM bkg + Σ (T2)\nSM bkg\n\n250\n\nEvents / 10 GeV\n\n250\n\nEvents / 10 GeV\n\n500\n\n12\n\n300\n\n0\n\n400\n\nml l\n\n12\n\n200\n150\n100\n± ±\n\nl l\n\n50\n0\n\n500\n\n0\n\n200\n\n100\n\n12\n\n300\n\nml l\n\n400\n\n500\n\n12\n\nFigure 33: Up: Kinemati al distribution at pre-sele tion of the like-sign dilepton invariant mass\nDown:\n\nl1 l2\n\nml1 l2\n\nfor the fermion triplet signals in s enarios T1 (left) and T2 (right).\n\ninvariant mass distribution for the SM and the SM plus the signal in the\n\ns enarios T1 (left) and T2 (right). The luminosity is 30 fb\n\n(ii) the presen e of four jets with\n\npT > 20\n\n< 30,\n\nfour jets with no\n\nb\n\nin all\n\nases.\n\nGeV.\n\nThis event sele tion is slightly di\u001berent from the one\nsinglet (6pT\n\n−1\n\nhosen for the heavy neutrino\n\ntags and ba k-to-ba k leptons) be ause the signals\n\nare quite di\u001berent and the mass re onstru tion in the triplet ase requires four jets. The\nnumber of events at the sele tion level is given in Table 23. Given the fa t that some\nof the de ay\n\nhannels in Eqs. (82) do not involve the produ tion of extra quarks but\n\nundete ted neutrinos, the signal is redu ed. This\n\nan already be seen by examining the\n\nmultipli ity distribution in Fig. 34 (left), whi h has been normalised for\n\nonvenien e.\n\nThe requirement of no missing energy, whose normalised distribution is displayed in\nFig. 34 (right) also suppresses the signal\n\nhannels involving \u001cnal state neutrinos but\n\ndoes not signi\u001c antly a\u001be t \u001cnal states whi h already have four jets.\nAlthough not stri tly ne essary to have eviden e of new physi s, the kinemati al\nre onstru tion is\n\nonvenient to identify the type of new physi s and to gain a higher\n\n67\n\n\f0.30\n\n0.25\nΣ (T1)\nΣ (T2)\nSM Bkg\n\n0.20\n0.15\n0.10\n± ±\n\nl l\n\n0.05\n0\n\n0\n\n1\n\n2\n\n3\n\n4\n\n7\n\n6\n\n5\n\n8\n\n9\n\nΣ (T1)\nΣ (T2)\nSM Bkg\n\n0.20\n\nEvents (normalised)\n\nEvents (normalised)\n\n0.25\n\n0.15\n\n0.10\n± ±\n\n0.05\n\n0\n\n10\n\nNj\n\nl l\n\n0\n\n200\n\n100\n\np⁄ T\n\n300\n\n400\n\nFigure 34: Left: Jet multipli ity of the SM ba kground and the fermion triplet signals in\nlike-sign dilepton \u001cnal states at pre-sele tion level. Right: missing energy distribution.\n\nsignal signi\u001c an e. In order to do this, we re onstru t the kinemati s as\nto the de ay\n\nhannels with produ tion of four quarks:\n\n1. We asso iate ea h\n\nharged lepton to a pair of jets in all possible ways, using the\n\nfour jets with larger\n\npT .\n\n2. Among the six possibilities, we\nthe two\n\norresponds\n\njj\n\nand the two\n\nljj\n\nhoose the one minimising the di\u001beren e between\n\ninvariant masses,\n\n(mj1 j2 − mj3 j4 )2 + (ml1 j1 j2 − ml2 j3 j4 )2 .\nNote that for the leading signal\nspond to a hadroni\n\nW\n\n(84)\n\nontributions two of the jets in prin iple\n\nde ay and the other two to a\n\nZ\n\norre-\n\nor Higgs boson de ay.\n\nHowever, if a wrong assignment is made, it is expe ted that the invariant mass\ndi\u001beren es will be larger.\n\nBoth heavy states\nthey\n\nE, N\n\ngive as de ay produ ts one\n\nharged lepton and two jets, and\n\nannot be easily distinguished. Then, we label the heavy states as\n\norrsponding to the leading and sub-leading lepton.\n\nthe\n\nN → lW → lq q̄\n\nde ay than for\n\nand\n\nΣ2 ,\n\nA dis rimination based on the\n\ntwo-jet invariant mass (it should be smaller in average for the two jets\n\n′\n\nΣ1\n\nE → lZ/H → lq q̄)\n\noming from\n\nis not very signi\u001c ant. We\n\npoint out that, unlike other \u001cnal states studied, here no information is gained about\nthe nature of the two resonan es be ause the jet\n\nharges are not measured.\n\nThe mass re onstru tion is ex ellent for s enario T1, and both distributions display\nlear peaks at\n\nmΣ = 300\n\nGeV and small tails, as it\n\nan be observed in Fig. 35. On the\n\nother hand, for s enario T2 the distribution is very broad, and with very few events.\n\n68\n\n\f60\n\n50\nΣ (T1)\nΣ (T2)\n\n30\n\n20\n\n± ±\n\n10\n\n0\n\nl l\n\n0\n\n100\n\n200\n\n300\n\nrec\nmΣ\n1\n\n400\n\n500\n\nΣ (T1)\nΣ (T2)\n\n50\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n40\n\n40\n30\n20\n± ±\n\nl l\n\n10\n0\n\n600\n\n0\n\n100\n\n200\n\n300\n\nrec\n\nmΣ\n\n400\n\n500\n\n600\n\n2\n\nFigure 35: Re onstru ted triplet masses in s enarios T1 and T2, without ba kground,\nin the\n\nl± l±\n\n−1\n\u001cnal state at the sele tion level. The luminosity is 30 fb .\n\nWe present in Fig. 36 the two distributions for s enario T1 in luding the ba kground,\nin order to show how the presen e of the signal would manifest.\nsignals less than one event survives the sele tion\n\nFor s alar triplet\n\nriteria adopted here, be ause jets are\n\nnot produ ed in the hard intera tion. Neutrino singlet signals also have a smaller jet\nmultipli ity, whi h makes them unobservable if one requires four jets in the \u001cnal state.\n60\n\n50\nSM bkg + Σ (T1)\nSM bkg\n\n30\n\n20\n\n± ±\n\n10\n\n0\n\nl l\n\n0\n\n100\n\n200\n\n300\n\nrec\n\nmΣ\n\nFigure 36:\n\nmre\nΣ1\n\n400\n\n500\n\nSM bkg + Σ (T1)\nSM bkg\n\n50\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n40\n\n40\n30\n20\n± ±\n\nl l\n\n10\n0\n\n600\n\n0\n\n100\n\n200\n\n1\n\n(left) and\n\n300\n\nrec\n\nmΣ\n\nmre\nΣ2\n\n400\n\n500\n\n600\n\n2\n\n(right) distributions for the SM and the SM plus the\n\nfermion triplet signal in s enario T1 at the sele tion level. The luminosity is 30 fb\n\n−1\n\n.\n\nThe signal signi\u001c an e is estimated for the peak regions\n\n250 < mre\nΣ1 < 350\n\nGeV ,\n\n250 < mre\nΣ2 < 350\n\nGeV\n\n(85)\n\nnegle ting the un ertainty in the ba kground normalisation (whi h is not very important sin e the ba kground itself it is very small for the dis overy luminosity).\nresults are in luded in Table 25.\n69\n\nThe\n\n\fCase (a)\n\nT1 ( ut on\n\nre\nmre\nΣ1 , mΣ2 )\n\nS\n\nB\n\nL\n\n177.8\n\n19.5\n\n−1\n1.7 fb\n\nTable 25: Number of signal (S ) and ba kground (B ) events in the\n\n−1\n(de\u001cned in the text) for 30 fb , and luminosity\nfor the peaks in the\n\n± ±\n\nl l\n\nL\n\nmre\nΣ1\n\nrequired to have a\n\nand\n\n5σ\n\nmre\nΣ2\n\npeaks\n\nsigni\u001c an e\n\nplus four jet \u001cnal state.\n\nFinally, as it happens in the\n\nl± l± l∓\n\n\u001cnal state, the re onstru ted opening angle\n\ndistribution shows large deviations from the theoreti al expe tation due to dete tor\ne\u001be ts, and the use of\n\norre tion fun tions is required.\n\n6.8 Final state l+ l− jjjj\nThe large SM ba kgrounds make \u001cnal states with two opposite\ndemanding, even when the\n\nharged leptons have di\u001berent \u001davour. Nevertheless, these\n\n\u001cnal states must be studied to\nlike-sign dilepton\n\nhannels.\n\nharge leptons very\n\nhe k the\n\nonsisten y of a possible dis overy in the\n\nOpposite sign pairs\n\nan be produ ed for example in the\n\nde ay modes\n\nE + N → l+ Z l− W +\n\nZ → q q̄/ν ν̄, W → q q̄ ′\n\nE + N → l+ H l− W +\n\nH → q q̄, W → q q̄ ′\n\n(Br = 3.3 × 10−2 ) ,\n\nZ → q q̄/ν ν̄\n\n(Br = 5.9 × 10−2 ) ,\n\nH → q q̄\n\n(Br = 3.4 × 10−2 ) .\n\nE + N → ν̄W + l− W +\n\nW W → lνq q̄ ′\n\nE + E − → l+ Z l− H/l+ H l− Z\n\nZ → q q̄/ν ν̄, H → q q̄\n\nE + E − → l+ Z l− Z\n\nE + E − → l+ H l− H\n\n(Br = 4.3 × 10−2 ) ,\n\n(Br = 4.3 × 10−3 ) ,\n\n(Br = 8.9 × 10−2 ) ,\n\n(86)\n\nPerforming an in lusive opposite-sign dilepton sear h of these signals is hopeless, beause they are produ ed at an invariant mass whi h is not su\u001e ient to separate them\nfrom the ba kground.\n\n9\n\nThus, we\n\non entrate on \u001cnal states with four jets.\n\nContrarily to what has been re ently\nwith\n\nlaimed [37℄, we \u001cnd that\n\ne± μ∓\n\n\u001cnal states\n\nharged lepton \u001davour violation provide little advantage for the dete tion of the\n\n9 Note\n\nthat a Z ′ boson de aying to l+ l− produ es opposite harge leptons with invariant mass\nml+ l− ≃ MZ ′ with a ross se tion enhan ement from the on-shell Z ′ propagator, and thus the signal\nis quite easy to see. On the ontrary, E + E − , E ± N produ tion is di\u001berent be ause (i) the ross se tion\ndoes not have su h an enhan ement, and (ii) the dilepton invariant mass distribution is broader, and\ndileptons produ ed at high invariant mass are rare.\n70\n\n\fheavy triplet signal, due to the large LFV ba kgrounds. This\nwith a simple\nafter sele tion\n\nan be easily understood\n\nounting argument. As we will \u001cnd in the following, the SM ba kground\nuts is mainly\n\nonstituted by\n\ntt̄nj\n\n(and similar pro esses involving\n\nWW\n\nZ ∗ /γ ∗ nj produ tion, with the latter being two times larger than the former.\nW W de ays give e+ e− , μ+ μ− and e± μ∓ \u001cnal states in the ratio 1 : 1 : 2, while\nZ ∗ /γ ∗ nj gives approximately an equal number of e+ e− and μ+ μ− \u001cnal states (up to\n+ +\n+ −\n± ∓\ndi\u001berent dete tion e\u001e ien ies). Then, the e e , μ μ and e μ\nomponents of the\nde ay) and\n\nSM ba kground are approximately\n\nBee =\nOn the other hand,\n\ne± μ∓\n\n5\nB,\n12\n\nBμμ =\n\n5\nB,\n12\n\n1\nBeμ = B .\n6\n\n(87)\n\nsignals are only possible if the triplet simultaneously\n\nto the ele tron and muon. LFV signals are largest when\n\nVeN = VμN ,\n\nouples\n\ne+ e− ,\n1 : 1 : 2, the\n\nso that the\n\nμ+ μ−\n\nand\n\ntotal\n\nross se tion being independent of the triplet mixing. Then, in a maximally LFV\n\ne± μ∓\n\nsignals are produ ed with\n\ns enario\n\nwhere\none\n\nS\n\n1\nSee = S ,\n4\n\nross se tions in the ratio\n\n1\nSμμ = S ,\n4\n\nis also the signal in the lepton \u001davour\n\nonsidered here.\n\nstatisti al signi\u001c an e\n\nA straightforward\n\n√\n\nS/ B\n\n1\nSeμ = S ,\n2\nonserving (LFC)\n\n(88)\nase, whi h is the\n\nal ulation shows that after\n\nof the di\u001berent\n\nombining the\n\nhannels, in a LFV s enario the signal\n\nan be seen with a signi\u001c an e at most 1.34 times larger than in a LFC one.\nhave done for the analysis of other\nand muons. Our pre-sele tion\n\n(i) two opposite\n\n10\n\nAs we\n\nhannels, we will sum \u001cnal states with ele trons\n\nriteria are:\n\nharge leptons with\n\npT > 30 GeV and an invariant mass larger than\n\n200 GeV;\n(ii) four jets with\n\npT > 20\n\nGeV.\n\nThe number of events at this level of event sele tion is\n\nolle ted in Table 26.\n\nlike-sign dilepton \u001cnal states, ba kgrounds involving extra neutrinos\n\nAs in\n\nan be redu ed\n\nby requiring small missing energy. Additionally, the re onstru tion of the two heavy\nstates\n\nan be done in the same way as in the like-sign dilepton \u001cnal state of the previous\n\nsubse tion, and the re onstru ted invariant masses for the signal are very similar to\nthose obtained there. The sele tion\n\nriteria used for the analysis are:\n\n10 In\n\nthe LFC ase we onservatively sum all dilepton ba kgrounds to take all possible triplet ouplings into a ount. A triplet with a de\u001cnite oupling will not ontribute to all \u001cnal states, and in\nthis ase the statisti al signi\u001c an e of the signals will be slightly better.\n\n71\n\n\fPre-sele tion\n\nSele tion\n\n184.9\n\n98.9\n\n214.2\n\n112.7\n\n5.0\n\n0.2\n\n7.7\n\n0.4\n\nE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\nTable 26:\n\nNumber of events for the\n\nluminosity of 30 fb\n\n−1\n\ntt̄nj\ntW\nW W nj\nZ ∗ /γ ∗ nj\n\nl+ l− jjjj\n\nSele tion\n\n18017\n\n762.4\n\n1180\n\n53.8\n\n784.5\n\n40.6\n\n6330\n\n1966.8\n\nsignals and main ba kgrounds for a\n\n.\n0.20\n\n0.4\nΣ (T1)\nΣ (T2)\nSM Bkg\n\n0.3\n\nEvents (normalised)\n\nEvents (normalised)\n\nPre-sele tion\n\n0.2\n\n0.1\n\n+ −\n\nΣ (T1)\nΣ (T2)\nSM Bkg\n\n0.15\n\n0.10\n\n0.05\n\n+ −\n\nl l jjjj\n\nl l jjjj\n\n0\n\n0\n\n0\n\n100\n\n50\n\n200\n\n150\n\np⁄ T\n\n200\n\n300\n\n400\n\n600\n\n500\n\nl\n\n0.10\nΣ (T1)\nΣ (T2)\nSM bkg\n\n0.06\n\n0.04\n\n+ −\n\n0.02\n\n50\n\n100\n\n150\n\nmj\n\n200\n\n0.06\n\n0.04\n\n0\n\n300\n\n250\n\n+ −\n\n0.02\n\nl l jjjj\n\n0\n\nΣ (T1)\nΣ (T2)\nSM bkg\n\n0.08\n\nEvents (normalised)\n\n0.08\n\nEvents (normalised)\n\n100\n\npT1\n\n0.10\n\n0\n\n0\n\nl l jjjj\n\n0\n\nj\n\n1 2\n\n50\n\n100\n\n150\n\nmj\n\n200\n\n250\n\n300\n\nj\n\n3 4\n\nFigure 37: Up, left: normalised missing energy distribution of the SM ba kground and\nthe fermion triplet signals in\n\nl+ l− jjjj\n\ntransverse momentum of the leading\n\n\u001cnal states at pre-sele tion level.\nharged lepton.\n\nUp, right:\n\nDown: dijet invariant masses\n\nre onstru ting the bosons de aying hadroni ally.\n\n(i) missing energy\n(ii) the leading\n\n6pT < 30\n\nGeV;\n\nharged lepton\n\nl1\n\n(iii) the two-jet invariant masses\n\nmust have transverse momentum\n\nmj1 j2\n\nand\n\nmj3 j4 ,\n\nplT1 > 100\n\nwhi h re onstru t the\n\nbosons de aying hadroni ally, must be both within 50 and 150 GeV.\n\n72\n\nGeV;\n\nW/Z/H\n\n\fThe kinemati al distributions of these variables are presented in Fig. 37. The missing\nenergy\n\nut requirement greatly redu es the\n\nrequire an energeti\n\ntt̄nj\n\nba kground, being also\n\nlepton. Unfortunately, these\n\nonvenient to\n\nuts also remove most of the signal\n\nin s enario T2, although in T1 it is pra ti ally una\u001be ted.\nDue to the large ba kground, the peaks in the re onstru ted mass distributions\nprodu ed by the signal are small. They are shown in Fig. 38, for the two states\n\nΣ2\n\ninvolving the leading and sub-leading\n\n200\nSM bkg + Σ (T1)\nSM bkg\n\nSM bkg + Σ (T1)\nSM bkg\n150\n\nEvents / 10 GeV\n\n150\n\nEvents / 10 GeV\n\nand\n\nharged leptons, respe tively.\n\n200\n\n100\n\n50\n\n100\n\n50\n\n+ −\n\n+ −\n\nl l jjjj\n0\n\nΣ1\n\n0\n\n100\n\n200\n\n300\n\nrec\n\nmΣ\n\nFigure 38:\n\nmre\nΣ1\n\n400\n\n500\n\n600\n\nl l jjjj\n0\n\n700\n\n0\n\n200\n\n100\n\n(left) and\n\n300\n\nrec\n\nmΣ\n\n1\n\nmre\nΣ2\n\n400\n\n500\n\n600\n\n700\n\n2\n\n(right) distributions for the SM and the SM plus the\n\nfermion triplet signal in s enario T1 at the sele tion level. The luminosity is 30 fb\n\n−1\n\n.\n\nThe signi\u001c an e of the peaks is moderate. We sele t the peak regions\n\n260 < mre\nΣ1 < 340\n\nGeV ,\n\n260 < mre\nΣ2 < 340\n\nGeV ,\n\n(89)\n\nand give in Table 27 the number of signal and ba kground events, as well as the\nluminosity needed to have\n\n5σ\n\nsigni\u001c an e, if:\n\n(a) the ba kground normalisation is\n\nnegle ted, and (b) if ba kground is determined from o\u001b-peak data. The \u001crst\n\nase is\n\nunrealisti , be ause typi al normalisation un ertainties are of the order of 20%, and\nimportant in this \u001cnal state where the ba kground is large. In\nhas to be normalised from data, the o\u001b-peak signal\n\nase that the ba kground\n\nontributions will be taken as part\n\nof the ba kground and so the peak signi\u001c an e de reases.\nAlternatively, one\nevents in this\n\nase is\n\nthe signal signi\u001c an\n\nan perform simultaneous\n\nuts on\n\nmre\nΣ1\n\nand\n\nmre\nΣ2 .\n\nThe number of\n\nS = 160.1, B = 265.0. Assuming a 20% ba kground un ertainty,\n−1\ne is 2.88σ for 30 fb , and the ex ess of events does not rea h\n\ndis overy signi\u001c an e even for mu h larger integrated luminosities be ause of the ba kground systemati\n\nun ertainty. Of\n\nourse, kinemati al\n\n73\n\nuts\n\nan be optimised for given\n\n\fCase (a)\n\nT1 ( ut on\nT1 ( ut on\n\nmre\nΣ1 )\nmre\nΣ2 )\n\nCase (b)\n\nS\n\nB\n\nL\n\n171.0\n\n681.5\n\n17.4 fb\n\n178.7\n\n548.3\n\n12.9 fb\n\nS\n\nB\n\nL\n\n−1\n\n78.1\n\n774.4\n\n−1\n95 fb\n\n−1\n\n78.8\n\n648.2\n\n−1\n78 fb\n\nTable 27: Number of signal (S ) and ba kground (B ) events in the\n(de\u001cned in the text) for 30 fb\nthe\n\n+ −\n\nl l jjjj\n\nE, N\n\n−1\n\n, and luminosity\n\nL\n\nmre\nE\n\nrequired to have a\n\nand\n\n5σ\n\nmre\nN\n\npeaks\n\ndis overy in\n\n\u001cnal state.\n\nmasses, additional variables\n\nan be used and a likelihood method\n\nan improve the\n\nanalysis, but the dis overy potential is expe ted to remain below the other\n\nhannels.\n\n6.9 Final state l± jjjj\nWe \u001cnally turn our attention to signals with only one\n\nharged lepton, whi h\n\nan be\n\nprodu ed in the de ays\n\nE + N → ν̄W + l∓ W ± ,\n\nW → q q̄ ′\n\nE + N → l+ Z/H νZ/H ,\n\n(Br = 1.28 × 10−1) ,\n\nZ → q q̄ ′ /ν ν̄, H → q q̄\n\nE + E − → l+ Z/H νW − ,\n\nZ → q q̄/ν ν̄, H → q q̄, W → q q̄ ′\n\nE + E − → ν̄W + l− Z/H ,\n\nZ → q q̄/ν ν̄, H → q q̄, W → q q̄ ′\n\n(Br = 1.82 × 10−1) ,\n\n(Br = 1.52 × 10−1) ,\n\n(Br = 1.52 × 10−1) ,\n\n(90)\n\nand thus bene\u001ct from a large bran hing ratio. Nevertheless, ba kgrounds are very large\nas well. We\n\n(i) one\n\non entrate on \u001cnal states with four jets, asking as pre-sele tion\n\nharged lepton with\n\nplT > 30\n\nGeV and missing energy\n\nmust have a transverse mass\n\nMT2 ≡ 2plT 6pT (1 − cos φT ) > (200\nwhere\n\nφT\n\nGeV)\n\nis the angle in the transverse plane between the\n\n2\n\np6 T > 50\n\nriteria:\n\nGeV, whi h\n\n,\n\n(91)\n\nharged lepton and the\n\nmissing energy;\n(ii) four jets with\n\npT > 20\n\nGeV, and no\n\nb-tagged\n\njets.\n\nThe number of signal and ba kground events ful\u001clling these\nTable 28. The\nthe\n\nriteria are gathered in\n\nut on transverse mass is performed to redu e ba kgrounds in whi h\n\nharged lepton and neutrino result from a\n74\n\nW\n\nboson de ay, su h as\n\nW nj ,\n\nfor whi h\n\n\fE + E − (T1)\nE ± N (T1)\nE + E − (T2)\nE ± N (T2)\ntt̄nj\n\nPre-sele tion\n\nSele tion\n\n188.5\n\n109.8\n\n443.7\n\n262.9\n\n26.9\n\n11.2\n\n64.4\n\n28.1\n\n3678.7\n\n1204.2\n\nTable 28: Number of events for the\n\nPre-sele tion\n\nSele tion\n\n440.7\n\n171.6\n\n15146\n\n5538\n\n455.9\n\n161.4\n\n661.7\n\n200.8\n\ntW\nW nj\n∗\nZ /γ ∗ nj\nW W nj\n\nl± jjjj\n\nsignals and main ba kgrounds for a lumi-\n\n−1\nnosity of 30 fb .\n\nMT < MW .\nbe\n\nompletely removed, and dominates due to its huge\n\nout that\nwhi h\nis\n\nHowever, due to energy mismeasurements the\n\ntt̄nj\n\n4/5 of the W nj\n\nba kground\n\nW nj\n\nba kground\n\nannot\n\nross se tion. We also point\n\nomes from parton-level multipli ities\n\nn = 0, 1, 2,\n\nontribute to four jet \u001cnal states due to pile-up. The se ond largest ba kground\nin the dilepton de ay\n\nhannel, with one\n\nW\n\nboson de aying into a\n\nτ\n\nwhi h\n\nsubsequently de ays hadroni ally, or de aying into an ele tron or muon whi h is missed\nby the dete tor. This ba kground is also redu ed by the requirement of no\nEvents\n\nb\n\ntags.\n\nan be re onstru ted as in the dilepton \u001cnal states but repla ing the se ond\n\nlepton by the missing momentum ve tor (taking the third\n\nomponent equal to zero).\n\nThe dijet invariant mass distributions are very similar. As sele tion\n\nriteria we impose\n\nthat:\n\n(i) The\n\nharged lepton must have transverse momentum\n\n(ii) The two-jet invariant masses\n\nmj1 j2\n\nand\n\nmj3 j4\n\nplT > 100\n\nGeV.\n\nwhi h re onstru t the\n\nW/Z/H\n\nbosons de aying hadroni ally must be both within 50 and 150 GeV.\n\nThe number of events after sele tion are given in Table 28.\nheavy lepton re onstru ted masses\njets) and\n\nmΣ2\n\nmΣ1\n\n( orresponding to the\n\nFor\n\nompleteness, the\n\nharged lepton plus two\n\n(formed with the missing energy and the other two jets) are presented in\n\nFig. 39 for the two s enarios, without ba kground. While the re onstru tion of\n\nΣ1\n\nis\n\nstill very good, the re onstru tion of the other state from missing energy and two jets\ngives a distribution mu h wider. The small bumps\n\naused by the presen e of the signal\n\nwould be very di\u001e ult to spot over the ba kground if this is not theoreti ally predi ted\nwith a good a\n\nura y, as it is apparent from Fig. 39 (down), and the signi\u001c an e is\n\ndi\u001e ult to estimate without a detailed al ulation of the ba kground un ertainty, whi h\n\n75\n\n\f70\n\n35\n\nΣ (T1)\nΣ (T2)\n\nΣ (T1)\nΣ (T2)\n\n30\n\n50\n\nEvents / 10 GeV\n\nEvents / 10 GeV\n\n60\n\n40\n30\n20\n\n25\n20\n15\n10\n\n±\n\n10\n0\n\n±\n\nl jjjj\n\n0\n\n200\n\n100\n\n300\n\nrec\nmΣ\n1\n\n400\n\n500\n\n600\n\n0\n\n700\n\n100\n\n200\n\n300\n\nrec\n\n400\n\n500\n\n700\n\n600\n\n2\n\n700\nSM bkg + Σ (T1)\nSM bkg\n\nSM bkg + Σ (T1)\nSM bkg\n\n600\n\nEvents / 10 GeV\n\n500\n\nEvents / 10 GeV\n\n0\n\nmΣ\n\n600\n\n400\n300\n200\n\n500\n400\n300\n200\n\n±\n\n±\n\nl jjjj\n\n100\n0\n\nl jjjj\n\n5\n\n0\n\n200\n\n100\n\n300\n\nrec\n\nmΣ\n\n400\n\n500\n\n600\n\nl jjjj\n\n100\n0\n\n700\n\n0\n\n100\n\n200\n\n300\n\nrec\n\nmΣ\n\n1\n\n400\n\n500\n\n600\n\n700\n\n2\n\nFigure 39: Up: Re onstru ted triplet masses in s enarios T1 and T2, without ba kground, in the\n\nl± jjjj\n\n\u001cnal state at the sele tion level. Down: re onstru ted masses\n\nwith ba kground, in s enario T1. The luminosity in all\n\n−1\nases is 30 fb .\n\nis beyond the s ope of this work. The number of events in the peak regions\n\n260 < mre\nΣ1 < 340\nre\n\n200 < mΣ1 < 400\nis\n\nS = 232.4, B = 1328.0\n\nfor 30 fb\n\n−1\n\nun ertainty is negle ted, but less than\nimprovements\nexpe ted that\n\n.\n\nGeV ,\nGeV ,\n\nThis amounts to\n\n1σ\n\n(92)\n\n6.3σ\n\nif the ba kground\n\nif a 20% un ertainty is assumed.\n\nFurther\n\nan be made optimising the analysis with a likelihood method, and it is\n\n3σ\n\nould be rea hed for 30 fb\n\n−1\n\n.\n\n6.10 Outlook\nFermion triplet produ tion\n\npp → E + E − , E ± N\n\nleads to a plethora of possible \u001cnal\n\nstate signatures after the heavy leptons de ay\n\nE ± → νW ± / E ± → l± Z / E ± → l± H ,\n\nN → l− W + / N → l+ W − / N → νZ / N → νH ,\n76\n\n(93)\n\n\fand the\n\nW, Z\n\nand\n\nH\n\nbosons de ay to hadrons or leptons. In this se tion we have studied\n\nthe fermion triplet signals\nlepton multipli ity.\n\nlassifying the experimental signatures by their\n\nSome \u001cnal states are\n\nhara teristi\n\n+\n\nE E\n\nof\n\n−\n\n,\n\n±\n\nE N\n\nharged\n\nprodu tion\n\nand are not present in other seesaw s enarios, namely\n\n•\n\nSix lepton \u001cnal states\n\n•\n\nFive lepton \u001cnal states\n\n•\n\nFour leptons\n\n•\n\nThree like-sign leptons\n\nl± l± l± l∓\n\nwith total\n\nharge\n\nQ = ±2\n\nl± l± l±\n\nThe six lepton signal has a too small bran hing ratio to be useful. The signals with \u001cve\nleptons and three like-sign leptons are small but\nof 30 fb\n\n−1\n\nin the\n\nor muon. The\n\nase of a triplet mass\n\nQ = ±2\n\nould be observed with a luminosity\n\nmE,N = 300 GeV,\n\nfour lepton signal is more interesting, and it\n\nwith half the luminosity. Additionally, in this\n\nhannel the\n\nas a three-lepton invariant mass, providing eviden e for\nluminosities, the opening angle distribution\nFinal states\n\noupling to either the ele tron\n\nE\n\nE\n\nmass\n\nl+ l+ l− l−\n\nFour leptons\n\n•\n\nThree leptons\n\n•\n\nTwo like-sign leptons\n\n•\n\nTwo opposite sign leptons\n\n•\n\nOne lepton\n\nprodu tion. For mu h larger\n\nan be tested as well.\n\nwith total\n\nharge\n\nQ=0\n\nl± l± l∓\n\nAmong these, the \u001crst two \u001cnal states are very interesting. The\n\n5σ\n\nan be re onstru ted\n\nommon to seesaw II signals are\n\n•\n\nprovide\n\nould be observed\n\n−1\neviden e already with 6 fb\nfor a triplet with\n\nto the ele tron or muon. Moreover, the\n\nE\n\nin a three-lepton invariant mass, providing\nopening angle distribution\n\nan be\n\nmass\n\nmE,N\n\nl+ l+ l− l− signal an\n= 300 GeV, oupling\n\nan be re onstru ted as a sharp peak\n\nE produ\n± ± ∓\nThe l l l\n\nlear eviden e for\n\nlearly re onstru ted.\n\nbetter dis overy potential: for the same triplet parameters it\n\n−1\nthan 3 fb . Additionally, it provides eviden e for\n\nN\n\ntion, and the\n\nE\n\nsignal has even\n\nan be dis overed with less\n\nprodu tion, whose mass\n\nan be\n\nre onstru ted (in \u001cnal states with two additional jets) from two opposite sign leptons\nplus the missing energy, the resulting distribution displaying a sharp peak at\n\n77\n\nmN .\n\nThese\n\n\ftwo signals\n\nan be\n\nleanly distinguished from seesaw II signals by (i) the analysis of\n\nthe like-sign dilepton invariant mass distribution, and (ii) the\n\nE, N\n\nre onstru ted mass\n\ndistributions. We also point out that if heavy neutrino triplets are not Majorana but\n(quasi-)Dira\n\nparti les, the trilepton \u001cnal state is the most interesting one as well [64℄.\n\nThe like-sign dilepton \u001cnal state has been\n\nonsidered in previous literature [18,37℄ as\n\nthe most important triplet signal. We have found that its dis overy potential equals the\none of the\n\nl± l± l∓ .\n\nThe invariant mass of the heavy states\n\nan be re onstru ted in \u001cnal\n\nstates with four additional jets, giving eviden e for the produ tion of two resonan es\nwith equal mass. Their nature, however,\n\nannot be established be ause the jet harge is\n\nvery di\u001e ult to measure. Apart from the mass re onstru tion, the fermion triplet signal\nin this \u001cnal state\n\nan be distinguished from s alar triplet produ tion by the dilepton\n\ninvariant mass and also by the presen e of additional jets.\n\nHeavy neutrino singlet\n\nprodu tion also leads to like-sign dilepton signals, but with smaller jet multipli ity and\nsmaller dilepton invariant mass in general.\nThe\n\nl+ l−\n\n\u001cnal state is very demanding, and in order to make the ba kgrounds man-\n\nageable four hard jets are required in addition to the harged leptons. Still, ba kgrounds\nare very large, in parti ular from\ntion\n\nZ ∗ /γ ∗ nj\n\nand\n\ntt̄nj\n\nan be performed as in the like-sign dilepton\n\nprodu tion. The mass re onstru -\n\nhannel to redu e ba kgrounds, but\n\nstill the signal is very di\u001e ult to observe unless the ba kground un ertainty (theoretial, as well as from the luminosity and dete tor e\u001be ts) is under very good\nontrast with re ent\n\nontrol. In\n\nlaims [37℄ (and in agreement with previous literature [29℄), we\n\ne± μ∓ \u001cnal states represents little improvement. In a maximally LFV s enario with VeN = VμN , the improvement in the signal\n√\nsigni\u001c an e S/ B is of only 30% over a LFC s enario with VeN = 0 or VμN = 0. This\n± ∓\nis due to the large tt̄nj ba kground, whi h gives e μ \u001cnal states in the dilepton de ay\n\nhave found that looking for expli itly LFV\n\nhannel.\nFinally, signals with only one\n\nharged lepton su\u001ber large ba kgrounds from all sort\n\nof SM pro esses, even if one requires four hard jets and large missing energy in the\nevents. The ba kground with the largest\n\nross se tion is\n\nW nj ,\n\nand it\n\nannot be fully\n\nremoved as suggested in Ref. [37℄ by the use of the transverse mass between the harged\nlepton and the missing momentum.\n\ntt̄nj\n\nsour e of ba kground, when one of the\ndete tor. This ba kground\n\nin the dilepton de ay\n\nharged leptons is a tau or it is missed by the\n\nannot be removed with transverse mass\n\npresen e of at least two neutrinos from di\u001berent\nand invariant mass\n\nhannel is another large\n\nW\n\nuts be ause of the\n\nde ays. After event re onstru tion\n\nuts the signi\u001c an e of the signals is below\n\n1σ , but\n\nan be\n\nertainly\n\nimproved if a more sophisti ated analysis is used, whi h is beyond the s ope of this\nstudy.\n\n78\n\n\f7\n\nCon lusions\n\nIn this paper we have\n\nlassi\u001ced and studied possible multi-lepton signals of seesaw\n\nmessengers at LHC, namely heavy neutrino singlets (seesaw I), s alar triplets (seesaw\nII) and fermion triplets (seesaw III). For seesaw II s enarios we have assumed that the\ntriplet vev\n\nv∆\n\nis small, so that dilepton hannels dominate the de ay of the new s alars.\n\nAlthough this may not ne essarily be the\nthat the triplet Yukawa\n\nase it is a plausible assumption, provided\n\nouplings to the harged leptons are not mu h smaller than the\n\nsmallest of the SM Yukawa\n\nouplings to the Higgs boson. For seesaw III s enarios we\n\nhave assumed that the mixing between the light and heavy se tors is not unnaturally\nsuppressed, so that the triplet de ays to leptons plus gauge or Higgs bosons dominate.\nWe have set a relatively low s ale for the new states, 100 GeV for heavy neutrino\nsinglets and 300 GeV for s alar and fermion triplets.\nmasses would allow a dis overy with the \u001crst few fb\n\n−1\n\nFor the latter two\nof LHC data.\n\nSeesaw signals involve multi-lepton produ tion, thus an adequate\nin terms of\n\nases, su h\n\nharged lepton multipli ity. This is also very\n\nlassi\u001c ation is\n\nonvenient in terms of the\n\nexperimental sear hes. Although some of the signals involve the produ tion of extra\nquarks, further dis rimination by using jet multipli ity is di\u001e ult, be ause the\nsponden e between the number of quarks at the partoni\n\norre-\n\nlevel and the number of jets\n\nmeasured in the dete tor is not univo al, due to radiation and pile-up.\nNine di\u001berent \u001cnal states have been studied, involving up to six\n\nharged leptons.\n\nAn important feature of our analysis is that for ea h \u001cnal state all signal\n\nontributions\n\nhave been in luded, within a given s enario. For heavy neutrino produ tion we have\nused the\n\nAlpgen\n\nextension in Ref. [29℄, while for s alar and fermion triplet produ tion\n\nwe have developed a Monte Carlo generator\n\nTriada.\n\nFor s alar triplet produ tion a\n\nrealisti assessment of the dis overy potential must in lude s alar de ays to tau leptons,\nespe iallly for NH where they are dominant, and the subsequent tau de ay. In the\nof fermion triplet produ tion, generating all signal\n\nontributions is involved. For\n\nase\n\n+\n\nE E−\n\nprodu tion there are 289 di\u001berent \u001cnal states with 128 di\u001berent matrix elements, and\nfor\n\nE ±N\n\nthere are 748 \u001cnal states with 72 matrix elements. Ba kgrounds have been\n\ngenerated with\nshower Monte\n\nAlpgen. Signals and ba kgrounds have been passed through the partonCarlo Pythia to add initial and \u001cnal state radiation and pile-up, and\n\nperform the hadronisation of \u001cnal state quarks and gluons. Finally, a fast simulation\nof the dete tor has been used.\nWe have found that generating the\ntion or de ay\n\nomplete signals and not just parti ular produ -\n\nhannels is essential, be ause for s alar and fermion triplet produ tion\n\nmost \u001cnal states have\n\nontributions from several\n\n79\n\nompeting de ay\n\nhains. For instan e,\n\n\fin s alar triplet produ tion the most interesting \u001cnal state is the one with three harged\nleptons\n\n±±\n\n∆\n\n∓\n\n∆\n\nl± l± l∓ ,\n\nwhi h re eives important\n\nprodu tion pro esses.\n\nE N\n\nand\n\nFor fermion triplet produ tion this \u001cnal state is the\n\nmost interesting one as well, and it re eives\n\n±\n\n∆++ ∆−−\n\nontributions from both the\n\nprodu tion. Moreover, in general de ay\n\nontributions from 8 de ay\n\nhannels in\n\nhannels with larger lepton multipli ities\n\nontribute to signals with a smaller number of leptons when one or more of them are\nmissed by the dete tor.\nThe most relevant features of the signals studied have been outlined in se tions 4.3,\n5.6 and 6.10, and we refer the reader to those se tions for a brief outlook. Table 29\nsummarises the possible signals whi h appear in ea h of the seesaw (I, II and III) s enarios studied, with the luminosity required to dis over them. In seesaw I we only give\nthe numbers for a heavy neutrino\n\noupling to the muon. For seesaw II we give values\n\nfor both NH and IH, while for seesaw III we in lude results for a triplet\n\noupling to the\n\nele tron (for a muon the sensitivity is expe ted to be very similar). We also indi ate\nwhether the mass of the new parti les\n\nan be re onstru ted, whi h gives an additional\n\neviden e for the signal. For seesaw I the dis overy luminosities indi ated are rather\nonservative be ause the analysis is not optimised, to keep\n\nonsisten y with seesaw II\n\nand III, and, sin e heavy neutrino signals are mu h harder to see, the improvements\nare expe ted to be more signi\u001c ant in this\n\nase.\n\nIn this work we have made spe ial emphasis on the dis rimination of the di\u001berent\nseesaw models if a positive signal is observed. Table 29 shows that, if a positive signal\nis found, it should be possible to identify whether it\n\norresponds to heavy neutrinos,\n\ns alar/fermion triplets, or other new physi s, by analysing the di\u001berent\n\nhannels and\n\nperforming the mass re onstru tion. For larger luminosities the study of produ tion\nangular distributions is possible, as it has been shown in several \u001cnal states for s alar\nand fermion triplet signals. A rough estimate of the LHC dis overy rea h\n\nan be made\n\nby applying a simple res aling of the results presented, obtaining that s alar triplets\nan be dis overed up to 600 GeV (800 GeV) for NH (IH) with a luminosity of 30 fb\nA fermion triplet\n\noupling to the ele tron or muon\n\n−1\n\n.\n\nan be dis overed up to 750 GeV\n\nwith the same luminosity. For neutrino singlets the more detailed results of Ref. [29℄\nan be res aled with the new upper bounds\nthat a heavy neutrino\nif it\n\n|VeN |2 ≤ 0.0030, |VμN |2 ≤ 0.0032, to obtain\n\noupling to the ele tron\n\nan be dis overed up to 120 GeV, and\n\nouples to the muon up to 155 GeV. These results are\n\nin Table 29 be ause for larger\n\nmN\n\nonsistent with the ones\n\nthe heavy neutrino signals\n\nan be separated from\n\nthe ba kground more easily, and also be ause the analysis in Ref. [29℄ is mu h more\nsophisti ated.\nNew intera tions, whi h\n\nould lead to new pro esses in addition to the ones dis-\n\n80\n\n\fSeesaw I\n\nmN = 100\n\nSeesaw II\n\nm∆ = 300\n\nGeV\n\nSix leptons\n\n\u0015\n\n\u0015\n\nFive leptons\n\n\u0015\n\n\u0015\n\nl± l± l± l∓\n\n\u0015\n\n\u0015\n\nl+ l+ l− l−\n\n\u0015\n\nl± l± l∓\n\n< 180\n\nl l l\n\nl± l±\n\nl±\n\n×\n\nmE\n\nre\n\n7 fb\n\nmE\n\nre\n\n−1\n\nre\n\n−1\n30 fb\n\n3.6 / 0.9 fb\n\n−1\n\nm∆++\n\n< 180 fb\nmN re\n×\n\n−1\n15 fb\n\n\u0015\nfb\n\nGeV\n\n−1\n28 fb\n\nm∆++\n\n−1\n\nl+ l−\n\nmΣ = 300\n×\n\nGeV\n\n−1\n19 / 2.8 fb\n\n\u0015\n\n± ± ±\n\nSeesaw III\n\n−1\n\n2.5 fb\n\nmN\n\nre\n\n17.4 / 4.4 fb\n\nm∆++\n\n−1\n\n15 / 27 fb\n\nre\n\n1.7 fb\n\nmΣ\n\nre\n\n−1\n\n−1\n\n−1\n\nre\n\n−1\n80 fb\n\nm∆ re\n×\n\nmΣ re\n×\n\nTable 29: Summary of the \u001cnal states studied for ea h seesaw s enario. A dash indi ates\nthat a given \u001cnal state is not present. A\nbut it\n\nross indi ates that the signal is produ ed\n\nannot be seen, either be ause it is too small or be ause the ba kground is too\n\nlarge. In ea h\n\nase we in lude the luminosity required for dis overy for the parameters\n\nassumed, also indi ating when the heavy mass(es)\n\nan be re onstru ted. For seesaw II\n\nwe give the results for NH and IH.\n\nussed here, have not been\n\nonsidered in this work. It is interesting to dis uss brie\u001dy,\n\nwithout a detailed simulation of those signals, how one might in prin iple distinguish\nsome of these s enarios from the ones studied here. In models with left-right symmetry\nheavy neutrino singlets\n\nan be produ ed through\n\ns-\n\nhannel\n\nW ′ (WR )\n\nex hange [39\u001542℄\n\nq q̄ ′ → W ′ → lN .\n\n(94)\n\nThis pro ess gives the same dilepton and trilepton \u001cnal states as\n\nW\n\nex hange but\n\nwith large transverse momenta, whi h are not possible without new intera tions. Four\nand \u001cve lepton signals are not produ ed. The\n\nW′\n\ntransverse mass\n\nmati ally re onstru ted [41, 42℄. A relatively light leptophobi\n\nould also be kine-\n\nZλ′ boson\n\nan produ e\n\nneutrino pairs in the pro ess [43℄\n\nq q̄ → Zλ′ → NN .\n81\n\n(95)\n\n\fThe\n\nE\n\nl± l±\n\nand\n\nl± l± l∓\n\nsignals would be similar to the ones of a fermion triplet, but the\n\nre onstru tion in four lepton \u001cnal states (from three\n\nharged leptons) would be a\n\n′\nlear indi ation for fermion triplet produ tion, and in Zλ\nbe re onstru ted. New gauge bosons might also\n\n→ NN\n\nthe\n\nZ′\n\nmass\n\nould\n\nontribute to the produ tion of s alar\n\nand fermion triplets, and their presen e would be seen by examining the invariant mass\ndistribution of all the produ ed parti les.\n\nBesides, it is likely that new intera tions\n\nwould be observed in other produ tion pro esses not involving seesaw messengers.\nFinally, it is worth mentioning that, sin e this study has been done at the level of\na fast dete tor simulation, we have not addressed\n\nharge misidenti\u001c ation. Its e\u001be t\n\nmay be important in like-sign dilepton \u001cnal states, be ause the\nprodu tion at LHC is very large.\n\nl± l± l∓ ,\n\nross se tion for\n\nZ ∗ /γ ∗\n\nHowever, for \u001cnal states with more leptons, e.g.\n\nwhi h are the most interesting ones in terms of dis overy potential, its impa t\n\nin the \u001cnal results is expe ted to be small.\n\nHen e, our results are not expe ted to\n\nhange dramati ally with a full dete tor simulation, whi h must anyway be performed\nto\n\non\u001crm them and to\n\nompare with real data.\n\nA knowledgements\nThis work has been supported by MEC proje t FPA2006-05294 and Junta de Andalu ía\nproje ts FQM 101, FQM 437 and FQM03048. The work of J.A.A.S. has been supported\nby a MEC Ramón y Cajal\n\nA\n\nontra t.\n\nFeynman rules\n\nWe give here the Feynman rules used in our matrix element\n\nal ulations.\n\nFor LNV\n\npro esses we use the method in Ref. [101℄, whi h allows to use standard propagators\navoiding to introdu e expli itly the\n\nharge\n\nonjugation matrix in the Feynman rules.\n\nWith these pres riptions, the resulting Feynman rules are espe ially useful for their\nimplementation in Monte Carlo generators.\n\nThe rules for propagators are the usual\n\nones, and external legs are taken following the \u001dow de\u001cned in the fermion lines. More\ndetails\n\nan be found in Ref. [101℄.\n\n82\n\n\fWμ\n\nWμ\n\n−igγ μ\nE\n\n−igγ μ\n\nN\n\nE\n\nZμ\n\nN\nAμ\n\nigcW γ μ\nE\n\nieγ μ\n\nE\n\nE\n\nE\n\nTable 30: Feynman rules for heavy fermion triplet gauge intera tions.\n\nWμ\n\nWμ\n\nig\n− √ VlN γ μ PL\n2\nN\n\nig ∗ μ\n− √ VlN\nγ PL\n2\nN\n\nl\nWμ\n\nl\nWμ\n\nig\n√ VlN γ μ PR\n2\nN\n\nig ∗ μ\n√ VlN\nγ PR\n2\nN\n\nl\nZμ\n\nZμ\n\n−η\n\nig μ\n∗\nγ (VlN PL − VlN\nPR )\n2cW\n\nνl\n\nN\n\nig μ ∗\nγ (VlN PL − VlN PR )\n2cW\n\n−η\n\nigmN\n(V ∗ PL + VlN PR )\n2MW lN\n\nH\n\n−η\n\nTable 31:\n\n−η\nνl\n\nN\n\nH\n\nN\n\nl\n\nigmN\n(V ∗ PL + VlN PR )\n2MW lN\n\nνl\n\nN\n\nνl\n\nFeynman rules for heavy neutrino singlet (η\n\n= 1)\n\nand triplet (η\n\nintera tions with SM fermions. The fermion \u001dow is indi ated with an arrow.\n\n83\n\n= −1)\n\n\fWμ\n\nWμ\n∗ μ\n−igVlN\nγ PR\n\n−igVlN γ μ PR\n\nνl\n\nE\n\nνl\n\nE\n\nZμ\n\nZμ\n\nig\n√\nVlN γ μ PL\n2cW\nE\n\nig\n∗ μ\n√\nVlN\nγ PL\n2cW\nE\n\nl\n\nl\n\nH\n\nH\n\nigmE\n√\nVlN PR\n2MW\nE\n\nigmE ∗\n√\nVlN PL\n2MW\nE\n\nl\n\nTable 32: Feynman rules for heavy\n\nl\n\nharged lepton intera tions with SM fermions.\n\nWμ−\n\np1\n\nWμ+\n\n−ig(p2 − p1 )μ\n\np2\n\n∆++\n\np1\n\n∆−\n\n∆+\n\nZμ\n\nig\n(1 − 2s2W )(p2 − p1 )μ\ncW\n\np2\n\n∆++\n\np1\n\nig 2\ns (p2 − p1 )μ\ncW W\n\n∆−\n\nAμ\n\n∆++\n\n−\n\np2\n\n∆+\n\n∆−−\n\np1\n\np2\n\n∆−−\n\nZμ\n\np1\n\n−ig(p1 − p2 )μ\n\nAμ\n\ni2e(p2 − p1 )μ\n\np2\n\np1\n∆+\n\n∆−−\n\nie(p2 − p1 )μ\n\np2\n∆−\n\nTable 33: Feynman rules for heavy s alar triplet gauge intera tions.\n\n84\n\n\f∆−−\n\n∆++\n\n∗\ni2Yjk\nPR\n\ni2Yjk PL\nlj\n\nlj\n\nlk\n\nlk\n∆−\n\n∆+\n\n√\ni 2Yjk PL\nlj\n\n√ ∗\ni 2Yjk\nPR\n\nνk\n\nνk\n\nlj\n\nTable 34: Feynman rules for heavy s alar triplet Yukawa intera tions with\n\nharged\n\nleptons. The fermion \u001dow is indi ated with an arrow.\n\nReferen es\n[1℄ F. del Aguila et al.,\n\narXiv:0801.1800 [hep-ph℄\n\n[2℄ C. Amsler et al. [Parti le Data Group℄, Phys. Lett. B\n[3℄ S. Weinberg, Phys. Rev. Lett.\n\n43 (1979) 1566\n\n[4℄ I. Gogoladze, N. Okada and Q. Sha\u001c,\n[5℄ P. Minkowski, Phys. Lett. B\n\n667 (2008) 1\n\narXiv:0809.0703 [hep-ph℄\n\n67 (1977) 421\n\n[6℄ M. Gell-Mann, P. Ramond and R. Slansky, Pro eedings of the Supergravity Stony\nBrook Workshop, eds. P. van Niewenhuizen and D. Freedman (New York, 1979)\n[7℄ T. Yanagida, Pro eedings of the Workshop on the Baryon Number of the Universe\nand Uni\u001ced Theories, Tsukuba, Japan, 13-14 Feb 1979\n[8℄ R. N. Mohapatra and G. Senjanovi , Phys. Rev. Lett.\n[9℄ M. Magg and C. Wetteri h, Phys. Lett. B\n[10℄ T. P. Cheng and L. F. Li, Phys. Rev. D\n\n44 (1980) 912\n\n94 (1980) 61\n\n22 (1980) 2860\n\n[11℄ G. B. Gelmini and M. Ron adelli, Phys. Lett. B\n\n99 (1981) 411\n\n[12℄ G. Lazarides, Q. Sha\u001c and C. Wetteri h, Nu l. Phys. B\n[13℄ R. N. Mohapatra and G. Senjanovi , Phys. Rev. D\n\n85\n\n181 (1981) 287\n\n23 (1981) 165\n\n\f[14℄ R. Foot, H. Lew, X. G. He and G. C. Joshi, Z. Phys. C\n[15℄ E. Ma, Phys. Rev. Lett.\n\n81 (1998) 1171 [hep-ph/9805219℄\n\n[16℄ R. N. Mohapatra and J. C. Pati, Phys. Rev. D\n[17℄ G. Senjanovi\n[18℄ B. Baj\n\n44 (1989) 441\n\n11 (1975) 2558\n\nand R. N. Mohapatra, Phys. Rev. D\n\nand G. Senjanovi , JHEP\n\n12 (1975) 1502\n\n0708 (2007) 014 [hep-ph/0612029℄\n\n[19℄ I. Dorsner and P. Fileviez Perez, JHEP\n\n0706 (2007) 029 [hep-ph/0612216℄\n\n[20℄ B. Baj , M. Nemevsek and G. Senjanovi , Phys. Rev. D\n\n76\n\n(2007) 055011\n\n[hep-ph/0703080℄\n[21℄ P. F. Perez,\n\narXiv:0809.1202 [hep-ph℄\n\n[22℄ A. Bron ano, M. B. Gavela and E. E. Jenkins, Phys. Lett. B\n[Erratum-ibid. B\n\n636 (2006) 330℄ [hep-ph/0210271℄\n\n552\n\n[23℄ A. Abada, C. Biggio, F. Bonnet, M. B. Gavela and T. Hambye, JHEP\n061\n\n(2003) 177\n\n0712 (2007)\n\n[arXiv:0707.4058 [hep-ph℄℄\n\n[24℄ F. del Aguila, J. A. Aguilar-Saavedra, J. de Blas and M. Zralek, A ta Phys. Polon.\nB\n[25℄ A.\n\n38 (2007) 3339 [arXiv:0710.2923 [hep-ph℄℄\nDatta,\n\nM.\n\nGu hait\n\nand\n\nA.\n\nPilaftsis,\n\nPhys.\n\nRev.\n\nD 50\n\n(1994)\n\n3195\n\n[hep-ph/9311257℄\n[26℄ F. M. L. Almeida, Y. A. Coutinho, J. A. Martins Simoes and M. A. B. do Vale,\nPhys. Rev.\n\nD 62 (2000) 075004 [hep-ph/0002024℄\n\n[27℄ O. Panella, M. Cannoni, C. Carimalo and Y. N. Srivastava, Phys. Rev. D\n(2002) 035005\n\n65\n\n[hep-ph/0107308℄\n\n[28℄ T. Han and B. Zhang, Phys. Rev. Lett.\n\n97 (2006) 171804 [hep-ph/0604064℄\n\n[29℄ F. del Aguila, J. A. Aguilar-Saavedra and R. Pittau, JHEP\n\n0710\n\n(2007) 047\n\n[hep-ph/0703261℄\n[30℄ S. Bray, J. S. Lee and A. Pilaftsis, Nu l. Phys. B\n\n786 (2007) 95 [hep-ph/0702294℄\n\n[31℄ K. Huitu, J. Maalampi, A. Pietila and M. Raidal, Nu l. Phys. B\n\n[hep-ph/9606311℄\n[32℄ J. F. Gunion, C. Loomis and K. T. Pitts,\n86\n\nhep-ph/9610237\n\n487\n\n(1997) 27\n\n\f[33℄ A. G. Akeroyd and M. Aoki, Phys. Rev. D\n\n72 (2005) 035011 [hep-ph/0506176℄\n\n[34℄ A. Hektor, M. Kadastik, M. Muntel, M. Raidal and L. Rebane, Nu l. Phys. B\n(2007) 198\n\n787\n\n[arXiv:0705.1495 [hep-ph℄℄\narXiv:0803.3450\n\n[35℄ P. Fileviez Perez, T. Han, G. Y. Huang, T. Li and K. Wang,\n\n[hep-ph℄\n\n78\n\n[36℄ P. Fileviez Perez, T. Han, G. y. Huang, T. Li and K. Wang, Phys. Rev. D\n(2008) 015018\n\n[arXiv:0805.3536 [hep-ph℄℄\n\n[37℄ R. Fran es hini, T. Hambye and A. Strumia,\n\narXiv:0805.1613 [hep-ph℄\n\n[38℄ A. Abulen ia et al. [CDF Collaboration℄, Phys. Rev. Lett.\n\n98\n\n(2007) 221803\n\n[hep-ex/0702051℄\n[39℄ W. Y. Keung and G. Senjanovi , Phys. Rev. Lett.\n[40℄ A.\n\nDatta,\n\nM.\n\nGu hait\n\nand\n\nD.\n\nP.\n\nRoy,\n\n50, 1427 (1983)\n\nPhys.\n\nRev.\n\nD\n\n47\n\n(1993)\n\n961\n\n[hep-ph/9208228℄\n[41℄ A. Ferrari et al., Phys. Rev.\n\nD 62 (2000) 013001\n\n[42℄ S. N. Gninenko, M. M. Kirsanov, N. V. Krasnikov and V. A. Matveev, Phys.\nAtom. Nu l.\n[43℄ F.\n\ndel\n\n70 (2007) 441\n\nAguila\n\nand\n\nJ.\n\nA.\n\nAguilar-Saavedra,\n\nJHEP\n\n0711\n\n(2007)\n\n072\n\n[arXiv:0705.4117 [hep-ph℄℄\n[44℄ K. Huitu, S. Khalil, H. Okada and S. K. Rai,\n[45℄ E. Ma, Phys. Rev. Lett.\n\narXiv:0803.2799 [hep-ph℄\n\n86 (2001) 2502 [hep-ph/0011121℄\n\n[46℄ S. Bar-Shalom, G. Eilam, T. Han and A. Soni, Phys. Rev. D\n\n77\n\n(2008) 115019\n\n[arXiv:0803.2835 [hep-ph℄℄\n[47℄ T. Cuhadar-Donszelmann, M. K. Unel, V. E. Oz an, S. Sultansoy and G. Unel,\n\narXiv:0806.4003 [hep-ph℄\n[48℄ F. R. Joaquim and A. Rossi, Phys. Rev. Lett.\n\n97 (2006) 181801 [hep-ph/0604083℄\n\n[49℄ F. R. Joaquim and A. Rossi, Nu l. Phys. B\n\n765 (2007) 71 [hep-ph/0607298℄\n\n[50℄ M. Hirs h, S. Kaneko and W. Porod,\n\narXiv:0806.3361 [hep-ph℄\n\n87\n\n\f[51℄ M. Hirs h, M. A. Diaz, W. Porod, J. C. Romao and J. W. F. Valle, Phys. Rev. D\n\n62 (2000) 113008 [Erratum-ibid. D 65 (2002) 119901℄ [hep-ph/0004115℄\n[52℄ M. Hirs h and W. Porod, Phys. Rev. D\n[53℄ M.\n\nHirs h,\n\nA.\n\nVi ente\n\nand\n\nW.\n\n68 (2003) 115007 [hep-ph/0307364℄\n\nPorod,\n\nPhys.\n\nRev.\n\n77\n\nD\n\n(2008)\n\n075005\n\n[arXiv:0802.2896 [hep-ph℄℄\n[54℄ J. C. Romao, Nu l. Phys. Pro . Suppl.\n[55℄ J. C. Romao,\n[56℄ F.\n\ndel\n\n81 (2000) 231 [hep-ph/9907466℄\n\narXiv:0710.5730 [hep-ph℄\n\nAguila\n\nand\n\nJ.\n\nA.\n\nAguilar-Saavedra,\n\n0505\n\nJHEP\n\n(2005)\n\n026\n\n[hep-ph/0503026℄\n[57℄ F. del Aguila, J. A. Aguilar-Saavedra and R. Pittau, J. Phys. Conf. Ser.\n506\n\n53 (2006)\n\n[hep-ph/0606198℄\n\n[58℄ W. Bu hmuller and C. Greub, Nu l. Phys. B\n\n363 (1991) 345\n\n60 (1993) 243\n\n[59℄ G. Ingelman and J. Rathsman, Z. Phys. C\n[60℄ J. Gluza, A ta Phys. Polon. B\n\n33 (2002) 1735 [hep-ph/0201002℄\n\n[61℄ A.\n\nUnderwood,\n\nPilaftsis\n\nand\n\nT.\n\nE.\n\nJ.\n\nPhys.\n\nRev.\n\nD\n\n72\n\n(2005)\n\n113001\n\n[hep-ph/0506107℄\n[62℄ D. Tommasini, G. Barenboim, J. Bernabeu and C. Jarlskog, Nu l. Phys. B\n(1995) 451\n\n444\n\n[hep-ph/9503228℄\n\n[63℄ J. Kersten and A. Y. Smirnov, Phys. Rev. D\n\n76 (2007) 073005 [arXiv:0705.3221\n\n[hep-ph℄℄\n[64℄ F. del Aguila and J. A. Aguilar-Saavedra,\n\narXiv:0809.2096 [hep-ph℄\n\n[65℄ P. Langa ker and D. London, Phys. Rev. D\n[66℄ E.\n\nNardi,\n\nE.\n\nRoulet\n\nand\n\nD.\n\n38 (1988) 907\n\nTommasini,\n\nPhys.\n\nLett.\n\nB\n\n327\n\n(1994)\n\n319\n\n[hep-ph/9402224℄\n[67℄ S. Bergmann and A. Kagan, Nu l. Phys. B\n\n538 (1999) 368 [hep-ph/9803305℄\n\n[68℄ B. Bekman, J. Gluza, J. Hole zek, J. Syska and M. Zralek, Phys. Rev. D\n093004\n\n[hep-ph/0207015℄\n\n88\n\n66 (2002)\n\n\f78\n\n[69℄ F. del Aguila, J. de Blas and M. Perez-Vi toria, Phys. Rev. D\n\n(2008) 013010\n\n[arXiv:0803.4008 [hep-ph℄℄\n[70℄ J. G. Korner, A. Pilaftsis and K. S hil her, Phys. Lett. B\n\n300\n\n(1993) 381\n\n[hep-ph/9301290℄\n[71℄ A. Ilakova\n\nand A. Pilaftsis, Nu l. Phys. B\n\n[72℄ J. I. Illana and T. Riemann, Phys. Rev. D\n\n437 (1995) 491 [hep-ph/9403398℄\n63 (2001) 053004 [hep-ph/0010193℄\n\n[73℄ F. del Aguila, J. A. Aguilar-Saavedra, A. Martinez de la Ossa and D. Meloni,\nPhys. Lett. B\n\n613 (2005) 170 [hep-ph/0502189℄\n\n[74℄ C. Aalseth et al.,\n\nhep-ph/0412300\n\n[75℄ P. Benes, A. Faessler, F. Simkovi\n077901\n\nand S. Kovalenko, Phys. Rev. D\n\n71\n\n(2005)\n\n[hep-ph/0501295℄\n\n[76℄ B. Ponte orvo, Sov. Phys. JETP\n\n6 (1957) 429 [Zh. Eksp. Teor. Fiz. 33 (1957) 549℄\n\n[77℄ Z. Maki, M. Nakagawa and S. Sakata, Prog. Theor. Phys.\n[78℄ F. del Aguila,\n\nJ. A. Aguilar-Saavedra,\n\nJ.\n\nde\n\n28 (1962) 870\n\nBlas and\n\nM. Perez-Vi toria,\n\narXiv:0806.1023 [hep-ph℄\n[79℄ A. G. Akeroyd,\n\nM. Aoki and Y. Okada,\n\nPhys. Rev. D\n\n76\n\n(2007) 013004\n\n[hep-ph/0610344℄\n[80℄ A. Abada, C. Biggio, F. Bonnet, M. B. Gavela and T. Hambye,\n\narXiv:0803.0481\n\n[hep-ph℄\n[81℄ T.\n\nSjostrand,\n\nS.\n\nMrenna\n\nand\n\nP.\n\nSkands,\n\nJHEP\n\n0605\n\n(2006)\n\n026\n\n[hep-ph/0603175℄\n[82℄ E. Ri hter-Was, D. Froidevaux and L. Poggioli, ATLAS note ATL-PHYS-98-131\n[83℄ E. Murayama, I. Watanabe and K. Hagiwara, KEK report 91-11, January 1992\n[84℄ G. P. Lepage, Report CLNS-80/447\n[85℄ M. L. Mangano, M. Moretti, F. Pi\n(2003) 001\n\ninini, R. Pittau and A. D. Polosa, JHEP\n\n[hep-ph/0206293℄\n\n[86℄ M. L. Mangano, talk at Lund University,\n\nhttp:// ern. h/∼mlm/talks/lund-alpgen.pdf\n89\n\n0307\n\n\f[87℄ S. Bray, J. S. Lee and A. Pilaftsis, Phys. Lett. B\n\n628 (2005) 250 [hep-ph/0508077℄\n\n[88℄ N. Arkani-Hamed, A. G. Cohen, E. Katz and A. E. Nelson, JHEP\n034\n\n(2002)\n\n[hep-ph/0206021℄\n\n[89℄ M. Perelstein, Prog. Part. Nu l. Phys.\n\n58 (2007) 247 [hep-ph/0512128℄\n\n[90℄ I. Dorsner and P. Fileviez Perez, Nu l. Phys. B\n[91℄ H. C. Cheng and I. Low, JHEP\n[92℄ J.\n\n0207\n\nGarayoa\n\nand\n\nT.\n\nS hwetz,\n\n723 (2005) 53 [hep-ph/0504276℄\n\n0309 (2003) 051 [hep-ph/0308199℄\nJHEP\n\n0803\n\n(2008)\n\n009\n\n[arXiv:0712.1453\n\n[hep-ph℄℄\n[93℄ M. Kadastik, M. Raidal and L. Rebane,\n\narXiv:0712.3912 [hep-ph℄\n\n[94℄ A. G. Akeroyd, M. Aoki and H. Sugiyama, Phys. Rev. D\n\n77\n\n(2008) 075010\n\n[arXiv:0712.4019 [hep-ph℄℄\n[95℄ M.\n\nC.\n\nGonzalez-Gar ia\n\nand\n\nM.\n\nMaltoni,\n\nPhys.\n\nRept.\n\n460\n\n(2008)\n\n1\n\n[arXiv:0704.1800 [hep-ph℄℄\n[96℄ J. A. Aguilar-Saavedra, J. Carvalho, N. Castro, A. Onofre and F. Veloso, Eur.\nPhys. J. C\n\n50 (2007) 519 [hep-ph/0605190℄\n\n[97℄ J. C. Collins and D. E. Soper, Phys. Rev. D\n\n16 (1977) 2219\n\n[98℄ F. del Aguila, L. Ametller, G. L. Kane and J. Vidal, Nu l. Phys. B\n\n334 (1990) 1\n\n[99℄ F. Hubaut, E. Monnier, P. Pralavorio, K. Smolek and V. Simak, Eur. Phys. J. C\n\n44S2 (2005) 13 [hep-ex/0508061℄\n[100℄ J. A. Aguilar-Saavedra, J. Carvalho, N. Castro, A. Onofre and F. Veloso, Eur.\nPhys. J. C\n\n53 (2008) 689 [arXiv:0705.3041 [hep-ph℄℄\n\n[101℄ A. Denner, H. E k, O. Hahn and J. Kublbe k, Nu l. Phys. B\n\n90\n\n387 (1992) 467\n\n\f"}