{"id": "http://arxiv.org/abs/0806.2541v1", "guidislink": true, "updated": "2008-06-16T10:29:40Z", "updated_parsed": [2008, 6, 16, 10, 29, 40, 0, 168, 0], "published": "2008-06-16T10:29:40Z", "published_parsed": [2008, 6, 16, 10, 29, 40, 0, 168, 0], "title": "Quantum decoherence and gravitational waves", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.0979%2C0806.1657%2C0806.1512%2C0806.1528%2C0806.3733%2C0806.2564%2C0806.1871%2C0806.3830%2C0806.0820%2C0806.0503%2C0806.4817%2C0806.4658%2C0806.1154%2C0806.3851%2C0806.2382%2C0806.0825%2C0806.1355%2C0806.3104%2C0806.0948%2C0806.1001%2C0806.0364%2C0806.1788%2C0806.0490%2C0806.2924%2C0806.2389%2C0806.3202%2C0806.2910%2C0806.4036%2C0806.2541%2C0806.2870%2C0806.2166%2C0806.0462%2C0806.4841%2C0806.4430%2C0806.4902%2C0806.2314%2C0806.4530%2C0806.4326%2C0806.2517%2C0806.3204%2C0806.3659%2C0806.4944%2C0806.2536%2C0806.4749%2C0806.0146%2C0806.2003%2C0806.3520%2C0806.0507%2C0806.2233%2C0806.3279%2C0806.1091%2C0806.3232%2C0806.3776%2C0806.0063%2C0806.3866%2C0806.1867%2C0806.1624%2C0806.1109%2C0806.4733%2C0806.1172%2C0806.0853%2C0806.0194%2C0806.0769%2C0806.4879%2C0806.3635%2C0806.1921%2C0806.0362%2C0806.1090%2C0806.3871%2C0806.3177%2C0806.2625%2C0806.0562%2C0806.2398%2C0806.1011%2C0806.0190%2C0806.0623%2C0806.3094%2C0806.3027%2C0806.4427%2C0806.0757%2C0806.2009%2C0806.3090%2C0806.3465%2C0806.1533%2C0806.1844%2C0806.1473%2C0806.4269%2C0806.3627%2C0806.2722%2C0806.0740%2C0806.0110%2C0806.1165%2C0806.0207%2C0806.2185%2C0806.1535%2C0806.2851%2C0806.2628%2C0806.2902%2C0806.1727%2C0806.2279%2C0806.1984&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum decoherence and gravitational waves"}, "summary": "The quite different behaviors exhibited by microscopic and macroscopic\nsystems with respect to quantum interferences suggest the existence of a\nborderline beyond which quantum systems loose their coherences and can be\ndescribed classically. Gravitational waves, generated within our galaxy or\nduring the cosmic expansion, constitute a universal environment susceptible to\nlead to such a quantum decoherence mechanism. We assess this idea by studying\nthe quantum decoherence due to gravitational waves on typical microscopic and\nmacoscopic systems, namely an atom interferometer (HYPER) and the Earth-Moon\nsystem. We show that quantum interferences remain unaffected in the former case\nand that they disappear extremely rapidly in the latter case. We obtain the\nrelevant parameters which, besides the ratio of the system's mass to Planck\nmass, characterize the loss of quantum coherences.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.0979%2C0806.1657%2C0806.1512%2C0806.1528%2C0806.3733%2C0806.2564%2C0806.1871%2C0806.3830%2C0806.0820%2C0806.0503%2C0806.4817%2C0806.4658%2C0806.1154%2C0806.3851%2C0806.2382%2C0806.0825%2C0806.1355%2C0806.3104%2C0806.0948%2C0806.1001%2C0806.0364%2C0806.1788%2C0806.0490%2C0806.2924%2C0806.2389%2C0806.3202%2C0806.2910%2C0806.4036%2C0806.2541%2C0806.2870%2C0806.2166%2C0806.0462%2C0806.4841%2C0806.4430%2C0806.4902%2C0806.2314%2C0806.4530%2C0806.4326%2C0806.2517%2C0806.3204%2C0806.3659%2C0806.4944%2C0806.2536%2C0806.4749%2C0806.0146%2C0806.2003%2C0806.3520%2C0806.0507%2C0806.2233%2C0806.3279%2C0806.1091%2C0806.3232%2C0806.3776%2C0806.0063%2C0806.3866%2C0806.1867%2C0806.1624%2C0806.1109%2C0806.4733%2C0806.1172%2C0806.0853%2C0806.0194%2C0806.0769%2C0806.4879%2C0806.3635%2C0806.1921%2C0806.0362%2C0806.1090%2C0806.3871%2C0806.3177%2C0806.2625%2C0806.0562%2C0806.2398%2C0806.1011%2C0806.0190%2C0806.0623%2C0806.3094%2C0806.3027%2C0806.4427%2C0806.0757%2C0806.2009%2C0806.3090%2C0806.3465%2C0806.1533%2C0806.1844%2C0806.1473%2C0806.4269%2C0806.3627%2C0806.2722%2C0806.0740%2C0806.0110%2C0806.1165%2C0806.0207%2C0806.2185%2C0806.1535%2C0806.2851%2C0806.2628%2C0806.2902%2C0806.1727%2C0806.2279%2C0806.1984&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The quite different behaviors exhibited by microscopic and macroscopic\nsystems with respect to quantum interferences suggest the existence of a\nborderline beyond which quantum systems loose their coherences and can be\ndescribed classically. Gravitational waves, generated within our galaxy or\nduring the cosmic expansion, constitute a universal environment susceptible to\nlead to such a quantum decoherence mechanism. We assess this idea by studying\nthe quantum decoherence due to gravitational waves on typical microscopic and\nmacoscopic systems, namely an atom interferometer (HYPER) and the Earth-Moon\nsystem. We show that quantum interferences remain unaffected in the former case\nand that they disappear extremely rapidly in the latter case. We obtain the\nrelevant parameters which, besides the ratio of the system's mass to Planck\nmass, characterize the loss of quantum coherences."}, "authors": ["Marc-Thierry Jaekel", "Brahim Lamine", "Astrid Lambrecht", "Serge Reynaud", "Paulo Maia Neto"], "author_detail": {"name": "Paulo Maia Neto"}, "author": "Paulo Maia Neto", "arxiv_comment": "7 pages", "links": [{"href": "http://arxiv.org/abs/0806.2541v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.2541v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.2541v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.2541v1", "journal_reference": "in Beyond the Quantum, Proceedings Leiden 2006, Eds. Th.M.\n  Nieuwenhuizen, V. Spicka, B. Mehmani, M.J. Aghdami, A.Yu. Khrennikov, World\n  Scientific, Singapore (2007) 125-134", "doi": null, "fulltext": "Quantum decoherence and gravitational waves\nM.T. Jaekel∗,1 B. Lamine, A. Lambrecht and S. Reynaud∗∗ ,2 and P. Maia Neto3\n\narXiv:0806.2541v1 [gr-qc] 16 Jun 2008\n\n1\n\nLaboratoire de Physique Théorique de l'Ecole Normale Supérieure, CNRS, UPMC\n24 rue Lhomond, 75231 Paris Cedex 05, France\n∗\nE-mail: jaekel@lpt.ens.fr\n2\nLaboratoire Kastler Brossel, Université Pierre et Marie Curie, CNRS, ENS\n4 Place Jussieu, 75252 Paris Cedex 05, France\n∗∗\nE-mail: reynaud@spectro.jussieu.fr\n3\nInstituto de Fı́sica, UFRJ,\nCP 68528, 21945-970 Rio de Janeiro, Brazil\n\nThe quite different behaviors exhibited by microscopic and macroscopic systems with respect to\nquantum interferences suggest the existence of a borderline beyond which quantum systems loose\ntheir coherences and can be described classically. Gravitational waves, generated within our galaxy\nor during the cosmic expansion, constitute a universal environment susceptible to lead to such a\nquantum decoherence mechanism. We assess this idea by studying the quantum decoherence due to\ngravitational waves on typical microscopic and macoscopic systems, namely an atom interferometer\n(HYPER) and the Earth-Moon system. We show that quantum interferences remain unaffected in\nthe former case and that they disappear extremely rapidly in the latter case. We obtain the relevant\nparameters which, besides the ratio of the system's mass to Planck mass, characterize the loss of\nquantum coherences.\n\nI.\n\nINTRODUCTION\n\nQuantum decoherence is a universal phenomenon which affects all physical systems as soon as they are coupled to a\nfluctuating environment. This effect plays an important role in the transition between quantum and classical behaviors,\nby washing out quantum coherences and thus justifying a purely classical description [1–5]. This implies that quantum\ndecoherence should be very efficient for macroscopic systems, while remaining inefficient for microscopic ones. The\nquantum/classical transition would then introduce a borderline between microscopic and macroscopic systems.\nExisting experimental observations of quantum decoherence confirm these intuitions. Decoherence has only been\nseen on 'mesoscopic' systems for which the decoherence time is neither too long nor too short, such as microwave\nphotons stored in a high-Q cavity [6] or trapped ions [7]. In such model systems, the environmental fluctuations are\nparticularly well mastered and the quantum/classical transition has been shown to fit the predictions of decoherence\ntheory [8, 9].\nIt has also been early remarked that Planck mass, that is the mass scale which can be built up on Planck constant\n~, light velocity c and Newton gravitation G, lies at the borderline between microscopic and macroscopic masses\nr\n~c\nmP =\n∼ 22μg\n(1)\nG\nThat is to say, one may define microscopic and macroscopic values of a mass m by comparing the associated Compton\nlength lC to the Planck length lP\nr\n~\n~G\n≶ lC =\n(2)\nm ≶ mP ⇔ l P =\nc3\nmc\nIt is tempting to consider that this property is not just an accidental coincidence but rather reveals a general consequence of fundamental gravitational fluctuations [10–13]. Then, one is led to study the role that the fluctuating\ngravitational environment might play in the transition from quantum to classical behaviors.\nHere, we briefly discuss the quantum decoherence due to our local gravitational environment, namely the stochastic\nbackground of gravitational waves surrounding the Earth. Details can be found in previously published work [14–18].\nFirst, taking the example of the atomic interferometer HYPER, we show that gravitational waves do not lead to\na significant decoherence at the microscopic level. We then show that, on the contrary, scattering of gravitational\nwaves is the dominant decoherence mechanism, and an extremely efficient one, for macroscopic systems such as the\nMoon around the Earth. We also go beyond the simple scaling arguments just given above by providing estimates\nof gravitational quantum decoherence depending not only on the mass of the system, but also on its velocity, on its\ngeometry and on the noise spectrum characterizing the gravitational fluctuations.\n\n\f2\nII.\n\nGRAVITATIONAL ENVIRONMENT\n\nWe first describe the fundamental fluctuations of space-time which originate from our gravitational environment\nand which are bound to play a crucial role in quantum decoherence. For current quantum systems which are only\nsensitive to frequencies lying far below Planck frequency, general relativity provides the appropriate description of\ngravitational phenomena [19], even if it may ultimately be replaced by a theory of quantum gravity. It follows that\nthe relevant spacetime fluctuations which constitute our gravitational environment are simply the gravitational waves\npredicted by the linearized theory of gravity [20–22] and which are thoroughly studied in relation with the present\ndevelopment of gravitational wave detectors [23–26]..\nGravitational waves correspond to perturbations of the metric field and can be written in the transverse traceless\n(TT) gauge\ngμν = ημν + hμν ,\nh00 = hi0 =\n\nhii\n\nημν = diag(1, −1, −1, −1)\n\n=0\n\n(3)\n\ni = 1, 2, 3 stands for the spatial indices whereas 0 will represent the temporal index; the spatial components hμν of\nthe metric tensor are directly connected to the Riemann curvature. Gravitational waves are conveniently described\nthrough a mode decomposition in space-time (coordinates (xμ ), x0 ≡ ct)\nhμν (x) =\n\nZ\n\nd4 k\n4\n\n(2π)\n\nλ\n\nhμν [k] e−ikλ x ,\n\nhμν [k] = Σ±\n\n\u0012\n\n±\nε±\nμ εν\n√\n2\n\n\u0013∗\n\nh± [k]\n\n(4)\n\nEach Fourier component is a sum over the two circular polarizations h± , which are obtained as products of the\npolarization vectors ε± well-known from electromagnetic theory. Gravitational waves correspond to wavevectors k\nlying on the light cone (k 2 = kμ k μ = 0), they are transverse with respect to this wavevector (k μ ε±\nμ = 0) and the\n± 2\nmetric perturbation has a null trace ((ε ) = 0).\nWe consider for simplicity the case of stationary, unpolarized and isotropic backgounds. Then, a given metric\ncomponent, say h ≡ h12 , is a stochastic variable characterized by a noise spectrum Sh\nZ\ndω\nhh (t) h (0)i =\nSh [ω] e−iωt\n(5)\n2π\nSh is the spectral density of strain fluctuations considered in most papers on gravitational wave detectors (see for\nexample [24]). It can be written in terms of the mean number ngw of gravitons per mode or, equivalently, of a noise\ntemperature Tgw with kB the Boltzmann constant and G the Newton constant\nSh =\n\n16G\n16G\n~ωngw =\nkB Tgw\n5c5\n5c5\n\n(6)\n\nKnowledge on gravitational wave backgrounds comes from studies estimating the probability of events which might\nbe observed by interferometric detectors of gravitational waves. An important component is constituted by the 'binary\nconfusion background', that is the estimated level for the background of gravitational waves emitted by unresolved\nbinary systems in the galaxy and its vicinity. This 'binary confusion background' leads to a nearly flat function Sh ,\nthat is also to a nearly thermal spectrum, in the μHz to 10mHz frequency range [23]\n10−6 Hz <\n\nω\n< 10−4 Hz\n2π\n\nSh ∼ 10−34 Hz−1\n\n(7)\n\nWith the conversion factors given above, this corresponds to an extremely large equivalent noise temperature Tgw ≃\n1041 K. It is worth stressing that this is only an effective noise temperature. Such a value, larger than Planck\ntemperature (∼ 1032 K), does not correspond to an equilibrium temperature and is allowed by the weakness of\ngravitational coupling.\nPrevious estimations correspond to the confusion background of gravitational waves emitted by binary systems in\nour Galaxy or its vicinity. Because of the large number of unresolved and independent sources, and as a consequence\nof the central limit theorem, they lead to a stochastic noise obeying gaussian statistics. There also exist predictions\nfor gravitational backgrounds associated with a variety of cosmic processes [24], which are however model dependent\nand have a more speculative character. Associated temperatures vary rapidly with frequency and are dominated by\nthe confusion binary background in the frequency range considered here.\n\n\f3\nIII.\n\nQUANTUM DECOHERENCE OF ATOMIC INTERFEROMETERS\n\nAtoms used in interferometry appear as particularly interesting microscopic systems for studying quantum decoherence, as it has recently been suggested that matter-wave interferometers could reveal the existence of intrinsic\nspacetime fluctuations, through an induced Brownian motion [27, 28]. Although it has not been possible to observe\nsuch an effect in existing matter-wave interferometers, instruments are now being designed, like the atomic interferometer HYPER for measuring the Lense-Thirring effect in space, which possess a very high sensitivity to gravitation\nfields [29]. It is thus important, in order to confirm the viability of such instruments, to obtain quantitative estimates\nof potential decoherence effects, in particular those associated with spacetime or gravitation fluctuations.\nWe shall consider the atomic field of the matter-wave interferometer HYPER as a typical example of a microscopic\nsystem affected by quantum decoherence (see for instance [30–32] for details on atomic interferometry ). HYPER is\nan interferometer with a rhombic geometry which is used as a gyrometer, that is to say, its rotation with respect to\ninertial frames is measured through the observation of a Sagnac effect. The Sagnac dephasing Φ is proportional to\nthe mass mat of the (non relativistic) atoms, to the area A of the interferometer and to the rotation frequency Ω\nI\n1\n2mat A\nν\n2 2\nΦ=\nΩ,\npμ = gμν mat vat\n,\nA = vat\nτat sin α\n(8)\npi dxi =\n~\n~\ngμν is the metric field in the frame of the rotating interferometer, vat is the atomic velocity, and the area A is given\nby the length vat τ of the rhomb side and the aperture angle α (τat is the time of flight on one rhomb side).\nAccording to general relativity, a local inertial frame in the neighborhood of a rotating massive body differs from the\ncelestial frame determined by the 'fixed stars' as a consequence of the dragging of inertial frames. This gravitomagnetic\n(Lense-Thirring) effect in the Earth neighborhood is measured by HYPER interferometer, by comparing the local\ninertial measurement performed by the atoms to the indication of a star tracker. A map of the Lense-Thirring effect\naround the Earth is obtained by recording the dephasings and building the corresponding interferogram for each\nposition of the satellite on its orbit.\nGravitational waves, like other gravitational perturbations such as the Lense-Thirring effect, induce a dephasing of\nthe matter waves within the two arms of the interferometer and thus affect the interference fringes [33]\nI\n2mat A\nmat\ni j\nδΩgw\n(9)\nhij vat\nvat dτ =\nδΦgw =\n2~\n~\nMetric components are evaluated in the TT (transverse traceless) gauge. Using the symmetry of the rhomb, this\nexpression may be obtained from the derivative of the metric component h12 lying in the spatial plane defined by the\ninterferometer\nZ\n1 dh12\nδΩgw (t) = −\nh12 (t) =\nh12 (t − τ ) g (τ ) dτ\n(10)\n,\n2 dt\nThe linear filtering function g has a triangular shape which reflects the distribution of the time of exposition of atoms\nto gravitational waves inside the rhombic interferometer. The square of its Fourier transform, which describes linear\nfiltering in frequency space, is an apparatus function characterizing the interferometer [16]\n2\n\n|g̃ [ω] | =\n\n\u0012\n\nsin ωτ2at\nωτat\n2\n\n\u00134\n\n(11)\n\nWe now consider the degradation of fringe contrast obtained by averaging over stochastic dephasings. This evaluation [16] can be shown to be equivalent to the other approaches to decoherence (see for example [34]). Stochastic\ngravitational waves with frequencies higher than the inverse of the averaging time identify with the unobserved degrees of freedom which are usually traced over in decoherence theory (see [8] and references therein). When δΦgw is\na gaussian stochastic variable, the degraded fringe contrast is read as\n!\n∆Φ2gw\n(12)\n,\n∆Φ2gw = δΦ2gw\nhexp (iδΦgw )i = exp −\n2\nUsing the expression of δΦgw in terms of the averaged time derivative of h12 we write the variance ∆Φ2gw as an integral\nover the noise spectrum Sh (5). Particularly interesting is the case of an approximately flat or thermal spectrum Sh (6)\nwhich, as discussed in previous section, is approximately realized by the binary confusion background on a significant\n\n\f4\nfrequency range. With a white noise assumption, the variance is found to be proportional to the constant value of\nthe noise spectrum Sh\n∆Φ2gw =\n\n\u0012\n\n\u00132\n2\n2mat vat\nsin α\nSh 2τat\n~\n\n(13)\n\nAfter substitution of the numbers corresponding to HYPER [29], we deduce that the decoherence due to the scattering\nof gravitational waves is completely negligible\n∆Φ2gw ∼ 10−20\n\n≪1\n\n(14)\n\nWe have discussed here the decoherence effect on atomic fields. In fact, it appears that the decoherence effect\naffecting the laser fields, involved in the stimulated Raman processes used for building up beam splitters and mirrors\nfor matter waves, provides a larger contribution [16]. But this changes neither the mechanism of quantum decoherence\nwhich has been discussed here, nor its incidence on the instrument sensitivity. The phase noise induced by the\nscattering of gravitational waves remains completely negligible with respect to the phase noise induced by mechanical\nvibrations of the mirrors. In the real instrument, decoherence is expected to be induced by instrumental fluctuations\nrather than by fondamental fluctuations.\nIV.\n\nQUANTUM DECOHERENCE OF PLANETARY SYSTEMS\n\nAfter discussing the microscopic case on the example of atomic interferometers, we come to a case which lies at\nthe opposite end, as it can be considered as extremely macroscopic, namely the planetary system built by the Moon\norbiting around the Earth. The classicality of such a system may be expected to result from the strong efficiency of\ndecoherence mechanisms acting on it, contrarily to the case of microscopic systems. Indeed, as we show, gravitational\nwaves lead to an extremely rapid decrease of quantum coherences for such macroscopic systems. Moreover, although\ndecoherence may usually be attributed to collisions of residual gaz, to radiation pressure of solar radiation or, even,\nto the scattering of electromagnetic fluctuations in the cosmic microwave background, we show that, in the case of\nplanetary motions, it is dominated by the scattering of stochastic gravitational waves.\nThe Earth and Moon constitute a binary system with a large quadrupole momentum, so that its internal motion\nis highly sensitive to gravitational waves. For the sake of simplicity, we shall describe the Earth-Moon system as a\ncircular planetary orbit in the plane x1 x2 . The reduced mass m, defined from the masses of the two bodies, will be\nused, such as the radius ρ, that is the constant distance between the two masses, so that the orbital frequency Ω, the\nnormal acceleration a on the circular orbit and the tangential velocity v obey usual relations\na = ρΩ2 =\n\nv2\nρ\n\n(15)\n\nGravitational waves will be represented as metric perturbations hμν , taken in the TT gauge (3), so that they will\nbe related to Riemann curvature (R0i0j = ∂t2 hij ≡ ḧij ). The gravitational wave perturbation on the relative position\nxi in the binary system amounts to a tidal force δF which may also be seen as a geodesic deviation\nδ ṗi (t) = δFi (t) = mc2 R0i0j xj (t)\n\n(16)\n\nThe stochastic background of gravitational waves then induces a Brownian motion on the relative position of the Moon,\nwhich may be characterized by a momentum diffusion with a variance varying linearly with the time of exposition τ\n< δp2 (t) >= 2Dgw τ\n\n(17)\n\nThe momentum diffusion coefficient Dgw is determined by the correlation function of gravitational waves (5,6) [14]\nDgw = mΓgw kB Tgw ,\n\nΓgw =\n\n32Gma2\n5c5\n\n(18)\n\nTgw is the effective noise temperature of the gravitational background, evaluated at twice the orbital frequency, and\nΓgw is the damping rate associated with the emission of gravitational waves. One recovers with equations (18) the\nfluctuation-dissipation relation on Brownian motion [35] and the quadrupole formula for gravitational wave emission\n[36] determined by Einstein. Although gravitational damping can be observed in the case of strongly bound binary\nsystems [37], it appears to be extremely small for the Moon (Γgw ≈ 10−34 s−1 ), with a negligible impact on its mean\n\n\f5\nmotion. Moreover, it can be seen to be much smaller than the damping due to other environmental fluctutations,\nsuch as electromagnetic radiation pressure or Earth-Moon tides. The latter appear to give the dominant contribution\nto damping [38]\nΓgw ≪ Γem < Γtides\n\n(19)\n\nHowever, as we show now, decoherence processes do not follow the same hierarchy.\nQuantum decoherence may be evaluated by considering two neighbouring internal motions of the planetary system\nwhich correspond to the same spatial geometry but slightly different values of the epoch, the time of passage at a\ngiven space point. For simplicity, we measure this difference by the spatial distance ∆x between the two motions,\nwhich is constant for uniform motion. The variation of momentum (16) results in a perturbation of the quantum\nphase one may associate with the relative position in the binary system\nδΦgw (t) =\n\nδpi (t)\n∆xi\n~\n\n(20)\n\nThe difference of phase between two neighboring motions then undergoes a Brownian motion [14], resulting in a\nrandom exponential factor eiδΦgw . Averaging this quantity over the stochastic effect of gravitational waves, still\nsupposed to obey gaussian statistics, one obtains a decoherence factor\n!\n∆Φ2gw\niδΦgw\n(21)\n= exp −\ne\n2\nThe decoherence factor may be expressed in terms of the variables characterizing the Brownian motion (17) and the\ndistance between the two motions ∆x\n∆Φ2gw =\n\n2Dgw ∆x2 τ\n~2\n\n(22)\n\nRelation (22) agrees with the result expected from general discussions on decoherence [2]: decoherence efficiency\nincreases exponentially fast with τ and ∆x2 .\nRelation (22) may be rewritten in terms of the gravitational waves spectrum (6) and the geometric parameters of\nthe binary system (15)\n∆Φ2gw =\n\n\u0012\n\n\u00132\n2mv 2\nsin α\nSh 2τ,\n~\n\nsin α =\n\n∆x\n2ρ\n\n(23)\n\n2mv 2\n~\n\nsin α is a frequency determined by the kinetic energy of the Moon and sin α is the aperture angle of the equivalent\ninterferometer. In the case of the Earth-Moon system, one finds an extremely short decoherence time up to extremely\nshort distances ∆x (in the 10μs range for ∆x of the order of the Planck length)\nDgw\n≈ 1075 s−1 m−2\n~2\n\n(24)\n\nThe gravitational contribution to decoherence appears to be much larger than the contributions associated with\ntide interactions and electromagnetic scattering\nDgw ≫ Dtides > Dem\n\n(25)\n\nWhen compared with contributions to damping (19), decoherence contributions obey a modified hierarchy. This results\nfrom their further dependence on the level of noise induced by the environment and from the fact that gravitational\nΓgw\nwaves constitute the environment with the largest effective noise temperature (7). To be precise, the ratio Γtides\nof\nthe damping constants associated with gravitational waves and tides is of the order of 10−16 , while the ratio\nDgw\nDtides\n\nTgw\nTtides\n\nremains very large and that the gravitational contribution to\nis of the order of 1038 . It follows that the ratio\ndecoherence dominates the other ones.\nThe dominant mechanism leading to the classical behavior of very macroscopic systems appears to be due to\ngravitational waves, originating either from the confusion binary background in our galaxy or from extragalactic\nsources in a larger region of the universe. It is remarkable that the classicality and the ultimate fluctuations of very\nmacroscopic systems appear to be determined by the classical gravitation theory which also explains their mean\nmotion.\n\n\f6\nV.\n\nGRAVITATIONAL QUANTUM DECOHERENCE\n\nThe results obtained in the previous sections for gravitationally induced decoherence are reminiscent of the qualitative discussions of the Introduction. For microscopic probes, such as the atoms or photons involved in atomic\ninterferometers, decoherence is so inefficient that it can be ignored with the consequence that quantum mechanics\nremains the appropriate description.. For macroscopic bodies on the contrary, such as the Moon-Earth system, decoherence is extremely efficient with the consequence that potential quantum coherences between different positions\ncan never be observed, leading to an appropriate purely classical description..\nThe scale arguments sketched in the Introduction may also be associated with precise expressions. In both the\n∆Φ2\ngw\n\nmicroscopic (13) and macroscopic (23) cases, the decoherence factor e− 2 induced by the gravitational environment\ntakes a same form. It involves as an assential factor the gravitational spectral density Sh (6), which may be expressed\nas an effective noise temperature, putting into evidence its dependence on Planck mass mP\nSh ≃\n\nΘgw t2P ,\n\nt2P\n\n~G\n= 5 =\nc\n\n\u0012\n\n~\nmP\n\nc2\n\n\u00132\n\nΘgw ≃\n\n,\n\nkB Tgw\n≃ 1052 s−1\n~\n\n(26)\n\nΘgw is the temperature of the background measured as a frequency. Relations (13) and (23) may then be rewritten\n∆Φ2gw\n≃\n2\n\n\u0012\n\n2mv 2 sin α\nmP c2\n\n\u00132\n\nΘgw τ\n\n(27)\n\n2\n\nm\nThe ratio m\n2 confirms the preliminary arguments of the Introduction, namely that the Planck mass effectively plays\nP\na role in the definition of a borderline between microscopic and macroscopic masses. However, other factors in the\nformula imply that the scaling argument on masses is not sufficient to obtain correct quantitative estimates. The\nratio of the probe velocity over light velocity, the equivalent aperture angle α and the frequency Θgw , measuring the\ngravitational noise level, enter the quantum decoherence time on an equal footing. In particular, the very large value\nof the gravitational noise level implies that the transition between quantum and classical behaviors could in principle\nbe observed for masses smaller than Planck mass. Another interesting feature is that the parameter to be compared\nwith Planck energy mP c2 is the kinetic energy mv 2 of the probe rather than its mass energy mc2 .\nFinally, formula (27) provides a valuable insight into the way to design systems aiming at observing the quantum/classical transition induced by intrinsic gravitational fluctuations. The transition region ∆Φ2gw ∼ 1 seems to be\nbest approached by using heavy and fast particles in a matter-wave interferometer. At present, interference patterns\nhave been observed on rather large molecules [39, 40]. But one checks that, in these experiments, the kinetic energy of\nthe molecules, the area and aperture angle of the interferometer are such that the gravitational quantum decoherence\nremains negligible, as in HYPER. Increasing these sensitive parameters so that the transition could be approached\nappears as a formidable experimental challenge [18] (see [41, 42] for using fast molecules). Alternatively, one could\nconsider using quantum condensates [43, 44], an approach however requiring further technological progress.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n\nH.D. Zeh, Found. Phys. 1 69 (1970).\nA.J. Zurek, Phys. Rev. D 24 1516 (1981); Phys. Rev. D 26 1862 (1982).\nA.O. Caldeira and A.J. Leggett, Physica A 121 587 (1983); Phys. Rev. A 31 1059 (1985).\nE. Joos and H.D. Zeh, Z. Phys. B 59 223 (1985).\nR. Balian in this issue.\nM. Brune, E. Hagley, J. Dreyer, X. Maı̂tre, A. Maali, C. Wunderlich, J.M. Raimond and S. Haroche, Phys. Rev. Lett. 77\n4887 (1996).\nC.J. Myatt, B.E. King, Q.A. Turchette, C.A. Sackett, D. Kielpinski, W.M. Itano, C. Monroe and D.J. Wineland, Nature\n403 269 (2000).\nJ.M. Raimond, M. Brune and S. Haroche, Rev. Mod. Phys. 73 565 (2001).\nJ.M. Raimond in this issue.\nR.P. Feynman, F.B. Moringo, W.G. Wagner and B. Hatfield, Feynman Lectures on Gravitation (Penguin, 1999).\nF. Karolyhazy, Nuovo Cim. 42 A 390 (1966).\nL. Diosi, Phys. Rev. A 40 1165 (1989).\nR. Penrose, Gen. Rel. Grav. 28 581 (1996).\nS. Reynaud, P.A. Maia Neto, A. Lambrecht and M.-T. Jaekel, Europhys. Lett. 54 135 (2001).\nS. Reynaud, B. Lamine, A. Lambrecht, P.A. Maia Neto and M.-T. Jaekel, Int. J. Mod. Phys. A 17 1003 (2002).\nB. Lamine, M.-T. Jaekel and S. Reynaud Eur. Phys. J. D 20 165 (2002).\n\n\f7\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n\nS. Reynaud, B. Lamine, A. Lambrecht, P.A. Maia Neto and M.-T. Jaekel, Gen. Rel. Grav. 36 2271 (2004).\nB. Lamine, R. Hervé, A. Lambrecht and S. Reynaud, Phys. Rev. Lett. 96 050405 (2006).\nM.-T. Jaekel and S. Reynaud, Ann. Physik 4 68 (1995).\nS. Weinberg, Phys. Rev. 138 B988 (1965).\nL.P. Grishchuk, Usp. Fiz. Nauk 121 629 (1977).\nYa.B. Zeldovich and L.P. Grishchuk, Usp. Fiz. Nauk 149 695 (1986).\nB. Schutz, Class. Quant. Grav. 16 A131 (1999).\nM. Maggiore, Physics Reports 331 283 (2000).\nC. Ungarelli and A. Vecchio, Phys. Rev. D 63 064030 (2001).\nL.P. Grishchuk, V.M. Lipunov, K.A. Postnov, M.E. Prokhorov and B.S. Sathyaprakash, Phys. Uspekhi 44 1 (2001).\nW.L. Power and I.C. Percival, Proc. R. Soc. London A 455 991 (2000).\nG. Amelino-Camelia, Nature 408 661 (2000).\nHYPER, Hyper-precision cold atom interferometry in space, Assessment study report 10 ESA-SCI (2000).\nC.J. Bordé, J.-C. Houard and A. Karasiewicz, in Gyros, Clocks, and Interferometers: Testing Relativistic Gravity in Space,\neds C. Lämmerzahl, C.W.F. Everitt and F.W. Hehl, Lecture Notes in Physics 562 (2001) p.405.\nC.J. Bordé, C. R. Acad. Sci. Paris, 2-IV 509 (2001).\nA. Peters, K.Y. Chung and S. Chu, Metrologia 38 25 (2001).\nB. Linet and P. Tourrenc, Can. J. Phys. 54 1129 (1976).\nA. Stern, Y. Aharonov and Y. Imry, Phys. Rev. A 41 3436 (1990).\nA. Einstein, Ann. Physik XVII 549 (1905).\nA. Einstein, Preuss. Akad. Wissen. Sitz. 154 (1918).\nJ.H. Taylor, A. Wolszczan, T. Damour and J.M. Weisberg, Nature 355 132 (1992).\nE. Bois, F. Boudin and A. Journet, Astron. Astrophys. 314 989 (1996).\nK. Hornberger, S. Uttenhaler, B. Brezger, L. Hackermuüller, M. Arndt and A. Zeilinger, et al., Phys. Rev. Lett. 90 160401\n(2003).\nL. Hackermüller, K. Hornberger, B. Brezger, A. Zeilinger and M. Arndt, Nature 427 711 (2004).\nO. Houde, D. Kadio and L. Pruvost, Phys. Rev. Lett. 85 5543 (2000).\nM. Boustimi, J. Baudon, M. Ducloy, J. Reinhardt, F. Perales, C. Mainos, V. Bocvarski and J. Robert, Eur. Phys. J. D 17\n141 (2001).\nC.H. van der Wal, A.C.J. ter Haar, F.K. Wilhelm, R.N. Schouten, C.J.P.M. Harmans, T.P. Orlando, S. Llyod and J.E.\nMooij, Science 290 773 (2000).\nW.L. Li, A.K. Tuchman, H.-C. Chien and M.A. Kasevich, (2006) arXiv:quant-ph/0609009.\n\n\f"}