{"id": "http://arxiv.org/abs/0805.4011v1", "guidislink": true, "updated": "2008-05-26T21:17:56Z", "updated_parsed": [2008, 5, 26, 21, 17, 56, 0, 147, 0], "published": "2008-05-26T21:17:56Z", "published_parsed": [2008, 5, 26, 21, 17, 56, 0, 147, 0], "title": "The ultraluminous X-ray source NGC 1313 X-2 - Its optical counterpart\n  and environment", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.1217%2C0805.3463%2C0805.2369%2C0805.0033%2C0805.2242%2C0805.4729%2C0805.3183%2C0805.1233%2C0805.2104%2C0805.2823%2C0805.2798%2C0805.0793%2C0805.1066%2C0805.1408%2C0805.2327%2C0805.0018%2C0805.4071%2C0805.2937%2C0805.3625%2C0805.4233%2C0805.0487%2C0805.3926%2C0805.3111%2C0805.0717%2C0805.0088%2C0805.4550%2C0805.4697%2C0805.1110%2C0805.2169%2C0805.2890%2C0805.4417%2C0805.4788%2C0805.0319%2C0805.1274%2C0805.4311%2C0805.1169%2C0805.2105%2C0805.3274%2C0805.2720%2C0805.1713%2C0805.1530%2C0805.1170%2C0805.3507%2C0805.1351%2C0805.3488%2C0805.1517%2C0805.2667%2C0805.3503%2C0805.2252%2C0805.1487%2C0805.4575%2C0805.1698%2C0805.1724%2C0805.2325%2C0805.4072%2C0805.3812%2C0805.0447%2C0805.0586%2C0805.4049%2C0805.3081%2C0805.4510%2C0805.0573%2C0805.2059%2C0805.3097%2C0805.4562%2C0805.4490%2C0805.3366%2C0805.4568%2C0805.2829%2C0805.4619%2C0805.0890%2C0805.4244%2C0805.2210%2C0805.3530%2C0805.1286%2C0805.4011%2C0805.4815%2C0805.0360%2C0805.3263%2C0805.3718%2C0805.2052%2C0805.0672%2C0805.3635%2C0805.0589%2C0805.0402%2C0805.1250%2C0805.2556%2C0805.2320%2C0805.1513%2C0805.0638%2C0805.1673%2C0805.0002%2C0805.0832%2C0805.1245%2C0805.3465%2C0805.3271%2C0805.4015%2C0805.3215%2C0805.0031%2C0805.0526%2C0805.0175&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The ultraluminous X-ray source NGC 1313 X-2 - Its optical counterpart\n  and environment"}, "summary": "NGC 1313 X-2 is one of the brightest ultraluminous X-ray sources in the sky,\nat both X-ray and optical wavelengths; therefore, quite a few studies of\navailable ESO VLT and HST data have appeared in the literature. Here, we\npresent our analysis of VLT/FORS1 and HST/ACS photometric data, confirming the\nidentification of the B ~ 23 mag blue optical counterpart. We show that the\nsystem is part of a poor cluster with an age of 20 Myr, leading to an upper\nmass limit of some 12 M_sun for the mass donor. We attribute the different\nresults with respect to earlier studies to the use of isochrones in the F435W\nand F555W HST/ACS photometric system that appear to be incompatible with the\ncorresponding Johnson B and V isochrones. The counterpart exhibits significant\nphotometric variability of about 0.2 mag amplitude, both between the two HST\nobservations and during the one month of monitoring with the VLT. This includes\nvariability within one night and suggests that the light is dominated by the\naccretion disk in the system and not by the mass donor.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.1217%2C0805.3463%2C0805.2369%2C0805.0033%2C0805.2242%2C0805.4729%2C0805.3183%2C0805.1233%2C0805.2104%2C0805.2823%2C0805.2798%2C0805.0793%2C0805.1066%2C0805.1408%2C0805.2327%2C0805.0018%2C0805.4071%2C0805.2937%2C0805.3625%2C0805.4233%2C0805.0487%2C0805.3926%2C0805.3111%2C0805.0717%2C0805.0088%2C0805.4550%2C0805.4697%2C0805.1110%2C0805.2169%2C0805.2890%2C0805.4417%2C0805.4788%2C0805.0319%2C0805.1274%2C0805.4311%2C0805.1169%2C0805.2105%2C0805.3274%2C0805.2720%2C0805.1713%2C0805.1530%2C0805.1170%2C0805.3507%2C0805.1351%2C0805.3488%2C0805.1517%2C0805.2667%2C0805.3503%2C0805.2252%2C0805.1487%2C0805.4575%2C0805.1698%2C0805.1724%2C0805.2325%2C0805.4072%2C0805.3812%2C0805.0447%2C0805.0586%2C0805.4049%2C0805.3081%2C0805.4510%2C0805.0573%2C0805.2059%2C0805.3097%2C0805.4562%2C0805.4490%2C0805.3366%2C0805.4568%2C0805.2829%2C0805.4619%2C0805.0890%2C0805.4244%2C0805.2210%2C0805.3530%2C0805.1286%2C0805.4011%2C0805.4815%2C0805.0360%2C0805.3263%2C0805.3718%2C0805.2052%2C0805.0672%2C0805.3635%2C0805.0589%2C0805.0402%2C0805.1250%2C0805.2556%2C0805.2320%2C0805.1513%2C0805.0638%2C0805.1673%2C0805.0002%2C0805.0832%2C0805.1245%2C0805.3465%2C0805.3271%2C0805.4015%2C0805.3215%2C0805.0031%2C0805.0526%2C0805.0175&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "NGC 1313 X-2 is one of the brightest ultraluminous X-ray sources in the sky,\nat both X-ray and optical wavelengths; therefore, quite a few studies of\navailable ESO VLT and HST data have appeared in the literature. Here, we\npresent our analysis of VLT/FORS1 and HST/ACS photometric data, confirming the\nidentification of the B ~ 23 mag blue optical counterpart. We show that the\nsystem is part of a poor cluster with an age of 20 Myr, leading to an upper\nmass limit of some 12 M_sun for the mass donor. We attribute the different\nresults with respect to earlier studies to the use of isochrones in the F435W\nand F555W HST/ACS photometric system that appear to be incompatible with the\ncorresponding Johnson B and V isochrones. The counterpart exhibits significant\nphotometric variability of about 0.2 mag amplitude, both between the two HST\nobservations and during the one month of monitoring with the VLT. This includes\nvariability within one night and suggests that the light is dominated by the\naccretion disk in the system and not by the mass donor."}, "authors": ["F. Grisé", "M. W. Pakull", "R. Soria", "C. Motch", "I. A. Smith", "S. D. Ryder", "M. Böttcher"], "author_detail": {"name": "M. Böttcher"}, "author": "M. Böttcher", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:200809557", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.4011v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.4011v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 11 figures. Accepted for publication in Astronomy &\n  Astrophysics", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.4011v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.4011v1", "journal_reference": null, "doi": "10.1051/0004-6361:200809557", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 1313x2 ̇final\nOctober 26, 2018\n\nThe ultraluminous X-ray source NGC 1313 X-2\nIts optical counterpart and environment\n\narXiv:0805.4011v1 [astro-ph] 26 May 2008\n\nF. Grisé1 , M. W. Pakull1 , R. Soria2 , C. Motch1 , I. A. Smith3 , S. D. Ryder4 , and M. Böttcher5\n1\n2\n3\n4\n5\n\nObservatoire Astronomique de Strasbourg, 11 rue de l'Université, Strasbourg 67000, France e-mail: grise@astro.u-strasbg.fr\nMullard Space Science Laboratory (UCL), Holmbury St Mary, Dorking, Surrey RH5 6NT\nDepartment of Physics and Astronomy, Rice University, 6100 South Main, MS108, Houston, TX 77251-1892\nAngloAustralian Observatory, P.O. Box 296, Epping, NSW 1710, Australia\nAstrophysical Institute, Department of Physics and Astronomy, Ohio University, Clippinger Hall 251B, Athens, OH 45701-2979\n\nReceived 11 February 2008 / Accepted 18 May 2008\nABSTRACT\n\nNGC 1313 X-2 is one of the brightest ultraluminous X-ray sources in the sky, at both X-ray and optical wavelengths; therefore, quite\na few studies of available ESO VLT and HST data have appeared in the literature. Here, we present our analysis of VLT/FORS1 and\nHST/ACS photometric data, confirming the identification of the B ∼ 23 mag blue optical counterpart. We show that the system is part\nof a poor cluster with an age of 20 Myr, leading to an upper mass limit of some 12 M⊙ for the mass donor. We attribute the different\nresults with respect to earlier studies to the use of isochrones in the F435W and F555W HST/ACS photometric system that appear\nto be incompatible with the corresponding Johnson B and V isochrones. The counterpart exhibits significant photometric variability\nof about 0.2 mag amplitude, both between the two HST observations and during the one month of monitoring with the VLT. This\nincludes variability within one night and suggests that the light is dominated by the accretion disk in the system and not by the mass\ndonor.\nKey words. Galaxies: individual: NGC 1313 – Accretion, accretion disks – Black hole physics – Galaxies: star clusters – X-rays:\n\nbinaries – X-rays: individuals: NGC 1313 X-2\n\n1. Introduction\n1.1. Context\n\nUltraluminous X-ray sources (ULXs) are extragalactic X-ray\nsources that are not at the nucleus of their galaxy, emitting\nwell above the Eddington limit of a 10 M⊙ black hole (LX ∼\n1039 erg s−1 ) if we assume that they emit isotropically. An important question is whether they contain intermediate mass black\nholes (Colbert & Mushotzky 1999; Makishima et al. 2000),\nwhether they are beamed (King et al. 2001), or if they are\nrather normal X-ray binaries with super-Eddington emission\n(Begelman 2002).\nThe first clues about their compact nature came from X-ray\nstudies showing that ULXs are variable on timescales of years\ndown to minutes. Well-studied examples are Holmberg IX X-1\n(La Parola et al. 2001), ULXs in the Antennae (Fabbiano et al.\n2003) or M74 X-1 (Krauss et al. 2005). Therefore, ULXs are\naccreting systems displaying spectra that were first described\nby a soft multicolor disk blackbody plus power-law continuum\n(Miller et al. 2003). The soft component was interpreted as a\ncool accretion disk (kT ∼ 150 eV). Using standard (Shakura\n& Syunyaev 1973) multicolor disk models (M ∼ L1/2 T in−2 ), this\nwould imply black hole (BH) masses ∼ 103 –104 M⊙ assuming\nthat the disk extends to the innermost stable circular orbit (as is\nthought to be the case in Galactic black-hole X-ray binaries in\nthe disk-dominated high/soft state). However, it has been suggested (Roberts 2007; Soria 2007) that the assumptions might\nwell be misleading: the observed energy distribution can be inSend offprint requests to: F. Grisé\n\nterpreted with alternative spectral models based on a cool outer\ndisk and a Compton-scattering-dominated inner region. In this\nscenario, much lower masses (<\n∼ 100 M⊙ ) are required for most\nULXs, even in the absence of strong beaming.\nFurther clues to the ULX nature come from X-ray timevariability studies. The detection of low-frequency quasiperiodic oscillations (LF-QPOs) in a few ULXs exclude strong\nX-ray beaming (Strohmayer & Mushotzky 2003; Dewangan\net al. 2006; Mucciarelli et al. 2006; Strohmayer et al. 2007).\nBy analogy with Galactic BHs and with some AGNs (McHardy\net al. 2006), the characteristic frequencies of the LF-QPOs and of\nthe breaks observed in the power-density-spectra of a few ULXs\nsuggest masses in the intermediate mass black hole (IMBH)\nrange (Strohmayer et al. 2007; Shaposhnikov & Titarchuk 2007),\nif the varying component is emitted at or near the innermost\nstable circular orbit. However, as for the spectral interpretation,\nlower BH masses would be implied if the oscillations come from\na larger region, perhaps associated with the thermal/non-thermal\ntransition of the accretion flow. On longer timescales (weeks to\nyears), spectral state transitions have been observed in a few luminous sources (e.g. La Parola et al. 2001; Soria & Motch 2004;\nSoria et al. 2007), but it is not yet clear how they compare with\nthe \"canonical\" state transitions in Galactic BHs (e.g. Remillard\net al. 2003).\nOptical studies of ULXs have revealed point-like counterparts with blue colors (Goad et al. 2002; Liu et al. 2002; Kaaret\net al. 2004; Liu et al. 2004; Soria et al. 2005; Kuntz et al. 2005;\nMucciarelli et al. 2005; Grisé et al. 2006; Liu et al. 2007; Rosado\net al. 2008), consistent with early-type donors (and more specifically, with 10–20 M⊙ blue supergiants). However, the optical\n\n\f2\n\nF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\nemission may have a strong, perhaps dominant contribution from\nthe accretion disk (which should also have blue colors). This\nmakes it more difficult to identify the spectral type and mass\nof the donor star from the luminosity and colors of the optical\ncounterpart.\nIn many cases, optical counterparts are embedded in highlysupersonically expanding ionized nebulae (with possible contributions due to photoionization) and possibly related to the presence of jets (Pakull & Mirioni 2002, 2003; Kaaret et al. 2004;\nAbolmasov et al. 2007a,b; Pakull & Grisé 2008). The study of\nnearby ULXs undergoing little interstellar extinction revealed\nthat stellar counterparts are usually part of small young star clusters or OB associations (Zezas et al. 2002; Goad et al. 2002;\nGrisé et al. 2006; Liu et al. 2007; Abolmasov et al. 2007b). But\nthey are sometimes found slightly separated from these stellar\nassociations (Zezas et al. 2002), as if they received a kick during\na supernova event (which in this case could strengthen the stellar\nmass nature of the black hole). Radio counterparts are found in\nonly few cases (Miller et al. 2005; Soria et al. 2006; Lang et al.\n2007). They are spatially resolved, and have a spectrum consistent with optically-thin (steep) synchrotron emission. Thus, they\nare likely to be jet-powered radio lobes, not core emission from\nthe collimated inner jet as observed in microquasars.\nULXs are mostly found in star-forming spirals or irregular\ngalaxies (Irwin et al. 2004; Swartz et al. 2004). Because of their\nextragalactic nature, these sources are optically faint. Telescopes\nwith large collecting area such as the VLT and/or high spatial\nresolution such as HST are therefore required for the study of\ntheir optical counterparts and immediate environments.\n1.2. NGC 1313 X-2 ULX\n\nHere, we study ULX X-2 in the barred spiral galaxy NGC 1313,\nwhich is located at a distance of about 4 Mpc (3.7 Mpc according to Tully 1988, 4.13 Mpc according to Méndez et al. 2002).\nNGC 1313 has a mass of M = 1010.25 M⊙ (Karachentsev et al.\n2004); this is roughly in the mass range where galaxies appear\nto be most efficient at producing ULXs (Swartz et al. 2008). X-2\nis quite distant from the galactic nucleus, ≈ 6′ (corresponding to\n7 kpc) to the south. At this position, there are no obvious signs\nof recent, extensive star formation. The galactic interstellar (IS)\nextinction is low (E(B − V) ∼ 0.1, Schlegel et al. 1998): this\nmakes X-2 one of the best targets for an optical spectroscopic\nand photometric study of a ULX and its host environment.\n1.2.1. X-ray properties\n\nThe source has been extensively studied in X-rays (see Feng &\nKaaret 2006 for a study of 12 archival XMM-Newton observations, Mizuno et al. 2007 for a recent Suzaku study), and has an\naverage isotropic luminosity of ≈ 6 × 1039 ergs−1 in the 0.3–10\nkeV band. It was seen to vary in intensity by about 50% in a few\nhours (Mizuno et al. 2007) and exhibits also significant variability on time scales of months and years. The X-ray spectrum of\nX-2 can be fitted by at least 2 phenomenological models corresponding to 3 alternative physical mechanisms :\na) a hot thermal component (kT in ≈ 1.2–1.3 keV) dominating above 2 keV, plus a soft down-scattered component. The\nhot thermal component was physically interpreted as a \"slim\ndisk\" around a stellar-mass black hole, at super-Eddington\naccretion rates (Mizuno et al. 2007).\n\nb) a cool thermal component (kT in ≈ 0.15 keV) plus a powerlaw-like component dominating above 2 keV. Physically, this\ncan be interpreted in two ways :\ni) as an optically-thick accretion disk extending to the\ninnermost stable circular orbit, plus an optically-thin\ncorona, around an intermediate-mass black hole (M ∼\n1000 M⊙ ), with accretion rates below 0.1 times\nEddington (Miller et al. 2003).\nii) as an optically-thick disk, directly visible only far away\nfrom the innermost stable orbit, and replaced (or covered) at smaller radii by a hotter region (kT ∼ a\nfew keV), optically-thick to electron scattering. This\nscenario may allow for less massive black holes (<\n∼\n100 M⊙ ) at accretion rates ∼ a few times Eddington\n(Roberts 2007; Soria 2007).\n\nThese three physical models predict different characteristic\nsizes, colors and luminosities for the accretion disk. Optical\nstudies can provide new constraints, if we can disentangle the\noptical contributions from the irradiated donor star and the accretion disk.\n\n1.2.2. Optical properties\n\nAt optical wavelengths, studies by Pakull & Mirioni (2002);\nPakull et al. (2006); Ramsey et al. (2006) revealed the presence of a huge ionized nebula (extension 18′′ × 26′′, corresponding to 350 × 500 pc at a distance of 4.0 Mpc) at the position\nof X-2. The high expansion velocity of ∼ 100 km/s (Ramsey\net al. 2006) underlines the suggestion that we are seeing emission from radiative shocks. This is supported by the presence of\nenhanced [OI] and [SII] forbidden lines (e.g. Pakull & Mirioni\n2002; Abolmasov et al. 2007a,b). However, contributions due\nto photoionization by the X-ray source cannot presently be excluded. The search for an optical counterpart of the ULX has\nmotivated to carry out deep imaging of the field around it, using the European Southern Observatory Very Large Telescope\n(ESO/VLT) and the Hubble Space Telescope Advanced Camera\nfor Surveys (HST/ACS).\nMulti-band photometry of the counterpart and of the surrounding stellar population can constrain the nature of the donor\nstar, but results reported in the literature are quite discordant (see\nMucciarelli et al. 2005, 2007; Ramsey et al. 2006; Liu et al.\n2007). In particular, the age of the small cluster or association\nof relatively young stars around the ULX appears not to be well\nconstrained. Determining this value is of great interest, not at\nleast because it tells us whether or not the ULX donor is a massive early-type star, and hence helps to constrain the physics and\nduration of the high mass-transfer phase.\nIn this paper, we analyze the full set of our photometric VLT\nobservations (some results were previously reported in Pakull\net al. 2006) together with archival HST/ACS data. We will show\nthat the ULX counterpart is part of a 20-Myr-old star cluster,\nwhich is not expected to contain uncollapsed stars more massive\nthan ≈ 12 M⊙ . Combining ground-based and HST data, we will\npresent a detailed photometric light curve of the ULX counterpart, which shows large variability on timescales of hours and\ndays. This suggests that the optical emission is dominated by an\naccretion disk with possible contributions by the X-ray-heated\nsecondary.\n\n\fF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\n2. Observations\n\n3\n\nThe second dataset was obtained from the HST/ACS archive\n(programme GO-9796; PI: J. Miller). Observations were carried\nout on 2003 November 22, with the Wide Field Camera (WFC)\nin the F435W, F555W and F814W filters, and with the High\nResolution Camera (HRC) in the F330W filter. An additional\nobservation was done on 2004 February 22 with the WFC in\nthe F555W filter. More detailed information about those exposures is summarized in Table 3. We re-analyzed the data using\nthe latest calibration files at the time of the analysis (STSDAS\nv3.5) and applied the standard correction for the spatial distortion (Multidrizzle 2.7.2, Koekemoer et al. 2002).\n\n& Arnouts 1996) in order to calculate the aperture corrections\nbetween PSF-derived brightnesses and those from a 0.′′ 5 aperture\nradius (Table 5). Finally we applied the values given in Sirianni\net al. (2005) to correct between 0.′′ 5 aperture and infinite aperture\nphotometry.\nFrom the ACS instrumental magnitudes, we calculated the\nstandard magnitudes in both the VEGAMAG and the JohnsonCousins systems. We are aware of the limitations of such transformations, especially for stars with peculiar spectral features.\nBut we chose to do so in order to facilitate a comparison between\nthe ground-based and HST photometry. Although, in principle,\nit should not be necessary to transform between these sets of\nmagnitudes (Sirianni et al. 2005), it turns out (as we discuss in\nSect. 4.5) that the interpretation of the data in terms of published\nisochrones differs substantially between the (F435W, F555W)\nsystem on the one hand and the (B, V) system on the other. In order to check the transformations given by Sirianni et al. (2005)\nbetween these two photometric systems, we used our data to derive our own calibration. We selected bright stars in the VLT\nimage that are not saturated or resolved into multiple stars by\nACS. We found that our own set of transformations are consistent with those of Sirianni et al. (2005), which we use for consistency with other studies. We interpreted our color-magnitude\ndiagrams in the two photometric systems by comparing them\nwith evolutionary tracks and isochrones from the Padua group\n(Bertelli et al. 1994; Girardi et al. 2000; Salasnich et al. 2000;\nGirardi et al. 2002) and the Geneva group (Lejeune & Schaerer\n2001).\nWe estimated the completeness limit in all frames by adding\n1000 artificial stars in each 0.2 mag bin between 24.8 mag\n(where the completeness is 1 in all filters) and 28.6 mag (where\nthe completeness is 0 for all filters). For each bin we took the\nmean of the number of stars recovered in three runs as the completeness fraction.\n\n3. Data analysis\n\n4. Results and discussion\n\n3.1. VLT Data\n\n4.1. Distance and metallicity of NGC 1313\n\nThe near environment of X-2 is crowded, so in order to obtain the\nbest possible photometric measurements, we used point-spreadfunction (PSF) fitting routines in DAOPHOT II (Stetson 1992),\na sub-package of the MIDAS photometry software. We calibrated our absolute photometry using the exposures from 2003\nDecember 24 for the B and R bands, and 2003 December 25 for\nthe V band; both nights were photometric. Service mode observations also included standard star observations of the Landolt\nfields PG0231 and SA101; our transformations from the instrumental to the BVR system are fully consistent with the zeropoints and color terms provided by ESO.\n\nThe HST spatial resolution is required for any stellar population study in NGC 1313 (see Méndez et al. 2002; Pellerin et al.\n2007; Rizzi et al. 2007 for recent work). The central region of\nthe galaxy is dominated by young stellar populations; by contrast the field around X-2 contains few young stars and appears\nto be dominated by an older population. This is clearly shown\nin our (V − I, I) color-magnitude diagram (Fig. 2) of the ≈ 7200\nstars identified in the ULX neighbourhood (the region around\nX-2 shown in Fig. 1).\nFor old stellar populations, the location of the red giant\nbranch (RGB) in color-magnitude diagrams (in particular, (V −I,\nI)) is a good indicator of distance and metallicity. In our case,\nthe RGB is very prominent. We estimated the position of its tip\n(TRGB) by determining the point at which the first derivative of\nthe I-band luminosity function has a maximum. We find that it\noccurs at I0(T RGB) ≈ 24.0 ± 0.1mag (after correcting for extinction). The distance can be expressed by :\n\n2.1. VLT Observations\n\nThe first set of data comes from an observing programme (ID\n072.D0614; PI: M. Pakull) carried out with the VLT/FORS1 instrument. Photometric monitoring was done over 9 nights and\na spectroscopic study over 4 nights, between 2003 December\n20 and 2004 January 15. The field around X-2 was observed\nin broadband filters (standard B, V, R) and in some narrow-band\nfilters (Hα , [OIII]λ5007 and [OI]λ6300)(See Tables 1 & 2 for\ndetails). We also monitored the source in the B band with a\ntotal of 16 observations, each with an exposure time of 840 s.\nUsually, we obtained one observation per night, except for 2003\nDecember 24, when the field was observed 7 times. Each observation consisted of two dithered sub-exposures taken directly\none after the other, and averaged to increase the signal-to-noise\nratio. We also obtained two observations in R and one in V to\nstudy the color of the source and of its stellar environment. This\npaper mainly concentrates on photometric results; we leave the\ndiscussion of the spectroscopic results to a subsequent paper.\n2.2. HST Observations\n\n3.2. HST Data\n\nOur field of interest (Fig. 1) also appears moderately crowded\nin the HST/ACS drizzled images, so we used again DAOPHOT II\nfor our photometric analysis. In order to obtain a realistic estimate of the photometric errors, we multiplied the pixel values by\nthe exposure time, which gave us the number of detected e− per\npixel; we then added the background counts subtracted by the\nHST pipeline. We selected a sample of bright, isolated stars in\nthe field to model the PSF; we allowed the PSF to vary quadratically as a function of spatial position in the frame. We used a\nradius of 3 pixels for PSF fitting to the other stars. We carried\nout aperture photometry of isolated stars with SExtractor (Bertin\n\n(m − M)0 = I0(T RGB) − MIT RGB\nwhere (m−M)0 is the distance modulus and MIT RGB is the absolute\nmagnitude of the TRGB. Taking MIT RGB = −4.05 ± 0.02 (Rizzi\net al. 2007), we find that the distance modulus to NGC 1313\nis (m − M)0 ≈ 28.05 ± 0.11, corresponding to a distance of\n4.07±0.22 Mpc. This is in agreement with the results of Méndez\n\n\f4\n\nF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\nTable 1. The VLT FORS1 observations for NGC 1313 X-2.\nFilter\nB\nV\nR\nHα\n[OI]\n[OIII]\n\nExposure Time (s)\n420\n840\n600\n500\n1500\n1300\n1500\n\nNumber of Exposures\n24\n4\n2\n4\n2\n2\n2\n\nCentral Wavelength of Filter (Å)\n4290\n\nFWHM of Filter (Å)\n880\n\n5540\n6570\n6563\n6295\n5001\n\n1115\n1500\n61\n69\n55\n\nTable 2. Log of our VLT FORS1 broad-band observations.\nFilter\nB\n\nV\nR\n\nObservation Date\n2003 Dec. 21\n2003 Dec. 22\n2003 Dec. 23\n2003 Dec. 24\n\nMJD at mid-exposure\n52994.12864\n52995.04826\n52996.08222\n52997.03231\n52997.08794\n52997.09836\n52997.12389\n52997.20328\n52997.21365\n52997.24293\n52998.17256\n53000.22022\n53001.17035\n53002.21072\n53003.04551\n53019.04868\n52998.07801\n52997.11028\n52997.22568\n\n2003 Dec. 25\n2003 Dec. 27\n2003 Dec. 28\n2003 Dec. 29\n2003 Dec. 30\n2004 Jan. 15\n2003 Dec. 25\n2003 Dec. 24\n\nSeeing (′′ )\n0.60\n0.56\n0.66\n0.58\n0.68\n0.71\n0.67\n0.69\n0.76\n0.50\n0.46\n0.70\n0.69\n0.58\n0.65\n0.57\n0.55\n0.75\n0.80\n\nTable 3. The HST/ACS observations for NGC 1313 X-2.\nID\nj8ola2010\nj8ol02040\nj8ol02030\nj8ol02010\nj8ol06010\n\nInstruments\nHRC\nWFC\nWFC\nWFC\nWFC\n\nFilter\nF330W\nF435W\nF555W\nF814W\nF555W\n\nDate\n2003 Nov. 22\n2003 Nov. 22\n2003 Nov. 22\n2003 Nov. 22\n2004 Feb. 22\n\nMJD at mid-exposure\n52965.44294\n52965.37542\n52965.31531\n52965.30656\n53057.22947\n\nExposure Time (s)\n2760\n2520\n1160\n1160\n2240\n\nFWHM of Filter (Å)\n173.82\n293.47\n360.02\n654.64\n360.02\n\net al. (2002) and Rizzi et al. (2007) who studied the northwestern region of the galaxy (distance modulus of 28.08 ± 0.06\nmag and 28.15 ± 0.03 mag, respectively).\nThe intrinsic color of the RGB depends on the metal content\nof its stars (Da Costa & Armandroff 1990). A useful empirical\nrelation between color at MI = −3.5 mag (half a magnitude below the tip) and metal abundance is\n[Fe/H] = −12.64 + 12.61(V − I)0,−3.5 − 3.33[(V − I)0,−3.5 ]2\n(Lee et al. 1993). To highlight the metallicity dependence, we\noverplotted the RGB loci (scaled to the distance of NGC 1313)\nof galactic globular clusters (Da Costa & Armandroff 1990) with\ndifferent metal abundances (Fig. 2 and Table 4).\nWe took horizontal cuts across the RGB at two magnitudes:\nI = 24.5 ± 0.1 mag, I = 25.0 ± 0.1 mag. We determined the number distributions at those magnitudes, and corrected them for the\ncompleteness fraction. We can clearly identify the number peak\nin both histograms (Fig. 3) and their decline towards redder values of V − I. This suggests that we are seeing the central locus of\nthe RGB in NGC 1313. We estimate (V − I)0,−3.5 = (1.30 ± 0.08)\nmag (left panel of Fig. 3).\nUsing the relation in Lee et al. (1993), we infer [Fe/H] ≈\n−1.9 ± 0.3, which is what we qualitatively expect from an old\n\nFig. 2. (V − I, I) color-magnitude diagram of all the stars located in\nthe ACS field (see Fig. 1, left panel). The estimated 50% and 90%\ncompleteness limits are overplotted, as are the RGB loci of three\nGalactic globular clusters of various metallicities (from left to right:\nM15, NGC6752 and NGC1851; data from Da Costa & Armandroff\n1990).\n\n\fF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\n5\n\nFig. 1. Left panel: true color image (blue=F435W; green=F555W; red=F814W) of the region around X-2, from our HST/ACS observations. 1′′\nrepresents 19.4 pc at the distance of NGC 1313. The stellar environment is mainly composed of red stars from an old population. Two blue-star\nassociations can be seen: the main one to the west of the ULX counterpart and the other (smaller) one to the south-east. Right panel: zoomed-in\nview of the immediate vicinity of the counterpart, in the F435W filter. The ULX counterpart is the bright point-like source at the center of the\nimage. Contours of the Hα emission (at 10, 30, 50, 70 and 90% flux level above the background) are overplotted, from our VLT observations. Both\nyoung stellar associations are located or projected inside the Hα nebula.\n\nFig. 3. Color distribution of the stars in our HST/ACS field, at two values of I: 0.5 and 1.0 mag below the TRGB. The vertical lines correspond to\nthe RGB position of three galactic globular clusters at different metallicities.\nTable 4. Galactic globular clusters used for comparison with NGC 1313\nCluster\nNGC 7078 (M15)\nNGC6752\nNGC1851\n\n[Fe/H]\n-2.17\n-1.54\n-1.29\n\nMI,T RGB\n-4.095\n-3.948\n-4.039\n\npopulation at the outskirts or in the halo of a disk galaxy. For\nexample, a relation between metal abundance of the halo population and absolute V magnitude of the host galaxy was highlighted by Mouhcine et al. (2005) (in particular, their Fig. 3). For\nNGC 1313, which has MV = −18.72 mag (de Vaucouleurs et al.\n\n1991), the expected metal abundance of its halo is [Fe/H] ≈ −2–\n−1.5, in agreement with the abundance we found for the old population in the ULX field.\n\n> −2.5 mag, the RGB is very\nAt fainter magnitudes, MV ∼\nspread out and there is a substantial contribution from stars with\n0.5 <\n∼ (V − I)0 <\n∼ 1.0 (Fig. 3, right panel). They are consistent\nwith a population of younger stars, with ages around 1–2 Gyr.\nStar formation in the field surrounding the ULX may have had\nvarious episodes until as recently as 1 Gyr, before the last, localized episode, responsible for the formation of the few young\nstars around the ULX (Fig. 1 and Sect. 4.3.1).\n\n\f6\n\nF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\n4.2. Identification of the optical counterpart\n\n4.3. Groups of young stars around X-2\n\nhand we increase the reddening to E(B − V) = 0.20 mag we\nobtain ages around 10 Myr. However, in this case the two colormagnitude diagrams become less consistent and for a reddening\nof E(B − V) = 0.30 mag, as proposed by Liu et al. (2007), the\ntwo diagrams are no longer consistent with each other. In fact,\nthe color-magnitude diagram in the (B,V) system is almost nonphysical at this high reddening value because a few bright stars\nwould have a (B-V) color <\n∼ −0.4 mag. Our independent estimate\nof the reddening (Sect. 4.5) based on the Balmer decrement of\nthe nebula confirms a low reddening value (≈ 0.13) towards X-2.\nIt may be somewhat surprising that we do not see any red supergiants, which should be present in a 20 Myr-old population,\nand are often observed in other ULX fields of similar age (e.g.\nnear NGC 4559 X-1, Soria et al. 2005). Evolutionary tracks (e.g.\nGeneva tracks, Lejeune & Schaerer 2001) at Z = 0.008 show that\nstars in our inferred mass range move to the red part of the diagram for ≈ 0.4 Myr, return onto the blue loop for ≈ 1.3 Myr\nand then end up on the red side again for the last ≈ 0.04 Myr\nof their lives. We observe 5 stars brighter than MV = −4.5 mag,\ncurrently evolving off the main sequence, towards the blue supergiant phase. By taking a blue-to-red supergiant ratio ∼ 3, a\nvalue observed in metal-poor galaxies (Langer & Maeder 1995),\nwe expect to find about 1 or 2 red supergiants. Given this smallnumber-statistics (coupled with the uncertainty in the duration\nof the red-supergiant phase), we do not consider the absence of\nred supergiants in the young cluster to be significant.\n\n4.3.1. Masses and age\n\n4.3.2. Comparison with OB associations\n\nThe multicolor image (Fig. 1) already suggests that the stellar\npopulation immediately around X-2 is dominated by blue stars,\nin addition to a more uniform distribution of red, old stars that\notherwise dominate the outskirts of the galaxy. The blue stars are\nlargely concentrated in two areas separated by 15′′ (See Fig. 1);\nthe cluster located north-east of the ULX appears more rich in\nstars.\nColor-magnitude diagrams (Figs. 4, 5 and 6) confirm that\nthere are two populations of stars in the field: the old, dominant population of the host galaxy and a blue population with\n−0.25 mag < B − V < 0.0 mag. The brightest members of\nthe young population are at V ≈ 23 mag, corresponding to\nMV ≈ −5. We emphasize here that all the bright stars plotted\nin green in the diagrams (Figs. 4, 5 and 6) were also detected in\nthe UV band (F330W filter), which confirms that they belong to\na young population; the red stars are not visible in the UV band.\nThe brightest blue stars (V <\n∼ 24 mag) have probably already left\nthe main sequence, moving along the blue supergiant tracks.\nUsing isochrones from the Padua (Bertelli et al. 1994;\nGirardi et al. 2000; Salasnich et al. 2000; Girardi et al. 2002)\nor Geneva (Lejeune & Schaerer 2001) evolutionary tracks and\ntaking into account a reddening E(B-V)= 0.1 and an extinction\nbased on the Cardelli law (Cardelli et al. 1989), we derive an\nage for the cluster stars of ≈ 20 ± 5 Myr, which is in disagreement with the value (<\n∼ 10 Myr) reported by Liu et al. (2007)\n(Sect. 4.5). Our age estimate is based on the most luminous stars\nthat do not suffer from large photometric errors. We used tracks\ncorresponding to a metallicity Z = 0.008, as suggested by studies of HII regions (Walsh & Roy 1997; Hadfield & Crowther\n2007); but the inferred ages are only weakly dependent on metallicity. Looking at the evolutionary tracks shown in Fig. 6, we find\nthat the track of a 12 ± 4 M⊙ star agrees with the expected distribution of the most luminous blue stars. We conclude that both\nthe mass (12 M⊙ ) and brightness (V ≈ −5 mag) of these stars\nare consistent with the inferred age of ≈ 20 Myr. If on the other\n\nIt had been known for some time that ULXs are often associated with galaxy-wide or extended starburst regions (e.g. the\nAntennae, Zezas et al. 2002). However, some of them, such as\nHolmberg IX X-1 (Grisé et al. 2006; Ramsey et al. 2006) and\nthe ULX target of this study, seem to be far from any large-scale\nstar-forming activity. But the advent of large optical telescopes\nand the use of HST have now permitted the detection of small\ngroups of young stars also around these ULXs, strengthening\nthe association of ULXs with young stellar populations. X-2 is\nfar from the center of its host galaxy, in a region where no recent\nlarge-scale star-formation episodes have occurred. Only the two\nyoung groups of stars described above are present, superimposed\non a predominantly old- and intermediate-age population. These\nyoung groups are certainly not gravitationally bound, because\ntheir density is too low (some tens of stars scattered over 200 pc).\nBased on their integrated luminosities, we infer from Starburst99\nsimulations (Leitherer et al. 1999) that the two young stellar associations have masses M ≈ (5 ± 1) × 103 M⊙ for the north-west\ngroup and M ≈ (1.5 ± 0.5) × 103 M⊙ for the south-east group.\nSo, they have similar masses and sizes as typical OB associations in our Galaxy and other Local Group galaxies (∼ 103 M⊙\nin ≈ 200 pc, e.g. Gouliermis et al. 2003). The obvious question\nis what triggered this recent, isolated episode of star formation\nin this outer part of the galaxy? It was suggested (e.g. Soria\n2006) that several ULXs are located in regions perturbed by tidal\ninteractions or collisions. An intriguing, unexplained feature of\nNGC 1313 (in particular, of its southern half) is the presence\nof isolated HII regions (located ≈ 3′ north of the ULX), and of\nsome unusual, expanding HI supershells. It was previously suggested (Sandage & Brucato 1979; Blackman 1981; Peters et al.\n1994) that the southern side of the galaxy has been affected by\na collision or tidal interaction with a satellite galaxy. However,\nit was also noted (Ryder et al. 1995) that the largest HI supershell is spatially associated with the southern HII regions. Thus,\nit is also possible that the isolated HII regions and other local\n\nIn earlier studies of this ULX (Mucciarelli et al. 2005), two possible optical counterparts, named C1 and C2, were suggested. A\nmore accurate astrometric calibration of the Chandra and HST\nimages pointed in favour of C1 (Ramsey et al. 2006; Liu et al.\n2007). The two objects are separated by 0.′′ 8, i.e. 16 ACS pixels.\nMore importantly and contrary to the claims of Mucciarelli et al.\n(2005), we found (Pakull et al. 2006) that they can also be clearly\nresolved in our VLT spectra with a projected distance of 4 pixels\ncorresponding to 0.′′ 5. The characteristic high-excitation emission line spectrum displaying a broad HeIIλ4686 line that we\nobserved in C1 (Pakull et al. 2006, Grisé et al, in preparation)\nprovides the decisive proof that this is the optical counterpart\nof the ULX. Since C1 is a blue stellar object (see Table 5), this\nresult is also in agreement with the typical blue colors found in\nmost other optical ULX counterparts (Goad et al. 2002; Liu et al.\n2002, 2004; Kuntz et al. 2005; Liu et al. 2007). In fact, the optical counterpart is expected to contain emission from both the irradiated accretion disk and the donor star. A possible explanation\nfor the prevalence of blue colors was suggested by Madhusudhan\net al. (2007) and by Patruno & Zampieri (2008), based on theoretical evolutionary tracks of X-ray irradiated stars in a binary\nsystem.\n\n\fF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\n7\n\nTable 5. Brightness of the ULX counterpart in different filters, from the HST/ACS observations. Magnitudes are expressed both in the HST/ACS\nVegamag system and in the Johnson-Cousins (U BVRI) system, when possible. When converting from F555W to V for the 2004 Feb 22 observation,\nwe assumed that the (B − V) color of the counterpart was the same as on 2003 Nov 22. We also give the brightnesses reported by Liu et al. (2007),\nthat are consistent with our results except for the F330W/U band.\nFilter\nF330W / U\nF435W / B\nF555W / V\nF814W / I\nF555W / V\na\n\nExposure Time (s)\n2760\n2520\n1160\n1160\n2400\n\nDate\n2003 Nov. 22\n2003 Nov. 22\n2003 Nov. 22\n2003 Nov. 22\n2004 Feb. 22\n\nAperture Correction (mag)\n0.885\n0.441\n0.467\n0.467\n0.421\n\nVEGAmag\n21.733 ± 0.018\n23.423 ± 0.018\n23.587 ± 0.032\n23.614 ± 0.032\n23.426 ± 0.037\n\nJohnson Magnitude\n/\n23.49\n23.57\n23.61\n≈ 23.41\n\nVEGAmag a\n22.037 ± 0.021\n23.470 ± 0.017\n23.625 ± 0.026\n23.640 ± 0.043\n23.472 ± 0.021\n\nThese values come from Liu et al. (2007) and are cited for comparison with our work.\n\nFig. 4. HST/ACS color-magnitude diagrams for the stellar field around the ULX. HST/ACS magnitudes were transformed into the Johnson-Cousins\nsystem. Padua isochrones for stars of different ages are overplotted. Typical photometric errors are also plotted. Data have been corrected for the\nGalactic extinction (E(B − V) = 0.10 mag), the bar at the top left corner illustrating this effect. Left panel: Color-magnitude diagram in the (B,V)\nsystem. Right panel: Color-magnitude diagram in the (V,I) system. The same isochrones are plotted in the two panels, i.e for 10, 20, 50, 200\nand 500 Myr at Z = 0.008. We can see that the two diagrams are largely consistent with each other, excluding the need for a high extragalactic\nreddening E(B − V) = 0.23 advocated by Liu et al. (2007). This gives an age of about 20 Myr for the brightest stars in the young cluster.\n\nFig. 5. HST/ACS color-magnitude diagrams in the VEGAMAG photometry system. Left panel: color-magnitude diagram in the (F435W,F555W)\nsystem. Right panel: color-magnitude diagram in the (F555W,F814W) system. Our results are mostly consistent with those of Liu et al. (2007);\nhowever, we argue that we need a significantly lower extinction than claimed in that paper: E(B − V) = 0.10 mag instead of E(B − V) = 0.33\nmag which was used to bring the two color-magnitude diagrams into agreement. By comparing these diagrams with those of Fig. 4, we see that\nthe (V, I) and (F555W,F814W) isochrones are consistent with each other. However, the isochrones in the (B, V) and (F435W,F555W) systems are\nshifted by ≈ 0.1 mag in color with respect to each other. We thus find that the Padua isochrones in the (F435W,F555W) system are different from\nthose in the (B,V) system, transformed with the Sirianni et al. (2005) equations.\n\n\f8\n\nF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\nFig. 6. HST/ACS color-magnitude diagrams (Johnson-Cousins photometry) with Geneva evolutionary tracks for stars of different initial masses (4,\n7, 12 and 20 M⊙ ) with Z = 0.008. Left panel: color-magnitude diagram in the (B, V) system. Right panel: color-magnitude diagram in the (V, I)\nsystem. Both diagrams are consistent with a mass ≈ 12 M⊙ for the brightest young stars in the field.\n\nepisodes of star formation are the result of collisions of large HI\nclouds with the galactic disk (Marcelin & Gondoin 1983). It was\nrecently noticed that such phenomena may be associated with localized star formation in NGC4395 (Heald & Oosterloo 2007).\nWe speculate that the isolated complex of young stars around the\nULX may also have been formed through a similar event.\n4.4. Comparison between HST and VLT photometry\n\nOne of the objectives of our study is to see whether there have\nbeen significant changes in the brightness of the ULX counterpart between the HST and VLT observations. To do so, we need\nto compare its brightness with those of neighboring, isolated\nstars in the two observations. This will also provide a check on\nthe absolute photometric calibration between the two datasets.\nSuch a comparison is partly hampered by the difference in resolution: most of the stars detected as single sources in the VLT\nimages are resolved into multiple components in the HST images. Besides, the brightest stars are usually saturated in one or\nthe other datasets.\nNonetheless, there are about twenty bright, isolated sources\nthat appear point-like and not saturated in either of the VLT and\nHST images. Crucially, the seeing of the VLT observations was\ngood enough (Table 2) to resolve the true ULX counterpart from\nits close companion. In Fig. 7 we show the magnitude difference\nof these stars observed with FORS1 and ACS B and V filters. For\n≈ 40% of these stars the HST and VLT brightnesses are the same\nwithin the photometric errors of the two observations. But even\nfor the other stars, the discrepancy does not exceed ≈ 0.1 mag in\neither filter. Overall, the standard 1σ deviations are σB = 0.05\nmag and σV = 0.07 mag. We conclude that absolute photometry\nbetween VLT and HST can be achieved to a precision of less\nthan about 0.1 mag.\nWe have then carried out a photometric study of the ULX\ncounterpart in the VLT/FORS1 images (Table 6). Its colors could\nbe affected by an additional error of ≈ 0.1 mag due to variability\nin one of the filters between different observations. As we do not\nhave consecutive frames in different filters, we used the closest\nobservations available to minimize the effect of color variability.\nOnce again, we can see that the absolute brightness measured in\nthe VLT frames is in good agreement with the HST results. We\n\nwill later show (Sect. 5.2) that the remaining differences could\nbe explained as intrinsic variability of the ULX counterpart.\n4.5. On the conversion between the ACS photometric\nsystem and more standard colors\n\nThe HST/ACS data of X-2 have also been analyzed and discussed in two recent papers (Ramsey et al. 2006; Liu et al. 2007).\nWe have carefully retraced their analyses and noticed some differences with respect to the results we have independently obtained from the same dataset. Most of the discrepancy seems to\nbe related to the choice of photometric system for the datapoints\nand the evolutionary tracks employed.\nWe analyzed the data in two different ways which, in principle, should lead to identical conclusions. First, we compared\nthe datapoints directly measured in the HST/ACS system colors\nwith the Padua isochrones in the HST/ACS system. Then, we\ntransformed the HST/ACS colors to the more-standard JohnsonCousins colors via the Sirianni et al. (2005) transformations,\nand compared these datapoints with the Padua Johnson-Cousins\nisochrones. Both sets of isochrones were independently calculated and supplied by Girardi et al. (2002) and Girardi1 (in preparation).\nSurprisingly these two methods give different results (Figs.\n4 & 5), leading to different estimates of stellar ages and masses !\nTo investigate the reason for this discrepancy, we also transformed the Padua Johnson-Cousins isochrones to the HST/ACS\nsystem using the recommended Sirianni et al. (2005) transformations: the result is different from the Padua HST/ACS isochrones\nsupplied by Girardi (in preparation), especially for the B band.\nComparing our results with those of Liu et al. (2007), we\ncan immediately see the effect of this discrepancy. Although\nour observed brightnesses and colors are consistent with theirs\n(Table 5), our determination of the age of the young stellar population is different (≈ 20 Myr instead of their <\n∼ 10 Myr), with obvious consequences for the physical interpretation of the ULX.\nThe Padua HST/ACS isochrones suggest different ages of the\nyoung stars in the (F555W versus F435W-F555W) and (F814W\nversus F555W-F814W) color-magnitude diagrams (Fig. 5). An\n1\nsee http://pleiadi.pd.astro.it & http://stev.oapd.inaf.it/cmd for data\naccess\n\n\fF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\n9\n\nFig. 7. Difference between VLT/FORS1 and HST/ACS photometry, in the B (left panel) and V band (right panel). For this comparison, we only\nused bright, isolated stars. We find that 40% of them lie within the combined photometric errors of the HST and VLT observations (solid red lines),\nand for most of the others the difference is only ≤ 0.1 mag (dashed blue lines).\nTable 6. Brightness of the ULX counterpart in different filters, from our VLT/FORS1 observations. To minimize the effects of variability, the B − V\ncolor was estimated using the 2003 Dec 25 B exposure, while the B − R color was estimated using the 2003 Dec 24 B exposure.\nFilter\nB\nV\nR\n\nExposure Time (s)\n420/840\n600\n500\n\nDate\n2003 Dec. 24/25\n2003 Dec. 25\n2003 Dec. 24\n\nobvious way to reconcile this discrepancy is to take the younger\nage and assume a high local extinction, which led Liu et al.\n(2007) to conclude that E(B − V) = 0.33 mag.\nHowever, as we showed in Sect. 4.3.1, if we transform the\nobserved brightnesses and colors to the Johnson-Cousins system\nand compare them with the Padua Johnson-Cousins isochrones,\nwe obtain the same age in the (V versus B − V) and (I versus\nV − I) color-magnitude diagrams (Fig. 4) with no need for an\nextinction greater than the Galactic line-of-sight value. An independent argument in favor of low extinction comes from the\nspectrum of the bubble nebula around the ULX, in which the\nBalmer decrement suggests E(B − V) = 0.13 ± 0.03 mag (Grisé\net al., in preparation), which is inconsistent with the higher values advocated by Liu et al. (2007). Thus, we suspect that the\nPadua Johnson-Cousins isochrones are the more reliable set of\ntracks. In any case, we emphasize that the discrepancy between\nthe two widely-used sets of tracks in the literature deserves further investigation. We caution that conclusions based on ACS\nF435W and F555W photometry alone and in combination with\ncorresponding Padua evolutionary tracks may well be misleading.\nThe F435W and F555W filter data from the same HST/ACS\ndataset were also studied by Ramsey et al. (2006). They de7\nrived an age >\n∼ 10 yr and stellar masses <\n∼ 10M⊙ . Although\ntheir results appear to be in agreement with ours, we cannot directly compare our analysis with their approach, because their\npaper does not provide information on how they converted from\nF435W and F555W to B and V bands. Moreover, there seem\nto be some inconsistencies because the galactic extinction is\nnot accounted for when they estimate the stellar age. Finally,\nRamsey et al. (2006) found that the ULX counterpart has MV =\n−3.96 ± 0.02 mag, which is clearly inconsistent (by ≈ 1.0 mag)\nwith both our result and that of Liu et al. (2007).\n\nMagnitude\n23.40 ± 0.02 / 23.44 ± 0.03\n23.45 ± 0.04\n23.58 ± 0.05\n\nAbsolute Magnitude\n-5.0\n-4.9\n-4.6\n\n5. Nature of the ULX optical counterpart\n5.1. Constraints from photometry\n\nWe have seen (Sect. 4.3.1) that the young population of stars is\nconsistent with an age of (20 ± 5) Myr, and with an upper mass\nlimit for non-collapsed stars of (12 ± 4) M⊙ . Although it is problematic to draw any inferences about the ULX mass-donor star\nfrom photometry alone, due to unknown effects of X-ray irradiation and binary evolution (Patruno & Zampieri 2008), we can\nat least say that the ULX optical counterpart shares the same\nbrightness and colors as the brightest stars in the young association. If the counterpart is believed to be optically dominated\nby a normal star, its magnitude (MV ∼ −5 mag) is consistent\nwith those of an early B-type or a late-type O star, although its\ncolors ((B − V)0 ∼ −0.18, (V − I)0 ∼ −0.16) are more consistent with an already somewhat evolved B-type star. But taking\ninto account that we also expect a contribution from the accretion disk to the integrated properties of the ULX counterpart (see\nSect. 5.2), the estimated values of brightness and hence mass\nfor the donor star are necessarily upper limits. In fact, numerical models of stellar-mass black-hole X-ray binaries with donor\nstars in the mass range 2–17 M⊙ (Rappaport et al. 2005) suggest that the accretion disk should dominate the optical emission\nfrom the binary system.\nFrom the empirical point of view, we draw attention to the\nwell-known van Paradijs & McClintock (1994) diagram which\nshows a strong correlation over 10 absolute magnitudes between the observed quantity Σ and the absolute visual magnitude MV for disk dominated low mass X-ray binaries. Here,\nΣ = (LX /1038 erg/s)1/2 × (P/1hr)2/3 × (M/(2 M⊙ ))1/3 which reflects the simple assumption that the total bolometric luminosity\nLbol of an X-ray irradiated disk is proportional to the X-ray luminosity and the disk area. At optical wavelengths, the surface\nbrightness varies as T 2 , hence Lopt ∼ L1/2\nbol × a, where a is the or-\n\n\f10\n\nF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\nbital separation. Following black hole binary evolutionary model\ncomputations by Podsiadlowski et al. (2003) and Rappaport et al.\n(2005), an orbital period of 1–6 days and a total mass of some\n20 M⊙ are expected for the ULX which, using LX ∼ 1040 erg/s\nresults in logΣ = 2.2–2.7. In the van Paradijs & McClintock\n(1994) diagram such values correspond to an absolute disk magnitude MV = −4.0 – −5.0 which in fact is close to the observed\nbrightness of the optical counterpart of X-2.\nTaking the likely disk contribution into account, we conclude\nthat the donor star in the ULX system has a mass of ≈ 10 M⊙\n(Rappaport et al. 2005).\nWith the currently available data, it is however difficult to\nmake more specific statements about the companion star. More\ninformation will come from our spectroscopic study currently in\nprogress2, which will constrain the orbital period and hence the\nsize of the system, and will help in resolving the stellar and disk\ncontribution to the optical spectrum. Deep spectra will possibly\nidentify narrow absorption lines from the donor star as well as\nbroader emission lines from the disk.\n5.2. Photometric variability in the VLT data\n\nIn addition to determining average brightnesses and colours, we\nhave searched for short and long term variability of the ULX\ncounterpart. To that end we have applied differential photometry\nby using four relatively bright (B ∼ 19–20 mag) comparison\nstars with relative photometric errors < 0.03 mag. We have\nplotted (Fig. 8, left panel) the B-band light curve of the counterpart and of a slightly fainter comparison (check) star of similar\nbrightness. Each datapoint refers to an 840-s observation,\nwhich can be either a single exposure or two consecutive 420-s\nexposures, depending on the observational setup. The observing\nconditions were clear with good (sub-arcsec) seeing (Table 2).\nThe error bars are relatively large because of the relatively large\nairmasses in many of our exposures; NGC 1313 is low in the\nParanal sky (airmass >\n∼ 1.3).\nFirst, we found a trend of increasing brightness for the ULX\ncounterpart (Fig. 8), with a change of ≈ 0.2 mag over the whole\nobserving period. Moreover, repeated observations during the\nnight of December 24 show the ULX counterpart to also be variable on timescales of about one hour. By contrast, the comparison star shows significantly less scatter, and is consistent with\nhaving a constant brightness within the photometric errors. The\nmaximum amplitude of the variations is 0.22 ± 0.04 mag for the\nULX counterpart, and only 0.06 ± 0.05 mag for the comparison\nstar. We used a χ2 test to assess more quantitatively whether or\nnot the observed variability is statistically significant. To do this,\nwe calculated\nn\nX\n(xi − x̄)2\nχ2 ≡\n,\nσ2i\ni=1\nwhere n is the number of observations (with n−1 degrees of freedom), xi are the measured brightnesses, x̄ the median brightness\nand σi the error on each measure. Here we multiplied the formal error given by DAOPHOT by 1.15 in order to match the error\ndistribution of the stars in the field with the expected χ2 distribution in Fig. 9. For the ULX counterpart, we obtain χ2 = 69.0\nfor 15 d.o.f., corresponding to a probability of only 7 × 10−9 for\nthe null hypothesis of constant brightness. For the comparison\nstar we obtain χ2 = 9.7 for 15 d.o.f, corresponding to a constantbrightness probability of 84%. During the night of December 24,\n2\n\n13 hours of observations executed on VLT/FORS1\n\nwe find χ2 = 13.6 for 6 d.o.f. for the counterpart which translates\ninto a probability of 3.4% for it being constant. The comparison\nstar has χ2 = 5.2 for 6 d.o.f, which gives a probability of 52%\nfor the null hypothesis.\nThus, we have clear evidence that the ULX counterpart is\nvariable on timescales ranging from hours to several days during our VLT observations. We further tested the significance of\nthis variability by comparing the behavior of all the point-like\nsources in the brightness range 23 mag < B < 24 mag. For 92\nout of 109 sources (84%), we obtain a constant-brightness probability of more than 5%, as expected from non-variable sources\n(Fig. 9). The ULX counterpart clearly shows much higher scatter\nin its brightness measurements, compared with most other stars.\nOnly 2% of the field stars display variability equal or greater than\nthe ULX counterpart. In fact, a careful inspection of the position\nof the stars on the frame shows that the great majority of stars\nwith a probability below 0.1% for the null hypothesis of constant\nbrightness are located in the north-west sector, where crowding\nis more severe, or are situated in the immediate vicinity of other\nbright stars. In those cases, a very small fluctuation of the seeing\nmay severely affect PSF fitting and brightness estimates. These\nstars were removed from the sample and are therefore not plotted in Fig. 9. Note that the ULX counterpart does not suffer from\nconfusion with any other nearby sources. In conclusion, we argue that the observed variability of the ULX counterpart is statistically significant and is not due to spurious effects such as\nsource confusion.\nWe believe that the observed scatter in the ULX brightness\nis a real effect, probably due to the same kind of short-term variability seen in many low-mass X-ray binaries (for example, in\nLMC X-2: McGowan et al. 2003). This is generally understood\nas disk reprocessing of variable X-ray emission although simultaneous optical and X-ray observations do not always show a\nclear correlation between the brightnesses in these bands.\nOther luminous stars are also known to display irregular\n∼ 0.2 mag variations in their light curves: in particular, Be stars\n(e.g. Dachs 1987), which would also have a luminosity consistent with this ULX counterpart. In Be stars, the variability is\nmostly due to the formation of a circumstellar disk or extended\nenvelope, with typical radii of a few times the stellar radius (e.g.\nPorter & Rivinius 2003). However, the donor star in a ULX is\nthought to be almost persistently filling its Roche lobe; accretion onto the BH from a stellar wind or a Be disk is not sufficient\nto produce the observed, persistent X-ray luminosity and would\nprobably give rise to large X-ray outbursts.\nIn any case, the optical variability suggests a non-negligible\nflux contribution from the accretion disk-unlike the situation\nencountered in normal high-mass X-ray binaries, where the optical light is dominated by emission from the OB mass donor.\nIn order to look for periodic variations we computed a LombScargle periodogram of the light curve (IDL scargle routine3 ,\nJoern Wilms 2000); however, no significant period was found.\nThis indicates that we are not primarily seeing ellipsoidal variations of the companion star over the binary orbit as would be\nexpected by a Roche-lobe filling star not seen pole-on. However,\nsuch variations could be masked by the random variations of the\nreprocessed X-ray flux on the accretion disk and on the irradiated hemisphere of the companion.\nIn view of this interpretation, it is useful to compare the optical and X-ray variability. X-2 was observed by XMM-Newton at\nthe same time as the VLT observation. It was found (Mucciarelli\net al. 2007) that the X-ray brightness rose sharply between 2003\n3\n\nhttp://astro.uni-tuebingen.de/software/idl/aitlib/timing/scargle.html\n\n\fF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\n11\n\nFig. 8. Left panel: B-band variability of the ULX counterpart (red datapoints) over 1 month of observations with VLT/FORS1. The blue datapoints\nshow the much less variable behavior of a comparison star of similar brightness and color; its zeropoint has been shifted downwards by 0.22 mag\nfor clarity. Right panel: zoomed-in view of the ULX brightness during the 2003 December 24 observations: the source (red datapoints) shows\n≈ 0.10 mag variability on timescales of about one hour. See Sect. 5.2 for a discussion on the statistical significance of such variability.\n\nDec 21 and 25 (resp. MJD52294 and MJD52998) and declined\nagain afterwards. By contrast, we do not see a corresponding\noptical flare on a similar timescale (Fig. 11). The optical counterpart did not become fainter after the end of the X-ray flare;\ninstead, it was ≈ 0.2 mag brighter on 2004 Jan 15 than during\n2003 Dec 24–25, even though the X-ray luminosity was lower\nby a factor 2.\n5.3. Variability in the combined VLT/HST data set\n\nWe showed in Sect. 4.4 that the absolute photometry of our HST\nand VLT observations are consistent with each other. Therefore,\nwe can extend our variability study by adding the two HST/ACS\ndatapoints to the B-band VLT light curve discussed earlier. We\ndo not have an F435W HST/ACS observation on 2004 Feb 22,\nbut we have used the F555W brightness and converted it to a\nB brightness by using the B − V color measured in the 2003\nNov HST data. Assuming that the color has stayed constant, we\nfind that the optical counterpart has brightened by ≈ 0.15 mag\nwith respect to the first HST observation three months earlier\n(Fig. 10).\n\nFig. 9. χ2 test of the null hypothesis (no brightness variability) for all the\nstars in the VLT/FORS1 frame with 23 mag < B < 24 mag. With a χ2 ≈\n84.97 for 15 degrees of freedom (i.e, a probability of constant brightness\nof 7 × 10−9 ), the ULX counterpart is more variable than almost all the\nother sources in the field, including the star we chose for comparison in\nFig. 8. Overplotted is the χ2 distribution for 15 degrees of freedom.\n\n6. Conclusions\nWe combined the high sensitivity of VLT/FORS1 and the high\nspatial resolution of HST/ACS for a detailed photometric study\nof the optical counterpart to the ULX X-2 and of its immediate environment in the southern part of the galaxy NGC 1313.\nThe dominant stellar population in that region of the galaxy is\nold (> 1 Gyr). From the brightness and colours of its red giant\nbranch, we re-estimated the distance to the galaxy as 4.07 ± 0.22\nMpc, consistent with previous studies which used observations\nfrom the north-west part of the galaxy. We also estimated that\nthe average metallicity of the old stellar population is [Fe/H]\n= −1.9 ± 0.3, consistent with the typical metallicity found in\nhaloes of spiral galaxies of similar size.\nNear the ULX, we highlighted two groups of (a few) young\nstars, spread out over ≈ 200 pc, and hence more similar to an\nOB association (or more likely, two separate associations close\nto each other) rather than to a bound cluster. They clearly stand\nout in brightness and colors over the surrounding old population.\n\nThere are no other similar groups of young stars in this region\nof the galaxy, nor are they connected to spiral arm features.\nThe reason for this recent, localized episode of star formation\nis unclear, but the ULX is clearly associated with this young\npopulation. We speculate that the local star-formation episode\nmay have been triggered by a collisional event (proposed for the\nGould's Belt in the Milky Way) with a satellite galaxy or, more\nlikely, with a fast-moving HI cloud transiting across the disk\nplane (for which there is independent evidence in NGC 1313).\nWe estimate that the largest association of young stars has\nan age ≈ 20 Myr and a stellar mass ≈ 5 × 103 M⊙ . The ULX\noptical counterpart appears as one of the brightest stars in the\nassociation, without any obvious color or brightness anomaly.\nUsing standard stellar evolutionary tracks, we constrain its mass\nto be <\n∼ 12M⊙ ; or even less, if the accretion disk is signif-\n\n\f12\n\nF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\n\nFig. 10. Combined B-band light curve of the ULX counterpart between\n2003 November 22 and 2004 February 22, from the VLT/FORS1 and\nHST/ACS data. The HST/ACS datapoints are the first and last one.\n\nFig. 11. X-ray (top) and B-band (bottom) light curve of the ULX counterpart. Note that the X-ray flux is taken from Mucciarelli et al. (2007).\n\nicantly contributing to the source luminosity. Our mass estimate is smaller than reported in previous work (Liu et al. 2007),\nand correspondingly, we estimate relatively older ages for the\nyoung stars. We argue that the most likely reason for that is\na discrepancy between the Padua isochrones in the HST/ACS\nVEGAMAG system and those in the standard Johnson-Cousins\nsystem. The two sets of isochrones are not related to each other\nvia the same Sirianni transformations (Sirianni et al. 2005) that\nare generally accepted as the best way to transform the brightness and colors of the observed sources from the HST/ACS\nVEGAMAG system to the Johnson-Cousins system. We showed\nthat the HST/ACS isochrones indicate different ages for the same\ndataset, in the (F814W, F555W − F814W) and (F555, F435 −\nF555W) color-magnitude diagrams. By contrast, the JohnsonCousins isochrones give consistent ages, when applied to the\nsame datapoints transformed via Sirianni's equations. For this\nreason, we believe that the Johnson-Cousins isochrones are more\nreliable. In any case, this is an issue deserving further investigation. Although the resulting differences in masses and ages may\nappear small, they can have a large effect on the physical interpretation of the ULX, for example regarding its accretion rate\nand duration of the active phase.\n\nOne of the most significant findings of this work is the shortterm variability of the ULX counterpart, by up to ≈ 0.2 mag,\non timescales of hours and days. This is detected both in the\nHST/ACS and in the VLT/FORS1 datasets, and even more evident in the combined dataset. There is no evidence of periodicity.\nThis suggests that the variability is not due to ellipsoidal variations. Instead, it may be caused by varying X-ray irradiation of\nthe donor star and (more likely) a stochastically-varying contribution from the accretion disk.\nOur work, and other recent multi-band studies of ULXs,\nsuggest that those systems share most of their properties with\nGalactic X-ray binaries, although at higher luminosities. The\ndonor star need not be an extraordinarily massive object, or even\nan O star; in fact, it appears to be a common-or-garden B star.\nThe accretion disk may be as luminous (or possibly even more\nluminous) as the donor star, even in the optical bands, which\nis consistent with a high X-ray luminosity and high accretion\nrate. We also showed that the total stellar mass in the young stellar associations around the X-2 ULX is < 104 M⊙ : thus X-2 is\nclearly not in a super-star-cluster. This means that whatever the\nnature of the compact object is (stellar-mass or IMBH), it was\nnot formed via a runaway-coalescence scenario as proposed by\nEbisuzaki et al. (2001) and Portegies Zwart & McMillan (2002).\nBut X-2 has been proposed as one of the best candidates for\nan IMBH (M ∼ 1000M⊙), because this ULX has a supersoft\nspectral component at 0.15 keV (Miller et al. 2003). We have\nshown in our study that X-2 sits in a normal OB association\nso if this ULX is an IMBH, it means that there must be other\nways of forming such objects. More likely, we suggest that X-2\nis not an IMBH and that it was formed within the stellar association via a more conventional stellar evolutionary scenario. We\npoint out here that X-2 is not an exceptional case. Indeed, most\nother luminous ULXs do not sit in super-star-clusters either (e.g.\nHolmberg IX X-1), but are part of much smaller associations.\nIn those cases, either there is a different way to form IMBHs,\nor more likely most of them have a mass <\n∼ 100M⊙ and formed\nfrom ordinary stellar evolution.\nFor a definitive answer on the BH mass it is crucial to derive\nthe parameters of the binary system, via phase-resolved observations. The apparently random variability of the optical counterpart, interpreted as the effect of X-ray reprocessing in the accretion disk and on the surface of the secondary will probably\nmask periodic variability such as ellipsoidal variations or the Xray heating curve. Thus, it may be hard to detect the signature of\nthe binary period from photometric observations. On the other\nhand, spectroscopic observations (currently in progress) may allow us to determine the phase-resolved radial-velocity curve of\nthe HeIIλ4686 disk emission line, and hence to constrain the BH\nmass.\nBased on observations made with ESO Telescopes at the\nParanal Observatory under programme ID 072.D0614 and\non observations made with the NASA/ESA Hubble Space\nTelescope, obtained from the data archive at the Space Telescope\nInstitute. STScI is operated by the association of Universities for\nResearch in Astronomy, Inc. under the NASA contract NAS 526555.\n\nReferences\nAbolmasov, P., Fabrika, S., Sholukhova, O., & Afanasiev, V. 2007a,\nAstrophysical Bulletin, 62, 36\nAbolmasov, P. K., Swartz, D. A., Fabrika, S., et al. 2007b, ApJ, 668, 124\nBegelman, M. C. 2002, ApJ, 568, L97\n\n\fF. Grisé et al.: The ultraluminous X-ray source NGC 1313 X-2\nBertelli, G., Bressan, A., Chiosi, C., Fagotto, F., & Nasi, E. 1994, A&AS, 106,\n275\nBertin, E. & Arnouts, S. 1996, A&AS, 117, 393\nBlackman, C. P. 1981, MNRAS, 195, 451\nCardelli, J. A., Clayton, G. C., & Mathis, J. S. 1989, ApJ, 345, 245\nColbert, E. J. M. & Mushotzky, R. F. 1999, ApJ, 519, 89\nDa Costa, G. S. & Armandroff, T. E. 1990, AJ, 100, 162\nDachs, J. 1987, in IAU Colloq. 92: Physics of Be Stars, ed. A. Slettebak & T. P.\nSnow, 149–170\nde Vaucouleurs, G., de Vaucouleurs, A., Corwin, Jr., H. G., et al. 1991, Third\nReference Catalogue of Bright Galaxies (Volume 1-3, XII, 2069 pp. 7\nfigs.. Springer-Verlag Berlin Heidelberg New York)\nDewangan, G. C., Griffiths, R. E., & Rao, A. R. 2006, ApJ, 641, L125\nEbisuzaki, T., Makino, J., Tsuru, T. G., et al. 2001, ApJ, 562, L19\nFabbiano, G., Zezas, A., King, A. R., et al. 2003, ApJ, 584, L5\nFeng, H. & Kaaret, P. 2006, ApJ, 650, L75\nGirardi, L., Bertelli, G., Bressan, A., et al. 2002, A&A, 391, 195\nGirardi, L., Bressan, A., Bertelli, G., & Chiosi, C. 2000, A&AS, 141, 371\nGoad, M. R., Roberts, T. P., Knigge, C., & Lira, P. 2002, MNRAS, 335, L67\nGouliermis, D., Kontizas, M., Kontizas, E., & Korakitis, R. 2003, A&A, 405,\n111\nGrisé, F., Pakull, M. W., & Motch, C. 2006, in IAU Symposium, Vol. 230,\nPopulations of High Energy Sources in Galaxies, ed. E. J. A. Meurs &\nG. Fabbiano, 302–303\nHadfield, L. J. & Crowther, P. A. 2007, MNRAS, 381, 418\nHeald, G. & Oosterloo, T. 2007, ArXiv e-prints, 712.1184\nIrwin, J. A., Bregman, J. N., & Athey, A. E. 2004, ApJ, 601, L143\nKaaret, P., Ward, M. J., & Zezas, A. 2004, MNRAS, 351, L83\nKarachentsev, I. D., Karachentseva, V. E., Huchtmeier, W. K., & Makarov, D. I.\n2004, AJ, 127, 2031\nKing, A. R., Davies, M. B., Ward, M. J., Fabbiano, G., & Elvis, M. 2001, ApJ,\n552, L109\nKoekemoer, A. M., Fruchter, A. S., Hook, R. N., & Hack, W. 2002, in The 2002\nHST Calibration Workshop : Hubble after the Installation of the ACS and the\nNICMOS Cooling System, ed. S. Arribas, A. Koekemoer, & B. Whitmore,\n337–+\nKrauss, M. I., Kilgard, R. E., Garcia, M. R., Roberts, T. P., & Prestwich, A. H.\n2005, ApJ, 630, 228\nKuntz, K. D., Gruendl, R. A., Chu, Y.-H., et al. 2005, ApJ, 620, L31\nLa Parola, V., Peres, G., Fabbiano, G., Kim, D. W., & Bocchino, F. 2001, ApJ,\n556, 47\nLang, C. C., Kaaret, P., Corbel, S., & Mercer, A. 2007, ApJ, 666, 79\nLanger, N. & Maeder, A. 1995, A&A, 295, 685\nLee, M. G., Freedman, W. L., & Madore, B. F. 1993, ApJ, 417, 553\nLeitherer, C., Schaerer, D., Goldader, J. D., et al. 1999, ApJS, 123, 3\nLejeune, T. & Schaerer, D. 2001, A&A, 366, 538\nLiu, J.-F., Bregman, J., Miller, J., & Kaaret, P. 2007, ApJ, 661, 165\nLiu, J.-F., Bregman, J. N., & Seitzer, P. 2002, ApJ, 580, L31\nLiu, J.-F., Bregman, J. N., & Seitzer, P. 2004, ApJ, 602, 249\nMadhusudhan, N., Rappaport, S., Podsiadlowski, P., & Nelson, L. 2007, ArXiv\ne-prints, 710.3854\nMakishima, K., Kubota, A., Mizuno, T., et al. 2000, ApJ, 535, 632\nMarcelin, M. & Gondoin, P. 1983, A&AS, 51, 353\nMcGowan, K. E., Charles, P. A., O'Donoghue, D., & Smale, A. P. 2003,\nMNRAS, 345, 1039\nMcHardy, I. M., Koerding, E., Knigge, C., Uttley, P., & Fender, R. P. 2006,\nNature, 444, 730\nMéndez, B., Davis, M., Moustakas, J., et al. 2002, AJ, 124, 213\nMiller, J. M., Fabbiano, G., Miller, M. C., & Fabian, A. C. 2003, ApJ, 585, L37\nMiller, N. A., Mushotzky, R. F., & Neff, S. G. 2005, ApJ, 623, L109\nMizuno, T., Miyawaki, R., Ebisawa, K., et al. 2007, PASJ, 59, 257\nMouhcine, M., Ferguson, H. C., Rich, R. M., Brown, T. M., & Smith, T. E. 2005,\nApJ, 633, 821\nMucciarelli, P., Casella, P., Belloni, T., Zampieri, L., & Ranalli, P. 2006,\nMNRAS, 365, 1123\nMucciarelli, P., Zampieri, L., Falomo, R., Turolla, R., & Treves, A. 2005, ApJ,\n633, L101\nMucciarelli, P., Zampieri, L., Treves, A., Turolla, R., & Falomo, R. 2007, ApJ,\n658, 999\nPakull, M. W. & Grisé, F. 2008, ArXiv e-prints, 803.4345\nPakull, M. W., Grisé, F., & Motch, C. 2006, in IAU Symposium, Vol. 230,\nPopulations of High Energy Sources in Galaxies, ed. E. J. A. Meurs &\nG. Fabbiano, 293–297\nPakull, M. W. & Mirioni, L. 2002, ArXiv Astrophysics e-prints, 0202488\nPakull, M. W. & Mirioni, L. 2003, in Revista Mexicana de Astronomia y\nAstrofisica Conference Series, Vol. 15, Revista Mexicana de Astronomia y\nAstrofisica Conference Series, ed. J. Arthur & W. J. Henney, 197–199\nPatruno, A. & Zampieri, L. 2008, MNRAS, 386, 543\n\n13\n\nPellerin, A., Meyer, M., Harris, J., & Calzetti, D. 2007, ApJ, 658, L87\nPeters, W. L., Freeman, K. C., Forster, J. R., Manchester, R. N., & Ables, J. G.\n1994, MNRAS, 269, 1025\nPodsiadlowski, P., Rappaport, S., & Han, Z. 2003, MNRAS, 341, 385\nPortegies Zwart, S. F. & McMillan, S. L. W. 2002, ApJ, 576, 899\nPorter, J. M. & Rivinius, T. 2003, PASP, 115, 1153\nRamsey, C. J., Williams, R. M., Gruendl, R. A., et al. 2006, ApJ, 641, 241\nRappaport, S. A., Podsiadlowski, P., & Pfahl, E. 2005, MNRAS, 356, 401\nRemillard, R. A., Muno, M. P., Morgan, E. H., & McClintock, J. E.\n2003, in Astronomical Society of the Pacific Conference Series, Vol. 308,\nAstronomical Society of the Pacific Conference Series, ed. E. P. van den\nHeuvel, L. Kaper, E. Rol, & R. A. M. J. Wijers, 157–+\nRizzi, L., Tully, R. B., Makarov, D., et al. 2007, ApJ, 661, 815\nRoberts, T. P. 2007, Ap&SS, 311, 203\nRosado, M., Ghosh, K. K., & Fuentes-Carrera, I. 2008, ArXiv e-prints, 803.3003\nRyder, S. D., Staveley-Smith, L., Malin, D., & Walsh, W. 1995, AJ, 109, 1592\nSalasnich, B., Girardi, L., Weiss, A., & Chiosi, C. 2000, A&A, 361, 1023\nSandage, A. & Brucato, R. 1979, AJ, 84, 472\nSchlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500, 525\nShakura, N. I. & Syunyaev, R. A. 1973, A&A, 24, 337\nShaposhnikov, N. & Titarchuk, L. 2007, ApJ, 663, 445\nSirianni, M., Jee, M. J., Benı́tez, N., et al. 2005, PASP, 117, 1049\nSoria, R. 2006, ArXiv Astrophysics e-prints, 0611152\nSoria, R. 2007, Ap&SS, 311, 213\nSoria, R., Baldi, A., Risaliti, G., et al. 2007, MNRAS, 379, 1313\nSoria, R., Cropper, M., Pakull, M., Mushotzky, R., & Wu, K. 2005, MNRAS,\n356, 12\nSoria, R., Fender, R. P., Hannikainen, D. C., Read, A. M., & Stevens, I. R. 2006,\nMNRAS, 368, 1527\nSoria, R. & Motch, C. 2004, A&A, 422, 915\nStrohmayer, T. E. & Mushotzky, R. F. 2003, ApJ, 586, L61\nStrohmayer, T. E., Mushotzky, R. F., Winter, L., et al. 2007, ApJ, 660, 580\nSwartz, D. A., Ghosh, K. K., Tennant, A. F., & Wu, K. 2004, ApJS, 154, 519\nSwartz, D. A., Soria, R., & Tennant, F. T. 2008, ApJ, accepted for publication in\nApJ\nTully, R. B. 1988, Nearby galaxies catalog (Cambridge and New York,\nCambridge University Press, 1988, p.221)\nvan Paradijs, J. & McClintock, J. E. 1994, A&A, 290, 133\nWalsh, J. R. & Roy, J.-R. 1997, MNRAS, 288, 726\nZezas, A., Fabbiano, G., Rots, A. H., & Murray, S. S. 2002, ApJ, 577, 710\n\n\f"}