{"id": "http://arxiv.org/abs/0802.0791v1", "guidislink": true, "updated": "2008-02-06T13:37:22Z", "updated_parsed": [2008, 2, 6, 13, 37, 22, 2, 37, 0], "published": "2008-02-06T13:37:22Z", "published_parsed": [2008, 2, 6, 13, 37, 22, 2, 37, 0], "title": "A translation-invariant renormalizable non-commutative scalar model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.4186%2C0802.0528%2C0802.1458%2C0802.2096%2C0802.1875%2C0802.0905%2C0802.1243%2C0802.2733%2C0802.0622%2C0802.0956%2C0802.0499%2C0802.2292%2C0802.0723%2C0802.1674%2C0802.2151%2C0802.0716%2C0802.1939%2C0802.1908%2C0802.1698%2C0802.3218%2C0802.1844%2C0802.2911%2C0802.3310%2C0802.2724%2C0802.1927%2C0802.0877%2C0802.1315%2C0802.2419%2C0802.2745%2C0802.1279%2C0802.1024%2C0802.0791%2C0802.0235%2C0802.2162%2C0802.2903%2C0802.3800%2C0802.1106%2C0802.3658%2C0802.0887%2C0802.2648%2C0802.1606%2C0802.1129%2C0802.3127%2C0802.1139%2C0802.1828%2C0802.2409%2C0802.2390%2C0802.3514%2C0802.2538%2C0802.2937%2C0802.4159%2C0802.3864%2C0802.1557%2C0802.4448%2C0802.3885%2C0802.4281%2C0802.0733%2C0802.3001%2C0802.2586%2C0802.0208%2C0802.3189%2C0802.1668%2C0802.2972%2C0802.4423%2C0802.1193%2C0802.0267%2C0802.1326%2C0802.1291%2C0802.4259%2C0802.0928%2C0802.2792%2C0802.4110%2C0802.3388%2C0802.1728%2C0802.4272%2C0802.1957%2C0802.4223%2C0802.0280%2C0802.1276%2C0802.0024%2C0802.3300%2C0802.3389%2C0802.1659%2C0802.4245%2C0802.1494%2C0802.4094%2C0802.0304%2C0802.4361%2C0802.3670%2C0802.1789%2C0802.3437%2C0802.2050%2C0802.0139%2C0802.2782%2C0802.0879%2C0802.2053%2C0802.2789%2C0802.0563%2C0802.0121%2C0802.2766%2C0802.1016&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A translation-invariant renormalizable non-commutative scalar model"}, "summary": "In this paper we propose a translation-invariant scalar model on the Moyal\nspace. We prove that this model does not suffer from the UV/IR mixing and we\nestablish its renormalizability to all orders in perturbation theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.4186%2C0802.0528%2C0802.1458%2C0802.2096%2C0802.1875%2C0802.0905%2C0802.1243%2C0802.2733%2C0802.0622%2C0802.0956%2C0802.0499%2C0802.2292%2C0802.0723%2C0802.1674%2C0802.2151%2C0802.0716%2C0802.1939%2C0802.1908%2C0802.1698%2C0802.3218%2C0802.1844%2C0802.2911%2C0802.3310%2C0802.2724%2C0802.1927%2C0802.0877%2C0802.1315%2C0802.2419%2C0802.2745%2C0802.1279%2C0802.1024%2C0802.0791%2C0802.0235%2C0802.2162%2C0802.2903%2C0802.3800%2C0802.1106%2C0802.3658%2C0802.0887%2C0802.2648%2C0802.1606%2C0802.1129%2C0802.3127%2C0802.1139%2C0802.1828%2C0802.2409%2C0802.2390%2C0802.3514%2C0802.2538%2C0802.2937%2C0802.4159%2C0802.3864%2C0802.1557%2C0802.4448%2C0802.3885%2C0802.4281%2C0802.0733%2C0802.3001%2C0802.2586%2C0802.0208%2C0802.3189%2C0802.1668%2C0802.2972%2C0802.4423%2C0802.1193%2C0802.0267%2C0802.1326%2C0802.1291%2C0802.4259%2C0802.0928%2C0802.2792%2C0802.4110%2C0802.3388%2C0802.1728%2C0802.4272%2C0802.1957%2C0802.4223%2C0802.0280%2C0802.1276%2C0802.0024%2C0802.3300%2C0802.3389%2C0802.1659%2C0802.4245%2C0802.1494%2C0802.4094%2C0802.0304%2C0802.4361%2C0802.3670%2C0802.1789%2C0802.3437%2C0802.2050%2C0802.0139%2C0802.2782%2C0802.0879%2C0802.2053%2C0802.2789%2C0802.0563%2C0802.0121%2C0802.2766%2C0802.1016&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we propose a translation-invariant scalar model on the Moyal\nspace. We prove that this model does not suffer from the UV/IR mixing and we\nestablish its renormalizability to all orders in perturbation theory."}, "authors": ["R. Gurau", "J. Magnen", "V. Rivasseau", "A. Tanasa"], "author_detail": {"name": "A. Tanasa"}, "author": "A. Tanasa", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s00220-008-0658-3", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.0791v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.0791v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 3 figures", "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "81T15; 81T75", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.0791v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.0791v1", "journal_reference": "Commun.Math.Phys.287:275-290,2009", "doi": "10.1007/s00220-008-0658-3", "fulltext": "arXiv:0802.0791v1 [math-ph] 6 Feb 2008\n\nA translation-invariant renormalizable\nnon-commutative scalar model\nR. Guraua , J. Magnenb, V. Rivasseaua and A. Tanasac,d\na Laboratoire\n\nde Physique Théorique, CNRS UMR 8627,\n\nbât. 210, Université Paris XI, 91405 Orsay Cedex, France\nb Centre\n\nde Physique Théorique, CNRS UMR 7644,\n\nEcole Polytechnique, 91128 Palaiseau, France\nc Institutul\n\nde Fizica si Inginerie Nucleara Horia Hulubei,\n\nP. O. Box MG-6, 077125 Bucuresti-Magurele, Romania\nd Max-Planck-Institut\n\nfur Mathematik,\n\nVivatsgasse 7, 53111 Bonn, Germany\n\nNovember 3, 2018\n\nAbstract\nIn this paper we propose a translation-invariant scalar model on the Moyal space. We\nprove that this model does not suffer from the UV/IR mixing and we establish its\nrenormalizability to all orders in perturbation theory.\n\nKeywords: non-commutative quantum field theory, Moyal space, perturbative renormalization\n\n1\n\nIntroduction and motivation\n\nSpace-time coordinates should no longer commute at the Planck scale where gravity should be\nquantized. This observation is a strong physical motivation for non-commutative geometry, a\ngeneral mathematical framework developed by A. Connes and others [1]. Non-commutative\nfield theory is the reformulation of ordinary quantum field theory on such a non-commutative\nbackground. It may represent a bridge between the current standard model of quantum\nfields on ordinary commutative R4 and a future formalism including quantum gravity which\nhopefully should be background independent.\nInitially there was hope that non commutative field theory would behave better in the\nultraviolet regime [2]. Later motivation came from string theory, because field theory on\nsimple non-commutative spaces (such as flat space with Moyal-Weyl product) appear as\n1\n\n\fspecial effective regimes of the string [3, 4]. Finally an other very important motivation\ncomes from the study of ordinary physics in strong external field (such as the quantum Hall\neffect) [5, 6, 7]. Such situations which have not been solved analytically with the ordinary\ncommutative techniques may probably be studied more fruitfully with non-commutative\ntechniques.\nRenormalization is the soul of ordinary field theory and one would certainly want to\nextend it to the non-commutative setting. But the simplest non-commutative model, namely\nφ⋆4\n4 , whose action is given by (2.1) below, was found to be not renormalizable because\nof a surprising phenomenon called UV/IR mixing [8]. This mixing also occurs in noncommutative Yang-Mills theories. Roughly speaking the non-commutative theory still has\ninfinitely many ultraviolet divergent graphs but fewer than the ordinary one. However some\nultraviolet convergent two point graphs, such as the \"non-planar tadpole\" generate infrared\ndivergences which are not of the renormalizable type 1 .\nThe first path out of this riddle came when H. Grosse and R. Wulkenhaar introduced a\nmodified φ⋆4\n4 model which is renormalizable [10, 11]. They added to the usual propagator\na marginal harmonic potential, which a posteriori appears required by Langmann-Szabo\nduality x̃μ = 2θμν xν ↔ pμ [12].\nThe initial papers were improved and confirmed over the years through several independent methods [13, 14]. The main property of the Grosse-Wulkenhaar model is that its\nβ-function vanishes at all orders at the self-duality point Ω = 1 [15, 16, 17]. The exciting\nconclusion is that this model is asymptotically safe, hence free of any Landau ghost, and\nshould be a fully consistent theory at the constructive level. This is because wave function\nrenormalization exactly compensates the renormalization of the four-point function, so that\nthe flow between the bare and the renormalized coupling is bounded.\nEssentially most of the standard tools of field theory such as parametric [18, 19] and Mellin\nrepresentations, [20] dimensional regularization and renormalization [21] and the ConnesKreimer Hopf algebra formulation of renormalization [22] have now been generalized to\nrenormalizable non-commutative quantum field theory. Other renormalizable models have\nbeen also developed such as the orientable Gross-Neveu model [23].\nFor a general recent review on non-commutative physics including these new developments on non-commutative field theory, see [24].\nHowever there are two shortcomings of the Grosse-Wulkenhaar (GW) model. Firstly it\nbreaks translation invariance so that its relevance to physics beyond the standard model\nwould be indirect at best; one should either use more complicated \"covariant\" models\nwith harmonic potentials which are invariant under \"magnetic translations\", such as the\nLangmann-Szabo-Zarembo model [25] or one should understand how many short distance\nlocalized GW models may glue into a translation-invariant effective model. Secondly it is not\neasy to generalize the GW method to gauge theories, which do present ultraviolet/infrared\nmixing. Trying to maintain both gauge invariance and Langmann-Szabo duality one is lead\nto theories with non trivial vacua[26, 27, 28, 29], in which perturbation theory is difficult\nand renormalizability to all orders is therefore unclear up to now.\n1\n\nThis UV/IR mixing although quite generic may be avoided in some classes of \"orientable models\". Remark also that in Minkowski space if one maintains a rigorous notion of causality, there are strong indications\nthat ultraviolet/infrared mixing does not occur [9]. However the Minkowski theory has complications of its\nown which make it harder to study.\n\n2\n\n\fMotivated by these considerations we explore in this paper an other solution to the\nultraviolet infrared mixing for the φ⋆4\n4 theory. It relies on the very natural idea to incorporate\ninto the propagator the infrared mixing effects. This is possible because the sign of the mixing\ngraphs is the right one. One can therefore modify the propagator to include from the start a\n1/p2 term besides the ordinary p2 term, and to define new renormalization scales accordingly.\nAdding the interaction and expanding into the coupling constant we prove in this paper that\nthe model modified in this way is indeed renormalizable at all orders of perturbation theory.\nThis is because the former infrared effects now just generate a flow (in fact a finite flow) for\nthe corresponding 1/p2 term in the propagator. The \"ordinary\" φ⋆4\n4 is formally recovered in\n2\nthe case where the bare coefficient of the 1/p term is zero.\nThe advantages of this \"1/p2 −φ⋆4\n4 \" model are complementary to those of the GW model.\nThe main advantage is that the model does not break translation invariance. The main\ninconvenient is that there is no analog of the Langmann-Szabo symmetry so that one should\nnot expect this φ⋆4\n4 model to make sense non perturbatively. However the real interest of this\nwork is perhaps to offer an alternative road to the solution of ultraviolet/infrared mixing in\nthe case of gauge theories. It may lead to gauge and translation invariant models with trivial\nvacua. Remark that since ordinary non abelian gauge theories are asymptotically free, there\nis no real need for the non commutative version to behave better than the commutative case.\nThis removes some of the motivation to implement Langmann-Szabo duality in that case.\nTherefore we hope the model studied here may be a step towards a better global proposal\nfor a non-commutative generalization of the standard model. This proposal may perhaps\nhave to combine different solutions of the ultraviolet/infrared mixing in the Higgs and gauge\nsectors of the theory.\nThe paper is organized as follows. Section 2 recalls useful facts about Feynman graphs.\nand defines our model. The main result of the paper, theorem 2.1 below is stated at the end\nof that section. The proof is through the usual renormalization group multiscale analysis.\nThe definition of the renormalization group slices and the power counting is given in section\n3 and the proof of the theorem is completed in section 4 using the momentum representation.\nFinally some low order renormalized amplitudes for this theory are computed in Appendix\nA.\n\n2\n2.1\n\nModel and Main Result\nThe \"naive\" φ⋆4 model\n\nIt is obtained by replacing the ordinary commutative action by the Moyal-Weyl ⋆-product\nZ\n1\n1\nλ\nS[φ] = d4 x( ∂μ φ ⋆ ∂ μ φ + μ2 φ ⋆ φ + φ ⋆ φ ⋆ φ ⋆ φ),\n(2.1)\n2\n2\n4!\nwith Euclidean metric. The commutator of two coordinates is\n[xμ , xν ]⋆ = ıΘμν ,\n\n3\n\n(2.2)\n\n\fwhere\n\n\n0\n−θ\nΘ=\n0\n0\n\nθ 0\n0 0\n0 0\n0 −θ\n\n\n0\n0\n.\nθ\n0\n\nIn momentum space the action (2.1) becomes\nZ\n1\nλ\n1\nS[φ] = d4 p( pμ φpμ φ + μ2 φφ + φ ⋆ φ ⋆ φ ⋆ φ).\n2\n2\n4!\n\n(2.3)\n\n(2.4)\n\nThe propagator is the same as in the commutative case\np2\n\n2.2\n\n1\n.\n+ μ2\n\n(2.5)\n\nFeynman graphs: planarity and non-planarity, rosettes\n\nIn this subsection we give some useful conventions and definitions. Consider a φ⋆4 graph\nwith n vertices, L internal lines and F faces. One has\n2 − 2g = n − L + F,\n\n(2.1)\n\nwhere g ∈ N is the genus of the graph. If g = 0 the graph is planar, if g > 0 it is non-planar.\nFurthermore, we call a planar graph regular if it has a single face broken by external lines.\nWe call B the number of such faces broken by external lines.\nThe φ4 graphs also obey the relation\n1\nL = (4n − N),\n2\n\n(2.2)\n\nwhere N is the number of external legs of the graph.\nIn [30], T. Filk defined \"contractions moves\" on a Feynman graph. The first such move\nconsists in reducing a tree line and gluing together the two vertices at its ends into a bigger\none. Repeating this operation for the n − 1 lines of a tree, one obtains a single final vertex\nwith all the loop lines hooked to it - a rosette (see Fig. 1).\nNote that the number of faces and the genus of the graph do not change under this\noperation. Furthermore, the external legs will break the same faces on the rosette. When\none deals with a planar graph, there will be no crossing between the loop lines on the rosette.\nThe example of Fig. 1 corresponds thus to a non-planar graph (one has crossings between\ne.g. the loop lines 3 and 5). Following [30] the rosette amplitude is\nı\n\nṼ (external momenta) e 2\n\nP\n\nij\n\nIij Θμν kiμ kjν\n\nwhere the intersection matrix Iij is given by\n\n\n1, if line j crosses line i from right,\nIij = −1 if line j crosses line i from left,\n\n\n1 if lines i and j do not cross,\n4\n\n(2.3)\n\n(2.4)\n\n\fFigure 1: An example of a rosette\nwhere i and j correspond to an (arbitrary) numeration of the lines, independent of them being\nexternal or internal lines of the Feynman graph. An orientation is given by the sign convention chosen for the momenta in the conservation conditions. Θ is the non-commutativity\nmatrix (see equation (2.3)). Furthermore the overall phase factor corresponding to the external momenta is\nı\n\nṼ (k1 , . . . , kN ) = δ(k1 + . . . kN )e 2\n\nPN\n\ni<j\n\nkiμ kjν Θμν\n\n,\n\n(2.5)\n\nwhich has exactly the form of a Moyal kernel.\n\n2.3\n\nUV/IR Mixing\n\nThe non-locality of the ⋆-product leads to a new type of divergence, the UV/IR mixing [8].\nThis can be seen already in the non-planar tadpole (see Fig. 2). Although this graph has\nzero genus, since it has two faces broken by external lines, it will lead to non-planarity when\ninserted into larger graphs.\n\nFigure 2: The non-planar tadpole\nThe amplitude of this non-planar tadpole with internal momentum higher than the external momentum is up to a constant\nT =\n\nZ\n\n0\n\nk −2\n\ndα\n\nZ\n\nd4 peıkΘp e−α(p\n\n5\n\n2 +μ2 )\n\n.\n\n(2.6)\n\n\fIntegrating the Gaussian (and setting θ = 1) holds\nT =\n\nZ\n\nk −2\n0\n\ndα − k2 −αμ2\ne αe\n.\nα2\n\n(2.7)\n\nIf k > 1 then\n|T | <\n\nZ\n\n0\n\n∞\n\ndα − 1\ne α = 1.\nα2\n\n(2.8)\n\nLet k < 1 we have\nT =\n\nZ\n\nk2\n0\n\ndα − k2 −αμ2\ne αe\n+\nα2\n\nZ\n\nk −2\n\nk2\n\ndα − k2 −αμ2\ne αe\n,\nα2\n\nRescaling α = k 2 β we have for the first integral\nZ\nF (k)\n1 1 dβ −β −1 −βk2 m2\ne\ne\n=\n,\nk2 0 β 2\nk2\nwith F an analytic function of k.\nWe separate again the second integral as\nZ k−2\nZ μ−2\ndα − k2 −αμ2\ndα − k2 −αμ2\ne αe\ne αe\n+\n.\n2\n2\nα\nμ−2 α\nk2\n\n(2.9)\n\n(2.10)\n\n(2.11)\n\nThe second integral is bounded by a constant uniformly in k. In the first integral we Taylor2\nexpand e−αμ to get\nZ μ−2\nZ μ−2\nZ μ−2\ndα − k2 2\ndα − k2\ndα − k2\nα\nα\n−\nαμ\n+\n(2.12)\ne\ne\ne α O(α2).\n2\n2\n2\nα\nα\nα\nk2\nk2\nk2\nThe first term integrates to k −2 F ′ (k) with F ′ analytic, the second computes to μ2 lnk 2 +F ′′ (k)\nwith F ′′ analytic and the third is uniformly bounded. Thus the tadpole is\nT =\n\nc\n+ c′ ln(k 2 ) + F (k)\nk2\n\n(2.13)\n\nwith c and c′ constants and F an analytic function at k = 0.\nWe note that for a non-massive model the second term vanishes. One can include the\ncontribution of the non-planar tadpole in the complete two-point function to obtain a dressed\npropagator. This motivates a modification of the kinetic part of the action (2.4) which leads\nto\n\n2.4\n\nThe 1/p2 φ⋆4\n4 Model\n\nThis model is defined by the following action\nZ\n1\n1\n1 1\nλ\nS[φ] = d4 p( pμ φpμ φ + μ2 φφ + a 2 2 φφ + φ ⋆ φ ⋆ φ ⋆ φ).\n2\n2\n2 θ p\n4!\n6\n\n(2.14)\n\n\fwith a is some dimensionless parameter. The propagator is\n1\n,\n2\n2\np + μ + θ2ap2\nand we choose a ≥ 0 so that this propagator is well-defined and positive.\nUsing (2.3) and (2.15) the amplitude of a N-point graph writes\nZ Y\nL\nX\nı PN\n1\nk\nΘk\ni\nj\nd 4 pi 2\nA(G) = δ(\nki )e 2 i<j\npi + θ2ap2 + μ2\ni=1\ni=1...N\ni\nY\nı P\nv Θq v\nI\nq\nv\nv\nv\nv\nij\nδ(q1 + q2 + q3 + q3 )e 2 ij i j ,\n\n(2.15)\n\n(2.16)\n\nv6=v̄\n\nwith k the external momenta, p the internal momenta, q v a generic notation for internal\nand external momenta at vertex v, and v̄ an external vertex of the graph chosen as root (to\nextract the global δ conservation on external momenta).\nThe main result of this paper is\nTheorem 2.1 (Main Result) The model defined by action (2.14) is perturbatively renormalizable to all orders.\nThe proof is given in the next two sections. We proceed now to the usual RG analysis by\ndefining slices and establishing power counting.\n\n3\n\nSlices and Power counting\n\nIn this section we establish the power counting of our model. For that purpose we shall use\nthe very powerful tool of multiscale analysis. Power counting and renormalization theory rely\non some scale decomposition and renormalization group is oriented: it integrates \"fluctuating\nscales\" (which we call here \"high\" scales) and computes an effective action for background\nscales (here called \"low\" scales). There are several technical different ways to define the\nRG scales, but in perturbation theory the best way is certainly to define the high scales as\nthe locus where the denominator D of the propagator is big and the low scales as the locus\nwhere it is small, cutting the slices into a geometric progression. This certainly works well\nfor the very different RGs of ordinary statistical mechanics (D = p2 ), of condensed matter\n(D = ip0 + (~p)2 − 1) and of the Grosse-Wulkenhaar model (D = p2 + Ω2 x2 ). We use the\nsame idea here again with D = p2 + a/p2 .\nPower counting then evaluates contributions of connected subgraphs, also called \"quasi\nlocal components\" for which all internal scales are \"higher\" than all external scales in the\nsense above. We shall not rederive this basic principle here and shall use directly the particular version and notations of [31], in which these quasi-local components are labeled as\nGjr .\nBefore going into the detailed analysis of this contributions we first note a very important\nfeature of our model: the term ap−2 changes the UV and IR regions. For the rest of this\npaper we set θ = 1. We employ the Schwinger trick and write:\nZ ∞\n1\n2\n−2\n2\n=\ne−α(p +ap +μ ) dα ,\n(3.1)\n2\n−2\n2\np + ap + μ\n0\n7\n\n\fLet M > 1. Slice the propagators as\nC(p) =\n\n∞\nX\n\nC i (p),\n\ni=0\n\ni\n\nC (p) =\nC 0 (p) =\n\nM −2(i−1)\n\nZ\n\ndαe−α(p\n\n−2i\nZM∞\n\ndαe−α(p\n\n2 +ap−2 +μ2 )\n\n2 +ap−2 +μ2 )\n\n≤ Ke−cM\n\n−2i (p2 +ap−2 +μ2 )\n\n2\n\n≤ Ke−cp ,\n\n, i ≥ 1,\n(3.2)\n\n1\n\nwith K and c some constants which, for simplicity, will be omitted from now on. To the\ni-th slice corresponds either a momentum p ≈ M i or a momentum p ≈ M −i . Conversely, a\nmomentum k ≈ M e for e ∈ Z has a scale α = M −2|e| .\nWe have the following lemma:\nLemma 3.1 The superficial degree of convergence ω(G) of a Feynman graph G corresponding to the action (2.14) obeys\n(\nN(G) − 4, if g(G) = 0\nω(G) ≥\n(3.3)\nN(G) + 4 if g(G) > 0\nwhere N(G) is the number of external legs of G, and g(G) its genus.\nProof The first line is easy. It is enough to take absolute values in (2.16), and apply the\nmomentum routing. We briefly recall this procedure. We fix a scale attribution for all\npropagators. As the sum over the scales is easy to perform (along the same lines as in [31])\nwe concentrate on the problem of summing the internal momenta at fixed scale attribution\nν.\nAt any scale i the graph Gi made of lines with scales higher or equal to i splits into ρ\nconnected components Gir , r = 1, . . . , ρ. We choose a spanning tree T compatible with the\nscale attribution, that is each Tri = T ∩ Gir is a tree in the connected component Gir . We\ndefine the branch b(l) associated to the tree line l as the set of all vertices such that the\nunique path of lines connecting them to the root contains l. We can then solve the delta\nfunctions for the tree momenta as\nX\n(3.4)\npl = −\nql′\nl′ ∈b(l)\n\nwhere l′ ∈ b(l) denotes all loops or external momenta touching a vertex in the branch b(l).\nAfter integrating internal momenta we get the bound\nY\nY\nAν ≤\nM −2il\nM 4il ,\n(3.5)\nl\n\nl∈L\n\nwhere L denotes the set of loop lines. The first factor comes from the prefactors of the\npropagators while the second comes from the integration of the loop momenta. We can\nreorganize the above product according to the scale attribution as\nY\nY\ni\ni\ni\ni\n(3.6)\nM −[N (Gr )−4] ,\nM −2L(Gr ) M 4[L(Gr )−n(Gr )+1] =\nAν ≤\ni,k\n\ni,k\n\n8\n\n\fwhere we have used (2.2).\nThe second line of (3.3) is obtained using an argument similar to the one used in [14]. In\nfact if the graph is non-planar there will be two internal loop momenta p and q such that,\nafter integrating all tree momenta with the delta functions, the amplitude contains a factor\nZ\n2\n−2\n2\n−2\nI = d4 p d4 q e−α1 p −α1 ap −α2 q −α2 aq +ıp∧q .\n(3.7)\nA naive bound would be to bound the integral by M 4i1 M 4i2 . Instead we use\n!m\nX d2\n1\n2i1\n1+M\neıp∧q = eıp∧q .\n2\n2i\n2\nm\n1\n(1 + M q )\ndpj\nj\n\n(3.8)\n\nIntegrating by parts we get\n|I| ≤\n\nZ\n\nd4 pd4 q\n−2i −2\n−2i 2\ne−M 2 q −M 2 q\n2i\n2\nm\n1\n(1 + M q )\n\n1+M\n\n2i1\n\nX d2\ndp2j\nj\n\n!m\n\ne−M\n\n−2i1 p2 −M −2i1 p−2\n\n. (3.9)\n\nThe derivative acting on the exponential gives factors of order at most O(1). If we chose\nm = 3 we have a bound\nZ\nd4 pd4 q\n−M −2i1 p2\n≤ K′\n(3.10)\ne\nI≤K\n2i\n2\n3\n(1 + M 1 q )\nWe have thus gained both factors M 4i1 and M 4i2 with respect to the naive bound.\n\n4\n\n\u0003\n\nRenormalization\n\nWe have established that all possible divergences come from planar 2 or 4 point graphs. Note\nthat they may have more that one broken face2 . We will prove that all divergences can be\nreabsorbed in a redefinition of the parameters in the action (2.14).\n\n4.1\n\nTwo-point function\n\nThe single-broken-face 2-point graphs are ultraviolet divergent and as such give nontrivial\nmass and wave function renormalizations. By contrast the 2-point graphs with two broken\nfaces are ultraviolet convergent. Nevertheless we will prove that they give a finite renormalization of the 1/p2 term.\n4.1.1\n\n2-point function with a single broken face\n\nFrom the standard multiscale analysis we know that power counting has to be computed\nonly for connected components of the Gjr type. Consider the case of such a planar, one\nparticle irreducible, 2-point subgraph S which is a component Gjr for j for a certain range\n2\n\nThis stands in contrast with the Grosse-Wulkenhaar theory in which only graphs with a single broken\nface diverge.\n\n9\n\n\fof slices e < j ≤ i between e, its highest external scale and i, its lowest internal scale (and a\nparticular value of r).\nA(Gjr )\n\n= δ(k1 + k2 )\n\nZ Y\nL\n\n4\n\nd pl\n\nl=1\n\nZ\n\nM −2(il −1)\n\n2\n\n−2\n\ndαl e−αl [pl +apl\n\n+μ2 ]\n\nM −2il\n\nY\n\nδ(q1v + q2v + q3v + q3v ) , (4.1)\n\nv6=v̄\n\nwhere we consider that all eventual subrenormalizations have been performed. We perform\nthe momentum routing for the subtree Trj . Let k1 enter into the root vertex of S. We define\nT 1 = {l ∈ T | k2 ∈ b(l)} ,\n\nT2 = T − T1 .\n\n(4.2)\n\nThe amplitude writes, dropping the index on k2 and forgetting the overall δ function\nA(G) =\n\nZ Y\n|L|\nl=1\n\nY\n\nl∈T 2\n\n−αl\n\ne\n\nh\n\n4\n\nd pl\n\nL Z\nY\nl=1\n\nM −2(il −1)\n\ndαl\n\nM −2il\n\nY\n\n2\n\n−2\n\ne−αl [pl +apl\n\n+μ2 ]\n\nl∈L\n\nP\nP\n( l′ ∈b(l) pl′ )2 +a( l′ ∈b(l) pl′ )−2 +μ2\n\ni\n\nY\n\nh\n\n−αl (k+\n\ne\n\nl∈T 1\n\nP\n\nl′ ∈b(l)\n\npl′ )2 +a(k+\n\nP\n\nl′ ∈b(l)\n\npl′ )−2 +μ2\n\ni\n\n.\n\n(4.3)\n\nWe Taylor-expand the last line. The odd terms in p are zero after integration, as the\nbranch momenta are linearly independent. For each term we have a development of the form\nh\ni\nZ 1\nP\nP\n2\n−2\n2\n−αl ( l′ ∈b(l) pl′ ) +a(k+ l′ ∈b(l) pl′ ) +μ\n2\u0001\n2\n2 4\ndt(1 − t)e−tαl k\n(4.4)\n1 − αl k + αl k\ne\n0\n\nUsing the multiscale bound (3.2), we see that collecting the first terms we get a bound like\n(3.6), thus a quadratic mass divergence. If we have at least one factor in αl we gain at least\nM −2il ≤ M −2i and we pay a factor k 2 which is of order M 2e because the external momenta\nis of scale e. Thus for all scales j between i and e we have gained a factor M −2 and the\npower counting factor associated to the corresponding connected component Gjr , which was\nj\nj\npreviously M −(N (Gr )−4) = M 2 , has become M −(N (Gr )−2) = 1. We get therefore a constant\nper slice as power counting for that connected component. As usually we recognize here the\nlogarithmically divergent wave function renormalization associated to S. All other terms\ngive convergent contributions, because a factor at least M −4 per slice between e and i is\ngained.\n4.1.2\n\n2-point function with two broken faces\n\nThe amplitude of a one-particle irreducible 2-point graph with two broken faces is\nA(Gjr )\n\n= δ(k1 + k2 )\n\nZ Y\nL\n\n4\n\nd pl\n\nl=1\n\nY\n\nZ\n\nM −2(il −1)\n\nP\n\n10\n\n−2\n\n+μ2 ]\n\nM −2il\n\nδ(q1v + q2v + q3v + q3v )eık2 ∧(\n\nv6=v̄\n\n2\n\ndαl e−αl [pl +apl\nl∈S\n\npl )\n\n,\n\n(4.5)\n\n\fwith S ∈ L the set of loop lines crossed by the second external line. Performing again the\nmomentum routing, dropping the index in k2 and the global δ function yields\nA(Gjr )\n\n=\n\nZ Y\n|L|\n\n4\n\nd pl\n\nl=1\n\nY\n\nM −2(il −1)\n\n2\n\nY\n\ndαl\nM −2il\n\nP\nP\n−αl ( l′ ∈b(l) pl′ )2 +a( l′ ∈b(l) pl′ )−2 +μ2\n\ne\n\nh\n\n−αl (k+\n\ne\n\nl∈T 1\n\nP\n\n−2\n\ne−αl [pl +apl\n\n+μ2 ]\n\nl∈L\n\nh\n\nl∈T 2\n\nY\n\nZ\n\nl′ ∈b(l)\n\npl′ )2 +a(k+\n\nP\n\nl′ ∈b(l)\n\ni\n\npl′ )−2 +μ2\n\ni\n\nP\n\neık∧(\n\nl∈S\n\npl )\n\n.\n\n(4.6)\n\nIn order to establish the full dependence of the amplitude in the external momentum k\nwe divide all integrals over p in two regions, p < a1/4 and p ≥ a1/4 . The integral over one p in\nthe region p < a1/4 will count for O(1) instead of M 4i and using directly the power counting\nargument we bound such a contribution to (4.6) by M −2i per slice, for all k.\nWe conclude that only the case with all p's greater than a1/4 can give rise to a non\nanalytic behavior in k. In the following we will neglect all boundary terms on the sphere of\nradius a1/4 as they are easy to bound uniformly in k.\nWe chose a line l′ ∈ S, use\nP\n\neık∧(\n\nl∈S\n\npl )\n\n=−\n\nP\n1\nık∧( l∈S pl )\n∆\ne\np\nk 2 l′\n\n(4.7)\n\nand integrate by parts in (4.6) to get\nA(Gjr )\nY\n\nl∈T 2\n\n1\n=− 2\nk\nh\n\n−αl\n\ne\n\nZ Y\n|L|\n\nP\nık∧( l∈S pl )\n\n4\n\nd pl e\n\nl=1\n\nZ\n\nP\nP\n( l′ ∈b(l) pl′ )2 +a( l′ ∈b(l) pl′ )−2 +μ2\n\nM −2(il −1)\n\ndαl ∆pl′\n\nM −2il\n\ni\n\nY\n\n\u0010Y\n\n2\n\n−2\n\ne−αl [pl +apl\n\n+μ2 ]\n\nl∈L\n\nh\n\n−αl (k+\n\ne\n\nl∈T 1\n\nP\n\nl′ ∈b(l)\n\npl′ )2 +a(k+\n\nP\n\nl′ ∈b(l)\n\npl′ )−2 +μ2\n\ni\n\n\u0011\n(4.8)\n.\n\nThe derivatives acting on the Gaussian will give rise to insertions scaling like α, α2 p2 , αp−2 ,\nαp−4 , α2 p−2 , α2 p−4 . The first two terms scale as M −2i in a slice while the rest scale at least\nas M −4i . Using again the trick (4.7), and the power counting bound we get, when summing\nover all slices, a behavior like\nA(Gjr )\n\n∞\n1 X −2i\n1 M −2j\n= 4\nM\n= 2\nK,\nk i=j\nk M 2e\n\n(4.9)\n\nwith K some constant, if k ≈ M e (and consequently of scale |e|). As the scale j is ultraviolet\nwith respect to |e| we bound\nM −2j−2e ≤ M −2(|e|+e) ≤ 1 .\n\n(4.10)\n\nWe have thus proved that\nA(Gjr ) =\n\n1\nF (k)\nk2\n11\n\n(4.11)\n\n\fwith F (k) a function uniformly bounded by a constant for all k.3 We identify the terms F (0)\nas a finite renormalization for the coefficient a in the Lagrangian. Note that using this scale\ndecomposition there are no logarithmic subleading divergences for this two point function\nwith two broken faces.\n\n4.2\n\nFour-points function\n\nThe amplitude of a planar regular four-points graph is given by:\nı\n\nP\n\nA(Gjr ) = δ(k1 + k2 + k3 + k4 )e 2 i<j ki ∧kj\nZ M −2(il −1)\nZ Y\nL\nY\n−2\n2\n2\n4\nδ(q1v + q2v + q3v + q3v ) . (4.12)\nd pl\ndαl e−αl [pl +apl +μ ]\nl=1\n\nM −2il\n\nv6=v̄\n\nThe first line reproduces exactly the Moyal four-points kernel. Power counting leads to bound\nthe second line by a constant per slice, thus it corresponds to a logarithmic divergence, which\nin turn generates a logarithmic coupling constant renormalization.\nSome comments are in order for the planar four-points graphs with more than one broken\nface. Using (4.7) once, we get a bound like\nA(Gjr )\n\n∞\n1 X −2i M −2j\n= 2\nM\n=\nK,\nk i=j\nM 2e\n\n(4.13)\n\nand by (4.10) we see that the amplitude of such a graph is a function of external momenta\nuniformly bounded by some constant.\n\n5\n\nConclusions and perspectives\n\nWe have thus proved in this paper that the scalar model (2.14) is renormalizable at all orders\nin perturbation theory. The renormalization of the planar regular graphs goes along the same\nlines as the renormalization of the Euclidean φ4 on a 4−dimensional commutative space. The\nnon-planar graphs remain convergent and the main difference concerns the planar irregular\ngraphs. The comparison with the action (2.1) (which is non-renormalizable, with UV/IR\nmixing) and with the Grosse-Wulkenhaar model is summarized in the following table:\n\nplanar regular\nplanar irregular\nnon-planar\n\nmodel (2.1)\n2-points\n4-points\nren.\nren.\nUV/IR\nren.\nconvergent convergent\n\nGrosse-Wulkenhaar model\nmodel (2.14)\n2-points\n4-points\n2-points\n4-points\nren.\nren.\nren.\nren.\nconv.\nconv.\nfinite ren. convergent\nconvergent\nconvergent\nconvergent convergent\n\n3\nIn fact F (k) is analytic in k, as it is a sum of absolutely convergent integrals of analytic functions in α\nand k.\n\n12\n\n\fAcknowledgment: We thank A. Abdesselam for indicating the proof of analicity of\nF in (4.11). Furthermore, Adrian Tanasa gratefully acknowledges the European Science\nFoundation Research Networking Program \"Quantum Geometry and Quantum Gravity\" for\nthe Short Visit Grants 2219 and 2232.\n\nA\n\nExamples of graphs\n\nWe illustrate the general results established in the previous section by some examples of twoand four-points graphs for which we analyze the Feynman amplitude.\n\nA.1\n\nA two-point graph example\n\nLet us analyze the Feynman amplitude of the tadpole of Fig 2. This graph has g = 0 but\nB = 2. Due to the new renormalization group slices the parameter α of an internal line\nobeys α < min{k 2 , k −2 }. Therefore the amplitude of the non planar tadpole is (up to a\nconstant)\nZ min{k2 ,k−2 }\nZ\n2\n−2\n2\ndα d4 peik∧p e−α(p +ap +μ ) .\n(A.1)\n0\n\napplying (4.7) and integrating by parts holds\nZ\nZ\nZ\nZ\n2 −2\n2 −2\n1 min{k ,k }\n1 min{k ,k }\n4 ik∧p\n−α(p2 +ap−2 +μ2 )\n− 2\ndα d pe ∆p e\n= 2\ndα d4 peik∧p\nk 0\nk 0\n\u0001\n2\n−2\n2\n8α − α2 (4p2 − 8ap−2 + 4a2 p−6 ) e−α(p +ap +μ ) .\n(A.2)\n\nAll but the first and second terms in (A.2) can be bounded by k 2 when taking absolute values\nsuch that there contribution to the amplitude of the tadpole is a constant. The coefficient\nof the k −2 divergences is therefore\nZ min{k2 ,k−2}\nZ\n\u0001\n2\n−2\n2\nc=\ndα d4 peik∧p 8α + 4p2 α2 e−α(p +ap +μ )\n(A.3)\n0\n\nApplying again 4.7 and integrating again by parts holds only terms like\nZ\nZ\n2 −2\n1 min{k ,k } 2\n2\n−2\n2\ncn = 2\nα dα d4 peik∧p (αp2 )n e−α(p +ap +μ ) ,\nk 0\n2\n\n(A.4)\n\nαp2\n\nwith n = 0, 1, 2. Taking absolute values, using (αp2 )n e−αp < e− 2 holds up to irrelevant\nconstants\nZ\n2 −2\n1\n1\n1 min{k ,k } 2\n(A.5)\nα dα 2 = 2 min{k 2 , k −2 } < 1\ncn < 2\nk 0\nα\nk\nWe conclude that\n\n1\nF (k) + G(k) ,\nk2\nwith F and G bounded and analytic at k = 0.\n13\n\n(A.6)\n\n\fA.2\n\nPlanar irregular four-points graphs\n\nTake now the graph of Fig. 3. This graph has vanishing genus (g = 0) and two faces broken\nby external lines (B = 2).\n\nFigure 3: An example of a four-point Feynman graph, planar but with 2 faces broken by\nexternal lines\nThe Feynman amplitude writes\nZ\n1\n1\n2\nd4 p1 e−2ip1 ∧(k1 +k2 ) 2\nλ\n1\np1 + μ2 + a p2 (p1 + k3 + k4 )2 + μ2 + a (p1 +k13 +k4 )2\n\n(A.7)\n\n1\n\nLet\nK = k1 + k2 = −(k3 + k4 ),\np2 = p1 + K.\n\n(A.8)\n\nWe now deal with the integral (2.2) as before, that is we use the Schwinger parametric\nrepresentation and we express the oscillation factor using (4.7). Integrating by parts as\nabove, one has\nZ\nZ\n2\n−2\ni\nh\n−2\n−2\nλ2 min(K ,K )\n2\n2\n2\n2\n− 2\ndα1 dα2 d4 p1 e−2ip1 ∧K ∆p e−α1 (p1 +ap1 +μ ) e−α2 (p2 +ap2 +μ ) . (A.9)\nK 0\n\nThis further develops as:\nZ\nZ\n2\n−2\nλ2 min(K ,K )\n− 2\ndα1 dα2 d4 p1 e−2ip1 ∧(k1 +k2 )\nK 0\n\u0015 \u0014\n\u0015\n\u0014\u0014\n4a2 8a\n4a2 8a\n2\n2\n2\n2\n−8α1 + α1 (4p1 + 6 − 2 ) + −8α2 + α2 (4p2 + 6 − 2 )\np1\np1\np2\np2\n\u0015\n−2\n−2\na\na\n2\n2\n2\n2\n+8α1 α2 (p1 μ − 4 p1 μ )(pμ2 − 4 pμ2 ) e−α1 (p1 +ap1 +μ ) e−α2 (p2 +ap2 +μ ) .\np1\np2\n\n(A.10)\n\nNote that some of the terms above are of the same type as the ones appearing in (A.2)\nand can be bounded by K 2 when taking absolute values. Thus, their contribution to the\namplitude is a constant. The rest of terms of (A.10) can then be treated along the same\nlines as above. Take for example the second term of (A.10). This leads to an integral like\nZ min(K 2 ,K −2)\n1\ndα1 dα2 α1\n(A.11)\n(α1 + α2 )2\n0\nOne performs first the definite integral on α2 . This leads to two terms which can be easily\nbounded by K 2 . Finally, one concludes that the integral (A.10) leads to some constant\nresult.\n14\n\n\fReferences\n[1] A. Connes, \"Géometrie non commutative\", InterEditions, Paris (1990).\n[2] H. S. Snyder, Deformation quantization for actions of the affine group Phys Rev 71\n(1947), 38\n[3] Connes A, Douglas M. R., Schwarz A.: Noncommutative Geometry and Matrix Theory:\nCompactification on Tori. JHEP 9802, 3-43 (1998)\n[4] Seiberg N., Witten E.: String theory and noncommutative geometry. JHEP 9909, 32131 (1999) [arXiv:hep-th/9908142].\n[5] Susskind L.: The Quantum Hall Fluid and Non-Commutative Chern Simons Theory.\nhep-th/0101029\n[6] Polychronakos A. P.: Quantum Hall states on the cylinder as unitary matrix ChernSimons theory. JHEP, 06, 70-95 (2001)\n[7] Hellerman S., Van Raamsdonk M.: Quantum Hall physics equals noncommutative field\ntheory. JHEP 10, 39-51 (2001)\n[8] S. Minwalla, M. Van Raamsdonk and N. Seiberg, \"Noncommutative perturbative dynamics,\" JHEP 0002, 020 (2000) [arXiv:hep-th/9912072].\n[9] D. Bahns, The shuffle Hopf algebra and quasiplanar Wick products, conference proceedings \"Non commutative Geometry and Physics\", Orsay, April 2007,\narXiv:0710.2787v1[math.QA]\n[10] Grosse H. and Wulkenhaar R., Power-counting theorem for non-local matrix models and\nrenormalization, Commun. Math. Phys. 254, 91-127 (2005)\n[11] Grosse H., Wulkenhaar R., Renormalizationof φ4 -theory on noncommutative R4 in the\nmatrix base, Commun. Math. Phys. 256, 305-374 (2005)\n[12] E. Langmann and R. J. Szabo, \"Duality in scalar field theory on noncommutative phase\nspaces,\" Phys. Lett. B 533, 168 (2002) [arXiv:hep-th/0202039].\n[13] Rivasseau V., Vignes-Tourneret F., Wulkenhaar R.: Renormalization of noncommutative φ⋆4\n4 -theory by multi-scale analysis. Commun. Math. Phys. 262, 565-594 (2006)\n[14] R. Gurau, J. Magnen, V. Rivasseau and F. Vignes-Tourneret, \"Renormalization of noncommutative phi**4(4) field theory in x space,\" Commun. Math. Phys. 267, 515 (2006)\n[arXiv:hep-th/0512271].\n[15] H. Grosse and R. Wulkenhaar, \"The beta-function in duality-covariant noncommutative\nphi**4 theory,\" Eur. Phys. J. C 35, 277 (2004) [arXiv:hep-th/0402093].\n[16] M. Disertori and V. Rivasseau, \"Two and three loops beta function of non commutative\nphi(4)**4 theory,\" Eur. Phys. J. C 50, 661 (2007) [arXiv:hep-th/0610224].\n15\n\n\f[17] M. Disertori, R. Gurau, J. Magnen and V. Rivasseau, \"Vanishing of beta function\nof non commutative phi(4)**4 theory to all orders,\" Phys. Lett. B 649, 95 (2007)\n[arXiv:hep-th/0612251].\n[18] R. Gurău and V. Rivasseau, 'Parametric representation of noncommutative field theory,\"\nCommun. Math. Phys. 272, 811 (2007) [arXiv:math-ph/0606030].\n[19] V. Rivasseau and A. Tanasa, \"Parametric representation of 'covariant' noncommutative\nQFT models,\" arXiv:math-ph/0701034, to be published in Commun. Math. Phys.\n[20] R. Gurau, A. P. C. Malbouisson, V. Rivasseau and A. Tanasa, \"Non-Commutative\nComplete Mellin Representation for Feynman Amplitudes,\" arXiv:0705.3437 [math-ph].\n[21] R. Gurau and A. Tanasa, \"Dimensional regularization and renormalization of noncommutative QFT,\" submitted to Annales Henri Poincare, arXiv:0706.1147 [math-ph].\n[22] A. Tanasa and F. Vignes-Tourneret, \"Hopf algebra of non-commutative field theory,\"\nto be publisehd in J. Noncomm. Geom., arXiv:0707.4143 [math-ph].\n[23] F. Vignes-Tourneret, \"Renormalization of the orientable non-commutative Gross-Neveu\nmodel,\" Annales Henri Poincare 8, 427 (2007) [arXiv:math-ph/0606069].\n[24] \"Quantum Spaces\", ed by B. Duplantier and V. Rivasseau Progress in Mathematical\nPhysics 53, Birkhäuser, 2007.\n[25] Langmann E., Szabo R. J., Zarembo K.: Exact solution of quantum field theory on\nnoncommutative phase spaces. JHEP 0401, 17-87 (2004)\n[26] A. de Goursac, J. C. Wallet and R. Wulkenhaar, \"Noncommutative induced gauge\ntheory,\" arXiv:hep-th/0703075.\n[27] H. Grosse and M. Wohlgenannt, \"Induced Gauge Theory on a Noncommutative Space,\"\narXiv:hep-th/0703169.\n[28] H. Grosse and R. Wulkenhaar, \"8D-spectral triple on 4D-Moyal space and the vacuum\nof noncommutative gauge theory,\" arXiv:0709.0095 [hep-th].\n[29] A. de Goursac, A. Tanasa and J. C. Wallet, \"Vacuum configurations for renormalizable\nnon-commutative scalar models,\" arXiv:0709.3950 [hep-th], Eur. Phys. J. C 53, 459\n(2008).\n[30] T. Filk, Phys. Lett. B 376, 53 (1996).\n[31] Rivasseau V.: From perturbative to Constructive Field Theory: Princeton University\nPress, (1991)\n\n16\n\n\f"}