{"id": "http://arxiv.org/abs/1111.1718v1", "guidislink": true, "updated": "2011-11-07T21:00:00Z", "updated_parsed": [2011, 11, 7, 21, 0, 0, 0, 311, 0], "published": "2011-11-07T21:00:00Z", "published_parsed": [2011, 11, 7, 21, 0, 0, 0, 311, 0], "title": "Constraining the formation of inner bars. Photometry, kinematics and\n  stellar populations in NGC 357", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5526%2C1111.0460%2C1111.1911%2C1111.2638%2C1111.5322%2C1111.4538%2C1111.1567%2C1111.6026%2C1111.5451%2C1111.4857%2C1111.1490%2C1111.0843%2C1111.6940%2C1111.6671%2C1111.3149%2C1111.4311%2C1111.0181%2C1111.6412%2C1111.5191%2C1111.1594%2C1111.4174%2C1111.6912%2C1111.3821%2C1111.3536%2C1111.3447%2C1111.2194%2C1111.5391%2C1111.3733%2C1111.3339%2C1111.5090%2C1111.2090%2C1111.2944%2C1111.2288%2C1111.0815%2C1111.5472%2C1111.3027%2C1111.6817%2C1111.2047%2C1111.6180%2C1111.6317%2C1111.0240%2C1111.6137%2C1111.6798%2C1111.5314%2C1111.3858%2C1111.2641%2C1111.5993%2C1111.4333%2C1111.4797%2C1111.0388%2C1111.4289%2C1111.0381%2C1111.6678%2C1111.2936%2C1111.5898%2C1111.3776%2C1111.6816%2C1111.4339%2C1111.7196%2C1111.4122%2C1111.4241%2C1111.7275%2C1111.4855%2C1111.7278%2C1111.4664%2C1111.3208%2C1111.7227%2C1111.3429%2C1111.4536%2C1111.0734%2C1111.2546%2C1111.0841%2C1111.6373%2C1111.1718%2C1111.0429%2C1111.7240%2C1111.4528%2C1111.5431%2C1111.4624%2C1111.4964%2C1111.5041%2C1111.3702%2C1111.4860%2C1111.0370%2C1111.2899%2C1111.3046%2C1111.0020%2C1111.5663%2C1111.2740%2C1111.3245%2C1111.4724%2C1111.2134%2C1111.1466%2C1111.4848%2C1111.6669%2C1111.5405%2C1111.2627%2C1111.7276%2C1111.1884%2C1111.0855%2C1111.5100&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Constraining the formation of inner bars. Photometry, kinematics and\n  stellar populations in NGC 357"}, "summary": "Double-barred galaxies are common in the local Universe, with approximately\none third of barred spirals hosting an smaller, inner bar. Nested bars have\nbeen proposed as a mechanism for transporting gas to the very central regions\nof the galaxy, trigger star formation and contribute to the growth of the\nbulge. To test this idea, we perform for the first time a detailed analysis of\nthe photometry, kinematics and stellar populations of a double-barred galaxy:\nNGC 357. We find that this galaxy is either hosting a pseudobulge or a\nclassical bulge together with an inner disc. We compare the relative mean\nluminosity-weighted age, metallicity and alpha-enhancement between the\n(pseudo)bulge, inner bar and outer bar, finding that the three structures are\nnearly coeval and old. Moreover, the bulge and inner bar present the same\nmetallicity and overabundance, whereas the outer bar tends to be less\nmetal-rich and more alpha-enhanced. These results point out that, rather than\nthe classical secular scenario in which gas and star formation play a major\nrole, the redistribution of the existing stars is driving the formation of the\ninner structures.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5526%2C1111.0460%2C1111.1911%2C1111.2638%2C1111.5322%2C1111.4538%2C1111.1567%2C1111.6026%2C1111.5451%2C1111.4857%2C1111.1490%2C1111.0843%2C1111.6940%2C1111.6671%2C1111.3149%2C1111.4311%2C1111.0181%2C1111.6412%2C1111.5191%2C1111.1594%2C1111.4174%2C1111.6912%2C1111.3821%2C1111.3536%2C1111.3447%2C1111.2194%2C1111.5391%2C1111.3733%2C1111.3339%2C1111.5090%2C1111.2090%2C1111.2944%2C1111.2288%2C1111.0815%2C1111.5472%2C1111.3027%2C1111.6817%2C1111.2047%2C1111.6180%2C1111.6317%2C1111.0240%2C1111.6137%2C1111.6798%2C1111.5314%2C1111.3858%2C1111.2641%2C1111.5993%2C1111.4333%2C1111.4797%2C1111.0388%2C1111.4289%2C1111.0381%2C1111.6678%2C1111.2936%2C1111.5898%2C1111.3776%2C1111.6816%2C1111.4339%2C1111.7196%2C1111.4122%2C1111.4241%2C1111.7275%2C1111.4855%2C1111.7278%2C1111.4664%2C1111.3208%2C1111.7227%2C1111.3429%2C1111.4536%2C1111.0734%2C1111.2546%2C1111.0841%2C1111.6373%2C1111.1718%2C1111.0429%2C1111.7240%2C1111.4528%2C1111.5431%2C1111.4624%2C1111.4964%2C1111.5041%2C1111.3702%2C1111.4860%2C1111.0370%2C1111.2899%2C1111.3046%2C1111.0020%2C1111.5663%2C1111.2740%2C1111.3245%2C1111.4724%2C1111.2134%2C1111.1466%2C1111.4848%2C1111.6669%2C1111.5405%2C1111.2627%2C1111.7276%2C1111.1884%2C1111.0855%2C1111.5100&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Double-barred galaxies are common in the local Universe, with approximately\none third of barred spirals hosting an smaller, inner bar. Nested bars have\nbeen proposed as a mechanism for transporting gas to the very central regions\nof the galaxy, trigger star formation and contribute to the growth of the\nbulge. To test this idea, we perform for the first time a detailed analysis of\nthe photometry, kinematics and stellar populations of a double-barred galaxy:\nNGC 357. We find that this galaxy is either hosting a pseudobulge or a\nclassical bulge together with an inner disc. We compare the relative mean\nluminosity-weighted age, metallicity and alpha-enhancement between the\n(pseudo)bulge, inner bar and outer bar, finding that the three structures are\nnearly coeval and old. Moreover, the bulge and inner bar present the same\nmetallicity and overabundance, whereas the outer bar tends to be less\nmetal-rich and more alpha-enhanced. These results point out that, rather than\nthe classical secular scenario in which gas and star formation play a major\nrole, the redistribution of the existing stars is driving the formation of the\ninner structures."}, "authors": ["A. de Lorenzo-Cáceres", "A. Vazdekis", "J. A. L. Aguerri", "E. M. Corsini", "Victor P. Debattista"], "author_detail": {"name": "Victor P. Debattista"}, "author": "Victor P. Debattista", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2011.20100.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.1718v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.1718v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 10 figures. Accepted for publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.1718v1", "affiliation": "Jeremiah Horrocks Institute, University of Central Lancashire", "arxiv_url": "http://arxiv.org/abs/1111.1718v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2011.20100.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–17 (2002)\n\nPrinted 3 November 2018\n\n(MN LATEX style file v2.2)\n\narXiv:1111.1718v1 [astro-ph.CO] 7 Nov 2011\n\nConstraining the formation of inner bars.\nPhotometry, kinematics and stellar populations in\nNGC 357⋆.\nA. de Lorenzo-Cáceres1,2†, A. Vazdekis1,2‡, J. A. L. Aguerri1,2§,\n3\n4\nE.\nM.\nCorsini\n¶\nand\nVictor\nP.\nDebattista\nk\n1\nInstituto de Astrofı́sica de Canarias (IAC), E-38205 La Laguna, Tenerife, Spain\nAstrofı́sica, Universidad de La Laguna (ULL), E-38206 La Laguna, Tenerife, Spain\n3 Dipartimento di Astronomia, Università di Padova, vicolo dell'Osservatorio 2, I-35122 Padova, Italy\n4 RCUK Fellow, Jeremiah Horrocks Institute, University of Central Lancashire, Preston PR1 2HE, UK\n2 Depto.\n\nAccepted xxx. Received xxx; in original form xxx\n\nABSTRACT\n\nDouble-barred galaxies are common in the local Universe, with approximately one\nthird of barred spirals hosting an smaller, inner bar. Nested bars have been proposed\nas a mechanism for transporting gas to the very central regions of the galaxy, trigger\nstar formation and contribute to the growth of the bulge. To test this idea, we perform for the first time a detailed analysis of the photometry, kinematics and stellar\npopulations of a double-barred galaxy: NGC 357. We find that this galaxy is either\nhosting a pseudobulge or a classical bulge together with an inner disc. We compare\nthe relative mean luminosity-weighted age, metallicity and α-enhancement between\nthe (pseudo)bulge, inner bar and outer bar, finding that the three structures are\nnearly coeval and old. Moreover, the bulge and inner bar present the same metallicity and overabundance, whereas the outer bar tends to be less metal-rich and more\nα-enhanced. These results point out that, rather than the classical secular scenario in\nwhich gas and star formation play a major role, the redistribution of the existing stars\nis driving the formation of the inner structures.\nKey words: galaxies: individual: NGC 357 - galaxies: photometry - galaxies: kinematics and dynamics - galaxies: bulges - galaxies: structure - galaxies: evolution.\n\n1\n\nINTRODUCTION\n\nThe structural evolution of disc galaxies and its timescale\nremain as open questions nowadays. In fact, it is still not\nclear if the formation of bulges is mostly driven by external processes, such as interactions or mergers, or by the\ninternal secular evolution due to inflow of gas from the\ngalactic disc to the central regions, where it may trigger\nstar formation (see Kormendy & Kennicutt 2004, for a review). This second scenario implies a slow process that\ntakes place when non-axysimmetric components (particularly bars) redistribute the angular momentum of the galaxy.\n\n⋆\n\nBased on observations carried out at the European Southern\nObservatory (ESO 70.B-0338).\n† adlcr@iac.es\n‡ vazdekis@iac.es\n§ jalfonso@iac.es\n¶ enricomaria.corsini@unipd.it\nk vpdebattista@gmail.com\nc 2002 RAS\n\nGiven the large number of barred galaxies found in the\nlocal Universe (Knapen et al. 2000; Eskridge et al. 2000;\nMarinova & Jogee 2007; Menéndez-Delmestre et al. 2007;\nAguerri et al. 2009), and that the bar fraction remains significant till z∼1 (although its evolution with redshift is still a\nmatter of debate, see e.g. Elmegreen et al. 2004; Jogee et al.\n2004; Sheth et al. 2008; Cameron et al. 2010), it seems that\ninternal secular processes might actually be an important\ndriver of the evolution in spirals. If this is the case, the resulting kinematical and morphological changes could also\nlead to an evolution along the Hubble sequence from later\nto earlier types, as suggested by Friedli & Martinet (1993).\nIt has been theoretically demonstrated that the flow of\ngas through a single bar stops before reaching the galactic centre; however, a system of nested bars may efficiently\ntransport the material to the nuclear regions, where it even\nwould help to fuel nuclear activity. This idea was first proposed by Shlosman et al. (1989, 1990), and resulted in an\nincreasing interest in galaxies hosting two or more bars.\n\n\f2\n\nde Lorenzo-Cáceres et al.\n\nDouble-barred galaxies are common objects in the local Universe; at least one third of barred galaxies show an\nadditional inner bar (Moiseev 2001; Erwin & Sparke 2002;\nLaine et al. 2002; Erwin 2004) and nested bars have been\nfound till z ∼0.15 (Lisker et al. 2006). Photometric studies\nhave shown that the two bars are randomly oriented relative to each other (Friedli & Martinet 1993; Wozniak et al.\n1995), suggesting that they rotate independently, as predicted by numerical simulations (Shlosman & Heller 2002;\nDebattista & Shen 2007) and confirmed by observations\n(Corsini et al. 2003). Moreover, it seems there is no correlation between the presence of an inner bar and the Hubble type of the host galaxy or its main bar properties.\nErwin & Sparke (2002) find that inner bars extend to ∼12%\nof the outer bar size, and that have in general smaller ellipticities, but may be larger since the inner bar might be\nembedded in the light of the bulge.\nMaciejewski & Sparke (1997, 2000) study the dynamics\nof double-barred objects and develop a simple formalism to\nstudy the orbits of their stars based on the loop concept.\nSingle bars are characterized by two fundamental frequencies (one for the bar and one for the free oscillations), allowing the existence of closed and periodic orbits. In fact, two\norbital families stand out for a single-barred potential: the\nx1 orbits, elongated along the bar major axis, and the x2 orbits, perpendicular to it (Contopoulos & Papayannopoulos\n1980). A double-barred potential needs an additional frequency to be described, meaning that closed orbits are not\npossible. A loop is a family of orbits whose populating particles return to the same curve when the two bars recover\nthe relative position between them, although each individual\nparticle is not in its initial position. This means that only\nthe global shape of the orbit is preserved.\nThe challenge of building long-lived double bars\nled to many numerical simulations, most of them getting galaxies where the outer bar appears first, the\ngas flows along it and then it is captured by the\nx2 orbits of the main bar, subsequently forming the\ninner bar. In this scenario the dissipative component\nplays a major role (Friedli & Martinet 1993; Heller et al.\n2001; Shlosman & Heller 2002; Rautiainen et al. 2002;\nEnglmaier & Shlosman 2004). However, some authors get\ndouble-barred systems without such a dissipational process.\nThis is the case of Debattista & Shen (2007), who perform\ncollisionless N-body simulations and obtain purely stellar inner bars. These inner bars form before the apparition of the\nouter bars. Finally, Heller et al. (2007) generate for the first\ntime a two bar system from a dark matter halo. In this case,\nboth bars are gas-rich and transport material to the central\nregions, supporting the hypothesis of Shlosman et al. (1989,\n1990).\nWith these pieces of evidence, it is clear that doublebarred galaxies are the perfect benchmark to constrain the\nrole of secular processes within galaxy nuclei. One way to\nproceed is to perform a detailed stellar population analysis of these systems: if double bars are playing a major role in galaxy evolution, this fact will be reflected in\nthe properties (star formation, age, and metallicity) of the\ngalaxy components (bulge, inner bar, outer bar, and disc),\nresulting in a gradient of ages and metallicities between\nthem. However, this is difficult to achieve due to the structural complexity of galaxies with nested bars, as illustrated\n\nby the photometric properties mentioned above. To date,\nthere are few stellar population studies involving double\nbars, all of them being projects devoted to the analysis of\nsamples of barred galaxies in general, which include only\nsome double-barred objects. For this reason, these works\nfocus only on the main bar and they do not account for\nthe inner bar. This is the case in the set of papers by\nPérez et al. (2007, 2009), Pérez & Sánchez-Blázquez (2011),\nand Sánchez-Blázquez et al. (2011), who study the stellar\npopulations of bars and bulges. They find positive, negative,\nand even null metallicity gradients along the bars independently of the age distribution. The bulges hosted in barred\ngalaxies tend to be more metal-rich than those in unbarred\ngalaxies at a similar velocity dispersion. However, the implications of these results within evolutionary scenarios is still\nunclear.\nOther works study double-barred objects from\na purely kinematical point of view (Emsellem et al.\n2001;\nMoiseev, Valdés, & Chavushyan\n2004;\nde Lorenzo-Cáceres et al. 2008). de Lorenzo-Cáceres et al.\n(2008) present the 2D stellar velocity and velocity dispersion\nmaps for a sample of four double-barred galaxies, based on\nobservations with the SAURON integral field spectrograph.\nThe analysis of high quality velocity dispersion maps\nrevealed two local minima, located exactly at the ends\nof the inner bar of each galaxy. By means of numerical\nsimulations, de Lorenzo-Cáceres et al. (2008) conclude that\nthese σ-hollows appear because of the strong contrast\nbetween the velocity dispersions of the bulge and the inner\nbar. This result indicates that bars are dynamically cold\ncomponents, with velocity dispersion values significantly\nlower than those of the hot, classical bulge. Moreover, the\nσ-hollows are the kinematical signature of the presence of\nan inner bar.\nIn this paper, we present the first detailed morphological, kinematical and stellar population analysis of the different structures that comprise a double-barred galaxy: bulge,\ninner bar and outer bar. We focus on the case of NGC 357.\nThe work is organised as follows: in Section 2 we list the\nrelevant properties of NGC 357 from the literature, while in\nSection 3 we summarise the observations and the data reduction procedure. Then, we describe the morphology and kinematical profiles in Sections 4.1 and 4.2, respectively. Section\n4.3 details the stellar population analysis, from the emission\nlines correction of the spectra to the detailed study of the\nbulge region and the comparison between structural components. A discussion of the implications of these results for\nthe structure and possible formation scenarios of NGC 357\ncan be found in Section 5. Finally, Section 6 sets out the\nmain conclusions of this work.\n\n2\n\nMAIN PROPERTIES OF NGC 357\n\nNGC 357 is classified as SB(r)0/a by de Vaucouleurs et al.\n(1991) and as SBa by Sandage & Tammann (1981). This\ngalaxy appears in the catalogue of double-barred galaxies\nof Erwin (2004), who provides information about the properties of the main and the inner bar of NGC 357, based on\nthe analysis of infrared images from the Hubble Space Telescope. The two bars of NGC 357 are almost perpendicular,\nwith the inner one almost parallel to the major axis of the\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\nTable 1. Relevant properties of the structural components of\nNGC 357.\nNGC 357\n\nInner bar\nOuter bar\nDisc\n\nInclination\n(1)\n\nPA\n(2)\n\nSemi-major axis\n(3)\n\nǫmax\n(4)\n\n36◦\n\n45◦\n120◦\n20◦\n\n3.1 arcsec\n21 arcsec\n-\n\n0.16\n0.44\n-\n\n(1) galaxy inclination (Aguerri et al. 2005);\n(2) position angle (hereafter PA) of the major axis of the galaxy\n(disc; Aguerri et al. 2005) and the two bars (Erwin 2004);\n(3) bar lengths, estimated as the semi-major axes of maximum\nisophotal ellipticity (Erwin 2004), and\n(4) maximum isophotal ellipticity of the bars (ǫ = 1 − b/a), from\nErwin (2004).\n\ngalaxy, as seen in Figure 1. We have specifically chosen this\nearly-type spiral in order to avoid the presence of complex\nstructural components and dust, which can make the stellar\npopulation analysis very tricky. The galaxy distance is 31.6\nMpc (Erwin 2004), which corresponds to ∼150 pc arcsec−1 .\nThe relevant properties of NGC 357 are shown in Table 1.\nAlthough some studies claim this galaxy is isolated\n(e.g., Gadotti et al. 2007), van den Bergh (2002) finds it belongs to a group with at least six other members. However,\nit shows no signatures of interaction with its closer companions. NGC 357 is classified as a LINER (Gadotti et al.\n2007).\nThe structural properties of NGC 357 have been\nstudied photometrically by several authors. In this way,\nAguerri et al. (2005) perform a photometric decomposition\nof an I -band image of this galaxy along its outer bar major\naxis, getting the main photometric parameters of its structural components, namely bulge, outer bar and disc; they\ndo not take into account the inner bar since its contribution\nto the radial surface brightness along the main bar is negligible. Their main conclusion is that the bulge of NGC 357\nfollows the same fundamental plane than the ellipticals and\nother bulges of S0 galaxies.\n\n3\n\nOBSERVATIONS AND DATA REDUCTION\n\nThe spectroscopic observations of NGC 357 were carried\nout with the 3.5-m New Technology Telescope (NTT) at\nthe European Southern Observatory (ESO) in La Silla\n(Chile) on 5-13 October 2002. The ESO Multi-Mode Instrument (EMMI) was operated both in blue (BLMD) and red\nmedium-dispersion spectroscopic (REMD) mode.\nThe NTT mounted EMMI in BLMD using the grating\nNo. 3 blazed at 3800 Å with 1200 grooves mm−1 in first order in combination with a 1.3 arcsec × 5.5 arcmin slit. The\ndetector was the No. 31 Tektronix TK1024 EB CCD with\n1024 × 1024 pixels of 24 × 24 μm2 . It yielded a wavelength\ncoverage between about 3990 Å and 4440 Å with a reciprocal\ndispersion of 0.45 Å pixel−1 . The spatial scale was 0.37 arcsec pixel−1 . The instrumental resolution was 1.3 Å (FWHM)\ncorresponding to σinst ∼ 40 km s−1 .\nSix spectra of 45 min each were taken aligning the slit\nwith the major axis of the inner bar (PA = 45◦ ). Two more\nc 2002 RAS, MNRAS 000, 1–17\n\n3\n\nspectra of 45 min each were obtained aligning the slit with\nthe major axis of the outer bar (PA = 120◦ ). All the spectra\nwere obtained using the guiding TV camera to center the\nslit on the galaxy nucleus.\nThe NTT mounted EMMI in REMD using the grating No. 6 blazed at 5200 Å with 1200 grooves mm−1 in first\norder. A 1.0 arcsec × 5.5 arcmin slit was adopted. The mosaiced MIT/LL CCDs No. 62 and 63 with 2048 × 4096 pixels\nof 15 × 15 μm2 covered the wavelength range between about\n4800 Å and 5460 Å. The on-chip 2 × 2 pixel binning provided\na reciprocal dispersion and spatial scale of 0.40 Å pixel−1\nand 0.332 arcsec pixel−1 . The instrumental resolution was\n1.6 Å (FWHM) corresponding to σinst ∼ 30 km s−1 .\nAfter centering the slit on the galaxy nucleus, two spectra of 30 min each were obtained along the disc major axis\n(PA = 20◦ ).\nThe range of the seeing FWHM during the observing\nruns was 0.6-1.4 arcsec as measured by the ESO Differential Image Motion Monitor. A comparison lamp exposure\nwas obtained after each object integration to allow accurate wavelength calibration. Quartz lamp and twilight sky\nflatfields were used to remove pixel-to-pixel variations and\nlarge-scale illumination patterns. Several G and K stars and\nspectrophotometric standard stars were observed with the\nsame set-up to serve as templates in measuring the stellar\nkinematics and in flux calibration, respectively.\nAll the spectra were overscan and bias subtracted, flatfield corrected, corrected for bad pixels and columns, and\nwavelength calibrated using standard IRAF1 routines. The\ncosmic ray removal is a critical step since any residual might\naffect the spectral lines measured to derive the properties\nof the stellar populations. It was performed with the REDUCEME package (Cardiel 1999), that assures a careful\nand accurate inspection and interpolation of the spectra. We\nchecked that the wavelength rebinning was done properly\nby computing the difference between the measured and predicted wavelengths (Osterbrock et al. 1996) for the brightest\nnight-sky emission lines in the observed spectral ranges. The\nresulting accuracy in the wavelength calibration is better\nthan 5 km s−1 . The spectra taken along the same axis were\nco-added using the centre of the stellar continuum as reference. The contribution of the sky was determined from the\noutermost regions at the two edges of the resulting spectra,\nwhere the galaxy light was negligible, and then subtracted,\ngiving a sky subtraction better than 1%. A one-dimensional\nsky-subtracted spectrum was obtained for each kinematical\ntemplate star. The sky-subtracted spectra were flux calibrated using the observed spectrophotometric stars as a reference. Neither extinction nor dust corrections were applied\nfor the blue spectra since the wavelength coverage is short\nand we are not interested in colour measurements.\nFinally, the galaxy spectra were binned along the spatial direction in order to assure a minimum signal-to-noise\nratio (S/N hereafter) of ∼ 20 Å−1 , sufficient to our kinematic analysis. Such a minimum S/N is reached only in the\n\n1\n\nImaging Reduction and Analysis Facilities (IRAF) is distributed by the National Optical Astronomy Observatories which\nare operated by the Association of Universities for Research in\nAstronomy (AURA) under cooperative agreement with the National Science Foundation.\n\n\f4\n\nde Lorenzo-Cáceres et al.\n\nFigure 1. r -band image of NGC 357 from the Sloan Digital Sky Survey (York et al. 2000). The left panel shows the whole galaxy whereas\nthe right panel is a zoom of the inner ∼20 arcsec. We have overplotted the isodensity contours and the directions of the major axis of\nthe inner bar (green dot-dashed line), outer bar (green dashed line) and disc (white line).\n\noutermost radial bins, it increases at smaller radii reaching\na maximum S/N∼ 60 Å−1 in the radial bin corresponding to\nthe galaxy centre. The spatial binning procedure was carefully carried out in order to assure the separation of the\ndifferent structural components of NGC 357 (i.e., the bulge,\ninner, and outer bar).\n\n4\n4.1\n\nANALYSIS AND RESULTS\nPhotometry\n\nAs a first approach to disentangling the morphology of\nNGC 357, we perform an ellipse fitting over a NICMOS2\nF160W image taken from the Hubble Legacy Archive (Prog.\nId. 7330, PI John Mulchaey). For this purpose we use the\nIRAF task ELLIPSE, which follows the procedure outlined\nby Jedrzejewski (1987). Figure 2 shows the resulting profiles of ellipticity, ǫ, position angle, PA, and the fourth cosine Fourier coefficient, a4 . The presence of the bars causes\ntwo sharp changes in the ellipticity and PA parameters: one\npeak at ∼3 arcsec related to the inner bar, and a discontinuity at ∼25 arcsec due to the outer bar. These two values\nare in agreement with the bar lengths estimated by Erwin\n(2004). The a4 profile also shows two peaks at the locations\nof the two bars. a4 is a measurement of the deviation of the\nisophotes from pure ellipses, so positive values correspond to\ndiscy isophotes whereas negative values to boxy isophotes\n(Jedrzejewski 1987; Kormendy et al. 2009). Therefore, the\ntwo bars of NGC 357 present discy isophotes.\nWe get a maximum isophotal ellipticity of ǫ ∼0.15 and\nǫ >0.4 for the inner and outer bars, respectively, and a\nPA∼40◦ for the inner bar, PA∼120◦ for the outer bar, and\nPA∼15◦ for the disc. These measurements are also consistent with the estimates of Erwin (2004) and Aguerri et al.\n(2005).\n\n4.2\n4.2.1\n\nKinematics\nMeasuring the line-of-sight velocity and velocity\ndispersion\n\nTwo different techniques were used to derive the velocity and\nvelocity dispersion profiles of NGC 357: a cross-correlation in\nthe Fourier domain and a full spectrum fitting in wavelength\nspace. The cross-correlation procedure (e.g., Tonry & Davis\n1979) is as follows: among the observed velocity standards,\nwe select those that are spectroscopically most similar to\nthe galaxy. After correcting them to rest frame, we combine the stellar spectra to create an artificial velocity standard star spectrum that will be used as a template for the\ncross-correlation. This standard spectrum is then broadened\nto several velocity dispersions and the results are correlated with the original star, obtaining for each case a crosscorrelation peak with its full width half maximum (FWHM).\nThus, we create a calibration table that provides the FWHM\nwe expect if a spectrum with a given velocity dispersion is\ncross-correlated with our stellar template, so we can get the\ndispersion of the galaxy spectra by correlating them with\nthe star. The line-of-sight velocity is a direct product of the\ncorrelation since the template is at rest.\nFor the full spectrum fitting we have made use of the penalized pixel fitting (hereafter pPXF) routine developed by\nCappellari & Emsellem (2004). The spectral regions which\nare potentially affected by emission lines are previously\nmasked on each galaxy absorption spectrum, which is then\nfitted with a linear combination of a well-selected subsample\nof the single stellar population models (hereafter SSPs) of\nVazdekis et al. (2010), previously convolved with a line-ofsight velocity distribution (hereafter LOSVD). This LOSVD\nis parametrized by an expansion in Gauss-Hermite functions\n(Gerhard 1993; van der Marel & Franx 1993); since the S/N\nrequirements for this procedure get more demanding as the\norder of the desired LOSVD moments increases, we decided\nto focus only on the velocity and velocity dispersion to avoid\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\n\n5\n\nFigure 2. Ellipticity (left panel), position angle (middle panel), and fourth cosine Fourier coefficient (right panel) profiles that result\nfrom fitting ellipses to the isophotes of NGC 357 in the NICMOS2 F160W image. The semi-major axes of the fitted ellipses are given in\nlogarithmic scale. The vertical orange dot-dashed and blue dashed lines indicate the lengths of the inner and outer bars, respectively.\n\nthe loss of spatial resolution caused by a wider radial binning.\nThe two methods used for deriving the kinematics of\nNGC 357 are completely independent and even work in\ndifferent parameter spaces. In order to enhance the differences between both techniques, we explore two different ways that offer complementary advantages: whereas\nthe SSPs help to alleviate the template mismatch problem\n(Falcón-Barroso et al. 2003), the artificial template was obtained by stellar spectra, which were observed and reduced\nexactly in the same way as the galaxy spectra, thus minimizing the possibility of introducing instrumental effects.\nThe results obtained from both methods are fully consistent, with differences smaller than the corresponding error\nbars. These differences range from few km s−1 in the central\nregions to a maximum of 10 km s−1 in the farthest observed\nradii. Figure 3 shows the final line-of-sight velocity (after\nsubtracting the systemic velocity) and velocity dispersion\nprofiles obtained with pPXF along the major axis of the\ninner bar, outer bar, and disc.\n\n4.2.2\n\nRevealing the inner and outer bars\n\nThe presence of the inner bar is clearly unveiled by the shape\nof the rotation curve (Figure 3, left panels), that follows the\nsame characteristic S- or double-hump profile previously observed for inner bars by Emsellem et al. (2001). This profile is characterized by an inner steep slope so the rotation\nreaches a local maximum, it slightly drops to a local minimum and then it raises again slowly further out. Since the\ntwo bars of NGC 357 are almost perpendicular, with the\ninner one almost parallel to the major axis of the galaxy,\nwe can conclude that the double-hump profile in Figure 3 is\ncompletely due to the presence of the inner bar. This kind of\nrotation curve was theoretically derived by Chung & Bureau\n(2004) and Bureau & Athanassoula (2005) by means of\nN-body simulations of single-barred galaxies; in this last\nwork, the authors show that the double-hump structure is\nmore enhanced in galaxies with strong bars seen end-on,\nwhereas the effect is weakened for larger viewing angles\nor weaker bars. Although the double-hump rotation curve\nis clearly visible in the case of the inner bar of NGC 357,\nc 2002 RAS, MNRAS 000, 1–17\n\nsuggesting the bar is strong, the maximum isophotal ellipticity is only ǫmax ∼0.15, which indicates that it is actually a very weak bar. Indeed, the maximum ellipticity of\nthe isophotes in a bar region correlates well with the bar\nstrength (Laurikainen et al. 2002).\nThe velocity dispersion profile along the inner bar shows\nthree local minima: a central drop corresponding to the socalled σ-drop of Emsellem et al. (2001), and two symmetric\ndecreases exactly at the edges of the bar (±4 arcsec) that\ncan be identified as the σ-hollows (de Lorenzo-Cáceres et al.\n2008), known to be signatures of an inner bar. These hollows have an amplitude of ∼20 km s−1 , consistent with the\nfindings of de Lorenzo-Cáceres et al. (2008), who found amplitudes ranging from 10 to 40 km s−1 . Further discussion on\nthese features and their different origins is found in Section\n5. As expected, the velocity dispersion decreases outwards.\nThe outer bar of NGC 357 (Figure 3, middle panels) is\nalmost perpendicular to the major axis of the galaxy, which\nwe assume to be the kinematical line of nodes. This means\nthat the line-of-sight velocity values along the outer bar are\nexpected to be very low, as it is shown in Figure 3. However,\na clear kinematical decoupled profile appears in the central\nregion. This structure rotates faster than its surroundings\nand extends ∼ ±2 arcsec, which corresponds to the radial region of the σ-drop observed in the velocity dispersion profile.\nA closer inspection to the inner bar velocity profile reveals\nthe same decoupling, since two steep humps appear inside\nthe double-hump profile, exactly at ∼ ±2 arcsec. Unfortunately, the low S/N level of the spectra along the direction\nof the outer bar of NGC 357 only allows us to analyse the\nkinematics in the inner ∼ ±10 arcsec, so we cannot explore\nthe whole main bar to see if other signatures, as for example\nthe σ-hollows or the double-hump profile, are present.\nThe kinematics along the major axis of the disc is shown\nin Figure 3 (right panels). In this case, we find as expected\nthe maximum line-of-sight velocity values and the same central signatures found for the other directions: the decoupling\nin the velocity profile and the σ-drop. In Section 5 we discuss the possible structures that might be causing these signatures.\n\n\f6\n\nde Lorenzo-Cáceres et al.\n\nFigure 3. Line-of-sight velocity (after the systemic velocity subtraction; top panels) and velocity dispersion (bottom panels) profiles as\na function of the radius for the spectra obtained along the major axis of the inner bar (left panels), outer bar (middle panels) and disc\n(right panels) of NGC 357.\n\n4.3\n\nStellar populations\n\nThe aim of this stellar population analysis is to recover the\nrelative ages, metallicities, and formation timescales of the\ndifferent structural components of NGC 357: bulge, inner\nbar, and outer bar. Unfortunately, the quality of the data,\nalthough very high, still is not sufficient to analyse the disc,\nwhich requires spectra taken with 10 m-class telescopes. To\nperform this detail study, we have summed up the individual\nspectra, previously corrected for their kinematics (velocity\nand velocity dispersion), to reach the desired S/N within\neach structural component. For this purpose, we only add\nthose spectra corresponding to the regions where a given\ncomponent is clearly dominating the total luminosity: the\ninner ±1 arcsec for the bulge, from ±2 arcsec to ±4 arcsec for the inner bar, and from ±4 arcsec to ∼ ±15 arcsec\n(limited in this case by S/N requirements) for the outer bar.\nSince the spectra along the major axes of the two bars and\nthe disc always cover the central region, we have two spectra\nfor the bulge in the blue and red spectral range, respectively.\nHowever, the bars were observed only in the blue spectral\nrange.\nAgain, we have chosen two methods to analyse the\nstellar populations: the line-strength indices and a full\nspectrum-fitting approach. Unlike using the Lick/IDS system, we have chosen to perform our line-strength analysis on\nthe system imposed by the kinematics of the galaxy, as done\nin Vazdekis et al. (2001) and Yamada et al. (2006). For the\n\nsecond approach, we use the cross-correlation technique employed by Vazdekis (1999) and Vazdekis & Arimoto (1999).\nIn both cases, comparisons with stellar population synthesis models are needed; as for the kinematics, we have\nused the empirical models of Vazdekis et al. (2010), built\nfrom the MILES stellar library (Sánchez-Blázquez et al.\n2006). These models have a wide wavelength coverage (from\n3525 to 7500 Å) and a resolution of 2.5 Å (FWHM), constant over the whole spectral range (Beifiori et al. 2011;\nFalcón-Barroso et al. 2011).\n\n4.3.1\n\nEmission line correction\n\nThe ionized gas present in the galaxy leads to emission lines\nthat contaminate the spectrum and fill in the absorption\nlines. Therefore, it is crucial to correct for this emission to\nget the properties of the stellar populations from the spectra.\nIndeed, if a proper separation of both contributions (the stellar absorptions and gaseous emissions) is not performed before the analysis, the measured ages will be artificially older.\nIn our particular case, we need to clean up the three Balmer\nlines included in our spectral range (Hβ, Hγ and Hδ), and\nthe Fe5015 and Mgb indices, which can be affected by the\n[OIII]4959,5007 and [NII]5198,5200 lines, respectively.\nThe common procedure for this correction is to mask\nthe spectral region possibly contaminated by emission lines\nand fit the obtained spectrum with a set of stellar populac 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\ntion models. For this purpose we use the ULySS2 package\n(Koleva et al. 2009), which minimizes the χ2 between the\nobserved spectrum and a model spectrum consisting of a\nlinear combination of non-linear parameters (age and metallicity), corrected for the kinematics and multiplied by a polynomial to avoid flux calibration problems. We subtract the\nULySS best fit spectrum to the original one in order to get\nthe residuals plus the contribution of the emission lines. We\nthen approximate each emission line with a Gaussian, considering only those features with an amplitude larger than\nthree times the standard deviation of the residuals.\nGiven the sensitivity of the emission correction, we\ndouble-check it by repeating it with the GANDALF package\n(Sarzi et al. 2006). The advantage of GANDALF is that it\nfits simultaneously the stellar and the gaseous contributions,\nby including emission lines as Gaussians in the set of stellar\npopulation models used as templates. Although GANDALF\nis also based on χ2 minimization, it differs from ULySS in\nthat it fits the stellar contribution with a linear combination\nof models, while ULySS interpolates the grid of templates\nto look for the most appropriate single stellar population\nmodel.\nThere are many details to take care of when fitting the\nfull spectrum, such as the initial guesses and the number\nand range of the masked regions. For example, in the case\nof the blue spectra of NGC 357, we are forced to mask the\nCN band as we find evidences of its α-enhancement (not\nincluded in the scaled-solar models of Vazdekis et al. 2010).\nWhen the amount of emission derived from the two routines\nis in agreement, we subtract it from the observed spectra\nand use the results for the analysis of the stellar populations.\nFigure 4 presents an example of the fitting performed with\nULySS for the bulge red spectrum because it shows Hβ and\n[OIII]5007, which are the most prominent emission lines we\nobserved.\n\n7\n\nLick/IDS resolution and IDS instrumental system, but at\nconstant σ and flux-calibration response curve. Since the red\npseudo-continuum of the Fe4383 index falls partially out of\nour blue spectral range, we have defined a new Fe4383SR\nindex (named after Short Red, see Appendix A for details).\nTable 2 presents the definitions of the new Fe4383SR and\nthe original Lick/IDS Fe4383 index.\nFor the bulge red spectrum, we compute the combined Iron-index hFei and total metallicity indicator [MgFe]3\n(González 1993). We avoid the use of the Fe5015 index, since\nit is highly contaminated by the prominent [OIII]5007 emission line.\nIn addition to the Lick age index-definitions for the\nBalmer lines (Hβ, Hγ and Hδ), we also measure the\nmore powerful Hβo (Cervantes & Vazdekis 2009) and Hγσ\n(Vazdekis & Arimoto 1999) indices, which show great abilities to disentangle ages. The use of indices with enhanced\nsensitivity to the age or metallicity represents an advantage\nto lift the degeneracy between these parameters.\n4.3.3\n\nCross-correlation analysis\n\nA set of suitable absorption line-strength indices are measured over the emission-cleaned spectra of the bulge, inner\nbar, and outer bar, as well as over the Vazdekis et al. (2010)\nmodels. In order to compare the results of the three components, the galaxy spectra and the SSPs are first degraded to\ntheir maximum resolution, given by the higher value of the\nvelocity dispersion profile (σ ∼180 km s−1 ). All the measurements are performed in the same system, i.e., the one defined\nby the kinematics of the galaxy in a consistent way. We plot\nthe values obtained for an age indicator versus those of a\nmetallicity indicator for the SSP models, in order to obtain\nmodel grids such as those shown in Figures 5 and 6. These\ngrids are not perfectly orthogonal due to the age-metallicity\ndegeneracy. The mean luminosity-weighted ages and metallicities of each structural component of NGC 357 can then\nbe derived by simply overplotting the observed indices on\nthese grids.\nIn particular, we computed all the Lick indices included\nin our spectral range, following the definitions given by\nTrager et al. (1998). Note that although the index definitions are similar, our model measurements are not in the\n\nThe alternative technique we use to analyse the stellar populations of NGC 357 is to cross-correlate the galaxy spectrum\nwith each SSP spectrum from the Vazdekis et al. (2010)\nmodel library. For this purpose the model spectra are previously prepared to match the spectral range, velocity dispersion, and spectral resolution of the data. Moreover, the\ngalaxy and model spectra are rebinned logarithmically and\nnormalized to remove the continua.\nIn order to optimize the cross-correlation method for\ndisentangling different stellar populations, it is necessary to\nadequately filter the spectra and multiply them by a cosinebell-like function (Tonry & Davis 1979). The importance of\nchoosing a suitable filter lies in the possibility of getting rid\nof the noise in the spectrum; this purpose can be achieved\nby simply removing the largest wavenumbers, where the information about the shortest wavelength ranges is included.\nTherefore, the limit is imposed by the resolution of the data.\nOn the other hand, shorter wavenumbers contain information about wider spectral ranges, so possible residuals of\nthe continuum removal due to errors in the flux calibration might also be filtered. The drawback of this procedure\nis that it implies a power loss of the final cross-correlation\nfunction, specially when filtering short wavenumbers where\nmost of the signal is included.\nApart from the filtering, it might be required to mask\nsome regions in the original spectra, as is usually done in\nthe full-spectrum fitting technique in the wavelength space.\nWe tested different masks trying to avoid those features that\nare not well reproduced by the models due to mismatched\nabundance ratios: the CN in the blue spectral range and the\nMg and Hβ features in the red spectral range. Again, these\nfeatures contain most of the signal of the power spectrum\nso the choice of the masks has to be done very carefully in\norder to not lose most of the information.\nFinally, the peak height obtained for each correlation\nfunction is plotted against the model age and metallicity.\nSince the cross-correlation profile reaches a higher value\n\n2\n\n3\n\n4.3.2\n\nLine-strength indices\n\nAvailable at http://ulyss.univ-lyon1.fr/.\n\nc 2002 RAS, MNRAS 000, 1–17\n\nhFei = (Fe5270 + Fe5335)/2, and [MgFe] =\n\np\n\nMgb × hFei\n\n\f8\n\nde Lorenzo-Cáceres et al.\n\nFigure 4. The correction of the emission lines in the red spectrum of the bulge of NGC 357 by means of ULySS. The observed and\nmodel spectra are plotted in black and orange, respectively in the upper panel. The vertical dashed lines mark the spectral regions we\nmasked because of emission-line contamination (Hβ and [OIII]4959,5007 doublet) and α-enhancement (Mg). The residuals of the fit are\nshown in green in the lower panel. The Gaussians fitting the emission lines are plotted in magenta.\n\nTable 2. The definitions of the new Fe4383SR and Lick/IDS Fe4383 indices.\nIndex\n\nBlue pseudo-continuum\n(Å)\n\nMain bandpass\n(Å)\n\nRed pseudo-continuum\n(Å)\n\nSource\n\nFe4383SR\nFe4383\n\n4359.125-4370.375\n4359.125-4370.375\n\n4369.125-4398.087\n4369.125-4420.375\n\n4419.328-4432.389\n4442.875-4455.375\n\nthis paper\nTrager et al. (1998)\n\nwhen object and template are more similar (getting a maximum value of 1 if they are exactly the same and no filtering is\napplied), the maximum value in the final peak heights plot\nindicates which template best resembles the galaxy spectrum. This method takes advantage of the full information\ncontained in the spectrum, instead of being constrained to\ncertain features as in the case of the line-strength indices.\nThis type of full-spectrum fitting technique works in the\nFourier space and, as an additional advantage, it does not\nneed for a previous emission correction of the data. The application of this technique to the derivation of the stellar\npopulations was already introduced by Vazdekis (1999) and\nVazdekis & Arimoto (1999) and in this work it is adopted\nto double-check the results obtained from the analysis of the\nline-strength indices.\nTo compute the errors for the cross-correlation method\nwe perform a set of 100 Monte Carlo simulations by randomly adding Gaussian noise to the data, keeping the original S/N ratio. The 1-σ regions are then overplotted to the\n\ncross-correlation peak height curves. In order to test the\nrequirements of this method we run some simulations with\nthe Vazdekis et al. (2010) models by artificially changing the\ndifferent parameters involved: spectral resolution, spectral\nrange, and S/N ratio, taking as a reference the values measured for our observed spectra. We find that the S/N of the\ndata obtained for the outer bar is not enough to disentangle\nits age and metallicity, since the error bars for this case are\ntoo large (see Appendix B). This prevents us from providing a more constrained solution for the outer bar through\nthe cross-correlation analysis. We have to note that the results obtained here are aimed to be complementary to those\nfrom the line-strength analysis. Therefore, we restrict the\napplication of the cross-correlation to the bulge and inner\nbar. These results are shown in Figures 7 and 8, and will be\nanalysed in Sections 4.3.4 and 4.3.5, respectively.\n\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\n\n9\n\nFigure 5. Age indicators Hβo , Hβ, Hγσ=200 , and HδF (from top to bottom) versus the metallicity indicators [MgFe], Mgb, hFei, CN2 , and\nCa 4227, and the G-band (from left to right). The grids correspond to the SSP models of Vazdekis et al. (2010) once smoothed to match\nthe resolution of the data (σ ∼180 km s−1 ). The lines represent different ages increasing from top to bottom (2.5, 3.2, 5.6, 10, and 18 Gyr,\nrespectively) and metallicities, which increase from left to right ([Z/H] = −0.7, −0.4, 0.0, and 0.2, respectively). Ages and metallicities\nfor the grids are indicated in the first panel. The black filled circle is the measurement for the bulge of NGC 357, whereas the grey\nfilled circles are the mean values for the bulges of a subsample of barred galaxies from Pérez et al. (2009) and Pérez & Sánchez-Blázquez\n(2011). The open circles correspond to two elliptical galaxies in Virgo cluster from Yamada et al. (2006). All the reference galaxies have\nbeen selected to have a central velocity dispersion similar to that of NGC 357 (σ ∼180 km s−1 ).\n\nc 2002 RAS, MNRAS 000, 1–17\n\n\f10\n\nde Lorenzo-Cáceres et al.\n\nFigure 6. Age indicators Hγσ=200 and HδF (top and bottom panels, respectively) versus the metallicity indicators Fe4383SR , CN2 , and\nCa 4227, and the G-band (from left to right). The model grids are the same as in Figure 5. The coloured symbols are the measurements\nfor the different structural components of NGC 357: bulge (black circle), inner bar (orange diamond), and outer bar (blue triangle). The\ngrey triangles are the mean values for the main bars of a subsample of galaxies from Pérez et al. (2009), selected to have a similar central\nvelocity dispersion than NGC 357 (σ ∼180 km s−1 ).\n\nFigure 7. Cross-correlation peak heights from the analysis of the red (left panel) and blue (right panel) spectra of the bulge of NGC 357\nwith a set of SSP models of Vazdekis et al. (2010), once smoothed to match the spectral range, resolution, and dispersion of the data.\nThe different coloured lines correspond to metallicities of [Z/H] = 0.2 (black), 0.0 (red), −0.4 (blue), and −0.7 (green) as a function of\nage. The width of the coloured region represents the 1-σ uncertainty derived from Monte Carlo simulations. The largest cross-correlation\npeak height value in each plot is marked by an asterisk and the corresponding age with a vertical dashed line.\n\n4.3.4\n\nStellar populations of the bulge\n\nFigure 5 shows the analysis of the line-strength indices of the\nbulge of NGC 357. Four age indicators are plotted against\nseveral well selected metallicity indicators and the G-band,\nusing features from both the red and blue spectral ranges\navailable for this component. Balmer lines might be affected\nby emission line contamination, although the amplitude of\nthis emission decays from the top (Hβo and Hβ) to the bot-\n\ntom (HδF ) indices of Figure 5. In fact, we find no emission\nin the Hδ feature for the bulge. For the case of Hβo and Hβ,\nwhere the emission contamination is larger, we find some\ndisagreements in the resulting ages with respect to those\nderived from Hγ and Hδ. Although the emission correction\nhas been performed very carefully (see Section 4.3.1), these\ninconsistencies are probably due to an underestimation of\nthe emission affecting the Hβ feature within the noise level.\nAs an attempt to take this effect into account, the Hβ and\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\n\n11\n\nFigure 8. Same as in Figure7 for the blue spectrum of the inner bar of NGC 357.\n\nHβo error bars are obtained by computing the maximum\nand minimum (but no null) 1-σ emission correction.\nMoreover, we find subtle differences between the ages\nobtained with the Hβo and Hβ indices. These differences\nmight be attributed to either the emission correction, that\naffects the two definitions in a different manner, or to the\ngreater sensitivity of Hβo to the α-enhancement in comparison to that of Hβ (Cervantes & Vazdekis 2009). Indeed,\nthese differences are more evident in the α-enhanced indicators (Mgb and CN2 ), whereas the results from hFei or\nCa 4227 are almost identical. Taking into account the error\nbars and the results from all the plots in Figure 5, we derive\na mean luminosity-weighted age of ∼8 Gyr for the bulge of\nNGC 357.\nFrom the first column in Figure 5, where the total\nmetallicity indicator [MgFe] is plotted, we derive a supersolar metallicity ∼0.2 dex for the bulge of NGC 357. For\nthis component we also measure the hFei, Mgb, and CN2\nindices, so that it is possible to estimate the [ZMg /ZhFei ]\nand [ZCN2 /ZhFei ] ratios, which are calculated as the relative metallicity difference obtained when plotting the various\nmetallicity indicators versus the Mg (Vazdekis et al. 2001).\n[ZMg /ZhFei ] and [ZCN2 /ZhFei ] are shown to be good proxies for the [Mg/Fe] and [CN/Fe] abundance ratios. In fact,\n[ZMgb /ZhFei ] and [Mg/Fe] follow a linear relation, as shown\nin Vazdekis et al. (2010). These overabundances are important because they can be used to constrain the timescale for\nthe formation of the bulk of their stellar populations: Mg\n(as well as other α elements) is the product of type II supernovae, which explode soon after the star formation; on the\ncontrary, the Iron-peak elements are ejected by type Ia supernovae, on longer timescales of around 1 Gyr. In the meantime between those two cases, the low- and intermediatemass stars enrich the interstellar medium with C and N.\nTherefore, the [ZMgb /ZhFei ] and [ZCN2 /ZhFei ] values might\nhelp to put constraints on the assembly history of a galaxy.\nIn the case of NGC 357, we find [ZMgb /ZhFei ]=0.3-0.4 dex,\nwhich is the value expected for an E/S0 galaxy of σ ∼180\nkm s−1 according to the well-known correlation between\n[ZMg /ZhFei ] and σ for early-type objects (e.g., Jørgensen\nc 2002 RAS, MNRAS 000, 1–17\n\n1999; Trager et al. 2000; Kuntschner 2000; Vazdekis et al.\n2004; Carretero et al. 2004). Note that an extrapolation of\nthe grid is necessary to estimate the [Mg/H] abundance,\nsince the models do not extend beyond [Z/H]=0.2 dex. We\nalso find a supersolar [ZCN2 /ZhFei ] ratio for the bulge of\nNGC 357, that reaches ∼0.2 dex.\nNote that the bulge of NGC 357 shows subsolar values\nfor the Ca 4227 index. This is the expected behaviour for\ngalaxies of similar central velocity dispersion. In fact, rather\nthan resembling other α elements as the Mg, Ca tends to\nget subsolar values (Vazdekis et al. 1997).\nIn order to find out if the formation of the bulge of\nNGC 357 has followed a distinguished process due to the\npresence of the inner bar, we compare our results with\nthose obtained for various elliptical galaxies and other spiral bulges. Thus, we have overplotted the index values for\ntwo Virgo ellipticals with a central σ ∼180 km s−1 , taken\nfrom the sample of Yamada et al. (2006). These measurements appear as two open circles in Figure 5. Moreover,\nwe have selected a subsample of four early-type barred\ngalaxies from the works by Pérez et al. (2007, 2009) and\nPérez & Sánchez-Blázquez (2011) with central velocity dispersions similar to that of NGC 357. Two galaxies host a\nsingle bar (NGC 1169 and NGC 1358), and two are doublebarred systems (NGC 2859 and NGC 2962). For these objects, we have measured the mean line-strength indices inside the bulge region from the values at a resolution of\nσ ∼180 km s−1 . The results, when possible, are also shown\nin Figure 5 as grey filled circles. In general, the age, metallicity and α-enhancement obtained for NGC 357 resemble\nvery closey those of the comparison bulges. The age and\nmetallicity of the Virgo ellipticals are also in agreement with\nNGC 357, although they show a larger [ZCN2 /ZhFei ] enhancement, with a mean value above ∼0.3 dex.\nThe results for NGC 357 from the line-strength analysis are also verified by the cross-correlation method. Figure\n7 shows the peak heights resulting from cross-correlating\nthe bulge spectra with SSPs of different ages and metallicities, following the methodology described in Section 4.3.3.\nFrom both spectral ranges, we obtain a supersolar value\n\n\f12\n\nde Lorenzo-Cáceres et al.\n\n([Z/H]∼0.2 dex) for the mean luminosity-weighted metallicity, and a final age of 7-8 Gyr (although the error regions\nspan a wider range). So far, the cross-correlation method\nalone is not able to clearly distinguish a mean luminosityweighted stellar population above ∼5 Gyr, due to the flattening of the cross-correlation peak heights versus age profiles and the amplitude of the error bars. For younger ages,\nFigure 7 shows that the curves are steeper, allowing to disentangle between different populations very efficiently. However, the fact that the results obtained from this procedure directly agree with the line-strength analysis, points\nout the potential power of this method. Note that the agemetallicity degeneracy is evident in Figure 7: the shoulder\nof each metallicity curve (i.e., the point where there is a\nclear transition in the slope) occurs at older ages for lower\nmetallicities.\n\n4.3.5\n\nStellar populations of the inner and outer bars\n\nThe relative ages and metallicities between bulge, inner bar\nand outer bar of NGC 357 are shown in Figure 6, where\nthe age indicators Hγσ and HδF are plotted against various\nmetallicity indicators (including the new Fe4383SR definition) and the G-band. In this case we are limited to indices\nin the blue range, since it is the only spectral range available\nfor the two bars.\nIn the first panel of Figure 6 we plot Hγσ against\nFe4383SR , which provide the most orthogonal grid thanks\nto the age-disentangling power of Hγσ . We find that the\nbulge and inner bar show approximately the same mean\nluminosity-weighted age (∼8 Gyr) and solar metallicity. The\nouter bar also presents a similar age as the inner structures,\nbut it tends to be less metal-rich ([Fe/H]∼-0.4 dex). However, the error bars are large due to the S/N requirements of\nthe Hγσ index. For this reason it is necessary to complement\nthese results with those from the less orthogonal HδF versus Fe4383SR grid, which confirms the previous estimations\nfor the bulge and inner bar. The trend towards lower metallicites for the outer bar is also verified. In fact, the only\ndifference we find between the two plots is that the outer\nbar seems to be slightly older when looking at the HδF versus Fe4383SR grid. However, taking into account the error\nbars and the results from the rest of the plots (particularly\nHδF versus CN2 and Hγσ versus Ca 4227), we must conclude\nthat the three structural components of NGC 357 are nearly\ncoeval.\nSince we have measurements for the Fe4383SR and CN2\nindices, we can use the [ZCN2 /ZFe4383SR ] ratio as a proxy\nfor the [CN/Fe] abundance, as we did in Section 4.3.4 with\n[ZCN2 /ZhFei ]. We find that, whereas the bulge and inner bar\npresent an overabundance of [ZCN2 /ZFe4383SR ]>0.2 dex, the\nouter bar has a more enhanced value above 0.4 dex.\nTo make a comparison with the age and metallicity of\nother main bars, we take into account the same galaxies we\nadopted as a reference in Figure 5. We compute the mean\nvalues of the line-strength indices along the main bar at a\nresolution of σ ∼180 km s−1 from the data of Pérez et al.\n(2009). These comparison values are shown in Figure 6 and\nthe plotted errors take into account the variation of the linestrength indices along the main bar. Like for the bulge case,\nthe outer bar of NGC 357 shows no particular features when\n\ncompared to the other main bars. Indeed, its age and metallicity are within the ranges defined by the control sample.\nWe apply the cross-correlation method only to the inner bar spectrum since that of the outer bar has too low\nS/N. The mean luminosity-weighted age and metallicity are\nconsistent with those derived from the analysis of the linestrength indices. Figure 8 shows that although the maximum\nof the cross-correlation peak heights is obtained for ∼4.5\nGyr, the solution spans over a wider range (from about 4 to\n10 Gyr) when taking into account the error regions. The resulting metallicity, despite the partial overlapping between\nthe solar and supersolar curves, is [Z/H]∼0.2 dex.\n\n5\n\nDISCUSSION\n\nThe various pieces of evidence provided by this work lead to\ntwo main questions: which is the real structure of NGC 357,\nand how this galaxy has been formed. The analysis of the\nphotometry and kinematic constrains the structural composition of NGC 357, which reveals itself as a really complex\ngalaxy. On the other hand, the study of the stellar populations provides surprisingly homogeneus results and sheds\nlight on the most probable assembly process for our galaxy.\nFor the sake of clarity, we split the Discussion in two Sections, devoted to each of these questions.\n5.1\n\nStructural components of NGC 357\n\nPhotometrical studies have confirmed that NGC 357 is composed of, at least, four structures, namely bulge, inner bar,\nouter bar and disc (Erwin 2004; Aguerri et al. 2005). The\npresence of the inner bar is also supported by the photometrical and kinematical analysis performed in this work.\nIn fact, the ellipticity and PA profiles presented in Figure\n2, and the velocity and velocity dispersion profiles along the\ninner bar direction presented in Figure 3, show clear signatures of this small, secondary bar, as explained in Sections\n4.1 and 4.2.\nInterestingly, the analysis of the kinematics also shows\nevidence of an additional, inner component: a kinematically\ndecoupled structure appears at the centre of NGC 357, rotating faster than its surroundings. This decoupling spans\napproximately ±2 arcsec and matches in size with the observed central σ-drop. The different structures that shape\nNGC 357 have to account for all the signatures present in\nthe kinematical profiles. In this Section we state the two\npossibilities that match with the results obtained in this\nwork.\n5.1.1\n\nAn inner disc and a classical bulge\n\nThe presence of a central velocity dispersion minimum in\na spiral galaxy was first reported by Bottema (1989). Since\nthen, the number of galaxies showing a σ-drop has increased\nsignificantly. In fact, Falcón-Barroso et al. (2006) find this\nsignature in at least 46% of a sample of 48 early-type spirals, although other cases have been noticed in smaller samples (e.g., Márquez et al. 2003), particularly in barred galaxies and even including late-type spirals (Ganda et al. 2006)\nand double-barred objects (Emsellem et al. 2001). The most\naccepted explanation for the formation of σ-drops in disc\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\ngalaxies is the star formation at their central regions: the\nnew stars acquire the kinematical properties of the gas\nthey are formed from; the dissipative nature of that gas is\nmore efficient in the central regions because of the higher\ndensity and converts the gas into a cold stellar component, such as an inner disc, with a lower velocity dispersion than the surroundings. This scenario is in agreement\nwith the N-body simulations of Wozniak et al. (2003) and\nWozniak & Champavert (2006), who made use of bars to\ntransport gas to the central regions.\nThe case of NGC 357 seems to support that hypothesis\nsince the central decoupling in velocity might be due to an\ninner disc whose low velocity dispersion would be the cause\nof the σ-drop. Therefore, NGC 357 is composed of at least\nfive structures: bulge, inner disc, inner bar, outer bar and\ndisc.\nThe σ-drop means a local minimum in the velocity\ndispersion with respect to the corresponding value for the\nbulge, which reaches σ ∼180 km s−1 or higher (the velocity\ndispersion profile should peak at the centre, where the σdrop masks the velocity dispersion of the bulge). This high\nvelocity dispersion value for the bulge implies it is pressure\nsupported and classical. This result is supported by the work\nof Aguerri et al. (2005), who find that the bulge of NGC 357\nfollows the same fundamental plane as the ellipticals or classical bulges of other early-type objects.\nWithin this context, the appearance of the σ-hollows\nat the edges of the inner bar in the velocity dispersion profile is also well understood. The σ-hollows were first seen\nin a sample of four double-barred galaxies analysed through\nintegral-field spectroscopy (de Lorenzo-Cáceres et al. 2008).\nBy means of N-body simulations, they tested the possible\nscenarios that might give rise to these hollows, showing that\ntheir size and amplitude depend on two parameters: the\nrelative contribution of the flux of the bulge to the total\nluminosity and the difference in the velocity dispersion of\nthe two components. Therefore, a galaxy hosting a classical\nbulge with a high velocity dispersion and a colder, inner bar\nwhich dominates the total luminosity at its ends (where the\nlight profile of the bulge has already decayed) will clearly\nshow the two σ-hollows at the bar edges, as for the case of\nNGC 357. In this scenario, the bulge is the hottest structural\ncomponent of NGC 357 and the velocity dispersion decreases\nfor the outer structures. Table 3 indicate the velocity dispersion values for each component. It is important to note that\nthe actual velocity dispersion of the inner disc is probably\nlower than the value given in Table 3, since the measured\nvalue includes the contribution of the bulge within the inner\ndisc region.\nThere are two important drawbacks for this possible\nstructural composition of NGC 357. First, the a4 > 0 signature of the inner disc should be detected in the photometrical analysis presented in Section 4.1. This is the case of the\nnuclear stellar discs observed in the centre of ellipticals and\nbulges (Morelli et al. 2010, and references therein). A careful\ninspection to the inner ±2 arcsec in Figure 2 shows no evidence of discy isophotes. Second, the formation of the inner\ndisc is usually related to a recent star formation in the centre, but the analysis of the stellar populations for NGC 357\nshows old ages for the central components; a significant\nyoung population such as that of an inner disc should be\nnoticed when studying the mean luminosity-weighted age,\nc 2002 RAS, MNRAS 000, 1–17\n\n13\n\neven if it is mixed with an older, more massive component.\nTherefore, although this hypothesis seems promising, it does\nnot explain all the properties found in this work.\n\n5.1.2\n\nA pseudobulge\n\nThe second possibility for the structure of NGC 357 is that\nthere is no inner disc. If this is the case, the central kinematical decoupling and the σ-drop have to be caused by the\nbulge itself, which therefore shows disc-like properties that\nindicate it is a pseudobulge rather than a classical one. This\nhypothesis is strongly supported by the Sérsic index (Sersic\n1968) measured for the bulge of NGC 357 by Aguerri et al.\n(2005); they performed a photometric decomposition of an\nI -band image and obtained n=1.40±0.08, which is compatible with a pseudobulge. Indeed, Fisher & Drory (2008)\nstudy a sample of 77 galaxies and find that ∼90% of pseudobulges have n<2, whereas classical bulges have n>2.\nWithin this new context, the σ-drop is not actually a\ndrop with respect to the higher velocity dispersion of the\nbulge, but the maximum velocity dispersion of the pseudobulge itself. Of course, the pseudobulge presents a not so\nhigh velocity dispersion, since it is rotationally supported,\nand therefore it can be colder than the inner bar. In this\ncase, the two peaks of the velocity dispersion values at either sides of the centre have to be understood as signatures\nof the relatively hotter inner bar where this component dominates the total luminosity. The σ-hollows appear where the\nbar ends and the light of the pseudobulge is the main contribution to the total flux. The surrounding structure, i.e., the\nouter bar, is also hotter than the outer parts of the pseudobulge and for that reason the velocity dispersion values\nincrease again beyond the σ-hollows. The characteristic velocity dispersions for each structure is indicated in Table 3.\nThis scenario is completely different from that of the galaxies shown in de Lorenzo-Cáceres et al. (2008). However, the\nmain conclusion on the origin of the σ-hollows remains as it\nis attributed to the contrast of velocity dispersions between\ncomponents.\nThis hypothesis also explains the results from the analysis of the morphology of NGC 357: the ellipticity profile\nacquires approximately the same value at either sides of\nthe peak due to the inner bar, suggesting that the centre\nand the surrounding regions are dominated by the same\nstructure. Concerning the dynamical support of the bulge,\nwe estimate Vmax /σ ∼0.23 and ǫ<0.1 in the bulge region;\ntherefore, the bulge is consistent with an oblate spheroid\nflattened by rotation (Kormendy & Kennicutt 2004). Nevertheless, the interpretration of the Vmax /σ − ǫ relation has\nto be done carefully, since a complex kinematical structure\nof the galaxy might conduct to misleading results, as it is\nshown in Emsellem et al. (2011).\n\n5.2\n\nFormation of NGC 357\n\nThe analysis of the stellar populations of NGC 357 is focused\non three single regions: bulge, inner bar and outer bar. The\nstriking result obtained in this work is that the bulge and inner bar show very similar stellar population properties, indicating that they were formed in the same process or, at least,\nfrom the same source of stars. Moreover, the outer bar is also\n\n\f14\n\nde Lorenzo-Cáceres et al.\n\nTable 3. Characteristic velocity dispersion values for the different structural components of NGC 357 within the context of the two\npossible scenarios. For the bulge and pseudobulge, these values represent their maximum velocity dispersion. For the outer bar and disc,\nthe mean velocity dispersion values within the corresponding regions included in Figure 3 are provided.\n\nσ\n(km s−1 )\n\nScenario\n\n(Pseudo)bulge\n\nInner disc\n\nInner bar\n\nOuter bar\n\nDisc\n\n(1)\n(2)\n\n>180\n∼170\n\n∼170\n-\n\n∼165\n∼180\n\n∼145\n∼145\n\n∼105\n∼105\n\n(1) Classical bulge + inner disc + inner bar + outer bar + disc;\n(2) Pseudobulge + inner bar + outer bar + disc.\n\nnearly coeval to the inner structures, although it presents a\nlower metallicity and a larger α-enhancement. This result\npoints towards a faster assembly of the outer bar with respect to the bulge and inner bar. Finally, we compare the\nbulge and outer bar of NGC 357 with other bulges and main\nbars of single- and double-barred galaxies with similar central σ values (Pérez et al. 2009; Pérez & Sánchez-Blázquez\n2011), finding no significant differences among them.\nThe results obtained here for NGC 357 indicate that\ntheories claiming that inner bars play a major role in the\nsecular evolution might not be suitable for this galaxy. If inner bars were key to transport gas to the central regions and\ntrigger star formation there, a gradient in age and metallicity\nfrom outer to inner structures would be expected, presenting a younger population in the galaxy centre. Although our\ngalaxy has gas content and probably some star formation is\ntaking place in it, the stellar population analysis indicates\nthat this is not the main mechanism driving the evolution\nof NGC 357. Therefore, these results lead to the question on\nhow NGC 357 formed.\nNumerical simulations have predicted different scenarios for the formation of nested bars systems, most\nof them requiring the presence of a dissipative component that is dynamically disturbed and generates the secondary bar (e.g., Friedli & Martinet 1993; Heller et al. 2001;\nShlosman & Heller 2002; Englmaier & Shlosman 2004).\nWithin this scenario, the inner bar should be younger than\nthe outer bar. However, the two bars of NGC 357 have\nsimilar population properties, so they were formed at the\nsame time or, most likely, the existing stars from the outer\nbar or the disc redistributed and shaped the inner structures. Therefore, only those numerical works that do not\nneed gas to generate the double-barred objects seem to be\ncompatible with the observational evidences shown here for\nNGC 357. This is the case of the N-body simulations by\nDebattista & Shen (2007), who use a disc and a rapidly rotating bulge (like a pseudobulge) to create a double-barred\nsystem. In these simulations, the inner bar appears first, but\nthis is probably a consequence of the initial presence of the\npseudobulge: in the real Universe, the outer bar most likely\nis formed first, so the pseudobulge would be generated from\nthe gas flow along it. This scenario reinforces the hypothesis\nof the pseudobulge for the case of NGC 357, since the bulge\nrotation is an essential condition for generating the two bars\nwithin the Debattista & Shen (2007) gas-free framework.\nThere is one possibility to reconcile the classical secular approach with the observational results for NGC 357,\nand this is to assume a very fast formation of the central\ncomponents: immediately after the outer bar was created,\n\nthe gas flowed along it, triggered a quick star formation and\nformed the inner bar and the bulge. Within this scenario,\nthe final ages of the three components would be very similar. The outer bar would be slightly older, but this is consistent with our results taking into account the error bars.\nIn this scenario a positive metallicity gradient for the gas\nalong the outer bar is required. Although this fact might\nbe somewhat striking, from a stellar (not gaseous) point of\nview there is evidence for such gradients. Indeed, Pérez et al.\n(2009) study a sample of 20 barred galaxies and find that\nsome of them tend to become more metal-rich at the ends of\nthe main bars. Moreover, those objects have older mean ages\nand higher central velocity dispersions than the rest of the\nsample, which is in agreement with the properties found for\nNGC 357. Unfortunately, the S/N ratio of our data is not\nenough to measure gradients along the main bar to check\nthis possibility.\n\n6\n\nCONCLUSIONS\n\nWe have performed for the first time a detailed analysis of\nthe morphological, kinematical, and stellar population properties of a prototype double-barred early-type disc galaxy.\nWe put special emphasis on the inner bar in order to constrain its role in the evolution of this galaxy. The observational strategy consisted in taking very deep long-slit spectra along the directions of the inner and outer bars and the\nmajor axis of the disc.\nThe presence of the two bars is clearly revealed by\nthe ellipticity and PA profiles, which show the usual\nsharp changes due to this kind of structure. Moreover,\nthe kinematical analysis also presents clear signatures due\nto the inner bar: the double-hump profile in the velocity\n(Emsellem et al. 2001) and the σ-hollows in the velocity dispersion (de Lorenzo-Cáceres et al. 2008). These hollows are\ndue to the contrast between the velocity dispersion values\nof the inner bar and the central structure, that might be\na classical bulge with a velocity dispersion higher than the\ninner bar, or a pseudobulge with a lower velocity dispersion\nthan the bar. The relative contribution of the inner bar to\nthe total flux also influences the size and depth of the σhollows. It remains unclear if the σ-hollows or other related\nfeatures may appear for the case of the outer bar. Unfortunately, the S/N of the main bar spectrum is not sufficient\nto explore the kinematics at its ends.\nThe analysis of the kinematics of NGC 357 also reveals\na kinematically-decoupled structure rotating faster than its\nsurroundings at the centre of the galaxy. This signature\nmatches in size with a central σ-drop. NGC 357 is the first\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\nobserved galaxy in which a σ-drop and the σ-hollows coexist.\nThis fact illustrates the differences between both signatures:\nwhereas the former are just due to the presence of the inner bar, the latter is caused by an inner, colder structure.\nDue to the different nature of both signatures, we want to\nstress that a double-barred galaxy might present a σ-drop,\nthe σ-hollows, or both, as in this case.\nThe structural composition of NGC 357 has to account\nfor all the observational evidences found in the analysis of\nthe photometry and kinematics. The presence of the disc and\nthe two bars is clear, but the central region turns out to be\nmore difficult to disentangle. In fact, two possible scenarios\nare compatible with the results obtained in this work. The\nfirst possibility is that NGC 357 hosts a classical, hot bulge\ntogether with an inner disc, which would be responsible of\nthe decoupling in the velocity profile and the σ-drop. The\nsecond scenario is that the bulge of NGC 357 is, in fact, a\ncold pseudobulge, which is directly related to the kinematical central signatures.\nThe main conclusion of this work is that the bulge\nand inner bar show similar stellar population properties\n(age, metallicity and α-enhancement), whereas the outer\nbar has no significant difference in age but it is less metalrich and more α-enhanced, indicating that it was assembled\nin shorter timescales than the inner structures. This result\nseems to discard for this galaxy the traditional secular evolution scenario, in which the star formation triggered by\nthe gas flown along the outer structures is causing the formation of the central parts. Therefore, NGC 357 has been\nshaped by the redistribution of the existing stars, maybe\nin a secular way in which stars from the disc form the inner components, or maybe in an initial disc + pseudobulge\nframework so the inner bar is lately formed from the pseudobulge stars. This last scenario is backed by the numerical\nwork of Debattista & Shen (2007), who create double-barred\nsystems from a pure stellar disc and pseudobulge. In this scenario, the fast rotation of the pseudobulge is the key element\nto generate bars without the gas contribution.\nAn analysis such as the one presented in this work for a\nlarger sample of double-barred galaxies is required to derive\ngeneral and robust conclusions on the formation of these\ncomplex objects. Fortunately, the striking results obtained\nfor NGC 357 are motivating and shed light on the importance of carefully studying double-barred galaxies, from the\nouter disc to the very central regions.\n\nACKNOWLEDGMENTS\nWe are indebted to Patricia Sánchez-Blázquez and Isabel Pérez for providing the line-strength measurements\nfor the reference barred galaxies. We are also very grateful to Jairo Méndez-Abreu, Jesús Falcón-Barroso, Inma\nMartı́nez-Valpuesta, Nacho Trujillo, Reynier Peletier and\nMina Koleva, whose help and useful comments have been\nvery important. Comments and suggestions from the anonymous referee have greatly improved this paper. This work\nhas been supported by the Programa Nacional de Astronomı́a y Astrofı́sica of the Spanish Ministry of Science and Innovation under grant AYA2010-21322-C03-02.\nEMC is supported by the University of Padua through\ngrants CPDA089220, 60A02-1283/10, and 60A02-5052/11\nc 2002 RAS, MNRAS 000, 1–17\n\n15\n\nand by the Italian Space Agency (ASI) through grant ASIINAF I/009/10/0. This work benefits from observations\nmade with the NASA/ESA Hubble Space Telescope, obtained from the Hubble Legaxy Archive, which is a collaboration between the Space Telescope Science Institute\n(STScI/NASA), the Space Telescope European Coordinating Facility (ST-ECF/ESA) and the Canadian Astronomy\nData Centre (CADC/NRC/CSA).\n\nREFERENCES\nAguerri, J. A. L., Elias-Rosa, N., Corsini, E. M., & MuñozTuñón, C. 2005, A&A, 434, 109\nAguerri, J. A. L., Méndez-Abreu, J., & Corsini, E. M. 2009,\nA&A, 495, 491\nBeifiori, A., Maraston, C., Thomas, D., & Johansson, J.\n2011, A&A, 531, A109\nBottema, R. 1989, A&A, 221, 236\nBureau, M., & Athanassoula, E. 2005, ApJ, 626, 159\nCameron, E., et al. 2010, MNRAS, 409, 346\nCappellari, M., & Emsellem, E. 2004, PASP, 116, 138\nCardiel, N. 1999, Ph.D. Thesis, Universidad Complutense\nde Madrid, Spain,\nCarretero, C., Vazdekis, A., Beckman, J. E., SánchezBlázquez, P., & Gorgas, J. 2004, ApJ, 609, L45\nCervantes, J. L., & Vazdekis, A. 2009, MNRAS, 392, 691\nChung, A., & Bureau, M. 2004, AJ, 127, 3192\nContopoulos, G., & Papayannopoulos, T. 1980, A&A, 92,\n33\nCorsini, E. M., Debattista, V. P., & Aguerri, J. A. L. 2003,\nApJ, 599, L29\nde Lorenzo-Cáceres, A., Falcón-Barroso, J., Vazdekis, A.,\n& Martı́nez-Valpuesta, I. 2008, ApJ, 684, L83\nde Vaucouleurs, G., de Vaucouleurs, A., Corwin, H. G.,\nJr., Buta, R. J., Paturel, G., & Fouque, P. 1991, Third\nReference Catalogue of Bright Galaxies, Springer-Verlag,\nBerlin\nDebattista, V. P., & Shen, J. 2007, ApJ, 654, L127\nElmegreen, B. G., Elmegreen, D. M., & Hirst, A. C. 2004,\nApJ, 612, 191\nEmsellem, E., Greusard, D., Combes, F., Friedli, D., Leon,\nS., Pécontal, E., & Wozniak, H. 2001, A&A, 368, 52\nEmsellem, E., Cappellari, M., Krajnović, D., et al. 2011,\nMNRAS, 414, 888\nEnglmaier, P., & Shlosman, I. 2004, ApJ, 617, L115\nErwin, P., & Sparke, L. S. 2002, AJ, 124, 65\nErwin, P. 2004, A&A, 415, 941\nEskridge, P. B., et al. 2000, AJ, 119, 536\nFalcón-Barroso, J., Balcells, M., Peletier, R. F., &\nVazdekis, A. 2003, A&A, 405, 455\nFalcón-Barroso, J., et al. 2006, MNRAS, 369, 529\nFalcón-Barroso, J., Sánchez-Blázquez, P., Vazdekis, A.,\nRicciardelli, E., Cardiel, N., Cenarro, A. J., Gorgas, J.,\n& Peletier, R. F. 2011, A&A, 532, A95\nFisher, D. B., & Drory, N. 2008, AJ, 136, 773\nFriedli, D., & Martinet, L. 1993, A&A, 277, 27\nGadotti, D. A., Athanassoula, E., Carrasco, L., Bosma, A.,\nde Souza, R. E., & Recillas, E. 2007, MNRAS, 381, 943\nGanda, K., Falcón-Barroso, J., Peletier, R. F., Cappellari,\nM., Emsellem, E., McDermid, R. M., de Zeeuw, P. T., &\nCarollo, C. M. 2006, MNRAS, 367, 46\n\n\f16\n\nde Lorenzo-Cáceres et al.\n\nGerhard, O. E. 1993, MNRAS, 265, 213\nGonzález, J. J. 1993, Ph.D. Thesis, University of California,\nSanta Cruz\nHeller, C., Shlosman, I., & Englmaier, P. 2001, ApJ, 553,\n661\nHeller, C. H., Shlosman, I., & Athanassoula, E. 2007, ApJ,\n657, L65\nJedrzejewski, R. I. 1987, MNRAS, 226, 747\nJogee, S., et al. 2004, ApJ, 615, L105\nJørgensen, I. 1999, MNRAS, 306, 607\nKnapen, J. H., Shlosman, I., Peletier, R. F. 2000, ApJ, 529,\n93\nKoleva, M., Prugniel, P., Bouchard, A., & Wu, Y. 2009,\nA&A, 501, 1269\nKormendy, J., & Kennicutt, R. C., Jr. 2004, ARA&A, 42,\n603\nKormendy, J., Fisher, D. B., Cornell, M. E., & Bender, R.\n2009, ApJS, 182, 216\nKuntschner, H. 2000, MNRAS, 315, 184\nLaine, S., Shlosman, I., Knapen, J. H., & Peletier, R. F.\n2002, ApJ, 567, 97\nLaurikainen, E., Salo, H., & Rautiainen, P. 2002, MNRAS,\n331, 880\nLisker, T., Debattista, V. P., Ferreras, I., & Erwin, P. 2006,\nMNRAS, 370, 477\nMaciejewski, W., & Sparke, L. S. 1997, ApJ, 484, L117\nMaciejewski, W., & Sparke, L. S. 2000, MNRAS, 313, 745\nMarinova, I., & Jogee, S. 2007, ApJ, 659, 1176\nMárquez, I., Masegosa, J., Durret, F., González Delgado,\nR. M., Moles, M., Maza, J., Pérez, E., & Roth, M. 2003,\nA&A, 409, 459\nMenéndez-Delmestre, K., Sheth, K., Schinnerer, E., Jarrett, T. H., & Scoville, N. Z. 2007, ApJ, 657, 790\nMoiseev, A. V. 2001, Bull. Special Astrophys. Obs., 51, 140\nMoiseev, A. V., Valdés, J. R., & Chavushyan, V. H. 2004,\nA&A, 421, 433\nMorelli, L., Cesetti, M., Corsini, E. M., et al. 2010, A&A,\n518, A32\nOsterbrock, D. E., Fulbright, J. P., Martel, A. R., Keane,\nM. J., Trager, S. C., & Basri, G. 1996, PASP, 108, 277\nPérez, I., Sánchez-Blázquez, P., & Zurita, A. 2007, A&A,\n465, L9\nPérez, I., Sánchez-Blázquez, P., & Zurita, A. 2009, A&A,\n495, 775\nPérez, I., & Sánchez-Blázquez, P. 2011, A&A, 529, A64\nRautiainen, P., Salo, H., & Laurikainen, E. 2002, MNRAS,\n337, 1233\nSánchez-Blázquez, P., et al. 2006, MNRAS, 371, 703\nSánchez-Blázquez, P., Ocvirk, P., Gibson, B. K., Pérez, I.,\n& Peletier, R. F. 2011, MNRAS, 415, 709\nSarzi, M., et al. 2006, MNRAS, 366, 1151\nSandage, A., & Tammann, G. A. 1981, The Revised\nShapley-Ames Catalog of Bright Galaxies, Carnegie Institution, Washington\nSérsic, J. L., Atlas de galaxias australes, Observatorio Astronomico, Cordoba\nSheth, K., et al. 2008, ApJ, 675, 1141\nShlosman, I., Frank, J., & Begelman, M. C. 1989, Nature,\n338, 45\nShlosman, I., Begelman, M. C., & Frank, J. 1990, Nature,\n345, 679\nShlosman, I., & Heller, C. H. 2002, ApJ, 565, 921\n\nTonry, J., & Davis, M. 1979, AJ, 84, 1511\nTrager, S. C., Worthey, G., Faber, S. M., Burstein, D., &\nGonzalez, J. J. 1998, ApJS, 116, 1\nTrager, S. C., Faber, S. M., Worthey, G., & González, J. J.\n2000, AJ, 120, 165\nvan den Bergh, S. 2002, AJ, 124, 782\nvan der Marel, R. P., & Franx, M. 1993, ApJ, 407, 525\nVazdekis, A., Peletier, R. F., Beckman, J. E., & Casuso, E.\n1997, ApJS, 111, 203\nVazdekis, A. 1999, ApJ, 513, 224\nVazdekis, A., & Arimoto, N. 1999, ApJ, 525, 144\nVazdekis, A., Kuntschner, H., Davies, R. L., Arimoto, N.,\nNakamura, O., & Peletier, R. 2001, ApJ, 551, L127\nVazdekis, A., Trujillo, I., & Yamada, Y. 2004, ApJ, 601,\nL33\nVazdekis, A., Sánchez-Blázquez, P., Falcón-Barroso, J., Cenarro, A. J., Beasley, M. A., Cardiel, N., Gorgas, J., &\nPeletier, R. F. 2010, MNRAS, 404, 1639\nWegner, G., et al. 2003, AJ, 126, 2268\nWozniak, H., Friedli, D., Martinet, L., Martin, P., &\nBratschi, P. 1995, A&AS, 111, 115\nWozniak, H., Combes, F., Emsellem, E., & Friedli, D. 2003,\nA&A, 409, 469\nWozniak, H., & Champavert, N. 2006, MNRAS, 369, 853\nYamada, Y., Arimoto, N., Vazdekis, A., & Peletier, R. F.\n2006, ApJ, 637, 200\nYork, D. G., et al. 2000, AJ, 120, 1579\n\nAPPENDIX A: THE NEWLY DEFINED\nFE4383SR INDEX\nFor the inner and outer bars of NGC 357 we only have blue\nspectra, from 3990 to 4440 Å. There is only one Iron index in\nthe Lick system within this range, at 4383 Å. Unfortunately,\nthe red pseudo-continuum of this Lick Fe4383 index falls partially out of our blue spectra, so we have redefined it in order\nto introduce a new Fe4383SR index suitable for our spectral\nrange requirements. Fe4383SR is named after Short Red (due\nto its motivation) and keeps the blue pseudo-continuum of\nthe Lick Fe4383 index, but modifies the range definitions\nfor the main bandpass and the red pseudo-continuum (see\nTable 2). This new index has been tested with the bulge\nof NGC 357, for which we have data in two spectral ranges\nso we can measure additional Iron indices. Figure A1 shows\nseveral age indicators plotted against Fe4383SR and hFei.\nThe corresponding measurements for the bulge of NGC 357\nare overplotted. The age and metallicity obtained from the\ntwo Iron index definitions are consistent. We therefore use\nFe4383SR for estimating the metallicity in our blue spectra.\n\nAPPENDIX B: S/N CONSTRAINTS FOR THE\nCROSS-CORRELATION METHOD\nAs explained in Section 4.3.3, we explored the requirements\nof the cross-correlation method through several tests with\nthe Vazdekis et al. (2010) model library, by changing their\nspectral resolution, spectral range and S/N ratio. We found\nthat the S/N of the outer bar spectrum is not sufficient to\ndisentangle its age and metallicity. This fact is illustrated in\nc 2002 RAS, MNRAS 000, 1–17\n\n\fPhotometry, kinematics and stellar populations in NGC 357\n\n17\n\nFigure B1. Same as Figure 7 for a model of 8 Gyr and solar\nmetallicity from the Vazdekis et al. (2010) model library, once\nmodified to match the spectral resolution, range, dispersion and\nS/N ratio of the data for the outer bar of NGC 357.\n\nFigure A1. Comparison of the results obtained for the bulge\nof NGC 357 using as metallicity indicators the newly defined\nFe4383SR and the hFei indices. The model grids are the same\nas in Figure 5.\n\nFigure B1, where we show the results from aplying the crosscorrelation method to a model of 8 Gyr and solar metallicity,\nonce cut and smoothed to mimic the observed spectrum for\nthe outer bar. We also added gaussian noise to the model to\nmatch the S/N ratio of the data. The error regions are so\nlarge that, for ages above ∼3 Gyr the results for the solar\nand supersolar metallicity are completely mixed.\n\nc 2002 RAS, MNRAS 000, 1–17\n\n\f"}