{"id": "http://arxiv.org/abs/1004.0176v1", "guidislink": true, "updated": "2010-04-01T16:28:10Z", "updated_parsed": [2010, 4, 1, 16, 28, 10, 3, 91, 0], "published": "2010-04-01T16:28:10Z", "published_parsed": [2010, 4, 1, 16, 28, 10, 3, 91, 0], "title": "Lectures on walking technicolor, holography and gauge/gravity dualities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3995%2C1004.0914%2C1004.4418%2C1004.0546%2C1004.1095%2C1004.3906%2C1004.2374%2C1004.0436%2C1004.4174%2C1004.2982%2C1004.3834%2C1004.3465%2C1004.3373%2C1004.5273%2C1004.2360%2C1004.0601%2C1004.4403%2C1004.2171%2C1004.2683%2C1004.1474%2C1004.2913%2C1004.1162%2C1004.1029%2C1004.1158%2C1004.4557%2C1004.2561%2C1004.0308%2C1004.3350%2C1004.1849%2C1004.2743%2C1004.2595%2C1004.3829%2C1004.5218%2C1004.1783%2C1004.1767%2C1004.0581%2C1004.0176%2C1004.4219%2C1004.4136%2C1004.2100%2C1004.1606%2C1004.5049%2C1004.0158%2C1004.2321%2C1004.0253%2C1004.2507%2C1004.3541%2C1004.1409%2C1004.4530%2C1004.4664%2C1004.4162%2C1004.2304%2C1004.4037%2C1004.5387%2C1004.3445%2C1004.4331%2C1004.2005%2C1004.3617%2C1004.2946%2C1004.3097%2C1004.0756%2C1004.1177%2C1004.4368%2C1004.2578%2C1004.1337%2C1004.4147%2C1004.3395%2C1004.0895%2C1004.2735%2C1004.5302%2C1004.2055%2C1004.3874%2C1004.1570%2C1004.0103%2C1004.1097%2C1004.4656%2C1004.5140%2C1004.5494%2C1004.0722%2C1004.5318%2C1004.5533%2C1004.3497%2C1004.2887%2C1004.0843%2C1004.0015%2C1004.5442%2C1004.1091%2C1004.1719%2C1004.5325%2C1004.1403%2C1004.2072%2C1004.3090%2C1004.1771%2C1004.3276%2C1004.3054%2C1004.0833%2C1004.4095%2C1004.1083%2C1004.1128%2C1004.2751%2C1004.1873&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Lectures on walking technicolor, holography and gauge/gravity dualities"}, "summary": "Dynamical electro-weak symmetry breaking is an appealing, strongly-coupled\nalternative to the weakly-coupled models based on an elementary scalar field\ndeveloping a vacuum expectation value. In the first two sections of this set of\nlectures, I summarize the arguments, based on low-energy phenomenology,\nsupporting walking technicolor as a realistic realization of this idea. This\npedagogical introduction to walking technicolor, and more generally to the\nphysics of extensions of the standard model, makes extensive use of effective\nfield theory arguments, symmetries and counting rules. The strongly-coupled\nnature of the underlying interactions, and the peculiar quasi-conformal\nbehavior of the theory, require to use non-perturbative methods in order to\naddress many fundamental questions within this framework. The recent\ndevelopment of gauge/gravity dualities provides an ideal set of such\nnon-perturbative instruments. The remaining two sections illustrate the\npotential of these techniques with two technical examples, one within the\nbottom-up phenomenological approach to holography in five-dimensions, the other\nwithin a more systematic top-down construction derived from ten-dimensional\ntype-IIB supergravity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3995%2C1004.0914%2C1004.4418%2C1004.0546%2C1004.1095%2C1004.3906%2C1004.2374%2C1004.0436%2C1004.4174%2C1004.2982%2C1004.3834%2C1004.3465%2C1004.3373%2C1004.5273%2C1004.2360%2C1004.0601%2C1004.4403%2C1004.2171%2C1004.2683%2C1004.1474%2C1004.2913%2C1004.1162%2C1004.1029%2C1004.1158%2C1004.4557%2C1004.2561%2C1004.0308%2C1004.3350%2C1004.1849%2C1004.2743%2C1004.2595%2C1004.3829%2C1004.5218%2C1004.1783%2C1004.1767%2C1004.0581%2C1004.0176%2C1004.4219%2C1004.4136%2C1004.2100%2C1004.1606%2C1004.5049%2C1004.0158%2C1004.2321%2C1004.0253%2C1004.2507%2C1004.3541%2C1004.1409%2C1004.4530%2C1004.4664%2C1004.4162%2C1004.2304%2C1004.4037%2C1004.5387%2C1004.3445%2C1004.4331%2C1004.2005%2C1004.3617%2C1004.2946%2C1004.3097%2C1004.0756%2C1004.1177%2C1004.4368%2C1004.2578%2C1004.1337%2C1004.4147%2C1004.3395%2C1004.0895%2C1004.2735%2C1004.5302%2C1004.2055%2C1004.3874%2C1004.1570%2C1004.0103%2C1004.1097%2C1004.4656%2C1004.5140%2C1004.5494%2C1004.0722%2C1004.5318%2C1004.5533%2C1004.3497%2C1004.2887%2C1004.0843%2C1004.0015%2C1004.5442%2C1004.1091%2C1004.1719%2C1004.5325%2C1004.1403%2C1004.2072%2C1004.3090%2C1004.1771%2C1004.3276%2C1004.3054%2C1004.0833%2C1004.4095%2C1004.1083%2C1004.1128%2C1004.2751%2C1004.1873&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamical electro-weak symmetry breaking is an appealing, strongly-coupled\nalternative to the weakly-coupled models based on an elementary scalar field\ndeveloping a vacuum expectation value. In the first two sections of this set of\nlectures, I summarize the arguments, based on low-energy phenomenology,\nsupporting walking technicolor as a realistic realization of this idea. This\npedagogical introduction to walking technicolor, and more generally to the\nphysics of extensions of the standard model, makes extensive use of effective\nfield theory arguments, symmetries and counting rules. The strongly-coupled\nnature of the underlying interactions, and the peculiar quasi-conformal\nbehavior of the theory, require to use non-perturbative methods in order to\naddress many fundamental questions within this framework. The recent\ndevelopment of gauge/gravity dualities provides an ideal set of such\nnon-perturbative instruments. The remaining two sections illustrate the\npotential of these techniques with two technical examples, one within the\nbottom-up phenomenological approach to holography in five-dimensions, the other\nwithin a more systematic top-down construction derived from ten-dimensional\ntype-IIB supergravity."}, "authors": ["Maurizio Piai"], "author_detail": {"name": "Maurizio Piai"}, "author": "Maurizio Piai", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1155/2010/464302", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.0176v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.0176v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "67 pages, 16 figures.", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.0176v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.0176v1", "journal_reference": "Adv.High Energy Phys.2010:464302,2010", "doi": "10.1155/2010/464302", "fulltext": "Lectures on walking technicolor, holography and gauge/gravity dualities.\nMaurizio Piai1\n\narXiv:1004.0176v1 [hep-ph] 1 Apr 2010\n\n1\n\nSwansea University, Physics Department, Singleton Park, Swansea, SA2 8PP, Wales, UK\n\nDynamical Electro-weak symmetry breaking is an appealing, strongly-coupled alternative to the\nweakly-coupled models based on an elementary scalar field developing a vacuum expectation value.\nIn the first two sections of this set of lectures, I summarize the arguments, based on low-energy phenomenology, supporting walking technicolor as a realistic realization of this idea. This pedagogical\nintroduction to walking technicolor, and more generally to the physics of extensions of the standard\nmodel, makes extensive use of effective field theory arguments, symmetries and counting rules. The\nstrongly-coupled nature of the underlying interactions, and the peculiar quasi-conformal behavior of\nthe theory, requires to use non-perturbative methods in order to address many fundamental questions within this framework. The recent development of gauge/gravity dualities provides an ideal set\nof such non-perturbative instruments. The remaining two sections illustrate the potential of these\ntechniques with two technical examples, one within the bottom-up phenomenological approach to\nholography in five-dimensions, the other within a more systematic top-down construction derived\nfrom ten-dimensional type-IIB supergravity.\nPACS numbers: 11.25.Tq, 12.60.Nz.\n\nContents\n\nIntroduction and outline\nI. Electro-weak symmetry breaking, within and beyond the standard model.\nA. The Minimal Standard Model vs. Technicolor.\nB. Naturalness, Hierarchy Problem(s) and their proposed solutions.\n1. Little hierarchy problem.\n2. Final remarks\nII. From weak to strong coupling: walking technicolor.\nA. Electro-weak chiral Lagrangian and oblique precision parameters.\n1. Perturbative estimates of Ŝ and T̂ .\n2. Non-perturbative estimates of Ŝ: NDA and hidden local symmetry.\nB. Fermion masses and FCNC constraints.\n1. The GIM mechanism.\n2. Froggat-Nielsen and see-saw mechanisms.\n3. Extended Technicolor, tumbling and walking.\nC. Perturbative unitarity.\nD. About the spectrum of WTC.\n1. Techni-rho mesons.\n2. Technipion, composite Higgses and Little Higgses.\n3. Techni-dilaton.\nE. Summary: questions on walking TC.\n\n3\n5\n5\n7\n10\n11\n13\n14\n18\n19\n22\n23\n24\n25\n27\n30\n31\n32\n34\n35\n\nIII. Holographic technicolor: bottom-up approach.\nA. Holography and AdS/TC: a simple model.\n1. The Model.\n2. Electro-weak Phenomenology.\n3. LHC phenomenology\nB. Final Remarks.\n\n37\n37\n37\n38\n40\n43\n\nIV. Holographic technicolor: top-down approach.\nA. Why a full string-theory model?\n1. From N = 4 towards walking technicolor.\nB. Wrapped-D5 system.\n\n44\n44\n44\n46\n\n\f2\n\nC.\nD.\nE.\nF.\n\n1. Gauge coupling\n2. Regular Maldacena-Nunez. Asymptotic behaviors.\n3. Walking solutions in class II.\n4. Walking solutions in class I.\nRelation to other systems.\nGlueball spectrum.\nWilson loops.\n1. General treatment\n2. The D5 on S 2 system.\nSummary.\n\nConclusions.\nA. Van der Waals gas.\n\n47\n48\n49\n50\n52\n54\n56\n57\n58\n61\n63\n64\n\nAcknowledgments\n\n64\n\nReferences\n\n65\n\n\f3\nIntroduction and outline\n\nThis set of notes on walking technicolor is based in part on sets of lectures delivered to string theory students in the\ncontext of their Ph. D. programs at Swansea University and at the University of Barcelona. As such, the content is\nintended for readers who are familiar with the ideas of gauge/gravity dualities [1], but not with technicolor (TC) [2],\nwalking technicolor (WTC) [3], extended technicolor (ETC) [4] and more in general with the details of the physics of\nthe standard model (SM) and the problematics arising when dealing with its extensions.\nThis is not a complete and exhaustive review of the subject of technicolor, which can be found elsewhere, but\nrather a collection of exercises and arguments aimed at singling out a subset of problems that emerge in the context\nof physics beyond the standard model (BSM), and that are particularly important when, as is the case for WTC,\nthe BSM new physics is strongly coupled. This set of problems admits a natural formulation (if not yet a natural\nsolution) in the context of gauge/gravity dualities, which is the main message these lectures want to convey. The\nreader who wants to have a complete overview of the subject of strongly-coupled dynamical electro-weak symmetry\nbreaking (EWSB) should complement the reading of these notes with other reviews, which develop in more details\nmany aspects and ideas that are only glanced at in the present set of lectures [5].\nThe first two parts of these notes are very general, and should be easily accessible to anybody who has a working\nknowledge of quantum field theory and a basic knowledge of the standard model. For pedagogical reasons, before\ntalking about WTC, I start by reminding the reader about some classical results that are at the core of our modern\nunderstanding of the Minimal version of the Standard Model (MSM) 1 , and of its weakly-coupled extensions. These\ninclude the Coleman-Weinberg results for the loop generated effective Higgs potential [6], a discussion of the big\nand little hierarchy problems, the definition of the electro-weak chiral Lagrangian [7] and of the oblique precision\nparameters [8, 9] (and their use in precision electro-weak physics), the GIM mechanism and the resulting suppression\nof flavor-changing neutral current (FCNC) processes [10], the Froggatt-Nielsen mechanism for the generation of fermion\nmass hierarchy [11], the see-saw mechanism [12], and the analysis of perturbative unitarity of longitudinally-polarized\ngauge-boson elastic-scattering amplitudes [13]. As such, this first half of the material should also provide a useful\nintroduction for any reader who is interested in BSM physics in general.\nThe first section of the paper contains some generic introductory material, and part of the discussion is only\nsemi-quantitative (more precise statements will be developed in later sections). It starts from a reminder about the\nbasic building blocks of the SM, the introduction of the concept of naturalness, and a discussion of the big hierarchy\nproblem. I also provide an example of technicolor model, for pedagogical reasons chosen to be peculiarly simple [16].\nUnconventionally, in comparing three popular scenarios for solving the big hierarchy problem (supersymmetry, technicolor and warped extra-dimensions), rather than the specific differences I highlight the similarities between these\nthree approaches. In particular the fact that at low-energies they all yield to the little hierarchy problem. In this\nway, it should be clear to the reader that the tension between the absence of fine-tuning (for which a new physics\nscale Λ∗1 <\n∼ 1 TeV would be a natural expectation), and the absence of indirect effects of new physics in precision\nmeasurements (which would naturally require a larger new physics scale Λ∗2 >\n∼ 5 TeV), is a rather general problem of\nall BSM scenarios, not just a problem of strongly-coupled extensions of the SM. After all, the very fact that, thanks\nto the work of our colleagues in many successful experimental programs, we have now an unprecedented body of\nhigh-precision information about nature, per se implies that not every generic new physics model can be allowed by\nthe data. Hence the presence of what appears to be a O(Λ∗1 2 /Λ∗2 2 ) ∼ 5% fine-tuning in the low-energy effective\nLagrangian extending the SM is not necessarily a surprising and bad thing, but rather seems to suggest to us that\nsomething very special is going to be discovered at the LHC, hence explaining this very special low-energy results.\nWhat singles out the strongly coupled scenarios as particularly problematic is the strong coupling itself, which severely\nlimits the possibility of exploring the parameter-space of models, in the search of regions that are compatible with\nthe current data, in the same way as is done in the weakly-coupled context, and hence explaining the origin of the\naforementioned 5% tuning in terms of specific, special detail properties of the new physics.\nThe second section contains a more systematic and precise pedagogical discussion, and, besides a preliminary\nintroduction of the idea of walking dynamics, consists of four main subsections. In the first subsection, precision\nelectro-weak physics is discussed, starting from the effective field theory (EFT) treatment, introducing the oblique\nparameters, and summarizing some classical perturbative results. In comparing to strongly-coupled scenarios, I\nintroduce the rules of naive dimensional analysis (NDA) [14], and hidden local symmetry (HLS) [15]. The second\nsubsection is devoted to the physics of flavor. Starting again from the weakly coupled case, the GIM mechanism is\n\n1\n\nI will use the MSM acronym to mean the version of the standard model with one Higgs scalar doublet, ultimately responsible for EWSB,\nin such a way as to distinguish it from the acronym SM, by which I mean a generic theory with the fermions and gauge bosons of the\nStandard Model, without committing to the details of the symmetry-breaking sector itself.\n\n\f4\nintroduced, and the basic logic behind the construction of weakly-coupled models of flavor generation explained. ETC\nand WTC are then introduced and their specific physical implications are explained, and contrasted with what happens\nin the weakly-coupled case. I do not discuss CP violation, the treatment of which to large extent follows the same logic\nas the physics of FCNC, up to subtleties in dealing with dipole moments that, while important phenomenologically,\nare not very important for the present purposes. The third subsection is a brief reminder about a classical result\nin the MSM: the scattering amplitude of longitudinally polarized gauge bosons is shown to be manifestly unitary\nin perturbation theory, at the diagrammatic level, provided all the couplings (including the Higgs self-coupling) are\nperturbative. This is obviously not the case in TC, where showing explicitly that the scattering amplitudes never\ngrow beyond the unitarity bounds would require a full non-perturbative analysis: many ideas have been proposed\naddressing this problem, which is actively studied, but a definite answer does not exist, and hence I will limit the\ndiscussion to the well-understood perturbative case. In the fourth subsection I summarize, by means of examples,\na few very general expectations about the spectrum of TC, focusing on those bound states (techni-pions, technirhos and techni-dilaton) the physics of which is controlled by strong symmetry arguments. I conclude with a brief\nsubsection containing a wish list, to some extent personal and incomplete. This is a list of specific questions about\nstrongly-coupled EWSB, all of which emerge from the previous discussion, all of which have crucial phenomenological\nimplications, and answering to any of which requires a very high level of understanding of non-perturbative physics.\nGauge/gravity dualities represent a remarkable opportunity for addressing some of these questions in a new context,\nwhich is complementary to what is known from traditional techniques.\nThe second half of this paper contains a set of examples of applications of the ideas and techniques derived from\nthe context of gauge/gravity dualities, in order to address some of the questions in the wish list. This is not done\nsystematically, rather I explain in some details two very special such applications, one in the context of effective\nfive-dimensional theories (bottom-up approach), and one in the context of ten-dimensional supergravity and string\ntheory (top-down approach). This may be understood as a proof of principle, showing that indeed some of the\nquestions in the wish list can be addressed within specific holographic models, and, furthermost, that the technology\nnecessary for this type of studies to be carried out does exist and is well understood. It must be stressed that many\nmore examples exist in the literature, that are not even mentioned in these lectures. Since the early papers on the\nAdS/CFT correspondence [1] and by Randall and Sundrum [17], a huge body of literature on these and related\nsubjects appeared, reviewing which goes very far beyond the aims of these lecture notes.\nThe third section is devoted to one specific five-dimensional effective theory that most resembles what might be the\ndual of a four-dimensional walking technicolor theory [18, 19]. I show how calculability is strongly improved within this\napproach, in respect to what happens in four-dimensional EFT and HLS approaches, yielding useful phenomenological\ncorrelations between observable quantities such as the oblique precision parameters and the spectrum and couplings\nof techni-rho mesons. I also show that some fundamental questions cannot be answered within this approach, but\nrequire more information about the underlying dynamical properties of the models.\nIn the fourth section, a more ambitious approach is discussed [20–22]. The proposal is to study the properties\nof walking dynamics in isolation, separating them from the specific embedding of walking into a detailed model of\nelectro-weak symmetry breaking and fermion mass generation. This is done by constructing a 10-dimensional stringtheory model such that, in the supergravity limit, walking, or some feature that resembles it, emerges dynamically,\nand for which the technology exists allowing to perform a set of calculations that can yield a quantitative answer to\nsome of the questions about walking dynamics that are left open by bottom-up approaches. This is a rather novel\nresearch program, and hence only few such calculations exist. I will limit myself to one specific model, which has its\nown advantages and disadvantages. A few other possible models and other interesting calculations are suggested, but\nthe main aim of this section is to encourage the reader to use his own experience, knowledge and creativity to devise\nalternative scenarios, and use them to address some of the problems listed earlier on.\n\n\f5\n\nBμ\nWμ\nμ\nG\n\u0012 \u0013\nu\nqL =\nd L\nuR\nd\u0012R \u0013\nν\nlL =\ne L\neR\nνR\nH\n\nJ\n1\n1\n1\n\nSU (3) SU (2)L U (1)Y\n1\n1\n0\n1\n3\n0\n8\n1\n0\n1/6\n\nN\n1\n1\n1\n\n1/2\n\n3\n\n2\n\n3\n\n1/2\n1/2\n\n3\n3\n\n1\n1\n\n2/3 3\n−1/3 3\n\n1/2\n\n1\n\n2\n\n−1/2 3\n\n1/2\n1/2\n0\n\n1\n1\n1\n\n1\n1\n2\n\n−1 3\n0\n3?\n+1/2 1\n\nTABLE I: Field content of the Minimal Standard Model. All the fermions are represented by a Left-Handed or a Right-Handed\nchiral field, with different quantum numbers. Specified is also the number N of different species having the same quantum\nnumbers. The 3 copies of fermions are referred to in the text as families. The neutrino singlet νR is a hypothetical particle,\nsuch as is the Higgs H.\n\nI.\n\nELECTRO-WEAK SYMMETRY BREAKING, WITHIN AND BEYOND THE STANDARD MODEL.\nA.\n\nThe Minimal Standard Model vs. Technicolor.\n\nThe standard model (SM) is a quantum field theory in which weak, strong and electromagnetic interactions are\ndescribed by a gauge theory with group GSM = SU (3)c × SU (2)L × U (1)Y . All the known fundamental matter\nparticles are described by (chiral) fermions transforming in some representation of GSM (see table I). If the gauge\nsymmetry were unbroken, all of the resulting particles would be massless. However, the electro-weak gauge symmetry\nis spontaneously broken as SU (2)L × U (1)Y → U (1)e.m., by some condensate that provides a non-trivial structure\nfor the vacuum of the theory. The unbroken U (1)e.m. is the gauge symmetry of electromagnetism. Hence all the\nfermions, together with the W and Z bosons, acquire a mass, proportional to the symmetry-breaking condensate.\nThe proportionality constant is the coupling of the field to the condensate, and depends on the specific field. All of\nthis is well established, and can be found nowadays even in popular science books.\nIt is also known that none of the SM fermions, nor any of the SM gauge interactions, are responsible for electroweak symmetry breaking itself 2 . Some new fields and new interactions must be present, in order to implement in\nthe theory a mechanism yielding spontaneous electro-weak symmetry breaking. Identifying these new fields and,\nequally important, new interactions is the main goal of large hadron collider (LHC) program at CERN. In the case\nof the minimal version of the standard model (MSM), the sector responsible for electro-weak symmetry breaking is\nconstituted by one scalar field, transforming as (1, 2, 1/2) under GSM . This is assumed to have a weakly coupled\ndescription in terms of a scalar potential with a negative quadratic interaction and a quartic interaction, the latter\nbeing the only free parameter to be measured at LHC. The classical minimum of the potential is non-trivial, the Higgs\nfield acquires a vacuum expectation value (VEV) and hence yields electro-weak symmetry breaking. The complete\nLagrangian of the MSM contains five types of terms, which depend on the fields and on their covariant derivatives. We\nwill discuss in more detail some of these terms later on, for the time being it suffices to write them out schematically\n(suppressing all the indexes).\n• Gauge-boson Lagrangian\n1\nL1 = − Tr Fμν F μν + * * * .\n2\n\n(1)\n\n/ ψ + *** .\nL1/2 = ψ̄ iD\n\n(2)\n\n• Fermion kinetic terms\n\n2\n\nThe chiral condensate of QCD does, in fact, spontaneously break the SM gauge symmetry. But the scale fπ is so small that this fact\ncan be ignored for most phenomenological purposes.\n\n\f6\n• Scalar kinetic term\n†\n\nL0 = (Dμ H) Dμ H .\n\n(3)\n\nLy = −y ψ ̄L H ψR + * * * .\n\n(4)\n\n• Yukawa couplings\n\n• Scalar potential\nLV = −V = −μ2 H † H − λ H † H\n\n\u00012\n\n.\n\n(5)\n\nThe MSM is a very successful model. It agrees to very high accuracy with a number of precision electro-weak tests,\ncarried on in particular at SLAC, LEP, and TeVatron. It also successfully reproduces most of the flavor physics studied\nexperimentally in rare processes involving B-mesons, kaons, pions, muons. One important reason for this success is\nthat the MSM automatically implements the GIM mechanism, so that all sources of flavor changing processes and of\nCP-violation are encoded in the CKM matrix, hence naturally suppressing flavor changing neutral current (FCNC)\nprocesses. It is also a remarkably satisfactory model from a theoretical point of view, in the sense that it automatically\nyields results that are very non-trivial. For example, thanks to the cancellation of all gauge anomalies, and to the\nperturbative nature of all the couplings, including the Higgs potential, it is possible to show that unitarity of certain\nscattering amplitudes is manifest at the diagrammatic level up to very high scales.\nYet, there is no experimental evidence supporting the idea that symmetry breaking be due to the weakly-coupled\nHiggs sector of the MSM, with LEP and TeVatron yielding exclusion regions and bounds on the mass, but no\nunambiguous positive discovery signal. It is hence important to consider alternatives. In particular, there is no real\nreason why the sector responsible for electro-weak symmetry be weakly coupled. Actually, it is a remarkable fact\nthat in the two most celebrated examples of spontaneous symmetry breaking (the theory of superconductors, and the\ndescription of chiral symmetry breaking in QCD) the condensate does not arise from an elementary scalar developing\na VEV, but rather a strong interaction produces the formation of a composite condensate.\nBesides this simple fact, a set of serious reasons for concern arises when studying the UV behavior of the Higgs\nsector itself. The Higgs potential does not satisfy the naturalness condition: switching off any of the couplings in the\nHiggs potential does not result in enhancing the symmetry of the system. We will discuss this in more details later.\nAs a result, both the quadratic and quartic operator receive additive renormalization from (divergent) loop diagrams\ninvolving all the couplings of the model. In a sense, the dynamics encoded in the potential is not fundamental, and\nas a result it is affected by fine-tuning problems. Finally, the beta-function of the quartic coupling of the Higgs and\nof the Yukawa couplings is not asymptotically free (which is related to the triviality problem). All of this suggests\nthat the Higgs sector might provide a very good description of low-energy physics, but needs to be UV completed.\nTechnicolor models are a radical alternative to the Higgs of the MSM. There is no weakly-coupled scalar, but rather\na completely new non-abelian gauge interaction is assumed to be present, morally analog to QCD. At low-energies\n(of the order of the electro-weak scale), the interaction becomes strong enough to trigger confinement and chiral\nsymmetry breaking, via the formation of a condensate of fermions. As a simple example, consider for instance a\nSU (NT ) gauge theory, in which fermions QL , UR , DR , lL , ER and NR with the same quantum numbers as a family\nof SM fermions transform on the fundamental of SU (NT ) 3 . At the electro-weak scale, condensates form:\n3\nhQ̄L UR i = hD̄R QL i = hĒR LL i = hL̄L NR i ∼ O(4πvW\n).\n\n(6)\n\nThis condensate breaks electro-weak symmetry in exactly the same way as the Higgs of the MSM, because each of\nthe bi-linears entering the condensates has the same quantum numbers as H.\nThe properties of models of this type are the opposite of those of the MSM Higgs sector. All the couplings are\nnatural, there is no fine-tuning nor triviality problem, all the scales are generated dynamically and naturally stabilized.\nHowever, calculability (and hence predictivity) becomes problematic, because of the strong coupling. Back-of-theenvolope estimates based on naive dimensional analysis (NDA) suggest that it is difficult to reconcile these models\n\n3\n\nHere and in several other points of these first two sections I chose to refer to this specific model mainly for its striking simplicity and\nelegance. The reader however should not be mislead into thinking that this is always what a TC model has to look like, but should\nsimply think of TC as a strongly-coupled theory in which a dynamically generated condensate induces EWSB. For example, lots of\nattention has been given in recent years to small-NT models with techni-quarks in 2-index representations of the gauge group [23],\nrather than on the fundamental representation, and nothing prevents from much more exotic scenarios to be considered.\n\n\f7\nwith electro-weak precision measurements. Unitarity of scattering amplitudes is not manifest at the diagrammatic\nlevel, but relies on uncalculable contributions from the strong dynamics. And, contrary to what happens in the MSM,\nthe generation of the mass of the SM fermions cannot proceed via marginal (Yukawa) couplings, but requires the\nintroduction of a whole new sector of interactions, via what is referred to as extended technicolor (ETC). As a result,\nthere is reason of concern regarding the contribution of this new ETC sector to FCNC processes, because an analog\nto the GIM mechanism is not automatically present.\nOne very plausible way to alleviate the shortcomings of technicolor, while preserving its good features, is provided\nby walking technicolor. The basic idea is that if the new strongly coupled theory is not some variation of QCD, but\nrather it has a very different dynamics, such that it be strongly coupled over a large range of energies above the\nelectro-weak scale, then large anomalous dimensions are likely to be generated non-perturbatively. If so, the counting\nrules of NDA do not hold, and large enough masses for the SM fermions (the top quark is particularly problematic)\nmight be generated dynamically, without necessarily running into troubles with precision electro-weak parameters\nand FCNC processes. The dynamical justification for this scenario is the assumption that an approximate fixed point\ngoverns the physics in the IR, just above the electro-weak scale, hence slowing down the running of the couplings in\nthe strongly-coupled regime, whence the name walking. While this adds to the calculability problems of traditional\napproaches to technicolor, it also provides an ideal arena in which the techniques of the gauge/string duality can be\napplied. Indeed, in the walking regime the theory is very strongly coupled, and approximately conformal.\nB.\n\nNaturalness, Hierarchy Problem(s) and their proposed solutions.\n\nAll known interactions can be reduced, at the microscopic level, to three fundamental ones: electro-weak, strong\nand gravitational interactions. The strength of these interactions can be characterized in terms of a typical scale, that\ncan be identified, respectively, with three dimensionful coupling constants:\n1\nvw ≡ p√\n≃ 246 GeV ,\n2GF\nfπ ≃ 93 MeV ,\n1\n≃ 1.22 × 1019 GeV ,\nMP ≡ √\nGN\n\n(7)\n(8)\n(9)\n\nwhere GF is the Fermi constant, fπ is the pion decay constant, and GN the Newton constant.\nAt present, the SM does not incorporate a universally accepted theory of quantum gravity. However, it is conceivable\nthat if such a formulation exists, the SM should be thought of as containing the leading-order terms a low-energy\neffective field theory (EFT) description of all fundamental interactions. In this spirit, quantum gravity should amount\nto two main effects (at low-energies): the renormalization of the SM Lagrangian LSM itself, and the generation\nof higher-order corrections, encoded in higher-dimensional operators to be added to LSM . Both effects would be\ncontrolled by the typical scale of gravitational interactions MP . Here is one way of seeing the emergence of a technical\nproblem, the big hierarchy problem. On the one hand, the fact that\n2\nvw\n/MP2 ≃ 10−34\n\n(10)\n\njustifies phenomenologically the fact that higher-order terms can be safely neglected, because strongly suppressed.\nOn the other hand, the very fact that these two scales be so far apart, in a context in which quantum corrections are\npresent, needs to be explained. In the absence of such an explanation, one would expect either that the electro-weak\nscale and the Planck scale should be of the same order of magnitude, vw ∼ MP , or that their hierarchy is due to\naccidental cancellations between interactions of very different nature, coming from physics taking place above and\nbelow the Planck scale, hence requiring an implausible amount of fine-tuning.\nThis formulation of the big hierarchy problem shows explicitly that it has a very general origin. The only explicit\nassumptions used in order to highlight the problem itself being the existence of a quantum theory of gravity (or more\ngeneral of any new interaction beyond the SM), and of a sensible low-energy EFT description, characterized by the\nPlanck scale MP (or by a new physics scale Λ ≫ vW ). There is another hidden assumption in all of the above: that\nthe space-time symmetries be described by the four-dimensional Lorentz (or Poincaré) group. A vast literature exists\non possible solutions to the big hierarchy problem, that propose to modify the fundamental theory is very different\nways. It is remarkable that the three main classes of such solutions (based upon supersymmetry, extra-dimension and\ntechnicolor, respectively) all rely on the idea of extending the group of space-time symmetries.\nThe reason why this is a good idea has to do with the relation between the concept of naturalness and renormalization\nin a general field theory. Using a definition often attributed to 't Hooft:\n\n\f8\na coupling is natural if, in the limit in which it vanishes, the theory has an enlarged symmetry.\nIn field theory, quantum corrections renormalize the bare Lagrangian in two possible ways: some couplings renormalize\nmultiplicatively, while others renormalize additively (due to operator mixing).\nCouplings that are not natural may in general renormalize additively. Hence, they may be affected by fine-tuning\nproblems. Setting to a very small value a parameter that is renormalized additively does not ensure that quantum\ncorrections will preserve its smallness. A simple illustration of this is given within the MSM by the Higgs potential V\nin Eq. (5), with neither μ2 nor λ being natural parameter 4 . As a consequence, nothing prevents them from receiving\nadditive renormalization. A way to compute the (divergent) part of the (perturbative) 1-loop correction makes use\nof the results from Coleman and Weinberg [6] for the quantum effective action:\n\u0012\n\u0012 2 \u0013\u0013\nΛ2\n1\nM\n2\n4\nδV =\n,\n(11)\nST r M +\nST r M ln\n32π 2\n64π 2\nΛ2\nwhere Λ is the UV cut-off, M2 is the mass matrix of all fields as a function of the classical external scalar fields, and\nST r is the supertrace, a trace in which fermion and boson degrees of freedom enter with opposite signs. For instance,\nin the MSM the coefficient μ2 of the quadratic operator receives, among others, (quadratically divergent) positive\ncontributions from loops of gauge bosons and negative from loops of the top:\nδμ2 ≃ cg g 2 Λ2 − cy yt2 Λ2 + * * * ,\n\n(12)\n\nwith cg and ct numerical coefficients with mild 1-loop suppressions, g the gauge coupling and yt the top Yukawa\ncoupling. If the cut-off is at the Planck scale Λ ∼ MP , in order for the resulting quadratic coupling to be at the\nelectroweak scale, a very fine-tuned cancellation would be needed between this loop correction and an appropriately\nchosen counter-term.\nConversely, a natural coupling (barring the possibility of anomalies) renormalizes multiplicatively: in the limit in\nwhich the coupling is set to zero, the theory has an extended symmetry, that must be preserved also by quantum\ncorrections. The fact that quantum corrections are themselves proportional to the natural coupling ensures that this\nsymmetry property be automatically satisfied. As such, if one could find a way to render natural the parameter\nin the Lagrangian setting the electro-weak scale, this would not receive dangerously large additive renormalization\nvia Eq. (11), and the coexistence of the widely separated electro-weak scale vW and Planck scale MP would not\nrequire fine-tuning, making the EFT useful and predictive. This is what is done in the most popular extensions of\nthe standard model.\nA most popular class of solutions proposes to enlarge the symmetry by incorporating some form of supersymmetry, i. e. by effectively adding fermionic directions to the space-time (superspace formulation), and assuming that\nperturbation theory be a good tool up to the Planck scale. The standard example is the Minimal Supersymmetric\nStandard Model (MSSM) [24]. The basic idea is to enlarge the spectrum by adding a super-partner with different spin\nand statistics to each of the MSM fields, and to adjust the couplings so that the new Lagrangian is supersymmetric.\nDetails about the construction require to introduce two Higgs doublets instead of one. The technical way in which\nsupersymmetry solves the hierarchy problem is that, when computing quantum corrections to the relevant operator\ncontrolling the electro-weak scale, loops involving bosons and fermions in the same supersymmetry multiplets cancel\nagainst each other. In other words, in a N = 1 supersymmetric theory in a generic vacuum (and under a few rather\nsoft conditions such as the absence of mixed gauge-gravity anomalies)\nST r M2 = 0 .\n\n(13)\n\nAs a result, the quadratically divergent corrections to the supersymmetric generalization of Eq. (5) drop, in favor of\na milder logarithmic divergence. In the MSSM, supersymmetry is broken explicitly, by adding to the supersymmetric\nLagrangian a restricted set of mass terms and couplings the effect of which are soft: they preserve the logarithmic dependence of the divergence on the cut-off scale. Interestingly, because the Higgs potential, in the supersymmetric limit,\ndoes not admit an electro-weak symmetry breaking minimum, the latter is controlled by the scale of supersymmetry\nbreaking itself Λ∗ , hence linking electro-weak scale and supersymmetry-breaking scale.\n\n4\n\nIt should be noticed that setting μ2 = 0 would render the MSM Lagrangian scale-invariant at the classical level. However, such invariance\nis not preserved by quantum correction, due to diagrams involving the quartic, gauge and Yukawa couplings, and even allowing for\nfine-tuning in the quadratically divergent part of quantum corrections one ends up with the appearance of a scale in the 1-loop generated\nHiggs potential, which ultimately might lead to electro-weak symmetry breaking itself [6].\n\n\f9\nA second class of solutions to the big hierarchy problem involves the introduction of space-like extra-dimensions.\nThere is a vast number of variations on this idea. One most appealing such realization is the Randall-Sundrum\nscenario [17], possibly assisted by some implementation of the Goldberger-Wise mechanism [25]. The basic idea is to\nintroduce a fifth dimension z, and assume that the space-time has the geometry of a slice of AdS space\nds2 =\n\n\u0001\nL2\nημν dxμ dxν − dz 2 ,\n2\nz\n\n(14)\n\nwith L the curvature scale, and with two 4-dimensional boundaries so that L0 < z < L1 . The radial direction is\nrelated to the scale of the 4-dimensional theory living on a probe localized at z, with z → L0 corresponding to the\nUV and z → L1 corresponding to the IR. While the 4-dimensional Planck scale MP is related to the five-dimensional\nfundamental scale M5 as\nMP2 ≃\n\nM53 L3\n,\nL20\n\n(15)\n\nand one chooses (up to O(1) factors) L0 ∼ L ∼ 1/M5 ∼ 1/MP , the typical scale of the physics taking place in the IR\nis suppressed as\nΛ∗ 2 ∼\n\nL20 2\nM .\nL21 P\n\n(16)\n\nIn the Goldberger-Wise mechanism, the hierarchy between the position of the two boundaries is determined dynamically to be\nL0\n∝\nL1\n\n\u0012\n\nv1\nv0\n\n\u00131/ǫ\n\n,\n\n(17)\n\nwhere v0,1 = O(MP ) are the boundary values of some dynamical bulk scalar, and ǫ is a natural parameter, related\nto the coefficient of the only relevant coupling of the five-dimensional scalar (i. e. its five-dimensional mass). If the\nphysics of electro-weak symmetry breaking is to take place near the IR boundary, its scale is going to be exponentially\nsuppressed in respect to the Planck scale, hence solving the big hierarchy problem, provided a modest hierarchy (for\ninstance v1 /v0 ∼ 1/10) is chosen, together with a large value of the exponent (for instance ǫ ∼ 1/20). For discussions\nabout the holographic interpretation of this picture see also [26].\nA simple way of introducing the idea behind the third class of solutions to the hierarchy problem (technicolor) is\nto go back to QCD, observing that in what we said up to now, we never mentioned a strong-interaction fine-tuning\nproblem related to the fact that fπ ≪ MP . For a good reason: there is no such a problem! The Lagrangian of a\nQCD-like theory with Nf massless fermions transforming on the fundamental representation of SU (Nc ) is\n1\n/ ,\nL = − Tr F 2 + iψ̄Dψ\n2\n\n(18)\n\nDψ = ∂ψ − igAψ .\n\n(19)\n\nwhere the covariant derivative is\n\nThe beta-function computed at 1-loop is\nβ(g) = −\n\ng3\n(4π)2\n\n\u0012\n\n11\n2\nNc − Nf\n3\n3\n\n\u0013\n\n=−\n\ng3\nb0 ,\n(4π)2\n\n(20)\n\nand accordingly\ng 2 (μ) =\n\ng2\n1+\n\nμ2\n(4π)2 b0 ln Λ2\ng2\n\n,\n\n(21)\n\nwhere μ is the renormalization scale, and g is defined at some reference scale Λ. The expression for g 2 (μ) diverges for\nμ2 = Λ∗ 2 defined by\n2\n\nΛ∗ 2 ≡ Λ2 e\n\n− (4π)\ng2 b\n\n0\n\n.\n\n(22)\n\n\f10\nIf Λ ∼ MP , and for choices of Nc and Nf such that b0 ∼ O(1), this means that Λ∗ defined in this way is exponentially\nsuppressed, provided the theory be asymptotically free, and the coupling g measured at the scale Λ be perturbatively\nsmall. Because Λ∗ is the scale at which the theory becomes strongly coupled, then one has fπ ∼ O(Λ∗ ) ≪ MP .\nThe symmetry principle behind the mechanism that makes fπ small compared to the Planck scale can be read from\nEq. (18). At the classical level, this Lagrangian is scale invariant, because all the operators are exactly marginal.\nQuantum effects break conformal invariance, the gauge coupling representing a marginally relevant deformation of the\nmassless free theory living at the UV fixed-point. However, the breaking is controlled by the coupling itself: setting\nthe coupling g (as defined at a given scale Λ) to very tiny values, implies that Λ∗ /Λ → 0, because in the g = 0 limit the\ntheory reduces back to a trivial conformal theory of non-interacting, massless gluons and quarks. Again, a space-time\nsymmetry is present, broken only by a natural parameter (the gauge coupling) which renormalizes multiplicatively\n(all renormalizations of the gauge coupling are proportional to the gauge coupling itself). As a result, no fine-tuning\nis needed in order to parametrically separate the scale of the strong dynamics from the Planck scale.\nThe basic mechanism behind technicolor is the same: it relies on removing the Higgs sector from the MSM, and\nreplacing it with a new strong sector with a new gauge symmetry (technicolor) acting on new degrees of freedom\n(techni-fermions). The electro-weak gauge group is defined by gauging a subgroup of the global symmetry of such\nfermions (techni-flavor). Once the theory becomes strongly coupled at scale Λ∗ , a chiral condensate will form dynamically, generating vW and spontaneously breaking the electroweak symmetry, in analogy to what happens in QCD.\nAppropriately choosing the new gauge coupling, it is possible to arrange for Λ∗ ≪ MP , without any fine-tuning,\nbecause in the g → 0 limit one recovers a conformal theory, with space-time symmetry described by SO(4, 2).\nSummarizing, the three examples discussed share the same basic idea of enlarging the space-time symmetry. While\nthe way in which this is done is very different, it yields very similar results, turning the dangerous quadratic divergences\nrelating the electro-weak and Planck scales into logarithms, and linking the electro-weak scale to a new scale Λ∗\ncharacterizing the breaking of the enlarged space-time symmetry itself. Namely, below Λ∗ , supersymmetry is lost,\nthe theory is four-dimensional, and scale-invariance is lost, respectively, in the three cases. Provided Λ∗ <\n∼ 1 TeV,\nno fine-tuning is present in the electro-weak symmetry breaking sector. The scale Λ∗ is also the scale at and above\nwhich a new physics sector (fields and interactions) appears. It controls the masses of the superpartners of the SM\nfields, the masses of the KK modes coming from the compact extra-dimension, and the masses of the resonances\nand composite states in technicolor (technimesons, technibaryons . . . ). But Λ∗ also controls indirect contributions to\nlow-energy precision physics, which we will discuss at length in these lectures.\n1.\n\nLittle hierarchy problem.\n\nWhichever your favorite solution to the big hierarchy problem is, provided it is based on the idea of enlarging the\nspace-time symmetries as in the three cases discussed earlier, the net result is that there are now four physical scales,\ncharacterizing four distinct interactions: fπ , vW , MP and Λ∗ . The more the two scales vW and Λ∗ are close to each\nother, the more satisfactory is the solution to the hierarchy problem.\nBelow Λ∗ , the process of integrating out all of the sector responsible for the breaking of the enlarged symmetry\n(and for the arising of Λ∗ itself) means that corrections to the low-energy description of electro-weak and strong\ninteractions will be induced, controlled by Λ∗ . In other words, the EFT whose leading order terms are given by the\nstandard model will have corrections suppressed by inverse powers of Λ∗ , besides those suppressed by the Planck\nscale MP . These corrections are tightly bounded experimentally. The precision electro-weak tests can be summarized\nin the precision parameters of the electro-weak chiral Lagrangian (or equivalently in the oblique parameters such as\nS andT ), and they indicate that the physics of the electro-weak gauge bosons can receive correction coming from\nhigher-dimensional operators that are at most at the per mille level. Naively, this suggests that Λ∗ >\n∼ 5 TeV. The\nphysics of flavor changing neutral currents, tested in great details by studying rare processes involving kaons, B\nmesons, charmed mesons, pions and charged leptons, also indicates that, unless Λ∗ has nothing to do with flavor, Λ∗\nmust be large.\nIn the specific case of the MSSM, analogous source of tension can be shown to have a more subtle origin. Some of the\nscalars from the Higgs multiplets complete, in the supersymmetric limit, the heavy vector multiplets containing the\ngauge bosons and the gauginos. In this limit the mass of such scalars is closely linked to the mass of the electro-weak\ngauge bosons. In particular, for the mass of the lightest Higgs scalar in the MSSM the bound m2h < MZ2 holds in\ncomplete generality at the tree-level 5 . Loop effects involving (finite) diagrams affected by supersymmetry breaking\n\n5\n\nTechnically, this originates from the fact that the quartic couplings in the Higgs potential are not free parameters, but actual gauge\ncouplings derived from the D-terms within the supersymmetric gauge theory.\n\n\f11\npartially remove this bound, and one can show for example that the corrections to the physical mass of the lightest\nscalar particle in the spectrum, very schematically look like [27]\n2\nδm2h ≃ ch vW\nln\n\nΛ∗ 2\n2 ,\nvW\n\n(23)\n\nwhere ch is again 1-loop suppressed. Because ch is perturbatively small (loop-suppressed), evading the experimental\n∗\nbounds from direct searches mh >\n∼ 114 GeV requires, again, that Λ should be somewhere in the few-TeV range (or\nat least the mass of one of the scalar partners of the top should). The logarithmic dependence also means that if the\nlower bound on the Higgs mass raises, evading it would require a very significant amount of fine-tuning.\nConcluding, solving the big hierarchy problem requires linking the electro-weak scale to a new scale Λ∗ which is kept\nnaturally smaller than the Planck scale, and at which some new enlarged space-time symmetry be broken. Absence\n∗ >\nof any fine-tuning would be achieved if Λ∗ <\n∼ 1 TeV. However, indirect searches strongly suggest that Λ ∼ 5 TeV,\nboth in weakly and strongly coupled scenarios, substantially above the scale dictated by vW . This tension goes under\nthe name of little hierarchy problem. There are several ways of addressing the little hierarchy problem, which may\nrequire the introduction of entirely new fields and symmetries (such as in the case of composite Higgs [28] models and\nLittle Higgs models [29]), hence again naturally separating vW ≪ Λ∗ . Or one might modify the solution to the big\nhierarchy problem in such a way as to implement some discrete symmetry, in such a way as to enforce cancellations\nand suppressing unwanted processes. The literature on the subject is vast, and these proposals are very interesting\nphenomenologically, both for the LHC and for astrophysics and cosmology (for examples, models with parities might\nplay an important role in the physics of cold dark matter), but are not the subject of these lectures.\nIt must be stressed that numerically the little hierarchy problem is, indeed, little. In a generic low-energy theory it\namounts to a fine-tuning at most O(1 TeV2 /(5 TeV)2 ) ∼ 5%. The arguments presented here are strongly affected by\nmodel-dependent coefficients that in this discussion have been taken to be O(1), but that in special models might just\noccur to be small enough to evade the experimental bounds. Particularly in the case of technicolor, which naively is\nthe one example in which the little hierarchy problem is most worrisome, the strongly coupled nature of the theory\nat the Λ∗ scale makes the calculation of such coefficients quite delicate. Accurate and efficient ways of computing\nsuch observables are needed. Part of these lectures will be devoted to this specific topic, in the context of walking\ntechnicolor (which itself involves the introduction of a very special symmetry), and we will see that this possibility\nis not excluded. While doing so, the arguments presented in this short subsection will be made more rigorous and\nquantitative, and concrete examples will be developed.\n2.\n\nFinal remarks\n\nBefore we move away from these general introductory remarks, and start studying more concrete examples and\nperform more specific calculations, a final set of comments are due to the reader. First of all, one might argue\nthat hierarchy problems as defined in the previous section are not severe failures of the theory that require its\ncomplete rewriting: they do not indicate a fatal contradiction between theory and experiment. After all, once properly\nrenormalized, the MSM and its parameters can be used to reproduce correctly a vast amount of experimental data,\nwith no clear indication of a contradiction (barring the fact the the Higgs particle has not been observed yet, and\nhence might not exist in nature, which is a different problem). In general, the emergence of a hierarchy problem can\nbe looked at as the emergence of an opportunity for research. A fine-tuned parameter is an indication given to us by\nnature of a possible avenue for discovery of actually new, interesting physical phenomena, by highlighting a sector of\nthe theory which we do not really understand at the fundamental level, and which is probably incomplete. It would\nbe regrettable not to pursue this avenue. This is one reason why so much attention is paid by model-builders to\nthe hierarchy problems. Besides the electro-weak hierarchy problem(s) summarized here, similar attitude is applied\ntowards other hierarchy (fine-tuning) problems, such as the strong-CP problem in QCD, and, most important, the\nproblem of the cosmological constant.\nSecond, it must be stressed that the smallness of a parameter does not necessarily constitute a hierarchy problem. At\nleast, not in the sense of naturalness used here. For instance, one might legitimately ask why there exists such a large\nhierarchy between the numerical values of the masses of the SM fermions, comparing for instance the neutrinos to the\nelectron, and to the top quark. However, all of these masses are controlled by parameters that are natural, and hence\ntheir values are stable against radiative corrections, without the technical problem of fine-tuning. It would certainly\nbe very interesting and useful to have a theory of flavor, in which these masses and their hierarchical structures\nare generated dynamically from first principles, and a vast literature exists on the subject, with beautiful and very\ninteresting results having been collected over the years. Yet, the argument in favor of such a research program is\nsomewhat less compelling, at least within weakly-coupled theories. However, this kind of research program becomes\n\n\f12\ncompelling in strongly-coupled extensions of the standard model, for reasons that will be explained later in these\nnotes.\nFinally, the ultimate reason why fine-tuned theories are unsatisfactory is deeply connected with the concept of\neffective field theory. All progress in physics up to recent times can be thought of in terms of a chain of EFTs, and the\nvast majority of physical phenomena that we believe we understand are actually understood in terms of their EFT\ndescription. EFTs, as opposed to would-be fundamental theories, are constructed on the basis of very few and simple\ngeneral symmetry rules. These rules cannot, by themselves, single out a Lagrangian (or Action) which contains only a\nfinite number of local interactions. In general, an EFT contains an infinite number of such interactions, and an infinite\nnumber of free parameters. In the absence of anything else, these theories cannot be calculable and predictive, because\nno matter how many independent experimental quantities are measured and used as input, no unique prediction can\nbe formulated. What makes EFTs work (and they do in real situations), is that one can implement in the EFT\nalso counting rules, ensuring that within the regime of validity of the EFT, and requiring a given accuracy from the\ncalculations to be performed, only a finite number of such parameters are actually important. The (infinite) others\nare, on the basis of the counting rules, expected to give contributions that, while uncalculable, are safely smaller than\nthe required accuracy. Hence, the EFT Lagrangian can be truncated to contain only a finite number of terms.\nThe problem comes from the fact that the counting rules do not yield actual predictions for the values of the\n(unknown) parameters, but provide only order-of-magnitude estimates. Such estimates are hence useful only provided\nno fine-tuning turns out to be necessary. In the case where one of the parameters that are kept in the truncated\nEFT turns out to be severely fine-tuned, such a parameter is explicitly violating the counting rules. It becomes hence\nimpossible to justify the truncation itself, and predictivity is lost. Hence, the hierarchy problem(s) in the standard\nmodel highlight a contradiction in the procedure that would allow to use it as (the leading order part of) an EFT\ndescription. The history of successes of EFTs itself provides a very compelling reason to look for solutions to the\nhierarchy problem, beyond the SM.\n\n\f13\nII.\n\nFROM WEAK TO STRONG COUPLING: WALKING TECHNICOLOR.\n\nWe have already anticipated that technicolor provides a solution to the big hierarchy problem based on the same\nmechanism at work in QCD, namely at the Planck scale the theory is very close to a trivial fixed point of the\nrenormalization group equations. The coupling of a marginally relevant operator (the gauge coupling) drives the\ntheory away from this fixed point towards the IR. The theory becomes strongly coupled at a scale Λ∗ . An exponential\nhierarchy Λ∗ ≪ MP is natural, because controlled by the (perturbative) value of the gauge coupling in the UV.\nFinally, the strong coupling triggers the formation of a condensate that induces EWSB, hence linking Λ∗ and vW .\nWe also anticipated that the phenomenological viability of such a scenario is heavily questioned by the fact that the\nlittle hierarchy problem is exacerbated by the strong coupling at the scale Λ∗ , particularly in a QCD-like theory, and\nthat walking technicolor is one proposal that might soften such a problem. Let us be more specific.\nWalking technicolor is based on a gauge theory in which the running of the gauge coupling is completely different\nfrom what expected in a QCD-like theory. Fig. 1 illustrates the basic idea. On the left panel is the QCD-like running\nas obtained for instance from Eq. (21). One dynamical scale Λ0 = Λ∗ exists, identified by the divergence of the running\ncoupling g 2 Nc /(8π 2 ). The middle panel of Fig. 1 presents a theory that in the IR flows to a non-trivial fixed point.\nAgain, one dynamical scale exists Λ∗ , separating the two energy regimes at which the theory is well approximated\nby the UV and IR fixed points, respectively. There exists two well-established examples of such behavior. One can\nbe seen to exist by looking at the 2-loop perturbative β-function of a SU (Nc ) theory with Nf vectorial fermions on\nthe fundamental representation [30]. If Nf is very close to the limit beyond which asymptotic freedom is lost, the\nβ-function is suppressed by anomalously small coefficients. One then finds that a fixed point exists in the IR, and\nthat provided this is perturbative (so that neglecting higher-loop contributions is justified) the theory flows into a\nweakly-coupled non-abelian Coulomb phase.\nAnother example emerges for the supersymmetric version of the same gauge theory, in which case the beta function\nis [31]\n!\ng3\n3Nc − Nf − Nf γ(g 2 )\nβ(g) = −\n,\n(24)\n2\n16π 2\n1 − Nc g 2\n8π\n\nwhere the anomalous dimension of the mass is\nγ(g 2 ) =\n\ng 2 Nc2 − 1\n.\n8π 2 Nc\n\n(25)\n\nAgain, when Nf is very close to 3Nc , a fixed point in the spirit of [30] exists. However, because of supersymmetry the\ntheory possesses a Seiberg duality [32], which in turns means that such a fixed point exists in the whole conformal\nwindow\n3\nNc < Nf < 3Nc .\n2\n\n(26)\n\nThe interesting fact is that towards the lower end of the conformal window, the fixed point is strongly coupled. Again\nthanks to supersymmetry, one can compute the anomalous dimension γ at the fixed point:\nγ = −1 +\n\n3Nc\n,\nNf\n\n(27)\n\nwhich agrees with the intuition by vanishing when Nf → 3Nc , but towards the other boundary of the conformal\nwindow yields\nlim\n\nNf →3Nc /2\n\nγ = 1,\n\n(28)\n\nwith the dimension of the (super-)quark bilinear d(Q̃Q) = 2 − γ changing continuously in the range 1 < d(Q̃Q) < 2\nas a function of Nf , by assuming values that are O(1) and hence completely non-perturbative.\nThe dynamics of a walking theory is a combination of these confining and conformal theories. In the IR, below\nthe scale Λ∗ , the theory is approaching an approximate fixed point, governed by a strongly-coupled conformal field\ntheory, described by operators that have large anomalous dimensions. The fixed point is approximate in the sense\nthat some dynamical feature prevents the theory from actually reaching such a fixed point. Deep into the IR, the\ntheory actually confines and yields a symmetry breaking condensate at the electroweak scale vW . The gauge coupling\nevolves as in the right panel of Fig. 1, in a way that is somewhat an hybrid of the previous two cases.\n\n\f14\ng 2 Nc\n8π 2\n\ng 2 Nc\n8π 2\n\ng 2 Nc\n8π 2\n\nΛ0\n\nμ\n\nΛ∗\n\nμ\n\nΛ0 ΛIR\n\nΛ∗\n\nμ\n\nFIG. 1: Schematic depiction of the evolution of the gauge coupling as a function of the renormalization scale in three different\nasymptotically free theories: a QCD-like theory, a theory with an IR fixed point, and a walking theory (left to right).\n\nNotice that in the walking case there are at least three dynamical scales. A scale Λ∗ analogous to the conformal case,\nat which the theory enters a quasi-conformal phase, a scale Λ0 deep in the IR in which the gauge coupling diverges\nin the same sense as in the QCD-like case. And an additional intermediate scale ΛIR , at which the theory stops\nwalking, and enters the fast running leading ultimately to confinement at Λ0 . The word walking refers to the fact that\nthe coupling is approximately constant in the region ΛIR < μ < Λ∗ , where the beta function is parametrically small\nin comparison to the coupling itself. Somewhere between the two lower scales (which might coincide) the symmetry\nbreaking scale vW should be dynamically generated too.\nA second feature, of utmost phenomenological relevance, is that because the physics in the walking region is governed\nby the strongly-coupled approximate IR fixed-point, its operators acquire in general very large, non-perturbative\nanomalous dimensions, which drastically change the power-counting rules expected from NDA and implemented in\nthe low-energy effective description of electro-weak physics in the standard model.\nIn principle, one would like to a have a non-perturbative, non-supersymmetric theory with the properties mentioned\nabove. We have no rigorous proof that such a thing exists, but it is usually believed that some critical Nfc exists\nabove which the theory flows into an IR fixed point, and below which it confines and condensates form. A walking\ntheory is supposed to be given by the limit in which Nf is close to this critical value. In this lecture we will be more\nprecise about the phenomenological implications of the previous statements, and discuss what are the challenges of\nthis proposal, in direct comparison with what happens in perturbative theories such as the MSM.\nA.\n\nElectro-weak chiral Lagrangian and oblique precision parameters.\n\nA convenient way of parameterizing the low-energy effects of the strongly-coupled sector responsible for electro-weak\nsymmetry breaking is provided by the electro-weak chiral Lagrangian [7]. The basic idea is that at very low energy\nthe only relevant degrees of freedom are given by the Goldstone bosons and the electro-weak gauge bosons 6 . An\neffective description is then obtained by writing (infinite numbers of) possible local interactions involving pions and\ngauge bosons, compatibly with the symmetries of the problem, and organizing the expansion as a powers-series.\nOne can think of the resulting effective action as a systematic approximation of the quantum effective action that\nwould be obtained by integrating out all the heavy degrees of freedom in the theory (techni-mesons, techni-baryons,\ntechni-glueballs . . . ). In principle, this is a non-local function of the momentum q 2 . Provided q 2 is much smaller than\na scale Λ∗ 2 related to the lightest among the masses of all the degrees of freedom that are integrated out, one can\nexpand in powers of q 2 /Λ∗ 2 , and truncate at a given order in the expansion. The truncation reduces the number of\nindependent couplings to be finite. At the same time, the truncation determines the level of accuracy of the results\nof calculations of physical observables, which is itself controlled by a power of q 2 /Λ∗ 2 .\nThe electro-weak chiral Lagrangian [7] is defined from the two-sites model in Fig. 2. One defines a SU (2)L ×SU (2)R\nglobal symmetry, gauges the SU (2)L ×U (1)Y subgroup, with U (1)Y generated by T 3 , and introduces the dimensionless\nS = e\n\n2iπ\nf\n\n,\n\n(29)\n\nwith π = π a T a , T a = τ a /2 and τ a the Pauli matrices, so that S transforms as a bi-fundamental under SU (2)L ×\nSU (2)R . The decay constant is the electro-weak VEV, f = vW . The pion fields π a are the Goldstone bosons of the\n\n6\n\nIn these lectures, it is assumed that the SM fermions do not carry quantum numbers of the technicolor sector, and are essentially treated\nas spectators.\n\n\f15\n\nSU (2)L\n\nS\n\nSU (2)L\n\nSU (2)R\n\nU (1)Y\n\nFIG. 2: Diagram of the 2-site model, the electro-weak chiral Lagrangian.\n\nspontaneous breaking SU (2)L × SU (2)R → SU (2)V . In unitary gauge S = 1, and the pions become the longitudinal\ncomponents of the electro-weak gauge bosons. The covariant derivative is\nDS = ∂S + i (gW S − g ′ SB) ,\n\n(30)\n\nwith W = W a T a the weakly-coupled gauge bosons of SU (2)L , B = B 3 T 3 the gauge boson associated with the\ndiagonal U (1)Y ⊂ SU (2)R , and g and g ′ the (weak) gauge couplings. In terms of the field strength Wμν and Bμν , of\nthe covariant derivative Dμ S, of the SM currents JW,B (which contain the SM fermions) and of the custodial-symmetry\nbreaking operator t = ST 3 S † , the Lagrangian reads\nLχ = LJ + Lg + L2,0 + L2,2 + L4,0 + L4,1 + L4,2 + L4,4 * * *\n\n(31)\n\nwhere\nLJ = +2g Tr W JW − 2g ′ Tr B JB ,\n1\n1\nLg = − Tr Wμν W μν − Tr Bμν B μν ,\n2\n2\nf2\nTr |DS|2 ,\nL2,0 =\n4\nL2,2 = α0 g 2 f 2 [Tr (tDμ SS † )]2 ,\n′\n\n†\n\n(32)\n\nμν\n\nL4,0 = α1 gg Tr SBμν S W\n\u0002\n\u0003\u0001\n+ iα2 g ′ Tr Bμν S † Dμ S , S † Dν S\n\u0003\u0001\n\u0002\n+ iα3 g Tr Wμν Dμ SS † , Dν SS †\n\u0001\n\u0001\n+α4 Tr Dμ SS † Dν SS † Tr Dμ SS † Dν SS †\n\u00012\n+ α5 Tr Dμ SS † Dμ SS † .\n\nL4,1 = 2α11 gǫμνρλ T r(tVμ )T r(Vν Wρλ ) ,\n\u0001\nL4,2 = 4α6 Tr Dμ SS † Dν SS † Tr (tDμ SS † )Tr (tDν SS † )\n\u0001\n+4α7 Tr Dμ SS † Dμ SS † Tr (tDν SS † )Tr (tDν SS † )\n+α8 g 2 [Tr (tWμν )]2\n\n\u0003\u0001\n\u0002\n+2iα9 Tr (tWμν )Tr t Dμ SS † , Dν SS † ,\n\nL4,4 = 8α10 [Tr (tDμ SS † )Tr (tDν SS † )]2 .\n\nThe notation introduced here is somewhat unconventional, and demands for an explanation. In the terms Li,j , the\nindex i indicates the dimension of the operators, obtained by counting [S] = [E]0 , [∂] = [D] = [E]1 and [Wμν ] =\n[Bμν ] = [E]2 . The index j counts the explicit appearances of t, the operator introducing explicit breaking of custodial\nsymmetry. In practice, there are three expansions being performed, and used in classifying corrections beyond L2,0 .\nOne is the aforementioned expansion in derivatives (q 2 /Λ∗ 2 ≪ 1). But there is also an expansion in a custodialsymmetry breaking parameter δ/Λ∗ , implicit within the definition of many of the αi . And finally we are making use\nof the perturbative expansion in g 2 /(4π 2 ), g ′ 2 /(4π 2 ) ≪ 1. The way in which the Lagrangian is written is such that\nthe small parameters are all implicit in the definition of the coefficients αi , which are hence expected to be small.\nIn order to understand the origin of all these couplings, and how the counting works, let us start by assuming that\n\n\f16\ncustodial symmetry be exact. The only terms surviving in this limit are the ones in L2,0 and L4,0 7 . One could start\nfrom L2,0 alone. The fact that the symmetry is non-linearly realized is reflected in the fact that S contains only\nthe three degrees of freedom of the pion (the constraint SS † = 1 is applied). Expanding in powers of π/f , at the\nleading-order one gets the (canonically normalized) kinetic terms for the pions, while the next-to-leading order yields\na (derivative) quartic coupling proportional to 1/f 2\nL2,0 = Tr (∂π)2 +\n\n1\nTr [π, ∂π][π, ∂π] + * * * ,\n3f 2\n\n(33)\n\nwhich, for instance, yields the leading-order contribution to the ππ → ππ elastic scattering amplitude. This coupling\ncan also be used to construct 1-loop diagrams. Because the EFT is non-renormalizable, the divergences of the 1-loop\ndiagrams cannot be easily removed: there are logarithmically divergent amplitudes proportional to q 4 . In order to\ncure these divergences, one has to introduce new couplings in the Lagrangian, which are those in L4,0 . This means\nthat one should think of the expansion in q 2 /Λ∗ 2 as an expansion in −\nh. Going to higher loops will involve introducing\nnew couplings with higher number of derivatives. Most important, in comparing with experimental data, one has\nto be careful to use the Lagrangian Lχ appropriately: if one wants to extract a leading-order value for, say α1 , the\ncomparison should be done by including 1-loop diagrams built with the couplings extracted from L2,0 .\nAnalogously, one can think of custodial-symmetry breaking effects as arising from loop diagrams involving fundamental degrees of freedom (techni-quarks) in the underlying theory, whose masses and couplings violate custodial\nsymmetry. And hence we associate also δ 2 /Λ∗ 2 with O(−\nh) corrections. The power-counting is hence determined by\nassuming that\nq2\nδ2\ng2\n∼\n∼\n∼ O(−\nh) .\nΛ∗ 2\nΛ∗ 2\n4π 2\n\n(34)\n\nLooking back at Lχ one can ask what is the physical meaning of the couplings in terms of the physics of electro-weak\ngauge bosons. One immediately sees that α0 , α1 and α8 produce corrections to the gauge boson propagators, while\nα2 , α3 , α11 and α9 correct the cubic couplings and α4 , α5 , α6 , α7 and α10 the quartic couplings. Precision studies\nof the electro-weak interactions bound mostly the corrections to the vacuum polarizations. Following [9], the oblique\nparameters can be defined starting from the transverse vacuum polarization amplitudes of the gauge bosons of the\nstandard model, expanding as\n1\nΠ(q 2 ) = Π(0) + q 2 Π′ (0) + (q 2 )2 Π′′ (0) + * * * ,\n2\n\n(35)\n\nand defining, for Π′W W (0) = 1 = Π′BB (0):\ng ′\nΠ 3 (0) ,\ng′ W B\n1\n3\n3\nT̂ =\n2 (ΠW W (0) − ΠW + W − (0)) ,\nMW\nŜ =\n\nÛ = (−Π′W 3 W 3 (0) + Π′W + W − (0)) ,\n2\nMW\nΠ′′W 3 W 3 (0) ,\nW =\n2\n2\nMW\nX =\nΠ′′W 3 B (0) ,\n2\n2\nMW\nΠ′′BB (0) .\nY =\n2\n\n7\n\n(36)\n(37)\n(38)\n(39)\n(40)\n(41)\n\nSome insight might be obtained from the comparison to the chiral Lagrangian, and the classification by Gasser and Leutwyler [33] of\nthe coefficients appearing at the O(q 4 ). α1 corresponds to L10 , α2 and α3 to L9 , α4 to L2 and α5 to L1 .\n\n\f17\nThe parameters α0 , α1 and α8 are hence directly related to S, T and U of [8] 8 , and to the Ŝ, T̂ and Û in [9]:\nα\nS.\n4 sin2 θW\nT̂ = 2g 2 α0 = αT ,\nα\nU.\nÛ = g 2 α8 = −\n4 sin2 θW\nŜ = −g 2 α1 =\n\n(42)\n(43)\n(44)\n\nBounds on the other αi exist, but are much less stringent, because much less data is available for the cubic and quartic\nvertexes. The parameters X, W and Y are related to terms O(q 6 ) in Lχ .\nThe strategy for extracting bounds on new physics from the experimental data requires to compute measurable\namplitudes from the MSM at 1-loop level, and include L2,2 and L4,0 (equivalently, introducing the corrections from\nS and T in the propagators) at the tree level. In this way, all UV and IR divergences cancel, and a consistent set of\namplitudes computed at O(−\nh) can be compared to the data (the reader should remember that at the tree-level the\nMSM itself does not provide a satisfactory fit of all the electro-weak precision observables, for which the inclusion\nof 1-loop corrections is necessary). One then performs a fit to the data using as free parameters the values of the\nelectroweak MSM parameters g, g ′ and vW , of the masses of top mt and Higgs mh , and the precision parameters Ŝ\nand T̂ . A list of the observables used can be found for instance in [9, 35].\nHere comes one subtlety, which is going to be important also later: in computing the MSM 1-loop contributions to\nthe physical observables, an explicit logarithmic dependence on the mass of the Higgs mh is present. Borrowing the\nresults from [8]:\nŜ ≃\n\nα\nm2\nln 2 h ,\n2\nmh (ref)\n48π sin θW\n\n(45)\n\nwith m2h (ref) some reference value for the Higgs mass. The result is that the MSM provides a good fit to all the\nexisting data, for values of the Higgs mass mh <\n∼ 1 TeV, provided all the precision parameters such as Ŝ and T̂ are at\nmost of order few 10−3 . One may arbitrarily decide to do the fit while setting all the oblique parameters to zero. In\ndoing so, one finds a bound on the mass of the Higgs to be mh <\n∼ 200 GeV (95% c. l.)[34], because of the logarithmic\ndependence on mh of the 1-loop corrections. This bound amounts to assuming that no new physics be present at any\nscale.\nThe comparison of the above procedure to a generic extension of the SM can be done rigorously only provided the\nonly light degrees of freedom include all the SM fermions and gauge bosons, together with one Higgs scalar, while\nall new physics can be integrated out and reabsorbed in the higher-order coefficients in Lχ . This means that some\ncaution must be used when comparing to models which predict the presence of new light degrees of freedom, for which\nthe 1-loop perturbative part of the calculations should be redone.\nBut also highlights a difficulty with higgsless models, in which strictly speaking the precision parameters diverge,\nand are hence not calculable. A physical cut-off should be kept in the calculation, entering logarithmically in place\nof the logarithmic dependence on the mass of the Higgs. In practice, phenomenological studies usually assume that\nHiggsless models (including TC) be well described by the limit of the MSM case in which mh ≃ 1 TeV. This is\nmotivated mostly by the pragmatic observation that, because the dependence on the mass of the Higgs is logarithmic,\nby varying the Higgs mass between mh = 115 GeV and mh = 800 GeV (which covers most of the regime over which\nthe Higgs can be treated perturbatively), the bound on Ŝ changes only by ∆Ŝ ≃ 10−3 , which is smaller that the error\n−3\nbar on Ŝ itself. Imposing, for instance, |Ŝ| <\n∼ 3 × 10 on the calculable part of the new physics contribution is hence\ngoing to yield sensible quantitative constraints. Notice also that the result of the fit of the data yields some ellipsoid in\nthe space of the complete set of precision parameters, and the resulting bounds on T̂ and Ŝ in particular are correlated.\nBecause of the intrinsic uncertainty in the treatment of strongly-coupled systems, in particular due to what we just\nsaid about the role of scalars, in the following I will use the bounds as uncorrelated, with the understanding that\nthese are somewhat conservative bounds: models that end up outside the bounds are very unlikely to be fixed by\nimproved calculations, and are hence excluded, while for models that fit into the bounds, a detailed strong-coupling\ncalculations would be needed to decide if they can or cannot fit the data.\nThe non-decoupling of the Higgs degrees of freedom is one of the many subtle, phenomenologically important,\naspects of the MSM, which sources theoretical problems in its extensions. In the case of precision electro-weak tests,\n\n8\n\nNotice that in the definition of S, T and U the O(q 4 ) corrections are neglected, and hence the identification of Ŝ and α1 with S is valid\nonly up to O(q 4 ) corrections.\n\n\f18\nthis feature still allows for useful quantitative information to be extracted, thanks to the mild logarithmic dependence\non the Higgs mass. In short, generic new physics contributions are larger than the uncertainty introduced by the\nHiggs-mass dependence, and hence useful (and quite restrictive) constraints can be extracted. We will see that this\nis not the case for other observables, such as elastic-scattering amplitudes of longitudinally-polarized gauge bosons,\nin which the non-decoupling manifests itself with a strong, quadratic dependence on mh . In Higgless theories one is\ngoing to face quadratically divergent contributions to these scattering amplitudes, that are removed by completely\nuncalculable contributions from the scalar sector, hence limiting greatly the amount of information about new physics\nthat can be extracted. We will be more precise on this topic in a later subsection.\nBefore going any further, the reader should be reminded of the role played by precision studies in the discovery of\nthe top, which is a nice illustration of how powerful simple power-counting is, and how important precision studies are.\nThe electro-weak chiral Lagrangian highlights a very special feature: custodial symmetry is broken by an operator\nof dimension-2, in L2,2 . Very interestingly, in the SM there is one very large, explicit source of breaking of SU (2)R ,\nnamely the mass of the top is much larger that the mass of the bottom. Dimensional analysis suggests hence that\nT̂ ∝ m2t (or, equivalently, δ ∝ mt ). (We will see later that indeed this is the result of perturbative calculations with\na heavy fermion.) Which means that the precision tests of the SM are very sensitive to the precise value of the top\nmass. And indeed, a clear indication that the top is heavy, in the 170 GeV region, was obtained by analyzing LEP\ndata before the actual TeVatron discovery. As we already saw, similar arguments yield much more limited information\nabout the Higgs mass, that enters only logarithmically in the precision tests.\n1.\n\nPerturbative estimates of Ŝ and T̂ .\n\nFollowing Peskin and Takeuchi, we can start from computing the contribution to the precision parameters from a\nnew family of weakly-coupled, heavy fermions. This perturbative calculation will be useful in showing us how the\ncorrections are generated, and we will later discuss what to expect in the non-perturbative case.\nConsider a fermion left-handed doublet (N, E)L , with hypercharge Y , and right-handed NR , LR such that the\nphysical states have masses, respectively, m and m + δ. Assuming that m ≫ MZ , one can compute the correction to\nthe vacuum polarizations induced at 1-loop from diagrams involving loops of such fermions, with SM gauge bosons\non the external lines. Assuming also, for simplicity, that δ ≪ m, the expressions simplify to\nα\n1\n,\n2\n4 sin θW 6π\n(g 2 + g ′ 2 ) δ 2\nT̂ ≃\n,\n48π 2 MZ2\nŜ ≃\n\nÛ ≃ −\n\n2 δ2\nα\n.\n4 sin2 θW 15π m2\n\n(46)\n(47)\n(48)\n\nFirst of all, this confirms that Û is doubly suppressed, as anticipated in speaking about the electro-weak chiral\nLagrangian, and hence can be ignored in phenomenological analysis. Second, it explicitly shows that T̂ is proportional\nto the amount of custodial-symmetry breaking in the new physics sector, and is hence negligibly small provided\nδ/MZ ≪ 1. For these reasons, we focus on the Ŝ parameter. Finally, if one has ND different fermions, their\ncontributions sum,\nŜ ≃ 0.0004ND ,\n\n(49)\n\nŜperturbative ≃ 0.0004 × (3 + 1) Nf NT ,\n\n(50)\n\n<\nwhich, taking as a reference the bound Ŝ <\n∼ 0.003, implies ND ∼ 8.\nIf one could borrow this result and use it as an estimate of the TC contribution, this would imply a strong bound\non the possible choice of field content of the theory. For example, reconsidering the SU (NT ) vectorial gauge theory\nintroduced earlier on, with Nf families of techni-quarks, each family including fermions on the fundamental of SU (NT )\nthat carry the quantum numbers of a family of SM fermions, one obtains\n\nwhich effectively restricts to one point of parameter space with NT = 2 and Nf = 1. And still, this single point would\nlie on the 3σ upper bound.\nThe use of this perturbative estimate is, of course, very hard to motivate: by definition technicolor is strongly\ncoupled. The numerical coefficients have to be taken for what they are. The robust messages that can be extracted\nfrom this exercise are that some form of custodial symmetry better be present, to suppress T̂ , that Ŝ is potentially\nproblematic, and that the precision parameters are expected to grow with the number of degrees of freedom ND\ncoupled to the SU (2)L gauge bosons.\n\n\f19\n2.\n\nNon-perturbative estimates of Ŝ: NDA and hidden local symmetry.\n\nOne might want to get a feeling for how big the coefficients of Lχ are expected to be, in particular α1 (equivalent\nto Ŝ), which is the most severe test of dynamical electro-weak symmetry breaking. A set of very simple rules for\nobtaining such an estimate exists, and goes under the name of Naive Dimensional Analysis (NDA). A summary and\ndiscussion of such rules can be found in [14]. Here are the rules, applied to Lχ , restricted by setting to zero all the\ncustodial-symmetry violating terms. First of all, one has to write out all possible local operators compatible with\nthe symmetries, and include them in the effective Lagrangian. An estimate of the coefficients is then given by the\nfollowing three rules:\n• include a factor of f 2 Λ∗ 2 overall,\n• include a factor of 1/f for any occurrence of strongly coupled fields (such as the pions π),\n• include appropriate factors of Λ∗ to get the dimension to 4 .\nHence, the coefficient of the terms in L2,0 is f 2 , and for L4,0 all the coefficients are αi = O(f 2 /Λ∗ 2 ). The scale Λ∗ is\nassociated with the mass of the lightest degree of freedom that has been integrated out of the theory, which typically\nis the mass of the technirho meson Mρ . Hence, one expects\nŜ ∼ g 2\n\nf2\n.\nMρ2\n\n(51)\n\nIdentifying f with the electro-weak scale, taken literally this result would mean that Mρ >\n∼ 3 TeV. We will see that\nmuch more sophisticated techniques agree to an impressive degree with this NDA estimate. It must be stresses that\nadditional symmetry arguments provide systematic ways of including exceptions to this rules, as is illustrated by\nthe fact that on the basis of this counting only one would conclude that T̂ = O(1), while promoting SU (2)R to an\napproximate symmetry makes T̂ = O(δ 2 /Λ∗ 2 ) ≪ 1.\nThe relation between the Ŝ parameter and the physics of spin-1 resonances in a strongly-coupled theory can be\nmade more precise and model-independent with the use of dispersion relations to rewrite Eq. (36) by saturating on\nthe vector resonances (ρ) and axial resonances (a1 ), which results in:\n!\nX fρ2 n\nfa21 n\nα\nŜ ≃\n,\n(52)\n− 2\n4π\nMρ2 n\nM a1 n\n4 sin2 θW\nn\nwhere the index n = 1, 2, * * * identifies the tower of resonances with mass Mn2 and decay constant fn2 . In the limit\nin which SU (2) × SU (2) were unbroken, axial and vector states would be exactly degenerate and connected by a\nsymmetry, and hence Ŝ = 0. The pion decay constant measures how broken this symmetry is. This expression\nis useful because it shown that a suppression of Ŝ not necessarily implies taking large values of Mρ , but might be\nachieved by suppressing the decay constants, or by ensuring a cancellation between vectorial and axial contributions.\nOne way of drawing a closer relation between Ŝ and the heavy composite states, in particular the lightest spin-1\nmeson, the techni-rho, is provided by the inclusion of the latter in the low energy effective theory. This is done with\nthe help of so called hidden local symmetry (HLS) [15]. The basic trick is to extend the global symmetry of the chiral\nLagrangian (truncated to the leading order), by introducing an additional, spontaneously-broken gauged SU (2) as in\nFig. 3. The SU (2)ρ in the middle site is gauged with strength gρ , and there are now two sigma-model fields, so that\nin unitary gauge the new gauge bosons are massive.\n\nSU (2)L\n\nSU (2)L\n\nS1\n\nSU (2)ρ\n\nSU (2)ρ\n\nS2\n\nSU (2)R\n\nU (1)Y\n\nFIG. 3: Diagram of the 3-site model.\n\n\f20\nThe important terms in the Lagrangian are, at the leading-order,\n1\n1\n1\nf2\nf2\nL3s = − Tr Wμν W μν − Tr Bμν B μν − Tr ρμν ρμν +\nTr |DS1 |2 + Tr |DS2 |2 ,\n2\n2\n2\n4\n4\n\n(53)\n\nwith\nS1,2 = e\n\n2iπ1,2\nf\n\n,\n\n(54)\n\nand the covariant derivatives\nDS1 = ∂S1 + i (gW S1 − gρ S1 ρ) ,\nDS2 = ∂S2 + i (gρ ρS2 − g ′ S2 B) .\nIn unitary gauge, S1 = 1 = S2 , and the mass of the neutral gauge bosons is, in the (W 3 , ρ3 , B) basis:\n\n 2\ng\n−ggρ\n0\n1\nM2 = f 2  −ggρ 2gρ2 −g ′ gρ  .\n4\n0 −g ′ g\ng′ 2\n\n(55)\n(56)\n\n(57)\n\nρ\n\nAssuming that g, g ′ ≪ gρ , one can integrate out the heavy techni-rho, of mass\nMρ2 =\n\n1 2\n1\n(g + g ′ 2 + 4gρ2 )f 2 ≫ MZ2 = (g 2 + g ′ 2 )f 2 ,\n8\n8\n\n(58)\n\nand finally obtain\nŜ =\n\n2\n1 f2\nMW\n1 g2\n= g 2 π2 =\n2\n4 gρ\n4 Mρ\nMρ2\n\n(59)\n\n2\nwhere fπ2 = f 2 /2 = vW\n. This estimate implies that the bound on Ŝ requires Mρ >\n∼ 1.5 TeV, which is a factor of 2\nmilder that what derived from the NDA estimate Eq. (51), but consistent with it.\nSome lesson and some comment on this little exercise. One might regard the agreement between the equations we\nderived as a success. They actually indicate a surprising degree of robustness of the NDA estimates. However, one\nhas to use some caution, for a number of reasons. First of all, the bound we just derived implies that gρ >\n∼ 6.5, which\nmeans that the very idea of studying perturbatively the spectrum, couplings and correlators from L3s does not work.\nIn practice, this Lagrangian would be useful only in the regime in which gρ be perturbative, in which the bounds on\nŜ are certainly exceeded. Even worse: in writing L3s we did not apply the basic rule of EFT, requiring to write,\norder-by-order, all the possible terms allowed by symmetries, because we omitted\n\nLκ = κ\n\nf2\nTr |D(S1 S2 )|2 .\n4\n\n(60)\n\nAside from the fact that this term is not nearest-neighbour, it is a perfectly legitimate part of the leading-order\nLagrangian. Its presence has two main effects, due to the fact that it changes both the kinetic terms of the pions and\nthe mass terms of the gauge bosons. First of all, it splits the pion and techni-rho decay constants\nfρ2 =\n\nf2\nf2\n6= fπ2 = (1 + 2κ) ,\n2\n2\n\n(61)\n\nnotice that positivity of the kinetic terms requires κ > −1/2. Furthermore, because the spectrum is given by\nMZ2 ≃ (1 + 2k)(g 2 + g ′ 2 )f 2 /8 = (g 2 + g ′ 2 )fπ2 /4 and Mρ2 ≃ gρ2 f 2 /2, it modifies the Ŝ parameter\nŜ =\n\n2\n1\n1 g2\n1 f2\nMW\n= g2 2 =\n.\n2\n2\n4 gρ\n8 Mρ\nMρ 1 + 2κ\n\n(62)\n\nFinally, it changes the cubic coupling between ρ and pions:\ngρππ =\n\ngρ\n.\n2 + 4k\n\n(63)\n\n\f21\nNotice that, in real-world QCD, which can be described with the same formalism up to minor modifications, fρ ≃ 150\nMeV and fπ ≃ 93 MeV, indicating that even in order to describe QCD κ must be included and is O(1), not small. In\nthis specific case, the fact that fπ is smaller that fρ implies negative values of κ, and hence an enhancement of Ŝ in\ncomparison with what we said earlier on. This is what actually happens if one estimates the oblique corrections by\nscaling up the QCD experimental results [8].\nBefore going any further, another important comment about these non-nearest-neighbour couplings. By looking\nat Eq. (62), one might be tempted to conclude that this provides a perfectly natural way out of the little hierarchy\nproblem, just by dialing κ to a somewhat largish, positive coefficient. This train of thought is quite dangerous, and\nyields to big problems. The reason is that once non-nearest-neighbour interactions are allowed, and particularly if κ\nis large, nothing prevents form writing much more dangerous terms, one of which is Tr S1 S2 Bμν S2† S1† W μν , which one\nrecognizes to be a direct contribution to Ŝ. This is a subleading term to be added to L3s , and as such one would\nnaively think of it as suppressed, but if κ is taken large, then also the coefficient of this new term should be large,\nand this would become the dominant (uncalculable) contribution to Ŝ. In other words, playing the game of dialing\nup the coefficients of interactions such as Eq. (60) yields in the end a useless theory, in which Ŝ is a free parameter.\nIn general, terms such as Lκ are generated when integrating out other heavier states from the theory. The one\nterm in Eq. (60) is just one example. These terms and their proliferation with the inclusion of more sites and links\nrepresent a very heavy limitation in the predictive power of the hidden local symmetry approach. Also, one must\nquestion how appropriate it really is to include in the effective theory the rho mesons, but not other states, such as\ntheir axial counterparts, the a1 . One can use the technique exemplified above to include many spin-1 resonances,\nalong the lines of [15]. The resulting model, in the limit of infinite number of sites, is the deconstructed version of a\nfifth dimension, provided no non-local terms are included.\nAnother simple exercise will help understanding what is the physical meaning of the Ŝ parameter. In this case, we\nextend the 3-sites model to a 4-sites model as in Fig. 4, hence incorporating in the EFT both the vectorial (techni-rho)\nmeson and its axial partner (techni-a1 ). The important terms in the Lagrangian are\n\nSU (2)L\n\nSU (2)L\n\nS1\n\nSU (2)ρ\n\nS2\n\nSU (2)ρ′\n\nS3\n\nSU (2)ρ′\n\nSU (2)ρ\n\nSU (2)R\n\nU (1)Y\n\nFIG. 4: Diagram of the 4-sites model.\n\n1\n1\n1\n1\nL4s = − Tr Wμν W μν − Tr Bμν B μν − Tr ρμν ρμν − Tr ρμν ρμν\n2\n2\n2\n2\nf2\nF2\nF2\nTr |DS1 |2 + Tr |DS2 |2 +\nTr |DS3 |2 ,\n+\n4\n4\n4\n\n(64)\n\nwith\nS1,3 = e\nS2 = e\n\n2iπ1,3\nF\n\n,\n\n2iπ2\nf\n\n(65)\n(66)\n\nand the covariant derivatives\nDS1 = ∂S1 + i (gW S1 − gρ S1 ρ) ,\nDS2 = ∂S2 + i (gρ ρS2 − gρ S2 ρ′ ) ,\nDS3 = ∂S3 + i (gρ ρ′ S3 − g ′ S3 B) .\n\n(67)\n(68)\n(69)\n\nIn unitary gauge, S1 = S2 = S3 = 1, and hence all the gauge bosons (aside from the photon) acquire a mass, via the\nmass matrix:\n\n 2 2\ng F\n−ggρ F 2\n0\n0\n2\n2 2\n2\n2 2\n\n1\n0\nρf\n\n −ggρ F gρ (f 2+ 2F ) 2 −g\n(70)\nM2 =\n2\n2\n′\n2  .\n\n0\n−gρ f\ngρ (f + F ) −g gρ F\n4\n0\n0\n−g ′ gρ F 2\ng′ 2F 2\n\n\f22\nIn the limit where f ≪ F , one sees that there is an approximate SU (2) × SU (2) symmetry. The spectrum has\nMρ2 ≃ Ma21 ≃ gρ2 F 2 /4, MZ2 = (g 2 + g ′ 2 )f 2 /4, and Ŝ ≃ 2g 2 f 2 /(gρ2 F 2 ). This explicitly shows the fact that Ŝ measures\nthe effect of isospin breaking in the resonances. In particular, one can suppress Ŝ by ensuring that the vectorial and\naxial-vector resonances are quasi-degenerate. However, notice that for this to work one needs a parametric suppression\nfπ ≪ fρ , which is not what expected in a QCD-like theory. Some non-trivial dynamics, in which a scale separation\nexists suppressing fπ is needed. In particular, notice that models in which this mechanism is at work cannot be\ndescribed at low energy by a 3-site model, because there is no gap allowing to integrate out the a1 while keeping the\nρ meson. Which is one way of understanding why the small-Ŝ regime is not accessible within the 3-site model, which\nbecomes uncalculable and fine-tuned in this regime.\nConcluding: both perturbative and non-perturbative estimates of the Ŝ parameter indicate that there is a tension\nbetween the expectations in a generic model of technicolor and the experimental data. However, this does not mean\nthat TC is excluded by precision tests. Fist of all the tension is not dramatic: some models are at the boundary\nof acceptability. Also, the NDA estimates are just valid up to unknown numerical factors that are very difficult to\ncompute, even in QCD-like theories. In walking technicolor, as we will see in next subsection, NDA expectations are\nexpected to be violated. Large anomalous dimensions can distort the spectrum of masses and decay constants [36],\nand ultimately a more reliable technique is needed in order to perform actual calculations. This might be provided\nby the lattice or, as suggested here, by the ideas of gauge/string duality.\nB.\n\nFermion masses and FCNC constraints.\n\nAlmost by definition, a technicolor model is an incomplete model of electro-weak symmetry breaking in the SM.\nThe mechanism illustrated in the previous sections provides a mass for the electro-weak gauge bosons, but not for the\nSM fermions, which are exactly massless. This because one cannot write the Yukawa couplings, in the absence of an\nelementary scalar. A simple EFT way of solving this problem is to add to the Lagrangian four-fermion interactions\ncoupling the SM quarks and leptons ψSM to the techni-quarks ψT C . When techni-quarks condense, dimensional\ntransmutation allows to match the theory onto a low-energy EFT in which mass terms are generated for the SM\nfermions:\n(ψ̄SM γμ ψT C )(ψ̄T C γ μ ψSM ) →\n\nψ̄T C ψT C ψ̄SM ψSM .\n\n(71)\n\nThere are three, interrelated problems with this idea. First of all, because these are higher-order operators, adding\nthem by hand to the fundamental Lagrangian would spoil the good UV behavior of the theory that is the original\nmotivation for technicolor itself. It is hence necessary to extend somehow the new physics sector in such a way as\nto dynamically generate these four-fermion interactions at some intermediate scale ΛET C > vW . This is the role of\nExtended Technicolor (ETC). The second problem is that in generating the operators needed in order to yield the\nmasses and mixing among SM fermions, the ETC interactions are expected in general to produce also dangerous\nhigher-order terms, coupling for instance four SM fermions, which can easily produce large contributions to FCNC\nprocesses, in excess of what allowed by data on flavor physics. Avoiding this requires that ΛET C ≫ vW , but also a\nchallenging model-building exercise, in which the hierarchy of masses is generated dynamically, and some mechanism\nresembling the GIM mechanism be at work. This is the role played by tumbling ETC. Finally, some of the SM fermions\nare quite heavy (the top for instance has mt ∼ vW ), but NDA suggests that the masses obtained from dimension-6\n3\noperators should be O(vW\n/Λ2ET C ) ≪ vW . Walking dynamics might provide a solution to this problem, by enhancing\nthe fermion masses but not the dangerous operators involved in FCNC processes (and in the custodial-symmetry\nbreaking effects such as T̂ ), as we are going to see.\nIn this subsection, I start from recalling the basic mechanisms at work in the SM and its perturbative extension of\nrelevance for flavor physics (the GIM and FN mechanisms), then move to strongly-coupled models, and summarize\nthe concepts of tumbling ETC and the role of walking dynamics. Before we embark in this discussion, one should be\naware of the fact that, to large extent because of the uncertainties intrinsic with strongly-coupled dynamics, at present\nthere is no satisfactory, UV-complete model encompassing all of the above. It would be interesting to build such an\nexplicit UV-complete model of ETC in the context of gauge/string dualities. It must also be mentioned that some\nvery interesting results have been obtained with five-dimensional Higgsless theories that are more closely related to\ntopcolor [5], rather than to ETC, in the sense that the SM fermions propagate in the bulk, and are hence composite\nobjects themselves [41].\n\n\f23\n1.\n\nThe GIM mechanism.\n\nIn the MSM, in the simplifying limit in which no right-handed neutrinos are present, and in which neutrinos are\nexactly massless, a very rich structure of global family symmetries is present. At the classical level, in the limit in\nwhich all the Yukawa couplings in Eq. (4) vanish, the model has a U (3)5 global symmetry, with each U (3) acting\non the three families of matter for each fermion species. The Yukawa couplings break explicitly this symmetry,\nultimately generating the hierarchy of masses of the SM. The gauge couplings of SU (2)L × U (1)Y are universal. The\nphenomenological distinction between families arises only because of the masses induced by the Yukawa couplings,\nand flavor-changing interactions are controlled by the mixing matrices that diagonalize the mass matrices. For\nconcreteness, restrict attention to the quarks only. The important terms of the Lagrangian after electro-weak symmetry\nbreaking read\ng\nL = iū′ a ∂/ u′a + id̄′ a ∂/ d′a − √ (ū′L )a γ μ Wμ+ (d′L )a + h.c.\n2\n\u0001\n′\n′\n− Mab (ūR )a (uL )b − mab d ̄′R a (d′L )b + h.c. ,\n\n(72)\n\nMd = VR† M VL ,\n\n(73)\n\nwhere u′a and d′a are the up-type and down-type Dirac fermions describing the quarks in what is called the interaction\nbasis, with family index a = 1, 2, 3.\nThe mass matrices can be diagonalized by the bi-unitary transformations defined as\n\nmd =\n\nUR† mUL\n\n,\n\n(74)\n\nwhere all the rotation matrices are 3×3 unitary matrices UL† UL = 1 = UR† UR = VL† VL = VR† VR . These transformations\ndefine the mass basis for the quarks:\nu′L,R = VL,R uL,R ,\n\n(75)\n\nd′L,R\n\n(76)\n\n= UL,R dL,R .\n\nIn this new basis the Lagrangian density can be rewritten as\ng\nL = iū a ∂/ ua + id̄ a ∂/ da − √ Uab (ūL )a γ μ Wμ+ (dL )b + h.c.\n2\n\u0001\n− (Md )aa (ūL )a (uR )a − (md )aa d ̄L a (dR )a + h.c. ,\n\n(77)\n\nwhere the matrix U ≡ VL† UL is the CKM mixing matrix, which in general is not diagonal. All flavor-changing processes\ninvolve off-diagonal entries of this matrix, which are known to be small [35]. The neutral interactions are diagonal\nalso in the mass basis.\nAll of this is at the basis of the GIM mechanism for suppressing FCNC transitions. There are three suppression\nfactors. The neutral-current couplings being diagonal, all flavor changing neutral current processes are induced by\nweak interactions at the loop level, and are hence suppressed by loop factors in the weak couplings. They all involve\ncombinations of the small mixing angles in the CKM matrix, which can yield significant suppression. Because the\norigin of the mixing is the Yukawa couplings breaking the family symmetry, additional suppression comes from factors\ninvolving the masses of fermions in the internal lines of loop diagrams.\nAn example will help illustrating the point. Consider the semi-leptonic decay of the K + meson, and try to estimate\nthe ratio\nx =\n\nΓ [K + → π + ν ν̄]\n.\nΓ [K + → π 0 e+ νe ]\n\n(78)\n\nNaively, the two final states might look very similar. However, a look at the PDG [35] reveals that x ∼ O(10−9 ).\nA very efficient way to understand this is by integrating out the W boson and hence building an effective theory\ndescribing the interaction such as to include the two effective operators\nμ α\nα μ α\nL = c1 [s̄α\nL γ uL ] [ν ̄e L γμ eL ] + c2 [s̄L γ dL ] [ν̄L γμ νL ] + h.c. ,\n\n(79)\n\nwhere c1 and c2 are dimensionful. It is clear that the kinematics and the matrix elements of the full calculation are\nvery similar for the two processes, and hence x ≃ 6|c2 /c1 |2 , where a factor of 3 comes from the three possible neutrino\n\n\f24\nspecies in the final state, and a factor of 2 from the matrix elements. The explanation for the smallness of such ratio\nmust come from the weak interactions.\nA closer inspection, in the light of the SM, shows that c1 is generated by the tree-level exchange of a W boson.\nHence\nc1 ∼\n\n4GF ∗\n√ Uus ,\n2\n\n(80)\n\nwith Uus ≃ 0.22 the Cabibbo angle. Conversely, c2 is generated by loop diagrams (boxes and penguins) and is given\nby\n\u0012 2 \u0013\nX\n4GF\nα\nmi\n∗\n√\nc2 ∼\n,\n(81)\nUis Uid X\n2\n2\nM\n2π\nsin\nθ\n2\nW i\nW\nwhere the function X depends on the ratios of the up-type quarks masses in the loop and MW . In doing so,\ncontributions that do not depend on the mass of the internal fermions cancel exactly, because of the unitarity of the\nCKM matrix\nX\n∗\nUis\nUid = 0 .\n(82)\ni\n\n2\nThe non-vanishing terms are weighted by functions of the ratio m2i /MW\ninvolving the up-type quark masses mi . The\ndetailed structure of these functions is calculable and well-known, and can be expanded in powers and logarithms,\nsuch that in the case of degenerate fermion masses the result vanishes identically. In the case of this special decay,\ntop and charm contributions are comparable, because a suppression of the top contribution due to the CKM angles\nis compensates by the ratio m2t /m2c . Hence, one can very roughly estimate x ∼ 10−9 − 10−8 , depending on the\nprecise value of the function X evaluated on the charm and top contribution, and to short-distance QCD effects. This\nestimate agrees with the data, at this level of accuracy. The function X is known, and this statement can be made\nmore precise.\nThe important thing is that the huge suppression factor has three origins, ultimately all traceable to the GIM\nmechanism: a (weak-coupling) loop suppression factor α/π, small CKM elements, and ratios of masses of up-type\nquarks. The charm contribution is not severely Cabibbo-suppressed, but the small charm mass provides another\nsuppression factor, while conversely the top contribution is suppressed by the CKM angles. All of this comes from the\nfact that ultimately one might rewrite the physical amplitude in terms of the up-type Yukawa (y (u) y (u)† )12 element,\nwhich breaks explicitly the aforementioned U (3)5 symmetry.\n\n2.\n\nFroggat-Nielsen and see-saw mechanisms.\n\nThe fact that in the absence of Yukawa couplings the MSM Lagrangian has a very large global family symmetry\nis at the basis of the GIM mechanism for suppressing FCNC, and it is also at the basis of most attempts to explain\nthe hierarchy of masses and smallness of mixing angles, within models in which the Yukawa couplings are generated\ndynamically. The basic idea behind this is the generalization of the Froggat-Nielsen (FN) mechanism [11]. A vast\nliterature exists on the subject, all of which is based on the same principles. One starts by taking a subgroup of\nGf ⊂ U (3)5 , chosen in such a way that if Gf were unbroken then all the small mixing angles and fermion mass\nratios would vanish, because all the Yukawa couplings would be forbidden. The symmetry is broken by the VEVs\nhφi i ≫ vW of some scalar (flavon) field that transforms under Gf , but is a singlet of the SM gauge group. The breaking\nis communicated to the SM via the exchange of weakly-coupled, messenger fields with mass Λf ≫ vW . In doing so,\nby integrating out the flavons and the messengers one generates the Yukawa couplings of the SM, and depending on\nthe assignment of SM fermions to representations of Gf the resulting coupling is suppressed by powers of the small\n1\nratios ǫi ∼ hφi i/Λf , which are typically in the range O( 15 ) − O( 20\n). Appropriate choices of Gf , of the representations\nassigned to the fermions, and of the symmetry-breaking pattern allow to produce realistic mass matrices. A number of\nvariations on the theme exist in the literature, in which Gf can be global or local, abelian or non-abelian, continuous\nor discrete, and combinations thereof, within or outside grand unified and/or supersymmetric extensions of the MSM.\nFor all of this to make sense, the most important ingredient is the fact that everything must be weakly coupled,\nand a Higgs scalar be present. If so, one can integrate out all the flavor physics involved in the FN mechanism below\nthe very large scale Λf ≫ vW of the messengers and flavons. As a result, at low energy one generates a series of\noperators to be added to the SM, in which the only marginal operators are the Yukawa couplings:\n• the dimension-4 top Yukawa is often assumed to be unaffected by the FN mechanism, and hence unsuppressed,\n\n\f25\n• all other dimension-4 Yukawa couplings are suppressed by powers of ǫi , leading to the small mixing angles and\nsmall mass ratios,\n• dangerous operators inducing new contributions to FCNC emerge at dimension-5, dimension-6 and higher, and\nare hence suppressed by powers of vW /Λf ,\n• assuming lepton number be broken in the process, and that no (light) right-handed neutrino singlet be present,\na set of dimension-5 operators generates the mass of the SM neutrinos via the see-saw mechanism [12].\nMore on the last point. The operators that would produce the mass for the neutrinos read, schematically:\nLν ∼\n\n1\n(LH) (LH) .\nΛf\n\n(83)\n\nWhen the Higgs develops a VEV, one obtains the mass\nmν ∼\n\n2\nvW\n.\nΛf\n\n(84)\n\nTaking large values of Λf , this results in a suppression of the neutrino masses, that goes under the name of see-saw\nmechanism. If mν ∼ 10−2 − 10−1 eV, one has to require Λf ∼ 1014 − 1016 GeV, which is in the range of GUT theories.\nWith such a large scale, all contributions to FCNC are safely negligible.\n3.\n\nExtended Technicolor, tumbling and walking.\n\nIn a generic extension of the SM, such as ETC, in which all possible higher-order operators generalizing those\nin Eq. (79) are produced at some scale ΛET C , very strong bounds are inferred from data on rare flavor-changing\nprocesses. For instance, requiring√that the ETC contribution to c2 be such as not to spoil the SM agreement with\nthe data implies that ΛET C ∼ 1/ c2 > 50 TeV. Much more stringent bounds can be obtained analyzing the effect of\nsuch operators as\nμ α\nα\nα\n[s̄α\nL γ dL ] [s̄L γμ dL ] ,\n\n(85)\n\nand similar operators which affect mixing and CP violation in the K 0 − K ̄0 system, from which one learns that\nΛET C >\n∼ 1000 TeV.\nAs anticipated, in Technicolor there is no simple way to write a set of marginally irrelevant couplings analogous to\nthe Yukawa's of the MSM. The masses for the SM fermions themselves must arise from higher-order operators coupling\nthe SM fermions and the techni-quarks. This means that the problems of generating the masses, their hierarchies, the\nmixing angles, and CP-violation are tangled together with the problem of doing so by suppressing FCNC processes.\nIn other words, the power-counting that made the Froggat-Nielsen and see-saw mechanisms work in perturbative\ntheories is lost, because there is no simple way to take the limit in which the parameter Λf (or its strongly-coupled\nequivalent ΛET C ) to arbitrary large values, while retaining finite fermion masses and CKM mixing angles.\nLet us try to explain all of this in more details. Naively, one expects that once some generic mechanism is implement,\nit will generate operators of the three generic forms\nLET C = cST (ψ̄SM γμ ψT C )(ψ̄T C γ μ ψSM ) + cT T (ψ̄T C γμ ψT C )(ψ̄T C γ μ ψT C ) + cSS (ψ̄SM γμ ψSM )(ψ̄SM γ μ ψSM ) , (86)\npossibly with all different admissible Lorentz and flavor structures. NDA suggests that in the absence of any other\ndynamical or symmetry argument cSS ∼ cT T ∼ cST . For the mass of the strange quark, for instance, one finds that\nms ∼ cST ψ̄T C ψT C\n\n3\n∼ cST 4πvW\n,\n\n(87)\n\nso that the coefficient of the operator in Eq. (85) is expected to be\ncSS ∼ cST ∼\n\nms\n−2\n,\n3 ∼ (50 TeV)\n4πvW\n\n(88)\n\nand the contribution to K 0 − K ̄0 mixing results to be somewhere between four and five orders of magnitude too big to\nbe acceptable. This kind of disaster is what people have in mind when they say that TC has a problem with FCNC.\nAnother related problem emerges when considering the generation of mass for the top. Borrowing the same estimates, including and taking literally the uncertain factor of 4π, the mass of the top would be obtained with\n\n\f26\n√\nΛET C ∼ 1/ cST ∼ 1 TeV. This optimistic estimate requires that some strongly-coupled sector responsible for generating the mass splitting between the bottom and top quarks be present at a very low scale. Such sector violates\n2\ncustodial symmetry, and hence would generate a contribution to the T̂ parameter T̂ ∼ cST vW\n∼ 0.05, which is\n√\nlargely in excess of the experimental bounds. A more sensible estimate requires the 1/ cST ∼ ΛET C ∼ 5 TeV, in\nwhich case T̂ ∼ 0.002, but then the estimate for the top mass would yield mt ∼ 7 GeV, which is certainly impossible\nto reconcile with the data.\nAll of the above highlights that there is a problem. Clearly, a generic model which is reasonably well approximated\nby NDA counting arguments is not compatible with the data. However, the estimates we did rely on the assumption\nthat operators of the same kind, but involving completely different fields, have coefficients of the same value because in\napplying the NDA rules we assumed that all the operators in Eq. (86) obey the same counting. This needs not be true,\nprovided the underlying dynamics yields a modification of the counting rules. This is based on symmetry considerations\nwithin tumbling ETC, and on dynamical considerations within walking technicolor. Effectively, tumbling ETC plays\nthe role of the VEVs and messengers in the FN mechanism in generating different coefficients for operators of the same\nkind, but involving different SM fermions. Walking dynamics changes the rules of dimensional analysis, by changing\nthe power-counting of operators that involve techni-quarks (due to the non-perturbative anomalous dimensions), in\nsuch a way as to make the operators generating the masses more relevant (lower-dimensional) than the operators\nproducing dangerous FCNC. The additional suppression factor accounting for the neutrino masses may arise from the\nfact that one has to break the lepton number, which requires some specific step in the ETC model [40], and ends up\nmaking the neutrino masses emerge from very high-dimensional operators.\nLet us be more precise about these ideas. In tumbling ETC, one uses a variation of the idea that is at the basis of\nthe FN mechanism, namely that a subgroup Gf ⊂ U (3)5 be a gauge symmetry of the underlying dynamics, broken\nsequentially at several different ETC scales by the dynamical formation of condensates. Technically, one assumes\nthat there is a ETC gauge theory at some very high scale, with Gf × GT C ⊂ GET C , such that SM fermions and\ntechni-quarks transform together in some set of representations of GET C . The strongly coupled dynamics then breaks\nsequentially GET C → G1 → * * * → GT C , at scales Λ1 , Λ2 , . . . , in such a way that at lower energy the fermionic field\ncontent consists of the techni-quarks and the SM singlets, with Gf completely broken. The gauge bosons in the coset\nGET C /(Gf × GT C ) play the role of the messengers in the FN mechanism, and as a result integrating them out yields\nthe four-fermion interactions of the low-energy theory. In this way, one can generate the hierarchy of masses in the SM\nby exploiting the fact that the cST coefficients entering the estimate of the mass of different fermions have a different\ndynamical origin from different scales Λi , depending on the SM field content of the operator in consideration. For\nexample, one can embed the by now familiar example of TC model with SU (NT ) gauge symmetry into a SU (NT + 3)\nmodel, the fundamental representation of which contains the techniquarks and the SM fermions. At scales Λ1 ∼ 1000\nTeV, Λ2 ∼ 50 TeV, Λ3 ∼ 5 TeV [37], the breaking takes place as\nSU (NT + 3) → SU (NT + 2) → SU (NT + 1) → SU (NT ) ,\n\n(89)\n\nso that the (NT +3)-dimensional fundamental representation decomposes in one fundamental representation of SU (NT )\nand three singlets, identified with the SM fields.\nIn the estimate of md ≪ ms ≪ mb one uses the fact that the important four-fermion operators be generated at\nscales Λ1 ≫ Λ2 ≫ Λ3 respectively, with larger scales suppressing the mass of the lighter fermions. In doing so, one\nmust also explain and generate the small CKM mixing angles, in terms of combinations of ratios of such scales Λi /Λj .\nBut then operators such as Eq. (85), because they violate the strange number by two units instead of one, pick up\na suppression factor from the highest scale involved in generating them, times a further suppression in the form of\npowers of the ratio entering the mass generation, effectively implementing a mild form of GIM mechanism. Examples\nof this construction have been implemented in many ways, and semi-realistic models exist [37].\nA second crucial ingredient in a realistic model is the fact that the technicolor theory that emerges at the end of\nthe tumbling is assumed to be walking. This further modifies the counting rules, because strong dynamics is assumed\nto produce anomalous dimensions for operators involving techni-quarks, in particular enhancing the cST coefficients.\nAssuming the chiral condensate to have anomalous dimension γ ∼ O(1), and the walking taking place between the\nelectro-weak scale and a scale Λ∗ (typically, related to the lowest scale produced by tumbling), the estimate for the\nmass of the top becomes\n\u0012 ∗ \u0013γ\nΛ\n3\nmt ∼\ncST 4πvW\n,\n(90)\nvW\n√\nwhich for γ = 1, Λ∗ = 1/ cST ∼ 5 TeV yields mt ∼ 150 GeV, which is acceptably close to the experimental value\n(this being just an estimate). Most important, the dangerous cSS coefficients are not affected by walking, because\nthey involve fermions that do not directly participate in the strong dynamics. As anticipated, walking changes the\ncounting rules of NDA, making the operators involved in the process of mass generation lower-dimensional than\n\n\fW\n\nW\n\nW\n\nW\n\nW\n\nW\n\nW\n\nW\n\n27\n\nW\nW\n\nZ\n\nZ\n\nZ\n\nZ\n\nZ\n\nh\n\nZ\n\nZ\n\nZ\n\nFIG. 5: Diagrams contributing to WL ZL scattering in the MSM, yielding the amplitudes M4 , Ms , Mu and Mh (left to right).\n\ntheir engineering dimension, and hence less irrelevant, and in this way making ETC more similar to the results of\ndimensional analysis that we summarized in the FN case.\nTo conclude, it must be noted that the estimate on the top mass is somewhat optimistic. Nobody really knows for\nsure of any specific walking theory that reproduces it, particularly because the calculation of the anomalous dimension\nposes a huge challenge. A specific calculation in a strongly-coupled theory with the right properties would be needed\nin order to put all of the above on firm grounds. The role of walking is certainly that of enhancing the fermion\nmasses, but quantitatively it is difficult to draw a firm conclusion, and it might well be that the top has to be treated\nseparately. Other proposals exist that address the specific problem of the top mass. The basic observation at the basis\nis that for all practical purposes the mass of the top is numerically the same as the scale of the condensate breaking\nelectro-weak symmetry, and it is hence conceivable that the top plays a special role in the strong dynamics. Models\nin which the top quark is a composite object emerging from the strong dynamics itself are generically referred to as\ntopcolor models [5], with some abuse of language. As anticipated earlier on, in recent years a variation of this idea\nhas been implemented in five-dimensional models, by assuming that the fermions, particularly the top, be allowed to\npropagate in the bulk of the extra-dimension. The interested reader is referred to [41] and references therein.\nC.\n\nPerturbative unitarity.\n\nA very important, non-trivial property of the MSM is related to unitarity. Being a gauge theory, with no anomalies,\nunphysical degrees of freedom (states with negative-norm or wrong spin-statistics) decouple. But even more is\ntrue: scattering amplitudes can be computed diagrammatically, and by looking at their behavior (particularly at\nlarge energy), it is possible to ask under what circumstances the theory admits a sensible interpretation, yielding\nprobabilities bounded by 1. In the MSM, this procedure yields a relation between the cut-off Λ, identifying the regime\nof validity of the theory, and its one undetermined parameter, the mass of the Higgs. In particular, this logic yields\nthe classical result that an absolute upper bound on the mass of the Higgs mh exists [13].\nIn this section, I review the classical derivation of this result, in a simplified version of the MSM in which I set the\ngauge coupling g ′ = 0, so that MZ = MW , and compute at the tree-level the (elastic) scattering amplitude between\nlongitudinally polarized gauge bosons WL ZL → WL ZL . This is a very instructive exercise, which provides deep inside\ninto the functioning of Feynman rules, and of spontaneous symmetry breaking in relation to the Goldstone equivalence\ntheorem. It also teaches us a great lot about the properties of the scalar sector of the spectrum of a strongly-coupled\nmodel of EWSB.\nThe scattering amplitude of longitudinally polarized gauge bosons receives four types of contributions at the treelevel in the MSM, depicted in Fig. 5. Besides the direct contribution from the 4-gauge boson vertex (M4 ) there are\ns-channel and u-channel exchanges of charged gauge bosons (Ms and Mu ) and t-channel exchanges of neutral scalars\n\n\f28\n(Mh ):\n\u0003\ng2 \u0002 2\n2\n(c − 6c − 3)E 4 + (6c + 2)MW\nE2 ,\n4\nMW\n\u0003\ng2\n1 \u0002\n2 2\n2\nc(2E 2 + MW\n) (4E 2 − 4MW\n)\n=\n4\n2 ,\nMW\n4E 2 − MW\n1 h\n2\n(6 + 10c + 2c2 − 2c3 )E 6 + (−6 − 26c − 18c2 + 2c3 )MW\nE4\n=\n4\nMW\ni\ng2\n4\n6\n+ (2 + 14c + 20c2 )MW\nE 2 + (−2 + 2c)MW\n2 ) + M2 ,\n2\n2(1 + c)(E − MW\nW\n2\n\u0003\ng\n1 \u0002 2\n2 2\nMW ((c − 1)E 2 + MW\n)\n=\n4\n2 ) − m2 .\nMW\n2(c − 1)(E 2 − MW\nh\n\n− iM4 =\n\n(91)\n\n−iMs\n\n(92)\n\n−iMu\n\n−iMh\n\n(93)\n\n(94)\n\nIn the above expressions, written in the center of mass frame, g is the gauge coupling of SU (2)L , c = cos θ is the\nscattering angle of the outgoing particles measured in respect to the incoming direction, and E the center of mass\nenergy of the incoming W , related to the Mandelstam variable s = 4E 2 .\nIt is customary to discuss the scattering amplitude in terms of partial wave decomposition. In particular, for the\nJ = 0 amplitude:\nZ +1\n1\nt0 (E) =\ndc M(E, c) .\n(95)\n32π −1\nUnitarity implies that the total cross-section be limited by the geometric cross-section, and in turns this implies that\n|t0 (E)| < 1/2. The energy at which this relation stops being true gives an estimate of the UV cut-off of the theory Λ,\nas a function of the parameters in the model.\n2\nThe expression simplifies considerably in the large momentum limit p2 = E 2 − MW\n→ +∞:\n\u0012\n\u0013\n4p2\ni g2\n2\n2\n2\nm\n−\nM\n+\n2M\nln\n.\n(96)\n→\ntSM\nh\nW\nW\n0\n2\n2\n64πMW\nMW\nAmong the terms in parenthesis, the mh dependence is by far the most important effect. Neglecting the other\ntwo terms gives the anticipated bound mh <\n∼ 1.2 TeV. This is a famous result, which puts an upper bound on the\nMSM Higgs mass. A more complete and rigorous analysis is done for instance in [13]. In order to understand what\nthis statement actually means, it is useful to look in details at how it emerges within Eq. (96), when summing the\ncontributions from the various diagrams.\nFirst, notice how Ms cannot contribute to this specific channel, because odd in c, so that it cancels in Eq. (95).\nIt is useful to consider the behavior at large-p in terms of a series expansion. Truncating at the p2 term, and hence\nkeeping only terms that asymptotically grow as powers of p:\n\u0012\n\u0013\nig 2\n16 4 20 2 2\n4\ntM\n=\n−\n,\n(97)\np\n−\np\nM\nW\n0\n4\n32πMW\n3\n3\ns\ntM\n= 0,\n0\n\n(98)\n\n2\n\nu\ntM\n=\n0\n\nig\n4\n32πMW\n\nh\ntM\n=\n0\n\nig 2\n4\n32πMW\n\n\u0013\n\u0012\n16\n23\n2\n,\n+ p4 + p2 M W\n3\n3\n\u0001\n2\n,\n−p2 MW\n\n(99)\n(100)\n\nwhich clearly shows that both most problematic terms are cancelled thanks to gauge symmetry itself. To be more\nspecific. The O(p4 ) terms cancel between diagrams involving the quartic coupling between gauge bosons and diagrams\nbuilt with two cubic couplings, which is an immediate consequence of the symmetries of the Yang Mills Lagrangian.\nMore subtle is the cancellation of the O(p2 ) term, which involves the Higgs. Notice that for the cancellation of\nthe coefficient in front of p2 to be exact, its contribution form the Higgs cannot depend on mh . Ultimately, gauge\ninvariance ensures that the coupling g of the Higgs to the gauge bosons be the same as the cubic self-coupling. Two\nterms are left not cancelled at the next order: a term logarithmic in p, arising from Mu (see the analytical structure\nof the denominator) and a term proportional to m2h from Mh . The former can be safely neglected, in the sense that\neven for p very large it is not growing fast enough to be a source of concern in practical applications. The latter is\nthe origin of the bound.\n\n\f29\nLet us open here a brief digression. This exercise shows one very typical property of Feynman diagrams: the\ncalculation of single individual diagrams has an inherent tendency to yield non-sensical results. Such are the O(p4 )\nand O(p2 ) terms, that would indicate, if really present, an inherent problem of the theory with unitarity. However,\nonce all diagrams are summed, such pathology disappears exactly: the diagrammatic procedure, carried out carefully,\ncontains all the useful information about symmetries and analytical properties of the theory, and is limited only\nby its perturbative nature. What is even more striking is that the result hence obtained is actually a consequence\nof a very non-trivial property of spontaneously broken gauge theories, the Goldstone equivalence theorem, which is\nautomatically encoded in the diagrammatic procedure.\nTo help making the statements in the previous paragraph more clear, let us go back and rewrite the Higgs potential\nas\n\u0012\n\u00132\nv2\nLV = −V = − λ′ H † H − W\n,\n(101)\n2\nwhich, provided λ = λ′ , differs from Eq. (5) only by an irrelevant additive constant. The minimum is clearly at\n2\nvW\n,\n2\n\n(102)\n\n2\nm2h = 2λ′ vW\n.\n\n(103)\n\nH †H =\nand the physical mass of the Higgs particle is\n\nIn this way, one important property is highlighted: the physical Higgs particle receives a mass from its coupling to\nthe vacuum, in the same way as the gauge bosons and fermions of the standard model do. Replacing in the Eq. (96)\none can rewrite the leading contribution to the partial-wave amplitude as a bound on λ′\n− itSM\n→\n0\n\nλ′\n1\n< ,\n8π\n2\n\n(104)\n\nor λ′ < 4π, which is the familiar bound ensuring that the perturbative expansion makes sense.\nThis yields a more correct interpretation of the result obtained above: it is perturbation theory that breaks down,\nnot unitarity, when the Higgs mass is larger than the bound! The upper bound on the Higgs mass means that either\nthe Higgs is light, and hence all its couplings are perturbative, or otherwise the sector responsible for electro-weak\nsymmetry breaking must be strongly coupled at the TeV scale. This is the basis of the folklore going under the\nname of no-lose theorem for LHC, according to which either the LHC will discover a light Higgs boson, for which the\nexperimental sensitivity stretches up to 800 − 1000 GeV, or a new strongly coupled sector, with new bound states\nmust be present at the TeV scale, in which case the experimental sensitivity might reach somewhat higher masses,\ngood enough for discovery.\nA final parenthetic remark, purely for didactical purposes. Looking at the Eq. (104), one might feel puzzled. We\nare computing at the tree-level the scattering of gauge bosons, due to a gauge interaction, and the result for the\namplitude is, at the leading-order, exactly the same as the elastic scattering amplitude of two real scalars in a theory\nwith no gauge interactions at all, in which the only coupling is the quartic interaction among the scalars. The reader\nwho is familiar with the electro-weak theory will recognize that this is another indirect manifestation of the Goldstone\nequivalence theorem: at large energies, processes involving massive gauge bosons are dominated by the contribution\ncoming from the Goldstone bosons that are eaten up by the Higgs mechanism. Another well known example is,\nwithin the MSM, the decay rate of the Higgs onto Z bosons, which at the leading order, and neglecting phase-space\ncorrections, for mh > 2MZ reads:\n\u0013\n\u0012\nm3h\nMZ2\nMZ4\nΓ(h → ZZ) ≃\n(105)\n1 − 4 2 + 12 4 .\n32πv 2\nmh\nmh\nAt large values of mh , the first term dominates, and the decay rate can be rewritten as\nΓ(h → ZZ) ≃\n\nλ′\nmh ,\n16π\n\n(106)\n\nwhich again does not depend at all on the gauge coupling, and can be computed directly from the theory of the scalars\nin the g → 0 limit, from the decay of the Higgs in two Goldstone bosons.\nThis being a set of lectures on technicolor, it is time to close these digressions and go back to seeing what all of\nthe above teaches us about dynamical EWSB. First of all, this is another manifestation of the non-decoupling of the\n\n\f30\nscalar sector, as anticipated when talking about precision physics. One might think of building the electro-weak chiral\nLagrangian by taking the limit λ′ → +∞, while keeping vW fixed. The Higgs mass grows to infinity in this (classical)\nlimit. However, the Higgs does not decouple, because in order to do so one is effectively taking large values of the\ncoupling. In this limit, what goes really wrong is that in the last diagram in Fig. 5 one should not, for large-λ, use the\nperturbative propagator for the Higgs, but should replace it with a non-perturbatively computed scalar correlator,\nformally written as\n1\n1\n→ 2\n.\np2 − m2h\np − Σ(p)\n\n(107)\n\nThe exact form of Σ(p) cannot be obtained with simple perturbation theory, and one expects it to have a very nontrivial analytical structure of poles and cuts. In a UV-complete TC model, one might also expect that Σ(p) → 0 at\nhigh energies, essentially because all the scales should be generated dynamically in the IR. And hence, ultimately one\nexpects the O(p2 ) terms to cancel, and the scattering amplitude to be unitary, but uncalculable.\nIn Higgsless models, one would not include the diagram yielding Mh , because, by definition, there is no Higgs to\nstart with. As a result, the amplitude under study would grow quadratically with p, in the same way as naively\nobtained from the chiral Lagrangian. One might be lead to conclude that such models generically violate unitarity\nalready below the TeV scale, unless completed somehow. This statements are misleading, and should be read and\nused with some caution. The subtle part is that in the calculation we did here, we have been careful to take p → +∞\nat fixed mh , before starting to look at large values of mh . The other way around, in which one first takes mh → +∞,\nand hence sets Mh = 0, and then looks at large-p, can give sensible answers only provided one can decouple the Higgs.\nWhich is not the case. We already anticipated this observation earlier: this scattering amplitude is a particularly bad\nobservable quantity, that is quadratically sensitive to the mass of the Higgs, and in general to the structure of the\nscalar correlators of the symmetry-breaking sector. As such, the amplitude is completely dominated by uncalculable\ncontributions, which cannot be neglected, and hence in general yields very little useful information about new physics.\nContrast this with what happens for oblique precision parameters.\nOne should also explain what is meant by Higgsless. The fact that EWSB is not induced by an elementary, weaklycoupled scalar sector does not imply that there are no scalars at all. Whatever its origin, it is always possible to excite\nthe vacuum, provided enough energy is at disposal. In doing so, one is probing the structure of the quantum effective\npotential expanded around the symmetry-breaking vacuum. The fact that we do not know what this potential looks\nlike, does not mean that there are no excited, scalar bound states. The really interesting question has to do with\nthe properties of such excited states: can they be described and detected experimentally as particles? Based on\nthe experience of QCD, one might be tempted to give a firm negative answer. Yet, this is a premature conclusion:\nanswering such a question requires a very detailed knowledge of the strong dynamics itself, and dedicated nonperturbative method should be used. Unless symmetry arguments become available, which we will discuss in next\nsubsection.\nIn conclusion. The existence of a perturbative theory describing the sector responsible for electro-weak symmetry\nbreaking, and that this provides a valid description up to high sales, requires the existence of a light scalar degree\nof freedom with the couplings of the Higgs particle in the MSM, in order for the W W scattering amplitudes to be\nmanifestly unitary. In technicolor, there is no elementary scalar, and hence this statement just amounts to saying that\nthe theory must be strongly coupled and non perturbative at the TeV scale, which we already new from the start.\nOne might want to compute the scattering amplitude of longitudinal gauge bosons in presence of such a strongly\ncoupled sector, starting from the underlying dynamics, instead of using EFT, but this is of utmost difficulty. Even in\nQCD, where data about the analog ππ scattering processes are available, the precise role of the resonances, such as\nthe ρ and the scalars, are still subject of studies. In more modern versions of technicolor, it is believed that the role of\ntechni-ρ be very important in the TeV region, in analogy with QCD, but possible other resonances might contribute.\nCorrections to the classical SM results encoded in the coefficients of the chiral Lagrangian, in particular α4 and α5 ,\nmight be measurable, or new resonances detectable at the LHC. In general, this is a very open problem in technicolor,\nand many interesting and useful studies that can be found in the literature [42]. But one has to keep in mind that\nall of this is very strongly limited, by the sensitivity of this particular observable to the uncalculable structure of the\ncorrelation functions involving scalar bound states.\nD.\n\nAbout the spectrum of WTC.\n\nTechnicolor being a strongly coupled theory, which confines and produces condensates at low energy, it is expected\nto have a rich and complicated spectrum of bound states. In this section I focus on a few very special such bound\nstates, the properties of which are related to the fundamental symmetries of the theory: the techni-rho mesons, the\ntechni-pions and the techni-dilaton.\n\n\f31\nOne would like to know also what the spectrum of anomalous dimensions is, at low-energies, where the dynamics\nis walking. In this energy region, the theory is approximately conformal and the dynamics must be governed by\na CFT with some set of operators with non-trivial anomalous dimensions. These anomalous dimensions should be\nlarge, in such a way as to modify the NDA counting rules, for the reasons explained earlier. In some classes of\nsupersymmetric theories, supersymmetry itself allows to compute these anomalous dimensions, thanks to the relation\nbetween R-symmetry and the super-conformal group. But in general this is a very hard task, that requires the use of\nfully non-perturbative techniques. In principle, within gauge/gravity dualities the program of classifying the relevant\noperators and their dimensions can be carried out, although it still represents a very non-trivial task.\n1.\n\nTechni-rho mesons.\n\nFirst of all, the TC sector will have some global symmetry G, a subset of which is identified with the SM gauge\ngroup. It is hence expected on general grounds that towers of spin-1 states transforming under this symmetry be\npresent, analogous to the vectorial ρ meson, axial-vectorial a1 meson and their heavy excitations. We already saw that\nthese states play a crucial role in the oblique precision observables, particularly in the Ŝ parameter. They also play\na role in the W W scattering amplitudes. And finally, they are the most accessible new states at the LHC. This last\nstatement depends crucially on the couplings (and width) of such states, which is the main topic of this subsection.\nThe discussion will rely almost entirely on the comparison with QCD and with its large-N scaling properties.\nBefore starting, let us remind the reader about the large-N scaling of the relevant parameters, which can be\nsummarized by\nMρ ∼ O(1) ,\nfπ2\nfρ2\n\n2\ngρππ\n\n∼ O(N ) ,\n∼ O(N ) ,\n\u0012 \u0013\n1\n∼ O\n,\nN\n\n(108)\n(109)\n(110)\n(111)\n\nwhere the gρππ coupling between technirho and technipion mesons in the HLS language is normalized so that\nLρππ = 2igρππ Tr ρμ [π ∂μ π] .\n\n(112)\n\nThe masses of the spin-1 states are going to be controlled by the strong-dynamics scale Λ∗ ∼ O(1) TeV, while fπ\nstands for the electro-weak VEV. The gρππ coupling controls the decay ρ → W W , which is the analog of the ππ\ndominant decay of the ρ in QCD, with branching fraction very close to 1. In studying LHC signatures of technicolor,\nthis suggests that a clean signature (at least in a QCD-like technicolor) is the process pp → ρ → W W . On general\ngrounds, the number of events expected at fixed center-of-mass energy is strongly suppressed by the techni-rho mass\nin the intermediate state. At the same time, the facts that the width be quite large, that the production process\nmight involve vector-fusion or suppressed couplings to the quarks, and that reconstructing the W W final state is not\ntrivial, limits the possibility of distinguishing the signal from the SM background to Mρ <\n∼ 1 TeV, which is already\nhard to reconcile with precision electro-weak physics.\nA different possibility arises at large-N in a non-QCD-like theory. Some basic results first, exemplified by QCD.\nThe techni-rho, in analogy with its QCD analogue, has two main couplings that determine its decays. There is the\n2\ncubic coupling to the light W and Z (to the pions), with strength controlled by gρππ\n∝ 1/N . But also, the techni-rho\ncouples to the light SM fermions, with couplings proportional to the decay constant fρ2 ∝ N . Both yield decays to\n2-body final states with effectively massless particles. A look at the PDG reveals that in QCD\nBl ≡\n\nΓ[ρ → l+ l− ]\n≃ 4.5 × 10−5 ,\nΓ[ρ → π + π − ]\n\n(113)\n\nboth for l = e and l = μ. Which clearly indicates that the gρππ is the dominant coupling to be considered, as already\nstated earlier. Indeed, at the tree-level one can show that\nΓ[ρ → l+ l− ] =\nΓ[ρ → π + π − ] =\n\nα e2 fρ2\nMρ ,\n3 Mρ2\n\n(114)\n\n2\ngρππ\nMρ ,\n48π\n\n(115)\n\n\f32\nwith e the electromagnetic coupling. Some experimental input: fρ ≃ 150 MeV, Mρ ≃ 770 MeV, Γρ ≃ 150 MeV,\nα ∼ 1/137. With these one obtains gρππ ≃ 5.5, and hence\nBl ≃\n\n192π 2 α2 fρ2\n≃ 4.2 × 10−5 ,\n2 M2\n3gρππ\nρ\n\n(116)\n\nwhich agrees quite well with the data.\nHaving established that these approximations are sensible, at least for QCD, take the result and rescale it to a\nlarge-N QCD-like technicolor theory, in which the mass of the ρ is very big (such that all the SM-fermion masses can\nbe neglected). The ratio BT between partial widths into SM fermions and into W bosons results in\nBT = 8\n\nNc2\nBl ,\n32\n\n(117)\n\nwhere the factor of 8 comes from summing over all the charges of the SM fermions. In order that BT ∼ O(1), one has\nto require that Nc ≃ 12π 2 . Hence, for the decay into W bosons (pions) to be subdominant in respect to the decay\ninto fermions, one needs very large values of Nc . This is in blatant contradiction with the perturbative estimates from\nthe Ŝ parameter.\nHowever, remember how we clarified that what enters into Ŝ is fπ , while the coupling to the currents of interest\nfor the decays in fρ . In a non-QCD-like large-Nc theory, it is possible that the large value of Nc be compensated by\na ratio of scales making fπ ≪ fρ . Notice also that for such values of Nc ≃ 12π 2 one expects\n√\n3gρππ (3)\n√\ngρππ (Nc ) ∼\n∼ 1,\n(118)\nNc\nwhich means that this would be precisely the regime in which hidden local symmetry calculations might become\nreliable.\nIf BT ∼ O(1) or larger, then the phenomenology at the LHC of the techni-rho mesons is going to be drastically\ndifferent from what inferred from QCD: they will be relatively narrow resonances, with couplings to the SM currents\ncomparable to those of the Z and W mesons, and decay predominantly into two fermions. The techni-rhos will look\nvery similar to weakly coupled Z ′ (and W ′ ) gauge bosons. In particular, the Drell-Yan pp → ρ → ll is going to\nbe a very favorable experimental signature of such scenarios. We will come back to this point when discussing the\nbottom-up approach to holography, but notice how a classical signature of weakly-coupled extensions of the SM (a\nnew, narrow spin-1 state) might actually emerge as a low-energy result of a strongly-coupled theory, at large-Nc.\n2.\n\nTechnipion, composite Higgses and Little Higgses.\n\nThe second sector of the spectrum that is very important is that of the possible light pseudo-scalars in the theory.\nIn general, the global symmetry G of the technicolor sector may be much larger than the SM gauge group, and the\ncondensates breaking G spontaneously will produce a number nπ of Goldstone bosons. Weakly gauging the SU (2)L ×\nU (1)Y means that 3 of the Goldstone bosons disappear from the spectrum, becoming longitudinal components of W\nand Z. Also, the gauging of a subgroup of G in general breaks explicitly the symmetry, and hence most of the nπ − 3\nwill acquire a mass. The resulting pseudo-Goldstone bosons (PNGB), however, are going to be relatively light, and\nhence problematic.\nAs an example, we can perform explicitly the exercise of estimating the masses of the PNGBs in the case of the\nprototypical example of TC model we have already discussed several times, by using Eq. (11). In the limit in which\nelectro-weak and QCD gauge couplings are turned off there is a SU (8)L × SU (8)R global symmetry, acting on the\nvectorial techni-quarks, which is broken spontaneously to SU (8). Which means there are a total of nπ = 63 PNGBs. A\nclassification of their properties can be found in [43]. An estimate of their masses can be obtained from the non-linear\nsigma-model description of the 63 pions π i :\nL8 =\n\nf2\nTr |DΣ8 |2 ,\n4\n\n(119)\n\nwhere\nΣ8 = exp\n\n2iπ\n,\nf\n\n(120)\n\n\f33\nthe pions describe the SU (8) × SU (8)/SU (8) coset, and the covariant derivative is\nDΣ = ∂Σ + i (g ′ B + gW + gs G) Σ − iΣ (g ′ B + gs G) ,\n\n(121)\n\nwith W the matrix of the SU (2)L gauge bosons, B the matrix of the U (1)Y , and G the gluons. With these normal2\nizations, one deduces masses for the electro-weak gauge bosons MW\n= g 2 f 2 and MZ2 = (g 2 + g ′ 2 )f 2 , implying that\n2\n2\nf = vW /4.\nBy using Eq. (11), one sees that the QCD interactions give quadratically divergent masses to the majority of the\nPNGBs 9 . To be more precise, if Λ is the cut-off in Eq. (11), one finds\ngs2 Λ2\n,\n4π 2\n3gs2 Λ2\n,\n=\n8π 2\n9gs2 Λ2\n=\n,\n16π 2\n\nm224 =\nm28\nm′242\n\n(122)\n(123)\n(124)\n\nwhere the index 24 and 8 indicates the multiplicity, and where corrections due to electro-weak couplings have been\nneglected because the QCD coupling gs is bigger. These masses are all estimated to be O(200) GeV (up to very large\nuncertainties signaled by the quadratic divergence). But notice that all the corresponding states transform as triplets\nor octets of QCD SU (3)c , and hence carry strong interactions.\nThere are hence 63 − 24 − 8 − 24 = 7 massless Goldstone bosons at this stage of the calculation, which do not\nreceive quadratically divergent contributions to their mass from any of the standard-model gauge interactions. Two\nof them obtain a logarithmically divergent mass from Eq. (11),\nm22 =\n\n3g 2 g ′ 2 f 2\nc,\n16π 2\n\n(125)\n\nwhere c ∼ log Λ/f is some O(1) number. These two masses are much lighter, m2 ∼ O(10) GeV, and the corresponding\nstates electrically charged and colorless.\nFinally, three of the remaining five Goldstone bosons are the longitudinal components of the W and Z bosons.\nThe last two are exact Goldstone bosons, which are electrically neutral and which remain massless as a result of the\nfact that a global U (1) × U (1) symmetry is not broken by the gauge interactions. They are sometimes referred to as\ntechni-axions. Their existence is a very major source of concern for technicolor. However, another source of symmetry\nbreaking might be ETC. Among the 4-fermion interactions generated by ETC, some might break the global symmetry\nG, effectively giving mass to the two undesirable light Goldstone bosons. Walking might also play a role in enhancing\ndynamically all such masses, because some of the operators produced by ETC, which break explicitly the large global\nsymmetry of the model, will involve techni-quarks, and will hence develop large anomalous dimensions, making them\nmore relevant than NDA would indicate.\nNotice one curious fact. The mechanisms giving rise to the very existence, and to the small masses, of the technipions\nalso suggests an intriguing alternative possibility. A similar mechanism has been exploited in order to construct\nvariations of strongly coupled theories in which one set of such PNGBs constitutes the Higgs field H of the MSM\nitself. The symmetry properties of the Goldstone bosons in this case (partially) protect the Higgs potential from\ndangerous divergences. In these proposals, the strong-coupling scale has nothing to do with electro-weak symmetry\nbreaking, which is triggered by the VEV of the Higgs, emerging at a lower scale. These variations go under the\nname of composite Higgs [28], and of little Higgs [29] models. The difference between the former and the latter being\nthat in little Higgs models the same mechanism of collective breaking that anomalously suppressed the masses m22 of\nthe example given above (the fact that the quadratically-divergent contribution to the effective potential vanishes at\n1-loop) is fully exploited in order to enhance the scale separation between the cut-off Λ and the electro-weak scale.\nComing back to our topic, namely technicolor. This is one particularly simple example, rich enough to yield generic,\nrather than general, indications of what to expect. The spectrum and interactions of the techni-pions depend on the\nglobal symmetries of the specific realization of technicolor one is interested in, and one should analyze the details of\nthe symmetry structure on a model-by-model basis, but all of the above clearly shows that techni-pions are a generic\nsource of concern for technicolor, possibly the biggest. On the other hand, the existence of techni-pions carrying QCD\n\n9\n\nThe weakly-coupled effective potential induced by the explicit symmetry-breaking couplings is also important for the study of vacuum\nalignment [44].\n\n\f34\ninteractions is possibly testable, because of their relatively light mass. The fact that light scalars be present which\ncarry electro-weak interactions, possibly very light, is also interesting phenomenologically. And the fact that the\nnumber of such states can easily be very large is also interesting in LHC perspective, provided one identifies models\nin which all of the techni-pions could have escaped detection up to now.\n3.\n\nTechni-dilaton.\n\nFinally, a very open problem, which is not a general property of dynamical electro-weak symmetry breaking but\nrather specifically related to the nature of walking technicolor. A light scalar particle might be present as a consequence\nof the spontaneous breaking of dilatation symmetry. Its phenomenological properties are so striking to deserve a\nsystematic discussion.\nTo understand the implications of this possibility, it is useful to look back at the Lagrangian of the MSM, in\nwhich we write the potential in the form of Eq. (101) rather than Eq. (5). At the classical level, in the limit in\nwhich λ′ vanishes, this Lagrangian is exactly scale-invariant, containing only marginal operators. The minimum of\nthe Higgs potential breaks scale invariance spontaneously, at the scale vW . The coupling λ′ , and all the quantum\ncorrection giving rise to anomalous dimensions, represent the explicit breaking of scale invariance. As a result, there\nis a spontaneously broken approximate global symmetry, and hence in the spectrum there must be a dilaton, the\nPNGB associated with dilatations, whose mass is controlled by the symmetry breaking terms. Indeed, such dilaton\nis the Higgs particle h, and the expression for its mass\n2\nm2h = 2λ′ vW\n,\n\n(126)\n\nis similar to the relation yielding the mass of the pion in QCD\nm2π ∝ mq fπ .\n\n(127)\n\nIn the latter, mq is the quark mass, that breaks explicitly the chiral symmetry, while fπ breaks it spontaneously. For\nthe Higgs/dilaton, the λ′ coupling plays the same role as mq for the pions. Also, notice that the pion is sensibly\ndescribed as a PNGB only provided mq be small. For instance the mass of the B mesons, which have quantum\nnumbers that make them the analog of the pions when the flavor symmetry of QCD is extended to SU (5) × SU (5),\nscales as m2B ∼ m2b . The breaking of chiral symmetry is in this case so large that it does not make sense to speak\nabout SU (5) × SU (5)/SU (5) Goldstone bosons. In the same sense, only provided λ′ be very small, is the Higgs a\ndilaton.\nThe striking consequence of thinking about the Higgs as a dilaton, is that one automatically can infer that the\ncouplings of the Higgs to all the SM fields are given by\nL = 2\n\nh\nh\nh\nM 2 Wμ W μ +\nM 2 Zμ Z μ −\nmψ ψ̄ψ ,\nvW W\nvW Z\nvW\n\n(128)\n\nwhich again is what expected: each appearance of the Higgs h is accompanied by a 1/vW factor taking into account\nthe scale of spontaneous symmetry breaking (as in the NDA rules), and the coupling is then proportional to the\nexplicit breaking encoded in the masses of the bosons and fermions in the associated dilatation current.\nProvided the Higgs be perturbative (i. e. light), most of the main calculations needed to discuss its experimental\nsearches are done at tree-level, while higher-order operators generated by new physics are going to give subleading\ncorrections. For instance, the decay rate into two SM fermions ψ is\nΓ[h → ψψ] ≃\n\nN m2ψ mh\n,\n2\n8πvW\n\n(129)\n\nwhere N = 3 for quarks and N = 1 for leptons. Which means that whatever the theory responsible for electro-weak\nsymmetry breaking, if it has a light dilaton in the spectrum, not only its quantum numbers, but also most of its\ncoupling, and all of its phenomenology, are going to be identical to the higgs h of the MSM. Only at higher energies,\nand/or measuring very precisely the subleading corrections, one might be able to tell the difference. Which implies that\nknowing if a walking technicolor has or not a light dilaton in the spectrum is of very direct and immediate relevance\nfor the LHC program. Notice also that such a state would then enter directly into the arguments about perturbative\nunitarity deduced from the W W scattering, and of course enter logarithmically in the oblique parameters, precisely\nin the same way as the Higgs field h does. This is another example of the fact that this non-QCD-like technicolor\nmodels might be more difficult to distinguish from weakly-coupled extensions of the SM than naively expected (see a\nrelated comment in the subsection devoted to the techni-rho mesons).\n\n\f35\nThe reason why one might think that a walking technicolor theory might have a light dilaton in the spectrum is\nnot immediately apparent. For instance, in QCD it is known that such a state does not exist. One might associate it\nwith the σ. But then again, the σ is not light, it is certainly not weakly-coupled, and it has a possibly complicated\ninternal structure, consisting of an admixture of quark and pion bound states, implying that its couplings are very\nnon-trivial. Also, it is somewhat difficult to argue that there is a sense in which at the ΛQCD scale there is dilatation\nsymmetry, and hence nothing to spontaneously break in order to produce a dilaton.\nBy contrast, the basic idea of walking technicolor is that the theory be approximately scale invariant in the IR.\nBarring the problem that a sensible definition of the word approximate would be needed, this is clearly suggesting\nthat one cannot exclude the presence of such a light dilaton, provided the dynamics be very different from QCD-like.\nMaking this statement quantitative is very hard. If the underlying dynamics is some form of gauge theory, the explicit\nbreaking of conformal symmetry is presumably related to the coefficient of the β-function of the gauge coupling being\nparametrically smaller than the coupling itself. But also this is a confusing and ambiguous statement: at what scale,\nand in what scheme, should one calculate this coefficient, and hence the resulting mass for the dilaton? One might\nsay that if the gauge coupling runs as illustrated in the third panel in Fig. 1, then it is reasonable to believe that\nconformal symmetry be broken spontaneously at the lower end ΛIR of the plateau region, and that at that scale the\nβ function is indeed small. But then one might ask what is the effect of the lowest scale in the problem, at which the\ncoupling diverges, the theory confines, and the β-function is not small.\nAn actual calculation is needed in order to answer this question. Examples exist in the literature, done using the\nmost diverse approaches in order to model the strongly-coupled sector and gain in calculability, and date back to the\nearly days of walking technicolor [45]. Unfortunately, they disagree with each other. This is perhaps the biggest open\nproblem that gauge/gravity dualities might help to solve [21, 46, 47], and I will spend more time on it later in these\nlectures.\nE.\n\nSummary: questions on walking TC.\n\nWalking technicolor provides a very natural solution to the big hierarchy problem, and is a way of softening the\nlittle hierarchy problem of more generic technicolor models. On the basis of what we said so far in this lectures, we\ncan produce a list of open problems that we want to address using holography and gauge/gravity correspondence:\ni) what is the field content of a model yielding walking dynamics, in particular what are the conditions of the\nnumber of colors, type of representation, number of flavor,\nii) what are the values of the dynamically generated scales, in particular the value of the chiral condensate, and\nhow are they related to each other and to the quantities in i),\niii) what are the anomalous dimensions, and in particular how do they depend parametrically on the choice of the\ntheory and on the scale at which they are evaluated,\niv) what are the oblique precision parameters, how do they depend on the details in point i), on the scales at point\nii) and iii) and on the specific way in which the technicolor sector is coupled to the SM,\nv) what are the coefficients of the chiral Lagrangian, including those that correct the cubic and quartic interactions\namong gauge bosons,\nvi) what does a fully realistic ETC theory look like, what is its field content, what are the ETC scales, what is the\npattern of symmetry breaking, and how can one effectively describe the dynamics of tumbling,\nvii) what are the masses of the fermions, as a function of the points vi) and iii),\nviii) what are the contribution to FCNC from operators generated by ETC, and how do they depend on the properties\nof the theory in point vi),\nix) what is the spectrum of the spin-1 mesons, and what are their couplings and decay constants, how do they\ndepend on i) and ii), and what is the precise relation to the oblique parameters in point iv),\nx) what are the global symmetries of the TC theory at the electro-weak scale, and what is the spectrum of PNGBs\nas a function of the operators generated by ETC and of the anomalous dimensions,\nxi) is there a light dilaton, and what are its mass and couplings as a function of i) and ii),\nxii) what is the W W scattering amplitude going to look like at large energies, what are the intermediate states that\nare relevant from points ix) x) and xi), and what is its analytical structure.\n\n\f36\nThis is an incomplete set of questions. All of them are very difficult, and all of them ultimately need to be answered\nin order to ask the most fundamental questions:\nAre there calculable models of dynamical electro-weak symmetry breaking that are compatible with all experimental\ndata? If so, how do we discover them and characterize them at the LHC?\nThe main aim of these lecture notes is to highlight the fact that gauge/gravity dualities represent one very powerful\ntool for such a program of investigation of strong dynamics to be carried out, and the next sections will be devoted to\nthis topic. The reader should be aware of the fact that other approaches exist. In very recent years a lot of resources\nhave been focused on trying to answer these questions (in particular those at point i) with the non-perturbative\ninstruments of lattice field theory. The mere number of papers that appeared recently on the topic gives a measure\nof how interesting, and difficult, these studies are. An incomplete list includes [48].\n\n\f37\nIII.\n\nHOLOGRAPHIC TECHNICOLOR: BOTTOM-UP APPROACH.\n\nAs we have seen, hidden local symmetry is useful, but affected by two related problems: the calculability is limited\nboth by the proliferation of independent parameters when including more states, and by the fact that some couplings\ntake large values, making the perturbative expansion questionable. One basic idea behind the bottom-up holographic\napproach is to keep the successes of hidden local symmetry (particularly, its simplicity) and overcome these main\ndifficulties by replacing the chain of links and sites with an extra-dimension [18, 19]. A background metric inspired by\nthe AdS/CFT correspondence is assumed, which is justified by the assumption of walking, and the effective couplings\nare kept small by the assumption that the model hence obtained be dual to a large-Nc theory. The gravity formalism\ncan be used because a large value for the large 't Hooft coupling λ = g 2 Nc is assumed for the dual field theory.\nThis idea has been used also in order to model low-energy QCD [49]. The three assumptions about Nc , λ and\nthe AdS background are hardly justified in this case. Yet, many interesting and useful results have been obtained,\nand one can argue that they are in acceptable agreement with actual QCD data, at least in a variety of interesting\nexamples.\nI will not review all the literature on the subject, which is vast, but focus on one very specific example [18]. The\nmain result that I want to convince the reader of is that a sensible description of all the physics of electro-weak gauge\nbosons can be obtained in which only very few parameters with very specific meaning are needed, and that it is\npossible to choose such parameters in a way that renders Ŝ compatible with the bounds. Once this is done, this set\nup allows to make actual predictions for LHC signatures. The example discussed has the only special feature of being\nvery minimal. In the end, it contains only one more parameter than the MSM, but describes an infinite number of\nnew resonances. Infinite numbers of non-minimal variations of this set-up can be formulated, and many have been\nexplored in the literature.\nA.\n\nHolography and AdS/TC: a simple model.\n1.\n\nThe Model.\n\nA summary of the minimal requirements for a viable model of dynamical EWSB in four dimensions allows to identify\nthe properties of the five-dimensional dual description. Many of these assumptions can in principle be relaxed, but\nthey constitute a simple and natural place to start. There must be a new strong sector possessing the global symmetry\nSU (2)L × U (1)Y of the standard model. The new interaction must confine, and a symmetry breaking condensate\nmust form. The (weak) gauging of the global symmetry of the strong sector gives the massive SM gauge bosons and\nthe photon. The strong sector has to be close to conformal over the energy range between the electro-weak scale and a\nmuch larger ETC scale. Large anomalous dimensions are present so that the chiral condensate has scaling dimension\nvery different from d = 3 (for concreteness, here d = 2). All the SM fermions are elementary, and do not carry\nquantum numbers of the new strong interactions, hence ensuring universality of the electro-weak gauge coupling.\nThe (quasi-conformal) energy window just above the electro-weak scale is described by a slice of AdS5 , i.e. by a\nfive-dimensional space-time containing a warped gravity background given by the metric:\n\u0012 \u00132\n\u0001\nL\n2\nds =\n(130)\nημν dxμ dxν − dz 2 ,\nz\n\nwhere xμ are four-dimensional coordinates, ημν the Minkoski metric with signature (+, −, −, −), and z is the (warped)\nextra-dimension. The dimensionful parameter L is the AdS5 curvature, and sets the overall scale of the model.\nConformal symmetry is broken by the boundaries\nL0 < z < L1 ,\n\n(131)\n\nwith L0 > L, where L0 and L1 correspond to the UV and IR cut-offs of the conformal theory, i. e. to the ETC scale\nand to the confinement scale respectively.\nThe field content in the bulk of the five-dimensional model consists of a complex scalar Φ transforming as a (2, 1/2)\nof the gauged SU (2)L × U (1)Y . The generator of SU (2)L are T a = τ a /2 with τ a the Pauli matrices.\nThe bulk action for Φ and the gauge bosons W = W a T a of SU (2)L and B of U (1)Y is\nZ\nZ L1 √ h\n\u0001\ndz G\nS5 =\nd4 x\nGMN (DM Φ)† DN Φ − M 2 |Φ|2\nL0\n\u0015\n\u0013\n\u0012\n1\n1\n(132)\n− Tr (WMN WRS ) − BMN BRS GMR GN S ,\n2\n4\n\n\f38\nand the boundary terms are\nZ\nZ\n4\nS4 =\nd x\n\nL1\n\n√\ndz G\n\n\u0015\n1\n1\nδ(z − L0 ) D − Tr [Wμν Wρσ ] − Bμν Bρσ Gμρ Gνσ\n2\n4\nL0\n\u0012\n\u0013\n\u0013 )\n\u0012\n2 2\n2 2\nv\nv\n−δ(z − L0 ) 2λ0 |Φ|2 − 0\n,\n−δ(z − L1 ) 2λ1 |Φ|2 − 1\n2\n2\n\u001a\n\n\u0014\n\n(133)\n\nwhere the covariant derivative is given by\n1\nDM Φ = ∂M Φ + i(gWM Φ + g ′ BM Φ) ,\n2\nand where the Yang-Mills action is written in terms of the antisymmetric field-strength tensors Wμν and Bμν . In the\naction, M 2 is a bulk mass term for the scalar, and g and g ′ are the (dimensionful) gauge couplings in five-dimensions.\nThe coefficient D will be fixed later.\nWithout loss of generality, the VEV of the Φ field can be written as\n\u0012 \u0013\nv(z) 0\n√\n.\n(134)\nhΦi =\n1\n2\nThe localized potentials enforce a non-vanishing v(z) that induces electro-weak symmetry breaking. For M 2 = −4/L2,\nin the λi → +∞ limit, (in which the transverse degrees of freedom become infinitely massive and decouple from the\nspectrum) the bulk equation of the motion\n\u0012 3\n\u0013\nL\nL5\n∂z\n∂\nv\n− 5 M 2v = 0 ,\n(135)\nz\n3\nz\nz\nadmits the solution\nv(z) =\n\nv0\nv1 2\nz = 2 z2 ,\n2\nL1\nL0\n\n(136)\n\nby appropriately choosing v0 /v1 = L20 /L21 , so as to describe a chiral condensate of dimension d = 2.\nThe localized kinetic terms for the gauge bosons are required by holographic renormalization [50] in order to remove\na logarithmic divergence, and retain finite SM gauge couplings in the L0 → 0 limit, renormalizing the otherwise\ndivergent kinetic terms of the SM gauge bosons. This procedure ensures that the SM gauge couplings be independent\nof the strength of the bulk coupling, and that all physical quantities be independent of any UV-sensitive details, such\nas the precise value of L0 , or the structure of the UV boundary.\n2.\n\nElectro-weak Phenomenology.\n\nFocusing on the spin-1 sector, and defining\nVM ≡\nAM ≡\n\ng ′ W 3 M + gB M\np\n,\ng2 + g′ 2\n\ngW 3 M − g ′ B M\np\n,\ng2 + g′ 2\n\n(137)\n(138)\n\none obtains the electro-weak equivalent of the vector and axial-vector sectors of the chiral Lagrangian. In particular\nthe massless mode of V μ is the photon, and the lightest mode of Aμ is the Z boson.\nAfter Fourier transformation in the four-dimensional Minkowski coordinates one can write\nAμ (q, z) ≡ Aμ (q)vZ (z, q) ,\n\n(139)\n\np\nand analogous for W1,2 and V , where q = q 2 is the four-dimensional momentum. In the limit in which one neglects\nthe five-dimensional gauge coupling, and hence cubic and quartic self-interactions, the bulk equations are:\n∂z\n\nL\nL\n∂z vi − μ4i Lzvi = −q 2 vi ,\nz\nz\n\n(140)\n\n\f39\nwhere i = V, Z, W , with μV = 0, μ4W = 1/4g 2v20 /L2 and μ4Z = 1/4(g 2 + g ′2 )v20 /L2 . This approximation\nand\n√\n√ the\napproximation of restricting all the analysis at the tree-level are valid provided the effective couplings g/ L, g ′ / L <\n∼\nO(1), which corresponds to the large-N limit.\nThe bulk equations can be solved exactly. Choosing Neumann boundary conditions in the IR (which are compatible\nwith the gauge symmetry) leaves a non-vanishing UV-localized action, that can be interpreted in terms of yielding\nthe vacuum polarizations for the gauge bosons in the form\n1\nL = − Aiμ πi,j P μν Ajν ,\n2\n\n(141)\n\nwhere P μν ≡ η μν − q μ q ν /q 2 , and where i = B, W a . The matrix of the vacuum polarizations πi,j (q 2 ) of the SM gauge\nbosons results in\n∂z vW 2\nπ+\n(q , L0 ) ,\n= Dq 2 +\n2\nNW\nvW\n\nπBB\n∂z vV 2\ng ′ 2 ∂z vZ 2\ng2\n(q\n,\nL\n)\n+\n(q , L0 ) ,\n= Dq 2 + 2\n0\n2\nNB\ng + g ′ 2 vV\ng 2 + g ′ 2 vZ\n\u0012\n\u0013\ngg ′\n∂z vV 2\n∂z vZ 2\nπW B\n= 2\n(q , L0 ) −\n(q , L0 ) ,\nNW NB\ng + g′ 2\nvV\nvZ\nπW W\n∂z vZ 2\ng2\ng ′ 2 ∂z vV 2\n2\n(q\n,\nL\n)\n+\n(q , L0 ) .\n=\nDq\n+\n0\n2\nNW\ng 2 + g ′ 2 vV\ng 2 + g ′ 2 vZ\n\n(142)\n(143)\n(144)\n(145)\n\nThe precision electro-weak parameters have been defined earlier, in terms of the vacuum polarizations, with the\n′\n′\nconvention of choosing the normalizations Ni of the fields so that πBB\n(0) = π+\n(0) = 1.\nBy taking for simplicity L0 → L, and by expanding for small L0 → 0, one has [18]:\n\u0012\n\u0013\u0013\n\u0012\nπ Y0 (qL1 )\nqL0\n∂z vV 2\n2\n,\n(q , L0 ) = q L0\n− γE + ln\nvV\n2 J0 (qL1 )\n2\n\u0014\n\u0013\n\u0013\u0015\u001b\n\u001a\n\u0012\n\u0012\n∂z vZ 2\n1\nc2\nq2\nq2\n,\n(q , L0 ) = L0 μ2Z − q 2 γE + ln(μZ L0 ) + ψ − 2 −\nΓ − 2\nvZ\n2\n4μZ\n2c1\n4μZ\nwhere, having imposed Neumann boundary conditions in the IR,\n\u0012\n\u0013\n\u0012 2\n\u0013\nq2\nq\n2 2\nc1 = 2L −1 + 2 , μ2Z L21 + L\n,\n,\n−1,\nμ\nL\nZ 1\n4μZ\n4μ2Z\n\u0013\n\u0012\n\u0013\n\u0012\nq2\nq2\nq2\nc2 = −U − 2 , 0, μ2Z L21 + 2 U 1 − 2 , 1, μ2Z L21 ,\n4μZ\n2μZ\n4μZ\n\n(146)\n(147)\n\n(148)\n(149)\n\nand where ∂z vW /vW = ∂z vZ /vZ (μZ → μW ).\nBounds on oblique precision parameters require that the symmetry-breaking parameter (μZ here) be somewhat\nsmall compared to the confinement scale (L1 ). One can see that this must be the case directly by noticing that\n∂z vZ\nμ2 L 2\n(0, L0 ) = −L0 μ2Z tanh Z 1 ,\nvZ\n2\n\n(150)\n\nthat μ2Z ∝ g, and that hence one must require μ2Z L21 ≪ 1, otherwise the mass of the gauge bosons would be proportional\nto g, instead of g 2 ! Assuming hence that μ2Z L21 ≪ 1, we can expand also in μ2Z L21 , and as a result\n\u0012\n\u0013\n∂z vv 2\nL1\n2\n4\n(q , L0 ) ≃ L0 q log\n+ O(q ) ,\n(151)\nvv\nL0\n\u0012\n\u0013\n∂z vZ 2\nμ4 L 2\n3\nL1\n(q , L0 ) ≃ L0 − Z 1 − μ4Z L41 q 2 + q 2 log\n+ O(q 4 ) .\n(152)\nvZ\n2\n16\nL0\nThe localized counter-term\n\u0013\n\u0012\n1\nL0\n+ 2\nD = L0 ln\nL1\nε\n\n(153)\n\n\f40\ncancels the logarithmic divergences, and choosing a universal normalization N 2 = ε2 /L0 all the dependence on L0\ndisappears (at leading order in L0 ), the limit L0 → 0 can be taken, and the model is renormalized, with finite\n(′) 2\n(dimensionless) SM couplings g4 = ε2 g (′) 2 /L. The resulting vacuum polarizations (truncating at the order needed\nto extract Ŝ) are\n\nπ+ =\nπBB =\nπW B =\nπW W =\n\n\u0013\n\u0012\n1\n3 2\n,\nq +ε g κ − 2 − q\n2L1 16\n\u0012\n\u0013\n1\n3\nq 2 + ε2 g ′ 2 κ − 2 − q 2 ,\n2L1 16\n\u0013\n\u0012\n3 2\n1\n2\n′\n,\n−ε gg κ − 2 − q\n2L\n16\n\u0012 1\n\u0013\n1\n3\nq 2 + ε2 g 2 κ − 2 − q 2 ,\n2L1 16\n2\n\n2 2\n\n(154)\n(155)\n(156)\n(157)\n\nwhere for notational simplicity the symmetry-breaking parameter κ = μ4W L41 /g 2 has been introduced, and only terms\nat the leading order in κ have been retained. Notice that the normalization of the π ′ terms are not identically 1, there\nare small corrections proportional to κ. One should redefine (in a SU (2) × U (1) invariant way) the normalization of\nthe gauge bosons, in such a way to eliminate this. But because κ is very small anyhow, this process just makes the\nalgebra heavier, without changing the final results, and hence I am not going to do so.\nFrom these expressions, one reads that, at the leading order in κ,\n2\nMW\n≃\n\n1 2 2 1\nε g κ 2,\n2\nL1\n\n(158)\n\nand hence that\nŜ =\n\n3 2 2\n3 2 2\nε g κ ≃ MW\nL1 .\n16\n8\n\n(159)\n\n2\n2\nNotice that because Mρ ∝ L−1\n1 , the expression for Ŝ agrees with usual expectations yielding Ŝ ∝ MW /Mρ . In order\nto compute T̂ one has to carefully include sub-leading corrections (in κ) in the symmetry-breaking parameters. In\nparticular, the fact derived here that π+ = πW W is not an exact result, but holds only at the leading order in the\nexpansion in κ. The approximations made are precise enough only for Ŝ. A complete treatment of all precision\nparameters can be found elsewhere [18], and goes beyond our present scope.\nWe can take as indicative of the experimentally allowed range (at the 3σ level): Ŝexp = (−0.9 ± 3.9) × 10−3 from [9].\nThese bounds are extrapolated to the case of a Higgs boson with mass of 800 GeV. Form the approximate expression\nfor Ŝ comes the limit on the confinement scale L1 of the model:\n\n1\nL21 <\n∼ (900 GeV)2 .\n3.\n\n(160)\n\nLHC phenomenology\n\nIn order to talk about phenomenology, one has to talk about the spectrum of spin-1 states first. Because the precision\nparameters can agree with the data only provided κ ≪ 1, while the SM gauge couplings are g42 = ε2 g 2 /L ∼ O(1), this\nmeans that the splitting between vector and axial-vector states is going to be very suppressed. Hence, it suffices to\nconsider the spectrum of the excited states of the photon, by reading it from\n\u0013\n\u0012\n∂z vV 2\n2\n2\n(q , L0 )\n(161)\nπV = N Dq +\nvV\n\u0013\u0015\n\u0014\n\u0012\nqL1\nπ Y0 (qL1 )\n,\n(162)\n− γE − ln\n≃ q2 1 + ε\n2 J0 (qL1 )\n2\nand this will give a good approximation for the spectrum also of the other states (the excitations of the Z and W\nmesons).\n\n\f41\nOne might be tempted to think that the spectrum of heavy states be given by the zeros of the Bessel J0 (qL1 ). This\nis a good approximation for the zeros of πV (q 2 ) when ε ≪ 1, otherwise it is not. Unfortunately, one cannot make\nthe assumption ε ≪ 1. For instance, one sees that (at large-q) πV ∼ εq 2 ln q which, if matched brutally to the OPE\n2\nof large-Nc QCD-like theory suggests that ε ∼ Nc /(12π\n). Most importantly, the large-Nc regime is entered when\n√\nε ∼ O(1) or larger, as seen by the fact that g4 = εg/ L ∼ εgρ . Indeed, because g4√∼ O(1), and because we are using\nthe tree-level (supergravity) approximation, at most one can have gρ ∼ O(1) ∝ 1/ Nc .\nFinding the actual spectrum requires some numerical work. The result of which is that Mρ L1 ∼ 2.4 − 5.5, where\nthe upper part of the interval is obtained for large values of ε. Hence the bound on Mρ turns out to be quite stringent,\nand depending on how small choices of ε we allow for, at best Mρ > 2.2 TeV, possibly another factor of 2 higher for\nlarge values of ε. This is a problem: these masses are hard to discover at the LHC. In particular, the second set of\nresonances will be roughly Mρ′ ≃ Mρ + π/L1 , which for L−1\n1 ∼ 1 TeV means a 3 TeV gap. This almost completely\nexcludes the possibility that LHC may observe several copies, with heavier masses, of this resonance, which would be\nthe unmistakable signature of a strongly-coupled model (equivalently, these would be the Kaluza-Klein excitation of\na compact extra-dimensions).\nThere are hence two important open problems: under what circumstances can one see the techni-rho mesons at\nthe LHC? If the techni-rho is discovered, how can one show that it is related to a strongly-coupled sector? There\nare many studies of this type of LHC searches, which depend very strongly on the precise details of the model (in\nparticular, enhancement of the production cross-section is possible if the top quark is playing a role in the new strong\ndynamics). It goes far beyond the scope of these lectures to give a full account on the topic. I want here just to signal\ntwo interesting facts that might happen if the model is actually well-described by the large-Nc expectations.\n\nFIG. 6: LHC exclusion/discovery reach from pp → μ+ μ− + X as a function of Mρ = M ≃ Mγ ′ ≃ MW ′ ≃ MZ ′ and of R\ndefined in the text. The curves are obtained by requiring 10 events, for integrated luminosity of 1, 3, 10, 30, 100 fb−1 . The\ndarkest region is excluded by indirect limits from Ŝ < 3 × 10−3 . The light-grey shaded region is allowed by precision data only\nfor ε < 0.5, so that the dominant decay mode of the techni-rho is into longitudinally polarized SM gauge bosons (and hence the\nsignal in SM fermions strongly attenuated, or invisible) and the large-N approximations used in the analysis performed here\ndo not hold.\n\n√\nUsing the result highlighted earlier on ε = g4 L/g ≃ Nc /(12π 2 ), the comments we made in discussing the phenomenology of techni-rho mesons show that for values of ε >\n∼ O(1), the most important coupling of the techni-rho is\nto the SM fermions, not to the pions. This can be checked numerically to hold by explicitly evaluating the partial\nwidth Γ[ρ → W W ] from the five-dimensional set-up [18]. We also stressed that only for ε >\n∼ O(1) the calculations\nperformed up to now are trustable. Hence, in the regime of validity of what we did in the previous subsection, the\ndominant decay mode of the techni-rho is to SM fermions, not to W W . At least as long as we want to trust the\ncalculation of the precision parameter Ŝ.\nNotice that all of the above agrees with the large-N result that the resonances should become narrow in the limit\nin which Nc is very large, and if the electro-weak couplings are neglected the techni-rho becomes effectively stable.\nIn order to study the LHC phenomenology one can use the result on the vacuum polarizations and look at the LHC\nprocess pp → ρ → f f ̄. In respect to the decay into W W final states, this process is much cleaner at the LHC, because\nif one focuses attention of the final states involving electrons and muons, this can be reconstructed very precisely, and\n\n\f42\nthere is no missing energy.\nThe very simplest signature of the model is hence the Drell-Yan production of the heavy partners of the electroweak gauge bosons. This should be detectable as a narrow resonance in the few-TeV region of the invariant mass\ndistribution of final states with two fast leptons (muons or electrons). At the partonic level, the dominant tree-level\ncontribution can be very easily computed by simply replacing the complete propagators (inverse of the π(q 2 ) computed\nearlier) in place of the propagators of the SM gauge bosons. With one caveat: one needs to modify the propagators in\norder to include the width. Provided one is in the regime in which the decay to SM fermions dominates such width,\nand the width itself is small, one can pragmatically implement the width by replacing in the Feynman diagrams\nPγ (q 2 ) =\n\n1\n1\n,\n→ Pγ (q 2 ) =\n2\nq 2 + iǫ\nπV (q 2 ) + i 8α\n3 q + iǫ\n\n(163)\n\nand analog for the Z and W . Notice that this very simple procedure is acceptably accurate only because we assumed\nthat the SM-fermion final state dominates, and that the fermions be localize at the UV boundary. This result is\nwhat follows from taking the imaginary part of diagrams in which the five-dimensional photon receives corrections\nfrom 1-loop diagrams localized on the four-dimensional boundary. The procedure for including the width due to\nstrongly-coupled decays is ways more complicated, because not only all the gauge bosons propagate in the bulk of\nthe five-dimensions, so that the effective cubic couplings depend on complicated integrals convoluting the bulk wave\nfunctions, but also heavier resonance can decay into combinations of lower modes.\nAs long as the weak-coupling calculations are acceptably accurate, the partonic cross-section of interest is\nσ̂qq̄ (ŝ) ≡ σ(q q̄ → l+ l− ) =\n\nŝ 2 X\ne\n|GAB (ŝ)|2 ,\n48π\n\n(164)\n\nA,B\n\nwhere A, B = L, R, where ŝ = q 2 is the partonic momentum, where\nGAB (ŝ) = Q(q) Pγ (ŝ) +\n(f )\n\ngL\n\n(f )\ngR\n\n4\n(q) (l)\ng g PZ (ŝ) ,\nsin 2θW A B\n2\n\n= T 3 (f ) − Q(f ) sin2 θW ,\n\n= −Q\n\n(f )\n\n2\n\nsin θW ,\n\nand where T 3 (f ) and Q(f ) are the isospin and electric charge of the fermion f .\nFinally, the differential cross-section for the LHC process as a function of s and ŝ is\n\u0012 \u0013\n\u0012 \u0013\u0015\n\u0014\nZ\ndσ(pp → l+ l− + X)\nŝ\nŝ\n1X\n1 1 dη\nφq (η)φq̄\n+ φq̄ (η)φq\n,\n(s, ŝ) =\nσ̂qq̄ (ŝ)\ndŝ\n3 q\ns ŝ/s η\nηs\nηs\n\n(165)\n(166)\n(167)\n\n(168)\n\nwhere the functions φa (η) are the parton distribution functions\nyielding the probability of finding a parton of species\n√\na with momentum fraction η within the proton, where s = 14 TeV is the center of mass energy of the pp collision,\nand where the factor of 1/3 takes into account the average over color in the partonic initial state.\nOne can then do the exercise of using the results at the previous section to select the input parameters such as L1 ,\nand of computing the number of events expected at the LHC as a function of the machine parameters (luminosity and\nenergy) and of the relevant parameters in the model, namely the mass of the techni-rho Mρ and its coupling to the\nSM fermions relative to the coupling of the SM gauge bosons R (which generalizes the factor e2 fρ2 /Mρ2 in Eq.(114)),\nwhich is a complicated function of ε.\nThe results are plotted in Fig. 6. A few words of comment. The dark shaded region is excluded by the bound on Ŝ.\nNotice that the actual exclusion is a function not only of the mass of the techni-rho mesons, but also of the coupling\nR, because the latter depends on ε, and we have seen that there is a non-trivial functional dependence between Mρ ,\nL1 and ε. The region at small R is the region in which neglecting the contribution of ρ → W W to the width and\ndecay rates of the techni-rho is not justified. In this region, this signal is actually very suppressed in comparison to\nthe final state with two gauge-bosons.\nProvided ε ∼ O(1), the LHC phenomenology is very similar to what one would have in a weakly-coupled extension\nof the SM with an extra SU (2) × U (1). The four heavy gauge bosons would be almost degenerate in mass. So much\nso that it would be not possible to distinguish in the invariant-mass distribution of di-lepton final states the peaks due\nto the two neutral states. In order to see that the peak is due to more than one resonance, much more sophisticated\ndata analysis would be needed, for example looking at the forward-backward asymmetry [51].\n\n\f43\nB.\n\nFinal Remarks.\n\nThe results obtained for this simple model depend on the specific set-up, and many variations exists of the basic\nideas. Before commenting on some very interesting possibilities, it is important to stress that the way in which the\nbounds from electro-weak precision is accommodated relies on the fact that fρ and fπ have two different dynamical\norigins. To be more specific, the former is controlled by the IR boundary L1 , the latter by the value of the condensate\nv0 , which in this model are treated as independent. Both scale as fπ2 ∝ fρ2 ∝ N , but the smallness of the Ŝ parameter\nis obtained by assuming the ratio of the two be a somewhat small numerical constant. For this reason, one is allowed\nto take the large-N limit, and hence treat the spin-1 states as weakly coupled, while at the same time making their\nmasses large so that precision physics bounds do not exclude the model.\nThere is a number of possible problems arising with this approach. First, in a fully dynamical model, fπ and fρ\nwill be related, and there is no known simple example in which their ratio be parametrically small. Second (to be\ntaken with all the caveats we discussed earlier on) if the mass of the techni-rho mesons is in the few TeV range, it is\nnot possible to show explicitly that the elastic scattering amplitude can be treated perturbatively and stays below the\nunitarity bounds all the way up to this large mass scale. As such, at least some part of the theory must be stronglycoupled, which raises questions about the tree-level calculations been done. But remember how we stressed that the\nW W scattering amplitude is a particularly bad observable, much more sensitive to the details of the strongly-coupled\npart of the symmetry-breaking sector than the oblique parameters.\nFinally, if one takes literally the relation ε ∼ Nc /(12π 2 ), values of ε ∼ O(1) require very large values of Nc . This\nmeans that a large number of fermions in the dual sector is coupled to the electro-weak gauge bosons, making the\nSU (2) gauge coupling blow-up at relatively small scales, not far above the scale set by L1 . This problem is indirectly\nrelated to the perturbative-unitarity bound, and also to the fact that if one looks at the O(q 4 ) precision parameter W\nand Y one finds that they grow with ε. Yet, this model is simple, calculations are doable, the results can be reconciled\nwith precision electro-weak tests, and the model is testable a the LHC, which is ultimately the most important thing.\nIf such a signature shows in the data, there will be plenty of time to go back to this model and refine its study,\naddressing the objections raised here.\nInfinite number of variations of this model are possible. Here is a brief and non-exhaustive list of things that can\nbe done (and have been done).\n• Custodial symmetry can be implemented, by gauging a complete SU (2) × SU (2) in the bulk, and then arranging\nfor its breaking via some mechanism localized in the UV, in such a way as to recover a spectrum in which only\nfour gauge bosons are light, but in which T̂ is small.\n• The bulk profile of the condensate can be changed. The extreme case is the higgless extra-dimension set-up, in\nwhich the field Φ is exactly localized on the IR boundary, effectively modifying the IR boundary conditions [52].\n• More condensates can be present. In particular one may envision the case in which the bulk scalars affect also the\ndynamics of the vectorial five-dimensional fields, not only the axial-vectorial fields. Also, phenomenologically\nmore realistic models of confinement can be obtained, by introducing modifications of the background AdS\nmetric in the deep IR [19, 53].\n• A larger symmetry can be gauged in the bulk, hence allowing the low energy spectrum to contain also pseudoGoldstone bosons. An extreme variation of this model is dual to composite Higgs models [28].\n• The fermions can be allowed to propagate in the bulk. In particular the third-family, such as the top. In this\nway it is possible to enhance the large mass of the top [41].\nThis huge freedom shows one of the limitations of these models: because they are not fully dynamical, the description\nthey provide has a limited predictive power. However, for many practical purposes they are very effective: they allow\nto relate in sensible and predictive ways the results from precision studies of the electro-weak gauge bosons to the\nspectrum, couplings and LHC phenomenology of the new particles they predict (new vector states, new axial-vector\nstates, new pseudo-Goldstone bosons, . . . ). These models are hence very useful, in the dawn of the LHC era, because\nthey give us a plethora of new signatures to look for, within calculable frameworks in which the comparison to the\ndata can be made quantitative, cross-relations between observables exist, and favorable regions of parameter space\ncan be identified and tested experimentally.\n\n\f44\nIV.\n\nHOLOGRAPHIC TECHNICOLOR: TOP-DOWN APPROACH.\nA.\n\nWhy a full string-theory model?\n\nWe have seen that, because of the strong coupling, four-dimensional techniques are limited when applied to technicolor models. We have also seen that five-dimensional models provide a substantial improvement over hidden local\nsymmetry, incorporating some of its ideas and features, but reducing drastically the number of parameters needed\nto describe the spectrum of composite states, and hence allowing to compute the precision parameters and relate\nthem to measurable quantities, such as masses and decay constants of spin-1 resonances. With the LHC approaching, this framework provides a wonderful opportunity to study the phenomenology of the lightest resonances of a\nstrongly-coupled model, relating their masses and couplings to the precision measurements performed in the last two\ndecades. However, the bottom-up approach has itself a limited power: it is based on assuming that the answer to\nmany of the questions highlighted in subsection II E is known a priori, and then uses these answers in order to build\nthe five-dimensional action.\nTo be more specific, let us look back at each of the questions and see what can be said from the bottom-up approach.\ni) The bottom-up approach describes only bound states, and their low-energy properties, hence it has only indirect\ninformation about the fundamental theory (its gauge group and field content are not known).\nii) The dynamical scales are put in by hand, choosing the position of the boundaries, the form of the metric, the\npresence of condensates.\niii) The anomalous dimensions are chosen by hand, they are completely free parameters, bounded only by very\ngeneral considerations.\niv) The precision parameter can be computed. However, they still depend on how the light SM fermions are coupled\nto the strong sector, and a certain amount of freedom is left.\nv) Computing the coefficients of the chiral Lagrangian is possible, as a function of what said in ii). The only\nlimitation being that one is using large-N expansions.\nvi,vii,viii) This approach has little to say about ETC, the fermion mass hierarchies are controlled by free parameters, not\nby the underlying dynamics.\nix) One can derive relations between the spectrum and couplings of spin-1 states, as a function of the choices in\npoints ii) and iii).\nx) The global symmetries are chosen by hand, and their breaking pattern too, there is no real sense in which\nsymmetry-breaking arises dynamically within this framework.\nxi) Determining under what conditions a light dilaton is part of the spectrum requires a dynamical study of the\nunderlying theory, with fully back-reacted background geometry.\nxii) Perturbative unitarity is in part connected with sum rules on the couplings of spin-1 fields, yet the dominant\ncontributions from the non-decoupled scalar sector is missing and uncalculable.\nUltimately, the bottom-up approach yields a very major improvement over hidden local symmetry, and is a very\nuseful and practical way of constructing models that are testable at the LHC. But it cannot answer to those most\nfundamental questions regarding dynamical scales, spectrum and symmetries that are intrinsically dependent on the\nstrong dynamics. For this reason, it is important to try and study the extra-dimension dual of the full theory, in a\ncontext in which the background and all the condensates can be computed from a fundamental action. This is the\ntopic of this last section.\n1.\n\nFrom N = 4 towards walking technicolor.\n\nThe most celebrated example of gauge/gravity duality is the conjectured correspondence between four-dimensional,\nsuperconformal N = 4 Yang-Mills theory with SU (Nc ) gauge group and Type IIB string theory on a background\nwith AdS5 × S 5 geometry [1]. The SO(4, 2) isometry group of the AdS space is related to the four-dimensional\nconformal group, while the SO(6) symmetry of the internal S 5 space is related to the SU (4)R symmetry of N = 4.\nThe value of Nc is related to the flux of the RR F5 form of type-IIB. One important reason why this relation is\n\n\f45\nvery useful is that taking the large-Nc limit, at fixed (but large!) 't Hooft coupling λ = g 2 Nc one enters the regime\nin which the dual description reduces to a weakly-coupled supergravity theory in 10 dimensions. Hence, very nontrivial calculations involving strong dynamics in the gauge theory can be rephrased in terms of a more accessible\nweakly-coupled gravitational system.\nFor phenomenological purposes, the AdS5 × S 5 background has ways too much symmetry: realistic models of\nnature are neither conformal, nor do they have so much supersymmetry. In the last ten years, the same idea of\nlooking for weakly-coupled duals to strongly coupled four-dimensional theories has been pushed in the direction of\nlooking for sensible supergravity backgrounds which depart from the AdS geometry, and in which a lesser degree of\nsupersymmetry is encoded in a less symmetric structure of the internal five-dimensional manifold. Very interesting\nmodels exist, proposing for instance backgrounds with N = 1 supersymmetry (such as [54, 55]), or no supersymmetry\nat all [56, 57], in which the geometry is far away from AdS, and describes the dual of a theory in which all the\ncouplings run. There also exist 10-dimensional models where the geometry is well approximated by an AdS space\nin the far UV and by a different AdS geometry deep in the IR (at large and small values of the radial coordinate,\nrespectively). These models provide a description of a four-dimensional theory which flows from a UV fixed-point to\nan IR fixed point [58].\nMany very interesting aspects of strongly-coupled field theories can be studied using the techniques of gauge/gravity\ndualities. The physics near fixed points (in particular, the calculation of anomalous dimensions) can be studied\nquantitatively. Correlation-functions can be computed. Certain RG flows can be studied in details. New and effective\nway of describing confinement and the formation of symmetry-breaking condensates exist. A huge amount of formal\nwork has been done in order to put all of these ideas on firm grounds, by producing rigorous prescriptions for\nperforming the calculation of physical quantities of interest in the dual field theory starting from the supergravity (or\nsuperstring) framework (for instance, holographic renormalization is a precise prescription for computing correlation\nfunctions of local operators [50], while the use of probe-strings provides a tool for the calculation of the Wilson loops,\nthat I will discuss in some detail later).\nThe reader will immediately realize that many of these observations are (in subtle ways) related to the very large\nbody of very hard field theory questions that emerged in the context of dynamical electro-weak symmetry breaking in\nthe first two sections of these lecture notes. Hence, it is very natural to try and reformulate some of those questions\nin terms of dual theories, and look for the answers in this (weakly-coupled) context.\nIn a perfect world, one might even hope to rewrite the whole theory of WTC/ETC in terms of its dual 10dimensional description. This putative theory should be asymptotically AdS, hence ensuring the UV-completeness\nof the symmetry-breaking sector of the SM, which would approach a fixed point (not necessarily weakly coupled) in\nthe UV. Relevant deformations would cause the theory to flow away from the UV fixed point, and undergo a set of\nsymmetry-breaking transitions (tumbling), effectively reducing the gauge group of the dual ETC theory down to TC,\nand in the process producing all the four-fermion operators needed to generate the SM fermion masses 10 . At the end\nof this tumbling process, one should find that the supergravity background has a geometry which is approximately\nAdS, providing a dual description of walking, and could compute all the anomalous dimensions, and the running of\nthe aforementioned higher-order operators, hopefully showing that enhancement factors are generated along the lines\nof what we discussed in the second section. This geometry should also have a global symmetry containing the SM\nSU (2)L × U (1)Y gauge group. After walking for a while, the dual supergravity geometry should substantially deviate\nfrom AdS, to signify the fact that the IR fixed point the theory was approaching is only approximate. At low energies\na set of condensates should form, signaled by the breaking of the internal global symmetry, which corresponds to\nEWSB in the dual theory. Finally, there should be an end of space in the radial direction in the IR, and the properties\nof the geometry near this end of space should be healthy enough to allow for a sensible interpretation of it in terms of\nconfinement. The weak gauging of the SU (2)L × U (1)Y subgroup would produce the massive gauge bosons W and Z,\nand the presence of higher-order operators enhanced by walking produce the SM fermion masses, but not unacceptably\nlarge new sources of FCNC transitions. In principle, given such a complete theory one would be able to compute all\npossible observables of relevance for phenomenology: spectra, couplings, scattering amplitudes, production and decay\nrates of all the possible composite objects in the theory, and their contribution to precision electro-weak parameters\nand FCNC transitions.\nOf course, the real world is far from perfect: such a construction does not exist (yet), and much of what I wrote\nin the previous paragraph is wishful thinking, with limited scientific support. But encouraging steps in this direction\nhave been taken [20–22, 79]. In this final section, I spend some time working out in some details a few examples of\nthese steps. The discussion is far from systematic and pedagogical. The reader is assumed to be familiar with the\n\n10\n\nSomething vaguely reminiscent of this scenario exists in the supergravity context [55, 71], although the superficial similarities between\ntumbling ETC and the cascade are to very large extent overshadowed by the important differences.\n\n\f46\nbasic ideas of gauge/gravity dualities (if you are not, a good place to start is [59]), since part of the discussion will\nbe rather technical, and limited to one very specific system, that exemplifies what can be done with these powerful\ntechniques.\nBefore beginning along these lines, a clarifying comment, anticipating some of the ideas to come. The model(s) I am\nabout to discuss are not, strictly speaking, technicolor models, because they do not implement electro-weak symmetry\nbreaking. Yet, they are used here as illustrations of what the dynamics of walking technicolor might yield, because\nthese dynamical systems are interpreted in terms of a dual four-dimensional theory that exhibits some of the features\nthat are assumed to be at the basis of walking technicolor. The notion of walking itself is a field-theory property that\nnot necessarily requires coupling to the electro-weak sector. Confinement, and the formation of symmetry-breaking\ncondensates, are well-defined concept even outside the context of electro-weak interactions. And many of the questions\nwe are interested in, when talking about strongly-coupled EWSB, can be formulated in field-theory terms that do not\nnecessarily require EWSB itself. For these reasons, the exercises we are going to do are going to teach us some very\nimportant lesson about walking technicolor, even if none of the models illustrated is the actual dual of a technicolor\nmodel.\nB.\n\nWrapped-D5 system.\n\nThe set-up we focus on is based on the geometry produced by stacking on top of each other Nc D5-branes that wrap\nan S 2 inside a CY3-fold and then taking the strongly-coupled limit of the gauge theory on this stack, in the (type-IIB)\nsupergravity approximation. We start by recalling the basic definitions that yield the general class of backgrounds\nobtained from the D5 system, which includes [54] as a very special case. Truncating type-IIB supergravity to include\nonly gravity, dilaton Φ and RR 3-form F3 the 10-dimensional action is\nZ\n√ h\n1\neφ i\n1\nSIIB =\n(169)\nd10 x −g R − (∂Φ)2 − F32 ,\nG10\n2\n12\nDefining the SU (2) left-invariant one-forms as\nω̃1 = cos ψdθ̃ + sin ψ sin θ̃dφ̃ , ω̃2 = − sin ψdθ̃ + cos ψ sin θ̃dφ̃ , ω̃3 = dψ + cos θ̃dφ̃ ,\n\n(170)\n\nand using an ansatz which assumes the functions appearing in the background depend only the radial coordinate ρ\n(but not on the Minkowski coordinates xμ nor the 5 angles θ, θ̃, φ, φ̃, ψ of the compact internal manifold) allows to\nwrite the background (in string frame) as\nds2 = α′ gs eΦ(ρ)\n\nh dx2\n\n1,3\n\nα′ gs\n\n+ e2k(ρ) dρ2 + e2h(ρ) (dθ2 + sin2 θdφ2 ) +\n\ni\n\u0001 e2k(ρ)\ne2g(ρ)\n(ω̃1 + a(ρ)dθ)2 + (ω̃2 − a(ρ) sin θdφ)2 +\n(ω̃3 + cos θdφ)2 ,\n4\"\n4\nNc\n=\n− (ω̃1 + b(ρ)dθ) ∧ (ω̃2 − b(ρ) sin θdφ) ∧ (ω̃3 + cos θdφ) +\n4\n#\n+\n\nF3\n\nb′ dρ ∧ (−dθ ∧ ω̃1 + sin θdφ ∧ ω̃2 ) + (1 − b(ρ)2 ) sin θdθ ∧ dφ ∧ ω̃3 .\n\n(171)\n\nThe full background is then determined by solving the equations of motion for the functions (a, b, Φ, g, h, k).\nThe system of BPS equations derived using this ansatz can be rearranged in a convenient form, by rewriting the\nfunctions of the background in terms of a set of functions P (ρ), Q(ρ), Y (ρ), τ (ρ), σ(ρ) as [60]\n4e2h =\n\nP 2 − Q2\nP sinh τ\n, e2g = P cosh τ − Q, e2k = 4Y, a =\n, Nc b = σ.\nP cosh τ − Q\nP cosh τ − Q\n\n(172)\n\nUsing these new variables, one can manipulate the BPS equations to obtain a single decoupled second order equation\n\n\f47\nfor P (ρ), while all other functions are obtained from P (ρ) as follows:\nQ(ρ) = (Q0 + Nc ) cosh τ + Nc (2ρ cosh τ − 1),\n1\nsinh τ (ρ) =\n, cosh τ (ρ) = coth(2ρ − 2ρˆ0 ),\nsinh(2ρ − 2ρˆ0 )\nP′\n,\nY (ρ) =\n8\ne4Φo cosh(2ρˆ0 )2\ne4Φ =\n,\n(P 2 − Q2 )Y sinh2 τ\n(2Nc ρ + Qo + Nc )\n.\nσ = tanh τ (Q + Nc ) =\nsinh(2ρ − 2ρˆ0 )\n\n(173)\n\nThe second order equation mentioned above reads\nP ′′ + P ′\n\n\u0010 P ′ + Q′\nP −Q\n\n+\n\n\u0011\nP ′ − Q′\n− 4 coth(2ρ − 2ρ̂0 ) = 0.\nP +Q\n\n(174)\n\nIn the following I will fix the integration constant Q0 = −Nc , so that no singularity appears in the function Q(ρ).\nWhen convenient, I will also choose ρ̂o = 0, together with α′ gs = 1, in order to simplify the notation.\n1.\n\nGauge coupling\n\nAs we saw, one clear signal of a walking theory is the existence of an energy range over which the β-function is\nanomalously small, and hence the gauge coupling does not run. One needs hence to relate the four dimensional gauge\ncoupling of the dual theory to quantities that are well defined in the 10-dimensional geometry. I will keep the factors\nof α′ and gs explicit, but set ρ̂o = 0 in this subsection.\nThe six-dimensional theory on the D5 branes has a 't Hooft coupling given by the dimensionful λ6 = gs α′ Nc , and\nthe supergravity limit is taken by keeping this fixed [61]. The branes wrap a small two-cycle Σ2 , so that at low\nenergies an effectively four-dimensional theory emerges. A natural way of defining its (dimensionless) gauge coupling\nis given by combining\ng42 ≡\n\ng62\n.\nV olΣ2\n\n(175)\n\nFollowing [62], that consider a five brane (in probe approximation) extended along the Minkowski directions and the\ntwo-cycle defined by\nΣ2 = [θ = θ̃, φ = 2π − φ̃, ψ = π],\n\n(176)\n\n8π 2\ne2g\nP\n= 2[e2h +\n(a − 1)2 ] = P e−τ =\n.\n2\ng4\n4\ncoth ρ\n\n(177)\n\none arrives to\n\nWith this result, together with a particular radius-energy relation, it was shown in [62] that one particular solution\nP̂ of Eq. (174) leads to reproducing the NSVZ beta function. I will sketch in part this result later on.\nBefore proceeding, four final comments are due. A technical one first. The five-branes on the submanifold R1,3 × Σ2\npreserve supersymmetry only if the probe brane is at infinite radial distance from the end of the space (i. e. when\nρ → ∞) [63]. This result is valid for the particular solution considered there and does not necessarily extend to the\nother backgrounds, because a five brane in the configuration described above does not preserve the same spinors as\nthe background itself.\nMore about the physics. One has to keep in mind that the expansion yielding the supergravity approximation\ninvolves the six-dimensional coupling g6 , and not the four-dimensional coupling defined here. When g4 becomes\nsmall (and it does in the far UV at ρ → +∞, as we will see), this does not necessarily mean that the supergravity\napproximation is breaking down, nor that perturbation theory in the dual gauge theory is useful. At large-ρ, in\na putative calculation done in terms of four-dimensional degrees of freedom, one should include a large number of\nexcited modes living on the Σ2 , and this will compensate for the small coupling of each individual one, ensuring that\nthe four-dimensional dual system is indeed strongly coupled.\n\n\f48\nThere will also be divergences at finite values of ρ. In particular at ρ = ρ̂o . This is in general problematic, because\nthe singularity might mean that unphysical results appear in various amplitudes, and ultimately the supergravity\napproximation breaks down, spoiling predictivity. However, I will concentrate on backgrounds where the only singularity is at ρ → ρ̂0 , and for which the Ricci curvature R be finite everywhere. While per se this does not ensure\nthat the background defines a fully sensible theory, a pragmatic way of testing if this is the case is to compute actual\nphysical quantities, and to check how they behave. In particular, we will see that the IR-divergence is associated with\nconfinement, via the study of Wilson loops and the related quark-antiquark potential.\nA final, more general comment. Given a walking theory, its coupling must be approximately constant over some\nenergy range. However, away from an exact fixed point, the very definition of gauge coupling is ambiguous, and\naffected by scheme-dependence. One might worry that the presence of a plateau in the gauge coupling defined here,\nespecially in considerations of all the caveats that go into its derivation, might be just a scheme-dependent artifact.\nThese arguments apply to any possible definition of gauge coupling in any theory away from the fixed points, and\nultimately derive from the fact that in a generic field theory the gauge coupling per se is not a very well defined\nobservable quantity. The fact that there are solutions in which the gauge coupling flattens at finite values has to be\nunderstood as a first indication of the fact that something very peculiar is happening to the theory. In particular, it\nindicates the existence of two possibly distinct dynamical scales at which the behavior of the theory changes drastically.\nIn order to understand how physical this is, one has to use the background to compute actual physical quantities,\n(such as scattering amplitudes or masses) and ask if they show an interesting change in behavior related to the scales\nindicated by the gauge coupling.\n2.\n\nRegular Maldacena-Nunez. Asymptotic behaviors.\n\nSolving the equation for P is not easy. As apparent, Eq. (174) is very non-linear. And potentially plagued by\npossible nasty divergences arising from the denominators. One needs to use approximate and/or numerical methods\nin order to learn about the properties of its solutions. A couple of very general results are useful in doing so.\nFirst, it is known that there exist two different classes of UV-asymptotic solutions for P valid at large-ρ [60]:\nP ∼ 2Nc ρ + O(e−4ρ ) (class I) ,\nP ∼ O(e\n\n4/3ρ\n\n) + O(e\n\n−4/3ρ\n\n) + O(e\n\n(178)\n−8/3ρ\n\n) (class II) .\n\n(179)\n\nNotice that both diverge with ρ, implying that the gauge coupling g4 is becoming small, which we already commented\nabout in the previous subsection.\nSecond, the simplest and better understood solution of Eq. (174), which is the only non-trivial exact solution known\nin closed form, is [54]\nP̂ = 2Nc ρ .\n\n(180)\n\nIt belongs to class I, and we already mentioned it earlier on. For this solution, the gauge coupling is\nλ̂ =\n\nĝ42 Nc\nNc coth ρ\ncoth ρ\n=\n.\n=\n2\n8π\n2ρ\nP̂\n\n(181)\n\n3\nln μ ,\n2\n\n(182)\n\nIdentifying\nρ =\n\nwith μ the renormalization scale in units of a reference scale, and expanding at large ρ yields\nλ̂ ≃\n\n1\n,\n3 ln μ\n\n(183)\n\nwhich agrees with Eq. (21) at asymptotically large μ, provided b0 = 3Nc , and Nf = 0 as in Super-Yang-Mills (SYM)\ntheory with SU (Nc ) gauge symmetry. This is one simple way to see that this background is related (in a non-trivial\nway) to the dual to SYM (more precise statement about the dual theory can be found in [64]).\n\n\f49\n0.25\n2\ng4\nNc\n8π 2\n\n0.20\n\n0.15\n\n0.10\n\n0.05\n\n0.00\n0\n\n2\n\n4\n\n6\n\n8\n\nρ\n\nFIG. 7: The 't Hooft coupling g42 Nc /(8π 2 ) as a function of ρ for Nc = 10, c = 100, α = 0.0005 for (iii). The red (long dashes)\ncurve is the O(c) approximation in the expansion of Eq. (184), the blue (medium dashes) line is the O(1/c) approximation, the\ngreen (short dashes) line is the O(1/c3 ) approximation, and the black (dotted) line is the numerical solution [20].\n\n1000\n\n250\n\ne2h\n\ne2g\n800\n\n200\n\n600\n\n150\n\n400\n\n100\n\n50\n\n200\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nρ\n\n140\n\ne2k\n\n0\n\n7\n\n0\n\n2\n\n4\n\n6\n\n8\n\nρ\n\n20\n\neΦ−Φ0\n\n120\n\n100\n15\n\n80\n\n60\n10\n\n40\n\n20\n5\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nρ\n\n0\n\n2\n\n4\n\n6\n\n8\n\nρ\n\nFIG. 8: The background functions h, g, k and Φ as a function of ρ, for the same parameters as in Fig. 7, and with the same\ncolor-coding. It is clear that the expansion in Eq. (184) converges sufficiently fast for g and h, but some caution has to be used\nwith Φ and k [20].\n\n3.\n\nWalking solutions in class II.\n\nThe first class of solutions to Eq. (174) which yield the running gauge coupling of a walking theory was found\nin [20], and belongs to class II. This is a 2-parameter family of solutions, the parameters being the integration\nconstants of the second-order differential equation. It has the nice property that it can be obtained starting from an\napproximate solution, and that all corrections can be in principle computed in a formal power-series, in which the\nexpansion parameter is related to one of the two integration constants. Without loss of generality I will set ρ̂o = 0\nin the following. One must require that the solution P (ρ) exists and be finite for every ρ > ρ̂o , which imposes some\nrestriction on the integration constants.\nLet us see how to construct such solutions. The basic observation is that Eq. (174) would be exactly solvable if one\n\n\f50\ncould set Q = 0. It is hence sensible to look for solutions such that P ≫ Q for any ρ. Following [60] we can write P\nin a formal expansion in inverse powers of c as [20]\nP =\n\n∞\nX\n\nc1−n P1−n .\n\n(184)\n\nn=0\n\nwhere\n\u00011/3\nR(ρ) ≡ cos3 α + sin3 α(sinh(4ρ) − 4ρ)\n,\n\n(185)\n\nP ≃ P1 = cR(ρ).\n\n(186)\n\nand where c and α are the two integration constants. Taking c large compared to Nc yields P ≫ Q, and one obtains\nthe approximate solution\n\nFor this to be a well defined solution one needs to ensure that P (ρ) > Q(ρ) for all ρ ≥ 0, since any ρ where P = Q is\na singular point of Eq. (174). At asymptotically small values of ρ, Q(ρ) = O(ρ2 ), while P (ρ) ≈ c cos α + O(ρ3 ) and so\nP > Q is ensured by requiring cos α > 0. For asymptotically large ρ, Q(ρ) ∼ 2Nc ρ, while P (ρ) ∼ 2−1/3 c sin αe4ρ/3 . So\nthat requiring that sin α > 0 is again sufficient to ensure that P > Q for large ρ. Because P and P ′ are monotonically\nincreasing functions of ρ, P ≥ c cos α for all ρ. At some special value of ρ = ρ∗ , sinh(4ρ∗ ) − 4ρ∗ ≈ cot3 α and P starts\ndeviating from the constant value c cos α, being approximated by the UV-asymptotic exponential dependence on ρ.\nIn order to allow for a large region of walking behavior we need to take ρ∗ ≫ 1, in which case\nρ∗ ≈\n\n1\n(log 2 + 3 log cot α) ≫ 1.\n4\n\n(187)\n\nIn order to ensure that P > Q everywhere, it is hence sufficient to require that P (ρ∗ ) > Q(ρ∗ ), which puts an upper\nbound on cot α, namely\n\u0013\n\u0012 4/3\nc\n2\n.\n(188)\n1 ≪ cot α . exp\n3 Nc\nIn this approximation P (ρ) remains almost constant for 0 ≤ ρ . ρ∗ . The fact that P is almost constant up to\nvery large scales ρ∗ produces an intermediate energy region over which the four-dimensional gauge coupling is almost\nconstant, as can be seen from Fig. 7. The larger cot α, the wider this region is, with the only limitation provided by\nthe upper bound on the value of cot α, which depends on the ratio c/Nc .\nFig. 8 shows the other functions appearing in the background. Notice the divergence of e2g in the IR. Interesting\nis the behavior of the dilaton: it is practically constant above and below ρ∗ , and at ρ∗ the IR and UV behaviors are\nsmoothly connected.\nThis is the first very important result obtained with these methods. We found a background such that the running\nof the dual gauge coupling has many of the properties of a putative walking theory. There is a region, delimited by\ntwo scales ρIR and ρ∗ , where the running almost flattens at a finite value. Below ρIR the running reappears, and\nfinally there is a scale ρ̂o at which the space ends, deep in the IR. This is a very encouraging starting point. For all\nthe reasons discussed earlier, in order to understand how physical all of this is, one needs to use this background in\norder to compute some physical quantity.\n4.\n\nWalking solutions in class I.\n\nThe walking behavior described in the previous subsection is appearing in the IR, for ρ < ρ∗ . It is hence important\nto understand if it is in any way related to the choice of UV-asymptotic behavior of the theory. Also, for several\nreasons it is more sensible to perform calculations of physical quantities in backgrounds of class I, and it is hence\nimportant to know that walking solutions exist also in this class. In principle, one might try and construct numerically\nsuch solutions by observing that the walking solutions, for small-ρ, can be written as\n\u0001\n16 2P02 k3 − 5k3 Nc2 ρ7\n4k3 P0 ρ5\nP (ρ) = P0 + k3 P0 ρ3 +\n+ *** ,\n(189)\n− k32 P0 ρ6 +\n5\n105P0\nwith P0 and k3 two integration constants. Notice how this expansion does not contain a term linear in ρ. The strategy\nbased on setting up the boundary conditions in the IR in such a way as to reproduce this asymptotic behavior, and\n\n\f51\n20\n\nP/Nc\nP (ρ∗ ≃ 9)\n15\n\n10\n\nP (ρ∗ ≃ 4)\n\n5\n\nP̂\n\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nρ\n\nFIG. 9: The numerical solutions for P (ρ)/Nc used in the analysis as an example, for Nc = 100. The three solutions correspond\nto the P̂ case with ρ∗ = 0, and to two new numerical solutions with, respectively, ρ∗ ≃ 4 and ρ∗ ≃ 9 [22].\n30\n\n15\n\ne2g\n\ne2h\n\n25\n\n10\n\n20\n\nP (ρ∗ ≃ 9)\n\n15\n\nP (ρ∗ ≃ 9)\n\n5\n\nP (ρ∗ ≃ 4)\n\n10\n\nP (ρ∗ ≃ 4)\n5\n\nP̂\n\n0\n\nP̂\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n0\n\nρ\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nρ\n\n14\n2k\n\nφ\n\n1.5\n\n12\n\ne\n\n10\n\nP̂\n1.0\n\n8\n\nP (ρ∗ ≃ 9)\n6\n0.5\n\nP (ρ∗ ≃ 4)\n\nP (ρ∗ ≃ 9)\n\n4\n\nP (ρ∗ ≃ 4)\n2\n0.0\n\nP̂\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nρ\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nρ\n\nFIG. 10: The functions (e2g , e2h , e2k , Φ) appearing in the metric for the same solutions as in Fig. 9, computed rescaling\nP → P/Nc , and Q → Q/Nc [22].\n\nthen solving numerically towards the UV, is not very efficient, because as we will see the class of walking solutions with\nUV behavior of class I depends only on one parameter. Hence, one would need to know the precise relation between\nthe integration constants in the IR-expansion, such that asymptotically in the UV one obtains a class-I solution. This\nis not possible with present knowledge.\nIn order to build numerically the solution, we start by expanding Eq. (174), by assuming that the solution can be\nwritten as\nP (ρ) = P̂ (ρ) + εf (ρ) + O(ε2 ) ,\n\n(190)\n\nwith ε ≪ 1, and expanding at large-ρ by assuming that ρ ≫ 0. Asymptotically this means that the linearized\n\n\f52\nequations admit solutions that, dropping power-law corrections for notational simplicity, behave as\nf (ρ) ≃ c1 e−4ρ + c2 e2ρ ,\n\n(191)\n\nwhich implies that consistency of the perturbative expansion from Eq. (190) enforces the choice c2 = 0. Indeed, there\nare no asymptotic (in the UV) solutions that behave as e2ρ .\nWe have now obtained an important result: at least for large values of ρ, there exists a 1-parameter class of solutions\nthat approach asymptotically the P̂ solution. We cannot prove that such solutions are well behaved all the way to\nρ → 0. However, one can use this result in setting up the boundary conditions (at large-ρ) and numerically solve\nEq. (174) towards the IR [21, 22]. By inspection, these solutions turn out to be precisely the ones we are looking for.\nThey start deviating significantly from P̂ below some ρ∗ > 0, below which P is approximately constant. We plot in\nFig. 9 two such solutions, with ρ∗ ≃ 4 and ρ∗ ≃ 9, together with the P̂ solution for the same value of Nc . We also\nplot in Fig. 10 the functions appearing in metric (e2g , e2h , e2k , φ) for the same solutions. Notice the behavior of e2g\nfor ρ → 0. Also notice that the dilaton Φ is finite at ρ → 0.\nC.\n\nRelation to other systems.\n\nThis subsection contains a formal digression that will become useful later on. The Maldacena-Nunez system, and in\ngeneral the wrapped D5 system, can be thought of within a more general class of solutions to type-IIB supergravity that\nis often referred to as Papadopoulos-Tseytlin ansatz [65]. This ansatz contains as special cases a variety of important\nmodels, in particular the Klebanov-Witten (conifold, conformal) [66], the Klebanov-Tseytlin (singular conifold) [67]\nand the Klebanov-Strassler (resolved conifold) [55] ones. Also, it is possible to show that the 10-dimensional equations\nyielding the background can be re-derived from a five-dimensional action, in which a sigma-model theory of a set of\nscalars is coupled to gravity. This section will also introduce a certain amount of notation, which may help the reader\nin relating the conventions used by several different authors.\nFollowing the notation in [68], we describe the system using an effective five-dimensional action that reads, up to\nan overall normalization,\n\u0014\n\u0015\nZ\n1\n1\n5 √\nMN\na\nb\nS =\nd y −g R − Gab g\n∂M Φ ∂N Φ − V (φ) ,\n(192)\n4\n2\nwhere Φa = (g̃, x, p, a, b, Φ, h1 , h2 , χ, K) and y M = (xμ , z). One uses the two constraints\nK = M + 2N (h1 + bh2 ) ,\n(e2g̃ + 2a2 + e−2 a4 − e−2g̃ )∂M h1 + 2a(1 − e−2g̃ + a2 e−2g̃ )∂M h2\n,\n∂M χ =\ne2g̃ + (1 − a2 )2 e−2g̃ + 2a2\n\n(193)\n(194)\n\nwhere K is the normalization of the F5 form in 10 dimensions, and χ, h1 and h2 appear in the NS B2 antisymmetric\ntensor of Type-IIB. N is the normalization of the F3 form, and essentially counts how many D5 branes are present,\nwhile M would count the number of D3 branes if N = 0.\nThe constraints allow to remove χ and K from the sigma-model, which is hence defined by\nGab ∂M Φa ∂N Φb =\n\n1\n1\n∂M g̃∂N g̃ + ∂M x∂N x + 6∂M p∂N p + ∂M Φ∂N Φ\n2\n4\n1 −2g\n1 2 Φ−2x\n+ e ∂M a∂N a + N e\n∂M b∂N b\n2\n2\nh\ne−Φ−2x\n+ 2g̃\n(1 + 2e−2g̃ a2 )∂M h1 ∂N h1\n2\n−2g̃\n2\n2\ne + 2a + e (1 − a )\n\u0015\n1\n+ (e2g̃ + 2a2 + e−2g̃ (1 + a2 )2 )∂M h2 ∂N h2 + 2a(e−2g̃ (a2 + 1) + 1)∂M h1 ∂N h2 .\n2\n\n(195)\n\n\f53\nThe potential is\n1\nV = − e2p−2x (eg̃ + (1 + a2 )e−g )\n2\n1\n+ e−4p−4x (e2g̃ + (a2 − 1)2 e−2g̃ + 2a2 )\n8\n1 2 −2g̃+8p\n+ a e\n4\n\u0002\n\u0003\n1\n+ N 2 eΦ−2x+8p e2g̃ + e−2g̃ (a2 − 2ab + 1)2 + 2(a − b)2\n8\n1 −Φ−2x+8p 2\n+ e\nh2\n4\n1\n+ e8p−4x (M + 2N (h1 + bh2 ))2 .\n8\n\n(196)\n\nThe five-dimensional metric is written as\ndy 2 = e2A ημν dxμ dxν + dz 2 ,\n\n(197)\n\nwhere we use the convention in which the metric is mostly +, and the warp factor A is to be determined by the\nEinstein equations.\nThe basic idea is that any solution to the equations of motion derived from this 5-dimensional system can be lifted\nto a full solution of 10-dimensional type-IIB supergravity. The 10-dimensional metric is (in Einstein frame)\nds2E = e2p−x dy 2 + (ex+g̃ + a2 ex−g̃ )(e21 + e22 ) + ex−g̃ (e23 + e24 − 2a(e1 e3 + e2 e4 )) + e−6p−x e25 ,\n\n(198)\n\nwhere the metric on the internal manifold is written in terms of\ne1 = − sin θdφ ,\ne2 = dθ ,\n\n(199)\n(200)\n\ne3 = cos ψ sin θ̃dφ̃ − sin ψdθ̃ ,\n\n(201)\n\ne4 = sin ψ sin θ̃dφ̃ + cos ψdθ̃ ,\n\n(202)\n\ne5 = dψ + cos θ̃dφ̃ + cos θdφ .\n\n(203)\n\nAll the other functions in the type-IIB background (F3 , F5 , H3 , C) can be found explicitly in [68] and references\ntherein.\nIn looking for solutions to the background, we assume that all the functions have a non-trivial dependence only on\nthe radial direction z. Some very interesting backgrounds can be described by this formalism. When N = 0, K = M\nis the normalization of F5 . In this case, there is no F3 , and hence no b. Further, it is not difficult to show that in this\ncase H3 = 0 satisfies the equations of motion, and hence h1 = 0 = h2 = χ. This can be seen directly by minimizing\nthe potential V by brute force. The dilaton Φ disappears from the sigma-model metric and from the potential V ,\nhence its equation of motion is solved by any constant, in particular Φ = 0. Only (g̃, x, p, a) have to be solved for.\nThere exists in this case a stable minimum for the potential with\n1\n4\n1\n2\na = 0 , g̃ = 0 , x = − ln\n, p = ln\n.\n2 3M\n6 M\n\n(204)\n\nAt the fixed points, the Einstein equations imply that\n1\n(∂z A)2 = − V0 ,\n3\nwhere V0 is the potential evaluated at the minimum. Replacing in the background one finds\n\u0012\n\u0013\n√\n24/3\n1 2\n1\ndy 2 + 3 3M\nds2E = √\n(e1 + e22 + e23 + e24 ) + e25 ,\n6\n9\n3M 5/6\n25/3\n\nz\n\ndy 2 = e 3M 2/3 ημν dxμ dxν + dz 2 ,\n\n(205)\n\n(206)\n(207)\n\nand\ne21 + e22 + e23 + e24 = sin2 θdφ2 + dθ2 + sin2 θ̃dφ̃2 + dθ̃2\n\n(208)\n\n\f54\nis the metric on S 2 × S 2 . The background has AdS5 × T 1,1 geometry (the six extra-dimensions describe the conifold).\nThis is the Klebanov-Witten fixed point [66], which describes a N =√1 supersymmetric, conformal theory with\nSU (2) × SU (2) × U (1) global symmetry. Choosing for instance M = 2/ 27, so that the AdS curvature is L = 1:\n\u0013\n\u0012\n√ 3/4 2z\n1 2\n1 2\n2\n2\n2\n2\nμ\nν\n2\ndsE = 23\n(209)\ne ημν dx dx + dz + (e1 + e2 + e3 + e4 ) + e5 .\n6\n9\nOne good reason for introducing all of this formalism is that it allows for a very simple exercise to be performed: the\ncalculation of the (quantum) dimensions of the operators of the dual field theory which correspond to the supergravity\nscalars. By simply expanding the potential around\nthe minimum (and carefully normalizing the kinetic terms), working\n√\nat unit curvature with N = 0 and M = 2/ 27, one finds that a has mass m2 = −3, g̃ has m2 = −4, h2 and b mix,\nthe eigenvalues being m2 = −3 and m2 = 21, x and p mix, the eigenvalues of the masses being m2 = 12 and m2 = 32,\nwhile h1 and Φ are massless. Using the celebrated relation m2 = (∆ − 4)∆ yields the scaling dimensions ∆ [69]:\nm2 = −4\nm2 = −3\nm2 = 0\nm2 = 12\nm2 = 21\nm2 = 32\n\n→\n→\n→\n→\n→\n→\n\n∆ = 2,\n∆ = 1, 3 ,\n∆ = 0, 4 ,\n∆ = −2, 6 ,\n∆ = −3, 7 ,\n∆ = −4, 8 .\n\n(210)\n(211)\n(212)\n(213)\n(214)\n(215)\n\nNotice the presence of a set of non-trivial higher-dimensional operators (of dimension 6, 7 and 8). (The reader\nis assumed to be familiar with the interpretation of m2 in terms of the dimension of the dual operator and its\ncoupling [70]). A more complete discussion of this model can be found elsewhere, the main lesson we learn from here\nis that computing the (non-perturbative) dimensions of many important operators in the dual theory is relatively\neasy (compared for instance to the formidable task that doing it in four dimensions represents). Notice also that this\nexercise clearly shows that this is not simply the dual description of N = 1 super-Yang-Mills: this set-up yields a\nvery rich structure, with many operators being present, all of which in general have very important non-perturbative\nimplications.\nAn important comment about internal symmetries. Looking back at Eq. (198) one sees that for a = 0 = g̃ the\ninternal space gains the structure of T 1,1 , and its SU (2) × SU (2) × U (1) symmetry. In particular, the functions a and\nb (the latter appears in the F3 and B2 fields), when non-vanishing, induce symmetry-breaking. For instance, in the\nwrapped D5 background defined earlier on, the equations yield a and b that vanish in the UV, but are non-vanishing\nbelow ρIR , signaling that they encode the fact that spontaneous symmetry breaking is taking place at the scale\ncorresponding to ρIR . The exercise we just did means that the non-vanishing of a and b is related to a dimension-3\ncondensate in the dual theory, usually identified with the gaugino condensate 11 .\nAnother important class of solutions can be found with the restriction\na = tanh y ,\ne\n= cosh y .\n−g\n\n(216)\n(217)\n\nWith both M 6= 0 6= N , one is left with a system of equations that admits the Klebanov-Strasser background as\nregular solution. This system is known to provide a description of the duality cascade [71].\nFinally, the Maldacena-Nunez system of wrapped D5 that is the focus of this section is obtained by setting M = 0,\nand N = Nc /4, in which case one can consistently set h1 = h2 = χ = K = 0, reducing to six the number of scalar\nfunctions controlling the background. One important thing to stress here is that all of these backgrounds are related\nto each other, belonging to the same general class [72].\nD.\n\nGlueball spectrum.\n\nBy making use of the five-dimensional formalism introduced in the previous subsection, we can compute the spectrum of scalar excitations (glueballs) for the walking solutions with type-I asymptotic behavior in the UV. Follow-\n\n11\n\nImportant subtleties related to the anomalies should be taken into account in discussing the internal symmetries, but for our present\npurposes they do not change the substance of these results.\n\n\f55\ning [68], we relate the variables [A, g̃, p, x, Φ, a, b] to the functions describing the background in Eq. (171) as\nΦ\nx\ng̃\n= A + p − , g = −A − − p + x + log 2,\n4\n2\n2\ng̃\nh = −A + − p + x, k = −A − 4p + log 2 ,\n2\n\n(218)\n\nand relate the radial coordinates according to 2dρe−4p = dρeA+k = dz . The resulting effective 5-dimensional nonlinear sigma model with fields Φa = [g̃, p, x, Φ, a, b] coupled to gravity can be studied from:\n\u0014\n\u0015\nR 1\n4(α′ gs Nc )2 (4π)3 √\nef f\na\nb\n~\n− Gab ∂Φ ∂Φ − V (Φ) ,\n(219)\n−g\nL5d =\nG10\n4\n2\nwhere we now made explicit all the constants, and the five-dimensional metric has the form in Eq. (197).\nThe sigma-model metric (replacing N = Nc /4) is\nGpp\n= 1,\n6\nN 2 eΦ−2x\n= c\n,\n32\n\n4Gφφ = 2Ggg = Gxx =\nGaa =\n\ne−2g̃\n, Gbb\n2\n\n(220)\n\nand the potential V is given by (in agreement with [68])\n\"\n\u0010\n\u0010\n\u0011\n\u0011\n\u0001\n\u00012\ne−2(g̃+2(p+x))\n16 a4 + 2 eg̃ − e6p+2x − 1 a2 + e4g̃ − 4eg̃+6p+2x 1 + e2g̃ + 1 +\nV =\n128\n#\n\u0010\n\u00012 \u0011 2\n2g̃\n2\n4g̃\n2\n12p+2x+Φ\nNc .\n2e (a − b) + e + a − 2ba + 1\ne\n\n(221)\n\nFrom here on, we work in units where α′ gs Nc = 1. Following [68], after changing coordinates dz = eA+k dρ,\nwriting the fluctuations as a(x, ρ) = eiKx a(ρ), replacing \u0003 by −K 2 (=M 2 ) and using the equations for the 5d gravity\nfluctuations, we obtain the system of linearized equations for the scalar perturbations [73]\nh\n\ni\nh\n4(Φ′a Vc + V a Φ′c ) 16V Φ′a Φ′c i c\nDz2 + 4A′ Dz − e−2A K 2 aa − V|ca − Rabcd Φ′b Φ′d +\n+\na = 0.\n3A′\n9A′2\n\n(222)\n\nOne important comment. The six ac fields solving Eq. (222) are not simply the fluctuations of the scalars Φa in\nthe sigma-model Lagrangian. In fluctuating the geometry, the scalars mix non-trivially with the fluctuations of the\nmetric. The formalism of [68], from which Eq. (222) is derived, has the advantage of explicitly making use of all the\nequations of motion (including the Einstein equations) in such a way that the system of six fluctuations written here\nis already written in the physical basis. In Eq. (222), primed quantities mean derivatives in respect to z, V is the\npotential, Va its derivative in respect to the field Φa , in V b the index is raised with the inverse sigma-model metric\nGab , V|ca is the (sigma-model) covariant derivative of V a , Rabcd is the Riemann tensor of the sigma-model metric and\nDz is the background covariant derivative defined in [73].\nThe values of K 2 = −M 2 for which the whole system is solved while at the same time satisfying appropriate\nboundary conditions give us the glueball spectrum of the dual field theory. In order to find them, we employ a\nnumerical method described in [68], that in effect evolves solutions from both the IR and the UV, and then determines\nwhether they match smoothly at a midpoint.\nIn the UV\nP (for ρ → +∞), Eq. (222) can be diagonalized by a change to a basis in which the fluctuations behave as\nψ i = eCi ρ n ai,n ρbi,n , where the exponents bi,n in general are non-integer, while\np\nC1,2,6 = −1 ± 9 − M 2 ,\n(223)\np\nC3,4,5 = −1 ± 1 − M 2 .\n\nNotice that this behavior implies the presence of cuts in the two-point functions for M 2 > 1 and M 2 > 9. The study\nof the discrete spectrum requires to chose UV boundary conditions such as to select the exponentially suppressed\nUV-behavior. The IR boundary conditions are more subtle, and the reader who is interested in the details can find\nthem in [21].\n\n\f56\nM2\n8\n\n6\n\n4\n\n2\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\nP0 /Nc\n\n25\n\nFIG. 11: The masses M 2 plotted against P0 /Nc ≃ 2ρ∗ [21].\n\nThe numerical results from the analysis in [21] are plotted in Fig. 11. The spectrum for P̂ (P0 → 0) consists\nof a series of poles approaching M 2 = 1 (in agreement with [68]). For large values of P0 (equivalently, of ρ∗ ), all\nthe masses in the series approach the branch points, so that the discrete spectrum effectively disappears into the\ncontinuum. With one notable exception: one isolated state becomes lighter, and as ρ∗ is increased, its mass is pushed\nbelow both the continuum thresholds. For ρ∗ → ∞, this state becomes massless.\nThe appearance of a single light spin-0 state in the spectrum is typical of systems having some approximate,\nspontaneously broken symmetry. If this symmetry is some form of scale invariance, the light scalar might be a light\ndilaton, and hence its couplings should be dictated by this property. With present information, we are not able to\nreconstruct its composition in terms of the original degrees of freedom in the sigma-model. Notice in particular that\nthe metric is not asymptotically AdS in the UV, hence the rigorous procedure for holographic renormalization is not\nknown, nor is it known how to characterize this state as normalizable or non-normalizable. Also, the background is\nnot approximately AdS in the walking region, which would be a clear indication of conformal invariance.\nThe appearance of a very light scalar state, whose mass is parametrically lighter than the dynamical scale controlling\nthe mass of all other composite states, would have profound implication in models of dynamical electro-weak symmetry\nbreaking, affecting precision physics (remember that in order to avoid divergences we extracted indicative bounds on\nŜ from the mh ∼ 800 GeV case), and gauge boson scattering amplitudes. It would be the obvious candidate for a\nLHC signature. It is remarkable that, if its couplings are dictated by scale invariance, it would be hard to distinguish\nit from the Higgs of the MSM.\nE.\n\nWilson loops.\n\nThe Wilson loop [74] along the curve C is defined as\nW (C) ≡\n\nH\nμ\n1\nT rP ei C Aμ dx .\nNc\n\n(224)\n\nIt is one of the most useful gauge-invariant objects, when trying to extract non-perturbative information about a\ngauge theory. It is computed in the dual string theory by calculating the action of a string bounded by C at the\nfour-dimensional boundary of the space:\nD\nE Z\nDF e−SN G [F ] ,\n(225)\nW (C) =\n∂F (C)\n\nwhere F denotes all the fields of the string theory and ∂F their boundary values. A good approximation to this path\nintegral is by steepest descent. The Wilson loop is then related to the area of the minimal surface bounded by the\ncurve C, spanned by classical string configurations (with Nambu-Goto action SN G ) that explore the bulk of the space.\nAll of this was first proposed ten years ago in [75]. In the meantime, this proposal motivated lots of developments,\nsee [77] for beautiful papers along this line. See also [78] for a review. In this subsection we are going to compute\nthe Wilson loop using this prescription, for the walking backgrounds of Type I. In doing so, we will be able to show\nthat the scales ρ0 , ρIR and ρ∗ correspond to physical scales, at which the functional relation between quark-antiquark\npotential and quark-antiquark separation changes.\n\n\f57\n1.\n\nGeneral treatment\n\nWe start by summarizing the general treatment, which uses the ideas of [75] (see also [76]).\nWe study the action for a string in a background of the generic form\nds2 = −gtt dt2 + gxx d~x2 + gρρ dρ2 + gij dθi dθj .\n\n(226)\n\nWe assume that the functions (gtt , gxx , gρρ ) depend only on the radial coordinate ρ. By contrast, gij for the internal\n(typically compact) space can also depend on other coordinates. But we will choose a configuration for a probe string\nthat is not excited on the θi directions, and hence we will ignore the internal space.\nThe configuration we choose is,\nt = τ,\n\nx = x(σ),\n\nρ = ρ(σ).\n\n(227)\n\nand compute the Nambu-Goto action\n1\nS=\n2πα′\n\nZ\n\ndτ\n\nZ\n\ndσ\n\n[0,2π]\n\n[0,T ]\n\np\n\n− det Gαβ .\n\n(228)\n\nThe induced metric on the 2-d world-volume is Gαβ = gμν ∂α X μ ∂β X ν , where\nGτ τ = −gtt , Gσσ = gxx (\n\ndρ\ndx 2\n) + gρρ ( )2 .\ndσ\ndσ\n\n(229)\n\nDefining for convenience f (ρ)2 ≡ gtt gxx , g(ρ)2 = gtt gρρ , the Nambu-Goto action is\nT\nS=\n2πα′\n\nZ\n\n2π\n\ndσ\n0\n\np\n\nf 2 x′ (σ)2\n\n+\n\ng 2 ρ′ (σ)2\n\nT\n≡\n2πα′\n\nZ\n\n2π\n\ndσL .\n\n(230)\n\n0\n\nNotice that we consider the situation in which the string does not couple to the NS B2 -field.\nWe first compute the Euler-Lagrange equations from Eq. (228) and then we specify them for the ansatz in Eq. (227).\nWe also assume a background metric independent of time (we consider the system at the equilibrium). Defining\nVef f (ρ) ≡\n\nf (ρ) p 2\nf (ρ) − C 2 ,\nCg(ρ)\n\n(231)\n\nwhere C is an integration constant, we rewrite the equations of motion in terms of only one equation\ndρ\ndx\ndρ\n= ± Vef f (ρ) ↔\n= ±Vef f (ρ) .\ndσ\ndσ\ndx\n\n(232)\n\nThe kind of solution we are interested in can be depicted as follows: a string that hangs from infinite radial position\nat x = 0 and drops down towards smaller ρ as x increases. Once it arrives at the smallest ρ compatible with the\nequations, dubbed ρ0 , it starts growing in the radial direction up to infinite ρ where x = LQQ , see Fig. 12. This\nmeans that in the two distinct regions x < LQQ /2 and x > LQQ /2 the equations of motion will differ only in a sign\nLQQ\n,\n2\nLQQ\nx>\n,\n2\nx<\n\nWe can now formally integrate the equations of motion\n(R ∞ dρ\nx(ρ) =\n\ndρ\n= −Vef f (ρ)\ndx\ndρ\n= Vef f (ρ) .\ndx\n\nVef f (r)\nR∞\nLQQ − ρ Vefdρ\nf (r)\nρ\n\nx<\nx>\n\nLQQ\n2\nLQQ\n2\n\n(233)\n\n,\n.\n\n(234)\n\nWe need to specify the boundary conditions for the string in Eq. (227). This is an open string, vibrating in the\nbulk of a closed string background. Following the ideas of [75], we add a D-brane at a very large radial distance where\nthe open string will end. This string will then satisfy a Dirichlet boundary condition at ρ → ∞. This means that for\n\n\f58\n\nρ=∞\n\nx=0\n\nx = LQQ /2\n\nx = LQQ\nx\n\nρ = ρ0\n\nρ = ρ̂0\nρ\nFIG. 12: Setting of the string.\n\ndx\nmust vanish. The only way of satisfying the equation of motion Eq. (232) for\nlarge values of the radial coordinate dσ\nρ → ∞, given that the left hand side has to be non-vanishing, is to have a divergent Vef f (ρ):\n\nlim Vef f (ρ) = ∞ .\n\nρ→∞\n\n(235)\n\nThis implies that there are restrictions on the asymptotic behavior of the background functions [f (ρ), g(ρ)] in order\nfor the string proposed in Eq. (227) to exist. This is ultimately the reason why we will perform the calculations in\nbackgrounds in class I in the next subsection.\nProvided Eq. (235) is satisfied the string moves to smaller values of the radial coordinate down to a turning point ρ0\ndρ\n(ρ0 ) = 0, i. e. Vef f = 0. The turning point can be placed in any possible ρ0 , with ρ̂0 < ρ0 < ∞\nwhere the quantity dx\n(where ρ̂0 is the end of the space), where the inversion point is given by imposing C = f (ρ0 ). It is clear from Eq. (232)\nthat Vef f (ρ) controls not only the boundary condition at infinity, but also the possibility for the string to turn around\nand come back to the brane at infinity.\nGiven a probe-string hanging from infinity, and that after turning around at a point ρ0 goes back to the D-brane\nat infinity, we can compute gauge theory quantities, like the separation between the two ends of the string, which can\nbe thought of as the separation between a quark-antiquark pair living on the D-brane and coupled to the end-points\nof the string. And we can compute the Energy of the pair of quarks, that we associate with the length of the string\n(computed along its path in the bulk). Both of these quantities will be functions of the turning point ρ0 .\n2.\n\nThe D5 on S 2 system.\n\nWe now apply all of the above to the walking solutions of type I. For our purposes, it is also convenient to fix\n8e4Φ0 = 1, and ρ̂o = 0. The functions we need for the probe string are:\ns\nsinh2 (2ρ)\nf 2 (ρ) = e2Φ =\n,\n(236)\n(P 2 − Q2 )P ′\n1\n(237)\ng 2 (ρ) = P ′ f 2 (ρ) ,\n2\n\ns\n2 \nsinh2 (2ρ)\n2\nVef\n(ρ)\n=\n(238)\n− C2 ,\nf\nC 2P ′\n(P 2 − Q2 )P ′\n\nwith P and Q defined earlier on, characterizing the background.\n\n\f59\n10\n\nρo\n8\n\n6\n\nP (ρ∗ ≃ 9)\n\n4\n\nP (ρ∗ ≃ 4)\n\n2\n\nP̂\n0\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nLQQ\n\n60\n\nFIG. 13: The radial coordinate ρ0 of the turning point of the string as a function of LQQ , in the three backgrounds from Fig. 9,\nwith same color-coding [22].\nEQQ\n1902\n\nP̂\n\n1900\n\nP (ρ∗ ≃ 4)\n1898\n\n1896\n\n1894\n20\n\n25\n\n30\n\n35\n\n40\n\n45 LQQ\n\nFIG. 14: The energy EQQ as a function of the quark-antiquark separation EQQ (LQQ ). The two solutions in Fig. 9 with ρ∗ = 0\nand ρ∗ ≃ 4 are used for the background, and the results are shown using the same color-coding as in Fig. 9 [22].\n\nWe set-up the configuration of the string by assuming that its extremes are attached to the brane at ρ = ρ1 ≫ 1,\nand treat this as a UV cut-off. Because the background is known only numerically, and it is not asymptotically-AdS,\nthe calculations are performed at fixed cut-off. The string is stretched in the Minkowski direction x = x(ρ), with\nx(ρ1 ) = 0 for convenience. We vary the integration constant C 2 > f 2 (0). For each choice of C we define ρ0 as\n2\nVef\nf (ρ0 ) = 0. In this way, the coordinates of the string are (x(ρ), ρ), where\nx(ρ) =\n\nZ\n\nρ\n\nρ1\n\ndr\n.\nVef f (r)\n\n(239)\n\nThe Minkowski distance between the end-points of the string is hence LQQ = 2x(ρ0 ). For the energy, because in the\nnumerical study we do not remove the UV cut-off, we use the unsubtracted action (setting T /(2πα′ ) = 1) evaluated\nup to the cut-off:\nZ ρ1 s 2\nf (r)g 2 (r)\ndr\n.\n(240)\nEQQ = 2\nf 2 (r) − C 2\nρ0\nThe numerical results obtained for the three different solutions for P in Fig. 9 are shown in Fig. 13, Fig. 14 and\nFig. 15.\nLet us first focus our attention on the background generated by P̂ in Eq. (180), in which case a great deal of\ninformation can be extracted analytically. The deeper the string probes the radial coordinate (smaller values of ρ0 ),\nthe longer the separation LQQ between the end-points on the UV brane, in agreement with natural expectations. In\n\n\f60\nparticular, setting C 2 = f 2 (0) (equivalent to ρ0 → 0), and expanding around ρ ∼ 0\n2\nVef\nf (ρ) =\n\n8ρ2\n+ *** ,\n9Nc\n\n(241)\n\nwhich, by means Eq. (239) and Eq. (240), implies that both LQQ and EQQ diverge for C 2 → f 2 (0).\nTwo regimes can be identified: as long as ρ0 > ρIR , then LQQ varies very little with ρ0 . For small ρ0 < ρIR ,\nfurther reductions of ρ0 imply much bigger increase in LQQ . The scale ρIR ∼ O(1) is the scale in which the function\nQ changes from linear to approximately quadratic in ρ, and is also the scale below which the gaugino condensate is\nappearing (the function b(ρ) in the background is non-zero). This result is better visible in Fig. 13. The dependence\nof LQQ on ρ0 is monotonic, but shows two very different behaviors for ρ0 < ρIR and ρ0 > ρIR , respectively. The\ntransition between the two is completely smooth.\nThe physical meaning of this behavior is well illustrated by studying the total energy EQQ of the classical configurations, as a function of LQQ (see Fig. 14). For small LQQ , the energy grows very fast with LQQ , until a critical\nvalue beyond which the dependence becomes linear. Which can be interpreted in terms of the linear behavior of the\nquark-antiquark potential obtained from the Wilson loop, in agreement with confinement. The important conclusion\nis that the geometry and the end of the space encodes the information about confinement.\n\n30\n\n30\n\nρ\n\nρ\n\n25\n\n25\n\n20\n\n20\n\n15\n\n15\n\n10\n\n10\n\n5\n\n5\n\n0\n\n0\n0\n\n50\n\n100\n\n150\n\nx\n\n200\n\n-10\n\n0\n\n10\n\n20\n\n30\n\nx\n\n40\n\nFIG. 15: The strings in (x, ρ)-plane, obtained with various choices of C 2 > f 2 (0). Left to right, the background is described\nby the numerical solutions in Fig. 9, characterized by increasing values of ρ∗ = 0 and ρ∗ ≃ 4, respectively. All calculations\nperformed with ρ1 = 30, and other units set as explained in the text [22].\n\nComparing with the solutions that walk in the IR, shows a very different behavior. Starting from Fig. 13, one\nsees that as long as ρ0 > ρ∗ , the dependence of LQQ from ρ0 reproduces the P̂ case. Beginning from such large\nρ0 , we start pulling the string down to smaller values of ρ0 , and follow the classical evolution. Provided we do this\nadiabatically, we can describe the motion of the string as the set of classical equilibrium solutions. Going to smaller\nρ0 , LQQ increases, and nothing special happens until the tip of the string touches ρ0 ≃ ρ∗ . At this point LQQ = Lmax\nhas a (local) maximum as a function of ρ0 . From here on, the string can keep probing smaller values of ρ0 only at the\nprice of becoming shorter in the Minkowski direction (smaller LQQ ). Another change happens deep in the IR, when\nLQQ = Lmin reaches a local minimum, at which point the tip of the string entered the very bottom section of the\nspace, near its end ρ0 < ρIR . From here on, further reducing ρ0 requires larger values of LQQ . Asymptotically for\nρ0 → 0, the separation between the end-points of the string is diverging, LQQ → ∞.\nEven more interesting is the behavior of the energy (see Fig. 14): for very short LQQ , and again for very large-LQQ,\nit is just a monotonic function, very similar to the one obtained from P̂ . But for a range Lmin < LQQ < Lmax\nthere are three different configurations allowed by the classical equations for the string we are studying. One of the\nthree solutions (smoothly connected to the small-LQQ configurations) is just the Coulombic potential already seen\nwith P̂ . The highest energy one is an unstable configuration, with much higher energy. The third solution (smoothly\nconnected to the unique solution with LQQ > Lmax ) reproduces the linear potential typical of confinement. Notice\n(from Fig. 14) that the solution at large-LQQ is linear, but has a slope much larger than what seen in the P̂ case.\nThis co-existence of several disjoint classical solutions is expected in systems leading to phase transitions. The\nstability/metastability/instability of the solutions can be illustrated by comparing Fig. 13 and Fig. 14 with Fig. 16 in\nAppendix A. This is just an analogy, and one should not push it too far. However, identifying the pressure P , volume\nV and Gibbs free energy G as LQQ ↔ P , ρ0 ↔ V and EQQ ↔ G, one sees obvious similarities. In particular, there is\na critical distance Lmin < Lc < Lmax at which the minimum of EQQ is not differentiable, which suggests that this is\na first-order (quantum) phase transition.\nIn order to better understand and characterize the solutions we find, it is useful to look more in details at the\nshape of the string configurations, focusing in particular on the right panel in Fig. 15, in which we plot the string\n\n\f61\nconfiguration that solves the equations of motion for various values of ρ0 , on the background with ρ∗ ≃ 4. Consider\nthose strings that penetrate below ρ∗ . Besides having a shorter LQQ , and higher EQQ than those for which ρ0 > ρ∗ ,\nthese strings show another interesting feature. They start developing a non trivial structure around their middle\npoint, that becomes progressively more curved the further the string falls at small ρ. Ultimately, this degenerates into\na cusp-like configuration, which disappears once ρ0 approaches the end of the space.\nNotice that, as a result, the three different solutions for Lmin < LQQ < Lmax have three very different geometric\nconfigurations. One (stable or metastable) configuration is completely featureless, and practically indistinguishable\nfrom the solutions in the background generated by P̂ . The second (stable or metastable) configuration shows a\nfunnel-like structure below ρ∗ , and most of the string lies very close to the end of the space. The third (unstable)\nsolution presents a highly curved configuration around its middle point. All of this seems to be consistent with the\nfact that the classical configurations prefer to lie either in the far-UV or deep-IR, outside the ρIR < ρ < ρ∗ region.\nConcluding, we learned two very important things from the study of the Wilson loop. First of all, the end of the\nspace in the IR can indeed be interpreted as the fact that confinement is taking place. The (unphysical) singularity\nin the running of the gauge coupling yields the expected (physical) linear behavior of the quark-antiquark potential.\nSecond, the existence of a plateau at intermediate scale has a very interesting physical meaning. Because it is\nultimately responsible for the arising of the first-order phase transition we found, the hierarchy ρ∗ > ρIR cannot be\nundue by simply changing renormalization scheme, but is a physical effect.\nF.\n\nSummary.\n\nIn this section we focused our attention on one very specific class of models, in which the geometry is obtained by\ntruncating type-IIB supergravity, in the strongly-coupled limit of the system of D5-branes wrapping a 2-cycle inside\na CY3 manifold.\nWe found new classes of solutions to the BPS equations determining the background that exhibit some very peculiar\nproperties, closely resembling those expected in a walking field theory. Studying these backgrounds, we were able to\nshow that\n• the (non-perturbative) running of the four-dimensional gauge coupling exhibits a walking behavior, in the sense\nthat there is a finite interval of the radial direction within which the coupling is almost constant, but this\nbehavior disappears both in the UV and in the IR,\n• in the IR, below the walking region, the theory confines, as signaled by the long-distance behavior of the Wilson\nloop, and condensates emerge, spontaneously breaking the global symmetries of the theory,\n• the existence of the walking region is a physical effect, as signaled by the presence of a discontinuity of the\nderivative of the quark-antiquark energy as a function of the separation,\n• the spectrum of the scalar glueballs contains a mass gap, and depending on the extension in the radial direction\nof the walking region one scalar state becomes parametrically lighter than such gap.\nThese are all very striking and important results, none of which can be obtained analytically by studying a fourdimensional, strongly-coupled gauge theory with traditional methods. A long list of other things should be done. I\nconclude with a sample of possible other open questions.\n• The properties of the light scalar (its couplings in particular) are not known. Holographic renormalization,\nat least in its simplest form, fails to provide a sensible treatment of the correlation functions, because the\nbackground is not asymptotically AdS. Some clever strategy must be devised in order to be able to study the\npossible phenomenology of such a light scalar.\n• The rest of the spectrum (spin-1 fields and fermions in particular) has not been studied yet.\n• The spectrum of anomalous dimensions of the model is not known. This is a peculiarly difficult question, in\nrelation to the fact that the geometry is never really close to AdS, and hence the precise relation between radial\ndirection and renormalization scale is not easily inferred.\n• It would be interesting to couple this model to the standard model, and compute the effect of the walking region\non the oblique parameters.\n• The field and operator content of the dual field theory is known only in part, and a more systematic exploration\nwould be useful.\n\n\f62\nFinally, it must be noted that there is no obvious reason why this specific set-up is preferable, in relation to walking\ntechnicolor. To large extent, the reason why these studies have been performed in this specific context has to do\nwith the fact that backgrounds based on the conifold and its various deformations provide a very well studied and\nunderstood place from which to start. But it would be very interesting to know if analogous results hold in completely\ndifferent models, possibly simpler, and maybe non-supersymmetric.\n\n\f63\nConclusions.\n\nDynamical electro-weak symmetry breaking relies on the existence of a new strongly-coupled sector responsible\nfor the spontaneous symmetry breaking that is at the core of the Standard Model. There are two interconnected\nreasons why the ideas of gauge/string dualities are useful in constructing and studying these models. First of all,\nthe non-perturbative nature of the underlying strong dynamics calls for a flexible and powerful set of tools which\nmakes calculations doable. But also, the huge amount of experimental data at our disposal indicates quite clearly\nthat a generic model is not going to pass the precision tests. The new (strongly-coupled) physics sector has to have\nvery special features in order to be phenomenologically viable. Walking technicolor is one such special possibility,\nwhich happens to be a natural candidate for phenomenological applications of gauge/string dualities, because of its\nquasi-conformal behavior, its large anomalous dimensions, and its multi-scale nature.\nIn these notes, besides reviewing the phenomenology of strongly-coupled extensions of the standard model (at a\nvery pedagogical level, by comparing to the minimal version of the standard model itself and to its weakly-coupled\nextensions), I provided a few examples illustrating how the ideas taken from gauge/string dualities can indeed yield\nvery useful and interesting results, taking them both from the context of five-dimensional effective theories (bottom-up\napproach) and from more rigorous ten-dimensional string-theory constructions (top-down approach).\nSummarizing, the main messages I hope I was able to convey to the reader are that\n• the unhealthy behavior of the minimal version of the Standard Model, when extrapolated at arbitrary high\nscale (where Landau poles and fine-tuning appear), requires that it be completed, particularly in the sector\nresponsible for electro-weak symmetry breaking, and many proposals exist that do so,\n• at low energy the Standard Model provides such an efficient and precise description of the vast amount of data\nat our disposal, that only very peculiar, special types of new physics models can be phenomenologically viable,\n• walking technicolor, supplemented by tumbling ETC, is one such special, phenomenologically viable possibility,\nin which new strongly-coupled interactions and non-perturbative phenomena are present,\n• with the incoming of LHC data, actual calculations of physical observable quantities within this strongly coupled\nframework are urgently needed,\n• gauge/gravity dualities can be used to perform these calculations, and several examples of useful results exist,\n• the technology of gauge/gravity duality is at such a stage of development that, provided a sensible model is\nidentified, the calculation of actual physical quantities can be done, and is often comparatively simple,\n• while a completely satisfactory proposal for the dual of a walking technicolor theory does not exist at present,\nyet, circumstantial evidence from the examples we have, together with the existing vast literature on the subject\nand the number of open possibilities for model-building in the gauge/gravity context, strongly suggests that\nthere is a lot that can be learned in this direction, which represents a very promising avenue for present and\nfuture research.\n\n\f64\nAppendix A: Van der Waals gas.\n\nHere I summarize some aspect of first-order phase transitions that plays an important conceptual role in the body\nof the paper. This appendix is taken from [22], and extended discussions can be found in textbooks on statistical\nmechanics. As an example, I review the classical treatment of the van der Waals gas, in terms of the pressure P ,\ntemperature T and volume V of n moles of particles, by means of the equation of state\nP =\n\nnRT\nn2 a\n− 2 ,\nV − bn\nV\n\n(A1)\n\nwhere R, b, a are constants.\n\u0001\nFig. 16 shows one isotherm. The condition for stability of the equilibrium ∂ 2 F/∂V 2 T = −\nsatisfied in some region. This implies that a phase transition is taking place.\n\n∂P\n∂V\n\n\u0001\n\nT\n\n> 0 is not\n\nG\n\nP\nQ\n\nE\nF\nH\nE\nF\n\nO\nN\n\nH\nM\n\nI\nL\n\nD\n\nI\nD\nC\n\nL\nB\n\nQ\nO\n\nM\n\nC=N\n\nB\nA\n\nV\n\nA\n\nP\n\nFIG. 16: The pressure P as a function of the volume V (left panel) and the Gibbs free energy G as a function of the pressure\nP (right panel) for the same isotherm curve [22].\n\nIn order to understand what the physical trajectory followed by the system at equilibrium is, Fig. 16 shows the\nGibbs free energy G = G(T, P ) = G(P ) for the same isotherm. From this plot, one sees that the system evolves on\nthe path ABCOQ, where C = N , in such a way that for every choice of P the Gibbs free energy G is at its minimum.\nThe evolution is smooth along ABC (gas phase: |∂P/∂V | is small), but at C = N the free energy is not differentiable,\nsignaling that a first-order phase transition is taking place. In the (P, V ) plane the system runs along the horizontal\nline (constant P ) joining C and N . This explains the Maxwell rule introducing a curve of constant pressure that\nseparates two regions of equal areas above and below it, delimited by the original isotherm. Afterwards, the evolution\nfollows smoothly the curve N OQ (liquid phase: |∂P/∂V | is large).\nWhile the trajectory ABCN OQ follows the stable equilibrium configurations, it is possible to have the system\nevolving along the path CDE or LM N . Both these paths represent metastable configurations, because (∂P/∂V )T < 0.\nIndeed, these metastable states can be realized in laboratory experiments. For example, in a bubble chamber or in\nsupercooled water, the metastability is exploited as a detector device, because small perturbations induced by passingby charged particles are sufficient to drive the system out of the state and into the stable minimum. The evolution\nalong the path EF HIL is completely unstable and not realized physically (it is a local maximum, as clear from the\nright panel of Fig. 16, and by the fact that (∂P/∂V )T > 0).\nThe analogy with the examples in the main body of the paper is apparent. Notice for instance that the pressure P\nin this system as a function of the volume V behaves as a non monotonic function, hence there are inversion points\nin the curve (the points E, L in figure 16).\n\nAcknowledgments\n\nI thank Daniel Elander, Biagio Lucini, Ioannis Papadimitriou and Agostino Patella for useful comments on the\nmanuscript, and Carlos Nunez, Antonio Rago and Mark Round for the collaborations part of these lectures are based\nupon. I would like to thank the hospitality of University of Barcelona, where lectures based on parts of these notes\n\n\f65\nhave been presented. The work of MP is supported in part by the Wales Institute of Mathematical and Computational\nSciences and by the STFC Grant ST/G000506/1.\n\n[1] J. M. Maldacena, Adv. Theor. Math. Phys. 2, 231 (1998) [Int. J. Theor. Phys. 38, 1113 (1999)] [arXiv:hep-th/9711200];\nS. S. Gubser, I. R. Klebanov and A. M. Polyakov, Phys. Lett. B 428, 105 (1998) [arXiv:hep-th/9802109]; E. Witten, Adv.\nTheor. Math. Phys. 2, 253 (1998) [arXiv:hep-th/9802150].\n[2] S. Weinberg, Phys. Rev. D 19, 1277 (1979); L. Susskind, Phys. Rev. D 20, 2619 (1979); S. Weinberg, Phys. Rev. D 13,\n974 (1976).\n[3] B. Holdom, Phys. Lett. B 150, 301 (1985); K. Yamawaki et al. Phys. Rev. Lett. 56, 1335 (1986); T. W. Appelquist et al.\nPhys. Rev. Lett. 57, 957 (1986).\n[4] S. Dimopoulos and L. Susskind, Nucl. Phys. B 155, 237 (1979); E. Eichten and K. D. Lane, Phys. Lett. B 90, 125 (1980).\n[5] Good examples are, for instance, R. S. Chivukula, arXiv:hep-ph/0011264; K. Lane, arXiv:hep-ph/0202255, C. T. Hill\nand E. H. Simmons, Phys. Rept. 381, 235 (2003) [Erratum-ibid. 390, 553 (2004)] [arXiv:hep-ph/0203079]; A. Martin,\narXiv:0812.1841 [hep-ph]; F. Sannino, arXiv:0911.0931 [hep-ph].\n[6] S. R. Coleman and E. J. Weinberg, Phys. Rev. D 7, 1888 (1973).\n[7] T. Appelquist and C. W. Bernard, Phys. Rev. D 22, 200 (1980); A. C. Longhitano, Phys. Rev. D 22, 1166 (1980); Nucl.\nPhys. B 188, 118 (1981); T. Appelquist and G. H. Wu, Phys. Rev. D 48, 3235 (1993) [arXiv:hep-ph/9304240]; Phys. Rev.\nD 51, 240 (1995) [arXiv:hep-ph/9406416].\n[8] M. E. Peskin and T. Takeuchi, Phys. Rev. D 46, 381 (1992).\n[9] R. Barbieri, A. Pomarol, R. Rattazzi and A. Strumia, Nucl. Phys. B 703, 127 (2004) [arXiv:hep-ph/0405040].\n[10] S. L. Glashow, J. Iliopoulos and L. Maiani, Phys. Rev. D 2, 1285 (1970).\n[11] C. D. Froggatt and H. B. Nielsen, Nucl. Phys. B 147, 277 (1979).\n[12] T. Yanagida, in Proceedings of the Workshop on the Unified Theory and the Baryon Number in the Universe, (O. Sawada\nand A. Sugamoto, eds.), KEK, Tsukuba, Japan, 1979, p. 95; M. Gell-Mann, P. Ramond, and R. Slansky, in Supergravity\n(P. van Nieuwenhuizen and D. Z. Freedman, eds.), North Holland, Amsterdam, 1979, p. 315; S. L. Glashow, NATO Adv.\nStudy Inst. Ser. B Phys. 59, 687 (1980); R. N. Mohapatra and G. Senjanovic, Phys. Rev. Lett. 44, 912 (1980).\n[13] B. W. Lee, C. Quigg and H. B. Thacker, Phys. Rev. D 16, 1519 (1977).\n[14] See for instance H. Georgi, Phys. Lett. B 298, 187 (1993) [arXiv:hep-ph/9207278], and references therein.\n[15] M. Bando, T. Kugo, S. Uehara, K. Yamawaki and T. Yanagida, Phys. Rev. Lett. 54, 1215 (1985); R. Casalbuoni, S. De\nCurtis, D. Dominici and R. Gatto, Phys. Lett. B 155, 95 (1985), M. Bando, T. Kugo and K. Yamawaki, Phys. Rept.\n164, 217 (1988); H. Georgi, Nucl. Phys. B 331, 311 (1990); M. Harada and K. Yamawaki, Phys. Rept. 381, 1 (2003)\n[arXiv:hep-ph/0302103]; See also D. T. Son and M. A. Stephanov, Phys. Rev. D 69, 065020 (2004) [arXiv:hep-ph/0304182];\nM. Piai, A. Pierce and J. G. Wacker, arXiv:hep-ph/0405242; R. Casalbuoni, S. De Curtis and D. Dominici, Phys. Rev. D\n70, 055010 (2004) [arXiv:hep-ph/0405188].\n[16] See also E. Farhi and L. Susskind, Phys. Rev. D 20, 3404 (1979). Phys. Rept. 74, 277 (1981).\n[17] L. Randall and R. Sundrum, Phys. Rev. Lett. 83, 3370 (1999) [arXiv:hep-ph/9905221].\n[18] D. K. Hong and H. U. Yee, Phys. Rev. D 74, 015011 (2006) [arXiv:hep-ph/0602177]; M. Piai, arXiv:hep-ph/0608241,\narXiv:hep-ph/0609104, arXiv:0704.2205 [hep-ph]; K. Haba, S. Matsuzaki and K. Yamawaki, arXiv:0804.3668 [hep-ph];\nM. Round, arXiv:1003.2933 [hep-ph].\n[19] See also J. Hirn and V. Sanz, Phys. Rev. Lett. 97, 121803 (2006) [arXiv:hep-ph/0606086], JHEP 0703, 100 (2007)\n[arXiv:hep-ph/0612239]; C. D. Carone, J. Erlich and J. A. Tan, arXiv:hep-ph/0612242; M Fabbrichesi, M. Piai, L. Vecchi\narXiv:0804.0124 [hep-ph]; J. Hirn, A. Martin and V. Sanz, arXiv:0807.2465 [hep-ph];\n[20] C. Nunez et al. arXiv:0812.3655 [hep-th].\n[21] D. Elander, C. Nunez and M. Piai, Phys. Lett. B 686, 64 (2010) [arXiv:0908.2808 [hep-th]].\n[22] C. Nunez, M. Piai and A. Rago, arXiv:0909.0748 [hep-th].\n[23] See for instance D. K. Hong, S. D. H. Hsu and F. Sannino, Phys. Lett. B 597, 89 (2004) [arXiv:hep-ph/0406200].\n[24] There is a number of very good reviews on the physics of the MSSM, and producing a complete list goes far beyond the\npresent scopes. Two examples that I particularly like are the very pedagogical J. P. Derendinger, in Corfu 1989, Elementary\nparticle physics, 111-243, and the reknown S. P. Martin, arXiv:hep-ph/9709356.\n[25] W. D. Goldberger and M. B. Wise, Phys. Rev. Lett. 83, 4922 (1999) [arXiv:hep-ph/9907447]. See also O. DeWolfe,\nD. Z. Freedman, S. S. Gubser and A. Karch, Phys. Rev. D 62, 046008 (2000) [arXiv:hep-th/9909134].\n[26] For reviews and discussions on the subject see for instance N. Arkani-Hamed, M. Porrati and L. Randall, JHEP 0108, 017\n(2001) [arXiv:hep-th/0012148]; R. Rattazzi and A. Zaffaroni, JHEP 0104, 021 (2001) [arXiv:hep-th/0012248].\n[27] Y. Okada, M. Yamaguchi and T. Yanagida, Prog. Theor. Phys. 85, 1 (1991); J. R. Ellis, G. Ridolfi and F. Zwirner, Phys.\nLett. B 257, 83 (1991); H. E. Haber and R. Hempfling, Phys. Rev. Lett. 66, 1815 (1991); R. Barbieri, M. Frigeni and\nF. Caravaglios, Phys. Lett. B 258, 167 (1991).\n[28] D. B. Kaplan and H. Georgi, Phys. Lett. B 136, 183 (1984); D. B. Kaplan, H. Georgi and S. Dimopoulos, Phys. Lett. B\n136, 187 (1984); H. Georgi, D. B. Kaplan and P. Galison, Phys. Lett. B 143, 152 (1984); H. Georgi and D. B. Kaplan,\nPhys. Lett. B 145, 216 (1984); M. J. Dugan, H. Georgi and D. B. Kaplan, Nucl. Phys. B 254, 299 (1985). For more recent\nimplementations of a similar idea see for instance R. Contino, Y. Nomura and A. Pomarol, Nucl. Phys. B 671, 148 (2003)\n\n\f66\n\n[29]\n\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n\n[38]\n[39]\n[40]\n[41]\n\n[42]\n[43]\n[44]\n[45]\n\n[46]\n[47]\n[48]\n\n[49]\n[50]\n[51]\n[52]\n\n[arXiv:hep-ph/0306259]; K. Agashe, R. Contino and A. Pomarol, Nucl. Phys. B 719, 165 (2005) [arXiv:hep-ph/0412089].\nD. D. Dietrich, F. Sannino and K. Tuominen, Phys. Rev. D 72, 055001 (2005) [arXiv:hep-ph/0505059].\nN. Arkani-Hamed, A. G. Cohen and H. Georgi, Phys. Lett. B 513, 232 (2001) [arXiv:hep-ph/0105239]; N. Arkani-Hamed,\nA. G. Cohen, E. Katz, A. E. Nelson, T. Gregoire and J. G. Wacker, JHEP 0208, 021 (2002) [arXiv:hep-ph/0206020].\nN. Arkani-Hamed, A. G. Cohen, E. Katz and A. E. Nelson, JHEP 0207, 034 (2002) [arXiv:hep-ph/0206021]; I. Low,\nW. Skiba and D. Tucker-Smith, Phys. Rev. D 66, 072001 (2002) [arXiv:hep-ph/0207243]; for a review see for instance\nM. Perelstein, Prog. Part. Nucl. Phys. 58, 247 (2007) [arXiv:hep-ph/0512128].\nT. Banks and A. Zaks, Nucl. Phys. B 196, 189 (1982).\nV. A. Novikov, M. A. Shifman, A. I. Vainshtein and V. I. Zakharov, Nucl. Phys. B 229, 381 (1983); M. A. Shifman and\nA. I. Vainshtein, Nucl. Phys. B 277, 456 (1986) [Sov. Phys. JETP 64, 428 (1986 ZETFA,91,723-744.1986)].\nN. Seiberg, Phys. Rev. D 49, 6857 (1994) [arXiv:hep-th/9402044]; N. Seiberg, Nucl. Phys. B 435, 129 (1995)\n[arXiv:hep-th/9411149]; K. A. Intriligator and N. Seiberg, Nucl. Phys. Proc. Suppl. 45BC, 1 (1996) [arXiv:hep-th/9509066].\nJ. Gasser and H. Leutwyler, Annals Phys. 158, 142 (1984).\n[ALEPH Collaboration and DELPHI Collaboration and L3 Collaboration and ], arXiv:hep-ex/0511027. For a review on\nHiggs physics, including the derivation of this bound, see also J. D. Wells, arXiv:0909.4541 [hep-ph].\nC. Amsler et al. [Particle Data Group], Phys. Lett. B 667, 1 (2008).\nT. Appelquist and F. Sannino, Phys. Rev. D 59, 067702 (1999) [arXiv:hep-ph/9806409].\nOne example of such a construction (which in part uses the ideas in [38–40]) and its phenomenological study is present in\nT. Appelquist, M. Piai and R. Shrock, Phys. Rev. D 69, 015002 (2004) [arXiv:hep-ph/0308061]; Phys. Lett. B 593, 175\n(2004) [arXiv:hep-ph/0401114]; Phys. Lett. B 595, 442 (2004) [arXiv:hep-ph/0406032]; T. Appelquist, N. D. Christensen,\nM. Piai and R. Shrock, Phys. Rev. D 70, 093010 (2004) [arXiv:hep-ph/0409035].\nP. Sikivie, L. Susskind, M. B. Voloshin and V. I. Zakharov, Nucl. Phys. B 173, 189 (1980).\nT. Appelquist and J. Terning, Phys. Rev. D 50, 2116 (1994) [arXiv:hep-ph/9311320].\nT. Appelquist and R. Shrock, Phys. Lett. B 548, 204 (2002) [arXiv:hep-ph/0204141]; Phys. Rev. Lett. 90, 201801 (2003)\n[arXiv:hep-ph/0301108].\nSome examples of such five-dimensional constructions: Y. Grossman and M. Neubert, Phys. Lett. B 474, 361 (2000)\n[arXiv:hep-ph/9912408]; T. Gherghetta and A. Pomarol, Nucl. Phys. B 586, 141 (2000) [arXiv:hep-ph/0003129]; S. J. Huber and Q. Shafi, Phys. Lett. B 498, 256 (2001) [arXiv:hep-ph/0010195]; G. Burdman, Phys. Rev. D 66, 076003 (2002)\n[arXiv:hep-ph/0205329]; K. Agashe, G. Perez and A. Soni, Phys. Rev. D 71, 016002 (2005) [arXiv:hep-ph/0408134];\nK. Agashe, R. Contino, L. Da Rold and A. Pomarol, Phys. Lett. B 641, 62 (2006) [arXiv:hep-ph/0605341]. G. Cacciapaglia, C. Csaki, J. Galloway, G. Marandella, J. Terning and A. Weiler, JHEP 0804, 006 (2008) [arXiv:0709.1714\n[hep-ph]].\nThe literature on the subject is vast. See for instance A. Birkedal, K. Matchev and M. Perelstein, Phys. Rev. Lett. 94,\n191803 (2005) [arXiv:hep-ph/0412278]; M. Papucci, arXiv:hep-ph/0408058; M. Fabbrichesi and L. Vecchi, Phys. Rev. D\n76, 056002 (2007) [arXiv:hep-ph/0703236].\nT. Appelquist and L. C. R. Wijewardhana, Phys. Rev. D 36, 568 (1987).\nSee for instance M. E. Peskin, Nucl. Phys. B 175, 197 (1980).\nW. A. Bardeen et al. Phys. Rev. Lett. 56, 1230 (1986); M. Bando et al. Phys. Lett. B 178, 308 (1986); Phys. Rev. Lett.\n56, 1335 (1986); B. Holdom and J. Terning, Phys. Lett. B 187, 357 (1987); Phys. Lett. B 200, 338 (1988). For more recent\nphenomenological studies see for instance W. D. Goldberger et al. Phys. Rev. Lett. 100, 111802 (2008); and L. Vecchi,\narXiv:1002.1721 [hep-ph].\nK. Haba, S. Matsuzaki and K. Yamawaki, arXiv:1003.2841 [hep-ph].\nW. D. Goldberger and M. B. Wise, Phys. Lett. B 475, 275 (2000) [arXiv:hep-ph/9911457]; C. Csaki, M. L. Graesser and\nG. D. Kribs, Phys. Rev. D 63, 065002 (2001) [arXiv:hep-th/0008151].\nS. Catterall and F. Sannino, Phys. Rev. D 76, 034504 (2007) [arXiv:0705.1664]; T. Appelquist et al., Phys. Rev. Lett.\n100, 171607 (2008) [Erratum-ibid. 102, 149902 (2009)] [arXiv:0712.0609 [hep-ph]]; Y. Shamir et al., Phys. Rev. D 78,\n031502 (2008) [arXiv:0803.1707]; A. Deuzeman et al., Phys. Lett. B 670, 41 (2008) [arXiv:0804.2905]; L. Del Debbio\net al., arXiv:0805.2058; S. Catterall et al., JHEP 0811, 009 (2008) [arXiv:0807.0792]; Z. Fodor et al., arXiv:0809.4890;\narXiv:0809.4888; X. Y. Jin and R. D. Mawhinney, [arXiv:0812.0413 [hep-lat]]. A. J. Hietanen et al., JHEP 0905, 025\n(2009) [arXiv:0812.1467]; T. DeGrand et al., Phys. Rev. D 79, 034501 (2009) [arXiv:0812.1427]; T. Appelquist et al.,\nPhys. Rev. D 79, 076010 (2009) [arXiv:0901.3766 [hep-ph]]; A. J. Hietanen et al., arXiv:0904.0864; A. Deuzeman et al.,\narXiv:0904.4662 [hep-ph]; Z. Fodor et al., JHEP 0908, 084 (2009) [arXiv:0905.3586]; T. DeGrand and A. Hasenfratz,\nPhys. Rev. D 80, 034506 (2009) [arXiv:0906.1976]; T. DeGrand, arXiv:0906.4543; A. Hasenfratz, arXiv:0907.0919; L. Del\nDebbio et al., arXiv:0907.3896; Z. Fodor et al., Phys. Lett. B 681, 353 (2009) [arXiv:0907.4562]; JHEP 0911, 103 (2009)\n[arXiv:0908.2466]; T. Appelquist et al., Phys. Rev. Lett. 104, 071601 (2010) [arXiv:0910.2224]; T. DeGrand, Phys. Rev.\nD 80, 114507 (2009) [arXiv:0910.3072]; E. Bilgici et al., arXiv:0910.4196; S. Catterall et al., arXiv:0910.4387; F. Bursa\net al., Phys. Rev. D 81, 014505 (2010) [arXiv:0910.4535]; B. Lucini, arXiv:0911.0020; J. B. Kogut and D. K. Sinclair,\narXiv:1002.2988.\nJ. Erlich, E. Katz, D. T. Son and M. A. Stephanov, Phys. Rev. Lett. 95, 261602 (2005) [arXiv:hep-ph/0501128]; L. Da\nRold and A. Pomarol, Nucl. Phys. B 721, 79 (2005) [arXiv:hep-ph/0501218].\nK. Skenderis, Class. Quant. Grav. 19, 5849 (2002) [arXiv:hep-th/0209067]; I. Papadimitriou and K. Skenderis,\narXiv:hep-th/0404176.\nM. Piai and M. Round, arXiv:0904.1524 [hep-ph].\nC. Csaki, C. Grojean, L. Pilo and J. Terning, Phys. Rev. Lett. 92, 101802 (2004) [arXiv:hep-ph/0308038]; Y. Nomura,\n\n\f67\n\n[53]\n[54]\n[55]\n[56]\n\n[57]\n[58]\n[59]\n[60]\n[61]\n[62]\n[63]\n[64]\n[65]\n[66]\n[67]\n[68]\n[69]\n[70]\n[71]\n[72]\n[73]\n[74]\n[75]\n[76]\n[77]\n\n[78]\n[79]\n\nJHEP 0311, 050 (2003) [arXiv:hep-ph/0309189].\nA. Karch, E. Katz, D. T. Son and M. A. Stephanov, Phys. Rev. D 74, 015005 (2006) [arXiv:hep-ph/0602229].\nJ. M. Maldacena and C. Nunez, Phys. Rev. Lett. 86, 588 (2001).\nI. R. Klebanov and M. J. Strassler, JHEP 0008, 052 (2000) [arXiv:hep-th/0007191].\nE. Witten, Adv. Theor. Math. Phys. 2, 505 (1998) [arXiv:hep-th/9803131]; T. Sakai and S. Sugimoto, Prog. Theor. Phys.\n113, 843 (2005) [arXiv:hep-th/0412141]. See also O. Aharony, J. Sonnenschein and S. Yankielowicz, Annals Phys. 322,\n1420 (2007) [arXiv:hep-th/0604161].\nJ. Polchinski and M. J. Strassler, arXiv:hep-th/0003136.\nOne simple example is K. Pilch and N. P. Warner, Adv. Theor. Math. Phys. 4, 627 (2002) [arXiv:hep-th/0006066]. See also\nD. Z. Freedman, S. S. Gubser, K. Pilch and N. P. Warner, Adv. Theor. Math. Phys. 3, 363 (1999) [arXiv:hep-th/9904017].\nand references there in.\nO. Aharony, S. S. Gubser, J. M. Maldacena, H. Ooguri and Y. Oz, Phys. Rept. 323, 183 (2000) [arXiv:hep-th/9905111].\nSee also M. Bertolini, Int. J. Mod. Phys. A 18, 5647 (2003) [arXiv:hep-th/0303160].\nC. Hoyos-Badajoz et al. Phys. Rev. D 78, 086005 (2008). See also R. Casero et al. Phys. Rev. D 73, 086005 (2006); Phys.\nRev. D 77, 046003 (2008).\nN. Itzhaki, J. M. Maldacena, J. Sonnenschein and S. Yankielowicz, Phys. Rev. D 58, 046004 (1998) [arXiv:hep-th/9802042].\nR. Apreda, F. Bigazzi, A. L. Cotrone, M. Petrini and A. Zaffaroni, Phys. Lett. B 536, 161 (2002) [arXiv:hep-th/0112236];\nP. Di Vecchia et al. Nucl. Phys. B 646, 43 (2002); M. Bertolini and P. Merlatti, Phys. Lett. B 556, 80 (2003).\nC. Nunez, A. Paredes and A. V. Ramallo, JHEP 0312, 024 (2003) [arXiv:hep-th/0311201].\nR. P. Andrews and N. Dorey, Nucl. Phys. B 751, 304 (2006) [arXiv:hep-th/0601098].\nG. Papadopoulos and A. A. Tseytlin, Class. Quant. Grav. 18, 1333 (2001) [arXiv:hep-th/0012034].\nI. R. Klebanov and E. Witten, Nucl. Phys. B 536, 199 (1998) [arXiv:hep-th/9807080].\nI. R. Klebanov and A. A. Tseytlin, Nucl. Phys. B 578, 123 (2000) [arXiv:hep-th/0002159].\nM. Berg et al. Nucl. Phys. B 736, 82 (2006); Nucl. Phys. B 789, 1 (2008).\nF. Bigazzi, A. L. Cotrone, M. Petrini and A. Zaffaroni, Riv. Nuovo Cim. 25N12, 1 (2002) [arXiv:hep-th/0303191]. See\nalso A. Butti, M. Grana, R. Minasian, M. Petrini and A. Zaffaroni, JHEP 0503, 069 (2005) [arXiv:hep-th/0412187].\nI. R. Klebanov and E. Witten, Nucl. Phys. B 556, 89 (1999) [arXiv:hep-th/9905104].\nM. J. Strassler, arXiv:hep-th/0505153.\nSome very remarkable aspect of this relation is discussed in J. Maldacena and D. Martelli, JHEP 1001, 104 (2010)\n[arXiv:0906.0591 [hep-th]].\nD. Elander, arXiv:0912.1600 [hep-th].\nK. G. Wilson, Phys. Rev. D 10, 2445 (1974).\nJ. M. Maldacena, Phys. Rev. Lett. 80, 4859 (1998) [arXiv:hep-th/9803001]; S. J. Rey and J. T. Yee, Eur. Phys. J. C 22,\n379 (2001) [arXiv:hep-th/9803001].\nY. Kinar, E. Schreiber and J. Sonnenschein, Nucl. Phys. B 566, 103 (2000) [arXiv:hep-th/9811192].\nS. J. Rey, S. Theisen and J. T. Yee, Nucl. Phys. B 527, 171 (1998)A. Brandhuber, N. Itzhaki, J. Sonnenschein\nand S. Yankielowicz, Phys. Lett. B 434, 36 (1998) [arXiv:hep-th/9803137]. A. Brandhuber, N. Itzhaki, J. Sonnenschein and S. Yankielowicz, JHEP 9806, 001 (1998) [arXiv:hep-th/9803263]. D. J. Gross and H. Ooguri, Phys.\nRev. D 58, 106002 (1998) [arXiv:hep-th/9805129]. D. E. Berenstein, R. Corrado, W. Fischler and J. M. Maldacena,\nPhys. Rev. D 59, 105023 (1999) [arXiv:hep-th/9809188]. N. Drukker, D. J. Gross and H. Ooguri, Phys. Rev. D 60,\n125006 (1999) [arXiv:hep-th/9904191]. H. Liu, K. Rajagopal and U. A. Wiedemann, Phys. Rev. Lett. 97, 182301\n(2006) [arXiv:hep-ph/0605178]. L. F. Alday and J. M. Maldacena, JHEP 0706, 064 (2007) [arXiv:0705.0303 [hepth]]. O. Lunin, JHEP 0606, 026 (2006) [arXiv:hep-th/0604133]. J. Gomis and F. Passerini, JHEP 0608, 074 (2006)\n[arXiv:hep-th/0604007]. S. Yamaguchi, JHEP 0605, 037 (2006) [arXiv:hep-th/0603208]. N. Drukker and B. Fiol, JHEP\n0502, 010 (2005) [arXiv:hep-th/0501109].\nJ. Sonnenschein, arXiv:hep-th/0003032.\nO. Mintakevich and J. Sonnenschein, JHEP 0907, 032 (2009) [arXiv:0905.3284 [hep-th]].\n\n\f"}