{"id": "http://arxiv.org/abs/0707.4156v1", "guidislink": true, "updated": "2007-07-27T17:39:08Z", "updated_parsed": [2007, 7, 27, 17, 39, 8, 4, 208, 0], "published": "2007-07-27T17:39:08Z", "published_parsed": [2007, 7, 27, 17, 39, 8, 4, 208, 0], "title": "Long-range fluctuations of random potential landscape as a mechanism of\n  1/f noise in hydrogenated amorphous silicon", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.1458%2C0707.1824%2C0707.0450%2C0707.4156%2C0707.2435%2C0707.1568%2C0707.1809%2C0707.2208%2C0707.1598%2C0707.4227%2C0707.0766%2C0707.0517%2C0707.1378%2C0707.4365%2C0707.3895%2C0707.0623%2C0707.0369%2C0707.1939%2C0707.0905%2C0707.3548%2C0707.4168%2C0707.3117%2C0707.4330%2C0707.3525%2C0707.1577%2C0707.4128%2C0707.0865%2C0707.1668%2C0707.1190%2C0707.2940%2C0707.4082%2C0707.3919%2C0707.2754%2C0707.1953%2C0707.2429%2C0707.2255%2C0707.3707%2C0707.1792%2C0707.4580%2C0707.3630%2C0707.3908%2C0707.0405%2C0707.0913%2C0707.3444%2C0707.2832%2C0707.2151%2C0707.0997%2C0707.3810%2C0707.1802%2C0707.0195%2C0707.4281%2C0707.2846%2C0707.2949%2C0707.2066%2C0707.4123%2C0707.2984%2C0707.3049%2C0707.0494%2C0707.0066%2C0707.4672%2C0707.3113%2C0707.3846%2C0707.1690%2C0707.1715%2C0707.2704%2C0707.0467%2C0707.3851%2C0707.3511%2C0707.1078%2C0707.2794%2C0707.1602%2C0707.0261%2C0707.3880%2C0707.4608%2C0707.1320%2C0707.3000%2C0707.0072%2C0707.3070%2C0707.1394%2C0707.4383%2C0707.3972%2C0707.0560%2C0707.2810%2C0707.3304%2C0707.4166%2C0707.3641%2C0707.3728%2C0707.4234%2C0707.1074%2C0707.1459%2C0707.3108%2C0707.2659%2C0707.2159%2C0707.2051%2C0707.0298%2C0707.3758%2C0707.0780%2C0707.0837%2C0707.1755%2C0707.1855%2C0707.1691&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Long-range fluctuations of random potential landscape as a mechanism of\n  1/f noise in hydrogenated amorphous silicon"}, "summary": "We describe a mechanism, which links the long-range potential fluctuations\ninduced by charged defects to the low frequency resistance noise widely known\nas 1/f noise. This mechanism is amenable to the first principles microscopic\ncalculation of the noise spectrum, which includes the absolute noise intensity.\nWe have performed such a calculation for the thin films of hydrogenated\namorphous silicon (a-Si:H) under the condition that current flows perpendicular\nto the plane of the films, and found a very good agreement between the\ntheoretical noise intensity and the measured one. The mechanism described is\nquite general. It should be present in a broad class of systems containing\npoorly screened charged defects.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.1458%2C0707.1824%2C0707.0450%2C0707.4156%2C0707.2435%2C0707.1568%2C0707.1809%2C0707.2208%2C0707.1598%2C0707.4227%2C0707.0766%2C0707.0517%2C0707.1378%2C0707.4365%2C0707.3895%2C0707.0623%2C0707.0369%2C0707.1939%2C0707.0905%2C0707.3548%2C0707.4168%2C0707.3117%2C0707.4330%2C0707.3525%2C0707.1577%2C0707.4128%2C0707.0865%2C0707.1668%2C0707.1190%2C0707.2940%2C0707.4082%2C0707.3919%2C0707.2754%2C0707.1953%2C0707.2429%2C0707.2255%2C0707.3707%2C0707.1792%2C0707.4580%2C0707.3630%2C0707.3908%2C0707.0405%2C0707.0913%2C0707.3444%2C0707.2832%2C0707.2151%2C0707.0997%2C0707.3810%2C0707.1802%2C0707.0195%2C0707.4281%2C0707.2846%2C0707.2949%2C0707.2066%2C0707.4123%2C0707.2984%2C0707.3049%2C0707.0494%2C0707.0066%2C0707.4672%2C0707.3113%2C0707.3846%2C0707.1690%2C0707.1715%2C0707.2704%2C0707.0467%2C0707.3851%2C0707.3511%2C0707.1078%2C0707.2794%2C0707.1602%2C0707.0261%2C0707.3880%2C0707.4608%2C0707.1320%2C0707.3000%2C0707.0072%2C0707.3070%2C0707.1394%2C0707.4383%2C0707.3972%2C0707.0560%2C0707.2810%2C0707.3304%2C0707.4166%2C0707.3641%2C0707.3728%2C0707.4234%2C0707.1074%2C0707.1459%2C0707.3108%2C0707.2659%2C0707.2159%2C0707.2051%2C0707.0298%2C0707.3758%2C0707.0780%2C0707.0837%2C0707.1755%2C0707.1855%2C0707.1691&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe a mechanism, which links the long-range potential fluctuations\ninduced by charged defects to the low frequency resistance noise widely known\nas 1/f noise. This mechanism is amenable to the first principles microscopic\ncalculation of the noise spectrum, which includes the absolute noise intensity.\nWe have performed such a calculation for the thin films of hydrogenated\namorphous silicon (a-Si:H) under the condition that current flows perpendicular\nto the plane of the films, and found a very good agreement between the\ntheoretical noise intensity and the measured one. The mechanism described is\nquite general. It should be present in a broad class of systems containing\npoorly screened charged defects."}, "authors": ["B. V. Fine", "J. P. R. Bakker", "J. I. Dijkhuis"], "author_detail": {"name": "J. I. Dijkhuis"}, "author": "J. I. Dijkhuis", "arxiv_comment": "14 pages, 3 figures, final version", "links": [{"href": "http://arxiv.org/abs/0707.4156v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.4156v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.4156v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.4156v1", "journal_reference": "Fluctuations and Noise Letters, v. 5, pp. L443-L456 (2005)", "doi": null, "fulltext": "arXiv:0707.4156v1 [cond-mat.stat-mech] 27 Jul 2007\n\nFluctuation and Noise Letters\nVol. 0, No. 0 (2001) 000–000\nc World Scientific Publishing Company\n\nLong-range fluctuations of random potential landscape as a mechanism\nof 1/f noise in hydrogenated amorphous silicon\n\nBoris V. Fine∗\nMax Planck Institute for the Physics of Complex Systems, Noethnitzer Str. 38, D-01187\nDresden, Germany\nand\nSpinoza Institute, P.O. Box 80195, 3508 TD Utrecht, The Netherlands\nJeroen P. R. Bakker and Jaap I. Dijkhuis\nDebye Institute, Utrecht University, P.O. Box 80000, 3508 TA Utrecht, The Netherlands\nReceived (received date)\nRevised (revised date)\nAccepted (accepted date)\nWe describe a mechanism, which links the long-range potential fluctuations induced by\ncharged defects to the low frequency resistance noise widely known as 1/f noise. This\nmechanism is amenable to the first principles microscopic calculation of the noise spectrum, which includes the absolute noise intensity. We have performed such a calculation\nfor the thin films of hydrogenated amorphous silicon (a-Si:H) under the condition that\ncurrent flows perpendicular to the plane of the films, and found a very good agreement\nbetween the theoretical noise intensity and the measured one. The mechanism described\nis quite general. It should be present in a broad class of systems containing poorly\nscreened charged defects.\nKeywords: 1/f noise, long-range potential fluctuations, amorphous silicon\n\n1.\n\nIntroduction\n\nIn this work we present a theoretical and experimental study of low-frequency voltage noise in μm-thick films of amorphous silicon (a-Si:H) under the condition that\nelectric current flows perpendicularly to the plane of the films. This phenomenon is\nassociated with resistance fluctuations, which, in the presence of current, manifest\nthemselves as voltage noise. The spectrum of this noise is close to 1/f , where f is\nthe frequency.\nOur motivation for this work is two-fold. On the one hand, we describe a\nnew microscopic mechanism of 1/f noise, which should be present in a variety\n∗ Present\n\naddress of B. V. F.: Physics Department, University of Tennessee, 1413 Circle Dr.,\nKnoxville, TN 37996, USA. E.mail:bfine@utk.edu\n\n\fLong-range fluctuations of random potential landscape ...\n\nof systems. On the other hand, the particular material studied, a-Si:H, is very\nimportant technologically because of its applications in various photo-voltaic devices\n(such as e.g. solar cells and thin-film transistors). The technological importance of\na-Si:H represents the further advantage, that this material has been heavily studied\nin the past, and, therefore, its microscopic characteristics, which we need as input\nto our theory, are reasonably well known [1].\nAmong many existing proposals aimed at the general description of 1/f noise,\nperhaps, the most successful one is the model of an ensemble of two-state systems\nhaving a broad distribution of activation energies (BDAE) [2–4]. The BDAE model\ngives a reasonable explanation for the generic nature of spectral shapes close to 1/f\nand, furthermore, (after Dutta, Dimon and Horn [4]) predicts the temperature dependence of the small deviations from that shape. It is the experimental observation\nof those small deviations in a variety of systems [5] that constitutes the strongest\nevidence for the adequacy of the BDAE model. However, this model as such does\nnot represent a full theoretical description of the noise, because it does not address\nthe origin of the two-state systems and the mechanism by which they couple to the\nresistance fluctuations. As a result, the absolute intensity of the 1/f noise remains\nan adjustable parameter.\nIn principle, it is not obvious at all that a universal mechanism should underlie\nevery occurrence of 1/f noise in the systems, that seem to obey the BDAE description. However, the unsatisfactory reality is that there are no examples (at least, we\nare not aware of any), when a microscopic mechanism of the 1/f noise has been\nworked out in full detail for one \"BDAE\" system, and, at the same time, the results\nof the calculation based on that mechanism have agreed with experiment. Here \"full\ndetail\" means: (i) the identification of microscopic fluctuators with their activation\nenergies and activation rates; (ii) identification of the mechanism that couples those\nfluctuators to the resistance noise; and (iii) a first principles calculation of the absolute noise intensity. Such a \"full detail\" treatment was recently given by us for\na-Si:H in Ref. [6] . This treatment, however, included many material-specific details,\nnot all of which were crucially important for the understanding the noise mechanism. In this work, we describe the same experimental setting as in Ref. [6] but\ndo so in a more intuitive way by replacing some detailed calculations with simple\nestimates. It turns out that the outcome of such a description is not much different\nfrom that of the full calculation.\n2.\n\nFilm characteristics and experimental details.\n\nWe study an n − i − n film of a-Si:H, where n denotes an electron doped layer,\nand i an undoped layer. The thickness of each of the n-layers is 40 nm, while the\nthickness of the i-layer is d = 0.91μm. The area of the film is A = 0.56cm2 . The\nfilm was grown by plasma enhanced chemical vapor deposition (PECVD). It was\nsubsequently thermally annealed and, afterwards, kept protected from light. The\nsetup of our noise experiments was the same as in Ref. [7].\nWe observed voltage noise spectra at frequencies f = 1 ÷ 104 Hz and temperatures T = 340 ÷ 434 K in the presence of electric current flowing perpendicularly\nto the plane of the film. The film itself was thus sandwiched between highly conductive contact layers. The voltages applied were small enough to correspond to\n\n\fFine, Bakker and Dijkhuis\n\nthe linear part of the film's I-V characteristic. The experiments were performed\nwithout illumination of the film.\n3.\n\nPrevious studies of 1/f noise in a-Si:H\n\nThe previous studies of 1/f noise in the films of a-Si:H [7–16] illustrate the general\nsituation described in Section 1: although a large body of diverse phenomenological\ninformation about the noise has been collected, the problem of identifying the origin\nof the noise has remained open.\nIn this work we focus only on one out of many possible situations that have\nbeen studied experimentally: perpendicular current, no illumination, undoped main\nresistivity layer, annealed sample. In that case, it was shown experimentally [7] that\n(i) the statistics of noise is Gaussian and (ii) the temperature dependence of the\nspectral slope (parametrizing the small deviations from the exact 1/f dependence)\nagrees well with the BDAE model.\nIt was evident since the early studies [8], that the timescales of activation for the\nelectron escape from deep defects in a-Si:H correspond well to the frequency range\nwhere the noise was observed. The problem was that, even though the energies of\nthe defect levels have a relatively broad distribution, the Fermi factor limits the\nnoise to the levels, which are located in the thermal window around the chemical\npotential [9]. This thermal window is not broad enough to give a spectral shape\nclose to 1/f .\nIf, nevertheless, one insists on computing the noise intensity associated with\nthe fluctuations of the defect occupation numbers, then there are still two general\nscenarios: the resistance fluctuations can be due to the fluctuations of either the\nnumber of free carriers or their mobility. The fluctuations of the number of free\ncarriers can be produced by the random emission and capture of free electrons by\ndeep defects. This possibility was investigated by Verleg and Dijkhuis [7] (albeit\non the basis of a very simple model). They came to conclusion that the noise\nintensity due to this mechanism would be several orders of magnitude smaller than\nthe one observed, and, furthermore, the timescale of such a noise would be controlled\nby the fast capture times rather than the slow emission times, which shifts the\ncharacteristic noise frequency away from the observation range. Later, a more\ndetailed theoretical investigation of this type of noise has supported the conclusion\nof a low noise intensity [17].\nA simple realization of mobility fluctuations could be related to the change of\nthe defect cross-sections. This scenario, however, has the problem that the relative\nconcentration of deep defects is too small to affect the transport of free carriers.\nThe mobility of free carriers is controlled mainly by the elastic scattering from the\nshort-range inhomogeneities of the amorphous lattice structure.\nOther mechanisms of the 1/f noise in a-Si:H have also been proposed, including\nthermally activated chemical processes [9], generation-recombination processes with\nvarious degrees of sophistication [7, 13, 18], and, finally, resistance networks near\npercolation threshold [19] (in the context of coplanar currents).\nAlthough, in principle, each of these proposals can be viable, none of them has\nbeen tested conclusively so far.\n\n\fLong-range fluctuations of random potential landscape ...\n\n4.\n\nOutline of the noise mechanism proposed in this work\n\nIn the following, we shall revive the old idea that the noise is caused by the fluctuations of the defect occupation numbers. That idea, however, is complemented by\na novel noise mechanism, which involves long-range potential fluctuations induced\nby fluctuations of the defect charges. These potential fluctuations then cause the\nfluctuations of the local densities of conduction electrons, which, in turn, lead to\nthe observed resistance fluctuations.\nIt is important to realize that the above mechanism should certainly be present\nin the material studied. Its theoretical description is quite straightforward and,\nat the same time, gives the value of integrated noise intensity without adjustable\nparameters. Therefore, if such a theory produces the noise intensity comparable\nwith the one observed in experiment, then it is quite unlikely that another noise\nmechanisms contributes to the experimental spectrum on the top of the one just\ndescribed.\nOur theoretical description also contains a new, though very simple, idea that\nthe distribution of the fluctuation rates of defect charges comes not just from the\ndistribution of the energy levels of electrons bound to the defects, but also from the\ndistribution of the activation barriers , which electrons have to overcome to escape\nfrom the defects. Unlike the former distribution, the later one is not truncated by\nthe Fermi factor [5, 9] and thus can underlie the spectral shape close to 1/f .\nIn the rest of this paper, our theory is exposed in Sections 5-9 followed by\ncomparison with experiments (Section 10) and conclusions(Section11). Central to\nour treatment is Section 7, which contains the description of the noise mechanism.\n5.\n\nQuantity of interest\n\nThe voltage noise spectrum can be expressed as:\nZ ∞\nSV (f )\n=\n4\nCV (t)cos(2πf t) dt,\nV2\n0\n\n(1)\n\nwhere V is the applied voltage, and\nCV (t) =\n\nhδV (t)δV (0)i\nhδR(t)δR(0)i\n=\n.\n2\nV\nR02\n\n(2)\n\nHere, δV (t) is the voltage fluctuation, R0 is the average resistance of the film, and\nδR(t) is the equilibrium resistance fluctuation.\nThe second equality in Eq.(2) follows from the assumption of constant current\nI flowing through the film, i.e. δV (t) = IδR(t) and V = IR0 . The assumption\nof constant current is granted, because (i) the current noise of external origin is\nsuppressed by a very large resistance connected in series with the film; and (ii)\nthe current noise of \"internal\" origin manifests itself at the equilibrium JohnsonNyquist noise [20,21], which was measured independently with zero applied voltage\nand then subtracted from the spectrum taken with non-zero voltage.\nThe link between the resistance noise and the voltage noise has also been established experimentally by observing that SV (f ) defined as the difference between\nthe spectra at zero applied voltage and non-zero applied voltage is proportional to\nV 2.\n\n\fFine, Bakker and Dijkhuis\n\n6.\n\nDescription of the resistivity layer\n\nIn the following, we consider a somewhat idealized problem of resistance noise coming from a resistivity layer of thickness zr and volume Vr = zr A having uniform\nmaterial characteristics. Because of the band bending, most of the resistance of our\nactual film originates from the center of the intrinsic layer. The effective thickness\nof that central layer is [6] zr = 0.26 μm.\nThe density of states of undoped a-Si:H is characterized by a band gap of 1.8 eV\nbetween the mobility edges Ev and Ec in the valence and conduction bands, respectively. The defect states, which play an important role in the noise mechanism,\nare located deep inside the band gap. Because of the proximity of the n-layers, the\nchemical potential μ is significantly closer to Ec than to Ev . (From the measurements of the conductivity activation energy, we estimate that Ec − μ = 0.63 eV.)\nAs a result, the number of electrons in the conduction band is much greater than\nthe number of holes in the valence band, i.e. conduction electrons are the primary\ncarriers of electric current.\nOne parameter, which is particularly important for the rest of this work, is rs ,\nthe screening radius of deep defects. In order to estimate it, we first note that the\nconventional mechanism of screening by conduction electrons is not operational in\nour film, because, at the temperatures of experiment, their concentration (1010 −\n1013 cm−3 ) is much smaller than the concentration of deep defects (∼ 1016 cm−3 .\nInstead, we identify two screening mechanisms: (i) by contact layers and (ii) by\nother deep defects. The effective screening radius due to both screening mechanisms\nwas estimated in Ref. [6] as 0.2 μm.\nIn order to simplify the theoretical description, we shall assume that rs ≪ zr ,\ni.e., in this sense, we consider three-dimensional \"bulk\" limit. In our film, rs ∼ zr .\nHowever, the noise intensity computed with the actual values of rs and zr differs\nfrom the outcome of the bulk limit calculation only by factor of two [6].\nWe also assume that the film is still thin enough, so that an electron emitted\nfrom a deep defect is much more likely to escape into the contact layers than to\nbe captured by another deep defect. This means that the charges of different deep\ndefects fluctuate independently. Such an assumption is well applicable to the experiments with transverse currents [6], because, in these experiments, the contact\nlayers spread over the entire film surface, which means that any defect in the resistivity layer is no more than half of the film thickness away from the contacts.\nHowever, the same assumption is not applicable to the experiments with co-planar\ncurrents [10–12, 14, 16, 22, 23], where the distance to contacts is of the order of the\nin-plane dimensions of the films.\n7.\n\nRelation between the resistance fluctuations and the long-range fluctuations of the local potential\n\nNow we describe the fluctuations of the resistivity within the resistivity layer. These\nfluctuations arise as a consequence of the fluctuations of the screened Coulomb\npotential φ(t, r) created by deep charged defects, known as dangling bonds:\nφ(t, r) =\n\n\u0013\n\u0012\nX ∆qi (t)\n|r − ai |\n.\nexp −\nǫ|r − ai |\nrs\ni\n\n(3)\n\n\fLong-range fluctuations of random potential landscape ...\n\nHere ∆qi (t) is the fluctuation of the ith defect charge with respect to its average\nvalue, ai the position the defect, rs the screening radius, and ǫ = 12 the dielectric\nconstant. The defects involved may be located outside of the resistivity layer.\nWhen the potential φ(t, r) fluctuates, the mobility edge tracks it, i.e.\nEc (t, r) = Ec0 + eφ(t, r),\n\n(4)\n\nwhere e is the electron charge. Since the chemical potential μ does not shift with\neφ(t, r), the density of conduction electrons, ne , re-equilibrates following Ec (t, r)\non the timescale of electron drift from the center of the i-layer to the n-layers.\nBecause of the strong band bending inside the i-layer [6], the drift takes less than\n10−7 s, i.e. the re-equilibration is effectively instantaneous on the timescales of the\n−4\nnoise studied ( 2π\n÷ 1 s). The fluctuating quasi-equilibrium density of the\nf ∼ 10\nconduction electrons is then proportional to exp [−(Ec (t, r) − μ)/kB T ], where kB\nis the Boltzmann constant. Finally, the fluctuating local resistivity ρ, which is is\ninversely proportional to ne , can be written as\n\u0012\n\u0013\nEc (t, r) − μ\nρ(t, r) = X exp\n,\n(5)\nkB T\nwhere X is a proportionality coefficient.\nAssuming for a moment [and proving later] that\n|eφ(t, r)| ≪ kB T,\n\n(6)\n\nρ(t, r) = ρ0 + δρ(t, r),\n\n(7)\n\nwe expand\nwhere\nρ0 = Xexp\n\n\u0012\n\nand\nδρ(t, r) =\n\nEc0 − μ\nkB T\n\n\u0013\n\neφ(t, r)\nρ0 .\nkB T\n\n,\n\n(8)\n\n(9)\n\nFor δρ ≪ ρ0 , the fluctuation of the total resistance (derived in the Appendix) is\nZ\n1\nδρ(t, r)d3 r,\n(10)\nδR(t) = 2\nA V\nwhere V is the space inside the resistivity layer (limited by ±zr /2 along the z-axis\nand by the edges of the film in the xy-plane). Substituting R0 = zr ρ0 /A and δR(t)\ngiven by Eq.(10) into Eq.(2), and then using Eq.(9), we obtain\n\u00132 Z\n\u0012\nZ\ne\n3\nd r d3 r′ hφ(t, r)φ(0, r′ )i.\n(11)\nCV (t) =\nkB T Vr\nV\nV\nGiven Eq.(3), the correlation function of potential fluctuations can be written as\n\u0014\n\u0015\nX h∆qi (t) ∆qj (0)i\n|r − ai | + |r′ − aj |\nhφ(t, r)φ(0, r′ )i =\nexp\n−\n(12)\nǫ2 |r − ai | |r′ − aj |\nrs\ni,j\n\n\fFine, Bakker and Dijkhuis\n\nEquation (11) should have a very broad range of applicability. All the materialspecific details affect only the evaluation of hφ(t, r)φ(0, r′ )i. In Ref. [6], we have\nperformed this evaluation taking into account numerous microscopic characteristics\nof a-Si:H. Below, however, we present a cruder estimate, which is more intuitive\nand yet reasonably accurate.\nThe time dependence of hφ(t, r)φ(0, r′ )i in Eq.(12) comes from the correlators\nof charge fluctuations h∆qi (t) ∆qj (0)i. For i 6= j, h∆qi (t) ∆qj (0)i = 0, because, as\ndiscussed in Section 6, the charge fluctuations of different defects are independent\nof each other. The non-zero contribution comes from the correlators with i = j,\nwhich can be expressed as\n\u0012\n\u0013\nt\n2\nh∆qi (t) ∆qi (0)i = h∆qi iexp −\n.\n(13)\nτi\nHere 1/τi is the fluctuation rate of the ith defect. The correlator is characterized by\na single exponent, because every defect is assumed to have only two states neutral\nor charged (with charge either +e or −e). The potential fluctuations are induced\nmainly by the defects, which we call \"thermally active\" or simply \"active.\" These\nactive defects have binding energies E in the thermal window ±2kB T around the\nchemical potential μ. Their concentration is, therefore,\nnT = 4 kB T D(μ),\n\n(14)\n\nwhere D(μ) is the density of defect states around the chemical potential. It can be\nestimated as\nnD\n,\n(15)\nD(μ) =\n2∆E\nwhere nD is the total concentration of deep defects, and ∆E is the half-width\nof the distribution of their binding energies. We have found that in our film [6]\nnD ≈ 6 1015 cm−3 , and ∆E ≈ 0.15 eV.\nIn comparison with the rest of the defects, the thermally active ones have the\nlargest amplitude of charge fluctuations. The absolute value of their charge has\nroughly the same probability to be 0 or e. Therefore, its mean value is e/2, and the\nmean squared amplitude of fluctuations is\nh∆qT2 i ≈\n\ne2\n.\n4\n\n(16)\n\nNow we estimate hφ(t, r)φ(0, r′ )i by taking the average over the spatial distribution of active defects (assumed to be random) and over the distribution of their\nrelaxation times (inverse fluctuation rates) Pτ (τ ). For this estimate we use the\nfollowing Ansatz:\n\u0013\n\u0015 Z\n\u0014\n\u0012\n|r − r′ |\nt\n′\n2\nPτ (τ ) dτ,\n(17)\nhφ(t, r)φ(0, r )i = hφ i exp −\nexp −\nrs\nτ\nwhere, from Eqs.(12,14,16),\n\u0013\n\u0012\nZ\nh∆qT2 i\n2πe2 rs D(μ)kB T\n2r′′\n2\n2\n2 ′′ 2\n′′\nhφ i ≡ hφ(0, 0) i =\nn\n4π\nr\ndr\n=\n,\nexp\n−\nT\nrs\nǫ2\nǫ2 r′′ 2\n(18)\n\n\fLong-range fluctuations of random potential landscape ...\n\nEB\n\nE nergy\n\nEC\nE\n1 nm\nPosition\nFig 1. Cartoon of a deep defects surrounded by medium-range structural disorder. Note: eφ(t, r)\nfluctuates on a much longer length scale and with much smaller amplitude.\n\nwhere r′′ is an integration variable corresponding to |rp− ai | in Eq.(12). From\nEq.(18), the value of |eφ(t, r)| can be estimated as: e hφ2 i ∼ 3.5meV. Since\nkB T ∼ 30meV, the assumption (6) was adequate.\nSubstituting Eqs.(17,18) into Eq.(11) and integrating over r and r′ (under the\nassumption rs ≪ zr made in Section 6), we obtain\n16π 2 e4 rs4 D(μ)\nCV (t) =\nǫ2 kB T Vr\n\nZ\n\n\u0013\n\u0012\nt\nPτ (τ ) dτ.\nexp −\nτ\n\n(19)\n\nNow we discuss the origin of the distribution of the activation times Pτ (τ ).\n8.\n\nActivation barriers\n\nIn order to escape from a deep defect, an electron should reach the mobility edge Ec .\nHowever, the activation barriers EB (indicated in Fig.1) can vary as a result of the\nmedium-range disorder of the amorphous structure (on a length scale of 1 ÷ 10 nm).\nThe activation time of a thermally active defect should then read\n\u0012\n\u0013\nEB − μ\nτ (EB ) = τ0 exp\n,\n(20)\nkB T\nwhere τ0 is the prefactor of the order of 10−13 s [6].\nIn Ref. [6], we have assumed Gaussian probability distribution for the values of\nEB :\n\u0012\n\u0013\n(EB − EB0 )2\n1\nexp −\n.\n(21)\nP (EB ) = √\n2\n2∆EB\n2π∆EB\nwhere EB0 and ∆EB were extracted from the experimental spectra. These were the\nonly two adjustable parameters in our treatment. We have found that EB0 − μ =\n0.9 eV (0.27 eV above Ec0 ), while ∆EB = 0.09 eV\n\n\fFine, Bakker and Dijkhuis\n\nSuch an adjustment, however, does not compromise the experimental tests of\nthe theory. The values of EB0 and ∆EB affect the spectral shape but not the integrated noise intensity. Therefore, if the theory predicts a too small noise prefactor,\nthe adjustment of these two parameters only redistributes the spectral intensity in\nthe range of observations but cannot make the theoretical spectra agree with the\nexperimental ones. In the next Section, we shall proceed with an estimate of the\nprefactor in front of the (approximate) 1/f spectral dependence, which is independent of the assumption of the Gaussian shape of P (EB ), but instead relies only\non the crude value of ∆EB ∼ 0.1 eV. Since ∆EB is a characteristics of the energy\nlandscape in a-Si:H, one can hardly expect that it has a much different value. We\nshall also estimate the integrated noise intensity, which does not depend on the\nvalue of ∆EB at all.\nAlthough the idea that the activation barriers should be distributed is very\nsimple, it has not been exploited previously. One issue here is whether the barriers\nare long enough or high enough to ensure that the activation processes dominate\nthe tunneling under the potential landscape. Given that not much is reliably known\nabout the random potential landscape on the scale of 1 ÷ 10 nm, it is only obvious\nthat the relatively high temperatures of experiment favor the activation processes.\nFrom our crude theoretical estimates, the activation over a barrier, which is 0.3 eV\nhigh and 3.5 nm, long starts dominating the tunneling under the same barrier at\nT = 340K. For smaller barrier heights or higher temperatures, the critical length\nof the barrier becomes smaller.\nHowever, our main argument in favor of the existence of the distribution of\nactivation barriers is purely empirical:\nThe mechanism we describe remains perfectly valid, if one assumes that the\nactivation barriers are not distributed at all, i.e. there exists only one activation\nbarrier for all defects: EB = Ec0 , and, therefore, P (EB ) = δ(EB −Ec0 ). In that case,\nthe theoretical spectral intensity predicted by our treatment would significantly\nexceed the experimental one in the higher frequency part of the observed spectrum\nat T = 340K. One would then have to explain, how another noise mechanism\nsuppresses the spectral intensity due to the present one - a task, which seems to\nbe extremely difficult if not impossible.\n9.\n\nEvaluation of the noise spectrum\n\nSubstituting Eq.(19) into Eq.(1) and also using Eq.(20) to switch from integration\nover τ to integration over EB , we obtain\n64π 2 e4 rs4 D(μ)\nSV (f )\n=\n2\nV\nǫ2 kB T Vr\n\nZ\n\n+∞\n\n−∞\n\nτ (EB )P (EB )dEB\n1 + 4π 2 f 2 τ 2 (EB )\n\n(22)\n\nSince the proximity to the 1/f spectral shape results only from the fact that the\ndistribution P (EB ) is much broader than kB T , we obtain the prefactor in front of\nthe 1/f dependence by substituting the constant value\nP (EB ) =\n\n1\n2∆EB\n\n(23)\n\n\fLong-range fluctuations of random potential landscape ...\n\ninto Eq.(22), which gives\nSV (f )\n8π 2 e4 rs4 D(μ) 1\n≈\n.\n2\nV\nǫ2 Vr ∆EB\nf\n\n(24)\n\nThe above estimate cannot be applicable to all frequencies, because Eq.(23) explicitly violates the normalization condition. Nevertheless, expression (24) constitutes\na good approximation in a broad frequency domain around the frequency corresponding to the maximum of the probability distribution P (EB ).\nOne can also obtain the integrated noise intensity (of course, not from the approximation (24) but from Eq.(22)):\nZ ∞\n16π 2 e4 rs4 D(μ)\nSV (f )\ndf ≡ CV (0) =\n.\n(25)\n2\nV\nǫ2 kB T Vr\n0\nIf the estimate (15) for D(μ) is substituted into Eqs.(22,24), then the \"bulk limit\"\nresults obtained from a more accurate description and reported in Ref. [6] can be\nrecovered.\nThe remarkable fact about expressions (24,25) is that, even though the noise\nmechanism rests on the fluctuations of the number of conduction electrons, the resulting spectrum is independent of their equilibrium concentration. Furthermore,\nthe distinct feature of Eq.(24) is that the noise prefactor does not depend on temperature. This should be contrasted with the popular empirical law due to Hooge [24],\naccording to which the noise prefactor is inversely proportional to the number of\n(thermally activated) carriers and thus decreases exponentially as temperature increases. As far as the defect characteristics are concerned, then the noise intensity\ndepends only on one of them, namely, D(μ), the density of the defect states at the\nchemical potential. This dependence is, in fact, weaker than the simple proportionality to D(μ), and may even exhibit the opposite trend, because deep defects in\nundoped a-Si:H screen each other, and therefore, the screening radius rs decreases\nwith the increase of D(μ) (see Ref. [6]).\n10.\n\nComparison with experiment\n\nIn Fig. 2, the theoretical spectrum (24) is compared with the experimental ones\ntaken at four different temperatures. The experimental spectra are the same as\nreported in Ref. [6]. They were obtained by subtracting the zero-current noise\nfrom the total noise observed with V = 50 meV. The numbers substituted into the\ntheoretical spectrum (24) are the following: rs = 0.2 μm, ∆EB = 0.1 eV, ǫ = 12,\nVr = zr A = 0.26 μm × 0.56 cm2 , D(μ) is obtained from the estimate (15) with\nnD = 6 1015 cm−3 and ∆E = 0.15 eV.\nOne can observe that (i) the experimental spectra at four different temperatures\nstrongly overlap with each other, in agreement with the temperature independent\nform of the theoretical expression (24); and (ii) the absolute value of the experimental spectra agree within factor of three with the value given by Eq.(24).\nIn Fig. 3, we present the comparison between the theoretical (Eq.(25)) and the\nexperimental values of the integrated noise intensity (obtained with the numbers\ngiven above). Since the window of experimental observation does not extend over\nthe infinite range of frequencies, we employed the following extrapolation procedure,\n\n\fFine, Bakker and Dijkhuis\n\nSV \u0090V2 @sD\n\n340 K\n362 K\n\n10-12\n\n402 K\n434 K\n\n10-14\n\n1\n\n102\n\n104\n\nf @HzD\nFig 2. (a) Noise spectra: solid lines represent the experimental data taken at four different\ntemperatures indicated in the plot; dashed line represents the theoretical prediction (24).\n\nwhich entailed large but quantifiable uncertainties. First, we obtained the lower\nends of the error bars by integrating the experimental noise spectra only in the\nfrequency range of the actual experimental observations. Then, the upper ends\nwere obtained by making the power law extrapolations of the spectra beyond the\nfrequency range of observation (up to 10−6 Hz for small frequencies and 108 Hz for\nlarge frequencies), and then adding the integrals over the extrapolated tails to the\nlower end values of the error bars. Finally, the \"experimental\" points indicated in\nFig. 3 were chosen as the middle points of the above error bars.\nGiven the relatively crude estimates, which were involved at various stages of the\nderivation of Eqs.(24,25), and the uncertainty of the values of rs , D(μ) and ∆EB ,\nthe agreement is, in fact, very good. In particular, since rs enters Eqs.(24,25) in\nthe fourth power, the uncertainty in the value of rs is the single largest source of\nerror in the theoretical predictions. The factor of three discrepancy would vanish\nif, e.g. 0.15 μm were used for rs instead of 0.2 μm. In the present case, however,\nmost of the discrepancy can be attributed not to the uncertainty in the value of rs\nbut to a controllable theoretical error. Namely, the application of the \"bulk limit\"\nrs ≪ zr to the situation, where rs ∼ zr , increases the value of the theoretical noise\nintensity by factor of two [6]. It has also been shown in Ref. [6] that the calculation\na la Dutta, Dimon and Horn [4], which uses the Gaussian distribution of energy\nbarriers (Eq.(21)), can account for the temperature-dependent suppression of the\nnoise intensity at the low-frequency end of the experimental spectra.\nFinally, we should mention that two additional experimental tests of the present\n\n\fIntegral of Sv HfL\u0090V2\n\nLong-range fluctuations of random potential landscape ...\n\n2 10-10\n\n10-10\n\n0\n340\n\n360\n\n380\n400\nT, @KD\n\n420\n\n440\n\nFig 3. Integrated noise intensity. Empty dots represent the experimental values for the four spectra\nshown in Fig. 2. The error bars on the experimental points are obtained as described in the text.\nThe solid line corresponds to the theoretical expression (25).\n\ntheory, which involve different sandwich structures, are reported by us in an different\nwork [25].\n11.\n\nConclusions\n\nIn conclusion, we have described a microscopic mechanism of 1/f noise in n − i − n\nsandwich structures of a-Si:H. A very good agreement between this description and\nour experiments clearly indicates that in the frequency domain 1 − 104 Hz, the\nnoise mechanism proposed is responsible for at least a substantial fraction of the\nnoise intensity observed in experiment. Since this mechanism is quite general, its\napplicability to a broader class of materials merits further investigation.\nACKNOWLEDGMENTS\nWe thank R. E. I. Schropp for providing us with the sample. The work of B. V. F.\nwas supported in part by the Netherlands Foundation \"Fundameteel Onderzoek der\nMaterie\" (FOM) and the \"Nederlandse Organisatie voor Wetenschapelijk Onderzoek\" (NWO).\nAPPENDIX\nHere we derive the relationship (10) between small resistivity fluctuations and the\nresistance fluctuations.\nWe shall assume that the spatial coarse-graining, which in the following underlies\ncontinuous integration, is of the order of 0.01μm. It is thus much greater than the\nballistic mean free path lb ≈ 5÷10Å. Therefore, the electric current flowing through\neach coarse-grained element can be characterized by Ohm's law:\nE(r) = ρ(r)j(r),\n\n(26)\n\n\fFine, Bakker and Dijkhuis\n\nwhere E is the electric field, ρ the resistivity, j the current density, and r ≡ (x, y, z)\nthe position in the sample. The z-axis is chosen along the direction of total current,\ni.e. perpendicular to the plane of the film.\nThe potential difference across the resistivity layer is given by integral\nV =\n\nZ\n\nzr /2\n\nEz (x0 , y0 , z)dz =\n\n−zr /2\n\nZ\n\nzr /2\n\nρ(x0 , y0 , z)jz (x0 , y0 , z)dz,\n\n(27)\n\n−zr /2\n\nwhere x0 and y0 are just two arbitrary coordinates in the plane of the film. In the\nfollowing, however, we shall use a somewhat redundant but equivalent expression:\nV =\n\n1\nA\n\nZ\n\nzr /2\n\ndz\n−zr /2\n\nZ\n\ndx dy ρ(x, y, z) jz (x, y, z),\n\n(28)\n\nA\n\nwhich represents the average over the equal values of the voltage difference over the\narea A of the film.\nAs a zero approximation, we consider a layer spreading along the z-axis from\n−zr /2 to zr /2 and having uniform resistivity ρ0 . We thus represent the total resistivity as\nρ(t, r) = ρ0 + δρ(t, r),\n(29)\nwhere δρ(t, r) is a small correction caused by the long-range fluctuations of the local\npotential\nIn general, the resistivity fluctuations are accompanied by the fluctuations δj(t, r)\nof the current density. The expression for the total current density is thus\nj(t, r) = j0 + δj(t, r),\nwhere\nj0 =\n\n\u0013\n\u0012\nI\n.\n0, 0,\nA\n\n(30)\n\n(31)\n\nThe fact, that the total current through the film should stay constant in the presence\nof the resistance fluctuations, imposes the following constraint:\nZ\nδjz (t, x, y, z0 ) dx dy = 0,\n(32)\nA\n\nwhere z0 is an arbitrary coordinate between −zr /2 and zr /2.\nLinearizing Eq.(28) with respect to δρ and δj we obtain\nZ\n1\n[δρ(t, r)j0z + ρ0 δjz (t, r)] dx dy dz,\nδV (t) =\nA V\n\n(33)\n\nwhere V refers to the three-dimensional space limited by ±zr /2 along the z axis\nand by the edges of the film in the xy-plane. The integration of the second term in\nEq.(33) gives zero by virtue of constraint (32). Thus, recalling that j0z = I/A, we\nobtain Eq.(10)\nZ\n1\nδV (t)\n= 2\nδρ(t, r) d3 r.\n(34)\nδR(t) =\nI\nA V\n\n\fLong-range fluctuations of random potential landscape ...\n\nReferences\n[1] R. A. Street, Hydrogenated amorphous silicon, Cambridge University Press, Cambridge, 1991.\n[2] A. van der Ziel, Physica (Utrecht) 16, p. 359, 1950.\n[3] F. K. du Pre, Phys. Rev. 78, p. 615, 1950.\n[4] P. Dutta, P.Dimon, and P.M.Horn, Phys. Rev. Lett. 43, p. 646, 1979.\n[5] M. B. Weissman, Rev. Mod. Phys. 60, p. 537, 1988.\n[6] B. V. Fine, J. P. R. Bakker, and J. I. Dijkhuis, Phys. Rev. B 68, p. 125207, 2002.\neprint cond-mat/0210680.\n[7] P. A. W. E. Verleg and J. I. Dijkhuis, Phys. Rev. B 58, p. 3904, 1998.\n[8] F. Z. Bathaei and J. C. Anderson, Philos. Mag. B 55, p. 87, 1987.\n[9] M.Baciocchi, A.D'Amico, and C. Vliet, Solid-St. Electron. 34, p. 1439, 1991.\n[10] C. E. Parman and J. Kakalios, Phys. Rev. Lett. 67, p. 2529, 1991.\n[11] C. E. Parman, N. E. Israeloff, and J. Kakalios, Phys. Rev. B 44, p. 8391, 1991.\n[12] G. M. Khera and J. Kakalios, Phys. Rev. B 56, p. 1918, 1997.\n[13] P. A. W. E. Verleg and J. I. Dijkhuis, Phys. Rev. B 58, p. 3917, 1998.\n[14] M. Günes, R. Johanson, and S. Kasap, Phys. Rev. B 60, p. 1477, 1999.\n[15] S. T. B. Goennenwein et al., Phys. Rev. Lett. 84, p. 5188, 2000.\n[16] R. E. Johanson et al., J. Vac. Sci. Technol. A 18, p. 661, 2000.\n[17] J. P. R. Bakker, Ph. D. thesis, University of Utrecht , 2003.\n[18] J. P. R. Bakker, P. J. S. van Capel, B. V. Fine, and D. I. Dijkhuis, MRS Proceedings\n715, p. A2.6, 2002.\n[19] L. M. Lust and J. Kakalios, Phys. Rev. Lett. 75, p. 2192, 1995.\n[20] J. B. Johnson, Phys. Rev. 32, p. 97, 1928.\n[21] H. Nyquist, Phys. Rev. 32, p. 110, 1928.\n[22] S. O. Kasap, M. Gunes, R. E. Johanson, Q. Wang, Y. Yang, and S. Guha, J. Mater.\nSci.: Materials in Electronics 14, pp. 693–696, 2003.\n[23] T. J. Belich and J. Kakalios, Phys. Rev. B 66, p. 195212, 2002.\n[24] F. N. Hooge, Phys. Lett. A 29, p. 139, 1969.\n[25] J. P. R. Bakker, P. J. S. van Capel, B. V. Fine, and J. I. Dijkhuis, J. Non-Cryst.\nSolids 338-340, p. 310, 2004. eprint cond-mat/0310468.\n\n\f"}