{"id": "http://arxiv.org/abs/1110.6880v2", "guidislink": true, "updated": "2011-11-01T23:38:44Z", "updated_parsed": [2011, 11, 1, 23, 38, 44, 1, 305, 0], "published": "2011-10-31T18:12:59Z", "published_parsed": [2011, 10, 31, 18, 12, 59, 0, 304, 0], "title": "Testing Lattice Quantum Gravity in 2+1 Dimensions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.1547%2C1110.1092%2C1110.0151%2C1110.1689%2C1110.1216%2C1110.1315%2C1110.2298%2C1110.6239%2C1110.0451%2C1110.5357%2C1110.5335%2C1110.4274%2C1110.3344%2C1110.1709%2C1110.0308%2C1110.5443%2C1110.0902%2C1110.0687%2C1110.2743%2C1110.6301%2C1110.2813%2C1110.4820%2C1110.3467%2C1110.3804%2C1110.5266%2C1110.1264%2C1110.1736%2C1110.1518%2C1110.3581%2C1110.0893%2C1110.0681%2C1110.2900%2C1110.1207%2C1110.0206%2C1110.4773%2C1110.6820%2C1110.6924%2C1110.2018%2C1110.4205%2C1110.4309%2C1110.6199%2C1110.0939%2C1110.2377%2C1110.2710%2C1110.5450%2C1110.6432%2C1110.5350%2C1110.3907%2C1110.0438%2C1110.6836%2C1110.0480%2C1110.5841%2C1110.6246%2C1110.4243%2C1110.1292%2C1110.4341%2C1110.5943%2C1110.4543%2C1110.2281%2C1110.6388%2C1110.2891%2C1110.5776%2C1110.2866%2C1110.5976%2C1110.0582%2C1110.5294%2C1110.3432%2C1110.2208%2C1110.4922%2C1110.3056%2C1110.6883%2C1110.3960%2C1110.0576%2C1110.5202%2C1110.6327%2C1110.1871%2C1110.0160%2C1110.3417%2C1110.5707%2C1110.3500%2C1110.5536%2C1110.3406%2C1110.1203%2C1110.2849%2C1110.2012%2C1110.1179%2C1110.0107%2C1110.5497%2C1110.0881%2C1110.0984%2C1110.4339%2C1110.6880%2C1110.2390%2C1110.4160%2C1110.4364%2C1110.4765%2C1110.2252%2C1110.1853%2C1110.5032%2C1110.0270%2C1110.0504&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Testing Lattice Quantum Gravity in 2+1 Dimensions"}, "summary": "Borrowing techniques from cosmology, I compute the power spectrum of quantum\nfluctuations in (2+1)-dimensional causal dynamical triangulations, a promising\ndiscrete path integral approach to quantum gravity. The results agree with\nthose of canonical quantization to a high degree of precision, providing strong\nevidence for the equivalence of the two approaches and for the validity of the\ndiscrete method.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.1547%2C1110.1092%2C1110.0151%2C1110.1689%2C1110.1216%2C1110.1315%2C1110.2298%2C1110.6239%2C1110.0451%2C1110.5357%2C1110.5335%2C1110.4274%2C1110.3344%2C1110.1709%2C1110.0308%2C1110.5443%2C1110.0902%2C1110.0687%2C1110.2743%2C1110.6301%2C1110.2813%2C1110.4820%2C1110.3467%2C1110.3804%2C1110.5266%2C1110.1264%2C1110.1736%2C1110.1518%2C1110.3581%2C1110.0893%2C1110.0681%2C1110.2900%2C1110.1207%2C1110.0206%2C1110.4773%2C1110.6820%2C1110.6924%2C1110.2018%2C1110.4205%2C1110.4309%2C1110.6199%2C1110.0939%2C1110.2377%2C1110.2710%2C1110.5450%2C1110.6432%2C1110.5350%2C1110.3907%2C1110.0438%2C1110.6836%2C1110.0480%2C1110.5841%2C1110.6246%2C1110.4243%2C1110.1292%2C1110.4341%2C1110.5943%2C1110.4543%2C1110.2281%2C1110.6388%2C1110.2891%2C1110.5776%2C1110.2866%2C1110.5976%2C1110.0582%2C1110.5294%2C1110.3432%2C1110.2208%2C1110.4922%2C1110.3056%2C1110.6883%2C1110.3960%2C1110.0576%2C1110.5202%2C1110.6327%2C1110.1871%2C1110.0160%2C1110.3417%2C1110.5707%2C1110.3500%2C1110.5536%2C1110.3406%2C1110.1203%2C1110.2849%2C1110.2012%2C1110.1179%2C1110.0107%2C1110.5497%2C1110.0881%2C1110.0984%2C1110.4339%2C1110.6880%2C1110.2390%2C1110.4160%2C1110.4364%2C1110.4765%2C1110.2252%2C1110.1853%2C1110.5032%2C1110.0270%2C1110.0504&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Borrowing techniques from cosmology, I compute the power spectrum of quantum\nfluctuations in (2+1)-dimensional causal dynamical triangulations, a promising\ndiscrete path integral approach to quantum gravity. The results agree with\nthose of canonical quantization to a high degree of precision, providing strong\nevidence for the equivalence of the two approaches and for the validity of the\ndiscrete method."}, "authors": ["Michael K. Sachs"], "author_detail": {"name": "Michael K. Sachs"}, "author": "Michael K. Sachs", "arxiv_comment": "13 pages, 11 figures", "links": [{"href": "http://arxiv.org/abs/1110.6880v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.6880v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.6880v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.6880v2", "journal_reference": null, "doi": null, "fulltext": "1\n\nTesting Lattice Quantum Gravity in 2+1 Dimensions\nMichael K. Sachs 1\nUniversity of California, Davis\nOne Shields Avenue\nDavis, CA 95616\n\narXiv:1110.6880v2 [gr-qc] 1 Nov 2011\n\nBorrowing techniques from cosmology, I compute the power spectrum of quantum fluctuations in (2+1)-dimensional\ncausal dynamical triangulations, a promising discrete path integral approach to quantum gravity. The results agree\nwith those of canonical quantization to a high degree of precision, providing strong evidence for the equivalence of\nthe two approaches and for the validity of the discrete method.\n\n1\n\nIntroduction\n\nFew quantum theories start their lives as quantum theories. Most are born in the familiar classical realm and\nquantized. There are many ways of performing this\nquantization, but they mostly fall into two broad categories. The first, path integral quantization, is based\non the principal of least action in classical mechanics.\nAn integral is constructed over all field configurations\nbetween some initial and final boundary configurations\nwith the action contributing a phase factor to each configuration. In the second method, canonical quantization, variables in the classical theory are promoted to\noperators on a Hilbert space. The structure of the theory is then defined through commutators of these variables.\nWhen applying these techniques to general relativity\nmany technical and conceptual difficulties arise. These\nproblems are so severe that no one has yet been able to\novercome them except in certain simplified cases. And\nthe situation gets even worse; it is unclear if the results\nfrom the different quantization procedures, were we able\nto carry them out in full, would agree with each other\n[1]. So the question arises: if there are several theories that yield the same classical behavior but describe\nvery different quantum mechanics, which is the correct\nquantum theory?\nIn this paper I will examine the results from two\ndifferent approaches to quantizing gravity that can be\ncarried out in full. The first is the reduced phase space\nquantization of (2+1)-dimensional gravity with spherical topology. The reduced dimensionality and simple\ntopology yield a trivial classical spacetime. This simplicity is preserved when the theory is quantized, resulting\nin a quantum theory with no degrees of freedom. The\nsecond approach is causal dynamical triangulations, a\nlattice regularization of the gravitational path integral.\nSmooth spacetime is approximated by a triangulated\nmesh and the path integral is approximated by a sum\nover inequivalent triangulations. The sum is computed\nusing Monte Carlo techniques, and the resulting spacetime is analyzed using techniques borrowed from the\n1 e-mail:\n\nmksachs@ucdavis.edu\n\nanalysis of cosmic microwave background temperature\nfluctuations. I find that the resulting measurements reveal an extremely spherical spacetime, indicating that\nthe two quantization techniques yield very similar results.\n\n2\n\n(2+1)-dimensional gravity and\ncanonical quantization\n\nThe action for general relativity is the Einstein-Hilbert\naction\n\nSEH =\n\n1\n16πG\n\nZ\n\n√\nd4 x −g (R − 2Λ) ,\n\n(1)\n\nM\n\nand the Euler-Lagrange equations give us the Einstein\nfield equations\n1\nRμν − gμν R + Λgμν = −8πGTμν .\n2\n\n(2)\n\nAs one would expect, working in 2+1 dimensions\ngreatly simplifies the equations of motion. In d dimensions (2) allows d(d − 3) local phase space degrees of\nfreedom [2, 3]. In d = 4 this gives us the 4 degrees of\nfreedom that result in gravitational waves. In d = 3 ,\nhowever, this results in zero local degrees of freedom.\nAdditionally, in 2+1 dimensions the curvature tensor\nRμνρσ depends linearly on the Ricci tensor Rμν . This\nmeans that vacuum solutions to (2) are flat if Λ = 0\nand of constant curvature if Λ 6= 0 [2, 3].\nSo it seems that choosing to work in 2+1 dimensions\nhas given us a fairly boring universe to work with. It\nturns out that exactly how boring depends on the topology of spacetime. In general our manifolds M will decompose into one-dimensional timelike intervals I and\ntwo-dimensional spacelike manifolds Σ ; more compactly\nI × Σ . If we choose Σ to be any manifold containing non-contractible curves (e.g., a torus) the resulting\nholonomies will yield a finite number of global degrees of\nfreedom [3, 4]. For our purposes, we want the simplest\npossible scenario to work with, so we will work with a\n\n\f2\n\nspacelike manifold in which all curves are contractible.\nIf we choose our constant curvature to be positive, this\nleaves us with a two-sphere S 2 . The simplest possible\n2+1 dimensional topology we can look at is then I ×S 2 .\nQuantizing even this simple spacetime is far from\nstraightforward. A detailed description of how one goes\nabout doing this can be found in [3]. The result is that\nif one chooses to apply the classical constraints first and\nthen quantize the system, one ends up with a quantized\nspacetime with no local or global degrees of freedom.\nThe Hilbert space is one-dimensional; the 2-sphere that\nwe started with remains a 2-sphere, around which there\nare no quantum fluctuations.\n\nbone. The sum over deficit angles, weighted by the \"volume\" Vb of each bone, is proportional to the integral of\nthe scalar curvature over the surface:\nX\n\nVb δb =\n\nb\n\n1\n2\n\n√\nR gdn x.\n\nZ\n\n(5)\n\nS\n\nWe are now ready to write down a discrete version\nof (1), called the Regge action [6, 7]:\n\nSEH → SR =\n\n1 X\nΛ\nV b δb −\n8πG\n8πG\nbones\n\nX\n\nVsimplex .\n\nn−simplices\n\n(6)\n\n3\n\nLattice quantum gravity and\ncovariant quantization\n\nThe basic idea behind quantizing a classical theory using\nthe path integral approach is to form an integral over all\npossible field configurations between some fixed initial\nand final configurations. The field configurations we will\nintegrate over are essentially all of the unique geometries characterized by spacetime metrics interpolating\nbetween some starting spatial geometry and some ending spatial geometry. Along with the Einstein-Hilbert\naction (1), we now have all the ingredients we need to\nwrite down a formal path integral for quantum gravity:\nZ\nZ=\n\nD[g]eiSEH .\n\n(3)\n\nIn practice, expressions like (3) are usually calculated using perturbation theory. This approach fails\nwith gravity, however, because the perturbation series\nis non-renormalizable [5]. In order to proceed, we need\nto introduce some kind of regularization scheme. We\nwill do this by approximating the smooth manifolds M\nby a collection of flat simplices glued together at their\nedges, very much like a smooth sphere is approximated\nby a geodesic dome.\nIn two dimensions, the simplex used is a triangle.\nSince the triangle is flat, any curvature in the surface\ncreated by glued together triangles is concentrated at\nvertices v where i triangles come together, and is characterized by the deficit angle:\nδv = 2π −\n\nX\n\nθvi .\n\n(4)\n\ni\n\nIn n dimensions, triangles are replaced with n dimensional simplices connected to other simplices by\n(n − 2) -dimensional vertices or \"bones.\" The curvature\nat each bone is still described by (4), where the dihedral\nangle θ is now measured around an (n − 2) -dimensional\n\nThe path integral (3) over all unique field configurations is then taken to be a sum over all unique triangulations T weighted by SR :\nZ\nZ=\n\nD[g]eiSEH → Z =\n\nX\nT\n\n1 iSR\ne ,\nC(T )\n\n(7)\n\n1\nwhere C(T\n) is a symmetry factor with C(T ) being the\norder of the automorphism group for triangulation T\n[8, 9].\n\n3.1\n\nCausal dynamical triangulations\n\nHistorically, discrete approaches to gravity were constructed using Euclidian building blocks. This was\nmostly done for technical reasons; the weight factors in\n(7) become real, which is usually necessary for the sums\nto converge. However, these approaches were unable\nto reproduce classical spacetimes [8]. Causal dynamical triangulations (CDT) [8] attempts to address this\nproblem by taking the Lorentzian structure of spacetime seriously from the outset. The building blocks are\nLorentzian simplices with some (n-1)-dimensional faces\nbeing spacelike and some timelike. The action (6) is constructed using these building blocks and then rotated\ninto the Euclidian sector to aid in computation. The\nresulting construction exhibits three distinct phases.\nTwo of these phases resemble the pathological results\nfrom Euclidian dynamical triangulations, a crumpled\nphase and a branched polymer phase, neither of which\nseem able to reproduce classical spacetimes. The third\nphase, however, is characterized by an extended geometry with small fluctuations, as one would hope for from\na quantum theory of gravity. This phase is the result of\nbuilding the causal structure into the theory from the\noutset, and is the main success of the CDT program.\nThis paper will only focus on the (2+1)-dimensional\nconstruction, although the (3+1)-dimensional approach\nis very similar. Details of both cases can be found in\n[8].\nIn (2+1)-dimensional CDT we use three types of\nthree-dimensional blocks to build our spacetime. Each\n\n\f3\n\nblock is constructed from points that lie in the constant\ntime surface t = ta and the next constant time surface\nt = ta + 1 . We will label our blocks by \"(number of\npoints at ta , number of points at ta + 1 ).\" With this\nconvention our three blocks are the (3,1) simplex, the\n(1,3) simplex (a reflection of the (3,1) simplex) and the\n(2,2) simplex (Figure 1).\n\nt=ta+1\n\n1\n,\n4G \u0012\n\u0013\n1\n1\nΛ\n√\nk3 =\n3 arccos − π +\n4πG\n3\n48π 2\nk0 =\n\nwhere N0 is the number of vertices in the manifold, N3\nis the number of three-simplices, G is Newton's constant, and Λ is the cosmological constant. Finally, the\ndiscrete path integral (7) becomes:\n\n(1,3)\n\nZ=\n\nX\nT\n\n3.2\n\n(2,2)\n\n(3,1)\n\nt=ta\nFigure 1: The three simplices of 2+1 CDT.\n\nWe define the length of edges that lie in constant\n2\n= a2 and the length of\ntime surfaces to be lspace\nedges that connect two neighboring timelike surfaces as\n2\nltime\n= −αa2 ; α is an asymmetry parameter between\ntimelike lengths and spacelike lengths. With these definitions the Regge action (6) in three dimensions becomes\n[8]:\n\n\n\n(3)\n\nSR\n\n1  X\n=\n\n8πG\n\nspacelike\nbones b\n\n1\nV b δb +\ni\n\n\n−\n\nΛ \n8πG\n\nX\n\n\nV b δb \n\ntimelike\nbones b\n\nX\n\nVs  .\n\n(8)\n\nFollowing the work in [8], Lorentzian volumes Vi and\ndihedrial angles θi for geometrical elements i are applied to (8). Then a series of relationships between all\nof the bulk variables in the manifold are used, along with\nthe simplifying assumption that α = 1 2 and a choice of\nunits a = 1 . Lastly the entire action is Wick rotated\ninto the Euclidean sector. The result is [8, 10]:\nSeucl = −k0 N0 + k3 N3\n\n(9)\n\nwith\n2 Even\n\nX 1\n(3)\n1 iS (3)\ne R →Z=\ne−Seucl ,\nC(T )\nC(T )\n\n(11)\n\nT\n\nMonte Carlo Moves\n\nIn order to numerically implement the partition function (11), one needs to create a procedure that will explore different allowed triangulations of a given threedimensional spacetime. This is accomplished by using the Metropolis Monte Carlo algorithm [11] with a\nseries of so-called \"moves,\" each move being a simple\nre-triangulation of a set of initial simplices. The constraints on these moves are that they should: (i) preserve the existing time-slicing of the spacetime, (ii) preserve the topology of the spacelike slices and, (iii) be\nergodic, that is, any one allowed triangulation can be\ntransformed to any other allowed triangulation by repeated application of these moves. In three dimensions\nthere are five of these moves [8], four of which are related by inversion symmetry. They are shown in Figure\n2. Each move is attempted a roughly equal number of\ntimes and is accepted or rejected with probabilities depending on how it changes the action (9) and how it\neffects the local geometry. The unit of simulation time\nis called a sweep and is defined as N3 attempted moves\n(i.e one attempted move for every simplex in the spacetime). The specific CDT implementation that was used\nfor this work is described in [12].\n\n\n\nsimplices s\n\n(3)\n\n(10)\n\nwithout this assumption, trigonometric identities reduce\nthe action to the form 9, although the relations 10 become more\ncomplicated.\n\n4\n\nProcess\n\nThe goal of this work is to measure the sphericity of\nour CDT quantized spacetime, specifically the ensemble\naverage of the sphericity of individual spacelike slices\nacross many sweeps of the simulation. There are four\nsteps required to do this: (i) choose a reference spacelike\nslice in each sweep to be analyzed, (ii) embed this twodimensional manifold in three dimensions, (iii) measure\nthe distance from the three-dimensional center of geometry to the embedded manifold and, (iv) analyze the\ndistances across many sweeps using spherical harmonics.\n\n4.1\n\nStep 1: Choose reference slices\n\nAlthough this is the least technically challenging step\nof the process, it does present some conceptual difficul-\n\n\f4\n\n2\n\nin the slice) in each sweep as a reference. This ensures\nthat there is at least one common bulk characteristic\nbetween any two given slices. See [9] for a further discussion related to this choice and the issues surrounding\nit.\n\n2\n\n4\n\n4\n\n5\n\n5\n\n6\n\n(2,6)\n3\n\n3\n\n1\n\n1\n\n6\n\n6\n\n5\n\n5\n4\n\n2\n\n4\n2\n\n3\n\n3\n\n(4,4)\n1\n\n1\n\nFigure 3: Plots of the volume per time-slice for simulation 3. The top\nis sweep 500, before the simulation has thermalized. The bottom is\nsweep 76100 where the volume bulge is clearly visible.\n\n4\n\n4\n5\n\n2\n\n2\n5\n1\n\n1\n3\n\n(2,3)\n\n3\n\nFigure 2: The three Monte Carlo moves that, along with their inverses,\nmake up the five move set (the (4,4) move is it's own inverse).\n\nties. Our (2+1)-dimensional spacetime has the topology\nS 2 ×I . The timelike interval I runs from t = 1 to t = T\nfor T time-slices. For computational simplicity the first\ntime slice is identified with the last, changing the topology to S 2 ×S 1 . When the CDT program is implemented\nas described in Section 3, the results are a bulge of extended spacetime and stalks with the minimal number\nof simplices required to maintain the S 2 input topology (Figure 3). The extended bulge performs a random\nwalk along the time axis as we execute sweeps. Since\nthe time axis is a circle, there is no unique choice of\ntime coordinates for the bulge, so it makes little sense\nto compare a fixed time-slice across sweeps. The solution to this dilemma is to use the maximum volume slice\n(measured by counting the number of spacelike triangles\n\n4.2\n\nStep 2: Embed the slices in 3D\n\nThe property of spacetimes generated by the simulation\nthat is of interest is the the intrinsic curvature. This is\ndefined by the deficit angle (4), which is easily measured\nfor individual spacetimes. But because the number and\nlocation of vertices will change across sweeps, it is unclear how to measure an expectation value using this\nquantity. To overcome this problem it is useful to embed the individual spacetimes in three dimensions. The\nresulting coordinate system can then be used to compare\nmeasurements across sweeps. Of course once the spacetime is embedded, it is extrinsic not intrinsic curvature\nthat is being measured. However, Gauss's Theorema\nEgregium states that the Gaussian curvature of a twodimensional surface embedded in a flat three-manifold is\nintrinsic to the surface, and is completely determined by\nthe intrinsic curvature [13]. So in 2+1 dimensions, measuring the extrinsic curvature is equivalent to measuring\nthe intrinsic curvature.\n4.2.1\n\nThe embedding algorithm\n\n.\nThe points that define vertices in CDT are by necessity coordinate-free. The only information that the\n\n\f5\n\nsimulation generates is the linking between them. In order to embed a two-dimensional spacelike slice in three\ndimensions for analysis, we have to choose a coordinate\nfor each point based on its relationship to its neighbors. This is accomplished by feeding the logical links\nbetween the vertices into a force-directed graphing algorithm, specifically the spring electrical embedding algorithm [14] as implemented by Mathematica 6.\nIn this graphing algorithm, neighboring vertices are\nattracted to each other by a force that is proportional\nto the Euclidean distance between them, i.e., a spring\nforce. Additionally, every vertex repels every other vertex with a force that falls off with the inverse square of\nthe distance, i.e., an electrical force. The total energy\nof the system is given by:\n\nE=\n\nV \u0012\nX\n\n− Ce\n\ni=1\n\n4.4\n\nStep 4: Spherical harmonic analysis\n\nX xj − xi\nd2ij\nj6=i\n\n+ Cs\n\nX\n\n\u00132\ndij (xj − xi ) ,\n\n(12)\n\nneighbors\nof i\n\nwhere Ce and Cs are constants that control the relative\nstrength of the electrical and spring forces, respectively,\nand dij is the Euclidean distance between vertex i and\nj . This energy function is then minimized by iteratively\nmoving each vertex in the direction of the spring force.\nThe configuration of points that minimizes (12) is used\nas the final embedding of our spacelike slice.\n\n4.3\n\nStep 3: Measure distances\n\nGiven an embedding of our surface in flat three-dimensional\nspace, we can, in principle, determine the extrinsic curvature from the positions r(t) of the points. In particular, for a spherical surface, r(t) will be constant, and\ndeviations from a constant value will give a measure of\nthe variation of the curvature. Because of this, a measurement of r(t) for each of the spacetimes generated by\nthe simulation is therefore a measurement of curvature.\nBecause of this I will focus on the measurement of r(t)\nfor the remainder of this paper.\nTo perform this measurement, rays emanating from\nthe center of geometry of a particular slice are traced\nand the point at which they intersect with the manifold is calculated. The rays used are not arbitrary, but\nrather picked so they will point to specific locations on\na 2-sphere which correspond to different pixels in the\nHEALPix discretization scheme (more on HEALPix in\nSec. 4.4). So what is actually measured is the distance\nfrom the center of geometry to the two-dimensional surface as a function of HEALPix pixel number or r(npix ) .\nIn order to avoid correlations that are an artifact of the\nembedding algorithm, a random rotation is performed\nabout the center of geometry for each set of distance\nmeasurements.\n\nFigure 4: Examples of HEALPix pixelations at different values of\nNside (image taken from [15]). The value Nside is the number of\ndivisions of the base pixel along one side. Starting at the top left the\nfirst sphere is pixelated with the base resolution pixels. The top right\nsphere is at Nside = 2 . The bottom right sphere is at Nside = 4 .\nThe bottom left sphere is at Nside = 8 .\n\nThe measurements in Section 4.3 are taken with a\nspecific method of spherical harmonic analysis in mind.\nHEALPix (Hierarchical Equal Area iso-Latitude Pixelisation) is an efficient method of pixelating a 2-sphere\nthat lends itself to spherical harmonic transformations.\nIt is used widely in cosmic microwave background analysis, including data from the WMAP and Planck experiment. Details of the HEALPix implementation can be\nfound in [15, 16]. The basic idea is that any function f\non a sphere can be decomposed into a linear combination of spherical harmonics Ylm :\n\nf (θ, φ) =\n\nlX\nmax\n\nX\n\nl=0\n\nm\n\nalm Ylm (θ, φ).\n\n(13)\n\nThe alm can then be found by using the orthogonality of the Ylm to invert (13):\nZ\nalm =\n\n∗\ndΩf (θ, φ)Ylm\n(θ, φ).\n\n(14)\n\nΩ\n\nIn the case of a discrete function fˆ, evaluated at\npixel locations (θp , φp ) , with Npix pixels, (14) can be\napproximated by a sum. The approximation used by\nHEALPix is [16]\n\nâlm =\n\nNpix −1\n4π X\nY ∗ (θp , φp )fˆ(θp , φp ).\nNpix p=0 lm\n\n(15)\n\n\f6\n\nThe variance of the âlm is the angular power spectrum, Ĉl :\n\nĈl =\n\n1 X\n|âlm |2 .\n2l + 1 m\n\n(16)\n\nThe resolution of HEALPix maps is characterized\nby the quantity Nside which represents the number of\ndivisions of a base-resolution pixel [15]. Examples of\npixelations with different values of Nside are shown in\nFigure 4.\n\n4.5\n\nErrors in the embedding\n\nAlthough the embedding algorithm does a very good\njob, it is not perfect. The requirement of Section 3.1 that\nall link lengths be equal is very difficult for the algorithm\nto achieve; most links are the same length, but there are\nalways some that are either bigger or smaller than the\naverage. When the link lengths are different sizes, the\ngeometry of our spacelike slices becomes distorted. This\nmeans that there is some difference between the actual\ngeometry of our manifold and the geometry we measure\nin step 3 of our process. To understand how this will\neffect our measurements, we look at how each triangle\nthat is intersected by a ray is distorted and apply an\nextra amount ∆r to our measurements. We estimate\n∆r as follows: the change in the area of a triangle with\nchanges in link length l is roughly ∆A ∼ l∆l . The\nchange in the area of a spherical spacetime with changes\nin the radius r is roughly A ∼ r∆r . Since the spherical\nspacetimes are constructed of triangles and the radius\nr roughly corresponds to our ray-trace measurements,\nwe can equate these two quantities to get an estimate of\n∆r : ∆r ∼ rl ∆l , where l is the average link length for\na given spacetime, ∆l is is the difference of the average\nof a specific triangle's link lengths and the average link\nlength for the spacetime, and r is the measured distance\nto the triangle in question.\nThis quanity ∆r is calculated for each pixel and applied to the original measurement. Then the new distances are are analyzed using the methods described in\nSection 4.4. The results of this additional analysis are\nincluded in Figures 8 and 9, which are discussed in Section 5.\n\n5\n\nAll of the HEALPix analysis was performed at\nNside = 32. This resolution effectively limits the power\nspectrum analysis to the first 100 l 's. At higher values\nthan this, we start sampling the map at scales smaller\nthan the map resolution, which results in noise in the\nspectrum. The power spectrum, up to l = 100 , and\nHEALPix map for each of the slices in Figure 5, are\nshown in Figure 6 and Figure 7 respectively.\n\nFigure 5: Various max volume spacelike slices from simulation 1 embedded using the algorithm described in section 4.2. Top left is sweep\n55500, top right is sweep 71800, bottom left is sweep 92700 and bottom right sweep 99900.\n\nFigure 6: The HEALPix maps for the slices in Figure 5. Top left is\nsweep 55500, top right is sweep 71800, bottom left is sweep 92700 and\nbottom right sweep 99900.\n\nResults\n\nIn order to test the sphericity of the output from CDT,\nfive simulations were run. The values of the bare coupling constants for each of these simulations are listed\nin Table 1. A \"snapshot\" of the spacetime was exported\nto a file every 100 sweeps. The largest volume spacelike\nslice was then chosen from each of these spacetimes and\nused for analysis. Examples of several of these slices,\nembedded in three-dimensions, are shown in Figure 5.\n\n5.1\n\nThe shape of spacetime\n\nAs can be seen in Figure 7, individual slices vary from\nbeing spherical by non-trivial amounts. However, individual slices come from particular paths in the path\nintegral (3), and physically, only the ensemble averages\nare meaningful. It is important to choose carefully when\npicking the quantities from which to calculate these averages. Because all notion of absolute location is washed\n\n\f7\n\nSim\n1\n2\n3\n\nVinit\n81921\n81921\n81921\n\nT\n64\n64\n64\n\nk0\n1.0\n1.5\n2.0\n\nk3\n0.78\n0.86\n0.94\n\n\u000f\n0.02\n0.02\n0.02\n\nTotal sweeps\n100000\n100000\n400100\n\nThemalized sweep\n46300\n70100\n24800\n\n4\n5\n\n81921\n81921\n\n64\n64\n\n2.5\n3.0\n\n1.03\n1.12\n\n0.02\n0.02\n\n100000\n100000\n\n17800\n19400\n\nTotal samples(# of subsamples)\n538\n300\n3745;\n1873(50);\n1249(50);\n937(50); 749(50); 625(50)\n822\n807\n\nδS 2\n0.055\n0.06\n0.061\n0.069\n0.06\n\nTable 1: Various parameters and results for each simulation. Vinit is the total initialization volume (i.e. the number of initial simplices), T is\nthe number of time-slices, k0 and k3 are the bare coupling constants discussed in Section 3.1. The numbers in parentheses next to the total\nsamples for simulation 3 are the number of random subsamples of the full set of sweeps that were made. These results were then averaged to\navoid sample bias. δS 2 is the deviation from being perfectly spherical discussed in Section 5.1.\n\n10−1\n\n1\n\n10−2\n\n10−1\n\n10−3\n\n10−2\n\n10−4\n\n10−3\n\n10−5\n\n10−4\n\n10−6\n\n10−5\n\n10−7\n\n1\n\n10\n\n100\n\n10−2\n\n10−6\n\n1\n\n10\n\n100\n\n1\n\n10\n\n100\n\n10−1\n\n10−3\n\n10−2\n\n10−4\n\n10−3\n10−4\n\n10−5\n\n10−5\n10−6\n\ndefect will remain unaffected. If the power spectrum ensemble average is one of these quantities, then it should\nbe almost the same at any reasonably large sample size.\nFigure 11a confirms this. The averaged power spectra\nare almost identical for every l at all sample sizes.\nNow that we have some confidence in our averaging\nprocedure, we can examine the results for all of the simulations in Table 1. The results are shown in Figure 8.\nAll of the simulations performed here seem to be very\nspherical. In each case, the l = 1 mode is only a few\npercent of the the spherical or l = 0 mode, and higher\nmodes fall off rapidly. Also, the results are very similar\nfor all chosen values of k0 and k3 , implying that the\nshape of the spacetime in the extended phase does not\ndepend on the values of the coupling constants. Finally,\nin order to give each simulation a single score to rank\nits sphericity, the following quantity is calculated:\n\n10−6\n10−7\n\n1\n\n10\n\n100\n\nFigure 7: Cl /C0 vs. l for each of the individual spacetimes in Figure\n5. Top left is sweep 55500, top right is sweep 71800, bottom left is\nsweep 92700 and bottom right sweep 99900.\n\nout from sweep to sweep, averaging the distance measurements is an unreliable measure of the shape of the\nensemble system. Each pixel will explore roughly the\nsame range of allowed values, resulting in the same average distance everywhere – the measurements will \"sum\nto zero.\" If there were a non-spherical shape preferred\nby the system, it would be washed out in this average.\nWe need a quantity that is rotationally invariant, i.e.,\nsome measurement that will give us the same answer for\na given shape regardless of how that shape is oriented\nrelative to a coordinate system. Luckily, the power spectrum is just such a quantity. Averaging each l of the\npower spectrum across the entire ensemble will give us\na measure of the physical shape of our spacetime.\nTo test this assumption, simulation 3 was run for\nfour times as many sweeps as the other simulations.\nThis pool of sweeps was then sampled at different sizes.\nAs sample size increases, measurements that are subject\nto the \"sum to zero\" effect will converge to average values everywhere. Measurements that are free from this\n\n100\nX\n2\n\nδS =\n\nCl\n\nl=1\n\nC0\n\n.\n\n(17)\n\nδS 2 is a measure of how much power is not in the\nspherical l = 0 mode. The results for each spacetime\nare shown in Table 1.\n\n5.2\n\nThe fluctuations\n\nThe spacetimes produced by CDT seem quite spherical,\nmatching the results from canonical quantization. The\nother prediction of the canonical procedure is that the\nspacetime should have no fluctuations. To test whether\nthe CDT spacetimes exhibit this property I will look at\nthe variance of the distance measurements:\n2\nσpix\n= hr(npix )2 i − hr(npix )i2 .\n\n(18)\n\nAs with the measurement in Section 5.1, it is important\nto note that (18) is not affected by the \"sum to zero\"\neffect, as can be seen in Figure 11b.\nEquation (18) is calculated for every pixel in the\nHEALPix map, creating a map of the fluctuations of the\n\n\f8\n\nmeasured are smaller than the C0 s but they show similar behavior. The fit can be made better by multiplying\nand adding a constant to ∆r . These constants arise\nfrom the fact that the assumptions we made in deriving (22) – constant variance and perfect sphericity –\nwere not completely correct using our data set (there\nare small but non zero modes > 0 in our simulations).\nThe results in Figure 12 are an indication that the zero\nmode fluctuations are indeed induced by the CDT lattice.\n2.6\n2.4\n2.2\n2.0\n1.8\n1.6\nC1/4\n0 , Δr\n\nspacetime (Figure 10). A power spectrum is then calculated for this map. The result for each simulation can\nbe seen in Figure 9. Clearly non-spherical (non l = 0 )\nmodes of fluctuations are very small, a result that fits\nwith the predictions of the canonical quantization procedure. There is however, power in the the l = 0 mode\nthat does not match the canonical predictions. This zero\nmode power can be attributed to lattice effects in the\nCDT model. Because the slices are discrete, when the\nlargest volume time-slice is selected (see Section 4.1) it\nwill typically be slightly smaller than the maximum volume slice in the limit where the number of time-slices\ngets very large. This means that the volume I sample\nwill fluctuate around its \"maximum\" value. Because the\nmaximum volume is fluctuating and our ensemble spacetimes are very spherical, the radius of the spacetime will\nfluctuate uniformly, resulting in a large zero mode in\nthe fluctuation power spectrum. To calculate an order\nof magnitude estimate for this fluctuation, the points\nmarking the volumes of the time-slices around the maximum volume time slice were fit to a curve using a cubic\ncurve-fitting algorithm. The maximum of this curve was\nthen interpreted to be the \"actual\" maximum volume in\nthe limit where the number of time-slices becomes large.\nThe average difference between the \"actual\" value and\nthe selected value was calculated. In order to compare\nthis average ∆r to the zero mode of the power spectrum, one must relate the Cl to the total power in a\nfunction f via Parseval's theorem:\n\n1.4\n1.2\n\nC1/4\n0\nΔr\nAΔr + B, A=4.01, B=1.83\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0\n\n1.0\n\n1.5\n\n2.0\nk0\n\n2.5\n\n3.0\n\n1/4\n\n1\n4π\n\nZ\n\n2\n\nf (Ω) dΩ =\nΩ\n\n∞ X\nl\nX\n\nFigure 12: The zero mode fluctuation ( C0 ) compared to the difference in the sampled radius from the actual radius due to lattice effects\n( ∆r ).\n\na2lm .\n\n(19)\n\nl=0 m=−l\n\n5.3\n\nCombining this with (16) gives:\n1\n4π\n\nZ\n\nf (Ω)2 dΩ =\n\nΩ\n\n∞\nX\n\n(2l + 1)Cl .\n\n(20)\n\nl=0\n\nThe function we are considering is the variance (18),\nwhich we will assume is constant over the sphere, and\nbecause it is so much bigger, the only Cl that we need\nto look at is C0 , so:\nσr4 ∼ C0 .\n\n(21)\n\nAdditionally, since we are √\nassuming that the\n√ spacetime\nis\nmostly\nspherical\nr\n∼\nV\nand\n∆r\n∼\nVmax −\n√\nVmeasured (we are working in two dimensions, so the\nvolume in this case is actually an area). So we have\n∆r ∼\n\np\n\nVmax −\n\np\n1/4\nVmeasured ∼ C0 .\n\n(22)\n\nResults of this calculation are shown in Figure 12.\nWithout any modification, the values for ∆r that we\n\nSmall Cl for l > 0\n\nThe power in l 's greater than zero is small in all cases,\nbut it is still non-zero. If the spacetimes were truly\nspherical, with no fluctuations, all of these values would\nbe zero. Is there a small but interesting dynamic in\nthe theory itself that causes these modes to be active?\nWithin the context of this work it is unclear where these\nmodes come from. It is plausible that they arise from\nlattice effects. If so, then as the lattice spacing decreases, theses modes would also decrease. Decreasing\nlattice spacing requires an increase in the initialization\nvolume, though, and generating enough sweeps to calculate good statistics is problematic at high volume using\navailable hardware. Studying these small, high l modes\nis therefore left to future work.\n\n6\n\nConclusions\n\nAs Figures 8 and 9 and the analysis in Section 5 suggest, the geometry that the CDT simulations produce\nare very close to being perfectly spherical with no fluctuations. Because reduced phase space quantization leads\n\n\f9\n\nto a quantum spacetime with no degrees of freedom,\nthese results imply that, at least in (2+1) dimensions,\nthe path integral quantization implemented by CDT\nis, at least very nearly, equivalent to the canonical approach. It remains to be seen if this result can be extended to other 2+1 dimensional topologies. In CDT\nwe have, for the first time, a tool to numerically explore\nthese fascinating theories and perhaps cast some light\non the (3+1)-dimensional case.\n\nAcknowledgments\nThis work was supported in part by the Department of\nEnergy under grant DE-FG02-91ER40674. Thanks to\nSteve Carlip and Rajesh Kommu for all of their helpful\ninsights.\n\nReferences\n[1] S. Carlip, Rept. Prog. Phys. 64, 885 (2001), grqc/0108040.\n[2] S. Carlip, Living Reviews in Relativity 8 (2005),\ngr-qc/0409039v2.\n[3] S. Carlip,\nQuantum Gravity in 2+1 Dimensions (Cambridge University Press, New York, NY,\n1998).\n[4] S. Carlip, Six ways to quantize (2+1)-dimensional\ngravity, in Procs. of the Fith Canadian Conf.\non General Relativity and Relativistic Astrophysics,\nedited by R. B. Mann and R. G. McLenaghan, Singapore, 1994, World Scientific, gr-qc/9305020.\n[5] M. H. Goroff and A. Sagnotti, Nuclear Physics B\n266, 709 (1986).\n[6] T. Regge, Il Nuovo Cimento 19, 558 (1961).\n[7] J. Cheeger, W. Müller, and R. Schrader, Commun.\nMath. Phys. 92, 405 (1984).\n[8] J. Ambjorn, J. Jurkiewicz, and R. Loll, Nucl. Phys.\nB610, 347 (2001), hep-th/0105267.\n[9] J. Ambjorn, A. Gorlich, J. Jurkiewicz, and R. Loll,\nPhys. Rev. D78, 063544 (2008), arXiv:0807.4481.\n[10] J. Ambjorn, J. Jurkiewicz, and R. Loll, Phys. Rev.\nD64, 044011 (2001), hep-th/0011276.\n[11] N. Metropolis, A. Rosenbluth, M. Rosenbluth,\nA. Teller, and E. Teller, J. Chem. Phys. 21, 1087\n(1953).\n[12] R. Kommu, abs/1110.6875.\n[13] E. Weisstein,\nGauss's theorema egregium,\nFrom MathWorld–A Wolfram Web Resource,\nhttp://mathworld.wolfram.com/\nGausssTheoremaEgregium.html.\n\n[14] G. D. Battista, P. Eades, R. Tamassia, and I. G.\nTollis, Graph Drawing: Algorithms for the Visualization of Graphs (Prentice Hall, Upper Saddle\nRiver, N.J., 1999).\n[15] K. M. Gorski, B. D. Wandelt, F. K. Hansen,\nE. Hivon, and A. J. Banday,\n(1999), astroph/9905275.\n[16] K. M. Gorski, B. D. Wandelt, F. K. Hansen,\nE. Hivon, and A. J. Banday, Healpix documentation, http://healpix.jpl.nasa.gov/ healpixSoftwareDocumentation.shtml.\n\n\f10\n\nCl/C0 k3=1.0 k0=0.78\n\nCl/C0 k3=1.5 k0=0.86\n\n10−2\n\n10−2\n\n10−3\n\n10−3\n\nCl/C0\n\n10−1\n\nCl/C0\n\n10−1\n\n10−4\n\n10−4\n\n10−5\n10−6\n10−7\n\n10−5\nwith distortion\nwithout distortion\n1\n\n10−6\n\n10\n\nl\n\n10−7\n\n100\n\nwith distortion\nwithout distortion\n1\n\nCl/C0 k3=2.0 k0=0.94\n\n100\n\n10−2\n\n10−3\n\n10−3\n\nCl/C0\n\n10−2\n\nCl/C0\n\n10−1\n\n10−4\n\n10−4\n\n10−5\n\n10−7\n\n10\n\nCl/C0 k3=2.5 k0=1.05\n\n10−1\n\n10−6\n\nl\n\n10−5\nwith distortion\nwithout distortion\n1\n\n10−6\n\n10\n\nl\n\n10−7\n\n100\n\nwith distortion\nwithout distortion\n1\n\nl\n\n10\n\n100\n\nCl/C0 k3=3.0 k0=1.12\n10−1\n10−2\n\nCl/C0\n\n10−3\n10−4\n10−5\n10−6\n10−7\n\nwith distortion\nwithout distortion\n1\n\nl\n\n10\n\n100\n\nFigure 8: The relative power of modes greater than l = 0 when testing the ensemble shape of the spacetime for each of the simulations\nfor measurements with and without the distortion described in Section 4.5 applied. As can be seen from the plots the distortion induced by\nembedding errors is small.\n\n\f11\n\nDistance Fluctuations k3=1.0 k0=0.78\n102\n\nDistance Fluctuations k3=1.5 k0=0.86\n102\n\nwith distortion\nwithout distortion\n\n10\n\n10−2\n\n10−2\n\nCl\n\n1\n10−1\n\nCl\n\n1\n10−1\n\n10−3\n\n10−3\n\n10−4\n\n10−4\n\n10−5\n\n10−5\n\n10−6\n\n10−6\n\n10−7\n\nwith distortion\nwithout distortion\n\n10\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nl\n\n60\n\n70\n\n80\n\n90\n\n100\n\n10−7\n\n0\n\nDistance Fluctuations k3=2.0 k0=0.94\n102\n\n10\n\n20\n\n30\n\n40\n\n50\n\nl\n\n60\n\n70\n\n80\n\n90\n\n100\n\nDistance Fluctuations k3=2.5 k0=1.03\n102\n\nwith distortion\nwithout distortion\n\nwith distortion\nwithout distortion\n\n10\n\n1\n\n1\n10−1\n\n10−2\n\nCl\n\nCl\n\n10−2\n10−3\n\n10−4\n\n10−4\n10−5\n\n10−6\n\n10−6\n10−8\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nl\n\n60\n\n70\n\n80\n\n90\n\n100\n\n10−7\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nl\n\n60\n\n70\n\n80\n\n90\n\n100\n\nDistance Fluctuations k3=3.0 k0=1.12\n102\n\nwith distortion\nwithout distortion\n\n10\n1\n10−1\n\nCl\n\n10−2\n10−3\n10−4\n10−5\n10−6\n10−7\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nl\n\n60\n\n70\n\n80\n\n90\n\n100\n\nFigure 9: The total power of ensemble spacetime shape fluctuations for each simulation with and without the distortion described in Section 4.5\napplied. As can be seen from the plots the distortion induced by embedding errors is small.\n\n\f12\n\n(a) k0 = 1.0\n\n(b) k0 = 1.5\n\n(c) k0 = 2.0\n\n(d) k0 = 2.5\n\n(e) k0 = 3.0\nFigure 10: Maps of the ensemble spacetime shape fluctuations for each simulation.\n\n\f13\n\n40.25\n\n102\n\nSample size\n3745\n\n1.520\n40.20\n\n1873\n\n1.518\n\n10\n\n1249\n\n1.516\n\n937\n\n40.15\n\n1.514\n\n1\n\n749\n\n1.512\n\n−0.01\n\n0\n\n0.01\n\n625\n\n1.510\n\n40.10\n\n10−1\nCl\n\n1.508\n1.506\n0.526\n\n10−2\n\n0.99\n\n0.525\n\n1.00\n\n1.01\n\n1.504\n\n0.524\n0.523\n\n10−3\n\n1.99\n\n2.00\n\n2.01\n\n0.522\n\n10−4\n\n10−5\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\nl\n\n60\n\n70\n\n80\n\n90\n\n100\n\n(a) Shape power spectra at different sample sizes\n\n22.05\n\n102\n\n0.99\n\n1.00\n\n1.01\n\n0.00050\n\n1.99\n\n2.00\n\n2.01\n\n0.00028\n\nSample size\n\n0.00026\n0.00045\n\n10\n\n3745\n\n0.00024\n\n22.00\n\n1873\n0.00022\n\n1249\n\n0.00040\n\n1\n\n937\n\n0.00020\n21.95\n\n749\n\n10−1\n\n0.00018\n\n0.00035\n\n10−2\n\n0\n\n0.01\n\n21.90\n\n0.00016\n\nCl\n\n−0.01\n\n625\n\n10−3\n\n10−4\n\n10−5\n\n10−6\n\n10−7\n\n10−8\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\nl\n\n60\n\n70\n\n80\n\n(b) Shape fluctuation power spectra at different sample sizes\nFigure 11: The effects of sample size on the measurement of the shape and the shape fluctuations.\n\n90\n\n100\n\n\f"}