{"id": "http://arxiv.org/abs/0905.3038v1", "guidislink": true, "updated": "2009-05-19T07:53:37Z", "updated_parsed": [2009, 5, 19, 7, 53, 37, 1, 139, 0], "published": "2009-05-19T07:53:37Z", "published_parsed": [2009, 5, 19, 7, 53, 37, 1, 139, 0], "title": "Strength of correlations in pnictides and its assessment by theoretical\n  calculations and spectroscopy experiments", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.4297%2C0905.4278%2C0905.1861%2C0905.2757%2C0905.2847%2C0905.3234%2C0905.2176%2C0905.0358%2C0905.1107%2C0905.3242%2C0905.0935%2C0905.2730%2C0905.1952%2C0905.3137%2C0905.2618%2C0905.0828%2C0905.0125%2C0905.2671%2C0905.1616%2C0905.0249%2C0905.0782%2C0905.3175%2C0905.2524%2C0905.3400%2C0905.4116%2C0905.2816%2C0905.2403%2C0905.1749%2C0905.1458%2C0905.4301%2C0905.3327%2C0905.0461%2C0905.2922%2C0905.4515%2C0905.4481%2C0905.2940%2C0905.1637%2C0905.2990%2C0905.2204%2C0905.2402%2C0905.1708%2C0905.3038%2C0905.0054%2C0905.0127%2C0905.2340%2C0905.2098%2C0905.0646%2C0905.0157%2C0905.1838%2C0905.4194%2C0905.2189%2C0905.4227%2C0905.0773%2C0905.2703%2C0905.0352%2C0905.4191%2C0905.1954%2C0905.2645%2C0905.4367%2C0905.4372%2C0905.0163%2C0905.1275%2C0905.4371%2C0905.2924%2C0905.0332%2C0905.3488%2C0905.3950%2C0905.2904%2C0905.4321%2C0905.2704%2C0905.1291%2C0905.1491%2C0905.4635%2C0905.2899%2C0905.1229%2C0905.1305%2C0905.1428%2C0905.2713%2C0905.2369%2C0905.2210%2C0905.2439%2C0905.2298%2C0905.0886%2C0905.0974%2C0905.3588%2C0905.4362%2C0905.3470%2C0905.2634%2C0905.1623%2C0905.0956%2C0905.0903%2C0905.2280%2C0905.3593%2C0905.3648%2C0905.4197%2C0905.3692%2C0905.1514%2C0905.1000%2C0905.0954%2C0905.3390%2C0905.2381&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strength of correlations in pnictides and its assessment by theoretical\n  calculations and spectroscopy experiments"}, "summary": "LDA+DMFT (Local Density Approximation combined with Dynamical Mean-Field\nTheory) computation scheme has been used to calculate spectral properties of\nLaFeAsO -- the parent compound of the new high-T_c iron oxypnictides. The\naverage Coulomb repulsion U=3-4 eV and Hund's exchange J=0.8 eV parameters for\niron 3d electrons were calculated using the first principles constrained\ndensity functional theory scheme in the Wannier functions formalism. DMFT\ncalculations using these parameters result in moderately correlated electronic\nstructure with effective electron mass enhancement m^*~2 that is in agreement\nwith the experimental X-ray and photoemission spectra. Conclusion of moderate\ncorrelations strength is confirmed by the observation that pnictides\nexperimental spectra agree well with corresponding spectra for metallic iron\nwhile being very different with Mott insulator FeO spectra.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.4297%2C0905.4278%2C0905.1861%2C0905.2757%2C0905.2847%2C0905.3234%2C0905.2176%2C0905.0358%2C0905.1107%2C0905.3242%2C0905.0935%2C0905.2730%2C0905.1952%2C0905.3137%2C0905.2618%2C0905.0828%2C0905.0125%2C0905.2671%2C0905.1616%2C0905.0249%2C0905.0782%2C0905.3175%2C0905.2524%2C0905.3400%2C0905.4116%2C0905.2816%2C0905.2403%2C0905.1749%2C0905.1458%2C0905.4301%2C0905.3327%2C0905.0461%2C0905.2922%2C0905.4515%2C0905.4481%2C0905.2940%2C0905.1637%2C0905.2990%2C0905.2204%2C0905.2402%2C0905.1708%2C0905.3038%2C0905.0054%2C0905.0127%2C0905.2340%2C0905.2098%2C0905.0646%2C0905.0157%2C0905.1838%2C0905.4194%2C0905.2189%2C0905.4227%2C0905.0773%2C0905.2703%2C0905.0352%2C0905.4191%2C0905.1954%2C0905.2645%2C0905.4367%2C0905.4372%2C0905.0163%2C0905.1275%2C0905.4371%2C0905.2924%2C0905.0332%2C0905.3488%2C0905.3950%2C0905.2904%2C0905.4321%2C0905.2704%2C0905.1291%2C0905.1491%2C0905.4635%2C0905.2899%2C0905.1229%2C0905.1305%2C0905.1428%2C0905.2713%2C0905.2369%2C0905.2210%2C0905.2439%2C0905.2298%2C0905.0886%2C0905.0974%2C0905.3588%2C0905.4362%2C0905.3470%2C0905.2634%2C0905.1623%2C0905.0956%2C0905.0903%2C0905.2280%2C0905.3593%2C0905.3648%2C0905.4197%2C0905.3692%2C0905.1514%2C0905.1000%2C0905.0954%2C0905.3390%2C0905.2381&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "LDA+DMFT (Local Density Approximation combined with Dynamical Mean-Field\nTheory) computation scheme has been used to calculate spectral properties of\nLaFeAsO -- the parent compound of the new high-T_c iron oxypnictides. The\naverage Coulomb repulsion U=3-4 eV and Hund's exchange J=0.8 eV parameters for\niron 3d electrons were calculated using the first principles constrained\ndensity functional theory scheme in the Wannier functions formalism. DMFT\ncalculations using these parameters result in moderately correlated electronic\nstructure with effective electron mass enhancement m^*~2 that is in agreement\nwith the experimental X-ray and photoemission spectra. Conclusion of moderate\ncorrelations strength is confirmed by the observation that pnictides\nexperimental spectra agree well with corresponding spectra for metallic iron\nwhile being very different with Mott insulator FeO spectra."}, "authors": ["V. I. Anisimov", "E. Z. Kurmaev", "A. Moewes", "I. A. Izyumov"], "author_detail": {"name": "I. A. Izyumov"}, "author": "I. A. Izyumov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physc.2009.03.040", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0905.3038v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.3038v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.3038v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.3038v1", "arxiv_comment": null, "journal_reference": "Physica C 469, 442--447 (2009)", "doi": "10.1016/j.physc.2009.03.040", "fulltext": "arXiv:0905.3038v1 [cond-mat.str-el] 19 May 2009\n\nStrength of correlations in pnictides and its assessment\nby theoretical calculations and spectroscopy experiments\nV. I. Anisimov1 , E. Z. Kurmaev1 , A. Moewes2 , I. A. Izyumov1\n1\n\nInstitute of Metal Physics, Russian Academy of Sciences Ural Division, 620041\nYekaterinburg, Russia\n2\nDepartment of Physics and Engineering Physics, University of Saskatchewan, 116\nScience Place Saskatoon, Saskatchewan S7N 5E2, Canada\n\nAbstract\nLDA+DMFT (Local Density Approximation combined with Dynamical\nMean-Field Theory) computation scheme has been used to calculate spectral properties of LaFeAsO – the parent compound of the new high-Tc iron\noxypnictides. The average Coulomb repulsion Ū =3÷4 eV and Hund's exchange J=0.8 eV parameters for iron 3d electrons were calculated using the\nfirst principles constrained density functional theory scheme in the Wannier\nfunctions formalism. DMFT calculations using these parameters result in\nmoderately correlated electronic structure with effective electron mass enhancement m∗ ≈2 that is in agreement with the experimental X-ray and\nphotoemission spectra. Conclusion of moderate correlations strength is confirmed by the observation that pnictides experimental spectra agree well with\ncorresponding spectra for metallic iron while being very different with Mott\ninsulator FeO spectra.\nKey words:\nPACS: 74.25.Jb Electronic structure\nRecent discovery of high-Tc superconductivity in iron oxypnictides LaO1−x Fx FeAs\n[1] has stimulated an intense experimental and theoretical activity. In a striking similarity with the high-Tc cuprates, the undoped LaFeAsO is not superconducting, but exhibits an antiferromagnetic commensurate spin-density\nwave below 150 K [2]. Only when electrons (or holes) are added to the system via doping, antiferromagnetism is suppressed and superconductivity appears. As it is generally accepted that the Coulomb correlations between the\ncopper 3d electrons are responsible for the anomalous properties of cuprates,\nPreprint submitted to Elsevier\n\nJuly 17, 2018\n\n\fit is tempting to suggest that the same is true for the iron 3d electrons in\nLaFeAsO.\nThe ratio of the Coulomb interaction U and the band width W determines\nthe correlation strength. For U/W < 1 the system is weakly correlated and\nthe results of Density Functional Theory (DFT) calculations are enough to\nexplain its electronic and magnetic properties. However, if the U value is\ncomparable with W or even larger the system is in an intermediate or a\nstrongly correlated regime and the Coulomb interactions must be treated\nexplicitly in the electronic structure calculations. The partially filled bands\nformed by Fe-3d states in LaFeAsO have a width of ≈4 eV (see the shaded\narea in the lower panel of Fig. 1), so the interaction parameter U should be\ncompared with this value.\nIn practice, U is often considered a free parameter to achieve the best\nagreement between the calculated and measured properties of the investigated system. However, the most attractive approach is to determine the\nCoulomb interaction parameter U from the first principles. Two methods\nare generally used for this purpose: constrained DFT scheme [3, 4], where\nthe d-orbital occupancies in DFT calculations are fixed to the certain values and U is determined as a numerical derivative of the d-orbital energy\nover its occupancy, and Random Phase Approximation (RPA) [5], where the\nscreened Coulomb interaction between the d-electrons is calculated using a\nperturbation theory. Recently, RPA calculations of the interaction parameter\nU in LaFeAsO were reported [6], estimating putting the U value in the range\n1.8÷2.7 eV. In Ref. [7] it was proposed to use the U of 4 eV obtained in RPA\ncalculations for metallic iron [8]. This value of the Coulomb parameter (with\nHund's exchange parameter J=0.7 eV) was used in Dynamical Mean-Field\nTheory (DMFT) [9] calculations for LaFeAsO [7, 10, 11]. These studies find\nthe iron 3d electrons to be in an intermediate or a strongly correlated regime,\nas can be expected for the Coulomb parameter U=4 eV and the Fe-3d band\nwidth of ≈4 eV.\nTo estimate the correlation strength one can compare experimental spectra with the densities of states (DOS) obtained in DFT calculations. For\nstrongly correlated materials additional features in the experimental photoemission, X-ray absorption and optical spectra appear that are absent in\nthe DFT DOS. These features are interpreted as lower and upper Hubbard\nbands. If no Hubbard bands are observed and the DOS obtained in DFT\ncalculations describes the experimental spectra satisfactorily the material is\nconsidered to be in a weakly correlated regime. LaFeAsO was studied by\n2\n\n\fsoft X-ray absorption and emission spectroscopy [12], X-ray absorption (O\nK-edge) spectroscopy [13], and photoemission spectroscopy [14]. All these\nstudies conclude that DOS obtained in DFT calculations agrees well with the\nexperimental spectra and the estimated value of the Coulomb parameter is\nless than 1 eV [13]. Such a contradiction with the DMFT results [7, 10, 11]\nusing U=4 eV shows that the first principles calculation of the Coulomb parameter U for LaFeAsO is needed to assess the strength of correlations in this\nmaterial. Results of such calculations using the constrained DFT methods\nare reported in the present work.\nA source of uncertainty in the constrained DFT scheme is the definition\nof atomic orbitals whose occupancies are fixed and energies are calculated.\nIn some DFT methods, like Linearized Muffin-Tin Orbitals (LMTO), these\norbitals could be identified with LMTOs. However, for other basis sets for\nexample plane waves in the pseudopotential methods one should use a more\ngeneral definition of the localized atomic-like orbitals such as Wannier functions [15] (WFs). A practical way to calculate WFs for specific materials\nusing projection of atomic orbitals on the Bloch functions was developed in\nRef. [16].\nIn Fig. 1 the total and partial DOS for LaFeAsO obtained in LMTO basis\nare shown. The crystal field splitting of the Fe-3d states in this material is\nrather weak (∆cf =0.25 eV) and all five d orbitals of iron form a common\nband in the energy range (−2, +2) eV relative to the Fermi level (see the\ngray region in the bottom panel of Fig. 1). There is a strong hybridization of\nthe iron t2g orbitals with the p orbitals of arsenic, the effect of which becomes\napparent in the energy interval (−3, −2) eV (the white region in the bottom\npanel of Fig. 1) where the As-p band is situated. A weaker hybridization\nwith the oxygen p states can be seen in (−5.5, −3) eV energy window (the\nblack region in the bottom panel of Fig. 1).\nWe have calculated the average Coulomb interaction Ū and Hund's exchange J parameters in WFs basis using the constrained DFT procedure\nwith fixed occupancies of WFs of d symmetry. For this purpose we have\nused two computational schemes based on two different DFT methods. The\nfirst involves linearized muffin-tin orbitals produced by the TB-LMTO-ASA\ncode [17]; the corresponding WFs calculation procedure is described in details\nin Ref. [19]. The second, based on the pseudopotential plane-wave method\nPWSCF, as implemented in the Quantum ESPRESSO package [18], is described in Ref. [20]. The difference between results obtained with the two\nschemes gives an estimate of the uncertainty of Ū and J determination.\n3\n\n\fThe WFs are defined by the choice of Bloch functions Hilbert space and\nby a set of trial localized orbitals that will be projected onto these Bloch functions [19]. We have performed calculations for all bands in energy window\n(−5.5, +2) eV that are formed by O-2p, As-4p and Fe-3d states and correspondingly full set of O-2p, As-4p and Fe-3d atomic orbitals to be projected\non the Bloch functions for these bands. This corresponds to an extended\nmodel where in addition to the Fe-d orbitals all the p-orbitals are included\nas well.\nConstrain DFT calculations using TB-LMTO-ASA method gave values\nŪ=3.10, J=0.81 while calculations with PWSCF gave Ū=4.00, J=1.02. The\ndifference between those two sets of parameter values shows the \"error bar\"\nin definition of Coulomb interaction parameters. In the following we have\nused results obtained in TB-LMTO-ASA calculations.\nIn the constrained DFT calculations an average Coulomb interaction Ū\nis obtained which can be approximated[4] as Ū = F 0 − J/2, where F 0 is 0th\nSlater integral. Hence F 0 can be calculated as F 0 = Ū + J/2 and this gives\nF 0 =3.5 eV and J=0.81 eV. With this set of parameters Coulomb interaction\nmatrix Umm′ was calculated and used in LDA+DMFT [21] calculations (for\na detailed description of the present computation scheme see Ref. [19]). The\nDFT band structure was calculated within the TB-LMTO-ASA method [17].\nCrystal structure parameters of Ref. [1] were used.\nA double-counting term Ū (nDM F T − 21 ) was used to obtain the noninteracting Hamiltonian [20]. Here nDM F T is the total number of d-electrons\nobtained selfconsistently within the LDA+DMFT scheme. The effective impurity model within the DMFT was solved by Hirsch-Fye QMC method [22].\nIn the present implementation of the QMC impurity solver the Coulomb\ninteraction between different orbitals on the same atom is limited to densityP\nσσ′\n0\ndensity terms, i.e. the form mσ,m′ σ′ Umm\n′ (F , J)n̂mσ n̂m′ σ ′ . In particular, this\nmeans that the coupling between the local spins is of Ising and not Heisenberg type. Since this is a significant approximation a few comments are in\norder especially concerning the question whether this approximation underestimates or overestimates the many-body renormalization of quasi-particle\nbands. We argue quite generally that introducing the spin-flip exchange (and\nother interaction terms beyond density-density) allows electrons to avoid each\nother more efficiently and thus the electron propagation through the crystal\nis inhibited less than with Ising exchange. As an example one can imagine\ntwo electrons with opposite spin in different orbitals. Allowing the spin-flip\nexchange the Ising-only interaction energy U ′ can be reduced to U ′ − J by\n4\n\n\fforming the triplet state with Sz = 0. This argument is also supported by\nrecent numerical studies of two-band model comparing full Coulomb and\nIsing-only interaction terms [23]. Therefore we expect our results rather to\noverestimate than underestimate the quasi-particle renormalization.\nCalculations were performed at the inverse temperature β=10 eV −1 . The\ninterval 0 < τ < β was divided into 100 slices. 6 * 106 QMC sweeps were\nused in self-consistency loop within the LDA+DMFT scheme and 12 * 106 of\nQMC sweeps were used to calculate the spectral functions.\nThe results of the LDA+DMFT calculations are presented in Fig. 2. The\neffect of correlations on the electronic structure of LaFeAsO is minimal: there\nare relatively small changes of peak positions for 3z 2 − r 2 , xy and x2 − y 2\norbitals (a shift toward the Fermi energy) and practically unchanged spectral\nfunctions for the yz, zx bands. There is no appearance of either Kondo\nresonance peak on the Fermi level or Hubbard bands in the spectrum, the\nfeatures in Fe-d spectral functions below -2 eV correspond to hybridization\nwith As-p and O-p bands. The reason for such weak correlation effects in spite\nof the relatively strong Coulomb interaction is very a strong hybridization\nof the Fe-d orbitals with As-p states (see the peaks in the Fe-d spectral\nfunction in the -2÷-3 eV range corresponding to mixing with As-p bands).\nThe hybridization provides an additional very efficient channel for screening\nof the Coulomb interaction between Fe-d electrons.\nThese observations agree with the results of soft X-ray absorption and\nemission spectroscopy study [12]. It was concluded there that LaFeAsO does\nnot represent a strongly correlated system since the Fe L3 X-ray emission\nspectra do not show any features that would indicate presence of the lower\nHubbard band or a sharp quasiparticle peak that were predicted by the\nLDA+DMFT analysis [7, 10, 11]. The comparison of the X-ray absorption\nspectra (O K-edge) with the LDA calculations gave [13] an upper limit of the\neffective on-site Hubbard U ≈1 eV. The photoemission study of LaFeAsO\nsuggests [14] that the line shapes of Fe 2p core-level spectra correspond to\nan itinerant character of Fe 3d electrons. It was demonstrated there that\nthe valence-band spectra are generally consistent with the band-structure\ncalculations except for shifts of the Fe 3d-derived peaks towards the Fermi\nlevel. Such a shift is indeed observed in our LDA+DMFT spectra (Fig. 2).\nThe resonant inelastic X-ray scattering (RIXS) measurements of the LaOFeAs\n[12], LiFeAs and NaFeAs [27], CaFe2 As2 [28] were performed at the soft Xray fluorescence endstation at Beamline 8.0.1 of the Advanced Light Source\nat Lawrence Berkeley National Laboratory [29]. We have measured the res5\n\n\fonant and non-resonant Fe L2,3 (3d4s → 2p1/2,3/2 transition) X-ray emission\nspectra (XES). The instrument resolution for Fe L2,3 X-ray emission spectra was 0.8 eV. X-ray absorption spectra (XAS) were measured in the total\nfluorescence yield mode with a resolving power E/∆E=5000.\nResonantly excited Fe L3 XES spectra of LaOFeAs, CaFe2 As2 , NaFeAs\nand LiFeAs which directly probe the distribution of occupied Fe 3d-states are\npresented in Fig. 3. The position of the Fermi level on the spectral curves\nis determined using the XPS Fe 2p binding energy for CaFe2 As2 (Eb =706.7\neV) [28]. One can see that the intensity maximum of Fe L3 XES is located\nwithin 0.9-1.25 eV with respect to the Fermi level which demonstrates that\nthe Fe 3d-states dominate at the top of the valence band for both one-layered\nand two-layered FeAs-systems. For all investigated compounds Fe L3 X-ray\nemission spectra do not show any features that would indicate the presence\nof the lower Hubbard band or a sharp quasiparticle peak.\nThe XPS Fe 2p core level spectra of LaOFeAs [14], CaFe2 As2 [28],\nLaOFeP [30] and FeO [31] (see Fig. 4) don't show any presence of satellites\ntypical for correlated systems (such as FeO) and very similar to that of\nmetallic Fe [32]. Therefore the line shapes of XPS Fe 2p core-level spectra\nof iron pnictides correspond to an itinerant character of Fe 3d electrons.\nThis conclusion is supported by comparison of non-resonant Fe L2,3 XES\nof LaOFeAs, CaFe2 As2, NaFeAs and LiFeAs (Fig. 5). The two main bands\nlocated around 705 and 718 eV correspond to Fe L3 (3d4s → 2p3/2 transition)\nand Fe L2 (3d4s → 2p1/2 transition) normal emission lines, respectively, separated by spin-orbital splitting of Fe 2p. For free atoms the relative intensity\nratio of L2 and L3 XES lines, I(L2 )/I(L3 ), is determined only by the statistical population of 2p1/2 and 2p3/2 levels and therefore should be equal to\n1/2. In metals the radiationless L2 L3 M4,5 Coster-Kronig (C-K) transitions\nstrongly reduce the intensity ratio I(L2 )/I(L3 ) [33]. One can see from the\nFig. 3 that the intensity ratio I(L2 )/I(L3 ) is almost identical for all above\nmentioned FeAs-compounds and more close to that of Fe metal than to FeO.\nAll available photoemission measurements of iron pnictides [14, 28, 30,\n26, 34, 35] as well as FeSe [36] which probe a total density of states show\na very similar fine structure which is consistent with LDA calculations. The\nFe 3d partial density of states of LaOFeAs determined by indirect way as\na difference of photoemission spectra measured at and below Fe3p → 3d\nresonance is found to be different in Refs. [14] and [35]. Authors [35] have\nrevealed in difference spectrum a broad peak centered at 7 eV and satellite\nat 12 eV which are attributed to the incoherent part of Fe 3d states and\n6\n\n\fcontribution of super-Coster-Kronig Fe 3p − 3d Auger transition (similar to\nthat of FeO [37]), respectively, which are considered as an indication of\nrelatively strong correlation effects in this material. On the other hand, in\ndifference spectrum obtained in [14] no broad peak at 7 eV is detected and\nspectral feature at 12 eV is found to be consistent with calculated As 4s low\nenergy subband.\nThe behavior of the real part of self energy near zero frequency Σ(ω)|ω→0\nprovides an important information about band narrowing and renormalization of the electron mass. Padé approximant [24] was used to obtain\nthe self energy on the real frequency axis. The results are presented in\nFig. 6. The calculated values of the quasiparticle renormalization factor\nZ = (1 − ∂Σ(ω)\n|\n)−1 are found to be 0.56, 0.54, 0.45, 0.56 for dxy , dyz (or\n∂ω ω=0)\ndzx ), d3z 2 −r2 , dx2 −y2 orbitals, respectively. These values agree well with the\neffective narrowing of the LDA+DMFT spectral functions relative to LDA\nDOS (Fig. 2). The effective mass enhancement m∗ = Z −1 are 1.78, 1.85,\n2.22, 1.95 for dxy , dyz (or dzx ), d3z 2 −r2 , dx2 −y2 orbitals, respectively, agrees\nwell with the mass enhancement factor between 1.7 and 2.1 reported in the\ndHvA study [25] and also with the results of Angle-Resolved Photoemission\nSpectroscopy (ARPES) for pnictides [35, 30] where overall bandwidth was\nfound to be reduced by a factor of 2. The dx2 −y2 orbital has the largest effective mass and exhibits the most evident narrowing of LDA spectrum (see\nFig. 2). This orbital has its lobes directed into the empty space between\nnearest iron neighbors in the Fe plane. Hence it has the weakest overlap, the\nsmallest band width, and the largest U/W ratio.\nThe small effective mass enhancement shows that LaFeAsO is a moderately correlated system in contrast to the results of LDA+DMFT calculation [7] by Haule et al where a strongly renormalized low energy band with\na fraction of the original width (Z ≈ 0.2-0.3) was found while most of the\nspectral weight was transferred into a broad Hubbard band at the binding\nenergy ≈4 eV. Authors of Ref. [7] report that \"slightly enhanced Coulomb\nrepulsion (U= 4.5 eV) opens the gap\" so that the system is in strongly correlated regime on the edge of a metal-insulator transition. It is difficult to\nunderstand why two LDA+DMFT calculations gave so different results because descriptions of calculation details in Haule et al paper are very short.\nThe only decisive way solve this problem would be third party independent\ncalculation.\nIn LaFeAsO the iron ion is tetrahedrally coordinated with four As ions\nexhibiting a slight tetragonal distortion. In the tetrahedral symmetry group\n7\n\n\fTd the five d-orbitals should be split by the crystal field into a low-energy\ndoublet of 3z 2 − r 2 , xy corresponding to the eg irreducible representation and\na high-energy triplet of x2 − y 2 , xz, yz belonging to the t2g representation.\nWe have calculated the WF orbital energies and have found that the t2g –eg\ncrystal field splitting is very small ∆cf ≈0.25 eV. The slight tetragonal distortion of the tetrahedron leads to an additional splitting of the t2g and eg levels\nwith the following orbital energies (the energy of the lowest 3z 2 −r 2 orbital is\nset to zero): ε3z 2 −r2 =0.00 eV, εxy =0.03 eV, εxz,yz =0.26 eV, εx2 −y2 =0.41 eV.\nThe correlation leads not only to narrowing of the bands but also to substantial shifts of the Fe-d orbitals energies. Adding the Re(Σ(0)) to the LDA\norbital energies results in ε3z 2 −r2 =0.00 eV, εxy =-0.37 eV, εxz,yz =0.10 eV,\nεx2 −y2 =0.20 eV (see Fig. 7). Note that the actual band shifts are smaller due\nto the p-d hybridization.\nComparison of the LDA+DMFT single-particle spectral functions to various experimental spectra is presented in Figs. 8-9. Taking into account the\nselection rules for XES (X-ray emission spectroscopy) (neglecting the energy dependence of matrix elements) we compare the Fe L3 XES spectrum\nof Ref. [12], which corresponds to 2p → 3d transitions, with the calculated\nLDA+DMFT Fe-3d spectral function (see Fig. 8) to find a good agreement\nbetween the two. The shoulder in the experimental curve near -2.5 eV corresponds to the low energy peak in the calculated spectrum originating from\nstrong hybridization between the Fe-d and As-p states (see also Fig. 1). In\nFig. 9 we present the total LDA+DMFT spectral function together with the\nexperimental photoemission data of Ref [26]. Again we find a very good\nagreement between the theory and experiment. The sharp peak at the Fermi\nenergy corresponds to a partially filled Fe-d band while the broad feature\nbetween -2 and 6 eV corresponds to the oxygen and arsenic p bands.\nIn conclusion, we have calculated the average Coulomb interaction U and\nJ within the Fe d-shell in LaFeAsO using the constrained DFT procedure in\nthe basis of Wannier functions and have obtained the Coulomb parameters\nvalues F 0 =3.5 eV, J=0.8 eV . The LDA+DMFT calculations yield moderately correlated iron d bands in this compound. This conclusion is supported\nby spectroscopic studies of this material and other pnictides.\nSupport by the Russian Foundation for Basic Research under Grant No.\nRFFI-07-02-00041, President of Russian Federation fund of support for scientific schools (grants NSH-1929.2008.2 and NSH-1941.2008.2), the Natural\nSciences and Engineering Research Council of Canada (NSERC), and the\nCanada Research Chair program is gratefully acknowledged.\n8\n\n\fReferences\n[1] Kamihara Y, Watanabe T, Hirano M and Hosono H, J. Am. Chem. Soc.\n130, 3296 (2008)\n[2] de la Cruz C, Huang Q, Lynn J W, Li J, Ratcliff II W, Zarestky J L,\nMook H A, Chen G F, Luo J L, Wang N L and Dai P, Nature 453, 899\n(2008)\n[3] Dederichs P H, Blügel S, Zeller R and Akai H, Phys.Rev.Lett. 53,\n2512 (1984); Gunnarsson O, Andersen O K, Jepsen O and Zaanen J,\nPhys.Rev. B 39, 1708 (1989)\n[4] Anisimov V I and Gunnarsson O, Phys.Rev. B 43, 7570 (1991)\n[5] Solovyev I V and Imada M, Phys.Rev. B 71, 045103 (2005); Aryasetiawan F, Karlsson K, Jepsen O, and Schönberger U, Phys.Rev. B 74,\n125106 (2006)\n[6] Nakamura K, Arita R and Imada M, J.Phys.Soc.Japan 77, 093711\n(2008).\n[7] Haule K, Shim J H and Kotliar G, Phys.Rev.Lett. 100, 226402 (2008)\n[8] Miyake T and Aryasetiawan F, Phys.Rev. B 77, 085122 (2008)\n[9] Georges A, Kotliar G, Krauth W and Rozenberg M, Rev. Mod. Phys.\n68, 13 (1996)\n[10] Craco L, Laad M S, Leoni S and Rosner H, Phys. Rev. B 78, 134511\n(2008)\n[11] Shorikov A O, Korotin M A, Streltsov S V, Korotin D M and Anisimov\nV I, arXiv: 0804.3283; Zhur.Eksp.Teor.Fiz. 135, 134 (2009).\n[12] Kurmaev E Z, Wilks R G, Moewes A, Skorikov N A, Izyumov Yu A,\nFinkelstein L D, Li R H, and Chen X H, Phys. Rev. B 78, 220503(R)\n(2008)..\n[13] Kroll T, Bonhommeau S and Kachel T et al., Phys.Rev. B 78, 220502(R)\n(2008)\n\n9\n\n\f[14] Malaeb W, Yoshida T and Kataoka T et al., J.Phys.Soc.Japan 77,\n093714 (2008).\n[15] Wannier G H, Phys.Rev. 52, 191 (1937)\n[16] Marzari N and Vanderbilt D, Phys.Rev. B 56, 12847 (1997); Ku W,\nRosner H, Pickett W E and Scalettar R T, Phys.Rev.Lett. 89, 167204\n(2002)\n[17] Andersen O K, Phys.Rev. B 12, 3060 (1975); Gunnarsson O, Jepsen O\nand Andersen O K, Phys.Rev. B 27, 7144 (1983)\n[18] Baroni S, de Gironcoli\nhttp://www.pwscf.org\n\nS,\n\nCorso\n\nA\n\nD\n\nand\n\nGiannozzi\n\nP,\n\n[19] Anisimov V I, Kondakov D E, Kozhevnikov A V et al., Phys.Rev. B 71,\n125119 (2005)\n[20] Korotin Dm, Kozhevnikov A V, Skornyakov S L, Leonov I, Binggeli N,\nAnisimov V I and Trimarchi G, Europ. Phys. J. B 65 91, (2008)\n[21] Anisimov V I, Poteryaev A I, Korotin M A, Anokhin A O and Kotliar G,\nJ.Phys.:Cond.Matt. 9, 7359 (1997); Lichtenstein A I and Katsnelson M\nI, Phys.Rev. B 57, 6884 (1998); Held K, Nekrasov I A, Keller G, Eyert\nV, Blümer N, McMahan A K, Scalettar R T, Pruschke Th, Anisimov V\nI and Vollhardt D, Phys. Stat. Sol. (b) 243, 2599 (2006)\n[22] Hirsch J E and Fye R M, Phys.Rev.Lett. 56, 2521 (1986)\n[23] Liebsch A and Costi T A, Europ. Phys. J. B, 51, 523 (2006); Pruschke\nTh and Bulla R, Europ. Phys. J. B, 44, 217 (2005)\n[24] Vidberg H J and Serene J E, J. Low Temp. Phys. 29, 179 (1977)\n[25] Coldea A I, Fletcher J D, Carrington A et al. Phys. Rev. Lett. 101,\n216402 (2008)\n[26] Koitzsch A, Inosov D, Fink J et al. Phys. Rev. B 78, 180506(R) (2008)\n[27] Kurmaev E Z, McLeod J, Skorikov N A, Moewes A, Korotin M A,\nIzyumov Yu A, and Clarke S, arXiv: 0903.4901 (2009)\n\n10\n\n\f[28] Kurmaev E Z, McLeod J, Buling A, Skorikov N A, Moewes A, Neumann\nM, Korotin M A, Izyumov Yu A and Canfield P, arXiv: 0902.1141\n[29] Jia J J, Callcott T A, Yurkas J, Ellis A W, Himpsel F J, Samant M G,\nStohr J, D Ederer D L, Carlisle J A, Hudson E A, Terminello L J, Shuh\nD K, and Perera R C C, Rev. Sci. Instrum. 66, 1394 (1995).\n[30] D. H. Lu, M. Yi, S.-K. Mo, A. S. Erickson, J. Analytis, J.-H. Chu, D.\nJ. Singh, Z. Hussain, T. H. Geballe, I. R. Fisher , Z.-X. Shen, Nature\n455, 81 (2008)\n[31] Galakhov V R, Poteryaev A I, Kurmaev E Z, Anisimov V I, Bartkowski\nSt, Neumann M, Lu Z W, Klein B M, Zhao T-R, Phys. Rev. B 56, 4584\n(1997).\n[32] Gao X, Qi D, Tan S C, Wee A T S, Yu X, Moser H O, J. Electr. Spectr.\nRelat. Phenom. 151, 199 (2006).\n[33] Kurmaev E Z, Ankudinov A L, Rehr J J, Finkelstein L D, Karimov P\nF, Moewes A, J. Electr. Spectr. Relat. Phenom. 148, 1 (2005).\n[34] Kamihara Y, Hirano M, Yanagi H, Kamiya T, Saitoh Y, Ikenaga E,\nKobayashi K, and Hosono H, Phys. Rev. B 77, 214515 (2008)\n[35] H. Ding, K. Nakayama, P. Richard, S. Souma, T. Sato, T. Takahashi,\nM. Neupane, Y.-M. Xu, Z.-H. Pan, A.V. Federov, Z. Wang, X. Dai, Z.\nFang, G.F. Chen, J.L. Luo, and N.L. Wang, cond/mat. arXiv: 0812.0534\n(2008).\n[36] Yoshida R, Wakita T, Okazaki H, Mizuguchi Y, Tsuda S, Takano Y,\nTakeya H, Hirata K, Muro T, Okawa M, Ishizaka K, Shin S, Harima\nH, Hirai M, Muraoka Y, and Yokoya T, J. Phys. Soc. Jpn. 78, 034708\n(2009).\n[37] Lad R J and Henrich V E, Phys. Rev. B 39, 13478 (1989).\n\n11\n\n\f-1\nDensity of states, (eV.atom)\n\n10\n8\n6\n4\n2\n0\n\nTotal\n\n2\n0\n\np-O\n2\n0\n\np-As\n2\n0\n\nd-Fe\n-5 -4 -3 -2 -1 0 1\nEnergy, eV, EF=0\n\n2\n\nFigure 1: Total and partial densities of states for LaFeAsO obtained in DFT calculation\nin frame of LMTO method.\n\n12\n\n\f-6\n\n.3\n\n-5\n\n-4\n\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\nFe dxy\n\n0\n.3\n\nFe dyz, zx\n\nSpectral function, eV\n\n-1\n\n0\n.3\n\nFe d3z2-r2\n\n0\n.3\n\nFe dx2-y2\n\n0\n2\n\nAs p\n\n1\n0\n2\n\nOp\n\n1\n0\n-6\n\n-5\n\n-4\n\n-3\n\n-1\n-2\nEnergy, eV\n\n0\n\n1\n\n2\n\n3\n\nFigure 2: Partial densities of states for Fe-3d , As-4p and O-2p states obtained within the\nDFT (filled areas) and LDA+DMFT orbitally resolved spectral functions (bold lines).\n\n13\n\n\fFe L\n\n3\n\nRXES\n\nE\n\nIntensity [Arbitrary Units]\n\nf\n\nLaOFeAs\n\nCaFe As\n2\n\n2\n\nNaFeAs\n\nLiFeAs\n\n695\n\n700\n\n705\n\n710\n\n715\n\nEmission Energy [eV]\n\nFigure 3: Fe L3 XES of LaOFeAs [12], CaFe2As2 [28], LiFeAs and NaFeAs [27].\n\n14\n\n\fXPS Fe 2p\n\nIntensioty [Arbitrary Units]\n\nLaOFeAs\n\nCaFe As\n2\n\n2\n\nLaOFeP\n\nFe metal\n\nFeO\n\n750\n\n740\n\n730\n\n720\n\n710\n\n700\n\nBinding Energy [eV]\n\nFigure 4: XPS Fe 2p of LaOFeAs [14], CaFe2As2 [28], LaOFeP [30], FeO [31] and Fe\nmetal [32].\n\n15\n\n\fFe L\n\n2,3\n\nNXES\n\nL\n\n3\n\nL\n\n2\n\nIntensity [Arbitrary Units]\n\nFeO\n\nFe metal\n\nLaOFeAs\n\nCaFe As\n2\n\n2\n\nNaFeAs\n\nLiFeAs\n\n680\n\n690\n\n700\n\n710\n\n720\n\n730\n\nEmission Energy [eV]\n\nFigure 5: Fe L2,3 NXES of FeAs-systems and reference samples.\n\n16\n\n\fRe(Σ(ω))\n\n23\n\n22\nd(xy)\nd(yz)\n\n21\n\n2\n\nd(3z -r)\nd(zx)\n2\n\n2\n\nd(x -y )\n\nIm(Σ(ω))\n\n20\n0\n\n-1\n\n-2\n-5\n\n0\nω, eV\n\n5\n\nFigure 6: (Colour online) Real (upper panel) and imaginary (lower panel) parts of\nLDA+DMFT self energy interpolated on real axis with the use of Padé approximant\n.\n\n17\n\n\fLDA\n\nLDA+DMFT\n\n0,4\n\nEnergy, eV\n\nFe-d\n\n2\n\n2\n\nd(x -y )\nd(yz),d(zx)\n\n0,2\n\n2 2\n\nd(3z -r )\n\n0\n-0,2\n\nd(xy)\n-0,4\nFigure 7: (Colour online) Splitting of Fe-d orbitals obtained in LDA and LDA+DMFT .\n\n18\n\n\fSpectral function (Arb. units)\n\nFe L3 XES\nLDA+DMFT Fe-d\n\n-6\n\n-4\n-2\nEnergy, eV, EF=0 eV\n\n0\n\n2\n\nFigure 8: (Colour online) Calculated Fe-d LDA+DMFT spectral function (solid line) and\nexperimental Fe L3 XES spectrum (circles) from Ref. [12].\n\n19\n\n\fSpectral function (Arb. units)\n-10\n\nLaFeAsO, PES, 30K\npolysrystal hν=200 eV\nLDA+DMFT\n\n-8\n\n-6\n-4\n-2\nEnergy, eV, EF=0 eV\n\n0\n\nFigure 9: (Colour online) Calculated total LDA+DMFT spectral function (solid line) and\nexperimental LaFeAsOF PES spectrum (circles) from Ref. [26].\n\n20\n\n\f"}