{"id": "http://arxiv.org/abs/1102.3279v1", "guidislink": true, "updated": "2011-02-16T09:55:29Z", "updated_parsed": [2011, 2, 16, 9, 55, 29, 2, 47, 0], "published": "2011-02-16T09:55:29Z", "published_parsed": [2011, 2, 16, 9, 55, 29, 2, 47, 0], "title": "Superperturbation theory on the real-axis", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0501%2C1102.4856%2C1102.0298%2C1102.5342%2C1102.4609%2C1102.0446%2C1102.3240%2C1102.5532%2C1102.0572%2C1102.4054%2C1102.1802%2C1102.5438%2C1102.0162%2C1102.2406%2C1102.3102%2C1102.0193%2C1102.2683%2C1102.5456%2C1102.2778%2C1102.5339%2C1102.1889%2C1102.0006%2C1102.1438%2C1102.1064%2C1102.3466%2C1102.2307%2C1102.2463%2C1102.3035%2C1102.3654%2C1102.3367%2C1102.2144%2C1102.0151%2C1102.2360%2C1102.0769%2C1102.1662%2C1102.1665%2C1102.5605%2C1102.4565%2C1102.3487%2C1102.4915%2C1102.3170%2C1102.5637%2C1102.1326%2C1102.2620%2C1102.1913%2C1102.4994%2C1102.3279%2C1102.1843%2C1102.5593%2C1102.0439%2C1102.4776%2C1102.0698%2C1102.1924%2C1102.4382%2C1102.5338%2C1102.0128%2C1102.4993%2C1102.3229%2C1102.3137%2C1102.0735%2C1102.1524%2C1102.2262%2C1102.3931%2C1102.1442%2C1102.4667%2C1102.5016%2C1102.4003%2C1102.3397%2C1102.0954%2C1102.2894%2C1102.1862%2C1102.1202%2C1102.0105%2C1102.0449%2C1102.0889%2C1102.3372%2C1102.0472%2C1102.3866%2C1102.5250%2C1102.2488%2C1102.1368%2C1102.4137%2C1102.1358%2C1102.4195%2C1102.3705%2C1102.0248%2C1102.4309%2C1102.0719%2C1102.3211%2C1102.5404%2C1102.0883%2C1102.5020%2C1102.0647%2C1102.1840%2C1102.3029%2C1102.3687%2C1102.4091%2C1102.1034%2C1102.3173%2C1102.0397%2C1102.5665&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Superperturbation theory on the real-axis"}, "summary": "In this article we formulate the superperturbation theory for the Anderson\nimpurity model on the real axis. The resulting impurity solver allows to\nevaluate dynamical quantities without numerical analytical continuation by the\nmaximum entropy method or Pad\\'e approximants. This makes the solver well\nsuited to study multiplet effects in solids within the dynamical mean field\ntheory. First examples including multi-orbital problems are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0501%2C1102.4856%2C1102.0298%2C1102.5342%2C1102.4609%2C1102.0446%2C1102.3240%2C1102.5532%2C1102.0572%2C1102.4054%2C1102.1802%2C1102.5438%2C1102.0162%2C1102.2406%2C1102.3102%2C1102.0193%2C1102.2683%2C1102.5456%2C1102.2778%2C1102.5339%2C1102.1889%2C1102.0006%2C1102.1438%2C1102.1064%2C1102.3466%2C1102.2307%2C1102.2463%2C1102.3035%2C1102.3654%2C1102.3367%2C1102.2144%2C1102.0151%2C1102.2360%2C1102.0769%2C1102.1662%2C1102.1665%2C1102.5605%2C1102.4565%2C1102.3487%2C1102.4915%2C1102.3170%2C1102.5637%2C1102.1326%2C1102.2620%2C1102.1913%2C1102.4994%2C1102.3279%2C1102.1843%2C1102.5593%2C1102.0439%2C1102.4776%2C1102.0698%2C1102.1924%2C1102.4382%2C1102.5338%2C1102.0128%2C1102.4993%2C1102.3229%2C1102.3137%2C1102.0735%2C1102.1524%2C1102.2262%2C1102.3931%2C1102.1442%2C1102.4667%2C1102.5016%2C1102.4003%2C1102.3397%2C1102.0954%2C1102.2894%2C1102.1862%2C1102.1202%2C1102.0105%2C1102.0449%2C1102.0889%2C1102.3372%2C1102.0472%2C1102.3866%2C1102.5250%2C1102.2488%2C1102.1368%2C1102.4137%2C1102.1358%2C1102.4195%2C1102.3705%2C1102.0248%2C1102.4309%2C1102.0719%2C1102.3211%2C1102.5404%2C1102.0883%2C1102.5020%2C1102.0647%2C1102.1840%2C1102.3029%2C1102.3687%2C1102.4091%2C1102.1034%2C1102.3173%2C1102.0397%2C1102.5665&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this article we formulate the superperturbation theory for the Anderson\nimpurity model on the real axis. The resulting impurity solver allows to\nevaluate dynamical quantities without numerical analytical continuation by the\nmaximum entropy method or Pad\\'e approximants. This makes the solver well\nsuited to study multiplet effects in solids within the dynamical mean field\ntheory. First examples including multi-orbital problems are discussed."}, "authors": ["Christoph Jung", "Aljoscha Wilhelm", "Hartmut Hafermann", "Sergey Brener", "Alexander Lichtenstein"], "author_detail": {"name": "Alexander Lichtenstein"}, "author": "Alexander Lichtenstein", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/andp.201100043", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1102.3279v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.3279v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.3279v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.3279v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1002/andp.201100043", "fulltext": "Ann. Phys. (Berlin) 0, No. 0, 1 – 8 (0)\n\nSuperperturbation theory on the real-axis\nChristoph Jung1∗ , Aljoscha Wilhelm1 , Hartmut Hafermann2 , Sergey Brener1 , and Alexander Lichtenstein1\n\narXiv:1102.3279v1 [cond-mat.str-el] 16 Feb 2011\n\n1\n\n2\n\n1. Institut für theoretische Physik\nUniversität Hamburg\nJungiusstrasse 9\n22355 Hamburg Germany\nCentre de Physique Théorique (CPHT)\nÉcole Polytechnique\n91128 Palaiseau Cedex, France\n\nKey words superperturbation, dual perturbation theory, Impurity solvers\nIn this article we formulate the superperturbation theory for the Anderson impurity model on the real axis.\nThe resulting impurity solver allows to evaluate dynamical quantities without numerical analytical continuation by the maximum entropy method or Padé approximants. This makes the solver well suited to study\nmultiplet effects in solids within the dynamical mean field theory. First examples including multi-orbital\nproblems are discussed.\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n1\n\nIntroduction\n\nThe investigation of strongly correlated materials is one of the main challenges of modern condensed matter theory, which has inspired the research activities of many scientists in the last decades. The physical\nproperties of such materials are characterized by an interplay between the Coulomb interaction of the\nnearly confined electrons and their kinetic energy. This competition results in a delicate balance of localization and delocalization, which requires accurate non-perturbative approaches. Dynamical mean-field\ntheory (DMFT) has become a standard tool for the investigation of strongly correlated materials [1, 2] and\nhas been applied to models as well as to the investigation of real materials [3–5]. DMFT for the first time\nallowed to treat the coherent low-energy excitations and the high-energy excitations as well as their mutual\nfeedback on the same footing.\nThe main concept of the DMFT is to replace the correlated lattice by a single impurity embedded in a\nself-consistent effective medium. In contrast to classical mean-field approaches, the effective medium in\nDMFT is represented by an energy dependent electronic bath which takes local temporal quantum fluctuations into account, whereas spatial fluctuations are frozen out. The solution of the DMFT equations in turn\nrequires accurate impurity solvers. Quantum Monte Carlo (QMC) algorithms are nowadays widely used\nfor this purpose. Continuous-time QMC solvers [6, 7] allow to tackle problems with 5 or even 7 orbitals\nas required for systems with open d or f -shells, respectively. Nevertheless, they suffer from two major\ndrawbacks: The fermionic sign problem for a general Coulomb vertex and –more severely– the fact that\nQMC algorithms work in the imaginary time domain require the numerically ill-conditioned analytical\ncontinuation of stochastic data to the real axis. This makes it difficult to reliably access spectral properties\nand to study e.g. multiplett effects in solids.\nIn principal a rigorous approach, which can work on the real-axis, is the exact diagonalization (ED) or\nLanczos scheme [8]. Here the continuous bath is discretized by a small collection of bath sites, so that the\nproblem can be diagonalized exactly. Due to the exponential growth of the Hilbert space with the number\n∗\n\nE-mail: cjung@physnet.uni-hamburg.de\n\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f2\n\nC. Jung, A. Wilhelm, H. Hafermann, S. Brener, and A. Lichtenstein: Superperturbation theory on the real-axis\n\nof bath parameters, one is limited to as little as one or two bath sites per d-orbital, so that finite size effects\nmay become dominant. In addition, an ambiguity arises in determining the effective bath parameters to\nfind an optimal representation of the input hybridization. Alternative approximate approaches comprise\nthe iterated perturbation theory (IPT) [9, 10], the fluctuation-exchange (FLEX) [11] or non-crossing approximation (NCA) [12] and the related hybridization expansion [13]. These perturbative methods are\nnaturally limited to some parameter window and fail outside this region. FLEX and IPT are applicable for\nweak-coupling, while the hybridization expansion works in the strong coupling regime.\nRecently an impurity solver has been developed by combining ED with a diagrammatic approach. The\nkey idea is to formulate a perturbation expansion around the ED solution by employing a transformation to\nauxiliary, so-called dual fermions [14]. We refer to the perturbation of a non-trivial (i.e. interacting) albeit\nnumerically solvable reference problem as a superperturbation [15]. It has been shown that the method becomes exact in two opposite limits: For weak coupling and and strong hybridization, the approach becomes\nequivalent to a standard perturbation expansion in the interaction. In the opposite limit of strong interaction and weak hybridization the formalism resembles the strong coupling expansion [13]. This method can\nbe sytematically improved by either including more bath sites in the ED (which essentially decreases the\nperturbation) or by including more diagrams.\nIn the previous work the solver has been formulated in imaginary time. Analytical continuation was\nfound to be significantly more stable than in QMC due to the absence of statistical noise. In this article, we\nformulate the superperturbation theory on the real-axis, making analytical continuation from intermediate\nimaginary time results obsolete.\n\n2\n\nSuperperturbation formalism\n\nTo set the stage, we briefly review the superperturbation formalism in the following. For further reading\nwe refer the interested reader to [15]. The model under consideration is the Anderson impurity model\ndescribed by the following Hamiltonian:\n\u0011\nX\nX\nX \u0010 αβ\nH=\n(1)\nǫbkγ b†kγ bkγ +\nǫcα c†α cα + Hint [c† , c] +\nVk c†α bkβ + Vk∗βα b†kα cβ .\nα\n\nkγ\n\nkαβ\n\nHere Greek letters are used as a combined index for orbital and spin degrees of freedom. b† (c† ) and b (c)\nare the bath (impurity) creation and annihilation operators, respectively. Hint is the local electron-electron\ninteraction, Vkαβ are the transition amplitudes for hopping processes from the bath to an impurity orbital.\nTo derive a dual formulation of the problem, we first integrate out the bath degrees of freedom, which leads\nto the conventional action representation:\nX\n(2)\nS[c∗ , c] = −\nc∗ωα [(iω + μ)1 − ∆(ω)]αβ cωβ + S int [c∗ , c].\nωαβ\n\nHere S int is a non-gaussian interaction term and\n[∆(ω)]αβ =\n\nX V αγ (V βγ )∗\nk\n\nkγ\n\nk\n\niω − ǫkγ\n\nis the hybridization function of the full system. The first step in the formulation of the superperturbation is\nto express the action of the model in terms of that of an exactly solvable reference problem and a difference\nterm. To this end, we add and subtract a hybridization function ∆N (ω) corresponding to a discrete bath:\nX\nS[c∗ , c] = S ref [c∗ , c] −\nc∗ωα [∆N (ω) − ∆(ω)]αβ cωβ ,\n(3)\nωαβ\n\nref\n\n∗\n\nS [c , c] = −\n\nX\n\nc∗ωα [(iω\n\n+ μ)1 − ∆N (ω)]αβ cωβ + S int [c∗ , c].\n\n(4)\n\nωαβ\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nwww.ann-phys.org\n\n\fAnn. Phys. (Berlin) 0, No. 0 (0) / www.ann-phys.org\n\n3\n\nThe reference system with a discrete bath with N bath sites shares the interaction part of the original\nproblem and can be solved efficiently by exact diagonalization. Note that this step leaves the hybridization\n∆N (ω) unspecified.\nThe second step is to reformulate the problem in such a way that a perturbative treatment of the difference term D(ω) = ∆N (ω) − ∆(ω) can be performed. Since S ref contains a non-quadratic part Wick's\ntheorem is not directly applicable. Therefore, we introduce auxiliary (dual) fermionic degrees of freedom\nusing an exact Gaussian identity in the path integral:\nZ\n−1\n∗\n∗\n∗\n∗\n1\necα aαβ bβγ aγδ cδ =\nD[f ∗ , f ]e−fα bαβ fβ +fα aαβ cβ +cα aαβ fβ ,\n(5)\ndet b\nwhere the matrices a and b have the following form:\n)\na = −g −1 (ω)\nb = g −1 (ω)[∆N (ω) − ∆(ω)]−1 g −1 (ω)\n\nN\n→ aαβ b−1\nβγ aγδ = [∆ (ω) − ∆(ω)]αδ = D(ω),\n\n(6)\n\nwith g(ω) being the exact single particle Green's function of the reference system Eq. (4). After the\ntransformation, the resulting action has a mixed representation of c- and f -fermions:\nX\n∗\nS[c∗ , c, f ∗ , f ] =S ref [c∗ , c] + S c [f ∗ , f, c∗ , c] +\nfωα\n[g(ω)D(ω)g(ω)]−1\n(7)\nαβ fωβ ,\nωαβ\n\nwhere the coupling between the c and f -fermions is given by\nX\nX\n−1\n−1\n∗\nS c [f ∗ , f, c∗ , c] =\ngαβ\n(ω)cωβ +\nfωα\n(ω)fωβ .\nc∗ωα gαβ\nωαβ\n\n(8)\n\nωαβ\n\nThe original fermionic degrees of freedom can formally be integrated out exactly. To this end, we expand\nin exp(−S c ) in the path integral representation of the partition function. It is convenient to reexpress the\nresult in the following form:\nZ\nexp(−S ref [c∗ , c] − S c [c∗ , c, f ∗ , f ])D[c∗ , c]\nX\n(9)\n!\n−1\n∗\n= Zref exp(−\nfωα\ngαβ\n(ω)fωβ + V [f ∗ , f ]).\nωαβ\n\nThis equation defines the dual potential, which gathers two-particle and higher-order interaction terms.\nThe key point is that due to the presence of S ref on the left-hand-side of (9), integrating out the original\nfermions corresponds\nto performing the average over the degrees of freedom of the reference system:\nR\nZref h. . .iref := . . . D[c∗ , c]. The resulting dual action has the following form:\nX\n∗\n∗\nS d [f ∗ , f ] = −\nfωα\n[Gd0 (ω)]−1\n(10)\nαβ fωβ + V [f , f ].\nωαβ\n\nAs a result of averaging, both the bare dual matrix Green function Gd0 (ω) = −g(ω)[g(ω)+D(ω)−1 ]−1 g(ω)\nand the dual potential\n1 (6)\n1 (4)\nV [fi∗ , fi ] = − γαβγδ fα∗ fβ fγ∗ fδ + γαβγδμν fα∗ fβ fγ∗ fδ fμ∗ fν ∓ . . . .\n4\n36\n\n(11)\n\ncontain the correlation functions of the reference system: g(ω) denotes its single-particle Green's function\nand γ (n) are the corresponding reducible vertices. The two-particle vertex for example is given by:\n(4)\n\n0,Ref\n−1 −1\n−1 −1\nRef\nγαβγδ = gαα\n′ gγγ ′ [χα′ β ′ γ ′ δ ′ − χα′ β ′ γ ′ δ ′ ]gβ ′ β gδ ′ δ ,\n\nwww.ann-phys.org\n\n(12)\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f4\n\nC. Jung, A. Wilhelm, H. Hafermann, S. Brener, and A. Lichtenstein: Superperturbation theory on the real-axis\n\nFig. 1 First few diagrams contributing to the dual\nself-energy. Boxes are the reducible vertices of the\nreference system (γ (4) and γ (6) ), lines denote the dual\npropagator (Gd0 ).\n\nwith χref being the two-particle Green's function of the reference system and χ0,ref its unconnected part.\nThese quantities can be calculated straightforwardly on Matsubara frequencies from the Lehmann representation of the single- and two-particle Green's functions [15]. So far, (10) is only a reformulation of the\ninitial action in Eq. (2). The dual problem can now be treated perturbatively, which essentially corresponds\nto an expansion around the reference problem. For example the self-energy correction stemming from the\nfirst diagram in Fig. 1 is given by\n(4)\n\n(Σd(a) )αβ = −γαβγδ (Gd0 )δγ .\n\n(13)\n\nAfter summing up a certain class of diagrams, we obtain a physical result (i.e. solution in terms of the\nphysical c-fermion Green function G) by transforming the dual Green's function back to c-fermions using\nthe following exact relation [14]:\nG(ω) = D(ω)−1 + [g(ω)D(ω)]−1 Gd (ω)[D(ω)g(ω)]−1 .\n\n(14)\n\nIt can be shown that the dual perturbation theory becomes equivalent to conventional perturbation theory\nin the limit of small interaction and strong hybridization. It is instructive to consider its behavior in the\nopposite strong coupling limit. For an expansion around the atomic limit, i.e. ∆N (ω) ≡ 0, combining\nequations (12), (13) and (14) with the lowest order approximation to the dual Green's function, Gd ≈\nGd0 + Gd0 Σd(a) Gd0 leads to the following expression:\nGαβ ≈ gαβ + gαβ βT r[g∆] − χαβγδ ∆δγ ,\n\n(15)\n\nwhich recovers the result obtained from an expansion of the imaginary time Green function up to first order\nin the hybridization, as given in Ref. [13].\nThe reference system, which is specified through the hybridization function ∆N (ω), should be chosen\nin an optimal way. Here this is even more crucial than in conventional ED, since for the present approach\nthe number of bath sites should be kept at a minimum to increase the efficiency. The choice of ∆N (ω)\ndirectly affects the perturbation D(ω), which in a certain sense should be minimal. This can be achieved\nby minimizing a predefined distance function [2, 16].\n\n3\n\nReformulation on the real axis\n\nIn order to access spectral properties, the previous formulation required analytical continuation of the imaginary time data. This is an ill-posed problem, and different methods have been developed for this purpose.\nThe maximum entropy method (MAXENT) [17] was specifically designed for inferring spectral properties\nfrom statistical data using Bayesian methods. Very fine structures, like multiplets for example, are very\nhard to resolve using this method. In the Padé approach [18] the function of interest is approximated by a\nrational function. Padé can give accurate information on the real axis, provided it is applied to noise-free\ninput data. The approximation through a rational function however is unneccessary for the superperturbation approach and may introduce spurious features. It order to extract unbiased real axis information, it is\ndesirable to formulate this approach directly on the real axis.\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nwww.ann-phys.org\n\n\fAnn. Phys. (Berlin) 0, No. 0 (0) / www.ann-phys.org\n\n5\n\nIn ED, real axis information is readily obtained by performing the substitution iω → E + iδ in the\nLehmann representation, where δ is a small broadening parameter. For the single-particle Green's function\nthis leads to:\n†\n\u0001\n1 X hn|cα |mihm|cβ |ni −βEn\n+ e−βEm .\ne\ngαβ (E + iδ) =\nZ n,m E + iδ + En − Em\n\n(16)\n\nFrom latter expression the density of states (DOS) is obtained as DOS(E) = −1/πIm g(E + iδ). In\nthe superperturbation, analytical continuation is more involved, as one has to take care of the individual\ndiagrams. In the following we discuss the analytical continuation of the first diagram (diagram a.) of Fig.\n1). This diagram has been found to yield by far largest correction to the initial solution. Inserting (12) into\n(13), we obtain\nd(a)\n\n−1\n−1\n−1\nd\nΣαβ = −gαβ\nβTr[∆d g] + ∆dαβ − gαα\n′ χα′ β ′ γ ′ δ ′ gβ ′ β ∆δ ′ γ ′ ,\n\n(17)\n\nwhich is very similar to expression (15), where now ∆d := [g + (∆N − ∆)−1 ]−1 plays the role of ∆.\nWhile g and ∆N are readily accessed on the real axis , we can make use of a result of Ref. [13] which\nallows to calculate the product of the two-particle Green function with ∆d directly within ED.\nXX\n1X\nχαβγδ (iω, iω, iω ′, iω ′ )∆dδγ (iω ′ ) =\n×\nβ iω\nγδ ijkl\n\nn′\n\n\u0002 Rγδ (Ej , Ek )\nRγδ (El , Ek )\nQγδ (iω, Ei , Ek ) \u0003\n+\n+\n+hcα c∗γ cδ c∗β iijkl\nEjl (iω − Eji ) Elj (iω − Eli ) (iω − Eli )(iω − Eji )\n\u0002\nRγδ (Ek , Ej )\nRγδ (Ek , El )\nQγδ (−iω, Ek , Ei ) \u0003\n+hcα cδ c∗γ c∗β iijkl\n+\n−\nEjl (iω − Eji ) Elj (iω − Eli ) (iω − Eli )(iω − Eji )\n\u0002\nRγδ (Ei , Ej )\nQγδ (−iω, El , Ej ) \u0003\nRγδ (Ek , Ej )\n+\n−\n+hc∗γ cδ cα c∗β iijkl\nEki (iω − Elk ) Eik (iω − Eli ) (iω − Eli )(iω − Elk )\n\u0002\nRγδ (Ej , Ek )\nRγδ (Ej , Ei )\nQγδ (iω, Ej , El ) \u0003\n+hcδ c∗γ cα c∗β iijkl\n+\n+\nEki (iω − Elk ) Eik (iω − Eli ) (iω − Eli )(iω − Elk )\n1\n+hcδ cα c∗γ c∗β iijkl\n×\n(iω − Ekj )(iω − Eli )\n\u0002\n\u0003\nRγδ (Ek , El ) − Rγδ (Ej , Ei ) + Qγδ (iω, Ej , El ) − Qγδ (−iω, Ek , Ei )\n1\n×\n+hc∗γ cα cδ c∗β iijkl\n(iω − Ekj )(iω − Eli )\n\u0002\n\u0003\nRγδ (El , Ek ) − Rγδ (Ei , Ej ) + Qγδ (iω, Ei , Ek ) − Qγδ (−iω, El , Ej ) ,\n\n(18)\n\nwith the following definitions for the matrix elements:\n\nhOα Oβ Oγ Oδ iijkl = hi|Oα |jihj|Oβ |kihk|Oγ |lihl|Oδ |ii.\n\n(19)\n\nThe functions R and Q have the following definitions:\nRαβ (Ei , Ej ) :=\n\nd\n′\n1 −βEi\n1 X ∆αβ (iω )\n,\n+ e−βEj )\n(e\nZ\nβ ′ iω − Eij\n\n(20)\n\niω\n\nQαβ (iω, Ei , Ej ) :=\nwww.ann-phys.org\n\n(\n\n− Zβ e−βEi ∆dαβ (iω)\n1\n−βEi\nZ (e\n\n− e−βEj ) β1\n\nfor Ei = Ej\nP\n\n∆dαβ (iω ′ )\niω ′ iω ′ −iω−Eij\n\nelse.\n\n(21)\n\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f6\n\nC. Jung, A. Wilhelm, H. Hafermann, S. Brener, and A. Lichtenstein: Superperturbation theory on the real-axis\nFig. 2 top: Standard procedure of\nconverting a Matsubara sum into a contour integral. In a first step the sum is\nreplaced by a contour integral over the\nfunction itself times the Fermi function, which has poles at Matsubara frequencies. In the second and third step\nthe contour is deformed to two line integrals along the real axis. The illustrated contour deformation is applied\nin the calculation of R. bot.: Construction of the contour integral to calculate\nQ. In comparison to the upper case one\nhas to take into account an additional\npole at z̃ = iω + E12 .\n\nThe trace over ∆D and g can also be expressed in terms of R:\nX\nTr[g∆d ] =\nhi|cδ |jihj|c†γ |iiRγδ (Ei , Ej ).\n\n(22)\n\ni,j,δ,γ\n\nHence the analytic continuation of Eq (17) reduces to the continuation of the function Q(iω, Ei , Ej ). Since\nR(Ei , Ej ) does not depend on iω the function can be in principle calculated using definition (20). In order\nto treat both function evaluations on the same footing, we discuss in the following how R and Q can be\ncalculated via an integral along the real axis.\nThe Matsubara sums in Q and R are rewritten as a sum over residues of the function itself times the Fermi\nfunction, which has poles of first order at the Matsubara frequencies:\nI\n1\nF (E)\n1X\nF (iω) = −\ndE.\n(23)\nβ iω\n2πi C eβE + 1\nAfterwards the integral contour is deformed according to figure 2. This leads to the following definitions\nof both expressions as integrals along the real axis:\nZ ∞ d −\nZ\nX1 + X2 h ∞ ∆d (z + )f (z + )\n∆ (z )f (z − ) i\nR(E1 , E2 ) = −\ndz,\n(24)\n−\n+\n2πi\nz − E12\nz − − E12\n−∞\n−∞\n\"\n\u0012Z ∞\n1\n∆d (z + )f (z + )\nQ(iω, E1 , E2 ) =(X1 − X2 ) −\ndz\n2πi −∞ z + − iω − E12\n#\n(25)\n\u0013\nZ ∞\n1\n∆d (z − )f (z − )\ndz −\n∆d (iω + E12 ) ,\n−\n−\n1 − eβE12\n−∞ z − iω − E12\nwhere z ± = z±iǫ, with ǫ < π/β being the offset of the contour from the real axis and Xi = exp(−βEi )/Z.\nThe last term in the expression for Q is due to a residue of Q at z̃ = iω + E12 . Now the analytical continuation can be performed by replacing iω by E + iδ:\n\"\n\nQ(z̃, E1 , E2 ) = (X1 − X2 ) −\n\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\u0012Z ∞ d +\n1\n∆ (z )f (z + )\ndz\n2πi −∞ z + − z̃ − E12\n#\n\u0013\nZ ∞ d −\n1\n∆ (z )f (z − )\nd\ndz −\n∆ (z̃ + E12 ) , (26)\n−\n−\n1 − eβE12\n−∞ z − z̃ − E12\nwww.ann-phys.org\n\n\fAnn. Phys. (Berlin) 0, No. 0 (0) / www.ann-phys.org\n\n7\n\nFig. 3 SPERT calculations on the real axis\n(CORA), in comparison with Padé and the\nresult of the reference system (ED). The\nupper part shows an example for β =\n10 and U = 3, in units of the halfbandwidth (W/2). Here the agreement between CORA and Padé is good, but the\nCORA shows more structure on the real\naxis. The lower part shows the same system\nwith an applied magnet field: B = 0.05.\n\nFig. 4 Example of a CORA calculation\nfor a multi-orbital case. A three orbital impurity with U = 1.5, U ′ = 0.7, J = 0.4,\nμ = 3.02 and β = 15 (in units of the\nquarter-bandwidth) is embedded in a bath\nwith a constant density of states in the energy window |E| < W/2. The coupling\nto the bath is V = 0.1. The hybridization was approximated by a single bath site.\nThe CORA data set exhibits small features\nin the density of states which are absent in\nthe Padé results.\n\nwith z̃ = E + iδ, where δ is the usual broadening parameter, which is restricted to values δ > ǫ. This\ncompletes the analytic continuation.\nA few remarks are in place. In contrast to Ref. [13] we do not perform the limit ǫ → 0 because of the\nparticular structure of the \"dual\" hybridization, which has poles on the real axis. The integrals are evaluated with a small offset ǫ. For not too low temperatures a simple quadrature rule is sufficient. For lower\ntemperatures, ∆d develops a sharp peak. We therefore employ an adaptive Gauss-Kronrod algorithm taken\nfrom the GNU scientific library [19]. As a check for numerical accuracy one may verify that the value of\nthe integrals is independent of ǫ.\nFigure 3 shows some illustrative results for the AIM with hybridization corresponding to a semielliptical\nDOS of bandwidth W . In the upper left plot the calculation on the real axis (CORA) is compared to an\nanalytic continuation using Padé and the initial solution of the reference system (labeled 'ED'). The ED\ncurve has a clear splitting at the Fermi level, whereas the CORA curve exhibits a Kondo peak. The CORA is\nin a good agreement with Padé. The lower left plot shows an additional example with an applied magnetic\nfield. Here the splitting of the peaks is clearly visible and the CORA is again in good agreement with Padé.\nFor completeness the data on Matsubara frequencies has been added on the right.\nIn Figure 4 we present an example for a multi-orbital problem with a rotational invariant Coulomb vertex.\nA three-orbital impurity has been embedded in a bath, which corresponds to a flat density of states in the\nenergy window |E| < W/2. The coupling to the bath was moderate and has been approximated by a\nsingle bath site, which was equally connected to all impurity orbitals. In comparison to the solution of\nthe reference system a clear shift of nearly all peaks in the CORA is visible. The Padé solution is in good\nwww.ann-phys.org\n\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n\f8\n\nC. Jung, A. Wilhelm, H. Hafermann, S. Brener, and A. Lichtenstein: Superperturbation theory on the real-axis\n\noverall agreement with the CORA data, but fails to reproduce some small features. Indeed one may expect\nthat the CORA results are more accurate than the analytical continuation via Padé approximants if the\ncontinued function has rich structure, since the approximation through a rational function becomes less\naccurate. For complicated multiorbital systems we expect differences to be more pronounced.\n\n4\n\nConclusion\n\nIn the present work we have presented a multiorbital impurity solver based on the superperturbation for\nthe Anderson impurity model (AIM). It allows to compute dynamical quantities directly on the real axis,\nwhich has the advantage that no analytic continuation using approximate methods like MAXENT or Padé\nis necessary. Considering three examples including a multi-orbital impurity problem, we compared the\nresults of the new implementation to results obtained using Padé. We find overall good agreement. The\ndirect calculation on the real axis however can resolve finer structures, which will be useful for the study\nof multiplett effects in solids. This work has been supported by the Cluster of Excellence Nanospintronics\n(LExI Hamburg) and DFG Grant(436113/938/0-R).\n\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n\nG. Kotliar and D. Vollhardt, Physics Today 57(3), 53–59 (2004).\nA. Georges, G. Kotliar, W. Krauth, and M. Rozenberg, Reviews of Modern Physics 68(1), 13–125 (1996).\nA. I. Lichtenstein and M. I. Katsnelson, Physical Review B 57(12), 6884–6895 (1998).\nK. Held, Advances In Physics 56(6), 829–926 (2007).\nG. Kotliar, S. Y. Savrasov, K. Haule, V. S. Oudovenko, O. Parcollet, and C. A. Marianetti, Reviews of Modern\nPhysics 78(3), 865–951 (2006).\nA. N. Rubtsov, V. V. Savkin, and A. I. Lichtenstein, Physical Review B 72(3) (2005).\nP. Werner, A. Comanac, L. d. Medici, M. Troyer, and A. J. Millis, Physical Review Letters 97(7) (2006).\nM. Caffarel and W. Krauth, Physical Review Letters 72(10), 1545–1548 (1994).\nK. Yosida and K. Yamada, Progress of Theoretical Physics Supplement 46, 244–255 (1970).\nK. Yosida and Y. K., Progress of Theoretical Physics 53(5), 1286–1301 (1975).\nN. E. Bickers, D. J. Scalapino, and S. R. White, Physical Review Letters 62(8), 961–964 (1989).\nH. Keiter and J. C. Kimball, International Journal of Magnetism 1, 233–251 (1971).\nX. Dai, K. Haule, and G. Kotliar, Physical Review B 72(4) (2005).\nA. N. Rubtsov, M. I. Katsnelson, and A. I. Lichtenstein, Physical Review B 77(3) (2008).\nH. Hafermann, C. Jung, S. Brener, M. I. Katsnelson, A. N. Rubtsov, and A. I. Lichtenstein, Europhysics Letters\n85(2) (2009).\nE. Koch, G. Sangiovanni, and O. Gunnarsson, Phys. Rev. B 78(11), 115102 (2008).\nJ. E. Gubernatis, M. Jarrell, R. N. Silver, and D. S. Sivia, Phys. Rev. B 44(12), 6011–6029 (1991).\nH. J. Vidberg and J. W. Serene, Journal of Low Temperature Physic 29(3/4), 179 (1977).\nB. Gough, GNU Scientific Library Reference Manual - Third Edition (Network Theory Ltd., 2009).\n\nc 2007 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\nwww.ann-phys.org\n\n\f"}