{"id": "http://arxiv.org/abs/astro-ph/0602327v1", "guidislink": true, "updated": "2006-02-15T03:13:39Z", "updated_parsed": [2006, 2, 15, 3, 13, 39, 2, 46, 0], "published": "2006-02-15T03:13:39Z", "published_parsed": [2006, 2, 15, 3, 13, 39, 2, 46, 0], "title": "A Hybrid N-body--Coagulation Code for Planet Formation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0602114%2Castro-ph%2F0602522%2Castro-ph%2F0602185%2Castro-ph%2F0602267%2Castro-ph%2F0602304%2Castro-ph%2F0602530%2Castro-ph%2F0602399%2Castro-ph%2F0602379%2Castro-ph%2F0602327%2Castro-ph%2F0602353%2Castro-ph%2F0602266%2Castro-ph%2F0602529%2Castro-ph%2F0602105%2Castro-ph%2F0602539%2Castro-ph%2F0602425%2Castro-ph%2F0602336%2Castro-ph%2F0602175%2Castro-ph%2F0602606%2Castro-ph%2F0602521%2Castro-ph%2F0602428%2Castro-ph%2F0602345%2Castro-ph%2F0602346%2Castro-ph%2F0602579%2Castro-ph%2F0602104%2Castro-ph%2F0602470%2Castro-ph%2F0602350%2Castro-ph%2F0602423%2Castro-ph%2F0602013%2Castro-ph%2F0602119%2Castro-ph%2F0602578%2Castro-ph%2F0602197%2Castro-ph%2F0602028%2Castro-ph%2F0602193%2Castro-ph%2F0602339%2Castro-ph%2F0602335%2Castro-ph%2F0602006%2Castro-ph%2F0602486%2Castro-ph%2F0602438%2Castro-ph%2F0602395%2Castro-ph%2F0602354%2Castro-ph%2F0602216%2Castro-ph%2F0602008%2Castro-ph%2F0602099%2Castro-ph%2F0602066%2Castro-ph%2F0602087%2Castro-ph%2F0602140%2Castro-ph%2F0602516%2Castro-ph%2F0602585%2Castro-ph%2F0602300%2Castro-ph%2F0602449%2Castro-ph%2F0602283%2Castro-ph%2F0602412%2Castro-ph%2F0602450%2Castro-ph%2F0602277%2Castro-ph%2F0602325%2Castro-ph%2F0602388%2Castro-ph%2F0602474%2Castro-ph%2F0602445%2Castro-ph%2F0602626%2Castro-ph%2F0602116%2Castro-ph%2F0602007%2Castro-ph%2F0602121%2Castro-ph%2F0602458%2Castro-ph%2F0602502%2Castro-ph%2F0602287%2Castro-ph%2F0602205%2Castro-ph%2F0602319%2Castro-ph%2F0602377%2Castro-ph%2F0602291%2Castro-ph%2F0602342%2Castro-ph%2F0602225%2Castro-ph%2F0602289%2Castro-ph%2F0602282%2Castro-ph%2F0602246%2Castro-ph%2F0602526%2Castro-ph%2F0602248%2Castro-ph%2F0602247%2Castro-ph%2F0602608%2Castro-ph%2F0602190%2Castro-ph%2F0602072%2Castro-ph%2F0602010%2Castro-ph%2F0602179%2Castro-ph%2F0602441%2Castro-ph%2F0602365%2Castro-ph%2F0602211%2Castro-ph%2F0602543%2Castro-ph%2F0602517%2Castro-ph%2F0602148%2Castro-ph%2F0602597%2Castro-ph%2F0602344%2Castro-ph%2F0602036%2Castro-ph%2F0602165%2Castro-ph%2F0602078%2Castro-ph%2F0602611%2Castro-ph%2F0602472%2Castro-ph%2F0602330%2Castro-ph%2F0602507%2Castro-ph%2F0602464%2Castro-ph%2F0602499%2Castro-ph%2F0602532%2Castro-ph%2F0602394&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Hybrid N-body--Coagulation Code for Planet Formation"}, "summary": "We describe a hybrid algorithm to calculate the formation of planets from an\ninitial ensemble of planetesimals. The algorithm uses a coagulation code to\ntreat the growth of planetesimals into oligarchs and explicit N-body\ncalculations to follow the evolution of oligarchs into planets. To validate the\nN-body portion of the algorithm, we use a battery of tests in planetary\ndynamics. Several complete calculations of terrestrial planet formation with\nthe hybrid code yield good agreement with previously published calculations.\nThese results demonstrate that the hybrid code provides an accurate treatment\nof the evolution of planetesimals into planets.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0602114%2Castro-ph%2F0602522%2Castro-ph%2F0602185%2Castro-ph%2F0602267%2Castro-ph%2F0602304%2Castro-ph%2F0602530%2Castro-ph%2F0602399%2Castro-ph%2F0602379%2Castro-ph%2F0602327%2Castro-ph%2F0602353%2Castro-ph%2F0602266%2Castro-ph%2F0602529%2Castro-ph%2F0602105%2Castro-ph%2F0602539%2Castro-ph%2F0602425%2Castro-ph%2F0602336%2Castro-ph%2F0602175%2Castro-ph%2F0602606%2Castro-ph%2F0602521%2Castro-ph%2F0602428%2Castro-ph%2F0602345%2Castro-ph%2F0602346%2Castro-ph%2F0602579%2Castro-ph%2F0602104%2Castro-ph%2F0602470%2Castro-ph%2F0602350%2Castro-ph%2F0602423%2Castro-ph%2F0602013%2Castro-ph%2F0602119%2Castro-ph%2F0602578%2Castro-ph%2F0602197%2Castro-ph%2F0602028%2Castro-ph%2F0602193%2Castro-ph%2F0602339%2Castro-ph%2F0602335%2Castro-ph%2F0602006%2Castro-ph%2F0602486%2Castro-ph%2F0602438%2Castro-ph%2F0602395%2Castro-ph%2F0602354%2Castro-ph%2F0602216%2Castro-ph%2F0602008%2Castro-ph%2F0602099%2Castro-ph%2F0602066%2Castro-ph%2F0602087%2Castro-ph%2F0602140%2Castro-ph%2F0602516%2Castro-ph%2F0602585%2Castro-ph%2F0602300%2Castro-ph%2F0602449%2Castro-ph%2F0602283%2Castro-ph%2F0602412%2Castro-ph%2F0602450%2Castro-ph%2F0602277%2Castro-ph%2F0602325%2Castro-ph%2F0602388%2Castro-ph%2F0602474%2Castro-ph%2F0602445%2Castro-ph%2F0602626%2Castro-ph%2F0602116%2Castro-ph%2F0602007%2Castro-ph%2F0602121%2Castro-ph%2F0602458%2Castro-ph%2F0602502%2Castro-ph%2F0602287%2Castro-ph%2F0602205%2Castro-ph%2F0602319%2Castro-ph%2F0602377%2Castro-ph%2F0602291%2Castro-ph%2F0602342%2Castro-ph%2F0602225%2Castro-ph%2F0602289%2Castro-ph%2F0602282%2Castro-ph%2F0602246%2Castro-ph%2F0602526%2Castro-ph%2F0602248%2Castro-ph%2F0602247%2Castro-ph%2F0602608%2Castro-ph%2F0602190%2Castro-ph%2F0602072%2Castro-ph%2F0602010%2Castro-ph%2F0602179%2Castro-ph%2F0602441%2Castro-ph%2F0602365%2Castro-ph%2F0602211%2Castro-ph%2F0602543%2Castro-ph%2F0602517%2Castro-ph%2F0602148%2Castro-ph%2F0602597%2Castro-ph%2F0602344%2Castro-ph%2F0602036%2Castro-ph%2F0602165%2Castro-ph%2F0602078%2Castro-ph%2F0602611%2Castro-ph%2F0602472%2Castro-ph%2F0602330%2Castro-ph%2F0602507%2Castro-ph%2F0602464%2Castro-ph%2F0602499%2Castro-ph%2F0602532%2Castro-ph%2F0602394&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe a hybrid algorithm to calculate the formation of planets from an\ninitial ensemble of planetesimals. The algorithm uses a coagulation code to\ntreat the growth of planetesimals into oligarchs and explicit N-body\ncalculations to follow the evolution of oligarchs into planets. To validate the\nN-body portion of the algorithm, we use a battery of tests in planetary\ndynamics. Several complete calculations of terrestrial planet formation with\nthe hybrid code yield good agreement with previously published calculations.\nThese results demonstrate that the hybrid code provides an accurate treatment\nof the evolution of planetesimals into planets."}, "authors": ["Benjamin C. Bromley", "Scott J. Kenyon"], "author_detail": {"name": "Scott J. Kenyon"}, "author": "Scott J. Kenyon", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/503280", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0602327v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0602327v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Astronomical Journal, accepted; 33 pages + 11 figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0602327v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0602327v1", "journal_reference": "Astron.J.131:2737-2748,2006", "doi": "10.1086/503280", "fulltext": "A Hybrid N-body–Coagulation Code for Planet Formation\nBenjamin C. Bromley\nDepartment of Physics, University of Utah, 201 JFB, Salt Lake City, UT 84112\n\narXiv:astro-ph/0602327v1 15 Feb 2006\n\ne-mail:bromley@physics.utah.edu\nScott J. Kenyon\nSmithsonian Astrophysical Observatory, 60 Garden Street, Cambridge, MA 02138\ne-mail:\n\nskenyon@cfa.harvard.edu\nABSTRACT\n\nWe describe a hybrid algorithm to calculate the formation of planets from an initial\nensemble of planetesimals. The algorithm uses a coagulation code to treat the growth\nof planetesimals into oligarchs and explicit N -body calculations to follow the evolution\nof oligarchs into planets. To validate the N -body portion of the algorithm, we use\na battery of tests in planetary dynamics. Several complete calculations of terrestrial\nplanet formation with the hybrid code yield good agreement with previously published\ncalculations. These results demonstrate that the hybrid code provides an accurate\ntreatment of the evolution of planetesimals into planets.\nSubject headings: planetary systems – solar system: formation – stars: formation –\ncircumstellar matter\n\n1.\n\nINTRODUCTION\n\nRocky planet formation begins as gas and dust around a young star settle into a thin disk.\nThe emergence of planets within this disk is the result of three phases of evolution (Safronov 1969;\nWeidenschilling 1980; Hayashi 1981; Wetherill & Stewart 1993; Ida & Makino 1993; Kokubo &\nIda 1996). Initially, coagulation of dust particles causes a stochastic but steady growth in particle\nmass. The few largest bodies, or planetesimals, accumulate mass most quickly, and experience\na runaway growth phase. As the largest objects clear out the smaller ones, the planetesimal\ngrowth is oligarchic, where the largest objects – \"oligarchs\" – become isolated from their neighbors\nand grow roughly at the same rate. In a final phase of chaotic growth, mergers of oligarchs\nlead to the formation of a few terrestrial planets around Sun-like stars well within 100 Myr (e.g.,\nWeidenschilling et al. 1997; Chambers 2001; Kokubo & Ida 2002; Kokubo et al. 2006; Kominami\n& Ida 2002).\n\n\f–2–\nThis scenario is bolstered by recent observations. Most, if not all, young late-type stars have a\ndisk of gas and dust (Backman & Paresce 1993; Beckwith 1999; Lada 1999). At least some of these\ndisks will form large planets, similar to those detected in radial velocity studies (e.g., Marcy &\nButler 2000). The persistence of dusty disks around older stars suggests that smaller planets form\nas well. Dust should be ejected by radiation pressure, but on-going formation of rocky planets can\ndrive a collisional cascade which continually produces dust from a reservoir of small planetesimals\n(Kenyon & Bromley 2001, 2002a, 2002b). Stars with such debris disks include β Pic (Kalas et\nal. 2000; Wahhaj et al. 2003), ǫ Eri (Greaves et al. 1998), HR 4796A (Jayawardhana et al. 1998;\nKoerner et al. 1998) and Vega (e.g., Koerner, Sargent & Ostroff 2001).\nInterpretations of observed dusty debris disks, and our understanding of planet formation in\ngeneral, rely heavily on numerical calculations. Two types of tools, statistical solvers and N -body\ncodes, provide complementary information about planetary disk evolution. The effectiveness of\neach tool depends on N , the number of particles they can track. Statistical methods like Safronov's\n(1969) particle-in-cell formalism work well when the particles are numerous and have small mass\n(Kokubo & Ida 1996). Current N -body codes are unable to follow planetary growth in this\nregime. When the mass of individual objects gets large, binary interactions become important.\nOrbit evaluations then require direct N -body calculations, not the ensemble averages of particlein-cell approaches. Our experience with coagulation codes (Kenyon & Luu 1998, 1999; Kenyon\n& Bromley 2001, 2002b, 2003) suggests that we can accurately evolve objects with masses below\n1025 –1026 g using the statistical approach. However, an N -body code must track particles of heavier\nmass (see also Kokubo & Ida 1996, 2002).\nMassive planetesimals requiring direct N -body evolution are relatively rare in typical planet\nformation models. This situation is fortunate because N -body codes can not accurately track large\nnumbers of particles for long periods of time. Simulations performed by Chambers (2001) and\nsome runs reported here involve N ∼ O(100) particles integrated over 100 Myr. Ida, Kokubo &\nKominami (2003) ran larger simulations with N = 10, 000, but only for a ∼0.5 Myr time period\nand only with specialized hardware for gravitational force calculations.\nThe complementary limitations of N -body algorithms and coagulation codes call for an integration of both methods into a single \"hybrid code\" (Jewell & Alexander 1996; Weidenschilling et\nal. 1997) Here we describe an algorithm that includes both a statistical component and a direct N body part. Our goal is to run self-consistent simulations of planet formation, tracking objects from\nmicron-sized dust grains to Jupiter mass planets. The coagulation code, described briefly below in\n§2, accounts for gas, dust, and a swarm of lower mass planetesimals. Our N -body algorithm (§3),\nis invoked only when needed to evolve the largest planetesimals. In §4 we discuss the hybrid code\nitself, and focus on how the N -body and coagulation parts interact. We provide tests of this code\nin §5 and give preliminary results related to the problem of terrestrial planet formation.\n\n\f–3–\n2.\n\nTHE COAGULATION CODE\n\nThe coagulation part of our hybrid code tracks dust and planetesimals in multiple annuli around\nthe central star. Kenyon & Luu (1998, 1999) and Kenyon & Bromley (2001, 2002b, 2004a) describe\nthe algorithms and include a complete set of references. Here we briefly review this statistical\nalgorithm.\nThe physical processes which we simulate include coagulation, fragmentation, gas drag, PoyntingRobertson drag, and radiation pressure. We discretize the continuous distribution of particle masses\ninto mass batches, assigning an integral number of particles to each batch. To allow better resolution of the mass spectrum for particles evolving rapidly, adjacent batches differ in mass by a\nmass-dependent factor. We dynamically adjust the number of mass batches, as needed. Our spatial domain is cylindrical and is divided into a set of concentric annuli about the central star. The\nannuli may be set so that either they have equal width, or their boundaries are equally spaced in\nlog-radius.\nMasses and particle numbers evolve according to the coagulation equations which include the\neffects of collisions, Poynting-Robertson drag, and interaction with the gas disk. Our collisions rates\ncome from geometric cross sections of particles, augmented by a gravitational focusing factor for\nlarger planetesimals. Collision outcomes depend on the planetesimal tensile strength, gravitational\nbinding energy, and relative velocities. Depending on these parameters, collisions result in mergers,\nfragmentation, and dust production.\nWe follow particle velocities statistically for each mass batch in each annulus, tracking vertical\nand horizontal velocity dispersions relative to Keplerian orbits in the central plane of the disk.\nThese dispersions evolve under the influence of gas drag, Poynting-Robertson drag, viscous stirring\nand dynamical friction, according to a set of Fokker-Planck equations (Hornung, Pellat & Barge\n1985; Wetherill & Stewart 1993; Stewart & Ida 2000; Ohtsuki, Stewart, & Ida 2002).\nTo solve the coagulation and Fokker-Planck equations, we use a fourth-order Runge-Kutta\nmethod. The algorithm strictly conserves mass. When objects shift from one annulus to another,\nvelocity dispersions are updated to conserve kinetic energy explicitly. At the inner and outer\nboundaries of the spatial domain, the mass batches reflect a steady, radial flow in the debris\ndisk. The code does not enforce angular momentum conservation, nonetheless, in test runs of 106\ntimesteps, angular momentum is conserved to better than 1%.\nThe coagulation code evolves the swarm of O(1021 ) planetesimals accurately until the largest\nobjects reach roughly the mass of Pluto. Because these massive objects are rare, the statistical\nmodel provides a poor estimate of their behavior. Although the coagulation code can still follow\nthe evolution of the swarm, the orbits of the largest objects require explicit calculations using an\nN -body code, which we describe in the next section.\n\n\f–4–\n3.\n\nTHE N -BODY CODE\n\nPlanetary N -body codes must be fast and accurate. Suitable solvers for the equations of\nmotion are numerous, with published descriptions of symplectic integrators (Wisdom & Holman\n1991; Kinoshita, Yoshida & Nakai 1991; Saha & Tremaine 1992), and more general time-symmetric\nintegrators (e.g., Quinlan & Tremaine 1990, Hut, Makino & McMillan 1995). Some integrators\n(Vasilev 1982; Wisdom & Holman 1991; Ida & Makino 1992; Fukushima 1996; Shefer 2002) speed\nup the calculations by tracking only deviations from a purely Keplerian orbit about the central\nstar, following the proposal of Encke (1852). Other improvements include adaptive timestepping,\nallowing integrators to take large timesteps when forces are small, and to expend more computational resources only when particles experience strong forces (Aarseth 1985; McMillan & Aarseth\n1993; Skeel & Biesiadecki 1994; Kokubo, Yoshinaga & Makino 1997; Duncan, Levison & Lee 1998).\nOur algorithm is based on the Encke method. We work with non-inertial, Keplerian frames\nabout the central star and integrate the equations of motion in rectilinear coordinates defined\nrelative to the Keplerian frames. These coordinates have a fixed orientation, aligned with the\ninertial frame of the central star. We use an adaptive block timestepping scheme (e.g., McMillan &\nAarseth 1993) and a sixth- or eighth-order accurate integrator based on Richardson extrapolation.\nWe give details of the integrator below. For now we briefly outline the timestepping scheme.\nAt the beginning of a timestep, each particle's accelerated reference frame is initially set to\nits instantaneous Keplerian orbit. If particles are in tight groups, their reference frames can be set\nto the Keplerian orbit of their mutual center of mass. A friends-of-friends algorithm (Huchra &\nGeller 1982, Geller & Huchra 1983) finds any such groups with a linking parameter based on the\nHill radii of the particles. We then integrate the equations of motion in terms of spatial variables\nin the accelerated reference frames over a single timestep of length ∆t. Next we calculate higher\nresolution orbits by dividing the timestep into m equal substeps. In practice, m = 3 seems to\nwork best. A comparison between the lower and higher resolution orbits produces a check of\nintegrator convergence. We have implemented several criteria for convergence, but have found that\nan individual particle's total energy, taken as a fraction ǫ, of its Keplerian orbital energy, gives an\neffective comparison under most circumstances. If a particle's orbit has not converged, we simply\nrepeat the process at even higher time resolution.\nThe strategy of a block timestepping scheme is to track individual orbits and interpolate the\nconverged orbits if needed to evaluate forces on particles whose orbits have not converged. This\nprocedure reduces the computational load of force calculations if the number of particles is large\n(N ≫ 10). For a smaller number of particles we prefer to integrate all orbits until every orbit\nhas converged. Energy conservation is better in this case and there is no significant penalty in\ncomputational load.\nThe time integrator is an ordinary differential equation (ODE) solver based on Richardson\nextrapolation. We start with a low-resolution estimate of the particle orbits over a time interval\n∆t using a leapfrog intergrator. Specifically, the position ~x and velocity ~v of a particle at the end\n\n\f–5–\nof a time-forward step in the leapfrog case is\n~v (t + ∆t/2) = ~v (t) + ∆t/2~a(t)\n~x(t + ∆t)\n= ~x(t) + ∆t~v (t + ∆t/2)\n~v (t + ∆t)\n= ~v (t + ∆t/2) + ∆t/2~a(t + ∆t)\n\n(1)\n\nwhere ~a is the acceleration, which in our case depends only on position. We label the position at\nthe end of this single leapfrog timestep as ~x0 , and note that it contains errors of the order of ∆t3 .\nNext we divide the time interval into two equal parts and take two successive leapfrog steps to\nderive a better resolved orbital position, ~x1 . We can further subdivide the time interval to obtain\na position ~xi , derived from 2i successive leapfrog timesteps. Our final position at the end of the\ntime interval ∆t is a linear combination of these results,\n~x(t + ∆t) =\n\nm\nX\n\nci ~xi + O(∆t2m+1 ) .\n\n(2)\n\ni=0\n\nFourth-, sixth-, and eighth-order methods have m = 1, 2 and 3, respectively and coefficients\n(c0 , c1 ) = (4/3, −1/3)\n4th −order\n(c0 , c1 , c2 ) = (1/45, −4/9, 64/45)\n6th −order\n(c0 , c1 , c2 , c3 ) = (−1/2835, 4/135, −64/135, 4096/2835) 8th −order.\n\n(3)\n\nWe calculate the gravitational forces between particles directly. At the lowest resolution\ntimesteps, we perform the O(N 2 ) force evaluations. However, if we use the block timestepping\nscheme then only a few particles depend on O(N ) interparticle forces at high temporal resolution.\nTo simulate a larger number of bodies, we have an O(N log N ) Barnes & Hut (1986) treecode, as\ndescribed in Barton, Bromley & Geller (1999). Preliminary tests suggest that this code becomes\ncompetitive with a direct method only when N is greater than O(103 ). An alternative would be to\nuse specialized hardware (e.g., Hut & Makino 1999). Here, our particle numbers are small and we\nwork exclusively with the direct force solver.\nFor realistic planet formation models, an N -body algorithm must identify merger events. We\ncheck for mergers in a fast way, by assuming that any merger event which occurs during a single\ntimestep can involve only two particles. For each particle we save an index number corresponding\nto some other particle which came the closest during the force calculations. This indexing reduces\nthe number of calculations from O(N 2 ) to O(N ). For each pair of bodies, with indices i and j, we\ncheck the relative radial velocity using the quantity ~xij * ~vij , where the vectors are relative position\nand velocity respectively. If the relative radial velocity is positive at the beginning of a timestep,\nthen we assume no merger takes place. Otherwise, we find the minimum separation of the pair\nduring the timestep, interpolating if necessary. Once we have the minimum pair separation sij and\nrelative speed vij , a merger event is identified if\n\u0015\n\u0014\n1\n(vE,i Ri + vE,j Rj )\n(4)\nsij ≤ min Ri + Rj ,\nvij\n\n\f–6–\nwhere vE,i is the escape velocity at distance sij from the ith particle, and Ri is the particle's\nphysical radius. Thus the merger cross-section is at least the physical cross-section, and is larger if\nthe relative velocity is small compared to the escape velocity of either particle.\n\n4.\n\nTHE HYBRID CODE\n\nWith our coagulation code and N -body algorithm, we track both the numerous low-mass\nplanetesimals and the relatively rare high-mass bodies in a planetary disk. The interactions between\nthese two populations generally cause the larger bodies to circularize in their orbits, while the\nsmaller bodies tend to get gravitationally stirred, as reflected in an overall increase in eccentricity\nand inclination. Here we describe how the coagulation and N -body components work together to\nsimulate these effects.\nThe multiannulus coagulation code evolves all low-mass bodies. The model grid contains\nN concentric annuli with widths δaj centered at heliocentric distances aj . Each annulus contains\nn(mjl , t) objects of mass mjl with orbital eccentricity ejl (t) and inclination ijl (t) in M mass batches.\nWhen an object in the coagulation code reaches a preset mass, it is 'promoted' into the N -body\ncode. To set the initial orbit for this object, we use the three coagulation coordinates, a, e,\nand i, and select random values for the longitude of periastron and the argument of perihelion.\nBecause the annuli have finite width δaj , we set the semimajor axis of the promoted object to ap =\naj + (0.5 − x)δaj , where x is a random number between 0 and 1. When two or more objects within\nan annulus are promoted to the N -body code during the same timestep, we restrict the choices of\nthe orbital elements to minimize orbital interactions between the newly promoted N -bodies.\nThe coagulation code also determines the simulation timestep. This interval, ∆T , is generally\nlarger than the lowest resolution timestep of the N -body code, so we take multiple low-resolution\nsubsteps, ∆t, within that interval. The length of a substep is set by the orbital speed of the fastest\nmoving body; for nearly circular orbits this limit is roughly 1/60th of the orbital period.\nTo calculate the effects of the swarm of low-mass bodies on the N -bodies, we use particle-ina-box estimates. For an N-body with index j, mass mj , eccentricity ej , inclination ij , horizontal\nvelocity hj , and vertical velocity vj , we derive the time-evolution of the orbital eccentricity and\ninclination from the Fokker-Planck formulae for the derivatives of the horizontal and vertical velocities:\ndh2vs,j,high\ndt\n2\ndvvs,j,high\n\ndt\n\n=\n\nN X\nM\nX\n\nfjk C (h2j + h2km ) mkm Je (βkm )\n\n(5)\n\nN X\nM\nX\n\n2\n) mkm Jz (βkm )\nfjk C (vj2 + vkm\n\n(6)\n\nk=1 m=1\n\n=\n\nk=1 m=1\n\n\f–7–\nfor viscous stirring in the high velocity limit and\ndh2df,j,high\ndt\n2\ndvdf,j,high\n\ndt\n\n=\n\nM\nN X\nX\n\n1.4fjk C (mkm h2km − mj h2j ) He (βkm )\n\n(7)\n\nk=N\nM\nX X\n\n2\n1.4fjk C (mkm vkm\n− mj vj2 ) Hz (βkm )\n\n(8)\n\nk=1 m=1\n\n=\n\nk=1 m=1\n\n2 = (i2 + i2 )/(e2 + e2 ),\nfor dynamical friction in the high velocity limit. In these expressions, βkm\nj\nj\nkm\nkm\nC = 0.2767 AΛ G2 ρm /(h2j + h2km )3/2 , and the functions He , Hz , Je , and Jz are definite integrals\n(Stewart & Ida 2000; Ohtsuki, Stewart, & Ida 2002). The subscript k is the annular index while\nsubscript m is the index of a mass batch. The overlap fraction fjk is the fraction of bodies in\nannulus k that approach within 2.4 RH of the N -body. We set ρm = Mm /Vm , where Mm is the\ntotal mass of bodies with mm in annulus l and Vl is the volume of annulus l. Following Stewart &\nIda (2000), we also set AΛ = ln(Λ2 + 1), where\n\n3\n,\nΛ = 0.1886 (h + 1.25v) v/vH,jk\n\n(9)\n\n3\n2 , v\nwith h2 = h2j + h2km , v 2 = vj2 + vkm\nH,jk = rH,jk vK,jk , rH,jk = (mj + mkm )/M⊙ , and vK,jk =\n0.5(vK,j + vK,k ); the subscript K denotes a Keplerian velocity (see also Kenyon & Bromley 2002b;\nOhtsuki, Stewart, & Ida 2002).\n\nWhen the relative velocities of particles approach the Hill velocity, vH,jk , we set\n\nC1 =\n\nln(10Λ2 /he2 i + 1)\n,\n10Λ2 /he2 i\n\n(10)\n\nC2 =\n\nln(10Λ2 he2 i1/2 + 1)\n10Λ2 he2 i1/2\n\n(11)\n\nln(10Λ2 + 1)\n10Λ2\n\n(12)\n\nC3 =\nand use\ndh2vs,j,low\ndt\n2\ndvvs,j,low\n\ndt\n\n=\n\nk=N\nX\nX l=M\nk=1 l=1\n\nk=N\nX\nX l=M\n\n4\n73fjk C1 rH,jk\n\n(13)\n\n4\nfjk C2 (4hi2 i + 0.2he2 i3/2 hi2 i1/2 )rH,jk\n\n(14)\n\n=\n\nk=1 l=1\n\n\f–8–\nfor viscous stirring in the low velocity limit and\ndh2df,j,low\ndt\n\n=\n\nk=N\nX\nX l=M\n\n4\n/h\n10fjk C3 he2 irH,jk\n\n(15)\n\nk=N\nX\nX l=M\n\n4\n/h\n10fjk C3 hi2 irH,jk\n\n(16)\n\nk=1 l=1\n\n2\ndvvs,j,low\n\ndt\n\n=\n\nk=1 l=1\n\nfor dynamical friction in the low velocity limit (Ohtsuki, Stewart, & Ida 2002). In these expressions,\n3\nC4 = 0.3125ρm Hkl (aj + ak )VK,jk\n/(Mj + Mkm )2 , Hjk is the mutual scale height, he2 i = (e2j +\n2\n2\n. The combined velocity stirring is then\n, and hi2 i = (i2j + i2km )/rH,jk\ne2km )/rH,jk\ndh2vs,j,high dh2vs,j,low\ndh2vs,j\n=\n+\ndt\ndt\ndt\n\n(17)\n\n2\n2\n2\ndvvs,j,high\ndvvs,j,low\ndvvs,j\n=\n+\ndt\ndt\ndt\n\n(18)\n\nfor viscous stirring and\ndh2df,j\ndt\n2\ndvdf,j\n\ndt\n\n=\n\n=\n\ndh2df,j,high\ndt\n2\ndvdf,j,high\n\ndt\n\n+\n\n+\n\ndh2df,j,low\ndt\n2\ndvdf,j,low\n\ndt\n\n(19)\n\n(20)\n\nfor dynamical friction.\nTo calculate the accretion rate of planetesimals onto the N -bodies, we use the standard coagulation equation:\nk=N\nX l=M\nX\ndmj\n=\nAjkmfjk nkm mkm\ndt\n\n(21)\n\nk=1 l=1\n\nwhere Ajmk is the normalized cross-section (see Kenyon & Luu 1999).\nTo calculate the stirring of planetesimals by N -bodies, we calculate the appropriate FokkerPlanck terms for viscous stirring and dynamical friction and add these results to the long distance\nstirring of Weidenschilling (1989)\n\n\f–9–\n\ndh2lr,km\ndt\n\n=\n\nj=N\nXn\nj=1\n\nG2 m2j ∆a\n2 )2\nVK,jk (δa2 + 0.5Hjk\n\n,\n\n(22)\n\nwhere Nn is the number of N -bodies and ∆a = aj − ak .\nAt the end of each coagulation timestep, we pass the stirring and accretion rates for each\nN -body – dej /dt, dij /dt, and dmj /dt – to the N -body code. At the end of every low resolution\ntimestep in the N -body code, we modify each particle's orbit and mass to reflect these changes.\nWhen possible, we simply redirect the velocity vector so that the eccentricity varies independently\nof inclination and semimajor axis. The N -body functions return an updated particle list to the\ncoagulation code. New orbital positions and masses of the large objects are then reinserted into\nthe coagulation grid. The coagulation calculations proceed in the standard fashion, except that the\norbital velocities of the large-mass objects in the grid are not evolved. With a complete circuit from\nthe coagulation code to the N -body code to the coagulation code, N -bodies influence the evolution\nof the swarm and the swarm influences the evolution of the N -bodies.\n\n5.\n\nTESTS\n\nWe have published elsewhere results on the performance of the coagulation code, as described\nin §2. However, the N -body and hybrid codes are new, and our purpose here is to validate them.\nIn this section we first test the N -body code for stability, dynamic range, accuracy, and merger\nresolution, mostly following Duncan, Levison & Lee (1998) in the validation of their SyMBA algorithm. We then test the hybrid code against several simulations of terrestrial planet formation at\n1 AU (Weidenschilling et al. 1997; Chambers 2001).\nThe following subsections are organized according to the type of calculation. We test stability\nduring long term orbit integrations of the major planets and a \"scaled outer solar system\" where\nthe masses of the major planets are increased by a factor of 50 (Duncan, Levison & Lee 1998).\nThen we test dynamic range with two binary planet configurations. The code's accuracy is also\nestablished with a test to resolve a critical orbital separation between two planetesimals which\ndetermines whether their orbits will cross. In considering mergers, we reproduce the Greenzweig\n& Lissauer (1990) results for planetary accretion rates. We also derive the integration accuracy\nrequired to track the collision between a massive object and a small projectile on opposing circular\norbits at 1 AU. Finally, we simulate terrestrial planet formation, following Weidenschilling et al.\n(1997), who consider the evolution of km-sized planetesimals, and Chambers (2001), who models\nthe collisional evolution of lunar mass bodies.\n\n\f– 10 –\nLong-term Orbit Integration\nTo evaluate the stability of our adaptive integrator, we evolve the four major planets in orbit\nabout a stationary Sun. Figure 1 shows the behavior of the outer planets' eccentricities over a\n10 Myr period. We use two different integrators, a sixth-order accurate symplectic integrator\n(Yoshida 1990) and our adaptive code, also with a sixth-order accurate ODE solver for comparison.\nWe run both codes at low and high resolution. The run times of the two codes are comparable\nat each resolution. As illustrated in the figure, the low resolution adaptive code obtains a better\nmeasure of eccentricity than its symplectic counterpart. One reason is that the adaptive code is\nnot subject to accumulation of phase errors as in a symplectic algorithm. On the other hand, the\nadaptive code produces a secular drift in energy over the course of the simulation, whereas the\nsymplectic code does not. The fractional error in total energy at 10 Myr is 10−3 and 10−5 for the\nlow and high resolution adaptive code, respectively.\n\nScaled Outer Solar System\nIf the masses of each of the four major planets increase by a factor of 50, the outer solar system\nis unstable (see, for example, Duncan & Lissauer 1998). To verify that our code yields the correct\ntimescale for this instability, we made tests similar to one performed by Duncan, Levison & Lee\n(1998). As expected, the semimajor axis of Jupiter's orbit shrinks by a modest fraction of the\noriginal semimajor axis, while Saturn is ejected on a timescale of 1,000 years. As Saturn leaves the\nSolar System, its orbit crosses and excites the orbits of Uranus and Neptune. An increase in the\norbital eccentricity of Uranus or Neptune leads to a second ejection, as seen in Figure 2.\n\nBinaries\nDuncan, Levison & Lee (1998) note that bound binary planets whose center of mass revolves\naround a star provide a strong test of the ability of an N -body integrator to handle a wide range of\ndynamical timescales. They set up a pair of Jupiter-mass planets with a center of mass on a circular\norbit at 1 AU. The planets orbit each other with an initial binary semimajor axis of 0.0125 AU and\nbinary eccentricity of 0.6. Their simulation time was 100 yr, covering about 3,200 binary orbits.\nWe reproduce the Duncan, Levison & Lee (1998) test. We can limit total energy errors to\nwithin a part in 10 million, while keeping the wall time well below a minute on a 1.7 GHz AMD\nAthlon processor. Figure 3 illustrates changes in the binary semimajor axis.\nThe figure also demonstrates a test of our block timestepper. If a small particle is in a tightly\nbound orbit around a much more massive object, then the position of the massive particle is\ninterpolated in the force calculations for the small body. Our test simulates the orbit of a massless\n\"spy satellite\" on a polar orbit about the Earth. Figure 3 shows that the distance of the satellite\n\n\f– 11 –\nfrom the center of the Earth varies by about 100 meters during an orbit. There is no significant\ndrift in its mean altitude over the course of 100 years, corresponding to roughly 600,000 satellite\norbits of the Earth.\n\nPlanetesimals\nWe next test the ability of the N -body code to handle the evolution of planetesimals. First,\nwe consider an isolated pair of planetesimals, with masses of 2 × 1026 g. These bodies start on\ncorotating, circular orbits near 1 AU. We specify their orbital separation in terms of their mutual\n√\nHill radius, RH = [(m1 + m2 )/3M⊙ ]1/3 . There is a critical separation, ∆acrit = 2 3RH , which\ndetermines the onset of chaotic behavior: If the planetesimals' initial orbital separation is smaller\nthan ∆acrit , their orbits will cross, otherwise they will simply scatter to larger orbital separations.\nFigure 4 shows the evolution of semimajor axes in cases where orbital separations are initially\nsmaller than ∆acrit (top panel) and greater than ∆acrit (middle panel). As expected, the more\nclosely-spaced pair experiences several orbit crossings while the more distant pair does not. Multiple\ncalculations demonstrate that our code can resolve the critical separation ∆acrit to within a few\npercent.\nFigure 4 also shows results for eight planetesimals, each with the same mass as in the preceding\ncase, and initially on circular, Keplerian orbits. The separation between nearest neighbors is\n1.05∆acrit . The orbit crossings proceed from larger radius inward, as illustrated anecdotally in the\nfigure (see also Weidenschilling et al. 1997; Kenyon & Bromley 2001).\nNext we use the N -body code to model gravitational stirring by two 2 × 1026 g objects in a\nuniform disk of 805 lower mass, 2 × 1024 g objects (Kokubo & Ida 1995; Weidenschilling et al. 1997;\nKenyon & Bromley 2001). The disk is centered at 1 AU, and is 35 RH in annular extent, where RH\nis the mutual Hill radius between large and small objects. To speed up the code's convergence with\nthis relatively large number of particles, we soften the interaction potential on a scale comparable\nto the physical radius of the large bodies, assuming their density is 1 g cm−3 .\nFigure 5 illustrates the evolution of the radial profile of (e2 + i2 )1/2 for the case where the two\nmassive bodies are separated by 10RH , and are each at an orbital distance of 5RH away from 1 AU.\nThe initial eccentricity and inclinations are zero for the two massive objects, and small (i ∼ 10−5 ,\ne ∼ 10−7 ) for the planetesimals. The N -body results here compare well with those from the pure\ncoagulation code (Kenyon & Bromley 2001), except that the N -body calculations produce more\nstructure in the profile, particularly an enchanced scattering of the swarm away from the more\nmassive bodies. This difference, a broadening of the profile as compared to the coagulation results,\nis expected from previous N -body calculations (Kokubo & Ida 1995).\n\n\f– 12 –\nMergers\nOne test of our merger algorithm is provided by Greenzweig & Lissauer (1990), who studied\ngravitational focusing by a single planet in a field of test particles, all orbiting a 1 M⊙ star. We\nconsider one of their configurations, a 10−6 M⊙ planet on a circular orbit at 1 AU and a set of\ntest particles on orbits with eccentricity e = 0.007, inclination i = 0.2 degrees, and semimajor axes\ndistributed in two rings between 0.977 AU and 1.023 AU. We evolve the system through a single\nclose encounter between the planet and each test particle, to determine the fraction of test particles\naccreted by the planet.\nWhen the planet has a physical radius of 105 km, Greenzweig & Lissauer (1990) report an\naccretion fraction facc = 0.140. In their validation of the SyMBA code, Duncan, Levison & Lee\n(1998) estimate facc = 0.10 ± 0.02. For a planetary radius of 5,200 km, the derived accretion\nfractions are facc = 0.009 (Greenzweig & Lissauer 1990) and facc = 0.008 ± 0.002 (Duncan, Levison\n& Lee 1998). Using the merger criterion specified in §3 (eq. [4]), our results are facc = 0.138 ± 0.002\n(Poisson errors with 50,000 test particles) for the 105 km radius planet and facc = 0.008 ± 0.001 for\nthe 5,200 km radius planet.\nA more extreme test of the merger algorithm is to simulate the high-speed collision between\ntwo counterrotating objects. We consider a small (cm-size) projectile and a larger target of some\nspecified radius, r, both with a density of 1 g/cm3 . The two bodies initially are at 1 AU on opposite\nsides of the Sun and are on colliding circular orbits. The code calculates trajectories with a fixed\nnumber of timesteps over a time interval which is randomly distributed at values just greater than\n0.25 yr. We run repeated trials and find the minimum number of low-resolution timesteps, nt95 ,\nrequired to achieve a 95% success rate in detecting collisions.\nFigure 6 illustrates our results. For targets with r < 1, 000 km, nt95 is determined by the errors\nin the interpolation of position between the endpoints of each timestep, and scales approximately as\nnt95 ∼ r −1/3 . In our planet formation simulations reported here, we typically take O(100) timesteps\nper orbit and therefore can expect to resolve high-speed collisions between 1,000 km objects. If\ngravitational interactions between target and projectile become important, as in cases with large\nbodies and slow impact speeds, then the adaptive integrator takes high-resolution timesteps, increasing the accuracy of the merger algorithm. This effect is illustrated in Figure 6, which shows\na dramatic decrease in nt95 for targets of size 100 km or larger, depending on the adaptive code's\nerror tolerance. In practice, our N -bodies typically have radii greater than 1,000 km and have impact speeds which are more than an order of magnitude smaller than in a counterrotating collision.\nThus, our code should accurately resolve mergers in planet formation simulations. Next, we test\nthis assertion explicitly.\n\n\f– 13 –\nTerrestrial Planet Formation\nTo illustrate the behavior of the hybrid code for less idealized conditions, we consider calculations of terrestrial planet formation at 1 AU. We compare our results with two sets of published\ncalculations. Spaute et al. (1991) and Weidenschilling et al. (1997) use a multi-annulus code which\nevolves the masses and orbital properties of planetesimals with a coagulation code and follows the\nevolution of discrete planetary embryos with a Monte Carlo algorithm. As in our calculations, their\ncode allows interactions between the planetesimals and the embryos. They evolve planetesimals\nfor 1 Myr in two configurations, 0.86–1.14 AU and 0.5–1.5 AU. Here, we use a grid at 0.84–1.16\nAU and compare the Weidenschilling et al. (1997) results with our calculations from the pure\ncoagulation code and from the hybrid code.\nChambers (2001) uses a three-dimensional N -body code to consider the final phase of terrestrial planet formation at 0.4–2 AU. These calculations begin with 150–160 lunar-mass to Mars-mass\nembryos and follow the collisional evolution for 200–500 Myr. Here, we adopt a grid at 0.4–2 AU\nand compare the outcomes of two pure N -body calculations and many hybrid calculations with the\nChambers (2001) results.\nWe begin with results for a = 0.84–1.16 AU. In these calculations, the grid has 32 radial zones\neach containing an initial distribution of planetesimals with radii of 1–4 km. The planetesimals\nhave initial surface density Σ = 16(a/1 AU)−3/2 g cm−2 , eccentricity e0 = 10−4 , and inclination i0\n= 6 × 10−5 . The calculations include gas drag but do not allow fragmentation.\nThe initial stages of pure coagulation and hybrid calculations are identical. In a few thousand\nyears, objects grow to radii of 10–20 km. After ∼ 104 yr, objects reach sizes of 100–300 km. Because\nthe timescales for dynamical friction and viscous stirring are shorter than the growth timescales,\nthe largest objects have nearly circular orbits while the smallest objects have eccentric orbits.\nRunaway growth then yields a handful of 1000-3000 km objects. As runaway growth proceeds,\nviscous stirring continues to heat up the orbits of the smallest objects faster than the smallest\nobjects damp the velocities of the largest objects. Thus, gravitational focusing factors decrease,\naccretion slows, and runaway growth ends. The evolution then enters a period of 'oligarchic growth,'\nwhere all of the largest objects grow at roughly the same rate (Kokubo & Ida 1996,1998,2002).\nDuring oligarchic growth, the growth of the largest objects in the hybrid calculations differs\nfrom the path followed in the pure coagulation models. In the hybrid models, oligarchs grow slowly\nuntil their orbits begin to cross (Kokubo & Ida 2002; Kominami & Ida 2002; Kenyon & Bromley\n2006). Once orbits cross, chaotic growth leads to a rapid merger rate and the formation of several\n'super-oligarchs' that accrete most of the leftover planetesimals. The super-oligarchs accrete some\nof the remaining lower mass oligarchs and scatter the rest out of the grid (Kenyon & Bromley\n2006).\nIn pure coagulation models, the orbits of oligarchs are not allowed to cross. These oligarchs\nslowly accrete all of the planetesimals within their gravitational reach. Oligarchs rarely accrete\n\n\f– 14 –\nother oligarchs. After 10–100 Myr, pure coagulation models have more lower mass oligarchs than\nthe hybrid models. However, the largest oligarchs are less massive than their counterparts in the\nhybrid calculations.\nFigures 7 and 8 compare some results from two calculations at specific times. Figure 8 of\nWeidenschilling et al. (1997) shows results for a similar calculation. In every case, the mass of the\nlargest object is ∼ 5 − 6 × 1024 g at 104 yr, ∼ 3 − 4 × 1026 g at 105 yr, and ∼ 1027 g at 106 yr.\nAt early times, e and i decline monotonically with increasing mass. At later times, e and i have\nbimodal distributions: objects with m . 1024 g have large e and i, while more massive objects have\nmuch smaller e and i. The orbital anisotropy, i/e, follows a similar evolution, with i/e ∼ 0.4 at\nearly times and i/e ∼ 0.1–0.15 at late times. Near the end of the calculations, the largest objects\nlie in a flattened disk, with i/e ≈ 0.02-0.03 (see also Weidenschilling et al. 1997).\nFigure 9 illustrates the evolution of the eccentricity in more detail. At 104 yr, dynamical\nfriction maintains low e for the largest bodies. Because planets form fastest at the inner edge of\nthe grid, small objects at the inner edge have larger e than small objects at the outer outer edge.\nAt 105 yr, dynamical friction still maintains low e for the largest bodies. Because most of the small\nobjects have grown to 100 km radius, these objects have slightly smaller e than other objects with\nm < 1024 g. At 106 yr, objects with m > 1026 g have low e ∼ 0.02, while lower mass objects have\nhigher e ∼ 0.1. These results compare favorably with Figure 9 of Weidenschilling et al. (1997).\nWe begin our version of the Chambers (2001) calculations in a grid of 40 annuli at a = 0.4–2\nAU. For the hybrid calculations, the annuli contain an initial distribution of planetesimals with radii\nof 4–15 km. The pure N -body model starts with 160 'moons' with a mass of 1026 g. In both cases,\nthe objects have e0 = 10−4 and i0 = 6 × 10−5 . To provide some contrast with previous calculations,\nwe adopt an initial surface density of planetesimals or moons, Σ = xΣ0 (a/1 AU)−1 with Σ0 = 8 g\ncm−2 and x = 0.25–2, instead of the usual Σ ∝ a−3/2 . Although the final configuration of planets\ndepends on the initial surface density gradient, the general evolution is fairly independent of Σ.\nThe large radial extent of these calculations allows us to illustrate the sensitivity of planet\nformation to the heliocentric distance. Because the timescale for growth by coagulation is t ∝\nΣ/P ∝ a5/2 , planets grow fastest at the inner edge of the grid (Lissauer 1987). In hybrid models\nwith x = 1, objects with radii of ∼ 200 km form in ∼ 103 yr at 0.4 AU, in ∼ 104 yr at 0.95 AU,\nand in ∼ 105 yr at 2 AU. Oligarchs with masses of ∼ 1026 g form on a timescale\nto ≈ 1.5 × 105 x−1 (a/1 AU)5/2 .\n\n(23)\n\nOnce large objects start to form, the transition from runaway to oligarchic to chaotic growth\nproceeds in several waves propagating from the inner disk to the outer disk (Kenyon & Bromley\n2006). As oligarchs start to form at the outer edge of the grid, dynamical interactions between\noligarchs begin at the inner edge. Several orbit crossings lead to dynamical interactions between\nall oligarchs and a rapid increase in the merger rate. A few large oligarchs gradually accrete many\nof the smaller oligarchs, leading to a configuration with several Earth-mass planets and a few\n\n\f– 15 –\nMars-mass 'leftovers.'\nIn the moons calculations, dynamical interactions between the 160 original oligarchs dominate\nthe entire evolutionary sequence. In the first ∼ 104 yr, five mergers start to produce large oligarchs\nin the inner disk. The number of oligarchs declines to 146 in 105 yr, to 115 in 1 Myr, and to 55 in\n10 Myr. By 10 Myr, the largest objects in the inner disk reach masses of 0.2–0.3 M⊕ and slowly\naccrete the remaining moons. In the outer disk, the smaller surface density and viscous stirring\nlead to a smaller merger rate. After ∼ 100 Myr, only ∼ 20 oligarchs remain in the outer disk.\nTo compare our results with Chambers (2001), we consider measures of the orbital elements\nof final 'solar systems' from several simulations. In our direct N -body and hybrid calculations, the\ntime variation of the mass-weighted eccentricity ē (Fig. 10) follows a standard pattern (see Fig. 5 of\n(Chambers 2001)). During runaway and oligarchic growth, protoplanets stir their surroundings and\nē increases. At 10-100 Myr, the orbits of oligarchs cross, which further excites orbital eccentricity\nand produces sharp peaks in ē. Mergers between oligarchs reduce ē. Once a few remaining planets\nhave fairly stable orbits, ē settles to 0.05–0.15.\nHybrid models yield larger variations in ē than N -body calculations of large objects. Because\nobjects grow to the promotion mass throughout a hybrid calculation, the merger phase lasts longer\nand produces more frequent resonant interactions at later times compared to pure N -body models.\nThus, we often observe several peaks in the evolution of ē for hybrid models compared to a single\npeak in pure N -body calculations.\nFigure 11 shows the relation between the eccentricity and mass of the planets produced in our\ncalculations. Our models yield a range in mass from ∼ 0.01 M⊕ to ∼ 2–3 M⊕ . For ∼ 30 planets\nwith masses, m & 0.1 M⊕ , the orbital eccentricity is not correlated with the mass. Chambers\n(2001) derived a similar result for ∼ 50 planets. However, our calculations yield a reasonably large\nensemble of lower mass planets with m ∼ 0.01-0.1 M⊕ . In the full ensemble of planets with m ∼\n0.01–3 M⊕ , there is a small, but significant trend of decreasing eccentricity with increasing planet\nmass. From the Spearman rank and Kendall's τ tests (Press et al. 1992), the probability that the\nderived distribution of m(e) is random is ∼ 2 × 10−3 .\nTo compare this result to our Solar System, we restrict the mass range to 0.05–2 M⊕ . For our\nensemble of ∼ 40 planets, the Spearman rank and Kendall's τ probabilities are ∼ 0.1. These tests\nyield probabilities of ∼ 0.15–0.2 for the 4 terrestrial planets in our Solar System. We conclude that\nthe weak correlation of e with m is consistent with architecture of our Solar System.\nAs a final comparison with Chambers (2001), we calculate several statistical parameters to\ncharacterize the final configurations of our models. For a system with N oligarchs,\nSm = ml /mt\n\n(24)\n\nmeasures the fraction of the mass in the largest object, where ml is the mass of the largest oligarch\n\n\f– 16 –\nand mt is the total mass in the grid. The orbital spacing statistic is\n6\nSs =\nN −1\n\n\u0012\n\namax − amin\namax + amin\n\n\u0013\u0012\n\n3mc\n2m̄\n\n\u00131/4\n\n,\n\n(25)\n\nwhere m̄ is the average mass of an oligarch, mc is the mass of the central star, amin is the minimum\nsemimajor axis of an oligarch, and amax is the maximum semimajor axis of an oligarch. To measure\nthe degree of orbital excitation of a planet, Laskar (1997) describes the angular momentum deficit,\nthe difference between the z-component of the angular momentum of an orbit and a circular orbit\nwith the same semimajor axis. Chambers (2001) generalizes this definition as the sum over all\nplanets,\nq\nPN\n√\nm\na\n[1\n−\n(1 − e2j )cosij ]\nj\nj=1 j\n.\n(26)\nSd =\nPN\n√\naj\nj=1 mj\nFinally, the mass concentration statistic\n\nSc = max\n\nPN\n\nj=1 mj\n\nPN\n\n2\nj=1 mj [log(a/aj ) ]\n\n!\n\n(27)\n\nmeasures whether mass is concentrated in a few massive objects (large Sc ; as in the Earth and\nVenus) or many low mass objects (small Sc ; as in the Kuiper belt and scattered disk of the outer\nsolar system).\nTable 1 compares results for our 14 hybrid calculations and our two 'moons' calculations with\nstatistics for the inner Solar System. For calculations with x = 1, our moons calculations yield\nroughly the same outcome as Chambers (2001). The mass of the largest object and the statistics\nagree well with those in Table 1 of Chambers (2001). Because we began with a shallower surface\ndensity gradient, our planetary systems have more massive objects and more oligarchs at larger\nheliocentric distances than Chambers (2001).\nOur hybrid models for x = 1 yield results similar to the moons calculations. Our most massive\nobject has a mass of 1.1–1.8 M⊕ and contains 40% to 80% of the initial mass in the grid. The\ncalculations typically produce 1–2 other massive objects comparable in mass to Venus and several\nless massive objects with masses more similar to Mars. For models with longer evolution times,\nthe number of Mars-mass objects declines considerably from 100 Myr to 500 Myr. The statistical\nparameters agree well with the Chambers (2001) results. The planets in all of our model solar\nsystems have more eccentric orbits than the planets in the Solar System. However, the other\nstatistics agree rather well with those in the Solar System, including one model that is more\nconcentrated than the Solar System.\nThe outcomes of our calculations are sensitive to the initial mass in the grid. Models with x\n= 0.25 produce very low mass planets, ∼ 0.1 M⊕ , compared to models with x = 1–2, ∼ 1–2 M⊕ .\nThe lower mass models also yield more planets on more circular orbits and have a smaller fraction\nof the total mass in the largest object.\n\n\f– 17 –\n6.\n\nCONCLUSION\n\nIn this paper we describe a hybrid N -body coagulation code for planet formation. We put the\nN -body part through a battery of tests to assess its performance in planetary dynamics simulations.\nValidation tests of the coagulation algorithm appear elsewhere (e.g., Kenyon & Bromley 2001). We\nprovide tests of the hybrid method by comparing it to coagulation simulations and N -body output\nseparately. We demonstrate that all three methods quantitatively reproduce published results for\nthe formation of rocky planets by mergers of O(1012 ) km-sized (Weidenschilling et al. 1997) or\nO(100) moon-sized (Chambers 2001) planetesimals. Table 2 gives a summary of these tests, with\nreferences to other published work.\nAlthough our intent here is simply to describe our method, the hybrid code now has the\npotential to match observations of the Solar System and debris disks (e.g. Kenyon & Bromley\n2004a,b). In addition to results on terrestrial planets in §5, Kenyon & Bromley (2006) summarizes\nresults on the transition from oligarchic to chaotic growth in the terrestrial zone. Kenyon &\nBromley (2004c) shows how a stellar encounter can produce Sedna-like orbits in the outer Solar\nSystem and outlines how observations might distinguish between locally-produced and captured\nSednas. Future papers will describe more complete results on planet formation in the terrestrial\nzone and the trans-Neptunian region.\nWe acknowledge a generous allotment, ∼ 20 cpu years, of computer time on the Silicon Graphics\nOrigin-2000 'Alhena' through funding from the NASA Offices of Mission to Planet Earth, Aeronautics, and Space Science. Advice and comments from M. Geller are greatly appreciated! The\nNASA Astrophysics Theory Program supported part of this project through grant NAG5-13278.\n\n\f– 18 –\nREFERENCES\nAarseth, S. J. 1985, IAU Symp. 113: Dynamics of Star Clusters, 113, 251\nBackman, D. E., & Paresce, F. 1993, in Protostars and Planets III, eds. E. H. Levy & J. I. Lunine,\nTucson, Univ of Arizona, p. 1253\nBarnes, J. & Hut, P. 1986, Nature, 324, 446\nBarton, E. J., Bromley, B. C., & Geller, M. J. 1999, ApJ, 511, L25\nBeckwith, S. V. W. 1999, in The Physics of Star Formation and Early Stellar Evolution, ed. by C.\nJ. Lada & N. Kylafis (Dordrecht, Kluwer), p. 579\nChambers, J. E. 2001, Icarus, 152, 205\nDuncan, M. J. & Lissauer, J. J. 1998, Icarus, 134, 303\nDuncan, M. J., Levison, H. F., & Lee, M. H. 1998, AJ, 116, 2067\nEncke, M. 1852, MNRAS, 13, 2\nFukushima, T. 1996, AJ, 112, 1263\nGeller, M. J. & Huchra, J. P. 1983, ApJS, 52, 61\nGreaves, J. S. et al. 1998, ApJ, 506, L133\nHayashi, C. 1981, Prog Theor Phys Suppl, 70, 35\nHornung, P., Pellat, R., & Barge, P. 1985, Icarus, 64, 295\nHuchra, J. P. & Geller, M. J. 1982, ApJ, 257, 423\nHut, P. & Makino, J. 1999, Science, 283, 501\nHut, P., Makino, J., & McMillan, S. 1995, ApJ, 443, L93\nIda, S., & Makino, J. 1992, Icarus, 96, 107\nIda, S., & Makino, J. 1993, Icarus, 106, 210\nJayawardhana, R. et al. 1998, ApJ, 503, L79\nJewell, G. M. & Alexander, S. G. 1996, BAAS, 28, 1107\nKalas, P., Larwood, J., Smith, B. A., & Schultz, A. 2000, ApJ, 530, L133\nKenyon, S. J., & Bromley, B. C. 2001, AJ, 121, 538\n\n\f– 19 –\nKenyon, S. J. & Bromley, B. C. 2002, ApJ, 577, L35\nKenyon, S. J., & Bromley, B. C. 2002, AJ, 123, 1757\nKenyon, S. J., & Bromley, B. C. 2004, AJ, 127, 513\nKenyon, S. J., & Bromley, B. C. 2004b, ApJ, 602, L133\nKenyon, S. J., & Bromley, B. C. 2004c, Nature, 432, 598\nKenyon, S. J., & Bromley, B. C. 2006, AJ, 131, No. 3\nKenyon, S. J., & Luu, J. X. 1998, AJ, 115, 2136\nKenyon, S. J., & Luu, J. X. 1999, AJ, 118, 1101\nKinoshita, H., Yoshida, H., & Nakai, H. 1991, Celestial Mechanics and Dynamical Astronomy, 50,\n59\nKoerner, D. W., Ressler, M. E., Werner, M. W., & Backman, D. E. 1998, ApJ, 503, L83\nKoerner, D. W., Sargent, A. I., & Ostroff, N. A. 2001, ApJ, 560, L181\nKokubo, E. & Ida, S. 1995, Icarus, 114, 247\nKokubo, E., & Ida, S. 1996, Icarus, 123, 180\nKokubo, E., & Ida, S. 1998, Icarus, 131, 171\nKokubo, E., & Ida, S. 2000, Icarus, 143, 15\nKokubo, E., & Ida, S. 2002, ApJ, 581, 666\nKokubo, E., Kominami, J., & Ida, S. 2006, ApJ, in press\nKokubo, E., Yoshinaga, K., & Makino, J. 1998, MNRAS, 297, 1067\nKominami, J. &; Ida, S. 2002,Icarus, 157, 43\nLada, C. J. 1999, in The Physics of Star Formation and Early Stellar Evolution, edited by C. J.\nLada and N. Kylafis, Dordrecht, Kluwer, p. 143\nLaskar, J. 1997, ApJ, 317, L75\nLissauer, J. J. 1987, Icarus, 69, 249\nMarcy, G. W. & Butler, R. P. 2000, PASP, 112, 137\nMcMillan, S. L. W. & Aarseth, S. J. 1993, ApJ, 414, 200\n\n\f– 20 –\nOhtsuki, K., Stewart, G. R., & Ida, S. 2002, Icarus, 155, 436\nPress, W. H., Flannery, B. P., Teukolsky, S. A., & Vetterling, W. T. 1992, Numerical Recipes, The\nArt of Scientific Computing, Cambridge, Cambridge\nQuinlan, G. D. & Tremaine, S. D. 1990, BAAS, 22, 949\nSafronov, V. S. 1969, Evolution of the Protoplanetary Cloud and Formation of the Earth and\nPlanets, Nauka, Moscow [Translation 1972, NASA TT F-677]\nSaha, P. & Tremaine, S. 1992, AJ, 104, 1633\nShefer, V. A. 2002, Celestial Mechanics and Dynamical Astronomy, 82, 19\nSkeel, R. D., & Biesiadecki, J. J. 1994, Ann. Numer. Math., 1, 191\nSpaute, D., Weidenschilling, S. J., Davis, D. R., & Marzari, F. 1991, Icarus, 92, 147\nStewart, G. R., & Ida, S. 2000, Icarus, 143, 28\nVasilev, A. M. 1982, Komety i Meteory, 33, 39\nWahhaj, Z., Koerner, D. W., Ressler, M. E., Werner, M. W., Backman, D. E., & Sargent, A. I.\n2003, ApJ, 584, L27\nWeidenschilling, S. J. 1980, Icarus, 44, 172\nWeidenschilling, S. J. 1989, Icarus, 80, 179\nWeidenschilling, S. J., Spaute, D., Davis, D. R., Marzari, F., & Ohtsuki, K. 1997, Icarus, 128, 429\nWetherill, G. W., & Stewart, G. R. 1993, Icarus, 106, 190\nWisdom, J. & Holman, M. 1991, AJ, 102, 1528\nYoshida, H. 1990, Phys. Lett. A, 150, 262\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 21 –\n\nTable 1. Statistics for Planetary Systems at 0.4–2 AU\nΣ/Σ0\n\ntevol (Myr)\n\nN\n\nMl (M⊕ )\n\nSm\n\nSs\n\nSd\n\nSc\n\n0.25\n0.25\n0.50\n0.50\n1.00\n1.00\n1.00\n1.00\n1.00\n1.00\n1.00\n2.00\n2.00\n\n100\n300\n100\n100\n100\n100\n100\n100\n200\n200\n500\n100\n100\n\n9\n10\n10\n8\n6\n8\n5\n6\n5\n5\n2\n5\n6\n\n0.1\n0.1\n0.4\n0.4\n1.3\n1.0\n1.1\n1.4\n1.1\n1.8\n2.1\n2.4\n2.0\n\n0.198\n0.213\n0.292\n0.314\n0.474\n0.526\n0.428\n0.498\n0.371\n0.644\n0.778\n0.521\n0.348\n\n19.9\n22.7\n20.1\n25.1\n27.7\n23.4\n35.6\n28.3\n28.7\n32.0\n36.1\n19.3\n24.6\n\n0.0031\n0.0029\n0.0058\n0.0094\n0.0090\n0.0118\n0.0131\n0.0093\n0.0121\n0.0499\n0.0228\n0.0328\n0.0292\n\n26.4\n24.7\n26.1\n21.9\n33.4\n45.8\n33.4\n27.0\n22.4\n52.6\n119.4\n38.6\n25.7\n\n1.00\n1.00\n\n100\n100\n\n21\n15\n\n0.8\n0.9\n\n0.256\n0.417\n\n14.2\n28.8\n\n0.0136\n0.0119\n\n17.1\n25.4\n\n4\n\n1.0\n\n0.509\n\n37.7\n\n0.0018\n\n89.9\n\nMVEM\n\n\f– 22 –\n\nTable 2.\nTest name\n\nSummary of Numerical Tests\n\nResult (this paper)\n\nResult (other references)\n\nTests of integration accuracy:\nGiant planet orbit integration\nScaled Outer Solar System\n\nFigure 1\nFigure 2\n\n-\nFigure 5, Duncan, Levison & Lee (1998)\n\nFigure 3\nFigure 3\n\nFigure 4, Duncan, Levison & Lee (1998)\n-\n\nFigure 4\nFigure 5\n\n-\nFigure 1, Kokubo & Ida (1995)\nFigure B3, Weidenschilling et al. (1997)\n\nPlanetary accretion (R = 105 km)\n(facc is the accretion fraction)\nPlanetary accretion (R = 5200 km)\n\nfacc = 0.138 ± 0.002\n\nhigh-speed collisions\n\nFigure 6\n\nfacc\nfacc\nfacc\nfacc\n-\n\nFigures 7–9\nTable 1\n\nFigures 8 & 9, Weidenschilling et al. (1997)\nTable 1, Chambers (2001)\n\nTests of dynamic range:\nBinary Jupiters\nEarth satellite\nPlanetesimal dynamics:\nResolving chaos\nTwo planetesimals in a swarm\n\nMerger algorithm:\n\nfacc = 0.008 ± 0.001\n\n= 0.140, Greenzweig & Lissauer (1990)\n= 0.10 ± 0.2, Duncan, Levison & Lee (1998)\n= 0.009, Greenzweig & Lissauer (1990)\n= 0.008 ± 0.002, Duncan, Levison & Lee (1998)\n\nHybrid code:\nPlanet formation (coagulation)\nTerrestrial planet formation\n\n\f– 23 –\n\nFig. 1.- The eccentricity of the major planets derive from a symplectic code and the adaptive\ncode. With a large timestep dt of one thirtieth of the period of Jupiter's orbit (PJ ), the symplectic\nintegrator (panel a) generates phase errors-slow drifts from the true phase-space position of the\nplanets. These errors are reflected in the relatively limited range of eccentricities, as compared\nwith a run with smaller timesteps (panel b). The adaptive code, with a large error tolerance,\nwill run with large timesteps. The adaptive results (panel c) generate more realistic eccentricities\ncompared to the small-timestep symplectic code and the small-error tolerance adaptive code (panel\nd). However, the adaptive code suffers from a slow drift in energy. The net fractional energy errors\nin the adaptive runs are 10−3 (10−5 ) for large (small) error tolerances.\n\n\f– 24 –\n\nFig. 2.- The instantaneous Keplerian semimajor axes of the major planets, with masses scaled\nby a factor of 50, as a function of time from a simulation with our adaptive integrator. Saturn is\nejected just after 2,000 yr; Neptune has acquired an orbit with eccentricity of 0.92 and a semimajor\naxis of about 250 AU. The overall dynamics are highly chaotic and quite sensitive to the outcome\nof the initial interaction between Jupiter and Saturn in the first 100 yr of the simulation.\n\n\f– 25 –\n\nFig. 3.- Gravitationally bound binaries orbiting a solar-mass star. The upper panel shows the\nsemimajor axis of a pair of Jupiter-mass planets as calculated in the center-of-mass frame of the\npair as they orbit the star. The binary eccentricity is e = 0.6, as in Duncan, Levison & Lee (1998).\nThe lower panel is the radial position of a test-particle (\"spy satellite\") on a polar orbit about the\ncenter of the Earth. In this case, we assume the Earth is spherically symmetric. Each panel shows\nonly a single quantity; the appearance of multiple curves is an artifact of sampling.\n\n\f– 26 –\n\nFig. 4.- Integration of planetesimal orbits. The upper two panels show the orbital separation of\na pair of 1026 g objects in units of the mutual Hill radius. In both cases the particles were placed\n√\n√\non circular orbits near 1 AU with separation of 2.1 3rH (top) and 1.9 3rH (middle), where rH is\n√\nthe mutual Hill radius. When the orbital separation is less than 2 3rH , then the orbits will cross.\n√\nThe lower panel shows interactions between eight particles separated by 2.1 3rH .\n\n\f– 27 –\n\nFig. 5.- Evolution of (e2 +i2 )1/2 in units of the Hill radius for two 1026 g objects and a swarm of 800\n2 × 1024 g planetesimals. The horizontal axis gives the orbital radius relative to a0 = 1 AU around\na solar-type star. The large filled circles correspond to a pair of the heavy objects at 200 yr (lower\npanel), 800 yr (middle panel) and 2000 yr (top panel). The small filled circles indicate values of\n(e2 +i2 )1/2 for the planetesimals averaged in radial bins. The × symbols and histograms correspond\nto the two massive objects and planetesimals in a coagulation model (Kenyon & Bromley 2001).\n\n\f– 28 –\n\nFig. 6.- The minimum number of timesteps leading to successful pairwise collisions as a function\nof the planetesimal radius. Specifically, nt95 is the minimum number of low-resolution timesteps\nrequired to resolve a merger between a point-like projectile and a target planetesimal of radius r,\nwith a success rate of 95%. The target and projectile are on counterrotating, circular orbits at\n1 AU, initially on opposite sides of the Sun. The error tolerance for the adaptive code is 10−11\n(filled circles) and 10−15 (open triangles). The precipitous drop in nt95 at large r in both cases\nresults from the adaptive code's use of high-resolution timesteps as it attempts to account for the\ngravitational effect of the target on the projectile.\n\n\f– 29 –\n\nFig. 7.- Evolution of particle number (left panels) and eccentricity (right panels) for planetesimals\norbiting a 1 M⊙ star at 1 AU. The 32 annuli in the grid contain planetesimals with initial radii\nof 1–4 km, initial eccentricity e0 = 1 × 10−4 , and a total mass of 0.6 M⊕ . The panels show the\nevolution of N (m) and e for calculations with the coagulation code at t = 104 yr (upper panels),\nt = 105 yr (middle panels), and t = 106 yr (lower panels). Style adapted from Weidenschilling et\nal. (1997).\n\n\f– 30 –\n\nFig. 8.- Evolution of particle number (left panels) and eccentricity (right panels) for planetesimals\nin orbit around a 1 M⊙ star at 1 AU, as in Figure 7, but for calculations with the hybrid code.\n\n\f– 31 –\n\nFig. 9.- Evolution of eccentricity as a function of mass for hybrid calculations at 1 AU. The plots\nshow the eccentricity at three different times, as indicated by the legend. For smaller mass values\n(m < 1025 g), averages are shown for three different annular regions within the computational\ngrid. Typically, the eccentricities are higher for objects at smaller annuli, an effect which is more\npronounced at earlier times. For larger mass values (m > 1025 g), the eccentricities of single objects\nare shown. These results illustrate the increase in viscous stirring of smaller mass objects with time,\nas well as the dynamical friction generally experienced by the most massive bodies.\n\n\f– 32 –\n\nFig. 10.- Evolution of the mass-weighted eccentricity ē for a hybrid model. The solid circles show\nthe evolution of the oligarchs; the open diamonds indicate the evolution of all objects in the grid.\nViscous stirring and dynamical friction lead to a slow increase in ē. Strong dynamical interactions\nproduce abrupt rises in ē; mergers produce abrupt declines.\n\n\f– 33 –\n\nFig. 11.- Final eccentricity as a function of final mass for calculations at 0.4–2 AU. The open\ndiamonds indicate current values for the terrestrial planets, Mercury, Venus, Earth, and Mars. The\nfilled circles plot results for the ensemble of hybrid calculations listed in Table 1.\n\n\f"}