{"id": "http://arxiv.org/abs/astro-ph/0312203v1", "guidislink": true, "updated": "2003-12-08T14:22:23Z", "updated_parsed": [2003, 12, 8, 14, 22, 23, 0, 342, 0], "published": "2003-12-08T14:22:23Z", "published_parsed": [2003, 12, 8, 14, 22, 23, 0, 342, 0], "title": "The Cellular Burning Regime in Type Ia Supernova Explosions - II. Flame\n  Propagation into Vortical Fuel", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0312368%2Castro-ph%2F0312104%2Castro-ph%2F0312646%2Castro-ph%2F0312434%2Castro-ph%2F0312181%2Castro-ph%2F0312618%2Castro-ph%2F0312357%2Castro-ph%2F0312575%2Castro-ph%2F0312331%2Castro-ph%2F0312525%2Castro-ph%2F0312084%2Castro-ph%2F0312184%2Castro-ph%2F0312118%2Castro-ph%2F0312292%2Castro-ph%2F0312589%2Castro-ph%2F0312271%2Castro-ph%2F0312544%2Castro-ph%2F0312582%2Castro-ph%2F0312610%2Castro-ph%2F0312526%2Castro-ph%2F0312460%2Castro-ph%2F0312311%2Castro-ph%2F0312380%2Castro-ph%2F0312405%2Castro-ph%2F0312499%2Castro-ph%2F0312237%2Castro-ph%2F0312312%2Castro-ph%2F0312231%2Castro-ph%2F0312134%2Castro-ph%2F0312305%2Castro-ph%2F0312128%2Castro-ph%2F0312277%2Castro-ph%2F0312345%2Castro-ph%2F0312179%2Castro-ph%2F0312172%2Castro-ph%2F0312568%2Castro-ph%2F0312467%2Castro-ph%2F0312373%2Castro-ph%2F0312109%2Castro-ph%2F0312092%2Castro-ph%2F0312596%2Castro-ph%2F0312549%2Castro-ph%2F0312099%2Castro-ph%2F0312562%2Castro-ph%2F0312185%2Castro-ph%2F0312366%2Castro-ph%2F0312472%2Castro-ph%2F0312274%2Castro-ph%2F0312459%2Castro-ph%2F0312462%2Castro-ph%2F0312298%2Castro-ph%2F0312087%2Castro-ph%2F0312241%2Castro-ph%2F0312335%2Castro-ph%2F0312604%2Castro-ph%2F0312347%2Castro-ph%2F0312230%2Castro-ph%2F0312111%2Castro-ph%2F0312158%2Castro-ph%2F0312388%2Castro-ph%2F0312007%2Castro-ph%2F0312469%2Castro-ph%2F0312503%2Castro-ph%2F0312505%2Castro-ph%2F0312458%2Castro-ph%2F0312415%2Castro-ph%2F0312318%2Castro-ph%2F0312474%2Castro-ph%2F0312094%2Castro-ph%2F0312614%2Castro-ph%2F0312451%2Castro-ph%2F0312387%2Castro-ph%2F0312418%2Castro-ph%2F0312019%2Castro-ph%2F0312654%2Castro-ph%2F0312317%2Castro-ph%2F0312394%2Castro-ph%2F0312153%2Castro-ph%2F0312364%2Castro-ph%2F0312009%2Castro-ph%2F0312464%2Castro-ph%2F0312164%2Castro-ph%2F0312461%2Castro-ph%2F0312023%2Castro-ph%2F0312601%2Castro-ph%2F0312550%2Castro-ph%2F0312332%2Castro-ph%2F0312337%2Castro-ph%2F0312257%2Castro-ph%2F0312268%2Castro-ph%2F0312501%2Castro-ph%2F0312422%2Castro-ph%2F0312026%2Castro-ph%2F0312282%2Castro-ph%2F0312245%2Castro-ph%2F0312224%2Castro-ph%2F0312203%2Castro-ph%2F0312410%2Castro-ph%2F0312619%2Castro-ph%2F0312453%2Castro-ph%2F0312249&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Cellular Burning Regime in Type Ia Supernova Explosions - II. Flame\n  Propagation into Vortical Fuel"}, "summary": "We investigate the interaction of thermonuclear flames in Type Ia supernova\nexplosions with vortical flows by means of numerical simulations. In our study,\nwe focus on small scales, where the flame propagation is no longer dominated by\nthe turbulent cascade originating from large-scale effects. Here, the flame\npropagation proceeds in the cellular burning regime, resulting from a balance\nbetween the Landau-Darrieus instability and its nonlinear stabilization. The\ninteraction of a cellularly stabilized flame front with a vortical fuel flow is\nexplored applying a variety of fuel densities and strengths of the velocity\nfluctuations. We find that the vortical flow can break up the cellular flame\nstructure if it is sufficiently strong. In this case the flame structure adapts\nto the imprinted flow field. The transition from the cellularly stabilized\nfront to the flame structure dominated by vortices of the flow proceeds in a\nsmooth way. The implications of the results of our simulations for Type Ia\nSupernova explosion models are discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0312368%2Castro-ph%2F0312104%2Castro-ph%2F0312646%2Castro-ph%2F0312434%2Castro-ph%2F0312181%2Castro-ph%2F0312618%2Castro-ph%2F0312357%2Castro-ph%2F0312575%2Castro-ph%2F0312331%2Castro-ph%2F0312525%2Castro-ph%2F0312084%2Castro-ph%2F0312184%2Castro-ph%2F0312118%2Castro-ph%2F0312292%2Castro-ph%2F0312589%2Castro-ph%2F0312271%2Castro-ph%2F0312544%2Castro-ph%2F0312582%2Castro-ph%2F0312610%2Castro-ph%2F0312526%2Castro-ph%2F0312460%2Castro-ph%2F0312311%2Castro-ph%2F0312380%2Castro-ph%2F0312405%2Castro-ph%2F0312499%2Castro-ph%2F0312237%2Castro-ph%2F0312312%2Castro-ph%2F0312231%2Castro-ph%2F0312134%2Castro-ph%2F0312305%2Castro-ph%2F0312128%2Castro-ph%2F0312277%2Castro-ph%2F0312345%2Castro-ph%2F0312179%2Castro-ph%2F0312172%2Castro-ph%2F0312568%2Castro-ph%2F0312467%2Castro-ph%2F0312373%2Castro-ph%2F0312109%2Castro-ph%2F0312092%2Castro-ph%2F0312596%2Castro-ph%2F0312549%2Castro-ph%2F0312099%2Castro-ph%2F0312562%2Castro-ph%2F0312185%2Castro-ph%2F0312366%2Castro-ph%2F0312472%2Castro-ph%2F0312274%2Castro-ph%2F0312459%2Castro-ph%2F0312462%2Castro-ph%2F0312298%2Castro-ph%2F0312087%2Castro-ph%2F0312241%2Castro-ph%2F0312335%2Castro-ph%2F0312604%2Castro-ph%2F0312347%2Castro-ph%2F0312230%2Castro-ph%2F0312111%2Castro-ph%2F0312158%2Castro-ph%2F0312388%2Castro-ph%2F0312007%2Castro-ph%2F0312469%2Castro-ph%2F0312503%2Castro-ph%2F0312505%2Castro-ph%2F0312458%2Castro-ph%2F0312415%2Castro-ph%2F0312318%2Castro-ph%2F0312474%2Castro-ph%2F0312094%2Castro-ph%2F0312614%2Castro-ph%2F0312451%2Castro-ph%2F0312387%2Castro-ph%2F0312418%2Castro-ph%2F0312019%2Castro-ph%2F0312654%2Castro-ph%2F0312317%2Castro-ph%2F0312394%2Castro-ph%2F0312153%2Castro-ph%2F0312364%2Castro-ph%2F0312009%2Castro-ph%2F0312464%2Castro-ph%2F0312164%2Castro-ph%2F0312461%2Castro-ph%2F0312023%2Castro-ph%2F0312601%2Castro-ph%2F0312550%2Castro-ph%2F0312332%2Castro-ph%2F0312337%2Castro-ph%2F0312257%2Castro-ph%2F0312268%2Castro-ph%2F0312501%2Castro-ph%2F0312422%2Castro-ph%2F0312026%2Castro-ph%2F0312282%2Castro-ph%2F0312245%2Castro-ph%2F0312224%2Castro-ph%2F0312203%2Castro-ph%2F0312410%2Castro-ph%2F0312619%2Castro-ph%2F0312453%2Castro-ph%2F0312249&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the interaction of thermonuclear flames in Type Ia supernova\nexplosions with vortical flows by means of numerical simulations. In our study,\nwe focus on small scales, where the flame propagation is no longer dominated by\nthe turbulent cascade originating from large-scale effects. Here, the flame\npropagation proceeds in the cellular burning regime, resulting from a balance\nbetween the Landau-Darrieus instability and its nonlinear stabilization. The\ninteraction of a cellularly stabilized flame front with a vortical fuel flow is\nexplored applying a variety of fuel densities and strengths of the velocity\nfluctuations. We find that the vortical flow can break up the cellular flame\nstructure if it is sufficiently strong. In this case the flame structure adapts\nto the imprinted flow field. The transition from the cellularly stabilized\nfront to the flame structure dominated by vortices of the flow proceeds in a\nsmooth way. The implications of the results of our simulations for Type Ia\nSupernova explosion models are discussed."}, "authors": ["F. K. Roepke", "W. Hillebrandt", "J. C. Niemeyer"], "author_detail": {"name": "J. C. Niemeyer"}, "author": "J. C. Niemeyer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20035778", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0312203v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0312203v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 2 tables, 10 figures, resolution of Figs. 4 and 5 degraded\n  due to archive file size restrictions, submitted to A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0312203v1", "affiliation": "University of Wuerzburg", "arxiv_url": "http://arxiv.org/abs/astro-ph/0312203v1", "journal_reference": "Astron.Astrophys.421:783-795,2004", "doi": "10.1051/0004-6361:20035778", "fulltext": "Astronomy & Astrophysics manuscript no. roepke ̇II\n(DOI: will be inserted by hand later)\n\nDecember 2, 2018\n\nThe Cellular Burning Regime in Type Ia Supernova Explosions\nII. Flame Propagation into Vortical Fuel\n\narXiv:astro-ph/0312203v1 8 Dec 2003\n\nF. K. Röpke1 , W. Hillebrandt2 , and J. C. Niemeyer3\n1\n\n2\n\n3\n\nMax-Planck-Institut für Astrophysik, Karl-Schwarzschild-Str. 1, D-85741 Garching, Germany\ne-mail: fritz@mpa-garching.mpg.de\nMax-Planck-Institut für Astrophysik, Karl-Schwarzschild-Str. 1, D-85741 Garching, Germany\ne-mail: wfh@mpa-garching.mpg.de\nUniversität Würzburg, Am Hubland, D-97074 Würzburg, Germany\ne-mail: niemeyer@astro.uni-wuerzburg.de\n\nthe date of receipt and acceptance should be inserted later\nAbstract. We investigate the interaction of thermonuclear flames in Type Ia supernova explosions with vortical flows by means\n\nof numerical simulations. In our study, we focus on small scales, where the flame propagation is no longer dominated by the\nturbulent cascade originating from large-scale effects. Here, the flame propagation proceeds in the cellular burning regime,\nresulting from a balance between the Landau-Darrieus instability and its nonlinear stabilization (Röpke et al., 2003b,a). The\ninteraction of a cellularly stabilized flame front with a vortical fuel flow is explored applying a variety of fuel densities and\nstrengths of the velocity fluctuations. We find that the vortical flow can break up the cellular flame structure if it is sufficiently\nstrong. In this case the flame structure adapts to the imprinted flow field. The transition from the cellularly stabilized front to the\nflame structure dominated by vortices of the flow proceeds in a smooth way. The implications of the results of our simulations\nfor Type Ia Supernova explosion models are discussed.\nKey words. Supernovae: general – Hydrodynamics – Instabilities – Turbulence\n\n1. Introduction\nIn the canonical astrophysical model Type Ia supernovae (SNe\nIa in the following) are associated with thermonuclear explosions of white dwarf (WD) stars (Hoyle & Fowler, 1960).\nThese WDs are composed of carbon and oxygen. Due to the\nhigh temperature sensitivity of the activation energy of carbon\nand oxygen burning, the reaction is confined to a very narrow\nregion and propagates as a combustion wave. This defines a\nthermonuclear flame. The theoretical understanding of flame\npropagation in WDs provides the key to SN Ia explosion models with the effective flame velocity being the most important\nparameter. What are the phenomena that mediate the combustion wave? The answer to that question is given by the hydrodynamics of combustion. Conservation laws across the flame\nadmit two fundamental modes of flame propagation: the detonation, in which the flame propagates due to shock waves,\nand the deflagration, which is based on microphysical transport phenomena such as heat conduction and species diffusion.\nFlame propagation in the detonation mode is certainly easiest to model. Here the flame propagation velocity with respect\nto the unburnt material is larger than the corresponding sound\nSend offprint requests to: F. K. Röpke\n\nspeed. Therefore the WD star has no time to expand prior to\nthe incineration in this detonation model of SN Ia explosions\nand all the material is consumed at high densities resulting in\nashes consisting solely of iron-peak elements (Arnett, 1969).\nHowever, this is in conflict with observational spectra, which\nshow strong indication of intermediate mass elements.\nConsequently, the star has to expand considerably before\nit is processed by the thermonuclear flame. This is possible\nif flame propagation starts out in the deflagration mode, since\nhere the microphysical transport processes lead to a subsonic\nflame velocity. In the present study, we refer to that deflagration model of SNe Ia. Moreover, underlying to our model is\nthe so-called single-degenerate scenario, where the progenitor is a binary system with the WD accreting matter from the\nnon-degenerate companion until it reaches the Chandrasekhar\nmass. At this point, thermonuclear reaction ignites near the\ncenter of the WD and propagates outward as a deflagration\nflame. For a review of SN Ia explosion models we refer to\nHillebrandt & Niemeyer (2000).\nIn the framework of the deflagration model, recent largescale SN Ia explosion models have been quite successful\n(Reinecke et al., 2002; Gamezo et al., 2003). Nevertheless, the\ndetermination of the flame propagation speed is much harder\n\n\f2\n\nF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\nin this case. A planar deflagration flame would be far too\nslow to cause powerful SN Ia explosions, but these models predict an acceleration of the deflagration flame due to\ninteraction with turbulence. The resulting energy release is\nsufficient to unbind the WD star. Following the reasoning\nby Niemeyer & Woosley (1997), the turbulent motions are\nevoked by large-scale instabilities-such as the RayleighTaylor (buoyancy) instability and the Kelvin-Helmholtz (shear)\ninstability-and decay to smaller scales forming a turbulent\neddy cascade (Richardson, 1922). Eddies of that cascade wrinkle the flame and increase its surface. This corresponds to an\nacceleration of the effective flame propagation speed. However,\nthe vast range of spatial scales relevant to the problem of SN Ia\nexplosions (from the radius of the star down to the width of a\ntypical flame it covers about 11 orders of magnitude) restricts\nthese models to the simulation of effects on the largest scales\nonly. This makes it impossible to directly determine the turbulent flame propagation velocity in the simulations and therefore\nassumptions on the physics on unresolved small scales must be\nmade. The fundamental idea here is that flame propagation is\ndominated by the turbulent cascade that is driven solely from\nlarge-scale instabilities and that no other effects contribute to\nthe generation of turbulence.\nHowever, due to the scaling law of the turbulent cascade,\nwhich predicts the turbulent velocity fluctuations to monotonically decrease with smaller scale, there exists a certain length\nscale below which the flame burns faster through the corresponding eddies than these can deform it. For chemical flames,\nthis scale is identified with the Gibson scale (Peters, 1986) and\nwe will use this term in the context of thermonuclear combustion, too. Below the Gibson scale the flame propagates in a\n\"frozen turbulence field\" and is no longer affected by the eddy\ncascade. Large scale models assume stable flame propagation\nhere. Although some theoretical concepts support this idea, no\nhydrodynamical simulations provided convincing proofs yet.\nIn order to fill that gap in SN Ia models we performed\nnumerical studies of flame propagation around the Gibson\nscale. The basic physical effects that determine flame propagation here are the hydrodynamical Landau-Darrieus instability\n(Darrieus, 1938; Landau, 1944) and the counteracting nonlinear stabilization of the flame (Zel'dovich, 1966). The balance\nof the two effects gives rise to a stable cellular flame structure\ncharacterizing the cellular burning regime. The goals of our investigations were to determine whether or not the cellular burning regime exists for thermonuclear flames in WD matter and\nto test how robust the anticipated cellular stabilization is under varying conditions. On the one hand, these studies examine\na fundamental assumption of present SN Ia explosion models\nand on the other hand they are intended to explore the possibility of new physical effects that may have to be included into\nthese. In particular, the question of the robustness of the cellular stabilization of the flame is closely connected to the socalled delayed detonation models of SN Ia explosions. In these\nmodels, the flame starts out as a deflagration wave, but later\nturns into a supersonic detonation. Empirical one-dimensional\nSN Ia models support this idea, since those lead to quite realistic spectra if a deflagration-to-detonation transition (DDT) is\nimposed artificially at low fuel densities (Höflich & Khokhlov,\n\n1996; Iwamoto et al., 1999). Although DDTs are frequently\nobserved in terrestrial combustion, a mechanism that could account for such a transition under conditions of SN Ia explosions could not be identified so far (Niemeyer, 1999). However,\none possibility is a breakdown of the flame stabilization and\na subsequent generation of turbulence on small scales by the\nflame itself, that would result in an additional acceleration of\nthe flame. This active turbulent combustion (ATC) mechanism\nhas been proposed by Niemeyer & Woosley (1997) on the basis of a work by Kerstein (1996). Niemeyer & Woosley (1997)\nsuggest that the cellular flame stabilization could break down at\nthe Gibson scale leading to ATC. One motivation for our study\nis to examine this idea.\nThe present paper is the third in a series of publications\non the investigation of the cellular burning regime in Type Ia\nsupernova explosions. After the introduction of the numerical\nmethods to study this regime together with providing some examples of application (Röpke et al., 2003b), the implementation was used to study flame propagation into quiescent fuel\n(Röpke et al., 2003a). The results obtained there (to be summarized in the next section) raised the question of the interaction of a cellular flame with turbulent flows. This topic is also\nmotivated from the supernova model. Around the Gibson scale\none can still expect turbulent velocity fluctuations of the order of the laminar burning speed of the flame originating from\nthe turbulent cascade. Additionally, pre-ignition convection in\nthe WD may result in relic turbulent motions of considerable\nstrength. Höflich & Stein (2002) claim surprisingly high values\nof convective velocities.\nA brief description of the physical effects underlying the\ncellular burning regime and of the numerical methods applied\nto model it will be provided in the next section. In Sect. 3 the\nresults of our numerical simulations will be presented and discussed. Finally, we will draw conclusions emphasizing the implications of our results for SN Ia models.\n\n2. The cellular burning regime and its numerical\nsimulation\nSince our study aims at the flame evolution around the Gibson\nscale, which is expected to be well-separated from the scale\nof the flame width for fuel densities above 107 g cm−3 , we will\ntreat the flame in the discontinuity approximation in the following. That is, we describe the flame as a simple discontinuity\nbetween fuel and ashes and ignore its internal structure. Note\nthat this picture does not account for the microphysical transport phenomena and therefore the laminar burning speed of the\nflame (i.e. the velocity of a planar deflagration flame) is not\nintrinsically given in this model.\nThe Gibson scale is determined by this laminar burning\nspeed sl , by the velocity fluctuations at the integral scale\nof turbulence, and by the scaling law of the eddy cascade.\nTimmes & Woosley (1992) determined the laminar burning velocity by means of one-dimensional simulations fully resolving the internal structure of the flame, and we apply the fitting\nformula given there to obtain the value for a particular composition and density of the fuel. As has been mentioned by\nRöpke et al. (2003a), this formula is afflicted with some un-\n\n\fF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\ncertainties, which introduce a considerable ambiguity to the\nexact value of the Gibson scale. Following the approach of\nRöpke et al. (2003a), we will arrange our simulations at length\nscales around 104 cm as a crude estimate of the Gibson length,\nsince our goal is to qualitatively explore the possible effects\nhere rather than to perform highly precise measurements.\nBelow the Gibson scale, flame propagation is determined\nby the competition between the Landau-Darrieus (LD) instability and its nonlinear stabilization. The LD instability is of\npure hydrodynamical origin and results from the density contrast across the flame front in combination with mass flux conservation. This leads to a refraction of the stream lines at the\nflame causing a flow field that enhances initial perturbations of\nthe planar flame shape. The fact that the LD instability acts on\nthermonuclear flames under conditions of SN Ia explosions has\nbeen proven by means of a full hydrodynamical simulation by\nNiemeyer & Hillebrandt (1995). The refined numerical model\nthat was described by Röpke et al. (2003b) allowed us to investigate this instability in detail. We simulated the propagation\nof a sinusoidally perturbed flame front into quiescent fuel. The\ninitial linear regime of flame evolution was shown to be indeed determined by the LD instability. The flow field accounting for this effect was apparent in our simulations (Röpke et al.,\n2003a). Moreover, the growth rate of the amplitude of the perturbation was found to be consistent with the dispersion relation that Landau (1944) derived by means of a linear stability\nanalysis.\nThe nonlinear stabilization of the flame is a geometrical effect. Zel'dovich (1966) explained the mechanism by following\nthe propagation of a perturbed flame by means of Huygens'\nprinciple of geometrical optics (see also Fig. 1 in Röpke et al.\n2003b). Once the perturbation has grown to a critical size, former recesses of the flame front develop into cusps between\nbulges of the front. It can easily be shown that the propagation velocity vcusp of such a cusp exceeds the laminar burning\nvelocity sl of the other parts of the flame by\nvcusp =\n\nsl\n,\ncos θ\n\n(1)\n\nwhere θ denotes the inclination angle of the bulges adjacent to\nthe cusp. This effect balances further growth of the perturbation due to the LD instability and causes a cellular shape of\nthe flame front. Therefore the regime of flame propagation at\nscales where it is dominated by the interplay between the LD\ninstability and its nonlinear stabilization will be termed cellular\nburning regime in the following.\nThe nonlinear stage of flame evolution could not be\nreached by early attempts of hydrodynamical simulations of\nflame propagation (Niemeyer & Hillebrandt, 1995). However,\napplying a semi-analytical description of flame evolution,\nBlinnikov & Sasorov (1996) explored effects of the cellular\nburning regime in the context of SN Ia explosions and also\nBychkov & Liberman (1995) discussed the cellular flame stabilization. With help of the numerical implementation that was\ndescribed by Röpke et al. (2003b) on the basis of the work by\nReinecke et al. (1999), it was possible to prove by means of\na hydrodynamical simulation, that cellular stabilization holds\nfor thermonuclear flames in SN Ia explosions (Röpke et al.,\n\n3\n\n2003b,a). In connection with flame interaction with vortical\nflows, which will be studied in the following, the most important results of the investigation of the cellular stabilization of\nthe flame propagating into quiescent fuel were the following:\n– The flame stabilizes in a cellular shape for fuel densities\ndown to 107 g cm−3 . However, at the lowest fuel densities,\nthe stabilization can only be revealed with high numerical\nresolution. This may be interpreted as a hint to increased\nsensitivity of the cellular flame stabilization to (numerical)\nnoise at low fuel densities.\n– The evolution of the flame shape tends to a steady state consisting of only one cell filling the entire computational domain. This is consistent with results from semi-analytical\nand analytical studies based on the Sivashinsky-equation\n(Gutman & Sivashinsky, 1990; Thual et al., 1985). The\nsingle-cell solution establishes independently of the wavelength of the initial flame perturbation via merging of small\ncells.\n– Applying a simulation setup of an on average planar\nflame configuration in a finite computational domain leads\nto a dependence of the alignment of the finally emerging domain-filling single-cell structure on the boundary\nconditions imposed transverse to the direction of flame\npropagation. In contrast to periodic boundaries, the crest\nwill align in the center for reflecting boundary conditions. This is consistent with semi-analytical results\n(Gutman & Sivashinsky, 1990).\n– The emerging cellular shape of the flame leads to an increased flame surface and equivalently an increased effective flame propagation speed as compared to a planar flame\nfront.\n– Depending on the width of the computational domain, the\nfundamental single-cell structure may be superimposed by\na short-wavelength cellular pattern. However, these small\ncells are advected towards the cusp where they disappear.\nThis mechanism is consistent with theoretical predictions\nby Zel'dovich et al. (1980).\nThese results will be helpful in the interpretation of the simulations of flame propagation in vortical flows. The possibility\nof a weaker cellular stabilization at low fuel densities is a further motivation to test the interaction of the flame with physical\nnoise, represented by a vortical flow field.\nWe will only briefly outline the numerical implementation here and refer to Röpke et al. (2003b) and Reinecke et al.\n(1999) for detailed discussions. The description of the flame\nin the discontinuity approximation allows us to separate the\nflame propagation from the hydrodynamics in a first step. The\nhydrodynamics part of the numerical implementation thus reduces to the solution of the reactive Euler equations, which\nis performed applying a finite-volume approach. In particular\nwe employ the piecewise parabolic method (PPM) suggested\nby Colella & Woodward (1984) in the P implementation by Fryxell et al. (1989). Flame propagation is modeled using the level-set method (e.g. Osher & Sethian 1988;\nSussman et al. 1994; Smiljanovski et al. 1997; Reinecke et al.\n1999). For the correct reproduction of hydrodynamical effects,\nsuch as the LD instability, a precise coupling between flame\n\n\f4\n\nF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\nPSfrag replacements\n\n8800\n\n6 × 106\n\n(a)\n\n(b)\n8500\n\n4 × 106\n\ng replacements\n\n2 × 106\n\ny [cm]\n\nvy [ cm s−1 ]\n\n8200\n\n7900\n\n0\n\n−2 × 106\n\n−4 × 106\n\n7600\n\n−6 × 106\n\n7300\n7300\n\n7600\n\n1.55 × 106 cm s−1\n\n7900\n\n8200\n\n8500\n\n0\n\n8800\n\n2000\n\n4000\n\n6000\n\n8000\n\n10000\n\n8000\n\n10000\n\nx [cm]\n\nx [cm]\n\nPSfrag replacements\n\nand flow turned out to be essential (Röpke et al., 2003b). This\nis provided by applying the in-cell reconstruction/flux-splitting\ntechnique introduced by Smiljanovski et al. (1997).\n\n(a)\n\n(b)\n−2 × 106\n\nvy [ cm s−1 ]\n\nFig. 1. Vortical flow field as applied in the simulations (here for\nthe case ρ = 5 × 108 g cm−3 ). The frame of reference is comoving with the vortices. The snapshot is taken after 1.5 flame\ncrossing times over the entire computational domain.\n\n−4 × 106\n\n0\n2 × 106\n4 × 106\n\n3. Flame interaction with a vortical flow\nIn the following we will present the results from simulations\nof the interaction of cellular flames with vortical flows. After\ndiscussing the simulation setup we will make some general remarks on what can be expected in the simulations. This will\nbe followed by a survey of flame evolution depending on the\nstrength of the vortices for an exemplary case at a fixed fuel\ndensity. Finally, we will capture the simulation results for various fuel densities in a quantitative way.\n\n6 × 106\n\n−6 × 106\n\n0\n\n2000\n\n4000\n\n6000\n\nx [cm]\n\nFig. 2. Profile of the y-component of the vortical flow field parallel to the x-axis (a) ρ = 5×108 g cm−3 ; (b) ρ = 1×108 g cm−3 .\nThe snapshots are taken after 1.5 flame crossing times over the\nentire computational domain.\n\n3.1. Simulation setup\nThe basic setup of our simulations was similar to that used to\ndescribe flame propagation into quiescent fuel (Röpke et al.,\n2003b,a). The flame was initialized in a computational domain\nwith periodic boundary conditions transverse to the direction\nof flame propagation. In order to capture the full flame front\nin cases of strong deformation, we changed from a quadratic\ndomain to a rectangle of 300 × 200 computational cells. The\ncell width was set to ∆x = ∆y = 50 cm. Several experiments\nwith initially planar flames yielded drastic responses of the\nflame shape when the vortices encountered it. This can be attributed to the high sensitivity of planar flames to perturbations.\nConsequently, in order to make the results of different simulations comparable and to enable a quantification of the flame\nevolution, the flame was perturbed initially in a sinusoidal way\nwith eight periods fitting into the domain. This initial perturbation grows due to the LD instability and stabilizes in a cellular\n\npattern, before the injected vortices reach the flame front. In\nthis way it was possible to study the interaction of a stabilized\nflame with a vortical flow field preventing the incoming flow\nfrom unpredictably deforming the flame shape at the first encounter.\nThe numerical investigation of flame interaction with turbulence is generally an intricate issue. In principle, the straight\nforward way to go would be to produce an isotropic turbulence\nfield by external forcing and to set up a flame in this field. This\napproach is, however, too expensive for the purpose of the parameter study we are aiming at. For this reason we simply modified the inflow boundary condition in order to inject a vortical\nflow field instead of quiescent fuel. The flow field is not stirred\nand turbulence is not actively produced inside the computational domain by external forcing. As a consequence turbulence\ninjected here partly decays before reaching the flame front-an\n\n\fF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\n5\n\nTable 1. Setup values for the simulations of the flame evolution.\n\nLabel\n\nρu [ g cm−3 ]\n\nρb [ g cm−3 ]\n\nμ\n\nAt\n\nsl [ cm s−1 ] (TW) ei,u [ erg g−1 ]\n\nei,b [ erg g−1 ]\n\n1.25 × 107\n2.5 × 107\n5 × 107\n7.5 × 107\n\n1.232 × 107\n2.484 × 107\n4.988 × 107\n7.50 × 107\n\n3.830 × 106\n8.69 × 106\n2.071 × 107\n3.345 × 107\n\n3.22\n2.86\n2.41\n2.24\n\n0.526\n0.482\n0.413\n0.383\n\n2.86 × 105\n5.01 × 105\n8.74 × 105\n1.21 × 106\n\n8.99 × 1017\n9.50 × 1017\n1.051 × 1018\n1.13 × 1018\n\neffect which we have to take into account in the measurement\nof characteristic quantities.\nAs suggested by Helenbrook & Law (1999), we applied an\noscillating inflow boundary condition on the right hand side of\nthe computational domain, which generates a vortical velocity\nfield approaching the flame. The velocity at the boundary now\nreads:\n\b\n(2)\nv x = sl −1 + v′ sin 2kπy cos 2kπ(x − tsl )\nvy = sl v′ cos 2kπy sin 2kπ(x − tsl ).\n′\n\n(3)\n\nThe parameter v characterizes the strength of the imprinted\nvelocity fluctuations and k denotes the wavenumber of the oscillation. This produces what is termed \"square vortices\" by\nHelenbrook & Law (1999). A similar flow field is applied by\nVladimirova et al. (2003) who name it \"cellular flow\" and also\nZhu & Ronney (1994) use a flow with cellular vortices to study\nflame propagation in it. The particular flow has the advantage of\nbeing very simple-ideally containing only one Fourier mode.\nThis helps to make the effects visible more clearly and simplifies the interpretation. Figure 1 illustrates the vortical flow\napplied in our simulations. It shows an example at a density of\nρ = 5 × 108 g cm−3 . In Fig. 2a the y-component of the velocity is plotted against the x-coordinate for the same simulation.\nObviously, the velocity fluctuation is damped while propagating from the inflow boundary into the computational domain.\nThe damping is even stronger for lower densities. Figure 2b\nshows a plot for ρ = 1 × 108 g cm−3 .\nIn order to be able to follow the long-term flame evolution,\nthe simulations are carried out in a frame of reference comoving with the flame. For a planar flame this could be achieved\nby applying an inflow condition on the right hand side of the\ndomain, where fuel enters at the laminar burning velocity, and\nan outflow condition on the opposite side of the domain. Since\nflame wrinkling and subsequent surface enhancement due to\nthe LD instability and interaction with turbulent eddies will\naccelerate the flame, additional measures have to be taken in\norder to keep the flame centered in the domain. In the simulations presented by Röpke et al. (2003b,a) the grid was simply\nshifted according to the flame motion relative to sl . However,\nthis approach is not consistent with the oscillating boundary\ncondition. Therefore we modified eq. (2) to\n(\n)\nA\nv x = sl −\n+ v′ sin 2kπy cos 2kπ(x − tsl ) ,\n(4)\nAplanar\nwhere A denotes the actual flame surface (measured in each\ntime step) and Aplanar stands for the surface of the corresponding planar flame, which is equivalent to the width of the domain\n\n2.005 × 1017\n2.56 × 1017\n3.584 × 1017\n4.29 × 1017\n\nin our case. This ensures that the velocity with which the fuel\nenters the domain adapts to the current effective flame propagation speed (cf. eq. (6) in Sect. 3.4) and the position of the flame\nrelative to the grid is kept approximately fixed.\nWe performed a number of simulations with different fuel\ndensities. For convenience of the reader, a compilation of the\nsetup values is given in Table 1.\n\n3.2. What can be expected?\nBefore we present the results of our numerical study we discuss\nwhat we actually are looking for in the simulations. That is, we\nsomehow have to define how to discriminate between stable\nflame propagation and a breakdown of the stabilization. Why\nis this a question of definition? From the conjecture of active\nturbulent combustion it may appear that a breakdown of the stabilization must be obvious from a rapid and unlimited growth\nof the flame propagation velocity. However, this cannot be expected to occur in a numerical simulation where the growth of\nthe flame surface due to ATC would be limited by discretization\nand resolution. Hence, the maximum effect that can be anticipated is a rapid increase in flame surface and burning velocity\nand a saturation at some higher value. A second possibility is\nthat with increasing strength the vortical flow starts to dominate\nthe flame evolution.\nOn the other hand, how can we guarantee flame stabilization? Owing to the high computational costs it will not be possible to follow the flame propagation for an arbitrarily long time.\nHowever, in case of stabilization we can actually make use of\nthe knowledge of the flame pattern that is to be expected in case\nof stability in our specific simulation setup. From the preceding\nstudies of flame propagation into quiescent fuel (Röpke et al.,\n2003b,a) it is known that the flame finally stabilizes in a single\ndomain-filling cusp-like structure for our setup. This structure\nmay be superimposed by a smaller-scale cellular pattern in sufficiently resolved simulations. A similar result can be anticipated for interaction with weak imprinted vortices.\nThus we may expect two extremal behaviors of the flame.\nIn one case the flame stabilizes and the incoming perturbation\nfails to break up the cellular pattern. The cells of the stabilized\nsmall wavelength pattern caused by the initial perturbation of\nthe flame front will then merge forming the single domainfilling cusp which then propagates stably. Alternatively, if the\nintensity of the incoming vortices is high enough to destroy the\nstabilization, no single domain-filling cusp will finally emerge.\n\n\f6\n\nF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\nFig. 4. Flame evolution for a fuel density of 5 × 107 g cm−3 and a velocity fluctuation of v′ /sl = 2.5 at the right boundary.\nSnapshots taken at time steps (a) t = 4.0 × 10−3 s, (b) t = 8.0 × 10−3 s, (c) t = 3.2 × 10−2 s, and (d) t = 4.8 × 10−2 s. The vorticity\nζ (cf. eq. (5)) is color-coded and the flame position is indicated by solid white curves.\nIn this second case the flame should rather show a transient\npattern.\n\n3.3. General features\nAs an example, we consider the case of a fuel density amounting to 5 × 107 g cm−3 (cf. Table 1). Figure 3 gives an overview\nover the flame evolution in interaction with vortical fuel flows\nof different strengths. The values v′ /sl = 0.7, v′ /sl = 2.0, and\nv′ /sl = 2.5 indicate the amplitudes of velocity fluctuations imposed at the right boundary of the domain. Note, however, that\nthey do not necessarily represent the values experienced by the\nflame front for reasons given in section 3.1.\nFigure 3a provides the comparison with flame propagation into quiescent fuel for the chosen setup. In this simulation v′ was set to zero. It resembles the features of the simulations presented by Röpke et al. (2003b,a). Due to the LD\ninstability, the initial perturbation grows and the flame shape\nevolves into a cellular pattern in the nonlinear regime. The subsequent contours show the \"merging\" of the short-wavelength\ncells imprinted by the initial condition resulting in the formation of larger cells. This behavior was observed in a sim-\n\nulation of the long-term flame evolution in quiescent fuel\n(Röpke et al., 2003a). There a cusp-like structure that was centered in the domain finally emerged as the steady state structure. The tendency to form a domain-filling cell is also apparent\nin Fig. 3a. However, following the evolution until the steadystate is reached is very expensive and shall not be tried here.\nThis is certainly a drawback in the current study, but it was\nchosen as a compromise in order to be able to explore a larger\nparameter space with given computational resources.\nContrary to the flame evolution in Fig. 3a, the case of\nv′ /sl = 2.5 (Fig. 3d) clearly shows the disruption of the initial cellular pattern by interaction of the flame with vortices.\nAlso, the formation of a single domain-filling cell is suppressed\nby the interaction. The overall flame shape evolution in this\ncase can be interpreted as an adaptation to the imprinted vortical flow structure. This is emphasized by Fig 4. It provides a\nmore detailed visualization of the interaction between the flame\nshape and the vortical flow, which is characterized by the colorcoded logarithm of the absolute value of the vorticity ζ of the\nflow field,\nζ=\n\n∂vy ∂v x\n−\n,\n∂x\n∂y\n\n(5)\n\n\fF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\n7\n\nFig. 5. Flame evolution for a fuel density of 5 × 107 g cm−3 and a velocity fluctuation of v′ /sl = 0.7 at the right boundary.\nSnapshots taken at time steps (a) t = 8.0 × 10−3 s, (b) t = 2.4 × 10−2 s, (c) t = 3.2 × 10−2 s, and (d) t = 4.8 × 10−2 s. The vorticity\nζ (cf. eq. (5)) is color-coded and the flame position is indicated by solid white curves.\npointing out the vortices imprinted on the fuel flow.\nThe transition in the flame evolution between the extreme\ncases depicted in Figs. 3a and 3d does, however, not proceed\nabruptly, but rather in a smooth transition. Figures 3b,c present\ntwo examples of intermediate behaviors at v′ /sl = 0.7 and\nv′ /sl = 2.0, the first of which is again illustrated by snapshots in\nFig. 5. In this case, still a tendency to form a long-wavelength\ncellular structure is visible. Here the mechanism of the advection of small perturbations toward the cusp (Zel'dovich et al.,\n1980; Röpke et al., 2003b,a) dominates over the effects of the\nvortical flow on the flame shape.\nSimulations similar to the aforementioned were also performed in some cases with higher resolution of the numerical grid in order to test whether or not insufficient resolution prevents small scale flame structures from developing. However, no significant difference to the flame evolution depicted in Fig. 3a–d could be noticed. This agrees with\nHelenbrook & Law (1999), who found in their simulations of\nchemical flames that the wavelength of perturbations that develop in the interaction with a vortical flow is determined by\nthe scale of the vortices and not by a critical wavelength (in-\n\ntroduced by a curvature-dependent burning speed of the flame\nfront according to Markstein 1951).\n\n3.4. A Parameter study\nIn order to quantify the flame evolution as qualitatively described in the preceding section, we conducted a parameter\nstudy. It aimed at the determination of flame behavior as a function of the strength of the vortices in the incoming flow and in\ndependence on the fuel density.\nAs discussed by Röpke et al. (2003a), the simulation of\nflame stabilization at around 1.0 × 107 g cm−3 requires unaffordable high numerical resolutions and furthermore our thin\nflame approximation is certainly not a realistic description of\nthermonuclear burning in SNe Ia at these low densities. On\nthe other hand, it can be observed, that at higher fuel densities\n(around 108 g cm−3 ) the sensitivity of the initial flame to smallwavelength perturbations increases. This causes difficulties in\nproducing a stable flame configuration prior to the incoming\nvortices encountering the flame front. However, in connection\nwith a possible DDT we are mainly interested in the late stages\nof the SN Ia explosions (see Sect. 1). Therefore we restricted\n\n\f8\n\nF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\n1.0 × 104\n\nplacements\n\ny [cm]\n5.0 × 103\n2.5 × 103\n0\n2.5 × 103 cm\n\n(a)\n\n1.0 × 104\n\nplacements\n\ny [cm]\n5.0 × 103\n2.5 × 103\n0\n2.5 × 103 cm\n\n(b)\n\n1.0 × 104\n\nplacements\n\ny [cm]\n5.0 × 103\n2.5 × 103\n0\n2.5 × 103 cm\n\n(c)\n\n1.0 × 104\n\nplacements\n\ny [cm]\n5.0 × 103\n2.5 × 103\n0\n2.5 × 103 cm\n\n(d)\n\nFig. 3. (a) Flame propagation into quiescent fuel at a density\nof 5 × 107 g cm−3 and interaction with a vortical fuel field for\nvelocity fluctuations at the right boundary of (b) v′ /sl = 0.7,\n(c) v′ /sl = 2.0, and (d) v′ /sl = 2.5. Each contour represents a\ntime step of 3.2 × 10−3 s.\nthe study to four fuel densities: ρu = 1.25 × 107 g cm−3 , ρu =\n2.5×107 g cm−3 , ρu = 5×107 g cm−3 , and ρu = 7.5×107 g cm−3\n(cf. Table 1).\nPlots similar to Fig. 3 corresponding to simulations with\ndifferent fuel densities are given by Röpke (2003). The flame\nevolution in these simulations can be summarized as follows:\nAt lower fuel densities the effect of the incoming vortices\non the flame structure is generally more drastic. For ρu =\n2.5 × 107 g cm−3 the tendency of the formation of the domainfilling structure is still visible in the case of propagation into\nquiescent fuel. This is not the case for ρu = 1.25 × 107 g cm−3\n\nfor reasons discussed by Röpke et al. (2003a). However, with\nincreasing strengths of the imprinted velocity fluctuations, the\nflame still gradually adapts to the flow for both fuel densities.\nAt ρu = 7.5 × 107 g cm−3 the flame evolution is similar to that\nat ρu = 5 × 107 g cm−3 . Only in case of propagation into quiescent fuel an initial destabilization with respect to small wavelength perturbations (cf. Röpke et al. 2003a) alters the evolution for a transition period, before the flame finally stabilizes in\na domain-filling single-cell structure.\nIn a quantitative evaluation of our parameter study regarding the flame evolution for different fuel densities we will now\naddress (i) the dependency of the effective flame propagation\nvelocity on the strength of the imprinted velocity fluctuations\nand (ii) the amplification of the velocity fluctuation by the\nflame front.\nFor the exemplary case of ρu = 5 × 107 g cm−3 we discuss\nthe measurement of the necessary quantities in our simulations.\nThe effective propagation velocity veff of the flame is determined via the flame surface:\nveff\nAsurf\n=\n.\nsl\nAplanar\n\n(6)\n\nUnderlying to that relation is the assumption of a constant, geometry independent burning velocity sl of the flame. This assumption has been discussed in the context of the present flame\nmodel by Röpke et al. (2003b). The measured flame surface\narea as a function of time is plotted in Figs. 6a and 6b for the\nsimulations with v′ /sl = 0.7 and v′ /sl = 2.5, respectively. Here\nadaptation of the flame structure to the strong vortical fuel flow\nis obvious. After the imprinted velocity fluctuations reach the\nflame at t ∼ 150τ∆x , its surface becomes dominated by the vortices and changes with the frequency of these. This is reflected\nby the high-frequency fluctuations of A in Fig. 6b. In addition\nto fluctuations on a small time scale, the interaction with the\nvortical flow field introduces considerable long term fluctuations. These are, of course, expected in the initial phase when\nthe flame begins to react to the incoming vortices. But even at\nmuch later times the flame surface area does not reach a steady\nstate.\nThe standard deviation of the velocity field is obtained separately in the fuel upstream of the front and in the ashes downstream of it in order to determine the amplification of the velocity fluctuations across the flame front. In Fig. 7 the quantities are plotted against time for our exemplary case. As mentioned above, the strength of the vortices produced at the inflow\nboundary is not a reliable measure of what the flame actually\nexperiences, since the velocity fluctuations get damped quickly\nwhen propagating toward the flame and bending of the flame\nfront may lead to different velocity fluctuations at different locations on the flame. Moreover, the dependence of the damping\non the fuel density hampers the comparability of simulations\nwith this parameter varying. Therefore we determine the standard deviations of the velocity fields, σ(vu ) and σ(vb ), within\na certain belt around the flame front. This belt was scaled in a\nway that the time for flame crossing over its width remained\nthe same for all fuel densities.\nAll quantities measured in our simulations fluctuate considerably with time. Hence we averaged them over a time ranging\n\n\fσ(vu )/sl\n\nσ(vu )/sl\n\n0.00\n\n0.05\nF. K. Röpke et al.: Cellular Burning in\nSNe Ia-Flame Propagation into Vortical Fuel\n0\n\n0\n0.10\n1.0\n0.15\n1.5\n0.20\n\n0.20\n\n1.0\n\n(a)\n\n1.5\n\n9\n\n(b)\n1.5\n\nσ(vu )/sl\n\nσ(vu )/sl\n\n0.15\n\n0.10\n\n1.0\n\n0.5\n\n0.05\n\n(a)\n0.5\n\n(b)\n\n0.5\n0.00\n\n0\n\n0.00\n\n0.00\n\n(c)\n\n0\n\n200\n\n0.05\n\n(d)\n\n400\nτ∆x\n\n600\n\n800\n\n(c)\n\n0\n\n200\n\n0.05\n\n(d)\n\n0.10\n\n400\nτ∆x\n\n600\n\n800\n\n0.10\n\n0.15\n\n6\n\n0.15\n\n(c)\n\n0.20\n\n6\n\n(d)\n\n0.20\n5\n\nσ(vb )/σ(vu )\n\nσ(vb )/σ(vu )\n\n5\n\n4\n\n3\n\n4\n3\n2\n\n(a)\n\n2\n\n(a)\n1\n\n(b)\n\n(b)\n\n1\n0\n\n(d)\n\n200\n\n400\nτ∆x\n\n600\n\n800\n\n(c)\n\n0\n\n200\n\n400\nτ∆x\n\n600\n\n800\n\nFig. 7. (a,b) standard deviation of the velocity field ahead of the front over time, and (c,d) ratio of the standard deviations of\nthe velocity fields beyond and ahead of the flame over time. The left and right columns of plots correspond to v′ /sl = 0.7 and\nv′ /sl = 2.5, respectively.\nfrom 480 τ∆x to 720 τ∆x (τ∆x denotes the crossing time of the\ncorresponding laminar flame over one grid cell).\nIn Fig. 8 the temporal mean value of flame surface area\nAsurf (normalized to the surface area of the corresponding planar flame front Aplanar ) is plotted against the temporal mean of\nstandard deviation of the velocity in the fuel region (normalized to the laminar burning velocity of the flame). The increase\nof the flame speed with stronger incoming velocity fluctuations\nis evident here. However, there is quite a large scatter in the\ndata. This has two reasons. First, we certainly did not follow the\nflame evolution long enough to undoubtly reach the steady state\nof the flame shape-which should ideally be the clearly distinct single domain-filling cusp-like structure in case of weak\nincoming vortices. To follow the flame propagation up to this\nstage would, however, be much too expensive for a parameter\nstudy. Second, some peculiar features of the flame shape may\ndevelop as a result of small perturbations (e.g. due to numerical noise). In particular, this may cause substantial deviations\nif it affects the long-wavelength structure of the flame and is\nprimarily responsible for the scatter of the results in case of\n\nstrong incoming velocity fluctuations. This scatter could very\nlikely be cured by taking the mean over longer time intervals.\nDamköhler (1940) proposed a linear dependence of the effective flame propagation velocity on the turbulence intensity\nfor turbulent combustion in what is today called the flamelet\nregime (Peters, 1986). Our results are consistent with a linear\ngrowth law. Corresponding fits to the data are included in Fig. 8\nand values for the parameter a according to the fitting formula\nhAsurf i\nhσ(vu )i\n= 1.0 + a\nAplanar\nsl\n\n(7)\n\nare given in Table 2. It is evident from Fig. 8 that interaction of\nthe flame in the cellular regime with turbulent velocity fluctuation can lead to a substantial acceleration of the flame propagation velocity. Unfortunately, it is not possible to infer a clear\ntrend of the slope depending on the fuel density from this parameter study.\nIn order to estimate the amplification of the velocity fluctuations across the flame for different densities, we compared\nthe strength of velocity fluctuations downstream of the flame\n\n\f10\n\nF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\nTable 2. Fit parameters according to fitting formulas (7) and (8) with corresponding asymptotic standard errors.\n\nρu [ g cm−3 ]\n1.25 × 107\n2.5 × 107\n5 × 107\n7.5 × 107\n\na\n1.25712 ± 0.0215\n1.29816 ± 0.0797\n1.05533 ± 0.04931\n1.07245 ± 0.05131\n\nb\n0.177654 ± 0.05236\n0.180935 ± 0.01718\n0.141428 ± 0.01171\n0.150079 ± 0.2911\n\nc\n1.28103 ± 0.0.04581\n0.779895 ± 0.01982\n0.558411 ± 0.01883\n0.466975 ± 0.03134\n\nreplacements\n\n1.3\n\n(a)\n\n3.0\n\nPSfrag replacements\n1.0\n\n2.5\n3.0\n\n2.5\n\n0\nhAsurf i/Aplanar\n\n2.0\n\n1.2\n\nA/A(t = 0)\n\n1.5\n\n1.1\n\n3.5\n\n2.0\n\nρu = 1.25 × 107 g cm−3\nρu = 2.5 × 107 g cm−3\nρu = 5 × 107 g cm−3\nρu = 7.5 × 107 g cm−3\n\n1.5\n1.0\n0\n\n200\n\n400\n\n600\n\n800\n\n1.0\n\nτ∆x\n\nreplacements\n\n(b)\n\n0.0\n\n1.0\n\n3.5\n\n(b)\n\n1.1\n\n1.0\nhσ(vu )i/sl\n\n1.5\n\nFig. 8. Dependence of the flame surface area on the strength of\nthe imprinted velocity fluctuations.\n\n1.2\n3.0\n\nA/A(t = 0)\n\n1.3\n\n2.5\n\n2.0\n\n1.5\n\n1.0\n\n(a)\n\n0.5\n\n0\n\n200\n\n400\n\n600\n\n800\n\nτ∆x\n\nFig. 6. Flame surface area over time (normalized to the crossing\ntime of the laminar flame over one grid cell τ∆x ) for (a) v′ /sl =\n0.7 and (b) v′ /sl = 2.5.\n\nwith the strength of the imprinted vortices in the fuel. As already shown for the case of flame propagation into quiescent\nfuel (Röpke et al., 2003a), the flame produces vorticity in the\nashes. Here, the question is addressed whether vorticity present\nin the fuel will be amplified in the flame.\n\nThe result of the study for a variety of fuel densities is\nplotted in Figure 9. In this plot, trends show up much more\nclearly than in Fig. 8. However, some scatter is still present in\nthe data. As can be seen from snapshots of the evolution of the\nflame front (an example is the bottom left snapshot in Fig. 4),\nthe merging of cusps can eventually produce transient \"bursts\"\nin the vorticity downstream of the flame. This is particularly\nprominent in case of changes in the long-wavelength flame\nstructure, but not necessarily connected to it. From Fig. 7d,\nwhere this \"burst\" in velocity fluctuation appears as a spike in\nthe profile, it can be concluded that the duration of those events\nis very short. Hence their contribution to the temporal mean is\nsmall (whereas the long-wavelength flame structure and thus\nthe flame surface changes slowly). Consequently, the scatter in\nplot 9 is much smaller than in plot 8.\nThe data plotted in Fig. 9 can be fit rather well by a linear relation between the ratio hσ(vb )/σ(vu )i and the incoming\nturbulence intensity, i.e.\nhσ(vb )i = b + chσ(vu )i.\n\n(8)\n\nTable 2 provides the fit parameters. In contrast to Figure 8, the\nplot in Figure 9 reveals a clear trend for the fuel density. The\nslope c increases with lower ρu . This is what would be expected\n\n\fF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\nThe above interpretation of this result requires some caution, since the cellular stabilization of the flame has been shown\nto be weaker with lower fuel density. However, this seems to\nbe a numerical rather than a physical effect, since the cusps become more stable with higher resolution. Thus, at the given resolution of our parameter study, the flame evolution shows peculiar behavior below a fuel density of 1.25 × 107 g cm−3 . Here,\ncusps may loose stability distorting the flame shape, which then\nresponds with accelerated propagation of the perturbed part for\na short period, after that the flame stabilizes again. However,\nwe do not observe such a flame evolution at higher fuel densities included in this parameter study. Thus, the dependency\non the fuel density is likely to be (at least partially) of physical\norigin.\n\nρu = 1.25 × 107 g cm−3\nρu = 2.5 × 107 g cm−3\nρu = 5 × 107 g cm−3\nρu = 7.5 × 107 g cm−3\n\n3.0\n\nplacements\n2.5\n0\nhσ(vb )i/sl\n\n11\n\n2.0\n\n1.5\n\n1.0\n\n4. Conclusions\n0.0\n\n0.5\n\n1.0\nhσ(vu )i/sl\n\nIn the presented simulations we performed the first attempt to\ninvestigate the interaction of cellular flames with turbulent velocity fluctuations in the context of SN Ia explosions. The results can be summarized as follows:\n\n1.5\n\nFig. 9. Relation between velocity fluctuations upstream and\ndownstream of the flame front.\n1.5\n\nc\n\n1.0\n\nplacements\n0.5\n\n0.0\n2.0\n\n2.5\n\n3.0\n\n3.5\n\nμ\n\nFig. 10. Ratio of the velocities upstream and downstream of the\nflame front as a function of the density contrast μ over it.\ntaking into account the increased production of specific volume\nacross the flame with lower ρu . In Fig. 10 the factor c is plotted against the corresponding density ratio μ, accentuating the\ntrend. Of course, a functional dependence cannot be inferred\nfrom this small sample of data. It is interesting to note that for\nρu ≈ 2.5 × 107 g cm−3 the slope c becomes greater than unity,\nindicating a slight amplification of velocity fluctuation in this\ncase.\n\n1. In case of the interaction of the flame with weak vortices\nin the fuel flow, the flame exhibits an evolution similar to\nthat observed in case of flame propagation into quiescent\nfuel. In the setup chosen for our simulations the flame front\nshowed a tendency to align in a single domain-filling cellular structure. Interaction with the incoming vortices leads to\na superposition of this fundamental structure with a cellular pattern of shorter wavelength. Similar to the simulations\npresented by Röpke et al. (2003b), where a cellular superposition of the basic flame structure was observed in case of\nwide computational domains, this does not lead to a destabilization of the domain-filling cell. In accord with theoretical predictions (Zel'dovich et al., 1980) the small superimposed perturbations are advected toward the cusp where\nthey disappear. The flow field accounting for this effect was\nstudied by Röpke et al. (2003a).\n2. If the cellularly stabilized flame interacts with vortices of\nsufficient strength, then the initial cellular pattern will break\nup in the sense that the initial shape is lost and the flame\nadapts to the incoming vortical flow. The tendency of the\nflame to form a single-cell structure is suppressed by this\neffect. However, we do not observe a sharp transition but\nrather a gradual change in the flame behavior.\n3. Our numerical simulations suggest that the flame smoothly\nadapts to the incoming vortical flow with increasing turbulence intensity. No drastic effects were observed. Although\nwe measured an amplification of the strength of the velocity fluctuation across the flame for ρu = 2.5 × 107 g cm−3 ,\nwe could not observe a deviation from a linear scaling between the flame surface area (and thus the effective flame\npropagation speed) and the strength of the imprinted velocity fluctuations.\nWe draw the conclusion that the results of our study are\nconsistent with flame propagation in the flamelet regime of\nturbulent combustion, at least at fuel densities above ρu ≈\n\n\f12\n\nF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\n2.5 × 107 g cm−3 . Thus, our study corroborates the assumption of flame stability at unresolved scales in large-scale SN\nIa explosion models. This is an important contribution that our\nsmall-scale model makes to the credibility of those simulations.\nThe slight amplification of the turbulent velocity fluctuations\nacross the flame at ρu = 2.5 × 107 g cm−3 (and possibly even\nmore pronounced below that value) may have no significant\nimpact on the current SN Ia models, since the flame width at\nthose densities will become non-negligible (cf. the data given\nby Timmes & Woosley 1992). Then the burning is expected to\nenter the distributed regime of turbulent combustion, whose\nsimulation requires completely different numerical methods.\nIn the context of SN Ia explosions, an approach to study this\nregime was discussed by Lisewski et al. (2000).\nAlthough the increase in effective flame propagation resulting from the cellular regime is negligible compared to the increase in flame speed at larger scales where the flame is affected by the turbulent cascade, it may be significant in the\nearly stages of the explosion. In the current large-scale models (e.g. Reinecke et al. 2002), the flame is assumed to propagate with its laminar flame velocity before the rising RayleighTaylor bubbles establish the turbulent cascade. This may cause\na problem with the nucleosynthetic yields from the SN Ia explosion (Reinecke, 2001). Since the laminar flame speed is very\nlow, the WD expands slowly in the beginning of the explosion and thus the combustion products remain at rather high\ndensities for a considerable time. This effect causes a neutronization of the material by electron capture and an overproduction of neutron-rich heavy nuclei (Nomoto & Kondo, 1991;\nBrachwitz et al., 2000), eventually even leading to a collapse\nof the star. Taking into account the velocity increase resulting from the cellular regime, this problem could be extenuated. As has been shown in this study, this may be in particular the case if strong velocity fluctuations left over from the\npre-ignition convection interact with the flame. However, the\nstrength of turbulence resulting from pre-ignition effects is not\nwell-determined yet. Höflich & Stein (2002) claim values as\nhigh as ∼107 cm s−1 . The impact of the cellular burning regime\non the nucleosynthesis yields of the SN Ia explosion models\nwill be investigated in a forthcoming study.\nEven though we can probably not completely rule out the\npossibility of active turbulent combustion, we found no convincing hint for such an effect in our numerical investigations.\nOur simulations indicate that effects resulting from the cellular regime of flame propagation are unlikely to trigger a presumed deflagration-to-detonation transition. Hence, the search\nfor active turbulent combustion and deflagration-to-detonation\ntransition should focus on the distributed burning regime.\nAcknowledgements. This work was supported in part by the European\nResearch Training Network \"The Physics of Type Ia Supernova\nExplosions\" under contract HPRN-CT-2002-00303 and by the DFG\nPriority Research Program \"Analysis and Numerics for Conservation\nLaws\" under contract HI 534/3. A pleasant atmosphere to prepare this publication was provided at the workshop \"Thermonuclear\nSupernovae and Cosmology\" at the ECT*, Trento, Italy. We would\nlike to thank M. Reinecke, S. Blinnikov, and W. Schmidt for stimulating discussions. The numerical simulations were performed on an\n\nIBM Regatta system at the computer center of the Max Planck Society\nin Garching.\n\nReferences\nArnett, W. D. 1969, Ap&SS., 5, 180\nBlinnikov, S. I. & Sasorov, P. V. 1996, Phys. Rev. E, 53, 4827\nBrachwitz, F., Dean, D. J., Hix, W. R., et al. 2000, ApJ, 536,\n934\nBychkov, V. & Liberman, M. A. 1995, A&A, 302, 727\nColella, P. & Woodward, P. R. 1984, J. Comput. Phys., 54, 174\nDamköhler, G. 1940, Z. f. Elektroch., 46, 601\nDarrieus, G. 1938, communication presented at La Technique\nModerne, Unpublished.\nFryxell, B. A., Müller, E., & Arnett, W. D. 1989, Hydrodynamics and nuclear burning, MPA Green Report 449,\nMax-Planck-Institut für Astrophysik, Garching\nGamezo, V. N., Khokhlov, A. M., Oran, E. S., Chtchelkanova,\nA. Y., & Rosenberg, R. O. 2003, Science, 299, 77\nGutman, S. & Sivashinsky, G. I. 1990, Physica D, 43, 129\nHelenbrook, B. T. & Law, C. K. 1999, Combustion and Flame,\n117, 155\nHillebrandt, W. & Niemeyer, J. C. 2000, ARA&A, 38, 191\nHöflich, P. & Khokhlov, A. 1996, ApJ, 457, 500\nHöflich, P. & Stein, J. 2002, ApJ, 568, 779\nHoyle, F. & Fowler, W. A. 1960, ApJ, 132, 565\nIwamoto, K., Brachwitz, F., Nomoto, K., et al. 1999, ApJS,\n125, 439\nKerstein, A. R. 1996, Combust. Sci. Technol., 118, 189\nLandau, L. D. 1944, Acta Physicochim. URSS, 19, 77\nLisewski, A. M., Hillebrandt, W., Woosley, S. E., Niemeyer,\nJ. C., & Kerstein, A. R. 2000, ApJ, 537, 405\nMarkstein, G. H. 1951, J. Aeronaut. Sci., 18, 199\nNiemeyer, J. C. 1999, ApJ, 523, L57\nNiemeyer, J. C. & Hillebrandt, W. 1995, ApJ, 452, 779\nNiemeyer, J. C. & Woosley, S. E. 1997, ApJ, 475, 740\nNomoto, K. & Kondo, Y. 1991, ApJ, 367, L19\nOsher, S. & Sethian, J. A. 1988, J. Comput. Phys., 79, 12\nPeters, N. 1986, in Twenty-First Symposium (International) on\nCombustion (Pittsburgh: The Combustion Institute), 1231–\n1250\nReinecke, M., Hillebrandt, W., & Niemeyer, J. C. 2002, A&A,\n391, 1167\nReinecke, M., Hillebrandt, W., Niemeyer, J. C., Klein, R., &\nGröbl, A. 1999, A&A, 347, 724\nReinecke, M. A. 2001, PhD thesis, Technical University of\nMunich\nRichardson, L. F. 1922, Weather prediction by numerical process (Cambridge: Cambridge University Press), (republished\nDover 1965)\nRöpke, F. K. 2003, PhD thesis, Technical University of\nMunich, available at http://tumb1.ub.tum.de/publ/diss/\nRöpke, F. K., Niemeyer, J. C., & Hillebrandt, W. 2003a, submitted to A&A\nRöpke, F. K., Niemeyer, J. C., & Hillebrandt, W. 2003b, ApJ,\n588, 952\nSmiljanovski, V., Moser, V., & Klein, R. 1997, Combustion\nTheory and Modelling, 1, 183\n\n\fF. K. Röpke et al.: Cellular Burning in SNe Ia-Flame Propagation into Vortical Fuel\n\nSussman, M., Smereka, P., & Osher, S. 1994, J. Comput. Phys.,\n114, 146\nThual, O., Frisch, U., & Hénon, M. 1985, J. Phys. (Paris), 46,\n1485\nTimmes, F. X. & Woosley, S. E. 1992, ApJ, 396\nVladimirova, N., Constantin, P., Kiselev, A., Ruchayskiy, O.,\n& Ryzhik, L. 2003, Combustion Theory and Modelling, (in\npress) Preprint available: physics/0212057\nZel'dovich, Y. B. 1966, Journal of Appl. Mech. and Tech.\nPhysics, 1, 68, english translation\nZel'dovich, Y. B., Istratov, A. G., Kidin, N. I., & Librovich,\nV. B. 1980, Combust. Sci. Technol., 24, 1\nZhu, J. & Ronney, P. D. 1994, Combust. Sci. Technolog., 100,\n183\n\n13\n\n\f"}