{"id": "http://arxiv.org/abs/astro-ph/0311388v1", "guidislink": true, "updated": "2003-11-17T14:53:20Z", "updated_parsed": [2003, 11, 17, 14, 53, 20, 0, 321, 0], "published": "2003-11-17T14:53:20Z", "published_parsed": [2003, 11, 17, 14, 53, 20, 0, 321, 0], "title": "An evolutionary model for pulsar-driven supernova remnants", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0311022%2Castro-ph%2F0311612%2Castro-ph%2F0311190%2Castro-ph%2F0311293%2Castro-ph%2F0311118%2Castro-ph%2F0311184%2Castro-ph%2F0311058%2Castro-ph%2F0311429%2Castro-ph%2F0311171%2Castro-ph%2F0311472%2Castro-ph%2F0311203%2Castro-ph%2F0311222%2Castro-ph%2F0311133%2Castro-ph%2F0311173%2Castro-ph%2F0311435%2Castro-ph%2F0311604%2Castro-ph%2F0311390%2Castro-ph%2F0311577%2Castro-ph%2F0311176%2Castro-ph%2F0311071%2Castro-ph%2F0311116%2Castro-ph%2F0311601%2Castro-ph%2F0311154%2Castro-ph%2F0311618%2Castro-ph%2F0311034%2Castro-ph%2F0311437%2Castro-ph%2F0311083%2Castro-ph%2F0311230%2Castro-ph%2F0311098%2Castro-ph%2F0311130%2Castro-ph%2F0311558%2Castro-ph%2F0311340%2Castro-ph%2F0311608%2Castro-ph%2F0311517%2Castro-ph%2F0311460%2Castro-ph%2F0311473%2Castro-ph%2F0311613%2Castro-ph%2F0311228%2Castro-ph%2F0311327%2Castro-ph%2F0311411%2Castro-ph%2F0311072%2Castro-ph%2F0311461%2Castro-ph%2F0311373%2Castro-ph%2F0311453%2Castro-ph%2F0311367%2Castro-ph%2F0311494%2Castro-ph%2F0311260%2Castro-ph%2F0311097%2Castro-ph%2F0311338%2Castro-ph%2F0311070%2Castro-ph%2F0311427%2Castro-ph%2F0311276%2Castro-ph%2F0311017%2Castro-ph%2F0311447%2Castro-ph%2F0311578%2Castro-ph%2F0311568%2Castro-ph%2F0311289%2Castro-ph%2F0311322%2Castro-ph%2F0311630%2Castro-ph%2F0311223%2Castro-ph%2F0311178%2Castro-ph%2F0311028%2Castro-ph%2F0311518%2Castro-ph%2F0311207%2Castro-ph%2F0311019%2Castro-ph%2F0311061%2Castro-ph%2F0311280%2Castro-ph%2F0311216%2Castro-ph%2F0311312%2Castro-ph%2F0311308%2Castro-ph%2F0311339%2Castro-ph%2F0311566%2Castro-ph%2F0311586%2Castro-ph%2F0311388%2Castro-ph%2F0311446%2Castro-ph%2F0311123%2Castro-ph%2F0311278%2Castro-ph%2F0311077%2Castro-ph%2F0311505%2Castro-ph%2F0311186%2Castro-ph%2F0311607%2Castro-ph%2F0311381%2Castro-ph%2F0311141%2Castro-ph%2F0311212%2Castro-ph%2F0311100%2Castro-ph%2F0311354%2Castro-ph%2F0311346%2Castro-ph%2F0311462%2Castro-ph%2F0311541%2Castro-ph%2F0311114%2Castro-ph%2F0311620%2Castro-ph%2F0311162%2Castro-ph%2F0311153%2Castro-ph%2F0311147%2Castro-ph%2F0311003%2Castro-ph%2F0311110%2Castro-ph%2F0311168%2Castro-ph%2F0311082%2Castro-ph%2F0311143%2Castro-ph%2F0311516%2Castro-ph%2F0311569&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An evolutionary model for pulsar-driven supernova remnants"}, "summary": "We present a model of a pulsar wind nebula evolving inside its associated\nsupernova remnant. The model uses a hydrodynamics code to simulate the\nevolution of this system when the pulsar has a high velocity. The simulation\ndistinguishes four different stages of pulsar wind nebula evolution: the\nsupersonic expansion stage, the reverse shock interaction stage, the subsonic\nexpansion stage and ultimately the bow shock stage. The simulation bears out\nthat, due to the high velocity of the pulsar, the position of the pulsar is\noff-centered with respect to its pulsar wind nebula, after the passage of the\nreverse shock. Subsequently the pulsar wind nebula expands subsonically untill\nthe event of the bow shock formation, when the motion of the pulsar becomes\nsupersonic. The bow shock formation event occurs at roughly half the crossing\ntime, when the pulsar is positioned at 0.677 times the radius of the supernova\nremnant blastwave, in complete agreement with analytical predictions. The\ncrossing time is defined by the age of the supernova remnant, when the pulsar\novertakes the blastwave bounding the supernova remnant.\n  The results of the model are applied to three supernova remnants: N157B,\nG327.1-1.1 and W44. We argue that the head of the pulsar wind nebula,\ncontaining the active pulsar, inside the first two systems are not bounded by a\nbow shock. However, in the case of W44 we argue for a scenario in which the\npulsar wind nebula is bounded by a bow shock, due to the supersonic motion of\nthe pulsar.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0311022%2Castro-ph%2F0311612%2Castro-ph%2F0311190%2Castro-ph%2F0311293%2Castro-ph%2F0311118%2Castro-ph%2F0311184%2Castro-ph%2F0311058%2Castro-ph%2F0311429%2Castro-ph%2F0311171%2Castro-ph%2F0311472%2Castro-ph%2F0311203%2Castro-ph%2F0311222%2Castro-ph%2F0311133%2Castro-ph%2F0311173%2Castro-ph%2F0311435%2Castro-ph%2F0311604%2Castro-ph%2F0311390%2Castro-ph%2F0311577%2Castro-ph%2F0311176%2Castro-ph%2F0311071%2Castro-ph%2F0311116%2Castro-ph%2F0311601%2Castro-ph%2F0311154%2Castro-ph%2F0311618%2Castro-ph%2F0311034%2Castro-ph%2F0311437%2Castro-ph%2F0311083%2Castro-ph%2F0311230%2Castro-ph%2F0311098%2Castro-ph%2F0311130%2Castro-ph%2F0311558%2Castro-ph%2F0311340%2Castro-ph%2F0311608%2Castro-ph%2F0311517%2Castro-ph%2F0311460%2Castro-ph%2F0311473%2Castro-ph%2F0311613%2Castro-ph%2F0311228%2Castro-ph%2F0311327%2Castro-ph%2F0311411%2Castro-ph%2F0311072%2Castro-ph%2F0311461%2Castro-ph%2F0311373%2Castro-ph%2F0311453%2Castro-ph%2F0311367%2Castro-ph%2F0311494%2Castro-ph%2F0311260%2Castro-ph%2F0311097%2Castro-ph%2F0311338%2Castro-ph%2F0311070%2Castro-ph%2F0311427%2Castro-ph%2F0311276%2Castro-ph%2F0311017%2Castro-ph%2F0311447%2Castro-ph%2F0311578%2Castro-ph%2F0311568%2Castro-ph%2F0311289%2Castro-ph%2F0311322%2Castro-ph%2F0311630%2Castro-ph%2F0311223%2Castro-ph%2F0311178%2Castro-ph%2F0311028%2Castro-ph%2F0311518%2Castro-ph%2F0311207%2Castro-ph%2F0311019%2Castro-ph%2F0311061%2Castro-ph%2F0311280%2Castro-ph%2F0311216%2Castro-ph%2F0311312%2Castro-ph%2F0311308%2Castro-ph%2F0311339%2Castro-ph%2F0311566%2Castro-ph%2F0311586%2Castro-ph%2F0311388%2Castro-ph%2F0311446%2Castro-ph%2F0311123%2Castro-ph%2F0311278%2Castro-ph%2F0311077%2Castro-ph%2F0311505%2Castro-ph%2F0311186%2Castro-ph%2F0311607%2Castro-ph%2F0311381%2Castro-ph%2F0311141%2Castro-ph%2F0311212%2Castro-ph%2F0311100%2Castro-ph%2F0311354%2Castro-ph%2F0311346%2Castro-ph%2F0311462%2Castro-ph%2F0311541%2Castro-ph%2F0311114%2Castro-ph%2F0311620%2Castro-ph%2F0311162%2Castro-ph%2F0311153%2Castro-ph%2F0311147%2Castro-ph%2F0311003%2Castro-ph%2F0311110%2Castro-ph%2F0311168%2Castro-ph%2F0311082%2Castro-ph%2F0311143%2Castro-ph%2F0311516%2Castro-ph%2F0311569&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a model of a pulsar wind nebula evolving inside its associated\nsupernova remnant. The model uses a hydrodynamics code to simulate the\nevolution of this system when the pulsar has a high velocity. The simulation\ndistinguishes four different stages of pulsar wind nebula evolution: the\nsupersonic expansion stage, the reverse shock interaction stage, the subsonic\nexpansion stage and ultimately the bow shock stage. The simulation bears out\nthat, due to the high velocity of the pulsar, the position of the pulsar is\noff-centered with respect to its pulsar wind nebula, after the passage of the\nreverse shock. Subsequently the pulsar wind nebula expands subsonically untill\nthe event of the bow shock formation, when the motion of the pulsar becomes\nsupersonic. The bow shock formation event occurs at roughly half the crossing\ntime, when the pulsar is positioned at 0.677 times the radius of the supernova\nremnant blastwave, in complete agreement with analytical predictions. The\ncrossing time is defined by the age of the supernova remnant, when the pulsar\novertakes the blastwave bounding the supernova remnant.\n  The results of the model are applied to three supernova remnants: N157B,\nG327.1-1.1 and W44. We argue that the head of the pulsar wind nebula,\ncontaining the active pulsar, inside the first two systems are not bounded by a\nbow shock. However, in the case of W44 we argue for a scenario in which the\npulsar wind nebula is bounded by a bow shock, due to the supersonic motion of\nthe pulsar."}, "authors": ["E. van der Swaluw", "T. P. Downes", "R. Keegan"], "author_detail": {"name": "R. Keegan"}, "author": "R. Keegan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20035700", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0311388v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0311388v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 8 figures, submitted to A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0311388v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0311388v1", "journal_reference": "Astron.Astrophys.420:937-944,2004", "doi": "10.1051/0004-6361:20035700", "fulltext": "An evolutionary model for pulsar-driven supernova remnants\na hydrodynamical model\nE. van der Swaluw1,2 , T.P. Downes3 , and R. Keegan3\n1\n2\n\narXiv:astro-ph/0311388v1 17 Nov 2003\n\n3\n\nDublin Institute for Advanced Studies, 5 Merrion Square, Dublin 2, Ireland\nFOM-Institute for Plasma Physics Rijnhuizen, P.O. Box 1207, 3430 BE Nieuwegein, The Netherlands\nSchool of Mathematical Sciences, Dublin City University, Glasnevin, Dublin 9, Ireland\n\nAbstract. We present a model of a pulsar wind nebula evolving inside its associated supernova remnant. The\nmodel uses a hydrodynamics code to simulate the evolution of this system when the pulsar has a high velocity. The\nsimulation distinguishes four different stages of pulsar wind nebula evolution: the supersonic expansion stage, the\nreverse shock interaction stage, the subsonic expansion stage and ultimately the bow shock stage. The simulation\nbears out that, due to the high velocity of the pulsar, the position of the pulsar is off-centered with respect to\nits pulsar wind nebula, after the passage of the reverse shock. Subsequently the pulsar wind nebula expands\nsubsonically untill the event of the bow shock formation, when the motion of the pulsar becomes supersonic.\nThe bow shock formation event occurs at roughly half the crossing time, when the pulsar is positioned at 0.677\ntimes the radius of the supernova remnant blastwave, in complete agreement with analytical predictions. The\ncrossing time is defined by the age of the supernova remnant, when the pulsar overtakes the blastwave bounding\nthe supernova remnant.\nThe results of the model are applied to three supernova remnants: N157B, G327.1-1.1 and W44. We argue that\nthe head of the pulsar wind nebula, containing the active pulsar, inside the first two systems are not bounded by\na bow shock. However, in the case of W44 we argue for a scenario in which the pulsar wind nebula is bounded by\na bow shock, due to the supersonic motion of the pulsar.\nKey words. Pulsars – Supernova Remnants – Shocks – Hydrodynamics\n\n1. Introduction\nA supernova remnant (SNR) is the relic of a supernova\nexplosion, which injects an energy of ∼ 1051 erg into the\nsurrounding medium. The dynamics of a young SNR expanding into the interstellar medium (ISM) is determined\nby two shocks: a forward shock which propagates into the\nISM and is being decelerated by sweeping up material\nfrom the ISM, and a reverse shock which results from the\nhigh pressure behind the forward shock and propagates\nback into the freely expanding ejecta of the SNR (McKee\n1974; McKee & Truelove 1995).\nA young SNR becomes dynamically more interesting in\nthose cases where the collapse of the progenitor star, preceding the supernova explosion, yields a pulsar: a rapidly\nrotating neutron star. In those cases the dynamics of the\ncentral region of the SNR is dominated by the continuous injection of energetic particles by a relativistic pulsar\nwind, driven by the spin-down energy of the pulsar. The\npulsar wind is terminated by a strong MHD shock (Rees\nSend offprint requests to: E. van der Swaluw, e-mail:\nswaluw@rijnh.nl\n\n& Gunn 1974), and drives a pulsar wind nebula (PWN)\nin the interior of the young SNR. The dynamics of the\nPWN is coupled to the evolution of the SNR, because\nthe total energy release over the pulsar's lifetime is small\n(∼ 1049 − 1050 erg) compared with the total mechanical\nenergy of the SNR (∼ 1051 erg).\nSeveral authors (Reynolds & Chevalier 1984; van der\nSwaluw et al. 2001; Blondin et al. 2001; Bucciantini et al.\n2003) have considered the evolution of a centered PWN\ninside an evolving SNR. In these systems, the initial stage\nof the PWN is the supersonic expansion stage: the pulsar\nwind bubble is bounded by a strong PWN shock propagating through the freely expanding ejecta of the SNR.\nA transition to the reverse shock interaction stage takes\nplace when the reverse shock collides with the PWN shock,\nand subsequently crushes the pulsar wind bubble (van der\nSwaluw et al. 2001, Blondin et al. 2001). This reverse shock\ninteraction stage is characterised by an unsteady expansion of the pulsar wind bubble (van der Swaluw et al.\n2001), due to the reverberations from the violent collision\nbetween the reverse shock and the PWN shock. The expansion of the PWN proceeds subsonically when these re-\n\n\fverberations have vanished. The expansion is subsonic because the surroundings of the PWN have been reheated by\nthe passage of the reverse shock: the PWN shock, bounding the swept-up shocked ejecta around the hot pulsar\nwind bubble, has disappeared.\nIn this paper we discuss the evolution of PWNe inside SNRs, for pulsars with a constant kick velocity: initially the PWN starts its expansion at the center of the\nSNR, however the pulsar motion will move the pulsar wind\ncavity along as it moves through the SNR interior. We\npresent results from hydrodynamical simulations for such\na system, which distinguishes all three evolutionary stages\nmentioned above, i.e. the supersonic expansion stage, the\nreverse shock interaction stage and the subsonic expansion\nstage. However at the end of the simulation an additional\nstage can be distinguished, when the head of the PWN,\ncontaining the active pulsar, deforms into a bow shock,\ndue to the supersonic motion of the pulsar.\nThe supersonic expansion stage in the simulation\nshows a PWN which is off-centered with respect to the\ntwofold shock structure of the SNR, due to the kick velocity of the pulsar. Therefore the timescale on which the\nreverse shock collides with the complete shock surface,\nbounding the PWN, can be a significant fraction of the\ntotal lifetime of the PWN when the reverse shock interaction stage starts. We use a semi-analytical approach to\nestimate the timescale of the collision process, which is\nshown to scale roughy with the pulsar velocity. The results from the simulation are in almost complete agreement with these semi-analytical calculations. Due to the\nhigh velocity of the pulsar, its position inside the PWN\nis strongly off-centered after the passage of the reverse\nshock. Ultimately, at the end of the simulation, when the\npulsar is approaching the shell of its SNR, the head of\nthe PWN, containing the active pulsar, is deformed into a\nbow shock at a time and position, in complete agreement\nwith analytical predictions made by van der Swaluw et al.\n(1998).\nWe determine the evolutionary stage of the PWNe inside the SNRs N157B, G327.1-1.1 and W44, using our\nmodel. For the first two systems, we argue that the position of the pulsar at the head of its PWN, is a result\nof the passage of the reverse shock and the high velocity\nof the pulsar: the head of these PWNe are not bounded\nby a bow shock. Therefore these PWNe are either in the\nreverse shock interaction stage or the subsonic expansion\nstage. The PWN inside the SNR W44 however, is shown\nto be a good candidate for having a bow shock nebula\naround its pulsar.\n\nof the SNR. A transition to the subsonic expansion stage\noccurs via the reverse shock interaction stage. This interaction stage starts when the reverse shock collides with the\nPWN shock. In the case of a centered pulsar (Vpsr = 0),\nthe reverse shock collides with the PWN shock surface instantaneously, due to the spherical symmetry of the SNR\nand the PWN. However, when the pulsar has a kick velocity, there will be an associated timescale on which the\nreverse shock collides with the complete surface of the\nPWN shock. This is the first stage of the reverse shock\ninteraction stage. Next, the pulsar wind bubble oscillates\nback and forward due to the presence of reverberations\nfrom the passage of the reverse shock (van der Swaluw et\nal. 2001). The reverse shock interaction stage ends when\nthese reverberations have vanished and the pulsar wind\nbubble proceeds its expansion subsonically. In this section\nwe use a semi-analytical approach to derive a timescale on\nwhich the reverse shock collides with the complete surface\nof the PWN shock.\nMcKee & Truelove (1995) give analytical approximations for the trajectories of the forward shock and the\nreverse shock of a SNR in the case of a uniform ambient medium. Their equations for the trajectories of both\nshocks are normalised to a timescale tST , which marks the\nage of the remnant when it has swept up roughly 1.61 the\nejected mass Mej. Their equations descibe the expansion\nof an isolated SNR in the free expansion stage and the\nSedov-Taylor stage. The trajectory of the forward shock\nconverges to the Sedov-Taylor solution when the SNR age\nt >> tST . Internal (radiative) cooling is not inlcuded in\ntheir model, therefore the pressure-driven snowplow stage\nis not described (see however Blondin et al. 1998).\nThe reverse shock hits the center of the SNR at approximately 5 times the transition time tST , putting an upper\nlimit on the age tcol , when the reverse shock has collided\nwith the complete shock surface bounding the PWN:\n\n2. The evolution of a PWN inside a SNR\n\nRpwn (t) ≃ 0.889\n\n2.1. The interaction between the reverse shock and\nthe PWN shock\nThe initial stage of PWN evolution is characterised by\na hot pulsar wind bubble, bounded by a strong PWN\nshock, propagating through the freely expanding ejecta\n\n−1/2\n\ntcol ≃ 5tST = 1 045E51\n\n\u0012\n\nMej\nM⊙\n\n\u00135/6\n\n−1/3\n\nn0\n\nyears , (1)\n\nhere E51 is the total mechanical energy of the SNR in\nunits of 1051 erg and n0 is the ambient hydrogen number\ndensity assuming an interstellar composition of 10 H : 1\nHe. The above timescale is very close to the one given by\nReynolds& Chevalier (1984).\nAn equation for the radius of the PWN shock, when\nit is interacting with the freely expanding ejecta of its\nSNR was given by van der Swaluw et al. (2001), where a\nconstant pulsar wind luminosity Lpw = L0 was taken:\n\u0012\n\nL0 t\nE0\n\n\u00131/5\n\nV0 t ∝ t6/5 ,\n\n(2)\n\nhere E0 is the total mechanical energy of the SNR and V0\nis defined as:\ns\n10 E0\n.\n(3)\nV0 =\n3 Mej\n\n\fForward\nShock\n\nReverse\nShock\nFront PWN\nshock\nBack PWN\nshock\n\nFig. 1. Radii of the forward and the reverse shocks of a\nSNR with an explosion energy of E0 = 1051 erg and a total ejected mass of Mej = 3 M⊙ . The dashed lines indicate\nf\nb\nthe position of the front (Rpwn\n) and the back (Rpwn\n) of\nthe PWN shock. The luminosity of the pulsar wind is constant, L0 = 1038 ergs/sec and the velocity of the pulsar\nequals Vpsr = 1 000 km/sec. The timescale on which the\nreverse shock collides with the complete shock surface of\nthe PWN equals ∆tcol ≃ 1 050 years. This timescale is of\nthe same order as the age of the PWN, t ≃ 1 200 years,\non which the reverse shock interaction stage starts.\nWe have taken the case for which the adiabatic heat ratio\nof the pulsar wind material equals γpwn = 5/3.\nWe will use the equations for the trajectories of the\nforward and the reverse shock of the SNR from Truelove\n& McKee (1995) and the above equation for the radius\nof the PWN shock to calculate the collision time tcol , i.e.\nwhen the reverse shock collides with the PWN shock. We\nmake a distinction between the front of the PWN shock\nf\nRpwn\n= Rpwn + Vpsr t, and the back of the PWN shock\nb\nRpwn = Rpwn − Vpsr t, which enables us to calculate ∆tcol ,\nthe timescale on which the reverse shock collides with the\ncomplete shock surface bounding the PWN. This approach\nneglects the change in the PWN expansion due to the displacement of the pulsar inside the freely expanding ejecta.\nFigure 1 shows an example of this approach, where the position of the four different shocks are plotted as a function\nof time. The parameters have been taken similarly to the\nparameters which we will use in the simulation. The figure\nshows that the timescale on which the reverse shock collides with the complete PWN shock surface equals ∆tcol ≃\n1050 years. Figure 2 shows ∆tcol as a function of the pulsar\nvelocity, where one observes that this timescale correlates\nalmost linearly with the pulsar velocity. We conclude that\nthe collision timescale ∆tcol of PWNe containing a high ve-\n\nFig. 2. The timescale ∆tcol on which the reverse shock collides with the complete shock surface bounding the PWN,\nas a function of the pulsar velocity. Apart from the velocity, the same parameters have been taken as in figure 1.\nlocity pulsar, can be a significant fraction of the timescale\nassociated with the supersonic expansion stage.\n\n2.2. The formation of the PWN bow shock\nAfter the passage of the reverse shock the PWN consists\nof two distinct parts:\n– The roughly spherically symmetric PWN relic, from\nthe initial energetic stage of the pulsar wind, which\nwill ultimately expand subsonically, after the reverberations of the reverse shock have vanished.\n– The relic PWN connects with the head of the PWN,\ndirected towards the shell of the remnant. The head of\nthe PWN contains the active pulsar, which propagates\ntowards the SNR shell.\nThe age of the remnant when the pulsar overtakes the\nshell of its remnant was given by van der Swaluw et al.\n(2003):\n1/3\n\n−5/3 −1/3\n\ntcr ≃ 1.4 × 104 E51 V1000 n0\n\nyears.\n\n(4)\n\nV1000 denotes the velocity of the pulsar in units of 1000\nkm/sec. This timescale was calculated in the limit of a\nSedov-Taylor SNR, i.e. it is assumed that the pulsar will\nbreak through the shell of the remnant, when radiative\nlosses of the SNR are neglible.\nWe follow van der Swaluw et al. (1998) by calculating\nthe Mach number Mpsr of the pulsar as it propagates\nthrough the SNR interior, using the Sedov-Taylor solution\n\n\fFig. 3. The Mach number of the pulsar Mpsr , as a function of the SNR age t scaled to the crossing time tcr of\nthe pulsar. The event of bow shock formation (Mpsr = 1)\noccurs at t = 0.5tcr.\n(Sedov 1959). Figure 3 shows the Mach number Mpsr as\na function of the age of the remnant t, normalised to the\ncrossing time tcr . Alternatively Figure 4 shows the Mach\nnumber Mpsr as a function of the position of the pulsar\nRpsr , normalised to the position of the SNR blastwave\nRsnr .\nThe figures show that the PWN head, containing the\nactive pulsar, is deformed into a bow shock (i.e. when\nMpsr = 1), at half the crossing time when the pulsar is\npositioned at a radius of 0.677 times the radius of the SNR\nblastwave. The Mach number will slowly increase after the\nformation of the bow shock, due to the decrease of the\nsound speed, as the PWN is approaching the shell of the\nremnant. When the pulsar breaks through the shell, the\nMach number equals Mpsr = √75 ≃ 3.13 (van der Swaluw\net al. 2003).\nA lower limit for the pulsar velocity can be derived,\nsuch that the bow shock formation occurs while the SNR\nis in the Sedov-Taylor stage. We follow van der Swaluw et\nal. (2003), who already give a lower limit for the pulsar\nvelocity in order for the pulsar to cross the SNR shell\nin its Sedov-Taylor stage. They use the transition time\ncalculated by Blondin et al. (1998), as the age of the SNR\nwhen the transition from the Sedov-Taylor stage to the\npressure-driven snowplow stage occurs:\n4/17 −9/17\n\ntPDS = 2.9 × 104 E51 n0\n\nyr.\n\n(5)\n\nOur results show that the bow shock creation occurs at\nhalf the crossing time, therefore the requirement 0.5tcr ≤\n\nFig. 4. The Mach number of the pulsar Mpsr as a function of the ratio of the pulsar position Rpsr and the SNR\nblastwave Rsnr . The bow shock formation of the SNR. The\nevent of the bow shock formation (Mpsr = 1) occurs at\nRpsr /Rsnr ≃ 0.677.\ntPDS yields a lower limit for the pulsar velocity to let the\nbow shock formation event occur when the SNR is in its\nSedov-Taylor stage:\n2/17\n\nVpsr ≥ 325 n0\n\n1/17\n\nE51\n\nkm/s ,\n\n(6)\n\nwhich is a reasonable fraction of the observed pulsar velocities by Hansen and Phinney (1997).\n\n3. Numerical Simulations\n3.1. Simulation method\nWe use a second order, properly upwinded hydrodynamics code (described in Downes & Ray,1999) to simulate the\ndynamics of the interaction between a pulsar wind and a\nsupernova remnant when the pulsar has a high velocity.\nThe hydrodynamics equations are intergrated in cylindrical symmetry, and the boundary conditions are taken as\ngradient zero everywhere except on the r = 0 boundary,\nwhere they are set to reflecting.\n\n3.2. Initialising the system\nThe simulations are performed in the rest frame of the\npulsar. The pulsar velocity equals Vpsr = 1 000 km/sec.\nInitially, the ambient density and pressure are uniform\nwith a uniform velocity of 1 000 km s−1 in the negative\nz direction. The ambient density is ρ0 = 10−24 g/cm−3\n\n\fFig. 5. Logarithmic gray-scale plot of the density distribution at an age tsnr = 1 000 years.\n(corresponding with n0 ≃ 0.427), and the pressure is chosen so that the ambient temperature is T = 1 × 105 K.\nThe resolution is taken as ∆r = ∆z = 3.6 × 1016 cm.\nAn exanding SNR is created by initialising a sphere\nof radius 0.25 pc, or 21 grid cells, with a high thermal\nenergy and density such that the total energy contained\nin the sphere is E0 = 1051 ergs, while the ejecta mass is\nMej = 3M⊙ . Note that this material also has a velocity of\n1 000 km s−1 in the negative z direction.\nThe source of the pulsar wind is modeled as a small\nsphere of radius 0.175 pc (15 grid cells) into which thermal\nenergy is deposited at a rate of Lpw = 1038 erg/s. Mass\nis also deposited into this region at a rate chosen such\nthat the pulsar wind terminal velocity is v∞ = 30 000 km\ns−1 . The pulsar wind luminosity has been taken constant,\nin order to resolve the pulsar wind termination shock\nthroughout the simulation. The results of the simulation\nwill not change qualitatively, because the total injected\nenergy by the pulsar during its stay in the SNR interior\nEpw = Lpw tcr ≪ E0 .\n\n3.3. The reverse shock interaction stage\nThe initial stage of the PWN evolution is the supersonic\nexpansion stage. Figure 5 shows the density profile of\nthe PWN/SNR system during this stage. One can clearly\ndistinguish the four different shocks of the system: the\npulsar wind termination shock, the PWN shock, the reverse shock and the forward shock. One clearly observes\nthe off-centered position of the PWN with respect to the\ntwofold shock structure of the SNR, caused by the motion of the pulsar. Furthermore the pulsar wind cavity is\nroughly spherically symmetric. This results from the high\nsound speed inside the pulsar wind bubble, which smooths\nout pressure perturbations rapidly, yielding an almost uniform pressure distribution in the PWN.\nFigure 6 shows the density profile of the PWN/SNR\nsystem, when the front of the PWN shock has already\ncollided with the reverse shock. At this stage the pulsar\nposition starts to get off-centered with respect to the PWN\n\nstructure. This is caused by the reverse shock interaction,\nwhich raises the presssure inside the disturbed parts of\nthe bubble, which results in pulsar wind material flowing towards the back of the PWN. Furthermore the increase in the pressure inside the front part of the pulsar\nwind bubble, pushes the forward termination shock backwards (towards the pulsar) as well. On the other hand,\nthe downstream pressure at the backward termination\nshock has not been influenced by the reverse shock interaction yet. Therefore the pulsar wind cavity structure\nis no longer spherically symmetric as can be seen in Figure\n6. The total time on which the reverse shock collides with\nthe complete shock structure bounding the pulsar wind\nbubble equals ∆tcol ≃ 1 200 years in the simulation, after which the age of the SNR equals t ≃ 2 400 years.\nThese timescales are in almost complete agreement with\nthe analysis performed in section 2.1 of this paper, which\nvalidates the approach made in that section, to derive the\ncollision timescale ∆tcol .\nFigure 7 shows the PWN/SNR system shortly after\nthe passage of the reverse shock. The pulsar is positioned\nat the head of the PWN, due to the passage of the reverse\nshock and the high velocity of the pulsar. The PWN structure consists of roughly two parts, a relic PWN and the\nhead of the PWN, as was described in section 2.2 of this\npaper. After the passage of the reverse shock, the reverse\nshock interaction stage is continued by the reflected and\ntransmitted shock waves, which propagate through both\nthe pulsar wind bubble and the surrounding ejecta of the\nSNR. This stage was described in detail by van der Swaluw\net al. (2001) for a spherically symmetric PWN/SNR system. We observe a qualitatively similar process, in which\nthe pulsar wind bubble is oscillating. The dynamics are\nmore complicated compared with the simulations of van\nder Swaluw et al. (2001), due to the asymmetry of the\nPWN/SNR system caused by the motion of the pulsar.\nDuring this stage of the reverse shock interaction, the\nPWN is oscillating between expansion and compression\nand the simulations reveal Rayleigh-Taylor and KelvinHelmholtz instabilities. These instabilities lead to the mix-\n\n\fFig. 6. Logarithmic gray-scale plot of the density distribution at an age tsnr = 1 800 years.\ning of ejecta and pulsar wind material, as was similarly\nobserved in the simulations performed by Blondin et al.\n(2001). Therefore at the end of the reverse shock interaction stage, the relic PWN consists of a mixture of pulsar\nwind material and ejecta. In our simulation the relic PWN\nwill move off the grid, before the bow shock formation occurs around the head of the PWN.\n\n3.4. The formation of the bow shock\nAt the end of the simulation, as the pulsar approaches\nthe shell of the SNR, the head of the PWN, containing\nthe active pulsar, deforms into a bow shock, due to the\nsupersonic motion of the pulsar. The simulation shows\nthat the bow shock formation event occurs at roughly t ≃\n0.5tcr , when the position of the pulsar Rpsr with respect to\nthe radius of the blastwave Rsnr equals Rpsr /Rsnr ≃ 0.677.\nThis clearly demonstrates the validity of the analytical\napproximation made in section 2.2 of this paper. Figure 8\nshows the density profile of the PWN/SNR system after\nthe bow shock formation. The curvature of the SNR shock\nis small compared with the bow shock structure, which\nvalidates the assumptions made by van der Swaluw et al.\n(2003) to model the break-through event.\n\n4. Observations\nAfter the passage of the reverse shock, the PWN consists\nof a relic PWN and the head of the PWN, containing the\nactive pulsar. The figures 7 and 8 show the density profiles\nof the PWN/SNR before and after the formation of the\nbow shock. For both cases the pulsar is located inside the\nhead of the PWN. The synchrotron maps from PWNe\nwill therefore show a similar morphology, which makes it\nhard to determine the presence of a bow shock based on\nthe observed PWN/SNR morphology. However, we have\ndemonstrated that the following criteria can be used to\ndetermine the presence of a bow shock around the head\nof the PWN:\n\n– The ratio between the position of the pulsar Rpsr with\nrespect to the position of the forward shock of the SNR\nRsnr has to satisfy Rpsr /Rsnr ≥ 0.677\n– The age of the remnant has to be larger then half the\ncrossing time, i.e. t > 0.5tcr .\nWe will apply the above two criteria to three SNRs:\nN157B, G327.1-1.1 and W44. We will argue that the head\nof the PWNe inside the first two SNRs are not bounded by\na bow shock, and therefore these PWNe are in either the\nreverse shock interaction stage or the subsonic expansion\nstage. The PWN inside SNR W44 is shown to be the best\ncandidate of a PWN in the bow shock stage.\n\n4.1. The pulsar wind nebula inside N157B\nN157B is a young SNR dominated by plerionic emission\nfrom the PWN inside this remnant. The age of the remnant is approximated to be 5 000 yrs (Wang & Gotthelf\n1998) and contains a 16 ms pulsar (Marshall et al. 1998).\nThe velocity of the pulsar is high (Vpsr ≃ 1 000 km/sec), if\none assumes that the pulsar was born at the central region\nof the bright radio emission (Lazendic et al. 2000).\nWang & Gotthelf (1998) argue for a bow shock interpretation of the PWN in N157B: the supersonic motion of\nthe pulsar has deformed the PWN around the pulsar into\na bow shock. In this scenario the SNR N157B is a young\nvariant of the SNR CTB80, which is thought to have a\nPWN bow shock located close to the shell of the remnant (see e.g. Strom 1987; Kulkarni et al. 1988; Migliazzo\net al. 2003). It is remarkable though, that the spindown\nluminosity of the pulsar inside N157B (L0 ≃ 4.8 × 1038\nergs/sec) is so much higher compared with the spindown\nluminosity from the pulsar inside CTB80 (L0 ≃ 4.0 × 1036\nergs/sec). If there is a bow shock around the PWN inside\nN157B, this implies that an upper limit for the age of the\nSNR, when the pulsar crosses the shell, is approximately\n10 000 years (using the current age of 5 000 years and\nthe criterion that bow shock creation occurs at half the\ncrossing time). This is again a remarkable contrast with\nthe current age of CTB80 of 100 000 years, which is close\n\n\fFig. 7. Logarithmic gray-scale plot of the density distribution at an age tsnr = 3 000 years.\nto the crossing time of this SNR. Furthermore from figure 2 of Wang et al. (2001) it seems like the position of\nthe pulsar is more or less centered in the SNR. This is\nin contrast with what one would expect from the analysis performed in section 2.2 of this paper, which predicts\nRpsr /Rsnr ≥ 0.677.\nWe propose a scenario for SNR N157B in which the\ncontradictions mentioned above disappear. Following the\nresults from sections 2 and 3, we suggest that the central\nbright parts of the radio and X-ray emission inside N157B\ncorrespond with the relic PWN, being blown in the initial\nstage of the PWN, when it was expanding supersonically.\nThe PWN inside N157B has just collided with the reverse\nshock, this collision and the high velocity of the pulsar has\noff-centered the pulsar with respect to the PWN structure\nas was discussed in the sections 2 and 3.3 of this paper.\nTherefore the head of the PWN is not bounded by a bow\nshock: the PWN is in the aftermath of the reverse shock\ninteraction stage or in the beginning of the subsonic expansion stage.\n\n4.2. The pulsar wind nebula inside G327.1-1.1\nAnother example of a young SNR, containing a PWN with\nthe position of the pulsar off-centered with respect to its\nPWN is G327.1-1.1. There has not been a pulsar detected\ninside this remnant so far. Sun et al. (1999) presented a\nradio contour map using MOST data overlaid with X-ray\ndata from ROSAT. The X-ray emission is centered around\na finger of radio emission sticking out of a central radio\nbright region, indicating the presence of a pulsar wind.\nFollowing Sun et al. (1999) the SNR can be modelled in Xrays by the following set of parameters: E51 = 0.23, n0 =\n0.10, Vpsr =600km/sec and an age of t = 1.1 × 104 . Using\nequation (4) to calculate tcr we get a value of 4.3 × 104\nyears. The age of the system therefore is less than half\nthe crossing time, implying the absence of a bow shock.\nFurthermore the displacement of the PWN finger (i.e. the\nhead of the PWN), containing the pulsar, does not satisfy\nthe other criterion for the presence of a bow shock, i.e.\n\nRpsr /Rsnr ≥ 0.677. This criterion is less restrictive, since\none might introduce an angle between the pulsar velocity\nand the observer such that the ratio Rpsr /Rsnr ≥ 0.677.\nNotice however that this will not influence the age of the\nremnant!\nTherefore we propose a scenario for G327.1-1.1 in\nwhich there is no bow shock around the head of the PWN:\nthe pulsar has been positioned at he head of the PWN due\nto the high velocity pulsar and the passage of the reverse\nshock. The central bright part of the remnant corresponds\nwith the relic PWN. The finger of the PWN corresponds\nwith the head of the PWN, which contains the active pulsar. Because of the larger value of the ration Rpsr /Rsnr\nand the larger age with respect to the PWN inside SNR\nN157B we favour the scenario where the PWN is in its\nsubsonic expansion stage.\n\n4.3. The pulsar wind nebula inside W44\nThe SNR W44 is an older remnant then the previous\ntwo SNRs discussed. Furthermore only a small fraction\nof the radio emission from this remnant is characterised\nby plerionic emission (Frail et al. 1996). Taking the characteristic age of the pulsar, 20 000 years (Wolszcan et al.\n1991), as the age of this remnant yields an upper limit\nof tcr ≃ 40 000 years for the crossing time of this remnant. This age is much closer to the age of the SNR\nCTB80. The displacement of the pulsar position only\nmarginally violates the condition for bow shock formation, i.e. Rpsr /Rsnr ≥ 0.677. We therefore conclude that\nthe PWN observed in the SNR W44 corresponds with the\nhead of the PWN, which has been deformed into a bow\nshock.\n\n5. Conclusions\nWe have considered the case of a PWN interacting with a\nSNR, for which the associated pulsar is moving at a high\nvelocity through the interior of its SNR. The model we discussed made use of a hydrodynamics code. One could dis-\n\n\fFig. 8. Logarithmic gray-scale plot of the density distribution at an age tsnr = 11 400 years.\ntinguish four different stages in the simulation: the supersonic expansion stage, the reverse shock interaction stage,\nthe subsonic expansion stage and the bow shock stage.\nBelow we summarise the most important results from our\nmodel:\n– The reverse shock interaction stage starts when the reverse shock collides with the front of the PWN shock.\nThe timescale on which the reverse shock collides with\nthe complete PWN shock, bounding the pulsar wind\nbubble, scales with the pulsar velocity. This timescale\nis a significant fraction of the lifetime of the PWN,\nwhen the reverse shock interaction stage starts, for\nPWNe containing a high velocity pulsar.\n– The high velocity of the pulsar results in an offcentered position of the pulsar with respect to its pulsar wind bubble, after the passage of the reverse shock.\n– The morphology of a PWN, after the passage of the reverse shock, consists of a twofold structure which ultimately expands subsonically inside the relaxed SedovTaylor SNR:\n1) a roughly spherically symmetric relic PWN\n2) a head, containing the pulsar, directed towards the\nSNR shell\n– The formation of a bow shock around the head of the\nPWN occurs at half the crossing time, when the position of the pulsar Rpsr with respect to the SNR shock\nRsnr equals Rpsr ≃ 0.677Rsnr. We derived a lower limit\nfor the pulsar velocity for the bow shock formation to\noccur while the SNR is in its Sedov-taylor stage.\nFrom our model it follows that a SNR containing a pulsar\nat the head of its PWN does not imply the presence of a\nbow shock, bounding the head feature of the PWN. We\ndiscussed three SNRs and interpreted their morphology,\nusing the results from our model. For the SNRs N157B\nand G327.1-1.1 we argued that they contain PWNe which\ndo not have a bow shock. The PWN inside the SNR W44\nseems to be a good candidate for having a bow shock\naround the head of its PWN.\n\nAcknowledgements. This work was part-funded by the\nCosmoGrid project, funded under the Programme for Research\nin Third Level Institutions (PRTLI) administered by the Irish\nHigher Education Authority under the National Development\nPlan and with partial support from the European Regional\nDevelopment Fund.\n\nReferences\nBlondin, J.M., Wright, E.B., Borkowski, K.J. and Reynolds,\nS.P. 1998 ApJ, 500, 342\nBlondin, J.M., Chevalier, R.A., Frierson, D.M. 2001, ApJ, 563,\n806\nBucciantini, N., Blondin, J. M., Del Zanna, L., Amato, E. 2003,\nA& A, 405, 617\nDownes, T. P., Ray, T. P. 1999, A&A, 345, 977\nFrail, D. A., Giacani, E. B., Goss, W. M., & Dubner, G. 1996,\nApJ, 464, L165\nHansen, B. M. S. & Phinney, E. S. 1997, MNRAS, 291, 569\nKulkarni, S. R., Clifton, T.C., Backer, D. C., Foster, R. S., &\nFruchter, A. S. 1988, Nature, 331, 50\nLazendic, J. S., J. R. Dickel, R. F. Haynes, et al 2000, ApJ,\n540, 808\nMarshall, F. E., E. V. Gotthelf, W. Zhang, et al 1998, ApJL,\n499, 179\nMcKee, C.F., 1974, Ap.J. 188, 335\nMcKee, C.F., Truelove, J.K. 1995, Phys. Rep. 256, 157\nMigliazzo, J. M., Gaensler, B. M., Backer, D. C., Stappers, B.\nW., van der Swaluw, E., & Strom, R. G. 2002, ApJ, 567,\nL141\nRees, M.J., Gunn, J.E. 1974, MNRAS, 167, 1\nReynolds, S.P., and Chevalier, R.A., 1984, Ap.J. 278, 630\nSedov, L.I., 1959, Similarity and Dimensional Methods in\nMechanics, Academic, New York\nStrom, R. G. 1987, ApJ, 319, L103\nSun, M., Wang, Z.R., Chen, Y. 1999, ApJ, 511, 274\nvan der Swaluw, E., Achterberg, A., Gallant, Y. A. 1998, Mem.\nSoc. Astron. Italiana 69, 1017\nvan der Swaluw, E., Achterberg, A., Gallant, Y. A., Tóth, G.\n2001, A&A, 380, 309\nvan der Swaluw, E., Achterberg, A., Gallant, Y. A., Downes,\nT.P., Keppens, R. 2003, A&A, 397, 913\nWang, Q. D., and E. V. Gotthelf 1998, ApJL, 509, 109\n\n\fWang, Q. D., E. V. Gotthelf, Y. -H. Chu et al. 2001, AJ 559,\n275\nWolszczan, A., Cordes, J. M. , & Dewey, R. J. 1991, ApJ, 372,\nL99\n\n\f"}