{"id": "http://arxiv.org/abs/astro-ph/0211533v1", "guidislink": true, "updated": "2002-11-25T12:21:45Z", "updated_parsed": [2002, 11, 25, 12, 21, 45, 0, 329, 0], "published": "2002-11-25T12:21:45Z", "published_parsed": [2002, 11, 25, 12, 21, 45, 0, 329, 0], "title": "The XMM-Newton Survey Science Centre Medium Sensitivity Survey", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0211152%2Castro-ph%2F0211171%2Castro-ph%2F0211170%2Castro-ph%2F0211363%2Castro-ph%2F0211642%2Castro-ph%2F0211420%2Castro-ph%2F0211592%2Castro-ph%2F0211522%2Castro-ph%2F0211067%2Castro-ph%2F0211282%2Castro-ph%2F0211113%2Castro-ph%2F0211249%2Castro-ph%2F0211259%2Castro-ph%2F0211487%2Castro-ph%2F0211533%2Castro-ph%2F0211597%2Castro-ph%2F0211311%2Castro-ph%2F0211197%2Castro-ph%2F0211379%2Castro-ph%2F0211378%2Castro-ph%2F0211603%2Castro-ph%2F0211466%2Castro-ph%2F0211564%2Castro-ph%2F0211409%2Castro-ph%2F0211625%2Castro-ph%2F0211025%2Castro-ph%2F0211406%2Castro-ph%2F0211515%2Castro-ph%2F0211595%2Castro-ph%2F0211188%2Castro-ph%2F0211203%2Castro-ph%2F0211550%2Castro-ph%2F0211150%2Castro-ph%2F0211551%2Castro-ph%2F0211139%2Castro-ph%2F0211079%2Castro-ph%2F0211182%2Castro-ph%2F0211446%2Castro-ph%2F0211078%2Castro-ph%2F0211562%2Castro-ph%2F0211210%2Castro-ph%2F0211244%2Castro-ph%2F0211154%2Castro-ph%2F0211552%2Castro-ph%2F0211655%2Castro-ph%2F0211586%2Castro-ph%2F0211072%2Castro-ph%2F0211194%2Castro-ph%2F0211457%2Castro-ph%2F0211476%2Castro-ph%2F0211260%2Castro-ph%2F0211180%2Castro-ph%2F0211215%2Castro-ph%2F0211177%2Castro-ph%2F0211494%2Castro-ph%2F0211123%2Castro-ph%2F0211410%2Castro-ph%2F0211513%2Castro-ph%2F0211649%2Castro-ph%2F0211623%2Castro-ph%2F0211277%2Castro-ph%2F0211274%2Castro-ph%2F0211087%2Castro-ph%2F0211518%2Castro-ph%2F0211613%2Castro-ph%2F0211009%2Castro-ph%2F0211345%2Castro-ph%2F0211403%2Castro-ph%2F0211525%2Castro-ph%2F0211524%2Castro-ph%2F0211601%2Castro-ph%2F0211039%2Castro-ph%2F0211354%2Castro-ph%2F0211520%2Castro-ph%2F0211270%2Castro-ph%2F0211386%2Castro-ph%2F0211314%2Castro-ph%2F0211384%2Castro-ph%2F0211465%2Castro-ph%2F0211461%2Castro-ph%2F0211168%2Castro-ph%2F0211175%2Castro-ph%2F0211473%2Castro-ph%2F0211063%2Castro-ph%2F0211563%2Castro-ph%2F0211160%2Castro-ph%2F0211201%2Castro-ph%2F0211565%2Castro-ph%2F0211309%2Castro-ph%2F0211017%2Castro-ph%2F0211359%2Castro-ph%2F0211407%2Castro-ph%2F0211027%2Castro-ph%2F0211131%2Castro-ph%2F0211548%2Castro-ph%2F0211041%2Castro-ph%2F0211575%2Castro-ph%2F0211394%2Castro-ph%2F0211114%2Castro-ph%2F0211012%2Castro-ph%2F0211028&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The XMM-Newton Survey Science Centre Medium Sensitivity Survey"}, "summary": "We present preliminary results on the XMM-Newton Survey Science Centre medium\nsensitivity survey (XMS), with 0.5-4.5 keV flux limit 2 10^{-14} erg/cm2/s. At\npresent, 19 fields have been examined with a total of 239 X-ray sources.\nIdentifications for about 2/3 of these reveal that type 1 AGN dominate, but\ntype 2 AGN, absorption-line galaxies and clusters as well as stars are also\npresent. We also discuss on a few X-ray selected Broad-Absorption-Line QSOs\nfound in this survey.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0211152%2Castro-ph%2F0211171%2Castro-ph%2F0211170%2Castro-ph%2F0211363%2Castro-ph%2F0211642%2Castro-ph%2F0211420%2Castro-ph%2F0211592%2Castro-ph%2F0211522%2Castro-ph%2F0211067%2Castro-ph%2F0211282%2Castro-ph%2F0211113%2Castro-ph%2F0211249%2Castro-ph%2F0211259%2Castro-ph%2F0211487%2Castro-ph%2F0211533%2Castro-ph%2F0211597%2Castro-ph%2F0211311%2Castro-ph%2F0211197%2Castro-ph%2F0211379%2Castro-ph%2F0211378%2Castro-ph%2F0211603%2Castro-ph%2F0211466%2Castro-ph%2F0211564%2Castro-ph%2F0211409%2Castro-ph%2F0211625%2Castro-ph%2F0211025%2Castro-ph%2F0211406%2Castro-ph%2F0211515%2Castro-ph%2F0211595%2Castro-ph%2F0211188%2Castro-ph%2F0211203%2Castro-ph%2F0211550%2Castro-ph%2F0211150%2Castro-ph%2F0211551%2Castro-ph%2F0211139%2Castro-ph%2F0211079%2Castro-ph%2F0211182%2Castro-ph%2F0211446%2Castro-ph%2F0211078%2Castro-ph%2F0211562%2Castro-ph%2F0211210%2Castro-ph%2F0211244%2Castro-ph%2F0211154%2Castro-ph%2F0211552%2Castro-ph%2F0211655%2Castro-ph%2F0211586%2Castro-ph%2F0211072%2Castro-ph%2F0211194%2Castro-ph%2F0211457%2Castro-ph%2F0211476%2Castro-ph%2F0211260%2Castro-ph%2F0211180%2Castro-ph%2F0211215%2Castro-ph%2F0211177%2Castro-ph%2F0211494%2Castro-ph%2F0211123%2Castro-ph%2F0211410%2Castro-ph%2F0211513%2Castro-ph%2F0211649%2Castro-ph%2F0211623%2Castro-ph%2F0211277%2Castro-ph%2F0211274%2Castro-ph%2F0211087%2Castro-ph%2F0211518%2Castro-ph%2F0211613%2Castro-ph%2F0211009%2Castro-ph%2F0211345%2Castro-ph%2F0211403%2Castro-ph%2F0211525%2Castro-ph%2F0211524%2Castro-ph%2F0211601%2Castro-ph%2F0211039%2Castro-ph%2F0211354%2Castro-ph%2F0211520%2Castro-ph%2F0211270%2Castro-ph%2F0211386%2Castro-ph%2F0211314%2Castro-ph%2F0211384%2Castro-ph%2F0211465%2Castro-ph%2F0211461%2Castro-ph%2F0211168%2Castro-ph%2F0211175%2Castro-ph%2F0211473%2Castro-ph%2F0211063%2Castro-ph%2F0211563%2Castro-ph%2F0211160%2Castro-ph%2F0211201%2Castro-ph%2F0211565%2Castro-ph%2F0211309%2Castro-ph%2F0211017%2Castro-ph%2F0211359%2Castro-ph%2F0211407%2Castro-ph%2F0211027%2Castro-ph%2F0211131%2Castro-ph%2F0211548%2Castro-ph%2F0211041%2Castro-ph%2F0211575%2Castro-ph%2F0211394%2Castro-ph%2F0211114%2Castro-ph%2F0211012%2Castro-ph%2F0211028&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present preliminary results on the XMM-Newton Survey Science Centre medium\nsensitivity survey (XMS), with 0.5-4.5 keV flux limit 2 10^{-14} erg/cm2/s. At\npresent, 19 fields have been examined with a total of 239 X-ray sources.\nIdentifications for about 2/3 of these reveal that type 1 AGN dominate, but\ntype 2 AGN, absorption-line galaxies and clusters as well as stars are also\npresent. We also discuss on a few X-ray selected Broad-Absorption-Line QSOs\nfound in this survey."}, "authors": ["X. Barcons", "F. J. Carrera", "M. T. Ceballos", "S. Mateos", "M. J. Page", "I. Perez-Fournon", "M. G. Watson", "the XMM-Newton Survey Science Centre"], "author_detail": {"name": "the XMM-Newton Survey Science Centre"}, "author": "the XMM-Newton Survey Science Centre", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/asna.200310012", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0211533v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0211533v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Proceedings of the \"X-ray surveys, in the light of the new\n  observatories\" workshop, Astronomische Nachrichten, in the press (4 pages, 5\n  eps figures, uses an.cls)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0211533v1", "affiliation": "Leicester", "arxiv_url": "http://arxiv.org/abs/astro-ph/0211533v1", "journal_reference": null, "doi": "10.1002/asna.200310012", "fulltext": "Astron. Nachr./AN 32X (200X) X, XXX–XXX\n\narXiv:astro-ph/0211533v1 25 Nov 2002\n\nThe XMM–Newton Survey Science Centre Medium Sensitivity\nSurvey⋆\nX. BARCONS1 , F.J. C ARRERA1 , M.T. C EBALLOS1 , S. M ATEOS1 , M.J. PAGE2 , I.\nP ÉREZ -F OURNON3 , M.G. WATSON4 , and THE XMM-N EWTON S URVEY S CIENCE\nC ENTRE\n1\n2\n3\n4\n\nInstituto de Fı́sica de Cantabria (CSIC-UC), 39005 Santander, Spain\nMullard Space Science Laboratory, UCL, Holmbury St Mary, Dorking, Surrey RH5 6NT, UK\nInstituto de Astrofı́sica de Canarias, 38200 La Laguna, Tenerife, Spain\nDepartment of Physics and Astronomy, University of Leicester, LE1 7RH, UK\n\nReceived date will be inserted by the editor; accepted date will be inserted by the editor\n\nAbstract. We present preliminary results on the XMM-Newton Survey Science Centre medium sensitivity survey, with 0.54.5 keV flux limit 2 × 10−14 erg cm−2 s−1 . At present, 19 fields have been examined with a total of 239 X-ray sources.\nIdentifications for about 2/3 of these reveal that type 1 AGN dominate, but type 2 AGN, absorption-line galaxies and clusters\nas well as stars are also present. We also discuss on a few X-ray selected Broad-Absorption-Line QSOs found in this survey\nKey words: Sources as a function of wavelength: x-rays; galaxies: active\n\n1. Introduction\nAfter more than 2 years of scientific operations, XMMNewton is building up smoothly an unsurpassed serendipitous sky survey of X-ray sources at an approximate rate of\n50,000 new sources per year. The XMM-Newton Survey Science Centre is conducting various activities to characterise\nand, eventually, fully exploit the content of this survey (Watson et al 2001). This will be achieved via an imaging programme, whereby many XMM-Newton target fields are being imaged in the optical (often in multiple bands) and nearinfrared, and a core programme where large samples of carefully selected X-ray sources are fully identified via archival\nsearches and optical spectroscopy.\nThis paper presents the current status of the XMM SSC\nMedium Survey (XMS) at high galactic latitudes. The XMS\nhas the goal of characterising the 0.5-4.5 keV X-ray selected\nsource population down to a source density of ∼ 100 deg−2 ,\nwhich corresponds to a flux limit of 2 × 10−14 erg cm−2 s−1 .\nA first compilation of 29 X-ray sources in two XMM-Newton\nfields has been presented in Barcons et al (2002). The XMS\nwill bridge the gap between the deep surveys (e.g., Hasinger\nCorrespondence to: barcons@ifca.unican.es\n⋆\nBased partly on observations obtained with XMM-Newton, an\nESA science mission with instruments and contributions directly\nfunded by ESA member states and the USA (NASA)\n\net al 2001), aimed at exploiting the most distant Universe, and\nthe shallower bright sample (Della Ceca et al 2002) which\nis meant to characterise the local and high luminosity X-ray\nsource populations.\n\n2. The XMM-Newton SSC Medium Survey\n(XMS)\nThe XMS is being built by using EPIC pn images of XMMNewton observations fulfilling a number of criteria: galactic latitude | b |> 20 deg, good-time-intervals exceeding\n∼ 10 ks (typically ∼ 20 ks), no bright (∼ 10mag ) stars in the\nfield and moderate Galactic column density (< 1021 cm−2 ).\nWe used XMM-Newton data where the corresponding PI had\ngranted access to the Survey Science Centre to exploit the\nserendipitous content of the fields. The targets of the observations have been obviously excluded, together with a region\naround them (that depending on the brightness and/or extension of the X-ray target).\nThe data had been processed by the Survey Science Centre pipeline with SAS version 5.2. We plan to update the current source lists with the more reliable SAS version 5.3.3 processed data products, but this will happen not earlier than the\nbeginning of 2003. That new version of the source lists should\nhave better calibrated source fluxes and improved positions.\n\n\f2\n\nAt present we have only included fields visible from the\nObservatorio del Roque de Los Muchachos in the island of\nLa Palma (Spain), where all the spectroscopic identifications\nhave been obtained. There is an on-going complementary effort in the South that will ultimately double the size of this\nsample.\nIn the present paper we discuss a sample of X-ray sources\nfound in 19 XMM-Newton EPIC pn fields. All XMMNewton observations, except for those referring to one particular field, are now public. The EPIC pn source lists were\nsearched for sources having a flux in the 0.5-4.5 keV band,\nas obtained from the sum of the 0.5-2 and 2-4.5 keV standard subbands, exceeding 2×10−14 erg cm−2 s−1 . Given the\nrather long exposure times, the likelihood associated to these\nsources is in most cases significantly larger than the overall\nlimit imposed to the standard 5-band search of 16 (see, e.g.,\nBarcons et al 2002 for details). The sample contains a total of\n239 sources, covering approximately ∼ 2.3 deg2 of sky, with\na source density of ∼ 100 sources deg−2 .\n\n3. Optical observations\nAll but one of the 19 XMM-Newton fields were imaged with\nthe Wide Field Camera (WFC) on the INT on the island of\nLa Palma in various filters. The remaining field is part of the\nSubaru deep survey and was imaged by the Subaru telescope.\nFor the 18 fields observed with the INT, 16 were imaged in\nthe 4 filters g'(SDSS), r'(SDSS), i'(SDSS) and Z (Gunn), one\nwith r' and i' and one with i' only. The depth of the optical images varied slightly as sky conditions were different,\nbut on average the i'-band image had a limiting magnitude\n∼ 23mag . Images were astrometrically calibrated against the\nUSNO A.2 catalogue, with residuals < 0.3 arcsec, and photometrically calibrated to zeroth order using nightly average\nextinction constants and observations of standard stars. Calibrated optical images for a large number of XMM-Newton\nfields can be downloaded from the XMM-Newton SSC site\n(http://xmmssc-www.star.le.ac.uk) and will ultimately enter\nthe XMM-Newton Science Archive maintained by ESA.\nWe used either the i'-band or the r'-band images to search\nfor candidate counterparts around each X-ray source. The algorithm searched within 5 standard deviations in the statistical positioning error of XMM-Newton (typically 1 arcsec\nerror) or 5 arcsec, whichever is larger. This last criterion was\nincluded in order to account for any residual systematics in\nthe XMM-Newton attitude orbit control system astrometric\nsolution of the X-ray data. With the newer SAS version 5.3.3\nprocessed data products, the astrometry of the source lists is\nautomatically corrected via a cross-correlation with a number of catalogues, resulting in very small residual systematics\n(< 2 arcsec).\nThe majority of the XMS sources had a single optical candidate counterpart in the optical images. A few of them had\nmore than one and about 11% showed either faint (i.e. close\nto our detection limit of i′ ∼ 23) or no candidate counterpart\nwithin our sensitivity limits. It is still possible that a few of\nthese sources are not real X-ray sources, but this will have to\nawait to the new SAS 5.3.3 source lists to be confirmed.\n\nAstron. Nachr./AN XXX (200X) X\n\nOptical candidates were spectroscopically observed\nwithin the AXIS1 programme at La Palma. AXIS is an international time programme which was granted a total of\n85 telescope nights spread over April 2000 - April 2002\ndistributed in the 4 major telescopes at the Observatorio del Roque de Los Muchachos: the Isaac Newton Telescope (2.5m, used for imaging), the Nordic Optical Telescope (2.6m, used for long-slit spectroscopy), the Telescopio Nazionale Galileo (3.5m, used mostly for long-slit spectroscopy) and the William Harschel Telescope (4.2m, used\nfor both fibre and long-slit spectroscopy).\n\n4. Identifications\nOut of the 239 X-ray sources in the sample, we have successfully identified 134 (56%) and a further 25 (10%) are\nidentified with some residual uncertainty. These uncertainties typically refer to the redshift of the source which in some\ncases, particularly in those observed with the fibre spectrograph which had shorter wavelength coverage (∼ 3000Å),\nwas drawn from one emission line only. As previously said a\nfurther 27 sources (11%) had either very faint (barely visible)\nor no optical counterpart down to magnitude i′ ∼ 23. There is\na final lot of 53 sources (22%) which have not been spectroscopically observed or whose optical spectra are of poor quality. A significant fraction of these (about 1/3) are too faint for\nspectroscopic identification in 4m-class telescopes and will\ntherefore require 8-10m class telescope observations.\nTable 1. Breakdown of identified sources in the XMS.\nSource class\nBLAGN\nNELG\nStars\nGalaxies & Clusters\nBL Lacs\n\nNumber\n110\n21\n18\n9\n1\n\n% of ids.\n69.2\n13.2\n11.3\n5.7\n0.6\n\nThe breakdown of identified sources is presented in table\n1. At a variance with other surveys, here we use a purely optical classification scheme: Broad-line Active Galactic Nuclei\n(BLAGN), Narrow Emission Line Galaxies (NELG), Galaxies and Clusters for those not showing any emission lines (as\nsome of the absorption-line galaxies may lie in clusters unltimately responsible for most of the X-ray emission), Stars and\nBL Lacs.\nFigure 1 presents the luminosity redshift diagram for\nthe extragalactic identified sources. As it can be seen, all\nNELGs in this diagram have an X-ray luminosity in excess\nof 1042 erg s−1 and therefore there is no doubt they harbour\nan active nucleus. In a more physical scheme, they would be\nclassified as narrow-line AGNs.\nOur survey also finds a number of X-ray sources which\nwe identify as galaxies without emission lines. In most cases\n1\n\nFor more information on AXIS (An XMM-Newton International Survey), visit our page http://www.ifca.unican.es/ ̃xray/AXIS\n\n\f3\n\n1.00\n0.01\n\n0.10\n\nL(erg s-1)/1044\n\n10.00\n\n100.00\n\nX. Barcons et al: The XMM-Newton SSC MS\n\n0.01\n\n0.1\n\n1\n\n10\n\nz\nBLAGN\n\nBLLac\n\nNELG\n\nGal\n\nFig. 1. Luminosity-redshift diagram for the extragalactic\nsources identified.\nthere is real evidence that these sources are directly associated with an optically dull galaxy. One of such cases is shown\nin figure 2. This is a galaxy at z=0.095 with a 0.5-4.5 keV luminosity of 1.3 × 1042 erg s−1 , i.e., some sort of AGN must\nbe present in that galaxy to give rise to such a high luminosity,\nalthough there is no hint of optical emission lines. The nature\nof such sources are discussed in Severgnini et al (2002). We\nmust caution, however, that other cases where the putative\nidentification of the X-ray source is an optically dull galaxy,\nmight actually correspond to a group or cluster of galaxies.\nCareful inspection of both the optical images and the possible extent of the X-ray sources is then necessary.\n\n5. The AGN distribution\nSynthesis models of the X-ray background based on the AGN\nunified scheme, make specific predictions for the redshift and\nabsorption column distribution of AGN. We show in fig. 3\nthe expected redshift distribution in the Comastri et al (1995)\nmodel, as drawn from a simulation.\nSimilar numbers of absorbed and unabsorbed objects\nshould be found at a flux level ∼ 10−14 erg cm−2 s−1 . Also,\nthe redshift distributions for both absorbed and unabsorbed\nAGN are expected to be similar in this model. Indeed both\nof these predictions depend critically on the assumptions of\nthe XRB model and in fact they would be different in, e.g.,\nthe Gilli, Salvati & Hasinger (2001) model, in the sense that\nmore absorbed AGN should be found at high redshifts.\nFor comparison, figure 4 shows the redshift distribution\nfor the various classes of extragalactic objects of the sources\nidentified so far in this survey. If we add all of them (or even\nadding the broad-line and narrow-line AGN), we find rough\nagreement between the observed and predicted redshift distributions of the Comastri et al (1995) model. The problem\narises if the usual identification of X-ray unabsorbed with\ntype 1 and X-ray absorbed with type 2 X-ray to optical link is\nassumed. Clearly type 2 AGN are much more concentrated at\nlow redshift than type 1 AGN. This appears to be a feature of\neven the deepest X-ray surveys, and therefore it presents an\n\nFig. 2. An X-ray luminous optically-dull galaxy found in the\nXMS survey. The image (r', 2′ × 2′ ) was obtained with\nthe WFC, the red circle being the 1σ statistical error circle of the X-ray source. The spectrum is from the AUTOFIB2/WYFFOS spectrograph on the WHT.\nimportant challenge to the XRB synthesis models. Possible\nways to understand this mismatch include\n– Type 1 and type 2 AGN are truly independent populations with unrelated evolution stories. Along these lines\nFranceschini, Braito & Fadda (2002) propose that type 1\nAGN at high redshifts form at the highest and rarest peaks\nof the density field in the Universe, while type 2 AGN are\nmore closely related to the assembly of large galaxies at\nz ∼ 1, and are therefore more related to star formation.\n– The XRB synthesis models make assumptions about the\nX-ray absorption of AGNs, not about optical spectral\ntypes. There is a wealth of evidence for discordant cases\nin the literature, including X-ray absorbed type 1 AGNs\nand X-ray unabsorbed type 2 AGNs. Mateos et al (2003)\ndiscuss the possibility that type 1 AGN at high z are absorbed in the X-ray domain.\n\n\f4\n\nAstron. Nachr./AN XXX (200X) X\n\nTable 2. Parameters for the 4 X-ray selected BAL QSOs. S is\nthe 0.5-4.5 keV flux and BI is the Balnicity Index (in km s−1 ),\nas defined in Weymann et al (1991). The BI marked with ⋆ is\nuncertain.\nzQSO\n1.820\n1.919\n1.881\n2.000\n\nS(erg cm−2 s−1 )\n2.96 × 10−14\n2.52 × 10−14\n2.46 × 10−14\n1.61 × 10−14\n\nBI\n3650\n580\n1620⋆\n1460\n\nthe possible high ionisation of the BAL, might explain why\nthey are detected in X-rays.\n\n7. Outlook\nFig. 3. Expected redshift distribution for the AGNs in the Comastri et al (1995) model for the X-ray background, for a\n0.5-4.5 keV flux limited sample at 10−14 erg cm−2 s−1 . The\nred line shows the distribution of unabsorbed sources and the\nblack line the distribution of absorbed sources, including both\nhigh /H) and low (L) luminosity AGNs.\n18\n16\n14\n12\n10\n#\n\nBLAGN\nNELG\nGal&Clus\n\n8\n6\n4\n2\n0\n0\n\n1\n\n2\n\n3\n\n4\n\nz\n\nFig. 4. Redshift distribution for the various classes of extragalactic objects found in the XMS survey.\n\nPending completion of the identification of about 1/3 of the\n239 X-ray sources in the XMS, the picture emerging at a\nsource density of ∼ 100 deg−2 is that Broad-Line AGN dominate the content of the X-ray sky. The redshift distribution of\nthese objects is very similar at that depth to that of deeper\nsurveys (Lehmann et al 2001), which probably means that\nfor studies of the bulk of the high-luminosity population of\nbroad-line AGN there is no need to go much deeper. Narrowline AGN appear only at much lower redshifts in this survey\n(which is also being found in the deepest surveys), meaning\nthat the combination of XRB synthesis models plus a one-toone correspondence of AGN X-ray absorption with optical\nspectral type, does not work. This highlights the need for rethinking current popular interpretations of X-ray background\nmodels.\nAcknowledgements. This paper reports on work carried out in the\nframework of the XMM-Newton Survey Science Centre. We are\ngrateful to our consortium colleagues and especially to those involved in the AXIS project. Partial financial support for this research\nwas provided by the Spanish Ministry of Science and Technology\nunder projects AYA2000-1690 (XM, FJC, MTC, SM) and PB980409-C02-01 (IPF).\n\nReferences\n6. Broad Absorption Line QSOs\nFour Broad Absorption Line QSOs have been found so far in\nour X-ray selected survey, one of them below the flux threshold (see table 2). Such objects have been so far extremely rare\nin X-ray surveys (Green & Mathur 1996), the likely explanation being that the BAL gas absorbs X-rays in such a way that\nthe X-ray flux decreases significantly. Indeed, 4 out of 110\nappears to be less than the expected fraction of BAL QSOs in\nan optically selected sample (typically 10%), but in a representative number of cases we do not have enough wavelength\ncoverage to detect BALs.\nWe must stress that all 4 BALs belong to the high ionisation class, as the absorption detected is in the CIV line. The\nBalnicity Index (Weymann et al 1991) measures the strength\nof the (CIV) absorption. Compared to the Weymann et al\n(1991) sample, it appears that the BI of these X-ray selected\nBAL QSOs is on the low to medium side. This, together with\n\nBarcons, X. et al : 2002, A&A 382, 522\nComastri, A., Setti, G., Zamorani, G., Hasinger, G.:1995, A&A 296,\n1\nDella Ceca, R. et al: 2002, in New visions of the X-ray Universe\nin the XMM-Newton and Chandra era, Jansen, F.A. ed, in the\npress.\nFranceschini, A., Braito, V., Fadda, D.: 2002, MNRAS 335, L51\nGilli, R., Salvati, M., Hasinger, G.: 2001, A&A, 366, 407\nGreen, P.J., Mathur, S.: 1996, ApJ 462, 637\nHasinger, G. et al : 2001, A&A 365, L45\nLehmann, I. et al.: 2001, A&A 371, 833\nMateos, S. et al: 2003, AN\nSevergnini, P. et al: 2002, in preparation\nWatson, M.G. et al : 2001, A&A 365, L51\nWeymann, R.J., Morris, S.L., Foltz, C.B., Hewett, P.C., 1991, ApJ\n373, 23\n\n\f"}