{"id": "http://arxiv.org/abs/astro-ph/0401078v1", "guidislink": true, "updated": "2004-01-07T16:16:23Z", "updated_parsed": [2004, 1, 7, 16, 16, 23, 2, 7, 0], "published": "2004-01-07T16:16:23Z", "published_parsed": [2004, 1, 7, 16, 16, 23, 2, 7, 0], "title": "A New, Simple Model for Black Hole High Frequency QPOs", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0401039%2Castro-ph%2F0401614%2Castro-ph%2F0401475%2Castro-ph%2F0401575%2Castro-ph%2F0401499%2Castro-ph%2F0401540%2Castro-ph%2F0401122%2Castro-ph%2F0401312%2Castro-ph%2F0401283%2Castro-ph%2F0401428%2Castro-ph%2F0401291%2Castro-ph%2F0401367%2Castro-ph%2F0401546%2Castro-ph%2F0401074%2Castro-ph%2F0401384%2Castro-ph%2F0401117%2Castro-ph%2F0401152%2Castro-ph%2F0401186%2Castro-ph%2F0401179%2Castro-ph%2F0401097%2Castro-ph%2F0401062%2Castro-ph%2F0401066%2Castro-ph%2F0401363%2Castro-ph%2F0401393%2Castro-ph%2F0401576%2Castro-ph%2F0401044%2Castro-ph%2F0401457%2Castro-ph%2F0401042%2Castro-ph%2F0401270%2Castro-ph%2F0401531%2Castro-ph%2F0401607%2Castro-ph%2F0401571%2Castro-ph%2F0401142%2Castro-ph%2F0401441%2Castro-ph%2F0401520%2Castro-ph%2F0401222%2Castro-ph%2F0401206%2Castro-ph%2F0401196%2Castro-ph%2F0401507%2Castro-ph%2F0401391%2Castro-ph%2F0401425%2Castro-ph%2F0401260%2Castro-ph%2F0401255%2Castro-ph%2F0401361%2Castro-ph%2F0401467%2Castro-ph%2F0401171%2Castro-ph%2F0401079%2Castro-ph%2F0401622%2Castro-ph%2F0401335%2Castro-ph%2F0401564%2Castro-ph%2F0401105%2Castro-ph%2F0401494%2Castro-ph%2F0401132%2Castro-ph%2F0401148%2Castro-ph%2F0401150%2Castro-ph%2F0401604%2Castro-ph%2F0401226%2Castro-ph%2F0401126%2Castro-ph%2F0401099%2Castro-ph%2F0401350%2Castro-ph%2F0401394%2Castro-ph%2F0401092%2Castro-ph%2F0401263%2Castro-ph%2F0401205%2Castro-ph%2F0401420%2Castro-ph%2F0401541%2Castro-ph%2F0401502%2Castro-ph%2F0401349%2Castro-ph%2F0401083%2Castro-ph%2F0401399%2Castro-ph%2F0401104%2Castro-ph%2F0401268%2Castro-ph%2F0401324%2Castro-ph%2F0401258%2Castro-ph%2F0401530%2Castro-ph%2F0401026%2Castro-ph%2F0401485%2Castro-ph%2F0401273%2Castro-ph%2F0401111%2Castro-ph%2F0401280%2Castro-ph%2F0401300%2Castro-ph%2F0401618%2Castro-ph%2F0401221%2Castro-ph%2F0401080%2Castro-ph%2F0401292%2Castro-ph%2F0401539%2Castro-ph%2F0401107%2Castro-ph%2F0401383%2Castro-ph%2F0401353%2Castro-ph%2F0401259%2Castro-ph%2F0401091%2Castro-ph%2F0401275%2Castro-ph%2F0401208%2Castro-ph%2F0401228%2Castro-ph%2F0401619%2Castro-ph%2F0401043%2Castro-ph%2F0401078%2Castro-ph%2F0401358%2Castro-ph%2F0401559%2Castro-ph%2F0401526%2Castro-ph%2F0401065&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A New, Simple Model for Black Hole High Frequency QPOs"}, "summary": "Observations of X-ray emissions from binary systems have always been\nconsidered important tools to test the validity of General Relativity in\nstrong-field regimes. The pairs and triplets of high frequency quasi-periodic\noscillations observed in binaries containing a black hole candidate, in\nparticular, have been proposed as a means to measure more directly the black\nhole properties such as its mass and spin. Numerous models have been suggested\nover the years to explain the QPOs and the rich phenomenology accompanying\nthem. Many of these models rest on a number of assumptions and are at times in\nconflict with the most recent observations. We here propose a new, simple model\nin which the QPOs result from basic p-mode oscillations of a non-Keplerian disc\nof finite size. We show that within this new model all of the key properties of\nthe QPOs: a) harmonic ratios of frequencies even as the frequencies change; b)\nvariations in the relative strength of the frequencies with spectral energy\ndistribution and with photon energy; c) small and systematic changes in the\nfrequencies, can all be explained simply given a single reasonable assumption.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0401039%2Castro-ph%2F0401614%2Castro-ph%2F0401475%2Castro-ph%2F0401575%2Castro-ph%2F0401499%2Castro-ph%2F0401540%2Castro-ph%2F0401122%2Castro-ph%2F0401312%2Castro-ph%2F0401283%2Castro-ph%2F0401428%2Castro-ph%2F0401291%2Castro-ph%2F0401367%2Castro-ph%2F0401546%2Castro-ph%2F0401074%2Castro-ph%2F0401384%2Castro-ph%2F0401117%2Castro-ph%2F0401152%2Castro-ph%2F0401186%2Castro-ph%2F0401179%2Castro-ph%2F0401097%2Castro-ph%2F0401062%2Castro-ph%2F0401066%2Castro-ph%2F0401363%2Castro-ph%2F0401393%2Castro-ph%2F0401576%2Castro-ph%2F0401044%2Castro-ph%2F0401457%2Castro-ph%2F0401042%2Castro-ph%2F0401270%2Castro-ph%2F0401531%2Castro-ph%2F0401607%2Castro-ph%2F0401571%2Castro-ph%2F0401142%2Castro-ph%2F0401441%2Castro-ph%2F0401520%2Castro-ph%2F0401222%2Castro-ph%2F0401206%2Castro-ph%2F0401196%2Castro-ph%2F0401507%2Castro-ph%2F0401391%2Castro-ph%2F0401425%2Castro-ph%2F0401260%2Castro-ph%2F0401255%2Castro-ph%2F0401361%2Castro-ph%2F0401467%2Castro-ph%2F0401171%2Castro-ph%2F0401079%2Castro-ph%2F0401622%2Castro-ph%2F0401335%2Castro-ph%2F0401564%2Castro-ph%2F0401105%2Castro-ph%2F0401494%2Castro-ph%2F0401132%2Castro-ph%2F0401148%2Castro-ph%2F0401150%2Castro-ph%2F0401604%2Castro-ph%2F0401226%2Castro-ph%2F0401126%2Castro-ph%2F0401099%2Castro-ph%2F0401350%2Castro-ph%2F0401394%2Castro-ph%2F0401092%2Castro-ph%2F0401263%2Castro-ph%2F0401205%2Castro-ph%2F0401420%2Castro-ph%2F0401541%2Castro-ph%2F0401502%2Castro-ph%2F0401349%2Castro-ph%2F0401083%2Castro-ph%2F0401399%2Castro-ph%2F0401104%2Castro-ph%2F0401268%2Castro-ph%2F0401324%2Castro-ph%2F0401258%2Castro-ph%2F0401530%2Castro-ph%2F0401026%2Castro-ph%2F0401485%2Castro-ph%2F0401273%2Castro-ph%2F0401111%2Castro-ph%2F0401280%2Castro-ph%2F0401300%2Castro-ph%2F0401618%2Castro-ph%2F0401221%2Castro-ph%2F0401080%2Castro-ph%2F0401292%2Castro-ph%2F0401539%2Castro-ph%2F0401107%2Castro-ph%2F0401383%2Castro-ph%2F0401353%2Castro-ph%2F0401259%2Castro-ph%2F0401091%2Castro-ph%2F0401275%2Castro-ph%2F0401208%2Castro-ph%2F0401228%2Castro-ph%2F0401619%2Castro-ph%2F0401043%2Castro-ph%2F0401078%2Castro-ph%2F0401358%2Castro-ph%2F0401559%2Castro-ph%2F0401526%2Castro-ph%2F0401065&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observations of X-ray emissions from binary systems have always been\nconsidered important tools to test the validity of General Relativity in\nstrong-field regimes. The pairs and triplets of high frequency quasi-periodic\noscillations observed in binaries containing a black hole candidate, in\nparticular, have been proposed as a means to measure more directly the black\nhole properties such as its mass and spin. Numerous models have been suggested\nover the years to explain the QPOs and the rich phenomenology accompanying\nthem. Many of these models rest on a number of assumptions and are at times in\nconflict with the most recent observations. We here propose a new, simple model\nin which the QPOs result from basic p-mode oscillations of a non-Keplerian disc\nof finite size. We show that within this new model all of the key properties of\nthe QPOs: a) harmonic ratios of frequencies even as the frequencies change; b)\nvariations in the relative strength of the frequencies with spectral energy\ndistribution and with photon energy; c) small and systematic changes in the\nfrequencies, can all be explained simply given a single reasonable assumption."}, "authors": ["L. Rezzolla"], "author_detail": {"name": "L. Rezzolla"}, "author": "L. Rezzolla", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.1780995", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0401078v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0401078v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "To appear in Proceedings of \"X-ray Timing 2003: Rossi and Beyond\",\n  ed. P. Kaaret, F.K. Lamb, & J.H. Swank", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0401078v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0401078v1", "journal_reference": null, "doi": "10.1063/1.1780995", "fulltext": "A New, Simple Model for Black Hole High Frequency QPOs\nL. Rezzolla\n\narXiv:astro-ph/0401078v1 7 Jan 2004\n\nSISSA, International School for Advanced Studies, Trieste, Italy\nINFN, Sezione di Trieste, Trieste, Italy\nAbstract. Observations of X-ray emissions from binary systems have always been considered important tools to test the\nvalidity of General Relativity in strong-field regimes. The pairs and triplets of high frequency quasi-periodic oscillations\nobserved in binaries containing a black hole candidate, in particular, have been proposed as a means to measure more directly\nthe black hole properties such as its mass and spin. Numerous models have been suggested over the years to explain the QPOs\nand the rich phenomenology accompanying them. Many of these models rest on a number of assumptions and are at times in\nconflict with the most recent observations. We here propose a new, simple model in which the QPOs result from basic p-mode\noscillations of a non-Keplerian disc of finite size. We show that within this new model all of the key properties of the QPOs:\na) harmonic ratios of frequencies even as the frequencies change; b) variations in the relative strength of the frequencies with\nspectral energy distribution and with photon energy; c) small and systematic changes in the frequencies, can all be explained\nsimply given a single reasonable assumption.1\n\nA number of models have been proposed to explain\nthe high frequency quasi-periodic oscillations (HFQPOs)\nseen in accreting black hole systems [1, 2] and two of\nthese seem particularly promising in our view. The first\nmodel proposed, the discoseismic model [3], asserts that\ng-modes should become trapped in the potential well\nof a Keplerian (i.e. geometrically thin) disc in a Kerr\npotential. The size of the region where the modes are\ntrapped depends on both the mass and the spin of the accreting black hole. Additional frequencies of oscillation\nshould be expected from pressure modes and corrugation modes. The predictions of the model are well summarised by Kato [4]. Given pairs of high frequency QPOs\nand a proper identification of the frequencies with the\nparticular modes, one can measure both the black hole\nmass and spin to relatively high accuracy [5]. The discoveries of three systems where the QPOs show a harmonic\nstructure with relatively strong peaks seen in integer ratios [6, 2] 1 : 2, 2 : 3, or 1 : 2 : 3 seem to cast some doubt\nupon this model. However, the model remains viable\nfor the intermediate frequency QPOs in GRS 1915+105,\nseen at 67 Hz [7] and 40 Hz [6]. The second model proposed, the parametric resonance model [8], asserts that\na harmonic relationship in the QPOs frequencies can be\nproduced as a result of resonances and was motivated by\nthe small number integer ratios of some of the QPOs seen\nfrom black holes candidates. In particular, the parametric\n\n1\n\nThis work was in collaboration with S'i. Yoshida, T. J. Maccarone\nand O. Zanotti\n\nresonance model suggests that an initial turbulence spectrum is amplified at a radius where the (radial) epicyclic\nfrequency is in resonance with the (azimuthal) orbital\nfrequency, with the two frequencies being in (small) integer ratios. These annuli tend to be close to the black hole\nevent horizon for the observed frequencies and, hence,\ngeneral relativistic effects can be important. Given a sufficiently accurate mass estimate for the black hole and a\nproper identification of the ratio of the frequencies in resonance, again, a black hole spin can be measured fairly\naccurately. It should be noted that given the observed frequencies of 162 and 324 Hz in GRS 1915+105 it is not\npossible to produce the 40 and 67 Hz QPOs with a discoseismic model and the higher frequency QPOs with a\nresonance model while retaining the same values for the\nblack hole mass and spin [9].\nA potential problem for both models is the observational evidence for a frequency jitter in the HFQPOs of\nXTE J1550-564, i.e. for small variations of about 10%\nin frequencies for about 15% of the time. This difficulty\ncould be particularly severe for the parametric resonance\nmodel, whose relevant frequencies confine the resonance\nto a narrow region in radial coordinates (This situation\nis worsened for the 1:3 resonance for which the radial\nvariation of the frequencies is even more rapid [2].).\nWe here propose an explanation for the high frequency\nQPOs in black hole candidates that has distinct novel\nfeatures and is based on a single assumption, namely\nthat a non-Keplerian disc orbits around a rotating black\nhole. More specifically, we propose a model based on\nthe oscillation properties of a geometrically thick disc\n\n\flocated in the vicinity of a Kerr black hole. A more\ndetailed discussion of this model can be found in [10].\nIn contrast to a Keplerian disc, a non-Keplerian disc\n(i.e. a torus) is confined to a finite-size region determined\nuniquely by the distribution of the specific angular momentum and by the pressure gradients. In similarity with\na star, however, restoring forces can be used to classify\ndifferent modes of oscillation in the disc. A first restoring force is the centrifugal force, which is responsible\nfor inertial oscillations of the orbital motion of the disc\nand hence for epicyclic oscillations. A second restoring\nforce is the gravitational field in the direction vertical to\nthe orbital plane and which will produce a harmonic oscillation across the equatorial plane if a portion of the\ndisc is perturbed in the vertical direction. A third restoring force is provided by pressure gradients and the oscillations produced in this way are closely related to the\nsound waves propagating in a compressible fluid. In a\ngeometrically thick disc, the vertical and horizontal oscillations are in general coupled and more than a single restoring force can intervene for the same mode. Referring the reader to [4] for a more detailed discussion,\nit is here sufficient to remind that c modes are essentially controlled by the vertical gravitational field, that g\nmodes are mainly regulated by centrifugal and pressuregradient forces, and that all of the restoring forces discussed above play a role in the case of p modes. It is also\nuseful to underline that because we are here interested in\nmodes with a prevalent horizontal motion and frequencies above the epicyclic one, we are essentially selecting\n\"inertial-acoustic\" modes having centrifugal and pressure gradients as only restoring forces. Hereafter we will\nrefer to these simply as p modes.\nFollowing a recent investigation of the dynamics of\nperturbed relativistic tori [11], we have analysed the\nglobal oscillation properties of such systems and, more\nspecifically, we have performed a perturbative analysis\nof axisymmetric modes of oscillation of relativistic tori\nin the Cowling approximation. The eigenvalue problem\nthat needs to be solved to investigate consistently the oscillation properties of fluid tori is simplified considerably\nif the vertical structure is accounted for by an integration\nin the vertical direction. Doing so removes one spatial dimension from the problem and yields to simple ordinary\ndifferential equations. While an approximation, this simpler model captures most of the features relevant to the\ndiscussion of p-modes in relativistic tori and is a firststep in a research field which is in great part unexplored.\nWe have solved the eigenvalue problem for a number\nof vertically-integrated relativistic tori which have been\nperturbed through the introduction of arbitrary pressure\nperturbations. The tori are modelled as made of a perfect fluid obeying a polytropic equation of state for an\nultrarelativistic gas of electrons (other polytropic indices\nhave also been considered). The equilibrium models span\n\na large parameter space in which both the sizes and the\nphysical properties (e.g. pressure and density profiles,\ndistributions of specific angular momentum, polytropic\nindices) are varied considerably [12]. The eigenfunctions\nand eigenfrequencies found in this way correspond to\nglobal p-modes, have been computed for the fundamental mode of oscillation as well as for the first few overtones, and all have been found to be in a harmonic sequence 2 : 3 : 4 : . . . to within a few percent.\nFigure 1 shows a typical example of the solution of\nthe eigenvalue problem for a black hole with mass M =\n10 M⊙ and its comparison with the observations of XTE\nJ1550-564 (other sources could equally have been used).\nIn particular, we have plotted the value of the different\neigenfrequencies found versus the radial extension L of\nthe torus, expressed in units of the gravitational radius\nrg ≡ GM/c2 . The sequences have been calculated for a\ndistribution of specific angular momentum following a\npower-law [10], keeping the position of maximum density in the torus at rmax = 3.489, and for a black hole\nwith dimensionless spin parameter a ≡ J/M 2 = 0.94 to\nmaximize the value for L. Indicated with a solid line are\nthe fundamental frequencies f , while the first overtones\no1 are shown with a dashed line; each point on the two\nlines represents the numerical solution of the eigenvalue\nproblem. The asterisks represent the frequencies of the\nHFQPOs detected in XTE J1550-564 at 184 and 276 Hz,\nrespectively. Note that the two plotted eigenfrequencies\nare close to a 2 : 3 ratio over the full range of L considered (this is shown in the inset) and that while they\ndepend also on other parameters in the problem (e.g. the\nposition of rmax , the angular momentum distribution, the\npolytropic index), these dependences are very weak so\nthat the frequencies depend effectively on M, a and L. As\na result, if M and a are known, the solution of the eigenvalue problem can be used to determine the dimension of\nthe oscillating region L accurately.\nOn the basis of these results, we suggest that the HFQPOs observed in black hole candidate systems can be interpreted in terms of p-mode oscillations of a small torus\n[10]. Note that all the properties discussed so far depend\nsimply on the existence of non-Keplerian disc orbiting in\nthe vicinity of a black hole. Such a configuration could be\nproduced in a variety of ways and basically whenever an\nintervening process [e.g. large viscosity, turbulence, hydrodynamical and magnetohydrodynamical (MHD) instabilities] modifies the Keplerian character of the flow.\nIn what follows, we discuss how the predictions of\nsuch a model can match the observed phenomenology\nand can be used to extract astrophysical information.\n(i) The harmonic relations between the HFQPO frequencies in black hole candidates are naturally explained within this model. In a sufficiently small\ntorus, in fact, p modes effectively behave as trapped\n\n\fFIGURE 1. p-mode frequencies for a non-Keplerian disc. The horizontal axis shows the normalized radial dimensions of the\ntorus L/rg when the black hole has a mass M = 10 M⊙ . The fundamental frequencies f are indicated with a solid line, while the\nfirst overtones o1 with a dashed line. The filled dot indicates the epicyclic frequency at rmax , while the two asterisks show the values\nof the HFQPOs observed in XTE J1550-546. The error bars show the uncertainty in the determination of M.\n\nsound waves with allowed wavelengths that are\nλ = (2/2)L, (3/2)L, (4/2)L, . . .. The frequencies of\nthese standing waves would be in an exact integer\nratio only if the sound speed were constant. In practice this does not happen, but the eigenfrequencies\nfound are in a sequence very close to 2 : 3 : 4.\n(ii) Being global modes of oscillation, the same harmonicity is present at all radii within the torus. This\nremoves the difficulty encountered in the resonance\nmodel and provides also a larger extent in radial coordinates where the emissivity can be modulated.\n(iii) Because the radial epicyclic frequency represents\nthe upper limit for the disc eigenfrequencies, these\nscale like 1/M. This is in agreement with the observations made of XTE J1550-564 and GRO J165540 as long as the spins are similar [13]. On the other\nhand, a rather narrow range of black hole spins has\nbeen suggested as a possible explanation for the narrow range of radio-to-X-ray flux ratios in the Galactic X-ray binary systems [14].\n(iv) The frequency jitter can be naturally interpreted\nin terms of variations of the size of the oscillating\ncavity L. The frequencies may also drift over a large\n\nrange with the harmonic structure preserved.\n(v) The observed variations in the relative strength of the\npeaks can be explained as a variation in the perturbations the torus is experiencing. (This has been reproduced with numerical simulations [11]). Furthermore, while the low frequency overtones are energetically favoured and the corresponding eigenfunctions possess less nodes, any number of harmonics\ncould in principle be observed.\n(vi) The evidence that an overtone can be stronger\nthan the fundamental in the harder X-ray bands [1],\ncan be explained simply given that the overtone is\nan oscillation preferentially of the innermost (and\nhottest) part of the accretion flow (see [12] for the\neigenfunctions).\nA few remarks are worth making at this point. The\nfirst one is about the existence of a non-Keplerian orbital\nmotion: this is required only very close to the black hole\n(the inner edge of the torus can be in principle be located at the marginally bound orbit) and beyond this region the fluid motion can be Keplerian. Stated differently,\nthe HFQPOs observed could be produced by the inner\nparts of an otherwise standard, nearly-Keplerian, geo-\n\n\fmetrically thin accretion disc, where a variety of physical\nphenomena can introduce pressure-gradients (3D numerical simulations in MHD seem to indicate the formation\nof these tori near the black hole [15]). The second remark\nis about the stability of these tori to non-axisymmetric\noscillations. It is well-known that a stationary (i.e. nonaccreting) perfect fluid torus flowing in circular orbits\naround a black hole is subject to a dynamical instability triggered by non-axisymmetric perturbations [16]. It\nis less well-known, however, that the instability can be\nsuppressed if the flow is non-stationary. Stated differently, a fluid torus around black could be stable to nonaxisymmetric perturbations if mass-accretion takes place\n[17, 18, 19]. Because the tori discussed here are assumed\nto be the terminal part of standard accretion discs, we expect them to be stable to non-axisymmetric perturbations\nas long as magnetic fields are unimportant.\nNote that this model also offers a simple way of extracting astrophysically relevant information from the\nobservation of HFQPOs. We recall that the fundamental\np-mode frequency tends to the radial epicyclic frequency\nκr2 at rmax in the limit of a vanishing torus size, and that\nfor a Kerr black hole this frequency is a function of its\nmass and spin only. Exploiting this property, a first estimate of the black hole spin and of the size of the oscillating torus can be obtained once the lower frequency in\nthe HFQPOs is measured accurately. In this case, in fact,\ngiven a black hole candidate with measured mass M∗ ,\na lower limit on the black hole spin ā can be deduced\nas the value of a at which the maximum epicyclic frequency is equal to the lower observed HFQPO frequency\n[12]. Because for small tori L ∼ rmax , once ā has been\ndetermined, the radial position r̄ of the maximum of the\nepicyclic frequency provides an upper limit on the size\nof the torus, thus providing an estimate difficult to obtain\nthrough direct observations. These two estimates should\nbe considered first approximations only and can be further refined through the eigenvalue problem.\nA final comment will be reserved to the possibility of\nfinding support to this model from the observational data.\nThere are now extensive observations of these black hole\nHFQPOs and interesting spectral and flux correlations\nare beginning to be found (see, for instance, [2], and\nreferences therein). These observations could be used to\ndeduce the presence of a small torus in the terminal part\nof the accretion discs.\nBeing based on a single assumption, our model for\nHFQPOs is simply constructed, but, equally simply, it\ncan be confuted. Two observational constraints, if not\nmet, will cast serious doubts about this model. The first\none requires the lower HFQPO frequency to be always\nless than the maximum possible epicyclic frequency for\na black hole of mass M∗ , i.e. lower HFQPO frequency ≤\nmax[κr (a = 1, M∗ )]. The second constraint, instead, requires that even if the HFQPOs frequencies change as\n\na result of the change in size of the torus, they should\nnevertheless appear in a harmonic ratio to within 5-10%.\nBoth of these observational requirements are sufficiently\nstraightforward to assess and therefore provide a simple\nand effective way of falsifying this model.\nClearly, more work is needed to assess whether pmode oscillations in a small-size torus represent the correct interpretation of the black hole QPO phenomenology. A first step in this direction will be made when a\nconvincing evidence is provided that p modes can be\nresponsible for the modulated X-ray emission in blackhole spacetimes; work is now in progress in this direction [20]. We leave our final remark on the complex phenomenology associated to HFQPOs in BHCs to a wellknown quote, whose view we feel to share: \"essentia non\nsunt multiplicanda praeter necessitatem\" [21].\n\nACKNOWLEDGMENTS\nIt is a pleasure to thank Shin'ichirou Yoshida, Tom\nMaccarone and Olindo Zanotti, my collaborators in this\nresearch. Financial support has been provided by the\nMIUR and by the EU Network Programme (European\nRTN Contract HPRN-CT-2000-00137).\n\nREFERENCES\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n21.\n\nStrohmayer, T., 2001, ApJ, 552, L49\nRemillard, R.A., Muno, M.P., McClintock, J.E. & Orosz,\nJ.A., 2002, ApJ, 580,1030\nNowak, M.A. & Wagoner, R.V., 1991, ApJ, 378, 656\nKato, S., 2001, Publ. Astron. Soc. Japan, 53, 1\nWagoner, R.V., Silberlgleit, A.S. & Ortega-Rodriguez,\nM., 2001, ApJ, 559, L25\nStrohmayer, T., 2001b, ApJ, 554, L169\nMorgan, E.H., Remillard, R.A. & Greiner, J., 1997, ApJ,\n482, 993\nAbramowicz, M.A., & Kluzniak, W., 2001, A&A, 374,\nL19\nMaccarone, T.J., 2002, MNRAS, 336, 1371\nRezzolla L., Yoshida S'i., Maccarone T. J., Zanotti L,\n2003 MNRAS, 344, L37\nZanotti O., Rezzolla L., Font J.A., 2003 MNRAS, 341, 832\nRezzolla L., Yoshida S'i., Zanotti L, 2003 MNRAS, 344,\n978\nRemillard, R.A., Muno, M., McClintcock, J.E. & Orosz,\nJ., 2002, \"New Views on Microquasars \", Eds. P.\nDuruchoux, Y. Fuchs & J. Rodriguez, p 49\nFender, R.P., 2001, MNRAS, 322, 31\nDe Villiers, J.-P., Hawley, J. F., 2003, ApJ, 592, 1060\nPapaloizou, J. C. B., Pringle, J. E. 1984, MNRAS 208, 721\nBlaes, O., 1987, MNRAS, 227, 975\nBlaes, O., Hawley, J. F., 1988, ApJ, 326, 277\nDe Villiers, J.-P., Hawley, J. F., 2002, ApJ, 577, 866\nKaras, V., Rezzolla, L. et al. 2004, in preparation\nOccam, T., 1496 Expositio aurea, Bologna\n\n\f"}