{"id": "http://arxiv.org/abs/astro-ph/0210249v2", "guidislink": true, "updated": "2002-11-21T00:51:11Z", "updated_parsed": [2002, 11, 21, 0, 51, 11, 3, 325, 0], "published": "2002-10-11T02:27:56Z", "published_parsed": [2002, 10, 11, 2, 27, 56, 4, 284, 0], "title": "TeV gamma rays and cosmic rays from the nucleus of M87, a mis-aligned BL\n  Lac object", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0210426%2Castro-ph%2F0210697%2Castro-ph%2F0210512%2Castro-ph%2F0210454%2Castro-ph%2F0210182%2Castro-ph%2F0210383%2Castro-ph%2F0210652%2Castro-ph%2F0210001%2Castro-ph%2F0210420%2Castro-ph%2F0210569%2Castro-ph%2F0210356%2Castro-ph%2F0210049%2Castro-ph%2F0210376%2Castro-ph%2F0210261%2Castro-ph%2F0210245%2Castro-ph%2F0210521%2Castro-ph%2F0210048%2Castro-ph%2F0210439%2Castro-ph%2F0210610%2Castro-ph%2F0210298%2Castro-ph%2F0210279%2Castro-ph%2F0210135%2Castro-ph%2F0210459%2Castro-ph%2F0210265%2Castro-ph%2F0210668%2Castro-ph%2F0210314%2Castro-ph%2F0210515%2Castro-ph%2F0210345%2Castro-ph%2F0210602%2Castro-ph%2F0210390%2Castro-ph%2F0210625%2Castro-ph%2F0210229%2Castro-ph%2F0210097%2Castro-ph%2F0210529%2Castro-ph%2F0210585%2Castro-ph%2F0210463%2Castro-ph%2F0210264%2Castro-ph%2F0210129%2Castro-ph%2F0210297%2Castro-ph%2F0210235%2Castro-ph%2F0210213%2Castro-ph%2F0210189%2Castro-ph%2F0210331%2Castro-ph%2F0210053%2Castro-ph%2F0210226%2Castro-ph%2F0210140%2Castro-ph%2F0210210%2Castro-ph%2F0210574%2Castro-ph%2F0210173%2Castro-ph%2F0210480%2Castro-ph%2F0210502%2Castro-ph%2F0210520%2Castro-ph%2F0210159%2Castro-ph%2F0210478%2Castro-ph%2F0210387%2Castro-ph%2F0210197%2Castro-ph%2F0210597%2Castro-ph%2F0210600%2Castro-ph%2F0210530%2Castro-ph%2F0210292%2Castro-ph%2F0210146%2Castro-ph%2F0210282%2Castro-ph%2F0210665%2Castro-ph%2F0210465%2Castro-ph%2F0210404%2Castro-ph%2F0210006%2Castro-ph%2F0210278%2Castro-ph%2F0210690%2Castro-ph%2F0210674%2Castro-ph%2F0210451%2Castro-ph%2F0210008%2Castro-ph%2F0210443%2Castro-ph%2F0210243%2Castro-ph%2F0210573%2Castro-ph%2F0210059%2Castro-ph%2F0210187%2Castro-ph%2F0210084%2Castro-ph%2F0210453%2Castro-ph%2F0210557%2Castro-ph%2F0210647%2Castro-ph%2F0210310%2Castro-ph%2F0210475%2Castro-ph%2F0210614%2Castro-ph%2F0210196%2Castro-ph%2F0210495%2Castro-ph%2F0210290%2Castro-ph%2F0210313%2Castro-ph%2F0210355%2Castro-ph%2F0210433%2Castro-ph%2F0210501%2Castro-ph%2F0210145%2Castro-ph%2F0210250%2Castro-ph%2F0210249%2Castro-ph%2F0210382%2Castro-ph%2F0210484%2Castro-ph%2F0210607%2Castro-ph%2F0210124%2Castro-ph%2F0210149%2Castro-ph%2F0210460%2Castro-ph%2F0210088%2Castro-ph%2F0210580&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "TeV gamma rays and cosmic rays from the nucleus of M87, a mis-aligned BL\n  Lac object"}, "summary": "The unresolved nuclear region of M87 emits strong non-thermal emission from\nradio to X-rays. Assuming this emission to originate in the pc scale jet\naligned at $\\theta \\sim 30^\\circ$ to the line of sight, we interpret this\nemission in the context of the Synchrotron Proton Blazar (SPB) model. We find\nthe observed nuclear jet emission to be consistent with M87 being a mis-aligned\nBL Lac Object and predict gamma-ray emission extending up to at least 100 GeV\nat a level easily detectable by GLAST and MAGIC, and possibly by VERITAS\ndepending on whether it is high-frequency or low-frequency peaked. Predicted\nneutrino emission is below the sensitivity of existing and planned neutrino\ntelescopes. Ultra-high energy neutrons produced in pion photoproduction\ninteractions decay into protons after escaping from the host galaxy. Because\nenergetic protons are deflected by the intergalactic magnetic field, the\nprotons from the decay of neutrons emitted in all directions, including along\nthe jet axis where the Doppler factor and hence emitted neutron energies are\nhigher, can contribute to the observed ultra-high energy cosmic rays. We\nconsider the propagation of these cosmic ray protons to Earth and conclude that\nM87 could account for the observed flux if the extragalactic magnetic field\ntopology were favourable.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0210426%2Castro-ph%2F0210697%2Castro-ph%2F0210512%2Castro-ph%2F0210454%2Castro-ph%2F0210182%2Castro-ph%2F0210383%2Castro-ph%2F0210652%2Castro-ph%2F0210001%2Castro-ph%2F0210420%2Castro-ph%2F0210569%2Castro-ph%2F0210356%2Castro-ph%2F0210049%2Castro-ph%2F0210376%2Castro-ph%2F0210261%2Castro-ph%2F0210245%2Castro-ph%2F0210521%2Castro-ph%2F0210048%2Castro-ph%2F0210439%2Castro-ph%2F0210610%2Castro-ph%2F0210298%2Castro-ph%2F0210279%2Castro-ph%2F0210135%2Castro-ph%2F0210459%2Castro-ph%2F0210265%2Castro-ph%2F0210668%2Castro-ph%2F0210314%2Castro-ph%2F0210515%2Castro-ph%2F0210345%2Castro-ph%2F0210602%2Castro-ph%2F0210390%2Castro-ph%2F0210625%2Castro-ph%2F0210229%2Castro-ph%2F0210097%2Castro-ph%2F0210529%2Castro-ph%2F0210585%2Castro-ph%2F0210463%2Castro-ph%2F0210264%2Castro-ph%2F0210129%2Castro-ph%2F0210297%2Castro-ph%2F0210235%2Castro-ph%2F0210213%2Castro-ph%2F0210189%2Castro-ph%2F0210331%2Castro-ph%2F0210053%2Castro-ph%2F0210226%2Castro-ph%2F0210140%2Castro-ph%2F0210210%2Castro-ph%2F0210574%2Castro-ph%2F0210173%2Castro-ph%2F0210480%2Castro-ph%2F0210502%2Castro-ph%2F0210520%2Castro-ph%2F0210159%2Castro-ph%2F0210478%2Castro-ph%2F0210387%2Castro-ph%2F0210197%2Castro-ph%2F0210597%2Castro-ph%2F0210600%2Castro-ph%2F0210530%2Castro-ph%2F0210292%2Castro-ph%2F0210146%2Castro-ph%2F0210282%2Castro-ph%2F0210665%2Castro-ph%2F0210465%2Castro-ph%2F0210404%2Castro-ph%2F0210006%2Castro-ph%2F0210278%2Castro-ph%2F0210690%2Castro-ph%2F0210674%2Castro-ph%2F0210451%2Castro-ph%2F0210008%2Castro-ph%2F0210443%2Castro-ph%2F0210243%2Castro-ph%2F0210573%2Castro-ph%2F0210059%2Castro-ph%2F0210187%2Castro-ph%2F0210084%2Castro-ph%2F0210453%2Castro-ph%2F0210557%2Castro-ph%2F0210647%2Castro-ph%2F0210310%2Castro-ph%2F0210475%2Castro-ph%2F0210614%2Castro-ph%2F0210196%2Castro-ph%2F0210495%2Castro-ph%2F0210290%2Castro-ph%2F0210313%2Castro-ph%2F0210355%2Castro-ph%2F0210433%2Castro-ph%2F0210501%2Castro-ph%2F0210145%2Castro-ph%2F0210250%2Castro-ph%2F0210249%2Castro-ph%2F0210382%2Castro-ph%2F0210484%2Castro-ph%2F0210607%2Castro-ph%2F0210124%2Castro-ph%2F0210149%2Castro-ph%2F0210460%2Castro-ph%2F0210088%2Castro-ph%2F0210580&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The unresolved nuclear region of M87 emits strong non-thermal emission from\nradio to X-rays. Assuming this emission to originate in the pc scale jet\naligned at $\\theta \\sim 30^\\circ$ to the line of sight, we interpret this\nemission in the context of the Synchrotron Proton Blazar (SPB) model. We find\nthe observed nuclear jet emission to be consistent with M87 being a mis-aligned\nBL Lac Object and predict gamma-ray emission extending up to at least 100 GeV\nat a level easily detectable by GLAST and MAGIC, and possibly by VERITAS\ndepending on whether it is high-frequency or low-frequency peaked. Predicted\nneutrino emission is below the sensitivity of existing and planned neutrino\ntelescopes. Ultra-high energy neutrons produced in pion photoproduction\ninteractions decay into protons after escaping from the host galaxy. Because\nenergetic protons are deflected by the intergalactic magnetic field, the\nprotons from the decay of neutrons emitted in all directions, including along\nthe jet axis where the Doppler factor and hence emitted neutron energies are\nhigher, can contribute to the observed ultra-high energy cosmic rays. We\nconsider the propagation of these cosmic ray protons to Earth and conclude that\nM87 could account for the observed flux if the extragalactic magnetic field\ntopology were favourable."}, "authors": ["R. J. Protheroe", "A. -C. Donea", "A. Reimer"], "author_detail": {"name": "A. Reimer"}, "author": "A. Reimer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0927-6505(02)00268-2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0210249v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0210249v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 6 figures. 3 additional references plus minor changes,\n  acctepted for publication in Astroparticle Physics", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0210249v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0210249v2", "journal_reference": "Astropart.Phys. 19 (2003) 559-568", "doi": "10.1016/S0927-6505(02)00268-2", "fulltext": "Astroparticle Phys., submitted 11 October 2002\nrevised 19 November 2002\n\narXiv:astro-ph/0210249v2 21 Nov 2002\n\nTeV gamma rays and cosmic rays from the nucleus of M87,\na mis-aligned BL Lac object\nR.J. Protheroe1,∗ , A.-C. Donea1 , A. Reimer2\n1\nDepartment of Physics and Mathematical Physics, The University of Adelaide,\nAdelaide, SA 5005, Australia\n2\nRuhr-Universität Bochum, Institut für Theoretische Physik, Lehrstuhl IV: Weltraumund Astrophysik, D-44780 Bochum, Germany\nAbstract\nThe unresolved nuclear region of M87 emits strong non-thermal emission from\nradio to X-rays. Assuming this emission to originate in the pc scale jet aligned at\nθ ∼ 30◦ to the line of sight, we interpret this emission in the context of the Synchrotron Proton Blazar (SPB) model. We find the observed nuclear jet emission to\nbe consistent with M87 being a mis-aligned BL Lac Object and predict gamma-ray\nemission extending up to at least 100 GeV at a level easily detectable by GLAST\nand MAGIC, and possibly by VERITAS depending on whether it is high-frequency\nor low-frequency peaked. Predicted neutrino emission is below the sensitivity of\nexisting and planned neutrino telescopes. Ultra-high energy neutrons produced in\npion photoproduction interactions decay into protons after escaping from the host\ngalaxy. Because energetic protons are deflected by the intergalactic magnetic field,\nthe protons from the decay of neutrons emitted in all directions, including along the\njet axis where the Doppler factor and hence emitted neutron energies are higher,\ncan contribute to the observed ultra-high energy cosmic rays. We consider the propagation of these cosmic ray protons to Earth and conclude that M87 could account\nfor the observed flux if the extragalactic magnetic field topology were favourable.\n\nPACS:\n98.54.Cm Active and peculiar galaxies (including BL Lacertae objects, blazars, Seyfert\ngalaxies, Markarian galaxies, and active galactic nuclei)\n98.54.Gr Radio galaxies\n98.58.Fd Jets, outflows and bipolar flows\n98.70.Rz gamma-ray sources\n98.70.Sa Cosmic rays (including sources, origin, acceleration, and interactions)\n13.85.Tp Cosmic-ray interactions\n∗\n\nemail: rprother@physics.adelaide.edu.au\n\n1\n\n\f1\n\nIntroduction\n\nM87 is usually classified as a Fanaroff-Riley Class I (FR-I) radio galaxy having a one-sided\nrelativistic jet [1] implying, in the context of unification models [2] that its unresolved\nnuclear region is a misaligned BL Lac object. The viewing angle is estimated to be\nθ ≈ 30◦ giving a maximum Doppler factor δ = [γj (1 − βj cos θ)]−1 of δmax ≈ 2 where\nγj = (1 − βj2 )−1/2 is the jet Lorentz factor. For simplicity, we shall take δ = 1 but consider\nthe range 0.66 ≤ δ ≤ 1.6 for the M87 jet at pc scales. Although the jet emission is not\nstrongly Doppler boosted towards us – it may even be de-boosted – its proximity to us\n(16.3 Mpc [3]) partially compensates for this, and makes TeV gamma-ray [4], cosmic ray\n[5, 6] and possibly neutrino emission from this object potentially interesting.\nThe strong variability of the optical flux of M87 suggests that the jet emits synchrotron\nradiation at optical frequencies somewhere within an unresolved central region less than\n5 pc in diameter [7]. The jet has well-defined relativistic features, and it is remarkable\nthat despite its low power the jet extends beyond 30 arcsec from the core [8], possibly\nbeing a remnant from when M87 was much more active. Given the large black hole mass\n3 × 109 M⊙ , and the low jet luminosity 5 × 1044 erg s−1 [9], the accretion disk must be\ncurrently in a low radiative state and provide little power to the jet. As a consequence,\nthe heating of any torus is currently inefficient and would produce little attenuation of\nTeV gamma-ray signals although this would change if M87 returned to an active state\ncommensurate with its high black hole mass [10].\nBL Lac objects, along with flat-spectrum radio quasars are collectively referred to\nas blazars. BL Lacs may be high-frequency or low-frequency peaked (HBLs and LBLs).\nTheir broad-band spectra consist of two spectral components which appear as broad\n'humps' in the spectral energy distribution (SED), and are due to emission from a jet\noriented at small angle with respect to the line-of-sight. The low-energy component, is\ngenerally believed to be synchrotron emission from relativistic electrons, and extends from\nthe radio to UV or X-ray frequencies. The origin of the high-energy component, starting\nat X-ray or γ-ray energies and extending in some cases to TeV-energies, is uncertain.\nFor BL Lacs which have rather weak thermal emission, the favoured \"leptonic model\"\nis the so-called synchrotron-self Compton (SSC) model in which the same relativistic electrons responsible for the low energy synchrotron hump in the SED up-scatter synchrotron\nphotons to high energies via the Inverse Compton effect. \"Hadronic models\" were proposed more than 10 years ago to explain the γ-ray emission from blazars [11]. Recently\nMücke & Protheroe [12, 13] have discussed in detail the various contributing emission processes in the synchrotron proton blazar (SPB) model. In hadronic models the relativistic\njet consists of relativistic proton and electron components, which again move relativistically along the jet. High-energy radiation is produced through photomeson production,\nand through proton and muon synchrotron radiation, and subsequent synchrotron-pair\ncascading in the highly magnetized environment. In the case of BL Lacs internal photon\nfields (i.e. produced by synchrotron radiation from the co-accelerated electrons) serve as\nthe target for pion photoproduction. These models can, in principle, be distinguished from\n2\n\n\fleptonic models by the observation of high energy neutrinos generated in decay chains of\nmesons created in the photoproduction interactions (for a recent review see [14]).\nIn hadronic models, AGN would contribute also to the pool of extragalactic ultrahigh energy cosmic rays (UHECR) through the decay outside the host galaxy of neutrons\nproduced by photoproduction interactions (see [15] in the context of accretion shocks,\nand [16] in the context of jets) or by escape of protons directly accelerated at termination\nshocks of jets in giant radio lobes of Fanaroff-Riley Class II (FR-II) radio galaxies [17].\nGreisen [18], and Zatsepin and Kuz'min [19] (GZK) showed that the nucleonic component of UHECR above 1020 eV will be severely attenuated in the cosmic microwave\nbackground radiation (CMBR), primarily due to pion photoproduction interactions. At\n3 × 1020 eV the mean free path is ∼ 5 Mpc and the energy-loss distance is ∼ 20 Mpc [20]\n(see Stanev et al. [21] for recent calculations). Thus, if the UHECR are extragalactic, one\nwould expect their spectrum to cut off at ∼ 1020 eV, the \"GZK cut-off\". UHECR may\nhave been observed with energies well above 1020 eV (see Nagano and Watson [22] for\na review including a discussion of models for the origin of the UHECR). However, very\nrecent data from the two largest aperture high energy cosmic ray detectors are contraditory: AGASA [23] observes no GZK cut-off while HiRes [24] observes a cut-off consistent\nwith the expected GZK cut-off. A systematic over-estimation of energy of about 25% by\nAGASA or under-estimation of energy of about 25% by HiRes could account the discrepancy [24], and the continuation of the UHECR spectrum to energies well above 1020 eV\nis now far from certain. Nevertheless, if the spectrum does extend well beyond 1020 eV,\neven though it is only an FR-I radio galaxy M87 is an attractive possibility for the origin\nof the UHECR [5, 6] because of its proximity.\n\n2\n\nSPB modelling M87 as a mis-aligned BL Lac\n\nMücke et al. [25] identified the critical parameters determining the properties of BL Lacs\nin the context of the SPB model and constructed the \"average\" synchrotron spectrum\nfor each class, HBLs and LBLs, which served as the target photon distribution for their\nhadronic cascade. An extensive collection of blazar SEDs published by Ghisellini et al.\n[26] were used to construct the \"average\" SED of HBLs and LBLs by overlaying all\navailable HBL and LBL SEDs. They found that a broken power law gave a reasonable\nrepresentation of the low-frequency hump in the SED of both HBLs and LBLs\nn(ǫ) ∝\n\n(\n\nǫ−α1 for\nǫ−α2 for\n\nǫi ≤ ǫ ≤ ǫb\nǫb ≤ ǫ ≤ ǫc\n\n(1)\n\nwith α1 = 1.5, α2 = 2.25 and ǫi = 10−5...−6 eV. The break energy ǫb of LBLs varied between\n≈ 0.1 eV to 1.3 eV, while the maximum synchrotron photon energy ǫc ranged over two\norders of magnitude, from ≈ 41 eV to 4 keV. The populated energy range of HBLs is more\nrestricted: ǫb ≈ 26 eV to 131 eV and ǫc ≈ 4.1 keV to 41 keV. The peak of the low-energy\nSED was log νLmax\n(erg/s) ≈ 45.6 − 46.1 for LBLs and log νLmax\n(erg/s) ≈ 43.4 − 43.8\nν\nν\n3\n\n\ffor HBLs. Mücke et al. [25] defined the \"average LBL\" by ǫb =1.3 eV, ǫc =4.1 keV\nand log νLmax\n(erg/s) = 46.1, and the \"average HBL\" by ǫb =131 eV, ǫc =41 keV and\nν\nmax\nlog νLν = 43.8. The parametrizations for HBLs and LBLs are visualized in Fig. 1, with\nthe dashed lines showing the \"average\" SED and the hatched regions showing the range\nof the SEDs for the two cases.\nAssuming that the unresolved nuclear emission in M87, i.e. from the pc scale jet, has\nδ = 1 we have added to Fig. 1 the radio [27], infrared [28] and X-ray [29] data on the\nnuclear region of M87 Doppler boosted by δ = 10 to mimic how M87 would appear if\nits jet were closely aligned towards us such that it would be classed as a BL Lac rather\nthan a FR-I. Since the Doppler factor of M87 is not well known, taking the range from\n0.66 to 1.5, the observed SED as viewed along the axis with δ = 10 would move along\nthe error bars added to the data. From Fig. 1, the rather high radio-infrared luminosity\nwould suggest that M87 could be a mis-aligned LBL, in which case the X-ray emission\nwould be part of the high-energy hump in the SED due to cascading initiated by photons\nand electrons from pion decay or by synchrotron photons emitted by protons and muons.\nHowever, the X-ray emission is at a level closer to that expected from an HBL, in which\ncase it would be mainly due to synchrotron emission by directly accelerated electrons.\nOne should bear in mind that there is considerable variation in the SEDs of HBLs and\nLBLs, and so one should not expect the SED of an individual BL Lac to be identical\nto our \"average\" spectrum. This is particularly true for the M87 nuclear region where\nthe observations at radio, infrared and X-rays were not simultaneous and are known to\nvary. In addition, Wilson and Yang [29] have calculated from the Chandra X-ray flux and\nspectrum observed from the inner part of the jet that there is intrinsic absorption by cold\nmatter with an equivalent hydrogen column density of 3–5 × 1020 cm−2 in M87, and so\nthe unattenuated X-ray flux could be higher than plotted. Thus we shall be satisfied if\nthe observed SED is within a factor ∼ 2 of an \"average\" SED.\nIn Fig. 2 we show the SEDs of HBLs modelled by Mücke et al. [25] in the context\nof the SPB model as they would appear if observed at δ = 1 as FR-I radio galaxies\nat a distance of 16 Mpc appropriate to M87. Results taken from Mücke et al. [25] for\nfour peak luminosities of the low energy hump of the SED are shown after shifting to\nδ = 1. As we see, there is little variation in the high energy hump which peaks at ∼ 10–\n100 GeV at a level just below the sensitivities of EGRET and the Whipple High Energy\nGamma Ray Telescope, but well above the sensitivity of GLAST and future northern\nhemisphere large-area atmospheric Cherenkov telescopes (ACT) such as MAGIC and\nVERITAS (sensitivities for all these telescopes taken from ref. [30] are shown together\nwith the upper limit from Whipple [31]). One should bear in mind, however, that the\nuncertainty in the Doppler factor of M87 will give rise to a much larger uncertainty in\nthe bolometric luminosity. These uncertainties are indicated in the theoretical SED and\nneutrino spectra by the slanted error-bars. We have extended the work of Mücke et\nal. [25] by calculating the neutrino output for these four cases and plot the expected flux\nof muon-neutrinos (νμ +ν̄μ ). The highest luminosity modelled for the low-energy hump of\nthe SED (solid curve) is in closest agreement with the M87 SED and predicts the highest\n4\n\n\fneutrino flux. We have added an upper-limit for the AMANDA-B10 neutrino telescope\nby taking the diffuse neutrino background limit [32] and multiplying by 2π sr (neutrino\ntelescopes detect upward-going neutrinos). Sensitivities calculated by Albuquerque et\nal. [33] of AMANDA-II and IceCube to E −2 diffuse intensity, again multiplied by 2π sr to\nconvert to point source sensitivity have also been added. Unlike the 100 GeV gamma-ray\nemission which should easily be detected by future telescopes, the neutrino flux is well\nbelow detection levels of future neutrino telescopes.\nIn Fig. 3 we model M87 as a mis-aligned LBL in the context of the SPB model. In\nthis case, we see that the gamma-ray emission cuts off at 10 GeV–1 TeV depending on the\nluminosity of the low energy hump of the SED. This is because for the higher target photon\ndensities in LBL, pion photoproduction losses determine the maximum proton energy, and\nhence the maximum gamma-ray energy which results from the cascades initiated by proton\nsynchrotron radiation and pion decay (including pion and muon synchrotron radiation).\nThis also affects the maximum neutrino energy in the same way. The lowest luminosity\nmodelled for the low-energy hump of the SED (chain curve) is in closest agreement with\nthe M87 SED and predicts the highest gamma-ray and neutrino energies. The gamma\nray flux is a factor ∼ 3–10 lower than for the HBL case, but is still detectable by future\ntelescopes. As with the HBL case, the neutrino flux is below the sensitivity of IceCube.\nHowever, it is not impossible that in the case of rapid flaring, M87 might just be detected\nas it is at a declination of ∼ +12◦ and is ideally located for observation by a giant neutrino\ntelescope to be located at the South Pole such as IceCube because it is sufficiently below\nthe horizon to eliminate cosmic ray events, while not being so far below the horizon that\nneutrino absorption by the Earth's core becomes important.\n\n3\n\nM87 as a source of UHECR\n\nEnergetic protons magnetically trapped in AGN jets lose energy predominantly by BetheHeitler pair production and pion photoproduction on ambient radiation fields, or by adiabatic deceleration as the jet expands. Neutron production in pion photoproduction\nsources (e.g. pγ → nπ + ) provides a mechanism for escape of cosmic rays from the jet.\nNeutrons decay typically after travelling (En /1020 eV) Mpc, which for UHECR is well\noutside the host galaxy. Recently Ahn et al. [5] and Biermann et al. [6] have shown that\nin the assumption of a Parker-spiral galactic wind magnetic structure out to ∼ 1.5 Mpc,\nthe galactic wind of our Galaxy poses no restriction to the entry to our Galaxy of UHECR\nfrom the general direction of M87, and may even lead to clustering in the arrival directions of cosmic rays from M87 observed from Earth. These preferred arrival directions\nand clustering may, however, be mainly due to the Galactic wind topology and contain\nlittle information about the direction of cosmic ray sources [34].\nThe observed intensity of UHECR [35] (multipled by energy squared) is plotted in\nFig. 4. For the most promising LBL model (chain curve in Fig. 3) we plot (chain curve)\nthe flux of neutrons divided by 4π sr (to convert flux to average intensity) that would\nbe observed at Earth from M87 if the neutrons did not decay (which of course they do).\n5\n\n\fSince these neutrons would travel to Earth in straight lines, and since we take M87 to\nhave δ(θ ∼ 30◦ ) = 1, the maximum neutron energy that would arrive at Earth would\nbe approximately the maximum jet-frame energy of the accelerated protons, which would\nbe En = 3 × 1019 eV for the model shown. However, neutrons decay into protons whose\ndirections are isotropised in the intergalactic magnetic field before and during propagation to Earth. Hence we would have contributions to the protons arriving at Earth\nfrom neutrons emitted at all angles with respect to the jet axis, and hence from the\nfull range of Doppler factors corresponding to the jet Lorentz factor, i.e. approximately\n1/2γj → 2γj . For example, if the jet Lorentz factor were γj = 5 a neutron with jet-frame\nenergy En′ = 3 × 1019 eV emitted along the jet axis (θ = 0◦ ) would decay to a proton\nwith galaxy-frame energy E ≈ 3 × 1020 eV. What we would observe therefore depends\non the galaxy-frame angle-averaged neutron luminosity on emission, and would also have\ncontributions from both jets (i.e. twice that for one jet). Given that the chain curve\nin Fig. 4 is for δ(θ ∼ 30◦ ) = 1, it is related directly to the jet-frame bolometric luminosity En′ 2 Ṅn′ (En′ ). For electromagnetic radiation and neutrinos the observed bolometric\n4\n′ ′\nluminosity is νLobs\nν H(θ) = δ (θ)ν Lν ′ and the angle-averaged emitted bolometric luminosity\n−1 ′ ′\nem\n−1\n3\nis νLν = (4π)\nδ (θ)γj ν Lν ′ dΩ. Hence, by analogy, for ultra-relativistic protons of\nenergy E ≈ En from neutron decay, and remembering that both jets contribute,\nE 2 Ṅ (E) =\n\n2\n4π\n\nI\n\n2\n\nδ 3 (θ)γj−1 En′ Ṅn′ (En′ )dΩ.\n\n(2)\n\nWe have added to Fig. 4 (solid curve) the resulting cosmic ray flux divided by 4π sr\nassuming γj = 5 and straight-line propagation, i.e.\nE 2 I(E) =\n\nE 2 Ṅ (E)\n(4π)4πd2\n\n(3)\n\nṄ(E)\n.\n4πd2 c\n\n(4)\n\ncorresponding to number density\nn(E) =\n\nAt 5 × 1019 –3 × 1020 eV this is a factor ∼ 20 below the observed UHECR.\nOf course, so far this neglects effects of diffusive propagation to Earth and interactions\nwith the CMBR. We shall consider first the effects of diffusion. For the case of a constant\ninjection rate of cosmic rays, and an infinite homogeneous diffusing medium with diffusion\ncoefficient D(E) the number density at distance d is simply\nn(E) =\n\nṄ(E)\n.\n4πD(E)d\n\n(5)\n\nIf we take D(E) = λ(E)c/3 then the observed intensity will be enhanced with respect to\nstraight-line propagation by a factor\ng(E) = dc/D(E) = 3d/λ(E).\n6\n\n(6)\n\n\fFor a simple model of intergalactic space with a low magnetic field (∼ 10−9 G) and\na cell size LC > 100 kpc, taking λ(E) ∼ LC would give an enhancement factor up\nto g(E) < 500, such that the predicted UHECR from M87 could explain the observed\nintensity above 1019 eV. While diffusion appears to increase the cosmic ray intensity from\nM87, it also increases the travel time or effective distance travelled from M87 to Earth,\ndeff = d2 c/2D(E) = dg(E)/2.\n\n(7)\n\nHence for an enhancement factor of g = 20 the effective distance is deff = 160 Mpc. At\n1019 eV the mean energy-loss distance is approximately 1 Gpc and at 1020 eV the mean\nenergy-loss distance is approximately 160 Mpc, and so in this case there would only be a\nsignificant energy loss above 1020 eV.\nThe situation could actually be quite different if we consider an intergalactic magnetic\nfield (IGMF) structure based on the observation of microgauss fields in clusters of galaxies\n[36], and of clusters occurring in networks of \"walls\" separated by \"voids\". It would then\nbe reasonable to expect relatively high fields of 10−7 –10−6 G in the walls, and much lower\nfields, 10−11 –10−9 G, in the voids. Recently, Stanev et al. [37] have considered propagation\nof UHECR in three different models of the IGMF in the local supergalactic structure in\nwhich the regular field in the high-field region was 10−8 G. We consider propagation in\na simple wall/void model similar to that used by Medina Tanco [38] to illustrate how\nUHECR would be deflected in complex IGMF structures. As M87 is at the centre of the\nVirgo Cluster and is close to the super-galactic plane we assume it is embedded in the\nhigher field region. To illustrate the effect of propagation from M87 in a wall/void type\nIGMF we define the origin of coordinates to be at M87 with the mid-plane of the wall\ncorresponding to the x–y plane, the wall occupying |z| < 2.5 Mpc and the void occupying\n|z| > 7.5 Mpc. Following Medina Tanco [38] we adopt a regular magnetic field of 10−7 G\nin the x-direction in the wall and 10−10 G in the void, with a transition region sandwiched\nbetween the wall and the void in which the magnetic field drops exponentially from 10−7 G\n~ irreg |2 i1/2 equal\nto 10−10 G. The magnetic field contains an irregular component having h|B\nto 30% of the regular component, and has a Kolmogorov spectrum of turbulence. The\nirregular field is modelled as described in ref. [21] with wavenumbers corresponding to\nturbulence scales LC /2n with LC = 2.5 Mpc and n = 0, . . . , 3. Particles are injected\nisotropically at the origin and energy losses due to Bethe-Heitler pair production and\npion photoproduction are included. A typical simulation for E0 = 1020 eV is shown in\nFig. 5.\nWhereas Medina Tanco [38] was most interested in the angular deflection of arriving\ncosmic rays relative to the direction of the cosmic ray source, we are more interested in\nthe travel times of cosmic rays to Earth from the distance d ≈ 16 Mpc to M87, and the\ntotal amount of time spent within unit volume at distance d from M87. We divide the\nspherical shell corresponding to 15 Mpc < d < 17 Mpc into 2160 equal cells of volume V\nwith a grid in spherical coordinates (θ, φ) using 72 equally spaced φ-values and 30 equally\nspaced cos θ-values. Particle orbits are advanced in time steps of size ∆t = 0.03 Mpc/c\nchosen to be much smaller than the smallest magnetic structure simulated. At each step,\n7\n\n\fthe proton energy is reduced according to the average energy-loss rate (see e.g. figure 1\nof ref. [21]). A check is made at the end of each time step to determine whether the\nproton is within the spherical shell, and if it is then ∆t is added to the total time spent in\nthe cell corresponding to its spherical coordinates (θ, φ) – i.e. if on k occasions a particle\nwas found to be located inside the ith cell at the end of a time step, then it would have\nspent approximately a total time k∆t inside the ith cell since being injected at the origin.\nDividing by the number of simulations one obtains the average time spent in a particular\ncell per injected proton τ (θ, φ). Similarly, the time spent travelling since injection at M87\nis added to the ages of the protons \"detected\" in that cell. Dividing by the total number\nof occasions a particle was \"detected\" in that cell gives the average age t̄(θ, φ) of the\nprotons present in that cell.\nResults based on the average time per unit volume in 106 simulations are shown for\ntwo initial energies 1019 eV and 1020 eV in Fig. 6. The gray-scale shows the enhancement\nfactor\ng(θ, φ) = 4πd2 cτ (θ, φ)/V.\n(8)\nThe strong peaks at (0◦ , 0) and (180◦ , 0) show that despite the presence of the turbulent\nfield component, cross-field diffusion is not strong enough to give rise to significant fluxes\nfar away from the regular field threading the source, at least for source distances as small\nas 16 Mpc for this field topology, and we note that Stanev et al. [37] arrived at a similar\nconclusion about cross-field diffusion. The peaks in g(θ, φ) shown in Fig. 6 are at a level\ng(θ, φ) ∼ 103 over a disk of radius ∼ 5◦ (∼ 1.4 Mpc) outside of which g(θ, φ) ≪ 1,\nindicating that if the magnetic field topology is such that the field lines connect the\nvicinity of M87 (within ∼ 1 Mpc) to our Galaxy (within ∼ 1 Mpc) then cosmic rays from\nM87 should clearly be observed. The average ages are t̄ ∼ 200 Mpc/c (E0 = 1019 eV) and\nt̄ ∼ 100 Mpc/c (E0 = 1020 eV) indicating their final energies would be ∼ 8 × 1018 eV and\n∼ 5 × 1019 eV respectively.\n\n4\n\nConclusion\n\nWe find the unresolved nuclear core of M87 to be consistent with it being a mis-aligned BL\nLac object. In the context of the Synchrotron Proton Blazar model, M87 could be either\nan HBL or an LBL. In both cases, we predict gamma-ray emission at levels detectable\nby GLAST and MAGIC, and possibly by VERITAS. Neutrino detection is not expected,\nexcept possibly during an extreme flare in the LBL case.\nUltra-high energy neutrons produced in pion photoproduction interactions will escape\nfrom the host galaxy where they decay into protons. Because cosmic rays are deflected\nin the IGMF, protons resulting from neutrons emitted in all directions can contribute to\nthe observed UHECR. Hence, even though the electromagnetic radiation we observe from\nthe M87 jet is not significantly Doppler boosted in energy, the cosmic ray output will be.\nBy this mechanism, the unresolved nuclear core of the M87 jet could emit UHECR with\nenergies up to at least ∼ 3 × 1020 eV.\n8\n\n\fWe predict the UHECR output from M87 to be at a level such that if UHECRs travelled in straight lines they would give an average intensity at Earth a factor ∼20 below\nthat observed. For a constant UHECR output and simple isotropic diffusion with a scattering mean free path λ less than the distance d to M87, the predicted intensity would\nbe enhanced by a factor 3d/λ relative to straight line propagation. This enhancement is\naccompanied by increased travel times, and so higher energy losses in the CMBR. Nevertheless, taking reasonable scattering mean free paths we find that for simple diffusion\nmodels protons from decay of ultra-high energy neutrons produced by pion photoproduction in the M87 jet could easily account for all the observed UHECR.\nIn perhaps more realistic wall/void models of IGMF structure, M87 would only be\na source of the observed UHECR if the topology of the IGMF between M87 and our\nGalaxy is favourable. Note, however, that because of its very high black hole mass M87\nwas probably much more active at earlier times than at present. Many objects exhibit a\nhigh state for ∼5% of the time, and since we estimate the average travel time of UHECR\nfrom M87 to Earth to be a factor ∼5–10 times the light propagation time it is indeed\npossible that the UHECR observed now were emitted when M87 was in a high state\nand possibly a more powerful cosmic ray source. Similarly, if M87 was in the recent\npast a powerful FR-II radio galaxy, it could have been possible to accelerate UHECR at\nshocks in the giant radio lobes where the jets terminate as in the model of Rachen and\nBiermann [17], and these could also contribute to the observed UHECR.\n\nAcknowledgments\nWe thank Todor Stanev for very helpful comments. This work was supported by a Discovery Project grant from the Australian Research Council and a grant from the University\nof Adelaide to RJP. AR thanks the Bundesministerium für Bildung und Forschung for\nfinancial support through DESY grant Verbundforschung 05CH1PCA/6.\n\nReferences\n[1] J. A. Biretta, in The Radio Galaxy M87, ed. H.-J. Röser & K. Meisenheimer\n(Springer: Berlin), (1999) 159.\n[2] C.M. Urry, P. Padovani, PASP 107 (1995) 803.\n[3] J.C. Cohen , Astron. J. 119 (2000) 162.\n[4] J. M. Bai, M. G. Lee, Astrophys. J. 549 (2001) L173\n[5] E.-J. Ahn, G. Medina-Tanco, P. L. Biermann, T. Stanev, astro-ph/9911123\n\n9\n\n\f[6] P L. Biermannn, E.-J. Ahn E.-J., , P. P. Kronberg, G. Medina-Tanco, T. Stanev, in\nPhysics and Astrophysics of Ultra-High-Energy Cosmic Rays, Edited by M. Lemoine\nand G. Sigl, Lecture Notes in Physics, vol. 576, p. 181.\n[7] Z.I. Tsvetanov et al., Astrophys. J. 493 (1998) 83.\n[8] W. B. Sparks, J. A. Biretta, F. Macchetto, Astrophys. J. 473 (1996) 254.\n[9] F.N. Owen, J. A. Eilek, N. E. Kassim, Astrophys. J.. 543 (2000) 611.\n[10] A.-C. Donea, R.J. Protheroe, in preparation\n[11] K. Mannheim, P.L. Biermann, A&A 221 (1989) 211.\n[12] Mücke A. & Protheroe R.J., Proc. workshop \"GeV-TeV Astrophysics: Toward a\nMajor Atmospheric Cherenkov Telescope VI\", AIP Conf. Proc. Vol 515, 149, eds.:\nB.D. Dingus et al. (2000)\n[13] A. Mücke, R.J. Protheroe, Astropart. Phys 15 (2001) 121.\n[14] J. Learned, K. Mannheim, Ann.Rev.Nucl.Part.Sci.\n\n50 (2000) 679.\n\n[15] R. J. Protheroe, A. P. Szabo, Phys. Rev. Lett., 69 (1992) 2885.\n[16] K. Mannheim, R.J. Protheroe, J.P. Rachen, t Phys. Rev. D63 (2001) 023003.\n[17] J.P. Rachen, P.L. Biermann A&A 272 (1993) 161.\n[18] K. Greisen, Phys. Rev. Lett. 16 (1966) 748\n[19] G.T. Zatsepin, V.A. Kuz'min, JETP Lett. 4 (1966) 78.\n[20] F.W. Stecker, Phys. Rev. Lett. 21 (1968) 1016.\n[21] T. Stanev, R. Engel, A. Mücke, R.J. Protheroe, J.P. Rachen, Phys. Rev. D 62 (2000)\n093005.\n[22] M. Nagano, A.A. Watson, Rev. Mod. Phys. 72 (2000) 689.\n[23] M. Takeda et al., astro-ph/0209422\n[24] T. Abu-Zayyad et al., astro-ph/0208301\n[25] A. Mücke, R.J. Protheroe, R. Engel, J.P. Rachen, T. Stanev, Astropart. Phys., in\npress, astro-ph/0206164\n[26] G. Ghisellini et al., MNRAS 301 (1998) 451.\n[27] J. A. Biretta, C. P. Stern, D. E. Harris, Astron. J. 101 (1991) 1632.\n10\n\n\f[28] E. S. Perlman, W. B. Sparks, J. Radomski, C. Packham, R. S. Fisher, R. Pina,J. A.\nBiretta, Astrophys. J. 561 (2001) L51\n[29] A.S. Wilson, Y. Yang, Astrophys. J. 568 (2002) 133 .\n[30] \"GLAST: Exploring nature's highest energy processes with the Gamma Ray Large\nArea Space Telescope\" NASA document NP-2000-9-107-GSFC, February 2001, p29.\nhttp://glast.gfsc.nasa.gov/resources/brochures/gsd/\n[31] S. Lebohec and the VERITAS Collaboration, Proc. 27th Int. Cosmaic Ray. Conf.,\nHamburg 2002, ed. M. Simon et al., Copernicus Gesellschaft, Katlenburg-Lindau,\nvol. 7, pp 2643-2645.\n[32] J. Ahrens, et al. (AMANDA Collaboration), in Proc. EPS International Conference\non High Energy Physics, Budapest, 2001 (D. Horvath, P. Levai, A. Patkos, eds.),\nJHEP Proceedings Section, hep-ph/0112083\n[33] I.F.M. Albuquerque, J. Lamoureux, G.F. Smoot, hep-ph/0109177\n[34] P. Billoir, A. Letessier-Selvon, astro-ph/0001427\n[35] T.K. Gaisser, T. Stanev, in Particle Data Book, Phys. Rev. D66:010001 (2002) 182.\n[36] P. P. Kronberg, Rep. Prog. Phys. 57 (1994) 325\n[37] T. Stanev, D. Seckel, R. Engel, astro-ph/0108338\n[38] G.A. Medina Tanco, Astrophys. J. 505 (1998) L79\n\n11\n\n\fFigure 1: Form of the SED assumed for the synchrotron radiation from LBLs (short\ndashed curves) and HBLs (long dashed curves). The horizontal shading encompasses the\nSEDs of all LBLs, and the vertical shading encompasses the SEDs of all HBLs considered\nby Ghisellini et al. [26]. Data from M87 unresolved nuclear jet emission refs. [27, 28, 29]\nDoppler boosted to δ = 10 have been added (see text for details). Error bars correspond\nto uncertainty in Doppler boosting due to uncertainty in Doppler factor of M87 which we\ntaken to be in the range 0.67 ≤ δ ≤ 1.5.\n\n12\n\n\fFigure 2: SED of emerging cascade radiation for different target photon spectra (broken\npower-laws shown), u′B = u′P , B = 30G, δ = 1, and R′ = 5 × 1015 cm. HBL-like\nsynchrotron spectra with u′B = u′P , and log(u′phot /eVcm−3 ) = 8 (chain curves), 9 (dashed\ncurves), 10 (dotted curves) and 11 (solid curves). The broken power-laws on the left\nshow the electron synchrotron radiation which provides the target photons for proton\ninteractions, the curves in the range 103 –1014 eV show the X-ray to gamma-ray flux\ndue to proton interactions and proton synchrotron radiation and subsequent cascading,\nand the curves in the range 1014 –1018 eV show the corresponding neutrino fluxes (note\nthat neutrino fluxes for log(u′phot /eVcm−3 ) = 8 and 9 are too low to be included in this\nplot). Error bars attached to solid curves correspond to uncertainty due to uncertainty in\nDoppler factor of M87 which we taken to be in the range 0.67 ≤ δ ≤ 1.5. The sensitivities\nof the EGRET (E), Whipple (W), GLAST (G), MAGIC (M) and VERITAS (V) gamma\nray telescopes are indicated, as are the sensitivities of the AMANDA-II (AII ) and IceCube\n(km3 ) neutrino telescopes, and an upper limit from AMANDA-B10 (AB10 ) – see text for\ndetails. Data from M87 unresolved nuclear jet emission refs. [27, 28, 29] and the upper\nlimit at 250 GeV from Whipple [31] have been added.\n\n13\n\n\fFigure 3: SED of emerging cascade radiation for different target photon spectra (broken\npower-laws shown), u′B = u′P , B = 30G, δ = 1, and R′ = 5 × 1015 cm. LBL-like\nsynchrotron spectra with log(u′phot /eVcm−3 ) = 11 (chain curves), 12 (dashed curves), 13\n(dotted curves) and 14 (solid curves). See Fig. 2 for key to other symbols.\n\n14\n\n\fFigure 4: The observed intensity of UHECR taken from ref. [35]. Chain curve gives\nneutron flux divided by 4π sr (to convert flux to average intensity) that would be observed\nat Earth from M87 if the neutrons did not decay (intensity shown corresponds to LBL\nmodel indicated by chain curve in Fig. 3). The solid curve is the cosmic ray intensity\napproximation given by Eq. 3 for this case (see text for a discussion of diffusion and\nenergy-loss in the CMBR not included).\n\n15\n\n\fFigure 5: Three orthogonal views of a typical trajectory of a 1020 eV proton in the\nwall/void model of the IGMF discussed in the text. Particle is injected at the origin,\nregular component of the magnetic field is in x direction. Wall extends from z = −2.5 Mpc\nto z = 2.5 Mpc.\n\n16\n\n\fFigure 6: Enhancement factor g(E) (Eq. 8) as a function position (θ, φ) on a sphere of\nradius ∼ 16 Mpc centred on the origin for protons of initial energy (a) E0 = 1019 eV and\n(b) E0 = 1020 eV injected isotropically at the origin in the wall/void model of the IGMF\ndiscussed in the text. Gray-scale is logarithmic in g(E) (see text for details).\n\n17\n\n\f"}