{"id": "http://arxiv.org/abs/astro-ph/0001531v1", "guidislink": true, "updated": "2000-01-31T16:31:42Z", "updated_parsed": [2000, 1, 31, 16, 31, 42, 0, 31, 0], "published": "2000-01-31T16:31:42Z", "published_parsed": [2000, 1, 31, 16, 31, 42, 0, 31, 0], "title": "Super star clusters as probes of massive star evolution and the IMF at\n  extreme metallicities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0001463%2Castro-ph%2F0001006%2Castro-ph%2F0001052%2Castro-ph%2F0001345%2Castro-ph%2F0001383%2Castro-ph%2F0001420%2Castro-ph%2F0001077%2Castro-ph%2F0001108%2Castro-ph%2F0001209%2Castro-ph%2F0001504%2Castro-ph%2F0001443%2Castro-ph%2F0001168%2Castro-ph%2F0001330%2Castro-ph%2F0001355%2Castro-ph%2F0001410%2Castro-ph%2F0001148%2Castro-ph%2F0001182%2Castro-ph%2F0001321%2Castro-ph%2F0001161%2Castro-ph%2F0001113%2Castro-ph%2F0001343%2Castro-ph%2F0001501%2Castro-ph%2F0001081%2Castro-ph%2F0001144%2Castro-ph%2F0001404%2Castro-ph%2F0001222%2Castro-ph%2F0001422%2Castro-ph%2F0001226%2Castro-ph%2F0001332%2Castro-ph%2F0001468%2Castro-ph%2F0001103%2Castro-ph%2F0001234%2Castro-ph%2F0001308%2Castro-ph%2F0001064%2Castro-ph%2F0001193%2Castro-ph%2F0001536%2Castro-ph%2F0001099%2Castro-ph%2F0001429%2Castro-ph%2F0001072%2Castro-ph%2F0001435%2Castro-ph%2F0001058%2Castro-ph%2F0001121%2Castro-ph%2F0001120%2Castro-ph%2F0001159%2Castro-ph%2F0001236%2Castro-ph%2F0001134%2Castro-ph%2F0001534%2Castro-ph%2F0001312%2Castro-ph%2F0001167%2Castro-ph%2F0001191%2Castro-ph%2F0001336%2Castro-ph%2F0001396%2Castro-ph%2F0001080%2Castro-ph%2F0001127%2Castro-ph%2F0001491%2Castro-ph%2F0001486%2Castro-ph%2F0001365%2Castro-ph%2F0001018%2Castro-ph%2F0001388%2Castro-ph%2F0001211%2Castro-ph%2F0001493%2Castro-ph%2F0001359%2Castro-ph%2F0001519%2Castro-ph%2F0001145%2Castro-ph%2F0001509%2Castro-ph%2F0001446%2Castro-ph%2F0001066%2Castro-ph%2F0001158%2Castro-ph%2F0001331%2Castro-ph%2F0001239%2Castro-ph%2F0001228%2Castro-ph%2F0001001%2Castro-ph%2F0001447%2Castro-ph%2F0001005%2Castro-ph%2F0001013%2Castro-ph%2F0001544%2Castro-ph%2F0001523%2Castro-ph%2F0001494%2Castro-ph%2F0001178%2Castro-ph%2F0001520%2Castro-ph%2F0001386%2Castro-ph%2F0001084%2Castro-ph%2F0001392%2Castro-ph%2F0001210%2Castro-ph%2F0001051%2Castro-ph%2F0001480%2Castro-ph%2F0001232%2Castro-ph%2F0001441%2Castro-ph%2F0001141%2Castro-ph%2F0001351%2Castro-ph%2F0001376%2Castro-ph%2F0001093%2Castro-ph%2F0001297%2Castro-ph%2F0001059%2Castro-ph%2F0001083%2Castro-ph%2F0001531%2Castro-ph%2F0001432%2Castro-ph%2F0001060%2Castro-ph%2F0001436%2Castro-ph%2F0001401%2Castro-ph%2F0001452&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Super star clusters as probes of massive star evolution and the IMF at\n  extreme metallicities"}, "summary": "Young super star clusters and young compact massive star forming regions can\nprovide useful information on their burst properties (age, burst duration,\nSFR), the upper end of the IMF and yield new constraints on the evolution of\nmassive stars. Through the study of their stellar populations we can in\nparticular extend our knowledge on massive stars to extreme metallicities\nunavailable for such stars in the Local Group.\n  Here we summarise the main results from recent studies on two metallicity\nextremes: Wolf-Rayet and O star populations in very metal-poor BCD, and\nmetal-rich compact nuclear SF regions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0001463%2Castro-ph%2F0001006%2Castro-ph%2F0001052%2Castro-ph%2F0001345%2Castro-ph%2F0001383%2Castro-ph%2F0001420%2Castro-ph%2F0001077%2Castro-ph%2F0001108%2Castro-ph%2F0001209%2Castro-ph%2F0001504%2Castro-ph%2F0001443%2Castro-ph%2F0001168%2Castro-ph%2F0001330%2Castro-ph%2F0001355%2Castro-ph%2F0001410%2Castro-ph%2F0001148%2Castro-ph%2F0001182%2Castro-ph%2F0001321%2Castro-ph%2F0001161%2Castro-ph%2F0001113%2Castro-ph%2F0001343%2Castro-ph%2F0001501%2Castro-ph%2F0001081%2Castro-ph%2F0001144%2Castro-ph%2F0001404%2Castro-ph%2F0001222%2Castro-ph%2F0001422%2Castro-ph%2F0001226%2Castro-ph%2F0001332%2Castro-ph%2F0001468%2Castro-ph%2F0001103%2Castro-ph%2F0001234%2Castro-ph%2F0001308%2Castro-ph%2F0001064%2Castro-ph%2F0001193%2Castro-ph%2F0001536%2Castro-ph%2F0001099%2Castro-ph%2F0001429%2Castro-ph%2F0001072%2Castro-ph%2F0001435%2Castro-ph%2F0001058%2Castro-ph%2F0001121%2Castro-ph%2F0001120%2Castro-ph%2F0001159%2Castro-ph%2F0001236%2Castro-ph%2F0001134%2Castro-ph%2F0001534%2Castro-ph%2F0001312%2Castro-ph%2F0001167%2Castro-ph%2F0001191%2Castro-ph%2F0001336%2Castro-ph%2F0001396%2Castro-ph%2F0001080%2Castro-ph%2F0001127%2Castro-ph%2F0001491%2Castro-ph%2F0001486%2Castro-ph%2F0001365%2Castro-ph%2F0001018%2Castro-ph%2F0001388%2Castro-ph%2F0001211%2Castro-ph%2F0001493%2Castro-ph%2F0001359%2Castro-ph%2F0001519%2Castro-ph%2F0001145%2Castro-ph%2F0001509%2Castro-ph%2F0001446%2Castro-ph%2F0001066%2Castro-ph%2F0001158%2Castro-ph%2F0001331%2Castro-ph%2F0001239%2Castro-ph%2F0001228%2Castro-ph%2F0001001%2Castro-ph%2F0001447%2Castro-ph%2F0001005%2Castro-ph%2F0001013%2Castro-ph%2F0001544%2Castro-ph%2F0001523%2Castro-ph%2F0001494%2Castro-ph%2F0001178%2Castro-ph%2F0001520%2Castro-ph%2F0001386%2Castro-ph%2F0001084%2Castro-ph%2F0001392%2Castro-ph%2F0001210%2Castro-ph%2F0001051%2Castro-ph%2F0001480%2Castro-ph%2F0001232%2Castro-ph%2F0001441%2Castro-ph%2F0001141%2Castro-ph%2F0001351%2Castro-ph%2F0001376%2Castro-ph%2F0001093%2Castro-ph%2F0001297%2Castro-ph%2F0001059%2Castro-ph%2F0001083%2Castro-ph%2F0001531%2Castro-ph%2F0001432%2Castro-ph%2F0001060%2Castro-ph%2F0001436%2Castro-ph%2F0001401%2Castro-ph%2F0001452&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Young super star clusters and young compact massive star forming regions can\nprovide useful information on their burst properties (age, burst duration,\nSFR), the upper end of the IMF and yield new constraints on the evolution of\nmassive stars. Through the study of their stellar populations we can in\nparticular extend our knowledge on massive stars to extreme metallicities\nunavailable for such stars in the Local Group.\n  Here we summarise the main results from recent studies on two metallicity\nextremes: Wolf-Rayet and O star populations in very metal-poor BCD, and\nmetal-rich compact nuclear SF regions."}, "authors": ["Daniel Schaerer", "Natalia G. Guseva", "Yuri I. Izotov"], "author_detail": {"name": "Yuri I. Izotov"}, "author": "Yuri I. Izotov", "arxiv_comment": "to appear in \"Massive Stellar Clusters\", Eds. A. Lancon, C.M. Boily,\n  ASP Conf. Series, in press. 7 pages, including 5 figures. Related preprints\n  also available at http://webast.ast.obs-mip.fr/people/schaerer/Preprints.html", "links": [{"href": "http://arxiv.org/abs/astro-ph/0001531v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0001531v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0001531v1", "affiliation": "Main Astronomical Observatory, Kiev", "arxiv_url": "http://arxiv.org/abs/astro-ph/0001531v1", "journal_reference": null, "doi": null, "fulltext": "Massive Stellar Clusters\nASP Conference Series, Vol. 3 × 108 , 2000\nA. Lançon and C.M. Boily, eds.\n\narXiv:astro-ph/0001531v1 31 Jan 2000\n\nSuper star clusters as probes of massive star evolution and\nthe IMF at extreme metallicities\nDaniel Schaerer\nObservatoire Midi-Pyrénées, 14, Av. E. Belin, F-31400, Toulouse,\nFrance (schaerer@obs-mip.fr)\nNatalia G. Guseva and Yuri I. Izotov\nMain Astronomical Observatory of National Academy of Sciences of\nUkraine, Goloseevo, 03680 Kiev-127, Ukraine (guseva@mao.kiev.ua,\nizotov@mao.kiev.ua)\nAbstract. Young super star clusters and young compact massive star\nforming regions can provide useful information on their burst properties\n(age, burst duration, SFR), the upper end of the IMF and yield new constraints on the evolution of massive stars. Through the study of their\nstellar populations we can in particular extend our knowledge on massive stars to extreme metallicities unavailable for such stars in the Local\nGroup.\nHere we summarise the main results from recent studies on two\nmetallicity extremes: Wolf-Rayet and O star populations in very metalpoor BCD, and metal-rich compact nuclear SF regions.\n\n1.\n\nIntroduction\n\nTwo \"modes\" of star formation are observed in (optically or UV selected) starburst galaxies (e.g. Meurer et al. 1995): a young unresolved population responsible for emission of diffuse UV light (Meurer et al. 1995, also Calzetti these\nproceedings), and compact stellar clusters, losely termed super star clusters\n(SSCs) hereafter. SSCs have been the focus of numerous recent studies related\nin particular to the possibility that these clusters may represent the progenitors\nof globular clusters (cf. Fritze von Alvensleben, Miller, these proceedings). A\ndifferent aspect is emphasized in the present work. We use spectroscopic observations of young star forming (SF) regions to determine their massive star\ncontent with the aim of providing constraints on stellar evolution models and\nthe upper end of the IMF.\nSSCs and similar compact young SF regions have the following properties:\na) Numerous such objects are known. b) They represent clusters rich enough (∼\n102−4 O stars) such that the IMF can be well populated and stochastical effects\n(cf. Lançon these proceedings) are negligible. c) A priori the clusters cover a wide\nrange of metallicities, and d) consist likely of a fairly coeval population. Given\nthese properties, SSCs resemble \"normal\" Galactic of Local Group clusters which\nrepresent fundamental test-cases for stellar evolution. The only disadvantage\n1\n\n\f2\nis that their stellar content can only be studied through observations of their\nintegrated light. On the other hand b) and c) represent important advantages\nfor studies focussed on massive stars over using \"local\" clusters. This shows\nthat young SSCs provide ideal samples for studies of massive star evolution in\ndifferent environments, such as e.g. extreme metallicities largely inaccessible in\nLocal Group objects.\nAfter a brief introduction on the type of objects used here (Wolf-Rayet rich\nSF region) we will summarise recent work along these lines.\n2.\n\nWolf-Rayet galaxies and clusters\n\nWe will concentrate on the so-called Wolf-Rayet (WR) galaxies (cf. Schaerer\net al. 1999b for the latest catalogue), which are objects where broad stellar\nemission lines (called \"WR bumps\", mostly at He ii λ4686 and C iv λ5808) in the\nintegrated spectrum testify to the presence of WR stars. For the study of massive\nstar populations these objects are ideal since WR stars are the descendents of\n5−6 yr).\nthe most massive stars in a short-lived phase (Mini >\n∼ 25 M⊙ , tWR ∼ 10\nTheir detection is also a good age indicator for young systems (t <\n∼ 10 Myr),\nand allows good measure of the burst duration and the best direct probe of the\nupper end of the IMF. An overview of studies on WR populations in starburst\nregions can be found in the reviews of Schaerer (1998, 1999).\nIn the context of the present workshop it is important to note that the\nobjects broadly referred to as WR \"galaxies\" are found among a large variety of\nobjects including BCD, massive spirals, IRAS galaxies, Seyfert 2, and LINERs\n(see Schaerer et al. 1999b). The \"WR rich\" regions contained in the spectroscopic observations will thus in general cover quite a large scale of sizes, different\nmorphologies etc. In the case of blue compact dwarfs (BCD), one is however\nmostly dealing with one or few individual compact regions or SSC dominating\nthe observed light. Although this statement cannot, with few exceptions, be\nquantified so far for the objects studied below (but see e.g. Conti & Vacca 1994)\nwe will mostly assume that the spectroscopic observations correspond closely to\nlight from one young compact SF region or SSC.\n3.\n\nStudies of Wolf-Rayet populations in metal-poor environments\n\nThe spectroscopic sample of dwarf galaxies from Izotov, Thuan and collaborators, obtained for the main purpose of determining the primordial He abundance\nand other abundance studies, has proven to be very useful for analysis of massive star populations especially at very low metallicities. Indeed, ∼ 20 WR rich\nregions are found in this sample at metallicities below the SMC (12 + log O/H\n<\n∼ 8.1) extending to I Zw 18 with ∼ 1/50 solar metallicity. No bona fide massive\nstar of such low a metallicity is known in the Local Group!\nThe analysis of the WR and O star content in these objects has been presented by Guseva et al. (1999, hereafter GIT99). Some of their main results\nare summarised in Fig. 1, which shows (left panel) the derived WR/(WR+O)\nnumber ratio as a function of metallicity from their objects and observations\nof Kunth & Joubert (1985), Vacca & Conti (1992), and Schaerer et al. (1999a,\nhereafter SCK99). The left Fig. considerably extends the previous samples (cf.\n\n\f3\n\nFigure 1.\nLeft: Number ratio WR/(WR+O) as a function of metallicity for objects from GIT99 (filled circles), Vacca & Conti (1992,\ndiamonds), Kunth & Joubert (1985, asterisks), and SCK99 (open circles). Maximum values predicted from the SV98 models for a Salpeter\nIMF (Mup = 120 M⊙ ) are shown for instantaneous bursts (upper line)\nand continuous SF (lower). Right: Number ratio WC/WN as a function of metallicity from GIT99 (filled circles). Diamonds illustrate the\nobserved WC/WN ratios in Local Group objects though to represent\nregions at \"SF equilibrium\" (constant SF). Model predictions as above.\nFigs. taken from GIT99.\nVacca & Conti 1992, Meynet 1995). The trend of increasing WR/O with metallicity is well understood (Arnault et al. 1989) The comparison with appropriate\nevolutionary synthesis models (Schaerer & Vacca 1998, SV98; shown as solid\nlines) calculated for a \"standard\" Salpeter IMF with Mup = 120 M⊙ and using the high mass loss Geneva tracks shows a good agreement. This and more\ndirect comparisons of the observed WR features (see Schaerer 1996, de Mello\net al. 1998, SCK99, GIT99) indicate that the bulk of the observations are compatible with short (\"instantaneous\") bursts with a Salpeter IMF extending to\nlarge masses. The short burst durations1 derived by SCK99 for the metal-poor\nobjects are also in agreement with the study of Mas-Hesse & Kunth (1999).\nOf particular interest for evolutionary models is the relative number of\nWR stars of the WN (exhibiting H-burning products on their surface) and WC\nsubtypes (He-burning products). The relative lifetimes vary strongly with initial\nmass and metallicity and are sensitive to various mass loss prescriptions and\nmixing scenarios currently not well known (see Maeder & Meynet 1994, Meynet\nthese proceedings). The recent high S/N spectra of SCK99 and GIT99 have now\nallowed to establish number ratios of WC/WN stars in a fair number of WR rich\nregions. The determinations of GIT99 are shown in Fig. 1 (right panel); similar\nvalues are derived by SCK99. The comparison with synthesis models shows a\n\n1\n\nSee Meurer (these proceedings) for a discussion of SF durations.\n\n\f4\nreasonable agreement. To reproduce sufficiently large WC/WN ratios the use of\nthe stellar tracks based on the high mass loss prescription are, however, required\nas shown by de Mello et al. (1998) and SCK99.\nIt is understood that part of the \"requirement\" for the high mass loss (cf.\nSchaerer 1998) may be compensated by additional mixing processes leading to\na similar prolongation of the WR phase (cf. Meynet, these proceedings). In any\ncase in addition to the well known stellar census in the Local Group (cf. Maeder\n& Meynet 1994 and references therein) the present new data from integrated\npopulations place important constraints on the evolutionary models which have\nto be matched by successful stellar models. Especially the new studies extend\nthe range of available metallicities to very low Z, well beyond the SMC.\n4.\n\nMassive stars and the IMF in metal-rich starbursts\n\nA small sample of metal-rich (O/H >\n∼ solar) starbursts (4 objects from GIT99\nand Mrk 309) have recently been analysed in detail by Schaerer et al. (2000).\nIn this case the observations (high S/N, intermediate resolution optical spectroscopy) correspond to compact nuclear SF regions. Despite this complication\nwe use these objects as a first step to probe the upper end of the IMF at highmetallicity. Subsequent studies of more isolated and simple, cluster-like objects\nwill be undertaken in the future.\n\nFigure 2.\nObserved and predicted EW of WR features (left: blue\nbump, right: C iv λ5808). Model predictions are shown for instantaneous bursts at Z=0.02 (solid line) and Z=0.04 (dashed), and extended\nbursts at Z=0.02 (dotted; burst durations ∆t = 2, 4, 6, 8, 10, 12 Myr).\nAll models assume a Salpeter IMF with Mup =120 M⊙ .\nFor our comparison with evolutionary synthesis models (cf. below) we use\nfollowing main observational constraints: Hβ and Hα equivalent widths serving as age indicator, Hα/Hβ determining the gaseous extinction, intensities and\nequivalent widths of the main WR features (4650 bump, C iv λ5808), TiO bands\nat ∼ 6250 and 7200 Å indicating the presence of red supergiants from a popula-\n\n\f5\n\nFigure 3.\nObserved and predicted EW of the blue WR bump. The\npredictions show the dependence of the WR bump on the upper mass\ncut-off. A conservative approach yields a lower limit of Mup >\n∼ 30 M⊙ .\ntion with ages >\n∼ 7–10 Myr, and the overall SED provide an important constraint\non the population responsible for the continuum.\nModel calculations have been done using the SV98 synthesis code. The basic\nmodel parameters we consider are: stellar metallicity, IMF slope and upper mass\ncut-off, star formation history (instantaneous or extended bursts, constant SF),\nfraction of Lyc photons absorbed by the gas, stellar extinction (which may differ\nfrom gaseous).\n4.1.\n\nResults\n\nThe comparison of the observed and predicted WR features is shown in Fig. 2.\nThe observations are well reproduced by Z=0.02 models with a \"standard IMF\"\n(Salpeter, Mup =120 M⊙ ) assuming extended burst durations of ∆t ∼ 4–10\nMyr. The longer burst durations found here are physically plausible and likely\nexplained by the different nature of the metal-rich objects analysed here (larger\nnuclear regions vs. compact clusters in BCD, cf. SCK99). The corresponding\nages of our objects, as indicated by W(Hβ), are between ∼ 7 and 15 Myr,\nalso in agreement with the presence of the TiO bands. A very good fit is also\nobtained to the overall SED. This requires, however, an extinction of the stellar\ncontinuum which is less than that derived from the gas. The differences are of\nsimilar amount that found by other methods in other studies (e.g. Calzetti 1997,\nMas-Hesse & Kunth 1999).\nIn short, we conclude that all the given observational constraints can be\nwell reproduced by models with a Salpeter IMF extending to high masses for a\nburst scenario with star formation extending over ∼ 4–10 Myr. This solution is\nnot unique. Therefore a variety of alternate models have been considered (cf.\n\n\f6\nSchaerer et al. 2000). Regarding the IMF we find that steeper (with slope ∼\nMiller-Scalo) IMFs are very unlikely.\nIn view of several studies indicating a possible lack of massive stars in metalrich environments (e.g. Bresolin et al. 1999, Goldader et al. 1997) we have used\nthe present set of metal-rich WR galaxies to put a lower limit on the value of\nMup from the strength of the WR features. As mentioned above our data is\ncompatible with a large upper mass cut-off. The real range of values our data is\nsensitive to is, however, limited; intrinsically younger regions need to be sampled\nto probe the most massive stars. Adopting a conservative approach (cf. Fig. 3)\nwe obtain Mup >\n∼ 30 M⊙ (for a Salpeter slope). We also find similar values\n(Mup ∼ 35–50 M⊙ ) from comparisons of Hβ equivalent width measurements in\nmetal-rich Hii regions (see Schaerer et al. 2000).\nIn contrast with previous studies of metal-rich starbursts and related objects\nbased on properties of the ionized gas our work provides first constraints on the\nupper end of the IMF measured directly from stellar signatures. Future work on\nlarger samples and using detailed coupled stellar population and photoionisation\nmodels should be of great interest.\nAcknowledgments. We thank the organisers, especially Ariane Lançon,\nfor this very stimulating and pleasant workshop. We acknowledge support to\nthis collaboration trough INTAS grant 97-0033.\nReferences\nArnault, P., Kunth, D., Schild, H. 1989, A&A, 224, 73\nCalzetti, D., 1997, in \"The Ultraviolet Universe at Low and High Redshift:\nProbing the Progress of Galaxy Evolution\", Eds. W.H. Waller et al.,\nAIP Conference Proceedings, v.408., 403\nConti, P.S., Vacca, W.D., 1994, ApJ, 423, L97\nde Mello, D.F., Schaerer, D., Heldman, J., Leitherer, C., 1998, ApJ, 507, 199\nGoldader, J., et al., 1997, ApJ, 474, 104\nGuseva, N.G., Izotov, Y.I., Thuan, T.X., 1999, ApJ, in press (GIT99)\nKunth, D., & Joubert, M. 1985, A&A, 142, 411\nMaeder, A., Meynet, G., 1994, A&A, 287, 803\nMas-Hesse, J.M., Kunth, D., 1999, A&A, in press\nMeurer, G., et al., 1995, AJ, 110, 2665\nMeynet, G. 1995, A&A, 298, 767\nSchaerer, D., 1996, ApJ, 467, L17\nSchaerer, D., 1998, in \"Wolf-Rayet Phenomena in Massive Stars and Starburst\nGalaxies\", IAU Symp. 193, 539,\nSchaerer, D., Contini, T., Kunth D., 1999a, A&A, 341, 399 (SCK99)\nSchaerer, D., Contini, T., Pindao M., 1999b, A&AS, 136, 35\nSchaerer, D., Guseva, N., Green, R., Izotov, Y.I., Thuan, T.X., 2000, A&A, in\npreparation\nSchaerer, D., Vacca, W. D. 1998, ApJ, 497, 618 (SV98)\nVacca, W.D., Conti, P.S., 1992, ApJ,401, 543\n\n\f7\nQ. (Manfred Pakull): Some years ago it was thought that WRs do not\nform in very low Z environments because the massive stellar winds were too\nweak. Is that still the state of the art in stellar evolution models ? Or are the\nbroad emission features due to a population of H-rich, very young objects like\nin 30 Dor and NGC 3603 ?\nA. (Daniel Schaerer: Indeed the metallicity dependence of mass loss\ncauses an important decrease of the WR population toward low Z. Despite this\nevolutionary models applying recent mass-loss prescriptions predict some WR\nstars at the lowest metallicities (1/50 solar) corresponding to I Zw 18 (see de\nMello et al. 1998), quite in agreement with the observations. The role of other\nformation channels (massive close binaries, rotation) at these low Z remains\nunexplored\nIn Schaerer et al. (1999, SCK99) we have explored the effect of such R136like WR stars during H-burning in addition to other WR and Of stars with broad\nemission lines. Given their high initial mass their integrated contribution to the\nWR bump should in most cases not be very important compared to \"normal\"\nWR stars. An exception could be very young (<\n∼ 2 − 3 Myr) and strongly coveal\npopulations. Few such observational cases seem, however, known to date (see\nSCK99).\n\n\f"}