{"id": "http://arxiv.org/abs/astro-ph/0608528v1", "guidislink": true, "updated": "2006-08-24T16:18:43Z", "updated_parsed": [2006, 8, 24, 16, 18, 43, 3, 236, 0], "published": "2006-08-24T16:18:43Z", "published_parsed": [2006, 8, 24, 16, 18, 43, 3, 236, 0], "title": "Observed Properties of Dark Matter: dynamical studies of dSph galaxies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0608701%2Castro-ph%2F0608428%2Castro-ph%2F0608308%2Castro-ph%2F0608317%2Castro-ph%2F0608149%2Castro-ph%2F0608165%2Castro-ph%2F0608348%2Castro-ph%2F0608531%2Castro-ph%2F0608695%2Castro-ph%2F0608001%2Castro-ph%2F0608180%2Castro-ph%2F0608516%2Castro-ph%2F0608501%2Castro-ph%2F0608528%2Castro-ph%2F0608358%2Castro-ph%2F0608560%2Castro-ph%2F0608073%2Castro-ph%2F0608568%2Castro-ph%2F0608512%2Castro-ph%2F0608097%2Castro-ph%2F0608509%2Castro-ph%2F0608381%2Castro-ph%2F0608527%2Castro-ph%2F0608421%2Castro-ph%2F0608681%2Castro-ph%2F0608478%2Castro-ph%2F0608172%2Castro-ph%2F0608336%2Castro-ph%2F0608318%2Castro-ph%2F0608638%2Castro-ph%2F0608676%2Castro-ph%2F0608019%2Castro-ph%2F0608584%2Castro-ph%2F0608663%2Castro-ph%2F0608561%2Castro-ph%2F0608267%2Castro-ph%2F0608691%2Castro-ph%2F0608099%2Castro-ph%2F0608292%2Castro-ph%2F0608471%2Castro-ph%2F0608590%2Castro-ph%2F0608303%2Castro-ph%2F0608321%2Castro-ph%2F0608115%2Castro-ph%2F0608686%2Castro-ph%2F0608669%2Castro-ph%2F0608166%2Castro-ph%2F0608431%2Castro-ph%2F0608662%2Castro-ph%2F0608341%2Castro-ph%2F0608138%2Castro-ph%2F0608069%2Castro-ph%2F0608454%2Castro-ph%2F0608144%2Castro-ph%2F0608565%2Castro-ph%2F0608557%2Castro-ph%2F0608330%2Castro-ph%2F0608379%2Castro-ph%2F0608495%2Castro-ph%2F0608569%2Castro-ph%2F0608522%2Castro-ph%2F0608122%2Castro-ph%2F0608107%2Castro-ph%2F0608481%2Castro-ph%2F0608440%2Castro-ph%2F0608158%2Castro-ph%2F0608187%2Castro-ph%2F0608346%2Castro-ph%2F0608098%2Castro-ph%2F0608083%2Castro-ph%2F0608513%2Castro-ph%2F0608368%2Castro-ph%2F0608066%2Castro-ph%2F0608171%2Castro-ph%2F0608193%2Castro-ph%2F0608554%2Castro-ph%2F0608459%2Castro-ph%2F0608008%2Castro-ph%2F0608626%2Castro-ph%2F0608121%2Castro-ph%2F0608383%2Castro-ph%2F0608002%2Castro-ph%2F0608168%2Castro-ph%2F0608086%2Castro-ph%2F0608386%2Castro-ph%2F0608145%2Castro-ph%2F0608673%2Castro-ph%2F0608067%2Castro-ph%2F0608269%2Castro-ph%2F0608141%2Castro-ph%2F0608635%2Castro-ph%2F0608474%2Castro-ph%2F0608643%2Castro-ph%2F0608059%2Castro-ph%2F0608490%2Castro-ph%2F0608380%2Castro-ph%2F0608633%2Castro-ph%2F0608685%2Castro-ph%2F0608209%2Castro-ph%2F0608324%2Castro-ph%2F0608023&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observed Properties of Dark Matter: dynamical studies of dSph galaxies"}, "summary": "The Milky Way satellite dwarf spheroidal (dSph) galaxies are the smallest\ndark matter dominated systems in the universe. We have underway dynamical\nstudies of the dSph to quantify the shortest scale lengths on which Dark Matter\nis distributed, the range of Dark Matter central densities, and the density\nprofile(s) of DM on small scales. Current results suggest some surprises: the\ncentral DM density profile is typically cored, not cusped, with scale sizes\nnever less than a few hundred pc; the central densities are typically 10-20\nGeV/cc; no galaxy is found with a dark mass halo less massive than ~5.10^7\nM_sun. We are discovering many more dSphs, which we are analysing to test the\ngenerality of these results.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0608701%2Castro-ph%2F0608428%2Castro-ph%2F0608308%2Castro-ph%2F0608317%2Castro-ph%2F0608149%2Castro-ph%2F0608165%2Castro-ph%2F0608348%2Castro-ph%2F0608531%2Castro-ph%2F0608695%2Castro-ph%2F0608001%2Castro-ph%2F0608180%2Castro-ph%2F0608516%2Castro-ph%2F0608501%2Castro-ph%2F0608528%2Castro-ph%2F0608358%2Castro-ph%2F0608560%2Castro-ph%2F0608073%2Castro-ph%2F0608568%2Castro-ph%2F0608512%2Castro-ph%2F0608097%2Castro-ph%2F0608509%2Castro-ph%2F0608381%2Castro-ph%2F0608527%2Castro-ph%2F0608421%2Castro-ph%2F0608681%2Castro-ph%2F0608478%2Castro-ph%2F0608172%2Castro-ph%2F0608336%2Castro-ph%2F0608318%2Castro-ph%2F0608638%2Castro-ph%2F0608676%2Castro-ph%2F0608019%2Castro-ph%2F0608584%2Castro-ph%2F0608663%2Castro-ph%2F0608561%2Castro-ph%2F0608267%2Castro-ph%2F0608691%2Castro-ph%2F0608099%2Castro-ph%2F0608292%2Castro-ph%2F0608471%2Castro-ph%2F0608590%2Castro-ph%2F0608303%2Castro-ph%2F0608321%2Castro-ph%2F0608115%2Castro-ph%2F0608686%2Castro-ph%2F0608669%2Castro-ph%2F0608166%2Castro-ph%2F0608431%2Castro-ph%2F0608662%2Castro-ph%2F0608341%2Castro-ph%2F0608138%2Castro-ph%2F0608069%2Castro-ph%2F0608454%2Castro-ph%2F0608144%2Castro-ph%2F0608565%2Castro-ph%2F0608557%2Castro-ph%2F0608330%2Castro-ph%2F0608379%2Castro-ph%2F0608495%2Castro-ph%2F0608569%2Castro-ph%2F0608522%2Castro-ph%2F0608122%2Castro-ph%2F0608107%2Castro-ph%2F0608481%2Castro-ph%2F0608440%2Castro-ph%2F0608158%2Castro-ph%2F0608187%2Castro-ph%2F0608346%2Castro-ph%2F0608098%2Castro-ph%2F0608083%2Castro-ph%2F0608513%2Castro-ph%2F0608368%2Castro-ph%2F0608066%2Castro-ph%2F0608171%2Castro-ph%2F0608193%2Castro-ph%2F0608554%2Castro-ph%2F0608459%2Castro-ph%2F0608008%2Castro-ph%2F0608626%2Castro-ph%2F0608121%2Castro-ph%2F0608383%2Castro-ph%2F0608002%2Castro-ph%2F0608168%2Castro-ph%2F0608086%2Castro-ph%2F0608386%2Castro-ph%2F0608145%2Castro-ph%2F0608673%2Castro-ph%2F0608067%2Castro-ph%2F0608269%2Castro-ph%2F0608141%2Castro-ph%2F0608635%2Castro-ph%2F0608474%2Castro-ph%2F0608643%2Castro-ph%2F0608059%2Castro-ph%2F0608490%2Castro-ph%2F0608380%2Castro-ph%2F0608633%2Castro-ph%2F0608685%2Castro-ph%2F0608209%2Castro-ph%2F0608324%2Castro-ph%2F0608023&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Milky Way satellite dwarf spheroidal (dSph) galaxies are the smallest\ndark matter dominated systems in the universe. We have underway dynamical\nstudies of the dSph to quantify the shortest scale lengths on which Dark Matter\nis distributed, the range of Dark Matter central densities, and the density\nprofile(s) of DM on small scales. Current results suggest some surprises: the\ncentral DM density profile is typically cored, not cusped, with scale sizes\nnever less than a few hundred pc; the central densities are typically 10-20\nGeV/cc; no galaxy is found with a dark mass halo less massive than ~5.10^7\nM_sun. We are discovering many more dSphs, which we are analysing to test the\ngenerality of these results."}, "authors": ["G Gilmore", "M Wilkinson", "J Kleyna", "A Koch", "N. Wyn Evans", "R. F. G. Wyse", "E. K. Grebel"], "author_detail": {"name": "E. K. Grebel"}, "author": "E. K. Grebel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysbps.2007.08.143", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0608528v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0608528v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Presented at UCLA Dark Matter 2006 conference, March 2006. In press\n  in Nuclear Physics B", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0608528v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0608528v1", "journal_reference": "Nucl.Phys.Proc.Suppl.173:15-18,2007", "doi": "10.1016/j.nuclphysbps.2007.08.143", "fulltext": "Observed Properties of Dark Matter: dynamical studies of dSph galaxies\nG Gilmore1 , M Wilkinson1 , J Kleyna2 , A Koch4 , Wyn Evans1 , R.F.G. Wyse3 , E.K. Grebel4\n\narXiv:astro-ph/0608528v1 24 Aug 2006\n\n1: Institute of Astronomy, Cambridge, UK; 2: Institute for Astronomy,\nHonolulu, Hawaii, USA; 3: Johns Hopkins University, Baltimore,\nUSA; 4: Astronomical Institute, University of Basel, Switzerland\nThe Milky Way satellite dwarf spheroidal (dSph) galaxies are the smallest dark matter dominated\nsystems in the universe. We have underway dynamical studies of the dSph to quantify the shortest\nscale lengths on which Dark Matter is distributed, the range of Dark Matter central densities, and\nthe density profile(s) of DM on small scales. Current results suggest some surprises: the central\nDM density profile is typically cored, not cusped, with scale sizes never less than a few hundred pc;\nthe central densities are typically 10 − 20GeV/cc; no galaxy is found with a dark mass halo less\nmassive than ∼ 5.107 M⊙ . We are discovering many more dSphs, which we are analysing to test the\ngenerality of these results.\n\nI.\n\nINTRODUCTION AND METHODOLOGY\n\nDetermining the nature of the dark matter is one of\nthe key goals of contemporary astronomy. The extremely\nlarge mass to light ratios for certain Local Group dwarf\nspheroidal (dSph) galaxies suggest that these are the\nmost dark matter dominated stellar systems known in\nthe Universe. Given the apparent absence of dark matter in globular clusters (length scale ∼ 10pc), and the\ndirect evidence that there is no dark matter associated\nwith the galactic thin disk (length scale ∼ 100pc; [8, 9])\nthe dSphs (characteristic radii ∼ 300+ pc) are both the\nsmallest systems to contain dynamically significant quantities of dark matter, and the most nearby systems where\nwe may look for characteristic properties of the distribution of dark matter (maximum density, etc ...), which\nmay provide some knowledge of its nature. Additionally, simulations of dark halo formation in a cosmological context predict that dSph galaxies are (unmodified?)\nsurvivors from the earliest structures formed, so that understanding their nature and structure also has general\nimplications for galaxy formation and evolution.\nIs it possible reliably to determine the dark matter distribution in a dSph galaxy? Fortunately, some dSphs are\nastrophysically simple, are old, are apparently in equilibrium, have no dynamically-significant gas, but contain a\n(small) number of stars, which provide ideal kinematic\ncollisionless tracer particles. With the new generation of\nwide-field multi-object spectrographs on 4-8m telescopes,\nit is now viable to obtain sufficient high-quality kinematic\ndata to determine the gravitational potentials in all the\nGalactic satellites. There are two types of analysis feasible with current datasets: a straighforward pressuregravity balance analysis, based on the velocity dispersion\nmoment, using the Jeans' equations, and an analysis of\nthe full projected kinematic distribution function, using\nthe full information set but requiring more sophisticated\nanalyses. These analyses are made more robust, and simplified, by stellar population studies of the dSph galaxies. Ultra-deep HST imaging for Draco [3] and UMi [17]\nshow their stellar populations are indeed indistinguishable from those of old metal-poor globular star clusters,\n\nand hence have M/LV ∼ 2.\nThe Jeans' equations for a spherical stellar system lead\ndirectly to a model-independent mass estimator (see [1]\nEq. 4-55 & 4-56) requiring only knowledge of the velocity\nanisotropy and the true radial velocity dispersion hvr2 i.\nAssuming spherical symmetry, it is straightforward to\nobtain hvr2 i from the line of sight velocity dispersion hv 2 i\nusing Abel integrals. In applying the Jeans' equation\nanalyses, the spatially-binned dispersion profile is fit by\nan appropriate smooth function (figure 1), while the light\nis fit by a Plummer law, as this is an excellent fit to\navailable star count data in all available cases (cf [4]).\n\n100\nDraco\n10\n1\n0.1\n0.01\n10\n\n20\n\n30\n\n40\n\n50\n\nR (arcmin)\n\n20\n15\n10\n5\n0\n0\n\n10\n\n20\n\n30\n\n40\n\nR (arcmin)\nFIG. 1: Draco surface brightness profile, with a fitted Plummer model, and the observed line of sight velocity dispersion\nprofile, from [4].\n\n\f2\n\n20\nRadial\nStep function\nIsotropic\nTangential\n\n15\n\nsolar visual band units), and extended dark matter halos. Even in the inner regions mass does not follow light,\nwhile including outer data commonly we find a most\nlikely global mass to light ratio which is very high, being\nfor Draco ∼ 440, 200 times greater than that for stars\nwith a normal mass function (Fig. 1). The Draco halo\nmodels favoured by the data contain significant amounts\nof mass at large radii, leading to the observed flat to rising velocity dispersion profiles at intermediate to large\nradii.\n9\n\n10\n\n8\n\nρ (Mο kpc−3 )\n\nThe Jeans' equation moment analysis involves two radial functions, the mass density and a possibly variable anisotropy in the stellar orbits, this second generating an anisotropic stress tensor. It is this anisotropic\nstress which gives the dSph galaxies their shapes, as direct observational limits exclude any angular momentum\nsupport against gravity. Equivalently, radially variable\nanisotropy is degenerate with mass (figure 2) making\nany deductions on the inner mass profile being cored or\ncusped in general model-dependent. Further information\nis needed to break this degeneracy, and fortunately is\nsometimes available, as we discuss below. In general however, full multi-component distribution-function models\nare required to use the information in the data to break\nthis degeneracy.\n\n10\n\n7\n\n10\n\n6\n\n10\n\n10\n\n−1\n\n0\n\n10\n\n10\nr (kpc)\n\nFIG. 3: Derived inner mass distributions from Jeans' eqn\nanalyses for four dSph galaxies. Also shown is a predicted\nr −1 density profile. The modelling is reliable in each case\nout to radii of log (r)kpc∼ 0.5. The unphysical behaviour at\nlarger radii is explained in the text. The general similarity of\nthe four inner mass profiles is striking.\n\n5\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nFIG. 2: An illustration of the possible effects of stellar orbital\nanistropy variations on kinematic modelling, from [16].\n\nII.\n\nUrsa Minor\nDraco\nCarina\nSextans\n1/r\n\nRESULTS OF DYNAMICAL ANALYSES\n\nAre dSph haloes cusped or cored? Debate continues\nto rage about whether the cusped haloes always created\nin CDM simulations are in conflict with observations of\nrotation curves of Low Suface Brightness galaxies. The\ngas-free nature of dSphs makes them kinematically clean\nsystems in which to test theoretical predictions. Stellar\nvelocities may also be used to place constraints on the\nsteepness of any possible central cusp, whether due to a\nblack hole, the intrinsic physical properties of the CDM\n(eg [14]), or possibly even CDM as modified by a central\nblack hole (eg [12]).\nAs a general result, in all cases with sufficient data we\nrule out (King model) mass-follows-light models. King\nmodels are not an adequate description of these galaxies, all of which have high mass-to-light ratios (quoted in\n\nIn some cases (eg Draco, cf Figure 1) a decrease in\nthe disersion is apparent in the outermost data. This remains to be fully understood. The decrease is apparently\nsteeper than Keplerian, so does not indicate the (first)\ndetection of the outer limits of the galaxy. It cannot indicate tidal perturbations by the Milky Way galaxy, and\nin fact robustly excludes such complications, as tides heat\nand do not cool (eg [13]). It may indicate a combination\nof a radially-changing orbital anisotropy and a complex\nstellar kinematic distribution function (Figure 2). In any\ncase, this illustrates that an adequate understanding of\nthe very outer parts of the dSph is still lacking, so that we\nare unable as yet to determine outer mass distributions,\nor 'total' masses. The situation in the inner regions is\nhowever better defined and understood.\nFigure 3 summarises Jeans equation models for several of the dSph, with in each case the simplest possible\nassumptions (isotropic radially-constant velocity distribution). It is apparent that the models are invalid at\nlarge radii, where an unphysical oscillation in the mass\nprofiles is evident. In the inner regions however the fit to\nthe data is good. In each case, a core-like mass distribution is preferred. As noted above however, it is possible,\nby adding a radially-variable stellar anisotropy (essentially an extra function) to the fit, to fit steeper cusp-like\n\n\f3\nvelocity as the systemic velocity of UMi, so they must\norbit close to the plane of the sky, and hence through the\ncentral regions of UMi. As figure (4b) illustrates, this\nis possible only if the tidal forces from the UMi central\nmass gradient are weak. In fact, survival of this phasespace structure in configuration space requires that UMi\nhas a cored mass profile. Similar results are provided by\nthe survival of the globular cluster system in the Fornax\ndSph [2].\n\nA.\n\nFIG. 4: TOP: Result of search for kinematic sub-populations\nin UMi. Coutours are linearly spaced stellar isopleths; the\nsecond peak of UMi's stellar population is visible at RA =\n12′ , Dec = 8′ relative to UMi's center. Gray stars are UMi\nRGB member stars with measured velocities. The dots represent points where a model with a kinematically cold subpopulation is at least 1000 times more likely than a model\ncomposed of a single 8.8 km s−1 Gaussian. BOTTOM: Simulation of an unbound clump in a dark matter halo. The halo\nhas a density law ρ(r) ∝ (a2 + r 2 )−1/2 ; the time t is in units\nof Gyr. Top panel: a clump in a cored halo with a = 0.85\npersists for a Hubble time because the potential is nearly harmonic. Bottom panel: a clump in a cusped potential (a = 0)\ndisrupts in less than 1 Gyr. The histograms at the upper\nright corner of each snapshot show the distribution of total\nvelocity v = (vx2 + vy2 + vz2 )1/2 ; tick marks are spaced 1 km s−2\napart. The stars in a cored halo remain coherent in velocity\nas well as in position. From [5].\n\ncentral mass distributions.\nCan one distinquish between shallow and steep density profiles using other information? Fortunately, in one\nspecial case, that of UMi, one can. In UMi, an otherwise very simple system from an astrophysical perspective, an extremely low velocity dispersion sub-structure\nexists (figure 4a). We explain this [5] as a star cluster,\nwhich has become gravitationally unbound (the normal\neventual fate of every star cluster, as mass is lost through\nnormal stellar evolution), and which now survives as a\nmemory in phase space. Why does it survive in configuration space? The group of stars have the same mean\n\nDistribution Function models\n\nStandard cosmological simulations tend to overpredict\nthe numbers of low-mass haloes surrounding Milky Waytype galaxies compared to observations. One possible\nsolution (eg [11]) is that all dwarf galaxies have very extended haloes, and are therefore very much more massive than previously thought. According to the Stoehr\netal analysis, the observed dispersion profile of Draco and\nFornax can be obtained by embedding the stellar distri9\nbutions in ΛCDM haloes of masses >\n∼ 10 M⊙ , extending\nto several kpc. While our existing data on Draco are compatible with this hypothesis, it is not known whether it\nholds in general. More reliable masses and mass profiles\nare therefore desirable.\nThe principal objective of our dynamical modelling\nwork to date has been to move beyond the traditional\nKing models for dSphs, in order to break the principal\ndegeneracy of the problem, namely that a large velocity dispersion at large radii in a dSph can be explained\neither by the presence of large amounts of unseen mass\nat large radii, or by tangential anisotropy of the velocity distribution. We have therefore developed a family\nof dynamical models (described in detail in [15]) which\nspan the full range of possible halo models from massfollows-light to extended haloes. The models also incorporate anisotropy in the velocity distribution. Our\ncurrent modelling has focussed on spherically symmetric dark haloes and stellar distributions. Our analysis\nof our Draco data, together with extensive Monte Carlo\nsimulations, has demonstrated that data sets of several\nhundred radial velocities are sufficient to discriminate between halo models and to break the degeneracy between\nmass and velocity anisotropy, provided these data are at\nsufficiently large radii [4];[15]. The outermost data also\nplace constraints on any systemic rotation or tumbling\nwhich might contribute, along with anisotropic kinematics, to the flattening seen in some dsph galaxies, and\nprovide further direct tests that a system is unaffected\nby tides, so that an equilibrium dynamical analysis is\nappropriate.\nThe results of spherical modelling supports the basic\nresults of the Jeans' equation analysis, though of course\nuse more information, so are more robust. We are currently implementing new families of models to allow more\nrobust distinction between cored and cusped mass distributions in the dSph. One new option allowed by extant\n\n\f4\nDF models is to test the viability of the alternative gravity theory, MOND. Wilkinson et al. have carried out\nsuch an analysis, concluding that even with MOND dark\nmatter is required. Available data for the Fornax dSph\ncan in fact be modelled quite well by MOND, assuming\nthe MOND scale parameter to be a0 = 2.1 × 10−8cms−2 .\nFor UMi and Draco, however, even MOND requires either a high M/L value (∼ 20), or a very different length\nscale parameter (a0 ∼ 50 × 10−8 cms−2 ).\nIII. GENERAL RESULTS: SYSTEMATIC\nPROPERTIES OF DARK MATTER ON SMALL\nSCALES\n3.5\n3\n\nlog(M/L)tot,V\n\n2.5\n2\n\nUMajor\nDraco\nAndIX\n\nUMinor\nCarina\n\nSextans\nPhoenix\nAndII\n\n1.5\n\nLeoII\n\nFornax\n\n1\nLeoI\nSculptor\n\n0.5\n\nSecondly, all the dSph we have analysed to date\nshow very similar, and perhaps surprisingly low, central\ndark matter mass densities, with a maximum value of\n∼ 5 × 108 M⊙ kpc−3 , equivalent to ∼ 20GeV/cc. Interestingly, the rank ordering of the central densities is in\ninverse proportion to system total luminosity, with the\nleast luminous galaxies being the most dense. This is of\nthe opposite sign to some CDM predictions, though we\nnote a yet further complication involving system mass\nbelow, since most CDM simulations predict mass rather\nthan luminosity.\nWe have not yet detected a reliable Keplerian decline,\nor any evidence for tidal truncation, in any dSph galaxy\ndark halo studied so far. We therefore (still) have no total mass determinations. Nonetheless, the total masses\ndetermined out to the limits of the stellar distribution\nshow an interesting systematic effect. This is shown in\nFigure 5, a plot whose style is adopted from [10]. Figure 5 displays the relationship between the luminosity of\nthe lowest-luminosity Local Group galaxies against the\nderived (logarithmic) system mass-to-light ratio. In this\nparameter space, the solid curve shows the relationship\nanticipated if every dSph galaxy contains the same mass\nof dark matter - in this case some ∼ 4 − 5.107 M⊙ within\nthe volume which contains its stellar population. The\nsystem total luminosity is measured directly.\n\n0\n−8\n\n−10\n\n−12\nMv\n\n−14\n\n−16\n\nFIG. 5: Mass to light ratios vs galaxy absolute V magnitude\nfor some Local Group dSph galaxies. The solid curve shows\nthe relation expected if all the dSph galaxies contain about\n4 × 107 solar masses of dark matter interior to their stellar\ndistributions.\n\nThe profiles in figure 3, derived by Jeans' equation\nanalyses, illustrate two of our basic results. In every case,\nthe simplest analysis favours cored mass distributions.\nWhile cusped mass distribution can usually be fit to the\ndata, in at least one case, UMi, there is very strong direct\nevidence that a cusp model is inadequate to explain all\nthe available information. The conservative assumption\nis therefore that all the mass profiles are indeed cored,\nand are significantly shallower than r−1 .\n\n[1] Binney, J & Tremaine, S 1987 Galactic Dynamics\n(Princeton: PUP)\n[2] Goerdt etal 2006 MNRAS 368 1073\n[3] Grillmair etal 1998 AJ 115, 144\n[4] Kleyna et al. 2001 ApJ 564 L115\n[5] Kleyna etal 2003 ApJ 588 L21\n[6] Kleyna, J., Wilkinson, M, Evans, N. Wyn, Gilmore, G\n2005 ApJ 630 L141\n[7] Koch, A etal AJ in press 2006\n[8] Kuijken, K., & Gilmore, G. 1989 MNRAS 239 605\n[9] Kuijken, K., & Gilmore, G. 1991 ApJ 367 L9\n\nIt is apparent from Figure 5 that there is remarkably\nlittle spread in mass apparent among the galaxies with\nabsolute magnitute fainter than ∼ −11. This relation was\nconsidered until recently to be a minor curiosity, since it\ncovered the dynamic range only from MV ∼ −13 to −9,\na mere factor of forty or so in luminosity, and included\nonly 8 galaxies. However, the recent analysis [6] of the\nnewly-discovered extremely low luminosity dSph galaxy\nUMa has extended the validity of the relation by another\ntwo magnitudes, now a factor of ∼ 200 in luminosity,\nand to total mass-to-light ratios in excess of 1000. Several other new very low luminosity dSph satellite galaxy\ncandidates have been discovered in the last few months,\nwhile new studies of several known galaxies have recently\nbeen completed [7]. It will be very interesting to see if\nthese dynamical studies strengthen or disprove this apparent trend.\n\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n\nMateo etal 1998 AJ 116 2315\nStoehr et al. 2002 MNRAS 335 L84\nRead, J and Gilmore, G. 2005 MNRAS 356 107\nRead, J. I.; Wilkinson, M. I.; Evans, N. Wyn; Gilmore,\nG.; Kleyna, Jan T. 2006 MNRAS 367 387\nTremaine etal 2002 ApJ 574, 740\nWilkinson et al. 2002 MNRAS 330 778\nWilkinson etal 2004 ApJ 611 L21\nWyse etal, NewAstr 7 395 2002\n\n\f"}