{"id": "http://arxiv.org/abs/astro-ph/0502172v1", "guidislink": true, "updated": "2005-02-08T22:24:23Z", "updated_parsed": [2005, 2, 8, 22, 24, 23, 1, 39, 0], "published": "2005-02-08T22:24:23Z", "published_parsed": [2005, 2, 8, 22, 24, 23, 1, 39, 0], "title": "Discovery of a candidate protoplanetary disk around the embedded source\n  IRc9 in Orion", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0502280%2Castro-ph%2F0502515%2Castro-ph%2F0502267%2Castro-ph%2F0502441%2Castro-ph%2F0502037%2Castro-ph%2F0502368%2Castro-ph%2F0502169%2Castro-ph%2F0502252%2Castro-ph%2F0502207%2Castro-ph%2F0502179%2Castro-ph%2F0502032%2Castro-ph%2F0502484%2Castro-ph%2F0502364%2Castro-ph%2F0502012%2Castro-ph%2F0502314%2Castro-ph%2F0502005%2Castro-ph%2F0502123%2Castro-ph%2F0502029%2Castro-ph%2F0502014%2Castro-ph%2F0502084%2Castro-ph%2F0502054%2Castro-ph%2F0502591%2Castro-ph%2F0502096%2Castro-ph%2F0502215%2Castro-ph%2F0502243%2Castro-ph%2F0502281%2Castro-ph%2F0502165%2Castro-ph%2F0502117%2Castro-ph%2F0502535%2Castro-ph%2F0502409%2Castro-ph%2F0502277%2Castro-ph%2F0502130%2Castro-ph%2F0502094%2Castro-ph%2F0502083%2Castro-ph%2F0502124%2Castro-ph%2F0502181%2Castro-ph%2F0502118%2Castro-ph%2F0502431%2Castro-ph%2F0502265%2Castro-ph%2F0502369%2Castro-ph%2F0502306%2Castro-ph%2F0502475%2Castro-ph%2F0502558%2Castro-ph%2F0502507%2Castro-ph%2F0502134%2Castro-ph%2F0502394%2Castro-ph%2F0502172%2Castro-ph%2F0502261%2Castro-ph%2F0502105%2Castro-ph%2F0502131%2Castro-ph%2F0502572%2Castro-ph%2F0502229%2Castro-ph%2F0502036%2Castro-ph%2F0502546%2Castro-ph%2F0502043%2Castro-ph%2F0502222%2Castro-ph%2F0502317%2Castro-ph%2F0502191%2Castro-ph%2F0502057%2Castro-ph%2F0502393%2Castro-ph%2F0502240%2Castro-ph%2F0502156%2Castro-ph%2F0502133%2Castro-ph%2F0502180%2Castro-ph%2F0502438%2Castro-ph%2F0502153%2Castro-ph%2F0502566%2Castro-ph%2F0502344%2Castro-ph%2F0502434%2Castro-ph%2F0502407%2Castro-ph%2F0502111%2Castro-ph%2F0502430%2Castro-ph%2F0502271%2Castro-ph%2F0502363%2Castro-ph%2F0502163%2Castro-ph%2F0502376%2Castro-ph%2F0502476%2Castro-ph%2F0502006%2Castro-ph%2F0502521%2Castro-ph%2F0502088%2Castro-ph%2F0502534%2Castro-ph%2F0502549%2Castro-ph%2F0502067%2Castro-ph%2F0502103%2Castro-ph%2F0502539%2Castro-ph%2F0502239%2Castro-ph%2F0502076%2Castro-ph%2F0502145%2Castro-ph%2F0502458%2Castro-ph%2F0502150%2Castro-ph%2F0502579%2Castro-ph%2F0502585%2Castro-ph%2F0502536%2Castro-ph%2F0502223%2Castro-ph%2F0502040%2Castro-ph%2F0502143%2Castro-ph%2F0502466%2Castro-ph%2F0502575%2Castro-ph%2F0502033%2Castro-ph%2F0502178%2Castro-ph%2F0502419&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Discovery of a candidate protoplanetary disk around the embedded source\n  IRc9 in Orion"}, "summary": "We report the detection of spatially-extended mid-infrared emission around\nthe luminous embedded star IRc9 in OMC-1, as seen in 8.8, 11.7, and 18.3 micron\nimages obtained with T-ReCS on Gemini South. The extended emission is\nasymmetric, and the morphology is reminiscent of warm dust disks around other\nyoung stars. The putative disk has a radius of roughly 1.5 arcsec (700 AU), and\na likely dust mass of almost 10 Earth masses. The infrared spectral energy\ndistribution of IRc9 indicates a total luminosity of about 100 Lsun, implying\nthat it shall become an early A-type star when it reaches the main sequence.\nThus, the candidate disk around IRc9 may be a young analog of the planetary\ndebris disks around Vega-like stars and the disks of Herbig Ae stars, and may\nprovide a laboratory in which to study the earliest phases of planet formation.\nA disk around IRc9 may also add weight to the hypothesis that an enhanced T\nTauri-like wind from this star has influenced the molecular outflow from the\nOMC-1 core.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0502280%2Castro-ph%2F0502515%2Castro-ph%2F0502267%2Castro-ph%2F0502441%2Castro-ph%2F0502037%2Castro-ph%2F0502368%2Castro-ph%2F0502169%2Castro-ph%2F0502252%2Castro-ph%2F0502207%2Castro-ph%2F0502179%2Castro-ph%2F0502032%2Castro-ph%2F0502484%2Castro-ph%2F0502364%2Castro-ph%2F0502012%2Castro-ph%2F0502314%2Castro-ph%2F0502005%2Castro-ph%2F0502123%2Castro-ph%2F0502029%2Castro-ph%2F0502014%2Castro-ph%2F0502084%2Castro-ph%2F0502054%2Castro-ph%2F0502591%2Castro-ph%2F0502096%2Castro-ph%2F0502215%2Castro-ph%2F0502243%2Castro-ph%2F0502281%2Castro-ph%2F0502165%2Castro-ph%2F0502117%2Castro-ph%2F0502535%2Castro-ph%2F0502409%2Castro-ph%2F0502277%2Castro-ph%2F0502130%2Castro-ph%2F0502094%2Castro-ph%2F0502083%2Castro-ph%2F0502124%2Castro-ph%2F0502181%2Castro-ph%2F0502118%2Castro-ph%2F0502431%2Castro-ph%2F0502265%2Castro-ph%2F0502369%2Castro-ph%2F0502306%2Castro-ph%2F0502475%2Castro-ph%2F0502558%2Castro-ph%2F0502507%2Castro-ph%2F0502134%2Castro-ph%2F0502394%2Castro-ph%2F0502172%2Castro-ph%2F0502261%2Castro-ph%2F0502105%2Castro-ph%2F0502131%2Castro-ph%2F0502572%2Castro-ph%2F0502229%2Castro-ph%2F0502036%2Castro-ph%2F0502546%2Castro-ph%2F0502043%2Castro-ph%2F0502222%2Castro-ph%2F0502317%2Castro-ph%2F0502191%2Castro-ph%2F0502057%2Castro-ph%2F0502393%2Castro-ph%2F0502240%2Castro-ph%2F0502156%2Castro-ph%2F0502133%2Castro-ph%2F0502180%2Castro-ph%2F0502438%2Castro-ph%2F0502153%2Castro-ph%2F0502566%2Castro-ph%2F0502344%2Castro-ph%2F0502434%2Castro-ph%2F0502407%2Castro-ph%2F0502111%2Castro-ph%2F0502430%2Castro-ph%2F0502271%2Castro-ph%2F0502363%2Castro-ph%2F0502163%2Castro-ph%2F0502376%2Castro-ph%2F0502476%2Castro-ph%2F0502006%2Castro-ph%2F0502521%2Castro-ph%2F0502088%2Castro-ph%2F0502534%2Castro-ph%2F0502549%2Castro-ph%2F0502067%2Castro-ph%2F0502103%2Castro-ph%2F0502539%2Castro-ph%2F0502239%2Castro-ph%2F0502076%2Castro-ph%2F0502145%2Castro-ph%2F0502458%2Castro-ph%2F0502150%2Castro-ph%2F0502579%2Castro-ph%2F0502585%2Castro-ph%2F0502536%2Castro-ph%2F0502223%2Castro-ph%2F0502040%2Castro-ph%2F0502143%2Castro-ph%2F0502466%2Castro-ph%2F0502575%2Castro-ph%2F0502033%2Castro-ph%2F0502178%2Castro-ph%2F0502419&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report the detection of spatially-extended mid-infrared emission around\nthe luminous embedded star IRc9 in OMC-1, as seen in 8.8, 11.7, and 18.3 micron\nimages obtained with T-ReCS on Gemini South. The extended emission is\nasymmetric, and the morphology is reminiscent of warm dust disks around other\nyoung stars. The putative disk has a radius of roughly 1.5 arcsec (700 AU), and\na likely dust mass of almost 10 Earth masses. The infrared spectral energy\ndistribution of IRc9 indicates a total luminosity of about 100 Lsun, implying\nthat it shall become an early A-type star when it reaches the main sequence.\nThus, the candidate disk around IRc9 may be a young analog of the planetary\ndebris disks around Vega-like stars and the disks of Herbig Ae stars, and may\nprovide a laboratory in which to study the earliest phases of planet formation.\nA disk around IRc9 may also add weight to the hypothesis that an enhanced T\nTauri-like wind from this star has influenced the molecular outflow from the\nOMC-1 core."}, "authors": ["Nathan Smith", "John Bally"], "author_detail": {"name": "John Bally"}, "author": "John Bally", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/429373", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0502172v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0502172v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 2 figs, Accepted by ApJ Letters", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0502172v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0502172v1", "journal_reference": "Astrophys.J. 622 (2005) L65-L68", "doi": "10.1086/429373", "fulltext": "DISCOVERY OF A CANDIDATE PROTOPLANETARY DISK AROUND\nTHE EMBEDDED SOURCE IRc9 IN ORION1\nNathan Smith2 and John Bally\n\narXiv:astro-ph/0502172v1 8 Feb 2005\n\nCenter for Astrophysics and Space Astronomy, University of Colorado, 389 UCB, Boulder, CO 80309;\nnathans@casa.colorado.edu\nABSTRACT\nWe report the detection of spatially-extended mid-infrared emission around the luminous\nembedded star IRc9 in OMC-1, as seen in 8.8, 11.7, and 18.3 μm images obtained with T-ReCS\non Gemini South. The extended emission is asymmetric, and the morphology is reminiscent of\nwarm dust disks around other young stars. The putative disk has a radius of roughly 1.′′ 5 (700\nAU), and a likely dust mass of almost 10 Earth masses. The infrared spectral energy distribution\nof IRc9 indicates a total luminosity of ∼100 L⊙ , implying that it shall become an early A-type\nstar when it reaches the main sequence. Thus, the candidate disk around IRc9 may be a young\nanalog of the planetary debris disks around Vega-like stars and the disks of Herbig Ae stars,\nand may provide a laboratory in which to study the earliest phases of planet formation. A disk\naround IRc9 may also add weight to the hypothesis that an enhanced T Tauri-like wind from\nthis star has influenced the molecular outflow from the OMC-1 core.\nSubject headings: planetary systems: protoplanetary disks - stars: formation - stars: pre–\nmain-sequence\n\n1.\n\nINTRODUCTION\n\nOne of the most spectacular bipolar protostellar outflows known is the system of H2 \"fingers\" emanating\nfrom the BN/KL region in the OMC-1 cloud core (Allen & Burton 1993; Schild et al. 1997; Kaifu et al.\n2000), at a distance of roughly 460 pc (Bally et al. 2000). Among the embedded infrared (IR) sources\nassociated with the BN/KL complex, the bright source IRc9 (Downes et al. 1981; Wynn-Williams & Becklin\n1974) is relatively isolated, located ∼30′′ north of the rest of BN/KL (see Fig. 1a). The H2 outflow from\nBN/KL appears highly asymmetric, with the northwest/blueshifted part of the flow being brighter and more\nextended. This asymmetry is not easily explained by the tilt angle and corresponding potential extinction of\nthe redshifted flow, since observations of H2 at both 2.12 μm and 12.3 μm show the same degree of asymmetry\n(Beck 1984). Suspiciously, IRc9 is found near the H2 emission peak within the brighter northwest part of the\nbipolar outflow. This may be a simple coincidence, but Beck (1984) has proposed the alternative view that\nIRc9 may have had a direct role in influencing the asymmetric appearance the BN/KL outflow. Specifically,\nBeck (1984) suggests that a T Tauri-like wind from IRc9, if it exists, may have helped create a lower density\n1 Based on observations obtained at the Gemini Observatory, which is operated by the Association of Universities for Research\nin Astronomy, Inc., under a cooperative agreement with the NSF on behalf of the Gemini partnership: the National Science\nFoundation (US), the Particle Physics and Astronomy Research Council (UK), the National Research Council (Canada),\nCONICYT (Chile), the Australian Research Council (Australia), CNPq (Brazil), and CONICET (Argentina).\n2 Hubble\n\nFellow\n\n\f–2–\n\nregion, allowing the northwest part of the BN/KL outflow to escape to larger distances with higher speeds\nthan the southeast counterflow. A direct link between IRc9 and the H2 outflow is supported by unusual\nkinematics seen in spectra of the 12.28 μm H2 emission line, which reveal that the most complex line shapes\nare found in the region near IRc9 (Beck et al. 1982). Thus, while IRc9 does not give rise to the H2 outflow\nitself, it is a good candidate for influencing the outflow's asymmetry.\nIn this Letter we report the detection of a spatially-extended asymmetric dust envelope around IRc9,\nprobably representing a large circumstellar disk. The presence of a disk would add weight to the hypothesis\nthat IRc9 is a young star with an active outflowing wind analogous to T Tauri stars, as required in the\nscenario proposed by Beck (1984). However, even if Beck's interpretation is incorrect, the extended emission\nwe report here suggests that IRc9 is an interesting source in its own right because it may be surrounded\nby a very young protoplanetary disk. The integrated luminosity of IRc9 suggests that when it eventually\nreaches the main-sequence, it will be an early A-type star. Therefore, the disk around IRc9 may also provide\nan example of the youngest phases in a planet-forming disk that will eventually evolve into a debris disk\nanalogous to those seen around Vega-like stars.\n\n2.\n\nOBSERVATIONS\n\nOn 2004 Jan 25, 26, and 27 we used T-ReCS1 on Gemini South to obtain 8.8, 11.7, and 18.3 μm\nimages of IRc9, located about 30′′ north of the BN/KL nebula in Orion (see Fig. 1a). T-ReCS is Gemini\nSouth's facility mid-IR imager and spectrograph with a 320×240 pixel Si:As IBC array, a pixel scale on\nthe 8m telescope of 0.′′ 089, and a resulting field-of-view of 28.′′ 5×21.′′ 4. The observations were taken with a\n15′′ east-west chop throw, and a chopping frequencey of a few Hz (different for each filter). In each filter,\n4 spatially-offset groups of chop-nod pairs (each composed of 10 individual pairs) were combined to make\nthe final image, using the central peak of IRc9 itself for spatial alignment. These observations were part of\na larger wide-field mosaic of Orion, and additional T-ReCS images of Orion from this same dataset were\npresented in an earlier paper (Smith et al. 2004).\nFigures 1b, c, and d show the resulting 8.8, 11.7, and 18.3 μm images of IRc9. The images were flux\ncalibrated using observations of the secondary standard star HD 32887, adopting the values tabulated by\nCohen et al. (1999). Absolute photometric uncertainty is probably dominated by the ∼5% uncertainty in\nthe calibration, rather than the 1σ noise-equivalent flux density in the background for an aperture of the\nsame size given in Table 1. The nights were photometric during the 8.8 and 11.7 μm observations, and the\nsky was photometric for the early part of the 18.3 μm mosaic when IRc9 was observed, although conditions\ndeteriorated later in the night. Background-subtracted photometry for IRc9 is listed in Table 1, measured\nin a 5.′′ 3 diameter aperture to include all the extended structure visible in images.\nTo clarify the extended structure around IRc9, we subtracted a scaled point spread function (PSF)\nfrom the images (Figs. 1e, f , and g), and Table 1 also lists the corresponding flux of the star that was\nsubtracted and the residual emission left after the PSF subtraction. The PSF used for subtraction in each\nfilter was the corresponding observation of the standard star, obtained ∼10 min before the 8.8 and 18.3 μm\nobservations, and ∼25 min prior to the 11.7 μm observation of IRc9. The empirical PSF was scaled and\nsubtracted from each of the IRc9 images in a somewhat subjective manner – chosen to minimize residual\nemission near the star without severely over-subtracting the central PSF (i.e. to avoid creating negative\n1 http://www.gemini.edu/sciops/instruments/miri/MiriIndex.html.\n\n\f–3–\n\nflux values). Uncertainty in the residual flux may be as high as 30% at 8.8 μm where the central star was\nbright compared to the total extended flux, but the photometric uncertainty in the residual flux at 18.3 μm\nis comparable to the ∼5% calibration uncertainty because the extended emission constitues the majority of\nthe flux from IRc9 at that wavelength. Obviously the uncertainty in the residual structure is highest near\nthe position of the star where small differences in the PSF may leave the most severe artifacts (especially at\nthe shorter wavelengths). However, structure beyond 1′′ from the star's position is much more reliable, and\nthe uncertainty there is comparable to the statistical uncertainty (the lowest contour is drawn at 3σ above\nthe background in Figs. 1 ef g).\n\n3.\n\nRESULTS\n\nFigure 1 shows that IRc9 is an extended object, with a size of 3–4′′ , elongated roughly along P.A.≃120◦.\nThis elongated structure is evident both before and after subtraction of the central point source. Given the\nshape of the extended emission, it is likely that the central star powering IRc9 is surrounded by a large dusty\ncircumstellar disk, with the polar axis oriented at P.A.≃30◦ . The residual emission after the PSF subtraction\nis spatially-resolved along both the minor and major axes of the nebula; if this is a tilted circular disk then\nthe difference between the major and minor dimensions suggests that its polar axis is inclined from the plane\nof the sky by perhaps 30◦ .\nIs this emission really from a disk? An alternative view might be that this represents externallyilluminated material in the OMC-1 cloud core, as is the case for many of the complex dust structures seen\nin the BN/KL nebula (e.g., Shuping et al. 2004). While this interpretation is difficult to refute conclusively\nwith the present dataset, we consider it less likely than the disk hypothesis because IRc9 is relatively isolated\nfrom the BN/KL core (see Fig. 1a), and no other point source out of 83 that we detected in our larger mosaic\nof the inner Orion nebula shows similar extended structure. The diameter of this putative disk (1400–1800\nAU) is comparable to or somewhat larger than the largest proplyd silhouette disks in Orion (Bally et al.\n2000; Shuping et al. 2003; Smith et al. 2004a), and is similar to the sizes of several disk candidates seen in\nthe Carina nebula (Smith et al. 2003).\nIRc9's disk is brighter on the southeast side, with the brightness asymmetry being most pronounced\n(roughly a factor of 2) at the longest wavelength. Interestingly, the bright part of the disk faces toward the\nheart of the BN/KL complex. If this apparent asymmetry arises because a portion of IRc9's disk is heated\nexternally by the BN/KL central engine or by interaction with its molecular outflow, this would provide\nevidence that the two objects are indeed at the same distance.\nThe spectral energy distribution (SED) of IRc9 is shown in Figure 2, including the total flux, the\nsubtracted PSF, and the residual emission from Table 1. This SED obviously cannot be reproduced with a\nsingle-temperature dust model, so Figure 2 shows a simple fit using three individual temperature components\nat 750, 170, and 115 K. These individual components are guided by the spatially-resolved photometry in\nTable 1, plotted in Figure 2. The 750 and 170 K components together constitute the central PSF source that\nwas subtracted, while the cooler 115 K dust component matches the flux from the residual emission after\nthe PSF was subtracted (Figs. 1e, f , and g). The central point-like source is probably a mix of reddened\nphotospheric emission and a range of hot dust temperatures in a compact (R <160 AU) disk around the\nstar. The 115 K component represents optically-thin emission from cooler dust in the extended circumstellar\ndisk. The integrated luminosity of each component and the total of all three are listed in Table 2. If the dust\ngrains are small (a <0.2 μm) the dust mass required to emit this IR luminosity can be expressed independent\n\n\f–4–\nof the grain radius and emissivity (see Smith & Gehrz 2005), so that Mdust = [(100ρ)/(3σT 6)] LIR . This\nrelation was used to derive the dust masses for each component in Table 2. If the dominant dust grains are\nlarge (a >1 μm) then the mass estimate is more uncertain and far-IR or submillimeter measurements are\nprobably needed. (However, we do not see an obvious reason why large grains would dominate the grain\nsize distribution in the outer disk for this embedded source, which is shielded from the strong external UV\nradiation field of the Trapezium.)\nMost of the mass resides in the coolest extended component (about 8 M⊕ ), indicating that the disk\naround IRc9 provides a significant reservoir out of which planets may potentially form. Note, however, that\nsince we ignored extinction and since optically-thick regions may be present in the inner disk, the mass\nestimates for the 750 and 170 K components are really a lower limit to the mass of the warm inner parts of\nthe disk. The dust temperature of 115 K in the extended disk is consistent with the equilibrium temperature\nfor small (a ≃0.1 μm) grains at a separation of 1′′ (460 AU) from a central source with a luminosity of\n∼100–200 L⊙ (assuming Qabs /Qem ≈100 for small grains; see Smith & Gehrz 2005 and references therein).\nThis is roughly consistent with or somewhat higher than the integrated IR luminosity of IRc9 (Table 2),\nperhaps suggesting that some of the source luminosity may escape in directions not intercepted by the disk.\n\n4.\n\nDISCUSSION\n\nIf the extended mid-IR emission around IRc9 really does represent a circumstellar disk, then it has\ntwo important ramifications. An active accretion disk around IRc9 would suggest that it is a very young\npre–main-sequence star. This would add plausibility to the hypothesis that it has a strong T Tauri-like\nmass-loss wind that could have potentially affected the appearance of the bipolar molecular outflow from\nBN/KL (Beck 1984), although this hypothesis remains speculative. Additional evidence that IRc9 may be\na very young object comes from its Brγ emission (Beck 1984). If IRc9 is embedded in the outflow from the\nBN/KL region, could it survive? Embedded in the OMC-1 cloud, IRc9 is shielded from photoablation by\nthe intense UV radiation of the Trapezium, where proplyd disks are thought to survive for 105 yr or more\n(O'Dell 1998), whereas the dynamical time of the BN/KL outflow is only about 1000 yr (Lee & Burton 2000;\nDoi et al. 2002). Estimating the disk's ability to survive dynamical interaction with shocks caused by the\nBN/KL outflow itself is more difficult, and probably requires a numerical investigation beyond the scope of\nthis Letter.\nEven more tantilizing is that a young disk around IRc9 may provide a laboratory to study the earliest\nphases of planet formation. Recent studies of several A-type stars have revealed extended thermal-IR emission\nfrom dust in planetary debris disks. Some well-known examples are the disks around β Pic (A5 V; Wahhaj\net al. 2003; Weinberger et al. 2003), HR 4796A (A0 V; Koerner et al. 1998; Jayawardhana et al. 1998;\nSchneider et al. 1999), Fomalhaut (A3 V; Holland et al. 2003), HD 141569 (B9.5 Ve; Weinberger et al. 1999),\nand Vega itself (Holland et al. 1998). These Vega-like stars are typically a few to tens of Myr old – older than\nexpected timescales for planet formation – so mature planets have presumably already formed, and their\ndisks are probably the remnants of the planet formation process. The dust in these disks is thought to be\nreplenished from collisions of planetessimals (Backman & Paresce 1993). These debris disks typically have\nradii somewhat smaller than that of IRc9, but significantly lower masses. It is intriguing that the apparent\nsize, mass, and the mildly asymmetric structure of the material around IRc9 are reminiscent of the disk and\nenvelope around the Herbig Ae star AB Aurigae (Fukugawa et al. 2004).\nThe integrated luminosity of IRc9 is roughly 100 L⊙ , which places it on a pre–main-sequence track for\n\n\f–5–\n\na star that will eventually have MZAMS ≃3–4 M⊙ and an early A spectral type (e.g., Marconi & Palla 2004).\nThus, the disk around IRc9 may be an early analog of these more evolved debris disks, and so we speculate\nthat it is a good candidate for a very young protoplanetary disk around a Vega-like star. If true, IRc9 may\nbe a valuable laboratory for studying the earliest phases of planet formation. In any case, IRc9 certainly\ndeserves closer scrutiny.\nSupport for N.S. was provided by NASA through grant HF-01166.01A from the Space Telescope Science Institute, which is operated\nby the Association of Universities for Research in Astronomy, Inc., under NASA contract NAS5-26555. We thank an anonymous referee\nfor several suggestions that improved the presentation of our results.\n\nREFERENCES\nAllen, D.A., & Burton, M.G. 1993, Nature, 353, 54\nBackman, D.E., & Paresce, F. 1993, in Protostars and Planets III, ed. E.H. Levy & J.I. Lunine (Tucson: U. Arizona Press), 1253\nBally, J., O'Dell, C.R., & McCaughrean, M.J. 2000, AJ, 119, 2919\nBeck, S.C. 1984, ApJ, 281, 205\nBeck, S.C., Bloemhof, E.E., Serabyn, E., Townes, C.H., Tokunaga, A.T., Lacy, J.H., & Smith, H.A. 1982, ApJ, 253, L83\nCohen, M., Walker, R.G., Carter, B., Hammersley, R., Kidger, M., & Nogushi, K. 1999, AJ, 117, 1864\nDoi, T., O'Dell, C.R., & Hartigan, P. 2002, AJ, 124, 445\nDownes, D., Genzel, R., Becklin, E.E., & Wynn-Williams, C.G. 1981, ApJ, 244, 869\nFukugawa, H., et al. 2004, ApJ, 605, L53\nHolland, W.S., et al. 1998, Nature, 392, 788\nHolland, W.S., et al. 2003, ApJ, 582, 1141\nJayawardhana, R., Fisher, S., Hartmann, L., Telesco, C., Pina, R., & Fazio, G. 1998, ApJ, 503, L79\nKaifu, N., et al. 2000, PASJ, 52, 1\nKoerner, D.W., Ressler, M.E., Werner, M.W., & Backman, D.E. 1998, ApJ, 503, L83\nLee, J.K., & Burton, M.G. 2000, MNRAS, 315, 11\nMarconi, M., & Palla, F. 2004, IAU Symp. 224, 119\nO'Dell, C.R. 1998, AJ, 115, 263\nSchild, H., Miller, S., & Tennyson, J. 1997, A&A, 318, 608\nSchneider, G., et al. 1999, ApJ, 513, L127\nShuping, R.Y., Morris, M., & Bally, J. 2004, AJ, 128, 363\nShuping, R.Y., Bally, J., Morris, M., & Throop, H. 2003, ApJ, 587, L109\nSmith, N., Bally, J., & Morse, J.A. 2003, ApJ, 587, L105\nSmith, N., Bally, J., Licht, D., & Walawender, J. 2004a, AJ, 129, 382\nSmith, N., Bally, J., Shuping, R.Y., Morris, M., & Hayward, T.L. 2004b, ApJ, 610, L117\nSmith, N., & Gehrz, R.D. 2005, AJ, 129, 969\nWahhaj, Z., Koerner, D.W., Ressler, M.E., Werner, M.W., Backman, D.E., & Sargent, A.I. 2003, ApJ, 584, L27\nWeinberger, A.J., Becklin, E.E., & Zuckerman, B. 2003, ApJ, 584, L33\nWeinberger, A.J., et al. 1999, ApJ, 525, L53\nWynn-Williams, C.G., & Becklin, E.E. 1974, PASP, 86, 5\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f–6–\n\nFig. 1.- (a) Northern portion of our 11.7 μm image mosaic of the Orion nebula. (b, c, d) Raw images\nof IRc9 at 8.8, 11.7, and 18.3 μm, respectively, corresponding to the box in Panel a. (e, f, g) Same as\nneighboring images, except that an observed PSF has been subtracted. In Panels b–g, the lowest contour\nlevel in Jy arcsec−2 is given in the lower right corner, and each subsequent contour level is a factor of 2 above\nthe previous one.\n\n\f–7–\n\nTable 1. Observations and Photometry of IRc9\nParameter\n\nUnits\n\n8.8 μm\n\n11.7 μm\n\n18.3 μm\n\nfilter ∆λ\nexp. time\n1σ Fν\nFν total\nFν star\nFν PSFsub\nFWZIa\n\nμm\nsec.\nmJy\nJy\nJy\nJy\narcsec\n\n0.78\n72\n8.3\n5.85\n5.25\n0.60\n3.0\n\n1.13\n72\n10.5\n9.46\n6.85\n2.61\n3.6\n\n1.5\n72\n66\n30.5\n10.9\n19.6\n4.0\n\na\nSize of the major-axis diameter of the PSF-subtracted\nemission at the lowest contour level.\n\nTable 2. Luminosity and Dust Mass\nComponent\n\n750 K\n170 K\n115 K\nTotal\n\nLIR\n(L⊙ )\n\nMdust\n(M⊕ )\n\n40\n14\n48\n102\n\n8.8×10−5\n0.22\n8.1\n8.3\n\nFig. 2.- The spectral energy distribution of IRc9. Filled circles are the total flux in a 5.′′ 3 diameter\naperture measured in T-ReCS images, unfilled circles are the PSF-subtracted flux, and stars represent the\nPSF flux that was subtracted. Unfilled squares are 2MASS data, and X's are photometric measurements by\nWynn-Williams & Becklin (1974). The various curves are individual Planck functions fit to the data with\na λ−1 emissivity, or the sum of those Planck functions. The thin solid line represents the extended 115 K\nemission, the dashed line is the central point-like source (the sum of the dotted curves for the 750 and 170\nK components), and the heavy solid line is the total emission.\n\n\f"}