{"id": "http://arxiv.org/abs/astro-ph/0310002v1", "guidislink": true, "updated": "2003-09-30T20:02:23Z", "updated_parsed": [2003, 9, 30, 20, 2, 23, 1, 273, 0], "published": "2003-09-30T20:02:23Z", "published_parsed": [2003, 9, 30, 20, 2, 23, 1, 273, 0], "title": "Axisymmetric MHD simulations of the collapsar model for gamma-ray bursts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0310808%2Castro-ph%2F0310004%2Castro-ph%2F0310643%2Castro-ph%2F0310402%2Castro-ph%2F0310322%2Castro-ph%2F0310483%2Castro-ph%2F0310153%2Castro-ph%2F0310893%2Castro-ph%2F0310102%2Castro-ph%2F0310516%2Castro-ph%2F0310786%2Castro-ph%2F0310255%2Castro-ph%2F0310027%2Castro-ph%2F0310198%2Castro-ph%2F0310388%2Castro-ph%2F0310418%2Castro-ph%2F0310204%2Castro-ph%2F0310266%2Castro-ph%2F0310473%2Castro-ph%2F0310760%2Castro-ph%2F0310097%2Castro-ph%2F0310666%2Castro-ph%2F0310870%2Castro-ph%2F0310700%2Castro-ph%2F0310913%2Castro-ph%2F0310650%2Castro-ph%2F0310083%2Castro-ph%2F0310477%2Castro-ph%2F0310199%2Castro-ph%2F0310532%2Castro-ph%2F0310103%2Castro-ph%2F0310061%2Castro-ph%2F0310015%2Castro-ph%2F0310564%2Castro-ph%2F0310235%2Castro-ph%2F0310600%2Castro-ph%2F0310186%2Castro-ph%2F0310348%2Castro-ph%2F0310304%2Castro-ph%2F0310791%2Castro-ph%2F0310081%2Castro-ph%2F0310725%2Castro-ph%2F0310790%2Castro-ph%2F0310523%2Castro-ph%2F0310878%2Castro-ph%2F0310415%2Castro-ph%2F0310533%2Castro-ph%2F0310910%2Castro-ph%2F0310082%2Castro-ph%2F0310421%2Castro-ph%2F0310013%2Castro-ph%2F0310448%2Castro-ph%2F0310665%2Castro-ph%2F0310623%2Castro-ph%2F0310635%2Castro-ph%2F0310197%2Castro-ph%2F0310489%2Castro-ph%2F0310391%2Castro-ph%2F0310799%2Castro-ph%2F0310242%2Castro-ph%2F0310332%2Castro-ph%2F0310396%2Castro-ph%2F0310211%2Castro-ph%2F0310498%2Castro-ph%2F0310658%2Castro-ph%2F0310709%2Castro-ph%2F0310612%2Castro-ph%2F0310222%2Castro-ph%2F0310427%2Castro-ph%2F0310486%2Castro-ph%2F0310781%2Castro-ph%2F0310048%2Castro-ph%2F0310120%2Castro-ph%2F0310751%2Castro-ph%2F0310002%2Castro-ph%2F0310343%2Castro-ph%2F0310900%2Castro-ph%2F0310637%2Castro-ph%2F0310203%2Castro-ph%2F0310366%2Castro-ph%2F0310314%2Castro-ph%2F0310645%2Castro-ph%2F0310215%2Castro-ph%2F0310341%2Castro-ph%2F0310252%2Castro-ph%2F0310474%2Castro-ph%2F0310510%2Castro-ph%2F0310094%2Castro-ph%2F0212251%2Castro-ph%2F0212308%2Castro-ph%2F0212078%2Castro-ph%2F0212367%2Castro-ph%2F0212317%2Castro-ph%2F0212265%2Castro-ph%2F0212302%2Castro-ph%2F0212460%2Castro-ph%2F0212311%2Castro-ph%2F0212235%2Castro-ph%2F0212271%2Castro-ph%2F0212071%2Castro-ph%2F0212303&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Axisymmetric MHD simulations of the collapsar model for gamma-ray bursts"}, "summary": "We present results from axisymmetric, time-dependent magnetohydrodynamic\n(MHD) simulations of the collapsar model for gamma-ray bursts. We begin the\nsimulations after the 1.7 MSUN iron core of a 25 MSUN presupernova star has\ncollapsed and study the ensuing accretion of the 7 MSUN helium envelope onto\nthe central black hole formed by the collapsed iron core. We consider a\nspherically symmetric progenitor model, but with spherical symmetry broken by\nthe introduction of a small, latitude-dependent angular momentum and a weak\nradial magnetic field. Our MHD simulations include a realistic equation of\nstate, neutrino cooling, photodisintegration of helium, and resistive heating.\nOur main conclusion is that, within the collapsar model, MHD effects alone are\nable to launch, accelerate and sustain a strong polar outflow. We also find\nthat the outflow is Poynting flux-dominated, and note that this provides\nfavorable initial conditions for the subsequent production of a baryon-poor\nfireball.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0310808%2Castro-ph%2F0310004%2Castro-ph%2F0310643%2Castro-ph%2F0310402%2Castro-ph%2F0310322%2Castro-ph%2F0310483%2Castro-ph%2F0310153%2Castro-ph%2F0310893%2Castro-ph%2F0310102%2Castro-ph%2F0310516%2Castro-ph%2F0310786%2Castro-ph%2F0310255%2Castro-ph%2F0310027%2Castro-ph%2F0310198%2Castro-ph%2F0310388%2Castro-ph%2F0310418%2Castro-ph%2F0310204%2Castro-ph%2F0310266%2Castro-ph%2F0310473%2Castro-ph%2F0310760%2Castro-ph%2F0310097%2Castro-ph%2F0310666%2Castro-ph%2F0310870%2Castro-ph%2F0310700%2Castro-ph%2F0310913%2Castro-ph%2F0310650%2Castro-ph%2F0310083%2Castro-ph%2F0310477%2Castro-ph%2F0310199%2Castro-ph%2F0310532%2Castro-ph%2F0310103%2Castro-ph%2F0310061%2Castro-ph%2F0310015%2Castro-ph%2F0310564%2Castro-ph%2F0310235%2Castro-ph%2F0310600%2Castro-ph%2F0310186%2Castro-ph%2F0310348%2Castro-ph%2F0310304%2Castro-ph%2F0310791%2Castro-ph%2F0310081%2Castro-ph%2F0310725%2Castro-ph%2F0310790%2Castro-ph%2F0310523%2Castro-ph%2F0310878%2Castro-ph%2F0310415%2Castro-ph%2F0310533%2Castro-ph%2F0310910%2Castro-ph%2F0310082%2Castro-ph%2F0310421%2Castro-ph%2F0310013%2Castro-ph%2F0310448%2Castro-ph%2F0310665%2Castro-ph%2F0310623%2Castro-ph%2F0310635%2Castro-ph%2F0310197%2Castro-ph%2F0310489%2Castro-ph%2F0310391%2Castro-ph%2F0310799%2Castro-ph%2F0310242%2Castro-ph%2F0310332%2Castro-ph%2F0310396%2Castro-ph%2F0310211%2Castro-ph%2F0310498%2Castro-ph%2F0310658%2Castro-ph%2F0310709%2Castro-ph%2F0310612%2Castro-ph%2F0310222%2Castro-ph%2F0310427%2Castro-ph%2F0310486%2Castro-ph%2F0310781%2Castro-ph%2F0310048%2Castro-ph%2F0310120%2Castro-ph%2F0310751%2Castro-ph%2F0310002%2Castro-ph%2F0310343%2Castro-ph%2F0310900%2Castro-ph%2F0310637%2Castro-ph%2F0310203%2Castro-ph%2F0310366%2Castro-ph%2F0310314%2Castro-ph%2F0310645%2Castro-ph%2F0310215%2Castro-ph%2F0310341%2Castro-ph%2F0310252%2Castro-ph%2F0310474%2Castro-ph%2F0310510%2Castro-ph%2F0310094%2Castro-ph%2F0212251%2Castro-ph%2F0212308%2Castro-ph%2F0212078%2Castro-ph%2F0212367%2Castro-ph%2F0212317%2Castro-ph%2F0212265%2Castro-ph%2F0212302%2Castro-ph%2F0212460%2Castro-ph%2F0212311%2Castro-ph%2F0212235%2Castro-ph%2F0212271%2Castro-ph%2F0212071%2Castro-ph%2F0212303&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present results from axisymmetric, time-dependent magnetohydrodynamic\n(MHD) simulations of the collapsar model for gamma-ray bursts. We begin the\nsimulations after the 1.7 MSUN iron core of a 25 MSUN presupernova star has\ncollapsed and study the ensuing accretion of the 7 MSUN helium envelope onto\nthe central black hole formed by the collapsed iron core. We consider a\nspherically symmetric progenitor model, but with spherical symmetry broken by\nthe introduction of a small, latitude-dependent angular momentum and a weak\nradial magnetic field. Our MHD simulations include a realistic equation of\nstate, neutrino cooling, photodisintegration of helium, and resistive heating.\nOur main conclusion is that, within the collapsar model, MHD effects alone are\nable to launch, accelerate and sustain a strong polar outflow. We also find\nthat the outflow is Poynting flux-dominated, and note that this provides\nfavorable initial conditions for the subsequent production of a baryon-poor\nfireball."}, "authors": ["D. Proga", "A. I. MacFadyen", "P. J. Armitage", "M. C. Begelman"], "author_detail": {"name": "M. C. Begelman"}, "author": "M. C. Begelman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/381158", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0310002v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0310002v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "submitted in ApJ Letters", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0310002v1", "affiliation": "also Department of Astrophysical and Planetary Sciences, University of Colorado, Boulder", "arxiv_url": "http://arxiv.org/abs/astro-ph/0310002v1", "journal_reference": "Astrophys.J.599:L5-L8,2003", "doi": "10.1086/381158", "fulltext": "arXiv:astro-ph/0310002v1 30 Sep 2003\n\nAxisymmetric MHD simulations of the collapsar model for\ngamma-ray bursts\n\nDaniel Proga1 , Andrew I. MacFadyen2 , Philip J. Armitage1,3 , and Mitchell C. Begelman1,3\n1\n2\n3\n\nJILA, University of Colorado, Boulder, CO 80309-0440, USA\n\nCalifornia Institute of Technology, Mail Code 130-33, Pasadena, CA 91125\n\nalso Department of Astrophysical and Planetary Sciences, University of Colorado, Boulder\n\nsubmitted to ApJ Letters on Aug. 28 2003\n\nReceived\n\n;\n\naccepted\n\n\f–2–\nABSTRACT\n\nWe present results from axisymmetric, time-dependent\nmagnetohydrodynamic (MHD) simulations of the collapsar model for\ngamma-ray bursts. We begin the simulations after the 1.7 M⊙ iron core of a\n25 M⊙ presupernova star has collapsed and study the ensuing accretion of the\n7 M⊙ helium envelope onto the central black hole formed by the collapsed iron\ncore. We consider a spherically symmetric progenitor model, but with spherical\nsymmetry broken by the introduction of a small, latitude-dependent angular\nmomentum and a weak radial magnetic field. Our MHD simulations include\na realistic equation of state, neutrino cooling, photodisintegration of helium,\nand resistive heating. Our main conclusion is that, within the collapsar model,\nMHD effects alone are able to launch, accelerate and sustain a strong polar\noutflow. We also find that the outflow is Poynting flux-dominated, and note\nthat this provides favorable initial conditions for the subsequent production of a\nbaryon-poor fireball.\n\nSubject headings: accretion, accretion disks – gamma rays: bursts – methods:\nnumerical – MHD – stars: winds, outflows\n\n\f–3–\n1.\n\nIntroduction\n\nThe collapsar model is one of most promising scenarios to explain the huge release of\nenergy in a matter of seconds, associated with gamma-ray bursts (GRBs; Woosley 1993;\nPaczyński, 1998; MacFadyen & Woosley 1999, hereafter MW; Popham, Woosley & Fryer\n1999; MacFadyen, Woosley & Heger 2001). In this model, the collapsed iron core of a\nmassive star accretes gas at a high rate (∼ 1M⊙ s−1 ) producing a large neutrino flux, a\npowerful outflow, and a GRB. Despite many years of intensive theoretical studies of these\nevents, basic properties of the central engine are uncertain. In part, this is because previous\nnumerical studies of the collapsar model did not explicitly include magnetic fields, although\nthey are commonly accepted as a key element of accretion flows and outflows.\nIn this letter we present a study of the time evolution of magnetohydrodynamic (MHD)\nflows in the collapsar model. This study is an extension of existing models of MHD accretion\nflows onto a black hole (BH; Proga & Begelman 2003, PB03 hereafter). In particular, we\ninclude a realistic equation of state (EOS), photodisintegration of bound nuclei and cooling\ndue to neutrino emission. Our study is also an extension of MW's collapsar simulations, as\nwe consider very similar neutrino physics and initial conditions but solve MHD instead of\nhydrodynamical equations.\n\n2.\n\nMethod\n\nTo calculate the structure and evolution of an accreting flow, we solve the equations of\nMHD:\nDρ\n+ ρ∇ * v = 0,\nDt\nDv\n1\nρ\n= −∇P − ρ∇Φ +\n(∇ × B) × B,\nDt\n4π\n\n(1)\n(2)\n\n\f–4–\ne\nρ\n\nD\nρ\nDt\n\n!\n\n= −P ∇ * v + ηr J2 − L,\n\n∂B\n= ∇×(v × B − ηr J),\n∂t\n\n(3)\n(4)\n\nwhere ρ is the mass density, P is the total gas pressure plus radiation pressure, v is the\nfluid velocity, e is the internal energy density, Φ is the gravitational potential, B is the\nmagnetic field vector, J is the current density, ηr is an anomalous resistivity, and L is the\ncooling rate due to neutrinos.\nTo compute resistivity, we follow Stone & Pringle (2001, see their equations 5 and\nA1). We perform simulations using the pseudo-Newtonian potential of the central mass\nΦpw = GM/(r − RS ), where RS = 2GM/c2 is the Schwarzschild radius, introduced by\nPaczyński & Wiita (1980). We increase the mass of the BH during the calculation by the\namount of baryonic rest mass accreted through the inner boundary.\nOur calculations are performed in spherical polar coordinates (r, θ, φ). We\nassume axial symmetry about the rotational axis of the accretion flow (θ = 0◦\nand 180◦). The computational domain is defined to occupy the radial range\nri = 1.5 RS ≤ r ≤ ro = 1000 RS , and the angular range 0◦ ≤ θ ≤ 180◦ . The\nr − θ domain is discretized on a non-uniform grid as in PB03, which yields ∆r/r = 0.278 at\nthe inner edge of the simulations.\nWe adopt a realistic EOS, which includes contributions from an ideal gas of nuclei,\nradiation, and electrons and positrons with arbitrary degrees of relativity and degeneracy\n(Blinnikov, Dunina-Barkovskaya & Nadyozhin 1996). To compute the cooling rate, we\nfollow Itoh et al. (1989, 1990), taking into account thermal neutrino emission processes\ndominated by pair annihilation, as well as the capture of pairs on free nucleons.\nOur calculations use the ZEUS-2D code described by Stone & Norman (1992a,b). We\nhave extended the code to include the realistic EOS, artificial resistivity, photodisintegration\n\n\f–5–\nand neutrino cooling. We included the terms due to the resistivity and cooling in an\noperator split fashion separately from the rest of the dynamical equations. For stability,\nthese terms must be integrated using the time step computed based on the resistive and\ncooling time scales, respectively. We subcycle whenever either of these two time steps\nis smaller than the time step used in the MHD equations (see, e.g., Stone, Pringle, and\nBegelman 1999). Inclusion of a non-adiabatic EOS requires iterating over temperature, T\n(see MW for details).\nBy including the neutrino cooling and realistic EOS, we consider very similar\nmicrophysics to that used in MW. Our simulations differ from those in MW in that we\nuse the ZEUS MHD code whereas MW used the PROMETHEUS hydrodynamics code\n(Fryxell, Müller & Arnett 1989). This means that we can self-consistently calculate\nturbulent stresses generated by the magnetorotational instability (MRI) and thus include\nthe outward transport of energy and angular momentum (e.g., Balbus & Hawley 1991). MW\nimplemented the effects of viscosity in the disk using an alpha viscosity as prescribed by\nShakura & Sunyaev (1973). We do not consider self-gravity and nuclear burning; however,\nas in MW our simulations track the photodisintegration of helium. Our simulations span\nthe radial direction from 1.5 to 1000 RS whereas MW's simulations span from 9.5 to 9500\nRS . Thus we can capture the innermost part of the flow near the BH but follow the\nevolution out to a smaller radius than MW's simulations.\nWe adopt PB03's boundary conditions and initial conditions for the magnetic field.\nIn particular, the initial magnetic field is purely radial and weak (β ≡ 8πP/B 2 ≫ 1\neverywhere). For the initial conditions of the fluid variables, we follow MW and adopt the\nstellar model for the helium core of a 25 M⊙ presupernova star (model S251S7B@14233 in\nWoosley & Weaver 1995). The masses of the helium and iron core derived from this star are\n7.23 and 1.70 M⊙ , respectively. Similarly to MW's simulations, our simulations start after\n\n\f–6–\nthe entire iron core is assumed to have collapsed to form a BH (with RS = 4.957 × 105 cm),\nbut before the helium envelope has collapsed. The model predicts an inner radius of the\nhelium envelope, RHe , of 2.11×108 cm. Outside this radius, we adopt the radial velocity\nfrom the stellar model, set vθ = 0 and assume a non-zero l. The angular momentum\ndistribution is chosen such that the ratio between the centrifugal force and the component\nof gravity perpendicular to the rotational axis is 0.02 at all angles and radii, except where\nthis prescription results in l > lmax = 1017 cm2 s−1 ; then we set l = lmax . Inside RHe , we set\nvθ = vφ = 0 and assume a free-fall radial velocity. We compute the initial density inside the\nhelium envelope using the mass continuity equation and the mass accretion rate from the\nstellar model at RHe , where ρ = 1.16 × 107 g cm−3 and vr = −8.81 × 107 cm s−1 .\n\n3.\n\nResults\n\nWith these assumptions, there is only one free parameter which defines the strength of\nthe initial magnetic field. In this letter, we present results from a single model for which\nβ = 106 at the outer boundary.\n> 2RS c\nWe find that after a transient episode of infall, lasting 0.13 s, the gas with l ∼\npiles up outside the black hole and forms a thick torus bounded by a centrifugal barrier\nnear the rotation axis. Soon after the torus forms (i.e., a couple of orbits at r = ri ), the\nmagnetic field is amplified by both MRI and shear. We have verified that most of the inner\ntorus is unstable to MRI, and that our simulations have enough resolution to resolve, albeit\nmarginally, the fastest growing MRI mode. The torus starts evolving rapidly and accretes\nonto the black hole. Another important effect of magnetic fields is that the torus produces\na magnetized corona and an outflow. The presence of the corona and outflow is essential to\nthe evolution of the inner flow at all times and the entire flow close to the rotational axis\nduring the latter phase of the evolution. We find that the outflow very quickly becomes\n\n\f–7–\nsufficiently strong to overcome supersonically infalling gas (the radial Mach number in the\npolar funnel near the inner radius is ∼ 5) and makes its way outward, reaching the outer\nboundary at t = 0.25 s. Due to limited computing time, our simulations were stopped at\nt = 0.28215 s, which corresponds to 6705 orbits of the flow near the inner boundary. We\nexpect the accretion to continue much longer, roughly the collapse timescale of the Helium\ncore (∼ 10 s), as in MW.\nFigure 1 shows the time evolution of the mass accretion rate through the inner\nboundary (left panel), total magnetic energy (second left panel), neutrino luminosity (third\nleft panel) and radial Poynting and kinetic flux along the polar axis at r = 190 RS (right\npanel). Unless otherwise stated, all quantities in this paper are in cgs units. Initially,\nduring a precollapse phase, Ṁa stays nearly constant at the level of ∼ 5 × 1032 g s−1 .\nDuring this phase the zero-l gas inside the initial helium envelope is accreted. Around\nt = 0.13 s, Ṁa rises sharply as the gas from the initial helium envelope reaches the inner\nboundary. However, this gas has non-zero l and a rotational supported torus and its corona\nand outflow form, causing a drop in Ṁa after it reaches a maximum of 2 × 1033 g s−1 at\nt = 0.145 s. The accretion rate reaches a minimum of 6 × 1031 g s−1 at t ≈ 0.182 s and then\nfluctuates with a clear long-term increase. This increase is caused by the contribution from\ngas with l < 2RS c, which is directly accreted (without need to transport l) from outside\nthe main body of the torus. The total mass and angular momentum accreted onto the BH\nduring our simulation (0.3 s) are 0.1 M⊙ and 3 × 1039 g cm2 s−1 , respectively.\nThe time evolution of the total magnetic energy (integrated over the entire\ncomputational domain) is characteristic of weakly magnetized rotating accretion flows.\nMost of the magnetic energy is due to the toroidal component of the magnetic field. We\nnote a huge increase of the toroidal magnetic field coinciding with the formation and\ndevelopment of the torus. Both Bφ and Bθ are practically zero during the precollapse\n\n\f–8–\nphase of the evolution. But at t = 0.14 s the total energy in Bφ equals that in Br and just\n0.025 s later the Bφ energy is higher than the Br energy by a factor of 50. At the end of\nsimulations the total kinetic energy from the radial, latitudinal and rotational motion are\n4 × 1050 , 6.5 × 1049 , and 2.3 × 1051 erg, respectively. These gross properties indicate that\nthe magnetic energy is large enough to play an important role in the flow dynamics.\nThe time evolution of the neutrino luminosity, Lν , shows that the neutrino emission\nstays at a relatively constant level of 3 × 1052 erg s−1 after the torus forms. We compute\nLν under the assumption that all the gas in the model is optically thin to neutrinos, so\nthat Lν is volume integrated L over the entire computational domain. We note that Lν\nis dominated by the neutrino emission due to pair capture on free nucleons (the so-called\nURCA cooling).\nThe last panel in Fig. 1 shows the area-integrated radial fluxes of magnetic and kinetic\nenergy at r = 190 RS inside the polar outflow. The outflow is Poynting flux-dominated,\nwith the Poynting flux exceeding the kinetic energy flux by up to an order of magnitude.\nOur analysis of the inner flow shows that the outflow is magnetically driven from\nthe torus. Soon after the torus forms, the magnetic field very quickly deviates from its\ninitial radial configuration due to MRI and shear. This leads to fast growth of the toroidal\nmagnetic field as field lines wind up due to the differential rotation. As a result the toroidal\nfield dominates over the poloidal field and the gradient of the former drives an outflow.\nFigure 2 shows the flow pattern of the inner part of the flow at t = 0.2735 s. The left\nand right panel show density and |Bφ | maps, respectively. The maps are overlaid by the\ndirection of the poloidal velocity. The polar regions of low density and high Bφ coincide\nwith the region of an outflow. We note also that during the latter phase of the evolution\nnot all of the material in the outflow originated in the innermost part of the torus – a\nsignificant part of the outflow is \"peeled off\" the infalling gas at large radii by the magnetic\n\n\f–9–\npressure. Figure 2 illustrates that the inner torus and its corona and outflow cannot always\nprevent the low-l gas from reaching the BH. Even the magnetic field cannot do it if the\ndensity of the incoming gas is too high. Therefore, we find that the outflow of the magnetic\nenergy (mostly toroidal) from the innermost part of the flow does not always correspond\nto an outflow of gas (in other words, the Poynting flux and kinetic energy flux can be in\nopposite directions).\nFigure 3 shows the radial profiles of several quantities in our run, angle-averaged over\na small wedge near the equator (between θ = 86◦ and 94◦ ), and time-averaged over 50 data\nfiles covering a period at the end of the simulations (from 0.2629 s through 0.2818 s). We\nindicate the location of the last stable circular orbit by the vertical dotted line in each\npanel.\nThe profiles of each variable are not simple power-laws but are rather complex. In\nparticular, the density has a prominent maximum of 4 × 1011 g cm−3 at r = 5RS . The gas\nplus radiation pressure is higher than the magnetic pressure. The rotational velocity is\nnearly Keplerian inside r = 6RS and sub-Keplerian outside this radius.\nWe measure the Reynolds stress, αgas ≡< ρvr δvφ > /P , and the Maxwell stress\nnormalized to the magnetic pressure, αmag ≡< 2Br Bφ /B 2 >. Note that Figure 3 shows only\n< 2.5RS\nthe magnitude, not the sign, of the normalized stresses. We find that except for r ∼\n<r∼\n< 12RS , the Maxwell stress dominates over the Reynolds stress in the inner\nand 10RS ∼\nflow. The last panel in Figure 3 shows that the toroidal component of the magnetic field is\ndominant for r < 50 RS .\nWe have compared the cooling time scale and the advection time scale in the flow and\nfound that overall the flow is advection-dominated expect for a small region inside the torus\nwhere the density reaches its maximum.\n\n\f– 10 –\n4.\n\nDiscussion and Conclusions\n\nWe have performed time-dependent two-dimensional MHD simulations of the collapsar\nmodel. Our simulations show that: 1) soon after the rotationally supported torus forms,\nthe magnetic field very quickly starts deviating from purely radial due to MRI and shear.\nThis leads to fast growth of the toroidal magnetic field as field lines wind up due to the\ntorus rotation; 2) The toroidal field dominates over the poloidal field and the gradient of\nthe former drives a polar outflow against supersonically accreting gas through the polar\nfunnel; 3) The polar outflow is Poynting flux-dominated; 4) The polar outflow reaches the\nouter boundary of the computational domain (5 × 108 cm) with an expansion velocity of 0.2\nc; 6) The polar outflow is in a form of a relatively narrow jet (when the jet breaks through\nthe outer boundary its half opening angle is 5◦ ); 7) Most of the energy released during the\naccretion is in neutrinos, Lν = 2 × 1052 erg s−1 . Therefore it is likely that neutrino driving\ncan increase the outflow energy (e.g., Fryer & Mészáros 2003 and references therein).\nOur simulations explore a relatively conservative case where we allow for neutrino\nemission but do not allow for the emitted neutrinos to interact with the gas or annihilate.\nThe only sources of nonadiabatic heating in our simulations are the artificial viscosity and\nresistivity.\nOur main conclusion is that, within the collapsar model, MHD effects are able to\nlaunch, accelerate and sustain a strong polar outflow. We believe that this conclusion\nwill turn out to be largely independent of the initial magnetic field strength in the stellar\ncore, because MRI can rapidly amplify weak fields until they are strong enough to drive a\npowerful outflow. Since our simulations are non-relativistic, and cover only the innermost\nregion of the collapsing star, we cannot determine whether our outflows are sufficient to\nyield a GRB. Additional driving could also be necessary. We also find that the outflow\nis Poynting flux-dominated, and note that this provides favorable initial conditions for\n\n\f– 11 –\nthe subsequent production of a baryon-poor fireball [e.g., Fuller, Pruet & Abazajian\n(2000); Beloborodov (2003); Vlahakis & Königl (2003); Mészáros (2002)], or a magnetically\ndominated \"cold fireball\" [Lyutikov & Blandford (2002)].\nACKNOWLEDGMENTS: DP acknowledges support from NASA under LTSA grants\nNAG5-11736 and NAG5-12867. MCB acknowledges support from NSF grants AST-9876887\nand AST-0307502.\n\n\f– 12 –\nREFERENCES\n\nBalbus, S. A., & Hawley, J. F. 1991, ApJ, 376, 214\nBeloborodov, A.M. 2003, ApJ, 588, 931\nBlinnikov, S.I., Dunina-Barkovskaya, N.V., & Nadyozhin, D. K. 1996, ApJS, 106, 171\nFuller, G. M., Pruet, J., & Abazajian, K. 2000, Phys. Rev. Lett., 85, 2673\nFryxell, B. A., Müller, E., & Arnett, W. D. 1989, MPA Rep. 449 (Garching: MPA)\nFryer, C. L., & Mészáros, P. 2003, ApJ, 588, L25\nItoh, N., Adachi, T., Nakagawa, M., Kohyama, Y., & Munakata, H. 1989, ApJ, 339,\n354\nItoh, N., Adachi, T., Nakagawa, M., Kohyama, Y., & Munakata, H. 1990, ApJ, 360,\n741\nLyutikov, M. & Blandford, R. 2002, APS, APR, 6008\nMacFadyen, A., & Woosley, S.E. 1999, ApJ, 524, 262 (MW)\nMacFadyen, A., Woosley, S.E., & Heger A. 2001, ApJ, 550, 410\nMészáros, P. 2002, ARA&A, 40, 137\nPaczyński, B. 1998, ApJ, 494, L45\nPaczyński, B., & Wiita, P. J. 1980, A&A, 88, 23 (PW)\nPopham, R., Woosley, S.E., & Fryer, C. 1999, ApJ, 518, 356\nProga, D., & Begelman, M.C. 2003 ApJ, 592, 767 (PB03)\nShakura, N.I., & Sunyaev, R.A. 1973 A&A, 24, 337\n\n\f– 13 –\nStone, J.M., & Norman, M.L. 1992a, ApJS, 80, 753\nStone, J.M., & Norman, M.L. 1992b, ApJS, 80, 791\nStone, J. M., & Pringle, J. E. 2001, MNRAS, 322, 461\nStone, J.M., Pringle, J.E., & Begelman, M.C. 1999, MNRAS, 310, 1002\nVlahakis, N., & Königl, A. 2003, ApJ, submitted\nWoosley, S.E. 1993, ApJ, 405, 273\nWoosley, S. E., & Weaver, T. A. 1995, ApJS, 101, 181\n\n\f– 14 –\nFigure Captions\n\nFigure 1 – The time evolution of the mass accretion rate (left panel), total magnetic energy\ndue to each of the three field components (second left panel), neutrino luminosity (third\nleft panel) and area-integrated radial Poynting and kinetic flux in the polar outflow at\nr = 190 RS (right panel). Formally, we define the polar outflow as the region where vr > 0\nand β < 1. Note the difference in the time range in the panel with the radial fluxes.\nThe last panel in Fig. 1 shows the area-integrated radial fluxes of magnetic and kinetic\nenergy at r = 190 RS inside the polar outflow. Formally, we define the polar outflow as the\nregion where vr > 0 and β < 1. The outflow is Poynting flux-dominated, with the Poynting\nflux exceeding the kinetic energy flux by up to an order of magnitude.\n\nFigure 2 – Color maps of logarithmic density and toroidal magnetic field overplotted with\nthe direction of the poloidal velocity at t = 0.2735 s. The length scale is in units of the BH\nradius (i.e., r ′ = r/RS and z ′ = z/RS ).\n\nFigure 3 – Radial profiles of various quantities from our run, time-averaged from 0.2629\nthrough 0.2818 s. To construct each plot, we averaged the profiles over angle between\nθ = 86◦ and 94◦ . The top left panel plots the density (solid line) and temperature (dashed\nline). The top middle panel plots the gas pressure (solid line) and magnetic pressure. The\ntop right panel plots the rotational, radial, Keplerian, and Alfvén velocities (solid, dashed,\ndot-dashed, and dotted line, respectively), as well as the sound speed (triple-dot dashed\nline). The bottom left panel plots the angular velocity in units of 2c/Rs . The bottom\nmiddle panel plots the Maxwell stress, αmag , and the Reynolds stress, αgas (solid and dashed\nline, respectively). We calculate the Reynolds stress using eq. (15) in PB03 and show only\n\n\f– 15 –\nits amplitude. The bottom right panel plots the radial, latitudinal and toroidal components\nof the magnetic field (dot-dashed, dashed, and solid line, respectively). The length scale is\nin units of the BH radius (i.e., r ′ = r/RS ).\n\n\f– 16 –\n\nFig. 1.-\n\n\f– 17 –\n\nFig. 2.-\n\n\f– 18 –\n\nFig. 3.-\n\n\f"}