{"id": "http://arxiv.org/abs/astro-ph/0203343v1", "guidislink": true, "updated": "2002-03-20T16:54:38Z", "updated_parsed": [2002, 3, 20, 16, 54, 38, 2, 79, 0], "published": "2002-03-20T16:54:38Z", "published_parsed": [2002, 3, 20, 16, 54, 38, 2, 79, 0], "title": "Integral Field Spectroscopy with the Gemini 8-m Telescopes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0203502%2Castro-ph%2F0203385%2Castro-ph%2F0203460%2Castro-ph%2F0203386%2Castro-ph%2F0203014%2Castro-ph%2F0203283%2Castro-ph%2F0203107%2Castro-ph%2F0203212%2Castro-ph%2F0203331%2Castro-ph%2F0203506%2Castro-ph%2F0203154%2Castro-ph%2F0203399%2Castro-ph%2F0203523%2Castro-ph%2F0203009%2Castro-ph%2F0203020%2Castro-ph%2F0203076%2Castro-ph%2F0203325%2Castro-ph%2F0203269%2Castro-ph%2F0203117%2Castro-ph%2F0203290%2Castro-ph%2F0203522%2Castro-ph%2F0203482%2Castro-ph%2F0203436%2Castro-ph%2F0203397%2Castro-ph%2F0203164%2Castro-ph%2F0203306%2Castro-ph%2F0203143%2Castro-ph%2F0203268%2Castro-ph%2F0203298%2Castro-ph%2F0203499%2Castro-ph%2F0203152%2Castro-ph%2F0203337%2Castro-ph%2F0203125%2Castro-ph%2F0203228%2Castro-ph%2F0203420%2Castro-ph%2F0203430%2Castro-ph%2F0203272%2Castro-ph%2F0203226%2Castro-ph%2F0203521%2Castro-ph%2F0203492%2Castro-ph%2F0203234%2Castro-ph%2F0203265%2Castro-ph%2F0203245%2Castro-ph%2F0203191%2Castro-ph%2F0203513%2Castro-ph%2F0203223%2Castro-ph%2F0203390%2Castro-ph%2F0203159%2Castro-ph%2F0203229%2Castro-ph%2F0203110%2Castro-ph%2F0203161%2Castro-ph%2F0203431%2Castro-ph%2F0203414%2Castro-ph%2F0203095%2Castro-ph%2F0203151%2Castro-ph%2F0203008%2Castro-ph%2F0203301%2Castro-ph%2F0203070%2Castro-ph%2F0203180%2Castro-ph%2F0203318%2Castro-ph%2F0203311%2Castro-ph%2F0203083%2Castro-ph%2F0203114%2Castro-ph%2F0203309%2Castro-ph%2F0203343%2Castro-ph%2F0203249%2Castro-ph%2F0203262%2Castro-ph%2F0203039%2Castro-ph%2F0203059%2Castro-ph%2F0203108%2Castro-ph%2F0203084%2Castro-ph%2F0203443%2Castro-ph%2F0203333%2Castro-ph%2F0203376%2Castro-ph%2F0203470%2Castro-ph%2F0203128%2Castro-ph%2F0203322%2Castro-ph%2F0203220%2Castro-ph%2F0203235%2Castro-ph%2F0203455%2Castro-ph%2F0203170%2Castro-ph%2F0203281%2Castro-ph%2F0203044%2Castro-ph%2F0203520%2Castro-ph%2F0203486%2Castro-ph%2F0203287%2Castro-ph%2F0203394%2Castro-ph%2F0203100%2Castro-ph%2F0203032%2Castro-ph%2F0203354%2Castro-ph%2F0203097%2Castro-ph%2F0203102%2Castro-ph%2F0203313%2Castro-ph%2F0203264%2Castro-ph%2F0203040%2Castro-ph%2F0203065%2Castro-ph%2F0203467%2Castro-ph%2F0203514%2Castro-ph%2F0203156%2Castro-ph%2F0203391%2Castro-ph%2F0203367&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integral Field Spectroscopy with the Gemini 8-m Telescopes"}, "summary": "We give an overview of the current and future IFU capabilities on the Gemini\n8-m telescopes. The telescopes are well-suited to integral field spectroscopy\nand both telescopes will have optical and near-infrared IFUs within the next\nfew years. Commissioning for the GMOS IFU on Gemini North has begun recently\nand it is now available to the community. Future integral field instruments\nwill take advantage of wide-field adaptive optics systems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0203502%2Castro-ph%2F0203385%2Castro-ph%2F0203460%2Castro-ph%2F0203386%2Castro-ph%2F0203014%2Castro-ph%2F0203283%2Castro-ph%2F0203107%2Castro-ph%2F0203212%2Castro-ph%2F0203331%2Castro-ph%2F0203506%2Castro-ph%2F0203154%2Castro-ph%2F0203399%2Castro-ph%2F0203523%2Castro-ph%2F0203009%2Castro-ph%2F0203020%2Castro-ph%2F0203076%2Castro-ph%2F0203325%2Castro-ph%2F0203269%2Castro-ph%2F0203117%2Castro-ph%2F0203290%2Castro-ph%2F0203522%2Castro-ph%2F0203482%2Castro-ph%2F0203436%2Castro-ph%2F0203397%2Castro-ph%2F0203164%2Castro-ph%2F0203306%2Castro-ph%2F0203143%2Castro-ph%2F0203268%2Castro-ph%2F0203298%2Castro-ph%2F0203499%2Castro-ph%2F0203152%2Castro-ph%2F0203337%2Castro-ph%2F0203125%2Castro-ph%2F0203228%2Castro-ph%2F0203420%2Castro-ph%2F0203430%2Castro-ph%2F0203272%2Castro-ph%2F0203226%2Castro-ph%2F0203521%2Castro-ph%2F0203492%2Castro-ph%2F0203234%2Castro-ph%2F0203265%2Castro-ph%2F0203245%2Castro-ph%2F0203191%2Castro-ph%2F0203513%2Castro-ph%2F0203223%2Castro-ph%2F0203390%2Castro-ph%2F0203159%2Castro-ph%2F0203229%2Castro-ph%2F0203110%2Castro-ph%2F0203161%2Castro-ph%2F0203431%2Castro-ph%2F0203414%2Castro-ph%2F0203095%2Castro-ph%2F0203151%2Castro-ph%2F0203008%2Castro-ph%2F0203301%2Castro-ph%2F0203070%2Castro-ph%2F0203180%2Castro-ph%2F0203318%2Castro-ph%2F0203311%2Castro-ph%2F0203083%2Castro-ph%2F0203114%2Castro-ph%2F0203309%2Castro-ph%2F0203343%2Castro-ph%2F0203249%2Castro-ph%2F0203262%2Castro-ph%2F0203039%2Castro-ph%2F0203059%2Castro-ph%2F0203108%2Castro-ph%2F0203084%2Castro-ph%2F0203443%2Castro-ph%2F0203333%2Castro-ph%2F0203376%2Castro-ph%2F0203470%2Castro-ph%2F0203128%2Castro-ph%2F0203322%2Castro-ph%2F0203220%2Castro-ph%2F0203235%2Castro-ph%2F0203455%2Castro-ph%2F0203170%2Castro-ph%2F0203281%2Castro-ph%2F0203044%2Castro-ph%2F0203520%2Castro-ph%2F0203486%2Castro-ph%2F0203287%2Castro-ph%2F0203394%2Castro-ph%2F0203100%2Castro-ph%2F0203032%2Castro-ph%2F0203354%2Castro-ph%2F0203097%2Castro-ph%2F0203102%2Castro-ph%2F0203313%2Castro-ph%2F0203264%2Castro-ph%2F0203040%2Castro-ph%2F0203065%2Castro-ph%2F0203467%2Castro-ph%2F0203514%2Castro-ph%2F0203156%2Castro-ph%2F0203391%2Castro-ph%2F0203367&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We give an overview of the current and future IFU capabilities on the Gemini\n8-m telescopes. The telescopes are well-suited to integral field spectroscopy\nand both telescopes will have optical and near-infrared IFUs within the next\nfew years. Commissioning for the GMOS IFU on Gemini North has begun recently\nand it is now available to the community. Future integral field instruments\nwill take advantage of wide-field adaptive optics systems."}, "authors": ["B. W. Miller", "J. Turner", "M. Takamiya", "D. Simons", "I. Hook"], "author_detail": {"name": "I. Hook"}, "author": "I. Hook", "arxiv_comment": "6 pages, 3 figures, LaTeX style file included, to appear in the\n  proceedings of Galaxies: The Third Dimension, edited by M. Rosado, L.\n  Binnette, and L. Arias", "links": [{"href": "http://arxiv.org/abs/astro-ph/0203343v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0203343v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0203343v1", "affiliation": "UK Gemini Project Office", "arxiv_url": "http://arxiv.org/abs/astro-ph/0203343v1", "journal_reference": null, "doi": null, "fulltext": "Galaxies: The Third Dimension\nASP Conference Series, Vol. **VOLUME**, 2002\nM. Rosado, L. Binnette, L. Arias\n\nIntegral Field Spectroscopy with the Gemini 8-m\nTelescopes\n\narXiv:astro-ph/0203343v1 20 Mar 2002\n\nBryan W. Miller, James Turner\nGemini Observatory, Casilla 603, La Serena, Chile\nMarianne Takamiya, Doug Simons\nGemini Observatory, 670 N. A'ohoku Place, Hilo, HI, 97620, USA\nIsobel Hook\nUK Gemini Project Office, University of Oxford, UK\nAbstract. We give an overview of the current and future IFU capabilities on the Gemini 8-m telescopes. The telescopes are well-suited to\nintegral field spectroscopy and both telescopes will have optical and nearinfrared IFUs within the next few years. Commissioning for the GMOS\nIFU on Gemini North has begun recently and it is now available to the\ncommunity. Future integral field instruments will take advantage of widefield adaptive optics systems.\n\n1.\n\nIntroduction\n\nThe high image quality and large collecting areas of the Gemini 8-m telescopes\nmake them well-suited to integral field spectroscopy. On smaller telescopes\nsignal-to-noise considerations have forced integral-field units (IFUs) to have either coarse spatial sampling (e.g. INTEGRAL, DensePak, SAURON) or fine\nsampling of the highest surface brightness targets (e.g. OASIS, TEIFU). More\ncollecting area, a smaller diffraction limit, and new technology in today's 8-10\nmeter telescopes means that higher signal-to-noise spectra of finer spatial structures can be obtained. Therefore, the first generation of instrumentation on\nGemini will include optical and near-infrared IFUs on both telescopes: GMOS\nand NIFS instruments on Gemini North, and GMOS and GNIRS on Gemini\nSouth (see Table 1). This paper summarizes the capabilities of the telescopes\nand these instruments.\nWhile they are sensitive from optical through mid-infrared wavelengths,\nthe Gemini telescopes are optimized for observing in the near and mid-infrared.\nSpecial features of the telescopes include minimizing the mass above the primary\nmirror in order to lower the thermal background and improve airflow over the\nmirror, future low-emissivity mirror coatings, daytime climate control, and a\ntip/tilt chopping secondary. In addition, both telescopes will have facility adaptive optics units that will be able to feed a near-diffraction-limited beam to any\ninstrument. Therefore, Gemini will be able to deliver image quality in the near1\n\n\f2\n\nMiller et al.\n\nFigure 1.\nPredicted optimal image quality versus wavelength for\nHST and an 8-meter telescope with three levels of correction: no correction, tip/tilt correction, and adaptive optics. The Gemini telescopes\nalways use tip/tilt correction and will eventually have facility adaptive\noptics systems that can feed any instrument. Therefore, in the near-IR\nthe image quality produced by Gemini is equal to or better than that\nproduced by HST.\ninfrared about a factor of two better than HST (Figure 1). The Gemini IFUs\nhave been designed to work with the expected image quality from either tip/tilt\nor adaptive-optics corrected beams. The rest of this paper briefly describes the\ncapabilities of each Gemini integral field unit in approximate order of when it\nwill come into service.\nTable 1. Summary of Gemini Integral Field Instruments\nInstrument/ FOV\nSampling Wavelength R\nLocation\nRange\nGMOS\n7′′ × 5′′ + 0.2′′\n0.4–1.1 μm 500–8000\nGN and GS 3.′′ 5 × 5′′\nGNIRS\n3.′′ 2 × 4.′′ 4 0.15′′\n1–5 μm\n667,2000,\nGS\n6000\n′′\n′′\n′′\nNIFS\n3 ×3\n0.1\n0.9–2.5 μm ∼ 5000\nGN\n\n\fIFS with Gemini\n2.\n\n3\n\nGMOS\n\nThe Gemini Multi-Object Spectrograph (GMOS) instruments - one for each\ntelescope - provide the primary optical imaging and spectroscopic capabilities\nat Gemini (Murowinski et al. 2002). Each instrument will have a lenslet/fiberbased IFU that sits in one of the three mask cassettes and it is deployed like\nany other GMOS slit mask. The IFUs are built by the University of Durham\nand the design of the first unit is described by Allington-Smith et al. (2002; also\nsee Allington-Smith et al. in these proceedings). Commissioning for the first\nIFU was begun in September, 2001, and its performance has met or exceeded\nexpectations. It was first offered to the community for use in the 2002A semester.\nAs the design of the IFU is covered elsewhere, this paper will focus on the\ndata format and data reduction procedure. The IFU has two sub-fields - one\nwith 1000 lenslets (7′′ × 5′′ ), and one with 500 lenslets (3.′′ 5 × 5′′ ) - separated by\n1 arcminute so that one field can be used for sky subtraction. The light entering\nthe lenslets is redirected by fibers into two pseudo-slits of 750 fibers each. These\nare imaged on the detector like regular longslits. The current detector is an\narray of three butted 2048 × 4608 pixel EEV CCDs with an effective size of\n6144 × 4608. The gaps between the CCDs are equivalent to 37 pixels in width.\nThe dispersion axis is along the long axis of the mosaic. When both IFU slits are\nused two banks of 750 spectra appear side-by-side on the detector and blocking\nfilters must be used to avoid spectral overlap. However, either of the slits can\nbe closed, resulting in one-half the field-of-view but allowing twice the spectral\ncoverage. A raw GMOS file is a multi-extension FITS (MEF) file with one\nextension for each amplifier used for readout (usually 3 or 6).\nAll Gemini pipeline processing will be done within IRAF. The Gemini staff\nare writing packages of scripts for handling the data from facility instruments.\nScripts for handling GMOS IFU data will be part of the GMOS package and will\nallow for the extraction, calibration, and analysis of the IFU spectra (Table 2).\nMost of these scripts are in draft form and the first release is planned for the\nmiddle of semester 2002A.\nTable 2. IFU related scripts in the GMOS IRAF package\nTask\nFunction\ngfapsum\nsum spectra in a spatial region\ngfdisplay\ndisplay datacubes using ldisplay\ngfextract\nextract spectra, apply fiber throughput correction\ngfmosaic\nmerge datacubes\ngfquick\nquick image reconstruction for target acquisition\ngfreduce\napply reduction/calibration to object frames\ngfresponse\ndetermine relative fiber responses\ngfskysub\nsubtract sky\ngftransform\napply wavelength calibration\ngscrrej\nremove cosmic rays\ngsreduce\nbias subtraction\ngswavelength determine wavelength calibration\n\n\f4\n\nMiller et al.\n\nFigure 2.\nThe format of an example GMOS IFU extracted datacube.\nThe Mask Definition File (MDF) is a binary table that contains information about each lenslet, such as relative position on the sky. There\ncan be up to three extensions for each slit block extracted. Each image\nplane is an IRAF multispec file (one spectrum per line). The SCI extension has the extracted spectra. The optional VAR and DQ planes\nhold the variances of the spectra and the data quality flags.\n\nThe current extraction routine uses the IRAF task apall to find, trace,\nand extract the spectra. Most of the spectra are separated well enough that\nidentifying the individual spectra is not a problem. However, the peaks of three\nlow-throughput fibers cannot be distinguished from their neighbors, so they are\nlost. More sophisticated reduction techniques, such as deconvolution, may be\nable to recover these spectra. The current format of the extracted \"datacube\" is\nshown in Figure 2. The spectra are packed in 2D IRAF multispec images (one\nspectrum per image line) within a MEF file. The relative positions of the lenslets\non the sky are contained in the binary table (MDF) extension. This format is\nsimilar in concept to the proposed Euro3D format. Tasks such as gfdisplay are\nused to visualize the 3D data. Additional analysis tools will be released as they\nare developed.\n\n3.\n\nGNIRS\n\nThe Gemini Near-Infrared Spectrograph (GNIRS) is a fully cryogenic instrument sensitive from 1 to 5 microns. The instrument is being built by NOAO in\nTucson and the IFU module is being built by the University of Durham. Similar\nto the GMOS IFU, the GNIRS IFU is in a cassette that is inserted into the\nbeam on a slit slide. Since the instrument is cooled the IFU is an image slicer\ncontaining 21 diamond-turned mirrors that reformat the focal plane into a bank\nof spectra (Figure 3). The width of a slicer mirror is 0.′′ 15 and the slitlets are 4.′′ 4\nlong, giving 609 independent spatial elements. With slices of this width the IFU\nis optimized for tip/tilt correction rather than adaptive optics. Spectral resolutions for the short camera are R = 667, R = 2000, and R = 6000, depending on\nthe grating. Delivery to Gemini South is expected to be toward the end of 2002.\n\n\fIFS with Gemini\n\nFigure 3.\nSchematic of the image-slicer concept used by GNIRS and\nNIFS (Allington-Smith, private communication). Specifications are for\nthe GNIRS IFU. Cooled aluminum slicing mirrors divide the focal plane\ninto a stack of slitlets. Reduction will be similar to infrared MOS slit\nspectroscopy except that full 2D spatial information is preserved.\n\n5\n\n\f6\n4.\n\nMiller et al.\nNIFS\n\nThe Gemini Near-infrared Integral Field Spectrograph (NIFS), being built by the\nAustralia National University, is designed to work behind the Altair adaptive\noptics system on Gemini North. To reduce cost and speed development the\nproject is copying the the designs of the on-instrument wavefront sensor and the\ncryostat from the NIRI instrument already in use at Gemini North. The IFU\nis based on an image slicer similar to that used in GNIRS. The slicing mirrors\nhave a projected width of 0.′′ 1 and the total field-of-view is 3′′ × 3′′ . The 20482\nHawaii-II detector will give wavelength coverage from 0.9–2.5 μm with a spectral\nresolution of 5000. Delivery is expected in the middle of 2003.\n5.\n\nFuture\n\nFuture integral field spectrographs are likely to take advantage of the multiconjugate adaptive optics system being developed for Gemini South. In this\nsystem multiple deformable mirrors will produce a uniform, near diffractionlimited PSF over a 2 arcminute field. Several designs for a spectrograph with\nmultiple, deployable IFUs are under consideration.\n6.\n\nSummary\n\nLarge collecting areas, good image quality (with or without adaptive optics),\nand infrared optimization make the Gemini telescopes well-suited for integral\nfield spectroscopy. Therefore, Gemini will be offering both optical and near-IR\nIFU capability at both telescopes within the next two years. These instruments\nwill be powerful tools for studies of galaxy dynamics, black holes, and ISM\nkinematics and abundances, to name a few possible projects.\nAcknowledgments. The Gemini Observatory is operated by the Association of Universities for Research in Astronomy, Inc., under a cooperative agreement with the NSF on behalf of the Gemini partnership: the National Science Foundation (United States), the Particle Physics and Astronomy Research\nCouncil (United Kingdom), the National Research Council (Canada), CONICYT (Chile), the Australian Research Council (Australia), CNPq (Brazil) and\nCONICET (Argentina).\nReferences\nAllington-Smith, J., Murray, G., Content, R., Dodsworth, G., Davies, R., Jorgensen, I., Miller, B. W., Hook, I., Crampton, D., & Murowinski, R. 2002,\nin preparation\nMurowinski, R., et al. 2002, in preparation\n\n\f"}