{"id": "http://arxiv.org/abs/astro-ph/0212438v1", "guidislink": true, "updated": "2002-12-19T18:47:21Z", "updated_parsed": [2002, 12, 19, 18, 47, 21, 3, 353, 0], "published": "2002-12-19T18:47:21Z", "published_parsed": [2002, 12, 19, 18, 47, 21, 3, 353, 0], "title": "The Status of Core-collapse Supernova Simulations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0212505%2Castro-ph%2F0212165%2Castro-ph%2F0212376%2Castro-ph%2F0212072%2Castro-ph%2F0212273%2Castro-ph%2F0212138%2Castro-ph%2F0212161%2Castro-ph%2F0212495%2Castro-ph%2F0212155%2Castro-ph%2F0212387%2Castro-ph%2F0212395%2Castro-ph%2F0212415%2Castro-ph%2F0212052%2Castro-ph%2F0212009%2Castro-ph%2F0212084%2Castro-ph%2F0212451%2Castro-ph%2F0212467%2Castro-ph%2F0212077%2Castro-ph%2F0212145%2Castro-ph%2F0212349%2Castro-ph%2F0212171%2Castro-ph%2F0212416%2Castro-ph%2F0212137%2Castro-ph%2F0212195%2Castro-ph%2F0212275%2Castro-ph%2F0212203%2Castro-ph%2F0212344%2Castro-ph%2F0212295%2Castro-ph%2F0212442%2Castro-ph%2F0212512%2Castro-ph%2F0212457%2Castro-ph%2F0212232%2Castro-ph%2F0212510%2Castro-ph%2F0212218%2Castro-ph%2F0212449%2Castro-ph%2F0212263%2Castro-ph%2F0212008%2Castro-ph%2F0212231%2Castro-ph%2F0212566%2Castro-ph%2F0212191%2Castro-ph%2F0212281%2Castro-ph%2F0212182%2Castro-ph%2F0212061%2Castro-ph%2F0212111%2Castro-ph%2F0212294%2Castro-ph%2F0212095%2Castro-ph%2F0212392%2Castro-ph%2F0212201%2Castro-ph%2F0212070%2Castro-ph%2F0212358%2Castro-ph%2F0212446%2Castro-ph%2F0212292%2Castro-ph%2F0212351%2Castro-ph%2F0212127%2Castro-ph%2F0212524%2Castro-ph%2F0212314%2Castro-ph%2F0212375%2Castro-ph%2F0212126%2Castro-ph%2F0212227%2Castro-ph%2F0212374%2Castro-ph%2F0212056%2Castro-ph%2F0212577%2Castro-ph%2F0212226%2Castro-ph%2F0212064%2Castro-ph%2F0212384%2Castro-ph%2F0212426%2Castro-ph%2F0212260%2Castro-ph%2F0212476%2Castro-ph%2F0212212%2Castro-ph%2F0212178%2Castro-ph%2F0212359%2Castro-ph%2F0212561%2Castro-ph%2F0212506%2Castro-ph%2F0212033%2Castro-ph%2F0212527%2Castro-ph%2F0212247%2Castro-ph%2F0212389%2Castro-ph%2F0212194%2Castro-ph%2F0212256%2Castro-ph%2F0212125%2Castro-ph%2F0212489%2Castro-ph%2F0212430%2Castro-ph%2F0212531%2Castro-ph%2F0212546%2Castro-ph%2F0212419%2Castro-ph%2F0212288%2Castro-ph%2F0212380%2Castro-ph%2F0212514%2Castro-ph%2F0212083%2Castro-ph%2F0212405%2Castro-ph%2F0212459%2Castro-ph%2F0212264%2Castro-ph%2F0212240%2Castro-ph%2F0212122%2Castro-ph%2F0212142%2Castro-ph%2F0212429%2Castro-ph%2F0212431%2Castro-ph%2F0212438%2Castro-ph%2F0212526%2Castro-ph%2F0212462%2Castro-ph%2F0212554&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Status of Core-collapse Supernova Simulations"}, "summary": "Core-collapse supernovae can be used to place limits on dark matter candidate\nparticles, but the strength of these limits depends on the depth of our\ntheoretical understanding of these astrophysical events. To date, limitations\non computing power have prevented inclusion of all the physics that would\nconstitute a realistic simulation. The TeraScale Supernova Initiative (TSI)\nwill overcome these obstacles in the next few years, elucidating the explosion\nmechanism and other phenomena closely associated with the core collapse of\nmassive stars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0212505%2Castro-ph%2F0212165%2Castro-ph%2F0212376%2Castro-ph%2F0212072%2Castro-ph%2F0212273%2Castro-ph%2F0212138%2Castro-ph%2F0212161%2Castro-ph%2F0212495%2Castro-ph%2F0212155%2Castro-ph%2F0212387%2Castro-ph%2F0212395%2Castro-ph%2F0212415%2Castro-ph%2F0212052%2Castro-ph%2F0212009%2Castro-ph%2F0212084%2Castro-ph%2F0212451%2Castro-ph%2F0212467%2Castro-ph%2F0212077%2Castro-ph%2F0212145%2Castro-ph%2F0212349%2Castro-ph%2F0212171%2Castro-ph%2F0212416%2Castro-ph%2F0212137%2Castro-ph%2F0212195%2Castro-ph%2F0212275%2Castro-ph%2F0212203%2Castro-ph%2F0212344%2Castro-ph%2F0212295%2Castro-ph%2F0212442%2Castro-ph%2F0212512%2Castro-ph%2F0212457%2Castro-ph%2F0212232%2Castro-ph%2F0212510%2Castro-ph%2F0212218%2Castro-ph%2F0212449%2Castro-ph%2F0212263%2Castro-ph%2F0212008%2Castro-ph%2F0212231%2Castro-ph%2F0212566%2Castro-ph%2F0212191%2Castro-ph%2F0212281%2Castro-ph%2F0212182%2Castro-ph%2F0212061%2Castro-ph%2F0212111%2Castro-ph%2F0212294%2Castro-ph%2F0212095%2Castro-ph%2F0212392%2Castro-ph%2F0212201%2Castro-ph%2F0212070%2Castro-ph%2F0212358%2Castro-ph%2F0212446%2Castro-ph%2F0212292%2Castro-ph%2F0212351%2Castro-ph%2F0212127%2Castro-ph%2F0212524%2Castro-ph%2F0212314%2Castro-ph%2F0212375%2Castro-ph%2F0212126%2Castro-ph%2F0212227%2Castro-ph%2F0212374%2Castro-ph%2F0212056%2Castro-ph%2F0212577%2Castro-ph%2F0212226%2Castro-ph%2F0212064%2Castro-ph%2F0212384%2Castro-ph%2F0212426%2Castro-ph%2F0212260%2Castro-ph%2F0212476%2Castro-ph%2F0212212%2Castro-ph%2F0212178%2Castro-ph%2F0212359%2Castro-ph%2F0212561%2Castro-ph%2F0212506%2Castro-ph%2F0212033%2Castro-ph%2F0212527%2Castro-ph%2F0212247%2Castro-ph%2F0212389%2Castro-ph%2F0212194%2Castro-ph%2F0212256%2Castro-ph%2F0212125%2Castro-ph%2F0212489%2Castro-ph%2F0212430%2Castro-ph%2F0212531%2Castro-ph%2F0212546%2Castro-ph%2F0212419%2Castro-ph%2F0212288%2Castro-ph%2F0212380%2Castro-ph%2F0212514%2Castro-ph%2F0212083%2Castro-ph%2F0212405%2Castro-ph%2F0212459%2Castro-ph%2F0212264%2Castro-ph%2F0212240%2Castro-ph%2F0212122%2Castro-ph%2F0212142%2Castro-ph%2F0212429%2Castro-ph%2F0212431%2Castro-ph%2F0212438%2Castro-ph%2F0212526%2Castro-ph%2F0212462%2Castro-ph%2F0212554&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Core-collapse supernovae can be used to place limits on dark matter candidate\nparticles, but the strength of these limits depends on the depth of our\ntheoretical understanding of these astrophysical events. To date, limitations\non computing power have prevented inclusion of all the physics that would\nconstitute a realistic simulation. The TeraScale Supernova Initiative (TSI)\nwill overcome these obstacles in the next few years, elucidating the explosion\nmechanism and other phenomena closely associated with the core collapse of\nmassive stars."}, "authors": ["Christian Y. Cardall"], "author_detail": {"name": "Christian Y. Cardall"}, "author": "Christian Y. Cardall", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/9789812791313_0037", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0212438v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0212438v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Contribution to the proceedings of the 4th International Workshop on\n  the Identification of Dark Matter (IDM2002), held in York, England 2-6\n  September 2002, to be published by World Scientific. 10 pages, 1 figure", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0212438v1", "affiliation": "Oak Ridge National Laboratory and University of Tennessee, Knoxville", "arxiv_url": "http://arxiv.org/abs/astro-ph/0212438v1", "journal_reference": null, "doi": "10.1142/9789812791313_0037", "fulltext": "arXiv:astro-ph/0212438v1 19 Dec 2002\n\nNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\nTHE STATUS OF CORE-COLLAPSE SUPERNOVA\nSIMULATIONS\n\nCHRISTIAN Y. CARDALL\nPhysics Division,\nOak Ridge National Laboratory,\nOak Ridge, TN 37831-6354, USA,\nE-mail: ccardall@mail.phy.ornl.gov\nDepartment of Physics and Astronomy,\nUniversity of Tennessee,\nKnoxville, TN 37996-1200, USA\nJoint Institute for Heavy Ion Research,\nOak Ridge National Laboratory,\nOak Ridge, TN 37831-6374, USA\nCore-collapse supernovae can be used to place limits on dark matter candidate\nparticles, but the strength of these limits depends on the depth of our theoretical\nunderstanding of these astrophysical events. To date, limitations on computing\npower have prevented inclusion of all the physics that would constitute a realistic\nsimulation. The TeraScale Supernova Initiative (TSI) will overcome these obstacles\nin the next few years, elucidating the explosion mechanism and other phenomena\nclosely associated with the core collapse of massive stars.\n\n1. What are supernovae?\nThe term \"supernova\" dates from the early 1930s, but the concept was\naround in the 1920s. With the realization that the spiral nebulae are separate galaxies comparable to our Milky Way, it was recognized that the\n\"novae\" or \"new stars\" seen in these nebulae would have to be much more\nluminous than typical novae occuring in our galaxy. The phrases \"giant\nnovae\", novae of \"impossibly great absolute magnitudes\", \"exceptional novae\", and the German term \"Hauptnovae\" or \"chief novae\" were used during the 1920s.1 In a review article Zwicky explained that it was deduced\nthat \"supernovae\" were about a thousand times as luminous as \"common\nnovae\", and claimed that \"Baade and I first introduced the term 'super1\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n2\n\nnovae' in seminars and in a lecture course on astrophysics at the California\nInstitute of Technology in 1931.\"2\nSupernovae are classified by astronomers into two broad classes based on\ntheir spectra.3 These classes are \"Type I\", which have no hydrogen features,\nand \"Type II\", which have obvious hydrogen features. These types have\nfurther subcategories, depending on the presence or absence of silicon and\nhelium features in Type I, and the presence or absence of narrow hydrogen\nfeatures in the case of Type II. In particular, supernovae of Type Ia exhibit\nstrong silicon lines, those of Type Ib have helium lines, and those of Type\nIc do not have either of these. Astronomers have also identified a number\nof distinct characteristics in supernova light curves (total luminosity as a\nfunction of time).\nThere are two basic physical mechanisms for supernovae, but these do\nnot line up cleanly with the observational categories of Type I and Type II.\nType Ia supernovae are caused by accretion of matter from a companion star\nonto a white dwarf, which induces a thermonuclear runaway that consumes\nthe entire white dwarf. Supernovae of Type Ib, Ic, and II are produced by a\ntotally different mechanism: the catastropic collapse of the core of a massive\nstar. The observational distinctions of presence or absence of hydrogen or\nhelium turn out to be unrelated to the mechanism; they depend on whether\nthe outer hydrogen and helium layers of the star, which have nothing to\ndo with the collapsing core, have been lost to winds or accretion onto a\ncompanion during stellar evolution. Of the two physical mechanisms, corecollapse supernovae are the focus of the present discussion.\nFor most of their existence stars burn hydrogen into helium. In massive stars, temperatures and densities become sufficiently high to burn to\ncarbon, oxygen, neon, magnesium, and silicon and iron group elements.\nThe iron group nuclei are the most tightly bound, and here burning in the\ncore ceases. The iron core-supported by electron degeneracy pressure-\neventually becomes unstable. Its inner portion undergoes homologous collapse (velocity proportional to radius), and the outer portion collapses\nsupersonically. Electron capture on nuclei is one instability leading to\ncollapse, and this process continues throughout collapse, releasing freestreaming neutrinos until densities and temperatures become so high that\neven neutrinos are trapped. Collapse is halted when the matter reaches\nnuclear density; at this point a shock wave forms at the boundary between\nthe homologous and supersonically collapsing regions. The shock begins to\nmove out, and after the shock passes some distance beyond the surface of\nthe newly born neutron star, it stalls as energy is lost to neutrino emission\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n3\n\nand dissociation of infalling heavy nuclei falling through the shock.\nThe nascent neutron star is a hot thermal bath of dense nuclear matter,\nelectron/positron pairs, photons, and neutrinos, containing most of the\ngravitational potential energy released during core collapse. Neutrinos,\nhaving the weakest interactions, are the most efficient means of cooling;\nthey diffuse outward on a time scale of seconds towards a semi-transparent\nregion near the surface of the neutron star, and eventually escape with\nabout 99% of the released gravitational energy.\nIn the reigning paradigm-the neutrino-driven explosion mechanism4 -\nthe supernova explosion is launched as a result of neutrino heating of the\nmaterial behind the stalled shock, resulting in the revival of the shock and\nits propulsion through the outer layers of the star. This process may be\naided by convection in two regions. First, loss of electron neutrinos from\nthe outer layers of the neutron star causes composition gradients that drive\nconvection, which boosts neutrino luminosities by bringing hotter material\nto the surface. Second, heating decreases away from the neutron star surface, giving rise to a negative entropy gradient. The resulting convection\nincreases the efficiency of neutrino heating by delivering heated material to\nthe region just behind the shock.\nAs the neutrinos are transported from inside the neutron star, they go\nfrom a nearly isotropic diffusive regime to a strongly forward-peaked freestreaming region. Modeling this process accurately requires tracking both\nthe energy and angle dependence of the neutrino distribution functions.\n\n2. Survey of core-collapse simulations\nSupernovae have a rich phenomenology-observations of many types that\nmodelers would like to reproduce and explain. Chief among these is the\nexplosion itself, which is not produced robustly and convincingly in simulations. As mentioned previously, 99% of the gravitational potential energy\nreleased during collapse escapes as neutrinos; in comparison, the kinetic\nenergy of expelled matter accounts for about 1%, and the optical display\nis just a fraction of this. Energetically, supernovae are essentially neutrino\nevents; the explosion is just a minor sideshow, the optical display a trivial detail. That the explosion is such a minor part of the system is what\nmakes it so challenging to model convincingly. But the optical data are\nwhat we perceive with our unaided inborn detectors-our eyes-and in our\nanthropic chauvinism, explaining the explosion seems most interesting.\nWhile the explosion is of obvious interest, neutrino signatures are also\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n4\n\nof great importance. The handful of neutrinos detected from supernova\nSN1987A confirmed theoretical predictions of neutrinos releasing the gravitational energy on a time scale of seconds. This was a remarkable success of\nsupernova theory and modeling. The neutrinos are also important because\ntheir detection allows limits to be placed on dark matter candidates, such\nas axions and sterile neutrinos.\nThere are many other interesting observables, including pulsar spins,\nkick velocities, and magnetic fields; gravitational waves; element abundances; and all kinds of measurements across the electromagnetic spectrum. Core-collapse simulations-the subject of the present discussion-\ntypically address the explosion mechanism, neutrino signatures, remnant\npulsar properties, and gravitational waves. Another class of simulation-\nnot discussed here-assumes a successful explosion and studies the interaction of the shock with the surrounding layers of the star (and beyond)\nin order to study things like nucleosynthesis and measurements across the\nelectromagnetic spectrum.\nFrom the description of the core-collapse supernova process in the previous section, several key aspects of physics that a simulation must address\ncan be identified:\nNeutrino transport/interactions: Because neutrinos dominate the system, their treatment is very important, including the number of spatial\ndimensions treated; dependence on both energy and angle in order to properly model the transition from isotropic diffusion to forward-peaked free\nstreaming; relativistic effects; and comprehensiveness of interactions.\nHydrodynamics/gravitation: Convection-both inside and outside the\nnascent neutron star-can play an important role, so allowance for flows in\nmultiple spatial dimensions is important in the hydrodynamics. The newly\nborn neutron is sufficiently compact that a general relativistic description\nshould ultimately be included.\nEquation of state/composition: Determination of realistic equations of\nstate of dense nuclear matter at finite temperature involves cutting-edge\nnuclear physics, as does the determination of neutrino interaction rates with\nthe variety of nuclear species encountered in the supernova environment.\nDiagnostics: Very important to making convincing explosions is fastidious accounting of total lepton number and energy. Because the explosion\nenergy is only 1% of the basic energy scale in the problem, a determination of the explosion energy accurate to 10% requires that total energy be\nconserved at a level of about one part in 108 per time step (allowing for\nsystematic error accrual over ∼ 105 time steps).\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n5\n\nSimulations of collapse and bounce have been performed by many\ngroups. In briefly describing this work, I list (in alphabetical order) the\ninstitutions that represent the \"centers of gravity\" of many of these groups:\nLivermore National Laboratory: The neutrino transport in these\nsimulations5,6,7,8 was energy-dependent, included some relativistic effects,\nand had a decent set of neutrino interactions; however, the transport was\nspatially one-dimensional (spherically symmetric). The hydrodynamics and\ngravitation, while relativistic, were also spherically symmetric. Multidimensional effects were mocked up with a mixing-length approach, and without\nthis explosions were not seen in these models. Inclusion of several nuclear\nspecies in a burning network was a high point of these simulations. Explosions were seen in these models, but there was no published accounting of\nlepton number and energy conservation.\nLos Alamos National Laboratory: Many groups published spatially twodimensional simulations in the early 1990s, and a group centered at Los\nAlamos was one of the first.9 Descended from those efforts was a recent\nsimulation in three spatial dimensions by Fryer and Warren.10 The high\npoint of these simulations was their three-dimensional hydrodynamics, and\nsome relativistic effects were included in both the neutrino transport and\ngravitation. An important liability, however, was the crude treatment of\nneutrino transport, in which dependence on both energy and angle were\nintegrated out, and some important interactions were left out. Explosions\nwere seen in these models, but there was no published accounting of lepton\nnumber and energy conservation.\nMax Planck Institute for Astrophysics: This group also performed simulations with two-dimensional hydrodynamics in the mid 1990s. Separate\nsimulations were performed for the nascent neutron star11 and the region\nabove the neutron star.12 In the latter simulations the neutrino luminosities were parametrized, and explosions were seen if these luminosities were\nset high enough. While some relativistic effects were included in both the\nhydrodynamics and neutrino fields, these were parametrized models with\nno serious neutrino transport. There was no detailed accounting of lepton\nnumber and energy conservation.\nIn more recent work the Max Planck group has published studies in\nspherical symmetry, but with sophisticated neutrino transport.13,14 The\nneutrino transport is dependent on both energy and angle, and includes\nsome relativistic effects. This group has also considered a full range of\nneutrino interactions.15 Important limitations of results published to date\nwere the restriction to spherical symmetry and Newtonian hydrodynam-\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n6\n\nics, but initial results on multidimensional models with sophisticated neutrino transport and approximate relativity have recently been reported.16,17\nWhile some attention to the accounting of lepton number and energy was\nreported in connection with test problems, it was not reported in detail in\nconnection with full simulations. No explosions were seen in simulations\nwith the most comprehensive treatments of neutrino transport.\nOak Ridge National Laboratory: Like the group at Max Planck Institute\nfor Astrophysics, this group published separate studies of the nascent neutron star18 and the neutrino-heated region19 with two-dimensional hydrodynamics. The neutrino transport included some relativistic effects, retained\nthe energy dependence of the neutrino distributions, and took some care\nregarding the conservation of energy and lepton number. However, these\nneutrino distributions were taken from a spherically symmetric simulation\nand imposed onto the two-dimensional hydrodynamics. In addition, the\nhydrodynamics was nonrelativistic. Unlike other multidimensional models\npublished in the 1990s, no explosions were seen in these simulations.\nMore recently the Oak Ridge group has produced simulations in spherical symmetry but with sophisticated neutrino transport.20,21,22 These recent simulations had some notable high points. They included realistic\nneutrino transport, tracking both the energy and angle dependence of the\nneutrinos. Unlike other core-collapse simulations, they were fully relativistic in both the transport-including redshifts and trajectory bending-and\nin the hydrodynamics/gravitation. The price that has been paid for these\nadvances is that the models were spherically symmetric, and therefore unrealistic in that respect. Another high point of these simulations was the\ncareful attention paid to energy and lepton number conservation.22 Great\neffort went into assuring that the finite difference representations of the\npartial differential equations were consistent with number and energy conservation. This is a standard all simulations eventually must meet in order\nto be truly credible with respect to conclusions about the explosion mechanism. In this case the simulations provided convincing evidence that explosions simply do not occur in spherical symmetry (at least with standard\nneutrino physics). This is indicated in Figure 1, which shows the initial\noutward motion of the shock and its subsequent stagnation and infall.21\nUniversity of Arizona: This group also performed simulations with multidimensional hydrodynamics in the mid 1990s.23 The neutrino transport\nwas integrated over both energy and angles, impairing the realism of the\nmodels. They were also nonrelativistic. While these were exploding models,\nthere was no detailed accounting of energy and lepton number conserva-\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n7\n\nNewton+O(v/c)\nRelativistic\n\n3\n\nRadius [km]\n\n10\n\n2\n\n10\n\n1\n\n10\n\n0\n\n0.1\n\n0.2\n0.3\nTime After Bounce [s]\n\n0.4\n\n0.5\n\nFigure 1. Failure of spherical model to explode. Thin lines: mass shell trajectories.\nThicker lines: shock trajectories in a Newtonian hydrodynamics, O(v/c) neutrino transport model and a fully relativistic model.\n\ntion.a\n3. The TeraScale Supernova Initiative\nThe overview of core-collapse supernova simulations presented in the last\nsection demonstrates a fundamental trade-off required by the computing\npower available during the past decade: A sadistic choice between multidimensional hydrodynamics and spatially multidimensional, energy- and\nangle-dependent neutrino transport, two non-negotiable aspects of realism.\nAs the new millenium begins, computing power has advanced to the point\nthat neither of these crucial pieces of physics need be sacrificed, as initial\nresults16,17 from the group at the Max Planck Institute for Astrophysics\nindicates. Another program designed to take core-collapse supernova modeling to the next level is the TeraScale Supernova Initiative.\nThe TeraScale Supernova Initiativeb (TSI) is a large collaboration\nfunded by the U.S. Department of Energy for several years with the misa Very\n\nrecently this group reported simulations with Newtonian hydrodynamics and sophisticated neutrino transport in spherical symmetry; no explosions were seen.24\nb http://www.phy.ornl.gov/tsi\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n8\n\nsion to explain the supernova phenomena most closely associated with core\ncollapse: the successful launch of the shock (i.e. understand the explosion\nmechanism); neutrino signatures; pulsar spins, kick velocities, and magnetic\nfields; gravitational waves; and heavy element (r−process) abundances.\nThis initiative-which grows out of past efforts of the supernova modeling group at Oak Ridge National Laboratory-has a diverse and experienced investigator team, including some 40 investigators from 12 institutions.c These investigators include people whose life-long work has been\nin the areas needed in supernova science, including radiation transport,\nmagneto-hydrodynamics, nuclear and weak interaction physics, and needed\naspects of computer science.\nTSI also has the support of the U.S. Department of Energy's computational infrastructure. This includes high priority on the DOE's terascale\nmachines-which feature several 1012 bytes of memory and floating point\noperations per second-and access to the expertise of teams specializing in\nvarious aspects of high-performance computing, including advanced solver\nalgorithms, computational meshes, performance on parallel architectures,\ndata management and visualization, and software reusability and interoperability.\nSome recent science from TSI involves pure hydrodynamics simulations\n(no neutrino transport).25 A standing accretion shock is an analytic solution in spherical symmetry. Its parameters are matched to the density\nprofile in a realistic simulation when the shock stalls, and this is used as an\ninitial condition for two- and three-dimensional simulations. It turns out\nthat the standing accretion shock is unstable in two and three dimensions\nto the lowest order modes; the average shock radius and turbulent energy\nincrease steadily with time at the expense of thermal and gravitational\nenergy of the gas.d The mechanism of instability is nonlinear feedback\nbetween aspherical pressure waves rising from small radii and regions characterized by transverse flow velocities-generated by asphericities in the\nshock-that advect inwards. This must be studied in more detail in simulations involving neutrino transport and realistic equations of state, but\nthis hydrodynamic instability may play an important role in the supernova\nmechanism and provide an explanation for aspect ratios ∼ 2 inferred from\nspectropolarimetry data.26\n\nc Inclusion\n\nof collaborators who are not members of TSI brings the total number of people\ninvolved to 99, from 28 institutions.\nd Movies available at http://www.phy.ornl.gov/tsi/pages/simulations.html.\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n9\n\n4. Summary and Implications for Dark Matter\nWhile many simulations have been performed over the years, it cannot yet\nbe claimed that the supernova explosion mechanism is understood. Models\nwith energy- and angle-dependent neutrino transport have been studied in\nspherical symmetry, and explosions have not been seen. Many (though not\nall) models with multidimensional hydrodynamics do exhibit explosions,\nbut these have employed neutrino transport that is too crude to make firm\nconclusions about the explosion mechanism. Computing power has advanced to the point that models with both sophisticated neutrino transport\nand multidimensional hydrodynamics are within reach; the TeraScale Supernova Initiative (TSI) is one effort underway to perform such simulations.\nFinally, in conclusion, a word on the subject of the conference: dark\nmatter. The nascent neutron star is a hot (temperature of order 50 MeV)\nand dense (baryon mass density of order 1014 g cm−3 ) environment. Should\nhypothetical particles like the axion (a cold dark matter candidate) or a\nkeV-mass sterile neutrino (a warm dark matter candidate) exist, they could\nbe produced in the extreme conditions present in the newly born neutron\nstar. However, copious production and emission of such weakly coupled\nparticles would cause the neutron star to cool more quickly than it would if\nneutrinos were fastest means of cooling. The handful of neutrinos detected\nfrom supernova SN1987A confirms the basic theoretical understanding of\nstellar core collapse, with associated trapping of neutrinos and their subsequent emission on a time scale of several seconds; this allows limits to be\nplaced on the coupling strength of hypothetical dark matter particles like\nthe axion27 and sterile neutrino.28 Presently, these limits are of necessity\nrather conservative, due to a lack of detailed understanding of the explosion mechanism and subsequent uncertainties about precise conditions in\nthe nascent neutron star. A new generation of simulations-such as those\nbeing pursued by TSI-promises to reveal the explosion mechanism and\npaint a detailed and realistic picture of the physical conditions in the hot\nand dense neutron star, providing a basis for strengthened limits on the\nproperties of dark matter candidate particles.\nAcknowledgments\nThis work was supported by the U.S. Department of Energy (DoE) HENP\nScientific Discovery Through Advanced Computing Program; Oak Ridge\nNational Laboratory, managed by UT-Battelle, LLC, for the DoE under\ncontract DE-AC05-00OR22725; the Joint Institute for Heavy Ion Research;\n\n\fNovember 7, 2018\n\n9:15\n\nWSPC/Trim Size: 9in x 6in for Proceedings\n\nyork\n\n10\n\nand a DoE PECASE grant.\nReferences\n1. D. E. Osterbrock, American Astronomical Society Meeting 199, #15.01\n(2001).\n2. F. Zwicky, Rev. Mod. Phys. 12, 66 (1940).\n3. A. V. Filippenko, Ann. Rev. Astron. Astrophys. 35, 309 (1997).\n4. H. A. Bethe and J. R. Wilson, Astrophys. J. 295, 14 (1985).\n5. R. L. Bowers and J. R. Wilson, Astrophys. J. Suppl. 50, 115 (1982).\n6. R. Bowers and J. R. Wilson, Astrophys. J. 263, 366 (1982).\n7. R. Mayle and J. R. Wilson, Astrophys. J. 334, 909 (1988).\n8. J. R. Wilson and R. W. Mayle, Phys. Rep. 227, 97 (1993).\n9. M. Herant, W. Benz, W. R. Hix, C. L. Fryer, and S. A. Colgate, Astrophys.\nJ. 435, 339 (1994).\n10. C. L. Fryer and M. S. Warren, Astrophys. J. Lett. 574, 65 (2002).\n11. W. Keil, H.-T. Janka, and E. Mueller, Astrophys. J. Lett. 473, 111 (1996).\n12. H.-T. Janka and E. Mueller, Astron. Astrophys. 306, 167 (1996).\n13. M. Rampp and H.-T. Janka, Astrophys. J. Lett. 539, 33 (2000).\n14. M. Rampp and H.-T. Janka, astro-ph/0203101.\n15. R. Buras, H.-T. Janka, M. T. Keil, G. G. Raffelt, and M. Rampp, astroph/0205006.\n16. H.-T. Janka, R. Buras, and M. Rampp, in Proceedingsof the 7th International\nSymposium on Nuclei in the Cosmos, astro-ph/0212317.\n17. H.-T. Janka, R. Buras, K. Kifonidis, T. Plewa, and M. Rampp, in Proceedings of the ESO/MPA/MPE Workshop \"From Twilight to Highlight\", astroph/0212316.\n18. A. Mezzacappa, A. C.Calder, S. W. Bruenn, J. M. Blondin, M. W. Guidry,\nM. R. Strayer, and A. S. Umar, Astrophys. J. 493, 848 (1998).\n19. A. Mezzacappa, A. C.Calder, S. W. Bruenn, J. M. Blondin, M. W. Guidry,\nM. R. Strayer, and A. S. Umar, Astrophys. J. 495, 911 (1998).\n20. A. Mezzacappa, M. Liebendörfer, O. E. B. Messer, W. R. Hix, F.-K. Thielemann, and S. W. Bruenn, Phys. Rev. Lett. 86, 1935 (2001).\n21. M. Liebendörfer, A. Mezzacappa, F. Thielemann, O. E. Messer, W. R. Hix,\nand S. W. Bruenn, Phys. Rev. D63, 103004 (2001).\n22. M. Liebendörfer, O. E. B. Messer, A. Mezzacappa, S. W. Bruenn, C. Y.\nCardall, and F.-K. Thielemann, astro-ph/0207036.\n23. A. Burrows, J. Hayes, and B. A. Fryxell, Astrophys. J. 450, 830 (1995).\n24. T. A. Thompson, A. Burrows, and P. A. Pinto, astro-ph/0211194.\n25. J. M. Blondin, A. Mezzacappa, and C. DeMarino, Astrophys. J. in press,\nastro-ph/0210634.\n26. P. Höflich, A. Khovkhlov, and L. Wang, in 20th Texas Symposium on Relativistic Astrophysics, 459 (2002).\n27. G. G. Raffelt, Ann. Rev.Nucl. Part. Sci. 49, 163 (1999).\n28. K. Abazajian, G. M. Fuller, and M. Patel, Phys. Rev. D64, 023501 (2001).\n\n\f"}