{"id": "http://arxiv.org/abs/astro-ph/0312621v1", "guidislink": true, "updated": "2003-12-25T14:41:02Z", "updated_parsed": [2003, 12, 25, 14, 41, 2, 3, 359, 0], "published": "2003-12-25T14:41:02Z", "published_parsed": [2003, 12, 25, 14, 41, 2, 3, 359, 0], "title": "The Cosmic Quartet - Cosmological Parameters of a Smoothed Inhomogeneous\n  Spacetime", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0312590%2Castro-ph%2F0312306%2Castro-ph%2F0312655%2Castro-ph%2F0312302%2Castro-ph%2F0312612%2Castro-ph%2F0312228%2Castro-ph%2F0312155%2Castro-ph%2F0312074%2Castro-ph%2F0312259%2Castro-ph%2F0312538%2Castro-ph%2F0312421%2Castro-ph%2F0312293%2Castro-ph%2F0312088%2Castro-ph%2F0312043%2Castro-ph%2F0312119%2Castro-ph%2F0312178%2Castro-ph%2F0312436%2Castro-ph%2F0312530%2Castro-ph%2F0312557%2Castro-ph%2F0312553%2Castro-ph%2F0312573%2Castro-ph%2F0312280%2Castro-ph%2F0312183%2Castro-ph%2F0312083%2Castro-ph%2F0312479%2Castro-ph%2F0312613%2Castro-ph%2F0312551%2Castro-ph%2F0312328%2Castro-ph%2F0312242%2Castro-ph%2F0312349%2Castro-ph%2F0312449%2Castro-ph%2F0312653%2Castro-ph%2F0312093%2Castro-ph%2F0312609%2Castro-ph%2F0312139%2Castro-ph%2F0312080%2Castro-ph%2F0312308%2Castro-ph%2F0312159%2Castro-ph%2F0312375%2Castro-ph%2F0312329%2Castro-ph%2F0312105%2Castro-ph%2F0312279%2Castro-ph%2F0312215%2Castro-ph%2F0312381%2Castro-ph%2F0312005%2Castro-ph%2F0312350%2Castro-ph%2F0312343%2Castro-ph%2F0312597%2Castro-ph%2F0312490%2Castro-ph%2F0312555%2Castro-ph%2F0312016%2Castro-ph%2F0312283%2Castro-ph%2F0312621%2Castro-ph%2F0312015%2Castro-ph%2F0312011%2Castro-ph%2F0312432%2Castro-ph%2F0312443%2Castro-ph%2F0312608%2Castro-ph%2F0312046%2Castro-ph%2F0312591%2Castro-ph%2F0312050%2Castro-ph%2F0312583%2Castro-ph%2F0312266%2Castro-ph%2F0312038%2Castro-ph%2F0312210%2Castro-ph%2F0312631%2Castro-ph%2F0312154%2Castro-ph%2F0312194%2Castro-ph%2F0312103%2Castro-ph%2F0312594%2Castro-ph%2F0312102%2Castro-ph%2F0312607%2Castro-ph%2F0312452%2Castro-ph%2F0312014%2Castro-ph%2F0312325%2Castro-ph%2F0312025%2Castro-ph%2F0312030%2Castro-ph%2F0312632%2Castro-ph%2F0312406%2Castro-ph%2F0312211%2Castro-ph%2F0312341%2Castro-ph%2F0312546%2Castro-ph%2F0312127%2Castro-ph%2F0312173%2Castro-ph%2F0312372%2Castro-ph%2F0312171%2Castro-ph%2F0312645%2Castro-ph%2F0312545%2Castro-ph%2F0312161%2Castro-ph%2F0312075%2Castro-ph%2F0312264%2Castro-ph%2F0312319%2Castro-ph%2F0312437%2Castro-ph%2F0312253%2Castro-ph%2F0312416%2Castro-ph%2F0312652%2Castro-ph%2F0312556%2Castro-ph%2F0312229%2Castro-ph%2F0312060%2Castro-ph%2F0312201%2Castro-ph%2F0312064&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Cosmic Quartet - Cosmological Parameters of a Smoothed Inhomogeneous\n  Spacetime"}, "summary": "We discuss the relation between `bare' cosmological parameters as the true\nspatial average characteristics that determine the cosmological model, and the\nparameters interpreted by observers with a `Friedmannian bias', i.e., within a\nhomogeneous space geometry. We may say that the latter are `dressed' by the\nsmoothed-out geometrical inhomogeneities of the surveyed spatial region. We\nidentify two effects that quantify the difference between `bare' and `dressed'\nparameters: `curvature backreaction' and `volume effect'. An estimate of the\nlatter is given in terms of a simple geometrical example.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0312590%2Castro-ph%2F0312306%2Castro-ph%2F0312655%2Castro-ph%2F0312302%2Castro-ph%2F0312612%2Castro-ph%2F0312228%2Castro-ph%2F0312155%2Castro-ph%2F0312074%2Castro-ph%2F0312259%2Castro-ph%2F0312538%2Castro-ph%2F0312421%2Castro-ph%2F0312293%2Castro-ph%2F0312088%2Castro-ph%2F0312043%2Castro-ph%2F0312119%2Castro-ph%2F0312178%2Castro-ph%2F0312436%2Castro-ph%2F0312530%2Castro-ph%2F0312557%2Castro-ph%2F0312553%2Castro-ph%2F0312573%2Castro-ph%2F0312280%2Castro-ph%2F0312183%2Castro-ph%2F0312083%2Castro-ph%2F0312479%2Castro-ph%2F0312613%2Castro-ph%2F0312551%2Castro-ph%2F0312328%2Castro-ph%2F0312242%2Castro-ph%2F0312349%2Castro-ph%2F0312449%2Castro-ph%2F0312653%2Castro-ph%2F0312093%2Castro-ph%2F0312609%2Castro-ph%2F0312139%2Castro-ph%2F0312080%2Castro-ph%2F0312308%2Castro-ph%2F0312159%2Castro-ph%2F0312375%2Castro-ph%2F0312329%2Castro-ph%2F0312105%2Castro-ph%2F0312279%2Castro-ph%2F0312215%2Castro-ph%2F0312381%2Castro-ph%2F0312005%2Castro-ph%2F0312350%2Castro-ph%2F0312343%2Castro-ph%2F0312597%2Castro-ph%2F0312490%2Castro-ph%2F0312555%2Castro-ph%2F0312016%2Castro-ph%2F0312283%2Castro-ph%2F0312621%2Castro-ph%2F0312015%2Castro-ph%2F0312011%2Castro-ph%2F0312432%2Castro-ph%2F0312443%2Castro-ph%2F0312608%2Castro-ph%2F0312046%2Castro-ph%2F0312591%2Castro-ph%2F0312050%2Castro-ph%2F0312583%2Castro-ph%2F0312266%2Castro-ph%2F0312038%2Castro-ph%2F0312210%2Castro-ph%2F0312631%2Castro-ph%2F0312154%2Castro-ph%2F0312194%2Castro-ph%2F0312103%2Castro-ph%2F0312594%2Castro-ph%2F0312102%2Castro-ph%2F0312607%2Castro-ph%2F0312452%2Castro-ph%2F0312014%2Castro-ph%2F0312325%2Castro-ph%2F0312025%2Castro-ph%2F0312030%2Castro-ph%2F0312632%2Castro-ph%2F0312406%2Castro-ph%2F0312211%2Castro-ph%2F0312341%2Castro-ph%2F0312546%2Castro-ph%2F0312127%2Castro-ph%2F0312173%2Castro-ph%2F0312372%2Castro-ph%2F0312171%2Castro-ph%2F0312645%2Castro-ph%2F0312545%2Castro-ph%2F0312161%2Castro-ph%2F0312075%2Castro-ph%2F0312264%2Castro-ph%2F0312319%2Castro-ph%2F0312437%2Castro-ph%2F0312253%2Castro-ph%2F0312416%2Castro-ph%2F0312652%2Castro-ph%2F0312556%2Castro-ph%2F0312229%2Castro-ph%2F0312060%2Castro-ph%2F0312201%2Castro-ph%2F0312064&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the relation between `bare' cosmological parameters as the true\nspatial average characteristics that determine the cosmological model, and the\nparameters interpreted by observers with a `Friedmannian bias', i.e., within a\nhomogeneous space geometry. We may say that the latter are `dressed' by the\nsmoothed-out geometrical inhomogeneities of the surveyed spatial region. We\nidentify two effects that quantify the difference between `bare' and `dressed'\nparameters: `curvature backreaction' and `volume effect'. An estimate of the\nlatter is given in terms of a simple geometrical example."}, "authors": ["Thomas Buchert", "Mauro Carfora"], "author_detail": {"name": "Mauro Carfora"}, "author": "Mauro Carfora", "arxiv_comment": "5 pages, LaTeX", "links": [{"href": "http://arxiv.org/abs/astro-ph/0312621v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0312621v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0312621v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0312621v1", "journal_reference": "Proc. 12th JGRG conference, Tokyo 2002, Shibata M. et al. (eds.)\n  (2003), 157-161", "doi": null, "fulltext": "The Cosmic Quartet\nCosmological Parameters of a Smoothed Inhomogeneous Spacetime\nThomas Bucherta,1 and Mauro Carforab,2\n\narXiv:astro-ph/0312621v1 25 Dec 2003\n\na\n\nTheoretische Physik, Ludwig–Maximilians–Universität, Theresienstr. 37, D–80333 München, Germany\nand Department of Physics and Research Center for the Early Universe (RESCEU)\nSchool of Science, The University of Tokyo, Tokyo 113–0033, Japan\nb\n\nDipartimento di Fisica Nucleare e Teorica, Università degli Studi di Pavia\nand Istituto Nazionale di Fisica Nucleare, Sezione di Pavia, via A. Bassi 6, I–27100 Pavia, Italy\n\nAbstract\nWe discuss the relation between 'bare' cosmological parameters as the true spatial\naverage characteristics that determine the cosmological model, and the parameters\ninterpreted by observers with a \"Friedmannian bias\", i.e., within a homogeneous space\ngeometry. We may say that the latter are 'dressed' by the smoothed–out geometrical\ninhomogeneities of the surveyed spatial region. We identify two effects that quantify\nthe difference between 'bare' and 'dressed' parameters: 'curvature backreaction' and\n'volume effect'. An estimate of the latter is given in terms of a simple geometrical\nexample.\n\n1\n\nIntroduction\n\nContemporary cosmology is heading, as is the generally held believe, towards a theoretical home–stretch\nmarked by the determination of three cosmological parameters that characterize the standard model of\ncosmology and with it the whole global history of our Universe. This standard model looks back on a long\nperiod of challenges that were mastered by its apparent robustness. Essentially, it is based on solutions\nof Einstein's equations for a homogeneous and isotropic distribution of matter in the Universe. So, it is\nindeed a simple model that was iconed by Neta Bahcall et al. [1] in terms of a 'cosmic triangle'. The final\nphase of combat, in which we are in at present and as a large body of cosmologists would put it, consists\nof a phase of high–precision cosmology which, through a plethora of orthogonal observations, will soon\nexclaim highly accurate numbers for those three cosmological parameters. But, should we really believe\nthis enormously simplified pledge of the standard model en–chaining predictions throughout all space\nand time?\nA more level–headed approach immediately reminds us of the foundations of the standard model: it\nignores structure in the Universe. Of course, nobody is as naive as ignoring the existence of structure,\nwhich in the recent past was celebrated by a number of observational successes: the discovery of large–scale\nstructure, essentially blowing up the picture of a homogeneous Universe and replacing it by a strongly\nproncounced honeycomb structure of the distribution of galaxies. Those structures are extending as deep\nas hundred millions of lightyears and are still continuing at the borders of our maps of the Universe such\nas that currently drawn by the Sloan Digital Sky Survey group. The \"excuse\" is a conjecture: to maintain\nthe standard model we have to assume that on average the cosmic evolution follows the Friedmannian\nequations whose solutions are fixed by the cosmic triangle.\nGuided by the idea that a universe model should remain simple, while respecting the inhomogeneities\nthat are present in the matter distribution as well as in the geometry of spacetime, we have worked\nout a cosmology that can still be characterized by 'cosmological parameters', but there are essentially\nthree important colors that have to be added to the standard picture: firstly, replacing the parameters\nof the homogeneous universe model by corresponding spatial averages entails a scale–dependence, i.e.,\nthe values of the parameters must depend on the spatial scale over which we average the distribution.\nSecondly, in addition to the standard model parameters, there is a fourth player which encodes the\n1 E-mail:buchert@theorie.physik.uni-muenchen.de\n2 E-mail:mauro.carfora@pv.infn.it\n\n1\n\n\ffluctuations of matter inhomogeneities [3]. If averaged on sufficiently large scales this new parameter\nmay be a small quantity, but it adds a substantial qualitative impact: cosmological parameters are now\nallowed to communicate, they evolve freely governed by the evolution of structure and they are not fixed\neach individually by initial conditions as in the standard model [6]; we may say that the 'cosmic triangle'\nis transformed into a 'cosmic terzet'. Thirdly, and this turns out to be a more deeply–rooted insight:\ncosmological parameters that we would measure and interprete with a \"Friedmannian bias\" (i.e. in a\nhomogeneous spacetime geometry) are 'dressed' [8], i.e., they acquire correction factors stemming from\nthe geometrical inhomogeneities.\nUnderstanding this latter fact took a long and rather challenging route of employing a number of\nresults that were obtained by mathematicians who work on Riemannian geometry [7], reinforcing the\nRicci flow as a natural candidate for the smoothing of geometry [12],[10]. We shall demonstrate in this\nnote that 'the emperor's new clothes' can be seen, and the effect of 'dressing' can be calculated. Possibly,\nthe values interpreted with a Friedmannian bias are appreciably different from the true averages that\ngovern the dynamics of spacetime. Further work must be devoted to quantifying this effect: could we\neventually dismiss the cosmological constant, which now seems to be an unavoidable thigh of the cosmic\ntriangle? It will be exciting to follow this new route of understanding the influence of structure of the\nfluctuating geometry of spacetime itself on the evolution of our Universe.\n\n2\n\nBare and Dressed Cosmological Parameters\n\nTo begin with let us concentrate on the density parameter which measures the actual matter content in a\nspatial slice of the Universe on some spatial scale of observation. We assume that we are given a suitable\nsplit into space and time, i.e., a foliation of spacetime. Since the determination of the total mass on a\nregional domain in relativistic cosmology is a subject of controversy (see, e.g., [2]), we only make use of\nthe well–defined concepts of a local energy density ̺ (here, we only refer to the restmass density for the\nmatter model 'dust'), and itsR spatial Riemannian volume average evaluated on a compact domain, e.g.,\na geodesic ball B0 , h̺iB0 := B0 ̺dμg /VB0 with the Riemannian volume element dμg associated with the\nR\n3–metric of the hypersurface, and the ball's volume VB0 = B0 dμg . Using this averager for all scalar\nvariables in a 3 + 1 ADM setting, we can investigate regional averages of all relevant spatial variables\nsuch as the density and, e.g., the expansion rate hθiB0 =: 3HB0 , defining an effective \"Hubble–constant\"\non the domain of averaging. Hence, the cosmological density parameter that determines the true ('bare')\nsource of the effective dynamics can be unambiguously defined.\nThe averaged Hamiltonian constraint may be cast into a relation among a set of regional cosmological\nparameters as the following scale–dependent functionals [3]:\nΩM\nB0 :=\n\nQK\nK\nΛ\nhRiB0\n8πGMB0\nB0\n; ΩΛ\n; ΩR\n; ΩQ\n,\nB0 :=\nB0 := −\nB0 := −\n2\n2\n2\n3VB0 HB0\n3HB0\n6HB0\n6HB2 0\nK\n\nQ\nR\nΛ\nobeying by construction the Hamiltonian constraint ΩM\nB 0 + ΩB 0 + ΩB 0 + ΩB 0\n\n= 1 ,\n\n(1)\n\nwith the ball's material mass content MB0 , the scalar curvature R, and the cosmological constant Λ. In\ncontrast to the standard FLRW cosmological parameters there are four players. In the FLRW case there is\nby definition no fluctuating source (condensed into the \"kinematical backreaction\" QK\nB0 that is composed\nof positive–definite expansion and shear fluctuation terms (see [3]). Hence, the effective cosmology as the\nspatially averaged model can be determined by a scale–dependent and regional 'cosmic quartet' [4] rather\nthan by a global 'cosmic triangle' [1].\nEq. (1) forms the basis of a discussion of cosmological parameters as they determine the theoretical\nmodel. They may not be, however, directly accessible to observations. Unlike in Newtonian cosmology,\nwhere the corresponding averages have a similar form [5], it is not straightforward to compare the above\nrelativistic average model parameters to observational data. The reason is that the volume–averages\ncontain information on the actually present geometrical inhomogeneities within the averaging domain.\nIn contrast, the \"observer's Universe\" is described in terms of a Euclidean or constant curvature model.\nConsequently, the common interpretation of observations within the set of the standard model parameters,\nif extended by the backreaction parameter or not, neglects the geometrical inhomogeneities that (through\nthe Riemannian volume–average) are hidden in the average characteristics of the theoretical cosmology.\n2\n\n\fWe have suggested an answer to this problem in [7] (see also [9] for a preliminary attempt). Let us\nhighlight some results.\nAccording to [7], the picture discussed above strictly depends on the ratio between two density profiles\ndefined on the averaging domain: one is naturally associated with the actual matter content of the\ngravitational sources, whereas the other is the mass density corresponding to the matter content in\nthe given region, but now thought of as averaged over a geometrically smoothed–out domain B with\nhomogeneous geometry:\nh̺iB0 = MB0 /VB0 ; h̺iB = MB /VB .\n(2)\nWe have implemented a regional smoothing procedure for the geometry of the hypersurface under the\nassumption of preservation of the ball's material content. We can infer already from (2) that the average\ndensity measured with a \"Friedmannian bias\" is dressed by a volume effect due to the difference between\nthe volume of a smoothed region and the actual volume of the bumpy region.\nA further result that explicitly involves the geometrical smoothing flows (e.g., the Ricci flow for the\nmetric) is furnished by a relation between the constant regional curvature in the smoothed model (e.g.,\na FLRW domain) and the actual regional average curvature in the theoretical cosmology:\nRB = hRiB0 (VB /VB0 )−2/3 − QR\nB0 ,\n\n(3)\n\nwhere we have introduced a novel measure for the \"backreaction\" of geometrical inhomogeneities capturing the deviations from the standard FLRW space section, the regional curvature backreaction:\n\u0014\n\u0015\nZ ∞\n\u00012\nVBβ (β) 1\nR\nab\ndβ\nQB0 :=\n(4)\nh R(β) − hR(β)iBβ iBβ − 2hR̃ (β)R̃ab (β)iBβ ,\nVB\n3\n0\nwith R̃ab := Rab − 31 gab R being the trace–free part of the Ricci tensor Rab in the hypersurface. QR\nB0 , built\nfrom scalar invariants of the intrinsic curvature, appears to have a similar form as the \"kinematical backreaction\" term (that was built from invariants of the extrinsic curvature). It features two positive–definite\nparts, the scalar curvature amplitude fluctuations and fluctuations in metrical anisotropies. Depending\non which part dominates we obtain an under– or overestimate of the actual averaged scalar curvature,\nrespectively. β parametrizes integral curves of the smoothing flow for the metric, so that the expression\nabove indeed refers to the explicit form of this flow. Notwithstanding, this term may be estimated by\nthe actual curvature fluctuations, since the Ricci flow acts in a controllable way such that the maxima of\nthe curvature inhomogeneities are monotonically decreasing during the deformation.\nFrom Eq. (3) we can understand the physical content of geometrical averaging. It makes transparent\nthat, in the smoothed model, the averaged scalar curvature is 'dressed' both by the volume effect mentioned above, and by the curvature backreaction effect itself. The volume effect is expected precisely in\nthe form occurring in (3), if we think of comparing two regions of distinct volumes, but with the same\nmatter content, in a constant curvature space. Whereas the backreaction term encodes the deviation of\nthe averaged scalar curvature from a constant curvature model, e.g., a FLRW space section.\nCorrespondingly, an observer with a \"Friedmannian bias\" would interprete his measurements in terms\nof the 'dressed' cosmological parameters:\nM\nΩB\n\n:=\n\n8πGMB\n2\n\n3VB H B\n\n;\n\nΛ\nΩB\n\n:=\n\nΛ\n2\n\n3H B\n\n;\n\nR\nΩB\n\n:= −\n\nRB\n2\n\n6H B\n\n;\n\nQK\nΩB\n\nK\n\n:= −\n\nQB\n\n2\n\n6H B\n\nM\n\nΛ\n\nR\n\nQK\n\n, obeying ΩB + ΩB + ΩB + ΩB\n\n=1 .\n\n(5)\nThe latter equation follows from our assumption that the smoothing procedure requires to respect the\nHamiltonian constraint of Einstein's equations. (For a more detailed discussion see [8].)\n\n3\n\nThe Volume Effect: a Geometrical Example\n\nComparing and using the relations (1) and (5), we conclude that the problem has been condensed into a\nrecipee–type rule of applying results that were obtained on theoretically quite involved grounds. Notwithstanding, the formulation appears simple and therefore immediately suggests questions of practical importance. Concrete numbers are needed in order to persuade workers in observational cosmology of\n3\n\n\fthe actual quantitative importance of the outlined effects. However, to give concrete numbers needs a\nsubstantial effort beyond the currently available methods. One of the obstacles to provide immediate\nestimates is the dependence of the proposed effects on generic dynamical models, which are not well–\ndeveloped in relativistic cosmology. To employ (non–generic) spherically symmetric models is one way\nto go, and we are currently conducting research in this direction.\nHellaby [13] used spherically symmetric models of clusters and voids to obtain the error made by\nestimating average characteristics in comparison with parameters of a corresponding FLRW cosmology.\nThe notion 'corresponding' is defined in the sense of volume matching proposed earlier by Ellis and Stoeger\n[11]. To compare Hellaby's approach with our framework is difficult in detail. The volume fraction which\nwould have to be estimated in our framework is 1 by definition, the 'curvature backreaction' being the only\ngeometrical effect. But, since Hellaby compares scalar average characteristics that involve the averaged\ncurvatures and the averaged densities on a given scale of interest by keeping the volumes the same, the\ncalculated effect still can be used as an indication for the deviations of the averages due to geometrical\ndifferences of the two models. It must be emphasized, however, that a detailed comparison has to follow\nfrom an explicit investigation of our effects, and therefore Hellaby's quoted numbers (amounting to 10–\n30% for typical clusters and voids) can at best be used as an indication. Moreoever, as Hellaby pointed\nout himself, the effect depends on details of the dynamical model which, in the cases he investigated,\nare still simple solutions that can be done analytically. Also, as he mentioned, the effect would strongly\ndepend on the topology of the domain which he chooses to be the simplest.\nA complementary aspect of the problem is that we need to analyze realistic models of hypersurfaces\nin order to learn about the global effect on very large scales; note that, even if we have realistically\nmodelled clusters and voids, we would still need to arrange those patterns according to knowledge of the\ndistribution of large–scale structure. In this sense the effect calculated by Hellaby (loc.cit.) is plausible,\nbut it will not provide the answer on cosmological scales. Let us illustrate this comment: researches\nemploying rough–surface models to realistically model e.g. the moon's surface for the purpose of better\nestimates on reflection intensity of light from the surface, would work with factors of 40 for the fraction\nof the moon's modelled inhomogeneous surface to the surface of a sphere (Karl Vogler, priv. comm.). For\ncosmological volumes the situation is more subtle, since different patterns may increase, but they may\nalso decrease the volume of the spatial domain. Concerning this problem we are currently investigating\na generic relativistic model based on a relativistic generalization of Zel'dovich's approximation, which is\na well–known approximate tool in Newtonian cosmology to model generic structure formation [6].\nFor the sake of illustration of the effect of the volume scaling on the mass density, let us consider the\nfollowing explicit example. Its construction requires the following steps:\n(i) Take a large Euclidean manifold, say a flat 3–torus T 3 of typical size R × R × R.\n(ii) Remove from such a manifold, k Euclidean balls BE ( π2 r) of radius\ncomputational convenience).\n\nπ\n2r\n\nwith\n\nr\nR\n\nsmall, (the\n\nπ\n2\n\nis for\n\n(iii) Glue, in place of the removed Euclidean balls {BE ( π2 r)}, a corresponding number k of 3–spherical\nballs {BS 3 ( π2 r)}, (i.e., balls cut out of the surface of a 3–sphere Sr3 , if the 3–sphere has radius r\nthen the ball BS 3 ( π2 r) is one hemisphere of Sr3 ).\n(iv) Note that such a glueing requires a small amount of negative curvature along the boundary 2–\nspheres of BE ( π2 r) in order to have a smooth interface between the flat geometry of the torus T 3\nand the positive curvature geometry of the 3–spherical balls {BS 3 ( π2 r)}.\n3\n(v) Denote by Tinh\nthe resulting curved torus, where the BS 3 ( π2 r)'s correspond to the local geometric\ninhomogeneity over a region of radius π2 r in a space section of the observed universe, (a sort of\nnaive Swiss–cheese model).\n\nUnder such assumptions (typically, if r/R is suitably small) it is reasonable to conjecture that the\n3\n3\n)),\ngeometry of Tinh\nwill Ricci flow towards the geometry of a flat torus T 3 (with Vol(T 3 ) = Vol(Tinh\nh̺iBinh\nand we can estimate the relative density fraction h̺iB in such a setting. Note that the generic region\nE\n\n3\nBS 3 ( π2 r) supporting the local inhomogeneity in Tinh\ncorresponds to a Euclidean ball BE ( π2 r) in the flat\nsmoothed–out T 3 .\n\n4\n\n\fUnder the local mass preservation constraint, the actual h̺iBS3 and the smoothed–out h̺iBE mass\ndensities are related to each other by (2):\n\u0001\nh̺iBS3\nVol BE ( π2 r)\n\u0001.\n(6)\n=\nh̺iBE\nVol BS 3 ( π2 r)\n\nRecall that\n\n\u0012 \u0013\nZ π\n\u0010\n\u0001 2r 2 t\nπ \u0011\n2\nVol BS 3 ( r) = Vol S (r)\ndt = π 2 r3 ,\nsin\n2\nr\n0\n\n(7)\n\n\u0001\nwhere Vol S 2 (r) is the area of the 2–sphere of radius r. Since\n\n\u0010\nπ \u0011 4 \u0010 π \u00113 π 4 3\nVol BE ( r) = π\nr =\nr ,\n2\n3\n2\n6\n\nwe get\n\n\u0001\nh̺iBS3\nVol BE ( π2 r)\nπ2\n\u0001 =\n=\n≃ 1. 6449 .\nπ\nh̺iBE\n6\nVol BS 3 ( 2 r)\n\n(8)\n\n(9)\n\nThis shows that indeed one can have a significant mismatch between the actual average mass density and\nthe smoothed–out mass density owing only to the volume effect (the curvature backreaction effect was\nnot considered in this rather qualitative example).\n\nAcknowledgments\nTB acknowledges hospitality by the University of Tokyo and financial support by the Research Center\nfor the Early Universe (RESCEU, Tokyo), COE Monkasho Grant. This work is also partially supported\nby the Sonderforschungsbereich SFB 375 'Astroparticle physics' by the German science foundation DFG,\nand by the Ministero dell' Universita' e della Ricerca Scientifica under the PRIN project 'The Geometry\nof Integrable Systems'.\n\nReferences\n[1] N. A. Bahcall, J. P. Ostriker, S. Perlmutter and P. J. Steinhardt, Science 284, 1481 (1999).\n[2] H. L. Bray, Notices of the AMS 49, 1372 (2002).\n[3] T. Buchert, G.R.G. 32, 105 (2000).\n[4] T. Buchert, in: 9th JGRG Meeting, Hiroshima 1999, Y. Eriguchi et al. (eds.), pp. 306–321 (2000).\n[5] T. Buchert and J. Ehlers, A.& A. 320, 1 (1997).\n[6] T. Buchert, M. Kerscher and C. Sicka, P.R.D. 62, 043525 (2000).\n[7] T. Buchert and M. Carfora, C.Q.G. 19, 6109 (2002).\n[8] T. Buchert and M. Carfora, P.R.L. 90, 31101 (2003).\n[9] M. Carfora and K. Piotrkowska, P.R.D. 52, 4393 (1995).\n[10] B. Chow, Preprint: math.DG/0211266 (2002).\n[11] G. F. R. Ellis and W. Stoeger, C.Q.G. 4, 1697 (1987).\n[12] R. S. Hamilton, in Surveys in Differential Geometry Vol 2, International Press, pp.7–136 (1995).\n[13] C. Hellaby, G.R.G. 20, 1203 (1988).\n\n5\n\n\f"}