{"id": "http://arxiv.org/abs/astro-ph/0001293v1", "guidislink": true, "updated": "2000-01-17T12:30:54Z", "updated_parsed": [2000, 1, 17, 12, 30, 54, 0, 17, 0], "published": "2000-01-17T12:30:54Z", "published_parsed": [2000, 1, 17, 12, 30, 54, 0, 17, 0], "title": "Solar cycle variation in solar f-mode frequencies and radius", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0001238%2Castro-ph%2F0001485%2Castro-ph%2F0001470%2Castro-ph%2F0001514%2Castro-ph%2F0001254%2Castro-ph%2F0001317%2Castro-ph%2F0001189%2Castro-ph%2F0001284%2Castro-ph%2F0001309%2Castro-ph%2F0001109%2Castro-ph%2F0001117%2Castro-ph%2F0001450%2Castro-ph%2F0001085%2Castro-ph%2F0001394%2Castro-ph%2F0001314%2Castro-ph%2F0001114%2Castro-ph%2F0001527%2Castro-ph%2F0001022%2Castro-ph%2F0001364%2Castro-ph%2F0001318%2Castro-ph%2F0001082%2Castro-ph%2F0001371%2Castro-ph%2F0001248%2Castro-ph%2F0001265%2Castro-ph%2F0001389%2Castro-ph%2F0001415%2Castro-ph%2F0001426%2Castro-ph%2F0001260%2Castro-ph%2F0001212%2Castro-ph%2F0001290%2Castro-ph%2F0001014%2Castro-ph%2F0001507%2Castro-ph%2F0001282%2Castro-ph%2F0001125%2Castro-ph%2F0001505%2Castro-ph%2F0001102%2Castro-ph%2F0001353%2Castro-ph%2F0001293%2Castro-ph%2F0001406%2Castro-ph%2F0001451%2Castro-ph%2F0001221%2Castro-ph%2F0001122%2Castro-ph%2F0001289%2Castro-ph%2F0001369%2Castro-ph%2F0001196%2Castro-ph%2F0001310%2Castro-ph%2F0001004%2Castro-ph%2F0001020%2Castro-ph%2F0001546%2Castro-ph%2F0001506%2Castro-ph%2F0001511%2Castro-ph%2F0001478%2Castro-ph%2F0001375%2Castro-ph%2F0001146%2Castro-ph%2F0001473%2Castro-ph%2F0001090%2Castro-ph%2F0001206%2Castro-ph%2F0001378%2Castro-ph%2F0001316%2Castro-ph%2F0001412%2Castro-ph%2F0001263%2Castro-ph%2F0001347%2Castro-ph%2F0001395%2Castro-ph%2F0001107%2Castro-ph%2F0001356%2Castro-ph%2F0001387%2Castro-ph%2F0001305%2Castro-ph%2F0001360%2Castro-ph%2F0001481%2Castro-ph%2F0001498%2Castro-ph%2F0001163%2Castro-ph%2F0001393%2Castro-ph%2F0001405%2Castro-ph%2F0001115%2Castro-ph%2F0001184%2Castro-ph%2F0001154%2Castro-ph%2F0001428%2Castro-ph%2F0001499%2Castro-ph%2F0001078%2Castro-ph%2F0001153%2Castro-ph%2F0001472%2Castro-ph%2F0001063%2Castro-ph%2F0001444%2Castro-ph%2F0001358%2Castro-ph%2F0001192%2Castro-ph%2F0001287%2Castro-ph%2F0001250%2Castro-ph%2F0001151%2Castro-ph%2F0001056%2Castro-ph%2F0001431%2Castro-ph%2F0001126%2Castro-ph%2F0001023%2Castro-ph%2F0001225%2Castro-ph%2F0001021%2Castro-ph%2F0001259%2Castro-ph%2F0001361%2Castro-ph%2F0001281%2Castro-ph%2F0001249%2Castro-ph%2F0001442%2Castro-ph%2F0001500%2Castro-ph%2F0001273&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Solar cycle variation in solar f-mode frequencies and radius"}, "summary": "Using data from the Global Oscillation Network Group (GONG) covering the\nperiod from 1995 to 1998, we study the change with solar activity in solar\nf-mode frequencies. The results are compared with similar changes detected from\nthe Michelson Doppler Imager (MDI) data. We find variations in f-mode\nfrequencies which are correlated with solar activity indices. If these changes\nare due to variation in solar radius then the implications are that the solar\nradius decreases by about 5 km from minimum to maximum activity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0001238%2Castro-ph%2F0001485%2Castro-ph%2F0001470%2Castro-ph%2F0001514%2Castro-ph%2F0001254%2Castro-ph%2F0001317%2Castro-ph%2F0001189%2Castro-ph%2F0001284%2Castro-ph%2F0001309%2Castro-ph%2F0001109%2Castro-ph%2F0001117%2Castro-ph%2F0001450%2Castro-ph%2F0001085%2Castro-ph%2F0001394%2Castro-ph%2F0001314%2Castro-ph%2F0001114%2Castro-ph%2F0001527%2Castro-ph%2F0001022%2Castro-ph%2F0001364%2Castro-ph%2F0001318%2Castro-ph%2F0001082%2Castro-ph%2F0001371%2Castro-ph%2F0001248%2Castro-ph%2F0001265%2Castro-ph%2F0001389%2Castro-ph%2F0001415%2Castro-ph%2F0001426%2Castro-ph%2F0001260%2Castro-ph%2F0001212%2Castro-ph%2F0001290%2Castro-ph%2F0001014%2Castro-ph%2F0001507%2Castro-ph%2F0001282%2Castro-ph%2F0001125%2Castro-ph%2F0001505%2Castro-ph%2F0001102%2Castro-ph%2F0001353%2Castro-ph%2F0001293%2Castro-ph%2F0001406%2Castro-ph%2F0001451%2Castro-ph%2F0001221%2Castro-ph%2F0001122%2Castro-ph%2F0001289%2Castro-ph%2F0001369%2Castro-ph%2F0001196%2Castro-ph%2F0001310%2Castro-ph%2F0001004%2Castro-ph%2F0001020%2Castro-ph%2F0001546%2Castro-ph%2F0001506%2Castro-ph%2F0001511%2Castro-ph%2F0001478%2Castro-ph%2F0001375%2Castro-ph%2F0001146%2Castro-ph%2F0001473%2Castro-ph%2F0001090%2Castro-ph%2F0001206%2Castro-ph%2F0001378%2Castro-ph%2F0001316%2Castro-ph%2F0001412%2Castro-ph%2F0001263%2Castro-ph%2F0001347%2Castro-ph%2F0001395%2Castro-ph%2F0001107%2Castro-ph%2F0001356%2Castro-ph%2F0001387%2Castro-ph%2F0001305%2Castro-ph%2F0001360%2Castro-ph%2F0001481%2Castro-ph%2F0001498%2Castro-ph%2F0001163%2Castro-ph%2F0001393%2Castro-ph%2F0001405%2Castro-ph%2F0001115%2Castro-ph%2F0001184%2Castro-ph%2F0001154%2Castro-ph%2F0001428%2Castro-ph%2F0001499%2Castro-ph%2F0001078%2Castro-ph%2F0001153%2Castro-ph%2F0001472%2Castro-ph%2F0001063%2Castro-ph%2F0001444%2Castro-ph%2F0001358%2Castro-ph%2F0001192%2Castro-ph%2F0001287%2Castro-ph%2F0001250%2Castro-ph%2F0001151%2Castro-ph%2F0001056%2Castro-ph%2F0001431%2Castro-ph%2F0001126%2Castro-ph%2F0001023%2Castro-ph%2F0001225%2Castro-ph%2F0001021%2Castro-ph%2F0001259%2Castro-ph%2F0001361%2Castro-ph%2F0001281%2Castro-ph%2F0001249%2Castro-ph%2F0001442%2Castro-ph%2F0001500%2Castro-ph%2F0001273&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using data from the Global Oscillation Network Group (GONG) covering the\nperiod from 1995 to 1998, we study the change with solar activity in solar\nf-mode frequencies. The results are compared with similar changes detected from\nthe Michelson Doppler Imager (MDI) data. We find variations in f-mode\nfrequencies which are correlated with solar activity indices. If these changes\nare due to variation in solar radius then the implications are that the solar\nradius decreases by about 5 km from minimum to maximum activity."}, "authors": ["H. M. Antia", "Sarbani Basu", "J. Pintar", "B. Pohl"], "author_detail": {"name": "B. Pohl"}, "author": "B. Pohl", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1023/A:1005204800696", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0001293v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0001293v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "To appear in Solar Physics", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0001293v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0001293v1", "journal_reference": "Solar Phys. 192 (2000) 459", "doi": "10.1023/A:1005204800696", "fulltext": "SOLAR CYCLE VARIATION IN SOLAR F-MODE\nFREQUENCIES AND RADIUS\nH. M. Antia\nTata Institute of Fundamental Research, Homi Bhabha Road, Mumbai 400005,\nIndia\n\narXiv:astro-ph/0001293v1 17 Jan 2000\n\nSarbani Basu\nInstitute for Advanced Study, Olden Lane, Princeton NJ 08540, U. S. A., and\nAstronomy Deparment, Yale University, P.O. Box 208101 New Haven, CT\n06520-8101 USA\n\nJ. Pintar and B. Pohl∗\nNational Solar Observatory, PO Box 26732, Tucson AZ 85726-6732, U. S. A.\nNovember 16, 2018\nAbstract. Using data from the Global Oscillation Network Group (GONG) covering the period from 1995 to 1998, we study the change with solar activity in solar\nf-mode frequencies. The results are compared with similar changes detected from\nthe Michelson Doppler Imager (MDI) data. We find variations in f-mode frequencies\nwhich are correlated with solar activity indices. If these changes are due to variation\nin solar radius then the implications are that the solar radius decreases by about 5\nkm from minimum to maximum activity.\nKeywords: Sun: general – Sun: Oscillations\n\n1. Introduction\nThe fundamental mode or f-mode of solar oscillations are believed to\nbe surface gravity modes whose frequencies are essentially independent\nof the stratification in the solar interior. A large part of the difference\nbetween the observed f-mode frequencies at intermediate degree and\nthose in a standard solar model has been interpreted as being caused\nby the incorrect radius of the solar models used (Schou et al. 1997; Antia 1998; Brown and Christensen-Dalsgaard 1998; Tripathy and Antia\n1999). The frequencies of these modes can thus be used to measure the\nsolar radius.\nThere have been many reports about possible variation of solar radius with time (Delache, Laclare and Sadsaoud 1985; Wittmann, Alge\nand Bianda 1993; Fiala, Dunham and Sofia 1994; Laclare et al. 1996;\nNoeel 1997). The reported change in measured angular semi-diameter\nvaries from 0.1′′ to 1′′ , which implies a change of 70 to 700 km in\n∗\n\npresent address: US Naval Observatories, Washington, DC 20392-5420, U. S. A.\n\nfmodpap.tex; 16/11/2018; 7:02; p.1\n\n\f2\n\nH. M. Antia et al.\n\nradius. However, there is no agreement among observers about these\nvariations. It would thus be interesting to look for corresponding variations in the f-mode frequencies. The reported variations in solar radius\nshould change the f-mode frequencies by 0.1 to 1 μHz, which is much\nlarger than the error estimates in these frequencies. Considering how\nsmall the estimated errors in f-mode frequencies are, it is possible to\nmeasure changes in the solar radius as small as a few kilometers over the\nsolar cycle. Some variation in f-mode frequencies have been reported\nin the MDI data by Dziembowski et al. (1998) who find that the solar\nradius reached a minimum around the minimum activity period and\nwas larger by about 5 km, 6 months before and after the minimum.\nIf this variation is correlated with solar activity then we would expect\nmuch larger change between minimum and maximum activity.\nIn this work we look for possible variations in the solar radius using\nGONG data - which extend over longer time period than the MDI\ndata used in previous studies. We also look for possible correlations\nbetween change in radius and solar activity. In Section 2 we outline\nthe technique used in calculating the frequencies and examine possible\nsystematic errors in computed frequencies. Section 3 gives the results\nwhile in Section 4 we summarize the conclusions from our study.\n\n2. The technique\nSince the f-modes have very low power they are barely visible in the\nspectra for modes of a given degree l and azimuthal order m that\nthe GONG project fits to determine solar oscillation frequencies. As a\nresult, it is difficult to determine the frequencies of these modes reliably\nfrom these spectra. To improve statistics we use the rotation-corrected,\nm-averaged, power spectra from GONG data (Pohl and Anderson 1998)\nto calculate the mean f-mode frequencies. Because summing over the\n2l + 1 spectra for a mode of degree l makes the peaks better defined, it\nis possible to fit them reliably. Each of these spectra was obtained from\n3 GONG months (108 days) of data and has a frequency resolution\nof 0.107 μHz. These spectra extend up to l = 200 and frequency ν =\n> 100. We have\n2083 μHz. The f-mode peaks are clearly visible for l ∼\nalso used two spectra covering only 1 GONG month, which gives a\nlower frequency resolution of 0.321 μHz. For these spectra the errors\nin computed frequency would be larger as compared to the 3 month\nspectra.\nWe fit each mode separately using a maximum likelihood technique\n(Anderson, Duvall and Jefferies 1991) with a symmetric Lorentzian\nprofile for the peaks. The fit is performed over a region extending to\n\nfmodpap.tex; 16/11/2018; 7:02; p.2\n\n\fSolar cycle variation in f-mode frequencies\n\n3\n\nFigure 1. Fit to the l = 158 f-mode spectra for months 33–35. Power is in arbitrary\nunits.\n\nabout 20 μHz on either side of the peak and includes leaks from modes\nof degree l − 3 to l + 3, l being the degree of the target mode. It is\nfound that peaks arising from the l + 1 leak are split into two because\nof leaks from peaks of m ± 1. Similarly, the l + 2 leak is split into three\nbecause of leaks from peaks of m, m ± 2. Although leaks from l − 1\nand l − 2 are also split in a similar manner, the power in these peaks\nis much smaller. Thus we have explicitly fitted the m-leaks only from\nthe l + 1 and l + 2 peaks. An example of the fit is shown in Fig. 1.\nFor ν < 1170 μHz, the modes are difficult to fit reliably since the\nwidth is smaller than the resolution limit of the spectra and the power is\nrelatively low. As a result, in this work we only include higher frequency\nmodes.\nThe use of m-averaged spectra may introduce some systematic errors in determining the frequencies. To check for these we compare\nthe frequencies of p-modes fitted from m-averaged spectra with those\nobtained by the GONG project using the individual m spectra. The\n\nfmodpap.tex; 16/11/2018; 7:02; p.3\n\n\f4\n\nH. M. Antia et al.\n\nFigure 2. Difference in frequencies for months 33–35 between the values obtained\nfrom the m-averaged spectra and those computed from the individual m-spectra.\nFor clarity only a few error-bars are shown.\n\nGONG project has computed the mean frequency for each n, l multiplet\nby fitting the frequencies for individual values of m to polynomials in\nm. This mean frequency can be compared with the frequency computed\nfrom the m-averaged spectra. The results are shown in Fig. 2. It may\nbe noted that f-mode has not been fitted in the individual m spectra\nand hence these are not included. It can be seen that the frequency\ndifference is quite small being of the order of the estimated errors in\nthe fitted frequencies. Systematic difference between these two sets of\n< 10 nHz.\nfrequencies is ∼\nAnother possible source of systematic errors is the use of incorrect even-order splitting coefficients while constructing the m-averaged\nspectra. The GONG spectra were obtained by setting these coefficients\nto zero. A non-zero value of these even-order coefficients would introduce some systematic shift in frequencies. To estimate the effect of this\nwe constructed some m-averaged spectra with either a2 = −0.2 nHz or\na4 = 0.1 nHz. The resulting frequency shifts with a2 = −0.2 nHz are\nshown in Fig. 3. Similar shifts are found for non-zero a4 . Once again\nthe frequency shifts due to non-zero a2 or a4 are quite small, being of\nthe order of 10 nHz. Furthermore, the frequency shift for the f-mode\nis smaller than those for p-mode with the same l. Although these even\ncoefficients are known to change with solar cycle, the variation is not\n\nfmodpap.tex; 16/11/2018; 7:02; p.4\n\n\fSolar cycle variation in f-mode frequencies\n\n5\n\nFigure 3. Shift in frequencies for months 21–23 arising due to non-zero a2\n\nvery large at the low frequencies which we are considering in this work.\nThus the shifts shown in Fig. 3 can be considered to be conservative\nupper limits to errors that may be expected due to non-zero even\ncoefficients. From Fig. 2 it can be seen that during a period where\neven coefficients are fairly large the difference in frequencies computed\nfrom individual m-spectra and the m-averaged spectra is quite small\n- much smaller than the differences seen in Fig. 3.\nConsidering possible systematic errors, it would be desirable to restrict ourselves to low frequency range where these errors are not significant. In the frequency range (ν < 1440 μHz) considered in this work the\nsystematic errors from these effects are expected to be about 10 nHz,\nand any time variation in these systematic effects would be smaller.\nHaving established the reliability of frequencies from m-averaged spectra we calculate the frequencies from 7 different spectra during 1995 to\n1998. These spectra are listed in Table 1. This table also lists the solar\nactivity as measured by the mean daily sunspot number, RI from the\nSolar Geophysical Data web page of the US National Geophysical Data\nCenter (http://www.ngdc.noaa.gov/stp/stp.html).\n\nfmodpap.tex; 16/11/2018; 7:02; p.5\n\n\f6\n\nH. M. Antia et al.\n\nTable I. List of GONG spectra used\nGONG months\n3\n8\n21\n27\n33\n\n–5\n– 10\n– 23\n– 29\n– 35\n36\n37\n\nStarting date\n\nEnding date\n\nMean daily sunspot no.\n\n1995-07-18\n1996-01-14\n1997-04-26\n1997-11-28\n1998-07-02\n1998-10-18\n1998-11-23\n\n1995-11-02\n1996-04-30\n1997-08-11\n1998-03-15\n1998-10-17\n1998-11-22\n1998-12-28\n\n14.5 ± 1.3\n6.0 ± 0.6\n14.7 ± 1.1\n39.5 ± 1.7\n79.5 ± 2.5\n62.4 ± 4.1\n82.6 ± 4.1\n\n3. Results\nWe have fitted each of the 7 spectra listed in Table 1 to calculate the\nmean frequencies of the f modes. Fig. 4 shows the relative difference\nbetween the observed frequencies for Months 33–35 and Months 8–10.\nIt can be seen that to a first approximation the relative frequency difference is independent of frequency and hence this frequency difference can\nbe interpreted as arising from a change in the solar radius. Of course,\nsuitable combination of other effects like magnetic field, convection etc.\nmay also yield frequency differences which are independent of frequency\nbut that will almost certainly require some fine-tuning of parameters,\nwhile change in solar radius would be a simpler explanation.\nTo estimate the possible change in radius we take an average over the\nrelative frequency difference for all 56 f-modes that were successfully\nfitted in all spectra:\nP δνl\nl σ2\nl\n1\nl σ2\nl\n\nhδνi = P\n\n(1)\n\nThe differences were taken with respect to calculated frequencies for a\nstandard solar model, which is a static model, constructed with OPAL\nopacities (Iglesias & Rogers 1996) and low temperature opacities from\nKurucz (1991). The OPAL equation of state (Rogers, Swenson & Iglesias 1996) was used to construct the model and convective flux was\ncalculated using the the formulation of Canuto and Mazzitelli (1991).\nThe radius of the model is 695.78 Mm (Antia 1998). The results are\nshown in Fig. 5, which also shows the mean daily sunspot number,\nRI , for each of these periods. The change in frequencies appears to be\ncorrelated with the sunspot number.\n\nfmodpap.tex; 16/11/2018; 7:02; p.6\n\n\fSolar cycle variation in f-mode frequencies\n\n7\n\nFigure 4. Relative frequency differences between f-mode frequencies from the spectra\nfor months 33–35 and months 8–10.\n\nFigure 5. The averaged frequency difference for f-modes between the Sun and a\nstandard solar model with radius R = 695.78 Mm as a function of time is shown\nby the continuous line. The mean daily sunspot number RI is also shown by points\nwith scale shown on the right side. For clarity these points have been slightly shifted\nalong the x-axis.\n\nfmodpap.tex; 16/11/2018; 7:02; p.7\n\n\f8\n\nH. M. Antia et al.\n\nIf the change in frequencies is entirely due to change in radius then\nthe average frequency difference is related to change in radius (Antia\n1998) by\n3 δR\nδν\n(2)\nh i=−\nν\n2 R\nThus a relative shift in frequencies by 10−5 corresponds to a change in\nradius by 0.67 × 10−5 R⊙ ≈ 4.7 km. It may be argued that the change\nof frequency may be due to some other effect, e.g., magnetic field. Since\nthe relative frequency difference between the frequencies at two different epochs is almost independent of frequency in the range of degrees\nconsidered here, a change in radius is the simplest explanation for the\nfrequency shift. Of course, the magnetic field is directly correlated to\nactivity indices, but the direct effect of magnetic field, is likely to yield\nfrequency differences that will increase rapidly with frequency since the\nhigher frequency modes are located closer to solar surface where these\neffects are likely to be more important (Campbell and Roberts 1989).\nIt may be noted that a reduction in solar radius by 4.7 km in 2 years\nwill generate about 100 times the solar luminosity through release of\ngravitational potential energy, if the contraction in homologous. This\nindicates that the change in radius is a superficial effect confined to\nouter layers where the f-modes are located.\nHowever, the radius appears to decrease with increasing activity.\nThis is not what is seen by Dziembowski et al. (1998). The magnitude\nof change found in GONG data during the period covered by their\nstudy is much smaller than what they have reported. The apparent\ndiscrepancy is most likely due to a different range of degrees used\nin their study. They have probably used modes up to l = 300 and\nthese high wavenumber modes are known to deviate significantly from\nthe simple dispersion relation (Duvall, Kosovichev and Murawski 1998;\nAntia and Basu 1999). As a result, one can expect misleading results if\naverage is taken over all modes, since it is possible that the deviation\nof the modes from the normal dispersion relation has some solar cycle\ndependence. A part of the deviation is known to be due to the use\nof symmetric profiles in calculating the f-mode frequencies (Antia and\nBasu 1999) and it is quite possible that the asymmetry changes with\nactivity. Thus it would be better to confine our attention to modes with\nl < 200, where these effects are minimal. The results shown in Fig. 2\nof Dziembowski et al. (1998) imply a decrease in frequency by 10−5\nbetween 1996.8 and 1997.2. If this change is correlated with sunspot\nnumber then we would expect a decrease by at least 5 × 10−5 between\n1996 and 1998.6 in our results. Certainly no such shift is seen in our\nresults. This shift is also much larger than the expected systematic\nerrors in our results.\n\nfmodpap.tex; 16/11/2018; 7:02; p.8\n\n\fSolar cycle variation in f-mode frequencies\n\n9\n\nFigure 6. The averaged frequency difference for f-modes between the Sun and a\nstandard solar model with radius R = 695.78 Mm are plotted against the mean\nsunspot number during the period of observation. The average over three different\nfrequency ranges as marked in the figure are compared with each other. The line\nmarks the best linear fit for the full frequency range. The triangles and squares are\nslightly shifted along x-axis for clarity.\n\nIn order to check the stability of our results we have repeated the\nanalysis by restricting the frequencies to 1.17 < ν < 1.32 mHz and\n1.32 < ν < 1.44 mHz and the results are shown in Fig. 6. It is clear\nthat the results are not particularly sensitive to the range of frequencies\nused. However, the correlation with solar activity is markedly weaker\nin the higher frequency range. From the relative frequency differences\nbetween the observed frequencies and those in a standard solar model\nit is known (Tripathy & Antia 1999) that there is a distinct tendency of\nrelative frequency differences decreasing with frequency in this range.\nIt is likely that this trend is due to some other effect like magnetic\nfield which varies with solar cycle. In that case it will interfere with the\nsignal due to change in radius. It is quite possible that at even higher\nfrequencies used in MDI study, the correlation is further weakened\nbecause there is an even stronger decrease in the relative frequency\ndifferences.\n\nfmodpap.tex; 16/11/2018; 7:02; p.9\n\n\f10\n\nH. M. Antia et al.\n\n4. Conclusions\nWe have calculated the mean f-mode frequencies from the m-averaged\nspectra from GONG data covering 108 days. The use of m-averaged\nspectra enable us to determine the frequencies reliably. The relative\nfrequency difference between observed frequencies and those calculated\nfor a standard solar model are roughly independent of l in the range\nthat was used in this study (100 < l < 200). Hence it is likely that this\ndifference is due to difference in solar radius, as other agents are likely\nto introduce a steep frequency dependence in relative frequency differences. The mean shift in f-mode frequencies appears to be correlated\nwith solar activity indices like the mean daily sunspot number RI .\nIf this frequency shift is due to change in solar radius then the radius\ndecreases as activity increases. Further, the change in the solar radius\nduring the solar cycle is approximately 5 km. This is one or two orders of\nmagnitude smaller than the changes reported earlier (Delache, Laclare\nand Sadsaoud 1985; Wittmann, Alge and Bianda 1993; Fiala, Dunham\nand Sofia 1994; Laclare et al. 1996; Noeel 1997).\nThese results on the change in solar radius with solar cycle are much\nless than what has been deduced using MDI data (Dziembowski et\nal. 1998) and we believe the discrepancy is due to their using higher\ndegree modes whose frequencies can be affected by a variety of other\nagents, since these modes are localized closer to the solar surface.\n\nAcknowledgements\nThis work utilizes data obtained by the Global Oscillation Network\nGroup (GONG) project, managed by the National Solar Observatory,\na Division of the National Optical Astronomy Observatories, which is\noperated by AURA, Inc. under a cooperative agreement with the National Science Foundation. The data were acquired by instruments operated by the Big Bear Solar Observatory, High Altitude Observatory,\nLearmonth Solar Observatory, Udaipur Solar Observatory, Instituto de\nAstrofisico de Canarias, and Cerro Tololo Inter-American Observatory.\n\nReferences\nAnderson, E., Duvall, T., and Jefferies, S.: 1990, Astrophys. J. 364, 699.\nAntia, H. M.: 1998, Astron. Astrophys. 330, 336.\nAntia, H. M., and Basu, S.: 1999, Astrophys. J. 519, 400.\nBrown, T. M., and Christensen-Dalsgaard, J.: 1998, Astrophys. J. 500, L195.\nCampbell, W. R., and Roberts, B.: 1989, Astrophys. J. 338, 533.\n\nfmodpap.tex; 16/11/2018; 7:02; p.10\n\n\fSolar cycle variation in f-mode frequencies\n\n11\n\nCanuto, V. M., and Mazzitelli, I.: 1991, Astrophys. J. 370, 295\nDelache, P., Laclare, F., and Sadsaoud, H.: 1985, Nature 317, 416.\nDuvall, T. L., Jr., Kosovichev, A. G., and Murawski, K.: 1998, Astrophys. J. 505,\nL55.\nDziembowski, W. A., Goode, P. R., DiMauro, M. P., Kosovichev, A. G., and Schou,\nJ.: 1998, Astrophys. J. 509, 456.\nFiala, A. D., Dunham, D. W., and Sofia, S.: 1994, Solar Phys. 152, 97.\nIglesias, C. A., and Rogers, F. J.: 1996, Astrophys. J. 464, 943.\nKurucz R. L.: 1991, in Stellar Atmospheres: Beyond Classical Models. Eds., L.,\nCrivellari, T. Hubeny, D. G. Hummer, NATO ASI Series, Kluwer, Dordrecht,\np.441\nLaclare, F., Delmas, C., Coin, J. P., and Irbah, A.: 1996, Solar Phys. 166, 211.\nNoeel, F.: 1997, Astron. Astrophys. 325, 825.\nPohl, B., and Anderson, E.: 1998, in Structure and Dynamics of the Interior of the\nSun and Sun-like Stars, Eds., S. Korzennik, and A. Wilson, ESA SP418, p297.\nRogers, F. J., Swenson, F. J., and Iglesias, C. A.: 1996, Astrophys. J. 456, 902\nSchou, J., Kosovichev, A. G., Goode, P. R., and Dziembowski, W. A.: 1997,\nAstrophys. J. 489, L197.\nTripathy, S. C., and Antia, H. M.: 1999, Solar Phys. 186, 1.\nWittmann, A. D., Alge, E., and Bianda, M.: 1993, Solar Phys. 145, 205.\n\nfmodpap.tex; 16/11/2018; 7:02; p.11\n\n\ffmodpap.tex; 16/11/2018; 7:02; p.12\n\n\f"}