{"id": "http://arxiv.org/abs/astro-ph/0611385v2", "guidislink": true, "updated": "2007-04-24T12:13:17Z", "updated_parsed": [2007, 4, 24, 12, 13, 17, 1, 114, 0], "published": "2006-11-13T13:42:13Z", "published_parsed": [2006, 11, 13, 13, 42, 13, 0, 317, 0], "title": "Spectral and timing properties of a dissipative GRB photosphere", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0611144%2Castro-ph%2F0611793%2Castro-ph%2F0611613%2Castro-ph%2F0611786%2Castro-ph%2F0611385%2Castro-ph%2F0611153%2Castro-ph%2F0611297%2Castro-ph%2F0611295%2Castro-ph%2F0611485%2Castro-ph%2F0611640%2Castro-ph%2F0611229%2Castro-ph%2F0611038%2Castro-ph%2F0611774%2Castro-ph%2F0611897%2Castro-ph%2F0611939%2Castro-ph%2F0611777%2Castro-ph%2F0611590%2Castro-ph%2F0611684%2Castro-ph%2F0611695%2Castro-ph%2F0611892%2Castro-ph%2F0611884%2Castro-ph%2F0611796%2Castro-ph%2F0611717%2Castro-ph%2F0611661%2Castro-ph%2F0611359%2Castro-ph%2F0611629%2Castro-ph%2F0611475%2Castro-ph%2F0611468%2Castro-ph%2F0611408%2Castro-ph%2F0611141%2Castro-ph%2F0611705%2Castro-ph%2F0611212%2Castro-ph%2F0611305%2Castro-ph%2F0611944%2Castro-ph%2F0611250%2Castro-ph%2F0611164%2Castro-ph%2F0611764%2Castro-ph%2F0611201%2Castro-ph%2F0611926%2Castro-ph%2F0611058%2Castro-ph%2F0611905%2Castro-ph%2F0611732%2Castro-ph%2F0611025%2Castro-ph%2F0611531%2Castro-ph%2F0611418%2Castro-ph%2F0611743%2Castro-ph%2F0611625%2Castro-ph%2F0611176%2Castro-ph%2F0611901%2Castro-ph%2F0611126%2Castro-ph%2F0611794%2Castro-ph%2F0611088%2Castro-ph%2F0611138%2Castro-ph%2F0611069%2Castro-ph%2F0611712%2Castro-ph%2F0611155%2Castro-ph%2F0611842%2Castro-ph%2F0611287%2Castro-ph%2F0611948%2Castro-ph%2F0611911%2Castro-ph%2F0611502%2Castro-ph%2F0611592%2Castro-ph%2F0611196%2Castro-ph%2F0611854%2Castro-ph%2F0611260%2Castro-ph%2F0611489%2Castro-ph%2F0611373%2Castro-ph%2F0611588%2Castro-ph%2F0611807%2Castro-ph%2F0611482%2Castro-ph%2F0611213%2Castro-ph%2F0611106%2Castro-ph%2F0611766%2Castro-ph%2F0611005%2Castro-ph%2F0611199%2Castro-ph%2F0611636%2Castro-ph%2F0611557%2Castro-ph%2F0611519%2Castro-ph%2F0611338%2Castro-ph%2F0611821%2Castro-ph%2F0611726%2Castro-ph%2F0611601%2Castro-ph%2F0611745%2Castro-ph%2F0611506%2Castro-ph%2F0611310%2Castro-ph%2F0611185%2Castro-ph%2F0611550%2Castro-ph%2F0611347%2Castro-ph%2F0611553%2Castro-ph%2F0611689%2Castro-ph%2F0611825%2Castro-ph%2F0611599%2Castro-ph%2F0611665%2Castro-ph%2F0611101%2Castro-ph%2F0611925%2Castro-ph%2F0611091%2Castro-ph%2F0611330%2Castro-ph%2F0611750%2Castro-ph%2F0611549%2Castro-ph%2F0611317%2Castro-ph%2F0611142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectral and timing properties of a dissipative GRB photosphere"}, "summary": "We explore the observational appearance of the photosphere of an\nultrarelativistic flow with internal dissipation of energy as predicted by the\nmagnetic reconnection model. Previous study of the radiative transfer in the\nphotospheric region has shown that gradual dissipation of energy results in a\nhot photosphere. There, inverse Compton scattering of the thermal radiation\nadvected with the flow leads to powerful photospheric emission with spectral\nproperties close to those of the observed prompt GRB emission. Here, we build\non that study by calculating the spectra for a large range of the\ncharacteristics of the flow. An accurate fitting formula is given that provides\nthe photospheric spectral energy distribution in the ~10 keV to ~10 MeV energy\nrange (in the central engine frame) as a function of the basic physical\nparameters of the flow. It facilitates the direct comparison of the model\npredictions with observations, including the variability properties of the\nlightcurves. We verify that the model naturally accounts for the observed\nclustering in peak energies of the E*f(E) spectrum. In this model, the Amati\nrelation indicates a tendency for the most luminous bursts to have more energy\nper baryon. If this tendency also holds for individual GRB pulses, the model\npredicts the observed narrowing of the width of pulses with increasing photon\nenergy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0611144%2Castro-ph%2F0611793%2Castro-ph%2F0611613%2Castro-ph%2F0611786%2Castro-ph%2F0611385%2Castro-ph%2F0611153%2Castro-ph%2F0611297%2Castro-ph%2F0611295%2Castro-ph%2F0611485%2Castro-ph%2F0611640%2Castro-ph%2F0611229%2Castro-ph%2F0611038%2Castro-ph%2F0611774%2Castro-ph%2F0611897%2Castro-ph%2F0611939%2Castro-ph%2F0611777%2Castro-ph%2F0611590%2Castro-ph%2F0611684%2Castro-ph%2F0611695%2Castro-ph%2F0611892%2Castro-ph%2F0611884%2Castro-ph%2F0611796%2Castro-ph%2F0611717%2Castro-ph%2F0611661%2Castro-ph%2F0611359%2Castro-ph%2F0611629%2Castro-ph%2F0611475%2Castro-ph%2F0611468%2Castro-ph%2F0611408%2Castro-ph%2F0611141%2Castro-ph%2F0611705%2Castro-ph%2F0611212%2Castro-ph%2F0611305%2Castro-ph%2F0611944%2Castro-ph%2F0611250%2Castro-ph%2F0611164%2Castro-ph%2F0611764%2Castro-ph%2F0611201%2Castro-ph%2F0611926%2Castro-ph%2F0611058%2Castro-ph%2F0611905%2Castro-ph%2F0611732%2Castro-ph%2F0611025%2Castro-ph%2F0611531%2Castro-ph%2F0611418%2Castro-ph%2F0611743%2Castro-ph%2F0611625%2Castro-ph%2F0611176%2Castro-ph%2F0611901%2Castro-ph%2F0611126%2Castro-ph%2F0611794%2Castro-ph%2F0611088%2Castro-ph%2F0611138%2Castro-ph%2F0611069%2Castro-ph%2F0611712%2Castro-ph%2F0611155%2Castro-ph%2F0611842%2Castro-ph%2F0611287%2Castro-ph%2F0611948%2Castro-ph%2F0611911%2Castro-ph%2F0611502%2Castro-ph%2F0611592%2Castro-ph%2F0611196%2Castro-ph%2F0611854%2Castro-ph%2F0611260%2Castro-ph%2F0611489%2Castro-ph%2F0611373%2Castro-ph%2F0611588%2Castro-ph%2F0611807%2Castro-ph%2F0611482%2Castro-ph%2F0611213%2Castro-ph%2F0611106%2Castro-ph%2F0611766%2Castro-ph%2F0611005%2Castro-ph%2F0611199%2Castro-ph%2F0611636%2Castro-ph%2F0611557%2Castro-ph%2F0611519%2Castro-ph%2F0611338%2Castro-ph%2F0611821%2Castro-ph%2F0611726%2Castro-ph%2F0611601%2Castro-ph%2F0611745%2Castro-ph%2F0611506%2Castro-ph%2F0611310%2Castro-ph%2F0611185%2Castro-ph%2F0611550%2Castro-ph%2F0611347%2Castro-ph%2F0611553%2Castro-ph%2F0611689%2Castro-ph%2F0611825%2Castro-ph%2F0611599%2Castro-ph%2F0611665%2Castro-ph%2F0611101%2Castro-ph%2F0611925%2Castro-ph%2F0611091%2Castro-ph%2F0611330%2Castro-ph%2F0611750%2Castro-ph%2F0611549%2Castro-ph%2F0611317%2Castro-ph%2F0611142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We explore the observational appearance of the photosphere of an\nultrarelativistic flow with internal dissipation of energy as predicted by the\nmagnetic reconnection model. Previous study of the radiative transfer in the\nphotospheric region has shown that gradual dissipation of energy results in a\nhot photosphere. There, inverse Compton scattering of the thermal radiation\nadvected with the flow leads to powerful photospheric emission with spectral\nproperties close to those of the observed prompt GRB emission. Here, we build\non that study by calculating the spectra for a large range of the\ncharacteristics of the flow. An accurate fitting formula is given that provides\nthe photospheric spectral energy distribution in the ~10 keV to ~10 MeV energy\nrange (in the central engine frame) as a function of the basic physical\nparameters of the flow. It facilitates the direct comparison of the model\npredictions with observations, including the variability properties of the\nlightcurves. We verify that the model naturally accounts for the observed\nclustering in peak energies of the E*f(E) spectrum. In this model, the Amati\nrelation indicates a tendency for the most luminous bursts to have more energy\nper baryon. If this tendency also holds for individual GRB pulses, the model\npredicts the observed narrowing of the width of pulses with increasing photon\nenergy."}, "authors": ["Dimitrios Giannios", "Henk C. Spruit"], "author_detail": {"name": "Henk C. Spruit"}, "author": "Henk C. Spruit", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20066739", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0611385v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0611385v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 6 figures, minor changes, A&A, in press", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0611385v2", "affiliation": "Max Planck Institute for Astrophysics", "arxiv_url": "http://arxiv.org/abs/astro-ph/0611385v2", "journal_reference": "Astron.Astrophys.469:1-9,2007", "doi": "10.1051/0004-6361:20066739", "fulltext": "Astronomy & Astrophysics manuscript no. AA6739\n(DOI: will be inserted by hand later)\n\nOctober 3, 2018\n\nSpectral and timing properties of a dissipative GRB photosphere\nDimitrios Giannios and Henk C. Spruit\n\narXiv:astro-ph/0611385v2 24 Apr 2007\n\nMax Planck Institute for Astrophysics, Box 1317, D-85741 Garching, Germany\nReceived / Accepted\nAbstract. We explore the observational appearance of the photosphere of an ultrarelativistic flow with internal dissipation of\n\nenergy as predicted by the magnetic reconnection model. Previous study of the radiative transfer in the photospheric r egion\nhas shown that gradual dissipation of energy results in a hot photosphere. There, inverse Compton scattering of the thermal\nradiation advected with the flow leads to powerful photospheric emission with spectral properties close to those of the observed\nprompt GRB emission. Here, we build on that study by calculating the spectra for a large range of the characteristics of the\nflow. An accurate fitting formula is given that provides the photospheric spectral energy distribution in the ∼ 10 keV to ∼10\nMeV energy range (in the central engine frame) as a function of the basic physical parameters of the flow. It facilitates the\ndirect comparison of the model predictions with observations, including the variability properties of the lightcurves. We verify\nthat the model naturally accounts for the observed clustering in peak energies of the E * f (E) spectrum. In this model, the\nAmati relation indicates a tendency for the most luminous bursts to have more energy per baryon. If this tendency also holds\nfor individual GRB pulses, the model predicts the observed narrowing of the width of pulses with increasing photon energy.\nKey words: Gamma rays: bursts – radiation mechanisms: general – methods: statistical\n\n1. Introduction\nDespite the wealth of observational data obtained over the\nlast few decades, the radiative mechanisms responsible for the\nprompt emission of a γ-ray burst (hereafter GRB) remain elusive. From observations of thousands of bursts it has been\nshown that the GRB prompt spectral energy distribution is\ncharacterized by a peak (in E * f (E) representation) that clusters\nin the sub-MeV energy range. The peak smoothly connects to\nlow and high frequency power-laws (Band et al. 1993; Preece\net al. 1998; Kaneko et al. 2006). Theoretical arguments make\nuse of the fact that a large fraction of the observed radiation is\nat photon energies above the pair creation threshold. Together\nwith the huge luminosities involved in the GRB phenomenon,\nthis implies that the emitting material is ultrarelativistic with\nbulk Lorentz factor Γ >\n∼ 100 (for a review of these arguments\nsee, for example, Piran 2005). Models for the prompt GRB\nphase thus have to account for both the acceleration of the flow\nand its observed spectral properties.\nFor a flow to be accelerated to high bulk Lorentz factors,\nit must start with high energy-to-rest-mass ratio. Depending\non whether the energy is in thermal or magnetic form, one\nhas a fireball (Paczynski 1986; Goodman 1986) or a Poyntingflux dominated flow (Thompson 1994; Mészáros & Rees 1997;\nSpruit et al. 2001; Drenkhahn & Spruit 2002; Lyutikov &\nBlandford 2003; Uzdensky & MacFadyen 2006). In the fireball\nmodel, the flow goes through an initial phase of rapid acceleration where Γ ∼ r until most of the internal energy has been\nSend offprint requests to: giannios@mpa-garching.mpg.de\n\nused to accelerate the flow (unless the baryon loading is very\nlow and radiation decouples from matter before the acceleration phase is over). Further out, internal shocks that are a result\nof fast shells catching up with slower ones (Rees & Mészáros\n1994; Sari & Piran 1997) can dissipate part of the kinetic energy and power the prompt emission. In magnetic models for\nGRBs, the flow acceleration is more gradual (e.g. Drenkhahn\n& Spruit 2002).\nDissipation of magnetic energy through magnetic reconnection (Drenkhahn 2002) or current driven instabilities\n(Lyutikov & Blandford 2003; Giannios & Spruit 2006) can directly power not only the prompt emission, but also the conversion of Poynting flux to kinetic energy of outflow. In fact,\nat high Lorentz factors magnetic dissipation is the only efficient mechanism for the conversion of Poynting flux to kinetic\nenergy (Drenkhahn 2002, Drenkhahn & Spruit 2002, Spruit &\nDrenkhahn 2004; for a disagreeing view see Vlahakis & Königl\n2003). This is discussed again in section 2.1.1.\nUnlike the internal shock model, where dissipation of flow\nenergy is due to the variability of the central engine, variability\nand dissipation are, a priori, unrelated in magnetic dissipation\nmodels; dissipation takes place even in a steady magnetic outflow.\nIf the dissipated energy leads to fast particles, then the synchrotron or synchrotron-self-Compton mechanism appears as a\nnatural one for the prompt emission. On the other hand, the\nlarge number of bursts with low energy slopes steeper than\nthose that the synchrotron model can explain (e.g. Crider et\nal. 1997; Frontera et al. 2000; Girlanda et al. 2003), have trig-\n\n\f2\n\nGiannios and Spruit: Properties of a dissipative GRB photosphere\n\ngered alternative suggestions for the origin of the GRB emission. These include saturated Comptonization (Liang 1997)\nand Comptonization by thermal electrons (Ghisellini & Celotti\n1999).\nAnother possibility for the origin of the prompt emission\nis the photospheric emission of the flow (Mészáros & Rees\n2000; Ryde 2004; Thompson et al. 2006). A common feature of\nfireball and magnetic models is that they are characterized by\n(weaker or stronger) emission from the region where the flow\nbecomes optically thin to Thomson scattering. If no energy dissipation takes place in that region, as in the case of fireball models, the emission is expected to be quasi-thermal and a corresponding peak should be recognizable in the spectrum (Daigne\n& Mochkovitch 2002), contrary to observation. On the other\nhand, if there is substantial energy dissipation (through internal shocks, magnetic reconnection or MHD instabilities) close\nto the photospheric region, the emitted spectrum can strongly\ndeviate from a black body (Rees & Mészáros 2000; Pe'er et al.\n2005; Ramirez-Ruiz 2005).\nGiannios (2006, hereafter G06) studied the spectrum of\nthe photospheric emission in the magnetic reconnection model\n(Drenkhahn 2002; Drenkhahn & Spruit 2002). The reconnection model makes definite predictions for the characteristics of\nthe flow and the rate of magnetic energy dissipation at different radii, enabling detailed study of the radiative transfer. This\nstudy showed that while radiation and matter are in approximate thermodynamic equilibrium deep inside the flow, direct\nheating of the electrons through energy dissipation leads to\nan increase of their temperature even at optical depths ∼ 50.\nInverse Compton scattering of the underlying thermal radiation\nleads to a spectrum with a non-thermal appearance, peaking at\n∼ 1 MeV (in the central engine frame) followed by a nearly flat\nhigh energy spectrum (E * f (E) ∼ E 0 ) extending to at least a\nfew hundred MeV.\nHere, we build on that study with a wide parametric exploration of the spectral energy distribution of the photospheric\nemission in this model. We find that the photospheric spectra,\ncomputed from detailed Monte-Carlo simulations, can be accurately modeled by a smoothly broken power law model in\nthe 10-104 keV range. These are then used to derive analytic\nexpressions for the dependence of the spectra on the characteristics of the flow. Since modulations of the characteristics of the\nflow by the central engine result in variable photospheric emission, modeling of the spectral and temporal properties of the\nphotospheric emission offers a unique probe into the operation\nof the central engine.\nWe look at the properties of the distribution of the peak\nenergy of the spectrum. The Amati relation is reproduced provided that the more luminous flows are characterized by more\nenergy per baryon (i.e. less baryon loading). If the same baryon\nloading-luminosity corelation holds during the temporal evolution of GRBs, the model predicts the observed energy dependence of the width of the pulses of the GRB lightcurves.\nIn the next section, we review the main features of the magnetic reconnection model and the treatment of the radiative\ntransfer in the photospheric region. The analytical modeling of\nthe photospheric spectra is given in Sect. 3. Inferences concern-\n\ning the properties of the central engine are given in Section 4\nand we summarize our findings in the Discussion Section.\n\n2. Dissipative GRB photosphere\nThe GRB flow, whether magnetized or not, has a characteristic radius at which it becomes transparent. This is the radius\nwhere radiation and particles decouple and the photospheric\nemission originates. If no energy is dissipated close to the photosphere, the photospheric emission is expected to be quasithermal. On the other hand, significant dissipation of energy\ncan strongly modify the photospheric spectrum. The physical\nsource of energy dissipation can be the collision of shells of\nvarying bulk Lorentz factors resulting in internal shocks in the\nflow (if, for some reason, the shells collide close to the photosphere). Dissipation near the photosphere is generic in the\nmagnetic reconnection model, where the dissipation of magnetic energy is gradual and takes place over several decades of\nradius, typically including the photosphere.\nUnlike the internal shock model, where dissipation of flow\nenergy is due to the variability of the central engine, variability\nand dissipation are, a priori, unrelated in the magnetic reconnection model; dissipation takes place even in a steady magnetic outflow. For typical inferred GRB parameters, the dissipation in a magnetic reconnection model takes place around the\nphotosphere of the flow (Drenkhahn 2002). The time for the\nflow to reach the photosphere as observed by an on-axis external observer is so short that the flow can be treated as approximately steady for all but the shortest observed time scales. This\ngreatly simplifies the interpretation of light curves and variations in the energy spectra. Of course, this applies only if it can\nbe demonstrated that a substantial fraction of the emission in\nthe 10-1000 keV range is in fact produced around the photosphere of the flow. The spectra obtained in G06 are promising\nin this respect.\nThe reconnection model makes specific predictions for the\nrate of energy dissipated as a function of radius; this makes\nit possible to study the radiative transfer in the flow in detail\n(G06). Analytic estimates demonstrate that the flow develops\na hot photosphere where inverse Comptonization results in upscattering of the photons advected with the flow. The numerical\n(Monte Carlo) calculations in G06 show that the spectra have\nmany properties of the observed prompt GRB emission, for a\nwide range of baryon loading and luminosities of the flow.\nIn the following subsections, we review the basic characteristics of the reconnection model and of the radiative transfer\nin the flow.\n\n2.1. The reconnection model\nAn important physical quantity in the reconnection model is the\nratio σ0 of the Poynting flux to kinetic energy flux at the start of\nthe flow, the Alfvén point r0 . This is a quantity equivalent to the\n'baryon loading' parameter in fireball models. It determines the\nterminal bulk Lorentz factor of the flow Γ∞ ∼ σ3/2\n0 . The flow\n30\nfor it to be\nmust start Poynting-flux dominated with σ0 >\n∼\n100\nthat are\naccelerated to ultrarelativistic speeds with Γ∞ >\n∼\nrelevant for GRB flows.\n\n\fGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nIn the reconnection model, the magnetic field in the flow\nchanges polarity on a scale λ. If the magnetic field anchored\nin the rotating central engine is nonaxisymmetric (the 'AC\nmodel'), this scale is (in the central engine frame) of the order\nof the light cylinder rl , (λ ≃ r0 ≃ 2πc/Ω = 2πrl ) where Ω is the\nangular frequency of the rotator. This is as in the oblique rotator\nmodel for pulsar winds (Coroniti 1990). The rate of magnetic\nreconnection in the model is parameterized through the velocity vrec with which magnetic fields of opposite direction merge.\nAs in most models of magnetic reconnection, vrec scales with\nthe Alfvén speed, vA , vrec = εvA . A nominal value used for ǫ\nis 0.1. For the flows with σ0 ≫ 1 that are of interest here, the\nenergy density of the magnetic field is larger than the rest mass\nenergy density, hence vA ≈ c, and the reconnection takes place\nwith subrelativistic speeds. For a detailed analysis of relativistic reconnection see Lyubarsky (2005).\n\n2.1.1. Poynting flux conversion\nIf the energy extracted from the central engine is initially in\nthe form of a Poynting flux, acceleration of the flow requires\nefficient conversion of this flux into kinetic energy. The standard mechanism for acceleration of nonrelativistic flows, magnetocentrifugal acceleration, (Blandford & Payne 1982) allows\nconversion of a substantial fraction (some 40%), with the rest\nremaining in the flow as magnetic energy. For relativistic flows,\nthe conversion efficiency for this same mechanism is much\nlower (Michel 1969), so that in the case of a GRB almost all\nenergy would end up in the afterglow rather than as prompt\nemission.\nArbitrarily high effiency of conversion is possible, however,\nif there is a channel by which the magnetic energy carried by\nthe flow can dissipate by internal processes. Such dissipation\nresults is an outward decrease of magnetic pressure which accelerates the flow efficiently (Drenkhahn 2002; for a more detailed physical explanation of this at first sight somewhat counterintuitive process see Spruit & Drenkhahn 2004).\nThe dissipation is gradual and takes place up to the 'saturation radius' rs , the distance where reconnection stops and\nthe flow achieves its terminal Lorentz factor. During the magnetic dissipation process, about half of the Poynting flux directly converts into kinetic flux (leading to acceleration) and\nthe other half into internal (thermal) energy of the flow.\nIf the dissipation takes place under optically thin conditions, the thermal energy can be radiated away quickly. In this\ncase half of the Poynting flux is converted to radiation, the other\nhalf to kinetic energy of the bulk flow. If radiation is inefficient,\non the other hand, the internal energy adds to kinetic energy of\nthe bulk flow, through adiabatic expansion (as in the case of a\npure hydrodynamic fireball).\n\n2.1.2. Properties of the magnetically accelerated flow\nThe reconnection model predicts gradual a acceleration of the\nflow Γ ∼ r1/3 in the regime r0 ≪ r ≪ rs , while no further acceleration takes place beyond the saturation radius. Summarizing\nthe results derived in Drenkhahn (2002), the bulk Lorentz fac-\n\n3\n\ntor of the flow is approximately given by\n!1/3\nr\n1/2\n1/3\nfor r < rs ,\n(εΩ)1/3\n= 148 r11\nΓ = Γ∞\n3 σ0,2 ,\nrs\n(1)\nΓ = Γ∞ =\n\nσ3/2\n0 ,\n\nfor r ≥ rs ,\n\nwhile the saturation radius is\nπcΓ2∞\n;\nrs =\n3εΩ\n\nor\n\nrs,11 = 310\n\nσ30,2\n(εΩ)3\n\n(2)\n\n.\n\nIn the steady spherical flow under consideration the comoving number density can be written as\nn′ =\n\nL\n3\nr2 σ3/2\n0 Γmp c\n\n(3)\n\n,\n\nwhere L is the luminosity per steradian of the GRB model.\n(In this form the expression can be compared with the fireball\nmodel, where the baryon loading parameter η replaces the factor σ3/2\n0 ). With eqs. (1), (3) we have\nn′ =\n\n1.5 * 1017\n\nL52\n\n7/3\nr11\n\n2\n(εΩ)1/3\n3 σ0,2\n\ncm−3\n\nfor r < rs ,\n(4)\n\n2.2 * 1019 L52\nn′ =\n,\n2\nr11\nσ30,2\n\ncm−3\n\nfor r ≥ rs .\n\nThe comoving magnetic field strength B' is given by\nB′ =\n\n\u0012 4πL \u00131/2 1.4 * 108\nL1/2\n52\n=\n1/2\n4/3\ncr2 Γ2\nr11\n(εΩ)1/3\n3 σ0,2\n\nG,\n\nfor r < rs (5)\n\nwith the magnetic field in the central engine frame given by\nB = ΓB′ . [The usual notation A = 10 x A x is used; the 'reference\nvalues' of the model parameters are σ0 = 100, ε = 0.1, Ω =\n104 rad*s−1 , L = 1052 erg*s−1 *sterad−1 .]\n\n2.2. Radiative transfer in the photospheric region\nIn addition to the saturation radius rs , another characteristic radius of the flow is the Thomson photosphere. A photon moving\nradially outward in a flow with Γ ≫ 1 encounters an optical\ndepth dτ = n′ σT dr/2Γ (Abramowicz et al. 1991). Integrating\nfrom r to ∞ the characteristic Thomson optical depth as a function of radius is\nL52\n20\n.\n(6)\nτ = 5/3\n5/2\nr11 (εΩ)2/3\n3 σ0,2\nSetting τ = 1 yields the photospheric radius rph\nrph,11 = 6\n\nL3/5\n52\n3/2\n(εΩ)2/5\n3 σ0,2\n\n.\n\n(7)\n\nIn deriving these expressions, we have assumed that rph < r s .\nAt high baryon loading, the Lorentz factors can become so low\nthat most of the Poynting flux dissipates already inside the photosphere, i.e. rph > r s . With the expression for the number density valid beyond the saturation radius from (4), a similar calculation gives the radius of the photosphere in this case.\n\n\fGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nDue to the dominance of scattering, the details of radiative transfer become important already at fairly large optical\ndepth in the flow. Equilibrium between radiation and matter\nholds only at Thomson depths greater than about 50. At optical\n<\ndepths 0.1 <\n∼ τ ∼ 50 the electron distribution stays thermalized,\nbut is out of equilibrium with the photon field. Compton scattering of the photons needs to be treated in detail in this region.\nThis has been done in G06, using both analytical and numerical\ntools. One of the main findings of this study is that the nature\nof the photospheric spectrum is determined by the location of\nthe photosphere relative to the saturation radius. If rph ≫ r s , all\nthe energy dissipation takes place in optically thick conditions,\nthe radiation is efficiently thermalized and suffers substantial\nadiabatic losses. On the other hand, if r s >\n∼ rph , energy dissipation at moderate and low optical depths leads to a photospheric\nemission that has a highly non-thermal appearance.\nThere is thus a characteristic spectral transition of the photospheric emission depending on the relative locations of the\nphotospheric and saturation radii. In terms of the physical properties of the flow, it takes places at the critical value of the\nbaryon loading σ0,cr , for which rph = rs . For σ > σ0,cr , rph < rs .\nUsing eqs. (7) and (2) one finds\n\u00112/15\n\u0010\n.\n(8)\nσ0,cr = 42 L52 (εΩ)3\nAt radii much shorter than the photospheric radius, the released energy is efficiently thermalized and shared between\nparticles and radiation. In this region, the comoving temperature T th of the flow is calculated, under the assumption of complete thermalization, by integrating the energy released at different radii in the flow and taking into account adiabatic cooling. This leads to (Giannios & Spruit 2005)\nT th =\n\n0.7\n\nL1/4\n52\n\n1/2\n7/12\nr11\n(εΩ)1/12\n3 σ0,2\n\nkeV.\n\n(9)\n\nComplete thermalization of the dissipated energy is\nachieved up to a radius defined as the equilibrium radius\nreq,11 = 0.6\n\n5/9\nL52\n4/3\nfe4/9 (εΩ)1/3\n3 σ0,2\n\n,\n\n(10)\n\nwhere fe stands for the fraction of the dissipated energy that\nheats the electrons (rather than the ions) and is assumed to\nbe of order of unity. As a reference value we adopt fe = 0.5.\nNote that the equilibrium radius lies at a distance one order of\nmagnitude below the Thomson photosphere. At radii r > req ,\ndirect electron heating through magnetic dissipation leads to\nelectrons with characteristic energy higher than that of the radiation field and upscattering of the photons takes place in this\nregion. Because of the rather steep increase of the electron temperature with radius above req , this upscattering becomes efficient especially around the location of the photosphere, where\nthe comoving electron temperature is of the order a few tens\nkeV. For these temperatures and optical depths the result is a\nhard power law tail in the spectrum, characteristic of unsaturated Comptonization.\nFor the detailed calculation of the emergent spectrum and\nthe electron temperature above the equilibrium radius we use\n\n10000\n1000\n\nE f(E) (arbitrary units)\n\n4\n\n100\n10\n1\n\nσ0,2=0.3\n\n0.1\n\nσ0,2=0.4\n\n0.01\n\nσ0,2=0.7\n\nσ0,2=0.5\nσ0,2=3\n\nσ0,2=1, L52=0.01\n\n0.001\n0.0001\n\nσ0,2=1, (εΩ)3=0.01\n\n1\n\n10\n\n100\n\n1000\n\n10000\n\n1e+05\n\n1e+06\n\nE (keV)\n\nFig. 1. Photospheric spectrum of the reconnection model for\nGRB flows (photon energies in the central engine frame). For\nmoderate and high initial Poynting flux ratio σ0 the spectra\npeak around 1 MeV. The flat high energy tail is the result of\ninverse Compton scattering of photons off hot electrons close\nto the photospheric radius. For low σ0 dissipation stops below\nthe photosphere, and the resulting spectrum is quasi-thermal.\n\na Monte Carlo method as described in G06. It treats Compton\nscattering in a medium with density and bulk Lorentz factor\ngiven by eqs. (4) and (1) respectively. The special relativistic\neffects related to both the bulk motion and the scattering crosssection of photons in the flow are taken into account. The inner\nboundary of the computational domain is the equilibrium radius defined by eq. (10). There, a black body photon spectrum\nis injected with temperature given by eq. (9). The outer boundary rout is, rather more arbitrarily taken at a radius where the\noptical depth becomes small (the value τ = 0.1 is used for the\nrest of the Section, but see Section (3.1) where the dependence\nof the emitted spectrum on the choice of rout is investigated).\nThe electron temperature as a function of distance in the\nflow is determined from the balance of radiative cooling by\nComptonization and heating of the electrons by magnetic dissipation. The numerical results verify the analytical expectation\nthat the electron temperature increases rapidly in the photospheric region and that significant Comptonization takes place\nthere (G06).\nA selection of characteristic emergent spectra from the calculations are presented in Fig. 1 in E * f (E) representation for\ndifferent values of the parameters of the model. The spectra are\nplotted in the central engine frame with arbitrary normalization\n(the energetics are discussed in the next Section). The peak of\nthe spectrum is close to 1 MeV for a large region of the parameter space which is relevant for GRB flows. The dependence of\nthe peak energy on the parameters of the model is very weak.\nThis can be understood from the fact that the peak energy is related to the peak of the thermal emission advected with the flow\nat the equilibrium radius which, in the central engine frame, is\n1/3 1/3\nce\nEp,th ∝ T eq\n∝ Γ(req )T th (req ) ∝ L1/9\n52 (εΩ)3 σ0,2 , where in the\nlast step the expressions (9), (1) and (10) have been used. The\n\n\fGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nwidth of the transition from the low energy spectral slope to\nthe high energy slope. The fitting model has five parameters: an\namplitude A, low and high photon indexes λ1 and λ2 , a break\nenergy Eb and a break scale Λ. The transition in slope is described by a hyperbolic tangent function.\nThe SBPL model fits the data (in our case the spectrum)\nwith the expression1 (for the derivation see for example Ryde\n1999)\n\nE f(E) (arbitrary units)\n\n1000\n\n100\n\n10\nσ0,2=0.3\nσ0,2=0.4\nσ0,2=0.5\nσ0,2=0.7\nσ0,2=3\n\n1\n\n0.1\n10\n\n5\n\n100\n\n1000\n\nf (E) = A\n\n1\n\u0012 E \u0013 λ1 +λ22 +2 \u0012 eq + e−q \u0013 λ2 −λ\n2 Λ\n,\n100\neqpiv + e−qpiv\n\n(11)\n\nwhere\n10000\n\nE (keV)\n\nFig. 2. Smoothly-broken power law fits (dashed) to the spectra\nof Fig. 1 (solid). Photon energies in the central engine frame.\nThe 5-parameter SBPL formula (eq. (11)) fits the numerically\ncalculated spectra very accurately in the 10 keV to 10 MeV\nenergy range.\ndetailed numerical investigation leads to very similar dependence of Ep on the model parameters (see eq. 15).\nThe inverse Compton scattering that takes place above the\nequilibrium radius leads to a moderate increase of the energy\nof the peak and, most important, to a power-law high energy\nemission with photon number index ∼ −2.5 that extends up to\na few hundred MeV. This high energy part of the spectrum is\nthe result of unsaturated Comptonization taking in the τ <\n∼1\nσ\n.\nregion and appears for flows with σ0 >\n∼ 0,cr\nIn the lower σ0 cases, the emergent spectrum has much\nweaker emission above its peak. In these cases the magnetic\ndissipation stops below the Thomson photosphere and there\nis only weak Compton upscattering taking place in the photospheric region. Such quasi-thermal emission has been observed\nin a fraction of GRBs (Ryde 2004; 2005) suggesting these may\nbe bursts of low σ0 (high baryon loading).\n\n3. Analytical fits and parametric study of the\nspectra\nThe spectra obtained with our Monte-Carlo radiative transfer\ncalculations have systematic dependencies on the parameters\nof the model (initial Poynting flux to kinetic flux ratio σ0 , luminosity per steradian L and reconnection rate which appears\nin the combination ǫΩ). In this section we condense these dependences into a more practically useful form by developing\nfitting formulas.\nAfter various attempts to find analytical functions that\nfit the numerically computed spectra, it turned out that the\nsmoothly connected power law (hereafter SBPL model Preece\net al. 1994; Ryde 1999; Kaneko et al. 2006) provides a very\ngood description in the 10 keV to 10 MeV energy range, which\nis the most relevant for observations of the prompt emission\nof GRBs. The SBPL is a generalization of the sharply broken\npower law model by the addition of a parameter governing the\n\nq=\n\nln(E/Eb )\n,\nΛ\n\nqpiv =\n\nln(100/Eb)\n.\nΛ\n\n(12)\n\nThe amplitude A is in photons s−1 and all energies in keV.\nThe break energy Eb is related to the peak energy Ep of the\ndistribution E f (E) by\n\u0014 λ + 2 \u0015Λ/2\n1\nEp = Eb −\nλ2 + 2\n\n(13)\n\n(e.g., Kaneko et al. 2006)2.\nSince this fitting model does not have a high energy exponential break, it cannot describe the spectra above ∼ 100 MeV.\nThe SBPL fits also show small systematic deviations for energies below ∼several keV. Thus, we limit our fits to the, nevertheless broad, 10 KeV - 10 MeV energy range. We have used\nthe SBPL model to fit a large number of theoretical spectra for\nmodels of varying luminosity L, baryon loading σ0 and reconnection rate parameterized by εΩ.\nA few, rather representative, examples of such fits are\nshown in Fig. 2. The fits (shown as dashed curves) lie very\nclose to the numerical results with the exception of the lowest\nend of the energy range considered. Overall, SBPL fits are a\nvery good way to summarize the photospheric spectrum predicted by the dissipation model.\nWith these fits, the low and high energy slopes λ1 and λ2\nand the peak energy Ep of the spectrum can be presented as\nfunctions of the parameters of L, σ0 and εΩ of the model.\nFig. 3 shows the ratio of the photospheric emission to total\nflow luminosity, i.e. the (photospheric) radiative efficiency of\nthe model and Fig. 4 the peak energy Ep of the spectrum. For\nσ0 around the critical value σ0,cr , the radiative efficiency peaks\nat ≈ 0.35 fe, independent of the luminosity of the flow L and the\nreconnection rate parameter εΩ . For σ0 < σ0,cr , the magnetic\ndissipation stops below the photosphere and radiation suffers\nsubstantial adiabatic cooling before it decouples from matter;\nthis results in a steep increase of the radiative efficiency and of\nthe peak energy as functions of σ0 . Changes in L and εΩ lead\nto characteristic displacements of the curves in the Lph /L − σ0\nand Ep − σ0 planes (see Figs. 3 and 4).\n1\n\nWe choose a representation of the SBPL model where only the\nnatural logarithm appears. This is achieved by suitably renormalizing\nthe break scale with respect to that used by Ryde (1999).\n2\nThe very existence of a peak in the spectrum demands that λ1 +2 >\n0 and λ2 + 2 < 0, which almost always holds here.\n\n\f6\n\nGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nrameter in the flow, the radiative efficiency has the following\ndependence on the model parameters (see Sect. A.2)\nfe=0.5, L52=(εΩ)3=1\n\nfe=0.5, L52=0.1, (εΩ)3=1\n\nfe=0.5, L52=1, (εΩ)3=0.01\nfe=1, L52=(εΩ)3=1\n\n0.1\n\n0.2 0.2\nLph /L ≈ 0.07σ−1.5\n0,2 (εΩ)3 L52 ,\n\nL ph/L\n10\n\nσ0\n\n100\n\nFig. 3. The (photospheric) radiative efficiency of the flow (ratio\nof photospheric luminosity to flow luminosity), as a function\nof the initial Poynting flux to kinetic energy flux ratio σ0 . At\nlow σ0 , most of the dissipation happens at great optical depth,\nand the photospheric radiation field is reduced by adiabatic expansion. At high σ0 most dissipation takes places beyond the\nphotosphere. The solid red line shows the effect of increasing\nthe electron fraction of the dissipated energy from 50 to 100%.\nChanges in luminosity L and εΩ are equivalent to shifts along\nthe σ-axis. The curves are fits to smoothly broken power laws\n(best fit values in the appendix A.2).\n\nL52=1, (εΩ)3=1\nL52=0.1, (εΩ)3=1\nL52=1, (εΩ)3=0.01\n\nEp (keV)\n\n1000\n\n100\n\n10\n\nσ0\n\n100\n\nFig. 4. Dependence of peak energy (peak of the photospheric\nE * f (E) spectrum) on baryon loading, flow luminosity and reconnection speed. Above the characteristic Poynting flux parameter σ0,cr (Eq. 7), Ep depends only weakly on baryon loading. At high baryon loading (low σ0 ), the spectrum becomes\nquasithermal (cf. Fig. 1), peaking at a low energy. Curves show\nthe smoothly broken power law fits (cf. appendix A.2).\n\nAnalytic fits for the radiative efficiency and peak energy as\nfunctions of the characteristics of the flow are given in the appendix. These expressions reduce to simple power laws when\nσ>\n∼ σcr . Thus, for a sufficiantly high initial magnetization pa-\n\n(14)\n\nSimilarly, for σ0 > σ0,cr the expression for the peak energy\nsimplifies to (see Sect. A.3)\n0.33 0.3\nEp ≈ 1200L0.11\n52 (εΩ)3 σ0,2\n\n0.01\n\nσ0 > σ0,cr .\n\nkeV,\n\nσ0 > σ0,cr .\n\n(15)\n\nThe high-energy photon index λ2 is almost constant at\n∼ −2.5 for σ0 >\n∼ σ0,cr and decreases rapidly for smaller σ0 (because there is little or no dissipation close to the photosphere\nfor low values of σ0 ). The expression for λ2 as a function of\nthe characteristics of the flow is given in the appendix A.4. The\nlow-energy photon index λ1 shows very small variations and\nremains approximately ∼ 0 in most the parameter space investigated. For simplicity, we keep λ1 = 0 independently of the\ncharacteristics of the flow. On the other hand, significant softening of λ1 appears when the spectral peak approaches the lowest energy range over which the spectral fits are performed (i.e.\nat 10 keV). This may lead to deviations of the fitting formulas and the actual predictions of the photospheric model in the\n∼ 10 keV range (in the frame of the central engine). The break\nscale Λ is practically constant ∼ 1.6 for high σ0 and makes a\ntransition to the value ∼ 2.8 for σ0 < σ0,cr . This transition can\nbe modeled by a hyperbolic tangent (see appendix A.2).\n\n3.1. The non-photospheric emission\nThe spectra above were obtained with an outer boundary set at\na scattering optical depth of 0.1. In the optically thin part of the\nflow (τ < 0.1) the electron temperature will continue to rise if\nsignificant dissipation takes place there, and this will contribute\nto the Comptonization. We have not included this contribution\nso far because the assumption of a thermalized electron distribution becomes questionable at τ <\n∼ 0.1, and a nonthermal distribution will change the Comptonization process. This makes the\nemission in these regions dependent on poorly known details of\nthe magnetic dissipation process.\nNotwithstanding this, it is possible to get an idea concerning at which energy band the optically thin emission may be\nexpected to take place by extending the outer boundary of\nthe Monte Carlo calculation to larger radii (or equivalently to\nsmaller optical depths in the flow). In this excercise we assume\nthat the electrons still follow a thermal distribution in this region. In Fig. (5) the emitted spectrum for the reference values\nof the parameters of the model is shown for various values of\nthe optical depth τout at the outer boundary of the numerical\ncalculation. The spectrum below the peak energy remains essentially the same. The higher energy emission is significantly\nenhanced as a result of scattering in the very hot, optically thin\npart of the flow. The high-energy spectral slope hardens, approaching λ2 ∼ −2, and there is substantial emission in the\n∼GeV energy range.\nThe vertical dashed lines show the energy range used for\nthe fitting formulas presented in the previous section. The optically thin emission affects the high-energy spectral slope λ2\nsomewhat, which now lies in the ∼ −2 to −2.5 range. The optically thin emission increases the luminosity in the 10-1000keV\n\n\fGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nexcludes the burst luminosity. Since the central engine is most\nlikely a stellar mass compact object, the rotation rate, Ω, must\nbe of the order 103 − 104 rad s−1 . The most uncertain parameter\nof the magnetic dissipation model is actually the reconnection\nspeed parameter ε, for which we have so far assumed a value\n∼ 0.1 (Drenkhahn 2002). Ω = 104 rad s−1 is perhaps on the\nhigh side for the torus in a collapsar, and ε = 0.1 possibly too\noptimistic. A value (εΩ) ∼ 100 rad s−1 instead of 103 , which\nwould bring the predicted value of Ep into agreement with observation, can easily be accommodated within these uncertainties.\nThis indicates that magnetic dissipation timescale is one order of magnitude longer than that assumed by the reference\nvalues of the parameters. In the following we adopt (εΩ) =\n102 (εΩ)2 as a reference value for the parameterization of the\ndissipation timescale.\n\n10000\n1000\n\nE f(E) (arbitrary units)\n\n100\n10\n1\n0.1\n\nτout=0.1\nτout=0.03\nτout=0.01\nτout=0.003\n\n0.01\n\n0.001\n0.0001\n1e-05\n0.1\n\n1\n\n10\n\n100\n\n1000\n\n10000\n\n1e+05\n\n1e+06\n\n1e+07\n\nE (keV)\n\nFig. 5. Modification of the spectrum when an estimate of the\nemission in the optically thin part of the flow is included.\n[Electron distribution is assumed to remain thermal at low optical depths.] Parameter is the optical depth at the outer boundary\nof the calculation (photon energies in the central engine frame).\nDashed lines mark the range used for the fitting formulas.\nrange only moderately, but can produce a significant peak in\nthe GeV range.\n\n4. Interpretation of the observations\nIn the following we use a first comparison with observations to\nmake inferences about the properties of GRB outflows in the\nmagnetic dissipation model.\n\n4.1. The value of Ep\nThe observed spectral peak of the prompt emission spectrum of\nGRBs has a narrow distribution peaking at ∼250 keV (Band et\nal. 1993; Kaneko et al. 2006); by far the largest amount of data\nemanates from BATSE. To compare this distribution with the\nprediction of the photospheric model (15) the redshift distribution of GRBs has to be taken into account. This distribution is\nnot well known for the BATSE bursts, but various estimates indicate that an average value of z ∼ 1.5 − 2 is reasonable. For a\ntypical burst at this redshift the model predicts that (cf. eq. (15))\nEpobs =\n\nEp\n0.33 0.3\n≃ 450L0.11\n52 (εΩ)3 σ0,2\n1+z\n\nkeV.\n\n7\n\n(16)\n\nThe dependence on the characteristics of the flow is weak;\nthe model thus predicts a narrow distribution of the peak energy of bursts, in agreement with observation. For the reference\nvalues of the parameters used in eq. (16), the peak energy predicted by the model is at 450 keV, a factor of ∼ 2 above the\nvalue for BATSE bursts. Though this is not a large factor, the\nweak dependence on model parameters implies a significant\ndifference in one or more of them compared with the reference\nvalue. A low value for σ0 ≪ 100 is not attractive, since then the\nflow becomes too slow to explain the typical GRB. The very\nweak dependence of the peak energy on the luminosity also\n\n4.2. The Amati relation\nThere are indications in the literature that the peak energy Ep\nof a burst correlates with the isotropic equivalent energy: Ep ∝\n0.5\nEiso\n(Amati et al. 2002; Amati 2006), although this correlation\nis probably not universal (Nakar& Piran 2005; Band & Preece\n2005). The isotropic equivalent energy of the prompt emission\nis Eiso ∼ Lph tGRB , where tGRB is the duration of the burst. For\nan estimate of the energy of the prompt emission, the relevant\nluminosity is that of the photosphere Lph and not that of the\nflow L.\nUsing the expressions (15) and (14) one can find the dependence on the parameters of the flow of the ratio\n1/2\n0.5\nEiso\nL0.5 tGRB\n∝\n.\nEp\n(εΩ)0.23σ1.1\n0\n\n(17)\n\nAccording to the Amati relation, this ratio stays approximately\nconstant over a wide range of Eiso . Since the dispersion in the\n1/2\nfor long GRBs is rather small\ndistribution of durations of tGRB\n1/2\n∼ 10 , it is unlikely that a dependence in a systematic way of\ntGRB with another parameter (say the luminosity) is responsible for keeping the ratio (17) constant. On the other hand, the\nratio is approximately constant for σ0 ∝ L∼0.4−0.5 in different\nbursts3 . The Amati relation, therefore, indicates that there is a\ncorelation of baryon loading and luminosity, in the sense that\nthe most luminous GRB flows have more energy per baryon.\nWe see in the next Section that if the same baryon loadingluminosity corelation holds during the evolution of individual\nGRBs, the model predicts the observed energy dependence of\nthe width of pulses in the GRB lightcurves.\n\n4.3. GRB variability and spectral evolution\nUp this point, we have dealt with a steady flow that is characterized by fixed luminosity and baryon loading. This approach\ncan, to some extent, describe the rough, time average, properties of a GRB. On the other hand, the GRB lightcurves are\n3\nAssuming that (εΩ) does not change much from burst to burst; if\nit varies in a systematic way with, say, the luminosity, the scaling of\nσ0 with L can be somewhat different.\n\n\fGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nhighly variable and are composed by a sequence of pulses believed to be the \"building blocks\" of their lightcurves (e.g.\nFenimore et al. 1995). The question that rises as to where\nthe variability comes from in the photospheric model for the\nprompt emission and under what conditions a steady state\nmodel such as the magnetic reconnection one can describe a\nvariable flow.\nAn ultrarelativistic flow that varies on a timescale δt can be\nstill described by a steady state model as long as δt > r/Γ2 c.\nWhen the last condition holds, the leading and trailing parts of\na piece of the flow with width δr ≃ cδt have not come into\ncausal contact. As long as this is the case, different parts of\nthe flow behave as part of a steady wind. A robust proof of\nthis statement can be found in Piran et al. (1993) for fireballs\nand Vlahakis & Königl (2003) for MHD flows. The relevant\nradius of interest in this study is the photospheric radius. As\nfar as the photospheric emission is concerned, the steady state\napproximation is valid for a flow which varies on timescales\nL1/5\nrph\n52\n−3\n≃ 2 * 10\nδt > 2\nΓ (rph )c\n(εΩ)4/5 σ3/2\n2\n\ns,\n\n(18)\n\n0,2\n\nwhere eqs. (7) and (1) are used in the last step. The flow can\ntreated as approximately steady for all but the shortest observed\n(sub-millisecond) timescales.\n\n4.3.1. Central engine: the stronger the cleaner\n\n1\nband1 (25-55 keV)\nband2 (55-115 keV)\nband3 (115-320 keV)\nband4 (320-2000 keV)\n\n0.8\n\nN(t)/Nmax\n\n8\n\n0.6\n0.4\n0.2\n0\n-1\n\n0\n\n1\n\n2\n\nt (s)\n\nFig. 6. Narrowing of pulse width with photon energy, as predicted by the model for individual subpulses of the burst. The\nassumption is that the relation between luminosity and baryon\nloading deduced from the Amati relation, σ0 ∝ L0.4 , holds also\nwithin a burst.\nphotospheric model in different energy bands. To reproduce the\ncharacteristic pulse shape, we consider time dependence of the\nluminosity of the flow of the form (cf. Norris et al. 1996)\nL(t) = Lmax e−|t/tr | ,\n\nt<0\n(19)\n\nVariability and dissipation are, a priori, unrelated in the magnetic reconnection model in which dissipation takes place, even\nin a steady magnetic outflow. On the other hand, the flow does\nevidently evolve during a GRB. In the context of the present\nmodel, the observed variability reflects changes in the luminosity (and possibly the initial magnetization parameter or even\nthe reconnection rate εΩ) during the burst. Since the flow up to\nthe photosphere can be treated as quasi-stationary for all but the\nshortest time scales observed in a burst, the variation of spectral\nproperties during a burst directly reflects variations in the central engine. This is in contrast to models in which the prompt\nradiation is produced at much larger distances from the source,\nsuch as external shock models. It is also in contrast with the\ninternal shock model, since the internal evolution of the flow\nbetween the source and the level where radiation is emitted is\na key ingredient in this model. Deducing properties of the central engine from observed burst properties is thus a much more\ndirect prospect in the magnetic dissipation model.\nAs a first application we consider here the width of subpulses in a burst. The observations show this width to be a decreasing function of photon energy (e.g. Fenimore et al. 1995).\nGRBs with complex light curves (composed of many subpulses) follow the same Amati relation as simple ones (with\none or a few pulses). In the above, we have shown how this\nrelation implies a dependence of the baryon loading of the\nburst on its luminosity. We now make the logical extrapolation of assuming that this same relation also holds for the timedependent flow during a burst. Varying the luminosity of the\nflow with time in such a way that it mimics the typical pulse\nprofile, one can simulate the pulse appearance predicted by the\n\nL(t) = Lmax e\n\n−t/td\n\n,\n\nt>0\n\nwhere tr = 0.2/(1 + z) s and td = 0.5/(1 + z) s are the rise\nand decay timescales of the lightcurve (in the central engine\nframe) respectively and Lmax = 1052 erg s−1 sterad−1 . We also\nassume that the baryon loading tracks the luminosity with the\nexpression σ0,2 = L0.4\n52 (indicated by the Amati relation) and set\nεΩ = 100 rad s−1 . The redshift of the burst, needed to correct\nfor photon reshifting and cosmological time dilation, is taken\nto be z = 2.\nHaving specified the parameteres of the flow as functions of\ntime, one can calculate the lightcurve (in the observer's frame)\nof the photopsheric emission at different energy bands predicted by the photospheric model using eq. (11) and the expressions in the appendix. In fig. 6, the predicted lightcurves in the\nBATSE energy bands are plotted. The lightcurves of the harder\nenergy bands are narrower than those of the softer. The width\nin the 320-2000 keV band being approximately half of that of\nthe 25-55 keV band close to what is observed. The energy dependence of the lightcurves comes from the spectral hardening\nof the photospheric emission with increasing luminosity L (and\ntherefore increasing photospheric luminosity Lph ; see eqs. (14)\nand (15)). This spectral hardening results in relatively enhanced\nemission in the hard bands (with respect to the softer ones)\nwhen the luminosity is close to its peak.\n\n5. Discussion/conclusions\nIn the magnetic reconnection model, the flow that powers a\nGRB is initially Poynting flux dominated. The model is char-\n\n\fGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nacterized by gradual dissipation of magnetic energy that leads\nto acceleration of the flow and an increase in its internal energy. For characteristics of the flow typical to those expected\nfor GRB flows (i.e., high luminosities and low baryon loadings) the dissipation continues at distances outside the point\nwhere the flow becomes transparent with respect to Thomson\nscattering (i.e. outside the Thomson photosphere). The energy\nrelease close to the photospheric radius leads to a hot photosphere. Inverse Compton scattering of the advected with the\nflow photon field by hot electrons leads to photospheric spectra\nwith a characteristic non-thermal appearance and with peak energy and spectral slopes close to those observed in the prompt\nphase of GRBs. The radiative transfer problem has been studied in detail, with both analytical and numerical tools, in G06.\nHere, we build further on that study by providing an accurate analytical description of the spectra predicted by the model\nin the x-ray and γ-ray regime. We show that the photospheric\nemission from the reconnection model is well described by a\nsmoothly broken power law model. Simple fitting formulas are\npresented for the bolometric luminosity and peak energy of the\nE * f (E) spectrum as a function of the flow parameters (i.e. the\nluminosity of the flow L, the baryon loading σ0 and the reconnection timescale parameter εΩ).\nThe model predicts the observed clustering of the peak energy of the E * f (E) spectrum in the sub-MeV range and its\nquantitative comparison with observations indicates that the\ncombination of parameters (εΩ) (where ε stands for the fraction of the Alfvén speed with which reconnection takes place\nand Ω for the angular frequency of the rotator) has values\n(εΩ) ∼ 100 rad s−1 . This is compatible with reconnection speed\nproceeding with ε ∼ 0.03 and a rotator with angular frequency\n0.5\nΩ ∼ 103.5rad s−1 . The Amati relation (i.e. Ep ∼ Eiso\n; Amati\net al. 2002; 2006) can be explained by the model provided that\nthe most luminous bursts are characterized by higher energyto-rest-mass ratio.\nMore constraints to both the model and the operation of the\ncentral engine can come from the study of the variability properties of the GRBs. In the photospheric model, the observed\nvariability is a direct manifestation of the activity of the central\nengine. Individual pulses, considered to be the building blocks\nof the GRB lightcurves (e.g. Fenimore et al. 1995) come from\nmodulations of the luminosity and the baryon loading of the\nflow and are ultimately linked to the central engine variability. Modeling of the observed properties of the GRB pulses\ncan, thus, provide us with a unique probe into oparation of the\ncentral engine on diferent timescales during the GRB prompt\nphase.\nWe have simulated GRB pulses by assuming that the luminosity of the flow varies following the typical observed pulse\nprofile (cf. Norris et al. 1996) and that the magnetization parameter σ0 corelates with the luminosity of the flow as indicated by our interpretation of the Amati relation. The pulse\nwidth predicted by the model is narrower in the harder energy\nbands, in agreement with observation.\n\n9\n\nReferences\nAbramowicz, M. A., Novikov, I. D., & Paczyński, B. 1991, ApJ, 369,\n175\nAmati, L., Frontera, F., Tavani, M., et al. 2002, A&A, 390, 81\nAmati, L. 2006, MNRAS, 372, 233\nBand, D., & Preece, R. D. 2005, ApJ, 627, 319\nBand, D., Matteson, J., Ford, L., et al. 1993, ApJ, 413, 281\nBlandford, R. D., & Payne, D. G. 1982, MNRAS, 199, 883\nCoroniti, F. V. 1990, ApJ, 349, 538\nCrider, A., Liang, E. P., Smith, I. A., et al. 1997, ApJ, 479, L39\nDaigne, F., & Mochkovitch, R. 2002, MNRAS, 336, 1271\nDrenkhahn, G. 2002, A&A, 387, 714\nDrenkhahn, G., & Spruit, H. C. 2002, A&A, 391, 1141\nFenimore, E. E., in 't Zand, J. J. M., Norris, J. P., Bonnell, J. T., &\nNemiroff, R. J. 1995, ApJ, 448, L101\nFrontera, F., Amati, L., Costa, E., et al. 2000, ApJS, 127, 59\nGhirlanda, G., Celotti, A., & Ghisellini, G. 2003, A&A, 406, 879\nGhisellini, G., & Celotti, A. 1999, A&AS, 138, 527\nGiannios, D. 2006, A&A, 457, 763\nGiannios, D., & Spruit, H. C. 2005, A&A, 430, 1\nGiannios, D., & Spruit, H. C. 2006, A&A, 450, 887\nGoodman, J. 1986, ApJ, 308, L47\nKaneko, Y., Preece, R. D., Briggs, M. S., et al. 2006, ApJS, 166, 298\nLyubarsky, Y. E. 2005, MNRAS, 358, 113\nLyutikov, M., & Blandford R. D. 2003, astro-ph/0312347\nMészáros, P., & Rees, M. J. 1997, ApJ, 482, L29\nMészáros, P., & Rees, M. J. 2000, ApJ, 530, 292\nMichel, F. C. 1969, ApJ, 158, 727\nNakar, E., & Piran, T. 2005, MNRAS, 360, L73\nNorris, J. P., Nemiroff, R. J., Bonnell, J. T., et al. 1996, ApJ, 459, 393\nPaczyński, B. 1986, ApJ, 308, L43\nPe'er, A., Mészáros, P., & Rees, M. J. 2005, ApJ, 635, 476\nPiran, T. 2005, Rev. Mod. Phys., 76, 1143\nPiran, T., Shemi, A., & Narayan, R. 1993, MNRAS, 263, 861\nPreece, R. D., Briggs, M. S., Mallozzi, R. S, & Brock, M. N. 1994,\n\"WINdows Gamma SPectral ANalysis (WINGSPAN)\"\nPreece, R. D., Briggs, M. S., Mallozzi, R. S, et al. 1998, ApJ, 506, L23\nRamirez-Ruiz, E. 2005, MNRAS, 363, L61\nRees, M. J., & Mészáros, P. 1994, ApJ, 430, L93\nRyde, F. 1999, Astroph. Lett. and Comm., 39, 281\nRyde, F. 2004, ApJ, 614, 827\nRyde, F. 2005, ApJ, 625, L95\nSari, R., & Piran, T. 1997, MNRAS, 287, 110\nSpruit, H. C., & Drenkhahn, G. D. 2004, Magnetically powered\nprompt radiation and flow acceleration in GRB, in Proceedings\n\"Gamma Ray Bursts in the Afterglow Era, Third Workshop\",\nRome, Sept 2002. ASP Conference Proccedings, 312, 357\nSpruit, H. C., Daigne, F., & Drenkhahn, G. 2001, A&A, 369, 694\nThompson, C. 1994, MNRAS, 270, 480\nThompson, C., Mészáros, P., & Rees, M. J. 2006, ApJ, submitted,\nastro-ph/0608282\nUzdensky, D. A., & MacFadyen, A. I. 2006, ApJ, 647, 1192\nVlahakis, N., & Königl, A. 2003, ApJ, 596, 1080\n\nAppendix A: Fitting functions for the spectral\nparameters\nHere we give the expressions that describe how the photospheric luminosity Lph , the peak energy Ep , the high frequency\npower law λ2 and the spectral break Λ depend on the physical\nparameters L, σ0 and εΩ of the reconnection model. We first,\nderive some useful expressions related to the SBPL model that\nwill simplify the apearance of the fitting formulas.\n\n\f10\n\nGiannios and Spruit: Properties of a dissipative GRB photosphere\n\nA.1. A note on the Smoothly connected power-law\nmodel\nThe expression that describes the SBPL model can be quite\ngenerally written (e.g., Ryde 1999)\ng(x) = A\n\n\u0013−0.55\n\u0012 σ \u00133.6 \u0012 σ \u0013−3.3 \u0012\n0,cr\n0\neq + e−q\n,\n100\n100\n\n(A.10)\n\n(A.1)\n\n0.11\nAp ≈ 1200(εΩ)0.33\n3 L52\n\nkeV.\n\n(A.11)\n\nFor σ0 > σ0,cr this reduces to (cf. eq. (A.4))\n\nln(x/xb )\n,\nΛ\n\nqpiv =\n\nln(xpiv /xb )\n.\nΛ\n\n(A.2)\n\nThe value xpiv is a reference value of the x variable one has the\nfreedom to choose. For x = xpiv one easily check that g(xpiv ) =\nA.\nThis expression can be simplified if the reference value\nxpiv is taken sufficiently far from the break xb . If, for example,\neqpiv ≫ e−qpiv , one can simplify the expression for the SBPL\nmodel.\nUnder the condition that eqpiv ≫ e−qpiv eq. (A.1) can be\nbrought into the form\nλ2 −λ1\n1\n2 \u0012\n\u0013 λ2 −λ\n\u0012 x \u0013 λ1 +λ\n2\n2 Λ\nxb \u0013 2 \u0012 q\n−q\ne +e\n.\ng(x) = A\nxpiv\nxpiv\n\n(A.3)\n\nOne can also derive the asymptotic expressions for the low and\nhigh power-law dependence of g(x) on x in the limits eq ≫ e−q\nand vice versa. So expression (A.3) gives\n\u0012 x \u0013 λ2\ng(x) = A\n, eq ≫ e−q\n(A.4)\nxpiv\nand\ng(x) = A\n\nE p = Ap\nwith\n\nλ2 −λ1\n2 \u0012\n\u0012 x \u0013 λ1 +λ\n2\neq + e−q \u0013 2 Λ\n,\nxpiv\neqpiv + e−qpiv\n\nwhere\nq=\n\nThe fit for the peak energy of the E * f (E) spectrum on σ0\nis\n\n\u0012 x \u0013λ1 \u0012 x \u0013λ2 −λ1\nb\n,\nxpiv\nxpiv\n\neq ≪ e−q .\n\n(A.5)\n\nThe form (A.3) of the SBPL model is used below for fitting the\ndependency of the photospheric spectrum on the parameters of\nour magnetically powered GRB flow.\n\nA.2. Fitting formulas\nThe dependency of the photospheric bolometric luminosity on\nσ0 is well modeled by a SBPL model (see fig. 3) of the form\n\u0012 σ \u00131.5 \u0012 σ \u0013−3 \u0012\n\u0013−0.5\n0,cr\n0\nLph = AL\n,\n(A.6)\neq + e−q\n100\n100\nwhere\nq = 6 ln(σ0 /σ0,cr )\n(A.7)\n\u00112/15\n\u0010\n(defined in eq. (8)). The best fit\nand σ0,cr = 42 L52 (εΩ)3\nfor AL is\n1.2\nAL ≈ 7 * 1050 (εΩ)0.2\n3 L52\n\nerg * s−1 .\n\n(A.8)\n\nThe rather sharp break means that for σ0 > σ0,cr the photospheric luminosity is well represented by (see also eq. (A.4))\n1.2 −1.5\nLph = 7 * 1050 (εΩ)0.2\n3 L52 σ0,2\n\nerg * s−1 .\n\n(σ > σ0 )\n\n(A.9)\n\n0.11 0.3\nEp ≈ 1200(εΩ)0.33\n3 L52 σ0,2\n\nkeV.\n\nThe fit for the high-energy slope is\n\u0012 σ \u0013−1.8 \u0012 σ \u00131.8 \u0012\n\u00130.3\n0,cr\n0\nλ2 ≈ −2.5\neq + e−q .\n100\n100\n\n(A.12)\n\n(A.13)\n\nThe break scale is approximately constant, Λ ≃ 1.6, for\nhigh σ0 and makes a transition to Λ ≃ 2.8 for low values of σ0 .\nThe transition is modeled with the hyperbolic tangent function\nwith best fit\n\u0012 σ −σ \u0013\n0\n0,cr\nΛ ≈ 2.2 − 0.6 tanh 8\n.\n(A.14)\nσ0,cr\nAn approximation to the spectrum itself, as a function of\nbaryon loading, flow luminosity and reconnection rate, is given\nby eq. (11), with parameters given by the fitting formulas\nabove. The normalization factor\nR A in eq. (11) follows by equating the integrated luminosity f (E) dE to the photospheric luminosity from A.6.\n\n\f"}