{"id": "http://arxiv.org/abs/astro-ph/0108385v1", "guidislink": true, "updated": "2001-08-23T20:17:19Z", "updated_parsed": [2001, 8, 23, 20, 17, 19, 3, 235, 0], "published": "2001-08-23T20:17:19Z", "published_parsed": [2001, 8, 23, 20, 17, 19, 3, 235, 0], "title": "Very High Energy Gamma Ray Emission from Crab and Geminga Pulsars", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0108064%2Castro-ph%2F0108062%2Castro-ph%2F0108336%2Castro-ph%2F0108208%2Castro-ph%2F0108098%2Castro-ph%2F0108506%2Castro-ph%2F0108122%2Castro-ph%2F0108465%2Castro-ph%2F0108214%2Castro-ph%2F0108350%2Castro-ph%2F0108344%2Castro-ph%2F0108225%2Castro-ph%2F0108222%2Castro-ph%2F0108400%2Castro-ph%2F0108464%2Castro-ph%2F0108270%2Castro-ph%2F0108258%2Castro-ph%2F0108004%2Castro-ph%2F0108255%2Castro-ph%2F0108322%2Castro-ph%2F0108035%2Castro-ph%2F0108151%2Castro-ph%2F0108139%2Castro-ph%2F0108480%2Castro-ph%2F0108448%2Castro-ph%2F0108169%2Castro-ph%2F0108511%2Castro-ph%2F0108385%2Castro-ph%2F0108342%2Castro-ph%2F0108287%2Castro-ph%2F0108187%2Castro-ph%2F0108429%2Castro-ph%2F0108341%2Castro-ph%2F0108145%2Castro-ph%2F0108489%2Castro-ph%2F0108220%2Castro-ph%2F0108236%2Castro-ph%2F0108181%2Castro-ph%2F0108247%2Castro-ph%2F0108445%2Castro-ph%2F0108192%2Castro-ph%2F0108356%2Castro-ph%2F0108079%2Castro-ph%2F0108032%2Castro-ph%2F0108368%2Castro-ph%2F0108159%2Castro-ph%2F0108174%2Castro-ph%2F0108144%2Castro-ph%2F0108297%2Castro-ph%2F0108424%2Castro-ph%2F0108046%2Castro-ph%2F0108361%2Castro-ph%2F0108519%2Castro-ph%2F0108087%2Castro-ph%2F0108114%2Castro-ph%2F0108141%2Castro-ph%2F0108049%2Castro-ph%2F0108452%2Castro-ph%2F0108277%2Castro-ph%2F0108512%2Castro-ph%2F0108093%2Castro-ph%2F0108198%2Castro-ph%2F0108182%2Castro-ph%2F0108272%2Castro-ph%2F0108227%2Castro-ph%2F0108426%2Castro-ph%2F0108091%2Castro-ph%2F0108002%2Castro-ph%2F0108390%2Castro-ph%2F0108037%2Castro-ph%2F0108239%2Castro-ph%2F0108094%2Castro-ph%2F0108349%2Castro-ph%2F0108500%2Castro-ph%2F0108067%2Castro-ph%2F0108323%2Castro-ph%2F0108007%2Castro-ph%2F0108460%2Castro-ph%2F0108223%2Castro-ph%2F0108396%2Castro-ph%2F0108167%2Castro-ph%2F0108207%2Castro-ph%2F0108230%2Castro-ph%2F0108055%2Castro-ph%2F0108389%2Castro-ph%2F0108015%2Castro-ph%2F0108303%2Castro-ph%2F0108033%2Castro-ph%2F0108249%2Castro-ph%2F0108394%2Castro-ph%2F0108428%2Castro-ph%2F0108027%2Castro-ph%2F0108109%2Castro-ph%2F0108212%2Castro-ph%2F0108487%2Castro-ph%2F0108056%2Castro-ph%2F0108044%2Castro-ph%2F0108175%2Castro-ph%2F0108119%2Castro-ph%2F0108292%2Castro-ph%2F0108020&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Very High Energy Gamma Ray Emission from Crab and Geminga Pulsars"}, "summary": "The main inference from the experiments of the '80s that the time-averaged\nenergy spectra of pulsars had to steepen in the GeV-TeV energy region has been\nreinforced in the '90s from experiments with higher sensitivities. However,\nresults from several experiments from the past and the more sensitive\nexperiments at present can be reconciled by invoking a possibly different\ncomponent arising in the TeV region. The results of the preliminary analysis of\nthe data being collected with the PACT array will be presented.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0108064%2Castro-ph%2F0108062%2Castro-ph%2F0108336%2Castro-ph%2F0108208%2Castro-ph%2F0108098%2Castro-ph%2F0108506%2Castro-ph%2F0108122%2Castro-ph%2F0108465%2Castro-ph%2F0108214%2Castro-ph%2F0108350%2Castro-ph%2F0108344%2Castro-ph%2F0108225%2Castro-ph%2F0108222%2Castro-ph%2F0108400%2Castro-ph%2F0108464%2Castro-ph%2F0108270%2Castro-ph%2F0108258%2Castro-ph%2F0108004%2Castro-ph%2F0108255%2Castro-ph%2F0108322%2Castro-ph%2F0108035%2Castro-ph%2F0108151%2Castro-ph%2F0108139%2Castro-ph%2F0108480%2Castro-ph%2F0108448%2Castro-ph%2F0108169%2Castro-ph%2F0108511%2Castro-ph%2F0108385%2Castro-ph%2F0108342%2Castro-ph%2F0108287%2Castro-ph%2F0108187%2Castro-ph%2F0108429%2Castro-ph%2F0108341%2Castro-ph%2F0108145%2Castro-ph%2F0108489%2Castro-ph%2F0108220%2Castro-ph%2F0108236%2Castro-ph%2F0108181%2Castro-ph%2F0108247%2Castro-ph%2F0108445%2Castro-ph%2F0108192%2Castro-ph%2F0108356%2Castro-ph%2F0108079%2Castro-ph%2F0108032%2Castro-ph%2F0108368%2Castro-ph%2F0108159%2Castro-ph%2F0108174%2Castro-ph%2F0108144%2Castro-ph%2F0108297%2Castro-ph%2F0108424%2Castro-ph%2F0108046%2Castro-ph%2F0108361%2Castro-ph%2F0108519%2Castro-ph%2F0108087%2Castro-ph%2F0108114%2Castro-ph%2F0108141%2Castro-ph%2F0108049%2Castro-ph%2F0108452%2Castro-ph%2F0108277%2Castro-ph%2F0108512%2Castro-ph%2F0108093%2Castro-ph%2F0108198%2Castro-ph%2F0108182%2Castro-ph%2F0108272%2Castro-ph%2F0108227%2Castro-ph%2F0108426%2Castro-ph%2F0108091%2Castro-ph%2F0108002%2Castro-ph%2F0108390%2Castro-ph%2F0108037%2Castro-ph%2F0108239%2Castro-ph%2F0108094%2Castro-ph%2F0108349%2Castro-ph%2F0108500%2Castro-ph%2F0108067%2Castro-ph%2F0108323%2Castro-ph%2F0108007%2Castro-ph%2F0108460%2Castro-ph%2F0108223%2Castro-ph%2F0108396%2Castro-ph%2F0108167%2Castro-ph%2F0108207%2Castro-ph%2F0108230%2Castro-ph%2F0108055%2Castro-ph%2F0108389%2Castro-ph%2F0108015%2Castro-ph%2F0108303%2Castro-ph%2F0108033%2Castro-ph%2F0108249%2Castro-ph%2F0108394%2Castro-ph%2F0108428%2Castro-ph%2F0108027%2Castro-ph%2F0108109%2Castro-ph%2F0108212%2Castro-ph%2F0108487%2Castro-ph%2F0108056%2Castro-ph%2F0108044%2Castro-ph%2F0108175%2Castro-ph%2F0108119%2Castro-ph%2F0108292%2Castro-ph%2F0108020&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The main inference from the experiments of the '80s that the time-averaged\nenergy spectra of pulsars had to steepen in the GeV-TeV energy region has been\nreinforced in the '90s from experiments with higher sensitivities. However,\nresults from several experiments from the past and the more sensitive\nexperiments at present can be reconciled by invoking a possibly different\ncomponent arising in the TeV region. The results of the preliminary analysis of\nthe data being collected with the PACT array will be presented."}, "authors": ["P. R. Vishwanath", "B. S. Acharya", "P. N. Bhat", "V. R. Chitnis", "P. Majumdar", "M. A. Rahman", "B. B. Singh"], "author_detail": {"name": "B. B. Singh"}, "author": "B. B. Singh", "arxiv_comment": "3 pages, 1 Postscript figures; uses icrc.cls", "links": [{"href": "http://arxiv.org/abs/astro-ph/0108385v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0108385v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0108385v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0108385v1", "journal_reference": "27th International Cosmic Ray Conference, Hamburg (Germany), 2001", "doi": null, "fulltext": "Proceedings of ICRC 2001: 1–3 c Copernicus Gesellschaft 2001\n\nICRC 2001\n\narXiv:astro-ph/0108385v1 23 Aug 2001\n\nVery High Energy γ− ray Emission from Crab and Geminga\nPulsars\nP.R.Vishwanath, B.S.Acharya, P.N.Bhat, V.R.Chitnis, P.Majumdar, and M.A.Rahman and B.B.Singh\nTata Institute of Fundamental Research,Colaba\nMumbai,400005, India\n\nAbstract. The main inference from the experiments of the\n'80s that the time-averaged energy spectra of pulsars had to\nsteepen in the GeV-TeV energy region has been reinforced\nin the '90s from experiments with higher sensitivities. However, results from several experiments from the past and the\nmore sensitive experiments at present can be reconciled by\ninvoking a possibly different component arising in the TeV\nregion. The results of the preliminary analysis of the data\nbeing collected with the PACT array will be presented.\n\n1\n\nIntroduction\n\nAlmost all the VHE γ− ray groups looking for VHE γ− ray\nemission from pulsars in the '70s did find some signals from\nthe Crab pulsar, but the results could not be repeated. While\nthere were several possible reasons for non-reproducibility of\nthe results , it was becoming clear from later experiments in\n'80s that time averaged pulsar spectra have to steepen at the\nenergies 500 to 1000 GeV. As we will see below, these tentative conclusions from that era have been borne out in general\nby the more recent and sensitive VHE γ− ray experiments,\nwith both imaging and non-imaging techniques. Pulsar studies have become more interesting for the VHE gamma ray\nastronomer since the EGRET results which detected seven\nγ− ray pulsars [Thomson (2000)]. At > 1 GeV energies, the\nlight curves change with the dominance of either the main or\nthe inter pulse. Further the spectra show dominant power at\nenergies of ≤ 1 GeV with a falloff at higher energies. All\nthese features indicate changes in characteristics at higher\nenergies. Thus, the VHE γ− ray experiments have the interesting task of finding the cut-off energies for the emission\nmechanism acting at the MeV-GeV energy region in the environs of the pulsars. The Outer Gap(OG) models for pulsar\nemissions predict an inverse Compton component due to gap\naccelerated particles with a peak around 1 TeV. While there\nare variations in the OG models, all models predict a TeV\nCorrespondence to: vishwa@tifr.res.in\n\nemission component. Thus, while the emission process giving rise to MeV-GeV gamma rays could peter out at sub- TeV\nenergies, it is important to detect other processes in pulsars\nwhich could give rise to GeV-TeV γ− rays. While the recent\ntrend in the field has been to lower the threshold energies, it\nis interesting that one has really to look at the higher energy\npart of the data to detect this emission. Preliminary results\nfrom a new experiment which has started out at Pachmarhi\nwill be specially looked at for evidence for these higher energy emissions. Recent reviews on VHE gamma ray emission from pulsars can be found in Fegan [Fegan (1996)] and\nKifune [Kifune (1996)].\n\n2 Earlier Results on Crab and Geminga Pulsars\nWhile there have been many observations in the 1970s with\nand without absolute phase information, we will restrict ourselves to the results in the 80s which in general had absolute\nphase information. The Durham group, working at the Dugway site in USA, detected a 4.3σ signal at the main pulse\nphase position from 103 hours of observation at an energy\nthreshold of 1 TeV. The flux was found to be 5 × 10−12\nsec−1 cm−2 . It should be noted that the detected flux is\nquite small, about 3 per hour. With arrival direction estimation, they also showed that the signal falls off away from\nthe pulsar direction. The Tata group, earlier at Ooty and later\nat Pachmarhi, had many hours of observation on the pulsar\nand detected transients but no time-averaged signal. As a\nrepresentative of the Tata observations, one can use the Ooty\nresults of 3 years (a total of 105 hours of observation), all\nwith absolute phase, which did not show a signal at the main\npeak and where an upper limit of 4.6 ×10−12 sec−1 cm−2\nfor Energy > 800 GeV was derived for the time averaged\nemission.[Vishwanath (1987)] The Asgat experiment, with\n50 hours of exposure, derived an upper limit of 2.2 × 10−12\nsec−1 cm−2 at >600 GeV[Goret (1993)]. Recently, a thorough search for pulsed emission has been done with the Whipple imaging telescope.[Burdett (1999)] Using the data col-\n\n\fVishwanath et al: VHE γ− rays from Crab and Geminga Pulsars\n\n2\nlected between 1995 and 1997, for an exposure of about 73\nhours, they give an upper limit for pulsed emission to be\n4.8 × 10−12 sec−1 cm−2 and 1.2 × 10−12 sec−1 cm−2 above\n> 250 and 1000 GeV respectivley. HEGRA experiment has\nalso given only upper limits for emission of VHE γ− rays\nfrom Crab abd Geminga pulsars. [Aharonian (1999)] The\nCELESTE experiment and the STACEE experiments, both\nwith solar arrays, also do not see evidence for pulsed emission in their respective energy regions.\nAfter the mystery that Geminga had created in the '80s\nwas resolved by the EGRET experiment in the '90s, two\ngroups [Bowden (1993)],[Vishwanath (1993)] found modest pulsar signatures in their archival data with VHE γ− ray\npeaks coinciding with the peaks in the low energy data. The\nflux reported by the Ooty group( with simultaneous observation at 2 sites for a total of 28 hours ) at energy thresholds of 0.8 and 1.7 TeV was 2.1 × 10−11 sec−1 cm−2 and\n0.44 × 10−11 sec−1 cm−2 respectively. Later, in the '90s, an\nupper limit for pulsed emission from Geminga was given by\nthe Whipple imaging telescope.[Akerlof (1993)]\nDuring 1992-1994, the Tata group working at Pachmarhi\nran an interim array for testing some of the hypothesis concerning Lateral Distribution(LD) (discussed below ) of VHE\nγ− rays. 8 banks of mirrors, each of total area 2.5m2 were\ndeployed in a 80m × 100m area. The exposures for Crab\nand Geminga were 80 and 49 hours respectively [Vishwanath\n(1997)]. It was shown that the events at phases at which\nGeV emission was found(Main pulse region for Crab and\naround 0.6 for Geminga) displayed the same features as expected from gamma ray events. The mean Cerenkov light\n(measured in ADC units) per event was also higher at these\nphases, an indication of the gamma ray admixture. The number of events at the Main Phase region for the Crab was about\n3.5 per hour.\n\nence).\nMany simulations, including the recent extensive calculations by Chitnis and Bhat [Chitnis (1999)] have shown that\nthe gamma ray lateral distribution (LD) is very different from\nthat of protons in having an almost constant density till about\n120 meters where it becomes higher resulting in the so called\nhump region (a result of the focusing property of Cerenkov\nradiation) for the next 20 meters. The fall off from the hump\nregion is similar to the monotonic decrease for the proton\nshowers from the core. The Monte Carlo simulations with\nthese inputs for the PACT array showed that a gamma ray\nevent would have at large values of total Cerenkov pulse\nheight since a typical gamma ray would deposit much more\nCerenkov light than a typical cosmic ray. Further, it was seen\nthat β, a LD parameter which is a measure of how large the\ndetector with the maximum pulse height would be compared\nto the rest of the detectors, would be useful for distinguishing between proton and gamma ray showers. The details\nare discussed in the conference papers of the PACT experiment.[Vishwanath (2001)]\nThe experiment is capable of good angular resolution. Cuts\nwere applied on the space angle difference between the event\nand the pulsar direction. Further, a cut was imposed on the\nnumber of mirrors hit and the β parameter both of which\nplace the events at higher energies. The peak seen at the\nMain Pulse phase in the lower half of Fig. 1 is a 4 σ signal.\nFig 2 shows the rate per hour of the events in the Main Pulse\nregion for the 3 sub periods (1999 Nov, 2000 Jan, 2000 October and 2000 November) of the data taking. Within errors,\nthe rate is same for the 3 data periods. The mean rate is 3.4\n± 1.2 per hour which compares well with the detected rate\nwith the interim array with similar cuts discussed above.\n\n4 Discussions\n3\n\nThe new results from PACT\n\nA totally new set up PACT has been commissioned recently\nat Pachmarhi with 25 telescopes, each with 7 mirrors , having a total area of 105m2 of mirrors [Bhat (2000)] for using both the LD aspects and the arrival direction information for the increase of sensitivity. A total of 45 hours of\ndata and 20 hours of data on Crab and Geminga pulsars were\ntaken respectively. While the Crab data ranged from runs\nin Nov 1999 to Nov 2000, all the Geminga data was taken\nin Dec 2000. While the ephemeris for Crab was taken from\nthe data provided by the Jodrell Bank, the latest parametrization of the EGRET group for the pulsar period was used for\nGeminga. Standard algorithms were used to get the phase for\neach event. Fig 1(a) shows the Crab pulsar phasograms without any cut and with the cuts. It can be seen that the phasogram without any cut does not show any significant emission\nat any phase. Therefore, an upper limit to the time averaged\nemission is derived above >900 GeV as 2×10−12sec−1 cm−2\nThis upper limit is similar to those set by most experiments\n(Results on Geminga will be presented later in the confer-\n\nIt is certain that most of the pulsar energy spectra have to\nsteepen in the energy range of the atmospheric Cerenkov experiments. The precise energy region of the steepening will\nbe clear when some of the lower energy threshold experiments become fully functional. By locating the cut-off energy, the experiments can help distinguish between the contending models for gamma ray emission by pulsars. Polar\nCap models predict steep spectral cut-offs due to magnetic\npair production attenuation and essentially no detectable emission above about 50 GeV. The spectral cut-off predicted in\nOG models is more gradual.\nSome comments have to be made about the results from\nthe earlier generation experiments. Lacking detailed Monte\nCarlo calculations which are regular features of the present\nday experiments, the energy thresholds and collection area\nestimates would have been less precise. However, the calculations in getting the pulsar phase for the event had been\nwell known. Further, when at least two experiments see the\nsame effect at the same phase, the credibility of the overall\neffect should be quite high. Some remarks are also in order about the non-reproducibility which plagued experiments\n\n\fVishwanath et al: VHE γ− rays from Crab and Geminga Pulsars\n\n3\n\ngies, it should show up as a mild bump in the overall energy\nspectrum from Crab. If the nebular emission at few hundred\nGeVs is solely due to inverse Compton scattering process, a\nnew process at TeV energies should add to the nebular flux.\nOne should however keep in mind the very low flux from pulsar and only experiments with good energy resolution will be\nable to opine on this issue.\nAcknowledgements. It is a pleasure to thank Sarvashri A.I.DSouza,\nJ.Francis, K.S.Gothe, B.K.Nagesh, M.S.Pose, P.N.Purohit, K.K.Rao,\nS.K.Rao, S.K.Sharma, A.J.Stanislaus, P.V.Sudershanan, S.S.Upadhya,\nB.L.Venkatesh Murthy for their participation in various aspects of\nthe experiment.\n\nReferences\n\nFig. 1. (a)The phasogram of events from Crab pulsar during 19992000. The top part is the phasogram of all events without any cuts.\nThe bottom part is the result of several cuts (see text). (b) The rate\nof detected events in the Main Pulse region. The data are from the\n1992 Interim array and the recent PACT experiment\n\nin the early days when the energy thresholds of experiments\nwere varying with constant attempts to lower the threshold.\nIf a new component does surface at > 1 TeV energies, it is\nnot surprising that there were conflicting results depending\non the energy threshold of the experiment.\nIt is seen that the recent results from the Pachmarhi experiment do indicate a finite number of events from the Crab\nPulsar. While the cuts need to be understood properly before an actual flux could be given, it would be obviously\ngreater than the detected flux which is at the level of 7 ×\n10−13 sec−1 cm−2 . It should also be noted that the cuts for\nthe data place the events detected at energies > 1.5 to 2 TeV,\nmuch greater than the actual energy threshold of the experiment. The fact that similar flux was seen from the interim\narray is also interesting. Thus, it is possible that the earlier results from Durham as well as the new preliminary results from Pachmarhi do point to a new pulsar component at\nhigher energies.\nLong exposures are very necessary to detect such flux levels. Detected flux from the Crab pulsar is 2-3 per hour in\nthe experiments of Dowthwaite et al and the recent results\nfrom the Pachmarhi experiment. This has to be compared\nto the flux levels of 2-3 per minute from the whole nebula.\nIf there is a finite flux from the Crab pulsar at TeV ener-\n\nAkerlof C.W. et al, A&A,274,L17(1993)\nAharonian et al, A&A, 346, 913(1999)\nBhat. P.N. et al, Bull. Astr. Soc. India,28,455(2000)\nBowden. C.G.et al, Jour. of Phys G,19,L29(1993)\nBurdett. A.M. et al, Proc. 26th ICRC(1999)\nChitnis. V.R. and Bhat. P.N., Astroparticle Physics,12,45(1999)\nDowthwaite. T.C. et al, ApJ,286,L35(1994)\nGoret. P. et al, A&A,270,401(1993)\nFegan D.J., Space Science Reviews,75,137(1996)\nKifune T., PULSARS,IAU Colloquium 160(1996)\nThomson D.J., High Energy γ− ray Astronomy, Heidelberg(2000)\nVishwanath. P.R., J. of Astronomy and Astrophysics,8,67(1987)\nVishwanath. P.R. et al, A&A,267,L5(1993)\nVishwanath P.R.,High Energy Astronomy and Astrophysics(Eds:\nP.C.Agrawal and P.R.Vishwanath,University Press), 204(1997)\nVishwanath P.R., These Proceedings(2001)\n\n\f"}