{"id": "http://arxiv.org/abs/astro-ph/0602484v1", "guidislink": true, "updated": "2006-02-22T09:51:49Z", "updated_parsed": [2006, 2, 22, 9, 51, 49, 2, 53, 0], "published": "2006-02-22T09:51:49Z", "published_parsed": [2006, 2, 22, 9, 51, 49, 2, 53, 0], "title": "OB Stars in the Solar Neighborhood I: Analysis of their Spatial\n  Distribution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0602101%2Castro-ph%2F0602587%2Castro-ph%2F0602074%2Castro-ph%2F0602097%2Castro-ph%2F0602062%2Castro-ph%2F0602310%2Castro-ph%2F0602201%2Castro-ph%2F0602400%2Castro-ph%2F0602056%2Castro-ph%2F0602590%2Castro-ph%2F0602009%2Castro-ph%2F0602360%2Castro-ph%2F0602615%2Castro-ph%2F0602172%2Castro-ph%2F0602484%2Castro-ph%2F0602421%2Castro-ph%2F0602311%2Castro-ph%2F0602448%2Castro-ph%2F0602134%2Castro-ph%2F0602589%2Castro-ph%2F0602189%2Castro-ph%2F0602568%2Castro-ph%2F0602086%2Castro-ph%2F0602131%2Castro-ph%2F0602177%2Castro-ph%2F0602349%2Castro-ph%2F0602022%2Castro-ph%2F0602406%2Castro-ph%2F0602466%2Castro-ph%2F0602473%2Castro-ph%2F0602182%2Castro-ph%2F0602312%2Castro-ph%2F0602100%2Castro-ph%2F0602255%2Castro-ph%2F0602463%2Castro-ph%2F0602306%2Castro-ph%2F0602609%2Castro-ph%2F0602513%2Castro-ph%2F0602231%2Castro-ph%2F0602017%2Castro-ph%2F0602501%2Castro-ph%2F0602184%2Castro-ph%2F0602487%2Castro-ph%2F0602194%2Castro-ph%2F0602387%2Castro-ph%2F0602414%2Castro-ph%2F0602236%2Castro-ph%2F0602488%2Castro-ph%2F0602583%2Castro-ph%2F0602278%2Castro-ph%2F0602167%2Castro-ph%2F0602318%2Castro-ph%2F0602405%2Castro-ph%2F0602371%2Castro-ph%2F0602142%2Castro-ph%2F0602383%2Castro-ph%2F0602602%2Castro-ph%2F0602356%2Castro-ph%2F0602183%2Castro-ph%2F0602256%2Castro-ph%2F0602469%2Castro-ph%2F0602369%2Castro-ph%2F0602135%2Castro-ph%2F0602063%2Castro-ph%2F0602419%2Castro-ph%2F0602012%2Castro-ph%2F0602569%2Castro-ph%2F0602274%2Castro-ph%2F0602226%2Castro-ph%2F0602305%2Castro-ph%2F0602295%2Castro-ph%2F0602527%2Castro-ph%2F0602249%2Castro-ph%2F0602497%2Castro-ph%2F0602030%2Castro-ph%2F0602221%2Castro-ph%2F0602002%2Castro-ph%2F0602219%2Castro-ph%2F0602422%2Castro-ph%2F0602308%2Castro-ph%2F0602560%2Castro-ph%2F0602021%2Castro-ph%2F0602001%2Castro-ph%2F0602230%2Castro-ph%2F0602152%2Castro-ph%2F0602436%2Castro-ph%2F0602195%2Castro-ph%2F0602415%2Castro-ph%2F0602631%2Castro-ph%2F0602191%2Castro-ph%2F0602505%2Castro-ph%2F0602536%2Castro-ph%2F0602417%2Castro-ph%2F0602210%2Castro-ph%2F0602571%2Castro-ph%2F0602321%2Castro-ph%2F0602498%2Castro-ph%2F0602610%2Castro-ph%2F0602481%2Castro-ph%2F0602390%2Castro-ph%2F0602552&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "OB Stars in the Solar Neighborhood I: Analysis of their Spatial\n  Distribution"}, "summary": "We present a newly-developed, three-dimensional spatial classification\nmethod, designed to analyze the spatial distribution of early type stars within\nthe 1 kpc sphere around the Sun. We propose a distribution model formed by two\nintersecting disks -the Gould Belt (GB) and the Local Galactic Disk (LGD)-\ndefined by their fundamental geometric parameters. Then, using a sample of\nabout 550 stars of spectral types earlier than B6 and luminosity classes\nbetween III and V, with precise photometric distances of less than 1 kpc, we\nestimate for some spectral groups the parameters of our model, as well as\nsingle membership probabilities of GB and LGD stars, thus drawing a picture of\nthe spatial distribution of young stars in the vicinity of the Sun.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0602101%2Castro-ph%2F0602587%2Castro-ph%2F0602074%2Castro-ph%2F0602097%2Castro-ph%2F0602062%2Castro-ph%2F0602310%2Castro-ph%2F0602201%2Castro-ph%2F0602400%2Castro-ph%2F0602056%2Castro-ph%2F0602590%2Castro-ph%2F0602009%2Castro-ph%2F0602360%2Castro-ph%2F0602615%2Castro-ph%2F0602172%2Castro-ph%2F0602484%2Castro-ph%2F0602421%2Castro-ph%2F0602311%2Castro-ph%2F0602448%2Castro-ph%2F0602134%2Castro-ph%2F0602589%2Castro-ph%2F0602189%2Castro-ph%2F0602568%2Castro-ph%2F0602086%2Castro-ph%2F0602131%2Castro-ph%2F0602177%2Castro-ph%2F0602349%2Castro-ph%2F0602022%2Castro-ph%2F0602406%2Castro-ph%2F0602466%2Castro-ph%2F0602473%2Castro-ph%2F0602182%2Castro-ph%2F0602312%2Castro-ph%2F0602100%2Castro-ph%2F0602255%2Castro-ph%2F0602463%2Castro-ph%2F0602306%2Castro-ph%2F0602609%2Castro-ph%2F0602513%2Castro-ph%2F0602231%2Castro-ph%2F0602017%2Castro-ph%2F0602501%2Castro-ph%2F0602184%2Castro-ph%2F0602487%2Castro-ph%2F0602194%2Castro-ph%2F0602387%2Castro-ph%2F0602414%2Castro-ph%2F0602236%2Castro-ph%2F0602488%2Castro-ph%2F0602583%2Castro-ph%2F0602278%2Castro-ph%2F0602167%2Castro-ph%2F0602318%2Castro-ph%2F0602405%2Castro-ph%2F0602371%2Castro-ph%2F0602142%2Castro-ph%2F0602383%2Castro-ph%2F0602602%2Castro-ph%2F0602356%2Castro-ph%2F0602183%2Castro-ph%2F0602256%2Castro-ph%2F0602469%2Castro-ph%2F0602369%2Castro-ph%2F0602135%2Castro-ph%2F0602063%2Castro-ph%2F0602419%2Castro-ph%2F0602012%2Castro-ph%2F0602569%2Castro-ph%2F0602274%2Castro-ph%2F0602226%2Castro-ph%2F0602305%2Castro-ph%2F0602295%2Castro-ph%2F0602527%2Castro-ph%2F0602249%2Castro-ph%2F0602497%2Castro-ph%2F0602030%2Castro-ph%2F0602221%2Castro-ph%2F0602002%2Castro-ph%2F0602219%2Castro-ph%2F0602422%2Castro-ph%2F0602308%2Castro-ph%2F0602560%2Castro-ph%2F0602021%2Castro-ph%2F0602001%2Castro-ph%2F0602230%2Castro-ph%2F0602152%2Castro-ph%2F0602436%2Castro-ph%2F0602195%2Castro-ph%2F0602415%2Castro-ph%2F0602631%2Castro-ph%2F0602191%2Castro-ph%2F0602505%2Castro-ph%2F0602536%2Castro-ph%2F0602417%2Castro-ph%2F0602210%2Castro-ph%2F0602571%2Castro-ph%2F0602321%2Castro-ph%2F0602498%2Castro-ph%2F0602610%2Castro-ph%2F0602481%2Castro-ph%2F0602390%2Castro-ph%2F0602552&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a newly-developed, three-dimensional spatial classification\nmethod, designed to analyze the spatial distribution of early type stars within\nthe 1 kpc sphere around the Sun. We propose a distribution model formed by two\nintersecting disks -the Gould Belt (GB) and the Local Galactic Disk (LGD)-\ndefined by their fundamental geometric parameters. Then, using a sample of\nabout 550 stars of spectral types earlier than B6 and luminosity classes\nbetween III and V, with precise photometric distances of less than 1 kpc, we\nestimate for some spectral groups the parameters of our model, as well as\nsingle membership probabilities of GB and LGD stars, thus drawing a picture of\nthe spatial distribution of young stars in the vicinity of the Sun."}, "authors": ["F. Elias", "J. Cabrera-Cano", "E. J. Alfaro"], "author_detail": {"name": "E. J. Alfaro"}, "author": "E. J. Alfaro", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/503110", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0602484v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0602484v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "28 pages including 9 Postscript figures, one of them in color.\n  Accepted for publication in The Astronomical Journal, 30 January 2006", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0602484v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0602484v1", "journal_reference": "Astron.J.131:2700-2709,2006", "doi": "10.1086/503110", "fulltext": "OB Stars in the Solar Neighborhood I: Analysis of their Spatial\nDistribution\n\narXiv:astro-ph/0602484v1 22 Feb 2006\n\nF. Elias\nFacultad de Fı́sica. Departamento de Fı́sica Atómica, Molecular y Nuclear. Universidad de\nSevilla, Apartado 1065, Sevilla, Spain.\nJ. Cabrera-Caño\nFacultad de Fı́sica. Departamento de Fı́sica Atómica, Molecular y Nuclear. Universidad de\nSevilla, Apartado 1065, Sevilla, Spain.\nInstituto de Astrofı́sica de Andalucı́a, CSIC, Apartado 3004 Granada, Spain.\nE.J. Alfaro\nInstituto de Astrofı́sica de Andalucı́a, CSIC, Apartado 3004 Granada, Spain.\nABSTRACT\nWe present a newly-developed, three-dimensional spatial classification\nmethod, designed to analyze the spatial distribution of early type stars within\nthe 1 kpc sphere around the Sun. We propose a distribution model formed by\ntwo intersecting disks -the Gould Belt (GB) and the Local Galactic Disk (LGD)defined by their fundamental geometric parameters. Then, using a sample of\nabout 550 stars of spectral types earlier than B6 and luminosity classes between\nIII and V, with precise photometric distances of less than 1 kpc, we estimate\nfor some spectral groups the parameters of our model, as well as single membership probabilities of GB and LGD stars, thus drawing a picture of the spatial\ndistribution of young stars in the vicinity of the Sun.\nSubject headings: (Galaxy:) solar neighborhood - stars: early-type\n\n1.\n\nIntroduction\n\nWith the naked eye it is possible to observe that the brightest stars in the sky are mainly\ndistributed along two great circles forming an angle of about 20◦ between them: the Milky\nWay and a tilted strip known as the Gould Belt (Herschel 1847; Struve 1847; Gould 1879).\n\n\f–2–\nLater studies found out that the GB is better described as a planar distribution of O and\nB stars in the solar neighborhood, inclined with respect to the Galactic plane (Lesh 1968;\nStothers & Frogel 1974).\nAlthough this structure doesn't show an uniform stellar distribution (the bulk of the\nstars tend to form aggregates around the regions of Orion and Sco-Cen, among others), the\nfact that the kinematic behavior of the GB members is different from that of the LGD stars\nof the same spectral types (Lesh 1968; Stothers & Frogel 1974), and that several features of\nthe local interstellar medium such as dust (Gaustad & Van Buren 1993), neutral hydrogen\n(Lindblad 1967; Lindblad et al. 1973) or molecular clouds (Dame et al. 1993) seem to be\nassociated with the system of OB stars, we can assume that we are witnessing a star-forming\nprocess with a spatial scale length of 1 kpc. Thus, the concept of a star formation complex\nproposed by Efremov (1978, 1995) and recently revised by Elmegreen et al. (2000) appears\nto have in the GB its closest example.\nExtensive reviews covering the history of research about the GB and describing the\npresent state of our knowledge and understanding of this structure can be found in Pöppel\n(1997) and Grenier (2004).\n\n1.1.\n\nA review of classification methods in literature\n\nWhen it comes to studying the stellar component of this complex, the first and most\nserious problem that arises is to isolate the GB members from the stars belonging to the LGD\nfield. This problem has been addressed before by many authors, the proposed methods being\nintimately related to their a priori hypotheses about the geometry of the system (usually,\neither a real belt or toroid, or a disk).\nThe first and most intuitive way of facing the problem that we came across in scientific\nliterature is, once the position of the stars in a three-dimensional frame (normally, Cartesian\nGalactic coordinates X,Y ,Z) is known, then all or some of the three possible projections (i.e.,\nY vs. X, Z vs. X and Z vs. Y ) can be plotted, in order to choose limit distance criteria\naccording to the apparent position of the GB in each of the coordinate planes. This commonly\ntranslates into defining a \"box\" for each projection inside which every star belongs to the\nGB. Examples of this procedure can be found in Pellegatti Franco (1983), Westin (1985),\nLindblad et al. (1997) and Moreno et al. (1999) among others. The greatest advantage of this\nmethod is its simplicity, but undoubtedly there is an important contamination of LGD stars\nin the final selection of GB members, specially in the diffuse zone of intersection between\nthe two systems.\n\n\f–3–\nA second method is based on maximum likelihood analysis of the star density projected\nover the celestial sphere. Assuming that the stars of both the GB and the LGD are confined\naround two great circles in the Galactic latitude vs. longitude projection, the proposed stellar density of both structures decreases as an exponential function of the angular distance to\nthose great circles. The analysis of those distributions provides information about the structure of the GB and the LGD without having to assign individual membership probabilities\nto the stars. Fine examples of this method are seen in Comerón et al. (1994), Torra et al.\n(1997) or Fernández (2005).\nThose two lines of attack have in common in that the classification is based on strictly\nspatial criteria, obtained from two-dimensional projections. But, while the first yields only\na raw approximation to the GB members, the second allows to estimate some structural\nparameters of the system, such as its inclination with respect to the Galactic plane, the\nlongitude of its ascending node, its angular thickness and the fraction of stars belonging to\neach group. On the other hand, this model is based on two rather hard structural hypotheses:\n1. The Sun is located in the center of the GB\n2. The GB stars are distributed along a toroidal geometry\nSuch restrictions impose a limitation on other possible three-dimensional scenarios (such a\ndisk-like structure), that would be difficult to adjust within these premises.\nTherefore, providing that we know the distances of the stars, the need for a threedimensional analysis arises. Here, we can take advantage of all the spatial information at\nour disposal and to expand the number of possible structural scenarios. The first to propose\nsuch an approach to the problem were Stothers & Frogel (1974). They assumed that both\nthe GB and the LGD could be represented by two crossed planes around which the stars are\ndistributed by a law decreasing with the distance to each mid plane, the parameters that\ndefine them being estimated by least-square fitting. Then, they assign individual membership\nto the stars according to their vertical distance Z (in Cartesian Galactic coordinates) to each\nplane; i.e. a star belongs to the GB if its Z distance to the GB mid-plane is smaller than\nthat to the LGD mid-plane, and vice-versa. All this procedure is nested within an iterative\nalgorithm that re-calculates the equation of the planes and re-assigns memberships until the\nconvergence is reached. The disadvantages of this method are that it produces \"artificially\nsharp surfaces on the systems on the sides that face each other\" (Stothers & Frogel 1974), and\nthat, as it seems unavoidable for any separation method based only in the spatial distribution\nof the stars, in the region of intersection between the planes the discrimination cannot be\nfully trusted.\n\n\f–4–\n1.2.\n\nObjectives\n\nWe have developed a new three-dimensional spatial classification method which allows us\nto estimate the mean planes that define the GB and the LGD, and the single star probabilities\nof belonging to either of them. Essentially, as in Stothers & Frogel (1974), we obtain the\nmean planes by least-squares fitting, but instead of simply assigning membership by a Zcoordinate criterion, we define a parametric stellar density distribution for each plane that\nmakes it possible to work with membership probabilities. An essential contribution is the\nintroduction, for the first time in this kind of studies, of the detection of outliers in the\nsample, and the analysis of their effect on the estimation of the model parameters.\nIn this article, we shall give a detailed description of our classification method (Sections\n2.1 and 2.2), then we shall test its validity and limitations using synthetic samples (Section\n2.3). A real sample of OB stars from the Hipparcos Catalogue (ESA 1997), with precise\nphotometric distances will be compiled in Section 3, and then we shall apply our separation\nalgorithm to this sample in order to obtain the structural parameters that best describe\nthe GB and the LGD (Section 4). Finally, we shall develop a correction of completeness to\nenhance our results (Section 5), and we shall resume the most important conclusions of this\narticle in Section 6.\n\n2.\n\nClassification method\n\n2.1.\n\nThe spatial model\n\nThe most restricting simplification that we must assume to build our model is that the\nstars belonging to the GB and the LGD are concentrated along two planes, the distance d of\ntheir members to the mean planes being distributed according to a parametric probability\ndensity function (pdf). Two types of functions have been tested in this study: exponential\nand Gaussian pdfs.\nφ(d) =\n\n1 −d\ne h ;\nh\n\nφ(d) =\n\n1 −( d22 )\ne 2h\nh\n\n(1)\n\nwhere h is, respectively, the scale height and the half-width. An exponential pdf, aside\nfrom being very practical in terms of calculus, is commonly used for describing the vertical\ndistribution of the stars in models of galactic disks (Bahcall & Soneira 1984; Gilmore 1984;\nChen et al. 2001). However, it has the annoying characteristic of having a non-continuous\nderivative at its maximum. Thus, an apparently more realistic function such as a Gaussian\n\n\f–5–\npdf has been tested too.\nUsing heliocentric Galactic rectangular coordinates (X,Y ,Z), where X is positive in the\ndirection of the Galactic center, Y in the direction of Galactic rotation and Z perpendicular\nto the Galactic plane so that they form a direct frame, the mean planes may be expressed\nby the standard Cartesian plane equation\na1 X + a2 Y + a3 Z + a4 = 0\n\n(2)\n\nThen, the distance of any point (x,y,z) to the plane is simply\nd=\n\n|a1 x + a2 y + a3 z + a4 |\np\n.\na21 + a22 + a23\n\n(3)\n\nAlthough this definition is useful in computational terms, a better geometrical understanding is provided by the following parameters: the inclination with respect to the Galactic\nplane (i), the Galactic longitude of the ascending node (Ω) and the vertical distance to the\nSun (Z0 ), where\na1\na2\na3\na4\n\n= sin i sin Ω\n= − sin i cos Ω\n= cos i\n= −a3 Z0\n\n(4)\n\np\nif we normalize the ai to a21 + a22 + a23 = 1 (see Figure 1 for a visualization of the geometrical\nscheme of the problem).\n\n2.2.\n\nStatistical procedure\n\nThe classification of the star sample will be done according to the principles of Bayesian\ndiscriminant analysis, a description of which may be found in Cabrera-Caño & Alfaro (1990).\nIf we know all the parameters that define the planes, we can construct the pdfs for\nthe GB and the LGD, φGB and φLGD , from equation (1). Then, if we know the a priori\nprobability of any star being a GB member, fGB , the Bayes theorem can be written as\npGB =\n\nfGB φGB\nfGB φGB + (1 − fGB )φLGD\n\n(5)\n\n\f–6–\nwhere pGB is the a posteriori probability of belonging to the GB for a star with a known\ndistance to both planes. Thus, following the Bayes minimum error rate decision rule, we\nmay classify a star as a GB member if pGB > 0.5, or as a LGD member if pGB ≤ 0.5.\nObviously, since we lack a pre-classified sample from which to obtain the parameters of\nthe planes, we must follow an iterative procedure to estimate them. Departing from some\nreasonable initial values of i, Ω and Z0 for the planes of the GB and the LGD, of fGB and\nof the scale heights hGB and hLGD , that we use for the initial classification of the sample, we\nobtain a first result that serves to calculate a second estimate of all the parameters, which\nwe then use as the initial values for a third estimation; and so on, iteratively, until we reach\nthe convergence.\n\n2.2.1. Main algorithm\nThe estimation algorithm is divided into the following steps:\n1. The scale heights hGB and hLGD as parameters of the pdfs are simply estimated as the\nvariance of the distances of the stars to the corresponding plane.\n2. fGB is estimated as the ratio of the obtained number of GB members to the sample\nsize.\n3. The parameters of the planes are obtained by orthogonal least squares fitting. If\nri = (xi , yi , zi ) is the position vector of the star i, we first calculate the mean position\nvector r and the matrix of moments M\n\nr=\n\nN\n1 X\nri\nN i=1\n\nN\n1 X\nM=\n(ri − r)T (ri − r)\nN i=1\n\n(6)\n\n(7)\n\nwhere N is the number of stars in the classified sample. We solve the eigenvalues\nequation\ndet(M − λI) = 0\nand then we solve for the eigenvector u\n\n(8)\n\n\f–7–\n\n(M − λ0 I)u = 0\n\n(9)\n\nwhere λ0 is the smallest root of equation (8). Then the fitted orthogonal least squares\nplane equation may be written\nu * (r − r) = 0\n\n(10)\n\nand from the values of the ai coefficients, we can compute i, Ω and Z0 , according to\nequation (4).\nThis iterative algorithm is fully nested within a bootstrap structure in order to simultaneously obtain error estimates of the model parameters. Thus, the procedure is performed\nonce with the true sample, and then it is repeated 99 more times with pseudo-samples of\nthe same size built by choosing stars at random -repetition being allowed- from the original\nbatch.\n\n2.2.2. Detection of outliers\nAn important issue remains, though, which is that of the possible contamination of our\nsample by outliers that don't belong to either of our two distributions as we have defined\nthem, i.e., that they are too far away from the mean planes and cause deviations in the\nestimation of the parameters. This implies that an outlier will be found in zones of low\ndensity of probability in the sampling space (Cabrera-Caño & Alfaro 1985). Since we know\nthe pdfs for the GB and the LGD, we can evaluate the total density D in the position of\nany star of the original sample:\nD = fGB φGB + (1 − fGB )φLGD\n\n(11)\n\nWe consider as an outlier any star located in a point in space where the density D is\nlower than a certain threshold, which indicates the regions so far from the mid planes that\nwe may safely consider that stars in these zones do not belong to our distributions. We have\nfound after the examination of our system that a conservative value of D < 10−3 fulfills our\nrequirements to eliminate most of the possible outliers. All the outliers are removed from\nthe sample before the iterative process begins and the new parameters are estimated. Once\nthe new result has been obtained, we reintroduce the full sample and obtain the outliers as\ndefined by the new planes, thus beginning a second iterative procedure that will lead to the\nfinal estimation of the parameters without contamination by outliers.\n\n\f–8–\n2.3.\n\nStability analysis\n\nIn order to study the behavior of our model, we have built a series of test samples\nwith known parameters that we may compare with those estimated by the algorithm. These\nsamples respond to the simplifications assumed in our model, i.e. they are two clouds of\npoints distributed along two crossed mid planes. In rectangular coordinates (X,Y ,Z), the\npoints are originally distributed at random in the XY plane, while their height Z follows an\nexponential pdf (equation 1). Then, each cloud of points is rotated as a whole by an angle\ni, and then by an angle Ω, and displaced a vertical distance Z0 (their values being obviously\ndifferent\nfor each set of points). Finally, a distance limit r to the whole sample is chosen\np\n2\n( a1 + a22 + a23 ≤ r). The number of points in each sample is about 700 to 800, which are\nthe remaining \"stars\" after the distance cut (each sample originally has 1000 points which, to\navoid undesired border effects, extend beyond the 1 kpc limit when we assign their random\ndistances). A typical test sample after the separation procedure is shown in Figure 2, where\n5% of the LGD stars and 7.5% of the GB stars have been misclassified, mainly in the zone\nof intersection between the planes. Some isolated stars far away from the mid plane of their\ncorresponding distribution have also been misclassified.\nIn Figure 3 we plot the results of one series of tests of a simulated GB for each of the\nmodel parameters. Each point in the top panel of Figure 3 represents the mean result of the\nfirst iteration procedure for a hundred samples with fixed true parameters (iGB = 17◦ , the\ndashed line in the figure). The initial values introduced at the beginning of the process are\nequal to the true parameters of the synthetic samples, except for the one whose behavior we\nwant to analyze; in this case, iGB . For each of these points we observe that:\n1. Convergence is reached typically in less than 10 iterations, for a precision of 0.01◦.\n2. The mean error of iGB , estimated by the bootstrap procedure, is 0.2◦ , so the number\nof iterations actually needed for a significative convergence is very low.\nWe also observe that the first iterative process leads to an underestimation of the inclination if the initial value is lower than the real one, or to an overestimation if the initial\nvalue is greater the true inclination. A balance is achieved by the reintroduction of the full\nsample for a second iteration under the newly estimated parameters, which leads to a new,\nmore refined detection of the outliers. For instance, for an initial value of iGB = 14◦ , an\ninitial convergence is reached at iGB = 16.4◦ ; introducing iGB = 16.4◦ as the initial value\nleads to a final convergence of iGB = 16.8◦ . Only two steps have been necessary to stabilize\nthe result, this being the typical behavior in all the tests performed.\n\n\f–9–\nSimilar tests for Ω and Z0 are shown in the middle and bottom panels of Figure 3,\nrespectively. While the results for the longitude of the ascending node are even more precise\nthan those obtained for the inclination (convergence is reached at ΩGB = 285◦ ± 1◦ for a\ntrue value of ΩGB = 285◦), an underestimation -in absolute value- of the vertical distance\nto the Sun is observed (convergence is now reached at Z0GB = −6 ± 2 pc for a true value of\nZ0GB = −10 pc). This being the parameter of the plane the most sensible to the dispersion\nof the stars, it seems unavoidable that we must cope with a certain bias in the estimation of\nZ0 . In order to evaluate the magnitude of this systematic difference we have performed some\nadditional tests, whose results are shown in Figure 4. A hundred aleatory samples have been\nbuilt for each value of Z0GB from 0 to 50, then we have run the program to estimate Z0GB\nand its error for each case. We represent their mean values in the figure, from which we can\nsee how the estimation of Z0GB is affected by a systematic bias of around 30%.\nWe must note that similar tests performed systematically for Z0LGD show that there is\nno such a bias in the case of the LGD (or, at least, it is smaller than the random errors\nin the estimation), probably due to its negligible inclination. This points out that it is the\ngeometry of the problem which is responsible for such behavior of our algorithm, and thus\nany pdf that we consider as a model for the vertical distribution of the planes does not alter\nthis bias. We have corroborated that this is true by simulating the LGD and the GB systems\nwith a Gaussian vertical distribution of the stars, and then performing the same tests with\na Gaussian pdf model in our program. The results are consistent with the ones obtained\nworking with exponential distributions, i.e., the LGD shows no significative bias in Z0LGD ,\nand Z0GB is affected by a systematic bias of around 35%.\nWhen the simultaneous convergence of all the parameters (i, Ω, Z0 and h for both\nplanes, and fGB ) is sought, again only about ten iterations for the first loop and two or three\nfor the second loop are needed, thus confirming the stability of the model.\nWe want to remark the importance and the uniqueness of the detection of outliers in\nour procedure. Stars located in the extremes of the sample distribution may have a great\nweight in the estimation of the model parameters, but according to their low probability of\nbelonging to the model distribution, they must be considered as probable outliers and thus\neliminated from the process. This purge of outliers leads to quite robust results, which is\nessential when dealing with a system such as the GB, whose spatial distribution cannot be\ndelimited without a certain degree of uncertainty.\n\n\f– 10 –\n3.\n\nStar sample\n\nWe have selected a star sample from the Hipparcos Catalog (ESA 1997) with spectral\ntypes from O to B6 and luminosity classes III, IV and V. The spectral types listed in the\nHipparcos Catalog are a compilation from different sources; thus, a lack of homogeneity in the\nprecision of the spectral type or the luminosity class may be present in the data. There are\nnot systematic studies devoted to analyze the reliability of the spectral information contained\nin the catalog. The closest work to such an analysis has been performed by Abt (2004), who\nobtained and classified spectra for 584 stars belonging to A supplement to the bright star\ncatalog. The comparison between this classification and that in the Hipparcos Catalog yields\nthat the estimated error in the spectral classification is ±1.2 subtypes, and that a 10% of the\nlisted luminosity classes may be wrong. In this paper, the spectral classification is only used\nas a rough estimate of the stellar ages. Thus, the uncertainties in the spectral classification\nwill not have any influence in the main results of our study.\nFor each star, the following data were chosen:\n• HIP, Hipparcos identifier number.\n• Trigonometric parallax π (mas)\n• Standard error in trigonometric parallax, σπ (mas)\n• Right ascension for the epoch J1991.5 in IRCS (degrees)\n• Declination for the epoch J1991.5 in IRCS (degrees)\nAlso, uvbyβ Strömgren photometry data from the catalog of Hauck & Mermilliod (1998)\nwere used to calculate the photometric distance of every star in the sample through the\nBalona & Shobbrook (1984) calibration.\nSince the relative error (σπ /π) of the distances estimated by Hipparcos parallaxes grows\nwith the trigonometric distance (1/π), we have decided to keep the trigonometric distance for\na star only if the relative error in its parallax is lower or equal to a 10% (which corresponds\napproximately to distances closer than 100 pc from the Sun); otherwise, the photometric\ndistance is chosen. Not only the error in the Strömgren estimation is independent of the\ndistance, but also we can see (Figure 5) that the distribution of photometric distances is very\nsimilar to the distribution of trigonometric ones, and that no systematic trends can be found.\nComparison between the medians of both distance estimations for stars with a relative error\nin their parallaxes lower or equal to a 20% yields a difference between them of merely 1%.\n\n\f– 11 –\nThis is in good agreement with the studies performed by Kaltcheva & Knude (1998), who\nfind no significant difference between Hipparcos trigonometric distances and those obtained\nfrom uvby and Hβ photometry. Thus, we rest assured that the use of Strömgren photometric distances will not harm the precision of our three-dimensional picture of the solar\nneighborhood.\nAs we said, part of our sample has been selected with a relative error in its parallax\nlower or equal to a 10%. While the distance bias due to the non-linear relationship between\nparallax and distance is negligible if σπ /π is smaller than a 10% (Arenou & Luri 1999), the\nLutz-Kelker bias (Lutz & Kelker 1973) caused by truncating a sample based on the observed\nparallax relative error is more difficult to evaluate and depends on the parent population, as\nwell as on the size of the selected subsample. In our case only 28 stars (about a 5% of the\ntotal sample) have been selected by the parallax criterium. Thus, although this part of the\nsample may be affected by the Lutz-Kelker bias, the total sample shows little contamination\nby this effect, so wa can assume that this truncation bias is negligible in our final selection.\nFinally, we have eliminated the stars with an estimated distance greater than 1 kpc,\nbecause, according to results found in the literature, the typical maximum radius of the\nGB is not greater than 700 pc (Stothers & Frogel 1974; Westin 1985; Comerón et al. 1994;\nFernández 2005). The remaining sample is composed of 553 stars; Figure 6 represents their\nspatial distribution projections in the three Cartesian planes XY (top panel), XZ (middle\npanel) and Y Z (bottom panel).\n\n4.\n\nStructural results\n\nWe apply our model to the total star sample, as well as to four cumulative sub-samples\nthat comprise all the spectral types from O to B2, B3, B4 and B5, respectively. In all cases,\nwe find that the distribution of the stars can be satisfactorily described by our model of two\nintersecting planar systems, the GB presenting a remarkable inclination with respect to the\nLGD. While the stars belonging to the latter tend to be homogeneously distributed on the\nXY plane, the former shows a more clumpy, filamentary structure (yet the global inclination\nis maintained across the whole GB system). The numerical results that fit the model planes\nfor the cumulative samples of increasing spectral types are displayed on table 1. We have\nlisted separately the solutions depending on whether an exponential or a Gaussian pdf has\nbeen used.\nWhile some of the model parameters are found to be the same -within the estimated\nerrors- regardless of the employed pdf, others show non negligible differences. Specially,\n\n\f– 12 –\nthe number of outliers and the fraction of stars belonging to the GB system (fGB ) display\nsignificant discrepancies. The number of outliers working with a Gaussian pdf is close to a\n20% of the total sample, meaning that about 100 out of 554 stars have a very low probability\nof belonging either to the GB or to the LGD. This fraction, though, is reduced to a 10%\nwhen an exponential pdf is used. According to these results we consider that our sample\nis better described by an exponential law than by a Gaussian one. We must note that this\ncannot be extrapolated for the GB system as a whole, and thus must be seen only as the\nbest fitting for our observational sample.\nWe find an inclination of the GB between 14◦ ± 1◦ and 17◦ ± 0.3◦ for all the samples,\nexcept for the youngest sub-sample of O-B2 stars, where the range is reduced to iGB =\n16◦ ± 2◦ − 17◦ ± 1◦ ). It's a smaller value than those commonly found in the literature, yet we\nmay compare it with those estimated by Westin (1985) on table 2. In his study he estimates\ntoo a larger inclination for the youngest sample (albeit 2◦ larger than that found for our\nsub-sample with the earliest spectral types). Moreover, his result for the sample ranging\nfrom 30 to 60 Myr matches the inclination of 14◦ found for our later spectral types. Also,\nTorra et al. (2000a,b), from a sample of Hipparcos OB stars with Strömgren photometric\ndistances, estimate an inclination of 22◦ for stars younger than 30 Myr, and an inclination\nof 16◦ for stars in the range of 30 to 60 Myr. It's worth noting that in the earlier work of\n(Stothers & Frogel 1974), iGB = 18◦ ± 0.4◦ for their O-B5 sample, and iGB = 19◦ ± 1◦ for an\nO-B2.5 subsample, yet they find for stars in a range of spectral types from B3 to B5 that\niGB = 16◦ ± 1◦ .\nComparing the values that we estimate for ΩGB , we see that they are in very good\nagreement with those of Westin (1985). The earlier spectral types present a smaller value of\nΩGB , similar to that found by Westin (1985) for the youngest samples, while his result for\nthe oldest age groups matches those we obtain when later spectral types are included. The\nvalues of ΩGB = 275◦ − 295◦ (depending on the sample age) found by Torra et al. (2000a,b)\nare also in good agreement with our results. Other similar values were estimated by Torra\net al. (1997), ΩGB = 278◦ − 290◦ , and Comerón et al. (1994), ΩGB = 284.5◦ , from OB stars\nof the Hipparcos proposal.\nEven though there's agreement in most of the estimations made by different authors of\nthe GB geometrical parameters around a certain range of values, it is true that this range\nis sometimes quite large (for instance, iGB ≈ 14◦ - 22◦ ). We shall venture that this isn't\nonly caused by the choice of different ages, spectral types or heliocentric distance limits\nof the star samples, but that the presence of outliers in those samples may seriously be\naffecting the results. It is perfectly possible that the weight of only a few stars with a\nlow membership probability to the distribution sensibly alters the estimation, leading to\n\n\f– 13 –\n\nTable 1. Estimated parameters of the GB and the LGD planes\n\nSp\n\nN\n\nhGB\n(pc)\n\nhLGD\n(pc)\n\nN′\n\nn\n\n162\n267\n303\n433\n498\n\n3\n2\n3\n1\n1\n\n0.53\n0.54\n0.54\n0.54\n0.54\n\n(0.06)\n(0.05)\n(0.05)\n(0.05)\n(0.05)\n\n27\n27\n27\n27\n27\n\n(4)\n(3)\n(3)\n(3)\n(3)\n\n34\n34\n35\n35\n34\n\n(3)\n(2)\n(2)\n(2)\n(2)\n\n144\n247\n279\n396\n454\n\n3\n5\n2\n4\n4\n\n0.54\n0.49\n0.48\n0.40\n0.37\n\n(0.06)\n(0.05)\n(0.06)\n(0.04)\n(0.03)\n\n18\n18\n18\n15\n13\n\n(3)\n(2)\n(2)\n(1)\n(1)\n\n23\n27\n28\n30\n30\n\n(3)\n(2)\n(2)\n(2)\n(2)\n\nfGB\n\niGB\n(◦ )\n\nΩGB\n(◦ )\n\niLGD\n(◦ )\n\nΩLGD\n(◦ )\n\nZ0GB\n(pc)\n\nZ0LGD\n(pc)\n\nExponential pdf:\nO-B2\nO-B3\nO-B4\nO-B5\nO-B6\n\n181\n301\n341\n484\n553\n\n16\n14\n14\n14\n14\n\n(2)\n(1)\n(1)\n(1)\n(1)\n\n2\n2\n2\n1\n1\n\n(1)\n(1)\n(1)\n(1)\n(1)\n\n273\n278\n281\n284\n284\n\n(7)\n(5)\n(5)\n(3)\n(3)\n\n354\n352\n354\n356\n355\n\n(165)\n(152)\n(154)\n(156)\n(149)\n\n1\n1\n1\n1\n1\n\n(1)\n(1)\n(1)\n(1)\n(1)\n\n277\n280\n280\n282\n284\n\n(5)\n(3)\n(4)\n(2)\n(2)\n\n346 (147)\n342 (126)\n342 (116)\n327 (78)\n321 (58)\n\n-14 (8)\n-19 (10)\n-17 (9)\n-13 (5)\n-13 (6)\n\n-10\n-10\n-17\n-17\n-16\n\n(8)\n(8)\n(7)\n(5)\n(5)\n\n-10\n-12\n-14\n-15\n-16\n\n(5)\n(4)\n(4)\n(3)\n(3)\n\nGaussian pdf:\nO-B2\nO-B3\nO-B4\nO-B5\nO-B6\n\n181\n301\n341\n484\n553\n\n17 (1)\n16 (1)\n16 (1)\n17 (0.4)\n17 (0.3)\n\n-4\n-6\n-7\n-8\n-5\n\n(5)\n(5)\n(3)\n(3)\n(3)\n\nNote. - Sp stands for the spectral types comprised in each cumulative sample, N gives the initial sample size, N ′ is the\nnumber of stars remaining in the sample after the elimination of outliers and n is the number of iterations in the second\nloop needed to reach convergence (it must be noted that the initial values of the parameters given to the algorithm are the\nones obtained as a result from the previous subsample, except in the O-B2 case). It must be also noted that h stands for\nboth the scale height of the exponential model, and for the half-width of the Gaussian pdf solution. Errors estimated by\nbootstrap are given in parentheses.\n\nTable 2. GB plane parameters for samples of different age, from Westin (1985)\nSample Age\n(yr)\n\niGB\n(◦ )\n\nΩGB\n(◦ )\n\n< 2 * 107\n< 3 * 107\n(3 − 6) * 107\n\n18.9 ± 1.1\n18.1 ± 0.9\n14.3 ± 2.0\n\n273.2 ± 3.1\n270.9 ± 4.3\n286.2 ± 5.7\n\n\f– 14 –\nunrealistic values of the parameters. Since the \"limits\" of the GB constitute a very diffuse\nzone whose boundaries cannot be easily defined, we consider that unless outliers are purged\nit is not possible to characterize its spatial distribution with confidence enough as to define\nthe series of parameters (such as the inclination or the longitude of the ascending node) that\nare usually employed to describe its geometry.\nOur model also gives an estimation of the Sun's distance to the Galactic plane, which\noscillates between 10 ± 8 pc (for the O-B2 and O-B3 subsamples) and 17 ± 7/5 pc (for\nthe O-B4 and O-B5 subsamples, respectively). Although this parameter is biased, as we\nhad already foreseen in the simulations testing the model (the bottom panel of Figure 3, and\nFigure 4, perfectly illustrate that), the raw values we obtain are compatible with those found\nby Humpreys & Larsen (1995) from the Palomar Sky Survey star counts (Z⊙ = 20.5±3.5 pc),\nby Hammersley et al. (1995) from 2.2μm and 3.5μm maps by the DIRBE instrument of the\nCOBE satellite and the Two-Micron Galactic Survey (Z⊙ = 15.5 ±3 pc), or by Cohen (1995)\nfrom the IRAS Point Source Catalog in 12μm and 25μm (Z⊙ = 15.5 ± 0.7 pc). However,\nthe mean age of these catalogs is much older than the young LGD we are dealing with in\nthis work.\nThe comparisons of the O-B5 subsample with the analysis of a star sample of the same\nspectral types by Stothers & Frogel (1974), who choose an exponential-type scale height\nmodel, show an even better match with our results. They find that Z⊙ = 24 ± 3 pc and that\n-in the sphere of 200 pc around the Sun- the scale height of the LGD is hLGD = 45 ± 18 pc.\nTheir estimation of the scale height of the GB, hGB = 27 ± 4 for stars closer than 200 pc and\nhGB = 27 ± 1 for stars closer than 800 pc, is in perfect agreement with our results. A more\nrecent study on the disk O-B5 stellar population by Maı́z-Apellániz (2001), using a highly\ndeveloped Gaussian model, concludes that Z⊙ = 25.2 ± 2.0 pc and hLGD = 62.8 ± 6.4 pc.\nAlso, working with a self-gravitating isothermal disk model, he finds that Z⊙ = 24.2 ± 2.1\npc and hLGD = 34.2 ± 3.3 pc, the latter value matching almost exactly our estimation of\nhLGD = 35 ± 2 for the O-B5 subsample with an exponential model. It is worth noting too\nthat our earlier O-B2 subsample yields similar results to those obtained by Reed (1997, 2000)\nfor an O-B2 disk using also an exponential model (hLGD = 45 ± 20 pc, Z⊙ = 9.5 ± 3.5 pc).\nWe also estimate a small inclination for the LGD between 1◦ ± 1◦ and 2◦ ± 1◦ , which\n-although its high uncertainty points out that it isn't a very significative value- is somewhat\ngreater than that by Hammersley et al. (1995) of 0◦ .40 ± 0◦ .03. It is small enough, though,\nto make ΩLGD remain not well defined, hence the large (150◦ − 160◦ ) uncertainty that we\nshould expect for pure geometrical reasons when iLGD is close to zero, as it is the case.\nFigure 7 displays the three possible projections for the classified O-B2 sub-sample (left\npanels) and the complete O-B6 sample (right panels) for the exponential pdf solution. The\n\n\f– 15 –\ninclination of the GB is clearly seen in the XZ plane (middle panels); it is also interesting to\nobserve the irregular spatial distribution of the GB in the XY plane (top panels) presenting\nclustering and filamentary structures, in contrast with the more homogeneous LGD distribution. That is better seen in Figure 8, where the spatial density distribution of both systems\nhas been plotted. Note the clustering of the GB density distribution (left panel), the most\nprominent feature being located in the Orion region in the third Galactic quadrant.\n\n5.\n\nCorrection of completeness\n\nThe spatial density distribution of the LGD shows that the star density decreases with\nthe increasing distance to the Sun, as we may see in the right panel of Figure 8. Certainly,\nsuch a distribution is not what we should expect on this region of the solar neighborhood.\nIf we assume that on this scale the LGD should present a homogeneous star density, it is\nevident that what we observe in the figure is due to the incompleteness of our sample. Thus,\nunder this hyphotesis, we can use the two-dimensional density of the LGD as a measure of\nthe star field incompleteness in the working region. This density map may be seen as a sort\nof \"flat field\" used for completeness correction, that will allow us to improve the structural\nanalysis of the GB.\nWe have to note, though, that the interstellar medium extinction pattern may also be\nplaying an important role in the modulation of the observed density structure. While the\neffect of distance on the incompleteness of the sample is indistinctly reflected on the density\ncorrection for the GB and the LGD, the extinction pattern could show different features for\nboth systems. Thus, this \"flat field\" correction must be considered as a first approach to the\nproblem of incompleteness, and not as a definitive solution. However, the main properties of\nthe dust distribution in the solar neighborhood (see Pöppel 1997 for a detailed discussion)\nmakes us confident in the reliability of this approach.\n\n5.1.\n\nModel parameters\n\nDividing the GB star density by the LGD star density would be enough to provide a\nrelative density that would enhance the structures that belong solely to the GB, but we can\ntake a further step and introduce this correction in our model. We thus modulate the weight\nof any star (which originally was the probability of belonging to the correspondent plane)\nby a completeness function that simply is the inverse of the LGD star density in the (x, y)\nposition of the star, evaluated by a Gaussian kernel.\n\n\f– 16 –\nFollowing again the iterative process for the O-B6 full sample with an exponential pdf\nmodel, we reach convergence in the following values:\n• fGB = 0.58 ± 0.06\n• hGB = 31 ± 4 pc\n• hLGD = 34 ± 5 pc\n• iGB = 14◦ ± 1◦\n• iLGD = 2◦ ± 2◦\n• ΩGB = 287◦ ± 6◦\n• ΩLGD = 352◦ ± 28◦\n• Z0GB = −15 ± 12 pc\n• Z0LGD = −12 ± 12 pc\nWe observe that, within the error margin, the results are similar to those we had previously obtained (table 1). This indicates that even with an incomplete sample, the structural\nresults estimated by our model are still valid.\n\n5.2.\n\nSpatial structure\n\nIn Figure 9 we draw the nearest OB associations over the star density maps of the GB.\nAs we see, the correction of completeness removes the contribution to the central peak by\nthe effect of the decreasing star density with the heliocentric distance, allowing the region\naround Scorpio to stand by itself. Also, the Orion peak moves farther away, towards the\nposition of Ori OB1.\nIt is important to note that this is the first time that a correction of completeness has\nbeen implemented in order to compensate for the always incomplete samples constructed\nto study the spatial distribution of the GB. No significant difference can be found in the\nestimation of the GB structural parameters, even though the new density map of its spatial\ndistribution (Figure 9, right panel) shows important modifications of the original distribution (Figure 9, left panel) in the XY plane. This is probably due to the geometry of the\nsystem, dominated by the GB's inclination with respect to the Galactic plane (hence, the\n\n\f– 17 –\nZ vertical distribution playing a fundamental role) and by the outer parts of the structure,\nbetter separated from the LGD. Nonetheless, the completeness correction is tremendously\nreassuring if we consider the difficulty of gathering a complete enough sample of GB stars,\nand it lets us look confidently at our results. It also provides a most interesting picture of the\neffects of incompleteness on the clumpy XY distribution of the GB, and its correspondence\nwith OB associations.\n\n5.3.\n\nAssociations\n\nSince the work by Blaauw (1965), it is known that the young associations Sco-Cen, Per\nOB2, and Ori OB1 are part of the GB, while the field members could have originated from\nthe disruption of oldest groups (Pöppel 1997). In fact, these three groups are well inside\nthe typical radius of the GB, but most of the associations found within 1 kpc in the radius\naround the Sun seem to be out of the classical borders of the belt.\nAfter the flat fielding correction of the density map of the GB, we observe how new\nclumps appeared (Fig. 9, right panel). Within the uncertainty in the estimated distances of\nthe associations, these clumps can be linked to well known and cataloged associations (e.g.\nde Zeeuw et al 1999). The GB membership of the associations is not only defined by the\nposition of the centroid (a single point), but by a relative maximum in the stellar density\npattern of the GB. Thus, young associations as Cam OB1, Lac OB1, Col 121 and a clump\n(at X = 0, Y ∼ −600 pc) that's connected to the Vela rift are likely GB members, extending\nthe GB frontiers to larger distances.\nPerhaps the most striking result is the inclusion of some Vela groups as probable GB\nmembers. We wonder -after a suggestion from the referee- if this presence could be a spurious\neffect generated by the \"flat field\" correction due to a different reddening pattern in the GB\nand the LGD. However, Vela is located close to the line of nodes in which the GB and the\nLGD coexist. Thus, the dust distribution is probably shared in this region by both systems,\nso it is not likely that it is responsible for the introduction of this maximum.\n\n6.\n\nConclusions\n\nWe have developed a new three-dimensional spatial classification method to estimate the\nstructure of the GB and the LGD, working with single star membership probabilities. This\nmethod, although based in a model of two planar intersecting systems, allows for a greater\nvariety of spatial configurations than other classification techniques found in literature, which\n\n\f– 18 –\nis helpful in order to understand the complex structure of the GB. We have tested this\nmethod with artificial samples, and then we have applied it to a true sample of OB stars in\nthe sphere of 1 kpc around the Sun. As a result, we have obtained that the distribution of\nyoung stars in the solar neighborhood is dominated by two different systems: the LGD and\nthe inclined structure of the GB. Our hypothesis of two intersecting disks has been quite\neffective in order to characterize both systems for their study, and although we have found\nthat the GB is a clumpy, filamentary structure, we have successfully estimated through our\nmodel the geometrical parameters of the GB and the LGD, which are in good agreement\nwith earlier estimations by other authors. The inclination of the GB is found to be between\niGB = 14◦ − 17◦ .\nAlso, a completeness correction has demonstrated that the estimation of the global\nparameters that define our GB model were not affected by the decrease of the star density\nwith the heliocentric distance, providing robust parameter estimators. Yet this correction\neffectively refines the projected spatial density distribution of the GB on the XY plane,\nremoving false substructures and enhancing the true ones, some of which we may relate to\nthe nearby OB associations.\nWe want to thank the referee, Jesús Maı́z Apellániz, for his very sharp and useful\ncomments that were very helpful in order to improve the scientific content of this paper. F.E.\nwants to thank the Departamento de Fı́sica Atómica, Molecular y Nuclear of the Universidad\nde Sevilla for its support during this work. We would also like to acknowledge the funding\nfrom MCEyD of Spain through grants AYA2004-05395, and AYA2004-08260-C03-02, and\nfrom Consejerı́a de Educación y Ciencia (Junta de Andalucı́a) through TIC-101.\n\nREFERENCES\nAbt, H.A. 2004, ApJS, 155, 175\nArenou, F., & Luri, X. 1999, ASPC, 167, 13\nBahcall, J.N., & Soneira, R.M. 1984, ApJS, 55, 67\nBalona, B.A., & Shobbrook, R.R. 1984, MNRAS, 211, 375\nBlaauw, A. 1965, Koninkl. Ned. Akad. Wetenschap., 74, No. 4\nCabrera-Caño, J., & Alfaro, E.J. 1985, A&A, 150, 298\nCabrera-Caño, J., & Alfaro, E.J. 1990, A&A, 235, 94\n\n\f– 19 –\nChen, B., et al. 2001, ApJ, 553, 184\nCohen, M. 1995, ApJ, 444, 874\nComerón, F., Torra, J., & Gómez, A.E. 1994, A&A, 286, 789\nDame, T.M., et al. 1987 ApJ, 322, 706\nde Zeeuw, P.T., Hoogerwerf, R., de Bruijne, J.H.J., Brown, A.G.A., & Blaauw, A. 1999, AJ,\n117, 354\nEfremov, Yu. N. 1978, SvAL, 4, 66\nEfremov, Yu. N. 1995, AJ, 110, 2757\nElmegreen, B.G., Efremov, Y., Pudritz, R.E., & Zinnecker, H. 2000, in Protostars and\nPlanets IV, eds. V. Mannings, A.P. Boss, S.S. Russell, Tucson: University of Arizona\nPress\nESA 1997, The Hipparcos and Tycho Catalogs, ESA SP-1200\nFernández, D. 2005, PhD Thesis, Universitat de Barcelona, Spain\nGaustad, J.E., & Van Buren, D. 1993, PASP, 105, 1127\nGilmore, G. 1984, MNRAS, 207, 223\nGould, B.A. 1879, Uranometrı́a Argentina, Result. Obs. Nac. Argentino, I, p. 354\nGrenier, I. A. 2004, preprint (astro-ph/9096)\nHammersley, P.L., Garzon, F., Mahoney, T., & Calbet, X. 1995, MNRAS, 273, 206\nHauck, B., & Mermilliod, M. 1998, A&AS, 129, 431\nHerschel, J.F.W. 1847, Results of Astron. Observations made during the years 1834-1838 at\nthe Cape of Good Hope, London\nHumpreys, R.M., & Larsen, J.A. 1995, AJ, 110, 218\nKaltcheva, N., & Knude, J. 1998, A&A, 337, 178\nLesh, R.J. 1968, ApJS, 17, 371\nLindblad, P.O. 1967, BAN, 19, 34\n\n\f– 20 –\nLindblad, P.O., Grape, K., Sandqvist, A., & Schober, J. 1973, A&A, 24, 309\nLindblad, P.O., Palouš, J., Lodén, K., & Lindegren, L. 1997, in Hipparcos Venice '97, ed. B.\nBattrick (ESA SP-402) (Noordwijk: ESA), 507\nLutz, T.E. & Kelker, D.H., 1973, PASP, 85, 573\nMaı́z-Apellániz, J. 2001, AJ, 121, 2737\nMoreno, E., Alfaro, E.J., & Franco, J. 1999, ApJ, 522, 276\nPellegatti Franco, G. A. 1983, Ap&SS, 96, 195\nPöppel, W. 1997, FCPh, 18, 1\nReed, B.C. 1997, PASP, 109, 1145\nReed, B.C. 2000, AJ, 120, 314\nStothers, R., & Frogel, J.A. 1974, AJ, 79, 456\nStruve, F.G.W. 1847, études d'Astronomie Stellaire: Sur la Voie Lactée et sur la distance\ndes étoiles fixes, St. Petersburg\nTorra, J., Gómez, A.E., Figueras, F., Comerón, F., Grenier, S., Mennessier, M.O., Mestres,\nM., & Fernández, D. 1997, in Hipparcos Venice '97, ed. B. Battrick (ESA SP-402)\n(Noordwijk: ESA), 513\nTorra, J., Fernández, D., & Figueras, F. 2000, A&A, 359, 82\nTorra, J., Fernández, D., Figueras, F., & Comerón, F. 2000, Ap&SS, 272, 109\nWestin, T.N.G. 1985, A&AS, 60, 99\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 21 –\n\nFig. 1.- Geometrical scheme of the two intersecting planes model. See the text for explanation of the symbols.\n\n\f– 22 –\n\n400\n\n300\n\nStars correctly classified as GB members\nStars correctly classified as LGD members\nLGD stars classified incorrectly as GB members\nGB stars classified incorrectly as LGD members\n\n200\n\n100\n\nZ\n\n0\n\n−100\n\n−200\n\n−300\n\n−400\n−1000\n\n−800\n\n−600\n\n−400\n\n−200\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nX\n\nFig. 2.- Classification of a synthetic sample of stars with parameters iGB = 17◦ , ΩGB = 285◦\nand Z0GB = −10\n\n\fEstimated i (o)\n\n– 23 –\n\n18\n17.5\n17\n16.5\n16\n\n14\n\n15\n\n16\n\n17\n\nEstimated Ω (o)\n\nInitial\n\n19\n\n20\n\n290\n\n295\n\n300\n\n288\n286\n284\n282\n270\n\n275\n\n280\n\n285\n\nInitial\nEstimated Zo\n\n18\n\ni (o)\n\nΩ (o)\n\n−4\n−6\n−8\n−10\n−20\n\n−18\n\n−16\n\n−14\n\n−12\n\n−10\n\nInitial\n\n−8\n\n−6\n\n−4\n\n−2\n\n0\n\nZo\n\nFig. 3.- Estimation tests for a synthetic GB with the same parameter values as in Figure 1\n(marked here by dashed lines). Each point represents the mean estimation of 100 tests with\nthe correspondent initial value\n\n\f– 24 –\n\n0\n\nEstimated Z\n\n0\n\n−10\n\n−20\n\n−30\n\n−40\n\n−50\n\n−50\n\n−40\n\n−30\n−20\nZ of the sample\n\n−10\n\n0\n\n0\n\nFig. 4.- Estimation tests for a synthetic GB with different values of Z0 . Each point\nrepresents the mean estimation of 100 tests with the correspondent true value of the sample\n\n\f– 25 –\n\n1000\n\nHeliocentric distance (pc)\n\n900\n800\n700\n600\n500\n400\n300\n200\n100\n0\nT\n\nP\n\nFig. 5.- Boxplot comparison between Hipparcos trigonometric distances (T) and photometric distances in the Strömgren system (P) for stars with a relative error in the parallax\nlower or equal to a 20%\n\n\f– 26 –\n1000\n\nY (pc)\n\n500\n\n0\n\n−500\n\n−1000\n−1000\n\n−500\n\n0\n\n500\n\n1000\n\nX (pc)\n\nZ (pc)\n\n500\n\n0\n\n−500\n−1000\n\n−500\n\n0\n\n500\n\n1000\n\n500\n\n1000\n\nX (pc)\n\nZ (pc)\n\n500\n\n0\n\n−500\n−1000\n\n−500\n\n0\n\nY (pc)\n\nFig. 6.- Spatial projections of the star sample\n\n\f– 27 –\n\n500\n\n500\n\nY (pc)\n\n1000\n\nY (pc)\n\n1000\n\n0\n\n−500\n\n−1000\n−1000\n\n0\n\n−500\n\n−500\n\n0\n\n500\n\n−1000\n−1000\n\n1000\n\n−500\n\nX (pc)\n\nZ (pc)\n\nZ (pc)\n\n0\n\n−500\n\n0\n\n500\n\n−500\n−1000\n\n1000\n\n−500\n\n0\n\n500\n\n1000\n\n500\n\n1000\n\nX (pc)\n\n500\n\nZ (pc)\n\n500\n\nZ (pc)\n\n1000\n\n0\n\nX (pc)\n\n0\n\n−500\n−1000\n\n500\n\n500\n\n500\n\n−500\n−1000\n\n0\n\nX (pc)\n\n−500\n\n0\n\nY (pc)\n\n500\n\n1000\n\n0\n\n−500\n−1000\n\n−500\n\n0\n\nY (pc)\n\nFig. 7.- Classified O-B2 sub-sample (left) and full O-B6 sample (right). Black circles\nrepresent the LGD and open squares, the GB.\n\n\f1000\n\n1000\n\n500\n\n500\n\nY (pc)\n\nY (pc)\n\n– 28 –\n\n0\n\n−500\n\n−1000\n−1000\n\n0\n\n−500\n\n−500\n\n0\n\nX (pc)\n\n500\n\n1000\n\n−1000\n−1000\n\n−500\n\n0\n\n500\n\n1000\n\nX (pc)\n\nFig. 8.- Spatial star density of the GB (left) and the LGD (right) for the classified full\nsample.\n\nFig. 9.- Spatial star density of the GB before (left) and after (right) the completeness\ncorrection. The circles represent the pre-Hipparcos OB associations, as listed by de Zeeuw et\nal. (1999). The letters stand for: Sco OB21 (S1), Sco OB22 (S2), Sco OB23 (S3), Sco OB24\n(S4), Sco OB25 (S5), Col 121 (Co), Ori OB1 (O), Mon OB1 (M), Per OB2 (P), α Per (α),\nCam OB1 (Ca), Lac OB1 (L), Cep OB2 (C2), Cep OB3 (C3), Cep OB4 (C4), Sct OB2 (Sc)\n\n\f"}