{"id": "http://arxiv.org/abs/astro-ph/0607624v2", "guidislink": true, "updated": "2006-08-01T22:36:05Z", "updated_parsed": [2006, 8, 1, 22, 36, 5, 1, 213, 0], "published": "2006-07-27T18:33:57Z", "published_parsed": [2006, 7, 27, 18, 33, 57, 3, 208, 0], "title": "X-ray binaries", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0607173%2Castro-ph%2F0607215%2Castro-ph%2F0607555%2Castro-ph%2F0607127%2Castro-ph%2F0607195%2Castro-ph%2F0607009%2Castro-ph%2F0607071%2Castro-ph%2F0607519%2Castro-ph%2F0607089%2Castro-ph%2F0607525%2Castro-ph%2F0607048%2Castro-ph%2F0607199%2Castro-ph%2F0607203%2Castro-ph%2F0607624%2Castro-ph%2F0607588%2Castro-ph%2F0607185%2Castro-ph%2F0607092%2Castro-ph%2F0607465%2Castro-ph%2F0607397%2Castro-ph%2F0607101%2Castro-ph%2F0607083%2Castro-ph%2F0607326%2Castro-ph%2F0607031%2Castro-ph%2F0607211%2Castro-ph%2F0607417%2Castro-ph%2F0607097%2Castro-ph%2F0607055%2Castro-ph%2F0607018%2Castro-ph%2F0607122%2Castro-ph%2F0607180%2Castro-ph%2F0607360%2Castro-ph%2F0607489%2Castro-ph%2F0607132%2Castro-ph%2F0607387%2Castro-ph%2F0607452%2Castro-ph%2F0607225%2Castro-ph%2F0607598%2Castro-ph%2F0607305%2Castro-ph%2F0607552%2Castro-ph%2F0607472%2Castro-ph%2F0607497%2Castro-ph%2F0607461%2Castro-ph%2F0607547%2Castro-ph%2F0607291%2Castro-ph%2F0607312%2Castro-ph%2F0607343%2Castro-ph%2F0607394%2Castro-ph%2F0607405%2Castro-ph%2F0607655%2Castro-ph%2F0607428%2Castro-ph%2F0607062%2Castro-ph%2F0607539%2Castro-ph%2F0607090%2Castro-ph%2F0607153%2Castro-ph%2F0607545%2Castro-ph%2F0607317%2Castro-ph%2F0607229%2Castro-ph%2F0607646%2Castro-ph%2F0607146%2Castro-ph%2F0607560%2Castro-ph%2F0607578%2Castro-ph%2F0607223%2Castro-ph%2F0607271%2Castro-ph%2F0607579%2Castro-ph%2F0607490%2Castro-ph%2F0607188%2Castro-ph%2F0607352%2Castro-ph%2F0607382%2Castro-ph%2F0607571%2Castro-ph%2F0607391%2Castro-ph%2F0607611%2Castro-ph%2F0607626%2Castro-ph%2F0607573%2Castro-ph%2F0607538%2Castro-ph%2F0607559%2Castro-ph%2F0607263%2Castro-ph%2F0607070%2Castro-ph%2F0607324%2Castro-ph%2F0607496%2Castro-ph%2F0607054%2Castro-ph%2F0607178%2Castro-ph%2F0607154%2Castro-ph%2F0607554%2Castro-ph%2F0607605%2Castro-ph%2F0607674%2Castro-ph%2F0607065%2Castro-ph%2F0607252%2Castro-ph%2F0607214%2Castro-ph%2F0607098%2Castro-ph%2F0607104%2Castro-ph%2F0607535%2Castro-ph%2F0607540%2Castro-ph%2F0607451%2Castro-ph%2F0607314%2Castro-ph%2F0607474%2Castro-ph%2F0607431%2Castro-ph%2F0607445%2Castro-ph%2F0607610%2Castro-ph%2F0607524%2Castro-ph%2F0607529%2Castro-ph%2F0607161&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "X-ray binaries"}, "summary": "We review the nuclear astrophysics aspects of accreting neutron stars in\nX-ray binaries. We summarize open astrophysical questions in light of recent\nobservations and their relation to the underlying nuclear physics. Recent\nprogress in the understanding of the nuclear physics, especially of X-ray\nbursts, is also discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0607173%2Castro-ph%2F0607215%2Castro-ph%2F0607555%2Castro-ph%2F0607127%2Castro-ph%2F0607195%2Castro-ph%2F0607009%2Castro-ph%2F0607071%2Castro-ph%2F0607519%2Castro-ph%2F0607089%2Castro-ph%2F0607525%2Castro-ph%2F0607048%2Castro-ph%2F0607199%2Castro-ph%2F0607203%2Castro-ph%2F0607624%2Castro-ph%2F0607588%2Castro-ph%2F0607185%2Castro-ph%2F0607092%2Castro-ph%2F0607465%2Castro-ph%2F0607397%2Castro-ph%2F0607101%2Castro-ph%2F0607083%2Castro-ph%2F0607326%2Castro-ph%2F0607031%2Castro-ph%2F0607211%2Castro-ph%2F0607417%2Castro-ph%2F0607097%2Castro-ph%2F0607055%2Castro-ph%2F0607018%2Castro-ph%2F0607122%2Castro-ph%2F0607180%2Castro-ph%2F0607360%2Castro-ph%2F0607489%2Castro-ph%2F0607132%2Castro-ph%2F0607387%2Castro-ph%2F0607452%2Castro-ph%2F0607225%2Castro-ph%2F0607598%2Castro-ph%2F0607305%2Castro-ph%2F0607552%2Castro-ph%2F0607472%2Castro-ph%2F0607497%2Castro-ph%2F0607461%2Castro-ph%2F0607547%2Castro-ph%2F0607291%2Castro-ph%2F0607312%2Castro-ph%2F0607343%2Castro-ph%2F0607394%2Castro-ph%2F0607405%2Castro-ph%2F0607655%2Castro-ph%2F0607428%2Castro-ph%2F0607062%2Castro-ph%2F0607539%2Castro-ph%2F0607090%2Castro-ph%2F0607153%2Castro-ph%2F0607545%2Castro-ph%2F0607317%2Castro-ph%2F0607229%2Castro-ph%2F0607646%2Castro-ph%2F0607146%2Castro-ph%2F0607560%2Castro-ph%2F0607578%2Castro-ph%2F0607223%2Castro-ph%2F0607271%2Castro-ph%2F0607579%2Castro-ph%2F0607490%2Castro-ph%2F0607188%2Castro-ph%2F0607352%2Castro-ph%2F0607382%2Castro-ph%2F0607571%2Castro-ph%2F0607391%2Castro-ph%2F0607611%2Castro-ph%2F0607626%2Castro-ph%2F0607573%2Castro-ph%2F0607538%2Castro-ph%2F0607559%2Castro-ph%2F0607263%2Castro-ph%2F0607070%2Castro-ph%2F0607324%2Castro-ph%2F0607496%2Castro-ph%2F0607054%2Castro-ph%2F0607178%2Castro-ph%2F0607154%2Castro-ph%2F0607554%2Castro-ph%2F0607605%2Castro-ph%2F0607674%2Castro-ph%2F0607065%2Castro-ph%2F0607252%2Castro-ph%2F0607214%2Castro-ph%2F0607098%2Castro-ph%2F0607104%2Castro-ph%2F0607535%2Castro-ph%2F0607540%2Castro-ph%2F0607451%2Castro-ph%2F0607314%2Castro-ph%2F0607474%2Castro-ph%2F0607431%2Castro-ph%2F0607445%2Castro-ph%2F0607610%2Castro-ph%2F0607524%2Castro-ph%2F0607529%2Castro-ph%2F0607161&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We review the nuclear astrophysics aspects of accreting neutron stars in\nX-ray binaries. We summarize open astrophysical questions in light of recent\nobservations and their relation to the underlying nuclear physics. Recent\nprogress in the understanding of the nuclear physics, especially of X-ray\nbursts, is also discussed."}, "authors": ["H. Schatz", "K. E. Rehm"], "author_detail": {"name": "K. E. Rehm"}, "author": "K. E. Rehm", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysa.2005.05.200", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0607624v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0607624v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "23 pages, 1 figure, to appear in Nucl. Phys. A; updated to include\n  discussion of astro-ph/0511247 which appeared after submission to NPA (v2)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0607624v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0607624v2", "journal_reference": "Nucl.Phys. A777 (2006) 601-622", "doi": "10.1016/j.nuclphysa.2005.05.200", "fulltext": "arXiv:astro-ph/0607624v2 1 Aug 2006\n\n1\n\nX-ray binaries\nH. SCHATZ\n\na\n\nand K. E. REHM\n\nb\n\na\n\nNational Superconducting Cyclotron Laboratory\nDept. of Physics and Astronomy\nJoint Institute for Nuclear Astrophysics\nMichigan State University\nEast Lansing, MI 48824\nb\n\nPhysics Division\nArgonne National Laboratory\n1. Introduction\nX-ray binaries are among the brightest extra-solar objects in the sky and are characterized by dramatic variabilities in brightness on timescales ranging from milliseconds to\nmonths and years. Their main source of power is the gravitational energy released by\nmatter accreted from a companion star and falling onto a neutron star or a black hole\nin a close binary system. X-ray binaries therefore serve as rich sources of information\nabout compact stellar objects, and, once understood, could be used as unique natural\nlaboratories for the properties of matter under extreme conditions.\nIn recent years, the launching of a number of X-ray observatories has marked the beginning of a new era in X-ray astronomy. These include Beppo SAX, RXTE, Chandra X-ray\nobservatory and XMM-Newton. These facilities provide(d) unprecedented sensitivity, allsky coverage, and timing resolution and led to a range of new discoveries related to X-ray\nbinaries, such as ms-oscillations, superbursts, and quiescent luminosity measurements in\ntransients. Similar advances in the underlying nuclear physics are now needed to make full\nuse of these observations towards a better understanding of the physics of X-ray binaries,\nand to solve the many open questions. In this review we concentrate on accreting neutron\nstar systems, where observables are to a large extent governed by nuclear physics. For\nsome recent reviews see Psaltis 2004 [1] or Strohmayer & Bildsten 2003 [2].\nIn section 2 we summarize recent observational results, open questions, and their relation to the underlying nuclear physics. In section 3 we summarize the current status of\nthe nuclear physics, identify the major uncertainties, and give an outlook on the role that\nfuture radioactive beam facilities such as RIA can play in this field.\n2. Nuclear processes and their observables\nA fluid element consisting of hydrogen and helium that is accreted onto the surface\nof a neutron star is continuously compressed by the matter accumulating on top of it.\n\n\f2\nEventually the element will become part of the liquid ocean and later of the solid crust\nof the neutron star. The thin outer crust of a neutron star represents just ≈ 10−4 M⊙ of\nmaterial. At typical accretion rates of 10−8 -10−10 M⊙ /yr this material is therefore replaced\nafter about 104 -106 years of accretion. This is short compared to the duration of the mass\ntransfer phase in low mass X-ray binaries. Therefore the majority of neutron stars in low\nmass X-ray binaries should have an accreted crust.\nOn its journey into the neutron star interior the accreted fluid element undergoes a\nsequence of nuclear processes converting hydrogen and helium into exotic nuclei ranging\nfrom the proton drip line during X-ray bursts to the neutron drip line upon entering the\ninner crust. These processes together with their relation to observations and current open\nquestions are discussed in the following subsections in the order they occur. The ashes\nof each process form the initial composition for the next, and the energy release of a\nnuclear process deep in the crust sets the thermal environment for the surface processes.\nTherefore, all processes are connected and need to be understood in a selfconsistent way.\n2.1. Spectral features and spallation of metals\nDuring the 10-100 s of an X-ray burst (see Sec. 2.2) the X-ray flux is dominated by\nthermal emission from the dramatically heated neutron star photosphere. This offers the\nopportunity to obtain compositional information from absorption features in the X-ray\nspectrum. In addition, observed spectral features allow one to determine the gravitational\nredshift on the neutron star surface and therefore the compactness (mass/radius) of the\nneutron star.\nSome observations of a ≈ 4 keV absorption feature have been reported over the last\n20 years for various systems (see recent review in Bildsten, Chang, and Paerels 2003 [3]).\nMore recently, Cottam, Paerels, and Mendez 2002 [4], reported the detection of hydrogen\nand helium like Fe absorption lines and derive a redshift of Z = 0.35 for the neutron star\nin EXO 0748-676. This has provided an important constraint for the neutron star mass\nradius relation and the nuclear equation of state. In addition a recently discovered 45\nHz oscillation during an X-ray burst [6] in EXO 0748-676 has been associated with the\nspin frequency of the underlying neutron star (see Sec. 2.2). The neutron star in EXO\n0748-676 apparently rotates much slower than other neutron stars in X-ray bursters that\ntypically spin with frequencies ranging from 270 to 620 Hz [2]. The reduced rotational line\nbroadening in EXO 0748-676 might be the reason why a spectral line could be detected in\nthis system. The known spin frequency also offers the opportunity to use precise modeling\nof the spectral line shapes to constrain the neutron star radius and therefore the dense\nmatter equation of state.\nAs Joss 1977 [7] pointed out, the large entropy difference between the deeper layers\nthat undergo explosive hydrogen and helium burning during X-ray bursts (2.2) and the\nphotosphere prevents in principle convection from transporting burst ashes to the surface\n(see however Weinberg, Bildsten, and Schatz 2006 [8] for exceptions related to photospheric radius expansion bursts). On the other hand, heavy elements such as Fe entering\nthe photosphere via accretion, sink within seconds beneath the photosphere owing to the\nstrong gravity on the neutron star surface [3]. Elemental abundance observations in the\nneutron star photosphere during X-ray bursts therefore probe directly the ongoing accretion and provide information on the accreted composition as well as the trajectories of\n\n\f3\nthe infalling matter. In particular, infall under steep angles can lead to the spallation of\nheavy elements [5] contained in the accretion flow. This has been investigated in detail by\nBildsten, Chang, and Paerels 2003 [3], who follow the cascade of fragmentation processes\nand predict the final abundances. They find, that the amount of iron that can be present\nin the photosphere is about a factor of 20 short of explaining the observed line strength,\nbut argue for more accurate studies before drawing definite conclusions.\nSpallation of heavy elements is also important for X-ray burst calculations. The abundance of CNO elements entering the deeper atmosphere of the neutron star controls how\nmuch hydrogen can be burned away by the CNO cycle prior to the triggering of an X-ray\nburst.\n2.2. X-ray bursts and the rp-process\nShortly after the discovery of X-ray bursts in 1976 [9,10] they were correctly interpreted\nas thermonuclear explosions on the surface of an accreting neutron star [11,12,7,13]. Hydrogen or helium-rich matter from the envelope of the companion star accumulates on\nthe neutron star for hours to days. Eventually the ignition of extremely temperature\nsensitive fusion reactions leads to the thin shell instability of Hansen and VanHorn 1975\n[14], where the heating from thermonuclear reactions cannot be compensated by readjusting the stellar structure or cooling through the surface. The result is a thermonuclear\nrunaway where rising temperatures accelerate the thermonuclear reaction rates leading\nto more rapid temperature rises, still faster thermonuclear reactions and so on. The resulting thermonuclear energy release lasts 10-100 s and can be directly observed as an\nX-ray outburst of typically 1039−40 ergs. Burst recurrence times are of the order of hours\nto days and long sequences of burst can be observed. About 60 galactic X-ray bursting\nsystems are known today making X-ray bursts a frequent phenomenon in our Galaxy (see\n[1,15,16] for reviews on observations and physics of X-ray bursts).\nOver the last years a dramatic increase in observational data has led to a large database\nof burst properties monitored over long periods of time, and has also led to new discoveries\nsuch as ms oscillations of the X-ray flux during X-ray bursts [17,2]. These oscillations\nhave been interpreted as anisotropies in the nuclear burning on the surface of the rapidly\nrotating neutron star, caused for example by a spreading hot spot. In this model the\nslight frequency changes observed over the burst duration are explained by the rotational\ndecoupling of the surface layer that slows down during the burst driven expansion of\nthe neutron star atmosphere and then reaccelerates during the following cooling and\ncontraction. However, in some cases the frequency changes of the oscillations are too large\nto be explained with a rotationally decoupled layer [18]. Alternative explanations for the\nfrequency drifts include various surface oscillation modes [19,20,21]. The frequencies of\nthese modes depend on the composition and therefore on the nuclear physics of X-ray\nbursts. In any case, the recent observations of ms oscillations during X-ray bursts in\nthe two known X-ray bursting pulsars, SAX J1808.4-3658 [22] and XTE J1814-338 [23],\nwhere the spin frequency is known from the regular pulsations, have finally proven the\nrelationship between burst oscillations and neutron star spin.\nObservations of ms oscillations are important for many reasons. First they allow to\nexperimentally explore the X-ray burst behavior and the underlying nuclear processes\nas a function of neutron star spin [24]. Second, as Strohmayer 2004 [25] pointed out\n\n\f4\ngravitational light bending effects in principle would allow one to extract mass and radius\nof the neutron star together with the time-dependent size of the surface burning area\nfrom a detailed analysis of pulse trains. Already first constraints on the mass radius\nrelationship of the neutron star in XTE J1814-338 have been obtained with this method\n[26].\nThe nuclear processes powering X-ray bursts and the related observational features\ndepend strongly on the system parameters, such as mass accretion rate, accreted abundances of hydrogen, helium, and CNO metals, rotation, and the thermal flux at the surface\noriginating from nuclear reactions deep in the crust [15].\nMost systems have mass accretion rates in excess of 4.4×10−10 M⊙ /yr and accrete a\nmix of hydrogen, helium and some heavy metals most likely in solar proportions. In this\ncase, the burst is triggered by the temperature sensitivity of helium burning via the 3α\nreaction, igniting helium in a hydrogen rich surface layer [15]. The helium ignition triggers\nhydrogen burning via the rapid proton capture process (rp-process) [28,29,30] and peak\ntemperatures of 1-2 GK are reached.\nBecause of the factor of 10 larger energy release per nucleon, hydrogen burning via the\nrp-process is the main energy source for X-ray bursts and determines the X-ray light curve.\nNevertheless, because of its computational demanding nature, the full rp-process has only\nbeen recently included in X-ray burst calculations, opening the door for quantitative\ncomparisons with observations. In a first step, Schatz et al. 2001 [31] included the full rpprocess in a one-zone model after exploratory studies with smaller networks [30,32]. This\nled to the discovery of a SnSbTe cycle which is formed by (γ,α) reactions on α-unbound\nproton-rich Te isotopes. The resulting rp-process path is shown in Fig. 1 for an X-ray\nburst where large amounts of hydrogen are available at burst ignition. The SnSbTe cycle\nrepresents a natural end point for any single outburst rp-process. In principle heavier\nelements could be produced in a multi-burst rp-process where the heavy ashes decay back\nto stability and are then again irradiated with protons thereby bypassing the Sn-Sb-Te\ncycle [33]. So far there is no plausible astrophysical scenario known where this would\noccur.\nBesides delineating the full rp-process path for the first time, three main conclusions\nwere drawn from these one-zone calculations. First, hydrogen is always burned completely\nmaking the occurrence of deep hydrogen burning via electron capture [34] unlikely. Second, the rp-process beyond Fe includes particularly long-lived β-decays at 64 Ge, 68 Se, 72 Kr\nand 104 Sn (so-called waiting points) that slow the process down and extend the energy\nrelease of the burst considerably. The result is an increase of the burst duration from\na few 10 s of seconds to 100-300 s. Qualitatively similar conclusions have been drawn\nby Koike et al. 1999 [35] based on a similar one-zone model but with a more limited\nreaction network. As a consequence, the observation of long X-ray bursts with durations\nof the order of 100 s can now be used as an indicator for mixed hydrogen and helium\nburning providing a powerful constraint for models and system parameters. The third\nconclusion drawn from one-zone X-ray burst calculations is that the long-lived waiting\npoints along the rp-process path lead to a wide spread of the final abundance distribution\n[31,36]. Therefore the crust of an accreting neutron star is characterized by a very impure lattice structure that strongly affects crust properties such as thermal and electrical\nconductivities (see Sec. 2.4). Koike et al. 2004 [37] obtain similar results by combining\n\n\f5\na full one-dimensional X-ray burst multizone model with a very limited nuclear reaction\nnetwork to calculate temperature and density conditions followed by postprocessing with\na full reaction network. However, it has been shown that even at late stages of the burst\nnuclear reactions on heavier nuclei beyond iron produce significant amounts of energy and\ncan still determine temperature and observed light curves [35,31]. Therefore, for X-ray\nbursts postprocessing does not reproduce the correct conditions and nuclear reaction flows\n(see also [38] for an example).\nMore recently the first one-dimensional multizone calculations of a sequence of X-ray\nbursts have been performed with the full rp-process [27,39]. These calculations confirmed\nthe main conclusions from the earlier one-zone models, but also yielded some important\ndifferences. Most importantly, the ignition conditions for bursts late in the burst sequence\nchange because of the presence of partially burned ashes from preceding bursts. This is\nthe well known compositional inertia effect already pointed out by Taam (1980) [43]. The\nmain consequence is increased hydrogen burning between bursts leaving less hydrogen\nfor the X-ray bursts itself. Nevertheless, bursts at high accretion rates still burn enough\nhydrogen for the rp-process to reach the first long-lived waiting points in the A = 64 region\nand therefore still lead to long duration X-ray bursts. For the few system parameters\nexplored so far the SnSbTe cycle is only reached in the very first burst after the onset\nof accretion. This is of potential interest for transient systems, where the observation of\nthe sequence of bursts after the accretion turns on could provide important constraints\nfor X-ray burst models and the structure of the underlying neutron star. In the system\nAcq X-1 such a first burst might have been observed [40], and its unusual long duration\nwould be consistent with a particularly extended phase of hydrogen burning [41]\nA first quantitative comparison of calculated burst profiles from the one-dimensional\nmodel of Woosley et al. [27] with the so-called \"textbook\" burster GS 1826-24 has yielded\nexcellent agreement [42] for certain choices in the nuclear physics. GS 1826-24 exhibits\nextremely regular bursts with a period of 3-6 hours and observation over many years\nhas yielded very accurate burst profiles. Galloway et al. 2004 [44] in fact find a slight\nchange in burst profile from observations in the years 1998 and 1999 to observations in the\nyear 2000 due to a slight increase in accretion rate. It remains to be seen whether these\nchanges can be reproduced in current models, but observations like this certainly provide\nunprecedented quantitative tests for X-ray burst models. However, the nuclear physics\nof the rp-process is far from being sufficiently accurate to test X-ray burst models at this\nlevel. This has been clearly demonstrated with studies of the sensitivity of calculated\nX-ray burst light curves to uncertainties in masses around the major waiting points 64 Ge,\n68\nSe, and 72 Kr in a one-zone model [98]. More recent studies with multi-zone X-ray\nburst models predicting light curves for various changes in β-decay half-lives, which were\nintended to simulate mass uncertainties, come to similar conclusions [27]. It is likely that\nthese studies rather underestimate the nuclear physics uncertainties in predicted X-ray\nburst light curves as there are additional, large uncertainties in nuclear reaction rates (see\nSec. 3). Clearly, the current status of the nuclear physics of the rp-process does not allow\nfull interpretation of X-ray observations in a quantitative way. The success of modeling\nthe burst profiles of GS 1826-24 is promising but does therefore not necessarily imply that\ncurrent astrophysical models and their parameter choices are correct.\nThere are many other open questions related to the nuclear burning in X-ray bursts.\n\n\f6\nFor example, the ignition and subsequent burning front propagation across the neutron\nstar surface is not understood. This relates directly to the observations of ms oscillations\nduring bursts which could originate from unisotropic burning across the rapidly spinning\nneutron star surface when the accreted layer ignites at one, or a few spots or patches.\nFirst attempts with analytical considerations or simplified models have been made to\ninvestigate the spreading of a burning front across the neutron star surface [45,46,47].\nThey find that the burning front is most likely a deflagration front driven by convection.\nAs Zingale et al. [48] point out a localized ignition does not seem possible, at least when\nneglecting rotation. It would be desirable to explore this in full 2D or 3D hydrodynamic\ncalculations. Such calculations have so far only been done for the first 150 μs in the much\neasier case of a pure He detonation [49].\nAnother major problem in understanding X-ray bursts is the dramatic change in bursting behavior once the accretion rate exceeds about 0.13 ṀEdd . Current simple X-ray burst\nmodels predict that with increasing accretion rate ignition condition are reached earlier\nleading to more frequent bursts. At the same time the burst duration should become\nlonger as there is less time to burn hydrogen during the accretion phase leaving more\nfuel for the slow rp-process in bursts. While this behavior is qualitatively confirmed for\nthe slight change of accretion rate in the textbook burster GS 1826-24 [27], the observed\nbehavior beyond 0.13 ṀEdd is exactly opposite [50]. This can be seen very clearly for KS\n1731-260 where burst observations exist for accretion rates ranging from 0.04 to 0.4 ṀEdd\n[50]. Beyond an accretion rate of 0.13 ṀEdd bursts suddenly become rarer and shorter,\nindicating that there is not enough hydrogen for the rp-process to reach the first major\nwaiting point at A = 64. Furthermore, the so-called α value, the ratio of energy released\nin between bursts to the energy released in bursts, suddenly increases from 40 (expected\nif all nuclear burning happens in bursts) to 500-5000. This indicates that beyond 0.13\nṀEdd most of the nuclear burning occurs outside of bursts in some stable fashion, though\ncurrent spherically symmetric X-ray burst models predict that all fuel should be burned\nin bursts. Bildsten 1995 proposed that some nuclear burning proceeds through a slow\ndeflagration front moving across the neutron star surface instead of a rapidly burning\nburst [46]. Another explanation is given by Narayan and Heyl 2003 [51], who performed\na linear stability analysis of the accreted envelope and find a new instability regime of\nso-called \"delayed-mixed bursts\" at accretion rates between 0.14 and 0.25 ṀEdd , where\nstable burning and X-ray bursts coexist. The predicted accretion rate for the transition\ninto this new regime agrees very well with observations. However, the model also predicts\na transition to stable burning and the disappearance of bursts beyond an accretion rate\nof 0.25 ṀEdd while there are bursts observed at accretion rates as high as 0.7 ṀEdd [50].\nFurthermore, the \"delayed-mixed bursting\" behavior (though observed in nature) is not\nfound in recent time-dependent multizone calculations [52] which should in principle give\nthe same result. The lack of understanding of X-ray bursts at accretion rates beyond 0.13\nṀEdd is particularly bothersome as this is exactly the regime relevant for superbursts (see\nbelow).\nAnother long-standing open question is whether X-ray bursts do in some form contribute to Galactic nucleosynthesis [53,30]. This would be interesting as the rp-process\ncan produce significant amounts of 92,94 Mo and 96,98 Ru. These p-nuclei cannot be produced in sufficient amounts in standard p-process models [54,55]. Costa et al. 2000\n\n\f7\n[56] proposed that a much larger than theoretically expected 22 Ne(α,n) reaction rate in\nthe s-process, which produces the p-process seeds, could solve the problem. However,\ntheoretical arguments and recent experimental upper limits seem to rule out such a large\n22\nNe(α,n) reaction rate [57]. The production of proton-rich Mo and Ru isotopes at another\nsite would also solve the problem of the origin of these isotopes in the solar system. One\nalternative site that has been proposed is a combination of a weak rp-process with neutron captures in explosions of white dwarfs that reach the Chandrasekhar mass limit by\naccreting a helium layer [58]. X-ray bursts could in principle be another possibility.\nHowever, the critical question is how matter containing rp-process ashes can be ejected\nfrom the surface of a neutron star. The fundamental problem is to overcome the gravitational binding of 200 MeV per nucleon when the nuclear energy release cannot exceed\n6 MeV per nucleon. Recently it has been shown that the convective zone developing\nduring the rise of an X-ray burst can extend to sufficiently shallow regions that can be\nblown off in winds. Such winds are thought to develop during the frequently observed\nand particularly luminous photospheric expansion bursts [8]. This provides a mechanism\nto eject ashes from thermonuclear burning into space in a subclass of X-ray bursts. An\nobservational confirmation, for example through detection of spectral features imprinted\nonto the X-ray flux by the ejected material would be extremely important. However, the\nmaterial transported to the surface is the ashes of the initial stages of the thermonuclear\nburning and even for hydrogen rich bursts is dominated by products of the αp process,\nmainly 24 Mg and 28 Si, with some smaller amounts of nuclei up to A ≈ 38. Small amounts\nof 60,62 Zn from processing of the accreted iron are also mixed in. Therefore, this still does\nnot necessarily provide a mechanism to eject heavy rp-process ashes produced during the\ncooling phase of the X-ray burst when convection has stopped. However, in principle ashes\nmixed into the burning zone of subsequent bursts or mass ejection through a superburst\nmight be possibilities [8].\nAnother problem is the total amount of Mo and Ru that can be produced in the Galaxy\nby X-ray bursts. While Schatz et al. 1998 [30] pointed out that in principle with the\nejection of just 1% of the processed matter X-ray bursts could be contributors to Galactic\nnucleosynthesis, new calculations show [27] that for the rp-process to produce Mo and\nRu special circumstances are needed. In the majority of X-ray bursts the rp-process will\nnot produce significant amounts of Mo and Ru. Furthermore, the existence of the later\ndiscovered SnSbTe cycle [31] leads to a large co-production of 102 Pd and 106 Cd whenever\nthe rp-process reaches the A ≈ 90 − 100 mass region. 102 Pd and 106 Cd do not share the\nunusual isotopic enhancement found for most proton-rich Mo and Ru isotopes and are\nproduced in sufficient amounts in standard p-process scenarios. It has also been pointed\nout that the long-lived radioactive p-nucleus 92 Nb might provide important clues as it is coproduced with 92 Mo and other p-nuclei in a photodisintegration type supernova p-process,\nbut is shielded against rp-process contributions by stable 92 Mo [59]. Indeed, traces of\nextinct 92 Nb present in the early solar system have been detected in primitive meteorites.\nEstimates using the measured abundance and a galactic chemical evolution model find a\n92\nMo/92 Nb production ratio that is very close to the one predicted from supernovae pprocess models. However, there are large uncertainties in the galactic chemical evolution\nmodeling and the nuclear physics that determines the 92 Mo/92 Nb ratio in supernovae. In\nsummary it seems to be difficult to explain the origin of proton-rich Mo and Ru isotopes\n\n\f8\nwith the rp-process in X-ray bursts based on current models. Nevertheless, the question\nof the ejection of burned material in X-ray bursts and its composition should be explored\nfurther not only in terms of the nucleosynthesis contribution but also to explore the\npossibility of future abundance observations through X-ray spectroscopy.\n2.3. Superbursts and deep carbon burning\nSuperbursts are rare, extremely powerful X-ray bursts that have been discovered trough\nlong term monitoring with the Beppo-SAX Wide Field Camera and the RXTE All-Sky\nMonitor. They are found in X-ray binary systems that otherwise show regular X-ray\nbursts. So far, 13 superbursts have been detected from 8 sources, most recently in GX\n17 + 2 [60] (see [61] for a recent observational overview). Compared to the regular bursts,\nsuperbursts are a factor of 1000 times more energetic, they last many hours as opposed to\n10-100s, and their recurrence time is around a year instead of hours to days. Superbursts\nshow the same spectral behavior than normal X-ray bursts, and in one case it was possible\nto detect ms oscillations with RXTE that show a behavior similar to the oscillations in\nnormal bursts [62]. Superbursts are therefore likely to be of thermonuclear origin.\nSuperbursts most likely occur when carbon in the ashes from regular bursts ignites deep\nin the neutron star's liquid surface ocean [11,64,63]. Cumming and Bildsten 2001 [64]\npointed out that the presence of heavy nuclei beyond iron in the ashes plays an important\nrole as they increase the opacity of the layer and therefore affect the ignition depth.\nSchatz et al. 2003 [65] investigated in more detail the actual nuclear processes occurring\nduring a superburst and found that in addition to carbon fusion, photodisintegration\nof heavy elements plays an important role. Once carbon burning heats the layer to\n1-2 GK (depending on the detailed composition) the extremely temperature sensitive\nphotodisintegration reactions on heavy nuclei trigger a photodisintegration runaway that\nleads to a rapid rise of the temperature up to 7 GK. This drives the composition into\nNuclear Statistical Equilibrium (NSE), which at superburst conditions contains mainly\nnuclei around 66 Ni. Depending on the initial composition set by the ashes of the regular\nbursts the photodisintegration of heavy elements into Ni can contribute up to about 50%\nof the total superburst energy.\nFor ashes typical of explosive hydrogen burning carbon ignition occurs around a density\nof 109 g/cm3 - about 3 orders of magnitude larger than for ordinary X-ray bursts. The\nmuch higher ignition depth explains the longer recurrence time and the higher total energy\nas more matter needs to be accumulated to trigger the burst. The longer burst duration\nmatches the radiative cooling timescale from the ignition layer. The carbon ignition model\nalso explains the observed interaction of superbursts with normal bursts. The increasing\nheat flux at the surface shortly after superburst ignition triggers the explosive burning\nof the hydrogen and helium in the upper layers leading to the observed \"precursors\" - a\nregular X-ray bursts preceding the superburst [66]. The long cooling timescales lead to\nan increased surface heat flux for many weeks explaining the suppression of regular bursts\nafter a superburst.\nSuperbursts are an important probe for the properties of neutron stars. As they occur\ndeeper than regular X-ray bursts, they are more sensitive to the thermal properties of\nthe crust and core cooling models. As Brown [67] showed recently, the mere existence\nof superbursts can put tight constraints on the thermal conductivity of the neutron star\n\n\f9\ncrust and on the rate of neutrino cooling in the core.\nThe main open question concerning superbursts is the origin of a sufficient amount of\ncarbon (at least a few % mass fraction) in the ashes of hydrogen and helium burning on\nthe surface. Recent one-zone models of X-ray bursts showed that when one includes the\nfull rp-process hydrogen is consumed completely leading to a brief helium burning phase\nat the end of the burst that produces some carbon. However, more recent calculations\n[27] that follow a series of bursts, demonstrated that any carbon leftover in the ashes of\na specific burst is destroyed via the capture of residual helium triggered by the heat from\nthe next burst. A key issue in this problem is the unexplained regular burst behavior at\naccretion rates beyond 0.13 ṀEdd , which is just the range relevant for superbursts (see\nSec. 2.2). As discussed above, at these accretion rates some fuel is likely burned steadily\nand not in bursts. Such stable burning could in principle produce the amount of carbon\nneeded to explain the superburst phenomenon [36].\nExcept for the carbon fusion rate that triggers the unstable burning uncertainties in\nthe nuclear physics of the processes during superbursts are not likely to be important.\nThe matter is quickly driven into NSE, where final composition and energy generation\nare determined by ground state masses and partition functions of experimentally well\nstudied nuclei near stability. However, the nuclear physics uncertainties in regular X-ray\nbursts, in particular in the rp-process, together with the astrophysical puzzles associated\nwith them prevent a reliable calculation of the X-ray burst ashes which serve as the fuel\nfor superbursts. This is a major obstacle towards a full understanding of superbursts\nand a solution of this problem is critical for using superbursts as reliable probes for the\nproperties of accreting neutron stars.\n2.4. Crust processes\nThe neutron star crust serves as an interface between the physics of the neutron star\nand observations. One direct observable is the quiescent luminosity from the crust of\nneutron stars in transient X-ray binary systems (so-called Soft X-ray Transients). These\nsystems are characterized by a thermal accretion disc instability that turns the accretion\nonto the neutron star on and off with periods ranging from months to decades [68,69]. It\nhas been argued [72,73] that the quiescent luminosity that is observed from Soft X-ray\nTransients after the accretion has turned off, is the thermal radiation from the cooling\nneutron star crust. This offers a pathway to distinguish neutron star systems from black\nhole systems, and to determine neutron star radii provided the observed spectrum can be\naccurately modeled [74] and the distance to the source is known.\nIn addition, luminosity measurements directly constrain the thermal state of the crust,\nwhich in turn can be used as a probe for neutron star physics such as the existence of\nenhanced neutrino cooling processes, superfluidity, or exotic phases of nuclear matter [70,\n71]. Wijnands 2004 [76] gives an extensive review of the observational status concerning\nthe detection of soft X-ray transients in quiescence. The majority of X-ray transients\nhave periods of the order of months and crust luminosity measurements can be used to\ndetermine the limit cycle thermal state of the crust [72]. In long period transients (socalled quasi-persistent sources), which turn off for years to decades repeated observations\nduring the off state offer the unique opportunity to measure the crust cooling behavior of\nan accreting neutron star as a function of time [75]. This has recently become possible\n\n\f10\nin two cases - for KS 1731-260, which turned off early in 2001 a drop of the surface\nluminosity was followed in 4 measurements over 2.5 years [76]. Similarly, for MXB 165929 3 measurements over several years were performed [77]. In both cases the decrease in\nluminosity of about a factor of 8 over a few years is consistent with the observed decrease\nin effective temperature further supporting the assumption that one observes a cooling\nneutron star crust. Interestingly, comparison with crust models shows that such a rapid\ndrop in luminosity can only be reproduced when assuming enhanced neutrino cooling in\nthe neutron star core. However, the detection of a superburst from KS 1731-260 during\nits on-state points to a hot crust and seems to rule out enhanced neutrino cooling [67].\nAt this point a solution to this puzzle is not in sight, but clearly a better understanding\nof the nuclear physics underlying both probes - superbursts and the neutron star surface\nluminosity behavior - would be important.\nThe neutron star crust composition and its thermal state also affect the crust electrical\nconductivity. This is important for another fundamental open question - the existence\nof two classes of X-ray binaries: X-ray pulsars characterized by high magnetic fields that\nfunnel the accretion flow onto the polar caps, and X-ray bursters with low magnetic fields.\nWhile a long term decay of magnetic fields seems to be a likely explanation, neither the\norigin of the magnetic fields nor the mechanism of the field decay are understood [78,79,80].\nAs pointed out above, the initial composition of the neutron star crust is determined\nby the ashes of the surface burning processes such as X-ray bursts and superbursts. The\nongoing accretion compresses the ashes continuously and converts it into deeper and\ndeeper layers of the crust. The rising electron Fermi energy initiates a sequence of electron\ncaptures, which beyond neutron drip are accompanied by neutron emission. In the inner\ncrust of the neutron star the nuclei have finally low enough charge numbers to enable\npycnonuclear fusion reactions [81,82,83]. All these reactions generate heat and might also\ndeform the crust leading to the possibility of gravitational wave emission if the neutron\nstar is spinning rapidly [84,85].\nTogether with the rp-process and the nuclear reactions during superbursts these crust\nprocesses determine the crustal heating and the crust composition, which in turn strongly\naffects thermal and electrical crust conductivities. Therefore, the nuclear physics of a\nwide range of processes needs to be understood before observations can be translated\ninto quantitative constraints of neutron star properties. These processes include all nuclei\nfrom the proton drip line to the neutron drip line up to a maximum mass number that is\nset by the endpoint of the rp-process, with a maximum at A ≈ 106 set by the Sn-Sb-Te\ncycle.\nSo far, the nuclear processes in the crust of an accreting neutron star have only been\nexplored in a schematic way assuming single nuclide compositions, zero temperature and\ninfinitely fast electron capture at threshold. While these are not unreasonable assumptions\nfor a first exploration of nuclear crust processes, more detailed simulations would be\nneeded to determine the impact of nuclear physics uncertainties such as electron capture\nthresholds, the location of the neutron drip line, electron capture rates, and pycnonuclear\nfusion rates on crust studies and observables. In addition, crust processes strongly depend\non the initial composition set by the ashes of X-ray bursts and superbursts. The nuclear\nphysics uncertainties in the rp-process therefore strongly affect the physics of the crust.\nAlready, the inclusion of reactions beyond Ni in the rp-process has had a significant\n\n\f11\nimpact in demonstrating that the crust consists most likely not of a pure single nuclide\nlattice, for example Fe, but of a wider range of nuclear species. This is a consequence\nof the long waiting points in the rp-process beyond 56 Ni that lead to a spreading in the\nfinal abundance distribution. First estimates show that such an impure crust has a much\nreduced thermal and electrical conductivity [79,86].\n3. Nuclear physics needs\nThe surface of accreting neutron stars is characterized by a wide range of nuclear\nprocesses ranging from fragmentation at infall, over thermonuclear burning in X-ray bursts\nand superbursts, to electron captures and pycnonuclear fusion reactions in the neutron\nstar crust. These processes involve the majority of the nuclei between the proton and\nthe neutron drip line up to a maximum mass number set by the endpoint of the rpprocess. In this picture, the rp-process during X-ray bursts (and maybe during stable\nhydrogen burning as well) plays a central role as it directly determines one of the key\nobservables, the observed X-ray bursts, and because it sets the initial composition for all\nthe deeper processes. At the same time, the nuclear physics and its impact on observables\nhas been explored for the rp-process to a much greater extent than for any of the other\nprocesses on accreting neutron stars. We therefore concentrate in the following on the open\nnuclear physics questions related to the rp-process. Earlier reviews of the experimental\nand theoretical nuclear physics aspects of the rp-process can be found in [87,29,30,88,32].\nAs shown in Fig. 1 [30] the rp process in X-ray bursts follows a path away from the\nvalley of stability through β-unstable nuclei. It is dominated by (p,γ) reactions and\nβ-decays and extends up to the mass ∼64-106 region depending on the astrophysical\nconditions. For lighter nuclei (up to mass ∼40) the (α,p) reaction can compete successfully with proton capture at X-ray burst temperatures. The (α,p) reaction followed\nby a radiative proton capture (p,γ) is a very effective way for the production of heavier nuclei without waiting for an intermediate beta decay. This so-called αp process is\nthought to determine the early phase of an X-ray burst lightcurve when the increasing temperature enables (α,p) reactions at successively heavier nuclei. Depending on\nthe peak temperature reached in a particular burst the final αp-process can extend up to\nSc, mainly through the sequence 14 O(α,p)17 F(p,γ)18 Ne (α,p)21 Na(p,γ)22 Mg(α,p)25 Al(p,γ)\n26\nSi(α,p)29 P(p,γ)30 S(α,p)33 Cl (p,γ)34 Ar(α,p)37 K(p,γ)38 Ca(α,p)21 Sc. At several points along\nthe path short-lived β-decays can compete leading to several parallel flows.\nMost of the nuclei probed in the rp-process do not exist as stable nuclei but the majority\nof them have been produced in the laboratory, as indicated in Fig. 1. Besides particle\nstability half-lives and masses are the other crucial input parameters for determining the\nreaction paths in the rp-process.\n3.1. Nuclear Masses\nIn the rp process proton capture is favored compared to β-decay until a nucleus with\na small (p,γ) Q value is reached where an equilibrium between (p,γ) capture and its\ninverse (γ,p) photodisintegration is established. At this point the rp process has to wait\nuntil via β + decay a less proton-rich nucleus is formed. Since the equilibrium depends\nexponentially on the (p,γ) Q-value the mass of the waiting point nucleus itself as well the\nmasses of the isotones which can be reached via one and two proton capture reactions\n\n\f12\n\nXe (54)\nI (53)\nTe (52)\nSb (51)\nSn (50)\nIn (49)\nCd (48)\nAg (47)\nPd (46)\nRh (45)\nRu (44)\n\n5758\n\nTc (43)\nMo (42)\nNb (41)\nZr (40)\nY (39)\nSr (38)\n\n56\n5455\n53\n\nRb (37)\nKr (36)\nBr (35)\nSe (34)\nAs (33)\nGe (32)\nGa (31)\nZn (30)\n\n5152\n4950\n45464748\n424344\n41\n\n37383940\nCu (29)\nNi (28)\n33343536\nCo (27)\nFe (26)\n3132\nMn (25)\nCr (24)\n2930\nV (23)\nTi (22)\n25262728\nSc (21)\nCa (20)\n2324\nK (19)\nAr (18)\n2122\nCl (17)\nS (16)\n17181920\nP (15)\nSi (14)\n1516\nAl (13)\nMg (12)\n14\nNa (11)\nNe (10)\n111213\nF (9)\nO (8)\n9 10\nN (7)\nC (6)\n7 8\nB (5)\nBe (4)\nLi (3)\n5 6\nHe (2)\n3 4\nH (1)\n2\nn (0)\n0 1\n\nFigure 1. The main path of the rp-process in a one-zone X-ray burst model [31]. Stable\nnuclides are grey, nuclides with masses experimentally known to better than 10 keV are\nred, other nuclides with experimentally known masses are orange, nuclides with experimentally known half-lives but unknown masses are green, and nuclei that have only been\nidentified in experiments are blue.\n\n\f13\nhave to be known with a precision of about kT ≈ 100 keV (with k being the Boltzmann\nconstant and T a typical temperature).\nNuclear masses are also important for the determination of proton capture rates. For\nmany of these rates along the rp-process path Q-values are too high to establish a (p,γ)(γ,p) equilibrium at all times, but they are still low enough for a few individual resonances\nto dominate the reaction rate. Because of the exponential dependence of the proton\ncapture rate on the resonance energy, masses (and excitation energies) need to be known\nto better than 10 keV in those cases. As Fig. 1 shows, for most of the rp-process, especially\nbeyond Ti, masses are still not accurate enough for reliable reaction rate calculations or\nthe planning of direct reaction rate measurements with radioactive beams.\nFor the most part masses in the rp-process can be theoretically predicted using extrapolations [97] or, beyond the N = Z line, Coulomb shift calculations [98]. In some cases\nwhere the mass or the mirror nucleus is known with high accuracy, the latter method can\nreach 100 keV accuracy. While this represents a considerable improvement over global\nmass models [30], the uncertainties in theoretical mass predictions are still too large for\nastrophysical applications. Experimental data are therefore needed.\nConsiderable progress has been made during the past years at various laboratories to\nmeasure masses of rp process nuclei (see Fig. 1), but much remains to be done [99]. As\nFig. 1 shows, already beyond magnesium not all reaction Q-values are known to better\nthan 10 keV, and beyond vanadium hardly any are sufficiently accurate. One new technique are mass measurements of unstable nuclei in the ESR storage ring at GSI using an\nisochroneous tune and a time-of-flight detector [89,90]. The advantage of this technique\nis the low half-life limit of a few microseconds that includes all particle bound nuclei.\nConventional β-endpoint [91] and time-of-flight techniques [92] have also been used. A\nmajor step forward in this field, however, was the use of Penning traps with radioactive\nproton rich beams. These systems can achieve the needed accuracies of 10-100 keV or\nbetter for even the heaviest rp-process nuclei. Several of these mass spectrometers are\nnow operational worldwide [93,94,95,96]. The nuclei are produced using various nuclear\nreactions, they are thermalized, cooled and then injected into the Penning trap. For a\nmass measurement the isotope has to live at least 100 ms, a condition which is fulfilled\nfor practically all rp-process nuclei.\nAlong the proton dripline the pairing force can lead to the stability of certain even-Z\nnuclei while the neighboring Z+1 nuclei are proton unstable. Examples are the N=34\nand 36 N=Z nuclei 68 Se and 72 Kr which have relatively long half-lives of 35.5 s and 17\ns, respectively, while the isotones 69 Br and 73 Rb are particle-unbound. For the 68 Se case\nthe β-decay waiting point can be bridged through the successive capture of two protons\nvia the particle-unstable 69 Br leading to the particle-stable nucleus 70 Kr. The mass of the\nparticle-unstable 69 Br can only be measured through transfer reactions using radioactive\nbeams. However, an estimate for the masses of these unstable nuclei can be obtained\nusing Coulomb displacement energies from mirror nuclei [98].\nA recent mass measurement of 68 Se[100] together with estimates of the mass of 69 Br has\nled to the conclusion that 68 Se remains a waiting point in the rp process. Similar results\nhave been obtained for 64 Ge [101] and 72 Kr [102]. In the latter case the masses of 72−74 Kr\nhad been measured providing together with Coulomb shift calculations good estimates\n\n\f14\nfor the masses of the entire relevant isotone chain 72 Kr, 73 Rb, and 74 Kr. As in the case of\n68\nSe it was found that 72 Kr probably remains a significant waiting point in the rp-process,\nbut it was also pointed out that because of uncertainties in the proton capture rates final\nconclusions cannot be drawn yet.\nIn summary, for most of the important waiting point nuclei such as 64 Ge, 68 Se, 72 Kr\nand 104 Sn, masses and half lives are now known with sufficient accuracy. However, what\nis needed for rp-process calculations are proton capture Q-values. For 64 Ge, 68 Se, and\n72\nKr the mass of the proton capture isotone is not yet known experimentally. For 104 Sn\nthe proton capture Q-value has been determined from the detection of proton decay in\n105\nSb [103,104]. However, the two experiments give somewhat conflicting results of either\n478±15 keV or 550±30 keV for the proton energy. Therefore, despite the considerable\nprogress that has been made, accurate experimental proton capture Q-values are still not\navailable for the major rp-process waiting points.\n\n3.2. β-decay half-lives\nβ-decay half-lives are critical for rp-process calculations as they determine the timescale\nfor the buildup of heavier elements and energy generation as well as the final abundance distribution. As Fig. 1 shows, most of the important β-decay half-lives in the\nrp-process have been measured in radioactive beam experiments with a few exceptions\nsuch as 95,96 Cd. In principle, theoretical corrections need to be applied to the experimental half-lives to account for the actual astrophysical environment during an X-ray\nburst. This has been investigated by Fuller, Fowler and Newman 1982 [105] and more\nrecently by Pruet et al. 2003 [106], who tabulate corrected weak decay rates as a function\nof temperature and density for use in X-ray burst calculations. At temperatures of up\nto 2 GK low-lying states can be thermally populated, and the decay rates from these\nstates can differ from the ground state decay rates measured in experiments. As the\nmost important waiting point nuclei in the rp-process tend to be even-even nuclei with\nrelatively high-lying first excited states this is usually not a large effect [30]. Exceptions\nmight occur around 80 Zr where a large ground state deformation lowers the energy of the\nfirst excited state considerably. The second correction is needed to take electron capture\ninto account properly. Nuclei in the X-ray burst environment are fully ionized and bound\nstate electron capture that might be present in the laboratory, is not important in the\nstellar environment. On the other hand, electron densities during X-ray bursts can be\nsufficiently large for continuum electron capture to play a role. However, as the majority\nof the important rp-process waiting points are far from stability and have large β-decay\nQ-values electron capture in the laboratory and in the star is in most cases negligible at\nthe 10% level. In that case the use of measured terrestrial half-lives in rp-process calculations is appropriate. However, such corrections can become important closer to stability,\nfor example at the onset of the rp-process below Zn and in particular X-ray bursts where\nthe rp-process ends in the A = 60 − 72 mass range and moves closer to stability during\nthe final cooling phase.\nβ-decays in the rp-process are not only important bottle-necks in the reaction flow, but\nserve also as the major nuclear energy source owing to their large positive Q-values. To\naccurately determine the energy production of the rp-process, the actual β-decay scheme\n\n\f15\nneeds to be known to determine the amount of energy that is lost via neutrino emission.\nWhile most of the β-decay half-lives are measured, in many cases the actual β-strength\nfunctions have not been determined experimentally. Therefore theoretical β-decay calculations [105,106] have to be used to determine the neutrino energy loss during X-ray bursts.\n\n3.3. Astrophysical Reaction Rates.\nBecause the majority of nuclei involved in the rp process are unstable most of the\nreaction rates so far had to be estimated based on theoretical grounds. While a statistical\nHauser-Feshbach treatment is possible for nuclei with high (p,γ) Q-values where states\nat high excitation energy are being populated[107], in many cases the individual level\nstructure of a particular nucleus can dominate the reaction rate. Shell model calculations\nhave been performed for these cases in the sd- [108] and fp-shell [109] and these rates are\nused widely in rp-process calculations. However, the accuracy of the predicted excitation\nenergies of individual levels is at most around 100 keV. For resonant reaction rates this\ntranslates into uncertainties of many orders of magnitude. Even in cases where the level\nenergies have been determined experimentally, an uncertainty of at least a factor of 2-3\nremains. For this reason direct measurements of critical reactions along the rp-process\npath are urgently needed.\nReaction rates in the rp-process need to be determined for a wide range of temperatures\nup to about 2 GK. While X-ray bursts ignite at temperatures around 0.2 GK, the lower\ntemperature limit for the reaction rate determination is usually set by the condition that\nthe reaction rate timescale has to be less than the typical X-ray burst timescale of ∼10 s.\nFor typical X-ray burst conditions with hydrogen mass fractions of 0.5 and mass densities\nof 106 g/cm3 one finds that a proton induced reaction rate is important once it exceeds\n2×10−7 cm3 /s/mole. As an example, proton capture rates on Ne, Cl, and Ge need to be\nknown for temperatures above 0.2, 0.3, and 0.5 GK respectively.\nWith the exception of a few long-lived nuclei (e.g. 18 F, 22 Na, 26 Al, 44 Ti and 56 Ni) which\ncould be produced as targets in standard kinematics experiments using proton or alpha\nbeams all other isotopes along the rp path have very short half-lives and require the use\nof the so-called inverse kinematics, where a proton or He target is bombarded with a\nheavier radioactive beam. Some of these beams have become available during the last 15\nyears at several laboratories, leading to a new era in nuclear astrophysics. Since the beam\nintensities at these first generation facilities are still 3-5 orders of magnitude below the\nintensities available with stable beams new, high efficiency detector systems optimized\nfor reaction studies in inverse kinematics had to be developed. So far only a handful\nof experimental (p,α) and (α,p) reaction rates have been measured directly during the\npast few years. The direct measurement of a (p,γ) reaction with a radioactive beam has\nonly succeeded in two cases, the 13 N(p,γ)14 O reaction at Louvain-la-Neuve [111,112] and\nthe 21 Na(p,γ)22 Mg reaction at TRIUMF [113]. The rates of these reactions are discussed\nbelow.\nFor the many cases where a direct measurement of the reaction rate is still outside the\nexperimental capabilities, indirect approaches can be used. They are important when\nresonances are too weak, when the exact location of the resonances are not known or\n\n\f16\nwhen the radioactive beams needed for a direct measurement can not yet be produced.\nThey are also needed to determine capture rates on low-lying thermally excited states\nin the target, which at the extreme temperatures reached in X-ray bursts can be important in some cases. For example, elastic scattering can be used to locate resonances or\ndetermine their total widths, and transfer reactions can give information about partial\nwidths and decay properties. Gamma detector arrays, such as GAMMASPHERE [114]\nor SEGA [115] with their excellent energy resolution can also be used to identify states\nthat dominate the reaction rate for nuclei away from stability.\nIn some cases it is more convenient to measure the time-inverse of the reaction that actually occurs in the astrophysical environment. The information on the forward reaction\nis then obtained through the principle of detailed balance. Coulomb dissociation is the\ntime-inverse of a direct capture reaction and has been successfully used in some (mainly\nlighter) systems, e.g. 13 N(p,γ)14 O[116,117]. The technique can give an increase in yield\nby a factor of 105 over the forward capture reaction and can thus be used with relatively\nweak radioactive beams. It probes, however, only the γ-transition to the ground state\nand there are additional difficulties with transitions of mixed multipolarity.\nOther examples of the successful use of time-inverse reactions which are of importance to\nthe study of X-ray bursts are studies of (α,p) reactions through their time-inverse partner\n(p,α), thereby avoiding the use of a He target. A drawback of this technique is that\ncontributions from excited states in the final nucleus have to be determined separately,\ne.g. through a measurement of elastic and inelastic scattering.\nIn the following the results from recent measurements of reaction rates in X-ray bursts\nwith radioactive beams or targets using both, direct and indirect techniques are briefly\ndiscussed.\n3.3.1. The triple-α reaction\nThe rate for the triple-α reaction which triggers the X-ray bursts and serves as the\nstarting point and major initial bottle-neck of the rp-processs (see Fig.1) has recently\nseen some changes resulting from the spin and energy determination of a resonance at\nEx ∼ 11 MeV[110]. The main modifications are an increase in the rate at low temperatures\n(below 5×107 K) and a steep decrease by more than an order of magnitude at temperatures\nabove 2.5×109 K. More calculations need to be done to investigate the effect of the changes\nin the reaction rate on the rp process.\n3.3.2. The 13 N(p,γ)14 O Reaction\nThe 13 N(p,γ)14 O reaction can bypass the slow β-decay of 13 N (T1/2 =9.96m) leading\nto the so-called hot CNO cycle where the energy production is independent of the temperature and limited by the beta decays of 14 O(T1/2 =70.6 s) and 15 O(T1/2 =2.03 m).\nThis reaction was measured directly in a pioneering experiment with a 13 N beam at\nLouvain-la-Neuve[111,112] as well as with indirect (Coulomb dissociation) techniques at\nRIKEN[116] and GANIL[117]. The results from these experiments agree among each\nother giving a width Γγ of 3.0±0.5 eV and a resonance strength of 9±1.5 eV. A recent\nmeasurement extracting the Asymptotic Normalization Coefficient (ANC) from a transfer\n\n\f17\nreaction measurement has led to a slight modification of the reaction rate which agrees\nwith the tabulated values [118] at temperatures above T9 ∼0.5 but exhibits an increase\nby a factor of 1.5-2 below T9 ∼0.25[119].\n3.3.3. The 14 O(α,p)17 F Reaction.\nThis reaction has been studied through its time inverse 17 F(p,α)14 O reaction at ANL[120]\nand ORNL[121]. The transitions to the first excited 1/2+ state in 17 F was addressed\nthrough independent measurements of the 17 F(p,p')17 F reaction[122,123]. The cross sections in these two experiments were found to agree within their experimental uncertainties.\nIn a more recent experiment this reaction was measured directly with a 14 O beam and\na cryogenic He target[124]. There is some disagreement between the direct and indirect\nmeasurements that need to be addressed in future measurements.\n3.3.4. The 17 F(p,γ)18 Ne Reaction.\nThis reaction rate is part of the (α,p) process following the 14 O(α,p)17 F reaction. It\ndepends critically on the exact location of a 3+ state which is expected from mirror symmetry arguments at an energy of 4.5 MeV. This state was first unambiguously identified\nin experiments with 17 F beams at ORNL[125,126,127]. From the resonant strength whose\nvalue still depends somewhat on properties of the mirror nucleus one finds that the reaction rate for temperatures above T9 ∼0.5 is determined by this state.\n3.3.5. The 18 Ne(α,p)21Na reaction.\nThis reaction was studied directly with a 18 Ne beam and an active He target[128,129]\nat excitation energies which, however, are too high to be relevant for X-ray bursts. Furthermore, the cross sections obtained in these experiments seem to exhaust the Wigner\nlimits for states at an excitation energy of 11 MeV. Recent experiments using the indirect\ntime-inverse 21 Na(p,α)18 Ne approach have found considerably smaller yields[130]. These\ndiscrepancies require further studies and experiments at several radioactive beam facilities\nare planned for the future.\n3.3.6. The 19 Ne(p,γ)20 Na Reaction.\nAs part of the 15 O(α, γ)19 Ne(p,γ)20 Na chain this reaction is at the onset of the rp\nprocess. A direct study using a 19 Ne beam and detecting the delayed decay products\nfrom 20 Na [131,132] has so far only given an upper limit of the first state above the\nproton threshold (see also [133]. However, even the spin of this state is still being\ndebated[134,135,136,137] and, thus, the value of the reaction rate for this reaction is\nstill uncertain by orders of magnitude.\n3.3.7. The 21 Na(p,γ)22 Mg Reaction.\nThis reaction is again part of the (α,p) process, following the 18 Ne(α,p)21 Na reaction.\nThe resonant strengths of seven resonances in 22 Mg have been directly measured with a\n21\nNa beam at TRIUMF[138,139].\n\n\f18\n3.3.8. The 22 Na(p,γ)23 Mg Reaction.\nThis reaction has been studied by direct and indirect techniques. Bombarding a radioactive 22 Na (T1/2 =2.6 y) target with a proton beam in two experiments has led to\na reaction rate which is smaller by about an order of magnitude when compared to a\npure theoretical estimate[140,141]. More recent indirect measurements using GAMMASPHERE resulted in an increase of this rate due to the addition of new resonances which\nwere not included in the previous analyses[142].\n3.3.9. The 22 Mg(p,γ)23 Al Reaction\n22\nMg is a potential local waiting point where proton capture competes with the (α,p)\nreaction. A recent measurement of the 24 Mg(7 Li,8 He)23 Al reaction established the mass\nand the energy of the first excited state in 23 Al[143]. The astrophysical reaction rate\nfor the 22 Mg(p,γ) reaction was then obtained using a spectroscopic factor based on shell\nmodel calculations. A recent measurement of Coulomb dissociation of 23 Al[144] resulted\nin a resonance strength which is in good agreement with the value used in Ref.[143].\nThese measurements have reduced the uncertainties of the (p,γ) rate considerably. However, because of its small Q-value the 22 Mg(p,γ)23 Al reaction is in equilibrium with its\ninverse reaction 23 Al(γ,p)22 Mg and, thus, very little 23 Al is produced. The influence of\nthe 2-proton capture reaction on 22 Mg forming 24 Si which becomes important at higher\ntemperatures has been discussed in Ref.[145].\n3.3.10. The 32 Cl(p,γ)33 Ar Reaction.\nThe reaction rate used in previous calculations was entirely based on shell-model calculations with uncertainties in the excitation energy around 100 keV. Populating the states\nin 33 Ar above the proton threshold via the 34 Ar(p,d)33 Ar reaction and studying their γ\ndecay has allowed to put much smaller error bars on the excitation energies of some of the\ncritical levels[146]. This has reduced the uncertainty in the reaction rate from 3 orders of\nmagnitude to a factor of 3 at the critical temperatures around 0.3 GK and to a factor of 6\nat the highest X-ray burst temperatures. For high temperatures additional states, which\nhave not been identified so far might contribute as well. Further studies for this system\nare clearly desirable.\n3.3.11. The 56 Ni(p,γ)57 Cu Reaction.\nThe sequence of (α,p) and (p,γ) reactions leading to the formation of heavier nuclei in\na X-ray bursts proceeds mainly through the nucleus 56 Ni which is a waiting point in the\nreaction flow. Because of the closed-shell nature of 56 Ni the Q value for the 56 Ni(p,γ)57 Cu\nreaction is quite small (Q=0.695 MeV) so that the cross section can not be reliably estimated using statistical model calculations. The rate is dominated by transitions to the\nfirst two excited states in 57 Cu. A direct measurement of the cross section is impossible using present-day capabilities and thus indirect methods have to be employed. In such an approach the one-particle transfer reactions 56 Ni(d,p)57 Ni[147,148] and 56 Ni(3 He,d)57 Cu[149]\nhave been measured with a weak (3x104 /s) 56 Ni beam. Using the spectroscopic factors\nfrom these measurements, calculated proton penetrabilities, and γ-widths from the 57 Ni\nmirror [150] an estimate for the 56 Ni(p,γ)57 Cu reaction rate could be determined which\n\n\f19\nwas found to be 10 times larger than previous estimates[29,150]. For temperatures above\n1 GK the reaction rate was later slightly revised due to an improved treatment of the\nγ-widths [151].\nIn addition to radioactive beam mesurements, experiments with stable beams continue to play an important role for the lower part of the αp- and rp-process reaction\nchains below about Ca. Recent examples of experiments that use transfer reactions\nwith stable beams to reach nuclei in the rp-process include measurements using the\n20\nNe(3 He,α)19 Ne reaction at ANL[152], the 21 Ne(p,t)19 Ne reaction at KVI [153,154], the\n24\nMg(4 He,6 He)22 Mg reaction at RCNP [155], the 25 Mg(3 He,6 He)22 Mg reaction at Yale\n[156], the 24 Mg(p,t)22 Mg reaction at CNS Tokyo[157], the 12 C(12 C,2n)22 Mg reaction at\nANL[158], the 24 Mg(7 Li,8 He)23 Al and 28 Si(7 Li,8 He)27 P[143] reactions at MSU and a variety of reactions to access states in 19 Ne,26 Si and 26 Al at ANL, Notre Dame, Princeton,\nand Yale.\nFrom the compilation of the experimental reaction rates given above it can be seen that\nonly a small percentage of the astrophysical reaction rates which are relevant for X-ray\nbursts are based on experimental data. For most of them only theoretical estimates are\navailable. The same holds for many electron capture rates and pycnonuclear fusion cross\nsections involving neutron-rich nuclei. While significant progress is expected with existing\nfacilities, a new generation of radioactive beam facilities such as RIA is needed to address\nall the nuclear physics questions related to accreting neutron stars in X-ray binaries.\nThe authors thank Ed Brown for useful discussions concerning this manuscript. This\nwork has been supported by the Joint Institute for Nuclear Astrophysics (JINA) under\nNSF grant PHY 02-16783. H.S. acknowledges support from NSF grant PHY 0110253.\nK.E.R is supported by the U.S. Department of Energy, Office of Nuclear Physics under\ncontract W-31-109-ENG-38.\nREFERENCES\n1. D. Psaltis, astro-ph/0410536 (2004).\n2. T.E. Strohmayer and L. Bildsten, Compact Stellar X-ray Sources, ed. W. H. G. Lewin\nand M. van der Klies (Cambridge: Cambridge Univ. Press), astro-ph/0301544 (2003).\n3. L. Bildsten, P. Chang, and F. Paerels, Ap. J. 591 (2003), L29.\n4. J. Cottam, F. Paerels, and M. Mendez, Nature 420 (2002) 51.\n5. L. Bildsten, E. E. Salpeter, and I. Wasserman Ap. J. 384 (1992) 143.\n6. T. E. Strohmayer, and A. R. Villarreal Ap. J. 614 (2004) 121.\n7. P. C. Joss, Nature 270 (1977) 310.\n8. N. N. Weinberg, L. Bildsten, and H. Schatz, Ap. J. 639 (2006) 1018.\n9. J. Grindlay et al. Ap. J. 205 (1976) L127.\n10. R. D. Belian, J. P. Conner, and W. D. Evans, Ap. J. 206 (1976) L135.\n11. S. E. Woosley and R. E. Taam, Nature 263 101 (1976).\n12. L. Maraschi and A. Cavaliere, Highlights of Astronomy 4 (1977) 127.\n13. D. Q. Lamb and F. K. Lamb, Ap. J., 220 (1978) 220.\n14. C. J. Hansen and H. M. Van Horn, Ap. J. 195 (1975) 735.\n15. L. Bildsten, in The Many Faces of Neutron Stars, edited by A. Alpar, L. Bucceri, and\n\n\f20\n\n16.\n17.\n18.\n19.\n20.\n21.\n22.\n23.\n24.\n25.\n26.\n27.\n28.\n29.\n30.\n31.\n32.\n33.\n\n34.\n35.\n36.\n37.\n38.\n39.\n40.\n41.\n42.\n43.\n44.\n45.\n46.\n47.\n48.\n49.\n50.\n51.\n52.\n53.\n\nJ. Van Paradijs (Dordrecht, Kluwer, 1998), pp. astro–ph/9709094.\nW. H. G. Lewin, J. van Paradijs, and R. E. Taam, Space Sci. Rev. 62 (1993) 233.\nT. E. Strohmayer et al. Ap. J. 469 (1996) L9.\nA. Cumming et al. Ap. J. 564 (2002) 343.\nA. L. Piro and L. Bildsten, submitted to Ap. J. (2005), astro-ph/0502546.\nA. Cumming and L. Bildsten, Ap. J. 506 (1998) 842.\nP. N. McDermott, H. M. van Horn, and C. J. Hansen, Ap. J. 325 (1988) 725.\nD. Chakrabarty et al. Nature 424 (2003) 42.\nT. E. Strohmayer et al. Ap. J. 596 (2003) L67.\nM. P. Muno, D. K. Galloway, and D. Chakrabarty, Ap. J. 608, (2004), 930.\nT. E. Strohmayer, astro-ph/0401465 (2004).\nS. Bhattacharyya et al., astro-ph/0402534 (2004).\nS. E. Woosley et al., Ap. J. Suppl. 151 (2004) 75.\nR. K. Wallace and S. E. Woosley, Ap. J. Suppl. 45 (1981) 389.\nL. van Wormer et al. Ap. J. 432 (1994) 326.\nH. Schatz et al., Phys. Rep. 294 (1998) 167.\nH. Schatz et al., Phys. Rev. Lett. 86 (2001) 3471.\nM. Wiescher and H. Schatz, Journ. Phys. G Topical Review 25 (1999) R133.\nR. N. Boyd, M. Hencheck, and B. S. Meyer, in International Symposium on Origin of\nMatter and Evolution of Galaxies 97, Atami, Japan, edited by S. Kubono, T. Kajino,\nK. I. Nomoto, and I. Tanihata (World Scientific, New Jersey, Singapore, 1998), p.\n350.\nR. E. Taam, S. E. Woosley, and D. Q. Lamb, Ap. J. 459 (1996) 271.\nO. Koike et al., Astron. Astrophys. 342 (1999) 464.\nH. Schatz et al., Ap. J. 524 (1999) 1014.\nO. Koike et al. Ap. J. 603 (2004) 242.\nF.-K. Thielemann et al., Prog. in Part. and Nucl. Phys. 46 (2001) 46.\nJ. L. Fisker, F.-K. Thielemann, and M. Wiescher, Ap. J. 608 (2004) 61.\nM. Czerny, B. Czerny, and J. E. Grindlay, Ap. J. 312 (1987) 122.\nI. Fushiki et al. Ap. J. 390 (1992) 634.\nA. Cumming, astro-ph/0309626 (2003).\nR. E. Taam, Ap. J. 241, (1980), 358\nD. K. Galloway et al. Ap. J. 601 (2004) 466.\nB. A. Fryxell and S. E. Woosley, Ap. J. 261 (1982) 332.\nL. Bildsten, Ap. J. 438 (1995) 852.\nA. Spitkovsky, Y. Levin, and G. Ushomirsky, Ap. J. 566 (2002) 1018.\nM. Zingale et al. astro-ph/0211336 (2002).\nM. Zingale et. al. Ap. J. Suppl. 133 (2001) 195.\nR. Cornelisse et al. A&A 405 (2003), 1033.\nR. Narayan and J. S. Heyl, Ap. J. 599 (2003) 419.\nA. Heger, private communication (2004).\nM. Hencheck et al. Nuclei in the Cosmos III, Third International Symposium on Nuclear Astrophysics, Proceedings of the Symposium held at the National Laboratories\nof Gran Sasso, Assergi, L'Aquil, Italy, July 1994. New York: American Institute of\nPhysics Press. Edited by Maurizio Busso, Claudia M. Raiteri, and Roberto Gallino.\n\n\f21\n\n54.\n55.\n56.\n57.\n58.\n59.\n60.\n61.\n62.\n63.\n64.\n65.\n66.\n67.\n68.\n69.\n70.\n71.\n72.\n73.\n74.\n75.\n76.\n77.\n78.\n79.\n80.\n81.\n82.\n83.\n84.\n85.\n86.\n87.\n88.\n89.\n90.\n91.\n92.\n93.\n94.\n\nAIP Conference Proceedings, Vol. 327, 1995, p.331.\nD. L. Lambert, Astron. Astrophys. Rev. 3 (1992) 201.\nM. Arnould and S. Goriely, Phys. Rep. 384 (2003) 1.\nV. Costa et al., Astron. Astrophys. 358 (2000) L67.\nM. Jaeger et al. Phys. Rev. Lett. 87 (2001) 250.\nS. Goriely et al. Astron. Astrophys. 383 (2002) L27.\nN. Dauphas et al. astro-ph/0211452 (2002).\nJ. M. M. in't Zandt, R. Cornelisse, and A. Cumming, Astron. Astrophys. 426 (2004)\n257.\nJ. M. M. in't Zandt et al. astro-ph/0407087 (2004).\nT. E. Strohmayer and C. B. Markwardt, Ap. J. 577 (2002) 337.\nT. E. Strohmayer and E. F. Brown, Ap. J. 566 (2002) 1042.\nA. Cumming and L. Bildsten, Ap. J. 559 (2001) L127.\nH. Schatz, L. Bildsten, and A. Cumming, Ap. J. 583 (2003) L90.\nA. Cumming and J. Macbeth, Ap. J. 603 (2004) L37.\nE. F. Brown, Ap. J. 614 (2004) 57.\nW. Chen, C. R. Shrader, and M. Livio, Ap. J. 491 (1997) 312.\nS. Campana et al. A&A rev. 8 (1998) 279.\nM. Colpi, U. Geppert, D. Page, and A. Possenti, Ap. J. 548, L175 (2001).\nD. G. Yakolev, K. P. levenfish, and P. Haensel, Astron. Astrophys. 407 (2004) 265.\nE. F. Brown, L. Bildsten, and R. E. Rutledge, Ap. J. 504 (1998) L95.\nR. Rutledge et al., Ap. J. 529 (2000) 985.\nR. E. Rutledge et al.,Ap. J. 514 (1999) 945.\nR. E. Rutledge et al. Ap. J. 577 (2002) 346.\nR. Wjinands, astro-ph/0405089 (2004).\nR. Wijnands et al. Ap. J. 606 (2004) L61.\nV. Urpin, U. Geppert, and D. Konenkov, M.N.R.A.S. 295 (1998) 907.\nE. F. Brown and L. Bildsten, Ap. J. 496 (1998) 915.\nA. Cumming, P. Arras, and E. Zweibel, Ap. J. 609 (2004) 999.\nP. Haensel and J. L. Zdunik, Astron. Astrophys. 227 (1990) 431.\nP. Haensel and J. L. Zdunik, Astron. Astrophys. 229 (1990) 117.\nP. Haensel and J. L. Zdunik, Astron. Astrophys. 404 (2003) 33.\nL. Bildsten Ap. J. Lett. 501 (1998) 89.\nG. Ushomirsky, C. Cutler, and L. Bildsten, Monthly Not. of the Royal Astron. Soc.\n319 (2000) 902.\nP. B. Jones, astro-ph/0403400 to appear in Phys. Rev. Lett. (2004).\nA. E. Champagne and M. Wiescher, Ann. Rev. Nucl. Part. Sci. 42 (1992) 39.\nM. Wiescher, H. Schatz, and A. E. Champagne, Phil. Trans. Royal. Soc. London 356\n(1998) 2105.\nT. Radon et al. Phys. Rev. Lett. 78 (1997) 4701\nJ. Stadlmann et al., Phys. Lett. B586 (2004) 27\nA. Wöhr et al., Nucl. Phys. A742 (2004) 349\nM. Chartier. et al., Nucl. Phys. A637 (1998) 3\nH. Stolzenberg et al., Phys. Rev. Lett. 65 (1990) 3104\nG. Savard et al., Nucl. Phys. A626 (1997) 353\n\n\f22\n95.\n96.\n97.\n98.\n\nV. S. Kolhinen et al., Nucl. Instr. Methods A528 (2004) 776\nS. Schwarz et al. Nucl. Instr. Meth. B 204 (2003) 507\nG. Audi, A. H. Wapstra and C. Thibault, Nucl. Phys. A 729 (2003) 129.\nB. A. Brown, R. R. C. Clement, H. Schatz, A. Volya, W. A. Richter, Phys. Rev. C65\n(2002) 045802\n99. D. Lunney, J. M. Pearson, and C. Thibault, Rev. Mod. Phys. 75 (2003) 1021.\n100.J. A. Clark et al., Phys. Rev. Lett. 92 (2004) 192501\n101.J. A. Clark et al., Proceed. of the Fourth Internat. Conf. on Exotic Nuclei and Atomic\nMasses, (2004) 59\n102.D. Rodriguez et al. Phys. Rev. Lett. 93 (2004) 161104\n103.R. J. Tighe et al., Phys. Rev. C49 (1994) R2871\n104.J. Friese et al., in Proceedings of the XXIV Workshop on Gross Properties of Nuclei,\nHirschegg, Austria 1996, edited by H. Feldmeier, J. Knoll and W. Nörenberg (GSI\nDarmstadt 1996) p. 123\n105.G.M. Fuller, W.A. Fowler and M. J. Newman, Astrop.J. 252 (1982) 715\n106.J. Pruet and G. M. Fuller, Astrop. J. Suppl. 149 (2003) 189\n107.T. Rauscher, F. K. Thielemann, At. Data Nucle. Data Tabl. 75 (2000) 1\n108.H. Herndl et al. Phys. Rev. C 52 (1995) 1078.\n109.J. L. Fisker et al. Atomic Data and Nucl. Data Tab. 79 (2001) 241.\n110.H. O. U. Fynbo et al. Nature 433 (2005) 136\n111.P.Decrock et al., Phys. Rev. Lett. 67 (1991) 808\n112.Th. Delbar et al., Phys. Rev. C48 (1993) 3088\n113.S. Bishop et al., Phys. Rev. Lett. 90 (2003) 162501\n114.I. Y. Lee, Nucl. Phys. A 520 (1990) 641c\n115.W. F. Mueller et al., Nucl. Instr. Methods A 466 (2001) 492.\n116.T. Motobayashi et al., Phys. Lett. B264 (1991) 259\n117.J. Kiener et al., Nucl. Phys. A552 (1993) 66\n118.C. Angulo, NACRE-Nuclear Astrophysics Compilation of Reaction Rates,\nhttp://pntpm.ulb.ac.be/nacre/ (2003)\n119.X. Tang et al., Phys. Rev. C69 (2004) 055807\n120.B. Harss et al., Phys. Rev. Lett. 82 (1999) 3964\n121.J.C. Blackmon et al., Nucl Phys. A688 (2001) 142\n122.B. Harss et al., Phys. Rev. C65 (2002) 035803\n123.J. C. Blackmon et al., Nucl. Phys. A718 (2003) 127c\n124.M. Notani et al., Nucl. Phys. A746 (2004) 113c\n125.D. W. Bardayan et al., Phys. Rev. Lett. 83 (1999) 45\n126.D. W. Bardayan et al., Phys. Rev. C62 (2000) 055804\n127.A. Galindo-Uribarri et al. Nucl. Instr. Methods B172 (2000) 647\n128.W. Bradfield-Smith et al., Phys. Rev. C59 (1999) 3402\n129.D. Groombridge et al., Phys. Rev. C66 (2002) 055802\n130.S. Sinha et al., Bull. Am. Phys. Soc. (2004)\n131.R. D. Page et al., Phys. Rev. Lett. 73 (1994) 3066\n132.G. Vancraeynest et al., Phys. Rev. 57 (1998) 2711\n133.M. Couder et al. Phys. Rev. C 69 (2004) 022801\n134.L. O. Lamm et al., Nucl. Phys. A510 (1990) 503\n\n\f23\n135.S. Kubono et al., Phys. Rev. C46 (1992) 361\n136.B. A. Brown, A. E. Champagne, H. T. Fortune and R. Sherr, Phys. Rev. C48 (1993)\n1456\n137.D. Seweryniak et al., Phys. Lett. B590 (2004) 170\n138.R. E. Azuma et al., Nucl. Phys. A718 (2003) 199c\n139.J. M. D'Auria et al. Phys. Rev. C69 (2004) 065803\n140.S. Seuthe et al., Nucl. Phys. A514 (1990) 471\n141.F. Stegmüller et al., Nucl. Phys. A601, (1996) 168\n142.D. G. Jenkins et al., Phys. Rev. Lett.92 (2004) 031101\n143.J. A. Caggiano et al., Phys. Rev. C64 (2001) 025802\n144.T. Gomi et al., Nucl. Phys. A734 (2004) E77\n145.H. Schatz et al., Phys. Rev. Lett. 79 (1997) 3845\n146.R. R. C. Clement et al., Phys. Rev. Lett. 92 (2004) 172502\n147.K. E. Rehm et al., Phys. Rev. Lett. 80 (1998) 676\n148.K. E. Rehm et al., Nucl. Instr. Meth. A449 (2000) 208\n149.C. L. Jiang et al., Argonne National Laboratory Annual Report, ANL-99/12 (1999)\n11, unpublished\n150.X. G. Zhou et al. Phys. Rev. C53 (1996) 982\n151.O. Forstner et al. Phys. Rev. C64 (2001) 5801.\n152.K. E. Rehm et al., Phys. Rev. C67 (2003) 065809\n153.B. Davids et al., Phys. Rev. C67 (2003) 012801\n154.B. Davids et al., Phys. Rev. C67 (2003) 065808\n155.G. P. A. Berg et al., Nucl. Phys. A718, (2003) 608c\n156.J. A. Caggiano et al., Phys. Rev. C66 (2002) 015804\n157.N. Bateman et al., Phys. Rev. C63 (2001) 035803\n158.D. Seweryniak et al., accepted in Phys. Rev. Lett.\n\n\f"}