{"id": "http://arxiv.org/abs/astro-ph/0111425v1", "guidislink": true, "updated": "2001-11-21T20:33:26Z", "updated_parsed": [2001, 11, 21, 20, 33, 26, 2, 325, 0], "published": "2001-11-21T20:33:26Z", "published_parsed": [2001, 11, 21, 20, 33, 26, 2, 325, 0], "title": "Resolution of Cosmological Singularity and a Plausible Mechanism of the\n  Big Bang", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0111336%2Castro-ph%2F0111037%2Castro-ph%2F0111249%2Castro-ph%2F0111385%2Castro-ph%2F0111517%2Castro-ph%2F0111357%2Castro-ph%2F0111382%2Castro-ph%2F0111184%2Castro-ph%2F0111179%2Castro-ph%2F0111459%2Castro-ph%2F0111425%2Castro-ph%2F0111169%2Castro-ph%2F0111202%2Castro-ph%2F0111467%2Castro-ph%2F0111310%2Castro-ph%2F0111124%2Castro-ph%2F0111273%2Castro-ph%2F0111012%2Castro-ph%2F0111238%2Castro-ph%2F0111181%2Castro-ph%2F0111458%2Castro-ph%2F0111565%2Castro-ph%2F0111398%2Castro-ph%2F0111118%2Castro-ph%2F0111430%2Castro-ph%2F0111269%2Castro-ph%2F0111054%2Castro-ph%2F0111110%2Castro-ph%2F0111135%2Castro-ph%2F0111090%2Castro-ph%2F0111509%2Castro-ph%2F0111155%2Castro-ph%2F0111226%2Castro-ph%2F0111049%2Castro-ph%2F0111579%2Castro-ph%2F0111019%2Castro-ph%2F0111355%2Castro-ph%2F0111195%2Castro-ph%2F0111305%2Castro-ph%2F0111236%2Castro-ph%2F0111217%2Castro-ph%2F0111148%2Castro-ph%2F0111267%2Castro-ph%2F0111573%2Castro-ph%2F0111501%2Castro-ph%2F0111295%2Castro-ph%2F0111577%2Castro-ph%2F0111043%2Castro-ph%2F0111192%2Castro-ph%2F0111403%2Castro-ph%2F0111041%2Castro-ph%2F0111346%2Castro-ph%2F0111048%2Castro-ph%2F0111215%2Castro-ph%2F0111362%2Castro-ph%2F0111535%2Castro-ph%2F0111330%2Castro-ph%2F0111597%2Castro-ph%2F0111212%2Castro-ph%2F0111042%2Castro-ph%2F0111461%2Castro-ph%2F0111593%2Castro-ph%2F0111076%2Castro-ph%2F0111193%2Castro-ph%2F0111141%2Castro-ph%2F0111411%2Castro-ph%2F0111373%2Castro-ph%2F0111590%2Castro-ph%2F0111294%2Castro-ph%2F0111581%2Castro-ph%2F0111123%2Castro-ph%2F0111480%2Castro-ph%2F0111520%2Castro-ph%2F0111563%2Castro-ph%2F0111474%2Castro-ph%2F0111561%2Castro-ph%2F0111304%2Castro-ph%2F0111308%2Castro-ph%2F0111383%2Castro-ph%2F0111133%2Castro-ph%2F0111177%2Castro-ph%2F0111598%2Castro-ph%2F0111252%2Castro-ph%2F0111452%2Castro-ph%2F0111262%2Castro-ph%2F0111023%2Castro-ph%2F0111477%2Castro-ph%2F0111586%2Castro-ph%2F0111436%2Castro-ph%2F0111356%2Castro-ph%2F0111131%2Castro-ph%2F0111167%2Castro-ph%2F0111152%2Castro-ph%2F0111488%2Castro-ph%2F0111171%2Castro-ph%2F0111070%2Castro-ph%2F0111021%2Castro-ph%2F0111268%2Castro-ph%2F0111200%2Castro-ph%2F0111315%2Castro-ph%2F0111485&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Resolution of Cosmological Singularity and a Plausible Mechanism of the\n  Big Bang"}, "summary": "The initial cosmological singularity in the framework of the general theory\nof relativity is resolved by introducing the effect of the uncertainty\nprinciple of quantum theory without violating conventional laws of physics. A\nplausible account of the mechanism of the big bang, analogous to that of a\nnuclear explosion, is given and the currently accepted Planck temperature of\nabout 10^(32)K at the beginning of the big bang is predicted.\n  Subj-class: cosmology: theory-pre-big bang; mechanism of the big bang.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0111336%2Castro-ph%2F0111037%2Castro-ph%2F0111249%2Castro-ph%2F0111385%2Castro-ph%2F0111517%2Castro-ph%2F0111357%2Castro-ph%2F0111382%2Castro-ph%2F0111184%2Castro-ph%2F0111179%2Castro-ph%2F0111459%2Castro-ph%2F0111425%2Castro-ph%2F0111169%2Castro-ph%2F0111202%2Castro-ph%2F0111467%2Castro-ph%2F0111310%2Castro-ph%2F0111124%2Castro-ph%2F0111273%2Castro-ph%2F0111012%2Castro-ph%2F0111238%2Castro-ph%2F0111181%2Castro-ph%2F0111458%2Castro-ph%2F0111565%2Castro-ph%2F0111398%2Castro-ph%2F0111118%2Castro-ph%2F0111430%2Castro-ph%2F0111269%2Castro-ph%2F0111054%2Castro-ph%2F0111110%2Castro-ph%2F0111135%2Castro-ph%2F0111090%2Castro-ph%2F0111509%2Castro-ph%2F0111155%2Castro-ph%2F0111226%2Castro-ph%2F0111049%2Castro-ph%2F0111579%2Castro-ph%2F0111019%2Castro-ph%2F0111355%2Castro-ph%2F0111195%2Castro-ph%2F0111305%2Castro-ph%2F0111236%2Castro-ph%2F0111217%2Castro-ph%2F0111148%2Castro-ph%2F0111267%2Castro-ph%2F0111573%2Castro-ph%2F0111501%2Castro-ph%2F0111295%2Castro-ph%2F0111577%2Castro-ph%2F0111043%2Castro-ph%2F0111192%2Castro-ph%2F0111403%2Castro-ph%2F0111041%2Castro-ph%2F0111346%2Castro-ph%2F0111048%2Castro-ph%2F0111215%2Castro-ph%2F0111362%2Castro-ph%2F0111535%2Castro-ph%2F0111330%2Castro-ph%2F0111597%2Castro-ph%2F0111212%2Castro-ph%2F0111042%2Castro-ph%2F0111461%2Castro-ph%2F0111593%2Castro-ph%2F0111076%2Castro-ph%2F0111193%2Castro-ph%2F0111141%2Castro-ph%2F0111411%2Castro-ph%2F0111373%2Castro-ph%2F0111590%2Castro-ph%2F0111294%2Castro-ph%2F0111581%2Castro-ph%2F0111123%2Castro-ph%2F0111480%2Castro-ph%2F0111520%2Castro-ph%2F0111563%2Castro-ph%2F0111474%2Castro-ph%2F0111561%2Castro-ph%2F0111304%2Castro-ph%2F0111308%2Castro-ph%2F0111383%2Castro-ph%2F0111133%2Castro-ph%2F0111177%2Castro-ph%2F0111598%2Castro-ph%2F0111252%2Castro-ph%2F0111452%2Castro-ph%2F0111262%2Castro-ph%2F0111023%2Castro-ph%2F0111477%2Castro-ph%2F0111586%2Castro-ph%2F0111436%2Castro-ph%2F0111356%2Castro-ph%2F0111131%2Castro-ph%2F0111167%2Castro-ph%2F0111152%2Castro-ph%2F0111488%2Castro-ph%2F0111171%2Castro-ph%2F0111070%2Castro-ph%2F0111021%2Castro-ph%2F0111268%2Castro-ph%2F0111200%2Castro-ph%2F0111315%2Castro-ph%2F0111485&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The initial cosmological singularity in the framework of the general theory\nof relativity is resolved by introducing the effect of the uncertainty\nprinciple of quantum theory without violating conventional laws of physics. A\nplausible account of the mechanism of the big bang, analogous to that of a\nnuclear explosion, is given and the currently accepted Planck temperature of\nabout 10^(32)K at the beginning of the big bang is predicted.\n  Subj-class: cosmology: theory-pre-big bang; mechanism of the big bang."}, "authors": ["D. C. Choudhury"], "author_detail": {"name": "D. C. Choudhury"}, "author": "D. C. Choudhury", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.1469977", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0111425v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0111425v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, LaTex, Talk given at INPC 2001. To be published by the\n  American Institute of Physics in the Proceedings of the International Nuclear\n  Physics Conference that took place at the University of California campus in\n  Berkeley, California on July 30-August 3,2001", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0111425v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0111425v1", "journal_reference": "CP610, International Nuclear Physics Conference, INPC 2001, edited\n  by E. Norman et. al. 2002 American Institute of Physics, pp. 489-493.", "doi": "10.1063/1.1469977", "fulltext": "Resolution of Cosmological Singularity and a\nPlausible Mechanism of the Big Bang1\n\narXiv:astro-ph/0111425v1 21 Nov 2001\n\nD.C. Choudhury\nDepartment of Physics, Polytechnic University, Brooklyn, New York 11201 USA\ne-mail: dchoudhu@duke.poly.edu\nAbstract. The initial cosmological singularity in the framework of the general theory\nof relativity is resolved by introducing the effect of the uncertainty principle of quantum\ntheory without violating conventional laws of physics. A plausible account of the mechanism of the big bang, analogous to that of a nuclear explosion, is given and the currently\naccepted Planck temperature of ∼ 1032 K at the beginning of the big bang is predicted.\nSubj-class: cosmology: theory-pre-big bang; mechanism of the big bang.\n\nI. Introduction. The standard hot Big Bang model within the framework of the general theory\nof relativity has been spectacularly successful in describing the evolution of the universe from ten\nthousandth of a second after the big bang to the present time. Nevertheless, the occurrence of the\ninitial singularity, a state of infinite density and temperature, preceding the big bang as shown by\nthe theorems [1,2] of Penrose and of Hawking and Penrose, raises some of the deepest questions\nconcerning the foundation of this model of cosmology. To resolve this problem, we propose that\nduring the process of the gravitational collapse of the universe, in the domain of the infinitesimally\nsmall region of space-time around the initial singularity, the general theory of relativity by itself\nis incomplete and the introduction of the effect of quantum theory becomes absolutely necessary.\nTherefore it is assumed that at the end of the gravitational collapse, without violating the uncertainty\nprinciple, the total mass of the universe including all forms of energy condensed into the primordial\nblack hole (PBH) in a state of ∼ absolute zero temperature. The reasoning for this assumption\nis consistent with Penrose's argument based on thermodynamic considerations that the universe\nwas initially very regular (i.e., in a state of zero entropy); Chandrasekhar [3] likewise agreed with\nPenrose's view, contrary to those who hold that the chaos at the initial singularity was maximal.\nII. Quantization of energy. The energy of the collapsed state of the universe (PBH), in light of\nthe above argument, is quantized in such a manner that each quantum of mass (frozen energy) is\ncharacterized by the fundamental constants of the general theory of relativity and of quantum theory\n(namely G, h̄, c). For this purpose the principle of dimensional analysis and the reciprocity relation,\nanalogous to that of the unitarity condition of quantum theory, are incorporated into our method\nof quantization. Consequently, the physical properties of the quantized energy (cosmic particle)\nremain independent of the units in which they are measured and also the magnitude of its mass\nhas the lowest value. Since the dimensions of G, h̄, c, and mass (M ) are known, the only simplest\ndimensionless combinations which can be formed of them are GM 2 /h̄c and h̄c/GM 2 . Therefore\nthey satisfy the following condition:\nGM 2\nh̄c\n=\n.\n2\nGM\nh̄c\n\n(1)\n\nThe only physical solution out of the four solutions, ±(h̄c/G)1/2 and ±i(h̄c/G)1/2 for M , we\nhave chosen the real positive value for the mass M :\n1 Talk given at INPC 2001. To be published by the American Institute of Physics in the Proceedings of the\nInternational Nuclear Physics Conference that took place at the University of California campus in Berkeley, California\non July 30-August 3, 2001.\n\n\fD.C. Choudhury: Cosmological Singularity and a Plausible Mechanism of the Big Bang\n\nM=\n\n\u0012\n\nh̄c\nG\n\n\u00131/2\n\n∼\n= 2.2 × 10−5 gm.\n\n2\n\n(2)\n\nThis is the lowest mass of the quantized frozen energy which we call the cosmic particle. The\nmagnitude of this mass is identical to that of the Planck's mass which he derived from his theory of\nthe black body radiation (Planck 1899) [4]. Although the values of their masses are the same, their\nphysical properties are entirely different. One is an elementary quantum of frozen energy which\nhas only rest mass while the other is the largest quantum of radiation energy which has zero rest\nmass. The intrinsic spin of this cosmic particle is considered to be zero because: (i) The method of\nquantization of frozen energy is independent of any spin and depends only on the constants G, h̄,\nand c; ; (ii) The method of quantization does not involve any dynamical operator which can generate\nintrinsic spin; (iii) If this particle had an intrinsic spin, it would not have the lowest cosmic unit of\nmass, rather its lowest mass would be increased by an amount equivalent to the rotational energy\nof its intrinsic spin; and finally (iv) Its shape must be perfectly spherical because it is in a state of\nabsolute zero temperature and of lowest energy state. Therefore, we conclude that most likely its\nintrinsic spin is zero and it is a boson.\nIII. Properties of quantized particles. The minimum size and minimum lifetime of the quantized\ncosmic particles, each of mass, M = (h̄c/G)1/2 , are determined within the framework of the uncertainty principle (Heisenberg 1927) [5]. Profound implications of the uncertainty principle in physical\nterms are presented in complementarity principle (Bohr 1928) [6]. In a four-dimensional space-time,\ncoordinates of a particle and its corresponding components of energy-momentum, the uncertainty\nrelations are:\n∆x * ∆px ≥ h̄; ∆y * ∆py ≥ h̄; ∆z * ∆pz ≥ h̄ and ∆t * ∆E ≥ h̄.\nLet(∆x)min = (∆y)min = (∆z)min ≡ Lmin ,\n(∆px )max = (∆py )max = (∆pz )max ≡ Pmax = M c,\n(∆t)min ≡ τm and (∆E)max ≡ E = M c2 ,\ntherefore:\n\n\u00131/2\n\u0012\nh̄\nh̄G\n∼\nLmin =\n≈ 1.6 × 10−33 cm and\n=\nMc\nc3\n\u0013 \u0012\n\u00131/2\n\u0012\nh̄G\nh̄\n∼\n=\n≈ 5.3 × 10−44 sec.\nτm =\nM c2\nc5\n\n(3)\n(4)\n\nLmin(L) and τm are interpreted as the minimum size of localization and minimum lifetime (time\nscale) of the quantized cosmic particle. It is significant that the values of Planck's mass, length, and\ntime (Planck 1899) [4] are identical to those of the mass, size, and minimum lifetime of the cosmic\nparticle obtained in the present investigation. However, they are entirely different in their properties\nand these different physical properties of the cosmic particle play the most important role in the big\nbang theory. Thus our results provide new significance into Planck's system of units and show that\nthese units are fundamental.\nIV. Structure of the modified singularity. The constituents of the modified initial cosmological\nsingularity (PBH) are cosmic particles, each of mass, M = (h̄c/G)1/2 , and minimum size of localization, Lmin = (Gh̄/c3 )1/2 . These particles are bosons and obey the Bose-Einstein statistics (Bose 24;\nEinstein 1924,1925a) [7,8]. Consequently, without violating the uncertainty principle of quantum\ntheory and putting all the Bose-Einstein particles in the lowest energy state as T → 0, the maximum\ndensity of matter, ρmax , in the primordial black hole (PBH) is given as a function of G, h̄, and c:\n\u0012 5 \u0013\nc\n3\n∼\n(5)\nρmax =\n= 1.2 × 1093 gm/cm3 .\n4π h̄G2\n\n\fD.C. Choudhury: Cosmological Singularity and a Plausible Mechanism of the Big Bang\n\n3\n\nThe minimum volume and the minimum size (rmin ) of the structure of the modified initial\nsingularity are determined taking the total mass of the universe to be about 5.68 × 1056 gms.\nThis estimation of mass is based on a typical cosmological model without cosmological constant,\ncompatible with astronomical observations and with Einstein's conception of cosmology (Misner,\nThorne, & Wheeler 1973) [9]. We have already estimated the mass density to be about 1093 gm/cm3\nwhich together with the total mass of the universe leads to the minimum volume 4.76×10−37 cm3 and\nthe minimum size of the radius (rmin ) 4.8×10−13 cm, about one hundred thousandth of the size of an\natom. These results are significant because they provide a physical interpretation and a reasonable\nresolution of the initial cosmological singularity predicated by the general theory of relativity. It is\nrelevant to point out here that these numbers (related to minimum volume and minimum radius)\nmay be considered illustrative because they depend on the mass of the gravitationally collapsed\nstate. Nevertheless the present procedure, within the framework of the general theory of relativity\nand of the uncertainty principle of quantum theory, remains valid to resolve the problem of the initial\ncosmological singularity. The preservation of the laws of thermodynamics are discussed below.\nV. Thermodynamic properties of the PBH. From the available information about the temperatures of white dwarfs, neutron stars, and black holes (Hawking 1988) [10] , and as well as from\nPenrose's argument (Chandrasekhar 1990) [3] we infer, as stated above, that the temperature of\nthe PBH goes to zero in its final collapsed state. To calculate the entropy of this system we utilize\nBoltzmann's relation between the entropy S and thermodynamic probability W :\nS = kβ ln W + S◦\n\n(6)\n\nwhere kβ and S◦ are Boltzmann's and integration constants respectively. The first term, kβ ln W\nis interpreted as the internal entropy of the matter present inside the PBH and S◦ as the external\nentropy but within the boundary of the surface area of the event horizon which is inaccessible to an\nexterior observer. Since the quantized matter inside the PBH consists of bosons, its properties can\nbe described by Bose-Einstein statistics. Therefore the probability W can be written as (Einstein\n1924,1925a) [8]:\nY (N s + Z s − 1)!\nW =\n.\n(7)\nN s ! (Z s − 1)!\ns\nwhere N s are the number of particles and Z s are the number of subcells in the s-th cell. We have\npointed out above, all N bosons go into the lowest energy state as T → 0, in this limit N s = 0 for\nall other cells. Therefore W → 1, kβ ln W → 0, and S → S◦ . Consequently the internal entropy of\nPBH → 0 as T → 0. This result is consistent with the prediction of Einstein in 1925 that B-E gas\nsatisfies the third law of thermodynamics (Einstein 1925b; Pais 1982) [11,12].\nThe entropy S◦ , inaccessible to an exterior observer, is calculated within the framework of the\ntheory of black hole entropy based on the second law of thermodynamics and information theory\ndeveloped by Bekenstein (1973) [13]. Therefore:\n\u0012\n\u0013\n1 ln 2\nkβ c3 h̄−1 G−1 A\n(8)\nS = S◦ =\n2 4π\nwhere A is the surface area of the event horizon of the PBH corresponding to the Schwarzschild's\nradius RSch = 2GM/c2 and A = 16πM 2 G2 /c4 ; here M represents the total mass of PBH. The\nestimated value of the entropy of PBH is found to be ≈ 1.32 × 10107 erg*K−1 which is extremely\nlarge as expected.\nFinally the internal pressure in the final phase of the gravitational collapse (PBH) is evaluated\nwithin the framework of correspondence principle (Bohr 1923) [14] and Newton's gravitational theory,\nassuming that the pressure inside the PBH is generated by an immense, attractive gravitational force\nalone. At a distance r from the center of PBH, the pressure P (r) is given by:\nP (r) =\n\n\u0001\n2π 2\n2\n− r2 ; r ≤ rmin ,\nGρmax rmin\n3\n\n(9)\n\n\fD.C. Choudhury: Cosmological Singularity and a Plausible Mechanism of the Big Bang\n\n4\n\nwhere ρmax and rmin are the maximum matter density and minimum radius of the (PBH) respectively.\nThe maximum pressure when r → 0, at the center, P (r → 0) is calculated using the earlier estimated\nvalues of ρmax ≈ 1.2 × 1093 gm/cm3 and rmin ≈ 4.8 × 10−13 cm. The result is P (r → 0) ≈\n5 × 10154 dynes/cm2 , indeed extremely large.\nVI. Plausible mechanism of the big bang. Based on our knowledge of nuclear fission and nuclear\nexplosives, we give a simplified plausible account of the mechanism of the big bang. Just as the\nsalient features of the fission of a nucleus, say uranium by slow neutrons, have been fully interpreted\nin terms of the liquid drop model, originally by Bohr & Wheeler (1939) [15]; subsequently, this\ninformation has been successfully utilized in the design of various types of explosives – from nuclear\nfission to nuclear hydrogen bombs. For example, the basic design of a nuclear implosion bomb\n(Krane 1987) [16] consists of a solid spherical subcritical mass of the fissionable material (e.g., 235 U\nor 239 Pu) surrounded by a spherical shell of conventional chemical explosives. An initiator at the\ncenter provides neutrons to start a chain reaction. When the conventional explosives are detonated in\nexact synchronization, a spherical shock wave compresses the fissionable material into a supercritical\nstate, resulting in an explosion. Now we illustrate that many of the basic characteristics of a nuclear\nfission bomb are naturally present in PBH.\nIn the present instance: (1) the PBH which consists of unstable quantized cosmic particles\n(bosons) is analogous to the solid spherical subcritical mass of the fissionable material; (2) the\nvacuum energy fluctuations caused by the uncertainty principle of quantum theory surrounding\nthe PBH (within the boundary of its event horizon) can produce results similar to those of the\nconventional explosives surrounding the fissionable material of the bomb; (3) the unstable cosmic\nparticles, each of Planck's mass, are analogous to the nuclei of the fissionable material; and (4)\nthe constraint of uncertainty principle and the maximum gravitational pressure at the innermost\ncentral region of PBH may trigger the explosion (big bang) analogous to that of the initiator at the\ncenter of the bomb which provides neutrons to begin the chain reaction resulting in explosion. In an\nexplosion of a nuclear bomb, only a very small fraction of mass of each nucleus of fissionable material\nis transformed into kinetic energy while in the explosion of the PBH, total mass (M ∼\n= 2.2×10−5 gms)\nof each unstable cosmic particle is converted into kinetic energy resulting in temperature of 1032 K,\nthe currently accepted temperature at the beginning of the big bang. The total mass of the PBH\nconsisting of nearly 1061 cosmic particles, each of mean lifetime (decay rate) of the order of τm ≈\n5.3 × 10−44 sec, is transformed into kinetic energy ≈ 1077 erg, in less than 10−40 second resulting in\nthe biggest explosion, the big bang.\nThe extension and implications of the present investigation are offered in Ref. [17] for the largescale structure of the universe within the framework of the Friedmann-Robertson-Walker cosmology\n[18] also known as the standard cosmology.\nVII. Conclusion. The initial singularity, a state of infinite density and temperature preceding\nthe big bang, raises grave questions concerning the foundation of the big bang model of the modern\ncosmology. This problem is resolved by introducing the effects of the uncertainty principle in the\ndomain of the infinitesimally small region of space-time during the process of the gravitational\ncollapse of the universe. Consequently the end of the collapse, instead of resulting in a state of\nsingularity, results in the primordial black hole (PBH), a state of finite volume, finite density, finite\ntemperature → 0, and the finite internal entropy of the matter present inside the PBH → 0. A\nplausible mechanism of the big bang, an explosion of the PBH, analogous to that of a nuclear\nexplosion, is presented. The justification for the basic assumptions in the present investigation is\nalso given within the framework of the conventional laws of physics.\n\n\fD.C. Choudhury: Cosmological Singularity and a Plausible Mechanism of the Big Bang\n\n5\n\nREFERENCES\n[1] Penrose, R., Phys. Rev. Letters 14, 57-59 (1965).\n[2] Hawking, S. W., and Penrose, R., Proc. Roy. Soc. London A314, 529-548 (1970).\n[3] Chandrasekhar, S., Selected Papers, Volume 5, Relativistic Astrophysics, University of\nChicago, Chicago, 1990, p. 577.\n[4] Planck, M., Sitzungsberichte, Deut. Akd. Wiss. Kl, Math-Phys. Tech., Berlin, 440-480\n(1899).\n[5] Heisenberg, W., Zeits. f. Physik, 43, 172-198 (1927).\n[6] Bohr, N., Nature, 121, 580- 590 (1928).\n[7] Bose, S. N., Zeits, f. Physik, 26, 178-181 (1924).\n[8] Einstein, A., Sitzb. Preuss. Akad. Wiss. Phys.-Math. Kl., Berlin, 261-267 (1924); ibid.,\n3-14 (1925a).\n[9] Misner, C. W., Thorne, K. S., Wheeler, J. W., Gravitation, W. H. Freeman & Co., San\nFrancisco, 1973, p. 738.\n[10] Hawking, S. W., A Brief History of Time, Bantam Books, New York, 1988, pp. 105-108.\n[11] Einstein, A., Sitzb. Preuss. Akad. Wiss. Phys.-Math. Kl. Berlin, 18-25 (1925b)\n[12] Pais, A., Subtle is the Lord: The Science and the Life of Albert Einstein, Oxford University\nPress, New York, 1982, p. 431.\n[13] Bekenstein, J. D., Phys. Rev. D7, 2333-2346 (1973).\n[14] Bohr, N., Zeits. f. Physik 13, 117-165 (1923).\n[15] Bohr, N., and Wheeler, J. W., Phys. Rev. 56, 426-450 (1939).\n[16] Krane, K. S., Introductory Nuclear Physics, John Wiley & Sons , Inc., New York, 1987, p.\n521.\n[17] Choudhury, D. C., arXiv: astro-ph/0103456 (2001).\n[18] Kolb, E. W., and Turner, M. S., The Early Universe, Paper Back Edition, Addison-Wesley,\nMassachusetts, 1994, pp. 47-86.\n\n\f"}