{"id": "http://arxiv.org/abs/astro-ph/0410076v2", "guidislink": true, "updated": "2004-12-29T06:05:16Z", "updated_parsed": [2004, 12, 29, 6, 5, 16, 2, 364, 0], "published": "2004-10-04T16:08:40Z", "published_parsed": [2004, 10, 4, 16, 8, 40, 0, 278, 0], "title": "Planck-scale Lorentz-symmetry test theories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0410071%2Castro-ph%2F0410467%2Castro-ph%2F0410717%2Castro-ph%2F0410605%2Castro-ph%2F0410109%2Castro-ph%2F0410241%2Castro-ph%2F0410643%2Castro-ph%2F0410248%2Castro-ph%2F0410494%2Castro-ph%2F0410435%2Castro-ph%2F0410272%2Castro-ph%2F0410363%2Castro-ph%2F0410373%2Castro-ph%2F0410608%2Castro-ph%2F0410397%2Castro-ph%2F0410105%2Castro-ph%2F0410101%2Castro-ph%2F0410417%2Castro-ph%2F0410188%2Castro-ph%2F0410278%2Castro-ph%2F0410121%2Castro-ph%2F0410162%2Castro-ph%2F0410306%2Castro-ph%2F0410211%2Castro-ph%2F0410615%2Castro-ph%2F0410740%2Castro-ph%2F0410586%2Castro-ph%2F0410358%2Castro-ph%2F0410023%2Castro-ph%2F0410146%2Castro-ph%2F0410320%2Castro-ph%2F0410733%2Castro-ph%2F0410172%2Castro-ph%2F0410737%2Castro-ph%2F0410026%2Castro-ph%2F0410222%2Castro-ph%2F0410214%2Castro-ph%2F0410286%2Castro-ph%2F0410327%2Castro-ph%2F0410153%2Castro-ph%2F0410351%2Castro-ph%2F0410470%2Castro-ph%2F0410035%2Castro-ph%2F0410004%2Castro-ph%2F0410680%2Castro-ph%2F0410736%2Castro-ph%2F0410114%2Castro-ph%2F0410705%2Castro-ph%2F0410268%2Castro-ph%2F0410207%2Castro-ph%2F0410657%2Castro-ph%2F0410228%2Castro-ph%2F0410539%2Castro-ph%2F0410297%2Castro-ph%2F0410476%2Castro-ph%2F0410493%2Castro-ph%2F0410662%2Castro-ph%2F0410058%2Castro-ph%2F0410660%2Castro-ph%2F0410623%2Castro-ph%2F0410719%2Castro-ph%2F0410145%2Castro-ph%2F0410034%2Castro-ph%2F0410488%2Castro-ph%2F0410118%2Castro-ph%2F0410276%2Castro-ph%2F0410182%2Castro-ph%2F0410233%2Castro-ph%2F0410570%2Castro-ph%2F0410451%2Castro-ph%2F0410353%2Castro-ph%2F0410093%2Castro-ph%2F0410670%2Castro-ph%2F0410628%2Castro-ph%2F0410574%2Castro-ph%2F0410436%2Castro-ph%2F0410345%2Castro-ph%2F0410562%2Castro-ph%2F0410160%2Castro-ph%2F0410187%2Castro-ph%2F0410510%2Castro-ph%2F0410369%2Castro-ph%2F0410014%2Castro-ph%2F0410722%2Castro-ph%2F0410112%2Castro-ph%2F0410641%2Castro-ph%2F0410540%2Castro-ph%2F0410576%2Castro-ph%2F0410076%2Castro-ph%2F0410337%2Castro-ph%2F0410003%2Castro-ph%2F0410716%2Castro-ph%2F0410462%2Castro-ph%2F0410197%2Castro-ph%2F0410441%2Castro-ph%2F0410335%2Castro-ph%2F0410032%2Castro-ph%2F0410069%2Castro-ph%2F0410692%2Castro-ph%2F0410573%2Castro-ph%2F0410466&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Planck-scale Lorentz-symmetry test theories"}, "summary": "In the recent quantum-gravity literature there has been strong interest in\nthe possibility of Planck-scale departures from Lorentz symmetry, including\npossible modifications of the energy/momentum dispersion relation. I stress\nthat a meaningful characterization of the progress of experimental bounds on\nthese Planck-scale effects requires the analysis of some reference test\ntheories, and I propose to focus on two ``minimal'' test theories, a\npure-kinematics test theory and an effective-field-theory-based test theory. I\nillustrate some features of the phenomenology based on these test theories\nconsidering some popular strategies for constraining Planck-scale effects, and\nin particular I observe that sensitivities that are already in the Planck-scale\nrange for some parameters of the two test theories can be achieved using\nobservations of TeV photons from Blazars, both using the so-called ``gamma-ray\ntime-of-flight analyses'' and using the now robust evidence of absorption of\nTeV photons. Instead the Crab-nebula synchrotron-radiation analyses, whose\npreliminary sensitivity estimates raised high hopes, actually do not lead to\nany bound on the parameters of the two ``minimal'' test theories. The\nCrab-nebula synchrotron-radiation analyses do however constrain some possible\ngeneralizations of one of the minimal test theories. As an example of\nforthcoming data which could provide extremely stringent (beyond-Planckian)\nlimits on the two minimal test theories I consider the possibility of studies\nof the GZK cutoff for cosmic-rays.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0410071%2Castro-ph%2F0410467%2Castro-ph%2F0410717%2Castro-ph%2F0410605%2Castro-ph%2F0410109%2Castro-ph%2F0410241%2Castro-ph%2F0410643%2Castro-ph%2F0410248%2Castro-ph%2F0410494%2Castro-ph%2F0410435%2Castro-ph%2F0410272%2Castro-ph%2F0410363%2Castro-ph%2F0410373%2Castro-ph%2F0410608%2Castro-ph%2F0410397%2Castro-ph%2F0410105%2Castro-ph%2F0410101%2Castro-ph%2F0410417%2Castro-ph%2F0410188%2Castro-ph%2F0410278%2Castro-ph%2F0410121%2Castro-ph%2F0410162%2Castro-ph%2F0410306%2Castro-ph%2F0410211%2Castro-ph%2F0410615%2Castro-ph%2F0410740%2Castro-ph%2F0410586%2Castro-ph%2F0410358%2Castro-ph%2F0410023%2Castro-ph%2F0410146%2Castro-ph%2F0410320%2Castro-ph%2F0410733%2Castro-ph%2F0410172%2Castro-ph%2F0410737%2Castro-ph%2F0410026%2Castro-ph%2F0410222%2Castro-ph%2F0410214%2Castro-ph%2F0410286%2Castro-ph%2F0410327%2Castro-ph%2F0410153%2Castro-ph%2F0410351%2Castro-ph%2F0410470%2Castro-ph%2F0410035%2Castro-ph%2F0410004%2Castro-ph%2F0410680%2Castro-ph%2F0410736%2Castro-ph%2F0410114%2Castro-ph%2F0410705%2Castro-ph%2F0410268%2Castro-ph%2F0410207%2Castro-ph%2F0410657%2Castro-ph%2F0410228%2Castro-ph%2F0410539%2Castro-ph%2F0410297%2Castro-ph%2F0410476%2Castro-ph%2F0410493%2Castro-ph%2F0410662%2Castro-ph%2F0410058%2Castro-ph%2F0410660%2Castro-ph%2F0410623%2Castro-ph%2F0410719%2Castro-ph%2F0410145%2Castro-ph%2F0410034%2Castro-ph%2F0410488%2Castro-ph%2F0410118%2Castro-ph%2F0410276%2Castro-ph%2F0410182%2Castro-ph%2F0410233%2Castro-ph%2F0410570%2Castro-ph%2F0410451%2Castro-ph%2F0410353%2Castro-ph%2F0410093%2Castro-ph%2F0410670%2Castro-ph%2F0410628%2Castro-ph%2F0410574%2Castro-ph%2F0410436%2Castro-ph%2F0410345%2Castro-ph%2F0410562%2Castro-ph%2F0410160%2Castro-ph%2F0410187%2Castro-ph%2F0410510%2Castro-ph%2F0410369%2Castro-ph%2F0410014%2Castro-ph%2F0410722%2Castro-ph%2F0410112%2Castro-ph%2F0410641%2Castro-ph%2F0410540%2Castro-ph%2F0410576%2Castro-ph%2F0410076%2Castro-ph%2F0410337%2Castro-ph%2F0410003%2Castro-ph%2F0410716%2Castro-ph%2F0410462%2Castro-ph%2F0410197%2Castro-ph%2F0410441%2Castro-ph%2F0410335%2Castro-ph%2F0410032%2Castro-ph%2F0410069%2Castro-ph%2F0410692%2Castro-ph%2F0410573%2Castro-ph%2F0410466&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the recent quantum-gravity literature there has been strong interest in\nthe possibility of Planck-scale departures from Lorentz symmetry, including\npossible modifications of the energy/momentum dispersion relation. I stress\nthat a meaningful characterization of the progress of experimental bounds on\nthese Planck-scale effects requires the analysis of some reference test\ntheories, and I propose to focus on two ``minimal'' test theories, a\npure-kinematics test theory and an effective-field-theory-based test theory. I\nillustrate some features of the phenomenology based on these test theories\nconsidering some popular strategies for constraining Planck-scale effects, and\nin particular I observe that sensitivities that are already in the Planck-scale\nrange for some parameters of the two test theories can be achieved using\nobservations of TeV photons from Blazars, both using the so-called ``gamma-ray\ntime-of-flight analyses'' and using the now robust evidence of absorption of\nTeV photons. Instead the Crab-nebula synchrotron-radiation analyses, whose\npreliminary sensitivity estimates raised high hopes, actually do not lead to\nany bound on the parameters of the two ``minimal'' test theories. The\nCrab-nebula synchrotron-radiation analyses do however constrain some possible\ngeneralizations of one of the minimal test theories. As an example of\nforthcoming data which could provide extremely stringent (beyond-Planckian)\nlimits on the two minimal test theories I consider the possibility of studies\nof the GZK cutoff for cosmic-rays."}, "authors": ["Giovanni Amelino-Camelia"], "author_detail": {"name": "Giovanni Amelino-Camelia"}, "author": "Giovanni Amelino-Camelia", "arxiv_comment": "shorter version to comply with page limits of proceedings volume (to\n  appear in proceedings of Huntsville Workshop 2002)", "links": [{"href": "http://arxiv.org/abs/astro-ph/0410076v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0410076v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0410076v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0410076v2", "journal_reference": null, "doi": null, "fulltext": "Improving limits on Planck-scale Lorentz-symmetry test theories\nGiovanni AMELINO-CAMELIA\n\narXiv:astro-ph/0410076v2 29 Dec 2004\n\nDipartimento di Fisica, Università di Roma \"La Sapienza\" and INFN Sez. Roma1,\nP.le Moro 2, 00185 Roma, Italy\nIn the recent quantum-gravity literature there has been strong interest in the possibility of Planckscale departures from Lorentz symmetry. I focus on two \"minimal\" test theories, a pure-kinematics\ntest theory and an effective-field-theory-based test theory, that could be used in this phenomenology.\nPlanck-scale-significant bounds on some parameters of the two test theories can be established using\nobservations of TeV photons from Blazars. Crab-nebula synchrotron-radiation analyses, whose\npreliminary sensitivity estimates had raised high hopes, actually do not lead to any bound on the\nparameters of the two test theories. Very stringent (beyond-Planckian) limits could be obtained, for\nboth test theories, if the GZK cutoff for cosmic-rays is confirmed experimentally.\n\n1\n\n\fI. ON THE FATE OF LORENTZ SYMMETRY IN QUANTUM SPACETIME\n\nIt has been recently realized that in various approaches to the quantum-gravity problem one encounters nonclassical\nfeatures of spacetime that lead to small departures from Lorentz symmetry, and a quantum-gravity-motivated phenomenology of departures from Lorentz symmetry was proposed in Ref. [ [1]]. The idea that Lorentz symmetry might\nbe only an approximate symmetry has then been considered in quantum-gravity models based on spacetime foam\npictures [ [2]], in loop quantum gravity models [ [3,4]], in noncommutative geometry models [ [5–9]], including some\nscenarios for noncommutative geometry that are relevant in string theory [6,7], and in other string-theory-inspired\nscenarios [ [10]].\nAt a strictly phenomenological level one can view this interest in possible Planck-scale departures from Lorentz\nsymmetry as originating from the idea that the sought quantum gravity might involve some sort of \"granularity\" of\nspacetime (\"spacetime quanta\"), and on the basis of experience with certain physical systems (especially condensedmatter systems1 ) one can expect that granularity of the medium in which propagation occurs might lead to energydependent corrections [1] to the dispersion relation. At energies much larger than the particle mass but smaller than\nthe granularity (Plankian) energy scale, the dispersion relation could be of the type\n\u0012 n\u0013\nE n+3\nE\n2\n2\n2\n2\n+\nO(\nm ≃ E − p~ + η~\np\n)\n(1)\nEpn\nEpn+1\nwhere Ep ≃ 1.2*1016 T eV is the Planck scale, η parametrizes the ratio between the Planck scale and the scale of\nquantization of spacetime, and the power n is a key characteristic of the magnitude of the effects to be expected.\nThe literature on the subject is characterized primarily by a debate on weather one should or should not assume\nthat these departures from Lorentz symmetry can be introduced within the framework of effective low-energy field\ntheory. Those who are most concerned about the reliability of this assumption opt to limit the phenomenology to\ncontexts in which one is able to perform a pure-kinematics test. Those who assume the validity of low-energy effective\nfield theory can use it to describe some aspects of dynamics and therefore have available a wider class limit-setting\nopportunities.\nFor these two perspectives on the problem there are correspondingly two \"natural\" [ [12]] starting points as test\ntheories on which to base the phenomenology. When one does not assume the validity of low-energy effective field\ntheory, it is natural to set up a pure-kinematics test theory based on the dispersion relation (1) and on the assumption\nthat the energy-momentum conservation rules are not Planck-scale modified (even though there are frameworks in\nwhich instead both the dispersion relation and the rules of energy-momentum conservation would be modified; see, e.g.,\nRef. [ [8]]). The pure-kinematics objectives are also fully compatible with the assumption of \"universality\", i.e. the\nmodification of the dispersion relation is assumed to affect in the same way (same values of parameters) all particles.\nThese hypotheses constitute the \"minimal AEMNS test theory\" [ [12]] (where \"AEMNS\" refers to the authors of\nRef. [ [1]], which introduced the first building blocks of this test theory). While it is rather natural to get started\non this pure-kinematics phenomenology using the \"minimal AEMNS test theory\", of course one can contemplate\nvarious generalizations (\"non-minimal versions of the AEMNS test theory\"), including the one of a \"non-universal\"\nPlanck-scale modification of the dispersion relation.\nWhen adopting the alternative perspective, which assumes the applicability of effective low-energy field theory,\none can again take the dispersion-relation parametrization of Eq. (1), but consistency with the use of the fieldtheoretic setup imposes to renounce immediately to the simplifying hypothesis of universality. In fact, the constraint\nof introducing the new effects within the field-theoretic formalism, with its reference to a Lagrangian density, restricts\nthe types of modifications one can consider, and in particular it is easy to show [ [3,13]] that the allowed terms in the\nLagrangian density lead to a polarization dependence of the effect for photons: in the field-theoretic setup it turns\nout that when right-circular polarized photons satisfy the dispersion relation E 2 ≃ p2 + ηγ p3 /Ep then necessarily leftcircular polarized photons satisfy the \"opposite sign\" dispersion relation E 2 ≃ p2 − ηγ p3 /Ep . For spin-1/2 particles\nthe analysis reported in Ref. [ [13]] leads to the introduction of two independent dispersion-relation-deformation\nparameters, one for each helicity. Since photons experience a complete correlation of the sign of the effect with\npolarization it appears natural to assume (at least in the first works exploring this scenario) that also for fermions\nthe modification of the dispersion relation should have the same magnitude for both signs of the helicity, but have a\n\n1\n\nSome authors have also argued (see, e.g., Ref. [2]) that the quantum-spacetime environment might act in a way that to some\nextent resembles the one of a thermal environment. It is well established (see, e.g., Ref. [11]) that in a thermal environment\nthe energy-momentum dispersion relations are naturally modified.\n\n2\n\n\fcorrelation between the sign of the helicity and the sign of the dispersion-relation modification. This would correspond\nto the natural-looking assumption that the Planck-scale effects are such that in a beam composed of randomly selected\nparticles the average speed in the beam is still governed by ordinary special relativity (the Planck scale effects average\nout summing over polarization/helicity). These observations provide the ingredients of the \"minimal GPMP test\ntheory\" [12] (\"GPMP\" from the initials of the authors of Refs. [3,13], where most of the ingredients of this scenario\nwere introduced).\nIn these notes I will comment on certain types of data that are being considered as opportunities to test scenarios for\nPlanck-scale violations of Lorentz symmetry, and analyze their applicability to the two \"minimal\" test theories. My\ndiscussion is not of the type \"status of experimental limits on the test theories\", but rather I intend to illustrate how\nthe (apparently small) differences between the two minimal test theories can affect significantly the phenomenology. I\nwill therefore not consider all the opportunities for testing that have been discussed in the literature. I will just focus\non a few illustrative examples.\nII. DERIVATION OF LIMITS FROM TIME-OF-FLIGHT ANALYSES\n\nThe most popular strategy for establishing experimental limits on Planck-scale modifications of the dispersion\nrelation is based [1] on the fact that both in the minimal AEMNS test theory and in the minimal GPMP test theory\none expects a wavelength dependence of the speed of photons, by combining the modified dispersion relation and the\nrelation v = dE/dp. At \"intermediate energies\" (m < E ≪ Ep ) this velocity law will take the form\nv ≃1−\n\nn + 1 En\nm2\n+η\n.\n2\n2E\n2 Epn\n\n(2)\n\nWhereas in ordinary special relativity two photons (m = 0) emitted simultaneously would always reach simultaneously\na far-away detector, according to (2) two simultaneously-emitted photons should reach the detector at different times\nif they carry different energy. Moreover, in the case of the GPMP test theory even photons with the same energy\nwould arrive at different times if they carry different polarization. In fact, while the minimal AEMNS test theory\nassumes universality, and therefore a formula of this type would apply to photons of any polarization, in the GPMP\ntest theory, as mentioned, the sign of the effect is correlated with polarization. As a result, while the AEMNS test\ntheory is best tested by comparing the arrival times of particles of different energies, the GPMP test theory is best\ntested by considering the highest-energy photons available in the data and looking for a sizeable spread in times of\narrivals (which one would then attribute to the different speeds of the two polarizations).\nThis time-of-arrival-difference effect can be significant [1,14] in the analysis of short-duration bursts of photons that\nreach us from far away sources.\nIn the near future an excellent opportunity to test this effect will be provided by observations of gamma-ray bursters.\nFor a gamma-ray burst it is not uncommon that the time travelled before reaching our Earth detectors be of order\nT ∼ 1017 s. And microbursts within a burst can have very short duration, as short as 10−3 s (or even 10−4 s), and this\nmeans that the photons that compose such a microburst are all emitted at the same time, up to an uncertainty of\n10−3 s. Some of the photons in these bursts have energies that extend at least up to the GeV range. For two photons\nwith energy difference of order ∆E ∼ 1GeV a η∆E/Ep speed difference over a time of travel of 1017 s would lead to\na difference in times of arrival of order\nE\n∆t ∼ ηT ∆\n∼ 10−2 s ,\n(3)\nEp\nwhich is significant (the time-of-arrival differences would be larger than the time-of-emission differences within a single\nmicroburst).\nFor the minimal AEMNS test theory the Planck-scale-induced time-of-arrival difference could be revealed [1,14] upon\ncomparison of the \"average arrival time\" of the gamma-ray-burst signal (or better a microburst within the burst) in\ndifferent energy channels. The GPMP test theory would be most effectively tested by looking for a dependence of the\ntime-spread of the microbursts that grows with energy.\nSince the quality of relevant gamma-ray-burst data is still relatively poor, the present best limit was obtained\nin Ref. [14] using a slightly different type of observations: the negative results of a search of time-of-arrival/energy\ncorrelations for a TeV-gamma-ray short-duration flare from the Markarian 421 blazar allowed to deduce the limit\n|η| < 3*102 . For the minimal GPMP test theory one also correspondingly concludes that |ηγ | is of O(102 ) or smaller.\nConsidering the achievable sensitivities it appears [15] that the next generation of gamma-ray telescopes, such as\nGLAST [15], might be able to test very significantly (2) in the case n = 1, by possibly pushing the limit on η far\nbelow 1. In order to achieve this level of sensitivity it might however be necessary to gain some understanding of\ncertain types of potentially troublesome at-the-source effects, which were discussed in Ref. [16].\n3\n\n\fIII. LIMITS OBTAINED FROM OBSERVED ABSORPTION OF TEV PHOTONS FROM BLAZARS\n\nIn addition to the possible manifestation in time-of-arrival/energy correlations, the quantum-gravity-scale modifications of the dispersion relation could have [17–20] observably-large implications for what concerns the opacity of our\nUniverse to various types of high-energy particles. Of particular interest is the fact that, according to the conventional\n(classical-spacetime) description, the infrared diffuse extragalactic background should give rise to strong absorption\nof \"T eV photons\" (here understood as photons with energy 1T eV < E < 30T eV ). The relevant process is of course\nγγ → e+ e− . With a given dispersion relation and a given rule for energy-momentum conservation one has a complete\n\"kinematic scheme\" for the analysis of the requirements for particle production in collisions (or decay processes).\nBoth the minimal AEMNS test theory and the minimal GPMP test theory involve modified dispersion relations and\nunmodified laws of energy-momentum conservation (the fact that the law of energy-momentum conservation is not\nmodified is explicitly among the ingredients of the AEMNS test theory, while in the GPMP test theory it follows from\nthe adoption of low-energy effective field theory).\nCombining a modified dispersion relation with unmodified laws of energy-momentum conservation one naturally\nfinds a modification of the threshold requirements for the γγ → e+ e− process. Let us in particular consider the\ndispersion relation (1), with n = 1, in the analysis of a collision between a soft photon of energy ǫ and a high-energy\nphoton of energy E. For given soft-photon energy ǫ, the process γγ → e+ e− is allowed only if E is greater than a\ncertain threshold energy Eth which depends on ǫ and m2e . For n = 1, combining (1) with unmodified energy-momentum\nconservation, this threshold energy (assuming ǫ ≪ me ≪ Eth ≪ Ep ) is estimated as\nEth ǫ + η\n\n3\nEth\n≃ m2e .\n8Ep\n\n(4)\n\nThe special-relativistic result Eth = m2e /ǫ corresponds of course to the η → 0 limit of (4). For |η| ∼ 1 the Planck-scale\ncorrection can be safely neglected as long as ǫ > (m4e /Ep )1/3 . But eventually, for sufficiently small values of ǫ (and\ncorrespondingly large values of Eth ) the Planck-scale correction cannot be ignored.\nIn particular, if the photon of energy ǫ is part of the infrared diffuse extragalactic background and the photon\nemitted by a blazar is of TeV-range energy one finds that the prediction for absorption of the hard photon by the\ninfrared diffuse extragalactic background is significantly modified.\nThe fact that the observations still give us only a preliminary picture of absorption together with the fact that there\nis a significant level of uncertainty in phenomenological models of T eV blazars and in phenomenological models of\nthe density of the infrared diffuse extragalactic background does not allow us to convert these observations into tight\nlimits on departures from the classical-spacetime analysis. However, even just the basic fact that we see absorption\nof T eV γ-rays, as now suggested by several analyses, allows to derive [12] the limit η ≥ −46 (i.e. either η is positive\nor η is negative with absolute value smaller than 46).\nUp to this point in this section my discussion is strictly applicable only to the minimal AEMNS test theory. For\nthe case of the minimal GPMP test theory the analysis must be modified to take into account the fact that the\nmodification of the dispersion relation carries opposite sign for the two polarizations of the photon (and for the two\nhelicities of the electron/positron). In light of this polarization dependence in the minimal GPMP test theory only\none of the two polarizations of the photon could escape absorption. Whereas in the classical-spacetime picture one\nwould expect a cutoff behaviour to affect the entire spectrum (and in the minimal AEMNS test theory one might\nfind no cutoff at all), in the minimal GPMP test theory one would expect a cutoff behaviour only for a part of the\nspectrum, while the rest could be unaffected by the cutoff.\nIV. DERIVATION OF LIMITS FROM ANALYSIS OF SYNCHROTRON RADIATION\n\nA recent series of papers [21,12,22–26] has focused on the possibility to set limits on Planck-scale modified dispersion\nrelations focusing on their implications for synchrotron radiation. In Ref. [21] the starting point is the observation\nthat in the conventional (Lorentz-invariant) description of synchrotron radiation one can estimate the characteristic\nenergy Ec of the radiation through a heuristic analysis [27] leading to the formula\nEc ≃\n\n1\n,\nR*δ*[vγ − ve ]\n\n(5)\n\nwhere ve is the speed of the electron, vγ is the speed of the photon, δ is the emission angle for the radiation, and R\nis the radius of curvature of the trajectory of the electron.\n\n4\n\n\fAssuming that the only Planck-scale modification in this formula should come from the velocity law (described\nusing v = dE/dp in terms of the modified dispersion relation), one finds that in some instances the characteristic\nenergy of synchrotron radiation may be significantly modified by the presence of Planck-scale departures from Lorentz\nsymmetry. As an opportunity to test such a modification of the value of the synchrotron-radiation characteristic energy\none can hope to use some relevant data [21,22] on photons detected from the Crab nebula. This must be done with\ncaution since the observational information on synchrotron radiation being emitted by the Crab nebula is rather\nindirect: some of the photons we observe from the Crab nebula are attributed to synchrotron processes on the basis\nof a promising conjecture, and the value of the relevant magnetic fields is not directly measured.\nAssuming that indeed the observational situation has been properly interpreted, and relying on the mentioned\nassumption that the only modification to be taken into account is the one of the velocity law, this type of analysis has\nthe potential to establish very stringent limits on some Lorentz-symmetry-breaking parameters. However this will of\ncourse depend on the detailed structure of the Lorentz-symmetry-breaking scheme. In particular, it turns out that\nthe minimal test theories that I am considering cannot be constrained in this way.\nFor what concerns the minimal AEMNS test theory it is important to realize that synchrotron radiation is due to\nthe acceleration of the relevant electrons and therefore implicit in the derivation of the formula (5) is a subtle role\nfor dynamics [12]. From a field-theory perspective the process of synchrotron-radiation emission can be described in\nterms of Compton scattering of the electrons with the virtual photons of the magnetic field. One would therefore be\nlooking deep into the dynamical features of the theory.\nThe minimal AEMNS test theory does assume a modified dispersion relation of the type (1) universally applied\nto all particles, but it is a pure-kinematics framework and, since the analysis involves some aspects of dynamics, it\ncannot be tested using a Crab-nebula synchrotron-radiation analysis.\nThe GPMP test theory relies on a description of dynamics within the framework of effective low-energy theory,\nbut, as mentioned, this in turn ends up implying that it is not possible to assume that a dispersion relation of the\ntype (1) universally applies to all particles. Actually the two polarizations of photons must, within this framework,\nsatisfy different (opposite-sign Planck-scale corrections) dispersion relations. And for the description of electrons\none naturally encounters two more free parameters, which in my \"minimal GPMP test theory\" are also of equal\nmagnitude and opposite sign (in order to preserve c as the \"average speed\", as discussed in Section 1). As a result\nthe \"minimal GPMP test theory\" automatically evades the type of constraint that could come from the Crab-nebula\nsynchrotron-radiation analysis: since the two helicities are affected by opposite-sign modifications of the dispersion\nrelation, at least one of them must be a positive-sign-type modification.\nV. DERIVATION OF LIMITS FROM ANALYSIS OF UHE COSMIC RAYS\n\nIn Section 3 I discussed the implications of possible Planck-scale effects for the process γγ → e+ e− , but of course\nthis is not the only process in which Planck-scale effects can be important. In particular, there has been strong\ninterest [17–20,28–31] in \"photopion production\", pγ → pπ, where again the combination of (1) with unmodified\nenergy-momentum conservation leads to a modification of the minimum proton energy required by the process (for\ngiven photon energy). In the case in which the photon energy is the one typical of CMBR photons one finds that\nthe threshold proton energy can be significantly shifted upward (for negative η), and this in turn should affect at an\nobservably large level the expected \"GZK cutoff\" for the observed cosmic-ray spectrum. Observations reported by\nthe AGASA [32] cosmic-ray observatory provide some encouragement for the idea of such an upward shift of the GZK\ncutoff, but the issue must be further explored2 . Forthcoming cosmic-ray observatories, such as Auger [33], should be\nable [17,20] to fully investigate this possibility.\nIn this context the comparison of the AEMNS test theory and the GPMP test theory is rather straightforward.\nWe are in fact considering a purely kinematical effect: the shift of a threshold requirement. For the minimal AEMNS\ntest theory there is a clear prediction that for negative η there should be an upward shift of the GZK threshold. For\n\n2\n\nThis AGASA-data-based \"GZK puzzle\" has been very important in providing motivation for studies of Planck-scale departures from Lorentz symmetry. Even if a future improved understanding of the cosmic-ray spectrum ends up removing the\npuzzle, the lessons learned for the study of the quantum-gravity problem will still be very valuable. An analogous situation\nhas been rather recently encountered in the particle-physics literature: the discussion of the so-called \"centauro events\" led to\nstrong theoretical progress in the understanding of the possibility of \"misaligned vacua\" in QCD (see, e.g., Ref. [34]), and this\nprogress on the theory side remains valuable event though now most authors believe that \"centauro events\" might have been\na mirage\n\n5\n\n\fthe minimal GPMP test theory, where for one of the helicities of the proton the dispersion relation is of negative-η\ntype and for the other helicity the dispersion relation is of positive-η type, one would expect roughly one half of the\nUHE protons to evade the GZK cutoff, so the cutoff would still be violated but in a softer way than in the case of the\nAEMNS test theory with negative η.\nIf the Auger data should actually show evidence of the expected GZK cutoff, then the case of negative η for the\nminimal AEMNS test theory would be severely constrained (both for n = 1 and n = 2), and the fermion-sector\nparameter of the minimal GPMP test theory would also be severely constrained. Indeed, in the minimal AEMNS test\ntheory violations of the GZK cutoff are predicted for negative η (while they are not present in the positive-η case),\nwhile in the minimal GPMP test theory violations of the GZK cutoff (although less numerous than expected in the\nminimal AEMNS test theory with negative η) are always expected, independently of the sign of the fermion-sector\nparameter (depending on the sign of fermion-sector parameter the protons that violate the GZK cutoff would have a\ncorresponding helicity).\n\nVI. CLOSING REMARKS\n\nI focused on the minimal GPMP test theory and minimal AEMNS test theory, representing respectively the fieldtheory intuition and the no-field-theory intuition in the study of Planck-scale departures from Lorentz symmetry.\nI found that the differences between these two test theories, even though they might at first appear to be rather\nmarginal differences (both test theories essentially adopt the same type of modification of the dispersion relation),\nlead to significant differences in the outcome of certain phenomenological analyses. This should be kept in mind in the\nrelevant \"quantum-gravity phenomenology\" [35] literature. There have been several papers claiming to improve limits\non Planck-scale modifications of the dispersion relation, but the studies did not rely on a well-defined test theory.\nFrom outside the quantum-gravity-phenomenology community these papers were perceived as a gradual improvement\nin the experimental bounds on the overall idea of Planck-scale departures from Lorentz symmetry, to the point that\nthere is now a wide-spread perception that in general departures from Lorentz symmetry are already experimentally\nconstrained to be far beyond the Planck-scale. Instead, as shown by the analysis of the two \"minimal\" test theories I\nconsidered, some of the experimental-limit opportunities that have generated most excitement in the recent literature\nare inapplicable to some meaningful scenarios for Planck-scale departures from Lorentz symmetry.\nFor the objectives I was pursuing here it was necessary to focus indeed on rather similar test theories, so that I could\nillustrate the fact that even relatively small differences in the structure of the test theories can affect significantly the\nphenomenology. Both the minimal AEMNS test theory and the minimal GPMP test theory adopt the same type of\ndispersion relation and both assume that Planck-scale effects would break Lorentz symmetry. Even more significant\ndifferences, from the perspective of phenomenological analyses, should be expected in test theories that explore the\npossibility that the Planck-scale would \"deform\" Lorentz symmetry (in the sense of the \"doubly-special relativity\"\nscenario [8,9,36]). Work on the development of such a doubly-special-relativity test theory is in progress (see, e.g.,\nRef. [37]), but the analysis is still at too early a stage for me to comment on it here.\n\n[1] G. Amelino-Camelia, J. Ellis, N.E. Mavromatos and D.V. Nanopoulos: hep-th/9605211, Int. J. Mod. Phys. A 12, 607\n(1997); G. Amelino-Camelia, J. Ellis, N.E. Mavromatos, D.V. Nanopoulos and S. Sarkar: astro-ph/9712103, Nature 393,\n763 (1998).\n[2] L.J. Garay: Phys. Rev. Lett. 80, 2508 (1998).\n[3] R. Gambini and J. Pullin: Phys. Rev. D 59, 124021 (1999).\n[4] J. Alfaro, H.A. Morales-Tecotl and L.F. Urrutia: Phys. Rev. Lett. 84, 2318 (2000).\n[5] G. Amelino-Camelia and S. Majid: Int. J. Mod. Phys. A 15, 4301 (2000).\n[6] A. Matusis, L. Susskind and N. Toumbas: JHEP 0012, 002 (2000).\n[7] N.R. Douglas and N.A. Nekrasov: Rev. Mod. Phys. 73, 977 (2001).\n[8] G. Amelino-Camelia: gr-qc/0012051, Int. J. Mod. Phys. D 11, 35 (2002); hep-th/0012238, Phys. Lett. B 510, 255 (2001).\n[9] J. Kowalski-Glikman: hep-th/0102098, Phys. Lett. A 286, 391 (2001); R. Bruno, G. Amelino-Camelia and J. KowalskiGlikman: hep-th/0107039, Phys. Lett. B 522, 133 (2001).\n[10] V.A. Kostelecky, M. Perry and R. Potting, Phys.Rev.Lett.84:4541-4544,2000, hep-th/9912243\n[11] G. Amelino-Camelia and S.-Y. Pi: hep-ph/9211211, Phys. Rev. D 47, 2356 (1993).\n[12] G. Amelino-Camelia: gr-qc/0212002.\n\n6\n\n\f[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n\nR.C. Myers and M. Pospelov: hep-ph/0301124, Phys. Rev. Lett. 90, 211601 (2003).\nS.D. Biller et al: Phys. Rev. Lett. 83, 2108 (1999).\nJ.P. Norris, J.T. Bonnell, G.F. Marani and J.D. Scargle: astro-ph/9912136; A. de Angelis: astro-ph/0009271.\nT. Piran, astro-ph/0407462.\nT. Kifune: Astrophys. J. Lett. 518, L21 (1999).\nR. Aloisio, P. Blasi, P.L. Ghia and A.F. Grillo: Phys. Rev. D 62, 053010 (2000).\nR.J. Protheroe and H. Meyer: Phys. Lett. B 493, 1 (2000).\nG. Amelino-Camelia and T. Piran: astro-ph/0008107, Phys. Rev. D 64, 036005 (2001).\nT. Jacobson, S. Liberati and D. Mattingly: arXiv.org/abs/astro-ph/0212190v1\nT. Jacobson, S. Liberati and D. Mattingly: arXiv.org/abs/astro-ph/0212190v2, Nature 424, 1019 (2003).\nT. Jacobson, S. Liberati and D. Mattingly: gr-qc/0303001.\nS. Carroll: Nature 424, 1007 (2003).\nJ. Ellis, N.E. Mavromatos and A.S. Sakharov: astro-ph/0308403.\nT.A. Jacobson, S. Liberati, D. Mattingly and F.W. Stecker: astro-ph/0309681.\nJ.D. Jackson, Classical Electrodynamics, 3rd edn (J. Wiley & Sons, New York 1999).\nT. Jacobson, S. Liberati and D. Mattingly: hep-ph/0112207, Phys. Rev. D 66, 081302 (2002); hep-ph/0209264.\nG. Amelino-Camelia: gr-qc/0107086, Phys. Lett. B 528, 181 (2002).\nO. Bertolami: hep-ph/0301191.\nY.J. Ng, D.S. Lee, M.C. Oh, and H. van Dam: Phys. Lett. B 507, 236 (2001); G. Amelino-Camelia, Y.J. Ng, and H. van\nDam: gr-qc/0204077, Astropart. Phys. 19, 729 (2003).\nM. Takeda et al: Phys. Rev. Lett. 81, 1163 (1998).\nJ. Blumer: J. Phys. G 29, 867 (2003).\nG. Amelino-Camelia, J.D. Bjorken and S.E. Larsson, hep-ph/9706530, Phys.Rev.D56:6942-6956,1997\nG. Amelino-Camelia, \"Are we at the dawn of quantum-gravity phenomenology?\", gr-qc/9910089, Lect. Notes Phys. 541\n(2000) 1; \"Quantum-gravity phenomenology: status and prospects\", gr-qc/0204051, Mod. Phys. Lett. A17 (2002) 899.\nS. Alexander and J. Magueijo: hep-th/0104093; J. Magueijo and L. Smolin: gr-qc/0207085, Phys. Rev. D 67, 044017\n(2003); J. Kowalski-Glikman and S. Nowak: hep-th/0304101, Class. Quant. Grav. 20, 4799 (2003).\nG. Amelino-Camelia, J. Kowalski-Glikman, G. Mandanici and A. Procaccini: gr-qc/0312124.\n\n7\n\n\f"}