{"id": "http://arxiv.org/abs/astro-ph/0410410v1", "guidislink": true, "updated": "2004-10-18T14:10:53Z", "updated_parsed": [2004, 10, 18, 14, 10, 53, 0, 292, 0], "published": "2004-10-18T14:10:53Z", "published_parsed": [2004, 10, 18, 14, 10, 53, 0, 292, 0], "title": "Dynamical triggering of starbursts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0109175%2Castro-ph%2F0109322%2Castro-ph%2F0109036%2Castro-ph%2F0109274%2Castro-ph%2F0109500%2Castro-ph%2F0109027%2Castro-ph%2F0109218%2Castro-ph%2F0109156%2Castro-ph%2F0109082%2Castro-ph%2F0109473%2Castro-ph%2F0109301%2Castro-ph%2F0109062%2Castro-ph%2F0109466%2Castro-ph%2F0109534%2Castro-ph%2F0109367%2Castro-ph%2F0109005%2Castro-ph%2F0109351%2Castro-ph%2F0410259%2Castro-ph%2F0410002%2Castro-ph%2F0410686%2Castro-ph%2F0410030%2Castro-ph%2F0410081%2Castro-ph%2F0410046%2Castro-ph%2F0410739%2Castro-ph%2F0410028%2Castro-ph%2F0410380%2Castro-ph%2F0410452%2Castro-ph%2F0410087%2Castro-ph%2F0410175%2Castro-ph%2F0410410%2Castro-ph%2F0410567%2Castro-ph%2F0410528%2Castro-ph%2F0410116%2Castro-ph%2F0410535%2Castro-ph%2F0410738%2Castro-ph%2F0410266%2Castro-ph%2F0410626%2Castro-ph%2F0410303%2Castro-ph%2F0410700%2Castro-ph%2F0410483%2Castro-ph%2F0410061%2Castro-ph%2F0410284%2Castro-ph%2F0410720%2Castro-ph%2F0410583%2Castro-ph%2F0410210%2Castro-ph%2F0410104%2Castro-ph%2F0410084%2Castro-ph%2F0410094%2Castro-ph%2F0410096%2Castro-ph%2F0410389%2Castro-ph%2F0410013%2Castro-ph%2F0410331%2Castro-ph%2F0410132%2Castro-ph%2F0410249%2Castro-ph%2F0410283%2Castro-ph%2F0410158%2Castro-ph%2F0410440%2Castro-ph%2F0410062%2Castro-ph%2F0410421%2Castro-ph%2F0410262%2Castro-ph%2F0410011%2Castro-ph%2F0410416%2Castro-ph%2F0410039%2Castro-ph%2F0410368%2Castro-ph%2F0410477%2Castro-ph%2F0410636%2Castro-ph%2F0410550%2Castro-ph%2F0410694%2Castro-ph%2F0410333%2Castro-ph%2F0410496%2Castro-ph%2F0410461%2Castro-ph%2F0410178%2Castro-ph%2F0410067%2Castro-ph%2F0410181%2Castro-ph%2F0410342%2Castro-ph%2F0410578%2Castro-ph%2F0410492%2Castro-ph%2F0410025%2Castro-ph%2F0410129%2Castro-ph%2F0410021%2Castro-ph%2F0410697%2Castro-ph%2F0410074%2Castro-ph%2F0410584%2Castro-ph%2F0410279%2Castro-ph%2F0410019%2Castro-ph%2F0410391%2Castro-ph%2F0410463%2Castro-ph%2F0410473%2Castro-ph%2F0410064%2Castro-ph%2F0410305%2Castro-ph%2F0410398%2Castro-ph%2F0410386%2Castro-ph%2F0410247%2Castro-ph%2F0410150%2Castro-ph%2F0410603%2Castro-ph%2F0410560%2Castro-ph%2F0410698%2Castro-ph%2F0410727%2Castro-ph%2F0410120%2Castro-ph%2F0410487%2Castro-ph%2F0410558&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamical triggering of starbursts"}, "summary": "Galaxy interactions/mergers, gravitational instabilities and density waves,\nsuch as bars, are frequently invoked to trigger starbursts. These mechanisms\nhave been explored through numerical simulations, with the help of various star\nformation recipes. Gravitational instabilities are necessary to initiate star\nformation, but the main trigger might be the gas flows, to provide sufficient\nfuel in a short time-scale. Gas accretion is also acting on the dynamics, in\nfavoring bars/spirals, which will drive the gas inwards. Large amounts of\nexternal gas accretion are required to explain the bar frequency, and this\naccretion rate can be provided by the cosmic filaments, as supported by\ncosmological simulations. Subsequent interactions can then trigger starbursts\nby driving this accreted gas inwards.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0109175%2Castro-ph%2F0109322%2Castro-ph%2F0109036%2Castro-ph%2F0109274%2Castro-ph%2F0109500%2Castro-ph%2F0109027%2Castro-ph%2F0109218%2Castro-ph%2F0109156%2Castro-ph%2F0109082%2Castro-ph%2F0109473%2Castro-ph%2F0109301%2Castro-ph%2F0109062%2Castro-ph%2F0109466%2Castro-ph%2F0109534%2Castro-ph%2F0109367%2Castro-ph%2F0109005%2Castro-ph%2F0109351%2Castro-ph%2F0410259%2Castro-ph%2F0410002%2Castro-ph%2F0410686%2Castro-ph%2F0410030%2Castro-ph%2F0410081%2Castro-ph%2F0410046%2Castro-ph%2F0410739%2Castro-ph%2F0410028%2Castro-ph%2F0410380%2Castro-ph%2F0410452%2Castro-ph%2F0410087%2Castro-ph%2F0410175%2Castro-ph%2F0410410%2Castro-ph%2F0410567%2Castro-ph%2F0410528%2Castro-ph%2F0410116%2Castro-ph%2F0410535%2Castro-ph%2F0410738%2Castro-ph%2F0410266%2Castro-ph%2F0410626%2Castro-ph%2F0410303%2Castro-ph%2F0410700%2Castro-ph%2F0410483%2Castro-ph%2F0410061%2Castro-ph%2F0410284%2Castro-ph%2F0410720%2Castro-ph%2F0410583%2Castro-ph%2F0410210%2Castro-ph%2F0410104%2Castro-ph%2F0410084%2Castro-ph%2F0410094%2Castro-ph%2F0410096%2Castro-ph%2F0410389%2Castro-ph%2F0410013%2Castro-ph%2F0410331%2Castro-ph%2F0410132%2Castro-ph%2F0410249%2Castro-ph%2F0410283%2Castro-ph%2F0410158%2Castro-ph%2F0410440%2Castro-ph%2F0410062%2Castro-ph%2F0410421%2Castro-ph%2F0410262%2Castro-ph%2F0410011%2Castro-ph%2F0410416%2Castro-ph%2F0410039%2Castro-ph%2F0410368%2Castro-ph%2F0410477%2Castro-ph%2F0410636%2Castro-ph%2F0410550%2Castro-ph%2F0410694%2Castro-ph%2F0410333%2Castro-ph%2F0410496%2Castro-ph%2F0410461%2Castro-ph%2F0410178%2Castro-ph%2F0410067%2Castro-ph%2F0410181%2Castro-ph%2F0410342%2Castro-ph%2F0410578%2Castro-ph%2F0410492%2Castro-ph%2F0410025%2Castro-ph%2F0410129%2Castro-ph%2F0410021%2Castro-ph%2F0410697%2Castro-ph%2F0410074%2Castro-ph%2F0410584%2Castro-ph%2F0410279%2Castro-ph%2F0410019%2Castro-ph%2F0410391%2Castro-ph%2F0410463%2Castro-ph%2F0410473%2Castro-ph%2F0410064%2Castro-ph%2F0410305%2Castro-ph%2F0410398%2Castro-ph%2F0410386%2Castro-ph%2F0410247%2Castro-ph%2F0410150%2Castro-ph%2F0410603%2Castro-ph%2F0410560%2Castro-ph%2F0410698%2Castro-ph%2F0410727%2Castro-ph%2F0410120%2Castro-ph%2F0410487%2Castro-ph%2F0410558&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Galaxy interactions/mergers, gravitational instabilities and density waves,\nsuch as bars, are frequently invoked to trigger starbursts. These mechanisms\nhave been explored through numerical simulations, with the help of various star\nformation recipes. Gravitational instabilities are necessary to initiate star\nformation, but the main trigger might be the gas flows, to provide sufficient\nfuel in a short time-scale. Gas accretion is also acting on the dynamics, in\nfavoring bars/spirals, which will drive the gas inwards. Large amounts of\nexternal gas accretion are required to explain the bar frequency, and this\naccretion rate can be provided by the cosmic filaments, as supported by\ncosmological simulations. Subsequent interactions can then trigger starbursts\nby driving this accreted gas inwards."}, "authors": ["F. Combes"], "author_detail": {"name": "F. Combes"}, "author": "F. Combes", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.2034965", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0410410v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0410410v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 2 figures, to appear in \"The Evolution of Starbursts\", ed.\n  S. Huettemeister et al., AIP Proceedings", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0410410v1", "affiliation": "LERMA, Observatoire de Paris", "arxiv_url": "http://arxiv.org/abs/astro-ph/0410410v1", "journal_reference": null, "doi": "10.1063/1.2034965", "fulltext": "Dynamical triggering of starbursts\nF. Combes\n\narXiv:astro-ph/0410410v1 18 Oct 2004\n\nLERMA, Observatoire de Paris, 61 Av. de l'Observatoire, F-75014, Paris, France\nAbstract. Galaxy interactions/mergers, gravitational instabilities and density waves, such as bars,\nare frequently invoked to trigger starbursts. These mechanisms have been explored through numerical simulations, with the help of various star formation recipes. Gravitational instabilities are necessary to initiate star formation, but the main trigger might be the gas flows, to provide sufficient fuel\nin a short time-scale. Gas accretion is also acting on the dynamics, in favoring bars/spirals, which\nwill drive the gas inwards. Large amounts of external gas accretion are required to explain the bar\nfrequency, and this accretion rate can be provided by the cosmic filaments, as supported by cosmological simulations. Subsequent interactions can then trigger starbursts by driving this accreted gas\ninwards.\n\nOBSERVATIONAL EVIDENCE OF DYNAMICAL TRIGGERING\nIt is now widely accepted that strong galaxy interactions can produce violent starbursts,\nand ultra-luminous infra-red galaxies (ULIRGs) are all mergers (e.g. Sanders & Mirabel\n1996). But interacting galaxies in general do not show intense starbursts (Bergvall et al\n2003), or only in their centers. The tidal parameter, depending on mass and distance of\ncompanions, is not correlated to any star formation tracer. Starbursts are rare in the\nlocal universe, and much rarer than galaxy interactions. The only perceptible effect\nis that interacting galaxies have more mass - gas, dust & young stars, and are more\nconcentrated to the center (Bergvall et al 2003). One of the main conclusions that can be\ndrawn for giant galaxy starbursts is that galaxy interactions is a necessary condition to\ntrigger them, but not sufficient. Certainly, other parameters have to be taken into account,\nsuch as the gas content, the geometry/velocity of the encounter, and also the phases of\nthe interaction, the starburst occuring only during about 10% of the interaction time,\naccording to simulations (e.g. Mihos & Hernquist 1996).\nFor dwarf galaxies, interactions are even not a necessary condition for triggering:\nstarbursting dwarfs have no more companions (Brosch et al 2004), although it might be\ndifferent for Blue Compact Dwarfs (BCD, Hunter & Elmegreen 2004). Dwarf galaxies\nwith starbursts present asymmetries, and a possible trigger could just come from gas accretion: the gas infalling in dark-matter haloes may experience sloshing and oscillations\nfavoring compression and instabilities. This mechanism might be relevant for primordial\ngalaxies (Brosch et al 2004).\nOne of the best evidence of triggering can be obtained by tracing the fossil records\nof the star formation history in nearby galaxies. In the Small Magellanic Cloud, the\nnumber of stars at a given age has been determined by Zaritsky & Harris (2004). They\nnoticed that the derived SMC star formation history reveals some bursts corresponding\nto pericenters of its orbit around the Milky Way. A model taking the tidal triggering\n\n\fFIGURE 1. Star formation history in the SMC derived from a tidally triggered model (dash-line), or\na tidally triggered model with infall (solid line), compared to the observed number of stars at each age,\nfrom Zaritsky & Harris (2004). The insert is a zoom of the recent 2.5 Gyr.\n\ninto account fits better the observations, although the quantitative influence of the tide is\nuncertain, between 10 and 70% of the star formation could be tidal in origin, cf figure 1.\nOne of the problem in the fit comes from the too large increase in star formation about\n3-4 Gyrs ago, which can only be explained by external gas accretion. A significant gas\ninfall, by about 50% of the total gas mass, improves the fit, and accounts also for the\nobserved age-metallicity relation. The metallicity is not monotonously increasing with\ndecreasing age, but remains constant for old stars until 3 Gyrs, indicating that dilution is\nrequired from deficient gas infall.\n\nDYNAMICAL PROCESSES\nThe star formation rate in spiral galaxies is observed to be proportional to the power\nn=1.5 of the gas density, corresponding empirically to a global Schmidt law over the\ngalaxy (Kennicutt 1998), although the local Schmidt law is not observed. The SFR\nlaw is the same for interacting and non-interacting galaxies, whatever their triggers are.\nThis law has been interpreted through several processes: Jeans instability can lead to\nthis exponent, star formation being proportional to the gas density ρ over the free-fall\ntime scale, scaling in ρ 1/2 , resulting in the power 3/2, but also cloud-cloud collisions\n(Elmegreen 1998), or star-forming contagion with feedback, leading to chaotic conditions.\nWhen strong starbursts are observed, they are in general concentrated in the central\n\n\fregions, and large amounts of gas must be fueled towards the center in a short enough\ntime to beat the feedback. The radial gas flows can be due to bars, or spiral density\nwaves. Molecular gas concentrations are observed in barred galaxies (e.g. Sakamoto et\nal 1999), and circumnuclear starbursts are frequently found in resonant rings (e.g. Buta\n& Combes 1996).\n\nStar formation efficiency\nThe star formation efficiency (or SFE) can be defined by the fraction of gas consumed\nin star formation per dynamical time. In normal galaxies, the SFE is about 0.1-3%, but\nin some interacting galaxies and ULIRGs, it can be as high as 50%. The star formation\nrates in spiral galaxies range from 0.1 up to 1000 M⊙ /yr, depending on mass, but SF can\nbe about 100 times more efficient, in triggered galaxies.\nThe far infrared emission from dust L(FIR) is the best tracer of SF in enshrouded\nstarbursts, and the gas content is traced by the CO emission. The dense gas tracers (CS,\nHCN) appear to vary linearly with L(FIR), and can be used also as SF tracer (Solomon et\nal 1992, Gao & Solomon 2004). While the SFE (FIR to CO ratio) may vary by a factor\n100, the HCN/CO emission ratio varies also in the same proportion, meaning that in\naverage the gas is denser in starbursts. The HCN/FIR ratio corresponds to star forming\ncores in the Milky Way, and the ULIRGs can be modelled with a large filling factor of\nSF cores. May be the necessary step to trigger a starburst is to form the dense cores,\nand then the efficiency per unit core mass is universal (Gao & Solomon 2004, Fritze v.\nAlvensleben 2004).\n\nOther dynamical processes\nWhen two galaxies interact and their disks overlap, there could be violent collisions\nbetween clouds at velocities of the order of 300km/s; diffuse HI clouds collide, but\nmolecular GMCs not, due to their small filling factor. However, they are compressed\nby the created hot high pressure medium (Jog & Solomon 1992). Also, while GMCs\nare radially moving towards the center, they are compressed, provided that the ICM\npressure increases with decreasing radius (Jog & Das 1996). From stability arguments, if\nthe Toomre Q-parameter maintains constant over the whole disk, the velocity dispersion\nand therefore the gas turbulence is higher in the center: the critical velocity dispersion\nVcrit (=3.36 G Σ/κ ) decreases with radius for constant rotation curves.\nSimilarly, in clusters, star formation could be induced by the compression of GMCs\nby the intra-cluster hot gas (Bekki & Couch 2003). This might explain the starbursts\noccuring in the spiral galaxies infalling into the cluster Abell 1367 (Gavazzi et al 2003).\n\nSTAR FORMATION RECIPES\nNumerical simulations of galaxies use recipes for star formation, as all sub-grid physics\n(Katz 1992; Mihos & Hernquist 1994). These can be based on the Schmidt law, or\nthe Jeans instability, with some criteria taken into account, like density thresholds, gas\ntemperature, convergent gas flows. These recipes can simulate the dynamical triggering;\nsimulated galaxy interactions produce strong non-axisymmetry and torques that drive\n\n\fFIGURE 2. Comparison of two simulations of isolated galaxies, with different Q-parameter for the\ngas (different initial velocity dispersions). Top Left: gas morphology during the two first epochs of the\nsimulation with Qg =0.3, separated by 200 Myr; Right: corresponding SFR (fraction of the gas transformed\ninto stars per Myr) as a function of time. Bottom Left: same for the simulation with Qg =0.8; Rigth: Ratio\nof the SFR in these two simulations, as a function of time. At the beginning, the star formation rate is 3\ntimes higher, for Qg =0.3.\n\nthe gas towards the center. The strength of these perturbations depends essentially on the\nstability of the disk prior the interaction, therefore on the bulge-to-disk ratio, while the\nrole of the orbital geometry appears secondary, provided the interaction ends in a merger\n(Mihos & Hernquist 1996). However, many parameters involving the gas physics or the\nstellar feedback can influence significantly the SFR, while they are still uncertain.\n\nInfluence of gas stability\nThe small scale structure of the gas, depending on its surface density in the galaxy,\nand its velocity dispersion, has a large influence on the SFR, modifying the fraction\nof dense clumps. Figure 2 illustrates how a small variation of initial Qg of the gas can\nmultiply the SFR by a factor 3.\nThe influence of the gas velocity dispersion can also be included, to represent the\nshock-induced star formation in interacting galaxies, since cloud-cloud collisions might\nbe involved in the mechanism. A modified Schmidt law in ρ n σ β to take into account the\nvelocity dispersion σ has been introduced by Brosche & Lentes (1985). It was applied by\nBarnes (2004) to the Mice simulations, and revealed a better match of the observations,\nwith the exponent β = 0.5.\n\nInfluence of multi-phase gas, feedback\nHydro-SPH simulations ignore the various phases, and smooth the density contrast:\nhot diffuse gas is prevented to exist together with dense cold clumps; the dense gas\nevaporates, while the hot gas cools exaggerately. Marri & White (2003) attempt to\nseparate two gas phases in the SPH code (with neighbor particles searched separately)\n\n\ftaking into account mass exchange between the two phases: this of course changes\nsignificantly the star formation history of a spiral galaxy. The star formation should also\nbe limited by stellar feedback, which is phenomenologically taken into account through\nmass loss and energy reinjected locally around star-forming regions. However the largescale fountain effect, or galactic winds, and large-scale outflows are not simulated\ncorrectly (Thacker & Couchman 2001).\n\nIMPORTANCE OF GAS INFALL\nMany observations point towards an almost stationnary star formation history in spiral\ngalaxies for intermediate Hubble types (Kennicutt et al 1994, Brinchmann et al 2004).\nHowever, even taking into account the stellar mass loss, an isolated galaxy should have\nan exponentially decreasing star formation rate. To fuel the star formation, galaxies\ndepend on external accretion. Mergers with gas rich dwarf companions are not sufficient;\nfor instance all objects falling now on the Milky Way represent less than 1/400 of the\nmass of the Galaxy (Ibata et al 2001). Galaxies must accrete large amounts of gas mass\nalong their lives (Brinchman et al 2004).\nThe analysis of stellar populations in a large sample of galaxies (SDSS, Heavens et al\n2004) have shown that massive galaxies have formed most of their stars at early times,\nwhile dwarf galaxies are still forming now. Only galaxies of intermediate masses could\nhave in average maintained their star formation rate over a Hubble time.\n\nSimulations in a cosmological context\nWhen simulated inside the filamentary cosmic web of gas and dark matter, the star\nformation rate of galaxies is no longer exponential. The star formation is both fueled\nby galaxy mergers, and in the mean time, external gas accretion (e.g. Tissera 2000,\nNagamine et al 2004). One of the essential role of companions is to trigger star formation, by driving this accreted gas inwards. Semi-analytical simulations, constrained by\nthe luminosity function of galaxies and the Tully-Fisher relation, also derive an almost\nconstant SFH for middle types (Somerville & Primack 1999).\n\nConstraints from bars and spirals\nRecently, the bar frequency in nearby galaxies have been quantified from near-infrared\nsurveys (e.g. Block et al. 2002), and is much higher than expected, given the destruction\nof bars in spiral galaxies with interstellar gas (Bournaud & Combes 2002). To explain\nthe observations, bars have to be reformed, and this is possible only through continuous\ngas accretion at a large rate. The observed bar frequency, combined with the prediction\nof dynamical models, allows to quantify the accretion rate (Block et al. 2002). An\nintermediate type spiral galaxy must double its mass in about 10 Gyr. Cold gas accretion\nis required to increase the self-gravity of the disk, and decrease the bulge-to-disk ratio.\nDwarf companions accretion cannot play this role, since they heat the disks. Also\nmajor mergers develop the spheroids. Instead the filaments in the near environment of\ngalaxies are the source of continuous cold gas accretion. The accretion rate derived in\n\n\fcosmological simulations is compatible with the mass doubling in 10 Gyr. Cosmological\naccretion can explain bar reformation.\n\nCONCLUSIONS\nStar formation depends essentially on the gas supply and is only slightly influenced\nby the large-scale dynamics. Galaxy interactions act to drive the accreted gas radially\ninwards and trigger central starbursts. The accretion of gas not only regulates the star\nforming history in galaxies but also their dynamical state (bars, spirals, warps, m=1...),\nand both phenomema interact in a feedback loop. For galaxies in the field, accretion\nis dominant, and explain bars and spirals, and the constant star formation rate for\nintermediate types. In rich environments, galaxies experience quicker evolution, mergers\nare much more important, and secular evolution of galaxies through gas accretion is\nhalted at z∼ 1, since galaxies are stripped from their gas reservoirs.\n\nREFERENCES\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n\nBarnes J.E.: 2004, MNRAS 350, 798\nBekki K., Couch W.: 2003 ApJ 596, L13\nBergvall N., Laurikainen E., Aalto S.: 2003, A&A 405, 31\nBlock D., Bournaud F., Combes F., Puerari I., Buta R.: 2002, A&A 394, L35\nBournaud F., Combes F.: 2002, A&A 392, 83\nBrinchmann, J., Charlot, S., White, S. D. M. et al.: 2004, MNRAS 351, 1151\nBrosch, N., Almoznino, E., Heller, A. B.: 2004, MNRAS 349, 357\nBrosche P., Lentes F.T.: 1985 A&A 153, 157\nButa R., Combes F.: 1996, Fund. Cosmic Phys. 17, 95\nElmegreen B.G.: 1998, in \"Origins of Galaxies\" ed. C.E. Woodward et al. (astro-ph/9712352)\nFritze-V. Alvensleben, U., 2004, in \"Young Local Universe\", Rencontres de Moriond, Eds: A. Chalabaev, T. Fukui, T. Montmerle, and J. Tran-Thanh-Van, astro-ph/0407360\nGao Y., Solomon P.M.: 2004 ApJ 606, 271\nGavazzi, G., Cortese, L., Boselli, A. et al.: 2003, ApJ 597, 210\nHeavens, A., Panter, B., Jimenez, R., Dunlop, J.: 2004, Nature 428, 625\nHunter D.A., Elmegreen B.G.: 2004, AJ 128, in press (astro-ph/0408229)\nIbata, R., Irwin, M., Lewis, G.F., Stolte, A.: 2001 ApJ 547, L133\nJog, C. J., Das M.: 1996 ApJ 473, 797\nJog, C. J., Solomon, P. M.: 1992, ApJ 387, 152\nKatz, N.: 1992 ApJ 391, 502\nKennicutt R.C., Tamblyn, P., Congdon, C. E.: 1994 ApJ 435, 22\nKennicutt R.C.: 1998, ARAA 36, 189\nMarri, S., White S.D.M.: 2003 MNRAS 345, 561\nMihos J.C., Hernquist L.: 1994 ApJ, 437, 611\nMihos, J.C., Hernquist, L.: 1996, ApJ, 464, 641\nNagamine K., Springel, V., Hernquist, L.: 2004, MNRAS 348, 435\nSakamoto K., Okumura S.K., Ishizuki S., Scoville N.Z.: 1999 ApJ 525, 691\nSanders D., Mirabel I.F.: 1996, ARAA 34, 749\nSolomon, P. M., Downes, D., Radford, S. J. E.: 1992, ApJ 387, L55\nSomerville, R. S., Primack, J. R.: 1999, MNRAS 310, 1087\nThacker R.J., Couchman H.M.P.: 2001 ApJ 555, L17\nTissera P.: 2000, ApJ 534, 636\nZaritsky D., Harris J.: 2004, ApJ 604, 167\n\n\f"}