{"id": "http://arxiv.org/abs/astro-ph/0109498v1", "guidislink": true, "updated": "2001-09-27T00:11:45Z", "updated_parsed": [2001, 9, 27, 0, 11, 45, 3, 270, 0], "published": "2001-09-27T00:11:45Z", "published_parsed": [2001, 9, 27, 0, 11, 45, 3, 270, 0], "title": "X-ray Properties of High Redshift Clusters", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0109289%2Castro-ph%2F0109017%2Castro-ph%2F0109088%2Castro-ph%2F0109194%2Castro-ph%2F0109205%2Castro-ph%2F0109264%2Castro-ph%2F0109317%2Castro-ph%2F0109189%2Castro-ph%2F0109080%2Castro-ph%2F0109510%2Castro-ph%2F0109459%2Castro-ph%2F0109374%2Castro-ph%2F0109549%2Castro-ph%2F0109199%2Castro-ph%2F0109108%2Castro-ph%2F0109492%2Castro-ph%2F0109283%2Castro-ph%2F0109070%2Castro-ph%2F0109471%2Castro-ph%2F0109352%2Castro-ph%2F0109236%2Castro-ph%2F0109159%2Castro-ph%2F0109081%2Castro-ph%2F0109233%2Castro-ph%2F0109204%2Castro-ph%2F0109145%2Castro-ph%2F0109553%2Castro-ph%2F0109092%2Castro-ph%2F0109303%2Castro-ph%2F0109302%2Castro-ph%2F0109259%2Castro-ph%2F0109177%2Castro-ph%2F0109127%2Castro-ph%2F0109037%2Castro-ph%2F0109376%2Castro-ph%2F0109064%2Castro-ph%2F0109247%2Castro-ph%2F0109268%2Castro-ph%2F0109232%2Castro-ph%2F0109035%2Castro-ph%2F0109384%2Castro-ph%2F0109296%2Castro-ph%2F0109073%2Castro-ph%2F0109053%2Castro-ph%2F0109157%2Castro-ph%2F0109373%2Castro-ph%2F0109090%2Castro-ph%2F0109393%2Castro-ph%2F0109326%2Castro-ph%2F0109227%2Castro-ph%2F0109018%2Castro-ph%2F0109143%2Castro-ph%2F0109098%2Castro-ph%2F0109364%2Castro-ph%2F0109555%2Castro-ph%2F0109047%2Castro-ph%2F0109033%2Castro-ph%2F0109014%2Castro-ph%2F0109267%2Castro-ph%2F0109066%2Castro-ph%2F0109042%2Castro-ph%2F0109363%2Castro-ph%2F0109114%2Castro-ph%2F0109256%2Castro-ph%2F0109097%2Castro-ph%2F0109525%2Castro-ph%2F0109279%2Castro-ph%2F0109130%2Castro-ph%2F0109287%2Castro-ph%2F0109021%2Castro-ph%2F0109239%2Castro-ph%2F0109370%2Castro-ph%2F0109447%2Castro-ph%2F0109344%2Castro-ph%2F0109071%2Castro-ph%2F0109329%2Castro-ph%2F0109186%2Castro-ph%2F0109203%2Castro-ph%2F0109122%2Castro-ph%2F0109096%2Castro-ph%2F0109501%2Castro-ph%2F0109432%2Castro-ph%2F0109169%2Castro-ph%2F0109220%2Castro-ph%2F0109421%2Castro-ph%2F0109124%2Castro-ph%2F0109185%2Castro-ph%2F0109271%2Castro-ph%2F0109323%2Castro-ph%2F0109556%2Castro-ph%2F0109031%2Castro-ph%2F0109343%2Castro-ph%2F0109413%2Castro-ph%2F0109135%2Castro-ph%2F0109498%2Castro-ph%2F0109420%2Castro-ph%2F0109056%2Castro-ph%2F0109486%2Castro-ph%2F0109134%2Castro-ph%2F0109484%2Castro-ph%2F0109546&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "X-ray Properties of High Redshift Clusters"}, "summary": "We describe the ensemble X-ray properties of high redshift clusters with\nemphasis on changes with respect to the local population. Cluster X-ray\nluminosity evolution is detected in five nearly independent surveys. The\nrelevant issue now is characterizing this evolution. Cluster temperature\nevolution provides constraints on the dark matter and dark energy content of\nthe universe. These constraints are complementary to and in agreement with\nthose of the cosmic microwave background and supernovae, showing that the\npresent universe is dominated by a dark energy. X-ray images show that most z >\n0.75 clusters are not relaxed, hinting that the cluster formation epoch is z ~\n1.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0109289%2Castro-ph%2F0109017%2Castro-ph%2F0109088%2Castro-ph%2F0109194%2Castro-ph%2F0109205%2Castro-ph%2F0109264%2Castro-ph%2F0109317%2Castro-ph%2F0109189%2Castro-ph%2F0109080%2Castro-ph%2F0109510%2Castro-ph%2F0109459%2Castro-ph%2F0109374%2Castro-ph%2F0109549%2Castro-ph%2F0109199%2Castro-ph%2F0109108%2Castro-ph%2F0109492%2Castro-ph%2F0109283%2Castro-ph%2F0109070%2Castro-ph%2F0109471%2Castro-ph%2F0109352%2Castro-ph%2F0109236%2Castro-ph%2F0109159%2Castro-ph%2F0109081%2Castro-ph%2F0109233%2Castro-ph%2F0109204%2Castro-ph%2F0109145%2Castro-ph%2F0109553%2Castro-ph%2F0109092%2Castro-ph%2F0109303%2Castro-ph%2F0109302%2Castro-ph%2F0109259%2Castro-ph%2F0109177%2Castro-ph%2F0109127%2Castro-ph%2F0109037%2Castro-ph%2F0109376%2Castro-ph%2F0109064%2Castro-ph%2F0109247%2Castro-ph%2F0109268%2Castro-ph%2F0109232%2Castro-ph%2F0109035%2Castro-ph%2F0109384%2Castro-ph%2F0109296%2Castro-ph%2F0109073%2Castro-ph%2F0109053%2Castro-ph%2F0109157%2Castro-ph%2F0109373%2Castro-ph%2F0109090%2Castro-ph%2F0109393%2Castro-ph%2F0109326%2Castro-ph%2F0109227%2Castro-ph%2F0109018%2Castro-ph%2F0109143%2Castro-ph%2F0109098%2Castro-ph%2F0109364%2Castro-ph%2F0109555%2Castro-ph%2F0109047%2Castro-ph%2F0109033%2Castro-ph%2F0109014%2Castro-ph%2F0109267%2Castro-ph%2F0109066%2Castro-ph%2F0109042%2Castro-ph%2F0109363%2Castro-ph%2F0109114%2Castro-ph%2F0109256%2Castro-ph%2F0109097%2Castro-ph%2F0109525%2Castro-ph%2F0109279%2Castro-ph%2F0109130%2Castro-ph%2F0109287%2Castro-ph%2F0109021%2Castro-ph%2F0109239%2Castro-ph%2F0109370%2Castro-ph%2F0109447%2Castro-ph%2F0109344%2Castro-ph%2F0109071%2Castro-ph%2F0109329%2Castro-ph%2F0109186%2Castro-ph%2F0109203%2Castro-ph%2F0109122%2Castro-ph%2F0109096%2Castro-ph%2F0109501%2Castro-ph%2F0109432%2Castro-ph%2F0109169%2Castro-ph%2F0109220%2Castro-ph%2F0109421%2Castro-ph%2F0109124%2Castro-ph%2F0109185%2Castro-ph%2F0109271%2Castro-ph%2F0109323%2Castro-ph%2F0109556%2Castro-ph%2F0109031%2Castro-ph%2F0109343%2Castro-ph%2F0109413%2Castro-ph%2F0109135%2Castro-ph%2F0109498%2Castro-ph%2F0109420%2Castro-ph%2F0109056%2Castro-ph%2F0109486%2Castro-ph%2F0109134%2Castro-ph%2F0109484%2Castro-ph%2F0109546&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe the ensemble X-ray properties of high redshift clusters with\nemphasis on changes with respect to the local population. Cluster X-ray\nluminosity evolution is detected in five nearly independent surveys. The\nrelevant issue now is characterizing this evolution. Cluster temperature\nevolution provides constraints on the dark matter and dark energy content of\nthe universe. These constraints are complementary to and in agreement with\nthose of the cosmic microwave background and supernovae, showing that the\npresent universe is dominated by a dark energy. X-ray images show that most z >\n0.75 clusters are not relaxed, hinting that the cluster formation epoch is z ~\n1."}, "authors": ["J. Patrick Henry"], "author_detail": {"name": "J. Patrick Henry"}, "author": "J. Patrick Henry", "arxiv_comment": "14 pages, 9 figures, invited review at AMiBA 2001: High-z Clusters,\n  Missing Baryons, and CMP Polarization", "links": [{"href": "http://arxiv.org/abs/astro-ph/0109498v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0109498v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0109498v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0109498v1", "journal_reference": null, "doi": null, "fulltext": "AMiBA 2001: High-z Clusters, Missing Baryons, and CMB Polarization\nASP Conference Series, Vol. 999, 2002\nL-W Chen, C-P Ma, K-W Ng and U-L Pen, eds\n\nX-ray Properties of High Redshift Clusters\n\narXiv:astro-ph/0109498v1 27 Sep 2001\n\nJ. Patrick Henry\nInstitute for Astronomy, University of Hawaii, 2680 Woodlawn Drive,\nHonolulu, HI 96822, USA\nAbstract. We describe the ensemble X-ray properties of high redshift\nclusters with emphasis on changes with respect to the local population.\nCluster X-ray luminosity evolution is detected in five nearly independent\nsurveys. The relevant issue now is characterizing this evolution. Cluster\ntemperature evolution provides constraints on the dark matter and dark\nenergy content of the universe. These constraints are complementary to\nand in agreement with those of the cosmic microwave background and\nsupernovae, showing that the present universe is dominated by a dark\nenergy. X-ray images show that most z > 0.75 clusters are not relaxed,\nhinting that the cluster formation epoch is z ∼ 1.\n\n1.\n\nIntroduction\n\nTwenty-five years ago almost all clusters of galaxies were selected from surveys\nmade at visible wavelengths. The two most widely used catalogs were (and in\nmany respects still are) those compiled by Abell (1958) and Zwicky and Herzog\n(1983). A few dozen X-ray emitting clusters were known then, almost all of\nthem from the Abell catalog and none at high redshift (here defined as z > 0.3).\nThis situation changed with the advent of focusing optics in X-ray astronomy. The first X-ray detection of high redshift clusters was with the Einstein\nObservatory (Henry et al., 1979), while the X-ray selection of thousands of\nnearby clusters was made possible by the ROSAT All-Sky Survey (see references in Section 1.3).\n1.1.\n\nWhy Observe High Redshift Clusters?\n\nBecause we want to measure the evolution of their properties. This answer is\nobvious and begs the question why we want to do that. Because the evolution\nof the cluster mass function is exponentially sensitive to the values of several\nparameters of cosmological interest. Further the evolution is simple, being driven\nby the gravity of the underlying mass field of the universe and of a collisionless\ncollapse of cluster dark matter. We should be able to calculate this evolution\nreliably. It is not possible to perform such calculations for the only other objects\nvisible at cosmological distances, galaxies and AGNs.\nA possible difficulty is that we usually do not observe mass. It appears,\nhowever, that what we do observe in X-rays (see the next section) has a good\nenough relation to mass that the difficulty can be overcome. X-ray selection\nthen offers two additional benefits. There is virtually no contamination from\n1\n\n\f2\n\nJ. Patrick Henry\n\nobjects projected along the line of sight and quantitiative selection criteria are\neasily established.\nThis fortunate situation of good theoretical understanding of a relatively\nsimple object coupled with the capability to make the required observations has\nresulted in a great deal of work in this field over the past several years. Examples\ninclude (Bahcall & Fan, 1998; Blanchard et al., 2000; Donahue & Voit, 1999;\nHenry, 2000; Viana & Liddle, 1999). All of this work used the venerable PressSchechter (Press & Schechter, 1974 hereafter PS) mass function on an open or\nspatially flat background universe. New theoretical developments not yet fully\nincorporated are a more accurate description of the mass function (Sheth &\nTorman, 1999 hereafter ST) and the generalization to an arbitrary cosmology\n(Pierpaoli, Scott, & White, 2001).\n1.2.\n\nX-ray Observables\n\nX-ray cluster observables are luminosity, temperature and surface brightness (an\nimage). The number of clusters for which these observables has been obtained\ndepends on the number of photons required for a respectful measurement of\nthem. A 5σ luminosity measurment requires only about 25 photons. Hence\nmany clusters have their luminosity determined. A similar measurement of a\ncluster's mean temperture needs ∼ 1000 photons. Far fewer clusters have even\nan average temperature measured, probably a few hundred, see White (2000)\nfor a large compilation. Finally, ∼ 5000 photons are required to begin making a\ncluster image. Consequently there are very few high redshift clusters with high\nstatistics images.\nIn addition to observing individual objects, another complication arises\nwhen measuring evolution. There are no standard clusters. There is a tight correlation between X-ray isophotal size and temperature (Mohr & Evrard, 1997)\nand a loose correlation between luminosity and temperature. Changes to these\nrelations with redshift have been used to search for evolution, but none have\nso far been found (Mohr et al., 2000; Henry, 2000). The usual way to search\nfor evolution is by comparing the low and high redshift distributions of cluster\nluminosities, the X-ray luminosity functions (XLFs), and cluster temperatures,\nthe X-ray temperature functions (XTFs).\n1.3.\n\nSamples of X-ray Selected Clusters\n\nWe sumarize first the low redshift (z < 0.3) local samples and then the high\nredshift (z > 0.3) samples.\nThe BCS consists of 201 clusters in the northern hemisphere detected in the\nfirst processing (i.e. sorted into strips) of the ROSAT All-Sky Survey (RASS)\n(Ebeling et al., 1998). An extension to fainter fluxes, the eBCS, has an additional\n100 clusters (Ebeling et al., 2000). The RASS1 Bright Sample contains 130\nsouthern clusters, again from the first processing of the RASS (De Grandi et al.,\n1999). REFLEX is another southern hemisphere cluster survey, this time using\nthe second processing (i.e. fully merged) RASS. It has 452 clusters (Böhringer\net al., 2001a).\nFor the high redshift samples we only give the number of objects with z\n> 0.3, although all but one of the following samples do have objects at lower\nredshifts. The original serendipitous survey is the EMSS (Gioia & Luppino,\n\n\f3\n\nX-ray Properties of High Redshift Clusters\n\n2\n\n2\n\nNEP\n\nEMSS\n\nB\n\n0\n\nB\n\n0\n\nRDCS\n\n-2\n\n-4\n\n-4\n\n160 SQ DEG\n(Z > 0.3)\n\n-2\n\n-4\n\n-2\n\n0\nA\n\n2\n\n4\n\n-4\n\n-2\n\n0\nA\n\n2\n\n4\n\nFigure 1.\na. (left) One, two and three σ contours of the AB model\nfit to the EMSS and RDCS surveys. b. (right) One, two and three σ\ncontours of the AB model fit to the 160 deg2 z > 0.3 and NEP surveys.\n\n1994), the only survey described here coming from the Einstein Observatory.\nThe EMSS has 23 high redshift clusters. Serendipitous in this context means\nthat the clusters were found in the fields of observations targeted at other objects.\nMost high redshift X-ray selected clusters are found in this way as it is the only\nway to go deep enough. A major drawback of this approach is the solid angle\nsurveyed is not contiguous. All but two of the following surveys use this strategy\nwith the ROSAT pointed data.\nThe 160 Square Degree Survey has 73 z > 0.3 clusters (Vikhlinin et al.,\n1998). The original catalog gave spectroscopic redshifts for 36% of the clusters,\nbut we have since obtained them for all but one object (Mullis et al., 2002).\nWith 12 objects at high redshift, the BRIGHT SHARC has the smallest sample\nsize (Romer et al., 2000). The RDCS contains 50 clusters at z > 0.3 to the\nlowest flux limit of all the surveys (Borgani et al., 2001). WARPS contains ∼ 75\nhigh redshift objects (Jones et al., 2000).\nThere are two high redshift cluster surveys that use the RASS and hence\nare the only ones that have contiguous sky coverage. The NEP survey covers\nthe deepest region of the RASS around the North Ecliptic Pole (Henry et al.,\n2001). It contains 19 high redshift clusters. MACS surveys 55% of the sky for\nthe most luminous clusters at z > 0.3. It has 34 objects in its bright subsample\nand > 75 additional clusters above a flux limit a factor of 2 lower (Ebeling, Edge\n& Henry, 2001). Already MACS is the largest single X-ray selected sample of\nclusters with z > 0.3.\nThe last survey we describe has just begun. The BMW uses data from the\nROSAT HRI pointings, a previously neglected archive (Moretti et al., 2001). The\ndistinct advantage of this survey is the HRI has much better spatial resolution\ncompared to the PSPC, which was used for all ROSAT cluster surveys until\nnow. Clusters are easily selected by X-ray extent with the HRI. Somewhat\nsurprisingly, given the high HRI background, the flux limit of the BMW is\ncompetitive with other surveys.\n\n\f4\n\nJ. Patrick Henry\n\nBRIGHT SHARC\n\nBRIGHT SHARC\n\n2\n\n2\nBRIGHT MACS\n\nB\n\n0\n\nB\n\n0\n\nEMSS\n-2\n\nBRIGHT MACS\n\n-2\n\n-4\n\n-4\n\nRDCS\n\nNEP\n160 SQ DEG\n(Z > 0.3)\n\n-4\n\n-2\n\n0\nA\n\n2\n\n4\n\n-4\n\n-2\n\n0\nA\n\n2\n\n4\n\nFigure 2.\na. (left) One, two and three σ contours of the AB model fit\nto the Bright MACS and one σ contour for the Bright SHARC surveys.\nb. (right) One σ contours of the AB model fit to the EMSS, RDCS,\nNEP, Bright MACS, Bright SHARC and 160 deg2 z > 0.3 surveys.\n2.\n\nCluster X-ray Luminosity Evolution\n\nEvidence for evolution of the luminosities of clusters of galaxies came originally\nfrom the EMSS (Gioia et al. 1990; Henry et al. 1992). These studies found that\nthe co-moving number density of high luminosity clusters is smaller in the past\nthan at present. However, the result was barely significant and it has enjoyed\nhealthy skeptism. Many more samples are now available to confirm or refute\nthis claim.\n2.1.\n\nSix High Redshift Samples Analyzed the Same Way\n\nEach of the surveys described in Section 1.3 has a unique selection function that\nmust be removed in order to compare them. The usual method, ploting luminosity functions, does not use all the information available. Since the evolution\nseems to be a lack of objects at high redshifts, there is nothing to plot if the\nobjects are not there. Instead we perform maximum likelihood fits of five high\nredshift samples to the AB model introduced by Rosati et al. (2000) who has\nalready analyzed the RDCS. In this\nmodel the XLF is an evolving Schechter\n∗\nfunction: n(L, z) = n0 (z)L−α e−L/L (z) , with n0 (z) = n0 [(1 + z)/(1 + z0 )]A and\nL∗ (z) = L∗0 [(1 + z)/(1 + z0 )]B . Note that n0 , α and L∗0 are not fit, but come from\na low redshift XLF, in this case the BCS since it has the lowest normalization\nof the three local determinations thus yielding the least evolution. We set z0\nto 0.1, the characteristic redshift of the BCS. No evolution in this model is the\npoint A = B = 0. Note further that a maximum likelihood fit incorporates the\ninformation provided by any \"missing\" high redshift clusters. We assume, to be\nconsistent with previous work, that H0 = 50 km s−1 Mpc−1 and q0 = 0.5, where\nH0 is the the Hubble parameter and q0 is the deceleration parameter, both at\nthe present epoch.\nWe show the results of the fits in Figures 1, and 2. Five of the six samples\nexhibit luminosity evolution at the > 3σ level. The only survey that does not\n\n\fX-ray Properties of High Redshift Clusters\n\n5\n\n10-4\nREFLEX z=0.00-0.45\n\nn(L) (h505 Mpc-3 (1044 erg s-1)-1)\n\n10-5\n\nEMSS + NEP + 160 deg2\nz = 0.30-0.85\n\n10-6\n10-7\n10-8\n10-9\n10-10\n0.1\n\n1.0\nL(0.5,2.0) (1044 h50-2 erg s-1)\n\n10.0\n\nFigure 3.\nComparison of the low z XLF from the REFLEX survey\nwith the high z XLF from the combined EMSS, NEP and 160 deg2\nsurveys. The best fitting Schechter function XLFs are overlaid\nexhibit significant evidence for evolution is the Bright SHARC, which is the\nsmallest sample. Figure 2b shows that some of the surveys agree at the ∼ 1σ\nlevel, e.g. Bright MACS, EMSS and NEP and RDCS, EMSS and NEP. However,\non the whole the agreement among all the surveys is marginal at best. More work\nwill be required to determine whether this diagreement is real and/or results\nfrom the specific model fitted. In particular, we have forced the best fitting\nlow redshift XLF onto the fit without considering the errors in its parameters.\nFurther, the model probably is too simple since it assumes that all clusters\nin the low redshift sample are at the same redshift, z0 . In reality, because\nall samples are flux limited, different redshift clusters determine the different\nSchechter function fit parameters. See also the end of Section 2.2 for additional\ndiscussion of this point.\n2.2.\n\nCombining Three High Redshift Samples for Better Statistics\n\nThe fits described in Section 2.1 show that there is no longer a question whether\ncluster X-ray luminosities evolve, the five surveys with best statistics show they\ndo. Rather the question now is how to characterize that eveolution.\nWe therefore construct the high redshift cluster luminosity function from\nthe sum of the EMSS (plus RX J0152.7-1357), NEP, and 160 deg2 samples in\norder to obtain a higher statistics nonparametric description of that evolution.\nThere are 110 objects in this combined sample, comparable at last to the low\nredshift samples. The average redshift of clusters in the combined sample is 0.45.\n\n\f6\n\nJ. Patrick Henry\n\n14\n\nL*(0.5,2.0) (1044 h50-2 erg s-1)\n\n12\n\n10\nREFLEX\nAVG Z = 0.11\n8\n\n6\n\n4\n\n2\n-3.5\n\nEMSS + NEP + 160 deg2\nAVG Z = 0.45\n-3.0\n\n-2.5\nα\n\n-2.0\n\n-1.5\n\nFigure 4.\nOne, two and three σ contours for the two interesting parameters of Schechter model fits to the REFLEX and combined EMSS,\nNEP and 160 deg2 surveys. The small (∼ 1σ) difference between our\nbest fit for the REFLEX sample and that of Böhringer et al. (2001b)\ncomes from our restricting the fit to clusters with luminosities in the\n0.1 to 2.4 keV band above 1 × 1043 erg s−1 and redshifts below 0.3.\nThe overlap on the sky of these three samples is about 5%, so we have corrected\nstatistically for double counting since the corrections are not large. We compare\nin Figure 3 this high z XLF to the REFLEX low z XLF from Böhringer et al.\n(2001). We use REFLEX for this comparison because it is the largest local\nsample. The raw luminosity functions clearly show the negative evolution at\nhigh luminosities. There may be positive evolution at low luminosities, but only\none low statistic luminosity bin exhibits this effect. The high z XLF falls a factor\nof ∼ 2.5 below the REFLEX XLF at a luminosity of 2 × 1044 erg s−1 in the 0.5\n- 2.0 keV band.\nAs a first attempt at characterizing the observed evolution, we have performed maximum likelihood fits of Schechter functions to the two samples. We\nshow the best fits in Figure 3. Figure 4 gives the likelihood contours in the L∗\n- α plane. The best fitting normalization, n0 , is that which yields the observed\nnumber of clusters in the sample when integrating the Schechter function with\nbest fitting L∗ and α over the survey selection function. This analysis demonstrates that at least n0 , and α are evolving. L∗ may be evolving, but is not\nrequired to be. Recall that the AB model has n0 and L∗ evolving.\n\n\fX-ray Properties of High Redshift Clusters\n\n7\n\n1.6\n1.4\n1.2\n\nσ8\n\n1.0\n0.8\n0.6\n0.4\n0.2\n\n0.2\n\n0.4\n\n0.6\n\nΩ m0\n\n0.8\n\n1.0\n\nFigure 5.\nConstraints in the σ8 - Ωm0 plane for an open universe.\nThe shaded region gives the one, two and three σ contours from an\nanalysis of weak lensing by field galaxies (Maoli et al. 2001). The cross\nis their best fitting value. The line is from an analysis of the local\ncluster temperature function by Pierpaoli et al. (2001). The dashed\nellipse and cross is from an analysis of cluster temperature evolution\nby Henry (2000). There is good agreement among the three results.\nOriginal figure from Maoli et al. (2001)\n3.\n\nConstraining Cosmology From Cluster Temperature Evolution\n\nA cluster's luminosity is proportional to the square of its X-ray gas density.\nHence luminosity evolution is very sensitive to the evolution of the gas, which is\nalmost certainly different from the evolution driven by gravity during hierarchical growth. Temperature is probably the X-ray observable most closely related\nto mass and should more accurately reflect this growth.\nThere are two cosmological parameters that mainly determine the hierarchical growth and thus can be strongly constrained by cluster temperature\nevolution. These two are Ωm0 , the present mass density relative to the critical\ndensity and σ8 , the amplitude of mass density fluctuations on a scale of 8h−1\nMpc. This latter parameter is a complicated way to normalize the present value\nof the power spectrum of mass density fluctuations, P(k), at k ≈ 0.2hM pc−1 :\nσ8 ≈ [P (0.172hM pc−1 )/3879h−3 M pc3 ]1/2 (Peacock, 1999 equations 16.13 and\n16.132). Note that the rate of hierarchical growth is not very dependent on\nΩΛ0 = 3Λ/H02 with Λ the cosmological constant. Cluster evolution does not\nconstrain this parameter very well.\n3.1.\n\nPress-Schechter Mass Function in a Flat Universe\n\nMany papers over the last several years have analyzed cluster temperatures with\nthe aim of constraining cosmology. We reference a selection of them in Section\n\n\f8\n\nJ. Patrick Henry\n\n10\n\n∆2 (k)\n\n1\n\n0.1\nCluster temp. evolution\n\n0.01\n\nGalaxy power from APM\nMass power from CMB\n\n10–3\n0.01\n\n0.1\n\n1\n\nk (h Mpc –1)\n\nFigure 6.\nFluctuation power spectra where ∆2 (k) = V /(2π 2 )k3 P (k),\nbut σ8 ≃ ∆(0.172hM pc−1 ). The shaded region gives the one σ error on\nthe present mass fluctuation power spectrum predicted by evolving the\nmeasured microwave background fluctuation spectrum to the present,\nunder the assumption that H0 = 70 km s−1 Mpc−1 ±10%. The dots\nwith errors are the galaxy fluctuation spectrum, while the single error\nbar is the value of σ8 from an analysis of cluster temperature evolution\nby Henry (2000). The good agreement between the predicted spectrum and its observed normalization implies that clusters form from\nhierarchical growth. Original figure from Peacock et al. (2001)\n\n1.1. To date all of this work has assumed a background cosmology that is\neither flat (Ωm0 + ΩΛ0 = 1) or open (ΩΛ0 = 0). The mass function is given by\nthe PS formula. Mass is converted to temperature by assuming clusters form\nvia a top hat collapse: kT = 1.42[Ωm0 ∆(Ωm0 , z)]1/3 [hM15 ]2/3 [1 + z]/β. Here\n∆(Ωm0 , z) is the ratio of the cluster's average density to that of the background\nmass density at the virialization redshift, M15 is the virial mass of the cluster\nin units of 1015 M⊙ and β is a modification factor accounting for departures\nfrom hydrostatic equilibrium. It is determined from numerical hydrodynamic\nsimulations. Our work uses β = 1.21.\n0.5 ≃\nThe local abundance of clusters yields the following constraint: σ8 Ωm0\n0.5. Figure 5 shows a recent example. Measuring the abundance at two epochs,\nthat is measuring evolution, breaks this degeneracy and is a prime reason for\nmaking such measurements.\nAs an example, we give the results of our recent work (Henry 2000), which is\nfairly typical. None of the local samples described in Section 1.3 have complete\ntemperature information, so we used a sample of 25 clusters originally from\nPiccinotti et al. (1982) with corrections for source confusion. Sixteen of these\nobjects had temperatures from ASCA when we did the analysis. The only\nhigh redshift sample that has complete temperature information is the EMSS.\n\n\f9\n\nX-ray Properties of High Redshift Clusters\n\nn(>kT) (h3 Mpc-3)\n\n10-5\n\n10-6\n\n10-7\n\n10-8\n\n2\n\n10\nkT (keV)\n\nFigure 7.\nIntegral cluster temperature function. The open (filled)\ncircles are the low (high) redshift cluster observations. The high redshift data come from the entire EMSS z > 0.3 sample plus RX J0152.71357.\nWe used 14 EMSS clusters selected by flux, all with ASCA temperatures and\nROSAT HRI images. The average redshift of the local sample is 0.05 while that\nof the distant sample is 0.38. We found that Ωm0 = 0.49 ± 0.12(1σ) ± 0.23(2σ)\nand Ωm0 = 0.44 ± 0.12(1σ) ± 0.23(2σ) for open and flat cosmologies respectively.\nΩm0 = 1 is excluded at >> 99% confidence. For σ8 we find 0.72 ± 0.10 and\n0.77 ± 0.15(1σ) for open and flat models respectively.\nWe show in Figures 5 and 6 a comparison of these results with some recent\nwork not available when Henry (2000) was completed. Figure 5 compares the\nresults deduced form weak gravitational lensing by field galaxies (Maoli et al.,\n2001) with those obtained from the local abundance of clusters (Pierpaoli et\nal., 2001). There is very good agreement with a similar degeneracy. Our results break the degeneracy as described above, again with very good agreement.\nFigure 6 shows the present power spectrum of density fluctuations (Peacock et\nal., 2001). The mass power spectrum is that predicted from cosmic microwave\nbackground, i.e. evolved from a redshift of ∼ 1000 to the present, plus the assumption that H0 = 70 km s−1 Mpc−1 ±10%. The galaxy spectrum shows that\ngalaxies exhibit a small bias with respect to the mass. The agreement between\nthe cluster temperature normalization and the predicted mass spectrum shows\nthat the tiny fluctuations present in the universe at z ∼ 1000 really have grown\nby gravity to produce the clusters we observe today.\n3.2.\n\nImproved Mass Function with Arbitrary Ωm0 and ΩΛ0\n\nAlthough the PS mass function is a good approximation to that obtained from\nlarge N-body simulations, it does predict too many low-mass clusters and too\nfew high mass ones (see Jenkins et al., 2001). The ST mass function does a\n\n\f10\n\nJ. Patrick Henry\n1.0\n\n0.8\n\nΩΛ0\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0.0\n\n0.2\n\n0.4\n\nΩm0\n\n0.6\n\n0.8\n\n1.0\n\nFigure 8.\nConstraints on the dark energy and dark matter content of\nthe universe provided by the data in Figure 7. The solid lines are the\none and two σ contours using the ST mass function, while the dashed\nline is the one σ contour from the PS mass function. The difference is\nsmall, ∼ 0.5σ.\n\nbetter job although it is not quite as good as the Jenkins et al. empirical fit.\nThe ST mass function allows clusters to form via an ellipsoidal rather than the\nspherical PS collapse. We prefer the ST function because the empirical fits will\npresumably change with different numerical simulations; ST has the virtue that\nit stays the same. Another advance is the function ∆ in the mass - temperature\nrelation has finally been determined for arbitrary Ωm0 and ΩΛ0 (Pierpaoli et al.,\n2001).\nWe have made a new determination of cluster temperature evolution. The\nlocal sample remains the same 25 clusters used in Henry (2000). All their temperatures are measured with ASCA by White (2000), thereby eliminating a\npossible systematic effect since all temperatures (but one in the high redshift\nsample) are measured with the same experiment. The high redshift sample is\nnow all EMSS clusters with z > 0.3 plus RX J0152.7-1357 with a temperature\nfrom Della Ceca et al. (2000). There are 20 clusters in the distant sample,\nthe average redshift of which has increased to 0.45. We show the temperature\nfunctions in Figure 7. The temperatures exhibit the same moderate evolution\nas the luminosities discussed in Section 2.\nThe recent theoretical advances permit us to constrain the geometry of the\nuniverse. We show these constraints in Figures 8 and 9. Figure 8 shows that\nthe difference between the PS and ST mass functions is minor for the present\nsample size, ∼ 0.5σ. Figure 9 compares the constraints provided by supernovae,\n\n\f11\n\nX-ray Properties of High Redshift Clusters\n\n1.0\n\nΩΛ0\n\n0.8\n+ Boomerang – 98\n\n0.6\n\nMAXIMA –1\n\nSNIa\n0.4\n\n0.2\nClusters\n\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\nΩ m0\n\n0.8\n\n1.0\n\n1.2\n\nFigure 9.\nComparison of the constraints provided by cluster temperature evolution, supernovae and the microwave background. All\nthree provide complementary constraints that show that the universe\nis presently dominated by dark energy. Original figure from Jaffe et al.\n(2001).\nthe cosmic microwave background and cluster evolution. All three methods are\nconcordant and nicely complementary, thereby diminishing the possibility that\nany one of them has significant systematic errors. It is clear that Ωm0 ∼ 0.35\nand ΩΛ0 ∼ 0.65 agrees with all determinations. It appears that the universe has\nsignificant amounts of dark matter and dark energy at present.\n3.3.\n\nSummary of Cluster Temperature Evolution Constraints of Cosmological Parameters\n\nAlthough the agreement exhibited by Figures 5, 6, and 9 is encouraging, there\nis a rather wider range in the best fit value of Ωm0 found by different investigators than would be expected from the quoted errors. One uncertainity is that\nclusters are selected by their flux, not temperature. The selection is quantified\nby specifying the surveyed solid angle as a function of flux. The flux can be\nstraightforwardly converted to luminosity and redshift. The luminosity may be\nconverted to temperature from the empirical cluster luminosity - temperature\nrelation yielding the solid angle as a function of temperature and redshift. This\nsecond step is not as straightforward as the first. Although there is a relation, it\nhas large scatter. At least the relation does not seem to evolve very much. The\ncommunity has not yet settled on a preferred analysis method that incorporates\nthis uncertainity. There is good agreement on the value of σ8 among the various\ninvestigators or at least most results fall along the same σ8 - Ωm0 degeneracy\ncurve.\n\n\f12\n\nJ. Patrick Henry\n\n4.\n\nState of Very High Redshift Clusters\n\nThere are now about a dozen X-ray emitting clusters presently known at z\n> 0.75. Chandra images are in hand for 8 of them (e.g. Cagnoni et al., 2001;\nFabian et al., 2001; Jeltema et al., 2001; Stanford et al., 2001). All but 2 of these\n8 are obviously not relaxed. This situation contrasts with that at low redshift\nwhere most clusters appear to be much closer to equilibrium (see the compilation\nof images in Mohr, Mathiesen, & Evrard, 1999). Although qualitative, this\nstriking difference leads us to suspect that z ∼ 1 is more likely the epoch of\ncluster formation than is the present.\nAcknowledgments. Thanks are due to the organizers of our conference\nfor a great meeting in the magnificant setting of the Taroko National Park. I\nalso want to thank my many collaborators with whom I have worked on cluster\nsurveys over the years. These include: I. Gioia, C. Mullis, W. Voges, U. Briel,\nH. Böhringer and J. Huchra for the NEP; A. Vikhlinin, C. Mullis, I. Gioia,\nB. McNamara, A. Hornstrup, H. Quintana, K. Whitman, W. Forman, and C.\nJones for the 160 deg2 ; H. Ebeling and A. Edge for the MACS. Most of the work\ndescribed here will eventually appear as publications coauthored with them. H.\nBöhringer and H. Ebeling provided the digital data from Figures 20 and 10 of\nBöhringer et al. (2001a) and Ebeling et al. (2001) respectively.\nReferences\nAbell, G. O. 1958, ApJS, 3, 211\nBahcall, N. A. & Fan, X. 1998, ApJ, 504, 1\nBlanchard, A., Sadat, R., Bartlett, J. G. & Le Dour, M. 2000, A&A, 362, 809\nBöhringer, Schuecker, P., Guzzo, L., Collins, C. A., Voges, W., Schindler, S.,\nNeumann, D. M., Cruddace, R. G., De Grandi, S., Chincarini, G., Edge,\nA. C., MacGillivray, H. T. & Shaver, P. 2001a, A&A, 369, 826\nBöhringer, H., Collins, C. A., Guzzo, L., Schuecker, P., Voges, W., Neumann,\nD. M., Schindler, S., Chincarini, G., DeGrandi, S., Cruddace, R. G.,\nEdge, A. C., Reiprich, T. H., & Shaver, P. 2001b, ApJ, submitted (astroph/0106243)\nBorgani, S., Rosati, P., Tozzi, P., Stanford, S. A., Eisenhardt, P. E., Lidman,\nC., Holden, B., Della Ceca, R., Norman, C. & Squires, G. 2001, ApJ, in\npress (astro-ph/0106428)\nCagnoni, I., Elvis, M., Kim, D.-W., Mazzotta, P., Huang, J.-S., & Celotti, A.\n2001, ApJ, in press (astro-ph/0106066)\nDeGrandi, S., Böhringer, H., Guzzo, L., Molendi, S., Chincarini, G., Collins, C.,\nCruddace, R., Neumann, D., Schindler, S., Schuecker, P., & Voges, W.\n1999, ApJ, 514, 148\nDella Ceca, R., Scaramella, R., Gioia, I. M., Rosati, P., Fiore, F., & Squires, G.\n2000, A&A, 353, 498\nDonahue, M. & Voit, G. M. 1999, ApJ, 523, L137\nEbeling, H., Edge, A. C., Böhringer, H., Allen, S. W., Crawford, C. S., Fabian,\nA. C., Voges, W. & Huchra, J. P. 1998, MNRAS, 301, 881\n\n\fX-ray Properties of High Redshift Clusters\n\n13\n\nEbeling, H., Edge, A. C., Allen, S. W., Crawford, C. S., Fabian, A. C. & Huchra,\nJ. P. 2000, MNRAS, 318, 333\nEbeling, H., Edge, A. C., & Henry, J. P. 2001, ApJ, 553, 668\nFabian, A. C., Crawford, C. S., Ettori, S., & Sanders, J. S. 2001, MNRAS, 332,\nL11\nGioia, I. M., Henry, J. P., Maccacaro, T., Morris, S. L., Stocke, J. T., & Wolter,\nA. 1990, ApJ, 356, L35\nGioia, I. M. & Luppino, G. A. 1994, ApJS, 94, 583\nHenry, J. P., Branduardi, G., Briel, U., Fabricant, D., Feigelson, E., Murray, S.,\nSoltan, A., & Tananbaum, H. 1979, ApJ, 234, L15\nHenry, J. P., Gioia, I. M., Maccacaro, T., Morris, S. L., Stocke, J. T., & Wolter,\nA. 1992, ApJ, 389, 491\nHenry, J. P. 2000, ApJ, 534, 565\nHenry, J. P., Gioia, I. M., Mullis, C. R., Voges, W., Briel, U. G., Böhringer, H.,\n& Huchra, J. P. 2001, ApJ, 553, L109\nJaffe, A. H. et al. 2001 Phys.Rev.Lett, 86, 3475\nJeltema, T. E., Canizares C. R., Bautz, M. W., Malm, M. R., Donahue, M. &\nGarmire, G. P. 2001, ApJ, in press (astro-ph/0107314)\nJenkins, A., Frenk, C. S., White, S. D. M., Colberg, J. M., Cole, S., Evrard, A.\nE. & Yoshida, N, 2001, MNRAS, 321 372\nJones, L., Ebeling, H., Scharf, C., Perlman, E., Horner, D., Fairley, B., Wegner,\nG. & Malkan, M. 2000, in \"Large-Scale Structure in the X-ray Universe\",\neds. M. Plionis & I. Georgantopoulos, Atlantisciences, Paris, France, p35\nMaoli, R., Van Waerbeke, L., Mellier, Y., Schneider, P., Jain, B., Bernardeu, F.,\nErben, T. & Fort, B. 2001, A&A, 368, 766\nMohr, J. J. & Evrard, A. E. 1997, ApJ, 491, 13\nMohr, J. J., Mathiesen, B. & Evrard, A. E. 1999, ApJ, 517, 627\nMohr, J. J., Reese, E. D., Ellingson, E., Lewis, A. D. & Evrard, A. E. 2000,\nApJ, 544, 109\nMoretti, A., Guzzo, L., Campana, S., Covino, S., Lazzati, D., Longhetti, M.,\nMolinari, E., Panzera, M. R. & Tagliaferri, G. 2001, astro-ph/0103348\nMullis, C. R., Vikhlinin, A., Henry, J. P., McNamara, B., Quintana, H., Gioia,\nI. M., Hornstrup, A., Forman, W. & Jones, C. 2002, in preparation\nNichol, R. C., Romer, A. K., Holden, B. P., Ulmer, M. P., Pildis, R. A., Adami,\nC., Merrelli, A. J., Burke, D. J. & Collins, C. A. 1999, ApJ, 521, L21\nPeacock, J. A. 1999, Cosmological Physics, Cambridge: Cambridge University\nPress\nPeacock, J. A., et al. 2001, Nature, 410, 169\nPiccinotti, G., Mushotzky, R. F., Boldt, E. A., Holt, S. S., Marshall, F. E.,\nSerlemitsos, P. J. & Shafer, R. A. 1982, ApJ, 253, 485\nPierpaoli, E., Scott, D., & White, M. 2001, MNRAS, 325, 77\nPress, W. H. & Schechter, P. 1974, ApJ, 187, 425\n\n\f14\n\nJ. Patrick Henry\n\nRomer, A. K., Nichol, R. C., Holden, B. P., Ulmer, M. P., Pildis, R. A., Merrelli,\nA. J., Adami, C., Burke, D. J., Collins, C. A., Metevier, A. J., Kron, R.\nG. & Commons K. 2000, ApJS, 126, 209\nRosati, P., Borgani, S., Della Ceca, R., Stanford, A., Eisenhardt, P. & Lidman,\nC. 2000, in \"Large-Scale Structure in the X-ray Universe\", eds. M. Plionis\n& I. Georgantopoulos, Atlantisciences, Paris, France, p13\nSheth, R. K. & Torman, G. 1999, MNRAS, 308, 119\nStanford, S. A., Holden, B., Rosati, P., Tozzi, P., Borgani, S., Eisenhardt, P. R.\n& Spinrad, H. 2001, ApJ, 552, 504, 2001\nViana, P. T. P. & Liddle, A. R. 1999, MNRAS, 303, 535\nVikhlinin, A., McNamara, B. R., Forman, W., Jones, C., Quintana, H. & Hornstrup, A. 1998, ApJ, 502, 558\nWhite, D. A. 2000, MNRAS, 312, 663\nZwicky, F. & Herzog, F. 1983, \"Catalog of Galaxies and Clusters of Galaxies\",\nPasadena: California Institute of Technology\n\n\f"}