{"id": "http://arxiv.org/abs/astro-ph/0112320v1", "guidislink": true, "updated": "2001-12-13T15:59:45Z", "updated_parsed": [2001, 12, 13, 15, 59, 45, 3, 347, 0], "published": "2001-12-13T15:59:45Z", "published_parsed": [2001, 12, 13, 15, 59, 45, 3, 347, 0], "title": "Effects on the structure of the universe of an accelerating expansion", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0112363%2Castro-ph%2F0112377%2Castro-ph%2F0112407%2Castro-ph%2F0112310%2Castro-ph%2F0112041%2Castro-ph%2F0112156%2Castro-ph%2F0112296%2Castro-ph%2F0112070%2Castro-ph%2F0112237%2Castro-ph%2F0112365%2Castro-ph%2F0112514%2Castro-ph%2F0112565%2Castro-ph%2F0112050%2Castro-ph%2F0112331%2Castro-ph%2F0112340%2Castro-ph%2F0112254%2Castro-ph%2F0112518%2Castro-ph%2F0112417%2Castro-ph%2F0112489%2Castro-ph%2F0112218%2Castro-ph%2F0112081%2Castro-ph%2F0112423%2Castro-ph%2F0112117%2Castro-ph%2F0112107%2Castro-ph%2F0112324%2Castro-ph%2F0112141%2Castro-ph%2F0112173%2Castro-ph%2F0112531%2Castro-ph%2F0112210%2Castro-ph%2F0112545%2Castro-ph%2F0112165%2Castro-ph%2F0112234%2Castro-ph%2F0112320%2Castro-ph%2F0112138%2Castro-ph%2F0112142%2Castro-ph%2F0112222%2Castro-ph%2F0112284%2Castro-ph%2F0112197%2Castro-ph%2F0112205%2Castro-ph%2F0112105%2Castro-ph%2F0112003%2Castro-ph%2F0112378%2Castro-ph%2F0112272%2Castro-ph%2F0112121%2Castro-ph%2F0112437%2Castro-ph%2F0112069%2Castro-ph%2F0112520%2Castro-ph%2F0112059%2Castro-ph%2F0112413%2Castro-ph%2F0112187%2Castro-ph%2F0112387%2Castro-ph%2F0112420%2Castro-ph%2F0112185%2Castro-ph%2F0112144%2Castro-ph%2F0112281%2Castro-ph%2F0112233%2Castro-ph%2F0112479%2Castro-ph%2F0112372%2Castro-ph%2F0112250%2Castro-ph%2F0112225%2Castro-ph%2F0112421%2Castro-ph%2F0112496%2Castro-ph%2F0112318%2Castro-ph%2F0112471%2Castro-ph%2F0112289%2Castro-ph%2F0112510%2Castro-ph%2F0112242%2Castro-ph%2F0112381%2Castro-ph%2F0112427%2Castro-ph%2F0112362%2Castro-ph%2F0112533%2Castro-ph%2F0112347%2Castro-ph%2F0112499%2Castro-ph%2F0112264%2Castro-ph%2F0112396%2Castro-ph%2F0112072%2Castro-ph%2F0112373%2Castro-ph%2F0112495%2Castro-ph%2F0112315%2Castro-ph%2F0112086%2Castro-ph%2F0112060%2Castro-ph%2F0112161%2Castro-ph%2F0112087%2Castro-ph%2F0112516%2Castro-ph%2F0112306%2Castro-ph%2F0112285%2Castro-ph%2F0112311%2Castro-ph%2F0112293%2Castro-ph%2F0112216%2Castro-ph%2F0112016%2Castro-ph%2F0112534%2Castro-ph%2F0112552%2Castro-ph%2F0112255%2Castro-ph%2F0112119%2Castro-ph%2F0112088%2Castro-ph%2F0112323%2Castro-ph%2F0112304%2Castro-ph%2F0112308%2Castro-ph%2F0112263%2Castro-ph%2F0112052%2Castro-ph%2F0112529&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects on the structure of the universe of an accelerating expansion"}, "summary": "Recent experimental results from supernovae Ia observations have been\ninterpreted to show that the rate of expansion of the universe is increasing.\nOther recent experimental results find strong indications that the universe is\n``flat.'' In this paper, I investigate some solutions of Einstein's field\nequations which go smoothly between Schwarzschild's relativistic gravitational\nsolution near a mass concentration to the Friedmann-Lemaitre expanding universe\nsolution. In particular, the static, curved-space extension of the Lemaitre-\nSchwarzschild solution in vacuum is given. Uniqueness conditions are discussed.\nOne of these metrics preserves the ``cosmological equation.'' We find that when\nthe rate of expansion of the universe is increasing, space is broken up into\ndomains of attraction. Outside a domain of attraction, the expansion of the\nuniverse is strong enough to accelerate a test particle away from the domain\nboundary. I give a domain-size--mass relationship. This relationship may very\nwell be important to our understanding of the large scale structure of the\nuniverse.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0112363%2Castro-ph%2F0112377%2Castro-ph%2F0112407%2Castro-ph%2F0112310%2Castro-ph%2F0112041%2Castro-ph%2F0112156%2Castro-ph%2F0112296%2Castro-ph%2F0112070%2Castro-ph%2F0112237%2Castro-ph%2F0112365%2Castro-ph%2F0112514%2Castro-ph%2F0112565%2Castro-ph%2F0112050%2Castro-ph%2F0112331%2Castro-ph%2F0112340%2Castro-ph%2F0112254%2Castro-ph%2F0112518%2Castro-ph%2F0112417%2Castro-ph%2F0112489%2Castro-ph%2F0112218%2Castro-ph%2F0112081%2Castro-ph%2F0112423%2Castro-ph%2F0112117%2Castro-ph%2F0112107%2Castro-ph%2F0112324%2Castro-ph%2F0112141%2Castro-ph%2F0112173%2Castro-ph%2F0112531%2Castro-ph%2F0112210%2Castro-ph%2F0112545%2Castro-ph%2F0112165%2Castro-ph%2F0112234%2Castro-ph%2F0112320%2Castro-ph%2F0112138%2Castro-ph%2F0112142%2Castro-ph%2F0112222%2Castro-ph%2F0112284%2Castro-ph%2F0112197%2Castro-ph%2F0112205%2Castro-ph%2F0112105%2Castro-ph%2F0112003%2Castro-ph%2F0112378%2Castro-ph%2F0112272%2Castro-ph%2F0112121%2Castro-ph%2F0112437%2Castro-ph%2F0112069%2Castro-ph%2F0112520%2Castro-ph%2F0112059%2Castro-ph%2F0112413%2Castro-ph%2F0112187%2Castro-ph%2F0112387%2Castro-ph%2F0112420%2Castro-ph%2F0112185%2Castro-ph%2F0112144%2Castro-ph%2F0112281%2Castro-ph%2F0112233%2Castro-ph%2F0112479%2Castro-ph%2F0112372%2Castro-ph%2F0112250%2Castro-ph%2F0112225%2Castro-ph%2F0112421%2Castro-ph%2F0112496%2Castro-ph%2F0112318%2Castro-ph%2F0112471%2Castro-ph%2F0112289%2Castro-ph%2F0112510%2Castro-ph%2F0112242%2Castro-ph%2F0112381%2Castro-ph%2F0112427%2Castro-ph%2F0112362%2Castro-ph%2F0112533%2Castro-ph%2F0112347%2Castro-ph%2F0112499%2Castro-ph%2F0112264%2Castro-ph%2F0112396%2Castro-ph%2F0112072%2Castro-ph%2F0112373%2Castro-ph%2F0112495%2Castro-ph%2F0112315%2Castro-ph%2F0112086%2Castro-ph%2F0112060%2Castro-ph%2F0112161%2Castro-ph%2F0112087%2Castro-ph%2F0112516%2Castro-ph%2F0112306%2Castro-ph%2F0112285%2Castro-ph%2F0112311%2Castro-ph%2F0112293%2Castro-ph%2F0112216%2Castro-ph%2F0112016%2Castro-ph%2F0112534%2Castro-ph%2F0112552%2Castro-ph%2F0112255%2Castro-ph%2F0112119%2Castro-ph%2F0112088%2Castro-ph%2F0112323%2Castro-ph%2F0112304%2Castro-ph%2F0112308%2Castro-ph%2F0112263%2Castro-ph%2F0112052%2Castro-ph%2F0112529&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent experimental results from supernovae Ia observations have been\ninterpreted to show that the rate of expansion of the universe is increasing.\nOther recent experimental results find strong indications that the universe is\n``flat.'' In this paper, I investigate some solutions of Einstein's field\nequations which go smoothly between Schwarzschild's relativistic gravitational\nsolution near a mass concentration to the Friedmann-Lemaitre expanding universe\nsolution. In particular, the static, curved-space extension of the Lemaitre-\nSchwarzschild solution in vacuum is given. Uniqueness conditions are discussed.\nOne of these metrics preserves the ``cosmological equation.'' We find that when\nthe rate of expansion of the universe is increasing, space is broken up into\ndomains of attraction. Outside a domain of attraction, the expansion of the\nuniverse is strong enough to accelerate a test particle away from the domain\nboundary. I give a domain-size--mass relationship. This relationship may very\nwell be important to our understanding of the large scale structure of the\nuniverse."}, "authors": ["George A. Baker Jr"], "author_detail": {"name": "George A. Baker Jr"}, "author": "George A. Baker Jr", "arxiv_comment": "27 pages, 4 figures, latex2e (Kluwer style) to be published in\n  General Relativity and Gravitation, June 2002", "links": [{"href": "http://arxiv.org/abs/astro-ph/0112320v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0112320v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0112320v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0112320v1", "journal_reference": null, "doi": null, "fulltext": "Effects on the structure of the universe of an\naccelerating expansion ∗\nGeorge A. Baker, Jr.\n\narXiv:astro-ph/0112320v1 13 Dec 2001\n\nTheoretical Division, Los Alamos National Laboratory\nUniversity of California, Los Alamos, N. M. 87544 USA\n535 May 7, 2019\nAbstract. Recent experimental results from supernovae Ia observations have been\ninterpreted to show that the rate of expansion of the universe is increasing. Other\nrecent experimental results find strong indications that the universe is \"flat.\" In this\npaper, I investigate some solutions of Einstein's field equations which go smoothly\nbetween Schwarzschild's relativistic gravitational solution near a mass concentration\nto the Friedmann-Lemaı̂tre expanding universe solution. In particular, the static,\ncurved-space extension of the Lemaı̂tre-Schwarzschild solution in vacuum is given.\nUniqueness conditions are discussed. One of these metrics preserves the \"cosmological equation.\" We find that when the rate of expansion of the universe is increasing,\nspace is broken up into domains of attraction. Outside a domain of attraction, the\nexpansion of the universe is strong enough to accelerate a test particle away from the\ndomain boundary. I give a domain-size–mass relationship. This relationship may very\nwell be important to our understanding of the large scale structure of the universe.\npacs: 96.30Sf, 97.60Bw, 95.85Bh, 04.20-q\n\n1. INTRODUCTION AND SUMMARY\nRecently de Bernardis et al.[1] reported that a very careful examination\nof the cosmic microwave background provides, as further explained by\nHu[2], very strong evidence that the universe is flat!\nIn addition, data has recently been reported by Riess et al.[3], and\nPerlmutter et al.[4] on measurements of the luminosity and the redshift\nof a number of high-redshift supernovae of type Ia. The authors' best\nfit to their data involves a strongly curved space-time. The curvature\nconstant Ωk (defined below) that they find is about -1.05, which corresponds to a strongly curved, open universe. However, their error bars\nare sufficiently large so that a flat universe is not inconsistent with their\ndata. These authors have analyzed their data on the basis of the \"cosmological equation\" between the rate of expansion, the mean energy\ndensity, the radius of curvature of space, and the cosmological constant. This relation has been derived from Einstein's field equations[5]\nunder the assumption of the validity of the Friedmann-Lemaı̂tre line\nWork supported in part by the US Department of Energy (contract W-7405ENG-36)\n∗\n\neffects2r.tex; 7/05/2019; 8:55; p.1\n\n\f2\n\nGeorge A. Baker, Jr.\n\nelement at large distances. The authors have concluded, in terms of this\nmodel of the universe, that instead of the rate of expansion decreasing,\nas many workers had thought, their data is best fit by a model in\nwhich the rate of expansion is increasing. Riess et al.[3] find that the\ndeceleration/acceleration parameter (as defined in section VI) q0 < 0\n(acceleration) with better than 90% confidence, and Perlmutter et al.[4]\nfind the same at the 2.86 standard deviation level of confidence.\nIn this paper, I investigate some different metrics which may facilitate the investigation of some of the consequences of the reported\nacceleration of the expansion of the universe. I will focus on spherically\nsymmetric models with a central mass concentration.\nThe fact that the rate of expansion of the universe is increasing\nleads to the conclusion that the universe is broken up into domains of\nattraction. Briefly, the underlying physics of this feature may be seen in\nthe following rough analysis. The equation of purely radial motion of a\ntest particle at rest with respect to the Friedmann-Lemaı̂tre coordinate\nsystem is just\nä\n(1)\nr̈ = r,\na\nwhere r is the proper distance, and a is the universal expansion factor\nwhich is a function of time alone. The most simple way to approximate\nthe effects of a gravitating mass concentration is just to add Newton's\nforce term so that\nGM\nä\n(2)\nr̈ = r − 2 .\na\nr\nIf the expansion of the universe is decelerating, then ä < 0, so r̈ < 0\nalways. Near a gravitating mass the expansion is clearly unimportant\nand Newton's laws hold with only minimal corrections. On the other\nhand, if the expansion is accelerating, then ä > 0. Thus there will be\na distance such that the expansion of the universe exactly balances\nthe gravitational attraction. Test particles at smaller distances will be\naccelerated inwards. I call this region a domain of attraction. Test particles outside will be accelerated outwards. Hence in this very simple case\nthere are two attractors, one is the mass concentration and the other is\nthe point at infinity. We give a domain-size–mass relation in equations\n(73) and (76). In the decelerating case, there is just one attractor and\nits domain of attraction is the entire space.\nIn the second section we remind the reader of the Lemaı̂tre-Tolman\nformalism. This formalism has the feature that the proper time appears\nexplicitly. Thus space-time is divided into a set of three-dimensional,\nspace-like manifolds which are indexed by the proper time. Since it is\nthe proper time which appears in the universal expansion function in\nthe Friedmann-Lemaı̂tre line element and it governs the universe as a\n\neffects2r.tex; 7/05/2019; 8:55; p.2\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n3\n\nwhole, it seems important to preserve the property that the universal\nexpansion factor is a function of the proper time alone.\nIn the third section we review three different ways to go from the\nSchwarzschild metric of a planetary system to expanding space at large\ndistances. The McVittie solution has a problem at the Schwarzschild radius using normal expansion factors. The Einstein-Straus \"Swiss Cheese\nModel\" is unstable to perturbations and there are orbits which are discontinuous functions of their initial conditions. The Bona-Stela model\nusing Liebovitz metric insertions in a Friedmann-Lemaı̂tre background\npredicts an increase in the length of the earth's year which is in strong\ndisagreement with observations.\nIn the fourth section we consider the idea that the vacuum is something more than just empty space. The self-energy of the vacuum\nmay correspond to a mass-energy density of empty space. We know\non the laboratory scale from, for example, the Casimir effect, and\non the microscopic scale from particle physics that the vacuum does\nhave measurable effects. So far as I know, particle theorists have not\nyet been able to compute a quantitative result for the energy density.\nHowever, they do feel that such an idea is extremely plausible. We\nconsider in this section a solution to Einstein's field equations which\nhas a homogeneous vacuum, mass-energy density and so preserves the\nso called \"cosmological equation.\" This solution reduces precisely to\nthe exterior Schwarzschild solution near the central mass condensation. In addition, it reduces to the Friedmann-Lemaı̂tre solution far\nfrom the mass concentration. This solution is continuously, infinitely\ndifferentiable everywhere, except at the mass concentration.\nIn the fifth section, I explore some of the properties of the solution\nobtained in the fourth section. Both \"flat\" and curved space are considered. The limiting results are as expected and the transition between\nthe two aforementioned limits are illustrated. In particular the static,\ncurved-space extension of the Lemaı̂tre-Schwarzschild solution is given\nfor a mass concentration in a vacuum.\nIn the sixth section, I consider the implications of the increasing\nrate of expansion of the universe on some of the large scale structures\nfound in the universe. It is found that this feature creates domains\nof attraction. A domain-size–mass relation is derived. Outside these\ndomains, the increasing rate of the expansion of the universe would,\nin time, be expected to tear the structures apart. It is suggested, from\nthe correspondence between the predicted size of these domains of attraction, the size of the Local Group, and the size of the Virgo Cluster,\nthat this effect may well be important in any study of the large scale\nstructure of the universe.\n\neffects2r.tex; 7/05/2019; 8:55; p.3\n\n\f4\n\nGeorge A. Baker, Jr.\n\n2. THE LEMAÎTRE-TOLMAN FORMALISM\nI will find it convenient to employ the Lemaı̂tre-Tolman[6, 7] formalism.\nIn this case we start with the line element,\nds2 = −e2α(ρ,τ ) dρ2 − e2β(ρ,τ ) (dθ 2 + sin2 θ dφ2 ) + c2 dτ 2 ,\n\n(3)\n\nwhere c is the velocity of light, and τ is the proper time for an observer at rest in this coordinate system. This line element is spherically\nsymmetric in its structure, which is of sufficient generality for my\npurposes.\nThe reason for our interest in this particular form of the line element is that two important line elements are special cases. First, the\nFriedmann-Lemaı̂tre line element,\n\u0001\nds2 = −a2 (τ )dρ2 − a2 (τ )ρ2 dθ 2 + sin2 θ dφ2 + c2 dτ 2\n(4)\n\nis manifestly of form (3). The second important line element is the\nstatic Schwarzschild line element. It is usually written in the form,\n\u0012\n\u0013\n\u0001\n2GM\ndr 2\n2\n2\n2\n2\n2\n2\n− r dθ + sin θ dφ + c 1 − 2\ndt2 (5)\nds = −\n2GM\nc r\n1− 2\nc r\n\nHowever, as is well known[8] this form does not extend inside the\nSchwarzschild radius rS = 2GM/c2 . An alternate form has been given\nby Lemaı̂tre [9]. It is\n\u0001\n2GM\nds2 = − 2 dρ2 − R2 dθ 2 + sin2 θ dφ2 + c2 dτ 2 ,\nc R\ni2/3\nh p\n.\nR ≡ 32 2GM/c2 (ρ − cτ )\n\n(6)\n\nThis form, without going into the full generality of the Schwarzschild\nsolution, has no singularity at the Schwarzschild radius. It is a coordinate system adapted to a freely falling observer. This metric can\neasily be seen to have the form (3). As it is our goal to find a metric\nwhich tends asymptotically to the Friedmann-Lemaı̂tre metric at very\nlarge distances, and tends asymptotically to the Schwarzschild metric\non the scale of our planetary system, it seems appropriate to use the\nLemaı̂tre-Tolman formalism. In this formalism, four dimensional spacetime is described by a set of three-dimensional, space-like hypersurfaces,\nindexed by the time like variable τ .\nNext we consider the stress-energy tensor for the line element (3).\nFirst,\n\u0011\n\u0010\n(7)\n8πcT14 = −2 β ′ β̇ − α̇β ′ + β̇ ′ = 0,\n\neffects2r.tex; 7/05/2019; 8:55; p.4\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n5\n\nwhere an overdot means differentiation with respect to τ and ′ means\ndifferentiation with respect to ρ. The conditions T14 = −e2α T41 = 0 are\nset in order to have a time-orthogonal coordinate system. The solution\nof this equation is well known to be,\neα =\n\nβ ′ eβ\n,\nf (ρ)\n\n0 < f (ρ) < ∞,\n\n(8)\n\nwhere f (ρ) is undetermined. This result allows us to eliminate α(ρ, τ )\nin terms of β(ρ, τ ) and f (ρ).\nThe other non-zero elements of the stress-energy tensor are,\n!2\nβ̈\nβ̇\n8πT11 = e−2β − e−2α (β ′ )2 + 2 2 + 3\n−Λ\nc\nc\n!2\nβ̈\nβ̇\n= 2 2 +3\n+ e−2β [1 − f 2 (ρ)] − Λ\n(9)\nc\nc\n\u0002\n\u0003\nβ̈ + β̇ 2 + α̇β̇ + α̈ + α̇2\n− e−2α β ′′ + (β ′ )2 − α′ β ′ − Λ\n2\nc\n1\n∂T\n8π\n(10)\n= 8πT11 + ′ 1\n2β ∂ρ\n!2\n\u0002\n\u0003\nα̇β̇\nβ̇\n+ 2 2 + e−2β − e−2α 2β ′′ + 3(β ′ )2 − 2α′ β ′ − Λ\n=\nc\nc\n!2\n\u0015\n\u0014\nβ̇\nβ̇ β̇ ′\n2f (ρ)f ′ (ρ)\n−2β\n2\n= 3\n+2 2 ′ +e\n−Λ\n(11)\n1 − f (ρ) −\nc\nc β\nβ′\n\n8πT22 = 8πT33 =\n\n8πT44\n\nWe see that by (10), the necessary and sufficient condition that the\nspatial curvature be isotropic is that T11 be independent of ρ. In addition, this condition implies that the spatial curvature is homogeneous\nthroughout all space.\nR\nIf we replace f (ρ) by unity, then by construction, eβ = eα dρ, the\ndistance measured from the origin. Hence the area of a sphere is just 4π\ntimes the square of the radius, as is given by the standard Euclidean\nformula. I will call this special case the case of \"flat\" space. In the\nspecial case of \"flat\" space and isotropic spatial curvature, (9) and (11)\nbecome\n!2\nβ̇\nβ̈\n2\n3\n1\n− Λ,\n(12)\n8πT1 = 8πT2 = 8πT3 = 2 2 + 3\nc\nc\n!\n′\nβ̇\nβ̇\nβ̇\n3 + 2 ′ − Λ.\n(13)\n8πT44 =\nc\nc\ncβ\n\neffects2r.tex; 7/05/2019; 8:55; p.5\n\n\f6\n\nGeorge A. Baker, Jr.\n\nWe observe, that (9) and (11) may be rewritten as,\n\n\n\n\n!2\n\n\n∂\nΛ\nβ̇\n−  + eβ [1 − f 2 (ρ)] = 8πT11 β̇e3β\ne3β \n\n∂τ \nc\n3\n\n\n\n\n!2\n\nΛ\n∂  3β  β̇\ne\n−\n+ eβ [1 − f 2 (ρ)] = 8πT44 β ′ e3β .\n\n∂ρ \nc\n3\n\n(14)\n\n(15)\n\nThe quantity\n\nm=\n\nc2\n\n\n\n\n2G \n\n\n\ne3β \n\nβ̇\nc\n\n!2\n\n\n\nΛ\nβ\n2\n−\n+ e [1 − f (ρ)]\n\n3\n\n\n(16)\n\nis easily recognized[6, 10] to be the mass equivalent to the total energy\ncontained within the comoving shell with radial coordinate ρ at time\nτ.\nWe will also be concerned with the dynamics as seen in this formalism. The main interest will be to assess the difference between the\neffects on planetary systems of the metrics which we will study herein,\nand the Schwarzschild metric. In particular I am interested in the solar\nsystem. The standard formula for the equations of motion of a test\nparticle[5] is\n#\n\" \u0012 \u0013\n\u0012 \u0013\nds −1 i\n1\ndxi dxj\nds d\ngki\nẋ = gij,k\n(17)\ndτ dτ\ndτ\n2\ndτ dτ\nwhere of course dx4 /dτ = 1. The fourth component of (17) gives the\nconvenient equation,\ni\nh\n\n\"\u0012 \u0013 #\n\u0012 \u0013\n2α ρ̇2 + β̇e2β θ̇ 2 + sin2 θ φ̇2 \n−1\n\nα̇e\nds d\nds\nB=\n=−\n\n\ndτ dτ\ndτ\nc2\n(18)\n\nExplicitly, the three equations of motion are,\n\nh\ni\nd \u0002 2α \u0003\ne ρ̇ = α′ e2α ρ̇2 + β ′ e2β θ̇ 2 + sin2 θ φ̇2 ,\ndτ\nd h 2β i\ne θ̇ = e2β sin θ cos θ φ̇2 ,\nBe2β θ̇ +\ndτ\"\n\u0012 \u0013\n\u0012 \u0013−1 #\nds d\nds\ne2β sin2 θ\nφ̇ = 0.\ndτ dτ\ndτ\nBe2α ρ̇ +\n\n(19)\n(20)\n(21)\n\neffects2r.tex; 7/05/2019; 8:55; p.6\n\n\f7\n\nACCELERATING EXPANSION OF THE UNIVERSE\n\nFollowing the completely standard modus operandi, we make an immediate simplification by setting θ = π/2. Now equation (20) is explicitly\nsatisfied and the other two equation are simplified. The first integral of\n(21) gives us the conservation of angular momentum, to wit,\n\u0012 \u0013\nds\n2β\n,\n(22)\ne φ̇ = C0\ndτ\nwhere the Ci are constants of integration. By means of (3) we may\nwrite (22) as,\n\u0011 C 2 e−4β c2 − e2α ρ̇2 \u0001\n\u0010\n2\n2α 2\n2β 2\n2\n2 −4β\nc − e ρ̇ − e φ̇ = 0\nφ̇ = C0 e\n.\n(23)\n1 + C02 e−2β\nThese steps leave us with the single equation (19) for ρ(τ ) to deal\nwith. It now becomes\n\u0001\nC02 e−4β c2 − e2α ρ̇2\nφ̇2\n′\n\u0001 ,\n(24)\nB ρ̇ + (2α̇ + α ρ̇)ρ̇ + ρ̈ = ′ =\nβ\nβ ′ 1 + C02 e−2β\n\nwhere B (18) may be re-expressed as,\n\u0001\n\u0012 \u00132\nC02 β̇e−2β c2 − e2α ρ̇2\n2α ρ̇\n\u0001\n−\nB = −α̇e\nc\nc2 1 + C02 e−2β\n\n(25)\n\nThus, (19) becomes,\n\n\u0010\n\u0011\n\u0001\n\u0012 \u00132\nC02 e−2β c2 e−2β + β̇β ′ ρ̇ c2 − e2α ρ̇2\n2α ρ̇\n\u0001\nρ̈ = −(2α̇+α′ ρ̇)ρ̇+\n+\nρ̇\nα̇e\nc\nc2 β ′ 1 + C02 e−2β\n(26)\nwhich gives an explicit, ordinary, non-linear differential equation for\nρ(τ ). Coupled with θ = π/2 and equation (23), we have the equations\nof motion of the test particle.\nA more transparent form follows for the purpose of identifying the\ncorrections to the Schwarzschild dynamics results if we make the change\nof variables,\nr = exp[β(ρ, τ )], ⇒ ρ = ρ(r, τ ).\n(27)\nThen we have\n\n\u0010\n\u0011\nṙ = β̇ + β ′ ρ̇ r.\n\nEquation (19) becomes,\n\"\n\u00132 #\n\u0012\n′\nc2 C02\nṙ\nf\nr\n+\n−\nβ̇\n+\nr̈ = β̈ + β̇ 2 +\nf β′ r\nr3\n\n(28)\n\nβ̇ ′ + β̇β ′\nc2 f 2 β ′\n\n!\n\n\u0010\n\u00113\nṙ − r β̇\n\neffects2r.tex; 7/05/2019; 8:55; p.7\n\n\f8\n\nGeorge A. Baker, Jr.\n\n\n\n+\n\nβ̇\nC02  (ṙ − β̇r) −\nr\n\n\nβ̇(ṙ − β̇r)3 C02 c2 \n− 4\n−\nrc2 f 2\nr\n\u0001\n.\nr 1 + C02 /r 2\nṙ − β̇r\nrf\n\n!2\n\n(29)\n\n3. CLASSICAL MODELS\nCurrently there are two general relativistic descriptions of spacetime in\npopular use. For planetary systems and other gravitationally bound\nstructures which are small on the scale of the universe, there is a\nstatic description of the behavior of spacetime. On the other hand,\nfor large-scale behavior, there is a time dependent description which\nis appropriate as a description of phenomena such as the observed\nred-shift of distant galaxies.\nThe classic question is, \"How can these two disparate descriptions of\nspacetime possibly be reconciled with each other?\" The first answer to\nthis problem was given by McVittie[11]. Using the line element form,\nds2 = −eμ (dρ2 + ρ2 dθ 2 + ρ2 sin2 θdφ2 ) + eν dt2\n\n(30)\n\nHe proposed the solution,\nμ\n\ne\n\nν\n\ne\n\na(t)2\n=\n[1 + (a(t)ρ/2a(t)R)2 ]2\n\u00132\n\u0012\n2 1 − m/2a(t)ρ\n= c\n1 + m/2a(t)ρ\n\n\u0012\n\nm\n1+\n2a(t)ρ\n\n\u00134\n\n\u0014\n\u0010 ρ \u00112 \u00151/2\nGM\n(31)\nm≡ 2 1+\nc\n2R\n\nwhere G is Newton's constant of gravitation. Some of the virtues of\nthis model can be seen by examining the corresponding stress-energy\ntensor,\n1 + (m/2a(t)ρ)2\na(t)2 R2 (1 + m/2aρ)5 (1 − m/2a(t)ρ)\n2äa[1 + m/2a(t)ρ] + ȧ2 [1 − 5m/2a(t)ρ]\n+\n−Λ\na(t)2 c2 (1 − m/2a(t)ρ)\n= 8πT33 = 8πT11\n3\n3ȧ2\n=\n+\n− Λ.\na(t)2 R2 (1 + m/2a(t)ρ)5\nc2 a2\n\n8πT11 =\n\n8πT22\n8πT44\n\n(32)\n\nIn the limit as m → 0 or ρ → ∞ these tensor elements reduce to those\ncorresponding to (4), and also in the limit as R → ∞ and ȧ → 0 they\n\neffects2r.tex; 7/05/2019; 8:55; p.8\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n9\n\nvanish as with the Schwarzschild metric. For this metric the spatial\ncurvature is isotropic, but not homogeneous. The dynamical behavior\nof a test particle can be computed from (17). In the usual case θ = π/2,\nthe equation of motion, analogous to (29), becomes,\n#\n\" \u0012 \u0013\n\u0012\n\u0013\nȧ\nȧ 2 ä\nȧ\nr̈ − 2 ṙ + r 2\n+ μ̇ ṙ − r\n−\na\na\na\na\n\u0012\n\u00132\n\u0014\n\u0011 A2 a4 e−2μ \u0015 \u0012 ds \u00132\n1 \u0010 ′r\nṙ\n1 ′\nȧ\nμ +2\n= μa\n− r +\n(33)\n2\na a2\n2\na\nr3\ndt\n\"\u0012 \u0013 # \u0012\n\u0013\n\u0012 \u0013\nds −2\nȧ\n1 ′ ν−μ 1 ds 2 d\n−\nṙ − r ,\n− ν ae\n2\n2 dt\ndt\ndt\na\nwhere, in concert with (22), r 2 eμ φ̇ = A(ds/dt), and the change of\nvariables r = a(t)ρ has been used. The slow speed limit of this equation\nof motion is,\nA2 c2 GM\nä\n(34)\nr̈ = r + 3 − 2\na\nr\nr\nThis equation differs from Newton's by the ä term. This term is proportion to H02 where H0 ≈ 1.62 × 10−18 h50 is Hubble's constant. h50 = 1 if\nH0 = 50 km/sec/Megaparsec. Thus in McVittie's model, the effects on\nthe solar system are too small to be currently measured. For systems\nlike the solar system, the McVittie model works very well. However for\nother systems, if we make the popular assumption that a(t) ∝ tγ then,\nas in McVittie's solution a(t) is a function of coordinate time and not of\nproper time, there will be a singularity at the the Schwarzschild radius\nas a(t) will diverge there since t → ∞.\nA second answer to our question was given by Einstein and Straus\n[12]. It is the so called \"Swiss Cheese Model.\" They showed that the\nstatic Schwarzschild metric (5) can be matched to any FriedmannLemaı̂tre-Robertson-Walker metric on a spherical surface of an expanding radius in the Schwarzschild metric, but of a constant radius in\nthe Friedmann-Lemaı̂tre-Robertson-Walker metric. It has been found\nhowever[13, 14] to be unstable with respect to perturbations. In addition, there is another unphysical aspect of this model. The slowspeed dynamical equations in the interior Schwarzschild (~ri ) and in the\nexterior Friedmann-Lemaı̂tre (~re ) regions are, respectively,\nGM\nd2~ri\n= − 3 ~ri ,\n2\ndt\nri\n\nä\nd2~re\n= ~re .\n2\ndt\na\n\n(35)\n\nFor ease of exposition, we choose a(t) = (t/t0 )2/3 . Thus the general\n~ γ + Bt\n~ 1−γ = At\n~ 2/3 + Bt\n~ 1/3 ,\nsolution in the exterior region is ~re = At\nwhich is the equation of a parabola.\n\neffects2r.tex; 7/05/2019; 8:55; p.9\n\n\f10\n\nGeorge A. Baker, Jr.\n\nAs an illustration of the behavior of the \"Swiss cheese model\" I have\ncomputed the following trajectories. I use as a unit\nof time the Hubble\np\n3\ntime, that is 1/H0 . As a unit of distance I use M⊙ G/H02 which is\n−2/3\nabout 25h50 million Astronomical units. M⊙ is the mass of the Sun.\nI set t0 = 1. The metric interface is at r = t2/3 in these units for\nflat spacetime, as mentioned above. In order to follow a FriedmannLemaı̂tre trajectory the test particle's distance from the origin must be\nlarger at every time than that for the interface. Let us take in rectangular coordinates the initial conditions, x = λ, ẋ = 0, y = 0, ẏ = λ.\nThe trajectory in the external region is\n\" \u0012 \u0013\n\u0012 \u00131/3 #\nt\nt 2/3\n+2\nx = λ −\nt0\nt0\n\"\u0012 \u0013\n\u0012\n\u0013 #\nt 2/3\nt 1/3\ny = 3t0 λ\n−\n.\n(36)\nt0\nt0\nThus,\nh\ni\nλ2 10t4/3 − 22t + 13t2/3 > t4/3 .\n\n(37)\n\nThe trajectory will intersect the interface if equation (37) is an equality.\nBy means of the quadratic formula, an intersection will occur if\np\n11 ± −9 + 13/λ2\n1/3\n.\n(38)\nt =\n10 − 1/λ2\n√\nIt will be observed that for λ < 13/3 there are two\n√ real roots. If\nλ = 1, then t1/3 = 1, 13/9. On the other hand, if λ > √ 13/3, the roots\nare imaginary, so there are no intersections. If λ = 13/3 there is a\ndouble root at t1/3 = 13/11. In this case the parabolic trajectory just\ngrazes the metric interface.\n√ In figure 1, I illustrate the two different trajectories when r0 =\n13/3 and φ̇0 = 1.0. In the case where r0 is just any arbitrary amount\nsmaller, the expanding interface overtakes the test particle following its\nFriedmann-Lemaı̂tre parabolic trajectory and it must then follow the\nstatic Schwarzschild equations of motion. The Schwarzschild metric\ntakes over at t = (13/11)3 as explained above, and after that the\ntrajectory is an ellipse with semimajor axis 7.6287 and the semiminor\naxis 3.986. These imply an eccentricity of 0.690 68 and a semilatus\nrectum parameter of p = 2.086. On the other hand, if r0 is any arbitrary amount larger, it escapes the moving interface and continues to\nfollow the parabolic trajectory. It is evident from figure 1 that future\ntrajectories are, in some cases, discontinuous functions of the initial\nconditions for the \"Swiss cheese model.\"\n\neffects2r.tex; 7/05/2019; 8:55; p.10\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n11\n\nPut another way, the Schwarzschild metric permits closed orbits and\nthe Friedmann-Lemaı̂tre metric does not. In terms of the latter coordinates, one can choose initial conditions so that the parabolic trajectory\njust grazes the metric interface (fixed radial coordinate in this metric)\nand the speed is low enough that for infinitesimally different initial\nconditions the trajectory crosses the interface and is caught in a bound\nstate, or alternatively misses the interface and proceeds on its parabolic\ntrajectory. All these effects take place in supposedly empty space of the\n−2/3\norder of 25h50 million AU from a mass concentration of size M⊙ , and\nare quite counter to one's physical intuition that such discontinuities\nshould not occur there, except perhaps if the central void was created\nby an explosion leaving a remnant star behind.\nA third answer was provided by Bona and Stela[15]. It is a different\ntype of \"Swiss Cheese Model.\" They insert in a flat space, FriedmannLemaı̂tre-Robertson-Walker background a spherical patch in which,\ninstead of the Schwarzschild metric, the Liebovitz[16] solution is inserted. In the classification of Krasiński[10], this solution is in the \"β ′ 6=\n0\" subfamily of the Szekeres-Szafron family of solutions. Briefly put,\nthis solution results from setting T11 equal to its Friedmann-Lemaı̂tre\nvalue, i.e., by (9),\n!2\n\u0012 \u00132\nȧ\nä\nβ̇\nβ̈\n1\n−Λ\n(39)\n−Λ=2 2 +\n8πT1 = 2 2 + 3\nc\nc\nac\nac\nSince the right hand side of (39) is independent of ρ, the spatial curvature is isotropic by (10), and is homogeneous.\nAs (39) is a generalized Riccati equation for β, it can be integrated.\nThe general solution is,\nZ τ\ndt\n2/3\nβ(ρ,τ )\n.\ne\n= a(τ ) [C1 (ρ) + C2 (ρ)w(τ )] , where w(τ ) =\n3\nτ0 a(t)\n(40)\nFor this solution, we can compute that,\n\u001a\n\u001b\u001a\n\u001b\nȧ\n2C2 (ρ)ẇ\n2C2′ (ρ)ẇ\nȧ\n4\n+\n+\n8πT4 = 3\n(41)\na 3[C1 (ρ) + C2 (ρ)w]\na 3[C1′ (ρ) + C2′ (ρ)w]\nThe dynamics of this model reveal that its predictions are at considerable variance with the observations of planetary astronomy. The\nslow-speed limit of the equations of motion follows directly from (29)\nand is, when we remember that C0 = O(c−1 ) in the slow speed limit,\nr̈ =\n\nc2 C02\nä\n2C2 (ρ)2\n2ȧC2 (ρ)r\n+\nr−\n−\n,\na\n9a3 r 2\nr3\n3a(ra)3/2\n\n(42)\n\neffects2r.tex; 7/05/2019; 8:55; p.11\n\n\f12\n\nGeorge A. Baker, Jr.\n\nwhere r(ρ, τ ) = eβ(ρ,τ ) . In\n√ order to agree with Newton's result, we\nmust choose C2 (ρ) = − 32 2GM . The choice of C1 (ρ) does not affect\np\nthe dynamics, so we pick C1 = 23 2GM/c2 ρ. This choice suffices to\ncause T44 → 3(ȧ/a)2 as ρ → ∞. (Note that different choices of C1 and\nC2 are required for the zero mass case.)\nThis result is substantially unique for a model which has isotropic\nspatial curvature, a non-zero central mass concentration, and is asymptotic, at large distances from that mass, to the Friedmann-Lemaı̂tre,\nexpanding universe model. However, this model leads, by (42), to the\nresults,\nr\nä\nȧ 2GM\nGM\nc2 C 2\nr̈ = r + 2\n− 3 2 + 30 .\n(43)\na\na\nar\na r\nr\nThe problem to be noticed is the factor of a3 in the denominator of\nthe Newton gravitational attraction term. The import of this factor is\nthat the radius of the earth's orbit will be proportional to a3 as the\ngravitational term and the angular momentum term dominate the other\nterms. By Kepler's law that the ratio of the squares of the periods is\nproportional to the cube of the diameters, the year will be proportional\nto a9/2 This means that the year should be increasing at the rate of\nabout 0.73h50 seconds per century. Here h50 is the Hubble constant\nin units of 50 kilometers per second per Megaparsec. Since the value\ncurrently accepted by the International Astronomical Union is +0.0095\nseconds per Julian century[17], the predictions of this model are in very\nserious disagreement with observations. The above results are in terms\nof the time variable τ . Properly done, we need the results in terms of\ntime measured on the Earth for the Liebovitz line element. The reexpression of this result in terms of \"Earth time\" involves a correction\nof the order of H0 GM⊙ /(c2 R⊕ ) where M⊙ is the mass of the Sun and\nr⊕ is the radius of the orbit of the Earth. This quantity is of the order\nof 10−8 smaller than H0 which is of the order of the predicted effect.\nHence, this latter correction is negligible in this case. There is, of course,\nalso a time independent correction to the relation between earth time\nand τ of the order of GM⊙ /(c2 R⊕ ) but it is not relevant to the effect\ndiscussed here.\nThe conclusion of this section is that in one way or another, all the\nmodels reviewed that join the Schwarzschild metric at small distances\nand the expanding universe metric at large distances have problems of\none sort or another. Panek [18] has stress the need to go beyond the\n\"Swiss Cheese Model\" and has analyzed numerically several different\ndensity profiles. In the next section, we will analyze the effect of a mass\nconcentration inserted in a universe with a homogeneous mass-energy\ndensity.\n\neffects2r.tex; 7/05/2019; 8:55; p.12\n\n\f13\n\nACCELERATING EXPANSION OF THE UNIVERSE\n\n4. HOMOGENEOUS, MASS-ENERGY DENSITY\nSOLUTIONS\nIn line with the idea that the vacuum has a homogeneous self-energy, we\nconsider homogeneous mass-energy density solutions to Einstein's field\nequations. Our case of interest is the embedding of a mass concentration\nin expanding, curved space. We impose the condition,\n8πT44\n\nβ̇\nc\n\n= 3\n= 3\n\n\u0012\n\n!2\n\nȧ\nca\n\n\u00132\n\n\u0015\n\u0014\nβ̇ β̇ ′\n2f (ρ)f ′ (ρ)\n−2β\n2\n+2 2 ′ +e\n−Λ\n1 − f (ρ) −\nc β\nβ′\n+\n\n3\n−Λ\n(aR0 )2\n\n(44)\n\nwhich is the Friedmann-Lemaı̂tre value in curved space. Since the right\nhand side is a function of τ alone, we may integrate this equation, as\nat (15), with respect to ρ to give,\n2\n\n2 −2β\n\nβ̇ + c e\n\n\u0002\n\n2\n\n\u0003\n1 − f (ρ) =\n\n\u0012 \u00132\nȧ\nc2\n+\n+ C3 (τ )e−3β .\na\n(aR0 )2\n\n(45)\n\nAt short distances, we wish to match the Lemaı̂tre-Schwarzschild metric\n(6). We find, upon substituting in (45), for β̇ that\n\u0002\n\u0003\n2GM e−3β + c2 e−2β 1 − f 2 (ρ) ≈\n\n\u0012 \u00132\nȧ\nc2\n+\n+ C3 (τ )e−3β . (46)\na\n(aR0 )2\n\nThus, we shall choose C3 (τ ) = 2GM independent of τ . For later convenience we rewrite (45) as\n\u0012 \u00132\n\u0002\n\u0003\nc2\nȧ\n+\n+ 2GM e−3β − c2 e−2β 1 − f 2 (ρ) .\nβ̇ =\n2\na\n(aR0 )\n2\n\n(47)\n\nIf we are given β(ρ0 , τ0 ), then this non-linear, first-order differential\nequation may be integrated with respect to τ to give β(ρ0 , τ ) ∀ τ .\nIn the special case M = 0 we have the Friedmann-Lemaı̂tre solution,\nand the special case, ȧ = ä = 0, R0 = ∞ gives us agreement with the\nLemaı̂tre form of the static Schwarzschild metric (6).\nNext we compute T11 from (9) and the differentiation of (47). We\nobtain,\n2\n\n8πc\n\nT11\n\n\u0012 \u00132\nȧ\n3c2\n=3\n+\na\n(aR0 )2\n\n(48)\n\neffects2r.tex; 7/05/2019; 8:55; p.13\n\n\f14\n\nGeorge A. Baker, Jr.\n\n\"\n\nȧä\n2 2 −\na\n\n#\n\u0012 \u00133\nȧ\nȧc2\n− 3 2\na\na R0\n\n+ (\u0012 \u0013\n)1/2\n\u0002\n\u0003\nȧ 2\nc2\n+ 2GM e−3β − c2 e−2β 1 − f 2 (ρ)\n+\na\n(aR0 )2\nwhich reduces correctly in the two special cases \"flat space\" with ȧ =\nä = 0, and M = 0. Since T11 is not independent of ρ, the spatial curvature is neither homogeneous nor isotropic. It varies, as the distance from\nthe mass concentration increases, from 3(ȧ/a)2 + 3c2 /(aR0 )2 according\nto (48), to the Friedmann-Lemaı̂tre limit 2(ä/a)+(ȧ/a)2 +c2 /(aR0 )2 as\nthe distance tends to infinity. The McVittie solution mentioned above\nhas isotropic, but inhomogeneous, spatial curvature. The difference\nwith this solution lies in the choice here that the universal expansion\nfactor is a function of the proper time and his choice that it is a function\nof his coordinate time, which is not an invariant quantity.\nSo far, we have not had to discuss β ′ or β̇ ′ , as β̇ given by (47)\nhas sufficed for all our computations. The general equations do not\ndetermine the behavior of β as a function of ρ.\nWe observe that in the case of the expanding, curved-space of the\nFriedmann-Lemaı̂tre model universe, that\n\u0002\n\u0003\nc2\n− c2 e−2β 1 − f 2 (ρ) = 0\n2\n(aR0 )\n\n(49)\n\nSince we wish our solution to tend asymptotically to this limit, we\nchoose to require this result in the long distance limit. As a result of\nthis consideration, we choose as initial conditions for (47)\nexp β(ρ, τ0 ) = R0 sin\ns\nf (ρ) =\n\n\u0012\n\nρ\nR0\n\n\u0013\n\n1 − R02 sin2\n\n,\n\u0012\n\n(50)\nρ\nR0\n\n\u0013\n\n/R02 ,\n\n(51)\n\nwhere, as the dependence on R0 is actually a dependence on R02 , there\nis no problem with the case where R02 < 0. The continuation is just\nx sin(ρ/x) 7→ |x| sinh(ρ/|x|). Using these initial conditions and a(τ0 ) =\n1 we find that (49) is exactly satisfied initially. In addition the ratio\nbetween the surface area of a sphere and the square of the radius is in\naccord with that for the Friedmann-Lemaı̂tre solution [5] for expanding,\ncurved space in the open, closed, and \"flat\" cases. This choice, together\nwith (47), defines β ∀ ρ, τ .\n\neffects2r.tex; 7/05/2019; 8:55; p.14\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n15\n\nThe dynamics are given by (29). The slow speed limit of the equation\nof motion is,\n\n\n\"\n#\n\u0012 \u00133\n2\n\n\n\n\nȧä\nȧ\nȧc\n\n\n\n\n2\n−\n−\n\n\n\u0012\n\u0013\n2\n2\n ȧ 2\n\na\na\na3 R0\nr\n+ \"\u0012 \u0013\nr̈ =\n#\n1/2 \n\na\n2\n2\n2 \u0002\n\n\n\u0003\nȧ\nc\n2GM\nc\n\n\n\n\n\n\n+\n+\n− 2 1 − f 2 (ρ)\n\n\na\n(aR0 )2\nr3\nr\n\nGM\nc2 C02\n+\n.\n(52)\nr2\nr3\nThe curvature of space and the expansion of the universe contribute\ncorrections of second order which are currently undetectable in the\nplanetary motions of our solar system.\nThe solutions of this section have assumed that: (i) There is spherical\nsymmetry about the mass-energy concentration. (ii) T14 = T41 = 0. (iii)\nT44 is homogeneous as specified by (44), but may be time dependent.\n(iv) The metric matches in the short distance limit, the form of the\nLemaı̂tre form of the static Schwarzschild metric corresponding to a\nmass-energy concentration of strength M . That is to say, the region in\nwhich the gravitational force is much greater than that of the expansion\nof the universe. (v) The metric matches the long distance form of the\nFriedmann-Lemaı̂tre metric. Under these assumptions, the solutions\nof this section is substantially unique, subject to the usual freedom\ninvolving changes of variables. This result is a parallel to Birkhoff's\ntheorem[19], but involves a different class of models than the class he\nconsidered.\n−\n\n5. PROPERTIES OF THE HOMOGENEOUS,\nMASS-ENERGY DENSITY SOLUTIONS\nIt is convenient to make the change of variables,\neβ(ρ,τ ) = a(τ )eσ(ρ,τ ) .\n\n(53)\n\nThen (47) becomes,\n\u0002\n\u0003\nc2\nȧ\n+ 2GM e−3β − c2 e−2β 1 − f 2 (ρ) ,\nσ̇ 2 + 2 σ̇ =\n2\na\n(aR0 )\n\nwhich may be solved by means of the quadratic formula to give\n\"\u0012 \u0013\n#1/2\nȧ 2\n2GM\nc2 ρ̂2\nc2\nȧ\n+ 3β − 2 2β\n,\n+\nσ̇ = ±\na\na\n(aR0 )2\ne\nR0 e\n\n(54)\n\n(55)\n\neffects2r.tex; 7/05/2019; 8:55; p.15\n\n\f16\n\nGeorge A. Baker, Jr.\n\nwhere I have chosen a simple reparameterization of (45-51), to wit,\n\u0012 \u0013\nρ\n(56)\nρ̂ = R0 sin\nR0\nso that (51) becomes,\nf (ρ̂) =\n\nq\n\n1 − ρ̂2 /R02\n\n(57)\n\nI choose as initial conditions for (55),\na(τ0 ) = 1.0,\n\nexp [σ(ρ̂, τ0 )] = ρ̂\n\n(58)\n\nWe may now check the special case, M = 0 and R0 = ∞. As we\nexpect eβ = a(τ )ρ̂, it follows that σ̇ = 0 for this case. That result in\nturn implies the minus sign in (55) as ȧ is known to be positive. Next\nwe check the case where eβ is very small. The dominant terms in (55)\nare,\ns\n2GM\n.\n(59)\nσ̇ = ±\n(a(τ )eσ )3\nIntegrating this equation with respect to τ yields,\nr\nZ τ\n\u00023\n\u0003\n\u00023\n\u0003\n3 2GM\nc\na−3/2 (t) dt\nexp 2 σ(ρ̂, τ ) − exp 2 σ(ρ̂, τ0 ) = ±\n2\nc2\nτ0\n\n(60)\n\nWhen we note that the integral in (60) is approximately τ − τ0 , and by\nuse of (58), we get,\nr\n\u00023\n\u0003\n3 2GM\n3/2\nexp 2 σ(ρ̂, τ ) ≈ ρ̂ ±\nc(τ − τ0 )\n(61)\n2\nc2\n\nIn order to match the Schwarzschild-Lemaı̂tre metric (6) for small eβ\nwe must choose the minus sign in (61) and hence also in (55). From the\nexamination of these special cases, we conclude in general (assuming\nthat ȧ ≥ 0) that (55) must always be taken as,\n3ȧ\n3\nU̇ =\nU−\n2a\n2\n\n\"\u0012\n\nȧ\nU\na\n\n\u00132\n\n#\n√\n3\n\u0011 1/2\n2GM\nc2 U 2 \u0010 √\n3\nU 4 − ρ̂2\n, (62)\n+ 3\n+\na (τ ) (a(τ )R0 )2\n\nwhere U ≡ exp( 23 σ).\nIt is worth pointing out that when a ≡ 1.0 that (62) subject to the\ninitial conditions (57-58) gives the static, curved-space solution to the\n\neffects2r.tex; 7/05/2019; 8:55; p.16\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n17\n\nEinstein field equations for a mass concentration in a vacuum. In this\nspecial case, β(ρ, τ ) = σ(ρ, τ ) by (53). Eq. (62) becomes in this case,\n#\n\"\n√\n3\n\u0011 1/2\nc2 U 2 \u0010 √\n3\n3\n2\nU 4 − ρ̂\n,\nU̇ = − 2GM +\n2\nR02\n\n(63)\n\nwhere here U ≡ exp( 23 β). The integration of this equation follows\ndirectly using the aforementioned initial conditions. α(ρ, τ ) follows by\n(8) and (57). By (44) and (48), we conclude that the T11 = T22 = T33 =\n3/(8πR02 ) and 8πT44 = R0−2 , as expected in a curved-space vacuum.\nThe time when an observer at rest with respect to the coordinate\nsystem, i.e. a freely falling observer, arrives at the mass concentration,\ni.e., when eσ = 0 for a given ρ̂ with initial conditions (58), is given by\nU (ρ̂, τzero ) − U (ρ̂, τ0 ) = −ρ̂3/2 =\n#\n(\"\n√\n\u0012\n\u00132\nZ\n3\n\u0011 1/2\nȧ\nc2 U 2 \u0010 √\n2GM\n3 τzero\n3\n2\n4\nU − ρ̂\n(64)\n+\nU +\ndt\n−\n2 τ0\na3 (τ )\na\n(a(τ )R0 )2\n)\n3ȧ\n2ρ̂3/2\n− U\nτzero ≈ τ0 + √\n2a\n3 2GM\nby (61) and (62) Thus the physically allowed range of time is 0 ≤ τ ≤\nτzero (ρ̂).\nFor numerical computations it is convenient to choose dimensionless\nquantities. I select,\nT = H0 τ, U =\nR0 =\n\nH0\nR0 .\nc\n\n\u0012\n\nH0\nc\n\n\u00133/2\n\nU, M =\n\nGM H0 Ȧ\nȧ\nH0\n,\n=\n, R=\nρ̂,\n3\nc\nA\nH0 a\nc\n(65)\n\nThe initial conditions are A(T 0 ) = Ȧ(T0 )/A(T 0 ) = 1, U (R, T 0 ) = R3/2 ,\nand M⊙ ≈ 0.799 × 10−23 h50 . For reference, one astronomical unit is\nabout 0.808 × 10−15 h50 in our dimensionless units and a Megaparsec is\nabout 1.67 × 10−4 h50 . Thus we may rewrite (62) as\nU̇ =\n\n\n\n3\nȦ\n3Ȧ\nU− \nU\n2A\n2\nA\n\n!2\n\n+\n\n√\n3\n\nU2\n\n2M\n+\nA3 (T ) (A(T )R0 )2\n\n1/2\n\u0011\n3\nU 4 − R2  ,\n\n\u0010√\n\n(66)\nI have integrated this equation by means of the Runge-Kutta method\n[20] adapted to double precision.\n\neffects2r.tex; 7/05/2019; 8:55; p.17\n\n\f18\n\nGeorge A. Baker, Jr.\n\nThere are several special cases for the solution of equation (66).\nFirst, when eβ is large, the solution is just eβ = ρa(τ ), both for the\ncase of \"flat\" and curved space. This solution is just what one expects\nfor the case of expanding Friedmann-Lemaı̂tre expanding space. The\nquantity eα is given by (57) and (8) which is, of course, different for\n\"flat\" and curved space. I illustrate the large eβ case, and the approach\nto it in fig. 2 for the case of flat space and a(τ ) = (τ /τ0 )2/3 . The initial\nconditions (58) insure that eβ /[ρ̂a(τ0 )] = 1 in every case. The central\nmass has been chosen to be that of the Sun.\nThe next special case is when eβ is small. In this case, in line with\nwith the Lemaı̂tre form of the Schwarzschild metric, it is appropriate\nto plot the results vs. (τ − τ0 )/ρ̂3/2 . This is because this form of the\n(static) metric can be written as\n\" r\n\u0013#2/3\n\u0012\nc(τ − τ0 )\n3 2GM\neβ\n=\n1−\nρ̂\n2\nc2\nρ̂3/2\n\n(67)\n\nI illustrate this case and the the approach to this limit in fig. 3. The\nlarge dots indicate the expected [ρ̂ − c(τ − τ0 )]2/3 limiting curve with\nvertex at τzero .\nThe divergence at τ = 0 noted in fig. 2, leads to the question of the\nnature of this divergence. It turns out that it depends on the exponent\nγ defined in the limit as τ → 0 by a(τ ) ≍ W τ γ . By considering the\ndominant terms in (66) for flat space, we obtain the results,\n\nβ\n\ne\n\nc\n≍\nH0\n\neβ ≍\n\nc\nH0\n\neβ ≍\n\nc\nH0\n\n#1/3 \u0012 \u0013\nτ 2/3\n2\n2M\n,\nγ> ,\n(68)\n1 2\n2\nτ\n3\n4(γ − 3 ) − γ\n0\n\u0012 \u0013γ \u0014\n\u00151/3\nτ\n2\n3M\n2−3γ\n2\nτ\n,\n0 < γ < ,(69)\nC4 (ρ) −\nτ0\nγ(2 − 3γ)\n3\n\"\n\u0012 \u00132 \u0012 \u0013#1/3\nτ\nτ\n2\n9\n,\nγ= .\n(70)\nln\n− M\n2\nτ0\nτ0\n3\n\"\n\nThe behavior for values of γ not illustrated is qualitatively similar,\nbut differs, of course, in detail.\nThe effects of the curvature of space on β is not very significant\neither for small values of eβ or for large values, as in these cases the\nlimiting values discussed above are obtained. The effects however are\nof some significance for intermediate values of eβ . I have illustrated an\nexample in fig. 4.\n\neffects2r.tex; 7/05/2019; 8:55; p.18\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n19\n\n6. DOMAINS OF ATTRACTION\nIn this section we will focus our attention on the slow-speed (52), flatspace[1, 2] limit of (29) for radial motion only. That is to say, C0 = 0.\nHence, using the dimensionless variables of (65), we obtain,\n\n!3 \n ȦÄ − Ȧ  R\n!2\nA2\nA\nȦ\nM\nR̈ =\n(71)\nR+ \n− 2\n\n1/2\n!\nA\nR\n2\n2M\n Ȧ\n+ 3\nA\nR\n\nwhere R = H0 eβ /c. First consider the case where the rate of expansion\nof the universe is decreasing. Then Ä < 0. If we divide (71) by (Ȧ/A)2 R\nand let x = MA2 /(R3 Ȧ2 ), then it becomes\n\u0012\n\nA\nȦ\n\n\u00132\n\n ̈\nAA\nR̈\n1\n+\n=1−x− √\n√\nR\n1 + 2x Ȧ2 1 + 2x\n\n(72)\n\nNote that the Ä term in (72) is uniformly negative over the allowed\nrange of x, (0 ≤ x ≤ ∞). Hence we may check all the cases Ä ≤ 0\nby setting it to zero. This being done, we may compute in a straight\nforward manner that for very small x, the right-hand side is just −1.5x2 .\nDifferentiation with respect to x shows that the derivative is uniformly\nnegative. Thus we conclude that if the rate of expansion of the universe\nis not increasing, then according to the metric of found in section IV,\nthere is just one domain of attraction and it is centered on the mass\nconcentration as (72) shows that if Ä ≤ 0, then R̈ < 0. The analogous\ncomputations for curved space proceed in a similar manner, but are a\nbit more complicated.\nNext let us consider the case where, as reported by Reiss et al.[3] and\nPerlmutter et al.[4], the rate of expansion of the universe is increasing.\nAs for this case, Ä > 0, it follows directly from (71) that in the limit\nas R → ∞, R̈ > 0. Since it is also the case that when R → 0, R̈ < 0,\nit follows that there exists an RD for which R̈ = 0. Therefore, we now\nhave two domains of attraction. One is 0 ≤ R < RD . In this domain,\nall test particles at rest with respect to the coordinate system appear\nto be accelerating towards the origin. The other domain is RD < R.\nIn this domain all test particles at rest with respect to the coordinate\nsystem appear to be accelerating towards infinity. One expects that\nover time, the neighborhood of the domain boundary will be swept\nclean of particles.\n\neffects2r.tex; 7/05/2019; 8:55; p.19\n\n\f20\n\nGeorge A. Baker, Jr.\n\nNote is taken that the \"Swiss cheese model\" also has 2 domains of\nattraction. This fact is independent of the sign of ä. Also the location\nof the boundary described by R increases with time.\nAt this point it is convenient to define the standard acceleration/de ̈ Ȧ2 ). Then, setting R̈ = 0, the equaceleration parameter q0 ≡ −AA/(\ntion for the domain boundary becomes, by (72),\nq0 + 1\n0=1−x− √\n1 + 2x\n\n(73)\n\nThe value of q0 is given[21] by the equation,\nq0 = 12 ΩM − ΩΛ\n\n(74)\n\nwhere, combining the results of [1, 2, 3, 4] we deduce the values ΩM =\n8πGρ0 /(3H02 ) ≈ 0.19 and ΩΛ = Λc2 /(3H02 ) ≈ 0.81. These values yield\nq0 ≈ −0.715. Note that for \"flat\" space, −1 ≤ q0 , as 0 ≤ ΩM . Some\nsimple manipulations convert (73) into a cubic equation in x.\n2x3D − 3x2D + 1 = (1 + q0 )2\n\n(75)\n\nThis equation is simply solved by standard methods. Its solutions, of\ncourse, also include those for the other sign of the square root in (73).\nEvidently, the solutions of (73) all lie in the range 0 ≤ x ≤ 1. If q0 ≥ 0,\nthere are no positive real roots of (73) and we take xD (q0 ) = 0. If\nq0 < 0, then there is one positive real solution xD (q0 ) of (73). For the\nabove mentioned case, xD (−0.715) ≈ 0.825.\nWe now have the domain-size–mass relation,\nGM a2\nrD =\nxD (q0 )ȧ2\n\u0014\n\n\u0015 13\n\n.\n\n(76)\n\nHere rD is the radius of the domain and M is the interior mass. We\nappeal to the uniqueness (in our class of models) reported at the end\nof the fourth section to allow us to treat all the mass as concentrated\nin the center of the domain. See also the result (16) in this regard.\nThe domain-size–mass relation is an important conclusion which is of\nparticular interest if the rate of expansion of the universe is accelerating,\nas has recently been reported[3, 4].\nIt is to be noted that many mass concentrations are rotating and so\nare only axisymmetric, rather than spherically symmetric. This means\nthat near the mass concentration the metric has some of the characteristics of the Kerr metric. In terms of Cartesian coordinates, the differences in the far-field between the Kerr metric and the Schwarzschild\nmetric [8] are g4i ≍ 2G(~r × I~ * ~ei )/(rc)3 , where the ~ei are unit vectors\n\neffects2r.tex; 7/05/2019; 8:55; p.20\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n21\n\nin the x, y, z directions and I~ is the angular momentum of the central\nmass concentration. In regions where this correction is relatively small\n~\ncompared to the gravitation term 2GM/(c2 r), i.e., |~r × I|/(M\ncr 2 ) ≪ 1,\nwe may safely neglect this effect. On the other hand, where the correction is significant, the precise details of this effect will require further\nstudy. In addition, our lack of a clear knowledge of the distribution of\ndark matter also creates uncertainty concerning the details the above\nobtained results.\nWe now consider a few applications of the domain-size–mass relation. If we use the solar mass, we get the radius of the domain boundary\n−2/3\nto be about 417h50 light years. However, in this case the density of\nstars is sufficiently high so as to perturb significantly this result. The\nOort cloud only extends out to about 0.8 light years. We remark that\nthe domain-size–mass relation only provides an upper limit on the size\nof a structure that a given mass can be expected to hold together. That\nthere are smaller structures can presumably be explained on the basis\nof other circumstances.\nNext consider a globular cluster. They are observed to have about\n10,000 to 1,000,000 stars and to have diameters of several 10's of\nlight years to about 200 light years. The computed domain boundary\n−2/3\n−2/3\ndiameters for systems of this size are about 9000h50\n- 42000h50\nlight years. This result is of the substantially larger than that which is\nobserved. It may be that they are reduced in size when they orbit near\nthe galactic center.\nLet us now consider our galaxy. It is estimated to contain something\nlike 200 billion stars and to have a mass of 700 billion to 1 trillion solar\n−2/3\n−2/3\nmasses. This mass implies a domain radius of 3.7h50\nto 4.2h50\nmillion light years, which way off from the observationally estimated\ndiameter of about 100 thousand light years.\nWhen we consider the Local Group and the Virgo Cluster, the\nproblem becomes more interesting. Specifically, it has been estimated\nthat the roughly 30 galaxies in the local group have a mass of about\n3 × 1012 M⊙ , not counting intergalactic dark matter. This mass corre−2/3\nsponds to about a radius of 6h50 million light years. The observed\nvalue is roughly 4 million light years. In the Virgo Cluster of around\n2000 galaxies, the mass is thought to be of the order of 1015 M⊙ . This\nmass includes a significant amount of dark matter and gives a radius\n−2/3\nof about 42h50 million light years, compared to the observation that\nthe Milky Way galaxy lies about 65 million light years from center of\nthe cluster. Considering the errors and the fact that the Virgo Cluster\nappears not to be in equilibrium yet, this agreement is not too bad.\n\neffects2r.tex; 7/05/2019; 8:55; p.21\n\n\f22\n\nGeorge A. Baker, Jr.\n\nIn conclusion, it appears that for larger scale structures composed\nof galaxies and inter-galactic space, the observed increase in the rate of\nexpansion may be an important feature in determining the size of selfbound gravitating systems. For smaller structures like galaxies, globular\nclusters etc. other mechanisms are presumably dominant.\n\nAcknowledgements\nThe author is pleased to acknowledge helpful conversations with N.\nBalazs, S. Habib, P. O. Mazur, E. Motolla, and M. M. Nieto.\n\nReferences\n1.\n\n2.\n3.\n\n4.\n\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n\nP. de Bernardis, P. A. R. Ade, J. J. Bock, J. R. Bond, J. Borrill, A. Boscaleri,\nK. Coble, B. P. Crill, G. de Gasperis, P. C. Farese, P. G. Ferreira, K. Ganga, M.\nGiacometti, E. Hivon, V. V. Hristov, A. Iacoangeli, A. H. Jaffe, A. E. Lange,\nL. Martinis, S. Masi, P. V. Mason, P. D. Mauskopf, A. Melchiorri, L. Miglio, T.\nMontroy, C. B. Netterfield, E. Pascale, F. Piacentini, D. Pogosyan, S. Prunet,\nS. Rao, G. Romeo, J. E. Ruhl, F. Scaramuzzi, D. Sforna, and V. Vittorio,\nNature, 404, 955 (27 April 2000).\nW. Hu, Nature 404, 939 (27 April 2000).\nA. G. Reiss, A. V. Filippenko, P. Challis, A. Clocchiatti, A. Diercks, P. M.\nGarnavich, R. L. Gilliland, C. J. Hogan, S. Jha, R. P. Kirshner, B. Leibundgut,\nM. M. Phillips, D. Reiss, B. P. Schmidt, R. A. Schommer, R. C. Smith, J.\nSpyromilio, C. Stubbs, N. B. Suntzeff, and J. Tonry, Astron. J. 116, 1009\n(1998). xxx.lanl.gov, astro-ph/9805201.\nS. Perlmutter, G. Aldering, G. Goldhaber, R. A. Knop, P. Nugent, P. G. Castro,\nS. Deustua, S. Fabbro, A. Goobar, D. E. Groom, I. M. Hook, A. G. Kim, M.\nY. Kim, J. C. Lee, N. J. Nunes, R. Pain, C. R. Pennypacker, R. Quimby, C.\nLidman, R. S. Ellis, M. Irwin, R. G. McMahon, P. Ruiz-Lapuente, N. Walton,\nB. Schaefer, B. J. Boyle, A. V. Filippenko, T. Matheson, A. S. Fruchter, N.\nPanagia, N. J. M. Newburg, and W. J. Couch, Astrophys. J. 517, 565 (1999).\nxxx.lanl.gov, astro-ph/9812133.\nP. J. E. Peebles, Principles of Physical Cosmology (Princeton University Press,\nPrinceton, NJ, 1993).\nG. Lemaı̂tre, Ann. de la Soc. Scient. de Bruxelles A53, 51 (1933).\nR. C. Tolman, Proc. Nat. Acad. Sci. USA 20, 169 (1934).\nH. Stephani, General Relativity (second edition), (Cambridge Univ. Press, 1990,\nNew York).\nG. Lemaı̂tre, Comp. Rend. Acad. Sci. (Paris) 196, 903 (1933).\nA. Krasiński, Inhomogeneous Cosmological Models (Cambridge Univ. Press,\n1997, Cambridge).\nG. C. McVittie, M. N. R. A. S., 93, 325 (1933).\nA. Einstein and E. G. Straus, Rev. Mod. Phys. 17, 120 (1945); erratum 18,\n148 (1946).\n\neffects2r.tex; 7/05/2019; 8:55; p.22\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n\n21.\n\n23\n\nH. Sato, in General Relativity and Gravitation, B. Bertotti, F. de Felice, and\nA. Pascolini, eds. (Reidel, 1984, Dordrecht), pg. 289.\nK. Lake and R. Pim, Astrophys. J. 298, 439 (1985).\nC. Bona and J. Stela, Phys. Rev. D 36, 2915 (1987).\nC. Liebovitz, Phys. Rev. D 4, 2949 (1971).\nJ. Q. Jacobs on the world wide web at\nhttp://www.geocities.com/Athena/Olympus/4844/astrofor.htm\nM. Panek, Astrophys. J. 388, 225 (1992).\nG. D. Birkhoff, Relativity and Modern Physics (Harvard University Press,\nCambridge, Mass., 1923)\nW. H. Press, S. A. Teukolsky, W. T. Vetterling, and B. P. Flannery, Numerical Recipes in Fortran; The Art of Scientific Computing, second edition\n(Cambridge Univ. Press, Cambridge, 1992).\nSee for example, S. M. Carroll, W. H. Press, and E. L. Turner, Annual Rev.\nAstron. Astrophys. 30, 499 (1992).\n\neffects2r.tex; 7/05/2019; 8:55; p.23\n\n\f24\n\nGeorge A. Baker, Jr.\n\n√\nFigure 1. \"Swiss cheese model\" trajectories which\nbegin at x0 = 13/3 + ǫ (the\n√\nFriedman-Lemaı̂tre case), and begin at x0 = 13/3 − ǫ (the Schwarzschild case).\nHere, ǫ > 0 may be chosen as small as one pleases. The initial part of both\ntrajectories is a parabola generated by the Friedmann-Lemaı̂tre metric. At time\nt = (13/11)3 , marked in the figure, the two trajectories separate.\n\neffects2r.tex; 7/05/2019; 8:55; p.24\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n25\n\nFigure 2. The behavior of eβ(ρ,τ ) for larger values of ρ. The solid line is the limiting\nvalue obtained for large values of ρ. It is eβ = a(τ )ρ. The other lines show how the\nlimit is approached as ρ increases.\n\neffects2r.tex; 7/05/2019; 8:55; p.25\n\n\f26\n\nGeorge A. Baker, Jr.\n\nFigure 3. The behavior of eβ(ρ,τ ) for smaller values of ρ. The solid line is the limiting\nvalue obtained for smaller values of ρ. It is eβ ∝ a(τ )ρ[1 − c(τ − τzero )/ρ3/2 ]2/3 . The\nlarge dots show this formula. The other lines show how the limit is approached as ρ\ndecreases.\n\neffects2r.tex; 7/05/2019; 8:55; p.26\n\n\fACCELERATING EXPANSION OF THE UNIVERSE\n\n27\n\nFigure 4. The variation of eβ(ρ,τ ) with the curvature of space. Displayed are the\nratios of eβ for curved space to that for \"flat\" space with the same values of ρ, τ .\nThe sold curve is for R02 = +1 and the dashed curve is for R02 = −1.\n\neffects2r.tex; 7/05/2019; 8:55; p.27\n\n\feffects2r.tex; 7/05/2019; 8:55; p.28\n\n\f"}