{"id": "http://arxiv.org/abs/astro-ph/0603352v1", "guidislink": true, "updated": "2006-03-14T15:07:43Z", "updated_parsed": [2006, 3, 14, 15, 7, 43, 1, 73, 0], "published": "2006-03-14T15:07:43Z", "published_parsed": [2006, 3, 14, 15, 7, 43, 1, 73, 0], "title": "What can we learn from long term monitoring of X-ray bursters?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0603678%2Castro-ph%2F0603293%2Castro-ph%2F0603853%2Castro-ph%2F0603685%2Castro-ph%2F0603352%2Castro-ph%2F0603591%2Castro-ph%2F0603053%2Castro-ph%2F0603772%2Castro-ph%2F0603621%2Castro-ph%2F0603238%2Castro-ph%2F0603626%2Castro-ph%2F0603457%2Castro-ph%2F0603799%2Castro-ph%2F0603695%2Castro-ph%2F0603146%2Castro-ph%2F0603107%2Castro-ph%2F0603060%2Castro-ph%2F0603453%2Castro-ph%2F0603315%2Castro-ph%2F0603026%2Castro-ph%2F0603588%2Castro-ph%2F0603227%2Castro-ph%2F0603088%2Castro-ph%2F0603655%2Castro-ph%2F0603738%2Castro-ph%2F0603573%2Castro-ph%2F0603725%2Castro-ph%2F0603198%2Castro-ph%2F0603392%2Castro-ph%2F0603351%2Castro-ph%2F0603581%2Castro-ph%2F0603825%2Castro-ph%2F0603617%2Castro-ph%2F0603360%2Castro-ph%2F0603387%2Castro-ph%2F0603186%2Castro-ph%2F0603396%2Castro-ph%2F0603607%2Castro-ph%2F0603313%2Castro-ph%2F0603705%2Castro-ph%2F0603684%2Castro-ph%2F0603194%2Castro-ph%2F0603422%2Castro-ph%2F0603509%2Castro-ph%2F0603069%2Castro-ph%2F0603312%2Castro-ph%2F0603769%2Castro-ph%2F0603552%2Castro-ph%2F0603321%2Castro-ph%2F0603291%2Castro-ph%2F0603279%2Castro-ph%2F0603102%2Castro-ph%2F0603130%2Castro-ph%2F0603845%2Castro-ph%2F0603857%2Castro-ph%2F0603346%2Castro-ph%2F0603280%2Castro-ph%2F0603830%2Castro-ph%2F0603221%2Castro-ph%2F0603389%2Castro-ph%2F0603805%2Castro-ph%2F0603627%2Castro-ph%2F0603245%2Castro-ph%2F0603648%2Castro-ph%2F0603752%2Castro-ph%2F0603480%2Castro-ph%2F0603792%2Castro-ph%2F0603479%2Castro-ph%2F0603325%2Castro-ph%2F0603019%2Castro-ph%2F0603051%2Castro-ph%2F0603086%2Castro-ph%2F0603620%2Castro-ph%2F0603157%2Castro-ph%2F0603012%2Castro-ph%2F0603463%2Castro-ph%2F0603651%2Castro-ph%2F0603044%2Castro-ph%2F0603070%2Castro-ph%2F0603433%2Castro-ph%2F0603322%2Castro-ph%2F0603273%2Castro-ph%2F0603807%2Castro-ph%2F0603144%2Castro-ph%2F0603188%2Castro-ph%2F0603055%2Castro-ph%2F0603782%2Castro-ph%2F0603256%2Castro-ph%2F0603859%2Castro-ph%2F0603349%2Castro-ph%2F0603586%2Castro-ph%2F0603222%2Castro-ph%2F0603490%2Castro-ph%2F0603216%2Castro-ph%2F0603432%2Castro-ph%2F0603229%2Castro-ph%2F0603363%2Castro-ph%2F0603121%2Castro-ph%2F0603590%2Castro-ph%2F0603100%2Castro-ph%2F0603728&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "What can we learn from long term monitoring of X-ray bursters?"}, "summary": "The last few years have seen the discovery of a number of new aspects of Type\nI X-ray bursts: the extremely energetic and long duration superbursts,\nintermediate duration bursts at low luminosities, mHz QPOs, and burst\noscillations. These discoveries promise a new understanding of nuclear burning\non accreting neutron stars, and offer a chance to use observations to probe\nneutron star properties. I discuss what we can learn from future long term\nmonitoring with MIRAX.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0603678%2Castro-ph%2F0603293%2Castro-ph%2F0603853%2Castro-ph%2F0603685%2Castro-ph%2F0603352%2Castro-ph%2F0603591%2Castro-ph%2F0603053%2Castro-ph%2F0603772%2Castro-ph%2F0603621%2Castro-ph%2F0603238%2Castro-ph%2F0603626%2Castro-ph%2F0603457%2Castro-ph%2F0603799%2Castro-ph%2F0603695%2Castro-ph%2F0603146%2Castro-ph%2F0603107%2Castro-ph%2F0603060%2Castro-ph%2F0603453%2Castro-ph%2F0603315%2Castro-ph%2F0603026%2Castro-ph%2F0603588%2Castro-ph%2F0603227%2Castro-ph%2F0603088%2Castro-ph%2F0603655%2Castro-ph%2F0603738%2Castro-ph%2F0603573%2Castro-ph%2F0603725%2Castro-ph%2F0603198%2Castro-ph%2F0603392%2Castro-ph%2F0603351%2Castro-ph%2F0603581%2Castro-ph%2F0603825%2Castro-ph%2F0603617%2Castro-ph%2F0603360%2Castro-ph%2F0603387%2Castro-ph%2F0603186%2Castro-ph%2F0603396%2Castro-ph%2F0603607%2Castro-ph%2F0603313%2Castro-ph%2F0603705%2Castro-ph%2F0603684%2Castro-ph%2F0603194%2Castro-ph%2F0603422%2Castro-ph%2F0603509%2Castro-ph%2F0603069%2Castro-ph%2F0603312%2Castro-ph%2F0603769%2Castro-ph%2F0603552%2Castro-ph%2F0603321%2Castro-ph%2F0603291%2Castro-ph%2F0603279%2Castro-ph%2F0603102%2Castro-ph%2F0603130%2Castro-ph%2F0603845%2Castro-ph%2F0603857%2Castro-ph%2F0603346%2Castro-ph%2F0603280%2Castro-ph%2F0603830%2Castro-ph%2F0603221%2Castro-ph%2F0603389%2Castro-ph%2F0603805%2Castro-ph%2F0603627%2Castro-ph%2F0603245%2Castro-ph%2F0603648%2Castro-ph%2F0603752%2Castro-ph%2F0603480%2Castro-ph%2F0603792%2Castro-ph%2F0603479%2Castro-ph%2F0603325%2Castro-ph%2F0603019%2Castro-ph%2F0603051%2Castro-ph%2F0603086%2Castro-ph%2F0603620%2Castro-ph%2F0603157%2Castro-ph%2F0603012%2Castro-ph%2F0603463%2Castro-ph%2F0603651%2Castro-ph%2F0603044%2Castro-ph%2F0603070%2Castro-ph%2F0603433%2Castro-ph%2F0603322%2Castro-ph%2F0603273%2Castro-ph%2F0603807%2Castro-ph%2F0603144%2Castro-ph%2F0603188%2Castro-ph%2F0603055%2Castro-ph%2F0603782%2Castro-ph%2F0603256%2Castro-ph%2F0603859%2Castro-ph%2F0603349%2Castro-ph%2F0603586%2Castro-ph%2F0603222%2Castro-ph%2F0603490%2Castro-ph%2F0603216%2Castro-ph%2F0603432%2Castro-ph%2F0603229%2Castro-ph%2F0603363%2Castro-ph%2F0603121%2Castro-ph%2F0603590%2Castro-ph%2F0603100%2Castro-ph%2F0603728&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The last few years have seen the discovery of a number of new aspects of Type\nI X-ray bursts: the extremely energetic and long duration superbursts,\nintermediate duration bursts at low luminosities, mHz QPOs, and burst\noscillations. These discoveries promise a new understanding of nuclear burning\non accreting neutron stars, and offer a chance to use observations to probe\nneutron star properties. I discuss what we can learn from future long term\nmonitoring with MIRAX."}, "authors": ["Andrew Cumming"], "author_detail": {"name": "Andrew Cumming"}, "author": "Andrew Cumming", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.2216603", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0603352v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0603352v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 2 figures, to be published in: \"The Transient Milky Way: a\n  perspective for MIRAX\", eds. F. D'Amico, J. Braga & R. Rothschild, AIP Conf.\n  Proc", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0603352v1", "affiliation": "McGill University", "arxiv_url": "http://arxiv.org/abs/astro-ph/0603352v1", "journal_reference": "AIPConf.Proc.840:55-59,2006", "doi": "10.1063/1.2216603", "fulltext": "What can we learn from long term monitoring of\nX-ray bursters?\n\narXiv:astro-ph/0603352v1 14 Mar 2006\n\nAndrew Cumming\nPhysics Department, McGill University, 3600 rue University, Montreal QC, H3A 2T8, Canada\nAbstract. The last few years have seen the discovery of a number of new aspects of Type I X-ray\nbursts: the extremely energetic and long duration superbursts, intermediate duration bursts at low\nluminosities, mHz QPOs, and burst oscillations. These discoveries promise a new understanding of\nnuclear burning on accreting neutron stars, and offer a chance to use observations to probe neutron\nstar properties. I discuss what we can learn from future long term monitoring with MIRAX.\n\nINTRODUCTION\nThe fate of matter accreted onto a neutron star is an old question [22, 12], but also an important one. A neutron star in a low mass X-ray binary (LMXB) likely accretes enough\nmass in its lifetime to replace the entire crust, affecting the long term spin, thermal, and\nmagnetic field evolution of the star. Also, observations of nuclear processing of accreted\nmaterial offer a chance to probe properties of the neutron star, such as interior thermal\nstructure, magnetic field, and spin. Our understanding of nuclear burning on the surfaces\nof accreting neutron stars has improved significantly in the last few years. Observations\nof X-ray bursters with BeppoSAX and the Rossi X-ray Timing Explorer (RXTE) have\nrevealed a host of new phenomena (see [27] for a review), including millisecond oscillations during Type I X-ray bursts, the long duration and energetic \"superbursts\", long\nduration X-ray bursts from faint sources, and mHz quasi-periodic oscillations in the\npersistent emission that are likely due to nuclear burning. In this article, I discuss two\naspects which will be significantly impacted by long term monitoring with MIRAX.\n\nPROBING NEUTRON STAR INTERIORS WITH SUPERBURSTS\nOne of the exciting developments in the last few years has been the discovery of\nsuperbursts. These are long duration (several hours), rare (recurrence times ∼ 1 year),\nand energetic (1042 ergs) X-ray bursts [16], believed to be due to unstable burning of\na thick layer of carbon. The basic idea is that the accreted hydrogen and helium burns\nwithin hours to days of arriving on the surface of the star, leaving behind a mixture of\nheavy elements and a small amount (∼ 10% by mass) of carbon [26, 25]. This mixture\naccumulates until the carbon starts to burn, triggering the superburst [8, 28].\nTheoretical studies of superbursts initially focused on their potential as probes of\nnuclear physics. Hydrogen and helium burning proceeds by the rp-process [30, 24], a\n\n\fFIGURE 1. Observations of superbursts that will be significantly improved by MIRAX. Left panel:\nRecurrence times compared to theoretical models (from [15]). 4U 1636-54 and GX 17+2 have shown\nmultiple superbursts, allowing a measurement of recurrence time. For the other sources, we show lower\nlimits from BeppoSAX. Right panel: Quenching of normal Type I bursts following a superburst (from\n[9]). We show the predicted quenching time for yb = 1012 (solid lines) and 1013 g cm−2 (dotted lines) as\nfunctions of the critical flux needed to stabilize H/He burning, and the accretion rate. For each value of yb ,\nthe curves are for (bottom to top) energy releases of 1, 2 and 3 × 1017 erg g−1 . The data points are taken\nfrom Table 1 of [16], with an updated value for 4U 1636-53 (Kuulkers, private communication).\n\nseries of proton captures and beta-decays involving heavy nuclei close to the proton\ndrip line. This process naturally explains the ≈ 100 s extended tails observed in some\nX-ray bursts (e.g. from the regular burster GS 1826-24 [11, 7]). The properties and\nreaction rates of the unstable proton-rich nuclei involved in the rp-process are not well\nknown experimentally [24]. Because the heavy element composition sets the thermal\nconductivity of the accumulating carbon layer, Cumming & Bildsten [8] suggested that\nthe superburst properties would directly probe the composition of the rp-process ashes.\nBrown [3] and Cooper & Narayan [4] showed that in fact the ignition conditions are\nmuch more sensitive to the thermal properties of the crust and core. This is exciting\nbecause it gives a new way to probe the neutron star interior, complementary to observations of transiently-accreting neutron stars in quiescence [23, 31, 33], or cooling\nisolated neutron stars (see [33] for a recent review). They found that to match observed\nsuperburst recurrence times required inefficient neutrino cooling in the core, and a low\nthermal conductivity in the crust.\nWe recently revisited this question in [10], with two main improvements: (1) using\nmodels of superburst lightcurves to constrain the ignition depth, and (2) including\nneutrino emission from the crust from the formation of Cooper pairs [32]. Cumming\n& Macbeth [9] modeled superburst lightcurves, finding that the luminosity decays as\na broken power law, with break time corresponding to the thermal time at the base\nof the layer. Fitting these model lightcurves to the observed superbursts constrains the\n\n\fignition depth to be ≈ 1012 g cm−2 [10]. The temperature required to ignite carbon at\nthis depth is ≈ 6 × 108 K. Without Cooper pair neutrino emission from the crust, we\nfind that achieving this temperature requires a poor crust conductivity and the inefficient\ncore neutrino emission (modified URCA or smaller), in agreement with previous work.\nHowever, surprisingly, including Cooper pair emission makes the crust too cold to\nachieve ignition at the inferred depth, even for very inefficient core neutrino emission\nand a low crust conductivity. It is not possible to match the observed superburst ignition\ndepth when Cooper pair cooling is included.\nThe resolution to this puzzle is not yet clear, but will tell us something about the\nneutron star interior. The Cooper pair neutrino emissivity may be smaller than current\ncalculations suggest, or there may be an extra heating source in the accumulating fuel\nlayer that is not included in current models. An alternative explanation is that these stars\nare not neutron stars, but rather \"strange stars\" [1]. Strange stars do not have an inner\ncrust, and so naturally do not have Cooper pair neutrino emission. An evaluation of this\nscenario [20] shows that ignition at the observed depth is possible for a wide range of\nparameters for the strange star core.\nThere are two aspects of superbursts where MIRAX will have a significant impact,\nproviding new observational constraints to help answer these questions. The first is increasing the sample of known superbursts and measuring or improving limits on recurrence times. Figure 1 summarizes the current observational constraints on superburst\nrecurrence times as a function of accretion rate (see [15]). The lower limits of ≈ 50 days\nare set by the total exposure time accumulated by BeppoSAX, and will improve by an\norder of magnitude with MIRAX, allowing much better constraints on theoretical models. The second aspect is measuring quenching times of normal Type I bursts following\na superburst. Type I bursts disappear for ≈ 1 month following a superburst, as the heat\nflux from the carbon layer stabilizes the hydrogen and helium burning [8]. Current observations are summarized in Figure 1, but are not very constraining. MIRAX will easily\nmeasure quenching timescales, providing an independent measurement of the thickness\nof the fuel layer and an additional constraint on the theoretical models [9].\n\nMHZ QPOS AND THE TRANSITION TO STABLE BURNING\nLMXBs exhibit a range of periodic and quasi-periodic phenomena, ranging in frequency\nfrom very low frequency (mHz) noise to kHz quasi-periodic oscillations (QPOs) (see\n[29] for a review). This variability has mostly been associated with orbiting material in\nthe accretion flow close to the compact object. In the case of a neutron star accretor, an\nimportant question is whether any of these phenomena originate from or are associated\nwith the neutron star surface. This is important for identifying the compact object as a\nneutron star or a black hole, as well as offering a probe of the neutron star surface layers.\nRevnivtsev et al. [21] discovered a new class of mHz QPOs in three Atoll sources,\n4U 1608-52, 4U 1636-53, and Aql X-1, which they proposed were from a special mode\nof nuclear burning on the neutron star surface rather than from the accretion flow. These\nmHz QPOs have frequencies in the range 7–9 mHz (timescales of 1.9–2.4 minutes). In\n4U 1608-52, a transient source whose luminosity is observed to change by orders of\n\n\fmagnitude, the mHz QPO was only present within a narrow range of luminosity, LX ≈\n0.5–1.5 × 1037 erg s−1 . This is significant because in many X-ray bursters a transition\nin burning behavior occurs close to this luminosity, from frequent Type I X-ray bursting\nat low accretion rates to the disappearance of Type I X-ray bursts at high accretion\nrates (e.g. [6]). This transition is expected theoretically because at high accretion rates\nthe fuel burns at a higher temperature, reducing the temperature-sensitivity of helium\nburning and quenching the thin shell instability. However, an outstanding puzzle is that\ntheory predicts a transition accretion rate close to the Eddington rate, almost an order of\nmagnitude larger than observed [2].\nPaczynski [19] pointed out that near the transition from instability to stability, oscillations are expected because the eigenvalues of the system are complex (see also [18]).\nExtending his analysis, we recently showed [13] that the mHz QPOs are indeed naturally\nexplained as being due to marginally stable nuclear burning on the neutron star surface.\nAt the boundary between unstable and stable burning, the temperature dependence of\nthe nuclear heating rate and cooling rate almost cancel. The result is an oscillatory mode\nof burning, with an oscillation period close to the geometric mean of the thermal and\naccretion timescales for the burning layer, or ≈ 100 s, matching the observed periods.\nNumerical simulations with the Kepler code confirm this simple analytic understanding.\nInterestingly, the observed oscillation period depends sensitively on the surface gravity\nand the accreted hydrogen fraction, giving a new way to probe these parameters. We are\ncurrently working to understand in detail the range of luminosities for which mHz QPOs\nare observed, and what sets the Q value of the oscillation.\nImproved understanding of mHz QPOs in particular, and the global burning behavior\nin general, from long term monitoring could tell us about the geometry of accretion\nonto the star. If the mHz QPOs are due to marginally stable nuclear burning, the local\naccretion rate onto the star must be close to the Eddington rate, even though the global\naccretion rate inferred from the X-ray luminosity is ten times lower. One possibility is\nthat the accreted material covers only part of the neutron star surface at luminosities\nLX & 1037 erg s−1 . This would also explain a number of other puzzling features of Type\nI X-ray bursts. First, it would account for the disappearance of regular bursting at this\nluminosity. If some fuel \"leaked out\" from the stably burning region, it could ignite\nand cause the occasional X-ray bursts seen at high luminosities. Stable H/He burning\nat global luminosities well below Eddington would also allow carbon production in\nlarge enough quantities to power superbursts [25]. Burst oscillations occur preferentially\nat higher luminosities [17]. It may be that incomplete spreading of fuel promotes the\ndevelopment of burning inhomogeneities. Finally, Atoll sources undergo a transition\nfrom the island to banana state of the color-color diagram close to this luminosity.\nPerhaps a change in accretion geometry affects the distribution of fuel.\n\nCONCLUSIONS\nIn summary, long term monitoring of X-ray bursters with BeppoSAX and RXTE has\nrevealed new phenomena that would be difficult to observe otherwise. I have concentrated on superbursts, which occur on long timescales, and mHz QPOs, which occur in\n\n\fa narrow luminosity range. Unfortunately, there is no space in this short article to discuss \"intermediate duration\" bursts, which are also sensitive to the neutron star interior\nproperties (e.g. [14]), low luminosity bursters (e.g. [5]), burst oscillations, or how burst\nproperties can be used to constrain the composition of the accreted material [7]. MIRAX\nwill dramatically improve our understanding of all of these phenomena, which promises\nto tell us about (1) the physics of high density matter, (2) neutron star spin and magnetic field evolution, (3) the composition of the donor star and therefore evolution of\nlow mass X-ray binaries, (4) nuclear physics at high temperatures and densities, and (5)\nthe geometry of the accretion flow onto the star.\nI would like to thank the conference organizers for their hospitality, and Duncan\nGalloway, Erik Kuulkers, and Jean in 't Zand for discussions. I acknowledge support\nfrom an NSERC Discovery Grant, Le Fonds Québécois de la Recherche sur la Nature et\nles Technologies, and the Canadian Institute for Advanced Research.\n\nREFERENCES\n1. Alcock, C., Farhi, E., & Olinto, A. 1986, ApJ, 310, 261\n2. Bildsten, L. 1998, NATO ASIC Proc. 515: The Many Faces of Neutron Stars., 419\n3. Brown, E. F. 2004, ApJ, 614, L57\n4. Cooper, R. L., & Narayan, R. 2005, ApJ, 629, 422\n5. Cornelisse, R., Verbunt, F., in't Zand, J. J. M., Kuulkers, E., & Heise, J. 2002, A& A, 392, 931\n6. Cornelisse, R., et al. 2003, A& A, 405, 1033\n7. Cumming, A. 2004, Nuclear Physics B Proceedings Supplements, 132, 435\n8. Cumming, A., & Bildsten, L. 2001, ApJ, 559, L127\n9. Cumming, A., & Macbeth, J. 2004, ApJ, 603, L37\n10. Cumming, A., Macbeth, J., in 't Zand, J. J. M., & Page, D. 2005, ApJ, submitted (astro-ph/0508432)\n11. Galloway, D. K., Cumming, A., Kuulkers, E., Bildsten, L., Chakrabarty, D., & Rothschild, R. E. 2004,\nApJ, 601, 466\n12. Hansen, C. J., & van Horn, H. M. 1975, ApJ, 195, 735\n13. Heger, A., Cumming, A., & Woosley, S. E. 2006, ApJ, submitted (astro-ph/0511292)\n14. in 't Zand, J. J. M., Cumming, A., Verbunt, F., van der Sluys, M. V., & Pols, O. R. 2005, A& A, 441,\n675\n15. Keek, L., in 't Zand, J. J. M., & Cumming, A. 2006, A& A, submitted\n16. Kuulkers, E., 2003, in \"The Restless High-Energy Universe\" (Amsterdam, May 5-8, 2003), ed. E.P.J.\nvan den Heuvel, J.J.M. in 't Zand, and R.A.M.J. Wijers (astro-ph/0310402)\n17. Muno, M. P., Fox, D. W., Morgan, E. H., & Bildsten, L. 2000, ApJ, 542, 1016\n18. Narayan, R., & Heyl, J. S. 2003, ApJ, 599, 419\n19. Paczynski, B. 1983, ApJ, 264, 282\n20. Page, D., & Cumming, A. 2005, ApJ, 635, L157\n21. Revnivtsev, M., Churazov, E., Gilfanov, M., & Sunyaev, R. 2001, A& A, 372, 138\n22. Rosenbluth, M. N., Ruderman, M., Dyson, F., Bahcall, J. N., Shaham, J., & Ostriker, J. 1973, ApJ,\n184, 907\n23. Rutledge, R. E., Bildsten, L., Brown, E. F., Pavlov, G. G., Zavlin, V. E., & Ushomirsky, G. 2002, ApJ,\n580, 413\n24. Schatz, H., et al. 1998, Phys. Rep., 294, 167\n25. Schatz, H., Bildsten, L., & Cumming, A. 2003a, ApJ, 583, L87\n26. Schatz, H., Bildsten, L., Cumming, A., & Wiescher, M. 1999, ApJ, 524, 1014\n27. Strohmayer, T. E., & Bildsten, L. 2003, in Compact Stellar X-Ray Sources, eds. W.H.G. Lewin and\nM. van der Klis (Cambridge: Cambridge University Press) (astro-ph/0301544)\n28. Strohmayer, T. E., & Brown, E. F., 2002, ApJ, 566, 1045\n\n\f29. van der Klis, M. 2004, in \"Compact Stellar X-Ray Sources\", eds. W.H.G. Lewin and M. van der Klis\n(Cambridge: Cambridge University Press) (astro-ph/0410551)\n30. Wallace, R. K. & Woosley, S. E. 1981, ApJS, 45, 389\n31. Wijnands, R., Guainazzi, M., van der Klis, M., & Méndez, M. 2002, ApJ, 573, L45\n32. Yakovlev, D. G., Kaminker, A. D., & Levenfish, K. P. 1999, A& A, 343, 650\n33. Yakovlev, D. G., & Pethick, C. J. 2004, ARA&A, 42, 169\n\n\f"}