{"id": "http://arxiv.org/abs/astro-ph/0106414v1", "guidislink": true, "updated": "2001-06-22T14:34:32Z", "updated_parsed": [2001, 6, 22, 14, 34, 32, 4, 173, 0], "published": "2001-06-22T14:34:32Z", "published_parsed": [2001, 6, 22, 14, 34, 32, 4, 173, 0], "title": "Observations of galaxies with future X-ray observatories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0106122%2Castro-ph%2F0106227%2Castro-ph%2F0106559%2Castro-ph%2F0106311%2Castro-ph%2F0106409%2Castro-ph%2F0106556%2Castro-ph%2F0106042%2Castro-ph%2F0106039%2Castro-ph%2F0106432%2Castro-ph%2F0106482%2Castro-ph%2F0106155%2Castro-ph%2F0106213%2Castro-ph%2F0106449%2Castro-ph%2F0106016%2Castro-ph%2F0106073%2Castro-ph%2F0106295%2Castro-ph%2F0106074%2Castro-ph%2F0106260%2Castro-ph%2F0106423%2Castro-ph%2F0106418%2Castro-ph%2F0106188%2Castro-ph%2F0106248%2Castro-ph%2F0106091%2Castro-ph%2F0106348%2Castro-ph%2F0106225%2Castro-ph%2F0106060%2Castro-ph%2F0106536%2Castro-ph%2F0106500%2Castro-ph%2F0106560%2Castro-ph%2F0106051%2Castro-ph%2F0106309%2Castro-ph%2F0106316%2Castro-ph%2F0106097%2Castro-ph%2F0106079%2Castro-ph%2F0106290%2Castro-ph%2F0106053%2Castro-ph%2F0106400%2Castro-ph%2F0106100%2Castro-ph%2F0106448%2Castro-ph%2F0106195%2Castro-ph%2F0106498%2Castro-ph%2F0106134%2Castro-ph%2F0106328%2Castro-ph%2F0106464%2Castro-ph%2F0106107%2Castro-ph%2F0106068%2Castro-ph%2F0106406%2Castro-ph%2F0106421%2Castro-ph%2F0106254%2Castro-ph%2F0106484%2Castro-ph%2F0106474%2Castro-ph%2F0106468%2Castro-ph%2F0106562%2Castro-ph%2F0106243%2Castro-ph%2F0106246%2Castro-ph%2F0106493%2Castro-ph%2F0106456%2Castro-ph%2F0106473%2Castro-ph%2F0106253%2Castro-ph%2F0106109%2Castro-ph%2F0106101%2Castro-ph%2F0106481%2Castro-ph%2F0106300%2Castro-ph%2F0106414%2Castro-ph%2F0106106%2Castro-ph%2F0106293%2Castro-ph%2F0106575%2Castro-ph%2F0106207%2Castro-ph%2F0106547%2Castro-ph%2F0106009%2Castro-ph%2F0106289%2Castro-ph%2F0106133%2Castro-ph%2F0106344%2Castro-ph%2F0106388%2Castro-ph%2F0106546%2Castro-ph%2F0106018%2Castro-ph%2F0106408%2Castro-ph%2F0106287%2Castro-ph%2F0106171%2Castro-ph%2F0106239%2Castro-ph%2F0106266%2Castro-ph%2F0106539%2Castro-ph%2F0106212%2Castro-ph%2F0106381%2Castro-ph%2F0106345%2Castro-ph%2F0106318%2Castro-ph%2F0106341%2Castro-ph%2F0106045%2Castro-ph%2F0106197%2Castro-ph%2F0106334%2Castro-ph%2F0106401%2Castro-ph%2F0106038%2Castro-ph%2F0106028%2Castro-ph%2F0106179%2Castro-ph%2F0106527%2Castro-ph%2F0106507%2Castro-ph%2F0106420%2Castro-ph%2F0106512%2Castro-ph%2F0106490%2Castro-ph%2F0106228%2Castro-ph%2F0106454&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observations of galaxies with future X-ray observatories"}, "summary": "Normal galaxies are faint and complex X-ray sources that provide very\npowerful probes for fundamental astrophysical questions. Examples include: the\nstudy of populations of X-ray emitting sources; the study of the entire\nspectrum of black-hole phenomena; and galaxy formation and evolution in\ninteraction with the surrounding environment. While exciting, all these fields\n{\\bf require} Chandra sub-arcsecond resolution, and at least comparable\nspectral capabilities. They also require much large collecting areas. I argue\nthat this is the direction we must plan for future X-ray observatories.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0106122%2Castro-ph%2F0106227%2Castro-ph%2F0106559%2Castro-ph%2F0106311%2Castro-ph%2F0106409%2Castro-ph%2F0106556%2Castro-ph%2F0106042%2Castro-ph%2F0106039%2Castro-ph%2F0106432%2Castro-ph%2F0106482%2Castro-ph%2F0106155%2Castro-ph%2F0106213%2Castro-ph%2F0106449%2Castro-ph%2F0106016%2Castro-ph%2F0106073%2Castro-ph%2F0106295%2Castro-ph%2F0106074%2Castro-ph%2F0106260%2Castro-ph%2F0106423%2Castro-ph%2F0106418%2Castro-ph%2F0106188%2Castro-ph%2F0106248%2Castro-ph%2F0106091%2Castro-ph%2F0106348%2Castro-ph%2F0106225%2Castro-ph%2F0106060%2Castro-ph%2F0106536%2Castro-ph%2F0106500%2Castro-ph%2F0106560%2Castro-ph%2F0106051%2Castro-ph%2F0106309%2Castro-ph%2F0106316%2Castro-ph%2F0106097%2Castro-ph%2F0106079%2Castro-ph%2F0106290%2Castro-ph%2F0106053%2Castro-ph%2F0106400%2Castro-ph%2F0106100%2Castro-ph%2F0106448%2Castro-ph%2F0106195%2Castro-ph%2F0106498%2Castro-ph%2F0106134%2Castro-ph%2F0106328%2Castro-ph%2F0106464%2Castro-ph%2F0106107%2Castro-ph%2F0106068%2Castro-ph%2F0106406%2Castro-ph%2F0106421%2Castro-ph%2F0106254%2Castro-ph%2F0106484%2Castro-ph%2F0106474%2Castro-ph%2F0106468%2Castro-ph%2F0106562%2Castro-ph%2F0106243%2Castro-ph%2F0106246%2Castro-ph%2F0106493%2Castro-ph%2F0106456%2Castro-ph%2F0106473%2Castro-ph%2F0106253%2Castro-ph%2F0106109%2Castro-ph%2F0106101%2Castro-ph%2F0106481%2Castro-ph%2F0106300%2Castro-ph%2F0106414%2Castro-ph%2F0106106%2Castro-ph%2F0106293%2Castro-ph%2F0106575%2Castro-ph%2F0106207%2Castro-ph%2F0106547%2Castro-ph%2F0106009%2Castro-ph%2F0106289%2Castro-ph%2F0106133%2Castro-ph%2F0106344%2Castro-ph%2F0106388%2Castro-ph%2F0106546%2Castro-ph%2F0106018%2Castro-ph%2F0106408%2Castro-ph%2F0106287%2Castro-ph%2F0106171%2Castro-ph%2F0106239%2Castro-ph%2F0106266%2Castro-ph%2F0106539%2Castro-ph%2F0106212%2Castro-ph%2F0106381%2Castro-ph%2F0106345%2Castro-ph%2F0106318%2Castro-ph%2F0106341%2Castro-ph%2F0106045%2Castro-ph%2F0106197%2Castro-ph%2F0106334%2Castro-ph%2F0106401%2Castro-ph%2F0106038%2Castro-ph%2F0106028%2Castro-ph%2F0106179%2Castro-ph%2F0106527%2Castro-ph%2F0106507%2Castro-ph%2F0106420%2Castro-ph%2F0106512%2Castro-ph%2F0106490%2Castro-ph%2F0106228%2Castro-ph%2F0106454&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Normal galaxies are faint and complex X-ray sources that provide very\npowerful probes for fundamental astrophysical questions. Examples include: the\nstudy of populations of X-ray emitting sources; the study of the entire\nspectrum of black-hole phenomena; and galaxy formation and evolution in\ninteraction with the surrounding environment. While exciting, all these fields\n{\\bf require} Chandra sub-arcsecond resolution, and at least comparable\nspectral capabilities. They also require much large collecting areas. I argue\nthat this is the direction we must plan for future X-ray observatories."}, "authors": ["G. Fabbiano"], "author_detail": {"name": "G. Fabbiano"}, "author": "G. Fabbiano", "arxiv_comment": "conference proceeding; New Century of X-Ray Astronomy Yokohama\n  Symposia, Yokohama, Japan 6-8 March 2001\n  http://www.astro.isas.ac.jp/conference/newcentx/", "links": [{"href": "http://arxiv.org/abs/astro-ph/0106414v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0106414v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0106414v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0106414v1", "journal_reference": null, "doi": null, "fulltext": "**TITLE**\nASP Conference Series, Vol. **VOLUME**, **PUBLICATION YEAR**\n**EDITORS**\n\nObservations of Galaxies with Future X-ray Observatories\n\narXiv:astro-ph/0106414v1 22 Jun 2001\n\nGiuseppina Fabbiano\nHarvard-Smithsonian Center for Astrophysics, 60 Garden St.,\nCambridge MA 02138 USA\nAbstract. Normal galaxies are faint and complex X-ray sources that\nprovide very powerful probes for fundamental astrophysical questions.\nExamples include: the study of populations of X-ray emitting sources;\nthe study of the entire spectrum of black-hole phenomena; and galaxy\nformation and evolution in interaction with the surrounding environment.\nWhile exciting, all these fields require Chandra sub-arcsecond resolution,\nand at least comparable spectral capabilities. They also require much\nlarge collecting areas. I argue that this is the direction we must plan for\nfuture X-ray observatories.\n\n1.\n\nIntroduction: the X-ray emission of galaxies\n\nNormal galaxies (i.e. those not dominated by an AGN) are relatively faint X-ray\nsources, in most cases fainter than the detection threshold attainable with nonimaging X-ray observatories. It is therefore not surprising that the study of their\nX-ray properties became possible only in the late 1970s-early 1980s, after the\nlaunch of the Einstein Observatory, the first imaging X-ray telescope (Giacconi\net al 1979).\nStrange as it seems now, at the time there was a fairly widespread misconception that galaxies would be 'boring' targets of X-ray observations, giving\nus information only on the collective emission of Milky-Way-like populations of\naccreting binaries and SNRs. Fortunately, the data soon proved this wrong.\nWe now know that X-ray sources in all types of galaxies include not only\nXRB and SNR (and these are very interesting on their own right as probes into\nextreme forms of matter), but also a diffuse hot gaseous interstellar medium, either gravitationally bound as in X-ray luminous E galaxies, or in partial outflow\nor winds, as for example in the starburst galaxy M82. Moreover, observations\nof galaxies are essential for studying the whole gamut of nuclear emission, extending from QSOs to low-luminosity nuclei. This includes starburst nuclear\nregions, LINERS and low-luminosity AGN (see reviews, Fabbiano 1989, 1996).\nWith X-ray observations we can probe the physics of these components and\ntheir astrophysical implications for galaxy formation and evolution as well as\ncosmology.\nAll this knowledge was the result of the Einstein observations, followed\nby the higher angular resolution (but softer energy band) ROSAT, and by the\nwide-energy-band (but larger-beam) satellites ASCA and BeppoSAX.\n1\n\n\f2\n\nGiuseppina Fabbiano\n\nNow, with Chandra and XMM-Newton, this field is being pushed to new\nheights. In what follows, I will summarize the principal scientific themes for\nwhich X-ray studies of galaxies are relevant, and I will then point out the implied\nrequirements for future X-ray observatories. Previous papers discussing this type\nof requirements, which are still valid, are Fabbiano (1990) and Elvis & Fabbiano\n(1997).\n2.\n\nScience Themes\n\nGalaxies can be considered test particles tracing the large-scale distribution\nof matter in the Universe, but they are also complex 'living' organisms. They\nform, they age, they interact and merge, they rejuvenate, they interact with and\nmodify their environment. X-ray observations can provide precious and unique\ninsight into this life-cycle, and into the life-cycle of the galaxian components.\n2.1.\n\nPopulations of X-ray sources: formation and evolution\n\nIt is well known that strong X-ray emission may arise from stars in the final\nstages of their evolution, either from Supernova Remnants (SNR) or from binary systems (XRB) including a white dwarf, a neutron star, or a black hole.\nGalactic XRBs and SNRs were among the first types of X-ray source discovered\nin X-rays and have been studied intensely since the UHURU days (see Giacconi\n& Gursky 1974). The study of Galactic X-ray sources has provided a wealth of\ninformation on these systems and a good understanding of the nature of individual objects, but questions about their population properties, relations to their\ngalaxian environment and stellar populations, and evolution can be answered\nonly by observing a wide range of external galaxies.\nWhile this type of work had been attempted with Einstein and ROSAT\nfor M31 and a few other nearby galaxies (see Fabbiano 1995), it is only with\nChandra that this field is starting to blossom. The reason is simple: angular\nresolution. Chandra's sub-arcsecond resolution corresponds to physical sizes\nof ∼ 70 pc at a distance of ∼ 30 Mpc (and ∼ 35 pc at the Virgo Cluster).\nGiven the relative sparse distribution of luminous X-ray sources, in most cases\nthis resolution allows the detection of individual bright X-ray sources at least\nout to these distances. Moreover, because of the very small Chandra beam,\nonly a few photons are needed for a significant detection. As a result, X-ray\nluminosity functions (XLF) of galaxian sources have recently been derived with\nunprecedented sensitivity from Chandra observations. Early results include the\nXLF of NGC 4697 (Sarazin, Irwin & Bregman 2000) an X-ray-faint elliptical\ngalaxy at a distance of 16 Mpc, where for the first time the XRB population\nwas directly detected. In this XLF, a break near 3 × 1038 ergs/s was reported\nand interpreted as the signature of a population of black-hole binaries. In M81,\nat a distance of 3.5 Mpc, the XLF can be followed down to luminosities of\n∼ 3 × 1037 ergs/s, and different distributions are found for bulge and disk sources\n(Tennant et al 2001). The XLFs of the starburst galaxy M82 and of the merging\ngalaxies NGC 4038/9 (Zezas et al 2001) show significant extensions to very\nhigh luminosities, well above those seen in Milky Way sources, suggesting the\npresence of a short-lived population of very luminous XRBs, possibly associated\nwith black holes of masses surpassing those of Galactic black-hole binaries.\n\n\fX-ray Observations of Galaxies\n\n3\n\nThese results are exciting, because they provide a very poweful new tool\nfor studying the population of X-ray sources and from this inferring constraints\neither on their formation history as it relates to intense star formation episodes\nin the mother galaxy (e.g. Wu 2001), or on the nature of some of these sources.\nHowever, we must remember that Chandra is a small telescope, so that\nprohibitive observing times will be needed to obtain XLFs from a large enough\nsample of galaxies, extending down to luminosities well in the range of normal\nXRBs. Moreover, while 10 photons make a very significant source, they cannot\ngive us any useful information on the spectral signature of the emission. The\nlatter is needed to identify different types of X-ray sources, and in particular to\nseparate SNRs from XRBs. XMM, with its larger collecting area, will allow a\nsystematic spectral study of the populations of X-ray sources in the very nearby\nuniverse, but source confusion (comparable or worse than that of the ROSAT\nHRI) will be the limiting factor for distances larger than a few megaparsecs.\nIf we want to continue populations studies in the future, and extend them to\na large number of galaxies and to the spectral dimension, we need to consider an\nX-ray telescope that retains Chandra's imaging and spectral capabilities, while\nproviding a significantly larger collecting area.\n2.2.\n\nSmall to Humongous Black Holes\n\nStudying Black Holes and the range of phenomena associated with the interaction of matter with Black Holes is certainly an exciting field, and a field to which\nX-ray observations can give unique contributions. It is generally believed that\nluminous AGN are the result of accretion onto massive (∼ 107−8 M⊙ ) nuclear\nblack holes, and dynamical evidence now points to the widespread association of\nsuch black holes with galaxian bulges (Magorrian et al 1998). At the other end\nof the spectrum of black hole masses, black holes of a few solar masses have been\nidentified as the compact source in some Galactic XRBs (see Tanaka & Lewin\n1995). These two categories of black holes may have different origins (albeit\nalways involving gravitational collapse): the massive nuclear black holes may\neither be primordial, or be the result of accretion onto a nuclear seed black hole\nduring the life time of the host galaxy; the few-solar-mass black holes in XRBs\nare the likely product of the evolution and final collapse of a star too massive to\nend up as a neutron star.\nBut is this the entire spectrum of black hole masses? Are there any intermediate mass black holes (in the ∼ 100 M⊙ range)? This type of object had\nbeen hypothesized as the accretor in exceptionally luminous sources first discovered in external galaxies with Einstein, and named 'Super-Eddington sources',\nbecause their X-ray luminosity was well in excess of that of accretion onto a solarmass neutron star (see Fabbiano 1995). ASCA monitoring revealed spectral and\nspectral/temporal characteristics reminiscent of black hole Galactic XRBs (e.g.\nMakishima et al 2000; Kubota et al 2001) in a few of these sources, but for\nmost of them, even with Einstein's and ROSAT's 5\" resolution, it could not\nbe excluded that the emission arose from extended regions or clumps of more\nnormal sources.\nWith Chandra, the census of 'Super-Eddington sources' is increasing dramatically. These sources have been separated out and detected in large numbers\nin previously confused bright emission regions associated with intense star for-\n\n\f4\n\nGiuseppina Fabbiano\n\nmation activity (e.g. in M82, Matsumoto et al 2001, Kaaret et al 2001; the Antennae galaxies, Fabbiano, Zezas & Murray 2001; NGC 253, Weaver, Strickland\n& Heckman 2001), and what previously appeared as an interesting but relatively\nrare occurrence is now a widespread phenomenon. Moreover, the luminosities of\nsome of these sources would imply black holes in the ≥ 100 M⊙ range if spherical accretion applies. Are these sources really this massive? And if so, how did\nthey form? A single stellar progenitor may require an unrealistically high mass.\nCould these objects result from direct collapse of massive molecular clouds, or\nfrom accretion onto seed black holes in compact star clusters? Or perhaps these\nsources are not that massive after all and beaming in a fraction of 'normal'\nXRBs could explain their very high luminosities (King et al 2001). Clearly this\nis an exciting field, that requires follow-up and in-depth study, both from the\npoint of view of deriving 'deep' XLFs of galaxies to model different X-ray source\npopulations, and for constraining spectral and time variability signatures.\nOther examples, also related to the physics of accretion on black holes,\nwhich are now opening up with Chandra, include: (1) the search for the X-rayfaint conterparts of quiescent nuclear massive black holes (e.g. Di Matteo, Carilli\n& Fabian 2001); (2) the study of circumnuclear regions, and of the interplay\nbetween starburst and AGN phenomena (Ogle et al 2000).\nThese are all examples of requirements for a large area telescope, that otherwise preserves Chandra's angular resolution. High angular resolution and sensitivity are needed to detect faint sources in crowded regions; collecting power\nis needed so that spectral and timing data can be obtained and used for constraining emission models.\n2.3.\n\nGalaxy Formation and Evolution\n\nX-ray observations give us a unique way to explore phenomena occurring during\ngalaxy formation, that are important for the evolution of both galaxies and their\nsurrounding medium.\nBesides the populations of luminous X-ray sources discussed in the previous sections, star formation activity in nearby galaxies produces a hot ISM,\nthat in most extreme cases escapes from the parent galaxy with galactic-scale\nsuperwinds (e.g Fabbiano 1988; Lehnert & Heckman 1996). It is not difficult\nto imagine that if these winds occur in relatively minor local examples of this\nphenomenon, they must have been much more powerful and widespread at the\nepoch of the collapse of the primordial pre-galaxian cloud and the ensuing violent formation of early generations of stars. Vestigial evidence of these winds\nexists in the presence of metals in the intracluster medium, that was revealed by\nX-ray spectroscopy (e.g. Fukazawa et al 2000). Superwinds are also now being\ndetected with the Keck telescope in the optical spectra of high redshift galaxies\n(Shapley et al 2000). In addition to star formation, nuclear activity may also\ntrigger superwinds in elliptical galaxies (Ciotti & Ostriker 2001), and galaxy\ninteraction and merging may also be a factor (D'Ercole, Recchi & Ciotti 2000).\nThanks to the results of X-ray observations, the old concept of 'closedbox' models for galaxy evolution, where the evolution could be traced only in\nterms of stellar evolution in a defined volume of space, is not longer viable.\nMore complex 'feedback' models and hydrodynamical simulations connecting\ngalaxy and cluster (ambient) evolution are being developed (Cavaliere, Giacconi\n\n\fX-ray Observations of Galaxies\n\n5\n\n& Menci 2000). Since the hot superwinds are the main vector by which energy\n- and metals - are transferred from galaxies to the surrounding medium, direct\nX-ray observations provide unique constraints to these models. In particular,\ndetailed spatial/spectral X-ray observations of relatively nearby galaxies can be\nused as a way to calibrate these simulations. By themselves and in comparison\nwith similarly resolved multiwavelength data, X-ray observations are needed for\nunderstanding the detailed and complex astrophysical phenomena affecting all\nthe phases of the ISM, and its interaction with stellar evolution and magnetic\nfields (e.g. McKee & Ostriker 1977; Cox & Anderson 1982).\nA detailed study requires spatial and energy resolution, and collecting power,\nsuch that individual features (clouds, superbubbles) of the hot ISM can be\nmapped both spatially and spectrally. Given that Chandra images of nearby\nsystems reveal typical scales of hundreds of pc for some of these features (Fabbiano, Zezas & Murray 2001), a lesser angular resolution would not allow this\ntype of comparisons. As already remarked, however, the number of photons required for a spatial/spectral mapping is above what a reasonably long Chandra\nobservation can provide in most cases, requiring a significantly larger collecting\narea.\n\n3.\n\nThe Future: building upon Chandra\n\nIn science we should always strive to go forward and to explore new aspects\nof the observable universe. Because of their sub-arcsecond angular resolution,\njoined with spectral resolution, Chandra observations are resulting in an impressive leap forward in our understanding of the X-ray properties of galaxies\nand their components. Moreover, this angular resolution makes possible a direct comparison with optical-UV Hubble data and high resolution radio data,\nopening up a truly panchromatic understanding of the processes and of the nature of the X-ray sources. Future comparison with SIRTF results will expand\nthis to the IR as well. With Chandra there is definitely the feeling that X-ray\nastronomy has fully come of age as a way to explore the astrophysical properties\nof the universe, rather than being an exploratory discipline for a small congress\nof devotees.\nHow can we improve on this? We must preserve sub-arcsecond angular\nresolution, while retaining or improving the spectral resolution and substantially\nimproving the telescope collecting area.\nThis work was partially supported under NASA contract NAS8-39073 (CXC).\nReferences\nCavaliere, A.; Giacconi, R.; Menci, N. 2000, ApJ(Letters), 528, L77\nCiotti, L. & Ostriker, J. P. 2001, ApJ, 551, 131\nCox, D. P. & Anderson, P. R. 1982, ApJ, 253, 268\nMcKee, C. F. & Ostriker, J. P. 1977, ApJ, 218, 148\nD'Ercole, A., Recchi, S. & Ciotti, L. 2000, ApJ, 533, 799\nDi Matteo, T., Carilli, C. L. & Fabian, A. C. 2001, 547, 731\n\n\f6\n\nGiuseppina Fabbiano\n\nElvis M., & Fabbiano G., 1997, in 'Next Generation X-ray Observatories' eds.\nM.J.L. Turner and M.G. Watson [Leicester University X-ray Astronomy\nGroup Special Report, XRA97/02], p. 33. astro-ph/9711178\nFabbiano, G. 1988, ApJ, 330, 672\nFabbiano, G. 1989, Ann. Rev. Ast. Ap., 27, 87\nFabbiano, G. 1990, in 'High Energy Astrophysics in the 21st Century', ed. P.\nC. Joss, p. 74 (New York: AIP)\nFabbiano, G. 1995, in 'X-Ray Binaries', W. H. G. Lewin, J. van Paradijs, E.\nP. J. van den Heuvel, eds., Cambridge Astrophysics Series (Cambridge:\nUniversity Press), p. 390\nFabbiano, G. 1996, in 'The Physics of LINERS in View of Recent Observations',\nM. Eracleous, A. Koratkar, C. Leitherer and L. Ho, eds., ASP Conf. Ser.\n103, 56\nFabbiano, G., Zezas, A., & Murray, S. S. 2001, ApJ, in press\nFukazawa, Y., Makishima, K., Tamura, T., Nakazawa, K., Ezawa, H., Ikebe, Y.,\nKikuchi, K. & Ohashi, T. 2000, MNRAS, 313, 21\nGiacconi, R. et al 1979, ApJ 230, 540\nGiacconi, R. & Gursky, H. (editors), 'X-ray Astronomy', 1974 (Dordrecht: Reidel)\nKaaret, P., Prestwich, A. H., Zezas, A., Murray, S. S., Kim, D.-W., Kilgard, R.\nE., Schlegel, E. M., Ward, M. 2001, MNRAS, 321, L29\nKing, A. R., Davies, M. B., Ward, M. J., Fabbiano, G. & Elvis, M 2001,\nApJ(Letters), 552, L109\nKubota, A., Mizuno, T., Makishima, K., Fukazawa, Y., Kotoku, J., Ohnishi, T.,\nTashiro, M. 2001, ApJ(Letters), 547, L119\nLehnert, M. D. & Heckman, T. M. 1996, ApJ(Letters), 462, 651\nMagorrian, J. et al 1997, AJ 115, 2285\nMakishima, K. et al 2000, ApJ, 535, 632\nMatsumoto, H., Tsuru, T. G., Koyama, K., Awaki, H., Canizares, C. R., Kawai,\nN., Matsushita, S., Kawabe, R. 2001, ApJ(Letters), 547, L25\nOgle, P. M., Marshall, H. L., Lee, J. C., & Canizares, C. R. 2000, ApJ(Letters),\n545, L81\nSarazin, C. L., Irwin, J. A., & Bregman, J. N. 2000, ApJ(Letters) 544, L101\nShapley, A. E., Steidel, C. C., Adelberger, K. L., Pettini, M., Dickinson, M. E.\n& Giavalisco, M. 2000, AAS Abstract, 197, 7714\nTanaka, Y. & Lewin, W. H. G. 1995, in in 'X-Ray Binaries', W. H. G. Lewin,\nJ. van Paradijs, E. P. J. van den Heuvel, eds., Cambridge Astrophysics\nSeries (Cambridge: University Press), p. 126\nTennant, A. F., Wu, K., Ghosh, K. K., Kolodziejczak, J. J., Swartz, D. A. 2001,\nApJ(Letters), 549, L43\nWeaver, K. A., Strickland, D. K. & Heckman, T. M. 2001, AAS Abstract, 198,\n906\nWu, K. 2001, astro-ph/0103157\nZezas, A., Fabbiano, G., Rots, A., & Murray, S. S. 2001, in preparation\n\n\f"}