{"id": "http://arxiv.org/abs/astro-ph/0412103v1", "guidislink": true, "updated": "2004-12-03T23:52:28Z", "updated_parsed": [2004, 12, 3, 23, 52, 28, 4, 338, 0], "published": "2004-12-03T23:52:28Z", "published_parsed": [2004, 12, 3, 23, 52, 28, 4, 338, 0], "title": "Direct and Indirect Searches for Dark Matter in the Form of Weakly\n  Interacting Massive Particles (WIMPs)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0412177%2Castro-ph%2F0412005%2Castro-ph%2F0412393%2Castro-ph%2F0412103%2Castro-ph%2F0412376%2Castro-ph%2F0412064%2Castro-ph%2F0412620%2Castro-ph%2F0412252%2Castro-ph%2F0412577%2Castro-ph%2F0412080%2Castro-ph%2F0412046%2Castro-ph%2F0412278%2Castro-ph%2F0412186%2Castro-ph%2F0412397%2Castro-ph%2F0412347%2Castro-ph%2F0412266%2Castro-ph%2F0412145%2Castro-ph%2F0412166%2Castro-ph%2F0412309%2Castro-ph%2F0412356%2Castro-ph%2F0412617%2Castro-ph%2F0412301%2Castro-ph%2F0412019%2Castro-ph%2F0412523%2Castro-ph%2F0412041%2Castro-ph%2F0412532%2Castro-ph%2F0412076%2Castro-ph%2F0412374%2Castro-ph%2F0412557%2Castro-ph%2F0412672%2Castro-ph%2F0412478%2Castro-ph%2F0412084%2Castro-ph%2F0412078%2Castro-ph%2F0412126%2Castro-ph%2F0412142%2Castro-ph%2F0412685%2Castro-ph%2F0412033%2Castro-ph%2F0412441%2Castro-ph%2F0412574%2Castro-ph%2F0412228%2Castro-ph%2F0412472%2Castro-ph%2F0412661%2Castro-ph%2F0412480%2Castro-ph%2F0412656%2Castro-ph%2F0412295%2Castro-ph%2F0412003%2Castro-ph%2F0412643%2Castro-ph%2F0412649%2Castro-ph%2F0412154%2Castro-ph%2F0412634%2Castro-ph%2F0412705%2Castro-ph%2F0412180%2Castro-ph%2F0412181%2Castro-ph%2F0412188%2Castro-ph%2F0412053%2Castro-ph%2F0412507%2Castro-ph%2F0412510%2Castro-ph%2F0412378%2Castro-ph%2F0412360%2Castro-ph%2F0412641%2Castro-ph%2F0412654%2Castro-ph%2F0412664%2Castro-ph%2F0412165%2Castro-ph%2F0412638%2Castro-ph%2F0412251%2Castro-ph%2F0412193%2Castro-ph%2F0412069%2Castro-ph%2F0412692%2Castro-ph%2F0412357%2Castro-ph%2F0412691%2Castro-ph%2F0412603%2Castro-ph%2F0412187%2Castro-ph%2F0412277%2Castro-ph%2F0412303%2Castro-ph%2F0412039%2Castro-ph%2F0412659%2Castro-ph%2F0412257%2Castro-ph%2F0412514%2Castro-ph%2F0412338%2Castro-ph%2F0412065%2Castro-ph%2F0412032%2Castro-ph%2F0412404%2Castro-ph%2F0412241%2Castro-ph%2F0412640%2Castro-ph%2F0412202%2Castro-ph%2F0412420%2Castro-ph%2F0412615%2Castro-ph%2F0412534%2Castro-ph%2F0412157%2Castro-ph%2F0412626%2Castro-ph%2F0412050%2Castro-ph%2F0412302%2Castro-ph%2F0412610%2Castro-ph%2F0412341%2Castro-ph%2F0412390%2Castro-ph%2F0412140%2Castro-ph%2F0412694%2Castro-ph%2F0412014%2Castro-ph%2F0412363%2Castro-ph%2F0412183%2Castro-ph%2F0412700&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Direct and Indirect Searches for Dark Matter in the Form of Weakly\n  Interacting Massive Particles (WIMPs)"}, "summary": "Numerous lines of evidence indicate that the matter content of the Universe\nis dominated by some unseen component. Determining the nature of this Dark\nMatter is one of the most important problems in cosmology. Weakly Interacting\nMassive Particles (WIMPs) are widely considered to be one of the best\ncandidates which may comprise the Dark Matter. A brief overview of the\ndifferent methods being used to search for WIMP Dark Matter is given, focusing\non the technologies of several benchmark experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0412177%2Castro-ph%2F0412005%2Castro-ph%2F0412393%2Castro-ph%2F0412103%2Castro-ph%2F0412376%2Castro-ph%2F0412064%2Castro-ph%2F0412620%2Castro-ph%2F0412252%2Castro-ph%2F0412577%2Castro-ph%2F0412080%2Castro-ph%2F0412046%2Castro-ph%2F0412278%2Castro-ph%2F0412186%2Castro-ph%2F0412397%2Castro-ph%2F0412347%2Castro-ph%2F0412266%2Castro-ph%2F0412145%2Castro-ph%2F0412166%2Castro-ph%2F0412309%2Castro-ph%2F0412356%2Castro-ph%2F0412617%2Castro-ph%2F0412301%2Castro-ph%2F0412019%2Castro-ph%2F0412523%2Castro-ph%2F0412041%2Castro-ph%2F0412532%2Castro-ph%2F0412076%2Castro-ph%2F0412374%2Castro-ph%2F0412557%2Castro-ph%2F0412672%2Castro-ph%2F0412478%2Castro-ph%2F0412084%2Castro-ph%2F0412078%2Castro-ph%2F0412126%2Castro-ph%2F0412142%2Castro-ph%2F0412685%2Castro-ph%2F0412033%2Castro-ph%2F0412441%2Castro-ph%2F0412574%2Castro-ph%2F0412228%2Castro-ph%2F0412472%2Castro-ph%2F0412661%2Castro-ph%2F0412480%2Castro-ph%2F0412656%2Castro-ph%2F0412295%2Castro-ph%2F0412003%2Castro-ph%2F0412643%2Castro-ph%2F0412649%2Castro-ph%2F0412154%2Castro-ph%2F0412634%2Castro-ph%2F0412705%2Castro-ph%2F0412180%2Castro-ph%2F0412181%2Castro-ph%2F0412188%2Castro-ph%2F0412053%2Castro-ph%2F0412507%2Castro-ph%2F0412510%2Castro-ph%2F0412378%2Castro-ph%2F0412360%2Castro-ph%2F0412641%2Castro-ph%2F0412654%2Castro-ph%2F0412664%2Castro-ph%2F0412165%2Castro-ph%2F0412638%2Castro-ph%2F0412251%2Castro-ph%2F0412193%2Castro-ph%2F0412069%2Castro-ph%2F0412692%2Castro-ph%2F0412357%2Castro-ph%2F0412691%2Castro-ph%2F0412603%2Castro-ph%2F0412187%2Castro-ph%2F0412277%2Castro-ph%2F0412303%2Castro-ph%2F0412039%2Castro-ph%2F0412659%2Castro-ph%2F0412257%2Castro-ph%2F0412514%2Castro-ph%2F0412338%2Castro-ph%2F0412065%2Castro-ph%2F0412032%2Castro-ph%2F0412404%2Castro-ph%2F0412241%2Castro-ph%2F0412640%2Castro-ph%2F0412202%2Castro-ph%2F0412420%2Castro-ph%2F0412615%2Castro-ph%2F0412534%2Castro-ph%2F0412157%2Castro-ph%2F0412626%2Castro-ph%2F0412050%2Castro-ph%2F0412302%2Castro-ph%2F0412610%2Castro-ph%2F0412341%2Castro-ph%2F0412390%2Castro-ph%2F0412140%2Castro-ph%2F0412694%2Castro-ph%2F0412014%2Castro-ph%2F0412363%2Castro-ph%2F0412183%2Castro-ph%2F0412700&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Numerous lines of evidence indicate that the matter content of the Universe\nis dominated by some unseen component. Determining the nature of this Dark\nMatter is one of the most important problems in cosmology. Weakly Interacting\nMassive Particles (WIMPs) are widely considered to be one of the best\ncandidates which may comprise the Dark Matter. A brief overview of the\ndifferent methods being used to search for WIMP Dark Matter is given, focusing\non the technologies of several benchmark experiments."}, "authors": ["Nader Mirabolfathi"], "author_detail": {"name": "Nader Mirabolfathi"}, "author": "Nader Mirabolfathi", "arxiv_comment": "Invited talk at the XXIV Physics in Collisions Conference (PIC04),\n  Boston, USA, June 2004, 18 pages, LaTeX, 7 eps figures. PSN TUET09", "links": [{"href": "http://arxiv.org/abs/astro-ph/0412103v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0412103v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0412103v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0412103v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:astro-ph/0412103v1 3 Dec 2004\n\nXXIV Physics in Collision - Boston, June 27-29, 2004\n\nDirect and Indirect Searches for Dark Matter in the Form of Weakly\nInteracting Massive Particles (WIMPs)\nNader Mirabolfathi\nUniversity of California, Berkeley\n\nABSTRACT\nNumerous lines of evidence indicate that the matter content of the Universe is\ndominated by some unseen component. Determining the nature of this Dark Matter\nis one of the most important problems in cosmology. Weakly Interacting Massive\nParticles (WIMPs) are widely considered to be one of the best candidates which\nmay comprise the Dark Matter. A brief overview of the different methods being\nused to search for WIMP Dark Matter is given, focusing on the technologies of\nseveral benchmark experiments.\n\n1\n\n\f1\n\nIntroduction\n\nThe nature of dark matter is one of the oldest and most important open questions\nin cosmology, dating back to the first observations of anomalous high kinetic energies in distant galaxy clusters made by Swiss cosmologist Fritz Zwicky in 1933 [1].\nSince then, exciting developments in observations of the cosmic microwave background (CMB), large-scale structure (LSS), and type Ia supernovae have allowed\nmore accurate measurement of the various parameters of the \"standard model of\ncosmology\". In particular, the Universe appears to be dominated (∼ 70%) by the\nvacuum energy density, or Dark Energy, while the remainder (∼ 30%) is made up\nof matter. Furthermore, most of the matter of the Universe appears to be nonluminous (i.e. dark) and non-baryonic. The nature of the Dark Matter is still\nunknown, and remains the subject of intense research activity. Weakly Interacting Massive Particles (WIMPs), a generic name for heavy particles interacting at\nthe weak scale with baryonic matter, are among the best candidates which may\ncomprise the Dark Matter. If such particles are produced thermally in the early\nuniverse, their weak-scale couplings explains why their relic density is of the order\nof critical density today. Independently, supersymmetry theories predict a stable\ns-particle state whose properties are very similar to the hypothetical WIMPs.\nThis paper is a brief review and update of different experiments aiming to\ndetect Dark Matter in the form of WIMPs. The experiments described in this paper\nare not meant to be a complete list, but are selected to represent broader classes of\nthe similar experiments.\n2\n\nDirect WIMP Searches\n\nWIMPs can be detected either via (very rare) elastic scattering off the nucleus of\nordinary matter (\"direct detection\") or by measuring their annihilation products\n(\"indirect detection\"). The latter method is the subject of the section 3. In this section, the expected spectrum and rate of interaction of WIMPs with ordinary matter\nare estimated. After the experimental challenges for directly detecting WIMPs have\nbeen introduced, a brief review of the status and results from few important direct\ndetection experiments will be presented.\nWIMPs are expected to interact with the nucleons in ordinary matter\n[2]. The WIMP-nucleon elastic-scattering cross-section σWIMP−p is SUSY model\ndependent [3]. One of the goals of all WIMP direct detection experiments is to\ndetermine or to limit σWIMP−p , and thus constrain the free parameter space available\n2\n\n\ffor SUSY models. If the WIMPs are bound to the galaxy by the gravitational force,\nwe can assume that their distribution should follow (Boltzman):\n−\n\nf (~r, ~v, ~vE ) = e\n\nMW (~\nvE +~\nv )2 +MW Φ(~\nr)\nkB T\n\n(1)\n\nwhere MW and T are the WIMP mass and the equivalent temperature\n(kT = 1/2MW v02 ), Φ(~r) is the local gravitational potential, v is WIMP velocity with\nrespect to the earth, and vE is the velocity of the Earth with respect to the center\nof the galaxy (sum of the Sun's velocity with respect to the center of the galaxy and\nthe Earth's velocity with respect to the Sun):\nvE = 232 + 15 cos 2π\n\nt − 152.5days\n[km/s]\n365.25days\n\n(2)\n\nSince the sinusoidal behavior comes from the Earth's motion around the\nsun, we expect its amplitude to be determined by the relationship between the Sun's\nvelocity vector and the plane of the Earth's orbit. Thus we should expect an annual\nmodulation of the WIMP flux of ∼ ±6%. The event rate is the product of the\nnumber of target nuclei (mN0 /A), the incoming flux of WIMPs, v * n (n determined\nby the eq. 1 from cosmology), and σWIMP−p (predicted from the SUSY model in\nplay). One could integrate over the WIMP velocity distribution and obtain the\noverall interaction rate. However, we are more interested in deriving the differential\nrecoil energy spectrum. We will see that such a spectrum will directly give σWIMP−p\nand the mass of the WIMPs. The recoil energy of a nucleus of mass MT , which is\nhit by a WIMP of energy E, and which is recoiling at an angle θ, is given by:\nER = E\n\n4MW MT (1 − cos θ)\n(MW + MT )2\n2\n\n(3)\n\nAssuming a hard sphere scattering model (uniform ER distribution) we\ncan calculate the differential rate as:\n2\nR0 2π 3/2 v0 Z vesc (v+vv2E )\n∂R\n=\nve 0 dv\n∂ER\nrE0 K\nvmin\n\nr=\n\n4MW MT\n(MW + MT )2\n\n(4)\n(5)\n\nwhere R0 ∼ n0 v0 σWIMP−p , E0 = kB T , K is a normalization factor, vmin\nis the minimum WIMPs velocity necessary to produce a recoil of ER and vesc is\nthe galactic escape velocity. At the limit conditions (ve = 0 and vesc = ∞), eq. 4\nbecomes:\n3\n\n\fER\n∂R\nR0 − rE\n=\ne 0\n(6)\n∂ER\nrE0\nThis form, although incorrect, illustrates the typical exponential behavior\nof the recoil energy spectrum. In particular, it shows that by observing the amplitude\nand the shape of the recoil energy spectrum, it is possible to constrain two physically\nimportant parameters: MW and σWIMP−p .\nSo far, the discussion has been limited to zero-momentum transfer. When\nthe momentum transfer q = (2MT ER )1/2 is large enough so that the wavelength\nh/q is comparable to the size of the nucleus, coherence is lost and the cross section\nbegins to decrease. This can usually be described by including a multiplicative form\nfactor which depends on the type of WIMP-nucleon interaction (spin-dependent or\nspin-independent) as well as the nuclear structure: σ(q2) = σ0 F 2 (q 2 ). Figure 1\n(left) shows the nuclear form factors calculated for various materials used in WIMP\nsearch experiments. Since different experiments use different target nuclei, it is\npreferable to report the recoil energy spectrum referred to nucleons (e.g. proton)\nrather than the nucleus, to allow easy comparison between experiments. If the\nWIMP-nucleon interaction is spin-independent, the contribution of various nucleons\nwill be added coherently. Two corrections are important: The cross-section scales\nas μT = MT MW /(MT + MW ) and the WIMP-nucleus coupling scales as A2 . Hence,\n\nσWIMP−Nucleus = σWIMP−p\n\nμ2Nucleus 2\nA\nμ2p\n\n(7)\n\nIf the WIMP-nucleon cross-section is spin-dependent, WIMP-nucleon amplitudes still add coherently but the contributions of spin-paired nucleons will cancel\neach other. It is clear that the A2 factor usually makes the spin-independent interaction dominant over the spin-dependent. We can now summarize these descriptions\nin a single equation:\n∂R(ve , vesc )\n∂ER\n\n(T,q 2 )\n\n=\n\n∂R(ve , vesc)\n∂ER\n\n(p,0)\n\n× F 2 (ER ) × S\n\n(8)\n\nwhere the (T, q 2 ) subscripts denote the WIMP interaction with the target\nnucleus at non-zero momentum transfer, (p, 0) denote the same with the proton at\nzero momentum transfer, F 2 is the nuclear form factor, and S is the scaling factor\n(eq. 7).\nFigure 1 (right) shows the expected rates on various materials for a 100\n2\nGeV/c WIMP with σ = 10−42 cm2 . Several important points are apparent from\n\n4\n\n\fthese plots. First, the expected event rates are very low: Even for a 10 keV experimental energy threshold, one expects < 0.5 event/kg/day. Therefore, a very\nimportant goal of the direct detection experiments is to understand and to suppress\nvarious types of background. Second, due to the exponential nature of the spectrum,\nthe majority of the signal is at very low energies. Therefore a low-energy threshold\nis essential. Third, despite the significant A2 advantage of heavy nuclei (e.g. Xe),\nthe nuclear form factor (Figure 1 left) suppression makes them less optimal at E>20\nkeV. Therefore, Xe-based experiments would be more advantageous only if they\ncould decrease the experimental threshold very low (which is not easy, as described\nlater in this paper).\n0\n\n10\n\n0.05\nSi\nGe\nXe\n\n0.045\n−1\n\n10\n\n0.04\n\n0.035\n\n−2\n\nEvents/kg/keV/day\n\nF2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n0.03\n\n0.025\n\n0.02\n\n0.015\n\nSi\nGe\nXe\n\n−5\n\n10\n\n0.01\n\n0.005\n−6\n\n10\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\n160\n\n180\n\n0\n\n200\n\nRecoil Energy (keV)\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\n90\n\n100\n\nRecoil Energy (keV)\n\nFigure 1: On the left: Nuclear form factors for Xe (dashed), Si (dots), Ge (solid). On\nthe right: Differential recoil-energy spectra for Si (dots), Ge (solid), Xe (dashed)[4].\nThus the main goal of a WIMP search experiment is to produce detectors\nwith extremely low background and very low threshold (<15 keV) using materials\nwith the best sensitivity to WIMPs. Due to the small interaction cross-section, a\nhigh mass - or, more accurately, a high exposure (M × T ) - is desirable. This can\nbe obtained using large detector masses and long exposure times. This requires a\nhigh stability of the readout system (in particular, readout threshold) to various\nenvironmental conditions.\nCurrently we can classify direct WIMPs search experiments into two different categories: The first category, the first developed historically, focuses on building\na detector with high mass and to passively reduce background by shielding the detector active region at deep underground sites. The hope is that after long exposures\nthe sensitivity to the WIMP signal rises above background and eventually one can\n5\n\n\fhope to detect the cosmological signature (eq. 2). However, because the signalto-background discrimination is of statistical nature, the sensitivity of this method\nonly increases with (M × T )1/2 . As representatives of this category of experiments,\nwe discuss in more detail DAMA-NaI and ZEPLINI in the following sections. The\nsecond category of direct WIMP search experiments focuses mainly on an event-byevent discrimination of signal against background. As described at the beginning of\nthis chapter, WIMPs interacting with the nucleus cause nuclear-recoils while most\nof the radioactive background (electromagnetic interaction) interact with electrons,\ngiving electron-recoils. It has been shown (see section 2.3) that with a proper detector design one can distinguish the two types of events with a very high efficiency.\nCompared to the first category of experiments, the sensitivity is now enhanced in\ndirect proportion to the exposure. As we will see, the experiments using this method\nobtained the best WIMP sensitivities.\n2.1 DAMA\nThe DAMA project was begun in 1990 by an Italian group at Gran Sasso underground laboratory [5]. This elegant project is based on highly radiopure NaI(Tl)\nscintillator detectors shielded rigorously from radioactive background. The scintillation properties of NaI have been studied extensively for nuclear physics instruments.\nIn particular, it has been shown that nuclear-recoil events can produce scintillation\nphotons. It is possible to purify the crystals to achieve very low levels of background. The scintillation-yields are fairly low (0.3 for Na and 0.09 for I), leading to\na recoil-energy threshold of ∼20 keV for I, which is the more interesting nucleus for\nthe WIMP-search due to its large A2 factor. The group also showed that there is\na slight difference between the pulse shapes produced by nuclear-recoil events and\nthose produced by electron-recoil events. Though the latter factor could help to statistically discriminate WIMPs against radioactive background, it has been ignored\nin the DAMA data analysis due to low efficiency.\nThe DAMA experiment is placed among the first category of dark matter\nexperiments (see the end of section 2), which require a large detector exposure\n(107,731 kg-day over 7 years of operation). If WIMPs form a halo embedding our\ngalaxy, as the Sun is moving through the WIMP halo, the Earth should feel a wind\nof WIMPs with strength a function of its position in its orbit. Hence, one would\nexpect to observe an annual modulation of the interaction rates. In 2000, using a\nfive-year exposure, the DAMA collaboration claimed to observe a 6.3 σ C.L annual\nmodulation in WIMP-proton elastic scattering. Recently, DAMA confirmed the\n\n6\n\n\f2-4 keV\nI\n\nII\n\nIII\n\nIV\n\nV\n\nVI\n\nVII\n\n0.05\n0\n-0.05\n-0.1\n0.1\n\n500\n\n1000\n\n1500\n\n2000\n\nI\n\nII\n\nIII\n\nIV\n\n2500\n\nTime (day)\n\n2-5 keV\nV\n\nVI\n\nNormalized Power\n\nResiduals (cpd/kg/keV)\nResiduals (cpd/kg/keV)\nResiduals (cpd/kg/keV)\n\n0.1\n\nVII\n\n0.05\n0\n-0.05\n-0.1\n0.1\n\n500\n\n1000\n\n1500\n\n2000\n\nII\n\nIII\n\nIV\n\n8\n\n6\n\n2500\n\nTime (day)\n\n2-6 keV\nI\n\n10\n\nV\n\nVI\n\n4\n\nVII\n\n0.05\n0\n\n2\n\n-0.05\n-0.1\n\n500\n\n1000\n\n1500\n\n2000\n\n0\n\n2500\n\n0\n\n0.002\n\n0.004\n\n0.006\n\n0.008\n-1\n\nTime (day)\n\nFrequency (d )\n\nFigure 2: On the left: The DAMA experiment's annual modulation of the residual\nrate (total rate minus constant) in the (2-4), (2-5), and (2-6) keV energy intervals\nas a function of the time over 7 annual cycles (total exposure 107731 kg × day); end\nof data taking July 2002. On the right: Power spectrum of the measured (2-6) keV\nmodulation; the principal mode corresponds well to a 1 year period [6].\nobservation [6] by adding the results from two more annual cycles (Figure 2). While\nthe DAMA evidence for the annual modulation is clear, its interpretation is more\nquestionable. Most of the modulation signal comes from the lowest energy bins\n(2-6 keV), where understanding the efficiencies is particularly important. Although\nDAMA performed a study of the various possible systematic effects, some doubts\nremain that the signal may be caused by some other, less interesting, effects. The\ndoubts are further fueled by the fact that there are three experiments (namely\nCDMS, Edelweiss, and ZEPLIN I) which have explored the same parameter space\nand found no signal.\nSeveral upcoming experiments may help resolve the conflict: NaIAD (Boulby\nmine, UK)[7] has 65 kg of NaI crystals and is already acquiring data. ANAIS (Canfranc, Spain) [8] plans to use a detector mass of 107 kg of NaI, and has currently\nsuccessfully tested a prototype. Both of these experiments should test the entire\nsignal region claimed by DAMA in the coming 2-3 years.\n\n7\n\n\f2.2 Xe-based experiments\nLiquid Xe can also be used to search for a direct WIMP signal. Xe has an obvious\nadvantage over other materials due to its large A2 (A=131) factor. However, as\nshown in Figure 1, this advantage is partially offset by the form factor suppression.\nXe-based detectors would be particularly advantageous if their nuclear-recoil energy\nthreshold can be reduced below 20 keV.\nThe signature of an interaction in Xe is twofold. First, there is electron\nexcitation of Xe atoms, which leads to scintillation. Second, there is ionization of Xe\natoms. The two signals can be used to discriminate against the electron-recoil events.\nIn the absence of an electric field, the electron and ionized Xe recombine, producing\nsecondary scintillation. The timing of the two scintillation pulses (nanosecond scale)\ndiffers for electron and nuclear-recoils, so pulse-shape discrimination can be used\nto suppress the electron-recoil background. This technique is used by ZEPLIN I\n(Boulby mine, UK) [9]. Their preliminary result is comparable with the Ge-based\nexperiments CDMS (SUF) and Edelweiss, and incompatible with the signal region\nclaimed by DAMA (Figure 4). However, these results are not based on an in situ\nneutron calibration.\nAlternatively, an electric field may be used to extract the electrons of the\nionization signal. Such techniques are being investigated for ZEPLIN II and ZEPLIN\nIII (both at the Boulby mine, UK) [10]. Possibly the most important advantage of\nXe detectors is their scalability to large detector masses. Such experiments (ZEPLIN\nIV and XENON [11]) are in the proposal stage. However, the dependence of the\nbasic parameters, the ionization-yield and the scintillation-yield, on the energy and\non the type of recoil are yet to be demonstrated.\n2.3 Low temperature detectors: Solutions to event-by-event discrimination\nThe cryogenic calorimeters are, so far, the technologies best able to meet the two\nnecessary requirements for a WIMP detector: Low threshold (<10keV) and good\nenergy resolution (<100 eV). A cryogenic calorimeter consist of a dielectric crystal\n(Al2 O3 , Ge, Si, CaWO4 , etc.) cooled to temperatures as low as 0.01 ◦ K. Because the\nheat capacity C of a crystal varies as (T /ΘD )3 , (ΘD is the Debye temperature, e.g.\n374 ◦ K for Ge) at very low T a small energy deposit from a particle interaction could\nsignificantly (10−5 ◦ K) change the temperature of the absorber (∆T = E/C). A\nproperly-attached thermometer (Mott-Anderson insulator or superconductor at its\nT c) could thus measure the deposited energy. This is the best calorimetric measurement because all primary excitations due to the particle interaction will eventually\n8\n\n\ftransform into thermal excitations. From another point of view, at very low temperatures the phonon (lattice vibration quanta) content of the crystal thermal bath is\nvery low, and thus the out-of-equilibrium (athermal) phonons produced after an interaction may be easily distinguished and counted in order to measure the deposited\nenergy. This combined with the fact that the excitation energy to create phonons is\nvery low, ∼ 10−5 eV, compared to ∼1eV for conventional semiconductor detectors,\nmakes cryogenic detectors the best calorimeters at low energies yet developed.\nThe above introduction suggests two distinct (but physically related) methods of calorimetric measurement. One method consists of measuring the detector\ntemperature after it reaches the equilibrium state (at higher T of course) after the\ninteraction. In this case, ∆T = E/C will directly measure the energy of the interacting particle. The second method, which requires a more elaborated readout\nsystem, is based on measuring the energy content of the athermal phonons created\nafter an interaction, under the assumption that athermal phonons are proportionally produced and detected. As the athermal phonons carry information about the\nhistory of the event, the second method is more advantageous when it becomes important to reconstruct the history of an event in the detector. For example, it is\noften possible to reconstruct the location of an event in the detector, which in some\ncases is very important as we will see later in this paper. The signal amplitude in the\nfirst method depends on the mass of the detector as C ∝ M, which limits the mass\nof the detectors. The second method does not suffer from this limitation, as long\nas the lifetime of the athermal phonons in the detector is longer than the response\ntime of the readout system.\nCalorimetric measurement alone is not enough to discriminate nuclear recoils (WIMPs) from electron-recoils (radioactive background), as the energy deposited does not depend on the type of interaction. However, it has been shown\n[12] that in semiconductor crystals (Ge, Si, etc.), the ionization-yield (charge/recoil\nenergy) differs significantly between an electron-recoil and a nuclear-recoil. In Ge\ncrystals, for example, the ionization-yield is 3 times bigger for an electron-recoil\nthan for a nuclear-recoil. Figure 3 (left) shows the calibration results for one of the\nCDMS detector. Therefore, by simultaneously measuring ionization and phonons\nsignal, one can obtain an event-by-event discrimination between a WIMP signal and\nthe background. The CDMS and Edelweiss experiments use this method of detection\nand they are currently presenting the best sensitivities to WIMPs. This discrimination based on the ionization-heat measurement fails when an event occurs very close\nto the detector surface, in the \"ionization dead-layer\" [13]. The charge collection for\nsuch event could be incomplete, which could cause electron-recoil misidentification.\n9\n\n\fBy measuring athermal phonons, CDMS is able to identify and reject events occurring very close to the surface based on timing parameters of the phonon pulse [14].\nThe Edelweiss experiment currently uses NTD-based heat sensors sensitive only to\noverall changes in temperature, and is unable to localize events in this manner.\nHowever, the group's recent studies of position-sensitive ionization-heat detectors\nlook very promising [15],[16].\nScintillation-yield (light/recoil energy) could also differ between electronrecoils and nuclear-recoils. The CRESST experiment is based on simultaneous measurement of scintillation and ionization. There are also experiments, such as CUORE\nand CUORCINO [17], which are based on heat measurement alone. The complex\ntechniques involved in low temperature devices make such detectors difficult to scale\nto large masses. The main challenge of the above mentioned experiments is to increase the mass of the detectors without compromising their sensitivity.\n2.3.1 CDMS\nCDMS uses ZIP (Z-dependent Ionization Phonon) detector technology to detect\nWIMPs [18]. ZIPs are disc-shaped (76 mm in diameter, 10 mm high) germanium or\nsilicon crystals (absorber). One face of the disc is divided into four quadrants. Each\nquadrant is covered by a thin layer (350 nm) of lithographically-patterned aluminum\nfins (athermal phonon collectors) and 1024 tungsten transition-edge sensors (1μm ×\n250μm × 35nm TES) which are evenly distributed over the surface. The Al layer\nis directly sputtered on the surface of the absorber (> 80% surface coverage) and\nprovides a good phonon-phonon coupling between the two materials. The athermal\nphonons can pass the interface between the absorber and Al fins and directly relax\ntheir energy into the Al by breaking the Cooper pairs (creating quasi-particles) in\nthe Al. These quasi-particles will tunnel into and become trapped in the TES's\n(tungsten T c ∼ 0.07 ◦ K). The tungsten TES's are biased at the superconducting\ntransition temperature, and thus a small variation in the TES temperature (due\nto the quasiparticle trapping) will cause a significant change in the TES resistance\n(∼10 mΩ), which is then read out by a SQUID amplifier. The other face of the\ndetector, which is also covered by aluminum, allows an electric field to be applied\nin order to collect the charge.\nCDMS uses two methods to solve the near-surface event problem. First, an\namorphous Si layer is introduced between the absorber and electrodes, which reduces\nthe effect of near-surface trapping processes [13]. Second, the timing parameters of\nathermal-phonon signals can be used to identify the near surface events [14]. Figure\n\n10\n\n\f3 (right) shows the effectiveness of using athermal-phonon signal timing parameters\nin rejecting the near-surface events.\nEach group of six Ge (250 g) or Si (100 g) detectors is packed in a single\n\"tower\" with their corresponding cold readout electronic instruments. Five \"towers\"\nare currently installed in a He3 − He4 dilution fridge (operating T < 0.05 ◦ K)\nat Soudan underground laboratory. An overburden of 780 m of rock reduces the\nsurface muon flux by a factor of 5 * 10−4 . Furthermore, the detectors are shielded\nagainst ambient radioactivity by ∼0.5 cm of copper, 22.5 cm of lead, and 50 cm\nof polyethylene (to shield against neutrons). A 5-cm-thick scintillator muon veto\nenclosing the shielding identifies charged particles (and some neutral particles) that\npass through it.\nRecently, CDMS published [19] the analysis of its first Ge WIMP-search\ndata (from the first \"tower\") taken at Soudan during the period October 11, 2003\nthrough January 11, 2004. After excluding time for calibrations, cryogen transfers,\nmaintenance, and periods of increased noise, they obtained 52.6 live days with the\nfour Ge and two Si detectors of \"Tower 1\". This analysis revealed no nuclear-recoil\nevents in 52.6 kg-d raw exposure in the Ge detectors. The data was used to set an\nupper limit on the WIMP-nucleon cross-section of 4 * 10−43 cm2 at the 90% C.L. at\na WIMP mass of 60 GeV/c2 for coherent scalar interactions and a standard WIMP\nhalo (Figure 4). CDMS, which currently gives the best sensitivity to WIMPs yet\nattained, is now operating 2 detector towers (Tower 1+Tower 2) and plans to run\n5 towers through the year 2005. The expected sensitivity reach for σWIMP−nucleon is\n∼ 3 * 10−44 cm2 based on 1200 kg-d projected esposure. Also a 99%-C.L. detection\npossibility is considered if σWIMP−nucleon ∼ 6 * 10−44 cm2 .\n2.3.2 Edelweiss\nThe Edelweiss experiment [20] is located at the LSM (French acronym for Modane\nUnderground Laboratory). About 1700 m of rock protect the experiment from radioactive backgrounds generated by cosmic rays. In the laboratory, the muon flux\nis reduced by a factor 2 * 10−6 compared to the flux at sea level. The experiment\nis surrounded by passive shielding made of paraffin (30 cm), lead (15 cm), and\ncopper (10 cm). Edelweiss uses the same principle as CDMS for WIMP detection:\nIonization-heat discrimination. Unlike CDMS's athermal phonon sensors, the tiny\nrise in temperature due to a particle event is measured by an NTD (Neutron Transmutation Doped) heat sensor glued onto one of the charge-collection electrodes.\nIn 2000 and 2002, 11.6 kg-day were recorded with two different detectors\n\n11\n\n\f1.5\n\n25\n\nPhonon Start Time (μs)\n\n20\n\nIonization Yield\n\n1\n\n0.5\n\n15\n\n10\n\n5\n\n0\n0\n\n20\n\n40\n\n60\n\n80\n\n0\n0\n\n100\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n\n1.6\n\nIonization Yield\n\nRecoil Energy (keV)\n\nFigure 3: On the left: Ionization-yield versus recoil energy for a typical CDMS\nneutron (here with 252 Cf) and gamma calibration. Also shown on the figure are the\n±2σ nuclear-recoil band (dashed curve) and ±2σ electron-recoil band (solid curve).\nOn the right: Phonon start time versus ionization-yield for 133 Ba gamma-calibration\nevents (diamonds) and 252 Cf neutron-calibration events (dots) in the energy range\n20-40 keV in a typical CDMS detector. The diamonds that spread from yield=1\nto yield=0.3 are near-surface events. Lines indicate typical timing and ionizationyield cuts, resulting in a high nuclear-recoil efficiency and a low rate of misidentified\nsurface events[19].\n[21]. In 2003, three new detectors were placed in the cryostat and 20 kg-day were\nadded to the previous published data. Three events compatible with nuclear-recoils\nhave been observed. However, the recoil energy of one of the events is incompatible\nwith a WIMP mass < 1 TeV/c2 . The two other events have been used to set the\nupper limit for WIMP-nucleon spin-independent interaction shown in Figure 4. The\nnew limit is identical to the previous (11.7 kg-day), since the experiment is currently background-limited. The lack of an active surface-event rejection makes the\ndistinction between nuclear-recoils and near-surface background events very difficult.\nEdelweiss is now implementing a new design based on NbSi thin-film Anderson insulator thermometers. The new detectors, which are sensitive to athermal phonons\nand have already demonstrated a high surface event rejection efficiency, will be\nfunctional during the Edelweiss II experimental stage [22].\nAs of March 2004, the Edelweiss I experiment has been stopped to allow the\ninstallation of the second-stage Edelweiss II. The aim is a factor of 100 improvement\nin sensitivity. A new low-radioactivity cryostat (with a capacity of 50 liters), able to\n\n12\n\n\freceive up to 120 detectors, is being tested in the CRTBT laboratory at Grenoble.\nThe first runs will be performed with twenty-one 320 g Ge detectors equipped with\nNTD heat sensors and seven 400 g Ge detectors with NbSi thin film. With an\nimproved polyethylene and lead shielding and an outer muon veto, the expected\nsensitivity for σWIMP−nucleon is about 10−44 cm2 .\n2.3.3 Scintillation-heat : CRESST\nThe simultaneous detection of scintillation light and phonons in cryogenic calorimeters using scintillating absorber crystals can give a background suppression similar\nto that provided by the simultaneous measurement of ionization and light. Very\nrecently it was shown [23] that a large variety of scintillating crystals (CaWO4 ,\nBaF, PbWO4 , etc.) can be used in this manner. This gives this method a big advantage in identification of WIMP signals. The experiments using this technique\nare CRESST II and Rosebud. This technique has an important advantage over the\nGe-based detectors in that it does not have surface-event problems. However, the\ntechnique also has some difficulties. First, rather than using PMTs to observe the\nscintillation signal (due to their high radioactive background), the current approach\n(taken by CRESST II [27]) is to use a second, phonon-mediated detector adjacent to\nthe primary detector. The light collection is relatively poor, resulting in an energy\nthreshold of 15-20 keV. Second, there are three nuclei in the crystal, all of which\ncould potentially interact with the WIMPs. The scintillation-yield produced by the\nthree nuclei has yet to be studied carefully, making event interpretation difficult.\nThe goal of CRESST II is to build a 10 kg detector consisting of 300 g crystals to\nreach a sensitivity for σWIMP−nucleon of the order of 10−44 cm2 .\n3\n\nIndirect WIMP Searches\n\nWe now review the current state of the various WIMP indirect search methods.\nIndirect detection experiments search for products of WIMP annihilation in regions\nthat are expected to have relatively large WIMP concentration. Examples of such\nregions are galactic centers, the center of the Sun, or the center of the Earth, where\nthe WIMPs are expected to be gravitationally captured. Such searches assume that\nthe WIMP is its own antiparticle (as predicted by SUSY models) or that equal\nnumbers of WIMPs and anti-WIMPs are present. Higher WIMP density gives a\nlarger annihilation signal, which can be manifested as a flux of γ-rays, neutrinos,\nor antimatter (positrons or anti-protons) produced in the WIMP-annihilation. We\ndiscuss these possibilities in some detail.\n13\n\n\fhttp://dmtools.brown.edu/\nGaitskell&Mandic\n\n-41\n\n10\n\n-42\n\n10\n\n2\n\nCross-section [cm ] (normalised to nucleon)\n\n-40\n\n10\n\n-43\n\n10\n\n-44\n\n10\n\n041201145601\n\n1\n\n10\n\n2\n\n10\nWIMP Mass [GeV]\n\n10\n\n3\n\nFigure 4: Limits on the WIMP-nucleon scalar cross section from CDMS[19] (solid\nblue), Edelweiss [20] (solid magenta), Zeplin I preliminary [24](dashed black), and\nCRESST (green crosses). Parameter above the curve is excluded at 90% C.L. These\nlimits constrain several supersymmetry models, for example [26] (yellow) and [25]\n(blue). The DAMA 3 σ signal region [6] is shown as a closed contour.\n3.1 γ-rays\nWIMP-annihilation can produce γ-rays in several different ways. First, a continuous\nspectrum is produced from the hadronization and decay of π0 's produced in the\ncascading of the annihilation products. Second, γ-ray spectral lines are produced\nby the annihilation channels in which γ's are directly produced, such as XX → γγ\n(producing a line at MX ) and XX → γZ (producing a line at MX (1 − MZ2 /MX2 )).\nObserving such lines would be a clear detection of WIMP annihilation. Such γ-rays\ncould be produced close to the galactic center. Although the production rates are\nrelatively low, a large halo density may compensate sufficiently to make such signals\nobservable.\nGround-based experiments rely on Atmospheric Cerenkov Telescopes (ACTs),\nwhich detect the Cerenkov light emitted by the shower produced by a γ-ray interacting at the top of the atmosphere. Some experiments, such as CELESTE (France)\n[28] and STACEE (New Mexico) [29], use the large mirrored areas used by solar\npower plants. These two experiments are sensitive to 20-250 GeV γ-rays. A number\nof experiments use dedicated mirrors or arrays of mirrors with a detector in the\nfocal point: CANGAROO (Australia) [30], VERITAS (Arizona) [31], CAT (France)\n[32], HESS (Namibia) [33], HEGRA (Canary Islands, dismantled) [34], and MAGIC\n(Canary Islands) [35]. Such experiments are typically sensitive to 100 GeV - 10 TeV\nγ-rays. They are also capable of distinguishing (usually at > 99% efficiency) be14\n\n\ftween the showers caused by γ-rays and those caused by cosmic rays (their dominant\nbackground). Finally, there are satellite-based experiments: EGRET [36] completed\nits mission and observed γ-rays in the 20 MeV - 30 GeV energy range, and GLAST\n[37] is scheduled to launch in 2006 and observe γ-rays of energies 10 MeV - 100 GeV.\nRecently, two experiments have observed an excess flux of γ-rays coming\nfrom the galactic center. VERITAS [38], operating at the Whipple 10 m telescope on\nMt. Hopkins, Arizona, observed an integral flux of 1.6 ± 0.5 ± 0.3 * 10−8m−2 s−1 with\nthe energy threshold of 2.8 TeV. CANGAROO [39], with a lower threshold of 250\nGeV, made a ∼ 10σ detection of the γ-ray source in the galactic center over the range\n250 GeV -2.5 TeV. However it is difficult to reconcile [40] the results of CANGAROO\nand VERITAS. The spectrum measured by CANGAROO is consistent with a WIMP\nmass of 1-3 TeV, while VERITAS, with its energy threshold of 2.8 TeV, requires a\nmuch heavier WIMP. Moreover, very high annihilation rates are required for this\nsignal to be explained by WIMP annihilation. This implies very high annihilation\ncross-section and very high dark matter concentration at the galactic center. We\nnote the possibility that these observations could also be explained by astrophysical\nsources, in particular the black hole at the galactic center. Results from the HESS\nexperiment are expected in the near future - with four telescopes - HESS is expected\nto be more sensitive in the direction of the galactic center and to have superior\nangular resolution.\n3.2 Neutrinos\nAlthough WIMPs are expected to scatter very infrequently, they do scatter off of\nnuclei in the Sun or the Earth, lose, and become gravitationally bound. Hence, the\ndensity of WIMPs at the center of the Earth or the Sun can be considerably larger\nthan in the halo, implying higher annihilation rates. Neutrinos produced in such\nWIMP-annihilations would penetrate to the Earth's surface, or escape from the Sun.\nThe neutrinos can be produced both directly XX → ν ν̄ and indirectly XX → f f ̄,\nwhere the fermion f can decay and emit a neutrino. Hence, the energy spectrum\nis expected to be continuous, rather than a line, but it is expected to extend up to\nthe WIMP mass. If the neutrino interacts with rock sufficiently close to the Earth's\nsurface, the products of the interaction may be detectable. The muon neutrinos\nare, hence, of the most interest, because their interactions produce muons which\ncan travel considerable distance through the rock and reach a detector (electrons\nare absorbed at very short distances). The muon neutrinos can be detected at the\nsurface of the Earth, usually using dedicated solar or atmospheric neutrino detectors.\n\n15\n\n\fIn practice, one searches for upward-going muons - for the high-energy neutrinos, the\nmuons produced are well-collimated with the original neutrino direction and carry\nmuch of the original neutrino's energy. Hence, one can search for the upward-going\nmuon signal with a high-energy-threshold detector. The only known background are\natmospheric neutrinos produced in the cosmic rays interactions with the atmosphere\nat the opposite side of the Earth.\nExperiments designed to study solar or atmospheric neutrinos can also be\nused to look for the WIMP-annihilation neutrino signal. At the moment, none of\nthe experiments has observed excess neutrinos from the Earth or the Sun, but several experiments have determined upper bounds on their flux: Baksan (neutrino\nexperiment in Caucasus, Russia) [41], SuperKamiokande (atmospheric neutrino experiment in Japan) [42], MACRO (liquid scintillator neutrino experiment in Italy)\n[43], and AMANDA II (ice Cerenkov detector at the South Pole) [44]. These experiments are just beginning to probe the theoretically-allowed regions in supersymmetric WIMP models. Future experiments, such as ANTARES [45] and Lake Baikal\n[46], as well as future runs of AMANDA II and IceCube, are expected to improve\nthe sensitivity to WIMP-annihilation neutrinos by ∼2 orders of magnitude.\n4\n\nConclusion\n\nDirect detection experiments have already explored the regions of the most optimistic SUSY models. Despite their lower exposures (∼50 kg-day, compared to\n110,000 kg-day), event-by-event discrimination methods are currently giving the\nbest sensitivities to the WIMP-nucleon scalar scattering cross-section. Extremely\nhigh discrimination combined with large mass seems to be the only solution for\nthe next generation of direct detection experiments. The two-order-of-magnitude\nincrease in the sensitivity of next-generation experiments will explore the core of\nmany SUSY models in the next few years. Indirect detection will be complementary, but hardly competitive, for low-σ scalar WIMP detection. When combined\nwith accelerator (LHC) results, the next generation of direct detection experiments\nmay soon let us pinpoint the nature of the dark matter.\nReferences\n1. F. Zwicky, Helv. Phys. Acta 6, 110 (1933).\n2. M. Goodman and E. Witten, Phys. Rev. D31, 3059 (1985).\n3. G. Jungman et al., Phys. Rep. 267 (no 5-6), 195 (1996).\n16\n\n\f4. V. Mandic, First Results from the Cryogenic Dark Matter Search Experiment\nat the Deep Site, Ph.D. thesis, U.C. Berkeley, 2004.\n5. P. Belli et al., DAMA proposal to INFN Scientific Committee II, April 24 1990.\n6. B. Bernabei et al., astro-ph/0405282.\n7. B. Ahmed et al., Nucl. Phys. B Proc. Suppl. 124, 193 (2003).\n8. J. Morales et al., Nucl. Phys. B Proc. Suppl. 118, 525 (2003).\n9. S. Hart, Nucl. Phys. B Proc. Suppl. 110, 91 (2002).\n10. D.B Cline, eConf C010630, E108 (2001).\n11. E. Aprile et al., astro-ph/0207670v1,31 Jul 2002.\n12. T. Shutt et al., Phys. Rev. Lett., 69(24), 3531 (1992).\n13. T. Shutt et al., Nucl. Inst. Meth. A 444, 340 (2000).\n14. V. Mandic et al., Nucl. Instr. Meth. A 520, 171 (2004).\n15. N. Mirabolfathi et al., AIP conference proceedings, Volume 605, 517 (2001).\n16. S. Marnieros et al., Nucl. Inst. Meth. A 520, 185 (2004)\n17. CUORE collaboration, Astropart. Phys. 20, (2003) 91 (2003).\n18. R. Clarke, An Athermal Phonon Mediated Dark Matter Detector with Surface\nEvent Discrimination, Ph.D. thesis, Stanford Univ., 1999\n19. CDMS Collaboration, Phys. Rev. Lett. 93, 211301 (2004).\n20. A. Benoit et al., Phys. Lett. B545, 43 (2002).\n21. A. Benoit et al., Phys. Lett. B530, 15 (2001).\n22. A. Broniatowstky et al., AIP conference proceedings, Volume 605, 517 (2001).\n23. N. Coron et al., Proceedings of the Tenth International Workshop on Low Temperature Detectors, Genoa, July 2003, to appear in NIM A\n24. V.A. Kudryavtsev, astro-ph/0406126\n25. E.A. Baltz and P. Gondolo, Phys. Rev. D67, 063503 (2003).\n17\n\n\f26. A. Bottino et al., Phys. Rev. D69, 037302 (2004).\n27. M. Altmann et al., astro-ph/0106314\n28. http://www.cenbg.in2p3.fr/extra/groupes/astrop/celeste.html.\n29. http://www.astro.ucla.edu/stacee/index.html.\n30. http://icrhp9.icrr.u-tokyo.ac.jp.\n31. http://www.astro.ucla.edu/ veritas.\n32. http://lpnp90.in2p3.fr/cat/index.html.\n33. http://www.mpi-hd.mpg.de/hfm/HESS/HESS.html.\n34. http://www.mpi-hd.mpg.de/hfm/CT/ctframestart.html.\n35. http://hegra1.mppmu.mpg.de/MAGICWeb/.\n36. R. Hartman et al, Astroph. J. Suppl. 123, 79 (1999).\n37. http://www-glast.stanford.edu/.\n38. K. Kosack et al., astro-ph/0403422.\n39. K. Tsuchiya et al., astro-ph/0403592.\n40. D. Hooper et al., astro-ph/0404205.\n41. M. Boliev et al., Proc. 24th ICRC (Rome) 1, 722 (1995).\n42. S. Desai et al., hep-ex/0404025.\n43. M. Ambrosio et al., Phys. Rev. D60, 082002 (1999).\n44. J. Ahrens et al., Phys. Rev. D66, 032006 (2002).\n45. http://antares.in2p3.fr/Overview.\n46. http://www.ifh.de/baikal/baikalhome.html.\n\n18\n\n\f"}