{"id": "http://arxiv.org/abs/astro-ph/0701883v2", "guidislink": true, "updated": "2007-02-08T04:02:39Z", "updated_parsed": [2007, 2, 8, 4, 2, 39, 3, 39, 0], "published": "2007-01-31T00:30:41Z", "published_parsed": [2007, 1, 31, 0, 30, 41, 2, 31, 0], "title": "Stellar populations -- the next ten years", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0701869%2Castro-ph%2F0701101%2Castro-ph%2F0701438%2Castro-ph%2F0701683%2Castro-ph%2F0701579%2Castro-ph%2F0701553%2Castro-ph%2F0701384%2Castro-ph%2F0701416%2Castro-ph%2F0701276%2Castro-ph%2F0701226%2Castro-ph%2F0701420%2Castro-ph%2F0701590%2Castro-ph%2F0701453%2Castro-ph%2F0701678%2Castro-ph%2F0701470%2Castro-ph%2F0701092%2Castro-ph%2F0701812%2Castro-ph%2F0701356%2Castro-ph%2F0701333%2Castro-ph%2F0701905%2Castro-ph%2F0701643%2Castro-ph%2F0701036%2Castro-ph%2F0701389%2Castro-ph%2F0701602%2Castro-ph%2F0701477%2Castro-ph%2F0701817%2Castro-ph%2F0701048%2Castro-ph%2F0701523%2Castro-ph%2F0701128%2Castro-ph%2F0701034%2Castro-ph%2F0701305%2Castro-ph%2F0701224%2Castro-ph%2F0701310%2Castro-ph%2F0701731%2Castro-ph%2F0701752%2Castro-ph%2F0701711%2Castro-ph%2F0701096%2Castro-ph%2F0701415%2Castro-ph%2F0701583%2Castro-ph%2F0701400%2Castro-ph%2F0701925%2Castro-ph%2F0701882%2Castro-ph%2F0701234%2Castro-ph%2F0701623%2Castro-ph%2F0701896%2Castro-ph%2F0701839%2Castro-ph%2F0701252%2Castro-ph%2F0701511%2Castro-ph%2F0701546%2Castro-ph%2F0701374%2Castro-ph%2F0701316%2Castro-ph%2F0701617%2Castro-ph%2F0701883%2Castro-ph%2F0701423%2Castro-ph%2F0701581%2Castro-ph%2F0701503%2Castro-ph%2F0701686%2Castro-ph%2F0701800%2Castro-ph%2F0701008%2Castro-ph%2F0701447%2Castro-ph%2F0701495%2Castro-ph%2F0701808%2Castro-ph%2F0701174%2Castro-ph%2F0701322%2Castro-ph%2F0701555%2Castro-ph%2F0701533%2Castro-ph%2F0701674%2Castro-ph%2F0701502%2Castro-ph%2F0701129%2Castro-ph%2F0701588%2Castro-ph%2F0701363%2Castro-ph%2F0701709%2Castro-ph%2F0701233%2Castro-ph%2F0701483%2Castro-ph%2F0701206%2Castro-ph%2F0701422%2Castro-ph%2F0701614%2Castro-ph%2F0701309%2Castro-ph%2F0701520%2Castro-ph%2F0701890%2Castro-ph%2F0701133%2Castro-ph%2F0701685%2Castro-ph%2F0701490%2Castro-ph%2F0701403%2Castro-ph%2F0701527%2Castro-ph%2F0701126%2Castro-ph%2F0701848%2Castro-ph%2F0701641%2Castro-ph%2F0701347%2Castro-ph%2F0701326%2Castro-ph%2F0701354%2Castro-ph%2F0701597%2Castro-ph%2F0701054%2Castro-ph%2F0701693%2Castro-ph%2F0701732%2Castro-ph%2F0701474%2Castro-ph%2F0701788%2Castro-ph%2F0701558%2Castro-ph%2F0701266%2Castro-ph%2F0701783%2Castro-ph%2F0701265&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stellar populations -- the next ten years"}, "summary": "The study of stellar populations is a discipline that is highly dependent on\nboth imaging and spectroscopy. I discuss techniques in different regimes of\nresolving power: broadband imaging (R~4), intermediate band imaging (R~16, 64),\nnarrowband spectral imaging (R~256, 1024, 4096). In recent years, we have seen\nmajor advances in broadband all-sky surveys that are set to continue across\noptical and IR bands, with the added benefit of the time domain, higher\nsensitivity, and improved photometric accuracy. Tunable filters and integral\nfield spectrographs are poised to make further inroads into intermediate and\nnarrowband imaging studies of stellar populations. Further advances will come\nfrom AO-assisted imaging and imaging spectroscopy, although photometric\naccuracy will be challenging. Integral field spectroscopy will continue to have\na major impact on future stellar population studies, extending into the near\ninfrared once the OH suppression problem is finally resolved. A sky rendered\ndark will allow a host of new ideas to be explored, and old ideas to be\nrevisited.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0701869%2Castro-ph%2F0701101%2Castro-ph%2F0701438%2Castro-ph%2F0701683%2Castro-ph%2F0701579%2Castro-ph%2F0701553%2Castro-ph%2F0701384%2Castro-ph%2F0701416%2Castro-ph%2F0701276%2Castro-ph%2F0701226%2Castro-ph%2F0701420%2Castro-ph%2F0701590%2Castro-ph%2F0701453%2Castro-ph%2F0701678%2Castro-ph%2F0701470%2Castro-ph%2F0701092%2Castro-ph%2F0701812%2Castro-ph%2F0701356%2Castro-ph%2F0701333%2Castro-ph%2F0701905%2Castro-ph%2F0701643%2Castro-ph%2F0701036%2Castro-ph%2F0701389%2Castro-ph%2F0701602%2Castro-ph%2F0701477%2Castro-ph%2F0701817%2Castro-ph%2F0701048%2Castro-ph%2F0701523%2Castro-ph%2F0701128%2Castro-ph%2F0701034%2Castro-ph%2F0701305%2Castro-ph%2F0701224%2Castro-ph%2F0701310%2Castro-ph%2F0701731%2Castro-ph%2F0701752%2Castro-ph%2F0701711%2Castro-ph%2F0701096%2Castro-ph%2F0701415%2Castro-ph%2F0701583%2Castro-ph%2F0701400%2Castro-ph%2F0701925%2Castro-ph%2F0701882%2Castro-ph%2F0701234%2Castro-ph%2F0701623%2Castro-ph%2F0701896%2Castro-ph%2F0701839%2Castro-ph%2F0701252%2Castro-ph%2F0701511%2Castro-ph%2F0701546%2Castro-ph%2F0701374%2Castro-ph%2F0701316%2Castro-ph%2F0701617%2Castro-ph%2F0701883%2Castro-ph%2F0701423%2Castro-ph%2F0701581%2Castro-ph%2F0701503%2Castro-ph%2F0701686%2Castro-ph%2F0701800%2Castro-ph%2F0701008%2Castro-ph%2F0701447%2Castro-ph%2F0701495%2Castro-ph%2F0701808%2Castro-ph%2F0701174%2Castro-ph%2F0701322%2Castro-ph%2F0701555%2Castro-ph%2F0701533%2Castro-ph%2F0701674%2Castro-ph%2F0701502%2Castro-ph%2F0701129%2Castro-ph%2F0701588%2Castro-ph%2F0701363%2Castro-ph%2F0701709%2Castro-ph%2F0701233%2Castro-ph%2F0701483%2Castro-ph%2F0701206%2Castro-ph%2F0701422%2Castro-ph%2F0701614%2Castro-ph%2F0701309%2Castro-ph%2F0701520%2Castro-ph%2F0701890%2Castro-ph%2F0701133%2Castro-ph%2F0701685%2Castro-ph%2F0701490%2Castro-ph%2F0701403%2Castro-ph%2F0701527%2Castro-ph%2F0701126%2Castro-ph%2F0701848%2Castro-ph%2F0701641%2Castro-ph%2F0701347%2Castro-ph%2F0701326%2Castro-ph%2F0701354%2Castro-ph%2F0701597%2Castro-ph%2F0701054%2Castro-ph%2F0701693%2Castro-ph%2F0701732%2Castro-ph%2F0701474%2Castro-ph%2F0701788%2Castro-ph%2F0701558%2Castro-ph%2F0701266%2Castro-ph%2F0701783%2Castro-ph%2F0701265&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The study of stellar populations is a discipline that is highly dependent on\nboth imaging and spectroscopy. I discuss techniques in different regimes of\nresolving power: broadband imaging (R~4), intermediate band imaging (R~16, 64),\nnarrowband spectral imaging (R~256, 1024, 4096). In recent years, we have seen\nmajor advances in broadband all-sky surveys that are set to continue across\noptical and IR bands, with the added benefit of the time domain, higher\nsensitivity, and improved photometric accuracy. Tunable filters and integral\nfield spectrographs are poised to make further inroads into intermediate and\nnarrowband imaging studies of stellar populations. Further advances will come\nfrom AO-assisted imaging and imaging spectroscopy, although photometric\naccuracy will be challenging. Integral field spectroscopy will continue to have\na major impact on future stellar population studies, extending into the near\ninfrared once the OH suppression problem is finally resolved. A sky rendered\ndark will allow a host of new ideas to be explored, and old ideas to be\nrevisited."}, "authors": ["Joss Bland-Hawthorn"], "author_detail": {"name": "Joss Bland-Hawthorn"}, "author": "Joss Bland-Hawthorn", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/S1743921307009192", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0701883v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0701883v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Invited review, IAUS 241, \"Stellar Populations as Building Blocks of\n  Galaxies,\" eds. Vazdekis, Peletier. 12 pages, 1 table. (The sideways table\n  should print ok; there are 10 columns.)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0701883v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0701883v2", "journal_reference": null, "doi": "10.1017/S1743921307009192", "fulltext": "Stellar Populations as Building Blocks of Galaxies\nProceedings IAU Symposium No. 241, 2007\nA. Vazdekis & R. Peletier\n\nc 2007 International Astronomical Union\nDOI: 00.0000/X000000000000000X\n\nStellar populations – the next ten years\nJ. Bland-Hawthorn\n\narXiv:astro-ph/0701883v2 8 Feb 2007\n\nAnglo-Australian Observatory, PO Box 296, Epping, NSW 2121, Australia\nAbstract. The study of stellar populations is a discipline that is highly dependent on both\nimaging and spectroscopy. I discuss techniques in different regimes of resolving power: broadband\nimaging (R∼4), intermediate band imaging (R∼16, 64), narrowband spectral imaging (R∼256,\n1024, 4096). In recent years, we have seen major advances in broadband all-sky surveys that are\nset to continue across optical and IR bands, with the added benefit of the time domain, higher\nsensitivity, and improved photometric accuracy. Tunable filters and integral field spectrographs\nare poised to make further inroads into intermediate and narrowband imaging studies of stellar\npopulations. Further advances will come from AO-assisted imaging and imaging spectroscopy,\nalthough photometric accuracy will be challenging. Integral field spectroscopy will continue to\nhave a major impact on future stellar population studies, extending into the near infrared once\nthe OH suppression problem is finally resolved. A sky rendered dark will allow a host of new\nideas to be explored, and old ideas to be revisited.\n\n1. Introduction\nThis conference has provided us with a timely reminder of why stellar population\nstudies continue to generate great interest in our quest to understand stellar/galactic\nformation and evolution. In a recent summary, we reviewed the case for resolved stellar\npopulation studies (Bland-Hawthorn & Freeman 2006), and so refrain from repeating\nthese arguments here; another perspective is offered by Wyse & Gilmore (2006). The\nimportance of near field studies has been stressed most recently by Springel, Frenk &\nWhite (2006):\nAt present, the strongest challenge to ΛCDM arises not from the large-scale\nstructure, but from the small-scale structure within individual galaxies. It is a real\npossibility that the model could be falsified by measurements of the distribution\nand kinematics of matter within galaxies...\nThe detailed study of the stellar content of galaxies is well grounded in cosmology. The\nfield exploits many observational techniques across almost the full electromagnetic spectrum. The observations are so rich in detail that they present both theorists and simulators with a strong challenge, i.e. to establish useful empirical models that provide a\ncontext for these data, and identify those observations that are of primary importance. It\nis no exaggeration to say that contemporary data far outstrip theory and simulation: our\nunderstanding of the observations is very rudimentary when we consider even simplified\ntoy models (e.g. closed vs. open box), and especially so within the context of the ΛCDM\nparadigm.\nBut here I concentrate on the observational techniques and address in part how these\nare motivated by the scientific questions. Given that we are already overwhelmed by vast\nimaging data sets, is there a case for considering new approaches to data collection? In\nshort, the answer must be yes. More sophisticated techniques can yield better data that\nin turn shed light on the existing data sets, and may even simplify the paradigm rather\nthan complicate it further. It is often the case that more and better data can reveal\n1\n\n\f2\n\nBland-Hawthorn\n\nweak effects that are of paramount importance to our basic understanding, a fact well\nunderstood by medical science and an issue that we return to below.\nMuch like mathematical physicists who utilize the properties of discrete or continuous\nfunctions, a stellar populations researcher has the option to study discrete (point source\nphotometry) or continuous (diffuse light / surface photometry) data. Nowadays, this\ndistinction is somewhat artificial in that both frequently arise in the same observations;\noften one is removed to get to the other, e.g. surface brightness fluctuations (SBF) and the\nremoval of point sources. It is worth noting that studies of resolved stellar populations\nin excellent seeing are now achieving effective surface brightness levels that are well\nbelow those of surface photometry (Brown et al 2003; Bland-Hawthorn et al 2005, see\nAppendix).\nImaging techniques, in particular imaging spectroscopy, will continue to develop in the\nyears ahead. The review focuses on resolved studies of galaxies, rather than multi-object\nastrometry and spectroscopy (R > 5000) of Local Group galaxies that I will defer to\na separate review. I start with a reminder of the power of imaging science (including\nimaging spectroscopy) before addressing how it is likely to evolve in the years ahead. I\naddress new technologies and new concepts that may play an important role in future\nstellar population studies, before suggesting new avenues for future research.\n\n2. Imaging science – what is it good for?\nThis meeting has provided an opportunity to review what are the essential characteristics of data that advance our understanding of stellar populations. A familiar proverb\nis that a picture is worth a thousand words. Our images captivate the imagination of\nthe general public, and astronomers have exploited this to great effect in recent years,\nas witnessed by ongoing public support for the Hubble Space Telescope (HST). But astronomical machines are sold on the scientific return, and from these images we learn\nabout stellar structures and morphologies, subcomponents (e.g. bulges), substructures\n(e.g. streams), small-scale vs. large-scale power, and asymmetries, gradients and profiles.\nThe emergence of imaging spectroscopy (IFU, tunable filter) is a result of the community wanting the photometric integrity of direct imaging, with the benefits of spectroscopic information across the field. Imaging spectroscopy provides significant advantages\nover conventional slit techniques, and are less prone to losses and artefacts due to seeing (Cecil 2006). We explore this topic in more detail below, and conclude that imaging\nspectroscopy will become more firmly entrenched in the next decade.\nSince the 1960s, we have mastered the use of broadband images to obtain limited\ninformation on stellar temperatures, luminosity, surface gravity, mass, ages, dust content\nand star formation history (for a recent review, see Bessell 2005). What is generally true\nis that more spectral bands over a broader spectral baseline provide more information of\nthe sources under study†. Thus, we make use of intermediate (e.g. Stromgren filters) and\nnarrow spectral bands to provide more specific information, in particular, better spectral\nclassification (e.g. Geneva-Copenhagen survey: Nordstrom et al 2004) or galaxy typing\n(e.g. COMBO-17 survey: Wolf et al 2003).\nWhat is clear is the continued importance of the broadest possible spectral baseline\nin stellar population studies. The Balmer jump (u band) region provides temperatures\nof OB stars and surface gravities of cool stars, and metallicity information for stellar\ntype F and later. In combination with the u band, a b or g filter provides metallicity\ninformation for stellar type A and later. Filter bands spaced further apart provide tem† This assertion can be difficult to argue if the sensitivities in the narrower bands lead to\nmarginal detections, e.g. continuum sources vs. emission-line sources.\n\n\fImaging science and stellar populations: a short review\n\n3\n\nperature information that is moderately independent of metallicity and gravity. Accurate\nK band stellar photometry, in combination with optical bands, can be used to unravel the\nage-metallicity degeneracy, and provide more precise corrections for stellar extinction.\n\n3. Photometric precision\nA central tenet of the applied sciences that simply measuring the same old quantities\nto increasing levels of precision will often yield fundamentally new physical insight†. A\ngood discussion of what is required to achieve this in astronomical photometry is given\nby Stubbs & Tonry (2006). The power of photometric precision is well demonstrated by\nthe Sloan Digital Sky Survey (Gunn et al 2006) that achieved 5σ depths of (u, g, r, i, z)\n= (22.0, 22.2, 22.2, 21.3, 20.5). The SDSS is comparable in depth and sampling to the\nall-sky surveys of the UK Schmidt (UKST) and Oschin Schmidt telescopes during the\n1980s. However, the SDSS magnitude and colour precision is unrivalled at (r, u − g, g −\nr, r − i, i − z) = (2%, 3%, 2%, 2%, 3%), a fact that has led to an extraordinary bounty\nof new results. A similar comparison can be made between the space-borne Galex UV\n(Martin et al 2003) and the Ultraviolet Imaging Telescope surveys.\nArguably, precision photometry has provided the greatest impetus to the study of\nstellar populations in recent years. In resolved stellar imaging, examples include the use\nof non-parametric methods to derive believable star formation histories in nearby dwarf\ngalaxies (Aparicio, this meeting) and in Local Group galaxies (Brown et al 2006). In\nphotometric imaging, some of the most impressive uses of precision photometry involve\ndistance determinations for galaxies: e.g. cepheid distances (Freedman et al 2001); surface\nbrightness distances to galaxies (Tonry et al 2001) and its close cousin, \"tip of the red\ngiant branch\" distance estimates (Tully et al 2006). At much higher redshift, other uses\ninclude redshift determination through the photometric drop-out technique (Steidel et\nal 1996). All of these techniques exploit known properties of the stellar populations.\nIf our goal is to learn more about a source by dividing up the spectral domain into more\nbands, this requires a higher level of photometric precision within and between the bands.\nThis is because the errors combine in quadrature and quickly propagate through the\nanalysis when one wants to compare complex intercombinations of photometric colours.\nPushing to even higher levels of precision, there is a strong case to be made for submillimag photometry of hundreds of thousands of stars in order to establish accurate\nrelative ages through asteroseismology. This was the primary motivation for the ESA\nEddington satellite which is unfunded at the present time. Science in the time domain is\nbroached in the following section.\n\n4. Imaging science – how will it evolve?\nTime domain. The time domain is clearly an area of parameter space that has been\nbarely explored to date. The MACHO project (Alcock et al 1997) taught us that there\nis much to be learnt from stellar populations through variability studies.\nTwo important survey projects, Pan-STARRS‡ (north) and the Large Synoptic Survey Telescope (south), are set to dominate the optical landscape in the next decade by\n† Dyson (1999) has argued that modern science began in 1729 with Bradley's astrometric\nmeasurements that were recorded with an accuracy of 6 significant figures. Bradley first established that the Copernican view was correct, detected stellar aberration due to the Earth's\nmotion, and measured the speed of light to an accuracy of 1%. In the next century, Michelson\nspent several decades measuring the higher order aberration coefficients with ever-increasing\nprecision, with profound consequences for physics.\n‡ A related project in the southern hemisphere is SkyMapper, essentially a single Pan-STARRS telescope at Siding Spring Observatory.\n\n\f4\n\nBland-Hawthorn\n\nextending beyond SDSS both in the time domain and in source sensitivity (combined\nexposures). The first of these will make use of four 1.8m telescopes, each with a 3◦ field.\nPan-STARRS will repeatedly survey the sky with 30-60 sec exposures and achieve a\nsingle-exposure depth of 24.0 AB mag (5σ). The LSST is a single 8.4m telescope with a\n3.3◦ field that will survey the sky in 15 sec exposures, with a single-exposure depth of\n24.0 AB mag (6.5σ). Both surveys will make use of g, r, i, z filters with an additional red\ny filter for the LSST. The survey étendue (area × solid angle, AΩ) of Pan-STARRS and\nLSST is 60 and 190 respectively.\nBoth LSST and Pan-STARRS will reveal an extraordinary richness of new data across\nthe sky, inter alia, identifying homogeneous stellar populations (miras, cepheids, etc.)\nby their distinct temporal behaviour, proper motions, colours, etc. These populations in\nturn will provide age and metallicity information as a function of position throughout\nLocal Group galaxies (Luck et al 2006). One of the enduring legacies of these surveys will\nbe the prospect of selecting clean stellar populations untainted by unresolved binaries;\nthe binary fraction can easily exceed 25% in a typical population.\nNew deep wide-field surveys. The upcoming UKIRT Infrared Deep Sky Survey\n(UKIDSS; north) and Visible and Infrared Survey Telescope for Astronomy (VISTA;\nsouth) both utilize IR-optimized 4m telescopes in order to provide deep ZY JHKS band\nphotometry over large swaths of the sky. The UKIDSS Large Area Survey will reach 18.4\nmag (5σ) for stellar sources over a 4000 deg2 field, and 0.5 mag deeper for 3200 deg2 in\ngalactic fields. This is to be compared with the 2MASS and DENIS all-sky surveys that\nreached 14.2 and 14.0 mag respectively. But first off the ranks will be the VLT Survey\nTelescope (VST 2.6m) which becomes operational in 2007. The OmegaCAM imager has\na 1◦ field and will supply good-seeing SDSS-style data over a 4500 deg2 field.\nOther noteworthy systems are the IMACS imager on the Magellan 6.5m telescope,\nand the SuprimeCam imager on the Subaru 8.2m telescope. SuprimeCam sits at the f/2\nfocus and has an AΩ product of about 9 (Miyazaki et al 2002). Remarkably, engineers\nat Canon Inc. believe that the étendue can be increased by an order of magnitude − the\nso-called HyperSuprimeCam concept − which would have comparable survey power to\nPan-STARRS. But the primary science driver for the Subaru cameras is deep multiband\noptical exposures for observational cosmology, and these share the telescope with a host\nof other instruments, unlike the dedicated imagers on Pan-STARRS.\nIntermediate band all-sky surveys. In an era of precision photometry, it would seem\nan appropriate time to revisit the power of intermediate band photometry for identifying\nspecific populations. This was to be a mainstay of the ESA GAIA satellite mission in the\nnext decade. But in its latest incarnation, the intermediate photometric filters will not\nbe employed. This is unfortunate as we will still need precise photometry for the billion\nor more sources to be targetted by this important astrometric mission (Perryman et al\n2001; Wilkinson et al 2005). It is clear however that the 5−6D phase space information\nwill have a huge impact on our understanding. The mission will allow for millions of\nstars to be characterised by their distance, spectral type, luminosity and so forth. It is\ninteresting to observe the scientific impact of even relatively crude photometric distances\nto stars (e.g. SDSS tomography of the Galaxy; Juric et al 2005).\nShort-term gains: fourfold increase in AΩ. Conventionally, we build large imaging\nmosaics to work in fast beams in order to enhance the étendue of an imaging survey.\nThe unvignetted field however is typically larger but not fully exploited to minimize the\ncost of detector real estate. For future wide-field instruments, it may be interesting to\nask whether full Nyquist sampling is required over the field, particularly with a view to\nthe dithering requirement in most applications today. If the pointing and guiding models\n\n\fImaging science and stellar populations: a short review\n\n5\n\nare robust, can we simply match the median seeing to the pixel scale, and attempt to\ndouble the available field of view? If we dither with sub-pixel offsets, can we recover the\npsf (e.g. Fruchter & Hook 2002)? This is an experiment that is worth exploring.\nShort-term gains: fourfold increase in resolution and sampling. Driver and colleagues have amply demonstrated the advantage of even moderate improvements over\nthe SDSS in the median seeing. They used the Wide Field Camera on the INT 2.5m\nto image 10,000 galaxies over a 37 deg2 field complete to B ∼ 24 mag. Their median\nseeing is roughly a factor of 2 better than the SDSS (Lemon et al 2002) resulting in\nmarkedly better bulge-disk decompositions (Allen et al 2006). This emphasizes the importance of imaging cameras on good sites for resolved studies. My colleagues and I have\nrecently completed more than 40h of optical imaging on nearby galaxies using the GMOS\nimaging spectrograph on Gemini South with seeing in the range 0.55 − 0.65′′ over the\nfull 5.5′ field. Two hour exposures result in 3σ point source detections of 27.0 AB mag\n(Bland-Hawthorn et al 2005). Few galaxies have been mapped to this level of sensitivity.\nImportant exceptions are the few nearby galaxies that have been studied with the HST,\nas we have seen at this meeting.\nSub-arcsecond imaging over the widest possible field. We have barely begun to\nexploit wide-field imagers on the best observing sites to study nearby galaxies. The LSST,\nPan-STARRS and VISTA surveys are expected to achieve ≈0.7′′ FWHM median image\nquality, although a smaller subset of observations at lower sensitivity may achieve 0.5′′\nFWHM.\nConsistently higher quality data will require dedicated photometric imagers. Both\nMagellan IMACS and Subaru SuprimeCam have recorded <0.5′′ psf FWHM in optical\nbands over their half-degree fields. A superior system is the HyperSuprimeCam facility\nnow under discussion at Subaru: there is the prospect of achieving a 2◦ corrected field at\nthe prime focus of this 8m telescope! Facilities like these are needed to observe of order\n10,000−100,000 galaxies to examine the environmental influences on galaxies, and more\nspecifically stellar populations within individual components.\nBeyond the well established morphology/luminosity dependencies on environment,\nBlanton et al (2006) and Park et al (2006) assert that the environmental influences on\nSDSS galaxies are very weak. But it is likely that higher resolution imaging of these large\ngalaxy samples will reveal stronger influences once the different galactic components are\nproperly separated.\nStellar population studies will always benefit from improved image quality. When\nstudying the resolved stellar populations, the problem remains even at 0.5′′ FWHM of\ndistinguishing stars from background galaxies, particularly in the diffuse outer parts of\nnearby galaxies (see Ellis & Bland-Hawthorn (2007) for a detailed analysis of this point −\nthe GalaxyCount java calculator is freely available at www.aao.gov.au/astro/GalaxyCount).\nThis ambiguity all but disappears in HST studies. Clearly, there is a strong case for\na long-term HST program to target a large sample (∼ 100) of nearby galaxies in a\nmagnitude-limited survey.\nNear diffraction-limited imaging over the widest possible field. There are numerous advantages to be gained from sampling at higher angular resolution, as evidenced\nby the extraordinary gains of HST with its small telescope aperture. The most important gains include: lower sky background per pixel, sources observed at higher intrinsic\nresolution, better star/galaxy and star/star separation. These are some of the reasons\nbehind the major investment in adaptive optics and the projected enormous investment\nin ELTs.\nBeyond Hubble, what prospects are there to achieve 60.25′′ seeing at optical/IR wave-\n\n\f6\n\nBland-Hawthorn\n\nlengths with a wide-field ground-based facility? At optical wavelengths, the only prospect\nunder discussion is the 2m PILOT survey proposed for Dome C in Antarctica (Burton\net al 2005). There has been talk of \"quasi\" HST-quality imaging from simple groundlayer correction, although it remains to be seen whether a 2m telescope located at 30m\nabove the snowpack can achieve this performance for a useful fraction of the time. The\nAustralian community is currently engaged in a study to look at the practicality of this\nproject with two commercial telescope builders. Such a facility could be devoted to the\nlong-term study of stellar populations in nearby galaxies, and indeed is one of the key\nscience drivers for the project.\nAn interesting case has been made for \"Lucky imaging\" whereby I band images are\nread out at high frame rates using a low-noise E2V Technologies L3CCD (Law, Mackay\n& Baldwin 2006). In the best conditions, they achieve diffraction limited images over\nroughly an arcminute using the NOT 2.6m, but the overall operational efficiency is low.\nAt IR wavelengths, things look more promising. Existing AO systems have begun to\ndeliver on science (see cfao.ucolick.org/links for links to these projects). The Keck AO\nsystem has produced more than 100 research papers over the past decade (Liu 2006).\nTypical Strehl ratios at K are 0.2 with a best operational value of 0.4. Both Gemini and\nthe VLT are close to commissioning multi-conjugate AO (MCAO) systems that promise\n0.2′′ image quality on 1-2′ scales. The Gemini-N Altair system combined with the near\nIR imager NIRI has been used to study stellar populations in M31 (Olsen et al 2006).\nThe system can achieve Strehl ratios of about 20-25% at H and K, with psf variations\n∼3% and photometric accuracies of ∼5% (Olsen 2006, private communication), both\nwith natural and laser guide stars. Soon, the MCAO f/30 focus will be available at\nGemini South and will produce a corrected field of 1′ , and a usable field of up to 2′ .\nThis focus will feed instruments such as the GSAOI infrared imager and the Flamingos-2\ninfrared spectrograph. Comparable performance is offered by the VLT/NACO system as\ndemonstrated by Cresci et al (2006) in a study of intermediate-redshift galaxies in 20\nfields close to natural guide stars.\nLiu (2006) provides a good discussion of the advantages of ground-based AO over HST\nin the near IR. These include the use of novel instruments, higher observing efficiency\n(although terrestrial weather is more of a hindrance than space weather), and 3-4× better\nspatial resolution in the near IR (0.05′′ fully corrected). In contrast, the disadvantages\nare the need for tip-tilt stars, a fully corrected field on sub-arcminute scales, and complex\nand variable psf leading to heterogenous data.\nBut do we need to achieve the diffraction limit for population studies? This is not\naltogether clear. In my opening remarks, I alluded to the importance of studying stellar\npopulations out to Virgo. It would seem that stellar crowding demands the smallest\npossible psf. The diffraction limit is really only achieved in practice at high Strehl ratios,\ni.e. where the 80% EE diameter is close to the angular diffraction limit. Existing groundbased studies suggest that this is going to be very difficult to achieve in J and H, and\nchallenging at K. However, in an important study, Olsen, Blum & Rigault (2003) find that\nhigh Strehl ratios may not be required in crowded fields because of the SBF contribution\nof unresolved stars.\nSo are there compelling science drivers for rigorously diffraction limited imaging (extreme AO), beyond that of identifying material and planets around nearby stars? A\nstrong case can be made for studies of the diffuse stellar populations in the vicinity of\ncompact sources (e.g. AGNs, SNe, GRBs), and in these rare instances, high Strehl ratios\nare probably called for.\nAccurate measurement with future space-based and ground-based imagers is going to\ndemand powerful software codes that take into account the variable psf properties over the\n\n\fImaging science and stellar populations: a short review\n\n7\n\nfield. The JWST psf will have the 6-pointer structure arising from the Fourier transform\nof the segmented mirrors. ELTs will have a similar psf structure, but compounded by\natmospheric distortion. One of the most serious of these is anisoplanatism, i.e. field\nvarying psf due to the slowly varying field angle as the source tracks across the sky.\nIt will take complex computer codes to restore the photometric accuracy (see the web\nsite cfao.ucolick.org/meetings/psf reconstruction for detailed discussions). The real gains\nin these codes are likely to come from incorporating the extra information from the\nwavefront sensor telemetry.\nConfigurable fields. We mentioned above that the available field at the focal plane\nof many telescopes is often much wider than the exploited field of existing instruments.\nDetector real estate, particularly IR arrays, is often a limiting cost in instrument design,\nparticularly so at IR and mid IR wavelengths.\nBut the imaged fields do not need to be defined by a contiguous region (BlandHawthorn et al 2004). Indeed, for high redshift fields (e.g. Hubble Ultra Deep Field\n[HUDF]), the information content can be as low as 5%, i.e. the fraction of pixels that\ncontain useful information. Several observatories, in particular the AAO, are working on\nrobotic positioners that would allow random patches of sky to be reformatted efficiently\nwith relay optics to be packed onto a wide-format detector. Such systems are likely to\nbe a feature of future instrument suites on ELTs, e.g. deployable IFU wide-field spectrographs (McGrath & Haynes 2006), and multi-object AO systems (MOAO; Hammer et\nal 2004).\nUltradeep imaging. Astronomers keenly await the awesome reach of the James Webb\nSpace Telescope (JWST) expected to launch in the middle of the next decade. In a recent\nreview, Gardner et al (2006) describe the scientific potential of this facility. The NIRCam\nimager will allow for diffraction limited, broadband and intermediate band imaging (R∼\n4, 10, 100) in the window 0.6 − 5μm for a field of view and pixel sampling comparable\nto the HST (2.2′ ×4.4′ ) but at much higher sensitivity, particularly in the mid IR. The\nMIRI camera will allow broadband imaging in the window 5 − 27μm over a 1.4′ ×1.9′\nfield.\nOn a similar timescale, we may expect to see results from one of the proposed groundbased extremely large telescopes (ELT), in particular, the 24.5m Giant Magellan Telescope (GMT), the 30m telescope (TMT) or the recently announced European 42m ELT\n(E-ELT). These telescopes will be optimized for near-infrared performance although will\nextend into the optical and mid-IR. At the diffraction limit, these telescopes will rival\nor even exceed the performance of the JWST, particularly if the OH suppression problem is finally resolved and the AO systems prove to be stable over arcmin-scale fields.\nIn practice, there will be major gains from combining ground-based AO imaging with\nspace-based imaging of the same source (e.g. Vacca et al 2007).\n\n5. Imaging spectrographs\nTunable imaging filters. I summarize the main technologies elsewhere (Bland-Hawthorn\n2000). The first general user tunable filter was the Taurus Tunable Filter (TTF) that was\noperated at the AAT 3.9m and WHT 4.2m during the years 1995−2003. The scientific\nlegacy is described in Bland-Hawthorn & Kedziora-Chudczer (2003).\nThere are several optical systems that are commissioned or close to commissioning\nthat are a direct consequence of the TTF. These include the Maryland-Magellan Tunable\nFilter (MMTF), the Osiris tunable filter on the GTC 10.2m (Cepa et al 2003), and the\nSALT Tunable Filter. The Osiris spectrograph is particularly powerful as it will provide\ntunable imaging (R=50−5000) and spectroscopic capability over the range 370 to 1000\n\n\fBland-Hawthorn\n\nmirror\n\nD type\n\nwindow\n\nGMOS\nGMOS\nNIFS\nGNIRS\nARGUS\nVIMOS\nSINFONI\nIMACS-IFU\nINTEGRAL\nOASIS\nSAURON\nSPIRAL\nSparsePak\nDensePak\nUIST\nPMAS\nWIFES\nCIRPASS\n\nGemini-N\nGemini-S\nGemini-N\nGemini-S\nVLT\nVLT\nVLT\nMagellan\nWHT\nWHT\nWHT\nAAT\nWIYN\nWIYN\nUKIRT\nCalar Alto\nANU\nCambridge\n\n8\n8\n8\n8\n8\n8\n8\n6.5\n4.2\n4.2\n4.2\n3.9\n3.5\n3.5\n3.8\n3.5\n2.3\n−\n\nOptical\nN 5×7, 5×3.5\nOptical\nN 5×7, 5×3.5\nIR\nAO 3×3\nIR\nN 3.2×4.8\nOptical\nN 11.5×7.3 or 6.6×4.2\nOptical\nN 54×54 or 13×13\nIR\nAO,N 8×8, 3×3, 0.8×0.8\nOptical\nN 6.9×5.0, 4.2×5.0\nOptical\nN 7.8×6.4, 33.6×29.4\nOptical AO,N 7.4×10.3, 2.7×3.7\nOptical\nN 41×33, 11×9\nOptical\nN 22×11\nOptical\nN 72×71(sparse)\nOptical\nN 30×45\nIR\nN 3.3×6.8\nOptical\nN 8×8\nOptical\nN 25×31\nIR\nAO,N 13×4.7, 9.3×3.5\n\nFibre\nFibre\nSlicer\nSlicer\nFibre\nFibre\nSlicer\nSlicer\nFibre\nLenslet\nLenslet\nFibre\nFibre\nFibre\nSlicer\nFibre\nSlicer\nFibre\n\nAO\n\nfield of view (′′ )\n\ninstrument\n\npixel scale (′′ ) R\n0.2\n0.2\n0.1\n0.15\n0.52, 0.3\n0.67, 0.3\n0.25−0.025\n0.2\n0.45, 2.70\n0.26, 0.09\n0.94, 0.27\n0.7\n4.7\n3\n0.24, 0.12\n0.5\n0.5\n0.36, 0.25\n\n1080−7100\n1080−7100\n5000\n1700−5900\n19000−39000\n200−2500\n1500−4000\n1800−10,000\n200−10,000\n200−4000\n3000\n1500−13,000\n5000−21,000\n5000−21,000\n1000−4000\n1500−8000\n3000−7000\n3000\n\nN&S\nN\nY\nN\nN\nN\nN\nN\nN\nN\nN\nN\nY\nN\nN\nN\nN\nN\nN\n\n8\n\nTable 1. A summary of operational integral field spectrographs. (1) instrument (2) telescope (3) telescope diameter in metres (4) technology (5)\nwavelength of operation (6) AO, natural seeing, or both (7) field of view in arcseconds (8) pixel scale in arcseconds (9) resolving power (10) nod &\nshuffle operation?\n\n\fImaging science and stellar populations: a short review\n\n9\n\nnm at high efficiency. The JWST will also incorporate a restricted tunable filter for use\nat infrared and mid-infrared wavelengths in the next decade.\nTunable filters are immensely powerful for conducting star formation studies in both\ndistant and nearby galaxies. The instruments are tuned to narrow bands in order to provide a very high contrast between emission lines and the neighbouring stellar continuum.\nHowever, Ryder, Fenner & Gibson (2005) demonstrate the power of tunable filter imaging in tracing variations in stellar abundance from absorption line variations over the\nface of galaxies. They tuned the TTF bandpass to an equivalent Lick index, and control\nbandpasses were observed to check the integrity of the measurement over the field. Both\nmethods are likely to be exploited extensively with the new facilities.\nIntegral field and image slicer spectrographs. The main technologies are reviewed\nin van Breugel & Bland-Hawthorn (2000); a variety of science drivers is discussed by\nCecil (2006), Morris et al (2006) and Sharp et al (2004). In Table 1, I list the main IFU\nspectrograph facilities in operation or soon to be realized.\nAs we have witnessed at this meeting, the SAURON project (TIGER concept) has\namply demonstrated the power of IFU spectroscopy for stellar population studies (McDermid et al 2006; Kuntschner et al 2006). Powerful general-user survey instruments like\nVIMOS on the VLT and the GMOS IFU on Gemini have begun to deliver excellent data\non nearby galaxies. Other facilities include INTEGRAL on the WHT 4.2m, SPIRAL at\nthe AAT 3.9m and the WIFES image slicer at the ANU 2.3m (2008). All of these are\nused in natural seeing, offer resolving powers of up to ∼few thousand, and have longest\ndimensions of about <30′′ . The VLT GIRAFFE instrument offers smaller IFU fields for\nmultiple targets.\nTable 1 shows the trend towards IFU spectrographs on 8m class telescopes, but the\npower of the 4m class facilities should not be underestimated. The 8m facilities give a\nfourfold increase in collecting area but the pixel solid angle is an order of magnitude\nsmaller typically. This is not an obvious gain given that the surface brightness of a galaxian stellar population is at or below the sky level, although the gains can be substantial\nfor cuspy core sources or bright emission line sources.\nInteresting recent developments are AO-assisted integral field spectrographs (Rutten,\nBenn & Mendez 2006), e.g. SINFONI at the VLT and NIFS at Gemini South. While the\nfields of view are small (64×32 format), the latest SINFONI observations of stellar populations and kinematics in distant galaxies show the enormous potential of these devices\n(Forster-Schreiber et al 2006). An exciting future facility is the MUSE IFU spectrograph\nslated for the VLT in 2012 (Henault et al 2003). This will have an incredible 300×300\nformat (0.2′′ pixels) offering comparable spectral resolutions at optical wavelengths over\nan arcmin field.\nObjective prism imaging. With a dark IR sky background, old ideas will need to\nbe revisited (Bland-Hawthorn 2006). An interesting future prospect is the NIRspec (15μm) and MIRI (5-10μm) objective prism spectroscopy on JWST. Both systems will\noffer R∼100 spectroscopy over a 3.1′ ×3.4′ and 1.4′ ×1.9′ field respectively with a pixel\nsampling of about 0.1′′ . In the next section, I broach another concept to demonstrate\nhow a dark sky can be exploited in new ways.\n\n6. MAXIMUS – a radical instrument concept\nOn the back of recent developments in photonics, I now propose a powerful new approach to imaging spectroscopy. The concept attempts to maximize the amount of useful\nspectral information over a field while minimizing the number of spectral resolution elements. It combines the power of imaging with the power of spectroscopy. I give only a\n\n\f10\n\nBland-Hawthorn\n\nsketch at this time to illustrate how a darkened night sky will allow us to explore new\ntechnological avenues.\nThe instrument retains the constant spatial sampling (i.e. matched to the corrected\nseeing) across the field, but adapts the spectral resolution to the average flux in a given\npixel. This 'prior information' is supplied either by a snapshot image or a deep image\nfrom another facility (e.g. HUDF)†.\nMAXIMUS makes use of three ongoing developments in photonics: (i) OH suppression\nthrough fibre Bragg gratings, (ii) integrated photonic circuits where a fibre feeds light\ndirectly into a small (∼few cm) integrated photonic spectrograph (Bland-Hawthorn &\nHorton 2006), (iii) photonic networks or switchyards.\nWith the night sky removed, one can now disperse individual pixels at a resolving power\nthat ensures the signal is fairly constant over the observed data cube. Light from the\ntelescope is reimaged by a microlens array onto a bundle of optical fibres. We suppress the\nnight sky in each fibre photonically (Bland-Hawthorn 2006) before directing individual\nfibres into an optical circuit with the appropriate spectral resolving power. Light from\nindividual fibres is switched to the appropriate circuits via photonic networks much like\nthose already in use by the telecomm industry.\nConsider a broadband image of a distant galaxy cluster with total counts ranging\nfrom 10 to 105 counts with a background count level of 10 counts, say. If all pixels are\ndispersed at R=4, the skewed SNR distribution spans from 3 to about 320. If all pixels are\ndispersed at R=4096, the spread is from 0.1 to 10. With the MAXIMUS approach, the\nSNR variation is only a factor of 3, i.e. from 3 to 10. This is a factor of 30 improvement\nin the use of spectral resolution elements and allows for much longer exposures, even in\nthe presence of bright sources (e.g. guide stars).\nFor the data content of a typical astronomical image (e.g. resolved stellar fields, galaxies), about 50% of pixels are observed in imaging mode (R∼4), 45% of pixels are dispersed\nat low spectroscopic resolution (R∼16, 64, 256), and about 5% are dispersed at intermediate and high resolution (R∼1024, 4096). There is a conservation principle at work here\nin that the required photonic circuits at higher resolving power are larger and therefore\nmore expensive, but fewer are needed. In our example, the cores of bright cluster galaxies\nand emission line sources will be resolved at high resolution, the outer parts at medium\nresolution, and distant faint blobs will have sufficiently low resolution to perform photometric redshifts, for example. The dark sky will be detected in single detector pixels in\norder to confirm that useful data have not been overlooked.\nThe cost of an instrument can be measured in terms of the number of resolution elements (spatial and spectral) that in turn relate to the total number of detector pixels.\nAssuming that the photonic technologies are realized, this concept may provide the necessary step to realizing the Million Element Integral Field spectrograph (MEIFU) first\nproposed by the University of Durham (Content, Morris & Dubbeldam 2003). Preliminary calculations suggest that, for the same overall information content, MAXIMUS may\nrequire roughly 30 times fewer resolution elements than a traditional MEIFU design at\na fixed resolving power.\n\n7. Concluding remarks\nOver the next ten years, we can look forward to a time of deep, wide-field imaging\nsurveys from UV to infrared wavelengths, extending to the mid infrared in the next\ndecade. The time domain will identify different populations through stellar variability.\n† One can envisage variants where the spatial binning is varied over the field to conserve flux,\nmuch like adaptive binning techniques at x-ray wavelengths.\n\n\fImaging science and stellar populations: a short review\n\n11\n\nThere is a real need for large surveys of galaxies observed in sub-arcsecond conditions,\nat optical and infrared wavelengths. This will become possible for the first time with\nthe Pan-STARRS and LSST surveys at optical wavelengths, and with the VISTA and\nUKIDSS surveys at IR wavelengths. But beyond these surveys, there is a pressing need\nfor large surveys of galaxies observed at 0.2′′ FWHM or better, particularly for resolved\nstellar work. The HST has already demonstrated the richness of information on these\nscales for Local Group galaxies. In the best seeing conditions, star counts in the outer\nparts of galaxies are achieving effective surface brightness levels far below what is possible\nwith diffuse light imaging. With the successful commissioning of near-IR MCAO systems,\nit is likely that the community will look to push AO systems into the red optical region.\nSince the number of actuators goes as a high power of the photon energy, this will be\nchallenging.\nBeyond broadband imaging, the integral field spectrograph (and variant) will continue\nto play a crucial role, particularly when assisted by adaptive optics. These offer great\nadvantages that we have barely begun to explore. In the next decade, we will see these\nused over wider fields of view, and with increased functionality (e.g. field configurations).\nIFUs will be fundamental to ELT operation for a host of reasons, e.g. correcting for\ndeficiencies to high-order atmospheric refraction that cannot be compensated by the\nfield corrector. There is also the exciting prospect of completely suppressing the dominant\nOH signal such that an IFU can achieve sensitivity on a par with the JWST at near-IR\nwavelengths (Bland-Hawthorn 2006).\nAre there obvious technological arenas that we are not fully exploiting? There is not the\nspace to discuss this question in depth but there are a few that come to mind. Optical\ninterferometry has immense potential, both in terms of existing planned facilities at\nthe Keck and VLT, and proposed arrays that could challenge ELTs. Another area is\nmultiband simultaneity, i.e. observing the same patch of sky with wide-field detectors\nin multiple bands simultaneously, a concept that is exploited by digital cameras. The\nincreased miniaturization of integrated circuitry means that we can cram more logic\ninto each detector pixel (e.g. active pixel sensing). Tonry & Luppino (2000) raise the\nprospect of an arrty of microprisms that disperse light over complex pixel structures.\nOne can envisage equivalent technologies, i.e. a cascade of beam splitters that divide\nup the spectrum and redirect the light to different wide-field detectors. An alternative\nstrategy is to use layered materials that have increasing opacity to the incoming photons\nwith material depth.\nBut for now, the largest gains are unlikely to come from advances in detector technology. The community awaits wide-field AO systems on the 8-10m ground-based telescope,\nthe refurbishment of HST with WFC3, and four large survey telescopes on sub-arcsecond\nsites. Beyond here, there is the prospect of JWST and one or more ELTs, all of which\noffer extraordinary gains over existing systems. There are enormous technological challenges to be overcome, not least the problem of realizing stable and accurate AO-assisted\nphotometry with extremely large telescopes.\nAcknowledgements\nI am indebted to S.D. Ryder for comments on this manuscript, and to R.G. Sharp\n(AAO) for preparing Table 1 and for his insights on IFU spectroscopy.\nReferences\nAlcock, C., et al. 1997, ApJ, 486, 697\nAllen, P. D., Driver, S. P. et al. 2006, MNRAS, 371, 2\n\n\f12\n\nBland-Hawthorn\n\nBessell, M. S. 2005, ARAA, 43, 293\nBland-Hawthorn, J. 2000, ASP Conf. Ser. 195: Imaging the Universe in 3D, 195, 34\nBland-Hawthorn, J., & Kedziora-Chudczer, L. 2003, PASP, 20, 242\nBland-Hawthorn, J. et al. 2004, SPIE, 5492, 242\nBland-Hawthorn, J., Vlajić, M., Freeman, K. C., & Draine, B. T. 2005, ApJ, 629, 239\nBland-Hawthorn, J., & Horton, A. 2006, SPIE, 6269, 21\nBland-Hawthorn, J. 2006, New Astronomy Review, 50, 75\nBland-Hawthorn, J., & Freeman, K. C. 2006, Mem. della Soc. Astron. Italiana, 77, 1095\nBlanton, M. R., Berlind, A. A., & Hogg, D. W. 2006, arXiv:astro-ph/0608353\nBrown, T. M. et al. 2006, ApJ, 652, 323\nBurton, M. G., et al. 2005, PASP, 22, 199\nCecil, G. 2006, New Astronomy Reviews, 49, 553\nCepa, J., et al. 2003, SPIE, 4841, 1739\nContent, R., Morris, S. L., & Dubbeldam, M. 2003, SPIE, 4842, 174\nCresci, G. et al. 2006, A&A, 458, 385\nDyson, F., 1999, Nat, 400, 27\nEllis, S. C., & Bland-Hawthorn, J. 2006, arXiv:astro-ph/0602573\nFörster Schreiber, N. M., et al. 2006, ApJ, 645, 1062\nFreedman, W. L., et al. 2001, ApJ, 553, 47\nFruchter, A. S., & Hook, R. N. 2002, PASP, 114, 144\nGardner, J. P., et al. 2006, SPIE, 6265, 17\nGunn, J. E., et al. 2006, AJ, 131, 2332\nHammer, F., et al. 2004, SPIE, 5382, 727\nHenault, F., et al. 2003, SPIE, 4841, 1096\nJuric, M., et al. 2005, arXiv:astro-ph/0510520\nKuntschner, H., et al. 2006, MNRAS, 369, 497\nLaw, N. M., Mackay, C. D., & Baldwin, J. E. 2006, A&A, 446, 739\nLemon, D. J., Wyse, R. F. G., Liske, J., Driver, S. P., & Horne, K. 2004, MNRAS, 347, 1043\nLiu, M. C. 2006, SPIE, 6272, L14\nLuck, R. E., Kovtyukh, V. V., & Andrievsky, S. M. 2006, AJ, 132, 902\nMartin, C., et al. 2003, SPIE, 4854, 336\nMcDermid, R. M., et al. 2006, MNRAS, 373, 906\nMcGrath, A., & Haynes, R. 2006, SPIE, 6273, 57\nMiyazaki, S., et al. 2002, PASJ, 54, 833\nMorris, S. L., Gerssen, J., Swinbank, M., & Wilman, R. 2006, New Astronomy Review, 49, 488\nNordström, B., et al. 2004, A&A, 418, 989\nOlsen, K. A. G., Blum, R. D., & Rigaut, F. 2003, AJ, 126, 452\nOlsen, K. A. G. et al. 2006, AJ, 132, 271\nPark, C. et al. 2006, arXiv:astro-ph/0611610\nPerryman, M. A. C., et al. 2001, A&A, 369, 339\nRutten, R., Benn C.R., & Mendez J., New Astronomy Reviews, 49, 487\nRyder, S. D., Fenner, Y., & Gibson, B. K. 2005, MNRAS, 358, 1337\nSharp, R. G. et al. 2004, Astronomische Nachrichten, 325, 108\nSpringel, V., Frenk, C. S., & White, S. D. M. 2006, Nat, 440, 1137\nSteidel, C. C. et al. 1996, ApJL, 462, L17\nStubbs, C. W., & Tonry, J. L. 2006, ApJ, 646, 1436\nTonry, J. L., & Luppino, G. A. 2000, ASP Conf. Ser. 195: Imaging the Universe in 3D, 195, 479\nTonry, J. L. et al. 2001, ApJ, 546, 681\nTully, R. B., et al. 2006, AJ, 132, 729\nVacca, W. D., Sheehy, C. D., & Graham, J. R. 2007, arXiv:astro-ph/0701628\nvan Breugel, W., & Bland-Hawthorn, J. 2000, PASP, 112, 579\nWilkinson, M. I., et al. 2005, MNRAS, 359, 1306\nWolf, C. et al. 2003, A&A, 401, 73\nWyse, R. F. G., & Gilmore, G. 2006, IAU Symposium, 232, 140\n\n\f"}