{"id": "http://arxiv.org/abs/astro-ph/0509857v2", "guidislink": true, "updated": "2005-12-26T10:27:25Z", "updated_parsed": [2005, 12, 26, 10, 27, 25, 0, 360, 0], "published": "2005-09-28T20:07:54Z", "published_parsed": [2005, 9, 28, 20, 7, 54, 2, 271, 0], "title": "The Case for Anisotropic Afterglow Efficiency within Gamma-Ray Burst\n  Jets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0509528%2Castro-ph%2F0509878%2Castro-ph%2F0509642%2Castro-ph%2F0509162%2Castro-ph%2F0509910%2Castro-ph%2F0509560%2Castro-ph%2F0509364%2Castro-ph%2F0509511%2Castro-ph%2F0509564%2Castro-ph%2F0509273%2Castro-ph%2F0509730%2Castro-ph%2F0509061%2Castro-ph%2F0509019%2Castro-ph%2F0509683%2Castro-ph%2F0509758%2Castro-ph%2F0509544%2Castro-ph%2F0509847%2Castro-ph%2F0509747%2Castro-ph%2F0509820%2Castro-ph%2F0509339%2Castro-ph%2F0509275%2Castro-ph%2F0509900%2Castro-ph%2F0509653%2Castro-ph%2F0509161%2Castro-ph%2F0509077%2Castro-ph%2F0509816%2Castro-ph%2F0509613%2Castro-ph%2F0509824%2Castro-ph%2F0509437%2Castro-ph%2F0509883%2Castro-ph%2F0509736%2Castro-ph%2F0509610%2Castro-ph%2F0509072%2Castro-ph%2F0509666%2Castro-ph%2F0509263%2Castro-ph%2F0509392%2Castro-ph%2F0509542%2Castro-ph%2F0509546%2Castro-ph%2F0509393%2Castro-ph%2F0509276%2Castro-ph%2F0509399%2Castro-ph%2F0509858%2Castro-ph%2F0509464%2Castro-ph%2F0509550%2Castro-ph%2F0509534%2Castro-ph%2F0509652%2Castro-ph%2F0509020%2Castro-ph%2F0509540%2Castro-ph%2F0509831%2Castro-ph%2F0509204%2Castro-ph%2F0509857%2Castro-ph%2F0509890%2Castro-ph%2F0509860%2Castro-ph%2F0509782%2Castro-ph%2F0509767%2Castro-ph%2F0509084%2Castro-ph%2F0509513%2Castro-ph%2F0509800%2Castro-ph%2F0509349%2Castro-ph%2F0509029%2Castro-ph%2F0509797%2Castro-ph%2F0509329%2Castro-ph%2F0509231%2Castro-ph%2F0509295%2Castro-ph%2F0509133%2Castro-ph%2F0509163%2Castro-ph%2F0509848%2Castro-ph%2F0509224%2Castro-ph%2F0509374%2Castro-ph%2F0509404%2Castro-ph%2F0509395%2Castro-ph%2F0509469%2Castro-ph%2F0509569%2Castro-ph%2F0509190%2Castro-ph%2F0509280%2Castro-ph%2F0509051%2Castro-ph%2F0509268%2Castro-ph%2F0509537%2Castro-ph%2F0509584%2Castro-ph%2F0509192%2Castro-ph%2F0509791%2Castro-ph%2F0509012%2Castro-ph%2F0509266%2Castro-ph%2F0509213%2Castro-ph%2F0509002%2Castro-ph%2F0509356%2Castro-ph%2F0509692%2Castro-ph%2F0509597%2Castro-ph%2F0509499%2Castro-ph%2F0509225%2Castro-ph%2F0509354%2Castro-ph%2F0509552%2Castro-ph%2F0509828%2Castro-ph%2F0509615%2Castro-ph%2F0509756%2Castro-ph%2F0509144%2Castro-ph%2F0509212%2Castro-ph%2F0509177%2Castro-ph%2F0509387%2Castro-ph%2F0509599%2Castro-ph%2F0509138&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Case for Anisotropic Afterglow Efficiency within Gamma-Ray Burst\n  Jets"}, "summary": "Early X-ray afterglows recently detected by {\\it Swift} frequently show a\nphase of very shallow flux decay lasting from $\\sim 10^{2.5} $s up to $\\sim\n10^4 $s, followed by a steeper, more familiar decay. We suggest that the flat\nearly part of the light curve may be a combination of the decaying tail of the\nprompt emission and the delayed onset of the afterglow emission observed from\nviewing angles slightly outside the edge of the region within the jet with\nprominent afterglow emission, as predicted previously. This would imply that a\nsignificant fraction of viewers get very little external shock energy along\ntheir line of sight, and, therefore, see a very high $\\gamma$-ray to kinetic\nenergy ratio at early times. The early flat phase in the afterglow light curve\nimplies, in a rather robust and model independent manner, a very large\n$\\gamma$-ray efficiency, typically $\\gtrsim 90%$, which is very difficult to\nextract from baryons by internal shocks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0509528%2Castro-ph%2F0509878%2Castro-ph%2F0509642%2Castro-ph%2F0509162%2Castro-ph%2F0509910%2Castro-ph%2F0509560%2Castro-ph%2F0509364%2Castro-ph%2F0509511%2Castro-ph%2F0509564%2Castro-ph%2F0509273%2Castro-ph%2F0509730%2Castro-ph%2F0509061%2Castro-ph%2F0509019%2Castro-ph%2F0509683%2Castro-ph%2F0509758%2Castro-ph%2F0509544%2Castro-ph%2F0509847%2Castro-ph%2F0509747%2Castro-ph%2F0509820%2Castro-ph%2F0509339%2Castro-ph%2F0509275%2Castro-ph%2F0509900%2Castro-ph%2F0509653%2Castro-ph%2F0509161%2Castro-ph%2F0509077%2Castro-ph%2F0509816%2Castro-ph%2F0509613%2Castro-ph%2F0509824%2Castro-ph%2F0509437%2Castro-ph%2F0509883%2Castro-ph%2F0509736%2Castro-ph%2F0509610%2Castro-ph%2F0509072%2Castro-ph%2F0509666%2Castro-ph%2F0509263%2Castro-ph%2F0509392%2Castro-ph%2F0509542%2Castro-ph%2F0509546%2Castro-ph%2F0509393%2Castro-ph%2F0509276%2Castro-ph%2F0509399%2Castro-ph%2F0509858%2Castro-ph%2F0509464%2Castro-ph%2F0509550%2Castro-ph%2F0509534%2Castro-ph%2F0509652%2Castro-ph%2F0509020%2Castro-ph%2F0509540%2Castro-ph%2F0509831%2Castro-ph%2F0509204%2Castro-ph%2F0509857%2Castro-ph%2F0509890%2Castro-ph%2F0509860%2Castro-ph%2F0509782%2Castro-ph%2F0509767%2Castro-ph%2F0509084%2Castro-ph%2F0509513%2Castro-ph%2F0509800%2Castro-ph%2F0509349%2Castro-ph%2F0509029%2Castro-ph%2F0509797%2Castro-ph%2F0509329%2Castro-ph%2F0509231%2Castro-ph%2F0509295%2Castro-ph%2F0509133%2Castro-ph%2F0509163%2Castro-ph%2F0509848%2Castro-ph%2F0509224%2Castro-ph%2F0509374%2Castro-ph%2F0509404%2Castro-ph%2F0509395%2Castro-ph%2F0509469%2Castro-ph%2F0509569%2Castro-ph%2F0509190%2Castro-ph%2F0509280%2Castro-ph%2F0509051%2Castro-ph%2F0509268%2Castro-ph%2F0509537%2Castro-ph%2F0509584%2Castro-ph%2F0509192%2Castro-ph%2F0509791%2Castro-ph%2F0509012%2Castro-ph%2F0509266%2Castro-ph%2F0509213%2Castro-ph%2F0509002%2Castro-ph%2F0509356%2Castro-ph%2F0509692%2Castro-ph%2F0509597%2Castro-ph%2F0509499%2Castro-ph%2F0509225%2Castro-ph%2F0509354%2Castro-ph%2F0509552%2Castro-ph%2F0509828%2Castro-ph%2F0509615%2Castro-ph%2F0509756%2Castro-ph%2F0509144%2Castro-ph%2F0509212%2Castro-ph%2F0509177%2Castro-ph%2F0509387%2Castro-ph%2F0509599%2Castro-ph%2F0509138&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Early X-ray afterglows recently detected by {\\it Swift} frequently show a\nphase of very shallow flux decay lasting from $\\sim 10^{2.5} $s up to $\\sim\n10^4 $s, followed by a steeper, more familiar decay. We suggest that the flat\nearly part of the light curve may be a combination of the decaying tail of the\nprompt emission and the delayed onset of the afterglow emission observed from\nviewing angles slightly outside the edge of the region within the jet with\nprominent afterglow emission, as predicted previously. This would imply that a\nsignificant fraction of viewers get very little external shock energy along\ntheir line of sight, and, therefore, see a very high $\\gamma$-ray to kinetic\nenergy ratio at early times. The early flat phase in the afterglow light curve\nimplies, in a rather robust and model independent manner, a very large\n$\\gamma$-ray efficiency, typically $\\gtrsim 90%$, which is very difficult to\nextract from baryons by internal shocks."}, "authors": ["David Eichler", "Jonathan Granot"], "author_detail": {"name": "Jonathan Granot"}, "author": "Jonathan Granot", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/503667", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0509857v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0509857v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Revised version, submitted to ApJ", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0509857v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0509857v2", "journal_reference": "Astrophys.J.641:L5-L8,2006", "doi": "10.1086/503667", "fulltext": "The Case for Anisotropic Afterglow Efficiency within Gamma-Ray\nBurst Jets\n\narXiv:astro-ph/0509857v2 26 Dec 2005\n\nDavid Eichler1 and Jonathan Granot2\nABSTRACT\nEarly X-ray afterglows recently detected by Swift frequently show a phase of\nvery shallow flux decay lasting from ∼ 102.5 s up to ∼ 104 s, followed by a steeper,\nmore familiar decay. We suggest that the flat early part of the light curve may\nbe a combination of the decaying tail of the prompt emission and the delayed\nonset of the afterglow emission observed from viewing angles slightly outside the\nedge of the region within the jet with prominent afterglow emission, as predicted\npreviously. This would imply that a significant fraction of viewers get very little\nexternal shock energy along their line of sight, and, therefore, see a very high\nγ-ray to kinetic energy ratio at early times. The early flat phase in the afterglow\nlight curve implies, in a rather robust and model independent manner, a very\nlarge γ-ray efficiency, typically & 90%, which is very difficult to extract from\nbaryons by internal shocks.\nSubject headings: γ-rays: bursts - γ-rays: theory- blast waves\n\n1.\n\nIntroduction\n\nAlthough early models of fireballs (Goodman 1986) did not postulate baryons within, the\nexistence of baryons in γ-ray burst (GRB) fireballs was anticipated because the highly superEddington luminosities suggest that baryons are expelled. In fact, the baryonic component\nthat is expected to accompany such an outflow would quench the γ-ray emission. This\nrealization led to the popularization of a model for GRBs in which baryonic kinetic energy\nwas reclaimed at large radii by internal shocks to be used for making high energy particles\n(Levinson & Eichler 1993) and γ-rays (Mészáros & Rees 1994). This model postulated\nfewer baryons than expected from a-priori estimates of the super-Eddington flux-driven mass\n1\n2\n\nPhysics Department, Ben-Gurion University, Be'er-Sheva 84105, Israel; eichler@bgu.ac.il\n\nKavli Institute for Particle Astrophysics and Cosmology, Stanford University, P.O. Box 20450, Mail Stop\n29, Stanford, CA 94309; granot@slac.stanford.edu\n\n\f–2–\noutflow, but it did invoke baryons, or in any case matter that survived annihilation in the\ncompact regions closer to the central engine.\nThe above models should be contrasted with internal shocks models in which there\nare few baryons (Eichler 1994) where the role of the internal shocks, presumably near the\nphotosphere, is simply to non-thermalize the spectrum of γ-rays that dominate the energy\ncontent. In particular, the reclamation of baryonic kinetic energy by internal shocks for the\npurposes of making the prompt γ-radiation of the GRB itself (Mészáros & Rees 1994) led\nto the prediction that there should be a blast wave in the circumburst medium that would\ngenerate afterglow. The discovery of afterglow appeared to provide enormous support to the\ninternal shocks model of Mészáros & Rees (1994), who had predicted such an afterglow.\nOn the other hand, it has never been proven that the γ-rays and the ejecta are made by\nthe same components of the outflow. More generally, the ratio of γ-ray to baryonic energy per\nsolid angle may vary considerably within the outflow in a way that would have significant\nconsequences both for observations and for theories of GRB origin. One consequence of\nGRB baryon anisotropy would be lines of sight that are more favored than others for GRB\ndetection while others might be more favorable for seeing early afterglow. In this Letter, we\nargue in favor of this hypothesis. In §2 we present arguments in favor of baryon anisotropy.\nIn §3 we show that the combination of the decaying tail of the prompt emission and the\nflat early afterglow light curve from viewing angles slightly outside the edge of the region\nwithin the jet with prominent afterglow emission can produce the early flat decay phase of\nthe X-ray afterglows recently observed by Swift. Our conclusions are discussed in §4.\n\n2.\n\nArguments in Favor of Baryon Anisotropy within the Jet\n\nSeveral arguments have been put forth that the baryon richness of a GRB fireball relative\nto the γ-ray intensity varies with the viewing angle for a given fireball. Levinson & Eichler\n(1993) argued theoretically that the anatomy of a GRB is likely to be Poynting flux or γrays emerging from horizon-threading magnetic field lines, while the baryons might flow out\npredominantly near the periphery of the above, along field lines that thread the interface\nof the inner accretion disk and the event horizon. On field lines that thread the accretion\ndisk, which should also have a super-Eddington power output, there ought to be a \"slow\nsheath\" of baryons that, while being too baryon rich to yield a detectable GRB, would yield\na contribution to the afterglow and possibly a \"dirty fireball\". Several observations have\nalso been interpreted in the context of a dichotomy between the baryon poor flow lines and\nthe baryon rich ones. Scattering of γ-rays from baryon poor regions off more slowly moving\nbaryons could yield a weak spray of γ-rays at large angles. Such scattered emission would be\n\n\f–3–\na very small fraction (∼ 10−5 ) of the total, and would thus be detectable only for very nearby\nGRBs. Nevertheless, they would be detectable over a much larger solid angle, and would be\nmanifested as soft GRBs (no photons well above an MeV), with smooth light curves from\nnearby sources. GRB 980425 was a good example of such a GRB and was interpreted in this\nlight (Nakamura 1998; Eichler & Levinson 1999).\nAnother intriguing result of baryon anisotropy of the GRB fireball could be that the\nγ-ray emission itself - not just the baryonic content - could have a non-trivial angular profile.\nHere the details have not been worked out yet. It could be, for example, that most of the\nemission in the interior of the outflow is virgin Poynting flux, and that the γ-rays themselves are generated preferentially at the periphery of the fireball where the Poynting flux\nis somehow tapped by interaction with the slower baryonic sheath. It is also not yet established under what conditions virgin Poynting flux creates afterglow. If a necessary condition\nfor afterglow is that external protons can execute at least one gyroradius in the comoving\nframe within a proper hydrodynamic timescale, ∼ R/Γc, then the condition can be expressed\n(Eichler 2003) as Γ ≤ Σ1/3 , where Σ is the electric potential energy drop, eβBR, across the\nejecta in units of mp c2 , and B is the magnetic field in the lab frame. This would typically\nimply that Γ . 104 for GRBs. However, there are still several additional considerations that\ncould be relevant.\nIf the angular structure of the γ-ray emitting region is more complicated than a solid\ncone, then the fraction of the total solid angle from which the γ-rays are detectable that corresponds to off-beam viewing angles increases, thus making such lines of sight more probable.\nIn this regard, the Amati et al. (2002) and Ghirlanda et al. (2004) relations, which correlate\nthe spectral peak photon energy, Epeak , and the apparent isotropic equivalent energy, Eγ,iso ,\ncan both be explained as viewing angle effects (Eichler & Levinson 2004; Levinson & Eichler\n2005). GRBs with Epeak ≪ 1 MeV are interpreted as viewed off-beam at angles θ > Γ−1\nfrom the edge of the jet.1 This lowers both the observed Eγ,iso and Epeak in a way that\nconforms to the Amati relation (Eichler & Levinson 2004). Furthermore, the value of the\njet opening angle that is inferred from the observed break time in the afterglow and the\nobserved Eγ,iso is then slightly overestimated relative to its true value, because the observed\nEγ,iso is underestimated relative to its true value. When this slight overestimate is accounted\nfor, the Ghirlanda relation becomes equivalent to the Amati relation (Levinson & Eichler\n2005).2\n1\n2\n\nIn this case the observed photons are directed backwards in the comoving frame of the emitting plasma.\n\nNote that the Amati relation applies only if most (or in any case, a fixed fraction) of the total GRB\nenergy is emitted more or less isotropically in a high Lorentz factor frame. In cases such as GRB 980425,\nwhere only a small fraction, f ∼ Ωo /Ωf , (where Ωo and Ωf are the original and final opening angles of the\n\n\f–4–\nAnother recent piece of evidence for baryon anisotropy comes from the 2004 December\n27 giant flare from SGR 1806−20. The radio afterglow (Gaensler et al. 2005) that followed\nthis event has been interpreted as being powered by a baryonic mass outflow of ∼ 1025 g\n(Gelfand et al. 2005) that is probably driven from the neutron star surface. This tentative\nconclusion is based on the fact that if the required mass was, instead, dominated by swept\nup external medium, this would require a highly contrived and unrealistic external density\nprofile in order to explain the observed evolution of the source size, motion, and flux (Granot\net al. 2005). Furthermore, this outflow should have been only mildly relativistic, with Γβ ∼ 1,\nclose to the escape velocity from the surface of the neutron star (Granot et al. 2005). On\nthe other hand, such a large and mildly relativistic baryonic outflow would have (at least\npartly) obscured the prompt γ-rays from the flare had they been expelled in our direction.\nThe data can be reconciled, however, by the assumption that the baryons are ejected in some\ndirections and not others.\nEichler & Jontof-Hutter (2005) reconsidered the issue of blast efficiency, making the\nassumption that Epeak is determined mostly by the viewing angle effect. The blast efficiency\nwas computed by previous authors based on the X-ray afterglow at 10 hours. It was found\nthat when the ratio of blast energy to apparent γ-ray energy is tabulated for GRBs with\nknown redshifts, the ratio is of order unity but with a great deal of scatter. This scatter,\nhowever, is considerably reduced when the ratio of \"viewing angle corrected\" γ-ray energy,3\n3/2\n∝ Eγ /Epeak , is compared with blast wave energy, and the characteristic value of the γ-ray to\nkinetic energy ratio seems to be ∼ 7. That is, nearly 90% of the energy goes into radiation\n(γ-rays) and only about 10% − 15% goes into the blast wave.\nEven if the 90% gamma ray efficiency was the case for all GRB, this would raise serious\nproblems for the internal shocks model, in which the γ-ray energy is powered by whatever\nfraction of the baryonic kinetic energy can be radiated away by the internal shocks. In\nparticular, it would require the internal shocks to consistently radiate away nearly 90% of\nthe total energy within the observed photon energy range and consistently leave the same\nsmall fraction. It is hard to see how internal shocks, which are by nature erratic, could\nperform so efficiently and so consistently. Moreover, even if internal shocks could consistently\nconvert more than 90% of the kinetic energy into internal energy, they would still need to\nput more than 90% of the internal energy into electrons (and therefore < 10% into ions)\nscattered radiation) is presumed to be scattered by slowly moving (say non-relativistic) material to large\nangles, then the observed Eγ,iso is lowered by an additional factor f with no further change in Epeak , and\nsuch sources should be highly distinct outliers to the Amati relation, as they are observed to be.\n3\n\nThe form of this correction assumes that the Ghirlanda relation is due to viewing angle effects so that\n3/2\nthe factor Epeak is taken to be a measure of the Doppler factor that corresponds to the viewing offset angle.\n\n\f–5–\nwhich could radiate this energy within the dynamical (i.e. expansion) time. Although there\nin no definitive model for supercritical ultra-relativistic shocks, this requirement would run\ncontrary to theoretical expectations. To make matter worse, Eichler and Jontof-Hutter\n(2005) found that several outlying GRB had an even higher gamma ray efficiency & 99%.\nThey suggested that these GRB were viewed along a line of sight that, even after 10 hours,\nremained outside the 1/Γ emission cone of the baryons.\nThe idea that many GRBs are viewed slightly off the main intensity peak by a finite\noffset angle, θ, was used (Eichler 2005) to interpret delayed onset of X-ray afterglow that\nwas reported by Piro et al. (2005). The delay is simply the time needed for the flow to\ndecelerate to a Lorentz factor Γ < 1/θ, beyond which time the afterglow beam encompasses\nour line of sight. This would predict, under the assumption that the afterglow-generating\nblast wave and the γ-ray beam coincide, that the lower the spectral peak, the longer it will\ntake for the afterglow to assume its full on-beam value (Granot et al. 2002; Granot 2005).\nHowever, the outliers to the ǫb - Epeak correlation found by Eichler and Jontof-Hutter (2005)\nsuggest that this correlation could be contaminated by many GRB that are bright, spectrally\nhard and have extensively delayed afterglow onset.\nVery recently, Nousek et al. (2005) arrived at a similar conclusion using early X-ray\nafterglow data taken by Swift. The early X-ray afterglows frequently show an intermediate\nphase ( t1 < t < t2 ) of very flat flux decay at early times (between a few 102 s and ∼ 104 s)\nthat is deficient relative to expectations from a uniform adiabatic blast wave. Among this\nsubset of GRBs, it typically takes the X-ray afterglow a few hours to attain the values\ninferred from BeppoSax data. They note that for t ≪ t2 , the γ−ray efficiency, ǫγ , is typically\nmuch higher than previously inferred (Panaitescu & Kumar 2001; Lloyd-Ronning & Zhang\n2004), yet at t & t2 , the distribution in these efficiencies converges to the narrow range of\nvalues inferred previously.4\nYet another possible effect produced by offset viewing is the spectral evolution of spikes\nin the prompt GRB emission, which scale as Epeak ∝ t−2/3 (Ryde 2004). This can be\ninterpreted as the spike being due to an accelerating blob of matter that scatters primary\nradiation into our line of sight. Assuming that the blob is being accelerated to high Γ by\nan extremely super-Eddington radiation flux in the direction of the local radiation flux, the\nLorentz factor of the blob scales as Γ ∝ R1/3 (Eichler 2004). A spectral peak photon energy\nwhich is E∗ in the source frame, is E∗ /Γ in the blob frame, and Epeak = E∗ /Γ2 (1 − β cos θ)\nin the observer's frame. Once the blob has accelerated to Γ ≫ 1/θ, then the observed time\n4\n\nActually, the better terminology is the blast efficiency, ǫb = 1 − ǫγ . In this class of bursts ǫγ ∼ 90% and\nthe blast efficiencies ǫb ∼ 10% have greater relative scatter due to their smaller values.\n\n\f–6–\nscales linearly with radius, t ∝ R, and (1 − β cos θ) is asymptotically constant (≈ θ2 /2)\nso that Epeak ∝ Γ−2 ∝ R−2/3 ∝ t−2/3 . The general picture of matter being accelerated by\nradiation is consistent with the inference argued above that the matter draws its kinetic\nenergy from the radiation rather than the other way around.\n\n3.\n\nDelayed Afterglow Onset and Flat Early Light Curves\n\nThe explanation favored by Nousek et al. (2005) for the early flat part of the X-ray\nafterglow light curves that were observed by Swift is energy injection into the afterglow\nshock (see also Zhang et al. 2005; Panaitescu et al. 2005). Here we suggest an alternative\nexplanation for this early flat phase, namely the flat early afterglow light curve for viewing\nangles slightly outside the (rather sharp) edge of the jet (i.e. outside the regions where the\nenergy per solid angle in the external shock is large enough to produce bright afterglow\nemission).\nFor such \"off-beam\" lines of sight, the afterglow flux initially rises, at early times, as\nthe beaming of the radiation away from the line of sight gradually decreases with time, then\nrounds off as the afterglow beaming cone expands enough to include the line of sight, and\nfinally gradually joins the decaying \"on-beam\" light curve (seen by observers within the jet).\nFor a point source, the fluxes seen by off-beam and on-beam observers are related by\nFν (θ, t) ≈ a3 Fν/a (0, at) = a3+βX −αX Fν (0, t)\n\n(1)\n\n(Granot et al. 2002), where θ is the angle between the source's velocity and the direction to\nthe observer in the lab frame, t is the observed time, a = (1 − β)/(1 − β cos θ) ≈ (1 + Γ2 θ2 )−1\nis the ratio of the off-beam (at θ) and on-beam (θ = 0) Doppler factors, and the last\nequality is valid when Fν (0, t) ∝ t−αX ν −βX . Thus, the off-beam flux is suppressed relative\nto the on-beam flux by a factor η = a3+βX −αX . For early times, when Γθ ≫ 1, we have\na ≈ (Γθ)−2 and Γ ∝ t−(3−k)/2 where ρext ∝ R−k , so that a ∝ t3−k , η ∝ t(3−k)(3+βX −αX ) and\nFν (θ, t) ∝ η(t)t−αX ∝ t(3−k)(3+βX )−(4−k)αX . The point source limit is valid when the angle θ\nfrom the closest point along the edge of the jet is larger than the typical angular extent of the\njet, θjet . However, more often the opposite is true, i.e. θ < θjet (or Γ−1\n0 ≪ θ ≪ θjet where Γ0 is\nthe initial Lorentz factor of the jet), in which case the dependence of η on a decreases by one\npower (Eichler & Levinson 2004; Levinson & Eichler 2005) to η = a2+βX −αX . This implies\nη ∝ t(3−k)(2+βX −αX ) and Fν (θ, t) ∝ η(t)t−αX ∝ t(3−k)(2+βX )−(4−k)αX at very early times.\nFig. 1 shows two tentative fits to the X-ray light curve of GRB 050315, which is perhaps\nthe best monitored X-ray light curve showing a pronounced early flat phase (Nousek et\nal. 2005). The first fit (red solid line) is for a Gaussian jet, calculated using model 1 of\n\n\f–7–\nGranot & Kumar (2003), where lateral expansion is neglected, the jet dynamics is calculated\naccording to a simplified semi-analytic formulation of the energy conservation equation, and\nthe light curve is calculated by integrating over the equal arrival time surface of photons\nto the observer, assuming a simple piece-wise power law synchrotron (and synchrotron selfCompton) spectrum in comoving frame. The second fit (dashed blue line) if for a jet with a\ncross section in the shape of a thick ring, calculated using the model developed in Granot\n(2005) where the light curve is calculated by integrating over the surface of equal arrival\ntime of photons to the observer, while the jet dynamics are simplified. The latter model was\nalso used in the inset of Fig. 1, which shows the light curves for different viewing angles. In\nall cases the early fast decay is attributed to the tail emission of the prompt GRB (Kumar\n& Panaitescu 2000) and is modeled by a steep power law. As derived analytically in the\nprevious paragraph, the light curves for off-beam viewing angles show a rather sharp rise\nin the flux at very early times. However, in most cases the steep early rise of the afterglow\nemission is hidden below the steeply decaying tail of the prompt GRB emission. Fig. 1\ndemonstrates that the combination of the decaying tail emission of the prompt GRB and\nthe gently rising or rounding off afterglow emission from slightly off-beam viewing angles\ncan produce a flat early phase in the afterglow light curves, similar to those seen by Swift in\nthe X-rays (Nousek et al. 2005). In some cases we expect to even see a gentle rise at very\nearly times. As can be seen from Fig. 1, different combinations of jet structure and viewing\nangle can generally fit the same observed X-ray light curve.\nFig. 2 demonstrates the dependence of the early rise in the afterglow light curves, for\noff-beam viewing angles, on the jet structure and dynamics. The three bottom panels are\ntaken from Granot, Ramirez-Ruiz & Perna (2005) and are calculated using model 1 of Granot\n& Kumar (2003). The second panel shows afterglow light curves from a uniform jet with\nsharp edges for different viewing angles θobs from the jet symmetry axis. The light curves\nare similar to those for a wide ring jet (Fig. 1) for similar off-beam viewing angles. The two\nbottom panels in Fig. 2 are for a Gaussian jet, and show that the smoother the edges of the\njet (both in terms of energy per solid angle and in terms of the initial Lorentz factor Γ0 ),\nthe shallower the initial rise in the flux for off-beam viewing angles.\nThe upper panel in Fig. 2 shows the afterglow light curves for an initially sharp edged jet\nwhose dynamics were calculated using a hydrodynamic simulation (Granot et al. 2001). The\ninitial conditions were a cone of half-opening angle θ0 taken out of the spherical self-similar\nsolution of Blandford & McKee (1976). The light curves for off-beam viewing angles, and\nespecially for 1 . θobs /θ0 . 2, are much flatter at early times compared to those calculated\nusing semi-analytic models for the jet dynamics, since the shocked external medium at the\nsides of the jet has a significantly smaller Lorentz factor than that near the head of the jet,\nand therefore its emission is not so strongly beamed away from off-beam lines of sight. Thus\n\n\f–8–\nwe conclude that very flat (either a very shallow rise or a very shallow decay) early afterglow\nlight curves are expected for a realistic jet structure and dynamics. Combined with the\nrapidly decaying tail of the prompt GRB emission, this can nicely reproduce the observed\nearly flat parts of the X-ray afterglow light curve observed by Swift.\n\n4.\n\nDiscussion\n\nWe have shown that the early flat phase in the X-ray afterglow light curves observed by\nSwift is broadly consistent with earlier predictions that afterglow onset might appear delayed\nto an \"offset viewer\" - an observer who is outside of the directed beam of baryons. Many\nauthors ( e.g. Panataiscu and Meszaros, 1998, Panataiscu, Meszros and Rees 1999, Moderski,\nSikora and Bulik 2000, Granot et al 2001, Dalai, Griest and Pruet 2002, Dado, Dar, and De\nRujula 2002) have noted that offset viewing would suppress early afterglow and presumably\nprompt gamma rays as well. Granot et al. (2002) predicted that this would be the case for\norphan afterglows, and Granot, Ramirez-Ruiz & Perna (2005) argued that this is expected\nfor X-ray flashes (and nicely agrees with their pre-Swift optical and X-ray early afterglows),\nassuming that the softening or non-appearance of prompt γ-rays in these instances is due to\noffset viewing (relative to both the regions of prominent γ-ray and afterglow emission, which\nwere assumed to coincide). Eichler & Levinson (2004) and Eichler & Jontof-Hutter (2005)\npredicted that this could also be the case for \"normal\" γ-ray bursts with a bright prompt\nemission if the viewer is in the direct beam of the gamma rays but not of the baryons. Delays\nof several minutes in some afterglows whose onsets were serendipitously caught by the wide\nfield camera of BeppoSAX (Piro et al. 2005) led Eichler (2005) to conjecture that the prompt\nemission was seen along an afterglow-inefficient line of sight, and that, if caught during the\nfirst several hours, an even larger fraction of afterglow onsets would appear delayed. This\nnow seems to be the case in our view. We have argued here that the stage of flat decay, often\nseen within the first few hours of afterglow, can be attributed to the delayed onset discussed\nin these earlier papers.\nFor off-beam viewing angles relative to the region of prominent afterglow emission, we\nmight expect a correlation between the flatness of flat decay phase (i.e. its temporal index\nα2 where Fν ∝ t−α2 ) and its luminosity, where a flatter decay would on average have a lower\nluminosity. This indeed appears to be the case judging from Figs. 1 of Nousek et al. (2005),\nwhere the scatter in luminosity is significantly reduced at late times. This is hard to explain\nwith late time energy infusion, which would be expected, rather, to increase the amount\nof scatter at late times relative to early ones. If the same viewing angles are also off-beam\nrelative to the region of prominent γ-ray emission, one might expect a correlation between α2\n\n\f–9–\nand the spectral peak photon energy, Epeak , or isotropic equivalent energy in γ-rays, Eγ,iso .\nTables 1 and 2 of Nousek et al. (2005) show no obvious apparent correlation between α2\nand Eγ,iso . The lack of such a correlation would suggest, under the off-beam interpretation,\nthat the regions of prominent afterglow emission and of prominent γ-ray emission do not\ncoincide, as we have suggested in this work. Furthermore, some of the GRBs recorded by\nSwift, such as GRB 050315, have a rather large Eγ,iso as well as long stages of very flat decay,\nand could be interpreted in our view as being due to lines of sight along which the afterglow\nemission was intrinsically weak. Such a weak afterglow emission can easily be attributed to\na paucity of baryons relative to γ-rays in the outflow along our line of sight.\nThe authors gratefully acknowledge a Center of Excellence grant from the Israel Science Foundation, a grant from the Israel-U.S. Binational Science Foundation and support\nfrom the Arnow Chair of Theoretical Astrophysics. This research was supported by the US\nDepartment of Energy under contract number DE-AC03-76SF00515 (J. G.).\n\nREFERENCES\nAmati, L., et al. 2002 A&A, 390, 81\nBlandford, R. D., & McKee, c. F. 1976, Phys. Fluids, 19, 1130\nDado, S., Dar, A., & De Rujula, A., 2002, Astron. Astrophys. 388, 1079\nDalal, Griest, & Pruet, 2002 ApJ, 564, 209\nEichler, D. 1994, ApJ Supp., 90, 877\nEichler, D. 2003, preprint (astro-ph/0303474)\nEichler, D. 2004, ApJ, 608, L81\nEichler, D. 2005, ApJ, 628, L17\nEichler, D., & Jontof-Hutter, D. 2005, ApJ, in press (astro-ph/0503537)\nEichler, D., & Levinson, A. 1999, ApJ, 521, L117\nEichler, D. & Levinson, A. 2004, ApJ, 614, L13\nGaensler, B. M., et al. 2005, Nature, 434, 1104\nGelfand, J. D., et al. 2005, ApJ, 634, L89 (astro-ph/0503269)\n\n\f– 10 –\nGhirlanda, G., Ghisellini, G., and Lazzati, D., 2004, ApJ, 616, 331\nGoodman, J. 1986, ApJ, 308, L47\nGranot, J. 2005, ApJ, 631, 1022 (astro-ph/0504254)\nGranot, J, Miller, M., Piran, T., Suen, W. M., & Hughes, P. A. 2001, in Gamma-Ray Bursts\nin the Afterglow Era, ed. E. Costa, F. Frontera, & J. Hjorth (Berlin: Springer), 312\nGranot, J., Panaitescu, A., Kumar, P., & Woosley, S. E. 2002, ApJ, 570, L61\nGranot, J., & Kumar, P. 2003, ApJ, 591, 1086\nGranot, J., Ramirez-Ruiz, E., & Perna, R. 2005, ApJ, 630, 1003\nGranot, J., et al. 2005, ApJ, in press (astro-ph/0503251)\nKumar, P., & Panaitescu, A. 2000, ApJ, 541, L51\nLevinson, A., & Eichler, D. 1993, ApJ, 418, 386\nLevinson, A., & Eichler, D., 2005, ApJ, 629, L13\nLloyd-Ronning, N., and Zhang., B, 2004 ApJ, 613, 477\nMészáros, P., & Rees, M. J. 1994, MNRAS, 269, L41\nModerski, R., Sikorski, M., & Bulik, T., 2000, ApJ, 529, 151\nNakamura, T. 1998 Progress in Theoretical Physics, 100, 921\nNousek, J. A., et al. 2005, submitted to ApJ (astro-ph/0508332)\nPanaitescu, A., & Meszaros, P., 1998, ApJ, 503, 314\nPanaitescu, A., Meszaros, P., & Rees, M. J., 1999, ApJ, 526, 707\nPanaitescu, A., et al. 2005, MNRAS, in press (astro-ph/0508340)\nPanaitescu, A., & Kumar, P. 2001, ApJ, 554, 667\nPiro, L., et al. 2005, ApJ, 623, 314\nRyde, F. 2004, ApJ, 614, 827\nZhang, B., et al. 2005, submitted to ApJ (astro-ph/0508321)\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 11 –\n\n51\n\n\"thick ring\" jet: θc = ∆θ = 0.05, Γ0 = 100\nθobs = 0, 0.025, 0.0325 0.04, 0.05, 0.075,\n0.1, 0.11, 0.1175, 0.125, 0.15, 0.2\n\n0\n\n10\n\n10\n\n−2\n\n50\n\n10\n\nβX = (p−1)/2\n\nFν\n\n10\n\n−4\n\n10\n\nLX,iso in erg/s\n\n49\n\n10\n\nLX,tail ∝ t−5\n\n48\n\n10\n\ntail of prompt\n−3\nemission ∝ t\n\n−6\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n1\n\n10\n\n10\n\n2\n\n10\n\ntobs (days)\n\n47\n\n10\n\n46\n\nGRB 050315: fits to a Gaussian jet\n(θobs = θc = 3°, E = 3 x1051 erg, Γ0 = 300,\n\n45\n\nn = 15 cm−3, p = 2, εe = 0.3, εB = 0.05) and to a\n\n10\n10\n\nthick ring shaped jet (θc = ∆θ = 0.025, θobs = 0.44θc,\n\n44\n\n10\n\nρ = Ar−2, A* = 1, E = 5 x1051 erg, p = 2, εe = 0.17, εB = 0.01\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\nt / (1+z)\n\n4\n\n10\n\n5\n\n10\n\n6\n\n10\n\nin seconds\n\nFig. 1.- A tentative fit to the X-ray light curve of GRB 050315 (from Nousek et al. 2005),\nwith (i) a Gaussian jet (red solid line, using model 1 of Granot & Kumar 2003), and (ii)\na ring shaped jet, uniform within θc < θ < θc + ∆θ (blue dashed line, following the model\ndescribed in Granot 2005). The initial fast decay is attributed to the tail of the prompt\nemission and modeled as a power law ∝ t−5 . The inset shows afterglow light curves for a\nring shaped jet (Granot 2005), for different viewing angles θobs from the jet symmetry axis .\n\n\f– 12 –\n\nt (days)\n\n1\n\n10\n\n−4\n\nFν (mJy)\n\n10\n\nθ0\n\nθobs=0 ,0.5θ0\n1.5θ0\n\n−5\n\n10\n\n2\n\n10\n\nHydrodynamic simulation of an\ninitially uniform sharp edged jet\n\n2θ0\n\n−6\n\n10\n\n3θ0\n4θ0\n\nFν (mJy)\nFν (mJy)\n\n10\n0\n10\n−1\n10\n−2\n10\n−3\n10\n−4\n10\n−5\n10\n\nFν (mJy)\n\n1\n\n10\n0\n10\n−1\n10\n−2\n10\n−3\n10\n−4\n10\n−5\n10\n\n10\n0\n10\n−1\n10\n−2\n10\n−3\n10\n−4\n10\n−5\n10\n\n5θ0\n\nuniform jet with sharp edges\n\n1\n\n2\nGaussian jet: ε , Γ0−1 ∝ e−θ /2θ0\n2\n\n1\n\nGaussian ε + constant Γ0\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\nt (days)\nFig. 2.- Light curves for different jet structures, dynamics and viewing angles. The upper\npanel is from an initially uniform jet with sharp edges whose evolution is calculated using\na hydrodynamic simulation (taken from Fig. 2 of Granot et al. 2002). The remaining three\npanels are taken from Fig. 5 of Granot, Ramirez-Ruiz & Perna (2005), where a simplified jet\ndynamics with no lateral expansion is used. The middle two panels are for a Gaussian jet, in\nenergy per solid angle, and either a Gaussian or a uniform initial Lorentz factor, while the\nbottom panel is for a uniform jet. The viewing angles are θobs /θ0 = 0, 0.5, 1, 1.5, 2, 3, 4, 5\nwhere θ0 is the (initial) half-opening angle for the uniform jet (two upper panels) and the\ncore angle for the Gaussian jet (lower two panels).\n\n\f"}