{"id": "http://arxiv.org/abs/astro-ph/0508500v2", "guidislink": true, "updated": "2005-08-31T23:52:55Z", "updated_parsed": [2005, 8, 31, 23, 52, 55, 2, 243, 0], "published": "2005-08-23T20:32:04Z", "published_parsed": [2005, 8, 23, 20, 32, 4, 1, 235, 0], "title": "Rotation and variability of young very low mass objects", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0508426%2Castro-ph%2F0508581%2Castro-ph%2F0508126%2Castro-ph%2F0508461%2Castro-ph%2F0508328%2Castro-ph%2F0508663%2Castro-ph%2F0508470%2Castro-ph%2F0508503%2Castro-ph%2F0508500%2Castro-ph%2F0508040%2Castro-ph%2F0508354%2Castro-ph%2F0508130%2Castro-ph%2F0508182%2Castro-ph%2F0508691%2Castro-ph%2F0508510%2Castro-ph%2F0508631%2Castro-ph%2F0508566%2Castro-ph%2F0508135%2Castro-ph%2F0508191%2Castro-ph%2F0508420%2Castro-ph%2F0508541%2Castro-ph%2F0508297%2Castro-ph%2F0508277%2Castro-ph%2F0508522%2Castro-ph%2F0508111%2Castro-ph%2F0508459%2Castro-ph%2F0508535%2Castro-ph%2F0508362%2Castro-ph%2F0508399%2Castro-ph%2F0508265%2Castro-ph%2F0508031%2Castro-ph%2F0508369%2Castro-ph%2F0508301%2Castro-ph%2F0508140%2Castro-ph%2F0508389%2Castro-ph%2F0508390%2Castro-ph%2F0508081%2Castro-ph%2F0508143%2Castro-ph%2F0508405%2Castro-ph%2F0508651%2Castro-ph%2F0508556%2Castro-ph%2F0508430%2Castro-ph%2F0508579%2Castro-ph%2F0508363%2Castro-ph%2F0508518%2Castro-ph%2F0508146%2Castro-ph%2F0508076%2Castro-ph%2F0508275%2Castro-ph%2F0508548%2Castro-ph%2F0508137%2Castro-ph%2F0508278%2Castro-ph%2F0508366%2Castro-ph%2F0508148%2Castro-ph%2F0508400%2Castro-ph%2F0508199%2Castro-ph%2F0508685%2Castro-ph%2F0508259%2Castro-ph%2F0508223%2Castro-ph%2F0508198%2Castro-ph%2F0508690%2Castro-ph%2F0508568%2Castro-ph%2F0508423%2Castro-ph%2F0508630%2Castro-ph%2F0508289%2Castro-ph%2F0508012%2Castro-ph%2F0508007%2Castro-ph%2F0508675%2Castro-ph%2F0508674%2Castro-ph%2F0508151%2Castro-ph%2F0508521%2Castro-ph%2F0508444%2Castro-ph%2F0508565%2Castro-ph%2F0508097%2Castro-ph%2F0508516%2Castro-ph%2F0508409%2Castro-ph%2F0508676%2Castro-ph%2F0508692%2Castro-ph%2F0508477%2Castro-ph%2F0508157%2Castro-ph%2F0508296%2Castro-ph%2F0508463%2Castro-ph%2F0508492%2Castro-ph%2F0508511%2Castro-ph%2F0508564%2Castro-ph%2F0508515%2Castro-ph%2F0508064%2Castro-ph%2F0508326%2Castro-ph%2F0508331%2Castro-ph%2F0508099%2Castro-ph%2F0508472%2Castro-ph%2F0508613%2Castro-ph%2F0508019%2Castro-ph%2F0508174%2Castro-ph%2F0508498%2Castro-ph%2F0508417%2Castro-ph%2F0508082%2Castro-ph%2F0508670%2Castro-ph%2F0508220%2Castro-ph%2F0508567%2Castro-ph%2F0508684%2Castro-ph%2F0508323&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Rotation and variability of young very low mass objects"}, "summary": "Variability studies are an important tool to investigate key properties of\nstars and brown dwarfs. From photometric monitoring we are able to obtain\ninformation about rotation and magnetic activity, which are expected to change\nin the mass range below 0.3 solar masses, since these fully convective objects\ncannot host a solar-type dynamo. On the other hand, spectroscopic variability\ninformation can be used to obtain a detailed view on the accretion process in\nvery young objects. In this paper, we report about our observational efforts to\nanalyse the variability and rotational evolution of young brown dwarfs and very\nlow mass stars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0508426%2Castro-ph%2F0508581%2Castro-ph%2F0508126%2Castro-ph%2F0508461%2Castro-ph%2F0508328%2Castro-ph%2F0508663%2Castro-ph%2F0508470%2Castro-ph%2F0508503%2Castro-ph%2F0508500%2Castro-ph%2F0508040%2Castro-ph%2F0508354%2Castro-ph%2F0508130%2Castro-ph%2F0508182%2Castro-ph%2F0508691%2Castro-ph%2F0508510%2Castro-ph%2F0508631%2Castro-ph%2F0508566%2Castro-ph%2F0508135%2Castro-ph%2F0508191%2Castro-ph%2F0508420%2Castro-ph%2F0508541%2Castro-ph%2F0508297%2Castro-ph%2F0508277%2Castro-ph%2F0508522%2Castro-ph%2F0508111%2Castro-ph%2F0508459%2Castro-ph%2F0508535%2Castro-ph%2F0508362%2Castro-ph%2F0508399%2Castro-ph%2F0508265%2Castro-ph%2F0508031%2Castro-ph%2F0508369%2Castro-ph%2F0508301%2Castro-ph%2F0508140%2Castro-ph%2F0508389%2Castro-ph%2F0508390%2Castro-ph%2F0508081%2Castro-ph%2F0508143%2Castro-ph%2F0508405%2Castro-ph%2F0508651%2Castro-ph%2F0508556%2Castro-ph%2F0508430%2Castro-ph%2F0508579%2Castro-ph%2F0508363%2Castro-ph%2F0508518%2Castro-ph%2F0508146%2Castro-ph%2F0508076%2Castro-ph%2F0508275%2Castro-ph%2F0508548%2Castro-ph%2F0508137%2Castro-ph%2F0508278%2Castro-ph%2F0508366%2Castro-ph%2F0508148%2Castro-ph%2F0508400%2Castro-ph%2F0508199%2Castro-ph%2F0508685%2Castro-ph%2F0508259%2Castro-ph%2F0508223%2Castro-ph%2F0508198%2Castro-ph%2F0508690%2Castro-ph%2F0508568%2Castro-ph%2F0508423%2Castro-ph%2F0508630%2Castro-ph%2F0508289%2Castro-ph%2F0508012%2Castro-ph%2F0508007%2Castro-ph%2F0508675%2Castro-ph%2F0508674%2Castro-ph%2F0508151%2Castro-ph%2F0508521%2Castro-ph%2F0508444%2Castro-ph%2F0508565%2Castro-ph%2F0508097%2Castro-ph%2F0508516%2Castro-ph%2F0508409%2Castro-ph%2F0508676%2Castro-ph%2F0508692%2Castro-ph%2F0508477%2Castro-ph%2F0508157%2Castro-ph%2F0508296%2Castro-ph%2F0508463%2Castro-ph%2F0508492%2Castro-ph%2F0508511%2Castro-ph%2F0508564%2Castro-ph%2F0508515%2Castro-ph%2F0508064%2Castro-ph%2F0508326%2Castro-ph%2F0508331%2Castro-ph%2F0508099%2Castro-ph%2F0508472%2Castro-ph%2F0508613%2Castro-ph%2F0508019%2Castro-ph%2F0508174%2Castro-ph%2F0508498%2Castro-ph%2F0508417%2Castro-ph%2F0508082%2Castro-ph%2F0508670%2Castro-ph%2F0508220%2Castro-ph%2F0508567%2Castro-ph%2F0508684%2Castro-ph%2F0508323&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Variability studies are an important tool to investigate key properties of\nstars and brown dwarfs. From photometric monitoring we are able to obtain\ninformation about rotation and magnetic activity, which are expected to change\nin the mass range below 0.3 solar masses, since these fully convective objects\ncannot host a solar-type dynamo. On the other hand, spectroscopic variability\ninformation can be used to obtain a detailed view on the accretion process in\nvery young objects. In this paper, we report about our observational efforts to\nanalyse the variability and rotational evolution of young brown dwarfs and very\nlow mass stars."}, "authors": ["Alexander Scholz", "Ray Jayawardhana", "Jochen Eisloeffel", "Dirk Froebrich"], "author_detail": {"name": "Dirk Froebrich"}, "author": "Dirk Froebrich", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1002/asna.200510437", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0508500v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0508500v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, proceedings for the workshop \"Ultralow-mass star\n  formation and evolution\", to be published in AN (revised version)", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0508500v2", "affiliation": "DIAS Dublin", "arxiv_url": "http://arxiv.org/abs/astro-ph/0508500v2", "journal_reference": null, "doi": "10.1002/asna.200510437", "fulltext": "Astron. Nachr./AN xxx (xxxx) x, xxx–xxx\n\nRotation and variability of young very low mass objects\n\narXiv:astro-ph/0508500v2 31 Aug 2005\n\nA LEXANDER S CHOLZ1 , R AY JAYAWARDHANA1 , J OCHEN E ISL ÖFFEL2 , D IRK F ROEBRICH3\n1\n\nDepartment of Astronomy & Astrophysics, University of Toronto, 60 St. George Street, Toronto, Ontario M5S3H8, Canada\nThüringer Landessternwarte Tautenburg, Sternwarte 5, D-07778 Tautenburg, Germany\n3\nDublin Institute for Advanced Studies, 5 Merrion Square, Dublin 2, Ireland\n2\n\nReceived; accepted; published online\n\nAbstract. Variability studies are an important tool to investigate key properties of stars and brown dwarfs. From photometric\nmonitoring we are able to obtain information about rotation and magnetic activity, which are expected to change in the\nmass range below 0.3 solar masses, since these fully convective objects cannot host a solar-type dynamo. On the other hand,\nspectroscopic variability information can be used to obtain a detailed view on the accretion process in very young objects. In\nthis paper, we report about our observational efforts to analyse the variability and rotational evolution of young brown dwarfs\nand very low mass stars.\nKey words: stars: low-mass, brown dwarfs – stars: magnetic fields – stars: rotation – stars: spots – stars: formation\nc 0000 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim\n\n1. Introduction\nVariability is a key tool to study stellar properties. From simple photometric monitoring alone it is possible to measure\nthe rotation period, if the objects exhibit asymmetrically distributed surface features, e.g. cool magnetic spots. The amplitude of the variability can be used to assess the properties\nof these spots, in particular if lightcurves in more than one\nfilter are available (e.g. Bouvier & Bertout 1989). Furthermore, accretion processes can be studied in detail based on\nspectroscopic time series, particularly by monitoring changes\nin emission features like the Hα line, which are produced in\nthe hot accretion flow (e.g., Johns & Basri 1995). Until the\nlate 1990s, most variability studies have focused on stars with\nmasses > 0.4 M⊙ . They provided hundreds of rotation periods (see Stassun & Terndrup 2003 for a recent review), detailed spot parameters for cool as well as for hot spots, and,\nfor selected targets, a detailed view on the accretion process\n(e.g., Alencar & Batalha 2002). For lower-mass objects, however, the observational database is still sparse. This motivated\nus to carry out a long-term project aimed to study the variability in the very low mass (VLM) regime, focusing on VLM\nstars and brown dwarfs (BDs), i.e. objects with masses below 0.4 M⊙ . Here we provide a summary of the outcomes of\nthese studies.\nCorrespondence to: aleks@astro.utoronto.ca\n\n2. Photometric rotation periods\nAbout 2000 photometric rotation periods have been measured\nfor solar-mass stars over the past 25 years (Stassun & Terndrup 2003). However, five years ago only a handful of periods were known for VLM objects (Martı́n & Zapatero Osorio 1997, Terndrup et al. 1999, Bailer-Jones & Mundt 1999).\nMotivated by this lack of information, we and other groups\nhave determined about 500 periods for VLM objects, where\nmost of these periods have been measured in very young clusters (Herbst et al. 2001, Lamm et al. 2004, 2005). Although\nthe VLM rotation database is still sparsely populated in the\nBD regime with only about 30 periods known for substellar objects (Scholz & Eislöffel 2004a (SE04a), 2005 (SE05),\nBailer-Jones & Mundt 2001, Joergens et al. 2002, Zapatero\nOsorio et al. 2003), we are now able to carry out meaningful comparisons between solar-mass stars and VLM objects\nin terms of their rotational behaviour. Our own long-term\nproject was dedicated to study the rotational evolution on\ntimescales of a few 100 Myrs, and provided 80 periods for\nVLM objects with ages ranging from 3 to 700 Myrs, increasing the number of periods in this age and mass range by a\nfactor of 14. In the following, we will discuss mass-period relationship and rotational evolution mainly based on this sample.\nIn Fig. 1 we show average period vs. mass in four open\nclusters. The data for ǫ Ori, IC4665, and Pleiades are taken\nfrom our own project (see Scholz & Eislöffel 2004 (SE04b),\n\n\f3 SPOT PROPERTIES\n\nFig. 1. Average period vs. mass for objects in four open clusters. For IC4665 and the Pleiades, the lines show a linear fit\nto the available period data (Scholz 2004, SE04b). For ǫ Ori\n(SE05) and the ONC (Herbst et al. 2001), the median period\nis plotted.\n\nSE05, Scholz 2004), whereas the mass-period relationship for\nthe ONC was derived by Herbst et al. (2001). In all clusters\nwe see a similar trend: The average period clearly decreases\nwith decreasing mass. This has two consequences: a) VLM\nobjects rotate, on average, faster than solar-mass stars. b) In\nthe VLM regime, the average period is correlated with the\nobject mass. This trend appears to continue well-down into\nthe substellar regime, with the result that the typical period\nof BDs is below one day. Since this period-mass relationship\nis already established in the youngest clusters (the ONC has\nan age of about 1 Myr), it must have its origin in the earliest\nstages of the rotational evolution. Although an explanation\nfor this effect is still missing, it might be an important signature of the VLM formation process.\nThe rotational evolution can be analysed based on Fig.\n2, which shows the periods for VLM stars from our monitoring campaigns in five open clusters as a function of age.\nThe lower period limit is, within the statistical uncertainties,\nmore or less constant with age. Fast rotators exist at all ages in\nthe VLM regime, in clear contrast to solar-mass stars. On the\nother hand, the upper period limit clearly evolves with time, it\ndecreases from about 10 days at 3 Myr to 2 days at 125 Myr,\nand increases again thereafter. We aimed for a deeper understanding of this behaviour, and constructed a set of simple\nmodels, which take into account the basic angular momentum regulation mechanisms (SE04b). The approach of the\nmodels was to use the periods in our youngest cluster (σ Ori,\n3 Myr) as starting points and to evolve these periods forward\nin time, to generate evolutionary tracks in the period-age diagram. The first model, which includes only the contraction\nof the objects, can reproduce the rotational acceleration between 3 and 100 Myr, but fails to explain the subsequent rotational braking. In particular, about half of the periods in the\nPleiades and Praesepe are too long to be explained by simple\nangular momentum conservation. Therefore, we included a\nwind braking law in the model. It\n√turned out that the classical\nSkumanich type braking (P ∝ t) is too strong, and would\n\nFig. 2. Rotation period of VLM stars in five open clusters as\na function of age (SE04a/b SE05, Scholz 2004). Horizontal\nlines show the detection limits.\nproduce periods longer than 100 h at the age of the Pleiades,\nwhich, according to our rotation periods and available v sin i\ndata (Terndrup et al. 2000) do not exist. Instead, we can reproduce most of our periods by using an exponential braking law\n(P ∝ exp (t)), which provides only weak angular momentum\nloss by stellar winds. Please note that these conclusions are\nnot affected by age uncertainties for the open clusters, which\nmay be substantial, particularly at very young ages.\nThe only objects which pose a problem for these models\nare the fastest rotating objects with periods < 10 h at ages\nof 3-5 Myr. In all models, these objects would rotate with\nperiods below the lower period limit in the Pleiades at the\nage of 125 Myr. For these ultra-fast VLM objects, we have\nto take into account that their breakup limit is between 3 and\n5 h. Therefore, we can expect that the fast rotation itself significantly influences their evolution, e.g. by mass-loss due to\nstrong centrifugal forces or strongly oblate shapes. It is therefore not surprising that our simple models fail to explain the\nevolution of these objects. Clearly, more sophisticated modeling is required for objects close to breakup. Recapitulating,\nwe are able to explain the rotational evolution of most VLM\nobjects with ages between 3 and 700 Myr by taking into account contraction and weak angular momentum loss by stellar winds.\n\n3. Spot properties\nThe rotation period is not the only important property that can\nbe obtained from photometric monitoring. The amplitude of\nthe variability can be used to assess the properties of the surface features, which are responsible for the flux modulation.\nFor young stars and BDs, these surface features are believed\nto be magnetically induced cool spots. As we have shown\nin SE04b, the amplitudes are reduced at least by a factor of\n2.4 in the VLM regime (see also the discussion in Scholz,\nEislöffel & Froebrich 2005). In addition, we see evidence\nfor a low rate of active, i.e. photometrically variable, objects\nin the VLM regime (SE04b). This is a clear indication for a\nchange of the spot properties, roughly at a mass of 0.4 M⊙ .\n\n\f4 MONITORING ACCRETING BROWN DWARFS\n\nFig. 3. Photometric amplitude for BPL129, a VLM star in the\nPleiades, as a function of wavelength. Overplotted are model\ncalculations for the given set of spot parameters.\n\nSmall amplitudes can be caused by either a concentration\nof spots at polar latitudes, small contrast between spots and\nphotospheric environment, low spot coverage, or a more symmetric spot distribution. To distinguish between these scenarios, Doppler imaging would be desirable. Since this is still\nat the edge of the observational capabilities, we carried out\nmulti-filter monitoring to obtain first constraints on the VLM\nspot properties (Scholz et al. 2005). A sample of VLM stars\nin the Pleiades was monitored simultaneously in the I-, J-,\nand H-band, using two telescopes at the German Spanish Astronomical Centre on Calar Alto/Spain.\nIn Fig. 3 we show the results for a particular object,\nthe star BPL129 (Pinfield et al. 2000) with an approximate\nmass of 0.15 M⊙. Squares show the observed lightcurve amplitudes, the lines are model calculations for given temperature difference between spot and photosphere (∆T ) and\nfilling factor (fraction of the hemisphere covered by spots).\nThese models are based on theoretical spectra for VLM stars\nby Allard et al. (2001), and assume an effective temperature of 3200 K for BPL129. The amplitudes in all three\nbands are comparable and best reproduced by models with\n∆T = 20 . . . 30% and filling factors < 5%. These are the\nfirst constraints of spot parameters for an object with such a\nlow mass. The value for ∆T is comparable with similar measurements for solar-mass stars, but the filling factor is quite\nlow when compared with values for more massive stars. The\nmajor downside of photometric monitoring is that we only\nobserve asymmetrically distributed spots. Thus, a low filling factor means that we see either low spot coverage or a\nsymmetric spot distribution. The low amplitudes in the VLM\nregime are thus probably a consequence of either very few\nspots or a change in the spot distribution.\nIs it possible to explain the change in the spot properties as well as the fast rotation of VLM objects in the context of the fundamental properties of these objects? Maybe\nthe most significant difference between solar-mass stars and\nVLM objects is that the latter will never develop a radiative\ncore. Today it is widely believed that the large-scale magnetic\nfield of the Sun is produced in the interface layer between\n\nconvective and radiative zone by means of an αω-type dynamo. The fully-convective VLM objects cannot have such\na dynamo, because they have no radiative core. Since they\nare still magnetically active (see e.g. Mohanty & Basri 2003),\nthey must have an alternative type of dynamo. One suggestion\nis that VLM objects host a turbulent dynamo, which works\nthroughout the convection zone, and which should generate\nonly small-scale magnetic fields (Durney et al. 1993). If we\nassume that this model is adequate, we expect fast rotating\nobjects, because small-scale fields would cause inefficient\nangular momentum loss by stellar winds. We also expect a\nchange in the spot properties, probably to a more symmetric\nspot distribution. Thus, our main results are consistent with\na scenario where VLM objects have only small-scale fields\nbecause they are fully-convective.\n\n4. Monitoring accreting brown dwarfs\nIn our photometric monitoring campaigns in very young clusters in Orion, we found not only low-amplitude, strictly periodic lightcurves. In addition, we identified 11 objects showing high-amplitude variations with amplitudes up to 1 mag\nand partly irregular variations (SE04a, SE05). These highly\nvariable VLM objects show lightcurves very similar to those\nof classical T Tauri stars, which are strongly variable because\nthey accrete material from a circumstellar disk. The usual interpretation for their variability is the existence of hot spots\nformed by the accretion flow, which co-rotate with the objects and therefore cause high-amplitude variations. Instabilities in the accretion process can account for irregular variability. Therefore, we explain the high-amplitude variations\nof VLM objects as a consequence of ongoing accretion. This\ninterpretation is confirmed by near-infrared photometry and\nlow-resolution spectroscopy: Highly variable objects tend to\nshow infrared colour excess and strong Hα emission, indicative for the existence of an accretion disk. Thus, we have\nidentified a sample of accreting VLM objects by means of\na variability study.\nAccreting objects show a very complex type of variability. To disentangle the contributing effects, and to study hot\nspots, accretion rate variability, and disk geometry on VLM\nobjects, we carried out the first comprehensive spectroscopic\nmonitoring campaigns for accreting young BDs. Here we\nshow first results from high-resolution monitoring based on\nspectra taken with the MIKE spectrograph at the Magellan/Clay 6.5-m telescope on Las Campanas in spring 2005.\nIn a first paper we report about dramatic changes in the Hα\nprofile and intensity for the BD 2M1207 (Scholz, Jayawardhana, & Brandeker 2005, Jayawardhana et al., this volume).\nTo demonstrate that strong accretion rate variations are not\nunique in the substellar regime, we show in Fig. 4 a part of\nthe Hα time series for the BD 2MASS J11013205-7718249, a\nlikely member of the Cha I star forming region. On timescales\nof 1-2 days, the equivalent width in Hα increases by a factor\nof six, and the 10% width by a factor of two. This corresponds to a change in the accretion rate by about an order of\nmagnitude (Natta et al. 2004). At the same time, alternative\naccretion indicators appear in the spectra, e.g. HeI and Hβ\n\n\fReferences\n\nReferences\n\nFig. 4. Time series of the Hα profile for the brown dwarf 2M1101. The sequence shows three spectra taken with separations\nof 8 and 24 h hours. Emission features at ∼ 270 kms−1 are caused by non-perfect background subtraction.\nemission, which are faint or not detected before this burst.\nIn addition, the Hα profile develops a significant red absorption feature, indicating infalling material. Thus, we probably\nwitnessed a strong accretion burst on this object.\nIn total, we monitored six brown dwarfs with highresolution spectroscopy, and all six targets are variable.\nTherefore, variability information is essential to assess the\naccretion properties of stars and BDs. As shown by Mohanty\net al. (this volume), the accretion rate is correlated with object mass, but the individual objects scatter by one order of\nmagnitude around this correlation. This accretion-mass relationship might be explained by Bondi-Hoyle accretion (see\nPadoan, this volume), but in this case we should expect much\nless scatter. Here we demonstrate that accretion rate variability might account for the largest part of the noise. By taking\ninto account information about variability, we might be able\nto constrain correlations between accretion rate and fundamental properties more precisely.\n\n5. Conclusions\nWe report on a variety of variability studies of VLM stars and\nbrown dwarfs, aimed at a deeper understanding of rotation,\nactivity, and accretion for objects with masses < 0.4 M⊙ . In a\nlong-term project, we measured 80 rotation periods for VLM\nobjects with ages between 3 and 700 Myr. At all evolutionary\nstages, we see a clear tendency of decreasing average periods\nwith decreasing mass in the VLM regime. The rotational evolution can be understood by taking into account contraction\nand weak angular momentum loss by stellar winds. From an\nanalysis of the variability amplitudes and multi-filter monitoring, we see evidence for a change in the properties of magnetic spots at ∼ 0.4 M⊙. Either VLM objects have a symmetric spot distribution or very low spot coverage in comparison with more massive stars. Accretion shows up in monitoring studies as high-amplitude photometric variation and as\nstrong variability in accretion-related emission lines, in par-\n\nticular Hα. We demonstrate that VLM objects in some cases\nshow accretion rate variations up to one order of magnitude.\nVariability studies are thus an important component in the investigation of substellar properties.\nAcknowledgements. We would like to thank the organisers of\nthe IAC/TNG workshop on ultralow-mass stars for a lively and\nstimulating conference. Part of this work was supported by the\nGerman Deutsche Forschungsgemeinschaft, DFG project numbers\nEi 409/11–1, Ei 409/11–2, as well as by an NSERC grant and University of Toronto startup funds to R. Jayawardhana.\n\nReferences\nAlencar, S. H. P., Batalha, C.: 2002, ApJ, 571, 378\nAllard, F., et al.: 2001, ApJ, 556, 357\nBailer-Jones, C. A. L., Mundt, R.: 1999, A&A, 348, 800\nBailer-Jones, C. A. L., Mundt, R.: 2001, A&A, 367, 218\nBouvier, J., Bertout, C.: 1989, A&A, 211, 99\nDurney, B. S., De Young, D. S., Roxburgh, I. W.: 1993, SoPh, 145,\n207\nHerbst, W., et al.: 1994, AJ, 108, 1906\nHerbst, W., Bailer-Jones, C. A. L., Mundt, R.: ApJ, 554, 197\nJoergens, V., Guenther, E., Neuhäuser, R., et al.: 2001, A&A, 373,\n966\nJohns, C., Basri, G.: 1995, AJ, 109, 2800\nLamm, M. H., et al.: 2004, A&A, 417, 557\nLamm, M. H., et al.: 2004, A&A, 430, 1005\nMartı́n, E. L., Zapatero Osorio, M. R.: 1997, MNRAS, 286, 17\nMohanty, S., Basri, G.: 2003, ApJ, 583, 451\nNatta, A., et al.: 2004, A&A, 424, 603\nPinfield, D. J., et al.: 2000, MNRAS, 342, 1241\nScholz, A., Jayawardhana, R., Brandeker, A.: 2005, ApJL, 629, 41\nScholz, A., Eislöffel, J., Froebrich, D.: 2005, A&A, 438, 675\nScholz, A., Eislöffel, J.: 2005, A&A, 429, 1007 (SE05)\nScholz, A., Eislöffel, J.: 2004, A&A, 421, 259 (SE04b)\nScholz, A., Eislöffel, J.: 2004, A&A, 419, 249 (SE04a)\nStassun, K. G., Terndrup, D.: 2003, PASP, 115, 505\nTerndrup, D. M., et al.: 1999, AJ, 118, 1814\nTerndrup, D. M., et al.: 2000, AJ, 119, 1303\nZapatero Osorio, M. R., et al.: 2003, A&A, 408, 663\n\n\f"}