{"id": "http://arxiv.org/abs/astro-ph/0302226v1", "guidislink": true, "updated": "2003-02-11T22:10:44Z", "updated_parsed": [2003, 2, 11, 22, 10, 44, 1, 42, 0], "published": "2003-02-11T22:10:44Z", "published_parsed": [2003, 2, 11, 22, 10, 44, 1, 42, 0], "title": "The Phenomena of High Energy Astrophysics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0302216%2Castro-ph%2F0302184%2Castro-ph%2F0302588%2Castro-ph%2F0302376%2Castro-ph%2F0302412%2Castro-ph%2F0302159%2Castro-ph%2F0302017%2Castro-ph%2F0302258%2Castro-ph%2F0302539%2Castro-ph%2F0302169%2Castro-ph%2F0302055%2Castro-ph%2F0302102%2Castro-ph%2F0302152%2Castro-ph%2F0302012%2Castro-ph%2F0302590%2Castro-ph%2F0302215%2Castro-ph%2F0302162%2Castro-ph%2F0302121%2Castro-ph%2F0302235%2Castro-ph%2F0302116%2Castro-ph%2F0302417%2Castro-ph%2F0302056%2Castro-ph%2F0302062%2Castro-ph%2F0302471%2Castro-ph%2F0302023%2Castro-ph%2F0302182%2Castro-ph%2F0302369%2Castro-ph%2F0302463%2Castro-ph%2F0302237%2Castro-ph%2F0302554%2Castro-ph%2F0302302%2Castro-ph%2F0302419%2Castro-ph%2F0302558%2Castro-ph%2F0302217%2Castro-ph%2F0302423%2Castro-ph%2F0302360%2Castro-ph%2F0302597%2Castro-ph%2F0302552%2Castro-ph%2F0302044%2Castro-ph%2F0302455%2Castro-ph%2F0302367%2Castro-ph%2F0302106%2Castro-ph%2F0302170%2Castro-ph%2F0302292%2Castro-ph%2F0302076%2Castro-ph%2F0302379%2Castro-ph%2F0302036%2Castro-ph%2F0302483%2Castro-ph%2F0302247%2Castro-ph%2F0302509%2Castro-ph%2F0302375%2Castro-ph%2F0302345%2Castro-ph%2F0302014%2Castro-ph%2F0302397%2Castro-ph%2F0302384%2Castro-ph%2F0302421%2Castro-ph%2F0302298%2Castro-ph%2F0302570%2Castro-ph%2F0302374%2Castro-ph%2F0302583%2Castro-ph%2F0302139%2Castro-ph%2F0302361%2Castro-ph%2F0302431%2Castro-ph%2F0302380%2Castro-ph%2F0302517%2Castro-ph%2F0302134%2Castro-ph%2F0302096%2Castro-ph%2F0302261%2Castro-ph%2F0302161%2Castro-ph%2F0302088%2Castro-ph%2F0302473%2Castro-ph%2F0302527%2Castro-ph%2F0302063%2Castro-ph%2F0302226%2Castro-ph%2F0302592%2Castro-ph%2F0302212%2Castro-ph%2F0302142%2Castro-ph%2F0302596%2Castro-ph%2F0302124%2Castro-ph%2F0302001%2Castro-ph%2F0302048%2Castro-ph%2F0302095%2Castro-ph%2F0302280%2Castro-ph%2F0302363%2Castro-ph%2F0302003%2Castro-ph%2F0302413%2Castro-ph%2F0302510%2Castro-ph%2F0302024%2Castro-ph%2F0302458%2Castro-ph%2F0302580%2Castro-ph%2F0302282%2Castro-ph%2F0302193%2Castro-ph%2F0302111%2Castro-ph%2F0302265%2Castro-ph%2F0302199%2Castro-ph%2F0302516%2Castro-ph%2F0302206%2Castro-ph%2F0302277%2Castro-ph%2F0302400%2Castro-ph%2F0302225%2Castro-ph%2F0302268&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Phenomena of High Energy Astrophysics"}, "summary": "A brief summary of some highlights in the study of high energy astrophysical\nsources over the past decade is presented. It is argued that the great progress\nthat has been made derives largely from the application of new technology to\nobservation throughout all of the electromagnetic and other spectra and that,\non this basis, the next decade should be even more exciting. However, it is\nimperative to observe cosmic sources throughout these spectra in order to\nobtain a full understanding of their properties. In addition, it is necessary\nto learn the universal laws that govern the macroscopic and the microscopic\nbehavior of cosmic plasma over a great range of physical conditions by\ncombining observations of different classes of source. These two injunctions\nare illustrated by discussions of cosmology, hot gas, supernova remnants and\nexplosions, neutron stars, black holes and ultrarelativistic outflows. New\ninterpreations of the acceleration of Galactic cosmic rays, the cooling of hot\ngas in rich clusters and the nature of ultrarelativistic outflows are outlined.\nThe new frontiers of VHE $\\gamma$-ray astronomy, low frequency radio astronomy,\nneutrino astronomy, UHE cosmic ray physics and gravitational wave astronomy are\nespecially promising.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0302216%2Castro-ph%2F0302184%2Castro-ph%2F0302588%2Castro-ph%2F0302376%2Castro-ph%2F0302412%2Castro-ph%2F0302159%2Castro-ph%2F0302017%2Castro-ph%2F0302258%2Castro-ph%2F0302539%2Castro-ph%2F0302169%2Castro-ph%2F0302055%2Castro-ph%2F0302102%2Castro-ph%2F0302152%2Castro-ph%2F0302012%2Castro-ph%2F0302590%2Castro-ph%2F0302215%2Castro-ph%2F0302162%2Castro-ph%2F0302121%2Castro-ph%2F0302235%2Castro-ph%2F0302116%2Castro-ph%2F0302417%2Castro-ph%2F0302056%2Castro-ph%2F0302062%2Castro-ph%2F0302471%2Castro-ph%2F0302023%2Castro-ph%2F0302182%2Castro-ph%2F0302369%2Castro-ph%2F0302463%2Castro-ph%2F0302237%2Castro-ph%2F0302554%2Castro-ph%2F0302302%2Castro-ph%2F0302419%2Castro-ph%2F0302558%2Castro-ph%2F0302217%2Castro-ph%2F0302423%2Castro-ph%2F0302360%2Castro-ph%2F0302597%2Castro-ph%2F0302552%2Castro-ph%2F0302044%2Castro-ph%2F0302455%2Castro-ph%2F0302367%2Castro-ph%2F0302106%2Castro-ph%2F0302170%2Castro-ph%2F0302292%2Castro-ph%2F0302076%2Castro-ph%2F0302379%2Castro-ph%2F0302036%2Castro-ph%2F0302483%2Castro-ph%2F0302247%2Castro-ph%2F0302509%2Castro-ph%2F0302375%2Castro-ph%2F0302345%2Castro-ph%2F0302014%2Castro-ph%2F0302397%2Castro-ph%2F0302384%2Castro-ph%2F0302421%2Castro-ph%2F0302298%2Castro-ph%2F0302570%2Castro-ph%2F0302374%2Castro-ph%2F0302583%2Castro-ph%2F0302139%2Castro-ph%2F0302361%2Castro-ph%2F0302431%2Castro-ph%2F0302380%2Castro-ph%2F0302517%2Castro-ph%2F0302134%2Castro-ph%2F0302096%2Castro-ph%2F0302261%2Castro-ph%2F0302161%2Castro-ph%2F0302088%2Castro-ph%2F0302473%2Castro-ph%2F0302527%2Castro-ph%2F0302063%2Castro-ph%2F0302226%2Castro-ph%2F0302592%2Castro-ph%2F0302212%2Castro-ph%2F0302142%2Castro-ph%2F0302596%2Castro-ph%2F0302124%2Castro-ph%2F0302001%2Castro-ph%2F0302048%2Castro-ph%2F0302095%2Castro-ph%2F0302280%2Castro-ph%2F0302363%2Castro-ph%2F0302003%2Castro-ph%2F0302413%2Castro-ph%2F0302510%2Castro-ph%2F0302024%2Castro-ph%2F0302458%2Castro-ph%2F0302580%2Castro-ph%2F0302282%2Castro-ph%2F0302193%2Castro-ph%2F0302111%2Castro-ph%2F0302265%2Castro-ph%2F0302199%2Castro-ph%2F0302516%2Castro-ph%2F0302206%2Castro-ph%2F0302277%2Castro-ph%2F0302400%2Castro-ph%2F0302225%2Castro-ph%2F0302268&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A brief summary of some highlights in the study of high energy astrophysical\nsources over the past decade is presented. It is argued that the great progress\nthat has been made derives largely from the application of new technology to\nobservation throughout all of the electromagnetic and other spectra and that,\non this basis, the next decade should be even more exciting. However, it is\nimperative to observe cosmic sources throughout these spectra in order to\nobtain a full understanding of their properties. In addition, it is necessary\nto learn the universal laws that govern the macroscopic and the microscopic\nbehavior of cosmic plasma over a great range of physical conditions by\ncombining observations of different classes of source. These two injunctions\nare illustrated by discussions of cosmology, hot gas, supernova remnants and\nexplosions, neutron stars, black holes and ultrarelativistic outflows. New\ninterpreations of the acceleration of Galactic cosmic rays, the cooling of hot\ngas in rich clusters and the nature of ultrarelativistic outflows are outlined.\nThe new frontiers of VHE $\\gamma$-ray astronomy, low frequency radio astronomy,\nneutrino astronomy, UHE cosmic ray physics and gravitational wave astronomy are\nespecially promising."}, "authors": ["R. D. Blandford"], "author_detail": {"name": "R. D. Blandford"}, "author": "R. D. Blandford", "arxiv_comment": "To appear in \"High Energy Processes and Phenomena in Astrophysics,\n  IAU Symposium 214\", X. Li, Z. Wang, V. Trimble (eds)", "links": [{"href": "http://arxiv.org/abs/astro-ph/0302226v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0302226v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0302226v1", "affiliation": "Caltech", "arxiv_url": "http://arxiv.org/abs/astro-ph/0302226v1", "journal_reference": null, "doi": null, "fulltext": "Star Formation through Time\nASP Conference Series, Vol. **VOLUME***, 2003\nE. Pérez, R.M. González Delgado, G. Tenorio-Tagle\n\nThe Phenomena of High Energy Astrophysics\nR. D. Blandford\n\narXiv:astro-ph/0302226v1 11 Feb 2003\n\n130-33 Caltech, Pasadena, CA 91125 USA\nAbstract. A brief summary of some highlights in the study of high energy astrophysical sources over the past decade is presented. It is argued\nthat the great progress that has been made derives largely from the application of new technology to observation throughout all of the electromagnetic and other spectra and that, on this basis, the next decade should be\neven more exciting. However, it is imperative to observe cosmic sources\nthroughout these spectra in order to obtain a full understanding of their\nproperties. In addition, it is necessary to learn the universal laws that\ngovern the macroscopic and the microscopic behavior of cosmic plasma\nover a great range of physical conditions by combining observations of\ndifferent classes of source. These two injunctions are illustrated by discussions of cosmology, hot gas, supernova remnants and explosions, neutron\nstars, black holes and ultrarelativistic outflows. New interpreations of the\nacceleration of Galactic cosmic rays, the cooling of hot gas in rich clusters\nand the nature of ultrarelativistic outflows are outlined. The new frontiers of VHE γ-ray astronomy, low frequency radio astronomy, neutrino\nastronomy, UHE cosmic ray physics and gravitational wave astronomy\nare especially promising.\n\n1.\n\nTwo Decades of High Energy Astrophysics\n\nThere has been a wonderful decade of discovery in high energy astrophysics.\nAccretion disks surrounding massive black holes in active galactic nuclei (AGN)\nhave been traced into relativistic regimes using ASCA, Chandra and XMMNewton (e.g. Fabian 2002, Wilms et al. 2001). Other disks around similar\nsources create ultrarelativistic outflows, or jets, that have been directly imaged\non scales from pc to Mpc using HALCA and the VLBA (e.g. Junor, Biretta\n& Livio 1999), and Chandra (e.g. Wilson, Young & Shopbell 2001) and, indirectly, probed on sub–pc scales using EGRET (e.g. Hartman et al. 1992) and\natmospheric Cerenkov telescopes (e.g. Quinn et al. 1998). Similar jets and disks\nhave been associated with Galactic X-ray binaries (XRB) and shown to exhibit Quasi-Periodic Oscillations (QPOs) using, especially, RXTE (e.g. van der\nKlis 1998). Gamma Ray Bursts (GRB) were placed at cosmological distances\nfollowing observations by BATSE (Meegan et al. 1992) which was confirmed by\nground-based spectroscopy of X-ray afterglows discovered by Beppo-SAX (Costa\net al. 1997, Metzger et al. 1997). These bursts also appear to comprise collimated, ultrarelativistic outflows which eventually form the afterglows discovered\nby Beppo-SAX and which, in turn, presumably evolve to form a small fraction\n1\n\n\f2\n\nR. D. Blandford\n\nof the supernova remnants (SNR) whose dynamics and composition have been\nmapped at X-ray energies (e.g. Canizares 2002). The X-ray background was\neffectively associated with individual faint sources by ROSAT (as confirmed by\nChandra and XMM-Newton, e.g. Hasinger 2002, Brandt et al. 2002). Evidence\nof the hot intergalactic medium (IGM) has been found by FUSE (eg Tripp, Savage & Jenkins 2000) and, more recently,reported with Chandra (e.g. Fang et al.\n2002) and we are now studying this same gas in rich clusters of galaxies in fine\nspectroscopic detail (e.g. Mushotzky 2002)\nThese (electromagnetic) discoveries have been matched by great discoveries\nin cosmic ray physics. The atomic and isotopic composition of cosmic rays has\nbeen measured in exquisite detail by ACE and the spectrum has been extended\nto ultra high energy (UHE) by the AGASA and HiRes arrays. In addition, neutrino mass has been detected by painstaking work at Homestake, Kamionkande,\nSNO and KamLAND (e.g. Eguchi et al. 2003).\nThese examples, which could surely be matched by a quite separate list\ninvolving different sources and observatories, are, arguably, as far-reaching and\nof equal popular interest to the great discoveries that have been made over a\nsimilar period in cosmology and extra-solar planets.\nThe coming decade should be no less exciting. Integral has just been\nlaunched. Auger and Hess, which will detect UHE cosmic rays at ZeV energy and VHE γ-rays at TeV energy with unprecedented sensitivity, are just\ncoming on line. Swift will study GRBs and produce a long overdue hard X-ray\nsurvey. Astro-E2, has a planned 2005 launch and will perform high dispersion\nspectrosocopy of accretion disks etc. This will be followed quickly by GLAST\nwhich should be roughly 50 times a powerful as EGRET. There are ambitious\nplans to open up high energy neutrino astronomy by augmenting AMANDA and\nconstructing IceCube. LIGO is already operational and it is hoped that it will\nstart gravitational radiation astronomy. There is also optimism that the space\nmissions, Constellation-X/XEUS, LISA and EXIST will be started by the end\nof the decade.\nhat this impressive list of operating and planned missions also brings out is\nthat high energy astrophysics is an integrating discipline. Sources are observable\nover ∼ 70 octaves of the electromagnetic spectrum (including the single octave\nclaimed by optical astronomers!) from <\n∼ 100 MHz to >\n∼ 10 TeV. If we look\nforward to gravitational and cosmic ray astronomy, the spctrum expands to fill\nthe interval from <\n∼ 100μHz gravitons to >\n∼ 1 ZeV protons and the number of\noctaves doubles. High energy sources are invariably nonthermal which implies\nthat they must be observed \"holistically\". Panchromatic campaigns to study\nAGN have been common for more than twenty years and, more recently, multiwavelength observations have been the key to the study of GRB afterglows.\nThere is a second, integrating feature of high energy astrophysics and this\nhas been less appreciated and, so far, less exploited. This is that much of what\nwe can observe depends upon a fairly small number of physical processes that\nwe do not understand very well. However, these processes should be sourceindependent. Examples include the behavior of ultrarelativistic shock fronts,\nthe rates of thermalization and the thermal conductivity of hot magnetized\nplasma and the viscosity of shear flows. Ultrarelativistic flows, in general, are\nseen in AGN jets, pulsar wind nebulae (PWN) and GRBs and there is every\n\n\fAPS Conf. Ser. Style\n\n3\n\nreason to undertake comparative studies to understand their general, global,\nbehavior. The rate of particle acceleration and magnetic field generation at a\nrelativistic shock front ought to depend solely on the Mach number (or, equivalently, the Lorentz factor). Hot plasmas are observed in the laboratory, in\nthe solar corona, in the inter-planetary, -stellar and -galactic media. Most of\nthe important transport processes should scale simply with density and in an\nunknown, though universal manner with temperature. The effective angular\nmomentum, mass and energy transport in strongly, shearing media, likewise\nprobably depends on a set of elementary principles. Here, numerical simulations are starting to be especially instructive. I expect that exploiting the wide\nvariety of physical conditions in cosmic sources to divine fundamental scaling\nrelations will be a major feature of high energy astrophysics research over the\nnext decade.\n2.\n\nThe Cosmological Context\n\nThe recent maturation of observational cosmology has special implications for\nhigh energy astrophysics. There now exists a cosmological framework in which\nto interpret the observations. Although we do not understand much at all about\nwhy this is the case, we do appear to inhabit a universe with Hubble constant\n∼ 65km s−1 Mpc−1 age, ∼ 14 Gyr, a flat spatial geometry, and a current composition of roughly 70 percent dark energy, 25 percent dark matter and 5 per\ncent baryonic matter. This knowledge, allows us to be much more quantitative when analyzing individual sources, especially when estimating pressures,\ndensities, speeds etc.\nHigh energy observations have contributed significantly to the development\nof this framework. The most important example is the measurement of the matter density by observing the X-ray emission from clusters of galaxies. This has\nconsistently given a value of roughly Ω ∼ 0.3 for a decade (predicated on the\ntheory of big bang nucleosynthesis) and it is now claimed that the measurement\nerror is better than ten percent (Allen, Schmidt & Fabian 2002. This same analysis led to an equally important value for the density fluctuation normalization,\nσ8 = 0.7.\nOne example of the importance of being quantitative is in understanding the\ngrowth of massive black holes in AGN. The most recent determinations of the\nblack hole mass density in contemporary galactic nuclei concludes that holes have\nto be assembled quite efficiently (with efficiencies ǫ ∼ 0.2, Yu & Tremaine 2002)\nand therefore radiatively. Furthermore, the discovery of powerful quasars at\nredshift z ∼ 6.5 (Fan et al. 2001) implies that the first black holes probably grew\nat a rate faster than the Salpeter rate, simultaneous with the growth of the host\ngalaxy. This, in turn has implications for the contribution of quasar ultraviolet\nradiation (probably small) to the intergalactic, photoionizing radiation field.\nThere is a good possibility that GRBs will be seen to even greater redshifts than\nquasars and provide different probes of intervening material.\nAnother connection between high energy astrophysics and cosmology involves VHE γ-rays which constrain the mid-far infrared background. A complementary constraint is provided by the highest energy cosmic rays whose range is\nsimilarly limited by photopion production on the microwave background. Here\n\n\f4\n\nR. D. Blandford\n\nwe know the opacity very well and it it is the sources whose location is unknown,\nbut must lie within ∼ 30 Mpc at the highest energies detected.\n3.\n\nHot Gas\n\nThe two best laboratories for studying transport processes at high temperature\nare rich galaxy clusters and supernova remnants. Recent X-ray observations of\nboth of these have been impressively detailed and are still far from digested.\n3.1.\n\nClusters of Galaxies and the Intergalactic Medium\n\nClusters are important cosmologically because as we have just seen, they are\nthought to be large enough to provide a fair sample of the baryons and because\nthey are very convenient tracers of the growth of large scale structure that can\nbe identified at large redshift through X-ray surveys, Sunyaev-Zel'dovich effect\nstudies and weak lensing investigations. They are also important because they\nharbor the oldest galaxies at a given cosmic time and provide the best fossil\nrecord of the formation of the first galaxies.\nClusters have become important physically because they can teach us about\nthe microphysical behavior of hot plasma. This has been become central to\nattempts to resolve the \"cooling flow paradox\". It has been known for a long\nwhile that the radiative cooling times of the gas at the centers of rich clusters is\noften shorter than the cluster ages. It was then supposed that the gas would flow\ninto the central cD galaxies at rates as high as ∼ 1000M⊙ yr−1 . What appears\nto be happening is that the gas starts to cool more or less as anticipated, but\nthen it almost vanishes only to reappear at much lower temperature radiating\noptical and ultraviolet emission lines copiously from gas with T ∼ 2 × 104 K and\ndensity n ∼ 100 cm−3 (e.g. Peterson et al. 2003).\nThere are some important clues as to what is going on. The gas that\nis observed at high temperature appears to be in thermal equilibrium and\nthe isotherms are nested quasi-spherical surfaces. Another important clue has\nemerged from studies of clusters like the Perseus and Virgo clusters that contain\ndouble radio sources. The X-ray emission from the areas of the sky occupied\nby these radio sources is reduced, suggesting that the the strongly magnetized,\nrelativistic plasma responsible for the radio emission does not, in practice, mix\nwell with the cooler (i.e. with temperature ∼ 108 K!) plasma into which it is\nexpanding. This inference has been reinforced by the discovery of fossil radio\nsources, presumably associated with earlier phases of nuclear activity, that are\nrising under buoyancy in the cluster gravitational field (e.g. Fabian et al. 2002).\nSome additional deductions have been made, rather more controversially. The\ngas immediately surrounding these bubbles is actually cooler than most of the\ncluster gas. The existence of these large temperature gradients in rich clusters\nargues that the effective mean free paths of hot electrons are smaller than given\nby Coulomb scattering in unmagnetized plasma. Most attempts to account for\nthe thermal structure of clusters have posited some form of heating to prevent\nthe gas from cooling. This seems rather unpromising. Piling gas up at a temperature where it can radiate relatively efficiently does not seem a good way\nto make it disappear! Also the radio sources, the most promising sources of\ndistributed heating, do not appear to perform this function.\n\n\fAPS Conf. Ser. Style\n\n5\n\nI would like to propose a rather different explanation for these observations.\nThe gas that accumulates in rich clusters has a very high entropy relative to the\n∼ 104 K gas that was ionized when the universe was ∼ 0.5 Gyr old. The most\nlikely source of this entropy is passage through a strong shock front formed as\ngalaxy-sized perturbations become nonlinear and drive gas with sound speed\n∼ 10 km s−1 together with speeds ∼ 300 km s−1 (e.g. Miniati et al. 2000). (Supernova explosions and expanding, double radio sources can also create strong\nshock fronts.) The post-shock gas will have a density ∼ 10−3 cm−3 , a temperature ∼ 106 K and a pressure ∼ 10−12 dyne cm−2 . Now a gravitationally-induced\nshock in the IGM should behave just like one of similar Mach number (M ∼ 30)\nin the ISM (see below). This implies that there should be a large, post-shock,\ncosmic ray partial pressure, roughly ∼ 0.3 times the total pressure (e.g. Miniati\net al. 2000). As the gas expands, following the passage of the shock, and as a\nconsequence of the general expansion of the universe, the cosmic ray pressure\nwill become slightly more important and may even dominate. However, if and\nwhen this gas collects into a deep potential well formed by a rich cluster of\ngalaxies, the gas will be compressed and the cosmic ray pressure will decrease\nrelative to that of the gas. The gas that is observed to be cooling in centers of\nrich clusters has a pressure similar to that in post shock gas and the ∼ GeV\ncosmic ray pressure is still likely to contribute about ∼ 30 percent of the total.\nThese cosmic rays should make clusters into ∼ GeV γ-ray sources, detectable\nby GLAST. Nonthermal emission from the electrons may have also been seen\nin the extreme ultraviolet (e.g. Durret et al. 2002). Finally, careful modeling\nof relaxed clusters using X-ray, lensing and microwave background observations\nmay lead to detection of a pressure deficit in the thermal gas.\nWhen the cluster gas starts to cool, as it must eventually, it will compress\nby a factor of a few until the cosmic pressure dominates and resists further\ncompression. The gas will then cool roughly isochorically and the inflow will\nbe halted or at least seriously inhibited. It is then possible for the cool gas\nto permeate the warm (T ∼ 107 K) gas and radiate away the internal energy\ncontained in the warm gas. In principle, this can be very efficient. Suppose that\nthe cool gas has a temperature ∼ 105 K, where its emissivity is maximized (cf.\nKrolik 1999), and a pressure of ∼ 10−10 dyne cm−2 , typical of the center of a\nrich cluster. ∼ 3× 107 M⊙ of cool gas occupying a fraction ∼ 10−5 of the volume\nsuffices to radiate the missing soft X-ray power in the ultraviolet.\nThe problem is one of getting the energy from the hot gas to the cold gas\nfast enough. The traditional approach is to suppose that the interface is a static,\nconductive atmosphere. If the conductivity is dictated by Coulomb scattering\nthen it scales ∝ T 5/2 and the thermal contact is poor unless the cool gas is\nseriously overpressured with respect to the warm gas. However, this may not\nbe the right description of the gas. The situation is likely to be quite complex\nfor a variety of reasons. Firstly, the dynamical situation, may become unstable\nto Rayleigh-Taylor instablity. In addition, the galaxies that move almost sonically through the cluster, will be followed by large turbulent wakes containing\nstreaks of cool gas that has been stripped from galaxies.. Finally, the ongoing\naggregation of large groups of galaxies will drive large oscillations in the cluster\ngas. The gas is likely to end up quite well-stired so that the warm gas flows\npast the cool gas on a timescale short compared with the conductive time so\nthat the electrons may not be in local thermodynamic equilibrium. To give a\n\n\f6\n\nR. D. Blandford\n\nquantitative example, the electrons in the warm phase have speeds ∼ 10, 000 km\ns−1 and a Coulomb mean free path ∼ 30 pc in the warm medium. It is therefore possible that the warm electrons may be brought closer to the cool gas by\nturbulent mixing than a mean free path and they are thereby able to come into\ndirect contact with it. With this arithmetic,the Coulomb heating rate can now\njust balance the cooling rate of the cool gas.\nA small quantity of cool gas, co-existing with the hot gas may then act as an\neffective heat sink, removing heat non-radiatively from the hot gas and radiating\nit away at a lower temperature. Understanding the heat transfer is central to\nunderstanding the mass flow. In the simple theory of evaporation, an inward\nconduction of heat is balance by an outward energy flux, 5P v/2. and the cloud\nevaporates. However what is envisaged here is that that there is a volumetric\nheating which is roughly balanced by radiative cooling. If the cooling exceeds\nthe heating, there will be a steady condensation of hot gas onto the cool cloud;\nif the heating dominates, there will be evaporation. This may be self-regulating.\nClearly a much more careful investigation is called for to see if the above sketch\nhas any validity.\nThere has also been progress in studying the hot intergalactic medium outside clusters that recapitulates the progress that was made in understanding the\ninterstellar medium following the launch of the Copernicus satellite. FUSE has\nobserved local IGM in emission at a temperature ∼ 105 K. and both Chandra\nand XMM-Newton have reported detections of hotter gas in both the local and\nthe distant universe with temperature that may be as high as ∼ 5 × 106 K, although the interpretation of these observations is not yet consistent. The state\nof the IGM is a good monitor of the development of both large scale structure\nand stellar activity in the expanding universe. This is because the IGM is probably only heated to a temperature ∼ 1 − 2 × 104 K after reionization (which\nprobably occurs when the universe is ∼ 0.5 Gyr old following the formation of\nthe first massive stars, Bromm, Coppi & Larsen 1999).\n3.2.\n\nSupernova Remnants and the Interstellar Medium\n\nIf we had never seen supernovae or their remnants but had access to ultraviolet observations of hot stars, we would ask similar questions of the interstellar\nmedium. However, we now know that it is the explosions of massive stars and\nnot gravitational action that keeps most of the volume of the Galaxy at a temperature of nearly a million degrees. However, the details of how this happens\nare controversial. Most importantly, we do not understand how the bounding\nshock waves behave. We are not sure how the post-shock electron and ion temperature depend upon the Mach number and how quickly these two components\nequilibrate. The indications are that the most of the energy flux is carried by the\nions and that the electrons are heated at rates that reflect Coulomb scattering,\nbut we need to be more quantitative.\nThe acceleration of Galactic cosmic rays has long been associated with\nsupernova remnants. Most of the cosmic ray energy density is in the form of\n∼ 1 GeV particles and models of the particle acceleration suggest that typical\nhigh Mach number shocks transmit a cosmic ray partial pressure that is ∼\n0.1 − 0.5 times the total momentum flux. However, the observational evidence\nis confusing. On the one hand, ASCA observations of SN1006 first showed the\n\n\fAPS Conf. Ser. Style\n\n7\n\npresence of a nonthermal component in the X-ray spectrum which was taken as\nprima facie evidence that relativistic electrons were accelerated by some shock\nwaves. However, there are other remants where the TeV γ-rays might have been\nexpected and these are not seen, suggesting that the maximum energy to which\nthe particles are accelerated is well below ∼ 1 TeV. Ion acceleration, can be\ndetected though π 0 γ-rays. which may be seen by Hess, VERITAS and GLAST\nand has been reported by Enomoto et al. (2002), (but see Reimer & Pohl 2002).\nIt is also of quite general importance to understand how magnetic field\nbehaves at shock fronts. The nonthermal emission that is measured may only\nrequire a simple compression of the pre-shock magnetic field so that its energy\ndensity is ignorable. A much greater stretching of the field is likely to occur in the\nvicinity of the contact discontinuity where the ejecta from the stellar envelope\ninteracts with the circumstellar medium. A combination of radio polarization,\noptical and X-ray observations should again furnish some quantitative answers.\nAs a further illustration of how important it is to mobilise all the high\nenergy observations to try to figure out the principles which govern the behavior\nof high temperature plasma, let me introduce a second \"cosmic ray\" paradox\nrelating to the acceleration and propagation of Galactic cosmic rays. It is known\nthat the observed cosmic ray spectrum has an energy-dependence N (E) ∝ E −2.6\nand that the energy dependence of the observed spectra of secondary elements\nlike Li, Be, B is steeper than that of the primary particles, N (E) ∝ E −3 .\nThis implies that the grammage traversed by cosmic rays before they escape\nvaries with energy as λ ∝ E −0.4 and, consequently, that the sourced spectrum\nof the primary particle satisfies S(E) ∝ E −2.2 , approximately. This is just\nwhat is expected in simple views of shock accleration theory and was one of\nthe strongest arguments for taking it seriously. However, the observed primary\nspectrum extends all the way up to the famous \"knee\" in the spectrum around\n1 PeV. This is inconsistent with the observation mentioned above that some\nsupernova remnants only accelerate particles to much lower energy. It may also\nbe incompatible with the measured cosmic ray anisotropy. This can be estimated\nby the ratio of the column density of the local interstellar medium ∼ 1 − 2 mg\ncm−2 to the grammage λ(E) traversed. The observed anisotropy at high energy\nmay also be too small to be compatible with the standard power law model.\nA possible resolution of this paradox is that individual SNR accelerate cosmic rays with power law spectra up to energies in the interval ∼ 0.1 TeV to\n∼ 1 PeV so that their collective effect is to produce a quite convex source spectrum S(E). If this is now combined with a propagation model in which λ(E) has\na compensatory concave shape. In other words, the grammage does not continue\nto decrease as a power law with increasing energy, but saturates. The quotient\nof the source spectrum and the grammage then, coincidentally, leads to a single\npower law spectrum. This leads to a prediction that the light element spectra\nshould be concave. Whatever the true explanation, if we can understand on the\nbasis of empirical arguments like this how cosmic ray protons and electrons are\naccelerated by shock waves and how they propagate, then we can export this\nunderstanding to the IGM.\n\n\f8\n4.\n\nR. D. Blandford\nSupernovae\n\nThe spectacular imaging spectroscopy of supernova remnants of many different\ntypes by Chandra is starting to address many of these questions and should\nsupply plenty of forensic evidence to enable us to reconstruct many of the details of the initial explosion, through studies of the distributions of the different\nelements (Canizares 2002).\nSN 1987a was a touchstone for our understanding of core collapse supernovae (e.g. Michael et al. 2002). It produced the first detected supernova neutrinos and a pleasing affirmation of the most fundamental principles of advanced\nstellar evolution. However, it also provided some surprises. The absence of\nhydrogen from its intial spectrum led to its intial identification with a Type\nIa supernova. However it clearly is a variant on the Type II supernova known\nas Type Ib and is characterized by the absence of a hydrogen envelope on the\npresupernova star.\nThere were other surprises. The γ-rays were observed far earlier than expected suggesting that the ejecta become highly inhomogeneous very quickly.\nSN1987a is coming back into prominence as its blast wave is just now encountering the equatorial ring of matter left behind by outflow associated with the\npre-supernova star.\nNow GRB are currently most fashionably associated with Type Ic supernova in which the helium envelope has also been stripped away. There are many\npuzzles raised by this model, foremost among them is the nature of the medium\ninto which the relativistic blast wave, that forms the afterglow, expands. Consideration of what is observed in SN1987a could be quite instructive for models\nof GRBs. In particular we do not understand when neutron stars are left behind and when black holes form. More fundamentally, we do not have a widely\naccepted, working model of how any core collapse supernova model works. It is\npossible that some of the features of GRB models could, contrariwise, provide\nthe missing ingredient for the Type II case.\n\n5.\n\nNeutron Stars\n\nMost neutron stars are observed long after formation. They are seen as XRB\nand they appear to be over-represented in globular clusters and this is attributed\nto three body dynamical stellar exchanges and recycling. The relative formation\nrates of neutron stars and black holes is also attracting some attention as three\nmicrolenses have been discovered where the lens is argued to be an unseen star\nwith mass well in excess of the upper limit for a neutron star. This suggest\nthat single black holes might be quite common in the halo of our Galaxy. These\nholes will be rather hard to detect by other means unless they have mass-losing\ncompanions - the accretion rate from the interstellar medium is probably too\nsmall to be of interest.\nNeutron stars have long been regarded as cosmic laboratories where Nature\nallows us to witness experiments performed upon cold nuclear matter, that complement the experiments performed on hot nuclear matter at heavy ion colliders,\nexploring physical conditions that are otherwise inaccessible. There have been\n\n\fAPS Conf. Ser. Style\n\n9\n\nseveral, recent reports, some of them quite controversial, of new observations of\nextreme physical conditions associated with neutron stars.\nSeveral soft gamma repeaters, exemplified by SGR 1806-20, have been identified with magnetars, slowly rotating strongly magnetized neutrons stars. In\nthe case of SGR 1806-20, the surface field strength is measured as ∼ 80 GT\nwhile the rotation period is ∼ 8 s, ensuring that the observed emission cannot\nbe rotation-powered. This contrasts with the X-ray pulsar SAX J1808.4 3658\nwhich has a measured period of ∼ 2.5 ms approaching that of the fastest radio\npulsar.\nObservations of the surface temperature are also important. In the case of\nRXJ1856.5 -3574, a temperature of ∼ 0.7 MK has been measured and a very\nsmall radius R ∼ 7 km inferred, provoking the suggestion that this could be\na quark star (Drake et al. 2002). However, the case is quite unconvincing as\nit depends upon an uncertain distance measurement and a particular spectral\ndecomposition (Braje & Romani 2002). For the central pulsar in the 821 year\nold supernova remnant 3C58, the temperature is below 1 MK (Slane, Helfand\n& Murray 2002). This is cooler than is computed on the basis of standard,\nmodified URCA cooling calulations. This could be an indication that there is\na pion or a kaon condensate in the core of the star. Alternatively, the proton\nfraction might be large enough to allow direct URCA cooling to take place (e.g.\nYakovlev et al. 2002).\nFinally, the X-ray source 1E1207.4 -5209 (Sanwal et al. 2002) exhibits two\nhelium absorption lines which may allow the neutron star surface potential to\nbe measured. As most neutron star masses have a pretty standard value ∼\n1.4 − 1.5 M⊙ , this allows the radius to be guessed and the equation of state\nabove nuclear density to be constrained.\n\n6.\n\nBlack Holes\n\nThere has been equally exciting activity in the study of black holes. Quasiperiodic oscillations (QPO) have been measured in several XRB, mostly associated with the accretion disk. It is clear that there is a very rich phenomenology\nto be understood, that encodes the mass and spin of the hole and which should\nallow general relativity to be tested. Unfortunately, there is still no widely accepted theory of QPOs that allows these identifications to be made. Normal\nmodes of oscillation of specialized disk models have been computed. However,\nthere is not an easy way to see how they can be excited and sustained at observable amplitudes and numerical simulations do not exhibit discrete modes\nlike these. In addition, it is highly unlikely that the oscillatory X-ray emission\narises from the photosphere of the disk. Their spectra are far too hard for this.\nInstead, it seems more likely that they are produced in an active corona. This\nrequires there to be a strong coupling, presumably magnetic, to exist between\nthe disk and the corona. If this is correct, then it certainly complicates the\ninterpretation of QPOs.\nThere has also been a lot of attention paid to the Fe Kα lines, originally\nreported by ASCA in Seyfert galaxies. These are now seen in XRB. Occasionally\nthese lines are quite broad, which has been widely attributed to a combination\n\n\f10\n\nR. D. Blandford\n\nof Doppler shift and gravitational redshift. There are some puzzles. Most lines\nare seen as narrow and it is not known why and when they turn out broad.\nThe most extreme example is MCG 60-30-15, where the line can extend\nfrom 2-6.5 keV. This has been interpreted in terms of a model where spin angular momentum from the spinning black hole is extracted by the disks, with\nmagnetic torques.(The energy released by steady, viscous disk accretion alone\ncannot account for the line profiles.) If this interpretation carries the day, then\nit supports the idea that relativistic jets are powered by black hole spin.\nIf additional evidence can be mustered for massive black holes spinning\nrapidly, then this has some interesting implications for their genesis. The point\nis that if black holes are built up by merging, as has often been proposed, then\na retrograde capture of a small hole by a large hole will involve a larger transfer\nof angular momentum than a prograde capture (e.g. Hughes & Blandford 2003).\nTherefore, black holes that grow by merging will generally spin down rather\nthan up and rapidly spinning holes are unlikely to be assembled in this way.\nThis is all consistent with the most recent comparisons of the density of local\nblack holes needed to account for the z ∼ 2 quasar light and the local hole mass\ndensity computed using the hole mass - bulge velocity dispersion.correlation.\n6.1.\n\nAdiabatic Accretion\n\nMuch attention has recently been devoted to what happens when gas is supplied\nto a hole at a rate much less than the Eddington rate. It has long been known\nthat if the viscosity is relatively large and the electron heating not much faster\nthan Coulombic, then the radiative efficiency is low and the gas will continue to\nheat up on an accretion timescale and will form a thick accretion disk or torus.\nIn fact, a similar outcome is possible when the gas supply rate greatly exceedcs\nthe Eddington rate. In this case, the radiative efficiency will be high but the\nradiation will be trapped by the accreting gas and the radiation pressure will\nsupport the thick disk. Either case can be described as \"adiabatic accretion\",\nby analogy with the nomenclature used to describe supernova remnants.\nThere have been three models proposed to describe adiabatic accretion.\nAdvection-Dominated Accretion Flows (Narayan & Yi 1994) are steady flows\nin which all the mass that is supplied crosses the event horizon. ConvectionDominated Accretion Flows (Quataert & Gruzinov 2000), are non-stationary\nand the mass supply backs up. In ADiabatic Inflow–Outflow Solutions (Blandford & Begelman 1999), most of the energy that is released close to the hole is\ncarried off in an outflow, usually, though not necessarily, involving a mass losing\nwind. In this case, the mass accretion rate will be much less that than the mass\nsupply rate.\nPerhaps the greatest challenge to these models is presented by our Galactic\ncenter (Baganoff et al. 2001). Here we know the black hole mass (∼ 2.6 ×\n106 M⊙ ) and can make an estimate of the mass accretion rate (∼ 1021 g s=1 ). The\nbolometric luminosity is ∼ 1036 erg s−1 and so the radiative efficiency relative to\nthe mass supply is only ∼ 10−6 c2 . Most of the power emerges in the sub mm\npart of the spectrum. The X-ray emission appears to be rapidly variable with\nlarge flares developing on timescales less than an hour. The X-ray spectrum\nis steep and presumably nonthermal implying an upper limit on the density of\ngas close to the hole. The large linear polarization at wavelengths <\n∼ 1 mm\n\n\fAPS Conf. Ser. Style\n\n11\n\nare similarly indicative that the density is low. These observations are strongly\nsuggestive that the rate of mass accretion onto the hole is much less than the\nrate of supply, implying that most of the supplied mass is driven off in a wind,\npowered by the small fraction that accretes onto the hole.This is entirely natural\nas the torque that transports angular momentum outward in an accreting flow\nalso transports energy so as to unbind an adiabatic flow. Provided that there\nis a either a means of creating entropy at the disk surface, as happens in the\nsolar wind, or large scale magnetic fields are present (as is also true of the solar\nwind), then outflows are to be expected.\nSimilar outflows are to be expected in the high mass accretion rate case\nand these are presumably responsible for the observed broad absorption lines\nthat are observed from many quasars. These principles should also apply to\naccretion onto Galactic black holes, for example GRS 1915+115 (e.g. Mirabel\n& Rodriguez 2002).\n7.\n\nUltrarelativistic Outflows\n\nThe most dramatic phenomena that are observed in high energy astrophysics\nare associated with the highest energy particles and the most nonthermal spectra. These, in turn, have been associated with ultrarelativistic outflows. I would\nnow like to be provocative and suggest that we may have been seriously misinterpreting most of these flows at least in recent years and that much older\ninterpretations may have been much closer to the truth (cf. Blandford 2002).\n7.1.\n\nPulsar Wind Nebulae\n\nLet me start with pulsar wind nebulae, like the Crab Nebula. These are powered\nby central, spinning, magnetized neutron stars and there is no dispute that the\nmechanical spin energy of the star is steadily converted into an electromagnetic\nPoynting flux that carries energy into the magnetosphere. To order of magnitude\nwe can associate a flux Φ ∼ 1014 Wb with the open field lines of a typical\npulsar and if the angular frequency is Ω ∼ 100 rad s−1 , the induced EMF is\nV ∼ ΩΦ ∼ 1016 V. We can think of this driving a current flow through the\nmagnetosphere. Under electromagnetic conditions, the \"load\" in the circuit will\nbe Z ∼ 100 Ω, and therefore the current will be I ∼ V /Z ∼ 1014 A. The power\ndissipated in the load - essentially the pulsar luminosity - is L ∼ V I ∼ 130 W.\nWhere is this load located? The conventional view is that this electromagnetic energy flux is somehow converted into a particle energy flux, perhaps\nin the vicinity of the light cylinder and probably comprising electron-positron\npairs. This is the location of the load. The Lorentz factor of the wind speed\nhas been estimated to be as high as ∼ 106 . This fluid outflow is then supposed\nto pass through a strong shock where its momentum flux matches the ambient\nnebular pressure and where relativistic particles are re-accelerated.and, perhaps,\nmagnetic field is regenerated.\nHowever, what is seen in the recent X-ray observations of pulsar wind nebulae is very surprising. Polar jets are quite common (e.g. Helfand 2001) and the\nring-like structures that are observed appear to be confined to the equatorial\nplane. (It is tempting to associate the moving, ring-like features, especially in\nthe Vela supernova remnant, with large glitch activity as occurs roughly once\n\n\f12\n\nR. D. Blandford\n\nper two years.) This tells us that accretion disks are not necessary to create a jet\nmorphology. It also tells us that if there really are fluid outflows that energize\nthe ray emission, then these are concentrated at the poles and in the equatorial\nplane.\nWhat I think these observations are, instead, telling us is that the current\ndoes not dissipate near the light cylinder but flows out into the nebula. There are\nrelatively strong arguments that suggest that large amplitude waves with periods\nequal to the rotation period will become nonlinear and unstable and therefore\nit is simplest to assume that the currents well beyond the light cylinder are\nprimarily conduction currents. However, this is not required.\nWe then have a picture of a pulsar wind nebula as a giant electrical circuit\nwith current flowing out (in) along the poles and in (out) in the equator. The\ncurrent completes at the slowly expanding surface of the nebula where there is a\ncontact discontinuity against the shocked interstellar medium. Associated with\nthese currents is a magnetic field that is ' largely toroidal that can be thought\nof as spun off by the central star. The energy flow in the nebula is given by the\n~ × B.\n~ The electric field distribution is basically poloidal and\nPoynting flux, E\nderives from space charge distributed along with the currents. If the pressure\nand the inertia of the plasma in the nebula can be ignored, and this is the\nappropriate approximation to make under electromagnetic conditions,then the\n~ + ~j × B\n~ = 0. The electromagnetic\nelectromagnetic field will be force-free i.e. ρE\nsetup can be much more complex than this simple model. There will probably\nbe currents and space charge flowing throughout the nebula and the pressure\nand inertia of the plasma in the nebula may well be important, but the simple\nmodel is sufficient to fix ideas.can be ignored.\nSuch a configuration is generically unstable (just like fluid jets). Typically,\npinches, kinks and, especially, helices develop around line currents in plasmas.\nLikewise, sheet currents, like those in the equatorial plane, are subject to tearing\nmode instability. Usually, this is regarded as a fatal defect for a model. However,\nI would argue that it is an attractive feature of the present proposal. This is\nbecause it is possible that the nonlinear development of these instablities is\nresponsible for the electrical resistance in the circuit and for the X-ray emission\nthat is observed along the poles and in the equatorial plane. (Note that the\nsource of the power that is dissipated in this manner is the magnetic energy\nstored in the nebula; it does not flow along the jet, but as Poynting flux from\nthe body of the nebula to where the current flows.) One possible way that this\ncan happen is that the macroscopic instability drives a wave turbulence cascade\nthat ultimately is dissipated at some inner scale through the acceleration of\nrelativistic electrons.\nThere are a variety of predictions associated with this model. The two\nmost direct are that the if the electrons are accelerated close to the currents,\nthen there should be spectral evidenced for aging as the particles diffuse away\nfrom the putative acceleration sites.Secondly the linear polarization ought to\nreflect the underlying magnetic field geometry.\n7.2.\n\nAGN Jets\n\nThe X-ray images of extragalactic (and also Galactic) jets are no less striking.and\npresent a similar choice. It now seems to be generally accepted that jet power\n\n\fAPS Conf. Ser. Style\n\n13\n\nderives from electro-/hydromagnetic stress applied on the black hole spacetime\nand the gas that orbits it. The details are just as contentious as with pulsars.\nIn round numbers, a powerful radio source, like Cygnus A, will generate an\nEMF V ∼ 300 EV, a current I ∼ 3 EA and a power L ∼ 1039 W. Again, it\nis commonly presumed that the circuit closes to the black hole and a fluid jet\nis collimated and launched. (Observations of M87 suggest that the collimation\nhappens within ∼ 100m, Junor, Biretta & Livio 1999.) The various features that\nare seen using VLBI in the compact, relativistic jets are usually identified with\ninternal shocks - the nonlinear development of velocity gradients associated\nwith either the source or instabilities (e.g. Blandford & Königl 1979). Their\nmeasured, outward, superluminal motion is then that of a shock front and the\nDoppler beaming is that of the downstream flow, which moves more slowly than\nthe shock front.\nThe jets themselves are impressively well-collimated. Even more remarkable\nis the discovery that they are X-ray bright along their length. In the case of\nsources like M87, it is argued that X-rays are due to synchrotron radiation. This\nimples that the particle acceleration must be occuring all the way along the jet's\nlength because the cooling times of the >\n∼ 10 TeV electrons are very short. This,\nin turn, implies that the acceleration cannot occur at internal shocks because\nstrong shocks must be separated by much more than the synchrotron cooling\nlengths.\nBy contrast, if we adopt the electromagnetic model, the \"jets\" delineate the\ncurrent which flows all the way along the jet to the hot spots and then back to\nthe central black hole mostly along the periphery of the source. The extended\nradio lobes contain a reservoir of magnetic energy that can supply the emitting\nregions with energy in addition to the Poynting flux of energy flowing along the\njet. (It is helpful to think of magnetic energy as moving with a speed equal to\n~ × B/B\n~ 2 which can be arbitrarily close to c. Disturbances can therefore be\nE\nobserved moving with apparent superluminal speed just like the disturbances in\nfluid jets.) Continuous X-ray emission along the jet causes no problem because\nthe current is continuous and ohmic dissipation / particle acceleration can occur\nall the way along it.\n7.3.\n\nGamma Ray Bursters\n\nFinally, consider, Gamma Ray Bursters (GRBs) (e.g. Mészáros 2002). These\ncome in two basic types with short and long duration. Only the latter class has\nbeen well-studied. Several \"long\" bursts have been associated with afterglows\nthat have been observed from radio frequencies to X-ray energies. Many of\nthe models of gamma ray bursts basically involve some form of electromagnetic\ninduction. A field of ∼ 100 GT associated with a rapidly spinning stellar mass\nblack hole or neutron star can induce an EMF V ∼ 30 ZV and a power ∼ 1043 W.\nThe source is typically active for ∼ 100 s so the total energy of the burst is\n∼ 1045 J. Observations of achromatic breaks in the afterglow light curves have\nbeen used to argue that the explosion is not isotropic but instead beamed within\na solid angle, typically ∼ 0.1 sterad. In other words, GRBs are relativistic jets\ntoo.\nThe conventional view of GRBs is, once again, that the Poynting flux is\nquickly and continuously transformed into a radiation-dominated fluid with a\n\n\f14\n\nR. D. Blandford\n\nhigh entropy per baryon, typically ∼ 106 k. This \"fireball\" (Cavallo & Rees 1078)\nis collimated into a pair of anti-parallel jets, perhaps within a collapsing massive\nstar. As the flow accelerates along these jets, the internal energy contained in\nthe radiation and pairs is transformed into the kinetic energy of the protons and\nby the time the photons can escape, the ions are moving with Lorentz factors\nΓ ∼ 300. Small velocity gradients, induced at the source, steepen into internal\nshocks at a radius ∼ 1011 m and γ-rays are emitted as synchrotron radiation.\nMost of the afterglow emission is formed at radii ∼ 1015−16 m at the external\nshock that precedes the spreading, decelerating jet.\nHowever, if the energy is released electromagnetically, it is quite hard to\nunderstand how entropy can be created so quickly. The potential differences are\nso large that the vacuum is, in effect, a perfect conductor so that the invariant\n~ *B\n~ = 0. If the other invariant c2 B 2 − E 2 is negative, then it will be possible\nE\nto transform into a frame where there is a pure electric field which will instantly\ndischarge; if it is positive, there will exist frames with a pure magnetostatic field,\nwhere nothing will happen. The problem is essentially the same as that of the\npulsar wind and I argue that it is quite reasonable that the escaping power be\npredominately electromagnetic.\nThere is a second, serious concern with the fireball model. High Lorentz\nfactors are necessary in the jet in order to avoid pair production by the escaping\nγ-rays. However, these high Lorentz factors are equivalent to high Mach numbers\n(M >\n∼ 300) and it is very hard to see how these can be formed naturally and\nbe sustained while, at the same time, dissipating much of their kinetic energy\nthrough internal shocks.\nThe electromagnetic model of GRBs posits that the energy remain in low\nentropy, electromagnetic form all the way out to the γ-ray emission region which\ncan be located around ∼ 1014 m. The flow is no more than mildly supersonic,\ndepending upon the plasma loading. By the time this radius is reached, the\nelectromagnetic field will be confined to a thin, relativistically expanding shell,\npushing a blast wave out into the surrounding medium. Instabiliites in this shell\nwill ultimately be responsible for the particle acceleration and the GRB.\nWhatever one's view of the relative merits of fluid and electromagnetic\nmodels of ultrarelativistic outflows, and perhaps the truth lies between the two\nextremes described above, it is clear that there is a convergence in the study of\npulsar wind nebulae, AGN/XRB jets and GRBs.\n8.\n\nPhysics at the Frontier\n\nHigh energy astrophysics is a young and relatively immature field. It owns\nmuch of the remaining unexplored \"discovery space\" in contemporary astronomy.\nTwo examples of this discovery space are the extremes of observation of the\nelectromagnetic spectrum. At the high end, there are already about ten TeV\nsources, while at the low end of <\n∼ 50 MHz radio astronomy there are essentially\nno sources. Neutrino astronomy claims only two cosmic sources so far, the sun\nand SN1987a. Even the venerable field of cosmic ray physics may be on the\nthreshold of becoming cosmic ray astronomy. Finally, as many of the most\ninteresting high energy sources are ultimately black holes and neutron stars,\nthe exciting field of gravitational wave astronomy - perhaps a decade away\n\n\fAPS Conf. Ser. Style\n\n15\n\nfrom birth - is inextricably linked to high energy astrophysics. These are the\nfrontiers and I consider them in turn.\nAtmospheric Cerenkov techniques are being used to detect γ-rays in the\nGeV–TeV range. These are important as both sources and as probes. Persistent\nsources have been identified with pulsars, blazars and supernova remnants and\nin each case are likely to provide the best approach we have to understanding\nthe fundamental nature of these sources. The big issue in pulsars is to locate the\nsource of the emission. Is it close to the stellar surface or at an outer gap, much\ncloser to the light cylinder? As the pulses are phase-resolved, we can also relate\nthe γ-ray emission site to that of the radio, optical and the X-ray emission which\nis also not yet certain. Blazars are identified with ultrarelativistic jets emanating\nfrom massive black holes in the nuclei of elliptical galaxies. Here the big question\nis to understand whether the jets comprise ultrarelativistic protons, that interact\nwith either the radiation field or the background plasma, or if they are electronpositron pairs/electromagnetic. TeV sources should be far more plentiful in the\nlatter case. The combination of GLAST and telesopes like Hess and VERITAS\nought to be able to sort this out, as they should also be able to sort out the\ndetails of cosmic ray acceleration in supernova remnants, as discussed above.\nAt the other end of the spectrum lies the domain of low frequency radio\nastronomy (Kassim & Weiler 1990). The ionosphere precludes regular observing\nmuch below ∼ 30 MHz and it is necessary to fly large antennae in space to\nexplore this part of the spectrum. We can be confident that the sources exist.\nThey are necessarily nonthermal. The ultimate limit in frequency is the plasma\nfrequency of the solar wind, around ∼ 30 kHz, giving us another ten octaves to\nexplore. There will of course be limitations. Interstellar propagation will lead\nto irreversible smearing of any pulsar pulses, for example.\nThe great advantage of neutrino astronomy is that allows one to see into\nthe densest regions, even through nuclear density. The recent successes in the\nSNO and Kamionkande and KamLAND experiments have verified that the three\ntypes of neutrino have mass and can mix into each other. This vindicates the\nstandard solar model although the low energy neutrino spectrum remains to be\nmeasured.\nThe next step in neutrino astronomy is to detect sources at much higher\nenergy. This is the province of projects like AMANDA, IceCube and ANTARES.\nThe prime candidate sources of ultra high energy neutrinos are blazars and\nGRBs. In many respects, these searches are complementary to the UHE γray searches. Success in the former will suggest that ultrarelativistic outflows\ncomprise mainly protons. Failure, and there is no guarantee that there will be\nany detectable UHE neutrino sources, will favor electromagnetic/pair models\nUHE. neutrino astronomy has the advantage that we can see the universe up to\n∼ EeV energies. By contrast, the universe becomes opaque to γ-rays above ∼\nTeV energies through absorption by the infrared background.\nThe cosmic ray frontier is undoubtedly at the very highest energy. The\nsituation is now quite confused. The EeV cosmic ray spectrum can be measured\nthrough detecting the atmospheric nitrogen fluorescence that they create and by\nrecording the muon showers on the ground. Unfortunately different spectra are\nbeing reported - probably a consequence of calibration errors. What is at stake\nis the source redshift. If the cosmic rays derive from cosmological distances, then\n\n\f16\n\nR. D. Blandford\n\nthey should cut off above ∼ 100 EeV due to photopion production by the cosmic\nmicrowave background. If this \"GZK\" cutoff is not seen then their sources probably lie within ∼ 30 Mpc and their overall mean luminosity density approaches\nthat of ∼ GeV cosmic rays. Even more tantalizing are studies of the angular\ndistribution of these particles. There are a few close groupings of particles -\nfive doubles and one triple - on the sky. The statistical significance is low, but\nif these are substantiated as permanent sources, then almost all proposed models\nof UHE cosmic ray origin will be ruled out, with the conspicuous exception of\nthe front runner, radio sources associated with dormant massive black holes in\nAGN. Both of these questions should be answered by Auger.\nFinally the last and most challenging frontier is that of gravitational radiation. Studies of binary pulsars have confirmed that the weak field calculations\nof wave emission are correct to an accuracy ∼ 0.002. This is the most impressive confirmation of the general theory of relativity to date. This allows us\nto compute waveforms etc from strong field sources, according to the rules of\ngeneral relativity with confidence, although not facility. However, it does not\nrule out the possibility that additional fields are attached to singularities, for\nexample, or that the relationship between curvature and stress-energy is more\nsubtle. Furthermore, it is at least logically possible that in a universe where\nthis relationship appears to fail on the comsological scale, there could be some\nside effects affecting the propagation of metric perturbations. In short there\nare pretty good reasons in physics to test the theory of gravitational radiation\nalthough the most likely outcome will be to vindicate, once again, the genius of\nAlbert Einstein.\nGravitational radiation astronomy is largely unkown territory. There are\nhowever assured sources - Galactic binary dwarfs and extragalactic neutron star\ncoalescences. Of more interest, though, are coalescing black holes in cosmologically distant galactic nuclei, though here the source rates are very difficult to\nestimate with confidence and measuring them would tell us much of interest\nabout galaxy evolution. There are two classes of detectors. Ground-based facilities, like LIGO, TAMA and VIRGO, will seek stellar sources like supernova\nand compact object mergers. mHZ, space-based facilities, such as LISA, will\ntarget massive black hole signals from behind a binary white dwarf-generated\nforeground. The technical challenge of achieving the sensitivities necessary to\nmeasure waves from assured sources should not be understated. It may well take\nmore than another decade to reach them. However, there have been few regions\nof the electromagnetic spectrum where the sources have turned out to be as we\nimagined. So, it would be remarkable if gravitational wave astronomy, or any of\nthe other four frontiers turned out to be as I have just described.\nAs I hope that this brief introductory essay makes clear, the past decade\nhas been a remarkable one in the observation of high energy astrophysics. The\npresent one promises even more. Let me conclude by re-emphasizing the two\nimportant principles with which I began this article. Firstly, in order to exploit high energy observations to the full it is necessary to adopt a source-based,\nrather than observatory-based approach to the study of cosmic sources. Almost by definition, high energy sources are nonthermal and emit throughout\nthe electromagnetic and other spectra and spectrally chauvinist interpretations\nof their behavior are incomplete. Secondly, much of the physics of these sources\n\n\fAPS Conf. Ser. Style\n\n17\n\nis unknowable working from first principles. While we should be confident in\nour application of fundamental principles, such as the conservation laws of mass\nmomentum and energy and the whole edifice of general relativity, and in our\nunderstanding of elementary processes such as those described by atomic and\nnuclear astrophysics and quantum electrodynamics, much of what we see depends upon the collective behavior of plasmas and the mysteries of MHD. As\nsuch, it is encumbent upon us to develop theories of these subjects by studying\nall sources from the solar corona to GRBs so as to derive empirical laws which we\ncan then try to relate to numerical simulation. The physics should be common\nand knowable.\nI am confident that subsequent contributions to this meeting will report\ngreat advances that can be interpreted in terms of both of these principles.\nAcknowledgements\nI thank the organisers of this conference for their extremely gracious hospitality\nand many participants for constructive criticism of some of the ideas discussed\nabove. I am also indebted to my collaborators, especially Mitch Begelman, Max\nLyutikov, Andrew MacFadyen and Peng Oh. Support under NASA grant 5-7007\nis gratefully acknowledged.\nReferences\nAllen, S. Schmidt, R. & Fabian, A. C. 2002 MNRAS334 L11\nBaganoff, F. et al. 2001 Nature 413 45\nBlandford, R. 2002 Lighthouses of the Universe ed. M. Gilfanov, R. Sunyaev &\nE. Churazov (Berlin:Springer) 381\nBlandford, R. & Begelman, M. 1999 MNRAS303 L1\nBlandford, R. & Königl, A. 1979 ApJ232 34\nBraje, T. & Romani, R. ApJ580 1043\nBrandt, W. et al. 2002 Phil. Trans. Roy. Soc. A360 2057\nBromm, V., Coppi, P. & Larsen, R. 1999 ApJ527 L5\nCanizares, C. 2002 Phil. Trans. Roy. Soc. A360 1903\nCosta et al. 1997 Nature 387 783\nDrake, J. et al. 2002 ApJ572 996\nDurret,F. et al. 2002 å390 397\nEguchi, K. et al. 2003 Phys.Rev.Lettin press\nEnomoto, R. et al. 2002 Nature 416 823\nFabian, A. 2002 Phil. Trans. Roy. Soc. A360 2035\nFabian, A. et al. 2002 MNRAS331 369\nFan, X. et al. 2001 AJ122 2833\nFang, T et al. 2002 ApJ572 L127\nHartman, R. C. et al. 1992 ApJ385 L1\nHasinger, G. 2002 Phil. Trans. Roy. Soc. A360 2077\n\n\f18\n\nR. D. Blandford\n\nHelfand, D., Gotthelf, E.& Halpern, J 2001 ApJ556 380\nHughes, S. & Blandford, R. 2003 ApJ in press\nJunor, W., Biretta, J. & Livio, M. 1999 Nature 401 891\nKassim, N, & Weiler, K.1990 Low Frequency Astrophysics from Space Berlin:Springer\nKrolik, J. H. 1999 Active Galactic Nuclei Princeton:Princeton University Press\nMészáros, P. 2002 ARA&A40 137\nMetzger, M. et al. 1997 Nature 387 868\nMichael, E. et al. 2002 574 166\nMiniati et al. F. 2000 ApJ542 608\nMirabel, F. & Rodriguez, L.2002 Sky & Telescope 103 32\nMushotzky, R. 2002 Phil. Trans. Roy. Soc. A360 2012\nNarayan, R. & Yi, I.1994 ApJ428 L13\nQuataert, E. & Gruzinov, A. 2000 ApJ539 809\nQuinn, J. et al. 1998 ApJ518 693\nPeterson, J. et al. 2003 ApJin press\nReimer, O. & Pohl, M. 2002 Astron. Astrophys. 390 L43\nSanwal, D. et al. 2002 ApJin press\nSlane, P., Helfand, D. & Murray 2002 ApJ571 L45\nSmall, T. A. & Blandford, R. D. 1992 ApJ259 725\nTripp, T., Savage, B. & Jenkins, E. ApJ2000 534 L1\nWilms, J. et al. 2001 MNRAS328 L27\nWilson, A., Young, A. & Shopbell, P. 2001 ApJ546\nvan der Klis, M. 1998 Adv. Sp. Res. 22 925\nYakovlev, D. G. et al. 2002 Astron. Astrophys. 389 1024\nYu, Q. & Tremaine, S. 2002 MNRAS335 965\n\n\f"}