{"id": "http://arxiv.org/abs/astro-ph/0006214v1", "guidislink": true, "updated": "2000-06-15T14:23:43Z", "updated_parsed": [2000, 6, 15, 14, 23, 43, 3, 167, 0], "published": "2000-06-15T14:23:43Z", "published_parsed": [2000, 6, 15, 14, 23, 43, 3, 167, 0], "title": "Temperature and Density Gradients Across the Nucleus of M82", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0006189%2Castro-ph%2F0006021%2Castro-ph%2F0006140%2Castro-ph%2F0006047%2Castro-ph%2F0006132%2Castro-ph%2F0006291%2Castro-ph%2F0006263%2Castro-ph%2F0006419%2Castro-ph%2F0006002%2Castro-ph%2F0006028%2Castro-ph%2F0006199%2Castro-ph%2F0006366%2Castro-ph%2F0006290%2Castro-ph%2F0006289%2Castro-ph%2F0006383%2Castro-ph%2F0006432%2Castro-ph%2F0006408%2Castro-ph%2F0006064%2Castro-ph%2F0006112%2Castro-ph%2F0006287%2Castro-ph%2F0006387%2Castro-ph%2F0006311%2Castro-ph%2F0006060%2Castro-ph%2F0006334%2Castro-ph%2F0006294%2Castro-ph%2F0006451%2Castro-ph%2F0006369%2Castro-ph%2F0006382%2Castro-ph%2F0006046%2Castro-ph%2F0006061%2Castro-ph%2F0006324%2Castro-ph%2F0006434%2Castro-ph%2F0006267%2Castro-ph%2F0006187%2Castro-ph%2F0006282%2Castro-ph%2F0006274%2Castro-ph%2F0006014%2Castro-ph%2F0006027%2Castro-ph%2F0006237%2Castro-ph%2F0006372%2Castro-ph%2F0006330%2Castro-ph%2F0006005%2Castro-ph%2F0006161%2Castro-ph%2F0006454%2Castro-ph%2F0006292%2Castro-ph%2F0006096%2Castro-ph%2F0006056%2Castro-ph%2F0006457%2Castro-ph%2F0006264%2Castro-ph%2F0006348%2Castro-ph%2F0006207%2Castro-ph%2F0006312%2Castro-ph%2F0006183%2Castro-ph%2F0006323%2Castro-ph%2F0006012%2Castro-ph%2F0006319%2Castro-ph%2F0006202%2Castro-ph%2F0006087%2Castro-ph%2F0006449%2Castro-ph%2F0006215%2Castro-ph%2F0006173%2Castro-ph%2F0006095%2Castro-ph%2F0006388%2Castro-ph%2F0006070%2Castro-ph%2F0006171%2Castro-ph%2F0006398%2Castro-ph%2F0006431%2Castro-ph%2F0006353%2Castro-ph%2F0006211%2Castro-ph%2F0006331%2Castro-ph%2F0006045%2Castro-ph%2F0006355%2Castro-ph%2F0006074%2Castro-ph%2F0006017%2Castro-ph%2F0006256%2Castro-ph%2F0006115%2Castro-ph%2F0006159%2Castro-ph%2F0006077%2Castro-ph%2F0006255%2Castro-ph%2F0006013%2Castro-ph%2F0006145%2Castro-ph%2F0006241%2Castro-ph%2F0006245%2Castro-ph%2F0006380%2Castro-ph%2F0006370%2Castro-ph%2F0006296%2Castro-ph%2F0006180%2Castro-ph%2F0006152%2Castro-ph%2F0006343%2Castro-ph%2F0006430%2Castro-ph%2F0006214%2Castro-ph%2F0006293%2Castro-ph%2F0006127%2Castro-ph%2F0006443%2Castro-ph%2F0006354%2Castro-ph%2F0006314%2Castro-ph%2F0006093%2Castro-ph%2F0006235%2Castro-ph%2F0006194%2Castro-ph%2F0006229%2Castro-ph%2F0006198&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Temperature and Density Gradients Across the Nucleus of M82"}, "summary": "This paper presents 12CO J=3-2, 13CO J=3-2, C18O J=3-2, and 13CO J=2-1\nspectra of the irregular starburst galaxy M82 taken with the 15 m James Clerk\nMaxwell Telescope. All maps exhibit a double peaked morphology, despite\nevidence that the higher J transitions are optically thick. This morphology\nsuggests that the double peaked structure is not the result of an edge-on torus\nof molecular gas as is commonly assumed. We observe line ratio gradients that\ncan best be explained by a temperature gradient increasing from NE to SW in\nconjunction with a density gradient that increases in the opposite sense. These\ngradients may have been caused by the interaction with M81, resulting in\nincreased star formation that both heats and depletes the molecular gas in the\nSW lobe of M82.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0006189%2Castro-ph%2F0006021%2Castro-ph%2F0006140%2Castro-ph%2F0006047%2Castro-ph%2F0006132%2Castro-ph%2F0006291%2Castro-ph%2F0006263%2Castro-ph%2F0006419%2Castro-ph%2F0006002%2Castro-ph%2F0006028%2Castro-ph%2F0006199%2Castro-ph%2F0006366%2Castro-ph%2F0006290%2Castro-ph%2F0006289%2Castro-ph%2F0006383%2Castro-ph%2F0006432%2Castro-ph%2F0006408%2Castro-ph%2F0006064%2Castro-ph%2F0006112%2Castro-ph%2F0006287%2Castro-ph%2F0006387%2Castro-ph%2F0006311%2Castro-ph%2F0006060%2Castro-ph%2F0006334%2Castro-ph%2F0006294%2Castro-ph%2F0006451%2Castro-ph%2F0006369%2Castro-ph%2F0006382%2Castro-ph%2F0006046%2Castro-ph%2F0006061%2Castro-ph%2F0006324%2Castro-ph%2F0006434%2Castro-ph%2F0006267%2Castro-ph%2F0006187%2Castro-ph%2F0006282%2Castro-ph%2F0006274%2Castro-ph%2F0006014%2Castro-ph%2F0006027%2Castro-ph%2F0006237%2Castro-ph%2F0006372%2Castro-ph%2F0006330%2Castro-ph%2F0006005%2Castro-ph%2F0006161%2Castro-ph%2F0006454%2Castro-ph%2F0006292%2Castro-ph%2F0006096%2Castro-ph%2F0006056%2Castro-ph%2F0006457%2Castro-ph%2F0006264%2Castro-ph%2F0006348%2Castro-ph%2F0006207%2Castro-ph%2F0006312%2Castro-ph%2F0006183%2Castro-ph%2F0006323%2Castro-ph%2F0006012%2Castro-ph%2F0006319%2Castro-ph%2F0006202%2Castro-ph%2F0006087%2Castro-ph%2F0006449%2Castro-ph%2F0006215%2Castro-ph%2F0006173%2Castro-ph%2F0006095%2Castro-ph%2F0006388%2Castro-ph%2F0006070%2Castro-ph%2F0006171%2Castro-ph%2F0006398%2Castro-ph%2F0006431%2Castro-ph%2F0006353%2Castro-ph%2F0006211%2Castro-ph%2F0006331%2Castro-ph%2F0006045%2Castro-ph%2F0006355%2Castro-ph%2F0006074%2Castro-ph%2F0006017%2Castro-ph%2F0006256%2Castro-ph%2F0006115%2Castro-ph%2F0006159%2Castro-ph%2F0006077%2Castro-ph%2F0006255%2Castro-ph%2F0006013%2Castro-ph%2F0006145%2Castro-ph%2F0006241%2Castro-ph%2F0006245%2Castro-ph%2F0006380%2Castro-ph%2F0006370%2Castro-ph%2F0006296%2Castro-ph%2F0006180%2Castro-ph%2F0006152%2Castro-ph%2F0006343%2Castro-ph%2F0006430%2Castro-ph%2F0006214%2Castro-ph%2F0006293%2Castro-ph%2F0006127%2Castro-ph%2F0006443%2Castro-ph%2F0006354%2Castro-ph%2F0006314%2Castro-ph%2F0006093%2Castro-ph%2F0006235%2Castro-ph%2F0006194%2Castro-ph%2F0006229%2Castro-ph%2F0006198&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This paper presents 12CO J=3-2, 13CO J=3-2, C18O J=3-2, and 13CO J=2-1\nspectra of the irregular starburst galaxy M82 taken with the 15 m James Clerk\nMaxwell Telescope. All maps exhibit a double peaked morphology, despite\nevidence that the higher J transitions are optically thick. This morphology\nsuggests that the double peaked structure is not the result of an edge-on torus\nof molecular gas as is commonly assumed. We observe line ratio gradients that\ncan best be explained by a temperature gradient increasing from NE to SW in\nconjunction with a density gradient that increases in the opposite sense. These\ngradients may have been caused by the interaction with M81, resulting in\nincreased star formation that both heats and depletes the molecular gas in the\nSW lobe of M82."}, "authors": ["Glen R. Petitpas", "Christine D. Wilson"], "author_detail": {"name": "Christine D. Wilson"}, "author": "Christine D. Wilson", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/312816", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0006214v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0006214v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages + 2 colour figures; accepted for ApJ Letters", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0006214v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0006214v1", "journal_reference": null, "doi": "10.1086/312816", "fulltext": "Temperature and Density Gradients Across the Nucleus of M82\nGlen R. Petitpas & Christine D. Wilson\n\narXiv:astro-ph/0006214v1 15 Jun 2000\n\nMcMaster University, 1280 Main Street West, Hamilton Ontario, Canada L8S 4M1\npetitpa@physics.mcmaster.ca\nwilson@physics.mcmaster.ca\nABSTRACT\nThis paper presents 12 CO J=3−2, 13 CO J=3−2, C18 O J=3−2, and 13 CO J=2−1\nspectra of the irregular starburst galaxy M82 taken with the 15 m James Clerk Maxwell\nTelescope. All maps exhibit a double peaked morphology, despite evidence that the\nhigher J transitions are optically thick. This morphology suggests that the double\npeaked structure is not the result of an edge-on torus of molecular gas as is commonly\nassumed. We observe line ratio gradients that can best be explained by a temperature\ngradient increasing from NE to SW in conjunction with a density gradient that increases\nin the opposite sense. These gradients may have been caused by the interaction with\nM81, resulting in increased star formation that both heats and depletes the molecular\ngas in the SW lobe of M82.\nSubject headings: galaxies: irregular - galaxies: individual (M82) - galaxies: ISM -\nISM: molecules - Local Group\n\n1.\n\nIntroduction\n\nM82 (NGC 3034, Arp 337) is considered the prototypical starburst galaxy. Its close proximity\n(D=3.25 Mpc, Tammann & Sandage (1968)) and strong CO lines (Rickard et al. 1975) make it\nan excellent location to study the effects of a burst of star formation on molecular gas properties.\nIts edge-on orientation make essential the use of optically thin molecular gas tracers for probing\nthe physical conditions in the interstellar medium. Interferometric maps (e.g. Shen & Lo (1995);\nNeininger et al. (1998)) show that M82 contains three bright lobes: two main lobes on the outer\nedges, which are thought to be a torus of molecular gas seen edge-on (e.g. Tilanus et al. (1991)),\nand a central peak which may be housing an AGN (Muxlow et al. 1994; Seaquist, Frayer, & Frail\n1997). Early CO studies showed that M82 had an unusually large 12 CO J=2−1/J=1−0 line ratio\n(&2, Knapp et al. (1980); Sutton, Masson, & Phillips (1983)), which suggested that the 12 CO gas in\nM82 is optically thin. As calibration techniques and telescope surface quality improved, the value\nfor the 12 CO J=2−1/J=1−0 line ratio has decreased to ∼1 (Tilanus et al. 1991; Wild et al. 1992),\nwhich suggests that 12 CO is likely optically thick. A high optical depth leads to some problems in\n\n\f–2–\nthe interpretation of the double lobes as a molecular torus. Neininger et al. (1998) point out that\nif the gas were optically thin, a torus seen from the edge would have a double peaked appearance,\nwhile if the torus were optically thick, we should see a elongated, bar-like structure.\nMapping a galaxy in many transitions will help our understanding of the molecular gas dynamics since different transitions and molecules do not necessarily trace the same gas (Petitpas &\nWilson 1998b; Kohno, Kawabe, & Vila-Vilarò 1999). While M82 has been painstakingly mapped\nand studied by many authors in the lower-J transitions of CO and its isotopomers (see references\nabove), improvements in receiver sensitivity and telescope surface quality have made fully sampled\nmaps of the higher-J transitions of rarer CO isotopes more tractable. This paper presents first\nresults from 12 CO, 13 CO, C18 O J=3−2 and 13 CO J=2−1 maps of M82. In §2 we describe the\nobservations and discuss the appearance of the spectra in comparison to each other and previously\npublished data. In §3 we use integrated intensity line ratios to derive the physical conditions inside\nthe nucleus of M82 and discuss the results and possible causes for the observed gradients.\n\n2.\n\nObservations and Data Reduction\n\nOne of the difficulties in the interpretation of line ratios is that the different lines are often measured with different telescopes. This method introduces calibration uncertainties (see for example,\nFigure 6 of Wild et al. (1992)) that can be reduced if all the data are taken with the same telescope\n(which is often impossible, given the large variation in frequency between some transitions).\nA variety of CO J=3−2 observations of M82 were taken using the James Clerk Maxwell\nTelescope (JCMT) over the period of 1996 April 5 – 10. The 12 CO J=3−2 map covers an area of\n120′′ × 100′′ , the 13 CO J=3−2 map covers 56′′ × 35′′ , and the C18 O J=3−2 map covers a 34′′ strip\nalong the bar major axis. We also include 12 CO and 13 CO J=2−1 data taken during CANSERV\nat the JCMT over 1993 April 22 – 25. The data were reduced using the data reduction package\nSPECX. The raw data had a linear baseline removed and then the J=3−2 data were binned to 12.5\nMHz (10.8 km s−1 ) and the J=2−1 data to 5 MHz (6.7 km s−1 ). Since the CO J=2−1 data have a\ndifferent beam size and grid spacing than the CO J=3−2 data, it was necessary to interpolate and\nconvolve the spectra before measuring the integrated intensity line ratios. The data were exported\nto the data reduction package COMB, and the CO J=3−2 data were convolved to the same beam\nsize and interpolated to the same location as the nearest CO J=2−1 spectra.\nThe calibration was monitored by frequently observing both planets and spectral line calibrators. The spectral line calibrators for the CO data had intensities that were within ∼15% of the\npublished values. We therefore adopt the published values for ηMB of 0.58 for the CO J=3−2 data\nand 0.67 for the 12 CO J=2−1 data. Pointing was checked frequently and was determined to be\naccurate to within 2′′ r.m.s.\nThe individual 12 CO J=3−2, 13 CO J=3−2, C18 O J=3−2, 12 CO J=2−1, and 13 CO J=2−1\nspectra for the three bright regions of M82 are shown in Figure 1. The individual spectra for\n\n\f–3–\nM82 appear asymmetric on either side of the center, indicating rotation. The line profiles appear\nsimilar for each transition which indicates that, at least on large scales, the emission is coming from\nco-moving material. There are indications of double peaked line profiles at the (0,0) position in the\nJ=2−1 spectra. Since we do not see this structure as strongly in the J=3−2 spectra, it is likely\nthe result of the larger beam overlapping both the NE and SW peaks simultaneously.\n\n3.\n\nPhysical Conditions from Line Ratios\n\nIt is well known that the filling factor of molecular clouds in a galaxy is often low. Thus,\nintegrated intensities are generally not a good measure of the physical conditions of individual\nmolecular clouds because the signal is diluted by the large radio telescope beams, which also cover\nmuch empty space. We must therefore use integrated intensity line ratios to determine the physical\nconditions of individual clouds. Using the ratio of two integrated intensities will help cancel out the\neffects of beam dilution, assuming that similar regions of space are responsible for the emission at\nboth frequencies. The physical conditions recovered from the analysis of line ratios are the average\nconditions for all clouds within the beam.\nThe differing morphology in the 13 CO and 12 CO J=3−2 lines results in a gradient of the\nJ=3−2 line ratios, increasing from east to west (Figure 2). If both lines are optically\nthin, this observation indicates a 13 CO/12 CO abundance gradient across the disk of M82. This\nsame 'abundance'-type gradient is not visible in the lower J transitions (see 12 CO/13 CO J=1−0\nand J=2−1 ratios; Neininger et al. (1998); Loiseau et al. (1990)), which suggests that the 12 CO\nemission is not optically thin and the gradient may be the result of a variation in optical depth.\nSince optical depth is a function of density and temperature, we have performed a Large Velocity\nGradient (LVG) analysis using a code written by Lee Mundy and implemented as part of the Miriad\ndata reduction package. A single component model provided a very nice fit to the observed line\nratios. We kept the C18 O abundance as a free parameter, so a survey of parameter space was\nperformed using Tkin = 50 ± 20 K (Wild et al. 1992), [12 CO]/[13 CO] = 50 ± 20 (Tilanus et al.\n1991), n(H2 ) from 10 to 106 cm−3 , and N (CO)/dv from 1015 to 1020 cm−2 /km s−1 (see Petitpas &\nWilson (1998a) for more details). The ±1σ error bars for the line ratios shown in Figure 2 were\nentered into the program and the solutions are shown in Table 1. The 12 CO J=2−1/J=1−0 ratios\nfrom Tilanus et al. (1991) also overlap our solutions.\n12 CO/13 CO\n\nIn the simplest scenario, the observed line ratio gradients can be explained by varying either\ntemperature or density across the galaxy while holding the other variable constant. Our analysis\nsuggests that either the density varies from 1.6 × 104 to 0.6 × 104 cm−2 (for Tkin = 50 K), or the\ntemperature varies from 70 to 30 K (for n(H2 ) = 104 cm−2 ) from east to west. Of course, the\ngradients can also be produced by a combination of varying T and n, which suggests we need to\ninclude observations at other frequencies to constrain the models.\nA similar line ratio gradient was seen in HCO+ J=4−3/J=1−0 by Seaquist, Frayer, & Bell\n\n\f–4–\n(1998), but since their data combined single dish and interferometry data, they dismissed the\ngradient, attributing it to an abundance of diffuse emission on the eastern side of M82, which would\ncause the HCO+ emission to be underestimated. However, our model fits show a higher density\nand/or temperature in the NE lobe, which could produce an increased HCO+ J=4−3/J=1−0\nratio. Previous 12 CO and 13 CO J=1−0 interferometric studies by Kikumoto et al. (1998) find\n12 CO/13 CO J=1−0 ratios that increase across M82, but in the opposite direction from our J=3−2\nratios. This result helps rule out the possibility that the observed gradients are the result of a 13 CO\nand C18 O abundance gradient across M82. The J=1−0 line ratio gradients are likely the result\nof the higher temperatures and/or densities in the NE lobe of M82, which bump the CO into the\nhigher J transitions, leaving the lower J levels less populated.\nWe can use the 850 μm continuum maps of M82 (Alton, Davies, & Bianchi 1999) to remove the\ndegeneracy between density and temperature in our models. Since the SW lobe is brighter in the\n850 μm continuum maps, which trace the product of the temperature and the column density, we\ncan conclude that either the column density and/or temperature is higher in the SW lobe. In this\nscenario, the HCO+ maps of Seaquist, Frayer, & Bell (1998) would require that density be higher\nin the NE. The pair of LVG solutions which best satisfy the combined CO, HCO+ , and continuum\ndata are flagged with check marks in Table 1. Utilizing these additional data sets, we therefore\nconclude that the observed line ratios are the result of a temperature gradient that increases from\nNE to SW in conjunction with a density gradient that increases from SW to NE.\nOne possible reason for this density and temperature gradient may be interaction with the\nnearby galaxy M81. Gravitational interaction may be triggering vigorous star formation in the SW\nlobe, which could be heating the gas (increasing T ) at the same time that it is being consumed\n(decreasing the average density by turning the densest regions into stars). While previous galaxy\ninteraction simulations do not show any indication of density gradients across the smaller galaxy,\nit is unlikely that the current simulations would be able to detect a factor of three difference in the\nmean density of molecular clouds across the galaxy.\nThere is some dispute over the nature of the double peaked structure seen in M82. Most\nstudies suggest that it is the result of a molecular torus seen edge-on. This would only be the\ncase if the molecular gas in the clouds were optically thin (Neininger et al. 1998), or there were\nnot enough molecular clouds in the telescope beam to 'shadow' the more distant clouds. Our LVG\nanalysis indicates that 12 CO J=1−0 transition is on the border between optically thin and optically\nthick (τJ=1−0 ∼ 0.1 − 3.5). However, the J=2−1 and J=3−2 maps also indicate a double peaked\nstructure even though these transitions are likely optically thick (Table 1). This result can only be\nconsistent with the torus model if the filling factor of the optically thick clouds within the beam\nis low enough that shadowing of one cloud by another is not a problem. We can estimate the\nfilling factor by comparing the predicted and observed line temperatures. The LVG models predict\ntemperatures of 19 K for 12 CO J=2−1 while our data show temperatures of ∼ 6 K. In addition, the\nhigh resolution CO maps of Neininger et al. (1998) suggest that M82 is only ∼ 10′′ thick and thus\nthe filling factor of the CO emission is ∼ 60% of the 22′′ JCMT beam. This filling factor is high\n\n\f–5–\nenough that cloud shadowing may be important in this region. If cloud shadowing plays a large\nrole, the double peaked structure in M82 could not be explained as the result of an edge-on torus\nof molecular gas. Instead, it could be produced by the accumulation of molecular gas at the Inner\nLindblad Resonance radius as it flows inward along the bar (e.g. Kenney et al. (1992)). There is\nevidence for these double peaks (on similar size scales) in nearly face-on barred galaxies (Kenney\net al. 1992; Petitpas & Wilson 1998b), where we would not expect them to be caused by torus of\ngas, since the torus would have to be out of the plane of the galaxy.\nWe wish to thank Lorne Avery and the JCMT staff for taking the 12 CO and 13 CO J=2−1\ndata during service observing. The JCMT is operated by the Royal Observatories on behalf of\nthe Particle Physics and Astronomy Research Council of the United Kingdom, the Netherlands\nOrganization for Scientific Research, and the National Research Council of Canada. This research\nhas been supported by a research grant to C. D. W. from NSERC (Canada).\n\nREFERENCES\nAlton, P. B., Davies, J. I., Bianchi, S. 1999, A&A, 343, 51\nKenney, J. D. P., Wilson, C. D., Scoville, N. Z., Devereux, N. A., & Young, J. S. 1992, ApJ, 395,\nL79\nKikumoto, T., Taniguchi, Y., Nakai, N., Ishizuki, S., Matsushita, S. & Kawabe, R. 1998, PASJ, 50,\n309\nKohno, K., Kawabe, R., & Vila-Vilarò, B. 1999, ApJ, 511, 157\nKnapp, G. R., Leighton, R. B., Wannier, P. G., Phillips, T. G. & Huggins, P. J. 1980, ApJ, 240, 60\nLoiseau, N., Nakai, N., Sofue, Y., Wielebinski, R., Reuter, H.-P., & Klein, U. 1990, A&A, 228, 331\nMuxlow, T. W. B., Pedlar, A., Wilkinson, P. N., Axon, D. J., Sanders, E. M. & De Bruyn, A. G.\n1994, MNRAS, 266, 455\nNeininger, N., Guelin, M., Klein, U., Garcia-Burillo, S. & Wielebinski, R. 1998, A&A, 339, 737\nPetitpas, G. R., & Wilson, C. D. 1998a, ApJ, 496, 226\nPetitpas, G. R., & Wilson, C. D. 1998b, ApJ, 503, 219\nRickard, L. J., Palmer, P., Morris, M., Turner, B. E. & Zuckerman, B. 1975, ApJ, 199, L75\nSeaquist, E. R., Frayer, D. T. & Bell, M. B. 1998, ApJ, 507, 745\nSeaquist, E. R., Frayer, D. T. & Frail, D. A. 1997, ApJ, 487, L131\n\n\f–6–\nShen, J. & Lo, K. Y. 1995, ApJ, 445, L99\nSutton, E. C., Masson, C. R., & Phillips, T. G. 1983, ApJ, 275, L49\nTammann, G. A. & Sandage, A. 1968, ApJ, 151, 825\nTilanus, R. P. J., Tacconi, L. J., Sutton, E. C., Zhou, S., Sanders, D. B., Wynn-Williams, C. G.,\nLo, K. Y., & Stephens, S. A. 1991, ApJ, 376, 500\nWild, W., Harris, A. I., Eckart, A., Genzel, R., Graf, U. U., Jackson, J. M., Russell, A. P. G. &\nStutzki, J. 1992, A&A, 265, 447\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n\f–7–\nFig. 1.- Individual spectra for the starburst galaxy M82. The transitions are labeled in the same\nvertical order as they appear in the plots. The (0,0) position is centered on α = 09◦ 51′ 43.′′ 00 , δ =\n069h 55m 00.s 00 (B1950.0). The orientation is such that north corresponds to an angle of 70◦ from the\npositive x-axis, and the bar runs horizontally. The temperature scale is main-beam temperature.\nThe upper panel shows the spectra taken with (or convolved to) a 22′′ beam, while the lower panel\nshows data taken with a 14′′ beam.\nFig. 2.- Integrated intensity line ratios for 12 CO/13 CO J=2−1, 12 CO/13 CO J=3−2, 12 CO\nJ=3−2/J=2−1, and 12 CO/C18 O J=3−2(from top to bottom respectively). The ratios are in\nmain beam temperature scale (TMB ). The uncertainties are based on the rms noise in the data,\nexcept for the 12 CO J=3−2/J=2−1 ratio, which is given as 20% to reflect the calibration uncertainties. The J=3−2 line ratios use data taken with a 14′′ beam size; the J=2−1 line ratio uses\n22′′ resolution data. The 12 CO J=3−2 data were convolved to a 22′′ beam to create the 12 CO\nJ=3−2/J=2−1 line ratios.\n\n\f–8–\n\nTable 1. M82 LVG Solutions\nTkin\n\n13 X\n\n18 X\n\nlog N (CO)/dv\n\nlog n(H2 )\n\nτJ =1−0\n\nτJ =3−2\n\n0.5\n1.1\n3.5\n0.4\n1.0\n2.1\n0.1\n0.5\n1.2\n\n3\n5\n15\n4\n7\n12\n3\n5\n9\n\n0.6\n1.3\n1.2\n0.2\n0.6\n1.2\n0.1\n0.4\n0.9\n\n3\n6\n6\n3\n5\n8\n3\n5\n8\n\npreferred solution\n\nNE Lobe (+12,0)\n30\n30\n30\n50\n50\n50\n70\n70\n70\n\n30\n50\n70\n30\n50\n70\n30\n50\n70\n\n100\n100\n200\n100\n150\n200\n100\n150-200\n200-250\n\n16.5\n16.6\n17.0\n16.8\n17.0\n17.2\n16.7\n17.0\n17.4\n\n4.4\n4.4\n4.5\n4.2\n4.2\n4.2\n4.0\n4.0\n4.0\n\n√\n√\n√\n\nSW Lobe (−12,0)\n30\n30\n30\n50\n50\n50\n70\n70\n70\n\n30\n50\n70\n30\n50\n70\n30\n50\n70\n\n75\n100-150\n200\n75\n150\n200\n75\n100-150\n200\n\n16.3\n16.6\n16.7\n16.4\n16.8\n17.0\n16.4\n16.8\n17.0\n\n4.0\n4.1\n4.1\n3.7\n3.8\n3.8\n3.6\n3.7\n3.7\n\n√\n√\n√\n\nNote. - This table shows all the possible solutions for the JCMT line ratios for Tkin = 50 ± 20 and [12 CO]/[13 CO] = 50 ±\n20. The first column is the kinetic temperature, the second column is the 12 CO/13 CO abundance ratio, and the third column\nis the fit to the 12 CO/C18 O abundance ratio. The fourth and fifth columns are the CO column density (per km s−1 ) and H2\ndensity required to produce the observed line ratios, while the sixth and seventh columns are the optical depth for the 12 CO\nJ=1−0 and 12 CO J=3−2 transitions respectively. The last column flags the solutions that are preferred when considering data\nat other frequencies (see text).\n\n\f–9–\n\n\f– 10 –\n\n\f"}