{"id": "http://arxiv.org/abs/astro-ph/0702051v2", "guidislink": true, "updated": "2007-02-05T08:50:18Z", "updated_parsed": [2007, 2, 5, 8, 50, 18, 0, 36, 0], "published": "2007-02-02T01:39:15Z", "published_parsed": [2007, 2, 2, 1, 39, 15, 4, 33, 0], "title": "Asteroseismology: a powerful tool to complement planet transits", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0702559%2Castro-ph%2F0702017%2Castro-ph%2F0702010%2Castro-ph%2F0702288%2Castro-ph%2F0702518%2Castro-ph%2F0702064%2Castro-ph%2F0702202%2Castro-ph%2F0702340%2Castro-ph%2F0702650%2Castro-ph%2F0702537%2Castro-ph%2F0702446%2Castro-ph%2F0702670%2Castro-ph%2F0702188%2Castro-ph%2F0702688%2Castro-ph%2F0702067%2Castro-ph%2F0702162%2Castro-ph%2F0702032%2Castro-ph%2F0702646%2Castro-ph%2F0702701%2Castro-ph%2F0702728%2Castro-ph%2F0702690%2Castro-ph%2F0702677%2Castro-ph%2F0702598%2Castro-ph%2F0702121%2Castro-ph%2F0702499%2Castro-ph%2F0702595%2Castro-ph%2F0702204%2Castro-ph%2F0702520%2Castro-ph%2F0702029%2Castro-ph%2F0702349%2Castro-ph%2F0702244%2Castro-ph%2F0702008%2Castro-ph%2F0702541%2Castro-ph%2F0702539%2Castro-ph%2F0702136%2Castro-ph%2F0702239%2Castro-ph%2F0702242%2Castro-ph%2F0702550%2Castro-ph%2F0702512%2Castro-ph%2F0702092%2Castro-ph%2F0702693%2Castro-ph%2F0702521%2Castro-ph%2F0702278%2Castro-ph%2F0702323%2Castro-ph%2F0702217%2Castro-ph%2F0702509%2Castro-ph%2F0702743%2Castro-ph%2F0702098%2Castro-ph%2F0702478%2Castro-ph%2F0702093%2Castro-ph%2F0702629%2Castro-ph%2F0702262%2Castro-ph%2F0702687%2Castro-ph%2F0702745%2Castro-ph%2F0702544%2Castro-ph%2F0702051%2Castro-ph%2F0702269%2Castro-ph%2F0702685%2Castro-ph%2F0702105%2Castro-ph%2F0702470%2Castro-ph%2F0702237%2Castro-ph%2F0702496%2Castro-ph%2F0702277%2Castro-ph%2F0702632%2Castro-ph%2F0702402%2Castro-ph%2F0702075%2Castro-ph%2F0702568%2Castro-ph%2F0702501%2Castro-ph%2F0702047%2Castro-ph%2F0702734%2Castro-ph%2F0702573%2Castro-ph%2F0702212%2Castro-ph%2F0702502%2Castro-ph%2F0702113%2Castro-ph%2F0702143%2Castro-ph%2F0702329%2Castro-ph%2F0702343%2Castro-ph%2F0702035%2Castro-ph%2F0702172%2Castro-ph%2F0702638%2Castro-ph%2F0702474%2Castro-ph%2F0702440%2Castro-ph%2F0702618%2Castro-ph%2F0702481%2Castro-ph%2F0702015%2Castro-ph%2F0702218%2Castro-ph%2F0702054%2Castro-ph%2F0702531%2Castro-ph%2F0702182%2Castro-ph%2F0702622%2Castro-ph%2F0702391%2Castro-ph%2F0702214%2Castro-ph%2F0702245%2Castro-ph%2F0702006%2Castro-ph%2F0702144%2Castro-ph%2F0702747%2Castro-ph%2F0702130%2Castro-ph%2F0702723%2Castro-ph%2F0702233%2Castro-ph%2F0702205%2Castro-ph%2F0702197&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Asteroseismology: a powerful tool to complement planet transits"}, "summary": "The study of stellar oscillations - asteroseismology - has revolutionized our\nunderstanding of the physical properties of the Sun, and similar potential for\nother stars has been demonstrated in recent years. In particular, asteroseismic\nstudies can constrain the stellar size, temperature and composition, which are\nimportant parameters to our understanding of planetary structure and evolution.\nThis makes asteroseismology a very powerful tool to complement planetary\ntransits. As an example, the transit measurement alone does not give the radius\nof the planet unless the radius of the host star is known, which again requires\na known distance to the system. Transit measurements will therefore often\nrequire additional measurements to establish the radius of the planet. With\nasteroseismology we can determine the radius of a star to very high precision\n(2-3%) using only the photometric transit measurements. This will be very\nvaluable for a mission such as Kepler, which will produce photometric time\nseries of very high quality.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0702559%2Castro-ph%2F0702017%2Castro-ph%2F0702010%2Castro-ph%2F0702288%2Castro-ph%2F0702518%2Castro-ph%2F0702064%2Castro-ph%2F0702202%2Castro-ph%2F0702340%2Castro-ph%2F0702650%2Castro-ph%2F0702537%2Castro-ph%2F0702446%2Castro-ph%2F0702670%2Castro-ph%2F0702188%2Castro-ph%2F0702688%2Castro-ph%2F0702067%2Castro-ph%2F0702162%2Castro-ph%2F0702032%2Castro-ph%2F0702646%2Castro-ph%2F0702701%2Castro-ph%2F0702728%2Castro-ph%2F0702690%2Castro-ph%2F0702677%2Castro-ph%2F0702598%2Castro-ph%2F0702121%2Castro-ph%2F0702499%2Castro-ph%2F0702595%2Castro-ph%2F0702204%2Castro-ph%2F0702520%2Castro-ph%2F0702029%2Castro-ph%2F0702349%2Castro-ph%2F0702244%2Castro-ph%2F0702008%2Castro-ph%2F0702541%2Castro-ph%2F0702539%2Castro-ph%2F0702136%2Castro-ph%2F0702239%2Castro-ph%2F0702242%2Castro-ph%2F0702550%2Castro-ph%2F0702512%2Castro-ph%2F0702092%2Castro-ph%2F0702693%2Castro-ph%2F0702521%2Castro-ph%2F0702278%2Castro-ph%2F0702323%2Castro-ph%2F0702217%2Castro-ph%2F0702509%2Castro-ph%2F0702743%2Castro-ph%2F0702098%2Castro-ph%2F0702478%2Castro-ph%2F0702093%2Castro-ph%2F0702629%2Castro-ph%2F0702262%2Castro-ph%2F0702687%2Castro-ph%2F0702745%2Castro-ph%2F0702544%2Castro-ph%2F0702051%2Castro-ph%2F0702269%2Castro-ph%2F0702685%2Castro-ph%2F0702105%2Castro-ph%2F0702470%2Castro-ph%2F0702237%2Castro-ph%2F0702496%2Castro-ph%2F0702277%2Castro-ph%2F0702632%2Castro-ph%2F0702402%2Castro-ph%2F0702075%2Castro-ph%2F0702568%2Castro-ph%2F0702501%2Castro-ph%2F0702047%2Castro-ph%2F0702734%2Castro-ph%2F0702573%2Castro-ph%2F0702212%2Castro-ph%2F0702502%2Castro-ph%2F0702113%2Castro-ph%2F0702143%2Castro-ph%2F0702329%2Castro-ph%2F0702343%2Castro-ph%2F0702035%2Castro-ph%2F0702172%2Castro-ph%2F0702638%2Castro-ph%2F0702474%2Castro-ph%2F0702440%2Castro-ph%2F0702618%2Castro-ph%2F0702481%2Castro-ph%2F0702015%2Castro-ph%2F0702218%2Castro-ph%2F0702054%2Castro-ph%2F0702531%2Castro-ph%2F0702182%2Castro-ph%2F0702622%2Castro-ph%2F0702391%2Castro-ph%2F0702214%2Castro-ph%2F0702245%2Castro-ph%2F0702006%2Castro-ph%2F0702144%2Castro-ph%2F0702747%2Castro-ph%2F0702130%2Castro-ph%2F0702723%2Castro-ph%2F0702233%2Castro-ph%2F0702205%2Castro-ph%2F0702197&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The study of stellar oscillations - asteroseismology - has revolutionized our\nunderstanding of the physical properties of the Sun, and similar potential for\nother stars has been demonstrated in recent years. In particular, asteroseismic\nstudies can constrain the stellar size, temperature and composition, which are\nimportant parameters to our understanding of planetary structure and evolution.\nThis makes asteroseismology a very powerful tool to complement planetary\ntransits. As an example, the transit measurement alone does not give the radius\nof the planet unless the radius of the host star is known, which again requires\na known distance to the system. Transit measurements will therefore often\nrequire additional measurements to establish the radius of the planet. With\nasteroseismology we can determine the radius of a star to very high precision\n(2-3%) using only the photometric transit measurements. This will be very\nvaluable for a mission such as Kepler, which will produce photometric time\nseries of very high quality."}, "authors": ["D. Stello", "H. Kjeldsen", "T. R. Bedding"], "author_detail": {"name": "T. R. Bedding"}, "author": "T. R. Bedding", "arxiv_comment": "6 pages, 8 figures, corrected typos. To appear in the PASP\n  proceedings of \"Transiting Extrasolar Planets Workshop\" MPIA Heidelberg\n  Germany, 25th-28th September 2006. Eds: Cristina Afonso, David Weldrake &\n  Thomas Henning", "links": [{"href": "http://arxiv.org/abs/astro-ph/0702051v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0702051v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0702051v2", "affiliation": "School of Physics, University of Sydney, Australia", "arxiv_url": "http://arxiv.org/abs/astro-ph/0702051v2", "journal_reference": null, "doi": null, "fulltext": "**FULL TITLE**\nASP Conference Series, Vol. **VOLUME**, **YEAR OF PUBLICATION**\n**NAMES OF EDITORS**\n\nAsteroseismology: a powerful tool to complement planet\ntransits\nD. Stello\n\narXiv:astro-ph/0702051v2 5 Feb 2007\n\nSchool of Physics, University of Sydney, 2006 NSW, Australia\nH. Kjeldsen\nInstitut for Fysik og Astronomi (IFA), Aarhus Universitet, 8000\nAarhus, Denmark\nT. R. Bedding\nSchool of Physics, University of Sydney, 2006 NSW, Australia\nAbstract.\nThe study of stellar oscillations - asteroseismology - has revolutionized our understanding of the physical properties of the Sun and similar\npotential for other stars has been demonstrated in recent years. In particular, asteroseismic studies can constrain the stellar size, temperature and composition,\nwhich are important parameters to our understanding of planetary structure\nand evolution. This makes asteroseismology a very powerful tool to complement\nplanetary transits. As an example, the transit measurement alone does not give\nthe radius of the planet unless the radius of the host star is known, which again\nrequires a known distance to the system. Transit measurements will therefore often require additional measurements to establish the radius of the planet. With\nasteroseismology we can determine the radius of a star to very high precision\n(2–3%) using only the photometric transit measurements. This will be very valuable for a mission such as Kepler, which will produce photometric time series of\nvery high quality.\n\n1.\n\nIntroduction\n\nAsteroseismology is a very powerful tool. This is because we can measure the\nfrequencies of the stellar oscillations to a very high accuracy, and the oscillations can give us information about the stars that we cannot otherwise measure,\nhelping us to constrain better the stellar parameters. In the last few years we\nhave seen quite a breakthrough in results, which indicates the great potential\nof asteroseismology as a tool in relation to the search and study of exoplanets. For thorough reviews on asteroseismology see Brown & Gilliland (1994);\nChristensen-Dalsgaard (2004)\n2.\n\nAsteroseismology of solar-like stars\n\nIn Fig. 1 (left panel) we show the luminosity of the Sun observed as a star for\nfour hours by the VIRGO instrument on board the SOHO spacecraft. The Sun\noscillates in many modes simultaneously, each mode with a slightly different\n1\n\n\f2\n\nStello et al.\n\nFigure 1.: Left panel: Luminosity (in parts per million) of the Sun observed\n\nas a star by VIRGO (green band) after granulation with time scales longer\nthan ∼ 9 minutes has been removed from the data. The cadence is 1 minute.\nRight panel: Fourier transform of the solar time series similar to that seen in\nthe left panel but including granulation at all time scales (60 days of VIRGO\nobservations).\nfrequency, which gives the complex sinusoidal pattern seen in Fig. 1 (left panel).\nThis is clearly revealed when we take the Fourier transform of the time series (but\nof longer time span). The square root this transform, also called the amplitude\nspectrum is shown in Fig. 1 (right panel). Each peak in the amplitude spectrum\nrepresents a sinusoidal oscillation and from this we can see that the Sun oscillates\nin many different modes, with periods of roughly five minutes. The amplitudes\nof the oscillations are a few parts per million in luminosity, which corresponds to\ntemperature changes of less than 0.01K. The oscillations can also be observed by\nradial velocity measurements of the surface. The amplitude in velocity is roughly\n20 cm s−1 , corresponding to a total displacement of the solar surface by about\n100 metres. What makes the Sun oscillate in all these modes simultaneously\nis the convection near the surface. The turbulent gas motion in the convection\nzone (seen as granulation on the surface) stochastically excites oscillations, which\nare intrinsically damped, in this broad frequency range. The rising background\nnoise towards lower frequencies seen in Fig. 1 (right panel) is from the random\ngranulation cells themselves. This noise is significantly lower in velocity (see\nFig. 3, bottom right).\nEach frequency is coming from a mode of a standing sound wave, like in\nan organ pipe with nodes and anti-nodes, but in three dimensions (see Fig. 2,\nleft panel). Each mode has both a radial part described by the order n, which\nis the number of nodes or spherical 'shells', and a surface pattern described\nby a spherical harmonic. Figure 2 (right panel) shows examples of spherical\nharmonics of different degree l and order m. High-degree modes (l > 3) cannot\nbe detected when the Sun is observed as a star due to geometric cancellation.\nThe frequency of each mode depends on the sound speed predominantly in\nthat part of the Sun where the particular mode spends most of its time. By\nobserving the frequencies of many modes, the sound speed inside the Sun can be\nreconstructed. This is extremely interesting because the sound speed depends on\nphysical parameters like temperature, density and composition. For example,\nhydrogen turns into helium as the Sun gets older and the sound speed and -\n\n\fAsteroseismology: a powerful tool to complement planet transits\n\n3\n\nFigure 2.: Left panel: Structure of a single spherical mode with quantum numbers: n = 18, l = 2 and m = 2 (provided by IFA, Aarhus Universitet). Right\npanel: Spherical harmonics representing the surface behaviour of the oscillations (provided by J. Christensen-Dalsgaard).\n\nhence the frequencies - change. Therefore, we can in principle measure the age\nof the Sun.\nA large number of stars are expected to show oscillations that are stochastically driven by convection as in the Sun (also known as solar-like oscillations).\nStars located on the cool side of the classical instability strip have convection\nnear the surface, and are therefore expected to show solar-like oscillations. Figure 3 (left panel) shows a Hertzsprung-Russell diagram where different regions\nof known stellar pulsations are indicated. In recent years solar-like oscillations\nhave been detected in a large range of stars from dwarfs to red giants (indicated\nin Fig. 3, left panel). These results are mostly based on velocity measurements\nobtained from the ground (Bedding & Kjeldsen 2006). A few examples of these\ndetections can be seen in Fig. 3 (right panels). The most luminous stars (and\nbiggest) oscillate at the lowest frequencies, which is clearly seen. From ground\nit is extremely difficult to measure the oscillations using photometry due to the\nEarth's atmosphere, especially for the less evolved stars, which show the smallest\namplitudes. From space, however, detection of oscillations in a true analogue of\nthe Sun is possible.\n\n3.\n\nExtracting physical parameters\n\nThe seismic signature of solar-like oscillations is a nearly regular spaced comb\npattern in the amplitude spectrum. The characteristic spacings in this pattern\ncan be used to characterize the star. In Fig. 4 (left panel) we show in more\ndetail the amplitude spectrum in Fig. 1 (right panel). The degree l for each\nmode is indicated. We see two characteristic frequency separations: the large\nseparation, which is between modes of the same degree l (but successive radial\norder n, which for the Sun is in the order of 10–30), and the small separations.\nThe large separation (∆ν) is a direct measure of the stellar density, while the\nsmall separation (δν) is sensitive to the mean molecular weight in the core (hence\nage) of the star. This is illustrated in Fig. 4 (right panel), which shows stellar\n\n\fStello et al.\n\nPower\n\n4\n\n0.1\n\n1.0\nFrequency (mHz)\n\nFigure 3.: Left panel: Hertzsprung-Russell diagram with names and approximate locations of known groups of pulsating stars. The lower dashed line is\nthe zero age main sequence. The two parallel long dashed lines bracket the\ninstability strip. Stellar evolution tracks (grey curves) are shown for 1, 2, 3,\n4 and 7 M⊙ . Stars that have shown evidence of solar-like oscillations are indicated. (The figure is slightly modified compared to the original, which was\nkindly supplied by J. Christensen-Dalsgaard.) Right panel: Observed power\nspectra (power=amplitude squared) of the oscillations in the Sun and four other\nstars. The horizontal axis is the observed frequency in milli Hertz on a logarithmic scale. The power has been normalized to show the same peak height in\neach plot. The actual amplitudes increase up the plot, and the peak power in\nξ Hya is roughly 30 times that of the Sun. These results are all based on radial\nvelocity measurements. For all but the Sun they are obtained from the ground\n(Sun (Gabriel et al. 1997); α Cen A (Butler et al. 2004); β Hyi (Bedding et al.\n2001); η Boo (Kjeldsen et al. 1995); ξ Hya (Frandsen et al. 2002)).\n\nevolutionary tracks of different mass (solid curves) in the δν versus ∆ν plane.\nThe dashed lines indicate constant central hydrogen abundance.\n4.\n\nConstraining the planet radius\n\nA planet transit potentially gives a very precise measure of the radius of the\nplanet relative to its host star (Holman et al., this proceedings). However,\nadditional observations are required to establish the actual size scale. Basically,\nwe cannot tell if it is a transit of a big star by big planet, or a transit of a small\n\n\fAsteroseismology: a powerful tool to complement planet transits\n\n5\n\nFigure 4.: Left panel: Similar to Fig. 1 but for a shorter frequency range for\n\ngreater detail. The degree l for each mode is indicated. Right panel: Small\nversus large separation (in micro Hertz) for stellar evolutionary tracks (solid\ncurves) of different mass. Dotted curves indicate constant central hydrogen\nabundance. The arrow label age indicates the direction of the stellar evolution\nfor each track. (The figure is a slightly modified version of the original provided\nby J. Christensen-Dalsgaard.)\n\nstar by a small planet. Seismology can be of significant help to constrain the\nactual stellar radius (and hence the radius of the planet when combined with\nthe transit depth), using only the photometric transit data. The requirements\nare that the precision is high enough and that the data sample the oscillations.\nThese requirements depend very much on where in the HR diagram the star is\nlocated, as both oscillation amplitude and period vary significantly across the\nHR diagram.\nWithout applying asteroseismology and without a distance measurement,\nthe stellar radius has to be constrained by spectroscopy and photometry. In\nthis case we can determine the temperature to roughly 100 K (or 2%), and\nthe absolute luminosity to approximately 40%. The accuracy in the radius is\ntherefore roughly 20%. From the stellar location in the HR diagram we can\nfurther obtain a mass estimate to about 10% using stellar models.\nFrom seismology we get the large separation to a very high accuracy, at least\n0.5% for Kepler targets. Since the mean density of the star is proportional to the\nlarge separation squared, this seismic measure gives the density to about 1%.\nCombining that with the 2% temperature determination reduces the uncertainty\nin the mass to roughly 5% (in addition to a smaller uncertainty in the luminosity\nof approximately 10%). This mass estimate together with the seismic density\nmeasurement finally provides a 2–3% radius estimate, which is a tremendous\nimprovement.\nFor Kepler, parallax measurements are expected to be derived at the end\nof the mission, which will lower the uncertainty in the luminosity to about 2%\nfrom the parallaxes alone. This implies a better mass estimate to roughly 3%,\nand hence a radius estimate of approximately 1% if combined with the seismic\nmeasurement of the large separation. This in turn improves the precision of the\ntemperature to less than 1%. In addition, the small separation can be measured\n\n\f6\n\nStello et al.\n\nto at least 10%, which for a solar mass star implies that the age will be known\nto better than 1 Gyr.\n5.\n\nConclusion\n• Including seismology to determine the stellar parameters improves significantly the accuracy with which we can characterize the stars, and hence\ntheir planets.\n• This can be obtained without complicated and time-consuming calculations of pulsation models for each star.\n• Only the data already obtained to detect the transits need to be used,\nprovided the data sampling is high enough. Cadence requirements are\nabout once per minute for a true Sun-like star, and up to roughly half an\nhour for a giant star.\n• This technique would help tremendously for a mission such as Kepler,\nwhere the precision in the radius estimates of the host stars are improved\nby a factor of 7 without any parallax information and by a factor of 20\nwhen parallaxes become available.\n\nIn the last few years, the field of asteroseismology has taken advantage of the\nobservational techniques developed in the quest of detecting and studying exoplanets. This has mostly been from ultra-high precision Doppler measurements,\nbut in the coming years very accurate photometry from space will become available. With these observational techniques in common, very similar data sets and\ncomplementary but supporting science goals, there is an obvious opportunity for\nexoplanet research to take advantage of the extremely precise measurements that\nseismology can offer in order to determine the properties of planet-hosting stars.\nThis makes the future for both research fields very exciting.\nAcknowledgments. This paper has been supported by the Astronomical\nSociety of Australia and by the Australian Research Council. We are grateful\nfor the VIRGO data being publicly available.\nReferences\nBedding, T. R., Butler, R. P., Kjeldsen, H., et al. 2001, ApJ, 549, L105\nBedding, T., & Kjeldsen, H. 2006, ESA SP-624: Proceedings of SOHO 18/GONG\n2006/HELAS I, Beyond the spherical Sun, 18,\nBrown, T. M. & Gilliland, R. L. 1994, ARA&A, 32, 37\nButler, R. P., Bedding, T. R., Kjeldsen, H., et al. 2004, ApJ, 600, L75\nChristensen-Dalsgaard, J. 2004, Solar Phys., 220, 137\nFrandsen, S., Carrier, F., Aerts, C., et al. 2002, A&A, 394, L5\nGabriel, A. H., Charra, J., Grec, G., et al. 1997, Solar Phys., 175, 207\nKjeldsen, H., Bedding, T. R., Viskum, M., & Frandsen, S. 1995, AJ, 109, 1313\n\n\f"}