{"id": "http://arxiv.org/abs/astro-ph/0507117v1", "guidislink": true, "updated": "2005-07-06T00:13:50Z", "updated_parsed": [2005, 7, 6, 0, 13, 50, 2, 187, 0], "published": "2005-07-06T00:13:50Z", "published_parsed": [2005, 7, 6, 0, 13, 50, 2, 187, 0], "title": "The free precession and libration of Mercury", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0507367%2Castro-ph%2F0507136%2Castro-ph%2F0507243%2Castro-ph%2F0507704%2Castro-ph%2F0507583%2Castro-ph%2F0507535%2Castro-ph%2F0507650%2Castro-ph%2F0507685%2Castro-ph%2F0507302%2Castro-ph%2F0507491%2Castro-ph%2F0507226%2Castro-ph%2F0507154%2Castro-ph%2F0507037%2Castro-ph%2F0507524%2Castro-ph%2F0507654%2Castro-ph%2F0507633%2Castro-ph%2F0507004%2Castro-ph%2F0507550%2Castro-ph%2F0507656%2Castro-ph%2F0507473%2Castro-ph%2F0507355%2Castro-ph%2F0507056%2Castro-ph%2F0507334%2Castro-ph%2F0507254%2Castro-ph%2F0507510%2Castro-ph%2F0507484%2Castro-ph%2F0507191%2Castro-ph%2F0507295%2Castro-ph%2F0507505%2Castro-ph%2F0507151%2Castro-ph%2F0507213%2Castro-ph%2F0507194%2Castro-ph%2F0507675%2Castro-ph%2F0507097%2Castro-ph%2F0507121%2Castro-ph%2F0507018%2Castro-ph%2F0507489%2Castro-ph%2F0507088%2Castro-ph%2F0507157%2Castro-ph%2F0507530%2Castro-ph%2F0507167%2Castro-ph%2F0507492%2Castro-ph%2F0507376%2Castro-ph%2F0507172%2Castro-ph%2F0507164%2Castro-ph%2F0507531%2Castro-ph%2F0507286%2Castro-ph%2F0507499%2Castro-ph%2F0507538%2Castro-ph%2F0507299%2Castro-ph%2F0507111%2Castro-ph%2F0507446%2Castro-ph%2F0507280%2Castro-ph%2F0507431%2Castro-ph%2F0507403%2Castro-ph%2F0507012%2Castro-ph%2F0507525%2Castro-ph%2F0507358%2Castro-ph%2F0507371%2Castro-ph%2F0507572%2Castro-ph%2F0507630%2Castro-ph%2F0507321%2Castro-ph%2F0507346%2Castro-ph%2F0507384%2Castro-ph%2F0507117%2Castro-ph%2F0507561%2Castro-ph%2F0507455%2Castro-ph%2F0507627%2Castro-ph%2F0507707%2Castro-ph%2F0507218%2Castro-ph%2F0507397%2Castro-ph%2F0507010%2Castro-ph%2F0507232%2Castro-ph%2F0507035%2Castro-ph%2F0507005%2Castro-ph%2F0507161%2Castro-ph%2F0507297%2Castro-ph%2F0507077%2Castro-ph%2F0507020%2Castro-ph%2F0507642%2Castro-ph%2F0507320%2Castro-ph%2F0507336%2Castro-ph%2F0507217%2Castro-ph%2F0507497%2Castro-ph%2F0507130%2Castro-ph%2F0507575%2Castro-ph%2F0507592%2Castro-ph%2F0507344%2Castro-ph%2F0507198%2Castro-ph%2F0507441%2Castro-ph%2F0507119%2Castro-ph%2F0507176%2Castro-ph%2F0507432%2Castro-ph%2F0507426%2Castro-ph%2F0507461%2Castro-ph%2F0507227%2Castro-ph%2F0507407%2Castro-ph%2F0507616%2Castro-ph%2F0507495%2Castro-ph%2F0507700%2Castro-ph%2F0507463&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The free precession and libration of Mercury"}, "summary": "An analysis based on the direct torque equations including tidal dissipation\nand a viscous core-mantle coupling is used to determine the damping time scales\nof O(10^5) years for free precession of the spin about the Cassini state and\nfree libration in longitude for Mercury. The core-mantle coupling dominates the\ndamping over the tides by one to two orders of magnitude for the plausible\nparameters chosen. The short damping times compared with the age of the solar\nsystem means we must find recent or on-going excitation mechanisms if such free\nmotions are found by the current radar experiments or the future measurement by\nthe MESSENGER and BepiColombo spacecraft that will orbit Mercury. We also show\nthat the average precession rate is increased by about 30% over that obtained\nfrom the traditional precession constant because of a spin-orbit resonance\ninduced contribution by the C_{22} term in the expansion of the gravitational\nfield. The C_{22} contribution also causes the path of the spin during the\nprecession to be slightly elliptical with a variation in the precession rate\nthat is a maximum when the obliquity is a minimum. An observable free\nprecession will compromise the determination of obliquity of the Cassini state\nand hence of C/MR^2 for Mercury, but a detected free libration will not\ncompromise the determination of the forced libration amplitude and thus the\nverification of a liquid core", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0507367%2Castro-ph%2F0507136%2Castro-ph%2F0507243%2Castro-ph%2F0507704%2Castro-ph%2F0507583%2Castro-ph%2F0507535%2Castro-ph%2F0507650%2Castro-ph%2F0507685%2Castro-ph%2F0507302%2Castro-ph%2F0507491%2Castro-ph%2F0507226%2Castro-ph%2F0507154%2Castro-ph%2F0507037%2Castro-ph%2F0507524%2Castro-ph%2F0507654%2Castro-ph%2F0507633%2Castro-ph%2F0507004%2Castro-ph%2F0507550%2Castro-ph%2F0507656%2Castro-ph%2F0507473%2Castro-ph%2F0507355%2Castro-ph%2F0507056%2Castro-ph%2F0507334%2Castro-ph%2F0507254%2Castro-ph%2F0507510%2Castro-ph%2F0507484%2Castro-ph%2F0507191%2Castro-ph%2F0507295%2Castro-ph%2F0507505%2Castro-ph%2F0507151%2Castro-ph%2F0507213%2Castro-ph%2F0507194%2Castro-ph%2F0507675%2Castro-ph%2F0507097%2Castro-ph%2F0507121%2Castro-ph%2F0507018%2Castro-ph%2F0507489%2Castro-ph%2F0507088%2Castro-ph%2F0507157%2Castro-ph%2F0507530%2Castro-ph%2F0507167%2Castro-ph%2F0507492%2Castro-ph%2F0507376%2Castro-ph%2F0507172%2Castro-ph%2F0507164%2Castro-ph%2F0507531%2Castro-ph%2F0507286%2Castro-ph%2F0507499%2Castro-ph%2F0507538%2Castro-ph%2F0507299%2Castro-ph%2F0507111%2Castro-ph%2F0507446%2Castro-ph%2F0507280%2Castro-ph%2F0507431%2Castro-ph%2F0507403%2Castro-ph%2F0507012%2Castro-ph%2F0507525%2Castro-ph%2F0507358%2Castro-ph%2F0507371%2Castro-ph%2F0507572%2Castro-ph%2F0507630%2Castro-ph%2F0507321%2Castro-ph%2F0507346%2Castro-ph%2F0507384%2Castro-ph%2F0507117%2Castro-ph%2F0507561%2Castro-ph%2F0507455%2Castro-ph%2F0507627%2Castro-ph%2F0507707%2Castro-ph%2F0507218%2Castro-ph%2F0507397%2Castro-ph%2F0507010%2Castro-ph%2F0507232%2Castro-ph%2F0507035%2Castro-ph%2F0507005%2Castro-ph%2F0507161%2Castro-ph%2F0507297%2Castro-ph%2F0507077%2Castro-ph%2F0507020%2Castro-ph%2F0507642%2Castro-ph%2F0507320%2Castro-ph%2F0507336%2Castro-ph%2F0507217%2Castro-ph%2F0507497%2Castro-ph%2F0507130%2Castro-ph%2F0507575%2Castro-ph%2F0507592%2Castro-ph%2F0507344%2Castro-ph%2F0507198%2Castro-ph%2F0507441%2Castro-ph%2F0507119%2Castro-ph%2F0507176%2Castro-ph%2F0507432%2Castro-ph%2F0507426%2Castro-ph%2F0507461%2Castro-ph%2F0507227%2Castro-ph%2F0507407%2Castro-ph%2F0507616%2Castro-ph%2F0507495%2Castro-ph%2F0507700%2Castro-ph%2F0507463&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An analysis based on the direct torque equations including tidal dissipation\nand a viscous core-mantle coupling is used to determine the damping time scales\nof O(10^5) years for free precession of the spin about the Cassini state and\nfree libration in longitude for Mercury. The core-mantle coupling dominates the\ndamping over the tides by one to two orders of magnitude for the plausible\nparameters chosen. The short damping times compared with the age of the solar\nsystem means we must find recent or on-going excitation mechanisms if such free\nmotions are found by the current radar experiments or the future measurement by\nthe MESSENGER and BepiColombo spacecraft that will orbit Mercury. We also show\nthat the average precession rate is increased by about 30% over that obtained\nfrom the traditional precession constant because of a spin-orbit resonance\ninduced contribution by the C_{22} term in the expansion of the gravitational\nfield. The C_{22} contribution also causes the path of the spin during the\nprecession to be slightly elliptical with a variation in the precession rate\nthat is a maximum when the obliquity is a minimum. An observable free\nprecession will compromise the determination of obliquity of the Cassini state\nand hence of C/MR^2 for Mercury, but a detected free libration will not\ncompromise the determination of the forced libration amplitude and thus the\nverification of a liquid core"}, "authors": ["S. J. Peale"], "author_detail": {"name": "S. J. Peale"}, "author": "S. J. Peale", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.icarus.2005.03.017", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0507117v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0507117v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "34 pages, 6 figures, AASTEX In press in Icarus", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0507117v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0507117v1", "journal_reference": null, "doi": "10.1016/j.icarus.2005.03.017", "fulltext": "–1–\nThe Free Precession and Libration of Mercury\n\narXiv:astro-ph/0507117v1 6 Jul 2005\n\nS. J. Peale\nDepartment of Physics\nUniversity of California\nSanta Barbara, CA 93106\nemail: peale@io.physics.ucsb.edu\nAbstract\n\nAn analysis based on the direct torque equations including tidal dissipation and a viscous\ncore-mantle coupling is used to determine the damping time scales of O(105 ) years for free\nprecession of the spin about the Cassini state and free libration in longitude for Mercury.\nThe core-mantle coupling dominates the damping over the tides by one to two orders of\nmagnitude for the plausible parameters chosen. The short damping times compared with\nthe age of the solar system means we must find recent or on-going excitation mechanisms if\nsuch free motions are found by the current radar experiments or the future measurement by\nthe MESSENGER and BepiColombo spacecraft that will orbit Mercury. We also show that\nthe average precession rate is increased by about 30% over that obtained from the traditional\nprecession constant because of a spin-orbit resonance induced contribution by the C22 term\nin the expansion of the gravitational field. The C22 contribution also causes the path of\nthe spin during the precession to be slightly elliptical with a variation in the precession rate\nthat is a maximum when the obliquity is a minimum. An observable free precession will\ncompromise the determination of obliquity of the Cassini state and hence of C/MM R2 for\nMercury, but a detected free libration will not compromise the determination of the forced\nlibration amplitude and thus the verification of a liquid core.\n\n\f–2–\n1.\n\nIntroduction\n\nA major goal of the MESSENGER (Solomon, et al. 2001) and BepiColombo (Anselmi &\nScoon, 2001) missions to Mercury and ground-based Radar Speckle Displacement Interferometry (RSDI) observations (Holin, 1988, 1992, 2003; Margot et al. 2003) is the determination\nof the structure and state of Mercury's interior. The probe of interior properties is based on\nthe accurate determination of the four parameters, i, φ0 , J2 and C22 , where i is Mercury's\nobliquity, φ0 is the amplitude of the physical libration in longitude, and J2 and C22 are the\nsecond degree harmonic coefficients in the expansion of Mercury's gravitational field. These\nparameters are sufficient for determining the factors in the equation (Peale, 1976a; 1981;\n1988; Peale et al. 2002)\n\u0012\n\u0013\u0012\n\u0013\n\u0013\u0012\nCm\nB−A\nCm\nMM R2\n=\n≤ 1,\n(1)\n2\nB−A\nMM R\nC\nC\nwhere MM and R are the mass and radius of Mercury, A < B < C are the principal moments\nof inertia, and Cm is the polar moment of inertia of the mantle alone.\nThe first factor follows from the amplitude of the physical libration\n\u0012\n\u0013\u0012\n\u0013\n3 B−A\n959 4\n2\nφ0 =\n1 − 11e +\ne +*** ,\n2\nCm\n48\n\n(2)\n\nwhere e is the orbital eccentricity, and Cm occurs in the denominator because a liquid core is\nnot expected to follow the 88 day physical libration of the mantle. The second factor follows\nfrom\nB−A\n= 4C22 ,\n(3)\nMM R2\nand the third from (Peale, 1969)\n\u0013\u0015\n\u0014\n\u0012\n123\n7\n3\ne−\ne\nJ2 /(1 − e2 )3/2 + 2C22\nC\nn\n2\n16\n=\n,\n2\nMM R\n(sin I)/ic − cos I\nμ\n\n(4)\n\nwhere ic is the obliquity of Cassini state 1, (E.g., Colombo, 1966:, Peale, 1969), which\nMercury is expected to occupy (i = ic ), I is the inclination of the orbit plane to the Laplace\nplane on which Mercury's orbit precesses at the constant rate −μ, and n is the orbital mean\nmotion, and the equation assumes ic ≪ 1. In a Cassini state the spin axis is coplanar with\nthe normal to the Laplace plane and the orbit normal as both the spin and the orbit normal\nprecess around the Laplace plane normal with an approximately 280,000 year period. Fig. 1\nshows the configuration for Cassini state 1, where the ascending node of the equator plane on\nthe orbit plane remains coincident with the ascending node of the orbit plane on the Laplace\nplane. In Fig. 1, the Z axis is normal to the orbit plane, the Y axis is in the orbit plane, and\nthe X axis comes out of the paper. Eq. (4) shows the dependence of C/MM R2 on J2 , C22\n\n\f–3–\nand ic , and together, the last three equations show the necessity of knowing ic , φ0 , J2 and\nC22 to determine Cm /C.\n[Figure 1]\nConditions for the success of the experiment are\n1) The liquid core must not follow the mantle during the 88 day forced libration in longitude.\n2) The core must follow the mantle during the 280,000 year orbit precession, where the spin\naxis is locked to this precession if it occupies the Cassini state.\n3) B − A must be due to the mantle alone.\n4) Adiabatic invariance must keep the spin close to the Cassini state during the slow variation\nof the orbital elements.\nThe first two conditions are satisfied for viscous core-mantle coupling, topographical\ncoupling due to core-mantle boundary (CMB) irregularities, magnetic core-mantle coupling,\nand gravitational coupling between an axially asymmetric solid inner core and the mantle\n(Peale, et al. 2002). The third condition requires that there not be long wavelength irregularities in the CMB such that dense core material contributes to B − A. Such irregularities\ncould be induced by mantle convection (D. Stevenson, private communication, 2003), but a\nmajor contribution to B − A would occur only if the convective cells have circumferential\nscales comparable to the planet radius R. Otherwise, the plus and minus contributions due\nto short wavelength topography would tend to average to a zero total contribution to B − A.\nAs the iron core must be near 0.75R in radius (Siegfried and Solomon, 1974), the horizontal\nscale of any convective cells is unlikely to greatly exceed the 0.25R thickness of the mantle.\nIt has also been argued that Mercury's mantle convection ceased early in Mercury's history\n(Reese and Peterson, 2002), and the CMB should thereby be nearly axially symmetric with\nlittle or no contribution to B − A from the core.\nIt is implicitly assumed in the above that all free motions associated with Mercury's spin\nare damped to near zero amplitude, and that the spin remains close to the current location\nof Cassini state 1 in spite of slow variation of the orbital parameters that define the state.\nThe free motions include a free libration in longitude, a free precession of the spin about\nCassini state 1, and a free wobble. The free libration in longitude results when the axis of\nminimum moment of inertia does not point toward the Sun when Mercury is at perihelion.\nThe gravitational torque on the permanent asymmetry of the planet, averaged around the\norbit, tends to restore the alignment of the axis of minimum moment of inertia with the\nSun at perihelion because of the 3:2 spin-orbit resonance, so viewed at perihelion, the long\naxis will tend to librate about the direction toward the Sun with a period of about 10 years.\nThe free precession of the spin axis is like the 26,000 year precession of the Earth's spin axis\nabout the ecliptic, except the precession is about the Cassini state instead of the orbit normal,\nwhere the deviation of the Cassini state from the orbit normal is less than 2 arcmin. The\nperiod of this precession is O(1000 years). Free wobble or non principal axis rotation occurs\nwhen the spin axis does not coincide with the axis of maximum moment of inertia. The\n\n\f–4–\nspin axis then precesses around the axis of maximum moment of inertia in the body frame\nof reference with a period O(500 years). The wobble is analogous to the Chandler wobble\nof the Earth. The angular momentum is conserved during free wobble, and the spin axis\nmakes only small excursions relative to inertial space. The spin angular momentum is not\nconserved during the free libration and free precession as the planet responds to the external\ngravitational torque due to the Sun. In the former the spin axis direction is maintained as\nthe magnitude of the spin varies periodically, whereas in the latter the spin describes a cone\nabout the Cassini state, which is almost a cone relative to inertial space.\nThe term \"free\" characterizes these motions as having arbitrary phases and amplitudes,\nwhich amplitudes, if significantly different from zero, could complicate the interpretation\nof the spacecraft and radar data constraining the properties of the interior. For example,\na finite amplitude free precession would displace Mercury's spin vector from the Cassini\nstate, and its arbitrary phase and amplitude would thereby increase the uncertainty in the\nobliquity of the state used in determining C/MM R2 in Eq. (4). Tidal friction has been shown\nto carry the spin to Cassini state 1 from almost any initial configuration on a time scale that\nis short compared to the age of the solar system (Peale, 1974; Ward, 1975). Free libration in\nlongitude (9.2 year period, for (B −A)/Cm = 3.5 ×10−4 ) is similarly damped, but such a free\nlibration does not confuse the experiment, as the 88 day forced libration is superposed on the\nfree libration (Peale, et al. 2002), and its amplitude is readily discernible. Any free wobble\nwill also damp due to dissipation by internal friction as the equator plane changes relative\nto the body principal axis system in addition to tidal friction and core-mantle dissipation.\nFor the Moon, tidal dissipation is about 4 times more effective than the dissipation caused\nby the changing orientation of the equator (Peale, 1976b). Finally it was asserted (Peale,\n1974) that the spin would remain close to the instantaneous position of the Cassini state if\nit were ever close because of the adiabatic invariance of an action integral that is equivalent\nto the solid angle swept out by the spin vector as it precesses around the Cassini state.\nIf, on the other hand, free motions of measurable amplitude are found, excitation mechanisms must be sought given the damping. Relatively small amplitudes of free motions can\nbe detected by orbiting spacecraft (Zuber and Smith, 2000) and radar (Holin, 2003; Margot\net al. 2003). The damping time scales constrain the types of excitation mechanisms that\nare likely to be responsible. For example, short time scales make excitation by the impact of\nlarge objects less likely (See Section 4). The existence of a liquid core introduces damping\nby core-mantle interaction that shortens the time scales for the damping of free motions\ndeduced for tidal dissipation. This paper is the first of three where we consider the free\nmotions and quantify the adiabatic invariance of the spin axis separation from the Cassini\nstate. Here we derive and compare damping time scales for the two processes of tidal friction and core-mantle dissipation with viscous coupling for free libration and free precession.\nQuantifying the adiabatic invariance and determining the damping of a free wobble require\ndifferent approaches, and these will be considered in the following papers. The damping of\nthe free rotational motions of the Moon have been determined earlier using a Hamiltonian\n\n\f–5–\nformulation with dissipation accounted for by introducing phase lags in the periodic terms\ndescribing the response of the Moon to various forcing potentials (Peale, 1976b). This analysis is general albeit somewhat complicated. For the libration and precession considered here\nwe use a much simpler approach by fixing the orbit and writing the equations of motion\ndirectly in terms of the external and internal torques on the mantle and core. However, this\nsimplified approach will not work well for the wobble, so the general Hamiltonian analysis\nwill be used in a following paper to treat the wobble damping, although the torque equations\nwill be applied there for the core-mantle coupling. In Sections 2 and 3, we show that the\ndamping times for the free precession and the free libration in longitude are both near 105\nyears with the core-mantle interaction being between one and two orders of magnitude more\neffective than tidal friction. In Section 4 we show that the time between impacts capable of\ngenerating observable amplitudes of free libration or precession exceeds 109 years, making\nsuch excitation exceeding unlikely. Summary and conclusions follow in Section 5. We begin\nwith the free precession, as the equations describing the damping of the libration in longitude\nare scalar versions of those describing the damping of the precession.\n\n2.\n\nDamping of free precession\n\nGenerally, the spin axis precesses about Cassini state 1 which is offset approximately\n1.7 arcmin from the orbit normal. However, for the purposes of calculating the damping, we\nassume the orbit is fixed, so that the precession will be about the orbit normal. (The Cassini\nstate for a fixed orbit can be thought to coincide with the orbit normal, since the state\napproaches the orbit normal as the orbital precession rate is decreased, or it can be thought\nnot to exist at all.) Accordingly, we adopt an XY Z inertial system centered on Mercury\nwith the XY plane coincident with the orbit plane, the X axis pointing from Mercury to\nthe perihelion of the Sun's relative orbit, and with unit vector eo = eZ being the orbit\nnormal. During the precession about the orbit normal, the damping of the precession angle\nabout the orbit normal will be essentially the same as the damping of the precession about\nthe Cassini state without involving the complications induced by the orbit precession. (See\nPeale, (1976b) for a complete analysis applied to the Moon.)\nWe assume that the core mantle interaction is simply proportional to the difference in\nthe vector spin angular velocities of the mantle and core as the simplest possible coupling.\nThis coupling is consistent with a viscous coupling between two rigid spheres. Mercury is\nrotating slowly enough such that pressure coupling of the core and mantle from the elliptical\nshape of the core-mantle boundary is not important, which leaves viscous coupling the most\nprobable. We also assume principal axis rotation. The equations describing the motions of\nthe core and mantle are then\n ̈~\n~ ̇\n~ ̇\n~\n~\nCm ψ\nm = N + T − k(ψ m − ψ c )\n\n\f–6–\n ̈~\n~ ̇\n~ ̇\nCc ψ\nc = k(ψ m − ψ c ),\n\n(5)\n\n~ ̇\nwhere ψ\nm,c are the angular velocities of the mantle and core respectively, Cm,c are the moments of inertia about the spin axis of the mantle and core, k is the coupling constant for\n~ is the torque on Mercury's permanent figure due to the Sun, and\nthe core-mantle torque, N\nT~ is the tidal torque. We first describe the free precession of Mercury, which is affected by\nthe spin-orbit resonance hψ̇m i = 1.5n, where hψ̇m i is the average value of the magnitude of\n~ ̇m , and n is the mean motion.\nψ\n\n2.1.\n\nFree Precession\n\nWe start with the first of Eqs. (5), with T~ = k = 0 and keep only the second order\nterms in the expansion of Mercury's gravitational potential Φ. Then the torque on Mercury\nis the negative of the torque on the Sun, so\n2h\n~ = − GMM M⊙ R 6C22 sin θ sin 2φ eθ\n~r × ∇Φ = N\nr3\n\ni\n+ (3J2 sin θ cos θ + 6C22 sin θ cos θ cos 2φ) eφ ,\n\n(6)\n\nwhere G is the gravitational constant, MM and M⊙ are the masses of Mercury and the Sun\nrespectively, R is Mercury's radius, J2 and C22 are second order harmonic coefficients in the\nexpansion of Mercury's gravitational field, rθφ are the spherical polar coordinates of the Sun\nrelative to the principal xyz axis system with eθ and eφ being unit vectors in the θ and φ\ndirections. The z axis is the axis of maximum moment of inertia coincident with the spin\naxis, and x and y are axes of minimum and intermediate moments of inertia in the equator\nplane. We define m̂ = ez as a unit vector along the spin axis of the mantle. The xyz axes\nare oriented with respect to the XY Z axes through Euler angles Ω, i, ψm as shown in Fig.\n2, where Ω is the longitude of the ascending node of the equator on the orbit plane, i is the\nobliquity, and ψm is the angle between the node and the x axis in the equator plane, with\nthe subscript m again referring to the mantle.\n[Figure 2]\n~ in spherical coordinates relative to the body axes (Eq. (6)) is\nThe expression for N\nwritten in terms of the xyz components, and these are transformed to the XY Z components\nthrough the usual series of three rotations through the Euler angles. With the unit vector\ntoward the Sun, r̂ = cos f eX + sin f eY = sin θ cos φ ex + sin θ sin φ ey + cos θ ez , where eX,Y,Z\nand ex,y,z are unit vectors along the respective axes, scalar products r̂ * ex , ey , ez yield the\n~ in terms\nexpressions for the products of circular functions of the spherical coordinates in N\nof the Euler angles and the true anomaly f when ex,y,z are expressed in the XY Z system.\n~ in the XY Z system in terms of the Euler\nThese results and the transformation yield N\n\n\f–7–\nangles and the true anomaly.\n2n\n~ = − GM⊙ MM R 3J2 sin i cos i sin (f − Ω)[ sin f eX − cos f eY ]\nN\nr3\n−1.5J2 sin i sin 2(f − Ω) eZ\n\n+6C22 sin i[cos i cos 2ψ sin (f − Ω) − cos(f − Ω) sin 2ψ](− sin f eX + cos f eY )\nh 3 + cos 2i\ni o\n+6C22 −\nsin 2(f − Ω) cos 2ψ + cos i cos 2(f − Ω) sin 2ψ eZ\n(7)\n4\n\nTo eliminate high frequency terms due to the orbital motions, we average Eq. (7) over an\norbit period keeping everything constant except f and ψm . With ψ̇m = 1.5n (n = mean\nmotion), we can write ψm = ψm0 + 1.5M, where M is the mean anomaly and ψm0 is constant\nover the orbit period. With this substitution for ψm , we expand the circular functions in Eq.\n(7) to display products of circular functions of f and M with a3 /r 3 . The terms yielding non\nzero averages over the orbit period are then\n\u001c 3\u001d\nZ 2π 3\na\n1\n1\na dM\n=\ndf =\n3\n3\nr\n2π 0 r df\n(1 − e2 )3/2\n\u001d\n\u001c 3\n53e3\na\ncos\n3M\n=\n+***\nr3\n16\n\u001c 3\n\u0012\n\u001d\n\u0013\na\n1 7\n123 3\ncos 2f cos 3M\n=\ne−\ne +***\nr3\n2 2\n16\n\u0012\n\u001d\n\u0013\n\u001c 3\n1 7\n123 3\na\nsin 2f sin 3M\n=\ne−\ne +*** ,\n(8)\nr3\n2 2\n16\n√\nwhere r = a(1 − e2 )/(1 + e cos f ) and dM/df = r 2 /(a2 1 − e2 ) have been used. Some of\nthese averages are easily done directly, whereas others are easily evaluated with the help of\nCayley's (1859) tabulated expansions.\nWhen M = 0, the x axis is nearly aligned with the X axis as a condition of the spin-orbit\nresonance. This will be true for small i if ψm0 = −Ω. With this substitution, the averaged\ntorque on the permanent asymmetric figure of Mercury is\n\u001a\u0014\n\u0012\n\u0013\u0015\n3J2 sin i cos i 3C22 sin i(1 + cos i) 7\n123 3\n2\n2\n~\nhNi = −n MM R\n×\n+\ne−\ne\n2(1 − e2 )3/2\n2\n2\n16\n(cos Ω eX + sin Ω eY )\n3C22 sin i(1 + cos i) 53 3\ne (− cos Ω eX + sin Ω eY )\n+\n2\n16\n\u001b\n3C22 sin i(1 − cos i) 53 3\n+\ne (cos 3Ω eX + sin 3Ω eY ) ,\n(9)\n2\n16\nwhere the Z components average to zero-the Z component with coefficient J2 because\nh(a3 /r 3 ) cos 2f i = h(a3 /r 3 ) sin 2f i = 0, and the Z component with coefficient C22 because\nsin (2ψm0 + 2Ω) vanishes with ψm0 = −Ω. The first bracketed factor shows how the traditional precession constant, involving only J2 , has been modified by the spin-orbit resonance\n\n\f–8–\nwith the addition of the C22 term, which decreases the precession period by nearly 30% from\nthat due to the J2 term alone. (For the Earth, only J2 is important in determining the rate\nof precession, since terms involving C22 for the noncommensurate, rapid spin average to zero,\nand in addition, C22 ≪ J2 .)\n~ i in a form suitable for solving the equations for the spin vector motion,\nBefore writing hN\nit is instructive to write Eq. (9) in a different way. The following identities are needed.\ncos ΩeX − sin ΩeY\n\n= cos 2Ω(cos ΩeX + sin ΩeY )\n+ sin 2Ω(sin Ω eX − cos Ω eY )\n\nsin i(cos ΩeX + sin ΩeY ) = −m̂ × eZ\n\nsin i(sin ΩeX − cos ΩeY ) = −(m̂ × eZ ) × eZ\n\n(10)\n\nIf we rearrange terms and employ some trigonometric identities along with Eqs. (10) in Eq.\n(9), we can write\n~\nhNi\n= [K1 cos i + K3 (1 − cos i)](m̂ × eZ )\nCm ψ̇m\n−K2 cos i cos 2Ω(m̂ × eZ )\n−K2 sin 2Ω(m̂ × eZ ) × eZ .\n\n(11)\n\nThe constants K1,2,3 are defined by\nK1\nK2\nK3\n\n\u0014\n\u0013\u0015\n\u0012\n3J2\nn2 MM R2\n7\n123 3\n=\n,\n+ 3C22\ne−\ne\n2\n16\nCm ψ̇m 2(1 − e2 )3/2\n53\n3n2 MM R2\nC22 e3 ,\n=\n16\nCm ψ̇m\n\u0012\n\u0013\n2\n2\n7\n3n MM R\n123 3\nC22\n=\ne−\ne\n2\n16\n2Cm ψ̇m\n\n(12)\n\nThe m̂ × eZ terms in Eq. (11) describe the retrograde precession of m̂ about the orbit\nnormal, but now with a rate that varies with twice the precession frequency. The triple\ncross product term varies the obliquity i with the same frequency. Recall that the longitude\nof the ascending node of the equator on the orbit plane Ω is measured from the perihelion\ndirection. The precession rate is minimal when Ω = 0 or π and maximal when Ω = ±π/2.\nThe former corresponds to the node of the equator plane being parallel to the line of apsides\nsuch that at the perihelion, the torque due the axial asymmetry of Mercury (K2 has C22\nas a factor.) vanishes. When Ω = ±π/2, the node is perpendicular to the line of apsides,\nand at perihelion, the long axis is tilted the maximum amount relative to the orbit plane.\nThe torque and hence the averaged precession rate is thus maximal for this phase, since the\nbiggest torque due to the egg shape of Mercury comes at the perihelion when the long axis\nis tipped above or below the plane of the orbit while still being oriented toward the Sun\n\n\f–9–\nas closely as possible because of the spin-orbit resonance. For Ω = 0 or π, the opportunity\nfor the Sun to exert a large torque on the axial asymmetry at perihelion is lost, and so the\naverage of the torque around the orbit is minimal.\nThe triple product term in Eq. (11) lies along the projection of the spin vector m̂ on\nthe orbit plane. So for π/2 > Ω > 0 the obliquity is increasing, whereas it is decreasing for\n0 > Ω > −π/2. Hence, the obliquity has a minimum when the spin is crossing the X axis\n(Ω = ±π/2) and a maximum when it crosses the Y axis (Ω = 0 or π). The precession rate is\nmaximal when the obliquity is minimal and vice versa, and the precession path of the spin\nis elliptical with the long axis along the Y axis. The reader will notice that there is also a\ncomponent of the triple vector product torque that is parallel to m̂. This component may\nnot be real because of the approximations involved in arriving at Eq. (9), but if it is real,\nthere may be a displacement of the center of physical libration as a function of precessional\nphase.\nA good approximation to the precessional motion can be obtained by neglecting the\nlast term in Eq. (9), since it is O(i2 ) smaller than the next smallest term. With m̂ =\nsin i sin Ω eX − sin i cos Ω eY + cos i eZ , we can write Eq. (9) in still another way with a\nrearrangement of terms,\n~\nhNi\n=\nCm ψ̇m\n\n\u0015\n(1 + mZ )\nmY eX\nK1 mZ + K3 (1 − mZ ) − K2\n2\n\u0014\n\u0015\nK2 (1 + mZ )\n− K1 mZ + K3 (1 − mZ ) +\nmX eY ,\n2\n\u0014\n\n(13)\n\nwhere mX,Y,Z are the respective components of m̂. Then\n~\nhNi\ndm̂\n=\n,\ndt\nCm ψ̇m\nwhere ψ̇m ≡ 1.5n is fixed by the spin orbit resonance and can be removed from the time\nderivative. From Eq. (13)\n\u0015\n\u0014\n(1 + mZ )\ndmX\nmY\n= K1 mz + K3 (1 − mZ ) − K2\ndt\n2\n\u0015\n\u0014\ndmY\n(1 + mZ )\nmX ,\n(14)\n= − K1 mz + K3 (1 − mZ ) + K2\ndt\n2\nwhere for small obliquity, with mZ ≈ 1, the solution is\n\u0013\n\u0015\n\u0014\u0012q\n0\n2\n2\nK1 − K 2 t + ζ\nmX = mX cos\nr\n\u0014\u0012q\n\u0013\n\u0015\nK 1 + K2 0\n2\n2\nmY =\nm sin\nK1 − K 2 t + ζ ,\nK 1 − K2 X\n\n(15)\n\n\f– 10 –\nwhere m0X and ζ are constants depending on initial conditions. With Cm = 0.18MM R2 ,\nψ̇ = 1.5n, J2 = 6×10−5 , and C22 = 1×10−5 (Anderson et al. 1987), K1 = 1.117×10−2rad/yr\nand K2 = 8.391×10−5 rad/yr, the precession period of Mercury's spin about the orbit normal\n(or the Cassini state) is 562 years. If Cm = 0.16MM R2 , the precession period would be\nreduced to 500 years. If the core were solid and C = 0.33MM R2 , the precession period would\nbe 1031 years. This compares to a 1066 year period obtained numerically by Rambaux and\nBois (2004). The ratio of the axes of the p\nellipse traced out by the projection of the spin\nmax\nmax\nvector on the orbit plane is mY /mX = (K1 + K2 )/(K1 − K2 ) = 1.0075. This solution\nis consistent with the deductions about the precession from Eq. (11) discussed above.\n\n2.2.\n\nTidal Torque\n\nThe tidal torque is given by\n3k2 GM⊙2 R5\nT~ =\n(r̂ * r̂T )(r̂T × r̂),\nr6\n\n(16)\n\nwhere k2 is the second degree potential Love number, r̂ is a unit vector toward the Sun, and\nr̂T is a unit vector toward the tidal maximum, which is the sub-Sun position on Mercury a\nshort time ∆t in the past.\ndr̂\nr̂T = r̂ − ∆t,\n(17)\ndt\nwhere the time derivative is relative to the body system of coordinates. Replacement of r̂T\nwith Eq. (17) yields\n3k2 GM⊙2 R5 ∆t\n ̇\nr̂ × r̂,\n(18)\nT~ =\nr6\n~ (dD/dt)\n~\nwhere we have set r̂ * r̂T = 1. So with the generic relation for a vector D,\nbody =\n~\n~\n~\n(dD/dt)space − ~ω × D, and with D → r̂ = cos f eX + sin f eY and ~ω → ψ̇m (sin i sin Ω eX −\nsin i cos Ω eY + cos i eZ ) + Ω̇eZ , it is easy to obtain\n\nr̂ × r̂ ̇ = ψ̇m sin i cos(f − Ω)(− sin f eX + cos f eY )\n+(f ̇ − Ω̇ − ψ̇m cos i) eZ\n\n(19)\n\nEq. (19) is substituted into Eq. (18) and averaged over the orbit period. Useful averages\nare\n\u001c 6 \u001d\n\u0013\n\u0012\na  ̇\n15 2 45 4\n5 6\nf\n= n 1 + e + e + e /(1 − e2 )6 = nf1 (e)\nr6\n2\n8\n16\n\u0012\n\u0013\n\u001c 6\u001d\n3 4\na\n2\n=\n1\n+\n3e\n+\ne ) /(1 − e2 )9/2 = f2 (e)\nr6\n8\n\u0013\n\u001d\n\u0012\n\u001c 6\n3 2 1 4\na\ncos 2f\n=\ne + e /(1 − e2 )9/2 = f3 (e)\n6\nr\n2\n4\n\n\f– 11 –\n\u001d\na6\nf2 (e) + f3 (e)\n2\ncos f\n=\n6\nr\n2\n\u001d\n\u001c 6\nf2 (e) − f3 (e)\na\n2\nsin\nf\n=\n(20)\nr6\n2\n√\nwhere f ̇ = n(a2 1 − e2 )/r 2 has been used in the first of Eqs. (20). The averaged tidal\ntorque is thus\n\u0013\n\u0012\nn\n2 5\n3k\nGM\nR\n∆t\nf\n(e)\n−\nf\n(e)\n2\n2\n3\n⊙\neX\n− ψ̇m sin i sin Ω\nhT~ i =\na6\n2\n\u0012\n\u0013\nf2 (e) + f3 (e)\n+ψ̇m sin i cos Ω\neY\n2\no\n+[nf1 (e) − f2 (e)ψ̇m cos i] eZ ,\n(21)\n\u001c\n\nwhere we have neglected Ω̇ compared to n and ψ̇m .\nThe relationship between the dissipation function Q and ∆t follows from a simple example. The dissipation parameter Q for an system oscillating at frequency ω is defined by\n(e.g. Lambeck, 1980 p 14)\nI\ndE\ndt\n1\ndt\n=\n= ω∆t,\n(22)\nQ\n2πE ∗\nwhere the numerator is the energy dissipated during a complete cycle of oscillation and E ∗ is\nthe maximum energy stored during the cycle. For a tidally distorted, nearly spherical body\nwith the disturbing body in a circular equatorial orbit, a cycle would consist of half a rotation\nof the distorted body relative to the body causing the tide. For a complex tide generated by\na non circular, non equatorial orbit of the disturbing body, each periodic term in a Fourier\ndecomposition of the tide would have its own maximum stored energy and dissipation over\na complete cycle of oscillation.\nThe response of an oscillator with forcing function F = A′ sin ωt when ω ≪ ω0 , with\nω0 being the lowest frequency of free oscillation, can be represented by x = B ′ sin ω(t − ∆t),\nwhere ∆t is the phase lag in the response due to the dissipation as was assumed above for\nthe tidal response. The rate at which the forcing function does work is dE/dt = F ẋ =\nA′ B ′ ω sin ωt cos ω(t − ∆t). Then\nZ t\nh − cos (2ωt − ω∆t) sin ω∆t it\n′\n′\n+\nt .\n(23)\nE(t) =\nF ẋdt = A B ω\n4ω\n2\nt1\nt1\nThe first term in Eq. (23) is the periodic storage of energy in the oscillator, and the second\nis the secular loss of energy. The maximum energy stored is just twice the coefficient of the\ncosine term, E ∗ = A′ B ′ /2, and the energy dissipated during a complete period of 2π/ω is\n∆E = A′ B ′ πω∆t with sin ω∆t ≈ ω∆t. We use the energy stored as the energy increment\n\n\f– 12 –\nabove the minimum energy in the first term since the stored tidal energy will always be an\nincrease over the relaxed spherical shape of the body. Hence 1/Q = ω∆t as indicated in\nEq. (22). Since ∆t is independent of frequency, Q is inversely proportional to frequency in\nthis model. For Earth like materials, Q is almost independent of frequency for a wide range\nof frequencies above typical tidal frequencies (Knopoff, 1964), but to avoid a step function\nreversal in torque when a tidal frequency changes sign, it is not unlikely that the above\nfrequency dependence will prevail for the small tidal frequencies.\nQ = 100 is typical of Earth-like materials (Knopoff, 1964) and apparently for Phobos\ngenerated tides on Mars (Smith and Born, 1976). For Mars the dominant frequency is\nω = 2(ψ̇ − nP ), where ψ̇ is Mars rotational angular velocity and nP is Phobos' mean orbital\nmotion. The factor 2 follows from there being two tidal cycles for each synodic period. With\na rotation period of 24h 37m 23s and an orbital period of 0.319 days, ω = 3.14 × 10−4 rad/s\nleading to ∆t ≈ 32 seconds for Q = 100. For Mercury, the fundamental tidal period is\nthe orbit period, since Mercury rotates 180◦ relative to the Sun for each orbit. Although\none might infer that Q is inversely proportional to frequency near a particular frequency to\nsmooth the transition from positive to negative frequency, it cannot be the case that the\nsame proportionality constant will apply over a very wide range of frequency as indicated\nby Q ≈ 100 nearly independent of frequency between approximately 10 and 106 cps for\nEarth materials (Knopoff, 1964). We can write ∆t = P/(2πQ0 ), with Q0 being the value\nappropriate to the 88 day orbital period P .\n\n2.3.\n\nDamping the Obliquity\n\nTo evaluate the damping of the free precession, or equivalently, the rate of change of\nthe obliquity i of the mantle due to the torques on the right hand side of the first of Eqs.\n~ ̇ = Cm ψ̇m m̂,\n(5), we write cos i = eo * m̂. (Recall eo = eZ .) With β~ = Cm ψ\nm\n!\n!\nd cos i\n1\ndβ~\n1\nd eo * β~\n~ dβ .\n=\neo *\n− 2 (eo * β)\n=\n(24)\ndt\ndt\nβ\nβ\ndt\nβ\ndt\n~\nIf we note that dβ/dt\n= T~ , where T~ is the total torque acting on the mantle, and that\ndβ/dt = m̂ * T~ , Eq. (24) becomes\ne⊥ * T~\nT~\nd cos i\n= [eo − (eo * m̂)m̂] * = sin i\n,\ndt\nβ\nβ\n\n(25)\n\nwhere e⊥ is a unit vector lying in the equator plane that is perpendicular to the node of the\nequator on the orbit plane.\nFrom Eqs. (11) and (25),\nsin i\n\n~\ne⊥ * hNi\n= −K2 sin2 i cos i sin 2Ω,\nβ\n\n(26)\n\n\f– 13 –\nrepresents the periodic variation in the obliquity during the precession. From Eqs. (21) and\nwith e⊥ = − cos i sin Ω eX + cos i cos Ω eY + sin i eZ ,\n\"\n#\nψ̇\ncos\ni\ne⊥ * hT~ i\nm\nsin i\n= K4 sin2 i nf1 (e) −\n(f2 (e) − f3 (e) cos 2Ω) ,\n(27)\nβ\n2\nwhere\nK4 =\n\n3k2 GM⊙2 R5\nnQ0 Cm ψ̇m a6\n\n,\n\n(28)\n\nwith 1/nQ0 replacing ∆t as described above. The functions fi (e) are defined in Eqs. (20)\nwith f1 (e) = 1.72, f2 (e) = 1.37, and f3 (e) = 0.0779 for e = 0.206.\nWe have only the core-mantle interaction term left to evaluate, which we determine with\nthe analysis of Goldreich and Peale (1970). We note first that K2 ≪ K1 from Eqs. (12), and\n~ , the zero-order\nsince the tidal torque and core-mantle interaction are small compared to N\nsolution of Eqs. (5) is approximately a uniform retrograde precession of the spin vector at\nthe rate −Ω̇, where Ω̇ is the magnitude of the motion of the projection of the spin vector on\nthe orbit plane. This zero order motion of the mantle is determined from Eq. (13)\ndm̂\n≈ K1 (m̂ × eo ) = K1 sin i(− cos Ω eX − sin Ω eY ),\ndt\n\n(29)\n\nwhere we have also omitted the K3 term because of the factor 1 − mZ ≈ 0. From Eq. (29)\nΩ̇ = K1 =\n\n2π −1\nyr ,\n562\n\n(30)\n\nwhere the 562 year precession period is discussed above for Cm = 0.18MM R2 . If we substitute\nEq. (30) into Eq. (29), restore the core-mantle interaction but continue to ignore the tidal\ntorque, and divide both equations by Cm Ω̇2 to make them dimensionless, we can write\n~ ̇ ′\ndψ\n ̇′\n ̇′\nm\n′\n′ ~\n~\n=\nψ̇\n(\nm̂\n×\ne\n)\n−\nk\n(\nψ\n−\nψ\no\nm\nm\nc)\ndt′\n′\n′\n~ ̇\nk ′ ~ ̇ ′\ndψ\nc\n~ ̇ )\n=\n(\nψ\n−\nψ\nc\ndt′\nC′ m\n\n(31)\n\n′\n′\n′\n′\n′\n~ ̇\n~ ̇\n~′ ~ ̇\n~ ̇\nwhere t′ = Ω̇t, ψ\nm,c = ψ m,c /Ω̇, k = k/(Cm Ω̇), and C = Cc /Cm . With δ = ψ m − ψ c , we can\nwrite\n\u0012 ′\n\u0013\nd~δ′\nC + 1 ~′\n′\n′\n= ψ̇m (m̂ × eo ) − k\nδ.\n(32)\ndt′\nC′\n\nIf we assume t′ = 0 when Ω = 0 (i.e. with the ascending node of the equator plane\non the orbit plane aligned with the perihelion direction), we can write Ω = −Ω̇t = −t′ and\n\n\f– 14 –\nreplace Ω in the inertial system representation of m̂ × eo in Eq. (29) with −t′ . Then\ndδX′\n′\n+ αδX′ = −ψ̇m\nsin i cos t′ ,\ndt′\ndδY′\n′\n+ αδY′ = ψ̇m\nsin i sin t′ ,\ndt′\ndδZ′\n+ αδZ′ = 0,\ndt′\n\n(33)\n\n′\nwhere α = k ′ (C ′ + 1)/C ′ and δX,Y,Z\nare the components of ~δ′ along the respective coordinate\naxes. The solutions of these equations are\n\u0013\n\u0012\n−α cos t′ − sin t′\n′\n′\n′\n,\nδX = A1 exp −αt + ψ̇m sin i\nα2 + 1\n\u0012\n\u0013\n− cos t′ + α sin t′\n′\nδY′ = A2 exp −αt′ + ψ̇m\nsin i\n,\nα2 + 1\nδZ′ = A3 exp −αt′ ,\n(34)\n\nwhere Ai are constants determined by initial conditions.\nWith e⊥ = − cos i sin Ω eX + cos i cos Ω eY + sin i eZ , and Ω = −t′ , we substitute the\nsteady state solution for ~δ′ into the normalized form of Eq. (25), with\n\u001d\n\u001c ′\nk ′ sin2 i cos i\nk sin i ~′\n,\n(35)\nδ * e⊥ =\n−\n′\nα2 + 1\nψ̇m\nto yield in dimensionless form\n\u0013\nk ′ sin i cos i\nK2\n′\nsin i cos i sin 2t +\nK1\nα2 + 1\nn\no\nψ̇ ′ cos i\n+K4 sin2 i n′ f1 (e) − m\n[f2 (e) + f3 (e) cos 2t′ ] ,\n2\n\nd cos i\n= sin i\ndt′\n\n\u0012\n\n(36)\n\nwhere n′ = n/Ω̇. If we average Eq. (36) over a precession period, the circular functions with\nt′ in their arguments vanish. Next with d cos i/dt′ = − sin i di/dt′ and setting sin i ≈ i and\ncos i ≈ 1, we arrive at\n\"\n!#\n\u001c \u001d\n′\nψ̇\nk′\ndi\n= −i 2\n+ K4 n′ f1 (e) − m f2 (e)\n.\n(37)\ndt′\nα +1\n2\nThe time constant for the decay of the obliquity due to both a core-mantle interaction and\ntidal dissipation is the reciprocal of the coefficient of i in Eq. (37).\nWe relate the coupling constant k ′ to the core viscosity by equating the time scale for\nthe spin-up of a viscous liquid in a closed container with the time scale for relaxation of the\n\n\f– 15 –\ndifferential rotation. From Eqs. (34), the dimensioned time scale in the transient part of δ̇i′\nis\nRc\nC′\n1\n=\n=\n,\n(38)\nτδ =\nαΩ̇\n(1 + C ′ )k ′ Ω̇\n(ψ̇m ν)1/2\nwhere the expression on the right is the time scale for a fluid with kinematic viscosity ν,\nrotating differentially in a closed spherical container with radius Rc , to become synchronously\nrotating with the container at angular velocity ψ̇m (Greenspan and Howard, 1963). Here\nψ̇m = 1.5n, Rc = 0.75R is Mercury's core radius (Siegfried and Solomon, 1987), Ω̇ =\n(2π/562) yr−1 and C ′ = Cc /Cm ≈ 1. So\n1\n\n1\nC ′ (ψ̇m ν) 2\nk =\n= 8.59 × 10−3 ν 2 ,\n(1 + C ′ )Ω̇Rc\n′\n\n(39)\n\nwhere ν is expressed in cm2 /sec.\nThe kinematic viscosity of the Earth's core has been estimated from first principles to\n−2\n2\nlie within the bounds 4.5 × 10−3 <\n∼ ν <\n∼ 4.1 × 10 cm /sec by Wijs et al. (1998). If we\nchoose ν = 0.01 cm2 /sec, then α = 2k ′ = 1.72 × 10−3, and its square can be neglected in the\ndenominator of the first term on the right of Eq. (37). With P = 88 days, R = 2439 km,\nCm = 0.18MM R2 , MM = 3.302 × 1026 g, the time scale for damping Mercury's free precession\nbecomes\n89 years\n.\n(40)\nτprec =\n−3\n1/2\n8.59 × 10 ν + 8.08 × 10−3 k2 /Q0\nTheoretical values of Mercury's k2 ≈ 0.3 to 0.4 (Spohn et al. 2001; Van Hoolst and Jacobs,\n2003), and Q0 ≈ 100 is typical for Mars and Earth (Smith and Born, 1976; Knopoff, 1964)\nsuch that k2 /Q0 = 0.004 is a plausible value. With ν = 0.01 cm2 /sec, we find τprec ≈\n1.00 × 105 years under the action of both tidal dissipation and core mantle interaction, and\nτprec = 1.04 × 105 years and τprec = 2.76 × 106 years for core-mantle interaction and tidal\ndissipation respectively if they acted alone.\nThe development of Eqs. (5) for numerical integration is given in Appendix A. An\nadvantage of a numerical approach is that the consequences for the damping of large values\nof ν, where the approximations used above are not valid, can be determined. Since, ν ≫ 0.01\nis unlikely, we shall not show the damping histories for large ν, but remark that the damping\ntime scale is a minimum for ν ≈ 1000 cm2 /sec where the precession amplitude is nearly\ncritically damped. For larger ν the coupling is sufficiently strong that the core nearly follows\nthe mantle as both precess together and the precession period increases from 562 years\nto somewhat over 1000 years appropriate for a solid planet. The damping time scale for\nthe precession amplitude is similarly increased from the minimum as ν is increased. The\nGreenspan and Howard spin-up time scale in Eq. (38) also must be replaced by a viscous\ntime scale for large ν in relating ν to k ′ .\nIn Fig. 3 we demonstrate that the same time scale for damping the precession amplitude from the combination of core-mantle and tidal dissipation is obtained numerically\n\n\f– 16 –\nas analytically for the same ν = 0.01 cm2 /sec and k2 /Q0 = 0.004. If we set k = 0, the\ndamping time estimated numerically similarly to Fig. 3 is ≈ 2.8 × 106 years compared to\n2.76 ×106 years determined analytically, which confirms the analytic development. Damping\ntime scales for reasonable choices of ν and k2 /Q0 are all short compared to the solar system\nage, so we would expect the free precession to be completely damped, barring excitation by\nan unspecified mechanism.\n[Figure 3]\n\n3.\n\nDamping of free libration\n\nThe treatment of the libration damping is considerably simpler than that of the precession amplitude as we can assume zero obliquity as well as principal axis rotation. Eqs. (5)\nstill apply, but are now scalar equations since there are only torques about the Z axis, which\nis now coincident with the z axis. With r̂ × r̂ ̇ = −(ψ̇m − f ̇)ez , we can write\nCm ψ̈m = N + T − k(ψ̇m − ψ̇c ),\n\n3k2 GM⊙2 R5\n3\nGM⊙\n= − (B − A) 3 sin 2ξ −\n2\nr\nr 6 Q0\n\nCc ψ̈c = k(ψ̇m − ψ̇c ),\n\nψ̇m − f ̇\nn\n\n!\n\n− k(ψ̇m − ψ̇c ),\n(41)\n\nwhere C22 = (B − A)/(4MM R2 ) has been used. The relations between f, φ, ξ, and ψm are\nshown in Fig. 4, where the X axis is now drawn from the Sun to the perihelion with line\nSM drawn from the Sun to Mercury. The angles are linked to the orbital motion through\nψm = ξ + f , where f is the true anomaly.\n[Figure 4]\nMercury's rotation deviates from ψ̇m = 1.5n by only a small amount, where ψ̇m is\n~ ̇m . We therefore write γ̇m = ψ̇m − 1.5n as the deviation of the spin\nthe magnitude of ψ\nfrom the mean value. The angular deviation of, say, Mercury's axis of minimum moment\nof inertia (\"long axis\") from the position it would have had if the rotation were uniform is\nthen γm = ψm − 1.5M, where M = nt is the mean anomaly. γm is thus the angle between\nMercury's long axis and the direction to the Sun when Mercury is at perihelion. The equation\nof rotational motion for the mantle becomes\n3 B − A a3\nT\nk\nγ̈m + n2\nsin (2γm + 3M − 2f ) =\n−\n(γ̇m − γ̇c ),\n(42)\n3\n2\nCm r\nCm Cm\nwhere n2 = GM⊙ /a3 is used, with a being the orbit semimajor axis. The expansion of\nsin (2γm + 3M − 2f ) leads to factors (a3 /r 3 ) sin 2f and (a3 /r 3 ) cos 2f , which when expanded\nin terms of the mean anomaly M with the help of Cayley's tables (1859) gives\n\u0012\n\u0013\n959 4\nB−A\n3 B − Ah\n2\n1 − 11e +\nγ̈m + 3\nG201 (e)γm = −\ne + * * * sin t\nCm\n2 Cm\n48\n\n\f– 17 –\n\u0012\n\n\u0013\ni\n1\n421 3\n−\ne+\ne + * * * sin 2t + * * *\n2\n48\n\u0012\n\u0013\nγ̇m γ̇c\nk\nT\n,\n−\n−\n+\nCm n2 Cm n n\nn\n\n(43)\n\nwhere e is the orbital eccentricity, G201 (e) = 7e/2 − 123e3 /16 + * * * is a Kaula (1966) eccentricity function. We have made the equation dimensionless by dividing by n2 and letting\nnt = M → t. Also, sin 2γm → 2γm , cos 2γm → 1 have been used, and a Fourier series in t\nmultiplied by γm has been omitted from the right hand side of the equation, since it is so\nmuch smaller than the unit coefficient of the displayed series.\nIf we neglect the weak tidal and core-mantle torques for the moment, Eq.(43) is a simple\nforced harmonic oscillator equation describing the free and forced librations of longitude for\nMercury. The amplitude of the sin 2t term is about 11% of that of the sin t term and\nhigher order terms are even less. Since the overall amplitude of the physical libration is not\nchanged by this second term in the series, and higher order terms contribute negligibly, we\nretain only the sin t in defining the amplitude of the physical libration in Eq. (2). Although\nthis truncation of the series gives a reasonably good approximation to the physical libration\nangle, it gives a poor representation of the deviation of the angular velocity from the mean\nvalue. This is shown in Fig. 5 where the flat tops on the angular velocity curve at perihelion\nresult from the fact that the orbital angular velocity is close to the spin angular velocity\nnear perihelion, and with the long axis nearly aligned with the direction to the Sun during\nthis time, the torque on the axial asymmetry is nearly zero. A detailed explanation of the\nbehavior of dψm /dt near the perihelion is given in Appendix B.\n[Figure 5]\nThe free libration is treated by averaging Eq. (43) over an orbit period such that the\nperiodic terms responsible for the physical libration vanish. T is replaced by its averaged\nvalue hT i and γ̇m and γ̇c are uniform on the orbital time scale. We have already specified the\nform of the frequency dependent tidal torque in Eqs. (41), where ∆t (defined in Eq. (17))\nis expressed in terms of ψ̇m − f ̇.\nZ 2π\n1\nhT i =\nT dM,\n2π 0\n\u0013\nZ 2π 4 \u0012\n3k2 n4 R5\n3 γ̇m a2 √\na\n2\n√\n= −\n+\n− 2 1 − e df,\nn\nr\n2πGQ0 1 − e2 0 r 4 2\n\u0013\n\u0012\nγ̇m\n,\n(44)\n= −F V +\nn\nwhere we have used the second form of the mantle equation in Eqs. (41), dM/df =\n√\n√\nr 2 /(a2 1 − e2 ), f ̇ = na2 1 − e2 /r 2 , and where\n\u0012\n\u0013\n3 4\n3k2 n4 R5\n3k2 n4 R5\n2\n1\n+\n3e\n+\n=\ne\nf2 (e)\nF =\nGQ0 (1 − e2 )9/2\n8\nGQ0\n\n\f– 18 –\n\nV\n\n=\n\n3 (1 + 15e2 /2 + 45e4 /8 + 5e6 /16)\n3 f1 (e)\n−\n= −\n,\n2\n3/2\n2\n4\n2\n(1 − e ) (1 + 3e + 3e /8)\n2 f2 (e)\n\nwhich agrees with Eq. (24) of Goldreich and Peale (1966), except for the correction of the\ncoefficient of e6 from 3/16 to 5/16.\nWe divide Eq. (43) by x2 = 3(B − A)G201 (e)/Cm and further normalize time by xt = t′ .\nTime t → t′ is now normalized by the free libration frequency instead of the precession\nfrequency Ω̇ as in Section 2. The average of Eq. (43) then becomes\n′\nd2 γm\n′\n′\n′\n+ γm\n= −k ′ (γ̇m\n− γ̇c′ ) − F ′ (V + xγ̇m\n)\n′2\ndt\nd2 γc′\nk′ ′\n=\n(γ̇ − γ̇c′ ),\ndt′ 2\nC′ m\n\n(45)\n\n′\nwhere F ′ = F/Cm x2 n2 , k ′ = k/Cm xn, C ′ = Cc /Cm and γ̇m,c\n= γ̇m,c /xn. Similar to the\ntreatment of the precession, the fact that the tidal and core-mantle torques on the mantle\nare small means that the mantle will librate almost as it would if k and F were zero. We\nfollow the same procedure as in Section 2 but now in scalar form. The zero order solution of\n′\n′\n′\nthe first of Eqs. (45) is then γm = γ̇m0\nsin t′ and γ̇m\n= γ̇m0\ncos t′ , where (γm , γ̇m ) = (0, γ̇m0 )\nwhen t′ = 0. Subtracting the second of Eqs. (45) from the first yields an equation for\n′\nδ = γ̇m\n− γ̇c′ .\n1 + C′\ndδ\n′\n′\n′\n+\nk\nδ̇ = −γ̇m0\nsin t′ − F ′ (V + xγ̇m0\ncos t′ ),\n(46)\ndt′\nC′\n′\nwhere we have substituted the zero order solutions\nfor γm and γ̇m\non the right. Now F ′ =\np\n1.5 × 10−2 k2 /Q0 , where we have used x =\n3(B − A)(7e/2 − 123e3 /16)/Cm = 0.0262,\nCm = 0.18MM R2 , inferred from Siegfried and Solomon (1974), (B − A)/Cm = 3.5 × 10−4 ,\nand Mercury's mass MM = 3.302 × 1026 g. The coefficient of cos t′ in Eq. (46) is a factor of\n3.9 × 10−4 less than the coefficient of sin t′ so we can neglect the former term. We keep the\nconstant term leading to the solution\n\nδ̇ = A4 exp (−αt) +\n\nF ′V\nγ̇m0\n(cos\nt\n−\nα\nsin\nt)\n−\n,\n1 + α2\nα\n\n(47)\n\nwhere α = k ′ (1 + C ′ )/C ′ and A4 is an arbitrary constant.\nThe steady state solution for δ̇ is substituted back into the first of Eqs. (45) to yield\n\u0012\n\u0013 ′\n\u0012\n\u0013\n′\nd2 γm\nk′\ndγm\nk′α\nF ′V\n′\n′\n+\n+\nF\nx\n+\n1\n−\nγ\n=\n−\n,\n(48)\nm\ndt′ 2\n1 + α2\ndt′\n1 + α2\n1 + C′\n′\n′\n′\n′\nwhere we have used the zero order solutions, γm\n= γ̇m0\nsin t′ and γ̇m\n= γ̇m0\ncos t′ in the\nsteady state solution for δ̇ and rearranged terms. Tidal friction displaces the zero point of\nthe libration by −F ′ V /(1 + C ′) = 1.83 × 10−3 k2 /Q0 = 7.34 × 10−6 radians or ∼ 1.5 arcsec for\nk2 /Q0 = 0.004 (x = 0.0262, V = 0.244). A measure of this displacement would determine\nk2 /Q0 for Mercury. (Tidal friction attempts to slow Mercury's spin to a value that is less\n\n\f– 19 –\nthan the current 1.5n, so at perihelion, the axis of minimum moment of inertia is displaced\nfrom exact alignment with the Sun (γm ≡ 0) until the averaged torque on the permanent\ndeformation balances the tidal torque and keeps the spin at the resonant rate.)\nThe time scale τlib for damping the free libration amplitude is twice the inverse of the\ncoefficient of γ̇m in Eq. (48). The transient part of the expression for δ in Eq. (47) is\nthe same as that for the precession analysis, so the coupling constant k ′ is related to the\nkinematic viscosity of the core by Eq. (39), except Ω̇ must be replaced by xn. Then\n1\n\nC ′ (ψ̇ν) 2\n−4 12\nk =\n=\n1.41\n×\n10\nν .\n(1 + C ′ )xnRc\n′\n\n(49)\n\nThe dimensioned time scale for damping the free libration is given by\nτlib =\n\n2\n\n(k /(1 +\n+ F ′ x)xn\n2\n≈\n′\n(k + F ′ x)xn\n2.92 rmyears\n≈\n−4\n(1.41 × 10 ν 1/2 + 3.93 × 10−4 k2 /Q0 )\n′\n\nα2 )\n\n(50)\n\nfrom Eq. (48), where α = 2k ′ is small and its square can be neglected. We again choose\nν = 0.01 cm2 /sec after Wijs et al. (1998) along with k2 /Q0 = 0.004 discussed above, we find\nτlib ≈ 1.86 × 105 years under the action of both tidal dissipation and core mantle interaction,\nand τlib = 2.07 × 105 years and τlib = 1.86 × 106 years for core-mantle interaction and tidal\ndissipation respectively if they acted alone. Eqs. (41) are numerically integrated in Fig. 6\nfor ν = 0.01 cm2 /sec and k2 /Q0 = 0.004, where the short period fluctuations in Fig. 6 are\nthe 88 day forced librations superposed on the free libration. The approximately determined\ntime scale is 1.8 × 105 years, which is close to the analytic value of 1.86 × 105 years. Damping\ntime scales for reasonable choices of ν and k2 /Q0 are all short compared to the solar system\nage, so we would expect the free librations to be completely damped, barring excitation by\nan unspecified mechanism.\n[Figure 6]\n\n4.\n\nConsequences of Impact\n\nThis is an exercise to determine what size impactor would be necessary to generate an\nobservable free libration or free precession. We shall assume Mercury has no free motions\nprior to the impact, and that there is a complete transfer to Mercury of the entire angular\nmomentum of the impactor relative to the center of mass of Mercury. If the impact ejecta\nis distributed symmetrically about the point of impact, it will carry away little angular\nmomentum. This approximate conservation of angular momentum allows us to infer that\n\n\f– 20 –\nthe angular increment in the amplitude of the precession is simply the component of the\nimpactor angular momentum that is perpendicular to the spin axis divided by the spin\nangular momentum Cm ψ̇m . The increment in the free libration amplitude follows easily\nfrom the parallel component of the impactor angular momentum. We shall assume that a\nfree libration amplitude or free precession amplitude of 0.1 arcmin is detectable.\nGenerally, an impactor, which can be either a comet or asteroid, will strike at a point\nwith spherical coordinates R, θ, φ relative to the body principal axis system with velocity\nrelative to the center of mass of Mercury of V~ = VR eR +Vθ eθ +Vφ eφ . The angular momentum\nof the impactor relative to the center of mass of Mercury is given by\n~I = R\n~ × MV~ = MR(Vθ eφ − Vφ eθ ),\nL\n\n(51)\n\nwhere M is the mass of the impactor. With eφ = − sin φ ex +cos φ ey and eθ = cos θ cos φ ex +\ncos θ sin φey − sin θ ez , we can write\n~ I = MR[(−Vθ sin φ − Vφ cos θ cos φ)ex\nL\n+(Vθ cos φ − Vφ cos θ sin φ)ey\n\n+Vφ sin θ ez ],\n\n(52)\n\n~M = L\n~ I , the components of L\n~M =\nWith the increment in Mercury's angular momentum, ∆L\n~ 0 +∆L\n~ M along ex and ey indicates that a free wobble has been induced. But that is not all,\nL\nM\nsince the redistribution of mass due to the crater and its ejecta redefines the inertia tensor,\nso x, y, z are no longer the principal axes. The new axis of maximum moment being offset\nfrom the original z axis also contributes to the wobble. The component ∆Lz means ψ̇m has\n~ M to the\nbeen incremented thereby creating a free libration in longitude. Transforming L\ninertial system defines a new direction of the total spin angular momentum which no longer\ncoincides with the Cassini state, which has itself been changed because of the change in the\n~ M now precesses around the new position of the Cassini state. A random\ninertia tensor. L\nimpact thus excites all three free motions (see Peale, 1975 for a more detailed treatment),\nbut how large must the impact be for detectable amplitudes?\nFirst we note that\nLIk = MRVφ sin θ\n\nLI⊥ = MR(Vθ2 + Vφ2 cos2 θ)1/2\n\n(53)\n\nare the components of impactor angular momentum just before impact at coordinates (θ, φ)\nthat are parallel and perpendicular to the spin axis. We consider first the excitation of\na free libration, which involves only LIk . The free libration is characterized by Eq. (43),\nwhere we neglect the right hand side\np to yield a small amplitude pendulum equation, whose\nfrequency of oscillation is xn = n 3(B − A)G201 (e)/Cm . Recall that γm = ψm − 1.5M is\nthe angular deviation of the x axis from the position it would have had if Mercury were\n\n\f– 21 –\n0\nrotating uniformly at angular velocity 1.5n. If γm = 0 and γ̇m = γ̇m\nat t = 0, the amplitude\nof the libration is\nLIk\nmax\n0\nγm\n= γ̇m\n/ω0 =\n,\n(54)\nCm xn\nwhere the final form assumes that all of the libration amplitude is induced by the impact.\nmax\nIf we set γm\n= 0.1′ = 2.91 × 10−5 rad as the minimum observable, choose Vφ =\n60 km/sec as a common impact velocity, set Cm = 0.18MM R2 as before, choose (B−A)/Cm =\n3.5 × 10−4 so that xn = 0.026n, and maximize the effect of the collision for a given M by\nassuming θ = π/2, we find the necessary M = 1.51 × 1015 g. For a density of 1 g/cm3 , the\nradius of the impactor is 0.712 km.\n\nHolsapple (1993) has described a careful development of scaling laws that predict the\nproperties of impact craters from the size and velocity of the impactor and the strength\nand gravitational acceleration of the body on which the impact occurs. His Eq. (22b) gives\nthe rim radius for large craters where gravity dominates the strength of the materials in\ncontrolling the outcome of the crater formation.\nRr = 10.14G′ −0.17 a′ 0.83 U 0.34 ,\n\n(55)\n\nwhere Rr is the rim radius of the crater just after it is formed in meters, G′ is the ratio\nof the gravitational acceleration at the surface of the body to that of the Earth, a′ is the\nradius of the impactor in meters, and U is the velocity in km/sec. Eq. (55) ignores the\nratio of the impactor density and surface material density raised to a small fractional power.\nWith Mercury's gravitational acceleration of 363 cm/sec compared to Earth's 980 cm/sec,\na′ = 712 m and U = Vφ = 60 km/sec, we find Rr =11.3 km. For a crater this large, it gets\neven larger because of slumping of the walls, with the expression for the final crater size in\nterms of Rr given by Eq. (28a) of Holsapple (1993). This is called a transition from a simple\nbowl-shaped crater to a complex crater with a shallow floor and central peak.\n\u0012 \u00130.079\nRf\nRf\n= 1.02\n,\n(56)\nRr\nR∗\nwhere Rf is the final rim radius, and R∗ is the transition radius from simple to complex\ncraters. R∗ is a function of the surface gravity with R∗ = 5 km for Mercury (Pike, 1988) (9.5\nkm for the Moon and 1.5 km for Earth and Venus). Substitution of this value of R∗ into\nEq. (56) yields 12.4 km as the rim radius expected for the impact event leading to a 0.1′\nfree libration amplitude for Mercury. This is a minimum value because of the choice of the\nextreme optimum values of Vφ and sin θ in Eq. (54). It should be noted that the Holsapple\ncrater radii are for vertical impacts, whereas we have calculated the angular momentum\nimpulse for an almost grazing impact. However, this caveat does not change the conclusion\nthat even the least detectable amplitude of a free libration of 0.1′ excited by an impact would\nleave a more than 20 km diameter pristine scar on the surface of Mercury.\n\n\f– 22 –\nFor an impact excitation of the precession, the angular amplitude would be\n∆i =\n\nLI⊥\nMVθ R\n=\n,\nCm ψ̇m\nCm ψ̇m\n\n(57)\n\nwhere we have assumed the impact is along a meridian for simplicity. If ∆i = 0.1′ , Vθ =\n60 km/sec, and Cm = 0.18MM R2 , then M = 8.72 × 1016 g. The impactor radius is then\na′ = 2.75 km for a density of 1 g/cm3 . It takes a much more energetic impact to excite an\nobservable free precession than an observable free libration. These numbers, when substituted into Eqs. (55) and (56), yield Rf = 41.7 km, and the pristine crater left behind from an\nimpact causing a 0.1′ increment in the amplitude of the free precession would be more than\n80 km in diameter. The fact that the Cassini state itself has shifted slightly because of the\nredefinition of the inertia tensor would not change the free precession amplitude sufficiently\nto alter this conclusion.\nIn Table 1 of Levison and Duncan (1997), the rate of impact of Jupiter family comets\non Mercury is given as 8.6 × 10−10 comets/year. These are for comets of absolute magnitude\n< 9, which correspond to radii a′ >\n∼ 1 km (H. Levison, private communication 2005). The\ncollision rate of very long period comets is probably small compared to this rate for the\nJupiter family comets. (H. Levison, private communication 2005). More than a billion\nyears would elapse on average between impacts on Mercury of sufficient size to excite a 0.1′\namplitude of the free libration in longitude, and because the larger impactor required, even\nmore time between excitations of a 0.1′ amplitude of the free precession. Comparing this\ntime between excitations with the O(105 ) year damping times for the libration and precession\namplitudes means collisions almost certainly could not be the cause of any observable free\nlibration or free precession.\n\n5.\n\nSummary and Conclusions\n\nThe spin orbit resonance of Mercury leads to a 30% reduction of the period of precession\nof the spin about the Cassini state from a contribution of the C22 term, compared to the\nusually derived precession period depending on J2 alone. This effect also leads to an elliptical\nprecessional path of the spin, where the ratio of the axes of the ellipse is about 1.0075.\nThere is a slight variation in the precession rate about the elliptical path with the maximum\noccurring when the separation of the spin from the Cassini state is minimal.\nThe simultaneous effects of tidal dissipation and a viscous liquid core-solid mantle coupling lead to time scales for damping Mercury's free libration in longitude and free precession\nof the spin about Cassini state 1 that are near 105 years. Because Mercury's liquid core is so\nlarge, the time scale for damping the precession amplitude by the core-mantle coupling acting\nalone is a factor of about 25 smaller than the time scale due to the tides alone for plausible\nchoices of the parameters. For the libration damping, the core-mantle time scale is a factor\n\n\f– 23 –\nof about 10 smaller than that for tidal friction. For all reasonable choices of the parameters,\nthe time scales are short compared with the age of the solar system. So if a free libration\nor free precession amplitude is found by the radar experiments or by the observations of\nthe MESSENGER or BepiColombo spacecraft, still unspecified recent or ongoing excitation\nmechanisms must be sought. It is possible that there exist observable forced deviations of\nthe spin axis from the Cassini state. If the forcing terms are identified, the amplitudes and\nphases of such deviations should be known and should not hinder the identification of the\nCassini state obliquity. On the other hand, the forcing terms are likely to be of fairly long\nperiod, as is likely if the amplitudes of the deviations from the Cassini state are observable.\nAs such their identity may not be obvious and the Cassini state position could be thereby\nuncertain until careful numerical integrations mapped such forced motions.\nAn observable libration amplitude (assumed to be 0.1′ ) is much easier to generate by\nimpact than an observable precession. But such impact excitation of either motion is very\nunlikely, since there is an estimated average time span between impacts of sufficient size of\nabout 109 years with current cometary fluxes. Excitation by impact no more than a few\ndamping time scales in the past would leave a fresh crater larger than 20 km diameter for\nthe excitation of an observable amplitude of libration and larger than 80 km diameter for the\nexcitation of an observable precession amplitude. An observable free precession will make\nthe obliquity of the Cassini state, and thereby the determination of C/MM R2 uncertain.\nBut an observable free libration does not hamper the determination of the physical libration\namplitude. If Mercury's core were solid, the term with the kinematic viscosity would vanish\nin the expressions for the damping times of the precession and libration (Eqs. (40) and (50).\nBut the resulting damping times due to the tides alone would be longer that these equations\nwould indicate for ν = 0, because the constants would then involve the moment of inertia of\nthe entire planet instead of just that of the mantle.\nThis analysis applies to other bodies in spin-orbit resonances such as the Moon, the\nregular satellites of the major planets, and Pluto's satellite Charon. The terms selected\nfrom the expansion of the torque expressions by the averaging process would correspond\nto rotation synchronous with the the orbital mean motions instead of 1.5 times the mean\nmotion used here. There are similar contributions to the rate of precession about the Cassini\nstate from C22 , since the synchronous rotation ensures terms involving C22 do not average\nto zero and C22 will be comparable to J2 in magnitude. There are indications that some\nof these bodies even have liquid layers in their interiors (e.g., Spohn and Schubert, 2003),\nalthough Europa would be a special case with a liquid ocean (e.g. Greenberg, 2004)\nIt will be more fun to seek alternative dynamic mechanisms of excitation of observed free\nmotions of Mercury than if no such motions are found. A possible albeit unlikely excitation\nof libration may lie in a coupling between the torques on the permanent deformation as\naffected by the spin-orbit resonance and the small obliquity of the Cassini state. Although\nsuch a libration would not be \"free,\" a near resonant forcing frequency could mimic a free\n\n\f– 24 –\nlibration. The investigation of such speculation is a future objective.\n\n6.\n\nAppendix A: Numerical Integration of the Precession Damping\n\nWe want to integrate Eqs. (5) over the precession time scale without following high\nfrequency motions on the orbit or libration time scales. The averaged torque on the perma~ i is given in Eq. (9), where we set ψm = ψ0 + 1.5M with ψ0 = −Ω to\nnent deformation hN\naccommodate the conditions of the spin-orbit resonance in the averaging process. The last\nterm of Eq. (9) is of order i2 smaller than the next smallest term, and it is neglected in Eq.\n(13) written in terms of the components of the unit vector along the spin axis m̂. It is this\nlatter form of the averaged torque on the permanent deformation that we will use here.\nThe averaged tidal torque is given by Eq. (21). The component of hT~ i parallel to the\nspin axis is balanced by a slight offset of the axis of minimum moment of inertia from the\n~\ndirection to the Sun at perihelion. However, we have removed that degree of freedom in hNi\nby assigning ψ0 = −Ω after Eq. (9). In order to avoid a secular change in ψ̇m , we keep\nonly the component of hT~ i perpendicular both to the spin vector and to the line of nodes.\nThe unit vector in this direction is e⊥ defined in Eq. (25). From this last equation, we see\nthat this is the only component of hT~ i that affects the obliquity. With ψ0 = −Ω and the\nelimination of the tidal acceleration of the spin, we have eliminated integration over the free\nlibration period leaving only the precession time scale in the calculation. So in place of hT~ i,\nwe shall use\n\"\n#\nhT~ i * e⊥\nψ̇m cos i\ne⊥ = K4 sin i nf1 (e) −\n(f2 (e) − f3 (e) cos 2Ω) ×\n2\nCm ψ̇m\n(− cos i sin Ω eX + cos i cos Ω eY + sin i eZ )\n\n(58)\n\nwhere K4 is defined by Eq. (28) with 1/(nQ0 ) replacing ∆t as described in Section 2.2.\nInclusion of the f3 (e) part of the bracketed coefficient in Eq. (58) leads to a sin i in the\ndenominator, which complicates the calculation. However, f3 (e) ≈ 0.056f2(e) for e = 0.206\nso its omission will lead to a small error in the motion of the spin axis and an indiscernible\nerror in the damping time scale, With this additional approximation, we arrive at\nhT~ i * e⊥\ne⊥ = K4 [nf1 (e) − ψ̇m mZ f2 (e)][−mZ mX eX − mZ mY eY + (m2X + m2Y ) eZ ],\nCm ψ̇m\n\n(59)\n\nwhere mX,Y,Z are the components of the unit vector along the spin axis of the mantle, m̂.\n~ ̇ m )/dt = Cm ψ̇m dm̂/dt where ψ̇m = 3n/2 = constant, we can average Eq. (5)\nWith d(Cm ψ\n~ i and the component of hT~ i parallel\nover an orbit period, insert the averaged expressions hN\ne⊥ from Eqs. (13) and (59), divide by K1 to make the equations dimensionless, set K1 t = t′\nand k/(Cm K1 ) = k ′ , and write six scalar equations in six unknowns, mX,Y,Z , cX,Y,Z , where\n\n\f– 25 –\ncX,Y,Z are the components of the unit vector parallel to the spin of the core.\n\u0015\n\u0014\nK2 1 + mZ\nK3\ndmx\n(1 − mZ ) −\nmY\n= mZ +\ndt′\nK1\nK1\n2\n\u0014\n\u0015\nK4 n\n3\n−\nf1 (e) − f2 (e)mZ mZ mX − k ′ (mX − cX ),\nK1\n4\n\u0015\n\u0014\ndmy\nK3\nK2 1 + mZ\nmX\n= − mZ +\n(1 − mZ ) +\ndt′\nK1\nK1\n2\n\u0014\n\u0015\n3\nK4 n\nf1 (e) − f2 (e)mZ mZ mY − k ′ (mY − cY ),\n−\nK1\n4\n\u0014\n\u0015\ndmz\n3\nK4 n\nf1 (e) − f2 (e)mZ (m2X + m2Y ) − k ′ (mZ − cZ ),\n=\ndt′\nK1\n4\n′\nk\ndcX\n=\n(mX − cX ),\n′\ndt\nC′\nk′\ndcY\n=\n(mY − cY ),\ndt′\nC′\ndcZ\nk′\n=\n(mZ − cZ )\ndt′\nC′\n\n(60)\n\nare the equations that are integrated numerically and that describe the damping of the\nprecession amplitude due to a core-mantle interaction and tidal dissipation. Here C ′ =\nCc /Cm , and we have set ψ̇m = 1.5n in the term from the tides.\n\n7.\n\nAppendix B: Description of torque reversal near perihelion.\n\nThis is an explanation of the nearly flat top on dγm /dt in Fig. 5. In this figure there is\na local minimum in γ̇m at perihelion and two local maxima at equal times before and after\nperihelion. The angular acceleration is zero at these extremes and corresponds to the axis of\nminimum moment of inertia (long axis) of Mercury being aligned with the direction to the\nSun. We ignore the slight variation in rotation due to the physical librations in determining\nthe torque on Mercury by assuming it is rotating uniformly with ψ̇m = 1.5n. At perihelion,\nthe long axis is also pointing toward the Sun, but f ̇ > ψ̇m = 1.5n at this point in the orbit.\nThe long axis does not keep up with the motion of the Sun in Mercury's sky as Mercury\npasses perihelion, so it starts to point away from the Sun in the direction of the orbital\nmotion. The angle between the Sun and the long axis continues to grow and reaches a local\nmaximum when f ̇ = ψ̇m , which occurs when f = 25.743◦ and M = 16.777◦ , 4.101 days after\nperihelion passage. The torque on Mercury during this time tends to increase the angular\nvelocity corresponding to the positive slope on dγ̇m /dt in Fig. 5 just after perihelion passage.\nThe increasing slope has an inflection at and starts to decrease after the time when f ̇ = ψ̇m ,\nwhich is when the angle between the long axis and the Sun starts to decrease. The slope\nof the dψm /dt = dγm /dt curve reaches zero when the axes are again aligned. To bring the\n\n\f– 26 –\nlong axis back into alignment with the Sun after perihelion passage, Mercury must rotate\nthrough the same angle as it has moved in its orbit, so that f = 1.5M at the time of the\nfirst post perihelion alignment. This corresponds to f = 44.442◦, M = 29.628◦ at 7.242 days\nafter perihelion passage. After this time, the long axis points on the other side of the Sun\nand the angular velocity starts to decrease.\nThe motion is symmetric with respect to the perihelion passage so the numbers corresponding to the approach to perihelion are the negatives of those above. It is ascertained\nthat Mercury is almost synchronously rotating with its instantaneous orbital motion near\nthe perihelion, during which time the long axis never deviates much from pointing toward\nthe Sun. Hence, γ̇m is almost constant for a time near the perihelion as shown in Fig. 5,\nwith the small deviations from a constant value explained above.\n\n8.\n\nAcknowledgements\n\nThanks are due H. Levison for directing me to his results for the rate of cometary\nimpacts on Mercury, to R. Strom for information on crater morphologies. and to J. Wisdom\nfor reminding me of two relevant papers of my own. Jacques Henrard and an anonymous\nreferee provided useful suggestions that improved the manuscript. This work is supported in\npart by the Planetary Geology and Geophysics Division of NASA under grant NAG5 11666\nand by the MESSENGER mission to Mercury.\n\n9.\n\nReferences\n\nAnderson, J.D., Colombo, G., Esposito, P.B., Lau, E.L., Trager, T.B. 1987. The mass,\ngravity field and ephemeris of Mercury. Icarus 71, 337-349.\nAnselmi, A., Scoon, G.E.N. 2001. BepiColombo, ESA's Mercury Cornerstone mission.\nPlanet. Space Sci. 49, 1409-1420.\nCayley, A. 1859. Tables of the developments of functions in the theory of elliptic motion,\nMem. Roy. Astron. Soc. 29, 191-306.\nColombo, G. 1966. Cassini's second and third laws. Astron. J. 71, 891-896.\nGoldreich, P., Peale, S.J. 1966. Spin orbit coupling in the solar system. Astron. J. 71,\n425-438.\nGoldreich, P., Peale, S.J. 1970. The obliquity of Venus, Astron. J. 75, 273-284.\nGreenberg, R. 2004. Europa The Ocean Moon: Search For An Alien Biosphere, Springer,\nBerlin, (Praxis, Chichester, UK).\n\n\f– 27 –\nGreenspan, H.P., Howard, G.N. 1963. On the time dependent motion of a rotating fluid, J.\nFluid Mech. 17, 385-404.\nHarder, H., Schubert, G. 2001. Sulfur in Mercury's core? Icarus 151, 118-122.\nHolin, I.V. 1988. Izvestiya Vysshikh Uchebnykh Zavedenii, Radiofizika 31, 515.\nHolin, I.V. 1992. Izvestiya Vysshikh Uchebnykh Zavedenii, Radiofizika 35, 433.\nHolin, I.V. 2003. Spin dynamics of terrestrial planets from Earth-based RSDI, Met. Planet.\nSci. 38, Supplement, Abstract no. 5003.\nHolsapple, K.A. 1993. The scaling of impact processes in planetary sciences, Ann. Rev.\nEarth Planet. Sci. 21, 333-373.\nKaula, W.M. 1966. Theory of Satellite Geodesy; Applications of Satellites to Geodesy,\nBlaisdell, Waltham, MA.\nKnopoff, L. 1964. Q, Rev. Geophys, 2, 625-660.\nLambeck, K. 1980. The Earth's Variable Rotation: Geophysical Causes and Consequences,\nCambridge University Press, Cambridge.\nLevison, H.F. Duncan, M.J. 1997. From the Kuiper Belt to Jupiter-family comets: The\nspatial distribution of ecliptic comets, Icarus 127, 13-32.\nMargot, J.L., Peale, S.J., Slade, M.A., Jurgens, R.F., Holin, I.V., 2003. Mercury interior\nproperties from measurements of librations. Mercury, 25th meeting of the IAU, Joint Discussion 2, 16 July, 2003, Sydney, Australia, meeting abstract. (http://adsabs.harvard.edu).\nPeale, S.J. 1969. Generalized Cassini's laws, Astron. J. 74, 483-489.\nPeale, S.J. 1974. Possible histories of the obliquity of Mercury, Astron. J. 79, 722-744.\nPeale, S.J. 1975. Dynamical consequences of meteorite impacts on the Moon, J. Geophys.\nRes. 80, 4939-4946.\nPeale, S.J. 1976a. Does Mercury have a molten core? Nature 262, 765-766.\nPeale, S.J. 1976b. Excitation and relaxation of the wobble, precession and libration of the\nMoon, J. Geophys Res. 81, 1813-1827.\nPeale, S.J. 1981. Measurement accuracies required for the determination of a Mercurian\nliquid core, Icarus 48, 143-145.\nPeale, S.J. 1988. Rotational dynamics of Mercury and the state of its core, In Mercury, ed.\nF. Vilas, C.R. Chapman, M.S. Matthews, U. of Arizona Press, Tucson, 461-493.\nPeale, S.J. Phillips, R.J., Solomon, S.C., Smith, D.E., Zuber, M.T., 2002. A procedure for\ndetermining the nature of Mercury's core, Meteor. Planet. Sci. 37, 1269-1283.\n\n\f– 28 –\nPike, R.J. 1988. Geomorphology of impact craters on Mercury, In Mercury, ed. F. Vilas,\nC.R. Chapman and M.S. Matthews, U. of Arizona Press, Tucson. 165-273.\nRambaux, N., Bois, E. 2004. Theory of Mercury's spin-orbit motion and analysis of its main\nlibrations, Astron. Astrophys. 413, 381-393.\nReese, C.C., Peterson, P.E. 2002. Thermal evolution of Mercury in the conductive regime\nand implications for magnetism, Lun. Planet. Sci. XXXIII, Abstract 1998.\nSiegfried, R.W., Solomon, S.C. 1974. Mercury: Internal structure and thermal evolution,\nIcarus 23, 192-205.\nSmith, J.C., Born, G.H. 1976. Secular acceleration of Phobos and the Q of Mars, Icarus 27,\n51-53.\nSolomon, S.C., 20 colleagues 2001. The MESSENGER mission to Mercury: Scientific objectives and implementation, Planet. Space Sci. 49, 1445-1465.\nSpohn, T. and Schubert, G. 2003 Oceans in the icy Galilean satellites of Jupiter? Icarus\n161, 456-467.\nSpohn, T., Sohl, F., Wieczerkowski, K. and Conzelmann, V. 2001 The interior structure\nof Mercury: What we know, what we expect from BepiColombo, Planet. Space Sci. 49,\n1561-1570.\nVan Hoolst, T., Jacobs, C. 2003 Mercury's tides and interior structure, J. Geophys. Res.\n108, 7-(1-16).\nWard, W.M. 1975. Tidal friction and generalized Cassini's laws in the solar system, Astron.\nJ. 80, 64-70.\nWijs, G.A. de, Kresse, G., Voc̃adlo, L., Dobson, D., Alfè, D., Gillan, M.J., Price, G.D.\n1998. The viscosity of liquid iron at the physical conditions of the Earth's core, Nature 392,\n805-807.\nZuber, M.T., Smith, D.E., 1997. Remote sensing of planetary librations from gravity and\ntopography data: Mercury simulation. Lunar Planet. Sci. 28, 1637-1638.\n\n\f– 29 –\n\nFig. 1.- Geometry of Cassini state 1. The Z axis is perpendicular to the orbit plane,\nand the ascending node of the orbit on the Laplace plane and the ascending node of the\nequator on the orbit plane both coincide with the X axis, which comes out of the paper.\nThe obliquity of the Cassini state is ic .\n\n\f– 30 –\n\nFig. 2.- Coordinates for describing Mercury's precession. The XY plane is the orbit plane\nwith the X axis pointing toward the perihelion position, Ω is the longitude of the ascending\nnode of the equator plane on the orbit plane, i is the obliquity, and ψm locates the x body\naxis of minimum moment of inertia (of the mantle) relative to the ascending node. The z\naxis is the axis of maximum moment of inertia, which is also the spin axis. Spherical polar\ncoordinates rθφ locate the Sun relative to the body axes.\n\n\f– 31 –\n\nFig. 3.- Numerically determined damping of Mercury's free precession with core kinematic\nviscosity ν = 0.01 cm2 /sec and tidal factor k2 /Q0 = 0.004. mX and cX label the curves for\nthe X components of the unit vectors along the mantle and core spin axes respectively. A0\nis a small but otherwise arbitrary initial amplitude.\n\n\f– 32 –\n\nFig. 4.- Angles used in the discussion of libration in longitude. SX is directed from the\nSun to the perihelion of Mercury's orbit and MM denotes Mercury, where x is the axis of\nminimum moment of inertia.\n\n\f– 33 –\n\nFig. 5.- Forced libration of Mercury showing the deviations of the motions from pure\nharmonic form. The flat portion of dγm /dt results from the fact that the rotation is nearly\nsynchronous with the orbital motion for a range of true anomaly f on either side of the\nperihelion while the axis of minimum moment of inertia is nearly pointing to the Sun. (See\nAppendix B.)\n\n\f– 34 –\n\nFig. 6.- Numerically determined damping of Mercury's free libration in longitude with core\nkinematic viscosity ν = 0.01 cm2 /sec and tidal factor k2 /Q0 = 0.004. The high frequency\noscillations superposed on the free libration are the 88 day forced librations. (B − A)/Cm =\n3.5 × 10−4 determines the free libration period of 9.2 years. A0 is a small but otherwise\narbitrary initial amplitude.\n\n\f"}