{"id": "http://arxiv.org/abs/astro-ph/0411237v2", "guidislink": true, "updated": "2004-11-10T20:23:10Z", "updated_parsed": [2004, 11, 10, 20, 23, 10, 2, 315, 0], "published": "2004-11-09T19:06:37Z", "published_parsed": [2004, 11, 9, 19, 6, 37, 1, 314, 0], "title": "Isotropy of the early universe from CMB anisotropies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0411622%2Castro-ph%2F0411606%2Castro-ph%2F0411384%2Castro-ph%2F0411784%2Castro-ph%2F0411071%2Castro-ph%2F0411212%2Castro-ph%2F0411255%2Castro-ph%2F0411224%2Castro-ph%2F0411411%2Castro-ph%2F0411665%2Castro-ph%2F0411078%2Castro-ph%2F0411599%2Castro-ph%2F0411754%2Castro-ph%2F0411524%2Castro-ph%2F0411215%2Castro-ph%2F0411268%2Castro-ph%2F0411717%2Castro-ph%2F0411706%2Castro-ph%2F0411244%2Castro-ph%2F0411205%2Castro-ph%2F0411710%2Castro-ph%2F0411501%2Castro-ph%2F0411725%2Castro-ph%2F0411237%2Castro-ph%2F0411146%2Castro-ph%2F0411173%2Castro-ph%2F0411027%2Castro-ph%2F0411432%2Castro-ph%2F0411660%2Castro-ph%2F0411028%2Castro-ph%2F0411131%2Castro-ph%2F0411590%2Castro-ph%2F0411737%2Castro-ph%2F0411430%2Castro-ph%2F0411371%2Castro-ph%2F0411340%2Castro-ph%2F0411548%2Castro-ph%2F0411747%2Castro-ph%2F0411526%2Castro-ph%2F0411016%2Castro-ph%2F0411757%2Castro-ph%2F0411497%2Castro-ph%2F0411765%2Castro-ph%2F0411803%2Castro-ph%2F0411081%2Castro-ph%2F0411022%2Castro-ph%2F0001367%2Castro-ph%2F0001409%2Castro-ph%2F0001223%2Castro-ph%2F0001489%2Castro-ph%2F0001275%2Castro-ph%2F0001173%2Castro-ph%2F0001411%2Castro-ph%2F0001231%2Castro-ph%2F0001157%2Castro-ph%2F0001302%2Castro-ph%2F0001346%2Castro-ph%2F0001251%2Castro-ph%2F0001471%2Castro-ph%2F0001088%2Castro-ph%2F0001385%2Castro-ph%2F0001542%2Castro-ph%2F0001325%2Castro-ph%2F0001278%2Castro-ph%2F0001492%2Castro-ph%2F0001418%2Castro-ph%2F0001490%2Castro-ph%2F0001261%2Castro-ph%2F0001414%2Castro-ph%2F0001062%2Castro-ph%2F0001379%2Castro-ph%2F0001417%2Castro-ph%2F0001370%2Castro-ph%2F0001132%2Castro-ph%2F0001233%2Castro-ph%2F0001540%2Castro-ph%2F0001073%2Castro-ph%2F0001076%2Castro-ph%2F0001399%2Castro-ph%2F0001214%2Castro-ph%2F0001217%2Castro-ph%2F0001398%2Castro-ph%2F0001219%2Castro-ph%2F0001190%2Castro-ph%2F0001086%2Castro-ph%2F0001301%2Castro-ph%2F0001199%2Castro-ph%2F0001096%2Castro-ph%2F0001227%2Castro-ph%2F0001372%2Castro-ph%2F0001391%2Castro-ph%2F0001407%2Castro-ph%2F0001030%2Castro-ph%2F0001252%2Castro-ph%2F0001147%2Castro-ph%2F0001427%2Castro-ph%2F0001269%2Castro-ph%2F0001053%2Castro-ph%2F0001118%2Castro-ph%2F0001363%2Castro-ph%2F0001528&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Isotropy of the early universe from CMB anisotropies"}, "summary": "The acoustic peak in the CMB power spectrum is sensitive to causal processes\nand cosmological parameters in the early universe up to the time of last\nscattering. We provide limits on correlated spatial variations of the peak\nheight and peak position and interpret these as constraints on the spatial\nvariation of the cosmological parameters (baryon density, cold dark matter\ndensity and cosmological constant as well as the amplitude and tilt of the\noriginal fluctuations). We utilize recent work of Hansen, Banday and Gorski\n(HBG) who have studied the spatial isotropy of the power spectrum as measured\nby WMAP by performing the power spectrum analysis on smaller patches of the\nsky. We find that there is no statistically significant correlated asymmetry of\nthe peak. HBG have also provided preliminary indications of a preferred\ndirection in the lower angular momentum range(~ 2-40) and we show how possible\nexplanations of this asymmetry are severely constrained by the data on the\nacoustic peak. Finally we show a possible non-gaussian feature in the data,\nassociated with a difference in the northern and southern galactic hemispheres.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0411622%2Castro-ph%2F0411606%2Castro-ph%2F0411384%2Castro-ph%2F0411784%2Castro-ph%2F0411071%2Castro-ph%2F0411212%2Castro-ph%2F0411255%2Castro-ph%2F0411224%2Castro-ph%2F0411411%2Castro-ph%2F0411665%2Castro-ph%2F0411078%2Castro-ph%2F0411599%2Castro-ph%2F0411754%2Castro-ph%2F0411524%2Castro-ph%2F0411215%2Castro-ph%2F0411268%2Castro-ph%2F0411717%2Castro-ph%2F0411706%2Castro-ph%2F0411244%2Castro-ph%2F0411205%2Castro-ph%2F0411710%2Castro-ph%2F0411501%2Castro-ph%2F0411725%2Castro-ph%2F0411237%2Castro-ph%2F0411146%2Castro-ph%2F0411173%2Castro-ph%2F0411027%2Castro-ph%2F0411432%2Castro-ph%2F0411660%2Castro-ph%2F0411028%2Castro-ph%2F0411131%2Castro-ph%2F0411590%2Castro-ph%2F0411737%2Castro-ph%2F0411430%2Castro-ph%2F0411371%2Castro-ph%2F0411340%2Castro-ph%2F0411548%2Castro-ph%2F0411747%2Castro-ph%2F0411526%2Castro-ph%2F0411016%2Castro-ph%2F0411757%2Castro-ph%2F0411497%2Castro-ph%2F0411765%2Castro-ph%2F0411803%2Castro-ph%2F0411081%2Castro-ph%2F0411022%2Castro-ph%2F0001367%2Castro-ph%2F0001409%2Castro-ph%2F0001223%2Castro-ph%2F0001489%2Castro-ph%2F0001275%2Castro-ph%2F0001173%2Castro-ph%2F0001411%2Castro-ph%2F0001231%2Castro-ph%2F0001157%2Castro-ph%2F0001302%2Castro-ph%2F0001346%2Castro-ph%2F0001251%2Castro-ph%2F0001471%2Castro-ph%2F0001088%2Castro-ph%2F0001385%2Castro-ph%2F0001542%2Castro-ph%2F0001325%2Castro-ph%2F0001278%2Castro-ph%2F0001492%2Castro-ph%2F0001418%2Castro-ph%2F0001490%2Castro-ph%2F0001261%2Castro-ph%2F0001414%2Castro-ph%2F0001062%2Castro-ph%2F0001379%2Castro-ph%2F0001417%2Castro-ph%2F0001370%2Castro-ph%2F0001132%2Castro-ph%2F0001233%2Castro-ph%2F0001540%2Castro-ph%2F0001073%2Castro-ph%2F0001076%2Castro-ph%2F0001399%2Castro-ph%2F0001214%2Castro-ph%2F0001217%2Castro-ph%2F0001398%2Castro-ph%2F0001219%2Castro-ph%2F0001190%2Castro-ph%2F0001086%2Castro-ph%2F0001301%2Castro-ph%2F0001199%2Castro-ph%2F0001096%2Castro-ph%2F0001227%2Castro-ph%2F0001372%2Castro-ph%2F0001391%2Castro-ph%2F0001407%2Castro-ph%2F0001030%2Castro-ph%2F0001252%2Castro-ph%2F0001147%2Castro-ph%2F0001427%2Castro-ph%2F0001269%2Castro-ph%2F0001053%2Castro-ph%2F0001118%2Castro-ph%2F0001363%2Castro-ph%2F0001528&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The acoustic peak in the CMB power spectrum is sensitive to causal processes\nand cosmological parameters in the early universe up to the time of last\nscattering. We provide limits on correlated spatial variations of the peak\nheight and peak position and interpret these as constraints on the spatial\nvariation of the cosmological parameters (baryon density, cold dark matter\ndensity and cosmological constant as well as the amplitude and tilt of the\noriginal fluctuations). We utilize recent work of Hansen, Banday and Gorski\n(HBG) who have studied the spatial isotropy of the power spectrum as measured\nby WMAP by performing the power spectrum analysis on smaller patches of the\nsky. We find that there is no statistically significant correlated asymmetry of\nthe peak. HBG have also provided preliminary indications of a preferred\ndirection in the lower angular momentum range(~ 2-40) and we show how possible\nexplanations of this asymmetry are severely constrained by the data on the\nacoustic peak. Finally we show a possible non-gaussian feature in the data,\nassociated with a difference in the northern and southern galactic hemispheres."}, "authors": ["Evan P. Donoghue", "John F. Donoghue"], "author_detail": {"name": "John F. Donoghue"}, "author": "John F. Donoghue", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.71.043002", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0411237v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0411237v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 3 figures, v.2 adds an extra relevant reference and comment", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0411237v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0411237v2", "journal_reference": "Phys.Rev. D71 (2005) 043002", "doi": "10.1103/PhysRevD.71.043002", "fulltext": "arXiv:astro-ph/0411237v2 10 Nov 2004\n\nIsotropy of the early universe from CMB\nanisotropies\nEvan P. Donoghue\n\na,b\n\nand John F. Donoghuea\n\na\n\nDepartment of Physics\nUniversity of Massachusetts\nAmherst, MA 01003\nb\n\nUniversity of Notre Dame,\nNotre Dame, IN 46556\nOctober 10, 2018\n\nAbstract\nThe acoustic peak in the CMB power spectrum is sensitive to causal\nprocesses and cosmological parameters in the early universe up to the\ntime of last scattering. We provide limits on correlated spatial variations of the peak height and peak position and interpret these as constraints on the spatial variation of the cosmological parameters (baryon\ndensity, cold dark matter density and cosmological constant as well as\nthe amplitude and tilt of the original fluctuations). We utilize recent work of Hansen, Banday and Górski (HBG) who have studied\nthe spatial isotropy of the power spectrum as measured by WMAP by\nperforming the power spectrum analysis on smaller patches of the sky.\nWe find that there is no statistically significant correlated asymmetry\nof the peak. HBG have also provided preliminary indications of a preferred direction in the lower angular momentum range( l ∼ 2-40) and\nwe show how possible explanations of this asymmetry are severely constrained by the data on the acoustic peak. Finally we show a possible\nnon-gaussian feature in the data, associated with a difference in the\nnorthern and southern galactic hemispheres.\n\n1\n\n\f1\n\nIntroduction\n\nOne of the foundations of our description of the universe is the principle of\nisotropy and homogeneity - the statement that the universe is the same in\nall directions and locations. The isotropy of the universe can be explained\nby the theory of inflation, in which all of the observed universe descends\nfrom a single causally connected patch of the early universe. However, inflation also contains the ingredients for generating anisotropies on various\nscales. This is manifest most importantly in the temperature anisotropies\nof the cosmic microwave background (CMB). The temperature anisotropies\nare generated by the quantum fluctuations of a scalar field during the inflationary epoch. Other scalar fields could also have quantum fluctuations\nand these could in principle influence the distribution of matter in different\nportions of the universe. It is possible that these could leave a residual \"tilt\"\nto the universe[1].\nRecently Hansen, Banday and Górski (HBG) [2, 3, 4] have explored novel\ntests of isotropy by studying the WMAP[5]power spectrum extracted from\nthe CMB using patches in different directions of the sky. This is an important test because the CMB provides the largest lever arm for the study of\nspatial asymmetries. In fact, in the lower angular range of l ∼2-40 HBG\nfind preliminary indications (at about the 2-3 sigma level) for non-zero differences in the power spectrum in hemispheres oriented along galactic colatitude and longitude (80o , 57o ), close to the ecliptic pole. This directional\nasymmetry seems to be connected with the orientation of the quadrupole\nand octopole [6]. If this signal proves to be real, it could be an important indication of a fundamental tilt in the properties of the universe. In addition,\na lack of isotropy has been seen in tests for non-gaussian behavior. Eriksen\net al [7] and Park [8] were the first to find a difference between the northern and southern galactic hemispheres in tests for non-gaussianity, and this\nhemisphere difference has subsequently been confirmed by other measures\n[9, 10, 11, 12].\nHBG also studied the height and the location of the first acoustic peak\non different patches of the sky, finding no obvious anisotropy within the\nexpected cosmic variance. We use the HBG data to study the properties of\nthe acoustic peak in more detail. The region of the acoustic peak is special\nbecause it is sensitive to causal processes in the early universe up to the time\nof last scattering. These processes depend on the cosmological parameters\nand any gradient of the parameters would yield a specific pattern between\nthe peak height and peak position, i.e. both the height and the position\nwould change in a correlated way. These correlations could reveal a sig1\n\n\fnal of anisotropy that is not visible when looking at the height or position\nindividually. We explore the HBG data for the possible presence of these\ncorrelated variations. Interpreting the results as variations in the cosmological parameters, we provide upper bounds on their possible variation. When\nwe allow for an arbitrary correlated variation, we will find a weak correlation to a directions on the sky, but we will argue that it is not statistically\nsignificant. We also use the properties of the acoustic peak as a probe of\nthe possible physics that could produce the low l signal found by HBG. The\nisotropy of the peak is a strong constraint on the physics that could produce\nthe low l signal. If one studies only the variation of a single cosmological parameter, only a difference of the spectral tilt could explain the low-l\nanomaly while being consistent with the properties of the acoustic peak.\nFinally we describe an unusual behavior in the distribution of the properties of the acoustic peak, associated with a difference between the northern\nand southern galactic hemispheres. This may possibly be related to the\nnorth-south difference which has been found in tests for non-gaussianity.\n\n2\n\nCharacteristic patterns of individual variations\n\nThe acoustic peak is categorized by its location in l and by its height. However, these are not fully independent variables in terms of their dependence\non the cosmological parameters. If one were modify the baryon density, for\nexample, there would be a correlated variation in both the height and location of the peak. In this section we describe the nature of these correlations.\nConsider the variation of the cosmological parameters. In all cases, we\nadopt as the central value that found by the WMAP team. In addition, we\ndefine a parameter\npi − pWMAP\ni\n(1)\nǫi =\npWMAP\ni\nwhere pi is any of the cosmological parameters and the superscript WMAP\ndenotes its value measured by WMAP.\nThe dependence of the power spectrum on all the cosmological parameters can be calculated using CMBFAST[13]. Here we focus on the properties\nof the acoustic peak. It is important to use the version of CMBFAST that\ndoes not implement the COBE normalization. Otherwise, changes in the\npower at low values of l would have an extra impact on the amplitude of the\nacoustic peak by rescaling the overall power spectrum. This is especially relevant for variations of the spectral tilt and the cosmological constant, which\nappreciably modify the power at lower values of l. Taking small variations of\n2\n\n\fthe cosmological parameters with modify the location of the acoustic peak,\nlp , and the height of the peak, hp , from the values found by WMAP, called\nl0 and h0 . In each case we keep Ωtot = 1 as we vary the parameter. For\nsmall variations the changes will be linear in ǫi , so that we parameterize the\nresults by\nl p = l 0 + ai ǫ i\nhp = h0 + bi ǫi\n\n(2)\n\nThes can be combined to describe the correlation characteristic of each parameter, using\nlp − l0 = ri (hp − h0 )\n(3)\nwhere\nri =\n\nai\nbi\n\n(4)\n\nThe value of the different coefficients are given in Table 1. The correlated\nvariations in the (h, l) plane are shown in Figure 1 for the different parameters.\nparameter\na\nb\n\nBaryon\n10\n1875\n\nCDM\n0\n−2381\n\nΛ\n−22\n0\n\namplitude\n−16\n5600\n\ntilt\n37\n−5491\n\nTable 1: Parameters describing the variation of the height and location\nof the acoustic peak when one changes the energy density of baryons, the\nenergy density of cold dark matter, the value of the cosmological constant\nor the value of the spectral tilt.\n\n3\n\nMeasures of Isotropy\n\nHansen et. al. (HBG)[2] have studied the WMAP power spectrum on 34\npatches of the sky, each with an opening angle of 19o . These cover most of\nthe sky, avoiding the galactic plane where foreground contaminations could\ndistort the signal. The HBG data on the location and height of the acoustic\npeak is displayed in Fig 1. The correlation with position on the sky is given\nin Table 2. The expected spread in these values has been estimated by HBG\nthrough the variance found in 512 simulated skies with gaussian distributed\ntemperature fluctuations using the WMAP power spectrum. This yields a\nvariance in the l direction of σl = 6.5 and in the height of σh = 300.\n3\n\n\f6400\n\nSpectral Tilt\n\nBaryon\n\nCDM\n\n6200\n\n6000\n\nCll(l+1) / 2π\n\n5800\n\nΛ\n\n5600\n\n5400\n\n5200\n\n5000\n\n4800\n\n4600\n205\n\n210\n\n215\n\n220\n\n225\n\n230\n\n235\n\n240\n\nMultipole l\n\nFigure 1: The lines show the correlated variation of the height and location\nin l of the acoustic peak as one varies each of the indicated quantities. Also\nshown are the HBG data for the height and location of the peak for 34\npatches of the sky.\n\nA comparison of the average values of the position and height of the\npeak over opposite hemispheres is subject to large fluctuations as individual\npatches near the borders of the hemispheres are counted first in one hemisphere and then in the other as the orientation of the hemisphere changes\nslightly in direction. Therefore we seek a measure comparing directions that\nis not as sensitive to the border between the hemispheres. To this end we\nconsider a possible dipole asymmetry. Theoretically a dipole is often the\nleading multipole for a spatial asymmetry [1, 14, 15, 16, 17, 19, 20, 21]. A\ndipole tilt in the Universe can also be hidden beneath the overall dipole seen\nin the CMB temperature, which is usually attributed to our motion with\nrespect to the CMB, but which can also have other components[1, 15].\nConsider a reference direction given by polar angles θ, φ and let γ be\nthe angle between this reference direction and a point in the sky. For a\ngiven parameter pi , a correlated dipole variation centered on this reference\ndirection has the form\nl(θ, φ) = l0 + ai η cos γ\nh(θ, φ) = h0 + bi η cos γ\n4\n\n(5)\n\n\fwhere ai , bi are the constants determined in the previous section and η is\nthe amplitude of a possible variation.\nFor each of the cosmological parameters, we allow the reference direction\nto vary and search for a direction that gives the maximum possible dipole\nasymmetry.1 While in each case a preferred direction can be found, the\nresulting asymmetries are not statistically significant, as we discuss below.\nThe amplitude and standard deviation for each variation is shown in Table\n3. For each of the parameters, we can convert our lack of a signal into a\nbound. For the direction that maximizes the asymmetry we take the 2σ\nupper bound on the amplitude η. The results are given in Table 3.\nWe also searched for a dipole anisotropy with an arbitrary correlation\nbetween the height and the peak location. We do this by allowing the relative\nsize of ai and bi to be arbitrary. The result was an anisotropy centered on\nthe direction (θ = 107o ± 34o , φ = 30o ± 42o ) with a small amplitude that\nis nominally 1.6 standard deviations from zero and a correlation\nr=\n\na\n= −0.3 ± 2.0\nb\n\n(6)\n\nThe ratio r has a large uncertainty but favors a signal which is mostly in\nthe overall height of the amplitude. Numerically, the amplitude corresponds\nto bη = 148 ± 93, which is a signal of less than 3% and a nominal statistical likelihood of 1.6 standard deviations. Although this likelihood is of\nmarginal significance, the true significance is weaker because we have allowed an arbitrary correlation by accepting any ratio r. To demonstrate\nthis, we performed a similar search on 100 sets of simulated data, generated\nrandomly with a gaussian weight and the same standard deviations given by\nHBG. If we allow the signal to have an arbitrary value or r and an arbitrary\ndirection, we find that 85% of the simulated data sets also have a non-zero\namplitude of at least 1.6 standard deviations. We conclude that the signal\nis not statistically significant.\n\nConstraints on the possible asymmetry at low l\n\n4\n\nIn the previous section, we studied the constraints imposed by the properties of the acoustic peak. However, some of the parameters can also modify\nthe power spectrum at lower values of l. Indeed a study at lower values is\nespecially interesting because HBG have identified a potentially significant\nasymmetric signal for the values l ∼ 2 − 40, with the hemisphere oriented in\n1\n\nThese studies were performed with MINUIT.\n\n5\n\n\fthe directions (80o , 57o ) having about 20% more power than in the opposite\nhemisphere. Subsequent work by Hansen et.al. (HBBG)[3] has explored the\npossibility that this signal could be due to correlated changes in the combination of the optical depth and the initial amplitude of fluctuations, or\nalternatively in the combination of the amplitude and tilt of the initial fluctuations. In this section, we explore how the constraints from the acoustic\npeak impact on possible explanations of the asymmetry found by HBG.\nOf the cosmological parameters that we study, the ones that influence the\npower spectrum at lower values of l are the overall amplitude, the spectral\ntilt and the cosmological constant. The latter is by far the easiest to rule\nout as the source of the HBG asymmetry. A variation in the cosmological\nconstant would lead to changes at low values of l through the late time\nintegrated Sachs-Wolfe effect and also lead to changes in the acoustic peak2 .\nHowever, in order to produce a 20% change in the power spectrum at low\nl, one would require over 100% variation of the cosmological constant. Our\nconstraints given above firmly rule this out.\nThe simplest variation that would explain the HBG signal is that of the\noverall amplitude, requiring a 20% larger amplitude in one hemisphere than\nthe other. Since the whole power spectrum is proportional to this amplitude,\nthe same effect would show up at the acoustic peak. This is not seen, as is\nclear from our overall constraint of the previous section. Moreover, when\nwe study the amplitude variation centered on the HBG direction, we find\nan even tighter constraint, with a best fit amplitude of η = 0.02 ± 0.02 and\na 2σ bound of η ≤ 0.06.\nFinally a variation in the tilt of the CMB spectrum would also influence\nthe relative height of both the low and high l regions. Here we are guided by\nthe final result of HBBG in the section where they consider the possibility\nof correlated variations of both the tilt and the amplitude. Their central\nvalues are consistent with the same amplitude but a tilt that is different\nin the two hemispheres by 8%, a 2-3σ effect. We test this hypothesis by\nconsidering the properties of the acoustic peak under such variation. The\nspectral tilt has the property that it influences the power spectrum more\nstrongly at lower values of l than it does at the acoustic peak. Our studies\nwith CMBFAST reveal that a 20 ± 8% variation in the power at low values\ncan be fit with a variation of the spectral index of 0.07 ± 0.03, and that\nthis would be expected to produce a variation in the height of the acoustic\npeak of 7 ± 3%, with a corresponding change in the peak location. We\n2\n\nThe cosmological constant does not influence the causal physics up to the time of last\nscatter, but it influences the angular scale of the acoustic peak.\n\n6\n\n\fcan search for such a variation, finding a difference of 3 ± 2%, i.e. a small\nbut not statistically compelling signal. However, within the error bars, this\nobservation is compatible with the expected signal.\nWe also can consider the combined variation of both the amplitude and\nthe spectral tilt, using the information at lower values of l as well as information at the peak. Performing a simultaneous fit to both regions, we find\nconsistency for\nnN − nS\nAN\nAS\n\n= 0.083 ± 0.041\n= 1.05 ± 0.025\n\n(7)\n\nThis result is consistent with that of HBBG within the error bars.\n\n5\n\nA hint of non-gaussianity\n\nWe have found no significant signal of a correlated variation of the height\nand location of the acoustic peak. However the data does appear to contain\na more unusual asymmetry, which we discus in this section. The northern\nand southern galactic hemispheres appear to have a different variance in the\nspread of the heights and locations of the peak, with the northern hemisphere\nhaving more variation. This is visible to the eye in Fig. 2. To probe this\neffect we define a variable\ns\nhi − h0 2\nli − l0 2\n) +(\n)\n(8)\nδi = (\nσl\nσh\nThe distribution of the values of δ for the northern and southern hemispheres\nis shown in Fig. 3. It is easy to see visually that there is a significant\ndifference between the hemispheres, with the northern hemisphere appearing\nto be anomalous. We refer to this as a non-gaussian feature since at would\nimply that there is not a uniform gaussian distribution in the properties of\nthe peak.\nWe search for the direction that has the greatest non-gaussianity by\nidentifying the direction that maximizes the asymmetry\nX\nf (θ, φ) =\nδi cos γi\n(9)\ni\n\nThis search identifies θ ∼ π as the direction that maximizes the difference,\ni.e. there is an asymmetry between the northern and southern galactic\nhemispheres. The net difference corresponds to f (θ = π, φ) = −7.5.\n7\n\n\f6400\n\"Northern Hemisphere\"\n\"Southern Hemisphere\"\n6200\n\n6000\n\nCl(l+1) / 2π\n\n5800\n\n5600\n\n5400\n\n5200\n\n5000\n\n4800\n\n4600\n205\n\n210\n\n215\n\n220\n\n225\n\n230\n\n235\n\n240\n\nMultipole l\n\nFigure 2: The data points on the acoustic peak are here separated into\nthose of the northern (open circles) and southern (filled circles) galactic\nhemispheres. One can see visually that the data for the northern hemisphere\nis more widely scattered than that of the southern hemisphere.\n\nWe study the significance of this signal by simulating 256 data sets chosen\nrandomly with a gaussian weight and the standard deviations given by HBG.\nIn each case we search for the direction that maximizes the asymmetry\nf (θ, φ) and find how large the asymmetry is when centered on this direction.\nThe simulations reveal a median of f ̄(θ, φ) = −3.3 and a standard deviation\nof σf = 1.3. Consistently, we find that only one of the 256 simulated data\nsets has an asymmetry as large as is seen in the real data. We see that our\nsignal is unlikely to be purely a statistical fluctuation, with an exclusion at\nthe 3σ level.\nIf this signal is real physics, it appears as an extra random ingredient\nin the temperature fluctuations - dominantly in the northern hemisphere.\nSince it involves regions that were out of causal contact at the time of last\nscatter, it would either correspond to local foreground effects in the present\nuniverse or to physics very early in the period of inflation when these regions\nwere causally connected. While the signal that we have identified appears to\nbe statistically significant, it is not clear how it is related to other measures\nof non-gaussian behavior. The use of other measures has produced ample\nevidence for non-gaussianity in the WMAP data[7, 8, 9, 10, 11, 12, 22, 23,\n8\n\n\f7\n6\n5\n4\n3\n2\n1\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\nMore\n\nδ\nFigure 3: The distribution of the parameter δ in the northern (light) and\nsouthern hemispheres (dark). The distribution for the southern hemisphere\nis consistent with the expected gaussian distribution within statistics. As\ndescribed in the text, the distribution for the northern hemisphere appears\nmore dispersed than expected.\n\n24, 25, 26, 27, 28, 29]. Moreover, as mentioned in the introduction, for\nseveral of these signals there seems to be a correlation with the northern\nand southern hemispheres[7, 8, 9, 10, 11, 12]. For example, using a measure\nof the frequency of hills, lakes or saddles in the temperature distribution, [12]\nfound that the northern hemisphere is non-gaussian at the 2-3 sigma level,\nwhile no significant non-gaussianity was found in the southern hemisphere.\nOur signal shares this directionality, even including the possibility that it is\nthe northern hemisphere that is anomalous.\n\n6\n\nConclusion\n\nWe have studied the properties of the acoustic peak in the CMB power\nspectrum and have provided measures of isotropy for the types of correlated\nvariations of the height and location of the peak. Within the statistical\nuncertainty, no significant asymmetric signal was found.\nThe properties of the acoustic peak also constrain the possible explanations of the tentative signal of an asymmetry at low l found by HBG. If\n\n9\n\n\fone attempts to explain this by the variation of a single parameter from the\nset considered in this paper, only the variation of the spectral tilt is able\nto accommodate the constraints of the acoustic peak. This is in agreement\nwith the overall fit performed by HBBG[3].\nWe have also identified a curious difference between the data in the\nnorthern and southern hemispheres, with the northern hemisphere being\nmore widely scattered than expected from the cosmic variance.\n\nAcknowledgements\nWe would like to thank F. Hansen for helpful comments and for providing\nthe data listed in Table 2 and K. Górski for useful communication. We also\nthank K. Dutta and A. Ross for comments and advice during the course of\nthis work. This work was supported in part by the U.S. National Science\nFoundation.\n\nAcknowledgement\nReferences\n[1] M. S. Turner, \"A Tilted universe (and other remnants of the preinflationary universe),\" Phys. Rev. D 44, 3737 (1991).\n[2] F. K. Hansen, A. J. Banday and K. M. Górski, \"Testing the cosmological principle of isotropy: local power spectrum estimates of the WMAP\ndata,\" arXiv:astro-ph/0404206.\n[3] F. K. Hansen, A. Balbi, A. J. Banday and K. M. Górski, \"Cosmological\nparameters and the WMAP data revisited,\" arXiv:astro-ph/0406232.\n[4] F. K. Hansen, \"Testing the isotropy of the Cosmic Microwave Backround,\" arXiv:astro-ph/0406393.\n[5] D. N. Spergel et al. [WMAP Collaboration], \"First Year Wilkinson\nMicrowave Anisotropy Probe (WMAP) Observations: Determination\nof Cosmological Parameters,\" Astrophys. J. Suppl. 148, 175 (2003)\n[arXiv:astro-ph/0302209].\nC. L. Bennett et al., \"First Year Wilkinson Microwave Anisotropy\nProbe (WMAP) Observations: Preliminary Maps and Basic Results,\"\nAstrophys. J. Suppl. 148, 1 (2003) [arXiv:astro-ph/0302207].\n10\n\n\f[6] D. J. Schwarz, G. D. Starkman, D. Huterer and C. J. Copi, \"Is the\nlow-l microwave background cosmic?,\" arXiv:astro-ph/0403353.\n[7] H. K. Eriksen, F. K. Hansen, A. J. Banday, K. M. Górski and P. B. Lilje,\n\"Asymmetries in the CMB anisotropy field,\" Astrophys. J. 605, 14\n(2004) [arXiv:astro-ph/0307507].\n[8] C. G. Park, \"Non-Gaussian Signatures in the Temperature Fluctuation\nObserved by the WMAP,\" Mon. Not. Roy. Astron. Soc. 349, 313 (2004)\n[arXiv:astro-ph/0307469].\n[9] H. K. Eriksen, D. I. Novikov, P. B. Lilje, A. J. Banday and K. M. Górski,\n\"Testing for non-Gaussianity in the WMAP data: Minkowski functionals and the length of the skeleton,\" Astrophys. J. 612, 64 (2004)\n[arXiv:astro-ph/0401276].\n[10] H. K. Eriksen, A. J. Banday, K. M. Górski and P. B. Lilje, \"The N-point\ncorrelation functions of the first-year Wilkinson Microwave Anisotropy\nProbe sky maps,\" arXiv:astro-ph/0407271.\n[11] K. Land and J. Magueijo,\narXiv:astro-ph/0405519.\n\n\"Cubic\n\nanomalies\n\nin\n\nWMAP,\"\n\n[12] F. K. Hansen, P. Cabella, D. Marinucci and N. Vittorio, \"Asymmetries\nin the local curvature of the WMAP data,\" Astrophys. J. 607, L67\n(2004) [arXiv:astro-ph/0402396].\n[13] U. Seljak and M. Zaldarriaga, \"A Line of Sight Approach to Cosmic\nMicrowave Background Anisotropies,\" Astrophys. J. 469, 437 (1996)\n[arXiv:astro-ph/9603033] and http://www.cmbfast.org/.\n[14] P. G. Castro, M. Douspis and P. G. Ferreira, \"Scale of Homogeneity of the Universe from WMAP,\" Phys. Rev. D 68, 127301 (2003)\n[arXiv:astro-ph/0309320].\n[15] J. F. Donoghue, \"Spatial gradients in the cosmological constant,\" JHEP\n0303, 052 (2003) [arXiv:hep-ph/0101130].\n[16] T. Clifton, D. F. Mota and J. D. Barrow, \"Inhomogeneous gravity,\"\narXiv:gr-qc/0406001.\n[17] V. Boucher, J. M. Gerard, P. Vandergheynst and Y. Wiaux, \"Primordial constraint on the spatial dependence of the Newton constant,\"\narXiv:astro-ph/0407508.\n11\n\n\f[18] S. M. Carroll and E. A. Lim, \"Lorentz-violating vector fields slow the\nuniverse down,\" arXiv:hep-th/0407149.\n[19] N. Kaloper and M. Kaplinghat, \"Primeval corrections to the CMB\nanisotropies,\" Phys. Rev. D 68, 123522 (2003) [arXiv:hep-th/0307016].\n[20] H. Kurki-Suonio, P. Laguna and R. A. Matzner, \"Inhomogeneous\ninflation: Numerical evolution,\" Phys. Rev. D 48, 3611 (1993)\n[arXiv:astro-ph/9306009].\n[21] D. Langlois and T. Piran, \"Dipole anisotropy from an entropy gradient,\" Phys. Rev. D 53, 2908 (1996) [arXiv:astro-ph/9507094].\n[22] K. Land and J. Magueijo, \"Multipole invariants and non-Gaussianity,\"\narXiv:astro-ph/0407081.\n[23] D. L. Larson and B. D. Wandelt, \"The Hot and Cold Spots in the\nWMAP Data are Not Hot and Cold Enough,\" arXiv:astro-ph/0404037.\n[24] P. Vielva, E. Martinez-Gonzalez, R. B. Barreiro, J. L. Sanz and\nL. Cayon, \"Detection of non-Gaussianity in the WMAP 1-year data\nusing spherical wavelets,\" arXiv:astro-ph/0310273.\n[25] M. Cruz, E. Martinez-Gonzalez, P. Vielva and L. Cayon, \"Detection of\na non-Gaussian Spot in WMAP,\" arXiv:astro-ph/0405341.\n[26] C. J. Copi, D. Huterer and G. D. Starkman, \"Multipole Vectors–a new\nrepresentation of the CMB sky and evidence for statistical anisotropy\nor non-Gaussianity at 2 ≤ l ≤ 8,\" Phys. Rev. D 70, 043515 (2004)\n[arXiv:astro-ph/0310511].\n[27] P. Mukherjee and Y. Wang, \"Wavelets and WMAP non-Gaussianity,\"\narXiv:astro-ph/0402602.\n[28] J. D. McEwen, M. P. Hobson, A. N. Lasenby and D. J. Mortlock, \"A\n6 sigma detection of non-Gaussianity in the WMAP 1-year data using\ndirectional spherical wavelets,\" arXiv:astro-ph/0406604.\n[29] P. Cabella, M. Liguori, F. K. Hansen, D. Marinucci, S. Matarrese,\nL. Moscardini and N. Vittorio, \"Primordial non-Gaussianity: local curvature method and statistical significance of constraints on fN L from\nWMAP data,\" arXiv:astro-ph/0406026.\n\n12\n\n\fco − latitude\n0\n35\n35\n35\n35\n35\n35\n65\n65\n65\n65\n65\n65\n65\n65\n65\n65\n115\n115\n115\n115\n115\n115\n115\n115\n115\n115\n145\n145\n145\n145\n145\n145\n180\n\nlongitude\n0\n0\n60\n120\n180\n240\n300\n0\n36\n72\n108\n144\n180\n216\n252\n288\n324\n0\n36\n72\n108\n144\n180\n216\n252\n288\n324\n0\n60\n120\n180\n240\n300\n0\n\nl location\n223.3\n217.0\n215.8\n218.1\n207.5\n231.8\n232.7\n212.3\n217.9\n230.9\n224.5\n223.5\n221.5\n213.1\n217.9\n222.3\n224.6\n219.5\n222.3\n221.3\n219.5\n224.8\n216.3\n230.5\n220.8\n225.9\n219.4\n218.8\n219.3\n221.9\n216.6\n217.1\n221.4\n218.7\n\namplitude\n5551\n5235\n5515\n5909\n6211\n5231\n5758\n5957\n4640\n5410\n5099\n5506\n5888\n5506\n5986\n5927\n5335\n5633\n5415\n5510\n5615\n5804\n5693\n5627\n5113\n5395\n5759\n5315\n5683\n5792\n5302\n5362\n5636\n5513\n\nTable 2: HBG data on the height and location of the acoustic peak on\npatches centered on different locations on the sky. We thank the authors of\n[2] for permission to include this data.\n13\n\n\fparameter\nη fit\n2σ bound\n\nBaryon\n0.076 ± 0.048\n0.17\n\nCDM\n0.004 ± 0.11\n0.28\n\nΛ\n0.055 ± 0.035\n0.125\n\namplitude\n0.027 ± 0.017\n0.061\n\ntilt\n0.03 ± 0.02\n0.057\n\nTable 3: Isotropy bounds when interpreted as variations of the underlying\nparameters. The first row of results gives the fit value of the fractional\nvariation of each parameter, while the second row reports the 2 σ upper\nlimit on the possible variation.\n\n14\n\n\f"}