{"id": "http://arxiv.org/abs/astro-ph/0310701v1", "guidislink": true, "updated": "2003-10-24T09:34:26Z", "updated_parsed": [2003, 10, 24, 9, 34, 26, 4, 297, 0], "published": "2003-10-24T09:34:26Z", "published_parsed": [2003, 10, 24, 9, 34, 26, 4, 297, 0], "title": "Complex X-ray spectral behaviour of NGC 4051 in the low flux state", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0310126%2Castro-ph%2F0310223%2Castro-ph%2F0310767%2Castro-ph%2F0310108%2Castro-ph%2F0310373%2Castro-ph%2F0310006%2Castro-ph%2F0310534%2Castro-ph%2F0310280%2Castro-ph%2F0310383%2Castro-ph%2F0310669%2Castro-ph%2F0310580%2Castro-ph%2F0310073%2Castro-ph%2F0310256%2Castro-ph%2F0310871%2Castro-ph%2F0310269%2Castro-ph%2F0310873%2Castro-ph%2F0310056%2Castro-ph%2F0310162%2Castro-ph%2F0310166%2Castro-ph%2F0310618%2Castro-ph%2F0310782%2Castro-ph%2F0310914%2Castro-ph%2F0310595%2Castro-ph%2F0310885%2Castro-ph%2F0310868%2Castro-ph%2F0310045%2Castro-ph%2F0310389%2Castro-ph%2F0310176%2Castro-ph%2F0310150%2Castro-ph%2F0310570%2Castro-ph%2F0310345%2Castro-ph%2F0310813%2Castro-ph%2F0310597%2Castro-ph%2F0310891%2Castro-ph%2F0310276%2Castro-ph%2F0310833%2Castro-ph%2F0310079%2Castro-ph%2F0310132%2Castro-ph%2F0310603%2Castro-ph%2F0310248%2Castro-ph%2F0310906%2Castro-ph%2F0310021%2Castro-ph%2F0310492%2Castro-ph%2F0310246%2Castro-ph%2F0310052%2Castro-ph%2F0310719%2Castro-ph%2F0310064%2Castro-ph%2F0310133%2Castro-ph%2F0310591%2Castro-ph%2F0310842%2Castro-ph%2F0310608%2Castro-ph%2F0310379%2Castro-ph%2F0310393%2Castro-ph%2F0310749%2Castro-ph%2F0310686%2Castro-ph%2F0310896%2Castro-ph%2F0310311%2Castro-ph%2F0310460%2Castro-ph%2F0310275%2Castro-ph%2F0310130%2Castro-ph%2F0310916%2Castro-ph%2F0310803%2Castro-ph%2F0310017%2Castro-ph%2F0310475%2Castro-ph%2F0310455%2Castro-ph%2F0310339%2Castro-ph%2F0310876%2Castro-ph%2F0310142%2Castro-ph%2F0310606%2Castro-ph%2F0310179%2Castro-ph%2F0310529%2Castro-ph%2F0310404%2Castro-ph%2F0310816%2Castro-ph%2F0310894%2Castro-ph%2F0310253%2Castro-ph%2F0310701%2Castro-ph%2F0310836%2Castro-ph%2F0310125%2Castro-ph%2F0310152%2Castro-ph%2F0310895%2Castro-ph%2F0310417%2Castro-ph%2F0310037%2Castro-ph%2F0310525%2Castro-ph%2F0310423%2Castro-ph%2F0310025%2Castro-ph%2F0310128%2Castro-ph%2F0310569%2Castro-ph%2F0310468%2Castro-ph%2F0310742%2Castro-ph%2F0310560%2Castro-ph%2F0310059%2Castro-ph%2F0310438%2Castro-ph%2F0310193%2Castro-ph%2F0310298%2Castro-ph%2F0310155%2Castro-ph%2F0310104%2Castro-ph%2F0310502%2Castro-ph%2F0310652%2Castro-ph%2F0310181%2Castro-ph%2F0310080%2Castro-ph%2F0310648&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Complex X-ray spectral behaviour of NGC 4051 in the low flux state"}, "summary": "The Narrow Line Seyfert 1 galaxy NGC 4051 was observed in one of its\nprolonged low-lux states by XMM-Newton in November 2002. Here we present the\nresults of an analysis of EPIC-pn data obtained during the observation. Within\nthe low state, the source shows complex spectral variability which cannot\neasily be explained by any simple model. However, by making a `flux-flux' plot\nwhich combines the low state data with data obtained during a normal flux\nstate, we demonstrate that the extremely hard spectrum observed above 2 keV\nresults from a continuation of the spectral variability seen in the normal\nstate, which is caused by spectral pivoting of the power-law continuum. The\npivoting power-law appears to be attached to a Comptonised thermal component of\nvariable flux (blackbody temperature kT~0.1 keV, consistent with the small\nblack hole mass in NGC 4051) which dominates the soft X-ray band in the low\nstate, and is probably the source of seed photons for Comptonisation.\nAdditional constant thermal and reflection components, together with absorption\nby ionised gas, seem to be required to complete the picture and explain the\ncomplex X-ray spectral variability seen in the low state of NGC 4051.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0310126%2Castro-ph%2F0310223%2Castro-ph%2F0310767%2Castro-ph%2F0310108%2Castro-ph%2F0310373%2Castro-ph%2F0310006%2Castro-ph%2F0310534%2Castro-ph%2F0310280%2Castro-ph%2F0310383%2Castro-ph%2F0310669%2Castro-ph%2F0310580%2Castro-ph%2F0310073%2Castro-ph%2F0310256%2Castro-ph%2F0310871%2Castro-ph%2F0310269%2Castro-ph%2F0310873%2Castro-ph%2F0310056%2Castro-ph%2F0310162%2Castro-ph%2F0310166%2Castro-ph%2F0310618%2Castro-ph%2F0310782%2Castro-ph%2F0310914%2Castro-ph%2F0310595%2Castro-ph%2F0310885%2Castro-ph%2F0310868%2Castro-ph%2F0310045%2Castro-ph%2F0310389%2Castro-ph%2F0310176%2Castro-ph%2F0310150%2Castro-ph%2F0310570%2Castro-ph%2F0310345%2Castro-ph%2F0310813%2Castro-ph%2F0310597%2Castro-ph%2F0310891%2Castro-ph%2F0310276%2Castro-ph%2F0310833%2Castro-ph%2F0310079%2Castro-ph%2F0310132%2Castro-ph%2F0310603%2Castro-ph%2F0310248%2Castro-ph%2F0310906%2Castro-ph%2F0310021%2Castro-ph%2F0310492%2Castro-ph%2F0310246%2Castro-ph%2F0310052%2Castro-ph%2F0310719%2Castro-ph%2F0310064%2Castro-ph%2F0310133%2Castro-ph%2F0310591%2Castro-ph%2F0310842%2Castro-ph%2F0310608%2Castro-ph%2F0310379%2Castro-ph%2F0310393%2Castro-ph%2F0310749%2Castro-ph%2F0310686%2Castro-ph%2F0310896%2Castro-ph%2F0310311%2Castro-ph%2F0310460%2Castro-ph%2F0310275%2Castro-ph%2F0310130%2Castro-ph%2F0310916%2Castro-ph%2F0310803%2Castro-ph%2F0310017%2Castro-ph%2F0310475%2Castro-ph%2F0310455%2Castro-ph%2F0310339%2Castro-ph%2F0310876%2Castro-ph%2F0310142%2Castro-ph%2F0310606%2Castro-ph%2F0310179%2Castro-ph%2F0310529%2Castro-ph%2F0310404%2Castro-ph%2F0310816%2Castro-ph%2F0310894%2Castro-ph%2F0310253%2Castro-ph%2F0310701%2Castro-ph%2F0310836%2Castro-ph%2F0310125%2Castro-ph%2F0310152%2Castro-ph%2F0310895%2Castro-ph%2F0310417%2Castro-ph%2F0310037%2Castro-ph%2F0310525%2Castro-ph%2F0310423%2Castro-ph%2F0310025%2Castro-ph%2F0310128%2Castro-ph%2F0310569%2Castro-ph%2F0310468%2Castro-ph%2F0310742%2Castro-ph%2F0310560%2Castro-ph%2F0310059%2Castro-ph%2F0310438%2Castro-ph%2F0310193%2Castro-ph%2F0310298%2Castro-ph%2F0310155%2Castro-ph%2F0310104%2Castro-ph%2F0310502%2Castro-ph%2F0310652%2Castro-ph%2F0310181%2Castro-ph%2F0310080%2Castro-ph%2F0310648&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Narrow Line Seyfert 1 galaxy NGC 4051 was observed in one of its\nprolonged low-lux states by XMM-Newton in November 2002. Here we present the\nresults of an analysis of EPIC-pn data obtained during the observation. Within\nthe low state, the source shows complex spectral variability which cannot\neasily be explained by any simple model. However, by making a `flux-flux' plot\nwhich combines the low state data with data obtained during a normal flux\nstate, we demonstrate that the extremely hard spectrum observed above 2 keV\nresults from a continuation of the spectral variability seen in the normal\nstate, which is caused by spectral pivoting of the power-law continuum. The\npivoting power-law appears to be attached to a Comptonised thermal component of\nvariable flux (blackbody temperature kT~0.1 keV, consistent with the small\nblack hole mass in NGC 4051) which dominates the soft X-ray band in the low\nstate, and is probably the source of seed photons for Comptonisation.\nAdditional constant thermal and reflection components, together with absorption\nby ionised gas, seem to be required to complete the picture and explain the\ncomplex X-ray spectral variability seen in the low state of NGC 4051."}, "authors": ["P. Uttley", "R. D. Taylor", "I. M. McHardy", "M. J. Page", "K. O. Mason", "G. Lamer", "A. Fruscione"], "author_detail": {"name": "A. Fruscione"}, "author": "A. Fruscione", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2004.07321.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0310701v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0310701v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in MNRAS. 13 pages, 10 figs. A higher\n  resolution eps version of Fig. 8 is included in the source files", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0310701v1", "affiliation": "SAO/CfA", "arxiv_url": "http://arxiv.org/abs/astro-ph/0310701v1", "journal_reference": "Mon.Not.Roy.Astron.Soc. 347 (2004) 1345", "doi": "10.1111/j.1365-2966.2004.07321.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 000–000 (0000)\n\nPrinted 15 September 2018\n\n(MN LATEX style file v1.4)\n\nComplex X-ray spectral behaviour of NGC 4051 in the low\nflux state\nP. Uttley1⋆ , R. D. Taylor1, I. M. Mc Hardy1, M. J. Page2, K. O. Mason2,\nG. Lamer3 and A. Fruscione4\n1 School\n\nof Physics and Astronomy, University of Southampton, Southampton SO17 1BJ\nSpace Science Laboratory, University College London, Holmbury St Mary, Dorking RH5 6NT\n3 Astrophysikalisches Institut Potsdam, An der Sternwarte 16, D-14482 Potsdam, Germany\n4 Harvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138, USA\n\narXiv:astro-ph/0310701v1 24 Oct 2003\n\n2 Mullard\n\nAccepted 2003 October 23. Received 2003 September 23\n\nABSTRACT\n\nThe Narrow Line Seyfert 1 galaxy NGC 4051 was observed in one of its prolonged\nlow-lux states by XMM-Newton in November 2002. Here we present the results of an\nanalysis of EPIC-pn data obtained during the observation. Within the low state, the\nsource shows complex spectral variability which cannot easily be explained by any simple model. However, by making a 'flux-flux' plot which combines the low state data\nwith data obtained during a normal flux state, we demonstrate that the extremely\nhard spectrum observed above 2 keV results from a continuation of the spectral variability seen in the normal state, which is caused by spectral pivoting of the power-law\ncontinuum. The pivoting power-law appears to be attached to a Comptonised thermal\ncomponent of variable flux (blackbody temperature kT ∼ 0.1 keV, consistent with\nthe small black hole mass in NGC 4051) which dominates the soft X-ray band in the\nlow state, and is probably the source of seed photons for Comptonisation. Additional\nconstant thermal and reflection components, together with absorption by ionised gas,\nseem to be required to complete the picture and explain the complex X-ray spectral\nvariability seen in the low state of NGC 4051.\nKey words: Galaxies: individual: NGC 4051 – X-rays: galaxies – Galaxies: Seyferts\n\n1\n\nINTRODUCTION\n41\n\n−1\n\nNGC 4051 is a low luminosity (typically few 10 erg s )\nNarrow Line Seyfert 1 (NLS 1) AGN which shows extreme\nX-ray flux variability and associated strong spectral variability (e.g. Guainazzi et al. 1996,Lamer et al. 2003), on both\nlong and short time-scales. In particular, the source shows\nunusual low flux states, lasting weeks to months, during\nwhich the X-ray spectrum becomes extremely hard (photon\nindex Γ ∼ 1) above a few keV but is dominated by a much\nsofter component (Γ ∼ 3) at lower energies (Guainazzi et al.\n1998, Uttley et al. 1999). Previously, we reported results of a\nChandra CCD observation of NGC 4051 in the low flux state\n(Uttley et al. 2003, henceforth U03) which revealed that,\neven in the low state, the hard and soft components were\nsignificantly variable and correlated with one another, and\nso could not originate primarily in extended emission, such\nas reflection from a torus and extended scattering medium.\n\n⋆ E-mail: pu@astro.soton.ac.uk\nc 0000 RAS\n\nThe Chandra image also clearly ruled out any significant extended emission on ∼ 100 pc scales (confirming an earlier\nresult based on a Chandra grating observation obtained in\na normal flux state, Collinge et al. 2001). In U03 we further noted that the unusual curvature at harder energies in\nthe Chandra spectrum, when compared with a spectrum of\nthe low state obtained by the Rossi X-ray Timing Explorer\n(RXTE), was consistent with the presence of a very prominent gravitationally redshifted diskline, suggesting that the\nreflection features from close to a black hole may remain\nconstant in flux in NGC 4051 despite large changes in the\ncontinuum flux, as appears also to be the case in MCG–630-15 (Fabian & Vaughan 2003,Taylor et al. 2003).\nIn U03 we suggested that the unusual spectral shape of\nthe low state was simply a continuation to low fluxes of the\nnormal spectral variability, i.e. with the spectrum hardening towards lower fluxes. In other words, the low flux state is\nprobably not a physically distinct state, in the sense used to\ndescribe the states of e.g. X-ray binaries, and the extreme\nlong-term X-ray spectral variability of NGC 4051 is likely\n\n\f2\n\nP. Uttley et al.\n2\n\nFigure 1. Recent 2-10 keV light curve of NGC 4051, obtained\nwith RXTE monitoring (see Lamer et al. 2003, Mc Hardy et al.\n2003 for details). The time of the XMM-Newton TOO observation\n(and the 2-10 keV flux observed by XMM-Newton) is marked by\na star.\n\nproduced by the same physical process as the short-term\nspectral variability. Using a model-independent method, the\n'flux-flux' plot, Taylor et al. (2003) find that the spectral\nvariability of NGC 4051 in the 2-15 keV band is best explained by pivoting of the power-law continuum about an\nenergy of ∼ 100 keV, in addition to a hard constant component. This result contrasts with the X-ray spectral variability of other Seyferts, which is best explained by a constant\nhard component together with a variable component which\ndoes not pivot but maintains a constant shape (Taylor et al.\n2003, Fabian & Vaughan 2003).\nObservations of NGC 4051 in the low state allow us\nto test the limits of the spectral pivoting model suggested\nby Taylor et al. (2003). In this paper, we present the results of an XMM-Newton Target of Opportunity Observation (TOO) of NGC 4051 obtained towards the end of a\nrecent low state. We first demonstrate the complex spectral\nvariability in the low state and then combine the low state\ndata with data obtained during a normal state, to make\na 'flux-flux' plot (Taylor et al., 2003) to test the pivoting\nmodel and determine whether the low state spectrum is consistent with spectral pivoting down to the lowest observed\nfluxes. We also investigate the presence of reflection features\nin the hard spectrum obtained during the low state, and\nthen combine these results with the inferences we make from\nthe flux-flux plots, to construct a simple broadband spectral\nmodel which can explain the observed spectral shape and\nvariability of NGC 4051. Using spectral fits, we demonstrate\nhow our model can explain the complex spectral variability\nobserved within the low state. We will present spectral fits of\nour model over the entire observed flux range of NGC 4051\n(i.e. including the normal state) in a future paper (Taylor et\nal., in prep.).\n\nOBSERVATION\n\nOur continuing RXTE monitoring observations showed that\nNGC 4051 entered a low state, characterised by low flux and\na small variability amplitude, for about a month in 2002\nOctober-November (Fig. 1). On detecting that the source\nwas in a low state with RXTE, we triggered a TOO observation with XMM-Newton, which observed the source on\n2002 Nov 22, towards the very end of this low state. Although the 2-10 keV X-ray flux at the time is higher than\nobserved earlier in the state, at 6 × 10−12 erg cm−2 s−1 it\nis comparable to that observed by Chandra during the 2001\nFeb low state (U03). XMM-Newton observed NGC 4051 for\n∼ 50 ks with all instruments, but due to background flaring only the central 33 ksec of data was useful. We therefore extracted EPIC-pn data (both single and double pixel\nevents) in this useful time range from a 42 arcsec radius circle centred on the X-ray source, as well as a source-free box\noutside the source region on the same chip for background\nsubtraction. The EPIC instruments were operated using the\nMedium filter and the EPIC-pn was operated in Large Window Mode throughout the observation, and due to the faint\nnature of the source pileup effects are negligible. We do not\nuse EPIC-MOS data in this analysis, in order that we may\ndirectly compare the EPIC-pn data obtained during the low\nstate with that obtained during a normal state at an earlier epoch before the recent change in EPIC-MOS response.\nThe EPIC-pn and EPIC-MOS cross-calibration shows systematic discrepancies (up to 10%) between the instruments\nbelow 1 keV, so that it is unclear which gives the best representation of the spectral shape at these low energies. We\nnote however that as a consistency check we have also carried on the EPIC-MOS data the same spectral fits carried\nout on EPIC-pn data in Section 5, and the results of these\nfits do not change the basic conclusions we present here (i.e.\nthe same model is found to apply although specific model\nparameters change slightly). A detailed analysis of the RGS\nspectrum of NGC 4051, obtained during the XMM-Newton\nobservation of the low state is presented in a separate paper\n(Page et al., in prep.).\n\n3\n\nLIGHTCURVES AND BROADBAND\nSPECTRA\n\nIn Fig. 2 we show the background-subtracted EPIC-pn light\ncurves of NGC 4051 in two energy bands (0.1-0.5 keV, which\nwe shall call soft and 2-10 keV, which we shall call hard). We\nalso show the varying softness ratio (soft/hard) of the two\nbands. The source shows clear flux variability and interesting spectral variability during the low state. In particular,\nduring the large 'flare' early in the observation, the softness\nratio does not change substantially, and similar behavior can\nbe seen during a second weaker flare at ∼ 22 ks. However,\ntowards the end of the observation (after ∼ 26 ks), when\nthe source is fainter in both bands the source softens, as the\nhard flux decreases substantially while the soft flux barely\nchanges. The source also hardens slightly in reponse to small\nhard 'flares' in the period between the two larger flares. In\norder to investigate the spectral variability in more detail, we\nplot in Fig. 3 the unfolded (relative to a simple power-law)\nEPIC-pn spectra corresponding to the epochs delineated in\nc 0000 RAS, MNRAS 000, 000–000\n\n\fNGC 4051 in the low flux state\n\n3\n\nFigure 2. Soft and hard 500 s resolution light curves of NGC 4051, together with the softness ratio between the two bands. Dotted lines\ndenote the low, medium and both high flux epochs used to examine spectral variability in more detail.\n\nFig. 2, which correspond to three of the four distinct periods\ndiscussed above, and which we refer to as high1, medium,\nand low flux spectra. For clarity, we do not plot the high2\nspectrum, which is somewhat intermediate in shape between\nthe high1 and medium flux epoch spectra. The spectra have\nbeen unfolded through the instrument response with respect\nto a simple power-law (Γ = 2) absorbed by Galactic neutral\nabsorption (NH = 1.3×1021 cm−2 , Elvis, Lockman & Wilkes\n1989). As noted in U03, although unfolded X-ray spectra are\nalways model-dependent, in the case of relatively high resolution CCD instruments such as the EPIC-pn, only sharp\nfeatures such as edges are significantly misrepresented, while\nthe general continuum shape is fairly well represented by the\nunfolded spectra. It can be seen immediately that the high\nflux epoch corresponds to an increase in the soft flux, below\n∼ 0.7 keV, with little difference in the soft spectral shape\nbetween low, medium and high flux epochs at those low\nenergies. Above ∼ 2 keV, the spectral shape varies significantly. Interestingly, in all epochs there is little change in\nthe continuum around ∼ 1 keV.\nClearly the spectral variability cannot be explained by\nany simple spectral model. For example, the constancy in\nflux around 1 keV might suggest some kind of pivot point\naround that energy, however the soft spectral shape at lower\nenergies appears to be constant and is inconsistent with any\nlow energy pivot. Also, the high and medium flux epoch\nspectra appear to converge above 5 keV, despite both spectra showing quite different soft normalisations. In order to\nclarify the nature of the spectral variability, and place it into\ncontext with the spectral variability seen at higher fluxes, we\nnow apply the flux-flux plot method to the data.\nc 0000 RAS, MNRAS 000, 000–000\n\n4\n\nFLUX-FLUX PLOTS\n\nTaylor et al. (2003) used a simple, model-independent technique, the 'flux-flux' plot, to examine the nature of the X-ray\nspectral variability of Seyfert galaxies. Specifically, by plotting the flux in a hard band versus flux in a soft band, a\nlinear relationship reveals that the data are consistent with\na simple two-component model, where one component varies\nin flux but not in spectral shape, while the other component\nremains constant in spectral shape and flux (see also Fabian\n& Vaughan 2003, Shih et al. 2002). The spectral variability\nis then produced by a change in the relative normalisations\nof the two components, with hardening at low fluxes corresponding to a soft component varying in normalisation\nwith respect to a constant (or at most weakly-varying) hard\ncomponent. On the other hand, a power-law flux-flux relationship implies spectral pivoting of the varying component\n(so that the spectral variability is intrinsic to the varying\ncontinuum).\nIn order to examine the form of the continuum spectral variability of NGC 4051, and test whether the low state\nspectrum is consistent with that expected from the spectral\nvariability seen at higher fluxes, we can produce a combined\nflux-flux plot of EPIC-pn fluxes obtained during the low\nstate TOO observation and an earlier (2001 May) ∼ 100 ksec\nXMM-Newton observation of NGC 4051, obtained during\nits normal, higher flux state. The normal-state data is described in more detail in Mason et al. (2002), Mc Hardy et\nal. (2003) and see also Salvi (2003) and Salvi et al. (in prep.)\nfor an alternative spectral analysis of this data. For both low\nand normal states, we obtained 500 s resolution light curves\n\n\f4\n\nP. Uttley et al.\n\nFigure 3. Unfolded broadband spectra (see Section 3 for details) obtained during high1 (black line), medium (thick light grey line)\nand low (dark grey line) flux epochs within the low state. The spectra are plotted in units of energy×flux-density, so that a flat slope\ncorresponds to a photon index Γ = 1. For clarity the spectra have been plotted as histograms and error bars omitted. The spectra have\nbeen unfolded with respect to a simple power-law absorbed by Galactic absorption (see text for details).\n\nFigure 4. Left panel: Unbinned HS flux-flux relation. Low state data is plotted with filled markers, normal state data with lighter,\nopen markers. For clarity only the 0-20 count/s soft flux range is plotted, although all data (extending to 45 count/s) is included to\nproduced the binned relation (right panel). Right panel: Binned HS flux-flux relation. The dotted line shows the best-fitting power-law\nplus constants model described in the text.\n\nc 0000 RAS, MNRAS 000, 000–000\n\n\fNGC 4051 in the low flux state\nin the 0.1-0.5 keV soft and 2-10 keV hard bands (see Section 3), as well as an additional 0.8-1.2 keV medium band.\nSince the normal state EPIC-pn observation was obtained\nin Small Window Mode, we renormalised the count rates\nin both sets of light curves by livetime fraction, to account\nfor the different readout times used in the two observations.\nWe plot the resulting hard vs. soft (HS) and medium vs. soft\n(MS) flux-flux plots in Fig. 4 and Fig. 5 respectively.\n4.1\n\nWe first examine the unbinned HS flux-flux relation (left\npanel in Fig. 4). We note two main points. First, the overall\ndistribution of points clearly does not follow a linear relationship. Second, the distribution of low state data seems to\njoin smoothly on to the distribution of normal state data:\nthe normal state distribution bends towards low fluxes and\nthis bending continues in the low state data. Hence we conclude that the same process which causes the spectral variability in the normal state continues to even lower fluxes\nin the low state. There is significant intrinsic scatter in the\nrelation (which was also observed in the flux-flux relations\nplotted by Taylor et al. 2003), which implies that there is\nalso spectral variability which is not correlated with flux\nvariations. Note that this scatter increases towards higher\nfluxes (see Appendix A). To remove the scatter and so find\nthe functional form of the HS flux-flux relation, we followed\nthe method of Taylor et al. (2003) and binned the data into\n15 flux bins (minimum of 10 data points per bin), which in\nthis case are logarithmically spaced in order to maximise the\nusefulness of the low state data to constrain the flux-flux relation (error bars are standard errors determined using the\nspread of data points in each bin). We use a general powerlaw plus constants model (Taylor et al. 2003) to describe the\nrelationship of binned hard (Fh ) and soft (Fs ) fluxes:\nFh = k(Fs − Cs )α + Ch\n\n(1)\n\nWe find a good fit to the data (χ2 = 10.8 for 11 d.o.f.) for\na power-law index α = 0.57±0.07\n0.04 with constant offsets on\n0.3\nthe hard and soft axes of Ch = 0.1±0.25\n0.1 and Cs = 1.62±0.07\n†\nrespectively . The binned HS flux-flux plot and best-fitting\npower-law plus constants model are plotted in the right\npanel of Figure 4. To demonstrate that this pivoting model\nis not simply a result of the low-state and normal states\nfollowing different, linear relations, we also made and fitted a binned HS flux-flux relation for the normal state data\nonly (i.e. excluding the data points from the low state TOO\nobservation). A linear plus constants model fit to the normal state HS flux-flux relation is a very poor fit (χ2 = 44\nfor 11 d.o.f.), while a much better fit is obtained with the\npower-law plus constants model (χ2 = 12 for 9 d.o.f.), for\npower-law index α = 0.63, consistent with our interpretation\nthat the hard spectral shape in the low state is a continuation of the spectral variability process seen at higher fluxes.\nUsing xspec simulations we find that the 90% confidence range of indices α corresponds to a pivoting model\nwith a pivot energy between 75-300 keV, consistent with the\n† Unless otherwise noted, all errors quoted in this paper represent\n90% confidence limits for one interesting parameter, i.e. ∆χ2 =\n2.71.\nc 0000 RAS, MNRAS 000, 000–000\n\nestimate of 100 keV obtained from the RXTE data (Taylor\net al., 2003)‡ . The positive offset on the soft axis of the\npresent flux-flux plot (which uses a lower soft energy band\nthan the 2-5 keV band used by Taylor et al.) implies a significant constant soft component which counteracts the effect\nof the hard constant component detected at higher energies\n(Taylor et al., 2003) to produce an offset on the soft axis.\n\n4.2\n\nHard vs. soft flux-flux relation\n\n5\n\nMedium vs. soft flux-flux relation\n\nWe now consider the unbinned MS flux-flux relation (left\npanel in Fig. 5, and see right panel for the binned up relation). The relation appears close to linear during the normal state but seems to flatten off in the low state (corresponding to the weak variability in the medium band seen\nin Fig. 3). Binning up and fitting only the normal state data\n(i.e. the nearly linear portion of the plot) with Equation 1\nused above, we obtain a good fit (χ2 = 5.9 for 9 d.o.f.) for\nan index α = 0.97 ± 0.06. Simulations show that if we assume the 75-300 keV range of acceptable pivot energies implied by the fit to the HS flux-flux relation, the slope of the\nMS relation should be 0.78-0.82. Therefore it is likely that\nsome other varying component (in addition to the pivoting\npower-law), is present in both the medium and soft bands,\nin order to wash out the effect of pivoting between the two\nbands. The simplest possibility, implied by the apparent lack\nof spectral-shape variability below 0.7 keV (Fig. 3) is that\nthis component has a constant spectral shape. The shape of\nthe soft excess flattens towards low energies, which suggests\nthat the additional soft spectral component in NGC 4051 is\nthermal, rather than a power-law (Collinge et al. 2001, U03),\nso one possible configuration is that the pivoting power-law\nis attached to a variable soft thermal component of constant\nshape (although note that Ogle et al. 2003, and Salvi et al.,\nin prep., explain this flattening in the soft excess by invoking\nan extreme relativistic Oviii diskline in addition to a steep\npower-law continuum). One might then ask why the MS\nflux-flux relation flattens at low fluxes. As discussed by Taylor et al. (2003), the gradient of a flux-flux plot for a variable\nspectral component with a constant spectral shape is equivalent to the hardness ratio of that component. Therefore the\nflattening of the flux-flux plot at low fluxes can be caused\nby a strong softening of the varying spectral component in\nthe energy range covered by the plot. Such an effect could\nbe caused if the variable component of emission is largely\nremoved by absorption in the 0.8-1.2 keV band, but not in\n0.1-0.5 keV (e.g. if the absorber is ionised). This possibility\nis consistent with the spectra in Fig. 3: the high flux spectrum appears to converge with the lower flux spectra above\n∼ 0.7 keV, an effect which could be caused by absorption,\nif the expected edges (e.g. due to Ovii) are partly filled in\nby a constant, unabsorbed soft continuum component. The\nfact that the spectral shape below 0.5 keV appears not to\nvary with flux (see Fig. 3) suggests that the constant and\n\n‡ We point out here that the value of pivot energy of 300 keV\nquoted by us in Taylor et al . (2003) is a typographical error. A\n100 keV pivot energy is in fact a better match to the observed\nflux-flux relation slope, as can be seen from Fig. 1 in Taylor et al.\n2003\n\n\f6\n\nP. Uttley et al.\n\nFigure 5. Left panel: Unbinned MS flux-flux relation. Low state data is plotted with filled markers, normal state data with lighter,\nopen markers. For clarity only the 0-20 count/s soft flux range is plotted, although all data (extending to 45 count/s) is included to\nproduced the binned relation (right panel). Right panel: Binned MS flux-flux relation. The dotted line shows the best-fitting power-law\nplus constants model which fits the normal state data (see text for details).\n\n5.1\n\nFigure 6. Ratio of 3-12 keV EPIC-pn data to a simple power-law\nfitted over that range but excluding data over 4-9 keV.\n\nvariable soft components have a similar spectral shape, at\nleast at low energies.\n\n5\n\nHard spectrum\n\nIn Fig. 6 we plot the ratio of the 3-12 keV spectrum to\na simple power-law model, which is fitted only over the 34 keV and 9-12 keV ranges (i.e. excluding the region where\nsignificant emission features may be expected). Clear broad\nresiduals can be seen, in addition to a narrow iron emission line observed at ∼ 6.4 keV. Consequently, a powerlaw plus narrow, unresolved Gaussian fitted to the data is a\nvery poor fit (reduced chi-squared, χ2ν = 1.94 for 120 d.o.f.).\nWe find that adding a pexrav reflection component§ to the\nmodel improves the fit substantially (R = 2.4±0.5\n0.7 ), and an\nedge at 7.9 ± 0.15 keV (optical depth τ = 0.5±0.25\n0.15 ) is also\nformally required (resulting χ2ν = 0.91 for 117 d.o.f). The\nobserved edge energy corresponds to the K-shell photoionisation edge expected from Fexvii. Removing the edge and\nincluding a Laor diskline (as suggested by the spectral modelling of U03), worsens the fit (∆χ2 = +13 for one less degree of freedom). Adding the 7.9 keV edge in addition to\nthe diskline does not improve on the reflection+edge fit significantly (∆χ2 = −3 for three fewer degrees of freedom).\nWorse fits are obtained in each case by including a diskline\nfrom a non-rotating black hole. Therefore we conclude that\na diskline is not formally required to fit the low state spectrum, and so for the purposes of our broadband spectral\n\nSPECTRAL MODELLING\n\nWe now apply the physical interpretation of the spectral\nvariability of NGC 4051 inferred from the flux-flux plots\nto construct a broadband model which can fit the fluxdependent spectra shown in Fig. 3. First however, to complete our picture of the appropriate spectral components for\nour broadband spectral fit, we examine the spectrum (obtained over the entire useful exposure) in the 3-12 keV band.\n\n§ Similar to the procedure in U03, apart from reflection scaling factor R, which is free, reflection model parameters are fixed\nto those corresponding to the values from the best-fitting pure\nreflection model used in Uttley et al. (1999), i.e. cut-off energy\n100 keV, inclination angle 30◦ , fixed illuminating power-law photon index Γ = 2.3 and normalisation at 1 keV A = 0.01 photon cm−2 s−1 keV−1 . Leaving these parameters free does not\nimprove the fit significantly.\nc 0000 RAS, MNRAS 000, 000–000\n\n\fNGC 4051 in the low flux state\nfit we will use the simple reflection plus edge model to account for the broad residuals in the hard spectrum. Note\nhowever that we regard this model for the hard spectral\nshape as a phenomenological and not necessarily a physically motivated representation of the hard spectrum (see the\nDiscussion for further details of the model interpretation).\nThe narrow iron line (EFe = 6.42 ± 0.01 keV) contributes a\nflux of (1.3 ± 0.2) × 10−5 photon cm−2 s−1 , consistent with\nthe flux observed by Chandra in 2000 April (Collinge et al.,\n2001) and 2001 February (U03). It is likely that this line is\nconstant and originates some distance from the continuum\nsource, as implied by the narrow velocity width observed by\nthe Chandra HETG (Collinge et al., 2001).\n\n5.2\n\nThe model\n\nWe now apply the information gained from the flux-flux\nplots, together with the model for hard spectral features, to\nconstruct our broadband spectral model. Our xspec model\nis: phabs × (zedge × zedge × zedge × (pegpwrlw +\npexrav + compbb) + compbb + zgauss + zgauss +\nzgauss + zgauss + zgauss + zgauss). Note that although\nthe model appears to be complicated, many of the model\nparameters are fixed (for example, all the Gaussian line parameters). Furthermore, the same model is used to simultaneously fit the spectra from all four flux epochs within the\nlow state, with only a small subset of parameters left free\nto vary between the spectra, and most parameters forced to\nfind the same best fitting value for all four spectra (see descriptions below). We now describe the model components,\nand the rationale for including them:\n(i) Galactic neutral absorption (NH fixed at 1.31 ×\n1020 cm−2 , Elvis, Lockman & Wilkes 1989) and edges fixed\n(in the source rest frame, z = 0.0023) at 0.74 keV (Ovii),\n0.87 keV (Oviii) and 7.9 keV (probable Fexvii). The 7.9\nkeV edge is required by the fit to the hard spectrum and we\ninclude the two oxygen edges (which are also suggested by\nCollinge et al. (2001), to fit a Chandra grating observation of\nNGC 4051 at higher fluxes), to represent (in simple terms)\nthe ionised absorber which may be required to explain the\nshape of the MS flux-flux relation at low fluxes. The optical\ndepths of the edges are free, but forced to be identical between spectra. Note that other absorption features, such as\nthe unresolved transition array (UTA) of Fe (Page et al. in\nprep.) may also contribute significantly to absorption above\n∼ 0.7 keV, but for simplicity we only model absorption in\nterms of the O edges.\n(ii) A pivoting power-law (xspec model pegpwrlw),\nwith pivot energy fixed to 100 keV and normalisation at\nthe pivot energy fixed to 0.078 μJy (determined from the\nRXTE flux-flux plot, Taylor et al. 2003). This component\nis required to simply explain the shape of the HS flux-flux\nplot, and the flux-flux relation at higher energies reported\nby Taylor et al. (2003).\n(iii) A reflection component (pexrav) with parameters\nfixed to those used in Section 5.1 and normalisation fixed\nto be the same in all fitted spectra (i.e. to approximate the\nconstant hard component suggested by Taylor et al. 2003).\n(iv) A constant Comptonised blackbody which is unabsorbed by the oxygen edges. This component is used to represent the soft constant component which is required by the\nc 0000 RAS, MNRAS 000, 000–000\n\n7\n\nflux-flux relations. The normalisation, blackbody temperature, electron temperature and optical depth are free but\nforced to be identical between spectra. Note that a Comptonised blackbody is the best fitting model we have found\nto describe the soft component. See Section 5.3 for details\nof fits using other models to describe the soft emission.\n(v) A variable Comptonised blackbody which is absorbed\nby the oxygen edges. This component represents the variable soft component of constant shape which can explain\nthe form of the MS flux-flux relation, together with the apparent lack of spectral variability below 0.7 keV. The lack\nof spectral variability at low energies also suggests that the\nvariable soft component has a similar shape to the constant\nsoft component, so we allow the normalisation of the variable Comptonised blackbody component to be free between\nspectra while forcing the blackbody temperature, electron\ntemperature and optical depth to be the same as for the\nconstant Comptonised blackbody (component iv).\n(vi) A narrow 6.4 keV iron Kα line (unresolved Gaussian, fixed flux 1.3 × 10−5 photon cm−2 s−1 ), to represent\nthe line observed in the hard spectrum. Additional prominent soft emission lines (e.g. see Collinge et al. 2001) (as\nunresolved Gaussians), with fixed fluxes are required to represent the most prominent features observed in the RGS\nspectrum (fluxes fixed at those observed in the RGS spectrum, Page et al. in prep.): 0.739 keV Ovii RRC (1.9 ×\n10−5 photon cm−2 s−1 ), 0.725 keV Fexvii (4.1 × 10−5 photon cm−2 s−1 ), 0.654 keV Oviii Ly α (7.2 × 10−5 photon cm−2 s−1 ), 0.56 keV blend of Ovii x+y, z (7.2 ×\n10−5 photon cm−2 s−1 ). A number of lines are also seen\nin the RGS spectrum around 0.9 keV, including Neix and\nthe Oviii RRC, however these lines alone do not replicate\na broad bump in the spectrum around 0.9 keV, which may\npossibly be a blend of iron emission or an unusual continuum shape (see Page et al., in prep.). Therefore we include\na broad Gaussian (σ = 0.05 keV, flux 1.52 × 10−4 photon cm−2 s−1 ) at 0.91 keV to crudely represent these combined features.\nThe model is fitted simultaneously to all the spectra from\nlow, medium and both high flux epochs, so that in total\nthere are 16 free parameters. To reiterate, these free parameters are the optical depths of the three edges (fixed to be\nidentical between spectra), the temperature, electron temperature, and optical depth of the Comptonised blackbodies\nand the normalisation of the constant Comptonised blackbody (also fixed to be identical between spectra), the normalisation (here we use the scaling factor R) of the constant\nreflection component, four different normalisations (between\nspectra) of the variable Comptonised blackbody and four\ndifferent indices (between spectra) of the pivoting powerlaw.\n\n5.3\n\nFit results\n\nThe best fitting model yields χ2ν = 1.37 for 1159 d.o.f., for\nmodel parameters which are shown in Table 1. Data/model\nratios are plotted in Fig. 7. Significant residuals still exist\n(see the Discussion for consideration of the causes of these\nresiduals), although the model can reproduce the general\nspectral shape and variability reasonably well. Note that the\napparent 'absorption trough' observed at ∼ 1.6 keV in the\n\n\f8\n\nP. Uttley et al.\n\nFigure 7. Ratio plots of the data to the best-fitting model (described in the text) to for low, medium and both high flux epochs in the\nlow state.\n\nFigure 8. Unfolded EPIC-pn spectra for low, medium and both high-flux epochs during the low state. The various model components\nare plotted with lines. Note that power-law and absorbed Comptonised blackbody components do not contribute significantly to the low\nflux epoch spectrum.\n\nc 0000 RAS, MNRAS 000, 000–000\n\n\fNGC 4051 in the low flux state\n\n9\n\nFigure 9. Unfolded model fit to the high1 spectrum. To make the contributions of the different continuum components clearer, they are\nplotted using thick lines. The absorbed and unabsorbed Comptonised blackbody components are plotted with a black dashed line and\na solid grey line respectively. The reflection component and the absorbed pivoting power-law component are plotted with a solid black\nline and a black dotted line respectively.\n\nsecond high flux epoch spectrum does not correspond to the\nprobable weak systematic feature in the detector response\nobserved at ∼ 1.8 keV in the EPIC-pn spectrum of MCG–630-15 (Fabian & Vaughan, 2003). However, since this 1.6 keV\nfeature in the EPIC-pn spectrum of NGC 4051 is not replicated in the EPIC-MOS spectra from this epoch it is likely\nto be a statistical artefact. Although the fit is not formally\nacceptable, the model appears to give a reasonable description of the overall spectral variability. To demonstrate the\neffects of the different model components on the spectral\nvariability, we plot the unfolded models and spectra for the\nlow, medium and both high flux epochs in Fig. 8. A more\ndetailed plot of the unfolded model fit to the high1 spectrum\nis also shown in Fig. 9, with the various continuum components made more distinct to allow easier interpretation. We\nnote that the model can explain the complicated spectral\nvariability reported in Section 3 as being largely due to the\nvariation of the hard and soft variable components relative\nto the constant components in the respective bands. In other\nwords, the effect of power-law pivoting dominates the overall spectral variability of the source (i.e. across the entire\nobserved flux range, as revealed in Fig. 4), but within the\nlow state where the varying continuum flux is small, spectral variability due to the presence of constant components\nis much more important. For example, the hardening in response to small flux increases occurs when the soft variable\nthermal component is very weak compared to the constant\nsoft component, so that the flux variation is primarily in the\nhard band, associated with the pivoting power-law (which\nthough weak is still significant compared with the constant\nreflection component in that band). On the other hand, a\nlarge flux increase (e.g. the flare early in the observation)\ncorresponds to the flux of the variable thermal component\nalso increasing significantly, in addition to the hard powerc 0000 RAS, MNRAS 000, 000–000\n\nlaw flux, so that the soft/hard flux ratio does not change.\nNote also that the divergence of the medium and high flux\nspectra below ∼ 5 keV is explained by the model as being due to the larger Comptonised thermal component in\nthe high flux spectrum. At the lowest fluxes the power-law\ncontribution to the EPIC-pn spectrum is negligible, i.e. the\nspectrum is probably dominated by the constant thermal\nand reflection components.\nFor completeness, we also substituted different soft\nspectral models for the constant and variable soft components used in the fit. Subsituting the Comptonised blackbody spectra with a diskpn model (Gierlinski et al., 1999)\nfor a pure disk blackbody spectrum modified by a pseudoNewtonian potential (to take account of relativistic effects),\nwe obtain a much worse fit (χ2ν = 3.1 for 1160 d.o.f.). If we\ninstead substitute simple steep power-laws, the fit is poorer\n(χ2ν = 1.52 for 1161 d.o.f., for photon index Γ ≃ 3) than obtained using Comptonised blackbodies, with the main residuals corresponding to a flattening of the observed spectrum\nbelow 0.5 keV. We conclude that, of the simple models tested\nhere the Comptonised blackbody provides the best description of the soft component spectra (although see Ogle et al.\n2003, Salvi 2003 and Salvi et al., in prep., for an alternative\ndescription invoking a relativistic Oviii diskline and a steep\npower-law).\n\n6\n\nDISCUSSION\n\nWe have demonstrated that the information gained from\nflux-flux plots can be used to infer the form of a spectral\nmodel which is relatively successful at replicating the seemingly complex X-ray spectral behaviour of NGC 4051 observed in the low state. Of course, significant residuals still\n\n\f10\n\nP. Uttley et al.\n\nTable 1. Best-fitting broadband model parameters.\nLow\n\nΓ\n-2.5\n\nAcbb\n0.0\n\nAfconst\n4.02\n\nf\nkTcbb\n0.08\n\nkTef\n18.0\n\nf\nτcbb\n1.08\n\nf\nτOvii\n1.3\n\nf\nτOviii\n0.5\n\nf\nτFe\n0.4\n\nRf\n2.4\n\nMedium\n\n1.15\n\n0.40\n\n4.02\n\n0.08\n\n18.0\n\n1.08\n\n1.3\n\n0.5\n\n0.4\n\n2.4\n\nHigh 2\n\n1.17\n\n1.68\n\n4.02\n\n0.08\n\n18.0\n\n1.08\n\n1.3\n\n0.5\n\n0.4\n\n2.4\n\nHigh 1\n\n1.35\n\n2.52\n\n4.02\n\n0.08\n\n18.0\n\n1.08\n\n1.3\n\n0.5\n\n0.4\n\n2.4\n\nΓ is the photon index of the pivoting power-law; Acbb and Aconst are the normalisations of the variable and constant Comptonised\nblackbodies respectively (units of 104 ); kTcbb , kTe and τcbb are the blackbody temperature (in keV), and Comptonising electron\ntemperature (in keV) and optical depth for the Comptonised blackbodies; τOvii , τOviii and τFe are the edge optical depths and R is the\nreflection scaling factor of the constant reflection component (see Section 6). Note that since the fit is not formally acceptable,\nmeaningful errors cannot be quoted.\nf Values forced to be the same for all four spectra.\n\nremain in our model fits, and so our model should be considered only as an approximation to the true spectral behaviour. In this section, we will discuss some of the implications of our results and describe some of the practical and\ntheoretical aspects of improving our model in relation to\nthese implications.\n\n6.1\n\nThe variable continuum components\n\nThe flux-binned 0.1-0.5 keV vs. 2-10 keV flux relation is well\nfitted by a power-law plus constant model, implying that the\nrelation between these two bands, and the bulk of the spectral variability observed in NGC 4051 (over its entire flux\nrange), is caused by the spectral pivoting of the power-law,\nalso observed in the 2-15 keV band (Taylor et al., 2003). The\npresence of a constant-shape thermal component (which we\nmodel here with a Comptonised blackbody), which dominates the continuum at low energies, suggests that the pivoting power-law must be 'attached' to the thermal component,\nthus producing the observed flux-flux relation and the good\ncorrelation observed between extreme UV and medium energy X-ray fluxes (Uttley et al., 2000). An obvious physical\nrealisation of this model is that the thermal component represents a directly observed variable source of seed-photons,\nwhich are upscattered in the corona to produce the variable\npower-law emission. In fact the observed blackbody temperature is close to the ∼ 0.1 keV temperature expected\nfrom the small black hole mass of ∼ 3 × 105 M⊙ , inferred\nfor NGC 4051 from both reverberation mapping (Shemmer et al., 2003) and the X-ray variability power spectrum\n(Mc Hardy et al., 2003). The spectrum of NGC 4051 may\nthen be unusual in this regard, since most AGN have larger\nblack hole masses and hence their disk blackbody emission\nwill not be directly observable in the soft X-ray band.\nThe fact that NGC 4051 appears to show a very strongly\nvarying thermal component indicates a highly unstable accretion disk. Recent interpretations of AGN X-ray variability in terms of fluctuations in the accretion flow (implied by\nthe observed 'rms-flux' relation and the similarity with Xray binary systems, Uttley & Mc Hardy 2001; Uttley 2003)\nsuggest that the accretion flow is geometrically thick, so\nthat perturbations can propagate from a range of radii into\nthe inner X-ray emitting regions. For AGN variability dominated by intrinsic variability of the power-law emission and\nnot varying thermal emission, a geometrically thick but opti-\n\ncally thin coronal accretion flow or advection dominated flow\nmay suffice to explain the variability. However in the case of\nNGC 4051, where the thermal emission appears to drive the\npivoting of the power-law (see below), the optically thick accretion disk must itself be geometrically thick in order for the\nmodel of propagating perturbations in the accretion flow to\nwork (e.g. see Appendix to Churazov, Gilfanov & Revnivtsev 2001). This situation can be realised at high accretion\nrates (e.g. Frank, King & Raine 1992). The long-term average 2-10 keV X-ray luminosity of NGC 4051 from RXTE\nmonitoring (e.g. Mc Hardy et al. 2003) of ∼ 3 × 1041 erg s−1 ,\ncorresponds to about 1% of the Eddington luminosity for\nthe black hole mass given above. Depending on the assumed bolometric correction, the total luminosity is likely\nto be of the order of a few tens of % of Eddington, possibly\nsometimes reaching close to the Eddington rate, so a thick\ndisk seems a likely configuration for the accretion flow in\nNGC 4051.\nThe physical connection between the thermal and\npower-law components will determine the shape of the spectrum in the intermediate energy range (perhaps 0.5-3 keV)\nwhere both components contribute significantly. For example, we might expect a rather smooth join between the components, with a shape determined by the underlying thermal\nspectrum and the temperature distribution of the Comptonising electrons, as well as other factors (e.g. geometry\nof the emitting regions). Therefore it is not surprising that\nour rather crude best-fitting model, which treats both components separately, is still not a very good fit to the data,\nespecially in that intermediate energy range, where notable\nresiduals can be seen. Additional complexities might exist,\nfor example are there two populations of Comptonising electrons (as suggested by our model which includes both a hard\npivoting power-law and a steeper Compton tail to the thermal component), or do the electron populations merge (e.g.\nas in a hybrid thermal-non-thermal plasma, Gierlinski et al.\n1999)? Spectral modelling with a more detailed theoretical\nunderpinning may help answer these questions by providing\nmuch better fits to the data.\nThe pivoting power-law can be interpreted simply in\nterms of models where the luminosity of the X-ray emitting corona is constant and seed photons are varying (see\nZdziarski et al. 2002 and discussion in Taylor et al. 2003).\nHowever, we note that there is intrinsic scatter in the unbinned flux-flux plots, implying an additional source of specc 0000 RAS, MNRAS 000, 000–000\n\n\fNGC 4051 in the low flux state\ntral variability which is independent of flux. We note that\nvarious spectral timing properties of NGC 4051 imply an additional variability process in the hard band which applies\non short time-scales only (e.g. the flattening of the power\nspectrum at higher energies and the decrease in coherence\nbetween bands on short time-scales; Mc Hardy et al. 2003),\nwhich is likely to be the origin of much of the scatter in\nthe HS flux-flux plot. Taylor et al. (2003) suggested that\nthe intrinsic scatter in the flux-flux plots may be due to\nweak variability of the hard component (possibly reflection)\nwhich is uncorrelated with the strongly variable power-law\ncomponent. However, the fact that the scatter increases towards higher fluxes, as is shown in Appendix A, implies that\nthe additional variable process is 'aware' of the large amplitude flux variability and hence is likely to be intrinsic to\nthe variable power-law (note that this effect is related to\nthe rms-flux relation observed in NGC 4051, Mc Hardy et\nal. 2003). Such additional variability in the power-law could\narise from events which heat the corona on short-time-scales\n(e.g. magnetic flares) independent of the variations in seed\nphoton flux which may be due to accretion instabilities.\n6.2\n\nReflection, absorption and the nature of the\nconstant continuum components\n\nA strong reflection component (which we assume is constant) seems to be required to explain the data. The normalisation of the reflection component corresponds to a\ntypical illuminating continuum 2-10 keV flux of ∼ 3 ×\n10−11 erg cm−2 s−1 for a reflector covering 2π steradian\nsolid angle, as seen from the illuminating source (compare\nwith the RXTE-observed average 2-10 keV flux since 1996\nof 2.2 × 10−11 erg cm−2 s−1 ). One might assume therefore\nthat the constant reflection could originate from a distant\nreflector. However, the reflection required to fit the 2002 low\nstate spectrum is a factor> 2 larger than than that used to\nexplain the May 1998 spectrum observed by BeppoSAX and\nRXTE (Uttley et al., 1999), while the narrow 6.4 keV line\nflux is not larger than observed in May 1998, suggesting that\na significant component of the reflection is not directly coupled to the narrow line flux and may not arise in a distant\nreprocessor. Furthermore, we point out that according to\nFig. 1, at earlier epochs in the 2002 low state the 2-10 keV\nsource flux dropped to significantly lower levels than we observed with XMM-Newton. Since our spectral fits suggest\nthe source to be reflection dominated at the lowest fluxes\nobserved by XMM-Newton, this suggests that the some significant fraction of the reflection component may itself vary\non time-scales of weeks or less.\nWeak variability of a reflection component, which is independent of the illuminating continuum flux is also implied\nby fitting a two-component model to data from MCG–6-3015 (Fabian & Vaughan, 2003). Puzzlingly however, a diskline\nappears not to be required in NGC 4051, perhaps suggesting\nthat more realistic models than we use here are required to\nexplain the reflection, i.e. taking full account of relativistic\nsmearing, disk ionisation or more complex reflection geometries (e.g. Fabian et al. 2002). We note here that Miniutti &\nFabian (2003) demonstrate in the specific case of NGC 4051\nhow strong, almost constant reflection can be produced by\nthe effects of strong gravitational light bending on X-rays\nilluminating the disk from a source of variable height close\nc 0000 RAS, MNRAS 000, 000–000\n\n11\n\nto the black hole. Miniutti & Fabian (2003) point out that\nin low flux states (when the source is closest to the black\nhole, and hence light bending and relative reflection is most\nextreme), the inner disk is likely to be highly ionised, with\nattendant effects on the line strength and profile. Indeed the\nextreme variability of the thermal component in the spectrum of NGC 4051 (which may drive the spectral pivoting)\nfurther suggests that the inner accretion disk in NGC 4051\nis very unstable, which may carry implications for the formation of prominent iron disklines.\nWe also detect a strong (τ ∼ 0.4) absorption edge at\n∼ 7.9 keV, possibly due to Fexvii. The presence of such a\nstrong edge is puzzling, because it corresponds to an absorbing column of Fe > 1019 cm−2 , i.e. a hydrogen column\n> 1023 cm−2 assuming Solar abundances. In the absence of\na large overabundance of iron, it is difficult to imagine how\nsuch a large absorbing column could remain hidden at lower\nenergies. This is because even if it is highly ionised (e.g.\nionisation parameter ξ ∼ 103 –104 ), such a large column of\ngas would produce strong edges in lower-Z elements which\nare not observed in the XMM-Newton grating spectrum of\nNGC 4051 in the normal state (Ogle et al., 2003). One cannot also simply argue that the column of gas in the line of\nsight is much larger in the low state, because the resulting\ndiscontinuity in the effects of absorption would not produce\nthe gentle bending of the HS flux-flux relation between the\nnormal and low state seen in Fig. 4. Note that these arguments appear to rule out the recent partial ionised absorber\nexplanation for the spectral variability of NGC 4051 suggested by Pounds et al. (2003), but these arguments also\nimpose strong constraints on our interpretation of the edge\nat 7.9 keV detected in the low state. An alternative interpretation of the 7.9 keV edge is that it originates in reflection, rather than absorption, i.e. it may originate from the\npossibly constant reflection component. This interpretation\nwould help to explain why this edge is not readily apparent\nin the normal state spectra (e.g. it is not reported by Lamer\net al. 2003), since it would be diluted by the higher continuum level in that state. Unfortunately, the spectra from\ndifferent flux epochs within the low state do not have sufficient high energy signal-to-noise to test the flux dependence\nof the depth of the edge, but our hypothesis at least appears\nto be consistent with the lack of evidence for a very large\ncolumn of absorbing gas at lower energies.\nThe presence of an absorption edge of Fexvii in reflection is consistent with a mildly ionised reflector with\nξ ∼ 100. Such a reflector would also produce edges of Ovii\nand Oviii and it is tempting to equate these features with\nthe strong absorption edges (τ ∼ 1) we use to fit the low\nstate data, which are required by the model in conjunction\nwith a constant soft continuum component, in order to explain the lack of variability above ∼ 0.7 keV and the resulting flattening of the MS flux-flux relation at low fluxes.\nIn fact, one might explain both the soft absorption features\nand the constant soft component in terms of reflection of\nthe primary continuum (in this case a Comptonised blackbody plus power-law), from different locations of an ionised\ndisk. For example, if at low fluxes (where the constant, unabsorbed soft component dominates) only the innermost,\nheavily ionised regions of a disk are illuminated, then the reflected spectrum will be almost featureless and match closely\nthe illuminating soft spectral shape. However, if the geom-\n\n\f12\n\nP. Uttley et al.\n\netry of the source changes, so that at slightly higher fluxes\nthe source height increases or the source becomes more vertically extended, the outer, less heavily ionised regions of the\ndisk will also be illuminated and edges will be imprinted on\nthe reflected spectrum. Or alternatively, at higher illuminating fluxes the outer disk may become sufficiently ionised to\nallow reflection in soft X-rays together with the accompanying edges, without requiring a change in source geometry. At\neven higher fluxes, those edges may be reduced by further\nionisation (and hence do not appear in the normal state)\nor they may be diluted if the soft component of reflection\nsomehow remains constant at higher fluxes, which is possible if the soft reflection has the same origin as the constant\nreflection component observed at harder energies. The basic\nphysical picture we propose above to explain the constant\nsoft component and possible edges may be consistent with\nthe model of Miniutti & Fabian (2003), if it is extended to\ntreat reflection from an ionised disk. However, it is unclear\nwhether our interpretation that the variable thermal emission drives the power-law pivoting could apply in the model\nof Miniutti & Fabian (2003), since in that model the continuum variability is explained as being predominantly due\nto gravitational effects coupled with variations in height of\na constant source.\nAn alternative explanation of the O edges (and/or possible Fe UTA) required by our model is that they represent\nsimple absorption of the varying component of emission.\nIn this case, the constant soft component is unabsorbed.\nThis picture represents something like the partial covering\nscenario envisaged by Pounds et al. (2003), albeit without\nthe requirement of such a large column denisty of material, which seems problematic (as noted above). The optical\ndepth of O edges required by our model correspond to ionic\ncolumn densities of ∼ 1019 cm−2 which are not easy to reconcile with the column densities observed in grating data of\nthe normal state (∼ 2 × 1017 cm−2 , Ogle et al. 2003), even\ngiven a large drop in ionisation parameter. However the predicted total column in this case is ∼ 1022 cm−2 , lower than\nthe value estimated by Pounds et al. (2003), and may be\nconsistent with the lack of strong edges observed at higher\nfluxes in the normal state. The requirement of only partial\ncovering in this scenario remains difficult to explain however.\n\n7\n\nCONCLUSIONS\n\nWe have presented an analysis of EPIC-pn data from an\nXMM-Newton observation of NGC 4051 in the low state in\n2002 November. We reach the following conclusions:\n(i) The spectral variability observed in NGC 4051 in the\nlow state is complex (see Section 3). However, flux-flux plots\nshow that the overall spectral shape in the low state is consistent with an extrapolation of the spectral pivoting of a\npower-law continuum observed at higher fluxes (Section 4),\nconfirming the interpretation of earlier Chandra data by Uttley et al. (2003).\n(ii) At softer energies, the variable spectrum is reasonably well described by a thermal component with a constant,\nComptonised blackbody shape, which in order to explain the\nspectral variability, may be absorbed in the ∼ 0.7–1 keV\nrange, perhaps by photoelectric edges of Ovii/Oviii and/or\n\nunresolved transition arrays of Fe, which may possibly be associated with reflection features also seen at higher energies.\nThe blackbody temperature (kT ∼ 0.1 keV) of this Comptonised thermal component is consistent with the low black\nhole mass of NGC 4051 (3 × 105 M⊙ , Shemmer et al. 2003),\nand the strong variability of this component, correlated with\nthe power-law pivoting at harder energies, suggest that it is\nthe source of seed photons for the power-law continuum.\n(iii) A constant reflection component and Fexvii edge can\nexplain the hard spectral features (in addition to the pivoting power-law continuum), although a prominent diskline is\nnot required. However, the apparent lack of long-term coupling between the reflection amplitude and the narrow iron\nline flux, together with the possible variability of the reflection component on time-scales of weeks suggest that some\nkind of disk reflection cannot be ruled out. The Fexvii edge\nrequires an absorbing column of NH > 1023 cm−2 , but due\nto the lack of evidence for such a large absorbing column at\nlower energies we suggest the edge is observed in reflection.\n(iv) A constant soft spectral component is also required to\nexplain the spectral variability of NGC 4051. This constant\nsoft component likely has a spectrum similar to that of the\nvariable component, but without any absorption. The constant soft component might be related to the constant hard\nreflection component if the reflector is ionised, in which case\na model similar to that of Miniutti & Fabian (2003) may\nhelp to explain the unusual spectral variability properties of\nNGC 4051 in the low state. Alternatively, partial covering of\nthe emission by ionised gas of column density ∼ 1022 cm−2\nmay explain the data.\nAcknowledgments\nWe thank the anonymous referee for a number of helpful comments which improved this paper. This work\nwas supported by grants from the UK Particle Physics\nand Astronomy Research Council (PPARC) including\nPPA/G/S/2000/00085. IMc H also acknowledges the support of a PPARC Senior Research Fellowship. The work\nreported here is based on observations obtained with XMMNewton, an ESA science mission with instruments and contributions directly funded by ESA Member States and the\nUSA (NASA).\n\nReferences\nChurazov E., Gilfanov M., Revnivtsev M., 2001, MNRAS,\n321, 759\nCollinge M. J., et al., 2001, ApJ, 557, 2\nElvis M., Lockman F. J., Wilkes B. J., 1989, AJ, 97, 777\nFabian A. C., Ballantyne D. R., Merloni A., Vaughan S.,\nIwasawa K., Boller Th., 2002, MNRAS, 331, L35\nFabian A. C., Vaughan S., 2003, MNRAS in press (astroph/0301588)\nFrank J., King, A. R., Raine D. J., 1992, Accretion Power\nin Astrophysics. Cambridge Univ. Press, Cambridge\nGierlinski M., Zdziarski A. A., Poutanen J., Coppi P. S.,\nEbisawa K., Johnson W. N., 1999, MNRAS, 309, 496\nGuainazzi M., Mihara T., Otani C., Matsuoka M., 1996,\nPASJ, 48, 781\nGuainazzi M., et al., 1998, MNRAS, 301, L1\nc 0000 RAS, MNRAS 000, 000–000\n\n\fNGC 4051 in the low flux state\n\n13\n\nthe binned HS flux-flux relation as a function of flux, and so\nconfirm that the scatter does increase towards higher fluxes.\nWe demonstrate this result in Fig. A1, which shows the rms\nspread in the flux bins used to plot the binned HS flux-flux\nrelation. The spread in hard fluxes in a bin, σh is determined\nusing the equation:\n\nv\nu\nu 1\nσh = t\n\nn−1\n\nFigure A1. Spread in the HS flux-flux relation (see Section 4 as a\nfunction of flux. The dotted line shows the 90% confidence upper\nlimit in spread expected due to photon counting noise effects only,\ni.e. with no intrinsic scatter in the unbinned flux-flux relation (see\ntext for details).\n\nLamer G., Mc Hardy I. M., Uttley P., Jahoda K., 2003,\nMNRAS, 338, 323\nMason K. O., et al., 2002, ApJ, 580, L117\nMc Hardy I. M., Papadakis I. E., Uttley P., Page M. J.,\nMason K. O., 2003, MNRAS submitted\nMiniutti G., Fabian A. C., Goyder R., Lasenby A. N., 2003,\nMNRAS, 344, L22\nMiniutti G., Fabian A. C., 2003, submitted to MNRAS\n(astro-ph/0309064)\nOgle P. M., Mason K. O., Page M. J., Salvi N. J., Cordova F. A., Mc Hardy I. M., Priedhorsky W. C., 2003,\nApJ, submitted\nPounds K. A., Reeves J. N., King A. R., Page K. L., 2003,\nMNRAS, submitted (astro-ph/0310257)\nSalvi N. J., 2003, Ph.D. thesis, Univ. London\nShemmer O., Uttley P., Netzer H., Mc Hardy I. M., 2003,\nMNRAS in press (astro-ph/0305129)\nShih D. C., Iwasawa K., Fabian A. C., 2002, MNRAS, 333,\n687\nTaylor R. D., Uttley P., Mc Hardy I. M., 2003, MNRAS,\n342, L31\nUttley P., Mc Hardy I. M., Papadakis I. E., Guainazzi M.,\nFruscione A., 1999, MNRAS, 307, L6\nUttley P., Mc Hardy I. M., Papadakis I. E., Cagnoni I.,\nFruscione A., 2000, MNRAS, 312, 880\nUttley P., Mc Hardy I. M., 2001, MNRAS, 323, L26\nUttley P., Fruscione A., Mc Hardy I., Lamer G., 2003, ApJ,\n595, 656\nUttley P., 2003, submitted to MNRAS\nZdziarski A. A., Poutanen J., Paciesas W. S., Wen L., 2002,\nApJ, 578, 357\n\nAPPENDIX A: SCATTER IN THE HS\nFLUX-FLUX RELATION\nBy assuming the best-fitting power-law plus constants\nmodel, we can determine the spread in data points around\nc 0000 RAS, MNRAS 000, 000–000\n\nn\nX\n\n(Hi − hi )2\n\n(A1)\n\ni=1\n\nwhere there are n individual hard-flux measurements (hi ) in\nthe bin, and for each individual measurement Hi is the hardflux predicted from the observed soft flux by the best-fitting\npower-law plus constants model. Of course, some scatter in\nthe relation can be caused by photon counting noise in both\nthe hard and soft bands (which moves the data points on\nthe flux-flux plot in vertical and horizontal directions respectively). The effect of this noise on the scatter is dependent\non the form of the flux-flux relation and so is not a simple function of flux. For example, since the fitted flux-flux\nrelation is a power-law with index< 1, any scatter due to\nnoise in the soft band is magnified at low fluxes, because\nthe flux-flux relation is steeper, so that a horizontal shift in\na data point at low fluxes will have a larger effect than the\nsame shift at high fluxes. Therefore, to take account of the\neffects of photon counting noise, we used a simple bootstraptype technique, assigning a hard flux value to each observed\nsoft flux value using the best-fitting model for the binned HS\nflux-flux relation (i.e. assuming no intrinsic scatter) and then\nshifting each simulated data point in both the hard flux and\nsoft flux directions by a zero-mean Gaussian deviate with\nstandard deviation equal to the corresponding error bars, to\nproduce a new realisation of the unbinned flux-flux plot. By\nsimulating 1000 such realisations and measuring the scatter\nas a function of flux in each, we could estimate the distribution of the rms spread expected from photon counting noise\nonly, in the absence of any intrinsic scatter. The resulting\n90% confidence upper limit on the expected rms spread due\nto noise is shown as a dotted line in Fig. A1. Clearly the\nobserved scatter and the increase in scatter with flux are\nhighly significant.\n\n\f\f"}