{"id": "http://arxiv.org/abs/astro-ph/0407133v1", "guidislink": true, "updated": "2004-07-07T10:49:00Z", "updated_parsed": [2004, 7, 7, 10, 49, 0, 2, 189, 0], "published": "2004-07-07T10:49:00Z", "published_parsed": [2004, 7, 7, 10, 49, 0, 2, 189, 0], "title": "Spectroscopy of PNe in Sextans A, Sextans B, NGC 3109 and Fornax", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0407520%2Castro-ph%2F0407100%2Castro-ph%2F0407471%2Castro-ph%2F0407456%2Castro-ph%2F0407050%2Castro-ph%2F0407516%2Castro-ph%2F0407121%2Castro-ph%2F0407539%2Castro-ph%2F0407133%2Castro-ph%2F0407113%2Castro-ph%2F0407005%2Castro-ph%2F0407018%2Castro-ph%2F0407115%2Castro-ph%2F0407648%2Castro-ph%2F0407386%2Castro-ph%2F0407158%2Castro-ph%2F0407154%2Castro-ph%2F0407150%2Castro-ph%2F0407273%2Castro-ph%2F0407142%2Castro-ph%2F0407380%2Castro-ph%2F0407573%2Castro-ph%2F0407101%2Castro-ph%2F0407211%2Castro-ph%2F0407192%2Castro-ph%2F0407131%2Castro-ph%2F0407119%2Castro-ph%2F0407580%2Castro-ph%2F0407424%2Castro-ph%2F0407576%2Castro-ph%2F0407418%2Castro-ph%2F0407324%2Castro-ph%2F0407344%2Castro-ph%2F0407498%2Castro-ph%2F0407603%2Castro-ph%2F0407312%2Castro-ph%2F0407157%2Castro-ph%2F0407636%2Castro-ph%2F0407363%2Castro-ph%2F0407371%2Castro-ph%2F0407030%2Castro-ph%2F0407194%2Castro-ph%2F0407404%2Castro-ph%2F0407421%2Castro-ph%2F0407041%2Castro-ph%2F0407442%2Castro-ph%2F0407077%2Castro-ph%2F0407551%2Castro-ph%2F0407408%2Castro-ph%2F0407086%2Castro-ph%2F0407042%2Castro-ph%2F0407009%2Castro-ph%2F0407412%2Castro-ph%2F0407067%2Castro-ph%2F0407230%2Castro-ph%2F0407159%2Castro-ph%2F0407256%2Castro-ph%2F0407393%2Castro-ph%2F0407357%2Castro-ph%2F0407002%2Castro-ph%2F0407203%2Castro-ph%2F0407189%2Castro-ph%2F0407120%2Castro-ph%2F0407595%2Castro-ph%2F0407278%2Castro-ph%2F0407219%2Castro-ph%2F0407117%2Castro-ph%2F0407172%2Castro-ph%2F0407461%2Castro-ph%2F0407557%2Castro-ph%2F0407118%2Castro-ph%2F0407236%2Castro-ph%2F0407515%2Castro-ph%2F0407027%2Castro-ph%2F0407575%2Castro-ph%2F0407136%2Castro-ph%2F0407623%2Castro-ph%2F0407270%2Castro-ph%2F0407124%2Castro-ph%2F0407449%2Castro-ph%2F0407188%2Castro-ph%2F0407445%2Castro-ph%2F0407631%2Castro-ph%2F0407310%2Castro-ph%2F0407625%2Castro-ph%2F0407402%2Castro-ph%2F0407125%2Castro-ph%2F0407454%2Castro-ph%2F0407314%2Castro-ph%2F0407068%2Castro-ph%2F0407439%2Castro-ph%2F0407106%2Castro-ph%2F0407413%2Castro-ph%2F0407147%2Castro-ph%2F0407372%2Castro-ph%2F0407213%2Castro-ph%2F0407309%2Castro-ph%2F0407359%2Castro-ph%2F0407228%2Castro-ph%2F0407182%2Castro-ph%2F0407262&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectroscopy of PNe in Sextans A, Sextans B, NGC 3109 and Fornax"}, "summary": "Planetary nebulae (PNe) and HII regions provide a probe of the chemical\nenrichment and star formation history of a galaxy from intermediate ages to the\npresent day. We present the first results of NTT spectroscopy of HII regions\nand/or PNe in four nearby dwarf galaxies: Sextans A, Sextans B, NGC 3109, and\nFornax. For all PNe and some of the HII regions in these galaxies we have\nobtained elemental abundances via the classic Te-method based on the detection\nof the [OIII] 4363 line. The oxygen abundances in three HII regions of Sextans\nA are all consistent within the individual rms uncertainties. The oxygen\nabundance in the PN of Sextans A is however significantly higher. This PN is\neven more enriched in nitrogen and helium, implying its classification as a PN\nof Type I. The presumably unaffected PN abundances of S and Ar are well below\nthose in the HII regions, indicating a lower metallicity at the epoch of the PN\nprogenitor formation. For two HII regions in Sextans B, the oxygen abundances\ndo not differ within the rms uncertainties. The third one is, however, twice as\nmetal-rich, providing evidence for the inhomogeneity of the current metallicity\ndistribution in Sextans B. For the PN in Sextans B we measured an O/H that is\nconsistent with that of the low-metallicity HII regions. For NGC 3109 our\npreliminary results indicate that the oxygen abundances of PNe and HII regions\nare all within a small range of $\\pm$0.15 dex. For the PN in Fornax, Ne, Ar and\nS abundances suggest that the ISM metallicity was $\\sim$0.3 dex lower at the\nepoch of the PN progenitor's formation, compared to the O/H value derived for\nthe PN (abridged).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0407520%2Castro-ph%2F0407100%2Castro-ph%2F0407471%2Castro-ph%2F0407456%2Castro-ph%2F0407050%2Castro-ph%2F0407516%2Castro-ph%2F0407121%2Castro-ph%2F0407539%2Castro-ph%2F0407133%2Castro-ph%2F0407113%2Castro-ph%2F0407005%2Castro-ph%2F0407018%2Castro-ph%2F0407115%2Castro-ph%2F0407648%2Castro-ph%2F0407386%2Castro-ph%2F0407158%2Castro-ph%2F0407154%2Castro-ph%2F0407150%2Castro-ph%2F0407273%2Castro-ph%2F0407142%2Castro-ph%2F0407380%2Castro-ph%2F0407573%2Castro-ph%2F0407101%2Castro-ph%2F0407211%2Castro-ph%2F0407192%2Castro-ph%2F0407131%2Castro-ph%2F0407119%2Castro-ph%2F0407580%2Castro-ph%2F0407424%2Castro-ph%2F0407576%2Castro-ph%2F0407418%2Castro-ph%2F0407324%2Castro-ph%2F0407344%2Castro-ph%2F0407498%2Castro-ph%2F0407603%2Castro-ph%2F0407312%2Castro-ph%2F0407157%2Castro-ph%2F0407636%2Castro-ph%2F0407363%2Castro-ph%2F0407371%2Castro-ph%2F0407030%2Castro-ph%2F0407194%2Castro-ph%2F0407404%2Castro-ph%2F0407421%2Castro-ph%2F0407041%2Castro-ph%2F0407442%2Castro-ph%2F0407077%2Castro-ph%2F0407551%2Castro-ph%2F0407408%2Castro-ph%2F0407086%2Castro-ph%2F0407042%2Castro-ph%2F0407009%2Castro-ph%2F0407412%2Castro-ph%2F0407067%2Castro-ph%2F0407230%2Castro-ph%2F0407159%2Castro-ph%2F0407256%2Castro-ph%2F0407393%2Castro-ph%2F0407357%2Castro-ph%2F0407002%2Castro-ph%2F0407203%2Castro-ph%2F0407189%2Castro-ph%2F0407120%2Castro-ph%2F0407595%2Castro-ph%2F0407278%2Castro-ph%2F0407219%2Castro-ph%2F0407117%2Castro-ph%2F0407172%2Castro-ph%2F0407461%2Castro-ph%2F0407557%2Castro-ph%2F0407118%2Castro-ph%2F0407236%2Castro-ph%2F0407515%2Castro-ph%2F0407027%2Castro-ph%2F0407575%2Castro-ph%2F0407136%2Castro-ph%2F0407623%2Castro-ph%2F0407270%2Castro-ph%2F0407124%2Castro-ph%2F0407449%2Castro-ph%2F0407188%2Castro-ph%2F0407445%2Castro-ph%2F0407631%2Castro-ph%2F0407310%2Castro-ph%2F0407625%2Castro-ph%2F0407402%2Castro-ph%2F0407125%2Castro-ph%2F0407454%2Castro-ph%2F0407314%2Castro-ph%2F0407068%2Castro-ph%2F0407439%2Castro-ph%2F0407106%2Castro-ph%2F0407413%2Castro-ph%2F0407147%2Castro-ph%2F0407372%2Castro-ph%2F0407213%2Castro-ph%2F0407309%2Castro-ph%2F0407359%2Castro-ph%2F0407228%2Castro-ph%2F0407182%2Castro-ph%2F0407262&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Planetary nebulae (PNe) and HII regions provide a probe of the chemical\nenrichment and star formation history of a galaxy from intermediate ages to the\npresent day. We present the first results of NTT spectroscopy of HII regions\nand/or PNe in four nearby dwarf galaxies: Sextans A, Sextans B, NGC 3109, and\nFornax. For all PNe and some of the HII regions in these galaxies we have\nobtained elemental abundances via the classic Te-method based on the detection\nof the [OIII] 4363 line. The oxygen abundances in three HII regions of Sextans\nA are all consistent within the individual rms uncertainties. The oxygen\nabundance in the PN of Sextans A is however significantly higher. This PN is\neven more enriched in nitrogen and helium, implying its classification as a PN\nof Type I. The presumably unaffected PN abundances of S and Ar are well below\nthose in the HII regions, indicating a lower metallicity at the epoch of the PN\nprogenitor formation. For two HII regions in Sextans B, the oxygen abundances\ndo not differ within the rms uncertainties. The third one is, however, twice as\nmetal-rich, providing evidence for the inhomogeneity of the current metallicity\ndistribution in Sextans B. For the PN in Sextans B we measured an O/H that is\nconsistent with that of the low-metallicity HII regions. For NGC 3109 our\npreliminary results indicate that the oxygen abundances of PNe and HII regions\nare all within a small range of $\\pm$0.15 dex. For the PN in Fornax, Ne, Ar and\nS abundances suggest that the ISM metallicity was $\\sim$0.3 dex lower at the\nepoch of the PN progenitor's formation, compared to the O/H value derived for\nthe PN (abridged)."}, "authors": ["Alexei Y. Kniazev", "Eva K. Grebel", "Alexander G. Pramskij", "Simon A. Pustilnik"], "author_detail": {"name": "Simon A. Pustilnik"}, "author": "Simon A. Pustilnik", "arxiv_comment": "5 pages, 1 figure; contribution to proceedings of the ESO Workshop on\n  \"Planetary Nebulae beyond the Milky Way\", May 19 - 21 (2004), ESO, Garching", "links": [{"href": "http://arxiv.org/abs/astro-ph/0407133v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0407133v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0407133v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0407133v1", "journal_reference": null, "doi": null, "fulltext": "Spectroscopy of PNe in Sextans A, Sextans B,\nNGC 3109 and Fornax\nAlexei Y. Kniazev1 , Eva K. Grebel2 , Alexander G. Pramskij3 , and Simon A.\nPustilnik3\n1\n\narXiv:astro-ph/0407133v1 7 Jul 2004\n\n2\n\n3\n\nMax-Planck-Institut für Astronomie, Königstuhl 17, D-69117 Heidelberg, Germany\nAstronomisches Institut, Universität Basel, Venusstrasse 7, CH-4102 Binningen,\nSwitzerland\nSpecial Astrophysical Observatory, Nizhnij Arkhyz, Karachai-Circassia, 369167,\nRussia\n\nAbstract. Planetary nebulae (PNe) and HII regions provide a probe of the chemical enrichment and star formation history of a galaxy from intermediate ages to the\npresent day. Furthermore, observations of HII regions and PNe permit us to measure\nabundances at different locations, testing the homogeneity with which heavy elements\nare/were distributed within a galaxy. We present the first results of NTT spectroscopy\nof HII regions and/or PNe in four nearby dwarf galaxies: Sextans A, Sextans B, NGC\n3109, and Fornax. The first three form a small group of galaxies just beyond the Local Group and are gas-rich dwarf irregular galaxies, whereas Fornax is a gas-deficient\nLocal Group dwarf spheroidal that stopped its star formation activity a few hundred\nmillion years ago. For all PNe and some of the HII regions in these galaxies we have\nobtained elemental abundances via the classic Te -method based on the detection of the\n[OIII] λ4363 line. The oxygen abundances in three HII regions of Sextans A are all\nconsistent within the individual rms uncertainties. The oxygen abundance in the PN\nof Sextans A is however significantly higher. This PN is even more enriched in nitrogen\nand helium, implying its classification as a PN of Type I. The presumably unaffected\nPN abundances of S and Ar are well below those in the HII regions, indicating a lower\nmetallicity at the epoch of the PN progenitor formation. For two HII regions in Sextans B, the oxygen abundances do not differ within the rms uncertainties. The third\none is, however, twice as metal-rich, providing evidence for the inhomogeneity of the\ncurrent metallicity distribution in Sextans B. For the PN in Sextans B we measured\nan O/H that is consistent with that of the low-metallicity HII regions. For NGC 3109\nour preliminary results indicate that the oxygen abundances of PNe and HII regions\nare all within a small range of ±0.15 dex. For the PN in Fornax, Ne, Ar and S abundances suggest that the ISM metallicity was ∼0.3 dex lower at the epoch of the PN\nprogenitor's formation, compared to the O/H value derived for the PN.\n\n1\n\nIntroduction\n\nUnderstanding how the elemental abundances of galaxies have changed over\ntime is an essential issue of galaxy evolution studies. Abundance measurements\nconstrain theoretical models, providing important clues to how galaxies evolve.\nIn particular, combining the data on PNe numbers and on PN and HII region elemental abundances can allow one to derive an approximate enrichment\nand star formation history of a galaxy from intermediate ages to the present\n\n\f2\n\nAlexei Kniazev et al.\n\nday. While HII regions indicate the present-day gas-phase elemental abundances\n(∼ 10 Myr), PNe, although they cannot be accurately age-dated, reveal the\nchemical composition of a galaxy at \"intermediate\" ages of a few 100 Myr to a\nfew Gyr. Furthermore, if HII regions and PNe at different locations are studied,\nthis permits us to test the homogeneity with which heavy elements are/were distributed within a galaxy. For the Local Group and other nearby galaxies these\ndata can be combined with star formation histories derived from color-magnitude\ndiagrams of resolved stars, thereby yielding deeper insights on galaxy evolution.\nThe goal of our present work was to improve our understanding of metallicities\nboth at the current epoch (from HII regions), and in previous periods of star\nformation (from PNe) on the basis of new high-quality NTT spectrophotometry\nfor three members of Antlia-Sextans group of dwarf galaxies [27] and for the\nFornax dwarf spheroidal galaxy.\n\n2\n\nObservations and Reduction\n\nSpectrophotometric observations of HII regions and PNe in the targeted galaxies\nwere conducted with the NTT at ESO, La Silla, in February 2004. The observations were performed with the Red Arm of the EMMI multipurpose instrument\nwith a long slit of 8′ × 2′′ . For these observations the CCD rows were binned\nby a factor of 2, yielding a final spatial sampling of 0.33′′ pixel−1 . The seeing\nduring the observations was very stable and varied from night to night in the\nrange of 0.4′′ to 0.6′′ . The whole spectral range covered by the two grisms was of\n3800 – 8700 Å with the sampling of 1.6 Å pixel−1 for the blue (3800 – 7000 Å)\nand 1.4 Å pixel−1 for the red part (5750 – 8670 Å) of the spectra. Each galaxy\nwas observed with slit positions which covered several HII regions and also one\nPN in Sextans A, one PN in Sextans B, four PNe in NGC 3109 and one PN in\nFornax. The PNe positions have been taken from [21] for Sextans A, from [20]\nfor Sextans B, from [23] for NGC 3109 and from [4] for Fornax\nAll primary reductions were done using the IRAF and MIDAS environments.\nThe method of emission line measurements and the calculation of element abundances was described in detail in [10,11,14–16]. For the majority of PNe and HII\nregions in these galaxies O, N, S, Ar and He abundances were obtained with the\nclassic Te -method after the detection of the [OIII] λ4363 line.\n\n3\n\nPN abundances vs. HII abundances\n\nHII region metallicities mainly provide information about abundances of αprocess elements, produced predominantly in short-lived massive stars. In contrast to HII regions, some elemental abundances in PNe are affected by nucleosynthesis in PN progenitors. It is well known that newly synthesized material\ncan be dredged up by convection in the envelope, significantly altering abundances of He, C and N in the surface layers during the evolution of 1–8 M⊙ stars\non the giant branch and asymptotic giant branch (AGB) [18,2,9]. In addition, if\nduring the thermally pulsing phase of AGB evolution, convection \"overshoots\"\n\n\fSpectroscopy of PNe in Sextans A, Sextans B, NGC 3109 and Fornax\n\n3\n\nFig. 1. Planetary nebulae in Sextans A and Fornax. The emission-line EMMI/NTT\nspectra were obtained with grism #5 and cover a wavelength range of 3800 and 7000\nÅ. The spectra at the bottom of each panel is scaled by 1/10 (top) and 1/30 (bottom)\nand shifted to show the relative intensities of strong lines.\n\ninto the core, significant amounts of 16 O can be mixed into the inter-shell region\nand may be convected to the surface [8,1]. In combination, these factors mean\nthat surely only Ne, S and Ar abundances, observed in both HII regions and\nPNe, can be used to probe the enrichment history of galaxies.\n\n4\n\nSextans A\n\nSextans A is a dIrr at a distance of 1.32 Mpc for which deep HST images have\npermitted the measurements of stars to a limiting absolute magnitude of MV ∼\n+1.9 [5]. The gas abundance of heavy elements for Sextans A was first determined\nby [24]. This study presented only an empirical estimate of O/H, which has a\ncharacteristic rms uncertainty of ∼50%. While this estimate was successfully\nused in various statistical studies to combine the data on O/H with the CMDderived SF history and metallicities, such accuracy is not sufficient.\nWe have derived an average value of 12+log(O/H)=7.57 from three HII regions in Sextans A. The values of N/O, S/O and Ar/O are consistent in all\nthree HII regions to within their rms observational uncertainties and are close\nto those derived for the subgroup of the most metal-poor HII galaxies [11]. New,\nhigh accuracy chemical abundances for HII regions in Sextans A allow us to\nprobe metallicity homogeneity across the body of the galaxy. For the three HII\nregions observed in Sextans A, the measured abundances show no differences exceeding 0.1 dex. Moreover, these metallicities are in good agreement with those\nin three A-supergiants in Sextans A [13].\n\n\f4\n\nAlexei Kniazev et al.\n\nChemical abundances derived for the PN in Sextans A show that this is a\nType I object (see Figure 1), with a highly elevated nitrogen abundance: N/O\n∼2. Its 12+log(O/H) = 8.02 is about a factor of 3 higher than in the HII regions, which implies significant self-pollution by the PN progenitor. Since the\nabundances of S and Ar should not be altered in a PN progenitor (see discussion\nabove), their values indicate that the ISM metallicity was ∼0.5 dex lower at the\nepoch of the PN progenitor's formation, compared to the current metallicity in\nHII regions and A-supergiants.\n\n5\n\nSextans B\n\nSextans B is a dIrr at a distance of 1.36 Mpc [12], in which red giants, intermediateage stars, and young stars are found. As far as its global properties are concerned,\nSextans B is considered to be a \"twin\" to Sextans A, but Sextans B is of particular interest because of a discrepancy in oxygen abundances between the HII\nmeasurements of [25,24,22].\nWe confirmed with good accuracy the low ISM metallicity of Sextans B with\n12+log(O/H) = 7.53±0.04 in two HII regions. The element abundance ratios of\nO, N, S and Ar are well consistent with the respective patterns of very metalpoor HII galaxies. We have found that one HII region is significantly enriched,\nwith an excess of O, N, S and Ar abundances, relative to the mean value of\ntwo other HII regions, by a factor of 2.5±0.5. The elemental abundances of the\nobserved PN in Sextans B are consistent with those of the two HII regions with\nthe low metallicity.\n\n6\n\nNGC 3109\n\nNGC 3109, at a distance of 1.33 Mpc, is the most massive dIrr galaxy in AntliaSextans group. Compared to galaxies of similar total luminosity (e.g., the SMC),\nthe optical extent is approximately two times larger. The H I gas, stellar content\nand star formation history of this galaxy have been studied, e.g., by [3,7]. The\nunderlying old stars are metal-poor ([Fe/H] = −1.7 dex), as measured by [6]. [17]\nreported an oxygen abundance for one HII region with the Te -method, although\nthe S/N in the [OIII] λ4363 line was low (∼ 2.5). Our preliminary measurement\nof O/H for this HII region is quite consistent with their value, but with higher\nS/N=6 for the [OIII] λ4363 line. We found that oxygen abundances of PNe and\nHII regions are all in a narrow range near 12+log(O/H) ∼ 7.65±0.15.\n\n7\n\nPN in Fornax\n\nThe PN in the Fornax dwarf spheroidal galaxy was the only one found by [4],\nwho were the first to observe it spectroscopically. Our data are considerably\nbetter (see Figure 1), yielding S/N=25 for the [OIII] λ4363 line. We have calculated 12+log(O/H) = 8.28 for this PN, which is slightly lower than the O/H\n\n\fSpectroscopy of PNe in Sextans A, Sextans B, NGC 3109 and Fornax\n\n5\n\nvalue 8.38 from [19] that was calculated on the basis of line intensities from [4].\nWith our new data we have for first time detected weak [SII] λλ6717,6731 lines\n(I(6717+6731) < 0.015 I(Hβ)) and have determined an electron number density,\nNe (SII) = 750 cm−3 . With the newly determined O, N, Ne, Ar and S abundances\nand knowledge of mean heavy-element abundance ratios for these elements from\n[11] we have found that the PN is enriched with oxygen and the ISM metallicity\nwas ∼0.3 dex lower at the epoch of the PN progenitor formation compared to\nthe value O/H derived for the PN. This result is consistent with the chemical\nevolution scenario for the Fornax dwarf derived by [26]. The Fornax PN shows a\nWolf-Rayet blue bump in the spectrum that provides important constraints on\nthe central star evolutionary status. It is worth noting that both PNe from the\nSagittarius dwarf spheroidal galaxy from [28] also show Wolf-Rayet features in\ntheir spectra.\n\nReferences\n1. Blöcker, T. 2003, in IAU Symp. 209, Planetary Nebulae: their evolution and role\nin the Universe, eds. S.Kwok, M.Dopita, & R.Sutherland, 101\n2. Boothroyd, A.I., & Sackmann, I.-J. 1999, ApJ, 510, 232\n3. Carignan, C. 1985, ApJ, 299, 59\n4. Danziger, I.J., Dopita, M.A., Hawarden, T.G., & Webster, B.L. 1978, ApJ, 220,\n458\n5. Dolphin, A., Saha, A., Skillman, E. et al. 2003, AJ, 126, 187\n6. Grebel, Gallagher, & Harbeck 2003, AJ, 125, 1926\n7. Greggio, L., Marconi, G., Tosi, M., & Focardi, P. 1993, AJ, 105, 894\n8. Herwig, F. 2000, A&A, 360, 952\n9. Henry, R.B.C., Kwitter, K.B., & Bates, J.A. 2000, ApJ, 531, 928\n10. Izotov, Y.I., Thuan, T.X., & Lipovetsky, V.A. 1994, ApJ, 435, 647\n11. Izotov, Y.I., & Thuan, T.X. 1999, ApJ, 511, 639\n12. Karachentsev, I.D., Sharina, M.E., Makarov, D.I., et al. 2002, A&A, 389, 812\n13. Kaufer, A., Venn, K.A., Tolstoy, E., Pinte, C., & Kudritzki, R.-P. 2004, AJ, 127,\n2723\n14. Kniazev, A.Y., Pustilnik, S.A., Masegosa, J., et al. 2000, A&A, 357, 101\n15. Kniazev, A.Y., Grebel, E.K., Hao, L., Strauss, M.A., Brinkmann, J., & Masataka\nFukugita 2003, ApJ, 593, L73\n16. Kniazev, A.Y., Pustilnik, S.A., Grebel, E.K., Lee, H., & Pramskij, A.G. 2004,\nApJS August 2004, v153 issue, in press, (astro-ph/0404133)\n17. Lee, H., McCall, M.L., Kingsburgh, R.L., Ross, R., & Stevenson, C.C. 2003, AJ,\n125, 146\n18. Leisy, P., & Dennefeld, M. 1996, A&AS, 116, 95\n19. Maran, S.P., Gull, T.R., Stecher, T.P., Aller, L.H., & Keyes C.D. 1984, 280, 615\n20. Magrini, L., Corradi, R.L.M., Walton, N.A., et al. 2002, A&A, 386, 869\n21. Magrini, L., Corradi, R.L.M., Greimel, R., et al. 2003, A&A, 407, 51\n22. Moles, M., Aparicio, A., & Masegosa, J. 1990, A&A, 228, 310\n23. Richer, M.G., & McCall, M.L. 1992, AJ, 103, 54\n24. Skillman E.D., Kennicutt, R.C., & Hodge, P.W. 1989, ApJ, 347, 875\n25. Stasinska, G., Comte, G., & Vigroux, L. 1986, A&A, 154, 352\n26. Tolstoy, E., Venn, K.A., Shetrone, M., et al. 2003, AJ, 125, 707\n27. van den Bergh 1999, AJ, 517, L97\n28. Walsh, J.R., Dudziak, G., Minniti, D. & Zijlstra, A.A. 1997, ApJ, 487,651\n\n\f"}