{"id": "http://arxiv.org/abs/astro-ph/0401404v1", "guidislink": true, "updated": "2004-01-20T19:41:22Z", "updated_parsed": [2004, 1, 20, 19, 41, 22, 1, 20, 0], "published": "2004-01-20T19:41:22Z", "published_parsed": [2004, 1, 20, 19, 41, 22, 1, 20, 0], "title": "Statistical Challenges in Modern Astronomy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0201527%2Castro-ph%2F0201218%2Castro-ph%2F0201033%2Castro-ph%2F0201458%2Castro-ph%2F0201181%2Castro-ph%2F0201034%2Castro-ph%2F0201038%2Castro-ph%2F0201358%2Castro-ph%2F0201517%2Castro-ph%2F0201039%2Castro-ph%2F0201072%2Castro-ph%2F0201078%2Castro-ph%2F0201511%2Castro-ph%2F0201435%2Castro-ph%2F0201357%2Castro-ph%2F0201343%2Castro-ph%2F0201002%2Castro-ph%2F0201423%2Castro-ph%2F0201332%2Castro-ph%2F0201368%2Castro-ph%2F0201107%2Castro-ph%2F0201382%2Castro-ph%2F0201275%2Castro-ph%2F0201428%2Castro-ph%2F0201291%2Castro-ph%2F0201366%2Castro-ph%2F0201327%2Castro-ph%2F0201267%2Castro-ph%2F0201507%2Castro-ph%2F0201250%2Castro-ph%2F0201022%2Castro-ph%2F0201551%2Castro-ph%2F0201312%2Castro-ph%2F0201129%2Castro-ph%2F0201100%2Castro-ph%2F0201513%2Castro-ph%2F0201531%2Castro-ph%2F0201471%2Castro-ph%2F0201065%2Castro-ph%2F0201188%2Castro-ph%2F0201134%2Castro-ph%2F0401022%2Castro-ph%2F0401459%2Castro-ph%2F0401568%2Castro-ph%2F0401452%2Castro-ph%2F0401469%2Castro-ph%2F0401064%2Castro-ph%2F0401439%2Castro-ph%2F0401359%2Castro-ph%2F0401225%2Castro-ph%2F0401376%2Castro-ph%2F0401456%2Castro-ph%2F0401060%2Castro-ph%2F0401612%2Castro-ph%2F0401397%2Castro-ph%2F0401145%2Castro-ph%2F0401131%2Castro-ph%2F0401402%2Castro-ph%2F0401616%2Castro-ph%2F0401382%2Castro-ph%2F0401461%2Castro-ph%2F0401643%2Castro-ph%2F0401180%2Castro-ph%2F0401144%2Castro-ph%2F0401118%2Castro-ph%2F0401414%2Castro-ph%2F0401404%2Castro-ph%2F0401242%2Castro-ph%2F0401410%2Castro-ph%2F0401375%2Castro-ph%2F0401257%2Castro-ph%2F0401311%2Castro-ph%2F0401059%2Castro-ph%2F0401589%2Castro-ph%2F0401286%2Castro-ph%2F0401451%2Castro-ph%2F0401160%2Castro-ph%2F0401030%2Castro-ph%2F0401465%2Castro-ph%2F0401049%2Castro-ph%2F0401448%2Castro-ph%2F0401207%2Castro-ph%2F0401417%2Castro-ph%2F0401497%2Castro-ph%2F0401592%2Castro-ph%2F0401251%2Castro-ph%2F0401048%2Castro-ph%2F0401346%2Castro-ph%2F0401611%2Castro-ph%2F0401340%2Castro-ph%2F0401218%2Castro-ph%2F0401569%2Castro-ph%2F0401471%2Castro-ph%2F0401437%2Castro-ph%2F0401489%2Castro-ph%2F0401424%2Castro-ph%2F0401584%2Castro-ph%2F0401492%2Castro-ph%2F0401213%2Castro-ph%2F0401538%2Castro-ph%2F0401505&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Statistical Challenges in Modern Astronomy"}, "summary": "Despite centuries of close association, statistics and astronomy are\nsurprisingly distant today. Most observational astronomical research relies on\nan inadequate toolbox of methodological tools. Yet the needs are substantial:\nastronomy encounters sophisticated problems involving sampling theory, survival\nanalysis, multivariate classification and analysis, time series analysis,\nwavelet analysis, spatial point processes, nonlinear regression, bootstrap\nresampling and model selection. We review the recent resurgence of\nastrostatistical research, and outline new challenges raised by the emerging\nVirtual Observatory. Our essay ends with a list of research challenges and\ninfrastructure for astrostatistics in the coming decade.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0201527%2Castro-ph%2F0201218%2Castro-ph%2F0201033%2Castro-ph%2F0201458%2Castro-ph%2F0201181%2Castro-ph%2F0201034%2Castro-ph%2F0201038%2Castro-ph%2F0201358%2Castro-ph%2F0201517%2Castro-ph%2F0201039%2Castro-ph%2F0201072%2Castro-ph%2F0201078%2Castro-ph%2F0201511%2Castro-ph%2F0201435%2Castro-ph%2F0201357%2Castro-ph%2F0201343%2Castro-ph%2F0201002%2Castro-ph%2F0201423%2Castro-ph%2F0201332%2Castro-ph%2F0201368%2Castro-ph%2F0201107%2Castro-ph%2F0201382%2Castro-ph%2F0201275%2Castro-ph%2F0201428%2Castro-ph%2F0201291%2Castro-ph%2F0201366%2Castro-ph%2F0201327%2Castro-ph%2F0201267%2Castro-ph%2F0201507%2Castro-ph%2F0201250%2Castro-ph%2F0201022%2Castro-ph%2F0201551%2Castro-ph%2F0201312%2Castro-ph%2F0201129%2Castro-ph%2F0201100%2Castro-ph%2F0201513%2Castro-ph%2F0201531%2Castro-ph%2F0201471%2Castro-ph%2F0201065%2Castro-ph%2F0201188%2Castro-ph%2F0201134%2Castro-ph%2F0401022%2Castro-ph%2F0401459%2Castro-ph%2F0401568%2Castro-ph%2F0401452%2Castro-ph%2F0401469%2Castro-ph%2F0401064%2Castro-ph%2F0401439%2Castro-ph%2F0401359%2Castro-ph%2F0401225%2Castro-ph%2F0401376%2Castro-ph%2F0401456%2Castro-ph%2F0401060%2Castro-ph%2F0401612%2Castro-ph%2F0401397%2Castro-ph%2F0401145%2Castro-ph%2F0401131%2Castro-ph%2F0401402%2Castro-ph%2F0401616%2Castro-ph%2F0401382%2Castro-ph%2F0401461%2Castro-ph%2F0401643%2Castro-ph%2F0401180%2Castro-ph%2F0401144%2Castro-ph%2F0401118%2Castro-ph%2F0401414%2Castro-ph%2F0401404%2Castro-ph%2F0401242%2Castro-ph%2F0401410%2Castro-ph%2F0401375%2Castro-ph%2F0401257%2Castro-ph%2F0401311%2Castro-ph%2F0401059%2Castro-ph%2F0401589%2Castro-ph%2F0401286%2Castro-ph%2F0401451%2Castro-ph%2F0401160%2Castro-ph%2F0401030%2Castro-ph%2F0401465%2Castro-ph%2F0401049%2Castro-ph%2F0401448%2Castro-ph%2F0401207%2Castro-ph%2F0401417%2Castro-ph%2F0401497%2Castro-ph%2F0401592%2Castro-ph%2F0401251%2Castro-ph%2F0401048%2Castro-ph%2F0401346%2Castro-ph%2F0401611%2Castro-ph%2F0401340%2Castro-ph%2F0401218%2Castro-ph%2F0401569%2Castro-ph%2F0401471%2Castro-ph%2F0401437%2Castro-ph%2F0401489%2Castro-ph%2F0401424%2Castro-ph%2F0401584%2Castro-ph%2F0401492%2Castro-ph%2F0401213%2Castro-ph%2F0401538%2Castro-ph%2F0401505&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Despite centuries of close association, statistics and astronomy are\nsurprisingly distant today. Most observational astronomical research relies on\nan inadequate toolbox of methodological tools. Yet the needs are substantial:\nastronomy encounters sophisticated problems involving sampling theory, survival\nanalysis, multivariate classification and analysis, time series analysis,\nwavelet analysis, spatial point processes, nonlinear regression, bootstrap\nresampling and model selection. We review the recent resurgence of\nastrostatistical research, and outline new challenges raised by the emerging\nVirtual Observatory. Our essay ends with a list of research challenges and\ninfrastructure for astrostatistics in the coming decade."}, "authors": ["E. D. Feigelson", "G. J. Babu"], "author_detail": {"name": "G. J. Babu"}, "author": "G. J. Babu", "arxiv_comment": "Talk from PhyStat2003, Stanford, Ca, USA, September 2003, 7 pages.\n  PSN MOAT001", "links": [{"href": "http://arxiv.org/abs/astro-ph/0401404v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0401404v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0401404v1", "affiliation": "Statistics, Penn State", "arxiv_url": "http://arxiv.org/abs/astro-ph/0401404v1", "journal_reference": "ECONF C030908:MOAT001,2003", "doi": null, "fulltext": "PhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\n\nStatistical Challenges in Modern Astronomy\nE. D. Feigelson\nDepartment of Astronomy & Astrophysics, Penn State University, University Park PA 16802, USA\n\nG. J. Babu\n\narXiv:astro-ph/0401404v1 20 Jan 2004\n\nDepartment of Statistics, Penn State University, University Park PA 16802, USA\n\nDespite centuries of close association, statistics and astronomy are surprisingly distant today. Most observational\nastronomical research relies on an inadequate toolbox of methodological tools. Yet the needs are substantial:\nastronomy encounters sophisticated problems involving sampling theory, survival analysis, multivariate classification and analysis, time series analysis, wavelet analysis, spatial point processes, nonlinear regression, bootstrap\nresampling and model selection. We review the recent resurgence of astrostatistical research, and outline new\nchallenges raised by the emerging Virtual Observatory. Our essay ends with a list of research challenges and\ninfrastructure for astrostatistics in the coming decade.\n\n1. The glorious history of astronomy and\nstatistics\nAstronomy is perhaps the oldest observational science1 . The effort to understand the mysterious luminous objects in the sky has been an important element\nof human culture for at least 104 years. Quantitative\nmeasurements of celestial phenomena were carried out\nby many ancient civilizations. The classical Greeks\nwere not active observers but were unusually creative\nin the applications of mathematical principles to astronomy. The geometric models of the Platonists with\ncrystalline spheres spinning around the static Earth\nwere elaborated in detail, and this model endured in\nEurope for 15 centuries. But it was another Greek\nnatural philosopher, Hipparchus, who made one of the\nfirst applications of mathematical principles that we\nnow consider to be in the realm of statistics. Finding\nscatter in Bablylonian measurements of the length of\na year, defined as the time between solstices, he took\nthe middle of the range – rather than the mean or\nmedian – for the best value.\nThis is but one of many discussions of statistical issues in the history of astronomy. Ptolemy estimated\nparameters of a non-linear cosmological model using a\nminimax goodness-of-fit method. Al-Biruni discussed\nthe dangers of propagating errors from inaccurate instruments and inattentive observers. While some Medieval scholars advised against the acquisition of repeated measurements, fearing that errors would compound rather than compensate for each other, the usefulnes of the mean to increase precision was demonstrated with great success by Tycho Brahe.\nDuring the 19th century, several elements of modern\nmathematical statistics were developed in the context\n\n1 The historical relationship between astronomy and statistics is described in references [15], [38] and elsewhere. Our\nAstrostatistics monograph gives more detail and contemporary\nexamples of astrostatistical problems [3].\n\nMOAT001\n\nof celestial mechanics, where the application of Newtonian theory to solar system phenomena gave astonishingly precise and self-consistent quantitative inferences. Legendre developed L2 least squares parameter estimation to model cometary orbits. The leastsquares method became an instant success in European astronomy and geodesy. Other astronomers and\nphysicists contributed to statistics: Huygens wrote a\nbook on probability in games of chance; Newton developed an interpolation procedure; Halley laid foundations of actuarial science; Quetelet worked on statistical approaches to social sciences; Bessel first used the\nconcept of \"probable error\"; and Airy wrote a volume\non the theory of errors.\nBut the two fields diverged in the late-19th and 20th\ncenturies. Astronomy leaped onto the advances of\nphysics – electromagnetism, thermodynamics, quantum mechanics and general relativity – to understand\nthe physical nature of stars, galaxies and the Universe\nas a whole. A subfield called \"statistical astronomy\"\nwas still present but concentrated on rather narrow issues involving star counts and Galactic structure [30].\nStatistics concentrated on analytical approaches. It\nfound its principle applications in social sciences, biometrical sciences and in practical industries (e.g., Sir\nR. A. Fisher's employment by the British agricultural\nservice).\n\n2. Statistical needs of astronomy today\nContemporary astronomy abounds in questions of\na statistical nature. In addition to exploratory data\nanalysis and simple heuristic (usually linear) modeling\ncommon in other fields, astronomers also often interpret data in terms of complicated non-linear models\nbased on deterministic astrophysical processes. The\nphenomena studied must obey known behaviors of\natomic and nuclear physics, gravitation and mechanics, thermodynamics and radiative processes, and so\nforth. 'Modeling' data may thus involves both the selection of a model family based on an astrophysical\n\n1\n\n\f2\n\nPhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\nunderstanding of the conditions under study, and a\nstatistical effort to find parameters for the specified\nmodel. A wide variety of issues thus arise:\n• Does an observed group of stars (or galaxies or\nmolecular clouds or γ-ray sources) constitute a\ntypical and unbiased sample of the vast underlying population of similar objects?\n• When and how should we divide/classify these\nobjects into 2, 3 or more subclasses?\n• What is the intrinsic physical relationship between two or more properties of a class of objects, especially when confounding variables or\nobservational selection effects are present?\n• How do we answer such questions in the presence\nof observations with measurements errors and\nflux limits?\n• When is a blip in a spectrum (or image or time\nseries) a real signal rather than a random event\nfrom Gaussian (or often Poissonian) noise or\nconfounding variables?\n• How do we interpret the vast range of temporally variable objects: periodic signals from\nrotating stars or orbiting extrasolar planets,\nstochastic signals from accreting neutron stars\nor black holes, explosive signals from magnetic\nreconnection flares or γ-ray bursts?\n• How do we model the points in 2, 3, ..., 6dimensional points representing photons in an\nimage, galaxies in the Universe, Galactic stars\nin phase space?\n• How do we quantify continuous structures seen\nin the sky such as the cosmic microwave\nbackground, the interstellar and intergalactic\ngaseous media?\n• How do we fit astronomical spectra to highly\nnon-linear astrophysical models based on atomic\nphysics and radiative processes, including confidence limits on the best-fit parameters?\nFrom a superficial examination of the astronomical\nliterature2 , we can show that such questions are very\ncommon today. Of ≃ 15, 000 refereed papers published annually, 1% have \"statistics\" or \"statistical\"\nin their title, 5% have \"statistics' in their abstract,\n10% treat time-variable objects, 5−10% (est.) present\n\n2 Such\nbibliometric\nmeasures\nare\neasily\naccomplished as the entire astronomical research literature\nis on-line (in full text at subscribing institutions)\nthrough the NASA-supported Astrophysics Data System,\nhttp://adsabs.harvard.edu/abstract service.html.\n\nMOAT001\n\nor analyze multivariate datasets, and 5 − 10% (est.)\nfit parametric models. Accounting for overlaps, we\nroughly estimate that around ≃ 3, 000 distinct studies\neach year require non-trivial statistical methodologies.\nRoughly 10% of these are principally involved with\nstatistical methods; indeed, some of these purport to\ndevelop new methods or improve on established ones.\n\n3. Astrostatistics today\nWe thus find that astronomy and astrophysics today\nrequires a vast range of statistical capabilities. In statistical jargon, it helps for astronomers to know something about: sampling theory, survival analysis with\ncensoring and truncation, measurement error models, multivariate classification and analysis, harmonic\nand autoregressive time series analysis, wavelet analysis, spatial point processes and continuous surfaces,\ndensity estimation, linear and non-linear regression,\nmodel selection, and bootstrap resampling. In some\ncases, astronomers need combinations of methodologies that have not yet been fully developed (§7 below).\nFaced with such a complex of challenges, mechanical exposure to a wider variety of techniques is a necessary but not sufficient prerequisite for high-quality\nstatistical analyses. Astronomers also need to be\nimbued with established principles of statistical inference; e.g., hypothesis testing and parameter estimation, nonparametric and parametric inference,\nBayesian and frequentist approaches, and the assumptions underlying and applicability conditions for any\ngiven statistical method.\nUnfortunately, we find that the majority of the\nthousands of astronomical studies requiring statistical analyses use a very limited set of classical methods. The most common tools used by astronomers\nare: Fourier transforms for temporal analysis (developed by Fourier in 1807), least squares regression\nand χ2 goodness-of-fit (Legendre in 1805, Pearson in\n1900, Fisher in 1924), the nonparametric KolmogorovSmirnov 1- and 2-sample nonparametric tests (Kolmogorov in 1933), and principal components analysis\nfor multivariate tables (Hotelling in 1936).\nEven traditional methods are often misused. Feigelson & Babu [9] found that astronomers use interchangeably up to 6 different fits for bivariate linear\nleast squares regression: ordinary least squares (OLS),\ninverse regression, orthogonal regression, major axis\nregression, the OLS mean, and the OLS bisector. Not\nonly did this lead to confusion in comparing studies\n(e.g., in measuring the expansion of the Universe via\nHubble's constant, Ho ), but astronomers did not realize that the confidence intervals on the fitted parameters can not be correctly estimated with standard analytical formulae. Similarly, Protassov et al. [24] found\nthat the majority of astronomical applications of the\n\n\fPhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\nF test, or more generally the likelihood ratio test, are\ninconsistent with asymptotic statistical theory.\nBut, while the average astronomical study is limited to often-improper usage of a limited repertoire\nof statistical methods, a significant tail of outliers are\nmuch more sophisticated. The maximization of likelihoods, often developed specially for the problem at\nhand, is perhaps the most common of these improvements. Bayesian approaches are also becoming increasingly in vogue.\nIn a number of cases, sometimes buried in technical appendices of observational papers, astronomers\nindependently develop statistical methods. Some of\nthese are rediscoveries of known procedures; for example, Avni et al. [2] and others recovered elements of\nsurvival analysis for treatments of left-censored data\narising from nondetections of known objects. Some\nare quite possibly mathematically incorrect; such as\nvarious revisions to χ2 for Poissonian data that assume the resulting statistic still follows the χ2 distribution. On rare occasions, truly new and correct\nmethods have emerged; for example, astrophysicist\nLynden-Bell [19] discovered the maximum-likelihood\nestimator for a randomly truncated dataset, for which\nthe theoretical validity was later established by statistician Woodroofe [31].\nA growing group of astronomers, recognizing the\npotential for new liaisons with the accomplishments of\nmodern statistics, have promoted astrostatistical innovation through cross-disciplinary meetings and collaborations. Fionn Murtagh, an applied mathematician at Queen's University (Belfast) with long experience in astronomy, and his colleagues have run conferences and authored many useful monographs (e.g.,\n[16], [17], [22] and [27]). We at Penn State have run a\nseries of Statistical Challenges in Modern Astronomy\nmeetings with both communities in attendance (e.g.,\n[3] and [10]). Alanna Connors has organized brief\nstatistics sessions at large astronomy meetings, and we\nhave organized brief astronomy sessions at large Joint\nStatistical meetings. We wrote a short volume called\nAstrostatistics [3] intended to familiarize scholars in\none discipline with relevant issues in the other discipline. Other series conferences are devoted to technical issues in astronomical data analysis but typically\nhave limited participation by statisticians. These include the dozen Astronomical Data Analysis Software\nand Systems (e.g., [23]), several Erice workshops on\nData Analysis in Astronomy (e.g., [8]), and the new\nSPIE Astronomical Data Analysis conferences (e.g.,\n[26]).\nMost importantly, several powerful astrostatistical\nresearch collaborations have emerged. At Harvard\nUniversity and the Smithsonian Astrophysical Observatory, David van Dyk worked with scientists at\nMOAT001\n\nthe Chandra3 X-ray Center on several issues, particularly Bayesian approaches to parametric modeling of spectra in light of complicated instrumental effects. At Carnegie Mellon University and the University of Pittsburgh, the Pittsburgh Computational\nAstrophysics group addressed several issues, such as\ndeveloping powerful techniques for multivariate classification of extremely large datasets and applying nonparametric regression methods to cosmology. Both\nof these groups involved academics, researchers and\ngraduate students from both fields working closely\nfor several years to achieve a critical mass of crossdisciplinary capabilities.\nOther astrostatistical collaborations must be mentioned. David Donoho (Statistics at Stanford University) works with Jeffrey Scargle (NASA Ames\nResearch Center) and others on applying advanced\nwavelet methods to astronomical problems. James\nBerger (Statistics at Duke University) has worked\nwith astronomers William Jefferys (University of\nTexas), Thomas Loredo (Cornell University), and\nAlanna Connors (Eureka Inc.) on Bayesian methodologies for astronomy. Bradley Efron (Statistics at\nStanford University) has worked with astrophysicist\nVehé Petrosian (also at Stanford) on survival methods for interpreting γ-ray bursts. Philip Stark (Statistics at University of California, Berkeley) has collaborated with solar physicists in the GON G program to\nimprove analysis of oscillations of the Sun (helioseismology). More such collaborations exist in the U.S.,\nEurope and elsewhere.\n\n4. The Virtual Observatory: A new\nimperative for astrostatistics\nA major new trend is emerging in observational astronomy with the production of huge, uniform, multivariate databases from specialized survey projects\nand telescopes4 . But they are heterogeneous in character, reside at widely dispersed locations, and accessed through different database systems. Examples\n\n3 The Chandra X-ray Observatory is one of NASA's Great\nObservatories. It was launched in 1999 with a total budget\naround $2 billion.\n4 An enormous collection of catalogs, and some of the underlying imaging and spectral databases, are already available on-line. Access to many catalogs is provided by Vizier\n(http://vizier.u-strasbg.fr). The NASA Extragalactic Database\n(NED, http://ned.ipac.caltech.edu), SIMBAD stellar database\n(http://simbad.u-strasbg.fr), and ADS (footnote 2) give integrated access to many catalogs and bibliographic information. Raw data are available from all U.S. space-based observatories; see, for example, the Multi-mission Archive at Space\nTelescope (MAST, http://archive.stsci.edu) and High Energy\nAstrophysics Science Archive Research Center (HEASARC,\nhttp://heasarc.gsfc.nasa.gov).\n\n3\n\n\f4\n\nPhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\ninclude:\n1. 108 − 109 -object catalogs of stars and stellar\nextragalactic objects (i.e., quasars). These include the all-sky photographic optical USNO-B1\ncatalog, the all-sky near-infrared 2MASS catalog, and the wide-field Sloan Digital Sky Survey\n(SDSS). Five to ten photometric values, each\nwith measured heteroscedastic measurement errors (i.e., different for each data point), are\navailable for each object.\n2. 105 − 106 -galaxy redshift catalogs from the 2degree Field (2dF) and SDSS spectroscopic surveys. The main goal is characterization of the\nhierarchical, nonlinear and anisotropic clustering of galaxies in a 3-dimensional space. But\nthe datasets also include spectra for each galaxy\neach with 103 independent measurements.\n3. 105 − 106 -source catalogs from various multiwavelength wide-field surveys such as the NRAO\nVery Large Array Sky Survey in one radio\nband, the InfraRed Astronomical Satellite Faint\nSource catalog in four infrared bands, the Hipparcos and Tycho catalogs of star distances and\nmotions, and the X-ray Multimirror Mission\nSerendipitous Source Catalogue in several X-ray\nbands now in progress. These catalogs are typically accompanied by large image libraries.\n4. 102 − 104 -object samples of well-characterized\npre-main sequence stars, binary stars, variable\nstars, pulsars, interstellar clouds and nebulae,\nnearby galaxies, active galactic nuclei, gammaray bursts and so forth. There are dozens of\nsuch samples with typically 10 − 20 catalogued\nproperties and often with accompanying 1-, 2or 3-dimensional images or spectra.\n5. Perhaps the most ambitious of such surveys\nis the planned Large-aperture Synoptic Survey\nTelescope (LSST) which will survey much of the\nentire optical sky every few nights. It is expected to generate raw databases in excess of 10\nPBy (petabyte) and catalogs with 1010 entries.\nAn international effort known as the Virtual Observatory (VO) is now underway to coordinate and\nfederate these diverse databases, making them readily accessible to the scientific user [6, 29]. Considerable progress is being made in the establishment of\nthe necessary data and metadata infrastructure and\nstandards, interoperability issues, data mining, and\ntechnology demonstration prototype services5 . But\n\n5 See\n\nhttp://www.ivoa.net and /http://us-vo.org for entry\ninto Virtual Observatory projects.\n\nMOAT001\n\nscientific discovery requires more than effective recovery and distribution of information. After the astronomer obtains the data of interest, tools are needed\nto explore the datasets. How do we identify correlations and anomalies within the datasets? How do\nwe classify the sources to isolate subpopulations of\nastrophysical interest? How do we use the data to\nconstrain astrophysical interpretation, which often involve highly non-linear parametric functions derived\nfrom fields such as physical cosmology, stellar structure or atomic physics? These questions lie under the\naegis of statistics.\nA particular problem relevant to statistical computing is that, while the speed of CPUs and the capacity of inexpensive hard disks rise rapidly, computer\nmemory capacities grow at a slower pace. Combining\nthe largest optical/near-infrared object catalogs today produces a table with > 1 billion objects and up\nto a dozen columns of photometric data. Such large\ndatasets effectively preclude use of all standard multivariate statistical packages and visualization tools\n(e.g., R and GGobi) which are generally designed\nto place the entire database into computer memory.\nEven sorting the data to produce quantiles may be\ncomputational infeasible.\nThe Virtual Observatory of the 21st century thus\npresents new challenges to statistical capability in two\nways. First, some new methodological developments\nare needed (§5). Second, efficient access to both new\nand well-established statistical methods are needed.\nNo single existing software package can provide the\nvast range of needed methods. We are now involved in\ndeveloping a prototype system called VOStat to provide statistical capabilities to the VO astronomer. It\nis based on concepts of Web services and distributed\nGrid computing. Here, the statistical software and\ncomputational resources, as well as the underlying empirical databases, may have heterogeneous structures\nand can reside at distant locations.\n\n5. Some grand methodological\nchallenges for the coming decade\nWhile it is risky to prognosticate the directions of\nfuture research, and judgments will always differ regarding the relative importance of research goals, we\ncan outline a few \"grand challenges\" for astrostatistical research for the next decade or two.\n\n5.1. Multivariate analysis with\nmeasurement errors and censoring\nTraditional multivariate analysis is designed mainly\nfor applications in the social and human sciences\nwhere the sources of variance are largely unknowable.\n\n\fPhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\nMeasurement errors are usually ignored, or are considered to be exogenous variables in the parametric\nmodels [12]. But astrophysicists often devote as much\neffort to precise determination of their errors as they\ndevote to the measurements of the quantities of interest. The instruments are carefully calibrated to\nreduce systematic uncertainties, and background levels and random fluctuations are carefully evaluated to\ndetermine random errors. Except in the simple case\nof bivariate regression [1, 5, 9], this information on\nmeasurement errors is usually squandered.\nWhile heteroscedastic measurement errors with\nknown variances is common in all physical sciences,\nonly astronomy frequently has nondetections when observations are made at new wavelengths of known objects. These are datapoints where the signal lies below (say) 3 times the noise level. Here again, modern statistics has insufficient tools. Survival analysis\nfor censored data assumes that the value below which\nthe data point must lie is known with infinite precision, rather than being generated from a distribution\nof noise. Astronomer Herman Marshall [20] makes an\ninteresting attempt to synthesize measurement errors\nand nondetections, but statistician Leon Gleser [14]\nargues that he has only recovered Fisher's failed theory of fiducial distributions. Addressing this issue in\na self-consistent statistical theory is a profound challenges that lies at the heart of interpreting the data\nastronomers obtain at the telescope.\n\n5.2. Statistical inference and\nvisualization with very-large-N datasets\nThe need for computational software for extremely\nlarge databases – multi-terabyte image and spectrum\nlibraries and multi-billion object catalogs – is discussed in section 4. A suite of approximate methods\nbased on flowing data streams or adaptive sampling of\nlarge datasets resident on hard disks should be sought.\nVisualization methods involving smoothing, multidimensional shading and variable transparency, should\nbe brought into the astronomer's toolbox. Here, considerable work is being conducted by computer scientists and applied mathematicians in other applied\nfields so that independent development by astrostatisticians might not be necessary to achieve certain goals.\n\n5.3. A cookbook for construction of\nlikelihoods and Bayesian computation\nWhile the concepts of likelihoods and their applications in maximum likelihood estimation, Bayes Theorem and Bayes factors are becoming increasingly wellknown in astronomical research, the applications to\nreal-life problems is still an art for the expert rather\nthan a tool for the masses. Part of the problem is\nMOAT001\n\nconceptual; astronomers need training in how to construct likelihoods for familiar parametric situations\n(e.g., power law distributions or a Poisson process).\nPart of the problem is computational; astronomers\nneed methods and software for the oft-complex computations. Many such methods, such as Markov chain\nMonte Carlo, are already well-established and can be\ndirectly adopted for astronomy [13]. For example, astronomers are often not fully aware of the broad applicability of the EM Algorithm for maximizing likelihoods [21]6 .\n\n5.4. Links between astrophysical theory\nand wavelets\nWavelet analysis has become a powerful and sophisticated tool for the study of features in data. Originally intended mainly for modelling time series, astronomers also use it increasingly for spatial analysis\nof images [11, 25]. In some ways it can be viewed as\na generalization of Fourier analysis in which the basis\nfunction need not be sinusoidal in shape and, most\nimportantly, the pattern need not extend over the entire dataset. Wavelets are thus effective in quantitatively describing complicated overlapping structures\non many scales, and can also be used for signal denoising and compression. In addition, wavelets have\na strong mathematical foundation.\nDespite its increasing popularity in astronomical\napplications, wavelet analysis suffers a profound limitation in comparison with Fourier analysis. A peak\nin a Fourier spectrum is immediately interpretable as\na vibrational, rotational or orbital rotation of solid\nbodies. A bump or a continuum slope in a wavelet\ndecomposition often has no analogous physically intuitive interpretation. We therefore recommend that\nastrophysicists seek links between physical theory – often involving continuous media such as turbulent plasmas in the interstellar medium and hierarchical structure formation in the early Universe – and wavelets.\nOne fascinating example is the demonstration that\nthe wavelet spectrum and Lyapunov exponent of the\nquasi-periodic X-ray emission from Sco X-1, which reflects the processes in an accretion disk around a neutron star, exhibit a transient chaotic behavior similar\nto that of water condensing and dripping onto an automobile windshield or a dripping handrail [32].\n\n6 The\n\nseminal study of the EM Algorithm is Dempster, Laird\n& Rubin in 1977 [7], which is one of the most frequently cited\npapers in statistics. However, the method was independently\nderived three years earlier by astronomer Leon Lucy [18] as an\n\"iterative technique for the rectification of observed distributions\" based on Bayes' Theorem. This study is widely cited in\nthe astronomical literature; its most frequent application is in\nimage deconvolution where it is known as the Lucy-Richardson\nalgorithm.\n\n5\n\n\f6\n\nPhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\n\n5.5. Time series models for\nastrophysical phenomena\nThe quasi-periodic oscillation of Sco X-1 is only\none of many examples of complex accretional behavior onto neutron stars and black holes seen in X-ray\nand γ-ray astronomy. The accreting Galactic black\nhole GRS 1915+105 exhibits a bewildering variety of\ndistinct states of stochastic, quasi-periodic and explosive behaviors. The prompt emission from gamma-ray\nbursts show a fantastic diversity of temporal behaviors from simple smooth fast-rise-exponential-decays\nto stochastic spiky profiles. Violent magnetic reconnection flares on the surfaces of the Sun and other\nmagnetically active stars also show complex behaviors. Many of these datasets are multivariate with\ntime series available in several spectral bands often\nshowing lags or hardness ratio variations of astrophysical interest.\nThere are also important astronomical endeavors\nwhich seek astrophysically interesting signals amidst\nthe oft-complex noise characteristics of the detectors.\nThe Arecibo, Parkes and VLA radio telescopes, for example, conduct searches for new radio pulsars or for\nextraterrestrial intelligences in nearby planetary systems. The Laser Interferometer Gravitational-Wave\nObservatory (LIGO) and related detectors search for\nboth continuing periodic signals and brief bursts from\nperturbations in space-time predicted by Einstein's\nGeneral Relativity. Here the signals sought are orders\nof magnitude fainter than instrumental variations.\n\n6. Infrastructure needed to advance\nastrostatistics\nThe current quality of statistical analyses in astronomical research often begs for improvment. There is\nboth inadequate research on important new challenges\n(§5) and inadequate application of known advanced\nmethods to astronomical problems (§3). Astronomy\nclearly needs needs a strong and rapid surge of energy in statistical expertise. Three types of activities\nshould be promoted:\nCross-training\nIn the U.S., the typical curriculum leading to a career in astronomical research\nrequires zero or one course in statistics at the\nundergraduate level, and zero at the graduate\nlevel. Analogously, the curriculum of statisticians includes virtually no coursework in astronomy or other physical science. While statisticians can learn basics from \"Astronomy 101\"\ncourses given at all universities, the statistical\ntraining of astronomers is not as easily accomplished. New curricular products summarizing\nthe applicable statistical subfields, short training workshops for graduate students and young\nMOAT001\n\nscientists, and effective statistical consulting are\nall needed.\n\nIncreased collaborative research\nWhile several astrostatistical research groups are making exciting progress (§3), the total effort is\ntoo small to impact the bulk of astronomical\nresearch. Very roughly, astrostatistical funding is currently $1M of the $1B spent annually\non astronomical research. This fraction is far\nbelow that spent in biomedical or other nonphysical-science fields. Though top academic\nleaders of statistics have expressed great enthusiasm for astronomy and astrostatistics, we can\nnot pull them away from biostatistics and business applications without a major increase in\nfunding. We might seek, for example, 10 − 20\ncross-disciplinary research groups active at any\none time at the end of a decade's growth.\n\nStatistical software\nFor various policy and cultural reasons, astronomers rarely purchase the\nlarge commercial statistical software packages,\npreferring to write their own software as needs\narise. This approach has contributed to the\nnarrow methodological scope of astronomical research. Avenues for improving this situation are\nemerging. R is a large statistical software package with the flexible command-line interface preferred by astronomers that has recently emerged\n(http://www.r-project.org). A wide variety of\nspecialized packages and codes are also available\non-line (http://www.astro.psu.edu/statcodes).\nThe new Web services concept being developed\nwithin the context of a Virtual Observatory permits coordinated access to heterogeneous software developed specifically for astronomical applications.\n\nAt Penn State, we are in the early stages of developing a Center for Astrostatistics to help attain these\ngoals (http://www.astrostatistics.psu.edu). This is an\ninter-disciplinary Center to serve the astronomy and\nstatistics communities around the nation and worldwide, seeking to bring advances in statistics into the\ntoolbox of astronomy and astrophysics. The Center's\nWeb site will maintain the popular StatCodes, build\nan instructional library of R programs, coordinate\nwith the nascent VOStat Web service, and develop an\narchive of annotated links to selected statistical literature applicable to astronomy (and vice versa). The\nsite is also planned to include tutorial handbooks and\ncurricular products developed specifically for astrostatistical needs.\n\n\fPhyStat 2003: Statistical Problems in Particle Physics, Astrophysics, and Cosmology\n\nAcknowledgments\nWe thank the referee, Peter Shawhan (Caltech), for\nvery helpful improvements to the paper. This work\nwas supported by NSF grant DMS-0101360.\n\nReferences\n[1] Akritas, M. G. & Bershady, M. A. 1996, Astrophys. J. 470, 709\n[2] Avni, Y., Soltan, A., Tananbaum, H., &\nZamorani, G. 1980, Astrophys. J. 238, 800\n[3] Babu, G. J. & Feigelson, E. D. 1996, Astrostatistics, London, Chapman & Hall\n[4] G. J. Babu & Feigelson, E. D. 1997, Statistical\nChallenges in Modern Astronomy II, New York,\nSpringer\n[5] Boggs, P. T., Byrd, R. H. & Schnabel, R. B. 1987,\nSIAM J. Sci. Statist. Comput. 8, 1052\n[6] Brunner, R. J., Djorgovski, S. G. & Szalay, A. S.\n(eds.) 2001, Virtual Observatories of the Future,\nSan Francisco, Astron. Soc. Pacific\n[7] Dempster, A. P., Laird, N. M. & Rubin, D. B.\n1977, J. Roy. Statist. Soc. Ser. B, 39, 1\n[8] Di Gesu, V., Duff, M. J. B., Heck, A., Maccarone,\nM. C., Scarsi, L., & Zimmerman, H. U. 1997,\nData Analysis in Astronomy IV,\n[9] Feigelson, E. D. & Babu, G. J. 1992, Astrophys.\nJ. 397, 55\n[10] Feigelson, E. D. & Babu, G. J. 2003, Statistical Challenges in Modern Astronomy, New York,\nSpringer\n[11] Freeman, P. E., Kashyap, V., Rosner, R., &\nLamb, D. Q. 2002, Astrophys. J. Suppl., 138, 185\n[12] Fuller, W. A. 1987, Measurement Error Models,\nNew York, Wiley\n[13] Gelman, A., Carlin, J. B., Stern, H. S. & Rubin, D. B. 1995, Bayesian Data Analysis, London,\nChapman & Hall\n[14] Gleser, L. J. 1992, in Statistical Challenges in\nModern Astronomy (E. D. Feigelson & G. J.\nBabu, eds.), New York, Springer, 263\n\nMOAT001\n\n[15] Hald, A. 1990, A History of Probability and\nStatistics and Their Applications before 1750,\nNew York, Wiley\n[16] Heck, A. & Murtagh, F. 1993, Intelligent Information Retrieval: The Case of Astronomy and\nRelated Space Sciences, Dordrecht, Kluwer\n[17] Jaschek, C. & Murtagh, F. 1990, Errors, Bias and\nUncertainties in Astronomy, Cambridge, Cambridge Univ. Press\n[18] Lucy, L. B. 1974, Astron. J. 79, 745\n[19] Lynden-Bell, D. 1971, Mon. Not. Roy. Astro. Soc.\n155, 95\n[20] Marshall, H. L 1992, in Statistical Challenges\nin Modern Astronomy (E. D. Feigelson & G. J.\nBabu, eds.), New York, Springer, 247\n[21] McLachlan, G. J. & Krishnan, T. 1997, The EM\nAlgorithm and Extensions, New York, Wiley\n[22] Murtagh, F. & Heck, A. 1987, Multivariate Data\nAnalysis, Dordrecht, Reidel\n[23] Payne, H. E., Jedrzejewski, R. I., & Hook, R. N.\n2003, Astronomical Data Analysis Software and\nSystems, San Francisco, Astro. Soc. Pacific\n[24] Protassov, R., van Dyk, D. A., Connors, A.,\nKashyap, V. L., & Siemiginowska, A. 2002, Astrophys. J., 571, 545\n[25] Scargle, J. D. 1998, Astrophys. J., 504, 405\n[26] Starck, J.L. & Murtagh, F. (eds.) 2002, Astronomical Data Analysis II, Proc. SPIE, vol 4847\n[27] Starck, J.L. & Murtagh, F. 2003, Astronomical\nImage and Data Analysis, New York, Springer\n[28] Stigler, S. M. 1986, The History of Statistics: The\nMeasurement of Uncertainty before 1900, Cambridge, Harvard Univ. Press\n[29] Szalay, A. & Gray, J. 2001, Science, 293, 2037\n[30] Trumpler, R. J. & Weaver, H. A., 1953, Statistical\nAstronomy, Berkeley, Univ. of California Press\n[31] Woodroofe, M. 1985, Annals Statist. 13, 163\n[32] Young, K. & Scargle, J. D. 1996, Astrophys. J.,\n468, 617\n\n7\n\n\f"}