{"id": "http://arxiv.org/abs/astro-ph/0502115v1", "guidislink": true, "updated": "2005-02-05T00:47:26Z", "updated_parsed": [2005, 2, 5, 0, 47, 26, 5, 36, 0], "published": "2005-02-05T00:47:26Z", "published_parsed": [2005, 2, 5, 0, 47, 26, 5, 36, 0], "title": "Are quasar jets dominated by Poynting flux?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0502437%2Castro-ph%2F0502208%2Castro-ph%2F0502338%2Castro-ph%2F0502411%2Castro-ph%2F0502565%2Castro-ph%2F0502567%2Castro-ph%2F0502217%2Castro-ph%2F0502455%2Castro-ph%2F0502055%2Castro-ph%2F0502586%2Castro-ph%2F0502206%2Castro-ph%2F0502127%2Castro-ph%2F0502210%2Castro-ph%2F0502041%2Castro-ph%2F0502529%2Castro-ph%2F0502284%2Castro-ph%2F0502068%2Castro-ph%2F0502122%2Castro-ph%2F0502415%2Castro-ph%2F0502235%2Castro-ph%2F0502197%2Castro-ph%2F0502231%2Castro-ph%2F0502146%2Castro-ph%2F0502416%2Castro-ph%2F0502171%2Castro-ph%2F0502522%2Castro-ph%2F0502373%2Castro-ph%2F0502509%2Castro-ph%2F0502152%2Castro-ph%2F0502173%2Castro-ph%2F0502390%2Castro-ph%2F0502372%2Castro-ph%2F0502584%2Castro-ph%2F0502589%2Castro-ph%2F0502361%2Castro-ph%2F0502102%2Castro-ph%2F0502514%2Castro-ph%2F0502108%2Castro-ph%2F0502119%2Castro-ph%2F0502510%2Castro-ph%2F0502087%2Castro-ph%2F0502199%2Castro-ph%2F0502439%2Castro-ph%2F0502296%2Castro-ph%2F0502440%2Castro-ph%2F0502218%2Castro-ph%2F0502082%2Castro-ph%2F0502216%2Castro-ph%2F0502246%2Castro-ph%2F0502227%2Castro-ph%2F0502583%2Castro-ph%2F0502551%2Castro-ph%2F0502518%2Castro-ph%2F0502200%2Castro-ph%2F0502340%2Castro-ph%2F0502154%2Castro-ph%2F0502506%2Castro-ph%2F0502590%2Castro-ph%2F0502234%2Castro-ph%2F0502260%2Castro-ph%2F0502435%2Castro-ph%2F0502570%2Castro-ph%2F0502049%2Castro-ph%2F0502045%2Castro-ph%2F0502236%2Castro-ph%2F0502283%2Castro-ph%2F0502140%2Castro-ph%2F0502331%2Castro-ph%2F0502481%2Castro-ph%2F0502042%2Castro-ph%2F0502202%2Castro-ph%2F0502580%2Castro-ph%2F0502545%2Castro-ph%2F0502578%2Castro-ph%2F0502018%2Castro-ph%2F0502523%2Castro-ph%2F0502273%2Castro-ph%2F0502479%2Castro-ph%2F0502168%2Castro-ph%2F0502328%2Castro-ph%2F0502576%2Castro-ph%2F0502160%2Castro-ph%2F0502185%2Castro-ph%2F0502374%2Castro-ph%2F0502554%2Castro-ph%2F0502025%2Castro-ph%2F0502464%2Castro-ph%2F0502253%2Castro-ph%2F0502315%2Castro-ph%2F0502244%2Castro-ph%2F0502486%2Castro-ph%2F0502305%2Castro-ph%2F0502544%2Castro-ph%2F0502571%2Castro-ph%2F0502516%2Castro-ph%2F0502022%2Castro-ph%2F0502322%2Castro-ph%2F0502023%2Castro-ph%2F0502293%2Castro-ph%2F0502115%2Castro-ph%2F0502320&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Are quasar jets dominated by Poynting flux?"}, "summary": "The formation of relativistic astrophysical jets is presumably mediated by\nmagnetic fields threading accretion disks and central, rapidly rotating\nobjects. As it is accelerated by magnetic stresses, the jet's kinetic energy\nflux grows at the expense of its Poynting flux. However, it is unclear how\nefficient is the conversion from magnetic to kinetic energy and whether there\nare any observational signatures of this process. We address this issue in the\ncontext of jets in quasars. Using data from all spatial scales, we demonstrate\nthat in these objects the conversion from Poynting-flux-dominated to\nmatter-dominated jets is very likely to take place closer to the black hole\nthan the region where most of the Doppler boosted radiation observed in blazars\nis produced. We briefly discuss the possibility that blazar activity can be\ninduced by global MHD instabilities, e.g., via the production of localized\nvelocity gradients that lead to dissipative events such as shocks or magnetic\nreconnection, where acceleration of relativistic particles and production of\nnon-thermal flares is taking place.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0502437%2Castro-ph%2F0502208%2Castro-ph%2F0502338%2Castro-ph%2F0502411%2Castro-ph%2F0502565%2Castro-ph%2F0502567%2Castro-ph%2F0502217%2Castro-ph%2F0502455%2Castro-ph%2F0502055%2Castro-ph%2F0502586%2Castro-ph%2F0502206%2Castro-ph%2F0502127%2Castro-ph%2F0502210%2Castro-ph%2F0502041%2Castro-ph%2F0502529%2Castro-ph%2F0502284%2Castro-ph%2F0502068%2Castro-ph%2F0502122%2Castro-ph%2F0502415%2Castro-ph%2F0502235%2Castro-ph%2F0502197%2Castro-ph%2F0502231%2Castro-ph%2F0502146%2Castro-ph%2F0502416%2Castro-ph%2F0502171%2Castro-ph%2F0502522%2Castro-ph%2F0502373%2Castro-ph%2F0502509%2Castro-ph%2F0502152%2Castro-ph%2F0502173%2Castro-ph%2F0502390%2Castro-ph%2F0502372%2Castro-ph%2F0502584%2Castro-ph%2F0502589%2Castro-ph%2F0502361%2Castro-ph%2F0502102%2Castro-ph%2F0502514%2Castro-ph%2F0502108%2Castro-ph%2F0502119%2Castro-ph%2F0502510%2Castro-ph%2F0502087%2Castro-ph%2F0502199%2Castro-ph%2F0502439%2Castro-ph%2F0502296%2Castro-ph%2F0502440%2Castro-ph%2F0502218%2Castro-ph%2F0502082%2Castro-ph%2F0502216%2Castro-ph%2F0502246%2Castro-ph%2F0502227%2Castro-ph%2F0502583%2Castro-ph%2F0502551%2Castro-ph%2F0502518%2Castro-ph%2F0502200%2Castro-ph%2F0502340%2Castro-ph%2F0502154%2Castro-ph%2F0502506%2Castro-ph%2F0502590%2Castro-ph%2F0502234%2Castro-ph%2F0502260%2Castro-ph%2F0502435%2Castro-ph%2F0502570%2Castro-ph%2F0502049%2Castro-ph%2F0502045%2Castro-ph%2F0502236%2Castro-ph%2F0502283%2Castro-ph%2F0502140%2Castro-ph%2F0502331%2Castro-ph%2F0502481%2Castro-ph%2F0502042%2Castro-ph%2F0502202%2Castro-ph%2F0502580%2Castro-ph%2F0502545%2Castro-ph%2F0502578%2Castro-ph%2F0502018%2Castro-ph%2F0502523%2Castro-ph%2F0502273%2Castro-ph%2F0502479%2Castro-ph%2F0502168%2Castro-ph%2F0502328%2Castro-ph%2F0502576%2Castro-ph%2F0502160%2Castro-ph%2F0502185%2Castro-ph%2F0502374%2Castro-ph%2F0502554%2Castro-ph%2F0502025%2Castro-ph%2F0502464%2Castro-ph%2F0502253%2Castro-ph%2F0502315%2Castro-ph%2F0502244%2Castro-ph%2F0502486%2Castro-ph%2F0502305%2Castro-ph%2F0502544%2Castro-ph%2F0502571%2Castro-ph%2F0502516%2Castro-ph%2F0502022%2Castro-ph%2F0502322%2Castro-ph%2F0502023%2Castro-ph%2F0502293%2Castro-ph%2F0502115%2Castro-ph%2F0502320&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The formation of relativistic astrophysical jets is presumably mediated by\nmagnetic fields threading accretion disks and central, rapidly rotating\nobjects. As it is accelerated by magnetic stresses, the jet's kinetic energy\nflux grows at the expense of its Poynting flux. However, it is unclear how\nefficient is the conversion from magnetic to kinetic energy and whether there\nare any observational signatures of this process. We address this issue in the\ncontext of jets in quasars. Using data from all spatial scales, we demonstrate\nthat in these objects the conversion from Poynting-flux-dominated to\nmatter-dominated jets is very likely to take place closer to the black hole\nthan the region where most of the Doppler boosted radiation observed in blazars\nis produced. We briefly discuss the possibility that blazar activity can be\ninduced by global MHD instabilities, e.g., via the production of localized\nvelocity gradients that lead to dissipative events such as shocks or magnetic\nreconnection, where acceleration of relativistic particles and production of\nnon-thermal flares is taking place."}, "authors": ["Marek Sikora", "Mitchell C. Begelman", "Greg M. Madejski", "Jean-Pierre Lasota"], "author_detail": {"name": "Jean-Pierre Lasota"}, "author": "Jean-Pierre Lasota", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/429314", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0502115v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0502115v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted by the Astrophysical Journal", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0502115v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0502115v1", "journal_reference": "Astrophys.J. 625 (2005) 72-77", "doi": "10.1086/429314", "fulltext": "Are quasar jets dominated by Poynting flux?\nMarek Sikora1 , Mitchell C. Begelman2 , Greg M. Madejski3,5 , and Jean-Pierre Lasota4\n\narXiv:astro-ph/0502115v1 5 Feb 2005\n\nABSTRACT\nThe formation of relativistic astrophysical jets is presumably mediated by\nmagnetic fields threading accretion disks and central, rapidly rotating objects.\nAs it is accelerated by magnetic stresses, the jet's kinetic energy flux grows at\nthe expense of its Poynting flux. However, it is unclear how efficient is the conversion from magnetic to kinetic energy and whether there are any observational\nsignatures of this process. We address this issue in the context of jets in quasars.\nUsing data from all spatial scales, we demonstrate that in these objects the conversion from Poynting-flux-dominated to matter-dominated jets is very likely to\ntake place closer to the black hole than the region where most of the Doppler\nboosted radiation observed in blazars is produced. We briefly discuss the possibility that blazar activity can be induced by global MHD instabilities, e.g., via\nthe production of localized velocity gradients that lead to dissipative events such\nas shocks or magnetic reconnection, where acceleration of relativistic particles\nand production of non-thermal flares is taking place.\nSubject headings: quasars: jets - radiation mechanisms: non-thermal - MHD\n\n1.\n\nINTRODUCTION\n\nThe most promising scenario for launching astrophysical relativistic jets involves largescale magnetic fields anchored in rapidly rotating compact objects. The idea of driving\noutflows by rotating magnetic fields, originally invented by Weber and Davis (1967) to explain\nthe spindown of young stars, was successfully applied to pulsar winds (Michel 1969; Goldreich\n1\n\nNicolaus Copernicus Astronomical Center, Bartycka 18, 00-716 Warsaw, Poland; sikora@camk.edu.pl\n\n2\n\nJILA, University of Colorado, Boulder, CO 80309-0440, USA\n\n3\n\nStanford Linear Accelerator Center, 2575 Sand Hill Road, Menlo Park, CA 94025, USA\n\n4\n\nInstitut d'Astrophysique de Paris, 98bis boulevard Arago, 75014 Paris, France\n\n5\n\nKavli Institute for Particle Astrophysics and Cosmology, Stanford University, Stanford, CA 94305\n\n\f–2–\n& Julian 1970) and became a dominant mechanism in theories of relativistic jets in active\ngalactic nuclei (AGNs) (see, e.g., Phinney 1983; Camenzind 1986, 1987; Li, Chiueh, &\nBegelman 1992; Vlahakis & Königl 2004) and gamma-ray bursts (e.g., Thompson 1994;\nSpruit, Daigne, & Drenkhahn 2001; Vlahakis & Königl 2001). Powerful jets in quasars can be\npowered by innermost portions of an accretion disks and/or by rapidly rotating black holes.\nThey can become relativistic if the total to rest-mass energy flux ratio μ ≡ Lj /Ṁc2 ≫ 1,\nwhere Lj = LB +LK is the total energy flux, LB is the magnetic energy flux, LK = (Γ−1)Ṁ c2\nis the kinetic energy flux, and Ṁ is the mass loading rate.\nTheories of axisymmetric, steady-state ideal-MHD jets predict that the conversion process transforming electromagnetic energy into plasma kinetic energy works efficiently only\nup to the classical fast-magnetosonic surface, zf m , located at a few light cylinder-radii (Sakurai 1985; Li et al. 1992; Beskin, Kuznetsova, & Rafikov 1998). At this distance, the ratio\nof Poynting flux to kinetic energy flux, σ, drops to the value ∼ μ2/3 . This means that for\nμ ≫ 1 the flow still remains strongly Poynting flux-dominated at zf m . Whether and how fast\nthe conversion can proceed beyond this point is unclear, firstly because of theoretical and\nnumerical difficulties in treating the strongly nonlinear differential equation which combines\nthe evolution of the flow along the magnetic surfaces (Bernoulli equation) and the crossfield-force balance (Grad-Shafranov equation), and secondly because of the very uncertain\nboundary conditions at the base of the outflow and along the outermost magnetic surface\n(Begelman 1998; Heyvaerts & Norman 2003; Vlahakis & Königl 2003a, b).\nSignatures of the presence of dynamically strong, ordered magnetic fields have been\npursued observationally, by tracing magnetic field structure (using polarization information)\nand kinematics of kiloparsec- and parsec-scale jets and by studying morphology of extended\nradio sources. The results of these efforts are critically reviewed in §2. We demonstrate\nthat there is no convincing evidence for dynamically important magnetic fields in quasar jets\non scales larger than a few parsecs. In §3, we extend the above studies down to subparsec\nregions, by using multi-wavelength observations of blazars. In particular, the X- and γ-ray\ndata allow us to estimate the leptonic and total energy flux, which in turn provides an\nupper limit for the magnetic dominance and a lower limit for the pair content. Finally, in\n§4, we investigate constraints imposed on the jet dynamics by the lack of signatures of the\nbulk Compton radiation in the blazar spectra. Implications of our results for the global jet\ndynamics and for jet launching scenarios are discussed in §5.\n\n\f–3–\n2.\n\nMAGNETIC FIELDS IN RADIO JETS\n2.1.\n\nKiloparsec-scale jets\n\nArguments used in favor of the dynamical dominance of magnetic fields over large spatial scales include the high linear polarization of kiloparsec-scale jets, and the need for in\nsitu energy dissipation to provide the power for acceleration of fast-cooling ultra-relativistic\nelectrons/positrons responsible for synchrotron radiation in the optical band, and in some\nobjects also in the X-ray band (see, e.g., Lesch & Birk 1998; Birk & Lesch 2000). However,\nneither the energy dissipation nor the high polarization require large scale mean magnetic\nfields: energy can be dissipated in shocks and in boundary shear layers and high polarization can result from compression and stretching of initially tangled/turbulent magnetic fields\n(Laing 1980, 1981; Cawthorne et al. 1993). Furthermore, any large scale mean magnetic\nfields on parsec and larger scales are expected to be strongly dominated by the toroidal\ncomponent, even if they started as purely poloidal. This arises from the fact that due to\nconservation of the magnetic flux, the poloidal component drops with distance ∝ 1/r 2 , while\ndue to conservation of the magnetic energy flux, the toroidal component drops ∝ 1/r, where\nr is the distance in a conical jet (Begelman, Blandford, & Rees 1984). This is in contrast\nto inferences based on polarimetry of large-scale jets in FRII radio galaxies and quasars,\nwhich indicate a parallel magnetic field orientation (Bridle et al. 1994). Such magnetic\nfields can be generated by a dynamo in the turbulent shear layers (Urpin 2002). The turbulence, driven by a shear, can be also responsible for acceleration of relativistic electrons\nproducing nonthermal radiation in kiloparsec scale jets (Stawarz & Ostrowski 2002). Direct\nsupport for such a scenario is provided by measurements of intensity and polarization profiles across jets in a number of nearby FRII radiogalaxies (see Swain, Bridle, & Baum 1998,\nand references therein). There, the lack or deficit of radiation from the jet spine can result\nfrom the Doppler deboosting, because the flow in the jet spines can move faster than the\nflow in the boundary/shearing layers. Indeed, these spines are presumably the regions that\nproduce X-ray radiation seen in some large-scale quasar jets oriented at small angles to the\nline of sight. Models of this radiation predict jet Lorentz factors significantly larger than\nthose derived from the radio brightness asymmetries of jets and counter-jets (Tavecchio et\nal. 2004).\nThe hydrodynamical nature of large scale jets is also indicated by numerical simulations\nof their termination. As was demonstrated by Clarke, Norman, & Burns (1986) and Lind\net al. (1989) in the non-relativistic case, and by Komissarov (1999) in the relativistic case,\njets with strong toroidal magnetic components do not develop substantial back-flowing cocoons. Instead, the shocked jet plasma, being confined by magnetic stresses, forms a \"nose\ncone\"–shaped head. The cocoons observed in classical FR II radio sources do not appear\n\n\f–4–\nto have such nose-cones. They are broad and their morphologies agree very well with those\npredicted theoretically (Scheuer 1974; Begelman & Cioffi 1989) and confirmed via numerical\nsimulations for light, supersonic, unmagnetized jets. It should be noted, however, that all\nnumerical simulations of strongly magnetized jets have been performed assuming ideal MHD\nflows, whereas the current closure condition requires a large fraction of magnetic fields to\nbe resistively dissipated (Benford 1978; Lesch, Appl, & Camenzind 1989). Whether this can\nlead to formation of very compact hot spots observed in radio lobes remains very unclear,\nparticularly because no strong terminal shocks are expected to be produced by jets with\nσ > 1.\n\n2.2.\n\nParsec-scale jets\n\nAs was pointed out by Blandford (1993), the toroidal component of magnetic fields in\nPoynting flux-dominated jets can be indicated by gradients of the Faraday rotation across\nparsec-scale jets. Such gradients have been found in several BL Lac objects (Gabuzda,\nMurray, & Cronin 2004) and in quasar 3C273 (Asada et al. 2002). However, the quality\nof these data, particularly regarding 3C273, is still very poor due to limited resolution of\nthe transverse jet structure. And, as a strong counterexample, we refer to the only quasar\nfor which there is reasonably good transverse resolution, B1611+343. No Faraday rotation\ngradient is seen in this object (Zavala & Taylor 2003). Furthermore, Faraday rotation can\nbe produced in an external non-uniform medium, provided that such a medium is located in\nclose proximity to the jet as required by ∼ 1 year variations of the rotation measure in 3C\n273 and 3C 279 (Zavala & Taylor 2001). The external origin of Faraday rotation is strongly\nindicated by the fact that in most objects the rotation follows the λ2 -rule, where λ is the\nwavelength of the electromagnetic radiation (Gabuzda et al. 2004; Zavala & Taylor 2004).\nThat rule is followed even in objects with rotation exceeding 1 radian, which cannot be\nthe case if produced co-spatially with the radiation (Burn 1966; Gardner & Whiteoak 1966).\nFurthermore, observations of optically thick radio cores at different wavelengths indicate that\nposition of the polarization angle is the same at different synchrotron photospheres, which\nindicates that it doesn't depend on a distance from the center (Zavala & Taylor 2004). This\ncan be reconciled with theoretically predicted strong dependence of the rotation measure on\na distance in the laterally expanding jet (RM ∝ 1/r 2 for conical jets), only if the Faraday\ndepth of the parsec scale jets is negligible.\nArguments based on kinematics are also used in the literature to argue in favor of\nthe dynamical domination of the magnetic fields in parsec-scale jets. The detection of any\nsystematic acceleration of the flow would provide a strong argument for the conversion of\n\n\f–5–\nthe Poynting energy into kinetic energy. Homan et al. (2001) claim that such acceleration is\nindicated by VLBI observations of sources having multiple components with proper motion.\nThey point out that in such objects the innermost components are significantly slower than\nthe others. However, within the same sample of sources, the authors are not able to identify\nany clear case of individual components that are speeding up. Moreover, the above claims\nabout slower-moving innermost components seem to contradict the finding that there is\na systematic decrease in apparent velocity with increasing wavelength (Kellermann et al.\n2004). The simplest interpretation of this is that the observations at longer wavelengths\ncover more extended portions of the jet structure, and therefore that the radio components\ndecelerate, rather than accelerate. Alternatively, it is possible that a jet possesses a transverse\nstructure and that the central portions of the jet, which presumably move faster than the\nboundary layers, contribute more radiation at the shorter wavelengths. Noting also that\nsome jets appear curved, one shouldn't be surprised to see sometimes both increasing and\ndecreasing projected speeds (see, e.g., Jorstad et al. 2004). It should also be emphasized that\nif such sources are intrinsically expanding, their surface-brightness peaks do not represent\nthe real component centers and the apparent offset can change with time. In this case, one\nlearns little about the intrinsic kinematics of the source from the motion of the surfacebrightness-peak of the radio component. Furthermore, the features that appear as moving\non the VLBI scale may represent moving patterns, rather then the real flow speeds. This is\nclearly documented, for example, by observations of a parsec-scale jet in Mrk501. There, the\none-sidedness of the jet and the lack of superluminal motion of the VLBI features strongly\nsuggest that the the knots represent stationary or very slowly moving patterns, presumably\noblique shocks (Giroletti et al. 2004; Ghisellini, Tavecchio, & Chiaberge 2004). Finally,\neven if some apparent acceleration events are real, they are not necessarily related to the\nconversion of magnetic energy to kinetic energy. Acceleration events can be produced also\nin matter-dominated jets, e.g., at the expense of internal energy dissipated in shocks and\npartially returned to the flow, or due to the collision of the flow with an external cloud. Given\nthe above, we regard as somewhat premature the claims that two \"accelerating\" individual\nfeatures, in 3C 279 (Piner et al. 2003) and 3C 345 (Unwin et al. 1997; Lobanov & Zensus\n1999), respectively, prove the magnetic domination of parsec-scale jets in these objects as\nasserted e.g. by (Vlahakis & Königl 2004).\nAnother approach to studying the dynamics of a jet is based on comparing its surface\nbrightness distribution with that of its counterjet. This method was applied by Sudou et al.\n(2002) to the parsec-scale two-sided jet in the radio galaxy NGC 6251. They found that the\njet–to–counterjet intensity ratio increases with distance from the center and using these data\nderived the acceleration of the flow, with v ≃ 0.13c at a distance r ≃ 0.53pc and v ≃ 0.42c\nat r ≃ 1pc. However, the reality of the counterjet detection in NGC 6251 is questioned by\n\n\f–6–\nJones & Wehrle (2002). In particular, they did not confirm the presence of the conterjet at\n15 GHz, the frequency at which their observations had a similar angular resolution to those\nby Sudou et al. (2002).\nBoth methods, involving the jet/counterjet brightness ratio and the apparent speed of\nthe radio-emitting features, have been used by Cotton et al. (1999) to derive the dynamics\nof a parsec-scale jet in radio galaxy NGC 315. They infer an acceleration from 0.77c at a\ndistance 3.3 pc to 0.95c at a distance 9.5 pc. However, as the authors point out, the present\ndata are insufficient to determine whether the observed emission is from the main body of a\njet or from its slower outer layers.\n\n3.\n3.1.\n\nSTRUCTURE OF \"BLAZAR JETS\"\n\nPolarization properties and dissipative events\n\nShort variability timescales - of the order of 1 week in the optical band and similar or\neven shorter with larger amplitudes in the γ-ray band (von Montigny et al. 1995; Mukherjee\net al. 1997) - show that most of the non-thermal radiation from blazars is produced in a\nregion with a size R ≤ 1017 (tf l /3 days)(Γ/15) cm, too compact to be transparent in the radio\nband (Sikora et al. 1994). Such a compactness, combined with the transparency of blazars\nto high-energy γ-rays and the lack of γ-radiation from the radio lobe-dominated quasars,\nimplies that most of the high-energy radiation from blazars originates in well-collimated and\nrelativistic (sub)parsec-scale jets.\nPolarimetry measurements of the variable optical, infrared and mm radiation suggest\nthat at subparsec distances, magnetic fields are dominated by the transverse component\n(Impey, Lawrence, & Tapia 1991; Gabuzda & Sitko 1994; Cawthorne & Gabuzda 1996;\nStevens, Robson, & Holland 1996; Nartallo et al. 1998). Such an orientation is consistent\nwith a toroidal magnetic field geometry, but can also result from compression of a tangled\nmagnetic field in transverse internal shocks. The internal shocks have been proposed to result\nfrom collisions between velocity inhomogeneities propagating down a matter-dominated jet\n(Sikora et al. 1994; Spada et al. 2001). The internal shock scenario seems to be supported\nby the very broad energy distributions of relativistic electrons/positrons. They cover 3-4\ndecades in energy and are injected with approximately equal amounts of energy per decade\n(Moderski et al. 2003). This contrasts strongly with the narrow energy distributions of\naccelerated electrons predicted by the magnetic reconnection models (Zenitani & Hoshino\n2001; Larrabee, Lovelace, & Romanova 2003). However, it should be emphasized here that\nacceleration mechanisms for electrons/positrons still await quantitative theories, with regard\n\n\f–7–\nto both reconnection and shock scenarios, if the inertia of the matter is dominated by protons.\n\n3.2.\n\nLeptonic flux\n\nShortly after the discovery of variable and strong γ-rays from blazars by the Compton\nGamma-Ray Observatory (CGRO), it was realized that the exceptionally high γ-ray luminosities of quasar-hosted blazars can result from Comptonization of external radiation fields\nby ultra-relativistic electrons/positrons injected in sub-parsec scale jets propagating with\na bulk Lorentz factor Γ ∼ 10 − 20 (Dermer, Schlickeiser & Mastichiadis 1992; Dermer &\nSchlickeiser 1993; Sikora, Begelman, & Rees 1994; Blandford & Levinson 1995). Indeed,\nthe data collected during the entire period of the CGRO mission strongly support this idea.\nAll main features of the high-energy spectra of blazars during γ-ray flares can be explained\nnaturally in terms of the external-radiation-Compton (ERC) model (Moderski, Sikora, &\nBlażejowski 2003). In particular, the distances at which short-duration flares are produced,\ninferred from their variability time-scales (tf l ) to be zf l ≃ ctf l Γ2 ≃ 1.7 × 1018 (tf l /3d)(Γ/15)2\ncm, agree with the distance estimates obtained assuming that high-energy spectra of blazar\nflares are produced by Comptonization of broad emission lines and that the spectral break\nbetween the hard X-ray and soft γ-ray spectral ranges, observed in the 1 – 30 MeV range,\nis due to cooling effects.\nSpectra below the break are hard, with a power-law index of the energy flux, Fν−α , in\nthe range 0.3 ≤ α ≤ 0.8 (Reeves & Turner 2000; Donato et al. 2001; Giommi et al. 2002).\nIn the mid/soft X-ray bands the spectra often soften, presumably due to the contribution\nfrom the synchrotron-self-Compton (SSC) component (Sikora et al. 1994; Kubo et al. 1998).\nHowever, there are several blazars for which the spectra are well-fit by a single, very hard\npower-law function over all X-ray bands (Tavecchio et al. 2000). These objects provide an\nexceptional opportunity to study the energy distribution of relativistic electrons/positrons\ndown to their lowest energies. (Note that the radiation by such electrons cannot be detected\nin the synchrotron and SSC spectral components, in the former because of synchrotron-selfabsorption, in the latter because the low-energy tail of the SSC spectrum is hidden by the\nsynchrotron component.) If X-rays in these blazars are indeed produced by Comptonization\nof broad emission line light, then the X-ray spectra provide evidence that there is no lowenergy cutoff in the energy distribution down to mildly relativistic energies.\nSince even the hardest X-ray spectra in blazars have radiation energy indices α > 0,\nthe total number of electrons and positrons involved in an outburst, Ne , is well determined\nby soft/mid X-ray observations. This is because, for a number distribution Nγ ∝ γ −s , with\nR\ns = 2α + 1 > 1, Ne = γmin Nγ dγ is insensitive to the upper limit of the integral and the\n\n\f–8–\ndetails of the particle distribution at higher energies. The most stringent limit on the particle\ncontent of the jet arises from considerations of the bulk-Compton radiation, where the \"cold\"\nelectrons carried along in the jet Compton-upscatter the broad emission line photons. For an\napparent luminosity νsx Lνsx , determined at hνsx = hν(γmin ∼ 1) ∼ 2 keV(Γ/15)2(hνdif f /10\neV ), one finds that the electron number flux is (Sikora & Madejski 2000)\nṄe ∼\n\nNe\nνsx Lνsx\n(νsx Lνsx )46\n∼\n∼ 1050\ns−1 ,\n6\n6\ntf l\ncσT uBEL tf l Γ\n(tf l /3d)(Γ/15)\n\n(1)\n\nwhere uBEL ≃ 3 × 10−3 erg cm−3 s−1 is the radiation energy density in the broad emission\nline region (Kaspi et al. 2000) and νsx Lνsx ≡ 1046 × (νsx Lνsx )46 erg s−1 .\nThe leptonic flux can be also estimated indirectly, using data from the γ-ray band\nwhere radiation is produced in the fast cooling regime. Assuming a single power-law electron\ninjection function, with γmin ∼ 1 and the index p = 2 corresponding to the high energy γ-ray\nspectrum slope αγ ≃ 1 (Pohl et al. 1997), we have (see Eq.12 in Moderski et al. 2004)\nṄe ∼ 1051\n\n(νLν )48 −1\ns ,\n(Γ/15)3\n\n(2)\n\nwhere (νLν )48 ≡ (νLν )/1048 erg s−1 is the apparent luminosity of the radiation produced at\nsome frequency in the fast cooling regime.\n\n3.3.\n\nEnergetics\n\nModeling of the observed high-energy spectra in blazars within the context of the ERC\nmodel gives the average energy of the accelerated electrons/positrons γ̄inj ∼ 10. Heating the\nplasma by such a factor requires the total energy flux prior to the dissipative event to be at\nleast γ̄inj times larger than\nLe = Ṅe me c2 Γ ≃ 1045 Ṅe,50 (Γ/15) erg s−1 .\n\n(3)\n\nIn principle, this energy could be provided by the bulk motion of electrons/positrons and\ndissipated via shocks formed due to interactions with the external medium. This, however,\nwould require the initial bulk Lorentz factor to be Γ0 ∼ γ̄inj Γ ∼ 150. Such a relativistic\ne+ e− -beam would produce a very strong spectral peak around Γ20 hνU V ∼ 200 keV due to\nCompton boosting of the external UV photons by a factor Γ20 . No such peaks have been\nobserved so far. In addition, electron/positron jets, even if they can be successfully produced\nwith Γ0 > 100, would be immediately decelerated down to Γ < 10 by radiation drag in the\ncompact central region (Phinney 1987; Sikora et al. 1996). The dissipative events cannot be\n\n\f–9–\npowered by internal shocks, either, if the flow consists purely of pair plasma. The internal\nshocks can be, at most, mildly relativistic, even for very large ratios of the bulk Lorentz\nfactors of the colliding inhomogeneities (Komissarov & Falle 1997; Moderski et al. 2004).\nTherefore, the acceleration of electrons/positrons to energies higher than γ̄e,inj ∼ 2 by shocks\nrequires the energy flux in the flow to be dominated by protons. Alternatively, if the energy\nflux in a jet is dominated by magnetic fields, the pairs can be accelerated at sites of magnetic\nfield reconnection. In both cases, the jet power can be estimated using the formula\nLj ≃\n\n(γ̄inj /10)Le,45\nγ̄inj Le\n∼ 1047\nerg s−1 ,\nηdiss ηe\n(ηdiss ηe /0.1)\n\n(4)\n\nwhere ηdiss is the efficiency of the energy dissipation in the blazar zone (the region where\nmost of the blazar radiation is produced) and ηe is the fraction of the dissipated energy\nconverted to relativistic electrons. Jet powers inferred from the energetics of radio lobes\nand hot spots cluster around 1046 erg s−1 (Rawlings & Saunders 1991; Willott et al. 1999;\nD'Elia, Padovani & Landt 2003; Maraschi & Tavecchio 2003). These estimates are mutually\nconsistent, considering that the latter value is time-averaged whereas the blazar energetics\nis determined from flares.\n\n3.4.\n\nPair content\n\nAssuming that the energy flux of protons Lp ≃ Ṅp mp c2 Γ is ≫ Le one can find that the\npair content of quasar jets is npairs /np = (ne /np − 1)/2, where\nne\nmp Le\n(ηdiss ηe /0.1)\nṄe\n=\n≡\n(1 + σ) ≃ 20(1 + σ)\n,\nnp\nme Lj\n(γ̄inj /10)\nṄp\n\n(5)\n\nwhere σ ≃ LB /Lp . The pair content is minimal for σ ≪ 1, with ne /np ∼ 20. In this case\nLp ≫ LB and the blazar dissipative events are likely to be dominated by internal shocks.\nFor LB > Lp , shocks cannot be sufficiently strong to provide efficient particle acceleration and, therefore, the dissipative events are more likely to originate via the reconnection of\nmagnetic field. Since the minimum kinetic energy flux is given by Le (cf. Eq. 3), jets which\nare most severely dominated by magnetic field would have, prior to the blazar dissipative\nzone, σ ≃ LB /Le ≃ 100Lj,47 /Le,45 . In these jets Lp < Le , i.e., np < (me /mp )ne . Such jets\nwould remain strongly Poynting-flux-dominated even after passing through the dissipative\nblazar zone, with σ ≃ 10Lj,47 /[(γ̄inj /10)Le,45 ].\n\n\f– 10 –\n4.\n\nWITHIN THE FIRST 103 − 104 GRAVITATIONAL RADII\n4.1.\n\nBulk-Compton radiation\n\nAnother interesting constraint provided by blazar observations concerns the efficiency\nof the jet acceleration process. Electrons/positrons, dragged through the very central region\nby protons and/or magnetic fields with bulk Lorentz factor Γ ≥ 5, would Comptonize the\ndirect radiation from the accretion disk, producing a strong soft X-ray bump (Begelman &\nSikora 1987; Sikora & Madejski 2000), or, in the case of a non-stationary flow, soft X-ray\nprecursors of the non-thermal flares (Moderski et al. 2004). The absence of such features in\nblazar spectra indicates that the acceleration of jets up to Γ ≥ 10 must take at least ∼ 103\ngravitational radii.\n\n4.2.\n\nThe conversion distance\n\nIf blazar activity is related to the internal shocks formed in unsteady, matter-dominated\njets, the efficient energy dissipation and particle acceleration imply σ ≪ 1. This means that\nthe magnetic-to-kinetic energy conversion of the flow should take place within a distance\nzf l ∼ (tf l /3d)(Γ/15)2 pc. Is this achievable by an ideal MHD flow? In some circumstances,\nacceleration by the magnetic nozzle effect can work: this can give Γ/Γf m ∼ ln(z/zf m ), where\nΓf m ∼ μ1/3 is the Lorentz factor at the fast magnetosonic surface located at a distance zf m ∼\nμ2/3 zc , and zc is the distance at which a given magnetic flux tube crosses the corresponding\nlight-cylinder (Li et al. 1992; Begelman & Li 1994; Beskin, Kuznetsova, & Rafikov 1998).\nFrom the assumption that in the blazar zone the jet is dynamically dominated by protons,\nwe have μ ≃ Lp /Ṁj c2 ≃ Γ and find that the jet conversion can eventually occur at a distance\nzconv ∼ zf m exp(Γ/Γf m ) ∼ (zc /30Rg )M9 pc .\n\n(6)\n\nThis result (zconv ∼ zf l ) may indicate a physical connection between the jet conversion\nprocess and dissipative processes responsible for flaring activity of blazars. Such an activity\nis likely to be induced by pinch and kink instabilities, developed in the phase when a jet is\nstill dominated by the Poynting flux (Eichler 1993; Begelman 1998). MHD instabilities can\ndifferentiate the flow speed and this in turn can lead to the formation of shocks. An advantage\nof such a scenario is that it avoids the need for modulation of the outflow by the central\nengine. Any modulation of powerful jets at the base would require strong instabilities in the\nmain body of the accretion disk (the corona is too tenuous to affect the jet dynamically)\nwhich in turn are very likely to produce rapid (∼ few days) and high amplitude variations\nof the UV-bump. However, no such variations are indicated by optical observations of\n\n\f– 11 –\nnuclei of radio lobe-dominated quasars (Stalin et al. 2004). (We would like to comment\nhere, that short term flaring activities are observed in blazars during both high states and\nlow states (see, e.g., Webb et al. 1990), and that small average amplitudes of short term\nvariations can result from contamination of flares by radiation from larger distances in a jet\nor from superposition of a varying number of flares observed at once. An important factor\ndetermining brightness of individual flares can be related to the non-axisymmetry of the\nkink instability, which may cause the matter involved in different dissipative events to move\nin somewhat different directions relative to the line of sight.)\nAlternatively, blazar activity can be directly related to magnetic energy dissipation\nprocesses, without involving shock formation. The largest uncertainty with this scenario is\nrelated to two questions: whether it can lead to acceleration of electrons with a very broad\nenergy distribution, as indicated by the blazar spectra; and whether in the acceleration sites\nthe magnetic field geometry is dominated by the transverse component, as indicated by the\nblazar polarimetry. Since the magnetic energy dissipation can involve fragmentation of long\ncurrent sheets into nonlinear smaller structures of all sizes, generation of broad power-law\nelectron spectra may be feasible, but an important question still remains: will enough of the\ntransverse magnetic field orientation persist in order to provide linear optical polarization,\nwhich in some objects can reach a value up to 20-40 % and is preferentially aligned with a\njet?\n\n5.\n\nDISCUSSION AND CONCLUSIONS\n\nAs it was demonstrated in §3, X-ray and γ-ray observations of blazars, combined with\nour best guesses regarding the central environments in quasars, allow us to estimate the\nleptonic and total energy fluxes. The former is found to be too small to power the observed\nγ-ray flares or to support the energetics of the radio lobes. Therefore, the energy flux in\nblazar jets must be dominated by protons or magnetic fields, but with the number of e+ e− pairs greatly exceeding the number of protons. In two extreme cases we have: (A) a proton\ndominated jet, with a leptonic content ne /np ∼ 20(ηdiss ηe /0.1)/(γ̄inj /10) (see Eq. 4); or (B)\na Poynting flux-dominated jet, with σ ≃ 10Lj,47 /[(γ̄inj /10)Le,45 ] and ne /np > mp /me .\nThe lack of soft X-ray excesses in blazar spectra, and of soft X-ray precursors to nonthermal flares in blazar light curves - both predicted to be produced by Comptonization\nof external radiation by cold electrons in a jet (see §4) - indicate that jet Lorentz factors\nare much smaller at distances from the black hole . 103 Rg ∼ 1017 cm than in the blazar\nzone. There is no convincing evidence that the jet acceleration continues on larger scales:\nsimilar bulk Lorentz factors to those deduced from blazar models are inferred in parsec scale\n\n\f– 12 –\njets (Jorstad et al. 2001), while bulk Lorentz factors deduced from modeling optical and\nX-ray production in kiloparsec-scale jets are at most comparable to the blazar values (see,\ne.g., Scarpa & Urry 2002; Tavecchio et al. 2004). Hence, kinematical data from all spatial\nscales and the lack of bulk Compton radiation suggest that the jet acceleration saturates\naround the blazar zone. In case (A) above, this implies that the conversion of Poynting flux\nto kinetic energy takes place near or within the blazar zone. In case (B), the jet should stay\nstrongly magnetically dominated over all scales.\nThe presence of hot spots - very compact features marking the abrupt termination\nof relativistic jets - as well as the polarimetry of kiloparsec scale jets, seem to favor large\nscale jets with σ < 1 and, therefore, case (A). This leads us to speculate that the strongly\nenhanced activity of the jet in the blazar zone may be related to the final stages of the\nconversion of a magnetically dominated jet to a kinetic energy-dominated jet. The dynamical\nevents in blazars such as flares can be driven by shocks, which are favored because of the\nresulting broad energy distribution of electrons. However, efficient dissipation and particle\nacceleration appear to require strong shocks, and, therefore, σ ≪ 1, and it is quite unlikely\nthat such σ can be reached within the blazar zone by an ideal MHD flow (Begelman &\nLi 1994). This difficulty can be overcome by postulating dissipative enhancement of the\nconversion process. The magnetic dissipation can be stimulated and amplified by kink and\npinch instabilities, which seem to be unavoidable ingredients of Poynting flux-dominated jets\n(Eichler 1993; Begelman 1998). Alternatively, one can consider a direct connection of the\nblazar activity with the magnetic dissipation events, provided they can result in production\nof electrons with a broad energy distribution. Since in this case the conversion to σ ≪ 1\nis not required, the jets may propagate to larger distances keeping toroidal magnetic fields\nclose to the equipartition value.\nIn both shock and magnetic dissipation scenario of blazar activity, inertia of the matter\nis dominated by protons and, therefore, the jet is very likely to be powered by an accretion\ndisk rather than the magnetosphere of a Kerr black hole. It can be loaded by protons\nevaporating from the disk surface or injected into the disk corona by magnetic eruptions,\nand enriched by pairs created by high energy photons produced in localized disk flares (Stern\net al. 1995), in the entire corona (Beloborodov 1999), or following interaction of the proto-jet\nwith the external radiation field (Sikora & Madejski 2000). Since for ne /np ≫ 1 the effective\nradiation pressure can be super-Eddington even for sub-Eddington accretion rates, the MHD\noutflow can be launched even for nearly vertical magnetic field lines, in contrast to the > 30\ndegree tilt required for magnetocentrifugal acceleration (Blandford & Payne 1982). In this\ncase, the outflow can be driven mainly by radiation pressure within the sub-Alfvenic region,\nwhile the main part of acceleration is provided by magnetic stresses in the super-Alfvenic\nregion and enhanced by dissipative processes supported by MHD instabilities.\n\n\f– 13 –\nIn summary, we conclude:\n• The kinetic energy flux of leptons, estimated from the emissivity of blazar events, is too\nsmall to support energetics of blazars and of radio lobes in quasars;\n• Studies of kinematics and dynamics of quasar jets indicate that their power on the parsecand kilo-parsec scales is likely dominated by protons, but the present data do not allow us\nto distinguish between the cases σ . 1 and σ ≪ 1;\n• Dynamical events associated with the blazar phenomenon and the lack of evidence for\nacceleration of jets beyond the blazar zone suggest that blazar activity can be related to the\nfinal stages of the conversion of initially Poynting flux dominated-jets into proton-dominated\njets. MHD instabilities may play a key role in this process;\n• Magnetic reconnection scenarios must be better understood and quantitative theories for\nthe acceleration of electrons in the presence of protons - both in shocks and in reconnection\nsites - are needed to determine the nature of dissipative events responsible for the blazar\nactivity;\n• Domination of the matter inertia by protons suggests that accretion disks have the primary\nrole in powering quasar jets. A large pair content - deduced from the emissivity and\nenergetics of blazar events and provided by high energy processes in the hot accretion disk\ncorona - guarantees launching of MHD outflow even in the case of nearly vertical magnetic\nfield lines.\n• As indicated by the lack of bulk-Compton features in the spectra of blazars, acceleration\nof a jet takes at least 103 gravitational radii.\nThis project was partially supported by Polish KBN grants 5 P03D 00221, PBZ-KBN054/P03/2001, by LEA Astro-PF grant and NSF grant AST-0307502, by Chandra grants\nno. GO1-2113X and GO4-5125X from NASA via Smithsonian Astrophysical Observatory,\nand by the Department of Energy contract to SLAC no. DE-AC3-76SF00515. M.S. thanks\nthe Fellows of JILA (Univ. of Colorado), SLAC (Stanford University), and IAP for their\nhospitality. JPL was supported in part by a grant from the CNRS GDR-PCHE.\n\nREFERENCES\nAsada, K., Imoue, M., Uchida, Y., et al. 2002, PASJ, 54, L39\nBeloborodov, A.M. 1999, MNRAS, 305, 181\n\n\f– 14 –\nBegelman, M.C. 1998, ApJ, 493, 291\nBegelman, M.C., Blandford, R.D., & Rees, M.J. 1984, Review of Modern Physics, 56, 255\nBegelman, M.C., & Cioffi, D.F. 1989, ApJ, 345, L21\nBegelman, M.C., & Li, Z.-Y. 1994, ApJ, 426, 269\nBegelman, M.C., & Sikora, M. 1987, ApJ, 322, 650\nBenford, G. 1978, MNRAS, 1978, 183\nBeskin, V.S., Kuznetsova, I.V., & Rafikov, R.R. 1998, MNRAS, 299, 341\nBirk, G.T., & Lesch, H. 2000, ApJ, 530, L77\nBlandford, R.D. 1993, in Astrophysical Jets (Cambridge University Press), 26\nBlandford, R.D., & Levinson, A. 1995, ApJ, 441, 79\nBlandford, R.D., & Payne, D.G. 1982, MNRAS, 199, 883\nBridle, A.H., Hough, D.H., Lonsdale, C.J., et al. 1994, AJ, 108, 766\nBurn, B.J. 1966, MNRAS, 133, 67\nCamenzind, M. 1986, A&A, 162, 32\nCamenzind, M. 1987, A&A, 184, 341\nCawthorne, T.V., & Gabuzda, D.C. 1996, MNRAS, 278, 861\nCawthorne, T.V., Wardle, J.F.C., Roberts, D.H., & Gabuzda, D.C. 1993, ApJ, 416, 519\nClarke, D.A., Norman, M.L., & Burns, J.O. 1986, ApJ, 311, L63\nCotton, W.D., Feretti, L., Giovannini, G., et al. 1999, ApJ, 519, 108\nD'Elia, V., Padovani, P., & Landt, H. 2003, MNRAS, 339, 1081\nDermer, C.D., & Schlickeiser, R. 1993, ApJ, 416, 458\nDermer, C.D., Schlickeiser, R., & Mastichiadis, A. 1992, A&A, 256, L27\nDonato, D., Ghisellini, G., Tagliaferri, G., & Fossati, G. 2001, A&A, 375, 739\nEichler, D. 1993, ApJ, 419, 111\n\n\f– 15 –\nGabuzda, D.C., Murray, É., & Cronin, P. 2004, MNRAS, 351, L89\nGabuzda, D.C., & Sitko, M.L. 1994, AJ, 107, 884\nGardner, F.F., & Whiteoak, J.B. 1966, ARA&A, 4, 245\nGhisellini, G., Tavecchio, F., & Chiaberge, M. 2004, A&A, in press (astro-ph/0406093)\nGiommi, P., Capalbi, M., Memola, E., et al. 2002, in Proc. \"Blazar Astrophysics with\nBeppoSAX and Other Observatories\", Eds. Giommi. P., Massaro, E., & Palumbo, G.\n(ESA-ESRIN), 63\nGiroletti, M., Giovannini, G., Feretti, L., et al. 2004, ApJ, 600, 127\nGoldreich, P., & Julian, W.H. 1970, ApJ, 160, 971\nHeyvaerts, J. & Norman, C. 2003, ApJ, 596, 1256\nHoman, D.C., Ojha, R., Wardle, J.F.C., et al. 2001, ApJ, 549, 840\nImpey, C.D., Lawrence, C.R., & Tapia, S. 1991, ApJ, 375, 46\nJones, D.L., & Wehrle, A.E. 2002, ApJ, 580, 114\nJorstad, S.G., Marscher, A.P., Lister, M.L., et al. 2004, ApJ, 127, 3115\nJorstad, S.G., Marscher, A.P., Mattox, J.R., et al. 2001, ApJS, 134, 181\nKaspi, S., Smith, P.S., Netzer, H., et al. 2000, ApJ, 533, 631\nKellermann, K.I., Lister, M.L., Homan, D.C., et al. 2004, ApJ, 609, 539\nKomissarov, S.S. 1999, MNRAS, 308, 1069\nKomissarov, S.S., & Falle, S.A.E.G. 1997, MNRAS, 288, 833\nKubo, H., et al. 1998, ApJ, 504, 693\nLaing, R.A. 1980, ApJ, 193, 439\nLaing, R.A. 1981, ApJ, 248, 87\nLarrabee, D.A., Lovelace, R.V.E., & Romanova, M.M. 2003, ApJ, 586, 72\nLesch, H., Appl, S., & Camenzind, M. 1989, A&A, 225,341\nLesch, H., & Birk, G.T. 1998, ApJ, 499, 167\n\n\f– 16 –\nLi, Z.-Y., Chiueh, T., & Begelman, M.C. 1992, ApJ, 394, 459\nLind, K.R., Payne, D.G., Meier, D.L., & Blandford, R.D. 1989, ApJ, 344, 89\nLobanov, A.P., & Zensus, J.A. 1999, ApJ, 521, 509\nMaraschi, L., & Tavecchio, F. 2003, ApJ, 593, 667\nMichel, F.C. 1969, ApJ, 158, 727\nModerski, R., Sikora, M., & Blażejowski, M. 2003, A&A, 406, 855\nModerski, R., Sikora, M., Madejski, G.M., & Kamae, T. 2004, ApJ, 611, 770\nMukherjee, R., Bertsch, D.L., Bloom, S.D., et al. 1997, ApJ, 490, 116\nNartallo, R., Gear, W.K., Murray, A.G., et al. 1998, MNRAS, 297, 667\nPhinney, E.S. 1983, Ph.D. thesis, University of Cambridge\nPhinney, E.S. 1987, in \"Superluminal Radio Sources,\" J.A. Zensus, & T.J. Pearson (eds.)\nCambridge Univ. Press, Cambridge, p.301\nPiner, B.G., Unwin, S.C., Wehrle, A.E., et al. 2003, ApJ, 588, 716\nRawlings, S., & Saunders, R. 1991, Nature, 349, 138\nReeves, J.N., & Turner, M.J.L. 2000, MNRAS, 316, 234\nSakurai, T. 1985, A&A, 152, 121\nScarpa, R., & Urry, C.M. 2002, NewAR, 46, 405\nScheuer, P.A.G. 1974, MNRAS, 166, 513\nSikora, M., Begelman, M.C., & Rees, M.J. 1994, ApJ, 421, 153\nSikora, M., & Madejski, G. M. 2000, ApJ, 534, 109\nSikora, M., Sol, H., Begelman, M.C., & Madejski, G.M. 1996, MNRAS, 280, 781\nSpada, M., Ghisellini, G., Lazzati, D., & Celotti, A. 2001, MNRAS, 325, 1559\nSpruit, H.C., Daigne, F., & Drenkhahn, G. 2001, A&A, 369, 694\nStalin, C.S., Gopal-Krishna, Sagal, R., & Wiita, P.J. 2004, MNRAS, 350, 175\n\n\f– 17 –\nStawarz, L., & Ostrowski, M. 2002, ApJ, 578, 763\nStern, B.E., Poutanen, J., Svensson, R., Sikora, M., & Begelman, M.C. 1995, ApJ, 449, L13\nStevens, J.A., Robson, E.I., & Holland, W.S. 1996, ApJ, 462, L23\nSudou, H., Taniguchi, Y., Ohyama, Y., et al. 2000, PASJ, 52, 989\nSwain, M.R., Bridle, A.H., & Baum S.A. 1998, ApJ, 507, L29\nTavecchio, F., Maraschi, L., Ghisellini, G., et al. 2000, ApJ, 543, 535\nTavecchio, F., Maraschi, L., Sambruna, R.M., et al. 2004, ApJ, 616, 64\nThompson, C. 1994, MNRAS, 270, 480\nThomson, R.C., Mackay, C.D., & Wright, A.E. 1993, Nature, 365, 133\nUnwin, S.C., Wehrle, A.E., Lobanov, A.P., et al. 1997, ApJ, 480, 596\nUrpin, V. 2002, Phys. Rev., E65, 026301\nVlahakis, N., & Königl, A. 2001, ApJ, 563, L129\nVlahakis, N., & Königl, A. 2003a, ApJ, 596, 1080\nVlahakis, N., & Königl, A. 2003b, ApJ, 596, 1104\nVlahakis, N., & Königl, A. 2004, ApJ, 605, 656\nvon Montigny, C., Bertsch, D.L., Chiang, J., et al. 1995, ApJ, 440, 525\nWebb, J.R., Carini, M.T., Clements, S., et al. 1990, AJ, 100, 1452\nWeber, E.J., & Davis, L., Jr. 1967, ApJ, 148, 217\nWillott, C.J., Rawlings, S., Blundell, K.M., & Lacy, M. 1999, MNRAS, 309, 1017\nZavala, R.T., & Taylor, G.B. 2001, ApJ, 550, L147\nZavala, R.T., & Taylor, G.B. 2003, ApJ, 589, 126\nZavala, R.T., & Taylor, G.B. 2004, ApJ, 612, 749\nZentani, S. Hoshino, M. 2001, ApJ, 562, L63\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f"}