{"id": "http://arxiv.org/abs/astro-ph/0301549v1", "guidislink": true, "updated": "2003-01-28T06:57:56Z", "updated_parsed": [2003, 1, 28, 6, 57, 56, 1, 28, 0], "published": "2003-01-28T06:57:56Z", "published_parsed": [2003, 1, 28, 6, 57, 56, 1, 28, 0], "title": "The Power Spectra of Two Classes of Long-duration Gamma-ray Bursts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0301146%2Castro-ph%2F0301041%2Castro-ph%2F0301102%2Castro-ph%2F0301616%2Castro-ph%2F0301086%2Castro-ph%2F0301291%2Castro-ph%2F0301352%2Castro-ph%2F0301181%2Castro-ph%2F0301411%2Castro-ph%2F0301059%2Castro-ph%2F0301005%2Castro-ph%2F0301487%2Castro-ph%2F0301232%2Castro-ph%2F0301031%2Castro-ph%2F0301480%2Castro-ph%2F0301046%2Castro-ph%2F0301621%2Castro-ph%2F0301520%2Castro-ph%2F0301631%2Castro-ph%2F0301159%2Castro-ph%2F0301620%2Castro-ph%2F0301526%2Castro-ph%2F0301202%2Castro-ph%2F0301556%2Castro-ph%2F0301655%2Castro-ph%2F0301043%2Castro-ph%2F0301300%2Castro-ph%2F0301003%2Castro-ph%2F0301140%2Castro-ph%2F0301037%2Castro-ph%2F0301277%2Castro-ph%2F0301190%2Castro-ph%2F0301517%2Castro-ph%2F0301174%2Castro-ph%2F0301344%2Castro-ph%2F0301582%2Castro-ph%2F0301605%2Castro-ph%2F0301594%2Castro-ph%2F0301656%2Castro-ph%2F0301414%2Castro-ph%2F0301121%2Castro-ph%2F0301346%2Castro-ph%2F0301612%2Castro-ph%2F0301145%2Castro-ph%2F0301440%2Castro-ph%2F0301549%2Castro-ph%2F0301335%2Castro-ph%2F0301319%2Castro-ph%2F0301412%2Castro-ph%2F0301295%2Castro-ph%2F0301296%2Castro-ph%2F0301113%2Castro-ph%2F0301242%2Castro-ph%2F0301169%2Castro-ph%2F0301015%2Castro-ph%2F0301198%2Castro-ph%2F0301208%2Castro-ph%2F0301006%2Castro-ph%2F0301590%2Castro-ph%2F0301503%2Castro-ph%2F0301441%2Castro-ph%2F0301338%2Castro-ph%2F0301536%2Castro-ph%2F0301638%2Castro-ph%2F0301457%2Castro-ph%2F0301372%2Castro-ph%2F0301018%2Castro-ph%2F0301149%2Castro-ph%2F0301397%2Castro-ph%2F0301160%2Castro-ph%2F0301280%2Castro-ph%2F0301542%2Castro-ph%2F0301020%2Castro-ph%2F0301165%2Castro-ph%2F0301596%2Castro-ph%2F0301021%2Castro-ph%2F0301508%2Castro-ph%2F0301420%2Castro-ph%2F0301497%2Castro-ph%2F0301153%2Castro-ph%2F0301083%2Castro-ph%2F0301527%2Castro-ph%2F0301435%2Castro-ph%2F0301273%2Castro-ph%2F0301082%2Castro-ph%2F0301261%2Castro-ph%2F0301410%2Castro-ph%2F0301396%2Castro-ph%2F0301367%2Castro-ph%2F0301383%2Castro-ph%2F0301546%2Castro-ph%2F0301054%2Castro-ph%2F0301118%2Castro-ph%2F0301045%2Castro-ph%2F0301184%2Castro-ph%2F0301458%2Castro-ph%2F0301564%2Castro-ph%2F0301124%2Castro-ph%2F0301592%2Castro-ph%2F0301565%2Castro-ph%2F0301361&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Power Spectra of Two Classes of Long-duration Gamma-ray Bursts"}, "summary": "We have studied the averaged power density spectra (PDSs) of two classes of\nlong-duration gamma-ray bursts in the recent classification by Balastegui et\nal.(2001) based on neural network analysis. Both PDSs follow a power law over a\nwide frequency range with approximately the same slope, which indicates that a\nprocess with a self-similar temporal property may underlie the emission\nmechanisms of both. The two classes of bursts are divided into groups according\nto their brightness and spectral hardness respectively and each group's PDS was\ncalculated; For both classes, the PDS is found to flatten both with increasing\nburst brightness and with increasing hardness.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0301146%2Castro-ph%2F0301041%2Castro-ph%2F0301102%2Castro-ph%2F0301616%2Castro-ph%2F0301086%2Castro-ph%2F0301291%2Castro-ph%2F0301352%2Castro-ph%2F0301181%2Castro-ph%2F0301411%2Castro-ph%2F0301059%2Castro-ph%2F0301005%2Castro-ph%2F0301487%2Castro-ph%2F0301232%2Castro-ph%2F0301031%2Castro-ph%2F0301480%2Castro-ph%2F0301046%2Castro-ph%2F0301621%2Castro-ph%2F0301520%2Castro-ph%2F0301631%2Castro-ph%2F0301159%2Castro-ph%2F0301620%2Castro-ph%2F0301526%2Castro-ph%2F0301202%2Castro-ph%2F0301556%2Castro-ph%2F0301655%2Castro-ph%2F0301043%2Castro-ph%2F0301300%2Castro-ph%2F0301003%2Castro-ph%2F0301140%2Castro-ph%2F0301037%2Castro-ph%2F0301277%2Castro-ph%2F0301190%2Castro-ph%2F0301517%2Castro-ph%2F0301174%2Castro-ph%2F0301344%2Castro-ph%2F0301582%2Castro-ph%2F0301605%2Castro-ph%2F0301594%2Castro-ph%2F0301656%2Castro-ph%2F0301414%2Castro-ph%2F0301121%2Castro-ph%2F0301346%2Castro-ph%2F0301612%2Castro-ph%2F0301145%2Castro-ph%2F0301440%2Castro-ph%2F0301549%2Castro-ph%2F0301335%2Castro-ph%2F0301319%2Castro-ph%2F0301412%2Castro-ph%2F0301295%2Castro-ph%2F0301296%2Castro-ph%2F0301113%2Castro-ph%2F0301242%2Castro-ph%2F0301169%2Castro-ph%2F0301015%2Castro-ph%2F0301198%2Castro-ph%2F0301208%2Castro-ph%2F0301006%2Castro-ph%2F0301590%2Castro-ph%2F0301503%2Castro-ph%2F0301441%2Castro-ph%2F0301338%2Castro-ph%2F0301536%2Castro-ph%2F0301638%2Castro-ph%2F0301457%2Castro-ph%2F0301372%2Castro-ph%2F0301018%2Castro-ph%2F0301149%2Castro-ph%2F0301397%2Castro-ph%2F0301160%2Castro-ph%2F0301280%2Castro-ph%2F0301542%2Castro-ph%2F0301020%2Castro-ph%2F0301165%2Castro-ph%2F0301596%2Castro-ph%2F0301021%2Castro-ph%2F0301508%2Castro-ph%2F0301420%2Castro-ph%2F0301497%2Castro-ph%2F0301153%2Castro-ph%2F0301083%2Castro-ph%2F0301527%2Castro-ph%2F0301435%2Castro-ph%2F0301273%2Castro-ph%2F0301082%2Castro-ph%2F0301261%2Castro-ph%2F0301410%2Castro-ph%2F0301396%2Castro-ph%2F0301367%2Castro-ph%2F0301383%2Castro-ph%2F0301546%2Castro-ph%2F0301054%2Castro-ph%2F0301118%2Castro-ph%2F0301045%2Castro-ph%2F0301184%2Castro-ph%2F0301458%2Castro-ph%2F0301564%2Castro-ph%2F0301124%2Castro-ph%2F0301592%2Castro-ph%2F0301565%2Castro-ph%2F0301361&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have studied the averaged power density spectra (PDSs) of two classes of\nlong-duration gamma-ray bursts in the recent classification by Balastegui et\nal.(2001) based on neural network analysis. Both PDSs follow a power law over a\nwide frequency range with approximately the same slope, which indicates that a\nprocess with a self-similar temporal property may underlie the emission\nmechanisms of both. The two classes of bursts are divided into groups according\nto their brightness and spectral hardness respectively and each group's PDS was\ncalculated; For both classes, the PDS is found to flatten both with increasing\nburst brightness and with increasing hardness."}, "authors": ["R. F. Shen", "L. M. Song"], "author_detail": {"name": "L. M. Song"}, "author": "L. M. Song", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0275-1062(03)00036-5", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0301549v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0301549v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 3 figures, a translated version from published in the Acta\n  Astronomica Sinica, to appear in the Chinese Astronomy & Astrophysics Vol.27,\n  Issue 1", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0301549v1", "affiliation": "Particle Astrophysics Center, Institute of High Energy Physics, Chinese Academy of Sciences", "arxiv_url": "http://arxiv.org/abs/astro-ph/0301549v1", "journal_reference": "2003, ChA&A, 27, 152", "doi": "10.1016/S0275-1062(03)00036-5", "fulltext": "arXiv:astro-ph/0301549v1 28 Jan 2003\n\nThe Power Spectra of Two Classes of\nLong-duration Gamma-ray Bursts\nSHEN Rong-feng SONG Li-ming\nParticle Astrophysics Center, Institute of High Energy Physics,\nChinese Academy of Sciences, Beijing, 100039\n\nAbstract\nWe have studied the averaged power density spectra (PDSs) of two classes of longduration gamma-ray bursts in the recent classification by Balastegui et al.(2001) based\non neural network analysis. Both PDSs follow a power law over a wide frequency range\nwith approximately the same slope, which indicates that a process with a self-similar\ntemporal property may underlie the emission mechanisms of both. The two classes\nof bursts are divided into groups according to their brightness and spectral hardness\nrespectively and each group's PDS was calculated; For both classes, the PDS is found\nto flatten both with increasing burst brightness and with increasing hardness.\n\nKey words:\n\nGamma rays: bursts- Gamma rays: theory\n\n1. INTRODUCTION\nGamma-Ray Bursts (GRB) are transient and violent phenomena in which an energy of\n∼ 1051 − 1053 ergs is released in a few seconds, in the form of γ rays. They were first\ndiscovered by the USA Vela satellite in 1967, but we still know very little about their\nnature. The BATSE (Burst and Transient Source Experiments) on board the Compton\nGamma- Ray Observatory (CGRO) of USA launched in 1991, has since observed over 2000\nGRBs. These bursts show a great diversity as regards duration, peak flux and form of the\nenergy spectrum, as well as time profile. This indicates that the process of GRB generation\nmay be very complex. Meanwhile, the time profiles are richly packed with information\non the GRB mechanism, and the study of their temporal properties is a valuable path to\ntheir understanding.\nBeloborodov et al.(1998, 2000) calculated the average Fourier power density spectrum\n(PDS) of some bright and long gamma-ray bursts. They found the average PDS follow\na power law over almost 2 decades of Fourier frequencies with two deviations (breaks),\none at the low frequency end and one at the high frequency end. The low frequency\nbreak is caused by the finite durations of the bursts, i.e., the \"window effect\"; the high\nfrequency break at 1∼2 Hz can be related to a typical time scale of 0.5∼1 s. Variabilities\ntaking place on time scales shorter than that either do not exist, or are suppressed by\n1\n\n\fN\nclass I\nclass II\nclass III\n\n100\n\n75\n\n50\n\n25\n\n0 −2\n10\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\nT90 (s)\n\nFigure 1: Duration distributions of the three-class classification from neural network analysis\n(from Balastegui et al.,2001)\nsome mechanism. Power-law fitting to the average PDS gives an index of -5/3, the same\nslope of the Kolmogorov spectrum describing velocity fluctuations in a turbulent medium.\nThese results suggest the presence of a physical process which is self-similar over a wide\nrange of time scales, possibly turbulence in magnetic field (Stern, 1999).\nA number of models have been proposed to explain the \"central engine\" of GRBs,\nmerger of two neutron stars, of a neutron star and a black hole, collapse of a massive star,\nrapidly spinning and strongly magnetized compact objects, phase transition of compact\nobjects, accretion onto massive black holes, and so on (Cheng & Lu, 2001). Do all GRBs\nhave the same origin and mechanism ? Or can they be divided into different classes\naccording to origin ? This is an attractive problem.\nThe best known classification is the classification into a short-duration class (T90 < 2 s)\nand a long-duration class (T90 > 2 s), T90 being the interval between the times of 5% and\n95% cumulative photon counts. The short bursts have harder energy spectra, and the long\nbursts, softer ones (as represented by the hardness ratio H32 ) (Kouveliotou et al., 1993).\nSome people tried a multivariate classification with the duration, hardness, brightness,\netc., as variates (e.g., Mukherjee et al., 1998, Balastegui et al., 2001). Balastegui et al.\n(2001) applied neural network analysis and divided 1599 bursts into 3 classes: Class I (531\nbursts) corresponds to the \"short\" class of the above classic classification, and Class II\n(341) and class III (727) together correspond to the \"long\" class. See Fig. 1. The authors\nsuggest that the two new classes of long bursts may correspond to different progenitors:\nClass II to mergers of two neutron stars, or a neutron star and a black hole; Class III to\ncollapse of massive stars.\nIn this paper, we try to analyze the results of Balastegui's classification as regards their\naverage PDS. Different from the bulk quantities of GRBs, the PDS can depict temporal\nproperties of the whole light curve, and may reflect information that is directly related\n2\n\n\fto the physical process of their generation. Therefore, a PDS investigation can serve as\nan independent test of the reclassification. Now, most of Class I have too short duration\nfor the Fourier PDS calculation; moreover, many lines of evidence point to the T90 <2 s\nbursts belonging to a different class of objects (Qin et al., 2000; Hakkila et al., 2000). So\nonly bursts of Class II and Class III are included in our investigation.\n\n2. CALCULATION OF AVERAGE PDS\nFor every individual burst, we use concatenated 64ms data summed over energy channel 2\n(50∼100 KeV) and channel 3 (100∼300 KeV), recorded by the LAD detectors of BATSE.\nThe average PDS is calculated according to the following procedure:\n(1) Select bright and long bursts. For dim bursts, the low signal to noise ratios will\nreduce the reliability of calculated results; and for bursts of too short durations, the\n\"window effect\" will severely distort the shape of the PDS. From Balastegui et al. (2001)'s\nsample, we therefore selected bursts with T90 > 10 s and with P1024 > 0.4 photons cm−2\ns−1 (P1024 is the peak flux recorded with 1024 ms time resolution, and is taken as a measure\nof the brightness).\n(2) Calculate the PDS of individual burst. First, the background is subtracted from\nthe light curve. We then calculate the Fourier transform of each light curve, using the\nstandard Fast Fourier Transform method. The power density at frequency f is the squared\namplitude of the Fourier transform at f . The power density of Poisson noise is equal to\nthe total photon count of the light curve including the background. We calculate the\nindividual Poisson noise power density and subtract it from the burst PDS.\n(3) Averaging of PDS. Normalization of the individual PDS is needed before the averaging. We use the peak-normalization procedure: we determine the peak count rate,\nCpeak [photons per 64 ms], with the background subtracted, and normalize the individual\n2\nPDS by Cpeak\n. The average PDS is then calculated by summing up the normalized PDSs\nand dividing by the number of bursts.\n\n3. RESULTS AND ANALYSIS\nThe resulting average PDSs of the two classes of bursts are plotted in Fig. 2. Both show\na power-law form, Pf ∝ f α , over a frequency range of more than one decade. There are\ndeviations (breaks) from the power-law at the low frequency end and the high frequency\nend. The high frequency end break for the Class II bursts is not well determined because\nof the small sample size. The locations of the low frequency break for the two classes\nare different, because they have different average burst durations. In the case of peaknormalization, a burst with a longer duration have a greater fluence, and consequently\ngives a larger Fourier power. Since the Class III objects have, on average, longer durations,\ntheir PDS curve consequently lies above that of the Class II objects, as is shown in Fig. 2.\nWe fitted the average PDSs of the two classes with the power law Pf ∝ f α using the\nχ2 fitting procedure. The fitting results are listed in Table 1; also listed are the average\n3\n\n\fFigure 2: The average PDSs for class II and class III from neural network analysis. The horizontal\ndashed lines show the averaged noise power density levels of two classes. The solid lines are the\npwer-law fits.\n\nvalues of the duration T90 , peak flux P1024 and hardness ratio H32 (defined as the fluence\nratio of of channel 3 to channel 2). The fact that the power-law index α of the average\nPDS decreases with the average burst brightness was found by Beloborodov et al.(2000),\nand this finding is confirmed by our results (see below). Because our sample includes a\ngreater number of dimmer bursts, the power-law index of our average PDS is less than\n-5/3.\nTable 1: The average PDSs for class II and class III from neural network analysis.\nClass Number ∗ T90 /s P1024 /ph cm−2 s−1\nII\n206\n28.9\n0.92\nIII\n650\n74.3\n4.28\n∗ T90 >10 s, P1024 >0.4 ph cm−2 s−1\n\nH32\n3.03\n3.15\n\nα\n-1.84\n-1.78\n\nWe divided the bursts of the two classes into groups of approximately the same size,\naccording to their peak fluxes (P1024 ) and to their hardness ratios (H32 ), respectively. For\neach group we calculated its average PDS, which in every case showed a power law form.\nTheir power-law indices α, are plotted against P1024 and H32 , in the two panels of Fig. 3.\nWe see that, for both Class II and Class III objects, the average PDS flattens both with\nincreasing peak brightness and with increasing hardness ratio.\nFlattening of the average PDS implies an increase of the components of short timescale variabilities. Now, GRBs are usually supposed to be at cosmological distances;\ndimmer bursts are more distant. Given that different (brightness) groups of bursts are\n4\n\n\fFigure 3: The average PDSs for groups of class II and class III from neural network analysis: α\nvs. P1024 and α vs. H32 . ⋄ - class II, △ - class III.\nat different cosmological distances, the question arises, could the decrease in α be caused\nby cosmological time dilation ? But time dilation stretches the entire light curve: for any\ngiven spectral structure its Fourier frequency is lowered by a factor independent of that\nfrequency. Therefore, if the PDS is a power-law, time dilation will not change its slope.\nWe therefore conclude that the increasing short time-scale variabilities, as indicated by\nthe flattening average PDS, reflects an evolution of temporal properties of some intrinsic\ndynamic process of the GRBs.\n\n4. DISCUSSION\nAs shown by our calculation, the two classes of long GRBs, in the new classification of\nBalastegui et al. (2001), do not show any notable difference as regards the shape and\nstructure of their average PDSs, except for some trivial differences between their fitted\npower-law indices. The power-law form of the average PDS indicates that a physical process which has self-similarity over a wide time-scale range may be at work in both two\nclasses. This process was supposed by some to be turbulence in magnetic field (Stern,\n1999). Many different models of the progenitors of GRBs can give rise to the required\n\"fire ball\"; Balastegui et al.(2001) even claimed that the three classes of GRBs in their\nclassification correspond to three kinds of progenitors. But our results about the average\nPDSs of the two long GRB classes calculated directly from the GRB light curves indicate\nthat the light curves are not sensitive to the progenitors, even if the two classes originate\nin different progenitors. It is probable that both classes undergo a phase of relativistic\nexpanding \"fire ball\", in which energy is dissipated via magnetic reconnection explosion\ncaused by turbulence (Stern, 1999). After the \"fire ball\" phase, information about the\nprogenitor is lost. On the other hand, if GRB light curves are supposed to contain information about the progenitor, since some theoretical models of GRBs do not essentially\nneed the \"fire ball\" phase, then our results reduces the probability that these long bursts\nhave different origins.\n5\n\n\fBeloborodov et al.(2000) and Pozanenko et al.(2000) found that the average PDS\nflattens with increasing burst brightness. Under the assumption of cosmological origin\nand a \"standard candle\", i.e., brighter bursts have smaller redshifts, and also assuming\nall bursts have the same mechanism, we saw that the redshift will not alter the shape of\nthe average PDS (section 3). We conclude that the trend of the average PDS flattening\nwith increasing brightness indicates that there exists an evolution of sources, at least an\nevolution in the temporal properties of the generation processes of GRBs.\nThe other trend of the average PDS flattening with increasing hardness ratios may\nbe associated with another observational fact - the pulses in the GRB's light curve are\nnarrower in higher energy channel (the pulse is a fundamental morphological entity of the\nGRB light curve) (Norris et al., 1996). Furthermore, Beloborodov et al.(2000) showed that\nthe average PDS gets flatter from energy channel 1 to channel 4. The trend we obtained\nthat the average PDS flattens with hardness ratios is consistent with their result.\nACKNOWLEDGEMENT The authors are grateful to Dr. Andreu Balastegui who\nhave provided detailed results of GRB classification using neural network analysis.\n\nReferences\n[1] Balastegui A, Ruiz-Lapuente P, Canal R. MNRAS, 2001, 328: 283-290\n[2] Beloborodov A M, Stern B E, Svensson R. Ap J, 1998, 508: L25-L28\n[3] Beloborodov A M, Stern B E, Svensson R. Ap J, 2000, 535: 158-166\n[4] Cheng K S, Lu T. Chin J Astron Astrophys,2001, 1(1): 1-20\n[5] Hakkila J, Haglin D J, Pendleton G N, et al. Ap J, 2000, 538: 165-180\n[6] Kouveliotou C, Meegan C A, Fishman G J, et al. Ap J, 1993, 413: L101-L104\n[7] Mukherjee S, Feigelson E D, Babu G J, et al. Ap J, 1998, 508: 314-327\n[8] Norris J P, Nemiroff R J, Bonnell J T, et al. Ap J, 1996, 459: 393-412\n[9] Pozanenko A S, Loznikov V M. Aperiodic properties of gamma-ray bursts. in: Kippen\nR M, Mallozi R S, Fishman G J, eds. Gamma-Ray Bursts: 5th Huntsville Symposium,\nAIP Conference Proceedings 526. New York: AIP, 2000. 220-224\n[10] Qin Y P, Xie G Z, Xue S J, et al. Publ Astron Soc Japan, 2000, 52: 759-761\n[11] Stern B. Relativistic outflows in gamma-ray bursts. in: Poutanen J, Svensson R, eds.\nHigh Energy Processes in Accreting Black Holes, ASP Conference Series 161. San\nFrancisco: ASP, 1999. 277-294\n\n6\n\n\f"}