{"id": "http://arxiv.org/abs/astro-ph/0611674v1", "guidislink": true, "updated": "2006-11-21T16:20:14Z", "updated_parsed": [2006, 11, 21, 16, 20, 14, 1, 325, 0], "published": "2006-11-21T16:20:14Z", "published_parsed": [2006, 11, 21, 16, 20, 14, 1, 325, 0], "title": "Jet-dominated advective systems of all mass scales", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0611177%2Castro-ph%2F0611465%2Castro-ph%2F0611017%2Castro-ph%2F0611713%2Castro-ph%2F0611609%2Castro-ph%2F0611527%2Castro-ph%2F0611379%2Castro-ph%2F0611516%2Castro-ph%2F0611951%2Castro-ph%2F0611778%2Castro-ph%2F0611559%2Castro-ph%2F0611637%2Castro-ph%2F0611264%2Castro-ph%2F0611495%2Castro-ph%2F0611279%2Castro-ph%2F0611174%2Castro-ph%2F0611835%2Castro-ph%2F0611727%2Castro-ph%2F0611915%2Castro-ph%2F0611823%2Castro-ph%2F0611734%2Castro-ph%2F0611816%2Castro-ph%2F0611334%2Castro-ph%2F0611912%2Castro-ph%2F0611666%2Castro-ph%2F0611496%2Castro-ph%2F0611929%2Castro-ph%2F0611654%2Castro-ph%2F0611856%2Castro-ph%2F0611515%2Castro-ph%2F0611022%2Castro-ph%2F0611288%2Castro-ph%2F0611817%2Castro-ph%2F0611039%2Castro-ph%2F0611619%2Castro-ph%2F0611927%2Castro-ph%2F0611744%2Castro-ph%2F0611753%2Castro-ph%2F0611275%2Castro-ph%2F0611674%2Castro-ph%2F0611540%2Castro-ph%2F0611123%2Castro-ph%2F0611818%2Castro-ph%2F0611335%2Castro-ph%2F0611931%2Castro-ph%2F0611827%2Castro-ph%2F0611301%2Castro-ph%2F0611544%2Castro-ph%2F0611135%2Castro-ph%2F0611326%2Castro-ph%2F0611161%2Castro-ph%2F0611254%2Castro-ph%2F0611548%2Castro-ph%2F0611913%2Castro-ph%2F0611145%2Castro-ph%2F0611487%2Castro-ph%2F0611370%2Castro-ph%2F0611363%2Castro-ph%2F0611888%2Castro-ph%2F0611643%2Castro-ph%2F0611376%2Castro-ph%2F0611863%2Castro-ph%2F0611840%2Castro-ph%2F0611575%2Castro-ph%2F0611163%2Castro-ph%2F0611894%2Castro-ph%2F0611667%2Castro-ph%2F0611697%2Castro-ph%2F0611175%2Castro-ph%2F0611707%2Castro-ph%2F0611402%2Castro-ph%2F0611767%2Castro-ph%2F0611417%2Castro-ph%2F0611322%2Castro-ph%2F0611092%2Castro-ph%2F0611633%2Castro-ph%2F0611111%2Castro-ph%2F0611100%2Castro-ph%2F0611411%2Castro-ph%2F0611247%2Castro-ph%2F0611682%2Castro-ph%2F0611239%2Castro-ph%2F0611064%2Castro-ph%2F0611119%2Castro-ph%2F0611368%2Castro-ph%2F0611673%2Castro-ph%2F0611290%2Castro-ph%2F0611178%2Castro-ph%2F0611920%2Castro-ph%2F0611864%2Castro-ph%2F0611030%2Castro-ph%2F0611053%2Castro-ph%2F0611257%2Castro-ph%2F0611271%2Castro-ph%2F0611140%2Castro-ph%2F0611230%2Castro-ph%2F0611012%2Castro-ph%2F0611541%2Castro-ph%2F0611130%2Castro-ph%2F0611306%2Castro-ph%2F0611011&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Jet-dominated advective systems of all mass scales"}, "summary": "We show that the radio emission of black hole (BH) and neutron star (NS)\nX-ray binaries (XRBs) follows the analytical prediction of a jet model where\nthe jet carries a constant fraction of the accretion power. The radio emission\ncan therefore be used as a tracer of the accretion rate. This measure is\nnormalised with efficiently radiating objects. As it is independent of the\nX-ray fluxes, the measure allows us to compare the accretion rate dependency of\nthe bolometric X-ray luminosity of BHs and NSs. For NSs, it scales linearly\nwith accretion rate while the scaling for BHs is quadratic - as expected for\ninefficient accretion flows. We find the same behaviour in AGN. This new\napproach uses the jet power to obtain the accretion rate. Thus, we know both\nthe jet power and the radiated power of an accreting BH. This allows us to show\nthat some accretion power is likely to be advected into the black hole, while\nthe jet power dominates over the bolometric luminosity of a hard state BH.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0611177%2Castro-ph%2F0611465%2Castro-ph%2F0611017%2Castro-ph%2F0611713%2Castro-ph%2F0611609%2Castro-ph%2F0611527%2Castro-ph%2F0611379%2Castro-ph%2F0611516%2Castro-ph%2F0611951%2Castro-ph%2F0611778%2Castro-ph%2F0611559%2Castro-ph%2F0611637%2Castro-ph%2F0611264%2Castro-ph%2F0611495%2Castro-ph%2F0611279%2Castro-ph%2F0611174%2Castro-ph%2F0611835%2Castro-ph%2F0611727%2Castro-ph%2F0611915%2Castro-ph%2F0611823%2Castro-ph%2F0611734%2Castro-ph%2F0611816%2Castro-ph%2F0611334%2Castro-ph%2F0611912%2Castro-ph%2F0611666%2Castro-ph%2F0611496%2Castro-ph%2F0611929%2Castro-ph%2F0611654%2Castro-ph%2F0611856%2Castro-ph%2F0611515%2Castro-ph%2F0611022%2Castro-ph%2F0611288%2Castro-ph%2F0611817%2Castro-ph%2F0611039%2Castro-ph%2F0611619%2Castro-ph%2F0611927%2Castro-ph%2F0611744%2Castro-ph%2F0611753%2Castro-ph%2F0611275%2Castro-ph%2F0611674%2Castro-ph%2F0611540%2Castro-ph%2F0611123%2Castro-ph%2F0611818%2Castro-ph%2F0611335%2Castro-ph%2F0611931%2Castro-ph%2F0611827%2Castro-ph%2F0611301%2Castro-ph%2F0611544%2Castro-ph%2F0611135%2Castro-ph%2F0611326%2Castro-ph%2F0611161%2Castro-ph%2F0611254%2Castro-ph%2F0611548%2Castro-ph%2F0611913%2Castro-ph%2F0611145%2Castro-ph%2F0611487%2Castro-ph%2F0611370%2Castro-ph%2F0611363%2Castro-ph%2F0611888%2Castro-ph%2F0611643%2Castro-ph%2F0611376%2Castro-ph%2F0611863%2Castro-ph%2F0611840%2Castro-ph%2F0611575%2Castro-ph%2F0611163%2Castro-ph%2F0611894%2Castro-ph%2F0611667%2Castro-ph%2F0611697%2Castro-ph%2F0611175%2Castro-ph%2F0611707%2Castro-ph%2F0611402%2Castro-ph%2F0611767%2Castro-ph%2F0611417%2Castro-ph%2F0611322%2Castro-ph%2F0611092%2Castro-ph%2F0611633%2Castro-ph%2F0611111%2Castro-ph%2F0611100%2Castro-ph%2F0611411%2Castro-ph%2F0611247%2Castro-ph%2F0611682%2Castro-ph%2F0611239%2Castro-ph%2F0611064%2Castro-ph%2F0611119%2Castro-ph%2F0611368%2Castro-ph%2F0611673%2Castro-ph%2F0611290%2Castro-ph%2F0611178%2Castro-ph%2F0611920%2Castro-ph%2F0611864%2Castro-ph%2F0611030%2Castro-ph%2F0611053%2Castro-ph%2F0611257%2Castro-ph%2F0611271%2Castro-ph%2F0611140%2Castro-ph%2F0611230%2Castro-ph%2F0611012%2Castro-ph%2F0611541%2Castro-ph%2F0611130%2Castro-ph%2F0611306%2Castro-ph%2F0611011&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that the radio emission of black hole (BH) and neutron star (NS)\nX-ray binaries (XRBs) follows the analytical prediction of a jet model where\nthe jet carries a constant fraction of the accretion power. The radio emission\ncan therefore be used as a tracer of the accretion rate. This measure is\nnormalised with efficiently radiating objects. As it is independent of the\nX-ray fluxes, the measure allows us to compare the accretion rate dependency of\nthe bolometric X-ray luminosity of BHs and NSs. For NSs, it scales linearly\nwith accretion rate while the scaling for BHs is quadratic - as expected for\ninefficient accretion flows. We find the same behaviour in AGN. This new\napproach uses the jet power to obtain the accretion rate. Thus, we know both\nthe jet power and the radiated power of an accreting BH. This allows us to show\nthat some accretion power is likely to be advected into the black hole, while\nthe jet power dominates over the bolometric luminosity of a hard state BH."}, "authors": ["Elmar Koerding", "Rob Fender"], "author_detail": {"name": "Rob Fender"}, "author": "Rob Fender", "arxiv_comment": "conference proceedings of the Sixth Microquasar workshop:\n  Microquasars and Beyond, 18-22 September 2006 in Como, Italy (eds: T. Belloni\n  et al. 2006)", "links": [{"href": "http://arxiv.org/abs/astro-ph/0611674v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0611674v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0611674v1", "affiliation": "Southampton", "arxiv_url": "http://arxiv.org/abs/astro-ph/0611674v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:astro-ph/0611674v1 21 Nov 2006\n\nJet-dominated advective systems of all mass scales\n\nElmar Körding∗†\nUniversity of Southampton, UK\nE-mail: Elmar@phys.soton.ac.uk\n\nRob Fender\nUniversity of Southampton, UK\nE-mail: rpf@phys.soton.ac.uk\nWe show that the radio emission of black hole (BH) and neutron star (NS) X-ray binaries (XRBs)\nfollows the analytical prediction of a jet model where the jet carries a constant fraction of the\naccretion power. The radio emission can therefore be used as a tracer of the accretion rate. This\nmeasure is normalised with efficiently radiating objects. As it is independent of the X-ray fluxes,\nthe measure allows us to compare the accretion rate dependency of the bolometric X-ray luminosity of BHs and NSs. For NSs, it scales linearly with accretion rate while the scaling for BHs is\nquadratic - as expected for inefficient accretion flows. We find the same behaviour in AGN. This\nnew approach uses the jet power to obtain the accretion rate. Thus, we know both the jet power\nand the radiated power of an accreting BH. This allows us to show that some accretion power\nis likely to be advected into the black hole, while the jet power dominates over the bolometric\nluminosity of a hard state BH.\n\nVI Microquasar Workshop: Microquasars and Beyond\nSeptember 18-22, 2006\nComo, Italy\n∗ Speaker.\n† Marie\n\nCurie intra-European fellow\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n1. Introduction\nThe accretion rate is usually assumed to be one of the most important parameters of an accreting system. While it is possible to measure the accretion rate from the bolometric luminosity\nfor some objects, e.g, neutron stars (NSs) as they have a stellar surface and a fairly well known\naccretion efficiency, it is impossible to estimate the accretion rate from the bolometric luminosity\nin black holes (BHs), as the accretion flow can be radiatively inefficient [20] and power may be\nadvected across an event horizon or ejected in form of winds or collimated jets. Here, we show\nthat the jet may be a better tracer of the accretion rate than the bolometric luminosity and construct\nan estimator of the accretion rate based on the radio luminosity. Many of the results presented here\nhave already been published in [12].\nDuring an outburst of an X-ray binary (XRB) the source can be found in several distinct\nstates (e.g. [21, 1]). In quiescence and at low accretion rates the source is found in the hard state\ncharacterized by a hard power law in the X-ray spectrum. In the radio one usually observes a steady\njet [8]. In this state the standard accretion disk [22] is probably truncated and the inner part of the\naccretion disk turns into an inefficient accretion flow (e.g., an advection dominated accretion flow,\nADAF [20, 4]). The X rays are ususally described with Comptonization models [23, 24]. However,\nit is also possible that the compact jet may contribute to the X-ray emission or even dominate it\n[15, 16]. When the source brightens it can stay in the hard state to fairly large accretion rates (up\nto 30 % Eddington). Once the source leaves the hard state, it is often found in an intermediate state\n(IMS). One finds two IMSs, first, the source enters a hard IMS characterized by a hard spectral\ncomponent and band-limited noise in the X-ray power spectrum. The hard IMS often shows shows\nstrong but increasingly unstable radio emission. Additionally, a soft IMS is found, dominated by\na soft spectral component with power law noise in the power spectrum (e.g., [1]). In the soft IMS\nno radio emission is found, but during the transition from the hard to the soft IMS an optically\nthin radio flare is usually observed. After leaving the IMS the source may go to the soft state, here\nthe X-ray spectrum is dominated by a soft thermal component that is thought to originate from a\nstandard accretion disk. Again, the radio jet is quenched in this state [7, 3] or, rather, it does not\nreappear.\nIn the soft state a BH is well described with standard accretion theory, e.g., as expected the\nluminosity scales with the disk temperature as T 4 [10]. It is therefore likely that sources in their soft\nstate are radiatively efficient and it is possible to estimate the accretion rate from the bolometric\nluminosity. In the hard state, the accretion flows are thought to be radiatively inefficient – thus\nthe bolometric luminosity cannot be used directly as a measure of the accretion rate. However, in\nthe hard state one always observes a radio jet. It has been suggested that the jet power is linearly\ncoupled with the accretion rate (see e.g. [5]). This implies that we can use the jet as a tracer of\nthe accretion rate for inefficiently accreting objects. An accretion measure based on the jet has not\nonly the advantage of being usable for the hard state, but is also very easy to use as it only requires\na radio core flux.\n\n2. Accretion rates\nIn order to create an estimator of the accretion rate using the radio luminosities, we first have\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n33\n\nLog LRad [erg/s]\n\n32\n\n31\n\n30\n\n29\n\nefficiently\nradiating\n\nNeutron Stars\nGX339-4\nCyg X-1\nGRS 1915 Plateau\nV 404\n1859+226\n\n28\n\n27\n16.0\n\n16.5\n\n17.0\n\n17.5\n\n18.0\n\n18.5\n\n19.0\n\n19.5\n\nLog ṀX [g/s]\n\nFigure 1: Left side: hardness intensity diagram for GX339-4 (reproduced with permission from Belloni et\nal 2005 [1]). The source is in the hard inefficiently accreting state on the right side of the diagram. As we\nargue in the text we can only use the datapoint marked with the big red star to normalize our accretion rate\nmeasure. At this point the accretion flow is nearly efficiently radiating and still has a steady radio jet. Right\nside: Radio luminosity as a function of power liberated in the accretion disk for NSs and BHs.\n\nto obtain a sample of steady jet-emitting sources with a measured accretion rate.\nAtoll NSs seem to have steady radio emitting jets [19]. As they have a stellar surface, all\naccreted power has to be radiated away. To compare NSs with BHs, we assume that the boundary\nlayer contributes 1/2 of the total bolometric luminosity [9]. This assumption is not crucial, see [12]\nfor details. BHs only have steady jets in their hard states, ie., when the source is thought to be\nradiatively inefficient and the bolometric luminosity cannot be used to estimate the accretion rate.\nOnce a source is in the efficiently radiating soft state the jet is quenched.\nTo construct a sample of BHs showing a steady radio jet with estimated accretion rates we can\nuse the fact the the bolometric luminosity does not change significantly during the state transition\nfrom the hard to the soft state [25]. The hardness intensity diagram (HID) of the 2003/2004 outburst of GX339-4 is shown on the left side of Fig. 1. While the source is on the left/soft side of the\ndiagram, we can use the bolometric luminosity to estimate the accretion rate. On the right/hard side\nthe source is likely to be radiatively inefficient. The conversion factor to bolometric luminosities\nfor the plotted PCU counts is roughly similar for both the soft and the hard state. As the transition in the HID is roughly horizontal, this supports the aforementioned result that the bolometric\nluminosity does not change during the state transition. If we assume that the accretion rate does\nnot change rapidly during the state transition, we can use the bolometric luminosity just before the\nstate transition to estimate the accretion rate for the source (which still has a steady jet). For every\noutburst we only obtain a single measurement, which is indicated for the 2003/2004 outburst with\nthe big red star. We found data for 5 outbursts (2× GX 339-4, Cyg X-1, 1859+226, V404 Cyg).\nAdditionally we included GRS 1915+105, which is constantly accreting near its Eddington limit.\nIn its plateau state it has a steady jet and is likely to be radiatively efficient.\nOn the right side of Fig. 1 we plot the 5 GHz Radio luminosity (ν Lν ) as a function of the\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\naccretion rate for the sample of 5 outbursts and the NSs. To obtain the accretion rate from the\nbolometric luminosity we assume a constant efficiency of η ≈ 0.1 for both BHs and NSs. For the\nNSs we have further reduced the bolometric luminosity by a factor 2 to subtract the boundary layer.\nFig. 1 is therefore a plot of the radio luminosity against power liberated in the accretion disk. We\nfind a strong correlation between radio luminosity and accretion power. The solid line represents\nthe analytical prediction of a conical jet model LR ∝ Ṁ 1.4 (e.g., [2]), which describes the data well.\nThus, we can use the radio luminosity to estimate the accretion rate:\nṀ = Ṁ0\n\n\u0012\n\nL8GHz\nL0,8GHz\n\n\u00130.71\n\n,\n\n(2.1)\n\nwhere the normalisation factors (Ṁ0 , L0,8GHz ) is determined by the normalization of the radio /\naccretion rate correlation. As both constants are exchangeable we set L0,8GHz = 1030 erg s−1 . This\nis roughly the 8.6 GHz radio luminosity where the accretion disc around a 10M⊙ BH changes its\nspectral state. For Ṁ0 we find:\nṀ0 = 4.0 × 1017 g s−1 .\n\n(2.2)\n\nIf one treats NSs and BHs separately and does not consider the contribution of the boundary layer,\nthe normalizations for both classes differ by roughly a factor 2 (see [12]).\nThis accretion rate estimator was normalized using efficiently radiating sources only. We did\nnot use the observations for which the accretion rate was to be estimated for the normalization of\nour method. Thus, we can compare the bolometric luminosity with our accretion rate estimations.\nOn the left side of Fig. 2 we plot the bolometric X-ray luminosity against accretion rate for BH\nand NS XRBs. The NSs and the efficiently accreting source GRS 1915+105 have bolometric\nluminosities Lbol ∝ Ṁ. However, this only reflects that the radio luminosity follows the predictions\nof a jet model. The hard state black hole significantly deviate from the linear scaling found for NSs.\nWe find that they scale like Lbol ∝ Ṁ 2 . We note that this quadratic dependence has not been put\ninto the accretion measure, only the linear dependence of the NSs and efficient accreting objects\nhas been used to normalize the accretion measure.\nAt low accretion rates of 0.001 ṀEdd BHs have significantly lower bolometric luminosities\nthan NSs (∼ two orders of magnitude). We can use this difference to explore if BHs advect some\nof the accreted power. All accreted power has to leave the accretion flow in some way. Energy can\nescape from the accreting system only in the form of matter (wind and jet) and as radiation.\nṀ η c2 = Pjet + Pwind + Lbol + PAdvect ,\n\n(2.3)\n\nwhere η denotes the efficiency with that the BH can create energy from accretion (e.g., η ≈ 0.1),\nLbol denotes the bolometric luminosity, Pjet and Pwind the power injected into the jet and wind\nand PAdvect is the power advected into the BH. The latter term vanishes for a NS as advection is\nimpossible due to the stellar surface. We attribute all matter and magnetic fields not contained in\nthe jet to the accretion disc wind.\nAssuming that the radiative efficiency of BH and NS are similar, we have seen that\nNS\nBH\nPjet\n(Ṁ) ≈ Pjet\n(Ṁ) ≈ q j Ṁ,\n\n(2.4)\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n0\n\n0\n\n-1\n\nLog LX / LEdd [erg/s]\n\n-2\n\nLog LX / LEdd\n\n-2\n\n-3\n\n-4\n\n-6\n-3.0\n\n-2.5\n\n-2.0\n\n-1.5\n\n-1.0\n\n-0.5\n\n-6\n\nNeutron Stars\nHard state XRBs\nGRS 1915 Plateau\nLLAGN\nBL Lac + FR I RG\n\n-8\n\nNeutron Stars\nHard state BH\nGRS 1915 Plateau\nBH normalisation points\n\n-5\n\n-4\n\n0.0\n\n-10\n-6\n\n-5\n\nLog ṀRad / ṀEdd\n\n-4\n\n-3\n\n-2\n\n-1\n\n0\n\nLog ṀRad / ṀEdd [erg/s]\n\nFigure 2: Bolometric luminosity as a function of the accretion rate estimated from the radio luminosity.\nLeft side: Our sample of stellar BHs and NSs. While the bolometric luminosity in NSs depends linearly on\naccretion rate it scales quadratically for hard state BHs. Right side: Same as left only for AGN assuming the\nsame bolometric correction for AGN as measured in BHs.\n\nDisk winds play an important role for strongly accreting sources near the Eddington limit. For\nstrongly sub-Eddington sources winds are likely to be less important for the energy budget. But\neven if winds carry a significant fraction of the accreted power, it is likely that NSs and BHs have\nsimilar wind properties due to their similarities in the SED and the power spectral density. We note\nthat NSs have larger bolometric luminosity, thus if the wind properties of both classes are different\nNSs are probably the ones with the stronger radiation driven wind. In equations:\nNS\nBH\n(Ṁ).\nPwind\n(Ṁ) ≈ Pwind\n\n(2.5)\n\nBH\nBH\nPAdvect\n≈ LNS\nbol (Ṁ) − Lbol (Ṁ)\n\n(2.6)\n\nCombining these formulae, we find:\n\nFor strongly sub-Eddington sources this difference is larger than the total bolometric luminosity.\nThose sources are therefore likely to advect more energy than they radiate in X rays.\n\n3. Active Galactic Nuclei\nThe fundamental plane of accreting black holes [17, 6, 11] connects XRBs and AGN with a\nplane in the BH mass, X-ray and radio luminosity space. The fundamental plane can be parametrized\nas\nlog LX = (1.41 ± 0.11) log LRad − (0.87 ± 0.14) log M + b,\n(3.1)\nwhere b is the unimportant offset. One projection of the plane is shown on the left side of Fig. 3.\nThe right side of the figure presents the corresponding χ 2 map. We note that the significance\ncontours are highly elliptical. So it is possible to increase the radio coefficient a little while reducing\nthe mass coefficient without changing the χ 2 significantly, e.g., the parameter pair (1.5, -1) is just\nbarely out of the 1σ contour while (1.4, -1) can be rejected with more than 3 σ .\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n60\n\n-0.4\nFull Sample\nBest Fit\n\n55\n\n-0.8\nMass Exponent\n\nLog L'_X(M) [erg/s]\n\nJet-Model\nJet/ADAF\n\n-0.6\n\n50\n45\n\n-1\n-1.2\n-1.4\n\n40\n-1.6\n35\n\n-1.8\n28\n\n30\n\n32\n\n34\n36\n38\nLog L_R [erg/s]\n\n40\n\n42\n\n1\n\n1.2\n\n1.4\n1.6\nRadio Exponent\n\n1.8\n\n2\n\nFigure 3: Fundamental plane of accreting black holes in the version of [11]. Left side: X-ray luminosity\nscaled for BH mass against radio luminosity for a sample of XRBs, LLAGN, FR-I RGs and BL Lac objects.\nRight side: χ 2 map for the mass and radio luminosity correlation parameter. One, two and three sigma\ncontours are shown.\n\nThe exact parameters depend slightly on the sample used to derive the fundamental plane. If\none puts different weights on the different classes of AGN (e.g., number of LLAGN compared to\nFR-I RGs or Quasars) one finds slightly different parameters [11]. We have shown in [18] that\nthe Fundamental plane is not affected by huge differences in the distance of XRBs and AGN. The\ncorrelation is still visible if one plots only fluxes and has been checked using partial correlation\nanalysis and Monte Carlo simulations.\nUsing our accretion rate measure, we can rewrite the fundamental plane to:\n\u00132\n\u0012\nṀ\nLX\nM 0.14 .\n(3.2)\n∝\nLEdd\nṀEdd\nThis is, up to the factor M 0.14 , exactly what one would expect for an inefficient accretion flow\naround a black hole. This factor M 0.14 can be seen as a consequence of our choice of the dependence\nof the accretion rate on radio luminosity (LR ∝ Ṁ 1.4 ). If we had used a larger value (e.g., 1.5), which\nwould still be in agreement with the data, the factor would nearly vanish. In that case the exponent\nfor the radiatively inefficient accretion is not exactly 2 as we currently find. Additionally we note\nthat the fundamental plane has been derived using 2-10 keV X-ray luminosities, while we used\nbolometric luminosities in our studies here. The correction factor M 0.14 may therefore be real, ie. a\nbolometric correction varying with black hole mass or it can represent the microphysics that is not\nscale invariant.\nIf we use the same bolometric correction for XRBs as for AGN, we find the plot shown on\nthe right side of Fig. 2. Similar to the stellar BHs LLAGN are already significantly below the\nlinear correlation expected for efficiently radiating sources. The large scatter around the inefficient\nscaling is due to the missing mass correction factor M 0.14 . If we include that factor as \"effective\nbolometric correction\" (whether it is a real effect or a relic of our choice of the accretion measure),\nwe arrive at Fig. 4 (left panel). Now the inefficient scaling found in stellar BHs is also found in\nhard state AGN: LLAGN, FR-I RGs and BL Lac objects.\nOne of the differences between the two suggested versions of the fundamental plan is that\nFalcke and Körding et al. [6, 11] try to include only hard-state objects, while Merloni et al. [17]\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n0\n47\n\nlog LD+LPL [erg s−1]\n\nLog LX / LEdd [erg/s]\n\n-4\n\n-6\n\n-5\n\n-4\n\n-3\n\n-2\n\nLog ṀRad / ṀEdd [erg/s]\n\n-1\n\n3.0\n\n45\n44\n\n2.0\n43\n1.0\n\n42\n41\n\nNeutron Stars\nHard state XRBs\nGRS 1915 Plateau\nLLAGN\nBL Lac + FR I RG\n\n-8\n\n-10\n-6\n\n4.0\n\n46\n\n-2\n\n0.0\n40\n\n0\n\n39\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nlog R\n\n-1.0\n\nLPL/(LD+LPL)\n\nFigure 4: Right side: Bolometric luminosity as a function of accretion rate. In comparison to Fig. 2 we\nnow include the correction factor M 0.14 originating from the fundamental plane. The scatter is significantly\nreduced. Left side: Disk-fraction luminosity diagram of a sample of AGN. It is a generalization of HIDs\nused in XRBs, see Fig. 1 for a HID of GX 339-4. AGN and XRBs populate the same regions in the diagram.\nThe fundamental plane and our accretion measure is only valid on the right side of the diagram.\n\ntry to include a representative sample of all AGN, including quasars which probably belong to the\nsoft state. Both studies obtain similar results for the fundamental plane. Here, we explore why\nthe inclusion of soft state objects seem to effect only the scatter around the correlation. First, we\nnote that if a source is brighter than the luminosity where the inefficient scaling reaches the track\nof efficient accretion, it cannot continue to scale as Ṁ 2 , but its bolometric luminosity needs to scale\nlinearly with accretion rate. This suggests, that high accretion rate AGN should have a reduced\nX-ray flux compared to the correlation (up to a factor ∼ 30 − 100).\nIn the picture presented in [13] the fundamental plane is only valid on the right side of an\ndisk-fraction luminosity diagram (DFLD) (see Fig. 4 right panel and the contribution by Jester et\nal. these proceedings). For low accretion rates (below 1% Edd) all objects are on the right side of\nthe diagram and show strong radio jets. For larger accretion rates the sources can either be radio\nloud or quiet, the probablity to be in on of those states seems to depend on their position in the\nDFLD. If we include a sample of radio quiet and loud AGN, the average radio luminosity will be\nreduced compared to what one would expect from our accretion rate measure (see e.g., [14]). This\ncompensates the previously mentioned reduction of the X-ray flux due to the end of the quadratic\nscaling. Inclusion of radio loud and quite AGN will therefore mainly increase the scatter around\nthe correlation.\n\nReferences\n[1] T. Belloni, J. Homan, P. Casella, M. van der Klis, E. Nespoli, W. H. G. Lewin, J. M. Miller, and\nM. Méndez, The evolution of the timing properties of the black-hole transient GX 339-4 during its\n2002/2003 outburst, A&A 440, 207–222 (2005).\n[2] R. D. Blandford and A. Königl, Relativistic jets as compact radio sources, ApJ 232, 34–48 (1979).\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n[3] S. Corbel, R. P. Fender, A. K. Tzioumis, M. Nowak, V. McIntyre, P. Durouchoux, and R. Sood,\nCoupling of the X-ray and radio emission in the black hole candidate and compact jet source GX\n339-4, A&A 359, 251–268 (2000).\n[4] A. A. Esin, J. E. McClintock, and R. Narayan, Advection-dominated Accretion and the Spectral States\nof Black Hole X-Ray Binaries: Application to Nova MUSCAE 1991, ApJ 489, 865+ (1997).\n[5] H. Falcke and P. L. Biermann, The jet-disk symbiosis. I. Radio to X-ray emission models for quasars.,\nA&A 293, 665–682 (1995).\n[6] H. Falcke, E. Körding, and S. Markoff, A scheme to unify low-power accreting black holes.\nJet-dominated accretion flows and the radio/X-ray correlation, A&A 414, 895–903 (2004).\n[7] R. Fender, S. Corbel, T. Tzioumis, V. McIntyre, D. Campbell-Wilson, M. Nowak, R. Sood,\nR. Hunstead, A. Harmon, P. Durouchoux, and W. Heindl, Quenching of the Radio Jet during the\nX-Ray High State of GX 339-4, ApJ 519, L165–L168 (1999).\n[8] R. P. Fender, Powerful jets from black hole X-ray binaries in low/hard X-ray states, MNRAS 322,\n31–42 (2001).\n[9] J. Frank, A. King, and D. J. Raine, Accretion Power in Astrophysics: Third Edition, Accretion Power\nin Astrophysics, by Juhan Frank and Andrew King and Derek Raine, pp. 398. ISBN\n0521620538. Cambridge, UK: Cambridge University Press, February 2002., February 2002.\n[10] M. Gierliński and C. Done, Black hole accretion discs: reality confronts theory, MNRAS 347,\n885–894 (2004) [astro-ph/0307333].\n[11] E. Körding, H. Falcke, and S. Corbel, Refining the fundamental plane of accreting black holes, A&A\n456, 439–450 (2006) [astro-ph/0603117].\n[12] E. G. Körding, R. P. Fender, and S. Migliari, Jet-dominated advective systems: radio and X-ray\nluminosity dependence on the accretion rate, MNRAS 369, 1451–1458 (2006).\n[13] E. G. Körding, S. Jester, and R. Fender, Accretion states and radio loudness in active galactic nuclei:\nanalogies with X-ray binaries, MNRAS 372, 1366–1378 (2006) [astro-ph/0608628].\n[14] T. J. Maccarone, E. Gallo, and R. Fender, The connection between radio-quiet active galactic nuclei\nand the high/soft state of X-ray binaries, MNRAS 345, L19–L24 (2003).\n[15] S. Markoff, H. Falcke, and R. Fender, A jet model for the broadband spectrum of XTE J1118+480.\nSynchrotron emission from radio to X-rays in the Low/Hard spectral state, A&A 372, L25–L28\n(2001).\n[16] S. Markoff, M. A. Nowak, and J. Wilms, Going with the Flow: Can the Base of Jets Subsume the Role\nof Compact Accretion Disk Coronae?, ApJ 635, 1203–1216 (2005) [astro-ph/0509028].\n[17] A. Merloni, S. Heinz, and T. Di Matteo, A Fundamental Plane of black hole activity, MNRAS 345,\n1057–1076 (2003).\n[18] A. Merloni, E. Körding, S. Heinz, S. Markoff, T. Di Matteo, and H. Falcke, Why the fundamental\nplane of black hole activity is not simply a distance driven artifact, New Astronomy 11, 567–576\n(2006) [astro-ph/0601286].\n[19] S. Migliari and R. P. Fender, Jets in neutron star X-ray binaries: a comparison with black holes,\nMNRAS 366, 79–91 (2006) [astro-ph/0510698].\n[20] R. Narayan and I. Yi, Advection-dominated accretion: A self-similar solution, ApJ 428, L13–L16\n(1994).\n\n\fJet-dominated advective systems of all mass scales\n\nElmar Körding\n\n[21] M. A. Nowak, Toward a Unified View of Black-Hole High-Energy States, PASP 107, 1207+ (1995).\n[22] N. I. Shakura and R. A. Sunyaev, Black holes in binary systems. observational appearance., A&A 24,\n337–355 (1973).\n[23] R. A. Sunyaev and J. Trümper, Hard X-ray spectrum of CYG X-1, Nature 279, 506–508 (1979).\n[24] K. S. Thorne and R. H. Price, Cygnus X-1 - an interpretation of the spectrum and its variability, ApJ\n195, L101–L105 (1975).\n[25] S. N. Zhang, W. Cui, B. A. Harmon, W. S. Paciesas, R. E. Remillard, and J. van Paradijs, The 1996\nSoft State Transition of Cygnus X-1, ApJ 477, L95 (1997).\n\n\f"}