{"id": "http://arxiv.org/abs/astro-ph/0309373v1", "guidislink": true, "updated": "2003-09-13T19:37:59Z", "updated_parsed": [2003, 9, 13, 19, 37, 59, 5, 256, 0], "published": "2003-09-13T19:37:59Z", "published_parsed": [2003, 9, 13, 19, 37, 59, 5, 256, 0], "title": "GMRT Observations of NGC 3079", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0309466%2Castro-ph%2F0309791%2Castro-ph%2F0309226%2Castro-ph%2F0309640%2Castro-ph%2F0309737%2Castro-ph%2F0309437%2Castro-ph%2F0309582%2Castro-ph%2F0309710%2Castro-ph%2F0309182%2Castro-ph%2F0309013%2Castro-ph%2F0309463%2Castro-ph%2F0309534%2Castro-ph%2F0309479%2Castro-ph%2F0309699%2Castro-ph%2F0309196%2Castro-ph%2F0309656%2Castro-ph%2F0309300%2Castro-ph%2F0309393%2Castro-ph%2F0309694%2Castro-ph%2F0309649%2Castro-ph%2F0309214%2Castro-ph%2F0309513%2Castro-ph%2F0309680%2Castro-ph%2F0309427%2Castro-ph%2F0309483%2Castro-ph%2F0309262%2Castro-ph%2F0309690%2Castro-ph%2F0309650%2Castro-ph%2F0309193%2Castro-ph%2F0309106%2Castro-ph%2F0309555%2Castro-ph%2F0309299%2Castro-ph%2F0309434%2Castro-ph%2F0309301%2Castro-ph%2F0309784%2Castro-ph%2F0309651%2Castro-ph%2F0309276%2Castro-ph%2F0309178%2Castro-ph%2F0309240%2Castro-ph%2F0309608%2Castro-ph%2F0309658%2Castro-ph%2F0309630%2Castro-ph%2F0309146%2Castro-ph%2F0309060%2Castro-ph%2F0309029%2Castro-ph%2F0309184%2Castro-ph%2F0309533%2Castro-ph%2F0309420%2Castro-ph%2F0309633%2Castro-ph%2F0309489%2Castro-ph%2F0309288%2Castro-ph%2F0309032%2Castro-ph%2F0309259%2Castro-ph%2F0309830%2Castro-ph%2F0309015%2Castro-ph%2F0309795%2Castro-ph%2F0309574%2Castro-ph%2F0309597%2Castro-ph%2F0309566%2Castro-ph%2F0309265%2Castro-ph%2F0309218%2Castro-ph%2F0309405%2Castro-ph%2F0309028%2Castro-ph%2F0309729%2Castro-ph%2F0309092%2Castro-ph%2F0309118%2Castro-ph%2F0309263%2Castro-ph%2F0309724%2Castro-ph%2F0309067%2Castro-ph%2F0309504%2Castro-ph%2F0309720%2Castro-ph%2F0309716%2Castro-ph%2F0309549%2Castro-ph%2F0309185%2Castro-ph%2F0309415%2Castro-ph%2F0309132%2Castro-ph%2F0309578%2Castro-ph%2F0309071%2Castro-ph%2F0309691%2Castro-ph%2F0309571%2Castro-ph%2F0309373%2Castro-ph%2F0309307%2Castro-ph%2F0309638%2Castro-ph%2F0309601%2Castro-ph%2F0309726%2Castro-ph%2F0309695%2Castro-ph%2F0309006%2Castro-ph%2F0309056%2Castro-ph%2F0309565%2Castro-ph%2F0309077%2Castro-ph%2F0309350%2Castro-ph%2F0309776%2Castro-ph%2F0309562%2Castro-ph%2F0309421%2Castro-ph%2F0309334%2Castro-ph%2F0309295%2Castro-ph%2F0309607%2Castro-ph%2F0309280%2Castro-ph%2F0309190%2Castro-ph%2F0309636%2Castro-ph%2F0309734&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "GMRT Observations of NGC 3079"}, "summary": "We present new observations at three frequencies (326 MHz, 615 MHz, and 1281\nMHz) of the radio lobe spiral galaxy, NGC 3079, using the Giant Metrewave Radio\nTelescope. These observations are consistent with previous data obtained at\nother telescopes and reveal the structure of the nuclear radio lobes in\nexquisite detail. In addition, new features are observed, some with HI\ncounterparts, showing broad scale radio continuum emission and extensions. The\ngalaxy is surrounded by a radio halo that is at least 4.8 kpc in height. Two\ngiant radio extensions/loops are seen on either side of the galaxy out to\n$\\sim$ 11 kpc from the major axis, only slightly offset from the direction of\nthe smaller nuclear radio lobes. If these are associated with the nuclear\noutflow, then the galaxy has experienced episodic nuclear activity. Emission\nalong the southern major axis suggests motion through a local IGM (not yet\ndetected) and it may be that NGC 3079 is itself creating this local\nintergalactic gas via outflows. We also present maps of the minimum energy\nparameters for this galaxy, including cosmic ray energy density, electron\ndiffusion length, magnetic field strength, particle lifetime, and power.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0309466%2Castro-ph%2F0309791%2Castro-ph%2F0309226%2Castro-ph%2F0309640%2Castro-ph%2F0309737%2Castro-ph%2F0309437%2Castro-ph%2F0309582%2Castro-ph%2F0309710%2Castro-ph%2F0309182%2Castro-ph%2F0309013%2Castro-ph%2F0309463%2Castro-ph%2F0309534%2Castro-ph%2F0309479%2Castro-ph%2F0309699%2Castro-ph%2F0309196%2Castro-ph%2F0309656%2Castro-ph%2F0309300%2Castro-ph%2F0309393%2Castro-ph%2F0309694%2Castro-ph%2F0309649%2Castro-ph%2F0309214%2Castro-ph%2F0309513%2Castro-ph%2F0309680%2Castro-ph%2F0309427%2Castro-ph%2F0309483%2Castro-ph%2F0309262%2Castro-ph%2F0309690%2Castro-ph%2F0309650%2Castro-ph%2F0309193%2Castro-ph%2F0309106%2Castro-ph%2F0309555%2Castro-ph%2F0309299%2Castro-ph%2F0309434%2Castro-ph%2F0309301%2Castro-ph%2F0309784%2Castro-ph%2F0309651%2Castro-ph%2F0309276%2Castro-ph%2F0309178%2Castro-ph%2F0309240%2Castro-ph%2F0309608%2Castro-ph%2F0309658%2Castro-ph%2F0309630%2Castro-ph%2F0309146%2Castro-ph%2F0309060%2Castro-ph%2F0309029%2Castro-ph%2F0309184%2Castro-ph%2F0309533%2Castro-ph%2F0309420%2Castro-ph%2F0309633%2Castro-ph%2F0309489%2Castro-ph%2F0309288%2Castro-ph%2F0309032%2Castro-ph%2F0309259%2Castro-ph%2F0309830%2Castro-ph%2F0309015%2Castro-ph%2F0309795%2Castro-ph%2F0309574%2Castro-ph%2F0309597%2Castro-ph%2F0309566%2Castro-ph%2F0309265%2Castro-ph%2F0309218%2Castro-ph%2F0309405%2Castro-ph%2F0309028%2Castro-ph%2F0309729%2Castro-ph%2F0309092%2Castro-ph%2F0309118%2Castro-ph%2F0309263%2Castro-ph%2F0309724%2Castro-ph%2F0309067%2Castro-ph%2F0309504%2Castro-ph%2F0309720%2Castro-ph%2F0309716%2Castro-ph%2F0309549%2Castro-ph%2F0309185%2Castro-ph%2F0309415%2Castro-ph%2F0309132%2Castro-ph%2F0309578%2Castro-ph%2F0309071%2Castro-ph%2F0309691%2Castro-ph%2F0309571%2Castro-ph%2F0309373%2Castro-ph%2F0309307%2Castro-ph%2F0309638%2Castro-ph%2F0309601%2Castro-ph%2F0309726%2Castro-ph%2F0309695%2Castro-ph%2F0309006%2Castro-ph%2F0309056%2Castro-ph%2F0309565%2Castro-ph%2F0309077%2Castro-ph%2F0309350%2Castro-ph%2F0309776%2Castro-ph%2F0309562%2Castro-ph%2F0309421%2Castro-ph%2F0309334%2Castro-ph%2F0309295%2Castro-ph%2F0309607%2Castro-ph%2F0309280%2Castro-ph%2F0309190%2Castro-ph%2F0309636%2Castro-ph%2F0309734&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present new observations at three frequencies (326 MHz, 615 MHz, and 1281\nMHz) of the radio lobe spiral galaxy, NGC 3079, using the Giant Metrewave Radio\nTelescope. These observations are consistent with previous data obtained at\nother telescopes and reveal the structure of the nuclear radio lobes in\nexquisite detail. In addition, new features are observed, some with HI\ncounterparts, showing broad scale radio continuum emission and extensions. The\ngalaxy is surrounded by a radio halo that is at least 4.8 kpc in height. Two\ngiant radio extensions/loops are seen on either side of the galaxy out to\n$\\sim$ 11 kpc from the major axis, only slightly offset from the direction of\nthe smaller nuclear radio lobes. If these are associated with the nuclear\noutflow, then the galaxy has experienced episodic nuclear activity. Emission\nalong the southern major axis suggests motion through a local IGM (not yet\ndetected) and it may be that NGC 3079 is itself creating this local\nintergalactic gas via outflows. We also present maps of the minimum energy\nparameters for this galaxy, including cosmic ray energy density, electron\ndiffusion length, magnetic field strength, particle lifetime, and power."}, "authors": ["Judith A. Irwin", "D. J. Saikia"], "author_detail": {"name": "D. J. Saikia"}, "author": "D. J. Saikia", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2003.07146.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0309373v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0309373v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 8 figures, 4 tables, accepted for publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0309373v1", "affiliation": "TIFR-NCRA, Pune, India", "arxiv_url": "http://arxiv.org/abs/astro-ph/0309373v1", "journal_reference": "Mon.Not.Roy.Astron.Soc.346:977,2003", "doi": "10.1111/j.1365-2966.2003.07146.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–11 ( )\n\nPrinted 6 April 2019\n\n(MN LATEX style file v1.4)\n\nGMRT Observations of NGC 3079\nJudith A. Irwin1 and D. J. Saikia2\n\narXiv:astro-ph/0309373v1 13 Sep 2003\n\n1 Dept. of Physics, Queen's University, Kingston, Canada, K7L 3N6\n2 National Centre for Radio Astrophysics, Tata Institute of Fundamental Research, Pune University Campus, Post Bag 3,\nPune 411 007, India\n\nAccepted. Received\n\nABSTRACT\n\nWe present new observations at three frequencies (326 MHz, 615 MHz, and 1281\nMHz) of the radio lobe spiral galaxy, NGC 3079, using the Giant Metrewave Radio\nTelescope. These observations are consistent with previous data obtained at other\ntelescopes and reveal the structure of the nuclear radio lobes in exquisite detail. In\naddition, new features are observed, some with HI counterparts, showing broad scale\nradio continuum emission and extensions. The galaxy is surrounded by a radio halo\nthat is at least 4.8 kpc in height. Two giant radio extensions/loops are seen on either\nside of the galaxy out to ∼ 11 kpc from the major axis, only slightly offset from the\ndirection of the smaller nuclear radio lobes. If these are associated with the nuclear\noutflow, then the galaxy has experienced episodic nuclear activity. Emission along the\nsouthern major axis suggests motion through a local IGM (not yet detected) and it\nmay be that NGC 3079 is itself creating this local intergalactic gas via outflows. We\nalso present maps of the minimum energy parameters for this galaxy, including cosmic\nray energy density, electron diffusion length, magnetic field strength, particle lifetime,\nand power.\nKey words: galaxies: individual: NGC 3079 – galaxies: halos – galaxies: jets – radio\ncontinuum: galaxies.\n\n1\n\nINTRODUCTION\n\nNGC 3079 is unusual amongst spiral galaxies in that it displays two well-defined radio lobes extending ∼ 30′′ (2.4 kpc,\nassuming a distance of 16.5 Mpc as listed in Table 1) from\nthe nucleus (Duric et al. 1983), which are clearly out of the\nplane of this edge-on (84◦ ) system. Within the eastern radio\nlobe is a \"bubble\" of Hα emission extending to 550 pc and\ndisplaying outflowing velocities up to 1000 km s−1 , as shown\nby Hubble Space Telescope (HST) observations (Cecil et al.\n2001 and references therein). Recent Chandra spacecraft images have also revealed X-ray emitting gas that is spatially\ncorrelated with the emission line gas (Cecil et al. 2002).\nThe high IR luminosity (Table 1) and bubble/cone morphology of the emission line gas has led to models of windlike outflow related to a starburst. However, the galaxy also\nharbours an active galactic nucleus (AGN) and jet and about\nhalf of the IR luminosity could be due to recycled AGN\n(rather than hot stellar) photons (Iyomoto et al. 2001). The\ncore/jet nature of the nuclear region is confirmed by VLBI\ndetections (Irwin & Seaquist 1988; Trotter et al. 1998) as\nwell as the recent measurement of an increase in separation\nbetween the compact components implying a jet outflow velocity of 0.13 ± 0.03 c (Kondratko et al. 2002). H2 O maser\nemission in the disk indicates that a core mass of 106 M⊙\nc\n\nRAS\n\nis present within a radius of 1 pc. Recent BeppoSax observations (Iyomoto et al. 2001) show that X-ray emission\nfrom the core is highly obscured and that after correction\nfor absorption, the luminosity is 1042 to 1043 ergs s−1 . In the\ninner parsec, this is 1% to 10% of the Eddington luminosity. NGC 3079 is therefore as active as the Seyfert galaxies\nand quasars. While it is still unclear to what extent the radio\ncore powers the various components of the kpc-scale outflow,\nthe radio lobes themselves appear to be a nearby analogue\nof the distant, powerful, extra-galactic radio sources, but\nwithin the dense, high angular momentum ISM of a nearby\nspiral.\nGiven the strength of the radio continuum emission in\nNGC 3079 and its peculiar nature, this galaxy represented a\ngood target for low frequency observations using the Giant\nMetrewave Radio Telescope (GMRT) during its commissioning phase. We were particularly interested in searching for\nbroad scale emission, especially as might be related to the\nnuclear outflow or to some of the other neutral hydrogen\n(HI) extensions and supershells seen in this galaxy (Irwin &\nSeaquist 1990). Multi-frequency observations were also important as a means to test for consistency and to enable the\ndetermination of minimum energy parameters such as magnetic field strength, cosmic ray energy density, and particle\n\n\f2\n\nJ. A. Irwin and D. J. Saikia\nTable 1. Basic Data on NGC 3079.a\nRA (J2000)b\n(h m s)\n\nDEC (J2000)b\n(◦ ′ ′′ )\n\nTypec\n\na × bd\n(′ × ′ )\n\nVsys e\n(km s−1 )\n\nif\n(◦ )\n\nLF IR g\n(L⊙ )\n\nDh\n(Mpc)\n\n10 01 57.798\n\n+55 40 47.08\n\nSB(s)c\n\n7.9 × 1.4\n\n1125\n\n84\n\n4.1 × 1010\n\n16.5\n\na Taken from the Nasa Extragalactic Database, unless otherwise noted.\nb Optical centre coordinates.\nc Morphological type.\nd Optical major and minor axes sizes.\ne Heliocentric systemic velocity.\nf Inclination, from Irwin & Seaquist (1991).\ng Far infra-red luminosity, from the FIR flux listed in Niklas et al. (1995).\nh Distance, from Baan & Irwin (1995), using H0 = 75 km s−1 Mpc−1 .\n\nlifetimes. These are presented in Sec. 3. The basic data for\nNGC 3079 are presented in Table 1.\n\n2\n\nOBSERVATIONS AND DATA REDUCTION\n\nThe GMRT consists of 30 45-m antennas in an approximate\n'Y' shape similar to the Very Large Array but each antenna\ncannot be moved from a fixed position. Twelve antennas are\nrandomly placed within a central 1 km by 1 km square (the\n\"Central Square\") and the remainder form the irregularly\nshaped Y (6 on each arm) over a total extent of about 25\nkm. Further details about the array can be found at the\nGMRT website at http://www.gmrt.ncra.tifr.res.in.\nWe present details of the observations in Table 2. The observations were made in the standard fashion, with each source\nobservation interspersed with observations of the phase calibrator. Data are collected in spectral-line mode at the\nGMRT over 128 channels in 2 Stokes (RR and LL) and one\nIF. The data are first written in a GMRT-based \"lta\" format\nand then converted into FITS format to facilitate processing in the standard fashion using the Astronomical Image\nProcessing System (AIPS) of the National Radio Astronomy\nObservatory (NRAO).\nBecause no on-line flagging occurred in real time during\nGMRT observations, the data were first \"pre-edited\" using\nthe program, GMRED, written by one of us (JAI) to run\nwithin AIPS. The purpose of GMRED is to search through\neach channel, each stokes and each IF separately and edit\nout bad data prior to normal editing and calibration. It combines clipping (flagging by a maximum and minimum) as\nwell as median filtering to eliminate gross outliers. The maximum and minimum, the time interval for determination of\nthe median, and the deviation allowed from the median before flagging can all be set by the user after inspection of\nthe raw UV data. This allowed for removal of points such as\nmight be obtained when an antenna is receiving data but is\nnot yet pointed exactly on source, points that might be poor\nat the beginning of scans, and spikes from interference or\nelectronics. GMRED is freely available with instructions for\ninstallation from http://www.astro.queensu.ca/ ̃irwin.\nWe then carried out a calibration in time in the standard fashion but using a single good channel of the phase\ncalibrator rather than the inner 75% of the band. This was\npossible since the calibrator sources were quite strong at\neach frequency and avoided potential variations with frequency.\n\nSince the data were acquired in spectral-line mode, we\nalso carried out a bandpass calibration using the phase calibrator. The data from a single good channel were then\nFourier Transformed and cleaned, first using a wide field to\nidentify all sources and then of smaller multiple fields so that\nthe outlying sources could be cleaned with a beam for the\nrespective positions. All channels were then self-calibrated\nseveral times (and again edited, if required) using the single\nchannel map. Cleaned maps were then made of all channels\n(i.e. a cube was created) and plots of the source flux density\nand map rms noise as a function of channel number were\nmade. Loss of signal at the ends of the channels and occasional interference spikes or hardware problems required\nfurther editing of a number of channels at this stage. The\nfinal edited bandwidths and band centres are given in Table\n2.\nWe then checked for positional offsets and variations in\nsource flux density across the band. We found that the positions of NGC 3079 (central peak) and other point sources\nwithin the field agreed in position from one edge of the band\nto the other to within a single pixel (about 1/4 of a beam).\nThe standard deviation in the flux density of NGC 3079\nacross the band (measuring all channels) in comparison to\nthe flux density is given in Table 2. These errors can be compared to the bootstrapped flux density error on the phase\ncalibrator as well as the estimated absolute error on the flux\ndensity calibrators (the latter, a few percent) to arrive at an\nestimate of the final calibration error listed in Table 2.\nThe UV data were then averaged over all good channels to make a single-channel UV data set and various maps\nwere made and cleaned from these data, using a variety of\nUV weighting functions and tapers. Several maps experienced small improvements from further minor editing and\nself-calibration at this stage. We then corrected for the primary beam at the various frequencies for all maps. However,\nafter these corrections, the increase in source flux density\nwas much less than the absolute calibration error and the\npoint-by-point change in flux density per beam was less than\nthe rms map noise for all maps. Thus we present the final\nmaps without this correction.\nWe then checked and made minor corrections to the\nmap registration by comparing the positions of the core of\nNGC 3079 and point sources around it (via gaussian fits)\nwith those of the NRAO VLA Sky Survey (NVSS) and Faint\nImages of the Radio Sky at Twenty-centimeters (FIRST)\nmaps (see Figs. 4b and 4c, respectively). We estimate the\nfinal positional accuracy to be within 1 arcsec. We also comc\n\nRAS, MNRAS 000, 1–11\n\n\fGMRT Observations of NGC 3079\npared our 326 MHz flux densities with those measured from\nthe Westerbork Northern Sky Survey (WENSS, Rengelink\net al. 1997) map (Fig. 4a). After smoothing to the same resolution, the WENSS map has a peak and integrated flux\ndensity that are 10% lower than our GMRT flux densities.\nGiven the 10% accuracy of our GMRT 326 MHz flux density and the 5% accuracy of the WENSS flux density, these\nvalues are in agreement.\n\n3\n\nRESULTS\n\n3.1\n\nTotal Intensity Maps\n\nThe total-intensity maps, shown over a variety of spatial\nscales, can be seen in Figs. 1 (326 MHz), 2 (615 MHz), and\n3 (1281 MHz). Their map properties are listed in Table 2.\nIn these figures, we show positive contours to low intensity\nlevels (1.5σ) but caution in the interpretation of the lowest\nlevels and summarize what we consider to be real features\nin Sect. 3.1.4. Total flux densities from these maps are given\nin Table 3 and are plotted on the spectrum shown in Fig. 5.\nThe new GMRT flux densities are consistent with the known\nspectrum at these frequencies. (The one discordant low point\nat 365 MHz is from the Texas Survey using data taken between the years 1974 and 1983; see Douglas et al. 1996.) The\nnew data are clearly and firmly in the non-thermal part of\nthe spectrum.\n\n3.1.1\n\n326 MHz\n\nOur low-resolution GMRT image (Fig. 1a) shows strong\nemission from NGC 3079, but no emission from either of\nits two companion galaxies, namely NGC 3073 and MCG9-17-9, the upper limit to their flux densities being 9 mJy\nand 5 mJy, respectively.\nAt 326 MHz (Fig. 1) an envelope of emission is seen\naround the galaxy which is more extensive than previously\nobserved (cf. Duric & Seaquist 1988, Duric et al. 1983, de\nBruyn 1977, and Fig. 4) with the possible exception of the\nlow-resolution image of Condon (1987). The emission envelope follows the disk of the galaxy and is likely due to\ndistributed sources in the disk similar to other star-forming\nspirals.\nTo determine the vertical scale height of this thick disk,\nwe created a model galaxy with the geometry of NGC 3079,\nwhose projected intensity at any point is proportional to the\nline of sight distance through the galaxy at that point. The\nmodel galaxy was then convolved with a beam equivalent to\nthat of Fig. 1a. We then matched the extent of the model\nmajor axis with that of NGC 3079 at the 2σ level and varied\nthe vertical height until a match was achieved in the perpendicular direction (the western extension was omitted, see\nbelow). The best fit was found for a vertical height of 60′′\n(4.8 kpc). Since the intrinsic brightness distribution should\nfall off with height from mid-plane, the vertical scale height\nwill be larger than 4.8 kpc.\nThe 326 MHz emission also shows much substructure\nwith improving resolution. The most obvious feature is an\nextension towards the west which ends in a knot at RA =\n10 01 38.1, DEC = 55 41 14. A feature is also seen at a\nsimilar position in the WENSS image (Fig. 4a) at the same\nc\n\nRAS, MNRAS 000, 1–11\n\n3\n\nfrequency though with somewhat different structure, given\nthe different uv coverage and spatial resolution. This feature\nresolves into two distinct extensions (Fig. 1c) which roughly\nflank the western nuclear radio lobe. These two extensions\nhave counterparts in HI, best seen in the moment map of\nIrwin & Seaquist (1987).\nA large loop of emission is visible at the north end of the\ngalaxy disk extending towards the east of it. The north edge\nof this loop makes the major axis on the north side appear\nto bend around to the east. The central minimum is at RA\n= 10 01 58.3, DEC = 55 43 01 and the loop diameter is 47′′\n(3.8 kpc) parallel to the major axis and extends to 90′′ (7.2\nkpc) from the major axis. This loop is also coincident with\nan HI (open-topped) loop seen at a velocity of 1011 km s−1\nin Irwin & Seaquist (1991, their Fig. 1).\nAnother interesting result is the curvature of the emission towards the east away from the optical disk at the\nsouthern tip of the major axis. This behaviour again mimics that seen in the neutral hydrogen distribution (Irwin &\nSeaquist 1991). The NVSS image (Fig. 4b) also hints at an\nextension in this direction. Since both the radio continuum\nand HI emission are disconnected from the optical disk, the\ncurvature is not tidal but is likely due to ram pressure affecting only the ISM components. This indicates that there may\nbe more extensive intergalactic gas in this region through\nwhich NGC 3079 has some local motion. Such motion would\nbe (in projection) towards the west or south-west or could\nbe rotation (tumbling) with the southern major axis moving towards the west. At the present time, the only extended\nX-ray emission observed appears to be associated with the\nnuclear outflow (Pietsch et al. 1998, Cecil et al. 2002). Thus\ndeeper X-ray observations are warranted.\n\n3.1.2\n\n615 MHz\n\nThe 615 MHz data (Fig. 2) reveal the largest radio continuum loop which has yet been associated with this galaxy.\nThe loop extends to the east, has a central minimum located at RA = 10 02 07.4, DEC = 55 42 37, has a diameter\nof 64′′ (5.1 kpc) parallel to the major axis and extends to\n2.2′ (11 kpc) from the major axis. This is much farther than\nthe minimum vertical scale height measured from the 326\nMHz data and confirms that a very extensive radio continuum halo exists around NGC 3079. The loop is not centered\nover the eastern nuclear radio lobe, but rather offset from\nit to the north. However, there is much substructure in the\nfeature, especially on its southern edge which is closer to the\nposition of the radio lobe. It is possible that several features\nare blended along the line of sight in this edge-on system.\nAlternatively, the feature may be related to the nuclear outflow but source precession, motion of the galaxy with respect\nto an IGM, or flows into previously emitted gas may have\naffected its position over time. This feature is also hinted at\nin the WENSS image (Fig. 4a).\nThe same two western extensions on the west side of the\ndisk (as noted from the 326 MHz data) are seen prominently\nat 615 MHz as well. These (Fig. 2b) reach ∼ 2′ (9.6 kpc)\nfrom the plane.\nThe distinctive cross shape and markedly stronger emission of the nuclear region in this galaxy is especially visible\nin Fig. 2c.\n\n\f4\n\nJ. A. Irwin and D. J. Saikia\n\nFigure 1. 326 MHz maps of NGC 3079 showing different resolutions depending on UV weighting and tapering (see Table 2). The first\ncontour is at 1.5σ in each case and the NED central position of NGC 3079 is marked with a cross where the DSS image is shown. (a)\nLow-resolution map showing 326 MHz contours over a DSS optical image. Contour levels are at 7.4, 10.0, 13.0, 16.0, 22.0, 30.0, 60.0,\n100, 200, 400, 800, and 1600 mJy beam−1 . The peak brightness is 1.73 Jy beam−1 and the beam is 59.16′′ × 49.56′′ at a position angle\nof −24.7◦ . (b) Medium-resolution map with contour levels at 5.1, 7.5, 10.0, 15.0, 30.0, 75.0, 200, 400, 800, and 1300 mJy beam−1 over\na DSS image. The peak brightness is 1.46 Jy beam−1 and the beam is 44.08′′ × 35.53′′ at −19.8◦ . (c) High-resolution map (greyscale\nplus contours) with levels at 3.1, 5.0, 8.0, 15.0, 30.0, and 75.0 mJy beam−1 . The greyscale ranges from 0 to 50 mJy beam−1 . The peak\nbrightness is 987 mJy beam−1 and the beam is 28.45′′ × 17.66′′ at −18.2◦ .\n\n615 MHz\nDECLINATION (J2000)\n\n55 45\n44\n43\n42\n41\n40\n39\n38\n37 (a)\n10 02 20\n\n(b)\n10\n\n00\n\n50\n\n40 20\n\n10\n\n(c)\n00\n\n50\n\n40 20\n\n10\n\n00\n\n50\n\n40\n\nRIGHT ASCENSION (J2000)\nFigure 2. The 615 MHz maps of NGC 3079 (contours) over the DSS image (greyscale) except for (c) for which the greyscale is the 615\nMHz map itself. Different resolutions are shown depending on UV weighting and tapering (see Table 2). The first contour is at 1.5σ in\neach case and a cross marks the central position of NGC 3079, in images for which the greyscale is the DSS image. (a) Contour levels\nare at 1.5, 2.0, 3.0, 5.0, 7.5, 10, 20, 40, 80, 150, 300, 600, 830 mJy beam−1 . The peak brightness is 832 mJy beam−1 and the beam is\n39.79′′ × 29.78′′ at a position angle of 11.3◦ . (b) Medium-resolution map with contour levels at 1.3, 2.0, 3.0, 4.5, 7.0, 18, 40, 80, 300,\n600, and 670 mJy beam−1 . The peak brightness is 677 mJy beam−1 and the beam is 27.08′′ × 19.65′′ at 7.7◦ . (c) High-resolution map\nwith contour levels at 1.2, 2.0, 3.0, 5.0, 10, 20, and 40 mJy beam−1 . The peak brightness is 445 mJy beam−1 and the beam is 14.90′′ ×\n7.98′′ at 36.5◦ . The greyscale ranges from 0 to 35 mJy beam−1 .\n\nc\n\nRAS, MNRAS 000, 1–11\n\n\fGMRT Observations of NGC 3079\n\n5\n\nTable 2. Observing and Data Reduction Details.\nObserving Parameters\n\n326 MHz\n\n615 MHz\n\n1281 MHz\n\n16 Apr 1999\n6.2\n18\n0.0684\n21.8\n8\n1\n3C 286\n25.94\n0831+557\n8.98 ± 0.63\n9.7%\n10%\n\n14 Nov 1999\n12.3\n17\n0.159\n30.9\n16\n1\n3C 48, 3C 286\n29.38, 21.05\n0831+557\n8.22 ± 0.13\n3.3%\n5%\n\n03 Dec 2001\n9.0\n26\n0.195\n102\n16\n1\n3C 48\n17.23\n0831+557\n8.52± 0.16\n0.9%\n3%\n\n6.2\n325.625\n59.16 × 49.56 @ −24.7◦\n6 kλ/NA\n4.9\n44.08 × 35.53 @ −19.8◦\nnone/NA\n3.4\n28.45 × 17.66 @ −18.2◦\nnone/UN\n2.1\n\n7.75\n615.234\n39.79 × 29.78 @ 11.3◦\n10kλ/NA\n1.0\n27.08 × 19.65 @ 7.7◦\nnone/NA\n0.9\n14.90 × 7.98 @ 36.5◦\nnone/UN\n0.74\n\n14.0\n1280.700\n23.55 × 19.75 @ 52.1◦\n10kλ/NA\n0.63\n7.33 × 5.21 @ 48.1◦\n50kλ/NA\n0.25\n3.22 × 2.24 @ 38.2◦\nnone/UN\n0.12\n\nDate\nTimea (h)\nNumber of antennasb\nShortest Baseline (kλ)\nLongest Baseline (kλ)\nObserving Bandwidth (MHz)\nNo. of IFs\nFlux Density Calibrator(s)\nFlux Density (Jy)\nPhase/Bandpass Calibrator\nFlux Densityc (Jy)\nFlux Error across bandd\nFinal Calibration Error\nMap Parameters\nFinal Bandwidthe (MHz)\nBand Centre (MHz)\nResolution (low)\nTaper/weighting\nrms map noise (mJy beam−1 )\nResolution (medium)\nTaper/weighting\nrms map noise (mJy beam−1 )\nResolution (high)\nTaper/weighting\nrms map noise (mJy beam−1 )\n\na Total observing time, including overheads, before editing. b Maximum number of antennas operational\nat any time during the observations. c Flux density and error from GETJY. d Standard deviation in flux\ndensity of NGC 3079 from measurements of all channels, divided by the mean flux density of all channels,\nexpressed as a percentage. e After editing.\n\n1281 MHz\n\nDECLINATION (J2000)\n\n55 43 30\n00\n42 30\n00\n41 30\n00\n40 30\n00\n39 30\n00\n38 30 (a)\n10 02 10 05 00 55 50 45\n\n42 00\n41 10\n30\n00\n00\n\n50\n\n40 30\n\n40\n30 (c)\n\n00\n\n10 02 01 00 59 58 57 56\n39 30 (b)\n04 02 00 58 56 54 52\nRIGHT ASCENSION (J2000)\n\nFigure 3. The 1281 MHz maps of NGC 3079 (contours). Different resolutions are shown depending on UV weighting and tapering (see\nTable 2). The first contour is at 1.5σ in each case. (a) 1281 MHz contours over the DSS image (greyscale). A cross marks the position\nof the centre of the galaxy. Contour levels are at 0.9, 1.5, 3.0, 5.0, 10, 20, 40, 80, 160, and 300 mJy beam−1 . The peak brightness is\n384 mJy beam−1 and the beam is 23.55′′ × 19.75′′ at a position angle of 52.1◦ . (b) Medium-resolution map (contours plus greyscale)\nwith contour levels at 0.4, 0.8, 1.2, 2.5, 6.0, 12, and 25 mJy beam−1 . The peak brightness is 201 mJy beam−1 and the beam is 7.33′′\n× 5.21′′ at 48.1◦ . The greyscale ranges from 0 to 25 mJy beam−1 . (c) High-resolution map showing the details of the circumnuclear\nregion. Contours are at 0.2, 0.5, 1.0, 2.0, and 3.5 mJy beam−1 . The peak brightness is 130 mJy beam−1 and the beam is 3.22′′ × 2.24′′\nat 38.2◦ . The greyscale ranges from 0 to 5 mJy beam−1 .\n\nc\n\nRAS, MNRAS 000, 1–11\n\n\fJ. A. Irwin and D. J. Saikia\nDECLINATION (J2000)\n\n6\n\nWENSS [0.3 GHz]\n\nNVSS [1.4 GHz]\n\n55 44\n43\n42\n41\n40\n39\n38\n37 (a)\n\n(b)\n\n10 02 20 10 00 50 40\n\nFIRST [1.4 GHz]\n55 41 45\n30\n15\n00\n40 45\n30\n15\n00\n39 45\n(c)\n10 02 02 00 58 56 54\n\n15 05 55 45\n\nRIGHT ASCENSION (J2000)\nFigure 4. (a) WENSS map of NGC 3079 with contour levels at 6.6 (1.5σ), 10.5, 20, 50, 100, 250, 500, 1000, and 1400 mJy beam−1 .\nThe peak brightness is 4.76 Jy beam−1 and the beam is 54.0′′ × 65.38′′ at a position angle of 0.0◦ . (b) NVSS map, with contour levels\nat 0.72 (1.5σ), 1.0, 2.0, 4.0, 8.0, 15, 30, 60, 150, 300, and 460 mJy beam−1 . The peak brightness is 472 mJy beam−1 and the beam is\n45.0′′ × 45.0′′ at 0.0◦ . (c) FIRST map with contour levels at 0.225 (1.5σ), 0.5, 1.0, 2.0, 4.0, 8.0, 15, 30, 60, 120, and 170 mJy beam−1 .\nThe peak brightness is 173 mJy beam−1 and the beam is 5.4′′ × 5.5′′ at 0.0◦ . There are visible stripes in this image parallel to the\ndirection of the major axis.\n\n.1e3\n\n.1e2\n326 MHz\n615 MHz\n\n1.\n\n1281 MHz\n\nFlux (Jy)\n.1\n\n.1e–1\n\n.1e–2\n\n1e+08\n\n1e+10\n\n1e+12\n\n1e+14\n\n1e+16\n\nFrequency (Hz)\n\nFigure 5. Spectrum of NGC 3079, taken from NED, and including the new GMRT flux density points (shown slightly larger) at 326,\n615, and 1281 MHz.\n\nTable 3. Global Radio Continuum Properties\n326 MHz\nFlux Density (Jy)\nSpectral Power (1022 W Hz−1 )\nGlobal Spectral Indexa\nMean Spectral Indexb\n\n326 → 615\n\n2.8 ± 0.3\n9.1 ± 0.9\n\n615 MHz\n\n615 → 1281\n\n1281 MHz\n\n1.74 ± 0.09\n5.7 ± 0.3\n−0.75 ± 0.10\n−0.92 ± 0.04\n\n0.85 ± 0.03\n2.8 ± 0.1\n−0.98 ± 0.04\n−1.02 ± 0.05\n\na Spectral index as determined from the total flux densities given in this table.\nb Mean as determined over a region that is equal in size between the two spectral index maps, i.e. that shown\nin Fig. 5c. See text for discussion of errors.\n\nc\n\nRAS, MNRAS 000, 1–11\n\n\fGMRT Observations of NGC 3079\n\n7\n\nFigure 6. (a) Spectral index map between 326 and 615 MHz (Sν ∝ ν α ). Contours are at −2, −1.5, −1, −0.5, and 0. The greyscale is\nshown at the top and so throughout. The mean of this map is −0.96 (−0.92 if restricted to the region shown in c). A typical error on\nany point is 0.10 (see text). (b) Spectral index map between 615 and 1281 MHz with contours at −1.5, −1, and −0.5. The map mean\nis −1.01 (−1.02 if restricted to the region shown in c). A typical error on any point is 0.1. (c) Average of maps (a) and (b). Contours\nare at −1.0 and −0.75. The mean of the map is −0.97 and the rms is 0.18.\n\n3.1.3\n\n1281 MHz\n\nAt the highest frequency (Fig. 3), we again see emission related to the northern loop at RA ∼ 10 01 55, DEC ∼ 55 43\n18, a feature related to the giant eastern loop at RA ∼ 10\n02 03, DEC ∼ 55 42 00, and the two western extensions. At\nthese higher resolutions, we also detect details of the nuclear\nradio lobes. Fig. 3b, for example, can be compared to the\n1420 MHz FIRST image of Fig. 4c which is quite comparable in structure, except that our 1281 MHz image has a\nslightly lower resolution and shows some additional emission\naway from the plane. (Note that the FIRST image contains\na noticeable stripe.) Fig. 3c reveals the lobes' substructure in\nexquisite detail, especially the loop-like nature of the eastern\nlobe (cf. Duric & Seaquist 1988). The Hα emission occurs\nroughly in the region of the gap between the eastern loop\nand the nucleus (Cecil et al. 2001).\n\n3.1.4\n\nSummary of Radio Continuum Structure\n\nEach data set set has its own limitations, via uv coverage,\nspatial resolution, and possible residual errors which could\nnot be eliminated. We will therefore consider a feature to be\nreal only if it is observed at more than one frequency (note\nthat all data were taken on different dates, Table 2) or if\nit is observed in another independent observation using a\ndifferent telescope. Thus we summarize the structures that\nwe believe to be real as follows:\n1. The western extension (Fig. 1a) which resolves into\ntwo distinct extensions (Fig. 1c, Fig. 2a, 2b, Fig. 3a, 3b, Fig.\n4a, and is also seen in HI, Irwin & Seaquist 1987). These features extend to ∼ 10 kpc, roughly flank the western nuclear\nradio lobe and may be associated with it.\nc\n\nRAS, MNRAS 000, 1–11\n\n2. The northern loop (Fig. 1b, c, Fig. 3a and HI, Irwin\n& Seaquist 1991) of 3.8 kpc diameter and extending 7.2 kpc\nfrom the major axis. This loop appears to be associated with\nthe disk.\n3. The giant eastern radio loop (Fig. 2a, 2b, Fig. 3a,\nFig. 4a) of 5.1 kpc diameter and extending 11 kpc from\nthe major axis. It is offset from the eastern nuclear radio\nlobe but could still be related to larger scale and/or earlier\nnuclear outflow.\n4. The offset, curved emission on the south tip of the\nmajor axis (Fig. 1a, 1b, 1c, Fig. 4b and HI, Irwin & Seaquist\n1991), suggesting that there may be motion through broader\nscale IGM gas.\n\n3.2\n\nSpectral Index Maps\n\nTo make the spectral index maps, we took Fig. 1c, Fig.\n2b, and Fig. 3a, which are all at similar spatial resolutions, smoothed them to a common resolution, and blanked\nall points below a level of 5 sigma. Spectral index maps\n(Sν ∝ ν α ) were then formed and are shown in Fig. 6. Fig.\n6a shows the 326-615 MHz spectral index and Fig. 6b shows\nthe spectral index map between 615 and 1281 MHz. To estimate the error in the spectral index maps, at each freuency\nwe extracted a map of noise from a region in which there\nwas no emission. We then added this noise map to the map\nof the emission region of NGC 3079. This resulted in 3 maps\nof emission with added noise typical of that data set. New\nspectral index maps were then formed from the noise-added\nimages. We then formed a map of the difference between\nthe noise-added spectral index maps and the original spectral index maps. The rms of these difference maps is typical\n\n\f8\n\nJ. A. Irwin and D. J. Saikia\n\nof the error on any individual point in Figs. 6a and 6b, i.e.\n∼ 0.1.\nIn Table 3, we list values of the spectral index, as determined from the total fluxes listed in Table 3 (the Global\nspectral index) and as determined from the mean of the spectral index maps over equivalent regions (the Mean spectral\nindex). Note that the mean spectral index, which applies to\nhigh S/N regions, shows very little change with changing frequency and the global spectral index is consistent with these\nvalues between 615 and 1281 MHz (α = −0.92 to −1.02).\nHowever, the 326−615 MHz global value is flatter at −0.75.\nThis suggests that there may be more faint extended emission at 326 MHz which remained undetected. There may indeed be some trend, however, for stronger changes in spectral index in the high latitude gas than in the disk. For\nexample, extrapolating the 615 MHz emission in the broad\nextended halo region using α = −0.98 to 326 MHz should\nhave revealed as extended a halo in Fig. 1c above the noise.\nA trend towards a flatter spectral index at lower frequencies\ncan also be observed in the global spectrum (Fig. 5) when\nother independent data points are considered. Flattening of\nthe spectral index at lower frequencies in the non-thermal\ndomain has been observed before in other galaxies. Israel\n& Mahoney (1990) attribute such flattening to thermal absorption but this is unlikely to play a major role in our\ndata since the mean spectral index, which applies mainly to\nthe galaxy disk where most of the thermal gas should occur, shows only very minor flattening. Energy losses at the\nhigher frequencies seems more likely (Hummel 1991).\nIn this regard, it is interesting to examine the distribution of spectral index as shown in Fig. 6a and Fig. 6b for\ndifferences. We note that there are differences between the\nmaps that are greater than a typical error on any point. For\nexample, a map of the difference between Fig. 6a and 6b\n(not shown) has an rms of 0.49 whereas a typical error bar\nis about 0.2. However, closer examination shows that the\nlarger differences occur near the edges of the maps (where\nthe S/N is lower) or in regions in which there are strong intensity gradients (where 1′′ errors in registration can make\nlarger changes in the measured value of α). Therefore, in the\nregion shown in Fig. 6c, we see no convincing evidence for\nchanges in the spectral index with frequency above the error\nbars. Therefore, we averaged Fig. 6a and 6b to create a map\nof the average spectral index, shown in Fig. 6c.\nFig. 6c has a mean of α = −0.97 and an rms of 0.18\nwith a typical error less than 0.1. There are hints that the\nspectral index may flatten at the bases of extensions (e.g.\non the west side). The region centered on the nucleus clearly\nhas a flatter spectral index than in other regions of the disk,\ne.g. a mean of −0.73 in the central ≈ 30′′ diameter region, in\nagreement with previous observations of this region (Duric\n& Seaquist 1983). The flatter values near the nucleus are\nconsistent with the fact that this is a region in which cosmic\nray acceleration is occurring and particles are younger.\n3.3\n\nComputation of Minimum Energy Parameters\n\nFrom the mean spectral index map (Fig. 6c) and one total\nintensity map (the 615 MHz map that was used as to create\nthe images of Fig. 6), we can compute the following minimum energy parameters (see Pacholczyk 1970, Duric 1991):\nthe cosmic ray energy density, uCR , the cosmic ray elec-\n\ntron diffusion length, LD , magnetic field strength, B, and\nthe particle lifetime, t. These quantities are computed for\neach pixel and represent means along a line of sight. A line\nof sight distance, and therefore a geometry, is required for\nthese calculations. We also require assumptions regarding\nthe lower and upper frequency cutoffs of the spectrum, ν1\nand ν2 , and the ratio of the heavy particle energy to the electron energy, k. (See Irwin et al. 1999 for a previous example.)\nValues which have been used are specified via several models\nwhich are listed in Table 4. In Fig. 7, we show the results for\nModel 1 which uses an inclined disk, k = 40, ν1 = 107 Hz\nand ν2 = 1011 Hz. Table 4 lists the means calculated over\nthese maps as well as those of the other models.\nThe results for Models 1 to 4 (Table 4) show that\nchanges in geometry (inclined disk or oblate spheroid) and\nchanges in the upper frequency cutoff make relatively small\ndifferences in the results. The main differences are due to the\nassumption of heavy particle to electron energy (cf. Model\n1, Model 2) which introduce variations in the minimum energy parameters of order a factor of ≈ 1.5. Thus, we expect\nModel 1 (Fig. 7) to be a good representation of the data to\nwithin a factor of ≈ 2. Note that this choice affects only the\nabsolute scale of the maps of Fig. 7 and not the point to\npoint variation.\nThe fact that the measured flux densities for NGC 3079\nfall within the non-thermal regime of the spectrum (Fig. 5)\nindicates that the thermal fraction should be very small.\nHowever, point to point variation in thermal fraction could\nchange the appearance of the minimum energy parameter\nmaps. Condon (1992) has provided an estimate (thought to\nbe correct to within a factor of ≈ 2) of the thermal fraction in spiral galaxies, as measured globally, viz. S/ST ∼\n\n\u0001(0.1−|αN T |)\n\n1 + 10 ν/GHz\n, where αNT is the non-thermal\nspectral index, S is the total flux density and ST is the\nflux density due to the thermal component. Taking αNT to\nbe −0.97 (from the mean spectral index map of Fig. 6c),\nwe find that only 3.6%, 6%, and 11% of the total emission\ncould be due to thermal components at 326, 615, and 1281\nMHz, respectively. To see what such a contribution might\ndo to the calculation of the minimum energy parameters,\nwe subtracted the above fractions from the total intensity\nimages at the 3 frequencies, recomputed the spectral index\nmap and recomputed the minimum energy maps. These results are also listed in Table 4 (Model 5) and show that there\nis a negligible difference in the minimum energy parameters\nas a result of possible thermal contributions.\nIn Fig. 7, we also show a map of power, P = U/t,\nwhere U is the cosmic ray energy density, uCR (Fig. 7a),\nintegrated along a line of sight and t is the particle lifetime\n(Fig. 7d). The result is identically, P = (1 + k) L, where\nL is the observed luminosity at a point. Thus the map of\nP closely resembles the map of total flux density but does\nnot match it exactly because the computation of L requires\nan integration over frequency which is dependent on spectral\nindex, and the spectral index is different at different points in\nthe map. The map of P represents the rate at which cosmic\nrays must be accelerated in order to maintain equilibrium.\nIntegrated over the map, the total power is PT = 9.2 ×\n1041 ergs s−1 . The total energy in cosmic rays is UT =\n1.1 × 1057 ergs. These values are minima since not all of the\ngalaxy's emission is represented in the regions shown in Fig.\nc\n\nRAS, MNRAS 000, 1–11\n\n\fGMRT Observations of NGC 3079\n7. In comparison, the values for the Galaxy are PT ∼ 2 ×\n1040 ergs s−1 and UT ∼ 1055 ergs (Condon 1992). Thus the\ncosmic ray energy generation rate and total energy are two\norders of magnitude higher in NGC 3079 than in the Galaxy.\nThe spectral power of Table 3 suggests a supernova rate of\n0.27 yr−1 (see Condon 1992) if all emission has this origin.\nThis is clearly an upper limit since some of the emission is\ndue to the AGN and associated outflow.\nAlthough the total cosmic ray energy and power are\nhigher than the Galaxy, they are not atypical of spiral galaxies (Duric 1991). Our average magnetic field strength of ∼\n10 μGauss, for example, agrees with the 12 μGauss found\nfor NGC 6946 (Ehle & Beck 1993). In addition, the distribution of values is as expected. The magnetic field strength,\nenergy density, and power are all higher near the nucleus\nwhere there is much activity and correspondingly, the lifetime of the particles and the diffusion length are shorter. We\nnote, in addition, that the peak power of 8 × 1038 ergs s−1\nis considerably smaller than the power of the X-ray core in\nthis galaxy (1042−43 ergs s−1 , Sec. 1).\n\n4\n\nDISCUSSION\n\nNGC 3079 is a unique nearby laboratory for studying the\npresence of radio jets in a spiral galaxy and the effect that\nthese might have on the global characteristics of the galaxy.\nAlthough little else has been seen in the way of such welldefined radio lobes in a spiral, recent observations of Abell\n428 have also revealed a classical double-lobed radio source\nassociated with a disk galaxy (Ledlow et al. 1998, Ledlow et\nal. 2001), suggesting that NGC 3079 is no longer unique. Our\nnew GMRT observations have revealed not only the details\nof the nuclear radio structure (e.g. Fig. 3c) at high (3′′ )\nresolution, but broad scale radio continuum emission (e.g.\nFig. 1a) at low (55′′ ) resolution and much substructure.\nIt appears that much of the extended emission around\nNGC 3079 is related to the disk. This is seen via the envelope\nof emission whose morphology follows the disk (Fig. 1a) and\nalso from at least one feature which forms a kpc-scale loop\nto the east of the northern tip of the galaxy (Fig. 1b) which\nhas an HI counterpart. Thus, the radio continuum features\nare similar to those found in NGC 5775 in which extraplanar\nfeatures and supershells are detected in every component of\nthe ISM (Lee et al. 2001) or NGC 2613 in which a large\nopen-topped radio continuum arc with some associated HI\nspans much of the galaxy (Chaves & Irwin 2001). Neither of\nthe latter two galaxies are known to harbour an AGN.\nThe nuclear radio emission and radio lobes have been\nwell-delineated by our observations. In addition, large radio\nextensions and loops are seen which may be associated with\nit. This includes the two western extensions and possibly the\ngiant eastern loop best seen at 615 MHz which is somewhat\noffset from a direct extension of the eastern nuclear lobe.\nFig. 8 shows the western extensions and eastern loop in relation to the high resolution nuclear radio lobes. Indeed the\nplacement of these features and their similar sizes are suggestive of a nuclear origin. If the two large features on either\nside of the galaxy are indeed associated with the nuclear\noutflow then they indicate regions of previous outflow and\nsuggest that the nuclear activity in NGC 3079 is episodic. If\nwe extrapolate a particle lifetime of 108 yrs (Fig. 7d) and use\nc\n\nRAS, MNRAS 000, 1–11\n\n9\n\nFigure 8. Superimposition of Fig. 2a (contours) over Fig. 3b\n(greyscale). The greyscale ranges from 2 to 10 mJy beam−1 .\n\nthe outer distance of the giant eastern loop (11 kpc, Sect.\n3.1.2) then the required average bulk speed of the particles\nfrom the disk to this distance is ∼ 100 km s−1 .\nThe presence of offset radio continuum and HI emission\nat the southern tip of the major axis argues for some motion\nwith respect to an IGM and this may also be affecting the\nlocation of the eastern loop. However, other effects may also\nbe important. For example, the fact that the VLBI jet direction is offset from the direction of the nuclear radio lobes\nargues either that the source outflow direction is changing\nwith time or that the nuclear jets are bending through the\ngalaxy's ISM and being focussed along the minor axis until\nthe outflow moves from an ISM-dominated region to an IGM\ndominated region. We speculate that the emission around\nNGC 3079 may be similar to what has been observed at low\nfrequencies around M 87 in which the galaxy is embedded\nin a complex IGM in its immediate vicinity which is due to\nits own nuclear outflow (Owen et al. 2000).\n\n5\n\nCONCLUSIONS\n\nWe have observed the double-lobed spiral galaxy, NGC 3079\nusing the GMRT at three frequencies and detected structure over resolutions from 3′′ to 56′′ . At high resolution, the\nstructure of the nuclear radio emission is shown in exquisite\ndetail (Fig. 3c). In addition, we have detected a number of\nnew intermediate and broad scale features, namely:\n1. Two western extensions above and below the western\nnuclear radio lobe which reach ∼ 10 kpc from the galaxy's\ndisk. These features have associated HI emission.\n2. A giant eastern radio loop, best seen in Fig. 2a or Fig.\n8, which is slightly offset from a line extending through the\nnucleus and the eastern radio lobe. The giant loop extends\nto 11 kpc from the disk.\n3. A northern loop, best seen in Fig. 1b. There is a\nlarge HI arc at this position. It is 3.8 kpc in diameter and\nextends 7.2 kpc from the major axis. This loop appears to\nhave originated in the disk.\n4. A broad halo of emission with a vertical scale height\nof at least 4.8 kpc, which follows the disk of the galaxy.\n\n\f10\n\nJ. A. Irwin and D. J. Saikia\nTable 4. Minimum Energy Parameters\nModela\n(1)\n(2)\n(3)\n(4)\n(5)\n\nInclined\nInclined\nInclined\nInclined\nInclined\n\nDisk (k = 40, ν2 = 1011 Hz)\nDisk (k = 100, ν2 = 1011 Hz)\nDisk (k = 40, ν2 = 1010 Hz)\nOblate Spheroid (k = 40, ν2 = 1011 Hz)\nDisk (k = 40, ν2 = 1011 Hz, 'thermal subtracted')\n\nUCR\n(eV cm−3 )\n\nLD\n(Kpc)\n\nB\n(μGauss)\n\nt\n(Myrs)\n\n8.03\n13.4\n7.82\n8.42\n8.28\n\n1.38\n1.07\n1.40\n1.34\n1.36\n\n9.32\n12.1\n9.21\n9.58\n9.47\n\n88.1\n59.1\n116.3\n82.4\n96.7\n\na All models adopt a semi-major axis of 131.5′′ (measured to 5σ from the 615 MHz map used to create Fig. 6), a semi-minor axis of 60′′ , an inclination of 84.3◦ (Irwin & Seaquist 1991), and a lower frequency\ncutoff of ν1 = 107 Hz.\n\n5 1015 20 1.0 1.5 2.0 6 10 14\nL_D\n\nB\n\nt\n\nP\n\nDECLINATION\n\n55 42 30 u_CR\n00\n41 30\n00\n40 30\n00\n39 30\n(a)\n00\n10 02 04 00 56 52\n\n100 200 2 4 6 8\n\n(b)\n\n00 56 52\n\n(c)\n\n00 56 52\n\n(d)\n\n00 56 52\n\n(e)\n\n00 56 52\n\nRIGHT ASCENSION\nFigure 7. Minimum energy values, computed as means over a line of sight at each pixel (except for e) corresponding to Model 1 of\nTable 4. The greyscale range is shown at the top and so throughout. (a) Cosmic ray energy density. Contours are at 2, 4, 6, 10, and 18\neV cm−3 with minimum and maximum values of 2.1 and 24.0 eV cm−3 , respectively. The total (cosmic ray plus magnetic field) energy\ndensity would be 7/4 times these values. (b) Diffusion length. Contours are at 0.8, 1, 1.5, and 2 kpc with minimum and maximum values\nof 0.7 and 2.4 kpc. (c) Magnetic field strength. Contours are at 6, 8, 12, and 15 μGauss with minimum and maximum values of 5.0 and\n16.8 μGauss. (d) Particle lifetime. Contours are at 20, 40, 80 and 160 Myrs with minimum and maximum value of 10 and 212 Myr. (e)\nMap of total power along a line of sight. Contours are at 0.15, 0.3, 1, 3, and 6 × 1038 ergs s−1 with minimum and maximum values at\n0.04 and 8.4 × 1038 ergs s−1 .\n\n5. Emission at the southern tip of the major axis that\nis offset from the optical major axis suggesting that there\nmay be motion through broader scale IGM gas.\n\nthat of our Milky Way but the parameters, in general, are\ntypical of spiral galaxies.\n\nNo emission has been detected from either companion\ngalaxy.\nWe suggest that Features 1 and 2 above may be associated with earlier nuclear outflow in which case the average outflow velocity would be ∼ 100 km s−1 . In addition,\nthe IGM that is implied in 5, above, could be a local IGM,\nformed via outflow from NGC 3079 itself.\nWe have also computed spectral index maps over a restricted spatial region and have computed maps of minimum energy parameters for this galaxy, including the cosmic\nray energy density, the diffusion length, the magnetic field\nstrength, the particle lifetime (each of these representing averages along a line of sight) and finally the power. The total\nenergy content is several orders of magnitude larger than\n\nACKNOWLEDGMENTS\nJAI wishes to thank the scientists and staff of NCRA, Pune,\nfor graciously allowing her to work at this institute during\na sabbatical year. The GMRT is a national facility operated\nby the National Centre for Radio Astrophysics of the Tata\nInstitute of Fundamental Research. This research has made\nuse of the NASA/IPAC extragalactic database (NED) which\nis operated by the Jet Propulsion Laboratory, Caltech, under\ncontract with the National Aeronautics and Space Administration.\nc\n\nRAS, MNRAS 000, 1–11\n\n\fGMRT Observations of NGC 3079\nREFERENCES\nBaan W. A., Irwin J. A., 1995, ApJ, 446, 602\nde Bruyn A. G., 1977, A&A, 58,221\nCecil G., Bland-Hawthorn J., Veilleux S., Filippenko A. V., 2001,\nApJ, 555, 338\nCecil G., Bland-Hawthorn J., Veilleux S., 2002, ApJ, 576, 745\nChaves T. A., Irwin J. A., 2001, ApJ, 557, 646\nCondon J. J., 1983, ApJS, 53, 459\nCondon J. J., 1987, ApJS, 65, 485\nCondon J. J., 1992, ARAA, 30, 575\nDouglas J. N., Bash F. N., Bozyan F. A., Torrence G. W., Wolfe\nC., 1996, AJ, 111, 1945\nDuric N., 1991, in ASP Conf. Ser. 18, The Interpretation of Modern Synthesis Observations of Spiral Galaxies, ed. N. Duric,\nP. Crane (San Francisco: ASP), 17\nDuric N., Seaquist E. R., 1988, ApJ, 326, 574\nDuric N., Seaquist E. R., Crane P. C., Bignell R. C., Davis L. E.,\n1983, ApJ, 273, L11\nEhle M., Beck R., 1993, A&A, 273, 45\nHummel E., 1991, A&A, 251, 442\nIrwin J. A., Seaquist E. R., 1987, ApJ, 313, L91\nIrwin J. A., Seaquist E. R., 1988, ApJ, 335, 658\nIrwin J. A., Seaquist E. R., 1990, ApJ, 353, 469\nIrwin J. A., Seaquist E. R., 1991, ApJ, 371, 111; erratum 415, 415\nIrwin J. A., English J., Sorathia B., 1999, AJ, 117, 2102\nIsrael F. P., Mahoney M. J., 1990, ApJ, 352, 30\nIyomoto N., Fukazawa Y., Nakai N., Ishihara Y., 2002, ApJ, 561,\nL69\nKondratko P. K., Greenhill L. J., Moran J. 2000, AAS, 197,\n#108.07\nLedlow M. J., Owen F. N., Keel W. C., 1998, ApJ, 495, 227\nLedlow M. J., Owen F. N., Yun M. S., Hill J. M., 2001, ApJ,\n552,120\nLee S.-W., Irwin J. A., Dettmar R.-J., Cunningham C. T., Golla\nG., Wang Q. D., 2001, A&A, 377, 759\nNiklas S., Klein U., Braine J., & Wielebinski R. 1995, A&AS, 114,\n21\nOwen F. N., Eilek J. A., Kassim N. E., 2000, ApJ, 543, 611\nPacholczyk A. G., 1970, Radio Astrophysics (San Francisco: Freeman)\nPietsch W., Trinchieri G., Vogler A., 1998, A&A, 340, 351\nRengelink R. B., Tang Y., de Bruyn A. G., Miley G. K., Bremer\nM. N., Roettgering H. J. A., Bremer M. A. R., 1997, A&AS,\n124, 259\nTrotter A. S., Greenhill L. J., Moran J. M., Reid M. J., Irwin J.\nA., Lo K.-Y., 1998, ApJ, 495, 740\n\nc\n\nRAS, MNRAS 000, 1–11\n\n11\n\n\f"}