{"id": "http://arxiv.org/abs/astro-ph/0110539v1", "guidislink": true, "updated": "2001-10-24T21:34:43Z", "updated_parsed": [2001, 10, 24, 21, 34, 43, 2, 297, 0], "published": "2001-10-24T21:34:43Z", "published_parsed": [2001, 10, 24, 21, 34, 43, 2, 297, 0], "title": "Heating and Ionization of X-Winds", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0110689%2Castro-ph%2F0110682%2Castro-ph%2F0110097%2Castro-ph%2F0110564%2Castro-ph%2F0110348%2Castro-ph%2F0110431%2Castro-ph%2F0110149%2Castro-ph%2F0110277%2Castro-ph%2F0110383%2Castro-ph%2F0110434%2Castro-ph%2F0110071%2Castro-ph%2F0110040%2Castro-ph%2F0110618%2Castro-ph%2F0110170%2Castro-ph%2F0110365%2Castro-ph%2F0110346%2Castro-ph%2F0110428%2Castro-ph%2F0110083%2Castro-ph%2F0110398%2Castro-ph%2F0110033%2Castro-ph%2F0110201%2Castro-ph%2F0110627%2Castro-ph%2F0110057%2Castro-ph%2F0110476%2Castro-ph%2F0110527%2Castro-ph%2F0110285%2Castro-ph%2F0110009%2Castro-ph%2F0110541%2Castro-ph%2F0110519%2Castro-ph%2F0110224%2Castro-ph%2F0110203%2Castro-ph%2F0110622%2Castro-ph%2F0110051%2Castro-ph%2F0110223%2Castro-ph%2F0110650%2Castro-ph%2F0110175%2Castro-ph%2F0110495%2Castro-ph%2F0110014%2Castro-ph%2F0110551%2Castro-ph%2F0110388%2Castro-ph%2F0110070%2Castro-ph%2F0110662%2Castro-ph%2F0110207%2Castro-ph%2F0110077%2Castro-ph%2F0110262%2Castro-ph%2F0110395%2Castro-ph%2F0110089%2Castro-ph%2F0110107%2Castro-ph%2F0110088%2Castro-ph%2F0110013%2Castro-ph%2F0110441%2Castro-ph%2F0110010%2Castro-ph%2F0110340%2Castro-ph%2F0110442%2Castro-ph%2F0110066%2Castro-ph%2F0110142%2Castro-ph%2F0110074%2Castro-ph%2F0110198%2Castro-ph%2F0110683%2Castro-ph%2F0110325%2Castro-ph%2F0110539%2Castro-ph%2F0110185%2Castro-ph%2F0110103%2Castro-ph%2F0110338%2Castro-ph%2F0110006%2Castro-ph%2F0110257%2Castro-ph%2F0110153%2Castro-ph%2F0110391%2Castro-ph%2F0110484%2Castro-ph%2F0110373%2Castro-ph%2F0110502%2Castro-ph%2F0110545%2Castro-ph%2F0110194%2Castro-ph%2F0110644%2Castro-ph%2F0110350%2Castro-ph%2F0110578%2Castro-ph%2F0110629%2Castro-ph%2F0110274%2Castro-ph%2F0110642%2Castro-ph%2F0110563%2Castro-ph%2F0110238%2Castro-ph%2F0110163%2Castro-ph%2F0110424%2Castro-ph%2F0110385%2Castro-ph%2F0110458%2Castro-ph%2F0110438%2Castro-ph%2F0110211%2Castro-ph%2F0110676%2Castro-ph%2F0110585%2Castro-ph%2F0110635%2Castro-ph%2F0110556%2Castro-ph%2F0110702%2Castro-ph%2F0110157%2Castro-ph%2F0110529%2Castro-ph%2F0110093%2Castro-ph%2F0110706%2Castro-ph%2F0110318%2Castro-ph%2F0110562%2Castro-ph%2F0110470%2Castro-ph%2F0110273%2Castro-ph%2F0110658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Heating and Ionization of X-Winds"}, "summary": "In order to compare the x-wind with observations, one needs to be able to\ncalculate its thermal and ionization properties. We formulate the physical\nbasis for the streamline-by-streamline integration of the ionization and heat\nequations of the steady x-wind. In addition to the well-known processes\nassociated with the interaction of stellar and accretion-funnel hot-spot\nradiation with the wind, we include X-ray heating and ionization, mechanical\nheating, and a revised calculation of ambipolar diffusion heating. The\nmechanical heating arises from fluctuations produced by star-disk interactions\nof the time dependent x-wind that are carried by the wind to large distances\nwhere they are dissipated in shocks, MHD waves, and turbulent cascades. We\nmodel the time-averaged heating by the scale-free volumetric heating rate,\n$\\Gamma_{\\rm mech} = \\alpha \\rho v^3 s^{-1}$, where $\\rho$ and $v$ are the\nlocal mass density and wind speed, respectively, $s$ is the distance from the\norigin, and $\\alpha$ is a phenomenological constant. When we consider a\npartially-revealed but active young stellar object, we find that choosing\n$\\alpha \\sim 10^{-3}$ in our numerical calculations produces temperatures and\nelectron fractions that are high enough for the x-wind jet to radiate in the\noptical forbidden lines at the level and on the spatial scales that are\nobserved. We also discuss a variety of applications of our thermal-chemical\ncalculations that can lead to further observational checks of x-wind theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0110689%2Castro-ph%2F0110682%2Castro-ph%2F0110097%2Castro-ph%2F0110564%2Castro-ph%2F0110348%2Castro-ph%2F0110431%2Castro-ph%2F0110149%2Castro-ph%2F0110277%2Castro-ph%2F0110383%2Castro-ph%2F0110434%2Castro-ph%2F0110071%2Castro-ph%2F0110040%2Castro-ph%2F0110618%2Castro-ph%2F0110170%2Castro-ph%2F0110365%2Castro-ph%2F0110346%2Castro-ph%2F0110428%2Castro-ph%2F0110083%2Castro-ph%2F0110398%2Castro-ph%2F0110033%2Castro-ph%2F0110201%2Castro-ph%2F0110627%2Castro-ph%2F0110057%2Castro-ph%2F0110476%2Castro-ph%2F0110527%2Castro-ph%2F0110285%2Castro-ph%2F0110009%2Castro-ph%2F0110541%2Castro-ph%2F0110519%2Castro-ph%2F0110224%2Castro-ph%2F0110203%2Castro-ph%2F0110622%2Castro-ph%2F0110051%2Castro-ph%2F0110223%2Castro-ph%2F0110650%2Castro-ph%2F0110175%2Castro-ph%2F0110495%2Castro-ph%2F0110014%2Castro-ph%2F0110551%2Castro-ph%2F0110388%2Castro-ph%2F0110070%2Castro-ph%2F0110662%2Castro-ph%2F0110207%2Castro-ph%2F0110077%2Castro-ph%2F0110262%2Castro-ph%2F0110395%2Castro-ph%2F0110089%2Castro-ph%2F0110107%2Castro-ph%2F0110088%2Castro-ph%2F0110013%2Castro-ph%2F0110441%2Castro-ph%2F0110010%2Castro-ph%2F0110340%2Castro-ph%2F0110442%2Castro-ph%2F0110066%2Castro-ph%2F0110142%2Castro-ph%2F0110074%2Castro-ph%2F0110198%2Castro-ph%2F0110683%2Castro-ph%2F0110325%2Castro-ph%2F0110539%2Castro-ph%2F0110185%2Castro-ph%2F0110103%2Castro-ph%2F0110338%2Castro-ph%2F0110006%2Castro-ph%2F0110257%2Castro-ph%2F0110153%2Castro-ph%2F0110391%2Castro-ph%2F0110484%2Castro-ph%2F0110373%2Castro-ph%2F0110502%2Castro-ph%2F0110545%2Castro-ph%2F0110194%2Castro-ph%2F0110644%2Castro-ph%2F0110350%2Castro-ph%2F0110578%2Castro-ph%2F0110629%2Castro-ph%2F0110274%2Castro-ph%2F0110642%2Castro-ph%2F0110563%2Castro-ph%2F0110238%2Castro-ph%2F0110163%2Castro-ph%2F0110424%2Castro-ph%2F0110385%2Castro-ph%2F0110458%2Castro-ph%2F0110438%2Castro-ph%2F0110211%2Castro-ph%2F0110676%2Castro-ph%2F0110585%2Castro-ph%2F0110635%2Castro-ph%2F0110556%2Castro-ph%2F0110702%2Castro-ph%2F0110157%2Castro-ph%2F0110529%2Castro-ph%2F0110093%2Castro-ph%2F0110706%2Castro-ph%2F0110318%2Castro-ph%2F0110562%2Castro-ph%2F0110470%2Castro-ph%2F0110273%2Castro-ph%2F0110658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In order to compare the x-wind with observations, one needs to be able to\ncalculate its thermal and ionization properties. We formulate the physical\nbasis for the streamline-by-streamline integration of the ionization and heat\nequations of the steady x-wind. In addition to the well-known processes\nassociated with the interaction of stellar and accretion-funnel hot-spot\nradiation with the wind, we include X-ray heating and ionization, mechanical\nheating, and a revised calculation of ambipolar diffusion heating. The\nmechanical heating arises from fluctuations produced by star-disk interactions\nof the time dependent x-wind that are carried by the wind to large distances\nwhere they are dissipated in shocks, MHD waves, and turbulent cascades. We\nmodel the time-averaged heating by the scale-free volumetric heating rate,\n$\\Gamma_{\\rm mech} = \\alpha \\rho v^3 s^{-1}$, where $\\rho$ and $v$ are the\nlocal mass density and wind speed, respectively, $s$ is the distance from the\norigin, and $\\alpha$ is a phenomenological constant. When we consider a\npartially-revealed but active young stellar object, we find that choosing\n$\\alpha \\sim 10^{-3}$ in our numerical calculations produces temperatures and\nelectron fractions that are high enough for the x-wind jet to radiate in the\noptical forbidden lines at the level and on the spatial scales that are\nobserved. We also discuss a variety of applications of our thermal-chemical\ncalculations that can lead to further observational checks of x-wind theory."}, "authors": ["H. Shang", "A. E. Glassgold", "F. H. Shu", "S. Lizano"], "author_detail": {"name": "S. Lizano"}, "author": "S. Lizano", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/324197", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0110539v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0110539v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "48 pages, 5 figures, ApJ in press. For better figures, go to\n  http://www.asiss.sinica.edu.tw/theory/prints.html", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0110539v1", "affiliation": "UNAM", "arxiv_url": "http://arxiv.org/abs/astro-ph/0110539v1", "journal_reference": null, "doi": "10.1086/324197", "fulltext": "ApJ in press\n\nHeating and Ionization of X-Winds\nHsien Shang1,2 , Alfred E. Glassgold3 , Frank H. Shu2\n\narXiv:astro-ph/0110539v1 24 Oct 2001\n\nAstronomy Department, University of California, Berkeley, CA 94720\nhshang@cfa.harvard.edu,fshu,aeg@astro.berkeley.edu\nand\nSusana Lizano\nInstituto de Astronomı́a, UNAM, 58090 Morelia, Michoacán, México\nlizano@astrosmo.unam.mx\n\nABSTRACT\nIn order to compare the x-wind with observations, one needs to be able to calculate its thermal and ionization properties. We formulate the physical basis for the\nstreamline-by-streamline integration of the ionization and heat equations of the steady\nx-wind. In addition to the well-known processes associated with the interaction of stellar and accretion-funnel hot-spot radiation with the wind, we include X-ray heating and\nionization, mechanical heating, and a revised calculation of ambipolar diffusion heating.\nThe mechanical heating arises from fluctuations produced by star-disk interactions of\nthe time dependent x-wind that are carried by the wind to large distances where they are\ndissipated in shocks, MHD waves, and turbulent cascades. We model the time-averaged\nheating by the scale-free volumetric heating rate, Γmech = αρv 3 s−1 , where ρ and v are\nthe local mass density and wind speed, respectively, s is the distance from the origin,\nand α is a phenomenological constant. When we consider a partially-revealed but active young stellar object, we find that choosing α ∼ 10−3 in our numerical calculations\n1\n\nPresent address: Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138\n\n2\n\nInstitute of Astronomy and Astrophysics, Academia Sinica, Taipei, TAIWAN\n\n3\n\nPhysics Department, New York University, NY 10003\n\n\f–2–\nproduces temperatures and electron fractions that are high enough for the x-wind jet\nto radiate in the optical forbidden lines at the level and on the spatial scales that are\nobserved. We also discuss a variety of applications of our thermal-chemical calculations\nthat can lead to further observational checks of x-wind theory.\nSubject headings: X-winds, Jets, Herbig-Haro Objects, Young Stellar Objects, YSO\n\n\f–3–\n1.\n\nIntroduction\n\nA refined and updated version of the disk-accretion paradigm for the formation of Sun-like\nstars has emerged in the last two decades through extensive observations and theoretical studies.\nIn addition to the building up of the new star by accretion from a disk formed by the collapse of\na rotating molecular cloud core, the formation of a low-mass star is accompanied by a remarkable\nbipolar outflow that can appear jet-like at optical and nearby wavelengths. Equally important is\nthe crucial role of magnetic fields in retarding the initial collapse and in guiding both the accretion\nflow that feeds the star and the outflow that removes excess angular momentum. In addition to the\nstrong evidence provided by the essentially universal detection of X-rays in low-mass young stellar\nobjects (YSOs), magnetic fields have been measured directly with the Zeeman effect (e.g., JohnsKrull and Valenti, 2000). Although the general outline of a theory of low-mass star formation\nhas emerged, the underlying mechanisms still need to be identified and understood, and strong\nefforts along these lines are in progress on a broad front, as can be seen in the reports at the recent\nconference Protostars and Planets IV (Mannings, Boss, and Russell 2000).\nOne of the main goals of the theory is to develop a rational description of the active flows close\nto the central engine, i.e., the accretion funnel and the wind. Although there is a consensus that\nthese flows are MHD in character, considerable disagreement exists over the specifics, as witnessed\nby the reviews of magnetocentrifugal winds at Protostars and Planets IV by Königl and Pudritz\n(2000; disk winds) and by Shu, Najita, Shang, and Li (2000; x-wind), as well as the earlier review\nof wind theory by Pudritz and Ruden (1993). Of course the only way to decide between alternative\ntheories or to validate any particular theory is to make detailed comparisons with observations.\nThus, it is the objective of the present paper to develop the basis for making such comparisons for\nthe case of the x-wind (Shu et al. 1994a; Shu et al. 1994b; Najita & Shu 994; Ostriker & Shu 1995;\nShu et al. 1995; henceforth Papers I-V). The x-wind model has the potential for understanding\nmany aspects of low-mass star formation because it provides well-defined dynamical solutions that\ncan be used to make detailed correlations and predictions of observational data. It should be\nclear that, because x-wind theory focuses on the inner region (or \"central engine\") of the star in\nformation of dimension 0.1 AU, observational tests require spectroscopy on the milli- arc-second\nspatial scale and better. Such observations are now becoming available with adaptive optics and\ninterferometric techniques, as well as with the Hubble Space Telescope.\nAs discussed by Shu et al. (2000), several crucial assumptions and implications of the x-wind\nmodel are supported by observations: the existence of a finite inner radius for a rapidly rotating\ninner disk; strong magnetization of the central star; magnetically channeled accretion; and phase\nrelations between stellar rotation and the accretion funnel and the outflow. The model can also\naccount for the large-scale kinematic properties of bipolar molecular outflows (Shu et al. 1991, 2000),\nand it has the potential to explain the optical observations of jets from young stellar objects. The\nlatter possibility is a consequence of the remarkable property of the x-wind, whose 180◦ bipolar\nlobes self-collimate towards the outflow axis into approximately cylindrical jets (Paper V). On this\nbasis, Shang, Shu, & Glassgold (1998, henceforth SSG) made synthetic images of optical jets that\n\n\f–4–\nbear a striking resemblance to the observed ones (see, e.g., Eislöffel et al. 2000).\nThese conclusions have been made on the basis of the dynamical solution of the x-wind model\nwhich gives the density, velocity, and magnetic field configuration4 . The images obtained by SSG\nwere obtained by using constant values of the temperature and electron fraction based on previous\nanalyses of the optical observations. The main goal of the present paper is to lay the foundation\nfor obtaining the physical properties of the x-wind from first principles in order to calculate the\ndistribution of the temperature, the ionization fraction, and other chemical abundances for the\nx-wind streamlines. These properties are required for calculating the fluxes of diagnostic lines and\ncontinua that observers can use to test the validity of the model.\nEven though the dynamics of the x-wind are largely decoupled from the thermal-chemical\nproperties, the calculation of these properties for a 2-dimensional flow is very difficult. The closest\nprevious work by Ruden, Glassgold, & Shu (1990, henceforth RGS; see also Glassgold, Mamon, &\nHuggins 1991 for a parallel chemical study) done before the x-wind solutions were obtained, assumed\nspherical symmetry. They tried to anticipate some aspects of the 2-d axisymmetric solutions by\nmodulating the radial density and velocity variations at small distances r. RGS found that radial\nwinds quickly cool and become weakly ionized with increasing r. The importance of the run of\nionization and temperature in outflows is well illustrated by the observations of optical jets, where\nphenomenological analyses of line strengths indicate that they are significantly ionized and hot,\nwith electron fractions xe ∼ 0.01 − 0.1 and temperatures T ∼ 5, 000 − 10, 000 K (e.g., Bacciotti\n2001). Shocks have long been the favored mechanism for producing these conditions (e.g., Raga,\nBöhm, and Cantò 1996; Hartigan, Bally, Reipurth, and Morse 2000). Aside from the \"final\" bow\nshocks with the ambient medium, associated with the Herbig-Haro objects, it has been unclear\nhow the central young stellar object (YSO) can affect the global properties of the jet at large\ndistances from the source. Bacciotti et al. (1995) suggested that the jet retains a high level of\nionization characteristic of the source region by virtue of slow radiative recombination in the flow.\nOur calculations support this idea, once we add an important missing ingredient, the ionization\nof the base of the wind by the X-rays that are observed to accompany essentially all YSOs (e.g.,\nFeigelson & Montmerle 1999).\nNot only are the X-rays effective in ionizing the wind close to the source, they also help maintain\nthe ionization level at large distances. The emissivity of the flow is determined by the temperature,\nand it is essential for understanding jets to also be able to achieve the high temperatures indicated\nby the observations of the optical forbidden lines. Here shocks can play an important role, and we\nwill develop a global model of wind heating based on stochastic shock dissipation. Although our\nmodel of mechanical heating is supported by MHD simulations (e.g., Ostriker et al. 1999), at this\nstage it is essentially phenomenological. By adopting physically reasonable parameters, we will be\nable to obtain images of jets that resemble the observations. We should also be able to relieve the\n4\n\nThe main physical requirements for the solution is that the electron fraction be large enough to justify the MHD\n\napproximation and the temperature be low enough to ignore thermal pressure.\n\n\f–5–\ndifficulties encountered by RGS, since the wide-angle component of the x-wind seems likely to be\nwarm and moderately ionized. In a reconsideration of ambipolar diffusion heating, we will find that\na new atomic coefficient provides a much reduced role for this process in warm atomic regions, in\ndisagreement with earlier results by Safier (1993).\nThe main goal of this paper is to develop a coherent thermal-chemical foundation for the xwind. We build on the previous study by RGS, but add important new processes for ionization\n(X-rays) and heating (mechanical or turbulent shock heating). As the main illustrative application,\nwe consider the jets as observed in optical forbidden lines. The rest of this paper is organized as\nfollows. In the next section §2, we give a general description of the model, and in the following\nsections we focus on X-ray ionization (§3), ambipolar diffusion heating (§4), and mechanical heating\n(§5). Modeling results are then presented in §6 for the case of an active solar-mass YSO in a partially\nrevealed phase. We then discuss further implications of the calculations in §7 in the context of future\ndetailed studies that bear directly on observations. The paper contains a number of appendices\nthat supplement the technical basis for §§2-5.\n\n2.\n\nFormulation of the Model\n\nThe calculation of the thermochemical properties of the x-wind is separable from the dynamical\nproblem (treated in Papers I-V) in the cold ideal MHD limit. As long as the electron fraction is\nlarge enough and the thermal energy is small enough (for the thermal pressure to be small compared\nwith the kinetic and magnetic energies), the MHD approximation can be made. We of course check\nthat the thermochemical calculations reported here satisfy these assumptions. Most of this section\nwill be devoted to formulating the thermal and chemical equations that need to be solved along\neach streamline. As discussed in §2.1, the streamlines are obtained on the basis of the dynamical\nsolution for the x-wind obtained by Shang (1998).\n\n2.1.\n\nDynamics\n\nThe exact numerical solution for the x-wind in Paper III does not provide a practical basis\nfor thermochemical modeling because it is restricted to the sub-Alfvènic region. Similarly, the\nasymptotic solution in Paper V does not apply at small distances. We use a semi-analytic approach\ndeveloped by Shang (1998), where a global x-wind solution is obtained by interpolating between the\ntwo extreme solutions developed in Paper II and Paper V. This solution applies to the steady and\naxisymmetric X-wind flow that we model here. It satisfies the conservation laws of mass, specific\nangular momentum, and energy, which are expressed in terms of the conserved quantities β(ψ),\nJ(ψ), and H(ψ) on the streamlines ψ as shown in Paper II. In steady state, the field lines co-rotate\nwith the star at angular velocity Ω∗ . Unlike Papers II and III, which employ a reference frame that\nrotates with the stellar angular velocity Ω∗ , we describe the flow in an inertial frame. We follow\n\n\f–6–\nPaper I in using non-dimensionalized equations based on the units for length, velocity, density, and\nmagnetic field: Rx , Ωx Rx , Ṁw /4πRx3 Ωx , (Ωx Ṁw /Rx )1/2 , where Ωx = Ω∗ is the angular velocity\nat the X-point Rx , and Ṁw is the mass-loss rate of the x-wind. Our calculation is restricted to\nthe case treated in Papers I-V of aligned magnetic and rotation axes. Many of the same physical\nprocesses discussed in the following sections would be operative in the more general case, but the\nrequired dynamical solutions do not exist yet.\nIn the asymptotic regime, an x-wind streamline ψ is represented in spherical coordinates r − θ\nby the parametric equations,\n2β̄\ncosh[F (C, 1)]\n(2-1)\nra =\nC\nand\nθa = sin−1 {sech[F(C, ψ)]},\n(2-2)\nwhere\n1\nF (C, ψ) ≡\nC\n\nZ\n\nψ\n0\n\nβ(ψ ′ )dψ ′\n,\n[2J(ψ ′ ) − 3 − 2Cβ(ψ ′ )]1/2\n\n(2-3)\n\nand the subscript a stands for asymptotic. The stream function ψ has the range 0 ≤ ψ ≤ 1 and\nlabels the mass fraction carried by the x-wind from the horizontal plane. The quantity β is the\nratio of the magnetic-to-mass-flux, i.e., MHD field-freezing in the co-rotating frame implies that the\nmagnetic field and mass flux are proportional to one another: B = βρu. The condition ∇ * B = 0\nrequires that β be conserved on streamlines, i.e., β = β(ψ). Similarly, the conservation of total\nspecific angular momentum requires that the amount carried by matter in the inertial frame, ̟vφ ,\nplus the amount carried by Maxwell torques, −̟Bφ B, per unit mass flux, ρu, is a function of ψ\nalone: ̟[vφ −β 2 ρ(vφ −̟)] = J(ψ). The function C is a slowly decreasing function of r introduced in\nPaper V that vanishes logarithmically when r → ∞, consistent with the vanishing of the current at\ninfinity, independent of streamline. The locus ψ = 1 is obtained by applying approximate pressure\nbalance, Bz2 = Bφ2 , across the wind-deadzone interface.\nIn the cold limit, the function β(ψ) cannot be chosen completely arbitrarily; otherwise the\nmagnetic field, mass flux, and mass density will diverge on the uppermost streamline (ψ → 1)\nas the x-wind leaves the x-region. For modeling purposes, Shang (1998) adopts the following\ndistribution of magnetic field to mass flux:\nβ(ψ) = β0 (1 − ψ)−1/3 ,\nwhere β0 is a numerical constant related to the mean value of β averaged over streamlines:\nZ 1\n3\nβ(ψ) dψ = β0 .\nβ̄ ≡\n2\n0\n\n(2-4)\n\n(2-5)\n\nThe singularity in equation (2-4) is of no real concern: it reflects the fact that the magnetic field\nB = βρu is nonzero on the uppermost x-wind streamline, where by definition ρ must become\nvanishingly small while u remains finite.\n\n\f–7–\nIn order to make contact with the inner solution, we follow Paper II and use pseudopolar\ncoordinates (s, φ, θ) with the origin of s at the x-point and the angle θ measured in the meridional\nplane starting from zero at the equator:\n̟ = 1 + s cos θ,\n\nz = s sin θ.\n\n(2-6)\n\nWhen r ≫ 1, s ≈ r and θ → π/2 − θ. Equations (2-1) and (2-2) now become,\n2β̄\ncosh[F (C, 1)],\nC\nθa = cos−1 {sech[F(C, ψ)]}.\nsa =\n\n(2-7)\n(2-8)\n\nNear the x-point, the magnetic field lines emerge uniformly and define a fan within a 60◦ sector\nabove the equatorial plane (0 ≤ θf ≤ π/3),\nZ\n1 ψ\nθf (ψ) = θf (0)\nβ(ψ ′ )dψ ′ ,\n(2-9)\nβ̄ 0\nwhere the subscript f stands for fan. The uppermost streamline with ψ = 1 emerges at θf = π/3\nand the lower-most streamline with ψ = 0 emerges at θf = 0.\nThe interpolation between the outer asymptotic and inner fan solutions is based on the equations,\n2β̄\n2β̄\ncosh[F (C, 1)] −\ncosh[F (Cx , 1)],\n(2-10)\ns(C) =\nC\nCx\nand\nθ(C, ψ) = αθf (ψ) + (1 − α)θa (C, ψ).\n(2-11)\nThe second term in equation (2-10) (with the constant Cx ) has been introduced so that the function\ns = s(C) reduces to zero at the x-point (s(Cx ) = 0). The reference value Cx is chosen so that\nequation (2-2) yields π/3, i.e. , the asymptotic streamlines occupy the same angular region as the\nfan emerging from the x-point (and are in approximate pressure balance). An interpolation function\nα(C, ψ) was chosen to make a smooth transition between the fan and the asymptotic solutions.\n\n2.2.\n\nHeating and Ionization\n\nThe equations governing the temperature T and electron fraction xe are\n3 DT\nD\n1\n=T\nln n(1 + xe + xHe )−3/2 +\n(G − L) ,\n2 Dt\nDt\n1 + xe + xHe\n\n(2-12)\n\nDxe\n= P − D.\n(2-13)\nDt\nwhere D/Dt = v * ∇ is the substantial time derivative along a streamline, P ≡ P/n and D ≡ D/n\nare ionization production and destruction rates (dimensions s−1 ), and G ≡ Γ/nk and L ≡ Λ/nk\n\n\f–8–\nare heating and cooling rates (dimensions K s−1 ). The Latin symbols P , D, G, and L are the\ncorresponding volumetric rates, and n is the total number of hydrogen nuclei per unit volume\n(usually denoted nH in the literature). We use n to define abundances, e.g., xe = ne /n is the\nelectron fraction, xHe is the He abundance, and (1 + xe + xHe )n is the total number density of\nparticles ignoring elements heavier than He. Many of the source terms in equations (2-12) and\n(2-13) were formulated in a unified way by RGS, and we use their expressions for individual terms\nin P , D, G, and L whenever possible. We discuss those terms in RGS which require change in §2.4\nand appendix A and B, and new ionization and heating sources in §§2-5. Table 1 lists the processes\nincluded in the present study.\nTwo basic time scales are those for adiabatic cooling and recombination. Near the source,\ntheir values for the fiducial model introduced in §6 are of the order of tens of seconds and days,\nrespectively. We usually omit explicit consideration of the effects of the ionization of He, and adopt\nxHe = 0.1 in calculations described in this paper. In the regions of main concern, the central part of\nthe wind in and around the jet, the dominant ionizing agents are the secondary electrons produced\nfollowing X-ray ionization of heavy elements. As long as xe > 3 × 10−3 , the inclusion of He would\nincrease xe by the factor (1 + xHe )1/2 or 5%.\n\n2.3.\n\nThe Accretion Hot Spot\n\nThe x-wind may be heated and ionized by several sources of radiation. In addition to the\nphotosphere, these include a \"hot spot\" produced by the infall of the accretion funnel onto the stellar\nsurface; the accretion disk, which scatters and re-emits absorbed stellar radiation and radiates\nenergy generated by viscous dissipation; and the star-disk magnetosphere, which emits thermal\nand nonthermal radiation in both soft (< 1 keV) and hard (> 1 keV) X-rays. Because we are\nmainly concerned with the upper streamlines (close to the axis) that constitute the bulk of the\nmass of the inner wind, we can safely ignore the disk radiation. Not only is the mean photon\nenergy smaller than for stellar radiation, the radiation emitted by the disk is significantly diluted\nby geometry and absorbed by the wind. The effects of disk radiation and gas-dynamic interactions\nwith the disk atmosphere are important for the lower streamlines, which constitute the wide angle\nwind. We focus here on the hot spot radiation and treat the X-rays in detail in §3.\nWe model the hot spot following Ostriker & Shu (1995). For an axisymmetric x-wind, the hot\nspot is an annulus located between co-latitudes θ1 and θ2 . The hot spot luminosity is\n\u0014\n\u0015\nR∗3 sin2 θ̄h 3R∗\nGM∗ ṀD\n−\n1+\n,\n(2-14)\nLh = (1 − f )\nR∗\n2Rx3\n2Rx\nwhere f is the fraction of the disk accretion rate ṀD that is lost by the x-wind (and thus (1 − f )\nis the mass transfer rate of the funnel flow). The hot spot covers a fraction Fh = cos θ1 − cos θ2 of\nthe surface area of the star, and the mean colatitude of the hot spot is sin θ̄h = Fh /(θ2 − θ1 ). We\nuse parameters for the fiducial case in §6 that are appropriate for the preferred model of Ostriker\n\n\f–9–\n\nTable 1.\n\nPhysical Processes\n\nProduction of Ionization\nH− photodetachment\n\n§2.4\n\nBalmer continuum photoionization\n\n§2.4, App. B\n\nElectronic collisional ionization\n\n§2.4\n\nX-Rays\n\n§3, App. C\nDestruction of Ionization\n\nRadiative recombination\n\n§2.4\nHeating\n\nPhotodetachment of H−\n\n§2.4\n\nBalmer continuum photoionization of H\n\n§2.4\n\n+\n\nH -H\n\n−\n\nneutralization\n\n§2.4, App. A\n\nAmbipolar Diffusion\n\n§4, App. D, App. E\n\nX-Rays\n\n§3\n\nMechanical\n\n§5\nCooling\n\nAdiabatic\nH\n\n−\n\n§2.2\n\nradiative attachment\n\nRecombination of H\n\n+\n\n§2.4\n§2.4\n\nLyman α\n\n§2.4\n\nCollisional ionization\n\n§2.4\n\nHeavy element line radiation\n\n§2.5\n\n\f– 10 –\n& Shu: θ1 = 26.6◦ and θ2 = 33.2◦ , and with R∗ /Rx = 0.20, Fh ≈ 0.06 and sin2 θ̄h ≈ 0.5. Calvet &\nGullbring (1998) and Gullbring et al. (2000) have analyzed the spectral energy distributions of T\nTauri stars with an accretion shock model based on a dipolar magnetic field. They find that lightly\nveiled T Tauri stars have Fh in the range 0.001 − 0.05. Such small hot spots can be realized with\na generalization of x-wind theory that brings in higher multipole fields (Mohanty & Shu 2001).\nThe presence of the hot spot is a potential complication in the radiation transfer needed\nto calculate the absorption of radiation by the wind. We could achieve some simplification by\nexploiting the axial symmetry of the steady x-wind and replacing the hot spot by equivalent sources\nlocated at the origin and along the polar axis of symmetry. Because we are mainly interested in\nradial distances r >> R∗ , however, we can simply replace the hot spot by a source located at the\norigin and calculate the mean intensity of the hot spot radiation as a blackbody of temperature Th\nwith the approximate dilution factor,\nR2\n(2-15)\nWh = Fh ∗2 .\n4r\nThe effective temperature Th is given by\n\u0012\n\u0013\nLh\n4\n4\nTh = T∗ +\n,\n(2-16)\nFh 4πR∗2 σ\nif we assume that the accretion shock structure is optically thin to the underlying stellar (photospheric) continuum and denote the Stefan-Boltzmann constant by σB . The corresponding dilution\nfactor for the stellar photospheric radiation is\nW∗ = (1 − Fh )\n\nR∗2\n.\n4r 2\n\n(2-17)\n\nThe mean intensities of the stellar and the hot spot radiation fields before they enter the wind are\nobtained by multiplying the dilutions factors by σB Th4 and σB T∗4 , respectively. Although neither the\nstellar nor the hot-spot radiation is accurately represented by a blackbody spectrum at wavelengths\nshortward of the Balmer continuum, the blackbody approximation does not lead to any serious error\nin this paper because the X-rays are the dominant ionization source (§3).\n\n2.4.\n\nRadiative and Collisional Processes for Hydrogen\n\nThe stellar and hot spot radiation fields are important in the inner wind for detaching the\nelectron of the negative hydrogen ion (in the continuum shortward of λ = 1.647 μm) and for photoionizing the n = 2 level of atomic hydrogen (in the Balmer continuum shortward of λ = 0.365 μm).\nThese processes and their inverses were discussed in detail by RGS for a stellar blackbody, and we\ndescribe only the most important changes in their methodology. RGS expressed the rates for these\nphotoionization processes in the form,\nP = W gA x,\n(2-18)\n\n\f– 11 –\nwhere x is the abundance of the species (H− or H(2), where we write H(n) for the H atom with\nprincipal quantum number n), W is the standard dilution factor for a star, and gA is the absorption\nrate for the appropriate continuum. Applying the results of §2.3, our ionization rates are,\nPA = (W∗ gA,∗ + Wh gA,h ) x,\n\n(2-19)\n\nwhere W∗ and Wh were defined in §2.3 and gA,∗ and gA,h are absorption rates evaluated using\nblackbody spectra at the stellar and hot spot temperatures, respectively.\n\n2.4.1.\n\nThe Negative Hydrogen Ion\n\nThe rate equation for H− is:\n\u0002\n\u0003\nD\nx(H− ) = xe (1 − xe )kS (H − )n − Wh gA,h (H − ) + W∗ gA,∗ (H − ) + xe nk± x(H− ).\nDt\n\n(2-20)\n\nIn addition to photodetachment, H− is also destroyed rapidly by neutralization with H+ in which a\nhydrogen atom is produced in an excited state, usually n = 3 for energies less than 1 eV (e.g., Fussen\n& Kubach 1986). The inverse reaction, H(1) + H(3) → H− +H+ , contributes little to the production\nof H− , mainly because the abundance of excited H(3) atoms is so small. The potentially important\nreaction, H(1) + H(1) → H− + H+ , is endothermic by 12.85 eV and has a relatively small cross\nsection even well above threshold. It can therefore be safely ignored as a production mechanism\nfor H− . We use a rate coefficient k± somewhat larger than in RGS, as explained in Appendix\nA. We calculate the photo rates in equation (2-20) by numerically integrating the Wishart (1979)\nphotodetachment cross section αν (H− ) in RGS Eq. (A16),\n\u0013\n\u0012\nZ ∞\nαν (H− ) 2hν 3\n−\ngS (H , T ) ≡ 4π\ne−hν/kT dν,\n(2-21)\nhν\nc2\nν−\nand in RGS Eq. (A18),\nZ ∞\nαν (H− )\n−\nBν (T∗ )dν,\ngA,∗ (H , T∗ ) ≡ 4π\nhν\nν−\n\n−\n\ngA,h (H , Th ) ≡ 4π\n\nZ\n\n∞\n\nν−\n\nαν (H− )\nBν (Th )dν,\nhν\n\n(2-22)\n\nwhere ν− is the threshold frequency for H− photodetachment at λ− = 1.647 μm. The subscript\nS in equation (2-21) labels gS as a spontaneous rate. We use detailed balance (RGS Eq. [20]) to\nobtain the rate coefficient for photodetachment from gS ,\nkS (H− , T ) ≡\n\nλ3e hν0 /kT\ne\ngS (T ).\n4\n\n(2-23)\n\nWe note that gA,∗ (H− , T∗ ) and gA,h (H− , Th ) are functions of the stellar and hot spot temperatures,\nwhereas gS (H− , T ) is a function of kinetic temperature. We need to calculate gA,∗ (H− , T∗ ) and\ngA,h (H− , Th ) just once at the beginning of a calculation, but we need to know kS (H− , T ) everywhere\n\n\f– 12 –\non each streamline. In order to save computing time, we have fit kS by a formula similar to that\nintroduced by Stancil, Lepp, & Dalgarno (1998),\nkS (H− , T ) = 1.33 × 10−18 (T 0.85 + T 0.4 )(e−T /9320 + e−T /18000 ),\n\n(2-24)\n\nwhich reproduces the numerical calculations to better than 15% over the temperature range from\n102 − 2 × 104 K. We have ignored attenuation in equation (2-22) because the optical depth in the\nH− continuum is small due to the low abundance of H− .\nAssociated with the gain and loss terms in the rate equation for H− , equation (2-20), are the\nheating and cooling rates,\n\u0002\n\u0003\nG(H− ) = Wh gA,h (H− , Th )TA,h (H− ) + W∗ gA,∗ (H− , T∗ )TA,∗ (H− ) x(H− ),\nL(H− ) = xe (1 − xe )nkS (H− , T )TS (H− , T ).\n\n(2-25)\n(2-26)\n\nThe heating rates (in K units), gA,h (H− , Th )TA,h (H− ) and gA,∗ (H− , T∗ )TA,∗ (H− ), are given by integrals like those in equation (2-22) except that an additional factor (ν−ν− ) appears in the integrands,\nas is appropriate to photoelectron heating. The cooling rate kS (H− , T )TS (H− , T ) is given by a similar modification of the equation for gS . Again we evaluate TA,h and TA,∗ numerically once per\ncalculational case and use the following fit for TS (H− , T )\n\u0013\n\u0012 2\n\u0011\nξ− + 4ξ− + 6 \u0010 −T /50000\n−T /4000\n−\n,\n(2-27)\ne\n+\ne\nTS (H , T ) = T\n2 + 2ξ + 2\nξ−\n−\nwhere ξ− = T− /T = 8750 K/T ; this approximation is accurate to within a few percent over the\ntemperature range from 102 − 105 K.\n\n2.4.2.\n\nThe n = 2 Level of Atomic Hydrogen\n\nOur treatment of the H atom is essentially standard Case B recombination theory modified for\na 2-d axisymmetric wind by use of the Sobolev approximation (e.g., Shu 1991, Chapter 9). It goes\nbeyond RGS by including electronic collisional and X-ray ionization and excitation. The broader\nimplications of the X-rays are taken up in §3. We adopt a simplified two-level plus continuum\nmodel for the H atom, and formulate and solve the steady-state population equations in Appendix\nB. The population of the n = 2 level is given in the convention defined after equation (2-12) by,\nx2 =\n\n(1 − xe )\n,\n1+Q\n\nQ=\n\nk21 nxe + A21 β21\n,\nk12 nxe + k1c nxe + ζ1c + ζ12\n\n(2-28)\n\nwhere A21 is the spontaneous radiative decay rate of the Lyman-α line, β21 is the corresponding\nescape probability,\n1 − e−τ21\n,\n(2-29)\nβ21 =\nτ21\n\n\f– 13 –\nand τ21 is the (locally-calculated) optical depth of the line,\nτ21 =\n\nπe2\nλ21 f12 (1 − xe )nS −1 ,\nme c\n\nS=\n\n2 vw\n1 dvw\n+\n.\n3 s\n3 ds\n\n(2-30)\n\nThe rate coefficients k12 and k21 describe electronic collisional excitation and de-excitation of the\nn = 2 level; k1c is the rate coefficient for electronic collisional ionization of the n = 1 level. The\nquantities ζ1c and ζ12 are respectively the rates at which X-rays ionize and excite the H-atom ground\nstate, as described in §3 and Appendix B. The main additional changes from RGS are that the\nradial coordinate r is replaced by the streamline coordinate s and the characteristic length 2vw /3r\nis replaced by S in equation (2-30).\nOur treatment of photoionization by the Balmer continua and the recombination into levels\nn ≥ 2 closely parallels the above formulation for H− . It is actually simpler because the integrals over\nfrequency can be done in closed form when the cross section has the Kramers ν 3 dependence (RGS\nAppendix B). The coefficients in the photoionization rates for the stellar and hot spot blackbodies\nin equation (2-19) are then given by integrals like those in equation (2-22), with αν (H− ) replaced\nby the Kramers cross section (RGS Eq. [21]); the result is\n∞\n\ngA,h (2) = e−τ2c\n\n∞\n\n8π 3 X\nE1 (jT2 /Th ),\n2ν α1\nc2 2\n\ngA,∗ (2) = e−τ2c\n\nj=1\n\n8π 3 X\nE1 (jT2 /T∗ ),\n2ν α1\nc2 2\n\n(2-31)\n\nj=1\n\nwhere ν2 is the frequency threshold for photoionization from the n = 2 level and T2 is the same\nquantity in temperature units. The factor exp(−τ2c ) reflects the fact that we include absorption of\nthe Balmer continuum, which is well calculated by replacing the frequency dependent attenuation\nfactor exp(−τν ) by its threshold value. The optical depth at threshold is\nτ2c = 2α1 N2 ,\nwhere\nN2 =\n\nZ\n\n(2-32)\n\nr\n\nx2 n dr,\n\n(2-33)\n\n0\n\nis the radial column density for the n = 2 level.\n\nThe rate at which radiative recombination occurs is given by,\nDe = x2e nkS (≥ 2).\n\n(2-34)\n\nWe calculate the rate coefficient kS (≥ 2) from RGS (their Eq. [B15] and preceding equations). As\ndiscussed by RGS, the evaluation involves replacing sums over the principal quantum number n from\nn = 2 to nmax by integrals. RGS determined nmax from the condition derived by Seaton (1964)\nfor the equality of the rates for collisional ionization and spontaneous decay for large quantum\nnumbers. The Seaton condition characterizes an important property of the large n level population\n(where the rate of increase of the departure coefficients begins to decrease), but it does not describe\n\n\f– 14 –\nthe size of the atom, i.e., nmax . In fact, for the conditions in the wind, nmax is determined by Stark\nbroadening (e.g. Mihalas 1970),\nnmax = 1234 (ne cm3 )−2/15 .\n\n(2-35)\n\nDespite the small exponent, nmax ranges from ≈ 30 at the base of the wind to 100 − 200 at large\ndistances. This variation has little effect on the value of the recombination rate coefficient, but it\ndoes have a bearing on the observability of sub-mm radio recombination lines (§6).\nThe photoionization of the n = 2 level and the recombination to levels n ≥ 2 lead to heating\nand cooling, respectively:\nG(2) = [Wh gA,h (2)TA,h (2) + W∗ gA,∗ (2)TA,∗ (2)] x2 ,\n\n(2-36)\n\nL(≥ 2) = x2e nkS (≥ 2)TS (≥ 2).\n\n(2-37)\n\nThe heating energies, TA,∗ (2) and TA,h (2), are calculated from the closed form expression, RGS\nEq. (B8), and the recombination cooling kS (≥ 2)TS (≥ 2) from RGS Eqs. (27), (B13), and (B16).\nThe heating and cooling by the H atom occurs by collisional excitation, de-excitation, and\nionization and by photoionization and electronic recombination. When the net effect of collisional\nexcitation and de-excitation are expressed in terms of the standard formula for Lyman-α line\ncooling,\nLLy−α = x2 A21 β21 T21 .\n(2-38)\nthe heating is given by (Eq. [B12]),\n′\nG − L = −LLy−α + G(2) − L(≥ 2) − Lcoll + GX\n,\n\nwhere\n\n1\n1\nLcoll = xe (k1c n1 + k2c n2 )T1c = xe (1 − xe )nT1c\n4\n4\n\n\u0012\n\nk2c\nk1c\n+\n1 + Q−1 1 + Q\n\n(2-39)\n\u0013\n\n,\n\n(2-40)\n\nand\n′\nGX\n= 2.22ζT12 ;\n\n(2-41)\n\nT1c and T12 are the ionization potential and the excitation energy of the first excited level of atomic\nhydrogen (in K units), and k1c and k2c are the rate coefficients for collisional ionization of the n = 1\nand n = 2 levels. As discussed in Appendix B, equation (2-41) defines an indirect X-ray heating\nterm that arises because we use equation (2-38) to eliminate the net heating from collisional heating\nand cooling in favor of Lyman-α cooling. This term arises from the effects of the X-rays on the\npopulation of the n = 2 level of atomic hydrogen. The collisional ionization rates in equation (2-40)\nare discussed in Appendix B.\n\n\f– 15 –\n2.5.\n\nHeavy Element Cooling\n\nFor the temperatures important in the inner wind, the heavy elements mainly contribute to\nthe cooling by forbidden line transitions, many of which serve as observational diagnostics for the\njets that emanate from YSOs. We have included the forbidden transitions of O I, S II, and N I at\nsolar abundances using 5-level model ions as in SSG. N I cooling is about one order of magnitude\nsmaller than O I and S II cooling in our calculations. We have not included Fe II which, by virtue\nof a large number of transitions, can be an important coolant at high densities. Only in the last\nfew years have realistic calculations of Fe cooling been published (Woitke and Sedlmayr 1999;\nVerner et al. 1999, 2000). According to the cooling functions displayed graphically by Woitke and\nSedlmayr, Fe II cooling should be small compared to the dominant adiabatic cooling in our wind\nmodels. The reason for this is that, for the densities characteristic of the x-wind jet, the strength\nof the Fe II cooling is determined by the abundance of iron compared to oxygen. It is only at much\nhigher densities, where the Fe II lines become optically thick, that the very large number of Fe II\nlines makes this ion a more powerful coolant than more abundant ions with simpler level structure.\n\n3.\n\nX-Rays\n\nThe ionization and heating of the x-wind by X-rays are another example of how X-rays produced by YSOs affect the physical conditions for star formation. Earlier we used observations of\nYSO X-rays to determine the flux of energetic particles that can produce short-lived radionuclides\nat the time the Sun was formed (Shu et al. 1997; Lee et al. 1998; Gounelle et al. 2001). We have also\nfound that the observed level of X-rays is more than sufficient to provide the dominant source of\nionization in the atmospheres of protoplanetary disks (Glassgold, Najita, & Igea 1997, henceforth\nGNI; Igea & Glassgold 1999). Here we show how these X-rays affect the degree of ionization at the\nbase of the jets observed in low-mass stars.\nThe ROSAT measurements of nearby clusters of newly formed stars provide us with a good\nidea of the average soft X-ray flux from T Tauri stars, and ASCA has extended these results to\nhigher X-ray energies albeit at lower angular resolution (e.g., Feigelson & Montmerle 1999). The\nmean soft X-ray luminosity for a typical T-Tauri star is LX ∼ 5 × 1029 erg s−1 . The satellite\nobservatories have also begun to elucidate the dependence of the X-ray emission on the age of the\nYSO, the amount of variability, and the properties of their flares. Although soft X-ray observations\nare often fit by a single thermal spectrum, there are good reasons to expect that the X-ray spectra of\nYSOs are more complex. This is certainly the case for (magnetically active) M-dwarf stars (Schmitt\net al. 1990). Some high-quality ROSAT spectra of YSOs also require a two-temperature fit (e.g.,\nSkinner & Walter 1998). The ASCA YSO spectra also indicate that there is generally a hard as\nwell as a soft component. The simulations of the Sun as an X-ray star (Peres et al. 2000), based on\nmodeling of YOHKOH Soft X-Ray Telescope observations, suggest that the high-energy component\nseen in low-resolution astronomical satellite measurements of YSOs is associated with small and\n\n\f– 16 –\nlarge flares. This situation is quite understandable since hard X-rays are released by energetic\nflares generated by reconnection events, whereas soft X-rays are mainly emitted by coronal gas\ntrapped by large loops of closed stellar magnetic field lines. Another conclusion indicated by\nthe available data is that the younger YSOs are stronger and harder X-ray emitters than the\nolder ones. Again this is in accord with theoretical ideas about the effects of accretion on the\nmagnetospheres of YSOs, which are prone to increased magnetic activity during epochs of enhanced\naccretion. Of course many of the limitations in our information on YSO X-rays will be removed\nby measurements of increased sensitivity and angular resolution now being made with the Chandra\nX-ray Observatory and XMM. The Chandra observations (Garmire et al. 2000; Feigelson et al. 2001,\nprivate communication), already support the conclusion from ASCA (Koyama 1999; Tsuboi 1999)\nthat there are significant differences between younger and older YSOs with respect to the hardness\nof spectra and the frequency of flares.\nIn modeling the X-ray spectra of YSOs, we assume that a soft and a hard X-ray component are\npresent with temperatures kTX ≈ 1 keV and kTX ≈ 2 − 5 keV, respectively. Since we focus on the\nmore active YSOs that produce optical jets (and correspond to infrared classes I and II), we assume\nthat the luminosities of the two components are the same order of magnitude, and that the total\nX-ray luminosity is substantially larger than the typical revealed Tauri star, e.g., LX ≈ 1031 erg s−1 .\nOf course LX can be even higher during large flares (Feigelson & Montmerle 1999; Tsuboi 1999;\nStelzer et al. 2000). As in the discussion of the hot spot radiation in §2.3, the calculation of the\neffects of the X-rays is complicated by the extended nature of the emitting regions and by the lack\nof relevant observational information on their physical properties. According to the x-wind model\n(see Fig. 1 of Shu et al. 1997), soft X-rays can be expected to arise within the region of closed\nstellar magnetic field lines (of linear dimension several R∗ ) and from the region above the funnel\nflow and beneath the helmet dome and kink point (of linear dimension Rx ). Hard as well as soft\nX-rays may be produced by reconnection events that occur either in the reconnection ring (in the\nequatorial plane from 0.75 Rx to Rx ) or along the helmet streamer above the kink point (at radial\ndistances ∼ Rx ). We deal with this complicated geometrical situation by representing the several\nfinite sources by a set of axial point sources: half of both the soft and the hard X-rays are assumed\nto emanate from the origin and the other half from points displaced along the z-axis by ±1.0Rx .\nWe follow the calculation by GNI of the X-ray ionization rate, which is based on the energysmoothed cosmic photoelectric absorption cross section per H nucleus based on the compilation of\nHenke, Gullikson, and Davis (1993), similar to that used by Morrison and McCammon (1983),\nσpe (E) = σpe (1 keV)(keV/E)p ;\n\n(3-1)\n\nfor solar abundances, p = 2.485 and σpe (keV) = 2.27 × 10−22 cm2 . We assume that moderate\nand high-energy X-rays are most important (E ≥ 1 keV), and we ignore the relatively small\ncontributions of the primary and Auger electrons compared to the dominant secondary electrons.\nWe also assume that the electron fraction and the temperature are not high enough for the heavy\natoms to be very ionized, so that the main X-rays absorbers are the K- and L-shells of heavy\natoms. In other words, we approximate the production rate for primary photoelectrons as if the\n\n\f– 17 –\nheavy atoms are in their ground states using equation (3-1). In the format of equation (2-13), the\nionization rate due to the secondary electrons is\n\u0013\n\u0012\nZ ∞\n1\nLX (E)\nE\n−τX\nPX = ζ =\nσpe (E) e\ndE ,\n(3-2)\n4πr 2 E0\nE\nǫion\nwhere LX (E) is the X-ray luminosity per unit energy interval, ǫion is the energy to make an ion\npair (about 36 eV for an unionized hydrogen-helium mixture, according to Dalgarno, Yan, & Liu\n1999), and τX is the X-ray optical depth.\nZ r\nn dr,\n(3-3)\nτx ≡ σpe (kTX )N,\nN=\n0\n\nWe introduce a low-energy cutoff E0 because the smoothing used to obtain the power-law fit,\nequation (3-1), removes the thresholds in the underlying photoelectric cross sections. The smallest\nthreshold is 0.0136 keV, but the operative cutoff may well be larger due to absorption in the source.\nDefining ξ = E/kTX , we choose ξ0 = 0.01, e.g., E0 = 0.1 keV for a thermal X-ray spectrum with\nkTX = 1 keV because. Below this energy, the secondary electrons no longer dominate the ionization.\nWe also need the X-ray heating rate,\nZ ∞\nLX (E)\n1\nσpe (E) e−τX (yheat E) dE ,\n(3-4)\nGX =\n4πr 2 E0\nE\nwhere yheat is the fraction of the X-ray energy that heats the gas. Both ǫion and yheat are functions of\nenergy E and electron fraction xe , the latter because of Coulomb scattering between the secondary\nand ambient electrons. We exploit the fact that, at energies much larger than characteristic atomic\nenergies (measured by the ionization potential), ǫion and yheat are approximately independent of\nenergy. We can then extract the asymptotic factor 1/ǫion from equation (3-2) and the asymptotic\nfactor yheat from equation (3-4). The result is that the direct X-ray heating, in the format of\nequation (2-12), can be expressed as\nGX = yheat Tion ζ,\n(3-5)\nwhere Tion = ǫion /k. As discussed in Appendix B and §2.4.1, there is also an indirect X-ray heating\nterm (Eq. [2-41]) that arises when the thermal effects of collisional excitation and de-excitation of\nthe H atom are expressed in terms of Lyman-α cooling (Eq. [B12]).\nThe dependence of ǫion and yheat on xe has been studied by many authors, starting with Spitzer\n& Scott (1969) and most recently by Dalgarno, Yan, & Liu (1999), who give an extensive set of\nreferences to previous work. We have found that the parameterization of Shull & Van Steenburg\n(1983) for atomic H and He mixtures is useful in calculating the effects of X-rays on the inner x-wind\nwith moderate mass-loss rates and not too large electron fractions. Their results are confirmed by\nDalgarno et al. (1999) (who also provide the only theory for situations where the hydrogen is partly\nor fully molecular). According to Shull & Van Steenburg, the energy to make an ion pair can be\nwritten,\nyH\nyHe\n1\n=\n+\n,\n(3-6)\nǫion\nI(H) I(He)\n\n\f– 18 –\nwhere\nyH = 0.3908 1 − x0.4092\ne\n\n\u00011.7592\n\n,\n\nyHe = 0.0554 1 − x0.4614\ne\n\n\u00011.666\n\n,\n\nand I(H) and I(He) are the ionization potentials of H and He. The heating fraction is\nh\n\u00011.3163 i\nyheat = 0.9971 1 − 1 − x0.2663\n.\ne\n\n(3-7)\n\n(3-8)\n\nIt should be noted that existing theories of electron energy loss, on which our ionization and heating\nrates are based, do not hold much beyond xe = 0.1. In particular, equation (3-5) breaks down in\nthe limit xe → 1, as can be seen from the behavior in this limit of equations (3-7) and (3-8).\nFortunately, the maximum electron fractions encountered in the present calculations rarely exceed\nxe = 0.1.\nPutting all of this together for a thermal spectrum with temperature TX , the ionization rate\nat distance r from an X-ray sources is,\n\u0013\n\u0012 \u00132 \u0012\nkTX\nRx\nIp (τx , ξ0 ),\n(3-9)\nζ ≈ ζx\nr\nǫion\nwhere ζx is the primary ionization rate at a distance r = Rx . A useful numerical form for ζx is\n\u0013\u0012\n\u00132\n\u0012\n\u0013\n\u0012\nkTx −(p+1) 1012 cm\nLX\nLX σpe (kTx )\n−8 −1\n.\n(3-10)\n= 1.13 × 10 s\nζx ≡\n4πRx2 kTX\n1030 ergs−1\nkeV\nRx\nThe function Ip (τx , ξ0 ) in equation (3-9) describes the attenuation of the X-rays. As discussed by\nGNI, it decreases more rapidly with optical depth τx than a power law at large optical depth and\nflattens out to a constant for very small optical depth. In the application to protoplanetary disks,\nthe integral was evaluated numerically, but this is infeasible for detailed modeling of the x-wind. In\nAppendix C, we obtain an asymptotic form for Ip (τx , ξ0 ) using the method of steepest descents (as\ndid Krolik & Kallmann 1983 and GNI) and then develop a simple interpolation method to combine\nthe approximations for small and large optical depths.\n\n4.\n\nAmbipolar Diffusion Heating\n\nLong familiar from thermal considerations of interstellar clouds (Biermann & Schlüter 1950;\nScalo 1977; Mouschovias 1978; Lizano & Shu 1987), the heating associated with ambipolar diffusion\n(e.g., Mestel & Spitzer 1956; Spitzer 1978; Shu II 1992) was first applied to protostellar winds by\nRGS and to disk winds by Safier (1993). Because RGS worked with a prescribed sphericallysymmetric wind, they calculated the drag force of the ions on the neutrals from the wind equation\nof motion, i.e., as the net force of gravity plus acceleration. For T-Tauri stars with mass-loss rates\nin the range 10−8 − 10−7 M⊙ yr−1 , RGS (Figure 9) obtained temperatures in the 4,000 - 5,000 K\nrange within 10 R∗ but less than 100 K beyond 104 R∗ ≈ 1016 cm (where the temperature decreases\nadiabatically as the 4/3 power of the distance). In this paper, we include ambipolar diffusion\nheating from first principles using the dynamical solution of Shang (1998) described in §2.1.\n\n\f– 19 –\nWe use an improved approximation for the volumetric rate of ambipolar diffusion heating\nbecause, unlike the situation in interstellar clouds, the ionization level in the wind may not be very\nsmall:\nρn |fL |2\n.\n(4-1)\nΓAD =\nγρi (ρn + ρi )2\nHere ρn and ρi are the mass densities of the neutrals and the ions, respectively, fL is the Lorentz\nforce,\n1\nfL =\n(∇ × B) × B,\n(4-2)\n4π\nand γ is the ion-neutral momentum transfer coefficient. A short derivation of equation (4-1) is given\nin Appendix D, based on the approximation that the difference in the acceleration (rather than\nthe velocity) of the neutrals and ions can be ignored. When ρi << ρn , equation (4-1) reduces to\nthe usual one for low-ionization situations, e.g., Eq. (27.19) of Shu (II 1992). It has the important\nproperty that it does not become singular as ρn vanishes.\nIn Appendix E, we develop an improved formula for γ that takes into account the latest\ncalculations and experiments on the collision of H+ ions with atomic and molecular hydrogen and\nwith helium, including exchange scattering in H+ + H collisions. For the case of no molecular\nhydrogen and xHe = 0.1, equation (E8) yields\n\u0015\n\u0014\n2\n2.13 × 1014\n0.5\n−3 w5 0.5\n) }x(H) + 0.243 cm3 s−1 g−1 ,\n(4-3)\n{3.23 + 41.0T4 (1 + 1.338 × 10\nγ=\n1 − 0.714xe\nT4\nwhere T4 is the temperature in units of 10,000 K and w5 is the slip speed (w ≡ vi − vn ) in km s−1 .\nFor temperatures approaching 104 K, the new γ is an order of magnitude larger than the value used\nby RGS and elsewhere in the literature. It agrees with Draine's prescription (1980) only for cold\nclouds.\nThe slip velocity can be obtained from equation (D8) of Appendix D,\nw=\n\nfL\n.\nγρi (ρn + ρi )\n\n(4-4)\n\nBy eliminating γ from the last two equations, we obtain a quartic equation for w, whose solution\npermits the coupling coefficient γ to be calculated and then the ambipolar diffusion heating to be\nfound from equation (4-1). The contribution from He to γ in equation (4-3) (the last term) is\nalways small.\nA critical factor in the formula for ambipolar diffusion heating is the square of the Lorentz force\n(Eq. [4-2]). We calculate the Lorentz force by numerical interpolation on the global x-wind solution\ndescribed in §2.1, which is itself an interpolation between an interior and an exterior (asymptotic)\nsolution. Numerical experiments with different interpolation grids indicate that we have accurately\ncalculated the Lorentz force for our approximate solution, but we do not have a good estimate of\nthe error in the solution itself. However, it is reassuring that our calculations for a model close to\nthat of RGS are consistent with their results.\n\n\f– 20 –\nFigure 1 shows the results for what we will call our fiducial model, defined in Table 2, except\nthat the parameter α for mechanical heating (to be discussed in §5) has been set equal to zero. In\nother words, Figure 1 includes all of the processes listed in Table 1 except for mechanical heating.\nThe upper panels show temperature contours and the lower panels ionization contours in the ̟-z\nplane. The spatial dimensions are AU and the scale of the plots increases from right to left. On\nthe smallest scale (at the extreme right), the range in ̟ is 10 AU and the range in z is 100 AU.\nThe temperature very close to the axis approaches 9,000 K, but the region hot enough to excite\nthe forbidden lines, roughly T > 6, 000 − 7, 000 K, occupies only a thin inner layer of the jet with\na thickness less than 1 AU. The extreme right panel corresponds to an angular scale of less than\n0.1′′ for objects at a distance of 150 pc, one not yet generally available to direct observation. The\nscale has begun to be explored by recent measurements with the Hubble Space Telescope (Bacciotti\net al. 2000) and with an adaptive optics system on the Canada-Hawaii-France Telescope (Dougados,\nCabrit, Lavalley, and Ménard 2000). On the commonly observed scales shown in the remaining\npanels of Figure 1, ranging from 1/3 to 3 arcsec, the wind is warm at best. The ionization fractions\nrange from a few to 10%.\nAn analysis of the terms contributing to the basic ionization and heat equations, (2-13) and\n(2-12), reveals that a variety of processes contribute, especially close to the star. For example,\nthe gas starting out on the last streamlines closest to the axis is ionized by both X-rays and\nby photoionization of the n = 2 level and the negative ion of the H atom (by stellar and hot-spot\nradiation). The total ionization and recombination rates balance approximately at first, but, within\na few AU, the ionization falls below the recombination rate and the electron fraction decreases slowly\nwith distance (see section §6). For streamlines that start out at larger angles with respect to the\naxis, the X-rays are more important than stellar radiation for ionization. Because the density\ndecreases more rapidly with distance along these streamlines, the ionization is essentially frozen\ninto the streamline and decreases even more slowly with increasing distance.\nWithout mechanical heating, X-rays are generally the most important heating mechanism and\nadiabatic cooling the most important cooling mechanism. However, Lyman-α cooling is larger than\nadiabatic within the inner 10 AU, and ambipolar diffusion heating competes with X-rays at large\ndistances beyond 500-1,000 AU. Because the thermal time scale is much shorter than the ionization\ntime scale, the general dominance of adiabatic cooling over X-ray and ambipolar heating means that\nthe temperature decreases rapidly on every streamline. Of course, as already noted, these heating\nmechanisms are relatively weak. It is perhaps not surprising that X-ray heating is not that effective,\nbecause only a small fraction of the system luminosity is in X-rays. In accord with equation (4-1),\nambipolar diffusion heating is weak because the X-rays produce a relatively high level of ionization\nand because the coefficient γ is an order of magnitude larger than used by previous workers. Much\nhigher temperatures, along the lines obtained by Safier (1993) for disk winds, could be achieved\nwithout X-rays by using the conventional small (but incorrect) γ. For our objective of obtaining\nphysical conditions that are compatible with the optical observations of jets, a wind thermal model\nbased on stellar radiation, X-rays, and ambipolar diffusion heating is clearly inadequate.\n\n\f– 21 –\n5.\n\nMechanical Heating\n\nThe previous section makes clear that neither heating by ambipolar diffusion nor heating by\nX-rays and the other radiation fields in the problem suffice to explain the observed emission lines\nof the abundant heavy elements in YSO winds and jets. We therefore consider whether a small\nfraction of the macroscopic flow energy in the x-wind can be tapped as a volumetric heat source.\nThe physical basis for this idea resides in the observation that the actual flows are time-dependent\n(e.g., in the form of pulsed jets as discussed by Raga et al. 1990; Raga and Kofman 1992), with the\ntime dependence generating shock waves or turbulent dissipation when fast fluid elements catch\nup with slower ones 5 . We will not attempt a detailed discussion of the physics underlying the\ntransformation of the fluctuating kinetic energy into heat (which might profitably be studied by\n3-d numerical simulations); instead we appeal to general dimensional reasoning to parameterize the\nfunctional form of the mechanical heating.\nThe volumetric change in the kinetic energy of the flow is represented by the following terms\nin the fluid equations:\n\u0012\n\u0013\n\u0014\u0012 2 \u0013 \u0015\nρv\n∂ ρv 2\n+∇*\nv ≡ Γmech ,\n(5-1)\n∂t\n2\n2\nwhere ρ and v are the local gas density and flow velocity in an inertial frame at rest with respect\nto the central star. Dimensional analysis suggests that we replace the above expression by\nΓmech = α ρ\n\nv3\n.\ns\n\n(5-2)\n\nwhere s is the distance the fluid element has traveled along a streamline to the location of interest\nin the wind, and where we have introduced a phenomenological coefficient α ≥ 0 to characterize\nthe magnitude of the mechanical heating. A choice α ≪ 1 corresponds to the assumption that\nonly a small fraction of the kinetic energy contained in the flow is dissipated into heat via shock\nwaves and turbulent decay when integrated over the flow volumes of interest at the characteristic\ndistances s in the current problem.\nThe expression (5-2) could be made exact if we allowed α to be arbitrarily dependent on the\nspacetime coordinates (x, t). In practice, we shall make the simplifying assumption that α is a\nglobal constant, chosen to obtain a reasonable lighting up of the entire wind flow. With α ≪ 1,\nthe scaling with 1/s in equation (5-2) could then be justified on the basis of the propagation of\nweak planar shocks where the velocity jump across the shock varies asymptotically as the inverse\nsquare root of the distance traveled (see §95 of Landau & Lifshitz 1959), with the energy deposited\ninto heat (in the fixed frame) varying as the square of the velocity jump. In practice, we prefer\n5\n\nHydrodynamic turbulence has often been invoked for heating interstellar clouds (e.g., Black 1987). Rodriguez-\n\nFernandez et al. (2001) have recently offered it as an explanation of the warm clouds observed near the Galactic\nCenter. McKee and Zweibel (1995) and Ostriker, Gammie, and Stone (1999) discuss the similarities and differences\nbetween the dissipation of hydrodynamic and MHD turbulence.\n\n\f– 22 –\nto regard equation (5-2) not as being derived from specific dissipative processes, but as a generic\nmodel equation whose form satisfies broad physical considerations and whose utility comes from\nits simplicity of application within the context of small fluctuations about some mean time-steady\nflow.\nFrom another perspective, when we remember that v tends to vw ≈ 200 − 300 km s−1 , it is\nclear that α must be much less than unity, for otherwise the wind will get too hot. We can roughly\napproximate adiabatic cooling by\n3 vT\n3 dT\nv( )ad ≈ −η\n,\n(5-3)\n2 ds\n2 s\nwhere η is a parameter that is much less than one for streamlines close to the axis and of order\nunity at large angles (η = 1/3 asymptotically, in the latter case). When this expression is balanced\nagainst the mechanical heating equation in (5-2), we obtain a rough estimate for the temperature\nα\n3\nkT ≈ ( )mv 2 .\n2\nη\n\n(5-4)\n\nFrom this result, we see that, not only is the collimated jet (η ≪ 1) much hotter than the uncollimated wide-angle wind, but α must be much less than one in order to avoid heating the wide\nangle wind to extremely high temperatures. The full scale calculations discussed in §6 show that\nα ∼ 10−3 yields jet temperatures in the 5, 000 − 10, 000 K range that have been deduced from\nobservations of forbidden lines.\n\n6.\n\nResults\n\nWe now present the results of calculations for a fiducial or reference model, defined in Table 2,\nand for several variations on it.\nTable 2. Fiducial Model\nM∗\n\n0.8 M⊙\n\nR∗\n\n3.0 R⊙\n\nRx\n\n4.8 R∗\n\n2π/Ωx\n\n7.5 d\n\nṀw\n\n3.2 × 10−8 M⊙ yr−1\n\nv̄w\n\n195 km s−1\n\nL∗\n\n2 L⊙\n\nLX\n\n4 × 1031 erg s−1\n\nα\n\n10−3\n\n\f– 23 –\nAs remarked earlier, the parameters have been chosen to represent a solar-mass YSO in a\nfairly active phase. The numerical value of LX pertains to two sources, one in and one above\nthe reconnection ring, each with a soft and a hard component with individual X-ray powers of\n1031 erg s−1 . The parameter α has been chosen to have the order of magnitude 10−3 on the basis of\nan approximate solution for the temperature that includes only adiabatic cooling and mechanical\nheating and assumes that the density of a collimated streamline varies inversely with the distance.\n\n6.1.\n\nTemperatures and Ionization Fractions\n\nFigure 2 shows the temperature and ionization profiles (contours of constant T and xe ) on\nvarious spatial scales in the same way as Figure 1 (for no mechanical heating). It is immediately\nclear from a comparison of the upper panels of Figures 1 and 2 that mechanical heating at this\nlevel leads to a much warmer wind. The electron fraction in the two sets of lower panels are not\nthat different because X-rays dominate the ionization in both cases. The quantitative changes in xe\nin going from Figure 1 to Figure 2 arise from several temperature-dependent ionization processes:\nrecombination (decreases with increasing T ), photodetachment of H− (H− abundance increases\nwith T ), and photoionization of the n = 2 level of atomic hydrogen (population increases with T ).\nThe wide range of physical properties manifested in the x-wind imply that many physical processes are important, although only a few will dominate at any particular location. For the fiducial\nmodel and modest variations on it, certain processes do play a more global role. For ionization,\nthey are X-ray ionization and radiative recombination; for heating, X-rays and mechanical heating;\nand for cooling, Lyman-α and adiabatic cooling. We find that the relative contribution of a process\nvaries from streamline to streamline and also with distance along an individual streamline. For\nexample, photoionization of the n = 2 level of atomic hydrogen is the most important ionization\nprocess within a few AU of the star for the last 10% of the streamlines close to the jet axis. X-rays\nthen take over and are effective over distances of 10-20 AU for producing the initial ionization of\nthese streamlines. At larger distances, the total ionization rate is smaller than the recombination\nrate. Since the recombination time scale is longer than the dynamical time scale, the ionization\ntends to get frozen into the wind and xe decreases slowly with increasing distance, as shown in\nthe lower left panels of Figures 1-3. This behavior has been found in several jets of young stars,\ne.g., Dougados et al. (2000), Lavalley-Fouquet, Cabrit, and Dougados (2000), Bacciotti, Eislöffel,\nand Ray (1999), and Bacciotti and Eislöffel (1999). For most of the streamlines, the X-rays are\nresponsible for setting up the initial ionization of the flow. Similarly, the inner wind out to 10 AU\nis mainly heated by X-rays, but mechanical heating dominates most of the rest of the flow.\nIn addition to adiabatic and Lyman-α cooling, gas on the inner streamlines close to the source\nis cooled by several atomic hydrogen processes discussed in §2.4, mainly recombination and H−\ncooling (equations [2-37] and equations [2-26], respectively). Within a short distance from the\nsource, adiabatic and Lyman-α cooling take over and eventually adiabatic cooling dominates. The\n\n\f– 24 –\ntransition to adiabatic cooling occurs more rapidly for the lower streamlines. The cooling by the\nforbidden lines of O I and S II also contribute significantly on the inner, collimated streamlines,\neventually dominating adiabatic for the inner 10% of the streamlines and becoming one-third as\nstrong as adiabatic for the inner 25% of the streamlines. For most of the rest of the (uncollimated)\nwind, forbidden line cooling is unimportant.\nAlthough the wind for the fiducial case (Figure 2) has an ionization fraction in the right range,\nit is not hot enough to emit the forbidden lines at the levels observed in the brightest jets. We\ncan achieve the desired temperatures by increasing the coefficient α for mechanical heating. For\nexample, Figure 3 shows the temperature and electron fraction profiles when α is increased by a\nfactor of two to 2 × 10−3 . The temperature is increased by almost a factor of two, and the electron\nfraction by about 20%.\n\n6.2.\n\nSynthetic Images\n\nFigure 4 shows synthetic images of the wind in the forbidden lines of S II λ6731 (left) and\nO I λ6300 (right) for the case illustrated in Figure 3, as they might be observed edge-on and with\nnear-perfect angular resolution. These images are similar to those constructed earlier by SSG, but\nwith some unimportant technical differences in the way that we make the image of the innermost\nregions of the jet. The main physical difference with SSG is that here we calculate the temperature\nand electron fraction from an almost first-principles model, rather than assuming constant values\nfor these parameters. The abundance of OI is calculated on the basis of a theory that gives the\nstandard result given by Osterbrock (1989) for H II regions, i.e., O+ is maintained in chemical\nequilibrium by very fast forward and backward charge-exchange (assuming no H2 ):\nx(H+ )\nxe\n8\n8\nx(O+ )\n= exp−227/T\n≈ exp−227/T\n.\nx(O)\n9\nx(H)\n9\n1 − xe\n\n(6-1)\n\nThe fact that H+ + O charge-exchange is fast means that O+ comes rapidly into equilibrium with\nthe slowly-varying electron fraction. This situation does not generally hold for other atoms where\ncharge exchange with H+ is much weaker, especially for sulfur. We are in the midst of developing\na more general theory of the ionization of the major ionic carriers of jet forbidden lines. In the\ninterim, we assume for Figure 4 that all of the sulfur is in S II (as in SSG).\nWe obtain the appearance of an optical jet in Figure 4 because the inner x-wind has a stratified\ndensity profile that varies approximately as the inverse square of ̟ (SSG), the distance to the jet\naxis, and because the temperature and electron fraction have the right values to produce forbidden\nline emission. The base of the model jet in Figure 4 has a rounded conical shape suggestive of HST\nimages (e.g., Eislöffel et al. 2000) and a horizontal width of the order of 25 AU. The width, which\ndepends somewhat on definition, is determined by the critical density of the transitions, along\nwith the temperature and electron fraction. The emissivities integrated along the line of sight\ndecline very rapidly with horizontal distance from a cusp close to the axis. A careful inspection of\n\n\f– 25 –\nthe images near the equatorial plane reveals that O I λ6300 is stronger than S II λ6731, basically\nbecause high-temperature and high-density regions contribute more to the line-of-sight integral of\nthe emissivity than the lower temperature and lower density regions that are more important at\nhigh altitudes. Here we are seeing the result of the competition between the lower critical density\nof the S II λ6731 transition and the greater intrinsic strength of the O I λ6300 transition (and\nlarger O abundance). Images like Figure 4 provide a concrete basis for observational tests of our\nthermal-chemical theory of the x-wind jet.\n\n6.3.\n\nAdditional Parameter-Space Studies\n\nIn addition to the models shown in Figures 2-4, we have made some further exploratory\ncalculations without attempting a systematic search of the model parameter space, defined largely\nby mass-loss rate Ṁw , X-ray luminosity LX , and mechanical heating strength α. For example, we\nhave calculated models with larger values of α. Increasing α from 0.002 to 0.005 increases the\ntemperature by about 2/3 and the electron fraction by about 1/3. Inside the jet (̟ ≤ 25 AU),\nT is in the 10,000 - 13,000 K range and xe is in the 0.03-0.05 range. This model may well have\nastrophysical applications, and its observational aspects will differ from those of the α = 0.002\nmodel in Figures 3 and 4. For example, higher-excitation levels of O I and S II may be excited and\nsignificant abundances of O II and N II produced. An important question is whether a warm model,\nwith α = 0.005 or larger, could produce a level of ionization sufficient to produce the forbidden\nlines by just collisional ionization of the H atom without X-rays. Setting LX = 0 in the model\nwith α = 0.005, we find that the electron fraction is reduced by about an order of magnitude and\nthat the temperature is increased even further, e.g., up to 15,000 K inside the jet and even higher\noutside. (The decrease in xe makes ambipolar diffusion heating effective close in and reduces some\nof the cooling). Obtaining wind ionization levels greater than a few percent by heating without\nX-rays doesn't work without going to temperatures beyond the range indicated by the forbidden\nline observations. Some type of external mechanism is required to produce the degree of ionization\ninferred from observations, and we have shown that stellar X-rays are able to do the job.\nWhen we examine the upper part of Figure 2, we see that the temperature of the wide-angle\nwind is quite high on the largest scale shown (the upper left panel), roughly between 3,000-6,000 K;\nfor α = 0.002 (Figure 3) the range is 6,000-9,000 K. We are uncertain of the physical significance\nof this result because there are no measurements of the wind in this region (at least until larger\ndistances are reached where the wind collides with ambient material). One possibility is that\nthe mechanical heating formula used so far, equation (5-2), does not hold for the majority of the\nstreamlines which are strongly divergent (where shockwaves do not propagate even approximately\naccording to a planar description). Using other prescriptions (e.g., changing the density dependence\nin equation (5-2) from a linear to a nonlinear dependence), we find that the collimated jet can be\nmade warmer and the uncollimated outer wind colder.\n\n\f– 26 –\nThe total X-ray luminosity used in the fiducial model (Table 2), LX = 4 × 1031 erg s−1 , is\nseveral times larger than the values determined by CHANDRA observations of young solar-mass\nYSOs in Orion (Feigelson 2001, private communication). However, the key physical parameter\nis the X-ray ionization parameter, ζ/n, which determines the imprinting of the ionization at the\nbase of the wind. Thus the essential model parameter is not LX alone but something closer to\nLX /Ṁw , at least for small values of Ṁw where X-ray absorption effects are small or moderate. We\nhave run models for α = 0.002 (to match Figures 3 and 4) where LX and Ṁw are simultaneously\ndecreased (and increased) by a factor 3. When LX and Ṁw are decreased by 3, the temperature\nis reduced slightly and the ionization fraction increased somewhat more due to the reduction in\nX-ray absorption. The net result is a model which is very similar to the ones shown in Figures 3\nand 4. Increasing LX and Ṁw may also work, despite the fact that the electron factor is decreased\nby a factor of 2 because of the increase in X-ray absorption, simply because the emissivity of the\nforbidden lines is determined by the electron density rather than electron fraction. It should be\nrecalled that LX can also be greater than 1031 erg s−1 in flares and that changes in LX and Ṁw are\nlikely to occur on different time scales.\nThe warm and ionized conditions found for the outer wind in Figures 1-3 are in stark contrast\nto the results of RGS because of our inclusion of X-ray ionization and mechanical heating in the\npresent calculations. We have already discussed our uncertainty in applying the heating model\nof §5 to the uncollimated flow in the absence of compelling observational information about this\npart of the wind. It is quite possible that the wide-angle wind is not as warm as the above figures\nsuggest. Furthermore, our thermal-chemical model needs to be extended in this region to include\nthe thermal and chemical effects of molecules. Although not mentioned in §2, we have made a\npreliminary study of molecular hydrogen, mainly to insure that the abundance of H2 is negligible\nin the inner part of the wind. The molecular physics and heavy element chemistry of the wideangle part of the wind are of considerable interest in connection with the detection of H2 jets in\nyoung embedded YSOs (e.g., Zinnecker, McCaughrean, and Rayner 1998; Stanke, McCaughrean,\nand Zinnecker 1998), and we plan to return to this subject in the near future.\n\n6.4.\n\nLine Ratios\n\nIn addition to synthetic images of the forbidden line emission, like those displayed in Figure 4,\nwe can also examine particular line ratios that are sensitive to the underlying physical properties\nof the wind as calculated in this paper. This approach has been widely used for H II regions and\nplanetary nebulae (Osterbrock 1989), and it has been developed into a diagnostic tool for YSO jets\nby Bacciotti and Eislöffel (1999). Figure 5 is a plot of the S IIλ6716/S IIλ6731 line ratio vs. the\nS IIλ6731/O Iλ 6300 line ratio based on the same model as the synthetic images in Figure 4, where\nthe jet is viewed perpendicular to its axis. The former ratio (the ordinate in the figure) is diagnostic\nof ne and the latter (the abscissa) is sensitive to T . The blue dots are the ratios formed from the\nline intensities for each pixel in the synthetic image of Figure 4, plotted one against the other. The\n\n\f– 27 –\ndense concentration of blue points at the top of the \"blue cliff\" arise from distant wind locations\nwith low temperature and electron density, whereas the points at the lower left come from close in\nwhere temperature and electron density are high. The red asterisks are data for HH objects from\nthe compilation of Raga, Böhm, and Cantó (1996), and the red circles are data for DG Tau taken\nfrom Lavalley-Fouquet, Cabrit, and Dougados (2000). The comparison is meant to be illustrative\nand should not be taken too literally. The blue points have been obtained by \"lighting up\" every\npixel of a steady-state jet, as modeled by a specific x-wind model with mechanical heating according\nto equation (5-2), and viewing the jet from a single direction. The asterisks are observations of\na diverse set of HH objects viewed at a variety of angles and with a range of spatial resolution.\nUnder these circumstances, we should not expect any more than a general kind of agreement.\nThe successful demarcation by the theory of the region in Figure 5 where observed YSO-jet\nline-ratios are found is therefore extremely satisfying. It confirms that the temperature and electron\ndensity (integrated along the line of sight) of our thermally and mechanically self-consistent x-wind\nmodel are indeed in the right range to explain the observations of real sources. It is significant\nthat this agreement is obtained by adjusting the one free parameter at our disposal, α, since the\nothers are constrained by independent observations. We emphasize that we use the same value\nof α in the line-ratio plot of Figure 5 as in the image in Figure 4, α = 0.002. Lavalley-Fouquet\net al. (2000) have attempted to correlate a similar data set with a complex shock model that employs\na continuous distribution of shock velocities for each of 5 values of pre-shock density, ranging from\n102 − 106 cm−3 . The resulting line-ratio diagram then consists of a set of 5 curves or branches, one\nfor each pre-shock density. Their analysis does not give the broad range of conditions observed for\nHH objects, but it is more successful with the more uniform set of high spatial-resolution data for\nDG Tau. The latter data appear to support a shock interpretation of the line ratios.\nIt is worth commenting that some of the extreme line-ratios, represented by the red circles in\nthe lower left part of Figure 5, come from the highest spatial resolution measurements available\nfor DG Tau obtained with adaptive optics (Lavalley-Fouquet et al. 2000). It is no coincidence, we\nbelieve, that the high temperature and electron-density conditions required to produce such ratios\noccur in the theoretical model near the base of the observed flow. By increasing the mass-loss rate\nslightly, these data would lie closer to the main body of the theoretical blue points in Figure 5. The\nobservations of Lavalley-Fouquet et al. (2000) reinforce the importance of carrying out spectroscopic\nmeasurements at a spatial resolution sufficient to probe the extreme conditions close to the source\nof the jet. It is also noteworthy that the three red asterisks in the lower right of the diagram that\nfall outside the envelope of blue dots are all associated with strong bow shocks (Raga et al. 1996).\nThe large jumps experienced across strong bow shock are evidently not well represented by the\nsimple formula, equation (5-2), with a (weak-shock) value α = 2 × 10−3 . It should also not be too\nsurprising that some data points lie outside of the theoretical range in Figure 5, considering that\nthe blue dots have been calculated for a single viewing angle of one specific jet model, whereas the\ndata sample a wide range of objects viewed under different conditions.\nThe main purpose of the line-ratio plot in Figure 5 is to ensure that the physical properties of\n\n\f– 28 –\nthe x-wind, as calculated in this paper, provide a sound foundation for quantitative comparisons\nbetween theory and observations. More detailed comparisons will require tailoring the theoretical\nmodels to the specific parameters of individual sources and considering additional diagnostics, e.g.,\nthe forbidden lines of other species and the radio continuum emission and radio recombination lines\ndiscussed in the next section. This next level of modeling would better constrain the adjustable\nparameters of the problem as well as test the theory under a wide range of flow and radiation\nconditions. Given the developments of this paper, such detailed tests are within our grasp, but\ntheir implementation is beyond the scope of the present paper.\n\n7.\n\nDiscussion\n\nThe results presented in §6 confirm that the thermal-chemical program described in this paper\ncan provide the basis for making comparisons between x-wind theory and observations. Using the\nforbidden lines S II (λ6731) and O I (λ6300) from jets as the main example, we have shown that the\ncollimated portion of the x-wind, when ionized by X-rays and heated mechanically, emits these lines\nin a manner strongly suggestive of the actual images made by observers (Figures 4). The model\nalso appears capable of reproducing the measured line ratios (Figure 5). More definitive conclusions\nwill require detailed quantitative comparisons between the theory and observations of individual\nobjects. Thus we are in the midst of a study that considers further aspects of the forbidden lines,\nsuch as diagnostic line ratios of additional atoms and ions. The analysis of forbidden line images\nobtained at high spatial and spectral resolution have the potential to provide strong tests of the\npredictions that we are now able to make for the x-wind. In order to explore the jet structure\npredicted for scales smaller than 25 AU, observations with an angular resolution significantly better\nthan 0.15′′ are required for sources at a distance of 150 pc. Recent measurements with the Hubble\nSpace Telescope (Bacciotti et al. 2000) and with an adaptive optics system on the Canada-HawaiiFrance Telescope (Dougados et al. 2000) have begun to probe jets on this scale.\nAn independent test of the x-wind model can be made by interferometric measurements of\nthe radio continuum emission from the hot partially-ionized gas in the inner wind. Because of\nthe absence of extinction, radio observations can probe deep into the inner wind close to the\nsource of the outflow. Thermal radio emission has already been detected at the centers of more\nthan 100 YSO outflows (Eislöffel et al. 2000; Rodrı́guez 1997), and about one fifth of these have\nbeen mapped at high spatial resolution, including a fair number that can be modeled to test the\nx-wind (Rodrı́guez 2001, private communication). According to the standard theory of thermal\nbremsstrahlung emission from a plasma with a uniform temperature (e.g., Shu I 1991), the optical\ndepth is\n−3/2\nτff ≈ 6 × 10−28 E cm5 (λ/3cm)2 T4\n,\n(7-1)\n\nwhere T4 is the temperature in 104 K and E is the emission measure. In the approximation of\nPaper V, where the density at a given height above the midplane varies with horizontal distance\nas ̟ −2 , τff ∝ λ2 ̟−3 , and the size of emission contours of a given intensity level should scale as\n\n\f– 29 –\nλ2/3 , as observed in the best studied cases (see the review of Anglada 1996). Shorter wavelength\nobservations are then favored for discriminating the wind from the cooler and lower density inner\ndisk. We expect that the thermal bremsstrahlung emission for models with the fiducial parameters\nin Table 2 will be mainly optically thin, except very close to the source. We plan to synthesize\nthe emission for models of the x-wind as it would be observed by the Very Large Array. If we\nare successful in reproducing the observations, we should be able to determine the mass-loss rates\nof thermal jets in a more realistic way than is currently done with the simple bi-conical model of\nReynolds (1986).\nAnother way of testing the x-wind model with radio observations is provided by the mm and\nsub-mm recombination lines emitted by the hot plasma near the base of wind. Important kinematic\ninformation can be obtained by sensitive measurements of line shapes at high spatial resolution.\nHigh spectral resolution is also required to detect the lines in the presence of strong continuum\nemission by the disk at mm and sub-mm wavelengths. The hydrogen recombination lines that lie in\nthe mm and sub-mm bands for α transitions (n + 1 → n) occur for principal quantum numbers n in\nthe range 25-45. Welch and Marr (1987) made the first detection of mm recombination lines in the\nultra-compact H II region W3(OH) with the H42α line at 86 GHz. This discovery was soon followed\nby other detections in regions of massive star formation (e.g., Gordon and Walmsley 1990) and by\nthe discovery of masing transitions in MWC 349 by Martin-Pintado, Bachiller, Thum, and Walmsley\n(1989). Ground based and space observations of MWC 349 show that the masing reaches a broad\npeak at n = 19 or 300 μm (Thum et al. 1998). To the best of our knowledge, radio recombination\nlines have not yet been detected in T Tauri stars. Rough preliminary estimates suggest that the\nradio recombination transitions produced in the x-wind will be weakly masing for lines that fall in\nthe familiar sub-mm windows. We expect that some of these lines will be detected by new sub-mm\ninstrumentation now under development such as the Sub Millimeter Array (SMA) and the Atacama\nLarge Millimeter Array (ALMA). In order to calculate the emission and to synthesize images as\nobserved with these new instruments, we need to supplement the program described in this paper\nwith a full multi-level population calculation for hydrogen and with appropriate radiative transfer.\nThese developments are now in progress, and we hope to report soon on the diagnostic prospects\nof the radio recombination lines for testing the validity of the x-wind model.\n\n8.\n\nConclusion\n\nWe have developed a thermal-chemical program that provides the basis for making detailed\npredictions for the x-wind model that can be compared with observations. The program incorporates new physical processes, particularly for heating (mechanical) and ionization (X-rays). The\nrate coefficients for all of the underlying microscopic processes have been re-evaluated and recalculated as required. In some cases, significantly different values have been obtained from those in the\nliterature, e.g., the coefficient for ambipolar diffusion heating, and these should be useful in other\nproblems.\n\n\f– 30 –\nIn principle the program can describe a wide variety of flows, all within the context of the\nx-wind model. The key astrophysical model parameters are the mass-loss rate (Ṁw ), the X-ray\nluminosity (LX ), and the mechanical heating strength (α). The first two can be chosen to represent\na particular kind of YSO at some stage of evolution, but a considerable range in these parameters\nis allowed by the observations. They may also be variable on short time scales, as is the case for\nthe X-ray emission. In contrast, we regard α as a phenomenological parameter. For the case of an\nactive but revealed source with an optical jet, the temperature of such jets, as seen in the forbidden\nlines of oxygen and sulfur, indicates that α ≈ 2 × 10−3 .\nIt is very likely that the three parameters, Ṁw , LX , and α are not all independent of one\nanother. For example, we might expect that all three parameters decrease as we proceed from\nvery young and active YSOs to older and less active ones. In this paper, we have concentrated on\nsources with optical jets to illustrate our approach. The exploration of other cases should lead to\nnew opportunities for testing the x-wind model. In this context, an interesting question is what\nkinds of jets occur at earlier evolutionary stages when the mass-loss rate is much larger than we\nhave used here, ∼ 3 × 10−8 M⊙ yr−1 . To answer this question, we are planning to extend the\nunderlying physics of our model to include the essential molecular processes that are expected to\noccur when both the X-rays and the stellar radiation are more heavily extincted than in the cases\ntreated in this paper.\nThe main result of this paper is the demonstration that the x-wind model, when extended to\ninclude thermal and chemical processes, has the capability to reproduce line ratios as well as images\nof the forbidden lines of jets in a self-consistent manner. We have also outlined a program for testing\nthe model against the observations of individual objects, with the goal of better constraining the\nparameters of the problem and testing the theory under as wide a range of conditions as possible.\nThe developments undertaken in the present paper now make such detailed tests possible.\nThe authors would be pleased to make available digital versions of the theoretically calculated\nemissivities to observers interested in making detailed comparisons between theory and observation.\nThis research has been supported in part by the National Science Foundation through collaborative\nresearch grants to the Berkeley Astronomy and the NYU Physics departments. S.L. acknowledges\nsupport from DGAPA/UNAM and CONACyT. The authors are grateful to Alex Dalgarno, Dave\nSchultz, and Pedrag Krstić for advice and help on the cross sections for the interaction of H+\nwith H, He, and H2 , and they would like to to thank Luis Rodrı́guez for a careful reading of the\nmanuscript and for his comments.\n\n\f– 31 –\nA.\n\nRate Coefficient for H− -H+ Neutralization\n\nThe exothermic channels of the reaction\nH− + H+ → H(1) + H(n)\n\n(A1)\n\nhave the energy yields 12.582, 2.648, 0.758, and 0.096 eV for n = 1, 2, 3 and 4. But curve-crossing\nconsiderations and detailed theoretical calculations (Fussen & Kubach 1986) indicate that, at mean\ncenter of mass energies less than 2 eV, reactions to the n = 3 level dominate by a large margin over\nthose to n = 2.\nThe total neutralization cross section has been measured from 0.15-300 eV by Moseley, Aberth,\n& Peterson (1970), from 5-2000 eV by Szucs et al. (1984), and from 30-2000 eV by Peart, Bennett,\n& Dolder (1985). Only the lowest energies below a few eV are relevant for our astrophysical\napplications, and here the cross sections of Moseley et al. decrease with energy E roughly as E −1 .\nHowever, the later experiments at higher energies clearly show that the results of Moseley et al. are\ntoo large by a factor of three. This conclusion is supported by the theoretical calculations of Fussen\n& Kubach (1986) with good potential energy curves.They give an analytic fit to the data below 3 eV\n(after renormalizing the low-energy results), from which we obtain the following approximation to\nthe rate coefficient for H− -H+ neutralization valid below 10,000 K:\nh\ni\nk± = 2.40 × 10−6 T −1/2 + 4.96 × 10−9 + 6.46 × 10−11 T 1/2 + 7.46 × 10−14 T cm3 s−1\n(A2)\nA typical value at T = 10, 000 K is 3.62 × 10−8 cm3 s−1 , which can be compared to the RGS value,\n10−8 cm3 s−1 .\n\nB.\n\nLevel Population of the Model Hydrogen Atom\n\nWe treat here the effects of collisional and X-ray ionization and excitation on the population\nof our model two-level (n = 1, 2) plus continuum (c) H atom. Table B lists the relevant processes\nand associated rates.\nTable B. H Atom Processes\nCollisional excitation and de-excitation\nSpontaneous decay\nPhotoionization by the Balmer continuum\nRadiative recombination\nCollisional ionization from n = 1, 2\nX-Ray ionization from n = 1, 2\nX-Ray excitation (n = 1 to n ≥ 1)\n\nC12 , C21\nA21 β21\ng2c\nkS (≥ 2)\nC1c , C2c\nζ1c , ζ2c\nζ12\n\nThe collisional rate coefficients have the form C = xe nk(T ) because we assume that electrons\nare the most important collision partners. We have used Voronov's (1997) fit for k1c ; at T = 104 K,\n\n\f– 32 –\nit agrees to within 10% percent with the simpler formula used by RGS. For k2c , we fit the rate\ncoefficients given by Janev et al. (1987) to obtain\nk2c = 7.37 × 10−10 T 1/2 e−39,471K/T cm3 s−1 .\n\n(B1)\n\nFor T = 104 K, k1c is about 5 × 10−8 smaller than k2c so that, if the n = 2 level is thermally\npopulated, collisional ionizations from the n = 2 level proceed at a faster rate than from the\nground level. We use the same collisional de-excitation rate coefficient for the n = 2 − 1 transition\nas RGS, based on Vernazza, Avrett, and Loeser (1981). The photoionization rate is given above in\n§2.4.1: g2c = W∗ gA,∗ (2)+Wh gA,h (2) (Eq. [2-31]), as is the recombination rate, kS (≥ 2) (Eq. [2-34]).\nThe X-ray rates in Table B are related to the rate ζ at which ion pairs are produced, discussed\nin §3. Because the cosmic X-ray absorption cross section in equation (3-1) is normalized to the\nabundance of hydrogen nuclei, the ionization rate per unit volume is ζn, where n is the density\nof total hydrogen (nH ), whereas the rates in Table B are defined in terms of level densities. In\na H/He mixture, 88% of the X-ray produced ions are H+ ions (Dalgarno, Yan, & Liu 1999). If\nwe ignore the small contribution from direct X-ray ionization of atoms in the n = 2 level, then\n0.88ζn = ζ1c n1 . Using the approximate conservation relations, n = n1 + nc and ne = nc , leads to\n0.88ζn = ζ1c n(1 − xe ), or\n0.88\nζ.\n(B2)\nζ1c =\n1 − xe\nFurthermore, for every H+ ion produced, 1.73 excited H atoms are produced (0.37 with n > 2\n(Dalgarno et al. 1999). Taking into account the radiative branching of these excited levels to n = 2,\nthe rate ζ12 is given by\n1.34\nζ.\n(B3)\nζ12 =\n1 − xe\nThe rate equations based on the processes in Table B are:\n(ζ12 + C12 )n1 + xe nkS (≥ 2)nc = (C21 + A21 β21 + g2c + C2c + ζ2c )n2\n\n(B4)\n\nxe nkS (≥ 2)nc = (C1c + ζ1c )n1 + (g2c + C2c + ζ2c )n2 ,\n\n(B5)\n\nn1 + n2 + nc = n,\n\nnc = xe n.\n\n(B6)\n\nThe ratio of the populations in the n = 1, 2 levels can be obtained by subtracting equation (B5)\nfrom equation (B4):\n(C12 + C1c + ζ1c + ζ12 )n1 = (C21 + A21 β21 )n2 ,\n(B7)\ni.e. ,\n\nk21 nxe + A21 β21\nn1\n≡Q=\n.\nn2\nk12 nxe + k1c nxe + ζ1c + ζ12\n\n(B8)\n\nThe population of the n = 2 level given in equation of §2.1.4 is obtained by ignoring n2 in the\nconservation relation, equation (B6): n1 ≈ (1 − xe )n. A quadratic equation for the steady electron\nfraction can also be obtained from equation (B5), but in this work we find xe by integrating the\n\n\f– 33 –\nrate equation (2-13). It may also be noted that recombination into and ionization processes out of\nthe n = 2 level drop out of the population ratio, n1 /n2 = Q.\nThe thermal implications of the above rate equations can be written as,\nΓ−Λ = (n2 C21 −n1 C12 )E21 +g2c n2 ∆E2c −xe nkS (≥ 2)nc kT −C1c n1 I −C2c n2 ∆E2c +ζ1c ∆ǫ1 n1 , (B9)\nwhere ∆ǫ1 is the X-ray heating energy when an ion pair is generated from the n = 1 level, essentially\nthe same as the heating energy used in §3, ∆ǫheat = yheat ∆ǫion . When we use equation (B2) for\nζ1c , the last term of equation (B9) becomes the usual X-ray heating term (and now includes He+ ),\ni.e.,\nΓ−Λ = (n2 C21 −n1 C12 )E21 +g2c n2 ∆E2c −xe nkS (≥ 2)nc kT −C1c n1 I−C2c n2 ∆E2c +ζn∆ǫheat . (B10)\nWe can rearrange this result using population balance equation (B7),\n(n2 C21 − n1 C12 )E21 = −A21 β21 n2 E21 + (C1c + ζ1c + ζ12 )E21 n1 ,\n\n(B11)\n\nso as to exhibit the conventional Lyman-α cooling:\n1\nΓ − Λ = −A21 β21 n2 E21 + g2c n2 ∆E2c − xe nkS (≥ 2)nc kT − (C1c n1 + C2c n2 )I\n4\n+ ζn (∆ǫheat + 2.22E21 ) .\n\n(B12)\n\nWe note that this form of the net heating has two X-ray terms, which we may refer to as direct and\nindirect heating. The direct term is the actual X-ray heating, e.g., as calculated by Shull & Van\nSteenburg (1983) and by Dalgarno, Yan, & Liu (1999), that arises from elastic collisions of (X-ray\ngenerated) electrons with the atoms and electrons of the partially ionized plasma. The indirect term,\nproportional to E21 , arises when the net thermal effect of collisional excitation and de-excitation is\nexpressed in a form where the conventional Ly-α cooling appears. The large probability for inelastic\nscattering by secondary electron implies that the wind has a diffuse radiation field which we ignore\nfor simplicity, except for trapped Ly-α radiation.\n\nC.\n\nX-ray Attenuation\n\nThe integral that appears in equation (3-9), Ip (τx , ξ0 ), describes the attenuation of X-rays for\na thermal spectrum (Krolik & Kallmann 1983),\nZ ∞\n\u0002\n\u0001\u0003\nIp (τX , ξ0 ) ≡\nξ −p exp − ξ + τX ξ −p dξ,\n(C1)\nξ0\n\nwhere ξ ≡ E/kTX , E0 is a low-energy cutoff, and the X-ray optical depth is given by\nZ r\nn dr.\nτX ≡ σpe (kTX )N,\nN=\n0\n\n(C2)\n\n\f– 34 –\nFollowing Krolik & Kallman (1983) and GNI, we use the method of steepest descents to derive\nthe asymptotic formula\nIp ≈\n\n\u0012\n\n2π\np+1\np2 τX + ξm\n\n\u00131/2\n\n−(p−2)/2\n−p\nξm\nexp[−(ξm + τX ξm\n)] ≡ Jp (τX ),\n\n(C3)\n\nwhere ξm satisfies the algebraic equation\np\nξm\n(p + ξm ) = pτX ,\n\n(C4)\n\nwhich we solve using Newton's method with the initial guess ξm = (pτX )1/(p+1) . Derived for large\np+1\n(p2 τX + ξm\n), equation (C3) is accurate as long as ξm > ξ0 , i.e., even for τX as small as\nτ0 ≡\n\n1 p\nξ (p + ξ0 ) = 3.4 × 10−3\np 0\n\n(C5)\n\nwhen ξ0 = 0.1. For τX < τ0 , we derive the expansion (valid for ξ0 ≪ 1) by repeated integration by\nparts:\n)\n(\n−(p+1) 2\n[1 − pτX ξ0\n]ξ0\nexp[−(ξ0 + τX ξ0−p )]\nξ0\n−\n+ ...\n≡ Kp (τX , ξ0 ).\n(C6)\nIp =\n(p − 1)\n(p − 1)(p − 2)\nξ0p\n¿From equations (C3) and (C6), we construct the approximate fitting formula for all τX ,\n\u0013\n\u0012\n\u0013\n\u0012\nτX\nτ0\nKp (τX , ξ0 ) +\nJp (τX ).\nIp (τX , ξ0 ) =\nτ0 + τX\nτ0 + τX\nD.\n\n(C7)\n\nAmbipolar Diffusion Heating for Large Ion Fractions\n\nWe analyze ambipolar diffusion heating with a two-fluid model for the ions and neutrals which\nsatisfies the equations of motion\nρn an = ρn g + fd ,\n(D1)\nρi ai = ρi g − fd + fL ,\n\n(D2)\n\na ≡ (v * ∇)v\n\n(D3)\n\nwhere\nstands for the steady-flow acceleration for in an inertial frame, g is the gravitational acceleration,\nfd = γρn ρi (vi − vn )\n\n(D4)\n\nis the volumetric drag force of the ions on the neutrals, and fL = (∇ × B)f × B/4π is the volumetric\nLorentz force. Addition of equations (D1) and (D2) yields the equation of motion for the combined\nion-neutral fluid,\nρa = ρg + fL ,\n(D5)\n\n\f– 35 –\nwhere ρ ≡ ρn + ρi is the total mass density (without the electrons) and a ≡ (ρn an + ρi ai )/ρ is the\ntotal acceleration.\nThe dynamics of the x-wind can be obtained to sufficient accuracy by ignoring the difference\nbetween vn and vi when we use equations (D3) and (D5) to compute the acceleration of the neutrals\nand the ions kinematically (from the mean velocity v ≡ (ρn vn + ρi vi )/ρ) and dynamically (from the\ntotal force ρg + fL ). We cannot ignore vi − vn in the heating problem because ambipolar diffusion\nheating vanishes unless the ion and neutral velocities differ. However, we can use the equation\nfor the difference in the accelerations obtained by subtracting 1/ρi times equation (D2) from 1/ρn\ntimes equation (D1):\n\u0013\n\u0012\n1\n1\n1\n+\n(D6)\nfd − fL .\nan − ai =\nρn ρi\nρi\nIf we now ignore the difference in the accelerations, but not in the velocities, the left-hand side of\nD6 is zero and this equation yields\n\u0013\n\u0012\nρn\nfL .\n(D7)\nfd =\nρn + ρi\nFor lightly ionized media, ρi ≪ ρn , we obtain fd = fL . This is the expected and familiar result.\nWhen the ionization fraction is low, the ions have relatively little inertia and quickly reach terminal velocity governed by the balance of frictional and Lorentz forces, i.e., equation (D2) has the\napproximate solution, fd = fL .\nWe now obtain the slip velocity from equation (D4) for the drag force,\nvi − vn =\n\nfL\n.\nγρi (ρn + ρi )\n\n(D8)\n\nThis generalizes the lightly-ionized expression by replacing ρn in the denominator by ρn + ρi .\nExpression D8 is asymmetric in n and i because the Lorentz force acts only on charged particles.\nThus, the slip velocity can become large if ρi becomes very small, but not if ρn becomes very small\n(when the sea of ions, moving under both gravity and the Lorentz force, simply drags the few\nneutrals that are present along with the rest of the almost completely ionized plasma).\nThe volumetric rate of heat input into the combined fluid by ambipolar diffusion is\nΓAD = fd * (vi − vn ),\n\n(D9)\n\nand substitution of equations (D4) and (D8) leads to\nΓAD =\n\nρn |fL |2\n.\nγρi (ρn + ρi )2\n\n(D10)\n\nNotice that ΓAD = 0 (instead of ∞) for a completely ionized plasma when ρn = 0 but ρi 6= 0.\nThus equation (D10) is self-limiting when T approaches and exceeds 104 K (and the gas becomes\ncollisionally ionized. Although the treatment by Safier (1993) differs from ours, his ΓAD also\nvanishes when ρn = 0.\n\n\f– 36 –\nE.\n\nThe Ion-Neutral Coupling Coefficient For Warm HI Regions\n\nIn order to calculate the ambipolar diffusion heating rate from D10, we need the momentum\ntransfer rate coefficient γ (dimensions cm3 s−1 g−1 ) introduced in equation (D4). The velocity field\nfor each species consists of a mean velocity v plus a random velocity u, which we assume is thermal.\nEach ion-neutral pair then gives a contribution to γ which involves a double thermal average of the\nmomentum transfer cross section and can be transformed into (Draine 1986):\nfd = γρn ρi w = Σjk nj nk mjk wjk Kjk\n\n(E1)\n\nwhere j and k label ionic and neutral species, respectively, w ≡ vi − vn , wjk ≡ vj − vk , mjk is the\nreduced mass,\nZ ∞\n1\n−3\n2\nx2 exp(−x2 ) [2xsjk cosh(2xsjk ) − sinh(2xsjk )] σjk (xcjk ) dx, (E2)\nKjk = √ cjk sjk exp (−sjk )\nπ\n0\np\nis a momentum transfer rate coefficient, cjk = 2kT /mjk , and sjk = w/cjk . We will approximate\nall of the wjk by the slip speed w of the two-fluid model used in Appendix D and assume that\nthe random velocities are all Maxwellian at the same kinetic temperature. When the momentumtransfer cross section varies inversely with the velocity, the integral reduces to the usual Langevin\nrate coefficient vσ(v), whereas for a constant cross section it is (Draine 1986)\n\u0014\n\u0015\n9 w 2 1/2\n4\nI = vσ 1 + ( )\n3\n16 v\n\n(E3)\n\nwhere v = (8kT /πm)1/2 is the familiar mean relative velocity of a pair with reduced mass m.\nBefore evaluating the sum in equation (E1), we discuss the cross sections that actually occur in\nthis problem.\n\nE.1.\n\nThe Cross Sections\n\nThe model described in the main body of the text deals with warm atomic regions where the\ndominant ion is H+ , in contrast to molecular clouds where heavy ions such as C+ and a variety\nof molecular ions (notably HCO+ ) are more important. The main collision partners of the ions\nare H and He atoms. Osterbrock (1961) focused on the central role of the (induced) polarization\npotential,\ne2\n1\n(E4)\nV = − αpol 4 ,\n2\nr\nin ion-neutral scattering, where αpol is the polarizability of the neutral; he calculated the rate coefficient for momentum transfer between a heavy interstellar-cloud ion and the dominant gas species,\nH, He, and H2 . Equation (E4) leads to a temperature-independent rate coefficient (Langevin-type,\n1/2\n∝ αpol ). Following Draine (1980), essentially all authors have taken into account the breakdown\n\n\f– 37 –\nof Osterbrock's treatment at high temperatures, due to interactions of shorter range than 1/r 4 , by\napproximating their contribution by a constant cross section. In the case of Na+ + H2 scattering,\nfor example, Mouschovias & Paleologou (1981) (see also Draine, Roberge, & Dalgarno 1983) estimated this as a geometric cross section, 1.67 × 10−15 cm2 . This guess has not been borne out by\nthe recent quantum calculations of Flower (2000), where the para-H2 -HCO+ cross section varies as\nE −1/3 for energies between 10 − 104 K, rather than the Langevin E −1/2 dependence, although the\nnumerical value of the rate coefficient at 20 K is essentially the Langevin value).\nDraine (1980) also realized that H+ +H scattering, basic to our calculations, is strongly affected\nby charge exchange because of the identity of the two nuclei. There are now good experiments of this\nreaction which provide a sound basis for the calculation of the momentum transfer rate coefficient.\nThe definitive proof that charge transfer is significant comes from the merged beam experiment by\nNewman et al. (1982), which measures both H+ + H and H+ + D scattering with an ion optics\nsystem that can distinguish between charge exchange and elastic scattering down to energies as low\nas 0.1 eV. They obtain excellent agreement with the theory of Hunter & Kuriyan (1977), which is\nfully quantum mechanical and goes down to 10−4 eV and also agrees with the high-energy theory\nof Dalgarno & Yadav (1953) and other high-energy experiments (e.g., Gilbody 1994).\nIn addition to the definitive work of Hunter & Kuriyan (1977) for E > 10−4 eV, the momentum\ntransfer cross sections have been calculated by Hodges & Breig (1991) in the same energy region,\nand by Krstić & Schultz (1998) for H+ + H, H+ + He, H+ + H2 for energies E > 0.1 eV. It\n+\n+\nis significant that, for none of the basic molecular ions (H+\n2 , HeH , H3 ), does the scattering\ncross section manifest the pure E −1/2 dependence of the Langevin theory. But when (diffraction)\noscillations are averaged out, they all approximate this energy dependence below a certain energy E1 .\nThe three cross sections behave differently above E1 , as seen in Table E1, which gives approximate\npower law fits to the momentum transfer cross section σmt (E) = σmt (E1 )(E/E1 )p . The slopes\nbelow and above E1 are p1 and p2 , respectively.\nTable E-1. Momentum Transfer Power Law Fits\nSystem\nE1 (eV) σmt (E1 ) 1 p1\np2\nH+ + H\n0.01\n165\n-1/2 -1/8\n+\nH + He 1.0\n9.8\n-1/2 -1\n+\nH + H2 5.0\n5.6\n-1/2 -2\n−16\n1. Cross section units: 10\ncm2\nThe break points E1 are high enough for H2 and He that the E −1/2 fit is sufficient for T < 104 K.\nFor H+ +H, however, both parts of the fit should be retained, although the high energy or exchange\nscattering dominates for T > 100 K.\n\n\f– 38 –\nE.2.\n\nCalculations of the Rate Coefficient\n\nWhen the momentum-transfer cross sections are approximated by high and low-energy power\nlaws, as in Table E1, the rate coefficient in equation (E2) consists of two terms,\nK = α1 + α2 .\n\n(E5)\n\nWhen we integrate over all energies for the first term, it becomes a constant, Langevin-type, rate\ncoefficient, which we tabulate in Table E2.\nTable E2. Rate Coefficients1\nSystem\nα1\nH+ + H\n3.23\n+\nH + He 1.52\nH+ + H2 2.83\n1. Units: 10−9 cm3 s−1\nFor H+ + H, we calculate α2 (H) by replacing the E −1/8 dependence in Table E1 by the\n(constant) average value for the interval E = 0.01 − 1.0 eV (1.5 × 10−14 cm2 ), integrating over all\nenergy, and using Draine's (1986) equation (E3). The result is\nα2 = 4.10 × 10−8 cm3 s−1 T40.5 [1 + 1.338 × 10−3\n\nw52 1/2\n] ,\nT4\n\n(E6)\n\nwhere T4 is the temperature in units of 10,000 K and w5 is the drift speed in km s−1 . Notice that,\nfor T = 104 K, α2 (H) is more than an order of magnitude larger than α1 (H) due to the dominance\nof charge exchange scattering for E > 0.01 eV.\nFor the temperature range of interest, 102 < T, 104 K, H+ + H dominates over H+ + He and\nH+ + H2 scattering because of abundance considerations and also because H+ + H scattering is\nso much stronger for E > 0.01 eV. The high-energy contribution α2 can be ignored for H2 and He\nbecause the breakpoints E1 are larger than for H and because the cross sections decrease more\nrapidly than the characteristic low-energy dependence on 1/v. Thus α1 in Table E2 gives a good\napproximation (actually upper limit) to the momentum-transfer rate coefficients for H+ + He and\nH+ + H2 in the temperature region of interest\nOn substituting these results into equation (E1), we find that the ion-neutral coupling coefficient is\n1 x(H)[α(H)2 + α(H)2 ] + (4/3)x(H2 )α(H2 )1 + (8/5)xHe α(He)1\n,\n(E7)\nγ=\n2mH\nxH + 2xH2 + 4xHe\nor, numerically,\n\u0012\n\u0013\n2.13 × 1014\nγ =\ncm3 s−1 g−1\n1 − 0.714xe\n\u0015\n\u0014\nw2\n(E8)\n× {3.23 + 41.0T40.5 (1 + 1.338 × 10−3 5 )0.5 }x(H) + 2.21x(H2 ) + 2.43xHe .\nT4\n\n\f– 39 –\nREFERENCES\nAnglada, G. 1996, in Radio Emission from the Stars and the Sun, eds. A. R. Taylor & J. M. Paredes,\n(PASP: San Francisco), 3\nBacciotti, F., Chiudere, C. & Oliva, T. 1995, A&A, 296, 185\nBacciotti, F. and Eislöffel, J. 1999, A&A, 342, 717\nBacciotti, F., Mundt, R., Ray, T.P., Eislöffel, J., Solf, J., & Camenzind, M. 2000, ApJ, 357, L49\nBacciotti, F. 2001, Rev. Mex. AA (Serie de Conferencias), in press\nBiermann, L. & Sclüter, A. 1950, Zs. f. Naturf. 5a, 237\nBlack, J.H. 1987, Interstellar Processes, eds. D. J. Hollenbach and H. A. Thronson, Jr., (Dordrecht:\nReidel), 731-744.\nCalvet, N. & Gullbring, E. 1998, ApJ, 509, 802\nDalgarno, A., Yan, M., & Liu, W.-H. 1999, ApJS, 125, 237\nDalgarno, A. & Yadav, H.N. 1953, Proc. Roy. Soc., A66, 173\nDougados, C., Cabrit, S., Lavalley, C., & Ménard, F. 2000, A&A, 357, L61\nDraine, B. T., 1980, ApJ, 241, 1021\nDraine, B. T., 1986, MNRAS, 220, 133\nDraine, B. T., Roberge, W.G., & Dalgarno, A. 1983, ApJ, 264, 485\nEislöffel, J., Mundt, R., Ray, T. P., Rodrı́guez, L. F. 2000, in Protostars and Planets IV, eds. V.\nMannings, A.P. Boss, and S. Russell, (Tucson: University of Arizona Press), 815\nFeigelson E.D. & Montmerle, T. 1999, ARA&A, 37, 363\nFlower, D.R. 2000, MNRAS, 313, L19\nFussen, D. & Kubach, C. 1986, J. Phys. B, 19, L31\nGarmire, G., Feigelson, E.D., Broos, P., Hillenbrand, L.A., Pravdo, S.H., Townsley, L., & Tsuboi,\nY. 200, AJ, 120, 1426\nGlassgold, A.E., Mamon, G.A., & Huggins, P.J. 1991, ApJ, 373, 254\nGlassgold, A.E., Najita, J. & Igea, J. 1997 (henceforth GNI), ApJ, 480, 344\nGilbody, H.B. 1994, Advances in Atomic, Molecular, and Optical Physics, 33,149\n\n\f– 40 –\nGounelle, M., Shu, F.H., Shang, H., Glassgold, A.E., Rehm, K.E., & Lee, T. 2001, ApJ, 548, 1051\nGullbring, E., Calvet, N., Muzerolle, J., & Hartmann, L. 2000, ApJ, 544, 927\nHartigan, P., Bally. J., Reipurth, B., & Morse, J.A. 2000, in Protostars and Planets IV, eds. V.\nMannings, A.P. Boss, and S. Russell, (Tucson: University of Arizona Press), 841\nHenke, B.L., Gullikson, E.M., & Davis, J.C. 1993, At. Data Nuc. Data, Tables, 54, 181\nHodges, X. & Breig, Y. 1991, JGR, 96, 7697\nHunter, X. & Kuriyan, Y. 1977, Proc. Roy. Soc., A353, 575\nIgea, J. & Glassgold, A.E. 1999, ApJ, 518, 848\nJanev, R. K., Langer, W. D., & Evans, K. 1987, Elementary Processes in H-He Plasmas, (New\nYork: Springer)\nJohns-Krull, C. & Valenti, J.A. 2000, in Stellar Clusters and Associations: Convection, Rotation,\nand Dynamos, eds. R. Pallavicini, G. Micela, and S. Sciortino, (San Francisco: PASP), 371\nKönigl, A. & Ruden, S.P. 1993, in Protostars and Planets III, eds. E.H. Levy and J.I. Lunine 1993,\n(Tucson: University of Arizona Press), 641\nKönigl, A. & Pudritz, R.E, 2000, in Protostars and Planets IV, eds. V. Mannings, A.P. Boss, and\nS. Russell, (Tucson: University of Arizona Press), 759\nKoyama, K. in Star Formation 1999, ed. T. Nakamoto (Nobeyama: Nobeyama Radio Obs.), 269\nKrstić, P.S. and Schultz, D.R.1998, Atomic and Plasma-Material Data for Fusion 8, 1\nKrolik, J. H. & Kallmann, T. R. 1983, ApJ, 267, 610\nLandau, L. D. & Lifshitz, E. M. 1959, Fluid Mechanics, (London: Pergamon Press)\nLvalley-Fouquet, C., Cabrit, S., and Dougados, C. 2000, A&A, 336, L41\nLee, T., Shu, F. H., Shang, H., Glassgold, A. E., Rehm, K. E. 1998, ApJ, 506, 898\nLizano, S. & Shu, F.H. 1987, in NATO/ASI Physical Processes in Interstellar Clouds, ed. M. Scholer\n(Dordrecht: Reidel), 173\nGordon, M.A. & Walmsley, C.M. 1990, ApJ, 365, 606\nMartı́n-Pintado, J., Bachiller, R., Thum, C., & Walmsley, C. M. 1989, A&A, 215, L13\nMcKee, C.F. & Zweibel, E. 1995, ApJ, 440, 686\nMestel, L. & Spitzer, L. Jr., 1956, MNRAS, 116, 50\n\n\f– 41 –\nMilalas, D. 1970, Stellar Atmospheres (San Francisco: W.H. Freeman)\nMohanty, S. & Shu, F. H. 2001, ApJ, in preparation\nMorrison, R. & McCammon, D. 1983, ApJ, 270, 119\nMoseley, J., Aberth, W., & Peterson, J.R. 1970, Phys. Rev. Lett.,24, 435\nMouschovias, T. Ch. 1978, in Protostars and Planets, ed. T. Gehrels, (Tucson: University of Arizona\nPress), 209\nMouschovias, T. Ch & Paleologou, E. V. 1981, ApJ, 246, 48\nNajita, J, & Shu, F.H. 1994, ApJ, 429, 808 (Paper III)\nNewman, J.H., Cogan, J.D., Ziegler, D.L., Nitz, D.E., Rundel. R.E., Smith, K.A., & Stebbings,\nR.F. 1982, Phys. Rev. A25, 2976\nOsterbrock 1961, ApJ, 134, 270\nOsterbrock 1989, Astrophysics of Gaseous Nebulae and Active Galactic Nuclei, (Mill Valley: University Science)\nOstriker, E. C., Gammie, C. F., & Stone, J. M. 1999, ApJ, 513\nOstriker, E. & Shu, F.H. 1995, ApJ, 447, 813 (Paper IV)\nPeart, B., Bennett, M.A., & Dolder, K. 1985, J. Phys. B18, L439\nPeres, G., Orlanda, S., Reale, F., Rosner, R., & Hudson, H. 2000, ApJ, 528, 537\nRaga, A. C., Cantò, J., Binette, L., and Calvet, N. 1990, ApJ, 364, 601\nRaga, A. C. and Kofman, L. 1992, ApJ, 386, 222\nRaga, A. C., Böhm, K.-H., Cantò, J. 1996, Rev. Mex. Astron. Astrofis. , 32, 161\nRodrı́guez, L. F. 1997, in Herbig-Haro Flows and the Birth of Low Mass Stars, IAU Symposium\nNo. 182, eds. B. Reipurth and C. Bertout (Dordrecht: Kluwer), 83\nRodrı́guez-Fernández, N.J., Martı́n-Pintado, J., Fuente, A., de Vincente, P., Wilson, T.L.,\nHüttmeister, S. 2001, A&A, 365, 174\nReynolds, S.P. 1986, ApJ, 304, 713\nRuden, S.P., Glassgold, A.E., & Shu, F.H. 1990, ApJ, 361, 546 (henceforth RGS)\nSafier, P. 1993, ApJ, 408, 115\nSeaton, M. J. 1964, MNRAS, 127, 177\n\n\f– 42 –\nScalo, J. M. 1977, ApJ, 2113, 705\nSchmitt, J. H. M. M., Collura, A., Sciortino, S., Vaiaba, G. S., Harnden, F. R., Jr, & Rosner, R.\n1990, ApJ, 365, 704\nSzucs, S., Karemera, M., Terao, M., and Brouillard, F. 1984, J. Phys. B17, 1613, 1984\nShang, H. 1998, Ph. D. thesis, University of California at Berkeley\nShang, H., Shu, F.H., & Glassgold, A.E. 1998, ApJ, 493, L91\nShu, F. H., Ruden, S. P., Lada, C. J., & Lizano, S. 1991, ApJ, 370, L31\nShu, F.H. 1991, The Physics of Astrophysics, Vol. I, Radiation, (Mill Valley: University Science\nBooks)\nShu, F.H. 1992, The Physics of Astrophysics, Vol. II, Gas Dynamics, (Mill Valley: University\nScience Books)\nShu, F.H., Najita, J., Ostriker, E. C., Wilkin, F., Ruden, S., & Lizano, S. 1994a, ApJ, 429, 781\n(Paper I)\nShu, F.H., Najita, J., Ruden, S., & Lizano, S. 1994b, ApJ, 429, 797 (Paper II)\nShu, F.H., Najita, J., Ostriker, E. C., & Shang, H. 1995, ApJ, 455, L55 (Paper V)\nShu, F.H., Shang, H., Glassgold, A. E., & Lee, T 1997, Science, 277, 1475\nShu, F.H., Najita, J.R., Shang, H., & Li, Z.-Y. 2000, in Protostars and Planets IV, eds. V. Mannings,\nA.P. Boss, and S. Russell, (Tucson: University of Arizona Press), 789\nShull, M. & Van Steenburg, M.E. 1983, ApJ, 298, 268\nSkinner, S. L. & Walter, F. M. 1998, ApJ, 509, 761\nSpitzer, L. Jr. & Scott, E. H. 1969, ApJ, 158, 161\nSpitzer, L., Jr. 1978, Physical Processes in the Interstellar Medium, (New York: Wiley-Interscience)\nStancil, P. C., Lepp, S., & Dalgarno, A. 1998, ApJ, 509, 1\nStanke, T., McCaughrean, M. J., & Zinnecker, H. 1998, A&A, 332, 307\nStelzer, B., Neuhäuser, R., & Hambaryan, V. 2000, A&A, 356, 949\nThum, C., Martı́n-Pintado, J., Quirrenbach, A., & Matthews, H.E., A&A, 333, L63\nTsuboi, Y. 1999, Ph.D. thesis, Kyoto Univ.\nVernazza, J.E., Avrett, E.H., & Loeser, R. 1981, ApJS, 45, 635\n\n\f– 43 –\nVerner, E.M., Verner, D.A., Korista, K.T., Ferguson, J.W., Hamann, F., & Ferland, G.J. 1999\nApJS, 120, 101\nVerner, E.M., Verner, D.A., Balwin, J.A., Ferland, G.J., amd Martin, P.G. 2000, ApJ, 543, 831\nVoronov, G.S. 1997, ADNDT, 65, 1\nWelch, W.J., Jr. & Marr, J. 1987, ApJ, 317, L21\nWishart, A. W. 1979, MNRAS, 187, 59\nWoitke, P. & Sedlmayr, E., 1999, A&A, 347, 617\nZinnecker, H., McCaughrean, M.J., & Rayner, J., 1998, Nature, 394, 862\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n\f– 44 –\n\nFig. 1.- Temperature (upper) and ionization (lower) contours in the for the ̟ − z plane for the\nfiducial case (defined in Table 2), but with α = 0 (no mechanical heating). The units for the spatial\nscales are AU. Note that the spatial scale proceeds from smaller to larger going from right to left.\n\n\f– 45 –\n\nFig. 2.- Temperature (upper) and ionization (lower) contours in the ̟ − z plane for the fiducial\n\ncase (defined in Table 2). The units for the spatial scales are AU.\n\n\f– 46 –\n\nFig. 3.- Temperature (upper) and ionization (lower) contours in the ̟ − z plane for the fiducial\n\ncase (defined in Table 2), but with α = 0.002. The units for the spatial scales are AU.\n\n\f– 47 –\n\nFig. 4.- Synthetic images of the S II λ6731 (left) and O I λ6300 (right) brightness for the same\nmodel as in Figure 3 adapting the methods in SSG. The log10 of the integrated intensity is plotted\nin units of erg s−1 cm−2 ster−1 .\n\n\f– 48 –\n\nFig. 5.- S II λ6716/S II λ6731 line ratio vs. the S II λ6731/O I λ 6300 based on the synthetic\nimages in Figure 4, where the jet is viewed perpendicular to its axis. The model parameters are\ngiven in Table 2 but with α = 0.002.\n\n\f"}