{"id": "http://arxiv.org/abs/astro-ph/0505289v1", "guidislink": true, "updated": "2005-05-13T15:23:53Z", "updated_parsed": [2005, 5, 13, 15, 23, 53, 4, 133, 0], "published": "2005-05-13T15:23:53Z", "published_parsed": [2005, 5, 13, 15, 23, 53, 4, 133, 0], "title": "Monte Carlo radiative transfer in SPH density fields", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0505603%2Castro-ph%2F0505170%2Castro-ph%2F0505188%2Castro-ph%2F0505212%2Castro-ph%2F0505357%2Castro-ph%2F0505457%2Castro-ph%2F0505377%2Castro-ph%2F0505425%2Castro-ph%2F0505112%2Castro-ph%2F0505348%2Castro-ph%2F0505617%2Castro-ph%2F0505498%2Castro-ph%2F0505621%2Castro-ph%2F0505021%2Castro-ph%2F0505350%2Castro-ph%2F0505376%2Castro-ph%2F0505416%2Castro-ph%2F0505119%2Castro-ph%2F0505475%2Castro-ph%2F0505551%2Castro-ph%2F0505560%2Castro-ph%2F0505001%2Castro-ph%2F0505146%2Castro-ph%2F0505295%2Castro-ph%2F0505013%2Castro-ph%2F0505284%2Castro-ph%2F0505344%2Castro-ph%2F0505122%2Castro-ph%2F0505071%2Castro-ph%2F0505042%2Castro-ph%2F0505145%2Castro-ph%2F0505594%2Castro-ph%2F0505107%2Castro-ph%2F0505482%2Castro-ph%2F0505007%2Castro-ph%2F0505386%2Castro-ph%2F0505104%2Castro-ph%2F0505238%2Castro-ph%2F0505363%2Castro-ph%2F0505581%2Castro-ph%2F0505286%2Castro-ph%2F0505389%2Castro-ph%2F0505440%2Castro-ph%2F0505014%2Castro-ph%2F0505404%2Castro-ph%2F0505584%2Castro-ph%2F0505387%2Castro-ph%2F0505249%2Castro-ph%2F0505039%2Castro-ph%2F0505135%2Castro-ph%2F0505618%2Castro-ph%2F0505528%2Castro-ph%2F0505471%2Castro-ph%2F0505151%2Castro-ph%2F0505194%2Castro-ph%2F0505052%2Castro-ph%2F0505612%2Castro-ph%2F0505568%2Castro-ph%2F0505542%2Castro-ph%2F0505446%2Castro-ph%2F0505277%2Castro-ph%2F0505038%2Castro-ph%2F0505399%2Castro-ph%2F0505575%2Castro-ph%2F0505036%2Castro-ph%2F0505078%2Castro-ph%2F0505214%2Castro-ph%2F0505283%2Castro-ph%2F0505629%2Castro-ph%2F0505253%2Castro-ph%2F0505554%2Castro-ph%2F0505167%2Castro-ph%2F0505545%2Castro-ph%2F0505620%2Castro-ph%2F0505318%2Castro-ph%2F0505550%2Castro-ph%2F0505580%2Castro-ph%2F0505431%2Castro-ph%2F0505186%2Castro-ph%2F0505585%2Castro-ph%2F0505355%2Castro-ph%2F0505072%2Castro-ph%2F0505601%2Castro-ph%2F0505247%2Castro-ph%2F0505207%2Castro-ph%2F0505557%2Castro-ph%2F0505033%2Castro-ph%2F0505199%2Castro-ph%2F0505005%2Castro-ph%2F0505531%2Castro-ph%2F0505179%2Castro-ph%2F0505129%2Castro-ph%2F0505535%2Castro-ph%2F0505289%2Castro-ph%2F0505353%2Castro-ph%2F0505316%2Castro-ph%2F0505187%2Castro-ph%2F0505278%2Castro-ph%2F0505219%2Castro-ph%2F0505208%2Castro-ph%2F0505147&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Monte Carlo radiative transfer in SPH density fields"}, "summary": "We combine a Monte Carlo radiative transfer code with an SPH code, so that --\nassuming thermal equilibrium -- we can calculate dust-temperature fields,\nspectral energy distributions, and isophotal maps, for the individual\ntime-frames generated by an SPH simulation. On large scales, the radiative\ntransfer cells (RT cells) are borrowed from the tree structure built by the SPH\ncode, and are chosen so that their size -- and hence the resolution of the\ncalculated temperature field -- is comparable with the resolution of the\ndensity field. We refer collectively to these cubic RT cells as the 'global\ngrid'. The code is tested and found to treat externally illuminated dust\nconfigurations very well. However, when there are embedded discrete sources,\ni.e. stars, these produce very steep local temperature gradients which can only\nbe modelled properly if -- in the immediate vicinity of, and centred on, each\nembedded star -- we supplement the global grid with a 'star grid' of closely\nspaced concentric RT cells.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0505603%2Castro-ph%2F0505170%2Castro-ph%2F0505188%2Castro-ph%2F0505212%2Castro-ph%2F0505357%2Castro-ph%2F0505457%2Castro-ph%2F0505377%2Castro-ph%2F0505425%2Castro-ph%2F0505112%2Castro-ph%2F0505348%2Castro-ph%2F0505617%2Castro-ph%2F0505498%2Castro-ph%2F0505621%2Castro-ph%2F0505021%2Castro-ph%2F0505350%2Castro-ph%2F0505376%2Castro-ph%2F0505416%2Castro-ph%2F0505119%2Castro-ph%2F0505475%2Castro-ph%2F0505551%2Castro-ph%2F0505560%2Castro-ph%2F0505001%2Castro-ph%2F0505146%2Castro-ph%2F0505295%2Castro-ph%2F0505013%2Castro-ph%2F0505284%2Castro-ph%2F0505344%2Castro-ph%2F0505122%2Castro-ph%2F0505071%2Castro-ph%2F0505042%2Castro-ph%2F0505145%2Castro-ph%2F0505594%2Castro-ph%2F0505107%2Castro-ph%2F0505482%2Castro-ph%2F0505007%2Castro-ph%2F0505386%2Castro-ph%2F0505104%2Castro-ph%2F0505238%2Castro-ph%2F0505363%2Castro-ph%2F0505581%2Castro-ph%2F0505286%2Castro-ph%2F0505389%2Castro-ph%2F0505440%2Castro-ph%2F0505014%2Castro-ph%2F0505404%2Castro-ph%2F0505584%2Castro-ph%2F0505387%2Castro-ph%2F0505249%2Castro-ph%2F0505039%2Castro-ph%2F0505135%2Castro-ph%2F0505618%2Castro-ph%2F0505528%2Castro-ph%2F0505471%2Castro-ph%2F0505151%2Castro-ph%2F0505194%2Castro-ph%2F0505052%2Castro-ph%2F0505612%2Castro-ph%2F0505568%2Castro-ph%2F0505542%2Castro-ph%2F0505446%2Castro-ph%2F0505277%2Castro-ph%2F0505038%2Castro-ph%2F0505399%2Castro-ph%2F0505575%2Castro-ph%2F0505036%2Castro-ph%2F0505078%2Castro-ph%2F0505214%2Castro-ph%2F0505283%2Castro-ph%2F0505629%2Castro-ph%2F0505253%2Castro-ph%2F0505554%2Castro-ph%2F0505167%2Castro-ph%2F0505545%2Castro-ph%2F0505620%2Castro-ph%2F0505318%2Castro-ph%2F0505550%2Castro-ph%2F0505580%2Castro-ph%2F0505431%2Castro-ph%2F0505186%2Castro-ph%2F0505585%2Castro-ph%2F0505355%2Castro-ph%2F0505072%2Castro-ph%2F0505601%2Castro-ph%2F0505247%2Castro-ph%2F0505207%2Castro-ph%2F0505557%2Castro-ph%2F0505033%2Castro-ph%2F0505199%2Castro-ph%2F0505005%2Castro-ph%2F0505531%2Castro-ph%2F0505179%2Castro-ph%2F0505129%2Castro-ph%2F0505535%2Castro-ph%2F0505289%2Castro-ph%2F0505353%2Castro-ph%2F0505316%2Castro-ph%2F0505187%2Castro-ph%2F0505278%2Castro-ph%2F0505219%2Castro-ph%2F0505208%2Castro-ph%2F0505147&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We combine a Monte Carlo radiative transfer code with an SPH code, so that --\nassuming thermal equilibrium -- we can calculate dust-temperature fields,\nspectral energy distributions, and isophotal maps, for the individual\ntime-frames generated by an SPH simulation. On large scales, the radiative\ntransfer cells (RT cells) are borrowed from the tree structure built by the SPH\ncode, and are chosen so that their size -- and hence the resolution of the\ncalculated temperature field -- is comparable with the resolution of the\ndensity field. We refer collectively to these cubic RT cells as the 'global\ngrid'. The code is tested and found to treat externally illuminated dust\nconfigurations very well. However, when there are embedded discrete sources,\ni.e. stars, these produce very steep local temperature gradients which can only\nbe modelled properly if -- in the immediate vicinity of, and centred on, each\nembedded star -- we supplement the global grid with a 'star grid' of closely\nspaced concentric RT cells."}, "authors": ["Dimitris Stamatellos", "Anthony Whitworth"], "author_detail": {"name": "Anthony Whitworth"}, "author": "Anthony Whitworth", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20052951", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0505289v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0505289v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted by A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0505289v1", "affiliation": "School of Physics & Astronomy, Cardiff University", "arxiv_url": "http://arxiv.org/abs/astro-ph/0505289v1", "journal_reference": null, "doi": "10.1051/0004-6361:20052951", "fulltext": "Astronomy & Astrophysics manuscript no. 2951\n(DOI: will be inserted by hand later)\n\nMarch 30, 2019\n\narXiv:astro-ph/0505289v1 13 May 2005\n\nMonte Carlo radiative transfer in SPH density fields\nDimitris Stamatellos & Anthony P. Whitworth\nSchool of Physics & Astronomy, Cardiff University, 5 The Parade, Cardiff CF24 3YB, Wales, UK\nReceived ..., 2005; accepted ... , 2005\nAbstract. We combine a Monte Carlo radiative transfer code with an SPH code, so that – assuming thermal equilibrium – we\ncan calculate dust-temperature fields, spectral energy distributions, and isophotal maps, for the individual time-frames generated\nby an SPH simulation. On large scales, the radiative transfer cells (RT cells) are borrowed from the tree structure built by the\nSPH code, and are chosen so that their size – and hence the resolution of the calculated temperature field – is comparable with\nthe resolution of the density field. We refer collectively to these cubic RT cells as the global grid. The code is tested and found\nto treat externally illuminated dust configurations very well. However, when there are embedded discrete sources, i.e. stars,\nthese produce very steep local temperature gradients which can only be modelled properly if – in the immediate vicinity of, and\ncentred on, each embedded star – we supplement the global grid with a star grid of closely spaced concentric RT cells.\nKey words. ISM: clouds-structure-dust – Methods: numerical – Radiative transfer – Hydrodynamics\n\n1. Introduction\nSmoothed Particle Hydrodynamics (SPH) (Lucy 1977;\nGingold & Monaghan 1977) is a Lagrangian computational\nmethod which invokes a large array of particles to describe a\nfluid, assigns properties such as mass, position and velocity to\neach particle, and estimates intensive thermodynamic variables\nlike density and pressure (and their derivatives) using local averages (for reviews see Benz 1990, 1991; Monaghan 1992).\nThe main advantage of this method is that, in principle, there\nare no limitations on the geometry of the system or how far it\ncan evolve from the initial conditions.\nBecause of the large computational cost incurred when radiative transfer is modelled fully in three dimensions, many\nprevious treatments have been limited to one or two dimensions\n(e.g. Efstathiou & Rowan-Robinson 1990, 1991; Men'shchikov\n& Henning 1997, Zucconi et al. 2001), and radiative transfer\nhas only recently been included in SPH simulations, where a\nfully three-dimensional treatment is essential (Kessel-Deynet\n& Burkert 2000, Oxley & Woolfson 2003, Whitehouse & Bate\n2004, Viau et al. 2005). The Monte Carlo approach for equilibrium radiative transfer (Lefevre et al. 1982, 1983; Wolf et al.\n1999) is well suited to systems with arbitrary geometries, but,\nas with any Monte Carlo method, it is computationally expensive, especially when iteration is required. Recently, Bjorkman\n& Wood (2001), extended an idea by Lucy (1999) and proposed a method to avoid iteration, by remitting photons as soon\nas they are absorbed, with a frequency distribution adjustment\ntechnique. This method avoids iteration, and it is fast when\ncompared with the traditional Monte Carlo radiative transfer\nSend offprint requests to: D. Stamatellos\ne-mail: D.Stamatellos@astro.cf.ac.uk\n\nmethods. It has been applied successfully to a variety of problems, such as protoplanetary discs (e.g. Wood et al. 2002),\nprestellar cores (e.g. Stamatellos et al. 2004) and Class I objects (e.g. Whitney et al. 2003).\nIn this paper, we develop and test a method which uses\nMonte Carlo radiative transfer with frequency distribution adjustment, to calculate the dust-temperature field, the spectral\nenergy distribution (SED), and isophotal maps, for individual\ntime-frames from SPH simulations. We use the SPH tree to\nconstruct a grid of cubic radiative transfer cells (hereafter RT\ncells) with which the photons interact; we refer to this grid as\nthe global grid. The global grid obtained in this way is similar to the tree-structured adaptive grid invoked by Kurosawa &\nHillier (2001), but because it borrows the tree structure already\nderived as part of the SPH code, it minimizes the computational burden that will be added to the hydrodynamic simulations when the two methods are combined. A similar method\nhas been used by Oxley & Woolfson (2003), but they adopt\nan average, wavelength-independent opacity. To account for\nthe large temperature gradients that are expected very close to\nstars, we supplement the global grid described above with a\ngrid of concentric spherical radiative transfer cells around each\nstar; we refer to this supplementary grid as the star grid.\n\n2. Monte Carlo radiative transfer with frequency\ndistribution adjustment\nThe Monte Carlo radiative transfer method (e.g. Stamatellos &\nWhitworth 2003) uses a large number of monochromatic luminosity packets (L-packets) to represent the radiation injected\ninto the medium (e.g. stellar radiation, cooling radiation, background radiation). Each L-packet is given a random frequency,\n\n\f2\n\nDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields\n\nν, and a random optical depth, τ, which determines its free\npath, i.e. how far it travels before interacting with the medium.\nThe medium itself is divided into a number of RT cells, each\nwith uniform density and temperature. Each time an L-packet is\nscattered, it is given a new random direction, using the Henyey\n& Greenstein (1941) scattering phase function, and a new random optical depth, τ. Each time an L-packet is absorbed, it\nraises the temperature of the RT cell in which it is absorbed\nfrom T to T + ∆T , and the packet is immediately reemitted\nisotropically, so that the dust is in radiative equilibrium. The\ntemperature of the RT cell is computed by equating the total\nabsorbed luminosity to the total emitted luminosity. The frequency of the reemitted L-packet is chosen using a probability\ndistribution function (PDF) constructed from the difference between the emissivity of the cell before and after absorption of\nthe L-packet (Bjorkman & Wood 2001; Baes et al. 2005),\nκν [Bν(T + ∆T ) − Bν (T )] dν\np(ν) dν = R ∞\nκν [Bν(T + ∆T ) − Bν (T )] dν\n0\nκν B′ (T ) dν\n.\n≃ R∞\n′ (T ) dν\nκ\nB\nν\n0\n\n(1)\n\nwhere B′ (T ) ≡ dBν/dT . At the same time the L-packet is given\na new random optical depth, τ. Using the PDF of Eqn. (1), the\ncorrect temperature distribution and spectrum of the system are\nobtained without iteration, once all the L-packets have been\npropagated through the medium and escaped. The method accounts for both absorption and scattering, it is robust, it is very\naccurate (see tests by Bjorkman & Wood 2001, Stamatellos &\nWhitworth 2003), it can readily be parallized, and it can treat\nsystems with arbitrary geometries.\n\nbouring particles so that smoothed values of thermodynamic\nvariables and their derivatives can be evaluated.\nThe global grid then comprises the smallest set of RT cells\nwhich (a) spans the entire computational domain (or at least\nthat part of it containing matter) and (b) contains fewer than\nNMAX SPH particles. If NMAX is chosen to be of the same order\nas NNEIB (the number of neighbour particles used for smoothing\npurposes), then the RT cells are necessarily similar in size to\nthe resolution of the SPH simulation. Specifically we choose\nNMAX /NNEIB ∼ 2 to 3, so that each RT cell has linear size ∼ 2 h\n(where h is the SPH smoothing length) and contains ∼ 0.3 NNEIB\nparticles.\nThis method of constructing RT cells is similar to the\nmethod of Kurosawa & Hiller (2001) (see also Kurosawa et al.\n2004), but it is implemented using the Barnes & Hut (1986) tree\nstructure. Both methods produce RT cells with approximately\nequal mass. It is also similar to the method used by Oxley &\nWoolfson (2003), but they construct RT cells with size 1/3 to\n2/3 of the SPH smoothing length. Our method has the advantage that we can readily compute the density in an RT cell from\nthe number of particles in the cell and the cell size, whereas\nin the Oxley & Woolfson method the density must be computed by an SPH sum over the neighbouring particles, and this\nis computationally expensive.\nThe method we use to construct RT cells, is implemented\nrelatively easily within SPH and exploits information about the\ntree already calculated for SPH purposes. Thus, it does not add\nmuch to the code running time. It also furnishes us with an\nefficient procedure for finding which RT cell an L-packet is\nin. This is critical for the efficiency of the code, because as\nan L-packet propagates through the computational domain, this\nsearch procedure is performed many times.\n\n2.1. Construction of radiative transfer cells\nThe radiative transfer cells must be constructed so that\ntheir linear size is less than, or on the order of, the local directional temperature- and density- scale-heights (e.g.\n−1\n−1\n∆x <\n∼ MIN{ | dln[ρ]/dx | , | dln[T ]/dx | }, see Stamatellos\n& Whitworth 2003). This ensures that the temperature and density do not vary too greatly between adjacent RT cells. The construction of the RT cells depends on the specific system under\nstudy, and, in an hydrodynamic simulation, where the system\nchanges from step to step, the RT cells need to be reconstructed\nat every step. Therefore, a robust and efficient algorithm for the\nconstruction of RT cells is required.\nTo construct RT cells we take advantage of the fact that\nour SPH code calculates gravitational forces with the aid of a\nspatial tessellation tree (Barnes & Hut 1986; Hernquist & Katz\n1989). The whole computational domain is contained within a\ncubic cell, the root cell, which is then divided into eight smaller\ncubic cells of equal size. If any of these cells contains more than\none particle, it is subdivided into eight even smaller cells. This\nprocedure continues recursively until the smallest cells each\ncontain just one particle or no particles at all. The resulting\nensemble of cells constitutes the SPH tree. In SPH, the tree is\nused so that distant particles do not contribute individually to\nthe local gravitational field, but collectively through the cell in\nwhich they are contained; the tree is also used to find neigh-\n\n2.2. L-packet propagation and interaction\nThe propagation of L-packets through the computational domain is performed in small steps, δS , which gradually decrease\nthe optical depth τ of the L-packet until τ = 0, whereupon the\nL-packet reaches an interaction point. This is the most computationally expensive part of the code, particularly as there is no\nanalytical expression for the density – and hence the opacity\n– along the path of an L-packet. Instead, the density is determined by identifying the RT cell through which the L-packet is\npassing. After each step δS , we use the SPH tree to find which\nRT cell i the L-packet is now in. The search starts from the root\ncell and proceeds to lower level cells, until the required RT cell\nis reached. The search contributes a significant fraction of the\ncode running time, and therefore, it is essential to choose the\nstep δS appropriately. We use\nn\no\n(2)\nδS = MIN η1 S i , η2 l̄i , τ l̄i , η3 |r| ,\nwhere η1 , η2 , η3 are constants in the range (0.1, 1) and determine the accuracy; S i is the linear extent of RT cell i; l̄i = κλ ρi\nis the mean-free-path for the L-packet (κλ is the monchromatic\nmass-opacity at the wavelength of the L-packet, and ρi is the\ndensity in cell i); r is the position of the photon relative to any\ndiscrete source (i.e. star).\n\n\fDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields\n\n3\n\nKurosawa & Hiller (2001) adopt a more detailed approach,\nin which they use the path of an L-packet to determine where\nit intercepts the boundaries of the RT cells through which it\npasses. Our method is simpler to implement, it propagates the\nL-packets efficiently (usually the propagation step is on the order of the local RT cell size), and it is accurate (due to the fact\nthat neighbouring RT cells have similar densities).\n\n3. Tests\nWe consider a spherical cloud with uniform density n = 8.6 ×\n104 cm−3 , mass M = 100 M⊙ and radius R = 3.5 × 104 AU,\nand represent it with randomly distributed SPH particles. We\nthen test the method of constructing the global grid and propagating L-packets through the grid in three ways. (i) We use the\nthermodynamic equilibrium test, where the cloud is bathed in\nan isotropic blackbody radiation field with a given temperature\n(Stamatellos & Whitworth 2003).(ii) We illuminate the cloud\nwith the Black (1994) interstellar radiation field (BISRF) and\ncompare our results with the results obtained previously using\na spherically symmetric grid of concentric cells (Stamatellos &\nWhitworth 2003). (iii) We embed a low-temperature star at the\ncentre of the cloud and again compare the results with those\nobtained previously using a spherically symmetric grid of concentric cells (see online appendix). We present the results in the\nfollowing subsections.\n\n3.1. Cloud bathed in a blackbody radiation field\nWe use NTOTAL = 20, 000 SPH particles and set the maximum number of particles in an RT cell to NMAX = 60, giving\nNCELLS = 1, 484 RT cells, each containing on average N̄ ∼ 15\nSPH particles. The density in each RT cell is plotted as a function of radius in Fig. 1a. Because the SPH particles are distributed randomly, there are statistical variations in the density\nat the ± N̄ −1/2 ≃ ± 25% level. There are also a number of RT\ncells that appear to be outside the boundary of the cloud and\nto have very low density. In reality, only a small part of each\nof these RT cells is within the cloud and therefore they contain\nonly a very small number of particles. These irregular RT cells\nare a side effect of representing a spherical cloud with a grid of\ncubic cells. The same problem was also encountered by Oxley\n& Woolfson (2001).\n108 L-packets are then injected from random positions on\nthe boundary of the cloud, and with random frequencies and injection angles, so as to imitate an isotropic blackbody radiation\nfield at 15 K (see Stamatellos et al. 2004). The cloud should\nthen adopt the temperature of the illuminating radiation field,\ni.e. 15 K. The computed temperature of each RT cell is plotted on Fig. 1b. In the body of the cloud the temperature is very\nclose to 15 K, with the error being less than ± 3%. The errors\nare higher near and outside the boundary of the cloud, because\nof the presence of the irregular RT cells. These errors can be\nreduced by increasing the number of SPH particles, and/or the\nnumber of RT cells, and/or the number of L-packets.\n\nFig. 1. A uniform-density spherical cloud, represented by\n20,000 SPH particles, is illuminated by an isotropic blackbody\nradiation field at T = 15 K, using 108 L-packets. RT cells\nare constructed with NMAX = 60, giving NCELLS = 1, 484. (a)\nTriangles give the densities of the individual RT cells, the horizontal dotted line marks the mean density, and the vertical line\nmarks the boundary of the cloud. (b) Triangles give the temperatures of the individual RT cells, the horizontal dotted line\nmarks T = 15 K, and the vertical line marks the boundary of the\ncloud. (c) The percentage error in the computed temperature.\n\n3.2. Cloud embedded in the ISRF\nWe use NTOTAL = 200, 000 SPH particles and set the maximum number of particles in an RT cell to NMAX = 100, giving\nNCELLS = 11, 862 RT cells, each containing on average N̄ ∼ 18\nSPH particles. 108 L-packets are then injected from random\npositions on the boundary of the cloud, and with random frequencies and injection angles, so as to imitate the isotropic\nBlack (1994) interstellar radiation field (BISRF). The advantage of this test is that the BISRF covers a wide wavelength\nrange, including regions where scattering dominates (UV and\noptical) and regions where absorption/emission dominates (IR\nand submm). Therefore, we can test the validity of the method\nover a wide range of wavelengths. Fig. 2 compares the resulting temperature profile and SED with accurate results obtained\nusing a spherically symmetric grid of thin concentric RT cells.\nThe agreement is very good, apart from the irregular RT cells\nat the boundary.\n\n4. Stars in SPH-RT simulations\nThe presence of a normal- or high-temperature star in an SPH\nsimulation makes the treatment of radiation transport more\ncomplicated, firstly because in the immediate vicinity of the\nstar the dust is destroyed by sublimation and/or chemical sputtering (e.g. Lenzuni et al. 1995), and secondly because just\noutside this region there are very large temperature gradients\nwhich cannot be captured by the global grid.\n\n4.1. Dust destruction radius\nThe dust destruction temperature is estimated to be between\nT DEST ∼ 800 K and T DEST ∼ 2100 K (Lenzuni et al. 1995; Duschl\net al. 1996) and depends on the assumed dust composition. The\n\n\f4\n\nDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields\n~h\nSPH cells\n\n(a)\ngap around\nthe star\n\nstar grid\n\nstar\n\n* Rdest\n\nheating rate for an isolated dust grain at distance R from a star\nhaving radius R⋆ and surface temperature T ⋆ is\nZ ∞\n\u0012 R \u00132\n⋆\n2\nG = πrd\nQν\nπBν(T ⋆ ) dν ,\n(3)\nR\n0\nwhere rd is the radius of the grain, and Qν is the absorption\nefficiency. Similarly the dust cooling rate is\nZ ∞\n2\nL = 4πrd\nQν πBν(T ) dν ,\n(4)\n0\n\nwhere T is the dust temperature. Assuming that the dust is in\nthermal equilibrium, i.e. G = L, and putting Qν ∝ νβ (1 ∼< β ∼<\n2), we obtain\n\u0012 R \u00132/(4+β)\n⋆\nT⋆ .\n(5)\nT=\n2R\nAt the dust destruction radius, T = T DEST , and hence R = RDEST ,\nwhere\n!(4+β)/2\nR⋆ T ⋆\nRDEST =\n.\n(6)\n2 T DEST\nIn the optically thin limit, this radius defines the spherical volume around the star which should be devoid of dust. If the envelope of dust around the star is optically thick to its own cooling radiation, it will act to trap the radiation from the star and\nRDEST will be somewhat larger. The values of RDEST stipulated by\nIvezić et al. (1997; see below) take this into account.\n\n4.2. Steep temperature gradients in the vicinity of a\nstar\nThe density and temperature gradients close to a star are large,\nand can only be resolved with RT cells whose radial extent is\ncomparable with, or smaller than, the dust destruction radius\nRDEST . Unless an impractically large number of SPH particles\nhas been used in the simulation, the cubic RT cells of the global\ngrid (with size ∼ h, where h is the smoothing length of the SPH\n\nR sg\n\n(b)\n\nTdest\n\nTemperature\n\nFig. 2. A uniform-density spherical cloud, represented by\n200,000 SPH particles, is illuminated by the BISRF radiation field, using 108 L-packets. RT cells are constructed with\nNMAX = 100 giving NCELLS = 11, 862. (a) Triangles give the\ntemperatures of the individual RT cells and the solid line gives\nthe accurate temperature profile. (b) The computed SED (solid\nline) is compared with the accurate SED (dashed line) and the\nilluminating BISRF (dotted line).\n\ntemperature\nusing the star grid\n\n−R sg\ntemperature not\nusing the star grid\n\n−Rdest\n\n0\n\nRdest\n\nR sg\n\nDistance from the star\n\nFig. 3. (a) The square cells represent the global grid derived\nfrom the SPH tree, and the concentric circles represent the additional star grid. (b) The dashed horizontal lines show the temperature computed (inaccurately) using the global grid on its\nown, whilst the solid curve shows the (accurate) temperature\nprofile computed using the additional star grid.\n\nkernel) are much larger than RDEST , as illustrated schematically\nin Fig. 3. Thus the steep temperature gradients in the vicinity\nof the star occupy only a few RT cells of the global grid, and\nthey are not properly resolved. Consequently the temperatures\nvery close to the star are underestimated. (Further out the temperature may be overestimated or underestimated, but this is\nless critical.) The upshot is that L-packets which are absorbed\nvery close to the star are then re-emitted from a wavelength distribution corresponding to an inappropriately low temperature,\nand hence at inappropriately long wavelengths. This means that\nthey are able to propagate further away from the star, or even\nto escape from the system altogether. Consequently the SED\nhas a deficit of radiation at the short (mainly NIR) wavelengths\nemitted by hot dust, and a corresponding excess of radiation at\nlong (mainly FIR) wavelengths. This problem also arises in the\nsimulations of Kurosawa et al. (2004).\nTo resolve this problem, we construct an extra grid of concentric shells (a star grid) around each star (see Fig. 3). To construct a star grid, we must specify:\n\n\fDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields\n\n– The dust destruction radius, RDEST , which is determined by\nthe temperature T ⋆ and the radius R⋆ of the star. For simplicity we put\n!3\nM⋆\nGM⋆ Ṁ⋆\n2\n4\n,\n(7)\nL⋆ = 4πR⋆ σT ⋆ = L⊙\n+\nM⊙\nR⋆\nwhere M⋆ is the mass of the star and Ṁ⋆ is the accretion\nrate onto the star. The first term in Eq. (7) is the intrinsic\nluminosity of the star, and the second term is the accretion\nluminosity. For a Pre-Main Sequence star we can put R⋆ ≃\n3R⊙ (Stahler 1988).\n– The outer radius RSG , of the star grid, which should be on\nthe order of the local SPH resolution, or, equivalently, on\nthe order of the size of the local cubic RT cells of the global\ngrid.\n– The density profile between RDEST and RSG , for which we\nadopt\n!p\nR\n(8)\nρ = ρ0 DEST , RDEST < R < RSG ,\nR\nwith ρ0 fixed by conservation of mass, and p = 0 to 2 .\nOnce all the above parameters have been specified, the star\ngrid around each star is constructed by dividing up the space\nbetween RDEST and RSG into concentric RT cells of equal logarithmic width; typically ∼ 30 RT cells are sufficient for each\nstar grid. The complication that this introduces into an RT calculation is minimal. There is some overlap between the two sets\nof RT cells (the cubic cells of the global grid and the spherical\ncells of the star grid), but this does not create any major problems, as our tests in the next section demonstrate. L-packets\nwhich are inside the star grid interact with the RT cells of that\ngrid, rather than the RT cells of the global grid.\nHowever, we note that a spherically symmetric star grid\nmay not be appropriate when the dust close to a star is concentrated in a disc. This situation can be handled with a simple\nextension to the method we have presented here, and it will be\ndiscussed in the companion paper (Stamatellos et al. 2005).\n\n5. Ivezić test\nWe test the above method for including stars in radiative transfer calculations within SPH, using the configuration proposed\nby Ivezić et al. (1997), viz. a star with T ⋆ = 2500 K surrounded\nby a spherical envelope with an R−2 density profile. We perform\nthe test for envelopes having visual radial optical depths (from\nthe centre to the edge of the envelope) τV = 1 and τV = 100\n(see online appendix). For τV = 1, we set RDEST = 9.11R⋆ ;\nand for τV = 100, RDEST = 17.67R⋆, as stipulated by Ivezić et\nal. (1997). For both cases we set RSG = 20RDEST and ROUTER =\n1000RDEST (where ROUTER is the outer radius of the envelope).\nNote that we do not need to specify R⋆ .\nWe represent the envelope using 20,000 SPH particles, distributed randomly so that they approximate to an R−2 profile.\n(The approximation could be improved by settling the distribution to get rid of Poisson fluctuations, but we have not done\nthis.) We use the SPH tree to construct a global grid with\n\n5\n\nNMAX = 55 (which gives NCELLS = 1276 and N̄ = 15). In addition, we have the option to introduce a star grid comprising\n30 concentric RT cells, between RDEST and RSG .\nThe results are compared with the very accurate results\nobtained using a one-dimensional spherically symmetric code\nin Stamatellos & Whitworth (2003), hereafter 'the benchmark\ncalculation'.\nWe have performed the Ivezić test with τV = 1 and p = −2,\nusing 5×107 L-packets, both without (Fig. 4), and with (Fig. 5),\na star grid around the central star.\nWithout a star grid around the central star (Fig. 4) the cubic\nRT cells of the global grid in the vicinity of the star have size\n∼ 20RDEST , and therefore they are unable to capture the large\ntemperatures and densities there. This has two effects. First,\nthe hottest dust is only at ∼ 300 K (rather than ∼ 800 K in\nthe benchmark calculation), and consequently the SED shows\na deficit of radiation at wavelengths around 8 μm. Second, the\nuniform density in the individual RT cells reduces the net radial\noptical depth, allowing more radiation to escape directly from\nEFFECTIVE\nthe central star (specifically τV\n∼ 0.3); this shows up in\nthe SED as an excess of radiation at wavelengths around 1 μm.\nWith a star grid around the central star (Fig. 5), the innermost RT cell (immediately outside RDEST ) has radial extent\n∼ 0.1RDEST , and the high temperatures and densities near the star\nare properly represented. Agreement with the benchmark calculation is then very good. Small differences are due to statistical noise in RT cells which do not intercept many L-packets.\n\n6. Discussion\nIn this paper we have presented a method for performing radiative transfer calculations on individual time-frames from SPH\nsimulations. We use the SPH tree to construct a global grid of\nradiative transfer (RT) cells. This grid is constructed so that\neach RT cell contains a number of SPH particles close to the\nnumber of neighbours that each particle must have in SPH for\nsmoothing purposes. The method thereby creates RT cells with\nsize on the order of the local SPH smoothing length.\nWe test the method using the thermodynamic equilibrium\ntest for a uniform-density spherical cloud, bathed in a blackbody radiation field. The method performs this test well. The\nglobal grid of RT cells that represent the cloud acquire the same\ntemperature as the blackbody radiation field. The temperature\nis slightly underestimated near the boundary of the cloud due\nto the presence of RT cells that contain only a few SPH particles (irregular RT cells). The method also performs well for a\nuniform-density cloud illuminated by the interstellar radiation\nfield.\nWe then examine a system comprising a low-temperature\nstar embedded at the centre of a uniform-density spherical\ncloud. The temperature field and the SED are calculated with\ngood accuracy. Very close to the star the temperature is slightly\nunderestimated due to the fact that the temperature field there\nis not properly resolved. This in turn distorts the SED of the\nsystem slightly at short wavelengths. The problem is more pronounced when a normal- or high-temperature star is embedded\nin the cloud. The region very close to the star is then characterised by a very steep temperature gradient which cannot\n\n\f6\n\nDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields\nAcknowledgements. We gratefully acknowledge support from\nthe EC Research Training Network \"The Formation and\nEvolution of Young Stellar Clusters\" (HPRN-CT-2000-00155)\nand from PPARC (PPA/G/O/2002/00497). We would also like\nto thank J. Barnes for using his tree code (available online at\nhttp://www.ifa.hawaii.edu/∼barnes/software.html).\n\nReferences\n\nFig. 4. Ivezić test with τV = 1, using 5 × 107 L-packets. The\nenvelope is represented by 20,000 SPH particles and a global\ngrid of NCELLS = 1, 276 RT cells (with N̄ = 15), but no additional star grid around the star. (a) The triangles represent the\ntemperatures of the individual RT cells plotted against radius,\nwhilst the solid line represents the benchmark calculation. The\nglobal grid on its own fails to capture the temperature profile\nclose to the star. (b) The solid line shows the SED computed\nhere, and the dotted line shows the benchmark calculation. (c)\nThe percentage difference between the flux computed here and\nthe benchmark calculation.\n\nFig. 5. Same as Fig. 4 but with an additional star grid around\nthe star, i.e. a volume devoid of matter inside RDEST and 30 concentric spherical RT cells between RDEST and RSG = 20RDEST .\nAgreement with the benchmark calculation is now very good.\nSmall differences are due to statistical noise.\nnormally be captured by the cubic RT cells of the global grid,\nbecause these RT cells are too large.\nTo solve this problem we introduce an additional grid of\nconcentric spherical RT cells around the star (the star grid).\nThe star grid accounts for the dust-free region near the star, and\nits concentric spherical RT cells are small enough to capture\nsteep temperature gradients, so that temperatures are calculated\ncorrectly close to the star. We test the use of a global grid in\ntandem with a star grid around the star, using the configuration\nproposed by Ivezić et al. (1997), and show that it performs very\nwell, even if the optical depth is very large.\nOur radiative transfer code can therefore be applied to arbitrary SPH density fields to produce dust temperature distributions, SEDs and isophotal maps at different wavelengths. These\ncan then be used to compare the results of hydrodynamic simulations with observations. In the companion paper (Stamatellos\net al. 2005) we apply this method to the collapse of turbulent\nmolecular cores and the early stages of star formation.\n\nBaes, M., Stamatellos, D., Davies, J., Whitworth, A. P, et al. 2005,\nNew Ain press, (astro-ph/0504037)\nBarnes, J. & Hut, P. 1986, Nature, 324, 446\nBenz, W. 1990, Numerical Modelling of Nonlinear Stellar Pulsations\nProblems and Prospects, 269\nBenz, W. 1991, LNP Vol. 373: Late Stages of Stellar\nEvolution.\nComputational Methods in Astrophysical\nHydrodynamics, 259\nBlack, J. H. 1994, ASP Conf. Ser. 58: The First Symposium on the\nInfrared Cirrus and Diffuse Interstellar Clouds, 355\nBjorkman, J. E. & Wood, K. 2001, ApJ, 554, 615\nDuschl, W. J., Gail, H.-P., & Tscharnuter, W. M. 1996, A&A, 312, 624\nEfstathiou A. & Rowan-Robinson M., 1990, MNRAS, 245, 275\nEfstathiou A. & Rowan-Robinson M., 1991, MNRAS, 252, 528\nGingold, R. A.& Monaghan, J. J., 1977, MNRAS, 181, 375\nHenyey, L. C. & Greenstein, J. L. 1941, ApJ, 93, 70\nHernquist, L. & Katz, N., 1989, ApJS, 70, 419\nIvezić, Ž., Groenewegen, M. A. T., Men'shchikov, A., & Szczerba, R.\n1997, MNRAS, 291, 121\nKessel-Deynet, O. & Burkert, A. 2000, MNRAS, 315, 713\nKurosawa, R. & Hillier, D. J. 2001, A&A, 379, 336\nKurosawa, R., Harries, T. J., Bate, M. R., & Symington, N. H. 2004,\nMNRAS, 351, 1134\nLefevre J., Bergeat J. & Daniel J. Y. 1982, A&A, 114, 341\nLefevre J., Daniel J. Y. & Bergeat J. 1983 A&A, 121, 51\nLenzuni, P., Gail, H., & Henning, T. 1995, ApJ, 447, 848\nLucy, L. B. 1977, AJ, 82, 1013\nLucy L. B. 1999, A&A, 344, 282\nMen'shchikov A. B. & Henning Th. 1997, A&A, 318, 879\nMonaghan, J. J. 1992, ARA&A, 30, 543\nOxley, S. & Woolfson, M. M. 2003, MNRAS, 343, 900\nStahler, S. W. 1988, ApJ, 332, 804\nStamatellos, D. & Whitworth, A. P., Boyd, D.F.A, & Goodwin,S. P.\n2005, A&Ain press\nStamatellos, D. & Whitworth, A. P. 2003, A&A, 407, 941\nStamatellos, D., Whitworth, A. P., André, P., & Ward-Thompson, D.\n2004, A&A, 420, 1009\nViau, S., Bastien, P., & Cha, S-H 2004, in preparation\nWhitehouse, S. C. & Bate, M. R. 2004, MNRAS, 353, 1078\nWhitney, B. A., Wood, K., Bjorkman, J. E., & Wolff, M. J. 2003, ApJ,\n591, 1049\nWolf, S., Henning, T., & Stecklum, B. 1999, A&A, 349, 839\nWood, K., Lada, C. J., Bjorkman, J. E., Kenyon, S. J., Whitney, B., &\nWolff, M. J. 2002, ApJ, 567, 1183\nZucconi, A., Walmsley, C. M., & Galli, D. 2001, A&A, 376, 650\n\n\fDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields, Online Material p 1\n\nOnline Material\n\n\fDimitris Stamatellos & Anthony P. Whitworth: Radiative transfer in SPH density fields, Online Material p 2\n\nAppendix A: Supplementary tests\n\nA.1. Low-temperature star surrounded by a spherical\nenvelope\nWe use NTOTAL = 200, 000 SPH particles and set the maximum number of particles in an RT cell to NMAX = 60, giving\nNCELLS = 13, 050 cells, each containing on average N̄ ∼ 16\nSPH particles. 108 L-packets are emitted by a central lowtemperature 'star' having luminosity L∗ = 7L⊙ and surface\ntemperature T ⋆ = 30 K. Fig. A.1 compares the resulting temperature profile and SED with accurate results obtained using\na spherically symmetric grid of thin concentric RT cells. The\nglobal grid used here has difficulty capturing the steep temperature gradient near the star. As a result the temperatures\nnear the star are underestimated and the SED shows a deficit\nat short wavelengths. The temperature is also not very accurate\nnear the boundary, due to the irregular RT cells there; and there\nare some small uncertainties in the SED at wavelengths longer\nthan 2000 μm, due to the small number of L-packets generated\nat these wavelengths. Otherwise the agreement is good.\n\nsmall shoulder at ∼ 3 μm, due to radiation which escapes directly from the central star.\nWith a star grid around the central star (Fig. A.3) agreement\nwith the benchmark calculation is very good. Small differences\nare again due to statistical noise. We emphasize that these calculations were performed with only 107 L-packets.\n\nFig. A.2. Ivezić test with τV = 100, using 107 L-packets. The\nenvelope is represented by 20,000 SPH particles and a global\ngrid of NCELLS = 1, 310 RT cells (with N̄ = 15), but no additional star grid around the star. (a) The triangles represent the\ntemperatures of the individual RT cells plotted against radius,\nwhilst the solid line represents the benchmark calculation. The\nglobal grid on its own fails to capture the temperature profile\nclose to the star. (b) The solid line shows the SED computed\nhere, and the dotted line shows the benchmark calculation. (c)\nThe percentage difference between the flux computed here and\nthe benchmark calculation.\n\nFig. A.1. A uniform-density spherical cloud, represented by\n200,000 SPH particles, is heated by a central low-temperature\nstar with L∗ = 7L⊙ and T ∗ = 30 K, which emits 108 Lpackets. RT cells are constructed with NMAX = 60, giving\nNCELLS = 13, 050. (a) Triangles give the temperatures of the\nindividual RT cells and the solid line gives the accurate temperature profile. (b) The computed SED (solid line) is compared\nwith the accurate SED (dashed line). (c) The precentage error\nin the SED.\n\nA.2. Ivezić test with τV = 100 and p = −2\nWe have performed the Ivezić test with τV = 100 and p =\n− 2, using 107 L-packets, both without (Fig. A.2), and with\n(Fig. A.3), a star grid around the central star.\nWithout a star grid around the central star (Fig. A.2), the cubic RT cells of the global grid in the vicinity of the star are again\nunable to capture the large temperatures and densities there.\nConsequently the hottest dust is only at ∼ 200 K (rather than\n∼ 800 K in the benchmark calculation). The SED is dominated\nby the emission from this dust, which peaks around 20 μm. In\naddition, the uniform densities in the RT cells reduces the efEFFECTIVE\nfective radial optical depth (τV\n∼ 20) and so there is a\n\nFig. A.3. Same as Fig. A.2 but with an additional star grid\naround the star, i.e. a volume devoid of matter inside RDEST\nand 30 concentric spherical RT cells between RDEST and RSG =\n20RDEST . Agreement with the benchmark calculation is now\nvery good. Small differences are due to statistical noise.\n\n\f"}