{"id": "http://arxiv.org/abs/astro-ph/0409075v1", "guidislink": true, "updated": "2004-09-03T13:08:37Z", "updated_parsed": [2004, 9, 3, 13, 8, 37, 4, 247, 0], "published": "2004-09-03T13:08:37Z", "published_parsed": [2004, 9, 3, 13, 8, 37, 4, 247, 0], "title": "The impact of thermal gas in AGN jets on the low-frequency emission", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0409055%2Castro-ph%2F0409513%2Castro-ph%2F0409016%2Castro-ph%2F0409355%2Castro-ph%2F0409574%2Castro-ph%2F0409640%2Castro-ph%2F0409301%2Castro-ph%2F0409739%2Castro-ph%2F0409179%2Castro-ph%2F0409525%2Castro-ph%2F0409351%2Castro-ph%2F0409717%2Castro-ph%2F0409185%2Castro-ph%2F0409499%2Castro-ph%2F0409001%2Castro-ph%2F0409502%2Castro-ph%2F0409127%2Castro-ph%2F0409121%2Castro-ph%2F0409659%2Castro-ph%2F0409132%2Castro-ph%2F0409382%2Castro-ph%2F0409147%2Castro-ph%2F0409529%2Castro-ph%2F0409585%2Castro-ph%2F0409603%2Castro-ph%2F0409598%2Castro-ph%2F0409159%2Castro-ph%2F0409505%2Castro-ph%2F0409343%2Castro-ph%2F0409662%2Castro-ph%2F0409038%2Castro-ph%2F0409768%2Castro-ph%2F0409641%2Castro-ph%2F0409542%2Castro-ph%2F0409557%2Castro-ph%2F0409674%2Castro-ph%2F0409142%2Castro-ph%2F0409071%2Castro-ph%2F0409391%2Castro-ph%2F0409637%2Castro-ph%2F0409378%2Castro-ph%2F0409036%2Castro-ph%2F0409519%2Castro-ph%2F0409647%2Castro-ph%2F0409338%2Castro-ph%2F0409620%2Castro-ph%2F0409607%2Castro-ph%2F0409302%2Castro-ph%2F0409274%2Castro-ph%2F0409436%2Castro-ph%2F0409311%2Castro-ph%2F0409183%2Castro-ph%2F0409539%2Castro-ph%2F0409075%2Castro-ph%2F0409174%2Castro-ph%2F0409492%2Castro-ph%2F0409346%2Castro-ph%2F0409484%2Castro-ph%2F0409141%2Castro-ph%2F0409698%2Castro-ph%2F0409187%2Castro-ph%2F0409096%2Castro-ph%2F0409261%2Castro-ph%2F0409373%2Castro-ph%2F0409143%2Castro-ph%2F0409281%2Castro-ph%2F0409600%2Castro-ph%2F0409319%2Castro-ph%2F0409614%2Castro-ph%2F0409164%2Castro-ph%2F0409667%2Castro-ph%2F0409237%2Castro-ph%2F0409188%2Castro-ph%2F0409110%2Castro-ph%2F0409594%2Castro-ph%2F0409282%2Castro-ph%2F0409260%2Castro-ph%2F0409089%2Castro-ph%2F0409605%2Castro-ph%2F0409413%2Castro-ph%2F0409495%2Castro-ph%2F0409716%2Castro-ph%2F0409465%2Castro-ph%2F0409158%2Castro-ph%2F0409114%2Castro-ph%2F0409617%2Castro-ph%2F0409421%2Castro-ph%2F0409015%2Castro-ph%2F0409630%2Castro-ph%2F0409512%2Castro-ph%2F0409049%2Castro-ph%2F0409387%2Castro-ph%2F0409353%2Castro-ph%2F0409255%2Castro-ph%2F0409515%2Castro-ph%2F0409230%2Castro-ph%2F0409634%2Castro-ph%2F0409380%2Castro-ph%2F0409588%2Castro-ph%2F0409253%2Castro-ph%2F0409204&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The impact of thermal gas in AGN jets on the low-frequency emission"}, "summary": "We study the effect of non-relativistic, thermal matter in the jets of active\ngalaxies (AGN) on the low-frequency non-thermal emission and the variability\nthereof. In matter-dominated jets, sizable quantities of gas should exist, in\nparticular in the compression zones near the collision fronts that are an\nimplicit ingredient of Fermi-type particle acceleration scenarios.\nNon-relativistic thermal gas in AGN jets noticably contributes to the optical\ndepth at radio to infrared frequencies, and much less to the emission, with an\nefficiency that is strongly temperature-dependent. The observable flux of\nlow-frequency emission is thus modulated by the temperature evolution of the\nthermal gas, and it can therefore display very complicated variability. For a\nparticular particle energisation scenario we calculate the temperature\nevolution of the thermal plasma as well as the radiation transport of\nlow-frequency emission, and thus derive simulated light curves at different\nfrequencies and their typical correlation properties.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0409055%2Castro-ph%2F0409513%2Castro-ph%2F0409016%2Castro-ph%2F0409355%2Castro-ph%2F0409574%2Castro-ph%2F0409640%2Castro-ph%2F0409301%2Castro-ph%2F0409739%2Castro-ph%2F0409179%2Castro-ph%2F0409525%2Castro-ph%2F0409351%2Castro-ph%2F0409717%2Castro-ph%2F0409185%2Castro-ph%2F0409499%2Castro-ph%2F0409001%2Castro-ph%2F0409502%2Castro-ph%2F0409127%2Castro-ph%2F0409121%2Castro-ph%2F0409659%2Castro-ph%2F0409132%2Castro-ph%2F0409382%2Castro-ph%2F0409147%2Castro-ph%2F0409529%2Castro-ph%2F0409585%2Castro-ph%2F0409603%2Castro-ph%2F0409598%2Castro-ph%2F0409159%2Castro-ph%2F0409505%2Castro-ph%2F0409343%2Castro-ph%2F0409662%2Castro-ph%2F0409038%2Castro-ph%2F0409768%2Castro-ph%2F0409641%2Castro-ph%2F0409542%2Castro-ph%2F0409557%2Castro-ph%2F0409674%2Castro-ph%2F0409142%2Castro-ph%2F0409071%2Castro-ph%2F0409391%2Castro-ph%2F0409637%2Castro-ph%2F0409378%2Castro-ph%2F0409036%2Castro-ph%2F0409519%2Castro-ph%2F0409647%2Castro-ph%2F0409338%2Castro-ph%2F0409620%2Castro-ph%2F0409607%2Castro-ph%2F0409302%2Castro-ph%2F0409274%2Castro-ph%2F0409436%2Castro-ph%2F0409311%2Castro-ph%2F0409183%2Castro-ph%2F0409539%2Castro-ph%2F0409075%2Castro-ph%2F0409174%2Castro-ph%2F0409492%2Castro-ph%2F0409346%2Castro-ph%2F0409484%2Castro-ph%2F0409141%2Castro-ph%2F0409698%2Castro-ph%2F0409187%2Castro-ph%2F0409096%2Castro-ph%2F0409261%2Castro-ph%2F0409373%2Castro-ph%2F0409143%2Castro-ph%2F0409281%2Castro-ph%2F0409600%2Castro-ph%2F0409319%2Castro-ph%2F0409614%2Castro-ph%2F0409164%2Castro-ph%2F0409667%2Castro-ph%2F0409237%2Castro-ph%2F0409188%2Castro-ph%2F0409110%2Castro-ph%2F0409594%2Castro-ph%2F0409282%2Castro-ph%2F0409260%2Castro-ph%2F0409089%2Castro-ph%2F0409605%2Castro-ph%2F0409413%2Castro-ph%2F0409495%2Castro-ph%2F0409716%2Castro-ph%2F0409465%2Castro-ph%2F0409158%2Castro-ph%2F0409114%2Castro-ph%2F0409617%2Castro-ph%2F0409421%2Castro-ph%2F0409015%2Castro-ph%2F0409630%2Castro-ph%2F0409512%2Castro-ph%2F0409049%2Castro-ph%2F0409387%2Castro-ph%2F0409353%2Castro-ph%2F0409255%2Castro-ph%2F0409515%2Castro-ph%2F0409230%2Castro-ph%2F0409634%2Castro-ph%2F0409380%2Castro-ph%2F0409588%2Castro-ph%2F0409253%2Castro-ph%2F0409204&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the effect of non-relativistic, thermal matter in the jets of active\ngalaxies (AGN) on the low-frequency non-thermal emission and the variability\nthereof. In matter-dominated jets, sizable quantities of gas should exist, in\nparticular in the compression zones near the collision fronts that are an\nimplicit ingredient of Fermi-type particle acceleration scenarios.\nNon-relativistic thermal gas in AGN jets noticably contributes to the optical\ndepth at radio to infrared frequencies, and much less to the emission, with an\nefficiency that is strongly temperature-dependent. The observable flux of\nlow-frequency emission is thus modulated by the temperature evolution of the\nthermal gas, and it can therefore display very complicated variability. For a\nparticular particle energisation scenario we calculate the temperature\nevolution of the thermal plasma as well as the radiation transport of\nlow-frequency emission, and thus derive simulated light curves at different\nfrequencies and their typical correlation properties."}, "authors": ["M. Siewert", "M. Pohl", "R. Schlickeiser"], "author_detail": {"name": "R. Schlickeiser"}, "author": "R. Schlickeiser", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20040546", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0409075v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0409075v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 13 figures, accepted by Astronomy and Astrophysics", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0409075v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0409075v1", "journal_reference": "Astron.Astrophys. 425 (2004) 405-416", "doi": "10.1051/0004-6361:20040546", "fulltext": "Astronomy & Astrophysics manuscript no. 0546main\n(DOI: will be inserted by hand later)\n\nAugust 23, 2018\n\nThe impact of thermal gas in AGN jets on the low-frequency\nemission\nM. Siewert1 , M. Pohl1,2 , and R. Schlickeiser1\n\narXiv:astro-ph/0409075v1 3 Sep 2004\n\n1\n2\n\nInstitut für Theoretische Physik, Lehrstuhl IV, Ruhr-Universität Bochum, 44780 Bochum, Germany\nDepartment of Physics and Astronomy, Iowa State University, Ames, IA 50011, USA\n\nReceived 29 March 2004 / Accepted 25 May 2004\nAbstract. We study the effect of non-relativistic, thermal matter in the jets of active galaxies (AGN) on the low-frequency\n\nnon-thermal emission and the variability thereof. In matter-dominated jets, sizable quantities of gas should exist, in particular\nin the compression zones near the collision fronts that are an implicit ingredient of Fermi-type particle acceleration scenarios.\nNon-relativistic thermal gas in AGN jets noticably contributes to the optical depth at radio to infrared frequencies, and much\nless to the emission, with an efficiency that is strongly temperature-dependent. The observable flux of low-frequency emission\nis thus modulated by the temperature evolution of the thermal gas, and it can therefore display very complicated variability. For\na particular particle energisation scenario we calculate the temperature evolution of the thermal plasma as well as the radiation\ntransport of low-frequency emission, and thus derive simulated light curves at different frequencies and their typical correlation\nproperties.\nKey words. Galaxies: active – Plasmas\n\n1. Introduction\nBlazars, a sub-class of active galactic nuclei (AGN), are\namong the strongest known radiation sources in the universe.\nObservations show that they exhibit strong optical polarization, variability on all observable timescales, flat-spectrum\nradio emission from a compact core, and many of them\nemit the bulk of their luminosity in the form of γ-rays (e.g.\nDermer & Gehrels 1995; Mukherjee et al. 1997). On account\nof these measurements it is usually argued that the γ-rays are\nproduced in very compact regions within a relativistically moving system, the so-called jets, thus providing a strong Doppler\namplification of the radiation. Often, the relativistic bulk motion can be directly observed as apparent superluminal motion\nof individual emission regions in the jets in sequences of VLBI\nobservations of their radio emission. The Lorentz factors (and\nDoppler factors) thus derived are of the order of ten for general samples of AGNs (Vermeulen & Cohen 1994), but may be\nhigher for AGNs showing prominent gamma-ray emission (e.g.\nHoman et al. 2002, 2003). The range of Lorentz factors prevalent at the time of gamma-ray emission, which presumably occurs before the emission region becomes visible at radio frequencies, is not known, but is likely higher than ten, if the bulk\nkinetic energy of the jets is the energy reservoir for the particle acceleration (see, e.g., Georganopoulos & Kazanas 2003).\nThese conclusions are further supported by the absence of γ −γ\nSend offprint requests to: M. Siewert, e-mail:ms@tp4.rub.de\n\npair absorption and the violation of the Elliot-Shapiro relation\n(Elliot & Shapiro 1974) in several observed AGNs.\nThe unified model for active galaxies (Urry & Padovani\n1995) assumes that a supermassive black hole is located in\nthe center of a galaxy. The black hole supposedly accelerates\nplasma to high energies, while the surrounding host galaxy provides a steady inflow of matter, often assumed to be in the form\nof an accretion disk, to keep the system running for a long time.\nAbove the accretion disk plasma is ejected in jets, which may\nreach lengths of several hundreds kpc (Begelman et al. 1984;\nSchlickeiser 2002).\nThough thermal radiation can be observed from many\nAGN, it is usually associated with the accretion disk and the\nmedium around it. The emission from the jets is generally assumed to be entirely non-thermal on account of the spectrum\nand the variability behaviour. Nevertheless, there may be thermal plasma in the jets, in which the dominantly radiating, energetic particles are embedded and confined.\nIn this paper we will study the effect of thermal matter in\nthe jets on the low-frequency non-thermal emission and the\nvariability thereof. We will do so in the framework of one\nparticular model of particle acceleration, in which the energetic particles are provided by the isotropization of interstellar matter in the downstream region of a relativistic collision\nfront (Pohl & Schlickeiser 2000, henceforth referred to as PS),\nthough most of our treatment, and hence most of the results,\nare not restricted to the particulars of this scenario.\n\n\f2\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\nAs we will see, the thermal gas will not necessarily manifest itself by its emission, but rather by its absorption. Both the\nemission and the absorption properties of thermal matter depend strongly on the temperature, and thus the problem at hand\nhas two aspects. First, the radiation transport of low-frequency\nemission through thermal gas must be calculated, which is a\nfunction of the plasma temperature and density as well as of\nthe spectrum of energetic particles. We then need to follow the\ntemperature evolution of the thermal gas, which depends on the\nits emission and absorptions coefficients (and hence on its temperature), on the spectrum of energetic particles, and on possible wave damping. In this study we concentrate on continuum\nemission processes.\nThe spectrum of non-thermal particles obviously varies\nwith time on account of the variability in the high-energy emission. Consequently the plasma temperature will vary, and so\nwill the thermal absorption coefficient. The observable flux of\nlow-frequency emission is thus modulated by the temperature\nevolution of the thermal gas, and it can therefore display very\ncomplicated variability behaviour, the study of which is the\nsubject of this paper.\nWe first give a brief introduction into the PS model for active galactic nuclei (Sect. 2). After this, in Sect. 3 we discuss\nthe radiation transport for a general non-thermal population of\nelectrons in a warm electron-proton plasma. We present numerical absorption and emission coefficients for a generic situation\n(when this is possible) as well as for the PS model (when a\ngeneric treatment is not possible). In Sect. 5 we discuss the\ntemperature evolution in a generic warm background plasma\nfor different heating processes. The results of this analysis are\nindependent of the non-thermal particle spectrum, so that they\ncan easily be applied to other (non-)astrophysical situations.\nIn Sect. 4 and 5.5 we present numerical results for the PS\nmodel and demonstrate that only a few parameters actually influence the qualitative behaviour of a system. Section 5.5 emphasizes the limits of our calculations, while Sect. 6 connects\nthese limits to free parameters in this situation.\n\nlab system\n\nΓ\n\nn*p\n\nn*i\n\njet system\nΓ\n\nni\n\nθ\n\nnp\n\n2r\n\nΓ\nΓ\n\nd\nFig. 1. The geometry visualized for two systems of reference,\nthe jet frame and the laboratory (host galaxy) frame, for which\nall quantities are indexed with an asterisk. We consider a single\ncloud of thermal proton-electron plasma with density np , that is\nrelativistically moving through the interstellar medium of the\nhost galaxy with density n∗i . An observer would see radiation\nfrom the plasma cloud that is emitted at an angle θ with respect\nto its direction of motion.\n\n2. The basic model\nPohl & Schlickeiser (2000) have studied the kinetic relaxation\nof particles that have traversed a parallel collision front from\nthe upstream to the downstream region. This pick-up process\noccurs due to scattering off low-wavenumber plasma waves\nthat the picked-up particles generate through streaming instabilities. The calculation describes the first half-cycle of the\nstandard shock acceleration process for relativistic, collisionless flows. If the outflow plasma propagating through the jet\nis dense, the downstream region provides a target for the\nultra-relativistic protons to interact with and produce radiation through various leptonic and hadronic emission channels.\nThe predicted radiation properties resemble those of gammaray blazars and thus the model offers an attractive alternative to shock acceleration of electrons and subsequent Inverse\nCompton scattering.\nThe geometry of the system is shown in Fig. 1 for two systems of reference, the jet frame (without index) and the laboratory (host galaxy) frame, for which all quantities are indexed\n\nwith an asterisk. In this report, we also use a third reference\nframe, the observer frame, which we use to calculate the observed evolution time. We will come back to this point later in\nthis section. We consider the jet to consist of individual clouds\nof thermal proton-electron plasma, that are relativistically moving through the interstellar medium of the host galaxy. Here we\ndiscuss the interactions of one such cloud with temperature T ,\ndensity np , and as a simple approximation for its spatial extent\nand form a cylindrical disk with radius r and thickness d. We\nemphasize that we treat the swept-up matter as a simple collection of particles, which is in accordance with the earlier model\nby Pohl & Schlickeiser (2000), and unlike the fluid treatment\ncommon to shock acceleration physics (Schlickeiser 2002). As\na consequence, there is no relation between the two quantities\nn p and ni , and the Rankine-Hugoniot conditions do not apply.\nThe Lorentz transformation between the two frames of reference gives the relations ni = Γn∗i and n∗p = Γnp with a relative\nLorentz factor of Γ. The swept-up particles are of high energies\n\n\fM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\nin the instantaneous downstream (jet) frame and are quickly\nisotropized (Pohl & Schlickeiser 2000). Momentum conservation causes the system to decelerate, while internal processes\nproduce a broad distribution of primary protons, Np (γp ), and\nsecondary electrons, Ne (γe ), which are more important than\nprimary electrons for the parameters of interest. Unless noted\notherwise, all relevant expressions use cgs units, all particle\nspectra Nx are taken per unit volume and all equations and formulae are taken in the instantaneous jet frame.\nThe isotropization of the swept-up particles effects a momentum transfer from the interstellar medium particles to the\njet. Therefore, the jet decelerates and the Lorentz factor of\nthe jet, Γ, is a function of time. It follows the equations\n(Pohl & Schlickeiser 2000)\nΓ̇ = −\nM(t) = V\n\nπr2 n∗i cmp\nM(t)\nXZ ∞\n\nx=e,p\n\n(Γ2 − 1)3/2\n\n(1)\n\ndγ mx (nb + γ Nx (γ, t))\n\n(2)\n\n1\n\nwhere M(t) is the total mass of the compact plasma, which in\nturn depends on the differential number density of the energetic particles, N(γ). Such gradual deceleration has been directly observed in the case of the micro-quasar XTE J1550-564\n(Corbel et al. 2002).\nThe Lorentz factors observed in astrophysical sources vary\ngreatly depending on the source class and the measured velocity indicator. While in gamma-ray burst (GRBs) they may reach\nvalues of several hundreds, the Lorentz factors in AGN jets are\nusually only of the order of ten, if deduced from measurements\nof superluminal motion, but may be higher for γ-ray-bright\nblazars. For TeV-blazars the radiation modeling often also requires significantly higher Lorentz (and Doppler) factors (e.g.\nKonopelko et al. 2003). However, gamma-ray emission is presumed to occur before the emission zone becomes visible at\nradio frequencies, and the corresponding Lorentz factor should\nthus be very much higher than ten, if the bulk kinetic energy\nof the jets is supposed to be the source for particle acceleration. Additionally, the physics of jet formation, and therefore\nthe Lorentz factors involved with this process are not understood, but considering the supposedly extreme conditions near\na black hole, it is highly possible that the particles which are\nultimately injected into the jet initially possess similarly high\nvelocities. For this reason, we assume an initial Lorentz factor\nΓ0 = 300. We would like to point out that our results are only\nparametrically dependent on this choice.\nIn the instantaneous jet frame the differential number density of protons and electrons follows the evolution equation\nN(γ)\n∂\n∂N\n(γ̇N(γ)) −\n= Ṅ −\n∂t\n∂γ\nTc\n\n(3)\n\nwhere T c is the timescale for particle losses by escape or decay,\nγ̇ represents continuous energy losses, and Ṅ is the injection or\nproduction rate of new particles. As initial condition at the time\nt = 0, when the jet Lorentz factor is Γ = Γ0 , we assume that\nthere are no energetic particles in the jet, N(γ) = 0.\nIn the default configuration the background plasma sweeps\nup protons from the interstellar matter, while electrons are\n\n3\n\nproduced in inelastic collisions in the system. The differential proton source density in the co-moving frame is\n(Pohl & Schlickeiser 2000)\nṄ =\n\nc n∗i √\nΓ2 − 1 δ(γ − Γ)\nd\n\n(4)\n\nwhile the (secondary) electron production proceeds through the\nreaction chain\np + p → π± + X\nπ± → μ± + ν\n\n(5)\n(6)\n\nμ± → e± + 2ν,\n\n(7)\n\nand is calculated numerically to properly account for the\npion multiplicity spectrum in reaction (3). Here we use the\nMonte Carlo model DTUNUC (V2.2) (Möhring & Ranft 1991;\nRanft et al. 1994; Ferrari et al. 1996a; Engel et al. 1997), which\nis based on a dual parton model (Capella et al. 1994). This\nMC model for hadron-nucleus and nucleus-nucleus interactions includes various modern aspects of high-energy physics\nand has been successfully applied to the description of hadron\nproduction in high-energy collisions (Ferrari et al. 1996b;\nRanft & Roesler 1994; Möhring et al. 1993; Roesler et al.\n1998).\nThe particle losses are diffusive escape (protons and electrons), neutron escape following p+p → n+X reactions and\npair annihilation (electrons and positrons),\nT esc = 1.67 * 10−19\n\nd2 Γ n∗i\n√\nβ np\n\n*\nexp −\nT neu = 3 * 1015 n−1\np\n−1\nT ann\n=\n\n\"\n1\nT c,tot\n\nsec\nL\nγ 2.7 * 1013 cm\n\n3cσT np\n×\np\n8(γ + 1) γ2 − 1\n\n(γ + 4 + γ−1 ) log(γ +\n\n=\n\n(8)\n!+−1\n\nsec\n\n(9)\n\n(10)\nq\n\nγ2 − 1) − β(γ + 3)\n\nX 1\n.\nT c,i\ni\n\n#\n\nsec−1\n(11)\n\nFor all relevant cases the exponential in eq. 9 (where L is the\ndistance to the plasma cloud boundary) can be approximated by\n1 (Pohl & Schlickeiser 2000). We approximate the continuous\nlosses by\n− γ̇el,p = 3.75 * 10−16 np p\n\nγ\nγ2 − 1\nγ\n\nsec−1\n\nsec−1\n−γ̇el,e = 7.5 * 10−13 np p\nγ2 − 1\n(γ − 1)2\nsec−1\n−γ̇inel,p = 7 * 10−16 np\nγ+1\nB2 2 2\nγ β sec−1\n−γ̇Sync = 1.1 * 10−15\nme c 2\n−γ̇Brems = 8 * 10−16 np (γ − γ−1 ) sec−1 .\n\n(12)\n(13)\n(14)\n(15)\n(16)\n\n\f4\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\nparameter\naverage magnetic field B\nbackground plasma density np\ninterstellar matter density n∗i\nobserver angle θobs\ninitial Lorentz factor Γ0\ndisk height d\ndisk radius r\ninitial temperature T0\n\ndefault value\n1G\n5 * 108 cm−3\n0.4 cm−3\n0.1◦\n300\n3 * 1013 cm\n1014 cm\n104 K\n\nTable 1. Standard parameters used in this report unless noted\notherwise. For the relation between the observer angle and the\nemission angle see Eq.17 and 18.\n\nAs a reminder we here list the relations between relevant\nquantities in the observer's frame and the jet frame. While the\nobserver's frame is fixed, the jet frame is only the instantaneous\nrest frame of the jet plasma at the time considered. Since we are\ninterested in the long-time evolution of a compact relativistic\nobject moving along a straight line under a fixed aspect angle\nin the observer's frame, we also need to consider that the corresponding aspect angle in the instantaneous jet frame is not\nconstant, for the Doppler factor is changing with time.\ncos θobs =\ncos θ =\n\nHere the subscripts el and inel stand for elastic and inelastic processes, S ync for synchrotron radiation and Brems for\nBremsstrahlung. The equations 12 and 13 are taken from Haug\n(1988), eq. 18, assuming a Coulomb logarithm of 25 and neglecting the last terms. This modification has been made to be\nconsistent with eq. 44, while in Pohl & Schlickeiser (2000) a\nvalue of 20 is used. It does not affect the overall results in any\nvisible way. Equation 15 is from Pacholczyk (1970), averaged\nover all emission directions. The inelastic energy losses, eq.\n14 are a result of the model used to evaluate these processes\n(Capella et al. 1994). Finally, the Bremsstrahlung energy losses\nare taken from Hayakawa (1969) and Pohl & Schlickeiser\n(2000).\nThe timescales for particle losses are from\nJauch & Rohrlich (1976) (eq. 10) and Pohl & Schlickeiser\n(2000) (eq. 8 and 9). The diffusive escape timescale used here\nis derived for the disk geometry under the condition r ≫ d,\nwhich implies that effectively the charged particles will only\nescape through the top and bottom surfaces. The most important point here is the assumption that the energetic particles\nstart diffusing outwards near the center of the jet plasma cloud.\nDepending on the Alfvén speed and the initial intensity of\nscattering waves this may be questionable (Vainio et al. 2004).\nWe also want to emphasize that these equations have been\nderived under the assumption that the plasma is fully ionized\nand that the particle number is conserved. If this is not the\ncase, the above equations have to be modified for ionization,\nrecombination and pair production.\nThe free parameters of the model are specified in table 1\nfor a quick reference, where we also show the numerical values we have adopted as standard set of parameters in this paper.\nWhenever we modify one of these values, it is explicitely mentioned in the text. We have neglected all e+ e− annihilation processes, since we focus on the optical-to-infrared region where\npair annihilation does not contribute.\nAll calculations in this analysis are made in the jet rest\nframe. For a comparison with observations, the photon spectra have to be transformed into the observer's frame, which,\ndepending on the cosmological redshift of the AGN in question, can be different from the host galaxy frame. For ease of\nexposition we will assume in the following treatment that the\nobserver's frame and the host galaxy frame are identical, as was\ndone in Pohl & Schlickeiser (2000).\n\nD =\nνobs =\nI obs (νobs ) =\n\ncos θ + βΓ\n1 + βΓ cos θ\ncos θobs − βΓ\n1 − βΓ cos θobs\n1\nΓ(1 − βΓ cos θobs )\nDν\nD3 I(νobs /D)\n\ndtobs = dt/D\n\n(17)\n(18)\n(19)\n(20)\n(21)\n(22)\n\n3. The radiation transport\n\n3.1. The radiation transport equation\nTo calculate the emitted photon spectra Iν,0 for a given lineof-sight, it is required to know the emission coefficient jν and\nthe absorption coefficient αν . These two quantities enter in the\nradiation transport equation (e. g. Rybicki & Lightman 1985),\ndIν,0\n= S ν − Iν,0\n(23)\ndτ\nP\nP\nvia the source function S ν = i ji / i αi and the optical depth\nZ s\nα dx .\n(24)\nτ=\n0\n\nThe well-known general solution to this equation are for a path\nlength of s\n\u0002\n\u0003\nIν,0 (τ) = S ν 1 − exp(−τ)\n= jν * s\nfor τ ≪ 1\n(25)\n= Sν\nfor τ ≫ 1.\nIn our calculations we have assumed that the radiation coefficients jν and αν are independent of location, i.e. the supposedly\ncylindrical cloud of plasma in the jet is homogeneous, so that\nthe optical depth reduces to\nτs = α * s\n\n(26)\n\nThese expressions are the solution of the radiation transport equation for a single line-of-sight through the jet plasma.\nWe still have to integrate over the entire emitting surface, as\nwell as respecting the exact geometry of the system, since the\nphoton path length is not constant over the apparent surface of\nthe emission region. The total spectral power is then\nZ\nPν (Ω) =\ndA(Ω) Iν,0 (Ω)\n(27)\nwith the apparent surface element dA and the emission direction Ω.\n\n\fM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\ns f ≃ d/ cos θ,\n\n1e-05\n\nsynchrotron\nfree-free\nsynchrotron (no Razin)\n\n1e-10\nα [1/cm]\n\nSince a real cloud of plasma will have a complicated (and\ngenerally unknown) geometry rather than the simple shape\nconsidered by Pohl & Schlickeiser (2000) and in this report, it\nmay be sufficient to arrive at an approximate solution to Eq.27.\nLet us start with the most simple approximation: we assume\nthat the path length, s, is independent of the emission point both\nfor the front surface, Af , and the side surface, As . Then for the\nfront surface\n\n5\n\n(28)\n\n1e-15\n\n1e-20\n\nand\nPν, f (Ω) ≃ A f cos θ Iν,0 (dθ)\n\"\n!#\nαd\n2\n≃ π r cos θ S ν 1 − exp −\n.\ncos θ\n\n(29)\n\n-6\n\n-5\n\n-4.5\n-4\n-3.5\nlog10 Eν [eV]\n\n-3\n\n-2.5\n\n-2\n\nFig. 2. The absorption coefficients α for the free-free process and the synchrotron process for the jet model of\nPohl & Schlickeiser (2000) with standard parameters (see table 1). We display the situation after one hour in the observer's\nframe, at which time the plasma temperature is T≈ 3 * 104 K.\nApparently the system is dominated by free-free absorption.\n\n(31)\n\n1e-18\n\nand\n\n1e-19\n\n(32)\n(33)\n\nwhich turns out to be a fair approximation to the exact solutions\nof the problem, which are derived in appendix A.\nA better approximation is afforded by a box geometry instead\nof the original cylinder. The side lengths would be a =\n√\nπ r to conserve the volume. If one assumes that the line-ofsight to the observer is in the plane of two of the side surfaces, Eq.27 can be solved exactly. The resulting expressions\nfor the observable photon spectra are presented in appendix B.\nThe box geometry turns out an excellent approximation to the\nexact solution for the initially assumed disk geometry, with a\nmaximum error of 3% at θ = 60◦ , while the simple constant-s\napproach introduces an error of 20-30%.\n\n3.2. The emission coefficients\nIn this report we consider two different contributions to\nthe radiation processes, synchrotron emission and thermal\nbremsstrahlung (free-free emission). The bremsstrahlung coefficients for a quasineutral thermal hydrogen plasma are\n(Rybicki & Lightman 1985)\nr\n√ 2\n!\n!\nhν\n2 kT\n2 n α σT ~ c mc2\nexp −\n(34)\nln\njbr =\nkT\nhν\nkT\nπ3/2\nr\n!\"\n!#\n2 n2 α σT c3 mc2\nhν\n2 kT\nαbr =\n1\n−\nexp\n−\n.\nln\nkT\nhν\nkT\n(2π)5/2 ν3\n(35)\n\nj [erg/s cm3 Hz sr]\n\nPν,s (Ω) = A s sin θ Iν,0 (dθ)\n\u0014\n\u0012 α r \u0013\u0015\n.\n= 2 d r sin θ S ν 1 − exp −\nsin θ\n\n-5.5\n\n(30)\n\nOn account of the assumed thin-disk geometry, i.e. d ≪ r, the\ncontribution from the side surface is significant only for emission angles θ ≈ π/2. The choice of a thin disk for our system\nintroduces an additional problem, for the photon path length\nbetween two opposite points on the side surface is not constant;\nwe use s ≃ r and obtain\ns s ≈ r/ sin θ,\n\n1e-25\n\n1e-20\n1e-21\n1e-22\n1e-23\nsynchrotron\nfree-free\nsynchrotron (no Razin)\n\n1e-24\n1e-25\n-6\n\n-5.5\n\n-5\n\n-4.5\n-4\n-3.5\nlog10 Eν [eV]\n\n-3\n\n-2.5\n\n-2\n\nFig. 3. The emission coefficients j for the free-free process and\nthe synchrotron process after one hour observed time for standard parameters, as in Fig.2. The free-free emission is only visible because of the Razin effect. For np = 5 * 108 cm−3 the\nplasma frequency corresponds to Eν ≈ 8 * 10−7 eV, so we cover\nthe entire valid energy spectrum.\n\nThe synchrotron radiation coefficients for an ensemble of\nelectrons with differential number density N(γ) can be calculated as (Rybicki & Lightman 1985)\nZ ∞\n1\ndγ N(γ) p sy(ν)\n(36)\njsy =\n4π 1\n!\nZ ∞\n∂ N(γ)\n1\n(37)\ndγ (γ2 − 1) p sy (ν)\nαsy = −\n∂γ γ2 − 1\n8πmν2 1\nwith the spectral power per electron\n√ 3\n!\n3e B\nν\nF\np sy (ν) =\nνc\nmc2\n\n(38)\n\n\f6\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n1e+24\n\nPν [erg/s Hz sr]\n\n1e+22\n1e+20\n1e+18\n1e+16\nfull spectrum w. razin\nfull spectrum w.out razin\nsynrotron spectrum w. razin\nfree-free spectrum\n\n1e+14\n1e+12\n-6\n\n-5.5\n\n-5\n\n-4.5\n-4\n-3.5\nlog10 (Eν [eV])\n\n-3\n\n-2.5\n\n-2\n\nFig. 4. Emitted photon spectra after one hour of observed time\nin the jet system for the standard parameters (θobs ≈ 0.1◦ , see\ntable 1) and T ≈ 3 * 104 K. The thermal Bremsstrahlung dominates at low energies only because of the Razin-effect, which\nsuppresses the synchrotron spectrum here.\nwhere\n3eB 2\nγ\nνc =\n4πmc\n\n1\n\nF(x) ≈ 1.8 x 3 exp(−x)\n\n(39)\n\nIn a dense plasma with plasma frequency νp the spectral\npower is modified at low frequencies by the Razin effect\n(Rybicki & Lightman 1985; Crusius & Schlickeiser 1988) on\naccount of the modified dispersion relation for electromagnetic\nwaves. Then\np sy,Razin(ν) =\n\np sy (νR3/2 )\n√\nR\n\n(40)\n\nwhere\nR=1+\n\n\u0012 ν γ \u00132\np\nν\n\n√\nνp ≃ 9 * 103 np Hz.\n\n(41)\n\nThe Razin effect creates a cutoff in the photon spectrum at low\nenergies, whereas at high energies the emission spectrum is unchanged.\nThe radiation coefficients for the standard parameters (see\ntable 1) in the jet model of Pohl & Schlickeiser (2000) are\ndisplayed in Fig.2 and Fig.3. The synchrotron coefficients are\nbased on the numerically derived electron spectrum in the system after one hour of observed time, while the free-free radiation coefficients depend only on the temperature, which is approximately 3*104 K at this time. The kinematic of the pion and\nmuon decays is unfavorable for the production of secondary\nelectrons with an energy less than approximately 100 MeV.\nThus, essentially only highly relativistic electron are generated.\nThe energy loss rate below 300 MeV is dominated by Coulomb\nand ionization interactions, i.e. is independent of energy, so that\nin a steady-state spectrum the cooling tail towards lower energies would be flat. The synchrotron spectrum in Fig. 3 is correspondingly inverted.\nThe non-thermal emission spectra do not significantly\nchange when we modify the parameters, except for an approximately linear dependence on the density of the interstellar\n\nmedium, so the results displayed here are a good estimate in\nmost situations. The free-free absorption, and to a smaller extent the emission, is strongly reduced in efficiency for higher\ntemperatures. As we shall see later, the plasma temperature\ncan rise from T = 3 * 104 K, which nearly is a lower limit,\nto 109 K or more. Modifying the temperature from 3 * 104 K\nto this value reduces the absorption coefficient by 7 orders of\nmagnitude, which makes the free-free absorption less efficient\nthan the synchrotron absorption. The temperature, for which\nboth are approximately equal, is around 108 K.\nIt thus appears that the optical thickness is mostly dominated by free-free absorption, while the emission is dominated\nby either synchrotron radiation or bremsstrahlung, depending\non the frequency. It is important to include the Razin effect in\nour calculations, for, without the Razin effect, the synchrotron\nemission coefficient would not have a cut-off at low frequencies, and free-free emission would be completely negligible.\nAn interesting possibility is that a synchrotron maser may\noperate in the jet plasma. Maser activity requires a negative\nabsorption coefficient (α < 0), indicating that stimulated emission is more important than the spontaneous absorption. If the\noptical depth τ ≪ −1, the emitted photon intensity can be very\nhigh.\nCrusius & Schlickeiser (1988) have shown that for the synchrotron process this is only possible when the electron spectrum has a slope of at least 2, i.e. the distribution function is\ninverted. The numerical calculations of the inelastic proton decay chain seem to indicate that this is not the case, at least\nin the energy regions covered in this report. The condition for\nsynchrotron masering is α < 0, and since the evaluation of α\nrequires an integration over the entire radiating particle distribution (eq. 37), this condition must be valid for a large energy\ninterval, and a locally hard spectrum will not be sufficient for a\nmaser to operate.\n\n4. Simple photon spectra\nIn this section we discuss radiation spectra for a constant temperature with a view to understand the characteristic properties\nof the escaping low-frequency emission. After one hour of observed time, the temperature is T ≈ 3 * 104 K.\nPhoton spectra calculated on the basis of the exact disk geometry are presented in Fig. 4. The spectrum can be separated\nin an optically thick region and an optically thin region. The optical depth itself is dominated by the free-free absorption process. The emission process is dominated by the synchrotron\nprocess, for which the Razin effect causes a drop off below a\ncertain photon energy, so that at very low frequencies the freefree emission becomes visible.\nThe spectra shown here are calculated in the jet frame, and\nthus they need to be transformed in the observer system for a\ncomparison with data. For blazars, this would result in a frequency shift by about two orders of magnitude, so the turnover frequency, at which the emission transitions from optically thick to optically thin conditions, would be located in the\nnear-infrared.\nNext, we calculate the emitted photon spectra for different\nobservation angles θobs and show typical results in Fig.5. For\n\n\fM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\n7\n\nFig. 5. Emitted photon spectra in the jet frame after one hour of observed time for different emission angles, based on an exact\ntreatment of the geometry. For high θobs , the slow evolution of the synchrotron part of the spectrum has been reproduced.\n\n5. The evolution of the temperature\nThroughout this paper we have assumed that LTE is valid, that\nthe jet plasma is always non-relativistic, and that the electron\nand proton components have the same temperature, i.e. the\ninternal equilibration processes are faster than the energy exchange with the environment.\n\n5.1. The cooling process\nAs we have seen, the temperature of the jet plasma is a decisive parameter for the radiation yield at low frequencies.\nThe plasma is subjected to a number of heating and cooling\nprocesses, and therefore the temperature will not remain constant. We use a balance equation to follow the variations of the\nplasma temperature,\nṪ =\n\n1\n(γ − 1)(ǫ̇ − Λ) ,\nnp k\n\n1e-21\n1e-22\nΛ/np2 [erg cm3/s]\n\nvery small aspect angles θobs ≤ 1◦ , the jet system appears to\nrapidly evolve; in fact Γ ≈ 270 after one hour of observed time.\nThis value is still very high compared to typical Lorentz factors\nof 10, but one should note that it takes months for an outburst to\nbecome visible at radio frequencies, where most measurement\nof jet velocity are made.\nThe characteristic aspect of these spectra is the presence of\nboth the thermal and the synchrotron components of the spectrum. Variations on the high-frequency part of the spectrum,\nmost notably a shift of the turn-over frequency, are visible,\nwhich result from the different aspect in the jet frame, i.e. the\ndifferent optical depth for a frontal and side view of the emission region in the jet frame.\nFor larger observation angles (θobs > 1◦ ), the system\nevolves much slower, so that Γ ≈ Γ0 after a single hour.\n\n1e-23\n1e-24\n1e-25\n1e-26\n1e-27\n100\n\n1000\n\n10000 100000 1e+06 1e+07 1e+08\nT [K]\n\nFig. 6. The approximated cooling function according to Eq.43.\nthe standard interstellar cooling function (Dalgarno & McCray\n1972; Raymond et al. 1976).\n\u0010\n\u0011\nΛ = 10−22 erg cm−3 s−1 n2p\n\n\n2.3 * 10−5\n\n\n\n\n\n0.64\n\n×\n\n\n3.6\n*\n105\n\n\n\n 1.6 * 10−3\n\nT 1.1\nT 0.55\nT −0.6\nT 0.5\n\nfor\nfor\nfor\nfor\n\n102 ≤ T ≤ 104\n104 ≤ T ≤ 105\n105 ≤ T ≤ 4 * 107\nT ≥ 4 * 107\n\n(43)\n\nwhere the temperature, T , is in units of Kelvin. The error introduced by this approximation is not significant, for other uncertainities such as the real geometry have a much greater impact on the final results. A possible exception is the jump at\nT ≃ 104 K that results from electron-impact excitation and\nionization of H , but may be modified here on account of the\ncollisional excitation and ionization by the energetic particles.\n\n(42)\n\nwith the adiabatic index γ (=5/3 for a non-relativistic hydrogen gas), the heating rate, ǫ̇, and the cooling rate, Λ. For the\ncooling rate we use an analytical approximation (see fig. 6) of\n\n5.2. The Coulomb heating process\nThe heating rate is more difficult to calculate, since there\nare several concurring contributions. For a completely ion-\n\n\f8\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\nized plasma, the heating rate from elastic Coulomb scattering of a distribution of suprathermal electrons or protons,\nN(γ), in a thermal plasma of temperature T is given by\n(Butler & Buckingham 1962; Haug 1988)\nZ ∞\n3\ndγ N(γ)\nǫ̇ =\nσT me c3 np ln Λ\n(44)\n2β\n1\nwhere ln Λ ≈ 25 is the Coulomb logarithm. This expression\nis valid for protons and electrons (this follows from Eq.13 and\n12), so that usually the non-thermal particles with the greatest\nnumber density dominate this heating process. In most practical situations in our model, this is the secondary-electron population.\nIf only relativistic particles are considered, γ ≫ 1 and β ≃\n1; then the heating rate scales linearly with the total number\ndensity of high energy particles, Ntot .\nǫ̇ ≃\n\n3\nσT me c3 np Ntot ln Λ\n2\n\n(45)\n\n5.3. The synchrotron heating process\nHeating is also effected by absorption of non-thermal emission.\nIn our case, the dominant process is free-free absorption of\nsynchrotron photons. The synchrotron absorption coefficient is\nusually small compared to the free-free absorption coefficient,\nand hence the emitted radiation is almost exclusively absorbed\nby the free-free process. The heating rate can be calculated as\nan integral over the deficit in total luminosity caused by the\nabsorption.\n!\nZ\nZ\n1 ∞\ndν 4πV jν − 2π dθ Pν (Ω)\n(46)\nǫ̇ =\nV 0\n\n\u0013\nnp\n≈ (10 Hz)\n109 cm−3\n11\n\n\u0012\n\nr\n\ns\n1014 cm\n\nr\n\n3\n\nL \u0012 T \u0013− 4\n10 106 K\n\n(47)\n\nWith these approximations eq. 46 reduces to a much simpler\nform. Using eq. 36 and changing the order of integration we\nobtain\nZ ν+\ndν 4π jν\n(48)\nǫ̇ ≤\n0\nZ ∞\nZ ν+\nZ ∞\ndγ N(γ) f (γ) sy . (49)\ndν p sy (ν) =\ndγ N(γ)\n=\n1\n\n1\n\n0\n\nThis integral has the same mathematical form as that in Eq.44\nand Eq.45, implying that is may be sufficient to compare the\nweight functions for the heating processes, f .\nFor Coulomb heating by relativistic particles, the weight\nfunction, fel,e , follows directly from eq. 45,\nf (γ)el,e ≃ 6 * 10−19 np\n\nerg cm3 s−1 .\n\n(50)\n\nSince electrons and protons have the same weight functions,\nf (γ)el,e = f (γ)el,p , this applies to protons as well, which are\nusually less numerous that electrons and therefore won't dominate the overall heating process.\nThe synchrotron weight function is more difficult, for the\nintegral over ν in Eq.49,\nZ ν+\ndν p sy (ν)\nf (γ)sy =\n0\n√ 3 Z ν\n!1/3\n+\nν\nν\n3e\n(51)\nexp(− )\ndν\nB\n= 1.8\n2\nνc\nνc\nmc\n0\n\nThe spectral power, Pν (Ω), is given by Eq.27 and strongly dependent on the emission angle, thus necessitating the integral\nover θ. In appendix A we will discuss ways to arrive at approximate solutions to Pν (Ω) with various degrees of accuracy.\n\nrequires a numerical treatment for general ν+ . However, an approximate solution can be derived. For that purpose we compare the electron energy loss rates for synchrotron emission\n(Eq.15) and Coulomb scattering (Eq.13). For electron Lorentz\nfactors, γ, smaller than the critical value\n\n5.4. Comparing both heating processes\n\nγ− = max(1, g(n p, B))\nr\n\u0012 n \u00131/2 \u0012 B \u0013−1\nn\np\ng(n p , B) =\n682 2 me c2 ≈ 0.024\n,\nG\nB\ncm3\n\nIt may be useful to identify parameters, for which Coulomb\nheating is always more efficient than heating by absorption, in\nwhich case solving Eq.46 would not be necessary. For that purpose, we neglect the Razin effect, for the very low-frequency\nphotons do not significantly contribute to the total heating rate.\nWe also note that the optical depth is strongly dependent on\nfrequency, thus effectively dividing the spectrum at the turnover frequency ν+ , for which τ = 1, in a low-frequency part\nat ν ≤ ν+ , in which essentially all photons are absorbed, and a\nhigh-frequency part at ν ≥ ν+ , in which essentially all photons\nescape.\nWe have noted before that free-free absorption is generally\nmore efficient than synchrotron absorption. The turn-over frequency ν+ is determined by the absorption coefficient (Eq.35)\nand the path length s. Setting the logarithmic term to the constant value L we find in the limit hν ≪ kT\ns\n!3/4\n√ √\n2 α σT ~ c mc2\ns L\nν+ = np\n3/2\n(2π) me kT\n\n(52)\n(53)\n\nthe electrons lose more energy by Coulomb scattering than by\nsynchrotron radiation. This implies that Coulomb interactions\nare the dominant heating process, whatever the optical depth of\nthe jet plasma. Only at Lorentz factors γ ≥ γ− will the electrons dump a significant fraction of their energy into the radiation field. At these energies, the electrons will mainly radiate\nat frequencies ν ≥ ν− , where\nν− = (2.2 * 1013 Hz)\n\n\u0012\n\n\u0013 \u0012 B \u0013−1\nnp\n,\n109 cm−3 G\n\n(54)\n\ni.e. under optically thin conditions for the standard parameters\n(see table 1). So\nν− ≫ ν+\nr\nr\n\u0012 T \u0013 34\ns\nL \u0012 B\u0013\n≫\n0.14\n⇔\n10 G\n104 K\n1014 cm\n\n(55)\n\n\fM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n100000\ncoulomb\ncoulomb + synchrotron\nhigh interstellar density\n\n90000\n80000\n70000\nT [K]\n\nwhich means that only a small fraction of the synchrotron emission will be absorbed by the plasma, and thus Coulomb heating should always be more efficient than heating by absorption. A careful evaluation of Eq.51 using a Taylor expansion\nin ν+ ≪ νc indicates that the numerical factor on the RHS of\nEq.55 should be closer to unity, but, on the other hand, that\nequation does not consider the heating by energetic protons.\nWe may therefore conclude that synchrotron heating can be neglected, if the condition (55) is met.\n\n9\n\n60000\n50000\n40000\n30000\n\n5.5. The balance of heating and cooling\nThe evolution of the temperature is closely tied to the evolution of the heating and cooling rates. For a homogeneous interstellar medium the system will tend to attain a quasi-steady\nstate. Consequently, the heating rates rise with time until they\nreach an asymptotic value. The temperature then evolves until\nthe cooling balances the heating.\nThe cooling rate is a strong function of the temperature,\nwith a huge jump at 104 K as the dominating feature at low temperatures (see fig.6). To reach higher temperatures, the heating\nrate must be large enough to compensate the hydrogen cooling, or the system will stay at 104 K, where the ionization fraction of hydrogen may be low, which results in an even lower\nturn-over frequency, so that the entire emission may be optical thin. Additionally, it is likely that under the conditions prevailent in the jet plasma, the temperature dependence of the\nionization fraction is weaker than in the LTE calculations of\nDalgarno & McCray (1972) and Raymond et al. (1976), thus\ncausing a slower rise of the cooling curve. Nevertheless, the\nsystem will have a stable region around 104 K for a wide range\nof heating rates.\nWhen the heating rate becomes larger than the maximum\nof the cooling function at 105 K, the temperature will increase\nto more than 108 K, beyond which bremsstrahlung cooling may\nagain balance the heating. Extrapolating the cooling function to\ntemperature T & 108 K is problematic, though, for one quickly\narrives at relativistic temperatures, kT & me c2 , at which most\nof our assumptions and formulae are no longer valid. At these\ntemperatures, it is especially required to include pair production into our equations, which increases the particle number\nin the background plasma while reducing the amount of energy\navailable for the individual particle, thus efficiently limiting the\ntemperature of the system. In addition, the concept of a stable\nisotropic Maxwell-Boltzmann distribution is not well justified\nin these regions (Stepney 1982).\nFor the standard parameters (see table 1), this overheating does not happen (see fig. 7), while for n∗i = 0.8 cm−3 the\nheating processes are too strong to keep the temperature nonrelativistic. The Fig. also demonstrates that the synchrotron\ncontribution to the heating rate is quite small; numerical evaluations show that this process contributes about 10 % of the\nCoulomb heating rate, which is in good agreement with our\nestimate in the preceding section. Finally, the asymptotic cooling is a direct result of the deceleration of the system, which\ndecreases the number of swept up particles (eq. 4). At t = 0,\nwhen there are no non-thermal particles present, the heating\n\n20000\n10000\n0\n\n5000\n\n10000\ntobs [s]\n\n15000\n\n20000\n\nFig. 7. The temperature as a function of time for the standard\nparameters as well as n∗i = 0.8 cm−3 , for which the temperature\nbecomes larger than 109 K, where our model is invalid.\n\nrates equal zero, and the system usually cools down to the stable point at 104 K. It is possible to prevent this with a careful\nchoice of initial parameters, which results in stable temperatures of T = 108 K.\n\n6. Results\n\n6.1. Modifying the initial parameters\nIn the last sections we have seen that the temperature of the\nbackground plasma can be used to estimate the stability of our\nmodel. For this reason, we have made a parameter study to\napproximate the regions in which we get reliable results. We\nhave discovered four different regions: cold (T ≤ 104 K), warm\n(104 K≤ T ≤ 105 K), hot (108 K≤ T ≤ 109 K) and forbidden\n(T > 109 K). The region between 105 K and 108 K is unstable,\nwhich is a result of the specific form of the cooling function.\nThe region between 108 and 109 K is stable only for very specific initial parameters, as outlined in the last section.\nThe particle number densities np and n∗i strongly dominate\nthe system; the different regions in the np −n∗i -plane for the standard parameters (see table 1) are displayed in Fig.8. Another\nparameter which determines the temperature evolution is the\nsize of the system. It turns out that on account of the particle number sweep-up rate (eq.4), which is proportional to the\nsweep-up surface divided by the total volume of the system,\nonly one of the size parameters really contributes to this point,\nwhich can be identified as the average optical path for a generic\nsystem. For the specific disk geometry, this parameter is identical to the thickness d; then for the standard parameters the\nboundary points are\ndcold−warm ≈ 2.1 * 1013 cm\ndwarm−hot ≈ 4.1 * 1013 cm\n\n(56)\n(57)\n\nSince the secondary electrons dominate the heating process\n(see Sect. 5.2), and their production rate can not be treated analytically, these results can not be derived from Fig. 8.\n\n\f10\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\n108 K, although this situation will still be quite rare. Generally,\nthis modification simply produces a break in the temperature\nevolution.\nSecondly, we have investigated the effect of local density\nfluctuations. We have studied a situation in which the system\nperiodically passes through a dense cloud of material, that is\nembedded in low-density gas, where for a single period τ the\nsweep-up rate is\n(\na for t < c\n(59)\nṄ peak (t) =\nb for c < t < τ\n\n10\n9\n\nnp/108 [cm-3]\n\n8\n7\n6\n\ncold\n\nwarm\n\nhot /\n\n5\n\nforbidden\n\n4\n3\n2\n1\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\nni* [cm-3]\n\nFig. 8. The three qualitatively different temperature regions as\na function of the particle densities and the standard parameters\n(T 0 = 104 K). The dotted lines are for Γ0 = 600.\n\nwith a ≫ b and c the fraction of the period where the heating is strong. We have normalized these parameters in a way\nthat the interstellar matter density averaged over a period is\nn∗i . Under this periodically peaked scheme, it is again easier\nto keep the system stable at 108 K without causing overheating\nas described in chapter 5.5.\n\n6.3. Light curves and correlations\nThe initial Lorentz factor Γ(t = 0) modifies the interstellar\nmatter density in the jet frame, ni = Γ(t)n∗i . This in turn modifies the number of particles in the system and therefore the\nheating rate by elastic scattering. However, it does not modify\nthe form of the boundaries of temperature regions in the np −n∗i plane, but only their location. To demonstrate this, in fig. 8 we\nalso display the temperature regions for Γ0 = 600.\nThe observer angle θobs only modifies the observed time required for the system to evolve, so the asymptotic behaviour\nremains unchanged. The magnetic field strength B has practically no influence on the temperature, since the synchrotron\nheating process is negligible.\nAs mentioned earlier, by modifying the initial temperature\nT 0 together with the interstellar matter density n∗i , we are able\nto establish stable 'hot' temperatures. In most cases, however,\nthe initial temperature will not modify the system.\nFrom this we conclude that our model is stable only on a\nrather small region in the initial parameter space. In this case,\nthere are three asymptotically stable temperature regions, and\nit may be possible to fix some of these parameters by observations. In all other cases, the initial assumption of a nonrelativistic thermal component in the jets breaks down, although the sweep-up mechanism itself remains valid.\n\n6.2. Time-dependent variations of free parameters\nIn a real situation the extragalactical matter density n∗i is not\nconstant over long timescales and distances. The plasma in the\njet may cross dense clouds of hydrogen or enter a local fluctuation. For this reason we have investigated the temperature evolution under some simple modifications of our sweep-up rate.\nFirst, we have considered a simple step in the ambient matter density,\nṄcld = Ṅ(1 + aΘ(t1 − t)).\n\n(58)\n\nSuch a situation may possibly be found when the jet leaves the\nimmediate host galaxy and enter the intergalactic medium. In\nthis case it is slightly easier to produce stable temperatures at\n\nWe have then calculated light curves for several different energies, which we present in Fig. 9 for the periodically peaked\ninjection and the standard parameters. Unlike the other photon\nspectra presented in this report, these curves are taken in the\nobserver frame, in which, on account of the deceleration of the\njet, the frequency corresponding to a fixed jet-frame frequency\nvaries with time, although the modification usually is small.\nWe see that the variability is visible, but that the average\nbehaviour of the system remains unchanged. Additionally, the\nvariability only affects the optical thick region, which is a result\nof temperature variations. In the optical thick region, we have\nI ∝ j/α (eq. 25) and α ≈ αthermal , which in turn causes Fν to depend on the temperature. Since the heating rate is proportional\nto the total number of energetic particles, a sudden increase in\nthis number causes a similar modification of the temperature of\nthe jet plasma, which again modifies the optical thick emission.\nBecause of j ≈ jsy , the optical thin emission (see eq. 25) does\nnot demonstrate a similar behaviour. For this reason our model\nis able to reproduce different variability in different freqnency\nbands.\nNext, we have calculated correlation coefficients for this injection profile, using light curves in the observer frame between\nthe infrared, optical and ultraviolet, from the plasma frequency\nup to a few 10 eV, with small and large distances between the\nconsidered frequencies.\nIt turns out that the lightcurves at different frequencies are\nalmost perfectly correlated (> 0.9), even if we compare freefree-dominated with synchrotron-dominated parts of the spectrum. To understand this behaviour, we first note that the electron distribution is dominated by the diffusive escape process\n(eq. 8), while the continuous losses are too inefficient. For\nhigh-energy electrons the particle spectrum is exclusively determined by the Lorentz factor of the jet, Γ. For this reason\nall light curves produced by the electrons are highly correlated\nwith each other, even between the free-free and synchrotron\nprocesses, since the free-free emission depends on the temperature, which again is determined by the high-energy electrons,\nsimilar to the synchrotron emission. Given that the optically\n\n\fM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\n7.2. The initial conditions\n\n2.5\n2\nlog10 Fν [eV/s cm2 eV sr]\n\n11\n\n1.5\n1\n0.5\n0\nEobs=0.1 eV, Ejet=0.32 meV, multiplied by 30\n-0.5\n\nEobs=1 eV, Ejet=3.2 meV\nEobs=32 eV, Ejet=0.1 eV\n\n-1\n0\n\n5000\n\n10000 15000 20000 25000 30000 35000\ntobs [s]\n\nFig. 9. Light curves for three different energies in the observer\nframe. Here we have adopted the periodic peak injection introduced in eq. 59 with the parameters a/b = 50, a period of\nτ = 1000 s observed time and c = 100 s, i. e. 10% of the period time. Significant variations occur exclusively in the optical\nthick regime; the redshift of the source has been set to z = 0.5.\n\nthin synchrotron emission shows only a very weak response to\nthe variations in the injection rate, most of the correlation signal is presumably caused by the common secular trend in all\nlight curves that is caused by the deceleration of the jet.\n\n7. Possible corrections\nIn this section we briefly discuss possible further aspects of the\nproblems investigated in this paper.\n\n7.1. The electrostatic instability\nRecently, Pohl et al. (2002) have investigated the electrostatic\ninstability in a relativistic beam of electrons and protons and\nits impact on our model. Their conclusion was that the sweepup spectrum effectively gets modified from a peak structure at\nγ = Γ to a plateau distribution up to γ = Γ, while keeping the\nnumber of collected particles and the low-energy photon spectrum unchanged. The energy lost in this process may contribute\nto the heating of the background plasma, but there is no reliable\nestimate available of the exact amount of energy transferred.\nObservations hint that only a tiny fraction of the total energy\nlost by this mechanism can ever contribute to the heating.\nSince this process in principle involves a huge amount of\nenergy, it might dramatically change the evolution of the temperature. However, Pohl et al. (2002) have only considered the\ninitial situation of a cold electron-proton beam penetrating cold\nthermal plasma. The presence of isotropic energetic particles\nshould strongly reduce the growth rate of electrostatic turbulence, so that at least in a quasi-steady state heating by damping of electrostatic waves should be much less severe than suggested by the asymptotic energy loss of the incoming particle\nbeam.\n\nCurrently, our initial conditions assume that there are no nonthermal particles present. Although the mechanism responsible for creation and stability of the jets is not completely understood (Urry & Padovani 1995; Begelman et al. 1984), it is\nlikely that there is no time zero, at which a plasma cloud is\nrelativistically expelled without containing energetic particles.\nBecause of this, the start-up phase visible in our results would\nbe a consequence of our particular treatment of the problem,\nand not a physical phenomenon.\nIn section 6 we have found that only a few of our parameters significantly modify the asymptotic behaviour. The average\nsystem size only affects the observed photon spectra around the\nturn-over frequency, where τ = 1, and the particulars of the geometry are unknown anyway. The initial particle distributions\nwon't modify the asymptotic temperature evolution either, because the presence of a moderate amount of non-thermal particles only modifies the time required to reach a balance of gains\nand losses. Variations of the matter densities have already been\ninvestigated in section 6. All other initial parameters do not\nmodify the general behaviour of the system.\n\n8. Summary and conclusions\nIn this paper we have investigated the evolution of thermal\nplasma in AGN jets and its impact on the optical-to-infrared\nphoton emission. In matter-dominated jets sizable quantities\nof gas should exist, in particular in the compression zones\nnear the collision fronts that are an implicite ingredient of\nFermi-type particle acceleration scenarios. We conduct our\nstudy in the framework of the channeled outflow model of\n(Pohl & Schlickeiser 2000), who have studied the kinetic relaxation of particles that have traversed a parallel collision front\nfrom the upstream to the downstream region. This pick-up\nprocess occurs due to scattering off low-wavenumber plasma\nwaves that the picked-up particles generate themselves through\nstreaming instabilities. The calculations, thus, describe the first\nhalf-cycle of the standard shock acceleration process for relativistic, collisionless flows. If the outflow plasma propagating\nthrough the jet is dense, the downstream region provides a target for the ultra-relativistic protons to interact with and produce\nradiation through various leptonic and hadronic emission channels.\nNon-relativistic thermal gas in AGN jets noticably contributes to the optical depth at radio to infrared frequencies, and\nmuch less to the emission, with an efficiency that is strongly\ntemperature-dependent. Assuming that this plasma is in a thermal equilibrum, we have calculated the temperature evolution\nresulting from the competition of radiative cooling and heating by Coulomb processes and absorption of non-thermal emission.\nSimilar to the well-known results for the structure of the\ninterstellar medium in Galaxies, we find that the stable regimes\nexist for temperatures between 104 K and 105 K, and around\n108 K. Below 104 K the ionization fraction will be small, and\nthe optical depth is modified. Above 108 K, the thermal parti-\n\n\f12\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\na\n\ncles reach relativistic velocities, for which our model begins to\nbreak down.\nIn the model of Pohl & Schlickeiser (2000), short-time\nvariability at low energies arises on account of density fluctuations in the upstream medium. Consequently the plasma temperature will vary, and so will the thermal absorption coefficient. The observable flux of low-frequency emission is thus\nmodulated by the temperature evolution of the thermal gas, and\nit can therefore display very complicated variability behaviour.\nFor simple density profiles of the interstellar gas in AGN host\ngalaxies, we have calculated the temperature response of the\nthermal gas in the jet, and have then derived light curves at different frequencies. For sufficiently long observing times, all of\nthese light curves turn out to be strongly correlated with each\nother, independent of the proton injection scheme, only on account of the deceleration of the jet.\nAcknowledgements. Partial support by the Bundesministerium für\nBildung und Forschung through DESY, grant 05 CH1PCA6, is gratefully acknowledged.\n\nAppendix A: Solving the radiation transport\nequation with the exact cylinder geometry\nThe most general solution to the radiation transport equation\n(23) is\nZ\nIν = S ν dA(1 − exp(−τ(x, Ω))\n(A.1)\nwhere the optical thickness depends on the emission point x\nand the emission direction Ω. The optical thickness needs to be\ncalculated with respect to the geometry of the system. In the\ncase of the cylinder geometry this expression can be evaluated,\nwith several one-dimensional integrals remaining which must\nbe treated numerically.\nTo solve equation A.1, we treat the emitting surface in\nCartesian coordinates. (If we used polar coordinates, we would\nend up with two-dimensional numerical integrals.) We define\nour coordinate system as presented in fig.A.1. Then the problem reduces to an integral over all impact parameters a and an\nintegral over all 'slices' x = −w(a)..w(a). We will evaluate the\nintegrals over the 'slices' first.\nIt is useful to define the following quantities, related to the\nselected coordinate system (see fig. A.1), which follow from\nelemental trigonometry.\nθc =\nac (θ) =\nw(a) =\ns(θ) =\n\n2r\narctan\nd\np\n2\nr − d2 /4 tan2 θ\n√\n2 r 2 − a2\nd tan θ\n\n(A.2)\n(A.3)\n(A.4)\n(A.5)\n\nThe angle θc is the critical emission angle, above which some\ncontributions to the integral vanish. ac (θ) is the critical impact\nparameter where the mathematical form of the slices changes\n(see fig. A.2 for a sketch of this). Above θ = θc c this expression\nno longer makes any sense. w(a) is the 'width' of the system for\nan impact parameter a and determines the integration limits for\n\nac ( θ)\n\ns(a)\n\nx\n\nw(a)\nemission direction\n\nFig. A.1. Definitons used in the text to calculate the integral\nover the emitting surface. Top view.\nthe variable x. Finally s(θ) is used to divide the slice integral in\nthe two different regions called I and II in fig. A.2. With these\nconventions the integral splits in\nIν = II+II + IIII+IV\nZ r\nZ ac\nS 1 (θ)da +\nS 2 (θ)da)\n= 2(\n0\n\n(A.6)\n(A.7)\n\nac\n\nwhere S i are the two types of slices that are possible in the\nsystem (see fig. A.2).\nThe first type of slice is the inner part of the disk (for small\na), where some of the emitted photons (I) see a constant path\nlength, where only the border region (II) is modified. Then the\nintegral over S 1 can be solved exactly, and we get\nS 1 = (w(a) − s(θ)) cos θ(1 − exp(−τd / cos θ))\nZ s(θ) cos θ\nd\nx\n(1 − exp(α\n+2\n))dx\ncos θ s(θ) cos θ\n0\n= (1 − exp(−τd / cos θ)) *\nsin θ cos θ\n)\n((w(a) − s(θ)) cos θ − 2\nα\n+2s(θ) cos θ.\n\n(A.8)\n\n(A.9)\n\nTo solve the integral over x we have used the parameterization\nτ(x) = τmax * x/xmax , with 0 ≤ x ≤ xmax (see fig.A.3). Inserting\nthis expression in A.7 and integrating over a gives us\nI1 = 2(1 − exp(−τd / cos θ)) *\n\n(cos θ(ac w(ac )/2 + r2 arcsin ac /r) − ac d sin θ\nac sin θ cos θ\n−2\n)\nα\n+4ac d sin θ ≡ II+II\n\n(A.10)\n\nwhich is the exact solution of the radiation transport equation\nfor the region defined by a < ac .\nThe second type of slice, S 2 contains expressions that can\nnot be solved analytically. The general structure of the integrals\n\n\fM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\na < ac\n\n13\n\nw(a)\n\nθ\n\nw(a)\n\nI\n\nθ\n\nd\n\napparent emitting\nsurface (symmetry)\n\nh(a)\nθ\n\nw(a)cos(t)\n\nII\na > ac\n\nθ\n\nd−h(a)\nw(a)/sin(t)\n\na = ac\nθ\n\nd\n\nx/(w(a)sin(t)), x=0..w(a)sin(t)\n\nθ\n\nIII\nIV\n\nθ\n\nII=IV\nθ\n\nw(a)\n\ns(a) cos(t)\n\nθ\n\ns(a)\n\napparent emitting\nsurface (symmetry)\n\nd/cos(theta)\n\nd\n\nsin θ cos θ\n).\nα\n\n(A.12)\n\nInserting this in eq. A.7 results in non-analytical integrals,\n\nFig. A.2. Possible configurations of the integral over x as a\nfunction of the other parameters.\n\nphoton emission\n\nFig. A.4. Detailed view of the geometry in the x-direction for\nlarge 'impact parameters' a.\n((d − h(a)) sin θ − 2\n\nw(a)\n\nw(a)−s(a)\n\nphoton emission\n\nd\n\ns(a)\nx/(s(a) cos(t)), x=0..s(a) cos(t)\n\nac\n− ac w(ac ))\nr\n2 cos θ\n)\n+2 sin θ(r − ac )(d −\nα\nZ r\nτw(a)\n+2 cos θ\nw(a) exp(−\n)da)\n(A.13)\nsin(θ)\nac\nZ r\nτw(a)\ncos θ\nexp(−\n)\n)da ≡ IIII+IV\n−2 sin θ(d − 2\nα\nsin(θ)\nac\n\nI2 = cos θ(2 arccos\n\nThe\nremaining\nintegrals\nare\nof\nthe\nform\nR\n√\nexp(− 1 − a2 ) f (a)da, which can only be solved in\nvery special cases, such as f (a) = a. However, these integrals\ncan be evaluated numerically in a fast and reliable way with\nthe use of simple quadrature formulae of low order (see, e.g.\nPress et al. (1986-2001)).\nFinally, for θ > θc the entire contribution I1 vanishes, since\nin this case all slices are of the type '2', where all photons emitted from the top surface will leave the system through the side.\nSo the total photon intensity emitted by a plasma in the form of\na thin disk is\n\nFig. A.3. Detailed view of the geometry in the x-direction for\nsmall 'impact parameters' a.\n\nI(θ < θc ) = I1 (ac (θ)) + I2 (ac (θ))\nI(θ > θc ) = I2 (ac = 0).\n\ninvolved here is very similar to the S 1 contributions,\nZ w(a) cos θ\nw(a)\nx\n(1 − exp(−α\nS2 = 2\n))dx\nsin\nθ\nw(a)\ncos θ\n0\n+(d − h(a)) sin θ(1 − exp(−τw(a) / sin θ))\n= 2w(a) cos θ\n\nAppendix B: Solving the radiation transport\nequation with the exact square box geometry\n\n+(1 − exp(−τw(a) / sin θ)) *\n\n(A.11)\n\n(A.14)\n(A.15)\n\nThe exact solution of the radiation transport equation takes a\nmuch simpler expression if one uses a box geometry. In fact,\nfor this geometry all integrals are of the same type as the region\ncalled '1' in the last appendix, which does not involve any kind\nof numerical integrations. To keep the volume of the system\n\n\f14\n\nconstant, we use a =\nsurfaces and get\n\nM. Siewert et al.: The impact of thermal gas in AGN jets on the low-frequency emission\n\n√\nπr for the quadratic top and bottom\n\nIbox (θ < θc ) = a(1 − exp(τd / cos θ)) *\nsin θ cos θ\n)\n(d sin θ − a cos θ − 2\nα\n+2ad sin θ\nIbox (θ > θc ) = a(1 − exp(τa / sin θ)) *\nsin θ cos θ\n)\n(a cos θ − d sin θ − 2\nα\n+2a2 cos θ.\n\n(B.1)\n\n(B.2)\n\nReferences\nBegelman, M. C., Blandford, R. D., & Rees, M. J. 1984, Rev.\nMod. Phys., 56, 255\nButler, S. & Buckingham, M. 1962, Phys. Rev., 126, 1\nCapella, A., Sukhatme, U., Tan, C.-I., & Tran, T. V. J. 1994,\nPhys. Rep, 236, 227\nCorbel, S., Fender, R., Tzioumis, A., et al. 2002, Science, 298,\n196\nCrusius, A. & Schlickeiser, R. 1988, A&A, 196, 327\nDalgarno, A. & McCray, R. A. 1972, Ann. Rev. A&A, 10, 375\nDermer, C. D. & Gehrels, N. 1995, Astrophys. J., 441, 270\nElliot, J. D. & Shapiro, S. L. 1974, Astrophys. J., 192, L3\nEngel, R., Ranft, J., & Roesler, S. 1997, Phys. Rev. D, 55, 6957\nFerrari, A., Sala, P. R., Ranft, J., & Roesler, S. 1996a, Z. Phys.\nC, 70, 413\n-. 1996b, Z. Phys. C, 71, 75\nGeorganopoulos, M. & Kazanas, D. 2003, Astrophys. J., 594,\nL27\nHaug, E. 1988, A&A, 191, 181\nHayakawa, S. 1969, Cosmic Ray Physics (Wiley-Interscience)\nHoman, D. C., Lister, M. L., Kellermann, K. I., et al. 2003,\nAstrophys. J., 589, L9\nHoman, D. C., Wardle, J. F. C., Cheung, C. C., Roberts, D. H.,\n& Attridge, J. M. 2002, Astrophys. J., 4580, 742\nJauch, J. M. & Rohrlich, F. 1976, The Theory of Photons and\nElectrons (Springer-Verlag)\nKonopelko, A., Mastichiadis, A., Kirk, J., Jager, O. D., &\nStecker, F. 2003, ApJ, 597, 851\nMöhring, H.-J. & Ranft, J. 1991, Z. Phys. C, 52, 643\nMöhring, H.-J., Ranft, J., Merino, C., & Pajares, C. 1993, Phys.\nRev. D, 47, 4142\nMukherjee, R., Bertsch, D. L., Bloom, S. D., et al. 1997,\nAstrophys. J., 490, 116\nPacholczyk, A. G. 1970, Radio Astrophysics (Freeman, San\nFrancisco, CA)\nPohl, M., Lerche, I., & Schlickeiser, R. 2002, A&A, 383, 309\nPohl, M. & Schlickeiser, R. 2000, A&A, 354, 395\nPress, W. H., Teukolsky, W. A., Vetterling, W. T., & Flannery,\nB. P. 1986-2001, Numerical Recipes in Fortran (Cambridge\nUniversity Press)\nRanft, J., Capella, A., & Trân, T. V. J. 1994, Phys. Lett B, 320,\n346\nRanft, J. & Roesler, S. 1994, Z. Phys. C, 62, 329\n\nRaymond, J. C., Cox, D. P., & Smith, B. W. 1976, Ap. J., 204,\n290\nRoesler, S., Engel, R., & Ranft, J. 1998, Phys. Rev. D, 57, 2889\nRybicki, R. B. & Lightman, A. P. 1985, Radiative processes in\nastrophysics (Jon Wiley & Sons)\nSchlickeiser, R. 2002, Cosmic Ray Astrophysics (SpringerVerlag)\nStepney, S. 1982, Mon. Not. R. Astr. Soc., 202, 467\nUrry, C. M. & Padovani, P. 1995, PASP, 107, 803\nVainio, R., Pohl, M., & Schlickeiser, R. 2004, A&A, 414, 463\nVermeulen, R. C. & Cohen, M. H. 1994, Astrophys. J., 430,\n467\n\n\f"}