{"id": "http://arxiv.org/abs/astro-ph/0406655v1", "guidislink": true, "updated": "2004-06-29T16:02:31Z", "updated_parsed": [2004, 6, 29, 16, 2, 31, 1, 181, 0], "published": "2004-06-29T16:02:31Z", "published_parsed": [2004, 6, 29, 16, 2, 31, 1, 181, 0], "title": "Hubble Space Telescope Science Metrics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0406479%2Castro-ph%2F0406057%2Castro-ph%2F0406277%2Castro-ph%2F0406653%2Castro-ph%2F0406376%2Castro-ph%2F0406340%2Castro-ph%2F0406087%2Castro-ph%2F0406575%2Castro-ph%2F0406558%2Castro-ph%2F0406530%2Castro-ph%2F0406040%2Castro-ph%2F0406003%2Castro-ph%2F0406273%2Castro-ph%2F0406059%2Castro-ph%2F0406495%2Castro-ph%2F0406229%2Castro-ph%2F0406145%2Castro-ph%2F0406522%2Castro-ph%2F0406141%2Castro-ph%2F0406312%2Castro-ph%2F0406307%2Castro-ph%2F0406486%2Castro-ph%2F0406077%2Castro-ph%2F0406445%2Castro-ph%2F0406065%2Castro-ph%2F0406444%2Castro-ph%2F0406626%2Castro-ph%2F0406056%2Castro-ph%2F0406611%2Castro-ph%2F0406195%2Castro-ph%2F0406168%2Castro-ph%2F0406593%2Castro-ph%2F0406055%2Castro-ph%2F0406426%2Castro-ph%2F0406332%2Castro-ph%2F0406144%2Castro-ph%2F0406354%2Castro-ph%2F0406624%2Castro-ph%2F0406678%2Castro-ph%2F0406032%2Castro-ph%2F0406078%2Castro-ph%2F0406148%2Castro-ph%2F0406226%2Castro-ph%2F0406270%2Castro-ph%2F0406230%2Castro-ph%2F0406097%2Castro-ph%2F0406275%2Castro-ph%2F0406067%2Castro-ph%2F0406031%2Castro-ph%2F0406072%2Castro-ph%2F0406620%2Castro-ph%2F0406515%2Castro-ph%2F0406488%2Castro-ph%2F0406338%2Castro-ph%2F0406101%2Castro-ph%2F0406489%2Castro-ph%2F0406119%2Castro-ph%2F0406542%2Castro-ph%2F0406151%2Castro-ph%2F0406163%2Castro-ph%2F0406069%2Castro-ph%2F0406110%2Castro-ph%2F0406157%2Castro-ph%2F0406435%2Castro-ph%2F0406129%2Castro-ph%2F0406147%2Castro-ph%2F0406600%2Castro-ph%2F0406107%2Castro-ph%2F0406434%2Castro-ph%2F0406639%2Castro-ph%2F0406561%2Castro-ph%2F0406590%2Castro-ph%2F0406299%2Castro-ph%2F0406657%2Castro-ph%2F0406614%2Castro-ph%2F0406422%2Castro-ph%2F0406089%2Castro-ph%2F0406071%2Castro-ph%2F0406606%2Castro-ph%2F0406130%2Castro-ph%2F0406033%2Castro-ph%2F0406401%2Castro-ph%2F0406372%2Castro-ph%2F0406429%2Castro-ph%2F0406527%2Castro-ph%2F0406325%2Castro-ph%2F0406113%2Castro-ph%2F0406497%2Castro-ph%2F0406603%2Castro-ph%2F0406330%2Castro-ph%2F0406554%2Castro-ph%2F0406450%2Castro-ph%2F0406189%2Castro-ph%2F0406621%2Castro-ph%2F0406462%2Castro-ph%2F0406158%2Castro-ph%2F0406588%2Castro-ph%2F0406404%2Castro-ph%2F0406352%2Castro-ph%2F0406474%2Castro-ph%2F0406655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hubble Space Telescope Science Metrics"}, "summary": "Since its launch in April 1990, the Hubble Space Telescope (HST) has produced\nan increasing flow of scientific results. The large number of refereed\npublications based on HST data allows a detailed evaluation of the\neffectiveness of this observatory and of its scientific programs. This paper\npresents the results of selected science metrics related to paper counts,\ncitation counts, citation history, high-impact papers, and the most productive\nprograms and most cited papers, through the end of 2003. All these indicators\npoint towards the high-quality scientific impact of HST.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0406479%2Castro-ph%2F0406057%2Castro-ph%2F0406277%2Castro-ph%2F0406653%2Castro-ph%2F0406376%2Castro-ph%2F0406340%2Castro-ph%2F0406087%2Castro-ph%2F0406575%2Castro-ph%2F0406558%2Castro-ph%2F0406530%2Castro-ph%2F0406040%2Castro-ph%2F0406003%2Castro-ph%2F0406273%2Castro-ph%2F0406059%2Castro-ph%2F0406495%2Castro-ph%2F0406229%2Castro-ph%2F0406145%2Castro-ph%2F0406522%2Castro-ph%2F0406141%2Castro-ph%2F0406312%2Castro-ph%2F0406307%2Castro-ph%2F0406486%2Castro-ph%2F0406077%2Castro-ph%2F0406445%2Castro-ph%2F0406065%2Castro-ph%2F0406444%2Castro-ph%2F0406626%2Castro-ph%2F0406056%2Castro-ph%2F0406611%2Castro-ph%2F0406195%2Castro-ph%2F0406168%2Castro-ph%2F0406593%2Castro-ph%2F0406055%2Castro-ph%2F0406426%2Castro-ph%2F0406332%2Castro-ph%2F0406144%2Castro-ph%2F0406354%2Castro-ph%2F0406624%2Castro-ph%2F0406678%2Castro-ph%2F0406032%2Castro-ph%2F0406078%2Castro-ph%2F0406148%2Castro-ph%2F0406226%2Castro-ph%2F0406270%2Castro-ph%2F0406230%2Castro-ph%2F0406097%2Castro-ph%2F0406275%2Castro-ph%2F0406067%2Castro-ph%2F0406031%2Castro-ph%2F0406072%2Castro-ph%2F0406620%2Castro-ph%2F0406515%2Castro-ph%2F0406488%2Castro-ph%2F0406338%2Castro-ph%2F0406101%2Castro-ph%2F0406489%2Castro-ph%2F0406119%2Castro-ph%2F0406542%2Castro-ph%2F0406151%2Castro-ph%2F0406163%2Castro-ph%2F0406069%2Castro-ph%2F0406110%2Castro-ph%2F0406157%2Castro-ph%2F0406435%2Castro-ph%2F0406129%2Castro-ph%2F0406147%2Castro-ph%2F0406600%2Castro-ph%2F0406107%2Castro-ph%2F0406434%2Castro-ph%2F0406639%2Castro-ph%2F0406561%2Castro-ph%2F0406590%2Castro-ph%2F0406299%2Castro-ph%2F0406657%2Castro-ph%2F0406614%2Castro-ph%2F0406422%2Castro-ph%2F0406089%2Castro-ph%2F0406071%2Castro-ph%2F0406606%2Castro-ph%2F0406130%2Castro-ph%2F0406033%2Castro-ph%2F0406401%2Castro-ph%2F0406372%2Castro-ph%2F0406429%2Castro-ph%2F0406527%2Castro-ph%2F0406325%2Castro-ph%2F0406113%2Castro-ph%2F0406497%2Castro-ph%2F0406603%2Castro-ph%2F0406330%2Castro-ph%2F0406554%2Castro-ph%2F0406450%2Castro-ph%2F0406189%2Castro-ph%2F0406621%2Castro-ph%2F0406462%2Castro-ph%2F0406158%2Castro-ph%2F0406588%2Castro-ph%2F0406404%2Castro-ph%2F0406352%2Castro-ph%2F0406474%2Castro-ph%2F0406655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Since its launch in April 1990, the Hubble Space Telescope (HST) has produced\nan increasing flow of scientific results. The large number of refereed\npublications based on HST data allows a detailed evaluation of the\neffectiveness of this observatory and of its scientific programs. This paper\npresents the results of selected science metrics related to paper counts,\ncitation counts, citation history, high-impact papers, and the most productive\nprograms and most cited papers, through the end of 2003. All these indicators\npoint towards the high-quality scientific impact of HST."}, "authors": ["Georges Meylan", "Juan P. Madrid", "Duccio Macchetto"], "author_detail": {"name": "Duccio Macchetto"}, "author": "Duccio Macchetto", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/423227", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0406655v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0406655v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "accepted for publication in PASP", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0406655v1", "affiliation": "STScI", "arxiv_url": "http://arxiv.org/abs/astro-ph/0406655v1", "journal_reference": null, "doi": "10.1086/423227", "fulltext": "Hubble Space Telescope Science Metrics\nGeorges Meylan1 , Juan P. Madrid, Duccio Macchetto1\n\narXiv:astro-ph/0406655v1 29 Jun 2004\n\nSpace Telescope Science Institute, 3700 San Martin Drive, Baltimore, MD 21218\ngmeylan@stsci.edu, madrid@stsci.edu, macchetto@stsci.edu\n\nABSTRACT\nSince its launch in April 1990, the Hubble Space Telescope (HST) has produced an increasing\nflow of scientific results. The large number of refereed publications based on HST data allows\na detailed evaluation of the effectiveness of this observatory and of its scientific programs. This\npaper presents the results of selected science metrics related to paper counts, citation counts,\ncitation history, high-impact papers, and the most productive programs and most cited papers,\nthrough the end of 2003. All these indicators point towards the high-quality scientific impact of\nHST.\nSubject headings: Telescopes:(Hubble Space Telescope)\n\n1.\n\nlected at large telescopes. Benn & Sánchez (2001)\nestimated the participation of different facilities\nin the most cited papers in astronomy from 1991\nto 1998. Crabtree & Bryson (2001) examined in\ndetail the productivity and impact of the CanadaFrance-Hawaii Telescope (CFHT).\nImprovements in databases for paper and citation counts have prompted the Space Telescope\nScience Institute (STScI) to develop a new standard methodology to define the scientific impact\nof HST through quantitative and objective metrics. The aim is twofold: (i) to monitor the use of\nthe telescope in order to improve and maximize its\nscientific output through adjustments in the process of the allocation of observing time, and (ii) to\nreport to the funding agencies, to the various governing committees, and to the astronomical community. See Meylan et al. (2003) for a succinct\npresentation of some of our metrics results.\nThere are two straightforward and relevant\nmeasures of the effectiveness of a telescope: the\nnumber of refereed papers based on data obtained\nby the telescope, and the citation count for those\npapers. It is obvious that the full scientific impact\nof a facility may also be evaluated through other\nmetrics, such as the number of press releases, the\n\"most important\" discoveries, etc. The aim of this\npaper is to show the results of the first two met-\n\nIntroduction\n\nThe Hubble Space Telescope (HST), orbiting\nthe Earth at an altitude of about 600 kilometers, is the product of an international collaboration between the National Aeronautics and Space\nAdministration (NASA) and the European Space\nAgency (ESA). Its position high above any atmospheric turbulences and the quality of its instruments provide the astronomical community with\nobservation of excellent resolution and sensitivity\nin the wavelength domains of the ultra-violet, visible, and near infrared.\nHST has produced an increasing flow of scientific data since its launch by the Space Shuttle Discovery, in April 1990. After more than a decade of\nHubble observations, the large number of publications based on HST data provides a statistically\nsound basis to determine the scientific effectiveness of this observatory.\nThere are numerous previous studies about science metrics in astronomy : Abt (1981) studied\nthe behavior of citation histories for papers published in 1961. Trimble (1995) analyzed papers\nand citation counts for papers based on data col1 Affiliated with the Space Telescope Division of the European Space Agency, ESTEC, Noordwijk, The Netherlands\n\n1\n\n\frics (paper and citation counts), both objective\nquantities which could be reproduced and verified\nby other authors.\nThe content of this paper is the following: Section 2 describes the way we search and identify refereed papers using HST data, Section 3 presents\nthe statistics on the numbers of papers and their\ncitations, Section 4 defines and discusses the socalled High Impact Papers. Sections 5 and 6\npresent some highlights of the science produced\nby HST through the top ten most productive programs and top ten most cited HST papers. This\npaper is devoted to HST publications only; comparisons with other telescopes will be done in the\nnear future through collaborations with those facilities.\n2.\n\nHST) OR (WIDE AND FIELD AND PLANETARY AND CAMERA) OR FGS OR (FINE\nAND GUIDANCE AND SENSORS) OR HSP OR\n(HIGH AND SPEED AND PHOTOMETER) OR\nFOC OR (FAINT AND OBJECT AND CAMERA) OR FOS OR (FAINT AND OBJECT AND\nSPECTROGRAPH) OR HRS OR GHRS OR\n(GODDARD AND HIGH AND RESOLUTION\nAND SPECTROGRAPH) OR STIS OR (SPACE\nAND TELESCOPE AND IMAGING AND SPECTROGRAPH) OR NICMOS OR (NEAR AND\nINFRARED AND CAMERA AND MULTI AND\nOBJECT AND SPECTROMETER) OR ACS\nOR (ADVANCED AND CAMERA AND SURVEYS)\".\nThe above query produces a list of papers,\nwith sometimes wrongs hits (HST stands also for\nHawaiian Standard Time!). Each paper is, then,\ndownloaded and read in order to confirm whether\nit is a genuine HST paper. Since the ADS allows\nto query only the abstract of a paper and not its\nfull text, hard copies of all refereed journals are\nsearched manually by the staff of the STScI Library.\nFor each identified HST paper, we search for\nthe program(s) ID(s) of the HST data used. A\nlink is then established in MAST, the Multimission Archive at Space Telescope, between the\npaper and the program(s). There is at least\none program ID for each HST paper. For each\nHST program, the list of publications that it\nhas generated is accessible on-line to the astronomical community through the MAST website\nhttp://archive.stsci.edu/hst/search.php by\nentering the proposal-program ID.\nOur list of papers recognized as using HST data\nis publicly available on-line and can be accessed by\nthe astronomical community through the ADS at\nhttp://adsabs.harvard.edu/, by activating the\nHST filter under select references in. Each\nmonth, the ADS receives from MAST, our updated list of publications, in an automatic and\nelectronic way.\nIt is worth mentioning that the amount of work\nrequired to identify a paper and link it to a program is, sometimes, very onerous. We have encountered many stumbling blocks, often created\nwhen authors provide the wrong program IDs. We\nhave even identified a few papers which wrongly\nclaimed to be based on HST data.\n\nIdentification process of Refereed Papers Using HST Data\n\nThere have been various definitions of what\nconstitutes \"a paper based on HST data\". Some of\nthese definitions require that, of the total amount\nof observational data used in a paper, at least 50 %\nof them originate from HST. Others do not include papers based on archival data. Since it is\nimpossible to define precisely and consistently the\nfraction of HST data used in a given paper, we\nadopt the simplest possible definition: \"a paper\nbased on HST data\" is a paper benefiting directly\nfrom HST observation. Such a paper must contain at least: an HST image, an HST spectrum,\nor new numbers derived directly from HST data.\nAll papers based on data retrieved from the HST\narchives are included. We take into account papers\nusing archival data either for reanalysis or for new\nscientific aims. This broad definition has also been\nadopted by other observatories (e.g. ESO), but it\nhas to be clearly stated if the numbers are to be\nused for comparisons amongst different facilities,\nwhich is not our aim in this paper.\nMost of the information we use comes directly\nfrom the ADS, the NASA Astrophysics Data System hosted in Cambridge, USA, at the HarvardSmithsonian Center for Astrophysics (see Kurtz\net al. 2000).\nWe run a boolean logic query on the ADS with\nthe following search string: \"HST OR (HUBBLE\nAND SPACE AND TELESCOPE) OR WFPC\nOR WFPC1 OR WFPC2 OR (WF AND PC AND\n\n2\n\n\fIn order to test the completeness of our list of\nrefereed papers, we contacted all of the PIs of programs in Cycles 4 and 5 for which we could not\nfind any refereed publications arising from their\ndata and the PIs confirmed that there were no additional papers. However we expect that a few\npapers may have been missed by our search, but\nthe number must be very small, certainly less than\na few percent.\n3.\n\nexplained by the regular servicing missions that\nmaintain state-of-the-art technology for its scientific instruments and spacecraft systems. The rate\nof production of refereed papers reflects the increase in the \"discovery space\" provided by the\nnew scientific instruments deployed in each servicing mission.\n3.2.\n\nThe numbers of refereed papers published per\nyear for all the programs of a given cycle provide\nan interesting metric. Fig. 2 presents such information for Cycles 1 and 2, Cycles 3 and 4, Cycles 5\nand 6, and Cycles 7 and 8.\nIn the upper-left panel (Cycles 1 and 2), the\ninitial increase of productivity during the first 3-4\nyears culminates in a peak, which is followed by\na slow decrease. Then, the productivity stabilizes\nat a level of about 20-30 papers per year, 10-12\nyears after the beginning of these cycles.\nIn the upper-right panel, there is an obvious\nmajor difference between Cycles 3 and 4. The high\nproductivity of Cycle 4 when compared with Cycle 3 is a direct consequence of the first servicing\nmission which corrected the spherical aberration\nof the primary mirror with the installation of new\n\nPaper and Citation Counts Metrics\n\nMost of the HST refereed papers (about 90 %)\nare published in the five major refereed journals,\nviz., the Astrophysical Journal (ApJ), the Astronomical Journal (AJ), Astronomy and Astrophysics (A&A), the Monthly Notices of the Royal\nAstronomical Society (MNRAS), and the Publications of the Astronomical Society of the Pacific\n(PASP). We, of course, also count all papers in\nthe other refereed journals, such as Nature and\nScience. In this paper, we take into account only\nrefereed publications published by the end of December 2003.\n3.1.\n\nPaper Counts per Cycle\n\nPaper Counts per Year\n\nThe number of refereed papers based on HST\ndata is given in Fig. 1 as a function of the year\nof publication. Hubble is an extremely productive telescope: between its launch in April 1990\nand the end of 2003, it has produced data directly used in 4,116 refereed papers. Following a\nstrong and regular increase of publications during\nthe first eight years, the number of papers continued to increase, although at a slower pace, during\nthe last five years, to reach a value of 502 for the\nyear 2003.\nThe percentage of HST papers published in\nthe aforementioned five major journals, has grown\nfrom 1% in 1991 to 7% in 2003. Some special issues of the Astrophysical Journal have been dedicated to HST papers only: the first such issue\nwas published in March 1991 with data from the\nfirst generation of instruments, while the last such\nissue, devoted to papers based on data from the\nAdvanced Camera for Surveys (ACS), appeared\nin January 2004 (the papers in the latter issue are\nnot included in this study).\nFourteen years after its launch, HST continues\nto have an increasing productivity, which can be\n\nFig. 1.- Numbers of refereed papers based on\nHST data as a function of the year of publication.\n\n3\n\n\finstruments. The significant increase in data quality triggered a burst in publications using the significantly improved performance.\nThis high level of scientific output has continued to increase since then, as shown in Fig. 2\nlower-left panel for Cycles 5 and 6 and lower-right\npanel for Cycles 7 and 8. Each cycle has a peak\nin productivity of about 180 papers reached about\n3-4 years after its beginning.\n\nthe ACS for Advanced Camera for Surveys. The\nFOC, GHRS, HSP, FOS, and WFPC are decommissioned instruments, while FGS, STIS, NICMOS, WFPC2, and the ACS are active. A paper\nmay be counted more than once if the data it uses\ncome from more than one instrument.\n\nFig. 3.- Number of refereed papers based on HST\ndata as a function of the year of publication, from\nlaunch to the end of 2003, for active and decommissioned HST instruments. The total number of\npapers in this figure is 5101, a value larger than\n4116, the total number of HST refereed papers.\nThis is due to the fact that about 1000 papers\nuse data from more than one instrument and are\ncounted more than once.\n\nFig. 2.- For Cycles 1 (solid-black histogram) and\n2 (cross-hatched histogram) programs, numbers of\nrefereed papers based on HST data as a function\nof the year of publication are plotted on the upperleft panelbox. Idem for Cycles 3-4, 5-6, and 7-8.\n\n3.3.\n\n3.4.\n\nPaper Counts per Instrument\n\nArchives as an Instrument\n\nBy definition, we consider as an archival HST\npaper, any paper which fulfill simultaneously\nthe following two conditions: (i) it is based on\nHST data retrieved from MAST, the Multimission Archive at Space Telescope, and (ii) none of\nits authors is neither a PI nor a CoI on any of the\nHST programs from which these data originate.\nSoftware tools able to identify such papers have\nbeen developed only very recently. We currently\nhave an estimate of the fraction of archival HST\npapers only for the years 2000 through 2003. Out\nof the 1870 HST papers published during these\n\nFig. 3 gives the number of refereed papers published per year based on data from each Hubble\ninstrument. The number in each panel is the time\nintegral of the corresponding curve. FGS stands\nfor Fine Guidance Sensors, FOC for Faint Object\nCamera, STIS for Space Telescope Infrared Spectrograph, GHRS for Goddard High Resolution\nSpectrograph, HSP for High Speed Photometer,\nNICMOS for Near Infrared Camera and MultiObject Spectrograph, FOS for Faint Object Spectrograph, WFPC and WFPC2 for the first and\nsecond Wide Field and Planetary Camera, and\n\n4\n\n\fand the ADS because of errors made by the ISI.\nStevens-Rayburn & Bouton (2002) also discuss\ndisparities of citation counts for the two providers.\nFor Fig. 4, we consider only papers in the five\nmajor journals (ApJ, AJ, A&A, MNRAS, and\nPASP), since other journals, such as Nature and\nScience, would bias our statistics with their numerous highly-cited articles not related to astronomy. The histogram in Fig. 4 displays the mean\ntotal number of citations of refereed HST papers\nas a function of years since publication. For the\nolder papers, published between 7 and 12 years\nago, the mean total number of citations is about\n40 per paper, and is smaller for more recently published papers. The segmented line in this figure\nshows the mean total numbers of citations, for all\nastronomy papers in the aforementioned five major journals. The refereed HST papers have an\naverage number of citations per paper larger (by\nat least 25%) than the average number of citations\nof all the astronomical papers.\nFig. 5 shows that, a few years after publication,\nonly about 2% of the refereed HST papers have no\ncitations, whereas about one quarter of all refereed\npapers in astronomy have no recorded citation in\nthe ADS.\nThese two figures show that the refereed HST\npapers have a scientific impact significantly above\naverage.\n\nfour years, 654 are archival HST papers. This\namounts to 34 % of the HST papers (K. Levay\nand MAST team 2004, private communication).\n3.5.\n\nCitation Counts per Year\n\nTo estimate the scientific impact of the refereed\npapers based on HST data, we obtain from the\nADS the total number of citations for each paper\nin our databases.\nThe ADS itself is well aware that its citation\ncounts may suffer from some (small ?) incompleteness. However the ADS constantly improves its\nproducts and represents the most reliable source\nof citations for papers published in the major astronomical journals. The ADS has two essential\nadvantages: is it available on-line and free of any\ncharge. We use, on a weekly basis, a script provided by the ADS, which allows us to access directly the total number of citations for each paper\nin our databases.\n\n3.6.\n\nCitation History\n\nThe citation counts allow the study of the evolution of citation rates of papers as a function of\nthe years following publication. Such metrics allow to answer the following questions: How fast is\nthe growth in citation rate ? Is there a maximum\ncitation rate ? After how many years is this maximum reached ? How fast is the decline in citation\nrate ?\nWe have obtained the individual citations of all\nthe 4,116 refereed HST papers, courtesy of the\nADS (Kurtz, 2003a). This amounts to a total of\n64,141 citations. Fig. 6 presents the average citation counts per paper as a function of the number\nof years since publication. The continuous line is\nthe average for the HST papers, while the dashed\nline is the average of all refereed papers in astronomy.\nIn both cases after a sharp rise, the peak of\n\nFig. 4.- Mean number of citations of refereed\npapers based on HST data as a function of the\nyears since publication. The solid curve represents\nthe mean numbers of citations for all astronomy.\nThe Institute for Scientific Information (ISI),\nbased in Philadelphia, sells citation counts, which\nafter a few checks, appear not more reliable than\nthose from the ADS. Sandqvist (2004) presents a\nfew examples of large differences between the ISI\n5\n\n\fFig. 5.- Percentage of refereed HST papers without citations as a function of the year of publication, as solid-black histogram. The solid curve\nrepresents the percentage of refereed papers without citations for all astronomy.\n\nFig. 6.- Citation history: average citations rate\nper paper per year. The continuous curve represents the average for the refereed HST papers,\nwhile the dashed curve represents the average for\nall astronomy papers.\n\nthe citation rate occurs approximately two years\nafter publication. HST refereed papers peak at\nan average of 5.9 citations/paper/year, while the\npeak reaches only 3.2 citations/paper/year for all\nrefereed papers in astronomy. Thereafter, the citation rate decreases linearly to be about 2 citations/paper/year ten years after publication.\nCrabtree & Bryson (2001, 2002) generated similar curves for the papers produced from observations by the Canada-France-Hawaii Telescope (CFHT) and the UK Infra-Red Telescope\n(UKIRT). Their curves peak at about 4.0 - 4.5\ncitations/paper/year, and display the same general shape; a sharp rise, a maximum reached after\ntwo years, followed by a slow decline. Abt (1981)\nshowed that for papers published in 1961, citations reach a maximum five years after publication. The delay between publication date and the\npeak of citations has shortened since that time\nto an average of two years. This may be a direct\nconsequence of the strong increase, during the last\ndecade, in the spread of information through the\nWorld Wide Web.\n\n3.7.\n\nADS 2000-2001 reads of papers\n\nFor each paper, each access through the ADS\ngenerates a log entry, which is called a \"read\".\nAn independent and new way of measuring the\nreadership of a paper is the number of \"reads\" it\ngenerates (Kurtz, 2003b). Michael Kurtz of the\nADS kindly provided us with data related to this\nnew metric.\nDuring the two years 2000 and 2001, the ADS\nrecorded about 12 million reads of all astronomy\npapers, out of which 10 million were related to\nrefereed papers. At that time, the then 3113 HST\nrefereed papers accumulated 533,362 reads during\nthese two years, corresponding to 5.3% of all reads\nof astronomy papers.\n4.\n\nHigh Impact Papers\n\nThere is more than one way to identify papers which have a high scientific impact. An\ninteresting metric is given by the papers which\nhave the largest numbers of citations: called\nHigh Impact Papers (HIPs) by the ISI (see\nhttp://www.isinet.com/rsg/hip). We adopt the\n\n6\n\n\fISI definition: a paper is a HIP if it belongs to\nthe 200 most cited refereed papers published in a\ngiven year. The ADS has the capability to sort all\npapers by citation counts and publication dates.\nIt is straightforward, from the ADS, to obtain the\ntop 200 papers published in a given year.\nWe identify the HST refereed papers which have\nenough citations to be among the HIPs published\nin a given year. Fig. 7 provides the percentage of\nHIPs based on HST data as a function of publication year. After a slow start in 1991, 1992, and\n1993, the effect of the successful deployment of\nCOSTAR and WFPC2 on the impact of refereed\npapers is obvious between 1993 and 1994. Since\n1994, Hubble has consistently generated about 8%\nof all HIPs.\nWe have extracted the High Impact Papers for\nthe following four years: 1998, 1999, 2000, and\n2001, and studied in greater details these 800 papers. Namely, for each paper we accessed the full\ntext using the ADS, read the paper and decide\nwhether it is an observational or theory paper.\nHereafter we consider only observational papers.\nIf, for a paper, there is more than one telescope\nproviding the observations, the weight or percentage of the contribution coming from each facility\nis roughly estimated (e.g., 50 % HST, 25% Keck,\nand 25% Chandra), and the citations of this paper are attributed to the facilities as a function of\nthese percentages. In this way, the total number\nof citations related to the 200 HIPs of a given year\nis distributed among all telescopes/facilities that\nprovided the data.\nTable 1 gives the distribution of the citations\nof the 200 HIPs published in 1998 as a function\nof the most highly cited facilities (we display here\nonly the 12 most cited ones), from HST to ISO.\nTable 2, 3, 4 give the same distribution for the\nyears 1999, 2000, and 2001, respectively. These\ntables show that HST publications have the highest impact for the years 1998, 1999, and 2000,\nwith some strong challenges from Keck, Scuba,\nand Boomerang, while the impact of new space\nobservatories, like Chandra and XMM-Newton, is\nclearly visible in 2001.\nOur results, although based on a different sample of HIPs, are consistent with the values found\nby Benn & Sánchez (2001): HST generates 11%\nof the total citations in the years 1995 to 2001.\n\nFig. 7.- Percentage of HST High Impact Papers (HIPs), from the ADS. Since 1994, Hubble\nhas consistently generated about 8% of all observational HIPs.\n5.\n\nTop ten most productive HST programs\n\nSince all 4,116 HST refereed papers are linked\nin our databases to the programs having generated\nthe data, it is straightforward to identify the most\nproductive programs. Table 5 lists the ten most\nproductive HST programs, in decreasing numbers\nof related papers. Column 1 provides the program\ntype, Column 2 the Program I.D., Column 3 the\nP.I. last name, Column 4 the title of the program,\nColumn 5 the number of papers generated, and\nColumn 6 the total number of citations to these\npapers.\nIt is worth noting that all program categories\nare present in this table, with not only General\nObserver (GO) programs, but also Guaranteed\nTime Observer (GTO) programs, Parallel (PAR)\nprograms, snapshot (SNAP) programs, and Director Discretionary time (DD) programs. This illustrates the usefulness of each of these program\ncategories. Not surprisingly, the top program is\nthe Hubble Deep Field, with Williams as the PI,\nwhich may have produced the most original, broad\nimpact, and far reaching HST scientific results yet.\n\n7\n\n\f6.\n\nCrabtree, D. R. & Bryson, E. P. 2002, Library and\ninformation services in astronomy IV (LISA\nIV): proceedings of a conference held at Charles\nUniversity, Prague, Czech Republic, July 2-5,\n2002\n\nTop ten most cited refereed HST publications\n\nThe same databases allow the identification of\nthe most cited refereed articles based on Hubble\ndata. Table 6 lists the ten most cited HST papers.\nColumn 1 gives the name of the first author, Column 2 the title of the paper, and Column 3 the\nbibliographic reference of the paper. These papers\nare sorted by decreasing numbers of citations, Column 4.\nThis list of publications contains only papers\npresenting new scientific results; we have not included instrumental/calibration papers.\n7.\n\nBenn, C.R. & Sanchez, S.F. 2001, PASP, 113, 385\nLevay, K. 2004, MAST, Private Communication\nKurtz, M., et al. 2000, A&AS, 143, 41\nKurtz, M. 2003a, ADS, Private Communication\nKurtz, M.J., et al., 2003b, submitted to The Journal of the American Society for Information,\nScience, and Technology\n\nConclusion\n\nMeylan, G., Madrid, J. & Macchetto, D. 2003,\nSTScI Newsletter, 20, issue 2, p. 1\n\nThe creation of effective links between the\nSTScI and ADS databases containing information\nabout all HST programs, all HST refereed papers,\nand their citations, provides us with a powerful\nand versatile way to obtain metrics about describing the efficiency, productivity, and scientific\nimpact of the Hubble Space Telescope project.\nThis may certainly help the funding agencies\nand the various governing committees in shaping\nthe future of HST time allocation through educated decisions. The evaluation of the present performances of space facilities like HST, Chandra\nand Spitzer will help to maximize the efficiency\nand scientific output of future projects, like the\nJames Webb Space Telescope (JWST).\n\nSandqvist, A., 2004, To be published in \"Organizations and Strategies in Astronomy-Vol. 5\".\nEd A. Heck, Kluwer Academic Publishers, Dordrecht. See also astro-ph/0403184\nStevens-Rayburn, S., & E., Bouton 2002, Library and information services in astronomy\nIV (LISA IV): proceedings of a conference held\nat Charles University, Prague, Czech Republic,\nJuly 2-5, 2002\nTrimble, V., 1995, PASP, 107, 977\n\nThis research has made extensive use of the\nNASA Astrophysics Data System Bibliographic\nservices. We thank the ADS team and specially\nMichael Kurtz for providing us with numerous\ndata about citations and reads of HST papers.\nWe are grateful to the STScI Librarian, Sarah\nStevens-Rayburn, for her invaluable input. Many\nthanks to the MAST team at STScI, particularly\nKaren Levay, Paolo Padovani, and Sara Anderson for storing and handling the data used in this\nstudy. We are also grateful to Tim de Zeeuw and\nDon York for useful comments.\nREFERENCES\nAbt, H., 1981, PASP, 93, 207\nCrabtree, D. R. & Bryson, E. P. 2001, JRASC, 95,\n259\n\nThis 2-column preprint was prepared with the AAS LATEX\nmacros v5.2.\n\n8\n\n\fTable 1\n\nTable 3\n\nADS High-Impact Papers 1998\n\nADS High-Impact Papers 2000\n\nTelescope\n\nFraction\nof the Total\n\nTelescope\n\nFraction\nof the Total\n\nHST\nKeck\nKamiokande\nCOBE\nNOAO\nROSAT\nSCUBA/JCMT\nASCA\nHipparcos\nESO\n\n13.5\n7.5\n6.8\n6.8\n7.1\n5.3\n4.7\n4.0\n3.3\n2.7\n\nHST\nKeck\nChandra\nBoomerang\nASCA\nESO\nMAXIMA\nISO\nROSAT\nFUSE\n\n12.6\n11.5\n7.7\n5.8\n4.6\n4.1\n3.8\n3.4\n3.4\n3.4\n\nTable 2\nADS High-Impact Papers 1999\n\nTable 4\nADS High-Impact Papers 2001\n\nTelescope\n\nFraction\nof the Total\n\nTelescope\n\nFraction\nof the Total\n\nHST\nKeck\nROSAT\nSCUBA/JCMT\nKamiokande\nWHT\nNOAO\nISO\nASCA\nCGRO\n\n11.8\n7.6\n7.3\n5.3\n5.1\n3.2\n3.1\n2.8\n2.5\n2.4\n\nChandra\nXMM-Newton\nKeck\nHST\nESO\nAAT\nMAXIMA\nNOAO\nSDSS\nROSAT\n\n12.6\n11.9\n9.6\n8.9\n7.8\n4.9\n4.0\n3.9\n3.6\n2.3\n\n9\n\n\fTable 5\nTop ten most productive programs\nProgram Type\nGO/DD\nGO/PAR\nGO\nGO\nSNAP\nGO/DD\nGTO\nSNAP\nGO\nSNAP\n1\n\nProgram I.D.1\n\nPI\n\nTitle\n\nPapers\n\nCitations\n\n6337\n5369\n2424\n2227\n5476\n8058\n5236\n5479\n2563\n7330\n\nWilliams\nGriffiths\nBahcall\nMould\nSparks\nWilliams\nWestphal\nMalkan\nKirshner\nMulchaey\n\nHubble Deep Field\nMedium Deep Survey\nQuasar Absorption Line Survey\nDetermination of the Extragalactic Distance Scale\n3CR Radio Galaxies\nHubble Deep Field South\nNuclei of Nearly Normal Galaxies\nSubarcsecond Structure of AGN\nSINS The Supernova Intense Study\nThe Fueling of Active Nuclei\n\n119\n88\n58\n57\n57\n48\n48\n45\n40\n40\n\n5232\n2029\n1953\n2469\n719\n772\n1973\n485\n524\n416\n\narge or multicycle programs may acquire different I.D. numbers when scheduled through more than one cycle\n\nTable 6\nTop ten most cited HST papers\nFirst author\n\nTitle\n\nReference\n\nMadau\nWilliams\nMagorrian\nPerlmutter\nGebhardt\nFreedman\nFreedman\nStetson\nFreedman\nLowenthal\n\nHigh redshift Galaxies in the Hubble Deep Field\nThe Hubble Deep Field\nThe Demography of Massive Dark Objects\nDiscovery of a supernova explosion\nBlack Hole Mass and Galaxy Velocity Dispersion\nResults from the HST key project to measure H0\nDistance to the Virgo Cluster Galaxy M100\nThe center of the core-cusp globular cluster\nThe HST Extragalactic Distance Scale\nKeck Spectroscopy of z∼3 Galaxies in the HDF\n\n10\n\n1996,\n1996,\n1998,\n1998,\n2000,\n2001,\n1994,\n1994,\n1994,\n1997,\n\nMNRAS, 283, 1388\nAJ,112, 1335\nAJ, 115, 2285\nNature, 391, 51\nApJ, 539, L13\nApJ, 553, 47\nNature, 371, 757\nPASP, 106, 250\nApJ, 427, 628\nApJ, 481, 673L\n\nCitations\n701\n586\n568\n397\n378\n370\n301\n278\n271\n271\n\n\f"}