{"id": "http://arxiv.org/abs/astro-ph/0506399v3", "guidislink": true, "updated": "2005-06-22T20:27:56Z", "updated_parsed": [2005, 6, 22, 20, 27, 56, 2, 173, 0], "published": "2005-06-16T23:19:01Z", "published_parsed": [2005, 6, 16, 23, 19, 1, 3, 167, 0], "title": "Hot Neutron and Quark Star Evolution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0506361%2Castro-ph%2F0506308%2Castro-ph%2F0506228%2Castro-ph%2F0506457%2Castro-ph%2F0506154%2Castro-ph%2F0506726%2Castro-ph%2F0506288%2Castro-ph%2F0506097%2Castro-ph%2F0506396%2Castro-ph%2F0506409%2Castro-ph%2F0506551%2Castro-ph%2F0506139%2Castro-ph%2F0506413%2Castro-ph%2F0506343%2Castro-ph%2F0506600%2Castro-ph%2F0506221%2Castro-ph%2F0506639%2Castro-ph%2F0506523%2Castro-ph%2F0506598%2Castro-ph%2F0506263%2Castro-ph%2F0506714%2Castro-ph%2F0506738%2Castro-ph%2F0506098%2Castro-ph%2F0506103%2Castro-ph%2F0506159%2Castro-ph%2F0506164%2Castro-ph%2F0506320%2Castro-ph%2F0506282%2Castro-ph%2F0506040%2Castro-ph%2F0506111%2Castro-ph%2F0506434%2Castro-ph%2F0506501%2Castro-ph%2F0506265%2Castro-ph%2F0506178%2Castro-ph%2F0506220%2Castro-ph%2F0506047%2Castro-ph%2F0506185%2Castro-ph%2F0506458%2Castro-ph%2F0506152%2Castro-ph%2F0506386%2Castro-ph%2F0506521%2Castro-ph%2F0506654%2Castro-ph%2F0506330%2Castro-ph%2F0506044%2Castro-ph%2F0506183%2Castro-ph%2F0506118%2Castro-ph%2F0506251%2Castro-ph%2F0506528%2Castro-ph%2F0506595%2Castro-ph%2F0506668%2Castro-ph%2F0506039%2Castro-ph%2F0506440%2Castro-ph%2F0506464%2Castro-ph%2F0506430%2Castro-ph%2F0506402%2Castro-ph%2F0506670%2Castro-ph%2F0506078%2Castro-ph%2F0506358%2Castro-ph%2F0506626%2Castro-ph%2F0506405%2Castro-ph%2F0506514%2Castro-ph%2F0506466%2Castro-ph%2F0506317%2Castro-ph%2F0506407%2Castro-ph%2F0506037%2Castro-ph%2F0506235%2Castro-ph%2F0506496%2Castro-ph%2F0506646%2Castro-ph%2F0506585%2Castro-ph%2F0506144%2Castro-ph%2F0506542%2Castro-ph%2F0506243%2Castro-ph%2F0506563%2Castro-ph%2F0506582%2Castro-ph%2F0506643%2Castro-ph%2F0506672%2Castro-ph%2F0506292%2Castro-ph%2F0506354%2Castro-ph%2F0506420%2Castro-ph%2F0506180%2Castro-ph%2F0506086%2Castro-ph%2F0506442%2Castro-ph%2F0506454%2Castro-ph%2F0506021%2Castro-ph%2F0506399%2Castro-ph%2F0506071%2Castro-ph%2F0506539%2Castro-ph%2F0506767%2Castro-ph%2F0506148%2Castro-ph%2F0506691%2Castro-ph%2F0506187%2Castro-ph%2F0506530%2Castro-ph%2F0506759%2Castro-ph%2F0506140%2Castro-ph%2F0506395%2Castro-ph%2F0506535%2Castro-ph%2F0506289%2Castro-ph%2F0506353%2Castro-ph%2F0506340%2Castro-ph%2F0506127%2Castro-ph%2F0506113&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hot Neutron and Quark Star Evolution"}, "summary": "The physics of compact objects is one of the very actively developing\nbranches of theoretical investigations, since the careful analysis of different\nmodels for the internal structure of these objects, their evolutionary\ncharacteristics and the comparison with modern observational data give access\nto discriminate among various speculations about the state of matter under\nextreme conditions.\n  The lecture provides an overview to the problem of neutron star cooling\nevolution. We discuss the scheme and necessary inputs for neutron star cooling\nsimulations from the background of a microscopic modeling in order to present\nthe surface temperature - age characteristics of hybrid neutron stars including\nthe determination of main regulators of the cooling process, the question of\nneutrino production and diffusion.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0506361%2Castro-ph%2F0506308%2Castro-ph%2F0506228%2Castro-ph%2F0506457%2Castro-ph%2F0506154%2Castro-ph%2F0506726%2Castro-ph%2F0506288%2Castro-ph%2F0506097%2Castro-ph%2F0506396%2Castro-ph%2F0506409%2Castro-ph%2F0506551%2Castro-ph%2F0506139%2Castro-ph%2F0506413%2Castro-ph%2F0506343%2Castro-ph%2F0506600%2Castro-ph%2F0506221%2Castro-ph%2F0506639%2Castro-ph%2F0506523%2Castro-ph%2F0506598%2Castro-ph%2F0506263%2Castro-ph%2F0506714%2Castro-ph%2F0506738%2Castro-ph%2F0506098%2Castro-ph%2F0506103%2Castro-ph%2F0506159%2Castro-ph%2F0506164%2Castro-ph%2F0506320%2Castro-ph%2F0506282%2Castro-ph%2F0506040%2Castro-ph%2F0506111%2Castro-ph%2F0506434%2Castro-ph%2F0506501%2Castro-ph%2F0506265%2Castro-ph%2F0506178%2Castro-ph%2F0506220%2Castro-ph%2F0506047%2Castro-ph%2F0506185%2Castro-ph%2F0506458%2Castro-ph%2F0506152%2Castro-ph%2F0506386%2Castro-ph%2F0506521%2Castro-ph%2F0506654%2Castro-ph%2F0506330%2Castro-ph%2F0506044%2Castro-ph%2F0506183%2Castro-ph%2F0506118%2Castro-ph%2F0506251%2Castro-ph%2F0506528%2Castro-ph%2F0506595%2Castro-ph%2F0506668%2Castro-ph%2F0506039%2Castro-ph%2F0506440%2Castro-ph%2F0506464%2Castro-ph%2F0506430%2Castro-ph%2F0506402%2Castro-ph%2F0506670%2Castro-ph%2F0506078%2Castro-ph%2F0506358%2Castro-ph%2F0506626%2Castro-ph%2F0506405%2Castro-ph%2F0506514%2Castro-ph%2F0506466%2Castro-ph%2F0506317%2Castro-ph%2F0506407%2Castro-ph%2F0506037%2Castro-ph%2F0506235%2Castro-ph%2F0506496%2Castro-ph%2F0506646%2Castro-ph%2F0506585%2Castro-ph%2F0506144%2Castro-ph%2F0506542%2Castro-ph%2F0506243%2Castro-ph%2F0506563%2Castro-ph%2F0506582%2Castro-ph%2F0506643%2Castro-ph%2F0506672%2Castro-ph%2F0506292%2Castro-ph%2F0506354%2Castro-ph%2F0506420%2Castro-ph%2F0506180%2Castro-ph%2F0506086%2Castro-ph%2F0506442%2Castro-ph%2F0506454%2Castro-ph%2F0506021%2Castro-ph%2F0506399%2Castro-ph%2F0506071%2Castro-ph%2F0506539%2Castro-ph%2F0506767%2Castro-ph%2F0506148%2Castro-ph%2F0506691%2Castro-ph%2F0506187%2Castro-ph%2F0506530%2Castro-ph%2F0506759%2Castro-ph%2F0506140%2Castro-ph%2F0506395%2Castro-ph%2F0506535%2Castro-ph%2F0506289%2Castro-ph%2F0506353%2Castro-ph%2F0506340%2Castro-ph%2F0506127%2Castro-ph%2F0506113&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The physics of compact objects is one of the very actively developing\nbranches of theoretical investigations, since the careful analysis of different\nmodels for the internal structure of these objects, their evolutionary\ncharacteristics and the comparison with modern observational data give access\nto discriminate among various speculations about the state of matter under\nextreme conditions.\n  The lecture provides an overview to the problem of neutron star cooling\nevolution. We discuss the scheme and necessary inputs for neutron star cooling\nsimulations from the background of a microscopic modeling in order to present\nthe surface temperature - age characteristics of hybrid neutron stars including\nthe determination of main regulators of the cooling process, the question of\nneutrino production and diffusion."}, "authors": ["Hovik Grigorian"], "author_detail": {"name": "Hovik Grigorian"}, "author": "Hovik Grigorian", "arxiv_comment": "35 pages, 9 figures, Lectures delivered at the Helmholtz\n  International Summer School and Workshop on \"Hot points in Astrophysics and\n  Cosmology\", JINR, Dubna, Russia, August 2 - 13, 2004", "links": [{"href": "http://arxiv.org/abs/astro-ph/0506399v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0506399v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0506399v3", "affiliation": "U. Rostock, U. Yerevan", "arxiv_url": "http://arxiv.org/abs/astro-ph/0506399v3", "journal_reference": null, "doi": null, "fulltext": "arXiv:astro-ph/0506399v3 22 Jun 2005\n\nHot Neutron and Quark Star Evolution\n\n∗\n\nHovik Grigorian†\nInstitut für Physik , Universität Rostock,\nD-18051 Rostock, Germany\nSeptember 27, 2018\n\nAbstract\nThe physics of compact objects is one of the very actively developing branches of theoretical investigations, since the careful analysis\nof different models for the internal structure of these objects, their\nevolutionary characteristics and the comparison with modern observational data give access to discriminate among various speculations\nabout the state of matter under extreme conditions.\nThe lecture provides an overview to the problem of neutron star\ncooling evolution. We discuss the scheme and necessary inputs for neutron star cooling simulations from the background of a microscopic\nmodeling in order to present the surface temperature - age characteristics of hybrid neutron stars including the determination of main\nregulators of the cooling process, the question of neutrino production\nand diffusion.\n\n∗\n\nLectures delivered at the Helmholtz International Summer School and Workshop on\nHot points in Astrophysics and Cosmology, JINR, Dubna, Russia, August 2 - 13, 2004.\n†\nOn leave from Yerevan State University, Alex Manoogian Str. 1, 375025 Yerevan,\nArmenia.\n\n1\n\n\f1\n\nIntroduction\n\nThe interiors of compact stars are considered as systems where high-density\nphases of strongly interacting matter do occur in nature, see Shapiro and\nTeukolsky [1], Glendenning [2] and Weber [3] for textbooks. The consequences of different phase transition scenarios for the cooling behaviour of\ncompact stars have been reviewed recently in comparison with existing X-ray\ndata [4].\nThe Einstein Observatory was the first that started the experimental\nstudy of surface temperatures of isolated neutron stars (NS). Upper limits for\nsome sources have been found. Then ROSAT offered first detections of surface temperatures. Next X-ray data came from Chandra and XMM/Newton.\nAppropriate references to the modern data can be found in recent works by\n[5, 6, 7, 8], devoted to the analysis of the new data. More upper limits and\ndetections are expected from satellites planned to be sent in the nearest future. In general, the data can be separated in three groups. Some data show\nvery \"slow cooling\" of objects, other demonstrate an \"intermediate cooling\"\nand some show very \"rapid cooling\". Now we are at the position to carefully\ncompare the data with existing cooling calculations.\nThe \"standard\" scenario of neutron star cooling is based on the main\nprocess responsible for the cooling, which is the modified Urca process (MU)\nnn → npeν̄ calculated using the free one pion exchange between nucleons, see\n[9]. However, this scenario explains only the group of slow cooling data. To\nexplain a group of rapid cooling data \"standard\" scenario was supplemented\nby one of the so called \"exotic\" processes either with pion condensate, or\nwith kaon condensate, or with hyperons, or involving the direct Urca (DU)\nreactions, see [10, 1] and refs therein. All these processes may occur only\nfor the density higher than a critical density, (2 ÷ 6) n0 , depending on the\nmodel, where n0 is the nuclear saturation density. An other alternative to\n\"exotic\" processes is the DU process on quarks related to the phase transition\nto quark matter.\nParticularly the studies of cooling evolution of compact objects can give\nan opportunity for understanding of properties of cold quark gluon plasma.\nIn dense quark matter at temperatures below ∼ 50 MeV, due to attractive interaction channels, the Cooper pairing instability is expected to occur which\nshould lead to a variety of possible quark pair condensates corresponding to\ncolor superconductivity (CSC) phases, see [11] for a review.\nSince it is difficult to provide low enough temperatures for CSC phases in\n2\n\n\fheavy-ion collisions, only precursor phenomena [12, 13] are expected under\nthese conditions.\nCSC phases may occur in neutron star interiors [14] and could manifest\nthemselves, e.g., in the cooling behavior [15, 16, 17, 18].\nHowever, the domain of the QCD phase diagram where neutron star\nconditions are met is not yet accessible to Lattice QCD studies and theoretical approaches have to rely on non-perturbative QCD modeling. The class\nof models closest to QCD are Dyson-Schwinger equation (DSE) approaches\nwhich have been extended recently to finite temperatures and densities [19].\nWithin simple, infrared-dominant DSE models early studies of quark stars\n[20] and diquark condensation [21] have been performed.\nEstimates of the cooling evolution have been performed [15] for a selfbound isothermal quark core neutron star (QCNS) which has a crust but no\nhadron shell, and for a quark star (QS) which has neither crust nor hadron\nshell. It has been shown there in the case of the 2SC (3SC) phase of QCNS\nthat the consequences of the occurrence of gaps for the cooling curves are\nsimilar to the case of usual hadronic neutron stars (enhanced cooling). However, for the CFL case it has been shown that the cooling is extremely fast\nsince the drop in the specific heat of superconducting quark matter dominates over the reduction of the neutrino emissivity. As has been pointed\nout there, the abnormal rate of the temperature drop is the consequence of\nthe approximation of homogeneous temperature profiles the applicability of\nwhich should be limited by the heat transport effects. Page et al. (2000)[16]\nestimated the cooling of hybrid neutron stars (HNS) where heat transport effects within the superconducting quark core have been disregarded. Neutrino\nmean free path in color superconducting quark matter have been discussed\nin [22] where a short period of cooling delay at the onset of color superconductivity for a QS has been conjectured in accordance with the estimates of\n[15] in the CFL case for small gaps.\nA completely new situation might arise if the scenarios suggested for\n(color) superconductivity [23, 24] besides of bigger pairing gaps (∆q ∼ 50 ÷\n100 MeV) will allow also small diquark pairing gaps (∆q < 1 MeV) in quark\nmatter.\nThe questions which should be considered within these models are the\nfollowing: (i) Is strange quark matter relevant for structure and evolution\nof compact stars? (ii) Are stable hybrid stars with quark matter interior\npossible? (iii) What can we learn about possible CSC phases from neutron\nstar cooling? Further on in this lectures we discuss the scheme and the results\n3\n\n\fof realization of the these points in relation with the cooling evolution of\ncompact objects.\nIn the consideration of the scenario for the thermal evolution of NS and\nHNS we include the heat transport in both the quark and the hadronic\nmatter. We will demonstrate the influence of the diquark pairing gaps and\nthe hadronic gaps on the evolution of the surface temperature.\nThe main strategy of the simulation of the cooling evolution of compact\nobjects is presented in Fig 1. On the top of scheme we have the general\ntheoretical background of QCD models as it has been discussed in the introduction. On the second level of the scheme we separate two branches one for\nthe structure of the compact objects and the other for the thermal properties of the stellar matter. On the bottom of the scheme those two branches\nare combined in the code of the cooling simulations project and entail the\ncomparison of the theoretical and observational results.\nMicroscopic Approach to\nDense QCD / Nuclear Matter\n\nEoS and NS constraints\nPairing Gaps\n\nNS configurations\n\nNeutrino Emissivities,\nTransport Properties,\n\nCooling Code\n\nObs. Data\n\nFigure 1: The scheme linked problems and tasks, which has to be done to\nsimulate the cooling of compact objects\n\n4\n\n\f2\n2.1\n\nEoS of stellar matter and Compact Star\nconfigurations\nHadronic matter EoS and DU threshold\n\nFor the modeling of the dense hadronic matter different approaches, like\nrelativistic and non-relativistic Brückner-Hartree-Fock approach including\nthe three body correlations [25, 26, 27, 28] and different parameterizations\nof relativistic mean field models, are discussed successfully in the literature\n[29, 30, 31, 32].\nFor the appropriate cooling simulations we exploit the EoS of [25] (specifically the Argonne V 18 + δv + UIX ∗ model), which is based on the most\nrecent models for the nucleon-nucleon interaction including a parameterized\nthree-body force and relativistic boost corrections. Actually we adopt a simple analytic parameterization of this model by Heiselberg and Hjorth-Jensen\n[28], hereafter HHJ.\nThe latter uses the compressional part with the compressibility K ≃\n240 MeV, a symmetry energy fitted to the data around nuclear saturation\ndensity and smoothly incorporates causality at high densities. The density\ndependence of the symmetry energy is very important since it determines\nthe value of the threshold density for the DU process. The HHJ EoS fits the\nsymmetry energy to the original Argonne V 18 + δv + UIX ∗ model yielding\nnDU\n≃ 5.0 n0 (McDU ≃ 1.839 M⊙ ).\nc\nFig. 2 demonstrates the partial densities of p, e and μ− in HHJ and\nrelativistic non-linear Walecka (NLW) model in the parameterization of [32],\nadjusted to the following bulk parameters of the nuclear matter at saturation:\nn0 = 0.16 fm−3 . Anyhow, in the given NLW model the threshold density for\nthe DU process is nDU\n≃ 2.7 n0 .\nc\n\n2.2\n\nQuark matter EoS with 2SC superconductivity\n\nThe quark matter models [24, 33, 34] predict, that the diquark pairing condensate is possible for temperatures and densities relevant for compact objects. The order of magnitude of pairing gaps is 100 MeV and a remarkably\nrich phase structure of the matter has been identified [11, 35, 36, 37].\nThis leads to expectations of observable effects of color superconducting\nphases, particularly in the compact star cooling behaviour [15, 16, 17, 18,\n38]. Generally color superconductivity is involved in all aspects of neutron\n5\n\n\fCharge Particles for WNL(250) & HJ(240) EoS\nDensities of protons electrons and muons\n\n0.18\np - HHJ\ne - HHJ\nμ - HHJ\np - NLW\ne - NLW\nμ − NLW\n\n0.16\n0.14\n\n-3\n\nn p,e,μ[fm ]\n\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n\n0\n\n0.2\n\n0.4\n\n0.8\n\n0.6\n\n1\n\n1.2\n\n-3\n\nn [fm ]\n\nFigure 2: Densities of the charged particles as a function of baryon density\nfor HHJ and NLW model EoS. Possibility of pion condensation is suppressed.\n\nstar studies, such as magnetic field evolution [39, 40, 41, 42] or burst-type\nphenomena [43, 44, 45, 46].\nThe applications of the nonlocal chiral quark model developed in [47] for\nthe case of neutron star constraints shows that the relevant CSC phase is a\n2SC phase while the omission of the strange quark flavor is justified by the\nfact that chemical potentials in central parts of the stars do barely reach the\nthreshold value at which the mass gap for strange quarks breaks down and\nthey appear in the system [48, 49].\nIt has been shown in that work that the Gaussian formfactor ansatz of\nquark interaction (hereafter we call it SM model) leads to an early onset of\nthe deconfinement transition and such a model is therefore suitable to discuss\nhybrid stars with large quark matter cores [50].\nThe resulting quark matter EoS within this nonlocal chiral model [47]\ncan be represented in a form reminiscent of a bag model\nP (s) = Pid (μB ) − B (s) (μB ) ,\n\n(1)\n\nwhere Pid (μB ) is the ideal gas pressure of quarks and B (s) (μB ) a density\ndependent bag pressure, see Fig. 3. The occurrence of diquark condensation\ndepends on the value of the ratio η = G2 /G1 of coupling constants and\n6\n\n\fthe superscript s ∈ {S, N} indicating whether we consider the matter in\nthe superconducting mixed phase (η = 1) or in the normal phase (η = 0),\nrespectively.\n\nFigure 3: Bag pressure for different formfactors of the quark interaction in\ndependence on the baryon chemical potential for η = 0 and for η = 1. For\nthe latter the superconducting phase is realized.\n\n2.3\n\nEoS of hybrid star matter\n\nIn some density interval above the onset of the first order phase transition,\nthere may appear a mixed phase region between the hadronic (confined quark\nphase) and deconfined quark phases, see [51]. Ref. [51] disregarded finite\nsize effects, such as surface tension and charge screening. On the example of the hadron-quark mixed phase Refs [52] demonstrated that finite size\neffects might play a crucial role substantially narrowing the region of the\nmixed phase or even forbidding its appearance in a hybrid star configuration. Therefore we omit the possibility of the hadron-quark mixed phase in\nour model assuming that the quark phase arises by the Maxwell construction.\nTo demonstrate the EoS with quark-hadron phase transition applicable\nfor hybrid star configurations in the next Section, we show in Fig. 4 results using the relativistic mean field (RMF) model of asymmetric nuclear\n7\n\n\fmatter including a non-linear scalar field potential and the ρ meson (nonlinear Walecka model) ( see [2]) for the cases η = 1 (left panel) when the\nquark matter phase is superconducting and for η = 0 (right panel) when it\nis normal.\n\nFigure 4: EoS for strongly interacting matter at zero temperature under\ncompact star constraints for the coupling parameter η = 1 (left panel) and\nη = 0 (right panel). Dashed line: relativistic mean-field model for hadronic\nmatter; solid, dash-dotted and dotted lines correspond to quark matter with\nGaussian, Lorentzian and NJL formfactor functions, respectively.\n\nIn case the hadonic EoS is chosen to be HHJ model and the quark one\nis SM model we found a tiny density jump at the phase-boundary from\nnhadr\n≃ 0.44 fm−3 to nquark\n≃ 0.46 fm−3 . The critical mass, when the branch\nc\nc\nof stable hybrid stars starts is Mcquark = 1.214 M⊙ .\nAs shown in Refs. [53, 49] quark matter itself can exist in a mixed phase\nof 2SC and normal states. The presence or absence of the 2SC - normal\nquark mixed phase instead of only one of those phases is not so important\nfor the hybrid star cooling problem since the latter is governed by processes\ninvolving either normal excitations or excitations with the smallest gap.\n\n8\n\n\f2.4\n\nStability of Hybrid star configurations\n\nNot all compositions of hadronic and quark matter EoS's give stable configurations for compact objects, which could be demonstrated using the HHJ\nmodel EoS for hadronic and the two flavor nonlocal chiral model EoS for\nquark matter.\nThe mechanical structure of the spherically symmetric, static gravitational self-bound configurations of dense matter can be calculated with the\nwell-known Tolman-Oppenheimer-Volkoff equations. These are the conditions of hydrostatic equilibrium of self- gravitating matter, see also [2],\ndP (r)\n[ε(r) + P (r)][m(r) + 4πr 3 P (r)]\n=−\n.\ndr\nr[r − 2m(r)]\n\n(2)\n\nHere ε(r) is the energy density and P (r) the pressure at distance r from\nthe center of the star. The mass enclosed in a sphere with radius r is defined\nby\nZ r\nm(r) = 4π\nε(r ′)r ′2 dr ′ .\n(3)\n0\n\nThese equations are solved for given central baryon number densities,\nnB (r = 0), thereby defining a sequence of star configurations.\nThe configurations are stable if they are on the rising branch of the mass\n- central density relation.\nThe relation between pressure and energy density is given by the choice\nof the corresponding EoS model, which generally can be a function of temperature. The temperature is either constant for isothermal configurations,\nsee [1], or has some profile, when the cooling evolution is assumed to be a\nhydrodynamically quasi-stationary process.\nHot quark stars have been discussed, e.g., in [20, 47, 54].\nFor late cooling, when the temperatures are below T < 1 MeV the effects\nof temperature on the distribution of matter are negligible and the calculations for the star structure can be performed for the T = 0 case.\nDots in Fig. 2 indicate threshold densities for the DU process. The\npossibility of charged pion condensation is suppressed. Otherwise for n >\nnDU\nthe isotopic composition is changed in favor of increasing proton fraction\nc\nand a smaller critical density for the DU reaction. Deviations in the M(n)\nrelation for HHJ and NLW EoS are minor, whereas the DU thresholds are\nquite distinct.\n\n9\n\n\fIn Fig. 5 we show the mass-radius relation for hybrid stars with HHJ\nEoS vs. Gaussian nonlocal chiral quark separable model (SM) EoS. Configurations with possible 2SC phase given by the solid line, are stable, whereas\nthe hybrid star configurations without 2SC large gap color superconductivity\n(dash-dotted lines) are unstable. In case of \"HHJ-SM with 2SC\" the maximum neutron star mass proves to be 1.793 M⊙ . For an illustration of the\nconstraints on the mass-radius relation which can be derived from compact\nstar observations we show in Fig. 5 the compactness limits from the thermal emission of the isolated neutron star RX J1856.5-3754 as given in [55]\nand from the redshifted absorption lines in the X-ray burst spectra of EXO\n0748-676 given in [56]. These are, however, rather weak constraints.\n2\n1.8\n\nM [ Mo]\n\n1.6\n\n5)\n\n6 (z=0.3\n\n748-67\n\nEXO 0\n\n1.4\n1.2\n1\n\nHHJ -SM with 2SC\nHHJ -SM without 2SC\nHHJ\nRX J 1856-3754\n\n0.8\n0.6\n9\n\n10\n\n11\nR [km]\n\n12\n\n13\n\nFigure 5: Mass - radius relations for compact star configurations with different EoS: purely hadronic star with HHJ EoS (dashed line), stable hybrid\nstars with HHJ - Gaussian nonlocal chiral quark separable model (SM) with\n2SC phase (solid line) and with HHJ - SM, without 2SC phase (dash-dotted\nline). Data for two sources are also indicated, see [55, 56].\n\n10\n\n\f3\n3.1\n\nHeat transport, Neutrino production and\ndiffusion\nBoltzmann equation in curved space - time\n\nFor study of cooling evolution, we will use the diffusion approximation for\nneutrino transport, because it allows us easily to assess how global characteristics of the neutrino emission such as average energies, integrated fluxes, and\ntime scales change in response to various input parameters. This approach is\nsufficient to establish connections between the microphysical ingredients and\nthe duration of deleptonization and cooling time scales, which are necessary\nto estimate possible effects on neutrino signals. However, the detailed results\nof simulations for early cooling will not be presented in this lecture. The\nreader is referred to the works [57, 58] and citations within.\nWe will assume that the neutron star has an interior where the matter is\nspherically symmetric distributed. The evolution of the star will be assumed\nto be quasi stationary, which means that for each time step the velocity of\nthe matter is zero.\nThe Boltzmann equation (BE) for massless particles is\np\n\nβ\n\n∂f\nα γ ∂f\n−\nΓ\nβγ p\n∂xβ\n∂pα\n\n!\n\n=\n\ndf\ndτ\n\n!\n\n(4)\n\ncoll\n\nwhere f is the invariant neutrino distribution function, pα is the neutrino\n4-momentum and Γαβγ are the Christoffel symbols for the metric\ndτ 2 = −e2φ dt2 + e2Λ dr 2 + r 2 dθ2 + r 2 sin2 θ dΦ2\n\n(5)\n\nof static spherically symmetric space-time manifold.\nFor simplicity one can use the comoving basis and rewrite the BE\np\n\nb\n\neβb\n\n∂f\na c ∂f\n−\nΓ\nbc p\n∂xβ\n∂pa\n\n!\n\n=\n\ndf\ndτ\n\n!\n\n,\n\n(6)\n\ncoll\n\nwhere eβb are basis vectors in a comoving frame to an observer and in the\nstatic case they are diagonal. Indices a, b, c are running from 0 to 3. The Γabc\nare Ricci rotational coefficients with the non-zero components\nΓ100 = Γ001 = e−Λ\n\n∂φ\n,\n∂r\n\n11\n\n(7)\n\n\fΓ221 = −Γ122 = −Γ133 = Γ331 =\nΓ233 = −Γ332 = −\n\ne−Λ\n,\nr\n\ncot θ\n.\nr\n\nThe neutrino 4-momentum is\n\u0010\n\npa = ω, ωμ, ω(1 − μ2 )\n\n1/2\n\ncos Φ, ω(1 − μ2 )\n\n1/2\n\n\u0011\n\nsin Φ ,\n\nwhere μ is the cosine of the angle between the neutrino momentum and the\nradial direction, ω is the neutrino energy in a comoving frame. Using the\nprevious definitions we will have\n∂f\nωet0\n\n+\n\n∂t\n\n3.1.1\n\n∂f\nωμer1\n\n∂r\n\n−ω\n\n2\n\n∂f\nμΓ100\n\n∂ω\n\n2\n\n− ω(1 − μ )\n\n\u0010\n\nΓ100\n\n+\n\nΓ122\n\n\u0011 ∂f\n\n∂μ\n\n=\n\ndf\ndτ\n\n!\n\n(8)\n.\ncoll\n\nEquations in Linear response Approximation\n\nAfter applying the operator\n1\n2\n\nZ\n\n+1\n\ndμ μi ,\n\ni = 0, 1, 2, * * * ,\n\n−1\n\nto equation (8) and defining the ith moments [59]\n1\nMi =\n2\n\nZ\n\n+1\n−1\n\n1\ndμ μ f, Qi =\n2\ni\n\nZ\n\n+1\n\n−1\n\ndμ μ\n\ni\n\n!\n\ndf\ndτ\n\n.\ncoll\n\nwe get for i = 0\nω\n\n∂M0\net0\n∂t\n\n+\n\n∂M1\ner1\n∂r\n\n!\n\n−ω\n\n2\n\n∂M1\nΓ100\n∂ω\n\n!\n\n− 2ω(Γ100 + Γ122 )M1 = Q0 ,\n\n(9)\n\nand for i = 1\nω\n\n∂M1\net0\n∂t\n\n+\n\n∂M2\ner1\n∂r\n\n!\n\n−ω\n\n2\n\n∂M2\nΓ100\n∂ω\n\n!\n\n+ ω(Γ100 + Γ122 )(M0 − 3M2 ) = Q1 .(10)\n\nLet us introduce Nν , Fν , and SN as the number density, number flux and\nthe number source term, respectively,\nNν =\n\nZ\n\n∞\n0\n\ndω\nM0 ω 2 ,\n2π 2\n\nFν =\n\nZ\n\n∞\n0\n\ndω\nM1 ω 2 ,\n2π 2\n12\n\nSN =\n\nZ\n\n0\n\n∞\n\ndω\nQ0 ω,\n2π 2\n\n(11)\n\n\fwhile Jν , Hν , Pν , and SE are the neutrino energy density, energy flux, pressure, and the energy source term\nJν =\nPν =\n\nZ\n\nZ\n\n∞\n0\n∞\n0\n\ndω\nM0 ω 3 ,\n2\n2π\ndω\nM2 ω 3 ,\n2\n2π\n\nHν =\nSE =\n\nZ\n\nZ\n\n∞\n\n0\n∞\n\n0\n\ndω\nM1 ω 3 ,\n2\n2π\ndω\nQ0 ω 2 .\n2\n2π\n\n(12)\n\nAfter integration over the neutrino energy and utilizing the continuity equation under assumption of a quasi-static evolution, one can recover the well\nknown neutrino transport equation [60]\nSN\n∂(Nν /nB ) ∂(eφ 4πr 2 Fν )\n,\n+\n= eφ\n∂t\n∂a\nnB\n\n(13)\n\n∂(Jν /nB )\n∂(1/nB )\n∂(e2φ 4πr 2 Hν )\nSE\n.\n(14)\n+ Pν\n+ e−φ\n= eφ\n∂t\n∂t\n∂a\nnB\nThe distribution function in the diffusion approximation could be represented in the following way\nf (ω, μ) = f0 (ω) + μf1 (ω) ,\n\nω−μν\nf0 = [1 + e( kT ) ]−1 ,\n\n(15)\n\nwhere f0 (ω) is the distribution function in equilibrium (T = Tmat , μν =\nμeq\nν ) with the neutrino energy ω and the chemical potential μν respectively.\nHereafter the dependence of f0 and f1 on ω and non explicit dependence on\nspace-time coordinates will be assumed without listing in arguments.\nThus the moments Mi of the distribution function f are\n1\n1\nM0 = f0 , M1 = f1 , M2 = f0 ,\n3\n3\n\n1\nand M3 = f1 .\n5\n\n(16)\n\nTherefore the equation (10) now reads\n−Λ\n\ne\n\n∂f0\n∂φ ∂f0\n−ω\n∂r\n∂r ∂ω\n\n!\n\n=3\n\nQ1\n.\nω\n\n(17)\n\nThe collision term Q1 can be represented as\ndf\ndτ\n\n!\n\ncoll\n\nf\nf\n= ω ja (1 − f ) −\n+ js (1 − f ) −\nλa\nλs\n13\n\n!\n\n.\n\n(18)\n\n\fHere ja is the emissivity, λa is the absorptivity, js and λs are the scattering\ncontributions.\nNamely\nZ\n\n1\njs =\n(2π)3\n1\n1\n=\nλs\n(2π)3\n\nZ\n\n∞\n′\n\ndω ω\n\n0\n\nZ\n\n1\n\ndμ\n\n′\n\n−1\n\n∞\n\n0\n\n′2\n\n′\n\ndω ω\n\n′2\n\nZ\n\n1\n\ndμ\n\n−1\n\n′\n\nZ\n\nZ\n\n2π\n\n0\n\n2π\n\n0\n\ndΦ f (ω ′, μ′ )Rsin (ω, ω ′, cos θ) ,\n\n(19)\n\ndΦ [1 − f (ω ′, μ′ )]Rsout (ω, ω ′, cos θ) , (20)\n\nwhere θ is the scattering angle. The relation between emissivities and absorptivities (Rsin and Rsout are scattering kernels) is given by\neq\n1\n′\n= eβ(ω−μν ) ja (ω) and Rsin = eβ(ω −ω) Rsout .\nλa (ω)\n\n(21)\n\nUsing the Legendre expansion for the moments one has\nRlout =\n\nZ\n\n1\n\n−1\n\nd cos θ Pl (cos θ)Rsout (ω, ω ′, cos θ) .\n\n(22)\n\nPerforming the angular integrations of Eq. (18) one can define the relation\nbetween Q0 , Q1 and R0out , R1out .\nAfter substitution of the expression for Q1 into Eq.(17) the relation between f0 and f1 reads\n\"\n\n#\n\n\u0012\n\n∂f0\n1\n∂φ ∂f0 −Λ\nf1 = −D(ω)\ne , D(ω) = ja +\n+ κs1\n−ω\n∂r\n∂r ∂ω\nλa\n\n\u0013−1\n\n,\n\n(23)\n\n0\nand\nwhere D(ω) is the diffusion coefficient. Using the relation between ∂f\n∂r\n∂f0\nand the notation η = μν /T to be the neutrino degeneracy parameter, we\n∂ω\nobtain\n\"\n#\n!\n∂η\n∂f0\nω ∂(T eφ )\n−Λ\nT\nf1 = −D(ω)e\n−\n.\n(24)\n+\n∂r T eφ ∂r\n∂ω\n\nNow the energy-integrated lepton and energy fluxes are\nFν\nHν\n\n#\n\n\"\n\ne−Λ e−φ T 2\n∂(T eφ )\n∂η\n= −\nD3\n+ (T eφ )D2\n2\n6π\n∂r\n∂r\n#\n\"\nφ\n−Λ −φ 3\n∂(T e )\n∂η\ne e T\nφ\n.\nD4\n+ (T e )D3\n= −\n6π 2\n∂r\n∂r\n14\n\n(25)\n\n\fHere the coefficients D2 , D3 , and D4 are defined through the integrals over\nω as\nZ ∞\ndω ω n D(ω)f0(ω)(1 − f0 (ω)) .\nDn = T −(n+1)\n0\n\nThe explicit expression for the absorption mean free path is\n1\nG2\n= F2\nλa\nπ\n\nZ\n\n0\n\n∞\n\ndEe Ee2\n\n[1 − feq (Ee )]\n\nZ\n\n+1\n\nd cos θ\n\n−1\n\n(cos θ − 1)\n[AR1 + R2 + BR3 ](26)\n1 − e−z\n\n(cos θ − 1)\n[AR1 + R2 + BR3 ]\n(27)\n1 − e−z\nThe response functions written in terms of the polarization functions are\nRsout = 4G2F\n\nR\nR1 = (V 2 + A2 ) [Im ΠR\nL (q0 , q) + Im ΠT (q0 , q)]\n2\nR\nR2 = (V 2 + A2 ) Im ΠR\nT (q0 , q) − A Im ΠA (q0 , q)\nR3 = 2VA Im ΠR\nV A (q0 , q) ,\n\n(28)\n(29)\n(30)\n\nwhere the coupling constants for the absorption are V = gV cos(θc ) and A =\ngA cos(θc ) and for the scattering V = gV /2 and A = gA /2. θc is the Cabibbo\nangle, gV and gA are the vector and axial-vector couplings.\nIntroducing the s entropy per baryon and YL = (Nν +Ne +Nμ )/nB lepton\nnumber fraction and with help of conservation laws for energy and baryon\nnumber combined with Eqs. (13) and (14) we finally will obtain the energy\ntransport equation\n∂(e2φ 4πr 2Hν )\n+ μν e\n+\n=0\nTe\n∂t\n∂t\n∂a\nφ ∂s\n\nφ ∂YL\n\n(31)\n\nand the equation for lepton diffusion\n∂YL ∂(eφ 4πr 2 Fν )\n+\n= 0.\n∂t\n∂a\n\n(32)\n\nThe energy Hν and lepton Fν fluxes are defined in Eq.(25).\nThese coupled equations for the unknowns T and μν with the Eq.(2)\nfor the star structure completely describe the early cooling evolution of the\ncompact objects in quasi-stationary regime. The solutions and more detailed\ninformation one can find in [57]. In the next section we will use the energy\ntransport equation for consideration of late cooling evolution when the neutrinos are already untrapped, i.e. the mean free path λa is larger than the\nstar radius R and μν = 0.\n15\n\n\f3.2\n\nLate cooling evolution\n\nThe cooling scenario is described with a set of cooling regulators. In the\nregime without neutrino diffusion in the righthand side of Eq. (14) and\ntherefore also in Eq. (31) for energy transport we introduce the energy loss\nterm ǫν due to neutrino emission additional to SE and instead of the Hν we\nuse the total energy flux function l(r, t). The temperature profile T (r, t) is\nthe one time dependent unknown dynamical quantity and during the cooling\nprocess due to an inhomogeneous distribution of the matter inside the star\nand the finite heat conductivity it can differ from the isothermal one. The\nheat conductivity κ (the corresponding term to D4 in Eq. (31)) determines\nthe relation between l(r, t) and gradient of T (r, t). In isothermal age the\ntemperature on the inner crust boundary (Tm ) and the central temperature\n(Tc ) are connected by the relation Tm = Tc exp[φ(0)−φ(R)]. Here φ(0)−φ(R)\nis the difference of the gravitational potentials in the center and at the surface\nof the star, respectively.\nThe flux of energy l(r) per unit time through a spherical slice at the\ndistance r from the center, is proportional to the gradient of the temperature\non both sides of this slice,\ns\n\n∂(T eφ ) −φ\n2M\nl(r) = −4πr 2 κ(r)\n1−\ne\n,\n∂r\nr\n\n(33)\n\nq\n\ncorresponds to the relativistic correction of the\nwhere the factor e−φ 1 − 2M\nr\ntime scale and the unit of thickness. The equations for energy balance and\nthermal energy transport are [3]\n!\n\n∂ \u0010 2φ \u0011\n1\n∂\n= −\nle\nǫν e2φ + cV (T eφ ) ,\n(34)\n∂A\nn\n∂t\n1 leφ\n∂ \u0010 φ\u0011\n= −\nTe\n,\n(35)\n∂A\nκ 16π 2 r 4 n\nwhere n = n(r) is the baryon number density, A = A(r) is the total baryon\nnumber within a sphere of radius r. One has\ns\n\n∂r\n2M\n1\n1−\n=\n.\n2\n∂A\n4πr n\nr\n\n(36)\n\nThe total neutrino emissivity ǫν and the total specific heat cV are given as the\nsum of the corresponding partial contributions defined in the next subsections. The density profiles ni (r) of the constituents i of the matter are under\n16\n\n\fthe conditions of the actual temperature profile T (r, t). The accumulated\nmass M = M(r) and the gravitational potential φ = φ(r) can be determined\nby\ns\n\n∂M\n2M\nε\n1−\n=\n,\n∂A\nn\nr\n4πr 3 p + M\n1\n∂φ\nq\n=\n∂A\n4πr 2 n\n1−\n\n(37)\n2M\nr\n\n,\n\n(38)\n\nwhere the energy density profile ε = ε(r) and the pressure profile p = p(r) is\ndefined by the condition of hydrodynamical equilibrium (see Eq. 2)\n∂p\n∂φ\n= −(p + ε)\n.\n∂A\n∂A\n\n(39)\n\nThe boundary conditions for the solution of (34) and (35) read l(r = 0) =\nl(A = 0) = 0 and T (A(rm ) = A, t) = T (rm = R, t) = Tm (t), respectively.\nIn our examples we choose the initial temperature to be 1 MeV. This\nis a typical value for the temperature Topacity at which the star becomes\ntransparent for neutrinos. Simplifying we disregard the neutrino influence\non transport. These effects dominate for t < 1 ÷ 100 min, when the star\ncools down to T ≤ Topacity and become unimportant for later times.\n3.2.1\n\nNeutrino Processes in dense matter\n\nWe compute the NS thermal evolution adopting our fully general relativistic\nevolutionary code. This code was originally constructed for the description\nof hybrid stars by [17]. The main cooling regulators are the thermal conductivity, the heat capacity and the emissivity.\nEmissivity\nThe luminosities are calculated using the corresponding matrix element of\nthe neutrino production process\nZ\n\nd 3 pn\n...\n(2π)3 2En\n\nZ\n\nd 3 pν\nδ 3 (~pi )δ(Ei ) |Mf i |2 fn (1 − fp )(1 − fe ).\n(2π)3 2Eν\n(40)\nThe most effective process of neutrino production is the direct Urca (DU)\none, n −→ p + e− + ν̄e , which is allowed when the momentum conservation\n\nLν = (2π)4\n\n17\n\n\fholds p~F,n = p~F,p + p~F,e ⇔ |~pF,n| ≤ |~pF,p| + |~pF,e |. Since DU process is\nso intensive that as soon as it takes place the star cools too fast for better\ncorrespondence between the cooling simulations and the observational data,\nit is likely to assumed DU to be forbidden in the interior of the star.\nThe other processes, i.e. the modified Urca (MU), pair breaking and\nformation (PBF) and bremsstrahlung are the main ones governing the cooling\nin hadronic matter. The modified Urca (MU) nn → npeν̄, np → ppeν̄, has to\nbe medium modified Urca (MMU) process due to the softening of in-medium\npion propagator. The final emissivity is given by [9, 62]\n1/3\nǫnMU\n= 8.6 × 1021 m∗4\nζnMU T98 ergcm−3 s−1 ,\nν\nnMU (Ye u)\n1/3\nǫpMU\n= 8.5 × 1021 m∗4\nζpMU T98 ergcm−3 s−1 .\nν\npMU (Ye u)\n\nq\n\n(41)\n(42)\n\n2\nHere m∗i = m∗2\nrel,i + pF,i is the non-relativistic quasiparticle effective mass\nrelated to the in-medium one-particle energies from a given relativistic mean\nfield model for i = n, p. We have introduced the abbreviations m∗4\nnMU =\n∗\n3\n∗\n(m∗n /mn )3 (m∗p /mp ) and m∗4\n=\n(m\n/m\n)\n(m\n/m\n).\nThe\nsuppression\nfacp\nn\npM U\np\nn\n2\ntors are ζnMU = ζn ζp ≃ exp{−[∆n (T )+∆p (T )]/T }, ζpMU ≃ ζp , and should be\nreplaced by unity for T > Tcrit,i , when for given species i the corresponding\ngap vanishes. For neutron and proton S-wave pairing is ∆i (0) = 1.76 Tcrit,i\nand for the P -wave pairing of neutrons ∆n (0) = 1.19 Tcrit,n (see Fig. 6).\nThe gap as a function\nof temperature is given by the interpolation formula\nq\n∆N (T ) = ∆(0) 1 − T /Tcrit,N .\nTo be conservative we have used in (41) the free one-pion exchange estimate of the NN interaction amplitude. Restricting ourselves to a qualitative\nanalysis we use here simplified exponential suppression factors ζi . In a more\ndetailed analysis these ζi -factors have prefactors with rather strong temperature dependences [62]. At temperatures T ∼ Tc their inclusion only slightly\naffects the resulting cooling curves. For T ≪ Tc the MU process gives in\nany case a negligible contribution to the total emissivity and thereby corresponding modifications can again be omitted. Also for the sake of simplicity\nthe general possibility of a 3 P2 (|mJ | = 2) pairing which may result in a\npower-law behaviour of the specific heat and the emissivity of the MU process [61, 62, 63] is disregarded since mechanisms of this type of pairing are up\nto now not elaborated. Even more essential modifications of the MU rates\nmay presumably come from in-medium effects which could result in extra\nprefactors of 102 ÷ 103 already at T ∼ Tc .\n\n18\n\n\f0.06\n\n2\n\n∆3P [MeV]\n\n2\n\n∆ [MeV]\n\n1.5\n\n1\n\n0.03\n\nn 1S0\nn 3P2\np 1S0\n\n0\n0.5\n\n1\n\n2\n\nn / n0\n\n4\n\n0.5\n\n0\n0.01\n\n0.1\n\n1\n\nn / n0\n\nFigure 6: Neutron and proton pairing gaps according to model I (thick solid,\ndashed and dotted lines) and according to model II (thin lines), see text. The\n1S0 neutron gap is the same in both models, taken from [64].\n\nIn order to estimate the role of the in-medium effects in the NN interaction for the HNS cooling we have also performed calculations for the so-called\nmedium modified Urca (MMU) process [65, 66] by multiplying the rates (41)\nby the appropriate prefactor\nh\n\ni\n\ne 8 (k ≃ pF ) u10/3 ,\nǫMMU\n/ǫMU\n≃ 103 Γ6 (g ′ )/ω\nν\nν\n\n(43)\n\nwhere the value Γ(g ′) ≃ 1/[1+1.4 u1/3 ] is due to the dressing of πNN vertices\ne ≤ mπ is the effective pion gap which we took as function of density\nand ω\nfrom Fig. 2 of [67].\nFor T < Tcrit the most important contribution comes from the neutron\n[63, 62] and the proton [63] pair breaking and formation processes. We take\ntheir emissivities from Ref. [67], which is applicable for both cases, S- and\nP -wave nucleon pairing\nǫnPBF\n= 6.6 × 1028 (m∗n /mn )(∆n (T )/MeV)7 u1/3\nν\n×ξ I(∆n (T )/T ) erg cm−3 s−1 ,\nǫpPBF\n= 0.8 × 1028 (m∗p /mp )(∆p (T )/MeV)7 u2/3\nν\n19\n\n(44)\n\n\f× I(∆p (T )/T ) erg cm−3 s−1 ,\nwhere\nI(∆i (T )/T ) ≃ 0.89\n\nq\n\nT /∆i (T ) exp[−2∆i (T )/T ] ,\n\n(45)\n(46)\n\nξ ≃ 0.5 for 1 S0 pairing and ξ ≃ 1 for 3 P2 pairing.\nA significant contribution of the proton channel is due to the NN correlation effects, which are taken into account in [63].\nThe phonon contribution to the emissivity of the 3P2 superfluid phase is\nnegligible. The main emissivity regulators are the MMU Eq. (43) and the\nneutron (nPBF) and proton (pPBF) pair breaking and formation processes\nEq. (44), see above for a rough estimation. Finally, we include the effect of\na pion condensate (PU process), where the PU emissivity is about 1-2 orders\nof magnitude smaller than the DU one.\nAll emissivities are corrected by correlation effects. We adopt the same\nset of partial emissivities as in the work of [67].\nIn quark matter the process d −→ u + e− + ν̄e is always allowed unless it\nis suppressed by huge energy gaps due to quark pairing.\nǫQDU\n≃ 9.4 × 1026 αs uYe1/3 ζQDU T96 erg cm−3 s−1 ,\nν\n\n(47)\n\nwhere at a compression u = n/n0 ≃ 2 the strong coupling constant is αs ≈ 1\nand decreases logarithmically at still higher densities. The nuclear saturation\ndensity is n0 = 0.17 fm−3 , Ye = ne /n is the electron fraction, and T9 is the\ntemperature in units of 109 K. If, for a somewhat higher density, the electron\nfraction was too small (Ye < Yec ≃ 10−8 ), then all the QDU processes would\nbe completely switched off [68] and the neutrino emission would be governed\nby two-quark reactions like the quark modified Urca (QMU) and the quark\nbremsstrahlung (QB) processes dq → uqeν̄ and q1 q2 → q1 q2 ν ν̄, respectively.\nThe emissivities of the QMU and QB processes have been estimated as [69]\nǫQMU\n∼ ǫQB\n≃ 9.0 × 1019 ζQMU T98 erg cm−3 s−1 .\nν\nν\n\n(48)\n\nDue to the pairing, the emissivities of QDU processes are suppressed by a\nfactor ζQDU ∼ exp(−∆q /T ) and the emissivities of QMU and QB processes\nare suppressed by a factor ζQMU ∼ exp(−2∆q /T ) for T < Tcrit,q ≃ 0.4 ∆q\nwhereas for T > Tcrit,q these factors are equal to unity. The modification of\nTcrit,q (∆q ) relative to the standard BCS formula is due to the formation of\n20\n\n\fcorrelations as, e.g., instanton- anti-instanton molecules [71]. For the temperature dependence\nof the gap below Tcrit,q we use the interpolation formula\nq\n∆(T ) = ∆(0) 1 − T /Tcrit,q , with ∆(0) being the gap at zero temperature.\nThe contribution of the reaction ee → eeν ν̄ is very small [70]\n12\n1/3 1/3 8\nǫee\nT9 erg cm−3 s−1 ,\nν = 2.8 × 10 Ye u\n\n(49)\n\nbut can become important, when quark processes are blocked out for large\nvalues of ∆q /T in superconducting quark matter.\nThermal conductivity\nThe heat conductivity of the matter is the sum of the partial contributions\n[72, 73]\nX\nX 1\n1\nκi ,\nκ=\n=\n,\n(50)\nκi\ni\nj κij\nwhere i, j denote the components (particle species).\nThe contribution of neutrons and protons is\nκnn = 8.3 × 10\n\n22\n\nmn\nm∗n\n\n!4\n\nzn3 ζn\nerg s−1 cm−1 K−1 ,\nSkn T9\n\nSkn = 0.38 zn−7/2 + 3.7 zn2/5 ,\nκnp = 8.9 × 1016\n\nmn\nm∗n\n\n!2\n\nzn2 ζp T9\nerg s−1 cm−1 K−1 ,\n3\nzp Skp\n\nSkp = 1.83 zn−2 + 1.43 zn2 (0.4 + zn8 )−1 .\n\n(51)\n(52)\n(53)\n(54)\n\nHere we have introduced the appropriate suppression factors ζi which\nact in the presence of gaps for superfluid hadronic matter (see Fig. 6) and\nwe have used the abbreviation zi = (ni /(4n0 ))1/3 . The heat conductivity of\nelectrons is given by Eq. (57). The total contribution related to electrons is\nthen\n1/κe = 1/κee + 1/κep .\n\n(55)\n\nSimilar expressions we have for neutrons and protons using Eqs. (51)-(54).\nThe total thermal conductivity is the straight sum of the partial contributions κtot = κe + κn + ... . Other contributions to this sum are smaller\nthan those presented explicitly (κe and κn ).\n21\n\n\fFor quark matter κ is the sum of the partial conductivities of the electron,\nquark and gluon components [73, 74]\nκ = κe + κq + κg ,\n\n(56)\n\nwhere κe ≃ κee is determined by electron-electron scattering processes since\nin superconducting quark matter the partial contribution 1/κeq (as well as\n1/κgq ) is additionally suppressed by a ζQDU factor, as for the scattering on\nimpurities in metallic superconductors. For κee we have\nκee = 5.5 × 1023 u Ye T9 −1 erg s−1 cm−1 K−1 ,\n\n(57)\n\nand\nκq ≃ κqq ≃ 1.1 × 1023\n\nq\n\n4π\nαs\n\nu ζQDU T9 −1 erg s−1 cm−1 K−1 ,\n\n(58)\n\nwhere we take into account the suppression factor. We estimate the contribution of massless gluons as\nκg ≃ κgg ≃ 6.0 × 1017 T92 erg s−1 cm−1 K−1 .\n\n(59)\n\nHeat capacity\nThe heat capacity contains nucleon, electron, photon, phonon, and other\ncontributions. The main in-medium modification of the nucleon heat capacity\nis due to the density dependence of the effective nucleon mass. We use\nthe same expressions as [67]. The main regulators are the nucleon and the\nelectron contributions. For the nucleons (i = n, p), the specific heat is [9]\nci ∼ 1.6 × 1020 (m∗i /mi ) (ni /n0 )1/3 ζii T9 erg cm−3 K−1 ,\n\n(60)\n\nand for the electrons it is\nce ∼ 6 × 1019 (ne /n0 )2/3 T9 erg cm−3 K−1 .\n\n(61)\n\nNear the phase transition point the heat capacity acquires a fluctuation contribution. For the first order pion condensation phase transition this additional contribution contains no singularity, unlike the second order phase\ntransition, see [66]. Finally, the nucleon contribution to the heat capacity\nmay increase up to several times in the vicinity of the pion condensation\n22\n\n\fpoint. The effect of this correction on global cooling properties is rather\nunimportant.\nThe symmetry of the 3P2 superfluid phase allows a Goldstone boson\n(phonon) contribution of\ncG ≃ 6 * 1014 T93 erg cm−3 K−1 ,\n\n(62)\n\nfor T < Tcn (3P2 ), n > ncn (3P2 ). We include this contribution in our study\ntoo, although its effect on the cooling is rather minor.\nFor the quark specific heat we use the expression [69]\ncq ≃ 1021 u2/3 ζS T9 erg cm−3 K−1 ,\n\n(63)\n\nwhere ζS ≃ 3.1 (Tcrit,q /T )5/2 exp(−∆q /T ). Besides, one should add the gluonphoton contribution [15]\ncg−γ = 3.0 × 1013 Ng−γ T93 erg cm−3 K−1 ,\n\n(64)\n\nwhere Ng−γ is the number of available massless gluon-photon states (which\nare present even in the color superconducting phase), as well as the electron\ncontribution,\nce = 5.7 × 1019 Ye2/3 u2/3 T9 erg cm−3 K−1 .\n\n4\n\n(65)\n\nResults of simulations for Cooling evolution\n\nWe compute the neutron star thermal evolution adopting our fully general\nrelativistic evolutionary code. The code originally constructed for the description of hybrid stars by [17] has been developed and updated according\nto the modern knowledge of inputs in [18].\nThe density n ∼ 0.5 ÷ 0.7 n0 is the boundary of the neutron star interior\nand the inner crust. The latter is constructed of a pasta phase discussed by\n[75], see also recent works of [76, 77].\nFurther on we need a relation between the crust and the surface temperature for neutron star. A sharp change of the temperature occurs in the\nenvelope. This Ts − Tin relation has been calculated in several works, see\n[78, 79], depending on the assumed value of the magnetic field at the surface\n23\n\n\fand some uncertainties in our knowledge of the structure of the envelope. For\napplications we use three different approximations: the simplified \"Tsuruta\nlaw\" TsTsur = (10 Tin )2/3 used in many old cooling calculations, models used\nby Ref. [79], and our fit formula interpolating two extreme curves describing\nthe borders of region of available Ts − Tin relation, taken from [79] (see Fig.\n4 of Ref. [80]).\n\n4.1\n\nCooling Evolution of Hadronic Stars\n\nHere we will shortly summarize the results on hadronic cooling.\nIn framework of a \"minimal cooling\" scenario, the pair breaking and\nformation (PBF) processes may allow to cover an \"intermediate cooling\"\ngroup of data (even if one artificially suppressed medium effects)[67]. These\nprocesses are very efficient for large pairing gaps and temperatures being not\nmuch less than the value of the gap.\nGaps, which we have adopted in the framework of the \"nuclear medium\ncooling\" scenario, see [80], are presented in Fig. 6. Thick dashed lines show\nproton gaps which were used in the work of [8] performed in the framework\nof the \"standard plus exotics\" scenario. We will call the choice of the \"3nt\"\nmodel from [8] the model I. Thin lines show 1S0 proton and 3P2 neutron gaps\nfrom [81], for the model AV18 by [82] (we call it the model II). Recently [83]\nhas argued for a strong suppression of the 3P2 neutron gaps, down to values\n∼ 10 keV, as the consequence of the medium-induced spin-orbit interaction.\nThese findings motivated [80] to suppress values of 3P2 gaps shown in\nFig. 6 by an extra factor f (3P2, n) = 0.1. Further possible suppression of\nthe 3P2 gap is almost not reflected on the behavior of the cooling curves.\nContrary to expectations of [83] a more recent work of [84] argued that the\n3P2 neutron pairing gap should be dramatically enhanced, as the consequence\nof the strong softening of the pion propagator. According to their estimate,\nthe 3P2 neutron pairing gap is as large as 1 ÷ 10 MeV in a broad region of\ndensities, see Fig. 1 of their work. Thus results of calculations of [83] and\n[84], which both had the same aim to include medium effects in the evaluation\nof the 3P2 neutron gaps, are in a deep discrepancy with each other.\n• Including superfluid gaps we see, in agreement with recent microscopic\nfindings of [83], that the 3P2 neutron gap should be as small as 10 keV\nor less. So the \"nuclear medium cooling\" scenario of [80] supports\nresults of [83] and fails to appropriately fit the neutron star cooling\n24\n\n\fCooling for HJ EoS (AV18)\n\nRX J1865-3754\n\nCTA 1\n\n0\n\n1\n\n2\n\n3\n\n4\n\nPSR 1055-52\n\nPSR 0656+14\n\n5.8\n\n5.6\n\n1.000\n1.100\n1.250\n1.320\n1.400\n1.480\n1.600\n1.700\n1.750\n1.930\n\nGeminga\n\n6\nVela\n\nlog(Ts [K])\n\n6.2\n\nRX J0822-43\n\nPSR J0205+64 in 3C58\n\nCrab\n\n6.4\n\n1E 1207-52\nRX J0002+62\n\nOur crust , with medium effects, 3P2*0.1\n\n5\n\n6\n\n7\n\nlog(t[yr])\n\nFigure 7: Cooling curves for the gaps from Fig. 6 for model II (the same\nas Fig. 21 of [80]). The original 3P2 neutron pairing gap is additionally\nsuppressed by a factor f (3P2 , n) = 0.1. The Ts − Tin relation is given by \"our\nfit\" curve of Fig. 4 in [80]. For more details see [80].\n\ndata when a strong enhancement of the 3P2 neutron gaps is assumed\nas shown by [85].\n• Medium effects associated with the pion softening are called for by the\ndata. As the result of the pion softening the pion condensation may\noccur for n ≥ nPU\n(n ≥ 3n0 in our model). Its appearance at such\nc\nrather high densities does not contradict to the cooling data (see Fig.\n7), but also the data are well described using the pion softening but\nwithout assumption on the pion condensation. The similar argumentation holds also for DU threshold density. That puts restrictions on the\ndensity dependence of the symmetry energy. Both statements might\nbe important in the discussion of the heavy ion collision experiments.\n• We demonstrated a regular mass dependence for neutron stars with\nmasses M > 1 M⊙ , where less massive neutron stars cool down slower\nand more massive neutron stars cool faster. This feature is more general\nand concerning also to hybrid stars [86].\n\n25\n\n\fCooling of Hybrid stars with 2SC Quark core\n\nRX J1865-3754\n\n5.8\nCTA 1\n\n5.6\n\n1\n\n2\n\n3\n\n4\n\nPSR 1055-52\n\nGeminga\n\nPSR 0656+14\n\n6\nVela\n\nlog(Ts [K])\n\n6.2\n\n1.000\n1.214 critical\n1.217\n1.220\n1.248\n1.323\n1.793\n\n1E 1207-52\nRX J0002+62\n\nPSR J0205+64 in 3C58\n\nCrab\n\n6.4\n\nRX J0822-43\n\nHJ (Y - 3P2*0.1) with K = 240 MeV with Med. effects, our crust, Gaussian FF\n\n5\n\n6\n\n7\n\nlog(t[yr])\n\nFigure 8: Model I. Cooling curves for hybrid star configurations with Gaussian quark matter core in the 2SC phase. The labels correspond to the\ngravitational masses of the configurations in units of the solar mass.\n\n4.2\n\nCooling Evolution of Hybrid Stars with 2SC Quark\nMatter Core\n\nFor the calculation of the cooling of the quark core in the hybrid star we\nuse the model [18]. We incorporate the most efficient processes: the quark\ndirect Urca (QDU) processes on unpaired quarks, the quark modified Urca\n(QMU), the quark bremsstrahlung (QB), the electron bremsstrahlung (EB),\nand the massive gluon-photon decay (see [15]). Following [87] we include the\nemissivity of the quark pair formation and breaking (QPFB) processes, too.\nThe specific heat incorporates the quark contribution, the electron contribution and the massless and massive gluon-photon contributions. The heat\nconductivity contains quark, electron and gluon terms.\nThe calculations are based on the hadronic cooling scenario presented in\nFig. 7 and we add the contribution of the quark core. For the Gaussian\nform-factor the quark core occurs already for M > 1.214 M⊙ according to\nthe model [47], see Fig. 5. Most of the relevant neutron star configurations\n(see Fig. 7) are then affected by the presence of the quark core.\nFirst we check the possibility of the 2SC+ normal quark phases, see Fig.\n8.\n26\n\n\fThe variation of the gaps for the strong pairing of quarks within the 2SC\nphase and the gluon-photon mass in the interval mg−γ ∼ 20 ÷ 200 MeV only\nslightly affects the results. The main cooling process is the QDU process on\nnormal quarks. We see that the presence of normal quarks entails too fast\ncooling. The data could be explained only, if all the masses lie in a very\nnarrow interval (1.21 < M/M⊙ < 1.22 in our case). In case of the other two\ncrust models the resulting picture is similar.\nThe existence of only a very narrow mass interval, in which the data can\nbe fitted seems to us unrealistic by itself. Moreover the observations show\nexistence of neutron stars in binary systems with very different masses, e.g.,\nMB1913+16 ≃ 1.4408 ± 0.0003 M⊙ and MJ0737−3039B ≃ 1.250 ± 0.005 M⊙ , cf.\n[88]. Thus the data can't be satisfactorily explained.\nThen we assume a possibility of an yet unknown X-pairing channel with a\nsmall ∆X gap and first check the case ∆X to be constant. For ∆X ≃ 1 MeV\nthe cooling is too slow [18]. This is true for all three crust models. Thus the\ngaps for formerly unpaired quarks should be still smaller in order to obtain\na satisfactory description of the cooling data.\nFor the ∆X = 30 keV the cooling data can be fitted but have a very\nfragile dependence on the gravitational mass of the configuration. Namely,\nwe see that all data points, except the Vela, CTA 1 and Geminga, correspond\nto hybrid stars with masses in the narrow interval M = 1.21 ÷ 1.22 M⊙\nTherefore we would like to explore whether a density-dependent X-gap\ncould allow a description of the cooling data within a larger interval of compact star masses.\nWe employ an ansatz for the X-gap as a decreasing function of the chemical potential\n(66)\n∆X (μ) = ∆c exp[−α(μ − μc )/μc ] ,\nwhere the parameters are chosen such that at the critical quark chemical\npotential μc = 330 MeV the onset of the deconfinement phase transition\nfor the X-gap has its maximal value of ∆c = 1.0 MeV and at the highest\nattainable chemical potential μmax = 507 MeV, i.e. in the center of the\nmaximum mass hybrid star configuration, it falls to a value of the order of\n10 keV. We choose the value α = 10 for which ∆X (μmax ) = 4.6 keV. In Fig.\n9 we show the resulting cooling curves for the gap model II with gap ansatz\neq. (66), which we consider as the most realistic one.\nWe observe that the mass interval for compact stars which obeys the\ncooling data is constrained between M = 1.32 M⊙ for slow coolers and\n27\n\n\fM = 1.75 M⊙ for fast coolers such as Vela. This results we obtain are\nbased on a purely hadronic model with different choices of the parameters\n[80]. Note that according to a recently suggested independent test of cooling\nmodels [89] by comparing results of a corresponding population synthesis\nmodel with the Log N - Log S distribution of nearby isolated X-ray sources\nthe cooling model I did not pass the test. Thereby it would be interesting to\nsee, whether our quark model within the gap ansatz II could pass the Log N\n- Log S test.\nCooling of Hybrid stars with 2SC Quark core\n\nRX J1865-3754\n\nPSR 1055-52\n\nPSR 0656+14\n\nCTA 1\n\n5.8\n\n1.000\n1.100\n1.214 critical\n1.248\n1.323\n1.420\n1.496\n1.597\n1.641\n1.706\n1.793\n\nGeminga\n\n6\nVela\n\nlog(Ts [K])\n\n6.2\n\nRX J0822-43\n\nPSR J0205+64 in 3C58\n\n6.4\n\n1E 1207-52\nRX J0002+62\n\nCrab\n\nHJ (Y - 3P2*0.1) with K = 240 MeV with Med. effects, our crust, Gaussian FF\n\n5.6\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\nlog(t[yr])\n\nFigure 9: Cooling curves for hybrid star configurations with Gaussian quark\nmatter core in the 2SC phase with a density dependent pairing gap according\nto Eq. (66) for model II.\n\n5\n\nConclusions\n\nIn this lecture devoted to the modern problems of the cooling evolution of\nneutron stars we have discussed different successful scenarios aiming to explain the known temperature - age data from observations of compact objects. Using up today known theoretical and experimental constraints on the\nstructure and cooling regulators of compact star we end up with alternative\nexplanations. The neutron star can be either pure hadronic or hybrid one\nwith a quark core in superconducting state of matter.\n28\n\n\fParticularly, for the hybrid stars, which are more intrigued alternative of\nsuperdense compact objects we conclude that:\n• Within a nonlocal, chiral quark model the critical densities for a phase\ntransition to color superconducting quark matter can be low enough\nfor these phases to occur in compact star configurations with masses\nbelow 1.3 M⊙ .\n• For the choice of the Gaussian form-factor the 2SC quark matter phase\narises at M ≃ 1.21 M⊙ .\n• Without a residual pairing the 2SC quark matter phase could describe\nthe cooling data only if compact stars had masses in a very narrow\nband around the critical mass for which the quark core can occur.\n• Under assumption that formally unpaired quarks can be paired with\nsmall gaps ∆X < 1 MeV (2SC+X pairing), which values we varied in\nwide limits, only for density dependent gaps the cooling data can be\nappropriately fitted.\nSo the present day cooling data could be still explained by hybrid stars,\nassuming a complex pairing pattern, where quarks are partly strongly paired\nwithin the 2SC channel, and partly weakly paired with gaps ∆X < 1 MeV,\nwhich are rapidly decrease with an increase of the density.\nIt remains to be investigated which microscopic pairing pattern could\nfulfill the constraints obtained in this work. Another indirect check of the\nmodel could be the Log N - Log S test.\n\nAcknowledgments\nThe research has been supported by the Virtual Institute of the Helmholtz\nAssociation under grant No. VH-VI-041 and by the DAAD partnership programm between the Universities of Yerevan and Rostock. In particular I acknowledge D. Blaschke for his active collaboration and support. I thank my\ncolleagues D. Blaschke, D.N. Voskresensky, D.N. Aguilera, J. Berdermann,\nand A. Reichel for collaboration and discussions. I also thank the organizers\nof the organizers of the Helmholtz International Summer School and Workshop on Hot points in Astrophysics and Cosmology for their invitation to\npresent these lectures.\n----\n29\n\n\fReferences\n[1] S. L. Shapiro and S. A. Teukolsky, Black Holes, White Dwarfs, And\nNeutron Stars (Wiley, New York, 1983).\n[2] N. K. Glendenning, Compact Stars, (New York: Springer, 1996);\nN. K. Glendenning, Compact Stars: Nuclear Physics, Particle Physics,\nAnd General Relativity, (Springer, New York & London, 2000).\n[3] F. Weber, Pulsars as Astrophysical Laboratories for Nuclear and Particle\nPhysics, (Bristol: IoP Publishing, 1999).\n[4] D. Page, J. M. Lattimer, M. Prakash and A. W. Steiner, Astrophys.J.,\nSupliment, arXiv:astro-ph/0403657, (2004).\n[5] S. Tsuruta, M. A. Teter, T. Takatsuka, T. Tatsumi and R. Tamagaki,\nAstrophys. J. 571, (2002) L143.\n[6] S. Tsuruta, in: Proceedings of IAU Symposium \"Young Neutron Stars,\nand their Environments\", F. Camilo, B.M. Gaensler (Eds.), 218, (2004).\n[7] A. D. Kaminker, D. G.\narXiv:astro-ph/0111429, (2001).\n\nYakovlev\n\nand\n\nO.\n\nY.\n\nGnedin,\n\n[8] D. G. Yakovlev, O. Y. Gnedin, A. D. Kaminker, K. P. Levenfish and\nA. Y. Potekhin, Adv. Space Res. 33, (2004) 523.\n[9] B. Friman, and O. V. Maxwell, Astrophys. J, 232 (1979) 541.\n[10] S. Tsuruta, Phys. Rep., 56, (1979) 237.\n[11] M. G. Alford, Ann. Rev. Nucl. Part. Sci. 51, (2001) 131.\n[12] M. Kitazawa, T. Koide, T. Kunihiro and Y. Nemoto, Phys. Rev. D 65,\n(2002) 091504.\n[13] D. N. Voskresensky, Phys. Rev. C 69, (2004) 065209.\n[14] D. Blaschke, N.K. Glendenning, A. Sedrakian (Eds.), Physics of Neutron\nStar Interiors, Springer, Berlin (2001).\n[15] D. Blaschke, T. Klähn and D. N. Voskresensky, Astrophys. J. 533,\n(2000) 406.\n30\n\n\f[16] D. Page, M. Prakash, J. M. Lattimer and A. Steiner, Phys. Rev. Lett.\n85, (2000) 2048.\n[17] D. Blaschke, H. Grigorian and D. N. Voskresensky, Astron. Astrophys.\n368, (2001) 561.\n[18] H. Grigorian, D. Blaschke and D. Voskresensky, Phys. Rev. C 71,\n(2005) 045801; D. Blaschke, D. N. Voskresensky and H. Grigorian,\narXiv:astro-ph/0403171. (2005)\n[19] A. Bender, D. Blaschke, Y. Kalinovsky and C. D. Roberts, Phys. Rev.\nLett. 77, (1996) 3724; D. Blaschke, C. D. Roberts and S. M. Schmidt,\nPhys. Lett. B 425, (1998) 232; C. D. Roberts and S. M. Schmidt, Prog.\nPart. Nucl. Phys. 45, (2000) S1.\n[20] D. Blaschke, H. Grigorian, G. S. Poghosyan, C. D. Roberts and\nS. M. Schmidt, Phys. Lett. B 450, (1999) 207.\n[21] J. C. R. Bloch, C. D. Roberts and S. M. Schmidt, Phys. Rev. C 60,\n(1999) 065208.\n[22] G. V. Carter, S. Reddy, Phys. Rev. D 62, (2000) 103002.\n[23] M. Alford, K. Rajagopal, and F. Wilczek, Phys. Lett. B 422, (1998)\n147.\n[24] R. Rapp, T. Schäfer, E.V. Shuryak, and M. Velkovsky, Phys. Rev. Lett.\n81, (1998) 53.\n[25] A. Akmal, V.R. Pandharipande, and D.G. Ravenhall, Phys. Rev. C 58,\n(1998) 1804.\n[26] M. Baldo, I. Bombaci and G. F. Burgio, Astron. Astrophys. 328, (1997)\n274.\n[27] W. Zuo, A. Lejeune, U. Lombardo and J. F. Mathiot, Nucl. Phys. A\n706, (2002) 418.\n[28] H. Heiselberg and M. Hjorth-Jensen, Astrophys. J. 525, (1999) L45.\n[29] T. Gaitanos, M. Di Toro, S. Typel, V. Baran, C. Fuchs, V. Greco and\nH. H. Wolter, Nucl. Phys. A 732, (2004) 24.\n31\n\n\f[30] E.N.E. van Dalen, C. Fuchs, and A. Faessler, Nucl. Phys. A 744, (2004)\n227.\n[31] S. Typel, arXiv:nucl-th/0501056, (2005).\n[32] E. E. Kolomeitsev and D. N. Voskresensky, Phys. Rev. C 68, (2003)\n015803.\n[33] M. Alford, K. Rajagopal and F. Wilczek, Phys. Lett. B 450, (1999) 325.\n[34] D. Blaschke and C. D. Roberts, Nucl. Phys. A 642, (1998) 197.\n[35] K. Rajagopal and F. Wilczek, arXiv:hep-ph/0011333, (2000).\n[36] M. Buballa, Phys. Rep. 407, (2005) 205.\n[37] A. Schmitt, Phys. Rev. D 71, (2005) 054016.\n[38] J. E. Horvath, O. G. Benvenuto and H. Vucetich, Phys. Rev. D 44,\n(1991) 3797.\n[39] D. Blaschke, D. M. Sedrakian and K. M. Shahabasian, Astron. Astrophys. 350, (1999) L47.\n[40] M. G. Alford, J. Berges and K. Rajagopal, Nucl. Phys. B 571, (2000)\n269.\n[41] K. Iida and G. Baym, Phys. Rev. D 66, (2002) 014015.\n[42] D. M. Sedrakian, D. Blaschke, K. M. Shahabasian and D. N. Voskresensky, Phys. Part. Nucl. 33, (2002) S100.\n[43] D. K. Hong, S. D. H. Hsu and F. Sannino, Phys. Lett. B 516, (2001)\n362.\n[44] R. Ouyed and F. Sannino, Astron. Astrophys. 387, (2002) 725.\n[45] D. N. Aguilera, D. Blaschke and H. Grigorian, Astron. Astrophys. 416,\n(2004) 991.\n[46] R. Ouyed, R. Rapp and C. Vogt, arXiv:astro-ph/0503357, (2005).\n[47] D. Blaschke, S. Fredriksson, H. Grigorian and A. M. Öztas, Nucl. Phys.\nA 736, (2004) 203.\n32\n\n\f[48] C. Gocke, D. Blaschke, A.\narXiv:hep-ph/0104183, (2001).\n\nKhalatyan\n\nand\n\nH.\n\nGrigorian,\n\n[49] D. Blaschke, S. Fredriksson, H. Grigorian, A. M. Öztas and F. Sandin,\narXiv:hep-ph/0503194 (2005).\n[50] H. Grigorian, D. Blaschke and D. N. Aguilera, Phys. Rev. C 69, (2004)\n065802.\n[51] N. K. Glendenning, Phys. Rev. D 46, 1274 (1992); N.K. Glendenning,\nPhys. Rep. 342 (2001) 393.\n[52] D. N. Voskresensky, M. Yasuhira and T. Tatsumi, Phys. Lett. B 541,\n(2002) 93; Nucl. Phys., A 723, (2002) 291.\n[53] D. N. Aguilera, D. Blaschke and H. Grigorian, Nucl. Phys.A (in press)\n(2005) arXiv:hep-ph/0412266.\n[54] C. Kettner, F. Weber, M. K. Weigel and N. K. Glendenning, Phys. Rev.\nD 51, (1995) 1440.\n[55] M. Prakash, J.M. Lattimer, A.W. Steiner and D. Page, Nucl. Phys., A\n715, (2003) 835.\n[56] J. Cottam, F. Paerels and M. Mendez, Nature, 420, (2002) 51.\n[57] J. A. Pons, S. Reddy, M. Prakash, J. M. Lattimer and J. A. Miralles,\nAstrophys. J. 513 (1999) 780\n[58] R. W. Lindquist, Ann. Phys., 37, (1966) 478.\n[59] K. S. Thorne,MNRAS 194, (1981) 439.\n[60] A. Burrows and J. M. Lattimer, Astrophys. J. 307, (1986) 178.\n[61] A. Sedrakian, Phys. Lett. B 607, (2005) 27.\n[62] D. G. Yakovlev, K. P. Levenfish, Yu. A. Shibanov, Phys. Usp. 42, (1999)\n737\n[63] D. N. Voskresensky, and A. V. Senatorov, 1987, Sov. J. Nucl. Phys., 45,\n411;\nA. V. Senatorov, and D. N. Voskresensky, Phys. Lett., B 184,(1987)\n119.\n33\n\n\f[64] T. Ainsworth, J. Wambach, and D. Pines, Phys. Lett. B 222, (1989)\n173.\n[65] D. N. Voskresensky, and A. V. Senatorov, JETP, 63, (1986) 885.\n[66] A. B. Migdal, E. E. Saperstein, M. A. Troitsky, and D. N. Voskresensky,\nPhys. Rep., 192, (1990) 179.\n[67] Ch. Schaab, D. Voskresensky, A.D. Sedrakian, F. Weber, and\nM. K. Weigel, Astron. Astrophys., 321, (1997) 591.\n[68] R. C. Duncan, S. L. Shapiro, I. Wasserman,, Astrophys. J. 267,(1983)\n358\n[69] N. Iwamoto, Ann. Phys. 141, (1982) 1.\n[70] A. D Kaminker, P. Haensel, Acta Phys. Pol. B 30, (1999) 1125.\n[71] R. Rapp, T. Schäfer, E. V. Shuryak, M. Velkovsky, Ann. Phys. 280,\n(2000) 35.\n[72] E. Flowers, N. Itoh, Astrophys. J. 250, (1981) 750.\n[73] D. A. Baiko, P. Haensel, Acta Phys. Polon. B 30, (1999) 1097.\n[74] P. Haensel, A. J. Jerzak, Acta Phys. Pol. B 20, (1989) 141.\n[75] D. G. Ravenhall, C. J. Pethick, and J. R. Wilson, Phys. Rev. Lett., 50,\n(1983) 2066.\n[76] T. Maruyama, T. Tatsumi, D. N. Voskresensky, T. Tanigawa, S. Chiba\nand T. Maruyama, arXiv:nucl-th/0402002, (2004).\n[77] T. Tatsumi, T. Maruyama, D. N. Voskresensky, T. Tanigawa and\nS. Chiba, arXiv:nucl-th/0502040, (2005).\n[78] G. Glen, P. Sutherland, Astrophys. J. 239, (1980) 671.\n[79] D. G. Yakovlev, K. P. Levenfish, A. Y. Potekhin, O. Y. Gnedin and\nG. Chabrier, Astron. Astrophys. 417, (2004) 169.\n[80] D. Blaschke, H. Grigorian and D. N. Voskresensky, Astron. Astrophys.\n424, (2004) 979.\n34\n\n\f[81] T. Takatsuka and R. Tamagaki, Prog. Theor. Phys. 112, (2004) 37.\n[82] R. B. Wiringa, V. G. Stoks, and R. Schiavilla, Phys. Rev. C 51, (1995)\n38.\n[83] A. Schwenk and B. Friman, Phys. Rev. Lett. 92, (2004) 082501.\n[84] V. A. Khodel, J. W. Clark, M. Takano and M. V. Zverev, Phys. Rev.\nLett. 93, (2004) 151101.\n[85] H. Grigorian, and D. N. Voskresensky, arXiv:astro-ph/0501678, (2005).\n[86] H. Grigorian, arXiv:astro-ph/0502576, (2005).\n[87] P. Jaikumar and M. Prakash, Phys. Lett. B 516, (2001) 345.\n[88] A. G. Lyne et al., arXiv:astro-ph/0401086, (2004).\n[89] S. Popov,\nH. Grigorian,\narXiv:astro-ph/0411618, (2004).\n\nR.\n\n35\n\nTurolla\n\nand\n\nD.\n\nBlaschke,\n\n\f"}