{"id": "http://arxiv.org/abs/astro-ph/0207336v1", "guidislink": true, "updated": "2002-07-16T15:40:35Z", "updated_parsed": [2002, 7, 16, 15, 40, 35, 1, 197, 0], "published": "2002-07-16T15:40:35Z", "published_parsed": [2002, 7, 16, 15, 40, 35, 1, 197, 0], "title": "High Resolution 18 Micron Imaging of Hot Molecular Cores", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0305561%2Castro-ph%2F0305562%2Castro-ph%2F0305115%2Castro-ph%2F0305537%2Castro-ph%2F0305304%2Castro-ph%2F0305417%2Castro-ph%2F0305011%2Castro-ph%2F0207545%2Castro-ph%2F0207170%2Castro-ph%2F0207438%2Castro-ph%2F0207481%2Castro-ph%2F0207224%2Castro-ph%2F0207245%2Castro-ph%2F0207423%2Castro-ph%2F0207370%2Castro-ph%2F0207604%2Castro-ph%2F0207323%2Castro-ph%2F0207107%2Castro-ph%2F0207605%2Castro-ph%2F0207516%2Castro-ph%2F0207239%2Castro-ph%2F0207018%2Castro-ph%2F0207296%2Castro-ph%2F0207587%2Castro-ph%2F0207633%2Castro-ph%2F0207591%2Castro-ph%2F0207305%2Castro-ph%2F0207586%2Castro-ph%2F0207196%2Castro-ph%2F0207524%2Castro-ph%2F0207648%2Castro-ph%2F0207317%2Castro-ph%2F0207467%2Castro-ph%2F0207601%2Castro-ph%2F0207002%2Castro-ph%2F0207418%2Castro-ph%2F0207121%2Castro-ph%2F0207568%2Castro-ph%2F0207097%2Castro-ph%2F0207176%2Castro-ph%2F0207193%2Castro-ph%2F0207629%2Castro-ph%2F0207620%2Castro-ph%2F0207395%2Castro-ph%2F0207324%2Castro-ph%2F0207102%2Castro-ph%2F0207006%2Castro-ph%2F0207554%2Castro-ph%2F0207597%2Castro-ph%2F0207207%2Castro-ph%2F0207470%2Castro-ph%2F0207354%2Castro-ph%2F0207262%2Castro-ph%2F0207236%2Castro-ph%2F0207071%2Castro-ph%2F0207020%2Castro-ph%2F0207151%2Castro-ph%2F0207377%2Castro-ph%2F0207220%2Castro-ph%2F0207355%2Castro-ph%2F0207175%2Castro-ph%2F0207661%2Castro-ph%2F0207160%2Castro-ph%2F0207249%2Castro-ph%2F0207422%2Castro-ph%2F0207182%2Castro-ph%2F0207640%2Castro-ph%2F0207312%2Castro-ph%2F0207194%2Castro-ph%2F0207190%2Castro-ph%2F0207237%2Castro-ph%2F0207383%2Castro-ph%2F0207635%2Castro-ph%2F0207636%2Castro-ph%2F0207204%2Castro-ph%2F0207214%2Castro-ph%2F0207336%2Castro-ph%2F0207134%2Castro-ph%2F0207123%2Castro-ph%2F0207326%2Castro-ph%2F0207384%2Castro-ph%2F0207565%2Castro-ph%2F0207152%2Castro-ph%2F0207592%2Castro-ph%2F0207250%2Castro-ph%2F0207021%2Castro-ph%2F0207403%2Castro-ph%2F0207341%2Castro-ph%2F0207116%2Castro-ph%2F0207276%2Castro-ph%2F0207166%2Castro-ph%2F0207183%2Castro-ph%2F0207078%2Castro-ph%2F0207444%2Castro-ph%2F0207582%2Castro-ph%2F0207614%2Castro-ph%2F0207106%2Castro-ph%2F0207630%2Castro-ph%2F0207358%2Castro-ph%2F0207508%2Castro-ph%2F0207061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High Resolution 18 Micron Imaging of Hot Molecular Cores"}, "summary": "I present the latest results from a search for hot molecular cores at\nmid-infrared wavelengths from the largest optical telescopes available at the\npresent time. Three well-observed hot molecular cores were imaged, G29.96-0.02,\nG19.61-0.23, and G34.26+0.15. Even though mid-infrared sources have been\nclaimed to be detected previously at the hot molecular core locations of both\nG19.61-0.23 and G34.26+0.15, only the hot molecular core in G29.96-0.02\nresulted in a detection. New upper limits on mid-infrared emission are given\nfor the hot molecular cores that were not detected.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0305561%2Castro-ph%2F0305562%2Castro-ph%2F0305115%2Castro-ph%2F0305537%2Castro-ph%2F0305304%2Castro-ph%2F0305417%2Castro-ph%2F0305011%2Castro-ph%2F0207545%2Castro-ph%2F0207170%2Castro-ph%2F0207438%2Castro-ph%2F0207481%2Castro-ph%2F0207224%2Castro-ph%2F0207245%2Castro-ph%2F0207423%2Castro-ph%2F0207370%2Castro-ph%2F0207604%2Castro-ph%2F0207323%2Castro-ph%2F0207107%2Castro-ph%2F0207605%2Castro-ph%2F0207516%2Castro-ph%2F0207239%2Castro-ph%2F0207018%2Castro-ph%2F0207296%2Castro-ph%2F0207587%2Castro-ph%2F0207633%2Castro-ph%2F0207591%2Castro-ph%2F0207305%2Castro-ph%2F0207586%2Castro-ph%2F0207196%2Castro-ph%2F0207524%2Castro-ph%2F0207648%2Castro-ph%2F0207317%2Castro-ph%2F0207467%2Castro-ph%2F0207601%2Castro-ph%2F0207002%2Castro-ph%2F0207418%2Castro-ph%2F0207121%2Castro-ph%2F0207568%2Castro-ph%2F0207097%2Castro-ph%2F0207176%2Castro-ph%2F0207193%2Castro-ph%2F0207629%2Castro-ph%2F0207620%2Castro-ph%2F0207395%2Castro-ph%2F0207324%2Castro-ph%2F0207102%2Castro-ph%2F0207006%2Castro-ph%2F0207554%2Castro-ph%2F0207597%2Castro-ph%2F0207207%2Castro-ph%2F0207470%2Castro-ph%2F0207354%2Castro-ph%2F0207262%2Castro-ph%2F0207236%2Castro-ph%2F0207071%2Castro-ph%2F0207020%2Castro-ph%2F0207151%2Castro-ph%2F0207377%2Castro-ph%2F0207220%2Castro-ph%2F0207355%2Castro-ph%2F0207175%2Castro-ph%2F0207661%2Castro-ph%2F0207160%2Castro-ph%2F0207249%2Castro-ph%2F0207422%2Castro-ph%2F0207182%2Castro-ph%2F0207640%2Castro-ph%2F0207312%2Castro-ph%2F0207194%2Castro-ph%2F0207190%2Castro-ph%2F0207237%2Castro-ph%2F0207383%2Castro-ph%2F0207635%2Castro-ph%2F0207636%2Castro-ph%2F0207204%2Castro-ph%2F0207214%2Castro-ph%2F0207336%2Castro-ph%2F0207134%2Castro-ph%2F0207123%2Castro-ph%2F0207326%2Castro-ph%2F0207384%2Castro-ph%2F0207565%2Castro-ph%2F0207152%2Castro-ph%2F0207592%2Castro-ph%2F0207250%2Castro-ph%2F0207021%2Castro-ph%2F0207403%2Castro-ph%2F0207341%2Castro-ph%2F0207116%2Castro-ph%2F0207276%2Castro-ph%2F0207166%2Castro-ph%2F0207183%2Castro-ph%2F0207078%2Castro-ph%2F0207444%2Castro-ph%2F0207582%2Castro-ph%2F0207614%2Castro-ph%2F0207106%2Castro-ph%2F0207630%2Castro-ph%2F0207358%2Castro-ph%2F0207508%2Castro-ph%2F0207061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I present the latest results from a search for hot molecular cores at\nmid-infrared wavelengths from the largest optical telescopes available at the\npresent time. Three well-observed hot molecular cores were imaged, G29.96-0.02,\nG19.61-0.23, and G34.26+0.15. Even though mid-infrared sources have been\nclaimed to be detected previously at the hot molecular core locations of both\nG19.61-0.23 and G34.26+0.15, only the hot molecular core in G29.96-0.02\nresulted in a detection. New upper limits on mid-infrared emission are given\nfor the hot molecular cores that were not detected."}, "authors": ["James M. De Buizer"], "author_detail": {"name": "James M. De Buizer"}, "author": "James M. De Buizer", "arxiv_comment": "7 pages, 5 figures, to appear in 'Galactic Star Formation Across the\n  Stellar Mass Spectrum', eds. J.M. De Buizer & N.S. van der Bliek (ASP\n  coference Series, 2002)", "links": [{"href": "http://arxiv.org/abs/astro-ph/0207336v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0207336v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0207336v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0207336v1", "journal_reference": null, "doi": null, "fulltext": "Galactic Star Formation Across the Stellar Mass Spectrum\nASP Conference Series, Vol. ??, 2002\nJ.M. De Buizer and N.S. van der Bliek, eds.\n\nHigh Resolution 18 μm Imaging of Hot Molecular Cores\nJames M. De Buizer\n\narXiv:astro-ph/0207336v1 16 Jul 2002\n\nCerro Tololo Inter-American Observatory, Casilla 603, La Serena, Chile\nAbstract. I present the latest results from a search for hot molecular cores at mid-infrared wavelengths from the largest optical telescopes\navailable at the present time. Three well-observed hot molecular cores\nwere imaged, G29.96-0.02, G19.61-0.23, and G34.26+0.15. Even though\nmid-infrared sources have been claimed to be detected previously at the\nhot molecular core locations of both G19.61-0.23 and G34.26+0.15, only\nthe hot molecular core in G29.96-0.02 resulted in a detection. New upper\nlimits on mid-infrared emission are given for the hot molecular cores that\nwere not detected.\n\n1.\n\nIntroduction\n\nHot molecular cores (HMCs) are believed to represent the earliest stages of\nmassive stellar birth, however there are very few observations of these objects to\ndate. The basic characteristics of hot molecular cores are: 1) they are compact\nsources seen in radio wavelength ammonia (or molecular line) images but have\nlittle or no radio continuum emission; 2) they lie in massive star forming regions\nnear ultracompact HII (UC HII) regions; 3) they are too young and/or embedded\nto be seen in the optical or near infrared; and 4) they are often coincident with\nwater maser emission. Only a small number of sources exist that have had such\na holistic set of observations performed.\nCesaroni et al. (1994) argue that the dust and gas in these HMCs are wellmixed and that the gas temperatures derived from ammonia line imaging should\nbe an approximation to the dust temperatures. Since emission from a 160 K\nblackbody peaks at 18 μm and these HMCs have gas temperatures of 50-200\nK, the mid-infrared is a good wavelength regime to try to detect these types of\nsources.\nI present here sub-arcsecond 18 μm images of the sites of three hot molecular cores. All three sites are certified massive star forming regions due to the\npresence of UC HII regions. All sites contain water masers that are isolated\nfrom centimeter radio emission sources. Furthermore, all three sites have been\nfound to contain ammonia emission coincident with the water maser locations,\nas observed through high-resolution molecular line imaging.\nThe 18 μm observations of these HMCs were performed at the Gemini\nNorth and W.M. Keck II telescopes using OSCIR. The reasons for using such\nlarge telescopes are two-fold: 1) to separate the mid-infrared emission of the\nHMC from that of any other nearby sources, like extended UC HII regions; and\n2) to exploit the higher sensitivity of the larger telescopes so that detections\n1\n\n\f2\n\nDe Buizer\n\nFigure 1.\nObservations of G29.96-0.02. (a) A figure from Cesaroni\net al. (1998). The UC HII region at 1.3 cm (grayscale) and ammonia\nline emission (contours). Water maser are plotted as crosses. (b) The\n18 μm image of the same region shown as filled contours. The HMC\ncan be seen as a \"bump\" on the UC HII region to the west.\nare made more readily, or so that stringent upper limits can be placed on the\nmid-infrared emission coming from those sources not detected.\n2.\n\nObservations\n\nThe University of Florida mid-infrared imager and spectrometer OSCIR was\nused for all observations. OSCIR employs a Rockwell 128×128 pixel Si:As BIB\n(blocked impurity band) detector. All observations were taken through the\nInternational Halley Watch 18 μm (IHW18) filter, which has an effective central\nwavelength at 18.06 μm, and a filter width of 1.7 μm. Background subtraction\nwas achieved during the observations via the standard chop-nod technique.\nWhile at the Keck II 10-m telescope, OSCIR had a pixel scale of 0.′′ 0616\npixel−1 . During the observations point-spread function stars were observed,\nyielding an estimate of the effective resolution of the observations of 0.′′ 41. At\nthe Gemini North 8-m telescope, OSCIR had a pixel scale of 0.′′ 084 pixel−1 and\na effective resolution of 0.′′ 63.\nThere were no detections of mid-infrared sources at the locations of 2 of the\n3 hot molecular cores.\n3.\n3.1.\n\nThe Detection\nG29.96-0.02\n\nIn the region of G29.96-0.02 lies a cometary shaped ultracompact HII region\naround a spectral type O7 star (Watson & Hanson 1997). In Figure 1a (from\nCesaroni et al. 1998) the grayscale shows the UC HII region at 1.3 cm and the\n\n\fHigh-Resolution 18 μm Imaging of HMCs\n\n3\n\nFigure 2.\nIsolating the HMC emission in G29.96-0.02. The three\npanels show, from left to right, a portion of the original 18 μm image\nfrom Gemini containing the HMC, the background polynomial fit of 5th\norder in x and y, and the HMC in the residual frame. The contours\nshown are -16, -8, 8, 25, 42, 59, 76, and 93% of the peak flux density\nof 1.9 Jy arsec−2 .\n\ncrosses mark the positions of water masers. These water masers are offset and\ndo not seem to be associated with the UC HII region. Instead they appear to\nbe associated with a source seen only in ammonia emission (contours). It was\nclaimed by Cesaroni et al. (1994) that this source seen in ammonia emission\nmay be a hot molecular core. Figure 1b shows the 18 μm image from Gemini\nNorth of the same region (grayscale with contours for emphasis). The UC HII\nregion appears more extended in the mid-infrared, but the HMC can be clearly\nseen as a \"bump\" on the western side of the UC HII region.\nThe HMC in G29.96-0.02 is difficult to see in the mid-infrared because it is\nstill partially embedded in the extended emission from the nearby UC HII region.\nHowever, a two-dimensional polynomial surface was fit to the this background\nemission (excluding a 2′′ by 2′′ region around the HMC), isolating the emission\nfrom the HMC alone. The three panels in Figure 2 show, from left to right,\na portion of the original 18 μm image from Gemini containing the HMC, the\nbackground polynomial fit of 5th order in x and y, and the HMC in the residual\nframe.\nFigure 3a shows a grayscale image of the 1.3 cm continuum observations\nof Cesaroni et al. (1998). The overlaying contours are from the 18 μm midinfrared data presented in Figure 1. Good morphological agreement for the\nUC HII region is found between the two wavelengths, adding credibility to the\nastrometry. The large, thin cross marks the position of the ammonia peak of\nthe hot core from Cesaroni et al. (1998). The small, thick cross marks the peak\nin the mid-infrared dust emission from the hot core. Figure 3b shows a close up\nview centered on the mid-infrared peak of the hot core. Apparent in this figure\nare the offset peaks of the mid-infrared (thick contours) and ammonia emission\n(thin contours), possibly due to optical depth effects, or more likely showing\nthere are two different embedded objects here (De Buizer et al. 2002). Filled\nblack circles mark the locations of the water masers from Hofner and Churchwell\n(1996), and the filled triangle marks the location of the methanol maser group\nfrom Minier, Conway, & Booth (2001).\n\n\f4\n\nDe Buizer\n\nFigure 3.\nComparing the HMC seen in ammonia and at 18 μm. (a)\nAn overlay of 18 μm emission (contours) on the 1.3 cm emission of Cesaroni et al. (1998) showing the similarity in UC HII region morphology.\nThe large, thin cross marks the position of the ammonia peak of the\nhot core and the small, thick cross marks the peak in the mid-infrared\ndust emission. (b) A close up view centered on the mid-infrared peak\nof the hot core. There is an apparent offset between the peaks of the\nmid-infrared (thick contours) and ammonia emission (thin contours).\nFilled black circles mark the locations of the water masers from Hofner\nand Churchwell (1996), and the filled triangle marks the location of the\nmethanol maser group from Minier, Conway, & Booth (2001).\nA full discussion of the detection of the HMC in G29.96-0.02 can be found\nin De Buizer et al. (2002).\n4.\n4.1.\n\nThe Non-Detections\nG19.61-0.23\n\nG19.61-0.23 is an extremely complex region of massive star formation. There are\nseveral (at least six) UC HII regions that can be seen in both radio continuum\nemission (Garay et al. 1998) and in the mid-infrared. Figure 4a shows contours\nof the whole region at 18 μm from NASA's InfraRed Telescope Facility 3-m\ntelescope (De Buizer 2000). The stars denote the locations of three clusters of\nwater masers. The middle of the three water maser clusters was found to be\ncoincident with a mid-infrared source seen only at 18 μm at a detection level of\n2.5-σ (230 mJy) by De Buizer (2000). Since such a low detection level is by no\nmeans conclusive, this site required further observation.\nThe box in Figure 4a delineates the field of view in Figure 4b taken from\nGemini North. In this figure, contours of ammonia emission (dark gray lines)\nfrom Garay et al. (1998) are overlaid, along with the water masers (crosses)\nfrom Forster and Caswell (1989). The very bright UC HII region seen in the\n\n\fHigh-Resolution 18 μm Imaging of HMCs\n\n5\n\nFigure 4.\nG19.61-0.23. (a) Large-scale 18 μm emission from De\nBuizer (2000). The stars denote the locations of three clusters of water\nmasers, and the box delineates the field of view of (b). (b) The 18\nμm emission as seen from Gemini North (grayscale and thin black contours). Overlaid are contours of ammonia emission (dark gray lines)\nfrom Garay et al. (1998) and water masers (crosses) from Forster and\nCaswell (1989). We do not detect a source at any of the three maser\ncluster locations.\nmid-infrared is not coincident with the masers, but the masers are associated\nwith the ammonia emission. We do not detect a source at any of the three maser\ncluster locations at a 3-σ upper limit of 12 mJy at 18 μm, including the middle\nmaser cluster. The weak mid-infrared emission seen by De Buizer (2000) was\napparently noise.\n4.2.\n\nG34.26+0.15\n\nLike G29.96-0.02, this site has many masers out in front of the apex of a cometary\nshaped UC HII region. However, the masers are more spread out, and some do\nappear to be associated with the sharp UC HII boundary. Figure 5a is from\nGaume, Fey, & Claussen (1994) and shows 2 cm contours of the UC HII region\nand two nearby compact sources, as well as the water (crosses) and OH (circles)\nmasers. In Figure 5b, the light gray contour lines show the location of ammonia\nemission from Keto et al. (1992) which is to the east of this UC HII region and\ncoincident with many masers in the region. Interestingly, Keto et al. (1992)\npresent a 12.5 μm image of this site which shows a faint (70 mJy) mid-infrared\nsource in the area of the water masers and ammonia emission. The grayscale\nimage underneath these ammonia contours in Figure 5b is the 18 μm image from\nGemini North (with thin black contours for emphasis). No source was detectable\nat the location of this ammonia clump at a 3-σ upper limit of 20 mJy at 18 μm.\nThis site was also imaged at 10 μm by De Buizer (2000) with no detection at\nthis maser/ammonia location. Therefore, the validity of the source seen by Keto\net al. (1992) is questionable.\n\n\f6\n\nDe Buizer\n\nFigure 5.\nG34.26+0.15. (a) A figure from Gaume, Fey, & Claussen\n(1994) showing the 2 cm contours of the UC HII region and two nearby\ncompact sources, as well as the water masers (crosses). (b) The 18 μm\nimage from Gemini North shown as grayscale with thin black contours.\nThe light gray contours are the ammonia emission from Keto et al.\n(1992) with the water masers in the region plotted as crosses. No\nHMC was detected.\n5.\n\nConclusions\n\nThree well-observed hot molecular cores were imaged at 18 μm, G29.96-0.02,\nG19.61-0.23, and G34.26+0.15. Only the hot molecular core in G29.96-0.02\nresulted in a detection. This was a surprise considering the previous \"detections\"\nof HMCs in the sites of both G19.61-0.23 and G34.26+0.15. This small research\nprogram has shown that the mid-infrared can be useful in observing and studying\nsome HMCs. It has also shown that the resolution and sensitivity afforded by\nthe 8 to 10-m class telescopes are important to perform this research effectively.\nReferences\nCesaroni, R., Churchwell, E., Hofner, P., Walmsley, C.M., & Kurtz, S. 1994,\nA&A, 288, 903\nCesaroni, R., Hofner, P., Walmsley, C. M., & Churchwell, E. 1998, A&A, 331,\n709\nDe Buizer, J. M 2000, Thesis, University of Florida (Available electronically at\nhttp://www.ctio.noao.edu/∼debuizer)\nDe Buizer, J. M., Watson, A. M., Radomski, J. T., Pińa, R. K., & Telesco, C.\nM. 2002 ApJ, 564, L101\nForster, J. R., & Caswell, J. L. 1989, A&A, 213, 339\nGaray, G., Moran, J. M., Rodríguez, L. F., & Reid, M. J. 1998, ApJ, 492, 635\nGaume, R. A., Fey, A. L., & Claussen, M. J. 1994, ApJ, 432, 648\n\n\fHigh-Resolution 18 μm Imaging of HMCs\n\n7\n\nHofner, P., & Churchwell, E. 1996, A&ASuppl., 120, 283\nKeto, E., Proctor, D., Ball, R., Arens, J., & Jernigan, G. 1992, ApJ, 401, L113\nMinier, V., Conway, J. E., & Booth, R. S. 2001, A&A, 369, 278\nWatson, A. M., & Hanson, M. M. 1997, ApJ, 490, L165\n\n\f"}