{"id": "http://arxiv.org/abs/astro-ph/0603720v2", "guidislink": true, "updated": "2006-07-10T18:16:08Z", "updated_parsed": [2006, 7, 10, 18, 16, 8, 0, 191, 0], "published": "2006-03-27T13:00:59Z", "published_parsed": [2006, 3, 27, 13, 0, 59, 0, 86, 0], "title": "Imaging the Dust Trail and Neckline of 67P/Churyumov-Gerasimenko", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0603497%2Castro-ph%2F0603803%2Castro-ph%2F0603150%2Castro-ph%2F0603372%2Castro-ph%2F0603784%2Castro-ph%2F0603388%2Castro-ph%2F0603162%2Castro-ph%2F0603662%2Castro-ph%2F0603541%2Castro-ph%2F0603464%2Castro-ph%2F0603682%2Castro-ph%2F0603241%2Castro-ph%2F0603763%2Castro-ph%2F0603770%2Castro-ph%2F0603574%2Castro-ph%2F0603401%2Castro-ph%2F0603209%2Castro-ph%2F0603331%2Castro-ph%2F0603679%2Castro-ph%2F0603747%2Castro-ph%2F0603402%2Castro-ph%2F0603212%2Castro-ph%2F0603294%2Castro-ph%2F0603243%2Castro-ph%2F0603706%2Castro-ph%2F0603806%2Castro-ph%2F0603525%2Castro-ph%2F0603296%2Castro-ph%2F0603576%2Castro-ph%2F0603284%2Castro-ph%2F0603015%2Castro-ph%2F0603145%2Castro-ph%2F0603773%2Castro-ph%2F0603548%2Castro-ph%2F0603409%2Castro-ph%2F0603842%2Castro-ph%2F0603720%2Castro-ph%2F0603699%2Castro-ph%2F0603405%2Castro-ph%2F0603359%2Castro-ph%2F0603290%2Castro-ph%2F0603005%2Castro-ph%2F0603465%2Castro-ph%2F0603745%2Castro-ph%2F0603478%2Castro-ph%2F0603850%2Castro-ph%2F0603140%2Castro-ph%2F0603601%2Castro-ph%2F0603323%2Castro-ph%2F0603085%2Castro-ph%2F0603531%2Castro-ph%2F0603550%2Castro-ph%2F0603367%2Castro-ph%2F0603014%2Castro-ph%2F0603838%2Castro-ph%2F0603729%2Castro-ph%2F0603254%2Castro-ph%2F0603244%2Castro-ph%2F0603592%2Castro-ph%2F0603276%2Castro-ph%2F0603713%2Castro-ph%2F0603849%2Castro-ph%2F0603028%2Castro-ph%2F0603834%2Castro-ph%2F0603343%2Castro-ph%2F0603818%2Castro-ph%2F0603027%2Castro-ph%2F0603836%2Castro-ph%2F0603066%2Castro-ph%2F0603553%2Castro-ph%2F0603491%2Castro-ph%2F0603618%2Castro-ph%2F0603016%2Castro-ph%2F0603283%2Castro-ph%2F0603616%2Castro-ph%2F0603163%2Castro-ph%2F0603247%2Castro-ph%2F0603499%2Castro-ph%2F0603376%2Castro-ph%2F0603575%2Castro-ph%2F0603482%2Castro-ph%2F0603038%2Castro-ph%2F0603269%2Castro-ph%2F0603440%2Castro-ph%2F0603624%2Castro-ph%2F0603546%2Castro-ph%2F0111113%2Castro-ph%2F0111285%2Castro-ph%2F0111022%2Castro-ph%2F0111248%2Castro-ph%2F0111479%2Castro-ph%2F0111409%2Castro-ph%2F0111072%2Castro-ph%2F0111002%2Castro-ph%2F0111085%2Castro-ph%2F0111063%2Castro-ph%2F0111150%2Castro-ph%2F0111347%2Castro-ph%2F0111529%2Castro-ph%2F0111391%2Castro-ph%2F0111257&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Imaging the Dust Trail and Neckline of 67P/Churyumov-Gerasimenko"}, "summary": "We report on the results of nearly 10 hours of integration of the dust trail\nand neckline of comet 67P/Churyumov-Gerasimenko (67P henceforth) using the Wide\nField Imager at the ESO/MPG 2.2m telescope in La Silla. The data was obtained\nin April 2004 when the comet was at a heliocentric distance of 4.7 AU outbound.\n67P is the target of the Rosetta spacecraft of the European Space Agency.\nStudying the trail and neckline can contribute to the quantification of\nmm-sized dust grains released by the comet. We describe the data reduction and\nderive lower limits for the surface brightness. In the processed image, the\nangular separation of trail and neckline is resolved. We do not detect a coma\nof small, recently emitted grains.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0603497%2Castro-ph%2F0603803%2Castro-ph%2F0603150%2Castro-ph%2F0603372%2Castro-ph%2F0603784%2Castro-ph%2F0603388%2Castro-ph%2F0603162%2Castro-ph%2F0603662%2Castro-ph%2F0603541%2Castro-ph%2F0603464%2Castro-ph%2F0603682%2Castro-ph%2F0603241%2Castro-ph%2F0603763%2Castro-ph%2F0603770%2Castro-ph%2F0603574%2Castro-ph%2F0603401%2Castro-ph%2F0603209%2Castro-ph%2F0603331%2Castro-ph%2F0603679%2Castro-ph%2F0603747%2Castro-ph%2F0603402%2Castro-ph%2F0603212%2Castro-ph%2F0603294%2Castro-ph%2F0603243%2Castro-ph%2F0603706%2Castro-ph%2F0603806%2Castro-ph%2F0603525%2Castro-ph%2F0603296%2Castro-ph%2F0603576%2Castro-ph%2F0603284%2Castro-ph%2F0603015%2Castro-ph%2F0603145%2Castro-ph%2F0603773%2Castro-ph%2F0603548%2Castro-ph%2F0603409%2Castro-ph%2F0603842%2Castro-ph%2F0603720%2Castro-ph%2F0603699%2Castro-ph%2F0603405%2Castro-ph%2F0603359%2Castro-ph%2F0603290%2Castro-ph%2F0603005%2Castro-ph%2F0603465%2Castro-ph%2F0603745%2Castro-ph%2F0603478%2Castro-ph%2F0603850%2Castro-ph%2F0603140%2Castro-ph%2F0603601%2Castro-ph%2F0603323%2Castro-ph%2F0603085%2Castro-ph%2F0603531%2Castro-ph%2F0603550%2Castro-ph%2F0603367%2Castro-ph%2F0603014%2Castro-ph%2F0603838%2Castro-ph%2F0603729%2Castro-ph%2F0603254%2Castro-ph%2F0603244%2Castro-ph%2F0603592%2Castro-ph%2F0603276%2Castro-ph%2F0603713%2Castro-ph%2F0603849%2Castro-ph%2F0603028%2Castro-ph%2F0603834%2Castro-ph%2F0603343%2Castro-ph%2F0603818%2Castro-ph%2F0603027%2Castro-ph%2F0603836%2Castro-ph%2F0603066%2Castro-ph%2F0603553%2Castro-ph%2F0603491%2Castro-ph%2F0603618%2Castro-ph%2F0603016%2Castro-ph%2F0603283%2Castro-ph%2F0603616%2Castro-ph%2F0603163%2Castro-ph%2F0603247%2Castro-ph%2F0603499%2Castro-ph%2F0603376%2Castro-ph%2F0603575%2Castro-ph%2F0603482%2Castro-ph%2F0603038%2Castro-ph%2F0603269%2Castro-ph%2F0603440%2Castro-ph%2F0603624%2Castro-ph%2F0603546%2Castro-ph%2F0111113%2Castro-ph%2F0111285%2Castro-ph%2F0111022%2Castro-ph%2F0111248%2Castro-ph%2F0111479%2Castro-ph%2F0111409%2Castro-ph%2F0111072%2Castro-ph%2F0111002%2Castro-ph%2F0111085%2Castro-ph%2F0111063%2Castro-ph%2F0111150%2Castro-ph%2F0111347%2Castro-ph%2F0111529%2Castro-ph%2F0111391%2Castro-ph%2F0111257&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on the results of nearly 10 hours of integration of the dust trail\nand neckline of comet 67P/Churyumov-Gerasimenko (67P henceforth) using the Wide\nField Imager at the ESO/MPG 2.2m telescope in La Silla. The data was obtained\nin April 2004 when the comet was at a heliocentric distance of 4.7 AU outbound.\n67P is the target of the Rosetta spacecraft of the European Space Agency.\nStudying the trail and neckline can contribute to the quantification of\nmm-sized dust grains released by the comet. We describe the data reduction and\nderive lower limits for the surface brightness. In the processed image, the\nangular separation of trail and neckline is resolved. We do not detect a coma\nof small, recently emitted grains."}, "authors": ["J. Agarwal", "H. Boehnhardt", "E. Gruen"], "author_detail": {"name": "E. Gruen"}, "author": "E. Gruen", "arxiv_comment": "4 pages, 3 figures, to be published in the proceedings book of the\n  conference \"Dust in Planetary Systems 2005\", Calibration updated in Section 2", "links": [{"href": "http://arxiv.org/abs/astro-ph/0603720v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0603720v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0603720v2", "affiliation": "HIGP Honolulu", "arxiv_url": "http://arxiv.org/abs/astro-ph/0603720v2", "journal_reference": null, "doi": null, "fulltext": "IMAGING THE DUST TRAIL AND NECKLINE OF 67P/CHURYUMOV-GERASIMENKO\nJessica Agarwal1 , Hermann Böhnhardt2 , and Eberhard Grün1,3\n1\n\narXiv:astro-ph/0603720v2 10 Jul 2006\n\nMPI-K, Saupfercheckweg 1, 69117 Heidelberg (Germany), Email: jessica.agarwal@mpi-hd.mpg.de\n2\nMPS, Max-Planck-Str. 2, 37191 Katlenburg-Lindau (Germany), Email: boehnhardt@mps.mpg.de\n3\nHIGP, 1680 East West Road POST 512c, Honolulu, HI 96822 (USA), Email: eberhard.gruen@mpi-hd.mpg.de\n\nABSTRACT\nWe report on the results of nearly 10 hours of integration\nof the dust trail and neckline of comet 67P/ChuryumovGerasimenko (67P henceforth) using the Wide Field Imager at the ESO/MPG 2.2m telescope in La Silla. The\ndata was obtained in April 2004 when the comet was at\na heliocentric distance of 4.7 AU outbound. 67P is the\ntarget of the Rosetta spacecraft of the European Space\nAgency. Studying the trail and neckline can contribute\nto the quantification of mm-sized dust grains released by\nthe comet. We describe the data reduction and derive\nlower limits for the surface brightness. In the processed\nimage, the angular separation of trail and neckline is resolved. We do not detect a coma of small, recently emitted grains.\n\nline are younger and on average smaller than in the trail.\nComet trails and necklines are best studied when separated from smaller dust grains. The latter are released at\nhigher relative speeds and are subject to stronger radiation pressure. They disperse in space on timescales of\nweeks to months after their emission, and their presence\nis not expected in the vicinity of an inactive comet far\nfrom the sun. In this circumstance lies the appeal of observing a cometary trail or neckline at large heliocentric\ndistance, even despite the then fainter surface brightness.\nIn Section 2, we describe and discuss the processing of\nthe raw data. This is followed in Section 3 by the interpretation of the obtained image paying special attention\nto the discrimination between dust trail and neckline. The\nresults are summarised in Section 4.\n\n2.\n1.\n\nDATA ACQUISITION AND PROCESSING\n\nINTRODUCTION\n\nThe trajectories of cometary dust particles are – to first\norder – determined by their emission speed relative to\nthe nucleus and by the ratio β of solar radiation pressure\nto solar gravity. Both quantities decrease with increasing particle size when the latter is large compared to the\nwavelengths of sunlight.\nLarge (mm/cm-sized) dust grains remain close to the orbit of their parent comet for many revolutions around\nthe sun, appearing to the observer as a long, line-shaped\nstructure, the comet's dust trail. The emission of such\nparticles is thought to be the principal mechanism by\nwhich a comet loses refractory mass to the interplanetary\ndust environment (1). Trails of eight short-period comets\nwere first observed with IRAS in 1983 (2; 3), one of them\nbeing that of 67P.\nOf similar shape is the neckline (4) which consists of dust\nreleased from the comet at a true anomaly of 180◦ before observation. In our case this corresponds to emission in mid-July 2002, roughly a month before perihelion\npassage. An observer close to the comet's orbital plane\nwill see the neckline as a thin bright line, slightly inclined\nwith respect to the projected orbit. Particles in the neck-\n\n67P was observed in April 2004 with the Wide Field Imager (WFI) at the ESO/MPG 2.2m telescope in La Silla.\nThe heliocentric and geocentric distances of the comet\nwere 4.7 AU and 3.7 AU, respectively. The total integration time was 9.8 h. 45 minutes were done on 2 April; the\nremaining time was split equally over the four consecutive nights of 18 – 21 April. We discarded the exposures\ntaken on 18 April, which were highly contaminated by\nstray light from a star of 4th magnitude outside but close\nto the instrument field of view (FOV). The remaining data\ncomprises 50 images of 540 s exposure time each. The\nphysical width of one pixel is 15 μm corresponding to\n0.238′′ . In order to maximise sensitivity, 3×3 on-chip\npixel binning was used. Each image is a mosaic of 8\nCCDs covering a total FOV of 34′ ×33′ . No filter was\napplied.\nThe data processing was done with IRAF. A thorough discussion of the peculiarities of WFI data and the individual\nsteps of their reduction is given in (5). The raw images\nwere bias-subtracted, flatfielded, corrected for airmass,\nand a mean sky-brightness was subtracted. They were\nthen average-combined while masking stellar objects as\ndescribed by (6). In order to increase the signal-to-noise\nratio (SNR), a spatial averaging filter was applied to the\n\n\fresulting image. An approximate flux calibration was\nachieved using field stars.\nThe raw images were characterised by strong fringing,\nan interference artefact arising in blue-optimised thinlayered CCDs when observing in red wavelengths (5).\nIn our data, the fringing pattern was spatially constant,\nand its amplitude to first order proportional to the background intensity level. Neither twilight nor dome flatfield exposures were used, because the images were taken\nwithout filter and the spectral properties of the night sky\nare different from those of the twilight sky or lamp. Instead, superflats were built from the science data directly.\nThis was possible because due to jittering, stellar objects were in different positions on the CCD in successive exposures. The superflats were obtained by median averaging over several normalised images. Thus\nbright objects were excluded from the combined image\nwhile instrument-specific features remained. An optimally smooth and fringe-free background in the flatfielded images was achieved if using five consecutive exposures per superflat. To make different images comparable a mean sky level was subtracted from each. Airmass\ncorrection was done assuming a mean extinction coefficient for La Silla of 0.15 mag/airmass.\nIn the following, we call the data thus obtained the \"corrected single images\". They were subsequently processed\nin two different manners in order to, first, allow for an approximate flux calibration using field stars and, second,\nobtain the final image of the trail. For the flux calibration,\nSNR was increased by averaging over all corrected single\nimages of a given night with such offsets that stars would\nsuperpose. In the combined images, aperture photometry of a set of \"solar-type\" field stars in the FOVs of the\nimages was done. Stars were considered as \"solar-type\"\nwhen their B-R and R-I filter colours in the USNO-B1.0\ncatalogue were compatible with solar values within the\naccuracy of the catalogue of 0.25 mag (7). Only stars\nwith R-magnitudes fainter than 17.7 could be used, because brighter ones were saturated in the raw data. As\nR-magnitude we used the mean of the two values given\nin the catalogue. For all stars j fulfilling the above criteria, the integral flux Ij in the combined image was measured (in arbitrary units). By plotting the catalogue Rmagnitude Mcat (j) versus −2.5 log10 (Ij ) and fitting a\nlinear relation\nMcat (j) = M0 − 2.5 log10 (Ij )\n\n(1)\n\nto the data points, the calibration offset M0 was deduced.\nThis procedure was exercised for all four nights independently. The derived values of M0 were consistent within\nthe regression errors. We used their mean for further\ncalculations: M0 = 32.34 ± 0.02. We obtain surface\nbrightness values ranging from 27.0 to 28.4 mag/arcsec2\n(in R) for the trail and an average nucleus magnitude of\n21.7 ± 0.1.\nThe final trail image was obtained by averaging over all\ncorrected single images with such offsets as to align the\ncomet. Due to the relative motion of comet and background objects, the latter would appear in the combined\nimage as short, dashed lines often considerably brighter\nthan the trail. In order to exclude such objects from being considered by the averaging procedure, object masks\n\nwere applied. The object mask for a given night was created with the IRAF routine objmasks for the star-wise\ncombined images used already for the aperture photometry. Saturated or otherwise bad pixels and the spaces\nbetween CCDs were masked as well.\nThe resulting combined image has a reasonably smooth\nbackground and the trail is easily visible (Fig. 1(a)).\nHowever, the low mean SNR of 0.6 per individual pixel\nprecludes a quantitative analysis of this image. SNR can\nbe improved by applying a spatial averaging filter which\nreplaces each pixel by the average of its m × n neighbours (IRAF routine boxcar). The price to pay is loss\nof spatial resolution. The size of the averaging window\nshould be smaller than the characteristic dimension of the\nobject. Since the trail is very extended in the direction\nparallel to its axis while narrow perpendicular to it, we\nchose a rectangular window much larger in the parallel\ndirection than in the perpendicular one. To properly apply\nthe filter, the image was first rotated aligning the trail to\nthe x-axis (rotation by 26.5◦ clockwise). In addition, the\nnucleus was removed, i.e. replaced by an interpolation\nover the surrounding pixels. We used a filtering window\nof 200 pixels (140′′) parallel and 10 pixels (7′′ ) perpendicular to the trail axis, increasing SNR per pixel by a\nfactor of 45. The resulting image is shown in Fig. 1(b).\nBefore embarking upon a quantitative analysis of the\ndata, a certain problem arising from the flatfielding process must be addressed. The difficulty originates from the\nfact that the surface brightness of the trail was much less\nthan the statistical variation of the background. Moreover, the jittering pattern had not been optimised in direction and amplitude to ensure that trail information could\nbe completely excluded from the superflats.\nThe superflats were constructed by median averaging\nover five consecutively taken exposures. In each of these,\na given object is found in a different position. Putting\nit the other way round, if we consider a certain pixel in\nfive consecutive exposures, it will contain a given object\nat maximum once. This will be discarded by the median\nfilter, and hence the resulting image is free of bright objects. The method fails if the object is less bright than\nthe statistical fluctuation of the background. Since in this\ncase the object-containing pixel will not be significantly\nbrighter than the other four, there is a non-vanishing probability that the median of the five pixels will happen to be\nthe one bearing the object. In the limit of a very faint\nobject, the chances of having it in the median pixel approach 20% which is the probability for one out of five\nidentically distributed pixels to assume the median value.\nThis means that up to 20% of the pixels in the concerned\nregions of the superflat must be expected to bear trail information. This information is lost from the original image on division by the superflat, and the resulting surface\nbrightness will be 20% too low on average. An accurate\nestimate of the loss is difficult, and any attempt at a quantitative correction would be highly speculative. It remains\nalways true that the measured brightness is a lower limit.\nTo nevertheless enable a quantitative comparison with\nsimulated images, we propose to include the details of\nthe flatfielding process into the simulation. The simulated\nimage will then contain (to first order) the same artefacts\nas the WFI image and should hence be comparable to it.\n\n\fmag/arcsec2\n\nFigure 1. (a) Unfiltered image rotated by 26.5◦ clockwise. (b) Same image, each pixel being replaced by the average\nover a neighbourhood of 200 pixels (140′′ ) parallel and 10 pixels (7′′ ) perpendicular to the trail axis after removal of\nthe nucleus. The filtering window is indicated in the upper right corner. The size of the images is 35′ x 4.7′ each. For\norientation see Fig. 3. The inclined stripes are remnants of the overscan regions between individual CCDs.\n\n27.0\n\nTrail\nNeckline\n\n27.3\n27.9\n29.1\n0\n\n5\n\n10\n15\n20\n25\nDistance from nucleus [arcmin]\n\n30\n\nFigure 2. Lower limit brightness profiles along trail and neckline. The scale is linear in intensity but labelled with\nthe corresponding logarithmic R-magnitudes. The profiles are not independent of each other because trail and neckline\noverlap, especially near the nucleus (see Fig. 1(b)). The apparent shift of the peak to the right of the nucleus is a result of\nthe spatial averaging filter, the brightness dropping more steeply to the left of the nucleus than to its right.\n3.\n\nINTERPRETATION\n\nTaking a closer look at the filtered image Fig. 1(b), a\nsplitting of the line-shaped structure can be discerned.\nThe gap between the two parts widens with increasing\ndistance from the nucleus. We have ascertained that the\nsplitting does not result from combining images taken in\ndifferent nights: It remained if only data acquired in a\nsingle night was used, and the predicted position angle of\nthe trail did not change significantly over the period of\nobservation. Hence we presume that the splitting is real.\nUsing the model described in (8), we find that the expected position angles of trail and neckline are 296.9◦\nand 296.1◦, respectively (measured counterclockwise\nfrom north). In Fig. 1, the difference in position angle\nbetween the two branches is 0.8◦ ± 0.2◦ which complies\nwell with the anticipated separation of trail and neckline.\nThe same is true for the mean position angle of the feature\nwhich is 296.5◦. Hence we interpret the upper branch in\nFig. 1 as the dust trail and the lower one as the neckline.\nTrail and neckline are visible up to the edge of the FOV.\nThe length of the orbit section covered is 35′ , corresponding to 1.1◦ in mean anomaly.\nThe different ages of dust in the trail and neckline imply\n\nthat at a given distance from the nucleus trail particles\nare expected to be larger on average than material in the\nneckline. If we assume that the size distribution of dust\nleaving the comet did not change with time (apart from\nits dependency on the strength of gas drag), the projectional separation of trail and neckline provides us with\ntwo manifestations of the same quantity. This puts an additional constraint to any model attempting to reproduce\nthe data.\nFig. 2 shows intensity profiles along the axes of trail and\nneckline. They are characterised by a pronounced peak\naround the nucleus and a rather uniform brightness distribution at distances beyond 5′ from the nucleus. According to simulation, the surface brightness in the neckline decreases significantly with growing nucleus distance while it is rather uniform along the trail. Since\nthe influence of radiation pressure decreases with particle\nsize, larger grains remain closer to the nucleus. Therefore, the bright peak in Fig. 2 is likely due to mm/cmsized particles emitted around perihelion in 2002.\nFig. 3 shows the near-nucleus region in more detail and\na plot of synchrones and syndynes as introduced in (9)\nfor the same observation geometry. Syndynes for small\nβ and synchrones for old particles converge towards the\ndirection of the projected comet orbit. In contrast, re-\n\n\fand 28.4 mag/arcsec2 (im R) further out. The enhanced\nsurface brightness around the nucleus is interpreted as the\neffect of mm/cm-sized dust grains emitted around the perihelion passage in 2002.\n\n5.\n\n30\n\n10-4\n10-3\n10-2\n\nsyndynes\nsynchrones\n\n25\n\nACKNOWLEDGEMENTS\n\nThis work is based on observations made with the\nMPG/ESO 2.2m telescope at the La Silla Observatory under programme ID 072.A-9011(A). It has made use of the\nUSNOFS Image and Catalogue Archive operated by the\nUnited States Naval Observatory, Flagstaff Station.\n\n∆ DEC [arcsec]\n\n-200d 0.1\n\n20\n-100d\n0.9\n\n15\n-50d\n\nr.\n\n10\n\nty\n\nci\n\nlo\n\n5\n\nve\n\n.\neg\n\nn\n\n0\n\n-30d\n\nsun-c\n\nomet\n\n-5\n0\n\ndir.\n\n-10\n\n-20\n-30\n-40\n∆ R.A. [arcsec]\n\n-50\n\n-60\n\nFigure 3. Top: Enlarged view of the nucleus and adjacent\nregion in Fig. 1(a) before rotation. Bottom: A plot of synchrones and syndynes for 19 April 2004. Synchrones are\nthe positions of particles of different β emitted at fixed\ntimes, labelled in the plot in days before observation.\nSyndynes show the positions of particles of given β (indicated at the right margin) released at varying dates. The\nnegative orbital velocity vector of the comet corresponds\nto its projected orbit and trail axis. Syndynes of large and\nsynchrones of old particles in the image converge towards\nthis direction. The extended sun-comet vector points to\nwhere young, small grains of high β are expected to be\nfound. In both images, north is up and east is left.\ncently emitted dust of high β is expected to be found\nalong the direction of the projected sun-comet vector and\nto the north-west of it. Given the noisiness of the data,\nwe conclude that we cannot detect sufficient evidence for\nthe presence of small, young particles.\n\n4.\n\nREFERENCES\n\ndi\n\nSUMMARY\n\nWe have observed the dust trail and neckline of comet\n67P in April 2004 with the WFI at the ESO/MPG 2.2m\ntelescope when the comet was at a heliocentric distance\nof 4.7 AU. We do not see a coma of small, recently\nemitted dust particles around the nucleus. The trail and\nneckline, however, are visible over the whole section\nof the comet orbit covered by the image (1.1◦ in mean\nanomaly). Trail and neckline are separated by slightly\ndifferent position angles, in agreement with theoretical\nexpectation. We have derived lower limits for the surface brightness of 27.0 mag/arcsec2 close to the nucleus\n\n[1] Sykes, M. V. and Walker, R. G. Cometary dust trails.\nI - Survey. Icarus, 95:180–210, 1992.\n[2] Sykes, M. V., Lebofsky, L. A., Hunten, D. M., and\nLow, F. The discovery of dust trails in the orbits of\nperiodic comets. Science, 232:1115–1117, 1986.\n[3] Sykes, M. V., Hunten, D. M., and Low, F. J. Preliminary analysis of cometary dust trails. Advances in\nSpace Research, 6:67–78, 1986.\n[4] Kimura, H. and Liu, C. On the structure of cometary\ndust tails. Chin. Astron., 1:235–264, 1977.\n[5] Erben, T., Schirmer, M., Dietrich, J. P., Cordes, O.,\nHaberzettl, L., Hetterscheidt, M., Hildebrandt, H.,\nSchmithuesen, O., Schneider, P., Simon, P., Deul, E.,\nHook, R. N., Kaiser, N., Radovich, M., Benoist, C.,\nNonino, M., Olsen, L. F., Prandoni, I., Wichmann,\nR., Zaggia, S., Bomans, D., Dettmar, R. J., and Miralles, J. M. GaBoDS: The Garching-Bonn Deep Survey. IV. Methods for the image reduction of multichip cameras demonstrated on data from the ESO\nWide-Field Imager. Astronomische Nachrichten,\n326:432–464, 2005.\n[6] Ishiguro, M. private communication.\n[7] Monet, D. G., Levine, S. E., Canzian, B., Ables,\nH. D., Bird, A. R., Dahn, C. C., Guetter, H. H., Harris, H. C., Henden, A. A., Leggett, S. K., Levison,\nH. F., Luginbuhl, C. B., Martini, J., Monet, A. K. B.,\nMunn, J. A., Pier, J. R., Rhodes, A. R., Riepe, B.,\nSell, S., Stone, R. C., Vrba, F. J., Walker, R. L., Westerhout, G., Brucato, R. J., Reid, I. N., Schoening, W.,\nHartley, M., Read, M. A., and Tritton, S. B. The\nUSNO-B Catalog. AJ, 125:984–993, 2003.\n[8] Agarwal, J., Müller, M., Böhnhardt, H., and Grün,\nE. Modelling the large particle environment of comet\n67P/Churyumov-Gerasimenko. Advances in Space\nResearch, in press, 2006.\n[9] Finson, M. L. and Probstein, R. F. A theory of dust\ncomets. I. Model and equations. ApJ, 154:327–352,\n1968.\n\n\f"}