{"id": "http://arxiv.org/abs/astro-ph/0302569v2", "guidislink": true, "updated": "2003-06-04T12:18:38Z", "updated_parsed": [2003, 6, 4, 12, 18, 38, 2, 155, 0], "published": "2003-02-27T16:13:51Z", "published_parsed": [2003, 2, 27, 16, 13, 51, 3, 58, 0], "title": "Baryon Loading of Gamma Ray Bursts by Pick-up Neutrons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0302310%2Castro-ph%2F0302426%2Castro-ph%2F0302269%2Castro-ph%2F0302600%2Castro-ph%2F0302342%2Castro-ph%2F0302041%2Castro-ph%2F0302040%2Castro-ph%2F0302270%2Castro-ph%2F0302207%2Castro-ph%2F0302100%2Castro-ph%2F0302015%2Castro-ph%2F0302149%2Castro-ph%2F0302070%2Castro-ph%2F0302325%2Castro-ph%2F0302294%2Castro-ph%2F0302350%2Castro-ph%2F0302408%2Castro-ph%2F0302569%2Castro-ph%2F0302581%2Castro-ph%2F0302244%2Castro-ph%2F0302213%2Castro-ph%2F0302386%2Castro-ph%2F0302593%2Castro-ph%2F0302563%2Castro-ph%2F0302353%2Castro-ph%2F0302243%2Castro-ph%2F0302577%2Castro-ph%2F0302402%2Castro-ph%2F0302165%2Castro-ph%2F0302306%2Castro-ph%2F0302447%2Castro-ph%2F0302004%2Castro-ph%2F0302201%2Castro-ph%2F0302198%2Castro-ph%2F0302474%2Castro-ph%2F0302321%2Castro-ph%2F0302085%2Castro-ph%2F0302259%2Castro-ph%2F0302147%2Castro-ph%2F0302370%2Castro-ph%2F0302245%2Castro-ph%2F0302104%2Castro-ph%2F0302191%2Castro-ph%2F0302500%2Castro-ph%2F0302482%2Castro-ph%2F0007270%2Castro-ph%2F0007380%2Castro-ph%2F0007205%2Castro-ph%2F0007445%2Castro-ph%2F0007003%2Castro-ph%2F0007287%2Castro-ph%2F0007137%2Castro-ph%2F0007314%2Castro-ph%2F0007390%2Castro-ph%2F0007052%2Castro-ph%2F0007401%2Castro-ph%2F0007434%2Castro-ph%2F0007087%2Castro-ph%2F0007166%2Castro-ph%2F0007356%2Castro-ph%2F0007108%2Castro-ph%2F0007268%2Castro-ph%2F0007320%2Castro-ph%2F0007213%2Castro-ph%2F0007076%2Castro-ph%2F0007328%2Castro-ph%2F0007245%2Castro-ph%2F0007241%2Castro-ph%2F0007083%2Castro-ph%2F0007109%2Castro-ph%2F0007348%2Castro-ph%2F0007365%2Castro-ph%2F0007337%2Castro-ph%2F0007366%2Castro-ph%2F0007359%2Castro-ph%2F0007447%2Castro-ph%2F0007234%2Castro-ph%2F0007239%2Castro-ph%2F0007131%2Castro-ph%2F0007251%2Castro-ph%2F0007317%2Castro-ph%2F0007074%2Castro-ph%2F0007164%2Castro-ph%2F0007172%2Castro-ph%2F0007324%2Castro-ph%2F0007292%2Castro-ph%2F0007302%2Castro-ph%2F0007085%2Castro-ph%2F0007395%2Castro-ph%2F0007033%2Castro-ph%2F0007053%2Castro-ph%2F0007124%2Castro-ph%2F0007278%2Castro-ph%2F0007318%2Castro-ph%2F0007387%2Castro-ph%2F0007275%2Castro-ph%2F0007192%2Castro-ph%2F0007413%2Castro-ph%2F0007397%2Castro-ph%2F0007300%2Castro-ph%2F0007455&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Baryon Loading of Gamma Ray Bursts by Pick-up Neutrons"}, "summary": "It is proposed that the baryons in gamma ray burst (GRB) fireballs originate\nas \"pick-up\" neutrons that leak in sideways from surrounding baryonic matter\nand convert to protons in a collision avalanche. The asymptotic Lorentz factor\nis estimated, and, in the absence of collimation, is shown to be angle\ndependent. Reasonable agreement is obtained with existing limits on the GRB\nbaryonic component. The charged decay and collision products of the neutrons\nbecome ultrarelativistic immediately, and a UHE neutrino burst is produced with\nan efficiency that can exceed 0.5. Other signatures may include lithium,\nberyllium and/or boron lines in the supernova remnants associated with GRB's\nand high polarization of the gamma rays.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0302310%2Castro-ph%2F0302426%2Castro-ph%2F0302269%2Castro-ph%2F0302600%2Castro-ph%2F0302342%2Castro-ph%2F0302041%2Castro-ph%2F0302040%2Castro-ph%2F0302270%2Castro-ph%2F0302207%2Castro-ph%2F0302100%2Castro-ph%2F0302015%2Castro-ph%2F0302149%2Castro-ph%2F0302070%2Castro-ph%2F0302325%2Castro-ph%2F0302294%2Castro-ph%2F0302350%2Castro-ph%2F0302408%2Castro-ph%2F0302569%2Castro-ph%2F0302581%2Castro-ph%2F0302244%2Castro-ph%2F0302213%2Castro-ph%2F0302386%2Castro-ph%2F0302593%2Castro-ph%2F0302563%2Castro-ph%2F0302353%2Castro-ph%2F0302243%2Castro-ph%2F0302577%2Castro-ph%2F0302402%2Castro-ph%2F0302165%2Castro-ph%2F0302306%2Castro-ph%2F0302447%2Castro-ph%2F0302004%2Castro-ph%2F0302201%2Castro-ph%2F0302198%2Castro-ph%2F0302474%2Castro-ph%2F0302321%2Castro-ph%2F0302085%2Castro-ph%2F0302259%2Castro-ph%2F0302147%2Castro-ph%2F0302370%2Castro-ph%2F0302245%2Castro-ph%2F0302104%2Castro-ph%2F0302191%2Castro-ph%2F0302500%2Castro-ph%2F0302482%2Castro-ph%2F0007270%2Castro-ph%2F0007380%2Castro-ph%2F0007205%2Castro-ph%2F0007445%2Castro-ph%2F0007003%2Castro-ph%2F0007287%2Castro-ph%2F0007137%2Castro-ph%2F0007314%2Castro-ph%2F0007390%2Castro-ph%2F0007052%2Castro-ph%2F0007401%2Castro-ph%2F0007434%2Castro-ph%2F0007087%2Castro-ph%2F0007166%2Castro-ph%2F0007356%2Castro-ph%2F0007108%2Castro-ph%2F0007268%2Castro-ph%2F0007320%2Castro-ph%2F0007213%2Castro-ph%2F0007076%2Castro-ph%2F0007328%2Castro-ph%2F0007245%2Castro-ph%2F0007241%2Castro-ph%2F0007083%2Castro-ph%2F0007109%2Castro-ph%2F0007348%2Castro-ph%2F0007365%2Castro-ph%2F0007337%2Castro-ph%2F0007366%2Castro-ph%2F0007359%2Castro-ph%2F0007447%2Castro-ph%2F0007234%2Castro-ph%2F0007239%2Castro-ph%2F0007131%2Castro-ph%2F0007251%2Castro-ph%2F0007317%2Castro-ph%2F0007074%2Castro-ph%2F0007164%2Castro-ph%2F0007172%2Castro-ph%2F0007324%2Castro-ph%2F0007292%2Castro-ph%2F0007302%2Castro-ph%2F0007085%2Castro-ph%2F0007395%2Castro-ph%2F0007033%2Castro-ph%2F0007053%2Castro-ph%2F0007124%2Castro-ph%2F0007278%2Castro-ph%2F0007318%2Castro-ph%2F0007387%2Castro-ph%2F0007275%2Castro-ph%2F0007192%2Castro-ph%2F0007413%2Castro-ph%2F0007397%2Castro-ph%2F0007300%2Castro-ph%2F0007455&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is proposed that the baryons in gamma ray burst (GRB) fireballs originate\nas \"pick-up\" neutrons that leak in sideways from surrounding baryonic matter\nand convert to protons in a collision avalanche. The asymptotic Lorentz factor\nis estimated, and, in the absence of collimation, is shown to be angle\ndependent. Reasonable agreement is obtained with existing limits on the GRB\nbaryonic component. The charged decay and collision products of the neutrons\nbecome ultrarelativistic immediately, and a UHE neutrino burst is produced with\nan efficiency that can exceed 0.5. Other signatures may include lithium,\nberyllium and/or boron lines in the supernova remnants associated with GRB's\nand high polarization of the gamma rays."}, "authors": ["A. Levinson", "D. Eichler"], "author_detail": {"name": "D. Eichler"}, "author": "D. Eichler", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/378487", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0302569v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0302569v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, substantial changes from previous version", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0302569v2", "affiliation": "BGU", "arxiv_url": "http://arxiv.org/abs/astro-ph/0302569v2", "journal_reference": "Astrophys.J. 594 (2003) L19-L22", "doi": "10.1086/378487", "fulltext": "Baryon Loading of Gamma Ray Bursts by Pick-up Neutrons\nAmir Levinson1 and David Eichler2\n\narXiv:astro-ph/0302569v2 4 Jun 2003\n\nABSTRACT\nIt is proposed that the baryons in gamma ray burst (GRB) fireballs originate\nas \"pick-up\" neutrons that leak in sideways from surrounding baryonic matter\nand convert to protons in a collision avalanche. The asymptotic Lorentz factor\nis estimated, and, in the absence of collimation, is shown to be angle dependent.\nReasonable agreement is obtained with existing limits on the GRB baryonic\ncomponent. The charged decay and collision products of the neutrons become\nultrarelativistic immediately, and a UHE neutrino burst is produced with an\nefficiency that can exceed 0.5. Other signatures may include lithium, beryllium\nand/or boron lines in the supernova remnants associated with GRB's and high\npolarization of the gamma rays.\n\n1.\n\nIntroduction\n\nAn outstanding question in GRB fireballs is the fraction of baryons within them. It\nis suspected that this fraction is low, because they seem to expand with ultra-relativistic\nLorentz factors, Γ ≥ 102 . While the striking paucity of baryons could be accounted for by\ninvoking energy release on field lines where baryons are confined, say by an event horizon\nor strong binding to strange quark matter, the question would then arise as to whether\nthe mechanism that enforces baryon purity would be so effective that there would be none\nwhatsoever in the fireball.\nThis is possible; the fireball could consist of just pairs, gamma rays, and low frequency\nPoynting flux, but then another question would arise: How do the pairs survive recombination while expanding from an extremely compact region? Were the fireball adiabatically\nexpanding, baryon-free and thermal (Paczynski 1986, Goodman 1986), the e+ e− pairs would\nmostly annihilate at an internal temperature of about 15 KeV, corresponding to a radius of\nnot much more than ∼ 109 cm. By contrast, proton-electron pairs would face no such problem, but would raise the first question: If there are so few, why are there any at all? [Note\n1\n\nSchool of Physics & Astronomy, Tel Aviv University, Tel Aviv 69978, Israel; Levinson@wise.tau.ac.il\n\n2\n\nPhysics Department, Ben-Gurion University, Beer-Sheva 84105, Israel; eichler@bgumail.bgu.ac.il\n\n\f–2–\nthat the afterglow from the giant Aug. 27, 1998 flare (Frail, Kulkarni, and Bloom 1999) from\nSGR 1900+14 was sufficiently weak that the outburst seems to have not put much of its\nenergy into escaping pairs (Eichler 2002), in marked contrast to long, cosmologically distant\nGRB's. This serves as a reminder that a material fireball that mostly survives the compact\nregions of its origin is not to be taken for granted.]\nA theory of baryon content in GRB fireballs could answer these questions. In this\nletter we attempt to estimate the baryon content that would arise if the fireball originated\nentirely on magnetic field lines that connect to an event horizon (or anything equally effective\nin enforcing total baryon purity). We assume that the origin of the baryons is leakage\nin the form of neutrons crossing from baryon rich field lines to the baryon free outflow\n(Eichler and Levinson, 1999, hereafter EL). The freshly picked-up neutrons are extremely\nenergetic in the frame of the outflow, and this creates the possibility of creating very energetic\n(109 ≤ E ≥ 1015 eV) pions and neutrinos. The analysis of neutron pick-up and neutrino\nproduction rates and energies is somewhat similar to that of EL, but here we note a particular\ninstability that exists in this situation: a collisional avalanche. This leads to particularly\nefficient neutron pick-up and neutrino production.\nNeutrons and neutrinos have also been discussed by other authors. Derishev et al.\n(1999a,b) argued that roughly equal numbers of neutrons and protons should be present in\nthe fireball, and studied the consequences for the hydrodynamics and emission during the\nprompt and afterglow phases (see also Beloborodov 2002). They proposed that decoupling\nof the neutrons during the acceleration of the fireball may lead to a burst of ∼ 10 GeV\nneutrinos through inelastic scattering (see also Bahcall and Meszaros 2000). In all the work\ncited above, the mechanism of baryon contamination is not addressed. The authors merely\nassume that the baryon content of the fireball is fixed by some mechanism on the smallest\nscales, prior to its acceleration. Lemoine (2002) reexamined the conditions under which the\nneutrons in the fireball may remain free and concluded that fusion of neutrons and protons\nto 4 He should precede decoupling if the dynamical timescale exceeds 10−4 s (cf. Beloborodov\n2002). He then argued that this would lead to a dramatic suppression of the density of free\nneutrons and, consequently, neutrino emission. However, he did not discuss the possibility\nof viscous heating at the interface between the fireball and its surroundings. In what follows\nwe consider this possibility and argue that baryonic contamination can occur on much larger\nscales (∼ 1010 cm) via diffusion of neutrons from a baryon rich wind into the baryon free\nfireball.\nAdditional baryon loading may arise from mixing, owing to hydrodynamic instabilities\nat the interface between the baryon poor jet (BPJ) and the baryon rich outflow (BRW) or the\nenveloping material of the host star. However, the degree of mixing may depend strongly on\n\n\f–3–\nchanges in the magnetic topology, which cannot be easily assessed. Moreover, it is unlikely\nthat it could load all but the outmost layers of the BPJ when the hydrodynamic crossing\ntime scale for the dense, outer material exceeds the proper expansion timescale of the BPJ.\n\n2.\n\nWind ejection\n\nIn GRB scenarios that invoke a stellar type progenitor, the ejection of a baryon poor\nfireball follows a catastrophic event that results in the formation of a system consisting of a\ncompact object surrounded by a hot disk or torus. Here we assume that the fireball emanates\nfrom the immediate vicinity of the compact object (a black hole, say) essentially devoid of\nbaryons. This degree of baryon purity is natural if the fireball is generated on field lines\nthat thread the black hole, either by neutrino annihilation or by extraction of the black hole\nrotational energy (Levinson and Eichler 1993).\nDuring the ejection of the fireball, the matter in the central parts is maintained at\ntemperatures well above 1 MeV, at which emission of MeV neutrinos is the dominant cooling\nmechanism. Neutrinos escaping from the inner parts of the torus heat the surface layers and\ndrive a powerful, baryon rich wind that propagates at a sub-relativistic speed, and confines\nthe baryon poor fireball. Critical point analysis (van Putten & Levinson 2003, see also\nLevinson and Eichler 1993) yields an estimate for the baryon rich wind luminosity of\n4\nLw ≃ 1049.5 βsc Tt10\nA13 erg s−1 ,\n\n(1)\n\nand for the corresponding mass loss rate of\n−2\nṀ = 2Lw /3a2sc ≃ 1030 Lw51 βsc\ngr s−1 ,\n\n(2)\n\nwhere A = 1013 A13 cm2 is the surface area of the torus, Tt = 1010 Tt10 K is the torus\ntemperature and asc = βsc c ≃ 1010 (M/M⊙ )1/2 (rc /106 cm)−1/2 cm s−1 is the sound speed at\nthe wind critical point, with M being the mass of the compact object, and rc the radius\nof the critical point. For a temperature of 4 MeV, a wind luminosity of ∼ 1051 erg s−1 is\nexpected.\nThe large optical depth of the expelled wind (τT ∼ 108 Lw51 /r10 ) and the extremely short\ncooling time render the wind pressure radiation dominated. The determination of the wind's\ntemperature and density profiles beyond the critical point requires quantitative treatment of\nwind acceleration in the supercritical region. Assuming for simplicity that the wind velocity\nvw = βw c is constant, we obtain a wind temperature\n1/4\n\n−1/2\n\nTw ≃ 108.5 Lw51 βw−1/4 (ψ 2 − θ2 )−1/4 r10\n\nK,\n\n(3)\n\n\f–4–\nand baryon density\n2 3\nnp = 1023 Lw51 /r10\nβw (ψ 2 − θ2 ) cm−3 ,\n\n(4)\n\nwhere ψ is the opening angle of the baryon rich wind (which, as argued below, may be\ncollimated).\nIf the explosion occurs inside a star, as in the collapsar scenario for GRB's, both the\nfireball and the surrounding baryon rich wind must advance first through the stellar core\nbefore they break out. During this stage they both may be collimated by the kinetic pressure\nof the core. As they advance through the star, the BPJ and the baryon rich wind each drives\na forward shock that accelerates the stellar material. It is reasonable to assume that the\nBPJ and the baryon rich wind have similar isotropic equivalent luminosities in which case\nwe expect their head velocities to be roughly the same. The temperature of the shocked\nwind plasma (behind the reverse shock) is given approximately by eq. (3), upon replacing\nβw with βh . Eventually, the BPJ breaks through the host star's envelope if there is one.\nOtherwise we would not observe the GRB it is supposed to produce. ¿From the point of\nview of neutrino production, however, the pre-breakout stage may also be important.\n\n3.\n\nThe neutron content of the torus wind\n\nIf the torus is a remnant of a degenerate star, then it contains nearly half its mass in\nneutrons. At temperatures above the dissociation temperature of the nuclei (0.5 - 0.7 MeV)\nthe neutrons and protons become free. The neutron to proton ratio ξn would then either be\nthe initial value, or, if the weak interaction equilibration time\ntweak ≃ 5 × 10−2 (T /3MeV)−5 s\n\n(5)\n\nis shorter than the outflow time, texp , the equilibrium value, ξn ≃ exp[(mp − mn )/T ], where\nmi is the mass of species i (i = n, p). As noted by Derishev et al. (1999b), in the latter case\nneutrons will be effectively produced through the reaction p + e− → n + ν, even if the initial\ntorus composition is predominantly hydrogen. If freeze-out of the weak interaction occurs\nat T > (mn − mp ) ≃ 1 MeV, then ξn ∼ 1 is generally expected.\nAbove the critical point, the temperature in the wind declines with radius. Once it drops\nbelow about Trec ≃ 77 keV (depending weakly on density) the free protons and neutrons\nwill recombine to form deuterium. The reaction rate for deuterium formation is < σd v >≃\n5 × 10−20 cm3 s−1 . The corresponding recombination time is then given by\n2\ntrec ≃ 10−3.5 (ψ 2 − θ2 )βw3 r10\nL−1\nw51 s,\n\n(6)\n\n\f–5–\nwhere eq. (4) has been used. Recombination will be effective at radii\nr10 < 103 Lw51 βw−4 (ψ 2 − θ2 )−1\n\n(7)\n\nat which trec << texp , provided the temperature there is below Trec . Given Trec ≃ 77 keV\nand equation (3)) we conclude that the radius below which free neutrons can exist in the\nwind is\n1/2\nrn ≃ 2 × 109 Lw51 (ψ 2 − θ2 )−1/2 βw−1/2 cm.\n(8)\n\nFor reasonable wind parameters, rn should lie in the range between a few times 109 to a few\ntimes 1011 cm.\n\nWhile we have assumed that the BPJ is ensheathed by a neutron-rich outflow which we\nexpect exists, we could, for the purposes of the following discussion, assume that the BPJ\nis in direct contact with the envelope of the host star that collimates it. Neutrons would be\nfreed up at the interface because the inner wall of the envelope would be heated by the BPJ.\n\n4.\n\nNeutron pick-up\n\nThe free protons and neutrons in the wind are coupled by nuclear elastic scattering. At\nthe temperatures of interest the corresponding rate is < σel v >≃< σ0 c >= 10−15 cm3 s−1 ,\nindependent of center of mass energy.\nThe flux of neutrons diffusing into the BPJ from the interface separating the BPJ and\nthe baryon rich wind is given by JD (r) = λnp vis ∂nn /∂x = λnp vis (nn /l), where vis = βis c =\n(kT /mp )1/2 the ion thermal speed (not to be confused with the sound speed of the radiation\ndominated plasma), λnp = βis /(np σ0 ) is the mean free path for np collisions, x denotes the\ncylindrical radius, and l the gradient length scale (which may vary with r).\nAssuming that the boundary between the BPJ and baryon rich wind is very sharp at\nthe BPJ injection radius (r0 ∼ 107 cm), the gradient length scale at some larger radius r\nis l ≃ (λnp vis texp )1/2 with texp = r/vw being the wind expansion time. The total number of\nneutrons diffusing into the BPJ below some radius r is given by Ndif f (r) ≃ 2πθr 2 texp JD (r) =\n2πθr 2 lnn . Combining the above results one finds,\nNdif f (r) = 2πθ\n\nr 5/2\n3/2 1/2\nn\n≃ 1050 ξn [(ψ/θ)2 − 1]−1/2 (βis /βw2 )r10 Lw51 ,\n√\nn\n1/2\nnp σ0\nβw\nβis\n\n(9)\n\nwhere ξn = nn /np .\nIf the density gradient length scale, l, at the BPJ baryon rich wind interface is larger\nthan assumed above, e.g., as a result of some mixing, then the gradient would be smeared\n\n\f–6–\nand the diffusive flux would be reduced, but presumably advection would replace it and\nkeep the neutron-proton mixture hot. It is hard to see how mixing could penetrate to the\nBPJ center without disrupting the BPJ entirely, so any mixing would be restricted by this\nconsideration to load only the periphery of the BPJ.\n−1\nNow the fraction of neutrons drifting through the BPJ that decay, tcross /τn ≃ 10−3.5 θβis\nr10 ,\nwhere tcross = θr/vis is the BPJ crossing time and τn = 900 s is the neutron lifetime, is small.\nHowever, each decay liberates a proton that generates more protons via collisions with the\nundecayed neutrons. The proton fraction thus grows exponentially in what we term a collision avalanche, until becoming comparable to the neutron fraction. To estimate the growth\nlength of the shower, we note that the density of target neutrons inside the BPJ (static in the\nLab frame) is (tcross /texp )(Ndif f /πθ2 r 3 ), and the optical depth for a collision of a picked-up\nbaryon with the target neutrons is\n−1/2\n\n1/2\n\nτnp = σnp r(tcross /texp )(Ndif f /πθ2 r 3 ) = 104.5 βw1/2 ψ −1 r10 Lw51 ,\n\n(10)\n\nwhere a cross section for inelastic pn collisions of σpn = 40 mb has been adopted (Hagiwara\net al. 2002). Evidently, the growth length of the shower is much shorter than the injection\nradius and it will saturate already at the base of the BPJ. At this point every neutron\ndiffusing into the BPJ is picked up via a collision with a fast baryon coming from below.\nCombining equations (8) and (9), and taking βis = 10−2 (the ion thermal speed at the\nrecombination temperature) yields the total number of neutrons picked up by the BPJ:\n5/4\n\nNcap = Ndif f (r = rn ) ≃ 1047 ξn θ(ψ 2 − θ2 )−5/4 βw−11/4 Lw51 .\n\n(11)\n5/4\n\nAdopting for illustration θ = ψ/2 = 0.1, ξn = 1, βw = 0.3, we obtain Ncap ≃ 3 × 1049 L51 .\nNow the fact that the avalanche growth is so rapid shows that the inwardly drifting\nneutrons may be converted back to having a 50 percent proton component shortly after\ncrossing into the BPJ, and will merely line the BPJ outer boundary with a hot viscous\nsublayer (just as peripheral turbulent mixing would do). The short mean free path also\nmeans that relative Lorentz factor differences across it are likely to be much less than the\ntotal difference. The important assumption is that the inner side is exposed to contact with\nthe more relaticvistic BPJ and is kept hot enough to have a free neutron component.\nThe picture we are led to by our basic model assumptions is a hot viscous sublayer with\ndensity decreasing inwards, and neutrons and protons coexisting in roughly equal numbers in\nthe most tenuous regions. Below some density, the neutrons stream freely into the interior of\nthe BPJ. Define the free streaming density nf s to be that at which the proper hydrodynamic\ntime r/cΓ equals the proper collision time Γ/n < σv >, i.e.\nnf s ≡ Γ2 c/r < σv > .\n\n(12)\n\n\f–7–\nIf the bulk Lorentz factor Γ is determined by the density of picked up neutrons then\n−1/3\n\n1/3\n\nΓf s = Lj /(nf s mc2 πθ2 r 2 ch) = 26r12 Lj50 θ−2/3 h−1/3\n\n(13)\n\nwhere Lj is the BPJ luminosity and h is the specific enthalpy of the fluid in units of mp c2 ,\nand where we have used equation (12) in the last part of eq. (13). The free streaming density\nis\nnf s = (Lj /πθ2 mp c3 h)2/3 r −5/3 σ −1/3 .\n(14)\nThe number of neutrons per unit time crossing the free streaming boundary inward\nwithin radius r is given roughly by\n2/3\n\n1/3\n\ndNcr /dt = πθr 2 nf s c/Γ = 8 × 1049 r12 Lj50 θ1/3 h−1/3 s−1\n\n(15)\n\nwhere we assume that the random component of the neutron velocity at the free streaming\nboundary is close to c. Thus, at r12 ∼ 1, most of the neutrons that diffused into the BPJ at\nr10 ≤ 1 are already free streaming.\nWhen n ≫ nf s , h is assumed to be close to unity. In the free streaming zone, where Γ ≫\nΓf s , the neutrons are subjected to large shear in the BPJ, and as they move axisward, find\nthemselves moving relative to the local frame at lab angle χ and nearly backward with a local\nLorentz factor γ ′ ∼ ΓΓf s (1−ββf s cosχ). Thus h may be estimated as γ ′ ∼ ΓΓf s (1−ββf s cosχ)\nin the free streaming zone. At the free streaming surface, h is very geometry dependent, and\ncan be between 1 and Γ2f s\nThe local spread of neutron velocities at the free streaming boundary is of order 1/Γf s ,\nso if θ ≥ 1/Γ, the transverse velocity of an \"inwardly\" free streaming neutron may point\naway from the axis, as long as it does so less than the average local velocity, and χ ≤ 1/Γf s .\nSome fraction(∼ 1/e) of the inwardly streaming neutrons will encounter further collisions,\nthus loading a \"collisional annulus\" of thickness 1/Γf s and radius θ, while the rest may\ncontinue further inward until they decay. If Γ2f s ∆t, where ∆t is the GRB duration, exceeds\nthe neutron lifetime 900sΓf s , then most of the neutrons decay within the fireball. Otherwise\nthey decay behind it and leave a baryon pure core ahead.\nThe fluid parameters in the collisional annulus are similar to those described by Derishev\nand co-workers, where the radial acceleration just happens to proceed on a scale comparable\nto the mean collision time, inducing a modestly relativistic relative (radial) velocity between\nthe neutrons and protons. In our picture, this apparent numerical coincidence is in fact natural for the annulus defined by marginally freely streaming neutrons. The annulus occupies\n1/3 −1/3\n2/θΓf s ∼ 0.03r12 Lj50 θ−1/3 h1/3 of the beam solid angle. For θ = 0.1 and h1/3 ∼ 6, this is\ncomparable to the solid angle of the core, and suggests the possibility that many of the GRB\n\n\f–8–\nwe see are just these annuli. Nevertheless, the observational effects of a much higher Γ core\nare worth considering, especially because its elements can overtake the denser, peripheral\nneutron outflow.\nIt may be that the BPJ is collimated, and that its outer parts - or at least the inwardly\nfree streaming neutrons - may eventually converge at the BPJ axis. The density can increase\ndownstream and neutrons that have already passed through the free streaming boundary\n(according to the formal local definition) may then with high probability collide further\ndownstream with impact angle χ ≫ Γ−1\nf s in a region of Γ ≫ Γf s . (Even in the case of an\nasymptotically conical BPJ (Levinson and Eichler 2000), the fact that Γf s decreases with r\nmeans that neutrons free streaming inward from a point r1 ≪ 1012 cm, will graze those free\nstreaming from further upstream at point r2 ≤ 1012 cm where r2 ≥ r1 . The impact angle as\nviewed in the lab frame is of order Γ−1\nf s,2 .)\nWhen χ ≫ 1/Γf s , freely axisward streaming neutrons are \"broadsided\" by faster interior\nplasma at impact angle χ ≥ 1/Γf s , and their optical depth to baryons in the interior plasma\nis enhanced by a factor θ2 Γ2f s . Thus, the optical depth presented by axisward streaming\nneutrons to the interior plasma is at least of order unity and neutrino production by picked\nup particles is efficient. The energy of the neutrinos released in this avalanche is of order\n0.05 of the typical proton energy.\nThe \"top down\" nature of pickup suggests that much energy can be dissipated in extremely energetic collisions. A high Γ flow that is slowed down by neutron pickup can be\nviewed as slowing down in stages, such that at each stage ǫ(r)dN/dt ∼ Lj , where ǫ(r) is the\naverage energy per baryon at radius r and dN/dt, also a function of r, is the rate of pickup\nwithin radius r. For each new collisional pickup, about 50 percent of the original energy is\ndissipated into pion decay products, mostly neutrinos. (In each collision between a moving\nbaryon and a target neutron, many pions are produced. The leading pion has about 0.2 of\nthe original baryon energy, and the muon neutrino from its decay will have about 0.05 of\nthe original, provided that the impact angle exceeds 1/Γf s . Thus neutrinos of up to ∼ 0.05ǫ\nwill emerge, and they will contain about 5 percent of the jet energy. Another 10 percent or\nso is in the soft pions, which have a lab frame Lorentz factor somewhat larger but of order\nthe center of mass Lorentz factor.) In the crude approximation that the neutrino losses are\na small fraction of the collision energy, the spectrum of neutrinos is then dN/dE ∝ E −2\nover a dynamical range that depends on how many optical depths the avalanche proceeds\nthrough; including neutrino losses leads to an even harder spectrum. Even if neutron pickup\nis extremely inefficient, this would still allow efficient neutrino emission in fewer, higher\nenergy neutrinos. In the extreme scenario where there is only neutron decay and a single\noptical depth for collisions, there are about 6 × 1049 c∆t/τn Γf s ∼ 1048 /Γf s neutrons that\n\n\f–9–\ndecay within the fireball. This suggests an asymptotic Γ of 104 and a maximum proton\nenergy of 108 mp c2 . Most of this energy will be liberated as neutrinos over an optical depth\nof several. Note that for BPJ proton energies of order 108 mp c2 , even the soft pions can\ndecay into E ≫ 1 TeV neutrinos. Such extremely hard spectra would be a highly distinctive\nsignature of the model, and the optical depth crossed by the avalanche would be manifested\nin the neutrino spectrum.\nIt is also instructive to view the problem from the point of view of a free streaming\nneutron. It has a better than even chance of not making another collision once entering\nthe free streaming zone. However, the rare collision is with extremely relativistic plasma,\nand the energy liberated per collision goes as Γ2 . Writing the expected energy release per\npath length as < dE/ds >= n < σv > Γ2 , and estimating Γ2 as L/πr 2 θ2 n, we notice that\n< dE/ds > is then independent of density, and much of the energy release can be in the\nform of rare but very energetic collisions.\nA neutrino flux of 1052 F52 ergs could be detected at the one count level with a 1km2\nneutrino detector at a distance of (F52 f )−1/2 Gpc, where f is the beaming factor. As noted\nearlier (Eichler and Levinson 1999, Meszaros and Waxman 2001), smothered GRB's could\nalso be detected in (and only in) neutrinos.\n\n5.\n\nLight Element Production\n\nLight element production by spallation was discussed by Eichler and Letaw (1987) in\nregard to scenarios of UHE particle acceleration within supernovae ejecta. It was estimated\nthat each cosmic ray would produce about 10 10 B atoms from interaction with somewhat\nheavier nuclei, and that light element abundances constrain the average supernova to produce\nno more than about 1050 prompt cosmic rays in the midst of heavy nuclei. For a shock\naccelerated spectrum, the number density is dominated by GeV protons, and this would\nconstrain the energy to less than 1048 ergs in cosmic rays. However, this would not apply\nto a spectrum of pickup ex-neutrals that is dominated by protons above 1 TeV. Also, an\nintense burst of particles on the same surface would produce \"overkill\" - i.e. light elements\nproduced by spallation would then be further degraded by repeated spallation events. This\nis significant at a high energy particle fluence exceeding 1026 cm−2 , though Rayleigh-Taylor\ninstabilities at the head of the jet could lessen the overkill by constantly providing fresh\nsurface.\nMost important, however, is that a GRB-associated supernova is not typical. It may\ntherefore be worth searching for excess light element lines in the young supernova remnants\n\n\f– 10 –\nassociated with GRB's. Enhancements of two orders of magnitude above the cosmic abundance could obtain. The original GRB-associated supernova, SN1998bw, had a remarkably\nlarge outflow velocity, c/6, suggesting that the ejecta may not have been particularly massive,\nand may have been preferentially close to the collimated fireball within.\nWhile energetic protons which could be channeled away from enveloping material by\nelectromagnetic forces might never interact with the surrounding ejecta, neutrons would\neasily penetrate the envelope if the ejecta collimate the GRB fireball, for then the walls of\nthe BPJ curve inward.\n\n6.\n\nConclusions\n\nWe have worked out the details of an earlier suggestion that baryon loading of GRB\nfireballs is accomplished by pick-up ex-neutrons that crept across magnetic field lines into\nthe path of the collimated fireball from the collimating material. For a GRB lasting, say, 30\nseconds (r12 ∼ 1), and having conical collimation θ, we find that there is a free streaming\n1/4\nannulus at which the flow has a Lorentz factor Γf s of about 35L50 (θ/0.1)−1/2 . (In this\nestimate we assumed that the specific enthalpy h, which is rapidly varying at this point,\nis roughly Γf s , and note that the result is only weakly dependent on it.) The thickness of\nthe annulus is about 1/Γf s , and 0.6(θ/0.1)−1/2 of the solid angle within the cone of opening\nangle θ is subtended by the annulus. Well inside the annulus, i.e. when θ ≫ 1/Γ, the bulk\nLorentz factor may be considerably higher, and the spectrum could be considerably harder.\nThis suggests the possibility of extremely hard GRB's that might yield UHE photons and/or\nneutrinos, yet be relatively inconspicuous in soft γ-rays. Outside the annulus, the baryon\nloading is greater, Γ is considerably lower and this part of the outflow could be responsible for\nX-ray flashes (Berezinsky and Prilutsky, 1985), when the viewing angle happens to coincide\nwith it. Prediction of a general angular distribution for observed GRB's is frustrated by\nour ignorance of the intrinsic distribution for all GRB's, as well as of the dependence of soft\ngamma ray efficiency on the amount of mass loading.\nIf the GRB is collimated by surrounding material, such as the envelope of a host star,\nenough that θ ≤ Γf s , then the transverse structure is much closer to being uniform.\nThe baryons in the fireball can, of course, then go on to generate further neutrinos\ndownstream of their point of origin as in several previous discussions (Eichler 1994, Paczynski\nand Xu 1994, Waxman and Bahcall 1997). In this paper, on the other hand, we have\npresented a scenario for baryon loading whereby UHE neutrinos are a logical consequence.\nThe neutrinos that result have individual energies of order Γ2 mπ ∼ 1012−15 eV, which are\n\n\f– 11 –\neasier to detect with large underwater and under-ice neutrino detectors than those at several\nGeV, which could result from differential acceleration of protons and neutrons by fireball\npressure. They would have a very hard spectrum and be a highly distinctive feature of the\npick-up model. Remarkably, the total energy output in neutrinos can in principle as high as\nthat of the observed fireball, or even higher.\nThe ability to catch GRB-associated supernovae at an early stage should be greatly\nenhanced by SWIFT, and it may be possible to search for spallation-induced light element\nenhancement in the young supernova ejecta.\nThe emission of γ-rays from an annulus just inside an optically thick wall should give\nrise to a strongly polarized reflected component, as noted by EL. A quantitative discussion\nof this will be given in a subsequent paper.\nWe thank E. Derishev and the referee for useful discussions. This research was supported\nby the Arnow Chair of Astrophysics at Ben Gurion University and by an Adler Fellowship\nawarded by the Israel Science Foundation.\n\nREFERENCES\nBahcall, J.N. & Meszaros, P. 2000, Phys. Rev. Lett., 85, 1362\nBeloborodov, A.M. astro-ph/0210522\nBerezinsky, V.S. and Prilustsky, O. F. Proc. 19th ICRC, OG 1, 29\nDerishev, E.V., Kocharovsky, V.V. & Kocharovsky, VI.V. 1999a, ApJ, 521, 640\nDerishev, E.V., Kocharovsky, V.V. & Kocharovsky, VI.V. 1999b, A&A, 345, L51\nEichler, D. Ap. J. Suppl. 99, 877\nEichler, D. 2002, MNRAS, 335, 4, 883\nEichler, D. & Levinson, A. 1999, ApJ, 521, L117\nFrail, D., Kulkarni, S. & Bloom, J.S. 1999, Nature, 398, 127\nGoodman, J. 1986, ApJ, 308, L47\nHagiwara, K. et al. 2002, Phys. Rev. D, 66, 010001\nLemoine, M. 2002, A&A, 390, 31\n\n\f– 12 –\nLevinson, A. and Eichler, D. 1993, Ap. J.418, 386\nMeszaros, P., & Waxman, E. 2001, Phy. Rev. Lett. 87, 1102\nPaczynski, B. 1986, ApJ, 308, L43\nPaczynski, B. and Xu, G. 1994, Ap. J. 427, 708\nTasevsky, M. (2001) hep-exp 0110084 and references therein\nTan, J., Matzner, C.D. & McKee, C.F. 2001, ApJ, 551, 946\nvan Putten, M.V.P. & Levinson, A. 2003, ApJ, 584, 937\nWaxman, E. & Meszaros, P. 2003, ApJ, 584, 390\nWaxman, E. 2001, Nucl. Phys. B (Proc. Suppl.) 91, 494\nWaxman, E. and Bahcall. J. 1997, Phys. Rev. Lett., 78, 2292\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n\f"}