{"id": "http://arxiv.org/abs/astro-ph/0309518v2", "guidislink": true, "updated": "2003-09-20T13:53:15Z", "updated_parsed": [2003, 9, 20, 13, 53, 15, 5, 263, 0], "published": "2003-09-18T20:47:35Z", "published_parsed": [2003, 9, 18, 20, 47, 35, 3, 261, 0], "title": "Inferring the coronal flaring patterns in AGN from reverberation maps", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0309759%2Castro-ph%2F0309531%2Castro-ph%2F0309148%2Castro-ph%2F0309508%2Castro-ph%2F0309589%2Castro-ph%2F0309441%2Castro-ph%2F0309675%2Castro-ph%2F0309376%2Castro-ph%2F0309127%2Castro-ph%2F0309659%2Castro-ph%2F0309732%2Castro-ph%2F0309727%2Castro-ph%2F0309046%2Castro-ph%2F0309239%2Castro-ph%2F0309569%2Castro-ph%2F0309598%2Castro-ph%2F0309798%2Castro-ph%2F0309518%2Castro-ph%2F0309283%2Castro-ph%2F0309017%2Castro-ph%2F0309186%2Castro-ph%2F0309048%2Castro-ph%2F0309119%2Castro-ph%2F0309192%2Castro-ph%2F0309144%2Castro-ph%2F0309090%2Castro-ph%2F0309290%2Castro-ph%2F0309624%2Castro-ph%2F0309097%2Castro-ph%2F0309323%2Castro-ph%2F0309416%2Castro-ph%2F0309135%2Castro-ph%2F0309010%2Castro-ph%2F0309628%2Castro-ph%2F0309217%2Castro-ph%2F0309153%2Castro-ph%2F0309047%2Castro-ph%2F0309341%2Castro-ph%2F0309054%2Castro-ph%2F0309311%2Castro-ph%2F0309780%2Castro-ph%2F0309202%2Castro-ph%2F0309661%2Castro-ph%2F0309502%2Castro-ph%2F0309454%2Castro-ph%2F0309401%2Castro-ph%2F0309347%2Castro-ph%2F0309102%2Castro-ph%2F0309031%2Castro-ph%2F0309379%2Castro-ph%2F0309204%2Castro-ph%2F0309318%2Castro-ph%2F0309511%2Castro-ph%2F0309278%2Castro-ph%2F0309072%2Castro-ph%2F0309140%2Castro-ph%2F0309758%2Castro-ph%2F0309536%2Castro-ph%2F0309452%2Castro-ph%2F0309407%2Castro-ph%2F0309576%2Castro-ph%2F0309208%2Castro-ph%2F0309322%2Castro-ph%2F0309774%2Castro-ph%2F0309370%2Castro-ph%2F0309051%2Castro-ph%2F0309317%2Castro-ph%2F0309130%2Castro-ph%2F0309080%2Castro-ph%2F0309766%2Castro-ph%2F0309561%2Castro-ph%2F0309381%2Castro-ph%2F0309159%2Castro-ph%2F0309804%2Castro-ph%2F0309701%2Castro-ph%2F0309786%2Castro-ph%2F0309828%2Castro-ph%2F0309122%2Castro-ph%2F0309764%2Castro-ph%2F0309782%2Castro-ph%2F0309625%2Castro-ph%2F0309514%2Castro-ph%2F0309679%2Castro-ph%2F0309711%2Castro-ph%2F0309793%2Castro-ph%2F0309221%2Castro-ph%2F0309431%2Castro-ph%2F0309788%2Castro-ph%2F0309152%2Castro-ph%2F0309543%2Castro-ph%2F0309151%2Castro-ph%2F0309365%2Castro-ph%2F0309750%2Castro-ph%2F0309618%2Castro-ph%2F0309181%2Castro-ph%2F0309560%2Castro-ph%2F0309107%2Castro-ph%2F0309464%2Castro-ph%2F0309613%2Castro-ph%2F0309142%2Castro-ph%2F0309086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inferring the coronal flaring patterns in AGN from reverberation maps"}, "summary": "The relativistically broadened iron K-alpha line at 6.4 keV observed in the\nSeyfert 1 galaxy MCG-6-30-15 has provided a probe of the strong-gravity\nenvironment near a black hole, in particular suggesting that it is rapidly\nspinning. An important variable in such analyses is the geometry of the\nilluminating source. We present a new technique which constrains this geometry\nbased on the spectral line shape, based on a model of discrete, point-like\nflaring regions in the X-ray corona. We apply it to simulated reverberation\nmaps and give examples of successful reconstructions of complex coronal flaring\npatterns. For time-averaged spectral lines the problem is highly degenerate,\nand so its inversion more challenging. We quantify this degeneracy and give a\nmeasure of the spatial accuracy of the method in this case, before checking\nthat it is consistent with the existing picture of MCG-6-30-15 by applying it\nto recent data from XMM-Newton.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0309759%2Castro-ph%2F0309531%2Castro-ph%2F0309148%2Castro-ph%2F0309508%2Castro-ph%2F0309589%2Castro-ph%2F0309441%2Castro-ph%2F0309675%2Castro-ph%2F0309376%2Castro-ph%2F0309127%2Castro-ph%2F0309659%2Castro-ph%2F0309732%2Castro-ph%2F0309727%2Castro-ph%2F0309046%2Castro-ph%2F0309239%2Castro-ph%2F0309569%2Castro-ph%2F0309598%2Castro-ph%2F0309798%2Castro-ph%2F0309518%2Castro-ph%2F0309283%2Castro-ph%2F0309017%2Castro-ph%2F0309186%2Castro-ph%2F0309048%2Castro-ph%2F0309119%2Castro-ph%2F0309192%2Castro-ph%2F0309144%2Castro-ph%2F0309090%2Castro-ph%2F0309290%2Castro-ph%2F0309624%2Castro-ph%2F0309097%2Castro-ph%2F0309323%2Castro-ph%2F0309416%2Castro-ph%2F0309135%2Castro-ph%2F0309010%2Castro-ph%2F0309628%2Castro-ph%2F0309217%2Castro-ph%2F0309153%2Castro-ph%2F0309047%2Castro-ph%2F0309341%2Castro-ph%2F0309054%2Castro-ph%2F0309311%2Castro-ph%2F0309780%2Castro-ph%2F0309202%2Castro-ph%2F0309661%2Castro-ph%2F0309502%2Castro-ph%2F0309454%2Castro-ph%2F0309401%2Castro-ph%2F0309347%2Castro-ph%2F0309102%2Castro-ph%2F0309031%2Castro-ph%2F0309379%2Castro-ph%2F0309204%2Castro-ph%2F0309318%2Castro-ph%2F0309511%2Castro-ph%2F0309278%2Castro-ph%2F0309072%2Castro-ph%2F0309140%2Castro-ph%2F0309758%2Castro-ph%2F0309536%2Castro-ph%2F0309452%2Castro-ph%2F0309407%2Castro-ph%2F0309576%2Castro-ph%2F0309208%2Castro-ph%2F0309322%2Castro-ph%2F0309774%2Castro-ph%2F0309370%2Castro-ph%2F0309051%2Castro-ph%2F0309317%2Castro-ph%2F0309130%2Castro-ph%2F0309080%2Castro-ph%2F0309766%2Castro-ph%2F0309561%2Castro-ph%2F0309381%2Castro-ph%2F0309159%2Castro-ph%2F0309804%2Castro-ph%2F0309701%2Castro-ph%2F0309786%2Castro-ph%2F0309828%2Castro-ph%2F0309122%2Castro-ph%2F0309764%2Castro-ph%2F0309782%2Castro-ph%2F0309625%2Castro-ph%2F0309514%2Castro-ph%2F0309679%2Castro-ph%2F0309711%2Castro-ph%2F0309793%2Castro-ph%2F0309221%2Castro-ph%2F0309431%2Castro-ph%2F0309788%2Castro-ph%2F0309152%2Castro-ph%2F0309543%2Castro-ph%2F0309151%2Castro-ph%2F0309365%2Castro-ph%2F0309750%2Castro-ph%2F0309618%2Castro-ph%2F0309181%2Castro-ph%2F0309560%2Castro-ph%2F0309107%2Castro-ph%2F0309464%2Castro-ph%2F0309613%2Castro-ph%2F0309142%2Castro-ph%2F0309086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The relativistically broadened iron K-alpha line at 6.4 keV observed in the\nSeyfert 1 galaxy MCG-6-30-15 has provided a probe of the strong-gravity\nenvironment near a black hole, in particular suggesting that it is rapidly\nspinning. An important variable in such analyses is the geometry of the\nilluminating source. We present a new technique which constrains this geometry\nbased on the spectral line shape, based on a model of discrete, point-like\nflaring regions in the X-ray corona. We apply it to simulated reverberation\nmaps and give examples of successful reconstructions of complex coronal flaring\npatterns. For time-averaged spectral lines the problem is highly degenerate,\nand so its inversion more challenging. We quantify this degeneracy and give a\nmeasure of the spatial accuracy of the method in this case, before checking\nthat it is consistent with the existing picture of MCG-6-30-15 by applying it\nto recent data from XMM-Newton."}, "authors": ["R. Goyder", "A. N. Lasenby"], "author_detail": {"name": "A. N. Lasenby"}, "author": "A. N. Lasenby", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2004.08071.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0309518v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0309518v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to MNRAS. A version with higher-resolution figures is\n  available for download at http://www.mrao.cam.ac.uk/~rg200 as are colour\n  versions of some figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0309518v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0309518v2", "journal_reference": "Mon.Not.Roy.Astron.Soc.353:338,2004", "doi": "10.1111/j.1365-2966.2004.08071.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–17 (2002)\n\nPrinted 12 November 2018\n\n(MN LATEX style file v2.2)\n\nInferring the coronal flaring patterns in AGN from\nreverberation maps\n\narXiv:astro-ph/0309518v2 20 Sep 2003\n\nR. Goyder⋆ and A. N. Lasenby\nAstrophysics Group, Cavendish Laboratory, Madingley Road, CB3 0HE\n\n12 November 2018\n\nABSTRACT\n\nThe relativistically broadened iron K-α line at 6.4 keV observed in the Seyfert 1 galaxy\nMCG–6-30-15 has provided a probe of the strong-gravity environment near a black\nhole, in particular suggesting that it is rapidly spinning. An important variable in\nsuch analyses is the geometry of the illuminating source. We present a new technique\nwhich constrains this geometry based on the spectral line shape, based on a model\nof discrete, point-like flaring regions in the X-ray corona. We apply it to simulated\nreverberation maps and give examples of successful reconstructions of complex coronal\nflaring patterns. For time-averaged spectral lines the problem is highly degenerate, and\nso its inversion more challenging. We quantify this degeneracy and give a measure of\nthe spatial accuracy of the method in this case, before checking that it is consistent\nwith the existing picture of MCG–6-30-15 by applying it to recent data from XMMNewton.\nKey words: accretion discs – black hole physics – line: profiles – X-rays: general.\n\n1\n\nINTRODUCTION\n\nThe broad, skewed emission line around 6.4 keV observed in\nthe Seyfert 1 galaxy MCG–6-30-15 was first resolved with\nASCA (Tanaka et al. 1995). A widely accepted model for the\nproduction of this line is one where hard X-rays are reprocessed by the innermost regions of a cold, thin accretion disc\naround a super-massive black hole (George & Fabian 1991;\nMatt et al. 1991). X-ray photons emitted from this material\nsuffer large gravitational redshifts, special relativistic beaming and Doppler shifts, combining to give a characteristic\nshape which is in good agreement with the data. In addition, a number of alternative models were considered by\nFabian et al. (1995), but a convincing rival candidate was\nnot found.\nThe extended red wing of this line (Wilms et al. 2001;\nFabian et al. 2002; Fabian & Vaughan 2003) has provided\nthe first direct observational probes of the strong gravity environment near a black hole and has been used to constrain\nparameters such as the inclination of the accretion disc and\nthe black hole's spin (Iwasawa et al. 1996; Dabrowski et al.\n1997). The geometry of the illuminating source of hard Xrays, or corona, is a critical variable in such calculations, as\nillustrated by the work of Dabrowski et al. (1997), where the\nauthors assumed that the X-ray source was planar, hugging\na disc which extended down to the innermost stable circular orbit in the Kerr metric. Within this framework, they\n\n⋆\n\nE-mail: rg200@mrao.cam.ac.uk\n\nshowed that the line profile obtained during a 4 day ASCA\nobservation of MCG–6-30-15 in 1994 constrained the spin\nparameter of the black hole to be > 0.94 with about 90%\nconfidence.\nThe central regions of an accretion disc are, however,\nlikely to be subject to a large number of magnetohydrodynamical instabilities with the result that a planar geometry for the hard X-ray source is a poor approximation. An\nalternative approach was taken by Reynolds & Begelman\n(1997). They were able to fit the same data by assuming\na Schwarzschild black hole where the X-ray source was a\npoint-like flare located a few gravitational radii above the\nhole on the symmetry axis of the disc. The bulk of the emitted radiation would then come from material on plunge trajectories within the innermost stable orbit radius. Shortly\nafterwards, Young et al. (1998) showed that a geometry of\nthis type predicts a large absorption edge in the spectrum,\ndue to the line emitting matter being highly ionised. As no\nsuch edge has been observed, the data seem to favour the\nKerr model, although tentatively.\nOf particular interest for the future are time-dependent\nscenarios, where a flash of radiation sweeps over the disc producing line emission in different locations and causes the line\nshape to change with time (Reynolds et al. 1999). Future\nX-ray satellites such as Constellation-X offer the possibility\nof observing these time-dependent spectra, or reverberation\nmaps (Young & Reynolds 2000). However, analyses of such\ndata depend on the coronal flaring pattern, and most previous work has concentrated on predicting the spectra which\n\n\f2\n\nR. Goyder and A. N. Lasenby\n\nresult from one or two dominant flaring events in the corona.\nA more likely scenario, however, is one where the line profiles\nin reverberation maps result from an ensemble of overlapping flares, distributed in time as well as space, and so a\ntreatment of more complicated coronal configurations such\nas these is vital. Here we aim to develop a technique for\nacquiring knowledge of this pattern from spectral data, constraining the distribution of flares in the corona based on the\nshape of a spectral line. We consider an ensemble of coronal\nflares of arbitrary number, instead of assuming that a single\nflare dominates the emission.\nIn general, models are commonly fitted to data via the\nχ2 statistic, the best fit parameters corresponding to the\nminimum of a Gaussian distribution. With noisy data this\ncan result in over-fitting where many different parameter\nvalues produce a similarly good fit to the data. In this\ncase some form of regularisation is often applied, such as\nthe Maximum Entropy Method (Gull & Daniell 1978). This\namounts to making some extra basic assumptions about the\nobject one is trying to infer, in order to pick out a preferred\nmodel from a group which are not distinguished by the data\nalone. The exact physics of a magnetically flaring corona is\ncomplicated, and so rather than trying to treat it directly,\nwe can make some progress by making some very general,\nminimal assumptions about its nature.\n\n2\n\nMASSIVE INFERENCE PRIOR\n\nIt is standard practice in scientific data analysis to fit the\nparameters of a model to a dataset using a χ2 minimisation.\nOften, especially at high levels of noise, a unique minimum\nis not clearly preferred by the data and there is ambiguity\nbetween different sets of parameters. We can still progress\nin a such a problem though, by making extra assumptions\nabout the parameters, which are believed to hold independently of the data. These are encoded in a 'prior' probability\ndistribution, which modifies the previous Gaussian distribution to one where a clearly defined minimum exists, and so\na 'best' answer can be found, although it is of course still\ndependent upon the validity of the extra assumptions.\nA well known example of this idea is the 'Maximum Entropy Method' (Gull 1989), which has been used extensively\nin many areas of physics and astronomy, most notably in\nimage processing. Here, the parameters are the fluxes collected in a set of pixels. By assuming that the fluxes are all\npositive and additive 1 , one arrives at the conclusion that\nthe image, in the absence of any data, has a prior probability\ndistribution given by\nPr(h) = exp(−αr S)\nwhere S is the entropy defined as\nS(h) =\n\nN \u0010\nX\n\nhi − mi − hi log\n\ni\n\nGiven the idea that individual X-ray flares provide the\nillumination for the production of the iron line, we attempt\nto infer the parameters of a set of discrete, point-like sources,\nwhich are equally likely to be found at any point over the\ndisc. We assume that the number of these sources is Poisson distributed, so that if the data can be satisfied with a\nlower number of flares then it will. Finally, we assume an exponentially decaying distribution for the strengths of these\nsources, so that stronger flares are not favoured in the reconstruction. This set of assumptions corresponds to a technique known as 'Massive Inference' (Skilling 1998) and is\nquite general. It can be applied to any situation which can\nbe modelled as arising from a number of point source like objects, however abstract their physical interpretation might\nbe.\nIn this paper we begin by introducing the Massive Inference technique and its numerical implementation, in Sections 2 and 4. In Section 3 we then discuss the physical details of our model for the forward problem, that of predicting\nthe iron line shape as a function of the coronal geometry and\nother system parameters. After describing the calculation\nwith which we compute the line profile due to a single flare\nwe proceed to discuss how these lines can be combined to\nyield a transfer function which maps the parameters of interest to a composite line profile, in Section 3.1. We then show\nsome examples of the technique's application to simulated\ndata: to reverberation maps in Section 5 and time-averaged\nspectral lines in Section 6. The transfer function for the latter case is analysed in Section 6.1 before treating data from\nan XMM-Newton observation of MCG–6-30-15 in Section 7.\nFinally, in Section 8 we give our conclusions and discuss the\napplication of our technique to possible future data.\n\n(1)\n\n\u0010\n\nhi\nmi\n\n\u0011\u0011\n\n(2)\n\nand where N is the number of pixels in the image, hi (the ith\nelement of the vector h) is the flux in the ith pixel and the\n{mi } represent our 'best guess' at the answer in the absence\nof any data – often a uniform distribution. αr represents the\nweight we wish to give the Maximum Entropy assumption\nrelative to the data. Maximising the entropy essentially corresponds to imposing the least possible prejudice on the image, and the best image is the one which strikes the optimum\ncompromise between satisfying the data, by minimising the\nχ2 statistic, and maximising the entropy.\nIn this work, instead of using a maximum entropy prior,\nwe instead follow the 'Massive Inference' route, which can\nbe expected to be particularly appropriate to the case of a\nsmall number of point-like sources. To provide a rigorous\nframework in which we can combine our prior assumptions\nwith line profile data, we use a precise statement of conditional probability – Bayes Theorem. According to Bayes\nTheorem, a hypothesis h given some data D has a posterior probability distribution Pr(h|D) given by the product\nof the likelihood Pr(D|h) and the prior Pr(h) normalised by\nthe evidence Pr(D)\nPr(h|D) =\n\nPr(h) Pr(D|h)\n.\nPr(D)\n\n(3)\n\nWe assume Gaussian random errors, so that the likelihood\ntakes the form\nPr(D|h)\n\n1\n\n∝\n\n2\n\ne−χ\n\n/2\n\n(4)\n\nFluxes are necessarily positive, and 'additive' means that the\nflux received across two non–overlapping patches is the sum of\nthe individual fluxes.\n\n\fInferring the coronal flaring patterns in AGN\nχ2\n\n=\n\nM\nX\ni\n\n[D − R(h)]i Hii [D − R(h)]i ,\n\n(5)\n\nwhere M is the number of data points in the vector D and\nthe covariance matrix H is diagonal because the errors are\nindependent. In this work, the hypothesis h is comprised\nof the number, strengths and locations of a group of X-ray\nflares, and the data D are the iron line X-ray fluxes received\nin each energy bin around 6.4 keV. R is the transfer function\nwhich provides a map from the parameter space to the data,\nso that R(h) are the (noiseless) 'mock data' corresponding\nto a set of parameters h. The prior probability Pr[h(N, x, z)]\nconsists of the product of three separate priors for each of\nN (the number of flares), x (an N element vector of flare\npositions) and z (an N element vector of flare strengths). N\nis assigned either a Poisson distribution\nPr(N ) =\n\ne−α αN\nN!\n\nhN i = α ±\n\n√\n\nα\n\nwith mean α, or a wider, geometric distribution\nα\nPr(N ) = (1 − r)r N , r =\n1+α\nhN i\n\n=\n\nα±\n\np\n\nα(1 + α)\n\n(6)\n\n(7)\n(8)\n\ndepending on how accurately the mean number of flares α\ncan be estimated (Skilling 1999). In practice we always use\nthe latter, with an additional, exponentially decaying prior\non α itself. The flare positions are assigned a prior which\nis constant over the allowed locations (in practice covering\nthe central regions of the accretion disk) and zero otherwise.\nTheir strengths an exponentially decaying distribution\nPr(z) =\n\nN\nY\ne−zi /qi\n\n(9)\n\nqi\n\ni\n\nwhere the decay constants qi are chosen internally based\non the overall scale of the data, and so do not feature in\nthe analysis. This form avoids extremely strong flares being\nfavoured in the posterior.\nThe full posterior probability distribution can then be\nwritten\nPr(h|D)\n\nχ2\n\n∝\n=\n\nN\ne−α αN Y e−zi /qi −χ2 /2\ne\nN!\nqi\n\n(10)\n\ni\n\nM\nX\ni\n\n[D − R(h)]i Hii [D − R(h)]i\n\n(11)\n\nFinding the value of h which maximises this distribution will give the 'best' set of parameters for a given dataset.\nThis, however, is only a fraction of the total amount of information contained in the answer. In this work we gain a\nknowledge of the full posterior distribution by sampling with\na simulated annealing algorithm (Skilling 1999) described in\nmore detail in Section 4. We can then calculate any moment\nof the distribution, such as the mean and standard deviation, rather than just finding the best-fitting model.\nAs mentioned above, this form of posterior is quite general – in this paper, the 'locations' of the sources are the\nspacetime coordinates of coronal flaring events, but this need\nnot be the case. The physical interpretation of the parameter space is entirely determined by the form of the transfer\n\n3\n\nfunction R which provides a map from h to the data (without noise)\nR : h 7→ D.\n\n(12)\n\nIn Section 3 we consider the detailed physics which is included in this object, although the end result of the calculation is simply a linear mapping from the three objects\ncontained in h (ie N , x and z) to the data D.\n\n3\n\nLINE PROFILE CALCULATION\n\nThe 'forward problem' which we attempt to invert in this\npaper is that of predicting the shape of the iron Kα spectral\nline at 6.4 keV. We perform explicit ray-tracing in Kerr gravity which accounts for all relativistic beaming and Doppler\nshifting effects, using the geodesic equations given in the\nappendix.\nWe adopt a 'lamp-post' geometry, where a point source\norbits above an optically thick, geometrically thin accretion disc, consisting of particles on circular, time-like prograde geodesics in the equatorial plane. Its coordinates are\nts , ρs , φs , hs in a cylindrical polar system, where ts and\nφs are Boyer-Lindquist coordinates and ρs and hs are related to the Boyer-Lindquist coordinates via rs2 = ρ2s + h2s ,\ntan θs = hs /ρs . Except where explicitly stated otherwise,\nthe 'radius' of the source refers to its value of ρs , the distance from the rotation axis of the black hole. As the source\nis located above the plane, it is not in free-fall, rather, it\nremains above the same point on the disc throughout its\nmotion. The precise details of its trajectory are also given\nin the appendix. The disc material orbits with a period given\nby\na\nT = 2 +\nc\n\nr\n\n\u0001 GM\nr3\n= ã + r̃ 3/2\nGM\nc3\n\n(13)\n\nwhere, in the first part of this equation we use conventional\n(S.I.) units (where GM/rc2 is dimensionless), and in the\nsecond part, r̃ is measured in units of rg = GM/c2 and\nã in units of GM/c. The disc's inner radius is chosen to\nbe that of the marginally stable orbit and the disc extends\noutward to 100 rg . We set the black hole's angular momentum parameter a to 0.998 so that the accretion disc allows\nemission within 6 rg (Tanaka et al. 1995; Wilms et al. 2001;\nFabian et al. 2002; Fabian & Vaughan 2003). In all the plots\nin this paper, the disc rotates in an anti-clockwise sense.\nWe assume the source emits isotropically in its rest\nframe a power-law spectrum with a specific luminosity ∝\nν −α erg s−1 Hz−1 . In practice we enforce this by choosing\nthe initial directions of the emitted photons such that they\neach pass through the centre of one pixel of a HEALPix2\nsphere. We can then compute the incident flux at any point\non the disc, as measured in the rest frame of the disc matter\n(Lu & Yu 2001; Martocchia et al. 2000), to be\nFin =\n\n2\n\nνd−α\n(1 + zsd )1+α\n\nHierarchical Equal Area isoLatitude\nhttp://www.eso.org/science/healpix.\n\n(14)\n\nPixellisation,\n\nsee\n\n\f4\n\nR. Goyder and A. N. Lasenby\n\nwhere zsd is the redshift suffered by a photon arriving at\nthat point and νd is the frequency as measured by an observer co-moving with the disc. To find the flux that leaves\nthe disc, we use the following semi-analytical approximation for the effect of the photons' incident energy and angle on the number emitted as iron Kα line radiation, which\nare derived from the Monte Carlo simulations of the detailed atomic physics occurring in a cold, non-ionised disc\n(George & Fabian 1991):\nNout = g(θi )\n\nZ\n\nνm\n\nNin (ν)f (ν)dν\n\n(15)\n\nνt\n\nwhere\n\n\u0010 ν − 1.8 \u0011\n\nf (ν)\n\n=\n\n7.4 × 10−2 + 2.5 exp −\n\ng(θi )\n\n=\n\n6.5 − 5.6 cos θi + 2.2 cos2 θi\n\n5.7\n\n(16)\n(17)\n\nand where ν is measured in keV and νt is the threshold\nfor triggering fluorescent emission. Above νm = 30 keV this\napproximation breaks down, but there is a negligible contribution from this region to the total flux. We obtain the\nfollowing expression for the flux of iron Kα line photons\nleaving the disc\nFout ∝ δνα νd g(θi )\n\n1\n(1 + zsd )1+α\n\nZ\n\nνm\n−(1+α)\n\nf (νd )νd\n\ndνd (18)\n\nνt\n\nWe assume that the iron line radiation leaves the disc\nisotropically and is collected in a grid of 20002 equal area\npixels (modelling those of a CCD detector) in an asymptotically flat region of spacetime (in practice 1000 rg ), at a\nlocation inclined at 30◦ to the disc, in keeping with appropriate parameters for MCG–6-30-15. To calculate the change\nin intensity Iν of radiation on its journey from the disc to\nthe observer we use the Liouville invariant (e.g. Misner et\nal. 1973)\nIν\n= constant,\n(19)\nν3\nwhere the change in frequency is computed for each pixel in\nthe detector by integrating photon trajectories backwards in\ntime until they hit the disc or are lost into the black hole\n(Laor 1991; Dabrowski et al. 1997). The power collected in\none pixel in the finite frequency range ∆ν is then\nW∆ν ∝\n\n1\nFout (r, φ)\n(1 + zdo )4\n\n(20)\n\nwhere we have made the position dependence of the emissivity over the disc explicit and assumed isotropic emission\nfrom the disc. We integrate over the entire solid angle subtended by the disc at the observer by summing the contribution from each pixel. The contribution to the total flux of\neach photon is then binned in both energy and arrival time,\nto build up a time-dependent spectrum.\n3.1\n\nTransfer functions\n\nBy following the procedure outlined in the previous section,\nwe can generate the time-dependent spectrum produced by\na single flaring event at a given location in spacetime. We\ncan now obtain the transfer function R which maps the coordinates of an arbitrary number of flaring events to the\ndata D. If the corona itself is optically thin (so that it has\n\na negligible effect on the iron line emission), then we can\nsimply superpose the spectrum coming from each individual flare, accounting for the time delays due to both the\ndifferent source positions and the different time at which\neach flare becomes active. In this way, the transfer function\nbecomes linear, although this is not a requirement for the\ninversion algorithm to work.\nIn this work we concentrate on the radial and azimuthal\nlocations of the sources rather than their heights. Rather, we\nfix the height at a value which corresponds to a characteristic\nscale height of the corona which in practice is set to 2 or\n5 rg , although it would be simple to extend these models to\ninclude the heights of the flares as well. The time lag arising\nfrom a difference in the ts coordinate of the source is handled\ntrivially by simply shifting the total spectrum obtained from\na single flare along the time axis by an appropriate amount.\nThe delays coming from different values of ρs and φs are\nhandled by finding the earliest time at which photons from\na particular source arrive at the observer for each source\nposition. The entire spectrum is then shifted by this amount\nin the full transfer function. Figure 1(a) shows the resulting\nspectrum when the transfer function acts on a set of four\nflares, the coordinates of which are given in the caption.\nThese spectra show the same qualitative features as those\nin the work of Reynolds et al. (1999), who gave the first\nexamples of such time-dependent spectra.\nWhile the aim of this paper is to present an inversion method for reverberation maps, data of this nature\nis not yet available. Rather, the best example of a broad\niron line to date, seen in MCG–6-30-15, requires integration\ntimes so long that only basic variability analyses are viable\n(Iwasawa et al. 1999; Vaughan & Edelson 2001; Shih et al.\n2002). In this case to get a mean error of ∼ 15%, observations of hundreds of kiloseconds have been necessary\n(Fabian et al. 2002). A recent estimate of the mass of MCG–\n6-30-15 gives an upper limit of ∼ 107 M⊙ (Morales & Fabian\n2002), corresponding to a characteristic time-scale (GM/c3 )\nof 49 seconds. For radii in the range ∼ 2 − 15, Equation 13 implies orbit time-scales of less than one hour, which\nmeans that observations made with current telescopes such\nas XMM-Newton and Chandra span many orbital periods.\nThis clearly calls for a modification of the technique as\nstated above, which we can accomplish by integrating over\nboth ts and φs to yield a time-averaged spectrum for each\nradius of a flare, modelled as the ring it sweeps out over\ntime, assuming it persists for an entire orbit. In practice, we\ncan average the emissivity Fout (r, φ) over φ to obtain an axisymmetric profile and use a single time bin extending over\nthe full duration of flux detection. In this case we can plot\nthe entire transfer function, as shown in Figure 1(b).\nIn reality, of course, we do not expect a perfectly axisymmetric system, due to the turbulent and non-linear nature of the disc and corona. To begin to probe these effects\none can imagine an intermediate scenario, where a timeaveraged spectrum is obtained over an interval much shorter\nthan the orbit time for a flare, or one where flaring events\noccur in 'flashes' which persist for times much less than the\norbital period. In this case, we lose all the temporal information in the system but we can retain the azimuthal positions\nof the sources. The transfer function then consists of a timeaveraged spectrum for each value of the pair ρs , φs taken\nby a flare. In Figure 1(c) we show spectra for a source at a\n\n\fInferring the coronal flaring patterns in AGN\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n5\n\nFigure 1.\n(a) Time-dependent spectrum produced by four flares: three simultaneous events at (ρs , φs )\n=\n(19 rg , 0◦ ), (10 rg , 100◦ ), (19 rg , 240◦ ) followed by a repeat of the latter flare 4 tg (= GM/c3 ) afterwards. (b) The full '1-d' transfer function for time-averaged line profiles, generated from azimuthally averaged emissivity distributions corresponding to the\nring-shaped flares swept out by orbiting flares. (c) Time-averaged spectra for a flare at ρs = 1.5 rg for each of the 36 azimuthal bins in\nthe '2-d' transfer function. (d) Same as (c) but for ρs = 10rg .\n\nsmall radius ρs = 2, for all values of φ. Figure 1(d) shows the\nequivalent plot for a larger value of ρs . Averaging the spectra from these graphs over φs would produce cross-sections\nof Figure 1(b) at the corresponding radii.\n\n✻\n❄\n\n2. Act with R\n\nR\n\ncompare\n\n4. Obtain inference (h)\n\n4\n\n✲\n\n1. Choose h̃\n\n+ noise\nMass. Inf.\n\n✛\n\n❄\n3. Add noise\n\nCOMPUTATIONAL METHOD\n\nThe eventual goal of this work is to construct a framework\nfor determining patterns of coronal flaring activity from iron\nKα line spectra. We can assess the validity of conclusions\ndrawn within this framework by testing the technique with\ndata generated from a known distribution of flares. We operate on this distribution (known as the 'truth')\u0001 with the\ntransfer function R to yield the 'mock data' R h̃ . To complete the process we add a known amount \u0001of Gaussian noise\nσ, to obtain the simulated data D = R h̃ + σ.\nGiven these simulated data we can construct an inference h via the Massive Inference method, which can then\n\nFigure 2. A schematic representation of the process by which\nwe test the technique\n\nbe compared with the truth h̃. A graphical summary of this\nprocess is shown in Figure 2.\nSampling of the posterior is achieved with a Markov\nChain Monte Carlo algorithm, using a simulated annealing\ncooling schedule. Each consecutive sample is chosen according to a 'temperature' parameter, which is increasingly restrictive in terms of the changes it allows as the system cools.\n\n\f6\n\nR. Goyder and A. N. Lasenby\n\n14\n15\n\n12\n\n2\n\nradius (GM/c )\n\nχ2 per degree of freedom\n\n10\n\n10\n\n10\n\n5\n\n10\n\n10\n8\n6\n4\n\n0\n\n2\n\n10\n\n0\n\n200\n\n400\n600\nCooling progress\n\n800\n\n1000\n\n(a)\n\n2\n\n4\n\n6\n8\n10\n2\nradius (GM/c )\n\n12\n\n14\n\n(b)\n\nFigure 3. (a) The χ2 statistic (per degree of freedom) for simulated data compared with the mock data produced by operating with\nthe transfer function on the mean of the sampled posterior. As the algorithm progresses, it can be seen to converge toward the true\nposterior, arriving at a χ2 of 48.8/50. (b) A snapshot of some of the final samples. The true posterior is shown as the contour plot and\nthe small circles represent the samples, showing that they are concentrated in regions of maximum posterior probability. The diagonal\nreflection symmetry is due to the flares being indistinguishable.\n\nThe samples are initially spread over a large region of parameter space, but as the temperature drops, they become\nmore concentrated around regions of high posterior probability. The algorithm can store an ensemble of several flare\nconfigurations, each evolving independently, and the system\nis cooled as slowly as computation time allows. In this way,\nwe maximise the number of samples taken and minimise the\nchance that the samples are trapped within local minima.\nThere is no formal convergence test for the Massive Inference method. Rather, one can vary both the rate at which\nthe algorithm anneals and the size of the ensemble of simultaneously evolving parameter sets, and check that they all\nconverge to a single distribution. A representation of convergence for a simple example involving only two flares is\nshown in Figure 3. The flares are located at radii of 5 and\n13 rg . Figure 3(a) shows the misfit between the mock and\nsimulated data as the algorithm progresses from its initial,\nhot state to the final cool state. The decrease in temperature is visible as the tapering of the curve's overall envelope\nof variation, while the convergence is reflected in the approach of χ2 (per degree of freedom) toward the final value\nof 48.8/50. In Figure 3(b) we plot a projection of the sampled posterior into a plane showing the radial coordinate of\neach flare, together with a contour plot of the true posterior,\nshowing that the samples are indeed concentrated around its\npeak.\n\n5\n\nTIME-DEPENDENT INVERSIONS\n\nWe now present some examples of the application of our\ntechnique to simulated reverberation maps, obtained by\nadding noise to spectra such as that shown in Figure 1(a).\nWe quote noise levels as mean signal-to-noise ratios (SNR),\nthe ratio of the noise to the average over all pixels in which\nthe flux is non-zero. For a particular example of simulated\n\ndata with a mean SNR of 1, which we take as our starting\npoint for illustrating the technique, the inferred number of\nflares is given in Figure 4(d), where a strong peak is visible\nat the true number of 7. The locations of the flare ensemble above the accretion disc (their ρs , φs coordinates) are\nshown in Figure 4(a), where each sample of the posterior is\nplotted as a set of N grey circles, where N is the number\nof flares corresponding to that particular sample. In reality,\nthe inner 20 rg of the disc are covered by a 20 radii × 18 azimuths polar grid of flare positions, but to help visualise the\nresults, we have displaced each grey circle in a random direction from the centre of its grid cell by a radius obtained by\nsampling from a Gaussian distribution with a standard deviation equal to the radius of the thicker, black circles, whose\ncentres mark the location of each flare in the true configuration. The radius of each grey circle is proportional to the\nstrength of the flare for that sample and is normalised such\nthat the strongest flare's radius matches that of the thicker\ncircles marking the truth.\nIn addition, we plot two circles centred on the origin,\nwhich mark the inner radius of the accretion disc and the\nradius ρs = 20 rg which corresponds to the outer limit of\nthe polar grid, but not the accretion disc itself (rmax =\n100 rg ). The samples are clustered around the true positions\nin all cases but one, showing that the system copes well with\na problem of this complexity, at this level of noise in the\ndata. Figure 4(b) shows the inferred distribution of times at\nwhich each flaring event occurred, as a projection onto the\nt-x plane (the observer is located above the negative y axis,\nnearest the bottom of the plot). For the flare closest to the\nblack hole whose x-y position was least accurately inferred,\nthe samples' time coordinates are centred around the true\nvalue of 6 tg . It is very difficult to pick out 7 distinct spectra\nby eye in the simulated data shown in Figure 4(c), and yet\n\n\fInferring the coronal flaring patterns in AGN\n\n7\n\n20\n15\n20\n\nDistance (GM/c2)\n\n10\n\n15\n3\n\nTime (GM/c )\n\n5\n0\n\n10\n\n−5\n\n5\n\n−10\n\n0\n−20\n\n−15\n\n−10\n\n−15\n\n−5\n\n0\n5\nDistance (GM/c2)\n\n10\n\n15\n\n20\n\n(b)\n\n−20\n−20\n\n−15\n\n−10\n\n−5\n0\n5\nDistance (GM/c2)\n\n10\n\n15\n\n20\n\n(a)\n\n250\n\n7\n0.9\n6.5\n0.8\n\n200\n\n6\n0.7\n\nEnergy (keV)\n\n0.6\n5\n\n0.5\n\n4.5\n\n0.4\n\n4\n\n0.3\n\n3.5\n\n0.2\n\n3\n\n0.1\n\n2.5\n2\n0\n\nNumber of Samples\n\n5.5\n\n150\n\n100\n\n50\n\n0\n\n5\n\n10\n\n15\nTime (GM/c3)\n\n20\n\n25\n\n30\n\n−0.1\n\n(c)\n\n0\n5\n\n6\n\n7\n8\nNumber of Flares\n\n9\n\n10\n\n(d)\n\nFigure 4. (a) Samples from the posterior probability distribution for a configuration of 7 flares, projected into the equatorial plane.\nOnly 6 flares are visible because two are located above the same point in the disc, but are separated in time. The largest circle marks\nthe edge of the polar grid of allowed positions, not the edge of the accretion disc. (b) The same samples, but now projected into the\nt-x plane. The observer is located above the negative y axis, nearest the bottom of (a). (c) The simulated noisy data from which the\ninference was made, with a mean SNR = 1. (d) A histogram showing the inferred number of flares, N .\n\nthe algorithm is able to do so, and give the locations of the\nflares with a good degree of accuracy.\nWe show two more examples in Figures 5 and 6, one for\na configuration of 11 flares and a mean SNR = 2, and one\nfor poorer quality data (SNR = 0.5) with fewer flares in the\ntruth. Figure 5(a) shows a 3-d representation of the locations\nin spacetime of the true and inferred distributions of flaring\nevents. The vertical axis measures time, not the height of\nthe flares, which is fixed at 5 rg . The light grey samples on\nthe disc and at the side of the plot correspond to the x-y\nand t-x projections like those shown in Figures 4(a) and 4(b)\nfor the case of seven flares. The truth is plotted here as a\n\nset of wire-frame cubes with a side length equal to twice the\nstandard deviation of the Gaussian distribution from which\nthe amount of radial displacement of each dark grey sample\nwas taken.\nThe noisy data and a histogram of the inferred number\nof flares are shown in Figures 5(b) and 5(c). It is clear that\nat least 11 flares were chosen each time in order to fit the\ndata and higher numbers become increasingly unlikely, reflecting the prior probability distribution on N . Information\nfrom Figures 5(a) and 5(c) can be combined by plotting the\nlatter in colour. Instead of grey circles, we can use a different\ncolour for each value of N in the histogram. We avoid cer-\n\n\f8\n\nR. Goyder and A. N. Lasenby\n\n(a)\n\n7\n\n250\n0.9\n\n6.5\n\n0.8\n6\n\n200\n0.7\n\nEnergy (keV)\n\n0.6\n5\n0.5\n4.5\n0.4\n4\n0.3\n\nNumber of Samples\n\n5.5\n150\n\n100\n\n3.5\n0.2\n3\n\n0.1\n\n2.5\n2\n0\n\n50\n\n0\n5\n\n10\n\n15\nTime (GM/c3)\n\n20\n\n25\n\n30\n\n(b)\n\n0\n10\n\n11\n\n12\n\n13\nNumber of Flares\n\n14\n\n15\n\n16\n\n(c)\n\nFigure 5. (a) Samples from a posterior distribution corresponding to a truth consisting of 11 flares, shown as wire-frame cubes. The\ntime at which each flare became active is plotted along the vertical axis. The height of each flare is fixed at hs = 5 rg . The lighter circles\nplotted on the equatorial plane and the vertical plane at the back of the plot correspond to the two projections of Figures 4(a) and 4(b)\nfor the case of 7 flares. (b) Simulated reverberation map from which this inference was made, at a mean SNR = 2. (c) A histogram\nshowing the distribution of values of N , the number of flares, chosen by the algorithm during sampling.\n\ntain colours being obscured by others plotted over the top by\nrandomising the order in which they are drawn, thus giving\na visual impression of the histogram, which can be useful in\nrevealing spatial bias of different values of N . Colour versions of all relevant plots in this paper are available online3 .\nFigure 6 shows an inversion performed for data at a higher\nnoise level (mean SNR = 0.5). In both 3-d plots, the thick\n\n3\n\nhttp://www.mrao.cam.ac.uk/∼rg200\n\narrow drawn in the plane of the disc is directed towards the\nobserver.\nAs the level of noise is increased, the quality of the inferences decreases – flares begin to be missed or show up in\nincorrect places. Rather than perform a detailed analysis of\nthe limits of performance of the above time-dependent setup,\nwe now consider those of time-averaged spectra, where we\nfocus on just the ρs and φs coordinates of the flares. The\nreason for this two-fold. Firstly, the behaviour of the system\nfor demanding noise levels in time-averaged data is a sce-\n\n\fInferring the coronal flaring patterns in AGN\n\n9\n\n7\n0.9\n\n20\n\n6.5\n6\n\n10\n\n5.5\n\n5\n\n5\n\n0.5\n\n4.5\n\n0.4\n\n0.7\n\nEnergy (keV)\n\nTime (GM/c3)\n\n0.8\n15\n\n0\n\n−15\n−10\n\n0.6\n\n0.3\n\n4\n\n0.2\n3.5\n0.1\n\n−5\n\n3\n\n0\n\n0\n\n5\n10\n15\n20\n\n−15\n\n−10\n\n−5\n\n0\n\n5\n\n10\n\n15\n\n2.5\n\n−0.1\n\n2\n0\n\nDistance (GM/c2)\n\n5\n\n10\n\n15\nTime (GM/c3)\n\n20\n\n25\n\n30\n\n(b)\n\n(a)\n\nFigure 6. (a) Samples from the posterior distribution for a truth with 3 flares, made at a higher level of noise (mean SNR = 0.5) in the\nsimulated data, shown in (b). For this inference, the histogram for N (not shown) shows a single dominant peak at the correct number\nof 3 flares.\n\nnario more likely to be of interest in the short to medium\nterm, given the quality of current data. Secondly, obtaining\nthe locations of a set of flares in time is a relatively easy\nproblem compared to that of revealing their spatial locations, simply because the structure induced in the data for\na single flare at different times is far more distinctive than\nat different positions. It was described in Section 3.1 that\nthe former is achieved by simply translating the spectrum\nfrom one flare along the time axis in the data-space by an\namount corresponding to its time-delay, whereas the spectral differences that come from changes in spatial location\nare far more subtle. It is therefore clearer to focus on the\ntime-averaged scenarios described in the next section.\n\n6\n\nTIME-AVERAGED INVERSIONS\n\nWe can recast the above system in a form which does not\ndepend on time by summing the spectra over their entire duration, and removing all reference to time from the transfer\nfunction. In this way, we obtain a 2-dimensional problem,\nwhere we aim to recover the ρs and φs coordinates of each\nsource, which take values in the range 1.5 – 15 rg and 0 –\n360◦ over a grid of 40 radii × 36 azimuths. In doing this, we\nhave reduced the number of degrees of freedom (d.o.f.) in\nthe data by almost two orders of magnitude, and as a result\nwe readily find noise levels at which the system struggles to\nproduce correct inferences.\nFigure 7(a) shows the set of samples of the posterior\nprobability distribution for an inference based on the data\nof Figure 7(b). The true distribution contains three flares at\nthe locations shown by the thick black circles in Figure 7(a).\nIn addition to being spread out over many cells of the polar\ngrid of different ρs , φs values, the inference is also clustered\naround a region above the rear, receding part of the disc, in\nwhich there is no flare in the truth. The mock data do provide a satisfactory fit to the simulated data, however, which\n\nimplies that, at this level of noise, we are probing degenerate regions of the transfer function. We note further that the\nsamples of N shown in Figure 7(c) peak very strongly at the\ntrue number of three, so that the extra cluster of samples\nin Figure 7(a) does not imply the presence of a fourth flare,\nrather an additional possibility for the location of one of the\nthree.\n\n6.1\n\nLinear-dependence in the transfer function\n\nWe can quantify the linear-dependence present in the transfer function by performing a singular value decomposition,\nyielding the singular values marked by the squares in Figure 8(a). The gradient of this line determines the decrease\nin noise that is necessary, on average, in order to detect\nthe presence of extra flares as they are added into the true\ndistribution. The 'flare-space' singular vectors (in the space\nof all possible flare configurations) always form a linearlyindependent basis, with which we can represent any flare\npattern. However, their relative magnitudes are given by\nthe singular values, which means that for a given finite noise\nlevel, a certain (large) fraction are effectively zero, removing this ability to span flare-space and represent an arbitrary pattern. Degenerate regions arise when the projection\nof some of a particular flare pattern lies in these zero directions and fails to result in detectable features in the data.\nA useful measure of the overall effect of this is shown\nin Figure 8(b), where we have summed each singular vector,\nweighted by the singular values, and projected the result\nonto the polar grid covering the inner regions of the accretions disc. A grey circle is drawn at the centre of each grid\ncell, whose shading gives the overlap of the average singular\nvector with the cell. The radii of the circles increase linearly\nwith radius to provide a suitable covering of the disc, for\nease of visualisation only. The plot reveals those cells which,\non average, produce the same type of structure in the data\nand which require higher levels of noise to distinguish be-\n\n\f10\n\nR. Goyder and A. N. Lasenby\n\n(a)\n\n3500\n\n1\n\n3000\n\n2500\n\n0.6\n\nNumber of samples\n\nFlux (arbitrary units)\n\n0.8\n\n0.4\n\n0.2\n\n1500\n\n1000\n\n0\n\n1\n\n2000\n\n500\n\n2\n\n3\n\n4\n5\nEnergy (keV)\n\n6\n\n7\n\n8\n\n(b)\n\n0\n1\n\n2\n\n3\n4\nNumber of flares\n\n5\n\n6\n\n(c)\n\nFigure 7. (a) Posterior samples for a distribution of 3 flares, inferred from time-averaged data, hence only an equatorial plane projection\nis available. The true flare positions are marked with thick circles and the large circle at 15 rg marks the outer limit of allowed flare\npositions. (b) The time-averaged spectral line used in this reconstruction, shown as the points with error-bars. The mean signal-to-noise\nratio was 7, corresponding to an average noise level of ∼ 15%. The solid line shows the mock data from the inference. (c) A histogram\nfor the value of N corresponding to each set of samples shown in (a). Although the samples are clustered around four distinct regions,\nthe algorithm rarely picked sets of four flares, instead preferring the correct number of three.\n\ntween them. This explains the patterns seen in the inferred\nflare locations shown in Figure 7(a) as the algorithm explores the contours of Figure 8(b) with approximately equal\nfrequency, in its search to fit the data. This plot also reveals the effective spatial resolution of the technique, as a\nfunction of position on the disc. Two adjacent flares placed\nin cells corresponding to a high gradient in Figure 8(b) will\nbe easier to resolve than two placed in a region where the\ngradient is small.\nAs described in Section 3.1, we can reduce the level of\ncomplexity in the transfer function still further by calculat-\n\ning the time-averaged spectra which arise from axisymmetric\ndistributions of emissivity due to 'ring-shaped' flares, modelling time-averaged point-like flares which persist over an\nentire orbit or more. We generate these axisymmetric emissivity profiles by averaging the illumination pattern due to\na single flare over all values of φs , resulting in a 1-d problem\nwhere we attempt to recover just the radius ρs of the ring.\nPerforming this procedure results in a transfer function\nwhose singular values are given by the circles in Figure 8(a).\nThey drop much more quickly than for the 2-d version, giving a difference of one order of magnitude for just 5 flares.\n\n\fInferring the coronal flaring patterns in AGN\n\n11\n\n0\n\n10\n\nPoint−like flares\nRing−like flares\n\n15\n5\n\n−1\n\n10\n\n10\n4\n5\n\ndistance (GM/c2)\n\n(Dimensionless)\n\n−2\n\n10\n\n−3\n\n10\n\n3\n0\n\n2\n\n−4\n\n−5\n\n−5\n\n−10\n\n10\n\n1\n\n10\n\n0\n\n0\n\n−15\n\n−6\n\n10\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n−15\n\n35\n\n−10\n\n−5\n\n0\n\n5\n\n10\n\n15\n\ndistance (GM/c2)\n\nD.O.F. of transfer function\n\n(b)\n\n(a)\n\n(c)\nFigure 8. (a) Singular values of the time-averaged transfer functions, for the 2-d system (inferring ρs and φs ) shown as squares and the\n1-d system (inferring just ρs ) shown as circles. Losing azimuthal information results in a dramatic reduction in the transfer function's\nlinear independence. (b) The average of the flare-space singular vectors for the 2-d system, showing degenerate regions above the accretion\ndisc, within which a flare produces very similar features in the data. On the approach (left-hand) side of the disc, beaming produces\nsharper structure in the data which leads to smaller degenerate regions and a greater spatial accuracy. (c) Inferred (ring-shaped) flare\nradii and strengths for 3 flares at different levels of noise, plotted as the mean flare strength in each of the 40 radial bins. At SNR = 10,\ntwo flaring regions are revealed, but a further factor 10 reduction in the noise is necessary in order to successfully resolve the 3 flares.\n\nThis trend is reflected in the picture of the 1-d transfer function shown in Figure 1(b), where the line profile shows only\nmodest variation as a function of radius. To illustrate the\ndifficulty in performing inference calculations with this system, we show the results of many such calculations for a\nwide range of noise, in Figure 8(c), where we plot the mean\nstrength of the samples in each radial bin. At high noise levels (SNR ∼ 1) none of the three flares present in the truth\nwas located in the inference. For noise levels comparable to\nthe 2-d calculation of Figure 7, the innermost flare was detected, but it required a further drop of about a factor of 10\nin noise before all three flares could be detected.\n\n7\n\nAPPLICATION TO MCG–6-30-15\n\nWe now apply the technique to the results of a 325 ks observation of MCG–6-30-15 made with XMM-Newton, described\nfully in Fabian et al. (2002). We take the spectral line to\nbe the difference between their Model 4 for the underlying\ncontinuum, and the data. The average noise level is approximately 15%, which corresponds to a mean SNR ∼ 7. Given\nthe results of Figure 8(c), it seems highly doubtful that any\nmeaningful inferences can be made within the 1-d axisymmetric, time-averaged framework at the level of noise. We\nchoose instead to apply the 2-d system, but with the following large caveat. Recent estimates of the mass of MCG–\n6-30-15 give values close to 107 M⊙ giving a characteristic\ntime-scale of 49 seconds, which, as discussed in Section 3.1,\n\n\f12\n\nR. Goyder and A. N. Lasenby\n8\n7\n\nFlux (arbitrary units)\n\n6\n5\n4\n3\n2\n1\n0\n−1\n\n(a)\n\n3\n\n4\n\n5\n6\nEnergy (keV)\n\n7\n\n8\n\n(b)\n\nFigure 9. (a) Inferred distribution of samples for the XMM-Newton data shown as the error-bars in (b). (b) The solid line shows the\nmock data obtained by operating on the inferred flare distribution with the transfer function, together with the data themselves.\n\ncorresponds to an orbital period of less than one hour even\nfor a relatively slow flare, orbiting at ρs = 15 rg .\nIt is clear from these time-scales that we cannot hope\nto attribute structure in the line profile to particular nonaxisymmetric features in the results of any inference calculation, although such results may be useful in giving an\nindication of the general radii at which flares could be active. In addition, we make no attempt in this work to model\nthe form of the underlying continuum spectrum, and so are\ncompletely reliant on such a model to define a given spectral line shape. Models for the continuum, while providing\na good overall fit, still allow considerable variation of the\nslope in the vicinity of the iron line, thus altering the shape.\nDetailed predictions of flaring activity based on the precise\ndetails of this line profile can therefore be easily changed\nwith a different continuum model, and should not be taken\nas clear evidence of a particular flare distribution. This paper is intended to demonstrate the type of calculation which\nwill become possible with the advent of high quality, timedependent spectral data. The application of our techniques\nto this XMM-Newton observation is a check, to make sure\nwe obtain a plausible picture from current data which is\nconsistent with previous studies of this object.\nFigure 9(a) shows the results of applying the 2-d system to these data. The posterior samples are concentrated\nin two regions, and the histogram for the number of flares\n(not shown) has a very strong peak at N = 2. The solid\nline in Figure 9(b) shows the mock data from this inferred\nflare pattern, which provides a good fit with the data below\n∼ 7 keV. The structure above ∼ 7 keV is due to iron Kβ\nemission (Fabian et al. 2002), which we do not include in our\ntransfer function (although it would be simple to do so). For\nthis reason, we ignore the points above 7 keV when calculating the value of χ2 for this fit, which is 0.98 per degree\nof freedom. That the flaring regions are contained within a\nfew gravitational radii of the central black hole, which leads\nto a very steep emissivity profile in this region, is consistent\n\nwith the existing picture of this object based on previous\nstudies.\nWhether the precise azimuthal distribution of flares has\na direct physical significance, given the time-scales involved,\nis doubtful. However, it is important to assess the uniqueness of this prediction – to what extent would the result\nchange with a different realisation of the noise in the data?\nTo address this issue, we can perform a further simulation\nbased on the results of Figure 9(a) as follows. By taking\na truth consisting of the mean flare-strength in each grid\ncell, we can generate mock data to which we add an amount\nof noise corresponding to that in the original data in Figure 9(b). We can then perform repeated applications of the\ninversion technique for different random seeds in our noise\ngenerator. Figure 10 shows the results of two such calculations. The thick circles show the 'truth' consisting of the\nresults of Figure 9(a), and the grey circles show the samples\nof the posterior probability. In Figure 10(a) we obtain very\nsimilar results to the original inference, but in Figure 10(b)\nwe see some differences. Again, we can interpret this result\nwithin the singular vectors of Figure 8(b) – the 'erroneous'\nsamples are continuously connected along regions of high\ndegeneracy. For this reason, we should interpret the results\nof Figure 9(a) as indicating the presence of flares anywhere\nwithin the two regions in Figure 10(b). Figure 10(c) shows\nthe noisy data for the two different realisations of noise and\nthe solid and dashed lines are the mock data corresponding to Figures 10(a) and 10(b) respectively. Another way\nof seeing how similar the two different flaring patterns are,\nwhen considered in the context of the singular vectors, is\nto evaluate the components of the two patterns on the singular vector basis. The solid line in Figure 10(d) gives the\nprojection of the 'real' results of Figure 9(a) onto the singular vectors, and the circles and dotted line correspond to\nthose for Figures 10(a) and 10(b) respectively. It is through\nprojections like these that we can assess the true similar-\n\n\fInferring the coronal flaring patterns in AGN\n\n(a)\n\n13\n\n(b)\n\n1\n1\n\nFlux (arbitrary units)\n\n0.8\n\n0.8\n\nsize of error−bars:\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0\n\n0\n3\n\n4\n\n5\n6\nEnergy (keV)\n\n7\n\n8\n\n(c)\n\n−0.2\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\n20\n\n(d)\n\nFigure 10. (a) Samples from the results of applying the 2-d system to noisy data generated from a truth consisting of the results of\nFigure 9(a), using a noise level equivalent to that in the XMM-Newton data. (b) Same as (a) except for a different random seed used to\ngenerate the data. (c) The data themselves. The squares show the data used to obtain (a) and the circles (b), with the error-bars omitted\nfor clarity. The solid line shows the mock data from the results in (a) and the dashed line for (b). (c) The projection of the truth (ie\nthe results of Figure 9(a)) onto the first twenty singular vectors, shown as the solid line. The remaining coefficients are negligible. The\ncircles show a similar projection for the inference in (a) and the dotted line shows the projection of the inference in (b).\n\nity of structure in the data that different patterns of flaring\nactivity can produce.\n\n8\n\nCONCLUSION\n\nWe have presented a new way of analysing line profile\ndata which constrains the number, positions and strengths\nof hard X-ray sources in an accretion disc's corona. The\nmethod makes use of the 'Massive Inference' prior probability distribution which is based on an assumption of discrete,\npoint-like sources.\nBy applying it to simulated noisy reverberation maps,\nwe found that the technique performs well, making the most\nof the rich information content of such data. The algorithm\n\nwas able to disentangle the complicated signatures of combinations of flare events, rather than concentrating on scenarios where it can be assumed that one or two dominant flares\nare responsible for the observed data (Reynolds et al. 1999;\nYoung & Reynolds 2000). Indeed, if there is only a single\nlarge flare present, such a conclusion will be reached by our\nmethod.\nReverberation mapping of relativistic spectral lines is\nstill some way off, and so we modified our system to treat\ntime-averaged spectra at similar levels of noise to those obtained by current instruments such as XMM-Newton and\nChandra. In doing so we lost all the temporal information\nin the transfer function and reduced the problem to that of\ninferring the set of radial and azimuthal coordinates of the\nflares. The relative information loss in the data, however,\n\n\f14\n\nR. Goyder and A. N. Lasenby\n\nwas greater than in the parameter space, and the resulting\ninference problem was more challenging. At realistic levels\nof noise, we found some ambiguity in the inferred spatial locations of the flare, but less in the inferred number present\nin the ensemble. This ambiguity was quantified using a singular value decomposition, which yielded a 'map' of the disc\nshowing the relative ease with which different regions of the\ndisc could be differentiated, and gave a limit on the spatial\nresolution of the technique.\nWe reduced the problem still further, considering data\ncollected on time-scales greater than the orbital period of\neach flare. In this case we averaged the illumination pattern\nof a flare over the azimuthal coordinate φs to obtain a 1-d\ntransfer function based on 'ring-like' sources, and attempted\nto constrain the radii of these rings. This problem proved to\nbe very difficult, requiring very low levels of noise to obtain useful results. This very high level of degeneracy in the\ntransfer function is due to the line profile being affected only\nweakly by the position of the source, the dominant contribution coming from the relativistic effects occurring during\nthe photons' subsequent journey from disc to observer.\nAs a consistency check, we applied the technique to\na recent observation of the iron Kα line in MCG–6-30-15\nmade by XMM-Newton over 325 ks. This long integration\ntime means that, given the mass of the central black hole\nof ∼ 107 M⊙ , it is not possible to resolve any structure in\nthe data due to non-axisymmetric illumination of the disc,\nand that the 1-d ring-based transfer function is most appropriate. However, given the difficulties present in the highly\ndegenerate ring-based system described above, we applied\nthe 2-d time-averaged algorithm to this data, allowing some\nazimuthal structure in the corona. We found two regions of\nflaring activity, one at a radius of ∼ 2 rg on the near side of\nthe disc which is responsible for the bulk of the highly redshifted emission below 5 keV, and one on the approaching\nside at ∼ 6 rg which is more beamed and produces the tall\npeak close to 6.4 keV.\nFurther simulations for different realisations of random\nnoise illustrated explicitly that this result must be interpreted with the singular vector map of Figure 8(b) in mind,\nspreading out the regions occupied by the samples to cover\nthose in Figure 10(b). This approach showed that, within the\nassumptions underlying the method (mainly that different\nlocations of X-ray flares in the strong-gravity region of the\ncentral black hole account for structure in the line profile),\nthe results of Figure 9(a) are quite robust. Physically, however, we should not expect to be able to pick out any particular azimuthal region based on a 325 ks observation. In fact,\nby including a relatively weak, narrow component in the line\nin order to account for the tall peak near 6.4 keV, it is possible to achieve a very good fit with the data based on an\nazimuthally averaged illumination pattern (Miniutti et al.\n2003). In addition, the uncertainty that comes from defining\na spectral line shape relative to a given model for the underlying continuum radiation, means that the above results\n(other than the loose condition that the flares are contained\nwithin ∼ 15 rg ) can be changed very easily by making different assumptions about the continuum. For these reasons, we\ndo not claim that the results of Figure 9(a) are a meaningful\nprediction for MCG–6-30-15, rather, it is reassuring to obtain a pattern contained within a few gravitational radii of\nthe central black hole, and gives an indication of the sort of\n\nresults which may become viable with higher quality data. It\nis with the advent of high-quality, time-dependent spectral\ndata, like that promised by missions such as Constellation-X,\nthat inversion techniques such as those described here offer\nthe possibility of mapping the hard X-ray emission within a\nfew gravitational radii of a black hole.\n\nACKNOWLEDGMENTS\nThe authors are grateful to Andy Fabian for providing the\ndata used in this research. RG is grateful to Steve Gull,\nJohn Skilling and Giovanni Miniutti for some very useful\ndiscussions, and was supported by a PPARC studentship.\n\nREFERENCES\nDabrowski Y., Fabian A. C., Iwasawa K., Lasenby A. N.,\nReynolds C. S., 1997, MNRAS, 288, L11\nFabian A. C., Nandra K., Reynolds C. S., Brandt W. N.,\nOtani C., Tanaka Y., Inoue H., Iwasawa K., 1995, MNRAS, 277, L11\nFabian A. C., Vaughan S., 2003, MNRAS, 340, L28\nFabian A. C., Vaughan S., Nandra K., Iwasawa K., Ballantyne D. R., Lee J. C., De Rosa A., Turner A., Young\nA. J., 2002, MNRAS, 335, L1\nGeorge I. M., Fabian A. C., 1991, MNRAS, 249, 352\nGull S., 1989, Developments in Maximum Entropy data\nanalysis. J.Skilling (ed), Kluwer Academic Publishers,\nDordtrecht\nGull S. F., Daniell G. J., 1978, Nature, 272, 686\nHestenes D., 1966, Space-Time Algebra. Gordon and\nBreach, New York\nHestenes D., Sobczyk G., 1984, Clifford Algebra to Geometric Calculus. Reidel, Dordrecht\nIwasawa K., Fabian A. C., Reynolds C. S., Nandra K.,\nOtani C., Inoue H., Hayashida K., Brandt W. N., Dotani\nT., Kunieda H., Matsuoka M., Tanaka Y., 1996, MNRAS,\n282, 1038\nIwasawa K., Fabian A. C., Young A. J., Inoue H., Matsumoto C., 1999, MNRAS, 306, L19\nLaor A., 1991, ApJ, 376, 90\nLasenby A., Doran C., Gull S., 1998, Phil. Trans. R. Soc.\nLond. A, 356, 487\nLu Y., Yu Q., 2001, ApJ, 561, 660\nMartocchia A., Karas V., Matt G., 2000, MNRAS, 312, 817\nMatt G., Perola G. C., Piro L., 1991, A&A, 247, 25\nMiniutti G., Fabian A. C., Goyder R., Lasenby A. N., 2003,\nMNRAS, 344, L22\nMorales R., Fabian A. C., 2002, MNRAS, 329, 209\nReynolds C. S., Begelman M. C., 1997, ApJ, 488, 109\nReynolds C. S., Young A. J., Begelman M. C., Fabian A. C.,\n1999, ApJ, 514, 164\nShih D. C., Iwasawa K., Fabian A. C., 2002, MNRAS, 333,\n687\nSkilling J., 1998, Massive Inference and Maximum Entropy.\nMaximum Entropy and Bayesian Methods, Kluwer Academic Publishers, Dordtrecht\nSkilling J., 1999, MassInf Programmers' Notes,\nhttp://www.maxent.co.uk\n\n\fInferring the coronal flaring patterns in AGN\nTanaka Y., Nandra K., Fabian A. C., Inoue H., Otani C.,\nDotani T., Hayashida K., Iwasawa K., Kii T., Kunieda H.,\nMakino F., Matsuoka M., 1995, Nature, 375, 659\nVaughan S., Edelson R., 2001, ApJ, 548, 694\nWilms J., Reynolds C. S., Begelman M. C., Reeves J.,\nMolendi S., Staubert R., Kendziorra E., 2001, MNRAS,\n328, L27\nYoung A. J., Reynolds C. S., 2000, ApJ, 529, 101\nYoung A. J., Ross R. R., Fabian A. C., 1998, MNRAS, 300,\nL11\n\n15\n\n\f16\n\nR. Goyder and A. N. Lasenby\n\nAPPENDIX A: GEODESIC MOTION\nThe gravitational calculations in this paper were performed using geometric algebra, within a new formulation of gravity\ntheory recently developed by Lasenby et al. (1998). In this appendix we translate some of the results of these calculations\ninto conventional notation, but mention only in passing the motivation for casting the problem in this form. For a detailed\naccount of the tools and ideas which lead to these results, see Lasenby et al. (1998), Hestenes (1966) and Hestenes & Sobczyk\n(1984).\nWe begin with an orthonormal tetrad with components on the Boyer-Lindquist coordinate frame given by\n√\n1\na sin θ\n1\n∆\nr 2 + a2\na\nθ̂ = ∂θ\n∂r\nφ̂ =\n∂t +\n∂φ\n(A1)\nt̂ = √\n∂t + √ ∂φ\nr̂ =\nρ\nρ\nρ\nρ\nsin\nθ\nρ ∆\nρ ∆\nwhere\nρ2 = r 2 + a2 cos2 θ,\n\n∆ = r 2 + a2 − 2r.\n\n(A2)\n\nWe can then parametrise a photon's momentum with the direction-cosines α and β and the energy parameter Φ as follows\n\n\u0001\n\np = Φ t̂ + cos α cos β r̂ − sin α cos β θ̂ + sin β φ̂ .\n\n(A3)\n\nThis form is based on the (principal) null vector t̂ + r̂, on which we perform two orthogonal rotations by the angles α and β. In\nthis way, the vanishing norm of the vector is built into its parametrisation, removing a degree of freedom from the calculation\nfrom the outset. In addition, we obtain a simple picture of the momentum vector in terms of rotors (see e.g. Lasenby et al.\n(1998)). This form of p yields the following first derivatives of the coordinates xμ :\n\u0012\n\u0013\n√\n√\n\u0001\nΦ\nΦ\nΦ\na\nsin β\nΦ ∆\n√ +\nṫ = √\ncos α cos β\nθ̇ = − sin α cos β\nφ̇ =\n(A4)\na sin θ sin β ∆ + r 2 + a2\nṙ =\nρ\nρ\nρ\nsin θ\nρ ∆\n∆\nSubstituting p into the geodesic equation results in the following expressions for Φ̇, α̇ and β̇:\nΦ̇\n\nα̇\n\n\"\n\n=\n\n−Φ2 cos β 2\na sin 2θ sin α +\n2ρ3\n\n=\n\nΦ\nρ3 cos β\n\n\"\n\n\u0012\n\nsin α\n\n1\n√\n\n2\n\n2r ∆\n\nβ̇\n\n=\n\n\"\n\n\u0013\n\n2\n\n2\n\n2\n\n2\n\n\u0001\n\n∆(ρ − 4r ) + ρ (r − a ) − 2ra sin θ sin β\n\n\u0012\n\n√\n\n\u0001\nsin β\n− cos θ cos α sin β 2a ∆ +\n2(r 2 + a2 ) − ρ2\nsin θ\n\nΦ\ncos θ sin α\nρ3\n\nr 2 + a2 + a2 sin2 θ\n2a ∆ +\nsin β\nsin θ\n\n\u0001\n\n√\n\n− cos α sin β\n\n#\n\n\u0001\nρ2 (r 2 − a2 ) √\n√\n−4ra sin θ sin β +\ncos α\n+ ∆ ρ2 − 2r 2\nr ∆\n\n\u0012\n\n\u0013\n\n\u0013#\n\n(A6)\n\n!\n\nr ∆ + a2 sin2 θ − m r 2 − a2 cos2 θ\n√\n∆\n\n\u0001\n\n(A5)\n\n\u0001!\n\n+ 2ra sin θ sin β\n\n#\n\n(A7)\n\nThese equations complete a first order set of 7 equations for the coordinates {t, r, θ, φ} and the parameters Φ, α and β, which\nis sufficient to determine photon's trajectory and is numerically very stable. A further advantage of this approach is that we\nhave not yet made any use of the three conserved Killing quantities; the energy E, angular momentum J and Carter constant\nQ. In terms of spacetime position and our three photon momentum parameters, they are given by\n\u0001\u0001\n\u0001\nΦ √\nΦ √\nE = ( ∆ + a sin θ sin β)\nJ=\n∆a sin2 θ + sin θ sin β r 2 + a2\nQ = Φ2 ρ2 1 − cos2 α cos2 β .\n(A8)\nρ\nρ\nBy evaluating these quantities explicitly at various points along a photon trajectory we can test that the integration is\nproceeding correctly.\nWe apply the same basic idea to calculate the circular, timelike trajectories in the equatorial plane which model the flow\nof accreting matter, except now we can use a single parameter U , as follows:\nv = cosh U t̂ + sinh U φ̂\n\n(A9)\n\nwhere the geodesic equations are satisfied by\n√\nr−a\n.\ntanh U = √\n∆\n\n(A10)\n\nMore commonly, these trajectories are written as\nv ∝ ∂t + Ω ∂φ ,\n\nΩ=\n\n1\na + r 3/2\n\n(A11)\n\n\fInferring the coronal flaring patterns in AGN\nand the constant of proportionality is obtained by imposing the condition v 2 = 1. The two notations are related via\n√\na + tanh U ∆\n√ .\nΩ=\nr 2 + a2 + tanh U a ∆\n\n17\n\n(A12)\n\nIn order to model the motion of a source orbiting with the disk matter, but at a general height hs = r sin θ above the equatorial\nplane, we can define a trajectory (no longer geodesic) as follows\nvs ∝ ∂t + Ω ∂φ ,\n\nΩ=\n\n1\n,\na + (r sin θ)3/2\n\n(A13)\n\neffectively lifting a circular geodesic vertically out of the equatorial plane. The expression for U given by Equation (A10)\ngeneralises to\ntanh U =\n\nr 2 − a(r sin θ)3/2 sin θ\n√\na cos2 θ + (r sin θ)3/2 ∆\n\n(A14)\n\nIn order to measure the angle at which a photon leaves the source and hits the disk we must define a co-moving 3-frame\nattached to vs (v being a special case where θ = π/2. Together with Equation (A9), the vectors r̂, θ̂ and φ̂′ , where\nφ̂′ = sinh U φ̂ + cosh U t̂,\nform a convenient orthonormal tetrad. This paper has been typeset from a TEX/ LATEX file prepared by the author.\n\n(A15)\n\n\f"}