{"id": "http://arxiv.org/abs/astro-ph/0108430v1", "guidislink": true, "updated": "2001-08-27T23:02:46Z", "updated_parsed": [2001, 8, 27, 23, 2, 46, 0, 239, 0], "published": "2001-08-27T23:02:46Z", "published_parsed": [2001, 8, 27, 23, 2, 46, 0, 239, 0], "title": "The Effectiveness of the Canada-France-Hawaii Telescope", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0108367%2Castro-ph%2F0108407%2Castro-ph%2F0108066%2Castro-ph%2F0108384%2Castro-ph%2F0108135%2Castro-ph%2F0108088%2Castro-ph%2F0108326%2Castro-ph%2F0108515%2Castro-ph%2F0108012%2Castro-ph%2F0108065%2Castro-ph%2F0108018%2Castro-ph%2F0108069%2Castro-ph%2F0108111%2Castro-ph%2F0108320%2Castro-ph%2F0108408%2Castro-ph%2F0108038%2Castro-ph%2F0108129%2Castro-ph%2F0108315%2Castro-ph%2F0108160%2Castro-ph%2F0108193%2Castro-ph%2F0108059%2Castro-ph%2F0108516%2Castro-ph%2F0108310%2Castro-ph%2F0108311%2Castro-ph%2F0108188%2Castro-ph%2F0108003%2Castro-ph%2F0108354%2Castro-ph%2F0108334%2Castro-ph%2F0108498%2Castro-ph%2F0108264%2Castro-ph%2F0108337%2Castro-ph%2F0108148%2Castro-ph%2F0108221%2Castro-ph%2F0108006%2Castro-ph%2F0108183%2Castro-ph%2F0108196%2Castro-ph%2F0108420%2Castro-ph%2F0108440%2Castro-ph%2F0108118%2Castro-ph%2F0108206%2Castro-ph%2F0108041%2Castro-ph%2F0108289%2Castro-ph%2F0108217%2Castro-ph%2F0108061%2Castro-ph%2F0108471%2Castro-ph%2F0108298%2Castro-ph%2F0108180%2Castro-ph%2F0108284%2Castro-ph%2F0108147%2Castro-ph%2F0108518%2Castro-ph%2F0108509%2Castro-ph%2F0108078%2Castro-ph%2F0108140%2Castro-ph%2F0108494%2Castro-ph%2F0108482%2Castro-ph%2F0108095%2Castro-ph%2F0108430%2Castro-ph%2F0108276%2Castro-ph%2F0108025%2Castro-ph%2F0108072%2Castro-ph%2F0108185%2Castro-ph%2F0108130%2Castro-ph%2F0108123%2Castro-ph%2F0108113%2Castro-ph%2F0108517%2Castro-ph%2F0108455%2Castro-ph%2F0108026%2Castro-ph%2F0108172%2Castro-ph%2F0108296%2Castro-ph%2F0108164%2Castro-ph%2F0108299%2Castro-ph%2F0108307%2Castro-ph%2F0108347%2Castro-ph%2F0108103%2Castro-ph%2F0108468%2Castro-ph%2F0108328%2Castro-ph%2F0108077%2Castro-ph%2F0108306%2Castro-ph%2F0108242%2Castro-ph%2F0108491%2Castro-ph%2F0108286%2Castro-ph%2F0108504%2Castro-ph%2F0108490%2Castro-ph%2F0108451%2Castro-ph%2F0108266%2Castro-ph%2F0108075%2Castro-ph%2F0108115%2Castro-ph%2F0108483%2Castro-ph%2F0108224%2Castro-ph%2F0108392%2Castro-ph%2F0108177%2Castro-ph%2F0108034%2Castro-ph%2F0108458%2Castro-ph%2F0108441%2Castro-ph%2F0108219%2Castro-ph%2F0108240%2Castro-ph%2F0108406%2Castro-ph%2F0108060%2Castro-ph%2F0108110%2Castro-ph%2F0108201%2Castro-ph%2F0108136&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Effectiveness of the Canada-France-Hawaii Telescope"}, "summary": "We have investigated the productivity and impact of the Canada-France-Hawaii\nTelescope (CFHT) during its twenty-year history. CFHT has maintained a database\nof refereed publications based on data obtained with CFHT since first light in\n1979. For each paper, we analysed the cumulative number of citations and the\ncitation counts for each year, from data supplied by the NASA Astrophysics Data\nSystem (ADS). We have compared citation counts retrieved from the ADS with\nthose from the Institute for Scientific Information (ISI) for a small sample of\npapers. We have developed a procedure that allows us to compare citation counts\nbetween older and newer papers in order to judge their relative impact. We\nlooked at the number of papers and citations not only by year, but also by the\ninstrument used to obtain the data. We also provide a preliminary look as to\nwhether programs given a higher ranking by the Time Allocation Committee (TAC)\nproduced papers with a higher number of citations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0108367%2Castro-ph%2F0108407%2Castro-ph%2F0108066%2Castro-ph%2F0108384%2Castro-ph%2F0108135%2Castro-ph%2F0108088%2Castro-ph%2F0108326%2Castro-ph%2F0108515%2Castro-ph%2F0108012%2Castro-ph%2F0108065%2Castro-ph%2F0108018%2Castro-ph%2F0108069%2Castro-ph%2F0108111%2Castro-ph%2F0108320%2Castro-ph%2F0108408%2Castro-ph%2F0108038%2Castro-ph%2F0108129%2Castro-ph%2F0108315%2Castro-ph%2F0108160%2Castro-ph%2F0108193%2Castro-ph%2F0108059%2Castro-ph%2F0108516%2Castro-ph%2F0108310%2Castro-ph%2F0108311%2Castro-ph%2F0108188%2Castro-ph%2F0108003%2Castro-ph%2F0108354%2Castro-ph%2F0108334%2Castro-ph%2F0108498%2Castro-ph%2F0108264%2Castro-ph%2F0108337%2Castro-ph%2F0108148%2Castro-ph%2F0108221%2Castro-ph%2F0108006%2Castro-ph%2F0108183%2Castro-ph%2F0108196%2Castro-ph%2F0108420%2Castro-ph%2F0108440%2Castro-ph%2F0108118%2Castro-ph%2F0108206%2Castro-ph%2F0108041%2Castro-ph%2F0108289%2Castro-ph%2F0108217%2Castro-ph%2F0108061%2Castro-ph%2F0108471%2Castro-ph%2F0108298%2Castro-ph%2F0108180%2Castro-ph%2F0108284%2Castro-ph%2F0108147%2Castro-ph%2F0108518%2Castro-ph%2F0108509%2Castro-ph%2F0108078%2Castro-ph%2F0108140%2Castro-ph%2F0108494%2Castro-ph%2F0108482%2Castro-ph%2F0108095%2Castro-ph%2F0108430%2Castro-ph%2F0108276%2Castro-ph%2F0108025%2Castro-ph%2F0108072%2Castro-ph%2F0108185%2Castro-ph%2F0108130%2Castro-ph%2F0108123%2Castro-ph%2F0108113%2Castro-ph%2F0108517%2Castro-ph%2F0108455%2Castro-ph%2F0108026%2Castro-ph%2F0108172%2Castro-ph%2F0108296%2Castro-ph%2F0108164%2Castro-ph%2F0108299%2Castro-ph%2F0108307%2Castro-ph%2F0108347%2Castro-ph%2F0108103%2Castro-ph%2F0108468%2Castro-ph%2F0108328%2Castro-ph%2F0108077%2Castro-ph%2F0108306%2Castro-ph%2F0108242%2Castro-ph%2F0108491%2Castro-ph%2F0108286%2Castro-ph%2F0108504%2Castro-ph%2F0108490%2Castro-ph%2F0108451%2Castro-ph%2F0108266%2Castro-ph%2F0108075%2Castro-ph%2F0108115%2Castro-ph%2F0108483%2Castro-ph%2F0108224%2Castro-ph%2F0108392%2Castro-ph%2F0108177%2Castro-ph%2F0108034%2Castro-ph%2F0108458%2Castro-ph%2F0108441%2Castro-ph%2F0108219%2Castro-ph%2F0108240%2Castro-ph%2F0108406%2Castro-ph%2F0108060%2Castro-ph%2F0108110%2Castro-ph%2F0108201%2Castro-ph%2F0108136&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have investigated the productivity and impact of the Canada-France-Hawaii\nTelescope (CFHT) during its twenty-year history. CFHT has maintained a database\nof refereed publications based on data obtained with CFHT since first light in\n1979. For each paper, we analysed the cumulative number of citations and the\ncitation counts for each year, from data supplied by the NASA Astrophysics Data\nSystem (ADS). We have compared citation counts retrieved from the ADS with\nthose from the Institute for Scientific Information (ISI) for a small sample of\npapers. We have developed a procedure that allows us to compare citation counts\nbetween older and newer papers in order to judge their relative impact. We\nlooked at the number of papers and citations not only by year, but also by the\ninstrument used to obtain the data. We also provide a preliminary look as to\nwhether programs given a higher ranking by the Time Allocation Committee (TAC)\nproduced papers with a higher number of citations."}, "authors": ["Dennis R. Crabtree", "Elizabeth P. Bryson"], "author_detail": {"name": "Elizabeth P. Bryson"}, "author": "Elizabeth P. Bryson", "arxiv_comment": "20 pages, 5 figures, accepted for JRASC", "links": [{"href": "http://arxiv.org/abs/astro-ph/0108430v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0108430v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0108430v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0108430v1", "journal_reference": null, "doi": null, "fulltext": "The Effectiveness of the Canada-France-Hawaii Telescope\nDennis R. Crabtree\n\narXiv:astro-ph/0108430v1 27 Aug 2001\n\nCanadian Gemini Office, Herzberg Institute of Astrophysics,\nNational Research Council Canada, Victoria, BC V9E 2E7, Canada\nDennis.Crabtree@nrc.ca\nElizabeth P. Bryson\nCanada-France-Hawaii Telescope, Kamuela, HI 96743\nbryson@cfht.hawaii.edu\nABSTRACT\nWe have investigated the productivity and impact of the Canada-France-Hawaii\nTelescope (CFHT) during its twenty-year history. CFHT has maintained a database of\nrefereed publications based on data obtained with CFHT since first light in 1979. For\neach paper, we analysed the cumulative number of citations and the citation counts\nfor each year, from data supplied by the NASA Astrophysics Data System (ADS). We\nhave compared citation counts retrieved from the ADS with those from the Institute\nfor Scientific Information (ISI) for a small sample of papers. We have developed a\nprocedure that allows us to compare citation counts between older and newer papers in\norder to judge their relative impact. We looked at the number of papers and citations\nnot only by year, but also by the instrument used to obtain the data. We also provide a\npreliminary look as to whether programs given a higher ranking by the Time Allocation\nCommittee (TAC) produced papers with a higher number of citations.\nSubject headings: telescopes\n\n1.\n\nIntroduction\n\nAstronomers use telescopes to investigate a wide range of scientific problems with almost as\ndiverse a range of instrumentation. The output from these investigations provides an immense\namount of data that needs to be reduced and analyzed. The results from the investigation are published in scientific journals, and these papers have an impact, small or large, on future observational\nand/or theoretical investigations.\nTwo measures of the effectiveness of a telescope are the number of papers published in refereed\njournals that are based on data obtained by the telescope, and the citation count of those papers.\n\n\f–2–\nThe effectiveness, or lack therein, of a telescope can have far-reaching consequences. For example, in\nCanada the effectiveness of a single major telescope, the Canada-France-Hawaii Telescope (CFHT),\nmay have a significant impact on the funding of future telescopes. Abt (1985) compared the impact\nof two facility telescopes (the CTIO and KPNO 4-m) with that of two telescopes run by private\nobservatories (the Lick 3-m and the Palomar 5-m). He found no significant difference. Trimble\n(1995) compared the impact of large US optical telescopes for papers published in 1990-1991. More\nrecently Benn & Sánchez (2001) compared the scientific impacts of telescopes world-wide based on\ntheir contributions to the 1000 most-cited papers (1991-98) and the number of papers published in\nNature between 1989-1998. They found that CFHT was the most productive and most highly-cited\nof all 4-m class telescopes during this time period.\nProductivity, as measured by the number of papers, and impact, as measured by citation numbers are the two measures we will use to assess the effectiveness of the CFHT over its approximately\ntwenty-year history. Simply counting the number of papers in refereed journals is an easy way to\nmeasure effectiveness but misses completely the influence these papers have on the field. It should\nbe noted that citation numbers are not a perfect measure of a paper's impact, nor are they necessarily a measure of the paper's scientific value. In this contribution we will examine the productivity\nand impact history of CFHT papers. We will also examine the productivity and impact of the\nvarious instruments that have been used at CFHT during its twenty years of operation. Finally,\nwe will look at how the citation counts for published papers are related to the grade assigned the\noriginal observing proposal by the Time Allocation Committee.\n\n2.\n\nThe Data\n\nCFHT maintains a database of publications in refereed journals that are based on data obtained\nwith the telescope. The database contains information on 1065 papers published between 19801999. Papers are identified from four main sources: reprints submitted by authors, scanning of all\nmajor journals, observers' time request forms, and searching NASA's Astrophysics Data System\n(ADS) for papers referring to CFHT in the abstract. The following criteria are used to judge\nwhether a paper is considered a CFHT publication:\n\"A paper must report new results based on significant observational data obtained at\nCFHT or be based on archival data retrieved from the CFHT archive. If data from\nmultiple telescopes are included, the CFHT data should represent a significant fraction\nof the total data\".\nA staff astronomer examines each paper to judge whether it meets these criteria. Although an\nauthor may footnote a paper to indicate that it is based on CFHT observations, the paper may not\nmeet the criteria for inclusion in the database. In our view, this rigorous emphasis on validation of\nall papers by astronomers within CFHT makes the database unique.\n\n\f–3–\nThe CFHT publication information is maintained within a Microsoft Access database. Several\nroutines, written in Visual Basic for Applications within the database, query the ADS for information on each publication. These routines utilize an Internet Data Transfer Library (Ashish &\nKreft 1998) downloaded from the Internet. The software generates the appropriate query as a\nURL, sends the URL to the ADS, and parses the returned text to extract the relevant information.\nThe information for each publication in the ADS is accessed by a publication bibliography code,\nbibcode, which is generated from the year, journal, volume and page information for a publication.\nOne of the many services ADS provides is a verification utility that returns a yes/no as to whether a\nparticular bibcode is valid. For each entry in our database, the ADS bibcode is generated from the\npublication information and verified with the ADS. The information for those entries with invalid\nbibcodes is checked and updated, then a new bibcode is generated and verified. This verification\nof each paper's bibcode ensures that we have the correct publication information for each entry.\nOnce each publication has a valid bibcode, the ADS is queried for the full title, list of authors,\nthe number of citations, and the number of self-citations (ones in which the first author of the\ncited and citing paper are the same person). Finally, the bibcodes of each citing paper and the\nnumber of citations by year of the citing paper are recorded for each publication. The instrument,\nor instruments, used to acquire the data used for each publication was identified by browsing each\nof the papers.\nThis use of the ADS allows us to verify the basic bibliographic information, obtain a complete\nlist of authors, and collect the citation data for each publication. The citation information in the\nADS is incomplete (Kurtz et al. 2000) . Much of the citation information in the ADS is based upon\na subset of the Science Citation Index purchased from the Institute for Scientific Information (ISI)\nby the ADS. This subset is seriously incomplete in referring to articles in the non-astronomical\nliterature, as it only contains references that were in the ADS when the subset was purchased. The\nADS currently builds citation links itself for all publications in its database. The ADS does not\ninclude many physics journals but does include a subset of conference proceedings.\n\n2.1.\n\nComparison of ISI and ADS Citation Counts\n\nISI, an established and reputable commercial firm, has been considered the best resource for\ncitation information among astronomers and librarians for many years. However, the ADS provides\npublication and citation information from the Web at no cost. How does the citation information\nobtained from these two sources compare? We selected three highly cited CFHT papers: Carlberg\net al. (1996); Cowie et al. (1996); Lilly et al. (1996), and performed a detailed analysis of citations to\nthese papers using both the ADS and ISI (through the online service DialogWeb). While the total\nnumber of citations to the three papers from ISI/ADS are remarkably similar (146/153, 125/124,\n172/177), there are interesting differences in the details of the citing papers. The number of citing\npapers in common to ADS and ISI for the three papers is 142, 109 and 165. Each database missed\nseveral citing papers that the other one included. ISI tended to find citations from physics journals\n\n\f–4–\nmissed by ADS, while ADS had some conference citations and citations from the major journals\nthat were missed by ISI. The citing papers in the major journals were missed by ISI primarily due\nto incorrect citations (e.g. wrong year or volume) in the citing papers. Our conclusion from this\ndetailed look at a small number of papers is that, on average, the ADS provides citation numbers\nthat are consistent with those obtained from ISI and any differences will have a minimal impact on\nour study.\n\n3.\n\nCFHT's Productivity and Impact\n\nWe define two terms that we will use throughout the rest of the paper: productivity and impact.\nProductivity refers to the number of publications in the context of the telescope, an instrument\nor a particular researcher. Productivity is not the same as scientific impact. Impact is usually\nmeasured by using citation numbers. Overall impact is measured by summing citation numbers of\nall the relevant papers. The average number of citations per paper (CPP) measures the average\nimpact.\n\n3.1.\n\nCitation Histories\n\nFor each entry in the CFHT database, we have retrieved the year of every citing paper and\nstored the total number of citations for each year in the database. A paper published in 1990,\nfor example, has the number of citations received for each year from 1990 to 1999. These data\nallow us to investigate the citation rate as a function of the number of years since publication. The\nsolid curve in Figure 1 shows the average citations per paper (CPP) as a function of the number\nof years after publication for all papers in the database with citations. There are some citations in\nthe year of publication for papers published early in the year; for example, a paper published in\nJanuary may receive a citation in November. As the number of years since publication increases,\nthe number of papers included decreases since the relevant data for all papers doesn't yet exist.\nThe papers published in 1999 are included in only the data point for zero years after publication,\nand 1998 papers are included in the zero and one year data points, etc. This curve peaks at two\nyears after publication and has a fairly smooth decay after that. It has been known for many years\nthat the number of citations a paper receives declines exponentially with the age of the paper (e.g.\nBurton & Kebler (1960)). This is true of CFHT publications as well. The dashed line in Figure\n1 is the fit of a simple exponential decline in citations with a half-life of 4.93 years beginning two\nyears after publication.\nOur analysis does not include a correction for a growth in publication numbers over the period\n1982-1999. Abt (1981) found a half-life of around twenty years for papers published in the 1961\nissues of ApJ, ApJS and AJ. However, he pointed out that the growth in the number of papers\npublished over the eighteen year-period he gathered citation numbers was part of the reason the\n\n\f–5–\nhalf-life was so long. Peterson (1988) shows that number of papers published in those three journals\nincreased by 4.6 times over this period. Kurtz et al. (2000) show that the number of papers in their\nBig8 journals (ApJ, ApJL, ApJS, A&A, A&AS, MNRAS, AJ and PASP) increased at approximately\na 3.7% yearly rate between 1976 and 1998. The astronomical literature has doubled between 1982\nand 1999, the years covered in our study.\nHas the electronic distribution of preprints and journal articles changed the citation history\nof papers? To examine this question, we divided the CFHT papers in two groups: those published\nbetween 1984 and 1991, and those published between 1992 and 1999. There were 428 and 522\npapers in these two groups. In Figure 2 the average citation rate for these two periods is shown\nalong with the fit of a simple exponential model for each period. The citation rate for the newer\npapers clearly declines more rapidly than that of the older papers. The half-life of the older papers\nis 7.11 years while the half-life for the newer papers is 2.77 years. We believe that if one were able to\nsample citation rates monthly, the citations for an average paper in the more recent dataset would\npeak less than two years after publication. This is the result of more rapid dissemination of results\nby the electronic distribution of pre-prints (astro-ph) and journal articles. The faster decline in\ncitations for the recent subset also indicate that new results supersede earlier results more quickly\nthan in the past.\n\n3.2.\n\nComparing Papers from Differing Years: A Standard Citation Measure\n\nComparing the citation numbers for papers published in different years is difficult since the\nnumber of citations to a paper increases with time. We have established a method for estimating the\ntotal number of citations that a paper can be expected to achieve after a suitably long period. How\ndo we compare papers published over almost twenty years, given the natural growth in citations\nwith time? We have used the average citation history of all CFHT papers to define a growth\ncurve for citations (Figure 3). This curve shows the percentage of the final number of citations,\ndefined as the number eighteen years after publication, for an average paper versus the years since\npublication. Using this curve we can estimate the final citation count (FCC) for each paper given\na citation count and the number of years since publication.\n\n4.\n\nProductivity and Impact History\n\nThe first CFHT paper was submitted in May 1980 and was published in August of that year\n(van den Bergh 1980). CFHT's productivity (Figure 4) rose more or less continuously through the\n1980s until it reached a fairly constant level of around seventy-five papers per year between 1991\nto 1997. It took approximately ten years for CFHT to hit its stride and reach a consistently high\nlevel of paper production. A telescope's productivity in any one year is linked to many factors\nsuch as weather, competitiveness of the available instruments, and the reliability of instruments\n\n\f–6–\nand the telescope, all in the several years before the year of publication. We attribute the increase\nin publications during the first ten years of CFHT to the increase in the reliability of both the\ninstruments and the telescope and to the development of more competitive instruments. There are\ntwo possible reasons the number of CFHT publications may be in a slow decline. First, as more\n8-10 meter telescopes come on-line, CFHT is no longer a forefront facility. Second, the use of large\nmosaic CCD cameras has increased at CFHT. These generate a tremendous amount of data, and\nthe time from acquisition of data to the publication of results has likely increased.\nTrimble (1995) studied the productivity of large, American optical telescopes including CFHT.\nShe compiled publication data for an eighteen month period beginning January 1990, by examining\nthe major North American journals: ApJ, ApJL, ApJS, AJ, PASP. According to Trimble's list,\nCFHT ranked fourth in productivity behind the CTIO 4-meter, Palomar and the KPNO 4-meter;\nand, as Trimble notes, many CFHT publications appear in journals not included in her study.\nTaking all of the 1990 papers and half of the 1991 papers, we count sixty-seven CFHT papers\n(Trimble counted 58.6) that were published in the major North American journals during this\nperiod. (Trimble pro-rated each paper based upon the number of telescopes used in the paper,\nwhich we have not done.) Our database contains one hundred one CFHT papers published in all\nrefereed journals during this period. If we correct this number by the same factor that our earlier\nnumber differs from Trimble's for only North American journals, we end up with a total of 88.3\npapers. The total number of CFHT publication changed significantly by including publications\nfrom all journals. While the other telescopes undoubtedly had publications in non-North American\njournals, except for the Anglo-Australian Telescope, their numbers would not have increased as\nsignificantly. Thus, any future study of papers and citations, especially those that compare different\nfacilities, should include all major journals. The average CPP for all papers in a given year, by\nyear of publication, is shown in Figure 5. One would expect the average CPP to grow smoothly\nwith time since publication. However, due to the relatively small number of papers in any given\nyear, the average CPP can be influenced by a small number of highly cited papers. For example,\nthe bump in 1996 is due to two highly cited papers (Lilly et al. 1996, Carlberg et al. 1996) that\nare based on data taken with MOS, the Multi-Object Spectrograph. The fluctuations in citation\nnumbers are much higher in earlier years when the number of papers was smaller.\n\n4.1.\n\nPublications and Citations by Journal\n\nMost CFHT observers are from Canada, France or the University of Hawaii (UH). The French\ntend to publish in European journals, mainly A&A, while Canadian and UH researchers favor\nNorth American journals. How are CFHT publications distributed across the major journals? The\ndistribution of publications across eight journals (we include ApJL with ApJ) is shown on the left\nside of Table 1. In addition, each paper has been tagged as belonging to one of the three partners\nbased upon the affiliation of the first author or the agency that granted time for the observations.\n(Canada grants some time to international researchers). The majority of CFHT papers have been\n\n\f–7–\npublished in the three major journals - ApJ, A&A and AJ account for more than 78% of CFHT\npapers.\nApJ has the most publications with 33% of all CFHT publications, while A&A receives 25.8% of\nthe publications. The breakdown of publications by journal for different years shows an interesting\nchange. In 1996/1997 33% and 25% of papers were published in AJ and A&A respectively, while for\n1998/1999 the numbers were 25% and 45%. One explanation for this change is that the French are\npublishing more and the Canadians/UH, less in recent years. Only 75 (18.9%) of the French papers\nappeared in American journals while only 53 (9.7%) Canadian papers, and 6 UH papers (5.1%),\nappeared in non-North American journals. There is a very strong trend for European authors to\npublish in European journals and North American authors to publish in North American journals.\nThis may be a result of the fact that A&A has no page charges and subsequently the French do\nnot have a large budget for page charges. This tendency for authors to publish on their side of\nthe \"Atlantic Ocean\" is particularly meaningful for any comparison of publication activity levels\nbetween North American (only) and multinational observatories. The distribution of citations per\npaper (CPP) across the journals is shown in Table 2. The three major journals, ApJ (including\nthe Letters), A&A and AJ, account for 84.7% of the citations to CFHT papers. While ApJ papers\naccount for 33% of the CFHT total, these papers received almost half (48.1%) of the citations.\nA&A, A&AS, AJ, MNRAS and PASP all have a citation rate lower than the average CPP of 20.35.\nNature has the highest CPP of any journal (2.8%); and yet these represent only 1.6% of CFHT\npapers.\n\n4.2.\n\nPublications and Final Citation Count by Instrument\n\nThe primary instrument used to acquire the data was identified for each publication. In a few\ncases, several instruments were grouped together into a single category. For example, FP refers\nto several different \"Fabry-Perot\" instruments, Coudé refers to the two Coudé spectrographs that\nhave been used at CFHT, and \"Direct Imaging\" combines several different direct imaging cameras\nthat have been used at CFHT over the years. HRCam (McClure et al. 1989), which incorporated\nfast tip-tilt correction, and, MOCAM (Cuillandre et al. 1996) and UH8K (Metzger, M.R., Luppino,\nG.A., & Miyazaki, S. 1995) two mosaic cameras are identified separately from other direct cameras\nbecause they represent new technologies, and we wish to track their impact directly. A total of 39\ndistinct instrument or instrument categories were identified; however, a large number of instruments\nproduced a very few papers and approximately 70% of CFHT papers were produced by the top\nfive instrument/instrument categories. Table 2 shows the number of papers, the FCC per paper\nand the FCC per night of scheduled telescope time for the top-ten paper producing instruments.\nThe number of nights of scheduled telescope time was determined by looking at each semester's\nschedule from 1982 onward and counting the number of nights for each instrument/instrument\ngroup. CFHT is known for its exceptional image quality, and it is no surprise that direct imaging\nhas produced the highest number of papers. It also has the highest efficiency of turning scheduled\n\n\f–8–\nnights into citations. The two Coudé spectrographs and the Multi-Object Spectrograph (MOS)\nproduced the 2nd and 3rd highest number of papers. The CFRS (Lilly et al. 1996) and CNOC\n(Carlberg et al. 1996) studies are a large contributing factor to the high impact of MOS.\n\n5.\n\nCFHT's Prolific Authors\n\nWho have been the most prolific authors over the twenty years of CFHT publications? Table\n3 shows the top nine most prolific authors with the total number of publications, the number\nof publications in four of the major journals, the total number of citations to their papers, their\naverage CPP and their projected FCC assuming they publish no more papers based on CFHT data.\nThe most prolific authors have favoured North American journals. The two French authors in this\nlist have 45% of their papers in North American journals as compared to only 18.9 % of all papers\ndesignated as French. Citations will be discussed more thoroughly in the next section. However, it\nis clear that the average CPP for these authors varies significantly.\n\n5.1.\n\nSelf Citations\n\nThe issue of self-citations (ones where the first author of cited and citing paper are the same)\nis one frequently asked of (and discussed by) librarians. What is the average self-citation rate?\nAs Trimble points out, this number is difficult to determine exactly. Authors do not always use a\nconsistent name (first name or first initial, for example) which may lead to the incorrect counting\nof self-citations. We have counted self-citations for CFHT papers by matching first authors on the\ncited and citing papers. The average self-citation rate for all CFHT papers is 6.3%. On average,\ncorrections to citation numbers for self-citations are not important. However, the self-citation rate\nfor individual papers can be much higher. There are almost ninety papers with a self-citation rate\nof 30% or more and many of these have ten or more citations. Also, certain authors tend to favour\ntheir own work. Several authors with four papers, or more, have average self-citation rates of 20%\nor higher. Highly cited papers had much lower than average self-citation rates. The twenty most\ncited papers in the database have an average self-citation rate of 3%, less than half of the average\nrate for all papers.\n\n6.\n\nCFHT's Most Highly Cited Papers\n\nWe computed the final citation count (FCC) for each CFHT paper in the database using the\ngrowth curve described above. The ten papers with the highest FCC are listed in Table 4. It is\ninteresting to note that the top three papers in this list have the same first author, Simon Lilly.\nLilly also has the highest total FCC, summed over all papers, of any author in the CFHT database.\nTwo of the top three papers are based on data from a large, ambitious project undertaken with a\n\n\f–9–\nnew forefront instrument. The top three papers all have the word \"survey\" in their title as well.\n\n7.\n\nHow Effective is the Time Allocation Committee?\n\nThe observing time requested by proposals to use any large telescope such as the CFHT,\ngenerally outnumbers the available time by a significan t factor. A Time Allocation Committee\n(TAC) is established to review and to rank the submitted proposals, and, in classical scheduling,\nonly the highest-ranked proposals make it to the telescope. However, in queue scheduling, the\nrelative ranking of the proposals will be an important factor in determining which programs are\nactually executed. The role of the TAC becomes even more critical in the era of queue scheduling.\nHow effective is the TAC in judging the scientific merit of proposals? Most would agree that almost\nall programs that reach the telescope will likely produce a scientific publication if the weather and\nthe equipment co-operate. However, one would expect that the more highly ranked proposals will,\non average, produce publications with a higher impact, i.e. number of citations. We feel this\nevaluation of the TAC process is important as several large telescopes undertake queue scheduling.\nObserving time at CFHT is allocated by country: 42.5% for each of Canada and France, and\n15% for the University of Hawaii. Each country runs its own TAC, which assigns the grades. The\nInternational TAC meets to deal with scheduling conflicts and program overlaps. We have identified\nthe original proposal associated with twenty-two CFHT papers published between 1997 and 1999.\nOne of us (D.C.) has access to the TAC ranking for these proposals as he served as Senior Resident\nAstronomer for three years. We are thus able to look at the correlation between the TAC ranking of\nthe proposal and the predicted FCC for the papers resulting from those observations. We selected\nonly those papers that were based on a proposal that used only data from CFHT and data from\na single observing run. Figure 5 shows the FCC versus TAC ranking (a small number is a higher\nranking) for these twenty-two proposals. Except for one highly ranked, highly cited study, there is\na weak inverse correlation from a simple linear fit to the data. Another interpretation of the data\nis that highly-ranked studies (< 0.4) show small scatter around a constant number of citations,\nwhile lower-ranked studies show a much larger scatter. Is the TAC being conservative and ranking\nsure bets higher while riskier studies end up with lower rankings? We want to emphasise that this\nresult is very preliminary, as only twenty-two papers are included, and it relies on the predicted\nfinal citation counts. We found no dependence of the FCC on the number of nights of telescope\ntime awarded for the same twenty-two programs.\n\n8.\n\nConclusions\n\nWe have studied the productivity and impact of the CFHT over its twenty-year history by\nlooking at the number of papers in refereed journals and the number of citations to these papers.\nIt took ten years for CFHT to achieve and maintain a high level of paper production. We attribute\n\n\f– 10 –\nthis to a fairly long commissioning period for the telescope and the time to develop a competitive\nsuite of instrumentation. Direct imagers (photographic plates, CCD imagers) have been CFHT's\nmost productive instruments, both in the number of papers and the number of papers per night\nof scheduled telescope time. The excellent image quality at CFHT is a significant factor in direct\nimaging's high productivity.\nWe retrieved citation counts and the years of the citing papers from the ADS for all CFHT\npapers in our database. Using this data, we developed a procedure for estimating the number\nof citations that a paper can be expected to receive after a period of almost twenty years. This\nestimation allowed us to compare the citation numbers for papers from different years and to\ncompare the impact of different instruments. The instrument that produced the papers with the\nhighest impact (average citations/paper) was the Multi-Object Spectrograph (MOS), which was\nused in the highly cited CFRS and CNOC studies. Direct imaging had the second highest impact.\nIn looking at the number of citations/night of allocated time, direct imaging had the highest impact,\nfollowed by MOS and the two Coudé spectrographs. The efficiency of converting observing nights\ninto papers or citations varies considerably between instruments. For example, there is a factor of\nfive difference in the average final citation count per night between \"Direct Imaging\" and the FTS.\nIn order to maximize a telescope's impact, one might consider offering only the \"high-efficiency\"\ninstruments.\nFinally, a look at the correlation between the predicted final citation count and the TAC\nranking of the observing proposal, showed a weak negative correlation, i.e. lower-ranked proposals\nend up with a higher number of citations. An alternative interpretation has higher-ranked proposals\nwith a lower number of citations with a small scatter. Lower-ranked proposals have more scatter\nin the number of citations and some of these end up with significantly more citations than most of\nthe higher ranked proposals.\nWe acknowledge the Canada-France-Hawaii Telescope and the Herzberg Institute of Astrophysics for their support of this project. We thank Pierre Couturier for his impetus in initiating\nthe analysis of CFHT publications. We also thank Gordon W. Bryson for his editing and Virginia\nSmith for her assistance during her mentorship at CFHT. This research has made use of NASA's\nAstrophysics Data System Bibliographic Services.\n\nREFERENCES\nAbt, H.A. 1981, PASP, 93, 207\nAbt, H.A. 1985, PASP, 97, 1050\nAshish, D., & Kreft, T. 1998, http://www.mvps.org/access/modules/mdl0037.htm\nBenn, C.R. & Sánchez, S.F. 2001, PASP, 113, 385\n\n\f– 11 –\nBurton, R.E., & Kebler, R.W. 1960, American Documentation, 11, 18\nCarlberg, R.G., Yee, H., Ellingson, E., Abraham, R., Gravel, P., Morris, S., & Pritchet, C.J. 1996,\nApJ, 462, 32\nCowie, L.L., Songaila, A., Hu, E.M., & Cohen, J.G. 1996, AJ, 112, 839\nCuillandre, J.-C., Mellier, Y., Dupin, J.-P., Tilloles, P., Murowinski, R., Crampton, D., Wooff, R.,\nLuppino, G.A. 1996, PASP, 108, 1120\nKormendy, J. 1985, ApJ, 295, 73\nKurtz, M.J., Eichorn, G., Accomazii, A., Grant, C., Murrray, S.S., & Watson, J.M. 2000, A&AS,\n143, 41\nLilly, S.J., Cowie, L.L, & Gardner, J.P. 1991, ApJ, 369, 79\nLilly, S.J., Tresse, L., Hammer, F., Crampton, D., & Le Fèvre, O. 1995, ApJ, 455, 108\nLilly, S.J., Le Fèvre, O., Hammer, F., & Crampton, D. 1996, ApJ, 460, L1\nMcCarthy, P.J., van Breugel, W., Spinrad, H., Djorgovski, S. 1987, ApJ, 321, 29\nMcClure, R.D., Grundmann, W.A., Rambold, W.N., Fletcher, M.J., Richardson, E.H., Stilburn,\nJ.R., Racine, R., Christian, C.A., Waddell, P. 1989, PASP, 101, 1156\nMetzger, M.R., Luppino, G.A., Miyazaki, S. 1995, AAS, 187, 7305\nPeterson, C. 1988, PASP, 100, 106\nPierce, M.J., Welch, D.L., McClure, R.D., van den Bergh, S., Racine, R., & Stetson, P.B. 1994,\nNature, 371, 385\nSpite, F., & Spite, M. 1982, A&A, 115, 357\nTrimble, V. 1995, PASP, 107, 977\nTyson, J.A., Wenk, R.A., & Valdes, F. 1990, ApJ, 349, 1\nvan den Bergh, S. 1980, PASP, 92, 409\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n\f10 11 12 13 14 15 16 17 18\n7\n\n8\n\n9\n\nData\nFit\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nYears Since Publication\n\n– 12 –\n\nAverage Citations/Paper\n\nFig. 1.- The average citation rate as a function of the number of years since publication. The\nsolid line is the data for all CFHT papers and the dashed line is the fit of a simple exponential\ndecline with a half-life of 4.93 years.\n\n\fYears Since Publication\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n1992-1999 Fit\n\n1992-1999 Data\n\n1984-1991 Fit\n\n1984-1991 Data\n\n7\n\n– 13 –\n\nAverage Citations/Paper\n\nFig. 2.- The average citation rate as a function of years since publication for CFHT split into two\ngroups; 1984-1991 papers and 1992-1999 papers.\n\n\f90.0%\n% of total citations\n\n80.0%\n70.0%\n60.0%\n\n– 14 –\n\nFig. 3.- Citation count growth curve for all CFHT publications.\n\n100.0%\n\n50.0%\n40.0%\n30.0%\n20.0%\n10.0%\n0.0%\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9 10 11 12 13 14 15 16 17 18\n\nYears after Publication\n\n\f90\n80\n70\n60\n50\n\n– 15 –\n\nFig. 4.- Number of CFHT Papers by Year of Publication\n\n100\n\n40\n30\n20\n10\n0\n1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999\n\nYear of Publication\n\n\f– 16 –\n\n100\n90\n\nFinal # of Citations\n\n80\n70\n60\n50\n40\n30\n20\n10\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nTAC Grade\n\nFig. 5.- The predicted final number of citations versus the Time Allocation Committee (TAC)\ngrade assign the original proposal for a subset of CFHT publications. A lower TAC grade is\n\"better\". The highest ranked proposal will have a TAC grade near 0.0, while proposals that just\nmake it on the schedule have a grade of 1.0. Note the single point with a very high TAC grade and\na predicted high number of citations.\n\n\f– 17 –\n\nTable 1. Distribution of Papers and Citations by Journal.\nNumber of Papers\nAll\nC\nF\n\nH\n\nA&A\nA&AS\nAJ\nApJ\nApJS\nMNRAS\nNature\nPASP\n\n275\n37\n209\n351\n22\n20\n18\n82\n\n34\n4\n174\n223\n18\n10\n5\n66\n\n239\n32\n10\n59\n1\n10\n9\n5\n\n2\n1\n25\n69\n3\n0\n3\n11\n\n14.86\n11.92\n18.70\n29.73\n28.00\n9.25\n33.72\n11.02\n\n8.79\n4.25\n18.06\n29.20\n30.28\n11.90\n47.20\n11.33\n\n15.82\n12.91\n15.00\n22.34\n2.00\n6.60\n19.89\n7.60\n\n4.00\n11.00\n24.64\n37.77\n23.00\n0.00\n64.00\n10.73\n\nTotal/Average\n\n1065\n\n549\n\n397\n\n117\n\n20.35\n\n21.42\n\n15.75\n\n31.30\n\nJournal\n\nCitations/Paper\nAll\nC\nF\n\nH\n\n\fTable 2.\nInstrument\n\nPapers and Citations by Instrument.\nPapers/night\n\nFCC/paper\n\nFCC/Night\n\n358\n169\n75\n64\n49\n34\n24\n21\n18\n\n0.36\n0.25\n0.19\n0.16\n0.24\n0.24\n0.16\n0.21\n0.12\n\n35.47\n28.37\n48.38\n17.28\n27.60\n29.11\n19.84\n20.76\n26.82\n\n12.86\n6.97\n9.92\n2.70\n6.61\n6.86\n3.11\n4.45\n3.24\n\nDirect Imaging\nCoudé Spectrograph\nMulti-Object Spectrograph\nFourier Transform Spectrometer\nHRcama\nHerzberg Spectrograph\nFabry-Perot\nAdaptive Optics near-IR imaging\nSISb\na tip-tilt\n\nstablized imager\n\nb tip-tilt\n\nstablized imager/spectrograph\n\n– 18 –\n\nPapers\n\n\fTable 3.\n\nTotal\n\nHutchings, J.\nDavidge, T.\nNieto, J-L.\nLe Fèvre, O.\nKormendy, J.\nBoesgaard, A.\nCrampton, D.\nRicher, H.\nHarris, W.\n\n38\n35\n16\n15\n14\n13\n13\n13\n12\n\nPapers\nApJ A&A AJ\n6\n12\n11\n3\n12\n1\n3\n10\n3\n\n0\n0\n0\n9\n2\n0\n1\n1\n6\n\n21\n19\n1\n0\n0\n0\n7\n0\n2\n\nPASP\n\nTotal\n\nCitations\nper Paper\n\n8\n1\n0\n0\n0\n3\n2\n0\n0\n\n909\n310\n282\n333\n719\n577\n200\n423\n389\n\n23.9\n8.9\n17.6\n22.2\n51.4\n44.4\n15.4\n32.5\n32.4\n\nFCC\n1106\n492\n333\n525\n1024\n682\n239\n515\n513\n\n– 19 –\n\nAuthor\n\nCFHT's Most Prolific Authors.\n\n\fTable 4. CFHT's Most Highly Cited Papers.\nAuthors\nLilly et al. (1995)\nLilly et al. (1991)\nLilly et al. (1996)\nMcCarthy et al. (1987)\nCarlberg et al. (1996)\nSpite & Spite (1982)\nCowie et al. (1996)\nKormendy (1985)\n\nPierce et al. (1994)\n\nThe Canada-France Redshift Survey. VI. Evolution of the Galaxy Luminosity Function to Z ≈ 1\nA Deep Imaging and Spectroscopic Survey of Faint Galaxies\nThe Canada-France Redshift Survey: The Luminosity Density and Star\nFormation History of the Universe to Z ≈ 1\nA Correlation Between the Radio and Optical Morphologies of Distant 3CR\nRadio Galaxies\nGalaxy Cluster Virial Masses and Omega\nAbundance of Lithium in Unevolved Halo Stars and Old Disk Stars - Interpretation and Consequences\nNew Insight on Galaxy Formation and Evolution From Keck Spectroscopy\nof the Hawaii Deep Fields\nFamilies of Ellipsoidal Stellar Systems and the Formation of Dwarf Elliptical Galaxies\nDetection of Systematic Gravitational Lens Galaxy Image Alignments Mapping Dark Matter in Galaxy Clusters\nThe Hubble Constant and Virgo Cluster Distance from Observations of\nCepheid Variables\n\n– 20 –\n\nTyson et al. (1990)\n\nTitle\n\n\f"}