{"id": "http://arxiv.org/abs/astro-ph/0310077v1", "guidislink": true, "updated": "2003-10-02T21:28:24Z", "updated_parsed": [2003, 10, 2, 21, 28, 24, 3, 275, 0], "published": "2003-10-02T21:28:24Z", "published_parsed": [2003, 10, 2, 21, 28, 24, 3, 275, 0], "title": "Searching for the Intra-Group Medium in Loose Groups of Galaxies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0310213%2Castro-ph%2F0310422%2Castro-ph%2F0310334%2Castro-ph%2F0310141%2Castro-ph%2F0310169%2Castro-ph%2F0310501%2Castro-ph%2F0310113%2Castro-ph%2F0310632%2Castro-ph%2F0310274%2Castro-ph%2F0310485%2Castro-ph%2F0310400%2Castro-ph%2F0310309%2Castro-ph%2F0310399%2Castro-ph%2F0310338%2Castro-ph%2F0310646%2Castro-ph%2F0310897%2Castro-ph%2F0310619%2Castro-ph%2F0310682%2Castro-ph%2F0310090%2Castro-ph%2F0310267%2Castro-ph%2F0310490%2Castro-ph%2F0310231%2Castro-ph%2F0310283%2Castro-ph%2F0310232%2Castro-ph%2F0310030%2Castro-ph%2F0310892%2Castro-ph%2F0310054%2Castro-ph%2F0310285%2Castro-ph%2F0310546%2Castro-ph%2F0310024%2Castro-ph%2F0310788%2Castro-ph%2F0310112%2Castro-ph%2F0310884%2Castro-ph%2F0310887%2Castro-ph%2F0310688%2Castro-ph%2F0310566%2Castro-ph%2F0310375%2Castro-ph%2F0310210%2Castro-ph%2F0310160%2Castro-ph%2F0310325%2Castro-ph%2F0310593%2Castro-ph%2F0310167%2Castro-ph%2F0310405%2Castro-ph%2F0310320%2Castro-ph%2F0310208%2Castro-ph%2F0310487%2Castro-ph%2F0310738%2Castro-ph%2F0310369%2Castro-ph%2F0310530%2Castro-ph%2F0310382%2Castro-ph%2F0310355%2Castro-ph%2F0310653%2Castro-ph%2F0310549%2Castro-ph%2F0310853%2Castro-ph%2F0310647%2Castro-ph%2F0310240%2Castro-ph%2F0310917%2Castro-ph%2F0310540%2Castro-ph%2F0310741%2Castro-ph%2F0310622%2Castro-ph%2F0310538%2Castro-ph%2F0310239%2Castro-ph%2F0310613%2Castro-ph%2F0310230%2Castro-ph%2F0310469%2Castro-ph%2F0310251%2Castro-ph%2F0310663%2Castro-ph%2F0310699%2Castro-ph%2F0310349%2Castro-ph%2F0310464%2Castro-ph%2F0310478%2Castro-ph%2F0310723%2Castro-ph%2F0310282%2Castro-ph%2F0310277%2Castro-ph%2F0310771%2Castro-ph%2F0310354%2Castro-ph%2F0310384%2Castro-ph%2F0310270%2Castro-ph%2F0310175%2Castro-ph%2F0310003%2Castro-ph%2F0310077%2Castro-ph%2F0310040%2Castro-ph%2F0310507%2Castro-ph%2F0310136%2Castro-ph%2F0310117%2Castro-ph%2F0310491%2Castro-ph%2F0310750%2Castro-ph%2F0310122%2Castro-ph%2F0310352%2Castro-ph%2F0310841%2Castro-ph%2F0310573%2Castro-ph%2F0310625%2Castro-ph%2F0310670%2Castro-ph%2F0310825%2Castro-ph%2F0310216%2Castro-ph%2F0310238%2Castro-ph%2F0310075%2Castro-ph%2F0310499%2Castro-ph%2F0310053%2Castro-ph%2F0310572%2Castro-ph%2F0310850&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Searching for the Intra-Group Medium in Loose Groups of Galaxies"}, "summary": "We have conducted a study with the VLA, DRAO Synthesis Telscope, and the FUSE\nsatellite to search for the intra-group medium in two loose groups of galaxies:\nGH 144 and GH 158. No HI was detected near the background AGN in GH 158,\nhowever two previously unknown dwarf galaxies were detected in GH 144.\nLyman-alpha, -beta, CIII and NV absorption was detected in GH 144 by FUSE.\nUsing this data and previously published data we found that the virial mass of\nGH 144 is 2x10^12 M(sun). Of this 8% lies in the individual group galaxies, and\nless than 8% is in the dense neutral intra-group medium. From our absorption\nline data we constrain the diffuse IGM to have a volume density greater than\nlog n = -5.2 in a layer less than 22 kpc thick assuming a metallicity of 0.4\nsolar. While these values are uncertain, it is unlikely that this diffuse gas\ncontributes a significant fraction of the group mass. Given the depth of the\nabsorbing material and its separation from the nearest galaxies, it seems most\nlikely it originates from a small-clump in the IGM, perhaps an ionized\nhigh-velocity cloud. (abridged)", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0310213%2Castro-ph%2F0310422%2Castro-ph%2F0310334%2Castro-ph%2F0310141%2Castro-ph%2F0310169%2Castro-ph%2F0310501%2Castro-ph%2F0310113%2Castro-ph%2F0310632%2Castro-ph%2F0310274%2Castro-ph%2F0310485%2Castro-ph%2F0310400%2Castro-ph%2F0310309%2Castro-ph%2F0310399%2Castro-ph%2F0310338%2Castro-ph%2F0310646%2Castro-ph%2F0310897%2Castro-ph%2F0310619%2Castro-ph%2F0310682%2Castro-ph%2F0310090%2Castro-ph%2F0310267%2Castro-ph%2F0310490%2Castro-ph%2F0310231%2Castro-ph%2F0310283%2Castro-ph%2F0310232%2Castro-ph%2F0310030%2Castro-ph%2F0310892%2Castro-ph%2F0310054%2Castro-ph%2F0310285%2Castro-ph%2F0310546%2Castro-ph%2F0310024%2Castro-ph%2F0310788%2Castro-ph%2F0310112%2Castro-ph%2F0310884%2Castro-ph%2F0310887%2Castro-ph%2F0310688%2Castro-ph%2F0310566%2Castro-ph%2F0310375%2Castro-ph%2F0310210%2Castro-ph%2F0310160%2Castro-ph%2F0310325%2Castro-ph%2F0310593%2Castro-ph%2F0310167%2Castro-ph%2F0310405%2Castro-ph%2F0310320%2Castro-ph%2F0310208%2Castro-ph%2F0310487%2Castro-ph%2F0310738%2Castro-ph%2F0310369%2Castro-ph%2F0310530%2Castro-ph%2F0310382%2Castro-ph%2F0310355%2Castro-ph%2F0310653%2Castro-ph%2F0310549%2Castro-ph%2F0310853%2Castro-ph%2F0310647%2Castro-ph%2F0310240%2Castro-ph%2F0310917%2Castro-ph%2F0310540%2Castro-ph%2F0310741%2Castro-ph%2F0310622%2Castro-ph%2F0310538%2Castro-ph%2F0310239%2Castro-ph%2F0310613%2Castro-ph%2F0310230%2Castro-ph%2F0310469%2Castro-ph%2F0310251%2Castro-ph%2F0310663%2Castro-ph%2F0310699%2Castro-ph%2F0310349%2Castro-ph%2F0310464%2Castro-ph%2F0310478%2Castro-ph%2F0310723%2Castro-ph%2F0310282%2Castro-ph%2F0310277%2Castro-ph%2F0310771%2Castro-ph%2F0310354%2Castro-ph%2F0310384%2Castro-ph%2F0310270%2Castro-ph%2F0310175%2Castro-ph%2F0310003%2Castro-ph%2F0310077%2Castro-ph%2F0310040%2Castro-ph%2F0310507%2Castro-ph%2F0310136%2Castro-ph%2F0310117%2Castro-ph%2F0310491%2Castro-ph%2F0310750%2Castro-ph%2F0310122%2Castro-ph%2F0310352%2Castro-ph%2F0310841%2Castro-ph%2F0310573%2Castro-ph%2F0310625%2Castro-ph%2F0310670%2Castro-ph%2F0310825%2Castro-ph%2F0310216%2Castro-ph%2F0310238%2Castro-ph%2F0310075%2Castro-ph%2F0310499%2Castro-ph%2F0310053%2Castro-ph%2F0310572%2Castro-ph%2F0310850&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have conducted a study with the VLA, DRAO Synthesis Telscope, and the FUSE\nsatellite to search for the intra-group medium in two loose groups of galaxies:\nGH 144 and GH 158. No HI was detected near the background AGN in GH 158,\nhowever two previously unknown dwarf galaxies were detected in GH 144.\nLyman-alpha, -beta, CIII and NV absorption was detected in GH 144 by FUSE.\nUsing this data and previously published data we found that the virial mass of\nGH 144 is 2x10^12 M(sun). Of this 8% lies in the individual group galaxies, and\nless than 8% is in the dense neutral intra-group medium. From our absorption\nline data we constrain the diffuse IGM to have a volume density greater than\nlog n = -5.2 in a layer less than 22 kpc thick assuming a metallicity of 0.4\nsolar. While these values are uncertain, it is unlikely that this diffuse gas\ncontributes a significant fraction of the group mass. Given the depth of the\nabsorbing material and its separation from the nearest galaxies, it seems most\nlikely it originates from a small-clump in the IGM, perhaps an ionized\nhigh-velocity cloud. (abridged)"}, "authors": ["D. J. Pisano", "Bart Wakker", "Eric Wilcots", "Dirk Fabian"], "author_detail": {"name": "Dirk Fabian"}, "author": "Dirk Fabian", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/380217", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0310077v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0310077v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "to appear in the January 2004 Astronomical Journal", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0310077v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0310077v1", "journal_reference": null, "doi": "10.1086/380217", "fulltext": "Searching for the Intra-Group Medium in Loose Groups of Galaxies.\nD.J. Pisano1,2\nAustralia Telescope National Facility, P.O. Box 76, Epping NSW 1710, Australia\nBart P. Wakker, Eric M. Wilcots, & Dirk Fabian\n\narXiv:astro-ph/0310077v1 2 Oct 2003\n\nAstronomy Department, University of Wisconsin - Madison\n475 N. Charter St., Madison, WI 53706\nABSTRACT\nWe have conducted a study with the VLA, the DRAO ST, and the FUSE satellite\nto search for the intra-group medium in two loose groups of galaxies: GH 144 and GH\n158. The VLA observations provide a census of the dense H I content of these groups\nin the form of individual galaxies and free-floating H I clouds as traced by the 21-cm\nH I line, while the FUSE observations trace the diffuse neutral and hot ionized gas that\nmay fill the intra-group medium, populate the halos of individual galaxies, or reside in\na skin around denser, neutral clouds. While nothing was detected in GH 158, in GH\n144 we detected two previously unknown H I-rich low-surface brightness group galaxies.\nIn addition, Ly-α, Ly-β, C III and N V were detected towards GH 144. Using this suite\nof data, we were able to place limits on the mass of various portions of this group. If\nvirialized, GH 144 has a mass of 2×1012 M⊙ . Of that mass, 8% lies in the individual\ncatalogued galaxies, and no more than that same fraction again could lie in the dense,\nneutral medium as constrained by our VLA observations. The absorption lines imply\na diffuse gas with a volume density greater than 10−5.2 cm−3 from a layer less than 22\nkpc thick, assuming a metallicity of 0.4 Z⊙ . While the extent of this gas is uncertain, it\nseems unlikely that this diffuse gas contributes a significant fraction of the group mass.\nGiven the depth of the absorbing material, and its separation from the nearest galaxies,\nit seems most likely that it originates from a small clump in the intra-group medium;\nperhaps an ionized high-velocity cloud, but it may be associated with one of our new\nH I detections. This was an ambitious first attempt to search for the IGM in emission\nand absorption, and while it was only partially successful we show what is possible and\nwhat more is needed for its success.\nSubject headings: Galaxies: formation - intergalactic medium - quasars: absorption\nlines\n1\n\nNSF MPS Distinguished International Postdoctoral Research Fellow\n\n2\n\nemail: DJ.Pisano@csiro.au\n\n\f–2–\n1.\n\nIntroduction\n\nThe vast majority of galaxies, including the Milky Way, reside in poor groups: collections of\na few large (∼ L∗ ) and tens of smaller galaxies (Tully 1987). Long known to be the basic building\nblocks of large scale structure, the importance of understanding galaxy groups has grown with\npossibility that groups may contain most of the baryons in the Universe in the hot phase of their\nintragroup medium (e.g. Tripp & Savage 2000, Tripp, Savage, & Jenkins 2000). Loose groups also\nrepresent a laboratory for the study of structure formation. While some groups may still be in the\nprocess of forming themselves (Zabludoff & Mulchaey 1998), they may also host ongoing galaxy\nformation. Analogs to the high velocity clouds seen around the Milky Way may exist in other\ngroups and represent material falling onto galaxies for the first time (see Wakker & van Woerden\n1997 and references therein for further discussion). Furthermore, Blitz et al. (1999) and Braun\n& Burton (1999, 2000) have argued that an important subset of high velocity clouds lie at large\ndistances and, therefore, represent the large population of \"mini-halos\" predicted in Cold Dark\nMatter (CDM) models of structure formation.\nThe basic problem is that the baryon density in the local Universe derived from stars, neutral\nhydrogen, molecular hydrogen, and hot X-ray emitting gas represents less than a third of the\nbaryon density observed at high redshift (z >> 2) in the Lyα forest (e.g. Fukugita, Hogan, &\nPeebles 1998). A large fraction of the \"missing\" baryons could lie in a diffuse, warm intergalactic\nmedium with temperatures of 105 − 107 K, as predicted by a number of hydrodynamic simulations\nof galaxy and structure formation (e.g. Cen et al. 1995, Davé et al. 2001). While such gas would\nbe extraordinarily difficult to detect in emission, it is evident in absorption. Tripp et al. (2000) and\nTripp & Savage (2000) used STIS (Space Telescope Imaging Spectrograph) observations of OVI\nλλ1032, 1038 absorbers to suggest that most of the baryons in the local Universe do reside in this\nwarm component in the intragroup medium. Follow-up simulations by Cen et al. (2001) suggest\nthat this warm intergalactic medium should be pervasive and is a natural outcome of the growth\nof large scale structure.\nOne question that arises is whether or not there is any neutral gas associated with the recently\ndetected O VI absorbers in the intergalactic medium in nearby groups; for example, does the O\nVI absorption arise in the extended halos of individual galaxies, or is it associated with the outer\nedges of intergalactic HI clouds? There is a long history of efforts to correlate Lyα absorption line\nsystems with known galaxies or intergalactic 21 cm line H I emission with mixed success (e.g. van\nGorkom et al. 1996). While some teams (e.g. Lanzetta et al. 1995) claim that the majority of\nnearby Lyα absorbers probe the extended gaseous halos of individual galaxies, others (e.g. Tripp,\nLu, & Savage 1998, Stocke et al. 1995) find no correlation between nearby absorption line systems\nand individual galaxies. Simulations of structure formation suggest that absorption line systems\nand individual galaxies reside in the same large-scale filaments (Davé et al. 1999). More recently,\nPenton, Stocke, & Shull (2002) found that nearly a quarter of nearby Lyα absorbers arise in galaxy\nvoids and that absorbers cluster more weakly than galaxies. The detection of O VI absorption in\nnearby groups affords us the opportunity for a sensitive search for intergalactic H I emission in the\n\n\f–3–\nsame groups. Such emission may be related to the high- velocity clouds seen around the Milky\nWay, and perhaps throughout the Local Group.\nIn and near our Galaxy, H I with velocities deviating from differential galactic rotation is\nvery common. Historically, gas clouds with large non-rotational velocities (|vLSR |>100 km s−1 )\nhave been called \"high-velocity clouds\" (HVCs). It is now known that these represent a variety of\nphenomena (see Wakker & van Woerden 1997 for a review). Some HVCs are probably related to\na galactic fountain (Shapiro & Field 1976, Bregman 1980); some are tidal debris connected to the\nMagellanic Stream (e.g. Putman et al. 2003) or other satellites (e.g. Lockman 2003); some may\nbe infalling intergalactic gas (e.g. Complex C; Wakker et al. 1999, Richter et al. 2001, Tripp et al.\n2003); and some may be associated with dark matter halos and be the remnants of the formation\nof the Local Group (e.g. Blitz et al. 1999, Braun & Burton 1999, de Heij et al. 2002). There is\nsome variation between models in this last scenario. Blitz et al. (1999) suggest that all HVCs reside\nat distances of ∼ 1 Mpc and have H I masses of ∼107 M⊙ , which is only a small fraction of their\ntotal mass. In contrast, Braun & Burton (1999) proposed that only compact HVCs (CHVCs) are\nat large distances. Best fit models of this scenario by de Heij et al. (2002), suggest the clouds have\nmasses of 105.5 to 107 M⊙ , sizes of ∼2 kpc, and are distributed within 150-200 kpc of the Milky\nWay and M31.\nA strong test of the models proposed by Blitz et al. (1999), Braun & Burton (1999) and de Heij\net al. (2002) is to ask \"would one expect to see similar H I clouds in other galaxy groups?\". While\nH I clouds with masses predicted by Blitz et al. (1999) should be easily detected in other nearby\ngroups, only the higher mass clouds of Braun & Burton (1999) and de Heij et al. (2002) would be\nvisible. More importantly, however, for cloud sizes of ∼2 kpc and typical peak H I column densities\nof 1019 cm−2 , the average volume density is ∼10−3 cm−3 . At such low volume and column densities\none expects that most of the hydrogen is ionized by the extra-galactic radiation field and thus the\nH I represents the tip of the iceberg. Such clouds could be more easily detected in absorption.\nIn this paper we set out to address both the nature of the IGM in groups similar to the Local\nGroup and the nature of HVCs in these groups and, by analogy, in the Local Group. Our approach\nis to search parts of two loose groups of galaxies for HI emission associated with HVC analogs and\nto search for evidence of hot gas in the same groups via FUSE spectra along lines of sight through\nthe same areas. In this way, we should be able to detect both the neutral and ionized components\nof any IGM present in these two groups. By obtaining both sets of data we should also be able to\ninfer whether hot gas is associated with the halos of individual galaxies, with clumps of material\nin the IGM potentially analogous to HVCs, or with the group as a whole. If there is HI emission\nassociated with absorbing systems, then we can accurately derive a metallicity for these objects\nand compare that with HVCs around the Milky Way and throughout the Local Group.\nThe paper is laid out as follows. In Section 2, we explain how the two groups were selected\nand describe their known properties. Section 3 discusses the VLA and FUSE observations of these\ngroups. We present the resulting data in Section 4, and discuss the implications for the IGM and\n\n\f–4–\nHVCs and our future plans in Section 5.\n\n2.\n\nSample Selection\n\nIn order to simultaneously study dense neutral gas in emission and diffuse neutral and ionized\ngas in absorption, we required the fortunate alignment of a galaxy hosting an active galactic nucleus\n(AGN) to serve as a probe of a foreground loose group of galaxies. Furthermore the AGN needs to\nbe bright enough in the ultraviolet to observe with FUSE. We selected probes from Veron-Cetty\n& Veron (1998) with bright far-ultraviolet fluxes, Fλ1000 ≥2×10−14 ergs s−1 cm−2 Å−1 , which\nwere within 2◦ of the center of a galaxy group from the CfA group catalog (Geller & Huchra\n1983, hereafter GH83). Upon individual investigation of the resulting groups, we selected two loose\ngroups and two probes to observe: GH 144 and GH 158 with Mrk 817 and Mrk 290 behind them.\nThe known properties of these groups are discussed below.\n\n2.1.\n\nGH 144 – Mrk 817\n\nGH83 list GH 144 as being composed of the 3 galaxies listed in Table 1: NGC 5631 (E), NGC\n5667 (Scd), and NGC 5678 (Sb). GH 144 is located at a velocity of ∼1945 km s−1 ; within 1000\nkm s−1 and 6◦ of its center, an additional 11 galaxies are listed in NED3 some of which may be\npart of the group. The location of these galaxies, plus a few others and Mrk 817 are shown in\nFigure 1. While this is a generous range, it assures that we have included all group members in the\nplot. When corrected for Virgocentric infall by GH83, the velocity of the group is 2319 km s−1 .\nAssuming H0 =65 km s−1 Mpc−1 , the group is at a distance of 36 Mpc. At 36 Mpc, 1◦ is 628 kpc.\nMrk 817 is located at a projected distance of ∼650 kpc from the group center and 370 kpc from\nthe nearest galaxy, UGC 9391. This sightline is closer to the group center than many of the group\ngalaxies. Gas detected in absorption towards Mrk 817 could be associated with the group potential\nor individual galaxies.\n\n2.2.\n\nGH 158 – Mrk 290\n\nGH 158 is composed of at least the 5 galaxies listed in Table 2 (GH83): NGC 5981 (Sbc), NGC\n5982 (E), NGC 5985 (Sb), NGC 5987 (Sb), and NGC 5989 (Sc), with an additional 10 galaxies\nwithin 1000 km s−1 and 6◦ cataloged in NED. The location of these galaxies, plus a few others and\nMrk 290 are shown in Figure 2. With a Virgo-infall corrected velocity of 3147 km s−1 , GH 158\nhas a distance of 48 Mpc. At this distance, 1◦ = 837 kpc. Mrk 290 is at a projected distance of ∼1\n3\n\nThe NASA/IPAC Extragalactic Database (NED) is operated by the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and Space Administration.\n\n\f–5–\nMpc from the group center and 480 kpc from the nearest galaxy: NGC 5987. This sightline probes\nthe outskirts of the group, so it is more likely that any hot gas seen is associated with a previously\nunidentified individual galaxy rather than with the group potential.\n\n3.\n3.1.\n\nObservations\nVLA Observations\n\nWe observed portions of the loose groups GH 144 and GH 158 in the 21 cm line of H I with\nthe Very Large Array4 in its compact D configuration. For GH 144, the VLA pointing is centered\non Mrk 817, while for GH 158, the pointing is between Mrk 290 and NGC 5987. The groups were\nobserved on 19 and 20 August, 2000 for approximately 8.5 hours each. The fields were observed\nusing split intermediate-frequencies (IF) in 4 IF mode. This yielded a velocity resolution of ∼5.2\nkm s−1 over a total bandwidth of ∼600 km s−1 . Flux calibration was done via observations of\n3C147 and 3C295. Throughout the observations of the groups, we interspersed observations of\nsecondary phase calibrators about once per hour.\nCalibration and reduction was carried out using AIPS in the usual manner. As our observations\nwere taken almost entirely during daylight, there was a lot of solar interference present throughout\nour data. Thus, we had to aggressively flag our data; as much as 15% of the data was discarded,\nalmost all of which was on the shortest baselines. Each individual IF was continuum subtracted\nin the uv-plane with UVLIN using line-free channels near the end of each cube. The continuumsubtracted data was then CLEANed and mapped using a robust weighting scheme (albeit close to\nnatural weighting) in the AIPS task IMAGR. The resulting data cubes for each IF were then glued\ntogether to form a final 600 km s−1 wide cube. For each field we mapped a region of 1◦ in diameter,\nout to 1% of the peak sensitivity of the primary beam of the VLA. The resulting properties of the\ndata cubes are listed in Table 3.\nOur final cubes had synthesized beamsizes of 58′′ and 1σ sensitivities of 0.7 mJy/Beam and 0.5\nmJy/Beam at the centers of the primary beams. This translates into a 1 σ MHI sensitivity of 106 M⊙\nper channel and column density sensitivities of 1.2×1018 cm−2 per channel and 8.5×1017 cm−2 per\nchannel for GH 144 and GH 158, respectively. The sensitivity of our observations is worse by a\nfactor of two at a radius of 15′ , by a factor of 4 at a radius of 21.8′ , and is 42× worse at 32′ , the\nedge of our cubes. For both groups we searched for H I features not only in these cubes, but also\nin cubes smoothed in both velocity and spatially. The smoothed cubes had noise levels reduced by\nup to 40% of their original value.\n4\n\nThe Very Large Array (VLA) is part of the National Radio Astronomy Observatory, which is a facility of the\nNational Science Foundation, operated under cooperative agreement by Associated Universities, Inc..\n\n\f–6–\n3.2.\n\nDRAO Observations\n\nAdditional H I observations of GH 158 were made with the Dominion Radio Astrophysical\nObservatory (DRAO) Synthesis Telescope (ST) at Penticton (Canada) in July and August 2001.\nThis instrument consists of seven 9-m radio antennae on an east-west line with a maximum spacing\nof 600-m. For a more detailed description of the telescope see Landecker et al. (2000). Observations\nwere carried out by the staff at DRAO. A \"complete survey\" was made by combining observations\nfrom 12 different configurations, with each configuration making a full 12 hour observation of the\nfield. The resulting visibility data were edited and calibrated by the observatory staff, who also\nproduced the initial raw data cube.\nTo set the flux scale of the data, we compare the fluxes of continuum sources in the data\ncube with those in a \"matched continuum\" map produced by the observatory staff. This \"matched\ncontinuum\" is from a continuum channel away from the line emission and has better determined\nfluxes than the line data. Examining continuum sources in the line-free regions of the data cube\nshow that the continuum is flat across the bandwidth to within 5%. The continuum subtracted\ndata cube was produced by scaling the data cube to match the continuum source fluxes and then\nsubtracting the \"matched continuum\" map from the data cube. This is the standard procedure\nfor continuum subtraction of DRAO ST data. Because of the dense sampling of the uv-plane by\nthe ST, the sidelobe level is quite low (≤4%). This fact combined with the relatively low dynamic\nrange of the data means that CLEANing is not necessary.\nThe resulting data have a beamsize of 70′′ x 59′′ , over a field of view of 2.5◦ . The characteristics\nof the DRAO observations are summarized in Table 3. The DRAO sensitivity was 25× worse than\nthe VLA observations of the same field. As for the VLA data, we searched for H I emission in this\ndata cube and in ones which had been smoothed in velocity and spatially. Again, the smoothed\ncubes had noise levels reduced by up to 40% of that in the original cubes.\n\n3.3.\n\nFUSE Observations\n\nA full description of the Far Ultraviolet Spectroscope Explorer (FUSE) satellite and its detectors is given by Moos et al. (2000) and Sahnow et al. (2000). Our data were taken from the\nsurvey of Wakker et al. (2003). These authors describe the steps in the data reduction, which\nwe now summarize. First the data are screened to remove bad intervals, then they are corrected\nfor satellite and detector motion, extracted, and wavelength and flux calibrated. The result is a\nspectrum for each of 8 detector segments. Four of these (LiF1A, LiF2B, SiC1A and SiC2B) cover\nthe wavelength range near Lyβ (1025.722 Å), but the SiC channels are much noisier than the LiF\nchannels. For spectra with high S/N ratio it is preferable to use only the LiF1A data, whereas\nfor noisier spectra the S/N ratio can be substantially improved by combining LiF1A and LiF2B.\nWakker et al. (2003) further describe how to align the FUSE spectra using H I data, and how to\nremove the contaminating H2 lines at 1031.191 and 1032.356 Å. This data has been recalibrated\n\n\f–7–\nwith the newest version (v.2.1.7) of the FUSE data pipeline, yielding an improved wavelength scale\ncompared to Wakekr et al. (2003).\nMrk 817 is relatively bright near 1030 Å (a flux of 9.4×10−14 erg cm−2 s−1 Å−1 (the 16th\nhighest in the FUSE sample) and two long observations are available, 76.3 and 86 ksec in length.\nThe final spectrum presented by Wakker et al. (2003) has a signal-to-noise ratio in the LiF1A\nchannel of 28.8 per 20 km s−1 resolution element near 1030 Å which is the third highest in the\nsample. On the other hand, Mrk 290 is relatively faint (94th in the FUSE sample) and only a short\n(12.8 ksec) integration is available, yielding a final S/N ratio in the combined LiF1A+LiF2B data\nof just 4.4 per resolution element.\nFor Mrk 817 HST-GHRS (the Goddard High Resolution Spectrograph on the Hubble Space\nTelescope) data are also available, from HST program 6593, PI Stocke. These data were analyzed\nin detail by Penton et al. (2000).\n\n4.\n4.1.\n\nResults\n\nGH 158-Mrk 290\n\nFor our observations of GH 158, we chose the VLA field so that Mrk 290 was near the center of\nthe field, yet we would still have the nearest galaxy, NGC 5987, within the 1◦ field. Unfortunately,\nthis still places NGC 5987 near the edge of our field, where the sensitivity has dropped off to 1% of\nthe peak sensitivity, and it was undetected. To enhance our sensitivity we Hanning smoothed our\ndata in steps up to 42 km s−1 resolution and with a Gaussian filter up to 2′ and 3′ resolution to\nbest match the optical size of galaxies in the field. While the data was up to 2.5× more sensitive,\nno H I emission was seen in this or our original VLA data.\nFor the DRAO pointing we chose to center the larger field between the group center and Mrk\n290, so that 7 group galaxies lie within the half power radius of the primary beam. No signature\nof H I emission was present for any of the galaxies in this data. Hanning smoothing by up to 8× in\nvelocity and Gaussian smoothing to a resolution of 2′ did not reveal any emission despite improving\nour sensitivity by 2.5×. While two group galaxies, NGC 5985 and NGC 5987, have previously been\ndetected in H I, their expected fluxes of 35.1 Jy km s−1 and 21.9 Jy km s−1 over velocity widths\nof 500 km s−1 and 550 km s−1 respectively (Huchtmeier & Richter 1989), imply an average flux\nbelow the 2σ level. While the \"horns\" of their double-horned profile may be higher than this, most\nof the flux would be at even lower significance. The large velocity width of the two galaxies may\nalso mean that not all of the emission is contained in our bandwidth. Clearly, more time spent\nobserving this field, preferably with a larger bandwidth but similar velocity resolution, would be\nbeneficial in detecting any H I present.\nFigure 3 shows the Lyβ, Lyγ, O VIλ1031.926, O VIλ1037.617 and C IIIλ977.200 lines in the\nspectrum of Mrk 290, for a ±500 km s−1 velocity range centered around the average heliocentric\n\n\f–8–\nvelocity of GH158, 2850 km s−1 . There is no Lyβ associated with GH158 with v < 2800 km s−1 ,\nand any absorption at higher velocities would be confused with Galactic C II and C II∗ absorption.\nThe Lyγ and C III data are very noisy (S/N∼1), although there may be a hint of C III absorption\nnear 2600 km s−1 . Intra-group O VI λ1031.926 would fall at the velocity of geocoronal O I*\nλ1040.943 emission. Figure 3, therefore, shows only the O VI data taken during orbital night. Still,\nintra-group O VI at 2600 km s−1 is not apparently detected, with a detection limit of 100 mÅ, or\nNOV I <1014 cm−2 . Compared to typical values found in Galactic high-velocity clouds (<log NOV I\n>=14.0) this is not a very significant limit. In summary, the data quality is too low to derive useful\nlimits or values on the possible intergalactic absorption associated with GH158. A longer FUSE\nobservation of Mrk 290 has been allocated time for cycle 4, which will provide better sensitivity for\na more detailed study of this group.\n\n4.2.\n\nGH 144-Mrk 817\n\nOur VLA observations of GH 144 were centered on Mrk 817 and no known group galaxies\nlie in the field of view, however, we did detect 2 H I clouds in the field. Channel maps of these\ntwo detections are shown in Figures 4 & 5, and the H I spectra are shown in Figures 6 & 7. The\ncoordinates and basic properties of our detections are listed in Table 4. They have been named\nfollowing IAU guidelines using the first letter of each author's last name and their J2000 coordinates:\nPWWF J1437+5905 and PWWF J1439+5847.\nAs seen in Figures 4 & 5, PWWF J1437+5905 has a peak flux greater than 6σ, and remains\nabove 3σ for 6 channels (31 km s−1 ), while PWWF 1439+5847 has a peak flux of 5σ and spans 10\nchannels (52 km s−1 ) with a flux above 3σ for 8 of those channels. After correcting for the response\nof the primary beam, we find that both detections have beam–diluted peak column densities of\n2.6×1019 cm−2 , and H I masses of 3.4×109 M⊙ and 2.5×109 M⊙ . PWWF J1437+5905 lies on the\nedge of our bandpass, so its total velocity width and H I mass are certainly higher. Figures 8 and\n9 illustrate the probable association of both detections with optical counterparts, with unknown\nredshifts, on the Digital Sky Survey (DSS). This suggests that both objects are typical low surface\nbrightness galaxies. Neither galaxy is cataloged in NED, but both of these galaxies have been\ndetected in a shallower but wider VLA H I study of GH 144 around the sightline to Mrk 817\nconducted by McEntaffer et al. (Hibbard, 2002, private communication).\nThese galaxies are both likely members of GH 144. While PWWF J1437+5905 has a projected\nseparation from the group center of 926 kpc and 288 km s−1 , it is surrounded both spatially and\nin velocity space by other group members. PWWF J1439+5847 is also 926 kpc from the group\ncenter, but is only 100 km s−1 from the group velocity. These objects are both isolated within\nthe group residing 580 kpc and 800 kpc, and 290 km s−1 and 60 km s−1 from the nearest group\nmember respectively. Finally, both of these galaxies have a projected separation of ≥200 kpc from\nMrk 817, making them the closest group galaxies to any potential absorber.\n\n\f–9–\nFigure 10 shows the Lyα, Lyβ, Lyγ, O VIλ1031.926, O VIλ1037.617 and C IIIλ977.200 lines in\nthe UV spectrum of Mrk 817, for a velocity range of ±500 km s−1 relative to the average heliocentric\nvelocity of GH144, 1945 km s−1 . Table 5 lists the derived properties for these lines. Penton et\nal. (2000) already reported the Lyα absorption in the GHRS spectrum, and listed velocities of\n1933 and 2097 km s−1 , equivalent widths of 29±13 and 135±15 mÅ, and b-values of 34±13 and\n40±4 km s−1 . The corresponding Lyβ lines are then expected to have equivalent widths of 4±3\nand 21±3 mÅ. The weaker intergalactic line is too weak too discern in the FUSE spectrum. On\nthe other hand, for the higher-velocity Lyα line the corresponding Lyβ is clearly detected, at 2070\nkm s−1 , with an equivalent width of 25±7 mÅ. The absorption at slightly shorter wavelengths is\nlikely Galactic O VI at velocities vLSR =60–140 km s−1 which blends with the Lyβ line, however it\nmay also be O VI associated with the M101 group which lies 5◦ (800 kpc) away. The two Lyman\nlines at 2085 km s−1 lie on a curve of growth that corresponds to a b-value of 25±10 km s−1 and\nlog NHI =13.55±0.14. For the b-value of 40 km s−1 given by Penton et al. (2000), log NHI is not\nsubstantially different (13.49±0.05).\nAny redshifted O VIλ1031.926 near 2100 km s−1 is obscured by Galactic O Iλ1039.230 absorption, as well as O I geocoronal emission. The strong absorption feature near 2000 km s−1 is due\nto O I absorption in high-velocity cloud complex C (see e.g. Wakker 2001). The apparent broad\nfeature in the O VIλ1037.617 spectrum is an artifact – it is only seen in one of the two observations.\nThe detection limit in this wavelength region is ∼25 mÅ, corresponding to log NOV I <13.6.\nThe features at 2025 and 2125 km s−1 in the C III spectrum are measured at 18±5 and 9±5\nmÅ, and are likely to be intergalactic C III in GH144. A gaussian fit to the lines yields b∼8 and\n∼13 km s−1 . With these b-values, the corresponding column densities are log NCIII =12.55±0.15\nand 12.14±0.20. Despite the narrow linewidth of the low velocity component, it is also visible\nin the noisier LiF2B channel so we are confident of its reality. Note that these features does not\nalign in velocity with either the Lyα and Lyβ absorption, but the two components bracket the Lyα\ncomponent at 2097 km s−1 .\nSince the sightline to Mrk 817 passes far from any galaxies in GH144, it is likely that photoionization by the extragalactic background is the dominant source of ionization. Savage et al.\n(2002) calculated a photo-ionization model using CLOUDY (Ferland 2003 and references therein)\nassuming a standard extragalactic radiation field composed of QSOs and the cosmic microwave\nbackground for an O VI absorber at slightly higher redshift, but with a similar value for NHI (see\ntheir Fig. 7). CLOUDY estimates the column density and volume density of hydrogen (neutral\nplus ionized) based on fixing NHI , NOV I , and metallicity for a given radiation field. Using the\nSavage et al. model and assuming a metallicity of 0.4 Z⊙ , the O VI detection limit for GH144\ntoward Mrk 817 implies an ionization parameter log U < −1.1 and a total hydrogen volume density\nlog nH > −5.2. Using the derived column density and volume density, the model yields a depth, L,\nfor the absorbing gas of <22 kpc. The predicted O VI column density, and inferred depth, scales\nnon-linearly with the assumed metallicity, so that if a metallicity of 0.1 Z⊙ is assumed, the O VI\ndetection limit implies log nH > −5.6, and L < 150 kpc.\n\n\f– 10 –\nN Vλ1238.821 at a velocity of 2041 and 2106 km s−1 may be detected, with an equivalent\nwidth of 15±4 and 13±4 mÅ. Using the fitted linewidth of b=60 km s−1 , this would imply a\ncolumn density of logN V =13.1±0.2. This would imply log U ∼ −0.8. On the other hand, the\nupper limit set by the O VI non-detection implies log U < −1.1, which yields logN V <12.9. Since\nthe N V detection is very tentative this is not incompatible. Better data would obviously be useful.\nThe C IV lines are unfortunately not covered by the GHRS spectrum. At log U = −1.1 the\nprediction is log NCIV ∼13.2. Such a line would be easily detectable (optical depth ∼1) and since\nMrk 817 is bright, a high signal-to-noise spectrum can easily be obtained with HST. An accurate\nmeasurement of NCIV would allow the determination of the density of the absorbing gas.\n\n5.\n\nDiscussion & Conclusions\n\n5.1.\n\nThe mass of the IGM\n\nThe main hope of this study was to find HI emission associated with the diffuse IGM that\nproduces UV absorption lines in both groups: none was found. Our only HI detections were of two\ngalaxies in the GH 144 group. We can use the non–detection of H I and the detection of the IGM in\nabsorption, along with a few assumptions regarding the size of the group, to try and place limits on\nthe total amount of gas in the IGM of GH 144. In particular we will examine what fraction of the\ntotal mass of each group could be baryonic and residing in the IGM. Because we lack high–quality\nFUSE data for GH 158, we will omit it from this excercise.\nThe first step is to determine what the total masses of each group are based on the assumption\nthat the groups are virialized. While it is very likely that most loose groups have not yet fully\ncollapsed, let alone virialized, as evidenced by the presence of substructure in many groups (e.g.\nZabludoff & Mulchaey 1998), this is the only method for determining a total group mass based on\nthe dynamics of the group. Taking the Virial theorem from Binney & Tremaine (1987):\n\nMvirial =\n\nσ 2 rg\nG\n\n(1)\n\nwhere rg is the gravitational radius of the group and σ is the three- dimensional velocity\ndispersion of the group. As these values are not equal to the observable values, we must convert\nthe equation to use values we can measure: the radial velocity dispersion and the group radius. In\nthe former case, the square of the three-dimensional velocity dispersion is traditionally assumed to\nbe three times the square of the radial velocity dispersion (i.e. the velocity dispersion is assumed\nto be isotropic): σ 2 = 3 × σr2 . Relating an observable radius to the gravitational radius is a bit\nmore uncertain, but Binney & Tremaine (1987) state that for \"many simple stellar systems\", the\nradius which contains half the mass is 40% of the gravitational radius: rmed = 0.4rg . Therefore,\nEquation 1 becomes:\n\n\f– 11 –\n\nMvirial =\n\n7.5σr2 rmed\nG\n\n(2)\n\nwhere σr is the radial velocity dispersion, and we assume rmed is half of the maximum separation\nbetween group galaxies. Taking the velocity dispersion from GH83, we have the following values\nfor rmed and σr : 925 kpc and 36 km s−1 . These values are calculated by GH83 using only those\ngalaxies they listed as group members (i.e. the bright group galaxies). As a result of not accounting\nfor the fainter population of galaxies likely present in the group, the group size and especially the\nvelocity dispersion as listed by GH83 are not as accurate as they could otherwise be. Keeping this\ncaveat in mind, we find that Mvirial is 2×1012 (σr /36kms−1 )2 M⊙ for GH 144. Is this mass mostly\nin individual galaxies or is it spread throughout the group?\nTo answer this question, we use both the virial theorem and the dynamical mass equation:\n\nMdyn =\n\n2 R\nVrot\nHI\nG\n\n(3)\n\nwhere Vrot is the rotation velocity of the galaxy (corrected for inclination) and RHI =1.7×R25 ,\nwhere R25 is the radius of the galaxy at the 25 mag arcsec−2 isophote. The factor of 1.7 is an\naverage from a sample of spiral galaxies studied by Broeils & Rhee (1997). These values for each\nlarge galaxy in the group come from the Lyon-Meudon Extragalactic Database (LEDA) and are\nlisted in Table 6. Summing the total masses of each galaxy, we find that the mass in galaxies is\n5×1011 M⊙ . This is 25% of the virial mass of each group; it will be even less if the true group\nvelocity dispersion is higher. Is the remaining the group mass in the form of diffuse gas or is it\ndark matter?\nIt is at this point where we use our observations to place limits on the mass of the IGM in\nGH 144. This can be done for the dense, yet diffuse, neutral gas traced by the H I 21-cm emission\nand the lower density diffuse ionized gas traced by the FUSE absorption line data. We must make\nassumptions regarding the area over which the IGM is spread and its filling fraction over that area\nin combination with our column density sensitivities from the 21-cm and UV observations. For\nthe H I observations, we have no a priori information to constrain the filling factor, so for starters\nwe will leave it in our results explicitly. In Table 3 the column density sensitivity of our VLA\nobservations is listed. Assuming that the areas we observed are typical of the group as a whole (in\nthat the H I is uniformly distributed), taking a 5σ detection limit at the center of the primary beam,\nand integrating over an area with a radius equal to rmed while explicitly listing the dependence on\nthe number channels our limits are:\nMHI (GH144) ≤ 1.3 × 1011 ×\n\n√\n\nn×f\n\n(4)\n\nwhere n is the number of channels the signal is distributed across and f is the filling fraction.\nAssuming that f = 1 and taking the velocity dispersion of the group (36 km s−1 ) the mass limit\n\n\f– 12 –\nbecomes 3×1011 M⊙ , or less than 67% of the mass in individual galaxies and less than 15% of the\nvirial mass of the group. With the assumptions regarding the filling factor for the group and the\nupper limit on the H I column density, this is a highly uncertain value. Nevertheless, the presence\nof only weak Lyman-α absorption implies a very low filling fraction of dense neutral gas in the\ngroup. Some of the diffuse gas in these groups may be hot and ionized, so we must look to our UV\nabsorption line data for limits on its contribution to the total mass of the group.\nTo obtain the total potential gas mass of the groups, we must carry out the same exercise for\nthe diffuse warm and hot ionized gas traced by the UV absorption lines as well. In Section 4.2,\nwe discuss how we determine the density and size scale for the hot gas in GH 144. The O VI line\nconstrains the density to be greater than 10−5.2 cm−3 for a metallicity of 0.4 Z⊙ . This volume\ndensity, combined with the column density of hydrogen, provides a size scale of <22 kpc. So, if\nthis absorbing gas comes from a cloud with a 22 kpc diameter and a filling fraction of 0.5 (based\non the number of groups with absorbing gas discussed in Wakker et al., in preparation), then the\nmass of the cloud is 4×105 M⊙ ; a negligible fraction of the group mass. If the metallicity of the gas\nwas only 0.1 Z⊙ , then the size scale increases to <150 kpc, and the mass of a cloud with this size\nis ∼107 M⊙ ; still a negligible fraction of the group mass.\nWhat if the absorbing gas comes from a thin sheet of hot gas spread throughout the group?\nTaking a depth of 22 kpc, and a diameter of 1.85 Mpc, then we get a mass of 4×109 M⊙ for our\noriginal volume density. In any case, in order to increase the mass contribution of this gas to the\ngroup mass we must increase the density, but this would imply a smaller region from which the\nabsorption originates. While this is just one line of sight through the group, it seems unlikely that\nthis absorbing gas contributes any significant mass to the IGM. Multiple lines of sight through this\ngroup and further studies of other groups similar to GH 144 will help determine if this is a atypical\nline-of-sight, or if more groups lack diffuse gas. The absence of a significant amount of warm to\nhot diffuse gas in the IGM of GH 144 is contradictory to both the predictions of models (e.g. Cen\net al. 2001, Davé et al. 2001) and observations towards other groups (e.g. Tripp & Savage 2000,\nTripp et al. 2000). Instead, it appears that the majority of the mass outside of galaxies in GH 144\ncan not be identified as diffuse neutral or hot gas, but may have to accounted for as dark matter.\n\n5.2.\n\nWhat is the source of the UV absorption lines?\n\nAs discussed in the Introduction, it is a matter of some debate whether Lyman- α and O VI\nabsorbers originate in the extended gaseous halos of galaxies (e.g. Lanzetta et al. 1995, Savage\net al. 2003), as the ionized layer of intergalactic H I clouds analogous to HVCs (e.g. Sembach et al.\n2000), from the intra-group medium (e.g. Tripp & Savage 2000, Tripp et al. 2000), or as part of\nlarge-scale filaments (e.g. Davè et al. 1999). One goal of this project was to examine the relation\nbetween H I emission and UV absorption line systems to address this question.\nSince the UV data for Mrk 290 is not of particularly high quality, we will focus our discussion\n\n\f– 13 –\non the data towards Mrk 817 through the GH 144 group. Ly-α, Ly-β, and C III lines along this\nsightline as discussed above, with the more highly ionized C III bracketing one of the two Lyman-α\nlines. The lower velocity, weaker Lyman-α line has no other associated lines, but this may be due\nto our lack of sensitivity. The system of lines at ∼2100 km s−1 is consistent with what was seen\nby Wolfe & Prochaska (2000a) in Damped Lyman-α protogalaxies where the more highly ionized\nlines lie outside those of lower ionization, so while the lines do not overlap they likely originate in\nthe same gravitational potential. Wolfe & Prochaska (2000b) interpret this scenario arising from\na line-of-sight passing through a neutral disk within a hot, collapsing halo. Their tests of specific\nmodels were inconclusive, however. We may be seeing something similar to their scenario with hot\ngas condensing onto a neutral cloud in the intra-group medium, but this is certainly not the only\nexplanation.\nThe system of absorption lines towards Mrk 817 is not centered on the velocity of the group\n(1945 km s−1 ), but is offset by ∼100 km s−1 to higher velocities. If these lines are associated with\nintra-group gas, this may indicate the presence of substructure in GH 144, so that the group may\nnot yet be virialized. There is no H I emission directly associated with this absorption-line system.\nAnother possibility comes about from examining the size scale of the absorbing material. With\nthe inferred size scales of the gas being only 22 kpc, this implies we are probing the outskirts of\nthe halo of a galaxy, or part of a clumpy IGM. For example, an IGM filled with highly ionized\nHVCs. In the former case, the closest galaxies to this sightline are PWWF J1437+5905 and\nPWWF J1439+5847 which lie about 200 kpc away in projection. If the UV absorption lines are\nassociated with gas in the halo of either galaxy, then the halos must be very extended. In velocity\nspace, however, the absorbers have velocities that are consistent with the velocity width of PWWF\nJ1439+5847. The Ly-α lines are offset by -112 km s−1 and +52 km s−1 offset while the C III is -20\nkm s−1 and +71 km s−1 offset. Compare this to the velocity width at 20% of the peak value of 60\nkm s−1 , and it would not be completely unreasonable to believe that they may be associated. If\nthey are, then the total mass of the halo of PWWF J1439+5847 would be only 4×1010 M⊙ , about\n10× the H I mass of the galaxy. Given the huge physical separation, it may be more reasonable\nto assume that the absorbing gas is instead a clump associated with the IGM or the large-scale\nfilament in which the group resides (e.g. Rosenberg et al. 2003). This clumpy IGM could represent\nlow mass, mostly ionized, HVCs spread throughout the group. These would be of lower mass than\nwould be inferred based on the models of Blitz et al. (1999) and Braun & Burton (1999), but may\notherwise be analogous.\nMore sensitive H I observations and the ability to probe the absorbing gas in multiple sightlines\nthrough a single group should provide better constraints on the competing models for the source\nof the UV absorption lines.\n\n\f– 14 –\n5.3.\n\nFuture Possibilities\n\nOverall our study has been an ambitious first attempt to study the nature of the intra-group\nmedium in both emission and absorption, which has been only partially successful. It has yielded\nsome interesting insights into the relation of the diffuse warm, absorbing gas with the denser, cooler,\nneutral, emitting gas in a loose group. While it is difficult to learn much from the study of just\na couple groups, Wakker et al. (2004, in preparation) have identified other galaxy groups with\nbackground AGN suitable for this type of study. The most fundamental limitations to our study\ncome from the poor H I sensitivity to diffuse, low column density gas and the small area mapped\nwith a single VLA pointing, and the lack of multiple sightlines to background AGNs through\nthese groups. In the former case large area maps made with single dish radio telescopes equipped\nwith multibeam receivers (such as the Parkes Multibeam and the Arecibo ALFA receiver currently\nunder construction) should provide better constraints. In the latter case, we must wait for the\nnext generation of space-based instruments, starting with the Cosmic Origins Spectrograph (COS)\non HST. Such instruments will start to revolutionize this field. They will permit fainter AGNs to\nbe used as lightbulbs for absorption line studies allowing for more groups to be studied and even\nfor studies of multiple sightlines through individual groups. As an example, COS will be an order\nof magnitude more sensitive than FUSE. Future instrumentation on UV/Optical space telescopes\nshould be even better. When such instruments become available, we hope that our work will help\nserve as a template for future multiwavelength studies of groups of galaxies.\nThe authors would like to thank the staff at the VLA for their assistance in the reduction of\nthe data. We thank John Hibbard for providing us with information on the McEntaffer et al. results\nbefore publication. We also thank Hugo van Woerden for a helpful referee's report. Some of the\ndata presented in this paper was obtained from the Multimission Archive at the Space Telescope\nScience Institute (MAST); STScI is operated by the Association of Universities for Research in\nAstronomy, Inc., under NASA contract NAS5-26555. Support for MAST for non-HST data is\nprovided by the NASA Office of Space Science via grant NAG5-7584. This research has made\nuse of the NASA/IPAC Extragalactic Database (NED) which is operated by the Jet Propulsion\nLaboratory, California Institute of Technology, under contract with the National Aeronautics and\nSpace Administration. The Digitized Sky Surveys were produced at the Space Telescope Science\nInstitute under U.S. Government grant NAG W-2166. The images of these surveys are based on\nphotographic data obtained using the Oschin Schmidt Telescope on Palomar Mountain and the\nUK Schmidt Telescope. The plates were processed into the present compressed digital form with\nthe permission of these institutions. The Second Palomar Observatory Sky Survey (POSS-II) was\nmade by the California Institute of Technology with funds from the National Science Foundation,\nthe National Geographic Society, the Sloan Foundation, the Samuel Oschin Foundation, and the\nEastman Kodak Corporation. We have made use of the LEDA database (http://leda.univ-lyon1.fr).\nD.J.P. and D.F. acknowledge partial support for this project from Wisconsin Space Grant Graduate\nFellowships. D.J.P. acknowledges generous support from an NSF MPS Distinguished International\n\n\f– 15 –\nPostdoctoral Research Fellowship, NSF grant AST0104439. B.P.W. was supported by NASA grants\nNAG5-9024, NAG5-9179, and NAG5-8967. E.M.W. was kindly supported by NSF grant AST 9875008.\n\nREFERENCES\nBinney, J., & Tremaine, S. 1987, Galactic Dynamics (Princeton: Princeton UP)\nBlitz L., Spergel D., Teuben P.J., Hartmann D., Burton W.B., 1999, ApJ, 514, 818\nBraun R., Burton W.B., 1999, A&A, 351, 437\nBraun R., Burton W.B., 2000, A&A, 354, 853\nBregman, J.N., 1980, ApJ, 236, 577\nBroeils, A.H., Rhee, M.-H., A&A, 324, 877\nCen, R., Kang, H., Ostriker, J.P., Ryu, D., 1995, ApJ, 451, 436\nCen, R., Tripp, T.M., Ostriker, J.P., Jenkins, E.B., 2001, ApJ, 559, 5\nCollins, J.A., Shull, J.M., Giroux, M.L., 2003, ApJ, 585, 336\nDavé, R., Hernquist, L., Katz, N., Weinberg, D.H., 1999, ApJ, 511, 521\nDavé, R., Cen, R., Ostriker, J.P., Bryan, G.L., Hernquis, L., Katz, N., Weinberg, D.H., Norman,\nM.L., O'Shea, B., 2001, ApJ, 552, 473\nde Heij V., Braun R., Burton W.B., 2002, A&A, 392, 417\nFerland, G.J., 2003, ARA&A, 41, 517\nFukugita, M., Hogan, C.J., Peebles, P.J.E., ApJ, 503, 518\nGarcia, A.M., 1993, A&AS, 100, 47\nGardiner L.T., Noguchi M., 1996, MNRAS, 278, 19\nGeller M.J., Huchra J.P., 1983, ApJS, 52, 61 (GH83)\nGibson B.K., Giroux M.L., Penton S.V., Stocke J.T., Shull J.M., Tumlinson, J., 2001, AJ, 122, 328\nHartmann, D., Burton, W.B., 1997, \"Atlas of Galactic Neutral Hydrogen\", (Cambridge: Cambridge\nUP)\nHuchtmeier, W.K., Richter, O.-G., 1989, \"A General Catalog of HI Observations of Galaxies\",\n(Berlin: Springer-Verlag)\nHulsbosch A.N.M., 1975, A&A, 40, 1\nLandecker, T.L., et al. 2000, A&AS, 145, 509\nLanzetta, K.M., Bowen, D.V., Tytler, D., Webb, J.K., 1995, ApJ, 442, 538\nLockman, F.J., 2003, ApJ, 591, L33\nMoos H.W., et al., 2000, ApJ, 538, L1\nPenton S.V., Stocke J.T., Shull J.M., 2000, ApJS, 130, 121\nPenton S.V., Stocke J.T., Shull J.M., 2002, ApJ, 565, 720\nPutman, M.E., Staveley-Smith, L., Freeman, K.C., Gibson, B.K., Barnes, D.G., 2003, ApJ, 586,\n170\nRichter P., Sembach K.R., Wakker B.P., Savage B.D., Tripp T.M., Murphy, E.M., Kalberla P.M.W.,\nJenkins E.B., 2001, ApJ, 559, 318\n\n\f– 16 –\nRosenberg, J.L., Ganguly, R., Giroux, M.L., Stocke, J.T., 2003, ApJ, 591, 677\nSahnow D.J., et al. 2000, ApJ, 538, L7\nSavage, B.D., Sembach K.R., Tripp T.M., Richter P., 2002, ApJ, 564, 631\nSavage, B.D., et al., 2003, ApJS, 146, 125\nSembach, K.R., et al. 2000, ApJ, 538, L31\nSembach K.R., Wakker B.P., Savage B.D., Richter P., Meade M., et al., 2003, ApJS, 146, 165\nShapiro, P.R., Field, G.B., 1976, ApJ, 205, 762\nStocke, J.T., Shull, J.M., Penton, S., Donahue, M., Carilli, C., 1995, ApJ, 451, 24\nTripp, T.M., Lu, L., Savage, B.D., 1998, ApJ, 508, 200\nTripp, T.M., Savage, B.D., 2000, ApJ, 542, 42\nTripp, T.M., Savage, B.D., Jenkins, E.B., 2000, ApJ, 534, L1\nTripp, T.M., et al., 2003, AJ, 125, 3122\nTully, R.B., 1987, ApJ, 321, 280\nvan Gorkom, J.H., Carilli, C.L., Stocke, J.T., Perlman, E.S., Shull, J.M., 1996, AJ, 112, 1397\nvan Woerden H., Schwarz U.J., Peletier R., Wakker B.P., Kalberla P.M.W., 1999, Nature, 400, 138\nVeron-Cetty, M.P., Veron, P., 1998, ESO Sci. Rep., 18, 1\nVerschuur G.L., 1969, ApJ, 156, 771\nWakker B.P., 2001, ApJS, 136, 463\nWakker B., Howk C., Schwarz U., van Woerden H., Beers T., Wilhelm R., Kalberla P., Danly L.,\n1996, ApJ, 473, 834\nWakker B.P., Howk J.C., Savage B.D., van Woerden H., Tufte S.R., Schwarz U.J., Benjamin R.,\nReynolds R.J., Peletier R.F., Kalberla P.M.W., 1999, Nature, 400, 388\nWakker B.P., van Woerden H., 1997, ARA&A, 35, 217\nWakker B.P., et al., 2003, ApJS, 146, 1\nWakker B.P., Sembach K.R., Savage B.D., 2002, in \"The IGM/Galaxy connection\", eds. J. Rosenberg, M. Putman, 281, 289\nWolfe, A.M., Prochaska, J.X., 2000a, ApJ, 545, 591\nWolfe, A.M., Prochaska, J.X., 2000b, ApJ, 545, 603\nZabludoff, A.I., Mulchaey, J.S., 1998, ApJ, 498, L5\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n\f– 17 –\n\nTable 1. GH 144 Group Galaxies\nGalaxy\n\nα (J2000)\nh:m:s\n\nδ (J2000)\nd:m:s\n\nV⊙\nkm s−1\n\nHubble Type\n\nNGC 5631\nNGC 5667\nNGC 5678\n\n14:26:33.3\n14:30:24.9\n14:32:05.4\n\n56:35:00\n59:28:16\n57:55:13\n\n1979\n1943\n1922\n\nE\nScd\nSb\n\nNote. - All data is taken from NED.\n\nTable 2. GH 158 Group Galaxies\nGalaxy\n\nNGC\nNGC\nNGC\nNGC\nNGC\n\n5981\n5982\n5985\n5987\n5989\n\nα (J2000)\nh:m:s\n\nδ (J2000)\nd:m:s\n\nV⊙\nkm s−1\n\nHubble Type\n\n15:37:53.3\n15:38:39.7\n15:39:37.7\n15:39:58.1\n15:41:32.5\n\n59:23:34\n59:21:20\n59:19:57\n58:04:56\n59:45:19\n\n1764\n2904\n2517\n3010\n2878\n\nSbc\nE\nSb\nSb\nSc\n\nNote. - All data is taken from NED.\n\n\f– 18 –\n\nTable 3.\n\nTelescope\nConfiguration\nObservation Dates\nIntegration Time (hr)\nBeam Size (arcsec)\nHalf Power Diameter FOV (deg.)\nChannel Width ( km s−1 )\nVelocity Coverage ( km s−1 )\nSensitivitya(mJy/Bm)\nSensitivitya(106 M⊙ )\nSensitivitya(1018 cm−2 )\na The\n\nHI Observation Properties\n\nGH 144 - Mrk 817\n\nGH 158 - Mrk 290\n\nGH 158 - Mrk 290\n\nVLA\nD\n2000 Aug. 19,20\n8.1\n58\n0.5\n5.2\n1642 - 2254\n0.7\n1.0\n1.2\n\nVLA\nD\n2000 Aug. 19,20\n8.1\n58\n0.5\n5.2\n2593 - 3207\n0.5\n1.4\n0.85\n\nDRAO ST\n***\n2001 July & Aug.\n∼144\n70×59\n2.5\n3.3\n2474 - 3323\n9.8\n22\n9\n\n1σ, 1 channel RMS noise at the center of each data cube.\n\nTable 4. Properties of GH 144 H I Detections\n\nα (J2000)\nδ (J2000)\nV⊙ ( km s−1 )\nW20 ( km s−1 )\nMHI (109 M⊙ )\nPeak NHI (1019 cm−2 )\nSeparation (kpc)b\nSeparation ( km s−1 )\n\nPWWF J1437+5905\n\nPWWF J1439+5847\n\n14:37:02\n+59:05:55\n2233\n34a\n3.4a\n2.6\n200\n288a\n\n14:39:04\n+58:47:29\n2045\n60\n2.5\n2.6\n221\n100\n\na These\n\nare lower limits since this object extends beyond our observed\nbandpass.\nb The\n\nprojected radial separation between Mrk 817 and each H I detection, assuming they lie at the group distance of 36 Mpc (1′ = 10.5\nkpc).\n\n\f– 19 –\n\nTable 5. Mrk 817 UV data\nIon\n\nV⊙\nkm s−1\n\nWλ\nmÅ\n\nb\nkm s−1\n\nlog N\ncm−2\n\nLyman-α\nLyman-α\nLyman-β\nN Vλ1238.821\nN Vλ1238.821\nC IIIλ977.20\nC IIIλ977.20\nO VIλ1037.617\n\n1933\n2097\n2070\n2041\n2106\n2025\n2116\n***\n\n29±13\n135±15\n25±7\n15±4\n13±4\n18±5\n9±5\n<21a\n\n34±13\n40±4\n25±10\n30±8\n30±8\n8±3\n13±5\n30b\n\n12.76±0.24\n13.55±0.14\n13.55±0.14\n12.84±0.13\n12.79±0.15\n12.55±0.15\n12.14±0.20\n<13.53a\n\na This\n\nis a 3σ upper limit using the assumed b-value.\n\nb This\n\nis an assumed value based on the approximate widths\nof the other absorption lines.\n\nTable 6. GH 144 Galaxy Properties\nGalaxy\n\nR25 a\nkpc\n\nVrot b\nkm s−1\n\nMdyn c\nM⊙\n\nNGC 5631\nNGC 5667\nNGC 5678\n\n10.5\n8.9\n17.4\n\n190d\n120\n210\n\n1.5×1011\n5.1×1010\n3.1×1011\n\na from\n\nLEDA and assuming that all\ngalaxies lie at the group distance.\nb from\n\nLEDA\n\nc calculated\nd calculated\n\nwith W20\n\nusing Equation 3.\n\nassuming\nfrom LEDA.\n\nVrot =W20 /2,\n\n\f– 20 –\n\nFig. 1.- A map of all the group galaxies (filled circles), and those galaxies which may be associated\nwith GH 144 along with their heliocentric velocities (open circles). The star indicates the location\nof Mrk 817, and the large circle shows the area we observed with the VLA.\n\n\f– 21 –\n\nFig. 2.- As in Figure 1 but for GH 158. The star indicates the location of Mrk 290, the small\ncircle shows the area we observed with the VLA, and the large circle shows the area observed with\nthe DRAO ST.\n\n\f– 22 –\n\nFig. 3.- This figure shows the Lyβ, Lyγ, O VIλ1031.926, O VIλ1037.617 and C IIIλ977.200 lines,\nfor a ±500 km s−1 velocity range centered around the average heliocentric velocity of GH158, 2850\nkm s−1 . Flux is in units of 1×10−14 erg cm−2 s−1 Å−1 . The labels at the bottom identify interstellar\nlines, with single numbers giving the J-level of H2 absorption lines. The region between the \"<\"\nand \">\" is unreliable because of a detector flaw. The horizontal line represents the continuum\nwhich was fitted over a region much larger than that displayed here. The ⊕ symbol represents\ngeocoronal lines.\n\n\f– 23 –\n\n59 10\n\n2243.8 KM/S\n\n2238.6 KM/S\n\n2233.3 KM/S\n\n2228.1 KM/S\n\n2222.9 KM/S\n\n2217.6 KM/S\n\n2212.4 KM/S\n\n2207.2 KM/S\n\n2201.9 KM/S\n\n08\n06\n04\n02\n\nDECLINATION (J2000)\n\n59 10\n08\n06\n04\n02\n\n59 10\n08\n06\n04\n02\n\n14 37 30\n15\n00 36 45\nRIGHT ASCENSION (J2000)\n\n14 37 30\n\n15\n\n00 36 45\n\nFig. 4.- The channel maps of PWWF J1437+5905 in the GH 144 VLA field. Contours are at -4σ,\n-3σ, 3σ, 4σ, 5σ, 6σ where σ is the RMS noise (= 0.7 mJy/beam).\n\n\f– 24 –\n\n58 55\n\n2071.2 KM/S\n\n2066.0 KM/S\n\n2060.8 KM/S\n\n2055.5 KM/S\n\n2050.3 KM/S\n\n2045.1 KM/S\n\n2039.8 KM/S\n\n2034.6 KM/S\n\n2029.4 KM/S\n\n2024.2 KM/S\n\n2018.9 KM/S\n\n2013.7 KM/S\n\n50\n\n45\n\n40\n58 55\n\n50\n\nDECLINATION (J2000)\n\n45\n\n40\n58 55\n\n50\n\n45\n\n40\n58 55\n\n50\n\n45\n\n40\n14 39 30\n00 38 30\nRIGHT ASCENSION (J2000)\n\n14 39 30\n\n00 38 30\n\nFig. 5.- The channel maps of PWWF J1439+5847 in the GH 144 VLA field. Contours are at -3σ,\n3σ, 4σ, 5σ where σ is the RMS noise (= 0.7 mJy/beam).\n\n\f– 25 –\n\nFig. 6.- An H I spectrum of PWWF J1437+5905 after primary beam correction.\n\nFig. 7.- Same as Figure 6, but for PWWF J1439+5847.\n\n\f– 26 –\n\nFig. 8.- A contour map of the total HI column density overlaid on the blue DSS-2 image of\nPWWF J1437+5905. The contours are at 0.5,1,2,3×1019 cm−2 .\n\n\f– 27 –\n\nFig. 9.- Same as Figure 8, but for PWWF J1439+5847.\n\n\f– 28 –\n\nFig. 10.- This figure shows the Lyα, Lyβ, Lyγ, O VIλ1031.926, O VIλ1037.617 and C IIIλ977.200\nlines, for a velocity range of ±500 km s−1 relative to average heliocentric velocity of GH 144 1945\nkm s−1 . The flux units are as in Fig 3, as are the labels and horizontal line. The dotted lines\nindicate the velocity of absorption lines associated with GH 144.\n\n\f"}