{"id": "http://arxiv.org/abs/astro-ph/0008108v1", "guidislink": true, "updated": "2000-08-07T11:49:50Z", "updated_parsed": [2000, 8, 7, 11, 49, 50, 0, 220, 0], "published": "2000-08-07T11:49:50Z", "published_parsed": [2000, 8, 7, 11, 49, 50, 0, 220, 0], "title": "Effects of Neutrino Trapping on Thermodynamic Properties of Nuclear\n  ``Pasta''", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0008228%2Castro-ph%2F0008300%2Castro-ph%2F0008100%2Castro-ph%2F0008524%2Castro-ph%2F0008086%2Castro-ph%2F0008169%2Castro-ph%2F0008064%2Castro-ph%2F0008199%2Castro-ph%2F0008485%2Castro-ph%2F0008421%2Castro-ph%2F0008005%2Castro-ph%2F0008220%2Castro-ph%2F0008185%2Castro-ph%2F0008253%2Castro-ph%2F0008483%2Castro-ph%2F0008430%2Castro-ph%2F0008156%2Castro-ph%2F0008348%2Castro-ph%2F0008186%2Castro-ph%2F0008466%2Castro-ph%2F0008101%2Castro-ph%2F0008314%2Castro-ph%2F0008460%2Castro-ph%2F0008122%2Castro-ph%2F0008119%2Castro-ph%2F0008335%2Castro-ph%2F0008020%2Castro-ph%2F0008322%2Castro-ph%2F0008393%2Castro-ph%2F0008075%2Castro-ph%2F0008473%2Castro-ph%2F0008333%2Castro-ph%2F0008489%2Castro-ph%2F0008016%2Castro-ph%2F0008525%2Castro-ph%2F0008414%2Castro-ph%2F0008289%2Castro-ph%2F0008034%2Castro-ph%2F0008120%2Castro-ph%2F0008294%2Castro-ph%2F0008017%2Castro-ph%2F0008181%2Castro-ph%2F0008406%2Castro-ph%2F0008215%2Castro-ph%2F0008137%2Castro-ph%2F0008223%2Castro-ph%2F0008271%2Castro-ph%2F0008273%2Castro-ph%2F0008249%2Castro-ph%2F0008353%2Castro-ph%2F0008108%2Castro-ph%2F0008282%2Castro-ph%2F0008435%2Castro-ph%2F0008399%2Castro-ph%2F0008362%2Castro-ph%2F0008162%2Castro-ph%2F0008194%2Castro-ph%2F0008230%2Castro-ph%2F0008130%2Castro-ph%2F0008126%2Castro-ph%2F0008019%2Castro-ph%2F0008275%2Castro-ph%2F0008296%2Castro-ph%2F0008190%2Castro-ph%2F0008141%2Castro-ph%2F0008103%2Castro-ph%2F0008147%2Castro-ph%2F0008201%2Castro-ph%2F0008390%2Castro-ph%2F0008449%2Castro-ph%2F0008095%2Castro-ph%2F0008486%2Castro-ph%2F0008274%2Castro-ph%2F0008032%2Castro-ph%2F0008307%2Castro-ph%2F0008260%2Castro-ph%2F0008011%2Castro-ph%2F0008188%2Castro-ph%2F0008284%2Castro-ph%2F0008059%2Castro-ph%2F0008029%2Castro-ph%2F0008522%2Castro-ph%2F0008306%2Castro-ph%2F0008140%2Castro-ph%2F0008149%2Castro-ph%2F0008381%2Castro-ph%2F0008191%2Castro-ph%2F0008252%2Castro-ph%2F0008166%2Castro-ph%2F0008291%2Castro-ph%2F0008337%2Castro-ph%2F0008109%2Castro-ph%2F0008280%2Castro-ph%2F0008236%2Castro-ph%2F0008323%2Castro-ph%2F0008374%2Castro-ph%2F0008010%2Castro-ph%2F0008467%2Castro-ph%2F0008123%2Castro-ph%2F0008013%2Castro-ph%2F0008106&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Effects of Neutrino Trapping on Thermodynamic Properties of Nuclear\n  ``Pasta''"}, "summary": "Geometrical structure of matter at subnuclear densities is investigated in\nthe presence of a degenerate gas of neutrinos as encountered in stellar\ncollapse. The crystalline phases with spherical, cylindrical and planar nuclei\nas well as with spherical and cylindrical nuclear bubbles are considered by\nusing a compressible liquid-drop model. This model allows for uncertainties in\nthe lepton fraction $Y_{\\rm L}$ in addition to those in the nuclear surface\ntension $E_{\\rm surf}$ and in the proton chemical potential in bulk neutron\nmatter $\\mu_{\\rm p}^{(0)}$. The phase diagrams obtained at zero temperature\nshow that only the phases with rod-like and slab-like nuclei occur at typical\nvalues of $Y_{\\rm L}$, $E_{\\rm surf}$ and $\\mu_{\\rm p}^{(0)}$, whereas the\nbubble phases, especially with spherical bubbles, are at best expected at\nhypothetically low values of $Y_{\\rm L}$ and/or $E_{\\rm surf}$. For the\nrod-like and slab-like nuclei, thermally induced displacements are calculated\nfrom their respective elastic constants. It is found that at temperatures\nappropriate to supernova cores, thermal fluctuations would destroy the layered\nlattice of slab-like nuclei almost independently of the nuclear models and of\nthe degree of the neutrino degeneracy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0008228%2Castro-ph%2F0008300%2Castro-ph%2F0008100%2Castro-ph%2F0008524%2Castro-ph%2F0008086%2Castro-ph%2F0008169%2Castro-ph%2F0008064%2Castro-ph%2F0008199%2Castro-ph%2F0008485%2Castro-ph%2F0008421%2Castro-ph%2F0008005%2Castro-ph%2F0008220%2Castro-ph%2F0008185%2Castro-ph%2F0008253%2Castro-ph%2F0008483%2Castro-ph%2F0008430%2Castro-ph%2F0008156%2Castro-ph%2F0008348%2Castro-ph%2F0008186%2Castro-ph%2F0008466%2Castro-ph%2F0008101%2Castro-ph%2F0008314%2Castro-ph%2F0008460%2Castro-ph%2F0008122%2Castro-ph%2F0008119%2Castro-ph%2F0008335%2Castro-ph%2F0008020%2Castro-ph%2F0008322%2Castro-ph%2F0008393%2Castro-ph%2F0008075%2Castro-ph%2F0008473%2Castro-ph%2F0008333%2Castro-ph%2F0008489%2Castro-ph%2F0008016%2Castro-ph%2F0008525%2Castro-ph%2F0008414%2Castro-ph%2F0008289%2Castro-ph%2F0008034%2Castro-ph%2F0008120%2Castro-ph%2F0008294%2Castro-ph%2F0008017%2Castro-ph%2F0008181%2Castro-ph%2F0008406%2Castro-ph%2F0008215%2Castro-ph%2F0008137%2Castro-ph%2F0008223%2Castro-ph%2F0008271%2Castro-ph%2F0008273%2Castro-ph%2F0008249%2Castro-ph%2F0008353%2Castro-ph%2F0008108%2Castro-ph%2F0008282%2Castro-ph%2F0008435%2Castro-ph%2F0008399%2Castro-ph%2F0008362%2Castro-ph%2F0008162%2Castro-ph%2F0008194%2Castro-ph%2F0008230%2Castro-ph%2F0008130%2Castro-ph%2F0008126%2Castro-ph%2F0008019%2Castro-ph%2F0008275%2Castro-ph%2F0008296%2Castro-ph%2F0008190%2Castro-ph%2F0008141%2Castro-ph%2F0008103%2Castro-ph%2F0008147%2Castro-ph%2F0008201%2Castro-ph%2F0008390%2Castro-ph%2F0008449%2Castro-ph%2F0008095%2Castro-ph%2F0008486%2Castro-ph%2F0008274%2Castro-ph%2F0008032%2Castro-ph%2F0008307%2Castro-ph%2F0008260%2Castro-ph%2F0008011%2Castro-ph%2F0008188%2Castro-ph%2F0008284%2Castro-ph%2F0008059%2Castro-ph%2F0008029%2Castro-ph%2F0008522%2Castro-ph%2F0008306%2Castro-ph%2F0008140%2Castro-ph%2F0008149%2Castro-ph%2F0008381%2Castro-ph%2F0008191%2Castro-ph%2F0008252%2Castro-ph%2F0008166%2Castro-ph%2F0008291%2Castro-ph%2F0008337%2Castro-ph%2F0008109%2Castro-ph%2F0008280%2Castro-ph%2F0008236%2Castro-ph%2F0008323%2Castro-ph%2F0008374%2Castro-ph%2F0008010%2Castro-ph%2F0008467%2Castro-ph%2F0008123%2Castro-ph%2F0008013%2Castro-ph%2F0008106&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Geometrical structure of matter at subnuclear densities is investigated in\nthe presence of a degenerate gas of neutrinos as encountered in stellar\ncollapse. The crystalline phases with spherical, cylindrical and planar nuclei\nas well as with spherical and cylindrical nuclear bubbles are considered by\nusing a compressible liquid-drop model. This model allows for uncertainties in\nthe lepton fraction $Y_{\\rm L}$ in addition to those in the nuclear surface\ntension $E_{\\rm surf}$ and in the proton chemical potential in bulk neutron\nmatter $\\mu_{\\rm p}^{(0)}$. The phase diagrams obtained at zero temperature\nshow that only the phases with rod-like and slab-like nuclei occur at typical\nvalues of $Y_{\\rm L}$, $E_{\\rm surf}$ and $\\mu_{\\rm p}^{(0)}$, whereas the\nbubble phases, especially with spherical bubbles, are at best expected at\nhypothetically low values of $Y_{\\rm L}$ and/or $E_{\\rm surf}$. For the\nrod-like and slab-like nuclei, thermally induced displacements are calculated\nfrom their respective elastic constants. It is found that at temperatures\nappropriate to supernova cores, thermal fluctuations would destroy the layered\nlattice of slab-like nuclei almost independently of the nuclear models and of\nthe degree of the neutrino degeneracy."}, "authors": ["Gentaro Watanabe", "Kei Iida", "Katsuhiko Sato"], "author_detail": {"name": "Katsuhiko Sato"}, "author": "Katsuhiko Sato", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0375-9474(00)00585-6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0008108v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0008108v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "26 pages, 11 figures, submitted to Nuclear Physics A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0008108v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0008108v1", "journal_reference": "Nucl.Phys. A687 (2001) 512-531", "doi": "10.1016/S0375-9474(00)00585-6", "fulltext": "arXiv:astro-ph/0008108v1 7 Aug 2000\n\nEffects of Neutrino Trapping on Thermodynamic\nProperties of Nuclear \"Pasta\"\nGentaro Watanabea, Kei Iidaa,b, Katsuhiko Satoa,c\na\nDepartment of Physics, University of Tokyo, 7-3-1 Hongo, Bunkyo,\nTokyo 113-0033, Japan\nb\nDepartment of Physics, University of Illinois at Urbana-Champaign,\n1110 West Green Street, Urbana, IL 61801-3080, USA\nc\nResearch Center for the Early Universe, University of Tokyo,\n7-3-1 Hongo, Bunkyo, Tokyo 113-0033, Japan\nNovember 1, 2018\nAbstract\nGeometrical structure of matter at subnuclear densities is investigated in the\npresence of a degenerate gas of neutrinos as encountered in stellar collapse. The\ncrystalline phases with spherical, cylindrical and planar nuclei as well as with spherical and cylindrical nuclear bubbles are considered by using a compressible liquiddrop model. This model allows for uncertainties in the lepton fraction YL in addition\nto those in the nuclear surface tension Esurf and in the proton chemical potential\n(0)\nin bulk neutron matter μp . The phase diagrams obtained at zero temperature\nshow that only the phases with rod-like and slab-like nuclei occur at typical values\n(0)\nof YL , Esurf and μp , whereas the bubble phases, especially with spherical bubbles, are at best expected at hypothetically low values of YL and/or Esurf . For the\nrod-like and slab-like nuclei, thermally induced displacements are calculated from\ntheir respective elastic constants. It is found that at temperatures appropriate to\nsupernova cores, thermal fluctuations would destroy the layered lattice of slab-like\nnuclei almost independently of the nuclear models and of the degree of the neutrino\ndegeneracy.\nP ACS : 26.50.+x; 97.60.Bw\nKeywords : Dense matter; Ground state; Thermal fluctuations; Stellar collapse\n\n1\n\n\f1\n\nIntroduction\n\nTo clarify the mechanism of collapse-driven supernovae (see, e.g., Refs. [1, 2] for review)\nnecessitates understanding of the properties of matter under extreme conditions characterized by high densities and temperatures as well as of its interactions with electron\nneutrinos, which are produced by electron capture processes on the nuclei present during\nthe collapse of an iron core of a massive star. Diffusion of the neutrinos thus produced is\ncontrolled by their coherent scattering off the nuclei via neutral-current weak interactions\n[3, 4]. It is generally accepted that at densities above ∼ 1012 g cm−3 , where the dynamical\ntime scale of the collapse is small compared with the diffusion time scale, these neutrinos\nare trapped, forming an ultrarelativistic and degenerate Fermi gas. This plays a role in\nestablishing β equilibrium in the system1 and, until the core ceases to collapse and rebounds, in increasing the system temperature T up to order or greater than 10 MeV. The\ndensity region in which such a trapping occurs and the lepton fraction, i.e., the number\nof the leptons of electron flavor present per nucleon locally in this region:\nYL =\n\nne + nν\n,\nnb\n\n(1)\n\nwhere nb , ne and nν are the nucleon, electron and electron-neutrino number densities,\nrespectively, depend on the rates of the electron capture and of the neutrino scattering.\nThese rates are in turn affected by changes in the states of supernova matter such as\nchanges in the nuclear composition and a melting transition from the phase with the\nnuclei to the phase of uniform nuclear matter.\n1\n\nHereafter, the corresponding β equilibrated material is referred to as supernova matter.\n\n2\n\n\fAt subnuclear densities and at temperatures below the critical temperature of order 10\nMeV, nuclear matter is separated into a high-density liquid part, usually characterized by\nroughly spherical nuclei, and a low-density gas part, composed mostly of neutrons. When\nthe density is close to the saturation density of symmetric nuclear matter, ρs ≈ 2.7 × 1014\ng cm−3 , the system is expected to have rod-like and slab-like nuclei as well as rod-like and\nroughly spherical bubbles, as originally indicated by Ravenhall et al. [5] and Hashimoto\net al. [6] using a liquid drop model in the zero-temperature approximation. These earliest\ninvestigations show that such non-spherical nuclei and bubbles, forming a Coulomb lattice,\narise from a delicate balance between the interfacial energy and the electrostatic energy\nincluding the lattice energy. With increasing density, a bcc lattice of spherical nuclei\nchanges into a two-dimensional triangular lattice of rod-like nuclei and then into a onedimensional layered lattice of slab-like nuclei, until the liquid part and the gas part begin to\nbe replaced by each other. After further transformations to a two-dimensional triangular\nlattice of cylindrical bubbles and then to a bcc lattice of spherical bubbles, the system\nturns into uniform nuclear matter. This behavior was confirmed by Lassaut et al. [7] in\ntheir three-dimensional Thomas-Fermi calculations at finite YL and T relevant to stellar\ncollapse. Those kinds of non-spherical nuclei and of bubbles are often referred to as\nnuclear \"pasta\" since they are similar in shape to spaghetti, lasagna, etc.\nThe presence of non-spherical nuclei and of bubbles is expected to have consequence\nto the hydrodynamics and neutrino transport in supernova cores; these are ingredients of\na simulation study of stellar collapse, bounce and explosion (for recent progress in this\nstudy, see, e.g., Ref. [8]). Let us first note that the neutrino wavelengths, typically of\n\n3\n\n\forder 20 fm, are comparable to or even greater than the internuclear spacing, leading to\ndiffractive effects on the neutrino elastic scattering off such a periodic spatial structure\nof nuclear matter [5]. These effects, induced by the internuclear Coulombic correlations,\nwould act to reduce the scattering rates and hence the lepton fraction YL . For the bcc\nlattice of spherical nuclei, such a reduction was examined by Horowitz [9] by calculating\nthe associated static structure factor. As clarified by Bruenn and Mezzacappa [10] in\ntheir numerical calculations of stellar collapse, however, the resultant window that allows\nlow-energy neutrinos to diffuse away from the core during its collapse is too narrow to\ndrastically suppress the degree of the neutrino degeneracy. It is also noteworthy that\nnon-spherical nuclei and bubbles are elongated in specific direction. In such direction, the\nneutrino scattering processes are no longer coherent, in contrast to the case of roughly\nspherical nuclei whose finiteness in any direction yields constructive interference in the\nscattering. The last point to be mentioned is that the changes in the nuclear shape are\naccompanied by discontinuities in the adiabatic index, denoting how hard the equation of\nstate of the material is. As Lassaut et al. [7] suggested, these discontinuities may influence\nthe core hydrodynamics during the initial phase of the collapse.\nFor neutron star matter, which has vanishing neutrino degeneracy, we examined the\ndensity region in which the phases with non-spherical nuclei and with bubbles are preferred\nover the bcc phase of spherical nuclei and the homogeneous phase by generalizing a\ncompressible liquid-drop model advanced by Baym, Bethe and Pethick [13] (hereafter\nBBP) so as to incorporate uncertainties in the nuclear surface tension Esurf and the\nproton chemical potential μ(0)\np in the dripped neutron gas [11]. We found that as Esurf\n\n4\n\n\fdecreases or μ(0)\np increases, such a density region is enlarged appreciably. Fortunately,\nthose uncertainties are of less importance to supernova matter at subnuclear densities,\nwhich will be studied in the present paper. This is because after the onset of the neutrino\ntrapping, the resultant neutrino degeneracy keeps the denser part of nuclear matter stable\nagainst further neutronization; not only does the proton fraction x in this part remain\ntypically of order 0.3, not far from the regime accessible to experiment, but also the\ndripped nucleon gas, arising mainly from thermal effects, is too low for the values of μ(0)\np\nto make any essential difference in the density region occupied by nuclear \"pasta\". To\nbe taken into account in analyzing supernova matter, in addition to the nuclear model\ndependence of the stability of the \"pasta\" phases, is its dependence on the trapped lepton\nfraction YL . The values of YL , depending on the sizes and shapes of the denser part which\nproduces, scatters and absorbs electron neutrinos via weak interactions, exert feedback\non the condition for the stability of the \"pasta\" phases. Note, for example, that with\nincreasing YL , the melting density ρm approaches ρs . This is due to the tendency [12]\nthat as the denser part is at larger neutron excess, the saturation density is lowered. By\nallowing for uncertainties in YL coming partly from such a feedback effect, we set a range\nof YL as 0.2 ≤ YL ≤ 0.4, rather wider than the usually adopted values ranging 0.3–0.38 (see\nRefs. [1, 2] and references therein). The equilibrium phase diagrams of zero-temperature\nsupernova matter are drawn for this range of YL ; we thus find that at typical values of\nEsurf , μ(0)\np and YL , the phases with rod-like and slab-like nuclei lie between the usual bcc\nphase and the uniform phase, as in the case of neutron star matter [11].\nFor these two \"pasta\" phases, we evaluate thermally induced displacements of the\n\n5\n\n\fnuclei from their elastic constants, which were described by Pethick and Potekhin [14] in\nterms of the interfacial and electrostatic energies. They noted that the low-dimensional\nspatial order exhibited by the phases with cylindrical and planar nuclei is analogous to\nthat of the liquid crystals, i.e., columnar phases and smectics A, respectively. According\nto our previous analysis of neutron star matter [11], thermal fluctuations may melt the\nlayered lattice of planar nuclei rather than the triangular lattice of cylindrical nuclei at\ntemperatures appropriate to matter in neutron star crusts. In the case of supernova\ncores of interest here, as we shall see, not only the temperature scale but also the elastic\nconstants are considerably large as compared with the case of neutron star crusts. The\ntemperatures and elastic constants thus increased play a role in enhancing and suppressing\nthe fluctuational displacements, respectively. The resultant rivalry between these two roles\nis finally examined.\nIn Section 2, a compressible liquid-drop model for nuclei and bubbles, together with\nthe associated equilibrium conditions, is designed to describe zero-temperature matter at\nsubnuclear densities and various lepton fractions. In Section 3 we therefrom derive the\nequilibrium phase diagrams for changes in the nuclear conformation. Properties of such\nconformation changes are discussed in Section 4. In Section 5 we estimate displacements\nof rod-like and slab-like nuclei at finite temperatures. Section 6 is devoted to conclusions.\n\n6\n\n\f2\n\nModel for supernova matter at subnuclear densities\n\nIn this section, we construct the free energy of supernova matter for densities near the\nmelting density ρm , and write down the conditions for its equilibrium. We concentrate\non the influence of the lepton fraction YL on the free energy. Since the finite-temperature\neffects on the free energy, i.e., nuclear and electronic excitations, nucleon evaporation\nfrom the denser part of nuclear matter, multiple shapes and sizes of this part, etc., are of\nless importance, the temperature T is taken to be zero. All we bear in mind is thus to\ncombine the BBP-type compressible liquid-drop model used by us [11] for the description\nof zero-temperature, inhomogeneous nuclear matter embedded in a sea of electrons with\nthe energy contribution of electron neutrinos. At T = 0, the less dense part of nuclear\nmatter is composed entirely of the neutrons dripped out of the denser part.\nFollowing Ref. [11], we consider five phases characterized by the shapes of the denser\npart of nuclear matter, i.e., sphere, cylinder, slab, cylindrical hole and spherical hole,\nrespectively; each phase is composed of a single species of nucleus or bubble at a given\nbaryon density nb and lepton fraction YL . The Wigner-Seitz approximation is adopted in\ndescribing the energy of the respective Coulomb lattice: A cell in the bcc lattice, including\na spherical nucleus or bubble of radius rN , is replaced by a spherical Wigner-Seitz cell\nhaving the same center and radius rc ; a cell in the two-dimensional triangular lattice,\nincluding a cylindrical nucleus or bubble having an infinitely long axis and a circular\nsection of radius rN , is replaced by a cylindrical Wigner-Seitz cell having the same axis\nand a circular section of radius rc ; a cell in the one-dimensional layered lattice, including\n7\n\n\fa planar nucleus with width 2rN , is equivalent to a planar Wigner-Seitz cell having the\nsame central plane and width 2rc . The values of rc for these phases are chosen so that\neach Wigner-Seitz cell may have zero net charge.\n\n2.1\n\nEnergy of matter\n\nLet us now regard each species of leptons (nucleons) as uniformly distributed everywhere\nin the system (inside and outside the nuclei or bubbles), and write down the total energy\ndensity Etot of the system as\n\n\n\n\nEtot = \n\n\nwN + wL + (1 − u)En (nn ) + Ee (ne ) + Eν (nν )\n\n(nuclei) ,\n\nwN + wL + uEn (nn ) + Ee (ne ) + Eν (nν )\n\n(bubbles) .\n\n(2)\n\nHere, wN is the energy of the nuclear matter region (the region containing protons) in a\ncell as divided by the cell volume; wL is the lattice energy per unit volume as given for\nthe nuclei or bubbles having nonzero rN ; nn is the number density of neutrons outside\nthe nuclei or inside the bubbles; En , Ee and Eν are the energy densities of the neutron\nmatter, of the electron gas and of the neutrino gas, respectively; u is the volume fraction\noccupied by the nuclei or bubbles.\nIn Eq. (2), the expressions for wN , wL , En and Ee are given by Eqs. (3), (8), (10) and\n(11) in Ref. [11]. A new component, the neutrino energy density, is expressed in the form\nof an ideal ultrarelativistic Fermi gas:\n3\nEν (nν ) = nν h̄kν c ,\n4\n\n(3)\n\n1\n\nwhere kν = (6π 2 nν ) 3 is the neutrino Fermi wave number. Recall that the energy of the\nnuclear matter region is written in the form of a compressible liquid-drop model as (Eq.\n8\n\n\f(3) in Ref. [11])\n\nwN (n, x, nn , rN , rc , d) =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nun[(1 − x)mn + xmp ]c2 + unW (k, x)\n+wsurf (n, x, nn , rN , u, d) + wC (n, x, rN , u, d)\n(1 − u)n[(1 − x)mn + xmp ]c2 + (1 − u)nW (k, x)\n+wsurf (n, x, nn , rN , u, d) + wC (n, x, rN , u, d)\n\n(nuclei) ,\n\n(bubbles) ,\n(4)\n\nwhere mn (mp ) is the neutron (proton) rest mass; n is the nucleon number density in the\nnuclear matter region; W (k, x) is the energy per nucleon for uniform nuclear matter of\nnucleon Fermi wave number k = (3π 2 n/2)1/3 and proton fraction x; wsurf is the nuclear\nsurface energy per unit volume; wC is the self Coulomb energy (per unit volume) of protons\ncontained in a cell; d is the dimensionality defined as d = 1 for slabs, d = 2 for cylinders\nand d = 3 for spheres. This expression for wN includes three parameters C1 , C2 and C3 ,\nassociated with uncertainties in the proton chemical potential μ(0)\np in pure neutron matter\nas contained in W (k, x) and those in the nuclear surface tension Esurf (= rN wsurf /ud). C1\ndetermines the magnitude of μ(0)\np (not including the rest mass) as (Eq. (4) in Ref. [11])\n2/3\nμ(0)\n.\np = −C1 nn\n\n(5)\n\nWe basically set C1 = 400 MeV fm2 ; this case is consistent with the generally accepted\nbehavior among recent literature as exhibited in Fig. 1 of Ref. [11]. As the case may be,\nC1 = 300, 500, 600 MeV fm2 will be also taken for the sake of comparison. The other two\nparameters C2 and C3 are defined as (Eq. (6) in [11])\nEsurf = C2 tanh\n\nC3\n(0)\nμn\n\n!\n\nBBP\nEsurf\n,\n\n(6)\n\n2\nwhere μ(0)\nn = ∂En /∂nn − mn c is the neutron chemical potential in the neutron gas (not\nBBP\nincluding the rest mass), and Esurf\nis the BBP-type surface tension (Eq. (7) in Ref. [11]).\n\n9\n\n\fAs shown in Ref. [11] for the ground-state matter with nν = 0 and C1 = 300, 400, 500, 600\nMeV fm2 , to set C2 = 1.0 and C3 = 3.5 MeV well reproduces the Hartree-Fock (HF)\nresults obtained by Ravenhall, Bennett and Pethick [15] (hereafter denoted by RBP) using\na Skyrme interaction. It is important to examine whether or not this tendency persists\nfor the ground-state supernova matter; in this case, the proton fraction x of interest is\nconsiderably large relative to the case of nν = 0 in which it is confined to x < 0.2. When\nwe still set C2 = 1.0 and C3 = 3.5 MeV, as can be seen from Fig. 1, the surface tension\ncalculated from the equilibrium conditions to be described in Subsection 2.2 agrees fairly\nwell with the RBP results for C1 = 400 MeV fm2 and YL = 0.2, 0.3, 0.4.2 Such agreement\nhas been confirmed also for C1 = 300, 500, 600 MeV fm2 and YL = 0.2, 0.3, 0.4. In the\npresent work, we thus give C3 a fixed value, 3.5 MeV, and C2 a range of values including\nunity, 0.01–3.\n\n2.2\n\nEquilibrium conditions\n\nZero-temperature supernova matter with nuclei or bubbles of given shape, in its equilibrium, fulfills the conditions for stability of the nuclear matter region against change in the\nsize, neutron drip, β-decay and pressurization, as in the case of neutron star matter (see\nSection 2.2 in Ref. [11]). These conditions come from minimization of the energy density\nEtot with respect to five variables n, x, nn , rN and u at fixed lepton fraction YL given by\nEq. (1) and baryon density nb given by\nnb =\n\n(\n\nun + (1 − u)nn\n(1 − u)n + unn\n\n(nuclei) ,\n(bubbles) ,\n\n(7)\n\n2\nAt fixed YL and for densities of interest here, the proton fraction x is limited to a rather small range\nexhibited in Fig. 1.\n\n10\n\n\fas well as under charge neutrality,\nne =\n\n(\n\nxnu\nxn(1 − u)\n\n(nuclei) ,\n(bubbles) .\n\n(8)\n\nThe resultant expressions for the size, drip and pressure equilibria are the same as those\ngiven for neutron star matter (see Eqs. (14), (15) and (21) in Ref. [11]). Only the βequilibrium condition (Eq. (18) in Ref. [11]) is modified by the neutrino degeneracy; it\nnow reads\n(N)\nμe − μν − (mn − mp )c2 = μ(N)\n,\nn − μp\n\n(9)\n\nwhere\nμν = h̄kν c\n\n(10)\n\nis the neutrino chemical potential; μe , μ(N)\nand μ(N)\nare the electron chemical potential,\nn\np\nthe neutron chemical potential in the nuclear matter region and the proton chemical\npotential in the nuclear matter region, respectively (see Eqs. (19), (16) and (20) in Ref.\n[11]).\nAt given nb , YL and nuclear shape, we have calculated the minimum value of Etot\nfor electrically neutral supernova matter. Such calculations begin with elimination of μν\n1\n\nfrom condition (9) with the help of Eqs. (1) and (10), leading to a cubic equation for μe3 .\nThe solution for μe can then be written in terms of n, x, nn and rN by using the Cardan's\nformula. For the rest of the process that allows us to find the equilibrium values of n, x,\nnn , rN and rc and thus the minimum value of Etot , we can follow a line of argument of\nRef. [11].\nAt the same nb and YL, the energy density of uniform nuclear matter in β-equilibrium\nwith leptons has also been evaluated. The total energy density of this uniform system is\n11\n\n\fwritten as\nEtot = nW (k, x) + n[(1 − x)mn + xmp ]c2 + Ee (ne ) + Eν (nν ) ,\n\n(11)\n\nwhere the presence of muons is ignored. We then minimize Etot with respect to x at fixed\nbaryon density nb (= n) and lepton fraction YL as well as subject to charge neutrality,\nne = xn .\n\n(12)\n\nThe resultant β-equilibrium condition, given by\n∂W (k, x)\n= −μe + μν + (mn − mp )c2 ,\n∂x\n\n(13)\n\nleads to the optimal value of x and hence of Etot . By comparing this value of Etot with\nthe values obtained for the five crystalline phases, we have determined the phase giving\nthe smallest energy density at various values of nb , YL , C1 and C2 , and thereby drawn the\nphase diagrams for the ground-state supernova matter, as plotted in Figs. 2 and 3.\n\n3\n\nPhase diagrams\n\nLet us first examine the μ(0)\np and Esurf dependence of the density region of each phase;\nsuch dependence can be typically seen from Fig. 2 that exhibits the phase diagram drawn\nat YL = 0.3 and C1 = 300, 400, 600 MeV fm2 over the nb versus C2 plane. We have thus\nconfirmed the feature as mentioned in Section 1 that the density region where neither\nthe usual bcc phase nor the uniform phase is stable is almost independent of μ(0)\np because\nof negligibly small nn . We remark in passing that the melting density ρm increases with\nincreasing C1 (lowering μ(0)\np ), in contrast to the case of neutron star matter (see Fig.\n12\n\n\f3 in Ref. [11]). This is because such a change in μ(0)\np helps the nuclear matter region\nkeep the protons within itself, rather than the neutron gas region share the protons. The\nEsurf dependence, on the other hand, is essentially the same as that obtained for neutron\nstar matter: Not only is the density region occupied by nuclear \"pasta\" reduced with\n< 0.3),\nincreasing C2 , but also the sequence of the nuclear shape for the lower Esurf (C2 ∼\n\ni.e., sphere → cylinder → slab → cylindrical hole → spherical hole → uniform matter\n(with increasing nb ), changes into sphere → cylinder → slab → uniform matter for the\ntypical Esurf (C2 ≃ 1.0). However, it is to be recalled that uncertainties accompanying C2\nare smaller for supernova matter than for neutron star matter (see Section 1).\nWe proceed to consider the YL dependence of the phase diagrams by observing Fig.\n3 drawn for YL = 0.2, 0.25, 0.3, 0.4 and for C1 = 400 MeV fm2 . For these values of\nYL , within the typical Esurf region (C2 ≃ 1.0), the phase with slab-like nuclei dissolves\ninto uniform matter without undergoing a transition to the phase with cylindrical or\nspherical bubbles. The most viable situation in which at least one of the bubble phases\nis energetically favored for a finite range of density is expected in a rather hypothetical\nparameter region, YL ≃ 0.2 and C2 ≃ 0.7. It is interesting to note that as YL increases,\nthe melting density ρm goes up and becomes close to ρs . As mentioned in Section 1, this\nis due to the proton fraction dependence of the saturation density; for details, see Fig. 1\nin Ref. [16] that shows the BBP model for the energy of bulk nuclear matter underlying\nW (k, x) used here. We also find that the density region occupied by nuclear \"pasta\"\nis considerably larger than that displayed by Fig. 3 in Ref. [11] for neutron star matter\nhaving a lepton fraction of order 0.03 and a surface tension of order 0.1 MeV fm−2 . This\n\n13\n\n\fis because such a density region is controlled by the tendency towards reduction in the\ntotal surface area, which is in turn determined by Esurf and hence by YL (see Fig. 1). This\ntendency communicates with the fact that for supernova matter, the energy difference\nbetween two successive phases is generally of order 1-10 keV per nucleon (see Fig. 4), an\norder of magnitude larger than that for neutron star matter (see Fig. 4 in Ref. [11]).\nWe conclude this section by asking why the bubble phases do not appear in the equilibrium phase diagrams for our typical nuclear model (C1 = 400 MeV fm2 and C2 = 1.0) in\ncontrast with the results obtained by Lassaut et al. [7] in their three-dimensional ThomasFermi calculations using a Skyrme nucleon-nucleon interaction. As expected from a simple\nliquid-drop argument of the electrostatic and interfacial effects ignoring the bulk energy\n[6], they found that all the phases with non-spherical nuclei and with bubbles occur for\na finite range of pressure (or density). We ascribe this contrast primarily to the difference in the adopted properties of bulk nuclear matter at a proton fraction of about 0.3;\ndescription of these properties relies on interpolation between the fairly-well-determined\nproperties of pure neutron matter and symmetric nuclear matter. This ascription is supported by the speculation that the role of curvature corrections in stabilizing the phases\nwith bubbles relative to the phases with nuclei, which was allowed for in Ref. [7] but has\nbeen disregarded in the present work, is not sufficient to cause the bubble phases to appear in the vicinity of C2 = 1.0 on the phase diagrams. Such insufficiency can be viewed\nfrom Fig. 5, in which the curvature energy gain per nucleon for spherical bubbles over for\nplanar nuclei and the difference in energy per nucleon between the phases with spherical\nbubbles and with planar nuclei have been compared for YL = 0.3, C1 = 400 MeV fm2 and\n\n14\n\n\fC2 = 1.0.3 The curvature energy for given conformation is expressed per nucleon as\n\nWcurv\n\nd(d − 1)uωc\nnb rN2\n=\nd(d − 1)uωc\n\n\n\n −\nnb rN2\n\n\n\n\n\n\n(nuclei) ,\n(14)\n(bubbles) ,\n\nwhere ωc is the curvature thermodynamic potential per unit length. We have set the\nvalues of ωc , which have yet to be determined well even at proton fractions near x = 0.5,\nas ωc = 0.1, 0.2, 0.5 MeV fm−1 by reference to the estimates, ∼ 0.1–0.2 MeV fm−1 at\nx ∼ 0.3, made by Kolehmainen et al. [17] in the Thomas-Fermi theory with Skyrme\ninteractions. Figure 5 indicates that for the typical parameter set leading to x ∼ 0.3, the\nvalue of ωc required by the presence of the bubble phases is at least ∼ 0.5 MeV fm−1 ,\nconsiderably larger than the estimates referred to. For ωc ∼ 0.1–0.2 MeV fm−1 , all the\ncurvature corrections contribute to the vicinity of C2 = 1.0 on the phase diagrams is to\nlower the transition density from sphere to cylinder and that from cylinder to slab by\nseveral tens percent and to accordingly enlarge the density region surrounded by the bcc\nphase and the uniform phase.\n\n4\n\nProperties of phase transitions\n\nAt a pressure at which the transition between one nuclear shape and another occurs,\nvarious quantities such as nb , rc , rN , n, x and nn are more or less discontinuous because\nof the dependence of the interfacial and electrostatic energies on the dimensionality d\n3\n\nNote that for this parameter set and at densities close to the melting point ρm , the phase with\ncylindrical bubbles is less favorable than that with spherical bubbles even in the absence of the curvature\ncorrections which lower the energy for the spherical-bubble phase further than that for the cylindricalbubble phase.\n\n15\n\n\f(see Eqs. (5) and (8) in Ref. [11]). As can be derived from Fig. 4 by implementing the\ndouble-tangent constructions denoting the coexistence of the two neighbouring phases,\nthe discontinuity in nb amounts to of order 1%. Due to such a weak first-order nature of\nthe transition, the transition point, properly characterized by a constant pressure, is well\ndescribed by a constant density determined by the comparison between the total energy\ndensities for the respective phases.\nLet us then examine the changes in the sizes of the nucleus or bubble and of the\nWigner-Seitz cell, rN and rc , associated with the structural transitions. In Fig. 6 we have\nplotted the values of rN and rc evaluated as functions of nb for YL = 0.3, C1 = 400 MeV\nfm2 and C2 = 0.01, 1.0, 2.5. Discontinuities in rN and rc at the transition points have been\nthus clarified. In the case of C2 = 0.01 in which all the five crystalline phases appear,\nwe observe the same dimensionality dependence of rc as observed for neutron star matter\n(see Fig. 5 in Ref. [11]), i.e., it is largest for d = 3 (spheres and cylindrical holes) and\nsmallest for d = 1 (slabs).\nWe finally address the question of how the neutron densities outside and inside the\nnuclear matter region change as the system melts into uniform nuclear matter. Comparison of these densities with the one for the uniform phase has been made in Fig. 7 for\nYL =0.3, C1 =400 MeV fm2 and C2 = 0.01, 0.1, 1.0, 2.5. We can observe from this figure\nthat for densities up to the melting point, the density of the dripped neutron gas remains\nnegligibly small compared with the neutron density inside the nuclear matter region. This\nbehavior, which stems from the neutrino trapping (see Section 1) and manifests itself for\nthe other values of YL and C1 , is consistent with the results obtained by Ogasawara and\n\n16\n\n\fSato [18] in their Thomas-Fermi calculations at various values of YL and zero temperature.\nWe also find from the comparison of Fig. 7 with Fig. 6 in Ref. [11] that the difference in\nthe neutron density profiles between the crystalline and uniform phases at the melting\npoint is remarkable in contrast with the case of neutron star matter, in which the neutron density profile is fairly levelled just below the melting point. In supernova matter, in\nwhich neighbouring nuclei (or bubbles) appear to touch and fuse each other at the melting\npoint, neutrino elastic scattering off nuclear \"pasta\" is thus expected to take effect until\nit becomes uniform.\n\n5\n\nThermal fluctuations\n\nGiven occurrence of the phases with rod-like and slab-like nuclei as expected for typical\nvalues of Esurf and YL from the zero-temperature phase diagrams exhibited in the previous\nsection, we turn to the estimates of thermally induced displacements of these nuclei from\ntheir equilibrium positions. In making such estimates, we utilize the expressions for such\ndisplacements that were written in Ref. [11] on the basis of the elastic constants [14]\ncontrolling small deformation of the nuclei. For the layered lattice of slab-like nuclei, the\nmean square of the displacement v of layers in their normal direction reads (Eq. (36) in\nRef. [11])\nL\nkB T\nln\nh|v| i ≃ √\na\n4π BK1\n\u0012\n\n2\n\n\u0013\n\n,\n\n(15)\n\nwhere kB is the Boltzmann constant, a = 2rc is the layer spacing, B and K1 are the elastic\nconstants given by Eqs. (28) and (29) in Ref. [11], respectively, and the length scale L of\nthe lattice is assumed to be far larger than rc . For the two-dimensional triangular lattice\n17\n\n\fof rod-like nuclei, the mean square of the displacement vector v of cylinders in a plane\nperpendicular to their elongated direction is expressed as (Eq. (37) in Ref. [11])\nh|v|2 i ≃\nwhere λ =\n\nkB T\n√\n,\n(B + 2C) πλa\n\n(16)\n\nq\n\n2K3 /(B + 2C), B, C and K3 are the elastic constants given by Eqs. (31),\n√\n(34) and (35) in Ref. [11], respectively, a = (2π/ 3)1/2 rc is the lattice constant for\nhexagonal cells, and the linear dimension of the lattice in the plane including v is assumed\n\nto be much larger than rc and to be much smaller than the length of the nuclei. It\nis important to notice that all the elastic constants, derived by Pethick and Potekhin\n[14] from the calculations of the electrostatic and interfacial energy increase due to the\nnuclear deformation, are proportional to the electrostatic energy density, wC+L , given by\nEq. (8) in Ref. [11]. Since wC+L in turn behaves as ∝ x2 , the non-spherical nuclei in\nsupernova cores are more difficult to deform than those in neutron star crusts. As was\nnoted in [11] concerning the crossover temperature T0 from the quantum-fluctuation to the\n> T but underestimate\nthermal-fluctuation regime, expressions (15) and (16) hold for T ∼\n0\n< T . In the case of supernova matter considered here, T can be\nthe displacements for T ∼\n0\n0\n\nroughly estimated to be of order 107 K for planar nuclei and of order 109 K for cylindrical\nnuclei.\nLet us then ask how large the root-mean-square displacement\n\nq\n\nh|v|2 i of a planar or\n\ncylindrical nucleus is relative to the shortest distance, a/2 − rN , between the surface of\nthe nucleus in its equilibrium position and the boundary of the cell containing it. The\nratio of these two lengths for the planar (cylindrical) nucleus has been plotted in Fig. 8\n(9) at T = 10 MeV and L = 10 km, appropriate to the subnuclear density regime inside\n18\n\n\fsupernova cores; the L dependence of the displacement, which is logarithmic, makes little\ndifferences. We can find from these figures the dominance of the relative displacement\nof the planar nucleus over that of the cylindrical nucleus, yielded by the logarithmic\nfactor appearing in Eq. (15), as well as the suppression of the relative displacements\nby Esurf , which were obtained also for neutron star crusts (see Figs. 7 and 8 in Ref.\n[11]). This Esurf dependence then communicates with the suppression of the relative\ndisplacements by YL as exhibited in Figs. 8 and 9 via the relation between Esurf and YL\nshown in Fig. 1. In examining the competition between the influences of temperature and\nof elasticity as pointed out in Section 1, it is noteworthy that the relative displacements\nthus obtained are larger than those obtained for neutron star crusts by less than a factor\nof ten. This is because the influence of the difference in the typical temperature by two\norders-of-magnitude surpasses that of the above-mentioned difference in the elasticity of\nthe nucleus. In case we set the melting condition as\n\nq\n\nh|v|2 i = a/2 − rN , the enhanced\n\nrelative displacements in supernova cores do not modify our previous conclusion [11]\nobtained for neutron star crusts that the triangular lattice of rod-like nuclei is stable\nagainst thermal fluctuations for our typical nuclear model, but change the conclusion\nabout the layered lattice of slab-like nuclei from its marginal instability [11] depending\non the nuclear models to its instability almost independent of them. Given uncertainties\nin the temperature profile of the core, it is useful to estimate the critical temperature Tc\nat which the relative displacements become unity; the results for Tc have been plotted in\nFigs. 10 and 11 for the layered lattice and the triangular lattice, respectively.\n\n19\n\n\f6\n\nConclusion\n\nThe dependence on the lepton fraction YL of the phase diagrams associated with the\nchanges in the nuclear shape has been studied for zero-temperature supernova matter at\nsubnuclear densities. We have found that with increasing YL, the density region occupied\nby the \"pasta\" phases, i.e., the phases with non-spherical nuclei and with bubbles, becomes\nlarger. Despite the considerable increase in the lepton fraction from neutron star matter,\nleading to enhancement of the proton fraction in the nuclear matter region and suppression\nof the density of the dripped neutron gas, not only the sequence of the nuclear shape\n(sphere → cylinder → slab → uniform with increasing density) obtained for the typical\nnuclear model but also the effectiveness of thermal fluctuations at the dissolution of slablike nuclei has been shown to be analogous to the case of neutron star matter.\nThe actual presence of nuclear \"pasta\" in supernova cores depends on how the uncertain properties of bulk nuclear matter having a proton fraction of order 0.3 affect the\nstability of the \"pasta\" and on whether or not the time needed to form the \"pasta\" is\nsmall compared with the time scale of stellar collapse. If future work about these questions were in favor of the occurrence of the \"pasta\", it would be significant to calculate the\nfinite-temperature equation of state and neutrino transport in the presence of the \"pasta\"\nphases and to incorporate them into a supernova simulation with a neutrino radiation hydrodynamics code. This would clarify the influence of the \"pasta\" on the lepton fraction\nat the onset of the neutrino trapping.\n\n20\n\n\fAcknowledgements\nThis work was supported in part by Grants-in-Aid for Scientific Research provided by\nthe Ministry of Education, Science and Culture of Japan through Research Grant No.\n07CE2002 and No. 10-03687.\n\n21\n\n\fReferences\n[1] H.A. Bethe, Rev. Mod. Phys. 62 (1990) 801.\n[2] H. Suzuki, in Physics and Astrophysics of Neutrinos, eds. M. Fukugita and A. Suzuki\n(Springer, Tokyo, 1994), p. 763.\n[3] D.Z. Freedman, Phys. Rev. D9 (1974) 1389.\n[4] K. Sato, Prog. Theor. Phys. 53 (1975) 595; Prog. Theor. Phys. 54 (1975) 1325.\n[5] D.G. Ravenhall, C.J. Pethick and J.R. Wilson, Phys. Rev. Lett. 50 (1983) 2066.\n[6] M. Hashimoto, H. Seki and M. Yamada, Prog. Theor. Phys. 71 (1984) 320.\n[7] M. Lassaut, H. Flocard, P. Bonche, P.H. Heenen and E. Suraud, Astron. Astrophys.\n183 (1987) L3.\n[8] A. Mezzacappa, M. Liebendörfer, O.E.B. Messer, W.R. Hix, F.-K. Thielemann and\nS.W. Bruenn, astro-ph/0005366.\n[9] C.J. Horowitz, Phys. Rev. D55 (1997) 4577.\n[10] S.W. Bruenn and A. Mezzacappa, Phys. Rev. D56 (1997) 7529.\n[11] G. Watanabe, K. Iida and K. Sato, astro-ph/0001273 (to be published in Nucl. Phys.\nA).\n[12] K. Oyamatsu, I. Tanihata, Y. Sugahara, K. Sumiyoshi and H. Toki, Nucl. Phys. A634\n(1998) 3.\n22\n\n\f[13] G. Baym, H.A. Bethe and C.J. Pethick, Nucl. Phys. A175 (1971) 225.\n[14] C.J. Pethick and A.Y. Potekhin, Phys. Lett. B427 (1998) 7.\n[15] D.G. Ravenhall, C.D. Bennett and C.J. Pethick, Phys. Rev. Lett. 28 (1972) 978.\n[16] J. Arponen, Nucl. Phys. A191 (1972) 257.\n[17] K. Kolehmainen, M. Prakash, J.M. Lattimer and J.R. Treiner, Nucl. Phys. A439\n(1985) 535.\n[18] R. Ogasawara and K. Sato, Prog. Theor. Phys. 68 (1982) 222.\n\n23\n\n\fFig. 1. The surface energy per unit area (the surface tension) as a function of x.\nThe thick lines are the present results obtained from Eq. (6) for C1 = 400 MeV fm2 ,\nC2 = 0.01, 0.1, 0.5, 1.0, 2.5 and YL = 0.2, 0.3, 0.4. The solid curve is the RBP result from\ntheir HF calculation [15], and the dotted curve is the BBP result [13]. The cross denotes\nthe value adopted by Ravenhall et al. [5].\nFig. 2. Zero-temperature phase diagrams on the nb versus C2 plane, evaluated for\nYL = 0.3 and C1 = 300, 400, 600 MeV fm2 .\nFig. 3. Zero-temperature phase diagrams on the nb versus C2 plane, evaluated for\nYL = 0.2, 0.25, 0.3, 0.4 and C1 = 400 MeV fm2 .\nFig. 4. Energy per nucleon relative to that of uniform matter calculated for YL = 0.3,\nC1 = 400 MeV fm2 and C2 = 1.0 as a function of baryon density nb . The symbols SP,\nC, S, CH and SPH stand for sphere, cylinder, slab, cylindrical hole and spherical hole,\nrespectively.\nFig. 5. Energy per nucleon of the phase with spherical bubbles relative to that with\nslab-like nuclei, calculated for YL = 0.3, C1 = 400 MeV fm2 and C2 = 1.0 as a function of\nbaryon density nb . The absolute value of the curvature energy per nucleon of the phase\nwith spherical bubbles is also evaluated for the curvature thermodynamic potential per\nunit length ωc = 0.1, 0.2, 0.5 MeV fm−1 .\nFig. 6. Size of a nucleus or bubble, rN , and of a Wigner-Seitz cell, rc , calculated for\nYL = 0.3, C1 = 400 MeV fm2 and C2 = 0.01, 1.0, 2.5 as a function of baryon density nb .\nThe symbols SP, C, S, CH and SPH stand for sphere, cylinder, slab, cylindrical hole and\nspherical hole, respectively.\n\n24\n\n\fFig. 7. The neutron densities obtained for YL = 0.3, C1 = 400 MeV fm2 and C2 =\n0.01, 0.1, 1.0, 2.5 as a function of baryon density nb . The lines classified by [n(1 − x)]N and\nnn represent the neutron densities in the nuclear matter region and in the neutron gas\nregion for the phases with nuclei, respectively. The lines classified by [n(1 − x)]uni denote\nthe neutron densities in uniform nuclear matter.\nFig. 8. The root-mean-square displacement of a planar nucleus at kB T = 10 MeV,\ndivided by the shortest distance between the surface of the nucleus in its equilibrium\nposition and the boundary of the cell containing it. The curves are obtained for C1 = 400\nMeV fm2 and for various sets of YL and C2 as a function of baryon density nb . The thick\ncurves lying between the two vertical lines are the results in the density region in which\nthe phase with planar nuclei is energetically stable.\nFig. 9. The root-mean-square displacement of a cylindrical nucleus at kB T = 10 MeV,\ndivided by the distance between the surface of the nucleus in its equilibrium position and\nthe boundary of the cell containing it. The curves are obtained for C1 = 400 MeV fm2\nand for various sets of YL and C2 as a function of baryon density nb . The thick curves\nlying between the two vertical lines are the results in the density region in which the phase\nwith cylindrical nuclei is energetically stable.\nFig. 10. The critical temperature Tc for the phase with planar nuclei as a function of\nbaryon density nb . The thick curves lying between the two vertical lines are the results\nin the density region in which the phase with planar nuclei is energetically stable. C1 is\ntaken to be 400 MeV fm2 .\n\n25\n\n\fFig. 11. The critical temperature Tc for the phase with cylindrical nuclei as a function\nof baryon density nb . The thick curves lying between the two vertical lines are the results\nin the density region in which the phase with cylindrical nuclei is energetically stable. C1\nis taken to be 400 MeV fm2 .\n\n26\n\n\fFigure 1:\n\n27\n\n\fFigure 2:\n\n28\n\n\f1\n\n0.1\n\n0.01\n\n1\n\n0.1\n\n0.01\n0\n\n0.05\n\n0.1\n\nFigure 3:\n29\n\n0.15 0\n\n0.05\n\n0.1\n\n0.15\n\n\fFigure 4:\n30\n\n\fFigure 5:\n31\n\n\fFigure 6:\n32\n\n\fFigure 7:\n33\n\n\fFigure 8:\n34\n\n\fFigure 9:\n35\n\n\fFigure 10:\n36\n\n\fFigure 11:\n37\n\n\f"}