{"id": "http://arxiv.org/abs/astro-ph/0203038v1", "guidislink": true, "updated": "2002-03-04T15:17:06Z", "updated_parsed": [2002, 3, 4, 15, 17, 6, 0, 63, 0], "published": "2002-03-04T15:17:06Z", "published_parsed": [2002, 3, 4, 15, 17, 6, 0, 63, 0], "title": "Nuclear Stellar Disks in Spiral Galaxies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0203480%2Castro-ph%2F0203113%2Castro-ph%2F0203195%2Castro-ph%2F0203427%2Castro-ph%2F0203121%2Castro-ph%2F0203346%2Castro-ph%2F0203296%2Castro-ph%2F0203074%2Castro-ph%2F0203218%2Castro-ph%2F0203368%2Castro-ph%2F0203478%2Castro-ph%2F0203052%2Castro-ph%2F0203243%2Castro-ph%2F0203042%2Castro-ph%2F0203193%2Castro-ph%2F0203115%2Castro-ph%2F0203206%2Castro-ph%2F0203379%2Castro-ph%2F0203395%2Castro-ph%2F0203406%2Castro-ph%2F0203387%2Castro-ph%2F0203411%2Castro-ph%2F0203404%2Castro-ph%2F0203068%2Castro-ph%2F0203440%2Castro-ph%2F0203413%2Castro-ph%2F0203363%2Castro-ph%2F0203036%2Castro-ph%2F0203192%2Castro-ph%2F0203062%2Castro-ph%2F0203497%2Castro-ph%2F0203421%2Castro-ph%2F0203474%2Castro-ph%2F0203255%2Castro-ph%2F0203407%2Castro-ph%2F0203365%2Castro-ph%2F0203418%2Castro-ph%2F0203403%2Castro-ph%2F0203372%2Castro-ph%2F0203155%2Castro-ph%2F0203360%2Castro-ph%2F0203477%2Castro-ph%2F0203356%2Castro-ph%2F0203233%2Castro-ph%2F0203285%2Castro-ph%2F0203043%2Castro-ph%2F0203315%2Castro-ph%2F0203458%2Castro-ph%2F0203135%2Castro-ph%2F0203145%2Castro-ph%2F0203011%2Castro-ph%2F0203208%2Castro-ph%2F0203448%2Castro-ph%2F0203453%2Castro-ph%2F0203323%2Castro-ph%2F0203237%2Castro-ph%2F0203341%2Castro-ph%2F0203190%2Castro-ph%2F0203204%2Castro-ph%2F0203450%2Castro-ph%2F0203153%2Castro-ph%2F0203132%2Castro-ph%2F0203381%2Castro-ph%2F0203433%2Castro-ph%2F0203166%2Castro-ph%2F0203258%2Castro-ph%2F0203358%2Castro-ph%2F0203172%2Castro-ph%2F0203178%2Castro-ph%2F0203112%2Castro-ph%2F0203351%2Castro-ph%2F0203479%2Castro-ph%2F0203088%2Castro-ph%2F0203213%2Castro-ph%2F0203284%2Castro-ph%2F0203005%2Castro-ph%2F0203142%2Castro-ph%2F0203060%2Castro-ph%2F0203098%2Castro-ph%2F0203122%2Castro-ph%2F0203149%2Castro-ph%2F0203198%2Castro-ph%2F0203061%2Castro-ph%2F0203462%2Castro-ph%2F0203029%2Castro-ph%2F0203174%2Castro-ph%2F0203439%2Castro-ph%2F0203210%2Castro-ph%2F0203250%2Castro-ph%2F0203275%2Castro-ph%2F0203429%2Castro-ph%2F0203312%2Castro-ph%2F0203111%2Castro-ph%2F0203168%2Castro-ph%2F0203490%2Castro-ph%2F0203408%2Castro-ph%2F0203251%2Castro-ph%2F0203096%2Castro-ph%2F0203109%2Castro-ph%2F0203038%2Castro-ph%2F0203023&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nuclear Stellar Disks in Spiral Galaxies"}, "summary": "We report evidence for nuclear stellar disks in 3 early-type spirals, namely\nNGC 1425, NGC 3898 and NGC 4698, revealed by WFPC2/F606W images out of a sample\nof 38 spiral galaxies, selected from the Hubble Space Telescope Data Archive.\nAdopting the photometric method introduced by Scorza & Bender we derived their\ncentral surface brightness and scalelength by assuming them to be\ninfinitesimally thin exponential disks. No nuclear disk was found in barred\ngalaxies or galaxies of Hubble type later than Sb. The external origin of the\ndisk in NGC 4698 is strongly suggested by its orthogonal geometrical decoupling\nwith respect to the host galaxy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0203480%2Castro-ph%2F0203113%2Castro-ph%2F0203195%2Castro-ph%2F0203427%2Castro-ph%2F0203121%2Castro-ph%2F0203346%2Castro-ph%2F0203296%2Castro-ph%2F0203074%2Castro-ph%2F0203218%2Castro-ph%2F0203368%2Castro-ph%2F0203478%2Castro-ph%2F0203052%2Castro-ph%2F0203243%2Castro-ph%2F0203042%2Castro-ph%2F0203193%2Castro-ph%2F0203115%2Castro-ph%2F0203206%2Castro-ph%2F0203379%2Castro-ph%2F0203395%2Castro-ph%2F0203406%2Castro-ph%2F0203387%2Castro-ph%2F0203411%2Castro-ph%2F0203404%2Castro-ph%2F0203068%2Castro-ph%2F0203440%2Castro-ph%2F0203413%2Castro-ph%2F0203363%2Castro-ph%2F0203036%2Castro-ph%2F0203192%2Castro-ph%2F0203062%2Castro-ph%2F0203497%2Castro-ph%2F0203421%2Castro-ph%2F0203474%2Castro-ph%2F0203255%2Castro-ph%2F0203407%2Castro-ph%2F0203365%2Castro-ph%2F0203418%2Castro-ph%2F0203403%2Castro-ph%2F0203372%2Castro-ph%2F0203155%2Castro-ph%2F0203360%2Castro-ph%2F0203477%2Castro-ph%2F0203356%2Castro-ph%2F0203233%2Castro-ph%2F0203285%2Castro-ph%2F0203043%2Castro-ph%2F0203315%2Castro-ph%2F0203458%2Castro-ph%2F0203135%2Castro-ph%2F0203145%2Castro-ph%2F0203011%2Castro-ph%2F0203208%2Castro-ph%2F0203448%2Castro-ph%2F0203453%2Castro-ph%2F0203323%2Castro-ph%2F0203237%2Castro-ph%2F0203341%2Castro-ph%2F0203190%2Castro-ph%2F0203204%2Castro-ph%2F0203450%2Castro-ph%2F0203153%2Castro-ph%2F0203132%2Castro-ph%2F0203381%2Castro-ph%2F0203433%2Castro-ph%2F0203166%2Castro-ph%2F0203258%2Castro-ph%2F0203358%2Castro-ph%2F0203172%2Castro-ph%2F0203178%2Castro-ph%2F0203112%2Castro-ph%2F0203351%2Castro-ph%2F0203479%2Castro-ph%2F0203088%2Castro-ph%2F0203213%2Castro-ph%2F0203284%2Castro-ph%2F0203005%2Castro-ph%2F0203142%2Castro-ph%2F0203060%2Castro-ph%2F0203098%2Castro-ph%2F0203122%2Castro-ph%2F0203149%2Castro-ph%2F0203198%2Castro-ph%2F0203061%2Castro-ph%2F0203462%2Castro-ph%2F0203029%2Castro-ph%2F0203174%2Castro-ph%2F0203439%2Castro-ph%2F0203210%2Castro-ph%2F0203250%2Castro-ph%2F0203275%2Castro-ph%2F0203429%2Castro-ph%2F0203312%2Castro-ph%2F0203111%2Castro-ph%2F0203168%2Castro-ph%2F0203490%2Castro-ph%2F0203408%2Castro-ph%2F0203251%2Castro-ph%2F0203096%2Castro-ph%2F0203109%2Castro-ph%2F0203038%2Castro-ph%2F0203023&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report evidence for nuclear stellar disks in 3 early-type spirals, namely\nNGC 1425, NGC 3898 and NGC 4698, revealed by WFPC2/F606W images out of a sample\nof 38 spiral galaxies, selected from the Hubble Space Telescope Data Archive.\nAdopting the photometric method introduced by Scorza & Bender we derived their\ncentral surface brightness and scalelength by assuming them to be\ninfinitesimally thin exponential disks. No nuclear disk was found in barred\ngalaxies or galaxies of Hubble type later than Sb. The external origin of the\ndisk in NGC 4698 is strongly suggested by its orthogonal geometrical decoupling\nwith respect to the host galaxy."}, "authors": ["A. Pizzella", "E. M. Corsini", "L. Morelli", "M. Sarzi", "C. Scarlata", "M. Stiavelli", "F. Bertola"], "author_detail": {"name": "F. Bertola"}, "author": "F. Bertola", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/340486", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0203038v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0203038v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 5 PostScript figures. Accepted for pubblication in ApJ", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0203038v1", "affiliation": "Univ. of Padova", "arxiv_url": "http://arxiv.org/abs/astro-ph/0203038v1", "journal_reference": null, "doi": "10.1086/340486", "fulltext": "Nuclear Stellar Disks in Spiral Galaxies1\nA. Pizzella1 , E.M. Corsini1 , L. Morelli1 , M. Sarzi1,2 , C. Scarlata1,3 , M. Stiavelli3 and\nF. Bertola1\n\narXiv:astro-ph/0203038v1 4 Mar 2002\n\nABSTRACT\nWe report evidence for nuclear stellar disks in 3 early-type spirals, namely\nNGC 1425, NGC 3898 and NGC 4698, revealed by WFPC2/F606W images out\nof a sample of 38 spiral galaxies, selected from the Hubble Space Telescope Data\nArchive. Adopting the photometric method introduced by Scorza & Bender we\nderived their central surface brightness and scalelength by assuming them to\nbe infinitesimally thin exponential disks. No nuclear disk was found in barred\ngalaxies or galaxies of Hubble type later than Sb. The external origin of the disk\nin NGC 4698 is strongly suggested by its orthogonal geometrical decoupling with\nrespect to the host galaxy.\nSubject headings: galaxies: individual: NGC 1425 - galaxies: individual: NGC 3898\n- galaxies: individual: NGC 4698 - galaxies: photometry - galaxies: spiral\n- galaxies: structure\n\n1.\n\nIntroduction\n\nIn the last decade, embedded stellar disks or disky distorsions have been found in many\nelliptical and S0 galaxies (Scorza & Bender 1995 hereafter SB95; Seifert & Scorza 1996).\nThey are characterized by a smaller scalelength and higher central surface brightness with\nrespect to the large kpc-scale disks typical of lenticular and spiral galaxies. The existence\nof embedded disks gives further observational support to the idea that the disky ellipticals\n1\n\nDipartimento di Astronomia, Università di Padova, Vicolo dell'Osservatorio 2, I-35122 Padova, Italy\n\n2\n\nMax-Planck-Institut für Astronomie, Koenigstuhl 17, D-69117 Heidelberg, Germany\n\n3\n\nSpace Telescope Science Institute, 3700 San Martin Dr., Baltimore, MD 21218, USA\n\n1\n\nBased on observations with the NASA/ESA Hubble Space Telescope, obtained from the data Archive at\nthe Space Telescope Science Institute, which is operated by the Association of the Universities for Research\nin Astronomy, Inc., under NASA contract NAS 5-26555.\n\n\f–2–\nare the continuation of the sequence ranging from Im's through spirals to S0's (Kormendy\n& Bender 1996 and references therein). This suggests also a continuity in the formation\nhistory, whereby one or several parameters of the protogalaxy vary smoothly (e.g. van den\nBosch 1998).\nSubarcsecond resolution provided by state-of-the-art ground and space-based telescopes\nhave revealed even smaller stellar disks in the nuclear region of nearby galaxies. To date\nthe smallest disks we know have scalelengths of few tens of pc and they have been identified\nin the nucleus of a handful of early-type disk galaxies: the S0's NGC 3115 (SB95; Lauer\net al. 1995), NGC 4342 (van den Bosch, Jaffe, & van der Marel 1998; Scorza & van den\nBosch 1998), and S0 NGC 4570 (van den Bosch et al. 1998; Scorza & van den Bosch 1998;\nvan den Bosch & Emsellem 1998), and the Sa NGC 4594 (Burkhead 1986, 1991; Kormendy\n1988; Emsellem et al. 1994, 1996). In addition, nuclear stellar disks of gas, dust and stars\nhave been found in the E3 galaxy NGC 5845 (Kormendy et al. 1994) and in the dwarf E2\ngalaxy NGC 4486A (Kormendy et al. 2002). Although the photometric parameters are not\nknown, these stellar disks appear to be similar to those of NGC 3115 and NGC 4594. This\nphenomenon may be more common if some of the E and S0 galaxies with disky isophotes\nobserved by Ravindranath et al. (2001) and Rest et al. (2001) turn out to host a nuclear\nstellar disk.\nThe presence of nuclear disks raises the question about the epoch (i.e. coeval or not\nwith that of the host) and mechanism (i.e. external or internal origin) of their formation.\nIndeed, it is possible that they formed with a different mechanism than the one that formed\nnormal S0 disks since their size is one order of magnitude smaller. The blue colour of the\nnuclear disks of NGC 4342, NGC 4570 and NGC 4486A suggests they are made of younger\nstars with respect to the bulk of their host galaxy (van den Bosch et al. 1998; Kormendy\net al. 2002). In the framework of galaxy formation via hierarchical merging acquired gas\nmay end up forming some of these nuclear stellar disks. On the other hand, they could be\nbuilt up from gas transported towards the galaxy center during the secular evolution of a\nbar. This seems to be the case of NGC 4570 (van den Bosch & Emsellem 1998), where the\nobserved features in photometry and kinematics correspond with the position of the main\nresonances of a small bar. Furthermore, any model for the formation of nuclear disks has\nto account for supermassive black holes, which are supposed to reside in every galaxy and\nwhose gravitational influence may extend to pc scale of the disks. Galaxies hosting nuclear\ndisks are not exceptions in this context as NGC 3115, NGC 4342, NGC 4594, and NGC 5845\nare known to harbour a central supermassive black hole (Kormendy et al. 1996a,b; Cretton\n& van den Bosch 1999, Kormendy & Gebhardt 2002).\nTo date studies on nuclear stellar disks considered mainly elliptical or S0 galaxies but\n\n\f–3–\nthere is no a priori reason why they should not be present also in spiral galaxies. Would this\nbe true, such nuclear disks would be the result of star formation by gas either driven toward\nthe center by a bar instability or acquired from the outside.\nFor these reasons we undertook a search for nuclear stellar disks in spiral galaxies based\non HST/WFPC2 archive images. In this paper we present as a result of our investigation\nthree new cases of spiral galaxies hosting a nuclear disk embedded in their main outer disk\nand bulge.\n\n2.\n\nSearching for nuclear stellar disks in spirals\n2.1.\n\nSample selection\n\nWe selected RC3 (de Vaucouleurs et al. 1991) galaxies classified as spiral (T ≥ 0),\nand with cz < 2000 km s−1 . We restricted our sample to galaxies within 20 Mpc (for\nH0 = 100 km s−1 Mpc−1 ) to be able to detect 10-pc scalelength nuclear disks on WFPC2/PC\nframes out to about 2 – 3 scalelengths. We did not exclude low-inclined galaxies from the\nsample since nuclear disks might have a different inclination with respect to their hosts.\nWe searched the HST science archive looking for all the available images. We realized that\nWFPC2/F606W was the only camera/filter combination producing an homogeneous sample\nlarge enough for our purposes (159 galaxies). This resulted in a sample of 112 objects after\nwe rejected those frames where galaxy nucleus was out or too close to the chip edge as well\nas those with too short exposure times.\nIt has to be noted that all but 3 of the selected galaxies belong to 4 SNAP observing\nprograms: (1) 57 objects were taken from the sample of disk galaxies ranging from E/S0\nto spirals observed in Program ID 5446 (PI: G. Illingworth); (2) 33 are unbarred Sa/Sb\nspirals from Program ID 6359 (PI: M. Stiavelli); (3) 14 spirals were taken from the nearby\nSeyfert galaxies observed in Program ID 5479 (PI: M. Malkan); (4) 5 are Seyfert spirals\nfrom Program ID 8597 (PI: M. Regan). In our final sample the Hubble types ranging from\nSa to Scd are well represented as well as the number of barred spirals roughly equals that\nof unbarred ones, although images were collected from HST programs based on different\nselection criteria.\n\n\f–4–\n2.2.\n\nAnalysis of the HST archive images\n\nThe on-the-fly calibrated WFPC2/F606W images of the 112 sample galaxies were retrieved from the HST archive. The different images of the same target were aligned and\ncombined. Cosmic ray events were removed with IRAF tasks CRREJ and IMEDIT. The\nconversion to the Johnson system has been calculated using SYNPHOT in STSDAS. Since\nthis correction depends on the spectral energy distribution of the object, it has been calculated using the Kinney et al. (1996) spectral templates.\nAs a first step to identify candidates hosting a nuclear disk we construct unsharpmasked images for all the sample galaxies, dividing each WFPC2/F606W frame by itself\nafter being convolved with a circular Gaussian of σ = 2,4, and 6 pixels, respectively (Fig.\n1). The advantage of this procedure is to quickly enhance any surface-brightness fluctuation\nand non-circular structure extending over a spatial region comparable with the σ of the\nsmoothing Gaussian.\nIn the present context this enables first to set apart 74 galaxies whose nucleus is strongly\naffected by dusts, preventing any further analysis. This is the case of NGC 1637 shown, as\nan example, in Fig. 1. It should be noted that, in principle, one can check for the presence\nof dust lanes using images with different filters which are not available for the whole galaxy\nsample. However adopting different values for σ in the unsharp-mask allows to clearly reveal\ndust lanes, when present.\nSuccessively, on the unsharp-masked images of the 38 remaining galaxies, we looked\nfor the highly flattened nuclear structures which are possibly inclined nuclear disks. Such\nflattened structures are not artifacts of the unsharp-masking procedure since they are always\nassociated to a central increase of ellipticity as measured by performing the isophotal analysis\nusing the IRAF task ELLIPSE. This subset of 38 galaxies ranges from Sa to Sm and from\nMB0 T = −15.6 to −20.0 as shown in Fig. 2 and represents our qualified sample for which\nwe are confident we are able to detect an inclined nuclear disk, if present. We found three\nobjects, namely NGC 1425, NGC 3898 and NGC 4698, which show this flattened nuclear\nstructure (Fig. 1). A positive fourth cosine Fourier coefficient (describing the disky deviation\nof the isophotes from pure ellipses) confirms the presence of a nuclear stellar disk in inner\nregions of these early-type spirals (Fig. 3). In Fig. 1 we show the case of NGC 4539 as an\nexample of those galaxies where we did not identify any nuclear flattened structure.\n\n\f–5–\n2.3.\n\nPhotometric decomposition\n\nOnce the existence of the nuclear disks is established, we derived their photometrical\nproperties by using the method described by SB95. When adopting this technique to study\nthe innermost regions of galaxies it is essential to restore the images from the effects of the\nHST point spread function (PSF) in order to properly derive the nuclear disks parameters,\nas shown by Scorza & van den Bosch (1998). Such deconvolution was performed through\nthe Richardson-Lucy method by means of the IRAF task LUCY. Although susceptible to\nnoise amplification, this algorithm has been proved by van den Bosch et al. (1998) to\nlead to a restored surface-brightness distribution comparable to the one obtained by means\nof a multi-Gaussian representation (Monnet, Bacon, & Emsellem 1992). We decided to\ndeconvolve the images with a number of iterations between 3 and 6. A larger number of\niterations does not affect the result of the decomposition but amplify the noise. We believe\nthat the results obtained by van den Bosch et al. (1998) are directly applicable to our case:\nwe are dealing with images obtained with similar or longer integration times, galaxies with\nless steep surface-brightness profiles and nuclear disks with equal or larger scalelengths.\nFor each given image and nucleus position on the PC (NGC 3898, NGC 4698) or WF2\nCCD (NGC 1425) we adopted a model PSF calculated using the TINY-TIM package (Krist\n& Hook 1999). No correction for telescope jitter was necessary. The SB95 method consists\nin the iterative subtraction from the galaxy image of a thin disk model. The parameters\nof such a disk are varied until the departures from perfect ellipses are smallest (i.e. a4 and\na6 are nearly zero). For the disk component we assumed an exponential surface brightness\nprofile, with central surface brightness μ0 , radial scalelength h, and an inclination given\nby i = arccos (b/a). We verified that the parameters of nuclear disks resulting from the\nphotometric decomposition are not affected by small changes in PSF (e.g. its generation in\ndifferent chip positions).\n\n3.\n\nResults\n\nThe results of the photometric decomposition of the surface-brightness distribution of\nNGC 1425, NGC 3898 and NGC 4698 are shown in Fig. 3 and Fig. 4. In Fig. 3 we plot\nthe ellipticity, position angle, a4 , and a6 Fourier coefficient radial profiles before and after\nthe nuclear disk subtraction. In Fig. 4 the same is true for the galaxy isophotes. The\nphotometric parameters derived for the nuclear disks are given in Tab. 1. Here we discuss\nthe individual objects.\nNGC 1425. To obtain a residual bulge with nearly elliptical isophotes we needed to sub-\n\n\f–6–\ntract two exponential thin disks of different scalelengths, central surface brightnesses and\ninclinations. If this difference in inclination is real we are facing two structures in an unstable\nconfiguration.\nAs discussed by Scorza & van den Bosch (1998) for the the nuclear and main disks of\nNGC 4342, it is more likely we are looking at two thick disks of different thickness (e.g., the\nexponential spheroid disks of van den Bosch & de Zeeuw 1996) rather than two infinitesimally\nthin disks of different inclination. Such a different thickness may be interpreted as due to\nthe presence of two distinct exponential disks. Alternatively we may think we are facing a\nnon-exponential disk with tickness varying with radius. Considering the two disk hypotesis,\nwe note that the photometric properties of the larger-scale disk are close to those observed\nfor disky ellipticals (Fig. 5).\nNGC 3898. The galaxy hosts a small (h = 18 pc) nuclear disk that is noticeable in\nparticular from the Fourier a4 coefficient positive values, observed within 0.′′ 6. In terms of\nphysical size this is the smallest disk so far detected. It possibly corresponds to the somewhat\nsteeper rise of the stellar rotation curve measured in the inner 1′′ and the two relative maxima\nin the stellar velocity dispersion at ±1′′ by Vega Beltrán et al. (2001) but not considered in\nthe dynamical modelling of Pignatelli et al. (2001).\nNGC 4698. Although Sandage & Bedke (1994) include this galaxy in The Carnegie Atlas\nof Galaxies as an example of the early-to-intermediate Sa type, NGC 4698 has photometrical\nand kinematical properties which are uncommon among spiral galaxies. It shows a clear geometrical decoupling between bulge and disk and hosts a kinematically isolated core (Bertola\net al. 1999). The nuclear stellar disk corresponds to this isolated core, which is rotating\nperpendicularly with respect to the galaxy main disk (Bertola et al. 1999).\n\n4.\n\nDiscussion and conclusions\n\nWe have provided evidence for the presence of a nuclear disk in 3 early-type spirals,\nnamely NGC 1425, NGC 3898 and NGC 4698 over a qualified sample of 38 objects. The\nphotometric properties of these 20-pc scale exponential disks are consistent with those of the\n4 nuclear disks so far detected in disk galaxies of even earlier morphological type (Fig. 5). We\nhave not found nuclear disks neither in Sbc–Sm nor in barred galaxies although these classes\nrepresents the majority of our sample. To further address the demography of nuclear disks\nwe need to apply the relatively easy approach adopted here (based on unsharp-masking) on\na larger sample of galaxies, imaged at high spatial resolution in near-infrared pass-bands to\ndeal with central dusts which prevented us to exclude the presence of nuclear disks in a large\n\n\f–7–\nfraction (roughly two thirds) of our WFPC2/F606W sample galaxies.\nWithout drawing general conclusions from such a limited number of galaxies, nevertheless we have the indication that the presence of nuclear disks is restricted to S0's and\nbulge-dominated unbarred spiral galaxies. In the framework of massive bulge formation\nthrough a process of hierarchical clustering merging, the nuclear disks may be the final result of dissipational and star-formation processes subsequent to a second acquisition event.\nTo date however, there were only photometric and kinematical evidences that nuclear disks\ncan also be formed via secular evolution of a bar (e.g. NGC 4570).\nWith NGC 4698 we showed for the first time that second events indeed represent a viable\nmechanism to build a nuclear disk in the center of disk galaxies. Indeed the nuclear disk of\nNGC 4698 is geometrically (this paper) and kinematically (Bertola et al. 1999) decoupled\nin an orthogonal way with respect to the host galaxy. This phenomenon can be hardly\nexplained without invoking the acquisition of external material from the galaxy outskirts\n(see Bertola & Corsini 2000).\nWe thank F. van den Bosch for providing us his data for Fig. 5.\n\nREFERENCES\nBertola, F. & Corsini, E. M. 2000, in ASP Conf. Ser. 197, eds. F. Combes et al. (San\nFrancisco: ASP), 115\nBertola, F., Corsini, E. M., Beltrán, J. C. V., Pizzella, A., Sarzi, M., Cappellari, M., &\nFunes, S. J. 1999, ApJ, 519, L127\nBurkhead, M. S. 1986, AJ, 91, 777\nBurkhead, M. S. 1991, AJ, 102, 893\nCretton, N. & van den Bosch, F. C. 1999, ApJ, 514, 704\nde Vaucouleurs, G., de Vaucouleurs, A., Corwin, J. R., Buta, R. J., Paturel, G., & Fouque,\nP. 1991, Third Reference Catalogue of Bright Galaxies, (New York: Springer-Verlag)\n(RC3)\nEmsellem, E., Monnet, G., Bacon, R. & Nieto, J.-L. 1994, A&A, 285, 739\nEmsellem, E., Bacon, R., Monnet, G. & Poulain, P. 1996, A&A, 312, 777\n\n\f–8–\nKinney, A. L., Calzetti, D., Bohlin, R. C., McQuade, K., Storchi-Bergmann, T., & Schmitt,\nH. R. 1996, ApJ, 467, 38\nKormendy, J. 1988, ApJ, 335, 40\nKormendy, J. & Bender, R. 1996, ApJ, 464, L119\nKormendy, J. & Gebhardt, K. 2002 in The 20th Texas Symposium on Relativistic Astrophysics, ed. H. Martel & J.C. Wheeler, AIP, in press, (astro-ph/0105230)\nKormendy, J., Dressler, A., Byun, Y. I., Faber, S. M., Grillmair, C., Lauer, T. R., Richstone,\nD., & Tremaine, S. 1994, in Dwarf Galaxies, ed. G. Meylan & P. Prugniel (Garching:\nESO), 147\nKormendy, J. et al. 1996a, ApJ, 459, L57\nKormendy, J. et al. 1996b, ApJ, 473, L91\nKormendy, J., Gebhardt, K., Macchetto, F. D. & Sparks, W. B. 2002 AJ submitted, (astroph/0107218)\nKrist, J., Hook, R. 1999, STIS Instrument Handbook Version 4.0 (Baltimore: STScI)\nLauer, T. R. et al. 1995, AJ, 110, 2622\nMonnet, G., Bacon, R. & Emsellem, E. 1992, A&A, 253, 366\nPignatelli, E. et al. 2001, MNRAS, 323, 188\nRavindranath, S., Ho, L. C., Peng, C. Y., Filippenko, A. V., & Sargent, W. L. W. 2001, AJ,\n122, 653\nRest, A., van den Bosch, F. C., Jaffe, W., Tran, H., Tsvetanov, Z., Ford, H. C., Davies, J.,\n& Schafer, J. 2001, AJ, 121, 2431\nSandage, A. & Bedke, J. 1994, The Carnegie Atlas of Galaxies, (Washington, DC: Carnegie\nInstitution and Flintridge Foundation)\nSandage, A. & Tammann, G. A. 1981, Revised Shapley-Ames Catalog of Bright Galaxies,\n(Washington: Carnegie Institution) (RSA)\nScorza, C. & Bender, R. 1995, A&A, 293, 20 (SB95)\nScorza, C. & van den Bosch, F. C. 1998, MNRAS, 300, 469\n\n\f–9–\nSeifert, W. & Scorza, C. 1996, A&A, 310, 75\nTully, R. B. 1988, Nearby Galaxy Catalog, (Cambridge: CUP)\nvan den Bosch, F. C. 1998, ApJ, 507, 601\nvan den Bosch, F. C. & de Zeeuw, P. T. 1996, MNRAS, 283, 381\nvan den Bosch, F. C. & Emsellem, E. 1998, MNRAS, 298, 267\nvan den Bosch, F. C., Jaffe, W. & van der Marel, R. P. 1998, MNRAS, 293, 343\nVega Beltrán, J. C., Pizzella, A., Corsini, E. M., Funes, J. G., Zeilinger, W. W., Beckman,\nJ. E., & Bertola, F. 2001, A&A, 374, 394\n\nThis preprint was prepared with the AAS LATEX macros v5.0.\n\n\f– 10 –\n\nFig. 1.- Left panels: WFPC2/F606W images of NGC 1425, NGC 3898 and NGC 4698\n(where we found a nuclear disk), NGC 4539 (where a nuclear disk is not present), and NGC\n1637 (where dust patches prevent any further analysis). The size of the plotted region is\n19.′′ 3 × 19.′′ 3. The orientation is specified by the arrow indicating north and the segment\nindicating east in the lower right corner of each panel. Middle and right panels: Unsharp\nmasking of the WFPC2/F606W images obtained with σ = 2 and 6 pixels, respectively. Sizes\nand orientations are the same as in the left panels.\n\n\f– 11 –\n\nFig. 2.- Hubble type distribution for the qualified sample of 38 spiral galaxies. The dashed\nregion identifies galaxies with and SB or SAB classification.\n\n\f– 12 –\n\nFig. 3.- Deconvolved radial profiles of ǫ, PA, a4 and a6 Fourier coefficients measured before\n(open squares) and after (filled circles) the subtraction of nuclear disks of Tab. 1 for NGC\n1425 (left panels), NGC 3898 (middle panels) and NGC 4698 (right panels). Error bars\nsmaller than symbols are not plotted.\n\n\f– 13 –\n\nFig. 4.- Contour plots of the WFPC2/F606W deconvolved images of NGC 1425, NGC\n3898, and NGC 4698 before (left panel ) and after (right panel ) the nuclear disk subtraction.\nScales are in arcsec and orientations are the same as in Fig. 1.\n\n\f– 14 –\n\nFig. 5.- μc0 –h diagram adapted from van den Bosch (1998). Open circles refer to HSB\nspirals, triangles to LSB spirals, stars to S0's, filled circles to disky ellipticals, and small\nsquares to nuclear disks in NGC 3115, NGC 4342, NGC 4570 and NGC 4594. Large squares\ncorrespond to the nuclear disks found in this paper, while the large diamond indicates the\nsecond larger disk found in NGC 1425 (see Tab. 1 and Sec. 3). The central inclinationcorrected surface brightness of nuclear disks is μc0 = μ0 − 2.5 log(cos i).\n\n\f– 15 –\n\nTable 1. Parameters of the nuclear disks and host galaxies.\n\nName\nNGC\n\nhost galaxy\nType\nD\nMB0 T\n[RC3] [RSA] [Mpc] [mag]\n\nigal\n[◦ ]\n\nPAgal\n[◦ ]\n\n1425\n***\n3898\n4698\n\nSb(s)\n***\nSab(s)\nSab(s)\n\n63\n***\n54\n52\n\n129\n***\n107\n170\n\nSb(r)\n***\nSa\nSa\n\n13.1\n***\n16.4\n12.6\n\n−19.29\n***\n−19.48\n−19.04\n\nnuclear disk\nμ0\nh\ni\n′′2\n◦\n[mag/ ] [pc] [ ]\n16.90\n18.53\n15.36\n17.27\n\n26\n162\n18\n32\n\nPA\n[◦ ]\n\n70 137\n66 135\n73 102\n74 71\n\nNote. - Distances are from Tully (1988) with H0 = 100 km s−1 Mpc−1 . Absolute\nmagnitudes, position angles and inclinations of the host galaxies are derived from RC3.\n\n\f"}