{"id": "http://arxiv.org/abs/astro-ph/0507027v1", "guidislink": true, "updated": "2005-07-01T13:19:28Z", "updated_parsed": [2005, 7, 1, 13, 19, 28, 4, 182, 0], "published": "2005-07-01T13:19:28Z", "published_parsed": [2005, 7, 1, 13, 19, 28, 4, 182, 0], "title": "Is The Fe M-shell Absorber Part of The Outflow in Active Galactic\n  Nuclei?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0507477%2Castro-ph%2F0507274%2Castro-ph%2F0507619%2Castro-ph%2F0507027%2Castro-ph%2F0507349%2Castro-ph%2F0507267%2Castro-ph%2F0507322%2Castro-ph%2F0507058%2Castro-ph%2F0507312%2Castro-ph%2F0507682%2Castro-ph%2F0507382%2Castro-ph%2F0507476%2Castro-ph%2F0507353%2Castro-ph%2F0507163%2Castro-ph%2F0507607%2Castro-ph%2F0507337%2Castro-ph%2F0507241%2Castro-ph%2F0507459%2Castro-ph%2F0507710%2Castro-ph%2F0507196%2Castro-ph%2F0507206%2Castro-ph%2F0507331%2Castro-ph%2F0507041%2Castro-ph%2F0507165%2Castro-ph%2F0507437%2Castro-ph%2F0507238%2Castro-ph%2F0507040%2Castro-ph%2F0507046%2Castro-ph%2F0507515%2Castro-ph%2F0507308%2Castro-ph%2F0507517%2Castro-ph%2F0008206%2Castro-ph%2F0008394%2Castro-ph%2F0008196%2Castro-ph%2F0008416%2Castro-ph%2F0008066%2Castro-ph%2F0008131%2Castro-ph%2F0008474%2Castro-ph%2F0008408%2Castro-ph%2F0008358%2Castro-ph%2F0008208%2Castro-ph%2F0008135%2Castro-ph%2F0008043%2Castro-ph%2F0008480%2Castro-ph%2F0008484%2Castro-ph%2F0008277%2Castro-ph%2F0008373%2Castro-ph%2F0008091%2Castro-ph%2F0008035%2Castro-ph%2F0008046%2Castro-ph%2F0008071%2Castro-ph%2F0008423%2Castro-ph%2F0008519%2Castro-ph%2F0008445%2Castro-ph%2F0008152%2Castro-ph%2F0008132%2Castro-ph%2F0008184%2Castro-ph%2F0008037%2Castro-ph%2F0008482%2Castro-ph%2F0008125%2Castro-ph%2F0008221%2Castro-ph%2F0008118%2Castro-ph%2F0008160%2Castro-ph%2F0008526%2Castro-ph%2F0008226%2Castro-ph%2F0008089%2Castro-ph%2F0008165%2Castro-ph%2F0008444%2Castro-ph%2F0008099%2Castro-ph%2F0008001%2Castro-ph%2F0008457%2Castro-ph%2F0008232%2Castro-ph%2F0008241%2Castro-ph%2F0008495%2Castro-ph%2F0008295%2Castro-ph%2F0008501%2Castro-ph%2F0008465%2Castro-ph%2F0008440%2Castro-ph%2F0008124%2Castro-ph%2F0008041%2Castro-ph%2F0008250%2Castro-ph%2F0008154%2Castro-ph%2F0008304%2Castro-ph%2F0008012%2Castro-ph%2F0008178%2Castro-ph%2F0008432%2Castro-ph%2F0008009%2Castro-ph%2F0008121%2Castro-ph%2F0008142%2Castro-ph%2F0008180%2Castro-ph%2F0008514%2Castro-ph%2F0008391%2Castro-ph%2F0008278%2Castro-ph%2F0008297%2Castro-ph%2F0008136%2Castro-ph%2F0008081%2Castro-ph%2F0008198%2Castro-ph%2F0008216%2Castro-ph%2F0008045%2Castro-ph%2F0008455%2Castro-ph%2F0008157&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Is The Fe M-shell Absorber Part of The Outflow in Active Galactic\n  Nuclei?"}, "summary": "The X-ray emission of many active galactic nuclei (AGNs) is absorbed between\n15 and 17 Angstrom by means of unresolved (inner-shell) transition arrays\n(UTAs) of Fe M-shell ions. The outflow velocities implied by the Doppler shifts\nof the individual UTAs in the spectrum have never before been measured. Thus,\nthe Fe-M absorber has been commonly assumed to be part of the ionized AGN\noutflow, whose velocities are readily obtained from more easily measured\nspectral lines. The best spectrum of Fe-M absorption is available from the\nintegrated 900 ks Chandra HETGS observations of NGC 3783, in which some Fe-M\nions are clearly resolved. We measure the velocities of the individual Fe-M\nions in NGC 3783 for the first time. Surprisingly, we find that the Fe-M\nabsorber, most noticeably Fe$^{+8}$, Fe$^{+9}$, and Fe$^{+10}$, is not\noutflowing at the same velocity as the previously known wind. In fact, it\nappears to be stationary and therefore not part of the outflow at all. It\ncould, alternatively, be ascribed to the skin of the dusty torus. This reduces\nappreciably the mass loss rate estimated for the NGC 3783 outflow and perhaps\nfor other similar sources as well, in which the various Fe-M ions are not\nresolved.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0507477%2Castro-ph%2F0507274%2Castro-ph%2F0507619%2Castro-ph%2F0507027%2Castro-ph%2F0507349%2Castro-ph%2F0507267%2Castro-ph%2F0507322%2Castro-ph%2F0507058%2Castro-ph%2F0507312%2Castro-ph%2F0507682%2Castro-ph%2F0507382%2Castro-ph%2F0507476%2Castro-ph%2F0507353%2Castro-ph%2F0507163%2Castro-ph%2F0507607%2Castro-ph%2F0507337%2Castro-ph%2F0507241%2Castro-ph%2F0507459%2Castro-ph%2F0507710%2Castro-ph%2F0507196%2Castro-ph%2F0507206%2Castro-ph%2F0507331%2Castro-ph%2F0507041%2Castro-ph%2F0507165%2Castro-ph%2F0507437%2Castro-ph%2F0507238%2Castro-ph%2F0507040%2Castro-ph%2F0507046%2Castro-ph%2F0507515%2Castro-ph%2F0507308%2Castro-ph%2F0507517%2Castro-ph%2F0008206%2Castro-ph%2F0008394%2Castro-ph%2F0008196%2Castro-ph%2F0008416%2Castro-ph%2F0008066%2Castro-ph%2F0008131%2Castro-ph%2F0008474%2Castro-ph%2F0008408%2Castro-ph%2F0008358%2Castro-ph%2F0008208%2Castro-ph%2F0008135%2Castro-ph%2F0008043%2Castro-ph%2F0008480%2Castro-ph%2F0008484%2Castro-ph%2F0008277%2Castro-ph%2F0008373%2Castro-ph%2F0008091%2Castro-ph%2F0008035%2Castro-ph%2F0008046%2Castro-ph%2F0008071%2Castro-ph%2F0008423%2Castro-ph%2F0008519%2Castro-ph%2F0008445%2Castro-ph%2F0008152%2Castro-ph%2F0008132%2Castro-ph%2F0008184%2Castro-ph%2F0008037%2Castro-ph%2F0008482%2Castro-ph%2F0008125%2Castro-ph%2F0008221%2Castro-ph%2F0008118%2Castro-ph%2F0008160%2Castro-ph%2F0008526%2Castro-ph%2F0008226%2Castro-ph%2F0008089%2Castro-ph%2F0008165%2Castro-ph%2F0008444%2Castro-ph%2F0008099%2Castro-ph%2F0008001%2Castro-ph%2F0008457%2Castro-ph%2F0008232%2Castro-ph%2F0008241%2Castro-ph%2F0008495%2Castro-ph%2F0008295%2Castro-ph%2F0008501%2Castro-ph%2F0008465%2Castro-ph%2F0008440%2Castro-ph%2F0008124%2Castro-ph%2F0008041%2Castro-ph%2F0008250%2Castro-ph%2F0008154%2Castro-ph%2F0008304%2Castro-ph%2F0008012%2Castro-ph%2F0008178%2Castro-ph%2F0008432%2Castro-ph%2F0008009%2Castro-ph%2F0008121%2Castro-ph%2F0008142%2Castro-ph%2F0008180%2Castro-ph%2F0008514%2Castro-ph%2F0008391%2Castro-ph%2F0008278%2Castro-ph%2F0008297%2Castro-ph%2F0008136%2Castro-ph%2F0008081%2Castro-ph%2F0008198%2Castro-ph%2F0008216%2Castro-ph%2F0008045%2Castro-ph%2F0008455%2Castro-ph%2F0008157&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The X-ray emission of many active galactic nuclei (AGNs) is absorbed between\n15 and 17 Angstrom by means of unresolved (inner-shell) transition arrays\n(UTAs) of Fe M-shell ions. The outflow velocities implied by the Doppler shifts\nof the individual UTAs in the spectrum have never before been measured. Thus,\nthe Fe-M absorber has been commonly assumed to be part of the ionized AGN\noutflow, whose velocities are readily obtained from more easily measured\nspectral lines. The best spectrum of Fe-M absorption is available from the\nintegrated 900 ks Chandra HETGS observations of NGC 3783, in which some Fe-M\nions are clearly resolved. We measure the velocities of the individual Fe-M\nions in NGC 3783 for the first time. Surprisingly, we find that the Fe-M\nabsorber, most noticeably Fe$^{+8}$, Fe$^{+9}$, and Fe$^{+10}$, is not\noutflowing at the same velocity as the previously known wind. In fact, it\nappears to be stationary and therefore not part of the outflow at all. It\ncould, alternatively, be ascribed to the skin of the dusty torus. This reduces\nappreciably the mass loss rate estimated for the NGC 3783 outflow and perhaps\nfor other similar sources as well, in which the various Fe-M ions are not\nresolved."}, "authors": ["Tomer Holczer", "Ehud Behar", "Shai Kaspi"], "author_detail": {"name": "Shai Kaspi"}, "author": "Shai Kaspi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/444492", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/astro-ph/0507027v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0507027v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "To be published in ApJ", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0507027v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/astro-ph/0507027v1", "journal_reference": "Astrophys.J.632:788-792,2005", "doi": "10.1086/444492", "fulltext": "Is The Fe M-shell Absorber Part of The Outflow in Active\nGalactic Nuclei?\nTomer Holczer 1 , Ehud Behar\n\n1\n\nand Shai Kaspi\n\n1\n\narXiv:astro-ph/0507027v1 1 Jul 2005\n\nABSTRACT\nThe X-ray emission of many active galactic nuclei (AGNs) is absorbed between\n15 and 17 Å by means of unresolved (inner-shell) transition arrays (UTAs) of\nFe M-shell ions. The outflow velocities implied by the Doppler shifts of the\nindividual UTAs in the spectrum have never before been measured. Thus, the FeM absorber has been commonly assumed to be part of the ionized AGN outflow,\nwhose velocities are readily obtained from more easily measured spectral lines.\nThe best spectrum of Fe-M absorption is available from the integrated 900 ks\nChandra HETGS observations of NGC 3783, in which some Fe-M ions are clearly\nresolved. We measure the velocities of the individual Fe-M ions in NGC 3783\nfor the first time. Surprisingly, we find that the Fe-M absorber, most noticeably\nFe+8 , Fe+9 , and Fe+10 , is not outflowing at the same velocity as the previously\nknown wind. In fact, it appears to be stationary and therefore not part of the\noutflow at all. It could, alternatively, be ascribed to the skin of the dusty torus.\nThis reduces appreciably the mass loss rate estimated for the NGC 3783 outflow\nand perhaps for other similar sources as well, in which the various Fe-M ions are\nnot resolved.\nSubject headings: galaxies: active - galaxies: individual (NGC 3783) - techniques: spectroscopic - X-rays: galaxies - line: formation\n\n1.\n\nINTRODUCTION\n\nThe X-ray spectrum of many active galactic nuclei (AGNs) viewed directly towards the\ncentral source (e.g., Seyfert 1 galaxies) shows the continuum flux absorbed by numerous\nabsorption lines. These lines are generally shifted slightly to shorter wavelengths indicating\nan outflowing wind. The flux from the central source is believed to drive the wind and\n1\n\nDepartment of Physics, Technion, Haifa 32000, Israel. tomer@physics.technion.ac.il (TH), behar@physics.technion.ac.il (EB), shai@physics.technion.ac.il (SK).\n\n\f–2–\nto ionize it to the high charge states observed. The X-ray band is uniquely compact as it\ncomprises absorption lines from the full range of charge states from neutral atoms to H-like\nions of all elements with Z ≥ 6, which helps to constrain the column density distribution\nover a wide range in ionization. The less ionized species absorb by means of inner-shell\nphotoexcitation processes, which play an important role in the formation of discrete features\nin the spectrum.\nIn particular, the n = 2 to 3 absorption lines (n being the principal quantum number of\nthe active electron) by low charge states of Fe, neutral through Fe+15 , fall in the soft X-ray\nband. Each ion can produce dozens of overlapping lines forming unresolved transition arrays\n(UTAs). Sako et al. (2001) reported the first astrophysical identification of these features\nin the spectrum of the luminous quasar IRAS 13349+2438 obtained with the Reflection\nGrating Spectrometer (RGS) on board XMM-Newton. The broad absorption trough observed\nbetween 16–17 Å was attributed to a blend of lines from Fe+6 to Fe+11 . The basic atomic\ndata needed for spectral modeling of the lines was subsequently given in Behar et al. (2001).\nSince its initial discovery, copious detections of Fe M-shell absorption have been claimed in\nother soft X-ray sources (e.g., Pounds et al. 2004; Kaspi et al. 2004; Gallo et al. 2004, to\nname a few recent ones). Since most instruments are not able to resolve the various ionic\nUTAs, for simplicity, the observed, blended feature was dubbed in the literature as the Fe-M\nUTA.\nPerhaps the most conspicuous astrophysical Fe-M UTA is the one found in NGC 3783.\nBoth Chandra and XMM-Newton have observed NGC 3783 for very long spectroscopic exposures (Kaspi et al. 2002; Behar et al. 2003, respectively). Several detailed global models\nhave been constructed to explain the rich absorption spectrum of NGC 3783 (Kaspi et al.\n2001; Blustin et al. 2002; Krongold et al. 2003; Netzer et al. 2003). Owing to its ionization\nsensitivity, the Fe-M UTA could have played a major role in constraining these models. However, it was realized that the standard photoionization balance models fail tremendously in\ntheir prediction of the Fe charge state distribution (Netzer et al. 2003; Netzer 2004; Kraemer\net al. 2004). Therefore, the current models could not produce the Fe-M UTA spectral features consistently with those of other elements. Recently, Krongold et al. (2005) have used\nheavy rebinning of the Chandra spectrum of NGC 3783 to show that the overall position of\nthe absorption trough in the Fe-M UTA region appears to shift between low and high states\nof the ionizing continuum. In none of these works were the individual ionic features studied\nclosely.\nIn this paper, we revisit the integrated 900 ks observation of NGC 3783 obtained with\nthe HETGS spectrometer on board Chandra over several months. The same data were used\nbefore by Kaspi et al. (2002), Netzer et al. (2003), and by Krongold et al. (2003). Presently,\n\n\f–3–\nHETGS is the only instrument that can actually resolve the individual ionic features inside\nthe Fe-M UTA. Conversely, the spectral resolution of the RGS on board XMM-Newton is\njust insufficient (Sako et al. 2001; Behar et al. 2003). Curiously, the details of the UTA in\nthe HETGS spectrum have yet to be studied in detail, perhaps because of the difficulties\nmentioned above in using the Fe-M UTA in global models. The sole goal of this work is\nto use the HETGS spectrum to identify the individual ionic features and to measure their\nvelocity with respect to the systemic velocity of NGC 3783. The results obtained are quite\n\nsurprising.\n\n2.\n\nHETGS SPECTRUM OF NGC 3783\n\nThe spectrum used in the present work is the exact same one reduced in Kaspi et al.\n(2002) and shown in their Fig. 1. It consists of five 170 ks HETGS observations of NGC 3783\nobtained during the period 2001 February–June as well as an early 56 ks observation from\n2000 January, all of which are co-added. The +1st and −1st diffraction orders of both the\nMEG and HEG grating assemblies are included. The spectra are fluxed and corrected for\nGalactic absorption. The wavelength scale is de-redshifted to the rest frame of NGC 3783\nusing z = 0.00976. For more details on the data reduction see Kaspi et al. (2002). For the\nobvious reason of improving the statistics, we use here the total 900 ks data set. Notwithstanding, we have verified that all of the prominent absorption features, which we discuss\nbelow, appear in each short exposure. Moreover, to the extent that it is possible to determine\nwith the low statistics of each short exposure, we have found that the positions of the narrow\nabsorption features, which are of interest for this work, do not vary between observations.\n\n3.\n\nSPECTRAL MODEL\n\nThe heavy line blending in the soft X-ray band where the outflow absorbs most significantly makes the direct measurement of individual line positions very difficult. For a\nconsistent measurement, therefore, one needs to use an ad-hoc spectral model, which includes simultaneously many charge states and all of the absorption lines pertaining to these\nions in the soft X-ray band. Interested solely in the absorption features of the Fe-M UTA,\nwe have constructed a simple model to explain the observed spectrum in the limited range\nof 14.9–17.5 Å. The model includes a power-law continuum, all of the Fe-M UTA ions, Fe+16 ,\nand the two O-K ions: O+6 and O+7 , which also have lines in this range. For the Fe ions,\nthe model includes all of the n = 2 to 3 spectral lines for absorption from the ground level\nof each ion. The present Fe-M model includes the full set of absorption lines from Behar\n\n\f–4–\net al. (2001) and not only the abbreviated set given in Table 1 of that paper. For the O-K\nions, the model includes all of the n = 1 to n′ resonance transitions with n′ ≤ 15000 as well\nas the photoelectric edges, from the ground level. The present model is similar in spirit to\nthose used in Sako et al. (2001) and in Behar et al. (2003).\nFor the continuum, a power law was fit to the relatively featureless region of the spectrum\nbetween 2–6 Å. The best-fit parameters obtained are a photon index (Γ) of 1.45 and a\nnormalization at 1 keV of 0.00936 photons s−1 cm−2 keV−1 , which are in good agreement\nwith previous fits for the low-state spectrum that dominates the present data set (e.g., Fig. 8\nin Netzer et al. 2003).\nThe optical depth τij (ν) due to an absorption line (i → j) is obtained by:\nτij (ν) = Nion σij (ν)\n\n(1)\n\nwhere σij (ν) is the calculated cross section for photoexcitation (in cm2 ) from i to j and Nion is\nthe ionic column density towards the source (in cm−2 ) for which we fit. The photoexcitation\ncross section is given by:\n\nσij (ν) =\n\nπe2\nfij φ(ν)\nme c\n\n(2)\n\nHere, e and me are the electron charge and mass, c is the speed of light, fij is the line oscillator strength, which we have calculated with the Hebrew University Lawrence Livermore\nAtomic Code (HULLAC, Bar-Shalom et al. 2001). Finally, φ(ν) is the normalized line profile\ndescribed here by a Voigt function that is the convolution of the (Gaussian) Doppler broadening due to temperature and to turbulence, which we fit for, and the (Lorentzian) natural\nwidth of the line, which we have calculated with HULLAC. In observed AGN outflows, turbulence broadening (vturb ≥ 100 km s−1 ) totally dominates over temperature broadening.\nHere, we use vturb = 170 km s−1 . Generally, in the natural widths of inner-shell excited lines,\nthe autoionization decay rate (Aa ≃ 1014 s−1 ) dominates over the radiative rate. Nevertheless, our calculations include both. HULLAC is a multi-configuration, relativistic code most\nsuitable for the inner-shell excitations of the complex atoms of interest in this study. For\nmore details on the Fe-M atomic calculations see Behar et al. (2001).\n\n\f–5–\n4.\n\nDETERMINATION OF OUTFLOW VELOCITIES\n\nThe mean velocity for the NGC 3783 outflow was found by Kaspi et al. (2002) to be\n−590 ± 150 km s−1 . Consequently, our first attempt to fit the absorption in the HETGS\nspectrum of NGC 3783 in the vicinity of the Fe-M UTA was carried out using a uniform\noutflow velocity of –590 km s−1 . The results are shown in Fig. 1. Indeed, the fit for O+6\n(He δ and He ǫ most prominent at 17.40 and 17.20 Å), O+7 (Ly β and Ly γ at 16.01 and\n15.18 Å), and Fe+16 (at 15.01 and 15.26 Å) is seen to be very good. On the other hand,\nthe velocity of –590 km s−1 is clearly inappropriate for the prominent Fe-M troughs. The\nFe-M features in the model are seen to be systematically shifted towards shorter wavelengths\ncompared with their observed positions, most evidently at 16.50, 16.33, and 16.15 Å.\nThe above result is already a strong indication that the Fe-M absorber is moving at a\nmuch slower velocity than the more highly ionized gas, if it is moving at all. In Table 1 we\nlist the identifiable discrete absorption features in the spectrum. For the mere objective of\nobtaining centroids in order to get a rough idea of the velocities, we have fitted each feature\nwith a local continuum and a Gaussian-shaped trough employing the same method used for\nthe wavelength determination in Kaspi et al. (2002). It can be seen that the positions of the\nbest observed Fe-M ions are consistent with outflow velocities that are significantly lower\nthan − 590 km s−1 . The velocities in the table have to be treated with caution for two main\nreasons: (i) The absorption line profile in many cases is not a simple Gaussian, but rather a\ncomplex distribution of narrow velocity components (see also Kaspi et al. 2002; Gabel et al.\n2003) (ii) The Fe-M wavelengths have not been confirmed in the laboratory as discussed in\ndetail in §5. The spectral resolution of the HETGS is high enough so that blending among\nFe-M ions is negligible as can be seen by comparing the 3rd and 4th columns in Table 1,\nwhich show that the individual-ion Fe-M wavelengths and the full-model wavelengths agree\nto within a few mÅ.\n\n\f–6–\n\nTable 1. Best-fit velocities and column densities for ions detected in the 14.9–17.5 Å\nregion of the HETGS spectrum of NGC 3783.\nIon\n\nO+7\nO+6\n\nFe+16\nFe+15\nFe+14\nFe+13\nFe+12\nFe+11\nFe+10\nFe+9\nFe+8\nFe+7 h\nFe+6 h\nFe+5 h\nFe+4 h\nFe+3 h\n\nλObserved\n(Å)\n\nλRest a\n(Å)\n\n15.144 ± 0.003 d\n15.970 ± 0.005 e\n17.351 ± 0.005\n17.161 ± 0.005\n17.048 ± 0.005\n14.980 ± 0.003\n15.231 ± 0.002 f\n15.231 ± 0.002 f\n15.322 ± 0.006\n15.569 ± 0.008 g\n15.844 ± 0.014 g\n15.970 ± 0.005 e\n16.154 ± 0.005\n16.329 ± 0.005\n16.496 ± 0.004\n***\n***\n***\n***\n***\n\n15.176\n16.006\n17.395\n17.199\n17.084\n15.013\n15.261\n15.250\n15.316\n15.580\n15.848\n15.967\n16.150\n16.339\n16.510\n16.655\n17.095\n17.218\n17.291\n17.405\n\nλModel b Outflow Velocity\n(Å)\n(km s−1 )\n15.146\n15.973\n17.361\n17.165\n17.050\n14.985\n15.234\n15.234\n15.317\n15.580\n15.848\n15.973\n16.150\n16.340\n16.509\n***\n***\n***\n***\n***\n\n−632 ± 59\n−665 ± 94\n−770 ± 81\n−675 ± 89\n−630± 88\n−659 ± 60\n−590 ± 39\n−374 ± 39\n+118 ± 118\n+212 ± 154\n−76 ± 265\n+56 ± 94\n+74 ± 93\n−184 ± 92\n−252 ± 73\n***\n***\n***\n***\n***\n\nc\n\nIon Column Density\n(1016 cm−2 )\n400 ± 60\n110 ± 20\n\n3.0 ± 0.5\n0.6 ± 0.2\n0.3 ± 0.1\n1.4 ± 0.4\n1.0 ± 0.3\n3.0 ± 2.0\n4.0 ± 0.7\n5.5 ± 0.7\n4.0 ± 0.5\n3.0 ± 1.0\n2.0 ± 0.7\n1.5 ± 0.6\n1.0 ± 0.6\n≤ 0.8\n\na\n\nFor Fe-M ions, these are centroids of the deepest feature in each ionic spectrum.\n\nb\n\nCentroid in full two-velocity model (Fig. 2).\n\nc\n\nEstimated by (λObserved − λRest )c/λRest . Errors reflect 90% confidence intervals.\n\nd\n\nBlend of O+7 and Fe+15 at 15.19 Å fitted for two distinct features.\n\ne\n\nUnresolved blend of O+7 and Fe+11 reflected in the large error on the Fe+11 column density.\n\nf\n\nUnresolved blend of Fe+16 and Fe+15 .\n\n\f–7–\ng\n\narge uncertainty in centroid identification. See spectrum in Figs. 1 and 2.\n\nh\n\nIndirect identification based on best-fit model; Strongly blended with the high-n lines of O+6 .\n\n\f–8–\nIn order to further illustrate the low velocities associated with the Fe-M absorber, we\nhave fitted the HETGS spectrum of NGC 3783, but now the velocity of the Fe-M ions was\nallowed to be different from that of the other charge states. For simplicity, however, the\nvelocities of all of the Fe-M ions were tied together. The best fit was obtained by setting the\nFe-M velocity to zero as shown in Fig. 2. The individual contributions of Fe+7 to Fe+12 to\nthe total model are plotted in Fig. 3. Despite some blending, individual ions can be easily\ndiscerned in the spectrum. As can be seen, centroids of the strongest absorption features in\nthe model are determined almost exclusively by a single UTA, which reinforces the validity\nof the direct velocity estimates in Table 1. The most conspicuous Fe-M ions in the data are\nFe+8 , Fe+9 , and Fe+10 . These ions in particular produce UTAs that are only very weakly\nblended with O lines or with other Fe ions as demonstrated in Fig. 3. Particularly for these\nions, the fit of the model with zero outflow velocity can be seen in Fig. 2 to be very good. The\nobvious velocity discrepancies for these ions in Fig. 1 have now disappeared. Conclusions\nregarding higher and lower Fe-M charge states are not as obvious, although the data still\nfavor the stationary scenario over the − 590 km s−1 outflow for these ions as well, as was\nalready indicated by the direct velocity estimates presented in Table 1.\n\n5.\n\nDISCUSSION\n\nThe outflow of NGC 3783 is known from high-resolution UV observations to have four\nresolved velocity components (Gabel et al. 2003). In the X-rays, the four components are\nunresolved. However, the mean X-ray absorption line profile is generally in agreement with\nthe UV profile, as demonstrated in Fig. 2 of Gabel et al. (2003). The lowest velocity UV\nabsorber reported in Gabel et al. (2003) is at −548 km s−1 , where the absorption troughs\nrise sharply. On the other hand, from our own inspection of the HST and FUSE spectra\nof NGC 3783 we find a much slower absorber, the most prominent lines of which are Lyα\nand Lyβ observed at an infall velocity of about +100 km s−1 (see also Fig. 1 in Gabel et al.\n2003). As far as we know, this together with the present X-ray results represents the first\ndiscovery of a high column density, almost stationary X-ray component in any AGN. In\nthe intensive XMM-Newton study of NGC 3783, the low charge states of oxygen (neutral O\nand O+1 ) have actually been detected at zero velocity as well (Behar et al. 2003, Table 1\ntherein). However, both lines were stated to be blends and in any event neither feature was\nstatistically significant. The present detection is much more unambiguous.\nThe stationary or low-velocity component could possibly be an extended, slightly ionized\npart of the interstellar medium (ISM) of NGC 3783. It might be absorption created by the\nextended narrow line region of NGC 3783. It could also be gas evaporating off of the molecular\n\n\f–9–\ntorus. A scenario in which radiation pressure is inefficient has been suggested for NGC 3783\nby Chelouche & Netzer (2005). The outflow velocity has obvious consequences on the mass\noutflow rate, which for NGC 3783 has been estimated to exceed a solar mass per year (Behar\net al. 2003). In fact, Netzer et al. (2003) have estimated the mass loss rate in this target due\nto the low ionization component alone to be as high as 75 solar masses per year and scaling\nlinearly with the radial filling factor of the flow, which could be as low as 0.1 (Netzer et al.\n2003). All of these estimates for the mass loss rate are based on the high velocity of the\noutflow (∼ −590 km s−1 ). If indeed, much of this gas is not moving as fast, it would reduce\nthe estimated mass loss rate considerably.\nOutflow velocities for individual Fe-M ions have not been carried out for other AGN targets, mostly because the available observations generally do not resolve the individual ions in\nthe spectrum, even when the blended Fe-M UTA feature is very clear (e.g., Sako et al. 2001).\nThe present result raises the suspicion that perhaps in other targets as well, this component\nof the absorber is not part of the AGN outflow. Of course, this will need to be checked in\nthe future for each target separately. However, if indeed this is the case, the ionization state\ndiagnosed for these absorbers based on the position of the UTA is underestimated, as the\nhigh velocities assumed for these targets are being confused with higher charge states that\nare actually moving at lower velocities.\nBefore concluding, we need to mention one disturbing caveat about the present measurement. The rest frame wavelengths of the resonant n = 2 to 3 absorption lines, which we use\nto determine the Fe-M outflow velocity, are taken from theoretical calculations (Behar et al.\n2001). Measuring these wavelengths in the laboratory is rather challenging and indeed, they\nhave not yet been confirmed. As far as we know, Fe-M UTA absorption has been observed\nin the laboratory once by Chenais-Popovics et al. (2000). However, the spectral resolution\nof that measurement was not sufficiently high to pin down the positions of individual charge\nstates.\nThe errors on the present velocity estimates stem directly from the position uncertainties\nof the strongest lines in each UTA. At 16 Å, an uncertainty in the rest frame wavelength\nof 30 mÅ translates into an uncertainty of 560 km s−1 in the outflow velocity. Indeed, the\nscatter among wavelength calculations by different state-of-the-art atomic codes, which is\none way to get a rough idea of their expected uncertainty, can reach and even slightly exceed\n30 mÅ. This, e.g., is the case for the inner-shell Kα absorption lines of oxygen (Behar &\nKahn 2002; Schmidt et al. 2004). However, even if there are such uncertainties associated\nwith the Fe-M rest frame wavelengths that we use, there is no particular reason for them\nto all be off in the same direction as to indicate a uniformly erroneous velocity. Quite the\ncontrary, with the parametric potential method used by HULLAC (Bar-Shalom et al. 2001),\n\n\f– 10 –\nthe atomic potential is calculated ab initio and separately for each ion, so that errors can be\nexpected to be unconnected. Indeed, a comparison between EBIT laboratory measurements\nand HULLAC wavelengths for the strongest line (the same 2p - 3d transition that dominates\nthe Fe-M UTAs) in each of the Fe-L ions reveals that λHULLAC − λEBIT = 0, −5, +6, −12,\n+8, +12, +27, and +2 mÅ, respectively, for Fe+16 – Fe+23 (Brown et al. 1998, 2002). Note\nthat the laboratory wavelengths themselves are associated with errors of a few mÅ. In short,\nthe HULLAC errors are generally much smaller than 30 mÅ and are certainly not uniform.\nHaving said that, until the Fe-M UTA wavelengths are measured directly, this possibility can\nnot be rigorously ruled out. If it turns out that after all, the apparent discrepancy between\nthe outflow velocities of the Fe-M low charge states and faster components of the outflow\nis due solely to the inaccurate Fe-M atomic data we have used, then the HETGS data and\nTable 1 could serve as (the best currently available) wavelength calibration for the Fe-M\nwavelengths.\n\n6.\n\nCONCLUSIONS\n\nWe have measured the velocity of individual Fe-M ions in the X-ray outflow of NGC 3783\nfor the first time. This measurement has never been carried out before for NGC 3783 nor for\nany other target. Based on the theoretical rest frame wavelengths available to us, we find\nthat the Fe-M ions are not moving as fast as the more ionized Fe species, such as Fe+16 , or\nas other highly charged species, which comprise the high-velocity outflow of NGC 3783. In\nfact, the Fe-M absorber may not be moving at all along our line of sight. We speculate that\nthis stationary gas may pertain to the ISM of NGC 3783, to its narrow line region, or it may\nbe gas evaporating off of the skin of the molecular torus. In order to examine whether this is\na distinctive quality of NGC 3783 or if there is a fundamental problem with the atomic data,\nmore high-quality spectra will need to be obtained for similar targets, which show deep,\nresolved Fe-M UTA troughs.\nThis research was supported by The Israel Science Foundation (grant no. 28/03) and by\ngrant no. 2002111 from the United States Israel Binational Foundation. S.K. acknowledges\nthe financial support of the Zeff Fellowship.\n\n\f– 11 –\nREFERENCES\nBar-Shalom, A., Klapisch, M., & Oreg, J. 2001, J. Quant. Spectr. Radiat. Transfer, 71, 169\nBehar, E., Sako, M., & Kahn S. M. 2001, ApJ, 563, 497\nBehar, E., & Kahn, S. M. 2002, proceedings of the NASA Laboratory Astrophysics Workshop, May 1–3 2002. NASA/CP-2002-21186, 23, also astro-ph/0210280\nBehar, E., Rasmussen, A. P., Blustin, A. J., Sako, M., Kahn, S. M., Kaastra, J. S.,\nBranduardi-Raymont, G., & Steenbrugge, K. C. 2003, ApJ, 598, 232\nBlustin, A. J., Branduardi-Raymont, G., Behar, E., Kaastra, J. S., Kahn, S. M., Page, M. J.,\nSako, M., & Steenbrugge, K. C. 2002, A&A, 392, 453\nBrown, G. V., Beiersdorfer, P., Liedahl, D. A., Widmann, K., & Kahn, S. M. 1998, ApJ,\n502, 1015\nBrown, G. V., Beiersdorfer, P., Liedahl, D. A., Widmann, K., Kahn, S. M., & Clothiaux,\nE. J. 2002, ApJS, 140, 589\nChelouche, D. & Netzer, H. 2005, ApJ, in press (astro-ph/0502272)\nChenais-Popovics, C., et al. 2000, ApJS, 127, 275\nGabel, J. et al. 2003, ApJ, 583, 178\nGallo, L. C., Boller, Th., Brandt, W. N., Fabian, A. C., & Vaughan, S. 2004, A&A, 417, 29\nKaspi, S., Brandt, W. N., Netzer, H., Sambruna, R., Chartas, G., Garmire, G. P., &\nNousek, J. 2000, ApJ, 535, L17\nKaspi et al. 2001, ApJ, 554, 216\nKaspi et al. 2002, ApJ, 574, 643\nKaspi, S., Netzer, H., Chelouche, D., George, I. M., Nandra, K., & Turner, T. J. 2004, ApJ,\n611, 68\nKraemer, S. B., Ferland, G. J., & Gabel, J. R. 2004, ApJ, 604, 556\nKrongold, Y., Nicastro, F., Brickhouse, N. S., Elvis, M., Liedahl, D. A., & Mathur, S. 2003,\nApJ, 597, 832\n\n\f– 12 –\nKrongold, Y., Nicastro, F., Brickhouse, N. S., Elvis, M., & Mathur, S. 2005, ApJ, in press,\nastro-ph/0411554\nNetzer, H., et al. 2003, ApJ, 599, 933\nNetzer, H. 2004, ApJ, 604, 551\nPounds, K. A., Reeves, J. N., King, A. R., & Page, K. L. 2004, MNRAS, 350, 10\nSako, M. et al. 2001, A&A, 365, L168\nSchmidt, M., Beiersdorfer, P., Chen, H., Thorn, D. B., Träbert, E., & Behar, E. 2004, ApJ,\n604, 562\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 13 –\n\nFig. 1.- HETGS spectrum of NGC 3783 in the Fe-M UTA region fitted with a uniformvelocity (–590 km s−1 ) outflow model. The model fits some of the data very well, but not\nthe Fe-M UTA features, most noticeably Fe+8 , Fe+9 , and Fe+10 for which this velocity is\nclearly too high.\n\n\f– 14 –\n\nFig. 2.- HETGS spectrum of NGC 3783 in the Fe-M UTA region fitted with a model in\nwhich O+6 , O+7 , and Fe+16 are outflowing at a velocity of −590 km s−1 , while the Fe-M ions\nare at rest with respect to the host galaxy. This model fits the observed Fe-M UTA features\nappreciably better than the uniform-velocity model shown in Fig. 1.\n\n\f– 15 –\n\nFig. 3.- Individual ionic contributions to the full best-fit model plotted in Fig. 2. For each\nion, the strongest absorption feature can be easily discerned and its centroid position in the\nfull model (red curve) is essentially unaffected by blends.\n\n\f"}