{"id": "http://arxiv.org/abs/astro-ph/0210582v1", "guidislink": true, "updated": "2002-10-26T15:35:09Z", "updated_parsed": [2002, 10, 26, 15, 35, 9, 5, 299, 0], "published": "2002-10-26T15:35:09Z", "published_parsed": [2002, 10, 26, 15, 35, 9, 5, 299, 0], "title": "The Formation of Globular Cluster Systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0210160%2Castro-ph%2F0210648%2Castro-ph%2F0210659%2Castro-ph%2F0210337%2Castro-ph%2F0210271%2Castro-ph%2F0210306%2Castro-ph%2F0210335%2Castro-ph%2F0210643%2Castro-ph%2F0210013%2Castro-ph%2F0210589%2Castro-ph%2F0210326%2Castro-ph%2F0210276%2Castro-ph%2F0210112%2Castro-ph%2F0210190%2Castro-ph%2F0210089%2Castro-ph%2F0210414%2Castro-ph%2F0210125%2Castro-ph%2F0210347%2Castro-ph%2F0210144%2Castro-ph%2F0210143%2Castro-ph%2F0210018%2Castro-ph%2F0210099%2Castro-ph%2F0210457%2Castro-ph%2F0210612%2Castro-ph%2F0210136%2Castro-ph%2F0210239%2Castro-ph%2F0210413%2Castro-ph%2F0210177%2Castro-ph%2F0210221%2Castro-ph%2F0210688%2Castro-ph%2F0210063%2Castro-ph%2F0210611%2Castro-ph%2F0210678%2Castro-ph%2F0210588%2Castro-ph%2F0210274%2Castro-ph%2F0210281%2Castro-ph%2F0210214%2Castro-ph%2F0210202%2Castro-ph%2F0210369%2Castro-ph%2F0210456%2Castro-ph%2F0210594%2Castro-ph%2F0210613%2Castro-ph%2F0210409%2Castro-ph%2F0210081%2Castro-ph%2F0210021%2Castro-ph%2F0210289%2Castro-ph%2F0210107%2Castro-ph%2F0210630%2Castro-ph%2F0210179%2Castro-ph%2F0210549%2Castro-ph%2F0210462%2Castro-ph%2F0210493%2Castro-ph%2F0210051%2Castro-ph%2F0210041%2Castro-ph%2F0210023%2Castro-ph%2F0210263%2Castro-ph%2F0210437%2Castro-ph%2F0210036%2Castro-ph%2F0210329%2Castro-ph%2F0210620%2Castro-ph%2F0210680%2Castro-ph%2F0210207%2Castro-ph%2F0210218%2Castro-ph%2F0210283%2Castro-ph%2F0210209%2Castro-ph%2F0210533%2Castro-ph%2F0210325%2Castro-ph%2F0210238%2Castro-ph%2F0210670%2Castro-ph%2F0210035%2Castro-ph%2F0210037%2Castro-ph%2F0210403%2Castro-ph%2F0210017%2Castro-ph%2F0210525%2Castro-ph%2F0210191%2Castro-ph%2F0210005%2Castro-ph%2F0210096%2Castro-ph%2F0210628%2Castro-ph%2F0210172%2Castro-ph%2F0210397%2Castro-ph%2F0210623%2Castro-ph%2F0210375%2Castro-ph%2F0210575%2Castro-ph%2F0210435%2Castro-ph%2F0210506%2Castro-ph%2F0210601%2Castro-ph%2F0210592%2Castro-ph%2F0210244%2Castro-ph%2F0210319%2Castro-ph%2F0210604%2Castro-ph%2F0210669%2Castro-ph%2F0210025%2Castro-ph%2F0210033%2Castro-ph%2F0210417%2Castro-ph%2F0210378%2Castro-ph%2F0210593%2Castro-ph%2F0210646%2Castro-ph%2F0210560%2Castro-ph%2F0210582%2Castro-ph%2F0210599%2Castro-ph%2F0210323&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Formation of Globular Cluster Systems"}, "summary": "I briefly review models for the formation of globular cluster systems, and\nsummarize the observational properties (i.e., formation efficiencies,\nmetallicity distributions, kinematics and ages) of the globular cluster systems\nof M87 and M49: two thoroughly studied elliptical galaxies. Many of the\nproperties of the metal-poor clusters in these and other galaxies appear to be\nconsistent with their formation in low-mass, proto-galactic fragments, as\nproposed by several different formation models. A number of outstanding\nquestions concerning the formation of the metal-rich clusters in these galaxies\nare highlighted.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=astro-ph%2F0210160%2Castro-ph%2F0210648%2Castro-ph%2F0210659%2Castro-ph%2F0210337%2Castro-ph%2F0210271%2Castro-ph%2F0210306%2Castro-ph%2F0210335%2Castro-ph%2F0210643%2Castro-ph%2F0210013%2Castro-ph%2F0210589%2Castro-ph%2F0210326%2Castro-ph%2F0210276%2Castro-ph%2F0210112%2Castro-ph%2F0210190%2Castro-ph%2F0210089%2Castro-ph%2F0210414%2Castro-ph%2F0210125%2Castro-ph%2F0210347%2Castro-ph%2F0210144%2Castro-ph%2F0210143%2Castro-ph%2F0210018%2Castro-ph%2F0210099%2Castro-ph%2F0210457%2Castro-ph%2F0210612%2Castro-ph%2F0210136%2Castro-ph%2F0210239%2Castro-ph%2F0210413%2Castro-ph%2F0210177%2Castro-ph%2F0210221%2Castro-ph%2F0210688%2Castro-ph%2F0210063%2Castro-ph%2F0210611%2Castro-ph%2F0210678%2Castro-ph%2F0210588%2Castro-ph%2F0210274%2Castro-ph%2F0210281%2Castro-ph%2F0210214%2Castro-ph%2F0210202%2Castro-ph%2F0210369%2Castro-ph%2F0210456%2Castro-ph%2F0210594%2Castro-ph%2F0210613%2Castro-ph%2F0210409%2Castro-ph%2F0210081%2Castro-ph%2F0210021%2Castro-ph%2F0210289%2Castro-ph%2F0210107%2Castro-ph%2F0210630%2Castro-ph%2F0210179%2Castro-ph%2F0210549%2Castro-ph%2F0210462%2Castro-ph%2F0210493%2Castro-ph%2F0210051%2Castro-ph%2F0210041%2Castro-ph%2F0210023%2Castro-ph%2F0210263%2Castro-ph%2F0210437%2Castro-ph%2F0210036%2Castro-ph%2F0210329%2Castro-ph%2F0210620%2Castro-ph%2F0210680%2Castro-ph%2F0210207%2Castro-ph%2F0210218%2Castro-ph%2F0210283%2Castro-ph%2F0210209%2Castro-ph%2F0210533%2Castro-ph%2F0210325%2Castro-ph%2F0210238%2Castro-ph%2F0210670%2Castro-ph%2F0210035%2Castro-ph%2F0210037%2Castro-ph%2F0210403%2Castro-ph%2F0210017%2Castro-ph%2F0210525%2Castro-ph%2F0210191%2Castro-ph%2F0210005%2Castro-ph%2F0210096%2Castro-ph%2F0210628%2Castro-ph%2F0210172%2Castro-ph%2F0210397%2Castro-ph%2F0210623%2Castro-ph%2F0210375%2Castro-ph%2F0210575%2Castro-ph%2F0210435%2Castro-ph%2F0210506%2Castro-ph%2F0210601%2Castro-ph%2F0210592%2Castro-ph%2F0210244%2Castro-ph%2F0210319%2Castro-ph%2F0210604%2Castro-ph%2F0210669%2Castro-ph%2F0210025%2Castro-ph%2F0210033%2Castro-ph%2F0210417%2Castro-ph%2F0210378%2Castro-ph%2F0210593%2Castro-ph%2F0210646%2Castro-ph%2F0210560%2Castro-ph%2F0210582%2Castro-ph%2F0210599%2Castro-ph%2F0210323&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I briefly review models for the formation of globular cluster systems, and\nsummarize the observational properties (i.e., formation efficiencies,\nmetallicity distributions, kinematics and ages) of the globular cluster systems\nof M87 and M49: two thoroughly studied elliptical galaxies. Many of the\nproperties of the metal-poor clusters in these and other galaxies appear to be\nconsistent with their formation in low-mass, proto-galactic fragments, as\nproposed by several different formation models. A number of outstanding\nquestions concerning the formation of the metal-rich clusters in these galaxies\nare highlighted."}, "authors": ["Patrick Cote"], "author_detail": {"name": "Patrick Cote"}, "author": "Patrick Cote", "arxiv_comment": "10 pages, Latex, plus 3 postscript figures. Invited review to appear\n  in the proceedings \"New Horizons in Globular Cluster Astronomy\", ed. G.\n  Piotto, G. Meylan, G. Djorgovski, M. Riello, ASP Conference series", "links": [{"href": "http://arxiv.org/abs/astro-ph/0210582v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/astro-ph/0210582v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/astro-ph/0210582v1", "affiliation": "Rutgers", "arxiv_url": "http://arxiv.org/abs/astro-ph/0210582v1", "journal_reference": null, "doi": null, "fulltext": "New Horizons in Globular Cluster Astronomy\nASP Conference Series, Vol. ???, 2002\nGiampaolo Piotto, George Meylan, George Djorgovski and Marco Riello, eds.\n\nThe Formation of Globular Cluster Systems\nPatrick Côté\n\narXiv:astro-ph/0210582v1 26 Oct 2002\n\nRutgers University, 136 Frelinghuysen Road, Piscataway, NJ 08854\nAbstract. I briefly review models for the formation of globular cluster\n(GC) systems, and summarize the observational properties (i.e., formation efficiencies, metallicity distributions, kinematics and ages) of the\nGC systems of M87 and M49: two thoroughly-studied elliptical galaxies.\nMany of the properties of the metal-poor GCs in these and other galaxies\nappear to be consistent with their formation in low-mass proto-galactic\nfragments, as proposed by several different formation models. A number\nof outstanding questions concerning the formation of the metal-rich GCs\nin these galaxies are highlighted.\n\n1.\n\nIntroduction\n\nThe past decade has witnessed a remarkable advance in our understanding of\nglobular cluster (GC) systems. Optical and ultraviolet imaging from HST has\nbeen used to study GC systems belonging to nearly one hundred (mostly early\ntype) galaxies. Spectra from 4-10m class telescopes have yielded radial velocities\nfor more than a thousand extragalactic GCs, along with metallicities for subset\nof the brighter objects. Infrared photometry for extragalactic GCs is appearing\nin the literature at an ever-increasing rate, promising to refine our understanding\nof how these systems formed and evolved.\nIndeed, theorists are now hard pressed to produce a single model for the\nformation of GC systems that explains - or, at least, is consistent with - the\nenormous amount of observational material that has been accumulated. This is\na daunting task, since any viable formation model must reproduce and explain\nthe apparently constant number of GCs per unit baryonic mass, the striking\ncomplexity of GC metallicity distribution functions (MDFs), the observed spatial distributions of GCs about their host galaxy, and the emerging constraints\non the ages and kinematics of the metal-poor (MP) and metal-rich (MR) GC\nsubpopulations. What is ultimately required is a model that explains not just\nthese observational properties, but also their variations (if any) with host galaxy\nenvironment and morphology. Although several important issues remain unresolved, I will argue below that there may be an emerging consensus on the origin\nof the MP GC subpopulations associated with bright galaxies. The origin of the\nMR subpopulation remains very much open to debate.\n\n1\n\n\f2\n2.\n\nPatrick Côté\nFormation Scenarios\n\nIt is convenient to divide models for the formation of GC systems into three\nbroad categories: pre-, proto- and post-galactic. While these divisions are useful\nfor heuristic purposes, they should not be taken too literally since the classification is, in some cases, rather subjective. It is also worth noting that some\nmodels that have historically been considered quite distinct (e.g., Ashman &\nZepf 1992 and Côté et al. 1998) actually rely on similar mechanisms - mergers\nand accretions - to explain the formation of GC systems. These models differ\nmainly the assumed nature of the merger/accretion process: most notably in\nthe assumed mass spectrum of the progenitors, the epoch of galaxy assembly,\nand the amount of dissipation and star/GC formation (if any) induced by the\nmerger/accretion process.\nPre-galactic: In this picture, the formation of GCs predates that of their host\ngalaxy. First suggested by Dicke & Peebles (1968), who noted that the Jeans\nmass at recombination was similar to the mean mass of Galactic GCs, this model\nwas later revised by Peebles (1984) to explain GC formation in a cold dark matter\n(CDM) dominated universe. We now recognize the GC mass distribution to have\na roughly double power-law form with a break at M ∼ 105 M⊙ , weakening the\noriginal Jeans mass argument.\nRecently, Cen (2001) has proposed a variant of this model in which the MP\nGCs surrounding galaxies form during reionization, when the external radiation\nfield produces inward shocks in low-mass, low-spin dark matter halos. Such\nshocks, he argues, will compress the baryons and lead to the formation of GCs.\nWhile this model gives roughly the correct mass spectrum for GCs more massive than about 105 M⊙ , the mechanism itself is quite unlike that observed in\nstar- and cluster-forming molecular clouds in the local universe (and leaves the\nformation of the MR GCs unexplained). Moreover, it seems inevitable that this\nmodel should predict many intergalactic GCs in the local universe. Although\nthe properties of some GCs associated with a few galaxies like M87 are consistent with an intergalactic origin (see Côté et al. 2001), there is still no case in\nwhich even a single GC can be said with certainty to be truly intergalactic in\nnature.\nProto-galactic: It was suggested by Harris & Pudritz (1994) that GCs form\nwithin the dense cores of supergiant molecular clouds (SGMCs): i.e., an hypothesized population of pressure-confined, self-gravitating, isothermal, magnetized\nclouds. These SGMCs, they argued, were supported against gravitational collapse by magnetic field pressure and Alfvénic turbulence. Though most SGMCs\nwould presumably have been disrupted during the assembly of the host galaxy,\nany surviving SGMCs would, if left in isolation, have masses of M ∼ 109 M⊙\nand diameters of D ∼ 1 kpc. In short, they would resemble dwarf galaxies.\nSubsequent cosmological N-body/TREESPH simulations by Weil & Pudritz\n(2001) confirmed that gravitationally-bound objects having masses and sizes\nsimilar to these SGMCs do indeed form, and that they have a roughly powerlaw mass spectrum, N (M ) ∝ M α dM , with α ∼ −1.7. Since star and GC\nformation was not included in their simulations, no conclusion could be drawn\nregarding GC MDFs.\n\n\fAPS Conf. Ser. Style\n\n3\n\nFigure 1.\n(Left Panels) Representative color/metallicity distributions for GCs belonging to nine of the 28 galaxies in the study of Kundu\n& Whitmore (2001). The galaxy name and its luminosity in units of\nL∗ are given in each panel. In each case, the best-fit distribution obtained from Monte-Carlo simulations of hierarchical galaxy formation\nis shown by the dashed curve (Côté et al. 2002). (Right Panel) Individual and combined mass spectra of proto-galactic fragments for\nthe same 28 galaxies (dotted curves and open squares, respectively).\nThe dashed line shows a Press-Schechter (1974) mass function with\nM ∗ = 5 × 1011 M⊙ and n = −2, where n is the index of the cosmological power spectrum.\n\nAn empirical method of studying GC MDFs has been has been explored in\na series of papers by my collaborators and I (Côté et al. 1998, 2000, 2002) where\na Monte-Carlo algorithm was developed to simulate the GC MDFs of galaxies\nthat are assembled from \"proto-galactic fragments\". In this picture, both the\ntotal number of GCs and their metallicities are determined solely by the mass\nof the proto-galactic fragment in which they formed; no GCs are formed during\nthe merger and accretion process. The left panels of Figure 1 show simulated\nand observed MDFs for nine of the 28 galaxies examined in Côté et al. (2002).\nThe right panel shows proto-galactic mass spectra for the 28 galaxies, along\nwith the ensemble mass spectrum. These simulations suggest that the mass\nspectrum of proto-galactic fragments had an approximate power-law form with\nindex α ∼ −1.8, in close agreement with the N-body results.\nIt is remarkable that two completely independent lines of evidence (i.e., Nbody simulations of the gravitational collapse of primordial density fluctuations\nand Monte-Carlo simulations of the GC MDFs) point to a steep proto-galactic\nmass spectrum. Although this agreement lends credibility to the results, it is\n\n\f4\n\nPatrick Côté\n\nimportant to recall that the inferred mass spectrum is much steeper than measured luminosity function of galaxies in the local universe. Thus, the formation\nof GC systems seems inevitably linked to the so-called \"missing satellite\" problem (Klypin et al. 1999; Moore et al. 1999).\nIn a recent paper that further demonstrates the utility of GC systems in\nconstraining cosmological models of galaxy formation, Beasley et al. (2002) used\nthe GALFORM semi-analytic code to simulate the GC systems of 450 elliptical\ngalaxies. The relative number of MP and MR GCs in their simulations - which\ninclude shock heating of the gas, radiative cooling, feedback, mergers and stellar\nevolution - were then compared to the observed numbers in M49, where the\ncensus of GCs is very nearly complete. This comparison revealed that two ad hoc\nassumptions were necessary to reproduce the MP and MR GCs in the correct\nnumbers. First, the formation efficiency of MR GCs must exceed that of MP\nGCs by a factor of ≈ 3-4 (see below for an examination of the plausibility of this\nassumption). Second, the formation of MP GCs, which occur in low-mass halos\nthat Beasley et al. term \"proto-galactic disks\", must be truncated abruptly at\nztrunc ≃ 5. Without these assumptions, the predicted population of MP GCs\nwould dominate the MR population by up to two orders of magnitude at z = 0.\nUnlike previous simulations, Beasley et al. were able to estimate ages for the\nGCs. The MP GCs have, by virtue of the assumed value of ztrunc , a mean age\nof T ≃ 12 Gyr. The MR GCs are then found to be 1–7 Gyr younger, with a\nmean age difference of 3 Gyr, although this too hinges on the assumed ztrunc .\nPost-Galactic: Building upon a suggestion by Schweizer (1987), Ashman &\nZepf (1992) examined the possibility that a factor-of-two difference in specific\nfrequency, SN , between normal elliptical and spiral galaxies (e.g., Harris 1991)\nmight be explained if: (1) normal elliptical galaxies formed as a result of major\nmergers of disk galaxies, and (2) the merger process led to the formation of new,\npresumably MR, GCs. There seems to be little doubt that a process of this\nsort has played in role in the formation of some elliptical galaxies, in light of\nthe detection of young clusters forming in interacting galaxies (e.g., Whitmore\net al. 2001). But is it plausible that major mergers of disk-galaxy pairs is the\ngeneric mechanism for the formation of normal elliptical galaxies, more than\nhalf of which show bimodal GC MDFs (e.g., Larsen et al. 2001)?\nThe most comprehensive study of GC formation in disk mergers is that of\nBekki et al. (2002), who used an N-body/TREESPH code to investigate mergers of pairs of gas-rich disk galaxies. These disks were posited to contain a\npre-existing population of exclusively MP GCs. Using a simple pressure criterion for the onset of GC formation, Bekki et al. showed that the end-products\nof such mergers do indeed resemble elliptical galaxies, with distinct MP and\nMR GC subpopulations. The newly-formed MR GCs show a greater degree of\nconcentration toward the center of the merger remnant, as is observed. Bekki\net al. also examined the kinematic properties of the MP and MR GC subpopulations, finding the MP component to show a large velocity dispersion and a net\nrotation; by contrast, the MR component was found to show a lower dispersion\nand modest rotation. By examining the GC MDFs of the merged galaxy, Bekki\net al. also noted that the mean metallicity of the MR GCs far exceeded those\nmeasured for MR GCs in real ellipticals. As no plausible change in the assumed\nrange of gas metallicities, abundance gradients in the progenitor disks, or GC\n\n\fAPS Conf. Ser. Style\n\n5\n\nFigure 2.\nColor distributions for GCs belonging to M87 and M49,\nbased on HST photometry from Kundu et al. (1999) and Kundu &\nWhitmore (2001). The solid and dashed curves for the best-fit double\nGaussians used to estimate the GC formation efficiencies given in Table 1. The relative numbers of MP and MR GCs in the two galaxies\nis remarkably similar, despite the factor of 2-3 difference in specific\nfrequency.\nformation criteria was able to alter this basic result, they concluded that \"if most\nelliptical galaxies are formed by major mergers, then it must have occurred at\nhigh redshift\".\n\n3.\n\nThe Globular Cluster Systems of M87 and M49 Compared\n\nLet us now consider how the various models fare in explaining the GC systems of real ellipticals. I will focus on a comparison of two thoroughly-studied\nellipticals: M49 and M87, the first- and second-ranked members of the Virgo\ncluster, respectively. Although they differ in V -band luminosity by only ∼ 20%,\nthe GC specific frequency of M87 exceeds that of M49 by a factor of 2-3 (Harris\n1991). Together, these galaxies form a \"second parameter\" pair in terms of their\nGC systems, and any viable formation scenario must account for the observed\ndifferences and similarities.\nThe primary motivation of the Ashman & Zepf (1992) merger model was\nan explanation of the higher specific frequencies of early-type galaxies relative\nto disk galaxies. In this picture, mergers serve to increase specific frequency\nthrough the formation of MR GCs. Thus, galaxies with high specific frequencies\n- of which M87 is the prototype - are expected to have predominantly MR\nGC systems according to this model. In the specific case of M87, this \"excess\"\npopulation relative to M49 should amount to ≈ 7000 additional MR GCs.\nAs Figure 3 shows, this expectation is not borne out by the observations.\nThe measured GC color distributions for the two galaxies (based on deep HST\nimaging in identical filters from Kundu et al. 1999 and Kundu & Whitmore\n2001) are remarkably similar. Parameterizing each distribution with a doubleGaussian yields the percentages of MP and MR GCs given in Table 1. This table\nalso give the total number of GCs belonging to each galaxy, Ntot , from McLaughlin (1999), who showed that the observed difference in specific frequency between\n\n\f6\n\nPatrick Côté\n\nthese two galaxies is likely due to the greater mass in X-ray emitting gas in the\nvicinity of M87.\nTable 1.\n\nGC Formation Efficiencies for M87 and M49\nNtot\nǫtot\nfMP\nfMR\nǫMP\nǫMR\n\nM87\n13,600±600\n0.28±0.04%\n57±5%\n43±5%\n0.16±0.03%\n0.12±0.02%\n\nM49\n6,850±550\n0.23±0.05%\n54±5%\n46±5%\n0.12±0.03%\n0.11±0.03%\n\nDefining the GC formation efficiency, ǫtot , as the total mass in GCs normalized to the total baryonic mass (i.e., stars and gas), McLaughlin found the GC\nformation efficiencies given in Table 1. The overall efficiency with which GCs\nformed in M87 and M49 are not only consistent with each other, they are indistinguishable from the \"universal\" GC formation efficiency of hǫtot i = 0.26±0.05%\nfound by McLaughlin (1999) from an analysis of nearly one hundred early-type\ngalaxies (see also Blakeslee et al. 1997). In any event, it is clear from Table 1\nand Figure 1 that the similar relative number of MP and MR GCs in the two\ngalaxies is certainly at odds with the predictions of the merger model.\nCombining the values of fMP and fMR from Table 1 with McLaughlin's best\nestimates for ǫtot in the two galaxies, I find the values of ǫMP and ǫMR given in\nTable 1. To within the uncertainties, the MP and MR GC systems have identical\nformation efficiencies. The observed values of ǫMP are roughly consistent with\nthe formation efficiency of MP GCs, ǫMP = 0.2%, used by Beasley et al. (2002)\nin their semi-analytic simulations. However, their assumed value of ǫMR =\n0.7% exceeds the measured value by a factor of six. Strictly speaking, the GC\nformation efficiencies in Table 1 are measured relative to the baryonic mass,\nwhereas those of Beasley et al. are measured with respect to the total mass (i.e.,\nincluding dark matter). However, inside ∼ 50 kpc, the R-band mass-to-light\nratios of M49 and M87 are virtually identical, with ΥR ∼ 35 (Côté et al. 2001;\n2003), so the comparison should be valid in this case.\nTable 2.\n\nKinematics of GC Subpopulations in M87 and M49\nM87\n\nAll\nMP\nMR\n\nhσp i\n(km s−1 )\n383+31\n−7\n397+36\n−14\n365+38\n−18\n\nhΩRi\n(km s−1 )\n171+39\n−30\n186+58\n−41\n155+53\n−37\n\nM49\nhΩR/σp i\n0.45±0.09\n0.47+0.13\n−0.11\n0.43+0.14\n−0.12\n\nhσp i\n(km s−1 )\n316+27\n−8\n342+33\n−18\n265+34\n−13\n\nhΩRi\n(km s−1 )\n48+52\n−26\n93+69\n−37\n-26+64\n−79\n\nhΩR/σp i\n0.15+0.15\n−0.08\n0.27+0.19\n−0.11\n0.10+0.27\n−0.25\n\nNow let us examine the kinematical properties of the two GC systems. A\ndynamical analysis of the M87 GC system based on Washington photometry\nand radial velocities for 278 confirmed GCs was presented recently in Côté et al.\n\n\fAPS Conf. Ser. Style\n\n7\n\nFigure 3.\nKinematic properties of GCs in M87. The panels show\nsmoothed profiles for the velocity dispersion, rotation amplitude, position angle of the rotation axis, and the ratio of rotation amplitude\nto line-of-sight velocity dispersion. The dashed and dotted lines in the\nthird panels show the orientation of the galaxy's minor and major axes,\nrespectively. Results for the MP GCs are shown on the left; MR GCs\nare on the right. Only those points that are separated by more than\n90′′ ≃ 6.5 kpc are independent. The dotted and solid curves show the\n68% and 95% confidence intervals on measured parameters.\n\n(2001) and a similar analysis for the M49 GC system, based on velocities for 263\nGCs, is now underway (Côté et al. 2003). Figure 2 shows the radial variation in\nkinematic parameters (i.e., velocity dispersion, σp , projected rotation amplitude,\nΩR, position angle of the rotation axis, Θ0 , and the ratio of rotation amplitude\nto velocity dispersion, ΩR/σp ) for the MP and MR GCs in M87. Global results\nfor the two galaxies are presented in Table 2.\nA detailed discussion of the results is beyond the scope of this review, but\nthe main findings can be summarized as follows. In M87, both the MP and\nMR GC systems show significant rotation, with hΩR/σi ≈ 0.45. The MR GCs\nrotate about the galaxy's minor axis everywhere, as do the MP GCs beyond\nR ∼ 15 kpc. Inside this radius, however, the MP GCs appear to rotate about\nthe major axis. In the case of M49, the MP GCs show modest minor axis rotation\neverywhere, with hΩR/σp i ≃ 0.27, while the MR GCs show little or no rotation.\n(The formal best-fit actually suggests that the MR GCs are counter-rotating).\nClearly, the GC subsystems in M87 and M49 show some rather dramatic\nkinematic differences. This apparent complexity becomes is all the more puzzling when one considers that the two spiral galaxies have the best studied GC\nsystems, the Milky Way and M31, have hΩR/σi ≃ 0.32 and hΩR/σi ≃ 0.85 for\n\n\f8\n\nPatrick Côté\n\nthe MP components, respectively. For their MR GC subpopulations, rotation\nis even more important, with hΩR/σi ≃ 1.05 and hΩR/σi ≃ 1.10 respectively\n(Côté 1999; Perrett et al. 2002).\nWhat implications do these results have for GC formation models? First,\nthe rotation observed for MP GCs in these galaxies suggests that, if these GCs\ndid indeed originate in numerous, low-mass proto-galactic fragments as suggested by several of the \"proto-galactic\" models discussed above, then these\nlow-mass fragments must first have coalesced into larger entities before being\nincorporated into the final galaxy (assuming that the observed rotation reflects\nthe orbital angular momentum of the progenitor galaxies). Secondly, the rapid\nrotation among the MR GCs in M87 (and in the two spirals) indicates that their\nformation in mergers may be unlikely, given that angular momentum transport\nshould produce a slowly rotating population. On the other hand, the MR GCs\nin M49 are consistent with no net rotation, suggesting that angular momentum\ntransport during a major merger may have been effective in this case.\nFinally, I consider the critical issue of ages for the MP and MR GCs subpopulations in these galaxies, focusing on two complementary techniques that\nhave been brought to bear upon this issue: integrated-light spectroscopy, and\nthe magnitude difference between the turnovers of the GC luminosity functions\n(LFs) for the GC subpopulations. The former technique yields absolute ages for\nthe GC subpopulations, while the latter approach gives only their relative ages.\nThe various age measurements are summarized in Table 3, which reports\n∆T ≡ TMP − TMR for each GC subpopulation and, when available, the corresponding absolute ages. In the case of M87, the spectroscopy of Cohen et al.\n(1998) suggests an old age for both components, with no evidence for a trend\nbetween age and metallicity. On the other hand, Kundu et al. (1999) found a\nrather large age difference from the V and I luminosity functions, with the MR\nGCs being several Gyr younger. A more recent application of this technique,\nhowever, which relies on Strömgren photometry from from HST and makes use\nof the greater age sensitivity of the u-band, points to a very small age difference, in agreement with the spectroscopic results (Jordán et al. 2002). For M49,\nboth techniques indicate that the GC subpopulations are coeval to within the\nmeasurement errors.\nTable 3.\nGalaxy\nM87\n\nAge Determinations for GC Subpopulations in M87 & M49\n\nTMP\n13.7±1.8\n***\n***\n\nTMR\n12.7±2.2\n***\n***\n\n∆T ≡ TMP − TMR\n+1.0±3.3\n≈3–6\n+0.2±1.5(sys.)±2.0(ran.)\n\nSource\nSpectra\nLF (V I)\nLF (uvby)\n\nRef.\n1\n2\n3\n\nM49\n\n***\n***\n−0.6±3.2\nLF (V I)\n4\n14.5±4\n13.8±6\n+0.7±7.2\nSpectra\n5\nREFERENCES: (1) Cohen et al. (1998); (2) Kundu et al. (1999); (3) Jordán\net al. (2002); (4) Puzia et al. (1999); (5) Beasley et al. (2000).\nThe agreement between the photometric and spectroscopic results is generally encouraging. For these two galaxies at least, the MP and MR GCs seem to\n\n\fAPS Conf. Ser. Style\n\n9\n\nbe truly old objects. Although the error bars remain large, it seems that, if GC\nformation in mergers of any sort - minor or major - has played the dominant\nrole in producing the MR GCs in these galaxies, then the merger/assembly process must have occurred at high redshift (i.e., z >\n∼ 4 in the currently fashionable\nΛCDM models). In my opinion, these results suggest that the disparate metallicities of the GC subpopulations in these galaxies likely reflect environmental\ndifferences in the local sites of GC formation.\n\n4.\n\nConclusions\n\nIn both M87 and M49, the efficiency of GC formation is found to have the\nfamiliar \"universal\" value of ǫtot ≃ 0.25% per unit baryon mass (McLaughlin\n1999). In both galaxies, the formation efficiencies of the separate MP and MR\ncomponents is roughly half that of the GC system as a whole. These findings\nprovide a challenge to models in which MR GCs form exclusively in major\nmergers, and to models that require different formation efficiencies for the MP\nand MR GCs.\nKinematic studies of the GC subpopulations in M87 and M49 reveal some\ninteresting differences. In M87, both GC subpopulations show rapid rotation;\nin M49, the MP GCs show modest rotation, while the MR GCs form a nonrotating population. The existence of rapidly rotating GC subpopulations in\nthese galaxies, and in the Milky Way and M31, suggests that mergers have\nprobably played a role in the formation of the host galaxies, as the amount of\nangular momentum involved seems to exceed that generated by tidal torques\nalone (see Côté et al. 2001). With the exception of M49, the rapidly rotating\nMR GCs in these galaxies indicate that the formation of the MR GCs probably\npredated the mergers. Furthermore, the ages of the GC subpopulations in M87\nand M49 suggest that if the mergers were predominantly dissipational in nature,\nthen the mergers must have occurred at high redshift, as noted by Bekki et al.\n(2002) from an analysis of simulated and observed GC MDFs.\nMany properties of the MP GCs in M87 and M49 (and in other galaxies)\nare consistent with the predictions of models in which these GCs form in lowmass, proto-galactic fragments that are later accreted into the main body of\nthe galaxy. These proto-galactic fragments appear to be the analogs of the\nlow-mass subhalos that form in cosmological simulations of structure formation.\nIndeed, the literature abounds with terminology for these objects: e.g., protogalactic fragments, supergiant molecular clouds, proto-galactic disks, SearleZinn fragments, failed dwarfs, etc. In terms of their physical properties, however,\nthese are the same objects.\nWhile there may be an emerging consensus on the origin of the MP GCs,\ndebate continues on the nature and origin of their MR counterparts. These\nclusters can be interpreted simply as those that formed in the most massive\nproto-galactic fragments, or as the endproducts of a star formation burst triggered by gas-rich mergers. The former interpretation has the aesthetic advantage\nof requiring a single mechanism to explain both GC populations, while the second scenario has strong support from observations of young GCs forming in\nlocal mergers. It is likely that both processes have played a part in shaping\n\n\f10\n\nPatrick Côté\n\nthe GC systems that we observe today, and our task for the decade ahead is to\ndetermine which, if either, of these processes has played a dominant role.\nI thank Judy Cohen, John Blakeslee, Andres Jordán, Ron Marzke, Dean\nMcLaughlin and Mike West for allowing me to present preliminary results from\nour ongoing collaborations.\nReferences\nAshman, K.M., & Zepf, S.E. 1992, ApJ, 384, 50\nBeasley, M.A., Baugh, C.M., Forbes, D.A., Sharples, R.M., & Frenk, C.S. 2002,\nMNRAS, 333, 383\nBeasley, M.A., Sharples, R.M.;,Bridges, T.J.;,Hanes, D.A., Zepf, S.E., Ashman,\nK.M., & Geisler, D. 2000, MNRAS, 318, 1249\nBekki, K., Forbes, D.A., Beasley, M.A., & Couch, W.J. 2002, astro-ph/0206008\nBlakeslee, J.P., Tonry, J.L., & Metzger, M.R. 1997, AJ, 114, 482\nCen, R. 2001, ApJ, 560, 592\nCohen, J.G., Blakeslee, J.P., & Ryzhov, A. 1998, ApJ 496, 808\nCôté, P. 1999, AJ, 118, 406\nCôté, P., Marzke, R.O., & West, M.J. 1998, ApJ, 501, 554\nCôté, P., Marzke, R.O., West, M.J., Minniti, D. 2000, ApJ, 533, 869\nCôté, P., West, M.J., & Marzke, R.O. 2002, ApJ, 567, 853\nCôté, P., McLaughlin, D.E., Hanes, D.A., Bridges, T.J., Geisler, D.; Merritt,\nD., Hesser, J.E., Harris, G.L.H., & Lee, M.G. 2001, ApJ, 559, 828\nHarris, W.E., & Pudritz, R.E. 1994, ApJ, 420, 177\nJordán, A., Côté, P., West, M.J., & Marzke, R.O. 2002, ApJ, in press.\nKlypin, A., Kravtsov, A.V., Valenzuela, O., & Prada, F. 1999, ApJ, 522, 82\nKundu, A., Whitmore, B.C., Sparks, W.B., Macchetto, F.D., Zepf, S.E., &\nAshman, K.M. 1999, ApJ, 513, 733\nKundu, A., & Whitmore, B.C. 2001, AJ, 121, 2950\nMoore, B., Ghigna, S., Governato, F., Lake, G., Quinn, T., Stadel, J., & Tozzi,\nP. 1999, ApJ, 524, L19\nMcLaughlin, D.E. 1999, AJ, 117, 2398\nPeebls, P.J.E., & Dicke, R.H. 1968, ApJ, 154, 891\nPeebles, P.J.E. 1984, ApJ, 277, 470\nPerrett, K.M., Bridges, T.J., Hanes, D.A., Irwin, M.J., Brodie, J.P., Carter, D.,\nHuchra, J.P., & Watson, F.G. 2002, AJ, 123, 2490\nPress, W.H., & Schechter, P. 1974, ApJ, 187, 425\nPuzia, T.H., Kissler-Patig, M., Brodie, J. P., & Huchra, J.P. 1999, AJ, 118, 2734\nSchweizer, F. 1987 in Nearly Normal Galaxies, ed. S.M. Faber (Springer, New\nYork), p. 18\nWeil, M.L., & Pudritz, R.E. 2001, ApJ, 556, 164\nWhitmore, B.C., Zhang, Q., Leitherer, C., Fall, S.M., Schweizer, F., & Miller,\nB.W. 1999, AJ, 118, 1551\n\n\f"}