{"id": "http://arxiv.org/abs/cond-mat/0310538v2", "guidislink": true, "updated": "2004-04-05T16:09:21Z", "updated_parsed": [2004, 4, 5, 16, 9, 21, 0, 96, 0], "published": "2003-10-22T19:08:52Z", "published_parsed": [2003, 10, 22, 19, 8, 52, 2, 295, 0], "title": "Interfacial layering in a three-component polymer system", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0310603%2Ccond-mat%2F0310666%2Ccond-mat%2F0310041%2Ccond-mat%2F0310201%2Ccond-mat%2F0310060%2Ccond-mat%2F0310343%2Ccond-mat%2F0310120%2Ccond-mat%2F0310285%2Ccond-mat%2F0310416%2Ccond-mat%2F0310635%2Ccond-mat%2F0310715%2Ccond-mat%2F0310314%2Ccond-mat%2F0310188%2Ccond-mat%2F0310342%2Ccond-mat%2F0310619%2Ccond-mat%2F0310072%2Ccond-mat%2F0310374%2Ccond-mat%2F0310220%2Ccond-mat%2F0310679%2Ccond-mat%2F0310414%2Ccond-mat%2F0310545%2Ccond-mat%2F0310616%2Ccond-mat%2F0310420%2Ccond-mat%2F0310737%2Ccond-mat%2F0310254%2Ccond-mat%2F0310211%2Ccond-mat%2F0310360%2Ccond-mat%2F0310387%2Ccond-mat%2F0310247%2Ccond-mat%2F0310098%2Ccond-mat%2F0310313%2Ccond-mat%2F0310404%2Ccond-mat%2F0310657%2Ccond-mat%2F0310361%2Ccond-mat%2F0310160%2Ccond-mat%2F0310447%2Ccond-mat%2F0310238%2Ccond-mat%2F0310510%2Ccond-mat%2F0310119%2Ccond-mat%2F0310618%2Ccond-mat%2F0310226%2Ccond-mat%2F0310204%2Ccond-mat%2F0310710%2Ccond-mat%2F0310083%2Ccond-mat%2F0310538%2Ccond-mat%2F0310334%2Ccond-mat%2F0310523%2Ccond-mat%2F0310634%2Ccond-mat%2F0310732%2Ccond-mat%2F0310139%2Ccond-mat%2F0310202%2Ccond-mat%2F0310004%2Ccond-mat%2F0310076%2Ccond-mat%2F0310384%2Ccond-mat%2F0310742%2Ccond-mat%2F0310582%2Ccond-mat%2F0310179%2Ccond-mat%2F0310300%2Ccond-mat%2F0310546%2Ccond-mat%2F0310359%2Ccond-mat%2F0310330%2Ccond-mat%2F0310539%2Ccond-mat%2F0310595%2Ccond-mat%2F0310214%2Ccond-mat%2F0310474%2Ccond-mat%2F0310476%2Ccond-mat%2F0310535%2Ccond-mat%2F0310588%2Ccond-mat%2F0310518%2Ccond-mat%2F0310185%2Ccond-mat%2F0310019%2Ccond-mat%2F0310328%2Ccond-mat%2F0310778%2Ccond-mat%2F0310407%2Ccond-mat%2F0310526%2Ccond-mat%2F0310322%2Ccond-mat%2F0310070%2Ccond-mat%2F0310408%2Ccond-mat%2F0310178%2Ccond-mat%2F0310681%2Ccond-mat%2F0310429%2Ccond-mat%2F0310036%2Ccond-mat%2F0310080%2Ccond-mat%2F0310233%2Ccond-mat%2F0310453%2Ccond-mat%2F0310194%2Ccond-mat%2F0310775%2Ccond-mat%2F0310612%2Ccond-mat%2F0310641%2Ccond-mat%2F0310200%2Ccond-mat%2F0310587%2Ccond-mat%2F0310128%2Ccond-mat%2F0310503%2Ccond-mat%2F0310389%2Ccond-mat%2F0310050%2Ccond-mat%2F0310466%2Ccond-mat%2F0310633%2Ccond-mat%2F0310227%2Ccond-mat%2F0310393%2Ccond-mat%2F0310158%2Ccond-mat%2F0310654&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Interfacial layering in a three-component polymer system"}, "summary": "We study theoretically the temporal evolution and the spatial structure of\nthe interface between two polymer melts involving three different species (A,\nA* and B). The first melt is composed of two different polymer species A and A*\nwhich are fairly indifferent to one another (Flory parameter chi_AA* ~ 0). The\nsecond melt is made of a pure polymer B which is strongly attracted to species\nA (chi_AB < 0) but strongly repelled by species A* (chi_A*B > 0). We then show\nthat, due to these contradictory tendencies, interesting properties arise\nduring the evolution of the interface after the melts are put into contact: as\ndiffusion proceeds, the interface structures into several adjacent\n\"compartments\", or layers, of differing chemical compositions, and in addition,\nthe central mixing layer grows in a very asymmetric fashion. Such unusual\nbehaviour might lead to interesting mechanical properties, and demonstrates on\na specific case the potential richness of multi-component polymer interfaces\n(as compared to conventional two-component interfaces) for various\napplications.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0310603%2Ccond-mat%2F0310666%2Ccond-mat%2F0310041%2Ccond-mat%2F0310201%2Ccond-mat%2F0310060%2Ccond-mat%2F0310343%2Ccond-mat%2F0310120%2Ccond-mat%2F0310285%2Ccond-mat%2F0310416%2Ccond-mat%2F0310635%2Ccond-mat%2F0310715%2Ccond-mat%2F0310314%2Ccond-mat%2F0310188%2Ccond-mat%2F0310342%2Ccond-mat%2F0310619%2Ccond-mat%2F0310072%2Ccond-mat%2F0310374%2Ccond-mat%2F0310220%2Ccond-mat%2F0310679%2Ccond-mat%2F0310414%2Ccond-mat%2F0310545%2Ccond-mat%2F0310616%2Ccond-mat%2F0310420%2Ccond-mat%2F0310737%2Ccond-mat%2F0310254%2Ccond-mat%2F0310211%2Ccond-mat%2F0310360%2Ccond-mat%2F0310387%2Ccond-mat%2F0310247%2Ccond-mat%2F0310098%2Ccond-mat%2F0310313%2Ccond-mat%2F0310404%2Ccond-mat%2F0310657%2Ccond-mat%2F0310361%2Ccond-mat%2F0310160%2Ccond-mat%2F0310447%2Ccond-mat%2F0310238%2Ccond-mat%2F0310510%2Ccond-mat%2F0310119%2Ccond-mat%2F0310618%2Ccond-mat%2F0310226%2Ccond-mat%2F0310204%2Ccond-mat%2F0310710%2Ccond-mat%2F0310083%2Ccond-mat%2F0310538%2Ccond-mat%2F0310334%2Ccond-mat%2F0310523%2Ccond-mat%2F0310634%2Ccond-mat%2F0310732%2Ccond-mat%2F0310139%2Ccond-mat%2F0310202%2Ccond-mat%2F0310004%2Ccond-mat%2F0310076%2Ccond-mat%2F0310384%2Ccond-mat%2F0310742%2Ccond-mat%2F0310582%2Ccond-mat%2F0310179%2Ccond-mat%2F0310300%2Ccond-mat%2F0310546%2Ccond-mat%2F0310359%2Ccond-mat%2F0310330%2Ccond-mat%2F0310539%2Ccond-mat%2F0310595%2Ccond-mat%2F0310214%2Ccond-mat%2F0310474%2Ccond-mat%2F0310476%2Ccond-mat%2F0310535%2Ccond-mat%2F0310588%2Ccond-mat%2F0310518%2Ccond-mat%2F0310185%2Ccond-mat%2F0310019%2Ccond-mat%2F0310328%2Ccond-mat%2F0310778%2Ccond-mat%2F0310407%2Ccond-mat%2F0310526%2Ccond-mat%2F0310322%2Ccond-mat%2F0310070%2Ccond-mat%2F0310408%2Ccond-mat%2F0310178%2Ccond-mat%2F0310681%2Ccond-mat%2F0310429%2Ccond-mat%2F0310036%2Ccond-mat%2F0310080%2Ccond-mat%2F0310233%2Ccond-mat%2F0310453%2Ccond-mat%2F0310194%2Ccond-mat%2F0310775%2Ccond-mat%2F0310612%2Ccond-mat%2F0310641%2Ccond-mat%2F0310200%2Ccond-mat%2F0310587%2Ccond-mat%2F0310128%2Ccond-mat%2F0310503%2Ccond-mat%2F0310389%2Ccond-mat%2F0310050%2Ccond-mat%2F0310466%2Ccond-mat%2F0310633%2Ccond-mat%2F0310227%2Ccond-mat%2F0310393%2Ccond-mat%2F0310158%2Ccond-mat%2F0310654&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study theoretically the temporal evolution and the spatial structure of\nthe interface between two polymer melts involving three different species (A,\nA* and B). The first melt is composed of two different polymer species A and A*\nwhich are fairly indifferent to one another (Flory parameter chi_AA* ~ 0). The\nsecond melt is made of a pure polymer B which is strongly attracted to species\nA (chi_AB < 0) but strongly repelled by species A* (chi_A*B > 0). We then show\nthat, due to these contradictory tendencies, interesting properties arise\nduring the evolution of the interface after the melts are put into contact: as\ndiffusion proceeds, the interface structures into several adjacent\n\"compartments\", or layers, of differing chemical compositions, and in addition,\nthe central mixing layer grows in a very asymmetric fashion. Such unusual\nbehaviour might lead to interesting mechanical properties, and demonstrates on\na specific case the potential richness of multi-component polymer interfaces\n(as compared to conventional two-component interfaces) for various\napplications."}, "authors": ["A. Aradian", "F. Saulnier", "E. Raphael", "P. -G. de Gennes"], "author_detail": {"name": "P. -G. de Gennes"}, "author": "P. -G. de Gennes", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1021/ma0356008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0310538v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0310538v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Revised version, to appear in Macromolecules", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0310538v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0310538v2", "journal_reference": "Published in Macromolecules, vol. 37, pp. 4664-4675 (2004)", "doi": "10.1021/ma0356008", "fulltext": "arXiv:cond-mat/0310538v2 [cond-mat.soft] 5 Apr 2004\n\nInterfacial layering in\na three-component polymer system\nA. Aradian1,2∗, F. Saulnier1†, E. Raphaël1‡and P.-G. de Gennes1§\n1\n\nPhysique de la Matière Condensée, C.N.R.S. UMR 7125 & Fédération de Recherche MSC (FR 2438),\nCollège de France, 11 place Marcelin Berthelot, 75231 Paris Cedex 05, France\n2\n\nUniversity of Edinburgh, School of Physics,\n\nKing's Buildings JCMB, Edinburgh EH9 3JZ, United Kingdom\n\nNovember 3, 2018\n\nAbstract\nWe study theoretically the temporal evolution and the spatial structure of the interface\nbetween two polymer melts involving three different species (A, A* and B). The first melt\nis composed of two different polymer species A and A* which are fairly indifferent to one\nanother (Flory parameter χAA* ≃ 0). The second melt is made of a pure polymer B which\nis strongly attracted to species A (χAB < 0) but strongly repelled by species A* (χA*B > 0).\n\nWe then show that, due to these contradictory tendencies, interesting properties arise during\nthe evolution of the interface after the melts are put into contact: as diffusion proceeds, the\ninterface structures into several adjacent \"compartments\", or layers, of differing chemical\ncompositions, and in addition, the central mixing layer grows in a very asymmetric fashion.\nSuch unusual behaviour might lead to interesting mechanical properties, and demonstrates\non a specific case the potential richness of multi-component polymer interfaces (as compared\nto conventional two-component interfaces) for various applications.\n\n1\n\nIntroduction and motivation\nThe phenomena taking place at the interfaces and surfaces of polymeric systems are obviously\n\nof high importance to many practical or industrial situations. As a result, they have been the\nfocus of extensive study both experimentally and theoretically in the recent decades. Much\nprogress has been made in the understanding of these phenomena as well as in the development\nof techniques to characterize them (see e.g. the general references 1–4).\n∗\n\nA.Aradian@ed.ac.uk\nFlorent.Saulnier@college-de-france.fr\n‡\nElie.Raphael@college-de-france.fr\n§\nPGG@curie.fr\n†\n\n1\n\n\f1.1\n\nInterfaces between polymer melts\n\nOne situation which has received much attention is that of two pieces of molten polymer put\ninto (good) contact at a certain initial time: how does then the interface between these melts\nevolve, and how does the mixing between the melts occur, if any? or, more precisely, what is\nthe final, equilibrium state reached by the system (i.e., given enough time, does it mix fully or\nonly in a restricted region?), and with what kind of concentration profile? What is the dynamics\nleading to that final state, over which typical timescales? etc. It has been found,1, 2 due to the\nspecific physics of polymer macromolecules, that their mixing is generally quite different from\nwhat is known in more conventional diffusive systems, like molecular gases.\nOnce the two polymer pieces are put into contact, the subsequent evolution will obviously\ngenerally depend on the various physico-chemical properties of the materials facing each other\n(nature of microscopic interactions between monomers, chain length, topological structure, . . . ).\nIt has been recognized however that, at least from a conceptual standpoint, the two most crucial\nparameters determining the fate of the system are the sign and magnitude of the product χN ,\nwhere χ is the Flory parameter,5 related to the microscopic interactions between components,\nand N is the chain length. We will remind of the different possibilities for χN in section 2.\n\n1.2\n\nMulti-component interfaces\n\nIn order to facilitate the identification and modelling of the fundamental processes at work\nwithin polymer/polymer interfaces, past studies have for the most part, if not exclusively, focused\non interfaces involving two species (for instance, one on each side of the interface) and sometimes\nonly one species (interfaces between two identical melts). Certainly, the span of real situations\nis much wider, with a vast range of multi-component interfaces, and one is thus entitled to ask\nwhat is the structure and dynamics of an interface between two polymer mixtures involving\nmore than two components.\nAs exemplified on the case studied in this article, such multi-component interfaces may have\nan interest of their own, as a means (for example) of obtaining structured interfaces at a submicron scale: when two polymer mixtures are put into contact, and provided the contrast in\nrelative miscibilities of the different components is adequate, a \"multiple\" interface may form;\nthat is to say the interface will partition into several adjacent layers, each of different chemical\ncomposition. A possible application of this could be the formation of multilayer polymer films.\nThe mechanical properties presented by the resulting assembly might also prove interesting.\nMulti-species interfaces can also appear in the course of an interfacial reaction between two\npolymers: when the polymer pieces are put into contact, a reaction may start at the interface that\ndelivers a (polymer) product whose miscibilities with each of the initial reactants are different;\nthis three-species system is susceptible to lead to a multiple interface, whose dynamics is then\n\n2\n\n\fcoupled to that of the chemical reaction.\nHowever, on purely combinatorial grounds, the diversity of all conceivable multi-component\ninterfaces makes any general approach likely to be hopeless; thus delineating and focusing on a\ncertain number of limiting situations may be useful. This is indeed the purpose of the present\narticle: we will be considering one such \"selected case\" for a three-component interface, and will\nshow that it exhibits a peculiar spatial structure and evolution through time, which we will fully\nanalyze.\nThe article is organized as follows: in section 2, we start with a reminder on the standard\ntheoretical results concerning two-component interfaces, as these will be used as basic tools for\nthe rest of the paper. In section 3, we present the system that will be studied, and try to\nqualitatively explain the structure of the multiple interface which appears. In section 4, we\nwrite the equations governing the system and solve them, thus finding the lengthscales and\nconcentration profiles which characterize the dynamics of our system (note that, if interested\nonly in results, our reader can skip directly to section 4.3). Section 5 closes the article with\nsome concluding remarks.\n\n2\n\nA short overview of two-component interfaces\nWe start here by a general overview of the standard theories describing two-species interfaces.\n\nBy no means do we aim here at an exhaustive survey of the theoretical or experimental literature\non the subject: we simply quickly recall the most basic theoretical elements on which our present\nwork builds.\nLet us denote the two polymer species we consider as A and B. We will cover interfaces\noccurring between an A-melt facing a B-melt, as well as between two A-B blends facing each\nother but of differing A/B proportions. We will also mainly put the emphasis on the effect of\nvarying the Flory parameter χAB between A and B, with the assumption that both A and B\nhave the same chain length N . Situations where NA and NB differ (e.g. a melt of long chains\nfacing a melt of short chains), which are still subject to some debates, will merely be hinted at.\nIt is a remarkable point that the kinetics of formation of interfaces between chemically\ndifferent polymers is controlled by thermodynamic as well as kinetic factors. To take into\naccount the driving or slowing role played by energetic parameters in diffusion processes, it is\nmuch convenient to use Flory-Huggins' derivation of the free energy (see eq. 6 for the expression\nof the free energy f in this model, and also note 6): thinking in terms of a lattice model,\nthe dimensionless Flory parameter χAB characterizes the enthalpy of mixing at the molecular\nlevel, by comparing interactions between neighboring polymer segments of the same species (i.e.,\nassociation energy ǫAA for two neighboring A segments, ǫBB for two B segments) and interactions\nbetween different species in contact (ǫAB for an A next to a B). If z denotes the coordination\n\n3\n\n\fnumber in the lattice, we define\nz(2ǫAB − ǫAA − ǫBB )\n(1)\n2kT\nis the energy change, in units of the thermal energy kT , when a segment of A is\nχAB =\n\nIn words, χAB\n\ntaken from an environment of pure A and swapped with a segment of B from an environment\nof pure B. The Flory parameter χAB can be positive or, much more rarely, negative. If the\nonly interactions existing between A and B are van der Waals forces, χAB shall be positive.\nNegative values of χAB do appear in polymer couples displaying specific chemical interactions,\nsuch as hydrogen bonds. The three following subsections briefly discuss the different possible\ncases (χAB > 0, χAB = 0, χAB < 0) and their physical consequences.\n\n2.1\n\nImmiscible components: χAB > 0\n\nAs stated above, in the absence of specific interactions or structural similarities, the Flory\nparameter is positive and usually ranges from 10−3 to 10−1 . This is by far the most usual\nsituation for polymer pairs. For polymer pairs differing only by isotopic substitution (e.g., when\ndeuterium is substituted to hydrogen in the monomer structure), very small, positive values as\nlow as χAB ≃ 10−4 can be found.7\n\nIn this case of positive χAB , the polymer pairs are immiscible for all but the lowest molecular\n\nweights: if N = NA = NB is the length of both polymers A and B, it can be shown that, for a\nFlory parameter χAB greater than a critical value χC = 2/N ≪ 1, phase separation occurs and\n\nwe end up at equilibrium with macroscopic regions of pure A and pure B, separated by a sharp\ninterfacial layer: no macroscopic mixing occurs.\nLet us precise the nature of this interface between the two coexisting phases by a simple\nscaling argument.8 The characteristic width w of the interface can be estimated by a balance\nbetween the chain entropy (of order kT per chain), which tends to widen the interface, and\nthe unfavorable enthalpy of mixing (of order χAB per segment), which tends to narrow the\ninterface: thus the typical length N0 of a loop of an A-chain penetrating a B-rich region is given\nby N0 χAB kT ∼ kT , that is, N0 ∼ 1/χAB . Because the loop has the form of a random statistical\n√\nwalk, this contour length corresponds to a (straight) penetration distance w ∼ a Nmax (where\n\na is the monomer size). We finally find that the characteristic width of the interface is\na\nw∼ √\nχAB\n\n(2)\n\nThis simple analysis is in accordance with the results obtained from a more rigorous description based on a square-gradient model of the interfacial free energy.8 Note that the scaling\nanalysis leading to this result is valid provided that χAB N ≫ 1: equation 2 then predicts the\nmixing region to be much smaller than the polymer coil size, and thus, at the macroscopic\n\nscale, the interface is to be considered as very sharp one, with a steep profile. This property of\ninterfaces between immiscible melts will be used thereafter in our solution (cf. Sec. 3.2).\n4\n\n\f2.2\n\nEntropy-driven mixing: χAB = 0\n\nWe now consider the case of a zero Flory parameter. Rigorously speaking, this situation\narises when the two polymers put into contact are identical (same chemical structure). But it is\nalso a useful approximation to describe mixing in systems with a very small χAB , be it positive\nor negative (typically when |χAB | ≪ 1/N ).\n\nStarting from the initial situation where two polymer pieces are put into contact, the final,\n\nequilibrium state reached by the system is a homogeneous one (the initial interface has totally\ndisappeared) with complete mixing of the polymer components. As there is no enthalpy gain\nassociated with mixing species (χAB = 0), the evolution of the system is driven solely by gains\nin the translational entropy of the polymer chains.\nThe dynamics towards this final state can be complex, especially for entangled polymers\nwhere several regimes of non-Fickean diffusion successively appear. In these entangled polymers,\nthe first stages of the interdiffusion process between melts of equal molecular weight have been\ndescribed first within a scaling approach in Ref.10, and then detailed by different authors:11–14\nthe chains are initially segregated on each side of the contact plane, with discontinuous concentration profiles abruptly dropping from unity to zero at the separation. Then, as the chains\nstart interpenetrating to form a mixed layer, and because of the specific reptational dynamics of\nthe polymer chains, this initial discontinuity survives, with a progressively resorbing amplitude,\nuntil disappearing when the reptation time Trep is reached. The interface is then said to have\n\"healed\" completely. This feature stands in obvious contrast with conventional mixing where\ninitial discontinuities are immediately smoothed out by the diffusion process.\nFor times greater than the reptation time (t > Trep ), the interdiffusion dynamics becomes\npurely Fickean, and is described by the classical diffusion equation\nφ̇ = Ds ∇2 φ\n\n(3)\n\nThe diffusion coefficient Ds , known as the \"self-diffusion\" coefficient, is independent of concentration, and for long, entangled chains (N greater than the entanglement threshold Ne ), is equal\nto\nDs = Λ0\n\nNe\nkT\nN2\n\n(4)\n\nwhere Λ0 is the monomeric mobility.\nThe use of eq 3 is valid only for facing melts with chains A and B of equal length (symmetric\ninterfaces with NA = NB ). The case of asymmetric polymer junctions, between chemically\nidentical melts of different molecular weights (typically a melt of short chains in contact with\na melt of much longer chains) proves much more subtle. The evolution of such a system also\ndisplays several temporal regimes and can essentially be understood as follows:15, 16 the long\nand less mobile chains behave like a gel which is progressively penetrated and swollen by the\n5\n\n\fsmaller species; but as the gel of long chains swells, it effectively drags the smaller chains within\nit. The global diffusion profile is thus rather complex and results from the microscopic diffusion\nof the small chains relative to the matrix of longer chains, combined with the global motion of\nthis matrix. This global flow of the matrix, known as a \"bulk-flow\",9 is essential for a correct\ndescription of the system and will reappear in the next section devoted to enthalpy-driven\nspecies.\n\n2.3\n\nEnthalpy-driven mixing: χAB < 0\n\nLet us now consider the case of mixing between species driven by a gain in enthalpy,\ni.e., when χAB < 0. A few dozens of A/B pairs with χAB < 0 have been reported, like\nPS/PVME (polystyrene/poly-vinylmethylether)17 or PVC/PMMA (poly-vinylchloride)/polymethylmethacrylate). Within the temperature range where χAB remains negative, such polymer\ncouples are fully miscible for all molecular weights.\nThe dynamics of \"enthalpy-driven\" mixing at interfaces between polymers has been the focus\nof many studies in the past 20 years, and its theoretical description has led to some controversy\nin the case where the system is asymmetric, e.g., when the mobility of the A and B chains are\ndifferent (due to different chain lengths).\nBased upon Onsager's formalism of linear irreversible thermodynamics,18, 19 two main approaches were proposed.\nThe so-called \"slow-mode\" theory propounded by Brochard and co-workers20, 21 , assumes\nthat the flux of species A is the opposite of the flux of B, i.e., JA = −JB . In cases where\n\nthe system is asymmetric, this hypothesis of cancellation of fluxes leads to a mutual diffusion\ncoefficient dominated by the mobility of the slowest species-hence the name of the theory.\nOn the other hand, Kramer and co-workers22 explicitly introduce a third species in their\nmodel, which play the role of vacancies in the system and move about in order to allow the\nmotion of A and B chains. Then the fluxes of the A and B components need not be equal\nanymore, and their difference JA − JB is compensated by a net flux of vacancies JV across\nthe cell.23 It is furthermore postulated that the chemical potential of the vacancies is constant\nthroughout the system, and this, contrarily to the theory of Brochard et al., leads to a \"fastmode\" diffusion coefficient, i.e., dominated by the fastest species in asymmetric systems.\n\nIn the recent years, several authors have tried to bridge the gap between these \"slow\" and\n\"fast\" theories ; see for instance refs. 24, 25 and references therein.\nExperimental data seem to validate the fast-mode theory.26–30 Nonetheless, to this day,\nthe origin and physical interpretation of the vacancy flux used in the model of Kramer et al.\nor in more recent approaches remains somewhat obscure. Therefore, it is conceptually most\ninteresting to note that, in an amended version of her model,31 Brochard showed that fast-mode\npredictions could be retrieved without resorting to any flux of vacancies.32 Instead, Brochard's\n6\n\n\fcorrected approach shows that, in addition to the individual diffusion fluxes of A and B, there\nexists a global, collective motion involving both A and B; when this is taken into account,\nfast-mode results are found without the need of vacancies. The occurrence of such collective\n\"bulk-flows\" (as they are called), superimposed to pure diffusion, is indeed known as a common\nfeature of asymmetric diffusive systems.9 In the amended model of Brochard, each chain of\npolymer reptates and diffuses within a matrix composed of all the other chains; physically, a\nbulk-flow occurs because this matrix itself is set into motion, due to the difference of mobility\nbetween the two diffusing species (in other words, polymer chains reptate in tubes which are\nthemselves moving).\nTo describe the interdiffusion process of these two different polymers, one usually employs\nthe so-called \"mutual diffusion\" coefficient DM , which relates the total flux Ji of species i (i =A\nor B) to the gradient of its volume fraction φi : Ji = −DM ∇φi . Let us denote φ ≡ φA = 1 − φB\n\nthe volume fraction of species A. In all the theoretical models mentioned above, the mutual\ndiffusion coefficient can then be cast into the generic form:\nDM = Λ[φ] * φ(1 − φ) *\n\nd2 f\ndφ2\n\n(5)\n\nwhere Λ[φ] is a positive function of φ (homogeneous to a mobility), which differs from model to\nmodel, and f is the classical Flory-Huggins free energy per site,6 given by:\nφ\n1−φ\nf\n=\nlog φ +\nlog (1 − φ) + χAB φ(1 − φ)\nkT\nNA\nNB\n\n(6)\n\nIn the rest of this article, we will only be concerned with the symmetric case, i.e., with\npolymer components of the same chain length (NA = NB ≡ N ) and the same monomeric\nmobility Λ0 . It should be pointed out that, in this case, the conceptual subtleties mentioned\n\nabove do not intervene, and interdiffusion models do agree on the same expression of the diffusion\ncoefficient. For long, entangled chains (N > Ne , the regime of interest to us), and using the same\nnotations as in eq. 4, one has simply Λ = Λ0 Ne /N . From eq 5, the mutual diffusion coefficient\nthen reads20–22\nDM = Λ0\n\n\u0014\n\u0015\nNe\n1\nkT * φ(1 − φ) *\n− 2χAB\nN\nφ(1 − φ)N\n\n(7)\n\nA useful limit in practice is |χAB |N ≫ 1: as long as φ and 1 − φ are larger than the (small)\nvalue φc = 1/(2|χAB |N ), DM can be approximated to\nDM = Df φ(1 − φ) with\n\nDf ≡ 2|χAB |N Ds\n\n(8)\n\n(where Ds is the entropic, self-diffusion coefficient defined in eq 4).\nEquation 8 shows that the diffusion coefficient in the enthalpy-driven mixing of polymers is\nstrongly concentration-dependent. In particular, the vanishing of DM for φ = 0 and φ = 1 leads\nto very unusual diffusion profiles when either of the polymer pieces brought in contact is initially\n7\n\n\fpure in one of the components:20 When only one side is pure, the mixing width on that side is\nfinite, with a sharp edge; if both the initial polymer pieces are pure, the width of the mixing\nregion is finite on both sides, and, moreover, the diffusion profile within it is a straight line.\n(Of course, as stated above, the simplified form 8 of DM does not hold when φ → 0 or\n\nφ → 1, and one has in fact to return to the full expression 7 for which DM does not exactly\n\nvanish. . . Thus, strictly speaking, the width of the mixing region is never exactly finite, and\nenthalpic diffusion profiles near φ = 0 and φ = 1 cross over to conventional, infinite \"diffusion\ntails\". But this crossover occurs for φ or 1 − φ of order φc = 1/(2|χAB |N ), and in the limit\n\nwhere |χAB |N ≫ 1, φc is so small that the diffusion tails contain a completely negligible mass\n\nof material.)\n\nWith this, we conclude our overview on the different aspects of the theory of two-component\ninterdiffusion, and come back to the problem of multi-component interfaces.\n\n3\n\nDescription of the three-component system and qualitative\napproach\nIn this section, we present the specific multi-component system that we chose to study, and\n\ngive some qualitative insight into the structure and dynamics that are expected to emerge. The\nnext section will deal with these issues in a more rigorous way.\nAs explained in the Introduction, the realm of multi-species system and their interfaces is a\nvery vast one: our aim here is to explore one \"model case\" among these possibilities, involving\nthree species, and where some interesting features do appear.\n\n3.1\n\nDescription of the system and initial configuration\n\nWe now present the system that we will be concerned with in the rest of this article. The\ninitial (t = 0) situation is depicted in Figure 1: the system consists of two pieces of molten\npolymer which have just been put into contact. The surface of contact (the initial interface)\nbetween the pieces is assumed to be planar, and is located at position x = 0 (the x-axis is drawn\nperpendicular to the surface of contact). It is assumed that the problem is invariant in the two\nremaining spatial directions (parallel to the interface).\nThe system contains three polymer components which are initially distributed as follows: on\nthe left-hand side, we have a blend of two polymers, A and A*; on the right-hand side, we have\na pure polymer, i.e., only one species which is called B. The important step (which is really\ndefining our system) is how to specify the nature of the pairwise affinities between these three\ncomponents. Our choice is the following: we assume that A and B are attracted to each other\n(through some specific interaction), and are thus miscible in all proportions; on the contrary,\nA* and B strongly repel each other and thus have a tendency to form fully segregated phases;\n8\n\n\fA+A\nA\nA\n\nB\n\n= 0\n=1\n\nB\n\n=1\n\n0\n\nx\n\n0\n\nFigure 1: Initial situation of the three-species system. The left-hand side is a blend of two polymers, A\nand A*, with initial volume fractions φA = φ0 and φA* = 1 − φ0 . The right-hand side contains only one\nspecies, called B, with initial volume fraction φB = 1.\n\nand, finally, A and A* are fairly indifferent to each other (i.e., neither attracted or repelled, or\nnot much). These features correspond to the following set of Flory parameters:\n\nFigure 1\n\nχAB < 0,\n\nwith\n\n|χAB |N ≫ 1\n\n(9)\n\nχA*B > 0,\n\nwith\n\nχA*B N ≫ 1\n\n(10)\n\nχAA* ≃ 0,\n\nwith\n\n|χAA* |N ≪ 1\n\n(11)\n\nAs we are mainly interested in the effect of the contrast in miscibility between the polymers,\nand not in chain length effects, it has been assumed above that all polymers have the same\npolymerization index:\nNA = NA* = NB = N.\n\n(12)\n\nA three-component system with such features as specified in eqs 9–11 would be quite difficult to realize experimentally, as the above requirements seem at first rather contradictory; they\nwould certainly be achieved only through a fine tuning of the chemistry of the different polymers involved. We discuss some practical possibilities in the concluding remarks of the article\n(Section 5).\nOur choice of system is mainly guided here by the fact that it is one case that leads to\nthe most interesting interfacial structure and dynamics. From the theoretical point of view,\nthis interfacial problem is also original in the sense that, as will be seen shortly, it leads to\nsimultaneous, coupled, entropy and enthalpy-driven diffusion processes.\n\n3.2\n\nQualitative approach to the multiple interface structure\n\nIn this section, we present qualitative arguments explaining why, from the initial situation\ndepicted in Figure 1, the interface between the two melts develops a \"multiple\" structure, i.e.\ndisplays several layers or regions of different nature.\n9\n\n\f:ONE )6\u001a\n! !] \"\n\n\u0082\u0011\n\n\u0082\u0012\n\n:ONE )\u001a\n! !]\n\n:ONE )))\u001a\n\"\n\n:ONE ))\u001a\n! \"\n\nZ X )\bT \u0010\n\nX ))\bT\n\nX\n\nFigure 2: Multiple structure of the interface, with several regions, for t > 0. The arrows indicate the\ndirection of motion of the regions' boundaries, x = −xI (t) and x = xII (t). The quantities φ1 and φ2\n\nindicate the values of the volume fraction in A at the left and right boundaries of region IV.\n\nQuickly after the onset of contact between the two melts, the interface takes on a configuration as depicted on Figure 2. As can be seen, the interface is divided in four main zones,\nlabelled I–IV, and the situation can indeed be intuitively understood as explained now. (We\ndo not consider here the transient evolution which takes place in the first instants after contact\nand leads into the configuration of Fig. 2. The interested reader is referred to Appendix A for\na more detailed discussion of this transient.)\nAfter the onset of contact, species A and B (which are attracted one to another) start to mix\ntogether, thus forming a growing mixing layer (region II) around the initial position (x = 0) of\nthe surface of contact between the melts.\nOn the other hand, A* is repelled by B, and thus, as region II broadens and the A+B\nmixture spreads, A* must recede towards the left. Thus region I, which we define as the domain\nof coexistence of A and A*, is progressively shrinking, with its right boundary moving towards\nthe left.\nAt the junction between region I (containing A and A*) and region II (containing A and\nB), there must be a region where all three species coexist (region IV). However, we expect this\nregion IV to be of very small extension as compared to the others, since we know from section 2.1\nthat strongly immiscible polymers put into contact, like here A* and B, tend to form a very\nsharp interface with a steep profile; hence, in the remaining of this article, we will neglect the\nthickness of region IV, and we will not consider any detailed concentration profile within it. It\nmust be emphasized however that region IV, albeit tiny, plays an important role in the dynamics\nof the system, since all A chains which want to migrate from region I to II must cross region IV\n\n10\n\n\f(this will be discussed again in the next section).\nFinally, there is a last region, III, where B is alone: this comes from the fact that, as explained\nin Sec. 2.3, when one of the polymer pieces in contact is initially pure (here, φB = 1 at t = 0 for\nthe piece on the right), enthalpy-driven interdiffusion generates profiles with mixing only over a\nfinite width; thus, there is on the right side of region II a (time-dependent) location where the\nvolume fraction of A reaches zero, and this is what defines the beginning of region III. As the\nmixing region II broadens, the boundary of region III shifts to the right.\nWe also introduce in Figure 2 some notations that we will be using intensively in the next\nsections: x = −xI (t) gives the position of region IV, and, in our limit where region IV is taken\n\ninfinitesimally thin, plus or minus exponents (x = −x±\nI ) will respectively refer to the right and\n\nleft boundaries of region IV; x = xII (t) gives the position of the boundary between regions II\n\nand III; and φ1 (t) and φ2 (t) respectively denote the volume fractions of A just on the left and\nright of −xI , i.e., φ1 = φA |x=−x− and φ2 = φA |x=−x+ .\nI\n\nI\n\nAfter having presented an intuitive description of the interfacial structure and dynamics in\n\nour system, we will devote the next section to the establishment and solution of the equations\ngoverning them.\n\n4\n\nGoverning equations and results\nIn this section, we first establish the various equations governing the system (Sec. 4.1), and\n\nthen solve them numerically (Sec. 4.2). The physical results of our computations are gathered\nand commented on in Sec. 4.3.\n\n4.1\n\nGoverning equations\n\nFrom now on, φA , the volume fraction of A, will be simply denoted by φ, i.e., we will use\nφ(x, t) ≡ φA (x, t).\n\nLet us start by enumerating our unknowns: these are the locations of the different regions'\n\nboundaries (x = −xI and x = xII ), the values of the volume fraction in A at x = −x±\nI (φ1 and\n\nφ2 ), and the time-dependent profile of φ(x, t) within regions I and II (by definition, φ = 0 within\nregion III). We will thus need a set of six independent equations to determine the solution of\nthe system.\nIt should be noted that, from the knowledge of φ, it is straightforward to retrieve the volume\nfractions of the other components of the system (using the total volume fraction condition\nφ + φA* + φB = 1): in region I, where only A and A* are present, one has φA* = 1 − φ and\n\nφB = 0; in region II, φB = 1 − φ and φA* = 0; finally, in region III, φB = 1 and φ = φA = 0.\n\nWe now establish the six independent equations which govern the dynamics of our system.\n\n11\n\n\fDiffusion equations\nOur first equations simply describe the diffusive motion of polymer A. We must use two\ndifferent equations, depending on the region considered within the multiple interface.\nIn region I, A chains diffuse inside an A+A* mixture, with χAA* ≃ 0 (eq 11); we are thus in\n\na case of entropy-driven diffusion which is accounted for by equation 3,\nφ̇ − Ds ∇2 φ = 0\n\n(region I)\n\n(13)\n\nand the initial and boundary conditions are as follows:\nφ(t = 0) = φ0 ;\n\nφ(x → −∞) = φ0 ,\n\nφ(x = −x−\nI ) = φ1\n\n(14)\n\nIn eq 13, the entropic diffusion coefficient Ds is a constant parameter (see eq 4).\nIn region II, A chains diffuse into an A+B mixture, with χAB < 0 and |χAB |N ≫ 1 (eq 9);\n\nwe are there in the presence of an enthalpy-driven diffusion, for which the diffusion coefficient\nbecomes concentration-dependent (see Sec. 2.3). Recalling eq 8, we have\nDf = 2|χAB |N Ds\n\n(Df ≫ Ds )\n\n(15)\n\nand the diffusion equation in region II can be written as\n\u0001\nφ̇ − Df ∇. φ(1 − φ)∇φ = 0\n\n(region II)\n\n(16)\n\nφ(x → +∞) = 0\n\n(17)\n\nwith the initial and boundary conditions\nφ(t = 0) = 0;\n\nφ(x = −x+\nI ) = φ2 ,\n\n(see note33 ).\nExpansion of the A-B mixing region on the right\nApart from the two diffusion equations 13 and 16, a third equation can be written, which\ngoverns the expansion rate of the mixing region II (A-B mixture) on the right, that is to say, the\nmotion of the boundary xII (t). By definition, x = xII (t) denotes, for any time t, the moving point\nwhere the concentration profile φ reaches zero (and beyond which only polymer B is present).\nAs shown in the Appendix B to this article, this very definition implies that the velocity ẋII of\nthis point has a simple relation to the gradient of φ on its left as follows:\nẋII = −Df ∇φ|x=x−\nII\n\n12\n\n(18)\n\n\fConservation of the A and B species\nWe must naturally also take into account equations that ensure the conservation of the\ndifferent polymer components in the system.\nIt is shown in Appendix B that the conservation equation for species A leads to the following\nrelation between the velocity ẋI of the interface of regions I and II, and the volume fraction φ1\nof A and the gradient ∇φ|x=−x− on the left side of it:\nI\n\nẋI = −\n\n1\n* Ds ∇φ|x=−x−\nI\n1 − φ1\n\n(19)\n\nThe conservation of the B species, on the other hand, gives a relation between the same\nvelocity ẋI , and the volume fraction and gradient on the right side of this interface:\nẋI = −φ2 * Df ∇φ|x=−x+\nI\n\n(20)\n\nNote that the conservation of the third species, A*, follows automatically from the conservation of the two others, through the relation between volume fractions φ + φA* + φB = 1, and\nthus does not bring us a new equation.\nThe role of region IV\nAt this point, we have written down five independent relations; as there are six unknowns,\nthere must be a last physical constraint determining the dynamics of the system. We have so far\ntotally ignored region IV (as defined on Figure 2), where the three species A, A* and B coexist.\nAs stated earlier, this is because this region is expected to be of very limited extension, and,\nas such, has rightfully been discarded, e.g., from the A and B conservation equations discussed\nabove. However, despite being negligible in mass, region IV must clearly play an essential role\nregarding the dynamics, since all the A material that diffuses from region I to region II has to\ntransit through it.\nDescribing precisely the interdependent diffusive process at work within the three-body region IV-solving the \"inner problem\", in the terms of boundary-layer theory-would undoubtedly represent a complex task and require a study of its own. We rather propose to bypass\nthis difficulty, as we in fact only need very limited information for our purpose: we are only\ninterested in the effect of region IV on the outer dynamics, not in internal details.\nWe make the simple assumption that region IV opposes no particular resistance to the flow\nof polymer A passing through it: region IV is \"permeable\" to A as other regions in the system\nare, or in other words, the mobility of species A in region IV is not significantly different from\nthe mobility in region I or II. This assumption on mobility appears natural if one considers that\nalthough region IV differs from other regions by significant changes in composition (it is the only\nregion where all three species overlap), it does not drastically differ in microscopic structure;\n13\n\n\fhence, the reptational dynamics, which control mobility, should not change significatively within\nregion IV as compared to other regions. (The situation would completely be different if region IV\nwas, for instance, made of a densely crosslinked network which would hinder the passage of\npolymer chains; one would then rather work under the opposite, \"high resistivity\" assumption).\nFrom this permeability assumption, we can deduce a relation on the chemical potential of\nspecies A on each side of region IV: a chemical potential gradient must be present to drive the\ndiffusion of A through region IV, but because this region is both of \"low resistivity\" and because\nit is very thin (as argued earlier in the text), the overall drop of chemical potential over region IV\nwill be minute as compared to the potential drop over other (larger) regions, and can therefore\nbe completely neglected.\nDenoting μA (−x−\nI ) the chemical potential of species A just on the left of region IV, and\n34 we thus have\nμA (−x+\nI ) the potential on the right,\n+\nμA (−x−\nI ) = μA (−xI )\n\n(21)\n\nAs shown in Appendix B, once the expressions of the chemical potentials are written out,\nthis equality between potentials provides our last governing equation in the form of a relation\nbetween the volume fractions φ1 and φ2 at the borders of region IV:\n\u0002\n\u0003\nφ1 = φ2 exp −|χAB |N (1 − φ2 )2\n\n(22)\n\nWe are now in possession of six independent equations which govern the dynamics in our\nsystem, and can proceed to solve them.\n\n4.2\n\nTechnical solution\n\nWe now present the procedure followed to solve the set of governing equations derived in\nthe previous section (eqs 13, 16, 18, 20, 19, 22). We will here focus on the technical aspects of\nthe solution, while, for the sake of readability, we have grouped together the presentation of the\nresults and their physical content in the next section (Sec.4.3).\nThe major difficulty attached to the interdiffusion problem as defined by this set of equations\nis that it involves two moving boundaries, x = −xI (t) and x = xII (t): the solution of the diffusion\n\nequations in the system requires the application of boundary conditions defined at the moving\nboundaries, but the motion of the boundaries themselves are directly determined by the diffusive\nsolutions. This self-consistent nature of moving boundary problems make them generally much\nless straightforward to solve than a conventional diffusion problem; we will here follow the\nsolution scheme described in Crank.9\nOur problem falls into the so-called \"Class A\" category,9 characterized by the fact that\nthe motion of the moving boundaries is uniquely due to the transfer of diffusing substances\nacross them. (This is indeed the meaning of the conservation equations 38 and 40 discussed in\n14\n\n\fAppendix B). It is then possible to show that, in a generic fashion, the solution will have the\nfollowing properties:9\n(i) The concentration of the diffusing species at the moving boundaries is constant, i.e., φ1\nand φ2 are independent of time.\n(ii) The motion of the moving boundaries is diffusive, i.e. xI (t) ∼ (Ds t)1/2 and xII (t) ∼\n\n(Df t)1/2 .\n\nWe build the solution to our problem with the help of these useful results. In accordance\nwith property (ii) above, we introduce the new quantities a and b defined by:\nxI (t) = 2a (Ds t)1/2\n\n(23)\n\nxII (t) = 2b (Df t)1/2\n\n(24)\n\nThe numerical value of a and b will have to be determined as a result of our solution. We also\ndefine\nǫ=\n\nDs\n1\n=\nDf\n2|χAB |N\n\n≪1\n\n(25)\n\nwhich is a small parameter (see eqs 8 and 9).\n\nIn the limit where ǫ ≪ 1, equation 22 simplifies considerably:\n\u0010 (1 − φ )2 \u0011\n2\n−→ 0\nφ1 = φ2 exp −\nǫ≪1\n2ǫ\n\n(26)\n\nThus, as long as (1 − φ2 ) ≫ ǫ1/2 (i.e., as long as φ2 is not too close to unity), we can as well\nconsider that φ1 = 0 for the rest of our solution to a very good approximation.\n\nWe can then immediately solve the diffusion equation 13, valid in region I, along with the\nboundary conditions 14. The solution can as usual be looked for as a function φ(x, t) = f (u) of\n√\nthe reduced variable u = x/2 Ds t, and from eqs 23 and 26, we see that the boundary condition\non the moving boundary simply becomes φ(−x−\nI , t) = f (−a) = 0. Solving the equation on f ,\nwe finally find the following concentration profile in region I, which involves the error function\n√ Ru\n2\nerf u = (2/ π) 0 e−u du, classical for semi-infinite media:\n\u0014\n\u0012\n\u0013\u0015\nφ0\nx\n√\nφ(x, t) = φ0 −\n1 + erf\n(region I)\n(27)\n1 − erf a\n2 Ds t\nWe next turn to the determination of a, and thus to the determination of the position of the\nmoving boundary at x = −xI . Equation 19 will serve this purpose: with φ1 = 0, it simplifies to\n\nẋI = −Ds ∇φ|x=−x− . Then, with the help of eq 23, which yields ẋI = a(Ds /t)1/2 , and of eq 27\nI\n\nwhich yields an expression of ∇φ|x=−x− , eq 19 finally brings the relation\nI\n\n√\n\n2\n\nπ a ea (1 − erf a) = φ0\n\n(28)\n\nThis equation on a can be solved numerically to give the value of a as a function of the fundamental parameter φ0 (which describes the initial state of the system). The result of the numerical\nsolution is shown in Figure 7.\n15\n\n\fThe next step is to solve the diffusion equation 16 under the conditions 17, in order to find\nthe concentration profile in region II. As equation 16 is a nonlinear equation without analytical\nsolution (to the best of our knowledge), we will resort to numerical integration. We here again\n√\nlook for a solution φ(x, t) = g(v) of the (new) reduced variable v = x/2 Df t. The resulting\ndifferential equation on g turns out as:\nd\u0010\ndg \u0011\ndg\ng(1 − g)\n= −2v\ndv\ndv\ndv\n\n(29)\n\nand the boundary conditions of eq 17 translate to\n(i)\n\nφ|x=−x+ = g|v=−a√ǫ = φ2 ,\n\n(ii)\n\nI\n\nφ|x→+∞ = g|v→+∞ = 0\n\n(30)\n\nIt has to be noted that these boundary conditions, as such, are not sufficient to directly proceed\nto numerical integration, because the quantity φ2 appearing there is also an unknown. We thus\nneed a supplementary condition, which will be provided by the conservation equation of the B\nspecies (eq 20): using the definition of a (eq 23) and the definition of the reduced variable v,\neq 20 can be rewritten as\ndg\ndv\n\n√\nv=−a ǫ\n\n√\n2a ǫ\n=−\nφ2\n\n(31)\n\nWe have now enough equations to compute g(v) and the associated concentration profile\nin region II. We solve the set of equations 29–31 by a trial-and-error procedure: we choose\nan arbitrary value for the unknown φ2 ; based on the corresponding initial conditions provided\nby eqs 30-(i) and 31, a numerical integration of eq 29 is performed; the obtained solution g is\nthen evaluated at infinity, and its value compared to zero (eq 30-(ii)); if different, the whole\nnumerical procedure is resumed with a new chosen value for φ2 , until the correct value of φ2 ,\nsatisfying eq 30-(ii), is found. At the end of this process, we eventually obtain the actual profile\nof concentration φ(x, t) = g(v) in region II, along with the value of φ2 in our system. (See\nfurther down for results.)\nWe are at this point in possession of the profiles φ(x, t) in regions I, II and III, as well as\nof the numerical values of a, φ1 , and φ2 . To complete our solution, we still need to find the\nvalue of b, which is related to the position of the border between region II and III. This is easily\nperformed numerically: by transposing the equation of motion for xII established earlier (eq 18)\nin terms of the self-similar function g(v), and applying the definition of b (eq 24), one obtains\nthe relation\n−2b =\n\ndg\ndv\n\nv=b\n\n(32)\n\ni.e., b is a quantity such that the slope of g at v = b is equal to twice the value of b (with\nchanged sign). The search for such a b can be carried on numerically with the function g\ncalculated previously: the graph of b as a function of φ0 can be found on Figure 7.\n\n16\n\n\f(u)\n1\n0\n\nI\n\nII\n\nIII\n\n2\n\na\n\n0\n\nb/ 1/2\n\nu\n\nFigure 3: Sketch of the generic self-similar diffusion profile for species A: the volume fraction φ has been\n√\ndrawn versus the reduced variable u = x/2 Ds t. The volume fractions used in the text, φ0 and φ2 ,\n\nFigure 3\n\nare also represented. In domain I (i.e. for u < −a), the concentration profile is an error function; in\ndomain II (i.e. for −a < u < b/ǫ1/2 ), the profile is quasi-linear. In region III, A is absent.\n\n4.3\n\nPresentation of the results\n\nWe now present and comment on the results of the model, as obtained through the procedure\ndescribed in the previous section.\nAs seen in eqs 23 and 24, the different \"compartments\" or layers composing the multiple interface are separated by diffusive fronts: x = −xI (t) = −2a(Ds t)1/2 and x = xII (t) = 2b(Df t)1/2 ,\n\nwith a and b are numerical parameters (see below for their values). The evolution in time of the\nconcentration profiles of the different components is thus self-similar, and for this reason, it is\nuseful to present them here in terms of the reduced variable u = x/2(Ds t)1/2 .\nWe remind our reader that there are two main physical parameters to our solution: φ0 ,\nwhich represents the content in A of the initial A+A* blend, and the small parameter ǫ =\n1/(2|χAB |N ) ≪ 1, which is related to the strength of the attraction between A and B chains\nand the polymer chain length.\n\nAs these parameters were varied over a wide range of values (φ0 between 0.1 and 0.9, ǫ\nbetween 10−5 and 0.1), it was observed that, remarkably enough, the (self-similar) diffusion\nprofiles obtained retain the same aspect throughout; the main effect of varying the parameters\nis simply to rescale one or the other of the characteristic dimensions of the self-similar solution\n(i.e., stretch or shrink it in some region).\nThis generic self-similar diffusion profile for the A species is sketched in Figure 3 in terms\nof the reduced variable u. The fronts x = −xI (t) and x = xII (t) are respectively located at\n√\nu = −a and u = b/ ǫ. Starting from the left in the Figure, the profile in region I is given by an\n\n\"error function\", typical of diffusion problems, and drops to zero at the approach of region II\n\n17\n\n\f(u)\n1\n0.8\n0.6\n\n0\n\n= 0.3\n\n0\n\n= 0.7\n\n0.4\n0.2\n\nu\n\n0\n-4\n\n-2\n\n0\n\n2\n\n4\n\n√\nFigure 4: Numerical profiles for the volume fraction φ(u) of the A species (with u = x/2 Ds t). The\n\nFigure 4\n\nchain length and Flory parameter are N = 103 and χAB = 0.1, yielding ǫ = 5 * 10−3 . The solution φ(u)\n\nhas been represented for two values of the initial volume fraction of the A species in the A-A* blend:\nφ0 = 0.3 and φ0 = 0.7.\n\n(since we proved that φ1 ≃ 0 in most practical cases). At the boundary between regions I and II\n\n(we neglect the thickness of the intermediate region IV), there is a discontinuous concentration\n\njump from φ = 0 to φ = φ2 , and then the diffusion profile decreases smoothly until reaching\nzero again at the border with region III. It should be emphasized as a very interesting feature\nof the solution that the amplitude φ2 of this concentration jump remains constant in time and\ndoes not die away during the diffusion process.\nAnother interesting feature is the depletion near u = −a of species A (φ → 0). The depletion\n\nis a direct reflection of the fact that it is energetically much more favorable for A to be in the\nA+B blend of region II (χAB < 0) than in the A+A* blend of region I (χAA* ≃ 0); therefore,\n\nas time passes, region II continuously sucks A-chains out of region I, creating in the latter a\n√\ndepleted zone which grows with time (as Ds t).\nWe also note that, from an empirical point of view, the profile in region II does not have a\nvery significant curvature; if needed, we may thus approximately regard it as a straight line.\nAs an illustration of the generic sketch of the diffusion profile described above, we have\nplotted in Figure 4 two actual profiles, computed numerically for different values of φ0 (and\nsame ǫ), which do show that, within some rescaling, the generic shape of Figure 3 is retained in\nboth cases.\nFor completeness, we also give the corresponding generic self-similar profiles for the other\nmixture components in Figures 5 and 6. As reminded in Figure 3, the diffusion profile involves\nseveral characteristic quantities a, b, and φ2 , whose values we now consider in detail.\n18\n\n\fA\n\n(u)\n1\n\nI\n\nII\n\n1\n\n0\n\nu\n\nb/ 1/2\n\n0\n\na\n\nIII\n\nFigure 5: Sketch of the generic self-similar diffusion profile for the A* species: the volume fraction φA*\n√\nhas been drawn versus the reduced variable u = x/2 Ds t. In region I, φA* = 1 − φ and is thus given by\n\na complementary error function. In the other regions, A* is absent.\n\nFigure\n\nB(u)\n\n1\n\n1\nI\n\n2\n\nII\n\na\n\n0\n\nIII\n\nb/ 1/2\n\nu\n\nFigure 6: Sketch of the generic self-similar diffusion profile for the B species: the volume fraction φB has\n√\nbeen drawn versus the reduced variable u = x/2 Ds t. In region I, B is absent; in region II, the profile\nof B is the complement of A (φB + φ = 1) and is quasi-linear; in region III, B is alone.\n\nFigure\n19\n\n\f2\n\n1.5\n\nB\n\nA\n\n1\n\n0.5\n\n\u0082\u0010\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nFigure 7: Values of the numerical factors a and b, which characterize the two moving boundaries xI (t) =\n−2a (Ds t)1/2 and xII (t) = 2b (Df t)1/2 , plotted versus the initial volume fraction φ0 . (φ0 is ranging from\n0.1 to 0.9 and ǫ is fixed at 5 * 10−3 .)\n\nIn Figures 7 and 8, we plot the variations of these quantities as functions of our parameter\nφ0 , i.e., a(φ0 ), b(φ0 ), and φ2 (φ0 ), at fixed ǫ (i.e., we work at given system chemistry, and change\nthe initial composition of the system). It is observed that these quantities show a steady increase\nwith φ0 . Results are presented for the range 0.1 . φ0 . 0.9, which should cover most practical\ncases; see note35 about situations where φ0 → 0 or φ0 → 1.\n\nIt is also possible to give rough analytical estimates of the dependence of a, b, and φ2 with\n\nrespect to our other main parameter, ǫ. The quantity a is given by the solution of eq. 28, which\ninvolves only φ0 ; thus we see that a has no functional dependence on ǫ (at least in the regime\nǫ ≪ 1 considered in this article). Let us now estimate the dependencies of φ2 and b on ǫ: for\nthat purpose, we will consider, in first approximation, that the concentration profile is linear in\n\nregion II (see above). Writing as previously the solution φ(x, t) = g(v) in terms of the reduced\nvariable v = x/2(Df t)1/2 , the (\"constant\") value of the slope dg/dv is easily estimated: since\n√\ng(v) goes from φ2 at the left boundary of region II (v = −a ǫ) to zero at the right boundary\n√\n(v = b), we have dg/dv ≃ −φ2 /(b + a ǫ) ≃ −φ2 /b. We then use this expression of the slope into\neq 30-(i) and eq 31, and solve this set of two equations for b and φ2 . This brings the following\nestimates:\n\n\u00131/6\na2\n,\nφ2 ≃ (2a2 ǫ)1/3\nb≃\nǫ\n4\nIn terms of scaling laws with respect to ǫ, we thus have\n\u0012\n\nb ∼ ǫ1/6 ,\n\nφ2 ∼ ǫ1/3 ,\n\na ∼ ǫ0\n\n(33)\n\n(34)\n\n(where the last equation is meant to recall that a has no dependence on ǫ).\nFinally, we conclude the presentation of our results, by emphasizing one unusual and notable\nfeature of our solution: as time goes on, region II, where A and B mix, grows in a very asymmetric\n20\n\n\f\u0082\u0012\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n\u0082\u0010\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nFigure 8: Plot of the quantity φ2 , which corresponds to the amplitude of the concentration jump at the\nborder between region I and II, versus the parameter φ0 . (φ0 is ranging from 0.1 to 0.9 and ǫ is fixed at\n5 * 10−3 .)\n\nfashion, relatively to the position of the initial interface (x = 0 at t = 0); this is due to the fact\nthat its two boundaries are of very different nature, with the right boundary x = xII having a\nmuch faster diffusive motion than the left boundary x = −xI (because Df ≫ Ds ). The ratio of\nthese two boundaries' position is in fact independent of time and can be estimated as\nxI (t)\na\n=\nxII (t)\nb\n\n\u0012\n\nDs\nDf\n\n\u00131/2\n\n∼ ǫ−1/6 ǫ1/2 ∼ ǫ1/3\n\n(35)\n\nThe sluggishness of the motion of xI relatively to xII thus becomes more pronounced as ǫ becomes\nsmaller, i.e., if the attraction between A and B is made stronger or if the polymer chains length\nis increased (see eq 25).\nWe have now completed the solution of the dynamics of our three-species system, and have\npresented the results that were obtained.\n\n5\n\nConcluding remarks\nIn this article, we studied the evolution of the interface between two polymer melts, in a\n\nspecific case where three species of strongly contrasting chemical affinities were involved. It was\nfound that, due to the simultaneous presence of entropy and enthalpy-driven diffusion processes,\nthe dynamics at the interface is unusual (with a very asymmetric growth of the mixing layer),\nand that moreover, the interface shows a peculiar spatial structuration in three distinct layers\nof different chemical compositions.\nLet us now close with some remarks. Obtaining a triad of polymers with chemical properties\nsuch as specified in eqs 9-11 is certainly a difficult task. One potential way could be the following:\n21\n\n\f(i) having A and B strongly attracted to each other through the existence of hydrogen bonds,\n(ii) having A* a very slightly modified variant of A, where hydrogen bonding to B becomes\nunavailable; then between A and B, van der Waals attractions will dominate, leading to repulsion,\nwhile hopefully A and A* will remain similar enough and roughly indifferent to each other.\nAnother, powerful way of achieving such a system may also be through the use of copolymers.\nThe specific case which has been described and studied in this article is, as has been argued\nin the Introduction, only one limiting situation in a vast range of multiple species interfaces\nin polymer systems, and has been selected for the strong opposing tendencies in the chemical\naffinities of the involved polymers. Our hope is however to demonstrate on this example the\nrichness of multiple-species interfaces, where many other such \"selected cases\" would be worth\ninvestigating and studying for their peculiar structure and dynamics.\nA related, though different, problem to that of two multi-component melts facing each other,\nis the situation of a melt facing a loosely crosslinked gel (this perspective was suggested to us\nby one of the referees). In the example studied in this article, an A+A* blend would be brought\ninto contact with a gel of B. The subsequent evolution might develop interesting features: the\nmotion of the xII (t) front (as defined on Fig. 2) would describe the imbibition of the B gel by\nthe A species, while the displacement of the xI (t) border would be dictated by the swelling\nof the gel-this would imply the inclusion of new elastic terms in the model's equations. We\nnote however that, in practice, the dynamics of polymer diffusion into a network can prove very\nsubtle, with a predominant role of preexisting heterogeneities (e.g., in crosslink density) within\nthe network.36\nFrom the application point of view, the ability to spontaneously form (at least in some cases) a\nmulti-layered interface between two polymer pieces, might lead to interesting perspectives in the\ndesign of multilayer polymer films37 - which are widely used for product packaging, for instance.\nWhereas conventional technology includes processes like coating, lamination, or coextrusion to\nform multilayered films, here the layering appears by means of a purely diffusional process. The\nchemical composition and the spatial organization of the layering could be controlled through\nan appropriate choice of chemical affinities between the different species in interaction, and once\nthe desired result is attained (e.g., prescribed layer thicknesses), the system could be quenched\nto freeze the diffusion process.\n\nAcknowledgements\nWe are very grateful to F. Brochard-Wyart, F. Chevy, C. Creton and M. Winnik for useful\ndiscussions. We also wish to thank our anonymous reviewers for several deep comments which\nled to improvements in the article.\n\n22\n\n\fAppendix A. Transient behavior at the onset of contact\nIn this Appendix, we discuss the transient behavior taking place in the first instants after\nthe contact between the initial melts is established, and how it leads to the layered configuration\ndepicted on Figure 2 of the main text.\nLet us consider the situation immediately after the onset of contact (see Fig. 1), from the\npoint of view of species B: due to thermal agitation, a few B molecules start to extend chain\nportions into the A+A* blend, of respective volume fractions φA and φA* . These first B chain\nportions will then experience an A+A* environment with an average, \"effective\" Flory parameter\nχB ≃ φA χAB + φA* χA*B\n\n(36)\n\n(in a mean-field picture). Given the opposite signs of χAB and χA*B , this effective χB may be\npositive or negative depending on the composition of the A+A* blend. Defining\nφc = |χA*B |/(χAB + |χA*B |)\n\n(37)\n\nwe have two cases depending on the initial (t = 0) content φA = φ0 in A of the A+A* blend:\neither φ0 < φc or φ0 > φc . We discuss below the two scenarios that ensue for the transient\nevolution of the system at short times.\nIf the initial situation is such that φ0 < φc , we see from eq 36 that χB > 0, which means\nthat the environment seen by the B chains exploring the initial A+A* blend is enthalpically\nunfavorable. Therefore the triple region A+A*+B created by this diffusion remains of very\nsmall extension and corresponds to our region IV in Fig. 2. On the other hand, the diffusion of\nspecies A into the B melt is very favorable (χAB < 0), and thus A molecules do at the same time\nmigrate from the initial A+A* blend through the triple region IV, and create a mixing layer\nA+B as seen in Fig. 2. At that point in time, the layered structure of the interface is established\nand the subsequent dynamics of the system crosses over to that described in the main text (see\nSec. 3.2).\nAlternatively, if the initial situation of the system is such that φ0 > φc , eq 36 tells us that\nχB < 0 and in that case, the environment seen by the B molecules initially in contact with the\nA+A* blend is favorable. Therefore, it is expected that after the onset of contact, B molecules\nwill start diffusing into the A+A* blend and thus a growing region where the three species A,\nA* and B overlap will form. This may at first seem at odds with the layered configuration\nof Fig. 2 and especially with the assumption of a thin triple region invoked in the main text.\nHowever, if one considers the point of view of species A and A*, simple energetic arguments\nmake it clear that the initial growth of the triple region will be short-lived: firstly, the triple\nregion makes an unfavorable environment for A* (the local effective Flory parameter for A*, as\nan average of χAA* ≃ 0 and χA*B > 0, is always positive) and thus A* will demix and migrate\n23\n\n\fback to the A+A* melt on the left; secondly, rather than staying within the triple region where\npart of their contacts are made with A* molecules (with no enthalpy gain), A chains will seek\nto augment favorable χAB < 0 contacts and will thus preferably migrate into the pure B region\non the right of the triple region-thereby creating the A+B region described in the main text as\nregion II. As both these processes occur at the expense of the triple region, the size of the latter\ncan only remain modest. Qualitatively at least, it thus becomes apparent, that here again, the\nsystem rapidly evolves to the configuration of Fig. 2. A more precise description of the transient\ndynamics just sketched would nevertheless be desirable and remains ahead of us.\n(Note: in the limit where the initial A+A* blend is in fact almost purely composed of A,\ni.e., φ0 very close to unity, we expect some of the above arguments to break down; the system\nwill not form layers at the interface, but should simply evolve as in the known situation of a\npure melt of A in contact with a pure melt of B.20 )\n\nAppendix B. Derivation of governing equations\nIn this Appendix, we give a detailed derivation of some of the governing equations presented\nin section 4.1.\nEquation of motion for xII (t)\nEquation 18 is obtained as follows. By definition, xII (t) is the point such that, at any time\nt, φ(xII (t), t) = 0. Since φ is a constant over time at that point, we also have that the total time\nderivative at that (moving) point, dφ/dt|x=xII , must be zero:\ndφ\ndt\n\n= φ̇|x=xII + ẋII .∇φ|x=xII = 0\nx=xII\n\nFurthermore, using the diffusion equation 16 and φ|x=xII = 0, another expression for φ̇ is easily\nobtained:\nφ̇|x=xII = Df (∇φ|x=xII )2\nSubstitution of the latter equation into the former yields equation 18.\nConservation of the B species\nWe now show how relation 20 results from the conservation of the B species.\nAs a little reflection from the consideration of Figures 1 and 2 can make clear, the conservation of the B species reads as follows:\nZ\n\nxII (t)\n−xI (t)\n\nφB dx = xII (t) * 1\n\n24\n\n(38)\n\n\fThis expression simply states that, when considering the situation at a certain time t > 0, all\nthe initial B material which was comprised between x = 0 and the present position x = xII (t) (a\nquantity equal to xII * 1 since the initial volume fraction of B was one) has been redistributed by\nRx\nvirtue of the interdiffusion process all over region II (hence the term −xIII φB dx on the left-hand\n\nside). Using φB = 1 − φ, one then obtains\nZ xII (t)\n\nφ dx = xI (t)\n\n(39)\n\n−xI (t)\n\nDifferentiating eq 39 once with respect to time, using eq 16 and φ(xII ) ≡ 0, one obtains a local\n\nversion of this integral equation: ẋI = −φ2 * Df ∇φ|x=−x+ , which is exactly equation 20.\nI\n\nConservation of the A species\nWe now derive equation 19 from the conservation of species A. The conservation equation\nfor A has the form\nZ\n\nxII (t)\n\nφ dx = φ0 xI (t) +\n\n−xI (t)\n\nZ\n\n−xII (t)\n\n−∞\n\n(φ0 − φ) dx\n\n(40)\n\nThis expression has the following meaning: at time t, the A material enclosed in region II\nR x=x\n( x=−xIII φ dx) comes from the material which was initially present between x = −xI and x = 0\nR −x\nat volume fraction φ0 , plus the amount that has diffused from region I ( −∞II (φ0 − φ) dx). Using\neq 39 into eq 40, then differentiating with time and substituting with the diffusion eq 13, one\n\nfinally obtains the following local version for the conservation of the A species: ẋI = −(1 −\n\nφ1 )−1 * Ds ∇φ|x=−x− , which is precisely equation 19.\nI\n\nRelation between φ1 and φ2\nWe now explain how one obtains equation 22 from 21.\nUsing classical formulae1, 5, 38 to compute the chemical potential of A, one obtains the expression\n\u0002\n\u0003\nμA = kT log φ + χN (1 − φ)2\n\n(41)\n\nThis expression for μA holds for blends made of two polymer species, characterized by a Flory\nparameter χ (and under the assumption that these species have the same chain length N ). Thus,\neq 41 should not be used to compute μA within region IV, where three component coexist; but\nit can indeed be used at the border with region I on the left, and at the border with region II\non the right-there one of the components drops to zero concentration, thereby leaving us with\ntwo species only (see also note34 ).\nOn the left border of region IV (x = −x−\nI ), we only have the two species A and A* (since\n\nφB → 0), and accordingly, we can apply formula 41 with χ = χAA* ≃ 0, which yields\nμA (−x−\nI )\n= log φ1\nkT\n25\n\n\fSimilarly, on the right border (x = −x+\nI ), only A and B coexist, and we find\nμA (−x+\nI )\n= log φ2 + χAB N (1 − φ2 )2\nkT\nWriting the equality between the above two expressions of the chemical potential (as required\nby eq 21) yields the governing equation 22.\n\nReferences\n[1] Jones, R. A. L; Richards, R. W. Polymers at Surfaces and Interfaces; Cambridge University\nPress: Cambridge, 1999.\n[2] Wool, R. P. Polymer Interfaces: Structure and Strength; Hanser Publications: Cincinnati,\n1995.\n[3] Physics of Polymer Surfaces and Interfaces; Sanchez, I. C., Fitzpatrick, L. E., Eds.;\nButterworth-Heinemann: London, 1992.\n[4] Polymer Surfaces and Interfaces III; Richards, R. W., Peace, S. K., Eds.; Wiley and Sons:\nNew York, 1999.\n[5] de Gennes, P.-G. Scaling Concepts in Polymer Physics; Cornell University Press: Ithaca,\n1979.\n[6] The free energy of mixing of an A/B polymer melt is rather well described by the simple\nFlory-Huggins approach, which is a tractable, two-species polymeric version of a lattice\ngas model. The two first terms in the right-hand side of the expression 6 give the entropic\ncontribution of f , which is assumed to take a simple ideal gas form. The last term stands for\nthe enthalpy of mixing, estimated within a mean-field picture. See: (a) Flory, P., Principles\nof Polymer Chemistry; Cornell University Press: Ithaca, 1971. (b) Doi, M. Introduction to\nPolymer Physics; Oxford University Press: Oxford, 1996. (c) Huggins, M. J. Am. Chem.\nSoc. 1942, 64, 1712.\n[7] Bates, F. S.; Wignall, G. D. Phys. Rev. Lett. 1986, 57, 1429.\n[8] (a) Helfand, E. Polymer Compatibility and Incompatibility; K. Solc. Chur: Harwood, 1982.\n(b) Helfand, E.; Tagami, Y. J. Polym. Sci. 1971, B9, 741. (c) Helfand, E.; Tagami, Y.\nJ. Chem. Phys. 1971, 56, 3592. (d) Helfand, E.; Tagami, Y. J. Chem. Phys. 1972, 57,\n1812.\n[9] Crank, J. The Mathematics of Diffusion; Clarendon Press: Oxford, 1975.\n[10] de Gennes, P.-G. C. R. Acad. Sci. Paris Sér. II 1980, 291, 219.\n26\n\n\f[11] Prager, S.; Tirell, M. J. Chem. Phys. 1981, 75, 5194.\n[12] Kim, Y. H.; Wool, R. P. Macromolecules 1983, 16, 1115.\n[13] Adolf, D.; Tirell, M.; Prager, S. J. Polym. Sci.: Polym. Phys. Ed. 1985, 23, 413.\n[14] Zhang, H.; Wool, R. P. Macromolecules 1989, 22, 3018.\n[15] Brochard, F.; de Gennes, P.-G. Europhys. Lett. 1986, 1, 221.\n[16] Brochard-Wyart, F.; de Gennes, P.-G. Makromol. Chem. Macromol. Symp. 1990, 40, 167.\n[17] Shibayama, M.; Yang, H.; Stein, R. S.; Han, C. C. Macromolecules 1985, 18, 2179.\n[18] (a) Onsager, L. Ann. NY Acad. Sci. 1933, 34, 241. (b) Onsager, L. Phys. Rev. 1931, 37,\n405.\n[19] de Gennes, P.-G. J. Chem. Phys. 1980, 72, 4756.\n[20] Brochard, F.; Jouffroy, J.; Levinson, P. Macromolecules 1983, 16, 1638.\n[21] Brochard, F.; Jouffroy, J.; Levinson, P. J. Phys. Lett. 1983, 44, 455.\n[22] Kramer, E. J.; Green, P.; Palstrøm, C. J. Polymer 1984, 25, 473.\n[23] Sillescu, H. Makromol. Chem. Rapid Comm. 1987, 8, 393.\n[24] Jabbari, E.; Peppas, N. A. Polymer 1995, 36, 575.\n[25] (a) Akcasu, A. Z. Macromol. Theory Simul. 1997, 6, 679. (b) Akcasu, A. Z.; Nägele, G.;\nKlein, R. Macromolecules 1995, 28, 6680.\n[26] (a) Klein, J. Nature 1978, 271, 143. (b) Klein, J.; Briscoe, B. J. Proc. Roy. Soc. London A\n1979, 365, 53.\n[27] Gilmore, P. T.; Falabella, R.; Lawrence, R. L. Macromolecules 1980, 13, 880.\n[28] Jordan, E. A.; Ball, R. C.; Donald, A. M.; Fettes, L. J.; Jones, R. A. L.; Klein, J. Macromolecules 1988, 21, 235.\n[29] Seggern, J. V.; Klotz, S.; Cantow, H. J. Macromolecules 1989, 22, 3828.\n[30] Meier, G.; Fytas, G.; Momper, B.; Fleicher, G. Macromolecules 1993, 26, 5310.\n[31] (a) Brochard-Wyart, F. C. R. Acad. Sci. Paris Sér. II 1987, 305, 657. (b) Brochard-Wyart,\nF. Stud. Polym. Sci. 1988, 2, 249.\n\n27\n\n\f[32] In the regime of entangled polymer chains, Brochard's amended approach gives exactly the\nsame expressions for the diffusion coefficients as in the model of Kramer's et al. It should\nbe noted, however, that a discrepancy remains in the case of short, non-entangled chains.\n[33] Note that the last boundary condition in eq 17 resides within region III, not II; this is\nadmissible, because the diffusion equation 16 is indeed valid in region III as well as in\nregion II. The boundary conditions stated here in fact automatically generate a solution\nwhich vanishes to zero at some finite position x = xII (t) and afterwards keeps that value\nfor all x > xII : they thereby naturally give birth to our region III (defined earlier as the\nregion where φ = 0) without the need of further constraints to be imposed, and are the\ncorrect ones to use.\n[34] If conditions are such that region IV is so thin as to be comparable to the radius of gyration\nof the chains, chemical potentials cannot be defined within this region (because non-local,\nsquare-gradient terms enter into the system's free energy). In that case, the chemical potentials appearing in equality 21, which are calculated \"at the left and right boundaries\" of\nregion IV, should naturally be understood as evaluated slightly away from those boundaries\n(typically a few radii of gyration), where their definition makes sense again.\n[35] Results in the main text are presented for initial fractions φ0 of the A species comprised\nbetween 0.1 and 0.9 which cover most of the interesting situations. Outside this range, some\nof the assumptions used in the solution of the model do break down; however, the physical\nsituation is simple since it is basically getting back to usual two-species configurations (as\ndescribed in the overview, section 2), with no \"interfacial layering\" at all. For the smaller\nfractions (φ0 → 0), the system tends to the situation of an (almost) pure melt of A* facing a\n\nB melt (with a sharp A*/B interface in between). For the higher initial fractions (φ0 → 1),\n\nthe evolution is on the contrary that of an (almost) pure A melt facing a pure B melt, with\nenthalpic mixing taking place.\n[36] Russ, T.; Brenn, R.; Abel, F.; Boué, F.; Geoghegan, M. Eur. Phys. J. E 2001, 4, 419.\n[37] Briston, J. H. In Encyclopedia of Advanced Materials; Bloor, D., Brook, R. J., Flemings,\nM. C., Mahajan, S., Eds.; Pergamon Press: New York, 1994.\n[38] Doi, M. Introduction to Polymer Physics; Oxford University Press: Oxford, 1996.\n\n28\n\n\f"}