{"id": "http://arxiv.org/abs/cond-mat/0404369v1", "guidislink": true, "updated": "2004-04-15T23:06:26Z", "updated_parsed": [2004, 4, 15, 23, 6, 26, 3, 106, 0], "published": "2004-04-15T23:06:26Z", "published_parsed": [2004, 4, 15, 23, 6, 26, 3, 106, 0], "title": "Magnetic groundstate and Fermi surface of bcc Eu", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0404368%2Ccond-mat%2F0404178%2Ccond-mat%2F0404394%2Ccond-mat%2F0404603%2Ccond-mat%2F0404190%2Ccond-mat%2F0404290%2Ccond-mat%2F0404646%2Ccond-mat%2F0404705%2Ccond-mat%2F0404273%2Ccond-mat%2F0404505%2Ccond-mat%2F0404286%2Ccond-mat%2F0404283%2Ccond-mat%2F0404486%2Ccond-mat%2F0404237%2Ccond-mat%2F0404699%2Ccond-mat%2F0404289%2Ccond-mat%2F0404476%2Ccond-mat%2F0404126%2Ccond-mat%2F0404648%2Ccond-mat%2F0404557%2Ccond-mat%2F0404320%2Ccond-mat%2F0404451%2Ccond-mat%2F0404218%2Ccond-mat%2F0404560%2Ccond-mat%2F0404137%2Ccond-mat%2F0404361%2Ccond-mat%2F0404682%2Ccond-mat%2F0404513%2Ccond-mat%2F0404364%2Ccond-mat%2F0404487%2Ccond-mat%2F0404533%2Ccond-mat%2F0404685%2Ccond-mat%2F0404750%2Ccond-mat%2F0404243%2Ccond-mat%2F0404559%2Ccond-mat%2F0404372%2Ccond-mat%2F0404749%2Ccond-mat%2F0404388%2Ccond-mat%2F0404165%2Ccond-mat%2F0404393%2Ccond-mat%2F0404406%2Ccond-mat%2F0404337%2Ccond-mat%2F0404629%2Ccond-mat%2F0404193%2Ccond-mat%2F0404215%2Ccond-mat%2F0404258%2Ccond-mat%2F0404453%2Ccond-mat%2F0404369%2Ccond-mat%2F0404180%2Ccond-mat%2F0404195%2Ccond-mat%2F0404208%2Ccond-mat%2F0404747%2Ccond-mat%2F0404198%2Ccond-mat%2F0404012%2Ccond-mat%2F0404674%2Ccond-mat%2F0404245%2Ccond-mat%2F0404722%2Ccond-mat%2F0404093%2Ccond-mat%2F0404638%2Ccond-mat%2F0404631%2Ccond-mat%2F0404389%2Ccond-mat%2F0404524%2Ccond-mat%2F0404604%2Ccond-mat%2F0404523%2Ccond-mat%2F0404612%2Ccond-mat%2F0404449%2Ccond-mat%2F0404209%2Ccond-mat%2F0404332%2Ccond-mat%2F0404010%2Ccond-mat%2F0404134%2Ccond-mat%2F0404107%2Ccond-mat%2F0404620%2Ccond-mat%2F0404070%2Ccond-mat%2F0404566%2Ccond-mat%2F0404401%2Ccond-mat%2F0404711%2Ccond-mat%2F0404730%2Ccond-mat%2F0404532%2Ccond-mat%2F0404459%2Ccond-mat%2F0404259%2Ccond-mat%2F0404622%2Ccond-mat%2F0404334%2Ccond-mat%2F0404725%2Ccond-mat%2F0404739%2Ccond-mat%2F0404595%2Ccond-mat%2F0404294%2Ccond-mat%2F0404450%2Ccond-mat%2F0404221%2Ccond-mat%2F0404381%2Ccond-mat%2F0404250%2Ccond-mat%2F0404552%2Ccond-mat%2F0404072%2Ccond-mat%2F0404675%2Ccond-mat%2F0404634%2Ccond-mat%2F0404474%2Ccond-mat%2F0404084%2Ccond-mat%2F0404071%2Ccond-mat%2F0404510%2Ccond-mat%2F0404504%2Ccond-mat%2F0404138%2Ccond-mat%2F0404663&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnetic groundstate and Fermi surface of bcc Eu"}, "summary": "Using spin-spiral technique within the full potential linearized\naugmented-plane-waves (LAPW) electronic structure method we investigate the\nmagnon spectrum and N\\'eel temperature of bcc Eu. Ground state corresponding to\nan incommensurate spin-spiral is obtained in agreement with experiment and\nprevious calculations. We demonstrate that the magnetic coupling is primarily\nthrough the intra-atomic $f-s$ and $f-d$ exchange and\nRuderman-Kittel-Kasuya-Yosida mechanism. We show that the existence of this\nspin-spiral is closely connected to a nesting feature of the Fermi surface\nwhich was not noticed before.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0404368%2Ccond-mat%2F0404178%2Ccond-mat%2F0404394%2Ccond-mat%2F0404603%2Ccond-mat%2F0404190%2Ccond-mat%2F0404290%2Ccond-mat%2F0404646%2Ccond-mat%2F0404705%2Ccond-mat%2F0404273%2Ccond-mat%2F0404505%2Ccond-mat%2F0404286%2Ccond-mat%2F0404283%2Ccond-mat%2F0404486%2Ccond-mat%2F0404237%2Ccond-mat%2F0404699%2Ccond-mat%2F0404289%2Ccond-mat%2F0404476%2Ccond-mat%2F0404126%2Ccond-mat%2F0404648%2Ccond-mat%2F0404557%2Ccond-mat%2F0404320%2Ccond-mat%2F0404451%2Ccond-mat%2F0404218%2Ccond-mat%2F0404560%2Ccond-mat%2F0404137%2Ccond-mat%2F0404361%2Ccond-mat%2F0404682%2Ccond-mat%2F0404513%2Ccond-mat%2F0404364%2Ccond-mat%2F0404487%2Ccond-mat%2F0404533%2Ccond-mat%2F0404685%2Ccond-mat%2F0404750%2Ccond-mat%2F0404243%2Ccond-mat%2F0404559%2Ccond-mat%2F0404372%2Ccond-mat%2F0404749%2Ccond-mat%2F0404388%2Ccond-mat%2F0404165%2Ccond-mat%2F0404393%2Ccond-mat%2F0404406%2Ccond-mat%2F0404337%2Ccond-mat%2F0404629%2Ccond-mat%2F0404193%2Ccond-mat%2F0404215%2Ccond-mat%2F0404258%2Ccond-mat%2F0404453%2Ccond-mat%2F0404369%2Ccond-mat%2F0404180%2Ccond-mat%2F0404195%2Ccond-mat%2F0404208%2Ccond-mat%2F0404747%2Ccond-mat%2F0404198%2Ccond-mat%2F0404012%2Ccond-mat%2F0404674%2Ccond-mat%2F0404245%2Ccond-mat%2F0404722%2Ccond-mat%2F0404093%2Ccond-mat%2F0404638%2Ccond-mat%2F0404631%2Ccond-mat%2F0404389%2Ccond-mat%2F0404524%2Ccond-mat%2F0404604%2Ccond-mat%2F0404523%2Ccond-mat%2F0404612%2Ccond-mat%2F0404449%2Ccond-mat%2F0404209%2Ccond-mat%2F0404332%2Ccond-mat%2F0404010%2Ccond-mat%2F0404134%2Ccond-mat%2F0404107%2Ccond-mat%2F0404620%2Ccond-mat%2F0404070%2Ccond-mat%2F0404566%2Ccond-mat%2F0404401%2Ccond-mat%2F0404711%2Ccond-mat%2F0404730%2Ccond-mat%2F0404532%2Ccond-mat%2F0404459%2Ccond-mat%2F0404259%2Ccond-mat%2F0404622%2Ccond-mat%2F0404334%2Ccond-mat%2F0404725%2Ccond-mat%2F0404739%2Ccond-mat%2F0404595%2Ccond-mat%2F0404294%2Ccond-mat%2F0404450%2Ccond-mat%2F0404221%2Ccond-mat%2F0404381%2Ccond-mat%2F0404250%2Ccond-mat%2F0404552%2Ccond-mat%2F0404072%2Ccond-mat%2F0404675%2Ccond-mat%2F0404634%2Ccond-mat%2F0404474%2Ccond-mat%2F0404084%2Ccond-mat%2F0404071%2Ccond-mat%2F0404510%2Ccond-mat%2F0404504%2Ccond-mat%2F0404138%2Ccond-mat%2F0404663&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using spin-spiral technique within the full potential linearized\naugmented-plane-waves (LAPW) electronic structure method we investigate the\nmagnon spectrum and N\\'eel temperature of bcc Eu. Ground state corresponding to\nan incommensurate spin-spiral is obtained in agreement with experiment and\nprevious calculations. We demonstrate that the magnetic coupling is primarily\nthrough the intra-atomic $f-s$ and $f-d$ exchange and\nRuderman-Kittel-Kasuya-Yosida mechanism. We show that the existence of this\nspin-spiral is closely connected to a nesting feature of the Fermi surface\nwhich was not noticed before."}, "authors": ["J. Kunes R. Laskowski"], "author_detail": {"name": "J. Kunes R. Laskowski"}, "author": "J. Kunes R. Laskowski", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.70.174415", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0404369v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0404369v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages 8 figures", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0404369v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0404369v1", "journal_reference": "Phys. Rev. B 70, 174415 (2004)", "doi": "10.1103/PhysRevB.70.174415", "fulltext": "Magnetic groundstate and Fermi surface of bcc Eu\nJ. Kuneš∗\n\narXiv:cond-mat/0404369v1 [cond-mat.str-el] 15 Apr 2004\n\nDept. of Physics, University of California, One Shields Avenue, Davis CA 95616, USA\nand Institute of Physics, Academy of Sciences of the Czech Republic,\nCukrovarnická 10,162 53 Praha 6, Czech Republic\n\nR. Laskowski\nInstitut for Fysik og Astronomi Aarhus Universitet, Ny Munkegade, 8000 Aarhus C, Denmark\n(Dated: November 11, 2018)\nUsing spin-spiral technique within the full potential linearized augmented-plane-waves (LAPW)\nelectronic structure method we investigate the magnon spectrum and Néel temperature of bcc\nEu. Ground state corresponding to an incommensurate spin-spiral is obtained in agreement with\nexperiment and previous calculations. We demonstrate that the magnetic coupling is primarily\nthrough the intra-atomic f −s and f −d exchange and Ruderman-Kittel-Kasuya-Yosida mechanism.\nWe show that the existence of this spin-spiral is closely connected to a nesting feature of the Fermi\nsurface which was not noticed before.\nPACS numbers: 71.18.+y,71.27.+a,75.10.Hk\n\nI.\n\nINTRODUCTION\n\nThe magnetic behavior of most rare-earth (RE) materials is governed by localized magnetic moments interacting indirectly through the sea of delocalized valence electrons. A typical feature of RE systems is existence of two\nelectron species, localized 4f 's exhibiting atomic like behavior with strong Coulomb interaction and delocalized\n5d and 6s electrons with interaction merely renormalizing the band dispersion. Yet, a typically weak interaction between these two species, either due to intra-atomic\nexchange or band mixing (hybridization), gives rise to\na variety of magnetic behaviors1. On the model level\nthis behavior is captured by periodic Anderson model\nor Kondo lattice model2 . The ab initio electronic structure methods based on density functional theory (DFT)3\nand the standard semi-local approximations4,5 have notorious problems in dealing with the strong correlations\nwithin the 4f shell. In particular the splitting between\noccupied and unoccupied 4f bands, which is the way a\nsingle-particle band structure can capture the effect of\nCoulomb interaction, is missing. Consequently, the f\nbands appear at the Fermi level resulting in unrealistic filling of both f and valence orbitals. Two remedies can be used: (i) open-core treatment or (ii) additional Coulomb term with the simplest example being\nthe LDA+U method. In the open-core treatment the 4f\norbitals are kept separate from the rest of the valence\nHamiltonian and the interaction with the valence states\nis only through the self-consistent potential. Obviously\nthe proper filling of both f and valence bands is easy to\nachieve if integer, however all kinematic exchange effects\n(e.g. superexchange) based on band mixing are missing. In the LDA+U approach the splitting between the\noccupied and unoccupied f band is obtained due to an\nadditional orbital-dependent term. All possible exchange\nprocesses are in principle accounted for in this approach.\nCompounds containing Eu in 2+ formal valency are\n\nparticularly well suited for LDA+U treatment, since the\norbital degrees of freedom are quenched in the half filled\nf shell. Examples involve ferromagnetic insulators EuO\nand EuS6 , semimetal EuB6 7 and metallic elemental Eu.\nPresumably the exchange mechanisms in these materials\nare quite different.\nIn this paper we investigate the magnetic ground state\nand magnon spectrum of elemental Eu. Europium crystallizes in body-centered cubic (bcc) structure with a\nlattice constant8 of 4.555 Å at 100 K. The magnetic\ngroundstate was found to be a spin spiral and the Néel\ntemperature8,9 of 91 K. The electronic structure was previously investigated by Freeman and Dimmock10 and\nAndersen and Loucks11 using the Xα potential. Recently Turek et al.12 used a real-space perturbation approach based on tight-binding linear muffin-tin orbital\n(TB-LMTO) method to calculate the exchange parameters and corresponding magnon spectrum and Néel temperature. Here we use a reciprocal space based spin spiral\napproach which can be viewed as complementary to the\nreal space calculations. Unlike the above authors who\nused the open core treatment of the 4f orbitals we employ\nthe LDA+U method. We use the linearized augmentedplane-waves (LAPW)13 method and its extension to noncollinear magnetic structures utilizing the generalized\nBloch theorem14 for calculation of the spin spiral states.\nWe interpret our results in terms of Ruderman-KittelKasuya-Yosida (RKKY) exchange mechanism15,16,17 and\nthe Fermi surface property. For this purpose we evaluate\nthe low frequency limit of the generalized susceptibility\nand identify the nesting features of the Fermi surface.\n\nII.\n\nCOMPUTATIONAL METHOD\n\nWe have used the Wien2k18 implementation of the\nfull potential LAPW method and its extension for noncollinear spin structures19 . The effective single-particle\n\n\f2\n\nFIG. 1: (color online) The band structure as obtained with\nLDA+U method. The brighter (red) lines correspond to majority spin. In the side panels the corresponding densities of\nstate for the minority (left) and majority (right) spin projections are shown.\n\nFIG. 2: The q-dependent exchange parameter calculated using the spin-spiral approach. Comparison of the results for\ndifferent k-point samplings indicates that the 15x15x15 mesh\nis reasonably well converged.\n\nIII.\n\npotential with constructed from LDA+U functional, with\nthe exchange-correlation potential of Perdew and Wang5\nand the double-counting scheme of Anisimov et al.20 .\nThe Coulomb term parametrized with U (7 eV unless\nstated otherwise) and J (0.75 eV) was applied to the 4f\norbitals. The spin-spirals were treated using the generalized Bloch theorem14 which prohibits inclusion of the\nspin-orbit coupling. The atomic sphere approximation\nwas employed, in which the direction of the exchange\nfield is constrained inside atomic spheres and allowed to\nvary continuously in the interstitial space.\nA spin spiral is defined by a propagation vector q and\nangle θ between the local moment and the precession\naxis. The orientation of the precession axis itself is arbitrary unless the spin-orbit coupling is taken into account.\nEach spin spiral was calculated selfconsistently. This approach has two deficiencies compared the perturbative\napproach employing the force theorem21 :(i) it costs much\nmore computational effort, (ii) more importantly one has\nto work with total energies instead of the sums of eigenvalues, i.e. looking at small differences of large numbers\nwhich requires high accuracy. As for (i), when performing calculations for q-vectors along a certain path in the\nreciprocal space converged spin density from a nearby q\ncan be used as starting point, which reduces the number of iterations needs significantly compared to starting\nfrom scratch for each q. As for (ii), θ dependence of spin\nspiral energies can be studied without being limited to\nsmall angles.\n\nRESULTS AND DISCUSSION\n\nA.\n\nBandstructure\n\nIn Fig. 1 we show the spin-projected bandstructure\nobtained with U of 7 eV and J of 0.75 eV. The lowest\nvalence band around the Γ point with a predominant 6s\ncharacter corresponds to a strongly dispersive s-band.\nMoving toward the zone boundary mixing with d-band\ntakes place and the doublets at H and P points have a\npure d symmetry. The states in the vicinity of the Fermi\nlevel have mostly d character.\nThe occupied 4f levels are localized about 3 eV below\nthe Fermi level and cross the lowest valence band, with\nnegligible hybridization, which is reflected by completely\nflat dispersion. The unoccupied 4f bands are approximately 7 eV above the Fermi level. A bandwidth of\nabout 2 eV originates from mixing with the 6p and 5d\nbands. Lack of mixing with valence states in the occupied f bands indicates that the kinematic exchange,\ninvolving hopping from localized f orbitals into the delocalized band states, is not important here. The interaction between the localized f states and the rest of the\nelectronic system, is dominated by intra-atomic f −s and\nf − d exchange. Consequently the spin polarized bands\nand density of states below 2 eV exhibit almost a perfect\nrigid shift. The deviations from this pattern are mostly\ndue to the splitting of the s-like bands being less than\nthat of d-like bands, because the more extended s orbital\nhas smaller overlap with the polarized f density.\n\n\f3\n\nFIG. 3: The q-dependent exchange parameter renormalized\nto satisfy the sum rule (5) along the high symmetry lines; ab\ninitio data (symbols), Fourier interpolation (line). The right\npanel shows the corresponding density of states.\n\nB.\n\nFIG. 4: (color online) The paramagnetic ab initio bands\n(dots) together with the smooth Fourier interpolation of the\nlow valence bands (red lines). Note that the inaccuracies of\nthe fit at the band crossings (for example midway between P\nand H) are far from the Fermi level.\n\nMagnon spectrum\n\nThe magnetic excitations are discussed in terms of a\nclassical Heisenberg Hamiltonian\nX\nH=−\n(1)\nJRR′ eR * eR′ .\nRR′\n\nA spin spiral characterized by the propagation vector q\nand angle θ has the form\neR = (sin(θ) cos(q * R), sin(θ) sin(q * R). cos(θ)),\n\n(2)\n\nThe corresponding energy per lattice site obtained from\n(1)\n\u0001\nE(q) = sin2 (θ) J(q) − J(0) + J(0) + E0\n(3)\nX\nJ(q) =\nJ0R exp(iq * R).\n(4)\nR\n\nis to be compared to the ab initio results. E0 is the nonmagnetic part of the total energy. Note that only the\ndifference J(q) − J(0) can be obtained from the knowledge of E(q). In order to fix the value of J(q) the sum\nrule\nZ\ndqJ(q) = 0,\n(5)\nwhere the integration is over the Brillouin zone, is to be\nemployed. The J(q) normalized this way contains only\ninformation about the inter-site JRR′ and can be related\nto the ordering temperature, which we discuss below.\nUsing the Hamiltonian 1 involves several approximation. Quenching of the orbital moment in a half filled\n\nshell, rigidity of the f moment and its size (S=7/2) well\njustify the use of Heisenberg Hamiltonian in classical approximation. In addition we assume that the exchange\nparameters are constant. This is not a priori guaranteed, since the electronic structure of the band electrons,\nwhich carry the exchange interaction between the local f\nmoments, depends on the arrangement of local moments.\nThis question was discussed in detail by Nolting et al.22\nwho derived an expression for the effective exchange parameters JRR′ in terms of the conduction electron selfenergy. Experimentally this leads to temperature dependence of the effective exchange parameters. If this effect\nwere important a deviation from the θ dependence of eq.\n(3) is expected. The fact that we have not found any significant deviation from (3) in the range from 90o to 30o\nserves as a justification of use of Hamiltonian (1). This is\nalso agreement with a rather big ratio of the band-width\nto the exchange splitting in the conduction band.\nIn Fig. 2 we show the q-dependent exchange parameter obtained with maximum θ of 90o . Calculations performed with U of 6 eV and 8 eV lead to almost identical\ndispersion supporting our previous conclusion about the\nf − d exchange mechanism which does not depend on the\nposition of the f bands. The calculations yield a minimum energy corresponding to a spiral with propagation\nvector Q of about 0.3 × ( 2π\na , 0, 0) and another two local\nminima along ΓN and ΓP lines. ' In order to address the\nNéel temperature the E(q) throughout the Brillouin zone\nis needed. To this end we have calculated the spin-spirals\non a 10 × 10 × 10 regular q-grid (44 irreducible q-points)\nand used a smooth Fourier interpolation23,24,25 to obtain\nJ(q) on a denser grid. In Fig. 3 we compare the inter-\n\n\f4\n\nFIG. 5: The paramagnetic Fermi surface: the lobed tetrahedra are centered at 8 P points and 'supereggs' at 6 H points on\nthe surface of the 1st Brillouin zone (only one representative\nof both species is shown for sake of clarity).\n\npolating function to the ab initio results along the high\nsymmetry directions. Since only a few high symmetry qpoints were contained in the regular grid the agreement\nbetween the interpolating function and the ab initio data\npoints indicates the quality of the grid. Comparison to\nthe results obtained by Turek et al. reveals a very good\nagreement of the key features. Besides the similar overall shape of the spectrum, we have obtained the same\nordering of the peak according to their size as well as\nsimilar absolute values. The most apparent deviation\nis the position of the ferromagnetic state J(0) which is\nrelatively more favorable in our calculation. Evaluating\nthe expressions12 for Néel temperature in the mean-field\n(TNMF ) and random-phase (TNRP A ) approximations\n\n(kB TNRP A )−1\n\n2\nkB TNMF = J(Q)\n\u001a 3\n\u0003−1\n3 1 X \u0002\nJ(Q) − J(q) +\n=\n4N q\n\u0002\n\n\u0003−1\n1\n1\nJ(Q) − J(q + Q) − J(q − Q)\n2\n2\n\n(6)\n\n\u001b\n(7)\n\nwith the interpolating function we arrive at TNMF =170 K\nand TNRP A =112 K which again agree very well with 147\nK and 110 K obtained by Turek et at. as well as with\nthe experimental value8,9 of 90.5 K.\n\nFIG. 6: (color online) The nesting function in the ΓHNH\nplane. The lower-left and upper-right corners correspond to\nΓ point with the typical 1/q divergence, the remaining corners\nare at H point and the N point is in the center of the square.\nThe upper panel shows the sum over all (2) bands. The middle panel shows the 'superegg' contribution and the lower\npanel the lobed tetrahedra contribution (the contribution of\nthe superegg-to-lobed tetrahedron processes is not shown).\n\nC.\n\nFermi surface and nesting\n\nIn this section we discuss the paramagnetic Fermi surface and its connection to the spin-spiral ground state.\nVery fine k-point sampling is required in order to study\nthe fine details of the Fermi surface. We adopted the following approach. Starting with 100 irreducible k-points\nobtained with LAPW code we have used the procedure\nfor smooth Fourier interpolation23 for the bands at the\nFermi energy. We have generated the band energies on\na finer mesh of approximately 1.5 × 106 k-points in the\nwhole Brillouin zone, which was used for the calculations\nreported below. In Fig. 4 we show the paramagnetic\nbandstructure together with the Fourier interpolation,\n\n\f5\nwhich is excellent near EF (note that the interpolation\nwas performed on different–regular mesh).\nThe paramagnetic Fermi surface of bcc Eu, Fig. 5,\nconsists of an electron pocket centered at H point, and a\nhole pocket located at P point. Symmetry related degeneracy of the valence band along the P-H direction results\nin touching of these pockets. The first numerical investigation of the Fermi surface of bcc Eu was reported by Andersen and Loucks11 , who called these pockets 'superegg'\nand 'tetracube' respectively. While our calculation reproduces the 'superegg' shape, contrary to Andersen's cube\nwith lobes we find rather a rounded tetrahedron with\nlobes.\nIn order to make connection between the Fermi surface\ngeometry and calculated spin spiral dispersion we have\nevaluated the imaginary part of the generalized susceptibility\nχij (q, ω) = −\n\nX\nk\n\nf (ǫi (k)) − f (ǫj (k + q))\n,\nǫi (k) − ǫj (k + q) − ω + i0+\n\n(8)\n\nwhere ǫ(k) is the band energy, f (ǫ) is the Fermi-Dirac\nfunction and i and j are band indices. In the limit ω → 0\nthe imaginary part of χ(q, ω) behaves as\nX\nIm χij (q, ω) = πω\nδ(ǫi (k) − ǫF )δ(ǫj (k + q) − ǫF )\nk\n\n(9)\n= πωνij (q),\n\n(10)\n\nwhere ν(q) measures so called nesting, i.e. the extent\nto which different parts of the Fermi surface weighted\nby the inverse square of the Fermi velocity are parallel.\nWhile the real part of the generalized susceptibility is\ndirectly related to the exchange parameters J(q) it is the\nimaginary part which has a straightforward geometrical\ninterpretation. The real and imaginary parts are bound\nby the Kramers-Kronig relations, which for ω = 0 limit\nread\nZ\n1 +∞ ′ Im χ(q, ω ′ )\n.\n(11)\nRe χ(q, ω = 0) =\ndω\nπ −∞\nω′\nComparing this to (9) one can readily see that a\npeak in ν(q) provides a significant contribution to\na peak in Re χ(q, ω = 0).\nIn the special case\nq → 0 limit ν(q) diverges as 1/|q|, however the limit\nlimq→0 limω→0 Re χ(q, ω) remains finite, equal to the\ndensity of states (or corresponding partial density of\nstates) at the Fermi level N (ǫF ). In general peaks in\nν(q) indicate a tendency toward instability of the Fermi\nsurface toward formation of incommensurate structures\nsuch as spin or charge density waves.\nAndersen and Loucks concluded that the origin of the\nspin spiral groundstate is the nesting between the opposite faces of their 'tetracube'. However, our investigation\nprovides a different picture. In Fig. 6 we show the nesting\nfunction ν(q) in the ΓHNH plane. There is a prominent\n\nFIG. 7: (color online) The nesting function in the ΓHPN\nplane. The arc shaped features intersecting the ΓP line originate from superegg-to-lobed tetrahedron processes.\n\npeak on the Γ-H line and a weaker feature on the Γ-N\nline. In order to identify the origin of these features we\nhave calculated separately the contributions of the different sheets of the Fermi surface. Fig. 6 demonstrates that\nboth peaks originate from transitions between the lobed\ntetrahedra surfaces. The q parallel to the Γ-H direction\namounts to moving the lobed tetrahedron centered at the\nP point toward the next P point on the same face. The\npeak on the Γ-H line correspond to the overlap of the\nlobes, which is illustrated explicitly in Fig. 8. The peak\non the Γ-N line corresponds to the sum of two nesting\nvectors along adjacent Γ-H directions. Therefore it originates from an overlap of the tips of the lobes, however,\nbelonging to tetrahedra centered at P points which are\nnot on the same face. In Fig. 7 we show the nesting\nfunction in the ΓHPN plane. Besides the peaks on Γ-H\nand Γ-N lines we find weaker features on the Γ-P line.\nAnalysis of the contributions from different sheets shows\nthat these features originate from transitions between the\ntwo types of Fermi surfaces.\nEventually we can compare the information obtained\nfrom the nesting function to the magnon dispersion. We\nhave found a prominent nesting feature on the Γ-H line\nand weaker one on the Γ-N line. These are related to the\nminima in the spin-spiral energies. The energy minima\ndo not sit exactly at the positions of corresponding the\nnesting vectors. While the nesting vectors contain information about the states directly at the Fermi energy,\nall states contribute to the spin-spiral minima, yet with a\nweight decreasing with the distance from the Fermi level.\nA discussion of the generalized susceptibility in the context of electron-phonon coupling can be found in Ref.\n26.The features on the Γ-P line are rather weak and do\nnot fit well with the position of the Γ-P peak therefore\nwe do not draw any conclusion about its direct relation\nto the local energy minimum on the Γ-P line.\n\n\f6\nspectrum which is in good agreement with that published\nby Turek et al. using TB-LMTO. The calculations reproduce well the experimentally observed spin-spiral groundstate and provide a reasonable estimate of the Néel temperature. The good agreement of two rather different\ncomputational methods indicates a robustness of these\nphysical properties. Moreover we have shown that the\nvalues of the exchange parameters are insensitive to the\nprecession angle of the spin spiral as well as the value\nof U, i.e. exact position of the occupied f bands. This\nconfirms the picture of bcc Eu as a Kondo-lattice system with ferromagnetic exchange of intra-atomic origin\nin the RKKY regime. We have identified the origin of the\nspin-spiral ground state in terms of nesting properties of\nthe Fermi surface. In particular we have shown that the\nnesting is connected to the lobed tetrahedron hole pockets centered at the P point of the Brillouin zone.\nFIG. 8: The lobed tetrahedron translated by q = 0.4 ×\n( 2π\n, 0, 0) corresponding to the Γ-H peak elucidates the oria\ngin of the spin-spiral groundstate.\n\nIV.\n\nCONCLUSIONS\n\nUsing a full-potential method with LDA+U functional\nand spin-spiral approach we have obtained a magnon\n\n∗\n1\n\n2\n\n3\n4\n5\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\nElectronic address: kunes@fzu.cz\nJ. Jensen and A. R. Mackintosh, Rare Earth Magnetism\n(Clarendon, Oxford, 1991).\nA. C. Hewson, Kondo problem to heavy fermions (Cambridge Universtity Press, Cambridge, 1993).\nP. Hohenberg and W. Kohn, Phys. Rev. 136, B864 (1964).\nW. Kohn and L. Sham, Phys. Rev. 140, A1133 (1965).\nJ. P. Perdew and Y. Wang, Phys. Rev. B 45, 13244 (1992).\nP. Wachter, Handbook of Physics and Chemistry of Rare\nEarth, vol. 1 (North Holland, Amsterdam, 1979).\nThe questions whether steciometric EuB6 is actually\nsemimetal or semiconductor is still controversial.\nN. G. Nereson, C. E. Olsen, and G. P. Arnold, Phys. Rev.\n135 (1964).\nA. H. Millhouse and K. A. McEwen, Solid State Commun.\n13, 339 (1973).\nA. J. Freeman and J. O. Dimmock, Bull. Am. Phys. Soc.\n11, 216 (1966).\nO. K. Andersen and T. L. Loucks, Phys. Rev. 167, 551\n(1968).\nI. Turek, J. Kudrnovský, M. Diviš, P. Franek,\nG. Bihlmayer, and S. Blügel, Phys. Rev. B 68, 224431\n(2003).\nD. J. Singh, Plane Waves, Pseudopotentials and the LAPW\nMethod (Kluwer Academic, Boston, 1994).\nL. M. Sandratskii, Adv. Phys. 47, 91 (1998).\n\nV.\n\nACKNOWLEDGMENT\n\nWe wish to acknowledge the helpful discussions and\nnumerous suggestions by W. E. Pickett, J. Kudrnovský\nand P. Novák. This work was supported by Department\nof Energy Grant DE-FG 03-01ER45876, the Grant No.\nA1010214 from Academy of Sciences of the Czech Republic and by Czech-USA project KONTAKT ME547.\n\n15\n16\n17\n18\n\n19\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\nM. A. Rudeman and C. Kittel, Phys. Rev. 96, 99 (1954).\nK. Yosida, Phys. Rev. 106, 893 (1957).\nT. Kasuya, Prog. Theoret. Phys. 16, 45 (1956).\nP. Blaha, K. Schwarz, G. K. H. Madsen, D. Kvasnicka,\nand J. Luitz, WIEN2k, An Augmented Plane Wave + Local\nOrbitals Program for Calculating Crystal Properties (Karlheinz Schwarz, Techn. Universität Wien, Wien, 2001),\nISBN 3-9501031-1-2.\nR. Laskowski et al., to be published.\nV. I. Anisimov, I. V. Solovyev, M. A. Korotin, M. T.\nCzyzyk, and G. A. Sawatzky, Phys. Rev. B 48, 16929\n(1993).\nA. I. Lichtenstein, M. I. Katsnelson, V. P. Andropov, and\nV. A. Gubanov, J. Magn. Magn. Mater. 67, 65 (1987).\nW. Nolting, S. Rex, and S. M. Jaya, J. Phys.: Condens.\nMatter 9, 1301 (1997).\nW. E. Pickett, H. Krakauer, and P. B. Allen, Phys. Rev.\nB 38, 2721 (1988).\nD. G. Shankland, Computational Methods in Band Theory\n(Plenum, New York, 1971), p. 362.\nD. D. Koelling and J. H. Wood, J. Comput. Phys. 67, 253\n(1986).\nS. K. Sinha and B. N. Harmon, Phys. Rev. Lett. 35, 1515\n(1975).\n\n\f"}