{"id": "http://arxiv.org/abs/cond-mat/0204364v1", "guidislink": true, "updated": "2002-04-17T08:23:34Z", "updated_parsed": [2002, 4, 17, 8, 23, 34, 2, 107, 0], "published": "2002-04-17T08:23:34Z", "published_parsed": [2002, 4, 17, 8, 23, 34, 2, 107, 0], "title": "Soldering of MT-YBCO: method to produce superconductive junctions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0204113%2Ccond-mat%2F0204042%2Ccond-mat%2F0204191%2Ccond-mat%2F0204602%2Ccond-mat%2F0204400%2Ccond-mat%2F0204479%2Ccond-mat%2F0204289%2Ccond-mat%2F0204515%2Ccond-mat%2F0204018%2Ccond-mat%2F0204516%2Ccond-mat%2F0204523%2Ccond-mat%2F0204119%2Ccond-mat%2F0204210%2Ccond-mat%2F0204579%2Ccond-mat%2F0204335%2Ccond-mat%2F0204600%2Ccond-mat%2F0204294%2Ccond-mat%2F0204285%2Ccond-mat%2F0204137%2Ccond-mat%2F0204244%2Ccond-mat%2F0204561%2Ccond-mat%2F0204502%2Ccond-mat%2F0204596%2Ccond-mat%2F0204425%2Ccond-mat%2F0204462%2Ccond-mat%2F0204246%2Ccond-mat%2F0204423%2Ccond-mat%2F0204201%2Ccond-mat%2F0204007%2Ccond-mat%2F0204318%2Ccond-mat%2F0204070%2Ccond-mat%2F0204375%2Ccond-mat%2F0204190%2Ccond-mat%2F0204182%2Ccond-mat%2F0204309%2Ccond-mat%2F0204151%2Ccond-mat%2F0204407%2Ccond-mat%2F0204231%2Ccond-mat%2F0204234%2Ccond-mat%2F0204245%2Ccond-mat%2F0204195%2Ccond-mat%2F0204556%2Ccond-mat%2F0204514%2Ccond-mat%2F0204053%2Ccond-mat%2F0204392%2Ccond-mat%2F0204169%2Ccond-mat%2F0204488%2Ccond-mat%2F0204583%2Ccond-mat%2F0204513%2Ccond-mat%2F0204503%2Ccond-mat%2F0204624%2Ccond-mat%2F0204372%2Ccond-mat%2F0204364%2Ccond-mat%2F0204109%2Ccond-mat%2F0204476%2Ccond-mat%2F0204482%2Ccond-mat%2F0204337%2Ccond-mat%2F0204225%2Ccond-mat%2F0204239%2Ccond-mat%2F0204541%2Ccond-mat%2F0204215%2Ccond-mat%2F0204086%2Ccond-mat%2F0204391%2Ccond-mat%2F0204216%2Ccond-mat%2F0204299%2Ccond-mat%2F0204377%2Ccond-mat%2F0204014%2Ccond-mat%2F0204450%2Ccond-mat%2F0204230%2Ccond-mat%2F0204140%2Ccond-mat%2F0204387%2Ccond-mat%2F0204359%2Ccond-mat%2F0204127%2Ccond-mat%2F0204287%2Ccond-mat%2F0204076%2Ccond-mat%2F0204589%2Ccond-mat%2F0204399%2Ccond-mat%2F0204363%2Ccond-mat%2F0204298%2Ccond-mat%2F0204497%2Ccond-mat%2F0204560%2Ccond-mat%2F0204570%2Ccond-mat%2F0204453%2Ccond-mat%2F0204047%2Ccond-mat%2F0204629%2Ccond-mat%2F0204604%2Ccond-mat%2F0204205%2Ccond-mat%2F0204163%2Ccond-mat%2F0204032%2Ccond-mat%2F0204633%2Ccond-mat%2F0204138%2Ccond-mat%2F0204078%2Ccond-mat%2F0204275%2Ccond-mat%2F0204381%2Ccond-mat%2F0204395%2Ccond-mat%2F0204382%2Ccond-mat%2F0204055%2Ccond-mat%2F0204539%2Ccond-mat%2F0204123%2Ccond-mat%2F0204203%2Ccond-mat%2F0204594&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Soldering of MT-YBCO: method to produce superconductive junctions"}, "summary": "A method of soldering of melt-textured YBa2Cu3O7-d -based (MT-YBCO)\nsuperconductive blocks using a TmBaCu3O7-d (Tm123) powder has been suggested.\nThe method excludes stages of slow cooling during soldering and preparation of\nauxiliary layers. To estimate the critical current density (jc) through the\nobtained junction, we have drilled rings from single-domained MT-YBCO blocks,\ncut into two pieces along the diameters and soldered using a Tm123 powder. The\ncritical current density, jc, (estimated using vibrating sample magnetometer)\nthrough the soldered ring was 34 kA/cm^2 in 0 T field at 77 K, which turned out\nto be even higher by a factor of approximately 1.5 than that through the\nsingle-domained material. The increase in jc through the soldered ring has been\nobserved up to the 2.5 T field, while in the higher fields some decrease of jc\ntook place. As a result of the field mapping of the trapped magnetic flux in\nsoldered ring using a Hall probe, we obtained a regular truncated cone and the\nmaximal level of trapped field for the ring 8 and 4 mm in outer and inner\ndiameters was about 80 mT.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0204113%2Ccond-mat%2F0204042%2Ccond-mat%2F0204191%2Ccond-mat%2F0204602%2Ccond-mat%2F0204400%2Ccond-mat%2F0204479%2Ccond-mat%2F0204289%2Ccond-mat%2F0204515%2Ccond-mat%2F0204018%2Ccond-mat%2F0204516%2Ccond-mat%2F0204523%2Ccond-mat%2F0204119%2Ccond-mat%2F0204210%2Ccond-mat%2F0204579%2Ccond-mat%2F0204335%2Ccond-mat%2F0204600%2Ccond-mat%2F0204294%2Ccond-mat%2F0204285%2Ccond-mat%2F0204137%2Ccond-mat%2F0204244%2Ccond-mat%2F0204561%2Ccond-mat%2F0204502%2Ccond-mat%2F0204596%2Ccond-mat%2F0204425%2Ccond-mat%2F0204462%2Ccond-mat%2F0204246%2Ccond-mat%2F0204423%2Ccond-mat%2F0204201%2Ccond-mat%2F0204007%2Ccond-mat%2F0204318%2Ccond-mat%2F0204070%2Ccond-mat%2F0204375%2Ccond-mat%2F0204190%2Ccond-mat%2F0204182%2Ccond-mat%2F0204309%2Ccond-mat%2F0204151%2Ccond-mat%2F0204407%2Ccond-mat%2F0204231%2Ccond-mat%2F0204234%2Ccond-mat%2F0204245%2Ccond-mat%2F0204195%2Ccond-mat%2F0204556%2Ccond-mat%2F0204514%2Ccond-mat%2F0204053%2Ccond-mat%2F0204392%2Ccond-mat%2F0204169%2Ccond-mat%2F0204488%2Ccond-mat%2F0204583%2Ccond-mat%2F0204513%2Ccond-mat%2F0204503%2Ccond-mat%2F0204624%2Ccond-mat%2F0204372%2Ccond-mat%2F0204364%2Ccond-mat%2F0204109%2Ccond-mat%2F0204476%2Ccond-mat%2F0204482%2Ccond-mat%2F0204337%2Ccond-mat%2F0204225%2Ccond-mat%2F0204239%2Ccond-mat%2F0204541%2Ccond-mat%2F0204215%2Ccond-mat%2F0204086%2Ccond-mat%2F0204391%2Ccond-mat%2F0204216%2Ccond-mat%2F0204299%2Ccond-mat%2F0204377%2Ccond-mat%2F0204014%2Ccond-mat%2F0204450%2Ccond-mat%2F0204230%2Ccond-mat%2F0204140%2Ccond-mat%2F0204387%2Ccond-mat%2F0204359%2Ccond-mat%2F0204127%2Ccond-mat%2F0204287%2Ccond-mat%2F0204076%2Ccond-mat%2F0204589%2Ccond-mat%2F0204399%2Ccond-mat%2F0204363%2Ccond-mat%2F0204298%2Ccond-mat%2F0204497%2Ccond-mat%2F0204560%2Ccond-mat%2F0204570%2Ccond-mat%2F0204453%2Ccond-mat%2F0204047%2Ccond-mat%2F0204629%2Ccond-mat%2F0204604%2Ccond-mat%2F0204205%2Ccond-mat%2F0204163%2Ccond-mat%2F0204032%2Ccond-mat%2F0204633%2Ccond-mat%2F0204138%2Ccond-mat%2F0204078%2Ccond-mat%2F0204275%2Ccond-mat%2F0204381%2Ccond-mat%2F0204395%2Ccond-mat%2F0204382%2Ccond-mat%2F0204055%2Ccond-mat%2F0204539%2Ccond-mat%2F0204123%2Ccond-mat%2F0204203%2Ccond-mat%2F0204594&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A method of soldering of melt-textured YBa2Cu3O7-d -based (MT-YBCO)\nsuperconductive blocks using a TmBaCu3O7-d (Tm123) powder has been suggested.\nThe method excludes stages of slow cooling during soldering and preparation of\nauxiliary layers. To estimate the critical current density (jc) through the\nobtained junction, we have drilled rings from single-domained MT-YBCO blocks,\ncut into two pieces along the diameters and soldered using a Tm123 powder. The\ncritical current density, jc, (estimated using vibrating sample magnetometer)\nthrough the soldered ring was 34 kA/cm^2 in 0 T field at 77 K, which turned out\nto be even higher by a factor of approximately 1.5 than that through the\nsingle-domained material. The increase in jc through the soldered ring has been\nobserved up to the 2.5 T field, while in the higher fields some decrease of jc\ntook place. As a result of the field mapping of the trapped magnetic flux in\nsoldered ring using a Hall probe, we obtained a regular truncated cone and the\nmaximal level of trapped field for the ring 8 and 4 mm in outer and inner\ndiameters was about 80 mT."}, "authors": ["T. Prikhna", "W. Gawalek", "N. Novikov", "V. Moshchil", "V. Sverdun", "N. Sergienko", "A. Surzhenko", "M. Wendt", "T. Habisreuther", "D. Litzkendorf", "S. Dub", "R. Mueller", "A. Kordyuk", "S. Kracunovska", "L. Alexandrova"], "author_detail": {"name": "L. Alexandrova"}, "author": "L. Alexandrova", "arxiv_comment": "5 pages pdf, will be presented at CIMTEC 2002", "links": [{"href": "http://arxiv.org/abs/cond-mat/0204364v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0204364v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0204364v1", "affiliation": "Institute for Superhard Materials, Kiev, Ukraine", "arxiv_url": "http://arxiv.org/abs/cond-mat/0204364v1", "journal_reference": null, "doi": null, "fulltext": "SOLDERING OF MT-YBCO: METHOD TO PRODUCE SUPERCONDUCTIVE\nJUNCTIONS\nTatiana PRIKHNA(1), Wolfgang GAWALEK(2), Nikolay NOVIKOV(1), Viktor MOSHCHIL(1)\nVladimir SVERDUN(1), Nina SERGIENKO(1), Alexey SURZHENKO(2), Michael WENDT(2),\nTobias HABISREUTHER(2), Doris LITZKENDORF(2),Sergey DUB(1), Robert MÜLLER (2),\nAlexander KORDYUK(3), Silviya KRACUNOVSKA(2),, Lydmila ALEXANDROVA(1)\n(1)\n\nInstitute for Superhard Materials of the Nat'l Ac. Sci of Ukraine, 2, Avtozavodskaya St.,\n04074, Kiev, Ukraine\n(2)\nInstitut für Physikalische Hochtechnologie e.V., Winzerlaer Str. 10, D-07743 Jena,\nGermany\n(3)\nInstitute of Metal Physics, 36, Vernadsky Pr., 03142, Kiev, Ukraine\nA method of soldering of melt-textured YBa2Cu3O7-δ-based (MT-YBCO)\nsuperconductive blocks using a TmBaCu3O7-δ (Tm123) powder has been suggested. The\nmethod excludes stages of slow cooling during soldering and preparation of auxiliary\nlayers. To estimate the critical current density (jc) through the obtained junction, we have\ndrilled rings from single-domained MT-YBCO blocks, cut into two pieces along the\ndiameters and soldered using a Tm123 powder. The critical current density, jc,\n(estimated using vibrating sample magnetometer) through the soldered ring was\n34 kA/cm2 in 0 T field at 77 K, which turned out to be even higher by a factor of\napproximately 1.5 than that through the single-domained material. The increase in jc\nthrough the soldered ring has been observed up to the 2.5 T field, while in the higher\nfields some decrease of jc took place. As a result of the field mapping of the trapped\nmagnetic flux in soldered ring using a Hall probe, we obtained a regular truncated cone\nand the maximal level of trapped field for the ring 8 and 4 mm in outer and inner\ndiameters was about 80 mT.\n1. INTRODUCTION\nSoldering of melt-textured YBa2Cu3O7-δ-based (MT-YBCO) superconductive blocks is\na promising way of manufacturing large superconductive items of complex shapes,\nbecause up to now the existing technologies of melt-textured growth don't allow high\nquality parts larger than 40-60 mm to be produced. Due to the high level of\nsuperconductive characteristics such as critical current density (jc) and levitation force,\nMT-YBCO can be successfully used in electromotors, flywheels, frictionless bearings,\netc. The MT-YBCO structure is constituted from a single crystalline YBa2Cu3O7-δ\n\n(or\n\nY123) superconductive matrix (good samples usually contain one or a few single\ncrystalline domains), in which fine inclusions of non-superconductive Y2BaCuO5 (or\nY211) phase (in the amount of 20-30 %) are uniformly distributed. The single crystalline\nmatrix allows high critical current density jc through the whole bulk because the weak\nlinks usually caused by the presence of grain boundaries are absent. The presence of\nfine inclusions of Y211 allows a further increase in the jc because of high density of\n\n\fdislocations, stacking faults, etc. around them, i.e. because of the high density of defect\nthat are commensurable with the coherence length of Y123 superconductor and serves\nas pinning centers for magnetic flux. Melt-textured YBCO is manufactured using topseeds from the composition with Y1.5Ba2Cu3Ox stoichiometry (with 1 wt% of CeO2\naddition). The matrix grows (crystallizes) in the temperature region from 1000 to 950 oC\nvery slowly at a rate of about 0.3-1 K/h and during this process a growing Y123 crystal\ntraps fine inclusions of Y211. CeO2 is necessary for the refinement of Y211 grains.\nThe soldering is aimed at developing a binding layer between superconductive MTYBCO blocks that were have similar superconductive and mechanical properties, which\nshould be supported by the similar structure of the joining and the material. As a solder,\na material with a lower melting temperature should be used. Good results have been\nobtained using as a solder a spacer-layer material cut from MT- TmBCO (melt-textured\nTmBa2Cu3O7-δ with a 25 wt.% admixes of Y211, oxygenated 16 days at 450 oC in O2) 1.\nThe soldering has been conducted in accordance with the \"melt-textured\" process (Fig.1,\ndashed line) that means holding for 6 h at 980 oC and a slow (0.5 K/h) cooling in the 980955 oC region. Then the oxygenation at 440-480 oC in a separate process for 12 h 2 weeks (depending on the sample size) took place1. By using the spacer layer material\ncut from MT-YBCO with Ag addition (that allows the melting temperature of MT-YBCO to\nbe reduced) is also possible to obtain a good superconductive soldered seam2. Thus, the\nproblem arises of manufacturing of large melt-textured high quality auxiliary layers to be\nused as solders. Besides, such a soldering process is complicated and rather time\nconsuming.\nWe have developed a method to solder MT-YBCO using a TmBaCu3O7-δ (Tm123)\npowder that allows us to produce high-quality superconductive junctions between MTYBCO parts excluding the stages of slow (\"melt-textured\") cooling during soldering and\npreparation of auxiliary layers. Using this method, we can solder a great quantity of parts\ndifferently arranged relative to each other. To estimate the critical current density jc\nthrough the soldered seam (methods proposed by H. Zheng et al.3,4), we used singledomained rings that were cut into two parts along the diameter and then soldered.\nT, oC\n0.05 h\n\n1010\n1005\n\n2 h 70 K/h\n6h\n\n500 K\n/h\n\n980\n955\n\n0\n\n100 K/h\n100 K/h\ng\ne\nolin\nco urnac\nhf\nwit\n\n1000 K/h\n\n900\n\n0.5 K/h\n\n5\n\n10\n\n15\n\n20\n\n70\n\nTime, h 80\n\nFIGURE 1\nRegimes of soldering: solid line – used by the authors in\nthe present study\ndashed line – regime used by H.\nZheng et al.1\n\n\f2. EXPERIMENTAL\nThe rings (8 mm outer and 4 mm in inner diameters and 4-6 mm in height) have been\ndrilled from single-domain MT-YBCO blocks. Rings were put into a vibrating sample\nmagnetometer (VSM) and from magnetization loops the jc has been estimated using the\nequation:\njc=3M/[H*π(R23 – R13)],\nwhere M – magnetic moment, R1, R2 – inner and outer radii of the ring, respectively, H –\nthe ring height.\nThe determined-from-DTA study temperature of the incongruent melting of MT-YBCO\nwas 1016 oC and that of Tm123 was in the range from 984 to 986 oC.\nThen these rings have been cut into two pieces along the diameters (the width of cut\nwas about 0.7 mm) and soldered using a Tm123 powder (applied by sedimentation onto\nthe soldered surfaces from the suspension in acetone) by regime shown on Fig.1 (solid\nline) with following oxygenation for 5.5 days. During soldering the parts to be joint were\nkept under 3 - 4 kg/cm2 pressure using a special device. After soldering the ring has\nbeen again placed into the magnetometer to estimate the jc. The maps of the trapped\nfield in the ring have been investigated as well. To determine the flux-trapping capability,\nthe samples were field cooled to 77 K in a 5 kG field oriented parallel to the c-axis (ring\naxis). The magnetic field was then turned off and the sample was transferred (without\nwarming) to a liquid nitrogen Dewar equipped with a cryogenic scanning Hall probe. The\nHall sensor has a active zone of about 50x50 μm. During the field scans, the probe was\npositioned at approximately 0.8 mm above the sample surface.\nThe structure of rings was studied using the SEM and polarizing microscopy. The\nmagnetization hysteresis loops were obtained on an Oxford Instruments 3001 vibrating\nsample magnetometer (VSM). Hardness was measured on a Matsuzawa Mod. MXT-70\nmicrohardness tester using a Vickers indenter. The bending strength was measured by\nthe traditional method using a Universal Testing machine FM1000.\n3. RESULTS AND DISCUSSION\nIn Fig.2 you can see the loops of magnetization of the starting single domain and\nsoldered rings. Fig. 3 shows the jc calculated from magnetization loops. At 77 K - in 0 T\nfield was jc=34 kA/cm2. The observed increase of the jc through the soldered ring by a\n\nfactor of 1.5 as compared to the jc through the initial (uncut) ring can be explained by the\nfact that during the oxygenation that followed the soldering process the superconductive\n\n\f40\n\n50\n\nRings\nstarting single domain\nsoldered with Tm123\n\n40\n30\n\nM T-YBCO single-dom ained ring\n\n35\n30\n\nSam e ring cutand soldered\nby the Tm Ba2Cu3O 7-δ (Tm 123)pow der\n\n2\n\n20\n\n0\n\nJc, кA/cm\n\nEMU\n\n10\nstarting\n\n-10\n-20\n\nsoldered\n\n-30\n\n25\n20\n15\n10\n\n-40\n\n5\n\n-50\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nμoH, Т\n\nμoH, T\n\nFIGURE 2\nMagnetization loops of single domain\n(starting) and soldered (with Tm123\npowder) MT-YBCO rings obtained by\nvibrating sample magnetometer.\n\nFIGURE 3\nCritical current density, jc, vs. magnetic\nfield, μ0H, of the single-domained ring and\nof the same ring cut and soldered by the\nTm123 powder.\n\nproperties of the MT-YBCO material have been increased as well. The increase in the jc\nthrough the soldered ring have been observed up to the 2.5 T field, while in the higher\nfields some decrease of the jc took place.\nThe results of the field-mapping using Hall sensors have given the undoubted proofs\nthat the high-quality junction have been obtained and are shown in Fig.4. We obtained a\nregular truncated cone and the maximal level of the trapped field for the ring was about\n80 mT. The fact that the truncated cone is high by symmetric and that the upper surface\nhas no valleys crevasse gives us undoubted proofs that the current through the seam is\nthe same as through the material and the level of maximum trapped field indicates that\nthe critical current density through the ring is higher than 104 A/cm2.\nFig. 5 demonstrates the structure of the seam and nearby joined material obtained using\nSEM and polarizing microscopy. One can see a good accommodation of the seam\nstructure to the structure of MT-YBCO. In Fig.5 f the presence of Tm(Y)211 inclusions is\nobserved. They have formed despite the fact that we haven't added any 211 phase\n(either Y211 or Tm123) to the Tm123 powder. In some places (Fig.5 c) it is well seen\nthat even the structure of twins in the seam repeats the twin structure of the joined MTYBCO. The width of the seam that can be estimated only from the COMP (composition)\nor Z-contrast image, obtained by SEM, turned out to be 50 μm. The Vickers\nmicrohardness\n\nof\n\nthe\n\nseam\n\nand\n\nof\n\nthe\n\nmaterial\n\nwas\n\nsimilar\n\n4.57±\n\nFIGURE 4\nTrapped-field maps for the MT-YBCO ring\nsoldered with Tm123.\n\n\f0.82 GPa and 4.82±0.45 GPa (under 1.96-N load), respectively. When we estimated the\nbending strength of the seam, the breaking occurred mainly through the joined material,\nbut not through the place of soldering and the strength was 28-32 MPa. This is the\nindicative of high mechanical properties of the junction.\n4. CONCLUSIONS\nUsing a TmBa2Cu3O7-δ (Tm123) powder as a solder we can obtain junctions between\nbulk superconductive parts of MT-YBCO, superconductive and mechanical properties of\nwhich are at the same level as those of the soldered material. The developed method\nallows us essentially simplify the soldering process and reduce the time of soldering. The\ncalculated jc value through the best-soldered seam in 0 T field at 77 K was\njc=34 kA/cm2. The observed increasing of jc through the soldered ring by a factor of 1.5\nas compared to the jc through the initial (uncut) ring can be explained by the fact that\nduring the oxygenation that followed the soldering process the superconductive\nproperties of the MT-YBCO material have been increased as well. The increase in jc\nthrough the soldered ring have been observed up to the 2.5 T field. The results of fieldmapping using Hall sensors gave us the undoubted proofs that the high-quality junction\nhave been obtained. The structure of the seam practically repeats or slaves the structure\nof the soldered material.\nFIGURE 5\n(a, b, c) the structure of the soldered seam\nobtained using polarizing microscopy at the\ndifferent magnification\n(d, e, f) SEM pictures of the seam soldered by\nTm123: SEI –secondary electron image (d, e)\nand COMP - composition or Z- contrast image (f).\nIn some cases to show the position of the seam\nthe white dashed lines have been used.\n\nREFERENCES\n\n1) H.Zheng,\nM.Jiang,\nR.Nikolova,\nU.Welp,\nA.P.Paulikas,\nYi\nHuang,\nG.W.Crabtree,B.W.Veal, H.Claus, Physica C 322 (1999) 1.\n2) S.Iliescu, A.E. Carillo, T. Puig, X.Obradors, in 5th European Conference on Applied\nSuperconductivity, EUCAS 2001, Denmark, Copenhagen, 26-30 August, 2001 197.\n3) H.Zheng, H. Claus, L. Chen, A.P. Paulikas, B.W. Veal, B. Olsson, A. Koshelev,\nJ. Hull, G.W. Crabtree, Physica C 350 (2001) 17.\n4) B.W. Veal, H.Zheng, H. Claus, L. Chen, A.P. Paulikas, A. Koshelev, G.W. Crabtree,\nin \"Structure and Property Relationship for Applications of High-temperature\nSuperconducting Materials\", 2000 International Workshop on Superconductivity,\nShimane, Japan, June 19-22, 2000, 211\n\n\f"}