{"id": "http://arxiv.org/abs/cond-mat/0407513v1", "guidislink": true, "updated": "2004-07-20T10:54:18Z", "updated_parsed": [2004, 7, 20, 10, 54, 18, 1, 202, 0], "published": "2004-07-20T10:54:18Z", "published_parsed": [2004, 7, 20, 10, 54, 18, 1, 202, 0], "title": "Delayed Rejection Variational Monte Carlo", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0407790%2Ccond-mat%2F0407378%2Ccond-mat%2F0407325%2Ccond-mat%2F0407233%2Ccond-mat%2F0407602%2Ccond-mat%2F0407513%2Ccond-mat%2F0407613%2Ccond-mat%2F0407570%2Ccond-mat%2F0407125%2Ccond-mat%2F0407014%2Ccond-mat%2F0407549%2Ccond-mat%2F0407026%2Ccond-mat%2F0407201%2Ccond-mat%2F0407759%2Ccond-mat%2F0407367%2Ccond-mat%2F0407438%2Ccond-mat%2F0407003%2Ccond-mat%2F0407746%2Ccond-mat%2F0407526%2Ccond-mat%2F0407386%2Ccond-mat%2F0407269%2Ccond-mat%2F0407041%2Ccond-mat%2F0407704%2Ccond-mat%2F0407552%2Ccond-mat%2F0407648%2Ccond-mat%2F0407218%2Ccond-mat%2F0407676%2Ccond-mat%2F0407082%2Ccond-mat%2F0407763%2Ccond-mat%2F0407662%2Ccond-mat%2F0407607%2Ccond-mat%2F0407634%2Ccond-mat%2F0407708%2Ccond-mat%2F0407178%2Ccond-mat%2F0407350%2Ccond-mat%2F0407481%2Ccond-mat%2F0407086%2Ccond-mat%2F0407668%2Ccond-mat%2F0407066%2Ccond-mat%2F0407760%2Ccond-mat%2F0407379%2Ccond-mat%2F0407421%2Ccond-mat%2F0407198%2Ccond-mat%2F0407721%2Ccond-mat%2F0407557%2Ccond-mat%2F0407271%2Ccond-mat%2F0407470%2Ccond-mat%2F0407808%2Ccond-mat%2F0407238%2Ccond-mat%2F0407008%2Ccond-mat%2F0407793%2Ccond-mat%2F0407073%2Ccond-mat%2F0407453%2Ccond-mat%2F0407258%2Ccond-mat%2F0407515%2Ccond-mat%2F0407679%2Ccond-mat%2F0407624%2Ccond-mat%2F0407385%2Ccond-mat%2F0407097%2Ccond-mat%2F0407304%2Ccond-mat%2F0407023%2Ccond-mat%2F0407689%2Ccond-mat%2F0407013%2Ccond-mat%2F0407005%2Ccond-mat%2F0407376%2Ccond-mat%2F0407755%2Ccond-mat%2F0407480%2Ccond-mat%2F0407807%2Ccond-mat%2F0407129%2Ccond-mat%2F0407349%2Ccond-mat%2F0407231%2Ccond-mat%2F0407798%2Ccond-mat%2F0407502%2Ccond-mat%2F0407754%2Ccond-mat%2F0407416%2Ccond-mat%2F0407503%2Ccond-mat%2F0407735%2Ccond-mat%2F0407185%2Ccond-mat%2F0407578%2Ccond-mat%2F0407454%2Ccond-mat%2F0407235%2Ccond-mat%2F0407410%2Ccond-mat%2F0407006%2Ccond-mat%2F0407593%2Ccond-mat%2F0407563%2Ccond-mat%2F0407599%2Ccond-mat%2F0407524%2Ccond-mat%2F0407702%2Ccond-mat%2F0407651%2Ccond-mat%2F0407520%2Ccond-mat%2F0407705%2Ccond-mat%2F0407250%2Ccond-mat%2F0407636%2Ccond-mat%2F0407623%2Ccond-mat%2F0407139%2Ccond-mat%2F0407017%2Ccond-mat%2F0407056%2Ccond-mat%2F0407499%2Ccond-mat%2F0407135%2Ccond-mat%2F0407483%2Ccond-mat%2F0407018&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Delayed Rejection Variational Monte Carlo"}, "summary": "A new acceleration algorithm to address the problem of multiple time scales\nin variational Monte Carlo simulations is presented. After a first attempted\nmove has been rejected, the delayed rejection algorithm attempts a second move\nwith a smaller time step, so that even moves of the core electrons can be\naccepted. Results on Be and Ne atoms as test cases are presented. Correlation\ntime and both average accepted displacement and acceptance ratio as a function\nof the distance from the nucleus evidence the efficiency of the proposed\nalgorithm in dealing with the multiple time scales problem.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0407790%2Ccond-mat%2F0407378%2Ccond-mat%2F0407325%2Ccond-mat%2F0407233%2Ccond-mat%2F0407602%2Ccond-mat%2F0407513%2Ccond-mat%2F0407613%2Ccond-mat%2F0407570%2Ccond-mat%2F0407125%2Ccond-mat%2F0407014%2Ccond-mat%2F0407549%2Ccond-mat%2F0407026%2Ccond-mat%2F0407201%2Ccond-mat%2F0407759%2Ccond-mat%2F0407367%2Ccond-mat%2F0407438%2Ccond-mat%2F0407003%2Ccond-mat%2F0407746%2Ccond-mat%2F0407526%2Ccond-mat%2F0407386%2Ccond-mat%2F0407269%2Ccond-mat%2F0407041%2Ccond-mat%2F0407704%2Ccond-mat%2F0407552%2Ccond-mat%2F0407648%2Ccond-mat%2F0407218%2Ccond-mat%2F0407676%2Ccond-mat%2F0407082%2Ccond-mat%2F0407763%2Ccond-mat%2F0407662%2Ccond-mat%2F0407607%2Ccond-mat%2F0407634%2Ccond-mat%2F0407708%2Ccond-mat%2F0407178%2Ccond-mat%2F0407350%2Ccond-mat%2F0407481%2Ccond-mat%2F0407086%2Ccond-mat%2F0407668%2Ccond-mat%2F0407066%2Ccond-mat%2F0407760%2Ccond-mat%2F0407379%2Ccond-mat%2F0407421%2Ccond-mat%2F0407198%2Ccond-mat%2F0407721%2Ccond-mat%2F0407557%2Ccond-mat%2F0407271%2Ccond-mat%2F0407470%2Ccond-mat%2F0407808%2Ccond-mat%2F0407238%2Ccond-mat%2F0407008%2Ccond-mat%2F0407793%2Ccond-mat%2F0407073%2Ccond-mat%2F0407453%2Ccond-mat%2F0407258%2Ccond-mat%2F0407515%2Ccond-mat%2F0407679%2Ccond-mat%2F0407624%2Ccond-mat%2F0407385%2Ccond-mat%2F0407097%2Ccond-mat%2F0407304%2Ccond-mat%2F0407023%2Ccond-mat%2F0407689%2Ccond-mat%2F0407013%2Ccond-mat%2F0407005%2Ccond-mat%2F0407376%2Ccond-mat%2F0407755%2Ccond-mat%2F0407480%2Ccond-mat%2F0407807%2Ccond-mat%2F0407129%2Ccond-mat%2F0407349%2Ccond-mat%2F0407231%2Ccond-mat%2F0407798%2Ccond-mat%2F0407502%2Ccond-mat%2F0407754%2Ccond-mat%2F0407416%2Ccond-mat%2F0407503%2Ccond-mat%2F0407735%2Ccond-mat%2F0407185%2Ccond-mat%2F0407578%2Ccond-mat%2F0407454%2Ccond-mat%2F0407235%2Ccond-mat%2F0407410%2Ccond-mat%2F0407006%2Ccond-mat%2F0407593%2Ccond-mat%2F0407563%2Ccond-mat%2F0407599%2Ccond-mat%2F0407524%2Ccond-mat%2F0407702%2Ccond-mat%2F0407651%2Ccond-mat%2F0407520%2Ccond-mat%2F0407705%2Ccond-mat%2F0407250%2Ccond-mat%2F0407636%2Ccond-mat%2F0407623%2Ccond-mat%2F0407139%2Ccond-mat%2F0407017%2Ccond-mat%2F0407056%2Ccond-mat%2F0407499%2Ccond-mat%2F0407135%2Ccond-mat%2F0407483%2Ccond-mat%2F0407018&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A new acceleration algorithm to address the problem of multiple time scales\nin variational Monte Carlo simulations is presented. After a first attempted\nmove has been rejected, the delayed rejection algorithm attempts a second move\nwith a smaller time step, so that even moves of the core electrons can be\naccepted. Results on Be and Ne atoms as test cases are presented. Correlation\ntime and both average accepted displacement and acceptance ratio as a function\nof the distance from the nucleus evidence the efficiency of the proposed\nalgorithm in dealing with the multiple time scales problem."}, "authors": ["Dario Bressanini", "Gabriele Morosi", "Silvia Tarasco", "Antonietta Mira"], "author_detail": {"name": "Antonietta Mira"}, "author": "Antonietta Mira", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.1775789", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0407513v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0407513v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "To be published on the Journal of Chemical Physics", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0407513v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0407513v1", "journal_reference": null, "doi": "10.1063/1.1775789", "fulltext": "Delayed Rejection Variational Monte Carlo\nDario Bressanini 1 ,Gabriele Morosi2 , and Silvia Tarasco 3\nDipartimento di Scienze Chimiche ed Ambientali, Universita' dell'Insubria, Sede di Como, via Lucini\n3, 22100 Como, Italy\n\nAntonietta Mira 4\nDipartimento di Economia, Universita' dell'Insubria, Sede di Varese, via Ravasi 2, 21100 Varese,\nItaly\n\nAbstract\nA new acceleration algorithm to address the problem of multiple time scales in variational Monte\nCarlo simulations is presented. After a first attempted move has been rejected, the delayed rejection\nalgorithm attempts a second move with a smaller time step, so that even moves of the core electrons\ncan be accepted. Results on Be and Ne atoms as test cases are presented. Correlation time and both\naverage accepted displacement and acceptance ratio as a function of the distance from the nucleus\nevidence the efficiency of the proposed algorithm in dealing with the multiple time scales problem.\n\n1\n\nElectronic address: Dario.Bressanini@uninsubria.it\n\n2\n\nElectronic address: Gabriele.Morosi@uninsubria.it\n\n3\n\nElectronic address: Silvia.Tarasco@uninsubria.it\n\n4\n\nElectronic address: Antonietta.Mira@uninsubria.it\n\n1\n\n\fINTRODUCTION\nVariational Monte Carlo (VMC) has become an important techniq ue in quantum chemistry.\nWhen analytical integration is not available, it allows the computation of expectation values of an\narbitrary trial wave function1 with no restriction on its functional complexity. The trial wave\nfunction can include explicit two-body and higher-order correlation terms, allowing a better\ndescription of many body interactions and thus higher accuracy. The optimization of the variational\nparameters can be done by minimizing the energy2-5 , the energy variance6-9 or the mean absolute\ndeviation of the local energy10 . Nevertheless, the main problem of any stochastic method is the need\nof reducing the statistical uncertainty on the calculated quantities. For this reason al rge systems\npresent a computational challenge: in particular, Monte Carlo, as all total energy methods, suffers of\nscaling problems : an increase of the size of the system gives rise to an explosion in the\ncomputational cost, proportional to (often) large powers of the system size. This large-power\npolynomial scaling is surely preferable to the computational exponential dependency on the system\nsize of NP problems; nevertheless, it prevents the treatment of many physically interesting large\nsystems.\nAnother drawback is that systems containing atoms of large atomic number (Z) would require\ndifferent time steps in order to efficiently sample both the regions close and far away from the\nnuclei: this problem is referred to as the multiple time scales problem. Core electrons require a\nsmaller time step than valence electrons. This causes an intrinsic algorithmic inefficiency since the\nstandard Metropolis algorithm assigns the same time step to all the electrons. Thus sampling in the\nregion close to the nucleus is the bottleneck of VMC simulations. Although Monte Carlo methods\nscale well with N, they show a poor scaling with the atomic number Z; CPU time is estimated to\nscale with Z5.5 or Z6.5.\nAnalysing the standard Monte Carlo algorithm, Bressanini and Reynolds11 showed that the\noptimal move size is a trade-off between the best move size for electrons far from the nucleus (i.e.\n2\n\n\fvalence electrons), which needs to be large since the accessible region of configuration space is\nvery large, and the best move size for the electrons close to the nucleus (i.e. core electrons). These\nlatter moves must be small, since the relevant region of configuration space is quite limited, and\nalso because the wave function changes rapidly near the nucleus, meaning that large moves would\ncause a high rejection rate.\nAcceleration algorithms have been suggested to cope with the multiple time scale problem.\nBelohrec et al.12 proposed the \"split-tau\" technique, that is they used different time scales for\ndifferent shells, dividing the electrons into shells on the basis of their distance from the nucleus.\nTrying to assign a different time step (and so a different time scale) to different electrons does not\nwork. Given a symmetric or antisymmetric wave function, two identical particles (here like-spin\nelectrons) can exchange positions without changing the probability of the configuration. Thus,\nassigning larger time steps to electrons starting out in the valence region at the beginning of the\nsimulation would not accomplish the goal, since ultimately such electrons exchange their positions\nwith inner electrons, with no energy penalty. Once this happens, the electrons take inappropriate\nstep sizes and detailed balance is no more satisfied. In formulating their \"split-tau\" technique,\nBelohrec et al.12 had to assume that the exchange between shells is negligible. However, Sun et al.13\nresults do not support this hypothesis, showing that it is true only for very small time steps, that is\nfor very inefficient simulations.\nUmrigar14 proposed the factorization of the transition matrix in radial and angular parts. The\noverall move is large, but the nearer the electron is to the nucleus, the more its angular move is\nincreased reducing the radial move and so increasing the acceptance probability. Sun et al.13\nshowed that the addition of a simplified quadratic approximation to the wave function to sample the\nelectron displacement automatically reduces the step size of the core electrons defined by the linear\napproximation, i.e., by the quantum force. Mella et al.15 used a transition matrix in which the time\nstep depends on the actual position of the electron: a suitable choice allows the control of the effect\nof the quantum force near the nucleus and near the nodal surfaces. Bressanini and Reynolds11\n3\n\n\fshowed that, after partitioning the space into equivalent subspaces, it is possible to choose\nindependent sampling times for core and valence electrons.\nNevertheless, none of the above mentioned approaches is general. Some of these solutions are\nimpossible to generalize, while others are very difficult to implement.\nHere we propose a simple algorithm, easy to implement, completely general and that allows to\nsensibly improve the sampling.\n\nOVERVIEW OF VMC\nSince very detailed descriptions of VMC are available elsewhere16 , we only give a short resume.\nVMC allows to sample a distribution proportional to ΨT2 ( R) , where ΨT (R) is a trial wave\nfunction. From such a distribution expectation values of non-differential operators can be obtained\nsimply by:\n\nOˆ =\n\n∫ Ψ ( R )Oˆ ( R ) d R\n∫ Ψ (R )dR\n2\nT\n\n2\nT\n\n1\n≅\nN\n\nN\n\n∑ Oˆ ( R )\ni\n\ni =1\n\n(1)\n\nDifferential operators can also be simply treated, by writing\n\nOˆ =\n\nOˆ ΨT ( R)\ndR\nΨT (R )\n1\n≅\n2\nN\n∫ ΨT (R)dR\n\n2\n∫ ΨT (R)\n\nOˆ ΨT ( Ri )\n∑\ni =1 ΨT ( R i )\nN\n\n(2)\n\nThe problem reduces to sample efficiently a distribution proportional to ΨT2 ( R) . A set of\nwalkers at positions R 'i is displaced to new positions R i by moving each walker. In the standard\nv\nMetropolis algorithm a step is gene rated by \"box sampling\", that is R = R ' + ξ∆ , with ∆ the step\nr\nv\nsize and ξ a 3-N dimensional vector of uniformly distributed random numbers ξ ∈ [− 0.5,+0.5] .\n\n(\n\n)\n\nThis move is followed by the classical Metropolis accept/reject step, in which ΨT ( R) ΨT (R ' ) is\n4\n\n2\n\n\fcompared to a uniformly distributed random number between zero and one. The move is accepted\nonly if the squared ratio of trial functions exceeds the random number, otherwise the old position is\nretained. This is one step of the Markov chain. Under very general conditions, this chain results in\nan asymptotic equilibrium distribution proportional to ΨT2 ( R) .\nThe sampling can be improved using the Langevin sampling algorithm. This scheme is a\nv\n\ngeneralization of the Metropolis sampling in which a Langevin equation R = R ' + DτF (R ' ) + χ ,\nv\ncontaining drift and diffusion (i.e. a \"quantum\" force F(R') and a white noise χ , a Gaussian\nrandom variable with a mean value of zero and a standard deviation 2Dτ), is employed. The\nquantum force depends on the position, but the overall attempted move is still determined by the\ntime step. Once again, the use of a single time step for all electrons implies a kind of negotiation\nbetween valence and core electrons.\n\nDELAYED REJECTION MONTE CARLO\nTuning the time step of the Metropolis algorithm is not an easy task. As previously outlined,\nthere is a trade-off between the time-step and the acceptance ratio of the corresponding proposed\nmove. Furthermore, if we move one electron at a time (local moves), the \"optimal\" time step for\neach move depends on the distance of the electron from the nucleus: the closer a particle is to the\nnucleus (core region), the smaller the time step should be.\nThe origin of our proposal is the simple observation that, using the same time step, core-electron\nmoves are rejected more than valence-electron moves. The previously proposed acceleration\ntechniques tried to prevent this rejection, the delayed rejection algorithm, instead, uses this\ninformation and tries a second stage proposals to improve the sampling by the Metropolis and\nLangevin algorithms.\n\n5\n\n\fThe delayed rejection strategy\nIn a generalized Metropolis algorithm, one samples π( R) = ΨT ( R) 2 by constructing a Markov\nchain. Given the current position of the chain at the n-th step, R ( n ) = R' , a candidate move R 1\nduring a time step τ1 is generated by a given transition probability T1 ( R' → R1 ;τ1 ) . The proposed\nmove is accepted with probability\n π ( R1 )T1 (R1 → R';τ1 ) \nP1 ( R', R1 ) = min 1,\n\n π (R' )T1 (R '→ R1 ;τ1 ) \n\n(3)\n\nso that detailed balance with respect to π (R) , and thus stationarity, is preserved.\nIf the move is accepted, the simulation time is advanced and the chain position is updated:\nR ( n +1) = R1 .\n\nSo far the updating mechanism of the Markov chain is just like the one used for a regular\nMetropolis algorithm. In the delayed rejection algorithm the difference is in what happens upon\nrejection of the candidate move. In the Metropolis scheme, upon rejection the simulation time is\nadvanced and the current position is retained: R ( n +1) = R (n ) = R ' . Although remaining in the current\nstate contributes to preserve the stationary distribution through detailed balance, intuitively it\nincreases autocorrelation in the realized chain and thus reduces the efficiency of the resulting\nestimators. Substance is given to this intuition by a result stated, and proved for the case of a finite\nstate space, by Peskun17 ; a proof for general state spaces was given by Tierney18 . Given two\nMarkov chains with stationary distribution π, T1 and T2 being the corresponding transition matrices,\nT1 is more efficient than T2 (in the sense of reducing the asymptotic variance of the resulting\nestimators and thus the autocorrelation time, for any stochastic variable X) if\nT1 ( R' → R ) ≥ T2 (R ' → R) ∀R ≠ R′\n\n(4)\n\nIn other words, the higher the probability of moving away from the current position, the better\nthe efficiency. Following this intuition, in the delayed rejection strategy19 , upon rejection of a first\n6\n\n\fstage candidate move R1 , a second stage candidate move, R2 , is proposed by generating it from a\n\n(\n\n)\n\n(\n\ndifferent transition probability T2 R ' → R 2 ;τ 2 . Now the transition probability T2 R ' → R 2 ;τ 2\n\n)\n\nis allowed to depend on the rejected value at the first stage. To cope with the multiple time step\nproblem, a time step τ2 can now be chosen shorter than the one previously used. In order to\nmaintain the reversibility condition and to preserve the stationary distribution, the acceptance\nprobability of the new candidate move must be adjusted as\n π( R 2 )T1 ( R2 → R1 ; τ1 ) (1 − P1 ( R 2 , R1 ) )T2 ( R 2 → R ' ; τ2 ) \nP2 ( R' , R1 , R2 ) = min 1,\n\n π( R' )T1 (R ' → R1 ; τ1 ) (1 − P1 (R ' , R1 ) )T2 ( R' → R2 ; τ2 ) \n\n(5)\n\nto preserve the detailed balance condition. If R 2 is accepted, we set R ( n +1) = R 2 . Otherwise the\ndelayed rejection process can either be interrupted by setting R ( n +1) = R (n ) = R ' , or continued with\nhigher stage proposals using an iterative formula for the acceptance probability20 . Since the\nacceptance probabilities preserve detailed balance separately at each stage, hybrid strategies can\nalso be considered: upon rejection a coin is tossed and depending on the result the delayed rejection\nprocess is either continued or interrupted. The second attempted move reduces the overall\nprobability of remaining in the current state. It can be proved19 that an algorithm with delayed\nrejection dominates, in the Peskun sense, the corresponding standard algorithm. This is true for\nMetropolis as well as for Langevin algorithms. The autocorrelation time for any stochastic variable\nX is reduced by adding one or more delayed rejection steps. Taking different transition probabilities\ncorresponding, for example, to two different time steps τ1 〉 τ 2 allows moving particles far from the\nnucleus at the first stage and particles in the core at the second stage. Both moves can either be local\n(one electron at a time) or global (all electrons at once). In a similar way the delayed rejection\nstrategy can be used to combine global (first stage) with local mo ves (second stage): again global\nmoves are less likely to be accepted, but faster to perform from a computational point of view. The\nusefulness of the delayed rejection algorithm depends on whether the obtained reduction in variance\n\n7\n\n\fcompensated for the additional computational cost.\n\nRESULTS AND DISCUSSION\nOur main goal introducing the delayed rejection algorithm in VMC is to improve the efficiency\nof the method, allowing the electrons to move both near the core and far from it. So, as test cases\nwe chose Be and Ne atoms to compare the effect of different Z values. In particular Ne was studied\nby Sun et al.21 , Mella et al.15 , and Bressanini and Reynolds\n\n11\n\n, so our results can be compared with\n\nthose of different acceleration algorithms. The efficiency is measured by the asymptotic variance of\nthe estimator of the quantity of interest (typically the local energy E(R)), with respect to a\ndistribution π (R) known up to a normalizing constant. Since the estimator is the average of the\nsampled values Ei along the Markov chain, its asymptotic variance is the sum of the\nautocorrelations of Ei along such path. So, the autocorrelation time of the local energy can be\nconsidered a natural measure of efficiency. It is related to the time one needs to obtain decorrelated\nmeasures of the observable and the smaller it is, the more efficient is the algorithm. The\nautocorrelation time depends both on the sampling inefficiency of the algorithm and on the trial\nwave function through the fluctuations of the local energy. Thus, in order to make comparisons with\ndifferent sampling methods, one must use the same trial wave function. In this work a simple SCF\nwave function multiplied by an electron-electron Jastrow factor was chosen. The Clementi and\nRoetti basis set22 was employed for Be atom, while for Ne atom a DZ basis set was optimized.\nSimulations were performed with different time steps, trying to minimize the energy autocorrelation\ntime. The autocorrelation time is a \"macroscopic\" measure21 of the simulation efficiency, it\nprovides information on long term, accumulated effects. To investigate the problem of the multiple\ntime scales, a \"microscopic\" analysis is more informative. The space around the nucleus was\ndivided in spherical she lls and the acceptance ratio and the mean accepted displacement in each\nshell was estimated. First of all, the electron displacement was evaluated for the standard\n8\n\n\fMetropolis algorithm, in which the move is accepted or rejected only when all electrons have\nmoved to new positions. Since in the delayed rejection algorithm each electron moves\nindependently of the others, also the results obtained with a standard Metropolis algorithm, but\nmoving one electron at a time, were examined. Then this analysis was repeated using the standard\nLangevin algorithm, again moving all electrons at once and one electron at a time.\nThe delayed rejection algorithm was implemented within the framework of both Metropolis and\nLangevin algorithms. A comparison between the results obtained by our algorithm and the standard\nones, both moving all electrons at once and one electron at a time is now presented.\nLet us begin discussing the autocorrelation time of the local energy, the \"macroscopic\" measure\nof the efficiency of a sampling algorithm The correlation times for simulations using the different\nalgorithms are reported in Table 1 for Be and in Table 2 for Ne. The time steps are those that\nminimize the correlation time. For comparable correlation times the Ne time steps are shorter than\nfor Be, the more compact is the atomic core the shorter must be the move. Moving one electron at a\ntime allows longer time steps, due to the possibility of electrons to move independently, and is more\nefficient than moving all electrons at once, a well known fact. The Langevin sampling is more\nefficient than the Metropolis one as a consequence of the effect of the quantum force on the electron\nmove. For single electron moves the best time steps are equal for Langevin and Metropolis\nsampling, but the Langevin correlation time is smaller. The delayed rejection algorithm further on\nimproves the efficiency both of Metropolis and Langevin Monte Carlo, for Ne the correlation time\nis halved. The first time step is more than twice the corresponding value in absence of delayed\nrejection, improving the sampling of the valence space. The time step for the second move is one\norder of magnitude smaller than the first one, so also the core space is efficiently sampled. The\ndecrease of the second time step with respect to the first one is larger for Ne than for Be, due to the\npresence of a more compact atomic core that requires shorter time steps to sample the core region.\nIn the following \"microscopic\" analysis we will discuss only the Ne case, as the results for Be\nand Ne are similar, but the effect of the delayed rejection algorithm is more evident for Ne. The\n9\n\n\fnumber of attempted and accepted moves for the delayed rejection Langevin simulation with\n1 =0.03\n\nhartree-1 and\n\n2 =0.007\n\nhartree-1 as function of the distance from the nucleus are shown in\n\nFig. 1. The attempted move distribution at the first step obviously reproduces the electron density of\nthe Ne atom with its shell structure. For r>1.4 bohr nearly all attempted moves are accepted, but for\nshorter distances the number of accepted moves goes quickly to zero. The second step allows to\nrecover a substantial fraction of the rejected moves. A similar plot for delayed rejection Metropolis\nevidences a minor number of accepted moves at the first step in the valence region, but a larger\nnumber at the second step in the core space. This result prompted us to perform the first step with\nthe Langevin algorithm and the second step with the Metropolis one. This sampling points out the\nfreedom in choosing the transition probability at the second step within the delayed rejection\nmethod. However, in this simulation the correlation time, reported in Table 2, is higher than the one\nfound when both steps use Langevin sampling. This result evidences the interplay between T1 and\nT2 in Eq. 5 in determining the overall acceptance: the Langevin T1 is lower than the Metropolis T1 ,\ndecreasing the probability of the second move to be accepted.\nThe acceptance ratio and the mean accepted displacement as function of the distance from the\nnucleus for the delayed rejection Metropolis algorithm are reported in Figures 2 and 3. The average\nacceptance ratios for the two moves with\n\n1\n\n= 0.07 hartree-1 and\n\n2=\n\n0.005 hartree-1 are\n\nrespectively 50% and 66%. In the same Figures the results for two simulations with standard\nMetropolis algorithm moving one electron at a time and time steps\n\n= 0.07 hartree-1 and\n\nhartree-1 respectively are also reported for comparison. The acceptance ratio for\n\n= 0.005\n\n= 0.07 hartree-1\n\nobviously overlaps the acceptance ratio of the first time step of the delayed rejection algorithm. It is\nclose to zero in the region near the nucleus, then it rises until reaching a constant value of about\n60%. The acceptance ratio for the second time step\n\n= 0.005 hartree-1 of the delayed rejection\n\nalgorithm overlaps the acceptance ratio of the standard Metropolis algorithm with the same time\nstep near the nucleus, while at larger distances it stabilizes at lower values, anyway around 80%, as\nthe acceptance is defined by Eq. 5 instead of Eq. 3. Overall, the acceptance ratio is different from\n10\n\n\fzero also in the core region. The effect of the delayed rejection algorithm is better shown by the\naverage displacement\nfirst step\n\n∆R\n\n∆R\n\nas function of the distance from the nucleus (see Fig. 3). During the\n\nis relevant only in the valence region and goes to zero near the nucleus. The second\n\nstep causes the electron to move in the core region, but it slightly affects also the displacement in\nthe valence region. In fact, only in few cases electrons try the second move, because of the high\nacceptance ratio at the first step. So the average displacement is affected mainly by the first time\nstep in the valence region and by the second one in the core region. Overall, the global average\ndisplacement is larger than the ∆R of the standard Metropolis algorithm at every distance from\nthe nucleus.\nFigures 4 and 5 are similar to Figures 2 and 3, but now the algorithm is the delayed rejection\nLangevin. The time steps chosen in order to minimize the energy correlation time are 0.07 and\n0.003 hartree-1 respectively for the first and the second step, while the global acceptance ratios are\n82% and 49%. Again as before the electron displacement is dominated in the core by the smaller\ntime step move and in the valence by the larger one. Overall, ∆R is larger than the displacement\nof the standard Langevin sampling at any distance from the nucleus.\nThanks to the improved efficiency in sampling the whole space, ergodicity is guaranteed also in\nthe core region. This is an important result, since a better local sampling allows a greater confidence\nin evaluating properties largely dependent on the electron density in the core region.\nObviously, the delayed rejection algorithm, despite the improvement in the autocorrelation time,\nrequires more CPU time with respect to the standard algorithms: this is due to the fact that for each\nrejected step another move is tried, causing a new evaluation of the wave function, its gradient and\nits Laplacian. The time needed for a delayed rejection simulation is between 20% and 40% longer\nthan the time of a standard one electron at a time simulation. Nevertheless, this drawback is more\nthan rewarded by the improvement in the autocorrelation time and by the better sampling of the\ncore region.\n11\n\n\fA comparison of our results on Ne with previously proposed acceleration methods13-15 is not\neasy as different wave functions were adopted as well as different time steps. Umrigar by his\nspherical polar coordinate directed Metropolis method14 got a significant reduction of the\ncorrelation time, but he did not perform a \"microscopic\" analysis, so it is difficult to judge how\nmuch the improvement depends on a correct sampling of the core region. Sun et al. method13\nslightly improves the mean accepted displacement at short distances from the nucleus, but the ir best\ntime step 0.03 hartree-1 allows a rather poor sampling of the valence space. Slightly better values for\nthe mean accepted displacement in the core region are computed by Mella et al.15 . For\n\n= 0.07\n\nhartree-1 their improved transition matrix gives Tcorr = 6.65(3), while the corresponding delayed\nrejection value is 3.5. All these methods improve the sampling with a negligible increase of CPU\ntime, while the computational cost of the delayed rejection algorithm is higher. One might\nimplement the delayed rejection method on one of these acceleration algorithms to further improve\ntheir performance, trying to recover the rejected moves.\nThe delayed rejection algorithm might be also effective in Langevin simulations when the\nquantum force F(R) becomes very large, that is when a walker is near a nodal surface or in atomic\ncluster simulations as atoms coalesce23 . Then the attempted move and therefore the transition\nprobability T1 (R' R,ô1 ) are very large, while T1 (R R',ô1 ) is much smaller. In this case the\nattempted move is very likely to be rejected and the walker gets trapped. Imposing an arbitrary\ncutoff on F(R) might bias the simulation, even if the probability for a walker to move to a position\nwhere the value of F(R) is extremely large is very low. Instead, a second attempted move with a\nshorter time step ô2 has the effect of reducing the contribution of the drift on the attempted move,\neven if, owing to the very hight value F(R) might assume, the reduction of the time step should be\nsubstantial.\n\n12\n\n\fConclusions\nWe have proposed the delayed rejection algorithm to cope with the multiple time scale problem.\nThe second step, after the first one has been rejected, can be realized with a different transition\nmatrix, for example by using a smaller time step, and so allowing the motion of the core electrons\nalmost as efficiently as the valence electrons. Applications of this method to Metropolis and\nLangevin sampling of Be and Ne atoms succeeded in improving the sampling of the core region,\nresulting in a reduction of the correlation time. This method is completely general and can be used\nwith any Monte Carlo application that requires acceleration of the sampling algorithm.\n\nAcknowledgments\nThis work has been done in the framework of a project financed by the University of Insubria.\n\n13\n\n\fReferences\n1\n\nD. Bressanini and P. J. Reynolds, in Monte Carlo Methods in Chemical Physics, edited by D. M. Ferguson, J.\nI. Siepmann, and D. G. Truhlar (Wiley, New York, 1999), Vol. 105, p. 37.\n\n2\n\nX. Lin, H. K. Zhang, and A. M. Rappe, J. Chem. Phys. 112, 2650 (2000).\n\n3\n\nM. Casalegno, M. Mella, and A. M. Rappe, J. Chem. Phys. 118, 7193 (2003).\n\n4\n\nF. Schautz and S. Fahy, J. Chem. Phys. 116, 3533 (2002).\n\n5\n\nD. Prendergast, D. Bevan, and S. Fahy, Phys. Rev. B 66 (2002).\n\n6\n\nD. H. Weinstein, Proc. Natl. Acad. Sci. USA 20, 529 (1934).\n\n7\n\nJ. H. Bartlett, Jr., , J. J. Gibbons, Jr., , and C. G. Dunn, Phys. Rev. 47, 679 (1935).\n\n8\n\nA. A. Frost, J. Chem. Phys. 10, 240 (1942).\n\n9\n\nH. Conroy, J. Chem. Phys. 41, 1336 (1964).\n\n10\n\nD. Bressanini, G. Morosi, and M. Mella, J. Chem. Phys. 116, 5345 (2002).\n\n11\n\nD. Bressanini and P. J. Reynolds, J. Chem. Phys. 111, 6180 (1999).\n\n12\n\nP. Belohorec, S. M. Rothstein, and J. Vrbik, J. Chem. Phys. 98, 6401 (1993).\n\n13\n\nZ. Sun, M. M. Soto, R. N. Barnett, and W. A. Lester, Jr., J. Chem. Phys. 101, 394 (1994).\n\n14\n\nC. J. Umrigar, Phys. Rev. Lett. 71, 408 (1993).\n\n15\n\nM. Mella, A. Luchow, and J. B. Anderson, Chem. Phys. Lett. 265, 467 (1997).\n\n16\n\nB. L. Hammond, W. A. Lester, Jr., and P. J. Reynolds, Monte Carlo methods in ab initio quantum chemistry,\n1st ed. (World Scientific, Singapore, 1994).\n\n17\n\nP. H. Peskun, Biometrika 60, 607 (1973).\n\n14\n\n\f18\n\nL. Tierney, Annals of Applied Probability 8, 1 (1998).\n\n19\n\nL. Tierney and A. Mira, Statistics in Medicine 18, 2507 (1999).\n\n20\n\nA. Mira, Statistical Science 16, 340 (2001).\n\n21\n\nZ. W. Sun, M. M. Solo, and W. A. Lester, J. Chem. Phys. 100, 1278 (1994).\n\n22\n\nE. Clementi and C. Roetti, At. Data and Nucl. Data Tables 14, 177 (1974).\n\n23\n\nR. N. Barnett and K. B. Whaley, Physical Review A (Atomic, Molecular, and Optical Physics) 47, 4082\n(1993).\n\n15\n\n\fTABLE 1. Time to decorrelate moves for Be with various algorithms. τ in hartree-1 , while\ncorrelation time is dimensionless.\n\nAlgorithm\n\nτ1\n\nMetropolis\n\n0.03\n\n20\n\nMetropolis: individual electron moves\n\n0.1\n\n15\n\nMetropolis with delayed rejection\n\n0.07\n\nLangevin\n\n0.07\n\n8\n\nLangevin: individual electron moves\n\n0.1\n\n7\n\nLangevin with delayed rejection\n\n0.1\n\n16\n\nτ2\n\n0.01\n\n0.03\n\nCorrelation time\n\n9\n\n5\n\n\fTABLE 2. Time to decorrelate moves for Ne with various algorithms. τ in hartree-1 , while\ncorrelation time is dimensionless.\n\nAlgorithm\n\nτ1\n\nMetropolis\n\n0.003\n\n50\n\nMetropolis: individual electron moves\n\n0.05\n\n10\n\nMetropolis with delayed rejection\n\n0.12\n\nLangevin\n\n0.01\n\n25\n\nLangevin: individual electron moves\n\n0.03\n\n7\n\nLangevin with delayed rejection\n\n0.07\n\n0.003\n\n3.5\n\nLangevin first move\n\n0.07\n\n0.005\n\n4.5\n\nMetropolis second move\n\n17\n\nτ2\n\n0.005\n\nCorrelation time\n\n5.5\n\n\fCaptions\n\nFIG. 1. Number of attempted and accepted moves (arbitrary scale) for Ne as function of the\ndistance from the nucleus. The algorithm is Delayed Rejection Langevin with τ1 =0.03 hartree-1 and\nτ2 =0.007 hartree-1 moving one electron at a time.\n\nFIG. 2. The acceptance ratio for Ne as function of the distance from the nucleus. The algorithms\nare standard Metropolis (M) and Delayed Rejection Metropolis (DR).\n\nFIG. 3. The mean accepted displacement for Ne as function of the distance from the nucleus. The\nalgorithms are standard Metropolis (M) and Delayed Rejection Metropolis (DR) moving one\nelectron at a time.\n\nFIG. 4. The acceptance ratio for Ne as function of the distance from the nucleus. The algorithm\nis Delayed Rejection (DR) Langevin moving one electron at a time.\n\nFIG. 5. Mean accepted displacements for Ne as function of the distance from the nucleus. The\nalgorithm is Delayed Rejection (DR) Langevin moving one electron at a time.\n\n18\n\n\fBressanini et al. Figure 1\n\nattempted moves\naccepted: 1st step\naccepted: 2n d step\n\n0\n\n0.4\n\n0.8\n1.2\nr (b ohr)\n\n1.6\n\n2\n\n19\n\n\fBressanini et al. Figure 2\n\n0.4\nM τ =0.07\n\n<∆R> (bohr)\n\nM τ =0.005\nDR\n\n0.3\n\nDR τ 1=0 .07\nDR τ 2=0 .005\n\n0.2\n\n0.1\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nr (boh r)\n\n20\n\n\fBressanini et al. Figure 3\n\nAcceptance ratio (%)\n\n100\n\n80\n60\n\n40\n\nM τ =0.07\nM τ =0.005\n\n20\n\nDR τ 1=0.07\nDR τ 2=0.005\n\n0\n0\n\n0.2\n\n0.4\n0.6\nr (bohr)\n\n0.8\n\n1\n\n21\n\n\fBressanini et al. Figure 4\n\nA cceptance ratio (%)\n\n100\n\n80\n\n60\n40\nDR τ 1=0.07\n\n20\n\nDR τ 2=0.003\n\n0\n0\n\n0.2\n\n0.4\n0.6\nr (bohr)\n\n0.8\n\n1\n\n22\n\n\fBressanini et al. Figure 5\n0.5\nDR\nDR τ 1= 0.07\n\n< ∆R> (bohr)\n\n0.4\n\nDR τ 2= 0.003\n\n0.3\n0.2\n0.1\n\n0\n0\n\n0.2\n\n0.4\n0.6\nr (bohr)\n\n0.8\n\n1\n\n23\n\n\f"}