{"id": "http://arxiv.org/abs/cond-mat/0312621v3", "guidislink": true, "updated": "2004-10-22T18:22:50Z", "updated_parsed": [2004, 10, 22, 18, 22, 50, 4, 296, 0], "published": "2003-12-23T23:46:59Z", "published_parsed": [2003, 12, 23, 23, 46, 59, 1, 357, 0], "title": "Fluctuations, line tensions, and correlation times of nanoscale islands\n  on surfaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0312045%2Ccond-mat%2F0312362%2Ccond-mat%2F0312093%2Ccond-mat%2F0312331%2Ccond-mat%2F0312660%2Ccond-mat%2F0312032%2Ccond-mat%2F0312646%2Ccond-mat%2F0312195%2Ccond-mat%2F0312419%2Ccond-mat%2F0312159%2Ccond-mat%2F0312181%2Ccond-mat%2F0312235%2Ccond-mat%2F0312597%2Ccond-mat%2F0312299%2Ccond-mat%2F0312359%2Ccond-mat%2F0312638%2Ccond-mat%2F0312605%2Ccond-mat%2F0312134%2Ccond-mat%2F0312076%2Ccond-mat%2F0312469%2Ccond-mat%2F0312013%2Ccond-mat%2F0312412%2Ccond-mat%2F0312114%2Ccond-mat%2F0312284%2Ccond-mat%2F0312275%2Ccond-mat%2F0312153%2Ccond-mat%2F0312184%2Ccond-mat%2F0312306%2Ccond-mat%2F0312367%2Ccond-mat%2F0312606%2Ccond-mat%2F0312458%2Ccond-mat%2F0312721%2Ccond-mat%2F0312445%2Ccond-mat%2F0312151%2Ccond-mat%2F0312461%2Ccond-mat%2F0312116%2Ccond-mat%2F0312616%2Ccond-mat%2F0312629%2Ccond-mat%2F0312259%2Ccond-mat%2F0312436%2Ccond-mat%2F0312058%2Ccond-mat%2F0312282%2Ccond-mat%2F0312699%2Ccond-mat%2F0312010%2Ccond-mat%2F0312392%2Ccond-mat%2F0312566%2Ccond-mat%2F0312337%2Ccond-mat%2F0312302%2Ccond-mat%2F0312634%2Ccond-mat%2F0312404%2Ccond-mat%2F0312298%2Ccond-mat%2F0312595%2Ccond-mat%2F0312460%2Ccond-mat%2F0312353%2Ccond-mat%2F0312223%2Ccond-mat%2F0312087%2Ccond-mat%2F0312701%2Ccond-mat%2F0312165%2Ccond-mat%2F0312131%2Ccond-mat%2F0312035%2Ccond-mat%2F0312486%2Ccond-mat%2F0312208%2Ccond-mat%2F0312669%2Ccond-mat%2F0312287%2Ccond-mat%2F0312041%2Ccond-mat%2F0312664%2Ccond-mat%2F0312621%2Ccond-mat%2F0312057%2Ccond-mat%2F0312599%2Ccond-mat%2F0312152%2Ccond-mat%2F0312092%2Ccond-mat%2F0312168%2Ccond-mat%2F0312503%2Ccond-mat%2F0312079%2Ccond-mat%2F0312127%2Ccond-mat%2F0312231%2Ccond-mat%2F0312173%2Ccond-mat%2F0312189%2Ccond-mat%2F0312516%2Ccond-mat%2F0312266%2Ccond-mat%2F0312129%2Ccond-mat%2F0312402%2Ccond-mat%2F0312708%2Ccond-mat%2F0312104%2Ccond-mat%2F0312517%2Ccond-mat%2F0312199%2Ccond-mat%2F0312714%2Ccond-mat%2F0312692%2Ccond-mat%2F0312509%2Ccond-mat%2F0312262%2Ccond-mat%2F0312428%2Ccond-mat%2F0312315%2Ccond-mat%2F0312296%2Ccond-mat%2F0312582%2Ccond-mat%2F0312049%2Ccond-mat%2F0312398%2Ccond-mat%2F0312233%2Ccond-mat%2F0312283%2Ccond-mat%2F0312193%2Ccond-mat%2F0312356%2Ccond-mat%2F0312655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fluctuations, line tensions, and correlation times of nanoscale islands\n  on surfaces"}, "summary": "We analyze in detail the fluctuations and correlations of the (spatial)\nFourier modes of nano-scale single-layer islands on (111) fcc crystal surfaces.\nWe analytically show that the Fourier modes of the fluctuations couple due to\nthe anisotropy of the crystal, changing the power spectrum of the fluctuations,\nand that the actual eigenmodes of the fluctuations are the appropriate linear\ncombinations of the Fourier modes. Using kinetic Monte Carlo simulations with\nbond-counting parameters that best match realistic energy barriers for hopping\nrates, we deduce absolute line tensions as a function of azimuthal orientation\nfrom the analyses of the fluctuation of each individual mode. The\nautocorrelation functions of these modes give the scaling of the correlation\ntimes with wavelength, providing us with the rate-limiting kinetics driving the\nfluctuations, here step-edge diffusion. The results for the energetic\nparameters are in reasonable agreement with available experimental data for\nPb(111) surfaces, and we compare the correlation times of island-edge\nfluctuations to relaxation times of quenched Pb crystallites.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0312045%2Ccond-mat%2F0312362%2Ccond-mat%2F0312093%2Ccond-mat%2F0312331%2Ccond-mat%2F0312660%2Ccond-mat%2F0312032%2Ccond-mat%2F0312646%2Ccond-mat%2F0312195%2Ccond-mat%2F0312419%2Ccond-mat%2F0312159%2Ccond-mat%2F0312181%2Ccond-mat%2F0312235%2Ccond-mat%2F0312597%2Ccond-mat%2F0312299%2Ccond-mat%2F0312359%2Ccond-mat%2F0312638%2Ccond-mat%2F0312605%2Ccond-mat%2F0312134%2Ccond-mat%2F0312076%2Ccond-mat%2F0312469%2Ccond-mat%2F0312013%2Ccond-mat%2F0312412%2Ccond-mat%2F0312114%2Ccond-mat%2F0312284%2Ccond-mat%2F0312275%2Ccond-mat%2F0312153%2Ccond-mat%2F0312184%2Ccond-mat%2F0312306%2Ccond-mat%2F0312367%2Ccond-mat%2F0312606%2Ccond-mat%2F0312458%2Ccond-mat%2F0312721%2Ccond-mat%2F0312445%2Ccond-mat%2F0312151%2Ccond-mat%2F0312461%2Ccond-mat%2F0312116%2Ccond-mat%2F0312616%2Ccond-mat%2F0312629%2Ccond-mat%2F0312259%2Ccond-mat%2F0312436%2Ccond-mat%2F0312058%2Ccond-mat%2F0312282%2Ccond-mat%2F0312699%2Ccond-mat%2F0312010%2Ccond-mat%2F0312392%2Ccond-mat%2F0312566%2Ccond-mat%2F0312337%2Ccond-mat%2F0312302%2Ccond-mat%2F0312634%2Ccond-mat%2F0312404%2Ccond-mat%2F0312298%2Ccond-mat%2F0312595%2Ccond-mat%2F0312460%2Ccond-mat%2F0312353%2Ccond-mat%2F0312223%2Ccond-mat%2F0312087%2Ccond-mat%2F0312701%2Ccond-mat%2F0312165%2Ccond-mat%2F0312131%2Ccond-mat%2F0312035%2Ccond-mat%2F0312486%2Ccond-mat%2F0312208%2Ccond-mat%2F0312669%2Ccond-mat%2F0312287%2Ccond-mat%2F0312041%2Ccond-mat%2F0312664%2Ccond-mat%2F0312621%2Ccond-mat%2F0312057%2Ccond-mat%2F0312599%2Ccond-mat%2F0312152%2Ccond-mat%2F0312092%2Ccond-mat%2F0312168%2Ccond-mat%2F0312503%2Ccond-mat%2F0312079%2Ccond-mat%2F0312127%2Ccond-mat%2F0312231%2Ccond-mat%2F0312173%2Ccond-mat%2F0312189%2Ccond-mat%2F0312516%2Ccond-mat%2F0312266%2Ccond-mat%2F0312129%2Ccond-mat%2F0312402%2Ccond-mat%2F0312708%2Ccond-mat%2F0312104%2Ccond-mat%2F0312517%2Ccond-mat%2F0312199%2Ccond-mat%2F0312714%2Ccond-mat%2F0312692%2Ccond-mat%2F0312509%2Ccond-mat%2F0312262%2Ccond-mat%2F0312428%2Ccond-mat%2F0312315%2Ccond-mat%2F0312296%2Ccond-mat%2F0312582%2Ccond-mat%2F0312049%2Ccond-mat%2F0312398%2Ccond-mat%2F0312233%2Ccond-mat%2F0312283%2Ccond-mat%2F0312193%2Ccond-mat%2F0312356%2Ccond-mat%2F0312655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze in detail the fluctuations and correlations of the (spatial)\nFourier modes of nano-scale single-layer islands on (111) fcc crystal surfaces.\nWe analytically show that the Fourier modes of the fluctuations couple due to\nthe anisotropy of the crystal, changing the power spectrum of the fluctuations,\nand that the actual eigenmodes of the fluctuations are the appropriate linear\ncombinations of the Fourier modes. Using kinetic Monte Carlo simulations with\nbond-counting parameters that best match realistic energy barriers for hopping\nrates, we deduce absolute line tensions as a function of azimuthal orientation\nfrom the analyses of the fluctuation of each individual mode. The\nautocorrelation functions of these modes give the scaling of the correlation\ntimes with wavelength, providing us with the rate-limiting kinetics driving the\nfluctuations, here step-edge diffusion. The results for the energetic\nparameters are in reasonable agreement with available experimental data for\nPb(111) surfaces, and we compare the correlation times of island-edge\nfluctuations to relaxation times of quenched Pb crystallites."}, "authors": ["F. Szalma", "Hailu Gebremariam", "T. L. Einstein"], "author_detail": {"name": "T. L. Einstein"}, "author": "T. L. Einstein", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.71.035422", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0312621v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0312621v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 8 figures; to appear in PRB 70, xxx (15 Dec 2004), changes\n  in MC and its implications", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0312621v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0312621v3", "journal_reference": "Phys. Rev. B 71, 035422 [10 pp.] (2005)", "doi": "10.1103/PhysRevB.71.035422", "fulltext": "Fluctuations, line tensions, and correlation times of nanoscale islands on surfaces\nF. Szalma,1, 2, ∗ Hailu Gebremariam,1 and T.L. Einstein1, †\n1\n\nDepartment of Physics, University of Maryland, College Park MD 20742-4111\nInstitute of Theoretical Physics, Szeged University, H-6720 Szeged, Hungary\n(Dated: October 31, 2018)\n\narXiv:cond-mat/0312621v3 [cond-mat.mtrl-sci] 22 Oct 2004\n\n2\n\nWe analyze in detail the fluctuations and correlations of the (spatial) Fourier modes of nano-scale\nsingle-layer islands on (111) fcc crystal surfaces. We analytically show that the Fourier modes of\nthe fluctuations couple due to the anisotropy of the crystal, changing the power spectrum of the\nfluctuations, and that the actual eigenmodes of the fluctuations are the appropriate linear combinations of the Fourier modes. Using kinetic Monte Carlo simulations with bond-counting parameters\nthat best match realistic energy barriers for hopping rates, we deduce absolute line tensions as a\nfunction of azimuthal orientation from the analyses of the fluctuation of each individual mode. The\nautocorrelation functions of these modes give the scaling of the correlation times with wavelength,\nproviding us with the rate-limiting kinetics driving the fluctuations, here step-edge diffusion. The\nresults for the energetic parameters are in reasonable agreement with available experimental data\nfor Pb(111) surfaces, and we compare the correlation times of island-edge fluctuations to relaxation\ntimes of quenched Pb crystallites.\nPACS numbers: 68.35.Md, 05.40.-a, 87.53.Wz, 68.65.-k\n\nI.\n\nINTRODUCTION\n\nNanoscale islands consisting of 102 – 105 atoms have\ncaptured great interest over recent years for a variety\nof reasons. From a practical standpoint, they provide\na precursor to the formation of quantum dots, which,\nif assembled in a controlled way, can serve as the basic\ningredients of nano-scale electronic and mechanical devices. Many crystallites or nanomounds are best viewed\nas \"wedding-cake\"-like stacks of such islands.1 They are\nthe intermediary between a flat surface and a small threedimensional structure. In contrast to steps, which require vicinal surfaces2 that often must be well characterized over mesoscopic regions, islands can be studied in\nsmaller-scale regions that are flat only locally.\nOf particular interest to us are the shape and the fluctuations of the perimeter of these islands. The shape\nprovides information about the line tension or step free\nenergy per length, from which one can compute the step\nstiffness that describes the \"inertial\" properties of steps.\nThe \"dipole\" mode of these fluctuations are known to\nunderlie the diffusion of such islands, a concept now used\nroutinely in simulations.3,4 However, shorter-wavelength\nmodes are also of great interest, since they can be correlated with similar fluctuations of steps and provide a\nway to assess, again, the stiffness of the step and also the\nkinetic or atomistic diffusion coefficient associated with\nthe mechanism that dominates the atomistic processes\nunderlying the fluctuations. Until recently, attention was\nlimited to structures for which crystal anisotropy could\nseemingly be ignored.\nHere we pay particular attention to the role of the\ninevitable anisotropy of crystal surfaces, which around\nroom temperature or even above it is typically sufficiently\nstrong that it should apparently be taken into account in\norder to correctly characterize the morphology of the various (near) equilibrium structures appearing on surfaces\n\nand their dynamics. In this paper we focus on the line\ntension and stiffness and their orientation dependence;\nwe give an analytic method to calculating these physical\nparameters from the fluctuation of nanoscale islands.\nThe little experimental data on such systems involve\nruns of worrisome duration or use probes that provide\nscanned rather than instantaneous images. To generate fully-characterized data, we turned to kinetic Monte\nCarlo (KMC) simulations to mimic the equilibrium fluctuations of islands. These simulations are the input of\nour analytic theory which, starting from the excess free\nenergy corresponding to the capillary wave fluctuations\nof the island edge, provides the eigenmodes of these fluctuations. Since the 2D Wulff plot relating the equilibrium\nisland shape and the line tension in the azimuthal directions on the surface provides only relative line tensions for\nvarious orientations, a key problem is always the determination of the chemical potential λ of the island edge,\nwhich then produces an absolute relation. This potential can be determined with surprisingly good (∼ 10%)\naccuracy from the spectrum of the modes of the system.\nWe compare these eigenmodes and the simple Fourier\nmodes of the fluctuations and reach the (perhaps) surprising conclusion that the anisotropy only affects the\nlonger wavelength modes.\nAnother aim of the paper is to examine the correlation\nof the fluctuations of the Fourier modes and thereby to\nfind the rate-limiting process driving the fluctuations in\na fairly realistic model. For our KMC simulations we\nsought a system for which one could compute hop rates\nwith good accuracy and for which there was quantitative\nexperimental data with which to compare. Accordingly,\nwe have chosen Pb(111) so as to be able to compare with\nintriguing recent experiments by Thürmer et al.5 This\nanalysis gives the scaling of the correlation time with the\nwavelength, that is the dynamic exponent z, and provides\nus with characteristic times measured not only in MC\n\n\f2\n\nR ≈ 40\n\nRc = 80\n\nFIG. 1: (Color online) Geometry of the MC simulation. The\napproximate mean radius R of the island and the radius Rc\nof the container are illustrated.\n\nsteps, but in real time. Thus, we can compare directly\nwith experiments and extrapolate to different structures\nfrom the simple one considered here.\nUtilizing direct surface imaging techniques, especially\nscanning tunneling microscopy (STM), several attempts\nhave been made to measure and calculate step energies.\nFrom a theoretical viewpoint the various methods that\nused the experimental data for calculations can be broken\ndown into two main groups. The first is based on a lattice\nmodel which relates the island shape (radius and curvature) to the temperature dependence of the free energy\nand stiffness of the Ising model in the low-temperature\nexpansion, usually in high symmetry directions. By fitting the functional shape of the free energy with varying temperature on the experimental data determined by\nthe equilibrium island shape6 gives the Ising kink energy,\nwhich in turn provides the step energies and stiffnesses.\nHowever, limitations of the Ising model to describe surface structure have recently been noted.7\nThe other method is based on a step continuum\nmodel which makes use of stochastic differential equations to describe the fluctuations of straight steps8 or\nisland edges9,10 viewed as nearly circular closed-loop\nsteps. Thus, the initial calculations for island fluctuations assumed isotropy:11 the power spectrum of the\nFourier modes of the step fluctuations were calculated\nand adapted with appropriate modifications to nearly circular island shapes.12 If the anisotropy turns out to be\nstrong, it cannot be handled as a perturbation; a complete anisotropic calculation without any such assumptions becomes necessary.\nThis challenge was recently taken up by Khare et al.,13\nwho give an approximate form for the free energy functional and calculate the chemical potential integrating\nall the Fourier modes in the system by using the generalized equipartition theorem where the modes are buried\n\nin a sum. However, these modes are coupled, so any one\nmode missing (e.g. due to lack of experimental resolution)\nin the sum can contribute to a deviation from the precise\nvalue of the chemical potential by itself and through its\ncoupling to the other modes as well. In contrast, our approach of analyzing individual modes gives more insight\ninto the extent to which this coupling should be taken\ninto account, and provides the chemical potential in a\n(mathematically) controlled way.\nThe autocorrelation function of fluctuations of step\nedges and correlation times have been analyzed theoretically in Fourier space based on Langevin formalism,11,14\nand experimentally in the context of straight-step fluctuations on Si(111)15 and Si(001)8 surfaces for relatively\nlong wavelengths. The rate-limiting kinetics driving\nthese fluctuations are determined by the dynamic exponent, which also sets the universality class to which the\nsystem belongs.16 (The roughness exponent is believed\nto be 1/2 in our cases.) The correlation times are theoretically identical to the relaxation times (or, in some\ncases, decay times) of surface features,17,18 such as decay and near-equilibrium build-up of bulges (of either\nsign) along the step edge that also have (wave)length L.\nThree-dimensional features like mesoscopic (or smaller)\nwires on surfaces as well as the surface corrugations in\nearlier studies by Mullins,19,20 are typically described by\n1+1 dimensional models but may involve different, more\ncomplicated mechanisms driving their fluctuation or decay. We will compare and discuss these various relaxation\ntimes in the paper.\nThe paper is organized as follows: In the next section we give an analytic solution to the decoupling of the\nFourier modes of the system into the actual eigenmodes\nand recalculate the free energy functional of the edge fluctuations. The results and conclusions can be understood\nwithout the reader's going through this algebra; only the\nresult expressed in Eq. (10) is used later. In Sec. III we\nintroduce the KMC simulation and in Sec. IV use its results to calculate the chemical potential and line tension.\nIn Sec. V we calculate the correlation functions of the\nFourier modes and deduce the scaling of the correlation\ntime with length, the dynamic exponent z. We compare\nwith available experimental data for Pb(111). Sec. VI\nconcludes the paper.\n\nII.\n\nFOURIER MODES, EIGENMODES\n\nThe relationship between the equilibrium crystal shape\nand the surface tension or, in our 2D case, between the\nequilibrium island shape and the line tension of its edge\ncan be established by the minimization of the free energy\nfunctional of the island edge. The orientation-dependent\nline tension β(n) is defined as the work per unit length\nnecessary to create the ds line element with normal n\nto the perimeter. The free energy is the integral of this\nwork along the whole perimeter. The equilibrium island\nshape at a constant temperature T , number of particles\n\n\f3\nof the shape with their corresponding line tension, which\nchanges with time as the orientation of the shape element\nchanges:\nI\nF [r, ṙ, θ; t] = β(n)ds =\n\nṘ\n\nL\n\nn\nψ\n\nR\n\nL\n\nZ2π\n\u00111/2\n\u0010\ndθ (3)\n= β(ψ(θ)) (R + r)2 + (Ṙ + ṙ)2\n\nθ\n\n0\n\nΣ\n\nFIG. 2: (Color online) Schematic showing variables used to\nanalyze equilibrium island shape\n\nN , and area Σ, is determined by the minimization of the\nfree energy functional with respect to the shape with the\nconstraint that the island area is constant, typically using\nthe method of Lagrange multipliers:21\nZ\nI\nβ(n)ds − λ dσ =\nF [R, Ṙ, θ] =\nLeq\n\nΣ\n\nZ2π 2\nZ2π\n\u00111/2\n\u0010\nR\n2\n2\ndθ\n−\nλ\nβ(ψ(θ))\nR\n+\nṘ\n=\ndθ. (1)\n2\n0\n\n0\n\nHere the second line is in polar coordinates with θ\nthe polar angle and R(θ) the radius of the equilibrium\nshape. The dot denotes the differentiation with respect\nto the angle, λ is the Lagrange multiplier (which actually turns out to be the chemical potential), and ψ is\nthe angle which characterizes the vector normal to the\nshape (see Fig. 2). ds and dσ are the line element and\nsurface element, respectively. Formally minimizing the\nF = F [R, Ṙ, θ] functional, the Euler-Lagrange equation\ngives a relation between the equilibrium island shape\nR(θ) and the orientation dependent line tension, β(ψ),\nand between the two angles involved: ψ which depends\non the polar angle and the equilibrium shape.13,22\n\n0\n\nThis functional contains 3 quadratic terms A(θ)r2 ,\nQ(θ)rṙ and B(θ)ṙ2 . The cross term Q drops out after\ntaking the ensemble average; both the two other terms\nare determined by properties of the equilibrium island\nshape:\n1\nṘ2\n2 R2 + 2Ṙ2 − RR̈\nR2\n1\nB(θ) =\n,\n2 R2 + 2Ṙ2 − RR̈\nA(θ) =\n\n(5)\n(6)\n\nand provide the weightings of the fluctuations of the\ndeformations characterized by r2 and ṙ2 , respectively.\nThese deformations at the microscopic level are due to\nthe thermal movement of adatoms surrounding the island\nconstantly attaching to its edge and coming off from it.\nTo diagonalize the free energy one rewrites the integrand in Fourier form\nX\n∗\nF [{rn }; t] = 2πλ\n(Am−n + mnBm−n ) rn (t)rm\n(t) ,\nm,n\n\n2\n\nβ(ψ) = λ 2 R 2 1/2\nδF\n(R +Ṙ )\n= 0 =⇒\nδR\nψ = θ − arctan Ṙ\nR\n\nHere r and ṙ are time dependent and describe the deviation of the instantaneous shape from the equilibrium one\nas shown in Fig. 3. The angle ψ is also time-dependent\nsince now it depends not only on R and Ṙ as in Eq. (2),\nbut also on r and ṙ. Considering only small deformations\nfrom the equilibrium shape (as it is usually assumed in\nthe capillary wave theory) and also small slope deviations\nfrom the equilibrium slope Ṙ, so that r, ṙ ≪ R, the Taylor expansion (both in β and in the square root) in these\nsmall parameters leads to the functional\n\u0010\n\u00112\nZ2π\nṘr\n−\nR\nṙ\n1\nF [r, ṙ, θ; t] = λ\ndθ.\n(4)\n2 R2 + 2Ṙ2 − RR̈\n\n(2)\n\nHowever, in this procedure λ is a prefactor and cannot\nbe determined, leaving the relation relative. Eq. (2) is\nthe seminal Wulff construction in polar coordinates.\nIn order to determine the chemical potential, the thermal fluctuations of the island edge can be utilized. In this\ncase the free energy of the island changes as its shape\nchanges due to the fluctuations, and the free energy is\ncertainly not at its minimum but depends on the island's\ninstantaneous shape. Then the free energy of this instantaneous shape is the integral over the line elements\n\n(7)\nR 2π\nwhere rk = 0 r(θ) exp[ikθ]dθ and similarly for Ak and\nBk . The Fourier modes are coupled due to the anisotropy,\nwhich is contained in A and B as we shall see shortly.\nHere n = 0 is the expansion-contraction mode; n = 1,\nwhich we called the dipole mode in the Introduction, is\nrelated to the Brownian, diffusive motion of the island;\nn = 2 is a quadrupolar distortion, i.e. an elongated shape\nwith two maxima and two minima in perpendicular directions; and so on. The Fourier components have hermitian properties since A(θ) and B(θ), the factors associated with the equilibrium island shape, are real functions;\nhence, A−i = A∗i , B−i = Bi∗ , and r−i = ri∗ .\n\n\f4\n\nṘ\n\nL\n\nDue to hermiticity the above matrix form is diagonalizable\nX\nF [{hn }; t] = 2πλ\nΛn hn h∗n ,\n(9)\n\nṘ + ṙ\nn\nr\n\nψ\n\nn\n\nR\n\nFIG. 3: (Color online) Extension of Fig. 2, showing instantaneous island shape, for analysis of fluctuations. For a particular azimuthal direction, θ, the deviation from the equilibrium\nisland shape, r, its derivative with respect to θ, ṙ, the unit\nvector normal to the instantaneous shape, n, and the corresponding angle, ψ, are all time dependent.\n\nand the eigenvalues Λn of the A + MBN matrix are all\nreal. As we see shortly (in Eq. (10)) these eigenvalues\nare related to the strengths of the hn eigenmodes, which\nat every time instant are just the transforms of the rn (t)\nFourier modes of the instantaneous island shape. Again\ndue to hermiticity, there is a unitary matrix U which\ntransforms Eq. (8) into Eq. (9) and gives the linear relationship between r and h: r = Uh, where the vector h\ncontains the hn as its elements.\nThis decomposition of the free energy into eigenmodes\nin Eq. (9) facilitates the calculation of the Lagrange multiplier λ. In equilibrium, according to the equipartition\ntheorem, the ensemble average of each mode, representing a degree of freedom, must have the same Boltzmann\nenergy:\n\nThe free energy of Eq. (7) can readily be cast into\nmatrix form:\n\nz }| {\n1\n2πλ Λn h|hn |2 i = kB T.\n2\n\nθ\n\nΣ\n\nEn\n\nF [r; t] = 2πλr† (A + MBN) r ,\n\n(8)\n\nwhere r is a vector containing the Fourier components of\nthe instantaneous island shape, A and B are hermitian\nmatrices, [A]m,n = Am−n , [B]m,n = Bm−n , and M = N\nare diagonal matrices with the wavenumbers along the\ndiagonal.\nAs in practice there are only a finite number of atoms\non the edge of the island, we discretize the problem. If\nthe number of atoms on the edge is 2N , there are as\nmany modes in the system; as we will see in Sec. IV, to\nanalyze the right number of modes is crucial to the problem. Now, if r contains the rk Fourier components from\n−N + 1 through N , the Fourier transform is discrete and\nPN\nrk = j=−N +1 rjθ exp[i k jπ/N ], where rjθ is the deviation from the equilibrium shape in the θ = jπ/N direction.\nThe Ak and the Bk can be obtained similarly; and A\nand B are finite cyclic hermitian matrices, meaning that\ntheir diagonal elements are the same. They also reflect\nthe symmetry of the equilibrium shape as e.g. in our case\ndue to the six-fold symmetry the principal diagonal is\nfilled with A0 , the 6th to the right with A−6 , etc. As\nM and N are the same diagonal matrices, the MBN\nproduct keeps the hermitian property.\nIn the isotropic case (when the equilibrium shape is\ncircular), A(θ) = 0 and B(θ) = 1/2 for all θ. After\nthe Fourier transformation this gives A = 0 (zero matrix) and B = (1/2)11 (diagonal matrix). The anisotropy\ncomes into play when the equilibrium shape is not circular, so that A(θ) and B(θ) are not constants and their\nhigher order Fourier components fill the (off-)diagonals.\nThese off-diagonals couple the Fourier modes.\n\n(10)\n\nΛn and h|hn |2 i can be determined from the equilibrium\nisland shape and the fluctuating island perimeter, respectively. Here En must be a constant in n, the modes, as\nthe temperature and the chemical potential, λ, are fixed\nmacroscopic parameters of the island. From this equation one can determine the same λ, in principle, from\nany mode. Thus, either experimentally observing island\nfluctuations or using Monte Carlo simulations one can\ndetermine En , which in turn provides λ. This λ was the\nmissing parameter to determine absolute line tensions,\nand plugging it back into Eq. (2), we get the line tension\nin all azimuthal directions.\n\nIII.\n\nKINETIC MONTE CARLO\n\nThe scarcity of extensive experimental data leads us\nto use Monte Carlo methods to simulate the behavior\nof the system. However, use of numerical rather than\nexperimental data for testing of formal ideas has many\nadvantages in any case. Most obviously, in numerical\nexperiments one can obtain far greater control, with no\nworries about anomalous behavior due to unsuspected\nstray contaminants. Typically one can generate much\nmore data. In the present experiment, we do not need\nto worry about the scan rate of the probe; our lattice\nconfigurations are instantaneous snapshots. Another advantage of computer simulations will also become clear\nin the next section: it allows us to analyze correlation\ntimes.\nSince our original motivation was to simulate the relaxation of a Pb crystallite with a (111) facet, we place\na nanoscale island on a triangular lattice. We surround\n\n\f5\nEnergy Energy Break-three energy\n(meV) (K)\n(K)\nProcess\nSurface diffusion\n70\n812\n812\n237\n2749\n2319\nEdge diffusion\nBreak 1 bond\n192\n2227\n2319\n359\n4164\n3826\nBreak 2 bonds\nBreak 3 bonds\n467\n5417\n5333\n812\nAttachment\nOut\n70000\nTABLE I: Tabulation of some of the energy barriers used\nin KMC simulations of Pb(111). The energies in columns 2\nand 3 were computed by M. Haftel using SEAM27 with glue\npotentials.28 In the last column are the energies used in the\nsimulations. (The edge-diffusion energy barrier in the Breakthree scheme is closer to the corner rounding barrier of SEAM\nthan to the actual straight-edge diffusion barrier of SEAM\n(see text); the latter has a much lower barrier: 108 meV;\nunfortunately, the bond-counting method does not distinguish\nbetween these two.)\n\nit by a non-permeable circular container of radius Rc to\nlet the system reach its thermodynamic equilibrium, in\norder to measure its equilibrium fluctuations.23,24 Thus,\nthis geometry corresponds to an island placed on top of a\nfacet of a crystallite (with an infinite Ehrlich-Schwoebel\nbarrier). Note that by adjusting the permeability one\ncan tune the overall decay rate of the island, which in\nthis paper we fix at zero.\nSince the temperature of the systems of interest is low\ncompared to the energy barriers of adatomic hopping,\nwe have chosen to use the Bortz-Kalos-Lebovitz (BKL)\ncontinuous-time MC algorithm25 as it is best suited to\nlow temperature systems and as its rejection-free method\nallows us to greatly improve the efficiency of the simulations compared to traditional Metropolis algorithms.\nThe typical temperatures are around Tc /4 or less for the\ntwo-dimensional lattice gas of adatoms on the surface.\nUsing the n-fold way method to keep track of the available MC moves, we could improve the efficiency even\nfurther. Because of the small number of energy barriers,\nthe n-fold way approach (5-fold) is superior to the binary\ntree implementation of the BKL algorithm26 in this case.\nSince we are not interested in all the details of this surface in the simulations, but only try to capture the main\nmechanisms, we do not take into account the ABC stacking structure of the fcc lattice of Pb(111). Hence, the top\nlayer constitutes a triangular lattice with perfect six-fold\nsymmetry. Furthermore, we assume that adatoms can\nonly hop to nearest neighbor sites, and that the energy\nbarrier the adatom has to overcome is determined by the\noccupation of the 8 sites surrounding, as nearest neighbors, the 2 sites involved in the hopping process.\nThe energy barriers for hopping rates are mainly based\non the semiempirical embedded atom method (SEAM)27\nusing Ercolessi's glue potentials28 for the Pb(111) surface\nto derive the bond-counting energy barriers26 actually\nused in the simulations (see Table I). We use variants of\nsimple bond-counting. In what we term the break-three\n\nscheme, we count only bonds that have been broken with\nthe three sites \"behind\" the move. If we also include\nbond-breaking with the 2 sites to the left and the right\nof the move (denoted side sites), we have a break-five\nscheme. The 3 sites in front of the move do not affect\nthe energy barrier in our simulations. The break-three\nand break-five schemes both satisfy detailed balance in\na straightforward fashion. They both should give the\nsame results for static parameters, since they are both\nnearest-neighbor schemes. Comparison runs using this\nfeature provided one test (among many) of our program.\nHowever, the kinetics obviously differ because the energy\nbarriers tend to be higher for the break-five scheme, slowing the kinetics significantly. Since the energy barriers in\nthe break-three case are closer to the calculated barriers,\nwe choose to use this scheme in our simulations.\nIn Table I we list a few energy barriers calculated\nby the above-mentioned SEAM and the corresponding\nbreak-three-scheme barriers. Surface diffusion is when\nan adatom has no other adatoms in the surrounding 8\nsites in SEAM calculations; in the break-three scheme\nthis barrier also applies to all cases in which any of the\nside sites or the sites in front are occupied. This is the\nreason why the attachment barrier is the same as the\nsurface diffusion barrier. Edge diffusion is the case in\nwhich a side site is occupied, as is its nearest neighbor\n\"behind\". The energy barrier associated with this process is 237 meV whereas if there is a nearest in the front\nas well so that the adatom rolls along three others on\none side the third in the front seems to assist the hop a\ngreat deal (at least according to the SEAM data) as the\nbarrier is 108meV. The break-three scheme has the same\nbarrier for these two processes and also for any other in\nwhich only one bond is broken. The break-two-bonds\nbarrier corresponds to a hop with 2 occupied sites in the\nback, Break-3-bonds is when all 3 sites are occupied in\nthe back. The very high \"Out\" energy barrier assures\nthat adatoms cannot escape the container; i.e., the permeability is zero.\nThe basic parameters of the surface investigated and\nthe KMC simulations are the following: The nearestneighbor spacing a1 on the Pb(111) surface is 3.50Å.\nThe typical island diameter 2R is 40a1 to 80a1 , while the\ncontainer diameter Rc ranges from 12.5% to 300% larger\nthan the island. We examined temperatures 250K, 300K,\n350K, and 400K. In each MC snapshot of the island, we\nmeasure the island radius from the instantaneous center\nof mass in N \"equiangular\" directions where N = 360 if\nnot indicated otherwise.\nWe start the simulations from a nearly circular shaped\nconfiguration and let it relax to equilibrium, starting\nthe MC measurement of the fluctuation and shape after\nthe longest wavelength mode has passed its correlation\ntime. Especially at the lower temperatures, the typical\nequilibration times are very long, consistent with other\nreports.29,30 Ensemble averages are taken from 100 to\n3000 different runs starting from the same initial configuration, but with different random-number seeds. In\n\n\f6\n\n0.5\n\nEn\n\n0.4\n0.3\n0.2\n0.1\n0\n\n-60\n\n-40\n\n-20\n\n0\n\nn\n\n20\n\n40\n\n60\n\nFIG. 4: (Color online) Eigenmodes (open squares) and\nFourier modes (solid circles) at T =250K, R=20a1 , Rc =40a1 .\nEn is measured in atomic spacing units.\n\neach run, after equilibration, we get statistically independent fluctuations at time intervals again determined\nby the relaxation time of the longest wavelength mode.\nWe take such independent \"snapshots\" of the islands 5\nto 200 times in each run, so that we typically have 10,000\nto 70,000 islands over which to average.\n\nIV.\n\nCHEMICAL POTENTIAL, LINE TENSION,\nLINE STIFFNESS\n\nAs described in detail in Sec. II, the energetic parameters of the island edge are determined by the island shape\nand its edge fluctuation. The Wulff construction provides the relationship between the relative line tension in\nthe azimuthal directions on the crystal surface and the\nequilibrium island shape, and the information from the\n2\nfluctuations h|hn | i of each mode in Eq. (10) gives the\nchemical potential λ that makes the Wulff construction\nabsolute in Eq. (2).\nFrom our KMC simulations we determine En of Eq.\n(10); it is depicted in Fig. 4 for T =250K and R=20a1\nisland radius. Since the perimeter is about 120a1 , we use\n120 points to describe the circumference out of the 360\navailable.\nWe calculate En both using the transformation to the\neigenmodes taking into account the anisotropy, and also\npretending the islands were isotropic. In this latter case\nthe hn = rn are simply the Fourier modes, and Λn =\n(1/2)n2 .\nThe Fourier modes and the eigenmodes are nearly indistinguishable (cf. Fig. 4) except for long wavelengths\n(small wavenumber n). The \"fluctuations\" in the Fourier\nmodes for longer wavelengths are the only signature of\nthe anisotropy. This effect is smoothed out by transforming to the eigenmodes. (Only the longest [n=2] wavelength mode seems to stand out after the transformation. We are still puzzled that the longest wavelength is\nso special and does not couple to the shorter wavelength\n\nmodes. We give a more detailed account of the analysis of the coupling elsewhere.40 ) The chemical potential\ncan be determined from either the Fourier modes or the\neigenmodes using their plateau regions (between n = 4\nand n = 40); however, since only the longest-wavelength\nmodes (if any) are measurable due the poor temporal resolution of present-day experimental apparatus (see the\nresults for correlation times in the next section), the\ntransformed modes serve better for determining chemical potentials. Finding En thus from these intermediate\nwavenumbers, gives En =0.275a21 and through Eq. (10)\nand Eq. (2) β =34.1 meV/Å for the line tension for the\nhigh-symmetry direction. This value reasonably approximates the experimentally obtained ones for Pb(111) at\nT=393 K: β1A = 27.9 meV/Å and β1B = 26.5 meV/Å for\nA- and B-type steps, respectively, considering the crude\napproximation of bond-counting mentioned earlier.31 In\nour simulations the two directions corresponding to the\ntwo different types of steps are intrinsically equivalent because we assume six-fold symmetry as the available values\nfor energy barriers that we use in our KMC do not distinguish between the A- and B-directions, as mentioned\nin Sec. III.\nAt higher temperatures the Fourier modes deviate less\nfrom the eigenmodes for longer wavelengths, as expected\nsince the equilibrium shape is more nearly circular and\nless affected by the underlying anisotropy.\nIn earlier work13,22 in which experimental data were\nused as an input of similar calculations, there is a sum\nover the modes, but because those modes are buried in a\nsum in the generalized equipartition theorem, one cannot\nsee whether they are the modes which satisfy, at least to\na certain extent, the equipartition theorem. In those experimental data the correlation times of the modes are\nnot known and the effect of the finite temporal resolution of the experiment may also interfere with the fluctuations which should in principle be determined from\n\"snapshots\", i.e. fast scanned images-fast at least compared to the correlation times of the modes used in such\ncalculations. We shall elaborate on this in the next section.\nFor the same temperature we do the same measurement as above, but monitored N = 180 points on the\nperimeter instead of N = 360. The Fourier modes are depicted in Fig. 5. There are approximately 120 atoms on\nthe perimeter, but since we cannot divide the 180 perimeter points into 120 equiangular ones to do a Fourier transforms, we use N =90 or N =180 perimeter points as an\napproximation and observe how the plateau changes from\nwhat we saw in Fig. 4. The comparison of these two\nplots from MC simulations might help analyzing experimental data with limited spatial resolution as well, as\nit shows how the Fourier modes behave in case of undersampling (N =90) and oversampling (N =180). The\nundersampled modes give higher values for En than expected for modes |n| > 25, as if those modes took over\nthe energy of the modes that are missing from spectrum\n(namely 45 < |n| ≤ 90). In oversampling there is not\n\n\f7\n0.5\n\nThe temporal correlations can be characterized by\nE\nD\n2\n(11)\nG(t) = [r(t0 ) − r(t0 + t)] ∝ t2β .\n\n0.4\n\nEn\n\n0.3\n0.2\n0.1\n0\n\n-90\n\n-60\n\n-30\n\n0\n\nn\n\n30\n\n60\n\n90\n\nFIG. 5: Fourier modes for N =90 points (open squares) and\nN =180 points (solid circles) on the perimeter at T =250K,\nand R=20a1 , Rc =40a1 . En is measured in atomic spacing\nunits.\n\nenough energy for all modes in the sampling, so they go\nbelow the expected value of En . This is the simple reason for the peculiar shape of the two curves in Fig. 5 The\nvalue of En can still be determined quite accurately by\nusing the value at which the two curves start to separate\nat |n| ≃ 10, providing basically the same result for En as\nbefore.\nFrom the equilibrium island shape using the Wulff construction, we have determined the relative line tensions\nand stiffnesses in the azimuthal directions on the (111)\nsurface (see Fig. 6). The equilibrium shape is more and\nmore \"faceted\" in the six main directions as we can expect, the stiffness is about 3 times bigger in the direction of the \"facet\" than in the direction of the corner for\nT =350 K, whereas this factor is about 20 for T =250 K, so\nthat it spikes out much more, but still has only a smaller\neffect on the spectrum as shown before.\n\nSince we measure correlations in equilibrium, t0 must\nbe greater than the thermalization time of the system.\nHere r(t) is the fluctuation from the equilibrium shape,\nas before, and depends on the angle, θ, and time. The\ngrowth exponent16 β characterizes the temporal behavior\nof the fluctuations. The average is taken over angles and\nan ensemble as well.\nThe typical behavior of the correlation function is that\nthe exponent β remains at 1 for very short times,29 typical of the ballistic behavior of diffusion at very short\ntimes, and then crosses over to a value which characterizes the rate-limiting kinetics driving the fluctuations of\nthe island edge; eventually it crosses over to zero as the\ncorrelation function saturates due to the finite size of the\nsystem.\nPure rate-limiting kinetics have been thoroughly\ninvestigated.11,14,32,33,34 In these well-defined cases, β\ncan take the values 1/4 for attachment-detachment kinetics, 1/6 for surface diffusion, and 1/8 for step-edge\ndiffusion, where the last mechanism gives a very \"slow\"\ndynamics. There can be crossover regimes between these\npure cases, leading to values of β between the quoted\nvalues, and certain geometries can also effect the value\nof β. One should also see crossovers as length scales\nvary.11,14,34\nTo investigate the length-scale dependence of the correlation function, it is more appropriate to use the cor20\n\n10\n\nV.\n\nAUTOCORRELATIONS, CORRELATION\nTIMES, KINETICS\n-20\n\nInspecting the autocorrelation functions in Fourier\nspace, we find that the longest wavelengths have surprisingly long correlation times (in CPU time). Thus,\nfor our fairly large (at least for the computer) systems,\nit is hard to reach full equilibration needed to make the\ndesired MC measurements. Most surprising is that the\nrelaxation time of the longest-wavelength modes is 10 to\n100 times longer than the relaxation time of the islands\nto their equilibrium shape. Hence, estimating the thermalization time from just the shape relaxation may be\nvery misleading, possibly giving problematic results not\ncharacteristic of equilibrium. Such behavior may include\nillusory strong-mode coupling, or stronger fluctuations in\nautocorrelation functions even in case of good statistics.\n\n-10\n\n10\n\n20\n\n-10\n\n-20\n\nFIG. 6: (Color online) Polar plot of the equilibrium island\nshape R(θ) (outer dots), the relative line tension β(ψ) (inner\ndots) and the relative line stiffness β̃(ψ) (the innermost curve)\nin arbitrary units at T =350K, R=20a1 , Rc =40a1 . (note the\ndifference between θ and ψ)\n\n\f8\n\n0.6\n\nGn(t)\n\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n0\n\n2\n\n4\n6\n8\nt (10 MCS)\n\n8\n\n10\n\nFIG. 7: (Color online) Correlation function Gn (t) of the\nFourier modes for n=2,3,...,10 from top to bottom. T =400K,\nR=20a1 , Rc =40a1 .\n\nrelation function in Fourier space:\nE\nD\n2\nGn (t) = |rn (t0 ) − rn (t0 + t)|\n\n= Cn (1 − exp (− |t| /τn )) ,\n\n(12)\n(13)\n\nwhere the Cn are twice the amplitudes of the fluctuations\nof the modes analyzed in the previous section, and the τn\nare their correlation times. The wavenumber dependence\nof τn is known to have an intimate relationship with the\nexponent in G(t), namely\nτn ∼ n−z ,\n\n(14)\n\nwhere z is the dynamic exponent, and the scaling relationship between z and β here is z = (1/2)/β.16 The correlation time increases with increasing wavelength, with\nthe scaling exponent z. For larger exponent z, the correlation times grow more rapidly, so that for longer wavelengths the correlations and the dynamics in general can\nslow down very \"quickly\".\nHere we pay particular attention to the longest wavelength and its corresponding correlation time τ2 , which\nmakes the largest contribution to the fluctuations and relaxes the most slowly. From the wavelength dependence\nof the correlation time, we also determine the dynamic\nexponent and the rate limiting kinetics.\nIn the KMC simulations for T =400K and R=20a1, the\nlongest-wavelength mode, n=2, is 120a1 or 420Å long.\nFrom Fig. 7, its relaxation time is τ2 = 5.5 × 107 MCS\n(Monte Carlo steps). To give a crude estimate for τ2 in\nreal time, we consider the hopping rate\nν = νD exp[−βEb ]\n\n(15)\n\nto be the product of the attempt frequency, which we\nidentify with the Debye frequency of Pb: νD = 1.83×1012\nHz,35 and the Boltzmann factor of the energy barrier of\na particular hop. Hence, a MCS in this Monte Carlo\nsimulation is equivalent to a 1/νD time increment in real\n\ntime; thus, the relaxation time in this particular case is\nτ2 = 0.030 msec.\nAs expected, these correlation times change dramatically with temperature as the underlying physical phenomena are activated. For R=20a1 at T=350 K, τ2 =\n2.0 × 108 MCS or 0.11 msec, which means 4 times\nlonger relaxation compared to 400 K, while for 300 K\nτ2 = 7.1 × 108 MCS or 0.39 msec, which represents slowing by another factor of 4.\nWe have to mention here that we did two sets of\nkMC simulations. The simulations described in this paper satisfy detailed balance and sample the canonical\ndistribution, while in the other set we choose the energy barriers to be those calculated by SEAM, which\nexplicitely violate detailed balance and energy conservation. Interestingly, the latter simulations tend to give\ncloser agreement with experimentally measured correlation time data. We do a comparison of the results of\nthese two sets of simulations40 and upcoming experimental data41 elsewhere.\nThe scaling of the relaxation time with (wave)length\ncan be seen in Fig. 8. In the plotted wavenumber\nrange, overall, τn basically behaves like z =4, suggesting that the mechanism driving the fluctuations is\nstep-edge diffusion which is in agreement with previous\nobservations.36,37\nComparison of these length scales and their corresponding relaxation times with existing experimental observations might give interesting physical insight. For\nexample, in the experiment by Thürmer et al.,5 a small\nPb crystallite, whose top facet has a perimeter slightly\nlarger than 1200 nm, relaxes at 383K to its equilibrium\n(or at least metastable) shape in 1-2 days after being\nquenched from a higher temperature. Since the crystallite is 30 times larger than the longest wavelengths in\nour KMC simulations, the relaxation time τrelax of the\nlongest wavelength mode of the perimeter of the topmost island on the crystallite is 8.1 × 105 times longer if\nthe rate-limiting kinetics is step-edge diffusion (though,\nof course, attachment-detachment and terrace diffusion\ncould be present but NOT rate-limiting). Specifically,\nthe value of τrelax is 24.3 sec based on our KMC data at\nT =400K. From these data it seems that the island fluctuation is much faster than the decay of the 3D structure;\nthus there is no direct relationship between the fluctuation and the decay.\nThe above arguments lead to a general view of the\nevolution of surface structures. For Pb in the temperature range 350 K–400 K, one observes the slow development and relaxation of fluctuations at the μm scale\nin experiments. Assuming that the rate-limiting kinetics\nretain the same z =4 range for even longer wavelengths,\nstructures of 10 μm size - step edges, islands, etc. -\ntake days to years to change due to the large dynamic\nexponent, z, so in effect they look frozen under laboratory conditions. This is the reason why these monolayer\nstructures do not show any large-scale changes while on\na shorter scale they can be very active. The structural\n\n\f9\nVI.\n\n0\n\nCONCLUSIONS\n\n6\n\n1/τn (10 MCS)\n\n-1\n\n10\n\n-1\n\n10\n\n10\n\n-2\n\n2\n\n3\n\nn\n\n4\n\n5\n\nFIG. 8: (Color online) Correlation time τn vs. wave number n on a log-log scale. The MC data (black circles) show\nz = 4 which corresponds to step-edge diffusion. The dashed\nlines represent z=4, 3, and 2 (from top to bottom) dynamic\nexponents. T =400K, R=20a1 , Rc =40a1 .\n\nchanges in the 3D crystallites are even slower, they are\neven more stable.\nLowering the temperature makes the length scales -\nat which evolution or relaxation can be observed - exponentially shorter, which is readily understandable if\none looks at the converse of the above arguments. The\nlength scales with time like l ∼ τ −1/4 (for z = 4) whereas\nτ scales like 1/ν in Eq. (15). Thus, the length scales\nwith temperature like l ∼ exp [Eb /4kB T ]. This basically\nmeans that given the temperature and the time scale of\nobservation, one can calculate an effective length scale,\nLeff on which the structures on a surface are in equilibrium with their surroundings and actively changing on\nthe time scale of e.g. STM measurements. Having Leff\nand the energy barrier Eb at a certain temperature, one\ncan also make at least rough estimates of the effective\nlengths at other temperatures using this scaling argument. This picture is certainly a result of simplification,\nsince there is a whole set of energy barriers in such a\ncomplex physical system as a crystal surface, and the\nvarious atomistic mechanisms governed by different barriers freeze out or get activated at different temperatures,\ndepending on their corresponding energy barriers.38\nComparison or extrapolation to other materials is possible if the energy-barrier set is similar to that of Pb(111).\nThen the Debye frequency sets the time scale while the\nenergy barriers set the temperature scale, as one can\nreadily deduce it from Eq. (15). On the other hand, if the\nenergy-barrier set is completely different, as for example\nfor Si,39 it gives rise to a different rate-limiting mechanism namely attachment-detachment for a wide range of\ntemperatures, and such extrapolation is not possible, but\na whole set of simulations should be done for the group\nof materials with this sort of barriers.\n\nIn this paper we deduce energetic and kinetic parameters of a particular metal surface below its roughening\ntemperature. We use kinetic Monte Carlo simulations\nto mimic the fluctuations of large nanoscale islands on\nthese smooth surfaces in order to determine equilibrium\nisland shapes, anisotropic line tensions in the azimuthal\ndirections of the surface, and the correlation times of the\nFourier modes of the fluctuations.\nWe derive an analytic expression for the chemical potential of the island edge from the equilibrium island\nshape and the associated capillary wave fluctuations\naround it. This chemical potential sets the scale for\nthe anisotropic line tension, [the azimuthal dependence\nof] which is usually known only up to a multiplicative\nconstant. To account for the anisotropy of the line tension, this procedure contains a transformation from the\nFourier modes of the island edge fluctuations to the true\neigenmodes. However, detailed analysis of the Fourier\nand eigen modes of the fluctuations reveals that the difference in their spectrum (Fig. 4) is unexpectedly small.\nThe obtained line tensions-one of the most important physical parameters of steps on surfaces-are in the\ncorrect range compared to known experimental results,\neven in this simplistic model, with its rather small set of\nhopping-energy barriers in the KMC simulation.\nWe have analyzed the effect of spatial sampling, which\nshows that the long wavelength modes are hardly affected by the undersampling (oversampling)-too low\n(too high) resolution of imaging, which means that there\nare fewer (more) sample points on the step edge in the\nimage than actual atoms in the experiment- whereas\nmoderately short and short modes change significantly.\nThe analyses of the correlation times of the Fourier\nmodes show that nanoscale objects fluctuate on the msec\nto μsec time range at moderately high temperatures\n(400K) on Pb surfaces. Since the atomic processes are\nactivated, this time scale changes dramatically with temperature.\nIn closing, we comment on the equilibration time of\nstep structures in Monte Carlo simulations. The full equilibration of these structures is signalled by the correlation\ntime of the longest wavelength mode, which can be very\nlarge (in CPU time) for the system sizes and temperatures studied in this paper. To do correct MC measurements in equilibrium, one has to pass this time; otherwise, results for \"equilibrium quantities\" can be very\nmisleading, as is well known from non-equilibrium statistical mechanics. If one does not look at correlation\ntimes of Fourier modes, very careful analysis is required\nto avoid such equilibration problems.29 Recently, several\npapers have appeared concerning correlation functions,\npersistence, etc., of steps much longer than ours,42 and\nsometimes even several of them (in studies of the interaction between them). They might well suffer from these\nproblems since this equilibration time scales with system\nsize as the fourth power, meaning that a system that is\n\n\f10\ntwice as big needs an order of magnitude longer CPU\ntime to be equilibrated.\nWe also point out that the measurement of these fluctuations experimentally might be difficult because of the\nabove-mentioned time scale of the fluctuations. One either has to use techniques with which snapshots of the\nsurface can be taken,15 or, in direct visualization methods\n(like STM measurements), the scan rate of the equipment\nmust be faster than the fluctuations of a given wavelength\nof interest. Otherwise one measures the two ends of a\nwavelength at such a time separation that they are uncorrelated, leading to difficulties of interpretation. The\n\"speed\" of the fluctuations can be tuned by changing the\ntemperature, but one also has to take into account that\nlowering the temperature decreases the size of the fluctuations, rendering the measurement harder.\nFinally, the extrapolation of our results for nanoobjects to mesoscale features makes possible comparisons\nof correlation times of modes of certain wavelengths, as\nwell as of decay or of relaxation of larger structures to\ntheir equilibrium forms. This comparison reveals that\n\n∗\n†\n\n1\n\n2\n\n3\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\nCorresponding author: szalmaf@physics.umd.edu\nElectronic\naddress:\neinstein@umd.edu;\nURL: http://www2.physics.umd.edu/~einstein\nFor a general introduction to crystal surface phenomena,\nsee A. Pimpinelli and J. Villain, Physics of Crystal Growth\n(Cambridge Univ. Press, Cambridge, 1998).\nFor a review of vicinal surfaces, see H.-C. Jeong and E.D.\nWilliams, Surf. Sci. Rep. 34, 171 (1999).\nT. Müller and W. Selke, Eur. Phys. J. B 10, 549 (1999).\nK. Morgenstern, E. Laegsgaard, and F. Besenbacher, Phys.\nRev. B 66, 115408 (2002).\nK. Thürmer, J.E. Reutt-Robey, E.D. Williams, M. Uwaha,\nA. Emundts, and H.P. Bonzel, Phys. Rev. Lett. 87, 186102\n(2001).\nG. Schulze Icking-Konert, M. Giesen, and H Ibach, Phys.\nRev. Lett. 83, 3880 (1999).\nS. Dieluweit, H. Ibach, M. Giesen, and T. L. Einstein,\nPhys. Rev. B 67, 121410 (2003).\nN.C. Bartelt, J.L. Goldberg, T.L. Einstein, E.D. Williams,\nJ.C. Heyraud, and J.-J. Métois, Phys. Rev. B 48, 15453\n(1993).\nS. Kodambaka, V. Petrova, S. V. Khare, D. Gall, A. Rockett, I. Petrov, and J. E. Greene Phys. Rev. Lett. 89, 176102\n(2002).\nS. Kodambaka, S. V. Khare, V. Petrova, D. D. Johnson, I.\nPetrov, and J. E. Greene, Phys. Rev. B 67, 035409 (2003).\nS.V. Khare and T.L. Einstein, Phys. Rev. B 54, 11752\n(1996).\nD.C. Schlößer, L.K. Verheij, G. Rosenfeld, and G. Comsa,\nPhys. Rev. Lett. 82, 3843 (1999).\nS.V. Khare, S. Kodambaka, D. D. Johnson, I. Petrov, and\nJ. E. Greene, Surf. Sci. 522, 75 (2003).\nS.V. Khare and T.L. Einstein, Phys. Rev. B 57, 4782\n(1998).\nN.C. Bartelt and R.M. Tromp, Phys. Rev. B 54, 11731\n(1996).\nA.L. Barabási and H.E. Stanley, Fractal Concepts in Sur-\n\nthe relaxation of 3D structures of the same lengths are\nslower than that of the simple step or monatomic high\nislands, due to additional mechanisms and phenomena\nlike a possible Ehrlich-Schwoebel barrier, very low detachment rate and perhaps elasticity that affect the 3D\nstructure.\n\nAcknowledgements\n\nWork supported by NSF MRSEC Grant DMR 0080008, with partial funding from NSF Grant EEC 0085604, and the Hungarian National Research Fund under grant No. OTKA D32835. We gratefully acknowledge helpful discussions with J.R. Dorfman, D. Kandel,\nB. Koiler, H. van Beijeren, J.D. Weeks. Experimentalists\nO. Bondarchuk, W.G. Cullen, D.B. Dougherty, and E.D.\nWilliams provided physical motivation and insight. We\nthank M.I. Haftel for calculating energy barriers for us\nand T.J. Stasevich for computational help.\n\n17\n\n18\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\nface Growth (Cambridge Univ. Press, 1995).\nA. Pimpinelli, J. Villain, D. E. Wolf, J. J. Métois, J. C.\nHeyraud, I. Elkinani and G. Uimin, Surf. Sci. 295, 143\n(1993).\nG.S. Bales and A. Zangwill, Phys. Rev. B 41, 5500 (1990).\nW.W. Mullins, J. Appl. Phys. 28, 333 (1957); 30, 77\n(1959).\nW.W. Mullins, in Metal Surfaces: Structure, Energetics\nand Kinetics (Am. Soc. Metals, Metals Park, OH, 1963) p.\n17.\nL.D. Landau and E.M. Lifshitz, Statistical Physics, Part I,\n3rd edition, (Butterworth-Heinemann, 1980), chap. 15.\nS. Kodambaka, V. Petrova, S. V. Khare, D. D. Johnson,\nI. Petrov, and J. E. Greene, Phys. Rev. Lett. 88, 146101\n(2002).\nJ.G. McLean, B. Krishnamachari, D.R. Peale, E. Chason,\nJ.P. Sethna, and B. H. Cooper, Phys. Rev. B 55, 1811\n(1997).\nM. Zinke-Allmang, L.C. Feldman, and M.H. Grabow, Surf.\nSci. Rep. 16, 377 (1992).\nA. B. Bortz, H. M. Kalos, and J.L. Lebowitz, J. Comp.\nPhys. 17, 10 (1975).\nM. E. J. Newman and G. T. Barkema, Monte Carlo Methods in Statistical Physics (Clarendon, Oxford, 1999).\nM.I. Haftel and M. Rosen, Phys. Rev. B 51, 4426 (1995);\nSurf. Sci. 407, 16 (1998).\nH.\nS.\nLim,\nC.\nK.\nOng,\nand\nF.\nErcolessi,\nSurf.\nSci.\n269/270,\n1109\n(1992);\nhttp://www.fisica.uniud.it/∼ercolessi/potentials/Pb/\nF. Szalma, W. Selke, and S. Fischer, Physica A 294, 313\n(2001).\nA. Karim , M. Rusanen , I.T. Koponen, T. Ala-Nissila,\nand T.S. Rahman, Surf. Sci. 554, L113 (2004).\nC. Bombis, A. Emundts, M. Novicki, and H.P. Bonzel,\nSurf. Sci. 511, 83 (2002).\nN. C. Bartelt, J. L. Goldberg, T.L. Einstein, and E. D.\nWilliams, Surf. Sci. 273, 252 (1992).\n\n\f11\n33\n\n34\n\n35\n\n36\n\n37\n\nN. C. Bartelt, T.L. Einstein, and E. D. Williams, Surf. Sci.\n312, 411 (1994).\nB. Blagojević and P.M. Duxbury, Phys. Rev. E 60, 1279\n(1999).\nN.W. Ashcroft and N.D. Mermin, Solid State Physics\n(Saunders College, Philadelphia, 1976)\nL. Kuipers, M.S. Hoogeman, J.W.M. Frenken, and H. van\nBeijeren, Phys. Rev. B 52, 11387 (1995).\nS. Speller, W. Heiland, A. Biedermann, E. Platzgummer,\nC. Nagl, M. Schmid, P. Varga, Surf. Sci., 331 1056 (1995).\n\n38\n\n39\n\n40\n41\n42\n\nA. Bogicevic, J. Strömquist, and B. I. Lundqvist Phys.\nRev. Lett. 81, 637 (1998).\nJ.M. Bermond, J.J. Métois, X. Egéa, and F. Floret, Surf.\nSci. 330, 48 (1995).\nF. Szalma et al. (unpublished)\nD.B. Dougherty, F. Szalma (unpublished)\nE.g., perhaps for large Ã in Hailu Gebremariam, S.D. Cohen, H.L. Richards, and T.L. Einstein Phys. Rev. B 69,\n125404 (2004).\n\n\f"}