{"id": "http://arxiv.org/abs/cond-mat/0402585v1", "guidislink": true, "updated": "2004-02-24T12:41:54Z", "updated_parsed": [2004, 2, 24, 12, 41, 54, 1, 55, 0], "published": "2004-02-24T12:41:54Z", "published_parsed": [2004, 2, 24, 12, 41, 54, 1, 55, 0], "title": "Entropy Driven Phase Separation in a Model Colloid-Polymer Mixture", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0402387%2Ccond-mat%2F0402094%2Ccond-mat%2F0402385%2Ccond-mat%2F0402395%2Ccond-mat%2F0402441%2Ccond-mat%2F0402032%2Ccond-mat%2F0402482%2Ccond-mat%2F0402313%2Ccond-mat%2F0402448%2Ccond-mat%2F0402356%2Ccond-mat%2F0402440%2Ccond-mat%2F0402470%2Ccond-mat%2F0402339%2Ccond-mat%2F0402563%2Ccond-mat%2F0402216%2Ccond-mat%2F0402647%2Ccond-mat%2F0402418%2Ccond-mat%2F0402061%2Ccond-mat%2F0402028%2Ccond-mat%2F0402111%2Ccond-mat%2F0402511%2Ccond-mat%2F0402029%2Ccond-mat%2F0402200%2Ccond-mat%2F0402568%2Ccond-mat%2F0402585%2Ccond-mat%2F0402377%2Ccond-mat%2F0402172%2Ccond-mat%2F0402182%2Ccond-mat%2F0402274%2Ccond-mat%2F0402060%2Ccond-mat%2F0402027%2Ccond-mat%2F0402672%2Ccond-mat%2F0402242%2Ccond-mat%2F0402254%2Ccond-mat%2F0402239%2Ccond-mat%2F0402469%2Ccond-mat%2F0402404%2Ccond-mat%2F0402348%2Ccond-mat%2F0402372%2Ccond-mat%2F0402631%2Ccond-mat%2F0402276%2Ccond-mat%2F0402668%2Ccond-mat%2F0402523%2Ccond-mat%2F0402314%2Ccond-mat%2F0402285%2Ccond-mat%2F0402178%2Ccond-mat%2F0402077%2Ccond-mat%2F0402575%2Ccond-mat%2F0402258%2Ccond-mat%2F0402071%2Ccond-mat%2F0402336%2Ccond-mat%2F0402164%2Ccond-mat%2F0402626%2Ccond-mat%2F0402357%2Ccond-mat%2F0402384%2Ccond-mat%2F0402234%2Ccond-mat%2F0402301%2Ccond-mat%2F0402490%2Ccond-mat%2F0402597%2Ccond-mat%2F0402456%2Ccond-mat%2F0402292%2Ccond-mat%2F0402092%2Ccond-mat%2F0402344%2Ccond-mat%2F0402587%2Ccond-mat%2F0402618%2Ccond-mat%2F0402629%2Ccond-mat%2F0402195%2Ccond-mat%2F0402245%2Ccond-mat%2F0402161%2Ccond-mat%2F0402319%2Ccond-mat%2F0402407%2Ccond-mat%2F0402087%2Ccond-mat%2F0402153%2Ccond-mat%2F0402157%2Ccond-mat%2F0402459%2Ccond-mat%2F0402265%2Ccond-mat%2F0402177%2Ccond-mat%2F0402262%2Ccond-mat%2F0402449%2Ccond-mat%2F0402069%2Ccond-mat%2F0402293%2Ccond-mat%2F0402520%2Ccond-mat%2F0402654%2Ccond-mat%2F0402237%2Ccond-mat%2F0402648%2Ccond-mat%2F0402517%2Ccond-mat%2F0402636%2Ccond-mat%2F0402420%2Ccond-mat%2F0402513%2Ccond-mat%2F0402414%2Ccond-mat%2F0402253%2Ccond-mat%2F0402375%2Ccond-mat%2F0402312%2Ccond-mat%2F0402311%2Ccond-mat%2F0402228%2Ccond-mat%2F0402263%2Ccond-mat%2F0402620%2Ccond-mat%2F0402604%2Ccond-mat%2F0402506%2Ccond-mat%2F0402452%2Ccond-mat%2F0402605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Entropy Driven Phase Separation in a Model Colloid-Polymer Mixture"}, "summary": "A grand canonical Monte Carlo method for the simulation of a simple\ncolloid-polymer mixture called the AO model will be described. The phase\nseparation known to occur in this model is driven by entropy. The phase diagram\nof the unmixing transition, the surface tension and thecritical point will be\ndetermined.\n  To appear in: \"Computer Simulation Studies in Condensed Matter Physics XVIII,\nEds. D.P. Landau, S.P. Lewis, and H.B. Schuettler (Springer Verlag, Heidelberg,\nBerlin, 2004).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0402387%2Ccond-mat%2F0402094%2Ccond-mat%2F0402385%2Ccond-mat%2F0402395%2Ccond-mat%2F0402441%2Ccond-mat%2F0402032%2Ccond-mat%2F0402482%2Ccond-mat%2F0402313%2Ccond-mat%2F0402448%2Ccond-mat%2F0402356%2Ccond-mat%2F0402440%2Ccond-mat%2F0402470%2Ccond-mat%2F0402339%2Ccond-mat%2F0402563%2Ccond-mat%2F0402216%2Ccond-mat%2F0402647%2Ccond-mat%2F0402418%2Ccond-mat%2F0402061%2Ccond-mat%2F0402028%2Ccond-mat%2F0402111%2Ccond-mat%2F0402511%2Ccond-mat%2F0402029%2Ccond-mat%2F0402200%2Ccond-mat%2F0402568%2Ccond-mat%2F0402585%2Ccond-mat%2F0402377%2Ccond-mat%2F0402172%2Ccond-mat%2F0402182%2Ccond-mat%2F0402274%2Ccond-mat%2F0402060%2Ccond-mat%2F0402027%2Ccond-mat%2F0402672%2Ccond-mat%2F0402242%2Ccond-mat%2F0402254%2Ccond-mat%2F0402239%2Ccond-mat%2F0402469%2Ccond-mat%2F0402404%2Ccond-mat%2F0402348%2Ccond-mat%2F0402372%2Ccond-mat%2F0402631%2Ccond-mat%2F0402276%2Ccond-mat%2F0402668%2Ccond-mat%2F0402523%2Ccond-mat%2F0402314%2Ccond-mat%2F0402285%2Ccond-mat%2F0402178%2Ccond-mat%2F0402077%2Ccond-mat%2F0402575%2Ccond-mat%2F0402258%2Ccond-mat%2F0402071%2Ccond-mat%2F0402336%2Ccond-mat%2F0402164%2Ccond-mat%2F0402626%2Ccond-mat%2F0402357%2Ccond-mat%2F0402384%2Ccond-mat%2F0402234%2Ccond-mat%2F0402301%2Ccond-mat%2F0402490%2Ccond-mat%2F0402597%2Ccond-mat%2F0402456%2Ccond-mat%2F0402292%2Ccond-mat%2F0402092%2Ccond-mat%2F0402344%2Ccond-mat%2F0402587%2Ccond-mat%2F0402618%2Ccond-mat%2F0402629%2Ccond-mat%2F0402195%2Ccond-mat%2F0402245%2Ccond-mat%2F0402161%2Ccond-mat%2F0402319%2Ccond-mat%2F0402407%2Ccond-mat%2F0402087%2Ccond-mat%2F0402153%2Ccond-mat%2F0402157%2Ccond-mat%2F0402459%2Ccond-mat%2F0402265%2Ccond-mat%2F0402177%2Ccond-mat%2F0402262%2Ccond-mat%2F0402449%2Ccond-mat%2F0402069%2Ccond-mat%2F0402293%2Ccond-mat%2F0402520%2Ccond-mat%2F0402654%2Ccond-mat%2F0402237%2Ccond-mat%2F0402648%2Ccond-mat%2F0402517%2Ccond-mat%2F0402636%2Ccond-mat%2F0402420%2Ccond-mat%2F0402513%2Ccond-mat%2F0402414%2Ccond-mat%2F0402253%2Ccond-mat%2F0402375%2Ccond-mat%2F0402312%2Ccond-mat%2F0402311%2Ccond-mat%2F0402228%2Ccond-mat%2F0402263%2Ccond-mat%2F0402620%2Ccond-mat%2F0402604%2Ccond-mat%2F0402506%2Ccond-mat%2F0402452%2Ccond-mat%2F0402605&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A grand canonical Monte Carlo method for the simulation of a simple\ncolloid-polymer mixture called the AO model will be described. The phase\nseparation known to occur in this model is driven by entropy. The phase diagram\nof the unmixing transition, the surface tension and thecritical point will be\ndetermined.\n  To appear in: \"Computer Simulation Studies in Condensed Matter Physics XVIII,\nEds. D.P. Landau, S.P. Lewis, and H.B. Schuettler (Springer Verlag, Heidelberg,\nBerlin, 2004)."}, "authors": ["R. L. C. Vink"], "author_detail": {"name": "R. L. C. Vink"}, "author": "R. L. C. Vink", "arxiv_comment": "16 pages", "links": [{"href": "http://arxiv.org/abs/cond-mat/0402585v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0402585v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0402585v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0402585v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:cond-mat/0402585v1 [cond-mat.soft] 24 Feb 2004\n\n1\n\nEntropy Driven Phase Separation\n\nRichard Vink\nInstitut für Physik\nJohannes Gutenberg-Universität\nMainz (Germany)\nAbstract. A grand canonical Monte Carlo method for the simulation of a simple\ncolloid-polymer mixture called the AO model will be described. The phase separation known to occur in this model is driven by entropy. The phase diagram of the\nunmixing transition, the surface tension and the critical point will be determined.\n\n1.1\n\nIntroduction\n\nMixtures of particles are all around us. If you pour oil and water together you\ncreate a mixture. Another example is a solution containing colloids and polymers. Mixtures will sometimes phase-separate or unmix. When this happens\nparticles of the same kind cluster together. A famous example is a mixture of\noil and water: after unmixing, the lower part of the container contains mostly\nwater and the upper part mostly oil with an interface in between.\nThere are different reasons for a mixture to unmix. For instance, the\nunmixed state might carry a lower energy. As an example consider a mixture\nof A and B particles interacting with the following pair potentials:\nǫ\nuAA (r) = uBB (r) = 0,\nuAB (r) = ,\n(1.1)\nr\nwhere r is the distance between two particles and ǫ some positive constant.\nIn this mixture, A particles do not feel each other, and neither do B particles,\nbut when A and B particles are close together there is an energy penalty. At\nlow temperature, the system tries to minimize the energy and can only do so\nby moving the A and B particles as far apart as possible. The system thus\nunmixes.\nThere is another mechanism that can induce unmixing. This mechanism\nhas its origin in entropy and not in energy. The unmixing of colloid-polymer\nmixtures for example is driven by entropy. To show that this must be the\ncase, it is instructive to briefly consider the nature of the interactions in a\ntypical colloid-polymer mixture. To a crude approximation the colloids behave as hard spheres. The polymer interactions are more complicated. A real\npolymer consists of a chain of bonded monomers. In principle all monomers\nshould be taken into account explicitly. However, under certain conditions\nit is reasonable to describe the polymer chain with only the coordinate of\nits center of mass and some effective radius called the radius of gyration. In\n1954 Asakura and Oosawa [1] proposed a simple model for colloid-polymer\n\n\f2\n\nRichard Vink\n\nFig. 1.1. Colloid and polymer at minimum separation (here and throughout this\ntext C=colloid and P=polymer). The distance between the centers of mass equals\nRc +Rp . This is the minimum allowed separation: any smaller separation is punished\nwith infinite energy. The colloid thus carries a spherical depletion zone with volume\nVδ around its center of mass which cannot contain any polymer centers.\n\nmixtures based on precisely these approximations. In this model colloids and\npolymers are treated as spheres with respective radii Rc and Rp . Hard sphere\ninteractions are assumed between colloid-colloid (cc) and colloid-polymer (cp)\npairs while polymer-polymer (pp) pairs can interpenetrate freely. This leads\nto the following pair potentials:\n\u001a\n\u001a\n∞ for r < 2Rc\n∞ for r < Rc + Rp\nucc (r) =\nucp (r) =\n(1.2)\n0 otherwise,\n0 otherwise,\nupp (r) = 0,\n\nwith r again the distance between two particles. The above equations define\nwhat is nowadays called the AO model. Note that in 1976 the same model\nwas proposed again and independently by Vrij [2].\nAccording to Eq.(1.2) the energy of a valid AO mixture is always zero.\nTherefore, if unmixing occurs (and it does) it cannot be explained in terms\nof the energy argument used before. The reason for unmixing is a little more\nsubtle, see Fig.1.1 and Fig.1.2. Shown in Fig.1.1 is one colloidal particle just\ntouching one polymer. When the particles touch, the distance between the\ncenters of mass equals Rc + Rp . This is the minimum allowed separation\nbetween the particles because any smaller separation carries an infinite energy penalty. In the AO model every colloid is thus surrounded by a region\nwhich cannot contain any polymer centers of mass. This region is called the\ndepletion zone. In three dimensions the volume of the depletion zone equals:\nVδ =\n\n4π\n(Rc + Rp )3 .\n3\n\n(1.3)\n\nConsider now Fig.1.2 which shows a container of volume V holding zero,\none and two colloidal particles. Shown at the top is a polymer which we\nwant to insert into the container. If the container is empty we can place the\npolymer anywhere so the free volume f available to the polymer is simply\n\n\f1\n\nEntropy Driven Phase Separation\n\n3\n\nFig. 1.2. Free volume f available to a single polymer in a container of volume V\nholding zero, one and two colloidal particles. See text for details.\n\nf = V (Fig.1.2A). If the container already holds one colloid the free volume\ndecreases to f = V − Vδ (Fig.1.2B). The physics becomes interesting when\nthe container holds two or more colloids. Two cases can now be distinguished.\nIn the first case both colloids are well separated and the free volume equals\nf = V − 2Vδ (Fig.1.2C). In the second case the colloids are so close together\nthat their depletion zones overlap and the free volume increases f > V −\n2Vδ (Fig.1.2D). This immediately has physical consequences: by clustering\ntogether the colloids can increase the free volume available to the polymers\nand hence the entropy of the polymers. Under certain conditions the gain in\nentropy is sufficient to drive unmixing.\nThe AO model thus provides a convenient framework in which to study\nentropy driven unmixing. It has sparked much theoretical work and many\nsimulations [3–7]. Despite its apparent simplicity, predicting the phase behavior of the AO model is no easy task. In this paper an efficient grand\ncanonical Monte Carlo (MC) method that can be used to simulate the AO\nmodel will be described. The use of the grand canonical ensemble allows one\nto bypass certain problems encountered for example in the canonical and\nGibbs ensembles. In particular, one can accurately obtain the surface tension\nand also perform simulations close to the critical point. The method will be\nused to calculate the phase diagram and the surface tension of the interface.\nWe will also present an accurate determination of the critical point using\nfinite-size scaling.\n\n1.2\n\nGrand Canonical Monte Carlo\n\nImagine an AO mixture contained in some volume V at inverse temperature β = 1/(kB T ). In the grand canonical ensemble V and β are fixed but\nthe number of particles inside V is allowed to fluctuate. The probability of\n\n\f4\n\nRichard Vink\n\nFig. 1.3. Problem encountered in a standard grand canonical MC simulation of the\nAO model. When the number of polymers in the volume is substantial it becomes\ndifficult to insert additional colloids. Inserting more polymers remains easy though.\n\nobserving a volume containing Nc colloids and Np polymers is given by the\ngrand canonical distribution:\nP = CzcNc zpNp e−βE ,\n\n(1.4)\n\nwhere C is a normalization constant, E the energy given by Eq.(1.2) and\n{zc , zp } the fugacities of the colloids and polymers, respectively.\nIn a grand canonical MC simulation of the AO model one would like to\ngenerate configurations of colloids and polymers that sample Eq.(1.4). In the\nstandard approach this is done by attempting to insert a single particle into V\nat a random location, or remove a single (randomly selected) particle from V .\nInsertion and removal are usually attempted with equal probability and accepted with probabilities that depend on the energy change of the attempted\nmove and on the fugacities. The standard approach is however not efficient\nfor the AO model as Fig.1.3 illustrates. The figure shows a volume containing\na substantial number of polymers and some colloids. According to Eq.(1.2)\npolymers do not interact with each other so they are happy to overlap. This\nis what generally will happen as the figure shows. Unfortunately, it is nearly\nimpossible to insert an additional colloid into this system: no matter where\nthe colloid is placed it will likely overlap with at least some of the polymers,\nand colloid-polymer overlaps are forbidden by Eq.(1.2). A standard grand\ncanonical MC simulation of the AO model is thus characterized by a very\nlow acceptance rate of colloid insertions.\nThe problem illustrated in Fig.1.3 is typical of asymmetric binary mixtures of which the AO model is an example. The standard grand canonical\nMC algorithm does not deal well with such mixtures, essentially because it\nmoves only one particle at a time. A MC move capable of removing entire\nclusters of polymers would be much more efficient. By using such a cluster\nmove the formation of \"holes\" in the \"sea\" of polymers is enhanced. If the\nholes are large enough to contain a colloid, the acceptance rate of colloid\ninsertions will increase. The MC move used in this work to simulate the AO\nmodel is aimed at doing precisely that.\n\n\f1\n\nEntropy Driven Phase Separation\n\n5\n\nFig. 1.4. Inserting an additional colloid into an AO mixture. (A) The starting\nconfiguration. (B) The colloid is inserted at a random location inside the volume.\n(C) All polymers that overlap with the colloid are removed.\n\n1.3\n\nCluster Moves\n\nConsider now Fig.1.4A which again shows an AO mixture of colloids and\npolymers. This time we are less shy and simply insert an additional colloid\nat some randomly selected location inside V . The resulting configuration is\nshown in Fig.1.4B, with the colloid inserted in the upper right corner of the\nbox. Note that the configuration in Fig.1.4B is not a valid AO configuration\nbecause the colloid overlaps with four polymers. To fix this the overlapping\npolymers are simply removed, leading to the configuration shown in Fig.1.4C.\nThe MC move of Fig.1.4 is of course not sufficient to carry out a simulation. We also need a reverse MC move capable of bringing us back from\nthe configuration of Fig.1.4C to the starting configuration of Fig.1.4A. In\nconstructing the reverse move, the key idea is that for every colloid you take\nout, a number of polymers must be inserted into the empty depletion zone\nleft behind by the colloid. But exactly how many polymers?\nTo answer this question it is instructive to consider an AO model containing only polymers. In this case the AO model reduces to a very simple\nsystem, namely that of an ideal gas (remember that the polymers do not interact with each other). According to basic statistical mechanics, the average\ndensity of an ideal gas is equal to its fugacity. Likewise, for an AO model free\nof colloids, the average polymer density equals zp . If we attempt to insert\na colloid into the pure polymer system it will on average overlap with zp Vδ\npolymers\nwith fluctuations in the average that are Poisson like, i.e. of order\np\nzp Vδ . Because of these fluctuations, the number of polymers np that we\nmust insert for every colloid that we take out cannot simply be a constant.\nInstead, np must be a random variable drawn from some probability distribution. One choice that works well (see Section 1.6) is to draw it uniformly\nfrom the interval np ∈ [0, mi (so including 0 but excluding m) and m an\ninteger given by:\n\u0011i\nh\n\u0010\np\n(1.5)\nm = 1 + max 1, int zp Vδ + α zp Vδ ,\n\n\f6\n\nRichard Vink\n\nFig. 1.5. MC move used to remove a colloid from an AO mixture. (A) The colloid\nto be removed is chosen randomly from among those present. (B) The colloid is\nremoved and np random locations are selected inside the empty depletion zone left\nbehind. The number np is uniformly drawn from the interval [0, mi. In this example\nnp = 4. (C) Polymers are placed onto the random locations.\n\nwith α a positive constant of order unity you are free to choose (α ≈ 2.0\nusually gives good results). Recall that Vδ is the volume of the depletion zone\ngiven by Eq.(1.3).\nThe reverse move can now be constructed and is illustrated in Fig.1.5.\nFirst, we randomly select a colloid (Fig.1.5A). The colloid is removed and np\nrandom locations inside the depletion zone of this colloid are selected, with\nnp uniformly drawn from the interval [0, mi (Fig.1.5B). Finally, polymers are\nplaced onto these random locations resulting in the configuration shown in\nFig.1.5C.\n\n1.4\n\nDetailed Balance\n\nWe will now derive the acceptance rates of the MC moves illustrated in\nFig.1.4 and Fig.1.5. The acceptance rates must be constructed such that\ndetailed balance is obeyed. This is vital because the algorithm must sample\nthe grand canonical distribution of Eq.(1.4). Recall that the condition of\ndetailed balance demands that [8–10]:\nP (σ)g(σ → τ )A(σ → τ ) = P (τ )g(τ → σ)A(τ → σ),\n\n(1.6)\n\nwith P (σ) the Boltzmann probability of state σ, g(σ → τ ) the probability\nthat the MC scheme generates state τ from state σ, and A(σ → τ ) the\nprobability of accepting the new state τ .\nThe derivation that follows is based on two assumptions:\n1. The integer m of Eq.(1.5) is assumed a constant parameter of the algorithm. It must be set once at the start of the simulation and it may not\nbe changed during the course of the simulation.\n2. It is assumed that the insertion of a colloid and the removal of a colloid\nare attempted with equal probability.\n\n\f1\n\nEntropy Driven Phase Separation\n\n7\n\nIn an implementation it is important that the above conditions are met. If\nthey are not the acceptance rates to be derived next may yield wrong results!\n1.4.1\n\nColloid Removal\n\nThe acceptance rate for the removal of a colloidal particle is derived first.\nThis is the MC move shown in Fig.1.5. Assume that we start in a state σ\ncontaining Nc colloids, Np polymers and energy Eσ . It is convenient to label\nthe state as σ(Nc , Np , Eσ ). The energy Eσ will of course be zero but for the\nderivation it is convenient to write it down explicitly. After removing the\ncolloid, np polymers are inserted into the depletion zone left behind. The\nstate τ that we end up in can thus be labeled as τ (Nc − 1, Np + np , Eτ ). Note\nthat Eτ need not be zero: if a second colloid happens to be very close to the\ncolloid that was removed, it could now overlap with one or more of the np\npolymers that were just inserted.\nTo enforce detailed balance the probabilities that appear in Eq.(1.6) must\nbe written down. We begin with the easy ones P (σ) and P (τ ). These are\nsimply given by the grand canonical distribution of Eq.(1.4):\nP (σ) = CzcNc zpNp e−βEσ ,\n\nP (τ ) = CzcNc −1 zpNp+np e−βEτ .\n\n(1.7)\n\nThe probabilities g(σ → τ ) and g(τ → σ) are more complicated. If we\nare in state σ the probability of ending up in state τ is given by the product\nof the probabilities of the individual steps that were taken in the MC move.\nAfter close inspection of Fig.1.5 the following steps can be identified:\n1. Selecting a colloid at random. Since state σ contains Nc colloids the\nprobability of choosing one particular colloid is 1/Nc .\n2. Selecting np . Since np is drawn uniformly from the interval [0, mi the\nprobability of this step is 1/m.\n3. Selecting np random locations inside a volume Vδ . The probability of\nchoosing one particular location equals 1/Vδ (see Appendix 1.9). Since\nnp locations are selected we must raise this probability to the power\nnp . Additionally, we pick up a factorial counting the number of ways in\nwhich the locations can be selected. The total probability of this step\nn\nthus becomes (np )!/Vδ p .\nThe probability g(σ → τ ) is thus the product of the above three terms.\nFinally, we derive g(τ → σ). This is the probability that the reverse MC\nmove brings us back from state τ to state σ. This move is illustrated in Fig.1.4\nand upon inspecting it we observe that state σ is regenerated if a colloid is\nplaced inside V at precisely the same location it was just removed from. This\ncarries a probability 1/V and so we find g(τ → σ) = 1/V .\nSubstitution of the above terms into Eq.(1.6) and using the Metropolis choice [8] we find that the removal of a colloid must be accepted with\nprobability:\n\u0015\n\u0014\nmNc (zp Vδ )np −β(Eτ −Eσ )\n.\n(1.8)\ne\nA(Nc → Nc − 1) = min 1,\nzc V (np )!\n\n\f8\n\nRichard Vink\n\nNote that moves leading to configurations where Eτ is not zero are automatically rejected by the above equation.\n1.4.2\n\nColloid Insertion\n\nTo make the algorithm complete the acceptance rate for the insertion of a\ncolloid must still be derived, i.e. the MC move of Fig.1.4. We can follow\nthe same reasoning as before with perhaps one subtlety. We start again in\na state σ containing Nc colloids, Np polymers and energy Eσ , so with label\nσ(Nc , Np , Eσ ). All polymers (say np of them) that overlap with the inserted\ncolloid are removed, so the state τ that we end up in can be labeled as\nτ (Nc + 1, Np − np , Eτ ). Again, the energy Eτ need not be zero: if we are\nunlucky the inserted colloid overlaps with one or more of the Nc colloids\nalready present. According to Eq.(1.2) such overlaps also carry infinite energy.\nTo construct detailed balance we first write down P (σ) and P (τ ):\nP (σ) = CzcNc zpNp e−βEσ ,\n\nP (τ ) = CzcNc +1 zpNp −np e−βEτ .\n\n(1.9)\n\nNext, we derive g(σ → τ ) which is the probability that the MC move of\nFig.1.4 generates state τ starting in state σ. This involves only the random\nselection of a location inside V so we obtain: g(σ → τ ) = 1/V .\nFinally, we consider g(τ → σ). This is the probability that the reverse\nMC move of Fig.1.5 transforms state τ back into state σ. This will happen\nonly if the following conditions are met:\n1. The newly inserted colloid is removed again. Since state τ contains Nc +1\ncolloids the probability of this step equals 1/(Nc + 1).\n2. Precisely the same number np of polymers that were removed are inserted\nagain. This step requires some care. Assume that we chose m rather small\nin Eq.(1.5). In that case the forward move of Fig.1.4 might remove more\npolymers than the reverse move of Fig.1.5 can possibly put back. This\nwill happen if np ≥ m. Therefore, the probability p that exactly the same\nnumber of polymers are inserted must be written as:\n\u001a\n0\nif np ≥ m\np=\n(1.10)\n1/m otherwise.\n\n3. Selecting the same np coordinates inside Vδ . As was explained before this\nn\nprobability equals (np )!/Vδ p .\n\nThe probability g(τ → σ) is thus the product of the above three terms.\nSubstitution into Eq.(1.6) and using the Metropolis choice [8] we find that\nthe insertion of a colloid must be accepted with probability:\n(\n\n0\n\nA(Nc → Nc + 1) =\ni if np ≥ m\n\nh\n(np )!\nzc V\n−β(Eτ −Eσ )\notherwise.\nmin 1, m(N\nnp e\nc +1) (zp Vδ )\n\n(1.11)\n\nAgain, moves leading to configurations where Eτ is not zero are automatically\nrejected by the above equation.\n\n\f1\n\nEntropy Driven Phase Separation\n\n9\n\nFig. 1.6. Even low values of m may yield high polymer densities. (A) The starting\nconfiguration showing a colloid with its depletion zone. The colloid is removed\nand one polymer is inserted at a random location inside the depletion zone (cross)\nresulting in configuration (B). (C) Another colloid is inserted close to the polymer.\n(D) The colloid is removed again with one polymer inserted in its depletion zone\nat the cross resulting in two overlapping polymers.\n\n1.5\n\nErgodicity\n\nNow that the MC scheme obeys detailed balance we need to check if it is\nergodic. An algorithm is ergodic if every point in phase space can be reached\nwith finite probability. It is easy to see that the algorithm is ergodic as far\nas the colloids are concerned. For every inserted colloid, a random location\ninside V was selected so the entire volume is correctly sampled. Similarly,\npolymers also sample the entire volume but do so indirectly, namely via the\nremoval of colloids. Whenever a colloid is removed, a number of polymers are\ninserted in the depletion zone. Since the colloids sample the entire volume,\nso then do the polymers.\nOne might argue that the choice of m in Eq.(1.5) violates ergodicity. If\nat most m − 1 polymers are inserted for every colloid, the polymer density\nwill always be less than (m − 1)/Vδ as a result. While this objection sounds\nreasonable it is in fact unjustified as Fig.1.6 shows.\nFig.1.6 shows an example simulation of the AO model using the cluster\nalgorithm just described with a low value of m, namely m = 2. This means\nthat for every removed colloid, at most one polymer is inserted. The starting\nconfiguration is a volume containing one colloid, see Fig.1.6A. The edge of the\ndepletion zone of the colloid is also drawn. In Fig.1.6B the colloid is removed\nand one polymer is placed very close to the edge of the depletion zone (but\nstill inside of it, of course). The simulation is continued in Fig.1.6C where\nanother colloid is placed into the system. This colloid is placed close to the\npolymer already present, but not too close so the polymer survives. Finally,\nin Fig.1.6D the colloid is removed again and one polymer is placed inside the\ndepletion zone of this colloid, close to the other polymer. The configuration\nin Fig.1.6D now shows two polymers practically stacked on top of each other,\neven though the algorithm was run with m = 2. This removes the above\nobjection.\nRunning the algorithm with such a low value of m is not recommended\nthough. The whole point of this discussion is to show that m does not influence the correctness of the algorithm, only its efficiency.\n\n\f10\n\nRichard Vink\n\n1.6\n\nEarly Rejection Scheme\n\nIn Section 1.3 it was argued that the number of polymers np that one needs to\ninsert for every colloid that is removed cannot simply be a constant. In fact, it\nwas shown that np is a random variable described by a Poisson distribution.\nYet, in the subsequent description of the algorithm it was decided to draw\nnp uniformly, and not from a Poisson distribution. One might wonder if the\nefficiency of the algorithm is not seriously impeded by this choice. The answer\nis it is not, provided one implements the so-called early rejection scheme.\nIn many MC simulations, the usual approach is to make a change to\nthe system, calculate the involved energy change, select a random number\nbetween zero and one, compare this random number to the acceptance rate\nand finally accept or reject the move. In some cases, particularly in systems\nwhere the interactions are hard sphere like, one can do much better.\nConsider for example the removal of a colloidal particle displayed in\nFig.1.5 and the associated acceptance rate Eq.(1.8). Most of the quantities\nappearing in Eq.(1.8) are already known at the start of the move. For example Nc , Vδ , Eσ , m, β and the fugacities. In fact, the only unknowns are np\nand Eτ . We also know that if the move is ever going to be accepted Eτ will\nbe zero at the end. So the only remaining unknown is np which, if you recall,\nis a random number drawn from the interval np ∈ [0, mi. The early rejection\nscheme proceeds as follows:\n1. Select a random number r between zero and one.\n2. Select np uniformly from the interval np ∈ [0, mi.\n3. Calculate the acceptance rate A(Nc → Nc − 1) using Eq.(1.8) with the\nabove value for np and assuming that Eτ is zero.\n4. If r > A(Nc → Nc − 1) reject the move immediately otherwise proceed\nto the next step.\n5. Remove the colloid and insert the np polymers. If any of the inserted\npolymers produce overlap with other colloids reject the move, otherwise\nthe move is accepted.\nThe most CPU time consuming step in the above scheme is step five. However, this step is only performed for those values of np that are reasonable.\nUnreasonable values for np were already filtered out in step four at the cost of\nonly a few multiplications and selecting two random numbers. In this scheme\nit therefore does not matter so much what distribution np is drawn from.\nNeedless to say, the early rejection scheme is highly recommended. To speed\nup the determination of overlap the link-cell method should also be used.\n\n1.7\n\nApplication\n\nIn this section the grand canonical cluster scheme will be used to study bulk\nphase separation in the AO model. Since the AO energy is either zero or\n\n\f1\n\nEntropy Driven Phase Separation\n\n11\n\n0.12\n0\n\nP(ηc)\n\n0.06\n\n0.03\n\n0.00\n0.0\n\nlog P(ηc)\n\n−10\n0.09\n\n−20\n\n∆F\n\n−30\n−40\n−50\n0.0\n\n0.1\n\n0.1\n\n0.2\n\n0.2\nηc\n\n0.3\n\n0.3\n\n0.4\n\n0.4\n\nFig. 1.7. Probability P (ηc ) of observing a colloid packing fraction ηc for an AO\nmixture with {q = 0.8; zc = 87.2; ηpr = 1.0} in a simulation of dimensions Lx =\nLy = 16.7 and Lz = 33.4. The probability is not normalized. The inset shows the\nlogarithm of the probability distribution.\n\ninfinity the temperature plays no role so we simply put β = 1 in the acceptance rates. The phase behavior of the AO model is thus fixed by the colloid\nto polymer size ratio q = Rp /Rc and the fugacities {zc , zp }. We consider here\na size ratio q = 0.8 and put Rc = 1 to set the length scale. The simulations\nare performed in a box with edges Lx × Ly × Lz and using periodic boundary\nconditions. Following convention we define ηpr ≡ zp (4π/3)Rp3 known as the\npolymer reservoir packing fraction. Note that ηpr has no relation to the number of polymers actually in the system. It is just a different way of expressing\nthe polymer fugacity zp .\nIn a naive implementation of the scheme one sets the fugacities {zc , ηpr }\nand starts the simulation. As the simulation proceeds colloids and polymers\nwill enter and leave the box. The crucial quantity to measure is P (ηc ) defined as the probability of observing a box with colloid packing fraction\nηc ≡ (4π/3)Rc3 Nc /V . During the simulation one thus maintains a histogram\ncounting how often a certain colloid packing fraction has occurred.\nIf phase separation occurs P (ηc ) is bimodel. An example distribution is\nshown in Fig.1.7. The peak at low ηc corresponds to the colloid vapor phase\n(V), the peak at high ηc to the colloid liquid phase (L) and the region in\nbetween is the phase-separated regime. The distribution in Fig.1.7 is at coexistence which means that the area under both peaks is equal. At coexistence,\nthe simulation spends equal time in both phases on average. Also shown is\nthe logarithm of P (ηc ). The physical significance of this curve is its relation\nto the free energy. The height of the barrier marked ∆F corresponds to the\n\n\f12\n\nRichard Vink\n1.0\n0.8\n\nηp\n\n0.6\n0.4\n0.2\n0.0\n0.0\n\n0.1\n\n0.2\nηc\n\n0.3\n\n0.4\n\nFig. 1.8. Average polymer packing fraction ηp as a function of the colloid packing\nfraction ηc for an AO mixture at coexistence with q = 0.8 and ηpr = 1.0.\n\nfree energy barrier separating the phases. As was shown by Binder [11] this\nbarrier is related to the surface tension via γ = ∆F/(2A) with A the area of\nthe interface.\nIt is also interesting to measure the average polymer packing fraction ηp ≡\n(4π/3)Rp3 Np /V as a function of ηc . This result is shown in Fig.1.8. In the pure\npolymer phase (ηc = 0) we expect ηp = ηpr because the polymers then mimic\nthe ideal gas. This is precisely what Fig.1.8 shows. As the colloid packing\nfraction increases the polymer packing fraction in the system decreases to\nzero.\nIn the AO model ηpr is the control parameter, much like temperature is\nfor fluid-vapor transitions. To obtain the phase diagram one simply has to\nmeasure P (ηc ) at coexistence for a number of different ηpr . The problem in a\nsimulation is finding the value of zc that yields coexistence for the chosen ηpr\nof interest. Additionally, if the barrier ∆F is high, it will be difficult to sample\nP (ηc ) in the region between the peaks. Fortunately, an array of techniques\nis available to overcome these problems [12]. The results in this work were\nobtained using a new technique called Successive Umbrella Sampling [13].\nFor each P (ηc ) at coexistence one reads off the colloid packing fraction\nof the vapor phase ηcV and of the liquid phase ηcL and plots the two points\n(ηcV , ηpr ) and (ηcL , ηpr ) in a graph. This yields the phase diagram in reservoir\nrepresentation shown in the inset of Fig.1.9. By using Fig.1.8 we can convert\nthe reservoir representation into the experimentally more relevant {ηc , ηp } or\nsystem representation also shown in Fig.1.9. For every P (ηc ) one also obtains\na value for the surface tension using the method of Binder. The results of\nthis procedure are shown in Fig.1.10, in two different representations.\n\n\f1\n\nEntropy Driven Phase Separation\n\n13\n\n1.2\n1.3\n1.0\n\n1.1\nηrp\n\n0.8\nηp\n\n1.2\n\nphase separated\nregime\n\nphase separated\nregime\n\n1.0\n0.9\n\n0.6\n\n0.8\n0.4\n\n0.7\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.2\n0.0\n0.0\n\n0.1\n\n0.2\nηc\n\n0.3\n\n0.4\n\nFig. 1.9. Phase diagram of the AO model with q = 0.8 in system representation.\nCrosses were obtained using box dimensions Lx = Ly = 16.7 and Lz = 33.4;\nopen circles were obtained in a smaller box with dimensions Lx = Ly = 13.3 and\nLz = 26.5. The inset shows the phase diagram in reservoir representation.\n\nFinally, we determine the critical polymer fugacity defined as the value\nof ηpr above which phase separation begins to take place. From the inset\nof Fig.1.9 we see that the critical fugacity is around ηpr ≈ 0.75. We have\nperformed a finite size scaling analysis [14] by measuring the cumulant ratio:\n2\n\nM=\n\nh(ηc − hηc i) i\n,\nh|ηc − hηc i|i2\n\n(1.12)\n\nas a function of ηpr close to the critical point for different system sizes. The\nresults are shown in Fig.1.11. The critical fugacity is at the intersection of\nr\nthe lines from which we obtain ηp,cr\n= 0.766 ± 0.002.\n\n1.8\n\nConclusions\n\nThe grand canonical cluster scheme described in this chapter is very successful\nat modeling phase separation in AO mixtures. In fact, at the time of writing,\nit is unsurpassed in speed and accuracy by other simulation methods [15].\nHowever, the method does have its limitations. If the packing fraction of the\ncolloids is high (say 0.40 and above) the algorithm is no longer efficient. In\nthat case the insertion of colloidal particles fails, not because of overlap with\npolymers, but because of overlap with other colloids. This problem is well\nknown in hard sphere simulations.\nThe algorithm could be improved for systems where the polymer-polymer\ninteraction is not zero. In these cases the random insertion of np polymers\n\n\f14\n\nRichard Vink\n0.8\n0.8\n0.6\n\n0.6\n\nγ*\n\n0.4\n0.4\n\n0.2\n\n0.2\n\n0.0\n0.7\n\n0.0\n0.0\n\n0.9\n\n1.1\n\n1.3\n\nηrp\n\n0.1\n\n0.2\n− ηV\nc\n\n0.3\n\n0.4\n\nηLc\n\nFig. 1.10. Reduced surface tension γ ∗ ≡ 4Rc2 γ for an AO mixture with q = 0.8 as\na function of the difference in the colloid packing fractions in the coexisting liquid\nand vapor phases. The box dimensions were Lx = Ly = 16.7 and Lz = 33.4. The\ninset shows γ ∗ as a function of ηpr .\n\ncumulant ratio M\n\n1.28\n\nL=14.1\nL=15.5\nL=16.7\nL=17.7\nL=21.0\n\n1.24\n\n1.20\n\n1.16\n\n1.12\n0.760\n\n0.765\n\n0.770\n\n0.775\n\nηrp\n\nFig. 1.11. Cumulant ratio M given by Eq.(1.12) as a function of ηpr for an AO\nmixture with q = 0.8 for various system sizes. The simulations were performed in\na cubic box with edge L as indicated. From the intercept (vertical line) we obtain\nr\nfor the critical polymer fugacity ηp,cr\n= 0.766 ± 0.002.\n\n\f1\n\nEntropy Driven Phase Separation\n\n15\n\ninto the depletion zone of a colloid may no longer be efficient. Fortunately,\nthe algorithm is easily adapted to include smarter insertion moves such as\nconfigurational bias [16], recoil growth [17], wormhole MC [18] and perhaps\nPERM [19]. Work along these lines is in progress.\nNote also that the presented method is general. The derivation of detailed\nbalance for example can easily be modified to an AO model confined between\nwalls or to systems interacting with smooth potentials. This would be the\nsubject of further work.\nAcknowledgments I am grateful to the Deutsche Forschungsgemeinschaft\nfor support (TR6/A5) and to J. Horbach, K. Binder, M. Müller, M. Schmidt\nand P. Virnau for collaboration and discussion.\n\n1.9\n\nAppendix: Random Points\n\nHere we argue that the selection of a random point inside a volume V carries\na probability 1/V . The question is most easily answered by assuming that\nthe volume is made up of many tiny cells, each with a volume Γ . The total\nnumber of cells in the volume is thus equal to n = V /Γ and the probability\nof picking one of them is 1/n = Γ/V .\nThe difficulty lies in choosing Γ . In statistical mechanics it is assumed that\nthe smallest element of phase space has a volume determined by the thermal\nwavelength Λ leading to Γ = Λ3 . This explains why the acceptance rates\nof grand canonical MC schemes often contain the thermal wavelength [9,\n10]. Unfortunately, in a MC simulation this is not very useful. Since the\nthermal wavelength depends on temperature, particle mass and even the\nPlanck constant, this choice suggests that a simulation of for example hard\nspheres is temperature and mass dependent.\nThe key observation is that the physics of the system is indifferent to the\nchoice of Γ . To see this consider Eq.(1.8) which is the acceptance rate for\nthe removal of a colloidal particle. Strictly speaking, the volumes V and Vδ\nappearing in Eq.(1.8) must be replaced by V /Γ and Vδ /Γ , respectively. These\nadditional factors of Γ are, however, readily absorbed into the fugacities zc\nand zp . The fugacity is given by z = exp(βμ) with μ the chemical potential,\nso a rescaling of the fugacity merely shifts βμ by a constant. This constant\nhas no physical consequence because it in turn shifts the Hamiltonian by a\nconstant. Thus, Γ has no physical consequence and may therefore be set to\nunity which was done throughout this text.\n\nReferences\n1. S. Asakura and F. Oosawa, J. Chem. Phys. 22, 1255 (1954).\n2. A. Vrij, Pure Appl. Chem. 48, 471 (1976).\n\n\f16\n\nRichard Vink\n\n3. D. G. A. L. Aarts, R. Tuiner, and H. N. W. Lekkerkerker, J. Phys.: Condens.\nMatter 14, 7551 (2002).\n4. R. Roth, R. Evans, and S. Dietrich, Phys. Rev. E 62, 5360 (2000).\n5. M. Schmidt, H. Löwen, J. M. Brader, and R. Evans, Phys. Rev. Lett. 85, 1934\n(2000).\n6. M. Dijkstra and R. van Roij, Phys. Rev. Lett. 89, 208303 (2002).\n7. P. Bolhuis, A. Louis, and J. Hansen, Phys. Rev. Lett. 89, 128302 (2002).\n8. M. E. J. Newman and G. T. Barkema, Monte Carlo Methods in Statistical\nPhysics (Clarendon Press, Oxford, 1999).\n9. D. P. Landau and K. Binder, A Guide to Monte Carlo Simulations in Statistical\nPhysics (Cambridge University Press, Cambridge, 2000).\n10. D. Frenkel and B. Smit, Understanding Molecular Simulation (Academic Press,\nNew York, 2000).\n11. K. Binder, Phys. Rev. A 25, 1699 (1982).\n12. N. Wilding, Am. J. Phys. 69, 1147 (2001).\n13. P. Virnau and M. Müller, submitted (2003), preprint cond-mat/0306678.\n14. See for example, N. Wilding, Annual Reviews of Computational Physics IV,\npage 37 (1996).\n15. R.L.C. Vink and J. Horbach, submitted (2003), preprint cond-mat/0310404.\n16. J. Siepmann and D. Frenkel, Mol. Phys. 75, 59 (1992).\n17. S. Consta, N.B. Wilding, D. Frenkel, and Z. Alexandrowicz, J. Chem. Phys.\n110, 3220 (1999).\n18. J. Houdayer, J. Chem. Phys. 116, 1983 (2002).\n19. H. Hsu, V. Mehra, W. Nadler, and P. Grassberger, J. Chem. Phys. 188, 444\n(2003).\n\n\f"}