{"id": "http://arxiv.org/abs/cond-mat/0412630v1", "guidislink": true, "updated": "2004-12-22T17:03:55Z", "updated_parsed": [2004, 12, 22, 17, 3, 55, 2, 357, 0], "published": "2004-12-22T17:03:55Z", "published_parsed": [2004, 12, 22, 17, 3, 55, 2, 357, 0], "title": "On the growth and form of spherulites", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0412267%2Ccond-mat%2F0412025%2Ccond-mat%2F0412052%2Ccond-mat%2F0412118%2Ccond-mat%2F0412400%2Ccond-mat%2F0412670%2Ccond-mat%2F0412302%2Ccond-mat%2F0412401%2Ccond-mat%2F0412529%2Ccond-mat%2F0412282%2Ccond-mat%2F0412296%2Ccond-mat%2F0412044%2Ccond-mat%2F0412624%2Ccond-mat%2F0412139%2Ccond-mat%2F0412412%2Ccond-mat%2F0412190%2Ccond-mat%2F0412226%2Ccond-mat%2F0412212%2Ccond-mat%2F0412164%2Ccond-mat%2F0412140%2Ccond-mat%2F0412344%2Ccond-mat%2F0412770%2Ccond-mat%2F0412513%2Ccond-mat%2F0412630%2Ccond-mat%2F0412579%2Ccond-mat%2F0412735%2Ccond-mat%2F0412144%2Ccond-mat%2F0412618%2Ccond-mat%2F0412393%2Ccond-mat%2F0412138%2Ccond-mat%2F0412326%2Ccond-mat%2F0412553%2Ccond-mat%2F0412013%2Ccond-mat%2F0412406%2Ccond-mat%2F0412467%2Ccond-mat%2F0412384%2Ccond-mat%2F0412738%2Ccond-mat%2F0412712%2Ccond-mat%2F0412275%2Ccond-mat%2F0412159%2Ccond-mat%2F0412608%2Ccond-mat%2F0412485%2Ccond-mat%2F0412156%2Ccond-mat%2F0412640%2Ccond-mat%2F0412626%2Ccond-mat%2F0412045%2Ccond-mat%2F0412694%2Ccond-mat%2F0412731%2Ccond-mat%2F0412408%2Ccond-mat%2F0412098%2Ccond-mat%2F0412502%2Ccond-mat%2F0412215%2Ccond-mat%2F0412402%2Ccond-mat%2F0412245%2Ccond-mat%2F0412662%2Ccond-mat%2F0412446%2Ccond-mat%2F0412286%2Ccond-mat%2F0412070%2Ccond-mat%2F0412203%2Ccond-mat%2F0412300%2Ccond-mat%2F0412716%2Ccond-mat%2F0412695%2Ccond-mat%2F0412361%2Ccond-mat%2F0412588%2Ccond-mat%2F0412518%2Ccond-mat%2F0412180%2Ccond-mat%2F0412449%2Ccond-mat%2F0412532%2Ccond-mat%2F0412743%2Ccond-mat%2F0412271%2Ccond-mat%2F0412027%2Ccond-mat%2F0412414%2Ccond-mat%2F0412730%2Ccond-mat%2F0412399%2Ccond-mat%2F0412055%2Ccond-mat%2F0412758%2Ccond-mat%2F0412117%2Ccond-mat%2F0412246%2Ccond-mat%2F0412657%2Ccond-mat%2F0412096%2Ccond-mat%2F0412380%2Ccond-mat%2F0412564%2Ccond-mat%2F0412742%2Ccond-mat%2F0412150%2Ccond-mat%2F0412734%2Ccond-mat%2F0412506%2Ccond-mat%2F0412082%2Ccond-mat%2F0412069%2Ccond-mat%2F0412176%2Ccond-mat%2F0412723%2Ccond-mat%2F0412255%2Ccond-mat%2F0412333%2Ccond-mat%2F0412587%2Ccond-mat%2F0412755%2Ccond-mat%2F0412699%2Ccond-mat%2F0412285%2Ccond-mat%2F0412100%2Ccond-mat%2F0412600%2Ccond-mat%2F0412321%2Ccond-mat%2F0412189%2Ccond-mat%2F0412504&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the growth and form of spherulites"}, "summary": "Many structural materials (metal alloys, polymers, minerals, etc.) are formed\nby quenching liquids into crystalline solids. This highly non-equilibrium\nprocess often leads to polycrystalline growth patterns that are broadly termed\n\"spherulites\" because of their large-scale average spherical shape. Despite the\nprevalence and practical importance of spherulite formation, only rather\nqualitative concepts of this phenomenon exist. The present work explains the\ngrowth and form of these fundamental condensed matter structures on the basis\nof a unified field theoretic approach. Our phase field model is the first to\nincorporate the essential ingredients for this type crystal growth:\nanisotropies in both the surface energy and interface mobilities that are\nresponsible for needle-like growth, trapping of local orientational order due\nto either static heterogeneities (impurities) or dynamic heterogeneities in\nhighly supercooled liquids, and a preferred relative grain orientation induced\nby a misorientation-dependent grain boundary energy. Our calculations indicate\nthat the diversity of spherulite growth forms arises from a competition between\nthe ordering effect of discrete local crystallographic symmetries and the\nrandomization of the local crystallographic orientation that accompanies\ncrystal grain nucleation at the growth front (growth front nucleation or GFN).\nThe large-scale isotropy of spherulitic growth arises from the predominance of\nGFN.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0412267%2Ccond-mat%2F0412025%2Ccond-mat%2F0412052%2Ccond-mat%2F0412118%2Ccond-mat%2F0412400%2Ccond-mat%2F0412670%2Ccond-mat%2F0412302%2Ccond-mat%2F0412401%2Ccond-mat%2F0412529%2Ccond-mat%2F0412282%2Ccond-mat%2F0412296%2Ccond-mat%2F0412044%2Ccond-mat%2F0412624%2Ccond-mat%2F0412139%2Ccond-mat%2F0412412%2Ccond-mat%2F0412190%2Ccond-mat%2F0412226%2Ccond-mat%2F0412212%2Ccond-mat%2F0412164%2Ccond-mat%2F0412140%2Ccond-mat%2F0412344%2Ccond-mat%2F0412770%2Ccond-mat%2F0412513%2Ccond-mat%2F0412630%2Ccond-mat%2F0412579%2Ccond-mat%2F0412735%2Ccond-mat%2F0412144%2Ccond-mat%2F0412618%2Ccond-mat%2F0412393%2Ccond-mat%2F0412138%2Ccond-mat%2F0412326%2Ccond-mat%2F0412553%2Ccond-mat%2F0412013%2Ccond-mat%2F0412406%2Ccond-mat%2F0412467%2Ccond-mat%2F0412384%2Ccond-mat%2F0412738%2Ccond-mat%2F0412712%2Ccond-mat%2F0412275%2Ccond-mat%2F0412159%2Ccond-mat%2F0412608%2Ccond-mat%2F0412485%2Ccond-mat%2F0412156%2Ccond-mat%2F0412640%2Ccond-mat%2F0412626%2Ccond-mat%2F0412045%2Ccond-mat%2F0412694%2Ccond-mat%2F0412731%2Ccond-mat%2F0412408%2Ccond-mat%2F0412098%2Ccond-mat%2F0412502%2Ccond-mat%2F0412215%2Ccond-mat%2F0412402%2Ccond-mat%2F0412245%2Ccond-mat%2F0412662%2Ccond-mat%2F0412446%2Ccond-mat%2F0412286%2Ccond-mat%2F0412070%2Ccond-mat%2F0412203%2Ccond-mat%2F0412300%2Ccond-mat%2F0412716%2Ccond-mat%2F0412695%2Ccond-mat%2F0412361%2Ccond-mat%2F0412588%2Ccond-mat%2F0412518%2Ccond-mat%2F0412180%2Ccond-mat%2F0412449%2Ccond-mat%2F0412532%2Ccond-mat%2F0412743%2Ccond-mat%2F0412271%2Ccond-mat%2F0412027%2Ccond-mat%2F0412414%2Ccond-mat%2F0412730%2Ccond-mat%2F0412399%2Ccond-mat%2F0412055%2Ccond-mat%2F0412758%2Ccond-mat%2F0412117%2Ccond-mat%2F0412246%2Ccond-mat%2F0412657%2Ccond-mat%2F0412096%2Ccond-mat%2F0412380%2Ccond-mat%2F0412564%2Ccond-mat%2F0412742%2Ccond-mat%2F0412150%2Ccond-mat%2F0412734%2Ccond-mat%2F0412506%2Ccond-mat%2F0412082%2Ccond-mat%2F0412069%2Ccond-mat%2F0412176%2Ccond-mat%2F0412723%2Ccond-mat%2F0412255%2Ccond-mat%2F0412333%2Ccond-mat%2F0412587%2Ccond-mat%2F0412755%2Ccond-mat%2F0412699%2Ccond-mat%2F0412285%2Ccond-mat%2F0412100%2Ccond-mat%2F0412600%2Ccond-mat%2F0412321%2Ccond-mat%2F0412189%2Ccond-mat%2F0412504&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Many structural materials (metal alloys, polymers, minerals, etc.) are formed\nby quenching liquids into crystalline solids. This highly non-equilibrium\nprocess often leads to polycrystalline growth patterns that are broadly termed\n\"spherulites\" because of their large-scale average spherical shape. Despite the\nprevalence and practical importance of spherulite formation, only rather\nqualitative concepts of this phenomenon exist. The present work explains the\ngrowth and form of these fundamental condensed matter structures on the basis\nof a unified field theoretic approach. Our phase field model is the first to\nincorporate the essential ingredients for this type crystal growth:\nanisotropies in both the surface energy and interface mobilities that are\nresponsible for needle-like growth, trapping of local orientational order due\nto either static heterogeneities (impurities) or dynamic heterogeneities in\nhighly supercooled liquids, and a preferred relative grain orientation induced\nby a misorientation-dependent grain boundary energy. Our calculations indicate\nthat the diversity of spherulite growth forms arises from a competition between\nthe ordering effect of discrete local crystallographic symmetries and the\nrandomization of the local crystallographic orientation that accompanies\ncrystal grain nucleation at the growth front (growth front nucleation or GFN).\nThe large-scale isotropy of spherulitic growth arises from the predominance of\nGFN."}, "authors": ["László Gránásy", "Tamás Pusztai", "György Tegze", "James A. Warren", "Jack F. Douglas"], "author_detail": {"name": "Jack F. Douglas"}, "author": "Jack F. Douglas", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.72.011605", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0412630v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0412630v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 11 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0412630v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0412630v1", "journal_reference": null, "doi": "10.1103/PhysRevE.72.011605", "fulltext": "On the growth and form of spherulites\nLászló Gránásy1*, Tamás Pusztai1, György Tegze1, James A. Warren2, Jack F. Douglas3\n1\n\nResearch Institute for Solid State Physics and Optics, P.O. Box 49, H-1525 Budapest, Hungary;\nMetallurgy and 3Polymers Divisions, National Institute of Standards and Technology, Gaithersburg, Maryland 20899\n(Received ...)\n\n2\n\nMany structural materials (metal alloys, polymers, minerals, etc.) are formed by quenching liquids\ninto crystalline solids. This highly non-equilibrium process often leads to polycrystalline growth patterns that are broadly termed 'spherulites' because of their large-scale average spherical shape. Despite\nthe prevalence and practical importance of spherulite formation, only rather qualitative concepts of this\nphenomenon exist. The present work explains the growth and form of these fundamental condensed\nmatter structures on the basis of a unified field theoretic approach. Our phase field model is the first to\nincorporate the essential ingredients for this type crystal growth: anisotropies in both the surface energy\nand interface mobilities that are responsible for needle-like growth, trapping of local orientational order\ndue to either static heterogeneities (impurities) or dynamic heterogeneities in highly supercooled liquids, and a preferred relative grain orientation induced by a misorientation-dependent grain boundary\nenergy. Our calculations indicate that the diversity of spherulite growth forms arises from a competition\nbetween the ordering effect of discrete local crystallographic symmetries and the randomization of the\nlocal crystallographic orientation that accompanies crystal grain nucleation at the growth front (growth\nfront nucleation or GFN). The large-scale isotropy of spherulitic growth arises from the predominance\nof GFN.\nPACS number(s): 61.72.Bb, 61.72.Mm, 64.60.Qb, 64.70.Dv, 81.10.Aj\nI. INTRODUCTION\n\nSpherulites are ubiquitous in solids formed under\nhighly non-equilibrium conditions [1]. They are observed\nin a wide range of metallurgical alloys, in pure Se [2,3], in\noxide and metallic glasses [4,5], mineral aggregates and\nvolcanic rocks [6,7], polymers [1,8], liquid crystals [9],\nsimple organic liquids [10], and diverse biological molecules [11]. Many everyday materials, ranging from plastic\ngrocery bags to airplane wings and cast iron supporting\nbeams for highway bridges, are fabricated by freezing liquids into polycrystalline solids containing these structures.\nThe properties and failure characteristics of these materials\ndepend strongly on their microstructure, but the factors that\ndetermine this microstructure remain poorly understood\n[1].\nWhile the term 'spherulite' suggests a nearly spherical\nshape (circular shape in two dimensions where the term\nspherulite is still employed), this term is used in a broader\nsense of densely branched, polycrystalline solidification\npatterns [2,9,12–21]. Spherulitic patterns exhibit a diversity\nof forms and representative patterns are shown in Fig. 1.\nExperimental studies performed over the last century\nindicate that there are two main categories of spherulites\n[20,21]. Category 1 spherulites grow radially from the nucleation site, branching intermittently to maintain a space\nfilling character (Fig. 2). In contrast, category 2 spherulites\ngrow initially as thread-like fibers, subsequently forming\nnew grains at the growth front (Fig. 2). This branching of\nthe crystallization pattern ultimately leads to a crystal\n'sheaf' that increasingly splays out during growth. At still\nlonger times, these sheaves develop two 'eyes' (uncrystallized regions) on each side of the primary nucleation site\n[see Fig. 1(h)]. Ultimately, this type of spherulite settles\ndown into a spherical growth pattern, with eye structures\napparent in its core region. In some materials, both catego-\n\nries of spherulite occur in the same material under the same\nnominal thermodynamic conditions [Fig. 1(i)].\nWhile the widely different systems indicated in Fig. 1\nsurely involve disparate molecular scale dynamical processes, the evident similarities of their morphologies (tendency for space filling, polycrystallinity, elongated fiberlike grains, etc.) suggest that a general coarse-grained description of this type of pattern formation can be formulated.\nWhile there is no generally accepted theory of spherulite crystallization, a number of phenomenological models\nand necessary physical conditions for this process have\nbeen suggested [1,8–10,22]. The most prevalent conception\nof their origin is the qualitative model of Keith and Padden\n[13], in which the presence of static heterogeneities (impurities or molecular defects and mass polydispersity in\npolymeric materials) lead to a rejection of these components from the growth front to form channels similar to\nthose found in eutectics. The observation of spherulitic\ngrowth in highly pure liquids by Magill and others [1−3],\nhowever, indicates that this cannot be a general explanation\nof this growth form. Magill, and others preceding him [23],\nhave emphasized that a critically large viscosity, characteristic of high supercooling, seems to be required for spherulites to form. The occurrence of \"secondary\" nucleation at\nthe growth front (similar to \"sympathetic\" nucleation observed during solid state precipitation [24] or \"double nucleation\" in the biological literature [25–28]) has also been\nemphasized as an essential feature of spherulite formation\nin polymeric fluids [29]. Random lamellar branching with\npreferred crystallographic misfit is also expected to play an\nimportant role [1,15]. Recent experimental studies of\nspherulitic growth in thin polymer films by atomic force\nmicroscopy strongly support these views [30].\n\n\f2\n\na\n\nb\n\nc\n\nd\n\ne\n\nf\n\ng\n\nh\n\ni\n\nj\n\nFIG. 1. Various spherulitic morphologies. (a) Densely branched spherulite formed in a blend of isotactic and atactic polypropylene (Ref. 12). (b) 'Spiky spherulite' grown in malonamide-d-tartatic acid mixture (Ref. 13). (c) Arboresque spherulites forming in polypropylene film (Ref. 14), (d) and (e) 'Quadrites' formed by nearly rectangular branching in isotactic polypropylene\n(Refs. 15, 16). (f) Spherulite formed in pure Se (Ref. 2). (g) Crystal sheaves in pyromellitic dianhydrite-oxydianilin poly(imid)\nlayer (Ref. 17). (h)Typical category 2 spherulites (a thin film of polybutene) with two \"eyes\" on the sides of the nucleus (Ref. 18).\n(i) Multi-sheave / early spherulite structure formed in dilute long n-alkane blend (Ref. 19). (j) Arboresque growth form in polyglycine (Ref. 20). To improve the contrast/visibility of the experimental pictures, false colors were applied. The linear size of the\npanels are (a) 220 μm, (b) 960 μm, (c) 2.4 mm, (d) 2.5 μm, (e) 7.6 μm, (f) 550 μm, (g) 2.5 μm, (h) 20 μm, (i) 250 μm, and (j) 1.7\nμm, respectively.\n\nOur previous work [31] proposed a unified description\nof the origin of polycrystalline growth. We established that\npolycrystalline growth generally arises from the quenching\nof orientational defects that can arise from either static heterogeneities (impurities) or dynamic heterogeneities intrinsic to supercooled liquids. We termed this secondary\nnucleation of crystal grains at the crystal growth front as\ngrowth front nucleation (GFN). Both types of disorder\nyield strikingly similar effects on crystallization morphologies [31]. Thus, we can expect spherulite formation to occur in both highly impure and pure supercooled fluids. Spatial heterogeneities due to phase separation can provide another source of static disorder giving rise to spherulitic\ngrowth [32,33]. Given this duality between dynamic and\nstatic heterogeneities, we focus herein on polycrystalline\ngrowth in particulate-free supercooled liquids. In this case,\nthe glass-forming nature of the fluid is found to play a key\nrole in the spherulite formation process and we briefly review some of the essential aspects of this phenomenon.\nIt is now appreciated that highly supercooled liquids are\ncharacterized by the presence of long-lived dynamic heterogeneities. These heterogeneities are associated with the\nformation of regions within the fluid that have either a\nmuch higher or much lower mobility relative to a simple\nfluid in which particles exhibit Brownian motion [1,34–\n36]. These nanoscale heterogeneities persist on timescales\nof the order of the stress relaxation time, which can be\nminutes near the glass transition and eons at lower temperatures. The presence of such transient heterogeneities\nleads to dramatic effects on the dynamics of supercooled\nliquids [37–41].\nDynamic heterogeneity has numerous consequences for\nthe transport properties of these complex fluids. The most\nimportant transport properties of relevance to crystalliza-\n\ntion are the shear viscosity (η) and the molecular mobilities\ndetermined by the translational (Dtr) and rotational diffusion (Drot) coefficients. These diffusion coefficients characterize the rate of molecular translation and rotation, directly\ncontrolling the manner that molecules attach and align with\nthe growing crystal [34,39−41]. It is a common property of\nhighly supercooled liquids that the ratio of the rotational\nand translational diffusion coefficients (χ = Drot /Dtr) decreases sharply (by orders of magnitude) from their nearly\nconstant high temperature values (χ0) [34,37−42]. This 'decoupling' phenomenon means that molecules translate increasingly large distances before they rotationally decorrelate from their initial orientation [34,37−41].\nRecently we demonstrated that a drop in χ, characteristic of highly supercooled liquids, enhances the growth of\nnew grains as misoriented crystal regions at the liquid-solid\ninterface have difficulty aligning with the parent crystal. In\nCategory 1\n\nCategory 2\n\nFIG. 2. Concepts for the formation of category 1 and 2\nspherulites. From left to right: Category 1 spherulite formed\nvia central multidirectional growth. Formation of category 2\nspherulite from a folded-chain single crystal (A) to the fully\ndeveloped spherulite (E) via unidirectional growth and low\nangle branching (Ref. 15). Note that the latter mechanism\nmay lead to the formation of two 'eyes' (uncrystallized\nholes) on the sides of the nucleation site.\n\n\f3\n\nother words, polycrystalline growth will arise if the\nreorientation of molecules is slow relative to the interface\npropagation. This argument implies that static heterogeneities and the mobility asymmetry (χ « χ0) of supercooled\nliquids should give rise to a common tendency towards\npolycrystalline growth. It is emphasized that our simulations do not model the nanoscale dynamic heterogeneities\nexplicitly, but instead model the consequences of these heterogeneities on molecular transport, as is appropriate for a\ncoarse-grained model.\nHere we present a unified model of polycrystalline solidification that incorporates the essential ingredients\nneeded to describe complex growth morphologies and explore its ability to describe polycrystalline spherulites.\nII. PHASE FIELD THEORY WITH CRYSTALLOGRAPHIC\nBRANCHING\n\nOur two-dimensional phase field theory builds on the\nphase field models of primary nucleation of crystals from\nthe melt [43] and multigrain solidification [43,44], which\nincorporate the diffusional instabilities and crystal anisotropies of the interface free energy and molecule-attachment\nkinetics, and the possibility for trapping orientational defects into the solid. This model has been successfully applied to describe transformation kinetics in alloys [43] and\nthe interaction of particulate additives with dendrites [45].\n(Recent reviews on the phase field technique and its\napplication to polycrystalline solidification are available in\nRefs. 46–48.)\nThe novel aspect of the approach used in the present\npaper is the introduction of branching with a fixed crystallographic misorientation, realized through an orientationdependent grain boundary energy. The combination of\nthese essential factors provides a general model of polycrystalline solidification, suitable to describe the formation\nof complex polycrystalline patterns, in particular the\ngrowth and form of spherulites.\nThe local state of matter is characterized by the phase\nfield φ. This order parameter describes the extent of structural change during freezing and melting. The other basic\nfield variables are the chemical composition c and the normalized orientation field θ [43], where θ specifies the orientation of crystal planes in the laboratory frame. The free\nenergy F consists of various contributions that will be discussed below:\n\n α T\n2\nF = ∫ d 3 r  0 s 2 (θ ,θ ) ∇φ + f (φ , c, T ) + f ori ( ∇θ )  (2.1)\n\n 2\n2\n\nwhere\nf (φ , c, T ) = w(c)Tg (φ ) + [1 − p(φ )] f S (c, T ) + p(φ ) f L (c, T )\n\nα02 =\n\n6 2γ A, Bδ A, B\nT A, B\n\n, w(c) = (1 − c) wA + cwB , wA, B =\n\ng (φ ) = 14 φ 2 (1 − φ ) 2 , g ′(φ ) = φ 3 − 32 φ 2 + 12 φ\np(φ ) = φ 3 (10 − 15φ + 6φ 2 ),\n\np′(φ ) = 30φ 2 (1 − φ ) 2\n\n12γ A, B\n2δ A, BTA, B\n\n,\n\nand\nf ori = [1 − p(φ )]\n\nHT\n{xF0 + (1 − x) F1}\n2ξ 0\n\n\n sin (2πmξ 0 ∇θ\nF0 = \n1\n\n\n sin (2πnξ 0 ∇θ\nF1 = \n1\n\n\n)\n\n)\n\n3\n4m\notherwise\n\nfor ξ 0 ∇θ <\n\n1\n4n\notherwise\n\nfor ξ 0 ∇θ <\n\n[\n\ns (θ ,θ ) = 1 + s0 cos[k (θ − 2πθ / k )], θ = arctan (∇φ ) y /(∇φ ) x\n\nθ ∈ [0,1],\n\nΞ=\n\n]\n\n2π\nθ\nk\n\nHere α0 is a constant, T the temperature, and Ξ is the orientation angle in the laboratory frame. The gradient term for the\nphase field leads to a diffuse crystal-liquid interface, a feature observed both in experiment [49] and computer simulations [50]. The free energy density f(φ,c,T) has two minima\n(φ = 0, and φ = 1, corresponding to the crystalline and liquid phases), whose relative depth is the driving force for\ncrystallization and is a function of both temperature and\ncomposition as specified by the free energy densities in the\nbulk solid and liquid, fS,L(c,T), respectively.\nThe dependence of the surface energy on orientation of\nthe liquid solid interface is introduced through the function\ns(θ,θ), which multiplies the penalty for gradients in φ. As s\nintroduces a misorientation dependence to the surface energy\n[51], it is possible to introduce favored misorientations\nthrough this coefficient. However, it is also possible to introduce misorientation dependencies via a coupling to gradients in θ. Specifically, preferred crystallographic misfits are\nintroduced into our model through the orientational contribution to the free energy density fori, that represents the excess\nfree energy density due to inhomogeneities in crystal orientation in space, in particular the misorientation due to a grain\nboundary. Its form ensures that θ takes an essentially constant value (scaled between 0 and 1) in the solid, while in the\nliquid it fluctuates. The latter feature reflects the local order\nin the liquid. Orientational ordering takes place at the diffuse\ninterface simultaneously with the structural transition. The\nfree energy of low-angle grain boundaries scales with HT,\nξ0 is the correlation length of the orientation field, while\np(φ), following the procedure commonly used in phase field\ntheory [52,53], varies smoothly from 0 to 1 as φ changes\nfrom the solid to the liquid. The orientational free energy\nhas two local minima as a function of the angle ξ0∇θ,\ncorresponding to no misorientation and a preferred misorientation (Fig. 3). This means that regions with a large\nenough orientation difference from a neighboring parent\ncrystal will relax towards a finite misorientation. This selection of grain orientation only occurs provided that noise\ndoes not disrupt the process. The branching angle and the\ndepth of this metastable minimum of fori are specified by m,\nn and x.\n\n\f4\n\nFIG. 3. Orientational free energy fori as a function of\nmisorientation angle (in degree) for two-fold symmetry (k =\n2), while n = 1⁄2, m = 3, and x = 0.2. If the neighboring pixel\nhas a smaller misorientation than ~20° (local maximum), it\ncan reduce the free energy by relaxing to the bulk crystal\norientation (0°). If misorientation is larger than this, the\nclosest minimum is 30°. So, neighboring pixels of large\nmisorientation tend to relax to 30°, unless fluctuations prevent this. Note that θ is an angular variable, so the maximum\npossible misorientation is ∆θmax = 0.5.\n\nIn any real system there will be many preferred (low\nenergy) orientations, a reflection of the underlying crystallographic symmetries. In our illustrative calculations n = 1⁄2\nhas been set, while m = 1, 2, and 3 correspond to branching\nwith 90, 45, and 30 degrees, respectively. We note that,\nwith appropriate choice of the parameters (x = 0), GFN with\nrandom orientation of the new grains [29,48] can also be recovered.\nSince we are modeling quasi-two-dimensional systems,\nthe orientation field is simply a scalar, which is suitable for\nthe description of transformations in thin layers of thickness\nL, where along thickness (direction z) the system is considered uniform. The true three-dimensional (3D) free energy\nfunctional would depend on a 3D vectorial orientation field.\n\nmicroscopic counterparts. The mobility Mc, is directly proportional to the classic interdiffusion coefficient for a binary mixture. The mobility Mφ dictates the rate of crystallization, while Mθ controls the rate at which regions reorient.\nAs discussed in the introduction, dynamic heterogeneities exist at the nanometer scale, but we do not model these\nfluctuations directly, as our model is coarse-grained. Since\nχ/χ0 is characteristically small in supercooled liquids, we\npostulate a corresponding reduction in the ratio of Mθ/Mφ to\nmodel the average effect of dynamic heterogeneity on\nglobal relaxation. This assumption is plausible because\nthese coarse-grained mobilities are functions of their molecular counterparts. Moreover, recent experiment has\nshown that the rate of crystallization in highly supercooled\nliquids is proportional to Dtr, even under decoupling conditions [34,40,41]. In our model, the growth velocity scales\nlinearly with Mφ, so consistency requires Mφ ∝ Dtr. Since\nwe also expect that Mθ ∝ Drot ∝ 1/η, we arrive at χ ∝\nMθ/Mφ.\n1. Phase field\nUsing the length and time scales ξ and ξ 2/Dl, respectively, where Dl is the chemical diffusion coefficient in the\nliquid, the dimensionless phase field mobility mφ = mφ,0 {1 +\nδ0 cos[k(ψ − θ)]}, and mφ,0 = Mφα02T/Dl, the following\ndimensionless form emerges\n~ 2 ~\n\n∂  ∂s ∂φ  ∂  ∂s ∂φ \n∇ ( s ∇φ ) − ~ s\n\n\n + ~ s\n~\n~\n~\nθ\nθ\n∂\nx\n∂\n∂\ny\n∂\ny\n∂\n∂\nx\n\n\n\n\n\nφ& = mφ \n\n2 w( c )Tg ′(φ ) + p ′(φ ){ f L (c, T ) − f S ( c, T ) − f ori }\n\n\n−ξ\n2\nεφ T\n\n\n\n(2.3)\nHenceforth quantities with tilde are dimensionless, while\nprime denotes differentiation with respect to the argument.\n2. Concentration field\n\nA. The governing equations\nTime evolution is governed by relaxational dynamics and\nLangevin noise terms are added to model thermal fluctuations [43,48],\nφ& = − M φ\n\n  ∂f  ∂f \nδF\n −  + ζ φ\n= M φ ∇\nδφ\n  ∂∇φ  ∂φ \n\nc& = ∇M c ∇\n\nθ& = − M θ\n\n\n ∂f \n \nδF\n ∂f \n= ∇ Dc(1 − c)∇   − ∇\n − ζ j \nδc\n∂\n∂∇\nc\nc\n\n\n\n\n\n\n \n\n(2.2)\n\n  ∂f  ∂f \nδF\n= M θ ∇\n−\n +ζθ\nδθ\n  ∂∇θ  ∂θ \n\nwhere ζi are the appropriate Langevin-noise terms.\n\nThe time scales for the three fields are determined by the\nappropriate mobilities appearing in the equations of motion,\nand Mφ, Mc and Mθ are the mobilities associated with coarsegrained equation of motion, which in turn are related to their\n\nFollowing previous works [53,54], we choose the mobility of the concentration field as Mc = (vm/RT) D c (1 − c),\nwhere vm is the average molar volume, and D = Ds + (Dl –\nDs) p(φ) is the diffusion coefficient. This choice ensures\ndiffusive equation of motion. Since HT is assumed independent of concentration, no coupling to the orientation\nfield emerges. Introducing the reduced diffusion coefficient\nλ = D/Dl, the dimensionless equation of motion for the concentration field reads as\n\n∂f\n\n\n( w − w A )Tg (φ ) + [1 − p (φ )] S (c, T ) \n~ ~  vm\n~ B\n\n∂c\n\nλc(1 − c)∇ \nc& = ∇ \n∂\nf\nRT\n\n\nL\n\n+ p (φ )\n( c, T )  \n\n∂c\n\n \n(2.4)\n\n\f5\n\nζ' = ζ (∆x/∆x')⋅(∆t'/∆t)1/2⋅ (T'/T)1/2⋅ (L/L')1/2,\n\nTABLE I. Physical properties of Cu and Ni\nTf\nL\n\nγ\nδ\n\nDl\n\nCu\n1358\n1728\n247\n~1\n10−5\n\n(K)\n(J/cm3)\n(mJ/m2)\n(nm)\n(cm2/s)\n\nNi\n1728\n2350\n315\n~1\n10−5\n\n3. Orientation field\nIntroducing the dimensionless correlation length of the\n~\norientation field ξ 0 = ξ 0 / ξ , and defining the dimensionless\norientational mobility as mθ = Mθ ξ HT / Dl, the dimensionless equation of motion is as follows\n \n~\n~\n~\n∇\n[1 − p(φ )]π xF0 m + (1 − x) F1n\n \n~\nθ& = mθ  \n\n2\n~ 2\n− α 0 s ∂s ∇\nφ\n Hξ ∂θ\n\n[\n\n]\n\n~\n∇θ\n~\n∇θ\n\n\n\n\n\n\n\n\n\n(2.5)\n\nwhere\n\n[ (\n\n)] (\n\n~ ~\n~ ~\n\n~ sign sin 2πmξ 0 ∇θ cos 2πmξ 0 ∇θ\nF 0= \n0\n\n\n[ (\n\n)] (\n\n~ ~\n~ ~\n\n~ sign sin 2πnξ 0 ∇θ cos 2πnξ 0 ∇θ\nF1 = \n0\n\n\n)\n\n)\n\nfor\n\n~ ~\n\nξ 0 ∇θ <\n\n3\n4m\n\notherwise\nfor\n\n~ ~\n\nξ 0 ∇θ <\n\n1\n4n\n\notherwise\n\nThis form of fori, and the noise added to the equation of motion ensure that the orientation field θ is random in space\nand time in the liquid. This makes possible to quench\norientational defects into the solid, leading to\npolycrystalline growth. Independently, branching with\nfixed relative misorientation may occur, i.e., sharp (steplike) grain boundaries of fixed orientational misfit (of fixed\ngrain boundary energy) appear.\nThe second term on the RHS of Eq. (2.5) must be handled with care. It is negligible if the physical interface\nthickness (~ 1 nm) is used. Due to limitations of computer\npower, we employ a relatively broad interface compared to\nthose found in metallic alloys. This broad interface leads to\nartifacts that are not present with thinner interfaces. As a\npractical matter, we adopt one of the following measures:\n(a) perform the calculations in the presence of only kinetic\nanisotropy (then this term is zero); (b) we omit this term.\n\n(2.6)\n\nwhere the primed quantities are for the actual simulation, and\nthose without prime belong to a reference state, in which the\nnoise amplitude was ζ.\nAs pointed out in Ref. 55, the noise amplitude varies\nwith the volume of the simulation cells. In our quasi-2D system, the cell volume is V = L ∆x2, i.e., it depends on the\nchoice of the layer thickness. In other words, the amplitude\nof the noise might be regarded as an adjustable variable [56].\nIn the case of the conserved concentration field, random\nconcentration fluxes were added to the equation of motion\n[55].\n5. Numerical solution\nThe governing equations have been solved numerically\nusing an explicit finite difference scheme. Periodic boundary conditions were used. The time and spatial steps were\nchosen to ensure stability of our solutions. As the computed morphologies are fundamentally determined by\nthermal fluctuations at the growth front, convergence to a\nparticular morphology, as we refine the grid and timestep,\nis possible only in a statistical sense (i.e. the rate of GFN,\nbranching frequency, and the solid fraction inside the solidification envelopes). We note that accurate solutions to\nthe orientation equation require approximately 1/50 of the\ntime step required for the stable solution of the other fields.\nA parallel code has been developed that relies on the\nMessage Passing Interface (MPI) protocol and was run on a\nPC cluster built up at the Research Institute for Solid State\nPhysics and Optics, Budapest, exclusively for phase field\ncalculations. This cluster consists of 75 nodes and a server\nmachine. The present paper is based on computations\nexceeding 40 CPU-years on a 2GHz processor.\nWe expect the physical systems of interest to have interface thickness of about 1 nm. Using the algorithms we\nhave implemented for our parallel code, we are constrained\nto use a significantly thicker interface (about 40 times larger). Indeed, these already ambitious calculations would\ntake about 1,000,000 times longer using a physical value of\nthe interface thickness. However, our own examination of\nthe behavior of the model equations, as well as the experience of many others doing phase field research, imply that\nthe structures obtained by these methods are not only qualitatively correct, but also have predictive power. Specifically, the calculations provide insight and understanding\ninto the mechanisms controlling spherulite formation, as\nwell as demonstrating the factors that influence this type of\npattern formation. We are confident that algorithmic developments will ultimately enable quantitative computations\nof the patterns investigated herein.\n\n4. The noise\nGaussian noises of amplitude ζ = ζs + (ζl – ζs) p(φ) are\nadded to the non-conserved fields, where ζl and ζs are the\namplitudes in the liquid and solid. The noise has been\ndiscretized as described in Ref 55. Its amplitude scales with\nthe spatial and time steps, with the temperature and the film\nthickness as follows:\n\nC. Materials and simulation parameters\nFor specificity, we employ the well-studied, ideal solution phase diagram of the Ni-Cu alloy (for relevant properties see Table I.). This choice is not particularly restrictive,\nas it is formally equivalent to a pure material [53], where\nthermal diffusion replaces solute diffusion as the dominant\n\n\f6\n\ntransport mechanism. Moreover, the model is no way restricted to metals as our application to polymer materials\nbelow demonstrates. Unless stated otherwise, we fix the\ntemperature to be 1574 K, as in previous studies. The orientation dependence of the molecular attachment kinetics is\nmodeled by Mφ = Mφ,0{1 + δ0 cos[k(θ − 2πθ/k)]}. The angle\nψ is the inclination of the liquid-solid interface in the laboratory frame and k is the symmetry index. The fiber-like crystallites forming in many of the polymeric matter imply a\ntwo-fold symmetry (k = 2) and a large kinetic anisotropy,\nwhich was chosen as δ0 = 0.995. A similar approach is used\nto describe the interfacial free energy: γ = γ0 s(θ,θ). Crystal\ngrowth is sensitive to both kinetic and interfacial free energy\nanisotropies, where increasing either yields sharper needle\ncrystal morphologies. Our calculations were performed with\nsupersaturations in the range 0.75 ≤ S = (cL − c)/(cL − cS) ≤\n1.2, where cL = 0.466219, cS = 0.399112 and c are the concentrations at the liquidus, solidus, and the initial homogeneous liquid mixture, respectively.\nSince the physical thickness of the interface is in the\nnanometer range and the typical solidification structures\nare far larger (μm to mm), a full simulation of polycrystalline solidification from nucleation to particle impingement\ncannot be performed even with the fastest of the present\nsupercomputers. Since we seek here a qualitative understanding, following other authors [53,54], the interface\nthickness has been increased by a factor of 20.8, the interface free energy has been divided by 6, while the diffusion\ncoefficient has been increased by a factor of 100. This allows us to follow the life of crystallites from birth to impingement on each other. The dimensionless time and spatial steps were ∆t = 4.75×10−6 and ∆x = 6.25×10−3, ξ\n\n=2.1×10−4 cm, ξ0/ξ = ∆x and Dl = 10−5 cm2/s. Unless stated\notherwise, dimensionless mobilities of mφ,0l = 1.0 and mθ,l\n= 360, and mθ,s = 0 were applied, while Ds = 0 was taken in\nthe solid. White noises of amplitudes 0.0025, 0.00125, and\n0.0375 were used for the three fields φ, c and θ, respectively, except in the nucleation runs, where the phase field\nnoise was enhanced to 0.0125 to speed up the process.\nIII. RESULTS\n\nA. Growth of spherulites\nFirst, we explore the fundamental question \"how can a\ncrystal grow as a sphere?\" Theoretically, one can grow a\n\"ball\" with growth kinetics consistent with simple diffusion\n(i.e. the radius R of the crystal increases as t1/2 with time) at\nlow driving forces (supersaturations). For such a shape, the\nsolute rejected from the growing crystal is incorporated\ninto a boundary layer that extends far into the liquid. However, this situation is essentially never observed in real systems, except as a transient.\nAt larger driving forces, where the system is far from\nequilibrium, the liquid-solid interface becomes unstable\n(the Mullins-Sekerka instability [57]), and the crystallization pattern breaks up into a fingered structure commonly\ntermed \"seaweed,\" [Fig. 4(a)]. The lengthscale of the fingers is determined by a competition between diffusion and\nthe surface energy [57]. If there is sufficient anisotropy\nthen the growth form leads to \"symmetric\" dendritic\ngrowth [Fig. 4(b)]. From a mathematical perspective, this\ninstability is a consequence of the non-linear contributions\n\na\n\nb\n\nc\n\nd\n\ne\n\nf\n\nFIG. 4. From single crystals to category 1 spherulites. Single crystal growth forms for (a), (d) isotropic (s0 = 0) and (b), (e)\nanisotropic interfacial free energy (s0 = 0.1). (c), (f) Polycrystalline morphologies obtained by repeating the anisotropic calculations while reducing the orientational mobility by a factor of 0.15. Composition maps (odd columns) and orientation maps (even\ncolumns) are shown. All calculations were performed on a 500 × 500 grid (6.6 μm × 6.6 μm). Computations performed at two supersaturations are presented (upper row: S = 0.8; lower row: S = 1.0). The phase field mobility is assumed isotropic. No metastable branching orientation is offered [the orientational free energy has only a single minimum (x = 0)]. Crystallization was initiated\nby inserting a slightly supercritical fluctuation at the center of the simulation window without orientational preference. The final\ncrystallographic orientation develops from the fluctuating local orientation as determined by the governing equation. Since the\nsame random noise was used in all cases, the 'yellow' direction nucleated when single crystals formed. In contrast, several orientations nucleated simultaneously, when reducing the orientational mobility. (Coloring: Composition maps: yellow − solidus, dark\nblue − liquidus. Orientation maps: When the fast growth direction is upwards, 30, or 60 degrees left, the grains are colored blue,\nyellow or red, respectively, while the intermediate angles are denoted by a continuous transition among these colors. Owing to the\nfour-fold symmetry, orientations that differ by 90 degree multiples are equivalent.)\n\n\f7\n\na\n\nb\n\nc\n\nd\n\nFIG. 5. Isothermal transition between a square-shaped single crystal and a category 1 spherulite induced by growth front nucleation, as predicted by the phase field theory. Note the gradual morphological transition, and the lack of a sharp demarcation\nline between areas solidified with square and spherulitic morphology in the fully-grown spherulite. With increasing size, the\nshape becomes more isotropic due to the randomizing effect of the newly formed grains. Note also the self-organized selection of\ngrains whose maximum growth direction is perpendicular to the interface, yielding a cross-like pattern of grains with equivalent\ncrystallographic orientations. [4000 × 4000 grid. Snapshots taken at 1000, 2500, 5000, and 13 500 dimensionless time-steps,\nrespectively are displayed. Panels (a)-(d) show the central 2,000 × 2,000 section of the simulation, while panel (d) shows the full\n4000 × 4000 simulation.] Upper row: composition maps (a grayscale colormap was employed to increase contrast: black – liquidus, white – solidus). Lower row: orientation maps (coloring as in Fig. 4).\nto the equations of motion, which convert the spreading of\nthe crystallization pattern from a diffusive (R ~ t1/2) to\nwavelike (R ~ t) propagation. Physically, this dramatic increase in front speed results from a drastic reduction in distance that the solute rejected by the interface must diffuse,\nbecause the liquid channels between the fingers act as a local solute sink. The highly enriched liquid is thus incorporated (trapped) into the growing crystal, in accord with the\nKeith and Padden picture of spherulitic growth. Such structures are also obtained in eutectic crystallization, where the\nsecond phase plays an analogous role to the liquid channels\n[58–61].\nSpherical crystallization patterns also arise when \"solute trapping\" occurs, as manifested by the absence of solute\nrejection at the liquid-solid interface. This phenomenon occurs when the diffusion length approaches the interface\nwidth so that chemical diffusion and associated morphological instabilities are suppressed. Examples of this basic\neffect are illustrated in Figs. 4(d) and 4(e), which show single crystals growing under efficient solute trapping (extreme supersaturation) with and without anisotropy. Such\nregular single-crystal patterns are relatively rare.\nMost spherical growth patterns observed in nature are\npolycrystals. The disorder of these structures emerges via\ngrowth front nucleation, which leads to a randomization of\nthe local crystallographic orientation while retaining isotropy at large scales. Regardless of what growth form is dictated by crystallographic symmetry, these spherical growth\nforms occur robustly if the disorder is sufficiently large. In\nour view, this is the essence of spherulite formation.\nThe transition from crystalline to polycrystalline growth\nis illustrated in Fig. 4. The supersaturation S is 0.8 or 1.0 in\n\nthe upper and lower rows, respectively. The transition between the symmetric dendrite shown in Fig. 4(b) and the\npolycrystalline dendrite in Fig. 4(c) occurs as χ is reduced\nto model the influence of dynamic heterogeneities [31]. If\nwe additionally increase the supersaturation, we obtain a\nhighly branched polycrystalline crystallization pattern with\nan average circular shape, as shown in Fig. 4(f). This is a\nspherulite of category 1. Note the radially elongated grain\nstructure, forming due to the self-organized selection of\ngrains that have their fast growth direction perpendicular to\nthe interface. Polycrystalline spherulites thus form when\nthe driving force is large and the orientational mobility is\nsmall, a situation characteristic of highly undercooled complex liquids.\nRegardless of the imposed crystallographic symmetries\n(two-, four- and six-fold were investigated), polycrystalline\nspherulites form with the same general structure. The fineness of the needle-like internal structures of the spherulites\nincreases with increasing supersaturation.\nCategory 1 spherulites have also been seen to form\nfrom transient single crystal nuclei [62]. Our model captures the gradual transition from square-shaped single crystals to circular shape under isothermal conditions. As seen\nin simulation, square-shaped single crystals nucleate after\nan initial incubation period. After exceeding a critical size\n(that depends on the ratio χ of the rotational and translational diffusion coefficients), the growing crystal cannot establish the same crystallographic orientation along its perimeter. Thus new grains form by growth front nucleation\n[31] as described in the introduction. This process gradually establishes a circular perimeter for large particles (Fig.\n5).\n\n\f8\n\nFIG. 6. Polycrystalline morphologies formed by random branching with a crystallographic misfit of 30 degrees. The kinetic\ncoefficient has a two-fold symmetry and a large, 99.5%, anisotropy, expected for polymeric substances. Simulations were performed on a 500 × 500 grid (6.6 μm × 6.6 μm). Upper row: composition map (yellow − solidus, dark blue − liquidus). Central\nrow: grain boundary map [gray scale in solid (crystal) shows the local orientational free energy density fori]. Lower row: orientation map. (The coloring of the orientation map is an adaptation of the scheme shown in previous figures for two-fold symmetry:\nWhen the fast growth direction is upwards, 60, or 120 degrees left, the grains are colored red, blue or yellow, respectively, while\nthe intermediate angles are denoted by a continuous transition among these colors. Owing to two-fold symmetry, orientations that\ndiffer by 180 degree multiples are equivalent.) Unless noise intervenes, six different orientations are allowed, including the orientation of the initial single crystal nucleus, which was set common for all simulations [30 degrees off horizontal direction (yellow)]. In the present color code, yellow, gray, blue, purple, red, and orange stand for them. In order to make the arms better discernible, in the orientation map, the liquid (which has random orientation, pixel by pixel) has been colored black. The\nsupersaturation varies from left to right as S = 0.75, 0.85, 0.90, 0.95, 1.00, and 1.10. Note the chain of transitions that links the\nneedle-crystal forming at low supersaturation, to 'axialites', crystal 'sheaves', and eventually to the spherulites (with and without\n'eyes' on the two sides of the nucleus).\n\nMany studies of the early stages of spherulite growth,\nespecially in polymers, indicate that these structures initially grow as slender thread-like fibers [15,21,30]. These\nstructures successively branch to form space-filling patterns. We thus adopt a strong two-fold symmetry for the\n\nkinetic coefficient, ensuring fibrillar growth, and include a\npreferred misorientation angle of 30 degrees (m = 3 and x =\n0.15). The resulting growth morphologies are shown as a\nfunction of supersaturation in Fig. 6. As in Fig. 4, the crystal evolves from a symmetric single crystal to a spherulite\n\nFIG. 7. The birth of a category 2 spherulite at S = 1.0, in the phase field theory. Time increases from left to right. (Snapshots\ntaken at 4.2, 8.4, 12.6, 21, 33.5 μs after nucleation are shown. The dimensionless time used in the calculations has been transformed to real time using the diffusion coefficient of liquid Ni-Cu: DNiCu = 10−5 cm2/s. For other diffusion coefficients D, the\ntimes presented here have to be multiplied by DNiCu/D.) Upper row: composition map; lower row: orientation map. Coloring and\nother conditions are as for fifth column in Fig. 6.\n\n\f9\n\nas the supersaturation is increased. We observe that with\nincreasing driving force there is an increased branching\nfrequency, yielding more space-filling patterns. Thus we\nobtain an array of patterns: fibrils, sheaves, spherulites with\npartially formed eyes, and fully developed category 2\nspherulites. We see (second row Fig. 6) that the 'eyes' become increasingly small with increasing supersaturation,\ndue to the increase in GFN. The consequence of our imposed misorientation is evident in the third row of Fig. 6,\nwhere there are six preferred orientations, corresponding to\nthe imposed 30 degrees misorientation preference. This effect is especially pronounced at low supersatuations, while\nat high supersaturations noise-driven faults randomize the\nlocal orientation.\nNext, the time evolution of a category 2 spherulite is\nconsidered at a fixed supersaturation (Fig. 7). First, fibrils\nform and then secondary fibrils nucleate at the growth front\nto form crystal 'sheaves'. The diverging ends of these\nsheaves subsequently fan out with time to form eyes [Figs.\n1(g) and 1(h)], and finally a roughly spherical growth form\nemerges. This progression of spherulitic growth is nearly\nuniversal in polymeric materials [15,21].\nWhat characterizes the difference between category 1\nand 2 spherulites? For category 1 spherulites, isotropy is\nachieved rapidly. In Fig. 4(f), we observe the initial crystal\nhad a 4-fold symmetry, and the high frequency of GFN and\nthe associated branching leads to isotropic growth. Thus,\ndisorder disrupts the crystalline anisotropy early in the\ngrowth process, yielding category 1 spherulites. In Fig. 7\nthe initial growth is fibrillar, in contrast with Fig. 4, and it\ntakes much longer, at the same level of supersaturation\n(and consequent GFN), for this randomization to occur.\nThe occurrence of category 2 spherulites is directly related\nto the prevalence of early-stage fiber-type growth in comparison with the branched growth. In addition, as we increase the driving force, the time at which the growth becomes isotropic on average decreases and the structural differences between category 1 and 2 spherulites diminish.\nWe wish to specify in which systems these growth patterns are prevalent. Category 1 spherulites, are a normal\nmode of growth in metallic and mineral systems, where fibrous growth is relatively rare. On the other hand, category\n2 spherulites are ubiquitous in polymeric systems. In such\nfluids, high supercoolings are readily attained due to their\ncomplex molecular structure, and the fiber growth habit is\ncharacteristic of the chain-folding mechanism by which\npolymers crystallize [12–21,63–65].\nCategory 1 and 2 spherulites may form under the same\nexperimental conditions. How can this be understood? The\nearly stage of growth strongly influences the late stage\nmorphology of the spherulite. Under circumstances where\nthe initial growth form is perturbed by fluctuations, an admixture of category 1 and 2 spherulites is obtained. For example, simultaneous nucleation of several orientations\nwithin the same nuclei should generally yield category 1\nspherulites, but such events may be rare, and so the structures will coexist with category 2 spherulites. Such multiorientation nucleation events have been found in experiments on silica embedded silver particles [66] and by atomistic simulations for simple liquids [67]. Multiple nucleation events have been observed in atomic force microscopy\n\nmeasurements of polymer spherulite formations in thin\nfilms [68–70].\nB. Transformation kinetics\nIn the growth of compact space-filling spherulites\nchemical or thermal diffusion plays a negligible role. Under these conditions, the time evolution of the extent of\ncrystallization X follows the Johnson-Mehl-AvramiKolmogorov (JMAK) scaling\nX = 1 − exp{−[(t − t0)/τ]p},\n\n(3.1)\n\nwhere t0 is an incubation time due to the relaxation of the\nathermal fluctuation spectrum, τ is a time constant related\n\nFIG. 8. Nucleation and growth of polycrystalline spherulites in the phase field theory. (1000 × 1000 section of a\nsimulation on a 5000 × 5000 grid). Upper row: Left concentration map; right orientation map. Central row: Transformed fraction vs. dimensionless time (dashed line), JMAK\ncurve with the best-fit parameters (solid line). Bottom: Kolmogorov exponent as a function of crystalline fraction.\n\n\f10\n\na\n\nb\n\nd\n\nf\n\nc\n\ne\n\ng\n\nh\n\nFIG. 9. Multistage heat treatments involving spherulitic solidification, as predicted by the phase field theory: (a) – (c) Transition between a faceted crystal habit [(a), nucleated at 1575 K] and (b) a spherulitic array after the sample is quenched to, and crystallized isothermally at 1571 K (Mθ is reduced by a factor of 20), and back to faceted growth (c) after returning to 1575 K. (Compared to polymers, this system requires a relatively small temperature cycling range due to the ideal solution behavior of the NiCu system.) Note the formation of new crystal grains due to GFN during the low temperature stage of the cycling. The computations were performed with 5% anisotropy of the interface free energy (of six-fold symmetry) and 85% anisotropy of the phase\nfield mobility (of two-fold symmetry) on a 1000 × 1000 grid. In (d) and (e) we show two thermal histories with the same final\ntemperature. In (d) spherulitic solidification occurs at 1574 K after direct quenching from above the melting point (1595 K). In\n(e) spherulitic solidification occurs at 1575 K, after deep quenching first to 1350 K. Note the similarity of the growth forms, and\nthe enhanced number of crystallites in the latter case. The computations were performed with 10% anisotropy of the interface free\nenergy (of four-fold symmetry) on a 500 × 500 grid. In (f)–(h) spherulitic overgrowth occurs on pre-existing square crystals with\nparallel nucleation and growth of spherulites. Square-crystals were formed at 1574 K isothermally, then quenched to 1564 K\nwhere crystallization completed. The computations were performed with 15% anisotropy of the interface free energy (of four-fold\nsymmetry) on a 1,000 × 1,000 grid. Left: composition maps (coloring: blue – liquidus, yellow – solidus, except the last row,\nwhere a grayscale colormap was employed to increase contrast: black – liquidus, white – solidus). Right: orientation maps (coloring as in Figs. 6 and 7 of the paper).\n\nto the nucleation and growth rates, and p = 1 + d is the\nKolmogorov exponent, while d is the number of dimensions [71]. This relationship is exact if (i) the system is infinite; (ii) the nucleation rate is spatially homogeneous; and\n(iii) either a common time-dependent growth rate applies or\nanisotropically growing convex particles are aligned in\nparallel (for derivation of Eq. (3.1) by the time cone\nmethod, see Refs. 72 and 73). For constant nucleation and\ngrowth rates in an infinite 2D system p = 3 applies. We investigated the transformation kinetics for noise-induced\nnucleation under the conditions shown in Fig. 4(f) for a\nrelatively large system (5000 × 5000 grid). To avoid the\nunnatural starting transient emerging from noiseless initial\nconditions (constant phase and concentration fields), first\nwe heat-treated the system at 1595 K (above the liquidus\ncurve) for 10 000 time steps, then we quenched it to 1574\nK. The results are shown in Fig. 8. Fitting Eq. (3.1) to the\nsimulation data between 0.01 < X < 0.95 (where the data\nare the least noisy), we find p = 3.04 ± 0.02 (and τ = 0.0106\n\n± 0.00005, t0 = 0.00178 ± 0.00005), which is reasonably\nclose to the p = 3, expected for such a transition [71].\n\nC. Multi-step heat treatments\nThere is a great deal of interest in how temporal variations in processing conditions (temperature, pressure, etc.)\ninfluence spherulitic growth morphology. Multistage heat\ntreatments on polymeric substances have demonstrated that\nthat both the local growth morphology and growth rate depend on the temperature, but are independent of previous\nthermal history [1,10,62]. For example, cycling between\ntwo temperatures reversibly switches between faceted and\nspherulitic growth morphologies both in experiment [1,10]\nand simulation [Figs. 9(a)-(c)]. The predominance of either\ngrowth morphology depends on the cycling time, and complex patterns are generated in this fashion. For example,\nfollowing experiment [62], we can simulate either a direct\nquench to the temperature of spherulitic solidification from\n\n\f11\n\na\n\nb\n\nc\n\nd\n\ne\n\nf\n\ng\n\nh\n\ni\n\nj\n\nFIG. 10. Sherulitic morphologies as predicted by the phase field theory. The contrast of the composition maps was changed to\nenhance the visibility of the fine structure. Compare the predicted morphologies to the patterns in Fig. 1. The kinetic or interfacial\nfree energy anisotropies have a two-fold symmetry in all cases; other conditions for these simulations are presented in Table II.\n\nabove the melting point or instead simulate a deeper\nquench followed by heating to the same final temperature.\nAs shown in Figs. 9(d),(e) these different histories yield\nmuch the same late stage growth form, but a larger number\nof spherulites in the latter deep quench case (due to enhanced nucleation at lower temperatures). Finally, other\nexperiments [62] show that spherulitic overgrowth occurs\non square-shaped crystals grown at small undercoolings,\nwhile, simultaneously, normal spherulites fill the remaining\nspace. This behavior is recovered by our phase field simulations [Figs. 9(f)–(h)]. The ability of this theory to reproduce such complex sequences suggests that our field theory\ncontains the essential physics necessary to describe a broad\nrange of real materials.\nD. Morphological variability\nWe now return to the wide range of spherulitic crystallization patterns shown in Fig. 1. Can the current model\nexplain this variability? Fig. 10 shows a selection of simulations that bear resemblance to the morphologies displayed in Fig. 1. In addition to the category 1 and 2 spherulites described above, we observe structures ranging from\nspiky and arboresque spherulites, to 'quadrites' [15,16] exhibiting a cross-hatching fine structure [see Fig 1(d)], to\nundulating branched patterns. These simulations differ only\nTABLE II. Conditions for simulations shown in Fig. 10.\nδ0\n\nPanel\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(h)\n\nS\n1.0\n0.75\n0.95\n0.9\n0.9\n1.1\n0.9\n1.1\n\ns0\n0.335\n0.5\n0\n0\n0.75\n0\n0.5\n0.5\n\nx\n0.1\n0.0\n0.275\n0.15\n0.15\n0.2\n0.0\n0.2\n\nφ\n\n0.75\n0.5\n0.995\n0.995\n0.995\n0.995\n0\n0\n\n30°\n15°\n90°\n90°\n30°\n15°\n\nmφ,0\n1.0\n0.9\n1.0\n1.0\n1.0\n1.0\n0.9\n1.0\n\nmθ,l\n144\n108\n360\n360\n1440\n360\n360\n360\n\nN\n1000\n2000\n1000\n2000\n500\n1000\n2000\n500\n\n(i)\n(j)\n\n0.9\n0.875\n\n0.5\n0\n\n0\n0.995\n\n0.0\n0.2\n\n15°\n\n0.8\n1.0\n\n180\n18\n\n1000\n3000\n\nin the driving force, anisotropies, branching angle, and mobilities, indicating that the essential features of a broad variety of spherulitic morphologies can be captured, using\nonly a few model parameters (Table II.). We note that\nwhile the anisotropy for the interfacial free energy (s0) in\nsome of these calculations significantly exceeds the missing orientation threshold (1/3, for twofold symmetry), we\ndo not expect the results to be qualitatively different if this\nissue is addressed through a convexification approach such\nas that of Eggleston et al. [74].\nE. Spherulites vs duality\nof static and dynamic heterogeneities\nIn a recent paper [31], we have shown that particulate\nadditives and quenched-in orientational disorder may lead to\nsimilar growth morphologies and morphological transitions.\nExamples of the analogous roles played by static and dynamic heterogeneities (foreign particles and quenched-in orientational defects) in spherulitic growth are displayed in Fig.\n11: The conversion of a single crystal spherulite into polycrystalline ones, and the transition between a needle-shape\nsingle crystal and a densely branched spherulitic morphology, termed loosely as \"fungus\" are shown. The foreign particles are represented by orientation pinning centers, an economical description developed in Ref. 45. These examples\nshow that the duality outlined in Ref. 31 is valid also for the\nspherulitic structures. Whether this remains so during the\nmulti-stage heat treatments is uncertain, and needs further\ninvestigation.\n\nIV. DISCUSSION\n\nSpherulite formation arises from a variety of mechanisms that lead to nucleation at the crystallization growth\nfront. Heterogeneities, either static or those intrinsic to supercooled liquids, result in growth front nucleation of new\ngrains and associated branching of the growing crystal. We\n\n\f12\n\nFIG. 11. Spherulitic structures and the duality of static and dynamic heterogeneities in the phase field theory: Block on the\nleft: Single crystal spherulite (left column) and polycrystalline spherulites produced by introducing foreign particles (center) and\nby reducing the orientational mobility (right), respectively. The orientational mobility is the same for all but the third column,\nwhere it has been reduced by a factor of 4. There are 15,000 five pixels sized foreign orientation pinning centers that have been\nintroduced into the simulations shown in the second column. The calculations were performed on a 1,000 × 1,000 grid (13.2 μm ×\n13.2 μm). The interface free energy is assumed isotropic while the anisotropy of the phase field mobility is 5 %. Block on the\nright: Single crystal needle (left column) and polycrystalline spherulitic \"fungi\" produced by introducing foreign particles (center)\nor by reducing the orientational mobility (right). The orientational mobility is the same for all but the third column, where it has\nbeen reduced by a factor of 5. N = 250,000 single-pixel-sized orientation pinning centers have been introduced into the simulation\nshown in the second column. The calculations were performed on a 2,000 × 2,000 grid (26.4 μm × 26.4 μm). The interface free\nenergy is assumed isotropic while the anisotropy of the phase field mobility is 99.5%, and has a two-fold symmetry (k = 2).\nColoring as for Fig. 8.\n\nhave modeled the effects of these dynamic heterogeneities\nby appropriately reducing χ, the ratio of the rotational to\ntranslational mobilities. Ultimately, this growth front nucleation (otherwise termed 'symphathetic' [24], 'double'\n[25–28], or 'secondary nucleation' [63–65]) randomizes\nthe local crystallographic orientation, leading at long times\nto structures having an isotropic (spherical and circular in\n3D and 2D, respectively) average large-scale structure. The\nvariety of spherulites derives from the variability in the\ncrystallographic symmetries of the parent crystal, the rate\nat which thermal fluctuations cause the crystallization front\nto branch, constraints on the orientation of newly formed\ngrains and ordinary side-branching initiating from the\ngrowing dendritic tips. This competition between these basic processes leads to a rich variety of spherulitic patterns\nthat are captured by our phase field modeling.\nIt is remarkable that our coarse-grained model yields\nsuch morphological diversity, given its reliance such a\nsmall set of thermodynamic and transport properties. We\nhave simply assumed the existence of a first order phase\ntransition coupled to chemical diffusion, and included\nthermal fluctuations and a description of the underlying\ncrystalline anisotropies. The molecular-scale details are\ncaptured by bulk physical properties, such as the surface\nfree energy anisotropy, diffusivities, etc. Despite the minimal nature of the model, we are able to reproduce much of\ndiversity and structural complexity of spherulitic growth\nforms.\nV. SUMMARY\n\nWe have presented a phase field theory that incorporates diffusional instabilities, the trapping of orientational\ndisorder due to reduced rotational diffusional coefficient,\n\nand random crystallographic branching. We have demonstrated that our model:\n(1) Describes well the formation of category 1 and 2\nspherulites;\n(2) Yields the proper transformation kinetics;\n(3) Reproduces morphological changes, seen in multistage heat treatments;\n(4) Captures the morphological variability of the spherulites with only a limited number of model parameters.\nExtension of the treatment to other complex polycrystalline\nmorphologies is underway.\n\nACKNOWLEDGMENTS\n\nL. G. thanks Mathis Plapp and Tamás Börzsönyi for the\nmany enlightening discussions on the phase field theory,\nand to Tamás Börzsönyi for his earlier contributions to the\ndevelopment of the model. This work has been supported\nby contracts OTKA-T-037323, ESA PECS Contract No.\n98005, and by the EU Integrated Project IMPRESS, and\nforms part of the ESA MAP Projects No. AO-99-101 and\nAO-99-114. T. P. acknowledges support by the Bolyai\nJános Scholarship of the Hungarian Academy of Sciences.\n\n[1]\n[2]\n[3]\n\nJ. H. Magill, J. Mater. Sci. 36, 3143 (2001).\nG. Ryschenkow, G. Faivre, J. Non-Cryst. Solids 87, 221\n(1988).\nJ. Bisault, G. Ryschenkow, G. Faivre, J. Cryst. Growth 110,\n889 (1991).\n\n\f13\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n\nP. F. James, Advances in Ceramics, Vol. 4, eds. J. H. Simmons, D. R. Uhlmann and G. H. Beagle (American Ceramic\nSociety, Westerville, 1982) pp. 1.\nU. Köster, U. Herold, Glassy Metals I eds. J. H. Güntherodt\n& H. Beck, Vol. 46 Topics in Appl. Phys. (Springer, Berlin,\n1981) pp. 225.\nH. W. Morse, C. H. Warren, and J. D. H. Donnay, American Journal of Science, series 5, 23 421 (1932).\nH. W. Morse, J. D. H. Donnay, Am. J. Sci., series 5, 23, 440\n(1932).\nL. H. Sperling, Introduction to Physical Polymer Science\n(Wiley, New York, 1992) Chap. 6.\nJ. L. Hutter, J. Bechhoefer, Phys. Rev. E 59, 4342 (1999); J.\nCryst. Growth 217, 332 (2000).\nJ. H. Magill, D. J. Plazek, J. Chem. Phys. 46, 3757 (1967).\nP. J. Phillips, Handbook of Crystal Growth Vol. 2 (Elsevier,\nAmsterdam, 1993) Chapter 18.\nH. D. Keith, F. J. Padden, J. Appl. Phys. 35, 1270 (1964).\nH. D. Keith, F. J. Padden, J. Appl. Phys. 34, 2409 (1963).\nM. L. Walker, A. P. Smith, A. Karim, A., unpublished.\nF. Khoury, J. Res. Nat. Bur. Stand. A 70, 29 (1966).\nB. Lotz, J. C. Wittmann, J. Polymer Sci.: Part B: Polymer\nPhys. 24, 1541 (1986).\nJ. R. Ojeda, D. C. Martin, Macromol. 26, 6557 (1993).\nP. H. Geil, Polymer single crystals (Wiley, New York,\n1963).\nI. L. Hosier, D. C. Bassett, A. S. Vaughan, Macromol. 33,\n8781 (2000).\nF. J. Padden, H. D. Keith, J. Appl. Phys. 36, 2987 (1965).\nD. R. Norton, A. Keller, Polymer 26, 704 (1985).\nM. Muthukumar, Eur. Phys. J. E 3, 199 (2000).\nL. V. Pirsson. Am. J. Sci. XXX, 97 (1910).\nH. I. Aaronson, G. Spanos, R. A. Nsamura, R. G. Vardiman,\nD. W. Moon, E. S. K. Menon, M. G. Hall, Mater. Sci. Eng.\nB 32, 107 (1995).\nF. A. Ferrone, J. Hofrichter, H. R. Sunshine, W. A. Eaton,\nBiophys. J. 32, 361 (1980).\nF. A. Ferrone, J. Hofrichter, W. A. Eaton, J. Mol. Biol. 183,\n611 (1985).\nR. E. Samuel, E. D. Salmon, R. W. Briehl, Nature 345, 833\n(1990).\nO. Galkin, P. G. Vekilov, J. Mol. Biol. 336, 43 (2004).\nD. C. Bassett, A. S. Vaughan, Polymer 26, 717 (1985); D.\nC. Bassett, R. H. Olley, Polymer 25, 935 (1984); I. L. Hosier, D. C. Bassett, A. S. Vaughan, Macromol. 33, 8781\n(2000).\nL. Li, K-M Ng, C-M Chan, J-Y Feng, X-M Zeng, L-T\nWeng, Macromol. 33, 5588 (2000); L. Li, C-M. Chan, K. L.\nYeing, J-X Li, K-M. Ng, Y Lei, ibid. 34, 316 (2001).\nL. Gránásy, T. Pusztai, T. Börzsönyi, J. A. Warren, J. F.\nDouglas, Nature Mater. 3, 635 (2004).\nK. Chen, R. L. Nagel, R. E. Hirsch, P. G. Vekilov, Proc.\nNat. Acad. Sci. 99, 8479 (2002).\nM. Muschol, F. Rosenberger, J. Chem. Phys. 107, 1953\n(1997).\nK. L. Ngai, J. H. Magill, D. J. Plazek, J. Chem. Phys. 112,\n1887 (2000).\nC. Donati, J. F. Douglas, W. Kob, S. J. Plimpton, P. H.\nPoole, S. C. Glotzer, Phys. Rev. Lett. 80, 2338 (1998).\nC. Bennemann, C. Donati, J. Baschnagel, S. C. Glotzer, Nature 399, 246 (1999).\nM. D. Ediger, Ann. Rev. Phys. Chem, 51, 99 (2000).\nI. Chang, H. Sillescu, J. Phys. Chem. B 101, 8794 (1997).\nE. Rössler, Phys. Rev. Lett. 65, 1595 (1990).\nA. Masuhr, T. A. Waniuk, R. Busch, W. L. Johnson, Phys.\nRev. Lett. 82, 2290 (1999).\nS. F. Swallen, P. A. Bonvallet, R. J. McMahon, M. D. Ediger, Phys. Rev. Lett. 90, 015901 (2003).\n\n[42] The extent that the decoupling parameter χ/χ0 drops in glass\nforming liquids depends on the \"fragility\" of the liquid,\nmore fragile liquids exhibiting a greater drop than stronger\nliquids. See C. A. Angell, Science 267, 1924 (1995); M. D.\nEdiger, C. A. Angell, S. R. Nagel, J. Phys. Chem. 100,\n13200 (1996).\n[43] L. Gránásy, T. Börzsönyi, T. Pusztai, Phys. Rev. Lett. 88,\n206105 (2002); J. Cryst. Growth 237–239, 1813 (2002); L.\nGránásy, T. Pusztai, T. Börzsönyi, J. A. Warren, B.\nKvamme, P. F. James, Phys. Chem. Glass. 45, 107 (2004).\n[44] R. Kobayashi, J. A. Warren, W. C. Carter, Physica D 119,\n415 (1998).\n[45] L. Gránásy, T. Pusztai, J. A. Warren, T. Börzsönyi, J. F.\nDouglas, V. Ferreiro, Nature Mater. 2, 92 (2003).\n[46] W. J. Boettinger, J. A. Warren, C. Beckermann, A. Karma,\nAnn. Rev. Mater. Res. 32 163 (2002)\n[47] J. J. Hoyt, M. Asta, A. Karma, Mater. Sci. Eng. Rep. R 41\n121 (2003).\n[48] L. Gránásy, T. Pusztai, J. A. Warren, J. Phys.: Condens.\nMatter 16, R1205 (2004).\n[49] W. J. Huisman, J. F. Peters, M. J. Zwanenburg, S. A. de\nVries, T. E. Derry, D. Abernathy, J. F. van der Veen. Nature\n390, 379 (1997).\n[50] R. L. Davidchack, B. B. Laird, J. Chem. Phys. 108, 9452\n(1998).\n[51] J. A. Warren, R. Kobayashi, A. E. Lobkovsky, W. C.\nCarter, Acta Mater. 51, 6035 (2003).\n[52] S. L. Wang, R. F. Sekerka, A. A. Wheeler, B. T. Murray, S.\nR. Coriell, R. J. Braun, G. B. McFadden, Physica D 69, 189\n(1993).\n[53] J. A. Warren, W. J. Boettinger, Acta Met. Mater. 43, 689\n(1995).\n[54] M. Conti, Phys. Rev. E, 1997, 56, 3197 (1997).\n[55] A. Karma, W-J. Rappel, Phys. Rev. E 60. 3614 (1999); M.\nPlapp, personal communication.\n[56] In the case of polymers, polydispersity in molecular mass,\ntacticity, and impurities can all be expected to contribute to\nζs, which in turn influences the susceptibility to spherulitic\ngrowth. Disorder of this kind, and its influence on spherulitic growth has been emphasized by Bassett and coworkers\n(Ref. 29).\n[57] W. W. Mullins, R. F. Sekerka, J. Appl. Phys. 34, 323\n(1963); 35, 444 (1964).\n[58] K. R. Elder, F. Drolet, J. M. Kosterlitz , M. Grant, Phys.\nRev. Lett. 72, 677 (1994).\n[59] F. Drolet, K. R. Elder, M. Grant, J. M. Kosterlitz, Phys.\nRev. E 61, 6705 (2000).\n[60] M. Plapp, A. Karma, Phys. Rev. E 66, 061605 (2002); J.\nMetals 56, 28 (2004).\n[61] D. Lewis, T. Pusztai, L. Gránásy, J. A. Warren, W. Boettinger, J. Metals 56, 34 (2004).\n[62] J. H. Magill, J. Appl. Phys. 35, 3249 (1964).\n[63] A. Keller, J. Polymer Sci. 17, 291 (1955).\n[64] A. Keller, J. R. S. Waring, J. Polymer Sci. 17, 447, (1955).\n[65] A. Keller, Rep. Prog. Phys 31, 623 (1968).\n[66] M. H. Lee, P. J. Dobson, B Cantor, B. Mater. Res. Soc.\nSymp. Proc., eds. R. Bormann et al., Vol. 400 (MRS, Pittsburg, 1996) p. 95.\n[67] B. O'Malley, I. Snook, I. Phys. Rev. Lett. 90, 085702\n(2003).\n[68] L. Li, C-M. Chan, J-X. Li, K-M. Ng, K-L Yeung, L-T.\nWeng, Macromol. 32, 8240 (1999).\n[69] Y-G. Lei, C-M. Chan, J-X. Li, K-M. Ng, Y. Wang, Y. Jian,\nL. Li, Macromol. 35, 6751 (2002).\n[70] Y-G. Lei, C-M. Chan, Y. Wang, K-M. Ng, Y. Jiang, L. Lin,\nPolymer 44, 4673 (2003).\n[71] J. W. Christian, The Theory of Transformations in Metals\nand Alloys (Oxford: Pergamon, Oxford, 1981).\n\n\f14\n[72] J. W. Cahn, Proc. MRS Symposium on Thermodynamics\nand Kinetics of Phase Transformations (Materials Research\nSociety 1996) vol. 398, p. 425.\n[73] J. W. Cahn, Trans. Ind. Inst. Metals 50, 573 (1997).\n\n[74] J. J. Eggleston, G. B. McFadden, P. W. Voorhees, Phys. D\n150, 91 (2001).\n\n\f"}