{"id": "http://arxiv.org/abs/cond-mat/0112073v1", "guidislink": true, "updated": "2001-12-05T17:06:57Z", "updated_parsed": [2001, 12, 5, 17, 6, 57, 2, 339, 0], "published": "2001-12-05T17:06:57Z", "published_parsed": [2001, 12, 5, 17, 6, 57, 2, 339, 0], "title": "Hydrogen-bonded Silica Gels Dispersed in a Smectic Liquid Crystal: A\n  Random Field XY System", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0112201%2Ccond-mat%2F0112085%2Ccond-mat%2F0112498%2Ccond-mat%2F0112495%2Ccond-mat%2F0112394%2Ccond-mat%2F0112138%2Ccond-mat%2F0112308%2Ccond-mat%2F0112282%2Ccond-mat%2F0112366%2Ccond-mat%2F0112254%2Ccond-mat%2F0112008%2Ccond-mat%2F0112355%2Ccond-mat%2F0112211%2Ccond-mat%2F0112109%2Ccond-mat%2F0112098%2Ccond-mat%2F0112392%2Ccond-mat%2F0112325%2Ccond-mat%2F0112265%2Ccond-mat%2F0112283%2Ccond-mat%2F0112285%2Ccond-mat%2F0112143%2Ccond-mat%2F0112417%2Ccond-mat%2F0112062%2Ccond-mat%2F0112359%2Ccond-mat%2F0112077%2Ccond-mat%2F0112411%2Ccond-mat%2F0112071%2Ccond-mat%2F0112154%2Ccond-mat%2F0112353%2Ccond-mat%2F0112388%2Ccond-mat%2F0112349%2Ccond-mat%2F0112337%2Ccond-mat%2F0112342%2Ccond-mat%2F0112086%2Ccond-mat%2F0112175%2Ccond-mat%2F0112126%2Ccond-mat%2F0112089%2Ccond-mat%2F0112364%2Ccond-mat%2F0112035%2Ccond-mat%2F0112416%2Ccond-mat%2F0112219%2Ccond-mat%2F0112236%2Ccond-mat%2F0112184%2Ccond-mat%2F0112177%2Ccond-mat%2F0112180%2Ccond-mat%2F0112173%2Ccond-mat%2F0112408%2Ccond-mat%2F0112439%2Ccond-mat%2F0112022%2Ccond-mat%2F0112377%2Ccond-mat%2F0112312%2Ccond-mat%2F0112136%2Ccond-mat%2F0112406%2Ccond-mat%2F0112076%2Ccond-mat%2F0112020%2Ccond-mat%2F0112500%2Ccond-mat%2F0112468%2Ccond-mat%2F0112133%2Ccond-mat%2F0112228%2Ccond-mat%2F0112222%2Ccond-mat%2F0112072%2Ccond-mat%2F0112456%2Ccond-mat%2F0112124%2Ccond-mat%2F0112464%2Ccond-mat%2F0112492%2Ccond-mat%2F0112393%2Ccond-mat%2F0112317%2Ccond-mat%2F0112179%2Ccond-mat%2F0112479%2Ccond-mat%2F0112398%2Ccond-mat%2F0112194%2Ccond-mat%2F0112415%2Ccond-mat%2F0112339%2Ccond-mat%2F0112451%2Ccond-mat%2F0112139%2Ccond-mat%2F0112476%2Ccond-mat%2F0112340%2Ccond-mat%2F0112016%2Ccond-mat%2F0112348%2Ccond-mat%2F0112118%2Ccond-mat%2F0112037%2Ccond-mat%2F0112038%2Ccond-mat%2F0112140%2Ccond-mat%2F0112352%2Ccond-mat%2F0112482%2Ccond-mat%2F0112030%2Ccond-mat%2F0112276%2Ccond-mat%2F0112233%2Ccond-mat%2F0112445%2Ccond-mat%2F0112481%2Ccond-mat%2F0112182%2Ccond-mat%2F0112157%2Ccond-mat%2F0112026%2Ccond-mat%2F0112047%2Ccond-mat%2F0112264%2Ccond-mat%2F0112017%2Ccond-mat%2F0112160%2Ccond-mat%2F0112001%2Ccond-mat%2F0112073%2Ccond-mat%2F0112028%2Ccond-mat%2F0112459&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hydrogen-bonded Silica Gels Dispersed in a Smectic Liquid Crystal: A\n  Random Field XY System"}, "summary": "The effect on the nematic to smectic-A transition in octylcyanobiphenyl (8CB)\ndue to dispersions of hydrogen-bonded silica (aerosil) particles is\ncharacterized with high-resolution x-ray scattering. The particles form weak\ngels in 8CB creating a quenched disorder that replaces the transition with the\ngrowth of short range smectic correlations. The correlations include thermal\ncritical fluctuations that dominate at high temperatures and a second\ncontribution that quantitatively matches the static fluctuations of a random\nfield system and becomes important at low temperatures.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0112201%2Ccond-mat%2F0112085%2Ccond-mat%2F0112498%2Ccond-mat%2F0112495%2Ccond-mat%2F0112394%2Ccond-mat%2F0112138%2Ccond-mat%2F0112308%2Ccond-mat%2F0112282%2Ccond-mat%2F0112366%2Ccond-mat%2F0112254%2Ccond-mat%2F0112008%2Ccond-mat%2F0112355%2Ccond-mat%2F0112211%2Ccond-mat%2F0112109%2Ccond-mat%2F0112098%2Ccond-mat%2F0112392%2Ccond-mat%2F0112325%2Ccond-mat%2F0112265%2Ccond-mat%2F0112283%2Ccond-mat%2F0112285%2Ccond-mat%2F0112143%2Ccond-mat%2F0112417%2Ccond-mat%2F0112062%2Ccond-mat%2F0112359%2Ccond-mat%2F0112077%2Ccond-mat%2F0112411%2Ccond-mat%2F0112071%2Ccond-mat%2F0112154%2Ccond-mat%2F0112353%2Ccond-mat%2F0112388%2Ccond-mat%2F0112349%2Ccond-mat%2F0112337%2Ccond-mat%2F0112342%2Ccond-mat%2F0112086%2Ccond-mat%2F0112175%2Ccond-mat%2F0112126%2Ccond-mat%2F0112089%2Ccond-mat%2F0112364%2Ccond-mat%2F0112035%2Ccond-mat%2F0112416%2Ccond-mat%2F0112219%2Ccond-mat%2F0112236%2Ccond-mat%2F0112184%2Ccond-mat%2F0112177%2Ccond-mat%2F0112180%2Ccond-mat%2F0112173%2Ccond-mat%2F0112408%2Ccond-mat%2F0112439%2Ccond-mat%2F0112022%2Ccond-mat%2F0112377%2Ccond-mat%2F0112312%2Ccond-mat%2F0112136%2Ccond-mat%2F0112406%2Ccond-mat%2F0112076%2Ccond-mat%2F0112020%2Ccond-mat%2F0112500%2Ccond-mat%2F0112468%2Ccond-mat%2F0112133%2Ccond-mat%2F0112228%2Ccond-mat%2F0112222%2Ccond-mat%2F0112072%2Ccond-mat%2F0112456%2Ccond-mat%2F0112124%2Ccond-mat%2F0112464%2Ccond-mat%2F0112492%2Ccond-mat%2F0112393%2Ccond-mat%2F0112317%2Ccond-mat%2F0112179%2Ccond-mat%2F0112479%2Ccond-mat%2F0112398%2Ccond-mat%2F0112194%2Ccond-mat%2F0112415%2Ccond-mat%2F0112339%2Ccond-mat%2F0112451%2Ccond-mat%2F0112139%2Ccond-mat%2F0112476%2Ccond-mat%2F0112340%2Ccond-mat%2F0112016%2Ccond-mat%2F0112348%2Ccond-mat%2F0112118%2Ccond-mat%2F0112037%2Ccond-mat%2F0112038%2Ccond-mat%2F0112140%2Ccond-mat%2F0112352%2Ccond-mat%2F0112482%2Ccond-mat%2F0112030%2Ccond-mat%2F0112276%2Ccond-mat%2F0112233%2Ccond-mat%2F0112445%2Ccond-mat%2F0112481%2Ccond-mat%2F0112182%2Ccond-mat%2F0112157%2Ccond-mat%2F0112026%2Ccond-mat%2F0112047%2Ccond-mat%2F0112264%2Ccond-mat%2F0112017%2Ccond-mat%2F0112160%2Ccond-mat%2F0112001%2Ccond-mat%2F0112073%2Ccond-mat%2F0112028%2Ccond-mat%2F0112459&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The effect on the nematic to smectic-A transition in octylcyanobiphenyl (8CB)\ndue to dispersions of hydrogen-bonded silica (aerosil) particles is\ncharacterized with high-resolution x-ray scattering. The particles form weak\ngels in 8CB creating a quenched disorder that replaces the transition with the\ngrowth of short range smectic correlations. The correlations include thermal\ncritical fluctuations that dominate at high temperatures and a second\ncontribution that quantitatively matches the static fluctuations of a random\nfield system and becomes important at low temperatures."}, "authors": ["S. Park", "R. L. Leheny", "R. J. Birgeneau", "J. -L. Gallani", "C. W. Garland", "G. S. Iannacchione"], "author_detail": {"name": "G. S. Iannacchione"}, "author": "G. S. Iannacchione", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.65.050703", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0112073v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0112073v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 4 postscript figures as separate files", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0112073v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0112073v1", "journal_reference": null, "doi": "10.1103/PhysRevE.65.050703", "fulltext": "Hydrogen-bonded Silica Gels Dispersed in a Smectic Liquid Crystal: A Random Field\nXY System\nS. Park1, R. L. Leheny1,2 , R. J. Birgeneau1,3 , J.-L. Gallani1,∗ , C. W. Garland1 , G. S. Iannacchione4\n\narXiv:cond-mat/0112073v1 [cond-mat.soft] 5 Dec 2001\n\n1\n\nCenter for Materials Science and Engineering, Massachusetts Institute of Technology, Cambridge, MA 02139, USA\n2\nDepartment of Physics and Astronomy, Johns Hopkins University, Baltimore, MD 21218, USA\n3\nDepartment of Physics, University of Toronto, Toronto, Canada M5S 1A1\n4\nDepartment of Physics, Worcester Polytechnic Institute, Worcester, MA 01609, USA\n(October 31, 2018)\nThe effect on the nematic to smectic-A transition in octylcyanobiphenyl (8CB) due to dispersions\nof hydrogen-bonded silica (aerosil) particles is characterized with high-resolution x-ray scattering.\nThe particles form weak gels in 8CB creating a quenched disorder that replaces the transition with\nthe growth of short range smectic correlations. The correlations include thermal critical fluctuations\nthat dominate at high temperatures and a second contribution that quantitatively matches the static\nfluctuations of a random field system and becomes important at low temperatures.\nPACS numbers: 64.70.Md, 61.30.Eb, 61.10.-i\n\ntion that breaks a continuous symmetry6,8–10 . Consistent with theoretical predictions, we find that the smectic phase is destroyed by the disorder and is replaced by\nthe growth of short-range smectic correlations. The lowtemperature correlation length exceeds the typical void\nsize in the gels by approximately a factor of four, consistent with the picture of the aerosil creating a weak to\nintermediate disorder. The temperature dependence of\nthe correlation function for different densities of gel further indicates that the disorder suppresses nematic fluctuations in the liquid crystal.\nThe smectic state is distinguished from the nematic\nby a one-dimensional modulation in density, and a twocomponent order parameter specifying the amplitude and\nphase of the modulation characterizes the N-SmA transition. To introduce quenched disorder, we disperse in\nthe 8CB hydrophilic aerosil, 70 Å diameter silica particles coated with hydroxyl groups. At volume fractions above roughly 1%, these particles form a hydrogenbonded thixotropic gel, and interactions between the surfaces of the gel and liquid crystal molecules (\"anchoring\")\nintroduce locally preferred orientations and phases to the\nsmectic ordering that compete with the globally uniform\norder of the pure smectic. Aerosil gels have strong similarities with aerogels but represent a weaker disorder for\nthe smectic in two essential respects. First, the ability\nto grow the aerosil gel directly within the liquid crystal\npermits structures of higher porosity. Also, as discussed\nbelow, for a given silica density the hydrogen-bonded\naerosils perturb the smectic ordering less severely than\nrigid aerogels. However, consistent with recent studies11,12 we find that aerosils above 1% volume fraction\ncreate a reproducible, density-dependent quenched disorder. In our experiments we have tuned the strength\nof this disorder by varying the density of silica, ρs , from\n0.025 grams of SiO2 per cm3 of 8CB, just above the gelation threshold, to 0.341 grams of SiO2 per cm3 of 8CB.\n\nQuenched disorder in condensed matter systems can\nprofoundly affect their thermodynamic behavior, creating unique challenges for statistical mechanics. For fluids, confinement within a random porous medium offers\na convenient method for introducing such disorder, and\nstudies of superfluid helium 1 and binary liquids2 in aerogels – rigid, highly-porous chemically-bonded silica gels\n– have led to insights into the implications of disorder on\nphase transitions. Similarly, the fragile nature of the mesomorphic phases of liquid crystals and their sensitivity\nto surface interactions make these systems well suited for\nstudies within porous media. In particular, the nematic\n(N) to smectic-A (SmA) transition, which typically exhibits anisotropic 3D-XY critical behavior, offers an ideal\ncase for understanding the effects of a random environment on continuous symmetry fluctuations. The demonstration through x-ray scattering3,4 and calorimetry5 of\nthe destruction of the N-SmA transition by confinement\nin aerogels has shed light on these effects. Detailed theoretical work has further elucidated the fragility of the\nsmectic phase to arbitrarily weak quenched disorder and\nhas introduced the possibility that for sufficiently weak\ndisorder novel \"Bragg glass\" phases may become stable6 .\nIn an effort to probe liquid crystals with increasingly\nweak disorder in a controlled way, we have conducted\na high-resolution x-ray scattering study of the effect of\nhydrogen-bonded silica (aerosil) gels on the N-SmA transition in octylcyanobiphenyl (8CB). We find that the\nconstraints imposed by these weakly-connected gels profoundly alter the smectic ordering, leading to behavior\nquantitatively like that induced by random fields. Random field systems have been fruitful models for exploring\ntheoretically effects of quenched disorder, and random\nfield Ising magnets have provided the primary experimental testing ground for these ideas7 . 8CB in porous\nsilica thus introduces an opportunity to make experimental contact with random field theories for a transi1\n\n\fReference11 provides details of the sample preparation\nand fractal structure of aerosil gels.\nTo characterize the effect of the aerosil gels on the NSmA transition, we have measured with x-ray scattering\nthe static structure factor, S(q), which provides direct\ninformation about the correlation function of the smectic order. The experiments were conducted on the X20\nbeamline of the National Synchrotron Light Source using\n8 keV photons. 1 mm thick samples were held between\nkapton sheets in an oven containing dry nitrogen gas,\nand the scattering was performed in transmission geometry. Following prolonged exposure to the x-rays, the 8CB\nwith dispersed aerosil displayed evidence of damage, including progressively degraded smectic order. Therefore,\nwe carefully limited the exposures to levels below which\nany damage was detectable.\nFigure 1 shows representative x-ray scattering lineshapes for two values of ρs . In accord with theoretical\npredictions of Radzihovsky, Toner, et al.6,13 , for all densities and for the full experimental temperature range,\nthe diffraction peak corresponding to smectic layering is\nmarkedly broader than the resolution-limited peak measured for pure 8CB in the SmA phase, demonstrating the\ndestruction of the smectic long range order by the aerosil.\nWe model this short-ranged order with a structure factor\ncontaining two contributions:\nσ1\nS(q) =\n2 ξ 2 + cq 4 ξ 4\n2\n2\n1 + (qk − q0 ) ξk + q⊥\n⊥\n⊥ ⊥\n+\n\n2\nσ2 (ξk ξ⊥\n)\n2 ξ 2 + cq 4 ξ 4 )2\n(1 + (qk − q0 )2 ξk2 + q⊥\n⊥\n⊥ ⊥\n\nσ2 – with two parameters, ξk and σ2 /σ1 , controlling the\nshape of the peaks.\nAt temperatures near and above the N-SmA transition\ntemperature for pure 8CB, TN0 A = 306.98K 11, the measured lineshapes in the aerosil samples are described very\nwell by the thermal fluctuation term alone (i.e., σ2 = 0).\nThus, for T > TN0 A , the smectic correlations in aerosil\nsamples are very similar to the critical fluctuations of the\npure liquid crystal. Figure 2(a) displays ξk for a series\nof aerosil densities in this high temperature region. The\nsolid line in the figure, ξk for pure 8CB (aligned in the\nnematic by a magnetic field)14 , demonstrates the strong\nsimilarity between thermal fluctuations in the pure liquid\ncrystal and in the liquid crystal with dispersed aerosil.\nAt these high temperatures, ξk is smaller than the average void size, lo , in the gels, and the influence of the\ngel is minimal. (The values of lo range from 200 Å for\nρs = 0.341 to 2650 Å for ρs = 0.02511.) Rather than\nfollow the diverging behavior associated with a thermodynamic transition, however, ξk for 8CB with dispersed\naerosil deviates from that of pure 8CB as the temperature decreases, and the smectic correlations remain shortranged. Figure 2(b) shows the behavior of ξk for four\nvalues of ρs to low temperatures. The susceptibility, σ1 ,\nfor 8CB with dispersed aerosil similarly tracks that of the\npure system at high temperatures but fails to diverge.\nWe stress the importance of including the quartic term\n(c > 0) in Eq. (1) to account correctly for the temperature dependence of the lineshapes. The values of c vary\nfrom approximately 0.25 for ξk = 50Å, its value 4 K\nabove TN0 A , to less than 0.02 for ξk > 104 Å14 . At high\ntemperatures, when c ≈ 0.25, the thermal fluctuation\nterm is effectively the square of a Lorentzian along q⊥ ,\nleading to a powder-averaged lineshape that strongly resembles a Lorentzian. As ξ⊥ increases on cooling and c\ndecreases, the powder average of the first term in Eq. (1)\ndeviates strongly from a Lorentzian, and the tails of the\nlineshape become more pronounced. We note that the xray lineshapes of 8CB in rigid aerogels resemble this behavior4. The analysis by Rappaport et al. of the aerogel\nresults, however, differs significantly from that presented\nhere. In particular, no measurable signal from thermal\nfluctuations was reported for 8CB in aerogel3,4 .\nAt temperatures below TN0 A , deviations from the form\ndescribing the critical behavior of pure 8CB become apparent in the lineshape of 8CB with dispersed aerosil,\nparticularly for large ρs . These deviations indicate an increasing importance of interactions with the gel, rather\nthan intrinsic thermal fluctuations, in determining the\nsmectic correlations. The second term in Eq. (1) describing random-field induced, short-range order accounts for\nthese changes in the correlations very well. Figure 3 displays σ2 as a function of temperature for two representative values of ρs . The rapid growth of σ2 on cooling\nreflects the dominance of these random-field static fluctuations at low temperatures. In this low temperature region, ξk reaches an essentially temperature-independent\n\n(1)\n\nwhere the wave vector qk is along the smectic layer normal and q⊥ is perpendicular to it.\nThe first term in S(q), an anisotropic Lorentzian with\nquartic corrections, is the form for the susceptibility in\npure nematic 8CB and describes the critical thermal fluctuations on approaching the N-SmA transition14 . The\nsecond term, which is simply proportional to this susceptibility squared, is designed to account for static fluctuations induced by the quenched disorder. This term is motivated by studies on random field Ising magnets in which\nsuch an expression has been shown to describe accurately\nthe short-range correlations induced by the static fluctuations15 and has been justified theoretically16,17 . In\nthe limit of long range order, the second term evolves\ninto a Bragg-peak, σ2 δ(qk − q0 )δ(q⊥ )18 . The solid lines\nin Fig. 1 are the results of fits to the powder average\nof Eq. (1) convolved with the experimental resolution\nfunction. The measured scattering profile also includes\na temperature-independent, sloping background from the\naerosil gel, shown in the figures as dashed lines. As Fig. 1\nillustrates, Eq. (1) provides an excellent description of the\nlineshape over a wide range of temperatures and aerosil\ndensities. In these fits, we have taken ξ⊥ and c as functions of ξk , with ξ⊥ (ξk ) and c(ξk ) set by their relations\nin pure 8CB, which are known to high precision14 . Thus,\neach fit has only four free parameters – q0 , ξk , σ1 , and\n2\n\n\fvalue, as Fig. 2(b) illustrates. Figure 4 displays the low\ntemperature correlation lengths, ξkLT as a function of ρs .\nThe solid line in Fig. 4 is the result of a fit to the nematic\ncorrelation lengths of the homolog 6CB with dispersed\naerosils measured by Bellini et al.19 with static light\nscattering. These light scattering studies demonstrate\nthat the nematic order in a liquid crystal with dispersed\naerosil breaks up into very large, but finite, domains.\nSince the smectic layering forms within these nematic\ndomains, the nematic domain sizes naturally set upper\nlimits for the range of the smectic correlations. However,\nξkLT remains well below these limits for all ρs , demonstrating the sensitivity of the smectic phase to quenched\ndisorder. The dashed line in Fig. 4 is the mean aerosil\nvoid size, l0 , as a function of ρs 11 . For the range of densities studied, the ratio of ξkLT to l0 is nearly independent\nof density and is roughly equal to four, consistent with an\nintermediate strength disordering field. This result contrasts with the smectic ordering in aerogel3 for which the\nmeasured correlation lengths barely exceed the void sizes,\nillustrating again the weaker nature of disorder induced\nby aerosil.\nAt low temperatures (where c approaches a constant\nvalue) σ2 is proportional to the integrated intensity of\nthe static fluctuation term in S(q). The growth of this\nintensity strongly resembles that of an order parameter\nsquared, and the solid lines in Fig. 3 are the results of fits\nto the form σ2 ∝ (T2 − T )x , where both x and T2 depend\non ρs . The inset of Fig. 3 displays the change in x with ρs .\nWe emphasize that x is an effective exponent since the\naerosil destroys the true N-SmA phase transition. However, associating the integrated intensity from the static,\nshort-range correlations with an order parameter squared\n(so that x = 2β), we observe that the effective exponent\nspans the range from near the tricritical value (like with\npure 8CB) at small ρs to 3D XY-like at large ρs . For\npure liquid crystals, the measured critical behavior at\nthe N-SmA transition is affected by couplings between\nthe nematic and smectic order parameters (de Gennes\ncoupling)20 . The variation of x with ρs suggests that the\nquenched disorder suppresses the nematic susceptibility\nthat drives the critical behavior of the pure system away\nfrom 3D-XY universality. This result agrees nicely with\nspecific heat studies of 8CB with dispersed aerosil which\nshow the effective heat capacity exponent, α, decreasing\ntoward the 3D-XY value with increasing ρs 11,21 .\nIn conclusion, these x-ray scattering studies have\nshown that 8CB with dispersed aerosil provides a model\nrandom field system for a transition that breaks a continuous symmetry. In particular, the success of Eq. (1) in\ndescribing the smectic correlations and the corresponding\nbehaviors of ξk and σ2 form a compelling picture in which\nthe aerosil gel creates a random local-orienting field that\ndestroys the N-SmA transition, consistent with theoretical predictions6 . In the random field Ising magnet, slow\ndynamics and non-equilibrium effects strongly influence\nthe behavior22,23 . Efforts to observe hysteretic or time\n\ndependent behavior indicative of metastability in these\nscattering measurements or in the calorimetry studies11\non 8CB with dispersed aerosil revealed no such effects.\nThese results suggest that the continuous symmetry allows the system to find equilibrium efficiently, even in the\npresence of random fields, in marked contrast to the behavior in random field Ising systems7 . However, a better\nunderstanding of the dynamics would be beneficial for\nplacing the observed ordering in the context of equilibrium statistical mechanics.\nWe thank S. Lamarra for technical support and T.\nBellini, P. Clegg and L. Radzihovsky for helpful discussions. This work was supported by the NSF under\nContract No. DMR-0071256 (MIT) and NSF-CAREER\nAward No. DMR-0092786 (WPI) and by the Natural\nScience and Engineering Research Council of Canada\n(Toronto). J.-L. G. acknowledges support from CNRS\nand NATO (grant 31C96FR).\n\n1\n\nM. Chan, N. Mulders, and J. Reppy, Physics Today 49, 30\n(August 1996).\n2\nB. J. Frisken and D. S. Cannell, Phys. Rev. Lett. 69, 632\n(1992).\n3\nT. Bellini et al., Science, in press.\n4\nA. G. Rappaport et al., in Liquid Crystals in Complex Geometries Formed by Polymer and Porous Networks, edited\nby G. P. Crawford and S. Zumer (Taylor and Francis, London, 1996), chap. 20.\n5\nL. Wu et al., Phys. Rev. E 51, 2157 (1995).\n6\nL. Radzihovsky and J. Toner, Phys. Rev. B 60, 206 (1999).\n7\nR. J. Birgeneau, J. Magn. Magn. Mater. 177-181, 1 (1998).\n8\nY. Imry and S.-K. Ma, Phys. Rev. Lett. 35, 1399 (1975).\n9\nM. Aizenman and J. Wehr, Phys. Rev. Lett. 62, 2503\n(1989).\n10\nD. S. Fisher, Phys. Rev. Lett. 78, 1964 (1997).\n11\nG. S. Iannacchione et al., Phys. Rev. E 58, 5966 (1998).\n12\nT. Jin and D. Finotello, Phys. Rev. Lett. 86, 818 (2001).\n13\nB. Ward, Ph. D. thesis, University of Colorado (1999).\n14\nB. M. Ocko, R. J. Birgeneau, and J. D. Litster, Z. Phys. B\n62, 487 (1986).\n15\nR. J. Birgeneau et al., J. Stat. Phys. 34, 817 (1984).\n16\nG. Grinstein, S.-k. Ma, and G. F. Mazenko, Phys. Rev. B\n15, 258 (1977).\n17\nR. A. Pelcovits and A. Aharony, Phys. Rev. B 31, 350\n(1985).\n18\nDue to the Landau-Peierls instability the correlations in the\nsmectic phase exhibit algebraic order rather than true longrange order. This distinction should not influence the form\nof the correlations in the presence of quenched disorder.\n19\nT. Bellini et al., Phys. Rev. E 57, 2996 (1998).\n20\nC. W. Garland and G. Nounesis, Phys. Rev. E 49, 2964\n(1994).\n21\nThe thermal behavior of 8CB with dispersed aerosil is also\nconsistent with finite-size scaling of smectic order with\n\n3\n\n\fquenched random disorder. G. S. Iannacchione et al., to\nbe published.\n22\nD. S. Fisher, Phys. Rev. Lett. 56, 416 (1986).\n23\nQ. Feng, R. J. Birgeneau, and J. P. Hill, Phys. Rev. B 51,\n15188 (1995).\n\nFIG. 1. X-ray scattering intensity for 8CB with dispersed\naerosil for ρs = 0.025 g/cm3 at (a) 288.5 K and (b) 307.6\nK and ρs = 0.282 g/cm3 at (c) 300.6 K and (d) 306.6 K.\nThe solid lines are the results of fits to the powder average of\nEq. (1) convolved with the experimental resolution and the\ndashed lines are the temperature independent background due\nto scattering from the aerosil gel. The higher temperature\nlineshapes, (b) and (d), are due to thermal critical fluctuations as in pure 8CB while the low temperature lineshapes,\n(a) and (c), have forms expected for short-range correlations\ndominated by static, random-field induced fluctuations.\n\nFIG. 2. The parallel correlation length, ξk , as a function\nof temperature (a) at high temperature for a series of aerosil\ndensities: ρs = 0.025 ( ), 0.041 (•), 0.051 (filled diamond),\n0.078 (open box), 0.105 (∇), 0.161 (△), 0.220 (filled box),\n0.282 (filled triangle), and 0.341 (filled upside-down triangle);\nand (b) on an expanded scale to low temperature for four\nvalues of ρs . The solid line is ξk for pure 8CB [14].\n\nFIG. 3. The integrated intensity of the static fluctuation\nterm, σ2 , as a function of temperature for ρs = 0.025 (•) and\nρs = 0.220 ( ). The absolute magnitudes of σ2 for each ρs\nare arbitrary and should not be compared. The solid lines\nare fits to σ2 ∝ (T2 − T )x . The inset shows x versus ρs . The\neffective exponent x spans the range for an order parameter\nexponent from near the tricritical value, 0.5, at small ρs to\nthe 3D XY value, 0.69, at large ρs .\n\nFIG. 4. Low temperature correlation lengths, ξkLT versus\nρs . The solid line is the nematic correlation length (for 6CB)\n[19], and the dashed line is the mean aerosil void size, l0 .\n\n4\n\n\fFigure 1 S. Park et al.\n\n2500\n\nρs = 0.025\nT = 288.5 K\n\n(a)\n\n2000\n\n200\n\nρs = 0.025\nT = 307.6 K\n\n(b)\n\n150\n\n1500\n100\n\n1000\n500\n\n50\n\nρs = 0.282\nT = 300.6 K\n\n(c)\n1500\n1000\n\nρs = 0.282\nT = 306.6 K\n\n600\n500 (d)\n400\n300\n\n500\n0.18\n\n200\n0.19\n\n0.20\n\nq (Å-1)\n\n0.21\n\n0.22\n\n0.16\n\n0.20\n\nq (Å-1)\n\n0.24\n\n\fFigure 2 S. Park et al.\n\n(a)\n\n400\n\n200\n\n0\n\n8000\n6000\n4000\n2000\n0\n\n307 308 309 310 311 312\nT (K)\nρs = 0.025\n\npure (b)\n8CB\n\nρs = 0.041\nρs = 0.078\nρs = 0.220\n\n290\n\n295\n\n300\nT (K)\n\n305\n\n310\n\n\fFigure 3 S. Park et al.\n\n1.4\n\n0.8\n\n1.2\n\n0.7\n\nρs = 0.025\n\nσ2 (arb. units)\n\n1.0\n\n3D-XY\n\n0.6\n\ntricritical\n\n0.5\n\n0.8\n0.10\n0.20\nρs (g/cm3)\n\nρs = 0.220\n\n0.6\n\n0.30\n\n0.4\n0.2\n0.0\n\n290\n\n295\n\n300\nT (K)\n\n305\n\n310\n\n\fFigure 4\n\n105\n\nξ || (Å)\n\n104\n\nLT\n\nξ N (6CB)\n\n103\nl0\n\n0.00\n\n0.10\n\n0.20\nρs (g/cm3)\n\n0.30\n\nS. Park et al.\n\n\f"}