{"id": "http://arxiv.org/abs/cond-mat/0302450v1", "guidislink": true, "updated": "2003-02-21T20:05:18Z", "updated_parsed": [2003, 2, 21, 20, 5, 18, 4, 52, 0], "published": "2003-02-21T20:05:18Z", "published_parsed": [2003, 2, 21, 20, 5, 18, 4, 52, 0], "title": "The Branched Polymer Growth Model Revisited", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0302363%2Ccond-mat%2F0302336%2Ccond-mat%2F0302408%2Ccond-mat%2F0302197%2Ccond-mat%2F0302354%2Ccond-mat%2F0302609%2Ccond-mat%2F0302604%2Ccond-mat%2F0302207%2Ccond-mat%2F0302253%2Ccond-mat%2F0302462%2Ccond-mat%2F0302103%2Ccond-mat%2F0302450%2Ccond-mat%2F0302096%2Ccond-mat%2F0302196%2Ccond-mat%2F0302366%2Ccond-mat%2F0302370%2Ccond-mat%2F0302335%2Ccond-mat%2F0302378%2Ccond-mat%2F0302039%2Ccond-mat%2F0302483%2Ccond-mat%2F0302092%2Ccond-mat%2F0302451%2Ccond-mat%2F0302519%2Ccond-mat%2F0302068%2Ccond-mat%2F0302346%2Ccond-mat%2F0302543%2Ccond-mat%2F0302578%2Ccond-mat%2F0302011%2Ccond-mat%2F0302540%2Ccond-mat%2F0302254%2Ccond-mat%2F0302410%2Ccond-mat%2F0302481%2Ccond-mat%2F0302073%2Ccond-mat%2F0302150%2Ccond-mat%2F0302154%2Ccond-mat%2F0302086%2Ccond-mat%2F0302610%2Ccond-mat%2F0302490%2Ccond-mat%2F0302188%2Ccond-mat%2F0302033%2Ccond-mat%2F0302508%2Ccond-mat%2F0302237%2Ccond-mat%2F0302442%2Ccond-mat%2F0302308%2Ccond-mat%2F0302539%2Ccond-mat%2F0302624%2Ccond-mat%2F0302189%2Ccond-mat%2F0302614%2Ccond-mat%2F0302411%2Ccond-mat%2F0302164%2Ccond-mat%2F0302139%2Ccond-mat%2F0302179%2Ccond-mat%2F0302523%2Ccond-mat%2F0302028%2Ccond-mat%2F0302152%2Ccond-mat%2F0302504%2Ccond-mat%2F0302099%2Ccond-mat%2F0302416%2Ccond-mat%2F0302114%2Ccond-mat%2F0302478%2Ccond-mat%2F0302264%2Ccond-mat%2F0302271%2Ccond-mat%2F0302084%2Ccond-mat%2F0302037%2Ccond-mat%2F0302315%2Ccond-mat%2F0302558%2Ccond-mat%2F0302386%2Ccond-mat%2F0302476%2Ccond-mat%2F0302243%2Ccond-mat%2F0302107%2Ccond-mat%2F0302485%2Ccond-mat%2F0302109%2Ccond-mat%2F0302579%2Ccond-mat%2F0302439%2Ccond-mat%2F0302238%2Ccond-mat%2F0302570%2Ccond-mat%2F0302024%2Ccond-mat%2F0302568%2Ccond-mat%2F0302333%2Ccond-mat%2F0302381%2Ccond-mat%2F0302487%2Ccond-mat%2F0302036%2Ccond-mat%2F0302087%2Ccond-mat%2F0302588%2Ccond-mat%2F0302067%2Ccond-mat%2F0302047%2Ccond-mat%2F0302620%2Ccond-mat%2F0302395%2Ccond-mat%2F0302223%2Ccond-mat%2F0302403%2Ccond-mat%2F0302390%2Ccond-mat%2F0302121%2Ccond-mat%2F0302219%2Ccond-mat%2F0302230%2Ccond-mat%2F0302138%2Ccond-mat%2F0302586%2Ccond-mat%2F0302260%2Ccond-mat%2F0302326%2Ccond-mat%2F0302492%2Ccond-mat%2F0302304%2Ccond-mat%2F0302441&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Branched Polymer Growth Model Revisited"}, "summary": "The Branched Polymer Growth Model (BPGM) has been employed to study the\nkinetic growth of ramified polymers in the presence of impurities. In this\narticle, the BPGM is revisited on the square lattice and a subtle modification\nin its dynamics is proposed in order to adapt it to a scenario closer to\nreality and experimentation. This new version of the model is denominated the\nAdapted Branched Polymer Growth Model (ABPGM). It is shown that the ABPGM\npreserves the functionalities of the monomers and so recovers the branching\nprobability b as an input parameter which effectively controls the relative\nincidence of bifurcations. The critical locus separating infinite from finite\ngrowth regimes of the ABPGM is obtained in the (b,c) space (where c is the\nimpurity concentration). Unlike the original model, the phase diagram of the\nABPGM exhibits a peculiar reentrance.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0302363%2Ccond-mat%2F0302336%2Ccond-mat%2F0302408%2Ccond-mat%2F0302197%2Ccond-mat%2F0302354%2Ccond-mat%2F0302609%2Ccond-mat%2F0302604%2Ccond-mat%2F0302207%2Ccond-mat%2F0302253%2Ccond-mat%2F0302462%2Ccond-mat%2F0302103%2Ccond-mat%2F0302450%2Ccond-mat%2F0302096%2Ccond-mat%2F0302196%2Ccond-mat%2F0302366%2Ccond-mat%2F0302370%2Ccond-mat%2F0302335%2Ccond-mat%2F0302378%2Ccond-mat%2F0302039%2Ccond-mat%2F0302483%2Ccond-mat%2F0302092%2Ccond-mat%2F0302451%2Ccond-mat%2F0302519%2Ccond-mat%2F0302068%2Ccond-mat%2F0302346%2Ccond-mat%2F0302543%2Ccond-mat%2F0302578%2Ccond-mat%2F0302011%2Ccond-mat%2F0302540%2Ccond-mat%2F0302254%2Ccond-mat%2F0302410%2Ccond-mat%2F0302481%2Ccond-mat%2F0302073%2Ccond-mat%2F0302150%2Ccond-mat%2F0302154%2Ccond-mat%2F0302086%2Ccond-mat%2F0302610%2Ccond-mat%2F0302490%2Ccond-mat%2F0302188%2Ccond-mat%2F0302033%2Ccond-mat%2F0302508%2Ccond-mat%2F0302237%2Ccond-mat%2F0302442%2Ccond-mat%2F0302308%2Ccond-mat%2F0302539%2Ccond-mat%2F0302624%2Ccond-mat%2F0302189%2Ccond-mat%2F0302614%2Ccond-mat%2F0302411%2Ccond-mat%2F0302164%2Ccond-mat%2F0302139%2Ccond-mat%2F0302179%2Ccond-mat%2F0302523%2Ccond-mat%2F0302028%2Ccond-mat%2F0302152%2Ccond-mat%2F0302504%2Ccond-mat%2F0302099%2Ccond-mat%2F0302416%2Ccond-mat%2F0302114%2Ccond-mat%2F0302478%2Ccond-mat%2F0302264%2Ccond-mat%2F0302271%2Ccond-mat%2F0302084%2Ccond-mat%2F0302037%2Ccond-mat%2F0302315%2Ccond-mat%2F0302558%2Ccond-mat%2F0302386%2Ccond-mat%2F0302476%2Ccond-mat%2F0302243%2Ccond-mat%2F0302107%2Ccond-mat%2F0302485%2Ccond-mat%2F0302109%2Ccond-mat%2F0302579%2Ccond-mat%2F0302439%2Ccond-mat%2F0302238%2Ccond-mat%2F0302570%2Ccond-mat%2F0302024%2Ccond-mat%2F0302568%2Ccond-mat%2F0302333%2Ccond-mat%2F0302381%2Ccond-mat%2F0302487%2Ccond-mat%2F0302036%2Ccond-mat%2F0302087%2Ccond-mat%2F0302588%2Ccond-mat%2F0302067%2Ccond-mat%2F0302047%2Ccond-mat%2F0302620%2Ccond-mat%2F0302395%2Ccond-mat%2F0302223%2Ccond-mat%2F0302403%2Ccond-mat%2F0302390%2Ccond-mat%2F0302121%2Ccond-mat%2F0302219%2Ccond-mat%2F0302230%2Ccond-mat%2F0302138%2Ccond-mat%2F0302586%2Ccond-mat%2F0302260%2Ccond-mat%2F0302326%2Ccond-mat%2F0302492%2Ccond-mat%2F0302304%2Ccond-mat%2F0302441&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Branched Polymer Growth Model (BPGM) has been employed to study the\nkinetic growth of ramified polymers in the presence of impurities. In this\narticle, the BPGM is revisited on the square lattice and a subtle modification\nin its dynamics is proposed in order to adapt it to a scenario closer to\nreality and experimentation. This new version of the model is denominated the\nAdapted Branched Polymer Growth Model (ABPGM). It is shown that the ABPGM\npreserves the functionalities of the monomers and so recovers the branching\nprobability b as an input parameter which effectively controls the relative\nincidence of bifurcations. The critical locus separating infinite from finite\ngrowth regimes of the ABPGM is obtained in the (b,c) space (where c is the\nimpurity concentration). Unlike the original model, the phase diagram of the\nABPGM exhibits a peculiar reentrance."}, "authors": ["Ubiraci P. C. Neves", "Andre L. Botelho", "Roberto N. Onody"], "author_detail": {"name": "Roberto N. Onody"}, "author": "Roberto N. Onody", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0378-4371(03)00070-0", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0302450v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0302450v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 10 figures. To be published in PHYSICA A", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0302450v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0302450v1", "journal_reference": null, "doi": "10.1016/S0378-4371(03)00070-0", "fulltext": "The Branched Polymer Growth Model Revisited\nUbiraci P. C. Neves 1 ,∗ André L. Botelho 1 , and Roberto N. Onody\n\narXiv:cond-mat/0302450v1 [cond-mat.stat-mech] 21 Feb 2003\n\n1\n\n2\n\nDepartamento de Fı́sica e Matemática, Faculdade de Filosofia, Ciências e Letras de Ribeirão Preto\nUniversidade de São Paulo - Ribeirão Preto - SP, Brazil and\n2\nDepartamento de Fı́sica e Informática, Instituto de Fı́sica de São Carlos,\nUniversidade de São Paulo - São Carlos-SP, Brazil\nThe branched polymer growth model (BPGM) has been employed to study the kinetic growth of\nramified polymers in the presence of impurities. In this article, the BPGM is revisited on the square\nlattice and a subtle modification in its dynamics is proposed in order to adapt it to a scenario closer\nto reality and experimentation. This new version of the model is denominated the adapted branched\npolymer growth model (ABPGM). It is shown that the ABPGM preserves the functionalities of\nthe monomers and so recovers the branching probability b as an input parameter which effectively\ncontrols the relative incidence of bifurcations. The critical locus separating infinite from finite\ngrowth regimes of the ABPGM is obtained in the (b, c) space (where c is the impurity concentration). Unlike the original model, the phase diagram of the ABPGM exhibits a peculiar reentrance.\nKeywords: Branched Polymer, Critical Transition, Reentrant Phase\nPACS numbers: 05.70.Jk; 64.60.-i; 64.60.Ht\n\nI.\n\nINTRODUCTION\n\nThe statistical mechanics of polymers has become a\nvery prolific research area. During the last decades, many\nmodels have been proposed to describe the configurational properties of linear and branched polymers and a\nvariety of methods have been employed to study these\nsystems. The classic model for a linear polymer in dilute solution (or at high temperature) is the self-avoiding\nwalk (SAW) [1, 2]. On the other hand, connected clusters (lattice animals) provided a good model for branched\npolymers in the dilute limit [3].\nThe kinetic growth walk (KGW) was proposed as an\nalternative model to describe the irreversible growth of\nlinear polymers [4-6]. Like the SAW, every KGW chain\ndoes not intercept itself. But whereas in a SAW the\nnext step is randomly chosen from among all nearestneighbor sites (excluding the previous one), in a KGW\nthe choice is among the unvisited sites [4]. Therefore\nthe KGW is less sensitive to attrition. Besides, although\nboth models span the same set of configurations, the\nN-step SAW chains are all equally weighted while the\nstatistical weights of the KGW chains can be different.\nNevertheless, it was shown that both models present the\nsame critical exponents [6].\nLater, Lucena et al. [7] generalized the KGW in order to allow for branching as well as for impurities. This\ngeneralized model (which became known as the branched\npolymer growth model - BPGM) was found to exhibit an\ninteresting phase transition (due to competition between\nhindrances and branching) separating infinite from finite\ngrowth regimes [7]. In the following years, several authors have studied the BPGM [8-15]. The topological\n\n∗ Electronic\n\naddress: ubiraci@ffclrp.usp.br\n\nand dynamical aspects of the model were investigated\n[8]. Besides, the system was shown to achieve the criticality through a self-organization growth mechanism [12]\nand to exhibit a transition from rough to faceted boundaries for large values of the branching probability [8, 13].\nThe model was also studied through an exact enumeration of bond trees and ergodicity violation was discussed\n[14]. The question of the universality class of the BPGM\nwas also investigated. In contrast to the common belief\nthat branched polymers belong to the universality class of\nlattice animals [16, 17], the study of the growth process\nin chemical l−space with estimates of structural exponents led to the proposal that the BPGM belongs to the\nuniversality class of percolation [10, 11]. On the Bethe\nlattice, this proposal is based on analytical results [11].\nA further analysis using finite-size scaling techniques led\nto the conclusion that the BPGM is not in the same universality class of percolation in two dimensions [15].\nIn the present paper, we revisit the BPGM on the\nsquare lattice. We point out that, although the input\nparameter b is named branching probability, it does not\nhave effective control of the relative incidence of bifurcations (branches) in the simulated polymers. This seems\nto be an undesirable aspect of the model since the degree of branching is an important quantity that is usually\nmeasured in real ramified polymers. Besides, according\nto the growth rules of the BPGM, a monomer which is\nchosen to bifurcate (with probability b) but has only one\nempty nearest neighbor site is compelled to grow linearly\nthus changing its functionality from 3 to 2. In real experiments this change is not allowed since the concentrations\nof polymers with different functionalities are fixed. In\norder to preserve the functionalities of the monomers as\nwell as to recover the meaning of the branching probability b, we propose a subtle modification in the dynamics\nof the BPGM. So this new version of the model aims\nto adapt it to a more realistic scenario and is called the\n\n\f2\nadapted branched polymer growth model (ABPGM). In\nthe following sections, we define the ABPGM and present\nthe phase diagram in the (b, c) space. This diagram is\nfound to exhibit a peculiar reentrance. We introduce the\nconcept of frustration and compare the effective branching rate bef with the input parameter b for both the\noriginal and adapted models. Our results concerning the\nABPGM are shown to be much closer to the ideal behavior bef = b. Finally, we present a discussion based on the\nclusters topologies of both models.\n\n3\nX\n\nNk = N + 1\n\n(1)\n\nkNk = 2N .\n\n(2)\n\nk=1\n\nand\n3\nX\n\nk=1\n\nII.\n\nTHE ADAPTED BRANCHED POLYMER\nGROWTH MODEL\n\nFirst of all, let us review the BPGM. Consider a L × L\nsquare lattice with a certain concentration c of sites randomly filled by impurities. At the initial time t = 0, the\npolymer starts growing from a monomer seed located at\nthe center of the lattice towards a random empty nearestneighbor site. At time t = 1, this chosen site is occupied\nby a monomer (growing tip) which now may bifurcate\nor follow in one direction (linear growth). The growth\ndirections are randomly chosen among the available ones\n(those which lead to empty neighbors) in a clockwise way.\nAt every time t ( t ≥ 2), the process is repeated for all\nactual monomeric ends following the sequence of their\nappearances. If a polymer end has no empty nearestneighbor site then it is trapped in a \"cul de sac\" and\nstops growing (it is then called a dead end ). If only one\nadjacent site is available then the linear growth is obligatory. If at least two adjacent sites are empty then the\ngrowing end bifurcates with probability b or follows linearly with probability 1−b. In a particular experiment of\nthe BPGM, the polymer growth is simulated according\nto the above rules. Depending on the values of parameters b and c, the polymer can either grow indefinitely or\nstop growing (die) at a finite time if all its current tips\nare dead ends. The experiment is finished either when\nthe polymer touches the frontier of the lattice (infinite\npolymer) or when it dies (finite polymer). The ensemble over which averages are performed is constituted by\na great number Ne of experiments.\nEach polymer configuration of the BPGM can be identified with a self-avoiding loopless graph (bond tree) although the reciprocal is not always true [8]. Thus the\nBPGM can be mapped into a particular subset of the ensemble of all possible bond trees. These tree graphs have\nbeen applied in models of branched polymers and can be\nclassified by the number N of bonds and the number Nk\nof vertices with k bonds [18] . In a typical finite polymer configuration of the BPGM, one may find twofold\nand threefold sites representing monomers of functionalities 2 and 3, respectively. The monomer seed and\ndead ends represent monofunctional monomers. Tetrafunctional units are impossible in this model once trifurcations are not allowed. For a tree graph generated by\nthe BPGM one has the following constraints [18]:\n\nThe occurrence of bifurcations in the model determines the relative incidence of trifunctional monomers\n(branches). This is basically the degree of branching\nof the polymer, an important quantity that is usually\nmeasured in real ramified polymers. However, although\nthe parameter b is named branching probability, we shall\nsee that it does not have effective control of the relative\namount of branches (bifurcations) in the BPGM. Indeed,\naccording to the rules of the BPGM, the parameter b is\nnot the probability that any tip bifurcates but instead\nit is the conditional probability that a tip with two or\nmore empty nearest neighbors bifurcates. Every tip with\njust one vacant nearest-neighbor site grows linearly with\nprobability equal to one. From another viewpoint, it\nwould also be desirable to consider that any monomer\nthat is linking to the polymer has an effective probability b of being a trifunctional unit. Even if this were considered in the BPGM, a problem would become evident.\nAny growing end chosen (with probability b) as a trifunctional monomer would not be able to bifurcate if only one\nvacant site were available. In this case, the functionality\nof the monomer would not be respected since (according\nto the BPGM) the growing end would forcibly follow a\nlinear growth like a bifunctional monomer.\nIn order to preserve the functionalities of the\nmonomers we propose a modification in the dynamics of\nthe BPGM. Besides to make the model a little more realistic, our proposal turns the branching probability b into\nan effective control parameter of the relative frequency of\nbifurcations. So it adapts the model to a scenario closer\nto reality and experimentation. We denominate it the\nadapted branched polymer growth model (ABPGM).\nThe ABPGM is defined just like the BPGM except for\nthe following differences:\n1. In the process of polymerization, let a free end\n(a growing tip with at least one empty nearestneighbor site) be a trifunctional monomer with\nprobability b or a bifunctional monomer with probability 1 − b. If the free end is a trifunctional\nmonomer but there is only one empty nearest\nneighbor site then it stops growing and becomes\na dead end.\n2. At every time unit, all current sites on the front\nof growth of the polymer are visited in a random\nsequence.\n\n\f3\nWe remember that in the BPGM, a free end with just\none empty nearest neighbor grows linear with probability one while in the ABPGM, since bifurcation is impossible, the free end stops and becomes a frustrated dead\nend. This frustration seems to be preferable and more realistic than forcing a trifunctional monomer to turn into\nbifunctional monomer as it occurs in the BPGM. So, in\nour proposal, the relative incidence of bifunctional and\ntrifunctional monomers does not depend on the topology of the cluster anymore and is only controlled by the\nbranching probability parameter. The second difference\nis also important: in the BPGM all tips are sequentially\nvisited in a clockwise manner following the sequence of\nbirths whereas in the ABPGM they are visited in a random way. The sequential update of the growth front of\nthe polymer (in the BPGM) simulates the formation of\nparallel chains in the infinite phase (for high b and low c)\nlike in a crystallization process. This mechanism leads to\na faceted-to-rough transition that has been already studied [8, 13]. Figure 1a shows a typical BPGM configuration with faceted boundary generated with parameters\nb = 0.5 and c = 0 (for L = 51); the parallel ordering of\nchains is caused by the clockwise update of the growing\ntips. If we simulate the BPGM using the same set of parameters but with a random update instead of the clockwise update we get Figure 1b. In this case, two subsequent growing tips are probably located far apart so that\nthey cannot produce parallel chains. The boundary is less\nfaceted than before. Recently it has been shown that any\ndeterministic growth order is non-ergodic in the sense\nthat it spans only a subset of the space of all possible\nconfigurations [14]. Moreover, for the present purposes,\nthis clockwise update mechanism is undesirable since the\ndevelopment of parallel chains corresponds to an increasing incidence of bifunctional monomers due mainly to\ngeometrical effects rather than to the probability 1 − b\nitself. The relative incidence of bifurcations (which will\nbe defined as the effective branching rate bef in section\n4) is much smaller than input parameter b. Indeed, we\nanticipate that bef ≈ 0.15 for the cluster of Figure 1a\nwhereas bef ≈ 0.30 for the one of Figure 1b; so the last\nrate (corresponding to a BPGM cluster generated with\nrandom update) is closer to the input value b = 0.50.\nThe effective branching rate gets still closer to the input\nvalue if we simulate the ABPGM. Figure 1c is a typical\nABPGM configuration (generated with those same parameters b = 0.5 and c = 0) and presents bef ≈ 0.43; the\nfaceted front of growth seems to disappear and vacancies\ncan be found inside the cluster.\nThe main feature of the BPGM is the phase transition separating finite from infinite growth regime. Lucena et al. [7] have defined a critical branching probability bc where the mean size of finite polymers diverges\nas L → ∞. The critical value depends on the impurity\nconcentration c and separates the finite phase (b < bc (c))\nfrom the infinite one (b > bc (c)). The probability that\na polymer grows indefinitely is null for small values of b\nand increases abruptly in the region of b ≈ bc (c). This\n\nFIG. 1: Typical configurations simulated on a square lattice\nof size L = 51 with parameters b = 0.5 and c = 0 according\nto the BPGM rules with clockwise update of growing tips\n(a), BPGM with random update (b) and ABPGM (c). The\ncorresponding effective branching rates are bef ≈ 0.15, bef ≈\n0.30 and bef ≈ 0.43, respectively.\n\nprobability was estimated through the fraction P∞ of infinite polymers in the ensemble of configurations of the\nBPGM [7]. In Figure 2a, we reproduce typical plots of\nP∞ versus b at different values of c (with Ne = 102 experiments and L = 1501) for the BPGM. In Figure 2b,\nwe present plots of P∞ versus b at some values of c corresponding to simulations of the ABPGM with Ne = 104\nexperiments and L = 1501. For c = 0, the behavior of\nP∞ (b) is analogous to that of the BPGM but now the\nthreshold is little bit higher (b ≈ 0.06 for the ABPGM\nwhile b ≈ 0.055 for the BPGM). This difference increases\n\n\f4\nwith c. The most interesting characteristic of the present\nmodel may be observed when c = 0.18. For this value, the\ncurve raises at b ≈ 0.32, then presents a plateau (where\nP∞ (b) ≈ 0.7) and finally falls! By a finite-size scaling\nanalysis we have verified that the height of the plateau\ndoes not change significatively in the limit L → ∞. For\nc = 0.19, the behavior of P∞ (b) is gaussian shaped. This\nmeans that, for certain impurity concentrations, as b increases the system goes from a finite to an infinite phase\nand then becomes finite again! Indeed, this reentrance\nis confirmed in the next section when we determine the\nphase diagram of the ABPGM through an analysis of the\ncorrelation length.\n\nfor different values of c and size L = 1501 (with 102 and\n104 experiments respectively). Each plot of ξ versus b exhibits only one maximum except for plots of the ABPGM\nwith c > 0.175 where two peaks are detected! It can be\nverified that all peaks of ξ do diverge when L → ∞.\n(a)\n250\n\nBPGM\n\nc=0\nc = 0.10\nc = 0.18\nc = 0.30\n\n200\n\n150\n\nx\n100\n\n50\n\n(a)\n\n1,0\n0\n0,0\n\n0,2\n\n0,4\n\n0,8\n\n0,6\n\n0,6\n\nb\n\n0,8\n\n1,0\n\n(b)\n\nP\n\n∞\n\n250\n\nABPGM\n\n0,4\n\nBPGM\n\nc=0\nc = 0.10\nc = 0.18\nc = 0.30\n\n0,2\n\n200\n\nc = 0.19\n150\n\nx\n\n0,0\n0,0\n\n0,2\n\n0,4\n\nb\n\n0,6\n\n0,8\n\nc=0\n\nc = 0.10\n\n1,0\n100\n\n50\n\nc = 0.18\n\n(b)\n\n1,0\n\n0\n\nc=0\n\n0,0\n\nABPGM\n\nc = 0.10\n\n0,8\n\n0,2\n\n0,4\n\nb\n\n0,6\n\n0,8\n\n1,0\n\nc = 0.18\n\n0,6\n\nP\n\n¥\n\nFIG. 3: Plots of the correlation length ξ of finite polymers\nversus the branching probability b for several impurity concentrations c in the cases: (a) BPGM and (b) ABPGM.\n\n0,4\n\nc = 0.19\n0,2\n\n0,0\n0,0\n\n0,2\n\n0,4\n\nb\n\n0,6\n\n0,8\n\n1,0\n\nFIG. 2: Plots of the fraction of infinite polymers P∞ versus b\nfor the BPGM (a) and ABPGM (b).\n\nIII.\n\nTHE PHASE DIAGRAM\n\nThe mean size of finite polymers is a measure of the\ncorrelation length ξ of the system. If a finite polymer\nis generated during a simulation, the sizes lx and ly of\nthe smallest rectangle containing the cluster can be determined. The correlation length can then be calculated\n1/2\nas ξ = h(lx ly ) i where the average is performed over\nall experiments with finite polymers [7]. We show typical plots of ξ versus b corresponding to simulations of\nthe BPGM (in Figure 3a) and ABPGM (in Figure 3b)\n\nLet us first explain the behavior of ξ for the BPGM.\nFor a fixed value of c and as b increases, the polymer\nis more likely to escape from steric hindrances and impurities so that the mean size grows to its highest value\nat some b = b0 (L). Above this point, the system is defined to be in the infinite growth regime (of course, the\ntrue critical point is obtained in the thermodynamic limit\nbc = limL→∞ b0 (L)). As b continues to increase, the fraction of infinite polymers grows and the finite polymers get\nsmaller so that ξ decreases. As higher impurity concentrations hindrance the growth, b0 increases with c. The\ncritical line of the BPGM is the locus (bc , c) on which ξ\ndiverges [7] and is shown in Figure 4 (dashed line).\nRegarding the ABPGM, the same reasoning can explain the maximum of ξ (or the first maximum when\nthere are two peaks). But now this peak is located on\na higher branching probability b1 > b0 that compensates\nthe occurrence of frustrated dead ends. Just above b1\nthe system enters the infinite growth regime where it remains unless a second peak appears (at b = b2 > b1 for c\n> 0.175). In the latter case the system returns to the fi-\n\n\f5\nnite phase! This reentrance from infinite to finite growth\nregime is a peculiar feature of the ABPGM. For this modified model, there is a certain range of values of c where\nit is very probable that all free ends become frustrated\n(and stop growing) for a sufficiently large b so that the\npolymer growth is finite again. The ABPGM phase diagram is also shown in the Figure 4. The reentrant phase\nonly exists for c in the small interval [0.175, 0.195].\n\n1.0\n0,5\n\n0,4\n\nBPGM\n0,3\n\nc\n\ncritical line, P (N ) decays exponentially with N . Lucena\net al. [7] have found a similar behavior in the BPGM.\nIV. THE FRUSTRATION AND THE\nEFFECTIVE BRANCHING RATE\n\nThe frustration is a desirable event which distinguishes\nthe ABPGM from the original model. It is defined as the\ninterruption of the growth of any free end which was chosen (with probability b) as a trifunctional monomer but\nis unable to bifurcate since only one nearest neighbor site\nis available. It prevents such a free end to continue its\ngrowth linearly like a bifunctional monomer (as occurs in\nthe BPGM) and consequently controls the relative incidence of branches.\n\n0,2\n\nABPGM\n0,1\n\nL = 751\n\n0,6\n\nL = 1501\n\n0,0\n0,0\n\n0,2\n\n0,4\n\nb\n\n0,6\n\n0,8\n\n1,0\n\n0,4\n\nFIG. 4: The phase diagram of the models BPGM (dashed\nline) and ABPGM (solid line). Each critical line separates\nthe infinite phase (at low values of c) from the finite one (at\nhigher values of c).\n\nf\nABPGM\n\nc=0\nc = 0.10\nc = 0.19\nc = 0.30\n\n0,2\n\n0,0\n0,0\n\nABPGM\n\n2x10\n\n2x10\n\nbc\nbc\nbc\n\n-1\n\n= 0.06;\n= 0.32;\n= 0.93;\n\nc\nc\nc\n\n2x10\n\nslope = - 0.75 (2)\n\n-4\n\n1x10\n\n3\n\nN\n\n1x10\n\n4\n\n0,6\n\n0,8\n\n1,0\n\n= 0.18\n\n-3\n\n2\n\nb\n\n= 0.18\n\n-2\n\n1x10\n\n0,4\n\nFIG. 6: The frustration rate f versus b for increasing values\nof c in the ABPGM (L = 1501 and Ne ∼ 103 ).\n\n= 0\n\nPN\n2x10\n\n0,2\n\n1x10\n\n5\n\nFIG. 5: Log-log plot of the distribution P (N ) of finite polymers with N bonds for simulations of the ABPGM (with\nNe = 104 and L = 1501) at some points (b, c) on the critical line.\n\nWe have also measured the fraction P (N ) of finite\npolymers with N bonds. In Figure 5, we have a loglog plot of the polydispersion distribution P (N ) of the\nABPGM on the critical line (running 104 experiments in\na L = 1501 lattice). The three sets of data correspond\nto the critical points: b1 ≈ 0.06 and c = 0 (black dots);\nb1 ≈ 0.32 and c = 0.18 (open circles); b2 ≈ 0.93 and\nc = 0.18 (squares). The data are fitted by a straight line\nwith slope −0.75. So, on the critical line, P (N ) decays\nwith N as a power law. We have verified that outside the\n\nClearly, each polymer configuration of the ABPGM is\nalso a bond tree which can be classified by the numbers N\n(of bonds) and Nk (of k−functional units). Besides, every\ndead end is a site which ceased to grow and so represents\na monofunctional vertex; it can be subclassified as either\na trapped site (if it is in a \"cul de sac\") or a frustrated\ne1 the number of\ndead end (otherwise). We denote by N\ne1 = 0 since any\nfrustrated dead ends. For the BPGM, N\nfree end never stops. In order to measure the relative\nincidence of frustrated ends among those free sites chosen\nas trifunctional monomers, we define the frustration rate\nas\n\nf=\n\n*\n\ne1\nN\n\ne1 + N3\nN\n\n+\n\n(3)\n\nwhere the average is performed over all experiments. For\ninfinite polymers, the current sites on the front of growth\nshould not be considered in the computation since their\nfunctionalities are undetermined.\nAccording to the prior definition, f = 0 for any values\nof b and c in the BPGM. We remark that the null frustration of the BPGM does not mean that all free sites chosen\n\n\f6\nto bifurcate succeed but only that when they fail they are\ntransformed in monomers with functionality two.\nFor the ABPGM, the frustration rate increases with\nb and c as it is shown in Figure 6. Indeed, both the\nexcluded volume due to self-avoidance (which increases\nwith b) and the impurities diminish the chance of success of any free end, so f is a monotonically increasing\nfunction of b and c.\n(a)\n\n1,0\n\nBPGM\nc = 0\n\n0,8\n\nc = 0.10\nc = 0.18\n\n0,6\n\nc = 0.30\n\nb\n\nef\n\n0,4\n\n0,2\n\na large discrepancy between the input parameter b and\nthe output rate bef . For c = 0, bef increases with b up\nto a maximum (at b ≈ 0.2) and then decreases to zero as\nb → 1. This behavior is explained as follows: for small b,\nself-avoidance is reduced so that most sites trying to bifurcate succeed; but as b increases, parallel linear chains\n(like those of Figure 1a) are forcibly generated due to\nboth the increasing excluded volume and the clockwise\nupdate. For higher values of c, the presence of impurities hampers the formation of linear chains and thus bef\ndecreases slower (as a concave function). Anyway, for\nthe BPGM, the discrepancy between b and bef gets more\npronounced as b → 1. On the contrary, for the ABPGM,\nbef always increases with b as a convex function (for any\nvalue of c) and the difference b−bef is very small. In fact,\nfor any c, the ratio bef /b is approximately equal to 1 for\nsmall b, decreases until about 0.8 for intermediate b and\nthen returns to 1 as b → 1. Such results corroborate the\nassertion that the input parameter b controls the relative\nincidence of branches in the adapted model.\n\n0,0\n0,0\n\n0,2\n\n0,4\n\n0,6\n\n0,8\n\n1,0\n\n0,6\n\n0,8\n\n1,0\n\nb\n\n(b)\n\n1,0\n\n0,8\n\nABPGM\nc = 0\nc = 0.10\nc = 0.18\n\n0,6\n\nc = 0.19\n\nb\n\nef\n\n0,4\n\n0,2\n\n0,0\n0,0\n\n0,2\n\n0,4\n\nb\n\nFIG. 7: The behavior of the effective branching rate bef versus\nthe input parameter b for simulations of the BPGM (a) and\nABPGM (b) on a large L = 1501 square lattice (with 102 and\n104 experiments respectively). The dashed lines represent the\nideal behavior bef = b.\n\nThe effectiveness of the input parameter b is evaluated\nby comparing it with the relative frequency of branches\nin a polymer configuration. For this purpose, we define\nthe effective branching rate bef as the ratio between N3\nand N2 + N3 averaged over all experiments:\n\nbef =\n\n\u001c\n\nN3\nN2 + N3\n\n\u001d\n\nFIG. 8: Typical graphs of both the BPGM (a) and ABPGM\n(b) for b = 0.2 and fixed c = 0.18.\n\n(4)\n\nThe plots of bef versus b at different values of c for simulations of the BPGM and ABPGM (on a large L = 1501\nsquare lattice) are shown in Figures 7a and 7b, respectively. The ideal behavior bef = b is indicated as the\ndashed lines. Regarding the BPGM, there is evidently\n\nV.\n\nCONCLUSIONS\n\nThe branched polymer growth model (BPGM) was originally proposed [7] as a generalization of the kinetic\n\n\f7\nbef is very much closer from the input parameter b in the\nABPGM than in the original model.\nWe have found that the ABPGM presents a finiteinfinite transition in the (b, c) space with a peculiar reen-\n\nFIG. 9: Typical graphs of both the BPGM (a) and ABPGM\n(b) for b = 0.2 and fixed c = 0.18.\n\ngrowth walk [4] in order to include the possibility of ramification of the polymer as well as the presence of impurities in the medium. The model was found to exhibit\na finite-infinite transition due to competition between\nbranching and hindrances.\nIn this paper, we have proposed an alteration in the\ndynamics of the BPGM so as to adapt the model to\nan experimental realism. We have called it the adapted\nbranched polymer growth model (ABPGM). The main\ndifference between our proposal and the original model\nregards to the growth mechanism of a monomer which\nis chosen to bifurcate (with probability b) but has just\none empty nearest neighbor site. In the BPGM, such a\nmonomer is transformed into a bifunctional unit so that\nit grows linearly (with probability one). In our adapted\nmodel, that monomer stops and becomes a frustrated\ndead end. This frustration reveals as preferable and more\nrealistic than changing the monomer functionality from\n3 to 2 (as it occurs in the BPGM). This subtle change\nin the algorithm together with a random update of the\ngrowing ends lead to the formation of polymers with new\ntopological patterns and adjusted degrees of branching.\nIndeed, we have shown that the effective branching rate\n\nFIG. 10: Typical graphs of both the BPGM (a) and ABPGM\n(b) for b = 1 and fixed c = 0.18.\n\n[1] P. J. Flory, Principles of Polymer Chemistry (Cornell\nUniv. Press, Ithaca, NY, 1953).\n\n[2] P.G. de Gennes, Scaling Concepts in Polymer Physics\n\ntrant phase in the small interval 0.175 ≤ c ≤ 0.195. At\nthis instance, we compare some typical graphs of both the\nBPGM and ABPGM at the fixed impurity concentration\nc = 0.18 for three increasing values of b: 0.2, 0.6 and 1\n(Figures 8, 9 and 10, respectively). For the BPGM, all\nthe three corresponding configurations are infinite clusters whose boundaries change from rough to faceted as b\nincreases. On the other hand, the typical ABPGM graph\nfor b = 0.2 is a finite cluster (due to the occurrence of\nboth trapped sites and frustrated dead ends); if b = 0.6\nthe cluster is infinite (since here higher branching overcomes dead ends) and if b = 1 the cluster is finite again\n(due to a high frustration rate).\nWe hope that the ideas presented here can add a new\ndegree of physical understanding to the model as well as\nthey can approximate it to the real ramified polymers.\nThis work has been supported by Brazilian Agencies CAPES, CNPq and FAPESP (through grant No.\n96/05387-3).\n\n\f8\n(Cornell Univ. Press, Ithaca, NY, 1979).\n[3] T. C. Lubensky and J. Isaacson, Phys. Rev. A 20, 2130\n(1979).\n[4] I. Majid, N. Jan, A. Coniglio and H. E. Stanley, Phys.\nRev. Lett. 52, 1257 (1984).\n[5] H. J. Herrmann, Kinetics of Aggregation and Gelation\nedited by F. Family and D. P. Landau (North-Holland,\nAmsterdam, 1984).\n[6] J. W. Lyklema and K. Kremer, J. Phys. A 19, 279 (1986).\n[7] L. S. Lucena, J. M. Araújo, D. M. Tavares, L. R. da Silva\nand C. Tsallis, Phys. Rev. Lett. 72, 230 (1994).\n[8] U. P. C. Neves and R. N. Onody, Physica A 218, 1 (1995).\n[9] R. N. Onody and U. P. C. Neves, J. Phys. A 29, L527\n(1996).\n[10] A. Bunde, S. Havlin and M. Porto, Phys. Rev. Lett. 74,\n2714 (1995).\n[11] M. Porto, A. Shehter, A. Bunde and S. Havlin, Phys.\n\nRev. E 54, 1742 (1996).\n[12] J. S. Andrade Jr., L. S. Lucena, A. M. Alencar and J. E.\nFreitas, Physica A 238, 163 (1997).\n[13] L. S. Lucena, L. R. da Silva and Stéphane Roux, Physica\nA 266, 86 (1999).\n[14] R. N. Onody, C. A. P. Silva, Physica A 284, 23 (2000).\n[15] S. S. Botelho and F. D. A. Aarão Reis, Phys. Rev. E 63,\n011108-1 (2000).\n[16] T. C. Lubensky and J. Isaacson, Phys. Rev. Lett. 41, 829\n(1978).\n[17] S. Havlin, Z. V. Djordjevic, I. Majid and H. E. Stanley,\nPhys. Rev. Lett. 53, 178 (1984).\n[18] C. J. Camacho and M. E. Fisher, J. P. Straley, Phys. Rev.\nA 46, 6300 (1992). Data sets available in AIP document\nNo. PAPS PRLAA-466300-49, ref. 9212C-1307.\n\n\f"}