{"id": "http://arxiv.org/abs/cond-mat/0405343v1", "guidislink": true, "updated": "2004-05-15T23:10:45Z", "updated_parsed": [2004, 5, 15, 23, 10, 45, 5, 136, 0], "published": "2004-05-15T23:10:45Z", "published_parsed": [2004, 5, 15, 23, 10, 45, 5, 136, 0], "title": "Inelastic electron tunneling spectroscopy in molecular junctions: Peaks\n  and dips", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0405502%2Ccond-mat%2F0405671%2Ccond-mat%2F0405173%2Ccond-mat%2F0405070%2Ccond-mat%2F0405144%2Ccond-mat%2F0405046%2Ccond-mat%2F0405223%2Ccond-mat%2F0405086%2Ccond-mat%2F0405059%2Ccond-mat%2F0405430%2Ccond-mat%2F0405163%2Ccond-mat%2F0405261%2Ccond-mat%2F0405478%2Ccond-mat%2F0405081%2Ccond-mat%2F0405563%2Ccond-mat%2F0405145%2Ccond-mat%2F0405707%2Ccond-mat%2F0405668%2Ccond-mat%2F0405286%2Ccond-mat%2F0405007%2Ccond-mat%2F0405014%2Ccond-mat%2F0405629%2Ccond-mat%2F0405392%2Ccond-mat%2F0405322%2Ccond-mat%2F0405200%2Ccond-mat%2F0405087%2Ccond-mat%2F0405318%2Ccond-mat%2F0405687%2Ccond-mat%2F0405183%2Ccond-mat%2F0405056%2Ccond-mat%2F0405066%2Ccond-mat%2F0405194%2Ccond-mat%2F0405536%2Ccond-mat%2F0405373%2Ccond-mat%2F0405150%2Ccond-mat%2F0405553%2Ccond-mat%2F0405238%2Ccond-mat%2F0405319%2Ccond-mat%2F0405524%2Ccond-mat%2F0405239%2Ccond-mat%2F0405122%2Ccond-mat%2F0405095%2Ccond-mat%2F0405454%2Ccond-mat%2F0405685%2Ccond-mat%2F0405061%2Ccond-mat%2F0405598%2Ccond-mat%2F0405601%2Ccond-mat%2F0405419%2Ccond-mat%2F0405211%2Ccond-mat%2F0405343%2Ccond-mat%2F0405395%2Ccond-mat%2F0405030%2Ccond-mat%2F0405245%2Ccond-mat%2F0405568%2Ccond-mat%2F0405169%2Ccond-mat%2F0405165%2Ccond-mat%2F0405413%2Ccond-mat%2F0405369%2Ccond-mat%2F0405129%2Ccond-mat%2F0405092%2Ccond-mat%2F0405231%2Ccond-mat%2F0405623%2Ccond-mat%2F0405069%2Ccond-mat%2F0405269%2Ccond-mat%2F0405633%2Ccond-mat%2F0405342%2Ccond-mat%2F0405333%2Ccond-mat%2F0405709%2Ccond-mat%2F0405073%2Ccond-mat%2F0405159%2Ccond-mat%2F0405044%2Ccond-mat%2F0405107%2Ccond-mat%2F0405222%2Ccond-mat%2F0405105%2Ccond-mat%2F0405486%2Ccond-mat%2F0405674%2Ccond-mat%2F0405142%2Ccond-mat%2F0405480%2Ccond-mat%2F0405199%2Ccond-mat%2F0405202%2Ccond-mat%2F0405573%2Ccond-mat%2F0405677%2Ccond-mat%2F0405272%2Ccond-mat%2F0405675%2Ccond-mat%2F0405344%2Ccond-mat%2F0405247%2Ccond-mat%2F0405099%2Ccond-mat%2F0405611%2Ccond-mat%2F0405435%2Ccond-mat%2F0405422%2Ccond-mat%2F0405195%2Ccond-mat%2F0405518%2Ccond-mat%2F0405041%2Ccond-mat%2F0405433%2Ccond-mat%2F0405187%2Ccond-mat%2F0405131%2Ccond-mat%2F0405320%2Ccond-mat%2F0405560%2Ccond-mat%2F0405428%2Ccond-mat%2F0405234%2Ccond-mat%2F0405396&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inelastic electron tunneling spectroscopy in molecular junctions: Peaks\n  and dips"}, "summary": "We study inelastic electron tunneling through a molecular junction using the\nnon-equilibrium Green function (NEGF) formalism. The effect of the mutual\ninfluence between the phonon and the electron subsystems on the electron\ntunneling process is considered within a general self-consistent scheme.\nResults of this calculation are compared to those obtained from the simpler\nBorn approximation and the simplest perturbation theory approaches, and some\nshortcomings of the latter are pointed out. The self-consistent calculation\nallows also for evaluating other related quantities such as the power loss\nduring electron conduction. Regarding the inelastic spectrum, two types of\ninelastic contributions are discussed. Features associated with real and\nvirtual energy transfer to phonons are usually observed in the second\nderivative of the current I with respect to the voltage when plotted against\nthe latter. Signatures of resonant tunneling driven by an intermediate\nmolecular ion appear as peaks in the first derivative d(current)/d(voltage) and\nmay show phonon sidebands. The dependence of the observed vibrationally induced\nlineshapes on the junction characteristics, and the linewidth associated with\nthese features are also discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0405502%2Ccond-mat%2F0405671%2Ccond-mat%2F0405173%2Ccond-mat%2F0405070%2Ccond-mat%2F0405144%2Ccond-mat%2F0405046%2Ccond-mat%2F0405223%2Ccond-mat%2F0405086%2Ccond-mat%2F0405059%2Ccond-mat%2F0405430%2Ccond-mat%2F0405163%2Ccond-mat%2F0405261%2Ccond-mat%2F0405478%2Ccond-mat%2F0405081%2Ccond-mat%2F0405563%2Ccond-mat%2F0405145%2Ccond-mat%2F0405707%2Ccond-mat%2F0405668%2Ccond-mat%2F0405286%2Ccond-mat%2F0405007%2Ccond-mat%2F0405014%2Ccond-mat%2F0405629%2Ccond-mat%2F0405392%2Ccond-mat%2F0405322%2Ccond-mat%2F0405200%2Ccond-mat%2F0405087%2Ccond-mat%2F0405318%2Ccond-mat%2F0405687%2Ccond-mat%2F0405183%2Ccond-mat%2F0405056%2Ccond-mat%2F0405066%2Ccond-mat%2F0405194%2Ccond-mat%2F0405536%2Ccond-mat%2F0405373%2Ccond-mat%2F0405150%2Ccond-mat%2F0405553%2Ccond-mat%2F0405238%2Ccond-mat%2F0405319%2Ccond-mat%2F0405524%2Ccond-mat%2F0405239%2Ccond-mat%2F0405122%2Ccond-mat%2F0405095%2Ccond-mat%2F0405454%2Ccond-mat%2F0405685%2Ccond-mat%2F0405061%2Ccond-mat%2F0405598%2Ccond-mat%2F0405601%2Ccond-mat%2F0405419%2Ccond-mat%2F0405211%2Ccond-mat%2F0405343%2Ccond-mat%2F0405395%2Ccond-mat%2F0405030%2Ccond-mat%2F0405245%2Ccond-mat%2F0405568%2Ccond-mat%2F0405169%2Ccond-mat%2F0405165%2Ccond-mat%2F0405413%2Ccond-mat%2F0405369%2Ccond-mat%2F0405129%2Ccond-mat%2F0405092%2Ccond-mat%2F0405231%2Ccond-mat%2F0405623%2Ccond-mat%2F0405069%2Ccond-mat%2F0405269%2Ccond-mat%2F0405633%2Ccond-mat%2F0405342%2Ccond-mat%2F0405333%2Ccond-mat%2F0405709%2Ccond-mat%2F0405073%2Ccond-mat%2F0405159%2Ccond-mat%2F0405044%2Ccond-mat%2F0405107%2Ccond-mat%2F0405222%2Ccond-mat%2F0405105%2Ccond-mat%2F0405486%2Ccond-mat%2F0405674%2Ccond-mat%2F0405142%2Ccond-mat%2F0405480%2Ccond-mat%2F0405199%2Ccond-mat%2F0405202%2Ccond-mat%2F0405573%2Ccond-mat%2F0405677%2Ccond-mat%2F0405272%2Ccond-mat%2F0405675%2Ccond-mat%2F0405344%2Ccond-mat%2F0405247%2Ccond-mat%2F0405099%2Ccond-mat%2F0405611%2Ccond-mat%2F0405435%2Ccond-mat%2F0405422%2Ccond-mat%2F0405195%2Ccond-mat%2F0405518%2Ccond-mat%2F0405041%2Ccond-mat%2F0405433%2Ccond-mat%2F0405187%2Ccond-mat%2F0405131%2Ccond-mat%2F0405320%2Ccond-mat%2F0405560%2Ccond-mat%2F0405428%2Ccond-mat%2F0405234%2Ccond-mat%2F0405396&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study inelastic electron tunneling through a molecular junction using the\nnon-equilibrium Green function (NEGF) formalism. The effect of the mutual\ninfluence between the phonon and the electron subsystems on the electron\ntunneling process is considered within a general self-consistent scheme.\nResults of this calculation are compared to those obtained from the simpler\nBorn approximation and the simplest perturbation theory approaches, and some\nshortcomings of the latter are pointed out. The self-consistent calculation\nallows also for evaluating other related quantities such as the power loss\nduring electron conduction. Regarding the inelastic spectrum, two types of\ninelastic contributions are discussed. Features associated with real and\nvirtual energy transfer to phonons are usually observed in the second\nderivative of the current I with respect to the voltage when plotted against\nthe latter. Signatures of resonant tunneling driven by an intermediate\nmolecular ion appear as peaks in the first derivative d(current)/d(voltage) and\nmay show phonon sidebands. The dependence of the observed vibrationally induced\nlineshapes on the junction characteristics, and the linewidth associated with\nthese features are also discussed."}, "authors": ["Michael Galperin", "Mark A. Ratner", "Abraham Nitzan"], "author_detail": {"name": "Abraham Nitzan"}, "author": "Abraham Nitzan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.1814076", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0405343v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0405343v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "41 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0405343v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0405343v1", "journal_reference": null, "doi": "10.1063/1.1814076", "fulltext": "1\n\nInelastic electron tunneling spectroscopy in molecular junctions:\nPeaks and dips\nMichael Galperin and Mark A. Ratner\nDepartment of Chemistry, Northwestern University, Evanston IL, 60208\nand\nAbraham Nitzan\nSchool of Chemistry, The Sackler Faculty of Science, Tel Aviv University, Tel Aviv,\n69978, Israel\n\nAbstract\nWe study inelastic electron tunneling through a molecular junction using the nonequilibrium Green function (NEGF) formalism. The effect of the mutual influence between\nthe phonon and the electron subsystems on the electron tunneling process is considered\nwithin a general self-consistent scheme. Results of this calculation are compared to those\nobtained from the simpler Born approximation and the simplest perturbation theory\napproaches, and some shortcomings of the latter are pointed out. The self-consistent\ncalculation allows also for evaluating other related quantities such as the power loss during\nelectron conduction. Regarding the inelastic spectrum, two types of inelastic contributions\nare discussed. Features associated with real and virtual energy transfer to phonons are\nusually observed in the second derivative of the current I with respect to the voltage Φ\nwhen plotted against Φ. Signatures of resonant tunneling driven by an intermediate\nmolecular ion appear as peaks in the first derivative dI / dΦ and may show phonon\nsidebands. The dependence of the observed vibrationally induced lineshapes on the junction\ncharacteristics, and the linewidth associated with these features are also discussed.\n\n\f2\n\n1. Introduction\nExperiments on conduction in molecular wire junctions are becoming more\ncommon, as the community seeks to understand the principles that govern how electrical\ncharge can be carried by individual molecules.1 Early experiments focused on the absolute\nconduction and on trends such as dependence on wire length, molecular structure and\ntemperature.2 An intriguing issue is the role played by nuclear motions in the conduction\nprocess. This issue is of interest on several accounts. First, it underlines the interplay\nbetween coherent transport by carrier tunneling and/or band motion, polaronic conduction\nand incoherent, thermally assisted hopping transport.3 Indeed, the importance of the full\nhopping regime, in which charges are definitely localized on the molecular bridge, has been\ndemonstrated both in the Coulomb blockade limit4 and in a polaron-type localization\nsituation.5 Secondly, it is directly relevant to the issue of junction heating.6,7 Also, vibronic\ninteractions accompanying electron transport may lead to specific nuclear motions such as\nrotations,8,9 lateral hopping of molecules on the surface,10 atomic rearrangements11 and\nchemical reactions.12 Finally, nuclear motions can directly manifest themselves as inelastic\nsignals in the current-voltage spectra. Inelastic electron tunneling spectroscopy (IETS) has\nbeen an important tool for identifying molecular species in tunnel junctions for a long\ntime.13 With the development and advances in scanning tunneling microscopy (STM) and\nspectroscopy (STS) it has proven invaluable as a tool for identifying and characterizing\nmolecular species within the conduction region.9,14-19 Indeed, this is the only direct way to\nascertain that a molecular species indeed participates in the conduction process, and at the\nsame time to provide important spectroscopic and structural data on the conducting\nmolecule, in particular information on the strength of the vibronic coupling itself.\nThe interpretation of electronic transport in molecular junctions has so far been\ndone largely in the context of an elastic scattering picture ultimately derived from the\nLandauer approach.20 Inelastic conductance through models of molecular wires was\nconsidered theoretically by several workers. Ness and Fisher21 and Todorov and\ncoworkers22 have considered the inelastic propagation of an electron through the junction as\na multichannel scattering problem, while Segal, Nitzan, Ratner and coworkers6,23 as well as\nMay, Petrov and coworkers24 have used formalisms based on generalized quantum master\nequations. The influence of the contact population (Pauli principle) on the inelastic process\n\n\f3\nis disregarded in these works as is the influence of the electronic subsystem on the phonon\ndynamics.\nA systematic framework describing transport phenomena in interacting particle\nsystems is based on the nonequilibrium Green's function (NEGF) formulation.25 For the\nparticular case of IETS, while simple perturbative treatments using Herzberg-Teller like\nanalysis of the molecular Green's function or the electron propagator26 may be useful for\nrough estimates using realistic molecular models, such a heuristic approach is not fully\nconsistent with the non-equilibrium conditions under which such measurements are done as\nwell as with the boundary restrictions imposed by the Pauli principle. Also, by using the\nlowest order in the electron-phonon interaction it misses important interference effects and\ncannot deal with the mutual effects of electron correlation and vibronic coupling. The\nNEGF formalism can readily handle such problems,27,28 though its complexity may limit its\nusefulness to relatively simple molecular models. Several recent discussions of inelastic\ntransport in microscopic junctions are particularly relevant to the present discussion29-32\n(see also the early treatment by Caroli et al27).\nSuch an approach was recently taken by Ueba and coworkers30-32 who have applied\nthe NEGF formalism to the resonant level model of phonon assisted tunneling where a\nsingle bridge level represents a junction connecting two free electron reservoirs while being\nalso coupled to a single harmonic mode. The free particle Hamiltonian is\n\nHˆ 0 = E1cˆ1† cˆ1 +\n\n∑\n\nk∈L , R\n\nε k dˆk† dˆk + Ω0 aˆ † aˆ\n\n(1)\n\nwhere cˆ1† and cˆ1 are creation and annihilation operators for electrons on the bridging level\nof energy E1, {k} = {l},{r} are sets of electronic states representing the left (L) and the right\n(R) electrodes with the corresponding creation and annihilation operators dˆk† and dˆk and\n\naˆ † and aˆ are creation and annihilation operator for the phonon mode of frequency Ω0 . The\ninteractions are given by\nHˆ 1 =\n\n∑\n\nk∈L , R\n\n(V\n\nˆ†\nk1d k cˆ1\n\n)\n\n(\n\n)\n\n+ h.c. + M aˆ † + aˆ cˆ1†cˆ1\n\n(2)\n\nWithin this mode Ueba et al have reproduced and improved results obtained earlier by\nPersson and Baratoff33-35 where inelastic tunneling spectra were analyzed in the leading\n\n\f4\norder M2 of the electron phonon interaction. Persson and Baratoff have observed (following\nDavis36) that in this order there is an important correction to the elastic component of the\ntunneling current at the onset ( | eΦ |= Ω0 where Φ is the bias potential) of the inelastic\nchannel. This contribution to the tunneling flux stems from what may be seen as\ninterference between purely elastic current amplitude that does not involve electron-phonon\ninteraction and the elastic amplitude associated with two electron-phonon interaction events\ninvolving virtual phonon emission and absorption. Similarly, Lorente and M.Persson29 have\nrecently generalized the Tersoff-Hamann approach to the tunneling in STM junctions, using\nmany-body density functional theory in conjunction with the NEGF formulation of Caroli\net al27 to obtain the change in the local density of substrate electronic states caused by a\nweak electron-phonon coupling. This approach again yields the inelastic contribution to the\ntunneling flux in the lowest order in the electron-phonon coupling, as well as the elastic\ncorrection of the same order. This formalism was later applied to formulate symmetry\npropensity rules for vibrationally inelastic tunneling.15\nAt the threshold | eΦ |= Ω0 of the inelastic tunneling channel both the elastic and\nthe inelastic fluxes change, with the latter obviously increasing from its zero value below\nthreshold. In contrast, as first noted by Person and Baratoff,35 depending on the energetic\nparameters of the system, the correction to the elastic current may be negative.\nFurthermore, this negative change in the elastic tunneling component may outweigh the\npositive contribution of the inelastic current, leading to a negative peak in the second\nderivative of the current/voltage relationship. Such negative features have indeed been\nobserved in single-molecule vibrational spectroscopy of methyl isocyanide adsorbed on\naluminia-supported rhodium particles37 and of oxygen molecules chemisorbed on\nAg(100).16 It should be noted that not only the sign but also the shape of these peaks\ndepend on the energetic parameters of the system,38 and recent results by Reed and\ncoworkers18 that show relatively strong derivative-like features in the low temperature\nIETS spectrum of C8 alkane thiols may be another manifestation of the same effect.\nThe Person-Baratoff analysis33-35 as well as its reassessment by Ueba and\ncoworkers30-32 correspond to the limit where electron transmission across the junction is a\nlow probability event that does not disturb the electron distribution in the leads. In the\nopposite limit where the leads-bridge coupling is strong so that the transmission probability\n\n\f5\nis nearly 1 (and the single channel conduction given by ~ e2 / π ) we may encounter the\nsituation where in the negatively biased lead backscattered electrons of energies in the\nconduction window between the left ( EFL ) and right ( EFR ) Fermi energies are locally\ndepleted near the junction. In this case the onset of inelastic scattering at ω0 =| eΦ | can\ngive rise to increased reflection (which would otherwise be impossible by the Fermi\nexclusion) and, consequently, a negative step in the conduction. This is presumably the\ndominant mechanism for observed negative peaks in d 2 I / d Φ 2 in point contact\nspectroscopy characterized by large transmission probabilities.19,39\nThe inelastic tunneling features discussed so far are usually observed as peaks (or\ndips) in the second derivative of the current voltage relationship at the threshold where the\nelectronic energy associated with the bias voltage eΦ just matches the oscillator energy\nΩ0 . Another manifestation of electron phonon interaction in inelastic tunneling can be\n\nobserved as phonon sidebands of resonance tunneling features.17 Figure 1 illustrates the\nenergetic scenarios for these different processes at T=0. The shaded areas on the right and\nleft denote the continuous manifolds of states of the two leads where the lines separating\nthe occupied and unoccupied states are the corresponding Fermi energies. In this zero order\npicture a wavefunction of the overall system is a product of lead wavefunctions and a\nmolecular state. One of the two manifolds shown for the right lead represents the ground\nvibrational state of the molecule. The other (diagonally shaded) corresponds to the\nmolecule in the first excited vibrational state. We assume for simplicity that a potential bias\nФ amounts to raising the energy of the left lead states without affecting the other states of\nthe model and that conduction takes place via the LUMO (lowest unoccupied molecular\norbital) state of the bridge molecule, i.e. resonance tunneling occurs via negative ion states.\nAs the bias is increased the first type of vibrational feature is obtained when eΦ = Ω0 and\nis seen as a peak (dip) in the d 2 I / dΦ 2 vs. Φ spectrum. The second type appears when Φ\nis large enough so that μ L just exceeds E1: resonance tunneling features appear as peaks in\nthe conductance ( dI / dΦ vs. Φ ) spectrum. At low temperature the first such peak\ncorresponds to the ground state of the molecular negative ion state, however if the width\nassociated with the coupling of this state to the metal is small enough additional peaks are\n\n\f6\nexpected when μ L traverses E1 + n Ω0 , n = 1,2,... (peaks associated with negatives values\nof n are also possible at higher temperatures). Similar features can be seen in the\nconduction dependence on a gate potential which changes the position of E1 relative to the\nFermi energies. The process is analogous to resonance Raman scattering40 and both the\nproximity to resonance and the fact that the transient electronic state is charged imply\nstrong vibronic coupling and consequently long progression of vibrational satellites, as\nindeed seen in the experimental results of Refs.\n\n17\n\n. We are not familiar with a theoretical\n\ntreatment of these observations, however the same resonant tunneling model described\nabove, when properly generalized to allow for strong electron-phonon coupling should\nprovide a suitable framework.\n\nΕ1\nμR+hω\n\nμL\nμR\n\nΦ\nhΩ0\n\nR\n\nL\n\nFig. 1. A schematic view of the level structure for inelastic electron tunneling. The shaded areas on\nthe right and left denote the continuous manifolds of states of the two leads where the lines\nseparating the occupied and unoccupied states are the corresponding Fermi energies. The parabola\nrepresents the nuclear potential surface of the bridge. For the right lead two manifolds are shown:\none where the corresponding molecular state is the ground vibrational state of the molecule, and the\nother (diagonally shaded) where the molecule is in the first excited vibrational state. The horizontal\ndotted lines at heights μ L and E1 are added to guide the eye.\n\nIn this paper we generalize the NEGF approach to inelastic tunneling spectroscopy\nin several ways. First, many electronic states and phonon modes are taken into account,\nallowing the usual treatments of a real molecular bridge in any convenient representation.\nSecondly, the vibrational modes are taken as two subsets. The primary subset are those\nmodes that directly couple to the electronic transition (the analogs of the mode considered\nabove). A secondary set of thermal bath modes, assumed to be in thermal equilibrium, are\ntaken to couple linearly to the primary modes. The dynamics of the primary modes is\n\n\f7\nconsidered explicitly, i.e. unlike most former treatments their non-equilibrium state is\nderived from the dynamics of the problem. As such, they are driven by the electronic\ncurrent and relax due to their coupling both to the electronic system and to the thermal bath\nof secondary modes. This aspect of the formalism is probably not very important for most\nIETS observations, but it makes it possible to address the issue of heating and subsequent\npossible chemical rearrangements in the junction.41 Finally, the inelastic tunneling problem\nis considered in the self-consistent Born approximation42,43 that goes far beyond the second\norder approximation used earlier. This makes it possible to account for overtones of the\ninelastic signals that are observed in resonant tunneling situations. Furthermore, we show\nthat while the second order approximation captures much of the essential physics of the IET\nprocess, infinite order corrections can lead to quantitative differences with qualitative\nimplications, e.g. peaks (dips) in d 2 I / dΦ 2 vs. Φ predicted by the low order theory can\nappear as dips (peaks) in the infinite order calculation. Finally, experimentally verifiable\npredictions are made with respect to the dependence of the shape of the vibrational features\nin d 2 I / dΦ 2 as the molecule-lead coupling is changed e.g. by changing the distance of the\nSTM tip.\nOur general model is described in Section 2 where an outline of the NEGF method\nand the self consistent Born approximation is also presented. In section 3 we give some\nrepresentative results in which we (a) compare the predictions of different approximation\nschemes, (b) demonstrate the presence of inelastic contributions in the normal tunneling\ncurrent (second derivative spectrum) and as sidebands to resonant peaks in the conductance\n(first derivative) spectrum, and (c) show the effect of junctions characteristics, in particular\nthe tip-molecule distance as expressed by the corresponding electron escape rate, on the\nIETS lineshape. In Section 4 we discuss the linewidth of the IETS vibrational features in\nconjunction with the recent experimental results of Wang et al18 and assess the relative\nimportance of different contributions to the observed \"intrinsic\" linewidth. Section 5\nconcludes.\n\n2. Technical details\n\n\f8\nWe consider a two terminal junction with leads represented by free electron\nreservoirs in thermal equilibrium coupled through a bridging molecular system. The\nassumption that the electrodes are in thermal equilibrium under the steady-state operation\nof the junction corresponds to a weak coupling situation (i.e. conduction much smaller than\n\nπ e2 / ) which characterizes most molecular junctions. In what follows we refer to the\nmolecular bridge (possibly with a few lead atoms on both sides, constituting together an\nextended molecule) as our system. Nuclear motions are described as harmonic normal\nmodes and are divided into two groups. The primary group includes local phonons that\ninteract with the electronic system. Electron-phonon interaction in the leads is disregarded.\nThe secondary phonon group represents the environment, assumed to be in thermal\nequilibrium, which is coupled to the local phonons. The primary phonons are thus driven\nby the non-equilibrium electronic system concurrently with interchanging energy with their\nthermal environment. The zero-order Hamiltonian in second quantization takes the form\nHˆ 0 = ∑ tij cˆi† cˆ j +\ni, j\n\n∑\n\nk∈L , R\n\nε k dˆk† dˆk + ∑ Ωl aˆl† aˆl + ∑ ωm bˆm† bˆm\nl\n\n(3)\n\nm\n\nwith tii = Ei . The four terms on the right hand side represent respectively electrons on the\nmolecules, electrons on the leads, the primary subset of molecular harmonic modes and the\nsecondary subset of harmonic modes representing the thermal environment. The first and\nthird terms are obvious generalizations of the corresponding terms in Eq. (1) allowing for\nmany primary phonon modes and for many molecular electronic states. In the last term\n\n( )\n\nbˆm bˆm†\n\nrepresent the annihilation (creation) operators of the phonon bath modes. The\n\nsingle electron basis chosen to represent the molecular electronic system can vary:\ncˆ j (cˆ†j ) can correspond to an atomic or molecular orbital, a lattice point, a plane wave or any\nother convenient basis. Also, any additional single electron term such as the effect of an\nexternal field can be incorporated into the first term of Eq. (3). Internal degrees of freedom\nsuch as spin are assumed to be incorporated in the indices used.\nThis zero order description is supplemented by the interaction Hamiltonian\nHˆ 1 =\n\n∑\n\nk∈L , R ;i\n\n(V dˆ cˆ + h.c.) + ∑ M\n†\nki k i\n\nl ,i\n\nl ˆ †\ni Al cˆi cˆi\n\n+ ∑U ml Aˆl Bˆ m\nl ,m\n\n(4)\n\n\f9\nwhere Aˆl = aˆl† + aˆl and Bˆm = bˆm† + bˆm . The three terms in Eq. (4) correspond respectively to\ncoupling to the leads, coupling of the primary phonons to the electronic system (here taken\nto be of the polaronic form) and interaction of the local phonon modes with their thermal\nenvironment.\nThe principal objects used in the dynamical description of a coupled many body\nquantum system within the NEGF approach are the one-particle Green's functions (GFs).\nIn our coupled electron-phonon system these are the electronic and phononic GFs on the\nmolecular bridge defined on the Keldysh contour by\nGij (τ ,τ ') = −i Tˆc cˆi (τ )cˆ†j (τ ')\n\n(electrons)\n\n(5)\n\nDij (τ ,τ ') = −i Tˆc Aˆi (τ ) Aˆ †j (τ ')\n\n(phonons)\n\n(6)\n\nwhere Tˆc is the contour ordering operator. These GFs satisfy Dyson-type equations\nG (τ ,τ ') = G0 (τ ,τ ') + ∫ dτ1 ∫ dτ 2 G0 (τ ,τ 1 ) Σ(τ1 ,τ 2 ) G (τ 2 ,τ ')\n\n(7)\n\nD (τ ,τ ') = D0 (τ ,τ ') + ∫ dτ1 ∫ dτ 2 D0 (τ ,τ1 ) Π (τ1 ,τ 2 ) D (τ 2 ,τ ')\n\n(8)\n\nc\n\nc\n\nc\n\nc\n\nwhere Σ and Π are the electron and phonon self energies, respectively. These are essentially\ndressed single-particle interactions that can be represented to a desired level of\napproximation by the GFs themselves, thus providing a closed set of equations that can be\nsolved self-consistently. The standard way for treating steady-states proceeds by projecting\nthese equations onto the real time axis, yielding equations for the projected GFs and self\nenergies (denoted as usual by the superscripts a, r, < and >), and using the fact that at steady\nstates all two-time quantities depend only on the time difference to obtain the\ncorresponding equations in Fourier (energy) space. The resulting equations for the GFs are\nthe Dyson equations for the retarded GFs\n−1\nG ( E ) =  G0r ( E )  − Σ r ( E ) \n\n\nr\n\n−1\n\n−1\nD r (ω ) =   D0r (ω )  − Π r (ω ) \n\n\n\n(9)\n−1\n\n(10)\n\n(and the equivalent equations for their advanced counterparts) and the Keldysh equations\nfor the lesser and greater projections\n\n\f10\nG < ( E ) = G r ( E )Σ< ( E )G a ( E ) (and same with < ↔> )\n\n(11)\n\nD < (ω ) = D r (ω )Π < (ω ) D a (ω ) (and same with < ↔> )\n\n(12)\n\nIn Eqs. (9) and (10) G0r ( E ) and D0r (ω ) are the electron and local phonon Green functions\nfor the uncoupled system described by the Hamiltonian (3). We have denoted the Fourier\nvariables associated with the electronic and phononic GFs by E and ω respectively. In the\nnon-crossing approximation44 (which in the present context amounts to assuming that the\ninteractions of the 'system' with different 'bath' environments are independent of each other)\nthe self energies are obtained in the forms\nΣ ( E ) = Σ L ( E ) + Σ R ( E ) + Σ ph ( E )\n\n(13)\n\nΠ (ω ) = Π ph (ω ) + Π el (ω )\n\n(14)\n\nThe components of the electronic self energy Σ are those associated with the coupling to the\nleft and right leads, ΣL and ΣR, and that arising from the coupling to the primary phonons,\nΣ ph . The former can be obtained exactly, leading to particularly simple forms in the wide\n\nband limit for the leads that essentially implies that the real parts of the corresponding\nretarded (advanced) self energies can be disregarded while their imaginary parts are\napproximated as energy independent constants:\n*\n\n Σ rL ( R )  = Σ aL ( R )  = −(1/ 2)iΓijL ( R )\n\n ij \n ji\n\n(15a)\n\n Σ<L ( R )  = iΓijL ( R ) f L ( R ) ( E )\n\n ij\n\n(15b)\n\n Σ >L ( R )  = −iΓijL ( R ) 1 − f L ( R ) ( E ) \n\n\n\n ij\n\n(15c)\n\nwhere f L ( R ) ( E ) are the Fermi-Dirac distributions characterized by the corresponding\nchemical potentials μ L ( R ) , f K ( E ) =  exp ( E − μ K ) / k BT  + 1\n\n−1\n\nand ΓijL ( R ) is the level-\n\nwidth matrix defined by\nΓijK ( E ) = 2π ∑ VikVkj δ ( E − Ek )\n\n(independent of E in the wide-band limit) (16)\n\nk∈K\n\nwith K = L, R denoting the left or right lead. The phonon contribution to the electronic\nself-energy reads\n\n\f11\n Σ rph ( E )  = i ∑ M ik1 M kj 2 ∫ d ω  Dk< k (ω )Gijr ( E − ω ) + Dkr k (ω )Gij< ( E − ω )\n1 2\n\n ij\n2π  1 2\nk1 ,k2\n\n+ Dkr1k2 (ω )Gijr ( E − ω )  (17a)\n+ δ ij\n\n∑\n\nk1 ,k2 ,i '\n\nM ik1 M ik'2 niel' Dkr1k2 (ω = 0 )\n\n Σ<ph ( E )  = i ∑ M ik1 M kj 2 ∫ dω Dk< k (ω )Gij< ( E − ω )\n\n ij\n2π 1 2\n\n(17b)\n\n Σ >ph ( E )  = i ∑ M ik1 M kj 2 ∫ dω Dk> k (ω )Gij> ( E − ω )\n\n ij\n2π 1 2\n\n(17c)\n\nk1 ,k2\n\nk1 ,k2\n\nThe term containing the factor niel' in Eq. (17a) is the so called Hartree term in the electronphonon interaction. Here niel = ρii where\n\nρij = −i ∫\n\ndE <\nGij ( E )\n2π\n\n(18)\n\nThis Hartree term does not appear in solid-state treatments of this problem because by\nmomentum conservation they turn out to involve only phonons of zero momentum whose\ndensity vanishes. The other terms are standard in the self-consistent Born approximation to\nthis problem.\nThe self energy matrix associated with the primary phonons is expressed in Eq. (14)\nas a sum of contributions from the interaction with the electronic system, Π el (ω ) and the\ninteraction with the thermal bath of secondary phonons, Π ph (ω ) . The latter is obtained\nexactly in the wide band limit of this thermal bath, using the fact that this bath is in thermal\nequilibrium. Its projected components are given by 45\n Π rph (ω )  = −(1/ 2)isgn (ω ) γ ij (ω )\n\n ij\n\n(19a)\n\n Π <ph (ω )  = −iγ ij (ω ) F (ω )\n\n ij\n\n(19b)\n\n Π >ph (ω )  = −iγ ij (ω ) F ( −ω )\n\n ij\n\n(19c)\n\n N ( ω ) ω > 0\nF (ω ) = \n1 + N ( ω ) ω < 0\n\n(20)\n\nwhere\n\n\f12\n\nγ ij (ω ) = 2π ∑U mi U mj δ (ω − ωm ) (ω independent in the wide band limit) (21)\nm\n\nand where N (ω ) = [ exp(ω / k BT ) − 1]\n\n−1\n\nis the Bose Einstein distribution. Finally, the\n\ncontribution Π el (ω ) to the primary phonons self-energy due to their coupling to the\nelectronic system can be expressed in terms of the electronic Green's function. Its\nprojections are\n Π elr (ω )  = −i ∑ M ii M i j ∫ dE Gi<i ( E )Giai ( E − ω ) + Giri ( E )Gi<i ( E − ω ) \n1\n21\n12\n21\n\n ij\n\n2\n2π  1 2\n\n(22a)\n\n Π el< (ω )  = −i ∑ M ii M i j ∫ dE Gi<i ( E )Gi>i ( E − ω )\n1\n21\n\n ij\n2\n2π 1 2\n\n(22b)\n\n Π el> (ω )  = −i ∑ M ii M i j ∫ dE Gi>i ( E )Gi<i ( E − ω )\n1\n21\n\n ij\n2\n2π 1 2\n\n(22c)\n\ni1 ,i2\n\ni1 ,i2\n\ni1 ,i2\n\nThe self consistent Born approximation (SCBA) is a computational scheme that\neffectively sums an infinite subset of non-crossing diagrams in the perturbation expansion\nof Green functions of many-body systems.42,46 The procedure starts with the expressions\nfor the Green's functions of the electronic system and the primary phonons that are zero\norder in the electron-phonon interaction. It is convenient to designate these as our zero\norder GFs for the rest of the calculation. With this re-designation Eqs. (9)-(10) remain valid\nprovided that only Σ ph ( E ) and Π el (ω ) are included in the corresponding self energies. For\nthe case of a single bridge level these zero order GFs are given by\n\n(\n\nG0r ( E ) = G0a ( E )\n\nG0< ( E ) =\nG0> ( E ) =\n\n)\n\n*\n\n= [ E − E1 + (1/ 2)iΓ( E ) ]\n\n−1\n\nif L ( E )Γ L ( E ) + if R ( E )Γ R ( E )\n\n( E − E1 ) + ( Γ( E ) / 2 )\n2\n\n2\n\n−i [1 − f L ( E ) ] Γ L ( E ) − i [1 − f R ( E ) ] Γ R ( E )\n\n( E − E1 )2 + ( Γ( E ) / 2 )2\n\nwith Γ = Γ L + Γ R .\n\n(23a)\n\n(23b)\n\n(23c)\n\nFor the case of a single primary harmonic mode the phonon GF\n\nprojections are\n\n(\n\nD0r (ω ) = D0a (ω )\n\n)\n\n*\n\n=\n\n1\n1\n−\nω − Ω0 + ( i / 2 ) γ (ω ) ω + Ω0 + ( i / 2 ) γ (ω )\n\n(24a)\n\n\f13\nD0< (ω ) = F (ω )  D0r (ω ) − D0a (ω )  sgn(ω )\n\n\n\n(24b)\n\nD0> (ω ) = F (−ω )  D0r (ω ) − D0a (ω )  sgn(ω )\n\n\n\n(24c)\n\nwhere F (ω ) is defined in Eq. (20). If (as is commonly done) the relaxation to a thermal\nbath of secondary phonons is disregarded, Eqs (24) take the simpler form\n\nD0r (ω ) =\n\n1\n1\n−\nω − Ω0 + iδ ω + Ω0 + iδ\n\n(25a)\n\nD0< (ω ) = −2π i { N (Ω0 )δ (ω − Ω0 ) + (1 + N (Ω0 ) ) δ (ω + Ω0 )}\n\n(25b)\n\nD0> (ω ) = −2π i { N (Ω0 )δ (ω + Ω0 ) + (1 + N (Ω0 ) ) δ (ω − Ω0 )}\n\n(25c)\n\nThese expressions are easily generalized to situations with many electronic states and many\nprimary phonons on the bridge. For the latter one often assumes for simplicity that they are\nnot mixed by their interaction with the thermal bath, so Eqs. (24) are taken to hold for each\nmode separately.\nThe numerical calculation of these Green functions and self energies involves\nrepeated integrations over the electronic energy E and the frequency variable ω. These are\ndone using numerical grids that are chosen large enough to span the essential energy and\nfrequency regions of the corresponding spectra, and dense enough relative to the spectral\nwidths to yields reliable quadratures. As always, the choice of grid parameters reflect a\ncompromise between accuracy and numerical efficiency. Some details on our choices are\nprovided in the Figure captions in Sect. 3.\nAt each iteration step the Green functions of the previous step are used to update\nelectron and phonon self-energies associated with the electron-phonon interaction using\nEqs. (17) and (22), which in turn are used in (9)-(12) to obtain the next generation Green\nfunctions. The procedure terminates when the self-energies (17) and (22) have converged.\nConvergence of a matrix m is determined by the condition\nmij( n ) − mij( n −1)\nmij( n−1)\n\n< δ ; (all i, j )\n\nwith δ some predefined tolerance, where n-1 and n are subsequent iteration steps.\n\n(26)\n\n\f14\nAfter convergence is achieved, the resulting Green functions and self-energies can\nbe used to calculate many important one-particle characteristics of the junction. In\nparticular, the total current through the junction is given by\nI L( R) =\n\n2e dE  <\n>\n>\n<\n∫ 2π Tr Σ L( R) ( E )G ( E ) − Σ L( R) ( E )G ( E )\n\n(27)\n\nHere I L ( R ) is the current at the left (right) molecule-lead contact. It can be shown that\nI L = − I R in accordance with Kirchoff's law. Using Eq. (11) and the assumed additive form\n(13) of the electronic self-energy, the total current (27) can be recast as a sum of elastic and\ninelastic contributions written below at the left contact:\n2e dE  <\nr\n>\n>\na\n∫ 2π Tr Σ L ( E )G ( E ) Σ L ( E ) + Σ R ( E ) G ( E )\n\nI el =\n\n−Σ > ( E )G r ( E ) Σ<L ( E ) + Σ <R ( E )  G a ( E )  =\n\n=\n\n2e\n\nI inel =\n\n(28)\n\ndE\nr\na\n∫−∞ 2π ( f L ( E ) − f R ( E ) ) Tr Γ L ( E ) G ( E ) Γ R ( E ) G ( E )\n∞\n\n2e dE  <\nr\n>\na\n>\nr\n<\na\n∫ 2π Tr Σ L ( E )G ( E ) Σ ph ( E )G ( E ) −Σ L ( E )G ( E ) Σ ph ( E )G ( E )\n\n(29)\n\nThe identification of these contributions to the total current with the elastic and inelastic\ncomponents can be substantiated by considering the equivalent scattering forms of these\nequations (see Appendix A). Note that the \"Landauer form\" obtained in (28) contains\nretarded and advanced GFs that are renormalized by the electron-phonon interaction. In\nfact, this renormalization yields the phonon induced correction to the elastic current. In the\nlowest order in the electron-phonon interaction (2nd order in the coupling M) the GFs in\n(29) are replaced by their zero-order counterparts (23a) and Σ ph is taken from the lowest\norder equivalent of Eq. (17) in which the GFs G and D are represented by their zero order\ncounterparts:\n(2)\nI inel\n=\n\n2e dE  <\nr\n>\na\n>\nr\n<\na\n∫ 2π Tr Σ L ( E )G0 ( E ) Σ ph,0 ( E )G0 ( E ) −Σ L ( E )G0 ( E ) Σ ph,0 ( E )G0 ( E )\n\n(30)\nTo obtain Eq. (28) in the same order, the GFs are expressed by the lowest order Dyson\nforms\nG r ( E ) = G0r ( E ) + G0r ( E )Σ rph,0 ( E )G0r ( E ) (and same for r ↔ a )\nto get\n\n(31)\n\n\f15\nI el(0) + I el(2) =\n2e\n\n2e\n\n∞\n\ndE\n\n∫−∞ 2π ( f L ( E ) − f R ( E ) ) Tr Γ L ( E ) G0 ( E ) Γ R ( E ) G0 ( E ) +\nr\n\na\n\n+∞\n\ndE\nr\nr\nr\na\n∫ 2π ( f L ( E ) − f R ( E ) ) Tr Γ L ( E )G0 ( E )Σ ph,0 ( E )G0 ( E )Γ R ( E )G0 ( E ) + h.c.\n−∞\n\n(32)\n\nEqs. (30) and (32) were recently used by Mii et al31 to rederive the results of Persson and\nBaratoff34,35 for the IETS spectra for a model of a single electronic level connecting\nbetween the leads (in this case all GFs and self energies are scalars and the trace operation\nin (30) and (32) is unneeded). In appendix B we repeat this derivation along a somewhat\ndifferent route that yields the phonon-induced correction δ I to the current obtained in the\nabsence of electron-phonon coupling in a form that is not limited (as the earlier work) to the\nlowest (second) order in the electron-phonon interaction. This improved representation will\nbe useful in the discussion of Section 4 below of IETS linewidths. For a one-level bridge\nthis calculation leads to\n\nδI =\n\n2e\n\n(\n(\n\n)\n)\n\n2\n\nE − E1 ( E ) − ( Γ / 2 )\nΓLΓR\ndE\nρ\nE\nE\n(\n)\nΓ\n(\n)\n[ f L ( E ) − f R ( E )]\nph\n2\n∫ Γ2 el\n2\n−∞\nE − E1 ( E ) + ( Γ / 2 )\n+∞\n\n2\n\n(33)\n\nwhere ρ el ( E ) = − Im G r ( E ) / π is the electronic density of states, Γ ph ( E ) = −2 Im Σ rph ( E )\nand E1 ( E ) = E1 + Re Σ rph ( E ) . Eq. (33) is similar to Eq. 17 of Ref. 31, except that Σ ph,0 ( E )\n(the lowest order phonon contribution to the electronic self-energy) and its real and\nimaginary components, are replaced here by by Σ ph ( E ) and its components, and ρ el ,0 ( E ) ,\nthe zero order electronic density of states is replaced by its exact counterpart.\nWe note in passing that another important quantity readily calculated from these\nGFs and self energies is the power loss in the junction, i.e. the net energy flux from the\nelectronic into the phononic system\nP=−\n\n2 dE\n<\n>\n>\n<\n∫ 2π E Tr Σ ph ( E ) G ( E ) − Σ ph ( E ) G ( E )\n\n(34)\n\nSome preliminary results based on this expression are shown below, however we defer a\nthorough analysis of this issue to a separate publication.\nTo end this section we consider the different levels of approximations that can be\nused for describing IETS. The procedure described above constitutes the self-consistent\n\n\f16\nBorn approximation. In the simple Born approximation one replaces all the GFs in Eqs.\n(28) and (29) by their expression (9)-(12), however the self energies Σ ph and Π el are\ncalculated from Eqs. (17) and (22) using the zero order GFs. This amounts to stopping the\nSCBA procedure after the first iteration. Finally, Eqs. (30) and (32) represent results\nobtained in the lowest order in the electron-phonon interaction. In what follows we refer to\nthese approximations as the Self consistent Born Approximation (SCBA), the Simple Born\nApproximation (BA) and the lowest order perturbation theory (LOPT).\n\n3. Representative numerical results\nIn the calculations described below we have employed a model with a single\nharmonic mode in the primary set directly coupled to the electronic system. We primarily\nconsider two situations that are distinguished by the choice of molecule-electrodes\ncouplings. In one that corresponds to strong chemisorption to both leads we take ΓL = ΓR =\n0.5eV. In the other, more akin to an STM geometry, we take ΓL=0.05eV ΓR=0.5eV, where\nthe more weakly coupled electrode represents physisorption. The Fermi energies of the two\nleads were taken to be zero in the unbiased junction. As a \"standard\" set of parameters we\nhave also taken the electronic state energy in the unbiased junction Ei=tii=1eV, the primary\nphonon frequency Ω0 = 0.13 eV, the electron-phonon coupling M=0.3eV and the thermal\nrelaxation rate of the phonon γph = 1⋅10-3 eV. Under bias Φ we kept the energy E1 of a\nsingle site bridge fixed and took\n\nμL\nμR\n\n=\nEF + η | e | Φ\n= EF − (1 − η ) | e | Φ\n\n(35)\n\nwhere e is the electron charge and EF is the unbiased Fermi energy that is set to zero. η is\nthe \"voltage division factor\"47 chosen as η = Γ R / Γ with Γ = Γ L + Γ R . This reflects a\nchoice of model in which the molecular state is essentially pinned to the Fermi level of the\nchemically bonded electrode in the STM configuration where Γ L\n\nΓ R . When a model of\n\ntwo bridge electronic states was used, the corresponding atomic energies Ei = tii were\ntaken to interpolate linearly between μL and μR, and their interstate coupling was chosen\nt12 = 0.3 eV. Note that the choice M=0.3eV for the electron-phonon coupling corresponds\n\n\f17\nto a reorganization energy of M 2 / Ω0 ≈ 0.7 eV. These parameters were selectively varied\nin different calculations in order to elucidate their effect on the inelastic signal. Finally, the\nconvergence tolerance for self-consistent procedure (Eq.(18)) was set to 10−4 .\nResults for the current-voltage behavior of junctions characterized by these\nparameters at temperature T=300K are shown in Figures 2a and 3a. Fig. 2 depicts results\nobtained for the single level bridge while Fig. 3 shows similar results obtained for the 2level bridge. These results compare the completely elastic case (without coupling to\nphonons) with the results obtained in the presence of electron-phonon coupling calculated\nboth in the limit where thermal relaxation of the primary phonon is fast (so that it may be\ntaken to be in thermal equilibrium and the thermal (secondary) phonon bath may be\ndisregarded), and in the more realistic case when this phonon reaches a steady state\nbalanced between pumping by the electronic system and relaxing into its thermal\nenvironment. We note in passing that the appearance of negative differential resistance in\nthe ballistic transport shown in Fig. 3a results from our model assumption of a linear\npotential drop on the bridge that, for large bias, has the effect of shifting the two bridge\nlevels out of resonance with each other. We see that electron-phonon coupling makes only\na modest effect on the current-voltage behavior even for the present choice of relatively\nstrong coupling. However the main interest in these plots lies in the power loss that results\nin heating of the phonon system. Figs. 2b,c and 3b,c show the absolute and the relative\n(with respect to the overall bias) power loss, Eq. (34), and the oscillator \"temperature\"\n(defined by equating its average steady state occupation to the corresponding Bose Einstein\nexpression) obtained for the chosen parameters from the full self-consistent calculation as\nfunctions of the applied voltage. The relatively high steady state temperature obtained\n(T=4000K corresponds to an average phonon occupation n~2) reflects the relatively large\ncoupling used and the fact that the full extent of the electron phonon-coupling (as expressed\nby the choice of reorganization energy) was implemented into a single oscillator. A\nsystematic investigation of the application of this model to the issue of junction heating will\nbe published separately.\n\n\f18\n\nFig. 2. (a) The current-voltage dependence\nin a junction characterized a single bridge\nlevel and by the \"standard\" set of parameters\n(see text) with ΓL = ΓR = 0.5eV. Full line (red)\n– result obtained for M=0 (no electronphonon coupling). Dashed and dotted lines\nshow the effect of electron-phonon coupling,\nwhere the dotted (blue) line represents the\nresult obtained under the assumption that the\nmolecular vibration is at thermal equilibrium\nunaffected by its coupling to the nonequilibrium electronic system while the\ndashed (green) line corresponds to the case\nwhere relaxation rate of the molecular\nvibration due to its coupling to its thermal\nenvironment (secondary phonons) is finite.\nIntegrations over the electronic energy axis\nwere done using an energy grid of 3501\npoints spanning the region between –0.5 and\n3 eV with step-size 0.001 eV and those over\nthe phonon frequency were carried using a\ngrid of 601 points spanning the frequency\nrange between -0.3 and 0.3 eV with stepsize 0.001 eV. (b) The power loss (dashed\n(green) line, left axis) and the nonequilibrium oscillator 'temperature' (full\n(red) line, right axis) for the case represented\nby dashed line in (a) plotted against the\nvoltage bias. The dotted (blue) line depicts\nthe power loss for the case represented by\nthe dotted (blue) line in (a). (c) Same as the\ndashed line in (b), where the power loss is\ndisplayed relative to the total available\npower IΦ.\n\n\f19\n\nFig. 3. Same as Fig. 2, for a two electronic state bridge (see text for the 'standard' parameters),\ncomparing the ballistic case and the case with electron-phonon coupling and finite thermal\nrelaxation rate.\n\nFigure 4 repeats the calculation of Fig. 2 at temperature T=10K, now focusing on\nthe inelastic signal. Here we show the calculated inelastic tunneling spectrum, d 2 I / d Φ 2\nplotted against the bias potential Φ, and compare the results obtained from the three\ncomputational schemes discussed in Section 2. It is seen that the signal obtained from the\nLOPT approach as well as from the BA calculation is underestimated at low voltage and\noverestimated at the larger voltage regime relative to the full SCBA calculation.\nFurthermore, while the three calculations describe rather well the first phonon peak, higher\n\n\f20\nharmonics are seen most strongly in the full self-consistent (SCBA) treatment and faintly in\nthe BA calculation.\n\nFig. 4. The inelastic tunneling spectrum, d 2 I / d Φ 2 plotted against the bias potential Φ, for the\nmodel with a single bridge state at T=10K. The 'standard' parameters are used with ΓL=0.05eV\nΓR=0.5eV. The calculation is done using the SCBA (full line, red), the BA (dashed line, green) and\nthe LOPT (dotted line, blue) schemes. These calculations were done using a grid in electron energy\nof 1501 points spanning range from -1.0 eV to 2.75 eV with steps size 0.0025 eV and a grid in the\nphonon frequency of 201 points spanning range from –0.5 eV to 0.5 eV with step 0.0025 eV.\n\nAs discussed in Section 1, a different kind of inelastic signal is obtained as phonon\nside bands to the resonant tunneling peaks in the conductance/voltage plot. For bridge\nassisted tunneling such peaks are expected at the bias potential for which the molecular\nHOMO or LUMO level just enters the potential window between μL and μR (and similarly\nat Coulomb blockade thresholds). Phonon sidebands should appear as additional peaks, that\nmay be resolved if the resonance width, of order Γ = Γ L + Γ R , is small relative to the\nphonon frequency Ω0. Figure 5 shows this effect, where the same set of standard\nparameters was used as in Fig. 2 except that we take ΓL = ΓR =0.013eV. For this choice of\nparameters, however, the BA calculation failed while the SCBA procedure did not\nconverge.48 The results shown in Fig. 5 are obtained using the scattering theory approach of\nWingreen et al,51 where a small polaron transformation is applied to affect a high order\ntreatment of the electron-phonon coupling. This calculation yields the transmission\ncoefficient T(E) as a function of the electron energy. At low temperature and for an STM\n\n\f21\nconfiguration with the tip acting as the left electrode and the bridge levels pinned to the\nsubstrate (right electrode), T(EFL+eΦ) is directly related to the differential conduction\ndI / d Φ . It is seen that the resonance peak associated with the bridge electronic level is\n\naccompanied by higher phonon harmonics in the transmission probability, in\ncorrespondence with experimental observations.17\n\nFig. 5. The transmission coefficient T plotted as a function of electron energy E for the junction of\nFig. 2 where the electron escape rates ΓL and ΓR are taken each to be 0.013eV. Integration grids are\nthe same as in figs. 2 and 3.\n\nNext we consider situations where dips in the inelastic tunneling spectrum may be\nobserved. This issue was discussed extensively by Persson and Baratoff33-35 and by Ueba\nand coworkers31,32 however some new observations can be made. Figure 6 compares, for\nthe single resonant level model, results obtained using the LOPT, BA and SCBA\ncalculation schemes. Here we use Ω0=0.13eV, E1=0.6eV and M=0.3eV for the parameters\nthat characterize the bridge, T=10K, and ΓL=0.05eV ΓR=0.5eV for the parameters\nassociated with the bridge-lead coupling, and assume that the molecular vibration maintains\nits thermal equilibrium in the biased, current carrying junction. We indeed see a dip in both\nthe SCBA and BA results for the inelastic tunneling spectrum at eΦ = Ω0 , however the\nLOPT used in the earlier works to analyze this phenomenon yields a peak rather than a dip\nin this spectrum. This observation is hardly surprising: The phonon-induced correction to\n\n\f22\nthe tunneling current includes elastic and inelastic contributions, where the former may be\nnegative. The total effect on the tunneling spectrum depends on the balance between these\npositive and negative corrections, leading to peaks or dips in the second derivative\nspectrum. Thus, a quantitative error in the low order calculation may translate into a\nqualitative difference, predicting a peak rather than a dip (or vice verse) in the tunneling\nspectrum. The different behavior predicted by the BA and the SCBA for the higher\nharmonic features stems from a similar reason.\n\nFig. 6. d 2 I / d Φ 2 plotted against Φ for the single resonant level model with parameters described\nin the text. Full line (red) – SCBA. Dashed line (green): BA Dotted line (blue): LOPT. The inset\nshows an expanded view of the LOPT result. The integration grids were 3001 points from -1.0eV\nto 2.0eV with step size 0.001 eV for the electronic energy and 1001 points from -0.5eV to 0.5eV\nwith step size 0.001 eV for the vibrational frequency.\n\nThe sensitivity of the observed IETS features to parameters of the molecular\nelectronic structure and of the electron-phonon coupling was already emphasized by Mii et\nal.32 An example based on the full SCBA calculation is shown in Fig. 7. Here we use the\n\"standard\" parameters with ΓL=ΓR=0.5eV and T=10K, and compare results for different\nchoices of E1, the position of the resonant level relative to the unbiased Fermi energies. It is\nseen that the character of the IETS feature can change from dip to peak as E1 is increased\nat constant Γ , as already discussed within the LOPT calculation by Persson and Baratoff.\n\n\f23\n\nFig. 7. A SCBA calculation of the IETS threshold feature in d 2 I / dΦ 2 for the one resonant level\nmodel using the 'standard' parameters (see text) with ΓL=ΓR=0.5eV and T=10K. Full line (red)\nE1=0.70eV, dashed line (green) – E1=0.60eV, dotted line (blue) – E1=0.55eV. The grids used in the\nnumerical calculation are the same as in Fig. 6.\n\n\f24\n\nFig. 8. A SCBA calculation of the IETS threshold feature in d 2 I / dΦ 2 for the one resonant level\nmodel at T=10K, using the 'standard' parameters (see text) except that E1 is taken as 0.6eV.\nΓR=0.5eV and ΓL is 0.05eV in (a) and 0.5eV in (b). In (b) the full line corresponds to the case\nwhere\nthe\nFermi\nenergies\nare\nshifted\nunder\nthe\nbias\naccording\nto\nμ L = e Φ ( Γ R / Γ ) , μ R = − e Φ ( Γ L / Γ ) ,while the dashed line was produced for the model\nμ L = e Φ , μ R = 0 . Numerical grids are as in Fig. 6.\n\nThe same observation may be carried further, into an experimentally verifiable\nprediction. In figure 8 we consider the same one-level molecular model in an STM\nconfiguration, so that ΓL, taken to be the width parameter associated with the molecule-tip\ncoupling, can be varied by changing the tip-molecule distance. Fig. 8 shows the dependence\nof the calculated spectrum on ΓL and on the potential distribution in the junction. A\nsubstantial effect on the shape of the IETS feature is seen, changing here from an\nessentially symmetric dip in one case to a peak-derivative like feature in the other. Indeed,\nboth symmetric16 and asymmetric18 IETS dips were observed in molecular junctions and it\n\n\f25\nwould be of interest to systematically examine the lineshape evolution as a function of tipsubstrate distance.\n\n4. The IETS linewidth\nSpectroscopic linewidths are often difficult to interpret since their origin may lie in diverse\nphysical factors. In a recent IETS experiment by Wang et al18 it was found possible to\neliminate or to estimate some of the important contributions of the thermal Fermi\ndistribution in the substrate and of the distribution of the local electrostatic field, and to\ncome up with what the authors call an intrinsic linewidth of 3.73±0.98meV at T=4K in a\njunction containing a layer of alkanethiol molecules. The rate of vibrational relaxation due\nto nuclear coupling with the thermal environment is expected not to exceed a few\nwavenumbers, say up to 1meV. Inhomogeneous broadening is always a possible\ncontribution to the observed linewidth. However for a molecule adsorbed on a metallic\nsubstrate another channel of relaxation involves the vibronic coupling to the continuum of\nelectron hole pairs in the metal. Indeed, such coupling has been shown to be important and\nsometimes dominating source of broadening in the infrared spectra of molecules adsorbed\non metal surfaces.34 In this Section we use the theoretical tools presented in Section 2 to\nestimate the effect of vibronic coupling on the linewidth of vibrational features in IETS.\nSince a truly intrinsic linewidth can be observed only in a single molecule measurement,\nthe relevant energy scales are those suitable to an STM experiment, i.e. Γ L\n\nΓ R and E1\n\npinned to the Fermi energy of the right electrode. However in what follows we consider the\ngeneral case represented by keeping E1 pinned to the unbiased Fermi energy and moving\nthe chemical potentials of the left and right electrodes according to Eq. (35). As in Sect. 3\nthe model η = Γ R / Γ was applied. The STM limit, with the left electrode representing the\ntip, is given by η → 1 .\nWe start with the T=0 limit of Eq. (33). It contains an explicit dependence on the\nimposed potential that leads to31\n\n\f26\n\n(\n(\n(μ\n)\n(μ\n\n)\n)\n)) − (Γ / 2)\n)) + ( Γ / 2)\n\n2\n2\n\nμ L − E1 ( μ L ) − ( Γ / 2 )\n2e 2 Γ L Γ R \n=\nη ρel ( μ L ) Γ ph ( μ L )\n2\n2\ndΦ\nΓ2 \nμ L − E1 ( μ L ) + ( Γ / 2 )\n\n\nd (δ I )\n\n+ (1 − η ) ρel ( μ R ) Γ ph ( μ R\n\nR\n\n− E1 ( μ R\n\nR\n\n− E1 ( μ R\n\n2\n\n2\n\n\n\n\n2\n\n\n2\n\n(36)\n\nIt is seen that in (36) the dependence on the potential enters in several places, however the\npotential dependence of the terms Γ ph ( E = μ L (Φ )) and Γ ph ( E = μ R (Φ )) , associated with\nthe contribution of the electron-phonon interaction to the electronic self energy, is of\nspecial importance because of its singular character. It may be shown,31 starting from Eq.\n(B2) and using (17b) and (17c) that these factors are given by31 (see also Appendix B)\nΓ ph ( μ L ) = 2π M\n\neΦ\n2\n\n∫\n\nd ω ρ ph (ω )\n\n0\n\nΓ ph ( μ R ) = 2π M 2\n\neΦ\n\n∫\n\nd ωρ ph (ω )\n\n0\n\nΓR\nρel ( μ L − ω )\nΓ\n\n(37)\n\nΓL\nρel ( μ R + ω )\nΓ\n\nwhere ρel ( E ) and ρ ph (ω ) are the electron and phonon density of states, which, for the\none resonant-level model are given explicitly by (cf. Eqs. (B3) and (B4))\n1\n\n(E)\n\n1\n\nΓ\n\nIm D r (ω ) =\n\nγ tot (ω )\n1\n2π (ω − Ω0 )2 + ( γ tot (ω ) / 2 )2\n\ntot\n=\nρel ( E ) = − Im G r ( E ) =\n2π ( E − E ( E ) )2 + ( Γ ( E ) / 2 )2\nπ\n1\ntot\n\nρ ph (ω ) = −\n\nsgn(ω )\n\nπ\n\nΓtot ( E ) r\nG ( E )G a ( E )\n2π\n\n(38)\n\n(39)\n\nwhere E1 ( E ) = E1 + Re Σ rph ( E ) , while\nΓtot ( E ) ≡ Γ − 2 Im Σ rph ( E ) = Γ + Γ ph ( E )\n\n(40a)\n\nγ tot (ω ) ≡ γ ph − 2 Im Π elr (ω ) = γ ph + γ el (ω )\n\n(40b)\n\nand\n\nare the total electron and phonon widths. In typical situations, where the molecule is\nstrongly interacting with at least one electrode, Γtot >> γ tot , so ρ ph (ω ) represents a\n\n\f27\nrelatively sharp feature. Consider now the second derivative d 2 I / dΦ 2 . The principal\ncontribution to structure in this function of Φ comes from the derivative of\nΓ ph ( EF + | e | Φ ) in (36), while the other terms in (36) as well as the phonon independent\nterm I (0) only contribute some background (and also determine the sign of the computed\nfeature). Thus, using (36) and (37) we find, approximately\n\n(\n(\n\n)\n)\n\n2\n2\n\nμ L − E1 ( μ L ) − ( Γ / 2 )\nd 2δ I 4π e3 Γ L Γ R 2\n ΓR\nM ρ ph (| e | Φ ) η\nρel ( μ L ) ρ el ( μ L − | e | Φ )\n=\n2\n2\nd Φ2\nΓ2\nΓ\nμ L − E1 ( μ L ) + ( Γ / 2 )\n\n2\n2\nμ R − E1 ( μ R ) − ( Γ / 2 ) \nΓL\nρel ( μ R ) ρ el ( μ R + | e | Φ )\n+ (1 − η )\n\n2\n2\nΓ\nμ R − E1 ( μ R ) + ( Γ / 2 ) \n+ background terms\n(41a)\n\n(\n(\n\nor, for η = 1 and/or Γ L\nd 2δ I\nd Φ2\n\n=\n\n4π e3 Γ L Γ R\nΓ2\n\n+ background\n\n)\n)\n\nΓR ,\n\nM ρ el ( EF + | e | Φ ) ρ el ( EF\n2\n\n(E\n)\n(E\n\nF\n\n+ | e | Φ − E1 ( EF + | e | Φ ) ) − ( Γ / 2 )\n\nF\n\n+ | e | Φ − E1 ( EF + | e | Φ ) ) + ( Γ / 2 )\n\n2\n\n2\n\n2\n2\n\nρ ph (| e | Φ )\n\nterms\n(41b)\n\nwhere the dependence on Φ has now been written explicitly. As could be expected, we find\nthat the lineshape of the IETS feature is determined by the function ρ ph ( Φ ) which peaks\nabout eΦ = Ω0 with an intrinsic width given by (40b). When Ω0 exceeds the Debye\nfrequency of the thermal environment, the vibrational contribution γph to this width is\nstrongly temperature dependent and its low temperature magnitude is expected to be far\nbelow 1mV.52 The electronic contribution, γ el = −2Im Π el (ω ) can be estimated from the\nsecond order expression for the electronic contribution to the phonon self energy, Eq. (22),\nusing Eqs. (23). The result is\n\nγ el (ω ) = 2M\n\n+∞\n2\n\ndE f L ( E )Γ L + f R ( E )Γ R\n\n∫ 2π ( E − ε ) + ( Γ / 2 )\n2\n\n−∞\n\n1\n\n2\n\nIm\n\nΓ − 2iω\n(42)\n( E + ω − E1 + iΓ / 2 )( E − ω − E1 − iΓ / 2 )\n\nFig. 9 shows the results obtained using both this lowest order estimate of Π and the value\nobtained form the converged SCBA calculation, plotted against the applied voltage bias.\n\n\f28\nThe parameters used in this calculation, T=10K, E1=1eV, ΓL=ΓR=0.5eV, Ω0=0.13eV,\nM=0.4eV and γph=0.0001eV represent reasonable orders of magnitudes given available\nexperimental data. At | e | Φ = Ω0 = 0.13eV we find this contribution to be a few mV, of\nthe order observed by Wang et al.18 While the result depends on the choice of parameters,\nthis dependence is relatively mild so the result can be viewed as a reasonable order of\nmagnitude estimate. We may conclude that broadening of the vibrational features due to\ncoupling between molecular vibrations and substrate conduction electrons constitutes a\nsubstantial contribution to the intrinsic width observed in the experiment of Wang et al,18\nwith inhomogeneous broadening possibly making a contribution of similar order of\nmagnitude.\n\nFig. 9. The width of a vibrational IETS feature obtained from Eq. (42) (with the additional additive\nterm γ ph = 0.0001eV ) plotted against the imposed potential bias. See text for parameters. Full\n(red) line – SCBA calculation. Dotted (blue) line – lowest order perturbation theory.\n\n5. Conclusions\nWe have considered a scheme for phonon-assisted electron tunneling, where the\nmutual influence of electron and local phonon modes is taken into account and where the\nlocal phonon mode is coupled to a harmonic thermal bath. The NEGF methodology can be\nreadily used to extend previous studies to situations involving relatively strong electronphonon coupling. A simple resonant-level model was studied numerically, and the\ninfluence of different interactions on the junction properties was considered. We have\n\n\f29\ncompared results obtained using three levels of approximation: The full self consistent\ncalculation, the Born approximation that amounts to the first step of the full procedure and\nthe widely used perturbation theory scheme. In view of this comparison we may conclude\nthat results based on perturbation theory have only qualitative values, and in fact their\nquantitative failure may translate into a qualitative one when interference phenomena such\nas those giving rise to dips in the tunneling spectrum play an important role in the process.\nWe have also noted that while the peaks and dips mentioned above are observed in\nsecond derivative of the current vs. voltage, another type of peaks - satellites of the elastic\nresonant peak due to phonon-assisted transport - can be observed in the first derivative\n(conductance) plot.\nThe model considered in this work assumes that under steady state conditions the\nelectronic manifolds that describe the metal electrodes are in thermal equilibrium. This\nassumption is valid in the limit where the junction affects a relatively small coupling\nbetween the leads, i.e. when the conduction is much smaller than the quantum unit e2 / π .\nThis is indeed the case for most molecular junctions. In the opposite limit encountered in\nmetallic point contacts and also apparently in the molecular H2 junction studied in Ref. 19,\nthe transmission coefficient is close to unity, implying that the leads are not in equilibrium,\ne.g. backscattered electrons are locally absent in the source lead. The implication of this\nsituation on the observed inelastic spectrum and a comparison between these two extreme\ncases will be considered elsewhere.\nThe same framework that incorporates electron-phonon interactions in the\ncalculation of electron tunneling phenomena may be used to assess power loss and heat\nproduction during channel conductance. We have described one example of such\ncalculation, however we defer a full discussion of this important issue to a later study.\nThis model and theoretical framework were also used to discuss the shape and\nwidth of vibrational features in inelastic tunneling spectroscopy. The observed lineshapes\nreflect contributions of phonon-induced elastic and inelastic tunneling fluxes, and are\naffected by interference with the phononless elastic component. This result in strong\nsensitivity to the energy of the resonant level, and perhaps more interestingly, to the\nstrength of molecule-leads electronic interaction that can be controlled by the tip-molecule\n\n\f30\ndistance in an STM type experiment. With respect to the widths of IETS features, we have\nconcluded that coupling of molecular vibrational motion to the conduction electrons of the\nlead to which the molecule binds strongly contributes a substantial part of the\nexperimentally observed \"intrinsic\" linewidth of a few meV, although additional\ncontribution from inhomogeneous broadening cannot be ruled out.\n\nAppendix A\nHere we give a scattering theory-like illustration that identifies the contributions\n(28) and (29) to the total current as the corresponding elastic and inelastic channels. In a\nscattering process only one state 0 (the incoming state) of energy ε0, say in the left\ncontinuum, is assumed occupied, so the initial energy is specified. All other states\n\n{r }\n\n{ l } and\n\nin the left and right continua are taken to be unoccupied so they do not contribute to\n\nthe flux. Also, since we are interested in transmission rather than reflection, outscattering to\nthe left continuum\n\n{l }\n\nis disregarded. Under these conditions the transport process\n\nessentially represents a decay of the state 0 to the (unoccupied) continuum\n\n{ r }.\n\nThis\n\nimplies\nΣ0< ( E ) = 2π i V10 δ ( E − ε 0 ) ; Σ0> ( E ) = 0\n2\n\nΣ<L ( E ) = 0\n\n;\n\nΣ >L ( E ) = 0\n\nΣ<r ( E ) = 0\n\n;\n\nΣ >r ( E ) = −i 2π V1r δ ( E − ε r )\n\n(A1)\n2\n\nThe contribution, Eq. (28), to the scattering flux from state 0 to state r is then\n2e dE <\n2e\n2\n2 r\nr\n>\na\na\n∫ 2π Σ0 ( E )G ( E ) Σr ( E ) G ( E ) = 2π V10 V1r G (ε 0 ) G (ε 0 ) δ (ε 0 − ε r )\n(A2)\nand is seen indeed to be an elastic current. Note that the GFs in (A2) are renormalized by\nI 0el→r =\n\nthe electron-phonon interaction. For the other contribution, Eq. (29), we get\n\n\f31\nI 0inel\n→r =\n\n2e dE <\nr\n>\na\n∫ 2π Σ0 ( E )G ( E ) Σ ph ( E )G ( E )\n=−\n\n2e\n\nV10\n\n2\n\n+∞\n\ndω >\nM G (ε 0 ) G (ε 0 ) ∫\nD (ω ) G > ( ε 0 − ω )\n2π\n−∞\n2\n\nr\n\na\n\n(A3)\n\nwhere we have used Eq. (17b). From Eqs. (23)-(25) D> is strongly peaked about ω = ±Ω0\nso the integral is proportional to G > ( ε 0 ± Ω0 ) which is peaked about ε r = ε 0 ± Ω0 (to\n−1\n\n2\n2\n2\nlowest order G0> ( E ) = −i 2π V1r δ ( E − ε r ) ( E − E1 ) + ( Γ( E ) / 2 )  ). We see that this is\n\n\n\nindeed an inelastic contribution.\n\nAppendix B\nHere derive analytical approximations for the inelastic electron tunneling features\nthat are used in the discussions of Sections 2 and 4. The expressions derived here are\nsimilar to those of Ref.\n\n31\n\n, however they are not restricted to second-order in electron-\n\nphonon interaction, and include also phonon coupling to a thermal bath of secondary\nphonons.\nWe start from the expressions for the elastic and inelastic currents Eqs. (28) and\n(29). Consider first the inelastic component. For the case where Γ L ( E ) Γ R ( E ) = constant\n(which always holds in the wide band approximation) the inelastic current can be expressed\nL\nR\n− (1 − x) I inel\nand choosing x = Γ R / Γ\nin a \"Landauer-like\" form by taking53 I inel = xI inel\n\nwhere Γ = Γ L + Γ R . This leads to\nI inel =\n\n2e\n\n+∞\n\ndE\n\n Γ L ( E )Γ R ( E ) r\n\nG ( E )Γ ph ( E )G a ( E )  ( f L ( E ) − f R ( E ) )\nΓ( E )\n\n\n∫ 2π Tr \n\n−∞\n\n(B1)\n\nwith\nΓ ph ( E ) = −2 Im Σ rph ( E ) = i Σ >ph ( E ) − Σ <ph ( E ) \n\n(B2)\n\n\f32\nHenceforth, we focus on the case of a one electronic level bridge. In this case electron and\nphonon densities of states take the form\n1\n\n(E)\n\n1\n\nΓ\n\nIm D r (ω ) =\n\nγ tot (ω )\n1\n2π (ω − Ω0 )2 + ( γ tot (ω ) / 2 )2\n\ntot\n=\nρel ( E ) = − Im G r ( E ) =\n2π ( E − E ( E ) )2 + ( Γ ( E ) / 2 )2\nπ\n1\ntot\n\nρ ph (ω ) = −\nwhere\n\nsgn(ω )\n\nπ\n\nE1 ( E ) = E1 + Re Σ rph ( E ) ,\n\nΓtot ( E ) r\nG ( E )G a ( E )\n2π\n\n(B3)\n\n(B4)\n\nΓtot ( E ) ≡ Γ − 2Im Σ rph ( E ) = Γ + Γ ph ( E )\n\nand\n\nγ tot (ω ) ≡ γ − 2 Im Π elr (ω ) = γ + γ el (ω ) are total electron and phonon widths, respectively.\nNext we define the non-equilibrium electron and phonon occupations n( E ) and N (ω )\naccording to\nG < ( E ) = 2π in( E ) ρ el ( E ); G > ( E ) = −2π i [1 − n( E ) ] ρ el ( E )\n\n(B5)\n\nand\n\nω<0\n−2π i 1 + N ( ω )  ρ ph (ω ) ω < 0\n −2π iN ( ω ) ρ ph (ω )\n>\nD (ω ) = \n; D (ω ) = \nω >0\n −2π iN (ω ) ρ ph (ω )\n −2π i 1 + N (ω )  ρ ph (ω ) ω > 0\n(B6)\n<\n\nThis leads to an expression for Γ ph ( E ) , the phonon contribution to the electronic linewidth,\nthat was first derived in Ref. 32\n\nΓ ph ( E ) = 2π M\n\n2\n\n∞\n\n∫ dω ρ ph (ω ){[1 + N (ω )] ρel ( E − ω ) [1 − n( E − ω )]\n0\n\n+ N (ω ) ρel ( E + ω ) [1 − n( E + ω ) ] + N (ω ) ρel ( E − ω )n( E − ω )\n\n(B7)\n\n+ [1 + N (ω ) ] ρel ( E + ω )n( E + ω )}\n\nIn cases where the molecule-lead interaction stems from chemisorption it is reasonable to\nexpect that Γ >> Γ ph , so Γtot may be replaced by Γ in the RHS of Eq. (B3). Using this in\nexpression (B1) for the inelastic current leads to\nI inel =\n\n2e\n\n+∞\n\n∫ dE\n\n−∞\n\nΓLΓR\nρ el ( E )Γ ph ( E ) ( f L ( E ) − f R ( E ) )\nΓ2\n\n(B8)\n\n\f33\nNext consider the elastic current. It is convenient to redefine again the zero-order\nGreen function so that 'zero order' includes the coupling to the contacts as well the level\nshift (real part of the self energy) arising from the electron-phonon interaction. With this\ndefinition we have\nG0r ( E ) =\n\n1\n; E1 ( E ) = E1 + Re Σ rph ( E )\nE − E1 ( E ) + iΓ / 2\n\n(B9)\n\nand\nG r ( E ) = G0r ( E ) + G0r ( E ) i Im Σ rph ( E )  G r ( E )\n\n\nFrom Eq. (B10) it follows that\nΓ ph ( E )  Γ ph ( E )  \n2πρel(0) ( E ) \nG r ( E )G a ( E ) =\n1 − 2πρel ( E )\n1 −\n\nΓ\n2 \n2Γ  \n\nUsing this in Eq. (28) and taking again Γ ph / Γ << 1 leads to\n\n(B10)\n\n(B11)\n\nI el = I el(0) + δ I el\nI el(0) =\n\n∞\n\n2e\n\n∫ dE\n\n−∞\n\nδ I el = −2π\n\n2e\n\n(B12a)\nΓ L Γ R (0)\nρel ( f L ( E ) − f R ( E ) )\nΓ\n\n+∞\n\n∫\n\n−∞\n\ndE\n\n(B12b)\n\nΓ ph\nΓ L Γ R (0)\nρel ρel\n( fL (E) − fR (E))\n2\nΓ\n\n(B12c)\n\nEqs. (B8) and (B12c) finally give the total correction to the tunneling current\n\nδ I = δ I el + I inel =\n\n2e\n\n(\n(\n\n)\n)\n\n2\n\nE − E1 ( E ) − ( Γ / 2 )\nΓLΓR\n(\n)\nΓ\n(\n)\ndE\nρ\nE\nE\n( f L ( E ) − f R ( E ) ) (B13)\nel\nph\n2\n∫ Γ2\n2\n−∞\nE − E1 ( E ) + ( Γ / 2 )\n+∞\n\n2\n\nwhich is Eq. (33). Eq. (B13) is of the same form as Eq. (17) of Ref.\n\n31\n\n, however the\n\ndensities of electronic states ρ el and the phonon contribution to the resonance width Γ ph\nappear here in their exact form (i.e. including corrections due to the electron-phonon\ncoupling) rather then in the zero-order (in M) forms as in Ref. 31, and the shifted resonance\nenergy E1 replaces the bare energy E1 . This makes it possible to use (B13) in conjunction\nwith the SCBA scheme to evaluate SCBA-corrected lineshapes and linewidths of IETS\nfeatures.\nFor low temperature, the Fermi functions in (B13) can be replaced by the\ncorresponding step-functions, e.g. f L ( E ) = θ (μ L − E ) . Introducing the voltage division\n\n\f34\nfactor η that determines the position of the resonance level E1 relative to μ L and μ R\naccording to\n\nμL\nμR\n\n=\nEF + η | e | Φ\n= EF − (1 − η ) | e | Φ\n\n(B14)\n\none gets from (B13) the phonon contribution to the differential conductance in the form\n\n(\n(\n\n\nμ L − E1 ( μ L )\n2e2 Γ L Γ R \n(\n)\n(\n)\nη\nρ\nμ\nμ\n=\nΓ\n\nel\nL\nph\nL\ndΦ\nΓ2 \nμ L − E1 ( μ L )\n\n\nd (δ I )\n\n(\n(\n\n)\n)\n\n) − ( Γ / 2 )2\n2\n) + ( Γ / 2 )2\n2\n\n(B15)\n\nμ R − E1 ( μ R ) − ( Γ / 2 ) \n+ (1 − η ) ρel ( μ R ) Γ ph ( μ R )\n\n2\n2\nμ R − E1 ( μ R ) + ( Γ / 2 ) \nAlso at low T we can take N (ω ) = 0 and n( E ) ≈\n\n2\n\n2\n\nΓL\nΓ\nθ (μ L − E ) + R θ (μ R − E ) . Eq. (B7)\nΓ\nΓ\n\nthen yields for Φ > 0\nΓ ph ( μ L ) = 2π M\n\n2\n\n| e| Φ\n\n∫\n\nd ω ρ ph (ω )\n\n0\n\nΓ ph ( μ R ) = 2π M 2\n\nΓR\nρel ( μ L − ω )\nΓ\n\n| e| Φ\n\n∫\n\nd ω ρ ph (ω )\n\n0\n\n(B16a)\n\nΓL\nρel ( μ R + ω )\nΓ\n\n(B16b)\n\nSince ρ ph (ω ) is strongly peaked about ω = Ω0 , these functions of Φ behave as step\nfunctions near eΦ = Ω0 . In taking the derivative of (B15) with respect to Φ, the main\ncontribution arises from this near-singularity of dΓ ph / dΦ , other contributions constituting\na background. Thus we finally obtain\n\n(\n(\n\n)\n)\n\n2\n2\n\nμ L − E1 ( μ L ) − ( Γ / 2 )\nd 2δ I 4π e Γ L Γ R 2\n ΓR\nρ el ( μ L ) ρ el ( μ L − | e | Φ )\n=\nM ρ ph (| e | Φ ) η\n2\n2\nΓ2\nΓ\nd Φ2\nμ L − E1 ( μ L ) + ( Γ / 2 )\n\n2\n2\nμ R − E1 ( μ R ) − ( Γ / 2 ) \nΓL\nρel ( μ R ) ρ el ( μ R + | e | Φ )\n+ (1 − η )\n\n2\n2\nΓ\nμ R − E1 ( μ R ) + ( Γ / 2 ) \n+ background terms\n(B17)\n\n(\n(\n\n)\n)\n\n\f35\n\nAcknowledgements: MR thanks the DoD/MURI initiative, the NASA URETI program\nand the NSF NCN program for support. AN thanks the Israel Science Foundation, the USIsrael Binational Science Foundation and the Volkswagen Foundation for support. AN\nthanks Prof. Jan van Ruitenbeek (Leiden University) for illuminating discussions.\n\nFigure captions\nFigure 1. A schematic view of the level structure for inelastic electron tunneling. The\nshaded areas on the right and left denote the continuous manifolds of states of the two leads\nwhere the lines separating the occupied and unoccupied states are the corresponding Fermi\nenergies. For the right lead two manifolds are shown: one where the corresponding\nmolecular state is the ground vibrational state of the molecule, and the other (diagonally\nshaded) where the molecule is in the first excited vibrational state. The horizontal dotted\nlines at heights μ L and E1 are added to guide the eye.\n\nFigure 2. (a) The current-voltage dependence in a junction characterized by a single bridge\nlevel and by the \"standard\" set of parameters (see text) with ΓL = ΓR = 0.5eV. Full line (red)\n– result obtained for M=0 (no electron-phonon coupling). Dashed and dotted lines show the\neffect of electron-phonon coupling, where the dotted (blue) line represents the result\nobtained under the assumption that the molecular vibration is at thermal equilibrium\nunaffected by its coupling to the non-equilibrium electronic system while the dashed\n(green) line corresponds to the case where relaxation rate of the molecular vibration due to\nits coupling to its thermal environment (secondary phonons) is finite. Integrations over the\nelectronic energy axis were done using an energy grid of 3501 points spanning the region\nbetween –0.5 and 3 eV with step-size 0.001 eV and those over the phonon frequency were\ncarried using a grid of 601 points spanning the frequency range between -0.3 and 0.3 eV\nwith step-size 0.001 eV. (b) The power loss (dashed (green) line, left axis) and the non-\n\n\f36\nequilibrium oscillator 'temperature' (full (red) line, right axis) for the case represented by\ndashed line in (a) plotted against the voltage bias. The dotted (blue) line depicts the power\nloss for the case represented by the dotted (blue) line in (a). (c) Same as the dashed line in\n(b), where the power loss is displayed relative to the total available power IΦ.\n\nFigure 3. Same as Fig. 2, for a two electronic state bridge (see text for the 'standard'\nparameters), comparing the ballistic case and the case with electron-phonon coupling and\nfinite thermal relaxation rate.\n\nFigure 4. The inelastic tunneling spectrum, d 2 I / dΦ 2 plotted against the bias potential Φ,\nfor the model with a single bridge state at T=10K. The 'standard' parameters are used with\nΓL=0.05eV ΓR=0.5eV. The calculation is done using the SCBA (full line, red), the BA\n(dashed line, green) and the LOPT (dotted line, blue) schemes. These calculations were\ndone using a grid in electron energy of 1501 points spanning range from -1.0 eV to 2.75 eV\nwith steps size 0.0025 eV and a grid in the phonon frequency of 201 points spanning range\nfrom –0.5 eV to 0.5 eV with step 0.0025 eV.\n\nFigure 5. The transmission coefficient T plotted as a function of electron energy E for the\njunction of Fig. 2 where the electron escape rates ΓL and ΓR are taken each to be 0.013eV.\nIntegration grids are the same as in figs. 2 and 3.\n\nFigure 6. d 2 I / dΦ 2 plotted against Φ for the single resonant level model with parameters\ndescribed in the text. Full line (red) – SCBA. Dashed line (green): BA Dotted line (blue):\nLOPT. The inset shows an expanded view of the LOPT result. The integration grids are the\nsame as in Fig. 4.\n\nFigure 7. The IETS threshold feature in d 2 I / dΦ 2 for the one resonant level model using\nthe 'standard' parameters (see text) with ΓL=ΓR=0.5eV and T=10K. Full line (red) –\nE1=0.70eV, dashed line (green) – E1=0.60eV, dotted line (blue) – E1=0.55eV. The grids\nused in the numerical calculation are the same as in Fig. 4.\n\nFigure 8. The IETS threshold feature in d 2 I / dΦ 2 for the one resonant level model at\nT=10K, using the 'standard' parameters (see text) except that E1 is taken as 0.6eV.\nΓR=0.5eV and ΓL is 0.05eV in (a) and 0.5eV in (b). In (b) the full line corresponds to the\ncase\n\nwhere\n\nthe\n\nFermi\n\nenergies\n\nare\n\nshifted\n\nunder\n\nthe\n\nbias\n\naccording\n\nto\n\n\f37\nμ L = e Φ ( Γ R / Γ ) , μ R = − e Φ ( Γ L / Γ ) ,while the dashed line was produced for the model\nμ L = e Φ , μ R = 0 . Numerical grids are as in Fig. 6.\n\nFigure 9. The width of a vibrational IETS feature obtained from Eq. (42) (with the\nadditional additive term γ ph = 0.0001eV ) plotted against the imposed potential bias. See\ntext for parameters. Full (red) line – SCBA calculation. Dotted (blue) line – lowest order\nperturbation theory.\n\n\f38\n\nREFERENCES\n\n1\n\nProcesses in Molecular Wires, edited by P. Hanggi, M. Ratner, and S. Yaliraki, Vol.\nChemical Physics, 281, 111 (2002).\n\n2\n\nMolecular electronics, edited by J. Jortner and M. Ratner (Blackwell Science,\nOxford, 1997); Molecular Electronics II, edited by A. Aviram, M. Ratner, and V.\nMujica (New York academy of Sciences, New York, 2002); Molecular Electronics:\nScience and Technology, edited by A. Aviram and M. Ratner (New York, 1998).\n\n3\n\nA. Nitzan, Ann. Rev. Phys. Chem. 52, 681 (2001).\n\n4\n\nJ. Park, A. N. Pasupathy, J. I. Goldsmith, C. C. Chang, Y. Yaish, J. R. Petta, M.\nRinkoski, J. P. Sethna, H. D. Abruna, P. L. McEuen, and D. L. Ralph, Nature 417\n(722-725) (2002).\n\n5\n\nS. Kubatkin, A. Danilov, M. Hjort, J. Cornil, J.-L. Bredas, N. Stuhr-Hansen, P.\nHedegard, and T. Bjornholm, Nature 425, 698 (2003).\n\n6\n\nD. Segal and A. Nitzan, J. Chem. Phys. 117 (8), 3915 (2002).\n\n7\n\nD. Segal, A. Nitzan, and P. Hanggi, J. Chem. Phys. 119, 6840 (2003); Y.-C. Chen,\nM. Zwolak, and M. DiVentra, Nano Letters 3, 1691 (2003).\n\n8\n\nB. C. Stipe, M. A. Rezaei, and W. Ho, Science 279, 1907 (1998).\n\n9\n\nB. C. Stipe, M. A. Rezaei, and W. Ho, Phys. Rev. Lett. 82, 1724 (1999).\n\n10\n\nT. Komeda, Y. Kim, M. Kawai, B. N. J. Persson, and H. Ueba, Science 295, 2055\n(2002).\n\n11\n\nS. Alavi, B. Larade, J. Taylor, H. Guo, and T. Seideman, Chemical Physics 281 (23), 293 (2002); T. Seideman, Journal of Physics-Condensed Matter 15, R521\n(2003); B. N. J. Persson and H. Ueba, Surf. Sci. 502-503, 12 (2002).\n\n12\n\nS.-W. Hla, L. Bartels, G. Meyer, and K.-H. Rieder, Phys. Rev. Lett. 85, 2777\n(2000); G. V. Nazin, X. H. Qiu, and W. Ho, Science 302, 77 (2003); J. R. Hahn and\nW. Ho, Phys. Rev. Lett. 87, 166102 (2001).\n\n13\n\nE. L. Wolf, Principles of electron tunneling spectroscopy. (Oxford University Press,\nNew York, 1985); K. W. Hipps and U. Mazur, Journal of Physical Chemistry 97\n(30), 7803 (1993).\n\n14\n\nH. J. Lee and W. Ho, Science 286, 1719 (1999); J. R. Hahn and W. Ho, Phys. Rev.\nLett. 87, 196102 (2001); L. J. Lauhon and W. Ho, Phys. Rev. Lett. 85, 4566 (2000);\nJ. Gaudioso, J. L. Laudon, and W. Ho, Phys. Rev. Letters 85, 1918 (2000); L. J.\nLauhon and W. Ho, Phys. Rev. B 60 (12), R8525 (1999); J. G. Kushmerick, J.\nLazorcik, C. H. Patterson, R. Shashidhar, D. S. Seferos, and G. C. Bazan, Nano\nLetters 4, 639 (2004); H. J. Lee and W. Ho, Phys. Rev. B 61, R16347 (2000).\n\n15\n\nN. Lorente, M. Persson, L. J. Lauhon, and W. Ho, Phys. Rev. Lett. 86, 2593 (2001).\n\n\f39\n16\n\nJ. R. Hahn, H. J. Lee, and W. Ho, Phys. Rev. Letters 85, 1914 (2000).\n\n17\n\nN. B. Zhitenev, H. Meng, and Z. Bao, Physical Review Letters 88 (22), 226801\n(2002); H. Park, J. Park, A. K. L. Lim, E. H. Anderson, A. P. Alivisatos, and P. L.\nMceuen, Nature 407, 57 (2000).\n\n18\n\nW. Wang, T. Lee, I. Kretzschmar, and M. A. Reed, Nano Letters 4, 643 (2004).\n\n19\n\nR. H. M. Smit, Y. Noat, C. Untiedt, N. D. Lang, M. C. V. Hemert, and J. M. V.\nRuitenbeek, Nature 419, 906 (2002).\n\n20\n\nR. Landauer, Phil. mag. 21, 863 (1970); R. Landauer, IBM J. Res. Dev. 1, 223\n(1957).\n\n21\n\nH. Ness and A. J. Fisher, Eur. Phys. J. D24, 409 (2003); H. Ness and A. J. Fisher,\nChemical Physics 281 (2-3), 279 (2002); H. Ness and A. J. Fisher, Europhysics\nLetters 6, 885 (2002); H. Ness, S. A. Shevlin, and A. J. Fisher, Phys. Rev. B 63,\n125422 (2001); H. Ness and A. J. Fisher, Applied Surface Science 162-163, 613\n(2000); H. Ness and A. J. Fisher, Phys. Rev. Lett. 83 (2), 452 (1999).\n\n22\n\nM. J. Montgomery, J. Hoekstra, T. N. Todorov, and A. P. Sutton, J Phys.: Cond.\nMatter 15, 731 (2003); M. J. Montgomery and T. N. Todorov, J Phys.: Cond. Matter\n15, 8781 (2003); M. J. Montgomery, T. N. Todorov, and A. P. Sutton, J Phys.:\nCond. Matter 14, 5377 (2002).\n\n23\n\nD. Segal, A. Nitzan, W. B. Davis, M. R. Wasilewski, and M. A. Ratner, J. Phys.\nChem. B 104, 3817 (2000); D. Segal, A. Nitzan, M. A. Ratner, and W. B. Davis, J.\nPhys. Chem. 104, 2790 (2000); D. Segal and A. Nitzan, Chem. Phys. 268, 315\n(2001); D. Segal and A. Nitzan, Chem. Phys. 281 (2-3), 235 (2002).\n\n24\n\nE. G. Petrov, Y. R. Zelinskyy, and V. May, J. Phys. Chem. B 106, 3092 (2002); E.\nG. Petrov, V. May, and P. Hanggi, Chem. Phys. 296, 251 (2003).\n\n25\n\nL. V. Keldysh, Sov. Phys. JETP 20, 1018 (1965); L. P. Kadanoff and G. Baym,\nQuantum Statistical Mechanics. Green's Function Methods in Equilibrium and\nNonequilibrium Problems. (Benjamin, Reading, MA., 1962); M. Wagner, Phys.\nRev. B 44 (12), 6104 (1991); S. Datta, Electric transport in Mesoscopic Systems.\n(Cambridge University Press, Cambridge, 1995).\n\n26\n\nA. Troisi, M. A. Ratner, and A. Nitzan, The Journal of Chemical Physics 118 (13),\n6072 (2003).\n\n27\n\nC. Caroli, R. Combescot, D. Lederer, P. Nozieres, and D. Saint-James, J. Phys. C:\nSolid State 5, 21 (1971).\n\n28\n\nS. Datta, J. Phys.: Cond. Matter 2, 8023 (1990); G. Neofotistos, R. Lake, and S.\nDatta, Phys. Rev. B 43, 2242 (1991); R. Lake and S. Datta, Phys. Rev. B 46, 4757\n(1992); R. Lake and S. Datta, Phys. Rev. B 45, 6670 (1992); N. S. Wingreen, K. W.\nJacobsen, and J. W. Wilkins, Phys. Rev. Lett. 61, 1396 (1988).\n\n29\n\nN. Lorente and M. Persson, Phys. Rev. Lett. 85, 2997 (2000).\n\n30\n\nS. Tikhodeev, M. Natario, K. Makoshi, T. Mii, and H. Ueba, Surface Science 493,\n63 (2001).\n\n\f40\n31\n\nT. Mii, S. Tikhodeev, and H. Ueba, Surface Science 502-503, 26 (2002).\n\n32\n\nT. Mii, S. G. Tikhodeev, and H. Ueba, Phys. Rev. B 68, 205406 (2003).\n\n33\n\nB. N. J. Persson, Physica Scripta 38 (2), 282 (1988).\n\n34\n\nA. Baratoff and B. N. J. Persson, Journal of Vacuum Science & Technology A\nVacuum Surfaces & Films 6 (2), 331 (1988).\n\n35\n\nB. N. J. Persson and A. Baratoff, Phys. Rev. Lett. 59 (3), 339 (1987).\n\n36\n\nL. C. Davis, Phys. Rev.B 2, 1714 (1970).\n\n37\n\nA. Bayman, P. Hansma, and W. C. Kaska, Phys. Rev. B 24, 2449 (1981).\n\n38\n\nsee Fig. 1 of Ref. 32.\n\n39\n\nN. Agrait, C. Untiedt, G. Rubio-Bollinger, and S. Vieira, Phys. Rev. Lett. 88,\n216803 (2002).\n\n40\n\nIn Raman scattering vibrational structure analogous to the features discussed earlier\nare observed in the dependence on the frequency of the scattered light, while those\nanalogous to the resonant features described here are observed in the dependence of\nthe scattered light intensity on the incident frequency. By its nature, IETS cannot\nmake this distinction.\n\n41\n\nM. Galperin, M. A. Ratner and A. Nitzan, to be published\n\n42\n\nG. D. Mahan, Many-particle physics, 3 ed. (Plenum press, New York, 2000).\n\n43\n\nH. Haug and A.-P. Jauho, Quantum Kinetics in Transport and Optics of\nSemiconductors. (Springer, Berlin, 1996).\n\n44\n\nN. S. Wingreen and Y. Meir, Phys. Rev. B 49, 11040 (1994).\n\n45\n\nIn reality our primary phonons are molecular vibrational modes whose frequencies\nare larger than the environmental (secondary phonon) Debye frequency and their\nthermal relaxation is caused by non-linear coupling to this environment. Still, Eqs.\n(19) may be assumed to hold, with the parameter gij calculated from the appropriate\nnon-linear theory, see eg. A. Nitzan, S. Mukamel and J. Jortner J. Chem. Phys. 63,\n200-207 (1975)).\n\n46\n\nA. B. Migdal, Sov. Phys. JETP 7, 996 (1958).\n\n47\n\nW. D. Tian, S. Datta, S. H. Hong, R. Reifenberger, J. I. Henderson, and C. P.\nKubiak, J. Chem. Phys. 109 (7), 2874 (1998); S. Datta, W. D. Tian, S. H. Hong, R.\nReifenberger, J. I. Henderson, and C. P. Kubiak, Phys. Rev. Lett. 79 (13), 2530\n(1997).\n\n48\n\nThe failure of the SCBA procedure, which is based on the Migdal theorem, is to be\nexpected when the electron-phonon coupling is large compared to the coupling to\nthe contacts (see e.g. Ref. 49). Such cases can in principle be treated by linkedcluster50 or Pade-approximants49 expansions.\n\n49\n\nS. Ciuchi, F. D. Pasquale, and D. Feinberg, Europhys. Lett. 30, 151 (1995).\n\n50\n\nU. Lundin and R. H. McKenzie, Phys. Rev. B 66, 075303 (2002).\n\n\f41\n51\n\nN. S. Wingreen, K. W. Jacobsen, and J. W. Wilkins, Phys. Rev. B 40, 11834\n(1989).\n\n52\n\nLifetimes of high frequency molecular vibrational modes in low temperature\nenvironemnts are usually considerably longer than a picosecond.\n\n53\n\nY. Meir and N. S. Wingreen, Phys. Rev. Lett. 68, 2512 (1992).\n\n\f"}