{"id": "http://arxiv.org/abs/cond-mat/0310067v1", "guidislink": true, "updated": "2003-10-03T15:10:46Z", "updated_parsed": [2003, 10, 3, 15, 10, 46, 4, 276, 0], "published": "2003-10-03T15:10:46Z", "published_parsed": [2003, 10, 3, 15, 10, 46, 4, 276, 0], "title": "Bose-Einstein Condensation of Helium and Hydrogen inside Bundles of\n  Carbon Nanotubes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0310506%2Ccond-mat%2F0310722%2Ccond-mat%2F0310307%2Ccond-mat%2F0310039%2Ccond-mat%2F0310339%2Ccond-mat%2F0310086%2Ccond-mat%2F0310410%2Ccond-mat%2F0310174%2Ccond-mat%2F0310391%2Ccond-mat%2F0310696%2Ccond-mat%2F0310577%2Ccond-mat%2F0310366%2Ccond-mat%2F0310295%2Ccond-mat%2F0310336%2Ccond-mat%2F0310733%2Ccond-mat%2F0310141%2Ccond-mat%2F0310756%2Ccond-mat%2F0310687%2Ccond-mat%2F0310383%2Ccond-mat%2F0310766%2Ccond-mat%2F0310402%2Ccond-mat%2F0310718%2Ccond-mat%2F0310274%2Ccond-mat%2F0310750%2Ccond-mat%2F0310026%2Ccond-mat%2F0310143%2Ccond-mat%2F0310513%2Ccond-mat%2F0310640%2Ccond-mat%2F0310126%2Ccond-mat%2F0310253%2Ccond-mat%2F0310648%2Ccond-mat%2F0310020%2Ccond-mat%2F0310569%2Ccond-mat%2F0310292%2Ccond-mat%2F0310692%2Ccond-mat%2F0310364%2Ccond-mat%2F0310067%2Ccond-mat%2F0212054%2Ccond-mat%2F0212392%2Ccond-mat%2F0212544%2Ccond-mat%2F0212407%2Ccond-mat%2F0212208%2Ccond-mat%2F0212487%2Ccond-mat%2F0212378%2Ccond-mat%2F0212584%2Ccond-mat%2F0212636%2Ccond-mat%2F0212025%2Ccond-mat%2F0212437%2Ccond-mat%2F0212150%2Ccond-mat%2F0212181%2Ccond-mat%2F0212562%2Ccond-mat%2F0212470%2Ccond-mat%2F0212135%2Ccond-mat%2F0212267%2Ccond-mat%2F0212590%2Ccond-mat%2F0212516%2Ccond-mat%2F0212353%2Ccond-mat%2F0212009%2Ccond-mat%2F0212318%2Ccond-mat%2F0212246%2Ccond-mat%2F0212224%2Ccond-mat%2F0212221%2Ccond-mat%2F0212076%2Ccond-mat%2F0212583%2Ccond-mat%2F0212522%2Ccond-mat%2F0212449%2Ccond-mat%2F0212512%2Ccond-mat%2F0212203%2Ccond-mat%2F0212306%2Ccond-mat%2F0212109%2Ccond-mat%2F0212539%2Ccond-mat%2F0212348%2Ccond-mat%2F0212070%2Ccond-mat%2F0212158%2Ccond-mat%2F0212253%2Ccond-mat%2F0212599%2Ccond-mat%2F0212058%2Ccond-mat%2F0212521%2Ccond-mat%2F0212415%2Ccond-mat%2F0212073%2Ccond-mat%2F0212123%2Ccond-mat%2F0212231%2Ccond-mat%2F0212304%2Ccond-mat%2F0212537%2Ccond-mat%2F0212430%2Ccond-mat%2F0212200%2Ccond-mat%2F0212426%2Ccond-mat%2F0212648%2Ccond-mat%2F0212645%2Ccond-mat%2F0212087%2Ccond-mat%2F0212098%2Ccond-mat%2F0212524%2Ccond-mat%2F0212182%2Ccond-mat%2F0212579%2Ccond-mat%2F0212212%2Ccond-mat%2F0212283%2Ccond-mat%2F0212132%2Ccond-mat%2F0212605%2Ccond-mat%2F0212105%2Ccond-mat%2F0212257%2Ccond-mat%2F0212564&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bose-Einstein Condensation of Helium and Hydrogen inside Bundles of\n  Carbon Nanotubes"}, "summary": "Helium atoms or hydrogen molecules are believed to be strongly bound within\nthe interstitial channels (between three carbon nanotubes) within a bundle of\nmany nanotubes. The effects on adsorption of a nonuniform distribution of tubes\nare evaluated. The energy of a single particle state is the sum of a discrete\ntransverse energy Et (that depends on the radii of neighboring tubes) and a\nquasicontinuous energy Ez of relatively free motion parallel to the axis of the\ntubes. At low temperature, the particles occupy the lowest energy states, the\nfocus of this study. The transverse energy attains a global minimum value\n(Et=Emin) for radii near Rmin=9.95 Ang. for H2 and 8.48 Ang.for He-4. The\ndensity of states N(E) near the lowest energy is found to vary linearly above\nthis threshold value, i.e. N(E) is proportional to (E-Emin). As a result, there\noccurs a Bose-Einstein condensation of the molecules into the channel with the\nlowest transverse energy. The transition is characterized approximately as that\nof a four dimensional gas, neglecting the interactions between the adsorbed\nparticles. The phenomenon is observable, in principle, from a singular heat\ncapacity. The existence of this transition depends on the sample having a\nrelatively broad distribution of radii values that include some near Rmin.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0310506%2Ccond-mat%2F0310722%2Ccond-mat%2F0310307%2Ccond-mat%2F0310039%2Ccond-mat%2F0310339%2Ccond-mat%2F0310086%2Ccond-mat%2F0310410%2Ccond-mat%2F0310174%2Ccond-mat%2F0310391%2Ccond-mat%2F0310696%2Ccond-mat%2F0310577%2Ccond-mat%2F0310366%2Ccond-mat%2F0310295%2Ccond-mat%2F0310336%2Ccond-mat%2F0310733%2Ccond-mat%2F0310141%2Ccond-mat%2F0310756%2Ccond-mat%2F0310687%2Ccond-mat%2F0310383%2Ccond-mat%2F0310766%2Ccond-mat%2F0310402%2Ccond-mat%2F0310718%2Ccond-mat%2F0310274%2Ccond-mat%2F0310750%2Ccond-mat%2F0310026%2Ccond-mat%2F0310143%2Ccond-mat%2F0310513%2Ccond-mat%2F0310640%2Ccond-mat%2F0310126%2Ccond-mat%2F0310253%2Ccond-mat%2F0310648%2Ccond-mat%2F0310020%2Ccond-mat%2F0310569%2Ccond-mat%2F0310292%2Ccond-mat%2F0310692%2Ccond-mat%2F0310364%2Ccond-mat%2F0310067%2Ccond-mat%2F0212054%2Ccond-mat%2F0212392%2Ccond-mat%2F0212544%2Ccond-mat%2F0212407%2Ccond-mat%2F0212208%2Ccond-mat%2F0212487%2Ccond-mat%2F0212378%2Ccond-mat%2F0212584%2Ccond-mat%2F0212636%2Ccond-mat%2F0212025%2Ccond-mat%2F0212437%2Ccond-mat%2F0212150%2Ccond-mat%2F0212181%2Ccond-mat%2F0212562%2Ccond-mat%2F0212470%2Ccond-mat%2F0212135%2Ccond-mat%2F0212267%2Ccond-mat%2F0212590%2Ccond-mat%2F0212516%2Ccond-mat%2F0212353%2Ccond-mat%2F0212009%2Ccond-mat%2F0212318%2Ccond-mat%2F0212246%2Ccond-mat%2F0212224%2Ccond-mat%2F0212221%2Ccond-mat%2F0212076%2Ccond-mat%2F0212583%2Ccond-mat%2F0212522%2Ccond-mat%2F0212449%2Ccond-mat%2F0212512%2Ccond-mat%2F0212203%2Ccond-mat%2F0212306%2Ccond-mat%2F0212109%2Ccond-mat%2F0212539%2Ccond-mat%2F0212348%2Ccond-mat%2F0212070%2Ccond-mat%2F0212158%2Ccond-mat%2F0212253%2Ccond-mat%2F0212599%2Ccond-mat%2F0212058%2Ccond-mat%2F0212521%2Ccond-mat%2F0212415%2Ccond-mat%2F0212073%2Ccond-mat%2F0212123%2Ccond-mat%2F0212231%2Ccond-mat%2F0212304%2Ccond-mat%2F0212537%2Ccond-mat%2F0212430%2Ccond-mat%2F0212200%2Ccond-mat%2F0212426%2Ccond-mat%2F0212648%2Ccond-mat%2F0212645%2Ccond-mat%2F0212087%2Ccond-mat%2F0212098%2Ccond-mat%2F0212524%2Ccond-mat%2F0212182%2Ccond-mat%2F0212579%2Ccond-mat%2F0212212%2Ccond-mat%2F0212283%2Ccond-mat%2F0212132%2Ccond-mat%2F0212605%2Ccond-mat%2F0212105%2Ccond-mat%2F0212257%2Ccond-mat%2F0212564&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Helium atoms or hydrogen molecules are believed to be strongly bound within\nthe interstitial channels (between three carbon nanotubes) within a bundle of\nmany nanotubes. The effects on adsorption of a nonuniform distribution of tubes\nare evaluated. The energy of a single particle state is the sum of a discrete\ntransverse energy Et (that depends on the radii of neighboring tubes) and a\nquasicontinuous energy Ez of relatively free motion parallel to the axis of the\ntubes. At low temperature, the particles occupy the lowest energy states, the\nfocus of this study. The transverse energy attains a global minimum value\n(Et=Emin) for radii near Rmin=9.95 Ang. for H2 and 8.48 Ang.for He-4. The\ndensity of states N(E) near the lowest energy is found to vary linearly above\nthis threshold value, i.e. N(E) is proportional to (E-Emin). As a result, there\noccurs a Bose-Einstein condensation of the molecules into the channel with the\nlowest transverse energy. The transition is characterized approximately as that\nof a four dimensional gas, neglecting the interactions between the adsorbed\nparticles. The phenomenon is observable, in principle, from a singular heat\ncapacity. The existence of this transition depends on the sample having a\nrelatively broad distribution of radii values that include some near Rmin."}, "authors": ["F. Ancilotto", "M. M. Calbi", "S. M. Gatica", "M. W. Cole"], "author_detail": {"name": "M. W. Cole"}, "author": "M. W. Cole", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.70.165422", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0310067v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0310067v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0310067v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0310067v1", "journal_reference": null, "doi": "10.1103/PhysRevB.70.165422", "fulltext": "Bose-Einstein Condensation of Helium and Hydrogen inside\n\narXiv:cond-mat/0310067v1 [cond-mat.mtrl-sci] 3 Oct 2003\n\nBundles of Carbon Nanotubes\nF. Ancilotto1 , M.M. Calbi2 , S.M. Gatica3 and M.W. Cole3\n1\n\nINFM (UdR Padova and DEMOCRITOS National Simulation Center,\n\nTrieste, Italy) and Dipartimento di Fisica \"G. Galilei\", Università di Padova,\nvia Marzolo 8, I-35131 Padova, Italy.\n2\n3\n\nDepartment of Physics, Southern Illinois University, Carbondale, IL 62901-4401\n\nDepartment of Physics, Pennsylvania State University, University Park, PA 16802\n(Dated: October 30, 2018)\n\nAbstract\nHelium atoms or hydrogen molecules are believed to be strongly bound within the interstitial\nchannels (between three carbon nanotubes) within a bundle of many nanotubes. The effects on\nadsorption of a nonuniform distribution of tubes are evaluated. The energy of a single particle\nstate is the sum of a discrete transverse energy Et (that depends on the radii of neighboring tubes)\nand a quasicontinuous energy Ez of relatively free motion parallel to the axis of the tubes. At low\ntemperature, the particles occupy the lowest energy states, the focus of this study. The transverse\nenergy attains a global minimum value (Et = Emin ) for radii near Rmin = 9.95 Å for H2 and 8.48\nÅ for 4 He. The density of states N (E) near the lowest energy is found to vary linearly above this\nthreshold value, i.e. N (E) is proportional to (E − Emin ). As a result, there occurs a Bose-Einstein\ncondensation of the molecules into the channel with the lowest transverse energy. The transition is\ncharacterized approximately as that of a four dimensional gas, neglecting the interactions between\nthe adsorbed particles. The phenomenon is observable, in principle, from a singular heat capacity.\nThe existence of this transition depends on the sample having a relatively broad distribution of\nradii values that include some near Rmin .\n\n1\n\n\fI.\n\nINTRODUCTION\n\nOne of the most persistently interesting topics in condensed matter physics is BoseEinstein condensation (BEC). First postulated [1] on the basis of an idealized model (noninteracting particles), BEC was subsequently argued by London to provide an explanation\nof superfluidity in 4 He, which is a system consisting of relatively strongly interacting atoms\n[2]. The London hypothesis has been confirmed in both detailed calculations and careful\nneutron scattering experiments [3, 4]. More recently, BEC has been observed to occur in\nultracold gases consisting of alkali or H atoms and in systems of excitons at low temperature\nT [5, 6, 7].\nA logical candidate for the occurrence of BEC is para-H2 , which is the boson equilibrium\nform of hydrogen at low T . The apparent nonexistence of BEC for bulk H2 is attributed to\nits crystallization below 14 K, which preempts BEC. Some three decades ago, Ginzburg and\nSobyanin proposed a search for BEC and superfluidity of H2 in confining geometries (for\nwhich crystallization occurs at a lower temperature, if at all) [8]. This suggestion stimulated\na number of searches involving both theory and experiments [9, 10, 11, 12, 13, 14, 15, 16].\nThere has been at least one assertion of successful observation of BEC, involving the lack of\ndamping of rotational motion of an impurity surrounded by hydrogen fluid within a small\ncluster [9, 14].\nIn this paper, we describe a different geometry that is predicted to allow BEC to occur\n[17, 18]. This host material is an ensemble of carbon nanotube bundles. A crucial role\nis played in this phenomenon by the presence of nonuniformity. In particular, we assume\nthat there exists a fairly broad distribution of nanotube radii present in the experimental\nsample. We focus our calculations on the spectrum of particles (either H2 or 4 He) confined\nwithin interstitial channels (ICs) formed by groups of three nanotubes. It has been argued\nthat both of these species, if allowed access to such channels, are more strongly bound\nthere than on the surface of graphite, the most strongly physisorbing planar surface [19].\nThere is ambiguous experimental evidence concerning the relative binding energy of these\nspecies in the IC and in the grooves on the outside surface of the bundle [20, 21, 22, 23, 24].\nWe interpret the very large isotope effect seen in isosteric heat data of Wilson et al [22]\nto indicate particle localization within the ICs for their sample. The specific behavior is\nevidently sample- dependent, just as our calculations are very sensitive to the assumptions\n2\n\n\fthat we make.\nMuch recent research has been devoted to hydrogen within nanotubes bundles, partly due\nto the exciting prospects of technologies related to hydrogen storage and isotope separation\n[25, 26, 27, 28, 29]. The vast majority of the theoretical research to date (including that\nof our group) has assumed a monodisperse distribution of tubes. The present study was\nstimulated by recent results of Shi and Johnson [30], who showed that the distribution of\ntube sizes present in actual samples leads to predictions that are quite different from those\nbased on the monodisperse models, in better agreement with experimental data than the\nnaive models' predictions.\nThe outline of this paper is the following. Section II describes our calculations of the\nenergy spectra of 4 He and H2 gases within ICs. Section III employs these results to compute\na set of predictions related to BEC that are testable in principle. Section IV presents a\nfurther discussion of the model and draws conclusions.\n\nII.\n\nENERGY SPECTRA AND DENSITY OF STATES OF ADSORBED GASES\n\nWe focus here on those states having the lowest energy since they are the most important\nfor the BEC phenomenon; higher energy behavior can be explored with the same approach\nbut minor changes in the analysis are required. The energy of a particle confined within an\nIC is evaluated with the Schrodinger equation. Assuming that the particular IC is perfectly\nstraight, this equation is separable; then the total energy is given by the relation:\nEn (p) = Entrans + E long (p)\n\n(1)\n\np2\n(2)\n2m\nHere, the first term is the n-th eigenvalue of the Schrodinger equation describing motion\nE long (p) =\n\ntransverse to the axis of the IC and the second term is the quasicontinuous kinetic energy of\nmotion parallel to the axis. We assume for simplicity that the longitudinal kinetic energy is\ndetermined by the free particle mass; if the potential were corrugated the band mass should\nbe used instead of m to characterize the low energy states [31, 32]. Such a substitution\nwould lead to a straightforward change in the numerical and analytical results below.\n3\n\n\fIn the present circumstance, the transverse eigenvalues are separated by energies (of order\n100 K) that are much larger than relevant temperature scales [33]. Hence, we need consider\nonly the lowest eigenvalue E1trans of transverse motion. We denote this quantity Et (R), where\nthe vector R = (R1 , R2 , R3 ) has components equal to the radii of the tubes surrounding the\nIC. We refer to the domain of possible ICs as R space; a given IC is represented by one\npoint in this space while a sample with many ICs is described by a cloud of points in this\nspace. The single particle spectrum is now specified by the relation\n\nE(R, p) = Et (R) +\n\np2\n2m\n\n(3)\n\nHere, Et (R) is computed following the procedure of Stan et.al.[34]. To get a sufficiently\naccurate dependence of Et on R, one must include anisotropic and anharmonic contributions\nto the potential in the IC. We note that alternative parametrizations of the potential have\nbeen proposed. Table 1 presents one such alternative result for Et . The qualitative behavior\npresented in the remainder of this paper is the same for the case of that alternative potential.\nOf considerable interest is the density of states h(E, R) for a single IC. For a specific\nset of adjacent tubes (R), this function is given by a sum over all momenta, which may be\nreplaced by an integral:\nh(E, R) =\n\nX\np\n\nδ[E − E(R, p)] =\n\n1\nL m 1/2\n( )\nΘ[E − Et (R)]\nπh̄ 2\n(E − Et (R))1/2\n\n(4)\n\nHere L is the length of the channel and the usual procedure for quantizing the 1D motion\nhas been followed. The inverse square root dependence on the energy above threshold is\ncharacteristic of 1D motion. The last factor involves the Heaviside step function Θ(x), which\nis unity here for E > Et (R) and zero otherwise.\nNow let us consider an ensemble of nanotubes. The lowest energy states (those dominating the low temperature behavior) are concentrated near the minimum of the function\nEt (R). As might be expected, the global minimum of Et (R) is found for the symmetric case,\n{Ri } = Rmin . We define the vector specifying this IC as Rmin = Rmin (1, 1, 1) and Emin as\nthe corresponding energy. The numerical results for these quantities appear in Table 1.\nThe behavior of the function Et (R) near this minimum is remarkable. If one considers\nonly symmetric ICs (bounded by tubes of identical radii), the energy varies rapidly as a\nfunction of the difference |R − Rmin |. However, the spectrum of the very lowest energy\n4\n\n\fstates is dominated by asymmetric ICs for which one of the radii equals Rmin and the two\nothers differ from Rmin by equal, but opposite amounts, e.g. R = Rmin (1, 1 + x, 1 − x),\nwhere x ≪ 1. The energy varies extremely slowly with x in such a case. This is depicted for\nH2 in Fig. 1, which shows the energy variation in a plane within R space that contains both\nthis variable x line and the diagonal (1, 1, 1) line. (Analogous behavior occurs for the case of\n4\n\nHe). One observes in the figure a very narrow valley of low-lying states of variable x, along\n\nthe (0, 1, −1) direction, where the origin is shifted to Rmin . Similar small gradient behavior\nof Et (R) is found along equivalent permutations of this direction. Note that the higher\nenergy contours are extended, nearly straight lines perpendicular to the diagonal. These\nlatter contours imply an energy dependence of the density of states that is qualitatively\ndifferent from that based on contours of lower energy (near the valleys).\nWe next evaluate the transverse density of states for a given experimental sample of\ntubes. We denote by ν(R) the density distribution of ICs, defined so that ν(R)dR is the\nnumber of ICs present in the sample within a volume dR in R space. In this paper, we\nfocus on low energy behavior corresponding to such close proximity to Rmin that we may\nreplace ν(R) by ν(Rmin ) ; future studies will address more general situations for which\nthat approximation is not adequate. In the following discussion, we assume that ν(R) is a\nsufficiently broad distribution that ICs near this minimum exist in sufficient numbers to treat\nadsorption statistically. Moreover, we assume that the set of tube sizes forms a continuum.\nThe former assumption is well justified in experimental samples produced to date involving\nlarge numbers of tubes, which typically have a dispersion in radius values of order 20%\n[35, 36]. The latter (continuum) assumption is justified by the following argument. Near\nradius 1 nm, there are many values of the chiral indices that yield quite similar radii; the\nmean spacing between successive values of the radius is quite small, 0.002 nm. In addition,\nthe ICs experience small perturbations due to their environment; in particular, the ICs at\nthe center of a bundle are expected to be compressed relative to those near the perimeter. A\nmodel calculation (unpublished) yields an expression for the difference δ between the tubetube separation in an infinite rope and that (R1 ) of an isolated nanotube pair; apart from a\nconstant of order one, the result is δ = [Cλ2 ]/[kR16 ], where C is the van der Waals-London\nintercarbon interaction coefficient (C ∼ 20 eV-Å6 ), λ is the 1D density of carbon atoms in\n\na nanotube (λ ∼15Å−1 ), R1 ∼17 Å is the spacing between tube centers and k=10−3 eV/Å3\n\nis the force constant per unit length associated with neighboring tubes' interactions [37].\n5\n\n\fThe result, δ ∼0.15Å, represents a nearly 5% compression of the lattice constant of ropium\nrelative to the separation of an isolated pair. This shift in separation is consistent with\nestimates of the analogous shift in breathing mode frequency [38]. On the basis of these\narguments, the assumption of a continuum of possible radii appears appropriate.\nThe transverse density of states g(E) for a given sample of tubes is expressed by the\nrelation\ng(E) =\n\nZ\n\ndR ν(R) δ[E − Et (R)]\n\n(5)\n\nThe total density of states N(E) is found by summing over all states of the ICs present in\nthe sample:\n\nN(E) =\n\nZ\n\ndR\n\nL m 1/2\n( )\nN(E) =\nπh̄ 2\n\nX\np\n\nZ\n\nδ[E − E(R, p)] ν(R)\n\nE\n\nEmin\n\ndEt g(Et ) [E − Et ]−1/2\n\n(6)\n\n(7)\n\nNote that in the special case of a perfectly uniform distribution of NIC identical ICs, ν(R) =\nNIC δ(R − R0 ) , yielding g(E) = NIC δ[E − Et (R0 )]; then N(E) is precisely NIC times the\nsingle tubes density of states, h(E, R0 ), given in Eq. 4 above, as expected.\nFigs. 2 and 3 present the transverse densities of states g(Et ) for He and H2 , respectively,\ncomputed numerically from a distribution of 6003 tubes with radius values spread uniformly\nover the interval 8.5 Å to 11.5 Å. In both cases, the behavior of g(E) at low energy is\ncharacterized by a power law dependence on energy above threshold : glow (E) ∼ (E −\n\nEmin )1/2 . At higher energy, there is a decrease of g(E) with energy, fit well by the expression\n\nghigh (E) ∼ (E − Emin )−1/2 . The initial behavior is explained by the following argument.\nAt low energy, the density of states is obtained by counting the number of ICs whose\nenergy Et (R) lies in an interval between E and E + dE. Assume for simplicity that the\nisoenergy surfaces are spherical surfaces centered about the point R = Rmin (i.e. E −Emin =\n\n(k/2)|R − Rmin |2 ). Then g(E) is obtained from the number of points in the shell between\n\nspherical surfaces (corresponding to E and E + dE) centered at Rmin . The result of this\nsimple model is then\n\n6\n\n\fglow (E) = ν(Rmin ) 4π (\n\n2 1/2\n) (E − Emin )1/2\nk3\n\n(8)\n\nThis dependence on the square root of the energy turns out to be valid even in the extreme\n3\nanisotropic case of interest here [39]. The result then is that k 3 is replaced by kanis\n= kx kt2 ,\n\nwhere x denotes the (1,1,1) direction in R space and t denotes the two directions transverse\nto that.\nNote that this square root energy dependence of glow (E) coincides with that of the density\n√\nof states of a 3D gas. The higher energy behavior (1/ E) of ghigh (E) is quite different. The\nrelevant high energy regime in Fig. 1 is that where the energy surfaces in R space are\nperpendicular to the (1, 1, 1) diagonal. Since this variation is essentially a 1D dependence,\nthe resulting high energy form of ghigh (E) is that of a 1D system, as in Eq. 4 above; this gives\nrise to a behavior ghigh (E) ∼ (E − Emin )−1/2 (as is observed in Figs. 2 and 3). We remark\nthat this energy-dependent variation in effective dimensionality has analogs in electronic\nband structures, where wave vector replaces the R variable as the source of the unusual\ndependence. [40]\nFigs. 2 and 3, lower panels, depict the total densities of states N(E) derived from Eq.\n7. In view of the power law forms (e.g. Eq. 8) of g(E), we expect power laws for N(E) in\nappropriate regimes of E. For example, the very lowest energy behavior is determined by\nthe integral\n\nZ\n\nE\nEmin\n\ndEt (Et − Emin )1/2 (E − Et )−1/2 = (E − Emin )\n\nN(E) = ν(Rmin )\n\nZ\n\n0\n\n1\n\ndy [y/(1 − y)]1/2 =\n\nLπ m 1/2\n( 3 ) (E − Emin )\nh̄ kanis\n\nπ\n(E − Emin ) (9)\n4\n\n(10)\n\nNote that the prefactor of the energy difference (which we call a) is proportional to the\nvolume of the nanotubes, so that N(E)/a is an intensive variable. The linear dependence\non energy above threshold (E − Emin ) is the behavior characteristic of a 4D gas. This\ninitially unexpected result is a logical consequence of convoluting a transverse spectrum\ncharacteristic of a 3D system (eq. 8) with the 1D longitudinal degree of freedom. Similarly,\nthe behavior at higher energy is obtained by convoluting an inverse square root dependence\n7\n\n\fof ghigh (E) with the 1D inverse square root dependence. Then the high energy result is\nthat N(E) is independent of energy, behavior characteristic of a 2D density of states. These\nanalytic results for the spectra are consistent with the numerical results seen in Figs. 2 and\n3; that is, the low energy density of states is proportional to (E − Emin ) while the high\nenergy behavior is independent of energy. By the word \"high\", we mean energies reasonably\nclose to Emin (say E − Emin ≈20mK) but not the absolutely lowest energies.\nTo summarize this section, we note that unexpected behavior of N(E) emerges from a\nsimple model. The low energy spectrum of the nonuniform system is qualitatively different\nfrom the spectrum obtained when heterogeneity is ignored. The latter corresponds to 1D\nphysics, i.e. N(E) proportional to (E − Emin )−1/2 . With heterogeneity, instead, we find that\nN(E) exhibits a 4D form at very low energy and a 2D form at higher energy.\n\nIII.\n\nPREDICTION OF BEC\n\nIn this section we explore the consequences of the anomalous densities of states for thermal\nproperties of these systems. In so doing, we assume that the adsorbed gas can equilibrate.\nThis entails the rearrangement of the particles as the temperature T is lowered by moving\nfrom ICs that have high transverse energies to those with lower energies. Thus, we assume a\ncombination of sufficient particle mobility and sufficiently patient experimentalists that the\nassumption is valid. In the extreme opposite limit of negligible transport of particles the\nthermal behavior is that of isolated and independent 1D systems. The difference between\nthese behaviors is dramatic.\nAt very low density, one can ignore the effects of both interparticle interactions and\nquantum statistics. Then, the specific heat C(T ) = dU/dT at fixed number (Np ) of particles\ncan be computed from the classical Boltzmann expression for the mean energy U:\nU(T )\ndE E N(E) exp[−βE]\n(\n)classical = R\nNp\ndE N(E)] exp[−βE]\nR\n\n(11)\n\nHere β −1 = kB T . One can insert possible power law forms N(E) ∼ E (d/2−1) corresponding\nto a gas in d dimensions and derive the familiar relation\n\n(\n\nd\nC\n)classical =\nNp kB\n2\n\n8\n\n(12)\n\n\fFig. 4 presents the resulting classical behavior for the systems of He and H2 in nanotubes.\nOne observes that the low T regime does correspond to the expected 4D gas behavior,\nC/(Np kB ) = 2 while the high T regime exhibits 2D gas behavior, C/(Np kB ) = 1. The initial\nrise above 2 at very low T is explained by a small upward deviation from linearity found\nin N(E) at low E. That is, if N(E) at low E is proportional to E(1 + E/E1 ), where E1\nis some constant, then [C/(Np kB )]classical = 2[1 + 2/(βE1 )]. The crossover between the 4D\nand 2D regimes is gradual, beginning at a few mK and complete by 20 mK; the latter value\ncorresponds to the energy above which N(E) is virtually identical to the 2D form.\nAt higher density, one must consider the effects of interactions and quantum statistics.\nIn the present treatment we ignore interparticle interactions, except for some comments in\nthe next section. While this is a common assumption, usually adopted for simplicity, there\nexists some justification for it in the present instance because of electrodynamic screening\nof the van der Waals interaction by the surrounding medium; there are additional elastic\nscreening effects that have yet to be studied [41]. We do not know the resulting effective\ninteraction well enough to characterize it. In contrast, the effects of quantum statistics are\neasily evaluated by the standard procedures. In particular, the assumed constraint of fixed\nparticle number yields an implicit relation for the chemical potential μ, which depends on\nT , from which one may derive the energy:\n\nNp =\n\nZ\n\ndE n(E, T )\n\n(13)\n\nU(T ) =\n\nZ\n\ndE E n(E, T )\n\n(14)\n\nn(E, T ) = N(E) (exp[β(E − μ)] − 1)−1\n\n(15)\n\n(As usual, the classical equations 11 and 12 are obtained in the limit when the fugacity\nZ = exp(βμ) ≪ 1). From U(T ), one may compute C(T ). In evaluating these formulae,\none encounters a phenomenon that is well known to occur in 3D bose gases: BEC. This\ntransition is derived here in the usual way, by evaluating the implication for the variable\nμ (at fixed Np ) as T is lowered: upon decreasing T , μ increases up to the point where it\n9\n\n\freaches its highest possible value μ = Emin . Thus, the BEC condition for the transition\ntemperature Tc = (kB βc )−1 is\nNp =\n\nZ\n\ndE N(E) (exp[βc (E − Emin )] − 1)−1\n\n(16)\n\nSince μ cannot exceed Emin , as T falls below Tc (given implicitly by this relation), there\nensues a division into two groups of particles- the Nexcited particles accounted for by the\nintegral over excited states (E > Emin ) and the remaining particles having E = Emin that\ncomprise the bose condensate, Ncond :\nNcond = Np − Nexcited (T < Tc )\nNexcited =\n\nZ\n\ndE N(E)(exp[β(E − Emin )] − 1)−1\n\n(17)\n\n(18)\n\nThe results of these calculations appear in Figs. 5 to 8. Fig. 5 depicts the dependence of Z\non the relative temperature T /Tc for two different densities. Fig. 6 displays the dependence\non T of the condensate fraction f (T ) = Ncond /Np . Fig. 7 shows the function C(T ), which\nexhibits singular behavior at the transition. Finally, Fig. 8 shows the dependence of Tc on\nNp . Note that the transition temperature falls within the mK range studied in many low\ntemperature laboratories, so experimental observation of this transition is feasible.\nIn the preceding three figures, comparison is made with results obtained for a purely 4D\nbose gas defined to have the same initial slope of the density of states as the real system.\nThat ideal system satisfies N(E) = aE, for all E > 0, with the analysis presented in the\nAppendix. (For the real system, the a coefficient is the prefactor of the energy term in Eq.\n10). The key results for the 4D system are\nf4D (T ) = 1 − (\nC4D (T ) =\n\nT\nTc,4D\n\n)2\n\n36ζ(3) T 2\n(\n) , T < Tc,4D\nπ 2 Tc,4D\n\nTc,4D = (\n\n6Np 1/2 1\n)\na\nπkB\n\n10\n\n(19)\n\n(20)\n\n(21)\n\n\fHere ζ(3) = 1.202 is a Riemann zeta function. The T 2 dependences of f (T ) and C(T )\nare exhibited by the \"real\" system at low T , as seen in the figures. At the very lowest\ntemperatures, only the lowest energy states play a role; since N(E) is the same for the ideal\nsystem in this region, the behaviors coincide. The transition temperature is higher for the\nreal system than for the ideal one because at high E, N(E) is lower in the real case than in\nthe ideal case, implying that (for the same value of Np ) μ reaches its transition value Emin\nat a higher value of Tc .\nSince the ground state energy of the noninteracting classical system coincides with that\nof the noninteracting quantum system, as does the energy at very high T , it follows that the\nintegral of the two heat capacities is the same. At any particular T , of course, the values of\nC are very different. In particular, the quantum system manifests the reduced C at low T\nexpected in this bose gas case. The quantum system exhibits a much larger value of C in\nthe vicinity of Tc , which is dominated by a large rate of excitation out of the condensate;\nsee Fig. 7.\nOne interesting question is this: how are the particles distributed in energy as a function\nof T . To address this, we present in Fig. 9 the occupied energy distribution function n(E, T )\nat various temperatures. One observes the increasing relative occupation of low energy states\nwith decreasing T ; for T > Tc , their sum is just Np , the total number present. At Tc there\noccurs a discontinuous jump in the occupation of the lowest energy states accompanying the\nBEC transition. Below Tc , the number Nexcited of uncondensed particles decreases, vanishing\nat T = 0, when all of the particles settle into the condensate.\nOur prediction of BEC in this anisotropic system raises a question: what is the relationship between the transition condition and that of more familiar homogeneus problems, e.g.\nthe 3D Bose gas and the Kosterlitz-Thouless transition of a superfluid film? In the latter\nexamples, the relevant criterion is if the form ρλd ∼ 1, where ρ is the number density, d the\n\ndimensionality and λ = (2πβh̄2 /m)1/2 is the de Broglie thermal wavelength. We present now\na heuristic argument that is consistent with this homogeneus relation and yields a good estimate of the transition temperature for the present BEC problem. The argument estimates\nTc by analyzing the condition for quantum degeneracy; the number of particles Np becomes\ncomparable to the number of states Nstates (Tc ) lying within kB Tc of the ground state. The\nnumber of states within that interval is essentially the product of the number of states of\nlongitudinal motion within that range and the number of states of transverse motion within\n11\n\n\fthat range:\n\nNstates (T ) ∼ Nk (T ) N⊥ (T )\n∼ (\n\nν\n(mkB T )1/2\n)(\n)\nh̄/L\n(βkanis )3/2\n\nThe factor Nk is the ratio of the thermal momentum in the z direction to the spacing\nbetween discrete states. The factor N⊥ is derived from a thermal spread of states in R space\n[δR ∼ (βkanis )−1/2 ] and the corresponding number of states in the experimental sample,\n\nN⊥ ∼ νδR3 . Setting Np = Nstates (Tc ) yields our estimate of the BEC transition condition:\nNp ∼\n\nLν m1/2\n3/2\nh̄β 2 kanis\n\n(22)\n\nApart from numerical factors, this result coincides with the combination of Eqs. 10 and 21.\nNote that this last equation can be rewritten in the form ρ∗ λ4 ∼ 1 with ρ∗ = Np /(L l3 )\nwhere l = ν 1/3 h̄/(m kanis )1/2 is a characteristic length defined by the energetic parameters\nand the distribution of radii.\n\nIV.\n\nSUMMARY AND DISCUSSION\n\nIn this paper we describe a conceptually simple system that turns out to exhibit remarkable behavior. The focus of the study is the lowest-lying states of a system of hydrogen\nor helium moving within a collection of nanotubes having many ICs. Our analysis yields a\ndensity of states N(E) that fulfills the requirement of BEC (i.e. the maximum integrated\noccupation number is finite). Equally interesting, perhaps, is the finding that the calculated properties at low T are characteristic of a 4D gas in free space. Since (to the best of\nour knowledge) no 4D gas has been observed previously, the predicted low T and critical\nbehaviors of this system are particularly interesting.\nA number of theoretical issues need to be discussed. First, one must ask whether the\nideal gas assumption is valid; indeed, our group has previously explored the vapor-liquid\ntransition of these gases using quasi-1D models of perfect ICs [42]. A concern is therefore\nthat such condensation in a somewhat disordered system would either preempt the BEC or\nalter the nature of the BEC, as is the situation with 3D superfluid 4 He. However, it may\n\n12\n\n\fwell be that disorder reduces the temperature of the hypothetical condensation transition\nbelow that of the BEC transition, so that two separate transitions occur.\nA related question is the role of screening by the medium of the interparticle interaction.\nOn the bare surface of graphite, experimental and theoretical evidence has indicated that the\nwell-depth is reduced by some 10 to 20% [43]. Intuition and some calculations [41] suggest\nthat the attraction would be reduced by a much greater factor for gases within a nanotubes\narray. That is consistent with the neglect of these interactions in the present paper.\nThe requirements for observation of this phenomenon in the laboratory are not trivial to\nsatisfy. A particularly serious concern is that equilibrium is difficult to achieve. It requires\nparticles to diffuse out of one IC and into another as T changes. The slow equilibration\nis a potentially fatal problem that is difficult to assess; experimental diffusion data would\nbe very helpful in this regard.[44, 45] We note that one need not imagine that particles\nare required to move macroscopic distances; one can employ tubes of quite finite length in\norder to accelerate the process of equilibration. Evidently, one should not underestimate\nthis problem, which is an important concern in much broader contexts involving nanotubes,\nsuch as gas storage and isotope separation.\nThe problem at hand raises the venerable question of the relation between BEC and\nsuperfluidity (SF). [46] We know that BEC and SF appear simultaneously at the lambda\ntransition of 4 He [3, 4]. However, the Kosterlitz-Thouless transition of 2D films is one\ninvolving SF without BEC [47]. Moreover, the 3D ideal bose gas exhibits BEC without\nSF, since the Landau velocity criterion is not satisfied. The latter says that the threshold\nvelocity for superflow is the minimum of the ratio of the excitation energy to the momentum\n[48]. Our unusual nanotubes-hosted BEC state would also fail this test, implying that no\nsuperflow is possible. Another aspect of SF is quantized circulation, which is impossible in\nthis environment. Thus, we think that SF is unlikely to accompany the transition described\nabove. If, however, one were to include weak interparticle interactions, SF could occur.\nThe ideal nanotube radii for the lowest energy states fall in the range 0.8 to 1 nm, which is\nan advantageous size because typical samples contain many such tubes. If, for example, only\nsmaller tubes are present in a particular sample, one would have to explore the behavior\nwithout all of the simplifying mathematics employed here. We have yet to tackle that\nproblem in general, but do note some interesting results found in one case. Suppose for\nsimplicity that the transverse density of states for a given sample (consisting of NIC ICs)\n13\n\n\fhas a form (that is quantitatively wrong but qualitatively reasonable in that it consists of a\nspread of transverse energies) given by the \"uniform barrier\" function:\n\ng(Et ) =\n\nNIC\n, E< < Et < E>\n(E> − E< )\n\ng(Et ) = 0, otherwise\n\n(23)\n(24)\n\nThe result in this case (from Eq. 7) is\n\nN(E) =\n\nL m 1/2\n2NIC\n( ) ((E − E< )1/2 Θ[E − E< ] − (E − E> )1/2 Θ[E − E> ])\n(E> − E< ) πh̄ 2\n\n(25)\n\nThis expression yields the 1D limiting case of Eq. 4 when the barrier width (E> − E< ) falls\nto zero. In the case of nonzero width, this expression yields 3D behavior for N(E) at low\nE and 1D behavior at high E. The reason for the 3D limit is that the constant transverse\ndensity of states in the finite uniform barrier model mimics the constant density of states of\na 2D gas. In this model, one derives a BEC transition from this form of N(E), with thermal\nbehavior quite different from that described elsewhere in this paper, i.e., when the lowest\npossible transverse energies (near Emin ) play the dominant role in determining the behavior.\nThe transition temperature of a system of Np molecules, obtained for the uniform barrier\nmodel with the conventional 3D theory, satisfies\n(kB Tc )3 =\n\n2π Np (E> − E< )h̄ 2\n(\n)\nm LNIC ζ(3/2)\n\n(26)\n\nThis proportionality of Tc to Np2/3 is characteristic of 3D behavior, in contrast with the\n4D proportionality to Np1/2 in Eq. 21.\nOne might ask whether similar BEC phenomena occur in a related environment, the\ngroove between two nanotubes (e.g. at the external surface of a bundle). Adsorption in this\nregion has been much studied in theory and experiments [49]. We have therefore investigated\nthe consequence of heterogeneity for that problem, with interesting results. One finding is\nthat the symmetric situation (two identical radii) provides a local maximum (in 2D R space)\nof the transverse energy. Hence, the methodology and results of the present paper are not\napplicable, for the most part. The one related result is that there occurs in the groove case\nan anomalous signature of inhomogeneous broadening in the excitation spectrum. This is\n\n14\n\n\fqualitatively analogous to the behavior of N(E) here, except that spectroscopy is the tool\nof choice for its investigation.[17]\nIn closing, we emphasize an intriguing fact: this transition is a consequence of the nonuniformity of the ICs within experimental samples. A perfectly uniform set of ICs would exhibit\n1D physical properties instead of the transition described here. Such a remarkable consequence of heterogeneity has precedents in other physical systems, of which the spin glass\nphenomenon is a well-known example [50, 51, 52].\nWe are grateful to Carlo Carraro, Vincent Crespi, Allan Griffin, Susana Hernández, Paul\nLammert, Ari Mizel, Aldo Migone, Paul Sokol and Flavio Toigo for helpful discussions.\nThis research has been supported by the National Science Foundation. F.A. acknowledges\nfunding from MIUR-COFIN 2001.\n\nAPPENDIX: 4D IDEAL BOSE GAS\n\nWe consider an ideal bose gas in four dimensions whose density of states N(E) satisfies\n\nN(E) = a E (E > 0)\n\n(A.1)\n\nFor this system, we evaluate the number of particles, energy and specific heat in the usual\nway, using Eqs. 13-15. Straightforward calculations yield\nNp = a g2 (Z) (kB T )2 + Ncond\n\n(A.2)\n\nwhere Ncond is the number of bose condensed particles, and\nU = 2 a g3 (Z) (kB T )3 .\n\n(A.3)\n\nHere the functions g2 and g3 are second and third \"Bose Einstein integrals\",\n1\ngn (Z) =\nΓ(n)\n\nZ\n\n0\n\n∞\n\nxn−1 dx\n.\nZ −1 ex − 1\n\n(A.4)\n\nThe fugacity Z(T ) is determine from Eq. A.2. Moreover, from this equation we obtain\nthe critical temperature Tc for a given number of particles Np , given that the maximum\nvalue of Z is 1 and g2 (Z) is a monotonically increasing function,\n\n15\n\n\fkB Tc =\n\ns\n\nNp\nζ(2)a\n\n(A.5)\n\nFrom Eqs. A.5 and A.2 the condensate fraction results,\nf=\n\nT\nNcond\n= 1 − ( )2 .\nNp\nTc\n\n(A.6)\n\nNow we evaluate the specific heat. To do so we have to be aware that the fugacity depends\non the temperature only for T > Tc while it is equal to 1 for T ≤ Tc . Then we obtain\nCN\ng3 (Z)\ng2 (Z)\n=6\n−4\n(T ≥ Tc )\nNp kB\ng2 (Z)\ng1 (Z)\n=6\n\nζ(3) T 2\n( ) (T ≤ Tc )\nζ(2) Tc\n\n(A.7)\n(A.8)\n\nNote that CN is a continuous function of T, with its value at the critical temperature\nCv (Tc ) = 4.4Np kB .\nIn the these derivations we have used some properties of the functions gn (Z),\ngn (1) = ζ(n)\n\n(A.9)\n\nZgn′ (Z) = gn−1 (Z).\n\n(A.10)\n\nand\n\nThese, together with equation A.2, give the following relationship,\n2\n∂g2 (Z)\n= − g2 (Z)\n∂T\nT\n\n16\n\n(A.11)\n\n\fσ (Å) ǫ (K) Rmin (Å) Emin (K)\nH2\n\n1\n\n2.97 42.8\n\n8.75\n\n-1159.2\n\nH2\n\n2\n\n3.23 32.19\n\n9.95\n\n-1052.4\n\n4 He 3\n\n2.74 16.2\n\n7.19\n\n-353.6\n\n4 He 2\n\n2.98 16.9\n\n8.48\n\n-456.9\n\nTABLE I: Numerical values of Emin and Rmin , defined in the text. The parameters of the potential\nused in each case are from Refs.\n\n[1] S. G.\nU.\n\nP.,\n\nBrush,\n1983);\n\nStatistical\nSee\n\n1\n\n[53],\n\n2\n\n[54] and\n\nphysics\n\npopular\n\nand\n\nlecture\n\n3\n\n[34]\n\nthe\non\n\natomic\nBEC\n\nby\n\ntheory\nT.J.\n\nof\n\nmatter\n\nGreytak\n\nat\n\n(Princeton\nthis\n\nsite:\n\nhttp://vmsstreamer1.fnal.gov/VMS site 02/Lectures/NOS2002/Greytak/vf001.htm.\n[2] F. London, Nature 141, 643 (1938).\n[3] R.T. Azuah, W.G. Stirling,H.R. Glyde, M. Boninsegni, P.E. Sokol, S.M. Bennington, Phys.\nRev. B56 ,14620 (1997).\n[4] D.M. Ceperley, Rev. Mod. Phys. 67, 279 (1995).\n[5] E.A. Cornell, C.E. Wieman, Nobel Lectures in Physics 2001, Rev. Mod. Phys., 74 875 (2002).\n[6] T. J.Greytak, D. Kleppner, D.G.Fried, T.C.Killian, L.Willmann, D.Landhuis and S.C.Moss,\nPhysica B 280, 20 (2000).\n[7] S. A. Moskalenko and D. W. Snoke, Bose-Einstein Condensation of Excitons and Biexcitons\nand Coherent Nonlinear Optics with Excitons (Cambridge U.P., 2000).\n[8] V. Ginzburg and A. Sobyanin, JETP Lett. 15, 242 (1972).\n[9] S.G Grebenev, B. Sartakov, J. P. Toennies and A. F. Vilesov, Science 289, 1532 (2000).\n[10] A.Griffin, D.W.Snoke and S. Stringari, Bose-Einstein Condensation (Cambridge U.P., 1995).\n[11] See especially the introductory article by D. W. Snoke and G. Baym in Ref. 10.\n[12] M.C.Gordillo and D. M. Ceperley, Phys. Rev. Lett.79, 3010 (1997).\n[13] M.C.Gordillo and D. M. Ceperley, Phys. Rev. B 65, 174527 (2002).\n[14] Y. Kwon and K. B. Whaley, Phys. Rev. Lett. 89, 273401 (2002).\n[15] H.J. Maris, G. M. Seidel and T. E. Huber, J. Low Temp. Phys. 51, 471 (1983); H.J. Maris,\nG.M. Seidel, F.I.B. Williams, Phys. Rev. B 36, 6799 (1987).\n\n17\n\n\f[16] O.E. Vilches, J Low Temp. Phys. 89, 267 (1992).\n[17] F.Ancilotto, M.M. Calbi, M.W. Cole, S.M. Gatica and E.S. Hernández, to appear in Israel J.\nChem.; http://lanl.arXiv.org/abs/cond- mat/0307748.\n[18] F. Ancilotto, M. M. Calbi, S. M. Gatica and M. W. Cole, submitted to Phys. Rev. Lett.,\nhttp//lanl.arXiv.org/abs/cond-mat/030645019.\n[19] G. Vidali, G. Ihm, H. Y. Kim and M. W. Cole, Surf. Sci. Rep. 12, 133 (1991).\n[20] M. Muris, N. Dupont-Pavlovsky, M. Bienfait, and P. Zeppenfeld, Surf. Sci. 492, 67 (2001);\nJ. C. Lasjaunias, K. Biljakovic, J. L. Sauvajol and P. Monceau, Phys. Rev. Lett. 91 , 025901\n(2003).\n[21] A. D. Migone and S. Talapatra,Gas Adsorption on Carbon Nanotubes\" in the Encyclopedia\nof Nanoscience and Nanotechnology, published by American Scientific Publishers, editor H.\nS. Nalwa; Talapatra S, Rawat DS, Migone AD, J. of Nanoscience and Nanotechnology 2,\n467 (2002); T. Wilson, O.E. Vilches, Phys. B 329, 278 (2003); M. Muris, M. Bienfait, P.\nZeppenfeld, N. Dupont-Pavlovsky, M. Johnson, O.E. Vilches, T. Wilson, Appl. Phys. A 74,\nS1293 Part 2 Suppl. S (2002).\n[22] T. Wilson, A. Tyburski, M.R. DePies, O.E. Vilches, D. Becquet, and M. Bienfait, J. Low\nTemp. Phys. 126, 403 (2002).\n[23] Y.H. Kahng, R.B. Hallock, E. Dujardin, and T.W. Ebbesen, J. Low Temp. Phys. 126, 223\n(2002); R.B. Hallock, L. Low Temp. Phys., in press.\n[24] M. M.Calbi, S. M. Gatica, M. J. Bojan, G. Stan and M. W. Cole, Rev. Mod. Phys. 73, 857\n(2001).\n[25] B.K. Pradhan, G.U. Sumanasekera, K.W. Adu, H.E. Romero, K.A. Williams, P.C. Eklund\nPhys. B 323 (2002).\n[26] A. C. Dillon, M.J. Heben, Appl. Phys. A, 72, 133 (2001).\n[27] V.V. Simonyan, J.K. Johnson, J. of Alloys and Compounds 330, 659 (2002).\n[28] S.R. Challa, D.S. Sholl, J.K. Johnson, J. Chem. Phys. 116, 814 (2002).\n[29] R. A. Trasca, M.K. Kostov and M.W.Cole, Phys. Rev. B 67, 035410 (2003); M.C. Gordillo,\nJ. Boronat and J. Casulleras, Phys. Rev. B 65, 014503 (2002).\n[30] W. Shi and J. K. Johnson, Phys. Rev. Lett. 91, 015504 (2003).\n[31] M. W. Cole, V. H. Crespi, G. Stan, C. Ebner, J. M. Hartman, S. Moroni, and M. Boninsegni,\nPhys. Rev. Lett. 84, 3883 (2000).\n\n18\n\n\f[32] M. Boninsegni, S.Y. Lee, V.H. Crespi, Phys. Rev. Lett. 86, 3360 (2001).\n[33] M. M. Calbi, F. Toigo and M. W. Cole, J. Low Temp. Phys. 126, 179 (2002).\n[34] G. Stan and M.W. Cole, Surf. Science 395, 280 (1998).\n[35] A.M. Rao, E. Richter, S. Bandow, B. Chase, P.C. Eklund, K.A. Williams, S. Fang , K.R.\nSubbaswamy, M. Menon, A. Thess, R.E. Smalley, G. Dresselhaus, M.S. Dresselhaus, Science\n275, 187 (1997); S.M. Bachilo, M. S. Strano, C. Kittrell, R. H. Hauge, R. E. Smalley, and R.\nB. Weisman, Science 298, 2361 (2002).\n[36] J.W.G. Wildoer, L.C. Venema, A.G. Rinzler, R.E. Smalley, C. Dekker, Nature 391, 59 (1998).\n[37] A. Mizel, L. X. Benedict, M. L. Cohen, S. G. Louie, A. Zettl, N. K. Budraa, and W. P.\nBeyermann Phys. Rev. B 60, 3264 (1999).\n[38] L. Henrard, E. Hernandez, P. Bernier, and A. Rubio Phys. Rev. B 60, R8521 (1999).\n[39] Precisely the same mathematics determines the phonon density of states near a van Hove\nsingularity; see J. M.Ziman, Principles of the Theory of Solids (Cambridge U.P., 1972), Sect.\n2.5.\n[40] An example of such behavior occurs in the resonanting valence band model of superconductivity; see P.W. Anderson and Z. Zou, Phys. Rev. Lett. 60, 132 (1988).\n[41] M.K.Kostov, J.C.Lewis and M.W.Cole, in Condensed Matter Theories, Vol. 16, edited by\nE.S. Hernández and J. Clark, Nova Science Publishers, NY,2001, p.161; an analogous study\nof elastic mediation of the interaction on a planar surface is discussed by K. H.Lau and W.\nKohn, Surf. Sci. 65, 607 (1977) and 75, 69 (1978).\n[42] S. M. Gatica, M. M. Calbi and M. W. Cole, to be published in J. Low Temp. Phys.,\ncond-mat/0306614.\n[43] L. W. Bruch, in Phase Transitions in Surface Films 2, ed. H. Taub, G. Torzo, H. J. Lauter\nand S. C. Fain, Jr. (Plenum, NY, 1991), p. 67.\n[44] D.G.Narehood, J.V. Pearce, P.C. Eklund, P.E. Sokol, R.E. Lechner, J. Pieper, J.R.D. Copley,\nJ. Cook, Phys. Rev. B 67, 205409 (2003).\n[45] A.I. Skoulidas, D.M. Ackerman, J.K. Johnson, D.S. Sholl, Phys. Rev. Lett. 89, 185901 (2002).\n[46] To quote G.V. Chester, Phys. Rev. A2, 256 (1970), \"Little is known about the connection\nbetween Bose Einstein Condensation and Superfluidity\". A contrasting opinion is presented\nby A. Griffin, in \"Excitations in a Bose-condensed liquid\", Cambridge University Press, 1993,\np.16: \"the changing properties as the temperature increases through Tλ [are] direct conse-\n\n19\n\n\fquences of the condensate ....vanishing at Tλ \".\n[47] J. M. Kosterlitz and D. J. Thouless, in Progress in Low Temp. Phys., Vol. 7B, p. 371 (N.\nHolland, NY, 1978). The low T phase is a superfluid with a power law decay of the order\nparameter.\n[48] R. K. Pathria, Statistical Physics (Pergamon, Oxford, 1972), Sect. 7.5.\n[49] M.M. Calbi, S.M. Gatica, M.J. Bojan and M.W, Cole, J. Chem. Phys. 115, 9975 (2001); A.\nSiber, Phys. Rev. B 66, 205406 and 235414 (2002).\n[50] P. Schiffer et al, Phys. Rev. Lett. 74, 2379 (1995).\n[51] A.P.Y.Wong and M.H.W.Chan, Phys.Rev. Lett. 65, 2567 (1990); D.S.Fisher, G. M. Grinstein\nand A. Khurana, Physics Today, 41, p. 58 (1988); R.J. Birgeneau et al, Phys. Rev. Lett. 54,\n2147 (1985).\n[52] P. W. Anderson, B. I. Halperin, and C. M. Varma, Phil. Mag. 25, 1 (1972); W. A. Phillips, J.\nLow Temp. Phys. 7, 351 (1972); C. E. Campbell, J. G. Dash and M. Schick,Phys. Rev. Lett.\n26, 966 (1971).\n[53] S.C. Wang, L. Senbetu and C.-W. Woo, J. of Low Temp. Phys. 41, 611 (1980).\n[54] G. Stan, M.J. Bojan, S. Curtarolo, S.M. Gatica, M.W. Cole, Phys. Rev. B 62, 2173 (2000))\n\n20\n\n\fFIGURE CAPTIONS\n1. Contours of the ground state transverse energy Et (R) − Emin (relative to its minimum\nvalue) of an H2 molecule as a function of the radii R = (R1 , R2 , R3 ) of the tubes bordering\nthe IC. R is measured relative to the minimum Rmin ; the figure depicts behavior along the\nline (0, 1, −1). Beginning with the contour closest to the minimum (the closed curve), the\ncontours correspond to relative energy 0.005, 0.01, 0.05, 0.1, 0.5, 1 and 5 K.\n2. Upper panel: transverse density of states g(E) for 4 He, computed from the distribution\nof ICs as described in the text. Lower panel: total density of states N(E). In both cases,\nthe energy is measured relative to the minimum Emin = −456.88K\n3. Transverse and total densities of states, as in Fig.2, for H2 . Emin = −1052.97K\n4. Specific heat of He (full curve) and H2 (dots) as a function of T computed using the\nclassical Boltzmann approach.\n5. Fugacity Z = exp(βμ) as a function of T /Tc for two different densities: 1 x 10−5 Å−3\n(full curve) and 0.5 x 10−5 Å−3 (dots) within an inhomogeneous nanotube array while the\ndashed curve corresponds to an ideal 4D gas having the same low energy density of states.\n6. Condensate fraction as a function of the temperature computed for H2 in the nanotube\nsystem (full curve) and the 4D H2 gas (dots) for N=1x10−5 Å−3 .\n7. Heat capacity for H2 as a function of the temperature in nanotubes (full curve) and\nfor the 4D H2 gas (dashed) (panel a) and for 4 He in nanotubes (full curve) and for the 4D\n4\n\nHe gas (dashed) (panel b).\n8. Density of H2 molecules (full curve) and 4 He atoms (dotted curve) as a function of\n\ntransition temperature Tc . The short-dash (H2 ) and long dash (He) curves indicate the 4D\nideal gas limiting behavior.\n9. The occupied state energy distribution n(E, T ) (relative to the total number Np )\ndefined in Eq. 15 is shown for H2 at relative temperatures T /Tc = 0.5 (full curve),1 (dots),\n1.1 (short dashes) and 1.5( long dashes). The integral of the curve at 0.5 is the fraction (about\n0.7) of excited particles while the other curves integrate to 1, since then the condensate\nfraction vanishes.\n\n21\n\n\f\f\f\f\f\f\f\f\f\f"}