{"id": "http://arxiv.org/abs/cond-mat/0309570v4", "guidislink": true, "updated": "2004-05-06T12:38:35Z", "updated_parsed": [2004, 5, 6, 12, 38, 35, 3, 127, 0], "published": "2003-09-25T02:43:01Z", "published_parsed": [2003, 9, 25, 2, 43, 1, 3, 268, 0], "title": "Mesoscopic Fano Effect in a Quantum Dot Embedded in an Aharonov-Bohm\n  Ring", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0309451%2Ccond-mat%2F0309498%2Ccond-mat%2F0309592%2Ccond-mat%2F0309247%2Ccond-mat%2F0309481%2Ccond-mat%2F0309263%2Ccond-mat%2F0309405%2Ccond-mat%2F0309296%2Ccond-mat%2F0309298%2Ccond-mat%2F0309090%2Ccond-mat%2F0309621%2Ccond-mat%2F0309596%2Ccond-mat%2F0309109%2Ccond-mat%2F0309686%2Ccond-mat%2F0309586%2Ccond-mat%2F0309169%2Ccond-mat%2F0309112%2Ccond-mat%2F0309616%2Ccond-mat%2F0309488%2Ccond-mat%2F0309406%2Ccond-mat%2F0309045%2Ccond-mat%2F0309545%2Ccond-mat%2F0309310%2Ccond-mat%2F0309403%2Ccond-mat%2F0309241%2Ccond-mat%2F0309012%2Ccond-mat%2F0309497%2Ccond-mat%2F0309258%2Ccond-mat%2F0309469%2Ccond-mat%2F0309322%2Ccond-mat%2F0309697%2Ccond-mat%2F0309428%2Ccond-mat%2F0309221%2Ccond-mat%2F0309645%2Ccond-mat%2F0309010%2Ccond-mat%2F0309079%2Ccond-mat%2F0309195%2Ccond-mat%2F0309351%2Ccond-mat%2F0309504%2Ccond-mat%2F0309282%2Ccond-mat%2F0309346%2Ccond-mat%2F0309519%2Ccond-mat%2F0309539%2Ccond-mat%2F0309295%2Ccond-mat%2F0309675%2Ccond-mat%2F0309040%2Ccond-mat%2F0309570%2Ccond-mat%2F0309021%2Ccond-mat%2F0309409%2Ccond-mat%2F0309173%2Ccond-mat%2F0309255%2Ccond-mat%2F0309597%2Ccond-mat%2F0309573%2Ccond-mat%2F0309163%2Ccond-mat%2F0309018%2Ccond-mat%2F0309065%2Ccond-mat%2F0309189%2Ccond-mat%2F0309615%2Ccond-mat%2F0309407%2Ccond-mat%2F0309392%2Ccond-mat%2F0309217%2Ccond-mat%2F0309056%2Ccond-mat%2F0309274%2Ccond-mat%2F0309650%2Ccond-mat%2F0309612%2Ccond-mat%2F0309299%2Ccond-mat%2F0309438%2Ccond-mat%2F0309484%2Ccond-mat%2F0309704%2Ccond-mat%2F0309439%2Ccond-mat%2F0309329%2Ccond-mat%2F0309208%2Ccond-mat%2F0309063%2Ccond-mat%2F0309410%2Ccond-mat%2F0309376%2Ccond-mat%2F0309316%2Ccond-mat%2F0309627%2Ccond-mat%2F0309304%2Ccond-mat%2F0309127%2Ccond-mat%2F0309285%2Ccond-mat%2F0309431%2Ccond-mat%2F0309089%2Ccond-mat%2F0309500%2Ccond-mat%2F0309387%2Ccond-mat%2F0309700%2Ccond-mat%2F0309702%2Ccond-mat%2F0309025%2Ccond-mat%2F0309233%2Ccond-mat%2F0309357%2Ccond-mat%2F0309379%2Ccond-mat%2F0309306%2Ccond-mat%2F0309349%2Ccond-mat%2F0309713%2Ccond-mat%2F0309115%2Ccond-mat%2F0309026%2Ccond-mat%2F0309366%2Ccond-mat%2F0309460%2Ccond-mat%2F0309146%2Ccond-mat%2F0309381%2Ccond-mat%2F0309273%2Ccond-mat%2F0309368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mesoscopic Fano Effect in a Quantum Dot Embedded in an Aharonov-Bohm\n  Ring"}, "summary": "The Fano effect, which occurs through the quantum-mechanical cooperation\nbetween resonance and interference, can be observed in electron transport\nthrough a hybrid system of a quantum dot and an Aharonov-Bohm ring. While a\nclear correlation appears between the height of the Coulomb peak and the real\nasymmetric parameter $q$ for the corresponding Fano lineshape, we need to\nintroduce a complex $q$ to describe the variation of the lineshape by the\nmagnetic and electrostatic fields. The present analysis demonstrates that the\nFano effect with complex asymmetric parameters provides a good probe to detect\na quantum-mechanical phase of traversing electrons.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0309451%2Ccond-mat%2F0309498%2Ccond-mat%2F0309592%2Ccond-mat%2F0309247%2Ccond-mat%2F0309481%2Ccond-mat%2F0309263%2Ccond-mat%2F0309405%2Ccond-mat%2F0309296%2Ccond-mat%2F0309298%2Ccond-mat%2F0309090%2Ccond-mat%2F0309621%2Ccond-mat%2F0309596%2Ccond-mat%2F0309109%2Ccond-mat%2F0309686%2Ccond-mat%2F0309586%2Ccond-mat%2F0309169%2Ccond-mat%2F0309112%2Ccond-mat%2F0309616%2Ccond-mat%2F0309488%2Ccond-mat%2F0309406%2Ccond-mat%2F0309045%2Ccond-mat%2F0309545%2Ccond-mat%2F0309310%2Ccond-mat%2F0309403%2Ccond-mat%2F0309241%2Ccond-mat%2F0309012%2Ccond-mat%2F0309497%2Ccond-mat%2F0309258%2Ccond-mat%2F0309469%2Ccond-mat%2F0309322%2Ccond-mat%2F0309697%2Ccond-mat%2F0309428%2Ccond-mat%2F0309221%2Ccond-mat%2F0309645%2Ccond-mat%2F0309010%2Ccond-mat%2F0309079%2Ccond-mat%2F0309195%2Ccond-mat%2F0309351%2Ccond-mat%2F0309504%2Ccond-mat%2F0309282%2Ccond-mat%2F0309346%2Ccond-mat%2F0309519%2Ccond-mat%2F0309539%2Ccond-mat%2F0309295%2Ccond-mat%2F0309675%2Ccond-mat%2F0309040%2Ccond-mat%2F0309570%2Ccond-mat%2F0309021%2Ccond-mat%2F0309409%2Ccond-mat%2F0309173%2Ccond-mat%2F0309255%2Ccond-mat%2F0309597%2Ccond-mat%2F0309573%2Ccond-mat%2F0309163%2Ccond-mat%2F0309018%2Ccond-mat%2F0309065%2Ccond-mat%2F0309189%2Ccond-mat%2F0309615%2Ccond-mat%2F0309407%2Ccond-mat%2F0309392%2Ccond-mat%2F0309217%2Ccond-mat%2F0309056%2Ccond-mat%2F0309274%2Ccond-mat%2F0309650%2Ccond-mat%2F0309612%2Ccond-mat%2F0309299%2Ccond-mat%2F0309438%2Ccond-mat%2F0309484%2Ccond-mat%2F0309704%2Ccond-mat%2F0309439%2Ccond-mat%2F0309329%2Ccond-mat%2F0309208%2Ccond-mat%2F0309063%2Ccond-mat%2F0309410%2Ccond-mat%2F0309376%2Ccond-mat%2F0309316%2Ccond-mat%2F0309627%2Ccond-mat%2F0309304%2Ccond-mat%2F0309127%2Ccond-mat%2F0309285%2Ccond-mat%2F0309431%2Ccond-mat%2F0309089%2Ccond-mat%2F0309500%2Ccond-mat%2F0309387%2Ccond-mat%2F0309700%2Ccond-mat%2F0309702%2Ccond-mat%2F0309025%2Ccond-mat%2F0309233%2Ccond-mat%2F0309357%2Ccond-mat%2F0309379%2Ccond-mat%2F0309306%2Ccond-mat%2F0309349%2Ccond-mat%2F0309713%2Ccond-mat%2F0309115%2Ccond-mat%2F0309026%2Ccond-mat%2F0309366%2Ccond-mat%2F0309460%2Ccond-mat%2F0309146%2Ccond-mat%2F0309381%2Ccond-mat%2F0309273%2Ccond-mat%2F0309368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Fano effect, which occurs through the quantum-mechanical cooperation\nbetween resonance and interference, can be observed in electron transport\nthrough a hybrid system of a quantum dot and an Aharonov-Bohm ring. While a\nclear correlation appears between the height of the Coulomb peak and the real\nasymmetric parameter $q$ for the corresponding Fano lineshape, we need to\nintroduce a complex $q$ to describe the variation of the lineshape by the\nmagnetic and electrostatic fields. The present analysis demonstrates that the\nFano effect with complex asymmetric parameters provides a good probe to detect\na quantum-mechanical phase of traversing electrons."}, "authors": ["Kensuke Kobayashi", "Hisashi Aikawa", "Shingo Katsumoto", "Yasuhiro Iye"], "author_detail": {"name": "Yasuhiro Iye"}, "author": "Yasuhiro Iye", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.68.235304", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0309570v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0309570v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "REVTEX, 9 pages including 8 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0309570v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0309570v4", "journal_reference": "Phys. Rev. B68, 235304 (2003)", "doi": "10.1103/PhysRevB.68.235304", "fulltext": "Mesoscopic Fano effect in a Quantum Dot Embedded in an Aharonov-Bohm ring\nKensuke Kobayashi, Hisashi Aikawa, Shingo Katsumoto, and Yasuhiro Iye\n\narXiv:cond-mat/0309570v4 [cond-mat.mes-hall] 6 May 2004\n\nInstitute for Solid State Physics, University of Tokyo, 5-1-5 Kashiwanoha, Chiba 277-8581, Japan\nThe Fano effect, which occurs through the quantum-mechanical cooperation between resonance\nand interference, can be observed in electron transport through a hybrid system of a quantum\ndot and an Aharonov-Bohm ring. While a clear correlation appears between the height of the\nCoulomb peak and the real asymmetric parameter q for the corresponding Fano line shape, we need\nto introduce a complex q to describe the variation of the line shape by the magnetic and electrostatic\nfields. The present analysis demonstrates that the Fano effect with complex asymmetric parameters\nprovides a good probe to detect a quantum-mechanical phase of traversing electrons.\nPACS numbers: 73.21.La, 85.35.-p, 73.23.Hk, 72.15.Qm\n\nI.\n\nINTRODUCTION\n\ntonian [see Fig. 1(a)]:\nH = Eφ |φihφ| +\n\nAn Aharonov-Bohm (AB) ring and a quantum dot\n(QD) have been typical mesoscopic systems that continually invoke fundamental interest in the researchers.\nThe wave nature of electron manifests itself in the former\nwhile the particle nature of electron features in the latter.\nCombination of these complementary systems into a hybrid one enables us to explore the problem how coherent\nis the transport of electrons through a QD, where many\nelectrons interact with each other. In 1995, Yacoby et al.1\nperformed a pioneering work to tackle this issue by using\nsuch a system, namely, a QD embedded in one arm of an\nAB ring. It was found that an electron at least partially\nmaintains its coherence in passing the QD.1,2 As regards\nthe phase of the AB oscillation, although phase lapse\nwas found across the Coulomb peak, it was subsequently\nrecognized to be due to the two-terminal nature of the\ndevice,3,4 thus revealing that intrinsic phase measurement is a nontrivial issue. To avoid the problem, fourterminal measurements were performed and it was found\nthat each level inside the QD acts as a Breit-Wigner-type\nscatterer in that the phase of electron smoothly changes\nπ at the resonance.5 At the same time, however, it has\nbeen found contrary to a naive expectation that the peaks\nin the Coulomb oscillations are in phase with each other\nand an unexpected phase lapse occurs at the middle of\nthe Coulomb valley. Such an interferometry has also been\napplied to QD's in the Kondo regime,6,7,8 while the results have not converged, again revealing the difficulty.9\nIn the above experiments, the transport properties of a\nQD have been the main scope and the other arm with no\nQD has served as \"reference.\" However, one might ask\nwhat happens if the coherence of the QD and the AB\nring is fully maintained and thus the arm as well as the\nQD should be equally treated. In this situation, Fano\neffect has been expected to occur,10,11,12,13,14,15,16 and\nwas experimentally established in our previous study.17\nLet us briefly summarize Fano theory.18 Consider a\nsystem with a discrete energy state embedded in the continuum, which can be described by the following Hamil-\n\nX\n\nE ′ |ψE ′ ihψE ′ |\n\nE′\n\n+\n\nX\n\n(VE ′ |ψE ′ ihφ| + VE∗′ |φihψE ′ |) ,\n\n(1)\n\nE′\n\nwhere φ is a discrete state with energy Eφ and ψE ′ is a\nstate in the continuum with energy E ′ . VE ′ is the coupling strength between the discrete state and the continuum. A system eigenstate ΨE can be expressed by a\nlinear combination of φ and {ψE ′ } with the coefficients\nanalytically obtained. We consider a situation that an incoming initial state i interacts with the system through\na perturbation T and ends up as a linear combination\nof {ΨE }. The evolution from i to ΨE consists of two\npaths: one is through continuum states and the other is\nthrough a \"resonant state\" Φ, which is a modification of\nφ through the interaction VE ′ with the continuum. The\ntransition probability has a peculiar property around the\nresonance energy as\n|hΨE |T |ii|2\n(ǫ + q)2\n=\n|hψE |T |ii|2\n1 + ǫ2\n\nwith ǫ =\n\nE − E0\n,\nΓ /2\n\n(2)\n\nwhere E0 and Γ are the energy position and width of\nthe resonance state, respectively. The so-called \"Fano's\nasymmetric parameter\" q is defined as\nq≡\n\nhΦ|T |ii\n,\nπVE∗ hψE |T |ii\n\n(3)\n\nwhich is a measure of the coupling strength between the\ncontinuum state and the resonance state (namely, the\nstrength of the configuration interaction). Several curves\nfor different q's are plotted in Fig. 1(b).\nThe Fano effect is an expansion of the Breit-Wignertype resonance scattering and was established in the\natomic physics more than 40 years ago. Since then, reflecting the generality of the original model of Eq. (1),\nthe Fano effect has been found ubiquitous in a large\nvariety of experiments including neutron scattering,19\natomic photoionization,20 Raman scattering,21 and optical absorption.22 As this effect is essentially a singleimpurity problem, an observation on a single site would\n\n\f2\n(a)\n\nEF\n\n(c)\nVc\nDiscrete\n\nArm\n\nEF\n\nContinuum\n\nState\n\nEF\n\nB\n\nDrain\n\nEnergy\n\nSource\n\nEF\n\nCoupling\n\nQD\nVSD\nVg\n\nInitial State\n\n8\n\n(d)\n\nq=3\nq=2\nq=1\nq=0\n\nVc\n1\n\nμm\n\n4\n\nQD\n\nε\n\nq\n\n2\n\n( + ) /(\n\nε\n\n2\n\n+1)\n\n(b)\n\nVL\n0\n-5\n\n0\n\nVg\n\nVR\n\n5\n\nε\n\nFIG. 1: (a) Principle of the Fano effect. (b) Fano's line shapes\nfor several real q parameters. (c) Schematic representation\nof the experimental setup (see text). (d) Scanning electron\nmicrograph of the correspondent device.\n\nreveal this phenomenon in a more transparent way. The\nmost sensitive probe for such single-site experiments is\nthe electron transport. Compared to its long history\nin the spectroscopy, however, the general importance of\nFano effect in the transport was only recently pointed\nout in Refs. 23 and 24, although its characteristic feature\nhas already appeared in the theoretical studies.25 Experimentally, the single-site Fano effect has been reported in\nthe scanning tunneling spectroscopy of an atom on the\nsurface26,27 and in transport through a QD.28,29 While\nthe latter case is the first observation of this effect in a\nmesoscopic system, there is no well-defined continuum\nenergy state and the mechanism for the appearance of\nthe effect remains as an intriguing puzzle.\nAs mentioned, the QD-AB-ring hybrid system with parameters appropriately tuned provides a unique Fano system where the transition process shown in Fig. 1(a) is realized in real space as schematically sketched in Fig. 1(c).\nAn electron traverses from the source to the drain along\ntwo interfering paths. One is through the discrete state\nin the QD and the other is through the arm. In the previous paper17 we reported the following: (i) The electronic\nstates in the QD-AB-ring system can be sufficiently coherent for the Fano effect to emerge in transport. (ii)\nThe coherent Fano state disappears at finite source-drain\nvoltage. (iii) The phase difference between the two paths\ncan be controlled by magnetic field, resulting in characteristic variation in the line shape of the resonant peaks,\nwhich suggests the necessity to treat the parameter q as\na complex number.\nRegarding this issue, many problems are still open. For\ninstance, the phase controlling of the Fano effect should\nbe clarified in terms of a complex q. In addition, we\nwould list the phase evolution of the electrons through\na QD in the presence of the Fano effect,30,31 the Fano\n\neffect as a probe of phase coherence,32 the Fano effect in\nthe Kondo regime,14 and the detailed mechanism for the\nzero-bias resonance peak/dip in the differential conductance through a Fano system.17,28\nIn this paper, after briefing the experimental setup in\nSec. II, we extend the previous work to quantitative analysis of the experiments in Sec. III. First, we report the\napplication of the conventional Fano formula with a real\nq to our observation, and discuss the relation between the\noriginal Coulomb peaks and the Fano peaks in Sec. III A.\nThen, we focus on the magnetic and electrostatic phase\ncontrolling of the Fano effect in Secs. III B and III C, respectively. This subject is the central part of this paper,\nwhere we show that Fano effect can be a powerful tool\nto investigate the electron phase variation in such mesoscopic transport. In Sec. III B, we actually derive complex q as a function of the magnetic field from the experiment and compare it with the theory. The electrostatic\ncontrolling of the Fano line shape is similarly analyzed\nin Sec. III C. We also discuss the phase evolution over\nmultiple resonances and the temperature dependence of\nthe Fano effect in Secs. III D and III E, respectively.\n\nII.\n\nEXPERIMENT\n\nFigure 1(d) shows a scanning electron micrograph of\nthe device fabricated by wet-etching a two-dimensional\nelectron gas (2DEG) in an AlGaAs/GaAs heterostructure (mobility = 9 × 105 cm2 /V s and sheet carrier density = 3.8 × 1011 cm−2 ). The length of one arm of the\nring L is ∼ 2 μm. Two sets of three fingers are Au/Ti\nmetallic gates to control the local electrostatic potentials\nof the device. The three gates (VR , VL , and Vg ) at the\nlower arm are used for controlling the parameters of QD\n(with area about 0.15×0.15 μm2 ) and the gate at the\nupper arm is to apply VC , which determines the conductance of the upper arm. Measurements were performed\nin a mixing chamber of a dilution refrigerator between\n30 mK and 800 mK by a standard lock-in technique in the\ntwo-terminal setup with an excitation voltage of 10 μV\n(80 Hz, 5 fW) between the source and the drain. Noise\nfilters were inserted into every lead below 1 K as well as\nat room temperature.\nAs sketched in Fig. 1(c), this single-site Fano system\nis tunable in several ways. In the addition energy spectrum, the discrete energy levels inside the QD are separated by respective quantum confinement energy and the\nsingle-electron charging energy Ec , but we can shift the\nspectrum by the center gate voltage Vg to tune any one of\nthem to the Fermi level. The coupling between the continuum and the levels in the QD is controlled by VR and\nVL . VC can control the conductance of the interference\npath as well as the phase shift of the electrons traversing\nunderneath it (details are given later). The controlling of\nthe phase difference between the two paths (∆θ) is also\npossible by the magnetic field B piercing the ring.\nAn advantage of the present sample structure (wrap-\n\n\f3\ngate-type dot definition) is clearly shown in Fig. 2. The\nCoulomb oscillations through the QD with and without\nthe conduction through the other arm show a clear oneto-one correspondence of the conductance peaks. This is\ndue to the weakness in the electrostatic coupling between\nthe two sets of gates (VC and {VL , Vg , VR }), i.e., the circuit is already defined by etching and the gate electrodes\ncan be very thin. Still, though, we need a small shift by\n0.0065 V between the upper and lower axes in Fig. 2, due\nto the electrostatic coupling between the gates.\n\n1\n\n2\n\n8\n\n2 3\n6\n\n7\n\n9\n\n0.5\n\nQD\n0.0\n-0.15\n\n-0.10\n-0.05\nGate Voltage Vg (V)\n\nwith ǫ =\n\nα(Vg − V0 )\n.\nΓ /2\n\n(5)\n\n0.15\n\nFIG. 2: Typical Coulomb oscillation at VC = −0.11 V with\nthe arm pinched off, and asymmetric Coulomb oscillation at\nVC = −0.085 V with the arm transmissible. The latter shows\na clear Fano effect. The Coulomb and Fano peaks are in good\none-to-one correspondence as they were numbered consecutively from 1 to 9. Both of them were obtained at T = 30 mK\nand B = 0.91 T.\n\nCoulomb\nFano\n\n0.10\n0.05\n\n4\n3\n\n0.00\n2\n|q|\n\n|q|\n\n0.1\n\n(ǫ + q)2\n1 + ǫ2\n\nHere, A, V0 , and Γ are the amplitude, the position, and\nthe width of the Fano resonance, respectively. α is the\nproportionality factor which relates the gate voltage Vg\nto the electrochemical potential of the QD. In our system, α ∼ 20 μeV/mV as estimated from the differential\nconductance at the finite source-drain voltages Vsd .17\nThe fitted values Γ are 40–60 μeV, reflecting the variation of the coupling strength between the leads and the\nQD in the original Coulomb peaks. This Γ is consistent\nwith the width of the zero-bias peak observed in the differential conductance at a finite Vsd .17 Figure 3 shows the\nfitted |q| for the nine peaks. The signs of q are positive\nfor all the peaks except the peak 9. This corresponds\nto the observation that all the Fano features (the dips\n1–3 and peaks 4–8) except 9 have the asymmetric tails\nto the same direction. It is important that the signs of\nq are same for many consecutive Fano peaks since this\ndirectly reflects that the Coulomb peaks are in phase as\nintroduced in Sec. I. We will discuss it in Sec. III D.\n\n2\n\n0.6\n\n4\n\nGF ano (Vg ) = A\n\nPeak Height (e /h)\n\n5\n\nQD+Arm\n\n2\n\nConductance (e /h)\n\n0.2\n\nGate Voltage Vg (V)\n-0.10\n-0.05\n\nConductance (e /h)\n\n-0.15\n\nexpressed as\n\n1\n0\n\n1\n\nIII.\nA.\n\nRESULTS AND DISCUSSION\n\nFano effect in the Coulomb oscillation\n\nIn Fig. 2, the peaks were numbered consecutively from\n1 to 9. The small irregularity of the peak positions reflects the variation of single-electron energy-level spacing\nin the QD and indicates that the transport is through\neach single level. This is also consistent with the fact that\nthe peak heights vary randomly. In the upper panel, the\nFano effect emerges and the line shapes of the peaks become very asymmetric and even change to a dip structure\nfor the peaks 1, 2, and 3.\nWe have found that the line shapes of the peaks in\nthe upper curve in the conductance Gtot (Vg ) can be well\nfitted to the following equation\nGtot (Vg ) = Gbg + GF ano (Vg ),\n\n(4)\n\nwhere Gbg is noninterfering contribution of the parallel\narm and is a smooth function of Vg that can be treated as\na constant for each peak. GF ano is the Fano contribution\n\n2\n\n3\n\n4\n\n5 6\nPeak\n\n7\n\n8\n\n9\n\nFIG. 3: Fitted q values for the peaks 1–9 in Fig. 2 are shown\nin the lower panel. The heights of Coulomb peaks and Fano\npeaks are also plotted in the upper panel. The three of them\nare well correlated.\n\nIn the upper panel of Fig. 3, we plot the heights of\nthe Coulomb peaks and the Fano peaks. The height of a\nFano peak is defined as A(1 + q 2 ) in the fitting form of\nEq. (5), which is the difference of the conductance maximum and minimum of the Fano resonance. Not only are\nthe heights of the Coulomb and Fano peaks correlated\nbut the observed |q| values are also related to the peak\nheights in a way that a large peak tends to have a large\n|q|. This can be qualitatively explained as follows. When\nthe arm is pinched off, electrons never pass the continuum, resulting in |hψE |T |ii| → 0. This corresponds to\n|q| → ∞ in Eq. (3) and Eq. (2) asymptotically gives\na Lorentzian Coulomb peak as seen in Fig. 1(b). This\nreflects the fact that the Fano theory includes the BreitWigner scattering problem as a special limit of |q| → ∞,\nwhere there is no path through the continuum, namely,\n\n\f4\n\n(a) 0.28 T\n\n2\n\nConductance (e /h)\n\n0.8\n\n2\n\n0.3\n\n0.2\n\n-0.1\n(b) 1.19 T\n\n0.0\n\n-0.1\n\n0.0\n\nB = 0.9160 T\n0.9151 T\n0.9142 T\n\n0.5\n\nq = 2.0\n\n∆θ = π\n\nq = -18\n\n∆θ = π/2\n\nq = -2.6\n\n∆θ = 0\n\n0.3\n-0.08\n\n0.7\n\nExperiment\nFitted\n\n0.4\n\n0.7 (d) 2.65 T\n\n0.6\n-0.1\n0.0\nGate Voltage Vg (V)\n\n-0.1\n0.0\nGate Voltage Vg (V)\n\nFIG. 4: Fano's line shapes taken at (a) 0.28 T, (b) 1.19 T, (c)\n1.84 T, and (d) 2.65 T. They were obtained at T = 30 mK.\n\nB.\n\n0.6\n\n(c) 1.84 T\n\n0.6\n\n0.4\n\nfixed Vg results in the AB oscillation. Figure 5 shows the\nasymmetric oscillation obtained at B = 0.9142, 0.9151,\nand 0.9160 T. Defining the first as ∆θ = 0, the second\nand the third correspond to ∆θ = π/2 and π, respectively, as is calculated from the AB period ∼ 3.6 mT.\nThe peaks at ∆θ = 0 and π are very asymmetric while\nthose at ∆θ = π/2 are almost symmetric. The peaks\nat Vg = −0.058 V are fitted to Eq. (4) as indicated by\nthe dashed curves. The obtained q's are −2.6, −18, and\n2.0 for ∆θ = 0, π/2, and π, respectively. This result is\nsufficient for one to cast doubts on the applicability of\nEq. (5) with a real q. Since q serves as a measure for the\nstrength of the configuration interaction, it is unphysical\nthat q changes drastically and periodically by the small\nvariation of the magnetic field. Treating q as a real number also conflicts the observation that the peaks become\nsymmetric at specific fields, because Eq. (5) never gives\na symmetric line shape for a real q unless |q| → ∞ or\nq = 0 and the divergence of q should be ruled out, which\nmeans that there is no configuration interaction.\n\nConductance (e /h)\n\n2\n\nConductance (e /h)\n\nthere is no configuration interaction. The height of the\nCoulomb peak is proportional to |hΦ|T |ii|2 , which corresponds to the coupling strength between the QD and the\nleads. Opening of the arm means that |hψE |T |ii| is increased from 0 to a finite value with |hΦ|T |ii| fixed. The\nasymmetric parameter |q|, therefore, is larger for a larger\noriginal peak.\nThe above Fano effect was observed at B ∼ 0.91 T. We\nfound the Fano effect prominent within several specific\nmagnetic-field ranges as shown in Figs. 4(a)-(d) besides\nB ∼ 0.91 T, while it was less pronounced in other ranges.\nThis implies that the coherence of the transport through\nthe QD strongly depends on B. A similar role of B is\nreported in the Kondo effect in a QD,6 where the Kondo\neffect appeared at the specific magnetic field other than\nat B ∼ 0 T. The phenomena arise from the change of the\nelectronic states caused by B in a QD. It is also possible\nthat the magnetic field affects the coherent transport in\nthe AB ring, due to the reduction of boundary roughness\nscattering by the magnetic field as theoretically treated\nin Ref. 33. An example of the experimental indication\nmay be seen in Ref. 34. Henceforth, we will focus on the\nFano effect observed at B ∼ 0.91 T.\n\nMagnetic-field control of the Fano interference\n\nOne of the experimental advantages of the present system over the other canonical Fano systems with microscopic sizes lies in the spatial separation between the discrete level and the continuum, which allows us to control\nFano interference both magnetically and electrostatically.\nThe result of the magnetic controlling of the Fano effect was already reported (Fig. 4 of Ref. 17): Fano's\nasymmetric Coulomb oscillation appears in sweeping Vg\nat a fixed magnetic field, while the field sweeping at a\n\n-0.06\n-0.04\nGate Voltage Vg (V)\n\nFIG. 5: Conductance of three Fano peaks at 30 mK at the\nselected magnetic fields at B = 0.9142, 0.9151, and 0.9160 T.\nThey are incrementally shifted upwards for clarity. The direction of the asymmetric tail changes between B = 0.9142\nand 0.9160 T, and the symmetric shape appears at 0.9151 T.\nThe results of the fitting with Fano's line shape with real q's\nare superposed.\n\nTo overcome these unphysical situations, we should\ntake it into account that the field only affects the phase of\nthe electron and never changes the strength of the configuration interaction. In the original situation of the Fano\ntheory,18 this does not occur because the scattering center and the continuum are spatially overlapping. Hence\nq can be treated as a real number. Even in the framework of the Hamiltonian expressed in Eq. (1), this can\nbe performed by treating VE as a complex number and\nby assuming that the field only modifies arg(VE ) but not\n|VE |. As a consequence, the generalized Fano formula is\nproposed in the following expression as an expansion of\n\n\f5\nEq. (5),\n\n(a)\n2\n\n2\n\n2\n\n(ǫ + Req) + (Imq)\n|ǫ + q|\n=A\n.\nǫ2 + 1\nǫ2 + 1\n(6)\nQualitatively, even when the coupling strength |q| is almost independent of B, the B-dependence of arg(q) that\ncomes from VE in Eq. 3 yields asymmetric and symmetric line shapes of G for |Req| ≫ |Imq| and |Req| ≪ |Imq|,\nrespectively. We treated q as real in the analysis of the\npeaks in Fig. 2, which is justified as their asymmetry is\nlarge enough.\nWe note that q in Eq. (3) is not necessarily real. Conventionally q has been considered to be real, which is\nvalid only when the system has the time-reversal symmetry (TRS) and thus the matrix elements defining q in\nEq. (3) can be taken as real. This is the case in many experimental situations of microscopic Fano systems as far\nas their ground state has TRS, because it needs enormous\nmagnetic field to add considerable AB phase during the\ntransition between the continuum and the discrete states.\nHence the breaking of TRS becomes important with enlargement of systems. The claim that Fano's asymmetric\nparameter q should be complex was theoretically considered in spectroscopy.35,36,37,38 Also in the electron transport through mesoscopic systems, such generalization has\nbeen discussed or alluded.13,14,15,16,32,39,40 To the best of\nour knowledge, though, our result is the first convincing experimental indication that q should be a complex\nnumber, when TRS is broken under the magnetic field.\nIn order to be more quantitative, we carried out numerical fitting with complex q's to the line shape of the\npeaks occurring in the range B = 0.91–0.93 T. The fitting function is Eq. (4) with Eq. (6) for GF ano (Vg ), with\nReq, Imq, V0 , Γ , A, and Gbg as free parameters. The values of V0 and Γ can be determined straightforwardly. As\nfor the other four parameters, Req, Imq, A, and Gbg , the\nnumerical fitting alone does not allow unique determination of all of them, because the functional form of Eq. (4)\nessentially contains only three parameters besides V0 and\nΓ . We took the following fitting procedure. As has been\nargued in the discussion leading to Eq. (6), the amplitude A of the Fano resonance is expected to be nearly\nindependent of B. Therefore, it is reasonable to assume\nthat A takes a common value for all the curves to be fitted. The value of A was determined from the fitting of\nthe most asymmetric case (since q can be taken as real)\nas 0.011e2/h, and this value was used for other curves.\nThe resulting fitting is reasonably good over the whole\nrange as shown by solid curves covering one AB period\nin Fig. 6(a). The V0 and Γ are nearly independent of B,\nwhile the Gbg is found to change slightly with B due to\nthe long tails of the neighboring Fano peaks.\nIn Fig. 6(b), the obtained Req and Imq are plotted\nagainst B. Both of them well depend on B sinusoidally,\nwhere the phase difference between the two sinusoids is\nvery close to π/2. Indeed, the solid curves superposed on\nthem are the result of the fitting by a sinusoidal function,\nthat is, Req(∆θ) = 0.4 − 2.6 cos(∆θ) and Imq(∆θ) =\n\n(b)\n\nexperiment\nfitted\n\n0.923 T\n\n1.5\n\nReq, Imq\n\nGF ano (Vg , B) = A\n\nReq\nImq\n\n2\n0\n-2\n\n2\n\nConductance (e /h)\n\nfitted\n\n4\n\n-4\n0.915\n0.920\nMagnetic Field (T)\n\n0.922 T\n\n1.0\n\n(c) 4\n\nfitted\n\n2\nImq\n\n0.921 T\n\n0.5\n\nq\n\n0\n-2\n\n0.920 T\n\n-0.085\n-0.075\nGate Voltage Vg (V)\n\n-4\n-4\n\n-2\n\n0\nReq\n\n2\n\n4\n\nFIG. 6: (a) Conductance of the system measured at 30 mK\nat different magnetic fields that cover one AB period. The\nopen circles and the solid curves are the experiments and the\nresults of the fitting, respectively. They are incrementally\nshifted upwards for clarity. (b) Obtained Req and Imq are\nplotted. The solid curves are the fitted sinusoidal curves. (c)\nResult of (b) plotted in the complex q plane by treating B as\nan internal parameter. The cross indicates the ellipse center\nof the complex q.\n\n−0.7 − 2.7 sin(∆θ). As defined above, ∆θ is the phase\ndifference picked up from the magnetic field based on\nthe measured AB period, while ∆θ = 0 corresponds to\nB = 0.9145 T for these sinusoids.\nThe result is summarized as the plot of q in the complex plane shown in Fig. 6(c). The solid curve, which\nis elliptic (almost circular), is the result of the fitting in\nFig. 6(b). As indicated by the cross, the ellipse center\nis slightly shifted from the origin q = 0. The same fitting procedure for the other peaks at Vg = −0.058 V and\n−0.038 V in Fig. 5 yields complex q which also traces an\nellipse with the center slightly shifted from the origin.\nThe generalized Fano formula for the two-terminal\nconductance of the QD-AB-ring system was theoretically proposed to be the same functional form with\nEq. (6).14,16 In the formula, the effect of the magnetic\nfield is included in the phase factor ∆θ in the complex\nq that is given as q(∆θ) = q1 cos(∆θ) + iq2 sin(∆θ). q1 ,\nq2 and A, which are real parameters independent of B,\nare defined by both the tunneling coupling between the\nQD and its leads and the coupling strength between the\nQD and the continuum energy state. The theoretical q\ntraces an ellipse in the complex plane being consistent\nwith our observation, while the theoretical ellipse center\nis at the origin. It is emphasized that this difference between the experiment and the theory is not caused by\nour fitting procedure. As is clear from Fig. 5, the heights\nof the peak at Vg = −0.079 V are different when the\n\n\f6\n\nElectrostatic control of the Fano interference\n\nNext, we focus on the electrostatic control of the Fano\neffect by the control gate voltage VC . The variation of\nthe electrostatic potential energy by VC results in change\nin the kinetic energy of electrons, and hence their wave\nnumber which traverses the region underneath the gate\nelectrode. As this gives rise to the phase difference between the path through the QD and the one through the\narm,42 the electrostatic controlling of the Fano effect is\nexpected.\nFigure 7 (a) shows the asymmetric Coulomb oscillation at VC = −0.082 V and −0.090 V. The direction of\nasymmetric tail of the Fano effect is opposite between the\ntwo. The result of the fitting to Eq. (4) with real q for\nthe peak at Vg = −0.102 V is shown by the solid curve.\nIn Fig. 7 (b), the real q obtained for various VC is plotted by the triangles. The line shape becomes symmetric\nwith large |q| at VC = −0.088 V and −0.087 V, between\nwhich the sign of q changes.\nThe above behavior is similar to the one in the magnetic controlling. However, we note that there exists an\nessential difference between the magnetic controlling and\nthe electrostatic one. While in the former a complex q is\na natural consequence of the broken TRS, this is not the\ncase in the latter because the electrostatic potential modulation itself never breaks TRS when the magnetic flux\npiercing the AB ring is integer times the flux quantum\nh/e. Nevertheless, when the flux is fixed to a noninteger\nvalue of flux quanta, a symmetric Lorentzian line shape\ncan appear at specific VC 's and thus q should be complex.\nThis can be proven in a model calculation by combining\nthe Breit-Wigner formula with the conductance formula\nfor the two-terminal AB ring43 as performed in Ref. [13].\nFinite decoherence is also responsible for the occurrence\nof the symmetric line shape32 as already discussed.\nFigure 7(b) shows the result of the complex q for the\nvarious VC 's obtained by the similar fitting procedure as\ndone in the magnetic controlling. As expected, both Req\nand Imq continuously change in sweeping VC . Req crosses\n0 with finite Imq between VC = −0.088 V and −0.087 V\nwhile |Req| takes its local maximum with Imq ∼ 0 around\n\nq = 2.2\n\n0.8\nexperiment\nfitted\n\n0.3\nq = -4.1\n\nVC = -0.090 V\n\n0.7\n\nq = -2.1\n\n0.2\n\n2\n\n0.4\n\nVC = -0.082 V\n\nConductance (e /h)\n\n2\n\nConductance (e /h)\n\nq = 2.0\n\n0.6\n-0.10\n-0.08\nGate Voltage Vg (V)\n\n(b)\n5\n0\n\nReal q\nReq\nImq\n\n-5\n-10\n\n-0.090\n-0.085\n-0.080\nControl Gate Voltage VC (V)\n\n(c) 5\n-0.082 V\n\nImq\n\nC.\n\n(a)\n\nReal q, Req, Imq\n\nphase difference changes by π. This is also the case for\nthe Vg = −0.038 V peak. These observations are never\nreproduced by using the theoretical form of q(∆θ), because, for an arbitrary ∆θ, the theoretical line shape for\nq(∆θ) is a mirror image of that for q(∆θ + π) with respect to ǫ = 0. Thus, the difference is due to the effect\nthat is not included in the theoretical model. The influence of the multichannel transport and/or the orbital\nphase41 might be a possible candidate. The incoherent\ntransmission through the system may be also responsible\nfor that, because q generally becomes complex due to the\ndecoherence even under TRS.32 As the present system is\nhighly, but not perfectly, coherent, this would shift the\nellipse center of the complex q from the origin.\n\n0\nq\n\n-0.090 V\n\n-5\n-5\n\n0\nReq\n\n5\n\nFIG. 7: (a) Coulomb oscillations at VC = −0.082 V and\n−0.090 V at 30 mK and B = 0.91 T. The results of the fitting\nto Eq. (4) are shown in the solid lines with the obtained q\nvalues. (b) Real q for the Vg = −0.102 V peak is plotted\nby the triangle as a function of VC . The sign of q changes\nbetween VC = −0.088 V and −0.087 V as indicated by the\nvertical dashed line. The obtained Req and Imq for the same\npeak are superposed with white and black circles, respectively.\n(c) Result of (b) plotted in the complex q plane by treating\nVC as an internal parameter. q's for VC = −0.082 V and\n−0.090 V are colored black.\n\nVC = −0.082 V and −0.090 V, where the line shape is\nthe most asymmetric. So, the electrostatic controlling of\nthe Fano effect can be characterized by the complex q as\nwe have seen for the magnetic one. As we have discussed\nin Fig. 6(c), the result is summarized in Fig. 7(c) as the\nplot of q in the complex plane. Again, the complex q\nencircles around the origin of the complex plane.\nLet us estimate the order of magnitude of the phase\ndifference introduced by the change of VC . According\nto a simple capacitance model between the gate and the\n2DEG,44,45 this effect yields the phase difference ∆θ;\ns\n!\nW\nVC\n∆θ(VC ) = 2π\n1− 1−\n,\n(7)\nλF\nVdep\nwhere W and Vdep are the width of the gate and the\n\n\f7\npinch-off voltage of the corresponding conduction channel\n(−0.10 V for the last channel in the present case), respectively. λF ∼ 40 nm is the Fermi wavelength of the present\n2DEG. Now, if we take the effective width W ∼ 120 nm,\n|∆θ(VC = −0.082) − ∆θ(VC = −0.090)| = 0.65π for the\nlast and probably the most effective channel. Although\nthis is expected to be π for the ideal case as seen from\nFig. 7(c), the variation of the Fano line shape in Fig. 7(a)\nis attributed as due to such large phase difference electrostatically introduced by VC .\nWe have seen that the electrostatic controlling of the\nFano effect is possible. It is pointed out that this type of\nphase measurement is very difficult in ordinary oscillation of conductance.42 A phase shift by π due to potential scattering means that the Fermi energy has passed a\nresonant energy level, which causes steep variation of the\nconductance by order of 2e2 /h. Hence the oscillation due\nto the interference is almost swamped by in the large variation of the conductance. Indeed in the case of Fig. 7, the\nincrease of the baseline for π phase shift is about 0.6e2 /h\nwhile the Fano asymmetry due to the interference is only\nabout 0.02e2/h. Furthermore, Vdep in Eq. (7) is different\nfor each conductance channel, meaning that the phase\nshift caused electrostatically is inevitably channel dependent. Hence the total conductance for the multichannel\ncase is a superposition of many oscillations with various\nphase shifts.\nThe clear advantage of the present electrostatic tuning in overcoming the severe \"signal-to-noise-ratio\" lies\nin the peculiar Fano line shape and in the insensitivity of\nthe arm conductance to Vg . More importantly, the QD\nacts as a filter for the conductance channels, which means\nthat in the Fano effect we selectively observe the interference through the single channel passing through the QD.\nThe present result indicates that the analysis of the Fano\nresonance with Eq. (6) provides a sensitive and noiseresistant method to detect quantum-mechanical phase of\nelectrons.\n\nD.\n\nPhase evolution over multiple resonances\n\nThus far we have mainly focused on the transport in\nthe small areas of the gate voltage around respective\npeaks. Here, we discuss the phase evolution of electrons\nbetween neighboring peaks. In Ref. 17, it has been reported that the phase changes by π rapidly but continuously across the resonance and that all the adjacent\nFano resonances are in phase, as the phase makes another slow change by π between the valley. In contrast\nto the experiment for the phase measurement of the QD,1\nthe present data not only reflect the phase evolution of\nelectrons through a QD, but also represent the response\nto the magnetic field of the whole QD-AB-ring system.\nIn that case, a continuous change by π at the resonance\nis likely.16 What still remains surprising is the another\ngradual phase change by π at each valley.46 This phenomenon is in clear contrast to the reported phase lapse\n\nin the middle of the valley,5 which has not been perfectly\nunderstood yet despite extensive studies.3,47,48,49,50,51,52\nNevertheless, in most cases, the adjacent Coulomb peaks\nare in phase. This is also consistent with our observation\nthat the direction of the Fano asymmetry is usually the\nsame in each curve as clearly seen in Figs. 2, 4(b), 5,\nand 7(a).\nIt should be added that in rare cases the adjacent peaks\nare in antiphase, as seen in the Fano peaks 8 and 9 in\nFig. 2. This is the observation that has never been known\nbefore.1,5 While the necessary condition for it remains to\nbe clarified, this should be a new clue to the phase lapse\nproblem.\n\nE.\n\nTemperature dependence of the AB effect\n\nThe phase coherence over the system is essential in the\ncontrolling of the Fano interference discussed above. Figure 8(a) shows the temperature dependence of the Fano\neffect between 50 mK and 800 mK. While clear Fano features appear at 50 mK as marked by the arrows, they\ndiminish rapidly as the temperature increases. Especially, the asymmetric dips at 50 mK evolves into peaks\nat T ≥ 200 mK. While the thermal broadening of the\nFano line shape is not negligible at temperatures higher\nthan Γ ,29 it cannot explain such drastic temperature dependence. The main cause for this phenomenon is the\ndecoherence induced by increasing the temperature, resulting in the destruction of the Fano state. This is confirmed by the temperature dependence of the AB effect.\nIn Fig. 8(c), we plotted the AB amplitude at 50, 100, 200,\n300, and 400 mK for the peak and the valley indicated\nin Fig. 8(b). At 50 mK, the AB amplitude is found to be\ncomparable to the net peak height, indicating that the\nelectronic states are highly coherent over the ring. At\nT > 400 mK, the AB amplitude was hardly visible. This\nis consistent with the observation in Fig. 8(a).\nThe AB amplitude monotonically decreases both at the\npeak and valley as shown in Fig. 8(c). Interestingly, it\ndecays more slowly at the valley than at the peak. While\nthe mechanism for such a temperature dependence is yet\nunclear, a logarithmic T dependence that might be reminiscent of the Kondo effect was reported for the Fano effect in a single QD.28 On the other hand, the exponentialdecay function of T was reported for the quasiballistic AB\nring.45,53,54,55 However, the observed temperature range\nFig. 8(c) is not wide enough to distinguish these two dependencies.\n\nIV.\n\nCONCLUSION\n\nIn summary, we have studied mesoscopic Fano effect\nobserved in a QD-AB-ring system, especially in terms of\nthe magnetic and the electrostatic tuning. In the conventional analysis with real q, the correlation between\nthe original Coulomb peak heights and |q| is observed.\n\n\f8\n(a)\n\n(b)\n\nPeak\n\n50\n75\n100\n150\n200\n\n0.5\n\n50 mK\n\n250\n\n0.7\n\n-0.13\n\n350\n\n(c)\n\n400\n\n700\n800\nmK\n\n0.5\n\n2\n\n0.6\n\n-0.12\n\n-0.11\n\nGate Voltage Vg (V)\n\n0.08\n\n500\n600\n\nB = 0.933 T\n\n0.4\n\n300\n\nAB Amplitude (e /h)\n\n2\n\nConductance (e /h)\n\n400 mK\n\n2\n\n0.8\n\nConductance (e /h)\n\nValley\n\nPeak\nValley\n\n0.06\n0.04\n0.02\n\nB = 0.93 T\n0.00\n-0.10\n-0.05\nGate Voltage Vg (V)\n\n0\n\n100 200 300 400\nTemperature (mK)\n\nFIG. 8: (a) Conductance of the system measured between\n50 mK and 800 mK at B = 0.93 T. The data at T ≤ 700 mK\nare incrementally shifted upward for clarity. The Fano features marked by the arrows at 50 mK gradually disappear as\nthe temperature increases. (b) Fano structure at 50 mK and\n400 mK. (c) Temperature dependence of the AB amplitude\nmeasured at the peak and the valley indicated in (b).\n\nThe magnetic-field tuning has revealed that the effect of\nTRS breaking can be taken into account by extending the\nFano parameter q to a complex number. We have shown\nthat the experimental curves can actually be fitted by\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nadopting a complex q,56 which shows slight systematic\ndeviation from theoretical prediction. We have applied\nthus established method to the electrostatic tuning of\nFano effect. This method clearly describes the electrostatic tuning of electron phase, which demonstrates that\nthe Fano effect can be a powerful tool for phase measurement in mesoscopic circuits. Finally, we have reported\nthe difference in the temperature dependence of the AB\neffect between the Coulomb peak and the Coulomb valley. Thus, we have clarified several aspects of the Fano\neffect observed in transport, while some problems remain\nto be solved in future such as the phase evolution over\nthe multiple resonances.\nIt is interesting that the Fano effect first established\nin atomic physics is now observed in an artificial atom\nsystem. Such a mesoscopic analog will bring us renewed\nunderstandings. For example, the complex q should also\nbe applied to other experiments where TRS is broken.\n\nA. Yacoby, M. Heiblum, D. Mahalu, and H. Shtrikman,\nPhys. Rev. Lett. 74, 4047 (1995).\nS. Katsumoto and A. Endo, J. Phys. Soc. Jpn. 65, 4086\n(1996).\nA. L. Yeyati and M. Büttiker, Phys. Rev. B 52, 14360\n(1995).\nA. Yacoby, R. Schuster, and M. Heiblum, Phys. Rev. B\n53, 9583 (1996).\nR. Schuster, E. Buks, M. Heiblum, D. Mahalu, V. Umansky, and H. Shtrikman, Nature (London) 385, 417 (1997).\nW. G. van der Wiel, S. De Franceschi, T. Fujisawa, J. M.\nElzerman, S. Tarucha, and L. P. Kouwenhoven, Science\n289, 2105 (2000).\nY. Ji, M. Heiblum, D. Sprinzak, D. Mahalu, and H. Shtrikman, Science 290, 779 (2000).\nY. Ji, M. Heiblum, and H. Shtrikman, Phys. Rev. Lett.\n88, 076601 (2002).\nO. Entin-Wohlman, A. Aharony, Y. Imry, Y. Levinson, and\nA. Schiller, Phys. Rev. Lett. 88, 166801 (2002).\nP. Singha Deo and A. M. Jayannavar, Mod. Phys. Lett. B\n10, 787 (1996); P. Singha Deo, Solid State Commun. 107,\n69 (1998).\n\nACKNOWLEDGMENTS\n\nWe thank A. Aharony, M. Büttiker, O. EntinWohlman, M. Eto, W. Hofstetter, T.-S. Kim, J. König,\nand T. Nakanishi for helpful discussion. This work was\nsupported by a Grant-in-Aid for Scientific Research and\nby a Grant-in-Aid for COE Research (\"Quantum Dot and\nIts Application\") from the Ministry of Education, Culture, Sports, Science, and Technology of Japan. K.K.\nwas supported by a Grant-in-Aid for Young Scientists\n(B) (No. 14740186) from Japan Society for the Promotion of Science.\n\n11\n12\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n19\n\n20\n\n21\n\n22\n\n23\n\nC.-M. Ryu and S. Y. Cho, Phys. Rev. B 58, 3572 (1998).\nK. Kang, Phys. Rev. B 59, 4608 (1999).\nO. Entin-Wohlman, A. Aharony, A., Y. Imry, and Y.\nLevinson, J. Low Temp. Phys. 126, 1251 (2002).\nW. Hofstetter, J. König, and H. Schoeller, Phys. Rev. Lett.\n87, 156803 (2001).\nTae-Suk Kim, Sam Young Cho, Chul Koo Kim, and\nChang-Mo Ryu, Phys. Rev. B 65, 245307 (2002).\nA. Ueda, I. Baba, K. Suzuki, and M. Eto, J. Phys. Soc.\nJpn. 72, Suppl. A, 157 (2003).\nK. Kobayashi, H. Aikawa, S. Katsumoto, and Y. Iye, Phys.\nRev. Lett. 88, 256806 (2002).\nU. Fano, Phys. Rev. 124, 1866 (1961).\nR. K. Adair, C. K. Bockelman, and R. E. Peterson, Phys.\nRev. 76, 308 (1949).\nU. Fano and A. R. P. Rau, Atomic Collisions and Spectra\n(Academic Press, Orland , 1986).\nF. Cerdeira, T. A. Fjeldly, and M. Cardona, Phys. Rev. B\n8, 4734 (1973).\nJ. Faist, F. Capasso, C. Sirtori, K. W. West, and L. N.\nPfeiffer, Nature (London) 390, 589 (1997).\nE. Tekman and P. F. Bagwell, Phys. Rev. B 48, 2553\n\n\f9\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n34\n\n35\n\n36\n\n37\n\n38\n39\n\n(1993).\nJ. U. Nöckel and A. D. Stone, Phys. Rev. B 50, 17415\n(1994).\nFor example, M. Büttiker, Y. Imry, and M. Ya. Azbel,\nPhys. Rev. A 30, 1982 (1984); J. L. D'Amato, H. M.\nPastawski, and J. F. Weisz, Phys. Rev. B. 39, 3554 (1989).\nV. Madhavan, W. Chen, T. Jamneala, M. F. Crommie,\nand N. S. Wingreen, Science 280, 567 (1998).\nJ. Li, W. D. Schneider, R. Berndt, and B. Delley, Phys.\nRev. Lett. 80, 2893 (1998).\nJ. Göres, D. Goldhaber-Gordon, S. Heemeyer, M. A. Kastner, H. Shtrikman, D. Mahalu, and U. Meirav, Phys. Rev.\nB 62, 2188 (2000).\nI. G. Zacharia, D. Goldhaber-Gordon, G. Granger, M. A.\nKastner, Yu. B. Khavin, H. Shtrikman, D. Mahalu, and U.\nMeirav, Phys. Rev. B 64, 155311 (2001).\nAmnon Aharony, Ora Entin-Wohlman, and Yoseph Imry,\nPhys. Rev. Lett. 90, 156802 (2003).\nTae-Suk Kim and S. Hershfield, Phys. Rev. B 67, 235330\n(2003).\nA. A. Clerk, X. Waintal, and P. W. Brouwer, Phys. Rev.\nLett. 86, 4636 (2001).\nH. Akera and T. Ando, Phys. Rev. B 43, 11676 (1991).\nL. P. Kouwenhoven, B. J. van Wees, W. Kool, C. J. P. M.\nHarmans, A. A. M. Staring, and C. T. Foxon, Phys. Rev.\nB 40, 8083 (1989).\nG. S. Agarwal, S. L. Haan, and J. Cooper, Phys. Rev. A\n29, 2552 (1984).\nG. Abstreiter, M. Cardona, and A. Pinczuk, in Light Scattering in Solids, edited by M. Cardona and G. Güntherodt,\nTopics in Applied Physics Vol. 54 (Springer, Berlin, 1984),\np. 127.\nK. J. Jin, S. H. Pan, and G. Z. Yang, Phys. Rev. B 50,\n8584 (1994).\nWolfgang Ihra, Phys. Rev. A 66, 020701 (2002).\nE. R. Racec and Ulrich Wulf, Phys. Rev. B 64, 115318\n(2001).\n\n40\n\n41\n\n42\n\n43\n\n44\n\n45\n\n46\n\n47\n\n48\n49\n\n50\n\n51\n52\n\n53\n\n54\n55\n\n56\n\nKicheon Kang and Sam Young Cho, cond-mat/0210009\n(unpublished).\nBjörn Kubala and Jürgen König, Phys. Rev. B 67, 205303\n(2003).\nS. Katsumoto, N. Sano, and S. Kobayashi, J. Phys. Soc.\nJpn. 61, 1153 (1992).\nY. Gefen, Y. Imry, and M. Ya. Azbel, Phys. Rev. Lett. 52,\n129 (1984).\nA. Yacoby, U. Sivan, C. P. Umbach, and J. M. Hong, Phys.\nRev. Lett. 66, 1938 (1991).\nK. Kobayashi, H. Aiakwa, S. Katsumoto, and Y. Iye, J.\nPhys. Soc. Jpn. 71, L2094 (2002).\nSince this feature is not included in Eq. (6), the fitting\nin Fig. 6(a) should be performed to the limited range of\nVg around a single resonance, while the results of the fitting such as the behavior of the complex q are not greatly\naffected by a slight change of the fitting range.\nC. Bruder, R. Fazio, and H. Schoeller, Phys. Rev. Lett.\n76, 114 (1996).\nY. Oreg and Y. Gefen, Phys. Rev. B 55, 13726 (1997).\nJ. Wu, B.-L. Gu, H. Chen, W. Duan, and Y. Kawazoe,\nPhys. Rev. Lett. 80, 1952 (1998).\nG. Hackenbroich and H. Weidenmüller, Europhys. Lett.\n38, 129 (1997).\nH.-W. Lee, Phys. Rev. Lett. 82, 2358 (1999).\nT. Taniguchi and M. Büttiker, Phys. Rev. B 60, 13814\n(1999).\nA. E. Hansen, A. Kristensen, S. Pedersen, C. B. Sørensen,\nand P. E. Lindelof, Phys. Rev. B 64, 45327 (2001).\nG. Seelig and M. Büttiker, Phys. Rev. B 64, 245313 (2001).\nG. Seelig, S. Pilgram, A. N. Jordan, and M. Büttiker, Phys.\nRev. B 68, R161310 (2003).\nThe complex q was also reported recently in Jinhee Kim,\nJae-Ryoung Kim, Jeong-O Lee, Jong Wan Park, Hye Mi\nSo, Nam Kim, Kicheon Kang, Kyung-Hwa Yoo, and Ju-Jin\nKim, Phys. Rev. Lett. 90, 166403 (2003).\n\n\f"}