{"id": "http://arxiv.org/abs/cond-mat/0601582v1", "guidislink": true, "updated": "2006-01-25T15:00:17Z", "updated_parsed": [2006, 1, 25, 15, 0, 17, 2, 25, 0], "published": "2006-01-25T15:00:17Z", "published_parsed": [2006, 1, 25, 15, 0, 17, 2, 25, 0], "title": "On the properties of steady states in turbulent axisymmetric flows", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0408070%2Ccond-mat%2F0408266%2Ccond-mat%2F0408095%2Ccond-mat%2F0408505%2Ccond-mat%2F0408188%2Ccond-mat%2F0408466%2Ccond-mat%2F0408592%2Ccond-mat%2F0408149%2Ccond-mat%2F0408377%2Ccond-mat%2F0408488%2Ccond-mat%2F0408301%2Ccond-mat%2F0408086%2Ccond-mat%2F0408489%2Ccond-mat%2F0408130%2Ccond-mat%2F0408636%2Ccond-mat%2F0408129%2Ccond-mat%2F0408411%2Ccond-mat%2F0408588%2Ccond-mat%2F0408654%2Ccond-mat%2F0408248%2Ccond-mat%2F0408328%2Ccond-mat%2F0408302%2Ccond-mat%2F0408402%2Ccond-mat%2F0408264%2Ccond-mat%2F0408222%2Ccond-mat%2F0408278%2Ccond-mat%2F0408578%2Ccond-mat%2F0408283%2Ccond-mat%2F0408683%2Ccond-mat%2F0408216%2Ccond-mat%2F0408293%2Ccond-mat%2F0408053%2Ccond-mat%2F0408155%2Ccond-mat%2F0408154%2Ccond-mat%2F0408518%2Ccond-mat%2F0408221%2Ccond-mat%2F0408407%2Ccond-mat%2F0408414%2Ccond-mat%2F0408030%2Ccond-mat%2F0408094%2Ccond-mat%2F0408096%2Ccond-mat%2F0408650%2Ccond-mat%2F0408534%2Ccond-mat%2F0408111%2Ccond-mat%2F0408508%2Ccond-mat%2F0408253%2Ccond-mat%2F0408136%2Ccond-mat%2F0408067%2Ccond-mat%2F0408665%2Ccond-mat%2F0408332%2Ccond-mat%2F0408148%2Ccond-mat%2F0408147%2Ccond-mat%2F0408228%2Ccond-mat%2F0408658%2Ccond-mat%2F0408282%2Ccond-mat%2F0408059%2Ccond-mat%2F0408089%2Ccond-mat%2F0408214%2Ccond-mat%2F0408165%2Ccond-mat%2F0408662%2Ccond-mat%2F0408190%2Ccond-mat%2F0408314%2Ccond-mat%2F0408595%2Ccond-mat%2F0408252%2Ccond-mat%2F0408484%2Ccond-mat%2F0408669%2Ccond-mat%2F0408175%2Ccond-mat%2F0408013%2Ccond-mat%2F0408247%2Ccond-mat%2F0408428%2Ccond-mat%2F0408206%2Ccond-mat%2F0408628%2Ccond-mat%2F0408071%2Ccond-mat%2F0408397%2Ccond-mat%2F0408120%2Ccond-mat%2F0408074%2Ccond-mat%2F0408689%2Ccond-mat%2F0408507%2Ccond-mat%2F0408326%2Ccond-mat%2F0408366%2Ccond-mat%2F0408362%2Ccond-mat%2F0408028%2Ccond-mat%2F0408510%2Ccond-mat%2F0601191%2Ccond-mat%2F0601417%2Ccond-mat%2F0601045%2Ccond-mat%2F0601037%2Ccond-mat%2F0601291%2Ccond-mat%2F0601025%2Ccond-mat%2F0601685%2Ccond-mat%2F0601347%2Ccond-mat%2F0601584%2Ccond-mat%2F0601288%2Ccond-mat%2F0601472%2Ccond-mat%2F0601412%2Ccond-mat%2F0601648%2Ccond-mat%2F0601333%2Ccond-mat%2F0601704%2Ccond-mat%2F0601703%2Ccond-mat%2F0601095%2Ccond-mat%2F0601582&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the properties of steady states in turbulent axisymmetric flows"}, "summary": "We experimentally study the properties of mean and most probable velocity\nfields in a turbulent von K\\'arm\\'an flow. These fields are found to be\ndescribed by two families of functions, as predicted by a recent statistical\nmechanics study of 3D axisymmetric flows. We show that these functions depend\non the viscosity and on the forcing. Furthermore, when the Reynolds number is\nincreased, we exhibit a tendency for Beltramization of the flow, i.e. a\nvelocity-vorticity alignment. This result provides a first experimental\nevidence of nonlinearity depletion in non-homogeneous non-isotropic turbulent\nflow.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0408070%2Ccond-mat%2F0408266%2Ccond-mat%2F0408095%2Ccond-mat%2F0408505%2Ccond-mat%2F0408188%2Ccond-mat%2F0408466%2Ccond-mat%2F0408592%2Ccond-mat%2F0408149%2Ccond-mat%2F0408377%2Ccond-mat%2F0408488%2Ccond-mat%2F0408301%2Ccond-mat%2F0408086%2Ccond-mat%2F0408489%2Ccond-mat%2F0408130%2Ccond-mat%2F0408636%2Ccond-mat%2F0408129%2Ccond-mat%2F0408411%2Ccond-mat%2F0408588%2Ccond-mat%2F0408654%2Ccond-mat%2F0408248%2Ccond-mat%2F0408328%2Ccond-mat%2F0408302%2Ccond-mat%2F0408402%2Ccond-mat%2F0408264%2Ccond-mat%2F0408222%2Ccond-mat%2F0408278%2Ccond-mat%2F0408578%2Ccond-mat%2F0408283%2Ccond-mat%2F0408683%2Ccond-mat%2F0408216%2Ccond-mat%2F0408293%2Ccond-mat%2F0408053%2Ccond-mat%2F0408155%2Ccond-mat%2F0408154%2Ccond-mat%2F0408518%2Ccond-mat%2F0408221%2Ccond-mat%2F0408407%2Ccond-mat%2F0408414%2Ccond-mat%2F0408030%2Ccond-mat%2F0408094%2Ccond-mat%2F0408096%2Ccond-mat%2F0408650%2Ccond-mat%2F0408534%2Ccond-mat%2F0408111%2Ccond-mat%2F0408508%2Ccond-mat%2F0408253%2Ccond-mat%2F0408136%2Ccond-mat%2F0408067%2Ccond-mat%2F0408665%2Ccond-mat%2F0408332%2Ccond-mat%2F0408148%2Ccond-mat%2F0408147%2Ccond-mat%2F0408228%2Ccond-mat%2F0408658%2Ccond-mat%2F0408282%2Ccond-mat%2F0408059%2Ccond-mat%2F0408089%2Ccond-mat%2F0408214%2Ccond-mat%2F0408165%2Ccond-mat%2F0408662%2Ccond-mat%2F0408190%2Ccond-mat%2F0408314%2Ccond-mat%2F0408595%2Ccond-mat%2F0408252%2Ccond-mat%2F0408484%2Ccond-mat%2F0408669%2Ccond-mat%2F0408175%2Ccond-mat%2F0408013%2Ccond-mat%2F0408247%2Ccond-mat%2F0408428%2Ccond-mat%2F0408206%2Ccond-mat%2F0408628%2Ccond-mat%2F0408071%2Ccond-mat%2F0408397%2Ccond-mat%2F0408120%2Ccond-mat%2F0408074%2Ccond-mat%2F0408689%2Ccond-mat%2F0408507%2Ccond-mat%2F0408326%2Ccond-mat%2F0408366%2Ccond-mat%2F0408362%2Ccond-mat%2F0408028%2Ccond-mat%2F0408510%2Ccond-mat%2F0601191%2Ccond-mat%2F0601417%2Ccond-mat%2F0601045%2Ccond-mat%2F0601037%2Ccond-mat%2F0601291%2Ccond-mat%2F0601025%2Ccond-mat%2F0601685%2Ccond-mat%2F0601347%2Ccond-mat%2F0601584%2Ccond-mat%2F0601288%2Ccond-mat%2F0601472%2Ccond-mat%2F0601412%2Ccond-mat%2F0601648%2Ccond-mat%2F0601333%2Ccond-mat%2F0601704%2Ccond-mat%2F0601703%2Ccond-mat%2F0601095%2Ccond-mat%2F0601582&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We experimentally study the properties of mean and most probable velocity\nfields in a turbulent von K\\'arm\\'an flow. These fields are found to be\ndescribed by two families of functions, as predicted by a recent statistical\nmechanics study of 3D axisymmetric flows. We show that these functions depend\non the viscosity and on the forcing. Furthermore, when the Reynolds number is\nincreased, we exhibit a tendency for Beltramization of the flow, i.e. a\nvelocity-vorticity alignment. This result provides a first experimental\nevidence of nonlinearity depletion in non-homogeneous non-isotropic turbulent\nflow."}, "authors": ["R. Monchaux", "F. Ravelet", "B. Dubrulle", "A. Chiffaudel", "F. Daviaud"], "author_detail": {"name": "F. Daviaud"}, "author": "F. Daviaud", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.96.124502", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0601582v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0601582v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "latex prl-stationary-051215arxiv.tex, 9 files, 6 figures, 4 pages\n  (http://www-drecam.cea.fr/spec/articles/S06/008/)", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0601582v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0601582v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.96.124502", "fulltext": "On the properties of steady states in turbulent axisymmetric flows\nR. Monchaux,∗ F. Ravelet, B. Dubrulle, A. Chiffaudel, and F. Daviaud\n\narXiv:cond-mat/0601582v1 [cond-mat.stat-mech] 25 Jan 2006\n\nService de Physique de l'État Condensé, DSM, CEA Saclay, CNRS URA 2464, 91191 Gif-sur-Yvette, France\n(Dated: July 1, 2018)\nWe experimentally study the properties of mean and most probable velocity fields in a turbulent\nvon Kármán flow. These fields are found to be described by two families of functions, as predicted\nby a recent statistical mechanics study of 3D axisymmetric flows. We show that these functions\ndepend on the viscosity and on the forcing. Furthermore, when the Reynolds number is increased,\nwe exhibit a tendency for Beltramization of the flow, i.e. a velocity-vorticity alignment. This result\nprovides a first experimental evidence of nonlinearity depletion in non-homogeneous non-isotropic\nturbulent flow.\nPACS numbers: 47.27.eb, 47.32.Ef, 05.70.Ln\n\nIntroduction A yet unanswered question in statistical\nphysics is whether stationary out-of-equilibrium systems\nshare any resemblance with classical equilibrium systems.\nA good paradigm to explore this question is offered by\nturbulent flows. Incompressible flows subject to statistically stationary forcing generally reach a steady state,\nin a statistical sense, independent of the initial conditions. Most of the current turbulence modeling is devoted to the understanding of this state, and the role\nof the velocity fluctuations or velocity smallest scales in\nits construction. A distinguished feature of stationary\nlarge Reynolds number turbulent flows is the presence of\ncoherent structures, under the shape of vortices in 2D\n[1, 2], or vorticity thin tubes in 3D [3]. These structures\ncorrespond to regions where vorticity is locally almost\naligned with velocity -phenomenon referred to as Beltramization [4, 5]. This tendency to velocity-vorticity\nalignment induces depletion of nonlinearities in NavierStokes equations. Interestingly enough, similar depletion\nof nonlinearity is also observed in the inviscid counterpart of the Navier-Stokes equation -the so-called Euler\nequation- resulting in a slowing down of the vorticity\nblow-up with respect to rigorous estimates [6]. A theoretical question of interest is therefore whether turbulent\nflows have a natural tendency for nonlinearity depletion,\nand whether this is a characteristic of the steady states.\nThe answer to the first issue is ambiguous. On one\nhand, a tendency for Beltramization has indeed been\nobserved in some numerical simulations of stationary,\nnearly isotropic turbulence [7, 8]. On the other hand,\nsimilar study performed on more general flows -such as\nboundary layer [9]- provided little evidence of such a\nproperty .. A similar conclusion has been reached using\nexperimental data [10], with slightly less reliability owing\nto the difficulty to measure vorticity. As for the second\nissue, it has only been partially explored in special geometries. In 2D, equilibrium states of the Euler equations\nhave been classified through statistical mechanics principle by Robert and his collaborators [11, 12]. They indeed\ncorrespond to Beltrami solution. In 3D axisymmetric\nflows -an intermediate situation between 2D and 3D- a\n\nsimilar task has been undertaken by Leprovost et al. [13].\nIn the ideal case -force free, inviscid- they proved the\nexistence of an infinite number of conserved quantities, in\naddition to the energy and the helicity. They also showed\nthe existence of an infinite number of equilibrium states,\ndepending on the conserved quantities. Among them,\na Beltrami state is obtained, when only the energy and\nthe helicity are conserved. They postulated that even in\nthe presence of small but finite viscosity and forcing [14],\nthis feature remains valid, with selection of steady states\nthrough boundary conditions and forcing.\nThe purpose of the present Letter is to perform an experimental check of these findings. We find that mean\nand most probable velocity fields of axisymmetric flows\ncan indeed be characterized by two families of functions,\nas predicted in Ref. [13]. These functions depend on the\nviscosity and forcing. As the Reynolds number is increased, they evolve towards the functions corresponding\nto a Beltrami state, providing a first evidence of nonlinearity depletion in a non-homogeneous, non-isotropic\nsystem.\nTheoretical background and definitions Consider an\nincompressible axisymmetric flow, with velocity components in a cylindrical referential (vr , vθ , vz ). Due to incompressibility and axisymmetry, only two functions are\nsufficient to describe the flow, namely the angular momentum -σ(r, z) = rvθ - and either, the stream function Ψ(r, z), such that (vr , vz ) = −∇ × Ψeθ , or the azimuthal vorticity ωθ (r, z). Using a variational method,\nLeprovost et al. showed that the steady states solution\nof axisymmetric Euler equations, in the force-free case\nobey:\nFF′\n= G(Ψ); with ξ = ωθ /r, (1)\nr2\nwhere F and G are arbitrary functions linked with conservation laws of the system -Casimirs of σ, generalized\nhelicity [13]. For example, the steady state corresponding to conservation of energy and helicity is such that F\nis linear and G ≡ 0, resulting in a linear relation between\nvorticity and velocity (~v = λ~ω ). This is a Beltrami flow,\ngiven by :\nσ = F (Ψ); ξ −\n\n\f2\n\nπR\nr\nz\nvr = −\nJ1 (m ) cos(π )\nHm\nR\nH\nr\nz\nλR\nJ1 (m ) sin(π )\n(2)\nvθ =\nm\nR\nH\nz\nr\nvz = J0 (m ) sin(π )\nR\nH\nwhere λ and m are free parameters and J0 and J1 are\nfirst order Bessel functions.\nConsidering further the thermodynamics of the system, Leprovost et al. proved that the equilibrium states\nat some fixed coarse-grained scale are such that the most\nprobable velocity flow (mpvf) is a stationary state of the\nEuler equation, i.e. satisfies Eq.(1). Finally, they postulated that these force-free, inviscid results can be extended to the stationary states in the presence of both\nviscosity and forcing, providing the function F and G are\nselected through boundary conditions and forcing.\nExperimental setup In order to check the theoretical\npredictions, we have worked with a simple \"axisymmetric\"configuration: the von Kármán flow generated by two\ncounter-rotating impellers in a cylindrical vessel. The\ncylinder radius and height are respectively R = 100 mm\nand H = 180 mm (distance between inner faces of impellers). The impellers consist of 185 mm diameter disks\nfitted with sixteen 20 mm high curved blades. More\ndetails about the experimental setup can be found in\nRef. [15]. The impellers rotation frequencies are both\nset equal to f to get exact counter-rotating regime. We\ndefine two forcing associated with the concave (resp. convex) face of the blades going forward, denoted in the sequel by direction (−) (resp. (+) ). The working fluid is\neither water or glycerol at different dilution rates. The\nresulting accessible Reynolds numbers (Re = 2πf R2 ν −1\nwith ν the kinematic viscosity) vary from 102 to 3 × 105 .\nIn the exact counter-rotating regime, whatever the impellers, the flow is divided into two toric cells separated\nby an azimuthal shear layer. This setup is invariant under rotations of π (Rπ ) around any radial axis passing\nthrough the center of the cylinder. The time-averaged velocity fields we consider hereafter are Rπ -invariant and\naxisymmetric [15]. Velocity measurements are done with\na DANTEC Laser Doppler Velocimetry (LDV) system.\nData processing The LDV data only provide the axial and azimuthal velocity components on a 170 points\ngrid covering half a meridian plane, through time series\nof about 200,000 randomly sampled values at each grid\npoint. From this time series, it is straightforward to get\ntime-averaged axial and azimuthal velocities. The remaining radial component of the mean velocity field can\nthen be obtained using the incompressibility and axisymmetry: this procedure has been later validated through\ndirect measurements of the radial velocity with a Particles Image Velocimetry (PIV) system on the same flow.\nWe also use the time series to extract at each point histograms of the axial and azimuthal velocity, and compute\n\nthe flow of most probable velocities (fmpv)[16], obtained\nby taking, at each point, the most probable value of the\nvelocity. The vr component is once more derived from the\ntwo other components using continuity equation. Figure 1 compares the two flows computed from the same\ndata set: they have the same overall structure, but differ through the size of the middle shear layer, which is\nthinner in the case of the fmpv. This is due to the fact\nthat the chaotic wandering of the shear layer around its\naverage position are significantly less probable as one considers positions further away from the equatorial plane.\nFrom a theoretical point of view, the two flows differ in\nthe sense that the mean velocity is not a solution of the\nNavier-Stokes or Euler equations -because of the fluctuations, which induce a Reynolds stress, especially in the\nshear layer-, while the mpvf is a stationary solution of\nthe Euler equations. Therefore, one can expect theoritical predictions regarding the structure of the stationary\nstate to be less accurate in the case of the mean flow, as\nthe Reynolds number and the fluctuations increase.\n.9\nz/R\n\n0.5\n\n0\n\n0\n−0.5\n\n−.9\n0\n.9\n\nr/R\n\n1\n\nr/R\n\n0\n\n−1\n\n0.5\n\nz/R\n\n0\n\n0\n\n−0.5\n−.9\n0\n\nr/R\n\n1\n\nr/R\n\n0\n\nFIG. 1: Velocity profile for Re = 2.5 × 105 , direction (−): colored contour for azimuthal component, arrow representation\nfor poloidal part. Top: fmpv. Bottom: time-averaged flow.\n\nWe first compute the F function by looking at σ as a\nfunction of Ψ, and then, we use this estimate to evaluate\n′\nG, by looking at ξ2 = ξ − FrF2 as a function of Ψ. This\nprocedure is likely to induce a lot of noise in the estimate\nof G. To check its robustness, we have tested it on a\nBeltrami flow (Eq. 2) with a superimposed level of noise\ncomparable to the level of fluctuations in the flow (see\nFigure 2). Even in the presence of noise the fits give the\ncorrect shapes: F = λΨ and G ≡ 0.\nAfter this test, we apply this procedure on the real\ndata, with a further correction, motivated by the following remark. Figure 3 displays two typical plot of F : one\nover the whole apparatus, and one over a 50% portion of\nthe flow obtained after removing regions close to the im-\n\n\f3\n.4\n\n1\n\nσ\n\nξ /ξ\n2\n\n.2\n\n.5\n\n0\n\n0\n\n.2\n\nmax\n\n−.5\n\n−.4\n−.1\n\nΨ / Ψmax\n\nΨ\n.05\n\n0\n\n−1\n.1 −1\n\n.05\n\n−.5\n\n0\n\n.5\n\n1\n\nFF′\nr2\n\nversus Ψ for the Beltrami flow\nFIG. 2: σ and ξ2 = ξ −\ndefined by equation (2) with a superimposed white noise of\namplitude 60%. We have represented the F (resp. G) fit on\nthe left (resp. right) figure.\n\npellers and along the vessel. These parts correspond to\nlocations where the viscosity and the forcing (neglected\nin Ref. [13]) are principally at work, and larger deviations from theoretical predictions can be expected. One\nsees that while data on the whole vessel display significant scatter, preventing the outcome of a well-defined F ,\nthe restricted data gather onto a cubic-shaped function\nfitted by a two parameters cubic: F (Ψ) = p1 Ψ + p3 Ψ3 .\nThis fit is then used to obtain G. In the sequel, we obtain\nF and G through fits over this 50% portion of the flow\naway from the boundaries.\n.5 σ\n\nσ\n\nsimilarly. As Reynolds number increases, the F cubic\ncurves collapse on the Beltrami line.\nAt Re = 2.5 × 105 , it is not even possible to distinguish the F fit from a straight line and this for the two\ndirections of rotation. In the case of G, there is a difference between the two cases. For the fmpv, the best fit\nis linear, with a slope smaller than the noise level, this\nis consistent with G ≡ 0. For the time-averaged case,\nthe shape of G is very different. All the fits present a\nplateau around zero. The greater the Reynolds number,\nthe wider this plateau, so the wider the range of Ψ -\nor equivalently the volume of considered flow- where G\nis very close to zero, i.e., very close to the Beltrami G\nfunction.\nThe difference in the shape of G can be explained as\nfollows : according to equation (1), G(Ψ) is the difference\nof two terms. One linked to F is necessarily a cubic,\nwhile the second, connected to the azimuthal vorticity is\nalmost a noise in this area of the flow. In the fmpv case,\nthe magnitude of the cubic term is small compared to\nthe vorticity, and we only see the noise coming from the\nvorticity. In the time-averaged case, the cubic is much\nlarger, so that it determines the behavior of G.\n.4\n\n0\n\nF(Ψ)\n\n(a)\n\nfmpv (−)\n\n.2\n\nΨ\n\n−.5\n−0.04\n\n0\n\n0.04\n\n0\n\n0.04\n\nFIG. 3: σ vs Ψ for experimental time-averaged flow in direction (+) at Re = 2100. Left: for the whole flow. Right: for\nr ≤ 0.81, −0.56 ≤ z ≤ 0.56, corresponding to 50% of the flow\nvolume. The remaining points are clearly gathering along a\ncubic-shaped function F .\n\nResults We present results computed for both timeaveraged flow and fmpv for the two directions of rotation,\nat different Reynolds numbers. Figure 4 presents the F\nfits obtained in each case. We have included on each\ngraph a straight line tangent to experimental curves for\nΨ = 0 as a reference to a Beltrami flow. The experimental data are much more scattered in the fmpv case,\ndebasing the fit accuracy compared to the mean flow -\nR2 ≃ 0.94 instead of 0.99.\nIn figure 5 we present the G fits obtained in the same\nconditions. The best fit of the fmpv G functions is linear whereas cubic-shaped functions are required for time\naveraged G. The plots of G consist of wide noisy bands\nsurrounding the fits in both cases. The noise for G is\nlarger than for F , since it is a result of a two-step procedure including a spatial derivation.\nConsidering the variation with Reynolds number of F ,\nboth the fmpv case and the time-averaged case behave\n\n0\n.4\n\nΨ\nF(Ψ)\n\n(c)\n\ntime−av. (−)\n\n.2\n\n0\n0\n\nF(Ψ)\n\nfmpv (+)\n\n(b)\n\n.4\n\nΨ\n−0.04\n\n.8\n\nΨ\n\n0\n.4\n\nF(Ψ)\n\ntime−av. (+)\n\n(d)\n\n.2\n\nΨ\n0.02\n\n0.04\n\n0\n0\n\n0.05\n\nΨ\n0.1\n\nFIG. 4: F fit. (a) and (b): fmpv direction (−) and (+) respectively, (c) and (d): time-averaged field direction (−) and (+)\nrespectively. Legend for all figures: Re = 100 (thin ***), Re =\n150 (thin * −*), Re = 2100 (thin − −), Re = 9100 (thin -),\nRe = 2.5 × 105 (thick -). The thin dotted straight line is\na Beltrami. As F is odd, we display it for positive values of\nΨ only. Note that the fit at Re = 9100 for fmpv case in direction (+) could not be obtained from the data due to large\nscattering.\n\nA second observation is the dependence of F and G\non the forcing. Comparison of Fig. 4-(a,c) and 4-(b,d),\nobtained for two different forcing, shows that the slope\nof F slightly depends on the forcing (p1 = 5 for (−)\ndirection, p1 = 4 for (+) direction). For any forcing, G\nremains close to zero at the measurement scale. To check\n\n\f4\n1 G(Ψ)\n\n(a)\n\nfmpv (−)\n\nG(Ψ)\n\n(b)\n\nfmpv (+)\n\n.5\n0\n−.5\n\nΨ\n\n−1\n1 G(Ψ)\n\ntime−av. (−)\n\n(c)\n\nΨ\nG(Ψ)\n\n(d)\n\ntime−av. (+)\n\n.5\n0\n\nFinally, we have shown that the evolution for increasing Reynolds number is towards a Beltrami state, with\ndepletion of nonlinearities. This evolution is more obvious when considering the fmpv, as expected from the\nthermodynamics analysis developed by Leprovost et al..\nTo our knowledge, this is the first experimental evidence\nof nonlinearity depletion in a non-homogeneous, nonisotropic turbulence, where it is very challenging to measure simultaneously all components of velocity and vorticity. Our use of the functions characterizing the steady\nstates enables us to lower the experimental constraints\nfor such a check.\n\n−.5\n\nΨ\n\n−1\n−0.05\n\n0\n\n0.05 −0.1\n\nΨ\n−0.05\n\n0\n\n0.05\n\n0.1\n\nFIG. 5: G fit. (a) and (b): fmpv direction (−) and (+) respectively, c and d: time-averaged field direction (−) and (+)\nrespectively. Same legend as Fig. 4.\n\nthis dependence further, we have conducted an additional\nexperiment at high Reynolds number, with much smaller\nimpellers. As shown in Figure 6, we obtained a different\nshape for F , with a different inflection.\nDiscussion and perspectives An inviscid force-free\ntheory developed by Leprovost et al. predicted a characterization of the steady state in axisymmetric turbulent\nflows through two functions F and G. In our experiments, we have confirmed this, and measured these functions for different forcing, and different viscosities, using\ntwo different fields as diagnostic: the fmpv as predicted\nand more surprisingly the time-averaged field, even in a\nregion where Reynolds stresses are not negligible. This\ncould be due to the quasi Gaussian distributions of velocities.\nFirst, we have observed that the functions are welldefined only in the portion of the flow remote from the\nboundaries, where forcing and dissipation take place.\nThe steady states of the von Kármán flow can be described by a suitable statistical analysis of equivalent\nequilibrium states (e.g. assuming zero viscosity and no\nforcing, as in Ref. [13]). Nevertheless, we have seen\nthat forcing and dissipation do influence the steady state\nregime through the selection of the characteristic functions. Specifically, we have observed that the forcing selects the specific shape of the functions (linear, cubic, ...),\nwhile dissipation acts as a sort of self-similar zoom and select the portion of the curve actually explored by the flow.\nThis suggests that stationary out-of-equilibrium systems\nlike turbulent flows are universal in a weaker sense than\nin ordinary equilibrium systems : they can be described\nin a universal manner through general functions (like F\nand G) determining the \"equation of state\". However,\nthese functions are non-universal since they depend on\nthe fine details of the system (dissipation and forcing).\n\nF(Ψ)\n\nF(Ψ)\n\nfmpv\n\n.2\n\n.2\n\n.1\n\n.1\n\n0\n0\n\nΨ\n0.025\n\n0.05\n\n0\n0\n\ntime−av.\n\nΨ\n0.025\n\n0.05\n\nFIG. 6: F fit for 100mm diameter impellers fitted with\nstraight blades. Left: fmpv, Right: time-averaged. Re =\n1.9 × 105 (* * *), Re = 2.6 × 105 (−−), Re = 5 × 105 (-).\n\n∗\nElectronic address: romain.monchaux@cea.fr\n[1] C. Basdevant, B. Legras, R. Sadourny, and M. Béland,\nJ. Atm. Sci. 38, 2305 (1981).\n[2] J. C. McWilliams, J. Fluid Mech. 219, 361 (1990).\n[3] A. Vincent and M. Meneguzzi, J. Fluid Mech. 225, 1\n(1991).\n[4] R. Benzi et al., J. Phys. A Math. Gen. 19, 3771 (1986).\n[5] M. Farge et al., Phys. Fluids 15, 2886 (2003).\n[6] P. Constantin and C. Fefferman, Indiana Univ. Math. J.\n42, 775 (1993).\n[7] E. D. Siggia and G. S. Patterson, J. Fluid Mech. 86, 567\n(1978).\n[8] R. B. Pelz, V. Yakhot, and S. A. Orszag, Phys. Rev. Lett.\n54, 2505 (1985).\n[9] M. M. Rogers and P. Moin, Phys. Fluids 30, 2662 (1987).\n[10] J. M. Wallace, J.-L. Balint, and L. Ong, Phys. Fluids A\n4, 2013 (1992).\n[11] J. Sommeria and R. Robert, J. Fluid Mech. 229, 291\n(1991).\n[12] P. H. Chavanis, Phys. Rev. E 68, 036108 (2003).\n[13] N. Leprovost, B. Dubrulle and P.H. Chavanis, arXiv:\nphysics/0505084 to be published in PRE.\n[14] Considering ν = 0 and ν → 0 limit is different.\n[15] F. Ravelet, L. Marié, A. Chiffaudel, and F. Daviaud,\nPhys. Rev. Lett. 93, 164501 (2004).\n[16] A priori, fmpv and mpvf are different. Experimentation\nonly gives access to fmpv. Nevertheless, both may be\nquite similar if the velocity pdf at each point shows a\nwell defined peak.\n\n\f"}