{"id": "http://arxiv.org/abs/cond-mat/0602337v1", "guidislink": true, "updated": "2006-02-14T17:27:24Z", "updated_parsed": [2006, 2, 14, 17, 27, 24, 1, 45, 0], "published": "2006-02-14T17:27:24Z", "published_parsed": [2006, 2, 14, 17, 27, 24, 1, 45, 0], "title": "Discrete Scale Invariance in Scale Free Graphs", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0602547%2Ccond-mat%2F0602002%2Ccond-mat%2F0602131%2Ccond-mat%2F0602046%2Ccond-mat%2F0602426%2Ccond-mat%2F0602238%2Ccond-mat%2F0602334%2Ccond-mat%2F0602650%2Ccond-mat%2F0602344%2Ccond-mat%2F0602236%2Ccond-mat%2F0602352%2Ccond-mat%2F0602284%2Ccond-mat%2F0602159%2Ccond-mat%2F0602230%2Ccond-mat%2F0602590%2Ccond-mat%2F0602145%2Ccond-mat%2F0602116%2Ccond-mat%2F0602383%2Ccond-mat%2F0602281%2Ccond-mat%2F0602435%2Ccond-mat%2F0602471%2Ccond-mat%2F0602258%2Ccond-mat%2F0602173%2Ccond-mat%2F0602466%2Ccond-mat%2F0602574%2Ccond-mat%2F0602303%2Ccond-mat%2F0602623%2Ccond-mat%2F0602049%2Ccond-mat%2F0602279%2Ccond-mat%2F0602337%2Ccond-mat%2F0602362%2Ccond-mat%2F0602571%2Ccond-mat%2F0602515%2Ccond-mat%2F0602660%2Ccond-mat%2F0602233%2Ccond-mat%2F0602606%2Ccond-mat%2F0602661%2Ccond-mat%2F0602384%2Ccond-mat%2F0602293%2Ccond-mat%2F0602182%2Ccond-mat%2F0602428%2Ccond-mat%2F0602048%2Ccond-mat%2F0602066%2Ccond-mat%2F0602263%2Ccond-mat%2F0602360%2Ccond-mat%2F0602204%2Ccond-mat%2F0602108%2Ccond-mat%2F0602377%2Ccond-mat%2F0602178%2Ccond-mat%2F0602271%2Ccond-mat%2F0602261%2Ccond-mat%2F0602465%2Ccond-mat%2F0602432%2Ccond-mat%2F0602361%2Ccond-mat%2F0602184%2Ccond-mat%2F0602231%2Ccond-mat%2F0602245%2Ccond-mat%2F0602064%2Ccond-mat%2F0602646%2Ccond-mat%2F0602414%2Ccond-mat%2F0602024%2Ccond-mat%2F0602156%2Ccond-mat%2F0602167%2Ccond-mat%2F0602519%2Ccond-mat%2F0602363%2Ccond-mat%2F0602385%2Ccond-mat%2F0602338%2Ccond-mat%2F0602153%2Ccond-mat%2F0602566%2Ccond-mat%2F0602268%2Ccond-mat%2F0602070%2Ccond-mat%2F0602158%2Ccond-mat%2F0602470%2Ccond-mat%2F0602146%2Ccond-mat%2F0602474%2Ccond-mat%2F0602276%2Ccond-mat%2F0602033%2Ccond-mat%2F0602461%2Ccond-mat%2F0602059%2Ccond-mat%2F0602520%2Ccond-mat%2F0602120%2Ccond-mat%2F0602674%2Ccond-mat%2F0602638%2Ccond-mat%2F0602292%2Ccond-mat%2F0602324%2Ccond-mat%2F0602454%2Ccond-mat%2F0602186%2Ccond-mat%2F0602416%2Ccond-mat%2F0602578%2Ccond-mat%2F0602597%2Ccond-mat%2F0602154%2Ccond-mat%2F0602141%2Ccond-mat%2F0602163%2Ccond-mat%2F0602368%2Ccond-mat%2F0602521%2Ccond-mat%2F0602003%2Ccond-mat%2F0602175%2Ccond-mat%2F0602091%2Ccond-mat%2F0602061%2Ccond-mat%2F0602625%2Ccond-mat%2F0602068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Discrete Scale Invariance in Scale Free Graphs"}, "summary": "In this work we introduce an energy function in order to study finite scale\nfree graphs generated with different models. The energy distribution has a\nfractal pattern and presents log periodic oscillations for high energies. This\noscillations are related to a discrete scale invariance of certain graphs, that\nis, there are preferred scaling ratios suggesting a hierarchical distribution\nof node degrees. On the other hand, small energies correspond to graphs with\nevenly distributed degrees.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0602547%2Ccond-mat%2F0602002%2Ccond-mat%2F0602131%2Ccond-mat%2F0602046%2Ccond-mat%2F0602426%2Ccond-mat%2F0602238%2Ccond-mat%2F0602334%2Ccond-mat%2F0602650%2Ccond-mat%2F0602344%2Ccond-mat%2F0602236%2Ccond-mat%2F0602352%2Ccond-mat%2F0602284%2Ccond-mat%2F0602159%2Ccond-mat%2F0602230%2Ccond-mat%2F0602590%2Ccond-mat%2F0602145%2Ccond-mat%2F0602116%2Ccond-mat%2F0602383%2Ccond-mat%2F0602281%2Ccond-mat%2F0602435%2Ccond-mat%2F0602471%2Ccond-mat%2F0602258%2Ccond-mat%2F0602173%2Ccond-mat%2F0602466%2Ccond-mat%2F0602574%2Ccond-mat%2F0602303%2Ccond-mat%2F0602623%2Ccond-mat%2F0602049%2Ccond-mat%2F0602279%2Ccond-mat%2F0602337%2Ccond-mat%2F0602362%2Ccond-mat%2F0602571%2Ccond-mat%2F0602515%2Ccond-mat%2F0602660%2Ccond-mat%2F0602233%2Ccond-mat%2F0602606%2Ccond-mat%2F0602661%2Ccond-mat%2F0602384%2Ccond-mat%2F0602293%2Ccond-mat%2F0602182%2Ccond-mat%2F0602428%2Ccond-mat%2F0602048%2Ccond-mat%2F0602066%2Ccond-mat%2F0602263%2Ccond-mat%2F0602360%2Ccond-mat%2F0602204%2Ccond-mat%2F0602108%2Ccond-mat%2F0602377%2Ccond-mat%2F0602178%2Ccond-mat%2F0602271%2Ccond-mat%2F0602261%2Ccond-mat%2F0602465%2Ccond-mat%2F0602432%2Ccond-mat%2F0602361%2Ccond-mat%2F0602184%2Ccond-mat%2F0602231%2Ccond-mat%2F0602245%2Ccond-mat%2F0602064%2Ccond-mat%2F0602646%2Ccond-mat%2F0602414%2Ccond-mat%2F0602024%2Ccond-mat%2F0602156%2Ccond-mat%2F0602167%2Ccond-mat%2F0602519%2Ccond-mat%2F0602363%2Ccond-mat%2F0602385%2Ccond-mat%2F0602338%2Ccond-mat%2F0602153%2Ccond-mat%2F0602566%2Ccond-mat%2F0602268%2Ccond-mat%2F0602070%2Ccond-mat%2F0602158%2Ccond-mat%2F0602470%2Ccond-mat%2F0602146%2Ccond-mat%2F0602474%2Ccond-mat%2F0602276%2Ccond-mat%2F0602033%2Ccond-mat%2F0602461%2Ccond-mat%2F0602059%2Ccond-mat%2F0602520%2Ccond-mat%2F0602120%2Ccond-mat%2F0602674%2Ccond-mat%2F0602638%2Ccond-mat%2F0602292%2Ccond-mat%2F0602324%2Ccond-mat%2F0602454%2Ccond-mat%2F0602186%2Ccond-mat%2F0602416%2Ccond-mat%2F0602578%2Ccond-mat%2F0602597%2Ccond-mat%2F0602154%2Ccond-mat%2F0602141%2Ccond-mat%2F0602163%2Ccond-mat%2F0602368%2Ccond-mat%2F0602521%2Ccond-mat%2F0602003%2Ccond-mat%2F0602175%2Ccond-mat%2F0602091%2Ccond-mat%2F0602061%2Ccond-mat%2F0602625%2Ccond-mat%2F0602068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this work we introduce an energy function in order to study finite scale\nfree graphs generated with different models. The energy distribution has a\nfractal pattern and presents log periodic oscillations for high energies. This\noscillations are related to a discrete scale invariance of certain graphs, that\nis, there are preferred scaling ratios suggesting a hierarchical distribution\nof node degrees. On the other hand, small energies correspond to graphs with\nevenly distributed degrees."}, "authors": ["Matías Graña", "Juan Pablo Pinasco"], "author_detail": {"name": "Juan Pablo Pinasco"}, "author": "Juan Pablo Pinasco", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physa.2007.02.047", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0602337v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0602337v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 12 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0602337v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0602337v1", "journal_reference": null, "doi": "10.1016/j.physa.2007.02.047", "fulltext": "arXiv:cond-mat/0602337v1 [cond-mat.dis-nn] 14 Feb 2006\n\nDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\nAbstract. In this work we introduce an energy function in order to study finite scale free graphs generated with different models. The energy distribution\nhas a fractal pattern and presents log periodic oscillations for high energies.\nThis oscillations are related to a discrete scale invariance of certain graphs,\nthat is, there are preferred scaling ratios suggesting a hierarchical distribution\nof node degrees. On the other hand, small energies correspond to graphs with\nevenly distributed degrees.\n\n1. Introduction\nIn the last few years a huge amount of research on graphs has been achieved\nin physics and mathematics, mainly due to the increasing importance of complex\nnetworks like the Internet and the World Wide Web, and the role of social networks\nin the propagation of diseases, infections, rumors and news, in both real and virtual\nenvironments such as populations or web-based communities.\nDespite the different origins, methods and perspectives in those works, certain\nconcepts appeared and pervaded the network literature, like small worlds, clustering, centrality, scale free degree distribution, and preferential attachment, among\nothers, [1], [2], [3]. They suggest that simple underlying mechanisms could describe\nand explain the network growth and their emerging properties. To this end, several\nnetworks based on real data were analyzed (see [4], [5] and the references therein),\nand many theoretical models of network growth were proposed (see Table 3 in [2]).\nAlso, there are still many questions and problems which remain unanswered.\nPerhaps the main one is the origin of the power law degree distribution of nodes\nin real networks. This distribution seems to be observed in several real networks\n(although some criticism appeared in the last year, [6], [7], [8]). Roughly speaking,\nthe power law distribution says that the number of nodes in a graph with k links\nfor k > k0 has a decay proportional to k −α , for certain α > 1. Several theoretical\nmodels were proposed to explain this phenomenon. Among them, let us mention\npreferential attachment of Barabasi and Albert [9], edge redirection of Krapivsky\nand Redner [10], and attachment to edges of Dorogovtsev, Mendes and Samukhin\n[11].\nAlthough much attention was paid in the theoretical literature in the thermodynamical limit (when time and number of nodes tend to ∞) in these models, not\ntoo much is known for graphs with a bound in their size ([11] being an interesting\nexception). Indeed, many of the computer-based simulations tend to concentrate\non large graphs, while small ones usually get ignored. Yet, real networks are finite, and in many cases they are very small (like networks of metabolic reactions,\nMG is partially supported by Fundación Antorchas and CONICET.\nJPP is partially supported by Fundación Antorchas and ANPCyT.\n1\n\n\f2\n\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\n\nproteins interactions, digital electronic circuits, sexual interactions or food webs).\nOur intention in this paper is to concentrate on these small graphs. Specifically, we\nconcentrated on graphs with a number of nodes ranging from 50 to 100,000. On\nthe other hand, we were able to generate large amounts of graphs for each model,\nwhich reduced the noise and statistical fluctuations, and helped see some otherwise\nhidden properties.\nAnother question, which motivates our research, was the discrimination among\nthe different graphs generated from these models and the analysis of their properties. We may consider this question as a basic one concerning the internal topology\nof the network, and the quality of their connections. Let us note that different networks with the same node distribution respond in distinct ways to edges or nodes\nremoval depending on the connectivity between hubs, that is, if the nodes with high\nnumber of links are connected or not between them. This question was considered\nby Newman in [12], who coined the term assortativity in order to describe this\nphenomenon.\nIn order to study this question, we introduce the linking energy of a graph G,\ndefined as\nX\nE2 (G) =\n|d(x) − d(y)|2 ,\nx∼y\n\nwhere d(x) is the degree of the node x, i.e., its number of links, and the sum runs\nover the pairs of connected nodes.\nOur original intention was to compute the expected linking energy for certain\nscale-free network generating models, which enabled us to classify the graphs generated for each models as either assortative or not. One of the first observations, was\nthat the underlying mechanism responsible of networks generation in each model\ncould generate both assortative and non-assortative networks. Another interesting\nfact is the correlation of the assortativity and the linking energy E2 , and the fractal\nstructure of this correlation. These results will be published in a separated work.\nHowever, we also obtained an unexpected result when we computed E2 for the\nmodels mentioned above, since the distribution of energies presents log-periodic\noscillations in the tail. This oscillatory behavior is more apparent and becomes\namplified within models which tend to produce a low number of highly connected\nhubs. The oscillatory behavior is not present for random or regular graphs, even\nwhen they are small.\nSurprisingly, this shed some light on the first problem, the node distribution.\nThe presence of log-periodic oscillations is associated to fractal complex dimensions, which are due to discrete scale invariance instead of a scale free similarity\n([13], [14]). Indeed, this suggests a stronger order in the networks other than that\npredicted by the scale free models, since fractal complex dimensions are related\nto (mathematical) self similar fractals such as the triadic Cantor set. Hence, we\nmay classify the graphs generated with any of those models as continuous or lacunary scale free. A similar dichotomy is present for fractals generated with iterated\nfunctions systems [15].\nWe conjecture that the nodes distribution itself must also exhibit the oscillations.\nFurther work is required to settle this question. However, several real networks that\nappeared in the literature seem to show such oscillations, like the World Trade Web\n[16], or web-based communities (see Fig. 1, 5 and 8 in [17]). Also, two theoretical\nmodels of networks without growth were recently proposed in [18] and [19], where\n\n\fDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\n\n3\n\noscillations are apparent. The existence of oscillations on the degree distribution\nwas related to the existence of different hierarchies among the nodes of the graph,\nsee [20], [21] where theoretical models were proposed to study this kind of networks.\nHence, our results show that classical models based on preferential attachment or\nedge redirection can be used to generate non homogeneous networks.\n\n2. Main Results\n2.1. The linking energy. Let G be any graph, and let us denote x ∼ y whenever\nthere exists a link between the nodes x and y. Let d(x) be the degree of x, that is,\nthe number of links attached to x.\nWe define the linking energy of G as\nX\nE2 (G) =\n|d(x) − d(y)|2 .\nx∼y\n\nThis is a discrete version of the energy which arises for the tension of a system of\nstrings attached at the nodes, with heights proportional to the number of connections. For regular networks, it coincides with the variational form of the Dirichlet\nenergy of a discrete Laplacian.\nLet us note that the energy spectra for graphs with N nodes is finite. For a tree\non N nodes, the maximum value of the energy is attained for the central tree where\nall the nodes are connected to one of them, with an energy of\n(N − 1)(N − 2)2 ∼ N 3 .\nLet us note as well that the energy is an even number:\nX\nX\nX\nX\nX\nE2 (G) ≡\ndx − dy ≡\ndx + dy =\nd2x ≡\ndx =\n2≡0\nx∼y\n\nx∼y\n\nx\n\nx\n\n(mod 2)\n\nx∼y\n\nFor regular lattices, such as the triangular, square or hexagonal lattice, this\nenergy is proportional to the number of boundary nodes, since the degree is the\nsame for all the internal nodes. Also, a random (Erdős-Renyi) graph has lower\nenergy than a scale free one due to the small number of hubs in it.\nFor networks with power law degree distribution, this degree sequence is not\nenough to characterize several topological and dynamical properties. Graphs with\nthe same degree sequence behave differently, depending on whether or not the hubs\nare connected among them, a problem considered by Newman who introduced the\nassortativity to measure the connectivity between hubs. The linking energy could\nbe used in order to study this problem.\n2.2. E2 in a random (Erdős-Renyi) graph. Let G be a graph in the ErdősRenyi model, with d nodes. Here, two nodes connect each other with probability\np. Let us fix an order for the nodes, say x1 , * * * , xd , and for 1 ≤ i < j ≤ d let\nXij = #{k ∼ i, k 6= j} and let Yij = #{k ∼ j, k 6= i}. In other words, Xij is the\ndegree of the node i disregarding a possible connection to node j, and similarly for\nYij . Then, Xij and Yij are binomial, with probability\n\u0012\n\u0013\nd−2 k\np(Xij = k) = p(Xjj = k) =\np (1 − p)d−2−k .\nk\n\n\f4\n\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\n\nThus, the mean and the variance are given by\n< Xij >= p(d − 2),\n=<\n> − < Xij >2 = (d − 2)p(1 − p).\nFurthermore, the variables Xij and Yij are independent. Hence,\n2\nσX\nij\n\n2\nXij\n\n2\n< (Xij − Yij )2 > = 2 < Xij\n> −2 < Xij >2\n\n= 2(d − 2)p(1 − p).\nNow, the mean value of E2 is given by\nX\np < (Xij − Yij )2 >\n< E2 > =\ni<j\n\n\u0012 \u0013\nd\n=\np * 2(d − 2)p(1 − p)\n2\n= d(d − 1)(d − 2)p2 (1 − p).\nFor other models of graphs, the distribution of energies gives better information\nthan the mean value of E2 .\n2.3. Models of graph generation. We explain now the studied models. All of\nthem consist of the following steps:\n• One begins with a fixed seed of nodes and links.\n• At each step, a new node is added to the graph, and\n• a fixed number of links emanate from the new node to the existing ones.\nThese models differ in the way the targets for the new nodes are chosen. We\nconsidered the following models:\nBA Preferential attachment (or linear P.A.): one target node is selected at\nrandom, with a probability proportional to the degree of the nodes.\nKR Edge redirection: one target node is selected at random with uniform\nprobability. However, with probability 1 − r, this target is changed by the\nnode it points to.\nDMS Attach to edges: one link is selected at random with uniform probability\n(among the links). The new node connects to both ends of the chosen link.\nThe labels are put after the authors of these models, see [9], [10], [11].\n2.4. Numerical Experiments. We computed the energy E2 for several graphs\nconstructed according to these models. We present in this subsection some of these\ncomputations. For the KR model, we used r = 0.5, which gives a power law with\nexponent 3 for the degree distribution, the same exponent of the other two models\n(see [2]).\nWe present the results in Figures 1 to 4: in Figure 1 we show E2 for 107 graphs\non 100 nodes produced with BA model. In Figure 2 we show E2 for 107 graphs on\n100 nodes, produced with KR model, with r = 0.5. In Figure 3 we show E2 for 108\ngraphs on 100 nodes, produced with DMS model. Oscillations in this case become\nmore apparent using logarithmic scale, shown in Figure 4.\nHere, the energy spectra has a maximum close to 1003 , although the observed\nenergy levels are far from this value in the examples. Moreover, there are no\nforbidden levels at least for E2 ≤ 40, 000. This fact also shows that the oscillations\nare not caused by the discreteness nor the sparsity at high values of the energy.\n\n\fDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\n\n5\n\nBA, 100 nodes\n25000\n\nnumber of times (~freq)\n\n20000\n\n15000\n\n10000\n\n5000\n\n0\n0\n\n40000\n\n80000\n\n120000\n\n160000\n\n200000\n\nFigure 1. Preferential attachment, 100 nodes, histogram over 107 graphs\n\nKR, 100 nodes, r=0.5\n16000\n\n2 number of times (~freq)\n\n14000\n12000\n10000\n8000\n6000\n4000\n2000\n0\n0\n\n40000\n\n80000\n\n120000\n\n160000\n\n200000\n\nFigure 2. Edge redirection, 100 nodes, r = 0.5, histogram over\n107 graphs\nThe oscillations persist even varying the width of the bins in the histogram.\nThis could be caused by the fractal pattern in the energy distribution, since each\n\n\f6\n\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\n\nDMS, 100 nodes\n90000\n\nnumber of times (~freq)\n\n80000\n70000\n60000\n50000\n40000\n30000\n20000\n10000\n0\n0\n\n40000\n\n80000\n\n120000\n\n160000\n\n200000\n\nFigure 3. Attach to edges, 100 nodes, histogram over 108 graphs\noscillation exhibits a strong self-similarity with a sequence of sub-oscillations, see\nFigure 5.\nDMS, 100 nodes, log scale\n\nnumber of times (~freq), log scale\n\n100000\n\n10000\n\n1000\n\n100\n\n10\n\n1\n0\n\n40000\n\n80000\n\n120000\n\n160000\n\n200000\n\nFigure 4. Attach to edges, 100 nodes, histogram over 108 graphs,\nlogarithmic scale in E2\n\n\fDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\n\n7\n\nKR, 100 nodes\n40000\n\nnumber of times (~freq)\n\n35000\n30000\n25000\n20000\n15000\n10000\n5000\n0\n160000\n\n165000\n\n170000\n\n175000\n\n180000\n\nFigure 5. Edge redirection, 100 nodes, r = 0.25, histogram over\n108 graphs\nIt is interesting to note that the three models shown above share the same nodedegree distribution. In all of the cases, degrees decay as a power-law of exponent\n3. However, the energy distribution presents some differences. For instance, it is\nclear that their modes differ: they are close to 4400 (BA), 5700 (KR), and 20000\n(DMS). Their oscillations also differ both in the place where they begin and in their\namplitudes.\nAlso, for r close to zero, the KR model gives high energy graphs, together with\nan interesting behavior of the oscillations, which become highly amplified. We conjecture that a phase transition occurs for some specific value r = rc , a phenomenon\nsimilar to that in [22], which deserves further attention. We show in Figure 6 the\nenergy distribution for r = 0.25.\nThe fractal pattern is clearly shown in the integrated density of energies,\nZ e\nN2 (E) =\ndδ(E2 − E).\n0\n\nAs was pointed out in [5], the analysis of the cumulative distribution is better than\nbinning in order to avoid statistical fluctuations. In Figure 7, Figure 8, and Figure\n9, we show different amplifications of N2 (E) for KR with r = 0.25. Clearly, the\nstructure resembles a Cantor devil staircase.\n2.5. Discrete Scale Invariance and log-periodic oscillations. Let us consider\na model in which the first node has no outgoing edge, while the others have exactly\none, as it happens in KR or BA models. Then, a graph with d nodes has d − 1\nedges, and for each edge x ∼ y, |d(x) − d(y)| ≤ d − 2. Thus, E2 (G) ≤ E2max :=\n(d − 1)(d − 2)2. This level of energy is reached with probability 1 in KR when r = 0.\n\n\f8\n\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\n\nKR, 200 nodes\n60000\n\nnumber of times (~freq)\n\n50000\n40000\n30000\n20000\n10000\n0\n0\n\n1e+06\n\n2e+06\n\n3e+06\n\n4e+06\n\n5e+06\n\nFigure 6. Edge redirection, 200 nodes, r = 0.25, histogram over\n2 × 107 graphs\nKR, 200 nodes\n0.12\n\ncumulative distribution\n\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n0\n\n1e+06 2e+06 3e+06 4e+06 5e+06 6e+06 7e+06 8e+06\n\nFigure 7. Edge redirection, 200 nodes, r = 0.25, 107 graphs\nNow, consider the graph Gk depicted in figure 10. It has 1 node at the center, k\nnodes with degree 2, k nodes \"in a second row\", attached to the previous k nodes,\nand d − 2k − 1 nodes with degree 1 and at distance 1 from the origin.\n\n\fDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\n\n9\n\nKR, 200 nodes\n0.085\n\ncumulative distribution\n\n0.08\n0.075\n0.07\n0.065\n0.06\n0.055\n3e+06\n\n3.2e+06\n\n3.4e+06\n\n3.6e+06\n\n3.8e+06\n\n4e+06\n\nFigure 8. Edge redirection, 200 nodes, r = 0.25, 107 graphs\n\nKR, 200 nodes\n0.0576\n0.0574\ncumulative distribution\n\n0.0572\n0.057\n0.0568\n0.0566\n0.0564\n0.0562\n0.056\n0.0558\n2.99e+06\n\n3e+06\n\n3.01e+06 3.02e+06 3.03e+06 3.04e+06 3.05e+06\n\nFigure 9. Edge redirection, 200 nodes, r = 0.25, 107 graphs\nThe energy of Gk is given by\nek := E2 (Gk ) = (d − 2k − 1)(d − k − 2)2 + k(d − k − 3)2 + k.\n\n\f10\n\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\n\n1\n0\n0\n1\n\n11\n00\n00\n11\n00\n11\n00\n11\n00\n11\n00\n11\n00\n11\n00\n11\n00\n11\n\n11\n00\n00\n11\n00\n11\n\nk\n\n1111\n00\n0\n0000\n11\n001\n11\n0\n1\n0\n1\n11\n00\n00\n11\n00\n11\n\n11\n00\n00\n11\n\n11\n00\n00\n11\n00\n11\n1\n0\n0\n1\n0\n1\n\nFigure 10. Graph with k edges in a second row\nIf k ≪ d,\nek ∼ (d − k − 1)3 .\nWithin the KR model, if r is close to 0, this sort of graphs have non-negligible\nprobability, and they explain the peaks at energies close to E2max , which can be\nseen in Figure 11. If one pays a closer attention to one of these peaks, one will see\nthat each of them has sub-peaks with smaller probability (see Figure 12).\n\nKR, 200 nodes\n8\n\nnumber of times (~freq)\n\n7\n6\n5\n4\n3\n2\n1\n3.82e+06\n\n3.84e+06\n\n3.86e+06\n\n3.88e+06\n\nFigure 11. Sub-peaks at high energies. KR, 200 nodes, r = 0.25, E2 .\nThese sub-peaks are due to graphs similar to Gk , but for which the k nodes at\nsecond row do not attach to those in first row so regularly. The number of energy\nlevels around the peak associated to Gk is related to the number of graphs on k\nnodes (more precisely, to the number of forests, i.e. disjoint union of trees, on\nk leaves). This means that when k grows, these peaks get wider, and eventually\n\n\fDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\n\n11\n\nthey become close enough to seem oscillations. Such a phenomenon can be seen in\nFigure 12.\nKR, 2000 nodes\n70\n\nnumber of times (~freq)\n\n60\n50\n40\n30\n20\n10\n0\n9.8e+08\n\n9.82e+08\n\n9.84e+08\n\n9.86e+08\n\nFigure 12. Sub-peaks become close. KR, 2000 nodes, r = 0.20, E2 .\nSince, for k ≪ d,\n3\n3\n∼\n,\nd−k−2\nd−2\nthe peaks can be considered a log periodic structure. The log periodicity of oscillations was related to the existence of a discrete scale invariance (as opposed to a\ncontinuous one), which is due to the existence of preferred scaling ratios. For self\nsimilar fractals like the triadic Cantor set or the Sierpinski gasket, the existence\nof complex fractal dimensions were proposed, since the imaginary part leads to log\nperiodic corrections of the scaling.\nIn our setting, the existence of preferred scaling ratios correspond to the existence\nof different hierarchies in the distribution of node degrees in a given graph. That\nis, the degrees are not evenly distributed, but lacunary.\nWe wish to stress that this fact was obtained independently for the degree distribution of hierarchical scale free graphs in [21], and some models of graph generation\nwere proposed. Here, the energy shows that those kind of networks are obtained\nalso from classical models of graphs generation like the BA, KR, or DMS.\nln(ek ) − ln(ek+1 ) ∼\n\n3. Conclusions\nIn this work we introduced the linking energy E2 , and computed it for several\ngraphs from 50 to 100,000 nodes. We generated the graphs with preferential attachment, edge redirection and attachment to edges models. These models are\nknown as responsible of power law distribution of the nodes degree, and the graphs\n\n\f12\n\nMATÍAS GRAÑA AND JUAN PABLO PINASCO\n\ngenerated are considered scale free. We also consider random (Erdős-Renyi) and\nregular lattice graphs.\nThe frequency distribution of energies shows log periodic oscillations in the tail\nfor the graphs generated with scale free models, which are associated to complex\nfractal dimensions and discrete scale invariance. They are not present for random\nor regular graphs.\nThere are two interpretations of the terms scale free. In the first one, the range\nof the nodes degree distribution crosses several scales, instead of being concentrated\naround the mean number of connections. The second one suggest that the nodes\ndegree distribution presents details at every interval of the range following a power\nlaw.\nOur results show the presence of discrete scale invariance in high energies graphs:\nthey are scale free in the first sense, although the nodes degree are not evenly distributed between the minimum and maximum values, but clustered in hierarchies.\nThis is a fact observed in small networks gathered from real data. Also, for small\nenergies, the distribution does not show the oscillations and the graphs seems to be\nscale free in the second sense. Hence, the models considered are able to generate\nboth kind of graphs, and the energy could be used to discriminate between them.\nReferences\n[1] L. A. N. Amaral, A. Scala, M. Barthelemy, and H. E. Stanley, Classes of Behavior of\nSmall-World Networks, Proc. Natl. Acad. Sci. 97, 11149-11152 (2000).\n[2] R. Albert and A-L. Barabási, Statistical Mechanics of Complex Networks, Rev. Mod. Phys.\n74, 47 (2002).\n[3] Juyong Park and M. E. J. Newman, The Statistical Mechanics of Networks, submitted to\nPhys. Rev. E; (cond-mat/0405566).\n[4] S.N. Dorogovtsev and Mendes J F F, Evolution of Networks, Advances in Physics 51, 10791187 (2002); (cond-mat/0106144).\n[5] M. E. J. Newman, Power laws, Pareto Distributions and Zipf 's Law, Contemporary Physics\n46, 323-351 (2005); (cond-mat/0412004).\n[6] D. Achlioptas, A. Clauset, D. Kempe and C. Moore, On the Bias of Traceroute Sampling; or, Power-law Degree Distributions in Regular Graphs, Proc. STOC (2005);\n(cond-mat/0503087).\n[7] M.L. Goldstein, S.A. Morris and G.G. Yen, Problems with Fitting to the Power-law Distribution, Eur. Phys. J. B 41 255-258 (2004); (cond-mat/0402322).\n[8] M. Mitzenmacher, A Brief History of Generative Models for Power Law and Lognormal\nDistributions, Internet Mathematics 1 (2) 226-251 (2004).\n[9] A-L. Barabási and R. Albert, Emergence of Scaling in Random Networks, Science, 286, 509\n(1999).\n[10] P. L. Krapivsky and S. Redner, Organization of Growing Random Networks, Phys. Rev. E\n63, 066123 (2001); (cond-mat/0011094).\n[11] S.N. Dorogovtsev, J.F.F. Mendes, and A.N. Samukhin, Generic Scale of the \"Scale-free\"\nGrowing Networks, Phys. Rev. E 63, 062101 (2001); (cond-mat/0011115).\n[12] M. E. J. Newman, Mixing Patterns in Networks, Phys. Rev. E 67, 026126 (2003);\n(cond-mat/0209450).\n[13] D. Sornette, A. Johansen, A. Arneodo, J.-F. Muzy and H. Saleur, Complex Fractal Dimensions Describe the Internal Hierarchical Structure of DLA, Phys. Rev. Lett. 76, 251-254\n(1996).\n[14] D. Sornette, Discrete Scale Invariance and Complex Dimensions, Physics Reports 297,\n239-270 (1998) (cond-mat/9707012).\n[15] Levitin, M. and Vassiliev, D. Spectral Asymptotics, Renewal Theorem and the Berry Conjecture for a Class of Fractals, Proc. London Math. Soc. (3) 72 188-214 (1996).\n[16] M.A. Serrano and M. Boguñá, Topology of the World Trade Web, Phys. Rev E 68, 015101(R)\n(2003).\n\n\fDISCRETE SCALE INVARIANCE IN SCALE FREE GRAPHS\n\n13\n\n[17] W. Bachnik, S. Szymczyk, P. Leszczynski, R. Podsiadlo, E. Rymszewicz, L. Kurylo,\nD. Makowiec and B. Bykowska, Quantitive and Sociological Analysis of Blog Networks,\n(physics/0506051).\n[18] Yan-Bo Xie, Tao Zhou and Bing-Hong Wang, Scale-free Networks Without Growth,\n(cond-mat/0512485).\n[19] V.C. Barbosa, R. Donangelo and S.R. Souza, Emergence of Scale-free Networks from Local\nConnectivity and Communication Trade-offs, (cond-mat/0512526).\n[20] Barabasi and Ravasz, Hierarchical Organization in Complex Networks, Phys. Rev E 67,\n026112 (2003).\n[21] K. Suchecki and J.A. Holyst, Log-Periodic Oscillations in Degree Distributions of Hierarchical Scale-Free Networks, Acta Physica Polonica B 36 (8), 2499 (2005); (cond-mat/0503291).\n[22] J. Lee and H. E. Stanley, Phase Transition in the Multifractal Spectrum of Diffusion-Limited\nAggregation, Phys. Rev. Lett. 61, 2945-2948 (1988).\nMG: Departamento de Matematicas, FCEyN, Universidad de Buenos Aires, Ciudad\nUniversitaria, Pab. 1 (1428) Ciudad de Buenos Aires, Argentina.\nE-mail address: matiasg@dm.uba.ar\nJPP: Instituto de Ciencias, Universidad de General Sarmiento, J.M.Gutierrez 1150,\n(1613) Los Polvorines, Buenos Aires, Argentina.\nE-mail address: jpinasco@ungs.edu.ar\n\n\f"}