{"id": "http://arxiv.org/abs/cond-mat/0506155v1", "guidislink": true, "updated": "2005-06-06T22:57:31Z", "updated_parsed": [2005, 6, 6, 22, 57, 31, 0, 157, 0], "published": "2005-06-06T22:57:31Z", "published_parsed": [2005, 6, 6, 22, 57, 31, 0, 157, 0], "title": "Granular Pressure and the Thickness of a Layer Jamming on a Rough\n  Incline", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0506319%2Ccond-mat%2F0506115%2Ccond-mat%2F0506300%2Ccond-mat%2F0506353%2Ccond-mat%2F0506440%2Ccond-mat%2F0506594%2Ccond-mat%2F0506152%2Ccond-mat%2F0506118%2Ccond-mat%2F0506134%2Ccond-mat%2F0506270%2Ccond-mat%2F0506372%2Ccond-mat%2F0506666%2Ccond-mat%2F0506471%2Ccond-mat%2F0506706%2Ccond-mat%2F0506591%2Ccond-mat%2F0506020%2Ccond-mat%2F0506811%2Ccond-mat%2F0506172%2Ccond-mat%2F0506738%2Ccond-mat%2F0506734%2Ccond-mat%2F0506014%2Ccond-mat%2F0506093%2Ccond-mat%2F0506779%2Ccond-mat%2F0506634%2Ccond-mat%2F0506597%2Ccond-mat%2F0506003%2Ccond-mat%2F0506167%2Ccond-mat%2F0506313%2Ccond-mat%2F0506298%2Ccond-mat%2F0506458%2Ccond-mat%2F0506617%2Ccond-mat%2F0506401%2Ccond-mat%2F0506091%2Ccond-mat%2F0506032%2Ccond-mat%2F0506472%2Ccond-mat%2F0506277%2Ccond-mat%2F0506812%2Ccond-mat%2F0506610%2Ccond-mat%2F0506752%2Ccond-mat%2F0506804%2Ccond-mat%2F0506030%2Ccond-mat%2F0506255%2Ccond-mat%2F0506683%2Ccond-mat%2F0506415%2Ccond-mat%2F0506511%2Ccond-mat%2F0506684%2Ccond-mat%2F0506546%2Ccond-mat%2F0506297%2Ccond-mat%2F0506089%2Ccond-mat%2F0506745%2Ccond-mat%2F0506282%2Ccond-mat%2F0506475%2Ccond-mat%2F0506198%2Ccond-mat%2F0506521%2Ccond-mat%2F0506443%2Ccond-mat%2F0506508%2Ccond-mat%2F0506560%2Ccond-mat%2F0506090%2Ccond-mat%2F0506144%2Ccond-mat%2F0506425%2Ccond-mat%2F0506703%2Ccond-mat%2F0506096%2Ccond-mat%2F0506704%2Ccond-mat%2F0506184%2Ccond-mat%2F0506155%2Ccond-mat%2F0506363%2Ccond-mat%2F0506653%2Ccond-mat%2F0506306%2Ccond-mat%2F0506518%2Ccond-mat%2F0506304%2Ccond-mat%2F0506185%2Ccond-mat%2F0506672%2Ccond-mat%2F0506573%2Ccond-mat%2F0506533%2Ccond-mat%2F0506520%2Ccond-mat%2F0506220%2Ccond-mat%2F0506776%2Ccond-mat%2F0506334%2Ccond-mat%2F0506466%2Ccond-mat%2F0506283%2Ccond-mat%2F0506512%2Ccond-mat%2F0506305%2Ccond-mat%2F0506330%2Ccond-mat%2F0506215%2Ccond-mat%2F0506038%2Ccond-mat%2F0506261%2Ccond-mat%2F0506252%2Ccond-mat%2F0506062%2Ccond-mat%2F0506626%2Ccond-mat%2F0506068%2Ccond-mat%2F0506482%2Ccond-mat%2F0506641%2Ccond-mat%2F0506614%2Ccond-mat%2F0506112%2Ccond-mat%2F0506536%2Ccond-mat%2F0506116%2Ccond-mat%2F0506774%2Ccond-mat%2F0506531%2Ccond-mat%2F0506791%2Ccond-mat%2F0506598%2Ccond-mat%2F0506431&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Granular Pressure and the Thickness of a Layer Jamming on a Rough\n  Incline"}, "summary": "Dense granular media have a compaction between the random loose and random\nclose packings. For these dense media the concept of a granular pressure\ndepending on compaction is not unanimously accepted because they are often in a\n\"frozen\" state which prevents them to explore all their possible microstates, a\nnecessary condition for defining a pressure and a compressibility\nunambiguously. While periodic tapping or cyclic fluidization have already being\nused for that exploration, we here suggest that a succession of flowing states\nwith velocities slowly decreasing down to zero can also be used for that\npurpose. And we propose to deduce the pressure in \\emph{dense and flowing}\ngranular media from experiments measuring the thickness of the granular layer\nthat remains on a rough incline just after the flow has stopped.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0506319%2Ccond-mat%2F0506115%2Ccond-mat%2F0506300%2Ccond-mat%2F0506353%2Ccond-mat%2F0506440%2Ccond-mat%2F0506594%2Ccond-mat%2F0506152%2Ccond-mat%2F0506118%2Ccond-mat%2F0506134%2Ccond-mat%2F0506270%2Ccond-mat%2F0506372%2Ccond-mat%2F0506666%2Ccond-mat%2F0506471%2Ccond-mat%2F0506706%2Ccond-mat%2F0506591%2Ccond-mat%2F0506020%2Ccond-mat%2F0506811%2Ccond-mat%2F0506172%2Ccond-mat%2F0506738%2Ccond-mat%2F0506734%2Ccond-mat%2F0506014%2Ccond-mat%2F0506093%2Ccond-mat%2F0506779%2Ccond-mat%2F0506634%2Ccond-mat%2F0506597%2Ccond-mat%2F0506003%2Ccond-mat%2F0506167%2Ccond-mat%2F0506313%2Ccond-mat%2F0506298%2Ccond-mat%2F0506458%2Ccond-mat%2F0506617%2Ccond-mat%2F0506401%2Ccond-mat%2F0506091%2Ccond-mat%2F0506032%2Ccond-mat%2F0506472%2Ccond-mat%2F0506277%2Ccond-mat%2F0506812%2Ccond-mat%2F0506610%2Ccond-mat%2F0506752%2Ccond-mat%2F0506804%2Ccond-mat%2F0506030%2Ccond-mat%2F0506255%2Ccond-mat%2F0506683%2Ccond-mat%2F0506415%2Ccond-mat%2F0506511%2Ccond-mat%2F0506684%2Ccond-mat%2F0506546%2Ccond-mat%2F0506297%2Ccond-mat%2F0506089%2Ccond-mat%2F0506745%2Ccond-mat%2F0506282%2Ccond-mat%2F0506475%2Ccond-mat%2F0506198%2Ccond-mat%2F0506521%2Ccond-mat%2F0506443%2Ccond-mat%2F0506508%2Ccond-mat%2F0506560%2Ccond-mat%2F0506090%2Ccond-mat%2F0506144%2Ccond-mat%2F0506425%2Ccond-mat%2F0506703%2Ccond-mat%2F0506096%2Ccond-mat%2F0506704%2Ccond-mat%2F0506184%2Ccond-mat%2F0506155%2Ccond-mat%2F0506363%2Ccond-mat%2F0506653%2Ccond-mat%2F0506306%2Ccond-mat%2F0506518%2Ccond-mat%2F0506304%2Ccond-mat%2F0506185%2Ccond-mat%2F0506672%2Ccond-mat%2F0506573%2Ccond-mat%2F0506533%2Ccond-mat%2F0506520%2Ccond-mat%2F0506220%2Ccond-mat%2F0506776%2Ccond-mat%2F0506334%2Ccond-mat%2F0506466%2Ccond-mat%2F0506283%2Ccond-mat%2F0506512%2Ccond-mat%2F0506305%2Ccond-mat%2F0506330%2Ccond-mat%2F0506215%2Ccond-mat%2F0506038%2Ccond-mat%2F0506261%2Ccond-mat%2F0506252%2Ccond-mat%2F0506062%2Ccond-mat%2F0506626%2Ccond-mat%2F0506068%2Ccond-mat%2F0506482%2Ccond-mat%2F0506641%2Ccond-mat%2F0506614%2Ccond-mat%2F0506112%2Ccond-mat%2F0506536%2Ccond-mat%2F0506116%2Ccond-mat%2F0506774%2Ccond-mat%2F0506531%2Ccond-mat%2F0506791%2Ccond-mat%2F0506598%2Ccond-mat%2F0506431&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dense granular media have a compaction between the random loose and random\nclose packings. For these dense media the concept of a granular pressure\ndepending on compaction is not unanimously accepted because they are often in a\n\"frozen\" state which prevents them to explore all their possible microstates, a\nnecessary condition for defining a pressure and a compressibility\nunambiguously. While periodic tapping or cyclic fluidization have already being\nused for that exploration, we here suggest that a succession of flowing states\nwith velocities slowly decreasing down to zero can also be used for that\npurpose. And we propose to deduce the pressure in \\emph{dense and flowing}\ngranular media from experiments measuring the thickness of the granular layer\nthat remains on a rough incline just after the flow has stopped."}, "authors": ["Christophe Josserand", "Pierre-Yves Lagrée", "Daniel Lhuillier"], "author_detail": {"name": "Daniel Lhuillier"}, "author": "Daniel Lhuillier", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/epl/i2005-10398-1", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0506155v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0506155v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 2 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0506155v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0506155v1", "journal_reference": null, "doi": "10.1209/epl/i2005-10398-1", "fulltext": "arXiv:cond-mat/0506155v1 [cond-mat.mtrl-sci] 6 Jun 2005\n\nGRANULAR PRESSURE AND THE\nTHICKNESS OF A LAYER JAMMING ON A\nROUGH INCLINE\nChristophe Josserand, Pierre-Yves Lagrée\nDaniel Lhuillier\nLaboratoire de Modélisation en Mécanique, UMR CNRS 7607,\nBoı̂te 162, Université Pierre et Marie Curie, 75252 Paris FRANCE\nOctober 2, 2018\nAbstract\nDense granular media have a compaction between the random loose\nand random close packings. For these dense media the concept of a granular pressure depending on compaction is not unanimously accepted because they are often in a \"frozen\" state which prevents them to explore\nall their possible microstates, a necessary condition for defining a pressure\nand a compressibility unambiguously. While periodic tapping or cyclic\nfluidization have already being used for that exploration, we here suggest\nthat a succession of flowing states with velocities slowly decreasing down\nto zero can also be used for that purpose. And we propose to deduce the\npressure in dense and flowing granular media from experiments measuring\nthe thickness of the granular layer that remains on a rough incline just\nafter the flow has stopped.\n\n1\n\nIntroduction\n\nThe existence of a pressure in granular media at rest is the simplest way to\nrepresent their stiffness. When the concentration of grains is above the random\nclose packing, the granular medium acts as a poro-elastic solid and its pressure\nis a function not only of the compaction but also of the elastic constants of\nthe material the grains are made of. When the granular medium has a smaller\ncompaction, in the range between the random loose and random close packings,\nthe grains can be considered as rigid and the expression of the granular pressure is far less evident. The difficulty comes from the glassy behaviour which\nmakes it quite usual to find dense granular media in a frozen state concerning their compaction. Hence the feeling that the granular pressure is largely\ndependent on the way the medium was prepared. However, experiments have\nbeen conducted which aim at allowing the granular medium to reach a steady\n1\n\n\fand quasi-equilibrium state concerning its compaction. These experiments relied on regular tappings or cyclic fluidization favouring the exploration of many\nmicrostates (see e.g. [1] and [2]). We propose that a systematic exploration of\nthe microstates can also be achieved starting from a flowing granular medium,\nand slowly reducing its velocity down to rest. As a consequence, we suggest\nthat some of the experiments on rough plates (inclined with angle θ) which led\nto define the thickness hstop (θ) which remains after the flow has stopped, can\nalso be used to infer the relation between granular pressure and compaction.\nWhile the pressure in poro-elastic media originates from elastic forces and granular deformations, the pressure in dense and flowing granular media (those with\na compaction between the random loose and random close packings) results\nmainly from the many possible random spatial configurations of the grains. We\nwill present the main features of this \"randomness\" pressure as well as those\nof the more classical elastic pressure. Then some general expressions for the\ngranular pression will be proposed. Finally two particular expressions will be\ndeduced from experimental data concerning hstop .\n\n2\n\nThe Configuration Pressure and the Disorder\nPressure\n\nConsider a large volume containing many rigid spheres with a high enough volume fraction φ̃ for a contact network to invade the whole volume. Let Ω(φ̃)dφ̃\nbe the number of different spatial configurations of these spheres in the range\nbetween φ̃ and φ̃ + dφ̃. To belong to Ω(φ̃), a configuration must display a large\nenough number of contacts, but with zero forces at the contact points. The\ndensity of micro-states Ω(φ̃) is thus a purely geometric concept. If instead of\nrigid spheres we were considering soft ones, we would say we are counting the\nnumber of configurations with zero energy (\"incipient\" contacts), yet able to\nresist an infinitesimal external pressure load. This density of states presumably\nvanishes below a minimum compaction φmin ≃ 0.40 (the gel threshold) and\nabove the maximum compaction φmax ≃ 0.74 (the most compact crystalline\nconfiguration). At some intermediate volume fraction φm the density of microstates displays a large maximum value. This intermediate compaction with\nthe maximum number of microstates happens to be the loosest random packing.\nAccording to Onoda and Liniger [3] its value for spherical grains is φm = 0.555.\nIntroduce now a number P which represents a non-dimensional measure of the\nconfiguration pressure and define the partition function\nZ(P ) =\n\nZ\n\nφmax\n\neP φ̃ Ω(φ̃) dφ̃.\n\nφmin\n\nThe mean volume fraction is then related to the configuration pressure in the\nd\nform: φ = dP\nLog Z. This relation can be used to obtain both P (φ) and the\nvariance of the density fluctuations < (φ̃ − φ)2 >= dφ/dP . Another useful\nquantity is the configuration entropy S = Log Z − P φ . This configuration\n2\n\n\fentropy is a function of the mean volume fraction and the non-dimensional\nconfiguration pressure is nothing but P = −dS/dφ. Many works starting\nfrom Kanatani [4] and revived by Edwards and Oakeshott [5] strived to find an\nexplicit form for the partition function or for the configuration entropy. The\ngeneral trends of their results are the followings : for a vanishing pressure, the\nmean volume fraction is φm while for an infinite pressure, the volume fraction is\nφmax and the compressibility dφ/dP vanishes. A very simple expression meeting\nthese conditions is\npconf iguration ∼ P ∼ Log\n\nφmax − φm\n.\nφmax − φ\n\nClose to the maximum volume fraction the configuration pressure has an expression quite similar to the pressure deduced from the entropy of the lattice-gas\nmodel (see e.g. [6]). Note that the configuration pressure stems from the total\nnumber of different configurations, including both random and crystalline ones.\nIt is also possible to select random configurations only. In this case one introduces the random close compaction φM above which all configurations display\nsome cristalline order. For spheres, it is generally admitted that φM = 0.635\nand a possible expression for the disorder pressure is\npdisorder ∼ Log\n\nφM − φm\n.\nφM − φ\n\n(1)\n\nThe gradient of the disorder pressure acts as a diffusion force which pushes the\ngrains towards lower compactions, those with a larger number of microstates.\nFor the grains to have a chance to explore all microstates with equal probability,\nthe best solution is a steady flow. This is why the concept of a disorder granular\npressure is more pertinent for dynamic situations and that it must be handled\nwith care in static ones. The disorder pressure confers the granular medium a\ncompressibility (variance of the compaction fluctuations) which decreases with\nthe compaction. When taking the above expression for granted the compressibility is proportional to φM − φ, in agreement with the experimental results\nof Nowak et al. [1] but not with those of Schroter et al. [2] which display a\nminimum of the compressibility for a compaction between φm and φM . The\nmain features of pdisorder are drawn schematically in Fig.1.\n\n3\n\nThe Elastic Pressure\n\nThe configuration or disorder pressure is a purely geometric (or entropic) concept. What matters is a minimum coordination number between particles but\nthe forces at the contact points are of no concern. It is then obvious that the\nconfiguration pressure is not the whole story. There is a second (and more intuitive) source of granular pressure which witnesses to the elastic stiffness of\nthe granular medium and for which the magnitude of the contact forces is of\nutmost importance. That second contribution is the elastic pressure pelastic .\nAccording to Aharonov and Sparks [8] and to O'Hern, Silbert, Liu and Nagel\n3\n\n\f[9] (see also Head and Doi [10] for a first principles approach) pelastic vanishes\nbelow a volume fraction φc which depends on the friction between grains and\nis sligthly smaller than the random close packing φM . Above φc it was found\nthat pelastic ∼ (φ − φc )α with α = 1 for Hookean contact forces and α = 3/2 for\nHertzian ones. What is not apparent in the above expression is that the bulk\nmodulus dpelastic /dφ is usually orders of magnitude larger than dpdisorder /dφ.\nWhen plotted on the same graph as pdisorder , it is as if pelastic was zero for\nφ < φc and infinite for φ > φc , as sketched in Fig.1 where the difference between φc and φM was exagerated for clarity.\n\n4\n\nThe Rate-Independent Granular Pressure\n\nThe pressure in a moving granular medium is generally made of two parts :\na rate-dependent part which represents dilatancy effects in shear flows and a\nrate-independent part (hereafter noted p) representing the physical phenomena\ninvolved in both pelastic and pdisorder . We are interested in the latter rateindependent contribution p. It seems clear that the very high stiffness for φ ≃ φc\nis a feature of pelastic that must be shared by the total granular pressure. Much\nless obvious is the behaviour of p for volume fractions slightly above φm . Should\nwe trust the linear behaviour displayed by the above expression for pdisorder ?\nIn fact, since our final aim is a comparison with experimental results, it seems\nwise to introduce a general expression like p ∼ (φ − φm )n /(φM − φ)m where\nthe positive exponents m and n are left undetermined and we neglected the\nsmall difference between φc and φM . Note that this expression for the rateindependent granular pressure holds in the very small range φm < φ < φM\nspecific of dense granular media, and that the granular pressure vanishes for\nφ = φm and diverges for φ = φM . In what follows we scale that granular\npressure with ρp gD where ρp is the mass per unit volume of the grains and\ng is the acceleration of gravity. That scaling seems obvious when gravity is\nresponsible for the confinment of the grains but we checked [11] that the same\nscaling is also convenient when the confinment is due to an external pressure\napplied on the granular material. The physical meaning of that special scaling\nis clear : the loads exerted on a granular medium with compaction in the range\nφm < φ < φM are much smaller than those leading to poro-elastic media with\nφ > φM . The latter ones involve elastic deformations of the grains while grains\nwith a smaller compaction can be considered as rigid. Consequently we can not\naccept any scaling involving elastic constants and we are left with ρp gD as the\nonly relevant order of magnitude for stresses. Defining the relative compaction\nφ as\nφ − φm\nφ =\n,\n(2)\nφM − φm\nwe will test the potentialities of two expressions for the rate-independent granular pressure in the range 0 ≤ φ ≤ 1 : a rather general one with exponents\n\n4\n\n\fm > 0 and n > 0\np = P0 ρp gD\n\nφn\n,\n(1 − φ)m\n\n(3)\n\nand a special one identical to pdisorder as given in (1)\np = P0 ρp gD Log\n\n1\n.\n(1 − φ)\n\n(4)\n\nThat latter expression was already adopted in previous works [12, 13] and it\nsuggests that the elastic pressure plays a negligible role except for φ ≃ φM . We\nnow consider an experiment likely to discriminate between (3) and (4) and able\nto give an order of magnitude for P0 .\n\n5\n\nThe Maximum Thickness of a Granular Layer\nthat Stops on a Rough Incline\n\nConsider a layer of granular material flowing down a rough inclined plate. Upon\ngently reducing the inclination, the layer ultimately stops at some angle θ, with\na thickness h. Since the flow velocity was slowly reduced to zero, the granular\nlayer had time to explore a lot (if not all) of the microstates involved in pdisorder .\nAnd since the flow was slow, the rate-dependent part of the granular pressure\nwas already negligible before the layer jams. It is thus likely that the peculiar\njammed state which the layer arrives at is described by the rate-independent\npressure p defined above. The mechanical equilibrium of the freshly jammed\nlayer is thus expressed by\n0=−\n\n∂p\n+ φρp gcosθ,\n∂z\n\nand\n\ntan θ = min [μ(z)],\n\nwhere the z−axis is orthogonal to the free-surface of the layer and points downwards while μ is the friction coefficient which is possibly non-uniform over the\nlayer thickness. Substituting expression (3), one deduces that the reduced compaction profile φ(z) increases from zero close to the free-surface up to values\nL\n0\nclose to one at a distance of order L with D\n= φMPcosθ\n. Close to the free-surface\nthat is to say for 0 ≤ z ≪ L, and far from the free-surface (L ≪ z) the profile\n1\n1\nL m\nm z n\nbehaves asymptotically like φ(z) = ( φφM\nL ) and φ(z) = 1 − ( z ) . Concerning\nthe particular pressure (4), the whole profile is exponential-like and given by\nφ(z) = 1 −\n\n1+\n\nφm\nφM\n\n1\n.\nz\n(e L − 1)\n\n(5)\n\nA similar \"Fermi-Dirac\" profile was already observed in experiments [14] and\nwas also obtained in simulations of a frustrated lattice-gas model [15].\nKnowing the compaction profile, let us now focus on the layer thickness h. Da\nCruz [16] has deduced from numerical simulations a very important (and a bit\n\n5\n\n\fcounter-intuitive) result : the macroscopic friction coefficient decreases almost\nlinearly with the compaction and can be written as\nμ = tanθmax − (tanθmax − tanθmin ) φ .\n\n(6)\n\nSince the compaction increases with the distance from the free-surface, the\nsmallest value of μ happens very close to the rough plate, that is to say for z ≃ h.\nJust after jamming, we thus have tanθmax − (tanθmax − tanθmin ) φ(hstop ) =\ntan θ. Taking the compaction profiles (??) into account, one deduces that when\nθ slightly exceeds θmin the layer is very thick and\n\u0012\n\u0013m\nhstop\nP0\ntan θmax − tan θmin\n=\n.\n(7)\nD\nφM cosθmin\ntan θ − tan θmin\nwhile when θ comes close to θmax the layer is thin and\n\u0012\n\u0013n\nP0\ntan θmax − tan θ\nhstop\n=\n.\nD\nφm cosθmax tan θmax − tan θmin\n\n(8)\n\nFor the special case (4), one obtains a rather simple expression that holds in\nthe whole range θmin ≤ θ ≤ θmax\n\u0015\n\u0014\nhstop\nP0\nφM tan θmax − tan θ\n.\n(9)\n=\nLog 1 +\nD\nφM cosθ\nφm tan θ − tan θmin\n\n6\n\nExperimental results\n\nSystematic measurements of the layer thickness were initiated by Pouliquen [17]\nwho distinguished between the thickness hstart (θ) for an initially static layer and\nhstop (θ) for an initially flowing layer. The experimental results were fitted by\ntwo different expressions\nhstart,stop (θ)\ntan θ2 − tan θ1\n]\n= B Log [\nD\ntan θ − tan θ1\n\nhstart,stop (θ)\ntan θ2 − tan θ\n.\n=B\nD\ntan θ − tan θ1\n(10)\nwhere D is the grain size while B, θ1 and θ2 are constants, different for hstop\nand hstart . Assuming that θ2 = θmax and θ1 = θmin , these data fittings suggest two possible expressions for the granular pressure : either expression (4)\nor expression (3) with n = 1 and m = 1. However, most of the experimental\nvalues obtained for B, θ1 and θ2 must be considered as non representative of\nthe bulk granular pressure because they were found to depend on the roughness\nof the inclined plate. In fact, the main difficulty with the interpretation of experimental results is to estimate the effective friction coefficient associated with\nthis roughness. Our theoretical predictions were based on one main assumption : the minimum of effective friction occurs somewhere close to the incline,\nat the limit between the bulk and a thin boundary layer strongly influenced\nby the plate roughness. This supposes the effective friction in the boundary\n6\n\nor\n\n\flayer to be much larger than its value in the bulk. In other words, to deduce\nthe bulk granular pressure from experiments on inclines, we are led to exclude\nthose experiments performed with relatively smooth plates, and more generally\nthose for which the curves hstart,stop (θ) are strongly modified upon changing\nthe plate roughness. And concerning those with a high enough roughness, we\nmust exclude some boundary layer of thickness δ and consider h − δ as the relevant thickness for bulk behaviour. Accordingly, we were led to discard all the\nexperiments performed with glass beads because the friction generated by the\nbeads glued on the incline is only slightly larger than the friction in the bulk.\nBut we considered as significative the experiments with sand flowing on carpets\nof various roughnesses. And for these experiments with sand we discarded a\nboundary layer with thickness estimated to δ ≃ 4D. Because of the scarcity\nof data, we could not fully discriminate between expression (4) and expression\n(3) with m = 1 and n = 1. We could fit the experimental results for sand on\ncarpets (see Fig.2) with\nμ = 0.73 − 0.16φ and p ≃ 5.3 ρp gD Log\n\n1\n,\n1−φ\n\n(11)\n\nas well as with\nμ = 0.73 − 0.20φ and p ≃ 5.2 ρp gD\n\n7\n\nφ\n.\n1−φ\n\n(12)\n\nConclusions\n\nThe concept of a rate-independent granular pressure was proposed long ago\nfor poro-elastic media [18]. We suggest this concept can be extended to dense\nand flowing granular media for which this compaction-dependent pressure is\nthe consequence of two distinct physical phenomena, of entropic and mechanistic nature respectively. We proposed to deduce the bulk granular pressure from\nexperiments on rough inclines and particularly those giving hstop (θ). It happens\nthat most of the experimental results concerning this thickness depend more on\nthe roughness of the incline than on the bulk behaviour of the granular medium.\nHowever, the scarce results representative of the bulk behaviour can be interpreted with a granular pressure and an effective friction depending both on the\ncompaction. Concerning sand, a rather satisfactory fit with the experimental\nresults could be obtained with either expression (11) or expression (12), witnessing to the predominance of entropic effects in almost the whole compaction\nrange φm < φ < φM , while elastic effects come into play when approaching the\nrandom close packing φM only.\nOne may wonder why numerical simulations of flows down rough inclines (see\ne.g. [19]) predict flat compactions profiles which are closer to those resulting\nfrom pelastic than pdisorder . In fact, numerical simulations have so far described\nwith great care the deterministic contact forces (hence the elastic stress) while\nthey completely discarded the stochastic processes associated with the exploration of the many microstates with contacts but zero contact forces. How to\n7\n\n\f40\n\nPSfrag replacements\n\nφm\nφM\nφc\nφ\ngranular pressure\n\nhstop /D\n\n35\n30\n25\n20\n15\n10\n5\n30\n\n31\n\n32\n\n33\n\nθ\n\n34\n\n35\n\n36\n\n37\n\nFigure 1: Schematic representation of the elastic pressure (dashed line) and disorder pressure (plain line) as a function of the compaction in the range between\nthe random loose packing φm and the random close packing φM . The disorder pressure vanishes below φm and diverges at φM while the elastic pressure\nvanishes below φc and strongly increases above.\nintroduce these stochastic processes with the minimum change for the equations\nof motion ? A possibility is to write the equation of motion of particle α in the\nform\nmα\n\nX\n~α\nd2 R\n=\nF~ αβ + F~ α + mα~g\ndt2\n\n(13)\n\nβ6=α\n\nwhere F~ αβ is the force exerted at contact with particule β while the stochastic\nforce F~ α plays the role of the brownian force for thermal systems and witnesses\nto the random exploration of microstates. When tapping granular matter one\ncreates a series of short-lasting stochastic forces, while in steady flows this force\nis steadily acting. There is no theory of F~ α we are aware of but, much like\nthe brownian diffusion force is the coarse-grained consequence of the stochastic\nbrownian force, the gradient of the disorder pressure acts as a diffusion force\nwhich is the coarse-grained consequence of the granular stochastic forces. Hence,\nthe concept of a rate-independent granular pressure can be used without moderation in the dense regime, provided this use is restricted to steadily flowing\nmedia.\nAcknowledgments: The authors appreciate interactions with R. Ball, F.\nChevoir, D. Dean, J. Gollub, T. Harsley, D. Head, V. Kumaran, M. Nicodemi,\nJ.N. Roux, G. Tarjus and P. Viot. D.L. thanks the Kavli Institute for Theoretical Physics for hospitality and support through the Granular Physics Program\nGRANULAR05.\n\n8\n\n\fgranular pressure\n\nPSfrag replacements\nhstop /D\nθ\n\nφm\n\nφ\n\nφc φM\n\nFigure 2: Dependence of hstop /D on the inclination θ. Comparison between\nexperimental results (points) for sand over carpets (from [16]) and fitting curves\ndeduced from the granular pressure (12) (plain) and (11) (dashed). Experimental results with hstop /D ≤ 3.6 were discarded and the value θmax ≈ 36.1 was\nadopted.\n\nReferences\n[1] E.R. Nowak, J.B. Knight, E. Ben-Naim, H.M. Jaeger, S.R. Nagel, Density\nfluctuations in vibrated granular materials, Phys.Rev. E57 (1998) 1971-1982.\n[2] M.Schroter, D.I. Goldman, H.L. Swinney, Stationary state volume fluctuations in a granular medium, Phys. Rev. E 71 (2005) 030301.\n[3] G.Y. Onoda, E.G. Liniger, Random loose packings of uniform spheres and\nthe dilatancy onset, Phys.Rev.Lett. 64 (1990) 2727-2730.\n[4] K. Kanatani, An entropy model for shear deformation of granular material,\nLett. Appl. Engng. Sci. 18 (1980) 989-998.\n[5] S.F. Edwards, R.B. Oakeshott, Theory of powders, Physica A157 (1989)\n1080-1090.\n[6] T.A. Witten, Structured Fluids, Oxford University Press 2004, ch.2.\n[7] J.H. Irving, J.G. Kirkwood, The statistical mechanical theory of transport\nprocesses. IV The equations of hydrodynamics J. Chem. Phys. 18 (1950)\n817.\n[8] E. Aharonov, D. Sparks, Rigidity Phase transition in granular packings,\nPhys. Rev. E 60 (1999) 6890- 6895.\n[9] C.S. O'Hern, L.E. Silbert, A.J. Liu, S.R. Nagel, Jamming at zero temperature and zero applied stress : The epitome of disorder, Phys. Rev. E 68\n(2003) 011306.\n\n9\n\n\f[10] D.Head, M. Doi, Modelling the rigidity transition in self-assembled particulate systems interacting via repulsive central forces, preprint 2005.\n[11] C. Josserand, P.-Y. Lagrée, D. Lhuillier, The Couette flow of dry granular\nmaterials, in Trends in Applications of Mathematics in Mechanics (Eds. Y.\nWang and K. Hutter) Shaker Verlag, Aachen, 2005.\n[12] S.B. Savage, Analysis of slow high concentration flows of granular materials,\nJ. Fluid. Mech. 377 (1998) 1-26.\n[13] C. Josserand, P.-Y. Lagrée, D. Lhuillier, Stationary shear flows of dense\ngranular materials : a tentative continuum modelling, Eur. Phys. J. E14\n(2004) 127-135.\n[14] E. Clement, J. Rajchenbach, Fluidization of a bidimensional powder, Europhys. Lett. 16, 133-138 (1991).\n[15] M. Nicodemi, A. Coniglio, H.J. Herrmann, The compaction in granular\nmedia and frustrated Ising models, J. Phys. A, 30, L379-L385 (1997).\n[16] F. Da Cruz, Ecoulements de grains secs : frottement et blocage, PhD thesis,\nENPC 2004. Available from http://pastel.paristech.org/archive/00000946/\n[17] O. Pouliquen, Scaling laws in granular flows down rough inclined planes,\nPhys. of Fluids 11 (1999) 542-548.\n[18] S.L. Passman, J.W. Nunziato and E.K. Walsh, A theory of multi-phase\nmixtures, in Rational Thermodynamics (edited by C. Truesdell) pp 286-325,\nMcGraw-Hill, New-York 1984.\n[19] L.E. Silbert, D. Ertas, G.S. Grest, T.C. Halsey, D. Levine, S.J. Plimpton,\nGranular flow down an inclined plane : Bagnold scaling and rheology, Phys.\nRev. E 64, 051302 (2001).\n\n10\n\n\f"}