{"id": "http://arxiv.org/abs/cond-mat/0107322v2", "guidislink": true, "updated": "2001-07-24T01:49:23Z", "updated_parsed": [2001, 7, 24, 1, 49, 23, 1, 205, 0], "published": "2001-07-14T18:46:13Z", "published_parsed": [2001, 7, 14, 18, 46, 13, 5, 195, 0], "title": "Slow dynamics and aging in a non-randomly frustrated spin system", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0107602%2Ccond-mat%2F0107534%2Ccond-mat%2F0107156%2Ccond-mat%2F0107557%2Ccond-mat%2F0107066%2Ccond-mat%2F0107550%2Ccond-mat%2F0107184%2Ccond-mat%2F0107539%2Ccond-mat%2F0107124%2Ccond-mat%2F0107163%2Ccond-mat%2F0107497%2Ccond-mat%2F0107331%2Ccond-mat%2F0107413%2Ccond-mat%2F0107322%2Ccond-mat%2F0107319%2Ccond-mat%2F0107575%2Ccond-mat%2F0107485%2Ccond-mat%2F0107241%2Ccond-mat%2F0107009%2Ccond-mat%2F0107126%2Ccond-mat%2F0107555%2Ccond-mat%2F0107218%2Ccond-mat%2F0107604%2Ccond-mat%2F0107335%2Ccond-mat%2F0107280%2Ccond-mat%2F0107277%2Ccond-mat%2F0107595%2Ccond-mat%2F0107634%2Ccond-mat%2F0107621%2Ccond-mat%2F0107467%2Ccond-mat%2F0107067%2Ccond-mat%2F0107613%2Ccond-mat%2F0107537%2Ccond-mat%2F0107370%2Ccond-mat%2F0107551%2Ccond-mat%2F0107174%2Ccond-mat%2F0107176%2Ccond-mat%2F0107406%2Ccond-mat%2F0107458%2Ccond-mat%2F0107209%2Ccond-mat%2F0107474%2Ccond-mat%2F0107386%2Ccond-mat%2F0107227%2Ccond-mat%2F0107089%2Ccond-mat%2F0107448%2Ccond-mat%2F0107111%2Ccond-mat%2F0107542%2Ccond-mat%2F0107234%2Ccond-mat%2F0107297%2Ccond-mat%2F0107360%2Ccond-mat%2F0107044%2Ccond-mat%2F0107109%2Ccond-mat%2F0107443%2Ccond-mat%2F0107074%2Ccond-mat%2F0107471%2Ccond-mat%2F0107548%2Ccond-mat%2F0107004%2Ccond-mat%2F0107263%2Ccond-mat%2F0107190%2Ccond-mat%2F0107546%2Ccond-mat%2F0107308%2Ccond-mat%2F0107164%2Ccond-mat%2F0107278%2Ccond-mat%2F0107307%2Ccond-mat%2F0107486%2Ccond-mat%2F0107112%2Ccond-mat%2F0107231%2Ccond-mat%2F0107026%2Ccond-mat%2F0107552%2Ccond-mat%2F0107558%2Ccond-mat%2F0107266%2Ccond-mat%2F0107460%2Ccond-mat%2F0107020%2Ccond-mat%2F0107420%2Ccond-mat%2F0107005%2Ccond-mat%2F0107320%2Ccond-mat%2F0107375%2Ccond-mat%2F0107412%2Ccond-mat%2F0107391%2Ccond-mat%2F0107103%2Ccond-mat%2F0107255%2Ccond-mat%2F0107350%2Ccond-mat%2F0107158%2Ccond-mat%2F0107249%2Ccond-mat%2F0107405%2Ccond-mat%2F0107508%2Ccond-mat%2F0107489%2Ccond-mat%2F0107310%2Ccond-mat%2F0107063%2Ccond-mat%2F0107300%2Ccond-mat%2F0107199%2Ccond-mat%2F0107410%2Ccond-mat%2F0107473%2Ccond-mat%2F0107504%2Ccond-mat%2F0107292%2Ccond-mat%2F0107185%2Ccond-mat%2F0107220%2Ccond-mat%2F0107221%2Ccond-mat%2F0107622%2Ccond-mat%2F0107229%2Ccond-mat%2F0107135&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Slow dynamics and aging in a non-randomly frustrated spin system"}, "summary": "A simple, non-disordered spin model has been studied in an effort to\nunderstand the origin of the precipitous slowing down of dynamics observed in\nsupercooled liquids approaching the glass transition. A combination of Monte\nCarlo simulations and exact calculations indicates that this model exhibits an\nentropy vanishing transition accompanied by a rapid divergence of time scales.\nMeasurements of various correlation functions show that the system displays a\nhierarchy of time scales associated with different degrees of freedom. Extended\nstructures, arising from the frustration in the system, are identified as the\nsource of the slow dynamics. In the simulations, the system falls out of\nequilibrium at a temperature $T_{g}$ higher than the entropy-vanishing\ntransition temperature and the dynamics below $T_{g}$ exhibits aging as\ndistinct from coarsening. The cooling rate dependence of the energy is also\nconsistent with the usual glass formation scenario.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0107602%2Ccond-mat%2F0107534%2Ccond-mat%2F0107156%2Ccond-mat%2F0107557%2Ccond-mat%2F0107066%2Ccond-mat%2F0107550%2Ccond-mat%2F0107184%2Ccond-mat%2F0107539%2Ccond-mat%2F0107124%2Ccond-mat%2F0107163%2Ccond-mat%2F0107497%2Ccond-mat%2F0107331%2Ccond-mat%2F0107413%2Ccond-mat%2F0107322%2Ccond-mat%2F0107319%2Ccond-mat%2F0107575%2Ccond-mat%2F0107485%2Ccond-mat%2F0107241%2Ccond-mat%2F0107009%2Ccond-mat%2F0107126%2Ccond-mat%2F0107555%2Ccond-mat%2F0107218%2Ccond-mat%2F0107604%2Ccond-mat%2F0107335%2Ccond-mat%2F0107280%2Ccond-mat%2F0107277%2Ccond-mat%2F0107595%2Ccond-mat%2F0107634%2Ccond-mat%2F0107621%2Ccond-mat%2F0107467%2Ccond-mat%2F0107067%2Ccond-mat%2F0107613%2Ccond-mat%2F0107537%2Ccond-mat%2F0107370%2Ccond-mat%2F0107551%2Ccond-mat%2F0107174%2Ccond-mat%2F0107176%2Ccond-mat%2F0107406%2Ccond-mat%2F0107458%2Ccond-mat%2F0107209%2Ccond-mat%2F0107474%2Ccond-mat%2F0107386%2Ccond-mat%2F0107227%2Ccond-mat%2F0107089%2Ccond-mat%2F0107448%2Ccond-mat%2F0107111%2Ccond-mat%2F0107542%2Ccond-mat%2F0107234%2Ccond-mat%2F0107297%2Ccond-mat%2F0107360%2Ccond-mat%2F0107044%2Ccond-mat%2F0107109%2Ccond-mat%2F0107443%2Ccond-mat%2F0107074%2Ccond-mat%2F0107471%2Ccond-mat%2F0107548%2Ccond-mat%2F0107004%2Ccond-mat%2F0107263%2Ccond-mat%2F0107190%2Ccond-mat%2F0107546%2Ccond-mat%2F0107308%2Ccond-mat%2F0107164%2Ccond-mat%2F0107278%2Ccond-mat%2F0107307%2Ccond-mat%2F0107486%2Ccond-mat%2F0107112%2Ccond-mat%2F0107231%2Ccond-mat%2F0107026%2Ccond-mat%2F0107552%2Ccond-mat%2F0107558%2Ccond-mat%2F0107266%2Ccond-mat%2F0107460%2Ccond-mat%2F0107020%2Ccond-mat%2F0107420%2Ccond-mat%2F0107005%2Ccond-mat%2F0107320%2Ccond-mat%2F0107375%2Ccond-mat%2F0107412%2Ccond-mat%2F0107391%2Ccond-mat%2F0107103%2Ccond-mat%2F0107255%2Ccond-mat%2F0107350%2Ccond-mat%2F0107158%2Ccond-mat%2F0107249%2Ccond-mat%2F0107405%2Ccond-mat%2F0107508%2Ccond-mat%2F0107489%2Ccond-mat%2F0107310%2Ccond-mat%2F0107063%2Ccond-mat%2F0107300%2Ccond-mat%2F0107199%2Ccond-mat%2F0107410%2Ccond-mat%2F0107473%2Ccond-mat%2F0107504%2Ccond-mat%2F0107292%2Ccond-mat%2F0107185%2Ccond-mat%2F0107220%2Ccond-mat%2F0107221%2Ccond-mat%2F0107622%2Ccond-mat%2F0107229%2Ccond-mat%2F0107135&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A simple, non-disordered spin model has been studied in an effort to\nunderstand the origin of the precipitous slowing down of dynamics observed in\nsupercooled liquids approaching the glass transition. A combination of Monte\nCarlo simulations and exact calculations indicates that this model exhibits an\nentropy vanishing transition accompanied by a rapid divergence of time scales.\nMeasurements of various correlation functions show that the system displays a\nhierarchy of time scales associated with different degrees of freedom. Extended\nstructures, arising from the frustration in the system, are identified as the\nsource of the slow dynamics. In the simulations, the system falls out of\nequilibrium at a temperature $T_{g}$ higher than the entropy-vanishing\ntransition temperature and the dynamics below $T_{g}$ exhibits aging as\ndistinct from coarsening. The cooling rate dependence of the energy is also\nconsistent with the usual glass formation scenario."}, "authors": ["Hui Yin", "Bulbul Chakraborty"], "author_detail": {"name": "Bulbul Chakraborty"}, "author": "Bulbul Chakraborty", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.65.036119", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0107322v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0107322v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "41 pages, 16 figures. Bibliography file is corrected", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0107322v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0107322v2", "journal_reference": null, "doi": "10.1103/PhysRevE.65.036119", "fulltext": "Slow dynamics and aging in a non-randomly frustrated spin\n\narXiv:cond-mat/0107322v2 [cond-mat.stat-mech] 24 Jul 2001\n\nsystem\nHui Yin and Bulbul Chakraborty\nMartin Fisher School of Physics, Brandeis University, Waltham, MA 02254.\n(November 5, 2018)\n\nAbstract\n\nA simple, non-disordered spin model has been studied in an effort to\nunderstand the origin of the precipitous slowing down of dynamics observed\nin supercooled liquids approaching the glass transition. A combination of\nMonte Carlo simulations and exact calculations indicates that this model\nexhibits an entropy vanishing transition accompanied by a rapid divergence\nof time scales. Measurements of various correlation functions show that the\nsystem displays a hierarchy of time scales associated with different degrees of\nfreedom. Extended structures, arising from the frustration in the system, are\nidentified as the source of the slow dynamics. In the simulations, the system\nfalls out of equilibrium at a temperature Tg higher than the entropy-vanishing\ntransition temperature and the dynamics below Tg exhibits aging as distinct\nfrom coarsening. The cooling rate dependence of the energy is also consistent\nwith the usual glass formation scenario.\n\nI. INTRODUCTION\n\nThe exact nature of the glass transition in supercooled liquids is still an enigma. The\nhallmark of this transition is a precipitous slowing down of the dynamics without any accom1\n\n\fpanying, obvious, structural changes [1,2]. The analogous transition in spin glasses, which\nhave quenched randomness, is much better understood and the theoretical understanding in\nthat field has benefitted from the existence of simple microscopic models [3]. A search for\nmodels which do not have disorder at the microscopic level but display glassy dynamics has\nbeen one of the important directions of current research. In this paper, we present a detailed\nanalysis of a non-disordered spin model whose phenomenology is remarkably similar to that\nof supercooled liquids. The model can be solved exactly in a certain limit [4], and the exact\nresults can be related to the glassy dynamics observed in simulations of the model. This\nconnection can be exploited to address the issue of the origin of the rapid divergence of time\nscales [5] in supercooled liquids.\nIt is well known that relaxation times diverge at a critical point [6], however, unlike\ncritical points, there is no obvious length-scale divergence that has been associated with the\nglass transition. Recent experiments [2,7,8] and simulations [9] point toward the existence\nof dynamical heterogeneities [2,7,8] and a time-dependent length scale [9] which grows as\nthe glass transition is approached. This raises the question of whether the occurrence of a\ncritical point is responsible for the anomalously slow relaxations observed in glasses, and if so\nwhat is the nature of this critical point. A scenario proposed by Adam,Gibbs and DiMarzio\nis that glassy dynamics is associated with an underlying configurational entropy vanishing\ntransition [10,11]. The slow relaxation is due to the small equilibrium entropy near glass\ntransition temperature and the growing length-scale is associated with cooperatively relaxing\nregions. This theory is compatible with Kauzmann's entropy crisis argument [12], which\npredicts a lower limit of the glass transition temperature and is supported by experiments\nmeasuring configurational entropy in the glass forming liquids [13]. In recent years, this\nscenario has been explicitly realized in p-spin spin glasses as a random first order transition\n[14–17]. Based on an inherent structures approach [18], indications of a similar scenario\nhave been found in simulations of Lennard-Jones systems [19]. Another possibility that has\nbeen suggested to reconcile the observed time-scale divergence with no apparent length scale\ndivergence is the existence of a zero-temperature critical point [20] which has characteristics\n2\n\n\fsimilar to the critical point in a random-field Ising model [21]. A major obstacle in obtaining\ndefinitive answers is the identification of simple, non-disordered models where such scenarios\nare explicitly realized.\nIn recent years, studies have focused on microscopic models with no quenched disorder\nwhich exhibit glassy dynamics. Models in this category include a ferromagnetic four-spin\nplaquette model on a cubic lattice [22] which exhibits aging [23], three-dimensional Ising\nmodels with competing nearest and next-nearest neighbor interactions [24] exhibiting logarithmic growth. Besides these, there are constrained dynamics models, as for example, the\ntwo-dimensional ferromagnetic Ising model with three-spin interactions [25]. The presence\nof a critical point has not been related to the glassy dynamics in any of these models.\nThe model studied in this paper is the compressible, triangular-lattice, Ising antiferromagnet(CTIAFM) [26]. We will present results of a Monte Carlo(MC) simulation study\nof the dynamics in the supercooled state of CTIAFM and an exact solution in the limit\nof vanishing \"thermal\" fluctuations. The exact solution exhibits a critical point which is\naccompanied by a vanishing of configurational entropy. The model and its equilibrium behavior are discussed in section II. In section III, we introduce a mapping of the spin model\nto a geometrical model and the exact solution is discussed in section IV. In section V and\nVI, we present our MC study of the supercooled phase and the glass phase, respectively.\nOur conclusions are presented in section VII.\n\nII. CTIAFM MODEL\n\nThe CTIAFM is a simple extension of the well known triangular-lattice Ising antiferromagnet(TIAFM) [27,28]. The TIAFM is a fully frustrated model and has no finite temperature transition. The number of ground states is exponentially large, and the T = 0 state is\ncritical, characterized by a power law decay of spin correlation functions [29]. The critical\nground state has been studied extensively by mapping to interface models [30,31]. The effect\nof degeneracy-lifting fields on the TIAFM and the resulting possibility of phase transitions\n3\n\n\fhas also been the subject of many investigations [28,30,32,33].\nIn CTIAFM, a coupling to elastic strain fields removes the degeneracy of the ground\nstate [34]. In our current study only homogeneous strain fields are considered; the distortion\nis uniform and does not depend on the site. Thus, the additional degrees of freedom are\nencapsulated in three strain fields, {eα , α = 1..3}, in the Hamiltonian:\nH=J\n\nX\n\nS S − ǫJ\n<ij> i j\n\nX\n\ne\nα α\n\nX\n\n<ij>α\n\nSi Sj + N\n\nEX 2\ne .\n2 α α\n\n(1)\n\nHere J, the strength of the nearest-neighbor anti-ferromagnetic coupling, is modulated by\nthe presence of the second term which defines a coupling between the spins and the strain\nfields {eα }. The coupling ǫ is chosen to be a positive constant to ensure that antiferromagnetic interaction gets stronger when spins get closer. The last term represents the elastic\nenergy needed to stabilize the unstrained lattice and N is the total number of lattice spins.\nThis model can be thought of as a spin model with anisotropic couplings. The anisotropic\ncouplings are determined by the strain fields and are, therefore, annealed variables as opposed to models with fixed (quenched) anisotropy [28,30].\nThe phase transitions of this model were analyzed in the context of the effects of elastic\nstrain fields on ordering transition in alloys [26]. This, and other previous studies, showed\nthat the competition between energy and entropy leads to a first order transition at a finite\ntemperature T1 [34,35]. Above T1 , the system is in a disordered, paramagnetic state and the\nlattice is contracted isotropically in three directions. Below T1 , there is a lattice distortion\nand the spins order as stripes with alternating up and down rows: the ferromagnetic bonds\nare elongated, and antiferromagnetic bonds are contracted. The ordered state is six fold\ndegenerate since up and down spins rows can alternate in any of the three nearest neighbor\ndirections and the state also has the Ising up-down symmetry. Thus, the CTIAFM groundstate entropy density is zero. It has been argued that there is an instability to the lattice\ndistortion at a temperature below T1 [34]. In the following section, we introduce a geometrical mapping which is valid for all spin configurations within the ground-state ensemble of\nthe TIAFM and study phase transitions within this ensemble as the coupling to the strain\n4\n\n\ffields is varied. The model can be exactly solved in this limit where excitations out of the\nTIAFM ground state, the \"thermal\" fluctuations, are neglected.\n\nIII. STRING PICTURE– CTIAFM REVISITED\n\nThere is a well-known mapping of the ground states of the TIAFM on to string configurations [30,33]. This string picture has proven to be extremely useful in understanding the\nbehavior of the CTIAFM.\nAny spin configuration belonging to the ground state of the TIAFM has two antiferromagnetic(satisfied) bonds and one ferromagnetic(unsatisfied)bond in every triangular plaquette. A dimer covering [33,36] can be defined on the dual lattice for these spin states.\nThe dimers are placed on the those bonds of the dual honeycomb lattice which connect the\ncenters of triangles sharing an unsatisfied (ferromagnetic) bond. Since there is exactly one\nunsatisfied bond for every triangle, any site on the dual lattice is connected to exactly one\ndimer. The resulting dimer covering is unique. Fig.(1a) shows such a dimer covering for\nan arbitrary ground state. Under this dimer mapping, the spins in the striped phase define\na dimer covering (Fig.(1b)), where all dimers are aligned in one direction (vertical in this\nexample). Based on the dimer mapping, the ground states can be categorized into different\nsectors by superposing a dimer covering onto the standard dimer covering in Fig.(1b) where\nall dimers are vertical. The overlap defines linear structures. For example, the spin state in\nFig.(1a) is mapped onto the string picture in Fig.(2a). Each string sector is characterized\nby a string number density p =\n\nNs\nL\n\nwhere Ns is the total number of strings and L is system\n\nsize. Under such mapping, the disordered paramagnetic states with the maximum number\nof free spins [29] correspond to p =\n\n2\n3\n\nand the striped ordered spin states correspond to\n\np = 0. For each string sector p, the total number of spin states can be enumerated by using\na transfer-matrix technique [33]. The associated entropy density is a continuous function\nwhich peaks at p =\n\n2\n3\n\nand vanishes at p = 0 (cf inset to Fig. 3).\n\nThe strings obtained from the TIAFM ground state spin configurations do not intersect.\n5\n\n\fThey run vertically through the system without being interrupted, therefore, the number of\nstrings per row is conserved. Under periodic boundary conditions, strings wrap around and\nform loops. If the system is restricted to the TIAFM ground state ensemble, the number of\nstrings does not change under any local dynamics(single or multiple spin flips or exchanges).\nThus, spin states belonging to different string number sectors are completely disjoint. These\nstring sectors are the inherent structures [18] of the TIAFM within any local dynamics: any\nspin configuration will relax to one of the string sectors under energy minimization.\nExcitations out of the TIAFM ground state ensemble involve triangular plaquettes with\nall three spins pointing up or down. These plaquettes are topological defects at which the\nstrings can end [30]. The TIAFM ground states and the associated dimer coverings can be\nmapped to an interface model with a scalar height variable [30,31,37] and the defects are\ndislocations in the height field. The height mapping can be used to demonstrate that the\nTIAFM ground-state is critical with power-law correlations and the defects form the basis\nof the Coulomb-gas representation of this model [30]. Defects play an important role in the\ndynamics of the strings [38]. Single spin flips or exchanges create defects in pairs which can\nthen move away from each other. Each separated defect pair is connected by two strings.\nThus, defects can increase or decrease the number of strings by two as they move toward or\naway from each other.\nA previous Monte Carlo study has shown that when quenched below the first order\ntransition temperature T1 from the disordered phase, the CTIAFM exhibits a behavior\nremarkably similar to the phenomenology of the structural glass [35,38]. For a range of\nsupercooling temperatures, the system remains disordered and the supercooled phase is\nergodic. Below a certain characteristic temperature T ∗ , however, the system freezes into a\n\"glassy\" phase. In this phase, the system becomes non-ergodic and the energy evolution is\ncharacterized by a step-wise relaxation which is history dependent.\nIn this work, we present an analytic solution of the CTIAFM within the ground-state\nensemble of the TIAFM and show that the coupling to the elastic strain fields leads to a\nphase transition at which the string density vanishes discontinuously. We analyze the glassy\n6\n\n\fdynamics observed in Monte Carlo simulations in terms of the string picture and the phase\ntransitions occurring within the ground-state ensemble [4].\n\nIV. PHASE TRANSITIONS WITHIN THE GROUND-STATE ENSEMBLE OF\nTHE TIAFM\n\nThe string picture is rigorously defined when the spin states are restricted to the configurations without any defects. In the TIAFM, all these configurations have identical energies.\nIn the CTIAFM, however, the energy of the state depends on the string density [4]. To\nsee this, one integrates out the purely Gaussian strain fields in the CTIAFM Hamiltonian\n(Eq. 1) which yields an energy function with a four-spin coupling and a coupling parameter\nμ = ǫ2 J 2 /E:\nH=J\n\nX\n\nS S − (μ/N)\n<ij> i j\n\nX\n\n(\nα=1,2,3\n\nX\n\n<ij>α\n\nSi Sj ) 2 .\n\n(2)\n\nThe first term is identical for all configurations in the ground state ensemble, and can be\nneglected. The sum\n\nP\n\n<ij>α Si Sj ,\n\ncan be written in terms of the string density in the direction\n\nα, i.e., the overlap of the dimers with a configuration where all dimers are pointing in the α\ndirection. Under simple periodic boundary conditions, where each string wraps around only\nonce around the system, two of the three string densities have to be equal. In addition, the\nconstraint that there are two good bonds per triangular plaquette, leads to the condition\nthat the sum of the three string densities have to add up to the numerical value of two.\nWith these constraints, only one string density is independent and the energy per spin of\nthe CTIAFM can be written as\nH/N = −(μ/2)[(1 − 2p)2 + 2(1 − p)2 ] ,\nwhere p is the one independent string density.\n\n(3)\n\nSince the energy depends only on\n\nthe string density and the entropy density for a given string density has been calculated exactly [33], the partition function of the model can be calculated exactly: Z =\n7\n\n\fP\n\np\n\nexp (−N(βH(p) − γ(p))) =\n\nP\n\np\n\nexp (−Nf (p)). Here γ(p) is the entropy per spin of the\n\nstring sector with string density p [33] and β is the inverse temperature. The sum over p\ncan be replaced by exp (−Nfmin (p)) where fmin (p) is f (p) evaluated at the string density\np which minimizes the free-energy function f (p). This free-energy function, which is exact\nif excitations out of the ground-state ensemble of the TIAFM are neglected, is shown in\nFig (3). At small coupling constants, the free energy function shows a single global well at\np = 32 . As the coupling constant is increased, a second minimum develops at p = 0. A first\norder transition is expected at that value of the coupling constant where the two minima\nbecome degenerate. In our model the four-spin coupling is of infinite range and the barrier\nto nucleation is unsurmountable. If the system is initially in the p = 2/3 state, it will remain\nindefinitely in this state. At a higher coupling constant, however, the p = 2/3 state becomes\nunstable, as shown in Fig. (3). This is akin to a spinodal point [39] except that the order\nparameter is the string density which involves extended structures and is not the average of\nany local quantity. The instability of the 2/3 state is also an entropy vanishing transition\nsince the entropy of the p = 0 state is zero.\nWithin the ground-state ensemble of the TIAFM, no local dynamics can change the\ndensity of strings. The entropy-vanishing transition can, therefore, be realized in two ways;\n(a) allowing for the system to explore states outside the ground-state ensemble by creating\ndefects and (b) implementing a non-local dynamics which can change the string density\nwithout moving out of the ground-state ensemble. In this paper, we discuss the dynamics\nresulting from the first approach by allowing for the presence of a small density of defects.\nAs will be discussed in the next section, we concentrate on analyzing the nature of the\nrelaxations as the entropy-vanishing transition is approached without addressing the issue\nof whether this transition survives as a true thermodynamic transition in the presence of\ndefects.\nBefore proceeding to the discussion of the simulations, we would like to point out that\nthe the entropy-vanishing transition is akin to a zero-temperature critical point since the\n\"thermal\" fluctuations, in the form of defects, are frozen and play no role at the critical\n8\n\n\fpoint. The relevant coupling is βμ, the coupling to the elastic strain which controls the\nfrustration [20]. This scenario is reminiscent of the zero-temperature critical point in the\nrandom-field Ising model [21] with βμ playing the role of the random field.\nThe exact solution can also be viewed in the context of inherent structures [18,19] and\nshows that there is a phase transition involving these structures. At small values of βμ, the\ninherent structures belong to the p = 2/3 sector and the configurational entropy is finite.\nAs βμ is increased, there is a thermodynamic instability of this sector leading to a change\nin the nature of the inherent-structure landscape. The set of inherent structures that are\naccessible to the system, thus, changes at the transition. As our simulations will show, this\nchange can lead to an anomalous slowing down of the dynamics.\n\nV. DYNAMICS IN SUPERCOOLED PHASE\n\nIn this section we present a detailed discussion of the observed dynamics in the supercooled phase. To implement the local dynamics we used spin-exchange kinetic extended to\ninclude updates of the homogeneous strain fields [26]. For the Monte Carlo (MC) studies\npresented in this paper, a rhomboid system with periodic boundary conditions was chosen.\nUnless stated explicitly, the system size is 96x96. For all the measurements, the sampling\nis done every ten MC steps. The parameters of the Hamiltonian were chosen to be; J = 1,\nǫ = 0.6 and E = 2. These imply a value of μ = 0.18 and the coupling constant βμ is controlled by the temperature of the MC simulation. In units of\n\nJ\nkB\n\n, the first-order transition\n\ntemperature is T1 = 0.667, and the entropy-vanishing transition temperature is T ∗ = 0.397\n[4]. The defect density at temperatures close to the entropy vanishing transition, T ∗ , is\naround 0.04% [4]. We study this regime in order to investigate the possibility of the zerodefect critical point controlling the behavior at low but finite defect densities.\nDynamics of the supercooled phase was studied following instantaneous quenches from\na random high-temperature disordered phase into a range of temperatures below T1 . After\neach quench, the system was equilibrated, and the time-history of various quantities were\n9\n\n\frecorded, and auto-correlation functions were calculated. The evidence for diverging time\nscales has been presented earlier [4]. In this paper, we extend our analysis to the many\ndifferent time scales observed and the relationship between them.\n\nA. Relaxations of strings and spins\n\nThe MC moves involve spin exchanges and updates of the strain fields. Updates in\nstrain fields change the effective interaction between spins along the three nearest-neighbor\ndirections and this is reflected in the update probabilities associated with the spin exchanges.\nSince the strain fields are homogeneous, these changes are global.\nThere are different classes of spins in the system. The free spins have equal numbers\nof antiferromagnetic and ferromagnetic bonds. They are represented as filled circles in\nFig.2 and are located at kinks in the strings. Spin exchanges involving free spins lead to\nfluctuations of the strings. Exchanges involving spins located away from the kinks (which\nare not free) lead to the creation of defects. This is an activated process with an energy\nbarrier of 4J in the absence of any homogeneous strains. The strain fluctuations change\nthis value since the effective interactions become anisotropic and depend on the value of\nthe strain fields. We found that the defect density can still be represented by an Arrhenius\nform with an \"effective\" barrier which is smaller than 4J [40]. The two different classes\nof spins therefore have very different relaxation time scales with the free spins defining the\nshortest time scale in the system and the time scale associated with the defects growing in\nan Arrhenius fashion. The dynamics of the spins is, therefore, expected to be heterogeneous\nand controlled by the spatial distribution of strings.\nThe spatial distribution of the strings evolves in time as the strings diffuse across the system. Since the string density is the order parameter associated with the entropy-vanishing\ntransition, this is expected to be the slowest mode in the system. The spins, therefore,\nrespond to a quasi-static arrangement of the strings. This would lead us to expect nonexponential relaxations for the spins and the energy fluctuations (dominated by defect num10\n\n\fber fluctuations) since relaxation times depend on the proximity of the spins to the strings.\nOur simulation results are in qualitative agreement with these expectations.\nThe auto-correlation functions of the string density, Cstring (t) =< p(t)p(0) > − <\np(t) >2 , at different temperatures are shown in Fig.4. The correlations functions are seen\nto be exponentials, exp(− τt ), with τ rapidly increasing as the temperature decreases. The\ntime scales τ obtained from the fitting are plotted versus temperature in Fig.5. The two\nremarkable features of the string relaxation are (a) the exponential behavior with a single\ntime scale and (b) the rapid increase of this time scale with an apparent divergence at a temperature close to T ∗ . We will discuss these features in the context of the entropy-vanishing\ntransition after presenting the results for the defect, energy and spin relaxations. The rapid\nincrease of the string-relaxation time scales, restricts our equilibrium measurements to temperatures T ≥ Tg ≃ 0.47, the analog of the laboratory glass-transition temperature for our\nsimulations.\nThe auto-correlation functions of the defect number, Cdef ect (t) =< Nd (t)Nd (0) > − <\nNd (t) >2 where Nd is the total number of defects, are shown in Fig.6a. These functions\nare non-exponential and are best fit by stretched exponentials, exp(− τtd )β , with a stretching\nexponent β decreasing with temperature and a relaxation time τ increasing with temperature. The time-scale increase is Arrhenius (Fig 6b) with no apparent finite-temperature\ndivergence. The stretching exponent approaches a value of 1/3 as the temperature approaches Tg . This is consistent with a theory associating stretched exponential relaxations\nwith random walks on a high-dimensional critical percolation cluster where the limiting\nvalue of β = 1/3 is reached at percolation [41]. The energy relaxation (Fig (7)) also shows a\nstretched exponential form with a β approaching 1/3. Fig. (7) also shows the waiting-time\n(tw ) dependence of the correlations functions (cf. discussion in section VI). The relaxation\ntimes and stretching exponents are summarized in Table (I). The energy relaxation time\nshows a stronger divergence than the Arrhenius behavior of the defects, however, the absolute values of the time scales are orders of magnitude smaller than the string-relaxation\ntimes. The stretched exponential relaxation indicates that the energy and defect relaxations\n11\n\n\fare reflecting the spatial heterogeneity imposed by the strings and their slow relaxation.\nThe spins are the basic microscopic entities in the system and the relaxations of the\nstrings and defects get reflected in the spin relaxation. Spin auto-correlation functions at\ndifferent temperatures are shown in Fig.8. These obey a power law decay with an exponential\ncutoff; C(t) ≃ tα exp (− τts ). As Tg is approached from above, the relaxation time τs increases\nexponentially and closely tracks the string relaxation time. The exponent α decreases with\nT and the value is close to 1/4 at T = 0.47. The results from the fits are shown in Table (II).\nThe exponent\n\n1\n4\n\ncharacterizes spin relaxation in the critical ground state of the pure TIAFM.\n\nThis suggests that for times short compared to the string relaxation times, the spins respond\nas they would in the TIAFM ground state ensemble, except for the perturbation due to defect\ncreation and annihilation; an effect that decreases with decreasing temperature.\nThe results of the simulations discussed above, show that there are multiple relaxation\nmechanisms in the supercooled state of the CTIAFM and that the spin and energy relaxations become increasingly non-exponential as the temperature approaches T ∗ . The slowest\nmode, the string-density, is characterized by a single time scale. The string density is the\n'order-parameter' for the entropy-vanishing transition and the exponential relaxation is consistent with a mean-field transition. Since the strings are extended objects, their relaxations\ncreate a spatially heterogeneous environment for the local degrees of freedom, the spins and\nthe defects, providing a mechanism for the stretched exponential relaxations. The observation of a stretching exponent similar to that appearing in the theory based on percolations\nclusters [41] is intriguing and suggests that the possibility of such a scenario occurring in\nthe CTIAFM should be explored further.\nWe have argued that the entropy-vanishing transition at T ∗ can lead to the anomalously\nslow dynamics observed in our simulations because the time scale of order-parameter relaxations diverges at this transition and because the order parameter involves extended objects\nwhich can create spatial heterogeneities. A remaining puzzle is the rapidly increasing time\nscale associated with the string-density relaxation. The rise in time scales is much faster\nthan what would be expected from usual critical slowing down. This becomes evident upon\n12\n\n\fcomparing the increase of the static susceptibility (associated with the string density) which\nis expected to diverge at T = T ∗ , with the increase in time scales. In the temperature\nregime between 0.6 and 0.47, the static susceptibility increases by a factor of 2 whereas the\nrelaxation time increases by a factor of ≃ 50. As shown in Fig. 5, the rapid increase of τ\ncan be described well with either the Vogel-Fulcher exponential increase [42] or a power law\nwith a large exponent. We do not have an explanation of this anomalously fast increase of\nthe time-scale, however, all our observations suggest that this is an intrinsic property of the\nentropy-vanishing transition and that the extended structures play a crucial role. Further\nevidence supporting the claim that the entropy vanishing transition has a different character\nthan a usual mean-field critical point, was provided by a study of the fluctuations in string\ndensity over different time intervals.\n\nB. Distribution function of String Number Deviation\n\nThe nature of the string-density fluctuations was monitored by measuring the distribution\nof the string density difference P (∆p(t)), where ∆p = p(t + t0 ) − p(t0 ) defines the deviation\nof the string density in the time t. The distribution is generated by choosing different\ntime origins t0 . Fig.9 shows the distribution P (∆p) for T = 0.55 and T = 0.47. For\nhigh temperatures, both at short and long time intervals t, the distribution is close to a\nGaussian. At t = 0, P (∆p) is just a δ function peaking at ∆p = 0. As t increases, the width\nof the distribution gets broader. At some intermediate time, the non-Gaussian behavior\nbecomes most prominent. After that, the distribution narrows down back to a Gaussian\nand reaches a stationary Gaussian distribution. At T = 0.55, the distribution become most\nnon-Gaussian at t = 4000. As T decreases, this intermediate time scale increases rapidly,\nand at T = 0.47, the distribution becomes broader and broader with t, and the stationary\ndistribution is not observed for times as long as t = 30, 000. According to the usual picture\nof the dynamics of a system near a critical point, the distribution of the order parameter\ndifference is expected to become stationary at a time scale comparable to the relaxation\n13\n\n\ftime which increases rapidly as the critical point is approached [6]. The distribution is also\nexpected to show significant non-Gaussian character at T ∼ Tc (L), where L is the system\nsize. To make a direct comparison, a measurement of the magnetization deviation, similar to\nthe measurement of the string-density deviation, was undertaken for an Ising ferromagnet on\na square lattice with L = 64. The distribution of magnetization deviation at time interval\nt, P (M(t0 + t) − M(t0 )), was found to reach a stationary distribution for different T as\nshown in Fig.10. It is evident that this behavior is different from what was observed for the\nstrings. This difference between the strings relaxation behavior and that of the usual order\nparameter, however, is not reflected in Cstring (t). The equilibrium Cstring (t) can be directly\nrelated to the second moment of the distribution P (∆p(t)) as:\n< (∆p(t))2 > = < (p(t) − p(0))2 > = 2 < p2 > −2 < p(t)p(0) >\n= 2(< p2 > − < p >2 )(1 −\n\n< p(t)p(0) > − < p >2\n)\n< p2 > − < p > 2\n\nThus,\nCstring (t) =\n\n< (∆p(t))2 >\n< p(t)p(0) > − < p >2\n=\n1\n−\n.\n< p2 > − < p > 2\n2(< p2 > − < p >2 )\n\nWe have measured < (∆p(t))2 > and find that < (∆p(t))2 > increases monotonically with\nt despite the non-Gaussian behavior at the intermediate time. Therefore, a measurement of\nthe second moment is not an adequate measure of the complexity of the relaxation.\nThis picture of the string-density relaxations is sufficiently different from the commonly\naccepted picture of order parameter relaxations to justify further investigation. One obvious\nquestion that needs to be answered is whether the defect-mediated dynamics is responsible\nfor the behavior or whether the zero-defect critical point is controlling it. We are in the\nprocess of exploring these issues.\n\nC. Spin dynamics in different string-density sectors\n\nTo better understand the effect of \"quenched-in\" spatial heterogeneities due to slow\nstring relaxations, we studied spin relaxations in different string-density sectors. In order\n14\n\n\fto fix the system in a certain string density sector, the simulation was started from an\ninitial spin configuration which has the desired string density, and then was run at very\nlow temperature (T = 0.05). At this temperature, the energy barrier for creating defects\nis too large to be overcome within timescales comparable to the spin relaxation times and\ndefects are effectively excluded from the system. String density stays at the initial value\nthroughout the simulation time. The strain elastic energy scale is much smaller than that\nof defect creation, and the fluctuation of strain is finite though very small.\nFig.11 is a log-linear plot which shows the spin auto-correlation functions for different\nstring sectors. The nature of the relaxation is different for different p. When p ≥ 0.25,\nthe relaxation can be described as a power law with exponent ≃ 0.27. For p ≤ 0.25,\nthe relaxation can be best fitted to stretched exponentials with the exponents around\n\n1\n3\n\n(cf\n\nTable (III)). This analysis shows that spin relaxations are different in different string-density\nsectors and suggests that the non-exponential relaxations observed in our free simulations,\nwhere the string density is allowed to fluctuate, is due to this heterogeneous dynamics.\n\nVI. DYNAMICS IN THE GLASS PHASE\n\nIn the last section we analyzed the dynamical behavior of the supercooled state as it\napproaches T ∗ . In this section, we look at the dynamical behavior in the glass phase after\nthe system is quenched below T ∗ . The dynamics is studied through the measurements of\ntwo-time correlation functions and the overlap of different copies of the system. We also\ninvestigate the cooling-rate dependence of various quantities in a series of continuous cooling\nsimulations.\n\nA. Aging\n\nA characteristic feature of the dynamics of many non-equilibrium systems, including\na glass, is aging. In the supercooled phase, the system behaves as if it is in metastable\nequilibrium and correlation functions are time translational invariant. In the glass phase,\n15\n\n\fthis is no longer true. Although a one-time quantity such as an energy history might show\nmetastability as in the supercooled phase, two-time quantities reveal that the system is\nevolving in an important way. The aging of systems can be probed with the correlation\nfunctions, which exhibit a waiting time dependence: the system behavior depends on its\nage. In Fig 7, energy auto-correlation functions for different waiting times after the system\nhas been quenched into supercooled phase(T=0.55) and glass phase (T=0.45) are shown.\nThe aging of the system is clearly seen at T=0.45.\nUnder this loose definition of aging, all non-equilibrium systems age. To distinguish\nbetween different types of aging systems, measurements have been proposed which can\nclassify aging systems into different categories reflecting the complexity of the systems.\nWe use the approach suggested by Barrat et al [43] in our study of the CTIAFM. These\nauthors propose a classification method based on the measurement of an overlap between two\nidentical copies of the system which distinguishes the aging of glassy systems from domain\ncoarsening as in an Ising ferromagnet quenched below its critical temperature.\nIn order to measure the overlap, two copies of the system are prepared with the same\ninitial configurations and are evolved with the same thermal noise until a time tw . At time tw ,\nthe two copies are separated and subsequently evolve with different realizations of thermal\nnoise for a time t. The function Q(tw , t) measures the overlap of these two configurations at\nthis time. The quantity limtw →∞ limt→∞ Q(tw , t) distinguishes different types of aging. The\nlimit of t → ∞ can be effectively replaced by the limit of correlation function C(tw , t) → 0.\nFor glassy dynamics, the overlap approaches zero as the correlation C(tw , t) decays to zero\nwhereas for coarsening systems the overlap approaches a finite value as the correlation decays\nto zero [43]. This classification highlights the simplicity of phase space of a coarsening system\nagainst the complexity of phase space in a glassy system. If the phase space is complicated,\ndifferent copies of the system with the same age continuously move apart from one another\nand the overlap goes to zero in the limit of C(tw , t) going to zero. In contrast, the simple\ncoarsening systems have a finite limit of this overlap. This method has been employed in\nthe studies of many different models including the ferromagnetic p-spin model [23] where\n16\n\n\fthis approach was used as proof of the system being glassy.\nAging in CTIAFM was investigated by equilibrating the system in a high temperature phase (T = 1.0) and instantaneously quenching it to T = 0.35, a temperature below T ∗ . The system size used in these studies was 120x120. The simulation was run\nfreely for a time tw and then three copies of the system were made and assigned different sets of random noise. For different values of tw , the correlation function within each\ncopy, C(tw , t) =\nQ(tw , t) =\n\n1\nN\n\nP\n\n1\nN\n\nP\n\n(1)\n\ni\n\ni\n\nSi (tw )Si (t + tw ) and the overlap between different pairs of copies,\n(2)\n\nSi (t + tw )Si (t + tw ), were monitored. The average of these (at a given\n\n(tw , t)) were stored as Q(tw , t) and C(tw , t). These functions are shown in the bottom panel\nof Fig.12 and clearly demonstrate the dependence of the correlation and overlap on the waiting time tw . The decay of these functions become slower with increasing waiting time. We\nchose to average over regimes of tw small compared to the time over which the correlation\nand overlap change significantly but large enough to provide us with better statistics. A\nmore quantitative study will have to involve better averaging of data at each tw because of\nthe history-dependent nature of the glass. Although Q(tw , t) and C(tw , t) decay at different\nrates for different tw , they track each other as can been seen from the top panel in Fig.12.\nFor values between 0.3 and 1 of Q(tw , t) and C(tw , t), the dependence of Q on C is nearly\nlinear. Below 0.3, the curves have a smaller slope and extrapolate to zero as C(tw , t) goes\nto zero. The data below 0.1 (not shown in the plot) is noisy because of variations from one\ntw to another but definitely exhibit the trend of Q(tw , t) for different tw approaching zero as\nC(tw , t) goes to zero.\nThe trends in overlap and correlation functions indicate that the system is evolving in a\nphase space that is more complicated than that of a simple coarsening system. We probed\nthis evolution at a more microscopic level by monitoring the string density. In Fig.13(a),\nwe show the string density as a function of time for the master run from which copies of\nthe system were made. The arrows mark the different tw 's at which copies were made. The\nevolution of the string densities for each of the three copies, created at a given tw , are shown\nin Fig.13(b),(c),(d). These figures demonstrate that the overlap, Q(tw , t) vanishes as t → ∞\n17\n\n\fbecause the system can explore different string sectors even when the string density is close\nto zero and the waiting time is very long. The decay rate of Q(tw , t) and C(tw , t) depends\non the string sector that the system is at, initially. The further the string density is from 23 ,\nthe fewer the number of states available in the sector implying stronger memory and slower\ndecay. The tracking of C(tw , t) by the overlap Q(tw , t) is, however, an intrinsic property\nof the system and does not depend on the string sector. This property implies that as the\nrelaxation slows down so does the rate at which two copies meander away from each other.\nIn order to distinguish the overlap behavior described above from that of a simple system at times earlier than the equilibration time, we performed similar measurements after\nquenching a triangular Ising ferromagnet with the same system size to just above Tc . We\nare particularly interested in the overlap of the system at waiting times smaller than the\nequilibration time. As seen from Fig. 14, at a waiting time tw = 50, the overlap approaches\na finite value as the correlation decays to zero. At longer tw , after the system has reached\nequilibrium, the overlap and correlation function are independent of tw . In this regime,\nit can be easily shown that the overlap is trivially related to the correlation function and\nalways goes to zero following the correlation [44]. The short waiting time behavior of the\nferromagnetic model is obviously different from what we saw in CTIAFM and we would like\nto attribute this difference in behavior to the difference in the complexity of the free energy\nlandscape.\n\nB. Effects of cooling rate\n\nThe easiest way to obtain a glass from a liquid is to cool the liquid fast enough. If the\nrelaxation time scale of the liquid at a certain temperature becomes larger than the time scale\nassociated with the cooling rate, the liquid fails to reach equilibrium and becomes a glass.\nDifferent cooling rates cause the liquid to fall out of equilibrium at different temperatures,\nwhich implies different laboratory glass transition temperatures. The resulting glass is a nonequilibrium system and its properties will in general depend on its history of production.\n18\n\n\fIn this section we will explore the cooling rate dependence of CTIAFM. In Monte Carlo\nsimulation of cooling the model glass, we define the cooling rate (γ) as\nγ=\n\ndT\n,\ndt\n\nwhere dt is the number of Monte Carlo steps per spin over which the temperature changes\nby dT . The simulations were started with the equilibrium configuration at high temperature\nT=5.0, and the energy was measured as a function of temperature during the cooling run.\nThe temperature dependence of the energy for different cooling rates is shown in Fig. 15.\nAs seen from Fig. 15, the faster cooling rates make the system fall out of equilibrium at\nhigher temperatures and the energy at the end point is higher. A closer look at the end\nconfigurations has shown that for different cooling rates, the end configurations at T=0 all\nbelong to the\n\n2\n3\n\nstring density sector, but with different defect densities. The faster the\n\ncooling rate, the higher the defect density and no local ordering was observed at the end\nof the cooling runs for any of the cooling rates. Since this is a mean field model and local\nstrain fluctuations are not allowed, such local ordering is suppressed. With the time scales\ncorresponding to the cooling rates, the string density does not have enough relaxation time\nto explore string density sectors other than 23 . At low temperatures, where the defect density\nis small, the energy of the system can be written as E(T ) ≃ Estring (p) + Edef ect (T ) where\nthe first term is the energy of string sector p in zero defect situation, and the second term\nis the excitation energy arising from a non-zero defect density, ρ(T ), and can be written\nas Edef ect (T ) = E0 ρ(T ). For infinitely slow cooling, the defect number density ρ(T ) is\nexpected to be Arrhenius. Since the system gets stuck at p = 32 , Estring (p) is a constant\nequal to Estring ( 32 ). The energy fluctuation of the system is mainly from the contribution\nof Edef ect (T ), the dynamics of the system is dominated by the relaxation of defects. In\nthis picture, the system will fall out of equilibrium at temperatures where ρ(T ) falls out\nof equilibrium at different cooling rates. So by cooling continuously into low temperature\nregime we are essentially probing the dynamical behavior of the defects. From the measured\ndependence of the energy on temperature, we have extracted the behavior of ρ(T ) and\n19\n\n\fcompared it to the equilibrium defect density which has an Arrhenius form [40]. As can\nbe seen from Fig. 16, the defect number density curve ρ(T ) deviates from the equilibrium\ncurve, and the deviation occurs at lower temperatures for lower cooling rates. We, therefore,\nconclude that the cooling rate dependence of the energy in the CTIAFM arises from the\nfreezing in of non-equilibrium defect densities. If the CTIAFM was subjected to a steepest\ndescent minimization of energy at the end point configurations obtained from the cooling\nruns, the energy would be that of the p = 2/3 state and this is the limiting value reached\nfor arbitrarily small cooling rates. In this sense, the p = 2/3 configurations with no defects\nfrozen in is the ideal glass that would be obtained from slow cooling.\n\nVII. CONCLUSION\n\nIn this paper, we have presented a detailed study of a non-randomly frustrated spin system which exhibits glassy behavior as exemplified by non-exponential relaxations, rapidly\ndiverging time scales and aging. The crucial features of the model which were related to\nthe glassy dynamics are (a) the presence of extended spatial structures and (b) a phase\ntransition involving these structures which is driven by a parameter controlling the frustration in the system. The extended spatial structures are reminiscent of the dynamical\nheterogeneities observed in experiments [7] and simulations of Lennard-Jones liquids [9].\nOne of the conjectures based on our study, is that these dynamical heterogeneities are a\nconsequence of the frustration in the system and they are made up of particles which are\nin the most energetically unfavorable positions. This conjecture should be experimentally\nverifiable.\nIn our model, we have argued that the presence of a thermodynamic phase transition is\nresponsible for the glassy behavior. The nature of this phase transition is unusual in that the\ntime scale divergence is much stronger than what would be expected based on the dynamics\nof usual thermal critical points. We have no clear understanding of the source of this\nunusual behavior, however, it seems certain that the presence of the extended structures is a\n20\n\n\fcrucial factor. This observation leads to the intriguing possibility that a similar transition,\ninvolving the dynamical heterogeneities, underlies the glassy behavior in supercooled liquids.\nMeasurement of correlation functions related to the dynamical heterogeneities should shed\nsome light on this issue.\nFurther work is now in progress to identify the exact nature of the phase transition in our\nmodel. The main question that we are addressing is the reason for the rapid divergence of\ntime scales. The scenario we have observed is reminiscent of the transition in random-field\nIsing models [21] and understanding this similarity should go a long way toward answering\nthe question of what plays the role of the quenched randomness in a supercooled liquid.\nThe work of BC was supported in part by NSF grant number DMR-9815986 and the\nwork of HY was supported by DOE grant DE-FG02-ER45495. We would like to thank R.\nK. Zia, W. Klein, H. Gould, S. R. Nagel and J. Kondev for many helpful discussions.\n\n21\n\n\fREFERENCES\n[1] C. A. Angell, J. Phys. Chem. 49, 863 (1988), M. D. Ediger, C. A. Angell, and S. R.\nNagel, J. Phys. Chem. 100, 13200 (1996) W. Götze and L. Sjogren, Rep. Prog. Phys.\nB 55, 241 (1992)\n[2] M. T. Cicerone and M. D. Ediger, J. Chem. Phys 103, 5684 (1995) and references\ntherein.\n[3] M. Mezard, G. Parisi and M. A. Virasoro, Spin Glass Theory and Beyond, (World\nScientific, Singapore, 1987).\n[4] H. Yin and B. Chakraborty, Phys. Rev. Lett. 86, 2058 (2001).\n[5] C. A. Angell, Science 267, 1924 (1995)\n[6] N. Goldenfeld, Lectures on Phase Transitions and the Renormalization Group,(AddisonWesley, New York, 1992)\n[7] E. R. Weeks, J. C. Crocker, A. C. Levitt, A. Schofield, D. A. Weitz, Science 287, 627\n(2000);W. K. Kegel, A. van Blaaderen, Science 287, 290 (2000).\n[8] E. Vidal Russel and N. E. Israeloff, Nature 408, 695 (2000)\n[9] C. Donati, J. F. Douglas, W. Kob, S. J. Plimpton, P. H. Poole and S. C. Glotzer,\nPhys. Rev. Lett. 80, 2338 (1998); W. Kob, C. Donati, S. J. Plimpton, P. H. Poole, and\nS. C. Glotzer, Phys. Rev. Lett. 79, 2827 (1997); C. Donati, S. C. Glotzer, P. H. Poole,\nW. Kob, and S. J. Plimpton,Phys. Rev. E 60, 3107 (1999).\n[10] G. Adam and J. H. Gibbs, J. Chem. Phys. 43, 139 (1965), J. H. Gibbs and E. A.\nDiMarzio, J. Chem. Phys. 28, 373 (1958).\n[11] M. Mezard and G. Parisi, preprint cond-mat/0002128, and references therein.\n[12] W. Kauzman, Chem. Rev. 43, 219 (1948)\n\n22\n\n\f[13] R. Richert and C. A. Angell, J. Chem. Phys. 108, 9016 (1998).\n[14] D. J. Gross and M. Mezard, Nucl. Phys. B240, 431 (1984)\n[15] T. R. Kirkpatrick and P. G. Wolynes, Phys. Rev. A 34, 1045 (1986), Phys. Rev. A 35,\n3072 (1987), T. R. Kirkpatrick and D. Thirumalai, Phys. Rev. Lett. 58, 2091 (1987),\nPhys. Rev. B 36, 5388 (1987), T. R. Kirpatrick, D. Thirumalai, and P. G. Wolynes,\nPhys. Rev. A 40, 1045 (1989)\n[16] J. P. Bouchaud and M. Mezard, J. Phys. I 4, 1109 (1994).\n[17] X. Xia, and P. G. Wolynes, preprint cond-mat/0008432\n[18] S. Sastry, P. G. Debenedetti and F. H. Stillinger, Nature 393, 554 (1998).\n[19] S. Sastry, preprint cond-mat/0101079.\n[20] J. P. Sethna, J. D. Shore and M. Huang, Phys. Rev. B 44, 4943 (1991)\n[21] D. S. Fisher, Phys. Rev. Lett. 56, 416 (1986).\n[22] A. Lipowski, J. Phys. A 30, 7365 (1997), A. Lipowski and D. A. Johnston, Phys. Rev. E\n61, 6375 (2000), A. Lipowski, D. A. Johnston, and D. Espriu, Phys. Rev. E 62, 3404\n(2000)\n[23] M. R. Swift, H. Bokil, R. D. M. Travasso, and A. J. Bray, preprint cond-Mat/0003384\n[24] J. D. Shore and J. P. Sethna, Phys. Rev. B 43, 3782 (1991), J. D. Shore, M. Holzer,\nand J. P. Sethna, Phys. Rev. B 46, 11376 (1992)\n[25] M. E. J. Newman, and C. Moore, Phys. Rev. E 60, 5068 (1999), J. P. Garrahan and\nM. E. J. Newman,Phys. Rev. E 62, 7670 (2000)\n[26] Lei Gu, Bulbul Chakraborty, P. L. Garrido, Mohan Phani and J. L. Lebowitz, Phys.\nRev. B 53, 11985 (1996).\n[27] G. H. Wannier, Phys. Rev. 79, 357 (1950)\n23\n\n\f[28] R. M. F. Houtappel, Physica 16, 425 (1950)\n[29] J. Stephenson, J. Math Phys. A 11, 413 (1970).\n[30] Henk W. J. Blöte and M. Peter Nightingale, Phys. Rev. B 47, 15046 (1993) and references therein.\n[31] C. Zeng and C. L. Henley, Phys. Rev. B 55, 14935 (1997)\n[32] H. W. J. Blöte, H. J. Hilhorst, J. Phys. A: Math. Gen. 15, L631 (1982).\n[33] A. Dhar, P. Choudhuri and C. Dasgupta, Phys. Rev. B 61, 6227 (2000).\n[34] Z. Y. Chen and M. Kardar, J. Phys. C 19, 6825 (1986)\n[35] Lei Gu and Bulbul Chakraborty, Mat. Res. Soc. Symp. Proc 455, 229 (1997), and\ncond-mat/9612103; Lei Gu, Ph. D. Thesis, Brandeis University, 1999.\n[36] C. Zeng, P. L. Leath and T. Hwa, Phys. Rev. Lett. 83, 4860 (1999).\n[37] J. Kondev, Phys. Rev. Lett. 78, 4320 (1997); J.L. Jacobsen and J. Kondev, Nucl. Phys.\nB532, 635 (1998).\n[38] B. Chakraborty, L. Gu and H. Yin, J. Phys. Condens. Mat. 12, 6487 (2000)\n[39] W. Klein and C. Unger, Phys. Rev. B 28, 445 (1983).\n[40] Hui Yin, Ph.D thesis, Brandeis University, 2001.\n[41] P. Jund, R. Jullien and I. Campbell, preprint cond-mat/0011494\n[42] H. Vogel, Phys. Z. 22, 645 (1921), G. S. Fulcher, J. Am. Ceram. Soc. 8, 339 (1925)\n[43] A. Barrat, R. Burioni, and M. Mezard, J. Phys. A 29, 1311 (1995)\n[44] It can be shown that for systems in equilibrium, Q(t), the overlap between two copies\nevolving independently for time t, is equal to C(2t) [43].\n\n24\n\n\fFIGURES\n\nFIG. 1. A dimer covering corresponding to a spin configuration can be obtained by putting\ndimers crossing the ferromagnetic bond connecting the centers of the two triangles sharing this\nbond. (a)the dimer covering for a random TIAFM ground state configuration (b) A special dimer\ncovering which is mapped from the striped-order spin configuration and characterized by all vertical\ndimers. This dimer covering serves as a reference in defining the string picture.\n\nFIG. 2. A string picture is obtained by overlapping a dimer covering with the reference dimer\ncovering Fig.1b. The filled circles are free spins, the spins which have 3 satisfied and 3 unsatisfied\nbonds. As can be seen, the free spins are always tied to the strings. (a) the string mapping from\nthe spin configuration Fig.1a (b) a string mapping which has a fewer number of strings.\n\n25\n\n\f−0.1\n\n(b)\n\nT=0.45\nT=0.50\nT=0.60\nT=0.90\nT=1.20\n\n−0.2\n\nf(p)\n\n−0.3\n\n−0.4\n0.4\n\n(a)\n\n−0.5\n\nγ(p)\n\n0.3\n0.2\n0.1\n0.0\n0.0\n\n−0.6\n0.0\n\n0.4\n\n0.4 p\n\n0.8\n\n0.8\n\np\nFIG. 3. (a) Entropy as a function of the string density from the work of Dhar ⁀et al. [33] (b)The\ndimensionless free energy f (p) for μ = 0.18. T ∗ for this value of μ is 0.397. Temperature is\nmeasured in units of 1/kB .\n\n26\n\n\fCstring(t)\n\n1.00\n\n0.10\n\nT=0.6\nT=0.55\nT=0.52\nT=0.48\nT=0.47\n\n0.01\n\n0\n\n5000\n\n10000\n\n15000\n\ntime(MCS)\nFIG. 4. Auto-correlation functions of string density at different temperatures. The curves have\nbeen fitted to exponentials exp(− τt ).\n\n27\n\n\f20000\n0.1/(T−0.44)\n\ne\n(−3.3)\n(T−0.41)\n\nτ(MCS)\n\n15000\n\n10000\n\n5000\n\n0\n0.45\n\n0.50\n\n0.55\n\n0.60\n\n0.65\n\nT(1/kB)\nFIG. 5. String density correlation time τ , extracted from the fitting in Fig. 4, shown as a\nfunction of temperature. Fits to a Vogel-fulcher law (solid line) and a power law (dashed line) are\nalso shown.\n\n28\n\n\f0.80\n\n100\n(b)\n\n(a)\n\n0.6\n0.57\n0.52\n0.5\n0.48\n0.47\n\nτ\n\nCdefect(t)\n\n0.60\n\n3.1/T\n\ne\n\n0.40\n\n0.20\n\n0.00\n\n0\n\n10\n100 200 300 400 500 0.45 0.50 0.55 0.60 0.65\n\nT\n\ntime (MCS)\n\nFIG. 6. Defect number auto-correlation functions and correlation times at different temperatures. (a) The auto-correlation functions can be fitted to stretched exponentials exp(− τtd )β . The\nstretching exponent β decrease with T and (b) τd increases with T in an Arrhenius fashion.\n\n29\n\n\f0.6\nT=0.48\nT=0.50\nT=0.52\n\nCE(t)\n\n0.4\n\n0.2\n\n0.0\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1.0\nT=0.45\n\nCE(t)\n\n0.8\n0.6\n0.4\n0.2\n0.0\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\ntime(MCS)\nFIG. 7. The energy auto-correlation functions, CE (tw , t), at different temperatures above\nTg (top panel) and at different waiting times at a temperature T = 0.45 which is below Tg (bottom\npanel). In the top panel, the solid lines are the stretched exponential fits. The different curves at\nT = 0.45 are obtained from the measurement of CE (t) over different ranges of tw . From bottom\nto top, these ranges are 0 < t0 < 25000, 18000 < t0 < 48000 and 50000 < t0 < 80000.\n\n30\n\n\fC(t)\n\n0.10\n\nT=0.60\nT=0.55\nT=0.52\nT=0.50\nT=0.47\n\n0.01\n\n0.00\n\n10\n\n100\n\n1000\n\n10000\n\ntime (MCS)\nFIG. 8. Spin auto-correlation functions at different temperatures above Tg . The curves have\nbeen fitted to power law decays with an exponential cutoff, tα exp(− τts ).\n\n31\n\n\f−2\n\n10\n\nT=0.55\nt:\n\n−3\n\nP(arbitrary units)\n\n10\n\n1000\n2000\n4000\n8000\n\n−4\n\n10\n\n−0.05\n\n−0.03\n\n−0.01\n\n0.01\n\n0.03\n\n0.05\n\n−2\n\n10\n\nT=0.47\nt:\n−3\n\n10\n\n2000\n8000\n12000\n30000\n\n−4\n\n10\n\n−0.05\n\n−0.03\n\n−0.01\n\n0.01\n\n0.03\n\n0.05\n\n∆p\nFIG. 9. The distribution functions of the string density deviation at various time differences\nt. The distribution is generated by choosing different time origins t0 . The areas under the curves\nhave been normalized to unity. At T=0.55, a prominent non-Gaussian behavior of the distribution\nfunction is seen at t = 4000, after which the distribution narrows back down to Gaussian. At\nT=0.47, the distribution becomes broader and broader with t, and the stationary distribution is\nnot observed for times as long as 30,000.\n\n32\n\n\f−2\n\n10\n\nT=2.40\n−3\n\nt:\n\n10\n\n100\n200\n1000\n4000\n\n−4\n\nP (arbitrary unit)\n\n10\n\n−5\n\n10\n\n−1.0\n\n−0.5\n\n0.0\n\n0.5\n\n1.0\n\nT=2.27\n−3\n\n10\n\nt:\n1000\n5000\n15000\n30000\n\n−4\n\n10\n\n−5\n\n10\n\n−1.4\n\n−0.7\n\n0.0\n\n0.7\n\n1.4\n\n∆M\n\nFIG. 10. The distribution functions of the magnetization deviation at various time difference t\nmeasured in a square lattice Ising ferromagnet with system size L = 64. The critical temperature\nTc (L) ≃ 2.27. The areas under the curves have been normalized to unity. The relaxation behavior\nof the order parameter at the ferromagnetic critical point is seen to be different from that of the\nstrings in CTIAFM.\n\n33\n\n\f1.0\n\n0.042\n\n0.6\n\n0.083\n\n0.4\n\n0.125\n\nC(t)\n\n0.8\n\n0.25\n0.2\n\n0.375\n0.0\n\n10\n\n100\n\n1000\n\n10000\n\ntime (MCS)\nFIG. 11. Spin auto-correlation functions for different string density sectors, p. For p ≥ 0.25, the\nrelaxation can be described by a power law. For p ≤ 0.25, the relaxation is best fit to a stretched\nexponential form.\n\n34\n\n\f0.9\n\n2000−4000\n60000−70000\n70000−80000\n\nQ(tw,t)\n\n0.7\n0.5\n0.3\n0.1\n\n0.1\n\n0.3\n\n0.5\n\n0.7\n\n0.9\n\nC(tw,t)\n0.8\n70000−80000\n\n0.6\n0.4\n\n0.4\n\n60000−70000\n\n0.2\n0.0\n\n0.6\n\n0.2\n2000−40000\n\n10\n\n100\n\n1000\n\n10000\n\nQ (solid line)\n\nC (symbols)\n\n0.8\n\n0.0\n100000\n\nt\nFIG. 12. The top panel shows the overlap, Q(tw , t), versus the correlation function C(tw , t). In\nthe bottom panel C(tw , t) and Q(tw , t) are shown for different ranges of tw .\n\n35\n\n\f1.0\n(a)\n\n0.9\n0.8\n0.7\n0.6\n\n0\n\n20000\n\n40000\n\n60000\n\n80000\n\n0.70\n(b)\n\n0.68\n\ntw=2000\n\n0.66\n\nNS\n\n0.64\n\n0\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n1.00\n(c)\n0.90\ntw=40000\n\n0.80\n0.70\n\n0\n\n0.98\n\n20000\n\n40000\n\n(d)\ntw=76000\n\n0.96\n0.94\n\n60000\n\n0\n\n20000\n\n40000\n\n60000\n\nt\nFIG. 13. (a)Time history of the string density after the CTIAFM is quenched to T = 0.35.\nAt each of the different times marked by arrows in (a), three copies of the system are made and\nevolved with independent noise realizations. The panels (b),(c) and (d) depict the history of string\ndensity of the three copies made at tw = 2000, 40000, and 76000, respectively.\n\n36\n\n\f1.0\n0.8\n\ntw:\n\n0.6\n\nQ\n\n50\n1000\n12000\n\n0.4\n0.2\n0.0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nC\n0.5\n\ntw=50\n\ntw=1000\nQ\nC\n\n0.4\n\ntw=12000\n\nQ\nC\n\nQ\nC\n\n0.3\n0.2\n0.1\n0.0\n\n0\n\n500 1000 1500 0\n\n500 1000 1500\n\n0\n\n500 10001500\n\ntime (MCS)\nFIG. 14. Q(tw , t) and C(tw , t) after quenching triangular ferromagnet to just above Tc . From\nthe top panel, Q(tw , t) is seen to reach a finite value for tw = 50 and vanish for tw = 1000 and 12000\nas C(tw , t) decays to zero. In bottom three panels Q(tw , t) and C(tw , t) are shown as functions\nof time for different tw . The behavior of Q(tw , t) at small tw when the system is yet to reach\nequilibrium is seen to be different from that of the CTIAFM in the glass phase.\n\n37\n\n\fγ=2x10\n−2\nγ=2x10\n−3\nγ=2x10\n−4\nγ=2x10\n−1\n\nE (per spin)\n\n−0.84\n\n−0.94\n\n−1.04\n0.0\n\n0.4\n\n0.8\n\n1.2\n\n1.6\n\nT\nFIG. 15. The temperature dependence of the energy E for different cooling rates γ.\n\n38\n\n\f−1\n\nρ(t)\n\n10\n\n−2\n\n10\n\n2e−1\n2e−2\n2e−3\n2e−4\nArrhenius\n−3\n\n10\n\n0.0\n\n1.0\n\n2.0\n\n3.0\n\nβ\nFIG. 16. Defect density ρ(t) as a function of β = T −1 for different cooling rates, γ, compared\nto the equilibrium, Arrhenius form.\n\n39\n\n\fTABLES\nTABLE I. Results from fitting the string auto-correlation functions and defect number\nauto-correlation functions. The first column is the temperature. The second and third are the\ncorrelation time of the string density and its associated error bars from the exponential fit. The\nnext two columns are the values of β and τd from the defect number auto-correlation functions\nfitted to a stretched exponential form. The last two columns are the values of τE and β from the\nenergy auto-correlation fitted to a stretched exponential form.\n\nT\n\nτ (string)\n\n∆τ (string)\n\nβ (def ect)\n\nτd (def ect)\n\nτE (Energy)\n\nβ (Energy)\n\n0.6\n\n457\n\n45\n\n0.44 ± 0.01\n\n13.5\n\n12.6\n\n0.42 ± 0.004\n\n0.57\n\n1223\n\n119\n\n0.39 ± 0.01\n\n15.3\n\n13.4\n\n0.38 ± 0.01\n\n0.55\n\n2161\n\n505\n\n0.38 ± 0.01\n\n19.8\n\n23.0\n\n0.40 ± 0.04\n\n0.52\n\n2860\n\n593\n\n0.36 ± 0.02\n\n23.8\n\n29.8\n\n0.38 ± 0.02\n\n0.50\n\n4124\n\n378\n\n0.37 ± 0.02\n\n33.0\n\n49.0\n\n0.35 ± 0.01\n\n0.48\n\n7081\n\n370\n\n0.34 ± 0.02\n\n45.8\n\n67.9\n\n0.34 ± 0.03\n\n0.47\n\n15472\n\n2575\n\n0.33 ± 0.01\n\n54.5\n\n87.2\n\n0.32 ± 0.03\n\nTABLE II. The correlation time τs and exponent α extracted from the fitting of the spin\nauto-correlation function to the form C t−α exp(− τts ) at different temperatures.\n\nT\n\nτs (spin)\n\nα (spin)\n\nC (prefactor)\n\n0.6\n\n865\n\n0.36\n\n0.88\n\n0.55\n\n1140\n\n0.32\n\n0.78\n\n0.52\n\n1980\n\n0.30\n\n0.75\n\n0.50\n\n2170\n\n0.28\n\n0.72\n\n0.47\n\n4910\n\n0.25\n\n0.64\n\n40\n\n\fTABLE III. Results obtained from fitting the spin auto-correlation functions in different\nstring-density sectors to the stretched exponential form exp (−(t/τs )β )\n\n.\n\nstring density\n\nτs (spin)\n\nβ (spin)\n\np=0.042\n\n1.9 × 105\n\n0.28\n\np=0.083\n\n7435\n\n0.32\n\np=0.125\n\n1522\n\n0.33\n\n41\n\n\f"}