{"id": "http://arxiv.org/abs/cond-mat/0106214v2", "guidislink": true, "updated": "2001-10-23T16:06:27Z", "updated_parsed": [2001, 10, 23, 16, 6, 27, 1, 296, 0], "published": "2001-06-12T10:33:14Z", "published_parsed": [2001, 6, 12, 10, 33, 14, 1, 163, 0], "title": "Off-equilibrium dynamics in the energy landscape of a simple model glass", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0106546%2Ccond-mat%2F0106249%2Ccond-mat%2F0106138%2Ccond-mat%2F0106574%2Ccond-mat%2F0106635%2Ccond-mat%2F0106099%2Ccond-mat%2F0106168%2Ccond-mat%2F0106353%2Ccond-mat%2F0106006%2Ccond-mat%2F0106288%2Ccond-mat%2F0106496%2Ccond-mat%2F0106462%2Ccond-mat%2F0106581%2Ccond-mat%2F0106326%2Ccond-mat%2F0106538%2Ccond-mat%2F0106036%2Ccond-mat%2F0106657%2Ccond-mat%2F0106223%2Ccond-mat%2F0106451%2Ccond-mat%2F0106427%2Ccond-mat%2F0106348%2Ccond-mat%2F0106466%2Ccond-mat%2F0106636%2Ccond-mat%2F0106579%2Ccond-mat%2F0106272%2Ccond-mat%2F0106184%2Ccond-mat%2F0106577%2Ccond-mat%2F0106495%2Ccond-mat%2F0106208%2Ccond-mat%2F0106162%2Ccond-mat%2F0106369%2Ccond-mat%2F0106552%2Ccond-mat%2F0106346%2Ccond-mat%2F0106422%2Ccond-mat%2F0106566%2Ccond-mat%2F0106457%2Ccond-mat%2F0106077%2Ccond-mat%2F0106652%2Ccond-mat%2F0106604%2Ccond-mat%2F0106640%2Ccond-mat%2F0106002%2Ccond-mat%2F0106270%2Ccond-mat%2F0106413%2Ccond-mat%2F0106341%2Ccond-mat%2F0106619%2Ccond-mat%2F0106287%2Ccond-mat%2F0106621%2Ccond-mat%2F0106215%2Ccond-mat%2F0106391%2Ccond-mat%2F0106149%2Ccond-mat%2F0106296%2Ccond-mat%2F0106289%2Ccond-mat%2F0106571%2Ccond-mat%2F0106572%2Ccond-mat%2F0106127%2Ccond-mat%2F0106169%2Ccond-mat%2F0106069%2Ccond-mat%2F0106515%2Ccond-mat%2F0106343%2Ccond-mat%2F0106443%2Ccond-mat%2F0106471%2Ccond-mat%2F0106035%2Ccond-mat%2F0106083%2Ccond-mat%2F0106114%2Ccond-mat%2F0106219%2Ccond-mat%2F0106638%2Ccond-mat%2F0106012%2Ccond-mat%2F0106590%2Ccond-mat%2F0106576%2Ccond-mat%2F0106086%2Ccond-mat%2F0106228%2Ccond-mat%2F0106155%2Ccond-mat%2F0106185%2Ccond-mat%2F0106532%2Ccond-mat%2F0106497%2Ccond-mat%2F0106095%2Ccond-mat%2F0106335%2Ccond-mat%2F0106469%2Ccond-mat%2F0106322%2Ccond-mat%2F0106109%2Ccond-mat%2F0106441%2Ccond-mat%2F0106563%2Ccond-mat%2F0106214%2Ccond-mat%2F0106314%2Ccond-mat%2F0106178%2Ccond-mat%2F0106103%2Ccond-mat%2F0106334%2Ccond-mat%2F0106493%2Ccond-mat%2F0106183%2Ccond-mat%2F0106309%2Ccond-mat%2F0106259%2Ccond-mat%2F0106234%2Ccond-mat%2F0106554%2Ccond-mat%2F0106158%2Ccond-mat%2F0106329%2Ccond-mat%2F0106440%2Ccond-mat%2F0106068%2Ccond-mat%2F0106601%2Ccond-mat%2F0106421%2Ccond-mat%2F0106464%2Ccond-mat%2F0106081&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Off-equilibrium dynamics in the energy landscape of a simple model glass"}, "summary": "The aging dynamics of a simple model glass is numerically investigated\nobserving how it takes place in the potential energy landscape $V$.\nPartitioning the landscape in basins of minima of $|\\nabla V|^2$, we are able\nto elucidate some interesting topological properties of the aging process. The\nmain result is the characterization of the long time behavior as a jump\ndynamics between basins of attraction of minima. Moreover we extract some\ninformation about the landscape itself, determining quantitatively few\nparameters describing it, such as the mean energy barrier value and the mean\nsquare distance between adjacent minima.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0106546%2Ccond-mat%2F0106249%2Ccond-mat%2F0106138%2Ccond-mat%2F0106574%2Ccond-mat%2F0106635%2Ccond-mat%2F0106099%2Ccond-mat%2F0106168%2Ccond-mat%2F0106353%2Ccond-mat%2F0106006%2Ccond-mat%2F0106288%2Ccond-mat%2F0106496%2Ccond-mat%2F0106462%2Ccond-mat%2F0106581%2Ccond-mat%2F0106326%2Ccond-mat%2F0106538%2Ccond-mat%2F0106036%2Ccond-mat%2F0106657%2Ccond-mat%2F0106223%2Ccond-mat%2F0106451%2Ccond-mat%2F0106427%2Ccond-mat%2F0106348%2Ccond-mat%2F0106466%2Ccond-mat%2F0106636%2Ccond-mat%2F0106579%2Ccond-mat%2F0106272%2Ccond-mat%2F0106184%2Ccond-mat%2F0106577%2Ccond-mat%2F0106495%2Ccond-mat%2F0106208%2Ccond-mat%2F0106162%2Ccond-mat%2F0106369%2Ccond-mat%2F0106552%2Ccond-mat%2F0106346%2Ccond-mat%2F0106422%2Ccond-mat%2F0106566%2Ccond-mat%2F0106457%2Ccond-mat%2F0106077%2Ccond-mat%2F0106652%2Ccond-mat%2F0106604%2Ccond-mat%2F0106640%2Ccond-mat%2F0106002%2Ccond-mat%2F0106270%2Ccond-mat%2F0106413%2Ccond-mat%2F0106341%2Ccond-mat%2F0106619%2Ccond-mat%2F0106287%2Ccond-mat%2F0106621%2Ccond-mat%2F0106215%2Ccond-mat%2F0106391%2Ccond-mat%2F0106149%2Ccond-mat%2F0106296%2Ccond-mat%2F0106289%2Ccond-mat%2F0106571%2Ccond-mat%2F0106572%2Ccond-mat%2F0106127%2Ccond-mat%2F0106169%2Ccond-mat%2F0106069%2Ccond-mat%2F0106515%2Ccond-mat%2F0106343%2Ccond-mat%2F0106443%2Ccond-mat%2F0106471%2Ccond-mat%2F0106035%2Ccond-mat%2F0106083%2Ccond-mat%2F0106114%2Ccond-mat%2F0106219%2Ccond-mat%2F0106638%2Ccond-mat%2F0106012%2Ccond-mat%2F0106590%2Ccond-mat%2F0106576%2Ccond-mat%2F0106086%2Ccond-mat%2F0106228%2Ccond-mat%2F0106155%2Ccond-mat%2F0106185%2Ccond-mat%2F0106532%2Ccond-mat%2F0106497%2Ccond-mat%2F0106095%2Ccond-mat%2F0106335%2Ccond-mat%2F0106469%2Ccond-mat%2F0106322%2Ccond-mat%2F0106109%2Ccond-mat%2F0106441%2Ccond-mat%2F0106563%2Ccond-mat%2F0106214%2Ccond-mat%2F0106314%2Ccond-mat%2F0106178%2Ccond-mat%2F0106103%2Ccond-mat%2F0106334%2Ccond-mat%2F0106493%2Ccond-mat%2F0106183%2Ccond-mat%2F0106309%2Ccond-mat%2F0106259%2Ccond-mat%2F0106234%2Ccond-mat%2F0106554%2Ccond-mat%2F0106158%2Ccond-mat%2F0106329%2Ccond-mat%2F0106440%2Ccond-mat%2F0106068%2Ccond-mat%2F0106601%2Ccond-mat%2F0106421%2Ccond-mat%2F0106464%2Ccond-mat%2F0106081&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The aging dynamics of a simple model glass is numerically investigated\nobserving how it takes place in the potential energy landscape $V$.\nPartitioning the landscape in basins of minima of $|\\nabla V|^2$, we are able\nto elucidate some interesting topological properties of the aging process. The\nmain result is the characterization of the long time behavior as a jump\ndynamics between basins of attraction of minima. Moreover we extract some\ninformation about the landscape itself, determining quantitatively few\nparameters describing it, such as the mean energy barrier value and the mean\nsquare distance between adjacent minima."}, "authors": ["R. Di Leonardo", "L. Angelani", "G. Parisi", "G. Ruocco", "A. Scala", "F. Sciortino"], "author_detail": {"name": "F. Sciortino"}, "author": "F. Sciortino", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1080/13642810208208539", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0106214v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0106214v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8th International Workshop on Disordered Systems, Andalo (Trento),\n  Italy, March 2001", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0106214v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0106214v2", "journal_reference": null, "doi": "10.1080/13642810208208539", "fulltext": "Off-equilibrium dynamics in the energy landscape of a simple\n\narXiv:cond-mat/0106214v2 [cond-mat.soft] 23 Oct 2001\n\nmodel glass\nR. Di Leonardo1 , L. Angelani2 , G. Parisi3 , G. Ruocco3 , A. Scala3 , and F. Sciortino3\n1\n2\n\nUniversità di L'Aquila and INFM, I-67100, L'Aquila, Italy.\n\nUniversità di Trento and INFM, I-38050, Povo, Trento, Italy.\n3\n\nUniversità di Roma La Sapienza and INFM, I-00185, Roma, Italy.\n\nAbstract\nThe aging dynamics of a simple model glass is numerically investigated observing how it takes place in the potential energy landscape\nV.\n\nPartitioning the landscape in basins of minima of |∇V |2 , we are\n\nable to elucidate some interesting topological properties of the aging process.\n\nThe main result is the characterization of the long time behav-\n\nior as a jump dynamics between basins of attraction of minima.\n\nMore-\n\nover we extract some information about the landscape itself, determining quantitatively few parameters describing it, such as the mean energy barrier value and the mean square distance between adjacent minima.\n\nThe specific way a glass or a supercooled liquid explores its potential energy landscape at\ndifferent temperatures and in different dynamical regimes is of great importance to understand many properties of these systems (Stillinger, 1995; Debenedetti and Stillinger, 2001).\nOnly recently the investigation of the multidimensional Potential Energy Surface (PES) as a\nfunction of particle coordinates has become computational achievable, and many numerical\nworks have been devoted to study the PES of model liquids and glasses. The relationship\nbetween the topological properties of the landscape and the way the system moves in it, con1\n\n\fstitutes a very promising viewpoint to better understand the thermodynamics and dynamics\nof supercooled liquids and glassy systems (Kurchan and Laloux, 1996).\nOnly few studies have investigated the aging dynamics from the energy landscape point\nof view (Angelani et al. 2001; Kob et al. 2000; Mossa et al. 2001). The study of the\noff-equilibrium dynamics in glassy systems, and in particular in spin glasses, has allowed\nto obtain important information on the phase-space properties of the systems itself and\nto formulate off-equilibrium relations generalizing the usual equilibrium ones - generalized\nfluctuation-dissipation relation (Cugliandolo, and Kurchan 1993; Bouchaud et al. 1997) with the introduction of an effective temperature (Cugliandolo et al. 1997). The investigation of the off-equilibrium properties seems to indicate the correctness of the conjecture\nstating the similarity of structural glasses with some spin glass model - spin glasses with\none step replica symmetry breaking (Kirkpatrick and Thirumalai, 1987; Kirkpatrick and\nWolynes, 1987; Franz and Parisi, 1997). Recently the numerical investigation of aging in\nstructural glasses has allowed us to bridge these two different disordered systems (Parisi\n1997; Barrat and Kob 1999; Di Leonardo et al. 2000; Sciortino and Tartaglia 2001;). Here\nwe report a detailed analysis of the aging in the energy landscape for a simple model glass,\na monatomic Lennard-Jones system modified in such a way as to avoid crystallization.\nThe way the off-equilibrium dynamics takes place in the potential energy landscape V\n(viewed as a function of the 3N coordinates of the N particles) is investigated by mapping\nthe true dynamics in the configuration space on to the \"slow\" points of V , i.e. the points\nin which |∇V |2 is minimum and the forces are reduced by several orders of magnitude (we\ncall them saddles hereafter, even if, besids true saddles, they include also inflection points\n- Doye and Wales 2001; Angelani et al., in preparation). The basins of attraction of these\npoints constitute a partition of the configuration space. This partition of the landscape is\nan extension of the partition in basins of minima proposed by Stillinger and Weber (1982,\n1984) many years ago, including in our case not only the minima but also the saddles of\nany order. The new partition has been very useful to elucidate many interesting features\nof supercooled simple liquids, the main result being the identification of the mode-coupling\n2\n\n\ftemperature TM CT (Götze, 1999) as the temperature at which the system has a crossover\nbetween a dynamics between basins of saddles for T > TM CT to a dynamics between basins\nof minima for T < TM CT (Angelani et al. 2000; Broderix et al. 2000; Scala et al. 2001).\nWe use this new partition in the analysis of the off-equilibrium dynamics of a monatomic\nLennard-Jones system with N = 256 particles. The particles interact via the usual 6 − 12\nLennard-Jones potential modified in such a way as to avoid the crystalization occuring in\nstandard LJ: V = VLJ + δV , where δV is a small many-body term that inhibits cristalization\n(it depends on the static structure factor, see Di Leonardo et al. (2000) for details). The\nrelevant quantitites are determined during the time evolution of the system after a sudden\ncrunch (density jump at fixed temperature) from liquid to glassy phase (from ρ0 = 0.95 to\nρ1 = 1.24 at fixed T0 = 0.5, where the glass transition temperature is Tg ∼ 1.4 at the final\ndensity ρ1 - all the quantities are expressed in standard Lennard-Jones unit). The evolution\nof the system is generated up to time t = 3 * 104 by means of standard isothermal MD with\ntime step τ = 0.01. The measured quantities have been averaged over 80 samples. For each\nMD trajectory we have quenched a set of logarithmically equally spaced configurations to\nthe corresponding minima and saddles following the steepest descent path respectively on\nthe potential energy surface V in the former case and on the auxiliary potential W = 21 |∇V |2\n(Weber and Stillinger 1985) in the latter. In this way, during the time evolution, we are able\nto follow the behavior of the sampled relevant points of the landscape: saddles and minima\n(besides the usual instantaneous configurations).\nIn order to elucidate how the system explores the landscape during the off-equilibrium\ndynamics, we have first focused on the energy values. We have measured the potential energies as a function of time (times are measured from crunch) along the dynamical trajectory:\nthe energy of the instantaneous configurations, the energy of the saddles and the energy\nof the minima. The data are reported in Fig. 1 in a logarithmic scale. It is evident that\nthe instantaneous and saddle energies have a rather sharp transition at time tc ∼ 20. The\nmeaning of this crossover will be clear soon, analyzing more carefully another topological\nquantity related to the landscape, the order of sampled saddles. We only notice here that\n3\n\n\ffor times less than tc the instantaneous energy follows the energy of saddles, and the energy\nof minima remains nearly constant in this region (we note this flat time-region corresponds\nto the constant energy region observed at high temperature in the analysis of minima in\nequilibrated liquids), while for times below tc all the energies (instantaneous, saddles and\nminima) have a similar almost logarithmic behavior, indicating that here the time evolution\nis driven by the inherent dynamics between minima: e(t) ∝ γ log10 (t), with γ ∼ −0.025.\nAnother remarkable point that can be observed in Fig. 1 is the similarity between the\nenergy of the saddles and the difference between the instantaneous energy and the constant\nterm 23 T0 . This seems to indicate that the non-diffusive degrees of freedom give an harmonic\ncontribution over the energy of saddles, slowly approaching their equilibrium value.\nA better understanding of the processes that are taking place is obtained analyzing the\nnumber of negative directions in the landscape near the sampled saddles. We define the\nsaddle order ns as the number of negative curvatures at the saddle point, i.e. the fraction\nof negative eigenvalues of the Hessian of V . The time evolution of ns during aging (Fig. 2)\nallows us to clarify the meaning of the crossover time tc : it marks the time at which the\nsystem begins to visit extensively the minima, and the mean order ns falls below the value\nns = 1.\nIn the analysis of equilibrium properties of supercooled liquids, the quantity ns vs. temperature allowed us to give a topological interpretation of the mode-coupling temperature\nas the temperature at which a transition takes place, from a dynamics between saddles to\na dynamics between minima (Angelani et al. 2000). In a similar way, in the present study\nof the out-of-equilibrium properties of a simple glass, the same quantity ns , now plotted vs.\ntime t, allows us to interpret the time tc as marking the transition between the same two\nregimes: at short times, below tc , the system moves inside basins of attraction of saddles\nwith mean order ns (t) > 1 decreasing in time, while at longer times, t > tc , the system starts\nto visit basins of minima traveling among them through low order saddles. The fact that\nthe mean order ns doesn't vanish for times t > tc , explains the observed energy difference\nbetween the energy of saddles and that of minima.\n4\n\n\fAnalyzing how the system explore its potential energy landscape during the aging dynamics we can try to infer some topological characteristic of the landscape. Matching the\ninformation about the order and energy of saddles and the energy of minima, we are able to\nevidence the possible existence of a typical energy barrier in the landscape. As reported in\na previous work investigating the equilibrium supercooled dynamics (Angelani et al. 2000),\nalso in the aging regime we discover a very simple topology of the landscape: saddles of\norder ns lie above the underlying minimum by an energy elevation proportional to ns :\nes (ns ) − em =\n\n∆E\n* ns .\nN\n\n(1)\n\nIn Fig. 3 the left hand side of Eq. 1 is reported as a function of saddle order ns . The\nopen circles are the data obtained from previous figures, in which the minima are defined\nby a steepest descent path from the instantaneous configuration. However, using a different definition of underlying minima below a saddle (by quenching the saddle instead of\ninstantaneous configuration - see the text below) one observes a very similar behaviour (full\ndiamonds in Fig. 3). This finding supports the picture of a very simple landscape with only\na single energy barrier parameter ∆E which represents the energy gap between a saddle of\norder ns and a saddle of order ns + 1:\n∆E ∼ 10 .\n\n(2)\n\nSimilar results were found in the supercooled equilibrium case, where a value of ∆E ∼ 3.6\nwas obtained for a less dense system ρ = 1 (in our case ρ = 1.24).\nAnother interesting topological information about the landscape is the valuation of the\nmean distance d2 between adjacent minima. In order to obtain this information we have\ndetermined, for each saddle point sampled during the dynamics, two underlying minima\n(here the term underlying means minima reached by a steepest descent path from a saddle\n(1)\n\nconfiguration, weakly perturbed in order to escape from the instable point), {ri } and\n(2)\n\n{ri }, reached by quenching the saddle. In this case the above definition of minima, as those\nreached by saddles, seems to be the more appropiate, due to the fact that the minima sampled\n5\n\n\fduring the dynamics starting from instantaneous configurations could be not directly related\nto the sampled saddles. Instead a direct quench from saddles assures the close relation in\nconfiguration space between the two points (we note that in the valuation of energies the two\nmethod lead to the same results, indicating that the energies are less sensitive to landscape\ndetails). The quantity d2 defined as\nd2 =\n\n1 X (1)\n(2)\nh|ri − ri |2 i ,\nN i\n\n(3)\n\nis reported in Fig. 4 as a function of the saddle order ns . It is evident a linear relation\n(line in Fig. 4) between the two quantities, suggesting that the descent path from a saddle\nof order ns towards the underlying minima can be interpreted as a random walk among\nsaddles: at each step the order of the saddle decreases by 1 and the mean square distance\nincreases by a constant value d20 (this characteristic, together with the single barrier energy\nparameter ∆E, is incorporated in the simple trigonometric model as defined by Madam and\nKeyes (1993)). The value obtained for the typical square distance between minima is:\nd20 ∼ 0.02 .\n\n(4)\n\nWe note that this finding and the previous one concerning the mean barrier value (see\nEq. 2), although obtained in the specific aging regime, are supposed to be properties of\nthe landscape itself, independent on the different way the system explores it. Indeed the\nsame characteristics were obtained by Angelani et al. (2000) who analysed the equilibrium\ndynamics in the supercooled regime (a quantitative match between the obtained values is\nnot feasible, as the densities of the systems are different in the two cases).\nIn conclusion, the topological investigation of the energy landscape of a simple model\nglass during the aging dynamics has allowed us to clarify many interesting properties, shortly\nresumed here after:\n• after a fast short time behavior, characterized by a dynamics between saddles, the\nsystem starts to explore minima decreasing logarithmically its energy (this latter is\nthe interesting slow aging dynamics);\n6\n\n\f• the instantaneous energies lie above the saddle energies by the harmonic term 32 T ,\nindicating that the fast harmonic degrees of freedom equilibrate over the slow diffusive\ncoordinates (related to the negative directions of the sampled saddles);\n• the topology of the landscape seems to be highly regular, with only a single energy\nbarrier parameter ∆E ∼ 10 and a single square distance between adjacent minima\nd20 ∼ 0.02.\n\n7\n\n\fREFERENCES\nAngelani L., Di Leonardo R., Ruocco G., Scala A. , and Sciortino F., 2000, Phys. Rev. Lett.\n85, 5356.\nAngelani L., Di Leonardo R., Ruocco G., Scala A. , and Sciortino F., in preparation.\nAngelani L., Di Leonardo R., Ruocco G., and Parisi G., 2001, Phys. Rev. Lett. 87, 055502.\nBarrat J.L., and W. Kob, 1999, Europhys. Lett. 46, 637.\nBouchaud J.P., Cugliandolo L.F., Kurchan J., and Mezard M., 1997, Out of equilibrium\ndynamics in spin glasses and the other glassy systems, in Spin Glasses and Random Fields,\n(World Scientific, Singapore).\nBroderix K., Batthacharya K.K., Cavagna A., Zippelius A., and Giardina I., 2000, Phys.\nRev. Lett. 85, 5360.\nCugliandolo L.F., and Kurchan J., 1993, Phys. Rev. Lett. 71, 173.\nCugliandolo L.F., Kurchan J., and Peliti K. 1997, Phys. Rev. E 55, 3898.\nDebenedetti P.G., and Stillinger F.H., 2001, Nature, 410, 259.\nDi Leonardo R., Angelani L., Parisi G., and Ruocco G., 2000 Phys. Rev. Lett. 84, 6054.\nDoye J.P.K and Wales D.J., cond-mat/0108310.\nFranz S., and Parisi G., 1997, Phys. Rev. Lett. 79, 2486.\nGötze W., 1999, J. Phys.: Condens. Matter 11, A1.\nKirkpatrick T.R., and Thirumalai D., 1987, Phys. Rev. B 36, 5388.\nKirkpatrick T.R., and Wolynes P.G., 1987, Phys. Rev. B 35, 3072.\nKob W., Sciortino F., and Tartaglia P., 2000, Europhys. Lett. 49, 590.\nKurchan J., and Laloux L., 1996, J. Phys. A 29, 1929.\nMadam B., and Keyes T., 1993, J. Chem. Phys. 98, 3342.\nMossa S. et al., 2001, Phil. Mag. B. 82, in press.\nParisi G., 1997, Phys. Rev. Lett. 79, 3660.\nScala A. et al., 2001, Phil. Mag. B. 82, in press.\nSciortino F.,and Tartaglia P., 2001, Phys. Rev. Lett. 86, 107.\n8\n\n\fStillinger F.H., 1995, Science 267, 1935.\nStillinger F.H., and Weber T.A., 1982, Phys. Rev. A 25, 978.\nStillinger F.H., and Weber T.A., 1984, Science 225, 983.\nWeber T.A., and Stillinger F.H., 1985, Phys. Rev. B 31, 1954.\n\n9\n\n\fFIGURES\n\n-5.00\n\nei - 3/2 T\nem\nes\n\n-5.05\n\ne\n\n-5.10\n-5.15\n-5.20\n-5.25\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\n4\n\nt\nFIG. 1.\n\nEnergies (per particle) during the aging dynamics. Instantaneous potential energy\n\nei subtracted by the constant term 3/2T (open circles), energy of minima em (open squares) and\nenergy of saddles (full circles). The solid line fits the long time data, with slope γ ∼ −0.025.\n\n4\n\nns\n\n3\n\n2\n\n1\n\n0 0\n10\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\n4\n\nt\nFIG. 2. Time behavior of the mean order ns of the saddles.\n\n10\n\n\f0.20\n\nes - em\n\n0.15\n\n0.10\n\n0.05\n\n0.00\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nns\nFIG. 3. The energy elevation of saddles from the underlying minima as a function of saddle\norder ns . The open circles are the data obtained from Fig.1 and Fig.2 (the minima are defined\nstarting from instantaneous configurations), while the open diamonds are obtained determining the\nunderlying minima starting from saddle configurations. The fit line determines the energy barrier\n(expressed as total energy) ∆E = 10.\n\nd\n\n2\n\n0.10\n\n0.05\n\n0.00\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nns\nFIG. 4. Mean square distance d2 between adjacent minima vs. saddles order ns . The line is a\nlinear fit, with slope d20 = 0.02.\n\n11\n\n\f"}