{"id": "http://arxiv.org/abs/cond-mat/0407689v1", "guidislink": true, "updated": "2004-07-27T05:57:12Z", "updated_parsed": [2004, 7, 27, 5, 57, 12, 1, 209, 0], "published": "2004-07-27T05:57:12Z", "published_parsed": [2004, 7, 27, 5, 57, 12, 1, 209, 0], "title": "An Atom Michelson Interferometer on a Chip Using a Bose-Einstein\n  Condensate", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0407790%2Ccond-mat%2F0407378%2Ccond-mat%2F0407325%2Ccond-mat%2F0407233%2Ccond-mat%2F0407602%2Ccond-mat%2F0407513%2Ccond-mat%2F0407613%2Ccond-mat%2F0407570%2Ccond-mat%2F0407125%2Ccond-mat%2F0407014%2Ccond-mat%2F0407549%2Ccond-mat%2F0407026%2Ccond-mat%2F0407201%2Ccond-mat%2F0407759%2Ccond-mat%2F0407367%2Ccond-mat%2F0407438%2Ccond-mat%2F0407003%2Ccond-mat%2F0407746%2Ccond-mat%2F0407526%2Ccond-mat%2F0407386%2Ccond-mat%2F0407269%2Ccond-mat%2F0407041%2Ccond-mat%2F0407704%2Ccond-mat%2F0407552%2Ccond-mat%2F0407648%2Ccond-mat%2F0407218%2Ccond-mat%2F0407676%2Ccond-mat%2F0407082%2Ccond-mat%2F0407763%2Ccond-mat%2F0407662%2Ccond-mat%2F0407607%2Ccond-mat%2F0407634%2Ccond-mat%2F0407708%2Ccond-mat%2F0407178%2Ccond-mat%2F0407350%2Ccond-mat%2F0407481%2Ccond-mat%2F0407086%2Ccond-mat%2F0407668%2Ccond-mat%2F0407066%2Ccond-mat%2F0407760%2Ccond-mat%2F0407379%2Ccond-mat%2F0407421%2Ccond-mat%2F0407198%2Ccond-mat%2F0407721%2Ccond-mat%2F0407557%2Ccond-mat%2F0407271%2Ccond-mat%2F0407470%2Ccond-mat%2F0407808%2Ccond-mat%2F0407238%2Ccond-mat%2F0407008%2Ccond-mat%2F0407793%2Ccond-mat%2F0407073%2Ccond-mat%2F0407453%2Ccond-mat%2F0407258%2Ccond-mat%2F0407515%2Ccond-mat%2F0407679%2Ccond-mat%2F0407624%2Ccond-mat%2F0407385%2Ccond-mat%2F0407097%2Ccond-mat%2F0407304%2Ccond-mat%2F0407023%2Ccond-mat%2F0407689%2Ccond-mat%2F0407013%2Ccond-mat%2F0407005%2Ccond-mat%2F0407376%2Ccond-mat%2F0407755%2Ccond-mat%2F0407480%2Ccond-mat%2F0407807%2Ccond-mat%2F0407129%2Ccond-mat%2F0407349%2Ccond-mat%2F0407231%2Ccond-mat%2F0407798%2Ccond-mat%2F0407502%2Ccond-mat%2F0407754%2Ccond-mat%2F0407416%2Ccond-mat%2F0407503%2Ccond-mat%2F0407735%2Ccond-mat%2F0407185%2Ccond-mat%2F0407578%2Ccond-mat%2F0407454%2Ccond-mat%2F0407235%2Ccond-mat%2F0407410%2Ccond-mat%2F0407006%2Ccond-mat%2F0407593%2Ccond-mat%2F0407563%2Ccond-mat%2F0407599%2Ccond-mat%2F0407524%2Ccond-mat%2F0407702%2Ccond-mat%2F0407651%2Ccond-mat%2F0407520%2Ccond-mat%2F0407705%2Ccond-mat%2F0407250%2Ccond-mat%2F0407636%2Ccond-mat%2F0407623%2Ccond-mat%2F0407139%2Ccond-mat%2F0407017%2Ccond-mat%2F0407056%2Ccond-mat%2F0407499%2Ccond-mat%2F0407135%2Ccond-mat%2F0407483%2Ccond-mat%2F0407018&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An Atom Michelson Interferometer on a Chip Using a Bose-Einstein\n  Condensate"}, "summary": "An atom Michelson interferometer is implemented on an \"atom chip.\" The chip\nuses lithographically patterned conductors and external magnetic fields to\nproduce and guide a Bose-Einstein condensate. Splitting, reflecting, and\nrecombining of condensate atoms are achieved by a standing-wave light field\nhaving a wave vector aligned along the atom waveguide. A differential phase\nshift between the two arms of the interferometer is introduced by either a\nmagnetic-field gradient or with an initial condensate velocity. Interference\ncontrast is still observable at 20% with atom propagation time of 10 ms.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0407790%2Ccond-mat%2F0407378%2Ccond-mat%2F0407325%2Ccond-mat%2F0407233%2Ccond-mat%2F0407602%2Ccond-mat%2F0407513%2Ccond-mat%2F0407613%2Ccond-mat%2F0407570%2Ccond-mat%2F0407125%2Ccond-mat%2F0407014%2Ccond-mat%2F0407549%2Ccond-mat%2F0407026%2Ccond-mat%2F0407201%2Ccond-mat%2F0407759%2Ccond-mat%2F0407367%2Ccond-mat%2F0407438%2Ccond-mat%2F0407003%2Ccond-mat%2F0407746%2Ccond-mat%2F0407526%2Ccond-mat%2F0407386%2Ccond-mat%2F0407269%2Ccond-mat%2F0407041%2Ccond-mat%2F0407704%2Ccond-mat%2F0407552%2Ccond-mat%2F0407648%2Ccond-mat%2F0407218%2Ccond-mat%2F0407676%2Ccond-mat%2F0407082%2Ccond-mat%2F0407763%2Ccond-mat%2F0407662%2Ccond-mat%2F0407607%2Ccond-mat%2F0407634%2Ccond-mat%2F0407708%2Ccond-mat%2F0407178%2Ccond-mat%2F0407350%2Ccond-mat%2F0407481%2Ccond-mat%2F0407086%2Ccond-mat%2F0407668%2Ccond-mat%2F0407066%2Ccond-mat%2F0407760%2Ccond-mat%2F0407379%2Ccond-mat%2F0407421%2Ccond-mat%2F0407198%2Ccond-mat%2F0407721%2Ccond-mat%2F0407557%2Ccond-mat%2F0407271%2Ccond-mat%2F0407470%2Ccond-mat%2F0407808%2Ccond-mat%2F0407238%2Ccond-mat%2F0407008%2Ccond-mat%2F0407793%2Ccond-mat%2F0407073%2Ccond-mat%2F0407453%2Ccond-mat%2F0407258%2Ccond-mat%2F0407515%2Ccond-mat%2F0407679%2Ccond-mat%2F0407624%2Ccond-mat%2F0407385%2Ccond-mat%2F0407097%2Ccond-mat%2F0407304%2Ccond-mat%2F0407023%2Ccond-mat%2F0407689%2Ccond-mat%2F0407013%2Ccond-mat%2F0407005%2Ccond-mat%2F0407376%2Ccond-mat%2F0407755%2Ccond-mat%2F0407480%2Ccond-mat%2F0407807%2Ccond-mat%2F0407129%2Ccond-mat%2F0407349%2Ccond-mat%2F0407231%2Ccond-mat%2F0407798%2Ccond-mat%2F0407502%2Ccond-mat%2F0407754%2Ccond-mat%2F0407416%2Ccond-mat%2F0407503%2Ccond-mat%2F0407735%2Ccond-mat%2F0407185%2Ccond-mat%2F0407578%2Ccond-mat%2F0407454%2Ccond-mat%2F0407235%2Ccond-mat%2F0407410%2Ccond-mat%2F0407006%2Ccond-mat%2F0407593%2Ccond-mat%2F0407563%2Ccond-mat%2F0407599%2Ccond-mat%2F0407524%2Ccond-mat%2F0407702%2Ccond-mat%2F0407651%2Ccond-mat%2F0407520%2Ccond-mat%2F0407705%2Ccond-mat%2F0407250%2Ccond-mat%2F0407636%2Ccond-mat%2F0407623%2Ccond-mat%2F0407139%2Ccond-mat%2F0407017%2Ccond-mat%2F0407056%2Ccond-mat%2F0407499%2Ccond-mat%2F0407135%2Ccond-mat%2F0407483%2Ccond-mat%2F0407018&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An atom Michelson interferometer is implemented on an \"atom chip.\" The chip\nuses lithographically patterned conductors and external magnetic fields to\nproduce and guide a Bose-Einstein condensate. Splitting, reflecting, and\nrecombining of condensate atoms are achieved by a standing-wave light field\nhaving a wave vector aligned along the atom waveguide. A differential phase\nshift between the two arms of the interferometer is introduced by either a\nmagnetic-field gradient or with an initial condensate velocity. Interference\ncontrast is still observable at 20% with atom propagation time of 10 ms."}, "authors": ["Ying-Ju Wang", "Dana Z. Anderson", "Victor M. Bright", "Eric A. Cornell", "Quentin Diot", "Tetsuo Kishimoto", "Mara Prentiss", "R. A. Saravanan", "Stephen R. Segal", "Saijun Wu"], "author_detail": {"name": "Saijun Wu"}, "author": "Saijun Wu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.94.090405", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0407689v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0407689v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0407689v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0407689v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1103/PhysRevLett.94.090405", "fulltext": "An Atom Michelson Interferometer on a Chip Using a Bose-Einstein Condensate\n\n1\n\nYing-Ju Wang,1 Dana Z. Anderson,1 Victor M. Bright,2 Eric A. Cornell,1 Quentin Diot,1 Tetsuo Kishimoto,1*\nMara Prentiss,3 R. A. Saravanan,2 Stephen R. Segal,1 and Saijun Wu3\nDepartment of Physics, University of Colorado, and JILA, National Institute of Standards and Technology and University\nof Colorado, Boulder, Colorado 80309-0440, USA\n2\nDepartment of Mechanical Engineering, University of Colorado, Boulder, Colorado 80309-0427, USA\n3\nDepartment of Physics, Harvard University, Cambridge, Massachusetts 02138, USA\n\nAn atom Michelson interferometer is implemented on an \"atom chip.\" The chip uses lithographically patterned conductors\nand external magnetic fields to produce and guide a Bose-Einstein condensate. Splitting, reflecting, and recombining of\ncondensate atoms are achieved by a standing-wave light field having a wave vector aligned along the atom waveguide. A\ndifferential phase shift between the two arms of the interferometer is introduced by either a magnetic-field gradient or with\nan initial condensate velocity. Interference contrast is still observable at 20% with atom propagation time of 10 ms.\nPACS number: 03.75.Dg, 03.75.-b, 39.20.+q, 32.80.-t\n\nAtom\ninterferometry\noffers\nexquisite\nprecision\nmeasurement capability, much like its photon-based\ncounterpart. For example, the fundamental limit on the atom\nSagnac gyroscope signal-to-noise ratio is a factor of 1011\ngreater than its optical counterpart, given comparable enclosed\nareas and particle flux. Unlike their photon counterparts,\nhowever, atoms can be sensitive to electric and magnetic\nfields. In this respect, atom interferometry may be suited to a\nsubstantially larger set of sensor applications, though by the\nsame token, it is sensitive to a larger variety of detrimental\nnoise sources. Atom interferometry has been demonstrated\nusing both normal atoms and Bose-Einstein condensates. On\nbalance, atom interferometry experiments have revealed\npromising and sometimes stunning measurement capabilities\n[1–5].\nEfforts to incorporate interferometry on an \"atom chip\" [6–\n9] are motivated by the large physical size of a traditional\napparatus and a desire to better tailor interferometer\ngeometries. Most attempts to implement a coherent\nbeamsplitter/recombiner on a chip have used current-induced\nmagnetic fields, typically forming double potential wells that\nmerge and then split apart either in space, in time, or in both.\nVarious technical issues, such as noise coupled into the\ncurrent and roughness or impurities of the wires, have stymied\nattempts to demonstrate on-chip interference [10–13].\nThis work reports the demonstration of an on-chip atom\nMichelson interferometer employing a Bose-Einstein\ncondensate (BEC). An intrawaveguide optical standing wave\nserves to split, reflect, and recombine the BEC. We introduce\na differential phase shift between the two arms of the\ninterferometer that modulates the atom interference. This\ndifferential phase shift is introduced by a magnetic field\ngradient and alternatively by an initial condensate velocity in a\ntrap with a longitudinal frequency of 5 Hz. We observe\ninterference when the round-trip propagation time is relatively\nshort, i.e., less than about 10 ms and the maximum separation\nof the split wave packets is about 120 μm. The maximum\nseparation is greater than the results reported previously for\nconfined atom interferometers [14, 15].\nOur atom chip contains lithographically patterned wires and\na pair of prism-shaped mirrors, as shown in Fig. 1. The wires\ngenerate magnetic fields that are essential for the microtrap\nand magnetic waveguide. The inward-facing surfaces of the\ntwo prisms are mirror-coated and aligned to produce optical\nstanding waves. A 180-μm-high tunnel is created underneath\n\nthe prism located at the entrance side of the chip to allow for\nloading of the microtrap.\n(a)\n\nMirrors\n\nTunnel\n\nStanding\nlight wave\n\nWires\n\nLanding region Trapping and splitting region\n\n(b)\n\nFIG. 1. (a) Schematic drawing of the atom chip (not to scale). The\nprism-shaped mirrors are integrated with microfabricated wires on an\naluminum nitride substrate. The dimensions of the whole chip are 5\ncm by 2 cm. (b) A photo image of the atom chip glued onto a copper\nholder.\n\nA cold cloud of 87 Rb in the F = 1, m f = −1 state is\ncollected and precooled in adjoining vacuum chambers to\naround 0.45 μK [16]. The cloud is delivered through the\ntunnel and captured in the chip's trapping region, which is\nlocated between the prisms and sits 115 μm away from the\nsurface of the chip. After the cloud is loaded onto the chip, the\ntrapping currents are reduced to place the cloud to 250 μm\naway from the surface. Next, rf-forced evaporative cooling is\nused to form a condensate. The frequencies of the magnetic\n\n\ftrap in which the condensate is made are 177 Hz in the radial\nand 10 Hz in the axial direction. Once a condensate is formed,\nthe axial confinement is ramped down in 100 ms to release the\ncondensate to the waveguide.\nA tightly focused, linearly polarized laser beam with a waist\nof 110 μm is incident on and reflected by the mirror that is\noriented at 45 degrees with respect to the chip surface [see\nFig. 1]. The reflected beam is perpendicular to the surface of\nthe chip and is parallel to the direction of the waveguide. The\nbeam is retroreflected by the second mirror that is\nperpendicular to the waveguide and the surface of the chip.\nThe wave vector of the standing-wave light field needs to be\nparallel to the waveguide to minimize radial excitations of the\nBEC from photon scatterings. The prisms must be aligned\nwith respect to the waveguide to better than 2 degrees.\nAn interferometric measurement involves three standingwave light pulses: a splitting pulse, a reflection pulse, and a\nrecombining pulse. The frequency of the standing-wave light\nfield is 7.8 GHz red detuned from the atomic resonance to\nminimize spontaneous emission. The condensate cloud begins\nat rest in the guide. The splitting pulse actually consists of a\npair of subpulses, and each single subpulse diffracts atoms\nlike an optical diffraction grating in the Raman-Nath regime.\nAs a result the cloud is diffracted into different momentum\nstates. The momentum of the atoms diffracted into the nth\norder is changed by ±2nhk , where n is an integer number and\nk is the wave number of the photons [17].\nIn general, a single light pulse excites several different\ndiffraction orders, which implies a coupling efficiency less\nthan 100% into a particular order. To achieve a nearly ideal\n50/50 splitting ratio, we have developed the double subpulse\nscheme [18]. The condensate starts at rest. Then the first pulse\ncouples some of atoms into the p = ±2hk state while the\nothers stay in the p = 0 state. The phases of atoms with\ndifferent momenta evolve at different rates before the second\npulse mixes them again. The phase evolution of atoms in the\np = ±2hk state is faster than that of the ones in the p = 0\nstate. The differential phase shift between the atoms can be\nwritten as ∆φ = 4ω r ∆t , where ω r = hk 2 / 2m is the recoil\nfrequency, m is the mass of atoms, and the ∆t is the delay\nbetween the raising edges of the two pulses. Atoms in the\ndifferent momentum states interfere as the second subpulse\nmixes them again. If the phase difference ∆φ is a multiple of\n2π , which corresponds to the delay ∆t = nπ / 2ω r between\nthe two pulses, most atoms will populate in the p = ±2hk\nstate. On the other hand, if the phase difference is (2n + 1)π ,\nwhich corresponds to the delay ∆t = (2n + 1)π / 4ω r , most\natoms will remain in the zero momentum state after the double\npulse. The contrast ratio of this interferometric splitting can be\nmade 100% by optimizing the power and the length of the\npulses [18]. In our experiment, splitting of the atoms into the\np = ±2hk states, with nearly zero population in the p = 0\nor p = ±4hk state, can be achieved; we find optimum\nsplitting when the two pulses are both 20 μs in duration with\npower around 5.5 μW and the delay between the two pulses is\n63 μs. The atoms in the different momentum states are\ndetected by absorption imaging when the wave packets are\nspatially separated after 10 ms propagation.\nA reflection pulse is used to reverse the direction of\npropagation of the two wave packets simultaneously. The\npulse is chosen to be 150 μs in duration with power 6.2 μW.\nThis relatively long pulse reverses the momenta of the wave\n\npackets through a Bragg scattering process [17]. In response\nto the reflection pulse, the clouds turn around and propagate\nback toward their origin.\nsurface\n\n(a)\n\np=0\n(b)\n\np=-2hk\n\np=2hk\n\np=2hk\n\np=-2hk\n\n(c)\n\n(d)\n\n(e)\n\nFIG. 2. (a) The beamsplitter pulse is turned on at t=0. (b) The\ncondensate is split into two wave packets that propagate in the\nopposite direction at 0<t<T/2. (c) The reflection pulse is turned on at\nt=T/2. (d) The wave packets propagate back toward to the center of\nthe waveguide at T/2<t<T. (e) The recombining pulse is turned on at\nt=T when the clouds are overlapped.\n\nUpon the return to their origin, a second pair of splitting\npulses serves to recombine the two condensate clouds. The\nschematic drawings in Fig. 2 show the whole sequence of\nsplitting, reflecting, and recombining the condensate atoms by\nusing standing-wave light fields. Like a simple optical\nbeamsplitter/recombiner, our atom recombiner has two output\nports. The first output port is represented by atoms having\nzero momentum while the second port is represented by atoms\nhaving p = 2hk . Since the splitting and recombining occur\nat the same spatial location, our atom interferometer is\nanalogous to an optical Michelson interferometer. The relative\nphase shift between the two counterpropagating wave packets\nwill change the fractional number of atoms in the two output\nports. If the potential is perfectly symmetric, the relative phase\nshift should be zero, and the atoms should all be in the zero\nmomentum state, as shown in Fig. 3(a). On the other hand, if\nthe waveguide potential is not symmetric, the nonzero relative\nphase shift should lead to the presence of atoms in the\np = ±2hk state. In a special case where the relative phase\nshift is π, the number of atoms in the p = 0 state should be\nnearly zero due to destructive interference, and all the atoms\nwill appear in p = ±2hk state, as shown in Fig. 3(b). The\n\n\fpopulations in the two momentum states are anticorrelated\nsince the total number is conserved.\n(a)\n\np = -2hk p = 0 p = 2hk\n\n(b)\n\np = -2hk p = 0\n\np = 2hk\n\n220 mm\nFIG. 3. Interference pattern of (a) phase shift = 2nπ and (b) phase\nshift = (2n+1)π. The absorption images are taken 10 ms after the\nrecombining pulse.\n\nTo demonstrate interference, a differential phase shift is\nintroduced by a magnetic gradient while the two wave packets\nare spatially separated after the splitting pulse. The differential\nphase shift ∆φmag can be written as\n\nN/Ntot\n\n(b)\n\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0.0\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n\n0.4\n0.3\n0.2\n0.1\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n\np = 2hk\n\np=0\n\n0\n\n2\n4\n6\n8\nMagnetic gradient [G/cm]\n\n10\n\nwhere μRb is the magnetic dipole moment of 87Rb, B′ is a timedependent magnetic gradient, ∆x is the time-dependent\nseparation of the two clouds, t1 is the time at which the\nmagnetic gradient is turned on, and t2 is the time at which the\nmagnetic gradient is turned off. The magnetic gradient is\nprovided by a single wire that is perpendicular to the\nwaveguide and 3.6 mm away from its center. The interference\ndue to the change of the magnetic gradient is shown in Fig.\n4(a). The total propagation time of condensates in the\nwaveguide is 1 ms, and the time between each pulse is 0.5 ms.\nThe magnetic gradient is switched on 0.25 ms before the\nreflection pulse for a duration of 0.5 ms. The maximum\nseparation of the two clouds is around 12 μm, which is small\ncompared to the full width at half maximum of the cloud size,\n~100 μm. The periodicity of the interference can be changed\nby varying the timing of the magnetic gradient pulse, which\nchanges the separation of the clouds when the magnetic\ngradient is turned on. The result of the interference with the\nmagnetic gradient switched on 0.05 ms before the reflection\npulse is also shown in Fig. 4(b). The maximum contrast ratio\nshown in the figure is as large as 100%.\nInterference is also observed after 10 ms propagation in the\nwaveguide. An initial velocity of the condensate is created in\nthe trap with a longitudinal frequency of 5 Hz, and the\ndifferential phase shift is observed by changing the total\npropagation time in the waveguide. The result of the\ninterference is shown in Fig 5. The best contrast ratio of the\ninterference at 10 ms, with maximum separation of the two\nclouds of about 120 μm, is 20%. The contrast ratio drops\nrapidly as we increase the propagation time in the waveguide.\nWe attribute this reduction of the contrast to the dispersion of\nthe wave packets. The dispersion might arise from atom-atom\ninteraction, an inhomogeneous guiding potential, or a nonzero\ncurvature of the applied magnetic gradient; this topic requires\nfurther study.\n\np = 2hk\nN/Ntot\n\nN/Ntot\n\n(a)\n\nt2 μ\nB ′(t )∆x(t )\n∆H\ndt = ∫ Rb\ndt ,\nh\nt1 h\nt1\n\nt2\n\n∆φ mag = ∫\n\np=0\n\n0\n\n2\n4\n6\n8\nMagnetic gradient [G/cm]\n\n10\n\nFIG. 4. Interference fringes after 1 ms propagation time in the\nwaveguide with (a) the magnetic gradient turned for 500 μs while the\naverage separation of clouds is 8.82 μm and with (b) the magnetic\ngradient turned for the same time while the average separation of\nclouds is 6.94 μm.\n\n0.34\n0.32\n0.30\n0.28\n0.26\n0.50\n0.45\n0.40\n0.35\n0.30\n\np = 2hk\n\np=0\n\n8\n9\n10\n11\n12\nPropagation time in the waveguide [ms]\n\nFIG. 5. Interference fringes after about 10 ms propagation in the\nwaveguide.\n\nIn conclusion, we have demonstrated an on-chip atom\nMichelson interferometer. This is the first on-chip observation\nof atom interference between external states. The coherence of\nthe wave packets has been observed up to 10 ms in the\n\n\fwaveguide with a corresponding contrast ratio of 20%. The\ncontrast ratio needs to be improved for a future interferometer\ndesign in which the cloud propagates for longer distances. The\noptical technique for splitting, reflecting, and recombining the\ncondensates enables us to study decoherence effects that may\naffect coherent atom-chip devices in general.\nThe authors would like to thank P. D. D. Schwindt and L.\nCzaia for experimental assistance and useful discussion. This\nwork was supported by the Army Research Office and the\nOffice of the Secretary of Defense through a MURI program\nin Ultracold Atom Optics Science and Technology (Grant No.\nDAAD19-00-1-0163), the Defense Advanced Research\nProjects Agency's Defense Science Office through a PINS\nprogram (Grant No. W911NF-04-1-0043), the Office of Naval\nResearch (Grant No. N00014-03-1-0551) and the National\nScience Foundation (Grant No. PHY-0096822).\n-------------------------\n∗ Present address: PRESTO, Japan Science and Technology\nAgency(JST), and Department of Applied Physics,\nSchool of Engineering, The University of Tokyo, Hongo\n7-3-1, Bunkyo-ku, Tokyo 113-8656, JAPAN\n[1] O. Carnal and J. Mlynek, Phys. Rev. Lett. 66, 2689\n(1991).\n[2] D. W. Keith, C. R. Ekstrom, Q. A. Turchette, and D. E.\nPritchard, Phys. Rev. Lett. 66, 2693 (1991).\n[3] M. Kasevich and S. Chu, Phys. Rev. Lett. 67, 181 (1991).\n[4] J. E. Simsarian, J. Denschlag, M. Edwards, C. W. Clark,\nL. Deng, E. W. Hagley, K. Helmerson, S. L. Rolston, and\nW. D. Phillips, Phys. Rev. Lett. 85, 2040 (2000).\n\n[5] Y. Torii, Y. Suzuki, M. Kozuma, T. Sugiura, T. Kuga, L.\nDeng, and E. W. Hagley, Phys. Rev. A 61, 041602\n(2000).\n[6] S. Schneider, A. Kasper, Ch. vom Hagen, M. Bartenstein,\nB. Engeser, T. Schumm, I. Bar-Joseph, R. Folman, L.\nFeenstra, and J. Schmiedmayer, Phys. Rev. A 67, 023612\n(2003).\n[7] H. Ott, J. Fortagh, G. Schlotterbeck, A. Grossmann, and\nC. Zimmermann, Phys. Rev. Lett. 87, 230401 (2001).\n[8] W. Hänsel, P. Hommelhoff, T. W. Hänsch, and J.\nReichel, Nature (London) 413, 498 (2001).\n[9] M. Vengalattore, W. Rooijakkers, and M. Prentiss, Phys.\nRev. A 66, 053403 (2002).\n[10] M P. A. Jones, C. J. Vale, D. Sahagun, B. V. Hall, and E.\nA. Hinds, Phys. Rev. Lett. 91, 080401 (2003).\n[11] A. E. Leanhardt, Y. Shin, A. P. Chikkatur, D. Kielpinski,\nW. Ketterle, and D. E. Pritchard, Phys. Rev. Lett. 90,\n100404 (2003).\n[12] J. Fortágh, H. Ott, S. Kraft, A. Günther, and C.\nZimmermann, Phys. Rev. A 66, 041604 (2002).\n[13] A. E. Leanhardt, A. P. Chikkatur, D. Kielpinski, Y. Shin,\nT. L. Gustavson, W. Ketterle, and D. E. Pritchard, Phys.\nRev. Lett. 89, 040401 (2002).\n[14] D. S. Hall, M. R. Matthews, C. E. Wieman, and E. A.\nCornell, Phys. Rev. Lett. 81, 1543 (1998).\n[15] Y. Shin, M. Saba, T. A. Pasquini, W. Ketterle, D. E.\nPritchard and A. E. Leanhardt, Phys. Rev. Lett. 92,\n050405 (2004).\n[16] P. D. D. Schwindt, Ph.D. thesis, University of Colorado\nat Boulder, 2003.\n[17] P. J. Martin, B. G. Oldaker, A. H. Miklich, and D. E.\nPritchard, Phys. Rev. Lett. 60, 515 (1988).\n[18] S. Wu et al. (to be published).\n\n\f"}