{"id": "http://arxiv.org/abs/cond-mat/0408117v2", "guidislink": true, "updated": "2005-06-20T11:55:50Z", "updated_parsed": [2005, 6, 20, 11, 55, 50, 0, 171, 0], "published": "2004-08-05T14:36:48Z", "published_parsed": [2004, 8, 5, 14, 36, 48, 3, 218, 0], "title": "Dynamics and thermodynamics of a simple model similar to\n  self-gravitating systems: the HMF model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0408335%2Ccond-mat%2F0408676%2Ccond-mat%2F0408091%2Ccond-mat%2F0408638%2Ccond-mat%2F0408543%2Ccond-mat%2F0408250%2Ccond-mat%2F0408570%2Ccond-mat%2F0408243%2Ccond-mat%2F0408117%2Ccond-mat%2F0408359%2Ccond-mat%2F0408396%2Ccond-mat%2F0408573%2Ccond-mat%2F0408308%2Ccond-mat%2F0408196%2Ccond-mat%2F0408107%2Ccond-mat%2F0408627%2Ccond-mat%2F0408355%2Ccond-mat%2F0408487%2Ccond-mat%2F0408605%2Ccond-mat%2F0408351%2Ccond-mat%2F0408014%2Ccond-mat%2F0408420%2Ccond-mat%2F0408101%2Ccond-mat%2F0408279%2Ccond-mat%2F0408622%2Ccond-mat%2F0408417%2Ccond-mat%2F0408097%2Ccond-mat%2F0408001%2Ccond-mat%2F0408568%2Ccond-mat%2F0408601%2Ccond-mat%2F0408673%2Ccond-mat%2F0408631%2Ccond-mat%2F0408144%2Ccond-mat%2F0408620%2Ccond-mat%2F0408495%2Ccond-mat%2F0408312%2Ccond-mat%2F0408200%2Ccond-mat%2F0408018%2Ccond-mat%2F0408582%2Ccond-mat%2F0408238%2Ccond-mat%2F0408181%2Ccond-mat%2F0408429%2Ccond-mat%2F0408260%2Ccond-mat%2F0408474%2Ccond-mat%2F0408272%2Ccond-mat%2F0408530%2Ccond-mat%2F0408399%2Ccond-mat%2F0408400%2Ccond-mat%2F0408607%2Ccond-mat%2F0408186%2Ccond-mat%2F0408645%2Ccond-mat%2F0408323%2Ccond-mat%2F0408065%2Ccond-mat%2F0408418%2Ccond-mat%2F0408540%2Ccond-mat%2F0408220%2Ccond-mat%2F0408639%2Ccond-mat%2F0408652%2Ccond-mat%2F0408537%2Ccond-mat%2F0408176%2Ccond-mat%2F0408342%2Ccond-mat%2F0408653%2Ccond-mat%2F0408584%2Ccond-mat%2F0408304%2Ccond-mat%2F0408150%2Ccond-mat%2F0408604%2Ccond-mat%2F0408440%2Ccond-mat%2F0408076%2Ccond-mat%2F0408209%2Ccond-mat%2F0408231%2Ccond-mat%2F0408512%2Ccond-mat%2F0408141%2Ccond-mat%2F0408433%2Ccond-mat%2F0408208%2Ccond-mat%2F0408348%2Ccond-mat%2F0408441%2Ccond-mat%2F0408033%2Ccond-mat%2F0408192%2Ccond-mat%2F0408078%2Ccond-mat%2F0408189%2Ccond-mat%2F0408309%2Ccond-mat%2F0408542%2Ccond-mat%2F0408093%2Ccond-mat%2F0408218%2Ccond-mat%2F0408290%2Ccond-mat%2F0408572%2Ccond-mat%2F0408316%2Ccond-mat%2F0408481%2Ccond-mat%2F0408090%2Ccond-mat%2F0408105%2Ccond-mat%2F0408551%2Ccond-mat%2F0408525%2Ccond-mat%2F0408085%2Ccond-mat%2F0408602%2Ccond-mat%2F0408536%2Ccond-mat%2F0408255%2Ccond-mat%2F0408608%2Ccond-mat%2F0408615%2Ccond-mat%2F0408613%2Ccond-mat%2F0408485%2Ccond-mat%2F0408261&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamics and thermodynamics of a simple model similar to\n  self-gravitating systems: the HMF model"}, "summary": "We discuss the dynamics and thermodynamics of the Hamiltonian Mean Field\nmodel (HMF) which is a prototypical system with long-range interactions. The\nHMF model can be seen as the one Fourier component of a one-dimensional\nself-gravitating system. Interestingly, it exhibits many features of real\nself-gravitating systems (violent relaxation, persistence of metaequilibrium\nstates, slow collisional dynamics, phase transitions,...) while avoiding\ncomplicated problems posed by the singularity of the gravitational potential at\nshort distances and by the absence of a large-scale confinement. We stress the\ndeep analogy between the HMF model and self-gravitating systems by developing a\ncomplete parallel between these two systems. This allows us to apply many\ntechnics introduced in plasma physics and astrophysics to a new problem and to\nsee how the results depend on the dimension of space and on the form of the\npotential of interaction. This comparative study brings new light in the\nstatistical mechanics of self-gravitating systems. We also mention simple\nastrophysical applications of the HMF model in relation with the formation of\nbars in spiral galaxies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0408335%2Ccond-mat%2F0408676%2Ccond-mat%2F0408091%2Ccond-mat%2F0408638%2Ccond-mat%2F0408543%2Ccond-mat%2F0408250%2Ccond-mat%2F0408570%2Ccond-mat%2F0408243%2Ccond-mat%2F0408117%2Ccond-mat%2F0408359%2Ccond-mat%2F0408396%2Ccond-mat%2F0408573%2Ccond-mat%2F0408308%2Ccond-mat%2F0408196%2Ccond-mat%2F0408107%2Ccond-mat%2F0408627%2Ccond-mat%2F0408355%2Ccond-mat%2F0408487%2Ccond-mat%2F0408605%2Ccond-mat%2F0408351%2Ccond-mat%2F0408014%2Ccond-mat%2F0408420%2Ccond-mat%2F0408101%2Ccond-mat%2F0408279%2Ccond-mat%2F0408622%2Ccond-mat%2F0408417%2Ccond-mat%2F0408097%2Ccond-mat%2F0408001%2Ccond-mat%2F0408568%2Ccond-mat%2F0408601%2Ccond-mat%2F0408673%2Ccond-mat%2F0408631%2Ccond-mat%2F0408144%2Ccond-mat%2F0408620%2Ccond-mat%2F0408495%2Ccond-mat%2F0408312%2Ccond-mat%2F0408200%2Ccond-mat%2F0408018%2Ccond-mat%2F0408582%2Ccond-mat%2F0408238%2Ccond-mat%2F0408181%2Ccond-mat%2F0408429%2Ccond-mat%2F0408260%2Ccond-mat%2F0408474%2Ccond-mat%2F0408272%2Ccond-mat%2F0408530%2Ccond-mat%2F0408399%2Ccond-mat%2F0408400%2Ccond-mat%2F0408607%2Ccond-mat%2F0408186%2Ccond-mat%2F0408645%2Ccond-mat%2F0408323%2Ccond-mat%2F0408065%2Ccond-mat%2F0408418%2Ccond-mat%2F0408540%2Ccond-mat%2F0408220%2Ccond-mat%2F0408639%2Ccond-mat%2F0408652%2Ccond-mat%2F0408537%2Ccond-mat%2F0408176%2Ccond-mat%2F0408342%2Ccond-mat%2F0408653%2Ccond-mat%2F0408584%2Ccond-mat%2F0408304%2Ccond-mat%2F0408150%2Ccond-mat%2F0408604%2Ccond-mat%2F0408440%2Ccond-mat%2F0408076%2Ccond-mat%2F0408209%2Ccond-mat%2F0408231%2Ccond-mat%2F0408512%2Ccond-mat%2F0408141%2Ccond-mat%2F0408433%2Ccond-mat%2F0408208%2Ccond-mat%2F0408348%2Ccond-mat%2F0408441%2Ccond-mat%2F0408033%2Ccond-mat%2F0408192%2Ccond-mat%2F0408078%2Ccond-mat%2F0408189%2Ccond-mat%2F0408309%2Ccond-mat%2F0408542%2Ccond-mat%2F0408093%2Ccond-mat%2F0408218%2Ccond-mat%2F0408290%2Ccond-mat%2F0408572%2Ccond-mat%2F0408316%2Ccond-mat%2F0408481%2Ccond-mat%2F0408090%2Ccond-mat%2F0408105%2Ccond-mat%2F0408551%2Ccond-mat%2F0408525%2Ccond-mat%2F0408085%2Ccond-mat%2F0408602%2Ccond-mat%2F0408536%2Ccond-mat%2F0408255%2Ccond-mat%2F0408608%2Ccond-mat%2F0408615%2Ccond-mat%2F0408613%2Ccond-mat%2F0408485%2Ccond-mat%2F0408261&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss the dynamics and thermodynamics of the Hamiltonian Mean Field\nmodel (HMF) which is a prototypical system with long-range interactions. The\nHMF model can be seen as the one Fourier component of a one-dimensional\nself-gravitating system. Interestingly, it exhibits many features of real\nself-gravitating systems (violent relaxation, persistence of metaequilibrium\nstates, slow collisional dynamics, phase transitions,...) while avoiding\ncomplicated problems posed by the singularity of the gravitational potential at\nshort distances and by the absence of a large-scale confinement. We stress the\ndeep analogy between the HMF model and self-gravitating systems by developing a\ncomplete parallel between these two systems. This allows us to apply many\ntechnics introduced in plasma physics and astrophysics to a new problem and to\nsee how the results depend on the dimension of space and on the form of the\npotential of interaction. This comparative study brings new light in the\nstatistical mechanics of self-gravitating systems. We also mention simple\nastrophysical applications of the HMF model in relation with the formation of\nbars in spiral galaxies."}, "authors": ["P. H. Chavanis", "J. Vatteville", "F. Bouchet"], "author_detail": {"name": "F. Bouchet"}, "author": "F. Bouchet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjb/e2005-00234-0", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0408117v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0408117v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0408117v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0408117v2", "arxiv_comment": null, "journal_reference": "Eur. Phys. J. B, 46, 61 (2005)", "doi": "10.1140/epjb/e2005-00234-0", "fulltext": "arXiv:cond-mat/0408117v2 [cond-mat.stat-mech] 20 Jun 2005\n\nEPJ manuscript No.\n(will be inserted by the editor)\n\nDynamics and thermodynamics of a simple model similar to\nself-gravitating systems: the HMF model\nP.H. Chavanis1 , J. Vatteville1 and F. Bouchet2\n1\n\n2\n\nLaboratoire de Physique Théorique, Université Paul Sabatier, 118 route de Narbonne 31062 Toulouse, France\ne-mail: chavanis@irsamc.ups-tlse.fr\nEcole Normale Supérieure de Lyon, 46 Allée d'Italie, 69364 Lyon, France\ne-mail: Freddy.Bouchet@ens-lyon.fr\nTo be included later\nAbstract. We discuss the dynamics and thermodynamics of the Hamiltonian Mean Field model (HMF)\nwhich is a prototypical system with long-range interactions. The HMF model can be seen as the one Fourier\ncomponent of a one-dimensional self-gravitating system. Interestingly, it exhibits many features of real selfgravitating systems (violent relaxation, persistence of metaequilibrium states, slow collisional dynamics,\nphase transitions,...) while avoiding complicated problems posed by the singularity of the gravitational\npotential at short distances and by the absence of a large-scale confinement. We stress the deep analogy\nbetween the HMF model and self-gravitating systems by developing a complete parallel between these two\nsystems. This allows us to apply many technics introduced in plasma physics and astrophysics to a new\nproblem and to see how the results depend on the dimension of space and on the form of the potential of\ninteraction. This comparative study brings new light in the statistical mechanics of self-gravitating systems.\nWe also mention simple astrophysical applications of the HMF model in relation with the formation of\nbars in spiral galaxies.\nPACS. 05.20.-y Classical statistical mechanics – 05.45.-a Nonlinear dynamics and nonlinear dynamical\nsystems\n\n1 Introduction\nThe statistical mechanics of systems with long-range interactions is currently a topic of active research in physics\nbecause it differs in many respects from that of more familiar systems with short-range forces that are extensive\n(Dauxois et al. 2002a). Among long-range interactions,\ngravity is probably the most important and most fundamental example (Padmanabhan 1990, Chavanis 2002a).\nHowever, the statistical mechanics of self-gravitating systems initiated by Antonov (1962) and Lynden-Bell (1968)\nis complicated due to the divergence of the gravitational\nforce at short distances and to the absence of shielding\n(or confinement) at large distances. These difficulties are\nspecific to the gravitational force and not to the longrange nature of the interaction. Therefore, it may be of\nconceptual interest to consider simpler systems with longrange interactions to distinguish what is specific to the\ngravitational force and what is common to systems with\nlong-range interactions.\nA toy model of systems with long-range interactions\nis the so-called HMF (Hamiltonian Mean Field) model. It\nconsists of N particles moving on a circle and interacting\nvia a cosine binary potential. This can be seen as a onedimensional plasma where the potential of interaction is\n\ntruncated to one mode. This model is of great conceptual interest because it exhibits many features present in\nmore realistic systems with long-range interactions such as\ngravitational systems. In addition, it is sufficiently simple\nto allow for accurate numerical simulations and analytical\nresults.\nTo our knowledge, what is now called the HMF model\nwas first introduced by Konishi & Kaneko (1992). They\nfound that a cluster is formed in some cases and that the\nsystem remains uniform in other cases. Inagaki & Konishi\n(1993) realized that the Konishi-Kaneko system is nothing\nbut the one Fourier component of a one-dimensional selfgravitating system and explained the formation of clusters\nas an instability similar to the Jeans instability in selfgravitating systems described by the Vlasov equation. Inagaki (1993) studied the thermodynamical stability of the\nKonishi-Kaneko system and identified the existence of a\nsecond order phase transition at a critical temperature Tc .\nAbove Tc the only statistical equilibrium state is uniform,\nwhereas below Tc this uniform state looses its thermodynamical stability and clustered states appear. In order to\njustify his results dynamically, Inagaki (1996) developed a\n\"collisional\" kinetic theory of the Konishi-Kaneko system\nbased on results of plasma physics and proposed to model\nthe dynamics of the system by the Lenard-Balescu equa-\n\n\f2\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\ntion for a one dimensional plasma truncated to one mode.\nHowever, as we shall see, his conclusions demand further\ndiscussion.\nThe same model was considered at about the same\ntime by Pichon and Lynden-Bell (Pichon 1994) who gave\nan astrophysical application of this model in relation with\nthe formation of bars in galactic disks. In their approach,\nthe stars follow rigid elliptical orbits with eccentricity e. If\nφi represents the inclination of ellipse i and Ωi its angular\nvelocity, the torque exerted by an orbit to the other can\nbe written α−1 dΩ1 /dt = ∂ψ12 /∂φ1 where α−1 is the adiabatic moment of inertia of the inner Lindblad orbit and\nψ12 = GA2 cos 2(φ1 −φ2 ) is the effective alignement potential. At high temperatures, the orbits are almost uniformly\ndistributed in space and the system is in a disk phase (see\nFig. 4). However, below some critical temperature Tc , the\nellipses tend to align to each other and form a bar (see\nFig. 5). Those bars are reported observationally in real\ngalaxies. Pichon and Lynden-Bell studied the linear stability of these bars with respect to the Vlasov equation\nand proposed that the clustered phase could result from\na process of violent relaxation, a concept introduced by\nLynden-Bell (1967) to explain the regularity of collisionless stellar systems such as elliptical galaxies.\nThe Konishi-Kaneko system, now called the HMF model,\nalso appeared in statistical mechanics (Antoni & Ruffo\n1995). In that context, the motivation was to devise a simple model with long-range interactions keeping the richness of more realistic systems while being amenable to a\nfull analytical and numerical treatement. Excitingly, this\nsimple model displays a lot of interesting features (violent relaxation, persistence of metaequilibrium states, slow\ncollisional relaxation, phase transitions,...) also present in\nother systems with long-range interactions such as stellar\nsystems and 2D vortices (Chavanis 2002a). The properties of the HMF model have been studied in great detail\nin a lot of recent papers (see Dauxois et al. 2002b for a review). Despite its oversimplification, the HMF model can\nbe seen as a pedagogical model to take a step into the\nphysics of systems with long-range interactions. It is said\nsometimes to represent the \"harmonic oscillator\" of systems with long-range interactions. This probably explains\nits popularity.\nIn the present paper, we shall emphasize the connection between the HMF model and the results established\nin astrophysics and plasma physics. In particular, we will\nadapt the methods developed for 3D self-gravitating systems to the case of a one-dimensional system of particles\nwith cosine interactions. The motivation of this extension\nis two-fold. The first is to show that the results obtained\nin astrophysics and plasma physics can have applications\nin other domains of physics, including the HMF model\n(this has not been sufficiently appreciated by workers in\nthat field since the early work of Inagaki). The second is\nto stress the analogies and the differences which appear in\nlong-range systems as we change the dimension of space\nand the potential of interaction. Among the analogies between 3D self-gravitating systems and the HMF model,\nwe note: the concept of violent relaxation and the slow\n\ncollisional dynamics. Among the differences, we note: the\nequivalence of statistical ensembles for the HMF model\n(contrary to 3D gravitational systems), the existence of\nsecond order phase transitions (instead of first order or zeroth order phase transitions for 3D gravitational systems)\nand the vanishing of the collision operator at the order\n1/N in the BBGKY hierarchy contrary to the Coulombian or Newtonian case.\nThe paper is organized as follows. In Sec. 2, we consider the statistical equilibrium states of the HMF model\nin both microcanonical and canonical ensembles. We synthesize previously known results and we derive explicit criteria of thermodynamical stability for the uniform phase\nas well as for the clustered phase. We also describe corrections to the mean-field approximation close to the critical\npoint. In Sec. 3, we consider a one-dimensional gaseous\nsystem with cosine interactions (the analogue of a \"gaseous\nstar\") described by the Euler equations with a barotropic\nequation of state. We discuss in particular the equivalent\nof the Jeans instability. In Sec. 4, we consider the collisionless evolution of the HMF model (the analogue of a\n\"stellar system\") described by the Vlasov equation and\ndiscuss the concept of violent relaxation and metaequilibrium states. We interprete these quasi-equilibrium states\nas particular stationary solutions of the Vlasov equation\non the coarse-grained scale resulting from phase mixing\nand incomplete violent\nWe regard Tsallis funcR relaxation.\n1\n(f q − f )dθdv and Boltzmann functional Sq [f ] = − q−1\nR\ntional SB [f ] = − f ln f dθdv as particular H-functions in\nthe sense of Tremaine et al. (1986) associated with polytropic and isothermal distributions. We study the dynamical stability of stationary solutions of the Vlasov equation\nand compare with the dynamical stability of stationary\nsolutions of the barotropic Euler equations. This is the\nsame type of comparison as between \"gaseous systems\"\nand \"stellar systems\" in astrophysics. In that respect, we\ndiscuss the equivalent of the Antonov first law (Binney &\nTremaine 1987) for the HMF model. We derive a criterion of nonlinear dynamical stability for steady states of\nthe Vlasov equation of the form f = f (ǫ) with f ′ (ǫ) < 0\nwhere ǫ is the individual energy, and show that it can\nbe written as a condition on the velocity of sound in the\ncorresponding barotropic gas. This criterion is equivalent\nto the criterion obtained by Yamaguchi et al. (2004) but\nit is expressed differently. We also analyze the linear dynamical stability of steady states of the Vlasov equation\nand study the dispersion relation for isothermal and polytropic distributions. In Sec. 5, we discuss the collisional\nevolution of the HMF model and explain why the kinetic theory is more complicated than for 3D Newtonian\ninteractions. In particular, the Landau and the LenardBalescu collision terms vanish for 1D systems so that the\nevolution of the system as a whole is due to terms of\norder smaller than 1/N in the expansion of the correlation functions for N → +∞. This implies that the relaxation time is larger than N tD (where tD is the dynamical time). By contrast, we can develop a kinetic theory\nat order 1/N to analyze the relaxation of a \"test particle\" in a bath of \"field particles\" with static distribution\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nf0 (v). The evolution of the distribution function P (v, t) of\nthe velocity of the test particle satisfies a Fokker-Planck\nequation. We give explicit expressions for the diffusion coefficient and the auto-correlation function and we compare their expressions depending on whether collective effects are taken into account or not. We also show that the\nauto-correlation function decreases exponentially rapidly\nin time with a rate coinciding with the damping rate γ of a\nstable perturbed solution of the Vlasov equation. Finally,\nin Sec. 6, we discuss the case of self-attracting Brownian\nparticles described by non-local Fokker-Planck equations.\nThis stochastic model is the canonical counterpart of the\nHamiltonian N -body problem. It could be called the BMF\n(Brownian Mean Field) model. We study the dynamical\nstability of steady states of the non-local Smoluchowski\nequation and solve this equation numerically to show the\nformation of a clustered state from an unstable homogeneous state due to long-range interactions. We also provide\nanalytical solutions of the dynamics close to the critical\npoint Tc and for T = 0. All these models have an equivalent in the astrophysical literature and this paper stresses\nthe analogies and differences between self-gravitating systems and the HMF model. This comparative study brings\nnew light in the statistical mechanics of self-gravitating\nsystems by showing what is specific to gravity and what\nis common to systems with long-range interactions.\n\n2 Statistical equilibrium\n2.1 The mean-field approximation\nWe consider a system of N particles moving on a circle\nand interacting via a cosine binary potential. This is the\nso-called HMF model. As explained in the Introduction,\nthis model can also describe a system of stars moving on\nelliptical orbits, each orbit exerting a torque on the others.\nFundamentally, the dynamics of this system is governed\nby the Hamilton equations\ndvi\n∂H\n∂H\ndθi\n,\nmi\n,\n=\n=−\nmi\ndt\n∂vi\ndt\n∂θi\nN\nX\n1\nk X\nmi vi2 −\nmi mj cos(θi − θj ),\nH=\n2\n4π\ni=1\n\nThe evolution of the N -body distribution function is\ngoverned by the Liouville equation\n\u0013\nN \u0012\n∂PN\n∂PN\n∂PN X\nvi\n=0\n+ Fi\n+\n∂t\n∂θi\n∂vi\ni=1\n\n(1)\n\nwhere θi is the angle that makes particle/ellipse i with an\naxis of reference and k is the coupling constant (similar\nto the gravitational constant G). In the rest of the paper,\nwe shall refer to this system as a \"stellar system\"; this is\nto emphasize the analogies with real 3D stellar systems\nwhose dynamics is also governed by Hamiltonian equations with long-range interactions. We have also generalized the usual HMF model to a population of particles\nwith different masses mi . However, in most of the paper,\nwe shall assume that all the particles have the same mass\nm = 1. The multi-species HMF model will be discussed\nspecifically in Sec. 7.\n\n(2)\n\nk PN\nwhere Fi = − 2π\nj=1 sin(θi − θj ) is the force experienced by particle i. Any distribution of the form PN =\nχ(H)δ(E − H) is a stationary solution of the Liouville\nequation. For N ≫ 1 (fixed) and t → +∞, this system\nis expected to reach a statistical equilibrium state due to\nthe developement of correlations between particles (this\nwill be refered to as a \"collisional\" relaxation). As is customary in statistical mechanics, we shall assume that the\nequilibrium N -body distribution function is described by\nthe microcanonical distribution\n\nPN (θ1 , v1 , ..., θN , vN ) =\n\n1\nδ(E − H),\ng(E)\n\n(3)\n\nexpressing that all accessible microstates (with the right\nvalues of energy and mass) are equiprobable. Whether this\nis indeed the case has not been proved rigorously as it\nrelies on a hypothesis of ergodicity, so this statement is\nessentially a postulate.\nFor systems with long-range interactions (self-gravitating\nsystems, 2D vortices, HMF model,...), it can be shown\nthat the mean-field approximation is exact in an appropriate thermodynamic limit. This can be shown for example by considering an equilibrium BBGKY-like hierarchy (Chavanis 2004b,2005). For the HMF model, the\nthermodynamic limit is N → +∞ in such a way that\nthe properly normalized energy ǫ = 8πE/kM 2 and temperature η = βkM/4π are fixed, where M = N m is the\ntotal mass. These control parameters are similar to those,\nǫ = ER/GM 2 and η = βGM m/R, describing 3D gravitational systems (see, e.g., Chavanis 2003a). In that limit\nN → +∞, the two-body distribution function can be expressed as a product of two one-body distribution functions\nP2 (θ1 , v1 , θ2 , v2 ) = P1 (θ1 , v1 )P1 (θ2 , v2 ) + O(1/N ).\n\ni6=j\n\n3\n\n(4)\n\nThe average\nPdensity of particles in phase space is given by\nf (θ, v) = h i δ(θ − θi )δ(v − vi )i = N P1 (θ, v). The total\nmass can then be expressed as\nZ\nM = f dθdv.\n(5)\nOn the other hand, the average energy E = hHi is\nZ\nv2\nE = N P1 (θ, v) dθdv\n2\nZ\nk\n− N (N − 1) cos(θ − θ′ )P2 (θ, v, θ′ , v ′ )dθdvdθ′ dv ′ .(6)\n4π\nIn the mean-field limit, it reduces to\nZ\nZ\n1\n1\nE=\nf v 2 dθdv +\nf Φdθdv,\n2\n2\n\n(7)\n\n\f4\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nwhere\nΦ(θ) = −\n\nk\n2π\n\nZ\n\n2π\n\ncos(θ − θ′ )ρ(θ′ )dθ′ ,\n\n0\n\n(8)\n\nR\nis the potential and ρ = f dv is the spatial density. Note\nthat the average force experienced by a particle located in\nθ is hF i = −Φ′ (θ). If ρ is symmetric with respect to the\nx-axis, so that ρ(−θ) = ρ(θ), the foregoing relation can be\nrewritten\nΦ(θ) = B cos θ,\n(9)\nwhere\nB=−\n\nk\n2π\n\nZ\n\n2π\n\nρ(θ′ ) cos θ′ dθ′ .\n\n(10)\n\n0\n\nThis parameter B is the equivalent of the magnetization\n(usually denoted M ) in the case of spin systems. Inserting\nthe relation (9) in Eq. (7), we find that the energy can be\nrewritten\nZ\nπB 2\n1\n,\n(11)\nf v 2 dθdv −\nE=\n2\nk\n\nso that the potential energy is directly expressed in terms\nof B.\n2.2 The Boltzmann entropy\n\nWe wish to determine the macroscopic distribution of particles at statistical equilibrium, assuming that all accessible microstates (with given E and M ) are equiprobable.\nTo that purpose, we divide the μ-space {θ, v} into a very\nlarge number of microcells with size h. We do not put\nany exclusion, so that a microcell can be occupied by an\narbitrary number of particles. We shall now group these\nmicrocells into macrocells each of which contains many microcells but remains nevertheless small compared to the\nphase-space extension of the whole system. We call ν the\nnumber of microcells in a macrocell. Consider the configuration {ni } where there are n1 particles in the 1st macrocell, n2 in the 2nd macrocell etc. Using the standard combinatorial procedure introduced by Boltzmann, the number\nof microstates corresponding to the macrostate {ni }, i.e.\nits probability, is given by\nW ({ni }) = N !\n\nY ν ni\ni\n\nni !\n\n.\n\n(12)\n\nThis is the Maxwell-Boltzmann statistics. As is customary,\nwe define the entropy of the state {ni } by\nS({ni }) = ln W ({ni }).\n\n(13)\n\nIt is convenient here to return to a representation in terms\nof the distribution function giving the phase-space density\nin the i-th macrocell fi = f (θi , vi ) = ni /νh. Using the\nStirling formula and passing to the continuum limit ν → 0,\nwe obtain the usual expression of the Boltzmann entropy\nZ\nSB [f ] = − f ln f dθdv,\n(14)\n\nup to some unimportant additive constant. Then, the statistical equilibrium state, corresponding to the most probable distribution of particles, is obtained by maximizing\nthe Boltzmann entropy (14) at fixed mass M and energy\nE, i.e.\nMax {SB [f ] | E[f ] = E, M [f ] = M }.\n\n(15)\n\nThis maximization problem defines the microcanonical equilibrium state, which is the correct description for an isolated Hamiltonian system.\nWe shall also consider the canonical description which\napplies to a system in contact with a thermostat imposing its temperature T . We will give an example of canonical system in Sec. 6 corresponding to Brownian particles\nin interaction described by stochastic (not Hamiltonian)\nequations (BMF model). In the canonical ensemble, the\nstatistical equilibrium state is obtained by minimizing the\nfree energy FB [f ] = E[f ] − T SB [f ] at fixed mass M and\ntemperature T , i.e.\nMin {FB [f ] | M [f ] = M }.\n\n(16)\n\nThe relation between the Boltzmann entropy SB [f ] and\nthe density of states g(E) in the microcanonical ensemble\nand between the Boltzmann free energy FB [f ] and the partition function Z(β) in the canonical ensemble is discussed\nin Chavanis (2004b,2005). The variational problems (15)\nand (16) correspond to a saddle point approximation in\nthe functional integral representation of g(E) and Z(β).\nThe variational problem (15) has been first investigated, in the HMF context, by Inagaki (1993). We review\nand precise the main results of his study and present an\nalternative derivation of the condition of thermodynamical stability using methods similar to those introduced by\nPadmanabhan (1990) and Chavanis (2002b,2003a) for 3D\nself-gravitating systems. This will make the analogy between the two systems (stellar systems and HMF model)\ncloser. This will also allow us to study the thermodynamical stability of the clustered phase, while the analysis of\nInagaki (1993) is restricted to the uniform phase.\n2.3 The first variations: the Maxwell-Boltzmann\ndistribution\nWe need first to determine the critical points of entropy at\nfixed mass and energy. We write the variational principle\nin the form\nδSB − βδE − αδM = 0,\n(17)\n\nwhere β = 1/T (inverse temperature) and α (chemical potential) are Lagrange multipliers enforcing the constraints\non E and M . The solution of (17) is the mean-field MaxwellBoltzmann distribution\nf = A′ e−β(\n\nv2\n2\n\n+Φ)\n\n,\n\n(18)\n\nwhere Φ depends on f through Eq. (8). The foregoing relation is therefore an integro-differential equation. Integrating over the velocity, we obtain the mean-field Boltzmann\ndistribution\nρ = Ae−βΦ .\n(19)\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nρ = Ae−βB cos θ .\n\n(20)\n\n3\n\n−2\n\n−3\n−20\n\n−10\n\n0\nx\n\n10\n\n1.5\n\n1\nB>0\n0.5\nB=0\n\n0\n\nClustered\nphase\n\n−0.5\nHomogeneous\nphase\n\nFor z → 0,\n\n20\n\nFig. 1. Graphical construction showing the appearance of a\nclustered phase below some critical temperature Tc .\n\nB/Bmax\n\n(22)\n\n0\n\n−1\n\n(21)\n\nwhere In are the modified Bessel functions\nZ\n1 π z cos θ\ne\ncos(nθ)dθ.\nIn (z) =\nπ 0\n\nT<Tc\n\n1\n\nThe axis of symmetry is determined by the initial conditions. If B = 0, the density ρ is uniform. This defines the\nhomogeneous phase. If B 6= 0, we have inhomogeneous\nstates with one cluster at θ = 0 (if B < 0) or at θ = π (if\nB > 0). The constant A is related to the mass by\nM = 2πAI0 (βB),\n\nT=Tc\n\nT>Tc\n2\n\n2I1(x)/I0(x)\n\nThe same distributions (18) and (19) are obtained in the\ncanonical ensemble by cancelling the first variations of free\nenergy at fixed mass, using δFB − αδM = 0. Therefore,\nthe critical points of the variational problems (15) and\n(16) coincide. In the microcanonical ensemble, we need to\nrelate the Lagrange multiplier β to the energy E. This\ndefines a series of equilibria β = β(E). In the canonical\nensemble, the inverse temperature β is assumed given and\nthe corresponding (average) energy is obtained by inversing the graph β(E). Of course, only the stable part of the\nseries of equilibria is of physical interest, and defines the\ncaloric curve (see Sec. 2.5). We note that the equilibrium\ndistributions (18) and (19) can also be obtained from an\nequilibrium BBGKY-like hierarchy in the thermodynamic\nlimit N → +∞ defined in Sec. 2.1 (Chavanis 2004b,2005).\nUsing the relation (9), the distribution of particles at\nstatistical equilibrium is given by\n\n5\n\nB<0\n\n−1\n\n\u0014\n\u0015\n1\n1\nz2\nIn (z) = ( z)n\n+\n+ ... ,\n2\nΓ (n + 1) 4Γ (n + 2)\n\n(23)\n\n\u0014\n\n2\n\n\u0015\n\n4n − 1\ne\n1−\n+ ... .\nIn (z) = √\n8z\n2πz\n\nkM I1 (βB)\n.\n2π I0 (βB)\n\n(25)\n\nThen x, and consequently B, is determined as a function\nof T by a simple graphical construction sketched in Fig.\n1. We see that B = 0 is always solution although B 6= 0\nis possible only if\nkM\n≡ Tc .\n4π\n\n2\n\n3\n\n4\n\n5\n\n(24)\n\nSetting x = βB, we can rewrite the foregoing relation in\nthe form\n4πT\nI1 (x)\nx=2\n.\n(26)\nkM\nI0 (x)\n\nT <\n\n1\n\nFig. 2. Order parameter B (magnetization) as a function of\nthe inverse temperature.\n\nUsing Eqs. (10) and (22) we find that the order parameter B is determined as a function of the temperature\nβ by the implicit equation\nB=\n\n0\n\nβ/βc\n\nand for z → +∞,\nz\n\n−1.5\n\n(27)\n\nIn terms of the energy (11) this corresponds to\nE<\n\nkM 2\n≡ Ec .\n8π\n\n(28)\n\nThe function B(T ) is shown in Fig. 2 and its asymptotic\nbehaviours are given in Sec. 2.4. Figure 2 displays a second order phase transition. We have a situation similar\nto a gravitational collapse below a critical temperature Tc\nor below a critical energy Ec . For T > Tc , the system is\nhomogeneous. For T < Tc , the system forms one cluster\naround θ = 0 (for B < 0) or around θ = π (for B > 0). At\nT = 0, the equilibrium state is a Dirac peak ρ = M δ(θ−π)\n(for B = Bmax ). Density profiles are plotted in Fig. 3 for\ndifferent values of x = βB(β). Using the stellar disk interpretation of Pichon & Lynden-Bell, we have represented\nsome stellar orbits in Figs. 4 and 5 by randomly choosing\nthe orbits' angles with the equilibrium distribution ρ(θ).\n\n\f6\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n3\n\n8\nT−>0\n\n2.5\n\n6\n\nC/N\n\n2πρ(θ)/M\n\n2\n\n4\n\n1.5\n\n1\n\n2\n0.5\n\nT=Tc\n\n0\n\n0\n\n0\n\n2\n\n4\n\n0\n\n0.5\n\n1\nT/Tc\n\n6\n\nθ\n\nFig. 3. Evolution of the density profile as temperature is decreased (from bottom to top).\n\n1.5\n\n2\n\nFig. 6. Specific heat C = dE/dT as a function of temperature.\nIt experiences a discontinuity at the critical temperature Tc .\n\nThe \"disk phase\" for T > Tc is represented in Fig. 4 and\nthe \"bar phase\" for T < Tc is represented in Fig. 5.\n\n2.5\nT>Tc\n1.5\n\n2.4 The thermodynamical parameters\n0.5\n\nAccording to Eq. (26), the relation between the temperature and the order parameter can be written in dimensionless form as\n\nY\n−0.5\n\nη ≡ β/βc =\n\n−1.5\n\nFor x → 0,\n−2.5\n−2.5\n\nη =1+\n−1.5\n\n−0.5\n\n0.5\n\n1.5\n\n2.5\n\nX\n\nFig. 4. Stellar orbits in the \"disk phase\" for T > Tc .\n2.5\nT<Tc\n\n1\n0.5\n0\n\nB\nBmax\n\n−0.5\n−1\n−1.5\n−2\n−2.5\n−2.5\n\n−1.5\n\n(30)\n\n\u0012\n\u0013\n1\nx\n1+\n+ ... .\n2\n2x\n\nReturning to original variables, we deduce that\ns \u0012\n\u0013\nT\nTc − T\nB\n=± 2 1−\n≪ 1),\n,\n(0 <\nBmax\nTc\nTc\n\n1.5\n\nY\n\nx2\n+ ...\n8\n\n−0.5\n\n0.5\n\n1.5\n\n2.5\n\nX\n\nFig. 5. Stellar orbits in the \"bar phase\" for T < Tc .\n\n(29)\n\nand for x → +∞,\nη=\n\n2\n\nx I0 (x)\n.\n2 I1 (x)\n\n\u0013\n\u0012\nT\n,\n=± 1−\n4Tc\n\n(T ≪ Tc ),\n\n(31)\n\n(32)\n\n(33)\n\nwhere Bmax = 2Tc = kM/2π is the maximum value of the\nmagnetization obtained for T = 0 when all the particles\nare at θ = π. With this notation, the parameter x can be\nwritten\n(34)\nx = 2ηB/Bmax .\nOn the other hand, for the Maxwellian velocity distribution (18), the expression of the energy (11) becomes\nE=\n\nπB 2\n1\nMT −\n.\n2\nk\n\n(35)\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nIn terms of dimensionless parameters, we get\n\u0012\n\u0013\nx2\n1\n1−\n.\nǫ ≡ E/Ec =\nη\n2η\n\n8\n\n(36)\n6\n\nB=0\n(unstable)\n\n1\n.\nη\n\n(37)\n\nFor the inhomogeneous phase, we can easily obtain asymptotic expansions. For x → 0,\n5\nǫ = 1 − x2 + ...\n8\n\nη=kMβ/4π\n\nFor the homogeneous phase B = 0, we simply have\nǫ=\n\n4\n\n(38)\n\nEc,Tc\n\n0\n\n(T > Tc ),\n(0 <\n\nT\nE\n=\n− 1,\nE0\nTc\n\nTc − T\n≪ 1),\nTc\n\n(T ≪ Tc ),\n\n0\n\nB=0\n(stable)\n\n2\n2\nε=8πE/kM\n\n4\n\nFig. 7. Calorique curve (series of equilibria) for the HMF\nmodel. The system displays a second order phase transition\nat a critical point Ec , Tc .\n\n(40)\n\nZ\n1\n1\nMT +\nρΦdθ.\n(46)\n2\n2\nWe now take the variations of entropy around an equilibrium solution. To second order\n\u0012 \u00132 Z\nZ\n1\n(δρ)2\nM δT\nM δT\n− δρ ln ρdθ −\n−\ndθ.\nδSB =\n2 T\n4\nT\n2\nρ\n(47)\nE=\n\n(41)\n(42)\n\nwhere −E0 = −kM 2 /4π is the minimum value of energy\nobtained for T = 0 (ǫ0 = −2). For T → Tc− , the specific\nheat C = dE/dT is given by C = 52 M and for T > Tc by\nC = M\n2 . Therefore, at the critical point, it experiences a\ndiscontinuity (see Fig. 6):\nC(Tc− ) − C(Tc+ ) = 2M.\n\n−2\n\n(39)\n\nReturning to original variables, we deduce that\n1T\nE\n=\n,\nE0\n2 Tc\n\u0012\n\u0013\nE\nT\n1\n6−5\n,\n=\nE0\n2\nTc\n\nB>0\n(stable)\n\n2\n\nand for x → +∞,\n\u0012\n\u0013\n2\nǫ = −2 1 − + ... .\nx\n\n7\n\n(43)\n\nNow, the conservation of energy implies\nZ\nZ\n1\n1\n0 = δE = M δT + Φδρdθ +\nδρδΦdθ.\n2\n2\n\nEliminating δT , we find that\nZ\n1\nThe caloric curve/series of equilibria β(E) is shown in Fig.\nδ 2 SB = −\nδρδΦdθ\n7. It displays a second order phase transition at (ǫ, η) =\n2T\n\u0012Z\n\u00132\nZ\n(1, 1). This is different from 3D gravitational systems which\n(δρ)2\n1\n1\nrather display first order and zeroth order phase transidθ.\nΦδρdθ\n−\n−\nMT 2\n2\nρ\ntions (see, e.g., Chavanis 2002c).\n\n(48)\n\n(49)\n\nWe define the quantity q by the relation\n\n2.5 The second variations: thermodynamical stability\nTo analyze the thermodynamical stability of the solutions\ndetermined by the variational problems (15) and (16), we\nuse an approach similar to that followed by Padmanabhan (1990) and Chavanis (2002b,2003a) in the case of 3D\nself-gravitating systems. We first maximize SB [f ] at fixed\nM [f ], E[f ] and ρ(θ). This gives the Maxwellian\nf (θ, v) = √\n\nv2\n1\nρ(θ)e− 2T .\n2πT\n\n(44)\n\nThen, we can re-express the entropy and the energy as a\nfunction of the density in such a way that\nZ\n1\n(45)\nSB = M ln T − ρ ln ρ dθ,\n2\n\nδρ =\n\ndq\n.\ndθ\n\n(50)\n\nRθ\nPhysically, q = 0 δρdθ represents the mass perturbation\nwithin the interval [0, θ]. Then, the conservation of mass\nis equivalent to q(0) = q(2π) = 0. Inserting this relation in\nEq. (49) and using integrations by parts, we can put the\nsecond order variations of entropy in the quadratic form\nZ 2π Z 2π\nδ 2 SB =\ndθdθ′ q(θ)K(θ, θ′ )q(θ′ ),\n(51)\n0\n\n0\n\nwith\n\ndΦ\n1 dΦ\n(θ) (θ′ )\nM T 2 dθ\ndθ\n\u0014\n\u0015\nk\n1\n1 d\nd\n′\n′ d\n. (52)\n+\nsin(θ − θ ) ′ + δ(θ − θ ) ′\n4πT\ndθ\n2\ndθ ρ(θ′ ) dθ′\n\nK(θ, θ′ ) = −\n\n\f8\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n10\n\n5\n\nB=0\n\nUNSTABLE\n0\nλM\n\nSTABLE\n\nSTABLE\n\nB>0\n\n−5\n\n(CE)\n−10\n\nB>0\n\n(MCE)\n−15\n\n0\n\n0.5\n\n1\n\n1.5\nβ/βc\n\n2\n\n2.5\n\n3\n\nFig. 8. Dependence of the largest eigenvalue λ with the\ntemperature. A negative value of λ corresponds to stability\n(δ 2 S < 0) and a positive value of λ corresponds to instability.\n\nWe are thus led to consider the eigenvalue problem\nZ 2π\nK(θ, θ′ )qλ (θ′ )dθ′ = λqλ (θ).\n(53)\n0\n\nThis yields\n\u0012\n\u0013\nZ 2π\nk\nd 1 dq\n+\nq(θ′ ) cos(θ − θ′ )dθ′\ndθ ρ dθ\n2πT 0\n2V dΦ\n+ 2λq,\n=\nM T 2 dθ\nwhere\nV =\n\nZ\n\n0\n\n2π\n\ndΦ\nq(θ)dθ.\ndθ\n\nequivalent. This is at variance with the case of 3D stellar\nsystems (Padmanabhan 1990, Chavanis 2002b,2003a).\nWe can study the solutions of Eq. (57) by decomposing q in Fourier series. For the mode n, we have qn =\n2\nAn sin(nθ). For n 6= 1, we get λn = − πn\nM < 0 showing\nthat these modes do not induce instability. For n = 1,\nk\nπ\nwe have λ1 = 4T\n−M\n. The uniform solution will be unstable if λ1 > 0 yielding condition (27). Therefore, the\nuniform phase is stable for T > Tc while it is unstable for\nT < Tc . By using the theory of linear series of equilibria (Katz 1978, 1980, 2003), applied here to a bifurcation\npoint, we directly conclude from the inspection of Fig. 7\nthat the clustered phase will be stable for T < Tc when\nthe homogeneous phase becomes unstable.\nMore precisely, it is possible to solve Eqs. (54) and\n(56) analytically for the clustered phase in the limit B →\n0, which is valid close to the critical point (Ec , Tc ). The\ncalculations are detailed in Appendix A. In the canonical\nensemble (V = 0), it is found that the largest eigenvalue\nis\n\u0013\n\u0012\nβ\n−1 .\n(58)\nλM = −2π\nβc\nand in the microcanonical ensemble (V 6= 0) that\n\u0013\n\u0012\nβ\n−1 .\nλM = −10π\nβc\n\n(59)\n\nMore generally, the exact value of λ obtained by solving\nEqs. (54) and (56) numerically is plotted versus the inverse\ntemperature in Fig. 8. Since λ < 0, we check explicitly that\nthe clustered phase is stable.\n(54)\n2.7 Correction to the mean-field approximation close\nto the critical point\n(55)\n\nThe system is stable if all λ < 0 and unstable if at least\none λ > 0. So far, we have worked in the microcanonical\nensemble. If we work in the canonical ensemble, we have\nto minimize the free energy FB = E − T SB at fixed mass\nand temperature. We can easily check that fixing T in the\npreceding calculations amounts to taking V = 0. Thus,\ninstead of Eq. (54), we obtain\n\u0012\n\u0013\nZ 2π\nk\nd 1 dq\n+\nq(θ′ ) cos(θ − θ′ )dθ′ = 2λq. (56)\ndθ ρ dθ\n2πT 0\n2.6 The condition of thermodynamical stability\nIf we consider the stability of the uniform solution ρ =\nM/2π and Φ = 0, the foregoing equations simplify into\nZ 2π\n2π d2 q\nk\n+\nq(θ′ ) cos(θ − θ′ )dθ′ = 2λq.\n(57)\nM dθ2\n2πT 0\nThe eigenvalue equation is the same in the two ensembles.\nHence, the stability criteria coincide, implying that the\nstatistical ensembles (microcanonical and canonical) are\n\nWe can obtain the expression of the two-points correlation function from an equilibrium BBGKY-like hierarchy\nby closing the second equation of the hierarchy with the\nKirkwood approximation (Chavanis 2004b,2005). This is\nvalid to order 1/N in the thermodynamic limit defined\npreviously. For the HMF model, it is then possible to obtain an explicit expression of the correlation function in\nthe homogeneous phase. Writing the two-body distribution function as\nN 2 P2 (θ1 − θ2 ) = ρ2 [1 + h(θ1 − θ2 )],\n\n(60)\n\nit is found that\nh(θ1 − θ2 ) =\n\n2 β/βc\ncos(θ1 − θ2 ).\nN 1 − β/βc\n\n(61)\n\nWe note that the correlation function diverges close to the\ncritical point β → βc where the clustered phase appears\nand the homogeneous phase becomes unstable. This implies that the mean-field approximation ceases to be valid\nclose to the critical point. We expect a similar result for\n3D self-gravitating systems although the situation is more\ndifficult to analyze as (real) self-gravitating systems are\nalways inhomogeneous.\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nIf we take into account the contribution of non-trivial\npair correlations (61) in the potential energy, we find furthermore that Eq. (37) is replaced by\nǫ=\n\n1 2η\n1\n−\n.\nη\nN 1−η\n\n(62)\n\nTherefore, finite N effects modify the shape of the caloric\ncurve in the vicinity of the critical point. The mean-field\napproximation is valid if N (1 − η) ≫ 1. When the mean\nfield approximation is valid, its order one correction for\nthe specific heat is\n\u0014\n\u0015\n1\n1\nN\n1+\n(T > Tc ).\n(63)\nC=\n2\nπN (T /Tc − 1)2\nFinally, it is found that the spatial correlations of the\nforce are given by (Chavanis 2004b,2005)\nhF (0)F (θ)i =\n\nρk 2\n1\ncos θ.\n4π 1 − β/βc\n\n(64)\n\nIn particular, the variance of the force is\nhF 2 i =\n\n1\nρk 2\n.\n4π 1 − β/βc\n\n(65)\n\nNote that without the correlations, we would have sim2\nply obtained hF 2 i = ρk\n4π which corresponds to the high\ntemperature limit (T → +∞) of Eq. (65).\nFor the HMF model, the variance (65) of the force is\nfinite while the variance of the Newtonian force for 3D\nself-gravitating systems is infinite (Chandrasekhar & von\nNeumann 1942). For the HMF model, the distribution of\nthe force is normal (Gaussian) while the distribution of\nthe gravitational force in D = 3 is a particular Lévy law\ncalled the Holtzmark distribution. On the other hand, for\n2D point vortices, the variance of the velocity is a marginal\nGaussian distribution intermediate between normal and\nLévy laws (Chavanis & Sire 2000). Therefore, these three\nsystems with long-range interactions (self-gravitating systems, 2D vortices and HMF model) have their own specificities despite their overall analogies.\n\n3 Gaseous systems\nAs indicated in the Introduction, the HMF model is similar to stellar systems in astrophysics. In Secs. 4 and 5, we\nshall discuss the kinetic theory of the HMF model and\nobtain the equivalent of the Vlasov and Landau equations that are used to describe the dynamics of elliptical\ngalaxies and globular clusters respectively. However, in order to facilitate the discussion and the comparison, it is\nuseful to discuss first the dynamics of a one-dimensional\nbarotropic fluid system with cosine interactions described\nby the Euler equations. In astrophysics, these equations\ndescribe the dynamics of barotropic stars. Stellar systems\nand barotropic stars are often treated in parallel due to\ntheir analogies (Binney & Tremaine 1987). In particular,\n\n9\n\nit is possible to infer sufficient conditions of dynamical\nstability for spherical stellar systems from the dynamical\nstability of a barotropic star with the same density distribution. This constitutes the Antonov first law. Therefore,\nit is also of interest to develop this parallel in the case of\nthe HMF model. To have a similar vocabulary, the systems considered in this paper will also be called \"stellar\nsystems\" and \"gaseous stars\" although they are only onedimensional and correspond to a cosine interaction.\n3.1 Euler equations and energy functional\nWe consider a gaseous system described by the Euler equations\n∂\n∂ρ\n+\n(ρu) = 0,\n∂t\n∂θ\n\n(66)\n\n∂u\n∂u\n1 ∂p ∂Φ\n+u\n=−\n−\n,\n∂t\n∂θ\nρ ∂θ\n∂θ\n\n(67)\n\nwhere the potential Φ is given by (8). To close the equations, we consider an arbitrary barotropic equation of state\np = p(ρ). We emphasise that these equations cannot be\nderived from the HMF model (1) which rather leads to\nkinetic equations like the Vlasov equation. However, we\nshall see that there is a close connection between the stationary states of the Vlasov and the Euler equations and\nthat the limits of dynamical stability are the same in the\ntwo systems. Thus, the study of the Euler equation (which\nis simpler than the Vlasov equation) brings many information about the stability of stationary states of the HMF\nmodel with respect to the Vlasov equation even if the Euler system does not describe dynamically the HMF model.\nIt is straightforward to verify that the energy functional\nZ\nZ\nZ Z ρ\n1\nu2\np(ρ′ ) ′\ndρ\ndθ\n+\ndθ, (68)\nρΦdθ\n+\nρ\nW= ρ\nρ′2\n2\n2\n0\nis conserved by the Euler equations (Ẇ = 0). The first\nterm is the internal energy, the second the potential energy and the third the kinetic energy associated with the\nmean motion. The mass is also conserved. Therefore, a\nminimum of W at fixed mass determines a stationary solution of the Euler equations which is formally nonlinearly\ndynamically stable in the sense of Holm et al. (1985). We\nare led therefore to consider the minimization problem\nMin {W[ρ, u] | M [ρ] = M }.\n\n(69)\n\n3.2 First variations: the condition of hydrostatic\nequilibrium\nCancelling the first order variations of Eq. (68), we obtain\nu = 0 and the condition of hydrostatic equilibrium\ndΦ\ndp\n= −ρ .\ndθ\ndθ\n\n(70)\n\n\f10\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nTherefore, extrema of W correspond to stationary solutions of the Euler equations (66)-(67). On the other hand,\ncombining the condition of hydrostatic equilibrium (70)\nand the equation of state p = p(ρ), we get\nZ ρ ′ ′\np (ρ ) ′\ndρ = −Φ,\n(71)\nρ′\nso that ρ is a function of Φ that we note ρ = ρ(Φ). Using\nEq. (9), we find that\nρ = ρ(B cos θ),\n\n(72)\n\nwhere B is determined by the implicit equation\nB=−\n\nk\n2π\n\nZ\n\nρ(B cos θ′ ) cos θ′ dθ′ .\n\n(73)\n\n0\n\n1+\n\nk dρ\n(0) ≤ 0.\n2 dΦ\n\n(c2s )crit\n\nkM\n,\n=\n4π\n\n(75)\n\nwhere cs = (dp/dρ)1/2 is the velocity of sound in the homogeneous phase where ρ = M/2π.\n\n3.3 Second variations: the condition of nonlinear\ndynamical stability\n\nwhich must be positive for stability. Using the same procedure as in Sec. 2.5, we find that the eigenvalue equation\ndetermining the stability of the solution is now\n\u0012\n\np′ (ρ) dq\nρ dθ\n\n\u0013\n\n+\n\nk\n2π\n\n(78)\n\nZ\n\n0\n\n3.4 The condition of linear stability: Jeans-like\ncriterion\nWe now study the linear dynamical stability of a stationary solution of the Euler equation. We consider a small\nperturbation around a stationary solution of Eqs. (66)(67) and write ρ = ρ + δρ, u = δu etc... The linearized\nequations for the perturbation are\n∂\n∂δρ\n+\n(ρδu) = 0,\n∂t\n∂θ\nρ\n\n∂δu\n∂\n∂δΦ\n∂Φ\n= − (p′ (ρ)δρ) − ρ\n− δρ ,\n∂t\n∂θ\n∂θ\n∂θ\nZ 2π\nk\ncos(θ − θ′ )δρ(θ′ )dθ′ .\nδΦ(θ) = −\n2π 0\n\n2π\n\nq(θ′ ) cos(θ − θ′ )dθ′ = 2λq,\n(77)\n\nand that the condition of stability is λ < 0 (this yields a\nmaximum of −W). For the uniform solution ρ = M/2π,\nwe can repeat exactly the same steps as in Sec. 2.6 since\np′ (ρ) is a constant c2s which plays the role of T in the thermodynamical analysis. Therefore, we find that the uniform\n\n(79)\n\n(80)\n(81)\n\nWriting the time dependence in the form δρ ∼ eλt ,..., we\nget\nλδρ +\n\nThe second variation of W due to variation of the velocity\nis trivially positive. The second variation of W due to\nvariation of ρ is\nZ\nZ ′\np (ρ)\n1\n(δρ)2 dθ,\n(76)\nδ2W =\nδρδΦdθ +\n2\n2ρ\n\nd\ndθ\n\nkM\n,\n4π\n\nand dynamically unstable otherwise. According to Eq. (75),\nthe onset of dynamical instability coincides with the point\nwhere the clustered phase appears.\nThe stability of the clustered phase can be investigated\nby solving the eigenvalue equation (77) for a specified\nequation of state p(ρ). This equation is the counterpart of\nequation (222) of Chavanis (2003a) for 3D self-gravitating\ngaseous spheres.\n\n(74)\n\nUsing the condition of hydrostatic balance (70), this can\nbe rewritten\n≤\n\nc2s ≥\n\n2π\n\nAgain, B = 0 is a solution of this equation characterizing\na homogeneous phase ρ = M/2π. To determine the point\nof bifurcation to the inhomogeneous phase, we expand Eq.\n(73) around B = 0. Then, we find that cluster solutions\nappear when\n\nc2s\n\nphase is formally nonlinearly dynamically stable with respect to the Euler equations when\n\nλρδu = −\n\nd\n(ρδu) = 0,\ndθ\n\nd ′\ndδΦ\ndΦ\n(p (ρ)δρ) − ρ\n− δρ .\ndθ\ndθ\ndθ\n\n(82)\n\n(83)\n\nIntroducing the notation (50), the continuity equation can\nbe integrated into\nλq + ρδu = 0,\n\n(84)\n\nwhere we have imposed δu(0) = δu(2π) = 0. Substituting this relation in Eq. (83) and using the condition of\nhydrostatic equilibrium (70), we finally obtain\n\u0012\n\u0013\nZ 2π\nk\nλ2\nd p′ (ρ) dq\n+\nq.\nq(θ′ ) cos(θ − θ′ )dθ′ =\ndθ\nρ dθ\n2π 0\nρ\n(85)\nThis equation is the counterpart of the Eddington equation of pulsations for a barotropic star (see also Eq. (224)\nof Chavanis 2003a). We note that Eqs. (77) and (85) coincide for the neutral point λ = 0. Therefore, the conditions\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n1\n\nof linear stability and formal nonlinear dynamical stability coincide. The same conclusion holds for 3D barotropic\nstars (Chavanis 2003a).\nConsidering the uniform phase ρ = M/2π and following a method similar to that developed in Sec. 2.6, we find\nthat the most destabilizing mode (n = 1) is\n(86)\n\nwhere the growth rate is given by\n\nUNSTABLE\n0\nSTABLE\n\nSTABLE\n\n2\n\nδρ = a1 cos θ e ,\n\nB=0\n\n4πλ /kM\n\n2πλ\na1 sin θ eλt ,\nδu = −\nM\n\nλt\n\n−1\n\nkM\n− c2s .\n(87)\n4π\n√\nWhen c2s ≤ kM/4π, then λ = ± λ2 and the perturbation\ngrows exponentially √\nrapidly (unstable case). When c2s ≥\n2\nkM/4π, then λ = ±i −λ\n√ and the perturbation oscillates\nwith a pulsation ω = −λ2 without attenuation (stable\ncase). Therefore, the uniform phase is linearly (and also\nformally nonlinearly) dynamically stable with respect to\nthe Euler equations when\nλ2 =\n\nc2s\n\nkM\n≥\n,\n4π\n\n(88)\n\nand linearly dynamically unstable otherwise.\n3.5 Particular examples\n3.5.1 Isothermal gas\nFor an isothermal gas, we have\nc2s = T,\n\np = ρT,\n\n(89)\n\nand\nW=T\n\nZ\n\nρ ln ρdθ +\n\n1\n2\n\nZ\n\nρΦdθ +\n\nZ\n\nρ\n\nu2\ndθ,\n2\n\n(90)\n\nwhere the temperature T is uniform. We note that the\nenergy functional (90) of an isothermal gas coincides with\nthe Boltzmann free energy FB [ρ] = E[ρ] − T SB [ρ] of a\nN -body system in the canonical ensemble, see Eqs. (45)\nand (46) of Sec. 2.5. This remark also holds for 3D selfgravitating systems (Chavanis 2002b). The pulsation equation (85) becomes\n\u0012\n\u0013\nZ 2π\nk\nd 1 dq\nλ2\n+\nq,\nq(θ′ ) cos(θ − θ′ )dθ′ =\ndθ ρ dθ\n2πT 0\nTρ\n(91)\nwhich can be connected to Eq. (56). According to the criteria (78)-(88), the uniform phase is formally nonlinearly\ndynamically stable for\nT ≥ Tc ≡\n\nkM\n,\n4π\n\n11\n\n(92)\n\nand linearly dynamically unstable otherwise. This criterion (or more generally the criterion (88)) can be regarded\n\nB>0\nB=0\n−2\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nβ/βc\n\nFig. 9. Growth rate and pulsation period of an isothermal gas\nas a function of the temperature.\n\nas the counterpart of the Jeans instability criterion in\nastrophysics (Binney & Tremaine 1987). We emphasize,\nhowever, an important difference. In the case of 3D selfgravitating systems, the Jeans criterion selects a critical\nwavelength λJ (increasing with the temperature) above\nwhich the system is unstable against gravitational collapse. In the present context, where the interaction is truncated to one Fourier mode n = 1, the criterion (92) selects\na critical temperature below which the system is unstable.\nThe generalization of the Jeans instability criterion for an\narbitrary binary potential of interaction in D dimensions\nis discussed in Appendix C and in Chavanis (2004b). This\ngeneralization clearly shows the connection between the\nHMF model and 3D self-gravitating systems.\nAccording to Eq. (87), the relation between λ and the\ntemperature T is\nλ2 = Tc − T,\n\nTc =\n\nkM\n.\n4π\n\n(93)\n\nFor T < Tc , the growth rate is λ = (Tc − T )1/2 and for\nT > Tc , the pulsation is ω = (T − Tc )1/2 . Following the\npreceding remark, we stress that, in the present context,\nλ and ω only depend on the temperature T , while for a\n3D gravitational gas, they depend on the wavelength of\nthe perturbation (Binney & Tremaine 1987). Here, the\nunstable mode is fixed to n = 1.\nConsidering now the clustered phase and using a perturbative approach similar to that of Appendix A for T →\nTc− (not\np detailed), we find that the pulsation is given by\n2(Tc − T ). For smaller temperatures, the eigenω =\nvalue equation can be solved numerically and the results\nare shown in Fig. 9.\n3.5.2 Polytropic gas\nFor a polytropic gas, we have\np = Kργ ,\n\nγ =1+\n\n1\n,\nn\n\n(94)\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nwhere K is the polytropic constant and n is the polytropic\nindex. For n → +∞, we recover the isothermal case with\nγ = 1 and K = T . For that reason K is sometimes called\na polytropic temperature. The energy functional (68) can\nbe written\nZ\nZ\nZ\n1\nu2\nK\n(ργ − ρ)dθ +\nρΦdθ + ρ dθ. (95)\nW=\nγ−1\n2\n2\nWe have added a constant term (proportional to the total\nmass) in the polytropic energy functional (95) so as to recover the isothermal energy functional (90) for n → +∞.\nUnder this form, we note that the energy functional of a\npolytropic gas has the same form as the Tsallis free energy Fγ [ρ] = E[ρ] − KSγ [ρ] where γ plays the role of the\nq-parameter and K the role of a generalized temperature.\nThe same remark holds for 3D self-gravitating systems.\nHowever, this resemblance is essentially fortuitous and the\nmark of a thermodynamical analogy (Chavanis 2003a; Chavanis & Sire 2004b).\nIf we define the local temperature by p(θ) = ρ(θ)T (θ),\nwe obtain T (θ) = Kρ(θ)1/n and c2s (θ) = γT (θ). We note\nthat, for a polytropic distribution, the kinetic temperature\nT (θ) usually depends on the position while the polytropic\ntemperature K is uniform as in an isothermal gas. However, in the uniform phase T = Kρ1/n is a constant that\ncan be called the temperature of the polytropic gas. The\nvelocity of sound in the homogeneous phase is\n\u0012 \u00131/n\n1+n M\n2\nγ−1\n.\n(96)\ncs = γT = Kγρ\n=K\nn\n2π\nThe condition of dynamical stability (78)-(88) can be written\n\u0012 \u00131/n\nkM n\n2π\nK ≥ Kn ≡\n,\n(97)\n4π 1 + n M\nor, equivalently,\nT ≥ Tn ≡\n\nTc\nkM\n=\n.\nγ\n4πγ\n\n(98)\n\nFor γ > 1 (i.e., n > 0), the critical temperature Tn is\nsmaller than the corresponding one for an isothermal gas\nTc = T∞ , i.e. the instability is delayed. For γ < 1 (i.e.,\nn < 0), the instability is advanced. Similar results are\nobtained for 3D gravitational systems (Chavanis & Sire\n2004b). According to Eq. (87), the relation between λ and\nthe kinetic temperature T is\nλ2 = γ(Tn − T ).\n\n(99)\n\n3.6 The local Euler equation\nWe can consider a simplified problem where the potential\nin Eq. (67) is fixed to its equilibrium value Φ = B cos θ.\nIn that case, we get the local Euler equation\n∂u\n1 ∂p\n∂u\n+u\n=−\n+ B sin θ.\n∂t\n∂θ\nρ ∂θ\n\n(100)\n\n6\n\n4\n\nθ(t)\n\n12\n\n2\n\n0\n\n0\n\n2.5\n\n5\n1/2\nB t\n\n7.5\n\n10\n\nFig. 10. Characteristics of the forced Burgers equation (102)\nshowing the appearance of shocks and chevrons.\n\nThe stationary solutions are given by (72). The linear\nstability of a stationary solution amounts to solving the\nSturm-Liouville problem\n\u0012\n\u0013\nλ2\nd p′ (ρ) dq\n=\nq.\n(101)\ndθ\nρ dθ\nρ\nThis problem will be considered in Sec. 6.3 for the isothermal equation of state.\nIn the pressureless case, we get the forced Burgers\nequation\n∂u\n∂u\n+u\n= B sin θ.\n∂t\n∂θ\n\n(102)\n\nIt can be solved by the method of characteristics, writing\nthe equation of motion of a particle as\nd2 θ\n= B sin θ.\ndt2\n\n(103)\n\nThe trajectories θ(t) can then be expressed in terms of elliptic functions. The dynamics of the forced Burgers equation is interesting as it develops \"shocks\" and \"chevrons\"\n(caustics) singularities (see Fig. 10). The Burgers equation also appears in cosmology to describe the formation\nof large-scale structures in the universe (Vergassola et al.\n1994). A detailed description of this dynamics is given by\nBarré et al. (2002) in the context of the repulsive HMF\nmodel. In that case, the forced Burgers equation (102)\nwith sin(2θ) instead of sin θ models the short time dynamics of the Hamiltonian N -body system. For the attractive HMF model (1), the short time dynamics can be\nmodelled by the non-local Euler equation (67) with zero\npressure p = 0. This is solution of the Vlasov equation (see\nSec. 4) with f (θ, v, t) = ρ(θ, t)δ(v − u(θ, t)). This singlespeed solution is valid until the first shock. However, the\nconnection with the local Euler equation (102) is not clear\nin that case because the homogeneous phase is unstable\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nwhich precludes the possibility of deriving (102) from (67)\nas is done in Barré et al. (2002) in the repulsive case. Note\nalso that in the attractive HMF model (ferromagnetic) we\njust have one cluser while the repulsive HMF model (antiferromagnetic) shows a bicluster.\n\n4 Violent relaxation, metaequilibrium states\nand dynamical stability of collisionless stellar\nsystems\nWe now come back to the HMF model defined by the\nHamilton equations (1) and develop a kinetic theory by\nanalogy with stellar systems. In particular, we emphasize\nthe importance of the Vlasov equation and the concept of\nviolent relaxation introduced by Lynden-Bell (1967).\n4.1 Vlasov equation and H-functions\nFor systems with long-range interactions, the relaxation\ntime toward the statistical equilibrium state (18) is larger\nthan N tD , where tD is the dynamical time (Chavanis\n2004b). Accordingly, for N → +∞, the relaxation time is\nextremely long and, for timescales of physical interest, the\nevolution of the system is essentially collisionless. More\nprecisely, for t ≪ trelax and N → +∞ (Vlasov limit), the\ntime dependence of the distribution function is governed\nby the Vlasov equation\n∂f\n∂Φ ∂f\n∂f\n+v\n−\n= 0,\n∂t\n∂θ\n∂θ ∂v\n\n(104)\n\nwhich has to be solved in conjunction with Eq. (8). This\nsystem of equations is similar to the Vlasov-Poisson system describing the dynamics of elliptical galaxies and other\ncollisionless stellar systems in astrophysics. Starting from\nan unstable initial condition, the HMF model (1) will\nachieve a metaequilibrium state (on a coarse-grained scale)\nas a result of phase mixing and violent relaxation (Binney\n& Tremaine 1987). This metaequilibrium state is a particular stationary solution of the Vlasov equation. Since\nit results from a complex mixing, it is highly robust and\nnonlinearly dynamically stable with respect to collisionless perturbations. The process of violent relaxation and\nthe convergence of the distribution function toward a stationary solution of the Vlasov equation has been illustrated numerically by Yamaguchi et al. (2004) for the\nHMF model. This is similar to the violent relaxation of\nstellar systems in astrophysics and 2D vortices in hydrodynamics (see Chavanis 2002a).\nOne question of great importance is whether we can\npredict the metaequilibrium state achieved by the system\nas a result of violent relaxation. Lynden-Bell (1967) has\ntried to make such a prediction by resorting to a new\ntype of statistical mechanics accounting for the conservation of all the Casimirs imposed by the Vlasov equation. This theory was developed for the gravitational interaction, but the general ideas and formalism apply to\nany system with long-range interactions described by the\n\n13\n\nVlasov equation. In the non-degenerate limit, he predicts\na Boltzmann distribution of the form f ∼ e−βǫ where the\nindividual mass of the particles does not appear. LyndenBell (1967) also understood that his statistical prediction\nis limited by the concept of incomplete relaxation. The\nsystem tries to reach the most mixed state but, as the\nfluctuations become weaker and weaker as we approach\nequilibrium, it can settle on a stable stationary solution\nof the Vlasov equation which is not the most mixed state.\nIn order to quantify the importance of mixing, Tremaine\net al. (1986) have introduced the concept of H-functions\nZ\n(105)\nS = − C(f )dθdv,\nwhere C is an arbitrary convex function. The H-functions\ncalculated with the coarse-grained distribution function\nf increase as a result of phase mixing in the sense that\nS[f (θ, v, t)] ≥ S[f (θ, v, 0)] for t > 0 where it is assumed\nthat, initially, the system is not mixed so that f (θ, v, 0) =\nf (θ, v, 0). This is similar to the H-theorem in kinetic theory. However, contrary to the Boltzmann equation, the\nVlasov equation does not single out a unique functional\n(the above inequality is true for all H-functions) and the\ntime evolution of the H-functions is not necessarily monotonic (nothing is implied concerning the relative values of\nH(t) and H(t′ ) for t, t′ > 0). On the other hand, any\nstationary solution of the Vlasov equation of the form\nf = f (ǫ) with f ′ (ǫ) < 0 extremizes a H-function at fixed\nmass and energy. If, in addition, it maximizes S at fixed E,\nM , then it is nonlinearly dynamically stable with respect\nto the Vlasov equation. In astrophysics, such distribution\nfunctions depending only on the energy describe spherical\nstellar systems. This is a particular case of the Jeans theorem (Binney & Tremaine 1987). For a 1D system such as\nthe HMF model, this is the general form of inhomogeneous\nstationary solutions of the Vlasov equation. Therefore, we\nexpect that the H-functions will increase during violent\nrelaxation until one of them (non-universal) reaches its\nmaximum value at fixed mass and energy when a stationary solution of the Vlasov equation is reached (this is\nnot necessarily the case in astrophysics since the system\ncan reach a steady state that does not depend only on\nenergy). Note that the Boltzmann and the Tsallis functionals are particular H-functions (not thermodynamical\nentropies in that context) associated with particular stationary solutions of the Vlasov equation: isothermal stellar\nsystems and stellar polytropes (Chavanis & Sire 2004b).\nAll these ideas, first developed for stellar systems, apply\nto other systems with long-range interactions such as the\nHMF model.\n4.2 Nonlinear dynamical stability criterion for the\nVlasov equation\nThe theory of violent relaxation explains how a collisionless system out of mechanical equilibrium can reach a\nsteady solution of the Vlasov equation on a very short\ntimescale due to long-range interactions and chaotic mixing. Since this metaequilibrium state is stable with respect\n\n\f14\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nto collisionless perturbations, it is of interest to determine\na criterion of formal nonlinear dynamical stability for the\nVlasov equation. For the HMF model, this has been considered by Yamaguchi et al. (2004) using the CasimirEnergy method. We shall propose another derivation of\nthe stability criterion which uses a formal analogy with the\nthermodynamical analysis developed in Sec. 2 and which\nis also applicable to the clustered phase. This approach is\nsimilar to the one developed by Chavanis (2003a) for 3D\nstellar systems.\nR\nLet us introduce the functional S = − C(f )dθdv\nwhere C(f ) is a convex function. This functional is a particular Casimir so it is conserved by the Vlasov equation.\nThe energy E and the mass M are also conserved. Therefore, a maximum of S at fixed mass M and energy E determines a stationary solution f (θ, v) of the Vlasov equation\nthat is nonlinearly dynamically stable. We are led therefore to consider the maximization problem\n\nhas mixed Df /Dt = 0 so that Ṡ[f ] = 0. Since f (θ, v, t)\nhas been brought to a maximum f 0 (θ, v) of a certain Hfunction and since S[f ] is conserved (after mixing), then\nf 0 is a nonlinearly dynamically stable steady state of the\nVlasov equation.\n4.3 First variations: stationary solutions of the Vlasov\nequation\nIntroducing Lagrange multipliers as in Sec. 2.3, the critical points of the variational problems (106) and (107) are\ngiven by\nC ′ (f ) = −βǫ − α,\n(108)\n2\n\nwhere ǫ = v2 + Φ is the energy of a particle. Since C ′ is\na monotonically increasing function of f , we can inverse\nthis relation to obtain\nf = F (βǫ + α),\n\nMax {S[f ] | E[f ] = E, M [f ] = M }.\n\n(106)\n\nWe also note that F [f ] = E[f ] − T S[f ] (where T is a\npositive constant) is conserved by the Vlasov equation.\nTherefore, a minimum of F at fixed mass M is nonlinearly\ndynamically stable with respect to the Vlasov equation (F\nis called an energy-Casimir functional). This corresponds\nto the formal stability criterion of Holm et al. (1985). This\ncriterion can be written\nMin {F [f ] | M [f ] = M }.\n\n(107)\n\nTo study the nonlinear dynamical stability of collisionless stellar systems, we are thus led to consider the maximization problems (106) and (107). These are similar to\nthe conditions of thermodynamical stability (15) and (16)\nbut they involve a more general functional S[f ] than the\nBoltzmann entropy. In addition, they have a completely\ndifferent interpretation since they determine the nonlinear dynamical stability of a steady solution of the Vlasov\nequation, not the thermodynamical stability of the statistical equilibrium state. Due to this formal resemblance, we\ncan develop a thermodynamical analogy (Chavanis 2003c)\nand use an effective thermodynamical vocabulary to investigate the nonlinear dynamical stability of a collisionless\nstellar system. In this analogy, S plays the role of an effective entropy, T plays the role of an effective temperature\nand F plays the role of an effective free energy. The criterion (106) is similar to a condition of microcanonical\nstability and the criterion (107) is similar to a condition\nof canonical stability.\nWe also note that the stability criterion (106) is consistent with the phenomenology of violent relaxation. Indeed, the H-functions increase on the coarse-grained scale\nwhile the mass and the energy are approximately conserved. Therefore, the metaequilibrium state is expected\nto maximize a certain H-function (non-universal) at fixed\nmass and energy. In that interpretation, f has to be viewed\nas the coarse-grained distribution function f , not the distribution function itself. The point is that during mixing\nDf /Dt 6= 0 and the H-functions S[f ] increase. Once it\n\n(109)\n\nwhere F (x) = (C ′ )−1 (−x). We can check that any DF\nf = f (ǫ) is a stationary solution of the Vlasov equation\n(104). From the identity\nf ′ (ǫ) = −β/C ′′ (f ),\n\n(110)\n\nresulting from Eq. (108), we see that f (ǫ) is a monotonic\nfunction of the energy. Assuming that f (ǫ) is decreasing,\nwhich is the physical situation, imposes β = 1/T > 0.\nWe note also that for each stellar system with f =\nf (ǫ), there exists a corresponding barotropic star with\nthe same equilibrium density distribution.\nIndeed, definR +∞\ning the density and the pressure by ρ = −∞ f dv = ρ(Φ),\nR +∞\np = −∞ f v 2 dv = p(Φ), and eliminating the potential\nΦ between these two expressions, we find that p = p(ρ).\nWriting explicitly the density and the pressure in the form\nZ +∞\n1\ndǫ,\n(111)\nρ=2\nF (βǫ + α)\n[2(ǫ − Φ)]1/2\nΦ\np=2\n\nZ\n\n+∞\n\nΦ\n\nF (βǫ + α)[2(ǫ − Φ)]1/2 dǫ,\n\n(112)\n\nand taking the θ-derivative of Eq. (112), we obtain the\ncondition of hydrostatic equilibrium (70).\nDue to the analogy between stellar systems and barotropic\nstars, it becomes possible to use the results obtained in\nSec. 3 to study the stationary solutions of the Vlasov equation (104). In particular, the transition from homogeneous\n(B = 0) to inhomogeneous (B 6= 0) solutions is again\ngiven by the criterion (75). Now, in the case of stellar systems, it is more relevant to express this criterion in terms\nof the distribution function. Using the identity (299), the\ncriterion (75) determining the appearance of the clustered\nphase is equivalent to\nZ\nk +∞ f ′ (v)\ndv ≤ 0.\n(113)\n1+\n2 −∞\nv\nWe will soon see how this quantity is related to the dielectric function of a gravitational plasma.\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\n4.4 Second variations: the condition of nonlinear\ndynamical stability\nWe shall investigate the formal nonlinear dynamical stability of stationary solutions of the Vlasov equation by using the criterion (107). This criterion is less refined than\nthe criterion (106) because all solutions of (107) are solution of (106), but the reciprocal is wrong in general. In\nparticular, for long-range interactions, the optimization\nproblems (106) and (107) may not coincide. In thermodynamics, this corresponds to a situation of ensemble inequivalence (see Bouchet & Barré 2004). Therefore, the\ncriterion (107) can only give a sufficient condition of nonlinear dynamical stability for stationary solutions of the\nVlasov equation of the form f = f (ǫ) with f ′ (ǫ) < 0. This\ncorresponds to the criterion of formal nonlinear dynamical stability given by Holm et al. (1985). The more refined\ncriterion (106) has been introduced by Ellis et al. (2002)\nin 2D hydrodynamics (for the 2D Euler-Poisson system)\nand applied by Chavanis (2003a) in stellar dynamics (for\nthe Vlasov-Poisson system).\nTo obtain a managable criterion of dynamical stability, we use the same procedure as the one developed in\nChavanis (2003a). We shall not repeat the steps that are\nidentical. We first minimize the functional F [f ] at fixed\ntemperature and density ρ(θ). This gives an optimal dis2\ntribution f∗ (θ, v), determined by C ′ (f∗ ) = −β v2 − λ(θ),\nwhich depends on the density ρ(θ) through the Lagrange\nmultiplier λ(θ). Then, after some manipulations, we can\nshow that the functional F [ρ] = F [f∗ ] can be put in the\nform\nZ\nZ Z ρ\np(ρ′ ) ′\n1\ndρ dθ,\n(114)\nρΦdθ + ρ\nF =\n2\nρ′2\n0\nwhere p(ρ) is the equation of state determined by C(f )\naccording to Eqs. (111) and (112). We now need to minimize F [ρ] at fixed mass. To that purpose, we just have\nto observe that F [ρ] corresponds to the energy functional\n(68) of a barotropic gas with u = 0. Therefore, the cancellation of the first variations of Eq. (114) returns the\ncondition of hydrostatic equilibrium (70) and the positivity of the second variations leads to the stability criterion\nλ < 0 linked to the eigenvalue equation (77). Therefore,\nthe criterion of formal nonlinear dynamical stability (107)\nfor the Vlasov equation (stellar systems) is equivalent to\nthe criterion of formal nonlinear dynamical stability (69)\nfor the Euler equations (gaseous barotropic stars).\nUsing the results of Sec. 3, we conclude that the uniform phase is formally nonlinearly dynamically stable with\nrespect to the Vlasov equation when\nkM\n.\n(115)\n4π\nWhen the inequality is reversed, the uniform phase is a\nsaddle point of F at fixed mass M and we shall see that it\nis linearly dynamically unstable. Using the identity (299),\nthe nonlinear criterion (115) can be rewritten as\nZ\nk +∞ f ′ (v)\ndv ≥ 0,\n(116)\n1+\n2 −∞\nv\nc2s ≥\n\n15\n\nwhich was found by Yamaguchi et al. (2004) using a different method. An advantage of the present approach is\nthat this approach is also applicable to an inhomogeneous\nsystem. Indeed, the stability of the clustered phase can be\ninvestigated by solving the eigenvalue equation (77) for\nthe equation of state specified by the function C(f ), and\ninvestigating the sign of λ.\n4.5 About the Antonov first law\nAs discussed previously, the criterion (107) providing a\ncondition of nonlinear dynamical stability for a stellar system with f = f (ǫ) and f ′ (ǫ) < 0 is equivalent to the criterion (69) determining the nonlinear dynamical stability of\na barotropic star with the same equilibrium density distribution. On the other hand, we have already indicated\nthat the criterion (107) is less refined than the criterion\n(106) which is believed to be the strongest criterion of\nnonlinear dynamical stability for stationary solutions of\nthe Vlasov equation of the form f = f (ǫ) with f ′ (ǫ) < 0.\nIn general, the criterion (107) just provides a sufficient\ncondition of nonlinear dynamical stability. Thus, we can\n\"miss\" stable solutions if we use just (107) instead of (106)\n[said differently, the set of solutions of (107) is included\nin (106)]. From these remarks, we conclude that \"a stellar\nsystem is stable whenever the corresponding barotropic\ngas is stable\" but the converse is wrong in general. This\nis the so-called Antonov first law in astrophysics (Binney\n& Tremaine 1987). Our approach provides an extension of\nthe Antonov first law to the case of nonlinear dynamical\nstability (while the usual Antonov first law corresponds to\nlinear dynamical stability). Furthermore, by developing a\nthermodynamical analogy, we have provided an original\ninterpretation of the nonlinear Antonov first law in terms\nof \"ensembles inequivalence\" for systems with long-range\ninteractions (Chavanis 2003a) .\nFor 3D self-gravitating systems, we know that the ensembles are not equivalent so that the criterion (107) is\nmore restrictive than the criterion (106). In that case,\n(107) is just a sufficient condition of nonlinear dynamical\nstability (definitely). For example, using the criterion (69),\nit can be shown that polytropic stars with index n < 3 are\nnonlinearly dynamically stable with respect to the Euler\nequations while polytropic stars with index 3 < n < 5\nare dynamically unstable (polytropes with index n > 5\nhave infinite mass). Therefore, using the \"canonical\" criterion (107), we can only deduce that stellar polytropes\nwith index n < 3 are nonlinearly dynamically stable with\nrespect to the Vlasov equation. However, using the \"microcanonical\" criterion (106), we can prove that all stellar\npolytropes with index n < 5 are nonlinearly dynamically\nstable with respect to the Vlasov equation. Polytropes\nwith index 3 < n < 5 lie in a region of \"ensemble inequivalence\" (in the thermodynamical analogy) where the\n\"specific heat\" is negative (Chavanis 2003a).\nFor the HMF model considered in this paper, we believe that the criteria (106) and (107) determine the same\nset of solutions so that the ensembles are equivalent in that\ncase (no solution is forgotten by (107)). We have shown\n\n\f16\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nin Sec. 2 that this is at least the case for isothermal distributions. If we take for granted that this equivalence\nextends to any functional (105), we conclude that, for the\nHMF model, \"a stellar system is stable if, and only if,\nthe corresponding barotropic gas is stable\". This would\nbe the HMF version of the nonlinear Antonov first law.\nIn that case, the stability limits obtained for the Euler\nequation in Sec. 3 can be directly applied to the Vlasov\nequation (they coincide). Clearly, it would be of great interest to derive general criteria telling when the ensembles\nare equivalent or inequivalent, depending on the form of\nthe functional (105) and on the form of the potential of\ninteraction u(r − r′ ).\n4.6 The condition of linear stability\n\nextremizes a H-function at fixed mass and energy, then\nit has a single maximum at v = 0. Therefore, ωr = 0\naccording to Eq. (120) and the criterion of linear dynamical stability (121) coincides with the criterion of formal\nnonlinear dynamical stability (116).\n4.7 Particular examples\nWe shall now present explicit results for particular stationary solutions of the Vlasov equation. We consider the\ncase of isothermal stellar systems and stellar polytropes.\n\n4.7.1 Isothermal stellar systems\n\nWe now study the linear dynamical stability of a spatially\nhomogeneous stationary solution of the Vlasov equation\ndescribed by f = f (v). This problem was first investigated\nby Inagaki & Konishi (1993) and Pichon (1994) and more\nrecently by Choi & Choi (2003). We shall complete here\ntheir study. Writing the perturbation in the form δf ∼\nei(nθ−ωt) and using standard methods of plasma physics,\nwe obtain the dispersion relation\nZ\nf ′ (v)\nk\ndv = 0,\nǫ(n, ω) ≡ 1 + (δn,1 − δn,−1 )\n2\nnv − ω\n(117)\n\nWe consider the H-function\nZ\nS = − f ln f dθdv,\n\nwhere ǫ(n, ω) is the dielectric function and the integral\nmust be performed by using the Landau contour. For the\ndestabilizing mode n = 1 (n = −1 gives the same result),\nEq. (117) reduces to\nZ ′\nk\nf (v)\n1+\ndv = 0.\n(118)\n2\nv−ω\n\nThis distribution function has the same form (but a different interpretation) as the statistical equilibrium state\n(18) of the N -body system.\nThe barotropic gas corresponding to the isothermal\ndistribution function (123) is the isothermal gas with an\nequation of state p = ρT where T = 1/β. Therefore, the\nvelocity dispersion β −1 of an isothermal stellar system is\nequal to the velocity of sound c2s = T in the corresponding\nisothermal gas. The functional (114) takes the form\nZ\nZ\n1\nρΦdθ + T ρ ln ρdθ,\n(124)\nF [ρ] =\n2\n\nThe condition of marginal stability is ωi = 0 where ωi\nis the imaginary part of ω = ωr + iωi . In that case, the\nintegral in Eq. (118) can be written as\nZ\nf ′ (v)\nk\nk\ndv + iπ f ′ (ωr ) = 0,\n(119)\n1+ P\n2\nv − ωr\n2\nwhere P denotes the principal value. Identifying real and\nimaginary parts, if follows that\nZ\nk\nf ′ (v)\n1+ P\ndv = 0,\n2\nv − ωr\nf ′ (ωr ) = 0.\n(120)\nThe second relation fixes the frequency of the perturbation\nand the first equation determines the point of marginal\nstability in the series of equilibria. The system is linearly\ndynamically stable if\nZ\nk\nf ′ (v)\n1+ P\ndv ≥ 0,\n(121)\n2\nv − ωr\nand linearly dynamically unstable otherwise. Note that\nf (v) does not need to be symmetrical. However, if f (v)\n\n(122)\n\nwhich is similar to the Boltzmann entropy (14) in thermodynamics. However, as explained in Sec. 4.1, its physical\ninterpretation is different. Its maximization at fixed mass\nand energy determines a formally nonlinearly dynamically\nstable stationary solution of the Vlasov equation corresponding to the isothermal distribution function\nf = Ae−βǫ .\n\n(123)\n\nand the density is related to the potential according to the\nformula\nρ = A′ e−βΦ ,\n\n(125)\n\nwhich can be obtained by extremizing F [ρ] at fixed mass.\nWe can also express the distribution function in terms of\nthe density according to\nf=\n\n\u0012\n\nβ\n2π\n\n\u00131/2\n\nρ(θ)e−β\n\nv2\n2\n\n.\n\n(126)\n\nAccording to what has been said in Sec. 4.5 about the correspondance between stellar systems and barotropic stars,\nwe conclude that the uniform phase of an isothermal stellar system (123) is formally nonlinearly dynamically stable\nwith respect to the Vlasov equation if T > Tc and linearly\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n1\n\ndynamically unstable otherwise. In terms of the dimen8πE\nkM\nand ǫ = kM\nsionless parameters η = 4πT\n2 , the conditions\nof dynamical stability can be written\n(127)\n\nThey coincide with the conditions of thermodynamical\nstability (see Sec. 2).\nFor the Maxwellian distribution function (126) with\nuniform density, the dielectric function can be written\np\nǫ(1, ω) = 1 − ηW ( βω),\n(128)\n\nλ<0\n\n2\n\nǫ ≥ 1.\n\nStellar\nsystem\n\n0.5\n\n2πλ /kM\n\nη ≤ 1,\n\n17\n\nλ>0\n0\n\nFluid system\n\n−0.5\n\nwhere\n\n1\nW (z) = √\n2π\n\nZ\n\n+∞\n\n−∞\n\nx − x2\ne 2 dx,\nx−z\n\n(129)\n\nis the W -function of plasma physics (Ichimaru 1973). This\nis an analytic function in the upper plane of the complex\nz plane which is continued analytically into the lower half\nplane. Explicitly,\nr\nZ z\n2\ny2\nπ − z2\n− z2\n2\nW (z) = 1 − ze\ndye + i\nze 2 . (130)\n2\n0\nWe look for solutions of the dispersion relation ǫ(1, ω) = 0\nin the form ω = iλ where λ is real. First, we note that\n\u0012r \u0013\nβ\nλ ,\n(131)\nǫ(1, iλ) = 1 − η/G\n2\nwhere we have defined the G-function\n1\n√\n.\n(132)\n1 − πxex2 erfc(x)\n√\nFor x → 0, G(x) = 1 + πx + .... For x → +∞, G(x) =\n2\n2x2 (1 + 2x3 2 + ...). For x → −∞, G(x) ∼ − 2√1πx e−x .\nTherefore, the relation between λ and T is given by\n\u0012r \u0013\nβ\nλ .\n(133)\nη=G\n2\nG(x) =\n\nThe case of neutral stability ω = 0 corresponds to T =\nTc (or η = 1). The case of instability (λ > 0) corresponds\nto T < Tc . The perturbation grows exponentially rapidly\nas δf ∼ eλt . The growth rate λ is given by Eq. (133) which\ncan be explicitly written\nr\n\u0012\n\u001a\n\u0013\u001b\nλ2\nπ\nλ\nTc\n1−\n1−\nλe 2T erfc √\n= 0.\n(134)\nT\n2T\n2T\nFor T →\n\nTc− ,\n\nwe have\nλ∼\n\nr\n\n8\n(Tc − T ),\nkM\n\nand for T → 0, we have\nr\n\u0012\n\u00131/2\nT\nkM\n1−3\nλ→\n.\n4π\nTc\n\n(135)\n\n(136)\n\n−1\n\n0\n\n0.5\n\n1\n\n1.5\nT/Tc\n\n2\n\n2.5\n\n3\n\nFig. 11. Growth rate and decay rate of isothermal stellar systems and isothermal stars as a function of the temperature in\nthe framework of the HMF model.\n\nThe first term in Eq. (136) can be deduced directly from\nEq. (118) by using the distribution function f (v) = ρ δ(v)\nvalid at T = 0 and integrating by parts. The case of\nstability (λ < 0) corresponds to T > Tc . The perturbation is damped exponentially rapidly as δf ∼ e−γt where\nγ = −λ. This is similar to the Landau damping in plasma\nphysics, except that here there is no pulsation (ωr = 0).\nBy contrast, in plasma physics, the pulsation ωr is much\nlarger than the damping rate γ. The damping rate γ = −λ\nis given by\n\u0012r \u0013\nβ\nγ\n(137)\nη=F\n2\nwhere we have defined the F -function\nF (x) =\n\n1+\n\n√\n\n1\n,\nπxex2 erfc(−x)\n\n(138)\n\n√\nsuch that F (x) = G(−x). For x → 0, F (x) = 1− πx+....\nFor x → −∞, F (x) ∼ 2x2 (1 + 2x3 2 + ...). For x → +∞,\n2\nF (x) ∼ 2√1πx e−x . Explicitly,\nr\n\u001a\n\u0013\u001b\n\u0012\nγ2\nπ\nTc\nγ\n1+\nγe 2T erfc − √\n= 0.\n1−\nT\n2T\n2T\n\n(139)\n\nFor T → Tc+ , we have\nγ∼\n\nr\n\n8\n(T − Tc ),\nkM\n\nand for T → +∞, we have\n√\nγ ∼ 2T ln T .\n\n(140)\n\n(141)\n\nObviously, the relation (134) between the growth rate\nand the temperature of an isothermal stellar system is\ndifferent from the corresponding relation (93) valid for an\nisothermal gas (they coincide only at T = 0). A similar\n\n\f18\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\ndistinction is noted in the case of 3D self-gravitating systems. In particular, Fig. 11 can be compared with Fig.\n5.1 of Binney & Tremaine (1987). Moreover, in the unstable regime, a gaseous medium supports sound waves\nwith pulsation ω = (T − Tc )1/2 that are not attenuated.\nBy contrast, in a stellar medium at T < Tc , there exists\nsolutions with no wave (ωr = 0) for which the perturbation is damped exponentially. Other solutions with ωr 6= 0\nprobably exist but they are more difficult to investigate\nanalytically. This is left for a future study.\nThe relations (134) and (139) have been obtained previously by Choi & Choi (2003) using a slightly different\napproach. Our derivation emphasizes the close link with\nresults in plasma physics. In addition, our formalism will\nbe used in Sec. 5.4 to show that the damping rate γ of\na perturbation is equal to the exponential decay of the\ntime auto-correlation function of the force. The generalization of these results for an arbitrary form of long-range\npotential is given in Chavanis (2004b).\n4.7.2 Stellar polytropes\nWe consider the H function\nZ\n1\n(f q − f )dθdv,\nSq = −\nq−1\n\n(142)\n\nwhere q is a real number. This functional has been introduced by Tsallis (1988) in non-extensive thermodynamics. The aim was to develop a generalized thermodynamical formalism to describe quasi-equilibrium structures in\ncomplex media that are not described by the Boltzmann\ndistribution. In this sense, Sq [f ] is interpreted as a generalized entropy and its maximization as a condition of\n(generalized) thermodynamical stability. In the context of\nVlasov systems, we shall rather interprete Sq [f ] as a particular H-function (see Sec. 4.1) and its maximization as a\ncondition of nonlinear dynamical stability 1 . Its maximization at fixed mass and energy leads to a particular class of\n1\n\nIf we were to apply Tsallis thermodynamics in the context of violent relaxation, we would need to introduce the finegrained distribution of phase levels ρ(θ, v, η) [which is the relevant probability field in thatR context] and replace the LyndenBell entropy SL.B.R[ρ] = − ρ ln ρdθdvdη (Lynden-Bell 1967)\n1\n(ρq − ρ)dθdvdη as suggested in Brands et\nby Sq [ρ] = − q−1\nal. (1999). In that case, Sq [ρ] can be regarded as a generalized\nentropy trying to take into account non-ergodicity and lack of\ncomplete mixing in collisionless systems with long-range interactions. In that point of view, the parameter q measures the\nefficiency of mixing (q = 1 if the system mixes well which is\nimplicitly assumed in Lynden-Bell's statistical theory). In the\ntwo-levels approximation f ∈ {0, 1} and in the dilute limit\nf ≪ 1, Sq [ρ] can be expressed as a Rfunctional of the coarsegrained distribution function f ≡ ρηdη = ρ of the form\nR q\n1\nSq [f ] = − q−1\n(f − f )dθdv. In this particular limit, Sq [f ]\ncan be interpreted\nas a thermodynamical entropy generalizR\ning S[f ] = − f ln f dθdv which is a particular case of the\nLynden-Bell entropy for two levels in the dilute limit (see Chavanis 2004c). In conclusion, Tsallis functional Sq [ρ] expressed\nin terms of ρ(θ, v, η) is an entropy but Tsallis functional Sq [f ]\n\nnonlinearly dynamically stable stationary solutions of the\nVlasov equation called stellar polytropes. The fact that\nthe criteria (106) and (107) of nonlinear dynamical stability are similar to criteria of generalized thermodynamical\nstability is the mark of a thermodynamical analogy (Chavanis 2003c, Chavanis & Sire 2004b).\nStellar polytropes are described by the distribution\nfunction\n\u0015 1\n\u0014\n(q − 1)β q−1\n,\nǫ\nf = μ−\nq\n\n(143)\n\nobtained from Eq. (108). When the term in brackets is\nnegative, the distribution function is set equal to f = 0.\nThe index n of the polytrope in one dimension is related to\nthe parameter q by the relation (Chavanis & Sire 2004a)\nn=\n\n1\n1\n+\n.\n2 q−1\n\n(144)\n\nFor n → +∞ (or q → 1), we recover the isothermal distribution function (123) and the H-function (122). Therefore, Tsallis functional connects continuously isothermal\nand polytropic distributions. Physical polytropic distribution functions (see Chavanis & Sire 2004a) have β > 0\nand q ≥ 1 (i.e. n ≥ 1/2) or 1/3 < q ≤ 1 (i.e. n < −1).\nThe barotropic gas corresponding to the polytropic\ndistribution function (143) is the polytropic gas\np = Kργ ,\n\nγ =1+\n\n1\n,\nn\n\n(145)\n\nexpressed in terms of f (θ, v) is either a H-function (dynamics)\nor the reduced form of entropy Sq [ρ] (thermodynamics) for\ntwo levels in the dilute limit. In any case, it is not clear why\nnon-ergodic effects could be encapsulated in the simple functional Sq [ρ] introduced by Tsallis. Tsallis entropy is \"natural\"\nbecause it has mathematical properties very close to those possessed by the Boltzmann entropy and it is probably relevant to\ndescribe a certain type of mixing and non-ergodic behaviour\nas in the case of porous media and weak chaos (it may be seen\nas an entropy on a fractal space-time). However, many other\ntypes ofRnon-ergodic behaviour can occur and other functionals\nS = − C(ρ)dθdvdη could be relevant. Observation of stellar systems, 2D vortices and quasi-equilibrium states of the\nHMF model resulting from incomplete violent relaxation do\nnot favour Tsallis distributions in a universal manner. Other\ndistributions can emerge. In fact, we must give up the hope to\npredict the metaequilibrium state in case of incomplete relaxation. We must rather try to construct stable stationary solutions of the Vlasov equation in order to reproduce observed\nphenomena. The H-functions (105) can be useful in that context. An alternative procedure is to keep the Lynden-Bell form\nof entropy unchanged and develop a dynamical theory of violent relaxation (Chavanis et al. 1996, Chavanis 1998) in order\nto take into account incomplete mixing through a variable diffusion coefficient related to the strength of the fluctuations. In\nthat case, non-ergodicity is explained by the decay of the fluctuations of Φ driving the relaxation, not by a complex structure\nof phase-space. Generalized entropies are not necessary in that\ncase.\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n8\n\nwith the polytropic constant\n\u001a\n\u001b\n√ Γ (1/2)Γ (n + 1/2) −1/n\n1\n1\n, n>\n(146)\n2A\nK=\nn+1\nΓ (n + 1)\n2\n√ Γ (1/2)Γ (−n)\n1\n2A\nn+1\nΓ (1/2 − n)\n\n\u001b−1/n\n\n, n < −1 (147)\n\nwhere A = (|q − 1|β/q)1/(q−1) . In the present context,\nthe polytropic constant K is related to the Lagrange multiplier β. Therefore, K and T0 = β −1 play the role of\neffective temperatures (see Chavanis & Sire 2004b for a\nmore detailed discussion). For a polytropic distribution,\nthe functional (114) takes the form\nZ\nZ\nK\n1\nρΦdθ +\n(ργ − ρ)dθ,\n(148)\nF [ρ] =\n2\nγ−1\nand the relation between the density and the potential is\n\u0015 1\n\u0014\nγ − 1 γ−1\n.\n(149)\nΦ\nρ= λ−\nKγ\nComparing Eqs. (143) and (149), we note that a polytropic\ndistribution with index q in phase space yields a polytropic\ndistribution with index γ = 1 + 2(q − 1)/(q + 1) in physical\nspace. In this sense, polytropic laws are stable laws since\nthey keep the same structure as we pass from phase space\nf = f (ǫ) to physical space ρ = ρ(Φ) as noticed in Chavanis (2004d). This is probably the only distribution enjoying this property. Similarly, comparing (142)-(7) and (148)\nthe \"free energy\" in phase space F [f ] = E[f ] − T0 Sq [f ]\n(where T0 = 1/β) becomes F [ρ] = E[ρ] − KSγ [ρ] in physical space. Morphologically, the polytropic temperature K\nplays the same role in physical space as the temperature\nT0 = 1/β in phase space.\nWe can express the distribution function in terms of\nthe density according to\n\u0014\n\u0015n−1/2\n1\nv 2 /2\nf=\nρ(θ)1/n −\n,\n(150)\nZ\n(n + 1)K\nwith\nZ=\n\n√ Γ (1/2)Γ (n + 1/2)\n[K(n + 1)]1/2 ,\n2\nΓ (n + 1)\n\nZ=\n\n√ Γ (1/2)Γ (−n)\n2\n[−K(n + 1)]1/2 ,\nΓ (1/2 − n)\n\nn>\n\n1\n(151)\n2\n\nn < −1. (152)\n\nIntroducing the kinetic temperature (velocity dispersion)\nT (θ) = hv 2 i = p(θ)/ρ(θ) = Kρ(θ)1/n , this can be rewritten\n\u0014\n\u0015n−1/2\nv 2 /2\nρ(θ)\n1−\n, (153)\nf = Bn p\n(n + 1)T (θ)\n2πT (θ)\n\nwith\n\nBn =\n\nΓ (n + 1)\n,\nΓ (n + 1/2)(n + 1)1/2\n\nn>\n\n1\n2\n\n(154)\n\n6\n\nη=kM/4πT\n\nK=−\n\n\u001a\n\n19\n\nB=0\n(unstable)\nB>0\n(stable)\n\n4\n\nγ=3\nγ=2\n\n2\n\nγ=1\n\n0\n\n−2\n\n0\n\nB=0\n(stable)\n\nγ=0.5\n\n2\n2\nε=8πE/kM\n\n4\n\nFig. 12. Bifurcation diagram of stellar polytropes that are\nstationary solutions of the Vlasov equation. The homogeneous\nphase is nonlinearly dynamically stable for ǫ ≥ ǫcrit = 1/γ\n1\nwhere γ = 1 + 1/n and n = 12 + q−1\n. It becomes linearly dynamically unstable for ǫ < ǫcrit where the branch of clustered\nstates (represented schematically by a line) appears. Isothermal stellar systems correspond to (q = 1, n = ∞, γ = 1). In\nordinate, T is defined by K(M/2π)1/n . In the homogeneous\nphase, it represents the kinetic temperature of a polytropic\nstellar system. Note that η is a monotonic function of the Lagrange multiplier β so that the curve can be viewed as a series\nof equilibria of polytropic distributions.\n\nBn =\n\nΓ (1/2 − n)\n,\nΓ (−n)[−(n + 1)]1/2\n\nn < −1.\n\n(155)\n\nEquation (153) is the counterpart of Eq. (126) for isothermal systems. p\nFor n > 1/2, the distribution f = 0 for\n|v| > vmax = 2(n + 1)T .\nAccording to what has been said in Sec. 4.4 about the\ncorrespondance between stellar systems and barotropic\nstars, we conclude that the uniform phase of a polytropic\nstellar system (143) with index n is formally nonlinearly\ndynamically stable with respect to the Vlasov equation if\nK ≥ Kn or T ≥ Tn and linearly dynamically unstable\notherwise. It can be useful to introduce the dimensionless\nparameter η = kM/4πT where T = Kρ1/n is the kinetic\ntemperature in the homogeneous phase where ρ = M/2π.\nFor n → +∞ (isothermal case), we recover the dimensionless parameter η = kM/4πT of Sec. 4.7.1. On the other\nhand, in the homogeneous\nphase (B = 0), the energy (7) is\nR\ngiven by E = 21 pdθ = 21 M T . Therefore, the normalized\nenergy ǫ = 8πE/kM 2 is expressed in term of η according\nto ǫ = η1 . In terms of these dimensionless parameters, the\nuniform phase is formally nonlinearly dynamically stable\nfor\nη ≤ ηcrit = γ,\n\nǫ ≥ ǫcrit =\n\n1\n,\nγ\n\n(156)\n\nand linearly dynamically unstable otherwise. Note how the\ncritical energy and temperature are simply expressed in\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n1\n\nn=1\n0.5\n\n2\n\nterms of the polytropic index γ. For n → +∞, we recover\nthe case of isothermal stellar systems with ǫcrit = 1 and\nηcrit = 1. Note that the line (ǫcrit , ηcrit ) coincides with the\nline B = 0 in Fig. 7. We thus clearly see how the series of\nequilibria for polytropic distributions places itself in the\n(ǫ, η) plane (we just have to displace the critical point\n(ǫcrit , ηcrit ) along the line B = 0 as sketched in Fig. 12).\nWe also emphasize that, using the criterion (115) we\nhave obtained the condition of nonlinear dynamical instability (156) for stellar polytropes with almost no calculation. Of course, the same result can be obtained from the\ncriterion (116) by explicitly performing the integral. The\ncriterion of nonlinear dynamical stability (115) that we\nhave found is simpler, albeit equivalent. Moreover, it has\na more physical interpretation since it is expressed as a\ncondition on the velocity of sound in a gas with the same\ndensity distribution as the original kinetic system.\nFor the polytropic distribution (153) with uniform density, the dielectric function can be written\n√\nTn\n(157)\nWn (ω/ T ),\nǫ(1, ω) = 1 −\nT\nwhere we have introduced the function\n2\nZ\n/2 n−3/2\n]\nx[1 − xn+1\n1 Bn\nWn (z) = √\n(n − 1/2)\ndx (158)\nx−z\n2π n\n\n2πλ /kM\n\n20\n\nn=100\nStellar\nsystems\n\n0\n\nFluid systems\n−0.5\nn=1/2\n−1\n\n0\n\n0.5\n\n1\n\n1.5\nT/Tc\n\n2\n\n2.5\n\n3\n\nFig. 13. Growth rate and decay rate for stellar polytropes\nand polytropic stars in the framework of the HMF model. The\nindex goes from n = 1 to n = 100. We have also shown the case\nn = 1/2 (water-bag distribution). The critical temperature is\nsmaller than for an isothermal gas (Tn < Tc ).\n1\nn=−100\nn=−1.5\n\n2\n\n2πλ /kM\n\nwith Wn (0) = 1. The range of integration is such that\n0.5\nthe term in brackets remains positive. For n → +∞, we\nrecover the W -function (129). For ω = 0, we obtain the\nStellar\nsystems\ncritical temperature T = Tn as in a polytropic gas. As in\n0\nSec. 4.7.1, we look for solutions of the dispersion relation\nǫ(1, ω) = 0 in the form ω = iλ where λ is real. For T < Tn ,\nthe system is unstable and the growth rate λ > 0 is given\nFluid systems\nby\n−0.5\n\u0012\n\u0013\nλ\nTn\n,\n(159)\n= Gn √\nT\n2T\n−1\nwhere\n0\n2\n4\n6\n8\n10\n3\n\u001b\n\u001a\n\u0012\n\u0013Z\n\u0015\n\u0014\n−1\nn−\nT/T\n2\n1\nt2\nt2\nBn\n√ n−\ndt\n.\nGn (x) =\n1−\nn π\n2\nt2 + x2\nn+1\nFig. 14. Growth rate and decay rate for stellar polytropes and\nFor T > Tn , the system is stable and the damping rate polytropic stars in the framework of the HMF model. The index goes from n = −1.5 to n = −100. The critical temperature\nγ = −λ > 0 is given by\nis larger than for an isothermal gas (Tn > Tc ).\n\u0013\n\u0012\nTn\nγ\n,\n(160)\n= Fn √\nT\n2T\n4.7.3 Fermi or water-bag distribution\nwhere\n1\nFn (x) =\n(161) For n = 1/2, the distribution function (143) is a step\nGn (x)−1 + Rn (x)\nfunction: f (ǫ) = η0 if −v0 (θ) ≤ v ≤ v0 (θ) and f (ǫ) = 0\nwith\notherwise. This is similar to the Fermi distribution at\n\u0012\n\u0013 \u0014\n\u0015n− 23\n√\nT = 0 describing cold white dwarf stars in astrophysics\n2\n2 πBn\n1\nx\nRn (x) =\n. (162) (Chandrasekhar 1939). This is also called the water-bag\nn−\nx 1+\nn\n2\nn+1\ndistribution in plasma physics (when v0 is independent on\nThis additional term comes from the residue theorem when θ). The density and the pressure are given by ρ = 2η0 v0\nthe pulsation ω = −iγ lies in the lower half of the complex and p = (2/3)η0 v03 . This leads to a polytropic equation\nplane. For n → +∞, we recover the G and F functions of state p = Kρ3 of index n = 1/2 and polytropic con(132) and (138). The dependence of the growth rate and stant K = 1/(12η02 ). For a homogeneous system, we have\ndecay rate with the temperature is shown in Figs. 13 and the relation M = 4πη0 v0 . Then, combining the preceding\n14. For n = ∞, we recover the isothermal case of Fig. 11. relations, we find that the velocity of sound is cs = v0 .\nc\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nTherefore, the system is formally nonlinearly dynamically\nstable if\nv02 ≤\n\nkM\n,\n4π\n\n(163)\n\nand linearly dynamically unstable otherwise. Noting that\nthe kinetic temperature is T = v02 /3, we check that the\nabove result returns (98) with γ = 3. Thus, ηcrit = 3 and\nǫcrit = 1/3. Once again, these results have been obtained\nwith almost no calculation. This is an advantage of formula (115) with respect to formula (116).\nOn the other hand, using f ′ (v) = η0 [δ(v + v0 ) − δ(v −\nv0 )], the dielectric function (117) can be written\nǫ(1, ω) = 1 −\n\n√\nT1/2\nW1/2 (ω/ T ),\nT\n\n(164)\n\nwith\nW1/2 (z) =\n\n1\n.\n1 − 31 z 2\n\n(165)\n\nWe look for solutions of the dispersion relation ǫ(1, ω) = 0\nin the form ω = Ω where Ω is real. This solution only\nexists for T > T1/2 and corresponds to an oscillatory solution δf ∼ eiΩt . The pulsation is given by\n√\nΩ = ± 3(T − T1/2 )1/2 = ±\n\nr\n\nv02 −\n\nkM\n.\n4π\n\n(166)\n\nWe now consider the case ω = iλ where λ is real. This\nsolution only exists for T < T1/2 and\n√\nλ = ± 3(T1/2 − T )1/2 = ±\n\nr\n\nkM\n− v02 .\n4π\n\n(167)\n\nThe case λ > 0 corresponds to a growing (unstable) mode\nδf ∼ eλt and the case λ = −γ < 0 corresponds to a\ndamped mode δf ∼ e−γt . We note that for this special\ncase n = 1/2, the growth rate and the pulsation period of\nthe stellar system are the same as for the corresponding\nbarotropic gas, see Eq. (87). The results (166) and (167)\nhave been previously derived by Choi & Choi (2003). They\nare recalled here for sake of completeness and because we\nwill need them in Sec. 5.3.\n\n5 Collisional relaxation of stellar systems\n\n21\n\n5.1 The evolution of the whole system: the Landau\nequation\nThere are different methods to obtain a kinetic equation\nfor the distribution function f (θ, v, t). One possibility is\nto start from the N-body Liouville equation and use projection operator technics. This method has been followed\nby Kandrup (1981) for stellar systems and by Chavanis\n(2001) for the point vortex gas. We shall first consider an\napplication of this theory to the HMF model (Chavanis\n2003b). In the large N limit and neglecting collective effects, the projection operator formalism leads to a kinetic\nequation of the form\nZ t Z\n∂f\n∂f\n∂f\n∂\n+v\n+ hF i\n=\ndτ dθ1 dv1 F (1 → 0, t)\n∂t\n∂θ\n∂v\n∂v 0\n\u001b\n\u001a\n∂\n∂\n+ F (0 → 1, t − τ )\n× F (1 → 0, t − τ )\n∂v\n∂v1\n×f (θ1 , v1 , t − τ )f (θ, v, t − τ ). (168)\nHere, f (θ, v, t) = N P1 (θ, v, t) is the distribution function, hF i(θ, t) is the (smooth) mean-field force and F (1 →\n0, t) = F (1 → 0, t) − hF i(θ, t) is the fluctuating force created by particle 1 (located at θ1 , v1 ) on particle 0 (located at θ, v) at time t. Between t and t − τ , the particles are assumed to follow the trajectories determined by\nthe slowly evolving mean-field hF i(θ, t). Equation (168)\nis a non-Markovian integrodifferential equation. We insist\non the fact that this equation is valid for an inhomogeneous system while the kinetic equations presented below\nwill only apply to homogeneous systems. Unfortunately,\nEq. (168) remains too complicated for practical purposes\nand we will have to make simplifications. If we consider\na spatialy homogeneous system for which the distribution\nfunction f = f (v, t) depends only on the velocity, and if\nwe implement a Markovian approximation, the foregoing\nequation reduces to\nZ +∞ Z\n∂\n∂f\n=\ndτ dθ1 dv1 F (1 → 0, t)\n∂t\n∂v 0\n\u0013\n\u0012\n∂\n∂\nf (v1 , t)f (v, t), (169)\n−\n×F (1 → 0, t − τ )\n∂v ∂v1\nk\nwhere F (1 → 0, t) = − 2π\nsin(θ(t) − θ1 (t)). We thus need\nto calculate the memory function\nZ +∞ Z\nM=\ndτ dθ1 F (1 → 0, t)F (1 → 0, t − τ )\n\nk2\n= 2\n4π\n\nZ\n\n0\n+∞\n\n0\n\ndτ\n\nZ\n\ndθ1 sin(θ − θ1 ) sin[θ(t − τ ) − θ1 (t − τ )],\n\n(170)\nThe Vlasov equation (104) can be obtained from the BBGKY where θ (t − τ ) is the position at time t − τ of the i-th\ni\nhierarchy, issued from the Liouville equation (2), by us- particle located at θi = θi (t) at time t. Since the system is\ning the mean-field approximation (4) which is valid in the homogeneous, the mean force acting on a particle vanishes\nlimit N → +∞ with η and ǫ fixed. We would like now to and the average equations of motion are θ(t − τ ) = θ − vτ\ntake into account the effect of correlations between parti- and θ1 (t − τ ) = θ1 − v1 τ . Thus, we get\ncles in order to describe the \"collisional\" relaxation. We\nZ +∞ Z 2π\nshall develop a kinetic theory which takes into account\nk2\ndτ\ndφ sin φ sin(φ − uτ ), (171)\nM=\nterms of order 1/N in the correlation function.\n4π 2 0\n0\n\n\f22\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nwhere φ = θ − θ1 and u = v − v1 . The integration yields\nZ\nk 2 +∞\nk2\nM=\nδ(u).\n(172)\ndτ cos(uτ ) =\n4π 0\n4\nTherefore, the kinetic equation (169) becomes\n\u0013\n\u0012\nZ\nk2 ∂\n∂f1\n∂f\n∂f\n= 0. (173)\n=\n−f\ndv1 δ(v − v1 ) f1\n∂t\n4 ∂v\n∂v\n∂v1\nThis equation can be considered as the counterpart of the\nLandau equation describing the \"collisional\" evolution of\nstellar systems such as globular clusters (in that case, the\nsystem is not homogeneous but the collision term is often\ncalculated by making a local approximation). The Landau collision term can also be obtained from the BBGKY\nhierarchy at the order O(1/N ) by neglecting the cumulant of the three-body distribution function of order 1/N 2\n(see Chavanis 2004b). For the HMF model, and for one\ndimensional systems in general, we find that the Landau\ncollision term vanishes. This is because the diffusion term\n(first term in the r.h.s.) is equally balanced by the friction\nterm (second term in the r.h.s.). A similar cancellation\nof the collision term at order 1/N is found in the case of\n2D point vortices when the profile of angular velocity is\nmonotonic (Dubin & O'Neil 1988, Chavanis 2001, Dubin\n2003). Therefore, after a phase of violent relaxation, the\nsystem can remain frozen in a stationary solution of the\nVlasov equation for a very long time, larger than N tD .\nOnly non-trivial three-body correlations can induce further evolution of the system. However, their effect is difficult to estimate. Note that the collision term of order 1/N\nmay not cancel out in the case of inhomogeneous systems\nand for the multi-species HMF model (see Sec. 7).\n5.2 The evolution of a test particle in a thermal bath:\nthe Fokker-Planck equation\nEquations (168) and (169) can also be used to describe\nthe evolution of the distribution function P (v, t) of a test\nparticle evolving in a bath of field particles with static\ndistribution function f1 (v1 ). In that case, we have to consider that the distribution function of the bath is given,\ni.e. f1 = f0 (v1 ). The evolution of P (v, t) is then governed\nby the equation\nZ +∞ Z\n∂\n∂P\n=\ndτ dθ1 dv1 F (1 → 0, t)\n∂t\n∂v 0\n\u0012\n\u0013\n∂\n∂\n×F (1 → 0, t − τ )\nf0 (v1 )P (v, t). (174)\n−\n∂v\n∂v1\nEquation (174) can be written in the form of a FokkerPlanck equation\n\u0012\n\u0013\n∂P\n∂\n∂P\nD\n=\n+ Pη .\n(175)\n∂t\n∂v\n∂v\nThe two terms of this equation correspond to a diffusion\nand a friction. The diffusion coefficient is given by the\n\nKubo formula\nD=\n\nZ\n\n0\n\n+∞\n\ndτ hF (t)F (t − τ )idτ.\n\n(176)\n\nThe friction can be understood physically by developing\na linear response theory. It arises from the response of\nthe field particles to the perturbation induced by the test\nparticle, as in a polarization process (see Kandrup 1983).\nIntroducing the memory function (172), the FokkerPlanck equation (174) can be rewritten\n\u0013\n\u0012\nZ\nk2 ∂\n∂\n∂\n∂P\nf0 (v1 )P (v, t).\n=\n−\ndv1 δ(v − v1 )\n∂t\n4 ∂v\n∂v\n∂v1\n(177)\nIt can be put in the form (175) where the coefficients\nof diffusion and friction are explicitly given by (Chavanis\n2003b):\nZ\nk2\nk2\nf0 (v),\n(178)\ndv1 δ(v − v1 )f0 (v1 ) =\nD=\n4\n4\nη=−\n\nk2\n4\n\nZ\n\ndv1 δ(v − v1 )\n\nk2\ndf0\n(v1 ) = − f0′ (v). (179)\ndv\n4\n\nMore precisely, comparing Eq. (175) with the general FokkerPlanck equation\n\u0013\n\u0012\n\u0013\n\u0012\n∂\nh∆vi\nh(∆v)2 i\n1 ∂2\n∂P\n−\nP\n. (180)\nP\n=\n∂t\n2 ∂v 2\n∆t\n∂v\n∆t\nwe find that\nh(∆v)2 i\n= 2D,\n∆t\n\nh∆vi\ndD\n=\n− η.\n∆t\ndv\n\n(181)\n\nUsing Eqs. (178) and (179), we obtain\nη=−\n\n1 h∆vi\n.\n2 ∆t\n\n(182)\n\nTherefore, η represents half the friction force. This is the\nsame result as in the case of Coulombian or Newtonian\ninteractions (see, e.g., Chavanis 2004a). Using Eqs. (178)\nand (179), the Fokker-Planck equation (175) can be rewritten\n\u0014 \u0012\n\u0013\u0015\n∂P\n∂\nd ln f0\n∂P\nD\n,\n(183)\n=\n−P\n∂t\n∂v\n∂v\ndv\nwith the initial condition P (v, t = 0) = δ(v − v0 ). It\ndescribes the evolution of a test particle in a potential\nU (v) = − ln f0 (v) created by the field particles. A similar\nequation is found for 2D point vortices in position space\nwhere the friction is replaced by a drift (Chavanis 2001).\nWhen f0 (v) is the Maxwellian (18), corresponding to a statistical equilibrium state (thermal bath approximation),\nEq. (183) takes the form of the Kramers equation\n\u0014\n\u0012\n\u0013\u0015\n∂P\n∂P\n∂\nD(v)\n=\n+ βP v ,\n(184)\n∂t\n∂v\n∂v\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n10\n\nas in the theory of Brownian motion (Risken 1989). We\nnote in particular that the friction coefficient is given by\nthe Einstein formula ξ = Dβ. However, in the present\ncontext, the diffusion coefficient depends on the velocity\nand, in the ballistic approach that we have considered, is\ngiven by\nρk 2\n4\n\n\u0012\n\nβ\n2π\n\n\u00131/2\n\ne−β\n\nv2\n2\n\n.\n\n(185)\n\nWe note that P (v, t) always converges to the distribution\nfunction of the bath N P (v, t) → f0 (v) for t → +∞ while\nfor 3D self-gravitating system, this is the case only when\nf0 is the statistical equilibrium distribution.\nFinally, again neglecting collective effects, a simple calculation shows that the temporal correlations of the force\nare\nZ\nk 2 +∞\ncos[(v − v1 )t]f0 (v1 )dv1\nhF (0)F (t)i =\n4π −∞\n=\n\nk2\ncos(vt)fˆ0 (t) = 2 cos(vt)D̂(t), (186)\n2\n\nη=1\n8\nη=0.6\n6\nD(v)/D0\n\nD(v) =\n\n23\n\n4\nη=0.4\nη=0.2\n\n2\n\nη=0\n0\n\n0\n\n0.5\n\n1\n1/2\nβ v\n\n1.5\n\n2\n\nFig. 15. Dependence of the diffusion coefficient D(v) on\nthe velocity v for different values of the inverse temperature\n2\nη = β/βc . The normalization constant is D0 = nk4 (β/2π)1/2\ncorresponding to D(0) for η = 0. We note that D(0) increases\nas η increases and that it diverges at the critical point η = 1.\n\nwhere D̂(t) is the Fourier transform of D(v). For the Maxwellian\ndistribution, we get\nf0 (v1 ), we obtain Eq. (183) where the expression of the\ndiffusion coefficient is now given by\nt2\nρk 2\n− 2β\n,\n(187)\nhF (0)F (t)i =\ncos(vt)e\nk 2 f0 (v)\n4π\n.\n(189)\nD=\n4 |ǫ(1, v)|2\nwhich seems to indicate a gaussian decay of the correlations.\n\n5.3 Collective effects: the Lenard-Balescu equation\nThe kinetic theory developed previously (Chavanis 2003b),\nwhile useful as a first step, is however inaccurate because\nit is based on a ballistic approximation and ignores collective effects which are non-negligible for the HMF model\nclose to the critical temperature (Bouchet 2004). In the\ncase of 3D stellar systems, collective effects have only a\nweak influence on the kinetic theory and they are often\nneglected. This implicitly assumes that the size of the system is smaller than the Jeans length (recall that the Jeans\nlength plays the role of the critical temperature in the\npresent context). In general, collective effects can be taken\ninto account by developing a kinetic theory as in the case\nof plasmas (Ichimaru 1973). Noting that the HMF model\nis the one Fourier mode of a one dimensional plasma, Inagaki (1996) proposed to describe the collisional evolution\nof the system by the corresponding form of the LenardBalescu equation. It can be written\n\u0012\n\u0013\nZ\n∂f\nk2 ∂\n∂f1\nδ(v − v1 )\n∂f\nf1\n= 0, (188)\n=\n−f\ndv1\n∂t\n4 ∂v\n|ǫ(1, v)|2\n∂v\n∂v1\nwhere ǫ(1, v) is the dielectric function (117). We note that\nthe collision term again cancels out. However, if we use\nthis equation to describe the evolution of a test particle in\na thermal bath, as we did in Sec. 5.2 by replacing f1 by\n\nIt differs from the preceding expression (178) due to the\noccurence of the term |ǫ(1, v)|2 in the denominator which\ntakes into account collective effects. For the Maxwellian\ndistribution, the dielectric function is given by Eqs. (128)\nand (130). This leads to the expression of the diffusion\ncoefficient\n2\n\nD(v) =\n\n[1 −\n\nρk2 β 1/2 −β v2\ne\n4 ( 2π )\n√\n2\nηA( βv))] + π2 η 2 βv 2 e−βv2\n\n(190)\n\nu2\nx2 R x\nwith A(x) = 1 − xe− 2 0 e 2 du. We note that A(x) =\n1 − x2 + ... for x → 0 and A(x) ∼ −1/x2 for x → +∞.\nTherefore, the diffusion coefficient behaves as Eq. (185) for\n2\nv → +∞ and tends to ρk4 (β/2π)1/2 /(1 − η)2 for v → 0\nand η < 1. At the critical temperature η = 1 it diverges\n2\n1/2\nas D(v) ∼ ρk\n/(βv 2 ) for v → 0. Its behaviour is\n2π (β/2π)\nrepresented in Fig. 15.\nThe expression (190) of the diffusion coefficient was\nobtained by Bouchet (2004) in a different manner, by analyzing the stochastic process of equilibrium fluctuations.\nThis approach was then generalized to an arbitrary distribution function by Bouchet & Dauxois (2004), leading\nto equation (189). In fact, formulae (189) and (190) correspond to the one dimensional version of the diffusion coefficient computed in plasma physics (Ichimaru 1973) when\nthe potential of interaction is truncated to one Fourier\nmode. The general expression of the diffusion coefficient\nand of the Fokker-Planck equation is given in Chavanis\n\n\f24\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n10\n\nexpression of the diffusion coefficient can be written\nη=2\n\nn=1\n\nD(v) =\n\nη=1.3\n\n8\n\nη=1.2\nD(v)/D0\n\n6\n\nη=1\n\n4\n\nη=0.6\n\n2\n\nη=0\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n1/2\n\nv/T\n\nFig. 16. Same as Fig. 15 for a polytropic distribution with\nindex n = 1. Here η = kM/4πT where T is the kinetic temperature. In this case, the critical point is η1 = 2. The diffusion\n√\ncoefficient vanishes at the maximum velocity vmax = 4T .\n\n8\nη=1/2\n\nD(v)/D0\n\n6\n\nn=−2\n\nη=0.3\n\n[1 + k2 P\n\nk2\n4 f0 (v)\nR +∞ f0′ (w)\ndw]2\n−∞ w−v\n\n+\n\nk2 π 2 ′\n2\n4 f0 (v)\n\n, (191)\n\nwhere P stands for the principal value. Its asymptotic\nbehaviour for v → +∞ is always given by Eq. (178). As\na complementary example to Fig. 15, we have plotted in\nFigs. 16 and 17 the diffusion coefficient corresponding to a\npolytropic distribution of index n = 1 and n = −2 (in that\ncase f0 is given by Eq. (153) where ρ and T are uniform).\nAnother example is provided by the water-bag model for\nwhich an explicit expression of D(v) can be given. Using\nEqs. (164), (165) and (166), it can be written conveniently\nas\n\u0014 2\n\u00152\nk2\nv0 − v 2\nD(v) =\n,\n(192)\nη0\n4\nΩ 2 − v2\nfor v ≤ v0 and D = 0 otherwise. The diffusion coefficient diverges when the velocity of the particle v is in\nphase with the frequency Ω < v0 of the wave arising from\nthe slightly perturbed distribution of field particles (see\nSec. 4.7.3). This divergence occurs because, for the water bag distribution, there exists purely oscillatory modes\nfor a wide range of temperatures. In general, the diffusion coefficient (189) diverges only at the critical point for\nv = ωr with f ′ (ωr ) = 0; this precisely correspond to the\ncriterion of marginal stability (120). For example, for the\ngaussian distribution, we recover the divergence at T = Tc\nfor v = ωr = 0.\n\n4\nη=0.2\n\n5.4 The auto-correlation function\n\n2\nη=0\n\n0\n\n0\n\n0.5\n\n1\n1/2\nv/T\n\n1.5\n\n2\n\nFig. 17. Same as Fig. 15 for a polytropic distribution with\nindex n = −2. Here η = kM/4πT where T is the kinetic temperature. In this case, the critical point is η−2 = 1/2. This\nfigure is very similar to Fig. 15 except that the diffusion coefficient decreases algebraically.\n\n(2004b) for an arbitrary potential of interaction in D dimensions.\nWe emphasize that the previous results are valid for\nan arbitrary distribution function f0 (v) of the bath provided that it is stable with respect to the Vlasov equation.\nThis is because, as we shall see, the relaxation time of\nthe \"field particles\" (bath) towards statistical equilibrium\n(Maxwellian) is longer than the relaxation time of a \"test\nparticle\" towards f0 , so that the distribution function f0\nof the bath can be considered as \"frozen\". The general\n\nWe note that for high temperatures (i.e., η → 0), Eq.\n(190) reduces to the expression (185) found in the ballistic approach developed in Sec. 5.2. This is because, in that\nlimit, collective effects are weak with respect to the pure\nballistic motion and ǫ ≃ 1 according to Eq. (128). However, the behaviour of the correlation function is different.\nIndeed, a direct analysis (Chavanis 2004b) shows that the\ntemporal auto-correlation function of the force is given by\nZ\nk 2 +∞ cos[(v − v1 )t]\nf0 (v1 )dv1\nhF (0)F (t)i =\n4π −∞\n|ǫ(1, v1 )|2\n\n= 2 cos(vt)D̂(t). (193)\n\nSubstituting this expression in the Kubo formula (176)\nR +∞\nand using δ(v − v1 ) = π1 0 cos[(v − v1 )t]dt, we recover\nEq. (189). In the ballistic approximation, the correlation\nfunction (187) is gaussian while the exact treatment taking into account collective effects shows that the decay\nof the fluctuations is in fact exponential with a decay\nexponent γ(β) = (2/β)1/2 F −1 (η) where F (x) = 1/(1 +\n√\n2\nπxex erfc(−x)) is the F -function (138). This result was\nobtained by Bouchet (2004) by working out the integrodifferential equation satisfied by the auto-correlation function. We shall present here an alternative derivation (Chavanis 2004b) which will make a clear link with the decay\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nexponent appearing in the linear stability analysis of the\nVlasov equation in Sec. 4.7.1. Noting that the correlation\nfunction is proportional to the Fourier transform of the\ndiffusion coefficient, according to Eq. (193), we can obtain the expression of γ by determining the pole of D(v)\nin Eq. (189). Setting v = iλ where λ is real, we find after\nsome calculations that\n|ǫ|2 (1, iλ) = ǫ(1, iλ)ǫ(1, −iλ)\n\n(194)\n\nwhere we recall that ǫ(1, iλ) is given by Eq. (131). Clearly,\n|ǫ|2 (1, iλ) is an even function of λ. We need to determine\nthe values of λ for which this function vanishes. Since\nη < 1, we find that λ = ±γ where γ > 0 is determined by\nǫ(1, −iγ) = 0. Therefore, γ is the damping rate of the stable perturbed solutions of the Vlasov equation; it is given\nby Eq. (137). Next, we consider λ = ±γ + ǫ. Expanding\nEq. (194) for ǫ ≪ 1, we find after elementary calculations\nthat\nK(γ)\n,\nD(v) ∼ 2\nv + γ2\n\n2T\n1\nK(γ) = √\n′\n√\nπ |F ( γ2T )|\n\nwith\nγ = (2/β)1/2 F −1 (η).\n\n5.5 The relaxation timescale\nLet us consider the relaxation of a test particle in a thermal bath. Due to the rapid decrease of D(v) for large v, the\nspectrum of the Fokker-Planck equation (184) has no gap,\nand it exists no exponential relaxation time (see Bouchet\n& Dauxois 2004 for a detailed discussion). A time scale\nwill however describe relative relaxation speeds for different values of the temperature T . We shall obtain an estimate of this time scale. Ignoring collective effects in a first\nstep, this process is described by Eqs. (184)-(185). If the\ndiffusion coefficient were constant, we would deduce that\nthe dispersion of the particles increases as h(∆v)2 i = 2Dt.\nIntroducing the r.m.s velocity vm = hv 2 i1/2 , we define the\n2\nrelaxation timescale tr such that h(∆v)2 i = vm\n. This leads\n2\nto tr = vm /2D. Since D depends on v, the description of\nthe diffusion process is more complex. However, the formula\n\n(197)\n\nThe exponential decay of the correlation function corresponds to the Markovian limit of the stochastic process,\nthereby justifying the Markovian approximation in the kinetic theory. This is quite different from the correlations of\nthe gravitational force which decay as t−1 (Chandrasekhar\n1944). This slow decay may throw doubts on the validity\nof the ordinary Landau equation, based on a Markovian\napproximation, used to describe stellar systems (see Kandrup 1981 for a detailed discussion). For the HMF model,\nthe decay exponent\n√ γ(β) depends on the temperature. It\ndiverges like γ ∼ 2T ln T as T → +∞. This is why the\ncorrelation function is gaussian in the treatement neglecting collective effects (see Sec. 5.2). On the other hand,\nγ ∼ (8/kM )1/2 (T −Tc) as T → Tc+ , so that the correlation\nfunction decreases very slowly close to the critical temperature. This may invalidate the Markovian approximation\nclose to the critical point. The Fokker-Planck equation\n(184) with the diffusion coefficient (190) has been recently\ninvestigated by Bouchet & Dauxois (2004). In this paper,\nusing the rapid decay for large v of the diffusion coefficient (190), the numerically observed (Yamaguchi 2003,\nPluchino et al 2004) anomalous algebraic decay of the velocity autocorrelation function is explained and algebraic\nexponents are explicitely computed. For a large class of\nbath distribution function f0 , this may also lead to anomalous diffusion of angles θ.\n\n2\nvm\n,\n2D(vm )\n\ntr =\n\n(195)\n\nfor v → ±iγ. Therefore, for t → +∞, the correlation\nfunction (193) is the Fourier transform of a Lorentzian so\nit decays like\n√\n1\nk 2 M 2T\ncos(vt)e−γt , (196)\nhF (0)F (t)i ∼\n2\n′\n8π\nγ |F ( √γ2T )|\n\n25\n\n(198)\n\nprovides a useful estimate of the speed of relaxation.\nFor\n√\nthe Maxwellian distribution for which vm = 1/ β, we get\n3\nvm\n.\n0.121ρk 2\n\ntr =\n\n(199)\n\nWe can also estimate the relaxation timescale by t′r =\n1/ξ, where ξ is the friction coefficient. Using the Einstein\n′\nrelation\n√ ξ = Dβ, this yields tr = 2tr . Finally, setting w =\nv/( 2vm ), we can rewrite Eq. (184) in the dimensionless\nform\n\u0013\u0015\n\u0014\n\u0012\n∂P\n∂P\n1 ∂\n=\n+ 2P w ,\n(200)\nG(w)\n∂t\ntR ∂w\n∂w\n2\n\nwhere G(w) = e−w and\ntR =\n\n3\nvm\n,\n0.05ρk 2\n\n(201)\n\nwhich provides a useful time renormalization factor in the\nFokker-Planck equation. If we use expression (190) of the\ndiffusion coefficient, we need to multiply the relaxation\ntimescale by |ǫ(1, vm )|2 = (1 + 2.25η)2 + 0.578η 2 . In particular, close to the critical temperature (i.e. η = 1), the\nrelaxation timescale is multiplied by ≃ 11.1.\nIf we now introduce a dynamical timescale through the\nrelation\ntD =\n\n2π\n,\nvm\n\n(202)\n\n4\nwe find that tR /tD ∼ vm\n/N k 2 ∼ 1/N k 2 β 2 ∼ N/η 2 ∼ N\nin the thermodynamic limit of Sec. 2.1. Therefore, the relaxation time of a test particle in a thermal bath increases\nlinearly with the number N of field particles. More precisely, we have\n\ntR =\n\n0.127\nN tD .\nη2\n\n(203)\n\n\f26\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nThe collision term in Eq. (200) is of order 1/N in the\nthermodynamic limit N → +∞ with η fixed. This scaling\nalso holds for the collision term in the Landau equation\n(173) noting that k ∼ 1/N and f ∼ N if we take vm ∼ 1.\nIt represents therefore the first correction to the Vlasov\nlimit in an expansion in 1/N of the correlation function.\nHowever, contrary to the relaxation of a single particle in\na thermal bath, the relaxation time of the whole system\nis not trelax ∼ N tD because, as we have seen, the collision\nterm cancels out at the order 1/N . Therefore, the relaxation time of the whole system is larger than N tD . This\nis consistent with the finding of Yamaguchi et al. (2004)\nwho numerically obtain trelax ∼ N 1.7 tD .\nIt is interesting to compare this result with other systems with long-range interactions. For stellar systems, the\nChandrasekhar relaxation time scales as trelax ∼ lnNN tD .\nIt corresponds to the N tD scaling polluted by logarithmic\ncorrections. This is the relaxation time of a test star immersed in a bath of field stars as well as the relaxation time\nof the whole cluster itself (in the absence of gravothermal\ncatastrophe). For the point vortex gas, the collision term\nin the kinetic equation cancels out at the order 1/N when\nthe profile of angular velocity is monotonic. Therefore, the\nrelaxation time of the whole system is larger than N tD . In\nfact, it is not clear whether the point vortex gas ever relaxes towards statistical equilibrium (Chavanis 2002a, Dubin 2003). By contrast, the relaxation time of a test vortex\nin a thermal bath of field vortices scales as trelax ∼ lnNN tD\n(Chavanis 2002a).\n\n6 Self-attracting Brownian particles: the\nBMF model\nThe Hamilton equations (1) describe an isolated system\nof particles with long-range interactions. Since energy is\nconserved, the fundamental statistical description of the\nsystem is based on the microcanonical ensemble. It can be\nof interest to consider in parallel the case where the system\nis stochastically forced by an external medium. We thus\nintroduce a system of Brownian particles with long-range\ninteractions which is the canonical version of the Hamiltonian system (1). This could be called the BMF (Brownian\nMean Field) model. Likewise in the case of 3D Newtonian interactions, a system of self-gravitating Brownian\nparticles has been recently introduced and studied (see\nChavanis et al. 2002 and subsequent papers).\n\n6.1 Non-local Kramers and Smoluchowski equations\nWe consider a one-dimensional system of self-attracting\nBrownian particles with cosine interaction whose dynamics is governed by the N -coupled stochastic equations\ndθi\n= vi ,\ndt\n√\ndvi\n∂\nU (θ1 , ..., θN ) − ξvi + 2DRi (t), (204)\n=−\ndt\n∂θi\n\nwhere −ξvi is a friction force and Ri (t) is a white noise\nsatisfying\nhRi (t)i = 0,\n\nhRi (t)Rj (t′ )i = δij δ(t − t′ ), (205)\n\nwhere i = 1, ..., N refer to the particles. The P\nparticles interact through the potential U (θ1 , ..., θN ) = i<j u(θi −\nk\nθj ) where u(θi − θj ) = − 2π\ncos(θi − θj ). We define the inverse temperature β = 1/T through the Einstein relation\nξ = Dβ. The stochastic model (204)-(205) is analogous\nto the model of self-gravitating Brownian particles introduced by Chavanis et al. (2002). For this system, the relevant ensemble is the canonical ensemble where the temperature measures the strength of the stochastic force. The\nevolution of the N -body distribution function is governed\nby the N -body Fokker-Planck equation\n\u0013\nN \u0012\n∂PN X\n∂PN\n∂PN\nvi\n=\n+ Fi\n+\n∂t\n∂θi\n∂vi\ni=1\n\u0013\n\u0012\nN\nX\n∂PN\n∂\n(206)\nD\n+ ξPN vi ,\n∂vi\n∂vi\ni=1\n∂U\nwhere Fi = − ∂θ\n. The stationary solution corresponds to\ni\nthe canonical distribution\nPN vi2\n1\n(207)\nPN = e−β( i=1 2 +U(θ1 ,...,θN )) .\nZ\nWe note that the canonical distribution (207) is the only\nstationary solution of the N -body Fokker-Planck equation\nwhile the microcanonical distribution (3) is just a particular stationary solution of the Liouville equation (see Sec.\n2.1). For the system (204)-(205), the equilibrium canonical\ndistribution does not rely, therefore, on a postulate. In the\nthermodynamic limit N → +∞ with η = βkM/4π fixed,\none can prove that the N particules distribution function\nfactorizes and that the mean-field approximation is exact\n(Chavanis et al. 2004b, Chavanis 2004b). The evolution of\nthe one particle distribution function is then governed by\nthe non-local Kramers equation\n\u0012\n\u0013\n∂f\n∂f\n∂f\n∂Φ ∂f\n∂\nD\n+v\n−\n=\n+ ξf v ,\n(208)\n∂t\n∂θ\n∂θ ∂v\n∂v\n∂v\n\nwhich has to be solved in conjunction with Eq. (8). These\nequations have been considered, independently, by Choi\n& Choi (2003).\nTo simplify the problem further, we shall consider a\nstrong friction limit ξ → +∞ or, equivalently, a long time\nlimit t ≫ ξ −1 . In that case, we can neglect the inertia of\nthe particles and the stochastic equations (204) reduce to\np\n∂\ndθi\nU (θ1 , ..., θN ) + 2D∗ Ri (t),\n= −μ\n(209)\ndt\n∂θi\n\nwhere μ = 1/ξ is the mobility and D∗ = D/ξ 2 = T /ξ is\nthe diffusion coefficient in physical space. The evolution\nof the N -body distribution function is governed by the\nN -body Fokker-Planck equation\n\u0014\n\u0015\nN\nX\n∂\n∂PN\n∂\n∂PN\nD∗\n+ μPN\nU (θ1 , ..., θN ) . (210)\n=\n∂t\n∂θi\n∂θi\n∂θi\ni=1\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nThe stationary solution corresponds to the canonical distribution in configuration space\nPN =\n\n1 −βU(θ1 ,...,θN )\ne\n.\nZ\n\n(211)\n\nIn the thermodynamic limit N → +∞ with η = βkM/4π\nfixed, the mean-field approximation is exact and the evolution of the one particle distribution function is governed\nby the non-local Smoluchowski equation\n\u0014 \u0012\n\u0013\u0015\n∂ρ\n∂ρ\n∂ 1\n∂Φ\nT\n,\n(212)\n=\n+ρ\n∂t\n∂θ ξ\n∂θ\n∂θ\nwhere Φ is given by Eq. (8). Alternatively, the Smoluchowski equation (212) can be obtained from the non-local\nKramers equation (208) by using a Chapman-Enskog expansion in power of 1/ξ (Chavanis et al. 2004a). In that\napproximation, the distribution function is close to the\nMaxwellian\nf (θ, v, t) = √\n\nv2\n1\nρ(θ, t)e− 2T + O(ξ −1 ),\n2πT\n\n(213)\n\nand the evolution of the density is governed by the nonlocal Smoluchowski equation. The equations (208) and\n(212) conserve mass and decrease the Boltzmann free energy, i.e. ḞB ≤ 0. This is the canonical version of the\nH-theorem (Chavanis 2003c,2004a).\n6.2 Linear stability\nThe stationary solutions of Eq. (212) are given by Eq.\n(19). They extremize the Boltzmann free energy FB = E−\nT SB with (45) and (46) at fixed mass and temperature.\nFurthermore, only stationary solutions that minimize the\nfree energy are linearly dynamically stable with respect to\nthe non-local Smoluchowski equation (Chavanis 2003c).\nTherefore, thermodynamical and dynamical stability are\nclearly connected: the stable stationary solutions of Eq.\n(212) correspond to the canonical statistical equilibrium\nstates in the mean-field approximation.\nConsidering a small perturbation δρ around a stationary solution of Eq. (212), we get\n\u0014 \u0012\n\u0013\u0015\n∂δρ\n∂δρ\n∂ 1\n∂Φ\n∂δΦ\nT\n.\n(214)\n=\n+ δρ\n+ρ\n∂t\n∂θ ξ\n∂θ\n∂θ\n∂θ\nWriting δρ ∼ eλt and introducing the notation (50), we\nobtain the eigenvalue equation\n\u0012\n\u0013\nZ 2π\nk\nd 1 dq\nλξ\n+\nq,\nq(θ′ ) cos(θ − θ′ )dθ′ =\ndθ ρ dθ\n2πT 0\nTρ\n(215)\nwhich is similar to the eigenvalue equations obtained in the\npreceding sections. These eigenvalue equations all coincide\nat the point of marginal stability λ = 0 implying that the\nonset of the instability is the same in all the models considered. Equation (215) is the counterpart of Eq. (27) of\n\n27\n\nChavanis et al. (2002) for self-gravitating Brownian particles. We note that the eigenvalue equations (91) and (215)\nfor the Euler model and the Brownian model only differ\nby the substitution λ2 → λξ. Therefore, the results of Sec.\n3.5.1 can be directly extended to the present context.\nFor the uniform phase, the most destabilizing mode\n(n = 1) is\nδρ = a1 cos θ eλt ,\n\n(216)\n\nwith a growth rate\nλ=\n\n1\n(Tc − T ),\nξ\n\nTc =\n\nkM\n.\n4π\n\n(217)\n\nFor T < Tc , the perturbation grows expontentially while\nit is damped exponentially for T > Tc .\nConsidering now the clustered phase and using a perturbative approach similar to that of Appendix A for T →\nTc− (not detailed), we find that the perturbation is damped\nexponentially with a rate\n2\nλ = − (Tc − T ).\nξ\n\n(218)\n\nFrom Eqs. (217) and (218), we find that, starting from\na homogeneous solution at T = Tc− , there is first an exponential growth on a timescale ξ(Tc − T )−1 . Then, nonlinear terms come into play and the system relaxes towards\na clustered state on a timescale (1/2)ξ(Tc − T )−1 .\n6.3 Local Fokker-Planck equation\nBefore studying the non-local Smoluchowski equation (212)(8) numerically, it may be of interest to study a simplified problem where Φ is replaced by its equilibrium value\nΦ = B cos θ, where B is fixed. Considering again the\nstrong friction limit, we obtain the classical (local) Smoluchowski equation\n\u0014 \u0012\n\u0013\u0015\n∂ρ\n∂ρ\n∂ 1\nT\n=\n− Bρ sin θ .\n(219)\n∂t\n∂θ ξ\n∂θ\nThis Fokker-Planck equation also appears in the model of\nrotation of dipoles in a constant electric field developed by\nDebye. The stationary solutions of this equation are given\nby Eq. (19). Considering a perturbation δρ ∼ eλt around\na stationary solution and setting δρ = dq/dθ, we obtain\nthe eigenvalue equation\n\u0012\n\u0013\nd 1 dq\nλξ\n=\nq.\n(220)\ndθ ρ dθ\nTρ\nThis equation has the form of a Sturm-Liouville problem.\nFor B ≪ 1, so that ρ is approximately uniform, we find\nto leading order that the eigenvalues are λn = −n2 T /ξ\nwhere n = 1, 2, ... Using a procedure similar to that of\nAppendix A (not detailed), the next order correction is\n−λn ξ/T = n2 + n2 /[2(4n2 − 1)]x2 + ... where x = βB ≪ 1.\nThe eigenvalues of the Sturm-Liouville equation (220) are\nevaluated numerically in Fig. 18.\n\n\f28\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n0\n\n5\nη=2\n\nn=1\n\n4\n\n−20\n\n2πρ(θ,t)/M\n\nλξ/T\n\nn=2\n−40\nn=3\n\n3\n\n2\n\nn=4\n\n−60\n\n1\n−80\n\n0\n\n5\n\n10\nx\n\n15\n\n20\n\n0\n\n0\n\n2\n\n4\n\nFig. 18. Eigenvalues of the Sturm-Liouville equation (220).\n\nFor t ≫ trelax = ξβ (relaxation time), the density reaches\nits equilibrium value (19). For short times t ≪ 1, we have\n\u0012\n\u0013\nM\n1\nρ=\n1 − tB cos θ .\n(222)\n2π\nξ\nStarting from a homogeneous solution, there is first a linear growth followed by an exponential relaxation towards\nthe clustered state on a timescale ∼ ξ/T . This is illustrated numerically in Fig. 26 and compared with the time\nevolution of the non-local Fokker-Planck equation (212).\nThe evolution is of course quite different since, as we have\nseen, the non-local Fokker-Planck equation displays an exponential growth on a timescale ξ(Tc − T )−1 followed by\nan exponential relaxation on a timescale (1/2)ξ(Tc −T )−1 .\nThese timescales diverge as we approach the critical temperature Tc while there is no critical temperature for the\nlocal Fokker-Planck equation where B is fixed. The numerical solution of Eq. (219) is shown in Fig 19 and the\nanalytical solution (221) in Fig. 20 for two different values\nof η.\nWe also note that the change of variables\nρ=e\n\n− 12 βΦ\n\nψ(θ, t),\n\n(223)\n\nFig. 19. Evolution of the density profile according to the local\nFokker-Planck equation for η = 2 (corresponding to x = 3.33)\nstarting from a homogeneous solution (numerical simulation).\n1.3\nη= 1.005\n1.2\n\n2πρ(θ,t)/M\n\nFor B ≪ 1, the Fokker-Planck equation (219) can be\nsolved analytically. Assuming that, initially, the density is\nuniform, we find\n\u0014\n\u0015\nM\n1 + (e−t/ξβ − 1)βB cos θ .\n(221)\nρ=\n2π\n\n6\n\nθ\n\n1.1\n\n1\n\n0.9\n\n0.8\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\nθ\n\nFig. 20. Evolution of the density profile according to the local\nFokker-Planck equation for η = 1.005 (corresponding to x =\n0.2) starting from a homogeneous solution. In this case, we have\nused the analytical solution (221) which is valid for B ≪ 1.\n\nIn our case\n\u0014\n\u0015\n1\nβ 2 2\nV (θ) = − B cos θ + B sin θ .\n2\n2\n\n(226)\n\ntransforms the Fokker-Planck equation (219) into a SchrödingerWe can use this formalism to study the low temperature\nlike equation (with imaginary time)\nregime T → 0. In that case, the equilibrium state is close\n∂ψ\n∂2ψ\nto a Dirac peak centered on θ = π so that we can expand\nξ\n(224)\n= T 2 + V (θ)ψ,\nthe potential to leading order in x = θ − π. Eq. (219)\n∂t\n∂θ\nbecomes a Kramers-like equation\nwith\n\u0014\n\u0014 \u0012\n\u0015\n\u0013\u0015\nβ\n∂ρ\n1\n∂ 1\n∂ρ\n2\n∆Φ − (∇Φ) ψ.\nT\n(225)\nV (θ) =\n=\n+ ρBx .\n(227)\n2\n2\n∂t\n∂x ξ\n∂x\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\n4\n\n4\n\nθ(t)\n\n6\n\nθ(t)\n\n6\n\n29\n\n2\n\n0\n\n2\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n0\n\n0\n\n2.5\n\nBt/ξ\n\nFig. 21. Characteristics of Eq. (229). For t → +∞, all the\nparticles converge at θ = π and a Dirac peak is formed.\n\n5\n1/2\nB t\n\n7.5\n\n10\n\nFig. 23. Characteristics of the damped Euler equation (233)\nfor p = 0 and Φ = B cos θ. The ratio ξ/B = 1/2.\n\nistic and the equation of motion of a particle is\nT=0\n\n1\ndθ\n= B sin θ.\ndt\nξ\n\n2πρ(θ,t)M\n\n20\n\n(230)\n\n10\n\nThis equation of motion is readily solved and we get\n\u0015\n\u0014 \u0012 \u0013\nθ0 Bt/ξ\n,\n(231)\ne\nθ(t) = 2Arctan tan\n2\n\n0\n\nwhere θ0 is the initial position of the particle. The caracteristics are shown in Fig. 21. For t → +∞, all the\nparticles converge at θ = π and a Dirac peak is formed.\nThe density profile is determined by the condition ρ0 dθ0 =\nρ(θ, t)dθ yielding ρ(θ, t) = ρ0 /(dθ/dθ0 ). From Eq. (231),\nwe get\n\n0\n\n2\n\n4\n\n6\n\nθ\n\nρ(θ, t) =\n\nFig. 22. Evolution of the density profile at T = 0 starting\nfrom a homogeneous distribution.\n\nThe corresponding Schrödinger-like equation (224) is that\nof a harmonic oscillator\n∂2ψ 1\n1\n∂ψ\n= T 2 + (B − βB 2 x2 )ψ.\nξ\n∂t\n∂x\n2\n2\n\n(228)\n\nTherefore, for T → 0 the eigenvalues are given by λn =\n−nB/ξ, i.e. λn ξ/T = −nx (with n = 1, 2, ...) and the corresponding eigenfunctions are the Hermite polynomials.\nIt is also possible to solve the problem exactly at T = 0\nby using the method of characteristics. Indeed, the FokkerPlanck equation becomes\nξ\n\n∂ρ\n∂\n+\n(ρB sin θ) = 0,\n∂t\n∂θ\n\n(229)\n\nwhich is equivalent to an advection equation by a velocity\nfield v = (B/ξ) sin θ. Therefore, the evolution is determin-\n\nρ0 [1 + tan2 (θ/2)]e−Bt/ξ\n.\n1 + tan2 (θ/2)e−2Bt/ξ\n\n(232)\n\nThis profile is shown in Fig. 22 at different times.\nTo make the link between Figs. 21 and 10, we can\nconsider an intermediate hydrodynamical equation\n∂u\n1 ∂p ∂Φ\n∂u\n+u\n=−\n−\n− ξu.\n∂t\n∂θ\nρ ∂θ\n∂θ\n\n(233)\n\nThis could be called the damped Euler equation (see Chavanis 2003c). For ξ = 0 we recover the Euler equation\n(67) and for ξ → +∞, using the continuity equation (66),\nwe recover the Smoluchowski equation (212). For p = 0\nand Φ = B cos θ, Eq. (233) can be solved by the method\nof characteristics and the results are reported in Fig. 23.\nThis clearly shows the passage from Fig. 10 to Fig. 21 as\nthe friction parameter ξ increases.\n6.4 Dynamics of Brownian particles in interaction\nWe now turn to the evolution of a system of Brownian particles in interaction described by the N -coupled stochastic\n\n\f30\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n1.2\n\n1.015\nη=0.769\n\nn=2\n\n1.01\n\nt\n\n1.005\n\nn=4\n\n0.2\n2πan(t)/M\n\n2πρ(θ,t)/M\n\nn=5\n1\n\nn=3\n−0.8\n\n0.995\n\n0.99\nn=1\n0.985\n\n0\n\n2\n\n4\n\n−1.8\n\n6\n\n0\n\n5\n\n10\nTct/ξ\n\nθ\n\nFig. 24. Evolution of the density profile according to the nonlocal Fokker-Planck equation. For η = 0.769 < 1, the homogeneous solution is stable.\n\n20\n\nFig. 26. Evolution of the different modes an (t) for the nonlocal (full lines) and local (dashed lines) Fokker-Planck equations. The control parameters are η = 2, x = 3.33.\n\nFor the Brownian gas, we have to solve the integrodifferential equation\n\u001b\n\u001a Z 2π\n∂ρ\nk ∂\n∂2ρ\n′\n′\n′\nξ\nρ\nsin(θ − θ )ρ(θ , t)dθ .\n=T 2 +\n∂t\n∂θ\n2π ∂θ\n0\n(234)\n\n5\nη=2\n4\n\n2πρ(θ,t)/M\n\n15\n\n3\n\nSubstituting the decomposition\nt\n\n2\n\nρ = a0 (t) +\n\n+∞\nX\n\nan (t) cos(nθ)\n\n(235)\n\nM\n,\n2π\n\n(236)\n\nn=1\n\nin Eq. (234), we find that\n1\n\na0 =\n0\n\n0\n\n2\n\n4\n\n6\n\nθ\n\nFig. 25. For η = 2 > 1, the homogeneous solution (disklike) is unstable and the system forms a cluster (bar-like). The\nevolution is longer than with the local Fokker-Planck equation\nrepresented in Fig. 19 as also shown in the next figure and\nexplained in the text.\n\nequations (204). Despite all the simplifications introduced,\nthis model remains a non-trivial and interesting model\nexhibiting a process of self-organization. In particular, it\nshows the passage from a homogeneous phase (disk-like)\nto a clustered phase (bar-like) under the influence of longrange interactions. Interestingly, the large N limit of this\nsystem is exactly described by an explicit kinetic equation\n(208) reducing to Eq. (212) for large times. By contrast,\nthe kinetic equation describing the evolution of the HMF\nmodel (1) towards statistical equilibrium is not known as\nthe collision term cancels out at the order 1/N within the\napproximations usually considered (see Sec. 5).\n\nξ\n\nξ\n\n\u0012\n\u0013\nM\nk\na2\nda1\n,\n+ T a1 = a1\n−\ndt\n2\n2π\n2\n\ndan\nk\n+ T n2 an = na1 (an−1 − an+1 ),\ndt\n4\n\n(237)\n\n(n ≥ 2). (238)\n\nWe note that the coefficient a1 (t) is related to the magnetization B(t), defined in Eq. (10), by the formula B(t) =\n− k2 a1 (t). According to Eqs. (20), (21) and (22), the coefficients an are given at equilibrium by\nan =\n\nIn (βB)\nM\n(−1)n\n.\nπ\nI0 (βB)\n\n(239)\n\nTherefore, the static equations (237) and (238) with d/dt =\n0 coincide with the recursive relations satisfied by the\nBessel functions In (x).\nFor T → Tc− , the coefficients scale as an ∼ B n with\nB ≪ 1. Therefore, after a transient regime of order 1/T n2 ,\nEq. (238) can be simplified in\nan =\n\nk 1\na1 an−1 .\n4T n\n\n(240)\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\nk 2\nIn particular, for n = 2, we get a2 = 8T\na1 . This shows\nthat the second mode is slaved to the first. Substituting\nthis in Eq. (237), we get\n\nξ\n\nk2 3\nda1\n+ (T − Tc )a1 = −\na .\ndt\n32T 1\n\n(241)\n\nThis equation is readily solved (it may be convenient to\nuse p = a21 as a variable) and we obtain\na21 (t) =\n\nA(Tc − T )e2(Tc −T )t/ξ\n,\n2\n2(Tc −T )t/ξ\n1 + Ak\n32T e\n\n(242)\n\nwhere\nA=\n\na1 (0)2\nk2 a1 (0)2\n32T\n\n(Tc − T ) −\n\n.\n\n(243)\n\nFor t → +∞, we get a1 (∞)2 = 32T\nk2 (Tc − T ), or equivalently B 2 = 8T (Tc − T ). We thus recover the equilibrium\nresult (32) valid close to the critical point. The approach\nto equilibrium for t → +∞ is governed by δa1 (t)/a1 (∞) =\n16T −2(Tc −T )t/ξ\nyielding the damping rate (218). On the\nA2 k 2 e\nother hand, for t ≪ trelax , one has a1 (t) = a1 (0)e(Tc −T )t/ξ\nyielding the growth rate (217). Finally, at T = Tc , Eq.\n(241) leads to\na1 (t) = ± q\n\n1\n1\na1 (0)2\n\n+\n\nk2 t\n16ξTc\n\n.\n\nso that the magnetization B(t) =\ntends to zero\nalgebraically as t−1/2 for t → +∞. Using Eq. (240), the\ncoefficients an (t) are expressed in terms of a1 (t) by\nan =\n\n\u0012\n\nk\n4T\n\n\u0013n−1\n\n1 n\na .\nn! 1\n\ndifferent masses. Stellar systems also possess a mass spectrum, so this generalization has a counterpart in astrophysics.\nConsidering first the statistical equilibrium state, a\nstraightforward generalization of the counting analysis of\nSec. 2.2 yields\nY\nY ν nia\nW ({nia }) =\nNa !\n,\n(246)\nnia !\na\ni\nfor the probability of the state {nia }, where nia gives the\nnumber of particles with mass ma in the i-th macrocell.\nTherefore, the entropy S = ln W of the multi-species gas\nis\nX Z fa\nfa\nln\ndθdv,\n(247)\nS=−\nm\nm\na\na\na\nwhere fa (θ, v)dθdv gives the total mass of particles of\nspecies a in (θ, v). The distribution function of the whole\nassembly is\nX\nf (θ, v) =\nfa (θ, v).\n(248)\na\n\nThe statistical equilibrium state is obtained by maximizing the entropy (247) while conserving the total energy E\nand the mass Ma of each species of particles. This yields\n\n(244)\n\n− k2 a1 (t)\n\nfa = A′a e−βma (\n\n7 The multi-species HMF model\nWe finally briefly comment on the generalization of the\npreceding results to the case of the multi-species HMF\nmodel. We thus return to the Hamiltonian equations (1)\nand account for the possibility of having particles with\n\nv2\n2\n\n+Φ)\n\n,\n\n(249)\n\nwhich generalizes Eq. (18). Note that the inverse temperature β is the same for all species in accordance with the\ntheorem of equipartition of energy. This clearly leads to\na mass seggregation since the r.m.s. velocity of species a\ndecreases with the mass: hv 2 ia = T /ma . More precisely,\nEq. (249) implies\n\n(245)\n\nIn the previous calculations, we have assumed for simplicity that the density profile is symmetrical with respect\nto the x-axis. The general case is treated in Appendix F.\nAway from the critical point, the non-local Smoluchowski\nequation has to be solved numerically. Some numerical\nsimulations are shown in Figs. 24-26. Note also that for\nT → 0 and for sufficiently large times, the density is\npeaked around θ = π and Eq. (234) becomes equivalent\nto the local Kramers equation (227) with B = kM/2π.\nTherefore, for T → 0, the eigenvalues of Eq. (215) tend\nto λn = −nkM/2πξ (harmonic oscillator). Substituting\nξλ → λ2 , we deduce that, for T → 0, the eigenvalues of\nEq. (91) tend to λ2n = −nkM/2π (they are represented in\nFig. 9).\n\n31\n\nfa (ǫ) = Cab [fb (ǫ)]ma /mb ,\n\n(250)\n\nwhere Cab is a constant. Therefore, heavy particles will\nhave the tendency to occupy regions of low energy. Recall, by contrast, that there is no mass seggregation in\nLynden-Bell's statistical theory of violent relaxation for\ncollisionless systems (see Sec. 4) since the mass of the\nparticles does not appear in the Vlasov equation (LyndenBell 1967). It would be of interest to study these problems\nof mass seggregation with the HMF model for which numerical simulations are simpler than with gravitational\nsystems.\nConsidering now the collisional relaxation, a straightforward generalization of the Lenard-Balescu equation to\na multi-species system yields\n\u0012\n\u0013\nZ\n∂fb′\nk2 ∂ X\nδ(v − v ′ )\n∂fa\n′ ∂fa\nm\nf\n=\n−\nm\nf\ndv ′\nb b\na a\n∂t\n4 ∂v\n|ǫ(1, v)|2\n∂v\n∂v ′\nb\n\n(251)\n\nwith\nZ ′\nkX\nfb (v)\nǫ(1, ω) = 1 +\ndv.\n2\nv−ω\nb\n\n(252)\n\n\f32\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nWe now see that the collision term does not vanish anymore when there are at least two different species. The\ndiffusion and the friction experienced by a particle of one\nspecies are caused by collisions with particles of another\nspecies. Equation (251) can be rewritten in the suggestive\nform\n\u0015\n\u0014\n∂fb\n∂ X\n∂fa\n∂fa\n,\n(253)\n=\n− Dab\nDab\n∂t\n∂v\n∂v\n∂v\nb\n\nwhere\nDab =\n\nk 2 mb f b\n,\n4 |ǫ(1, v)|2\n\nk 2 ma f a\n,\n4 |ǫ(1, v)|2\n\nDab ∂fb\n.\nfa ∂v\n\nD(v) =\n\n\u00131/2\n\u0012\nv2\nnk 2 2 βmf\ne−βmf 2 ,\nmf\n4\n2π\n\n(256)\nPeq (v) =\n\n(257)\n\nThese results are similar to those obtained by Dubin (2003)\nfor the multi-components point vortex gas in two dimensions. When the profile of angular velocity is non-monotonic,\nthe vorticity profile evolves under the effect of long-range\ncollisions caused by a process of resonance (Dubin & O'Neil\n1988, Chavanis 2002). When the profile of angular velocity\nis monotonic, there is no evolution for the single-species\nsystem. An evolution is, however, possible for the distribution function of each species in the multi-components\nsystem. In a sense, at the order 1/N , the kinetic theory of\nthe point vortex gas (evolution of the single-species system when the angular velocity profile is non-monotonic) is\nintermediate between the kinetic theory of stellar systems\n(evolution of the single-species system in any case) and\nthe kinetic theory of the HMF model (no evolution of the\nsingle-species system).\nTherefore, the results of Dubin (2003) can be directly\ntransposed to the present context. In\nPparticular, we note\nthat the total distribution function a fa (v, t) = f (v) is\nstationary so that the conservation of energy is trivially\nsatisfied. On the other hand, a H-theorem can be proved\nfor the entropy (247), i.e. Ṡ ≥ 0. The equality Ṡ = 0\ncorresponds to vanishing currents\n\u0015\nX\u0014\n∂fb\n∂fa\n= 0,\n(258)\n− Dab\nJa = −\nDab\n∂v\n∂v\nb\n\nimplying the following equilibrium relation between the\ndensities\nfa (v) = Kab [fb (v)]ma /mb ,\n\n(259)\n\n(261)\n\nwhere n is the number density of field particles. The equilibrium distribution of the test particle is\n\nThese diffusion coefficients satisfy the relation\nDab\nDab\n=\n.\nma f a\nmb f b\n\n(260)\n\nwith\n\n(255)\n\nis an \"off-diagonal\" diffusion coefficient. It corresponds to\na friction force\nηa = −\n\n\u0014\n\u0012\n\u0013\u0015\n∂P\n∂\n∂P\nD(v)\n=\n+ βmP v .\n∂t\n∂v\n∂v\n\n(254)\n\nis the diffusion coefficient for species a due to collisions\nwith species b and\nDab =\n\nwhere Kab is a constant independent on v. This equation\nis similar to Eq. (250) but, here, fa (v) is not necessarily\nthe Maxwellian. Indeed, Eq. (259) is satisfied by any distribution of the form fa (v) = Aa exp[−βma χ(v)], where\nχ(v) is determined by the initial conditions.\nWe can use these results to study the relaxation of a\ntest particle of mass m in a bath of field particles with\nmass mf . Neglecting collective effects for simplicity, we\nfind that the equivalent of the Fokker-Planck equation\n(184) is now\n\n\u0012\n\nβm\n2π\n\n\u00131/2\n\ne−βm\n\nv2\n2\n\n.\n\n(262)\n\nThe timescale of collisional relaxation is\ntr =\n\n3\nvmf\n,\n0.121nm2f k 2\n\n(263)\n\nand t′r = 2(mf /m)tr . In dimensionless form, Eq. (260) can\nbe rewritten\n\u0014\n\u0012\n\u0013\u0015\n∂P\n∂P\n1 ∂\nm\nG(w)\nPw ,\n(264)\n=\n+2\n∂t\ntR ∂w\n∂w\nmf\nwith\ntR =\n\n3\nvm\n0.05nm2f k 2\n\n(265)\n\n2\n\nand G(w) = e−w . If we properly account for collective\neffects, the diffusion coefficient is given by\n2\n\nD(v) =\n\n[1 −\n\nv\nβm\nnk2\nm2 ( f )1/2 e−βmf 2\np4 f 2π π\n2\nηA( βmf v)]2 + 2 η 2 βmf v 2 e−βmf v\n\n, (266)\n\nkMm\n\nwhere η = 4πT f . On the other hand, for a distribution of\nthe bath of the form f0 (v), the Fokker-Planck equation is\n\u0014\n\u0012\n\u0013\u0015\n∂P\n∂\nm d ln f0\n∂P\nD(v)\n,\nP\n=\n−\n∂t\n∂v\n∂v\nmf\ndv\n2\n\n(267)\n\nwith D(v) = k4 mf f0 (v)/|ǫ(1, v)|2 . We note that the equilibrium distribution of the test particle is Peq (v) = Af0 (v)m/mf .\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\n33\n\n8 Conclusion\n\nsimilarly, the HMF model should find its place in the astrophysical literature.\n\nIn this paper, we have given an exhaustive description\nof the HMF model that recently appeared in statistical\nmechanics as a simple model with long-range interactions\nsimilar to self-gravitating systems. The originality of our\napproach is to offer an overview of the subject and to see\nhow different models (Hamiltonian, Brownian, fluids,...)\nare related to each other. Other studies concentrate in\ngeneral on a specific aspect of the problem. We think that\nputting all the models in parallel is illuminating because\nthey are closely connected to each other so that a unified\n(and aesthetic) description can be given. These connections were previously noted by one of us (P.H.C) in the\ncase of 3D self-gravitating systems and it was natural to\nextend these results to the HMF model. A more general\napproach is given in Chavanis (2004b) for an arbitrary potential of interaction in D dimensions. The present paper\ncan be seen as a particular application of this general formalism for a one dimensional potential truncated to one\nmode. The main interest of the HMF model in this context\nis to yield simple explicit results.\nAnother originality of our approach is to emphasize the\nconnection between the HMF model and self-gravitating\nsystems (and 2D vortices) although this link is only sketched\nin other papers, except in the early work of Inagaki. Many\nconcepts and technics that are well-known in astrophysics\nhave been rediscovered for the HMF model, sometimes\nwith a different point of view. This is true in particular for the notion of violent relaxation and metaequilibrium states. In statistical mechanics, this has been approached via a notion of \"generalized thermodynamics\"\n(Tsallis 1988) although it was understood early in astrophysics (Lynden-Bell 1967, Tremaine et al. 1986) that\nthese metaequilibrium states correspond to particular stationary solutions of the Vlasov equations on a coarsegrained scale (Chavanis et al. 1996, Chavanis 2003a). Thus,\nour dynamical interpretation of Tsallis functional as a particular H-function differs from the thermodynamical interpretation given by Boghosian (1996), Latora et al. (2002)\nand Taruya & Sakagami (2003).\nConcerning the interest of the HMF model for astrophysicists, we have shown that it exhibits the same types\nof behaviors as 3D self-gravitating systems while being\nmuch simpler to study because it is one dimensional and\navoids complicated problems posed by the divergence of\nthe gravitational potential at short distances and the absence of a large-scale confinement. Thus, it distinguishes\nwhat is common to long-range interactions and what is\nspecific to gravity. This comparative study should bring\nnew light in the statistical mechanics of self-gravitating\nsystems which has long been a controversial subject. Other\nsimplified models of gravity have been introduced such as\nthe parallel planar sheets of Camm (1950), the concentric spherical shells of Hénon (1971) or the toy models\nof Lynden-Bell & Lynden-Bell (1977) and Padmanabhan\n(1990). These toy models have often allowed advances in\nthe description of more realistic self-gravitating systems\nthat are difficult to study in full detail. We think that,\n\nAnother interest of the HMF model is to allow to study\nin great detail what happens close to the critical point. In\nthe HMF model, the potential is truncated to one mode\nn = 1 and there exists a critical temperature Tc = kM/4π\nbelow which the uniform phase is unstable. For infinite\nhomogeneous self-gravitating systems, there is a continuous spectrum of modes but there exists a critical wavelength λJ = (πT /Gmρ)1/2 (depending on the temperature) above which the system is unstable. Alternatively,\nif we fix the size of the system (for example by placing it\nin a box of radius R), the maximum wavelength is R and\nthe Jeans instability criterion now determines a critical\ntemperature Tc ∼ GmM/(πR) below which the system\nbecomes unstable (we have used λJ = R and ρ ∼ M/R3 ).\nIn fact, in the case of box-confined gravitational systems,\nwe must consider that the gaseous phase is inhomogeneous\nand use a more precise stability analysis (Chavanis 2002b)\nyielding Tc = GmM/(2.52R). These remarks show that\nthe critical temperature in the HMF model plays exactly\nthe same role as the critical temperature in finite isothermal spheres. Now, in the framework of the HMF model, it\nis possible to study how the mean-field results are altered\nclose to the critical point due to collective effects. This\nis more complicated for self-gravitating systems because\nthey are inhomogeneous. However, on a qualitative point\nof view, we expect similar results: divergence of the twopoint correlation function like in Eq. (61), divergence of\nthe force auto-correlation function like in Eq. (64), alteration of the diffusion coefficient and increase of the relaxation time like in Eq. (190), increase of the decorrelation\ntime like in Eq. (197)... These problems are difficult to\nstudy for self-gravitating systems but they are of considerable importance. They have never been discussed in detail\nbecause it is usually implicitly assumed that the system\nsize is much smaller than the Jeans scale (or the temperature much larger than Tc ) so that collective effects are\nneglected and the dielectric function is approximated as\nǫ ≃ 1. The present simplified study is a first step to understand the failure of the mean-field approximation close\nto the critical point and it can thus find important applications in theoretical astrophysics. Note that fluctuations\nin isothermal spheres close to the critical point have been\nstudied by Katz & Okamoto (2000) and Chavanis (2005).\nFinally, we have given an astrophysical application of\nthe HMF model in relation with the formation of bars\nin spiral galaxies, following the original idea of Pichon\nand Lynden-Bell. This simple model is consistent with the\nphenomenology of structure formation which results from\na competition between long-range interactions (gravity)\nand thermal motion (velocity dispersion). It is sometimes\nargued that the moment of inertia α−1 of stellar orbits can\nbe negative (Pichon 1994). In that case, we must consider\nEq. (1) with k < 0. This corresponds to the repulsive\n(anti-ferromagnetic) HMF model. Now, Barré et al. (2002)\nhave observed that this model leads to the formation of\na bicluster. In the stellar disk analogy, the equivalent of\nthe \"bicluster\" would be two bars perpendicular to each\n\n\f34\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nother. We do not know whether this type of structure is\nobserved in astrophysics.\nAcknowledgements One of us (P.H.C) is grateful to\nDonald Lynden-Bell for inspiring discussions some years\nago. He is also grateful to Pr. D. Dubin for drawing his\nattention to his work on non-neutral plasmas. We would\nlike to thank T. Dauxois for interesting discussions.\n\nTo order 0, we have\nLq0 = 0,\n\n(274)\n\nyielding q0 = sin θ. To order 1, we get\nLq1 = π sin(2θ),\n\n(275)\n\nyielding\n\nA Estimate of the eigenvalue close to the\ncritical point\nFor simplicity, we restrict ourselves to symmetrical perturbations with respect to the x-axis. The general case is\ntreated in Appendix F by another method. In the canonical ensemble, we have to study the eigenvalue equation\n(V = 0):\n\u0012\n\u0013\nZ 2π\n1 dq\nk\nd\n+\nq(θ′ ) cos(θ − θ′ )dθ′ = 2λq,\ndθ ρ(θ) dθ\n2πT 0\n(268)\nwhere ρ(θ) is the equilibrium density profile and q(θ) is\nthe perturbation. We consider the clustered phase close\nto the critical point Tc . Thus, we can perform a systematic expansion of the parameters in powers of B ≪ 1 or,\nequivalently, in powers of x = βB ≪ 1.\nUsing Eqs. (20) and (21), the density profile can be\nexpanded as\n\u0014\n\u0015\nx2\n2π\n1\n1 + x cos θ + (1 + 2 cos2 θ) + ... .\n=\n(269)\nρ\nM\n4\nSubstituting this result in Eq. (268), and using the expansion (30) of the temperature, we obtain\n\u001a \u0014\n\u0015 \u001b\nx2\ndq\nd\n2\nπ 1 + x cos θ + (1 + 2 cos θ)\ndθ\n4\ndθ\n\u0012\n\u0013 Z 2π\nx2\n+ 1+\nq(θ′ ) cos(θ − θ′ )dθ′ = μx2 q. (270)\n8\n0\nwhere we have set λM = μx2 with μ = O(1). Here, λ refers\nto the largest eigenvalue of Eq. (268) which is equal to\nzero for x = 0 (the other eigenvalues are λn M = −πn2 +\nO(x) for n ≥ 2). Furthermore, the following expansion\nshows that the term of order x vanishes so we have directly\nwritten λ ∼ x2 . According to Eq. (30), we have\n\u0012\n\u0013\n8μ β\n−1 ,\n(271)\nλ=\nM βc\n\n1\nq1 = − sin(2θ) + C sin θ,\n(276)\n4\nwhere C is an arbitrary constant. Finally, to order 2, we\nhave after simplification\n\u0013\n\u0012\n3π\nπ\nsin θ + πC sin(2θ) −\nsin(3θ), (277)\nLq2 = μ +\n4\n8\nyielding\n\nand we introduce the differential operator\nZ 2π\nd2 q\nq(θ′ ) cos(θ − θ′ )dθ′ .\nLq = π 2 +\ndθ\n0\n\n(272)\n\n(273)\n\n(278)\n\nand\nq2 = D sin θ −\n\n1\nC\nsin(2θ) +\nsin(3θ),\n4\n24\n\n(279)\n\nwhere D is an arbitrary constant. Therefore, close to the\ncritical point, the largest eigenvalue of Eq. (268) is\n\u0013\n\u0012\nβ\nπ 2\n− 1 . (280)\nor\nλM = −2π\nλM = − x ,\n4\nβc\nWe can obtain the expression of the eigenvalue by a\nslightly different method. We consider the Hilbert space of\n2π-periodic continuous real functions with scalar product\nhf, gi =\n\n1\n2π\n\nZ\n\n2π\n\nf (θ)g(θ)dθ.\n\n(281)\n\n0\n\nWe note that the operator (273) is Hermitian in the sense\nthat\nhLf, gi = hf, Lgi.\n(282)\nThe equation obtained to second order can be written\nLq2 = g(θ),\n\n(283)\n\nwith\ng(θ) =\n\n\u0012\n\nμ+\n\nπ\n4\n\n\u0013\n\nsin θ + πC sin(2θ) −\n\n3π\nsin(3θ). (284)\n8\n\nWe note q0 the Kernel of L, i.e. Lq0 = 0. Then, we have\nthe condition of solvability\n\nwhere μ has to be determined self-consistently. We thus\nexpand the perturbation as\nq(θ) = q0 (θ) + x q1 (θ) + x2 q2 (θ) + ...\n\nπ\nμ=− ,\n4\n\nhq0 , gi = 0.\n\n(285)\n\nhq0 , gi = hq0 , Lq2 i = hLq0 , q2 i = 0.\n\n(286)\n\nIndeed,\n\nIn our case, q0 = sin θ, so that the condition hq0 , gi = 0\nwith (284) yields Eq. (278).\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nIn the microcanonical ensemble, we have to study the\neigenvalue equation (V 6= 0):\nd\ndθ\n\n\u0012\n\n1 dq\nρ(θ) dθ\n\n\u0013\n\n+\n\nk\n2πT\n\nZ\n\n0\n\n=\n\n2V dΦ\n+ 2λ′ q. (287)\nM T 2 dθ\n\n2V dΦ\nTo leading order in B ≪ 1, the term MT\n2 dθ can be writ2π 2\nten M x sin θ. Therefore, Eq. (287) becomes\n\n\u001a \u0014\n\u0015 \u001b\nd\nx2\ndq\nπ 1 + x cos θ + (1 + 2 cos2 θ)\ndθ\n4\ndθ\n\u0013 Z 2π\n\u0012\nx2\nq(θ′ ) cos(θ − θ′ )dθ′ = πx2 sin θ + μ′ x2 q.\n+ 1+\n8\n0\n(288)\nThe eigenvalue is now\nμ′ = −\n\nπ\n5π\n−π =− ,\n4\n4\n\n(289)\n\nyielding\nλM = −\n\n5π 2\nx ,\n4\n\nor\n\nThis yields the important identity\np′ (ρ)\n−1\n.\n= R ∂f 1\nρ\n∂v v dv\n\n2π\n\nq(θ′ ) cos(θ − θ′ )dθ′\n\nλM = −10π\n\n\u0012\n\n\u0013\nβ\n− 1 . (290)\nβc\n\nand\nZ\nv2\ndρ\n= F ′ (β + α) dv\ndα\n2\nZ\nZ ′\n∂\nf (v)\nv2\n1\n=\nF (β + α) dv =\ndv.\n∂v\n2\nβv\nβv\n\nFor any system described by a distribution function f (θ, v),\nwe define the density and the pressure by\nZ\nZ\nρ = f dv,\np = f v 2 dv.\n(291)\nThe kinetic temperature T = p/ρ is equal to the velocity\ndispersion of the particles. If the distribution function is\n2\nof the form f = f (ǫ) with ǫ = v2 + Φ(θ), we have\n\nEliminating α from the foregoing relations, we obtain\n−1\np′ (ρ)\n= R f ′ (v) ,\nρ\nv dv\n\nZ\n∂f\ndΦ 2\ndΦ\nv dv =\nvdv\ndθ\ndθ\n∂v\nZ\ndΦ\ndΦ\nf dv = −ρ ,\n=−\ndθ\ndθ\n\nc2s = −\n\n(292)\n\nwhich returns the condition of hydrostatic balance (70).\nThis relation is equivalent to\n1\np′ (ρ)\n=− ′\n.\nρ\nρ (Φ)\n\nf ′ (ǫ) dv =\n\nZ\n\n∂f 1\ndv.\n∂v v\n\n1\nM\nR +∞ f ′ (v) .\n2π\ndv\n−∞\n\n(299)\n\nv\n\nWe consider the Euler equations\n∂ρ\n+ ∇ * (ρu) = 0,\n∂t\n\n(300)\n\n\u0015\n∂u\n+ (u * ∇)u = −∇p − ρ∇Φ,\nρ\n∂t\n\n(301)\n\n\u0014\n\n(293)\n\nin D dimensions and for an arbitrary binary potential of\ninteraction u(|r − r′ |) such that\nZ\nΦ(r, t) = u(r − r′ )ρ(r′ , t)dD r′ .\n(302)\n\n(294)\n\nWe also consider an arbitrary barotropic equation of state\np = p(ρ). Clearly, ρ = Cst., u = 0 and Φ = 0R is a stationary solution of Eq. (300)-(302) provided that u(x)dD x =\n\nNow, we note that\nZ\n\n(298)\n\nC General dispersion relation for a gaseous\nsystem\n\nf ′ (ǫ)\n\ndρ\n=\ndΦ\n\n(297)\n\nwhich is consistent with Eq. (295). Now, introducing the\nvelocity of sound c2s = p′ (ρ) and using ρ = M/2π, we get\n\nB Some useful identities\n\nZ\n\n(295)\n\nThis identity is valid for both homogeneous and inhomogeneous systems. It may be useful to rederive it in the case\nof homogeneous systems since Φ = 0 in that case so that\nthe above precedure is ill-determined.\nWe consider a homogeneous system described by the\n2\ndistribution function f = F (β v2 + α) where α is a Lagrange multiplier taking into account the conservation of\nmass (normalization). In that case, ρ = ρ(α) and p = p(α).\nNow,\nZ\nv2\ndp\n= F ′ (β + α)v 2 dv\ndα\n2\nZ\n∂\nv2\nv\nρ\n=\nF (β + α) dv = − ,\n(296)\n∂v\n2\nβ\nβ\n\nAlthough the onset of instability is the same in the two\nensembles, the eigenvalues differ in the condensed phase.\n\ndp\n=\ndθ\n\n35\n\n\f36\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\n0 (for the gravitational potential, this is not the case and\nwe must advocate the Jeans swindle). We shall restrict\nourselves to such homogeneous solutions. The linearized\nEuler equations are\n∂δρ\n+ ρ∇ * δu = 0,\n∂t\n\n(303)\n\n∂δu\n= −p′ (ρ)∇δρ − ρ∇δΦ,\nρ\n∂t\nδΦ(r, t) =\n\nZ\n\nu(r − r′ )δρ(r′ , t)dD r′ .\n\n(304)\n\n(305)\n\n(306)\n\nwhere we have introduced the velocity of sound c2s = p′ (ρ).\nWe introduce the Fourier transform of the interaction potential such that\nZ\nu(x) = eik*x û(k)dD k.\n(307)\nTaking the Fourier transform of Eqs. (305) and (306) with\nthe convention δρ ∼ ei(k*r−ωt) , and combining the resulting expressions, we find that\nω 2 = c2s k 2 + (2π)D û(k)k 2 ρ,\n\n(308)\n\nwhich is the required dispersion relation. The system will\nbe unstable if\nc2s + (2π)D û(k)ρ < 0.\n\n(309)\n\nIn particular, it is necessary that û(k) < 0 corresponding to attractive potentials. In that case, the condition of\ninstability reads\nc2s < (c2s )crit ≡ (2π)D ρ|û(k)|max .\n\n(310)\n\nThen, the unstable lengthscales are determined by Eq.\n(309). Various situations can happen (see Chavanis 2004b)\ndepending on the form of the potential û(k). For the gravitational interaction in D = 3, using ∆u = 4πGδ(x), we\nhave (2π)3 û(k) = −4πG/k 2 . We recover the usual formula\n(Binney & Tremaine 1987)\nω 2 = c2s k 2 − 4πGρ.\n\n(311)\n\nThe system is always unstable ((c2s )crit = ∞) for sufficiently large wavelengths or equivalently for\nk < kJ ≡\n\n\u0012\n\n4πGρ\nc2s\n\n\u00131/2\n\n,\n\nWe consider the Vlasov equation\n∂f\n∂f\n∂f\n+v*\n− ∇Φ *\n= 0,\n∂t\n∂r\n∂v\n\n(312)\n\nwhere kJ is the Jeans wave number. For the HMF model,\nk\n. In that case, Eq. (308)\nûn = 0 if n 6= ±1 and û±1 = − 4π\nreturns Eq. (87). The system is unstable for the mode\nn = 1 if c2s < kM/4π.\n\n(313)\n\nin D dimensions and for an arbitrary binary potential of\ninteraction u(|r − r′ |) as before. Clearly, a distribution\nfunction f = f0 (v) which depends only on the velocity\nis a stationary solution of Eq. (313) under the same assumptions as before. We shall restrict ourselves to such\nhomogeneous solutions. The linearized Vlasov equation is\n∂δf\n∂δf\n∂f0\n+v*\n− ∇δΦ *\n= 0,\n∂t\n∂r\n∂v\n\nThese equations can be combined to give\n∂ 2 δρ\n− c2s ∆δρ − ρ∆δΦ = 0,\n∂t2\n\nD General dispersion relation for a stellar\nsystem\n\nwhich must be supplemented by\nZ\nδΦ(r, t) = u(r − r′ )δρ(r′ , t)dD r′ .\n\n(314)\n\n(315)\n\nTaking the Fourier transform of Eqs. (314) and (315) with\nthe convention δf ∼ ei(k*r−ωt) and combining the resulting\nexpressions, we find that\nZ\n∂f0\nδ fˆ(k, v, ω)dD v = 0.\n(ω − k * v)δ fˆ + (2π)D û(k)k *\n∂v\n(316)\nThis can be rewritten\nǫ(k, ω) ≡ 1 + (2π)D û(k)\n\nZ\n\n0\nk * ∂f\n∂v\ndD v = 0, (317)\nω−k*v\n\nwhich is the dispersion relation of the system. For the\ngravitational interaction in D = 3, using (2π)3 û(k) =\n−4πG/k 2 , we recover the usual formula (Binney & Tremaine\n1987)\nZ\n0\nk * ∂f\n4πG\n∂v\ndD v = 0.\n(318)\n1− 2\nk\nω−k*v\nFor the HMF model, we recover Eq. (117).\n\nE General dispersion relation for a Brownian\nsystem\nWe finally consider a gas of Brownian particles in interaction described in the strong friction limit by the Smoluchowski equation\n\u0014\n\u0015\n1\n∂ρ\n= ∇ * (T ∇ρ + ρ∇Φ) ,\n(319)\n∂t\nξ\nwhere Φ is given by Eq. (302). Under the same conditions\nas in Appendix C, the linearized Smoluchowski equation\nis\n\u0014\n\u0015\n∂δρ\n1\n= ∇ * (T ∇δρ + ρ∇δΦ) .\n(320)\n∂t\nξ\n\n\fP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\nTaking the Fourier transform of Eq. (320), we obtain the\ndispersion relation\niξω = T k 2 + (2π)D û(k)k 2 ρ,\n\n(321)\n\nξ\n\n(322)\n\nThe stability condition coincides with the Jeans criterion\nfor an isothermal gas\nk < kJ ≡\n\n\u0012\n\n4πGρ\nT\n\n\u00131/2\n\n.\n\n(323)\n\nHowever, the stable modes are exponentially damped in\nthe case of Brownian particles while they have an oscillatory nature in the case of gaseous systems. For a sinusoidal\npotential of interaction, we recover Eq. (217).\n\n(331)\n\nThe equation for p is readily solved and we obtain\n\nwhich can be compared to Eq. (308). In the gravitational\ncase, we get\niξω = T k 2 − 4πGρ.\n\ndp\nk2\n+ 2(T − Tc )p = − p2 .\ndt\n4T\n\n37\n\np(t) =\n\n2A(Tc − T )e2(Tc −T )t/ξ\n.\n2\n2(Tc −T )t/ξ\n1 + Ak\n4T e\n\n(332)\n\nSubstituting this result in Eq. (330) and solving the resulting equation, we get\nB\nX(t) = q\n.\nAk2\n| 4T + e−2(Tc −T )t/ξ |\n\n(333)\n\nThe modes a1 and a−1 are deduced from X and p by\nsolving the second order equation a2 −Xa+p = 0 yielding\np\nX(t) ± ∆(t)\n.\n(334)\na±1 (t) =\n2\nThe discriminant can be written\n\nF Generalization of the analytical solution\n(242) to arbitrary perturbations\nIn Sec. 6.4, we have restricted our analysis to density profiles that are always even, i.e. ρ(−θ, t) = ρ(θ, t). It is not\ndifficult to relax this hypothesis. Let us write the density\nprofile in the general form\nρ=\n\n+∞\nX\n\nan (t)einθ .\n\n(324)\n\nn=−∞\n\nSubstituting this decomposition in Eq. (234), we find that\na0 =\n\nξ\n\nM\n,\n2π\n\np(t) =\n(326)\n\nTo first order in Tc − T ≪ Tc , we can neglect an with\n|n| ≥ 3. We thus get\nk 2\na .\n4T ±1\n\n(327)\n\nThe equations for the modes a±1 are therefore\nda1\nk2\n+ (T − Tc )a1 = − a21 a−1 ,\ndt\n8T\n\n(328)\n\nk2\nda−1\n+ (T − Tc )a−1 = − a2−1 a1 .\ndt\n8T\n\n(329)\n\nξ\n\nξ\n\nAt that point, it is convenient to introduce the variables\np = a1 a−1 and X = a1 + a−1 . They satisfy the differential\nequations\n2\n\nξ\n\nk\ndX\n+ (T − Tc )X = − pX,\ndt\n8T\n\n(330)\n\nB 2 − 8|A|(Tc − T )\n.\n2\n| k4TA + e−2(Tc −T )t/ξ |\n\n(335)\n\nThe constants of integration A and B, which can be positive or negative, are fixed by the initial condition. They\nmust satisfy ∆(0) ≥ 0, i.e. B 2 ≥ 8|A|(Tc − T ). Then,\n∆(t) ≥ 0 at all times. If initially a−1 (0) = a1 (0), then\n∆(0) = 0. By Eq. (335), this implies that ∆(t) = 0 for\nall times. Therefore, if the initial perturbation is even, it\nremains even during all the evolution. We thus recover\nthe results of section 6.4 with a1 equals to 2a±1 with the\npresent notations. Finally, for T = Tc , Eq. (330) and (331)\nlead to\n\n(325)\n\ndan\nk\n+ T n2 an = n(a1 an−1 − a−1 an+1 ).\ndt\n2\n\na±2 =\n\n∆=\n\n1\np(0)\n\n1\n+\n\nk2 t\n4ξTc\n\n,\n\nX(0)\n.\nX(t) = q\n2 p(0)t\n1 + k 4ξT\nc\n\n(336)\n\nWe can also use this approach to study the dynamical stability of stationary solutions of Eq. (234). By truncation to order 2 (a3 = a−3 = 0), we obtain the equilibrium relations : B = −kae1 (we suppose ae1 = ae−1\nwithout lack of generality), ae2 = ae−2 = k2 (Tc − T ) and\nB 2 = 8Tc(Tc − T ). These expressions are valid up to order\n1 in Tc − T . Let us compute the four smallest eigenvalues corresponding to the relaxation towards equilibrium.\nDefining an = aen + exp(λt)δan , we obtain after linearization M Y = 0 where Y is a row vector of components\nT\n(δa1 , δa−1 , δa2 , δa−2 ) and\n\n\n√\n−ξλ + ∆T\n−∆T\n− 2Tc ∆T √ 0\n −∆T\n−ξλ + ∆T\n0\n− 2Tc ∆T \n\n√\nM =\n\n 4 2Tc ∆T\n−ξλ − 4T\n0\n√0\n0\n−4 2Tc ∆T\n0\n−ξλ − 4T\n\nwhere we have set ∆T = Tc − T . The eigenvalues are the\nzeros of the determinant of M . The two lowest eigenvalues\nscale as (Tc − T ) so we set λ = 1ξ (Tc − T )λ1 . First dividing\n\n\f38\n\nP.H. Chavanis, J. Vatteville and F. Bouchet: Dynamics and thermodynamics of the HMF model\n\np\nthe two first rows and the two first columns\nby (Tc − T ),\n√\nand dividing√the two last rows by 2 2Tc and the two last\ncolumns by 2Tc we obtain at leading order\n\n\n−λ1 + 1 −1 −1 0\n −1 −λ1 + 1 0 −1 \ndet \n=0\n2\n0\n−1 0 \n0\n−2\n0 −1\n\nwhich gives λ21 + 2λ1 = 0. The smallest eigenvalue λ1 = 0\nis the neutral mode associated to the angle rotation invariance, whereas the smallest non zero eigenvalue is λ1 = −2\nor equivalently λ = − ξ2 (Tc − T ). The two consecutive\neigenvalues are of order 0. Considering the determinant\nof M at order 0, we obtain two degenerate eigenvalues\nλ = −4Tc/ξ. We note that this degeneracy will be removed at next order.\n\nReferences\n1. M. Antoni, S. Ruffo, Phys. Rev. E 52, 2361 (1995)\n2. V.A. Antonov, Vest. Leningr. Gos. Univ. 7, 135 (1962)\n3. J. Barré, F. Bouchet, T. Dauxois, S. Ruffo, Euro. Phys. J.\nB 29, 577 (2002)\n4. J. Binney, S. Tremaine, Galactic Dynamics (Princeton Series in Astrophysics, 1987)\n5. F. Bouchet, Phys. Rev. E 70, 036113 (2004)\n6. F. Bouchet, J. Barré, J. Stat. Phys. 118, 1073 (2005)\n7. F. Bouchet, T. Dauxois 2004, [cond-mat/0407703]\n8. B.M. Boghosian, Phys. Rev. E 53, 4754 (1996)\n9. H. Brands, P.H. Chavanis, J. Sommeria and R. Pasmanter,\nPhys. Fluids 11, 3465 (1999)\n10. G.L. Camm, MNRAS 110, 305 (1950)\n11. S. Chandrasekhar, An Introduction to the Theory of Stellar Structure (Dover, New York, 1939)\n12. S. Chandrasekhar, ApJ 99, 47 (1944)\n13. S. Chandrasekhar, J. von Neumann, ApJ 95, 489 (1942)\n14. P.H. Chavanis, MNRAS 300, 981 (1998)\n15. P.H. Chavanis, Phys. Rev. E 64, 026309 (2001)\n16. P.H. Chavanis, Statistical mechanics of two-dimensional\nvortices and stellar systems, in: Dynamics and thermodynamics of systems with long range interactions,\nedited by Dauxois, T, Ruffo, S., Arimondo, E. and\nWilkens, M. Lecture Notes in Physics, Springer (2002a);\ne-print:[cond-mat/0212223].\n17. P.H. Chavanis, A&A 381, 340 (2002b)\n18. P.H. Chavanis, Phys. Rev. E 65, 056123 (2002c)\n19. P.H. Chavanis, A&A 401, 15 (2003a)\n20. P.H. Chavanis, unpublished notes (2003b)\n21. P.H. Chavanis, Phys. Rev. E 68, 036108 (2003c)\n22. P.H. Chavanis, Physica A 332, 89 (2004a)\n23. P.H. Chavanis, 2004b, [cond-mat/0409641]\n24. P.H. Chavanis, 2004c, [cond-mat/0409511]\n25. P.H. Chavanis, Banach Center Publ. 66, 79 (2004d)\n26. P.H. Chavanis, A&A 432, 117 (2005)\n27. P.H. Chavanis, P. Laurençot, M. Lemou, Physica A 341,\n145 (2004a)\n28. P.H. Chavanis, M. Ribot, C. Rosier, C. Sire, Banach Center\nPubl. 66, 103 (2004b)\n29. P.H. Chavanis, C. Rosier, C. Sire, Phys. Rev. E 66, 036105\n(2002)\n\n30.\n31.\n32.\n33.\n34.\n35.\n\n36.\n\n37.\n38.\n39.\n40.\n41.\n42.\n43.\n44.\n45.\n46.\n47.\n48.\n49.\n50.\n51.\n52.\n53.\n54.\n\n55.\n56.\n57.\n58.\n59.\n60.\n61.\n62.\n63.\n64.\n65.\n66.\n\nP.H. Chavanis, C. Sire, Phys. Rev. E 62, 490 (2000)\nP.H. Chavanis, C. Sire, Phys. Rev. E 69, 016116 (2004a)\nP.H. Chavanis, C. Sire, 2004b, [cond-mat/0409569]\nP.H. Chavanis, J. Sommeria, R. Robert, ApJ 471, 385\n(1996)\nM.Y. Choi, J. Choi, Phys. Rev. Lett. 91, 124101 (2003)\nT. Dauxois, S. Ruffo, E. Arimondo, M. Wilkens (Eds),\nDynamics and thermodynamics of systems with long range\ninteractions, Lecture Notes in Physics, Springer (2002a)\nT. Dauxois, V. Latora, A. Rapisarda, S. Ruffo, A. Torcini,\nThe Hamiltonian Mean Field Model: from Dynamics to\nStatistical Mechanics and back , in: Dynamics and thermodynamics of systems with long range interactions,\nedited by Dauxois, T, Ruffo, S., Arimondo, E. and\nWilkens, M. Lecture Notes in Physics, Springer (2002b)\n[cond-mat/0208456].\nD. Dubin, T.M. O'Neil, Phys. Rev. Lett. 60, 1286 (1988)\nD. Dubin, Phys. Plasmas 10, 1338 (2003)\nR. Ellis, K. Haven, B. Turkington, Nonlinearity 15, 239\n(2002)\nM. Hénon, Astrophys. Space Sci. 14, 751 (1971)\nD.D. Holm, J.E. Marsden, T. Ratiu, A. Weinstein, Phys.\nRep. 123, 1 (1985)\nS. Ichimaru, Basic Principles of Plasma Physics (W.A.\nBenjamin, Inc. Reading, Mass., 1973)\nS. Inagaki, Prog. Theor. Phys. 90, 557 (1993)\nS. Inagaki, T. Konishi, Publ. Astron. Soc. Japan 45, 733\n(1993)\nS. Inagaki, Prog. Theor. Phys. 96, 1307 (1996)\nH. Kandrup, ApJ 244, 316 (1981)\nH. Kandrup, Astr. Space. Sci. 97, 435 (1983)\nJ. Katz, MNRAS 183, 765 (1978)\nJ. Katz, MNRAS 190, 497 (1980)\nJ. Katz, Found. Phys. 33, 223 (2003)\nJ. Katz and I. Okamoto, MNRAS 317, 163 (2000)\nT. Konishi, K. Kaneko, J. Phys. A 25, 6283 (1992)\nV. Latora, A. Rapisarda, C. Tsallis, Physica A 305, 129\n(2002)\nD. Lynden-Bell, Runaway Centers, in: Extrait du Bulletin\nAstronomique, Série 3, Tome III, Fascicule 2 (Editions du\nCNRS, 1968)\nD. Lynden-Bell, MNRAS 136, 101 (1967)\nD. Lynden-Bell, R.M. Lynden-Bell, MNRAS 181, 405\n(1977)\nT. Padmanabhan, Phys. Rep. 188, 285 (1990)\nC. Pichon, PhD thesis, Cambridge (1994)\nA. Pluchino, V. Latora, A. Rapisarda, Phys. Rev. E 69,\n056113 (2004)\nH. Risken, The Fokker-Planck equation (Springer, 1989)\nA. Taruya, M. Sakagami, Physica A 322, 285 (2003)\nS. Tremaine, M. Hénon, D. Lynden-Bell, MNRAS 227, 543\n(1986)\nC. Tsallis, J. Stat. Phys. 52, 479 (1988)\nM. Vergassola, B. Dubrulle, U. Frisch, A. Noullez, A&A\n289, 325 (1994)\nY.Y. Yamaguchi, J. Barré, F. Bouchet, T. Dauxois, S.\nRuffo, Physica A 337, 36 (2004)\nY.Y. Yamaguchi, Phys. Rev. E 68, 066210 (2003)\n\n\f"}