{"id": "http://arxiv.org/abs/cond-mat/0007114v1", "guidislink": true, "updated": "2000-07-06T22:03:18Z", "updated_parsed": [2000, 7, 6, 22, 3, 18, 3, 188, 0], "published": "2000-07-06T22:03:18Z", "published_parsed": [2000, 7, 6, 22, 3, 18, 3, 188, 0], "title": "Library Design in Combinatorial Chemistry by Monte Carlo Methods", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0007148%2Ccond-mat%2F0007403%2Ccond-mat%2F0007412%2Ccond-mat%2F0007171%2Ccond-mat%2F0007039%2Ccond-mat%2F0007019%2Ccond-mat%2F0007031%2Ccond-mat%2F0007383%2Ccond-mat%2F0007114%2Ccond-mat%2F0007433%2Ccond-mat%2F0007001%2Ccond-mat%2F0007478%2Ccond-mat%2F0007036%2Ccond-mat%2F0007312%2Ccond-mat%2F0007487%2Ccond-mat%2F0007203%2Ccond-mat%2F0007073%2Ccond-mat%2F0007434%2Ccond-mat%2F0007113%2Ccond-mat%2F0007332%2Ccond-mat%2F0007070%2Ccond-mat%2F0007168%2Ccond-mat%2F0007303%2Ccond-mat%2F0007357%2Ccond-mat%2F0007430%2Ccond-mat%2F0007411%2Ccond-mat%2F0007509%2Ccond-mat%2F0007270%2Ccond-mat%2F0007491%2Ccond-mat%2F0007189%2Ccond-mat%2F0007078%2Ccond-mat%2F0007095%2Ccond-mat%2F0007256%2Ccond-mat%2F0007117%2Ccond-mat%2F0007285%2Ccond-mat%2F0007322%2Ccond-mat%2F0007221%2Ccond-mat%2F0007463%2Ccond-mat%2F0007053%2Ccond-mat%2F0007489%2Ccond-mat%2F0007375%2Ccond-mat%2F0007420%2Ccond-mat%2F0007381%2Ccond-mat%2F0007238%2Ccond-mat%2F0007098%2Ccond-mat%2F0007308%2Ccond-mat%2F0007429%2Ccond-mat%2F0007007%2Ccond-mat%2F0007426%2Ccond-mat%2F0007316%2Ccond-mat%2F0007435%2Ccond-mat%2F0007136%2Ccond-mat%2F0007362%2Ccond-mat%2F0007205%2Ccond-mat%2F0007208%2Ccond-mat%2F0007199%2Ccond-mat%2F0007210%2Ccond-mat%2F0007064%2Ccond-mat%2F0007043%2Ccond-mat%2F0007222%2Ccond-mat%2F0007492%2Ccond-mat%2F0007060%2Ccond-mat%2F0007330%2Ccond-mat%2F0007472%2Ccond-mat%2F0007482%2Ccond-mat%2F0007160%2Ccond-mat%2F0007137%2Ccond-mat%2F0007321%2Ccond-mat%2F0007289%2Ccond-mat%2F0007390%2Ccond-mat%2F0007329%2Ccond-mat%2F0007446%2Ccond-mat%2F0007445%2Ccond-mat%2F0007345%2Ccond-mat%2F0007121%2Ccond-mat%2F0007376%2Ccond-mat%2F0007215%2Ccond-mat%2F0007288%2Ccond-mat%2F0007278%2Ccond-mat%2F0007184%2Ccond-mat%2F0007083%2Ccond-mat%2F0007474%2Ccond-mat%2F0007109%2Ccond-mat%2F0007442%2Ccond-mat%2F0007408%2Ccond-mat%2F0007388%2Ccond-mat%2F0007379%2Ccond-mat%2F0007343%2Ccond-mat%2F0007346%2Ccond-mat%2F0007458%2Ccond-mat%2F0007207%2Ccond-mat%2F0007159%2Ccond-mat%2F0007310%2Ccond-mat%2F0007004%2Ccond-mat%2F0007122%2Ccond-mat%2F0007240%2Ccond-mat%2F0007414%2Ccond-mat%2F0007480%2Ccond-mat%2F0007274%2Ccond-mat%2F0007384%2Ccond-mat%2F0007340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Library Design in Combinatorial Chemistry by Monte Carlo Methods"}, "summary": "Strategies for searching the space of variables in combinatorial chemistry\nexperiments are presented, and a random energy model of combinatorial chemistry\nexperiments is introduced. The search strategies, derived by analogy with the\ncomputer modeling technique of Monte Carlo, effectively search the variable\nspace even in combinatorial chemistry experiments of modest size. Efficient\nimplementations of the library design and redesign strategies are feasible with\ncurrent experimental capabilities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0007148%2Ccond-mat%2F0007403%2Ccond-mat%2F0007412%2Ccond-mat%2F0007171%2Ccond-mat%2F0007039%2Ccond-mat%2F0007019%2Ccond-mat%2F0007031%2Ccond-mat%2F0007383%2Ccond-mat%2F0007114%2Ccond-mat%2F0007433%2Ccond-mat%2F0007001%2Ccond-mat%2F0007478%2Ccond-mat%2F0007036%2Ccond-mat%2F0007312%2Ccond-mat%2F0007487%2Ccond-mat%2F0007203%2Ccond-mat%2F0007073%2Ccond-mat%2F0007434%2Ccond-mat%2F0007113%2Ccond-mat%2F0007332%2Ccond-mat%2F0007070%2Ccond-mat%2F0007168%2Ccond-mat%2F0007303%2Ccond-mat%2F0007357%2Ccond-mat%2F0007430%2Ccond-mat%2F0007411%2Ccond-mat%2F0007509%2Ccond-mat%2F0007270%2Ccond-mat%2F0007491%2Ccond-mat%2F0007189%2Ccond-mat%2F0007078%2Ccond-mat%2F0007095%2Ccond-mat%2F0007256%2Ccond-mat%2F0007117%2Ccond-mat%2F0007285%2Ccond-mat%2F0007322%2Ccond-mat%2F0007221%2Ccond-mat%2F0007463%2Ccond-mat%2F0007053%2Ccond-mat%2F0007489%2Ccond-mat%2F0007375%2Ccond-mat%2F0007420%2Ccond-mat%2F0007381%2Ccond-mat%2F0007238%2Ccond-mat%2F0007098%2Ccond-mat%2F0007308%2Ccond-mat%2F0007429%2Ccond-mat%2F0007007%2Ccond-mat%2F0007426%2Ccond-mat%2F0007316%2Ccond-mat%2F0007435%2Ccond-mat%2F0007136%2Ccond-mat%2F0007362%2Ccond-mat%2F0007205%2Ccond-mat%2F0007208%2Ccond-mat%2F0007199%2Ccond-mat%2F0007210%2Ccond-mat%2F0007064%2Ccond-mat%2F0007043%2Ccond-mat%2F0007222%2Ccond-mat%2F0007492%2Ccond-mat%2F0007060%2Ccond-mat%2F0007330%2Ccond-mat%2F0007472%2Ccond-mat%2F0007482%2Ccond-mat%2F0007160%2Ccond-mat%2F0007137%2Ccond-mat%2F0007321%2Ccond-mat%2F0007289%2Ccond-mat%2F0007390%2Ccond-mat%2F0007329%2Ccond-mat%2F0007446%2Ccond-mat%2F0007445%2Ccond-mat%2F0007345%2Ccond-mat%2F0007121%2Ccond-mat%2F0007376%2Ccond-mat%2F0007215%2Ccond-mat%2F0007288%2Ccond-mat%2F0007278%2Ccond-mat%2F0007184%2Ccond-mat%2F0007083%2Ccond-mat%2F0007474%2Ccond-mat%2F0007109%2Ccond-mat%2F0007442%2Ccond-mat%2F0007408%2Ccond-mat%2F0007388%2Ccond-mat%2F0007379%2Ccond-mat%2F0007343%2Ccond-mat%2F0007346%2Ccond-mat%2F0007458%2Ccond-mat%2F0007207%2Ccond-mat%2F0007159%2Ccond-mat%2F0007310%2Ccond-mat%2F0007004%2Ccond-mat%2F0007122%2Ccond-mat%2F0007240%2Ccond-mat%2F0007414%2Ccond-mat%2F0007480%2Ccond-mat%2F0007274%2Ccond-mat%2F0007384%2Ccond-mat%2F0007340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strategies for searching the space of variables in combinatorial chemistry\nexperiments are presented, and a random energy model of combinatorial chemistry\nexperiments is introduced. The search strategies, derived by analogy with the\ncomputer modeling technique of Monte Carlo, effectively search the variable\nspace even in combinatorial chemistry experiments of modest size. Efficient\nimplementations of the library design and redesign strategies are feasible with\ncurrent experimental capabilities."}, "authors": ["Marco Falcioni", "Michael W. Deem"], "author_detail": {"name": "Michael W. Deem"}, "author": "Michael W. Deem", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.61.5948", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0007114v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0007114v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0007114v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0007114v1", "journal_reference": "Phys. Rev. E 61 (2000) 5948-5952", "doi": "10.1103/PhysRevE.61.5948", "fulltext": "Library Design in Combinatorial Chemistry by Monte Carlo Methods\nMarco Falcioni and Michael W. Deem\n\narXiv:cond-mat/0007114v1 [cond-mat.stat-mech] 6 Jul 2000\n\nChemical Engineering Department, University of California, Los Angeles, CA, 90095–1592\nStrategies for searching the space of variables in combinatorial chemistry experiments are presented,\nand a random energy model of combinatorial chemistry experiments is introduced. The search\nstrategies, derived by analogy with the computer modeling technique of Monte Carlo, effectively\nsearch the variable space even in combinatorial chemistry experiments of modest size. Efficient\nimplementations of the library design and redesign strategies are feasible with current experimental\ncapabilities.\n02.50.Ng, 05.10.Ln, 82.90.+j\n\npurity level can greatly affect the figure of merit [16]. In\naddition, the \"crystallinity\" of the material can affect the\nobserved figure of merit [17]. Finally, the method of nucleation or synthesis may affect the phase or morphology\nof the material and so affect the figure of merit [19].\nWe assume that the composition and non-composition\nvariables of each sample can be changed independently\n[1,14]. Then, instead of a grid search on the composition\nand non-composition variables, we consider choosing the\nvariables at random from the allowed values. We also\nconsider choosing the variables in a fashion that attempts\nto maximize the amount of information gained from the\nlimited number of samples screened, via a quasi-random,\nlow-discrepancy sequence [20].\nWe further consider performing multiple rounds of\nscreening, incorporating feedback as the experiment proceeds by treating the combinatorial chemistry experiment\nas a Monte Carlo in the laboratory. This leads to sampling the experimental figure of merit, E, proportional\nto exp(βE). If β is large, then the Monte Carlo procedure will seek out values of the composition and noncomposition variables that maximize the figure of merit.\nIf β is too large, however, the Monte Carlo procedure\nwill get stuck in relatively low-lying local maxima. The\nfirst round is initiated by choosing the composition and\nnon-composition variables at random from the allowed\nvalues. The variables are changed in succeeding rounds\nas dictated by the Monte Carlo procedure.\nTwo ways of changing the variables are considered:\nrandomly changing the variables of a randomly chosen\nsample a small amount and exchanging a subset of the\nvariables between two randomly chosen samples. These\nmoves are repeated until all the samples in a round have\nbeen modified. The values of the figure of merit for the\nproposed new samples are then measured. Whether to\naccept the newly proposed samples or to keep the current\nsamples for the next round is decided according to the\ndetailed balance acceptance criterion. For the random\nchange of one sample, we find the Metropolis acceptance\nprobability:\n\nI. INTRODUCTION\n\nThe goal of combinatorial materials discovery is to find\ncompositions of matter that maximize a specific material property [1–3], such as superconductivity [4], magnetoresistance [5], luminescence [6–8], ligand specificity\n[9], sensor response [10], or catalytic activity [2,11–16].\nThis problem can be reformulated as one of searching\na multi-dimensional space, with the material composition, impurity levels, and synthesis conditions as variables. The property to be optimized, the figure of merit,\nis generally an unknown function of the variables and can\nbe measured only experimentally.\nPresent approaches to combinatorial library design and\nscreening invariably perform a grid search in composition\nspace, followed by a \"steepest-ascent\" maximization of\nthe figure of merit. This procedure becomes inefficient in\nhigh-dimensional spaces or when the figure of merit is not\na smooth function of the variables, and its use has limited\nmost combinatorial chemistry experiments to ternary or\nquaternary compounds.\nIn this paper, we suggest new experimental protocols for searching the space of variables in combinatorial\nchemistry, exploiting an analogy between combinatorial\nmaterials discovery and Monte Carlo computer modeling methods. In Section II we discuss several of these\nstrategies for library design and redesign. In Section III\nwe introduce the Random Phase Volume Model that we\nwill use to compare the different methods. The effectiveness of different strategies is discussed in Section IV. We\nconclude in Section V.\n\nII. SAMPLING THE SPACE OF VARIABLES IN\nMATERIALS DISCOVERY\n\nSeveral variables can be manipulated in order to seek\nthe material with the optimal figure of merit. Material\ncomposition is certainly a variable. But also, film thickness [17] and deposition method [18] are variables for\nmaterials made in thin film form. The processing history, such as temperature, pressure, pH, and atmospheric\ncomposition, is a variable. The guest composition or im-\n\nacc(c → p) = min {1, exp [β (Eproposed − Ecurrent )]} .\n(1)\n\n1\n\n\fProposed samples that increase the figure of merit are always accepted; proposed samples that decrease the figure\nof merit are accepted with the Metropolis probability. Allowing the figure of merit occasionally to decrease is what\nallows samples to escape from local maxima. The random\ndisplacement of the d mole fraction variables, xi , is done\nin the (d − 1)-dimensional subspace orthogonal to the ddimensional vector (1, 1, . . . , 1). This procedure ensures\nPd\nthat the constraint\ni=1 xi = 1 is maintained. This\nsubspace is identified by the Gram-Schmidt procedure.\nMoves that violate the constraint xi ≥ 0 are rejected.\nMoves that lead to invalid values of the non-composition\nvariables are also rejected. For the swapping move applied to samples i and j, we find the modified acceptance\nprobability:\n\u001a\n\u0014 \u0012\nj\ni\nacc(c → p) = min 1, exp β Eproposed\n+ Eproposed\n\u0013\u0015\u001b\nj\ni\n. (2)\n− Ecurrent\n− Ecurrent\n\ntial library of samples, measuring the initial figures of\nmerit, changing the variables of each sample a small random amount or swapping subsets of the variables between\npairs of samples, constructing the proposed new library\nof samples, measuring the figures of merit of the proposed new samples, accepting or rejecting each of the proposed new samples, and performing parallel tempering\nexchanges. Following rounds of combinatorial chemistry\nrepeat these steps, starting with making changes to the\ncurrent values of the composition and non-composition\nvariables. These steps are repeated for as many rounds\nas desired, or until maximal figures of merit are found.\nWe have chosen to sample the figure of merit by Monte\nCarlo, rather than to optimize it globally by some other\nmethod, for several reasons. First, Monte Carlo is an\neffective stochastic optimization method. Second, simple global optimization may be misleading since concerns\nsuch as patentability, cost of materials, and ease of synthesis are not usually included in the experimental figure\nof merit. Moreover, the screen that is most easily performed in the laboratory, the \"primary screen,\" is usually\nonly roughly correlated with the true figure of merit. Indeed, after finding materials that look promising based\nupon the primary screen, experimental secondary and\ntertiary screens are usually performed to identify that\nmaterial which is truly optimal. Third, it might be advantageous to screen for several figures of merit at once.\nFor all of these reasons, sampling by Monte Carlo to produce several candidate materials is preferred over global\noptimization.\n\nFig. 1a shows one round of a Monte Carlo procedure.\nThe parameter β is not related to the thermodynamic\ntemperature of the experiment and should be optimized\nfor best efficiency. The characteristic sizes of the random\nchanges in the composition and non-composition variables are also parameters that should be optimized.\nIf the number of composition and non-composition\nvariables is too great, or if the figure of merit changes\nwith the variables in a too-rough fashion, normal Monte\nCarlo will not achieve effective sampling. Parallel tempering is a natural extension of Monte Carlo that is used\nto study statistical [21], spin glass [22], and molecular [23]\nsystems with rugged energy landscapes. Our most powerful protocol incorporates the method of parallel tempering for changing the system variables. In parallel tempering, a fraction of the samples are updated by Monte\nCarlo with parameter β1 , a fraction by Monte Carlo with\nparameter β2 , and so on. At the end of each round, samples are randomly exchanged between the groups with\ndifferent β's, as shown in Fig. 1b. The acceptance probability for exchanging two samples is\nacc(c → p) = min {1, exp [∆β∆E]} ,\n\nIII. THE RANDOM PHASE VOLUME MODEL\n\nThe effectiveness of these protocols is demonstrated\nby combinatorial chemistry experiments as simulated by\nthe Random Phase Volume Model. The Random Phase\nVolume Model is not fundamental to the protocols; it is\nintroduced as a simple way to test, parameterize, and\nvalidate the various searching methods. The model relates the figure of merit to the composition and noncomposition variables in a statistical way. The model\nis fast enough to allow for validation of the proposed\nsearching methods on an enormous number of samples,\nyet possesses the correct statistics for the figure-of-merit\nlandscape. The d-dimensional vector of composition mole\nfractions is denoted by x. The composition mole fractions\nare non-negative and sum to unity, and so the allowed\ncompositions are constrained to lie within a simplex in d\ndimensions. For the familiar ternary system, this simplex\nis an equilateral triangle. The composition variables are\ngrouped into phases centered around Nx points xα randomly placed within the allowed composition range (the\nphases form a Voronoi diagram [24], see Fig. 2). The\nmodel is defined for any number of composition variables,\nand the number of phase points is defined by requiring\n\n(3)\n\nwhere ∆β is the difference in the values of β between\nthe two groups, and ∆E is the difference in the figures\nof merit between the two samples. It is important to\nnotice that this exchange step does not involve any extra screening compared to Monte Carlo and is, therefore,\n\"free\" in terms of experimental costs. This step is, however, dramatically effective at facilitating the protocol to\nescape from local maxima. The number of different systems and the temperatures of each system are parameters\nthat must be optimized.\nTo summarize, the first round of combinatorial chemistry consists of the following steps: constructing the ini2\n\n\fThe total number of samples whose figure of merit will\nbe measured is fixed at M = 100, 000, so that all protocols have the same experimental cost. The single pass\nprotocols Grid, Random, and LDS are considered. For\nthe Grid method, we define Mx = M (d−1)/(d−1+b) and\nMz = M b/(d−1+b) . The grid spacing of the composition\n1/(d−1)\nvariables is ζx = (Vd /Mx )\n, where\n√\nd\nVd =\n(6)\n(d − 1)!\n\nthe average spacing between phase points to be ξ = 0.25.\nTo avoid edge effects, additional points are added in a\nbelt of width 2ξ around the simplex of allowed compositions. The figure of merit should change dramatically between composition phases. Moreover, within each phase\nα, the figure of merit should also vary with y = x − xα\ndue to crystallinity effects such as crystallite size, intergrowths, defects, and faulting [17]. In addition, the noncomposition variables should also affect the measured figure of merit. The non-composition variables are denoted\nby the b-dimensional vector z, with each component constrained to fall within the range [−1, 1] without loss of\ngenerality. There can be any number of non-composition\nvariables. The figure of merit depends on the composition and non-composition variables in a correlated fashion, and so the non-composition variables also fall within\nNz \"z-phases\" defined in the space of composition variables. There are a factor of 10 fewer non-composition\nphases than composition phases. The functional form of\nthe model when x is in composition phase α and noncomposition-phase γ is\n\nis the volume of the allowed composition simplex. Note\nthat the distance from the centroid of the simplex to the\nclosest point on the boundary of the simplex is\n1\n.\n(7)\nRd =\n1/2\n[d(d − 1)]\n\nThe spacing for each component of the non-composition\n1/b\nvariables is ζz = 2/Mz . For the LDS method, different quasi-random sequences are used for the composition\nand non-composition variables. The feedback protocols\nMonte Carlo, Monte Carlo with swap, and Parallel Tempering are considered. The Monte Carlo parameters were\noptimized on test cases. It was optimal to perform 100\nrounds of 1,000 samples with β = 2 for d = 3 and β = 1\nfor d = 4 or 5, and ∆x = 0.1Rd and ∆z = 0.12 for\nthe maximum random displacement in each component.\nThe swapping move consisted of an attempt to swap all\nof the non-composition values between the two chosen\nsamples, and it was optimal to use Pswap ≃ 0.1 for the\nprobability of a swap versus a regular random displacement. For Parallel Tempering it was optimal to perform\n100 rounds with 1,000 samples, divided into three subsets: 50 samples at β1 = 50, 500 samples at β2 = 10,\nand 450 samples at β3 = 1. The 50 samples at large β\nessentially perform a \"steepest-ascent\" optimization and\nhave smaller ∆x = 0.01Rd and ∆z = 0.012.\nThe figures of merit found by the protocols are shown\nin Fig. 3. The Random and LDS protocols find better solutions than does Grid in one round of experiment. More\nimportantly, the Monte Carlo methods have a tremendous advantage over one pass methods, especially as the\nnumber of variables increases, with Parallel Tempering\nthe best method. The Monte Carlo methods, in essence,\ngather more information about how best to search the\nvariable space with each succeeding round. This feedback\nmechanism proves to be effective even for the relatively\nsmall total sample size of 100,000 considered here. We\nexpect that the advantage of the Monte Carlo methods\nwill become even greater for larger sample sizes. Note\nthat in cases such as catalytic activity, sensor response,\nor ligand specificity [25], the experimental figure of merit\nwould likely be exponential in the values shown in Fig. 3,\nso that the success of the Monte Carlo methods would be\neven more dramatic. A better calibration of the parameters in Eq. 4 may be possible as more data becomes\navailable in the literature.\n\nE(x, z) = Uα\n+σx\n\nq\nX\n\nk=1\n\n1\u0010\n+ Wγ\n2\nq\nX\n+σz\nk=1\n\nd\nX\n\nfi1 ...ik ξx−k Ai1 ...ik yi1 yi2 . . . yik\n\nb\nX\n\n\u0011\n(γk)\nfi1 ...ik ξz−k Bi1 ...ik zi1 zi2 . . . zik , (4)\n\n(αk)\n\ni1 ≥...≥ik =1\n\ni1 ≥...≥ik =1\n\nwhere fi1 ...ik is a constant symmetry factor, ξx and ξz are\n(αk)\n(γk)\nconstant scale factors, and Uα , Wγ , Ai1 ...ik , and Bi1 ...ik\nare random Gaussian variables with unit variance. In\nmore detail, the symmetry factor is given by\nfi1 ...ik = Ql\n\nk!\n\ni=1\n\noi !\n\n,\n\n(5)\n\nwhere l is the number of distinct integer values in the set\n{i1 , . . . , ik }, and oi is the number of times that distinct\nvalue\nPl i is repeated in the set. Note that 1 ≤ l ≤ k and\ni=1 oi = k. The scale factors are chosen so that each\nterm in the multinomial contributes roughly the same\namount: ξx = ξ/2 and ξz = (hz 6 i/hz 2 i)1/4 = (3/7)1/4 .\nThe σx and σz are chosen so that the multinomial, crystallinity terms contribute 40% as much as the constant,\nphase terms on average. For both multinomials q = 6.\nAs Fig. 2 shows, the Random Phase Volume Model describes a rugged figure of merit landscape, with subtle\nvariations, local maxima, and discontinuous boundaries.\nIV. RESULTS\n\nSix different search protocols are tested with increasing\nnumbers of composition and non-composition variables.\n3\n\n\f[11] F. M. Menger, A. V. Eliseev, and V. A. Migulin, J. Org.\nChem. 60, 6666 (1995).\n[12] K. Burgess, H.-J. Lim, A. M. Porte, and G. A. Sulikowski,\nAngew. Chem. Int. Ed. 35, 220 (1996).\n[13] B. M. Cole, K. D. Shimizu, C. A. Krueger, J. P. A. Harrity, M. L. Snapper, and A. H. Hoveyda, Angew. Chem.\nInt. Ed. 35, 1668 (1996).\n[14] D. E. Akporiaye, I. M. Dahl, A. Karlsson, and R. Wendelbo, Angew. Chem. Int. Ed. 37, 609 (1998).\n[15] E. Reddington, A. Sapienza, B. Gurau, R. Viswanathan,\nS. Sarangapani, E. S. Smotkin, and T. E. Mallouk, Science 280, 1735 (1998).\n[16] P. Cong, R. D. Doolen, Q. Fan, D. M. Giaquinta, S.\nGuan, E. W. McFarland, D. M. Poojary, K. Self, H. W.\nTurber, and W. H. Weinberg, Angew. Chem. Int. Ed. 38,\n484 (1999).\n[17] R. B. van Dover, L. F. Schneemeyer, and R. M. Fleming,\nNature 392, 162 (1998).\n[18] T. Novet, D. C. Johnson, and L. Fister, Adv. Chem. Ser.\n245, 425 (1995).\n[19] S. I. Zones, Y. Nakagawa, G. S. Lee, C. Y. Chen, and L.\nT. Yuen, Micropor. Mesopor. Mat. 21, 199 (1998).\n[20] P. Bratley, B. L. Fox, and H. Niederreiter, ACM Trans.\nMath. Software 20, 494 (1994).\n[21] C. J. Geyer, in Computing Science and Statistics: Proceedings of the 23rd Symposium on the Interface (American Statistical Association, New York, 1991), pp. 156–\n163.\n[22] E. Marinari, G. Parisi, and J. Ruiz-Lorenzo, in Spin\nGlasses and Random Fields, Vol. 12 of Directions in Condensed Matter Physics, edited by A. Young (World Scientific, Singapore, 1998), pp. 59–98.\n[23] M. Falcioni and M. W. Deem, J. Chem. Phys. 111, 1754\n(1999).\n[24] R. Sedgewick, Algorithms, 2 ed. (Addison-Wesley, New\nYork, 1988), Chap. 28, p. 408.\n[25] L. D. Bogarad and M. W. Deem, Proc. Natl. Acad. Sci.\nUSA 96, 2591 (1999).\n\nV. CONCLUSION\n\nTo conclude, the experimental challenges in combinatorial chemistry appear to lie mainly in the screening\nmethods and in the technology for the creation of the\nlibraries. The theoretical challenges, on the other hand,\nappear to lie mainly in the library design and redesign\nstrategies. We have addressed this second question via\nan analogy with Monte Carlo computer simulation, and\nwe have introduced the Random Phase Volume Model to\ncompare various strategies. We find the multiple-round,\nMonte Carlo protocols to be especially effective on the\nmore difficult systems with larger numbers of composition and non-composition variables.\nAn efficient implementation of the search strategy is\nfeasible with existing library creation technology. Moreover \"closing the loop\" between library design and redesign is achievable with the same database technology\ncurrently used to track and record the data from combinatorial chemistry experiments. These multiple-round\nprotocols, when combined with appropriate robotic controls, should allow the practical application of combinatorial chemistry to more complex and interesting systems.\n\nACKNOWLEDGMENT\n\nThis research was supported by the National Science\nFoundation through grant number CTS–9702403.\n\n[1] M. C. Pirrung, Chem. Rev. 97, 473 (1997).\n[2] W. H. Weinberg, B. Jandeleit, K. Self, and H. Turner,\nCurr. Opin. Chem. Bio. 3, 104 (1998).\n[3] E. W. McFarland and W. H. Weinberg, TIBTECH 17,\n107 (1999).\n[4] X.-D. Xiang, X. Sun, G. Briceño, Y. Lou, K.-A. Wang,\nH. Chang, W. G. Wallace-Freedman, S.-W. Chang, and\nP. G. Schultz, Science 268, 1738 (1995).\n[5] G. Briceño, H. Chang, X. Sun, P. G. Schultz, and X.-D.\nXiang, Science 270, 273 (1995).\n[6] E. Danielson, J. H. Golden, E. W. McFarland, C. M.\nReaves, W. H. Weinberg, and X. D. Wu, Nature 389,\n944 (1997).\n[7] E. Danielson, M. Devenney, D. M. Giaquinta, J. H.\nGolden, R. C. Haushalter, E. W. McFarland, D. M. Poojary, C. M. Reaves, W. H. Weinberg, and X. D. Wu,\nScience 279, 837 (1988).\n[8] J. Wang, Y. Yoo, C. Gao, I. Takeuchi, X. Sun, H. Chang,\nX.-D. Xiang, and P. G. Schultz, Science 279, 1712 (1998).\n[9] M. B. Francis, T. F. Jamison, and E. N. Jacobsen, Curr.\nOpin. Chem. Biol. 2, 422 (1998).\n[10] T. A. Dickinson and D. R. Walt, Anal. Chem. 69, 3413\n(1997).\n\na\n\nb\nMonte Carlo\nSelect\n\nParallel Tempering\n\nMC at β1\n\nMC at β2\n\nScreen\nMetropolis at β\n\nSwap\n\nFIG. 1. a) One Monte Carlo round with 10 samples. b)\nOne Parallel Tempering round with 5 samples at β1 and 5\nsamples at β2 .\n\n4\n\n\fMax E\n\nMin E\nFIG. 2. The Random Phase Volume Model. The model\nis shown for the case of three composition variables and one\nnon-composition variable. The boundaries of the x phases are\nevident by the sharp discontinuities in the figure of merit. To\ngenerate this figure, the z variable was held constant. The\nboundaries of the z phases are shown as thin dark lines.\n\nGrid\nRandom\nLDS\nMonte Carlo\nMC Swap\nParallel Tempering\n\n2\n\nX5Z4\n\nX5Z3\n\nX5Z2\nX4Z3\n\nX4Z2\n\nX3Z2\n\nX4Z1\nX5Z1\n\nX5Z0\n\nX4Z0\n\nX3Z1\n\n1\n\nX3Z0\n\nRelative Figure of Merit\n\n3\n\nNumber of Components\nFIG. 3. The maximum figure of merit found with different\nprotocols on systems with different number of composition\n(x) and non-composition (z) variables. The results are scaled\nto the maximum found by the Grid searching method. Each\nvalue is averaged over scaled results on 10 different instances\nof the Random Phase Volume Model with different random\nphases. The Monte Carlo methods are especially effective\non the systems with larger number of variables, where the\nmaximal figures of merit are more difficult to locate.\n\n5\n\n\f"}