{"id": "http://arxiv.org/abs/cond-mat/0301461v1", "guidislink": true, "updated": "2003-01-23T21:00:13Z", "updated_parsed": [2003, 1, 23, 21, 0, 13, 3, 23, 0], "published": "2003-01-23T21:00:13Z", "published_parsed": [2003, 1, 23, 21, 0, 13, 3, 23, 0], "title": "Mode Repulsion and Mode Coupling in Random Lasers", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0301552%2Ccond-mat%2F0301373%2Ccond-mat%2F0301017%2Ccond-mat%2F0301187%2Ccond-mat%2F0301540%2Ccond-mat%2F0301336%2Ccond-mat%2F0301076%2Ccond-mat%2F0301406%2Ccond-mat%2F0301045%2Ccond-mat%2F0301324%2Ccond-mat%2F0301286%2Ccond-mat%2F0301345%2Ccond-mat%2F0301423%2Ccond-mat%2F0301059%2Ccond-mat%2F0301356%2Ccond-mat%2F0301052%2Ccond-mat%2F0301206%2Ccond-mat%2F0301536%2Ccond-mat%2F0301391%2Ccond-mat%2F0301402%2Ccond-mat%2F0301430%2Ccond-mat%2F0301090%2Ccond-mat%2F0301018%2Ccond-mat%2F0301355%2Ccond-mat%2F0301449%2Ccond-mat%2F0301154%2Ccond-mat%2F0301433%2Ccond-mat%2F0301268%2Ccond-mat%2F0301006%2Ccond-mat%2F0301068%2Ccond-mat%2F0301282%2Ccond-mat%2F0301136%2Ccond-mat%2F0301298%2Ccond-mat%2F0301461%2Ccond-mat%2F0301149%2Ccond-mat%2F0301054%2Ccond-mat%2F0301195%2Ccond-mat%2F0301445%2Ccond-mat%2F0301523%2Ccond-mat%2F0301216%2Ccond-mat%2F0301475%2Ccond-mat%2F0301546%2Ccond-mat%2F0301517%2Ccond-mat%2F0301180%2Ccond-mat%2F0301365%2Ccond-mat%2F0301310%2Ccond-mat%2F0301119%2Ccond-mat%2F0301291%2Ccond-mat%2F0301606%2Ccond-mat%2F0301130%2Ccond-mat%2F0301418%2Ccond-mat%2F0301147%2Ccond-mat%2F0301210%2Ccond-mat%2F0301213%2Ccond-mat%2F0301126%2Ccond-mat%2F0301143%2Ccond-mat%2F0301459%2Ccond-mat%2F0301175%2Ccond-mat%2F0301177%2Ccond-mat%2F0301488%2Ccond-mat%2F0301029%2Ccond-mat%2F0301020%2Ccond-mat%2F0301141%2Ccond-mat%2F0301125%2Ccond-mat%2F0301526%2Ccond-mat%2F0301413%2Ccond-mat%2F0301429%2Ccond-mat%2F0301279%2Ccond-mat%2F0301502%2Ccond-mat%2F0301397%2Ccond-mat%2F0301621%2Ccond-mat%2F0301554%2Ccond-mat%2F0301513%2Ccond-mat%2F0301493%2Ccond-mat%2F0301352%2Ccond-mat%2F0301293%2Ccond-mat%2F0301200%2Ccond-mat%2F0301234%2Ccond-mat%2F0301432%2Ccond-mat%2F0301390%2Ccond-mat%2F0301292%2Ccond-mat%2F0301145%2Ccond-mat%2F0301607%2Ccond-mat%2F0301359%2Ccond-mat%2F0301303%2Ccond-mat%2F0301284%2Ccond-mat%2F0301338%2Ccond-mat%2F0301063%2Ccond-mat%2F0301097%2Ccond-mat%2F0301525%2Ccond-mat%2F0301409%2Ccond-mat%2F0301560%2Ccond-mat%2F0301121%2Ccond-mat%2F0301557%2Ccond-mat%2F0301463%2Ccond-mat%2F0301019%2Ccond-mat%2F0301466%2Ccond-mat%2F0301243%2Ccond-mat%2F0301008%2Ccond-mat%2F0301530%2Ccond-mat%2F0301070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mode Repulsion and Mode Coupling in Random Lasers"}, "summary": "We studied experimentally and theoretically the interaction of lasing modes\nin random media. In a homogeneously broadened gain medium, cross gain\nsaturation leads to spatial repulsion of lasing modes. In an inhomogeneously\nbroadened gain medium, mode repulsion occurs in the spectral domain. Some\nlasing modes are coupled through photon hopping or electron absorption and\nreemission. Under pulsed pumping, weak coupling of two modes leads to\nsynchronization of their lasing action. Strong coupling of two lasing modes\nresults in anti-phased oscillations of their intensities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0301552%2Ccond-mat%2F0301373%2Ccond-mat%2F0301017%2Ccond-mat%2F0301187%2Ccond-mat%2F0301540%2Ccond-mat%2F0301336%2Ccond-mat%2F0301076%2Ccond-mat%2F0301406%2Ccond-mat%2F0301045%2Ccond-mat%2F0301324%2Ccond-mat%2F0301286%2Ccond-mat%2F0301345%2Ccond-mat%2F0301423%2Ccond-mat%2F0301059%2Ccond-mat%2F0301356%2Ccond-mat%2F0301052%2Ccond-mat%2F0301206%2Ccond-mat%2F0301536%2Ccond-mat%2F0301391%2Ccond-mat%2F0301402%2Ccond-mat%2F0301430%2Ccond-mat%2F0301090%2Ccond-mat%2F0301018%2Ccond-mat%2F0301355%2Ccond-mat%2F0301449%2Ccond-mat%2F0301154%2Ccond-mat%2F0301433%2Ccond-mat%2F0301268%2Ccond-mat%2F0301006%2Ccond-mat%2F0301068%2Ccond-mat%2F0301282%2Ccond-mat%2F0301136%2Ccond-mat%2F0301298%2Ccond-mat%2F0301461%2Ccond-mat%2F0301149%2Ccond-mat%2F0301054%2Ccond-mat%2F0301195%2Ccond-mat%2F0301445%2Ccond-mat%2F0301523%2Ccond-mat%2F0301216%2Ccond-mat%2F0301475%2Ccond-mat%2F0301546%2Ccond-mat%2F0301517%2Ccond-mat%2F0301180%2Ccond-mat%2F0301365%2Ccond-mat%2F0301310%2Ccond-mat%2F0301119%2Ccond-mat%2F0301291%2Ccond-mat%2F0301606%2Ccond-mat%2F0301130%2Ccond-mat%2F0301418%2Ccond-mat%2F0301147%2Ccond-mat%2F0301210%2Ccond-mat%2F0301213%2Ccond-mat%2F0301126%2Ccond-mat%2F0301143%2Ccond-mat%2F0301459%2Ccond-mat%2F0301175%2Ccond-mat%2F0301177%2Ccond-mat%2F0301488%2Ccond-mat%2F0301029%2Ccond-mat%2F0301020%2Ccond-mat%2F0301141%2Ccond-mat%2F0301125%2Ccond-mat%2F0301526%2Ccond-mat%2F0301413%2Ccond-mat%2F0301429%2Ccond-mat%2F0301279%2Ccond-mat%2F0301502%2Ccond-mat%2F0301397%2Ccond-mat%2F0301621%2Ccond-mat%2F0301554%2Ccond-mat%2F0301513%2Ccond-mat%2F0301493%2Ccond-mat%2F0301352%2Ccond-mat%2F0301293%2Ccond-mat%2F0301200%2Ccond-mat%2F0301234%2Ccond-mat%2F0301432%2Ccond-mat%2F0301390%2Ccond-mat%2F0301292%2Ccond-mat%2F0301145%2Ccond-mat%2F0301607%2Ccond-mat%2F0301359%2Ccond-mat%2F0301303%2Ccond-mat%2F0301284%2Ccond-mat%2F0301338%2Ccond-mat%2F0301063%2Ccond-mat%2F0301097%2Ccond-mat%2F0301525%2Ccond-mat%2F0301409%2Ccond-mat%2F0301560%2Ccond-mat%2F0301121%2Ccond-mat%2F0301557%2Ccond-mat%2F0301463%2Ccond-mat%2F0301019%2Ccond-mat%2F0301466%2Ccond-mat%2F0301243%2Ccond-mat%2F0301008%2Ccond-mat%2F0301530%2Ccond-mat%2F0301070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We studied experimentally and theoretically the interaction of lasing modes\nin random media. In a homogeneously broadened gain medium, cross gain\nsaturation leads to spatial repulsion of lasing modes. In an inhomogeneously\nbroadened gain medium, mode repulsion occurs in the spectral domain. Some\nlasing modes are coupled through photon hopping or electron absorption and\nreemission. Under pulsed pumping, weak coupling of two modes leads to\nsynchronization of their lasing action. Strong coupling of two lasing modes\nresults in anti-phased oscillations of their intensities."}, "authors": ["H. Cao", "Xunya Jiang", "Y. Ling", "J. Y. Xu", "C. M. Soukoulis"], "author_detail": {"name": "C. M. Soukoulis"}, "author": "C. M. Soukoulis", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.67.161101", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0301461v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0301461v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0301461v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0301461v1", "journal_reference": null, "doi": "10.1103/PhysRevB.67.161101", "fulltext": "Mode Repulsion and Mode Coupling in Random Lasers\n\narXiv:cond-mat/0301461v1 [cond-mat.dis-nn] 23 Jan 2003\n\nH. Caoa , Xunya Jiangb , Y. Linga , J.Y. Xua , C.M. Soukoulisb\na\n\nDepartment of Physics and Astronomy, Northwestern University,\n2145 Sheridan Road, Evanston, IL 60208-3112\n\nb\n\nAmes Laboratory-USDOE and Department of Physics and Astronomy,\nIowa State University, Ames, IA 50011\n\nAbstract\nWe studied experimentally and theoretically the interaction of lasing modes\nin random media. In a homogeneously broadened gain medium, cross gain\nsaturation leads to spatial repulsion of lasing modes. In an inhomogeneously\nbroadened gain medium, mode repulsion occurs in the spectral domain. Some\nlasing modes are coupled through photon hopping or electron absorption and\nreemission. Under pulsed pumping, weak coupling of two modes leads to\nsynchronization of their lasing action. Strong coupling of two lasing modes\nresults in anti-phased oscillations of their intensities.\n\nTypeset using REVTEX\n1\n\n\fA random laser is a special kind of laser whose feedback is due to disorder-induced scattering, as opposed to reflection of a conventional laser. Over the past few years, there have\nbeen many studies on random lasers with coherent feedback. [1–14] One important aspect of\na random laser is the interaction of the lasing modes, which has not been well understood.\n[5,15,16] As previously pointed out [10], adding optical gain to a random medium creates a\nnew path to study wave transport and localization. Because the modes of coherent random\nlasers are eigenstates of the random systems, the interaction of the lasing modes reflects the\ninteraction among the eigenstates. So far most studies on eigenstates of random systems are\nfocused on statistical properties such as the density of states and the distribution of spectral\nspacing between neighboring eigenstates. [17] However, there has been no detailed study\non the interaction between two eigenstates in a disordered system, e.g., the spatial overlap\nof two eigenstates and the photon hoping between them. Such microscopic information is\ncrucial to understanding the behavior of light in the random system. By studying the interaction of random lasing modes, we will gain some knowledge of the interaction among the\neigenstates of a disordered system. Furthermore, this study will provide an understanding\nof the escape channels for photons in an eigenstate, that is important to the localization\ntheory.\nIn this letter, we present experimental and theoretical studies on the interaction of modes\nin random lasers with coherent feedback. We find the interaction is rather complicated. On\none hand, most lasing modes repel each other either spatially or spectrally. On the other\nhand, some lasing modes are coupled. Energy exchange between the coupled modes leads\nto cooperated lasing phenomenon.\nThe spatial repulsion of lasing modes was first observed in the numerical simulation of\nrandom lasers. [5] It results from gain competition and spatial localization of the modes in\nan active random medium. The gain spectrum is assumed to be homogeneously broadened.\nIn a finite-sized random medium, the mode repulsion leads to a saturation in the number of\nlasing modes. [5] Experimentally we observed the number of lasing modes in micropatterned\nZnO polycrystalline films saturates at high pumping intensity. [18] The saturated number\n2\n\n\fof lasing modes increases linearly with the sample volume.\nIn random media with inhomogeneously broadened gain spectra, we observed a different\nkind of mode repulsion. The lasing modes repel each other in the spectral domain instead\nof the spatial domain. The disordered samples used in our experiment are poly(methyl\nmethacrylate) (PMMA) sheets containing rhodamine 640 perchlorate dye and titanium dioxide (TiO2 ) microparticles. The concentration of rhodamine 640 is about 10 mM. Each individual dye molecule's transition frequency is shifted by differing local strains and distortions\nin the immediate environment of the glassy host. This gives rise to a large inhomogeneous\nbroadening of the dye transition, which is confirmed by good fitting of the absorption band\ntail with a Gaussian profile (the error of Gaussian curve fitting is ten times smaller than that\nof Lorentzian curve fitting). The TiO2 particles have an average diameter of 0.4 μm. The\ndensity of the microparticles is ∼ 1.4 × 1012 cm−3 . The transport mean free path, measured\nin the coherent backscattering experiment, is 2.1 μm. [18]\nThe rhodamine 640 dye molecules are optically excited by the second harmonics of a\npulsed Nd:YAG laser (10 Hz repetition rate, 25 ps pulse width). The pump spot is about\n50 μm in diameter at the sample surface. The spectrum of emission from the sample is\nmeasured by a 0.5-meter spectrometer with a liquid nitrogen cooled CCD array detector.\nThe spectral resolution is 0.06 nm.\n\n3\n\n\fFIGURES\n\n(a)\n\nIntensity (arb. unit)\n\n2000\n\n1500\n\n1000\n\n500\n\n0\n620\n\n624\n\n628\n\n632\n\n636\n\nWavelength (nm)\n1.00\n\n(b)\n0.95\n\nC(∆λ)\n\n0.90\n\n0.85\n\n0.80\n\n0.75\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\n3.5\n\n∆λ (nm)\n\nFIG. 1. (a) Spectrum of laser emission from the PMMA containing dye and microparticles.\nThe incident pump pulse energy is 1.6 μJ. (b) Normalized spectral correlation function C(∆λ).\n\nBelow the lasing threshold, the emission spectrum is very broad. When the pumping\nintensity exceeds the threshold, discrete narrow peaks emerge in the emission spectrum.\nThe number of lasing modes increases with the pumping intensity. Eventually the spectral\ndensity of the lasing peaks becomes saturated. Namely, the wavelength spacing between\nadjacent lasing modes no longer decreases as the pumping intensity increases. New lasing\npeaks appear not in between the existing peaks but in the spectral region that is away from\nthe gain maximum and has few lasing peaks. The lasing spectrum, shown in Fig. 1 (a),\nreveals that the lasing peaks are more or less regularly spaced in wavelength. We calculated\nR\n\nR\n\nthe normalized spectral correlation function C(∆λ) ≡ I(λ) I(λ+∆λ)dλ/ [I(λ)]2 dλ, where\nI(λ) is the emission intensity at wavelength λ. Fig. 1 (b) shows the normalized spectral\ncorrelation function C(∆λ) obtained from the lasing spectrum in Fig. 1 (a). The periodic\n4\n\n\foscillation of C(∆λ) with ∆λ confirms the lasing modes are evenly distributed in wavelength.\nThe oscillation period gives the average separation between adjacent lasing modes, which is\n0.8 nm. Note that the minimum of C(∆λ) does not reach zero because the lasing peaks are\non top of a broad band of amplified spontaneous emission.\nRecently we developed a spectrally resolved speckle technique which gives the spatial\nprofile of individual lasing modes at the sample surface. [19] Using this technique, we find\nthe lasing modes in Fig. 1 (a) have different sizes. The radius of the lasing modes varies\nfrom 100 μm to 150 μm, which is larger than the radius of the pump spot. To acquire gain,\nthe lasing modes must overlap with the excitation area. This suggests most lasing modes\nspatially overlap with each other. Owing to a large inhomogeneous broadening of the dye\nmolecules, lasing can occur simultaneously in modes that are spatially overlapped, as long as\nthe frequency separation between the modes is larger than the homogeneous linewidth of the\ndye molecules. This is because a lasing mode interacts only with the dye molecules whose\ntransition frequency is in resonance with the lasing frequency, and depletes the population\ninversion of these dye molecules. As a result, a hole is burned in the gain spectrum, and its\nwidth is about twice of the homogeneous linewidth of the dye molecules. [20] Nevertheless,\nthe dye molecules, whose frequency is more than one homogeneous linewidth away from the\nfrequency of the lasing mode, are essentially unaffected by this lasing mode. They provide\noptical gain for other modes in the same area. Thus the frequency spacing of the lasing\nmodes is limited by the homogeneous linewidth of the dye molecules. At room temperature,\nthe homogeneous linewidth of rhodamine 640 dye molecules in PMMA is ∼ 0.5 nm. [21–23]\nThe linewidth of the hole burned by a lasing mode is about 1 nm, close to the wavelength\nseparation between adjacent lasing modes. This confirms the regular spectral spacing of\nthe lasing modes is caused by the hole burning of the inhomogeneously broadened gain\nspectrum. The spectral repulsion of lasing modes can only be observed when the excitation\narea is smaller than the spatial extent of lasing modes. When the pump area is much larger\nthan the size of lasing modes, there is no minimum frequency separation between adjacent\nlasing modes. This is because the lasing modes are not necessarily overlapped in space. If\n5\n\n\fthey are spatially separated, the lasing modes can have the same frequency.\nIn addition to mode repulsion, we also observed mode coupling in random lasers. Despite\nmost lasing modes in Fig. 1 (a) are well separated spectrally, we do see two or three lasing\nmodes partially overlapped in the spectrum, e.g. the two lasing modes centered at 626.9\nnm and 627.1 nm. Since their frequency separation is less than the homogeneous linewidth\nof the dye molecules, these two lasing modes interact with the same group of excited dye\nmolecules. The gain competition would not allow them to lase simultaneously unless they\n\nIntensity (arb. unit)\n\nare coupled, i.e., there is an energy exchange between the two modes.\n\n624\n\n625\n\n626\n\n627\n\n628\n\n629\n\nWavelength (nm)\n\nFIG. 2. Measured spectra of laser emission when the incident pump pulse energies are 0.61 μJ\nand 0.98 μJ. The spectra are shifted vertically for clarity. The solid lines highlight the growth of\ntwo coupled lasing modes.\n\nFigure 2 shows the growth of two coupled lasing modes with the pumping intensity. Just\nabove the lasing threshold, a relatively broad lasing peak appears in the emission spectrum.\nAs the pumping intensity increases, this lasing peak is slightly blue-shifted and split into\n6\n\n\ftwo narrow peaks. It seems initially the linewidth of the two lasing modes is larger than\ntheir spectral separation, thus they appear to be a single broad peak. As the optical gain\nincreases, the lasing peaks become narrower. When their linewidth is reduced to below their\nspectral separation, these two lasing modes can be spectrally resolved, leading to a splitting\nof the initial peak. We measured the temporal evolution of emission from these two modes\nwith a streak camera. Lasing in these two modes is synchronized, i.e., lasing starts and stops\nat the same time.\n\n6\n\n6.0x10\n\n6\n\n4.0x10\n\n6\n\n2.0x10\n\n6\n\nIE\n\n8.0x10\n\nAE\n\n728.5\n\n729.0\n\n729.5\n\n730.0\n\n730.5\n\nFrequency (THz)\n\n0.0\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nTime (ps)\n\nFIG. 3. Calculated amplitudes of electric field AE for two coupled lasing modes versus time.\nThe number of cells is 100. The pumping rate Pr = 4 × 106 s−1 . The pumping time is 15 ps. The\ninset are the calculated spectra for pumping rates of 2 × 106 s−1 (dashed line) and 4 × 106 s−1\n(solid line).\n\nTo understand the coupling of the random laser modes, we performed numerical simulations using the time-dependent model for random lasers. [5,11] The Maxwell's equations\nare coupled to the rate equations of electronic population. Because the coupled modes are\n7\n\n\fwithin one homogeneous line and interact with the same group of molecules, we can assume\nthe electronic energy levels are homogeneously broadened. The homogeneous linewidth is 5\nTHz. Temporal evolution of the electromagnetic field is obtained with the finite difference\ntime domain (FDTD) method. Fourier transform is used to obtain the lasing spectra. The\none-dimensional random system is made of binary layers with dielectric constants ǫ1 = 2.5\nand ǫ2 = 5.29. The layer thickness a = a0 (1 + Wa γ), b = b0 (1 + Wb γ), where a0 = 48 nm,\nWa = 0.1, b0 = 80 nm, Wb = 0.6, γ is a random value in the range [-1,1]. In the inset of\nFig. 3, we plot the calculated lasing spectra for a system of 100 pairs of binary layers at two\npumping rates. The pumping starts at t = 0 and stops at t = 15 ps. At a pumping rate\nPr = 2 × 106 s−1 , the spectrum has one relatively broad peak. This peak is split into two\nnarrow peaks at a pumping rate Pr = 4 × 106 s−1 . Figure 3 shows the temporal evolution\nof the amplitude of the electric field AE for the two lasing peaks. Laser pulses in these two\nmodes rise at the same time. The pulse duration is nearly identical. These results agree\nwith the experimental data.\nThe synchronization of the two lasing modes results from coupling. The quality factors\nof these two modes are different. Our previous study of random lasers demonstrates that\nlasing modes with different quality factors exhibit unsynchronized temporal behaviors. [11]\nThis conclusion holds only for non-interacting modes. However, lasing modes in a random\nmedium can be coupled through photons and electrons. Namely, photons can hop from one\nmode to another as long as these two modes have spatial and spectral overlap. In addition,\nphotons in one mode can be absorbed by electrons in the medium, which subsequently\nremit photons into another mode. To be more specific, let us consider two coupled modes\nA and B. The quality factor of mode A is higher than that of mode B. After pumping\nstarts, as optical gain increases, the lasing threshold for mode A is reached first. The\nelectromagnetic field of mode A increases quickly. When there are more photons in mode A\nthan in mode B, there is a net energy flow from mode A to mode B through photon hopping\nor electron absorption and reemission. This seeding increases the photon number of mode\nB and accelerates lasing process in mode B. Thus mode A provides additional pumping to\n8\n\n\fmode B. If the quality factor of mode B is not much lower than that of mode A, mode B\ncan reach the lasing threshold while mode A still builds up. That is why we observe the two\nmodes lase almost simultaneously. Similarly, when the pumping is stopped, photon number\nof mode B decreases faster than that of mode A due to higher loss rate of mode B. The\ndifference of photon numbers in these two modes leads to a net energy flow from mode A\nto mode B. Thus mode B provides an additional leak channel for mode A, and photons in\nmode A are drained faster. As a result, the two modes stop lasing at almost the same time.\nNext we increased the quality factors of the coupled modes by enlarging the system to\n120 pairs of binary layers. We also increased the pumping time to 25 ps to make the laser\npulses longer. As shown in Fig. 4, the dynamics of the coupled modes is very different from\nthat shown in Fig. 3. Laser light intensities in these two modes oscillate in time. Their\noscillations are 180◦ out of phase. Namely, when one mode reaches the maximum intensity,\nthe other mode is at the minimum intensity. These antiphased oscillations reveal energy\nexchange between the two coupled modes. From the numerical simulation, we find such\noscillations occur only when the coupled modes have high quality factors and the pumping\ntime is not too short. This is because photons must stay in the medium long enough so that\nthey are transferred back and forth between the coupled modes before escaping the system.\nThe oscillation period is inversely proportional to the energy exchange rate or the coupling\nconstant. The coupling of the two modes depends on their spectral and spatial overlap.\nThere are two coupling regimes. In the weak coupling regime, the coupling constant of the\ntwo modes is smaller than their decay rates. In the strong coupling regime, the coupling\nconstant is larger than the decay rates of the two modes. The oscillations occur only in the\nstrong coupling regime. In our current experiment with the three-dimensional (3D) random\nmedium, the quality factors of the lasing modes are too low to reach the strong coupling\nregime. The antiphased oscillations of the coupled modes could not be observed.\n\n9\n\n\fAE\n\n2.0x10\n\n7\n\n1.5x10\n\n7\n\n1.0x10\n\n7\n\n5.0x10\n\n6\n\n0.0\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\nTime (ps)\n\nFIG. 4. Calculated amplitudes of electric field AE for two coupled lasing modes versus time.\nThe number of cells is 120. The pumping time is 25 ps. The pumping rate Pr = 4 × 106 s−1 .\n\nTo confirm the spectral repulsion of lasing modes, we simulated random laser with inhomogeneously broadened gain spectrum. The inhomogeneous linewidth is 150 THz, 30 times\nof the homogeneous linewidth. To increase the spatial overlap of the eigenstates, we reduce\nthe randomness to Wa = 0 and Wb = 0.2 so that the modes are more extended spatially.\nThe size of the system is increased to 700 pairs of binary layers (∼ 100 μm). However, only\nthe central part of the system with the length 30 μm is pumped. Since the lasing modes\nmust overlap with the pumped region, they overlap with each other. At very high pumping\nrate, the lasing modes are almost regularly spaced in frequency. The spectral correlation\nfunction C(∆ν) exhibits periodic oscillation with ∆ν. The frequency separation of neighboring lasing modes is about 7 THz. It is much larger than the average frequency spacing of\n\n10\n\n\fthe eigenstates in the random system. This means most eigenstates do not lase even at very\nhigh pumping rate due to cross gain saturation. More specifically, there are about three\neigenstates within one homogeneous line. Cross gain saturation allows only one of them to\nlase. Thus the frequency spacing of the lasing modes is determined by the homogeneous\nlinewidth.\nFinally we increased the pumping time in our simulation. All the phenomena presented\nabove persist. Despite our experiments were performed with short pump pulses, our numerical simulation results confirm that mode repulsion and mode coupling exist at longer\npumping time.\nIn conclusion, we studied the interaction of lasing modes in random media. In a homogeneously broadened gain medium, cross gain saturation leads to spatial repulsion of lasing\nmodes. In an inhomogeneously broadened gain medium, mode repulsion occurs in the spectral domain. Some lasing modes are coupled through photon hopping or electron absorption\nand remission. Under pulsed pumping, weak coupling of two modes leads to synchronization\nof their lasing action. Strong coupling of two lasing modes results in anti-phased oscillations\nof their intensities.\nAmes Laboratory is operated for the U.S. Department of Energy by Iowa State University\nunder Contract No. W07405-Eng-82. This work is supported partially by National Science\nFoundation under Grant No. DMR-0093949. H.C. acknowledge support from the David and\nLucille Packard Foundation and the Alfred P. Sloan Foundation.\n\n11\n\n\fREFERENCES\n[1] H. Cao, Y.G. Zhao, S.T. Ho, E.W. Seelig, Q.H. Wang, and R.P.H. Chang, Phys. Rev.\nLett. 82, 2278 (1999).\n[2] S.V. Frolov, Z.V. Vardeny, K. Yoshino, A. Zakhidov, and R.H. Baughman, Phys. Rev.\nB 59, R5284 (1999).\n[3] M. Patra, H. Schomerus, and C.W.J. Beenakker, Phys. Rev. A 61, 23810 (2000).\n[4] H. Cao, J.Y. Xu, D.Z. Zhang, S.-H. Chang, S.T. Ho, E.W. Seelig, X. Liu and R.P.H.\nChang, Phys. Rev. Lett. 84, 5584 (2000).\n[5] X. Jiang, and C.M. Soukoulis, Phys. Rev. Lett. 85, 70 (2000).\n[6] H. Cao, Y. Ling, J.Y. Xu, C.Q. Cao, and P. Kumar, Phys. Rev. Lett. 86, 4524 (2001).\n[7] R.C. Polson, A. Chipouline, and V. Vardeny, Adv. Mater. 13, 760 (2001).\n[8] C. Vanneste, and P. Sebbah, Phys. Rev. Lett. 87, 183903 (2001).\n[9] A.L. Burin, M. Ratner, H. Cao, and R.P.H. Chang, Phys. Rev. Lett. 87, 215503 (2001).\n[10] X. Jiang, and C.M. Soukoulis, Phys. Rev. E 65 R25601 (2002).\n[11] C.M. Soukoulis, X. Jiang, J.Y. Xu, and H. Cao, Phys. Rev. B 65, R41103 (2002).\n[12] A.L. Burin, M. Ratner, H. Cao, and S.-H. Chang, Phys. Rev. Lett. 88, 93904 (2002).\n[13] R.C. Polson, M.E. Raikh, and Z.V. Vardeny, Comptes Rendus de l'Academie des Sciences, Serie IV (Physique, Astrophysique) 3, 509 (2002).\n[14] V.M. Apalkov, M.E. Raikh, and B. Shapiro, Phys. Rev. Lett. 89, 16802 (2002).\n[15] Ch.M. Briskina, V.M. Markushev, and N.E. Ter-Gabrielyan, Quantum Electron. 26,\n923 (1996).\n[16] T.Sh. Misirpashaev, and C.W.J. Beenakker, Phys. Rev. A 57, 2041 (1998).\n12\n\n\f[17] C.W.J. Beenakker, Rev. Mod. Phys. 69, 731 (1997).\n[18] Y. Ling, H. Cao, A. L. Burin, M. A. Ratner, X. Liu, and R. P. H. Chang, Phys. Rev. A\n64, 63808 (2001).\n[19] H. Cao, Y. Ling, J.Y. Xu, and A.L. Burin. Phys. Rev. E., 66, R25601 (2002).\n[20] A.E. Siegman, Lasers (University Science Books, Mill Valley, 1986).\n[21] A. Elschner, L.R. Narasimhan, and M.D. Fayer, Chem. Phys. Lett. 171, 19 (1990).\n[22] R.I. Billmers, J. Davis, and M. Squicciarini, Opt. Commun. 85, 26 (1991).\n[23] B.J. Baer, R.A. Crowell, and E.L. Chronister, Chem. Phys. Lett. 237, 380 (1995).\n\n13\n\n\f"}