{"id": "http://arxiv.org/abs/cond-mat/0310178v1", "guidislink": true, "updated": "2003-10-08T15:41:33Z", "updated_parsed": [2003, 10, 8, 15, 41, 33, 2, 281, 0], "published": "2003-10-08T15:41:33Z", "published_parsed": [2003, 10, 8, 15, 41, 33, 2, 281, 0], "title": "Magnetic Anisotropy of SrCu$_2$(BO$_3$)$_2$ System as Revealed by X-Band\n  ESR", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0310603%2Ccond-mat%2F0310666%2Ccond-mat%2F0310041%2Ccond-mat%2F0310201%2Ccond-mat%2F0310060%2Ccond-mat%2F0310343%2Ccond-mat%2F0310120%2Ccond-mat%2F0310285%2Ccond-mat%2F0310416%2Ccond-mat%2F0310635%2Ccond-mat%2F0310715%2Ccond-mat%2F0310314%2Ccond-mat%2F0310188%2Ccond-mat%2F0310342%2Ccond-mat%2F0310619%2Ccond-mat%2F0310072%2Ccond-mat%2F0310374%2Ccond-mat%2F0310220%2Ccond-mat%2F0310679%2Ccond-mat%2F0310414%2Ccond-mat%2F0310545%2Ccond-mat%2F0310616%2Ccond-mat%2F0310420%2Ccond-mat%2F0310737%2Ccond-mat%2F0310254%2Ccond-mat%2F0310211%2Ccond-mat%2F0310360%2Ccond-mat%2F0310387%2Ccond-mat%2F0310247%2Ccond-mat%2F0310098%2Ccond-mat%2F0310313%2Ccond-mat%2F0310404%2Ccond-mat%2F0310657%2Ccond-mat%2F0310361%2Ccond-mat%2F0310160%2Ccond-mat%2F0310447%2Ccond-mat%2F0310238%2Ccond-mat%2F0310510%2Ccond-mat%2F0310119%2Ccond-mat%2F0310618%2Ccond-mat%2F0310226%2Ccond-mat%2F0310204%2Ccond-mat%2F0310710%2Ccond-mat%2F0310083%2Ccond-mat%2F0310538%2Ccond-mat%2F0310334%2Ccond-mat%2F0310523%2Ccond-mat%2F0310634%2Ccond-mat%2F0310732%2Ccond-mat%2F0310139%2Ccond-mat%2F0310202%2Ccond-mat%2F0310004%2Ccond-mat%2F0310076%2Ccond-mat%2F0310384%2Ccond-mat%2F0310742%2Ccond-mat%2F0310582%2Ccond-mat%2F0310179%2Ccond-mat%2F0310300%2Ccond-mat%2F0310546%2Ccond-mat%2F0310359%2Ccond-mat%2F0310330%2Ccond-mat%2F0310539%2Ccond-mat%2F0310595%2Ccond-mat%2F0310214%2Ccond-mat%2F0310474%2Ccond-mat%2F0310476%2Ccond-mat%2F0310535%2Ccond-mat%2F0310588%2Ccond-mat%2F0310518%2Ccond-mat%2F0310185%2Ccond-mat%2F0310019%2Ccond-mat%2F0310328%2Ccond-mat%2F0310778%2Ccond-mat%2F0310407%2Ccond-mat%2F0310526%2Ccond-mat%2F0310322%2Ccond-mat%2F0310070%2Ccond-mat%2F0310408%2Ccond-mat%2F0310178%2Ccond-mat%2F0310681%2Ccond-mat%2F0310429%2Ccond-mat%2F0310036%2Ccond-mat%2F0310080%2Ccond-mat%2F0310233%2Ccond-mat%2F0310453%2Ccond-mat%2F0310194%2Ccond-mat%2F0310775%2Ccond-mat%2F0310612%2Ccond-mat%2F0310641%2Ccond-mat%2F0310200%2Ccond-mat%2F0310587%2Ccond-mat%2F0310128%2Ccond-mat%2F0310503%2Ccond-mat%2F0310389%2Ccond-mat%2F0310050%2Ccond-mat%2F0310466%2Ccond-mat%2F0310633%2Ccond-mat%2F0310227%2Ccond-mat%2F0310393%2Ccond-mat%2F0310158%2Ccond-mat%2F0310654&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnetic Anisotropy of SrCu$_2$(BO$_3$)$_2$ System as Revealed by X-Band\n  ESR"}, "summary": "X-band ESR measurements on a single crystal of the highly frustrated\nSrCu$_2$(BO$_3$)$_2$ system are shown to provide an essential inspection of the\nmagnetic anisotropy present in this compound. The very broad absorption lines\nseem to be consistent with the largest anisotropy term, namely, the\nantisymmetric Dzyaloshinsky-Moriya (DM) interaction allowed by symmetry.\nHowever, the previously well-accepted model of only interdimer interaction is\ngeneralized with additional intradimer DM terms. Moreover, spin-phonon coupling\nis recognized as the cause on the linewidth broadening with increasing\ntemperature.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0310603%2Ccond-mat%2F0310666%2Ccond-mat%2F0310041%2Ccond-mat%2F0310201%2Ccond-mat%2F0310060%2Ccond-mat%2F0310343%2Ccond-mat%2F0310120%2Ccond-mat%2F0310285%2Ccond-mat%2F0310416%2Ccond-mat%2F0310635%2Ccond-mat%2F0310715%2Ccond-mat%2F0310314%2Ccond-mat%2F0310188%2Ccond-mat%2F0310342%2Ccond-mat%2F0310619%2Ccond-mat%2F0310072%2Ccond-mat%2F0310374%2Ccond-mat%2F0310220%2Ccond-mat%2F0310679%2Ccond-mat%2F0310414%2Ccond-mat%2F0310545%2Ccond-mat%2F0310616%2Ccond-mat%2F0310420%2Ccond-mat%2F0310737%2Ccond-mat%2F0310254%2Ccond-mat%2F0310211%2Ccond-mat%2F0310360%2Ccond-mat%2F0310387%2Ccond-mat%2F0310247%2Ccond-mat%2F0310098%2Ccond-mat%2F0310313%2Ccond-mat%2F0310404%2Ccond-mat%2F0310657%2Ccond-mat%2F0310361%2Ccond-mat%2F0310160%2Ccond-mat%2F0310447%2Ccond-mat%2F0310238%2Ccond-mat%2F0310510%2Ccond-mat%2F0310119%2Ccond-mat%2F0310618%2Ccond-mat%2F0310226%2Ccond-mat%2F0310204%2Ccond-mat%2F0310710%2Ccond-mat%2F0310083%2Ccond-mat%2F0310538%2Ccond-mat%2F0310334%2Ccond-mat%2F0310523%2Ccond-mat%2F0310634%2Ccond-mat%2F0310732%2Ccond-mat%2F0310139%2Ccond-mat%2F0310202%2Ccond-mat%2F0310004%2Ccond-mat%2F0310076%2Ccond-mat%2F0310384%2Ccond-mat%2F0310742%2Ccond-mat%2F0310582%2Ccond-mat%2F0310179%2Ccond-mat%2F0310300%2Ccond-mat%2F0310546%2Ccond-mat%2F0310359%2Ccond-mat%2F0310330%2Ccond-mat%2F0310539%2Ccond-mat%2F0310595%2Ccond-mat%2F0310214%2Ccond-mat%2F0310474%2Ccond-mat%2F0310476%2Ccond-mat%2F0310535%2Ccond-mat%2F0310588%2Ccond-mat%2F0310518%2Ccond-mat%2F0310185%2Ccond-mat%2F0310019%2Ccond-mat%2F0310328%2Ccond-mat%2F0310778%2Ccond-mat%2F0310407%2Ccond-mat%2F0310526%2Ccond-mat%2F0310322%2Ccond-mat%2F0310070%2Ccond-mat%2F0310408%2Ccond-mat%2F0310178%2Ccond-mat%2F0310681%2Ccond-mat%2F0310429%2Ccond-mat%2F0310036%2Ccond-mat%2F0310080%2Ccond-mat%2F0310233%2Ccond-mat%2F0310453%2Ccond-mat%2F0310194%2Ccond-mat%2F0310775%2Ccond-mat%2F0310612%2Ccond-mat%2F0310641%2Ccond-mat%2F0310200%2Ccond-mat%2F0310587%2Ccond-mat%2F0310128%2Ccond-mat%2F0310503%2Ccond-mat%2F0310389%2Ccond-mat%2F0310050%2Ccond-mat%2F0310466%2Ccond-mat%2F0310633%2Ccond-mat%2F0310227%2Ccond-mat%2F0310393%2Ccond-mat%2F0310158%2Ccond-mat%2F0310654&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "X-band ESR measurements on a single crystal of the highly frustrated\nSrCu$_2$(BO$_3$)$_2$ system are shown to provide an essential inspection of the\nmagnetic anisotropy present in this compound. The very broad absorption lines\nseem to be consistent with the largest anisotropy term, namely, the\nantisymmetric Dzyaloshinsky-Moriya (DM) interaction allowed by symmetry.\nHowever, the previously well-accepted model of only interdimer interaction is\ngeneralized with additional intradimer DM terms. Moreover, spin-phonon coupling\nis recognized as the cause on the linewidth broadening with increasing\ntemperature."}, "authors": ["A. Zorko", "D. Arčon", "H. Kageyama", "A. Lappas"], "author_detail": {"name": "A. Lappas"}, "author": "A. Lappas", "arxiv_comment": "13 pages, 3 figures, submitted to Apllied Magnetic Resonance", "links": [{"href": "http://arxiv.org/abs/cond-mat/0310178v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0310178v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0310178v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0310178v1", "journal_reference": "Appl. Magn. Reson. 27, 267-278 (2004)", "doi": null, "fulltext": "Magnetic Anisotropy of SrCu2(BO3)2 System\nas Revealed by X-Band ESR\nAndrej Zorko,1, ∗ Denis Arčon,1 Hiroshi Kageyama,2 and Alexandros Lappas3\n1\nInstitute \"Jožef Stefan\", Jamova 39, 1000 Ljubljana, Slovenia\n2\nDepartment of Chemistry, Graduate School of Science, Kyoto University,\nKyoto, 606-8502, Japan\n3\nInstitute of Electronic Structure and Laser, Foundation for Research and Technology –\nHellas, Vassilika Vouton, 71110 Heraklion, Greece\n\nX-band ESR measurements on a single crystal of the highly frustrated\nSrCu2(BO3)2 system are shown to provide an essential inspection of the magnetic\nanisotropy present in this compound. The very broad absorption lines seem to be\nconsistent with the largest anisotropy term, namely, the antisymmetric\nDzyaloshinsky-Moriya (DM) interaction allowed by symmetry. However, the\npreviously well-accepted model of only interdimer interaction is generalized with\nadditional intradimer DM terms. Moreover, spin-phonon coupling is recognized\nas the cause on the linewidth broadening with increasing temperature.\n\n1. Introduction\nLow-dimensional spin-gap systems with quantum-disordered singlet ground state have been\nin the main stream of scientific research in the last decade due the diversity of possible ground\nstate phases and richness of low-lying magnetic excitation spectra. The gap in magnetic\nexcitation spectrum (spin gap) is a common feature in one-dimensional (1D) antiferromagnets\nand is usually triggered by competing exchange interactions or dimerisation present in the\nsystem. On the contrary, the field of spin-gap systems in two dimensions is not nearly as rich\nas in one dimension since the general characteristic of two-dimensional (2D) antiferromagnets\nis a tendency to exhibit three-dimensional order at lower temperatures due to interlayer\nexchange interactions. However, sufficient frustration provided by a special exchange\ntopology of the system can resolve the non-magnetic singlet state as the ground state of the\nsystem and is thus directly responsible for the opening of the spin gap.\nSrCu2(BO3)2 with localized S =1/2 Cu2+ spins is one of the few 2D systems exhibiting\na spin-gap behaviour [1]. Already in the early stages [2] this system was recognised as the\nfirst chemical realisation of a model proposed by Shastry and Sutherland, which takes into\naccount 2D square lattice of antiferromagnetically coupled spins with additional selected\ndiagonal bonds [3]. The Hamiltonian of the investigated system is thus given by\n\n∗\n\nCorresponding author: tel.: +386-1-4773866; fax: +386-1-4263296; e-mail: andrej.zorko@ijs.si .\n\n\fH ex = J ∑ S i ⋅ S j + J ' ∑ S l ⋅ S m ,\n(ij )\n\n{lm}\n\n(1)\n\nwhere (ij) terms represents nearest-neighbour (nn) exchange coupling pairs while {lm} stands\nfor next-nearest-neighbour (nnn) pairs of spins with exchange constants estimated to be J = 85\nK and J' = 54 K [4]. The unique network of orthogonal interacting dimers composed of Cu2+\nions is shown as the inset to Fig. 1. The ground state of the system remains a simple product\nof spin singlets on each dimer even if interlayer exchange coupling J\" = 8 K is taken into\naccount [5], which makes the J'-coupling extremely frustrated. As a result of the inherent\ngeometrical frustration the lowest lying magnetic excitation – a single triplet excitation\npresent on one of the dimers – is extremely localized as evidenced by almost dispersionless\nexcitation band [6] and relatively small value of the spin gap ∆ = 34 K with respect to the\nexchange coupling constant J [6,7].\nThe singlet-triplet excitation possesses another remarkable property, namely, a fine\nstructure as revelled for the first time by high-field ESR experiment [7]. The interpretation of\nhigh-field ESR spectra was, in fact, quite an achievement as far as the understanding of\nmagnetic anisotropy of the system in concerned. The experimental singlet-triplet transitions\nare forbidden due to the fact that the Shastry-Sutherland exchange Hamiltonian commutes\nwith a magnetic dipole operator. Such transitions can be explained only by including spinanisotropy terms to the original Hamiltonian, which are then responsible for mixing a small\namount of excited states into the ground singlet state. A feasible analysis of the observed\nangular-dependent fine structure was proposed by Cépas et al. with the introduction of\nantisymmetric anisotropic exchange interaction, known as Dzyaloshinsky-Moriya (DM)\ninteraction of the form [8]\nH DM = ∑ ± D||e c ⋅ S i × S j .\n{ij }\n\n(2)\n\nSuch antisymmetric interaction is quite common in highly anisotropic, i.e. low-dimensional\nsystems, with large exchange coupling and no centre of inversion between interacting spins. It\nis the first-order perturbation effect of spin-orbit coupling and can often be by far the largest\nanisotopic term of the Hamiltonian. The magnitude of the DM interaction can be estimated\nfrom the g-shift and exchange constant, D ~ ∆g/g*J'. As the Cu-B-O planes are almost flat [9]\nonly interdimer DM interaction was employed with Dzyaloshinsky-Moriya vectors D|| = 2.1 K\n[8] pointing in the crystal c-direction (inset to Fig. 1), due to symmetry arguments originally\nproposed by Moriya [10].\nMagnetic anisotropy determines spin dynamics in the system and is thus reflected in\nESR spectra through the observed linewidths and lineshifts. To establish the nature of the\nlargest anisotropic terms we previously conducted X-band ESR measurements on powdered\nsample of SrCu2(BO3)2 and concluded that symmetric anisotropic exchange and/or\nantisymmetric DM interaction had to be considered in order to justify the observed broad\nspectra [11]. However, performing experiments on single crystals offers an additional insight\ninto the anisotropy on the system. Namely, angular dependence of the linewidth can yield\nsupplementary information on the direction of anisotropy axes in addition to the magnitude of\n\n\fanisotropic contributions. Moreover, the presence of diffusive motion of spins can be verified\nthrough the enhanced contributions of secular parts of anisotropic terms. Measurements on\nsingle crystals thus often allow one to rule out particular anisotropy terms in favour of other\nones. Performing X-band ESR on a single crystal of SrCu2(BO3)2 hence seems a reasonable\nway to verify the validity of the picture of spin dynamics proposed for this particular system.\nFurthermore, it can yield information on additional anisotropic terms, which have not yet\nbeen evaluated or even observed by other spectroscopic techniques.\n\n2. Material and methods\nSingle crystal of SrCu2(BO3)2 was grown by the travelling solvent floating zone (TSFZ)\nmethod from a polycrystalline SrCu2(BO3)2 powder using LiBO2 as a solvent [12]. The\ndirection of crystal axes was determined by means of X-ray scattering and the high purity was\nverified by almost no low-temperature Curie-like upturn of the magnetic susceptibility down\nto 2 K. A crystal of a size 5ä2ä2 mm3 was used for ESR experiments.\nX-band electron spin resonance (ESR) measurements were performed on a\ncommercially available Bruker E580 FT/CW spectrometer working at Larmor frequency of νL\n= 9.5 GHz. The temperature of 525 K was reached using high-temperature controller with\npreheated-nitrogen-flow cryostat.\n\n3. Results and discussion\nAngular-dependent X-band ESR spectra on a single crystal of SrCu2(BO3)2 were recorded at\n295 K and 525 K, i.e. at two temperatures well above the characteristic intradimer exchange\ntemperature J = 85 K. Bearing in mind that the H0 = Hz + Hex part of the total spin\nHamiltonian H = H0 + H' is dominant, the anisotropic part H' can be treated as a perturbation\nand the Kubo-Tomita approach to magnetic resonance should be justified at such high\ntemperatures [13]. Here Hz and Hex terms represent Zeeman and isotropic exchange (Eq. (1))\npart of Hamiltonian, respectively. As we are dealing with S = 1/2 spins no single-spin\nanisotropy terms are present. So the magnetic anisotropy is in principal driven by the dipolar\ninteractions (Hdd) between neighbouring magnetic moments, the hyperfine coupling (Hhf) of\nelectron spins with nuclear spins, the symmetric anisotropic exchange interaction (Hae)\n(pseudo-dipolar interaction) and the antisymmetric DM interaction (HDM), i.e.\nH' = H dd + H hf + H ae + H DM .\n\n(3)\n\nThe absorption lines should be extremely exchange narrowed as the isotropic exchange is by\nfar the superior interaction present in the investigated system (kBJ à gμBB0 ~ gμB∆Bpp). In\nthis regime peak-to-peak linewidth is given by the expression [14]\n∆B pp ≈\n\nk B2 M 2\n2 kB M 2\n≈\n,\n3 hgμ B ω eff\n3 gμ B J\n\n2\n\n(4)\n\n\fwhere ωeff = k B J h is characteristic frequency of exchange modulation and M2 is the second\nmoment, given by\nM 2 = [H' , S + ][S − , H' ]\n\nS+ S− .\n\n(5)\n\nThe lineshape is expected to be Lorentzian. However, line broadening and deviations from\nLorentzian profiles are often detected in low-dimensional systems at higher temperatures due\nto spin diffusion [15].\nThe standard analysis of the lineshape of ESR absorption spectra for SrCu2(BO3)2 for\nboth the parallel and the perpendicular direction of external magnetic field B0, with respect to\nthe crystal anisotropy c-axis, is shown in Fig. 1 for T = 525 K. In the plot (-(BB0)f'max/f'(B)∆Bpp)1/2 vs. (2(B-B0)/∆Bpp)2 Lorentzian profiles yield a linear dependence, while\nGaussian lines produce much faster (exponentially) increasing function due to rapid decrease\nof the signal in the tails of resonant absorption spectra. Here f'(B) represents derivative\nabsorption spectrum with peaks ±f'max. Spin diffusion results in a function somewhere inbetween the two extreme cases [16]. As it can be seen from Fig. 1 the presence of spin\ndiffusion can be excluded in SrCu2(BO3)2 system as the absorption profiles obey Lorentzian\ndependence.\n3.1 g-factor anisotropy\nNext we focus on the anisotropy of the g-factor presented in Fig. 2 for T = 295 K. As\nexpected from the crystal structure [9] g-tensor is axially symmetric with a pronounced\nangular dependence in the ac-plane (θ-dependence) and only minor dependence with respect\nto the azimuthal angle φ (ab-plane). Fitting the θ-dependence to the equation\ng = g||2 cos 2 θ + g ⊥2 sin 2 θ\n\n(6)\n\nyields parallel and perpendicular g-factors with respect to c-axis: g|| = 2.269±0.002 and g^ =\n2.057±0.002. Such g-shifts are common for Cu2+ 3d9 configuration where crystal field is\nstronger than spin-orbit coupling [17, p. 48]. Crystal field thus effectively quenches orbital\nmotion producing an effective spin of 1/2 for the ion. Orbital moments are partially restored\nby spin-orbit coupling leading to g-shifts. The anisotropy of the g-shifts in ab-plane is much\nsmaller. It can be limited by experimental accuracy to a value smaller than 0.002. At 525 K gfactor shows virtually the same angular-dependence with unchanged eigenvalues.\n3.2 Spin-anisotropy contributions to linewidths\nLinewidths of the X-band ESR spectra at 295 K and 525 K are presented in Fig. 3. As already\nemphasized [11] all the anisotropic terms included in Hamiltonian (3) have to be considered\nin determination of the contributions to the ESR linewidth. Furthermore, the Lorentzian\nlineshape of absorption spectra confirms the assumption of the presence of strong exchange\nnarrowing, so that the use of Eq. (4) is well justified. Following the previous estimates of the\n2\ndipolar and hyperfine contribution to the second moment M 2dd ≈ (gμ B k B ⋅ 1000 G ) and\n\n\fhf\nM 2hf ≈ ( gμ B k B ⋅ 200 G )2 [11], linewidths of the order of ∆B dd\n≈ 2 G and ∆B pp\n≈ 0.1 G\npp\n\nare expected, which are several orders of magnitude smaller than the experimental values.\nEmploying symmetric anisotropic exchange, which is a result of second order perturbation of\n2\nspin-orbit coupling (its amplitude can be evaluated as AE ~ (∆g/g) *J = 0.8 K), and\nantisymmetric DM interaction yields the second moment of the form [18]\nM 2ae, DM =\n\n{(\n\nS (S + 1) \nx\n2∑ AE 2 + ∑ Dlm\n\n3N  (ij )\n{lm}\n\n) + (D )\n2\n\ny 2\nlm\n\n( ) } ,\n\nz\n+ 2 Dlm\n\n2\n\n(7)\n\n\n\nwhere the components of the DM vector are given in the laboratory frame with the z-axis\npointing in the direction of the external magnetic field B0. Using Eq. (4) and Eq. (7) the\n2\n2 3 gμ B J ≈ 20 G ,\ncontribution of the symmetric part can be evaluated as ∆B ae\npp ≈ k B AE\nDM\n≈ 2k B D 2\nwhile the antisymmetric DM interaction gives a value of ∆B pp\n\n3 gμ B J ≈ 460 G\n\ntaking into account the interdimer DM interaction D|| = 2.1 K as proposed in ref. 8.\nThe above analysis favours the DM interaction as the only candidate capable of\ninducing sufficiently large linewidths, as observed in the current experiment. This conclusion\ncould have been already reached by conducting the experiment on the powdered sample,\nwhere the room temperature peak-to-peak linewidth was around 760 G. However, the\nfundamental advantage of the present single-crystal experiment is the power to test the\nproposed picture of magnetic anisotropy in SrCu2(BO3)2 system given by Eq. (2) through the\nangular dependence of the observed linewidths. This can in fact yield additional information\nabout the direction of Dzyaloshinsky-Moriya vectors as discussed below.\n\n3.3 Linewidth anisotropy determined by DM interaction\nLet the external magnetic field B0 have an arbitrary orientation described with the polar angle\nθ with respect to the crystal c-axis and the azimuthal angle φ in the ab-plane. Applying the\ntransformation of DM vector from laboratory frame to crystal frame gives the expression of\nthe angular dependence of Dzyaloshinsky-Moriya second moment\nM 2DM =\n\nS (S + 1)\n{ Dlma\n∑\n3 N {lm}\n\n( ) (1 + sin\n2\n\n2\n\n) ( )(\n\n) ( )(\n\n2\n\n2\n\n)\n\nb\nc\nθ cos 2 φ + Dlm\n1 + sin 2 θ sin 2 φ + Dlm\n1 + cos 2 θ +\n\n(8)\n\na\nb\na\nc\nb\nc\n+ 2 Dlm\nDlm\nsin 2 θ sin φ cos φ + 2 Dlm\nDlm\nsin θ cosθ cos φ + 2 Dlm\nDlm\nsin θ cosθ sin φ}.\n\nEntering only the interdimer DM interaction D = (0,0, D|| ) into Eq. (8) yields the angular\n\n(\n\n)\n\ndependence of the second moment of the form M 2DM ∝ 1 + cos 2 θ . However, the angular\ndependence of the observed linewidth at 295 K and 525 K is significantly different from this\nprediction (Fig. 3). θ-dependence can be well described by an equation of the form\n\n(\n\n)\n\nA + B 1 + cos 2 θ with A and B contributions of the same order of magnitude. The parameters\nthus obtained are A = 478±5 G, B = 436±5 G for room temperature and A = 541±5 G, B =\n439±5 G for the higher temperature. The angular-dependent part B is temperature independent\n\n\fand coincides very well with the order-of-magnitude prediction of 460 G, which should be\nasymptotically approached when going to infinite-temperature. However, unexpectedly, there\nis an additional term A, which is of the same amplitude as the B term. On the contrary to the\nlatter, it is also T-dependent. The magnetic anisotropy introducing such contribution to the\nlinewidth should be quite strong as the amplitudes of A and B terms are virtually the same.\nThe symmetric-anisotropy-interaction contribution ∆B ae\npp can be excluded for at least two\nreasons. The first one is pointed out by the above order-of-magnitude calculation and the\nsecond one is due to the characteristic angular dependence of this interaction [19]. Namely,\nsymmetric anisotropic exchange interaction can be presented by a traceless tensor whose\nprincipal axes coincide with those of the g-tensor. As the SrCu2(BO3)2 system is axially\nsymmetric to a very good approximation, with the anisotropy axis pointing in the crystal cdirection, the contribution of Hae to the linewidth is expected to vary with the orientation of\n\n(\n\n)\n\nexternal magnetic field according to M 2ae ∝ 1 + cos 2 θ . This is the same angular dependence\nas provided by DM interdimer interaction with DM vectors perpendicular to ab-plane and as\nsuch can not provide an adequate explanation of the additional A term observed in the\nexperiment.\nWe propose that the origin of the experimental angular dependence of the linewidth\nlies in additional magnetic-anisotropy terms of the Dzyaloshinsky-Moriya type. Although, in\nthe first approximation, treating the crystal ab-plane as strictly planar, DM vectors are obliged\nto point into c-direction and no intradimer interaction is allowed due to symmetry reasons,\none can loosen these constrains if a buckling of ab-planes is taken into account [20]. Bending\nof neighbouring CuO4 plaquettes forming dimers suppresses inversion symmetry within\ndimers thus allowing finite intradimer DM interaction D⊥. In addition, also finite in-plane\ncomponent of interdimer interactions Dab is endorsed. In fact, it has been recently reported\nthat the latter interaction is responsible for the observed anomalies in high-resolution inelastic\nneutron scattering experiments [21]. A sizable in-plane interdimer component of the order of\n30% of D|| was suggested. The ESR linewidth is proportional to the square of the amplitude of\nDM vector, which would imply that the corrections of the Dab term amount in a correction of\nonly about 10% of the contribution to the linewidth due to D|| interaction. However, the\nobserved effect in our experiment is much larger.\nThe behaviour of the linewidth in ab-plane is less exciting as there is virtually no φdependence (Fig. 3). The linewidths seem to be randomly scattered as a function of the\nazimuthal angle with the amplitude of 5 G around the value of 686 G. Such behaviour\ncorresponds to the addition of intradimer DM interaction since in this case DM vectors are\nforced to lie in the ab-plane in a direction perpendicular to dimers due to symmetry; there is a\nmirror plane including a dimer and a mirror plane perpendicular to a dimer (see inset to Fig.\n1). A detailed analysis of the effect of intradimer DM interaction on the ESR linewidth is\ncurrently in progress and will be published elsewhere [22]. Preliminary results suggest that\nthis interaction is about of the same magnitude as the well-excepted interdimer interaction\nperpendicular to the plane. However, it has to be stressed that in addition to the calculation of\nthe second moment, a detailed analysis of the exchange modulation frequency ωeff is required\n\n\fsince there is a high degree of frustration present in the system. Furthermore, the effect of\nadditional DM interaction on the fine structure of single triplet excitations has to be\nconsidered carefully.\nAt the moment the origin of the intradimer DM exchange interaction seems to some\nextent unclear. The buckling of ab-planes is rather small as the bending angle of CuO4\nplaquettes amounts to 8° at room temperature [20]. This angle continuously drops towards 0°\napproaching the structural phase transition at 395 K so that in the high-temperature phase only\nD|| interdimer component is again allowed in the static-lattice picture. However, as this\ninteraction alone still does not allow an observation of singlet-triplet transitions in high-field\nESR experiments, DM interaction of a dynamical origin was proposed [23]. In this picture\nlattice-vibrations instantaneously break local symmetry allowing for the DzyaloshinskyMoriya anisotropy. It seems that our ESR results would favour the dynamical mechanism, as\nthere is only a small difference in the angular dependence of the linewidth at 295 K and 525\nK, i.e. at temperatures well below and well above the structural phase transition, respectively.\nThe effect of the buckling of ab-planes on the anisotropy of g-factor within the planes\nhas also been considered. Since dimers are tilted by half the bending angle with respect to the\nc-axis (4° at room temperature) one can perform a rotation of the g-tensor of individual dimer,\nwhose principal axes are tilted due to buckling, into crystal frame. This transformation yields\ntwo different components of in-plane g-factor when the in-plane external magnetic field is\n\n(\n\napplied, i.e. g ⊥a = g ⊥2 cos 2 θ + g ||2 sin 2 θ\n\n)\n\n1/ 2\n\nfor the case when magnetic field is parallel to the\n\ndimer and g ⊥b = g ⊥ for magnetic field perpendicular to the dimer, where g^ and g|| are the gfactor components in the eigenframe of g-tensor. However, due to rather small corrugation of\n\nab-planes the effect is unobservablly small as g ⊥a − g ⊥ ≈ 0.001 . This finding is consistent\nwith almost no φ-dependence of g-factor shown in Fig. 2.\n3.4 Temperature dependence of linewidths\nFinally, let us comment on the temperature dependence of the observed linewidth anisotropy\n(Fig. 3). The increase of the linewidth at 525 K with respect to room temperature is reverse to\nthe behaviour below room temperature, previously reported for powdered sample [11].\nHowever, the similar increase was also observed in powdered sample when going beyond\nroom temperature. The increase of the linewidth between 295 K and 525 K in θ = 0° direction\nis virtually the same as in the case when the external field is applied in θ = 90° direction. Both\ndirections yield 65±5 G broader lines at 525 K than at 295 K. Trying to give an explanation\nfor such angular-independent behaviour, or the observed line broadening in the first place,\none can immediately exclude spin diffusion as the origin of the increase since the lineshape\nremains \"perfectly\" Lorentzian even at 525 K. Next step would be the incorporation of static\nspin correlations, which can play an important role in the temperature evolution of the\nlinewidth in low-dimensional systems and can be sometimes seen in a rather broad\ntemperature range between T ¥ J and T ~ 10 J [14]. In their paper Soos et al. showed that\n\n\fincluding static spin correlations into an ordinary nn square lattice leads to temperature\ndependent second moment\n\n(\n\n) χχ(T ) ,\n\nM 2 (J , T ) = M 2 S F S (J , T ) + M 2 A F A (J , T )\n\nC\n\n(9)\n\nwhere indexes S and A stand for spin symmetric and spin antisymmetric contributions,\nrespectively. The infinite-temperature second moments M2S,A are multiplied by functions\ndescribing temperature evolutions of static spin correlations FS,A(J,T) and by the ratio between\nCurie-law susceptibility χC and the observed one χ(T). If the increase of the linewidth is due\nto static spin correlations one will expect to observe angular-dependent increase as the angular\ndependence is contained in the infinite-temperature second moments and is thus simply\nmultiplied by corrections originating from static spin correlations. The calculation of M2(J,T)\nin SrCu2(BO3)2 system is more complicated due to the form of its Hamiltonian and a simple\nfactorisation into high-T second moment and a T-dependent function is not possible.\nHowever, one still expects to detect angular-dependent increase, which is not the\nexperimentaly observed [22]. Excluding also short-range order effects consequently indicates\ntemperature-independent linewidths with the assumption of pure spin Hamiltonian\ndetermining spin dynamics.\nSuch temperature-independent behaviour is often observed in magnetic crystals with\nsignificant exchange narrowing. It is then plausible that spin-phonon coupling has to be taken\ninto consideration in the SrCu2(BO3)2 system in order to account for the increase in the\nlinewidth with the temperature. In fact, normal modes can modulate anisotropic spin\ninteractions via spin-phonon interaction, which then induces transitions between energy levels\nof the system. The linewidth, regulated by a finite life-time of a spin in a particular energy\nlevel, is in this scenario expected to rise with temperature due to the increasing number of\nphonons. However, the A term cannot entirely be of the dynamical origin as one might expect.\nIts increase between 295 K and 525 K is too small with respect to increase of the convex\nfunction describing the number of phonons that characterises the direct phonon process [17, p.\n112] of relaxation. Higher-order (Raman) phonon processes are expected to yield even faster\ntemperature-varying broadening of the linewidth with increasing temperature. Therefore we\npropose that the temperature-dependant part of the A term is due to spin-phonon coupling,\nwhile its major (constant) part is due to magnetic anisotropy of DM origin. Spin-lattice\ncoupling has indeed been reported to play a crucial role in a dramatic softening of the elastic\nconstants in SrCu2(BO3)2 [24]. It was suggested to be very strong and advised to be taken into\nconsideration in any future model considering this particular system.\n\n4. Conclusions\nIn summary, angular dependence of X-band ESR spectra of SrCu2(BO3)2 a single crystal have\nbeen presented at two different temperatures. The magnetic anisotropy governing spin\ndynamics has been shown to be quite substantial as the observed linewidths are very broad in\nspite of the presence of strong isotropic exchange coupling. Among the possible anisotropy\n\n\fmechanisms the antisymmetric anisotropic Dzyaloshinsky-Moriya interaction was determined\nas the only one capable of producing sufficiently large linewidths. However, previously\nproposed interdimer DM exchange coupling, with DM vectors perpendicular to crystal abplane, does not suffice for an adequate description of experimentally observed angular\ndependence. In fact, sizable intradimer DM interaction has to be employed to provide\nsatisfactory explanation. Its origin, though, still remains unclear. It can be due to dynamical\neffects and/or is a fingerprint of buckling of crystal ab-planes. In addition, the angularindependent increase of the linewidth with increasing temperature above room temperature\nthe existence of strong spin-phonon coupling present in the system.\n\nAcknowledgements\nWe thank the General Secretariat for Science & Technology (Greece) for the provision of\nfinancial support through a Greece-Slovenia 'Joint Research & Technology Program'. AL and\nHK thank the Yamada Science Foundation (Japan) for supporting their work in lowdimensional materials.\n\nReferences:\n[1] Kageyama H., et al.: Phys. Rev. Lett. 82, 3168-3171 (1999).\n[2] Miyahara S., Ueda K.: Phys. Rev. Lett. 82, 3701-3704 (1999).\n[3] Shastry B. S., Sutherland B.: Physica 108B, 1069-1070 (1981).\n[4] Miyahara S., et al.: Suppl. B to J. Phys. Soc. Jap. 69, 72 (2000).\n[5] Koga A.: J. Phys. Soc. Jap. 69, 3509-3512 (2000).\n[6] Kageyama H., et al.: Phys. Rev. Lett. 84, 5876-5879 (2000).\n[7] Nojiri H., et al., J. Phys. Soc. Jap. 68, 2906-2909 (1999).\n[8] Cépas O., et al.: Phys. Rev. Lett. 87, 167205-167208 (2001).\n[9] Smith R. W., Keszler D. A.: J. Solid State Chem. 93, 430-435 (1991).\n[10] Moriya T.: Phys. Rev 120, 91-98 (1960).\n[11] Zorko A., Arčon D., Lappas A. Giapintzakis J.: Phys. Rev B 65, 024417 (2001).\n[12] Kageyama H., Onizuka K., Yamauchi T., Ueda Y.: J.Crys. Growth 206, 65-67 (1999).\n[13] Kubo R., Tomita K.: J. Phys. Soc. Jap. 9, 888-919 (1954).\n[14] Soos Z. G., McGregor K. T., Cheung T. T. P., Silverstein A. J.: Phys. Rev B 16, 30363048 (1977).\n[15] Richards P. M.: Local Properties at Phase Transitions, p. 539. Amsterdam: NorthHolland Publishing Company 1976.\n[16] Richards P. M., Salamon M. B.: Phys. Rev B 9, 32-45 (1974).\n[17] Pake G. E.: Paramagnetic Resonance. New York: W. A. Benjamin, Inc. (1962).\n[18] Castner T. G., Seehra M. S.: Phys. Rev B 4, 38-45 (1974).\n[19] McGregor K. T., Soos Z. G.: J. Chem. Phys. 64, 2506-2517 (1976).\n[20] Sparta K., et al.: Eur. Phys. J. B 19, 507-516 (2001).\n\n\f[21] Kakurai K.: Quantum Properties of Low-Dimensional Antiferromagnets, eds. A. Ayiro\nand J. P. Boucher. Fukuoka: Kyushu University Press (2002).\n[22] Zorko A., et al.: to be published.\n[23] Cépas O., Sakai T., Ziman T.: Prog. Theo. Phys. Suppl. 145, 43-51 (2002).\n[24] Wolf B., et al.: Phys. Rev. Lett. 86, 4847-4850 (2001).\n\nFigure legends:\nFig. 1: Lineshape analysis for X-band absorption lines of SrCu2(BO3)3 single crystal for\nexternal magnetic field applied parallel (open circles) and perpendicular (full diamonds) to\ncrystal c-axis at 525 K. Solid lines correspond to absorption profiles of Lorentzian and\nGaussian type. The inset shows the 2D network of Cu2+ ions, with thick lines representing the\nnearest-neighbor exchange coupling J and thin lines related to next-nearest-neighbor\nexchange J'. The direction of interdimer D|| as well as intradimer D^ DM interaction is also\npresented.\nFig. 2: Anisotropy of the g-tensor of the X-band ESR spectra for the SrCu2(BO3)3 single\ncrystal in the crystal ac-plane (θ-dependence; full circles) and in the ab-plane (φ-dependence;\nopen circles) at 295 K. The fit (solid line) corresponds to Eq. 6.\nFig. 3: Linewidth anisotropy of the X-band ESR absorption lines for the SrCu2(BO3)3 single\ncrystal in the crystal ac-plane (full symbols) at 295 K (circles) and 525 K (diamonds) and in\nthe ab-plane at 295 K (open circles). Experimental data is fitted to equation of the form\nA + B cos 2 θ (solid lines).\n\n\f1/2\n\n(-(B-B0)f'max/f'(B)∆Bpp)\n\n0\n\n10\n\n20\n\n30\n\n0\n\n20\n\nGaussian\n\n40\n\n+D||\n\nD^\n.\n\nä\n\n-D||\n\n2\n\n(2(B-B0)/∆Bpp)\n\n-D||\n\nä\n\n. +D||\n\nZorko, et al.: Fig. 1\n\nLorentzian\nθ = 0°\nθ = 90°\n60\n80\n\n\fg-factor\n\n2.05\n\n2.10\n\n2.15\n\n2.20\n\n2.25\n\n2.30\n\n0\n\n30\n\n60\n\nθ, φ (°)\n\n90\n\n120\n\nθ -dependence\nφ -dependence\n\n150\n\nZorko, et al.: Fig. 2\n\n180\n\n\f∆Bpp (G)\n\n650\n\n700\n\n750\n\n800\n\n850\n\n900\n\n950\n\n1000\n\n1050\n\n0\n\n30\n\n60\n\nθ, φ (°)\n\n90\n\n120\n\nθ -dependence, 525 K\nθ -dependence, 295 K\nφ -dependence, 295 K\n\n180\nZorko, et al.: Fig. 3\n\n150\n\n\f"}