{"id": "http://arxiv.org/abs/cond-mat/0012022v2", "guidislink": true, "updated": "2001-04-03T00:08:06Z", "updated_parsed": [2001, 4, 3, 0, 8, 6, 1, 93, 0], "published": "2000-12-01T21:37:56Z", "published_parsed": [2000, 12, 1, 21, 37, 56, 4, 336, 0], "title": "Surface-Directed Spinodal Decomposition in Binary Fluid Mixtures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0012163%2Ccond-mat%2F0012279%2Ccond-mat%2F0012285%2Ccond-mat%2F0012226%2Ccond-mat%2F0012010%2Ccond-mat%2F0012376%2Ccond-mat%2F0012201%2Ccond-mat%2F0012487%2Ccond-mat%2F0012154%2Ccond-mat%2F0012257%2Ccond-mat%2F0012267%2Ccond-mat%2F0012389%2Ccond-mat%2F0012430%2Ccond-mat%2F0012348%2Ccond-mat%2F0012235%2Ccond-mat%2F0012006%2Ccond-mat%2F0012234%2Ccond-mat%2F0012509%2Ccond-mat%2F0012424%2Ccond-mat%2F0012494%2Ccond-mat%2F0012363%2Ccond-mat%2F0012030%2Ccond-mat%2F0012246%2Ccond-mat%2F0012514%2Ccond-mat%2F0012352%2Ccond-mat%2F0012058%2Ccond-mat%2F0012451%2Ccond-mat%2F0012248%2Ccond-mat%2F0012099%2Ccond-mat%2F0012254%2Ccond-mat%2F0012317%2Ccond-mat%2F0012422%2Ccond-mat%2F0012504%2Ccond-mat%2F0012326%2Ccond-mat%2F0012134%2Ccond-mat%2F0012150%2Ccond-mat%2F0012162%2Ccond-mat%2F0012022%2Ccond-mat%2F0012042%2Ccond-mat%2F0012009%2Ccond-mat%2F0012253%2Ccond-mat%2F0012056%2Ccond-mat%2F0012230%2Ccond-mat%2F0012296%2Ccond-mat%2F0012013%2Ccond-mat%2F0012048%2Ccond-mat%2F0012012%2Ccond-mat%2F0012075%2Ccond-mat%2F0012084%2Ccond-mat%2F0012345%2Ccond-mat%2F0012229%2Ccond-mat%2F0012188%2Ccond-mat%2F0012447%2Ccond-mat%2F0012427%2Ccond-mat%2F0012066%2Ccond-mat%2F0012462%2Ccond-mat%2F0012036%2Ccond-mat%2F0012111%2Ccond-mat%2F0012047%2Ccond-mat%2F0012340%2Ccond-mat%2F0012304%2Ccond-mat%2F0012374%2Ccond-mat%2F0012353%2Ccond-mat%2F0012450%2Ccond-mat%2F0012145%2Ccond-mat%2F0012044%2Ccond-mat%2F0012495%2Ccond-mat%2F0012332%2Ccond-mat%2F0012233%2Ccond-mat%2F0012315%2Ccond-mat%2F0012034%2Ccond-mat%2F0012286%2Ccond-mat%2F0012421%2Ccond-mat%2F0012109%2Ccond-mat%2F0012117%2Ccond-mat%2F0012379%2Ccond-mat%2F0012272%2Ccond-mat%2F0012507%2Ccond-mat%2F0012513%2Ccond-mat%2F0012378%2Ccond-mat%2F0012295%2Ccond-mat%2F0012436%2Ccond-mat%2F0012245%2Ccond-mat%2F0012470%2Ccond-mat%2F0012483%2Ccond-mat%2F0012497%2Ccond-mat%2F0012011%2Ccond-mat%2F0012486%2Ccond-mat%2F0012191%2Ccond-mat%2F0012016%2Ccond-mat%2F0012344%2Ccond-mat%2F0012050%2Ccond-mat%2F0012172%2Ccond-mat%2F0012393%2Ccond-mat%2F0012401%2Ccond-mat%2F0012364%2Ccond-mat%2F0012499%2Ccond-mat%2F0012274%2Ccond-mat%2F0012361%2Ccond-mat%2F0012301%2Ccond-mat%2F0012069&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Surface-Directed Spinodal Decomposition in Binary Fluid Mixtures"}, "summary": "We consider the phase separation of binary fluids in contact with a surface\nwhich is preferentially wetted by one of the components of the mixture. We\nreview the results available for this problem and present new numerical results\nobtained using a mesoscopic-level simulation technique for the 3-dimensional\nproblem.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0012163%2Ccond-mat%2F0012279%2Ccond-mat%2F0012285%2Ccond-mat%2F0012226%2Ccond-mat%2F0012010%2Ccond-mat%2F0012376%2Ccond-mat%2F0012201%2Ccond-mat%2F0012487%2Ccond-mat%2F0012154%2Ccond-mat%2F0012257%2Ccond-mat%2F0012267%2Ccond-mat%2F0012389%2Ccond-mat%2F0012430%2Ccond-mat%2F0012348%2Ccond-mat%2F0012235%2Ccond-mat%2F0012006%2Ccond-mat%2F0012234%2Ccond-mat%2F0012509%2Ccond-mat%2F0012424%2Ccond-mat%2F0012494%2Ccond-mat%2F0012363%2Ccond-mat%2F0012030%2Ccond-mat%2F0012246%2Ccond-mat%2F0012514%2Ccond-mat%2F0012352%2Ccond-mat%2F0012058%2Ccond-mat%2F0012451%2Ccond-mat%2F0012248%2Ccond-mat%2F0012099%2Ccond-mat%2F0012254%2Ccond-mat%2F0012317%2Ccond-mat%2F0012422%2Ccond-mat%2F0012504%2Ccond-mat%2F0012326%2Ccond-mat%2F0012134%2Ccond-mat%2F0012150%2Ccond-mat%2F0012162%2Ccond-mat%2F0012022%2Ccond-mat%2F0012042%2Ccond-mat%2F0012009%2Ccond-mat%2F0012253%2Ccond-mat%2F0012056%2Ccond-mat%2F0012230%2Ccond-mat%2F0012296%2Ccond-mat%2F0012013%2Ccond-mat%2F0012048%2Ccond-mat%2F0012012%2Ccond-mat%2F0012075%2Ccond-mat%2F0012084%2Ccond-mat%2F0012345%2Ccond-mat%2F0012229%2Ccond-mat%2F0012188%2Ccond-mat%2F0012447%2Ccond-mat%2F0012427%2Ccond-mat%2F0012066%2Ccond-mat%2F0012462%2Ccond-mat%2F0012036%2Ccond-mat%2F0012111%2Ccond-mat%2F0012047%2Ccond-mat%2F0012340%2Ccond-mat%2F0012304%2Ccond-mat%2F0012374%2Ccond-mat%2F0012353%2Ccond-mat%2F0012450%2Ccond-mat%2F0012145%2Ccond-mat%2F0012044%2Ccond-mat%2F0012495%2Ccond-mat%2F0012332%2Ccond-mat%2F0012233%2Ccond-mat%2F0012315%2Ccond-mat%2F0012034%2Ccond-mat%2F0012286%2Ccond-mat%2F0012421%2Ccond-mat%2F0012109%2Ccond-mat%2F0012117%2Ccond-mat%2F0012379%2Ccond-mat%2F0012272%2Ccond-mat%2F0012507%2Ccond-mat%2F0012513%2Ccond-mat%2F0012378%2Ccond-mat%2F0012295%2Ccond-mat%2F0012436%2Ccond-mat%2F0012245%2Ccond-mat%2F0012470%2Ccond-mat%2F0012483%2Ccond-mat%2F0012497%2Ccond-mat%2F0012011%2Ccond-mat%2F0012486%2Ccond-mat%2F0012191%2Ccond-mat%2F0012016%2Ccond-mat%2F0012344%2Ccond-mat%2F0012050%2Ccond-mat%2F0012172%2Ccond-mat%2F0012393%2Ccond-mat%2F0012401%2Ccond-mat%2F0012364%2Ccond-mat%2F0012499%2Ccond-mat%2F0012274%2Ccond-mat%2F0012361%2Ccond-mat%2F0012301%2Ccond-mat%2F0012069&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider the phase separation of binary fluids in contact with a surface\nwhich is preferentially wetted by one of the components of the mixture. We\nreview the results available for this problem and present new numerical results\nobtained using a mesoscopic-level simulation technique for the 3-dimensional\nproblem."}, "authors": ["Sorin Bastea", "Sanjay Puri", "Joel L. Lebowitz"], "author_detail": {"name": "Joel L. Lebowitz"}, "author": "Joel L. Lebowitz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.63.041513", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0012022v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0012022v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "RevTeX, 7 figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0012022v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0012022v2", "journal_reference": "Physical Review E 63, 041513 (2001)", "doi": "10.1103/PhysRevE.63.041513", "fulltext": "arXiv:cond-mat/0012022v2 [cond-mat.stat-mech] 3 Apr 2001\n\nSurface-Directed Spinodal Decomposition in Binary Fluid\nMixtures\nSorin Bastea1,† , Sanjay Puri2 and Joel L. Lebowitz1\n1 Department\n2 School\n\nof Mathematics and Physics, Rutgers University, New Brunswick, NJ 08903, USA\nof Physical Sciences, Jawaharlal Nehru University, New Delhi 110067, INDIA\n\nAbstract\nWe consider the phase separation of binary fluids in contact with a surface\nwhich is preferentially wetted by one of the components of the mixture. We\nreview the results available for this problem and present new numerical results\nobtained using a mesoscopic-level simulation technique for the 3-dimensional\nproblem.\n\nPACS numbers: 64.75.+g, 61.30.Hn, 68.08.Bc, 47.70.Nd\n\nTypeset using REVTEX\n1\n\n\fI. INTRODUCTION\n\nThere has been much interest in the phase-separation dynamics of homogeneous binary\nmixtures, which have been rendered thermodynamically unstable by a rapid quench below\nthe coexistence curve. The time evolution of pure bulk mixtures in which the evolving system\ncoarsens into domains rich in either of the components is now reasonably well-understood.\nThese domains are characterized for late times by a single length scale L(t) ∼ tφ , where t is\nthe time and the growth exponent φ depends upon the system considered, e.g., whether or\nnot the order parameter is conserved, the relevance of hydrodynamic effects, etc. [1].\nAn experimentally important variation of this problem considers the role of surfaces with\na preferential attraction for one of the components of the mixture. The first experimental\nstudy of this problem is due to Jones et al. [2], who considered unstable polymer mixtures\nof polyethylene-propylene (PEP) and perdeuterated PEP (d-PEP) in a thin-film geometry.\nThe surface energy of d-PEP is somewhat less than that of PEP leading, in addition to\nbulk phase separation (spinodal decomposition), to a preferential deposition of d-PEP at\nany free surface. Jones et al. studied laterally-averaged composition profiles as a function of\ndistance from the surface. The bulk is characterized by randomly-oriented phase-separation\nprofiles and the lateral averaging procedure does not yield a systematic behavior. However,\nthe surface exhibits an enrichment layer in the preferred component, which is followed by a\ndepletion layer. This oscillatory profile is time-dependent and decays with a characteristic\nlength to the bulk composition.\nThis experiment motivated many further investigations of this problem. The experimental techniques and results have been reviewed by Krausch [3], and the theoretical and\nnumerical developments by Puri and Frisch [4] and Binder [4]. To date, most numerical\nstudies of this problem have focused on the case of binary mixtures without hydrodynamic\neffects, i.e., the growth of surface wetting layers and bulk domains is governed by diffusive\nprocesses. However, many important experiments in this area involve binary fluids in contact\nwith a surface. It is well-known that macroscopic matter and energy flows, i.e., hydrody2\n\n\fnamic effects, drastically alter the nature of domain growth in the bulk phase-separation\nproblem. Therefore, it is reasonable to expect important physical effects to result from\nhydrodynamic flows in the case of surface-directed phase-separation also. To understand\nsome of the issues involved, we have undertaken a detailed numerical simulation of this\nproblem. In particular we adapted mesoscopic models formulated to study bulk spinodal\ndecomposition in binary fluids to surface-directed spinodal decomposition.\nThis paper is organized as follows. Section 2 reviews available experimental, analytical\nand numerical results for this problem. In Section 3, we describe our model and the numerical\nmethods used. These involve an \"integration\" of the Vlasov-Boltzmann equations for the\nbinary mixture in contact with a surface. In Section 4, we present results obtained from our\nsimulations. Finally, Section 5 is devoted to a summary and discussion of the results.\n\nII. SUMMARY OF AVAILABLE RESULTS\n\nA. Experimental Studies\n\nOne of the earliest experiments on phase-separating binary fluids near a surface is due to\nGuenoun et al. [6], which considered unstable mixtures of cyclohexane (C) and methanol (M)\nin contact with a surface which preferred M. The surface rapidly developed a M-rich layer,\nfollowed by a bicontinuous domain structure. Guenoun et al. found that domain growth\nwas characterized by a number of different length scales. Thus, the wetting layer grew as\nR1 (t) ∼ ta with a ≃ 0.56. The domains adjacent to the wetting layer were anisotropic and\nwere characterized by perpendicular (L⊥ (t) ∼ tb with b ≃ 0.64) and parallel (Lk (t) ∼ tc with\nc ≃ 1) scales.\nWiltzius et al. [7] considered critical fluid mixtures of polyisoprene (PI) and PEP sealed\nbetween two quartz plates. They found that the structure factor exhibited two peaks - one\ncorresponding to the usual bulk domain length scale Lb (t) ∼ t and the other corresponding\nto a fast length scale Ls (t) ∼ t3/2 . Furthermore, they found that the dimensionality of\n\n3\n\n\fdomain growth associated with the fast length scale was d = 2, suggesting that it resulted\nfrom a rapid coarsening in the surface layer. The rapid surface growth was interpreted\nas a prelude to the formation of a complete wetting layer on the surface. In that case,\nthere is no inconsistency between their results and the earlier results of Guenoun et al. [6],\nwhich correspond to later times when a complete wetting layer was already formed. Similar\nexperiments were also performed by Shi and collaborators [8] on mixtures of guaiacol and\nglycerol-water confined in a thin-film geometry.\nDetailed studies of the morphologies which arise for phase-separating mixtures confined\nto 1- and 2-dimensional capillaries were performed by Tanaka and co-workers [9] on critical\nand off-critical mixtures of polyvinyl-methyl-ether (PVME) and water, and ǫ-caprolactone\noligomer (OCL) and styrene oligomer (OS). In particular, they clarified conditions under\nwhich the equilibrium state is completely wet (i.e., only the preferred phase is in contact\nwith the surface) or partially wet (i.e., both phases are in contact with the surface). Tanaka's\ngroup did not observe the fast growth reported by Wiltzius and co-workers [7,8], possibly\nbecause the quench depth in their experiments was too large. Once the wetting layer is\nformed, they found that its thickness grows linearly in time, i.e., R1 (t) ∼ t, in disagreement\nwith the experiments of Guenoun et al. [6]. In most of their experiments, the wetting layer\nis finally destabilized by a Rayleigh instability and the system crosses over to a partially wet\nmorphology.\n\nB. Analytical Arguments\n\nThe equilibrium behavior of immiscible binary fluids in contact with a substrate was\nexamined long ago by Young [10]. Let γA and γB be the surface energies per unit area for\nthe fluids A and B in contact with the substrate (say, γB > γA ); and let σ be the surface\ntension between fluids A and B. Then, the contact angle θ between A and the surface is\ngiven by σ cos θ = γB − γA . This equation has no solution when (γB − γA )/σ > 1, which\ncorresponds to a situation where the preferred fluid (A) completely wets the substrate. The\n4\n\n\feffects of geometry and composition can also be included [9,11,12].\nThe nonequilibrium problem we consider is a homogeneous critical binary mixture (at\nhigh temperature) in contact with a surface which has a preference for one of the components\nof the mixture. At time t = 0 the system is quenched below its critical temperature and\nbecomes unstable to phase separation. We are interested in the dynamics of approach to the\nequilibrium morphology, which will consist of either partially wet (PW) or completely wet\n(CW) configurations. Typically, the surface is initially coated by the preferred component,\nwhich is then followed by the growth of the wetting layer [9]. We focus here on the wetting\nlayer growth.\nAs remarked by Siggia [5] the bicontinous morphology of critical or near critical phase\nseparating binary fluids consists essentially of interpenetrating \"tubes\". When a tube of the\npreferred phase establishes contact with the surface layer the curvature induced pressure\ngradient σ/L2 leads to a flow of material from the tube to the surface. The material flux per\ntube can be estimated for example from Poiseuille law to be (σ/η)L2 [5]. Then S(dR1 /dt) ∼\n(σ/η)L(t)2 × (S/L(t)2 ), where S is the surface area and S/L(t)2 is the number of tubes.\nThus, R1 (t) ∼ (σ/η)t for the hydrodynamic problem, a result which has been confirmed\nexperimentally [9]. We believe that the discrepancy between this result and the earlier\nexperimental work of Guenoun et al. [6] is due to the long-lived transient growth laws\ndependent upon the form of the surface potential [13]. For the diffusive case the chemical\npotential gradient between the bulk tube, μ ∼ (σ/L) [1], and the flat tube portion at the\nsurface, μ ∼ 0, induces a current j ∼ (σ/L2 ) and therefore a flux per tube ∼ σ. The\ncorresponding growth law is then R1 (t) ∼ σ 1/3 t1/3 .\nThe wetting layer grows until it reaches the equilibrium length (dictated by the composition for a CW morphology), or is destabilized by surface fluctuations and goes over to\nthe appropriate equilibrium PW morphology. There is also a dynamical coupling of phase\nseparation and the growth of the wetting layer, which leads to the domains adjacent to the\nwetting layer being anisotropic with L⊥ (t) < Lk (t) [6,4].\n\n5\n\n\fC. Numerical Results\n\nOne of the earliest numerical studies of the hydrodynamic problem is due to Keblinski et\nal. [15], who performed molecular dynamics (MD) simulations of binary fluids (AB) confined\nin a 2-dimensional capillary (or a planar thin film). One of the cases that they study is when\nthe wall preferentially attracts A, which is analogous to the experiments we have discussed\nearlier. In this case they observe a \"fast mode\" in the surface layer but with an exponential\ngrowth rather than the power law growth.\nChen and Chakrabarti [16] have studied phase separation in 2-dimensional binary fluids\nnear a surface through numerical solutions of the coarse-grained model H equations [1] in a\nsemi-infinite geometry. The model H equations consist of coupled dynamical equations for\nthe order parameter and the fluid velocity field. Chen and Chakrabarti consider a surface\nwith a long-range attraction for one of the components of the mixture and impose \"no-slip\"\nconditions on the velocity field at the surface. They find that the wetting-layer growth\ncrosses over from R1 (t) ∼ t1/3 (characteristic of bulk diffusive growth in any dimension)\nto R1 (t) ∼ t2/3 (characteristic of bulk hydrodynamic growth in d = 2). This crossover is\nassociated with domains of the preferred component establishing contact with the surface\nlayer and their subsequent rapid draining into the surface layer.\nAnother study of model H in a semi-infinite geometry is due to Tanaka and Araki [17].\nThese authors solved the model H equations numerically in d = 3. They find that the\nwetting-layer thickness grows initially as R1 (t) ∼ t1/3 (characteristic of diffusive growth) and\nthen crosses over to the hydrodynamic regime with R(t) ∼ t. They also study characteristic\nlength scales in the layer parallel to the surface. Far from the surface, they find the expected\nbulk growth law Lk (t) ∼ t, while in the vicinity of the surface they find a faster growth.\nHowever, it seems difficult to unambiguously assign an exponent to this faster growth.\nFurthermore, the time-regime of the \"fast mode\" is considerably later than the time-scale of\nformation of the complete wetting layer. This suggests to us that the \"fast growth\" observed\nby Tanaka and Araki should be identified with the anisotropic growth (with L⊥ < Lk ) of\n6\n\n\fdomains in the vicinity of the wetting layer due to orientational effects of the wetting layer,\nrather than the \"fast mode\" of Wiltzius and others [7,8]. As we have discussed earlier, this\nfast mode is associated with the coating dynamics which results in a complete wetting layer.\nFinally, we mention a MD study by Toxvaerd [18] who investigated critical mixtures (AB)\nof particles interacting through Lennard-Jones potentials. He focused on the morphologies\nwhich arise for different wall-types, e.g., one wall attracts A whereas the other wall attracts\nB versus the case where both walls attract A and B equally, etc. Using MD simulation he\nfinds that the system evolves into a layered morphology, with the layer being parallel to the\nsurface walls. We believe that these are metastable configurations which evolve exceedingly\nslowly due to the low effective dimensionality (d = 1) of the system.\nThe paucity of detailed numerical results for binary fluids undergoing phase separation\nin contact with a wetting surface motivated us to undertake a mesoscopic-level simulation\nof this problem, through a direct \"solution\" of the relevant Vlasov-Boltzmann equations.\n\nIII. DESCRIPTION OF MODEL\n\nThe subtle interplay between diffusion and convection which occurs in phase-separating\nfluids makes the modeling of these systems more complicated than that of solids. The\nlocal conservation of linear momentum and energy, which is characteristic of fluids, and the\nassociated transport of matter and energy on macroscopic scales, plays a crucial role during\nphase segregation. Typically, the phase separation of binary fluids has been modeled either\n(a) at the microscopic level, e.g., via MD simulations, or (b) at the macroscopic level via\ncoarse-grained hydrodynamic equations. An alternative to these approaches was introduced\nin Ref. [19]. The system studied was a binary mixture consisting of A and B particles\nwith short range repulsive interactions, modeled by hard spheres with equal mass m and\ndiameter d, and a long-range Gaussian repulsion between the two components, A and B.\nThe dynamics was described by coupled Vlasov-Boltzmann kinetic equations:\n∂fi Fi ∂fi\n∂fi\n+v*\n+\n*\n= J[fi , f1 + f2 ]\n∂t\n∂r\nm ∂v\n7\n\ni = 1, 2\n\n(1)\n\n\fwhere fi (r, v, t) are the one-particle distribution functions, Fi (r, t) = −∇Vi (r), Vi (r) =\nR\n\nV (|r − r′|)nj (r′)dr′ (Vlasov potential), nj (r′) =\n\nR\n\nfj (r′, v, t)dv, with i 6= j, and J[f, g] is\n\nthe Boltzmann collision operator for hard core interactions [20]. The Boltzmann equation\nproperly describes the dynamics of dilute gases, where the free flow of the particles is interrupted by localized binary collisions between particles that are uncorrelated. The Vlasov\nterm takes into account the long-range interaction in the spirit of the mean-field approximation: each particle now moves between collisions in the background potential generated\nby all the other particles it is interacting with through the long-range potential V (r).\nThe above mesoscopic representation in terms of one-particle distribution functions has\nthe advantage that the relevant conservation laws are automatically satisfied, and it also\nprovides a rigorous route to a macroscopic description [21]. Computationally, the method\nintroduced in Ref. [19,22] to simulate the Vlasov-Boltzmann kinetics at the particle level,\ni.e., coupling of the direct simulation Monte Carlo (DSMC) algorithm [23] for close-range\ncollisions and the grid-weighting method for the long-range repulsions [24], contains the\nessential physical ingredients of the Vlasov-Boltzmann equations, and it permits the study\nof much bigger systems than those used in MD calculations.\nIn the present work, we modify the model of Ref. [19] to include the presence of a\npreferred surface. One of the components of the binary mixture (say, A) interacts with the\nsurface located at z = 0 through an attractive potential W (z), which decays as z −3 at large\ndistances, i.e., W (z) = −W0 if z ≤ r0 and −W0 (r0 /z)3 otherwise, where W0 > 0. This\ninteraction potential corresponds to the case of non-retarded van der Waals interactions\nin d = 3 [25]. The wall is diffusive [26], i.e., particles \"hitting\" the wall are absorbed\nand re-emitted isotropically with a velocity drawn from a Maxwellian distribution with the\ntemperature of the wall, TW . The other wall along the z direction is purely reflective (no\npreferred attraction), which allows us to run the simulations for longer times than if the setup was symmetric. We performed simulations with equal fractions of the components at fixed\ntemperature, T /Tc = 0.6, TW = T , where Tc is the bulk mean-field critical temperature of\nthe system, using the velocity-rescaling technique introduced by Berendsen et al. [27]. Below\n8\n\n\fTc the bulk fluid segregates into an A rich and a B rich components, denoted by 1 and 2\nrespectively. The parameter varied was the strength of the wall-particle interaction W0 .\nAs discussed in subsection 2.2, the wall-wetting morphology, i.e., completely wet (CW)\nversus partially wet (PW), is determined by the ratio σ/(γ2 − γ1 ), where σ is the surface\ntension between the two fluid phases 1 and 2; and γ1 , γ2 are the corresponding wall-fluid\nsurface tensions. Taking into account that A and B are partially miscible the surface tension\nparameters can be estimated as follows. Consider the A-rich phase (1) with average total\nparticle density n0 and average individual densities n01A and n01B , n0 = n01A + n01B . The\nwall-fluid surface energy is then\nγ1 =\n\nZ\n\n∞\n\ndzn1A (z)W (z)\n\n(2)\n\n0\n\nIf we neglect the inter-particle spatial correlations, which is appropriate in our model if\nthe long-range repulsion between the two components is sufficiently weak, we can write\nn1A (z) = n01A exp[−βW (z)]. With this assumption and using the fact that the phases are\nsymmetric, we obtain the expression\nγ2 − γ1 = kB T n0 φ0 r0 H(βW0 ),\n\n(3)\n\nwhere ±φ0 is the average order parameter in the two phases, φ0 = (n01A − n01B )/n0 , and\nthe function H(x) depends on the wall-interaction potential. For our choice of wall-particle\ninteraction we have\nH(x) = x[exp(x) + (1/2)\n\nZ\n\n1\n\n3\n\ndy exp(xy 2 )]\n\n0\n\nThe surface tension σ between the two phases 1 and 2 is related to the profile of the\nplanar interface separating the equilibrium phases [28]. For our system this can be written\nas\nσ=m\n\nZ\n\ndz{(d[nφ]/dz)2 − (dn/dz)2 }\n\n(4)\nR\n\n[28,29], where n(z)φ(z) = nA (z)−nB (z), n(z) = nA (z)+nB (z), and m = (1/12) drV (r)r 2,\nwith V (r) the long-range repulsive interaction between the two species. (NB. Here z stands\n9\n\n\ffor the distance from the center of a planar interface separating the two bulk phases.)\nAs remarked in [19] and is well-known for these systems [28], φ(z) is well represented as\nφ0 tanh(z/2ξ), where ξ is a correlation length that characterizes the interface thickness.\nFurthermore, the total density profile n(z) is well characterized as n0 [1−δsech(z/2ξ)], where\nφ0 and n0 are the values of the order parameter and density far from the interface. With\nthese considerations, the surface tension between phases 1 and 2 can be computed as:\nσ=\n\nkB Tc n0 G(φ0 , δ)\n.\n4γ 2 ξ\n\n(5)\n\nHere γ −1 is the range of the inter-species potential V (r) = αγ 3 U(γr), where, as in [19],\n3\n\nwe use U(x) = π − 2 exp(−x2 ) (note that kB Tc = n0 α/2 [19]). The function G(φ0 , δ) has a\nsimple algebraic form,\nG(φ0 , δ) = (2/3)φ20 − (1/3)δ 2 + (7/15)δ 2 φ20 − (π/4)δφ20\nTherefore, we obtain the desired ratio for Young's condition as\nTc G(φ0 , δ)\n1\nσ\n=\n.\n2\nγ2 − γ1\nT\nφ0 4γ ξr0 H(βW0)\n\n(6)\n\nThe physical quantities ξ, δ and φ0 have been obtained in simulations of the interface profile\nat T /Tc = 0.6 [19] as ξ ≃ 1.5γ −1 , φ0 ≃ 0.8, δ ≃ 0.2, and we set r0 = γ −1 . Recall that\nwe vary the surface potential strength W0 , and keep other parameters fixed as specified\nabove. We then estimate Young's condition as corresponding to βW0Y ≃ 0.071. We have\nperformed simulations with W0 /W0Y ranging from 0.67 to about 5. The size of the system\nwas 60 × 60 × 120 in units of the potential range γ −1 , and the number of particles used\nwas approximately N = 2.5 × 106 . For each value of W0 we averaged the results of 1215 independent runs, wherever statistical averaging was required. In the figures presented\nbelow the unit of length is γ −1 and the unit of time is the mean-free time between collisions\n1\n\n1\n\nτ = λ/c, λ = (2 2 πnd2 )−1 , c = (2kB T /m) 2 , where n is the overall particle density, d is the\nhard sphere diameter and T is the temperature.\n\n10\n\n\fIV. NUMERICAL RESULTS\n\nAs discussed in the previous section, W0 /W0Y < 1 and W0 /W0Y > 1 should correspond\nto the PW and CW cases, respectively. In our subsequent discussion, we will refer to\nW0 /W0Y < 1 as the weak-field case, and W0 /W0Y > 1 as the strong-field case. Of course, we\nshould stress that there are additional entropic effects, which have not been accounted for\nin our calculation. In general, this would raise the critical surface field for transition from\nPW to CW morphologies.\nFig. 1 shows 3-dimensional snapshots of the evolution for W0 /W0Y = 0.67 at times\nt = 60, 120 and 180. The wall is located at z = 0 (extreme right) and preferentially attracts\nA, though it is not completely wetted by A. The enrichment layer (in A) at the surface\nis followed by a depletion layer in A; and this layered structure deforms continuously into\nthe bulk, as has been seen in various earlier studies for both the diffusive [14], [4] and\nhydrodynamic [17] cases. Fig. 2 shows laterally-averaged profiles φav (z, t) vs. z (depth from\nthe surface) for the evolution depicted in Fig. 1 at times t = 50, 100, 200 and 275. These\nprofiles are obtained by averaging the order parameter profiles in the direction parallel\nto the surface – analogous to the corresponding experimental situation [3]. There is a\nsystematic profile at the surface, which decays to zero (due to isotropic phase separation) in\nthe bulk. The systematic surface profile propagates into the bulk with the passage of time.\nFurthermore, the degree of enrichment diminishes as isotropic phase separation in the bulk\ndestroys the layered structure at the surface.\nTo characterize the morphology of the surface layer, Fig. 3 plots the first and second\nzeros of the laterally-averaged profiles as a function of time. After an initial transient regime,\nthe position of the first and second zeros grow approximately linearly in time. The linear\ngrowth of the first zero results from hydrodynamic draining of the preferred material to the\nsurface through bulk tubes which make contact with the surface layer. This is in accordance\nwith the observation of Tanaka and Araki [17], and the mechanism for this was discussed\nin subsection 2.2. Additionally, it is reasonable to expect that the overall composition of\n11\n\n\fthe first and second layers should be comparable with the average composition. Thus, we\nexpect the second zero, R2 (t), to exhibit the same scaling behavior as the first zero, R1 (t).\nNext we consider the evolution for the (very) strong-field case, where the surface is completely wetted by the preferred component. Fig. 4 shows 3-dimensional evolution pictures\nfor the case W0 /W0Y = 4 at t = 60, 120, 180. Notice the perfectly layered structure at the\nsurface. Figs. 1 and 4 should be compared with analogous pictures for the diffusive problem\n[4]. Fig. 5 shows the corresponding laterally-averaged profiles at t = 50, 100, 200 and 275.\nThe broad features are the same as in Fig. 2, but the level of enrichment (depletion) of A\nin the surface layer (next-to-surface layer) is much higher. This layered structure evolves\nmore slowly in time because the bulk domains have not established contact with the surface layer on the time-scales of our simulation. Thus, growth of the wetting layer occurs\nonly through diffusive transport of A from the bulk through the depletion layer in A. There\nare two regimes for diffusive growth [13]. In the first regime, the attractive force due to\nthe surface potential gives a potential-dependent growth law. In the asymptotic regime,\nthe chemical potential gradient between the domains in the bulk and the flat wetting layer\ngives rise to an asymptotic growth law R1 (t) ∼ t1/3 , provided that the preferred component\nis not the majority component. The crossover time between the first and second regimes\ndepends on the strength and range of the surface potential [13]. In the present case, we\nhave a long-ranged surface potential (V (z) ∼ z −3 ). The corresponding exponent for the\npotential-dependent growth regime is φ = 0.2 (in general, φ =\n\n1\nn+2\n\nfor V (z) ∼ z −n [13]);\n\nand the asymptotic exponent for diffusive growth is φ = 1/3.\nThe growth of the location of the first and second zeros of the laterally-averaged profile\nfor this case is shown as a function of t1/3 in Fig. 6. This plot is consistent with growth\ndriven by the chemical potential gradient between curved domains in the bulk and the\nflat wetting layer. As we have remarked earlier, the strong layering inhibits the operation\nof draining modes to the surface layer, which would give rise to the expected asymptotic\nbehavior R1 (t) ∼ t. We also show in Fig. 7 the growth of the first zero of the laterallyaveraged profiles for all cases that we studied. The sharpness of the transition between the\n12\n\n\fgrowth in the weak and strong field cases is remarkable and is in very good agreement with\nour analysis of the partial and complete wetting morphologies.\n\nV. DISCUSSION\n\nOur mesoscopic-level modeling is in terms of coupled Vlasov-Boltzmann equations for\nbinary hard-sphere mixtures with additional long range interactions. The major advantage of\nour modeling is that it enables the study of much larger systems than those accessible in MD\nsimulations. At the same time, we are still able to identify scales and parameters in terms\nof microscopic quantities – in contrast to modeling via coarse-grained partial differential\nequations.\nThe present work has focused on the morphology and temporal evolution of surfacedirected spinodal decomposition waves in critical binary fluids. We have considered parameter values where the surface is either partially wet or completely wet in equilibrium. It\nis not our argument that the asymptotic behavior of these two cases is different. Rather,\nwe would like to stress the appearance of long-lived transient regimes which are critically\ndependent on the morphology. These should be of relevance in the interpretation of experiments. A confusing range of exponents have been reported in various studies and we believe\nthat the present work helps systematize these exponents.\n(a) Let us first focus on the diffusive problem. These are relevant for binary fluids at\nearly times. Furthermore, if the composition of the binary fluid is such that the domain\nmorphology is not continuous, domain growth again proceeds through diffusive processes\n[1]. For cases where the preferred component is the minority component, the wetting layer\n1\n\nexhibits a potential-dependent growth law, R1 (t) ∼ t n+2 for V (z) ∼ z −n [13], which crosses\nover to a universal growth law, R1 (t) ∼ t1/3 . The crossover time depends on the surface field\nstrength and the wetting-layer morphology. For cases where the preferred component is the\nmajority component, a potential-dependent growth law applies for all time [13].\n(b) Let us next consider the hydrodynamic case. For strongly off-critical compositions,\n13\n\n\fhydrodynamic growth modes are inactive because of the discontinuous domain morphology.\nAs we have stated earlier, the results quoted in (a) apply for this case. For bicontinuous bulk\nmorphologies, wetting-layer growth can be characterized as follows. There is an early-time\ngrowth (\"fast mode\", with Ls (t) ∼ t3/2 ) associated with the formation of a coating layer\n[7,9]. Subsequently, we expect the wetting layer to exhibit the diffusive behavior outlined in\n(a) above. The asymptotic regime (R1 (t) ∼ t) is accessed when the bulk establishes contact\nwith the wetting layer, enabling the activation of hydrodynamic draining modes. Again, the\ncrossover to the asymptotic behavior is dependent on the surface field strength and surface\nmorphology, and can be substantially delayed for strongly-layered surface structures.\n\nACKNOWLEDGEMENTS\n\nS.P. is grateful to Department of Mathematics, Rutgers University, where this work was\ninitiated. Research supported in part by NSF Grant DMR-9813268 and AFOSR Grant\nF49620-98-1-0207.\n\n14\n\n\fREFERENCES\n†\n\nPresent address: Lawrence Livermore National Laboratory, P. O. Box 808, Livermore,\nCA 94550. Email: bastea2@llnl.gov\n[1] For reviews, see K. Binder, in Materials Science and Technology, Vol. 5: Phase Transformations in Materials (ed. R.W. Cahn, P. Haasen and E.J. Kramer), p. 405, VCH,\nWeinheim, New York (1991); A.J. Bray, Adv. Phys. 43, 357 (1994); J.D. Gunton, M.\nSan Miguel and P.S. Sahni, in Phase Transitions and Critical Phenomena, Vol. 8, C.\nDomb and J.L. Lebowitz, editors, Academic Press, New York (1983); P.F. Fratzl, J.L.\nLebowitz, O. Penrose and J. Amar, Phys. Rev. B 44, 4794 (1991).\n[2] R.A.L. Jones, L.J. Norton, E.J. Kramer, F.S. Bates and P. Wiltzius, Phys. Rev. Lett.\n66, 1326 (1991).\n[3] For a review of experimental techniques and results for this problem, see G. Krausch,\nMater. Sci. Eng. R. R14, 1 (1995).\n[4] For a review of modeling and numerical simulations of this problem, see S. Puri and\nH.L. Frisch, J. Phys. Condens. Mat. 9, 2109 (1997); K. Binder, J. Non-Equil. Thermody.\n23, 1 (1998).\n[5] E.D. Siggia, Phys. Rev. A 20, 595 (1979).\n[6] P. Guenoun, D. Beysens and M. Robert, Phys. Rev. Lett. 65, 2406 (1990); Physica A\n172, 137 (1991).\n[7] P. Wiltzius and A. Cumming, Phys. Rev. Lett. 66, 3000 (1991); A. Cumming, P. Wiltzius, F.S.Bates and J.H. Rosedale, Phys. Rev. A 45, 885 (1992).\n[8] B.Q.Shi, C. Harrison and A. Cumming, Phys. Rev. Lett. 70, 206 (1993); C. Harrison,\nW. Rippard and A. Cumming, Phys. Rev. E 52, 723 (1995).\n[9] H. Tanaka, Phys. Rev. Lett. 70, 53, (1993); Europhys. Lett. 24, 665 (1993); Phys. Rev.\n15\n\n\fE 54, 1709 (1996); H. Tanaka and T. Sigekuzi, Phys. Rev. E 52, 829 (1995).\n[10] T. Young, Phil. T. R. Soc. Lond. 95, 69 (1805); see also Ref. [28].\n[11] A.J. Liu, D.J. Durian, E. Herbolzheimer and S.A. Safran, Phys. Rev. Lett. 65, 1897\n(1990).\n[12] J.W. Cahn, J. Chem. Phys. 66, 3667 (1977).\n[13] S. Puri and K. Binder, Phys. Rev. Lett. 86, 1797 (2001); H.W. Diehl and S. Puri, in\npreparation.\n[14] For example, see S. Puri and K. Binder, Phys. Rev. A 46, R4487 (1992); Phys. Rev.\nE 49, 5359 (1994); J. Stat. Phys. 77, 145 (1994); S. Puri, K. Binder and H.L. Frisch,\nPhys. Rev. E 56, 6991 (1997).\n[15] P. Keblinski, W.-J. Ma, A. Maritan, J. Koplik and J.R. Banavar, Phys. Rev. E 47,\nR2265 (1993); Phys. Rev. Lett. 72, 3738 (1994); W.-J. Ma, P. Keblinski, A. Maritan,\nJ. Koplik and J.R. Banavar, Phys. Rev. E 48, R2362 (1993).\n[16] H. Chen and A. Chakrabarti, Phys. Rev. E 55, 5680 (1997).\n[17] H. Tanaka and T. Araki, Europhys. Lett. 51, 154 (2000).\n[18] S. Toxvaerd, Phys. Rev. Lett. 83, 5318 (1999).\n[19] S. Bastea and J.L. Lebowitz, Phys. Rev. Lett. 78, 3499 (1997).\n[20] S. Chapman and T.G. Cowling, The Mathematical Theory of Non-uniform Gases, (Cambridge University Press, London, 1970).\n[21] S. Bastea, R. Esposito, J.L. Lebowitz and R. Marra, J. Stat. Phys. 101, 1087 (2000).\n[22] S. Bastea, Comp. Phys. Comm. bf 121-122, 270 (1999).\n[23] G.A. Bird, Molecular Gas Dynamics, (Clarendon Press, Oxford, 1976).\n\n16\n\n\f[24] C.K. Birdsall and A.B. Langdon, Plasma Physics Via Computer Simulation, (McGrawHill Book Company, New York, 1985).\n[25] J.P. Hansen and I.R. McDonald, Theory of Simple Liquids, Academic Press, Orlando\n(1986).\n[26] C. Cercignani, R. Illner and M. Pulvirenti, The Mathematical Theory of Dilute Gases,\nSpringer-Verlag, New York (1994).\n[27] H.J.C. Berendsen, J.P.M. Postma, W.F. van Gunsteren, A. Nicola and J.R. Haak, J.\nChem. Phys. 81, 3684 (1984).\n[28] J.S. Rowlinson and B. Widom, Molecular Theory of Capillarity, Clarendon Press, Oxford (1982).\n[29] S. Bastea, Ph.D. Thesis, Rutgers University, New Brunswick (1997).\n\n17\n\n\fFIGURES\n\nFIG. 1. Snapshots of the evolution after a critical quench for a weak-field case W0 /W0Y = 0.67.\nThe equilibrium surface morphology is partially wet. The times corresponding to the pictures are\n(from top to bottom) t = 60, 120, 180.\n\n18\n\n\f0.6\n\n0.3\n\nφav(z,t) 0\n−0.3\n\n−0.6\n\n0\n\n25\n\nz\n\n50\n\n75\n\nFIG. 2. Laterally-averaged order parameter profiles, φav (z, t), as a function of z, the distance\nfrom the surface. Parameter values are the same as those for the evolution depicted in Fig. 1. The\nevolution times are t = 50 (dot-dashed), 100 (dotted), 200 (dashed) and 275 (solid line).\n\n19\n\n\f30\n\n20\n\nR1,2(t)\n10\n\n0\n\n0\n\n100\n\n200\n\n300\n\nt\nFIG. 3. Time-dependence of first zero R1 (t) (circles); and second zero R2 (t) (triangles), of the\nlaterally-averaged profiles shown in Fig. 2.\n\n20\n\n\fFIG. 4. Analogous to Fig. 1, but for a (very) strong-field case W0 /W0Y = 4, where the surface\nis completely wetted by the preferred component in equilibrium.\n\n21\n\n\f1\n\n0.5\n\nφav(z,t) 0\n−0.5\n\n−1\n\n0\n\n25\n\nz\n\n50\n\n75\n\nFIG. 5. Analogous to Fig. 2, but for the evolution depicted in Fig. 4 for the strong-field case.\nThe profiles are shown at times t = 50 (dot-dashed), 100 (dotted), 200 (dashed) and 275 (solid\nline).\n\n22\n\n\f20\n\nR1,2(t) 10\n\n0\n\n0\n\n3\n\n1/3\n\n6\n\nt\nFIG. 6. Plot of first zero R1 (t) vs.\n\nt1/3\n\n(circles); and second zero R2 (t) vs. t1/3 (triangles), of\n\nthe laterally-averaged profiles shown in Fig. 5.\n\n23\n\n\f10\n\nR1(t)\n\n1\n\n1\n\n10\n\nt\n\n100\n\nFIG. 7. Time evolution of the first zero, R1 , of the laterally-averaged profile for all cases studied:\nfrom top, W0 /W0Y = 0.67, 1.33, 2.67, 4.0 and 5.33.\n\n24\n\n\f"}