{"id": "http://arxiv.org/abs/cond-mat/0603301v1", "guidislink": true, "updated": "2006-03-10T20:25:03Z", "updated_parsed": [2006, 3, 10, 20, 25, 3, 4, 69, 0], "published": "2006-03-10T20:25:03Z", "published_parsed": [2006, 3, 10, 20, 25, 3, 4, 69, 0], "title": "Experimental characterization of vibrated granular rings", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0508545%2Ccond-mat%2F0603184%2Ccond-mat%2F0603550%2Ccond-mat%2F0603744%2Ccond-mat%2F0603291%2Ccond-mat%2F0603715%2Ccond-mat%2F0603419%2Ccond-mat%2F0603294%2Ccond-mat%2F0603809%2Ccond-mat%2F0603041%2Ccond-mat%2F0603355%2Ccond-mat%2F0603462%2Ccond-mat%2F0603304%2Ccond-mat%2F0603845%2Ccond-mat%2F0603392%2Ccond-mat%2F0603772%2Ccond-mat%2F0603296%2Ccond-mat%2F0603276%2Ccond-mat%2F0603713%2Ccond-mat%2F0603437%2Ccond-mat%2F0603718%2Ccond-mat%2F0603501%2Ccond-mat%2F0603672%2Ccond-mat%2F0603498%2Ccond-mat%2F0603002%2Ccond-mat%2F0603530%2Ccond-mat%2F0603724%2Ccond-mat%2F0603751%2Ccond-mat%2F0603127%2Ccond-mat%2F0603051%2Ccond-mat%2F0603491%2Ccond-mat%2F0603604%2Ccond-mat%2F0603420%2Ccond-mat%2F0603464%2Ccond-mat%2F0603316%2Ccond-mat%2F0603848%2Ccond-mat%2F0603758%2Ccond-mat%2F0603158%2Ccond-mat%2F0603359%2Ccond-mat%2F0603636%2Ccond-mat%2F0603068%2Ccond-mat%2F0603802%2Ccond-mat%2F0603580%2Ccond-mat%2F0603285%2Ccond-mat%2F0603513%2Ccond-mat%2F0603332%2Ccond-mat%2F0603543%2Ccond-mat%2F0603450%2Ccond-mat%2F0603442%2Ccond-mat%2F0603411%2Ccond-mat%2F0603219%2Ccond-mat%2F0603253%2Ccond-mat%2F0603183%2Ccond-mat%2F0603086%2Ccond-mat%2F0603016%2Ccond-mat%2F0603152%2Ccond-mat%2F0603746%2Ccond-mat%2F0603465%2Ccond-mat%2F0603575%2Ccond-mat%2F0603301%2Ccond-mat%2F0603287%2Ccond-mat%2F0603608%2Ccond-mat%2F0603638%2Ccond-mat%2F0603118%2Ccond-mat%2F0603351%2Ccond-mat%2F0603044%2Ccond-mat%2F0603617%2Ccond-mat%2F0603650%2Ccond-mat%2F0603602%2Ccond-mat%2F0603266%2Ccond-mat%2F0603269%2Ccond-mat%2F0603603%2Ccond-mat%2F0603117%2Ccond-mat%2F0603343%2Ccond-mat%2F0603393%2Ccond-mat%2F0603446%2Ccond-mat%2F0603779%2Ccond-mat%2F0603047%2Ccond-mat%2F0603151%2Ccond-mat%2F0603829%2Ccond-mat%2F0603574%2Ccond-mat%2F0603540%2Ccond-mat%2F0603594%2Ccond-mat%2F0603249%2Ccond-mat%2F0603633%2Ccond-mat%2F0603659%2Ccond-mat%2F0603747%2Ccond-mat%2F0603140%2Ccond-mat%2F0603005%2Ccond-mat%2F0603485%2Ccond-mat%2F0603525%2Ccond-mat%2F0603749%2Ccond-mat%2F0603134%2Ccond-mat%2F0603336%2Ccond-mat%2F0603709%2Ccond-mat%2F0603664%2Ccond-mat%2F0603222%2Ccond-mat%2F0603125%2Ccond-mat%2F0603227%2Ccond-mat%2F0603082%2Ccond-mat%2F0603196&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Experimental characterization of vibrated granular rings"}, "summary": "We report an experimental study of the statistical properties of vibrated\ngranular rings. In this system, a linked rod and bead metallic chain in the\nform of a ring is collisionally excited by a vertically oscillating plate. The\ndynamics are driven primarily by inelastic bead-plate collisions and are\nsimultaneously constrained by the rings' physical connectedness. By imaging\nmany instances of the ring configurations, we measure the ensemble averages and\ndistributions of several physical characteristics on the scale of individual\nbeads and composite ring. We study local properties such as inter-bead\nseperation and inter-bonds angles, and global properties such as the radius of\ngyration and center of mass motion. We characterize scaling with respect to the\nsize of the chain.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0508545%2Ccond-mat%2F0603184%2Ccond-mat%2F0603550%2Ccond-mat%2F0603744%2Ccond-mat%2F0603291%2Ccond-mat%2F0603715%2Ccond-mat%2F0603419%2Ccond-mat%2F0603294%2Ccond-mat%2F0603809%2Ccond-mat%2F0603041%2Ccond-mat%2F0603355%2Ccond-mat%2F0603462%2Ccond-mat%2F0603304%2Ccond-mat%2F0603845%2Ccond-mat%2F0603392%2Ccond-mat%2F0603772%2Ccond-mat%2F0603296%2Ccond-mat%2F0603276%2Ccond-mat%2F0603713%2Ccond-mat%2F0603437%2Ccond-mat%2F0603718%2Ccond-mat%2F0603501%2Ccond-mat%2F0603672%2Ccond-mat%2F0603498%2Ccond-mat%2F0603002%2Ccond-mat%2F0603530%2Ccond-mat%2F0603724%2Ccond-mat%2F0603751%2Ccond-mat%2F0603127%2Ccond-mat%2F0603051%2Ccond-mat%2F0603491%2Ccond-mat%2F0603604%2Ccond-mat%2F0603420%2Ccond-mat%2F0603464%2Ccond-mat%2F0603316%2Ccond-mat%2F0603848%2Ccond-mat%2F0603758%2Ccond-mat%2F0603158%2Ccond-mat%2F0603359%2Ccond-mat%2F0603636%2Ccond-mat%2F0603068%2Ccond-mat%2F0603802%2Ccond-mat%2F0603580%2Ccond-mat%2F0603285%2Ccond-mat%2F0603513%2Ccond-mat%2F0603332%2Ccond-mat%2F0603543%2Ccond-mat%2F0603450%2Ccond-mat%2F0603442%2Ccond-mat%2F0603411%2Ccond-mat%2F0603219%2Ccond-mat%2F0603253%2Ccond-mat%2F0603183%2Ccond-mat%2F0603086%2Ccond-mat%2F0603016%2Ccond-mat%2F0603152%2Ccond-mat%2F0603746%2Ccond-mat%2F0603465%2Ccond-mat%2F0603575%2Ccond-mat%2F0603301%2Ccond-mat%2F0603287%2Ccond-mat%2F0603608%2Ccond-mat%2F0603638%2Ccond-mat%2F0603118%2Ccond-mat%2F0603351%2Ccond-mat%2F0603044%2Ccond-mat%2F0603617%2Ccond-mat%2F0603650%2Ccond-mat%2F0603602%2Ccond-mat%2F0603266%2Ccond-mat%2F0603269%2Ccond-mat%2F0603603%2Ccond-mat%2F0603117%2Ccond-mat%2F0603343%2Ccond-mat%2F0603393%2Ccond-mat%2F0603446%2Ccond-mat%2F0603779%2Ccond-mat%2F0603047%2Ccond-mat%2F0603151%2Ccond-mat%2F0603829%2Ccond-mat%2F0603574%2Ccond-mat%2F0603540%2Ccond-mat%2F0603594%2Ccond-mat%2F0603249%2Ccond-mat%2F0603633%2Ccond-mat%2F0603659%2Ccond-mat%2F0603747%2Ccond-mat%2F0603140%2Ccond-mat%2F0603005%2Ccond-mat%2F0603485%2Ccond-mat%2F0603525%2Ccond-mat%2F0603749%2Ccond-mat%2F0603134%2Ccond-mat%2F0603336%2Ccond-mat%2F0603709%2Ccond-mat%2F0603664%2Ccond-mat%2F0603222%2Ccond-mat%2F0603125%2Ccond-mat%2F0603227%2Ccond-mat%2F0603082%2Ccond-mat%2F0603196&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report an experimental study of the statistical properties of vibrated\ngranular rings. In this system, a linked rod and bead metallic chain in the\nform of a ring is collisionally excited by a vertically oscillating plate. The\ndynamics are driven primarily by inelastic bead-plate collisions and are\nsimultaneously constrained by the rings' physical connectedness. By imaging\nmany instances of the ring configurations, we measure the ensemble averages and\ndistributions of several physical characteristics on the scale of individual\nbeads and composite ring. We study local properties such as inter-bead\nseperation and inter-bonds angles, and global properties such as the radius of\ngyration and center of mass motion. We characterize scaling with respect to the\nsize of the chain."}, "authors": ["Z. A. Daya", "E. Ben-Naim", "R. E. Ecke"], "author_detail": {"name": "R. E. Ecke"}, "author": "R. E. Ecke", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epje/i2006-10038-8", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0603301v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0603301v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 14 figures", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0603301v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0603301v1", "journal_reference": "Eur. Phys. Jour. E 21, 1 (2006)", "doi": "10.1140/epje/i2006-10038-8", "fulltext": "Experimental characterization of vibrated granular rings\nZ. A. Daya1,2, E. Ben-Naim1,3 & R. E. Ecke1,2,3\n1\n\narXiv:cond-mat/0603301v1 [cond-mat.soft] 10 Mar 2006\n\n3\n\nCenter for Nonlinear Studies, 2 Condensed Matter & Thermal Physics Group,\nTheoretical Division, Los Alamos National Laboratory, Los Alamos, NM 87545\n(Dated: November 9, 2018)\n\nWe report an experimental study of the statistical properties of vibrated granular rings. In this\nsystem, a linked rod and bead metallic chain in the form of a ring is collisionally excited by a\nvertically oscillating plate. The dynamics are driven primarily by inelastic bead-plate collisions and\nare simultaneously constrained by the rings' physical connectedness. By imaging many instances\nof the ring configurations, we measure the ensemble averages and distributions of several physical\ncharacteristics on the scale of individual beads and composite ring. We study local properties such\nas inter-bead seperation and inter-bonds angles, and global properties such as the radius of gyration\nand center of mass motion. We characterize scaling with respect to the size of the chain.\nPACS numbers: 05.40.a, 81.05.Rm, 82.35.Lr\n\nI.\n\nCCD\n\nINTRODUCTION\n\nIn the last decade the study of granular materials has\nbecome a mainstream pursuit amongst physicists who\nhave summarized the advances in recent reviews [1, 2, 3].\nThe broad spectrum of static and dynamic behaviors of\ngranular media are being studied by a combination of\nstate-of-the-art experiments, computer simulations and\ntheoretical approaches. Shaken granular materials are\none example of a comprehensively studied subset of this\nspectrum. Experiments and simulations on shaken grains\nhave demonstrated a variety of phenomena such as localized structures [4], extensive patterns [5, 6], clustering\n[7, 8], compaction [9, 10] and non-Maxwellian statistics\n[11, 12].\nGranular chains consist of hollow spheres connected\nby rods, i.e., grains constrained by a chain backbone.\nIn granular chains we get the juxtaposition of the hard\ngrains of granular physics with the flexibility of polymers.\nThe chains can be excited, say, by collisions with a vibrating plate and can be observed visually. As such they\nafford a simple system for the direct measurements of\nmicro- and macro-scopic variables. Experiments on granular chains, supported by theoretical models and simulations, have probed the diffusive relaxation of a simply\nknotted chain [13], the dynamical behavior of a vertically excited hanging chain [14], the entropic tightening\nof a once-twisted \"figure-8\" ring [15] and the spontaneous\nformation of spirals [16].\nIn this paper we report our study of vibrated granular\nrings. Our experimental system consists of a vertically\noscillated plate on which we place a granular ring constructed from a ball chain; a schematic is shown in Fig. 1.\nRings are constructed by joining the two free ends of a\nchain. A chain with free ends suffers unequal excitation\nalong its length since beads near the ends are less constrained and thus preferentially excited. Rings, which\nare devoid of free ends, restore the equality in excitation\namongst the beads, and it is for this reason that they are\nparticularly attractive to study.\nIn our experiments we control the amplitude and fre-\n\nanodized plate\n\n00\n11\n11\n00\n111\n000\n00\n11\n00\n11\n00\n11\n0\n1\n000\n111\n00\n11\n0\n1\n000\n111\n00\n11\n0\n1\n000\n111\n00\n11\nlinear air 1\n0\n000\n111\n00\n11\n0\n1\n000\n111\n00\n11\nbearing 1\n0\n000\n111\n00\n11\n0\n1\n000\n111\n0\n1\n000\n111\n0\n1\n000\n111\n\n1\n0\n11\n00\n1\n0 0\n1\n0\n1\n0\n1\n00 1\n11\n0\n0\n1\n00\n11\n0\n1\n0\n1\n00\n11\n0\n1\n0\n1\n00\n11\n0\n1\n0\n1\n00\n11\n0\n1\n0\n1\n00\n11\n0\n1\n0\n1\n00\n11\n0\n1\n00\n11\n0\n00 1\n11\n0\n1\n\naccelerometer\nleveling\nplate\n\nplatform\n\nelectromechanical\nvibrator\n\nFIG. 1: A schematic of our experimental apparatus.\n\nquency of the harmonically oscillated plate. A chain initially resting on the plate becomes airborne when the\nplate imparts to it an acceleration that exceeds the gravitational acceleration. Thereafter, collisions between the\nplate and chain appear to randomize the motion and\nshape of the granular ring. The collisions of different\nparts of the chain are asynchronous with the phase of the\nplate's oscillation. Further collisions amongst the beads\non the chain occur frequently.\nWe observe the ring from above at a random phase\nof the oscillation. We acquire images which are twodimensional projections of the position of the ring. From\nthese images we obtain the spatial coordinates and order\nof the beads in the ring. Since the images are sequential\nand time stamped, we are also able to calculate differ-\n\n\f2\nences and therefore dynamics. We make a large number\nof position measurements for rings under vertical vibration. From this data we study the geometrical properties on the bead scale, i.e., local characteristics, and on\nthe scale of the chain, i.e., global characteristics. The\nlocal properties include the inter-bead separations, the\nbending angle between two consecutive rods, the average curvature and the dynamics of the beads. For the\nglobal characteristics we focus on descriptors of the size\nand overall motion of the ring. These are the radius of\ngyration and the dynamics of the rings' center of mass.\nThis paper is organized as follows. In Section II we\ndescribe the experimental apparatus, the specific design\nconsiderations, the image acquisition and analysis procedure. Our experimental results depend at most on the\nordered positions of the beads in a ring and on the data\nacquisition rate. We have divided the results into local\nand global properties which are discussed in Sections III\nand IV respectively. Local (global) properties are relevant to the scale of the bead (ring). We discuss the\nthe inter-bead separation, the inter-rod angle, the average curvature and the bead dynamics as local properties.\nFor global characteristics we discuss the radius of gyration and the average motion of the ring center of mass.\nA conclusion and an outline of future directions follows\nin Section V.\n\nII.\n\nEXPERIMENT\n\nIn this Section we describe our experimental apparatus\nand our data extraction procedure. In overall design, the\napparatus is comprised of an electromechanical shaker\nthat drives a plate which is observed by a CCD camera.\nA schematic of our experimental setup is shown in Fig. 1.\n\nA.\n\nThe electromechanical vibration assembly\n\nA commercial electromechanical shaker driven by a sinusoidal voltage input is used to oscillate a plate. The\nshaker operates electromagnetically with the currentcarrying coil armature oscillating in the strong magnetic\nfield of permanent ceramic magnets. The electromechanical shaker is coupled to the plate by a shaft but is otherwise vibrationally isolated from the rest of the apparatus.\nA massive aluminum platform that is rigidly bolted to\nthe laboratory floor acts as a low-pass filter of vibrational\nnoise. The shaft is guided by the bore of a precise squaresection linear air bearing. In addition to linear motion,\nthe square-section shaft decouples the plate from the rotational torque in the drive. The driving is thus accurately uni-axial and a leveling plate facilitates alignment\nwith gravity. The shaft is coupled to the plate by two\nconcentric cylindrical tubes. A sensitive accelerometer is\nattached centrally on the underside of the plate.\nThe plate is driven harmonically with amplitude A and\nangular velocity ω = 2πf , where f is the driving fre-\n\nquency. The dimensionless peak acceleration Γ = Aω 2 /g,\nwhere g is the gravitational acceleration, and the frequency f specify the driving conditions for the experiment. The shaker is operated at f = 16 Hz and Γ = 2.12\nfor all the experiments described in this paper. The\nshaker is protected from bearing the combined weight\nof the plate and shaft by adjustable counter-weighting\nsprings such that the drive oscillates about its natural\nequilibrium position.\n\nB.\n\nThe plate and the granular rings\n\nThe plate is circular with a diameter of 11.50 inches\nand is made of stress-relieved aluminum. The primary\ndesign requirements are light weight, flexural stiffness\nand surface hardness. Aluminum's low density and comparable flexural properties to most metals make it a suitable choice. On oscillation we expect that bending modes\nof the plate are excited. The higher the stiffness the\nhigher the frequecies excited. Since our experiments have\ndrive frequency f ∼ 10 Hz, we designed the plate so that\nits excitable bending modes had much higher frequencies.\nThis is accomplished by tapering the lower surface of the\nplate and by boring out cylinders from this surface in a\nspace-filling azimuthally symmetric manner. The cylinders bored out of the aluminum have various depths and\ndiameters. The plate is at its thickest 1.50 inches decreasing to 0.25 inches at the boundary. These considerations\nlead to a selective damping of pure modes of the shaken\nplate. A further safeguard against exciting modes of the\nplate is achieved by forcing the plate at two annular regions rather than at the center or at the edge. The annular regions are at radial locations 1.25 ≤ r ≤ 2.00 and\n4.88 ≤ r ≤ 6.00 inches. Surface hardness needed to withstand the many metal on metal collisions of the chains\nhitting the plate is attained by hard black anodization of\nthe aluminum plate.\nThe granular chains are commercially available ball\nchains. They consist of hollow, approximately-spherical\nshells that are connected by dumb-bell shaped rods. We\nuse two types of ball chains in our experiments. The\nsmaller is made from nickel-plated stainless steel rods\n3\nand beads. The beads have a nominal diameter of 32\n1\ninches. The larger is a 8 inch diameter brass chain. Thus\nthere are typically 100 beads across the plate diameter.\nThe chains are connected end to end to make rings. The\nsplicing together of the free ends is natural in the sense\nthat a rod from one of the end beads is inserted into the\nshell of the other end bead. The joined free ends could\nseldom be identified in the constructed ring. The tightest\nrings that we could make have 8 beads. Hence the angle θ between two consecutive rods is constrained so that\n0 ≤ θ ≤ 50◦ . Our experiments use rings with N beads\nwhere 13 ≤ N ≤ 309. The rings are laterally confined to\nthe plate by an acryllic boundary.\n\n\f3\nC.\n\nData extraction\n\nOur data consist of digital images of the granular ring\non the plate. We illuminate the chain using approximately normally-incident light from far above the plate.\nTo minimize reflection from the background, we paint\nthe acryllic boundary black. Additionally, before blackanodizing the flat surface of the plate is roughened by\nsand blasting. The very shallow surface inhomogeniety helps randomize even simple collisions with the plate\nand diffusively scatters far-field light. The poorly reflective background reduces noise in the digital image. The\nnormal far-field illumination gives an almost uniform reflected light intensity across the plate area. Furthermore,\nthe light reflected by the beads is primarily from the\ncenter of the beads. Non-normal lighting preferentially\nilluminates crescent-shaped areas on the surface of the\nbeads. A representative raw image is shown in Fig. 2a.\nTypically, our images are acquired at sampling rates\nof 0.25 − 16 Hz and have a resolution of approximately\n1000 × 1000 pixels. Depending on the data set we have\nbetween 8.8 and 13.0 pixels to the bead diameter d. The\nreflected light is brightest from the the center of the\nbeads and diminishes radially outwards. A sequence of\nstandard image analysis procedures such as background\nsubtraction, intensity rescaling, high-pass thresholding\nand smoothing result in reducing the data into roughly\nN × 7 × 7 non-zero pixels for N beads. Local maxima\nin the intensity field are then determined and ranked by\ntheir peak intensity. The intensity field of each set of\n5 × 5 pixels centered about a local maximum is fit to an\nazimuthally symmetric Gaussian. The fit parameters of\nthe position of the Gaussian peak are taken as the subpixel coordinates of the bead. The fit to the standard\ndeviation of the Gaussian gives an estimate to the positional accuracy of about 0.05 bead diameters. Figure 2c\nshows a blow up of part of the raw image in Fig. 2a and\nour determination of the bead centers.\nIn most of the images, our data extraction procedure\nresulted in more than N local maxima. Most of these\noccur when a rod appears brighter than a bead. A rod\nbetween two beads is visible in Fig. 2c. The frequency of\nthis occurrence is about 1% of the number of beads. Since\nthe distance between the position of a rod and an adjacent bead is smaller than the minimum distance between\ntwo adjacent balls, we eliminated these by iteratively applying a strict minimum distance criterion.\nThe next step is to order the N coordinates so that the\nring can be reconstructed. The ordering algorithm uses\nthe geometrical restrictions imposed by the interconnecting rods. Given two adjacent beads, the third is searched\nfor in the sector defined by the maximum inter-bead separation and angle. This efficient greedy algorithm requires N 2 operations to order an N bead chain. The\noverall accuracy of our data extraction process exceeds\n96% ,i.e., in less than 4% of the images are we unable to\nreconstruct the chain. There are various reasons for this.\nThe beads are constructed by crimping sheet metal and\n\n0\n\n400\n\n800\n\n400\n\n800\n\n(b)\n\nFIG. 2: (a) Raw data image, (b) reconstruction by identifying\nthe bead coordinates (in pixels) and order, and (c) overlay of\na section of the raw image and the position data (•) for the\ncenter of the beads. Locally bright regions between beads in\n(c) correspond to reflection from an interconnecting rod.\n\n\f4\n1.25\n\n0.30\n\n1.00\n\nσδ\n\n<δ>\n\nso have a seam running along one half of a great circle.\nThe seam is comparatively duller in reflected light than\nany other part of the beads and so in a few images our\nextraction process misses these beads. Since the images\nare two-dimensional projections of the chain, the strict\ninter-bead distance criteria can appear to be violated. In\nthese cases our algorithms may allow a false bead position. In Fig. 2b, we show a complete reconstruction of\na chain from the raw image data in Fig. 2a. Given the\nsmall number of misidentifications, we are confident that\nthese issues have a small effect on the results reported\nbelow.\n\n0.20\n\n0.75\n\n0.10\n\n0.50\n\nIn this Section we present our results on the local properties of vertically vibrated granular rings. Local properties are relevant to the scale of the bead and here we\ndiscuss the inter-bead separation, the inter-rod angle, the\naverage curvature and the bead dynamics. We noted earlier that the chains are constructed out of hollow shells\nthat are connected by rods. This connection imposes\nconstraints on the minimum and maximum separation\nbetween beads, on the maximum bending that 3 adjacent beads can sustain, and on the displacements that\noccur on excitation.\n\nA.\n\n1\n\n2\n\n10\n\nLOCAL PROPERTIES\n\nN\n\n10\n\nFIG. 3: The mean hδi(◦) and standard deviation σδ (•) of the\ninter-bead separations δ vs ring length N .\n\n0.4\n\n0.3\n\nP(δ)\n\nIII.\n\n0.2\n\nInter-bead separations\n\n0.1\n\nThe inter-bead separation δ = |ri+1 − ri | is measured\nbetween every two consecutive bead positions for brass\nand nickel rings. ri is position of bead i in two dimensions. Hence, there are N measurements of δ for an N bead ring. Our data is based on no fewer than 5200 measurements of δ for N = 13 and more than 105 samples for\nN ≥ 256. From these data, we construct the probability\ndistribution function of the inter-bead separations P (δ).\nIn Fig. 3, we plot the mean hδi and standard deviation\nσδ as a function of N . For N sufficiently large, hδi and σδ\nare independent of N . The distributions P (δ) are similar\nin gross feature for the brass and nickel rings for the various lengths N . Combining the data for 30 ≤ N ≤ 309,\nwe obtain the distribution function shown in Fig. 4. The\ndistribution has a sharp cut-off at δ ≈ 1.4 corresponding\nto the maximal extension between the beads. A much\nsofter small δ cut-off appears at δ ≈ 0.8. The minimal\ndistance in an accurately two-dimensional chain would be\nat δ = 1. The quasi-two-dimensional motion of the chain\nand our measuring the motion on a planar projection allows values of δ < 1. The peak of the distribution at\nsmall separations is possibly due to bead-bead frictional\neffects. Between the small-δ peak and the upper-δ cut-off\nwe find that the distribution is roughly flat. These intermediate separations occur with significant and approximately equal probability, perhaps because of the constant\nrod-bead friction at these extensions.\n\n0.0\n\n0.8\n\n1.0\n\nδ\n\n1.2\n\n1.4\n\nFIG. 4: The probability distribution P (δ) for the inter-bead\nseparations. The distribution combines data for rings with\nlengths 30 ≤ N ≤ 309. The dashed line δ = 1(1.4) in the\ntheoretical lower (upper) bound.\n\nB.\n\nBending angles\n\nGiven the positional ordering ri−1 , ri , ri+1 of three consecutive beads in the ring, we describe the bending by\ncos θ =\n\ndri−1 * dri\n,\n|dri−1 ||dri |\n\n(1)\n\nwhere dri = ri+1 − ri . There are N values of cos θ for\nevery N -bead ring. As with the inter-bead separations,\nwe have approximately 5200 measurements of cos θ for\nN = 13 and more than 105 samples for N ≥ 256 from\nwhich we determine the distribution function. In Fig. 5,\nwe plot the mean hcos θi and standard deviation σcosθ\nof the bending distribution functions for granular rings\nas a function of N . As N increases, hcos θi → 1 and\n\n\f5\n\n1 − hcos θi ∼ N −0.6 .\n\n(2)\n\nThis implies that the chain curvature decreases slowly as\nthe chain length increases.\nThe bending distributions for representative small and\nlarge rings are shown in Fig. 7. The distributions peak\nnear cos θ ∼ 1 and monotonically decrease for smaller\ncos θ. The peak and range depends weakly on the number of beads N . The peak probability for bending angles\nis higher for the longer rings whereas the range of bending angles is larger for the shorter chains. There are\nsignificant quantitative differences (not shown) between\nthe distributions for brass and nickel rings but the qualitative features are similar. The principal difference is\nat large angles where the greater flexibility of the brass\nchains increases the range of variation in cos θ.\nC.\n\nAverage curvature\n\nThe vibrated rings sample many microscopic configurations subject only to the stretching and bending constraints imposed by the interconnecting rods and by mu-\n\nFIG. 5: The mean hcos θi (◦) and standard deviation σcosθ\n(•) of the bending angle cos θ vs ring length N . The dashed\nline corresponds to the lower bound set for hcos θi by a ring\nwith N = 8.\n\n-1\n\n1-<cos θ>\n\nσcosθ → 0. This large N behavior implies that a long ring\nis primarily composed of locally straight segments. For N\napproaching the smallest ring size of 8 beads, hcos θi →\n0.7 consistent with the tightest bending.\nThe large N limiting behavior of the mean bending angle is particularly interesting. In Fig. 6, we plot the difference between the limiting value of unity and the measured hcos θi. For an ideal circular ring with N beads,\n1 − hcos θi ∼ N −2 . We find that although the granular\nring becomes locally straight as its length increases, it\ndoes so very differently from a circular ring. Our data\nshow a gentler approach with\n\n10\n\n10\n\n-2\n\n10\n\n1\n\n2\n\n10\n\nN\nFIG. 6: Plot of 1 − hcos θi vs N . The dashed line is, up to\na constant, N −0.6\n\ntual self-exclusion. One of the properties of the configuration is the overall extent to which the ring is curved. To\nprobe this feature we use the ordered positions to compute the average squared curvature K which we define\nas\n\nK= H\n\nH\n\nk(s) * k(s) ds\n,\nkcircle (s) * kcircle (s) ds\n\n(3)\n\nwhere k is given by\nk(s) =\n\nd2 r\n;\nds2\n\nr(s) = (x(s), y(s)) .\n\n(4)\n\nIn Eq. 4, s is the arc length along the chain and r(s)\nis a unit-speed reparametrization of the chain. Then,\nby definition |dr/ds| ≡ 1 so k(s) measures the way\n\nFIG. 7: The probability distribution of the bending angle\nP (cos θ) for rings with lengths N = 32(◦) and N = 128(2).\n\n\f6\ndeviates from a circle. The standard deviation σK from\nthe data shows a scaling relation σK ∼ N λ with λ ∼ 1.5.\nThis observation is consistent with Eq. 2.\n\n2\n\n<K>, σΚ\n\n10\n\n1\n\nD.\n\n10\n\n0\n\n10\n\n10\n\n-1\n\n10\n\n1\n\nN\n\n10\n\n2\n\nFIG. 8: The mean hKi (◦) and standard deviation σK (•) of\nthe squared curvature, K vs ring length N . The horizontal\ndashed line K = 1 represents a circle. The solid lines are\nproportional to N 1.5 and N 2 .\n\nthe chain turns. kcircle (s) is obtained by computing\nEq. 4 for a circle with circumference equal to the arc\nlength of the chain. The local squared curvature is\nk(s)\n= k(s)\nH\nH * k(s). Averaging over the ring we get\nk(s) ds/ ds. Similarly for the circle with circumference equal to the\nH chain's length,\nH we have an average\nsquared curvature kcircle (s) ds/ ds. Normalizing the\naverage squared curvature of the ring by that of an equal\narc length circle, we get the quantity K defined in Eq. 3.\nAs a procedure, for each ring, we first calculate its circumference by adding the separations between adjacent\nbeads. We then reparameterize the positions of the beads\nby the arc length s so that ri = (xi , yi ) = (x(si ), y(si ))\nsuch that the ring has unit\nH circumference and is traversed\nwith unit speed. Since kcircle (s) * kcircle (s) ds = 4π 2\nfor a circle of unit length and speed, we have normalized K such that as the ring approaches a circle K → 1.\nHence K measures the departure from a circular shape.\nIn practice, the integral in Eq. 3 is replaced by a summation over the N discrete bead positions and k(si ) is\napproximated by the difference\nk(si ) =\n\nd2 ri\n=\nds2i\n\n1\n2 (si+1\n\ndri+1 − dri\n.\n− si ) + 21 (si − si−1 )\n\n(5)\n\nUsing in excess of 6800 images or approximately 425\nrealizations per chain, we have measured the mean and\nrms values of K for brass and nickel rings for several N .\nIn Fig. 8, we plot the mean hKi and standard deviation\nσK as a function of N . The two smallest rings have\nN = 13 and 20. They are approximately circular and\ntightly constrained, resulting in hKi ≈ 1; the smallest\nring has N = 8 and is practically rigid. For larger N we\nfind that the scaling exponent μ ∼ 2 in the power-law\nhKi ∼ N μ for 20 ≤ N ≤ 256. This implies, in agreement\nwith Eq. 2, that as N increases, the ring increasingly\n\nBead displacements\n\nThe dynamics of the beads are studied by measuring\nthe displacement of a bead as a function of time. It is well\nknown that the mean square displacement of a randomly\nexcited particle scales linearly with time while ballistic\nmotion results in quadratic scaling. It is interesting to\nprobe how a bead constrained to the ring behaves.\nWe restrict our analysis to images acquired at 16 Hz\nwhich is sufficiently fast so that bead positions between\ntwo consecutive images show small changes. Consequently, we can identify beads in an image with the preceding image. Discerning the bead identity is increasingly more difficult with slower image acquisition rates\nsince the bead displacements are quite large. The ordered position data of the beads in the ring is obtained\nas described earlier in Section II C. Then assuming the\nbead identity in the first image, we order the bead positions of the second image so that they correspond to the\npreceding image. Since there is only 1 plate oscillation\nand therefore on average 1 chain excitation between consecutive images, we are confident that we have accurately\nidentified the beads. Additionally, we visually verify the\nordering for a subset of the data sets. We implement\nour bead identity algorithm by translating the data from\nboth images to a common center of mass and then minimizing the mean square position difference between the\ntwo images up to cyclic permutations and orientation of\nthe second image. The procedure is iterated until all the\nimages are properly ordered.\nThe squared displacement that bead i in a ring\nwith N beads undergoes between time τ and τ + t is\n∆ri2 (t, τ, N ) = (ri (τ + t) − ri (τ )) * (ri (τ + t) − ri (τ )). For\nthe data, the times τ and t are chosen to coincide with\nthe image acquisitions, i.e., multiples of 1/16 s, and the\ndisplacement is measured in units of the bead diameter.\nNote that both images are translated to the origin, i.e.,\nthe center of mass is subtracted from the bead coordinates before calculating the squared displacement.\nAveraging over all beads i in the ring and over possible\nvalues of τ , we define the mean squared bead displacement:\nh∆r2 i(t, N ) = h∆ri2 (t, τ, N )iτ,i .\n\n(6)\n\nWe probe the time dependence of h∆r2 i by assuming\na length dependent constant factor β(N ) such that the\nmean squared displacements are the same for the shortest experimentally observed time t = 1/16 s. In Fig. 9,\nwe plot h∆r2 i/β(N ) versus t. For times corresponding to\nabout 10 plate oscillations, h∆r2 i/β(N ) increases linearly\nwith time for all rings. This behaviour is consistent with\ndiffusive motion. Thus, although the ring is mechanically and athermally driven, collective properties may\n\n\f7\n2\n\nis sufficiently short to deduce an instantaneous velocity.\nSince the bead-plate collisions occur over a range of phase\nin the oscillation, however, the beads encounter a range\nof displacements. Large displacements correspond to collisions and smaller displacements to beads being dragged\nalong by the chain connectedness. In Fig. 10, we plot\nthe probability distribution function of ∆r2 measured at\nt = 1/16 s. The squared displacement is normalized\nby its mean value. Our data show that small squared\ndisplacements are highly probable decaying slowly until\nO(h∆r2 i). For larger displacements the probability decays more rapidly and the large displacement tail decay\nis consistent with (∆r2 )−4 .\n\n10\n\n2\n\n<∆r >/β(Ν)\n\n1\n\n10\n\n0\n\n10\n\n-1\n\n10\n\n0.1\n\n1\n\nt\n\nIV.\n\nFIG. 9: The mean squared displacements h∆r 2 i of the beads\nas a function of time t for various ring length N . The displacements are scaled by a ring length-dependent constant β(N )\nso that all h∆r 2 i are the same for the shortest experimentally\nobserved time t = 1/16 s. The dashed line is proportional to\nt. The h∆r 2 i for the smallest ring N = 13 is shown in black\nsolid circles.\n\n0\n\nGlobal characteristics of granular rings probe the overall conformation and dynamics of the chain. Below we describe the conformation, roughly speaking, by the chain's\nsize. The size, defined to be the mean radius of gyration,\nis obtained by averaging over many observations. The\nglobal dynamics are described by the motion of the center of mass of the ring.\nA.\n\n10\n\nRadius of Gyration\n\nA measure of the global size of a long chain or a polymer is its radius of gyration. Since the chain's configuration is constantly changing owing to collisional excitation\nwith the plate, better measures are the statistical averages of radius of gyration. Given the N position coordinates ri = (xi , yi ) for the beads i = 1, .., N , we calculate\nthe radius of gyration Rg from\n\n-1\n\nprobability\n\nGLOBAL PROPERTIES\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-1\n\n10\n\n0\n\n1\n\n10\n2\n\n10\n2\n\n∆r /<∆r >\nFIG. 10:\nThe probability distribution function for the\n∆r 2 /h∆r 2 i at t = 1/16 s for all ring lengths N . The dashed\nline has slope −4.\n\nstill behave as if they are randomly (thermally) forced\n[13, 15]. For shorter times the mean squared displacements increase faster than linearly with time for all but\nthe smallest ring which is consistent with the expected\ncrossover from very short time ballistic motion to long\ntime diffusive dynamics.\nFor the shortest observation interval of t = 1/16 s,\nwe study the distribution of the squared displacements.\nSince each bead in the ring collides with the plate, on\naverage, once per oscillation, it is highly probable that\nseveral beads in the chain will have altered direction due\nto a collision. Thus, it is unlikely that the 1/16 s interval\n\nRg 2 =\n\nN\n1 X\n(ri − rcm )2 ,\nN i=1\n\n(7)\n\nwhere rcm = (xcm , ycm ) is given by\n\nrcm =\n\nN\n1 X\nri .\nN i=1\n\n(8)\n\nSince our coordinates are in units of the bead diameter d, the radius of gyration Rg is in these units. We\nhave measured Rg for granular rings for several values of\nN . Since there are no self-intersections, the ring can be\nlikened to a self avoiding walk that returns to itself.\nAveraging over approximately 450 realizations per\ngranular ring of length N , we measure the mean and\nrms values of Rg . In Fig. 11, we plot hRg i and σRg as a\nfunction of N for 13 ≤ N ≤ 309. In these experiments\nthe lateral boundary has a radius of 53.2 bead diameters.\nThis is an absolute upper bound on hRg i and is shown by\nthe horizontal line in Fig. 11. Our hRg i data for nickel\n\n\f8\n\n0\n\n10\n\n10\n\n1\n\n<v>, σv\n\n<Rg>, σR\n\ng\n\n10\n\n0\n\n-1\n\n10\n\n10\n\n-1\n\n10\n\n1\n\nN\n\n10\n\nFIG. 11: The mean (◦) and standard deviation (•) of the\nradius of gyration vs the length of the rings N . The dashed\nhorizontal line is the radius of the plate. The two solid lines\nhave slopes of 3/4 (top) and 1 (bottom), respectively.\n\nand brass chains are consistent and increase with N . A\npower-law fit for the range 20 ≤ N ≤ 219 gives an exponent ν = 0.85 ± 0.05. The σRg data in Fig. 11 shows\na linear increase with N for 20 ≤ N ≤ 219 with a sharp\ndrop for larger N . The sharp drop is associated with the\nconstraining effect of the lateral boundary.\nSelf avoiding walks have universal scaling characteristics in the large-N limit. In particular, hRg i ∼ N ν with\nFlory exponent ν = 34 in two dimensions [17, 21]. Experiments with surface adsorbed DNA[18], polymer molecular monolayers[19] and connected plastic spheres[20] have\nmeasured exponents consistent with the 2D Flory value\nν = 43 . Both the DNA and plastic chain had free ends\nand by being constrained to 2D were self-avoiding. Our\nmeasured exponent ν = 0.85 ± 0.05 is for a ring (likened\nto self avoiding walk that closes on itself) and is somewhat higher though not inconsistent with these experiments. The σRg increase linearly with N in the range\n20 ≤ N ≤ 219.\n\nB.\n\n1\n\n2\n\nCenter of Mass Motion\n\nUnder oscillation the rings sample many configurations\nwith different positions of their center of mass. Since\nthe plate is accurately level, the rings do not drift gravitationally. Any motion of the center of mass is then\nassociated with the overall mobility of the rings. We\nstudy the motion of the center of mass of nickel rings\nwith 13 ≤ N ≤ 309. The data are acquired at 16 Hz\nwhich is sufficiently fast for probing the motion of the\nring's center of mass. Given the center of mass rcm we\ncalculate the magnitude of the average velocity v given\n\n2\n\n10\n\nN\n\n10\n\nFIG. 12: The mean (◦) and standard deviation (•) of the\ncenter of mass velocity. The straight lines are power-law fits\nto the data with slopes -0.67 (mean) and -0.59 (standard deviation), respectively.\n\nby\n\nv=\n\nr\n\ndrcm drcm\n*\n.\ndt\ndt\n\n(9)\n\n¿From approximately 400 images per ring we measure\nthe mean and rms values of v. In Fig. 12, we plot the\nmean hvi and standard deviation σv for several N . For\nour largest ring N = 309 significant interaction with the\nlateral boundary appears to be responsible for the unexpectedly large hvi and σv . Assuming scaling relations\nhvi ∼ N η and σv ∼ N ζ power-law fits for 13 ≤ N ≤ 256\ngive η = −0.67 ± 0.08 and ζ = −0.59 ± 0.14. The speed\nv varies from just over 1 bead diameter/s for N = 13\nto about 1/10 bead diameters/s for N = 256. As N\nincreases more and more segments of the ring move independently resulting in large cancelations to contributions\nto center of mass motion. Qualitatively, this diminished\nmobility with increasing chain length resembles the behavior observed for a random polymer where the diffusivity is inversely proportional to the molecular weight\n[21].\nAs with the bead displacements studied in Section III D, we can study the dynamics of the ring center of\nmass. The squared displacement that ring center-of-mass\n2\nundergoes between time τ and τ + t is ∆Rcm\n(t, τ, N ) =\n(rcm (τ + t) − rcm (τ )) * (rcm (τ + t) − rcm (τ )). For the\ndata, the times τ and t are chosen to coincide with the\nimage acquisitions, i.e., multiples of 1/16 s and the displacement is measured in units of the bead diameter. Averaging over all possible values of τ we define the mean\nsquared ring center of mass displacement:\n2\n2\nh∆Rcm\ni(t, N ) = h∆Rcm\n(t, τ, N )iτ .\n\n(10)\n\n2\nThe time dependence of h∆Rcm\ni is plotted in Fig. 13.\n\n\f9\n\n2\nFIG. 13: The mean squared displacements h∆Rcm\ni of the\nring center of mass as a function of time t for various ring\nlength N . The displacements are scaled by an ring length2\ndependent constant α(N ) so that all h∆Rcm\ni are the same\nfor the shortest experimentally observed time t = 1/16 s. The\n2\ndashed lines are proportional to t and t2 . The h∆Rcm\ni from\nthe three longest rings N = 219, 256 and 309 are shown in\nmagenta, cyan and maroon open square symbols respectively.\n\nFIG. 14:\nThe probability distribution function for the\n2\n2\n∆RCM\n/h∆RCM\ni at t = 1/16 s for all ring lengths N . The\ndashed line has slope −1.5.\n\nments of beads on the rings.\n\nV.\n\nHere, we have assumed a length dependent constant factor α(N ) such that the mean squared displacements are\nthe same for the shortest experimentally observed time\nt = 1/16 s.\nFor times corresponding to less than about 10 plate os2\ncillations, the h∆Rcm\ni/α(N ) increase quadratically with\ntime for all rings except the three largest rings with N =\n219, 256 and 309. The constraining effect of the plate's\nlateral boundary explains the less than quadratic time\n2\ndependence of h∆Rcm\ni/α(N ) for large rings. For times\n2\nin excess of about 10 plate oscillations, the h∆Rcm\ni/α(N )\napproaches a linear increase with time. The short time\nbehaviour is consistent with ballistic motion of the ring\ncenter of mass. This suggests that at short times the\nmotion of the ring center of mass is dominated by coherent large bead displacements. The longer time behaviour\naverages over several, apparently random, large displacements resulting in the approach to diffusive motion.\nThe distribution of the squared displacements of the\nring center of mass is studied for the shortest observation interval of t = 1/16 s. At this time scale the center of mass motion is ballistic and so an average velocity proportional to the displacement may be infered. In\nFig. 14, we plot the probability distribution function of\n2\n∆Rcm\nmeasured at t = 1/16 s. The squared displacement\nis normalized by its mean value. Our data show that\nsmall squared displacements are highly probable with the\n2\nprobability decaying consistent with (∆Rcm\n)−1.5 . The\nsmall squared displacements of the ring center of mass\narise from averaging the almost independent motions of\nthe beads on the ring. The less probable large squared\ndisplacements occur from rarer coherent motions of seg-\n\nCONCLUSION\n\nIn this paper we presented an experimental study of\nvibrated granular rings. Our study elucidates the statistical characterization of various local and global properties. We have been particularly interested in power-law\nscaling of average properties with the chain size. Local\nproperties were on the scale of a bead. We specifically\nstudied the inter-bead separations, angles, shape and positional dynamics. Global or macroscopic properties were\non the scale of the entire chain. In particular our study\nprobed the size and overall motion of vibrated rings.\nThe size of various parts of the experimental apparatus limits our study to chains of moderate bead numbers\ntypically N < 300 for rings. Consequently the rings are\nanalogous to relatively short self-avoiding walks. Despite\nthe relatively short chain lengths, we are still able to deduce reasonable scaling laws. The mean global properties\ntypically show power-law scaling over the modest range\nin N with cross-over effects at small N and pronounced\nfinite-size effects at large N . Generally in between the\nextremes, power-law scaling appears to provide an adequate description.\nThe system of vibrating granular chains presents a\nfertile ground for experimentally studying nonequilibrium statistical mechanics. It is particularly well-suited\nsince it permits simultaneous measurements of microand macro-scopic variables. Our future experiments will\nprimarily concern this aspect in the setting of multi-chain\nexperiments. We expect to study groups of rings and\nfree-end chains and measure the average individual and\ncollective properties as they vary with density and conformation. The variation of the average individual or\n\n\f10\nmicroscopic properties with the macroscopic density will\nelucidate the statistical mechanics of this system. Rings\nof different N have different internal degrees of freedom.\nA tight ring with N = 8 is almost circular and has small\ndeviations from this configuration under vibrational excitation. Its space of configurations is small and we may\nthink of it as having almost zero internal degrees of freedom. Rings of larger N , however, have shapes that depart significantly from simple conformations and consequently a large configuration space and thus many internal degrees of freedom. The richness bestowed by the\n\nability to vary these internal degrees of freedom will permit the detailed study of their bearing on macroscopic\nproperties of a collection of such rings. Other cooperative\nbehavior arising from rings of different sizes, a collection\nfree-end chains and self-interactions between different regions of very long chains afford abundant possibilities for\nstudying nonequilibrium statistical physics.\nWe thank Mike Rivera and Brent Daniel for useful suggestions regarding the experiment and Matt Hastings.\nThis research is supported by the U.S. DOE (W-7405ENG-3\n\n[1] L.P. Kadanoff, Rev. Mod. Phys., 71, 435 (1999).\n[2] P.G. de Gennes, Rev. Mod. Phys., 71, S374 (1999).\n[3] H.M. Jaeger, S.R. Nagel, and R.P. Behringer, Rev. Mod.\nPhys., 68, 1259 (1996).\n[4] B. Umbanhower, F. Melo, and H.L. Swinney, Nature\n(London) 382, 793 (1996).\n[5] J.R. de Bruyn, C. Bizon, M.D. Shattuck, D. Goldman,\nJ.B. Swift, and H.L. Swinney, Phys. Rev. Lett., 81, 1421\n(1998).\n[6] J.R. de Bruyn, B. Lewis, M.D. Shattuck, and H.L. Swinney, Phys. Rev. E., 63, 041305 (2001).\n[7] A. Kudrolli, M. Wolpert, and J.P. Gollub,Phys. Rev.\nLett., 78, 1383 (1997).\n[8] J.S. Olafsen and J.S. Urbach, Phys. Rev. Lett., 81, 4369\n(1998).\n[9] J.B. Knight, C.G. Fandrich, Chun-Ning Lau,\nH.M. Jaeger, and S.R. Nagel, Phys. Rev. E.,\n51,\n3957 (1995).\n[10] E.R. Nowak, J.B. Knight, E. Ben-Naim, H.M. Jaeger,\nand S.R. Nagel, Phys. Rev. E., 57, 1971 (1998).\n[11] J.S. Olafsen and J.S. Urbach, Phys. Rev. E, 60, R2468\n(1999).\n\n[12] F. Rouyer and N. Menon, Phys. Rev. Lett., 85, 3676\n(2000).\n[13] E. Ben-Naim, Z.A. Daya, P. Vorobieff, and R.E. Ecke,\nPhys. Rev. Lett., 86, 1414 (2001).\n[14] A. Belmonte, M.J. Shelley, S.T. Eldakar, and C.H. Wiggins, Phys. Rev. Lett., 87 114301 (2001).\n[15] M.B. Hastings, Z.A. Daya, E. Ben-Naim, and R.E. Ecke,\nPhys. Rev. E., 66, 025102(R) (2002).\n[16] R. E. Ecke, Z. A. Daya, M. K. Rivera, and E. BenNaim, Materials Research Society Symposium Proceedings, 759, 129 (2003).\n[17] P. G. de Gennes, Scaling Concepts in Polymer Physics,\n(Cornell, Ithaca, 1979).\n[18] B. Maier and J.O. Rädler, Phys. Rev. Lett., 82, 1911\n(1999).\n[19] R. Villanove and F. Rondelez, Phys. Rev. Lett., 45, 1502\n(1980).\n[20] J.J. Prentis and D.R. Sisan, Phys. Rev. E., 65, 031306\n(2002).\n[21] M. Doi and S. F. Edwards, The Theory of Polymer Dynamics, (Clarendon Press, Oxford, 1986).\n\n\f"}