{"id": "http://arxiv.org/abs/cond-mat/0303372v1", "guidislink": true, "updated": "2003-03-19T05:46:27Z", "updated_parsed": [2003, 3, 19, 5, 46, 27, 2, 78, 0], "published": "2003-03-19T05:46:27Z", "published_parsed": [2003, 3, 19, 5, 46, 27, 2, 78, 0], "title": "Point contact spectroscopy of the electron-doped cuprate superconductor\n  Pr{2-x}Ce{x}CuO4: The dependence of conductance-voltage spectra on cerium\n  doping, barrier strength and magnetic field", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0303437%2Ccond-mat%2F0303014%2Ccond-mat%2F0303599%2Ccond-mat%2F0303152%2Ccond-mat%2F0303167%2Ccond-mat%2F0303564%2Ccond-mat%2F0303313%2Ccond-mat%2F0303262%2Ccond-mat%2F0303030%2Ccond-mat%2F0303301%2Ccond-mat%2F0303038%2Ccond-mat%2F0303022%2Ccond-mat%2F0303575%2Ccond-mat%2F0303312%2Ccond-mat%2F0303412%2Ccond-mat%2F0303546%2Ccond-mat%2F0303372%2Ccond-mat%2F0303382%2Ccond-mat%2F0303096%2Ccond-mat%2F0303559%2Ccond-mat%2F0303185%2Ccond-mat%2F0303366%2Ccond-mat%2F0303118%2Ccond-mat%2F0303480%2Ccond-mat%2F0303426%2Ccond-mat%2F0303295%2Ccond-mat%2F0303069%2Ccond-mat%2F0303282%2Ccond-mat%2F0303151%2Ccond-mat%2F0303091%2Ccond-mat%2F0303648%2Ccond-mat%2F0303099%2Ccond-mat%2F0303630%2Ccond-mat%2F0303255%2Ccond-mat%2F0303445%2Ccond-mat%2F0303209%2Ccond-mat%2F0303364%2Ccond-mat%2F0303315%2Ccond-mat%2F0303642%2Ccond-mat%2F0303140%2Ccond-mat%2F0303338%2Ccond-mat%2F0303276%2Ccond-mat%2F0303275%2Ccond-mat%2F0303192%2Ccond-mat%2F0303158%2Ccond-mat%2F0303496%2Ccond-mat%2F0303403%2Ccond-mat%2F0303641%2Ccond-mat%2F0303500%2Ccond-mat%2F0303464%2Ccond-mat%2F0303087%2Ccond-mat%2F0303463%2Ccond-mat%2F0303128%2Ccond-mat%2F0303561%2Ccond-mat%2F0303386%2Ccond-mat%2F0303230%2Ccond-mat%2F0303459%2Ccond-mat%2F0303168%2Ccond-mat%2F0303037%2Ccond-mat%2F0303114%2Ccond-mat%2F0303574%2Ccond-mat%2F0303306%2Ccond-mat%2F0303517%2Ccond-mat%2F0303109%2Ccond-mat%2F0303570%2Ccond-mat%2F0303106%2Ccond-mat%2F0303624%2Ccond-mat%2F0303654%2Ccond-mat%2F0303304%2Ccond-mat%2F0303355%2Ccond-mat%2F0303455%2Ccond-mat%2F0303156%2Ccond-mat%2F0303042%2Ccond-mat%2F0303407%2Ccond-mat%2F0303631%2Ccond-mat%2F0303083%2Ccond-mat%2F0303159%2Ccond-mat%2F0303528%2Ccond-mat%2F0303440%2Ccond-mat%2F0303085%2Ccond-mat%2F0303050%2Ccond-mat%2F0303577%2Ccond-mat%2F0303067%2Ccond-mat%2F0303245%2Ccond-mat%2F0303345%2Ccond-mat%2F0303470%2Ccond-mat%2F0303166%2Ccond-mat%2F0303417%2Ccond-mat%2F0303400%2Ccond-mat%2F0303188%2Ccond-mat%2F0303027%2Ccond-mat%2F0303031%2Ccond-mat%2F0303593%2Ccond-mat%2F0303289%2Ccond-mat%2F0303387%2Ccond-mat%2F0303307%2Ccond-mat%2F0303116%2Ccond-mat%2F0303231%2Ccond-mat%2F0303205%2Ccond-mat%2F0303243%2Ccond-mat%2F0303112&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Point contact spectroscopy of the electron-doped cuprate superconductor\n  Pr{2-x}Ce{x}CuO4: The dependence of conductance-voltage spectra on cerium\n  doping, barrier strength and magnetic field"}, "summary": "We present conductance-voltage (G-V) data for point contact junctions between\na normal metal and the electron doped cuprate superconductor Pr{2-x}Ce{x}CuO4\n(PCCO). We observe a zero bias conductance peak (ZBCP) for the under-doped\ncomposition of this cuprate (x=0.13) which is consistent with d-wave pairing\nsymmetry. For optimally-doped (x=0.15) and over-doped (x=0.17) PCCO, we find\nthat the G-V characteristics indicate the presence of an order parameter\nwithout nodes. We investigate this further by obtaining point contact\nspectroscopy data for different barrier strengths and as a function of magnetic\nfield.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0303437%2Ccond-mat%2F0303014%2Ccond-mat%2F0303599%2Ccond-mat%2F0303152%2Ccond-mat%2F0303167%2Ccond-mat%2F0303564%2Ccond-mat%2F0303313%2Ccond-mat%2F0303262%2Ccond-mat%2F0303030%2Ccond-mat%2F0303301%2Ccond-mat%2F0303038%2Ccond-mat%2F0303022%2Ccond-mat%2F0303575%2Ccond-mat%2F0303312%2Ccond-mat%2F0303412%2Ccond-mat%2F0303546%2Ccond-mat%2F0303372%2Ccond-mat%2F0303382%2Ccond-mat%2F0303096%2Ccond-mat%2F0303559%2Ccond-mat%2F0303185%2Ccond-mat%2F0303366%2Ccond-mat%2F0303118%2Ccond-mat%2F0303480%2Ccond-mat%2F0303426%2Ccond-mat%2F0303295%2Ccond-mat%2F0303069%2Ccond-mat%2F0303282%2Ccond-mat%2F0303151%2Ccond-mat%2F0303091%2Ccond-mat%2F0303648%2Ccond-mat%2F0303099%2Ccond-mat%2F0303630%2Ccond-mat%2F0303255%2Ccond-mat%2F0303445%2Ccond-mat%2F0303209%2Ccond-mat%2F0303364%2Ccond-mat%2F0303315%2Ccond-mat%2F0303642%2Ccond-mat%2F0303140%2Ccond-mat%2F0303338%2Ccond-mat%2F0303276%2Ccond-mat%2F0303275%2Ccond-mat%2F0303192%2Ccond-mat%2F0303158%2Ccond-mat%2F0303496%2Ccond-mat%2F0303403%2Ccond-mat%2F0303641%2Ccond-mat%2F0303500%2Ccond-mat%2F0303464%2Ccond-mat%2F0303087%2Ccond-mat%2F0303463%2Ccond-mat%2F0303128%2Ccond-mat%2F0303561%2Ccond-mat%2F0303386%2Ccond-mat%2F0303230%2Ccond-mat%2F0303459%2Ccond-mat%2F0303168%2Ccond-mat%2F0303037%2Ccond-mat%2F0303114%2Ccond-mat%2F0303574%2Ccond-mat%2F0303306%2Ccond-mat%2F0303517%2Ccond-mat%2F0303109%2Ccond-mat%2F0303570%2Ccond-mat%2F0303106%2Ccond-mat%2F0303624%2Ccond-mat%2F0303654%2Ccond-mat%2F0303304%2Ccond-mat%2F0303355%2Ccond-mat%2F0303455%2Ccond-mat%2F0303156%2Ccond-mat%2F0303042%2Ccond-mat%2F0303407%2Ccond-mat%2F0303631%2Ccond-mat%2F0303083%2Ccond-mat%2F0303159%2Ccond-mat%2F0303528%2Ccond-mat%2F0303440%2Ccond-mat%2F0303085%2Ccond-mat%2F0303050%2Ccond-mat%2F0303577%2Ccond-mat%2F0303067%2Ccond-mat%2F0303245%2Ccond-mat%2F0303345%2Ccond-mat%2F0303470%2Ccond-mat%2F0303166%2Ccond-mat%2F0303417%2Ccond-mat%2F0303400%2Ccond-mat%2F0303188%2Ccond-mat%2F0303027%2Ccond-mat%2F0303031%2Ccond-mat%2F0303593%2Ccond-mat%2F0303289%2Ccond-mat%2F0303387%2Ccond-mat%2F0303307%2Ccond-mat%2F0303116%2Ccond-mat%2F0303231%2Ccond-mat%2F0303205%2Ccond-mat%2F0303243%2Ccond-mat%2F0303112&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present conductance-voltage (G-V) data for point contact junctions between\na normal metal and the electron doped cuprate superconductor Pr{2-x}Ce{x}CuO4\n(PCCO). We observe a zero bias conductance peak (ZBCP) for the under-doped\ncomposition of this cuprate (x=0.13) which is consistent with d-wave pairing\nsymmetry. For optimally-doped (x=0.15) and over-doped (x=0.17) PCCO, we find\nthat the G-V characteristics indicate the presence of an order parameter\nwithout nodes. We investigate this further by obtaining point contact\nspectroscopy data for different barrier strengths and as a function of magnetic\nfield."}, "authors": ["M. M. Qazilbash", "Amlan Biswas", "Y. Dagan", "R. A. Ott", "R. L. Greene"], "author_detail": {"name": "R. L. Greene"}, "author": "R. L. Greene", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.68.024502", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0303372v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0303372v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 9 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0303372v1", "affiliation": "Center for Superconductivity Research, Department of Physics, University of Maryland at College Park", "arxiv_url": "http://arxiv.org/abs/cond-mat/0303372v1", "journal_reference": null, "doi": "10.1103/PhysRevB.68.024502", "fulltext": "arXiv:cond-mat/0303372v1 [cond-mat.supr-con] 19 Mar 2003\n\nPoint contact spectroscopy of the electron-doped cuprate\nsuperconductor Pr2−xCex CuO4 : The dependence of\nconductance-voltage spectra on cerium doping, barrier strength\nand magnetic field\nM. M. Qazilbash, Amlan Biswas, Y. Dagan, R. A. Ott and R. L. Greene\nCenter for Superconductivity Research, Department of Physics, University of Maryland,\nCollege Park, MD-20742\n(November 21, 2018)\n\nAbstract\n\nWe present conductance-voltage (G − V ) data for point contact junctions between a normal metal and the electron doped cuprate superconductor\nPr2−x Cex CuO4 (PCCO). We observe a zero bias conductance peak (ZBCP)\nfor the under-doped composition of this cuprate (x = 0.13) which is consistent with d-wave pairing symmetry. For optimally-doped (x = 0.15) and\nover-doped (x = 0.17) PCCO, we find that the G − V characteristics indicate\nthe presence of an order parameter without nodes. We investigate this further\nby obtaining point contact spectroscopy data for different barrier strengths\nand as a function of magnetic field.\nPACS No.s 74.80.Fp, 74.25.Jb, 74.50.+r, 74.76.Bz\n\nTypeset using REVTEX\n1\n\n\fI. INTRODUCTION\n\nPoint contacts between a normal metal and a superconductor have been extensively employed to probe the quasiparticle states of superconductors near the Fermi energy. Point\ncontact spectroscopy (PCS) experiments have also been done to investigate the pairing\nsymmetry of superconductors and the presence or absence of nodes in the superconducting\norder parameter [1]. In particular, in the hole doped copper oxide high Tc superconductors\n(HTSC), PCS and junction tunneling experiments have shown that the pairing symmetry\nis predominantly d-wave [2], strongly supporting the results of many other types of experiments [3]. Some of the tunneling experiments have even suggested a doping-dependent\norder parameter and the existence of a Quantum Critical Point (QCP) near optimum doping [4]. In the electron doped (n-doped) HTSC, the prior PCS and tunneling data has been\nmore controversial and there is no consensus at present on the implications of the data.\nThe reason is the absence of a zero bias conductance peak (ZBCP) in the tunneling spectra\n[5–7] which argues against the presence of d-wave pairing symmetry while other types of\nexperiments [8–10] support a d-wave pairing symmetry. In this paper, we present more\ndetailed PCS experiments on the n-doped HTSC Pr2−x Cex CuO4 (PCCO) in an attempt to\nbetter understand the pairing symmetry in the n-doped HTSC at all doping levels.\nThe theory of quasiparticle tunneling in a point contact junction between a normal metal\nand a conventional BCS-type superconductor has been developed by Blonder, Tinkham and\nKlapwijk (BTK) [11]. In the BTK model, the superconductor is assumed to have an isotropic\ngap in momentum space. The barrier between the normal metal and superconductor is\nmodelled by a delta function. The strength of the delta function is characterized by a\ndimensionless parameter Z. The Z = 0 limit signifies a completely transparent junction\nwhile Z >> 1 is the tunneling limit. This model has been very successful in explaining the\nfeatures of the G − V spectra for tunneling in conventional s-wave superconductors [12].\nFig. 1a shows calculated G − V characteristics for different barrier strengths.\nThe BTK model has been modified by Tanaka and Kashiwaya [13] for tunneling in\nsuperconductors with d-wave symmetry of the order parameter. The gap in a superconductor\nwith d-wave symmetry is of the form ∆k =∆0 Cos(2θk ) where θk is the angle of a wave vector\non the Fermi surface relative to [100]. The order parameter is anisotropic and changes\nsign in momentum space. Constructive interference between the electron-like and hole-like\nquasiparticles, which experience different signs of the order parameter, results in formation\nof surface bound states at the Fermi energy [14]. These surface bound states are also\nreferred to in the literature as Andreev bound states (ABS) and lead to enhancement of\ntunneling conductance at zero bias. The ZBCP is expected for tunneling into the ab-plane\nfor all surfaces except (100) and (010). The ZBCP reaches maximum height for tunneling\ninto (110) family of planes and Fig. 1b shows the tunneling spectra for such case. The G−V\ntunneling spectra in d-wave superconductors are direction-dependent assuming a specular\ninterface between the normal metal and superconductor. However, in practice the surface\nof the superconductor is rough on the atomic scale and this results in contribution to the\ntunneling current from facets of various orientations. When the effect of surface roughness\nis taken into account [15], the G − V spectra for tunneling into (100) and (010) planes\nalso exhibit a ZBCP. ZBCPs have been observed in hole-doped HTSC, most notably and\nconsistently in YBa2 Cu3 O7−δ (YBCO) for tunneling both into (100) and (110) orientations\n2\n\n\f[4,16,17].\nThe order parameter symmetry may be more complicated than simply s-wave or dwave, especially at the surface. This is of relevance because PCS essentially probes surface\nelectronic states. The theory for tunneling into superconductors with more complex pairing\nsymmetries, for example, anisotropic s-wave, extended s-wave and d + is has also been\ndeveloped [18].\nWhile most of the cuprate superconductors have holes as their charge carriers, the family\nof cuprate superconductors R2−x Cex CuO4 (R = La, Nd, Pr, Sm, Eu) is unique in the\nsense that its carriers are predominantly electrons. Several early tunneling spectroscopy\nand PCS experiments were performed on optimally-doped Nd1.85 Ce0.15 CuO4 (NCCO) [5–7]\nto investigate the density of states and pairing symmetry of this compound. All these\nexperiments revealed a gap-like feature in the G − V spectra of NCCO with no hint of a\nZBCP due to ABS. This led to the conclusion that the pairing symmetry for NCCO was not\nd-wave but either conventional or anisotropic s-wave, in stark contrast to the hole-doped\nHTSCs. However, two recent PCS and Scanning Tunneling Spectroscopy (STS) experiments\nhave observed ZBCP in optimally-doped NCCO [20,21]. Recently, we presented PCS data\non under-doped PCCO which provided convincing evidence for a ZBCP due to ABS [22].\nIn that work, evidence for a doping-dependent pairing symmetry was also presented.\nMeanwhile, penetration depth experiments on NCCO also supported the s-wave scenario\n[23–25]. However, it was later realized that the magnetic moment of the Nd3+ ions would\ninfluence these measurements and might point to a misleading conclusion. Subsequent experiments on the related optimally-doped compound, PCCO [9,10], which is not plagued\nby the magnetic moment problem, provide evidence for d-wave symmetry. However, other\npenetration depth experiments on optimally-doped PCCO and NCCO [26,27] are more consistent with s-wave pairing symmetry. The work of Skinta et al. [27] also presents evidence\nfor a doping dependence of the pairing symmetry.\nStrong evidence of d-wave symmetry for optimally-doped NCCO and PCCO was provided\nby the phase sensitive tri-crystal grain boundary junction (GBJ) experiment [8], angleresolved photoemission (ARPES) measurements [28,29] and Raman spectroscopy [30].\nHowever, these experiments, like tunneling and penetration depth measurements, are to\nsome extent sensitive to the surface of the sample and there is the issue that the surface\nmay be different from the bulk. Moreover, the doping near the grain boundaries may\nbe different from that in the bulk and could influence the results of the tri-crystal GBJ\nand the GBJ tunneling experiments. Measurements of bulk properties were expected to\nfinally resolve the question of the pairing symmetry but the results have yet to converge. A\nvery small residual linear term in thermal conductivity measurements of PCCO crystals is\nevidence for absence of nodes in the gap and does not lend support to a pure d-wave pairing\nsymmetry [31]. Several explanations have been put forward for the absence of the residual\nlinear term including the presence of a complex order parameter and localization of d-wave\nquasiparticles. The other bulk measurement, specific heat, argues in favor of dirty d-wave\npairing symmetry [32]. The term 'dirty d-wave' refers to a d-wave pairing symmetry in a\nsuperconductor which contains impurities leading to physical properties that deviate from\nthose of a clean d-wave superconductor.\nTo summarize, despite strong evidence for a d-wave symmetry, there is no consensus\non the nature of the pairing symmetry in optimally doped PCCO and NCCO. The most\n3\n\n\frecent PCS and penetration depth data favors a doping-dependent pairing symmetry for\nthese materials: d-wave for under-doped and s-wave for over-doped. In this paper we carry\nout an extensive investigation with PCS on PCCO thin films below their superconducting\ntransition temperatures (Tc ). We study the G − V characteristics as a function of cerium\ndoping, magnetic field and barrier strength (Z).\nII. EXPERIMENTAL METHOD\n\nPCCO thin films were used for PCS because better control and homogeneity of cerium\nis achieved in thin films compared to ceramic samples and single crystals. We have grown\nc-axis oriented PCCO thin films on Strontium Titanate (STO) and Lanthanum Aluminate\n(LAO) substrates using pulsed laser deposition. Details of film growth have been published\nelsewhere [33,34]. Superconducting thin films of PCCO with cerium concentrations of 0.13\n(under-doped), 0.15 (optimally-doped) and 0.17 (over-doped) were grown. The films have\na thickness of 2500 − 3000Å. The films were characterized by resistivity, AC susceptibility\nand X-ray diffraction measurements. The Tc for the under-doped, optimally-doped and\nover-doped films as determined from AC susceptibility and resistivity measurements are in\nthe range 12 ± 1K, 21 ± 0.5K and 14 ± 1K respectively.\nThe 'spear on anvil' technique is widely used for making the point contact junction. A\nsharp metal tip is carefully brought into contact with the superconductor and the barrier\nstrength is controlled by varying the pressure of the contact with a screw mechanism or a\ntransducer (see, for example, the reviews in Ref. [35,36]). In some cases, the sharp tip\nof a superconducting material has been employed with the normal metal as the counter\nelectrode [12]. However, this method is difficult to implement in our experiment for the\nfollowing reasons. Only c-axis superconducting PCCO thin films can be grown. Attempts\nat growing a-axis and (110) oriented superconducting PCCO films have not been successful.\nSince we want to tunnel into the ab-plane of this material and the thickness of the films\nis only 3000Å, a great deal of difficulty is encountered, not only in positioning the normal\nmetal tip on the edge of the film, but also in varying the contact pressure without the tip\nslipping off the film edge. Hence, we have devised an alternative technique for PCS in the\nab-plane of thin films and have designed and constructed a new probe for this purpose. We\nalso note that a variation of this alternative method has been employed successfully in the\npast for PCS on superconductors [37].\nA schematic side view of our point contact technique is depicted in Fig. 2. The film is\ncleaved in air to expose a fresh edge, electrical contacts on the film are made with Ag-In\nand it is glued with a quick-setting epoxy to a sapphire base. The film is placed in our\nPCS probe and a Au or Pt-Rh alloy wire of 0.25mm diameter, oriented perpendicular to\nthe plane of the film, is carefully brought into contact with the cleaved edge of the film.\nThe point contact junction is formed between the wire and the sharp edge of the film. The\nPCS probe is placed in a Helium-4 bath which can be pumped down to 1.4 K. In order to\nstudy the effect of the magnetic field on the point contact spectra and to drive the PCCO\ninto the normal state, the film is placed with its ab-plane perpendicular to the magnetic\nfield. In this orientation the Hc2 of our optimally-doped PCCO films is 8 T (at 1.4 K) and\nthis ensures that the film goes into the normal state at fields achievable in our laboratory.\nTherefore, a bevel gear arrangement is required to change the direction of motion for the\n4\n\n\fpoint contact to be made. The Au or Pt-Rh wire is glued to a sapphire piece which in turn\nis glued to the threaded 'nut' on the shaft. The bevel gears can be rotated from outside\nof the Helium-4 bath. When the bevel gears rotate, the 'nut' along with the wire moves\ntowards the edge of the film. The point contact can be made this way and the pressure of\nthe contact can also be varied. A high pitch anti-backlash worm gear arrangement at the top\npart of the probe outside the Helium-4 bath ensures that the distance between the wire and\nthe film edge can be controlled to sub-micron precision. One important advantage of this\nmethod over the 'spear on anvil' method is that the point contact is relatively stable against\nmechanical perturbations because the wire is also supported by the edge of the substrate.\nWe make a four probe measurement to obtain the (I − V ) characteristics of our junctions\nand numerically differentiate it to obtain the conductance. We also use a standard lock-in\ntechnique to obtain the G − V spectra directly.\nIII. RESULTS AND DISCUSSION\n\nSince our method of making point contact is unconventional, we decided to demonstrate\nits validity and effectiveness by doing PCS on optimally-doped c-axis oriented YBCO thin\nfilms in the same configuration that we have used for PCS on PCCO. The reasons for\nchoosing YBCO for this purpose are that YBCO is an HTSC like PCCO and there is a\nconsensus that the pairing symmetry of optimally-doped YBCO is predominantly d-wave\nand a ZBCP due to ABS has been observed in tunnel junctions and point contact junctions\n[4,17,38,39]. The YBCO films have a thickness of 2000 Å and were grown on STO and\nNeodymium Gallium Oxide (NGO) substrates. The films have Tc in the range 89.5 ±\n0.5K. Since the G − V spectra for a superconductor with d-wave pairing symmetry are\norientation-dependent, the films were cleaved in different directions. However, we find no\nmajor difference in the features of the G−V spectra for different cleavage orientations which\nsuggests that surface roughness at the atomic scale leads to averaging of contributions from\nfacets oriented in various directions.\nFigure 3 shows the G − V characteristics for point contact tunneling into the ab-plane of\nYBCO with Pt-Rh alloy wire as the counter-electrode. One can see from the zero field data\nthat the width of the ZBCP is 6 meV and the coherence peaks appear at the gap value of\n18 meV. This is qualitatively similar to what is observed in PCS and Scanning Tunneling\nSpectroscopy (STS) on YBCO thin films and crystals [38,39] and confirms the validity and\neffectiveness of our point contact method.\nWe also studied the effect of c-axis oriented magnetic field on the ZBCP as shown in\nFig. 3. We saw no splitting of the ZBCP at low fields unlike what has been reported\nfor tunnel junctions [4,17]. We observe that the peak splits explicitly in a magnetic field\nof 8 T . The origin of the ZBCP splitting in YBCO is still a matter of debate [4,17].\nHowever, direct splitting of the ZBCP in a magnetic field has not been observed in other\ntunneling experiments [7,19]. Two of the possible reasons for the absence of splitting of\nthe ZBCP at low fields are that the orientation of the films and surface morphologies of\nthe junction interface are different from those in tunneling experiments in Ref. [4,17]. In\nour experiment, the magnetic field is along the c-axis and perpendicular to the plane of\nfilm. Therefore, vortices enter the film even at very low magnetic fields due to the large\ndemagnetization factor and hence the Meissner currents become almost field independent.\n5\n\n\fThe entry of vortices into the film at low fields probably marginalizes the role that Meissner\ncurrents are expected to play in the splitting of the ZBCP. Also, it is theorized that the\nsplitting due to a sub-dominant order parameter (is or idxy ) may be suppressed for rough\njunction interfaces, especially if the sub-dominant order parameter is idxy [40]. A third\nreason for the absence of splitting at low fields in our experiment may be that the splitting\nof the ZBCP is expected to occur above a critical field whose magnitude is proportional to\nthe transmissivity of the junction [41]. Furthermore, the transmission coefficient decreases\nexponentially with increasing barrier strength [42]. Since our point contact junction is more\ntransparent than a tunnel junction, the fields for which we observe splitting are larger than\nthose observed in experiments with tunnel junctions. We also note that the magnitude of\nthe splitting is 2.1 meV at 8 T in our experiment which is in fairly good agreement with\nthe magnitude of the indirect splitting in Ref. [7]. The above discussion on the splitting of\nthe ZBCP in a magnetic field has important implications for our data on PCCO.\nWe have performed a systematic and exhaustive study of PCS in the ab-plane of superconducting PCCO thin films of different cerium concentrations and have observed the\nG − V spectra for different barrier strengths and in magnetic fields. We have made point\ncontacts on films with different nominal cleavage orientations. More than fifty point contact\njunctions have been studied.\nFor PCS in PCCO films with 0.13 cerium concentration, we observe a ZBCP at low\njunction resistances and we have studied the ZBCP in a magnetic field applied normal to\nthe ab-plane of the film. The data is shown in Fig 4. The shape and magnitude of the\nZBCP suggest that it originates due to ABS and we have fitted the zero field data to a\ncalculated d-wave G − V spectrum in Fig 4a. The fit takes into account the temperature\ndependence of the Fermi function. Besides the gap value (∆) and the barrier strength (Z),\nthe fitting parameters include the quasiparticle lifetime broadening parameter (Γ), and the\nangle between the normal to the junction interface and the direction of the maximum gap (α).\nThe ZBCP is completely suppressed for magnetic fields in excess of Hc2 which is about 4 T ,\nlending further support to the argument that the ZBCP is related to the superconductivity\nof the PCCO. Compared to the G − V spectra on YBCO, the ZBCP is not accompanied by\na gap-like feature because of the low barrier strength of this normal metal/PCCO junction.\nThe magnitude and width of the ZBCP decreases with increasing magnetic field [43] and the\nZBCP does not split. The possible reasons for the absence of splitting of the ZBCP in PCCO\nare the same as those advanced earlier for YBCO. Moreover, the fact that we do not observe\nsplitting of the ZBCP at all in PCCO may be due to a combination of two phenomena: low\nZ of our junction and the low Hc2 of PCCO compared to YBCO. Therefore, the absence of\nsplitting of the ZBCP in a magnetic field in under-doped PCCO is not unexpected.\nFig. 5 shows some representative G −V spectra for PCCO x = 0.13 for different junction\nresistances. For a high junction resistance which implies a higher barrier strength, we observe\na gap-like feature with coherence peaks at the gap value. This can be seen more clearly in\nthe inset (Fig. 5a). As the junction resistance is decreased, a ZBCP appears along with\nthe gap-like feature shown in greater detail in the inset (Fig. 5b). For even lower junction\nresistance (and lower Z), a pronounced ZBCP is seen whose width is the same as the value\nof the gap as deduced from the fit in Fig. 4a. We have observed ZBCPs for low junction\nresistances in approximately 30 percent of our junctions and we believe the ZBCP appears\nwhen the normal metal electrode is able to penetrate the native surface barrier and make\n6\n\n\fdirect contact with the superconductor. For a junction with high barrier strength in a dwave superconductor, theory predicts a sharp and pronounced ZBCP (see Fig. 1b) which\nwe have never observed in our experiments on high Z junctions.\nHow do we explain this unusual Z-dependence of the G−V spectra? One possibility is the\npresence of an induced order parameter at the surface for junctions with low transmission\ncoefficient (i.e. high Z). This suggestion is based on the paper by Tanuma et al. [44]\nwho have proposed that for a high-Z junction in a d-wave superconductor, the dx2 −y2 order\nparameter is suppressed at the surface and the spectral weight is transferred to a subdominant is or idxy order parameter. This effect is maximum for tunneling into (110)\norientation of the junction interface. We believe that in the case of PCCO, the magnitude\nof this induced order parameter exceeds the bulk dx2 −y2 order parameter at the surface, which\nis plausible according to the theoretical calculations in Ref. [44]. Therefore, we attribute\nthe gap-like feature in the high-Z limit to an induced order parameter whose magnitude\nranges between 3 meV and 5 meV as estimated from the separation of the coherence peaks\nin several of the G − V spectra (for example, see Fig. 5a). We note that this induced\norder parameter is not present in the low-Z junctions and the ZBCP we observe is due to\nthe d-wave nature of the bulk order parameter whose magnitude from the fit in Fig. 3a\nis 6 meV . Another possible explanation for the absence of the ZBCP in junctions with\nhigh-Z is that disorder suppresses the ZBCP. This is based on the results of the experiment\non tunnel junctions on YBCO in which the effect of disorder on the ZBCP was studied\n[45]. However, in that experiment, the gap-like feature disappears along with the ZBCP as\ndisorder increases. Since a pronounced gap-like feature is seen in our high-Z data, we think\nit is unlikely that the absence of a ZBCP is solely due to disorder.\nAlthough the simplest and most likely explanation of the ZBCPs in under-doped PCCO\njunctions is the d-wave pairing symmetry, we want to point out that ZBCPs due to ABS\nare predicted for other exotic symmetries (e.g. extended s-wave, d + s with d > s) [13].\nThe surface orientation dependence of the G − V spectra predicted for the above order\nparameters is different for each one but we are unable to distinguish between these by our\nexperimental method because our G − V spectra are an average of contributions from facets\nof various orientations on the atomic scale. The existence of roughness at the atomic scale is\nsupported by our observation that we find no qualitative change in the spectra for tunneling\ninto different surface orientations.\nThe point contact spectra for optimally-doped and over-doped PCCO for different junction resistances are shown in Fig. 6 and Fig. 7 respectively. The G − V features are similar\nfor these two doping levels and we will discuss these together. For high resistance junctions\nwe see gap-like features with coherence peaks at the gap values. This is consistent with previous PCS and tunneling experiments on optimally-doped NCCO and PCCO [5–7] where\nno ZBCP was observed. For lower junction resistances and hence lower barrier strengths,\nwe do not observe a ZBCP which suggests the absence of ABS at the Fermi energy. The\nshape of G − V spectra are now influenced by Andreev reflections and qualitatively resemble\nthose of s-wave superconductors in the low/intermediate Z limit (see Fig. 1a). In general,\na dip in the conductance at zero bias in low Z junctions suggests absence of nodes in the\norder parameter [49]. Therefore, keeping in view the shape of our G − V spectra for low Z\njunctions on under-doped, optimally-doped and over-doped PCCO, we propose a transition\nfrom a d-wave order parameter for under-doped PCCO to a nodeless gap for optimal and\n7\n\n\fover-doped PCCO. As an example, we have fitted the G − V data for the lowest junction\nresistance on over-doped PCCO to the generalized BTK model with isotropic gap as shown\nin Fig. 8a. A slightly better fit is obtained with a d + is pairing symmetry calculation, with\nequal weights of the real and imaginary parts of the order parameter as shown in Fig. 8b.\nBoth fits include the effect of thermal broadening. In calculating the best fit to the data,\nthe lifetime broadening parameter (Γ) is kept as small as possible and the angular integral\nis taken over the full range −π/2 < θ < π/2. The purpose of the fits is to show that in both\nmodels the s-wave component has the same magnitude and that the low bias characteristics\nof the G − V spectra are determined to a large extent by the s-wave component of the order\nparameter. We also tried a fit to d + idxy pairing symmetry model with the same constraints\non Γ and θ as in the d + is model. However, given the physically reasonable constraints on\nΓ and θ, the data could not be fit to the d + idxy model.\nOur data points to a transition in pairing symmetry with doping and this suggests the\nexistence of a Quantum Critical Point (QCP) at or near optimum doping. For d-wave\nsuperconductors, theoretical considerations limit the pairing symmetry transition across a\nQCP from d-wave to either d + is or d + idxy [50]. Our low Z data on PCCO is more\nconsistent with a d to d + is pairing symmetry transition across a QCP near optimum\ndoping. A recent report also suggests a transition in pairing symmetry across a QCP near\noptimum doping in YBCO. [4].\nIt has been suggested that the proximity effect for transparent junctions on dx2 −y2 superconductors leads to an induced s-wave order parameter in the normal electrode [47,48].\nThis effect is maximum for (100) or (010) surface orientations and does not occur for (110)\norientation. If the absence of a ZBCP in our low Z data on optimally-doped and over-doped\nPCCO is attributed to an s-wave order parameter being induced in the normal electrode\ndue to the proximity effect, then it is difficult to understand why this effect is not observed\nin our low Z junctions on under-doped PCCO. Therefore, we do not think our data can be\nexplained by an s-wave order parameter induced by the proximity effect. Hence, the d + is\norder parameter appears to be a property of the surface of optimally-doped and over-doped\nPCCO.\nOne interesting and puzzling aspect is the dependence of the gap-like features on the\nbarrier strength and this can be seen in Fig. 6 as well as in Fig. 7. The energy scale of\nthe gap-like features is equal to half the separation of the coherence peaks or maxima on\neither side of zero voltage bias. For over-doped PCCO, the energy of the gap-like feature\nin the tunneling limit is 3.2 meV while in the low Z limit we obtain a value of 1.4 meV.\nFor optimally-doped PCCO, the energy of the gap-like feature in the tunneling limit is 5\nmeV while in the low Z limit it is 3.3 meV. We do not fully understand this phenomenon.\nHowever, we attempt to give a reasonable explanation. It is possible that the effect of\nnano-scale roughness at the place of the junction and the extent of the tunneling cone for\nquasiparticle injection change with the barrier strength. This may lead to gap-like features\nappearing at somewhat different energies in the spectra for junctions with different barrier\nstrengths.\nWe have also studied the dependence of the G − V spectra in the tunneling limit on\nthe magnetic field applied perpendicular to the plane of the film (i.e. parallel to the c-axis\nof the film) and present our data in Fig. 9a and 9b. Note that the coherence peaks are\ncompletely suppressed at 3 T for optimally-doped PCCO and 2 T for over-doped PCCO.\n8\n\n\fThese fields are less than Hc2 which is 8 T for optimally-doped PCCO and 4 T for overdoped PCCO. We have no explanation for this unusual field dependence at the present time.\nNotice that the magnitude of the superconducting gap decreases with increasing magnetic\nfield and it evolves into a gap-like feature, qualitatively different from the superconducting\ngap, at H ≃ Hc2 . We interpret this dip in the density of states at the Fermi energy as a\nnormal state gap whose origin has not yet been determined conclusively and which has been\ndiscussed in detail in one of our earlier papers [46].\nFinally, we would like to comment on whether our point contact junctions are in the\nballistic (or Sharvin) limit i.e the contact radius (a) is much less than the mean free path\n(l) [51]. This is considered an important criteria for the validity of PCS. The Sharvin\nformalism was originally developed to model transport across a micro-constriction between\ntwo similar metals [52]. This formalism was extended by Wexler to the case where the microconstriction has a ballistic as well as a thermal (Maxwell) part [53]. Both the Sharvin and\nWexler formulas have been employed in previous works for calculating the contact radii\nfor point contact junctions between a metal and an HTSC. However, there is much debate\non whether the Sharvin and Wexler formulas are applicable in their present forms to a\npoint contact junction between two materials with very different Fermi liquid parameters\nand resistivities [54,55], as is the case with a normal metal and a high Tc superconductor.\nMoreover, since the high Tc superconductors have low mean free paths of the order of tens to\nhundreds of angstroms, the criterion for point contacts being in the Sharvin limit (a << l),\nas estimated from the Sharvin and Wexler formalisms, have rarely been strictly achieved\nand in most cases the contact radius is either comparable to or greater than the mean free\npath in the superconductor [22,38,56,57]. Authors have explained this by either considering\nthe less rigorous condition (a < l) as sufficient for a ballistic contact, or suggesting that this\nleads to a higher effective Z, or postulating the existence of several parallel ballistic contacts.\nWhatever the case may be, there is some agreement that if the point contact is dominated by\nthe thermal part, its conductance will decrease appreciably at higher voltage bias (eV > ∆)\ndue to localized heating [12,51,56,58]. In our G − V spectra, the conductance at higher\nvoltage bias is either flat or increasing with voltage. Thus, we conclude that our point\ncontact junctions are not in the Maxwell regime and the quasi-particle transport through\nthe junctions is predominantly ballistic. This is a sufficient condition for energy-resolved\nspectroscopy of point contact junctions.\nIV. CONCLUSION\n\nFor low barrier strength junctions on under-doped PCCO, we observe a ZBCP and show\nthat it is due to d-wave pairing symmetry. We do not observe a ZBCP in low Z PCS\ndata on optimally-doped and over-doped PCCO and this indicates absence of nodes in the\ngap. Our data, along with theoretical considerations, indicates a d + is pairing symmetry\nfor optimally-doped and over-doped PCCO. We find that our data for low barrier strength\njunctions for all doping levels can be best explained by a d- to d + is pairing symmetry\ntransition across optimum doping. This indicates the presence of a QCP near optimum\ndoping for PCCO.\nWe observe gap-like features for high barrier strength junctions for all doping levels. For\nhigh Z junctions on under-doped PCCO, we believe that the d-wave order parameter is\n9\n\n\fsuppressed at the surface and the spectral weight is transferred to an is order parameter\nwhich leads to gapped spectra. For high Z junctions on optimally-doped and over-doped\nPCCO, the gap-like features are due to a fully gapped Fermi surface. The data on low Z\njunctions on over-doped PCCO suggests that a d + is order parameter leads to this nodeless\nand fully gapped Fermi surface. Indeed, data from all the previous PCS and tunneling\nexperiments on NCCO and PCCO, which consistently showed a gap-like feature can be\nexplained by an induced is order parameter at the surface of under-doped PCCO, and by\nan order parameter without nodes for optimally-doped and over-doped PCCO.\nWe have studied the G − V spectra in magnetic fields up to and greater than Hc2 of\nPCCO. We find that the ZBCP in the G − V spectra of under-doped PCCO does not split\nin magnetic fields up to Hc2 . This may be due to one or more of the following reasons:\nimmediate penetration of vortices into our films; surface roughness of our junctions; the\nhigh transmissivity of our junctions. For H > Hc2 , we observe a normal state gap at the\nFermi energy in the G−V spectra in the tunneling limit for optimally-doped and over-doped\nPCCO. The normal state gap is of the same order of magnitude as the superconducting gap\nbut differs qualitatively from it. The normal state gap is at least an order of magnitude less\nthan the pseudo-gap that has been observed in other experiments on NCCO [59,60].\nThe authors acknowledge useful discussions with C. J. Lobb, S. M. Anlage and P.\nFournier. We would like to thank the following colleagues: J. S. Higgins and M. C. Sullivan\nfor assistance with PCCO and YBCO film growth, and Hamza Balci and Z. Y. Li for some\nof the PCCO ceramic pellets. This work was supported in part by NSF DMR 01-02350.\n\n10\n\n\fREFERENCES\n[1] Guy Deutscher and Roger Maynard in: The gap symmetry and fluctuations in high Tc\nsuperconductors, ed. Julien Bok et al., (Plenum Press, New York, 1998)\n[2] Satoshi Kashiwaya and Yukio Tanaka, Rep. Prog. Phys. 63, 1641 (2000)\n[3] C. C. Tsuei and J. R. Kirtley, Rev. Mod. Phys. 72, 969 (2000)\n[4] Y. Dagan and G. Deutscher, Phys. Rev. Lett. 87, 177004 (2001)\n[5] Q. Huang et al., Nature 347, 369 (1990)\n[6] S. Kashiwaya et al., Phys. Rev. B 57, 8680 (1998)\n[7] L. Alff et al., Eur. Phys. J. B 5, 423 (1998)\n[8] C. C. Tsuei and J. R. Kirtley, Phys. Rev. Lett. 85, 182 (2000)\n[9] J. D. Kokales et al., Phys. Rev. Lett. 85, 3696 (2000)\n[10] R. Prozorov et al., Phys. Rev. Lett. 85, 3700 (2000)\n[11] G. E. Blonder, M. Tinkham and T. M. Klapwijk, Phys. Rev. B 25, 4515 (1982)\n[12] G. E. Blonder and M. Tinkham, Phys. Rev. B 27, 112 (1983)\n[13] Yukio Tanaka and Satoshi Kashiwaya, Phys. Rev. Lett. 74, 3451 (1995)\n[14] Chia-Ren Hu, Phys. Rev. Lett. 72, 1526 (1994)\n[15] M. Fogelström et al., Phys. Rev. Lett. 79, 281 (1997)\n[16] R. Krupke and G. Deutscher, Phys. Rev. Lett. 83, 4634 (1999)\n[17] M. Covington et al., Phys. Rev. Lett. 79, 277 (1997)\n[18] Satoshi Kashiwaya et al., Phys. Rev. B 53, 2667 (1996)\n[19] J. W. Ekin et al., Phys. Rev. B 56, 13746 (1997)\n[20] F. Hayashi et al., J. Phys. Soc. Jpn 67, 3234(1998)\n[21] A. Mourachkine, Europhys. Lett. 50, 663(2000)\n[22] Amlan Biswas et al., Phys. Rev. Lett. 88, 207004 (2002)\n[23] D. H. Wu et al., Phys. Rev. Lett. 70, 85(1993)\n[24] A. Andreone et al., Phys. Rev. B 49, 6392 (1994).\n[25] C. W. Schneider et al., Physica C 233, 77 (1994)\n[26] L .Alff et al., Phys. Rev. Lett. 83, 2644(1999)\n[27] John A. Skinta et al., Phys. Rev. Lett. 88, 207005 (2002)\n[28] N. P. Armitage et al., Phys. Rev. Lett. 86, 1126(2001)\n[29] T. Sato et al., Science 291, 1517 (2001)\n[30] G. Blumberg et al., Phys. Rev. Lett. 88, 107002 (2002)\n[31] R. W. Hill et al., Nature 414, 711 (2001)\n[32] Hamza Balci et al., Phys. Rev. B 66, 174510 (2002)\n[33] E. Maiser et al., Physica C 297, 15 (1998)\n[34] J. L. Peng et al., Phys. Rev. B 55, R6145 (1997)\n[35] H. Van Kempen in: Scanning Tunneling Microscopy and Related Methods, ed. R. J.\nBehm et al. (Kluwer Academic Publishers 1990)\n[36] I. K. Yanson, Sov. J. Low Temp. Phys. 17, 143 (1991)\n[37] R. C. Reinertson et al., Physica C 200, 377 (1992)\n[38] J. Y. T. Wei et al., Phys. Rev. Lett. 81, 2542 (1998)\n[39] A. Sharoni et al., Phys. Rev. B 65, 134526 (2002)\n[40] D. Rainer et al., J. Phys. Chem. Solids 59, 2040 (1998)\n[41] Yukio Tanaka et al. J. Phys. Soc. Jpn, 71, 2005 (2002)\n11\n\n\f[42] E. L. Wolf, Principles of electron tunneling spectroscopy (Oxford University Press, New\nYork, 1985)\n[43] The decrease in width and height of the ZBCP with magnetic field is probably due to the\ndecrease in magnitude of the superconducting gap. This is under further investigation.\n[44] Y. Tanuma et al., Phys. Rev. B 64, 214519 (2001)\n[45] M. Aprili et al., Phys. Rev. B 57, R8139 (1998)\n[46] Amlan Biswas et al. Phys. Rev. B 64, 104519 (2001)\n[47] Yoji Ohashi, J. Phys. Soc. Jpn. 65, 823 (1996)\n[48] Amir Kohen and Guy Deutscher, cond-mat/0207382 (2002)\n[49] Guy Deutscher et al., Physica C 282-287, 140 (1997)\n[50] Matthias Vojta et al., Phys. Rev. Lett. 85, 4940 (2000)\n[51] A. M. Duif et al, J. Phys. Condens. Matter 1, 3157 (1989)\n[52] Yu. V. Sharvin, Zh. Eksp. Teor. Fiz. 48, 984 (1965) [Sov. Phys. JETP 21, 655 (1965)]\n[53] G. Wexler, Proc. Phys. Soc. London 89, 927 (1966)\n[54] K. Gloos, Phys. Rev. Lett. 85, 5257 (2000)\n[55] Ch. Wälti et al., Phys. Rev. Lett. 85, 5258 (2000)\n[56] R. S. Gonnelli et al., Eur. Phys. J. B 22, 411 (2001)\n[57] A. I. D'yachenko et al., Phys. Rev. B 61, 1500 (2000)\n[58] K. Hasselbach et al., Phys. Rev. B 46, 5826 (1992)\n[59] N. P. Armitage et al., Phys. Rev. Lett. 87, 147003 (2001)\n[60] Y. Onose et al., Phys. Rev. Lett. 87, 217001 (2001)\n\n12\n\n\fFIGURES\nFIG. 1. (a) Calculated G − V curves for an s-wave superconductor at zero Kelvin using the\nBTK model (Ref. [11]). (b) Calculated G − V curves for a d-wave superconductor at zero Kelvin\nfor tunneling into (110) orientation (Ref. [13]).\n\nFIG. 2. A schematic side view of our point contact method.\nFIG. 3. G − V characteristics for optimally-doped YBCO taken at T=4.23 K in a magnetic\nfield applied parallel to the c-axis. The spectra are shifted for clarity.\nFIG. 4. G − V characteristics for under-doped PCCO at T = 1.43 K showing the variation of\nthe ZBCP with magnetic field applied parallel to the c-axis. The spectra are shifted for clarity.\nInset(a): a fit of the ZBCP data (circles) to the calculated conductance for a normal metal/dx2 −y2\nsuperconductor (solid line). The fitting parameters are discussed in the text.\nFIG. 5. G − V spectra for different junction resistances for under-doped PCCO at T = 1.43\nK. The conductance is normalized to the normal state conductance and the spectra are shifted for\nclarity. Inset (a) shows in detail the high Z data with RN = 46.4Ω. Inset (b) shows in detail the\nspectrum with normal state resistance of 28.7 Ω. Note that both the superconducting gap and\nZBCP are clearly visible and compare with the zero field data for YBCO in Fig. 3.\nFIG. 6. G − V spectra for different junction resistances for optimally-doped PCCO at T = 1.43\nK. The conductance is normalized to the normal state conductance and the spectra are shifted for\nclarity.\nFIG. 7. G − V spectra for different junction resistances for over-doped PCCO at T = 1.43 K.\nThe conductance is normalized to the normal state conductance and the spectra are shifted for\nclarity.\nFIG. 8. (a) A fit of the low resistance G − V spectrum (circles) for over-doped PCCO to the\ngeneralized BTK model with an isotropic gap (solid line).(b) A fit of the same data to d+is pairing\nsymmetry model. The fitting parameters are discussed in the text.\nFIG. 9. Variation of the G − V characteristics for high resistance junctions with magnetic field\napplied parallel to the c-axis for (a) optimally-doped PCCO and (b) for over-doped PCCO at T =\n1.43 K. The spectra are shifted for clarity.\n\n13\n\n\fFig. 1\n4\n\n(a)\n3\n\nGNorm\n\n(b)\n\nZ=0\nZ=1\nZ=5\n\nZ= 0\nZ= 1\nZ= 5\n\n2\n\n1\n\n0\n\n−∆\n\n0\nV (mV)\n\n∆\n\n−∆\n\n0\nV(mV)\n\n∆\n\n\felectrical\ncontacts\n\nTo bevel\ngears\n\nI- VV+\nI+\nH\n\nnut\n\nsapphire\nwire\n\nFig 2\n\nfilm\n(shaded)\n\n\fFig. 3\nμ0H = 0 T\n\n0.1\n1\n2\n4\n6\n8T\n\nG (Arb. Units)\n\n7.2\n\n6.8\n\n6.4\n\n6.0\n\n5.6\n-40\n\n-20\n\n0\n\nV (mV)\n\n20\n\n40\n\n\fFig. 4\n2.8\n2.4\n\n2.4\n\n2.0\n\nG S /G N\n\nG (Arb. Units)\n\n∆ = 6 meV\nZ = 0.85\nα=π/4\nΓ = 0.3 meV\n\nμ0H = 0 T\n\n(a)\n\n0.1\n0.5\n1\n2\n4\n6\n8T\n\n1.6\n\n2.0\n1.2\n\n1.6\n\n0.8\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n15\n\nV (mV)\n\n1.2\n0.8\n0.4\n-15\n\n-10\n\n-5\n\n0\n\nV (mV)\n\n5\n\n10\n\n15\n\n\fFig. 5\n\n2.8\n\n1.19\n\nRN = 46.4 Ω\n\nRN = 28.7 Ω\n0.96\n\n2.0\n\n0.88\n\n1.12\n\nGS/GN\n\n1.6\n\nGS / GN\n\nGS/GN\n\n2.4\n\n1.05\n\n(b)\n\n(a)\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n-15\n\n15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\nV (mV)\n\nV (mV)\n\nRN= 9.8 Ω\n28.7 Ω\n46.4 Ω\n\n1.2\n\n0.8\n\n-20\n\n-10\n\n0\n\nV (mV)\n\n10\n\n20\n\n15\n\n\fFig. 6\n1.6\n\nRN= 18 Ω\n90 Ω\n124 Ω\n\n1.4\n\nGS/GN\n\n1.2\n\n1.0\n\n0.8\n\n0.6\n-15\n\n-10\n\n-5\n\n0\n\nV (mV)\n\n5\n\n10\n\n15\n\n\fFig. 7\n2.0\n\nRN= 2.6 Ω\n6.9 Ω\n41 Ω\n76 Ω\n\n1.8\n\nGS/GN\n\n1.6\n1.4\n1.2\n1.0\n0.8\n0.6\n-12\n\n-8\n\n-4\n\n0\n\nV (mV)\n\n4\n\n8\n\n12\n\n\f1.6\n\n(a)\n\n∆ = 1.4 meV\n\nZ = 0.38\nΓ = 0.12 meV\n\nGS/GN\n\n1.4\n\n1.2\n\n1.0\n\nFig. 8\n\n1.6\n\n(b)\n\n∆S = 1.4 meV\n∆D = 1.4 meV\n\nZ = 0.7\nα=π/4\nΓ = 0.13 meV\n\nGS/GN\n\n1.4\n\n1.2\n\n1.0\n-6\n\n-4\n\n-2\n\n0\n\n2\n\nV (mV)\n\n4\n\n6\n\n8\n\n\f12\n\n(a)\n\nμ0H = 0 T\n\nG (Arb. Units)\n\n11\n\n0.1\n0.2\n0.5\n1\n1.5\n2\n3\n5\n7\n9T\n\n10\n9\n8\n7\n6\n-20\n\n-10\n\n0\n\n10\n\n20\n\nFig. 9\n\nV (mV)\n\nG (A rb. U nits)\n\n1.8\n\n(b)\n\nμ0H = 0 T\n\n0.1\n0.2\n0.5\n1\n2\n4\n6\n8T\n\n1.6\n\n1.4\n\n1.2\n\n-12\n\n-8\n\n-4\n\n0\n\nV (mV)\n\n4\n\n8\n\n12\n\n\f"}