{"id": "http://arxiv.org/abs/cond-mat/0307440v3", "guidislink": true, "updated": "2004-01-20T15:38:51Z", "updated_parsed": [2004, 1, 20, 15, 38, 51, 1, 20, 0], "published": "2003-07-17T17:56:42Z", "published_parsed": [2003, 7, 17, 17, 56, 42, 3, 198, 0], "title": "Observation of molecules produced from a Bose-Einstein condensate", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0307376%2Ccond-mat%2F0307440%2Ccond-mat%2F0307257%2Ccond-mat%2F0307402%2Ccond-mat%2F0307285%2Ccond-mat%2F0307507%2Ccond-mat%2F0307099%2Ccond-mat%2F0307472%2Ccond-mat%2F0307304%2Ccond-mat%2F0307125%2Ccond-mat%2F0307529%2Ccond-mat%2F0307044%2Ccond-mat%2F0307114%2Ccond-mat%2F0307477%2Ccond-mat%2F0307556%2Ccond-mat%2F0307436%2Ccond-mat%2F0307152%2Ccond-mat%2F0307509%2Ccond-mat%2F0307652%2Ccond-mat%2F0307557%2Ccond-mat%2F0307178%2Ccond-mat%2F0307272%2Ccond-mat%2F0307719%2Ccond-mat%2F0307460%2Ccond-mat%2F0307565%2Ccond-mat%2F0307693%2Ccond-mat%2F0307572%2Ccond-mat%2F0307346%2Ccond-mat%2F0307490%2Ccond-mat%2F0307555%2Ccond-mat%2F0307176%2Ccond-mat%2F0307093%2Ccond-mat%2F0307344%2Ccond-mat%2F0307546%2Ccond-mat%2F0307685%2Ccond-mat%2F0307596%2Ccond-mat%2F0307088%2Ccond-mat%2F0307262%2Ccond-mat%2F0307542%2Ccond-mat%2F0307771%2Ccond-mat%2F0307729%2Ccond-mat%2F0307412%2Ccond-mat%2F0307120%2Ccond-mat%2F0307447%2Ccond-mat%2F0307694%2Ccond-mat%2F0307017%2Ccond-mat%2F0307105%2Ccond-mat%2F0307539%2Ccond-mat%2F0307575%2Ccond-mat%2F0307414%2Ccond-mat%2F0307538%2Ccond-mat%2F0307185%2Ccond-mat%2F0307104%2Ccond-mat%2F0307442%2Ccond-mat%2F0307526%2Ccond-mat%2F0307084%2Ccond-mat%2F0307165%2Ccond-mat%2F0307320%2Ccond-mat%2F0307328%2Ccond-mat%2F0307361%2Ccond-mat%2F0307195%2Ccond-mat%2F0307229%2Ccond-mat%2F0307171%2Ccond-mat%2F0307767%2Ccond-mat%2F0307043%2Ccond-mat%2F0307759%2Ccond-mat%2F0307738%2Ccond-mat%2F0307647%2Ccond-mat%2F0307343%2Ccond-mat%2F0307312%2Ccond-mat%2F0307300%2Ccond-mat%2F0307123%2Ccond-mat%2F0307231%2Ccond-mat%2F0307661%2Ccond-mat%2F0307389%2Ccond-mat%2F0307113%2Ccond-mat%2F0307720%2Ccond-mat%2F0307230%2Ccond-mat%2F0307607%2Ccond-mat%2F0307003%2Ccond-mat%2F0307506%2Ccond-mat%2F0307186%2Ccond-mat%2F0307232%2Ccond-mat%2F0307160%2Ccond-mat%2F0307705%2Ccond-mat%2F0307603%2Ccond-mat%2F0307673%2Ccond-mat%2F0307253%2Ccond-mat%2F0307002%2Ccond-mat%2F0307624%2Ccond-mat%2F0307386%2Ccond-mat%2F0307019%2Ccond-mat%2F0307096%2Ccond-mat%2F0307640%2Ccond-mat%2F0307018%2Ccond-mat%2F0307591%2Ccond-mat%2F0307582%2Ccond-mat%2F0307416%2Ccond-mat%2F0307184%2Ccond-mat%2F0307573%2Ccond-mat%2F0307130&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observation of molecules produced from a Bose-Einstein condensate"}, "summary": "Molecules are created from a Bose-Einstein condensate of atomic 87Rb using a\nFeshbach resonance. A Stern-Gerlach field is applied, in order to spatially\nseparate the molecules from the remaining atoms. For detection, the molecules\nare converted back into atoms, again using the Feshbach resonance. The measured\nposition of the molecules yields their magnetic moment. This quantity strongly\ndepends on the magnetic field, thus revealing an avoided crossing of two bound\nstates at a field value slightly below the Feshbach resonance. This avoided\ncrossing is exploited to trap the molecules in one dimension.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0307376%2Ccond-mat%2F0307440%2Ccond-mat%2F0307257%2Ccond-mat%2F0307402%2Ccond-mat%2F0307285%2Ccond-mat%2F0307507%2Ccond-mat%2F0307099%2Ccond-mat%2F0307472%2Ccond-mat%2F0307304%2Ccond-mat%2F0307125%2Ccond-mat%2F0307529%2Ccond-mat%2F0307044%2Ccond-mat%2F0307114%2Ccond-mat%2F0307477%2Ccond-mat%2F0307556%2Ccond-mat%2F0307436%2Ccond-mat%2F0307152%2Ccond-mat%2F0307509%2Ccond-mat%2F0307652%2Ccond-mat%2F0307557%2Ccond-mat%2F0307178%2Ccond-mat%2F0307272%2Ccond-mat%2F0307719%2Ccond-mat%2F0307460%2Ccond-mat%2F0307565%2Ccond-mat%2F0307693%2Ccond-mat%2F0307572%2Ccond-mat%2F0307346%2Ccond-mat%2F0307490%2Ccond-mat%2F0307555%2Ccond-mat%2F0307176%2Ccond-mat%2F0307093%2Ccond-mat%2F0307344%2Ccond-mat%2F0307546%2Ccond-mat%2F0307685%2Ccond-mat%2F0307596%2Ccond-mat%2F0307088%2Ccond-mat%2F0307262%2Ccond-mat%2F0307542%2Ccond-mat%2F0307771%2Ccond-mat%2F0307729%2Ccond-mat%2F0307412%2Ccond-mat%2F0307120%2Ccond-mat%2F0307447%2Ccond-mat%2F0307694%2Ccond-mat%2F0307017%2Ccond-mat%2F0307105%2Ccond-mat%2F0307539%2Ccond-mat%2F0307575%2Ccond-mat%2F0307414%2Ccond-mat%2F0307538%2Ccond-mat%2F0307185%2Ccond-mat%2F0307104%2Ccond-mat%2F0307442%2Ccond-mat%2F0307526%2Ccond-mat%2F0307084%2Ccond-mat%2F0307165%2Ccond-mat%2F0307320%2Ccond-mat%2F0307328%2Ccond-mat%2F0307361%2Ccond-mat%2F0307195%2Ccond-mat%2F0307229%2Ccond-mat%2F0307171%2Ccond-mat%2F0307767%2Ccond-mat%2F0307043%2Ccond-mat%2F0307759%2Ccond-mat%2F0307738%2Ccond-mat%2F0307647%2Ccond-mat%2F0307343%2Ccond-mat%2F0307312%2Ccond-mat%2F0307300%2Ccond-mat%2F0307123%2Ccond-mat%2F0307231%2Ccond-mat%2F0307661%2Ccond-mat%2F0307389%2Ccond-mat%2F0307113%2Ccond-mat%2F0307720%2Ccond-mat%2F0307230%2Ccond-mat%2F0307607%2Ccond-mat%2F0307003%2Ccond-mat%2F0307506%2Ccond-mat%2F0307186%2Ccond-mat%2F0307232%2Ccond-mat%2F0307160%2Ccond-mat%2F0307705%2Ccond-mat%2F0307603%2Ccond-mat%2F0307673%2Ccond-mat%2F0307253%2Ccond-mat%2F0307002%2Ccond-mat%2F0307624%2Ccond-mat%2F0307386%2Ccond-mat%2F0307019%2Ccond-mat%2F0307096%2Ccond-mat%2F0307640%2Ccond-mat%2F0307018%2Ccond-mat%2F0307591%2Ccond-mat%2F0307582%2Ccond-mat%2F0307416%2Ccond-mat%2F0307184%2Ccond-mat%2F0307573%2Ccond-mat%2F0307130&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Molecules are created from a Bose-Einstein condensate of atomic 87Rb using a\nFeshbach resonance. A Stern-Gerlach field is applied, in order to spatially\nseparate the molecules from the remaining atoms. For detection, the molecules\nare converted back into atoms, again using the Feshbach resonance. The measured\nposition of the molecules yields their magnetic moment. This quantity strongly\ndepends on the magnetic field, thus revealing an avoided crossing of two bound\nstates at a field value slightly below the Feshbach resonance. This avoided\ncrossing is exploited to trap the molecules in one dimension."}, "authors": ["Stephan Dürr", "Thomas Volz", "Andreas Marte", "Gerhard Rempe"], "author_detail": {"name": "Gerhard Rempe"}, "author": "Gerhard Rempe", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.92.020406", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0307440v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0307440v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, minor revisons", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0307440v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0307440v3", "journal_reference": "Phys. Rev. Lett. 92, 020406 (2004)", "doi": "10.1103/PhysRevLett.92.020406", "fulltext": "Observation of molecules produced from a Bose-Einstein condensate\nStephan Dürr, Thomas Volz, Andreas Marte, and Gerhard Rempe\n\narXiv:cond-mat/0307440v3 [cond-mat.stat-mech] 20 Jan 2004\n\nMax-Planck-Institut für Quantenoptik, Hans-Kopfermann-Str. 1, 85748 Garching, Germany\nMolecules are created from a Bose-Einstein condensate of atomic 87 Rb using a Feshbach resonance.\nA Stern-Gerlach field is applied, in order to spatially separate the molecules from the remaining\natoms. For detection, the molecules are converted back into atoms, again using the Feshbach\nresonance. The measured position of the molecules yields their magnetic moment. This quantity\nstrongly depends on the magnetic field, thus revealing an avoided crossing of two bound states at\na field value slightly below the Feshbach resonance. This avoided crossing is exploited to trap the\nmolecules in one dimension.\nPACS numbers: 03.75.Nt, 34.50.-s, 33.15.Kr\n\nIn recent years, Bose-Einstein condensation (BEC) has\nbeen demonstrated for a variety of atomic species. Creating a BEC of a molecular gas, however, is still an\nopen goal. While cooling a molecular gas is difficult [1],\nthe creation of a molecular BEC from an atomic BEC\nseems promising. First experiments in this direction have\nshown the coupling of BEC atoms to a molecular state\nusing either photo-association [2–4] or a Feshbach resonance [5]. But while these experiments observed atoms\ndisappear, they did not directly detect the molecular fraction. Very recently, the production of cold molecules from\na Fermi gas of atoms was reported [6], and there, the fraction of molecules could be detected using a spectroscopic\ntechnique. Here we report the production of molecules\nfrom an atomic BEC using a Feshbach resonance. An\nalternative observation technique for the molecules is introduced, namely a Stern-Gerlach experiment in which\nmolecules and atoms are spatially separated from each\nother.\nA Feshbach resonance arises from the resonant coupling of an entrance channel to a bound state during a\ncollision. The corresponding potential curves are illustrated in Fig. 1a. For simplicity, only the entrance channel A and one closed channel B are shown. Channel B\nsupports numerous bound states of which only one is indicated. If an appropriate interaction couples the two channels, the collision partners can populate the bound state\nat small internuclear distance. This population is resonantly enhanced, if the bound-state energy approaches\nthe dissociation threshold. This is called a Feshbach resonance [7, 8]. In order to tune the system into resonance,\nthe energies of the channels A and B must be shifted with\nrespect to each other. Since their magnetic moments are\ngenerally different, this can be achieved by applying a\nmagnetic field. In the vicinity of a Feshbach resonance,\nelastic and inelastic scattering properties change drastically. Feshbach resonances have been observed experimentally in various alkali atoms [9–20].\nA Feshbach resonance offers the intriguing possibility\nto create cold molecules by using an adiabatic rapid passage. This technique is illustrated in Fig. 1b, where the\nenergy of the dissociation threshold of the entrance chan-\n\nnel and the bound-state energy are shown as a function of\nan applied magnetic field B. The Feshbach resonance occurs at the intersection and can be described in terms of\nan avoided crossing. When ramping slowly through the\navoided crossing, pairs of atoms can be converted adiabatically into molecules. Starting from an atomic BEC,\none might even create a molecular BEC. But, the direction of the ramp is crucial. For the situation shown in\nFig. 1b, a negative ramp speed (dB/dt < 0) is predicted\nto create a significant population of a molecular BEC,\nbut this is not the case for a positive ramp speed [21–\n25]. Therefore, a negative ramp speed is chosen in the\nexperiment.\nThe magnitude of the ramp speed is, of course, a crucial parameter in an adiabatic rapid passage. With a\nfast ramp, the conversion is no longer adiabatic, thus\ncreating only few molecules. With a slow ramp, however, the finite lifetime of the states involved becomes\nan issue. In the system under investigation here, the\nmolecules are in a highly excited vibrational state which\nis probably short-lived, because a collision with an atom\nor another molecule is likely to be inelastic. Therefore\na complete conversion of an atomic BEC into molecules\nis generally difficult and not achieved in this experiment.\nSuch a ramp has also been applied to a degenerate gas\nof fermionic atoms [6, 26] and to a BEC of 85 Rb [27].\nThe experiment described here uses bosonic atoms and\nbegins with the preparation of a BEC of 87 Rb atoms that\nis then transferred into a crossed dipole trap, as described\nin detail in Refs. [16, 28]. Typical atom numbers each in\nthe BEC and in the surrounding thermal cloud are 105 ,\nleading to a peak density of 2 × 1014 cm−3 at trap frequencies of 2π × (50, 120, 170) Hz. The atoms populate\nthe spin state |f, mf i = |1, 1i, in which a Feshbach resonance occurs at 1007.40 G [28]. Next, a homogeneous\nmagnetic field of ∼ 1008 G is applied. During the turn on\nof this field, the system crosses the Feshbach resonance at\nsuch a large ramp speed (∼ 40 G/ms) that the resonance\nhas little effect on the atoms.\nNext, the dipole trap is switched off and the rest of the\nexperimental sequence takes place with the particles in\nfree flight. The magnetic field is now ramped more slowly\n\n\f2\n(typically −1 G/ms) through the Feshbach resonance in\norder to create molecules. The field is held at a certain\nvalue Bhold for 3 ms. During this time, an additional\nStern-Gerlach field is applied with a typical magneticfield gradient of 23 G/cm. This extra field accelerates\nthe atoms and molecules differently because of the difference in their magnetic moments. The Stern-Gerlach field\nis then turned off and the magnetic field is ramped back\nto ∼ 1008 G at a slow ramp speed of typically 1 G/ms.\nThis converts some (or all) molecules back to atoms. The\nmagnetic field is then turned off completely, again crossing the resonance so rapidly that this has little effect.\nThe atoms fly freely for another 3 ms, to allow the two\nclouds to separate further in space. Finally, an absorption image is taken with laser light that is near-resonant\nwith an atomic transition. Atoms that were converted\ninto molecules but never converted back cannot be seen\nwith this technique.\n\na\nB\n\nenergy\n\nE\nA\n\ninternuclear separation\n\nb\n\nenergy\n\nth\nre\n\nu\nbo\n\nsh\nol\nd\n\nnd\n\nA\n\nsta\n\nte\n\nB\n\nmagnetic field\n\nFIG. 1: Theory of Feshbach resonances. (a) Molecular potentials involved in a Feshbach resonance. Potential A corresponds to the entrance channel and potential B to a closed\nchannel of the scattering process. Potential B supports a\nbound state (solid straight line), to which the incoming wave\nfunction can couple. The energy of an incoming pair of cold\natoms is very close to the dissociation threshold (dotted line).\nFor ∆E → 0, the population of the bound state is resonantly\nenhanced. (b) Creation of cold molecules using a Feshbach\nresonance. The energy of the dissociation threshold and the\nmolecular bound state are shown as a function of magnetic\nfield (solid lines). An atomic BEC can be converted into\nmolecules using an adiabatic rapid passage. The experiment\nuses a negative ramp speed (dB/dt < 0), as indicated by\nthe arrow. For positive ramp speed, the existence of noncondensate states of atom pairs (dotted lines) would prevent\nthe build-up of a large molecular fraction.\n\nExperimental results for Bhold = 1005.2 G are shown in\nFig. 2a, where two clearly separated atom clouds are visible. With the Stern-Gerlach field applied, the magnetic\nfield decreases from left to right in this figure. For reference, the atomic distribution obtained without the SternGerlach field is shown in Fig. 2b. Therefore, the cloud on\nthe left/right in Fig. 2a must have been in a high/lowfield seeking state during application of the Stern-Gerlach\nfield. Hence, the right cloud shows atoms that were converted into low-field seeking molecules during the first\ncrossing of the Feshbach resonance and converted back\nwhen ramping back. The left cloud, however, consisted\nof high-field seeking atoms throughout the whole experiment.\nWith decreasing speed of the molecule-creation ramp,\nthe number of molecules first increases and then saturates for ramp speeds slower than ∼ 2 G/ms. With such\nslow ramps, the right cloud contains ∼ 7 % of the initial\natom number, the left cloud contains ∼ 30 %. The rest\nof the atoms is missing. This atom loss is ∼ 3 orders of\nmagnitude faster than expected from the previously measured three-body loss coefficient at the resonance [16].\nThe missing fraction of ∼ 63 % might have been lost due\nto inelastic collisions (presumably after conversion into\nmolecules) or might have been converted into molecules\nand not converted back to atoms, thus remaining invisible during detection. The latter seems unlikely, because\nwhen varying the ramp that converts molecules back to\natoms, the back-converted atom number shows no significant dependence on the ramp speed in the range between\n0.3 and 5 G/ms.\nIf the conversion to molecules is performed before\nrelease from the dipole trap, the observed number of\nmolecules is reduced by a factor of ∼ 1.8. This might\nbe due to faster inelastic collision rates at the high densities in the trap. In the experiment, the cloud is therefore\nallowed to expand after turning off the dipole trap. After\nan expansion time of typically 2 to 7 ms, the molecules\nare produced. This expansion is estimated to reduce the\natomic density by a factor between 5 and 70 as compared to the in-trap situation. The observed number of\nmolecules shows no strong density dependence over this\n\nFIG. 2: (Color online) (a) Image of two atomic clouds. The\nright cloud was temporarily converted into molecules. A\nStern-Gerlach field was applied to separate the molecules\n(right) from the remaining atoms (left). The molecules were\nconverted back into atoms for imaging. The size of the image\nis 1.3 × 0.34 mm. (b) Reference image without application of\nthe Stern-Gerlach field.\n\n\f3\nrange. At first glance, this seems to rule out inelastic\ncollisions as the dominant factor that limits the molecule\ncreation efficiency. However, at reduced density a slower\nramp is needed to associate molecules efficiently. This\nin turn requires more time to be spent during the ramp,\ntherefore allowing for more loss due to inelastic collisions.\nIt is thus not clear, whether a reduced density is expected\nto achieve an overall improvement in the observed number of molecules. We therefore think that inelastic collisions are the most likely candidate for explaining the\nsmall conversion efficiency.\nThe displacement of the clouds induced by application of the Stern-Gerlach field can be used to extract the\nmagnetic moment of the particles. This displacement is\n~ exerted\nproportional to the force F~ = −(dE/dB) × ∇|B|\nby the Stern-Gerlach field. Here, E is the energy of the\natomic and molecular state, respectively (see Fig. 1b).\nNote that dE/dB is related to the magnetic moment of\nthe particles. For the atoms, the extracted experimental\nvalue of dE/dB is independent of Bhold and agrees well\nwith the expectation from the Breit-Rabi formula.\nFor the molecules, however, Fig. 3b displays a pro20\n\na\n\nth\nre\nsh\nold\n\nE/h (MHz)\n\n10\n0\n-10\n\ndE/dB /h (MHz/G)\n\n-20\n\nbo\nun\nd\n\nnounced dependence of dE/dB on Bhold . This magneticfield dependence is due to the presence of the highestlying bound state in entrance channel A. Theoretical results [29] for the energy of this state are shown in Fig. 3a.\nAt a field value of 1001.7 G, this bound state crosses\nthe bound state in potential B that becomes populated\nwhen ramping across the Feshbach resonance. Due to\n\nA\n\nA\n\nd\nun\nbo\n\nB\n\nb\n1\n\n0\n\n-1\n\n-2\n995\n\n1000\n\n1005\n\n1010\n\nB (G)\n\nFIG. 3: Avoided crossing. (a) Energy as a function of magnetic field. The binding energy of the highest-lying bound\nstate in potential A with respect to the dissociation threshold in potential A is h × 24 MHz, independent of the magnetic field. The bound state supported by potential B crosses\nboth these energies. The highest-lying bound state is crossed\nat 1001.7 G, leading to an avoided crossing. The dissociation threshold is crossed at 1007.4 G creating the Feshbach\nresonance. The energy splitting in the avoided crossing at\n1001.7 G is 13 MHz and therefore much larger than the splitting of the Feshbach resonance crossing, which is not visible\non this scale. (b) Derivative dE/dB of the upper branch of the\navoided crossing. Experimental data for the molecules (circles) extracted from images, such as Fig. 2a, are compared\nwith the theory (solid line) that contains no free fit parameters.\n\nFIG. 4: (Color online) Oscillation of molecules. According\nto Fig. 3, the molecules are 1001.7-G seekers. With a magnetic field gradient applied in the horizontal direction, the\nmolecules oscillate around a point in space where the magnetic field equals 1001.7 G. The images were recorded for a\nseries of different durations of the Stern-Gerlach field, ranging from 0 to 18 ms (top to bottom). The observed oscillation\nfrequency of 56 Hz agrees well with theory. The anisotropic\nexpansion of the molecular cloud is due to the fact that the\none-dimensional trapping potential prevents the cloud from\nexpanding in the horizontal direction. The atomic cloud (top\nleft) is simply accelerated on a parabola. The size of each\nimage is 1.7 × 0.24 mm.\n\n\f4\nthe exchange interaction, this is an avoided crossing,\nin which the molecules adiabatically follow the upper\nbranch. The derivative dE/dB of this upper branch is\nshown in Fig. 3b. The good agreement between theory\nand experiment clearly proves that molecules are created\nin the expected ro-vibrational level.\nWhen a molecule passes through the upper branch of\nthe avoided crossing, its vibrational quantum number\nchanges from -5 to -1 (counting from threshold). Correspondingly, the size of the molecule, i.e. the outer turning\npoint of the vibrational state of the nuclei, changes by a\nfactor of ∼ 3.\nThe reversal of the sign of dE/dB visible in Fig. 3b\nmakes the molecules 1001.7-G seekers, instead of the\nusual high- or low-field seekers. This can be exploited to\ntrap the molecules by applying an inhomogeneous magnetic field. In the presence of a magnetic-field gradient,\nthe quadratic dependence of E(B) in Fig. 3a creates a\nharmonic confinement for the molecules. The resulting\nharmonic oscillation is shown in Fig. 4 for a gradient\nof 100 G/cm with the molecules initially prepared at\n1003.2 G. This corresponds to a one-dimensional trap\nfor molecules. In principle, such a trap could work in\nthree dimensions. Note that this is very different from a\nstandard magnetic trap, where usually low-field seeking\n~\nparticles are trapped at a minimum of |B|.\nHere, the\n~ which is\nmolecules are trapped at a specific value of |B|,\nnot a minimum of the field configuration.\nIn conclusion, the Stern-Gerlach technique used here\nproves that molecules are created in the expected rovibrational level. The measured magnetic moment of\nthe molecules reveals an avoided crossing and agrees well\nwith theory. The avoided crossing is used to trap the\nmolecules in one dimension. Future experiments will aim\non the creation of a larger fraction of molecules, investigate heating mechanisms that occur during the magnetic\nfield ramps, and develop tools to investigate the coherence properties of the molecular cloud.\nSimilar experiments are currently being carried out\nwith a BEC of Cs [30]. After submission of this\nmanuscript we learned that related experiments were performed with Na [31] and fermionic 6 Li [32, 33].\nWe thank S. Ernst for assistance with the experiment,\nand E. van Kempen and B. Verhaar for providing numerical results. This work was supported by the EuropeanUnion Network \"Cold Quantum Gases\".\n\n[1] J. D. Weinstein, R. deCarvalho, T. Guillet, B. Friedrich,\nand J. M. Doyle, Nature (London) 395, 148 (1998).\n[2] R. Wynar, R. S. Freeland, D. J. Han, and D. J. Heinzen,\nScience 287, 1016 (2000).\n[3] J. M. Gerton, D. Strekalov, I. Prodan, and R. G. Hulet,\nNature (London) 408, 692 (2000).\n[4] C. McKenzie et al. , Phys. Rev. Lett. 88, 120403 (2002).\n\n[5] E. A. Donley, N. R. Claussen, S. T. Thomson, and C. E.\nWieman, Nature (London) 417, 529 (2002).\n[6] C. A. Regal, C. Ticknor, J. L. Bohn, and D. S. Jin, Nature (London) 424, 47 (2003).\n[7] W. C. Stwalley, Phys. Rev. Lett. 37, 1628 (1976).\n[8] E. Tiesinga, B. J. Verhaar, and H. T. Stoof, Phys. Rev.\nA 47, 4114 (1993).\n[9] S. Inouye, M. R. Andrews, J. Stenger, H.-J. Miesner,\nD. M. Stamper-Kurn, and W. Ketterle, Nature (London)\n392, 151 (1998).\n[10] P. Courteille, R. S. Freeland, D. J. Heinzen, F. A. van\nAbeelen, and B. J. Verhaar, Phys. Rev. Lett. 81, 69\n(1998).\n[11] J. L. Roberts, N. R. Claussen, J. P. Burke, C. H. Greene,\nE. A. Cornell, and C. E. Wieman, Phys. Rev. Lett. 81,\n5109 (1998).\n[12] V. Vuletic, A. J. Kerman, C. Chin, and S. Chu, Phys.\nRev. Lett. 82, 1406 (1999).\n[13] T. Loftus, C. A. Regal, C. Ticknor, J. L. Bohn, and D. S.\nJin, Phys. Rev. Lett. 88, 173201 (2002).\n[14] L. Khaykovich et al. , Science 296, 1290 (2002).\n[15] K. E. Strecker, G. B. Partridge, A. G. Truscott, and R. G.\nHulet, Nature (London) 417, 150 (2002).\n[16] A. Marte, T. Volz, J. Schuster, S. Dürr, G. Rempe, E. G.\nvan Kempen, and B. J. Verhaar, Phys. Rev. Lett. 89,\n283202 (2002).\n[17] K. Dieckmann, C. A. Stan, S. Gupta, Z. Hadzibabic,\nC. H. Schunck, and W. Ketterle, Phys. Rev. Lett. 89,\n203201 (2002).\n[18] S. Jochim, M. Bartenstein, G. Hendl, J. Hecker-Denschlag, R. Grimm, A. Mosk, and M. Weidemüller, Phys.\nRev. Lett. 89, 273202 (2002).\n[19] K. M. O'Hara et al. , Phys. Rev. A 66, 041401 (2002).\n[20] T. Weber, J. Herbig, M. Mark, H.-C. Nägerl, and\nR. Grimm, Science 299, 232 (2003).\n[21] F. van Abeelen and B. Verhaar, Phys. Rev. Lett. 83,\n1550 (1999).\n[22] E. Timmermans, P. Tommasini, M. Hussein, and A. Kerman, Phys. Rep. 315, 199 (1999).\n[23] F. H. Mies, E. Tiesinga, and P. S. Julienne, Phys. Rev.\nA 61, 022721 (2000).\n[24] V. A. Yurovsky and A. Ben-Reuven, Phys. Rev. A 67,\n043611 (2003).\n[25] M. Mackie, A. Carmichael, M. Kostrun, R. J. Perkins,\nC. Xu, Y. Zheng, K.-A. Suominen, and J. Javanainen,\ne-print physics/0210131.\n[26] J. Cubizolles, T. Bourdel, S. J. Kokkelmans,\nG. V. Shlyapnikov, and C. Salomon, e-print condmat/0308018.\n[27] Eleanor Hodby, talk at APS DAMOP Meeting 2003.\n[28] T. Volz, S. Dürr, S. Ernst, A. Marte, and G. Rempe,\nPhys. Rev. A 68, 010702 (2003).\n[29] Eric van Kempen and Boudewijn Verhaar, personal communication.\n[30] J. Herbig, T. Kraemer, M. Mark, T. Weber, C. Chin,\nH.-C. Nägerl, and R. Grimm, Science 301, 1510 (2003).\n[31] K. Xu, T. Mukaiyama, J.R. Abo-Shaeer, J.K. Chin, D.\nMiller, and W. Ketterle, e-print cond-mat/0310027.\n[32] S. Jochim, M. Bartenstein, A. Altmeyer, G. Hendl, C.\nChin, J. Hecker-Denschlag, and R. Grimm, e-print condmat/0308095.\n[33] K. E. Strecker, G. B. Partridge, and R. G. Hulet, Phys.\nRev. Lett. 91, 080406 (2003).\n\n\f"}