{"id": "http://arxiv.org/abs/cond-mat/0012357v1", "guidislink": true, "updated": "2000-12-19T15:38:13Z", "updated_parsed": [2000, 12, 19, 15, 38, 13, 1, 354, 0], "published": "2000-12-19T15:38:13Z", "published_parsed": [2000, 12, 19, 15, 38, 13, 1, 354, 0], "title": "The Effect of Helicity on the Effective Diffusivity for Incompressible\n  Random Flows", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0012375%2Ccond-mat%2F0012275%2Ccond-mat%2F0012064%2Ccond-mat%2F0012077%2Ccond-mat%2F0012512%2Ccond-mat%2F0012213%2Ccond-mat%2F0012446%2Ccond-mat%2F0012216%2Ccond-mat%2F0012157%2Ccond-mat%2F0012500%2Ccond-mat%2F0012161%2Ccond-mat%2F0012086%2Ccond-mat%2F0012221%2Ccond-mat%2F0012386%2Ccond-mat%2F0012159%2Ccond-mat%2F0012176%2Ccond-mat%2F0012343%2Ccond-mat%2F0012089%2Ccond-mat%2F0012453%2Ccond-mat%2F0012214%2Ccond-mat%2F0012113%2Ccond-mat%2F0012258%2Ccond-mat%2F0012331%2Ccond-mat%2F0012249%2Ccond-mat%2F0012492%2Ccond-mat%2F0012472%2Ccond-mat%2F0012372%2Ccond-mat%2F0012468%2Ccond-mat%2F0012167%2Ccond-mat%2F0012114%2Ccond-mat%2F0012173%2Ccond-mat%2F0012276%2Ccond-mat%2F0012239%2Ccond-mat%2F0012395%2Ccond-mat%2F0012070%2Ccond-mat%2F0012474%2Ccond-mat%2F0012035%2Ccond-mat%2F0012177%2Ccond-mat%2F0012133%2Ccond-mat%2F0012270%2Ccond-mat%2F0012387%2Ccond-mat%2F0012469%2Ccond-mat%2F0012516%2Ccond-mat%2F0012007%2Ccond-mat%2F0012465%2Ccond-mat%2F0012357%2Ccond-mat%2F0012400%2Ccond-mat%2F0012287%2Ccond-mat%2F0012388%2Ccond-mat%2F0012466%2Ccond-mat%2F0012320%2Ccond-mat%2F0012122%2Ccond-mat%2F0012126%2Ccond-mat%2F0012194%2Ccond-mat%2F0012496%2Ccond-mat%2F0012144%2Ccond-mat%2F0012185%2Ccond-mat%2F0012170%2Ccond-mat%2F0012139%2Ccond-mat%2F0012020%2Ccond-mat%2F0012445%2Ccond-mat%2F0012484%2Ccond-mat%2F0012271%2Ccond-mat%2F0012212%2Ccond-mat%2F0012411%2Ccond-mat%2F0012358%2Ccond-mat%2F0012338%2Ccond-mat%2F0012449%2Ccond-mat%2F0012004%2Ccond-mat%2F0012026%2Ccond-mat%2F0012046%2Ccond-mat%2F0012120%2Ccond-mat%2F0012060%2Ccond-mat%2F0012260%2Ccond-mat%2F0012110%2Ccond-mat%2F0012198%2Ccond-mat%2F0012441%2Ccond-mat%2F0012359%2Ccond-mat%2F0012263%2Ccond-mat%2F0012135%2Ccond-mat%2F0012475%2Ccond-mat%2F0012228%2Ccond-mat%2F0012160%2Ccond-mat%2F0012366%2Ccond-mat%2F0012383%2Ccond-mat%2F0012032%2Ccond-mat%2F0012459%2Ccond-mat%2F0012302%2Ccond-mat%2F0012288%2Ccond-mat%2F0012461%2Ccond-mat%2F0012354%2Ccond-mat%2F0012423%2Ccond-mat%2F0012247%2Ccond-mat%2F0012065%2Ccond-mat%2F0012292%2Ccond-mat%2F0012024%2Ccond-mat%2F0012136%2Ccond-mat%2F0012125%2Ccond-mat%2F0012418%2Ccond-mat%2F0012458%2Ccond-mat%2F0012081&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Effect of Helicity on the Effective Diffusivity for Incompressible\n  Random Flows"}, "summary": "The advection of a passive scalar by a quenched (frozen) incompressible\nvelocity field is studied by extensive high precision numerical simulation and\nvarious approximation schemes. We show that second order self consistent\nperturbation theory, in the absence of helicity, perfectly predicts the\neffective diffusivity of a tracer particle in such a field. In the presence of\nhelicity in the flow simulations reveal an unexpectedly strong enhancement of\nthe effective diffusivity which is highly nonperturbative and is most visible\nwhen the bare molecular diffusivity of the particle is small. We develop and\nanalyse a series of approximation schemes which indicate that this enhancement\nof the diffusivity is due to a novel second order effect whereby the helical\ncomponent of the field, which does not directly renormalize the effective\ndiffusivity, enhances the strength of the non helical part of the flow, which\nin turn renormalizes the molecular diffusivity. We show that this\nrenormalization is most important at low bare molecular diffusivity, in\nagreement with the numerical simulations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0012375%2Ccond-mat%2F0012275%2Ccond-mat%2F0012064%2Ccond-mat%2F0012077%2Ccond-mat%2F0012512%2Ccond-mat%2F0012213%2Ccond-mat%2F0012446%2Ccond-mat%2F0012216%2Ccond-mat%2F0012157%2Ccond-mat%2F0012500%2Ccond-mat%2F0012161%2Ccond-mat%2F0012086%2Ccond-mat%2F0012221%2Ccond-mat%2F0012386%2Ccond-mat%2F0012159%2Ccond-mat%2F0012176%2Ccond-mat%2F0012343%2Ccond-mat%2F0012089%2Ccond-mat%2F0012453%2Ccond-mat%2F0012214%2Ccond-mat%2F0012113%2Ccond-mat%2F0012258%2Ccond-mat%2F0012331%2Ccond-mat%2F0012249%2Ccond-mat%2F0012492%2Ccond-mat%2F0012472%2Ccond-mat%2F0012372%2Ccond-mat%2F0012468%2Ccond-mat%2F0012167%2Ccond-mat%2F0012114%2Ccond-mat%2F0012173%2Ccond-mat%2F0012276%2Ccond-mat%2F0012239%2Ccond-mat%2F0012395%2Ccond-mat%2F0012070%2Ccond-mat%2F0012474%2Ccond-mat%2F0012035%2Ccond-mat%2F0012177%2Ccond-mat%2F0012133%2Ccond-mat%2F0012270%2Ccond-mat%2F0012387%2Ccond-mat%2F0012469%2Ccond-mat%2F0012516%2Ccond-mat%2F0012007%2Ccond-mat%2F0012465%2Ccond-mat%2F0012357%2Ccond-mat%2F0012400%2Ccond-mat%2F0012287%2Ccond-mat%2F0012388%2Ccond-mat%2F0012466%2Ccond-mat%2F0012320%2Ccond-mat%2F0012122%2Ccond-mat%2F0012126%2Ccond-mat%2F0012194%2Ccond-mat%2F0012496%2Ccond-mat%2F0012144%2Ccond-mat%2F0012185%2Ccond-mat%2F0012170%2Ccond-mat%2F0012139%2Ccond-mat%2F0012020%2Ccond-mat%2F0012445%2Ccond-mat%2F0012484%2Ccond-mat%2F0012271%2Ccond-mat%2F0012212%2Ccond-mat%2F0012411%2Ccond-mat%2F0012358%2Ccond-mat%2F0012338%2Ccond-mat%2F0012449%2Ccond-mat%2F0012004%2Ccond-mat%2F0012026%2Ccond-mat%2F0012046%2Ccond-mat%2F0012120%2Ccond-mat%2F0012060%2Ccond-mat%2F0012260%2Ccond-mat%2F0012110%2Ccond-mat%2F0012198%2Ccond-mat%2F0012441%2Ccond-mat%2F0012359%2Ccond-mat%2F0012263%2Ccond-mat%2F0012135%2Ccond-mat%2F0012475%2Ccond-mat%2F0012228%2Ccond-mat%2F0012160%2Ccond-mat%2F0012366%2Ccond-mat%2F0012383%2Ccond-mat%2F0012032%2Ccond-mat%2F0012459%2Ccond-mat%2F0012302%2Ccond-mat%2F0012288%2Ccond-mat%2F0012461%2Ccond-mat%2F0012354%2Ccond-mat%2F0012423%2Ccond-mat%2F0012247%2Ccond-mat%2F0012065%2Ccond-mat%2F0012292%2Ccond-mat%2F0012024%2Ccond-mat%2F0012136%2Ccond-mat%2F0012125%2Ccond-mat%2F0012418%2Ccond-mat%2F0012458%2Ccond-mat%2F0012081&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The advection of a passive scalar by a quenched (frozen) incompressible\nvelocity field is studied by extensive high precision numerical simulation and\nvarious approximation schemes. We show that second order self consistent\nperturbation theory, in the absence of helicity, perfectly predicts the\neffective diffusivity of a tracer particle in such a field. In the presence of\nhelicity in the flow simulations reveal an unexpectedly strong enhancement of\nthe effective diffusivity which is highly nonperturbative and is most visible\nwhen the bare molecular diffusivity of the particle is small. We develop and\nanalyse a series of approximation schemes which indicate that this enhancement\nof the diffusivity is due to a novel second order effect whereby the helical\ncomponent of the field, which does not directly renormalize the effective\ndiffusivity, enhances the strength of the non helical part of the flow, which\nin turn renormalizes the molecular diffusivity. We show that this\nrenormalization is most important at low bare molecular diffusivity, in\nagreement with the numerical simulations."}, "authors": ["D. S. Dean", "I. T. Drummond", "R. R. Horgan"], "author_detail": {"name": "R. R. Horgan"}, "author": "R. R. Horgan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.63.061205", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0012357v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0012357v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, 11 figures Latex source", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0012357v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0012357v1", "journal_reference": null, "doi": "10.1103/PhysRevE.63.061205", "fulltext": "arXiv:cond-mat/0012357v1 [cond-mat.dis-nn] 19 Dec 2000\n\nThe Effect of Helicity on the Effective Diffusivity for\nIncompressible Random Flows\nD.S. Dean\nIRSAMC, Laboratoire de Physique Quantique,\nUniversité Paul Sabatier, 118 route de Narbonne, 31062 Toulouse Cedex\n\nI.T. Drummond and R.R. Horgan\nDAMTP, CMS\nWilberforce Road, Cambridge CB3 0WA\nNovember 20, 2018\n\nAbstract\nThe advection of a passive scalar by a quenched (frozen) incompressible velocity field is studied by extensive high precision numerical simulation and various\napproximation schemes. We show that second order self consistent perturbation\ntheory, in the absence of helicity, perfectly predicts the effective diffusivity of a\ntracer particle in such a field. In the presence of helicity in the flow simulations\nreveal an unexpectedly strong enhancement of the effective diffusivity which is\nhighly nonperturbative and is most visible when the bare molecular diffusivity of\nthe particle is small. We develop and analyse a series of approximation schemes\nwhich indicate that this enhancement of the diffusivity is due to a novel second\norder effect whereby the helical component of the field, which does not directly\nrenormalize the effective diffusivity, enhances the strength of the non helical part\nof the flow, which in turn renormalizes the molecular diffusivity. We show that this\nrenormalization is most important at low bare molecular diffusivity, in agreement\nwith the numerical simulations.\n\nDAMTP-2000-139\n1\n\n\f1\n\nIntroduction\n\nThe advection of passive fields subject to molecular diffusion and convection by turbulent fluid has been extensively studied by both theoretical and computational techniques\n[1, 2, 3, 4, 5, 6]. By comparing the results of simulation with the theoretical prediction\nfor various long-range quantities, the efficacy of the theoretical methods can be tested\nalbeit, in somewhat artificial models. The applications to the physics of complex systems and engineering are many fold. In practical problems we need to calculate the bulk\nproperties of random media given statistical models for the disorder present. In general\nthe complexity of these real world problems means that one must resort to approximation schemes to calculate these large scale bulk properties. It is therefore essential to\nverify various methods of analysis on model problems before one can be confident that\nthese or similar methods can be applied to more realistic systems. The success of an\napproach depends on whether the approximation preserves the essence of the physical\nmechanism responsible for determining the long-range parameters of the advection in\nterms of the parameters describing the local characteristics of the flow. In this paper\nwe consider advection in a helical Gaussian turbulent flow which was originally studied\nin [4]. The surprising result observed on the basis of simulation is that the long-range\neffective diffusivity, κe , is greatly enhanced by the presence of the helicity by more than\na factor of two, the effect being strongest for small molecular diffusivity, κ0 . In the absence of helicity the calculation of κe to two loops in self-consistent perturbation theory\nagrees accurately with the simulation for all κ0 . However, such an approach predicts\nthat even maximal helicity will have only a small effect of the order of 10%. This is\nin stark contrast to the results of simulation. The puzzle is to explain these results for\nwhat is a relatively simply posed system. A successful theoretical approach will involve\ninfinite resummations of contributions and it is in this sense that the enhancement is\nnon-perturbative.\nIn this paper we discuss a possible resolution of the conflict between theory and\nsimulation by using various methods to identify the low-wavenumber effective theory\ngoverning the diffusive dispersal of particles advected in the turbulent flow when helicity\nis present. The derivation of the effective theory is guided by the renormalization group\n(RG) idea that the Green function at low wave-number is, in some approximation,\nthe solution to an effective second-order differential equation whose parameters are\ndetermined self-consistently in terms of the original or 'bare' defining the model. The\neffect of helicity in the flow causes the turbulent velocity field, u(x, t), to be additively\nrenormalized by a term proportional to the vorticity, ω = ∇ × u. The coefficient of\nproportionality is a is a pseudo-scalar which is generated by the axial-vector nature of\nthe helical flow and so depends on the helicity h, defined in terms of u by\nh = hu * ∇ × ui\n\n(1.1)\n\nwhere h*i denotes the ensemble average over the random velocity field. In our model\nthe magnitude of h is measured by a parameter λ, 0 ≤ λ ≤ 1, and the results are given\nin terms of λ. The usual perturbative result for the dependence of κe on λ is that κe\nis a series in λ2 for all values of κ0 . This is self-evident since the magnitude of κe is\nindependent of the sign of λ. The simulation is seemingly consistent with this fact for\nλ < 0.2 at κ0 = 0 but is not well fitted by any simple approach, and for larger λ the\n2\n\n\fcurve lies far higher than the naive calculation. We discuss an improved self-consistent\nscheme which expresses the Green function and vertex functions as solutions to integral\nequations which are solved in a low-wavenumber approximation. This method leads\nto a strong enhancement of κe for increasing λ and, as such, is a good indication that\nwe are on the right track. However, for small λ the effect is paradoxically too strong,\nleading to a non-analytic dependence of κe on λ which is predicted to be κe ∼ λ2/3 in the\none-loop case. This is possibly due to the approximation made in obtaining the solution\nbut it is a complex matter to ascertain whether this is so. An alternative approach is\nto use the functional Hartree-Fock method which leads to an integral equation for the\nGreen function self-energy as a function of wave-number. The result of this method for\nκe (λ) is better behaved at small λ but the predicted enhancement is not big enough\nand does not fit the simulation data. In general, the effect is most pronounced for small\nκ0 and empirically from our simulation we find that the results distinguish the regions\nκ0 ≪ 0.2 and κ0 ≫ 0.2. There is a pronounced dip in κe vs κ0 at κ0 ∼ 0.2 for λ = 1.\nThis dip is not predicted by either of the methods mentioned so far.\nWe also present a renormalization group approach which shows a mechanism for the\nenhancing effect of helicity on κe . The renormalization group is normally most useful\nfor computing anomalous exponents since they are generally independent of much of the\ndetails defining the model: the idea of universality. It is much more difficult to control\na standard RG analysis if it is used to calculate the coefficients of scaling behaviour,\ni.e., observables like κe . However, in ref. [7] we reported on a successful use of the RG\nin predicting κe for gradient flows and believe that an RG analysis can generally give\na strong indication of the kind of mechanism which influences the size of parameters\ncontrolling the large-scale characteristics of advection. In this paper we show that the\nflow at large wave vector can strongly enhance κe when κ0 is small. In particular, this\napproach does provide a mechanism for the dip observed in κe vs κ0 at κ0 ∼ 0.2 for\nλ = 1.\nIn section 2 the model and the formalism are reviewed; in section 3 the perturbation\ntheory is briefly described; in section 4 the self-consistent integral equations for the\nGreen function and vertex functions are derived to one-loop and the small wave vector\napproximation for κe is derived; in section 5 the functional Hartree Fock method is\nexamined; in section 6 the renormalization group approach is explained and in section\n7 the conclusions are presented.\n\n2\n\nThe Model and Formalism\n\nIn [4] the problem of a passive scalar advected by an incompressible turbulent flow\nwith a molecular diffusivity was studied. The turbulent fluid velocity field, u(x, t), was\ndescribed by its statistical properties which were assumed to be Gaussian and so fully\ndetermined by the velocity auto-correlation function. In the original study the flow\nwas time-dependent, but since the enhancement of κe by helicity in the flow is present\nalso for time-independent flows we assume here, for simplicity, a time-independent flow\n(i.e. quenched or frozen turbulence) for which the auto-correlation function can be\nexpressed in the following form:\nhui (x)uj (x′ )i =\n\nZ\n\nd3 k ik*(x−x′ )\ne\nFij (k) .\n(2π)3\n3\n\n(2.1)\n\n\fThe ensemble of velocity fields was taken to be homogeneous and isotropic and so\nfor incompressible fluids Fij (k) can be written as\nFij (k) = Φ(k)(k2 δij − ki kj ) + Ψ(k)iǫimj km ,\n\n(2.2)\n\nwhere Ψ represents the presence of helicity in the flow. In [4] it was assumed that Φ\nand Ψ took the factorized forms:\nΦ(k) =\nΨ(k) =\n\n(2π)3 2\nA E(k)\n3\n(2π)3 2\nA kE(k)sin 2ψ ,\n3\n\n(2.3)\n\nwhere A is chosen so that\nZ\n\nhu * ui = u20 ,\n\ndkE(k) = 1 ,\n\n(2.4)\n\nand where u0 is the r.m.s. velocity. Choosing the angle ψ to be k-independent means\nthat the helicity is of equal strength at all wave vectors. The helicity parameter, h, has\nbeen defined in eqn. (1.1) and with the definitions in eqn. (2.3), we find\n2\nh = A2 hk3 isin 2ψ ,\n3\n\n(2.5)\n\nwhere hk3 i is the expectation value with respect to the distribution E(k). The passive\nscalar field Θ(x, t) is advected according to the equation\ndΘ\n= κ0 ∇2 Θ − ∇ * (uΘ) ,\ndt\n\n(2.6)\n\nand the effective, or long-range, diffusivity, κe , is defined by\nZ\n\nhx * xi(t) = h\n\nd3 x x * x Θ(x, t)i ,\n\n= 6κe t + O(t0 ) as t → ∞ ,\n\n(2.7)\n\nZ\n\n(2.8)\n\nwhere Θ is normalized to unity:\nd3 x Θ(x, t) = 1 .\n\nFor the purposes of numerical simulation a particular member of the velocity-field\nensemble is then realized by [1, 2, 4]\nu(x) = A\n\nN n\u0010\nX\n\nn=1\n\n+\n\n\u0011\n\nξ n cos ψ − χn ∧ k̂n sin ψ ∧ kn cos (kn * x)\n\n\u0010\n\n\u0011\n\nχn cos ψ + ξ n ∧ k̂n sin ψ ∧ kn sin (kn * x)\n\no\n\n,\n\n(2.9)\n\nwhere the vectors ξn and χn are distributed uniformly and independently over the unit\nsphere and the wave vector kn is distributed according to the distribution E(k). For\nN sufficiently large the central limit theorem guarantees that u(x) is Gaussian up to\n4\n\n\fO(1/N ) corrections. We have used N = 64 for which these effects are sufficiently small\nfor our purposes.\nTo simulate the evolution of the scalar field Θ(x, t) we integrate numerically the\nstochastic equation for the evolution of a particle with path x(t) given by\nẋ(t) = u(x(t)) + η(t) ,\n\n(2.10)\n\nwhere η(t) is a Gaussian random variable with hη(t)i = 0 and hη(t)*η(t′ )i = 2κ0 δ(t−t′ ).\nThe resulting probability distribution for particle position x(t) is then Θ(x, t) with the\ninitial condition Θ(x, 0) = δ(x).\nThe discrete form of eqn. (2.10) suitable for numerical integration is:\n1\n\nxn+1 − xn = u(xn ) ∆t + (2κ0 ∆t) 2 ǫn ,\n\n(2.11)\n\nwhere ǫn is a Gaussian random three-vector of zero mean and unit variance for each\ncomponent. This equation models eqn. (2.10) correctly to O(∆t) but the details of\na third-order Runge-Kutta scheme correct to O(∆t3 ) are given in [4]. We use this\nthird-order scheme in our numerical simulation.\nThe effective diffusivity, κe , is then computed from the ensemble of paths by\nM\n1 X\nx(a) (t) * x(a) (t) ,\nhx(t) * x(t)ipaths = lim\nM →∞ M\na=1\n\n= 6κe t + O(1)\n\nas t → ∞ .\n\n(2.12)\n\nHere M is the total number of paths averaged over and (a) label the member of the\nensemble of paths. In practice M is finite but large enough to give an estimate for\nκe with small error. In addition t must be large enough so that the path evolution\nis in the asymptotic regime where the evolution can be suitably described in terms of\nlong range effective, or \"renormalized\" quantities. That t is large enough is tested by\nensuring that the estimate for κe is independent of t within statistical errors.\n\n3\n\nPerturbation Theory\n\nThe perturbative approach to solving eqn. (2.6) is well known [8, 9, 6] and we only\nsummarize here the necessary results.\nSince we are interested in the effective parameters governing the evolution of the\ndistribution Θ(x, t), we study the related Green function G(x) which satisfies\nκ0 ∇2 G − u * ∇G = − δ(x) ,\n\n(3.1)\n\nwhere the incompressibility of u has been used. A perturbation series in u/k0 for G̃(k)\ncan be generated by iterating the formal solution to eqn. (3.1) in Fourier space:\n1\n1\nG̃(k) =\n2 +\nκ0 k\nκ0 k2\n\nZ\n\ndq\ni(k − q) * ũ(q)G̃(k − q) .\n(2π)3\n\n(3.2)\n\nThe Green function averaged over the velocity ensemble, hG̃(k)i, can then be written\nas\n1\n,\n(3.3)\nhG̃(k)i =\n2\nκ0 k − Σ(k)\n5\n\n\fwhere the averaging over the velocity ensemble is done using Wicks theorem to give a\ndiagrammatic expansion and Σ(k) is given by one particle-irreducible diagrams. The\nasymptotic behaviour in eqn. (2.12) implies that the small k behaviour of hG̃i is given\nby\nd\nκe = κ0 −\nΣ(k)|k=0 .\n(3.4)\ndk2\nThe Feynman rules for the diagrammatic perturbation expansion are:\n(i) Wavevector is conserved at each vertex;\n(ii) Each full line carries a factor of 1/k2 ;\n(iii) Wavevector is integrated around closed loops with a factor dq/(2π)3 ;\n(iv) The primitive vertex Vi (k′ , k), whose diagrammatic representation is shown in\nfigure 1a, is given by Vi (k′ , k) = i k′ i ;\n(v) Each internal dotted line carries a factor\nFij (k) = Φ(k)(k2 δij − ki kj ) + Ψ(k)iǫimj km .\n\n(3.5)\n\nIn what follows we use the explicit spectra\nΦ(k)\n\n=\n\nΨ(k)\n\n=\n\n(2π)3/2 2 −k2 /2k2\n0 ,\nu0 e\n6k02\nλ k Φ(k) ,\n\n(3.6)\n\nwhere λ = sin 2ψ .\nThe simple two-loop calculation for κe gives the result\nκe = κ0\n\n1 u20\nu40\n2\n1 +\n+\n(0.0059λ\n−\n0.00884)\n9 κ20 k02\nκ40 k04\n\n!\n\n.\n\n(3.7)\n\nThe diagrams contributing to this order are shown in figure 2. The two-loop integrals\nwere done numerically.\nThe effect of helicity is not seen until second order. This is evident from the explicit expressions for the diagrams but is also easily understood because the effect of\nhelicity on κe cannot depend on the sign of λ. Hence, the graphs with a non-vanishing\ncontribution from helicity must contain an even number of internal velocity correlators\n(dotted lines).\nClearly, this approach is not applicable to the limit κ0 → 0 in which we are interested\nbut a self-consistent method will allow the model to be perturbatively analyzed in this\nlimit and this is described in the next section.\n\n4\n\nSelf-Consistent Methods\n\nA self-consistent treatment performs a resummation of an infinite subset of diagrams\nwhich gives a continuation of the perturbation theory beyond its normal radius of\nconvergence. The approach is not unique but depends on how the effective low energy\n6\n\n\ftheory is parametrized and which quantities are treated self-consistently. A successful\nresult will depend on how well the method captures the dominant effects in this way.\nWe first discuss the simplest approach which treats only κe self-consistently. At\ntwo-loops this gives an excellent fit for κe when λ = 0 but fails for λ 6= 0. We then\ngeneralize the method and show that we can qualitatively explain the large enhancement\nin κe due to helicity although the approach is still quantitatively deficient. Further\ngeneralizations are discussed but have not yet been carried out.\n\n4.1\n\nSelf-Consistency in κe\n\nTo generate the self-consistent perturbation series in κe the eqn. (3.1) for G(x) is\nformally rearranged to become\nκe ∇2 G − ∆κ ∇2 G − u * ∇G = − δ(x) ,\n\n(4.1.1)\n\nwhere ∆κ = κe − κ0 . The second term is a counter-term which is included as part\nof the perturbation. It is formally of first order in the expansion parameter which\nallows the expansion for κe to be constructed to a consistent order. The self-consistent\nperturbation series is generated by iterating\n1\n1\nG̃(k) =\n2 +\nκe k\nκe k2\n\nZ\n\n\u0011\ndq \u0010\n2\ni(k\n−\nq)\n*\nũ(q)\n−\n∆κ\nδ(q)\n(k\n−\nq)\nG̃(k − q) . (4.1.2)\n(2π)3\n\nThis equation can be rewritten as an equation for ∆κ and its diagrammatic representation up to two loops is shown in figure 3(a). Since κe is not renormalized from the\ntree-level value we have the self-consistency condition\nd\nΣ(k)|k=0 = 0 .\ndk2\n\n(4.1.3)\n\nTo N -th order in u20 /κ2e k02 it is always possible to write this condition in the form\nκe = κ0 + κe FN (κe , λ) ,\nFN (κe , λ) =\n\nN\nX\n\nn=1\n\ngn (λ)\n\nu20\nκ2e k02\n\n!n\n\n.\n\n(4.1.4)\n\n¿From now on we set u0 = 1, k0 = 1 and, using the velocity-field spectrum given\nin section 2, we find the two-loop self-consistent expression for κe\n\u0012\n\n(κe − κ0 ) 1 −\n\n1\n9 κ2e\n\n\u0013\n\n= κe\n\n\u0012\n\ni\u0013\n1\n1 h\n2\n+\n0.0059λ\n−\n0.00884\n.\n9κ2e\nκ4e\n\n(4.1.5)\n\nThis result can be re-expressed in the form of eqn. (4.1.4) to become\nκe = κ0 + κe\n\n1\n0.0035 + 0.0059λ2\n+\n9κ2e\nκ4e\n\n!\n\n.\n\n(4.1.6)\n\nWe show the two-loop self-consistent prediction for κe compared with data in figures 7 –\n11. In figures 7, 8 and 9 κe is plotted against κ0 for fixed l = 0.0, 0.4, 1.0 and in figures\n10 and 11 κe is plotted against λ for fixed κ0 = 0.0, 0.2. As should be expected, we see\n7\n\n\ffrom figures 8 and 9 the agreement between theory and simulation is acceptable for κ0\nlarge enough. This is simply because the large molecular diffusivity swamps all other\neffects. However, there is a large disagreement for small κ0 which is most marked for\nκ0 = 0. The prediction for κe behaves like O(λ2 ) and for κ0 changes from κe = 0.3697\nat λ = 0 to κe = 0.4090 at λ = 1: an increase of 10%. In contrast, the simulation gives\nκe = 0.3705(1) and κe = 0.8018(7) respectively at these two values of λ: an increase of\nmore than a factor of two. From the simulation for κ0 small enough we find that κe\nas a function of λ is strongly in disagreement with the slow polynomial behaviour in\nλ predicted by self-consistent perturbation theory. This effect was first observed in [4]\nand has remained unexplained.\nIn addition, in figure 9 we observe a marked dip in the data at fixed λ = 1 for\nκe versus κ0 at about κ0 = 0.2. The major feature is that κe rises rapidly with λ at\nκ0 = 0 whereas the effect for κ0 ≥ 0.2 is much less strong: the dip is not a lowering\nof the curve as λ increases at κ0 = 0.2 but rather a rapid rise with λ at κ0 = 0. The\nself-consistent prediction of this section does not predict a dip of any kind.\n\n4.2\n\nA more general approach\n\nIn this section we propose an explanation of the enhancement of κe by helicity in the\nflow. The technique is presented in detail at the one-loop level and the extension\ntwo-loop is then given.\nThe philosophy is to suggest an effective, low wavevector diffusion equation obeyed\nby the smoothed distribution function. Because the wave vector is small it is assumed\nthat the equation can be limited to at most two spatial derivatives. The shortcomings\nof this assertion are discussed later. We propose the equation\ndΘ\n= κ0 ∇2 Θ − αR u * ∇Θ − βR ω * ∇Θ ,\ndt\n\n(4.2.1)\n\nwhere ω is the vorticity and αR and βR are coupling constants which must be determined self-consistently. The bare values of these couplings, α0 and β0 , define the\noriginal diffusion equation. From eqn. (2.6) we see that in our case α0 = 1 and β0 = 0\nbut the analysis may be applied for general values of α0 and β0 . Eq. (4.2.1) is equivalent to renormalizing the velocity field to uR = αR u + βR ω. It will turn out that α is\nnot renormalized and so the self-consistency conditions are applied only to determine\nκe and βR . To this end the equation for the G(x) is taken to be\nκe ∇2 G − ∆κ ∇2 G − α0 u * ∇G − βR ω * ∇G + ∆β ω * ∇G = − δ(x) ,\n\n(4.2.2)\n\nwhere, as before, ∆κ = κe − κ0 and ∆β = βR − β0 . The rules for perturbation theory\nare the same as given in section 3 with the additional rules\n(vi) The primitive vertex Wi (k′ , k) associated with the vorticity and whose diagrammatic representation is shown in figure 1b, is given by Wi (k′ , k) = (k′ ∧ k)i ;\n(vii) For each vertex of type Vi a factor of αR and for each vertex of type Wi a factor\nof βR .\n\n8\n\n\fThe self-consistent equations are given by setting the next renormalizations of κe and\nβR to zero in perturbation theory. This gives two equations which simultaneously\ndetermine κe , αR and βR in terms of the bare parameters κ0 , α0 and β0 . It is convenient\nto define the general vertex Ui (k′ , k) of the form\nUi (k′ , k) = iV (k′ , k) k′ i + W (k′ , k) (k′ ∧ k)i ,\n\n(4.2.3)\n\nwhere the form-factors V and W are scalar functions of k and k′ . The bare vertex\nU0i is defined by V 0 = α0 , W 0 = β0 . There is no independent form-factor coefficient\nproportional to ki in this expansion since the velocity field is incompressible. The\ndiagrammatic representation of U0i is shown in figures 1c and 1d, where the bare vertex\nis represented by an open circle while the renormalized vertex carries additionally an\ninset letter 'R'. Likewise, the general expression for hG̃(k)i can be defined as\nhG̃(k)i =\n\n1\n\u0010\n\n\u0011\n\nk2 κ0 + Ω(k2 )\n\n(4.2.4)\n\nTo two loops the self-consistent relationships that hold between diagrams are shown in\nfigure 5.\nWe are interested in the low-wavenumber properties of the theory and we use the\napproximations\nΩ(k2 ) = (κe − κ0 ) + O(k2 ) ,\n2\n\nV R = αR + O(k2 , k′ , k * k′ ) ,\n2\n\nW R = βR + O(k2 , k′ , k * k′ ) .\n\n(4.2.5)\n\nThese approximations are consistent with the form considered for the effective equation\ngoverning the dispersal, eqn. (4.2.1), since the renormalized couplings, αR and βR , are\ngiven respectively by the coefficients of k′ i and (k′ ∧ k)i in the expansion of Ui . To\ninclude higher powers of k and k′ would, for consistency, require terms involving u and\nω in eqn. (4.2.1) with higher powers of ∇. In principle, a functional self-consistent\nformalism could then be set up for Ω(k) and Ui (k′ , k) treating them respectively as a\nvector and matrices in wave-number space. However, this is a further generalization\nthat we have not yet pursued because the amount of computing effort required to\ndetermine them numerically is prohibitive. In the present case we are interested only in\nthe low-wavevector behaviour of these functions, and then the self-consistent equations\nare determined by asserting the self-consistency in the limit k′ , k → 0 and using eqns.\n(4.2.5).\nThe calculation is now straightforward but tedious. All loop integrals are approximated by their lowest non-zero power in (k, k′ ) and their contribution to the renormalization of the relevant coupling constant is read off. It suffices to give some examples\nwhich indicate how the full result is obtained and to this end we first analyze in detail\nthe one loop approximation to the self-consistent equations. The first observation is\nthat α is not renormalized, i.e., αR = α0 . We give one example indicating how this\ncomes about. The graphs is labelled by the couplings corresponding to the types of\nvertex it contains and the label is ordered in the same order that they occur in the\n\n9\n\n\fgraph. We consider the contribution shown in figure 4 to the vertex renormalization\nand will concentrate on the part proportional to k′ . The value of this graph is\nTβαα = α2R βR\n\nZ\n\ndq ǫlmn km qn (k′ − q)p k′ i Flp (q)\n.\n(2π)3\nκe (k − q)2 κe (k′ − q)2\n\n(4.2.6)\n\nThe approximations of eqn. (4.2.5) have been implemented. Only the helical part of\nFij (q) contributes and we find the result\ndq ǫlmn km qn (k′ − q)p q ǫlpq qq Φ(q)\nα2R βR λ ′\nik\ni\nκ2e\n(2π)3\n(k − q)2 (k′ − q)2\n\u0001\nZ\ndq k * k′ q2 − k * q k′ * q qΦ(q)\nα2R βR λ ′\nik i\n.\nκ2e\n(2π)3\n(k − q)2 (k′ − q)2\nZ\n\nTβαα =\n=\n\n(4.2.7)\n\nClearly the contribution to V is O(k*k′ ) and so α is not renormalized. All contributions\nto V are similarly of higher order and the result is that αR = α0 .\nThe coupling β is renormalized when λ 6= 0. The calculation follows a similar path\nto that used in the analysis of the renormalization of α. Again we show one calculation\nexplicitly and consider the contribution to W (k, k′ ) by calculating the coefficient of\n(k′ ∧ k) in Tααα :\nTααα\n\nα3\n= −i R\nκ2e\n\ndq (k − q)l (k′ − q)n Fln (q)\n.\n(2π)3\n(k − q)2 (k′ − q)2\n\nZ\n\n(4.2.8)\n\nThe contribution proportional to (k′ ∧ k) comes only from the helical part of Fln (q) and\nso the relevant term is\nTααα ∼\n\nα3R λ\nκ2e\n\nZ\n\ndq ǫlnp kl k′ n qp qm qΦ(q)\n.\n(2π)3 (k − q)2 (k′ − q)2\n\n(4.2.9)\n\nHence we find the contribution δβR to the renormalization of β from Tααα to be\nδβR = −\n\nα3 λ\n6π 3 κ2e\n\nZ\n\ndq qΦ(q) .\n\n(4.2.10)\n\nThe renormalization of βR is expressed in terms of three integrals:\nIn\n\n1\n=\n6π 3\n\nZ\n\ndq q n Φ(q)\n\nn = 1, 2, 3 .\n\n(4.2.11)\n\nAfter evaluating all the relevant graphs the self-consistent equations are\nαR − α0 = 0 ,\n\n2\nβ0 − βR + (α3R λ I1 + 2α2R βR I2 + αR βR\nλ I3 ) = 0 .\n\n(4.2.12)\n\nThe approximate equation for G̃(k) is given by the equation for Σ(k) in terms\nof the one-particle irreducible graphs in figure 5 at one-loop order. Because we are\nusing the low-wavenumber approximation this reduces to substituting the expression\n\n10\n\n\ffor the renormalized vertex Ui (k′ , k) given in eqns. (4.2.3) and (4.2.12) into the oneloop diagram for Σ(k) in figure 5. We analyze the one-loop self-energy graph and keep\nonly the term proportional to k2 . In obvious notation this gives the results\nTαα ∼ −\n\n2α2R\nI2\nκe\n\nTβα ∼\n\n2αR βR λ\nI3 .\nκe\n\n(4.2.13)\n\nUsing the spectra in eqn. (3.6) eqns. (4.2.12) and (4.2.13) for the one-loop selfconsistent conditions become:\n∆α ≡ αR − α0 = 0 ,\n\nC1\nB1\n= 0 , ∆κ +\n= 0,\nκ2e\nκe\n\n− ∆β +\n\n(4.2.14)\n\nwhere\nB1 =\n\n1\n18\n\n2α2R βR\n\nr\n\n+2\nr\n\n1\n= −\nα2R + 4\n9\n\nC1\n\n2\n2\nαR βR\nλ+\nπ\n\nr\n\n2\n2\nαR βR λ + 3 βR\nπ\n\n!\n\n2 3\nα λ\nπ R\n\n!\n\n,\n\n.\n\n(4.2.15)\n\n¿From these equations it is clear that no renormalization occurs if there is no pseudoscalar or axial-vector quantity in the problem: if β0 = λ = 0 then the problem reduces\nto the one-loop self-consistent analysis presented in section 4.1. However, if either β0 or\nλ are non-zero then β is renormalized and the effect on κe is encoded in eqn. (4.2.14).\nIn our case we set αR = α0 = 1, β0 = 0 and λ 6= 0. The equations (4.2.14), (4.2.15)\nthen give\nλ\nπ 3\nπ\n2\nβ + 3 βR\nλ + 9\nκe κ0 βR −\n= 0,\n3\n2\n2\n2\n!\nr\n2\n1\n2\nαR βR λ + 3 βR\nα2R + 4\n.\nκe = κ0 +\n9κe\nπ\nr\n\nr\n\n(4.2.16)\n\nFor small λ and κ0 = 0 we deduce that\nβ∼\n\n\u0012\n\n1\n18π\n\n\u00131/6\n\nλ1/3 ⇒ κe ∼\n\n1\n1\n+\n3\n2\n\n\u0012\n\n1\n18π\n\n\u00131/3\n\nλ2/3 .\n\n(4.2.17)\n\nThe data for κe versus λ for κ0 = 0 is shown in figure 10 and we see that for small\nλ the simulation results are not compatible with λ2/3 behaviour. We shall see below\nthat this is not rectified in the two-loop self-consistent calculation. However, in this\none-loop calculation there is a considerable enhancement in the dependence of κe on\nλ, whereas in the self-consistent calculation of section 4.1, in which the generation of\nthe new vertex coupled to the vorticity ω was not included, there is no effect at all at\none-loop order and only a mild effect at two-loop order. The equations (4.2.16) can\nbe solved numerically. For example, for κ0 = 0, λ = 1 we find βR = 0.3456 and the\neffective velocity field is predicted to be\nuR = u + βR ω ,\n\n11\n\n(4.2.18)\n\n\fwhich clearly leads to an enhanced effective diffusivity, κe = 0.5207, compared with\nκe = 0.4090 from the two-loop calculation of the previous section. We believe that\nwe have qualitatively captured the mechanism responsible for the enhancement of the\neffective diffusivity by helicity.\nThe one-loop calculation is limited because it is not accurate at λ = 0 unlike the\ntwo-loop calculation. We have investigated the two-loop extension of the self-consistent\napproach when the new vertex with coupling β is included. This is more involved and\nthe integrals were done numerically. We present the final results below.\nThe two-loop self-consistent equations are\nC1\n1\n1 ∂C1\n+ 3 (C2 − C12 ) = 0 ,\n− ∆β\nκe\nκe ∂β\nκe\nB1\n∆κ\n1 ∂B1 B2\n−∆β + 2 + 2 3 B1 − ∆β 2\n+ 4 = 0,\nκe\nκe\nκe ∂β\nκe\n∆κ +\n\n(4.2.19)\n\nwhere B1 and C1 are given in eqn. (4.2.15) and B2 and C2 are evaluated numerically\nto be (αR = α0 = 1)\nB2 = −(0.0047λ + 0.0095β + 0.0180βλ2 + 0.0644β 2 λ + 0.0423β 3 +\n0.0252β 3 λ2 + 0.0287β 4 λ) ,\n\nC2 = 0.0088 − 0.0034λ2 − 0.0165βλ − 0.0315β 2 − 0.0110β 2 λ2 −\n0.0514β 3 λ + 0.0090β 4 − 0.0337β 4 λ2 .\n\n(4.2.20)\n\nEqns. (4.2.19) can be rearranged to give\n1\n∂C1\nC1\n) = 0,\n+ 3 (C2 − C12 − B1\n2\nκe\nκe\n∂β\nB1\n1\n∂B1\n−∆β + 2 + 4 (B2 − 2B1 C1 − B1\n) = 0.\nκe\nκe\n∂β\n∆κ +\n\n(4.2.21)\n\nWe shall set β0 = 0 from now on. These equations contain the accurate two-loop selfconsistent result which fits the data for all κ0 at λ = 0. For λ 6= 0 these equations\nare solved numerically and the results are compared with simulation data in figure 7\n– 11 As in the one-loop case the behaviour for small λ is clearly incorrect and there\nis no quantitative agreement with the data. However, there is a clear enhancement\nof κe due to the inclusion of the vorticity vertex and associated coupling β and for\nλ = 1.0 we find κe = 0.5959. This mechanism for enhancing turbulent diffusion cannot\nobviously be deduced from perturbative considerations. It arises from a resummation\nof diagrams which give an expression that analytically continues between the regions\nwhere λ2 ≪ u20 /κ40 k04 and λ2 ≫ u20 /κ40 k04 . The effective diffusivity in the former region\nis well predicted by perturbation theory, but not so for parameters in the latter region.\nAlthough quantitative agreement is not good the important point is that a mechanism\nhas been discovered which gives a strong enhancement to the value of κe for non-zero λ\neven in the one-loop approximation, whereas in the self-consistent theory for κe alone,\ndiscussed in the previous section, there is no effect of helicity at all on the value of\nκe at one-loop order. The obvious reason for the discrepancy in this new approach\nis that the approximations made are much too crude. A more refined calculation\n12\n\n\fwould use a functional self-consistent method for Ui (k′ , k) (eqn. (4.2.3)) and Ω(k2 )\n(eqn. (4.2.4)). Although a computationally formidable task, this is likely to encode the\ncorrect behaviour much more accurately than does our low-wavenumber approximation.\nThe origin of the dip in figure 9 in the curve κe versus κ0 for λ = 1 is unexplained\nby the theory presented so far.\n\n5\n\nThe Functional Hartree-Fock Method\n\nThis approach goes some way towards including effects omitted in the low-wavenumber\napproximation. The version presented here is deficient in that the prediction for κe\nwhen κ0 = λ = 0 is not as accurate as the two-loop self-consistent approach but the\nadvantage is that Ω(k2 ), eqn. (4.2.4), is treated as function to be determined selfconsistently by the Hartree-Fock equations. The vertices are still treated in the lowwavenumber approximation and, as in the previous section, they are parameterized by\nα and β.\nThe integral equation to be satisfied by Ω(k2 ) and the one-loop equation satisfied\nby the vertex function, which is the same as the one-loop self-consistent equation, are\nshown in figure 6. Note that, unlike the self-consistent calculation of the previous\nsection, only one of the vertices in the one-loop self-energy is replaced with the full\nvertex since this gives the correct counting of diagrams when the equations are iterated.\nThe self-consistent case is different because the augmented vertex is already present\nin the perturbation theory and corrections are implemented by counter-terms. The\napproximation for the vertices in eqn. (4.2.5) is used and β is determined using eqn.\n(4.2.14):\nB1\n(5.1)\nβ = β0 + 2 ,\nκe\nwhere B1 is given in eqn. (4.2.15) and using κe = κ0 + Ω(0) . The Hartree-Fock\nequation to be satisfied by Ω(k2 ) is then (after some reduction and using φ in eqn.\n(3.6))\n2\n\nΩ(k ) =\n\n\"\n\n2\n1\n2\n√ e−k /2\n2\nk 3 2π\nβλ\n\nZ\n\nZ\n\n(pk cosh(pk) − sinh(pk)) e−p\ndp\npk (κ0 + Ω(p2 ))\n\nd3 p |p + k| φ(|p + k|) (k2 p2 − (k * p)2 )\n(2π)3\np2 (κ0 + Ω(p2 ))\n\n#\n\n2 /2\n\n+\n(5.2)\n\nThese equations are solved by discretizing the wavevector, performing the integrals numerically and iterating the equations to converge to a solution for Ω(k2 ). The effective\ndiffusivity is then κe = κ0 + Ω(0) .\nThe results are shown in figures 7 – 11, where it is clear that while the numerical\nvalue predicted at κ0 = λ = 0 is not accurate, the behaviour for small λ is more in\nkeeping with the simulation results. This strengthens our belief that an analysis which\ntreats the propagator and vertex as functions to be determined self-consistently is likely\nto reproduce the desired properties more accurately. However, at κ0 = 0, λ = 1 the\nvalue predicted is κe = 0.5070, still much less than the simulation value of 0.8018(7).\nIn principle, the vertex may be treated as a function in the same manner as Ω(k2 ).\nThis is prohibitively expensive in memory and computer time but might be possible if\n13\n\n\fsome simplification of the function form were implemented. Also, while the equation\nfor Ω(k2 ) is already exact at one-loop, that for the vertex is not and we cannot preclude\nthat higher loop corrections might be important. We have not pursued this approach.\nWe note that in this approach, as with those of the previous sections, the marked\ndip in κe as a function of κ0 for the larger values of λ is not reproduced.\n\n6\n\nThe Renormalization Group\n\nIn the previous section we presented an analysis based on the assumption that the\nlarge-scale advection is controlled by an effective transport equation dominated by\nthe terms containing only one and two derivatives. This method is related to the\nrenormalization group (RG) methods which have proved very successful in predicting\nexponents in critical phenomenon. In the RG approach a large wavenumber cutoff,\nΛ, is introduced and the advection on scales larger than L ≡ 2π/Λ is assumed to\nbe described by an effective transport equation, in principle containing terms with an\narbitrarily high number of derivatives. The parameters in this equation are functions\nof Λ in order to account for the effect of advection at the scales smaller than L which\nhave been excised. In the limit Λ → 0 the effective equation, by dimensional analysis,\ntakes a simple form dominated by terms with few derivatives and with associated\neffective or \"renormalized\" parameters. In this way the effective equation takes a form\nsimilar to that used in the previous section. There is a difference, though, because\nany practical application of these schemes requires a drastic truncation of the operator\nspace: especially in the RG method where it is impossible to compute the flow with\nchanging Λ for very many parameters in the effective transport equation. Unlike the\nsituation in critical phenomena there are no infra-red divergences in the theory and\nthe notion of a relevant operator is not applicable. It is then a matter of trial and\nerror to determine whether the approach used captures the vital features controlling\nthe flow. The simplest renormalization scheme is to calculate the renormalization to\nthe diffusivity κ(Λ) and to the vertex associated with the coupling of the random field\nor externally applied drift. ln the case of gradient flows we demonstrated in reference\n[7] that this scheme yields exact results in one and two dimensions and an extremely\naccurate, although not exact, result in three dimensions. It is, in general, much harder\nto calculated the renormalized parameters such as κe than the associated exponents,\nand so success in [7] suggests that some insight may be gained using RG methods in\nother similar problems.\nIn this section we present a RG calculation of κe . The vertex renormalization is done\nbut multiple vertex renormalization is neglected which means that the renormalized\nvelocity field remains Gaussian. Consequently, after integrating out the random field\ndown to wave number Λ we postulate that the equation for the effective Green function\ncan be approximated, for all Λ, by an equation of the same form as the original one\n(eqn. 3.1):\nκ(Λ) ∇2 G(x, Λ) − u(x, Λ) * ∇G(x, Λ) = −δ(x) ,\n(6.1)\nwhere κ(Λ) is the running renormalized diffusion constant and uΛ is the renormalized\nvelocity field. Since we renormalize the vertex functionally the field correlation function\n\n14\n\n\fwill flow under the RG as\n(\n\n′\n\nhũi (k, Λ) ũj (k , Λ)i =\n\n(2π)3 δ(k + k′ ) Fij (k, Λ) |k| < Λ\n0\n|k| > Λ\n\n(6.2)\n\nwhere\nFij (k, Λ) = Φ(k, Λ)(k2 δij − ki kj ) + Ψ(k, Λ)iǫimj km .\n\n(6.3)\n\nOne finds that the renormalized field is still incompressible. We shall compute the flow\nequations for κ(Λ), Φ(k, Λ) and Ψ(k, Λ) as Λ varies.\nThe change in κ(Λ) on integrating out wave vectors in the shell (Λ, Λ − δΛ) is\nδκ(Λ) = −\n\n1\n3π 2 κ(Λ)\n\nΛ2 Φ(Λ, Λ)δλ\n\n(6.4)\n\nIf one calculates the vertex renormalization and treats it as an addition to the\nrandom field one finds,\nik * δũ(q, Λ) + O(k2 ) = −\n\ni\n(2π)3\n\nZ\n\nΛ\n\nΛ−δΛ\n\nFij (q′ , Λ)ki qj qk′ ũk (q, Λ) ′\ndq\nκ2 (Λ)q ′2 (q + q′ )2\n\n(6.5)\n\nwhere we have only kept the vertex term to lowest order in k as it is only this term that\ncontributes to the one loop diffusivity renormalization. In addition if one assumes that\nit is the low wave number (long distance) renormalization of the velocity field which is\nimportant for the effective diffusivity one finds to lowest order in q,\n1\nqj ũk (q, Λ)\nδũi (q, Λ) ≈ −\n3\n(2π) κ2 (Λ)\n\nZ\n\nΛ\nΛ−δΛ\n\nFij (q′ Λ)qk′ ′\ndq\nq ′4\n\n(6.6)\n\nIn the case where no helicity is present we see that the vertex is not renormalized.\nHowever (as pointed out in the section on perturbation theory) whilst the helicity does\nnot contribute to the diffusivity renormalization at a one loop level it renormalizes the\nvelocity field. The renormalization is zero at order 0 in q but has an order 1 effect:\nδũi (q, Λ) ≈ −\n\n1\nǫijk qj ũi (q, Λ)Ψ(Λ, Λ)δΛ\n6π 2 κ2 (Λ)\n\n(6.7)\n\nIn real space therefore, the renormalization is of the form\nu → u + δΛβ(Λ)∇ × u.\n\n(6.8)\n\nUsing the renormalization of ũ one may compute the flow of Fij and thus Φ and Ψ to\nobtain the one loop functional RG equations:\n∂κ\n∂Λ\n∂Φ(q, Λ)\n∂Λ\n∂Ψ(q, Λ)\n∂Λ\n\n1\nΛ2 Φ(Λ, Λ)\n3π 2 κ(Λ)\n1\n= − 2 2\nΨ(q, Λ)Ψ(Λ, Λ)\n3π κ (Λ)\n1\n= − 2 2\nq 2 Φ(q, Λ)Ψ(Λ, Λ)\n3π κ (Λ)\n= −\n\nThe integration of the eqns. (6.9) is from Λ = ∞ to 0 with the initial conditions\nκ(∞) = κ0\n15\n\n(6.9)\n\n\fΦ(q, ∞) = Φ(q)\nΨ(q, ∞) = Ψ(q).\n\n(6.10)\n\nWhen there is no helicity there is no vertex renormalization at the order we are\nconsidering and therefore we may integrate the equations directly to obtain\n1\n\nκe = (κ20 + 2u20 /9) 2 .\n\n(6.11)\n\nThis agrees with the one\n√ loop perturbation result, as it should, and in the case κ0 =\n0 we find that κe = 2/3 = 0.47140 which is quantitatively not very close to the\nnumerically measured result, κe = 0.3697. However, the discrepancy is sensitive to the\nform assumed for the effective diffusion equation. In our case this is given by eqn. (6.1)\nwhich is clearly inadequate since u is not renormalized when λ = 0. An improvement\ncan only be made by including terms with higher derivatives of u. This is similar to\nparameterizing the non-helical form factor V R of eqn. (4.2.3) with a function of external\nmomenta rather than approximating it by a constant, αR , which is not renormalized.\nThis is a possible avenue of research but we have not yet followed it.\nIn contrast, for λ 6= 0, u is renormalized and the effect on κe is significant because the\nhelical form factor W R , eqn. (4.2.3) is renormalized at low wavenumber as parametrized\nby β(Λ) above. The RG equations may be integrated numerically and is compared with\nsimulation in figures 7 – 11. Although the results are not quantitatively accurate, they\ncapture the qualitative behaviour seen in the simulations. In particular, the RG predicts\nthe large enhancement as a function of λ seen in the data and also predicts the dip\nobserved in the graph of κe versus κ0 for sufficiently large λ.\nIndeed, the qualitative success of the method suggests that the difficulty in obtaining\npredictions that are more accurate might lie with the inadequacy of the simple ansatz\nwhen applied to the case when λ = 0. The effect of helicity is nevertheless well captured\nin this approach because this effect is dominated by the renormalization of β(Λ).\nA technical point in the numerical integration is that κ0 = 0 ⇒ κ(∞) = 0, and the\nevolution equations are ill-defined in the limit Λ → ∞. This problem is easily rectified\nby making κ0 very small but non-zero. The integration procedure is then well-defined\nand the results are insensitive to the exact value of κ0 in this case.\nWe therefore believe that although the renormalization procedure is not quantitatively accurate (as should be expected as it does not give very accurate results in\nthe absence of helicity), it successfully incorporates the underlying mechanism for the\nenhancement of the diffusivity by helicity at small bare molecular diffusivity.\n\n7\n\nDiscussion and Conclusions\n\nIn this paper we have studied the problem of turbulent advection of a scalar field by an\nincompressible flow with helicity λ, 0 ≤ λ ≤ 1.0, and background molecular diffusivity,\nκ0 . We have performed computer simulations of the advection for flows with properties\ndescribed in eqns. (2.1) to (2.4), and compared the long-range effective parameters\ndescribing the time evolution of the scalar field with various schemes of calculation. In\nparticular, we have concentrated on how the effective diffusivity, κe , depends on κ0 and\nλ. In earlier work we found an strong anomalous enhancement of κe as a function of\nλ for κ0 = 0.0 [4] which was unexplained theoretically, and this is the motivation for\n16\n\n\fthe present study. In that earlier work the turbulent velocity field was time dependent\nwhereas here it is not. This allows for easier calculation whilst still reproducing the\neffect.\nThe important region for discussion can be seen from the simulation data, figures\n7 – 11, to be κ0 < 0.2; for larger κ0 the molecular diffusivity begins to dominate and\nnot only is the effect of helicity suppressed but also the many schemes of calculation\ngive good approximations for κe . For λ = 0.0 we find that the two-loop self-consistent\ncalculation of κe reproduces the simulation data for all κ0 very closely indeed, as is\nseen in figure 7 and described in section 4. The other schemes also plotted are much\nless accurate in the region of interest. Ordinary perturbation theory is not convergent\nin this region and will be discussed no further. The reason why the Hartree-Fock and\n(RG) methods are less accurate is that the vertex function V (k′ , k), eqn. (4.2.3), is not\nrenormalized for low wavenumber which means that the associated coupling α is not\nrenormalized. The Hartree-Fock method at λ = 0 sums rainbow diagrams but does not\ninclude any diagrams corresponding to a vertex correction, unlike the self-consistent\ntheory. In the self-consistent theory the one-loop prediction for κ0 = 0 is κe = 1/3 and\nthe two-loop terms modify this by δκe ∼ 0.04, of which the two-loop cross diagram\nin figure 3 contributes only 10%, or δκe ∼ 0.004. In omitting similar terms to this\nlatter one the Hartree-Fock approximation should therefore not be expected to be too\ndiscrepant and this is seen to be the case. The RG calculation gives a form which\nmust yield the simple one-loop perturbation theory expression at large κ0 but allows\ncontinuation to κ0 = 0; this is given in eqn. (6.11). In the case of gradient flows the\nRG approach is remarkably successful [6] and this is attributed to the fact that in that\ncase the primitive vertex is renormalized at low wavenumber.\nThe reason for examining schemes alternative to self-consistent methods is that\nfor λ > 0 agreement between simulation data and theory is poor and it is necessary\nto investigate different approaches in order to test different hypotheses for a simple\ndescription of the observed anomalous effect.\nFor κ0 > 0.2 all schemes except ordinary perturbation theory begin to show reasonable agreement with the data, and for κ0 > 0.5 all schemes clearly reproduce the\nresults. We concentrate on results for κ0 < 0.2 and the anomalous enhancement of κe\nby helicity in this region is seen in figure 10 where κe is plotted against λ for κ0 = 0,\nand is characterized by a rapid rise in κe for λ > 0.2 . An alternative aspect is seen\nin figure 9 where κe is plotted against κ0 for λ = 1.0. The significant dip at κ0 = 0.2\nis due to the large effect of helicity on κe smaller κ0 compared with the much reduced\neffect at κ0 ∼ 0.2. It has proved very difficult to convincingly explain these features.\nHowever, we have been able to suggest mechanisms which show the presence of helicity\nin the flow can produce a large change in κe from the non-helical value, and even though\nthese have not yet yielded quantitative predictions they do point towards a reasonable\nexplanation.\nThe basic idea is to recognize that the effective equation governing the advection\nshould contain terms not present in the original equation. The terms can be thought\nof as being induced in the low-wavenumber effective theory by integrating out higher\nwavenumbers. This may also be viewed as the renormalization of the related vertex\nfunctions of the theory corresponding to a selective resummation of diagrams. In our\napproach we have assumed that a low-wavenumber approximation will be valid and so\n17\n\n\fsuch terms will contain the minimum number of derivatives. These ideas can be implemented in different ways and we tried self-consistent, Hartree-Fock and renormalization\ngroup approaches. The self-consistent and Hartree-Fock methods are based on the effective evolution equation (4.2.1) which corresponds to a low-wavenumber enhancement\nof the flow velocity uR = u + βR ω, where ω is the vorticity. We performed a two-loop\ncalculation self-consistent in both κe and βR as described in eqn. (4.2.19) and figure 5.\nThe results show that a strong enhancement in κe is predicted but that the magnitude\nfor λ = 1.0, κ0 = 0.0 is too small and the form of the dependence of κe on λ disagrees\nwith the data. This is particularly true at small λ for κ0 = 0.0 where from figure 10 we\nsee that κe is only weakly dependent on λ, λ < 0.3 whereas we predict κe ∼ a + bλp\nfor fractional p: the one-loop result is p = 2/3.\nThe Hartree-Fock method, shown diagramatically in figure 6, computes the complete propagator in terms of Ω(k2 ) (eqn. (4.2.4)) as a sum of the rainbow diagrams\ngenerated from the effective equation (4.2.1) with βR given by the one-loop result\nβR = −B1 (βR )/κ2e where B1 (βR ) is given in eqn. (4.2.15) and κe = κ0 + Ω(0). A rise\nin κe with λ is predicted but not one big enough to agree with the data. However, the\nbehaviour at small λ is a much slower rise which is more in keeping with the data than\nthe self-consistent prediction in this region.\nThe renormalization group method is a different approach in that it considers a\nrunning diffusivity κ(Λ) and velocity field u(x, Λ) which satisfy κ(∞) = κ0 , κ(0) =\nκe , u(x, Λ) = u(x). There are three coupled RG flow equations, (6.9), for κ(Λ) and the\ntwo running spectral functions Φ(q, Λ), Ψ(q, Λ) which correspond to the definitions in\neqn. (6.3). The important feature of the RG flow equations is that κ(Λ) appears in the\ndenominators. The numerators are suppressed at large Λ by the spectral functions and\nso the major contribution is from intermediate values of Λ: Λ ∼ k0 . This contribution\nis strongly enhanced for small κ0 and results in the prediction of the dip structure\nobserved in the data but not predicted by the other methods.\n¿From our investigation we must expect that a proper explanation of the observed\neffects will require the correct effective equation and the consequent generation of new\nvertices but that unlike the λ = 0 case the low-wavenumber approximation will be\ninsufficient since although an enhancement is predicted for λ 6= 0 the rapid rise is not\nreproduced and no dip is observed. The RG method suggests that the main contribution\nis from wavenumbers k ∼ k0 supporting this latter conclusion. A successful approach\nshould therefore include more terms in the effective flow equation in combination with\nan RG approach. The challenge is to obtain accurate results for all λ including λ = 0\nby such a technique. Work in this direction is currently underway.\n\nReferences\n[1] R.H. Kraichnan. Phys. Fluids, 13:22, 1970.\n[2] R.H. Kraichnan. J. Fluid Mech., 77:753, 1976.\n[3] R.H. Kraichnan. J. Fluid Mech., 81:385, 1977.\n[4] I.T. Drummond, S Duane, and R.R. Horgan. Nucl. Phys., B220:119, 1983.\n\n18\n\n\f[5] I.T. Drummond and R.R. Horgan. Phys. Lett., B321:246–253, 1994.\n[6] D.S. Dean, I.T. Drummond, and R.R. Horgan. J. Phys:A: Math Gen, 27:5135–5144,\n1994.\n[7] D.S. Dean, I.T. Drummond, and R.R. Horgan. J. Phys:A: Math Gen, 28:1235–1242,\n1995.\n[8] R. Phythian and W.D. Curtis. J. Fluid Mech., 89:241, 1978.\n[9] I.T. Drummond, S Duane, and R.R. Horgan. J. Fluid Mech., 138:75–91, 1984.\n\n19\n\n\fq\n\nq\n\nk′\n\nk\n\nk′\n\nk\n\nV\n\nW\n\n(a)\n\n(b)\n\nq\n\nq\n\nq\n\n=\n\n+\n\nk′\n\nk\n\nα0\n\nk\n\nk′\n\nk\n\nβ0\n\nk′\n\nU0\n(c)\n\nk\n\nR\n\nq\n\n≈\n\nq\n\nk′\n\nq\n\n+\nαR\n\nk\n\nk′\n\nk\n\nβR\n\nk′\n\nUR\n(d)\nFigure 1: The vertices occurring in the perturbation schemes: (a) the primitive velocity field\nvertex; (b) the primitive vorticity vertex; (c) the bare complete vertex of the effective diffusion\nequation; (d) the renormalized complete vertex approximated as a sum of renormalized vertices\nassociated with the velocity field and the vorticity.\n\n20\n\n\fq\n\nk\n\n=\n\nΣ (k)\n\n+\n\nk-q\n\nk\n\nq\nq\n\nq′\n\nk\n\nk-q\n\nk-q-q′\n\nk-q\n\n+\n\nk\n\nk-q\n\nq′\n\nk-q-q′\n\nk-q′\n\nFigure 2: The graphs that contribute to two-loop simple perturbation theory for G̃(k).\n\n×\n\n×\n\nFigure 3: The perturbation expansion to two-loops of the self-consistent relation for κe\n\n21\n\n\fq\nk\n\nβR\n\nαR\n\nk′\n\nαR\nq′\nFigure 4: An example of the kind of vertex graph that must be evaluated in the solution of\nequations shown in figure 5 once the approximation for UR given in eqn. (4.2.5) and shown in\nfigure 1 has been used. This graph is labelled Tβαα .\n\n22\n\n\f×\n\nΩ (k) k\n\nR\n\nR\n\nR\n\n×\n\nR\n\n2\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nk′\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\n×\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nR\n\nFigure 5: The perturbation expansion to two-loops of the general self-consistent condition relating the self-energy, Σ(k), and vertex, UR (k, k′ ), functions. The vertex function is represented\nby the circle with inset 'R', full Green function, G̃(k), by the filled box and ∆U = UR − U0 .\n\n23\n\n\f- Ω(k) k\n\n2\n\nR\n\n+\n\nR\n\nR\n\nR\n\nR\n\nFigure 6: The integral Hartree-Fock equations for Ω(k) and UR in terms of the general vertices\nU0 and UR . The full Green function, G̃(k), is denoted by the filled box. The equation for\nΩ(k) is correct to all loop orders but the equation for UR is correct to one-loop order only.\n\n24\n\n\fλ=0.0\n1.00\n0.90\n\neffective diffusivity κe\n\n0.80\n0.70\n0.60\n0.50\n0.40\n0.30\n0.20\n0.0\n\n0.2\n\n0.4\nbare diffusivity κ0\n\n0.6\n\n0.8\n\nFigure 7: κe versus κ0 for fixed helicity λ = 0.0. The simulation data are shown ( ❞) to\nbe compared with the predictions of two-loop self-consistent perturbation theory (solid), the\nHartree-Fock calculation (long-dashed), the renormalization group (dashed) and ordinary perturbation theory (dot-dashed)\n\n25\n\n\fλ=0.4\n0.90\n\neffective diffusivity κe\n\n0.80\n\n0.70\n\n0.60\n\n0.50\n\n0.40\n\n0.30\n0.0\n\n0.2\n\n0.4\nbare diffusivity κ0\n\n0.6\n\n0.8\n\nFigure 8: κe versus κ0 for fixed helicity λ = 0.4. The simulation data are shown ( ❞) to\nbe compared with the predictions of two-loop self-consistent perturbation theory in κe (solid)\nand in κe , β (dotted), the Hartree-Fock calculation (long-dashed), the renormalization group\n(dashed), and ordinary perturbation theory (dot-dashed)\n\n26\n\n\fλ=1.0\n0.90\n\neffective diffusivity κe\n\n0.80\n\n0.70\n\n0.60\n\n0.50\n\n0.40\n\n0.30\n0.0\n\n0.2\n\n0.4\nbare diffusivity κ0\n\n0.6\n\n0.8\n\nFigure 9: κe versus κ0 for fixed helicity λ = 1.0. The simulation data are shown ( ❞) to\nbe compared with the predictions of two-loop self-consistent perturbation theory in κe (solid)\nand in κe , β (dotted), the Hartree-Fock calculation (long-dashed), the renormalization group\n(dashed), and ordinary perturbation theory (dot-dashed)\n\n27\n\n\fκ0=0.0\n0.90\n\neffective diffusivity κe\n\n0.80\n\n0.70\n\n0.60\n\n0.50\n\n0.40\n\n0.30\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nhelicity λ\n\nFigure 10: κe versus λ for fixed diffusivity κ0 = 0.0. The simulation data are shown ( ❞) to\nbe compared with the predictions of two-loop self-consistent perturbation theory in κe (solid)\nand in κe , β (dotted), the Hartree-Fock calculation (long-dashed), the renormalization group\n(dashed)\n\n28\n\n\fκ0=0.2\n\neffective diffusivity κe\n\n0.65\n\n0.60\n\n0.55\n\n0.50\n\n0.45\n\n0.40\n0.0\n\n0.5\nhelicity λ\n\n1.0\n\nFigure 11: κe versus λ for fixed diffusivity κ0 = 0.2. The simulation data are shown ( ❞) to\nbe compared with the predictions of two-loop self-consistent perturbation theory in κe (solid)\nand in κe , β (dotted), the Hartree-Fock calculation (long-dashed), the renormalization group\n(dashed)\n\n29\n\n\f"}