{"id": "http://arxiv.org/abs/cond-mat/0207633v1", "guidislink": true, "updated": "2002-07-26T10:33:16Z", "updated_parsed": [2002, 7, 26, 10, 33, 16, 4, 207, 0], "published": "2002-07-26T10:33:16Z", "published_parsed": [2002, 7, 26, 10, 33, 16, 4, 207, 0], "title": "Anomalous Transport in Conical Granular Piles", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0207042%2Ccond-mat%2F0207229%2Ccond-mat%2F0207461%2Ccond-mat%2F0207304%2Ccond-mat%2F0207521%2Ccond-mat%2F0207113%2Ccond-mat%2F0207642%2Ccond-mat%2F0207723%2Ccond-mat%2F0207114%2Ccond-mat%2F0207299%2Ccond-mat%2F0207741%2Ccond-mat%2F0207402%2Ccond-mat%2F0207019%2Ccond-mat%2F0207640%2Ccond-mat%2F0207104%2Ccond-mat%2F0207514%2Ccond-mat%2F0207510%2Ccond-mat%2F0207314%2Ccond-mat%2F0207586%2Ccond-mat%2F0207459%2Ccond-mat%2F0207540%2Ccond-mat%2F0207307%2Ccond-mat%2F0207542%2Ccond-mat%2F0207482%2Ccond-mat%2F0207658%2Ccond-mat%2F0207656%2Ccond-mat%2F0207484%2Ccond-mat%2F0207426%2Ccond-mat%2F0207433%2Ccond-mat%2F0207309%2Ccond-mat%2F0207668%2Ccond-mat%2F0207032%2Ccond-mat%2F0207606%2Ccond-mat%2F0207007%2Ccond-mat%2F0207031%2Ccond-mat%2F0207372%2Ccond-mat%2F0207355%2Ccond-mat%2F0207074%2Ccond-mat%2F0207635%2Ccond-mat%2F0207345%2Ccond-mat%2F0207249%2Ccond-mat%2F0207347%2Ccond-mat%2F0207424%2Ccond-mat%2F0207278%2Ccond-mat%2F0207255%2Ccond-mat%2F0207263%2Ccond-mat%2F0207145%2Ccond-mat%2F0207616%2Ccond-mat%2F0207322%2Ccond-mat%2F0207150%2Ccond-mat%2F0207146%2Ccond-mat%2F0207633%2Ccond-mat%2F0207400%2Ccond-mat%2F0207275%2Ccond-mat%2F0207265%2Ccond-mat%2F0207456%2Ccond-mat%2F0207483%2Ccond-mat%2F0207679%2Ccond-mat%2F0207297%2Ccond-mat%2F0207607%2Ccond-mat%2F0207101%2Ccond-mat%2F0207365%2Ccond-mat%2F0207596%2Ccond-mat%2F0207167%2Ccond-mat%2F0207396%2Ccond-mat%2F0207300%2Ccond-mat%2F0207179%2Ccond-mat%2F0207099%2Ccond-mat%2F0207634%2Ccond-mat%2F0207302%2Ccond-mat%2F0207271%2Ccond-mat%2F0207369%2Ccond-mat%2F0207059%2Ccond-mat%2F0207210%2Ccond-mat%2F0207732%2Ccond-mat%2F0207261%2Ccond-mat%2F0207203%2Ccond-mat%2F0207235%2Ccond-mat%2F0207583%2Ccond-mat%2F0207158%2Ccond-mat%2F0207523%2Ccond-mat%2F0207317%2Ccond-mat%2F0207212%2Ccond-mat%2F0207219%2Ccond-mat%2F0207643%2Ccond-mat%2F0207564%2Ccond-mat%2F0207520%2Ccond-mat%2F0207124%2Ccond-mat%2F0207138%2Ccond-mat%2F0207604%2Ccond-mat%2F0207734%2Ccond-mat%2F0207251%2Ccond-mat%2F0207467%2Ccond-mat%2F0207080%2Ccond-mat%2F0207292%2Ccond-mat%2F0207392%2Ccond-mat%2F0207490%2Ccond-mat%2F0207489%2Ccond-mat%2F0207152%2Ccond-mat%2F0207364%2Ccond-mat%2F0207035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Anomalous Transport in Conical Granular Piles"}, "summary": "Experiments on 2+1-dimensional piles of elongated particles are performed.\nComparison with previous experiments in 1+1 dimensions shows that the addition\nof one extra dimension to the dynamics changes completely the avalanche\nproperties, appearing a characteristic avalanche size. Nevertheless, the time\nsingle grains need to cross the whole pile varies smoothly between several\norders of magnitude, from a few seconds to more than 100 hours. This behavior\nis described by a power-law distribution, signaling the existence of scale\ninvariance in the transport process.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0207042%2Ccond-mat%2F0207229%2Ccond-mat%2F0207461%2Ccond-mat%2F0207304%2Ccond-mat%2F0207521%2Ccond-mat%2F0207113%2Ccond-mat%2F0207642%2Ccond-mat%2F0207723%2Ccond-mat%2F0207114%2Ccond-mat%2F0207299%2Ccond-mat%2F0207741%2Ccond-mat%2F0207402%2Ccond-mat%2F0207019%2Ccond-mat%2F0207640%2Ccond-mat%2F0207104%2Ccond-mat%2F0207514%2Ccond-mat%2F0207510%2Ccond-mat%2F0207314%2Ccond-mat%2F0207586%2Ccond-mat%2F0207459%2Ccond-mat%2F0207540%2Ccond-mat%2F0207307%2Ccond-mat%2F0207542%2Ccond-mat%2F0207482%2Ccond-mat%2F0207658%2Ccond-mat%2F0207656%2Ccond-mat%2F0207484%2Ccond-mat%2F0207426%2Ccond-mat%2F0207433%2Ccond-mat%2F0207309%2Ccond-mat%2F0207668%2Ccond-mat%2F0207032%2Ccond-mat%2F0207606%2Ccond-mat%2F0207007%2Ccond-mat%2F0207031%2Ccond-mat%2F0207372%2Ccond-mat%2F0207355%2Ccond-mat%2F0207074%2Ccond-mat%2F0207635%2Ccond-mat%2F0207345%2Ccond-mat%2F0207249%2Ccond-mat%2F0207347%2Ccond-mat%2F0207424%2Ccond-mat%2F0207278%2Ccond-mat%2F0207255%2Ccond-mat%2F0207263%2Ccond-mat%2F0207145%2Ccond-mat%2F0207616%2Ccond-mat%2F0207322%2Ccond-mat%2F0207150%2Ccond-mat%2F0207146%2Ccond-mat%2F0207633%2Ccond-mat%2F0207400%2Ccond-mat%2F0207275%2Ccond-mat%2F0207265%2Ccond-mat%2F0207456%2Ccond-mat%2F0207483%2Ccond-mat%2F0207679%2Ccond-mat%2F0207297%2Ccond-mat%2F0207607%2Ccond-mat%2F0207101%2Ccond-mat%2F0207365%2Ccond-mat%2F0207596%2Ccond-mat%2F0207167%2Ccond-mat%2F0207396%2Ccond-mat%2F0207300%2Ccond-mat%2F0207179%2Ccond-mat%2F0207099%2Ccond-mat%2F0207634%2Ccond-mat%2F0207302%2Ccond-mat%2F0207271%2Ccond-mat%2F0207369%2Ccond-mat%2F0207059%2Ccond-mat%2F0207210%2Ccond-mat%2F0207732%2Ccond-mat%2F0207261%2Ccond-mat%2F0207203%2Ccond-mat%2F0207235%2Ccond-mat%2F0207583%2Ccond-mat%2F0207158%2Ccond-mat%2F0207523%2Ccond-mat%2F0207317%2Ccond-mat%2F0207212%2Ccond-mat%2F0207219%2Ccond-mat%2F0207643%2Ccond-mat%2F0207564%2Ccond-mat%2F0207520%2Ccond-mat%2F0207124%2Ccond-mat%2F0207138%2Ccond-mat%2F0207604%2Ccond-mat%2F0207734%2Ccond-mat%2F0207251%2Ccond-mat%2F0207467%2Ccond-mat%2F0207080%2Ccond-mat%2F0207292%2Ccond-mat%2F0207392%2Ccond-mat%2F0207490%2Ccond-mat%2F0207489%2Ccond-mat%2F0207152%2Ccond-mat%2F0207364%2Ccond-mat%2F0207035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Experiments on 2+1-dimensional piles of elongated particles are performed.\nComparison with previous experiments in 1+1 dimensions shows that the addition\nof one extra dimension to the dynamics changes completely the avalanche\nproperties, appearing a characteristic avalanche size. Nevertheless, the time\nsingle grains need to cross the whole pile varies smoothly between several\norders of magnitude, from a few seconds to more than 100 hours. This behavior\nis described by a power-law distribution, signaling the existence of scale\ninvariance in the transport process."}, "authors": ["Peter Ahlgren", "Mikkel Avlund", "Ib Klewe", "Jonas Nyvold Pedersen", "Alvaro Corral"], "author_detail": {"name": "Alvaro Corral"}, "author": "Alvaro Corral", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.66.031305", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0207633v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0207633v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted in PRE", "arxiv_primary_category": {"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0207633v1", "affiliation": "Niels Bohr Institute", "arxiv_url": "http://arxiv.org/abs/cond-mat/0207633v1", "journal_reference": "Phys. Rev. E 66, 031305 (2002)", "doi": "10.1103/PhysRevE.66.031305", "fulltext": "Anomalous Transport in Conical Granular Piles. Accepted in PRE\n\n1\n\nAnomalous Transport in Conical Granular Piles\nPeter Ahlgren1∗ , Mikkel Avlund1∗ , Ib Klewe1∗ , Jonas Nyvold Pedersen1∗ , and Álvaro Corral1,2∗∗\n1\n\narXiv:cond-mat/0207633v1 26 Jul 2002\n\n2\n\nThe Niels Bohr Institute, University of Copenhagen, Blegdamsvej 17, DK-2100 Copenhagen Ø, Denmark\nDepartament de Fı́sica, Universitat Autònoma de Barcelona, Edifici Cc, E-08193 Bellaterra, Barcelona, Spain\n(Accepted in PRE 15 July 2002; published ???)\n\nExperiments on 2 + 1-dimensional piles of elongated particles are performed. Comparison with\nprevious experiments in 1 + 1 dimensions shows that the addition of one extra dimension to the\ndynamics changes completely the avalanche properties, appearing a characteristic avalanche size.\nNevertheless, the time single grains need to cross the whole pile varies smoothly between several\norders of magnitude, from a few seconds to more than 100 hours. This behavior is described by a\npower-law distribution, signaling the existence of scale invariance in the transport process.\nPACS numbers: 45.70.Ht, 64.60.Ht, 05.60.Cd, 05.65.+b\n\nI. INTRODUCTION.\n\nTransport phenomena are found at the core of almost\nevery discipline in many-body physics; for example in\nnuclear physics, with the motion of neutrons through a\nfissionable material; in electronics, with the transport of\nholes and electrons in semiconductors; in astrophysics,\nwith the diffusion of light through stellar atmospheres;\nand also in plasma physics, biological physics, etc. [1].\nThe study of granular matter (like sand, powders, and\nall that) has only very recently become a goal for the\nphysics community (surprisingly, see Ref. [2]) and therefore the understanding of their transport properties will\nbe required in order to explain the (sometimes-strange)\nproperties of these materials [3,4].\nSeminal experimental work on transport of individual\ngrains through a granular pile was performed by Christensen et al. [5]: a 1 + 1-dimensional pile was built in\nthe narrow gap between two parallel plates using elongated rice grains. The time taken by tracer grains to\ncross the system was measured when the pile was driven\nout of equilibrium by a constant addition of grains. The\nprobability density of these transit times turned out to\nbe, for long times, a decreasing power law with an exponent α ≈ 2.4, signaling the existence of an anomalous\n(non-Gaussian) behavior. By means of some theoretical\nmodels the transport process was later microscopically\nunderstood as a composition of Lévy flights (in the jumps\nof the grains during an avalanche) and also power-law\ndistributed trapping times [6].\nOn the other hand, the same rice pile was previously\nshown to display self-organized criticality (SOC) due to\nthe dissipation introduced in the motion by the elongated\nshape of the grains, which removes inertial effects [7].\nThis SOC behavior simply means that the motion of the\ngrains takes place in terms of avalanches, and the distribution of sizes of these avalanches is scale invariant, that\nis, another power law, achieved without any parameter\nfine tuning [8]. Interestingly, SOC does not appear when\n\nthe grains are somewhat round, and therefore more free\nto roll and accumulate kinetic energy [7].\nAdditionally, other remarkable properties of this ricepile system include diverging profile fluctuations with\nsystem size [9], and probably a multifractal spectrum\nof the transit-time time series [10]. More generically, a\npile configuration allows to study the transition between\ndifferent metastable configurations of a granular system,\nwhich occurs when a solid phase becomes unstable and\nflows like a liquid until it becomes \"frozen\" again.\nAnother class of experiments, performed on sandpiles\n(or with round particles, in general) in 2 + 1 dimensions\nshow that in these systems a crossover from small to\nlarge avalanches occurs when the system size is increased\n[11,12,13]; that is, small piles tend to show avalanches\nof different sizes, although not very large, but for a big\nenough system very large avalanches appear in addition,\na behavior that is not compatible with SOC [14]. This\nis in agreement with a different type of experiments performed on rotating drums [15,16].\nThe extension of rice-pile experiments to 2 + 1 dimensions, which is the subject of our research, allows\na comparison with the results for sandpiles and raises\na series of interesting questions: will the dissipation of\nthe elongated grain motion be enough to suppress inertia and give SOC? If not, which is then the behavior?\nBut even more important, our experiments allow to explore the transport of individual grains in granular piles,\nand in general to go deeply into the connection between\nanomalous transport and SOC, a connection that has\nnot been explored in detail. We find that the behavior\nof the avalanches in a conical rice pile (with elongated\ngrains) is very similar to what has been observed in conical sandpiles [11], with somewhat small avalanches for\nsmall piles and large relaxation oscillations in larger systems. However, the transport properties give totally new\ninformation, with a power-law transit-time distribution\neven in the later case of almost periodic occurrences.\n\n\fAnomalous Transport in Conical Granular Piles. Accepted in PRE\nII. EXPERIMENTAL SETUP AND\nPROCEDURE.\n\nThe rice pile was built over a wooden (circular) disk\nsupported by a platform which allowed the grains falling\nout in any direction when they reached the disk perimeter. Three different disk diameters were employed, L =\n10, 15, and 20 cm, in order to study the effect of the system size. In terms of the mean grain length (6.6 mm, see\nbelow) this quantity turns out to be L = 15, 22.5, and\n30.\nThe driving of the pile was carried out by means of a\nsingle-seed machine connected to a DC motor through a\ngearbox. The driving rate was adjusted with a voltage\ntransformer to a value of 43 grains per minute (2 ± 0.4\ngrains every 2.8 seconds); this rate is small enough to\nbe considered as a zero driving rate for the system sizes\nstudied (see Ref. [17]) but also allows to conclude the\nexperiment in a finite time. After being expelled from\nthe machine the grains were directed by a cardboard pipe\ntowards a funnel where at the exit a paper tongue braked\nthe grains and dropped them over the center of the disk\nwith few kinetic energy. Once the pile was built, the\ndistance from the exit of the funnel to the top of the pile\nwas just a few centimeters.\nIn addition to the described driving procedure, when\nthe pile reached a (statistical) stationary state –where the\ninjected grains were balanced out on average by the coming out grains– tracer grains were added to the top of the\npile by hand at a rate of 1 grain every 30 seconds for the\ntwo smallest piles and 1 grain every minute for the largest\none [18]. These tracer grains were used to compute the\ntransit time, which is the time a grain remains in the\npile, since it is added until it comes out. Tracers were\nmarked by a number written on the surface, and were\nalso colored in order to be visually distinguished from\nthe rest of the grains. The addition of each tracer was\ndone at a fixed input time Tin (determined by the tracer\ndriving rate), being only necessary then to record the output time Tout to get the transit time as T = Tout − Tin .\nThe total number of injected tracers was about 500 for\nL = 15 and L = 22.5 and 700 for L = 30. After the end\nof the tracer injection, the experiment and therefore the\nnormal driving of the pile should continue until all tracers come out; however, for practical reasons this could\nnot be achieved and the experiment was stopped when a\nfew tracers were still inside the pile, after more than 100\nhours. The elimination of these long-living tracers affects\nthe direct calculation of the mean transit time, but not\nthe whole probability distribution, which is a much more\ninteresting quantity, as we will see.\nIn practise, the grains coming out from the pile were\ncollected by a piece of cardboard and directed at a glass,\nwhere the colored tracers were easily recognized by the\nnaked eye. It was then when the output time was\n\n2\n\nrecorded, and the glass replaced by another one. Moreover, note that the grains collected in the glass after an\navalanche can give a measure of the avalanche size (of\ncourse for those avalanches that reach the boundaries).\nDuring the addition of the tracers three persons were\nneeded to perform the described tasks, but as long as\nthe number of tracers inside the pile decreases these demands diminish too.\nThe rice used in all the experiments was \"Løse parboiled ris\" from Føtex (Denmark). The shape of these\ngrains is elongated, similar to the one of Refs. [7,5], with\na length of 6.6 ± 0.9 mm and a width of 1.6 ± 0.6 mm,\nwhich gives a length-width ratio of about 4. The mean\nweight of the grains is 16.9 mg.\nIII. EXPERIMENTAL RESULTS.\n\nThe first observation provided by the experiment is a\nqualitatively one: as in sandpiles, the size of the system\ninfluences dramatically the behavior. Small piles (L = 15\nand 22.5) do not change very much their profile during\ntime evolution once the pile is built (the total heigh varies\nin about 1 cm) and do not display big avalanches either.\nIn contrast, the big pile (L = 30) shows enormous, catastrophic avalanches, which eject a significative percentage\nof the grains out of the pile and therefore change totally\nthe profile. In the time interval in between these enormous avalanches there are also small avalanches. Actually, this is a similar behavior to what was observed\nin sandpiles (with round particles) [11]. Therefore, the\nelongation of the rice grains (which was identified as the\nresponsible for SOC in 1 + 1-d [7]) does not make dissipate enough energy in three dimensions to give SOC. The\naddition of one extra degree of freedom to the motion of\nthe grains modifies totally the behavior, in comparison.\nTo explain the transition in sandpiles when the size of\nthe system is increased, a simple argument was proposed\nbased on the fact that for small piles there is \"no room\"\nfor the two angles involved in the dynamics (one for the\nstarting of the avalanche and another one for the end)\n[16]. We find that the situation is not so easy, due to\nthe somewhat rough surface of the pile; indeed, the elongation of the grains gives rise to local bumps of packed\ngrains which provoke fluctuations of the total height of\nthe pile. Moreover, in the regime with large avalanches\nthe measurement of the angle of repose –the angle after an avalanche– makes little sense, since then a large\npart of the pile has collapsed (like the crater of a volcano)\nand the conical shape is lost. Rotating-drum experiments\ncould perhaps give more information on this point.\nThe total mass of dropped grains and the occurrence\ntime of these catastrophic avalanches (in the big pile) was\nmeasured. In all cases the number of dropping grains was\nin between about 3000 and 7000, with a mean value of\n4600 and a standard deviation of 1100. For comparison,\n\n\f3\n\nAnomalous Transport in Conical Granular Piles. Accepted in PRE\nthe largest avalanches in the small piles dropped only\nabout 20 or 30 grains, roughly the same value as the\nlargest small avalanches in the big pile. The mean time\nbetween big avalanches was 7700 grains (3 hours) with a\ndeviation of 2200. The difference with respect the mean\nnumber of dropping grains in big avalanches (4600) corresponds of course to grains coming out in small avalanches.\n\n10000\n\n8000\n\ngiven by the length of the horizontal lines. First, it is\nclear the difference between small and big systems, in\nterms of the number of coincidences in the output times\n(related to the avalanche size). Moreover, although comparison with Christensen et al.'s results [5] is not direct\n(tracer density is lower there), it is possible to see that\ntheir Fig. 2 settles in between our two behaviors. Second,\none can observe the great variability of the transit times,\nbroadly distributed from few seconds to more than 100\nhours (this last value, not shown in the plot, is in fact a\nlower bound for the maximum transit time, determined\nby the duration of the experiment).\n\n6000\n\n0:1\n4000\n\n0\n\n5000 10000 15000 20000 25000 30000 35000 40000\n\nD (T ; L)\n\n0\n\n10 5\n\n10\n\n8\n\n6000\n\n(a)\n1\n\n10\n\n100\nT\n\n4000\n\n1000\n\n105\n\n10000\n\n106\n\n(in grain units)\n\n1000\n\n0\n\n5000 10000 15000 20000 25000 30000 35000 40000\n\n20000\n\n= 15\n= 22:5\n\nL\n\n100\n\n2000\n\n0\n\n=T\n\n0:0001\n\n10 7\n\n8000\n\nL D (T ; L)\n\n(in added grain units)\n\n/1\n\n10 6\n\n10000\n\nTin\n\nL\n\n0:001\n\n2000\n\n= 15\n= 22:5\n\nL\n\n0:01\n\nL\n\n10\n1\n0:1\n0:01\n\n15000\n\n(b)\n\n0:001\n0:0001\n0:0001\n\n10000\n\n0:001\n\n0:01\nT =L\n\n0:1\n\n10\n\n100\n\n0:1\n\n5000\n\nL\n\n/1\n\n0:01\n0\n\n5000 10000 15000 20000 25000 30000 35000 40000\nTin ; Tout\n\n(in added grain units)\n\nFIG. 1. Sequence of input and output times for different\ntracers and the three system sizes studied, L = 15, 22.5, and\n30, from top to bottom. Different tracers are represented by\ndifferent lines, the starting point is the input time, the end is\nthe output time, and the transit time is represented by the\nlength. Zero time corresponds to the starting of the tracer\ninjection. Time units are set by the driving rate, the window\nshown in the x-axis corresponding to 15.5 hours. Notice that\nfor the big pile 1 out of 44 grains is a tracer, whereas for the\nother two the proportion of tracers is double (2 out of 45);\ntherefore the plots understimate the difference between both\nbehaviors.\n\nLet us address now the problem of the transport inside the system. Part of the data for the input times\nand their corresponding output times for the three experiments are shown in Fig. 1, where transit times are\n\n= 30\n\n=T\n\n2=3\n\n0:001\nD (T ; L)\n\n0\n\n1\n\n\u0017 (in grain units)\n\n0:0001\n10 5\n10 6\n10 7\n10\n\n( )\n\n8\n\n1\n\n10\n\n100\nT\n\n1000\n\n10000\n\n105\n\n106\n\n(in grain units)\n\nFIG. 2. Probability densities corresponding to the transit\ntimes for the system sizes studied, calculated over exponentially increasing intervals of size bn . As usual, time is measured in terms of added grains, and L in terms of grain length.\nTimes smaller than 3 seconds are not included. (a) The two\nsmallest piles, using b = 2.5. The straight line is a decreasing power law with exponent 1. (b) Finite size scaling of the\nprevious distributions, with b = 2 now. (c) The big pile, with\nb = 2.5 again. A power law with exponent 2/3 is also shown.\n\n\fAnomalous Transport in Conical Granular Piles. Accepted in PRE\nFigure 2 displays the probability densities of the transit times measured for each pile. It is apparent once\nmore the difference between the two smallest piles and\nthe big one. In the first case (Fig. 2(a)) we obtain a\npower-law distribution of transit times with an exponent\nclose to one, i.e., D(T, L) ∝ 1/T α, with α ≈ 1, ranging\nfrom tens of seconds to tens of hours, over more than 3\ndecades. This is a signature of anomalous diffusion and\ndispersive transport, and it has been widely studied in\namorphous semiconductors, glasses, and many other disordered materials [19].\nThis self-similar behavior is limited by a sharper cutoff\nfor long times, which increases with system size. Finite\nsize scaling, shown in Fig. 2(b) ratifies this, giving the\nrelation D(T, L) = L−β f (T /Lν ) between the distributions for different sizes of the system. The data collapse\ngives for the exponents β ≈ ν ≈ 3.3 ± 0.5, in agreement\nwith a well known scaling relation (obtained from the\nnormalization condition), β = ν if α ≤ 1. Also, from\nthese relations it is easy to obtain that the mean transit\ntime scales as hT (L)i ∝ Lν , which is a very fast increase.\nThis procedure is more practical than direct calculation\nof hT i, since it can be used when data for some extreme\nevents are unavailable, as we have for very deeply buried\ntracers. Notice also that a generalization of the argument of Ref. [5] would give an active zone increasing as\nLν−2 , so, even in the regime of small avalanches there is\nan active zone that increases with system size.\nHowever, further increments on the size L break completely this behavior and the previous scaling relations\nare no longer valid. Indeed, for the big pile we enter into\nthe regime of large relaxation avalanches and the transport properties consequently change. As we see in Fig.\n2(c) the transit time distribution becomes even broader,\nas it decays more slowly. A decreasing power law with exponent 2/3 is shown for comparison, although the statistics is not so good as for the small piles, due to the extremely slow decay. We find particularly relevant that\ndespite of the almost periodic ticking of the pile, there is\nno characteristic scale for the transit times.\n\nIV. CONCLUSIONS AND PERSPECTIVES.\n\nAs we have seen, three-dimensional piles of elongated\nparticles behave essentially as piles of round particles in\n3d, rather than as 1+1-dimensional rice piles. Therefore,\nthe transport properties we have found should apply to\nany sandpile in 3d [11,12]. It is an open question if with\nan even more dissipative particle shape, piles in 3d would\ngive scale invariance in the distribution of avalanches.\nIn fact we believe that the use of particles with several\n\"arms\", like crosses or 3d crosses, or some kind of sticky\nparticles, would brake the tendency to roll and the results\n–if this kind of particles could be experimentally handled\nwith success– would be closer to SOC.\n\n4\n\nHowever, although we do not see indication of SOC\nin the distribution of avalanches, we find that the transit time of the grains is power-law distributed, signaling\nthe existence of a scale-free behavior, as in the 1 + 1 dimensional SOC rice pile of Refs. [7,5]. Nevertheless it is\nworth mentioning that the type of distributions that we\nfind are much broader (in the sense that the exponent α\nis much smaller) than those of the 1 + 1-d case.\nBig piles, that is, those in the relaxation-oscillation\nregime, demmand a more intensive study. Notice that\nwe have studied the smallest of these big piles, just above\nthe transition, but we have found enormous transit times\nwhich provoke serious inconveniences in the experimental realization. Indeed, the fact that the transit time\ndistribution decays more slowly than for the small piles,\ngives a larger number of tracers in the tail of the distribution, which corresponds to long-living particles. This\neffect increases dramatically with system size; therefore,\nmuch better statistics is necessary for the elucidation of\nthe characteristics of the transport process. We are talking about of tens of thousands of tracers, which requires\na different procedure than our hand addition and visual\ncontrol, so man-time consuming. In consequence, automatization of the tracer recognition process would be\nhighly desiderable.\nFinally, none of the sandpile models we know so far is\nable to reproduce these results; accordingly, it would be\nof the maximum interest to develop models that allow\nthe necessary interplay between theory and experiment\nto overcome our present knowledge of these media.\nV. ACKNOWLEDGEMENTS.\n\nThe experiment was designed and performed by the\nfirst four authors as first-year undergraduate students\nof the University of Copenhagen, for a project for the\ncourse Fysik I with the assistance of the last author.\nThe realization was possible thanks to the enthusiastic\nsupport of Anders Holm. A.C. is indebted to the Cooperative Phenomena Group of the University of Oslo,\nwhere he was introduced into the wonderful world of ricepile experiments, and also to Per Bak, the ultimate father of all this. A.C.'s contribution was first financed\nby the TMR network on Fractal Structures and SelfOrganization through the EU-grant FMRX-CT98-0183.\nNowadays, he is happy to thank Santiago Ramón y Cajal\nprogram to help Spanish young scientists.\n\n∗\n∗∗\n\nWork performed as an undergraduate project.\nCorresponding author at Alvaro.Corral@uab.es\n\n\fAnomalous Transport in Conical Granular Piles. Accepted in PRE\n[1] J.J. Duderstadt and W.R. Martin, Transport Theory (J.\nWiley & Sons, New York, 1979).\n[2] R.P. Behringer, Phys. Tod., April 2001, 63.\n[3] H.M. Jaeger and S.R. Nagel, Science 255, 1523 (1992); A.\nMehta and G.C. Barker, Rep. Prog. Phys. 57, 383 (1994);\nH.M. Jaeger, S.R. Nagel, and R.P. Behringer, Rev. Mod.\nPhys. 68, 1259 (1996).\n[4] J. Duran, Sands, Powders, and Grains (Springer-Verlag,\nNew York, 2000).\n[5] K. Christensen, A. Corral, V. Frette, J. Feder, and T.\nJøssang, Phys. Rev. Lett. 77, 107 (1996).\n[6] M. Boguñá and A. Corral, Phys. Rev. Lett. 78, 4950\n(1997).\n[7] V. Frette, K. Christensen, A. Malthe-Sørenssen, J. Feder,\nT. Jøssang, and P. Meakin, Nature 379, 49 (1996).\n[8] For a nice review on SOC see P. Bak, How Nature Works:\nThe Science of Self-Organized Criticality (Copernicus, New\nYork, 1996); for the original ideas see P. Bak, C. Tang, and\nK. Wiesenfeld, Phys. Rev. Lett. 59, 381 (1987); Phys. Rev.\nA. 38, 364 (1988).\n[9] A. Malthe-Sørenssen, J. Feder, K. Christensen, V. Frette,\nand T. Jøssang, Phys. Rev. Lett. 83, 764 (1999).\n[10] R. Pastor-Satorras, Phys. Rev. E 56, 5284 (1997).\n[11] G.A. Held, D.H. Solina, II, D.T. Keane, W.J. Haag, P.M.\nHorn, and G. Grinstein, Phys. Rev. Lett. 65, 1120 (1990).\n[12] J. Rosendahl, M. Vekić, and J. Kelley, Phys. Rev. E 47,\n1401 (1993); J. Rosendahl, M. Vekić, and J.E. Rutledge,\nPhys. Rev. Lett. 73, 537 (1994).\n[13] For a review see J. Feder, Fractals 3, 431 (1995).\n[14] The relation between these distinc dynamical behaviors are\ndiscussed for a different problem in A. Corral, C.J. Pérez,\nA. Dı́az-Guilera and A. Arenas, Phys. Rev. Lett. 74, 118\n(1995); A. Corral, C.J. Pérez and A. Dı́az-Guilera, Phys.\nRev. Lett. 78, 1492 (1997).\n[15] H.M. Jaeger, C.H. Liu, and S.R. Nagel, Phys. Rev. Lett.\n62, 40 (1989).\n[16] S.R. Nagel, Rev. Mod. Phys. 64, 321 (1992).\n[17] A. Corral and M. Paczuski, Phys. Rev. Lett. 83, 572\n(1999).\n[18] It is not important to keep a fixed tracer rate as long as\nthis quantity is much smaller than the main driving rate,\nwhich is what sets the time scale. For the same reason the\ntracer rate can vary for different system sizes; in our case\nwe have 1 or 2 min−1 , which for the experimental resolution\nis irrelevant in front of 43 min−1 .\n[19] H. Scher, M.F. Shlesinger, and J.T. Bendler, Phys. Today\n44, No. 1, 26 (1991).\n\n5\n\n\f"}