{"id": "http://arxiv.org/abs/cond-mat/0606030v1", "guidislink": true, "updated": "2006-06-01T10:34:22Z", "updated_parsed": [2006, 6, 1, 10, 34, 22, 3, 152, 0], "published": "2006-06-01T10:34:22Z", "published_parsed": [2006, 6, 1, 10, 34, 22, 3, 152, 0], "title": "Quantitative modeling of laser speckle imaging", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0606433%2Ccond-mat%2F0606657%2Ccond-mat%2F0606342%2Ccond-mat%2F0606738%2Ccond-mat%2F0606404%2Ccond-mat%2F0606529%2Ccond-mat%2F0606736%2Ccond-mat%2F0606414%2Ccond-mat%2F0606395%2Ccond-mat%2F0606402%2Ccond-mat%2F0606623%2Ccond-mat%2F0606479%2Ccond-mat%2F0606346%2Ccond-mat%2F0606808%2Ccond-mat%2F0606299%2Ccond-mat%2F0606486%2Ccond-mat%2F0606551%2Ccond-mat%2F0606671%2Ccond-mat%2F0606677%2Ccond-mat%2F0606013%2Ccond-mat%2F0606070%2Ccond-mat%2F0606724%2Ccond-mat%2F0606353%2Ccond-mat%2F0606354%2Ccond-mat%2F0606711%2Ccond-mat%2F0606105%2Ccond-mat%2F0606442%2Ccond-mat%2F0606209%2Ccond-mat%2F0606435%2Ccond-mat%2F0606449%2Ccond-mat%2F0606329%2Ccond-mat%2F0606185%2Ccond-mat%2F0606560%2Ccond-mat%2F0606710%2Ccond-mat%2F0606323%2Ccond-mat%2F0606418%2Ccond-mat%2F0606086%2Ccond-mat%2F0606715%2Ccond-mat%2F0606388%2Ccond-mat%2F0606612%2Ccond-mat%2F0606280%2Ccond-mat%2F0606260%2Ccond-mat%2F0606493%2Ccond-mat%2F0606662%2Ccond-mat%2F0606137%2Ccond-mat%2F0606610%2Ccond-mat%2F0606754%2Ccond-mat%2F0606157%2Ccond-mat%2F0606809%2Ccond-mat%2F0606709%2Ccond-mat%2F0606698%2Ccond-mat%2F0606341%2Ccond-mat%2F0606545%2Ccond-mat%2F0606628%2Ccond-mat%2F0606067%2Ccond-mat%2F0606176%2Ccond-mat%2F0606030%2Ccond-mat%2F0606692%2Ccond-mat%2F0606718%2Ccond-mat%2F0606792%2Ccond-mat%2F0606062%2Ccond-mat%2F0606200%2Ccond-mat%2F0606636%2Ccond-mat%2F0606160%2Ccond-mat%2F0606344%2Ccond-mat%2F0606264%2Ccond-mat%2F0606609%2Ccond-mat%2F0606812%2Ccond-mat%2F0606008%2Ccond-mat%2F0606151%2Ccond-mat%2F0606487%2Ccond-mat%2F0606018%2Ccond-mat%2F0606267%2Ccond-mat%2F0606619%2Ccond-mat%2F0606611%2Ccond-mat%2F0606763%2Ccond-mat%2F0606116%2Ccond-mat%2F0606526%2Ccond-mat%2F0606773%2Ccond-mat%2F0606272%2Ccond-mat%2F0606317%2Ccond-mat%2F0606192%2Ccond-mat%2F0606131%2Ccond-mat%2F0606406%2Ccond-mat%2F0606630%2Ccond-mat%2F0606227%2Ccond-mat%2F0606325%2Ccond-mat%2F0606417%2Ccond-mat%2F0606117%2Ccond-mat%2F0606368%2Ccond-mat%2F0606351%2Ccond-mat%2F0606358%2Ccond-mat%2F0606440%2Ccond-mat%2F0606113%2Ccond-mat%2F0606178%2Ccond-mat%2F0606430%2Ccond-mat%2F0606454%2Ccond-mat%2F0606311%2Ccond-mat%2F0606328%2Ccond-mat%2F0606108%2Ccond-mat%2F0606594&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantitative modeling of laser speckle imaging"}, "summary": "We have analyzed the image formation and dynamic properties in laser speckle\nimaging (LSI) both experimentally and with Monte-Carlo simulation. We show for\nthe case of a liquid inclusion that the spatial resolution and the signal\nitself are both significantly affected by scattering from the turbid\nenvironment. Multiple scattering leads to blurring of the dynamic inhomogeneity\nas detected by LSI. The presence of a non-fluctuating component of scattered\nlight results in the significant increase in the measured image contrast and\ncomplicates the estimation of the relaxation time. We present a refined\nprocessing scheme that allows a correct estimation of the relaxation time from\nLSI data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0606433%2Ccond-mat%2F0606657%2Ccond-mat%2F0606342%2Ccond-mat%2F0606738%2Ccond-mat%2F0606404%2Ccond-mat%2F0606529%2Ccond-mat%2F0606736%2Ccond-mat%2F0606414%2Ccond-mat%2F0606395%2Ccond-mat%2F0606402%2Ccond-mat%2F0606623%2Ccond-mat%2F0606479%2Ccond-mat%2F0606346%2Ccond-mat%2F0606808%2Ccond-mat%2F0606299%2Ccond-mat%2F0606486%2Ccond-mat%2F0606551%2Ccond-mat%2F0606671%2Ccond-mat%2F0606677%2Ccond-mat%2F0606013%2Ccond-mat%2F0606070%2Ccond-mat%2F0606724%2Ccond-mat%2F0606353%2Ccond-mat%2F0606354%2Ccond-mat%2F0606711%2Ccond-mat%2F0606105%2Ccond-mat%2F0606442%2Ccond-mat%2F0606209%2Ccond-mat%2F0606435%2Ccond-mat%2F0606449%2Ccond-mat%2F0606329%2Ccond-mat%2F0606185%2Ccond-mat%2F0606560%2Ccond-mat%2F0606710%2Ccond-mat%2F0606323%2Ccond-mat%2F0606418%2Ccond-mat%2F0606086%2Ccond-mat%2F0606715%2Ccond-mat%2F0606388%2Ccond-mat%2F0606612%2Ccond-mat%2F0606280%2Ccond-mat%2F0606260%2Ccond-mat%2F0606493%2Ccond-mat%2F0606662%2Ccond-mat%2F0606137%2Ccond-mat%2F0606610%2Ccond-mat%2F0606754%2Ccond-mat%2F0606157%2Ccond-mat%2F0606809%2Ccond-mat%2F0606709%2Ccond-mat%2F0606698%2Ccond-mat%2F0606341%2Ccond-mat%2F0606545%2Ccond-mat%2F0606628%2Ccond-mat%2F0606067%2Ccond-mat%2F0606176%2Ccond-mat%2F0606030%2Ccond-mat%2F0606692%2Ccond-mat%2F0606718%2Ccond-mat%2F0606792%2Ccond-mat%2F0606062%2Ccond-mat%2F0606200%2Ccond-mat%2F0606636%2Ccond-mat%2F0606160%2Ccond-mat%2F0606344%2Ccond-mat%2F0606264%2Ccond-mat%2F0606609%2Ccond-mat%2F0606812%2Ccond-mat%2F0606008%2Ccond-mat%2F0606151%2Ccond-mat%2F0606487%2Ccond-mat%2F0606018%2Ccond-mat%2F0606267%2Ccond-mat%2F0606619%2Ccond-mat%2F0606611%2Ccond-mat%2F0606763%2Ccond-mat%2F0606116%2Ccond-mat%2F0606526%2Ccond-mat%2F0606773%2Ccond-mat%2F0606272%2Ccond-mat%2F0606317%2Ccond-mat%2F0606192%2Ccond-mat%2F0606131%2Ccond-mat%2F0606406%2Ccond-mat%2F0606630%2Ccond-mat%2F0606227%2Ccond-mat%2F0606325%2Ccond-mat%2F0606417%2Ccond-mat%2F0606117%2Ccond-mat%2F0606368%2Ccond-mat%2F0606351%2Ccond-mat%2F0606358%2Ccond-mat%2F0606440%2Ccond-mat%2F0606113%2Ccond-mat%2F0606178%2Ccond-mat%2F0606430%2Ccond-mat%2F0606454%2Ccond-mat%2F0606311%2Ccond-mat%2F0606328%2Ccond-mat%2F0606108%2Ccond-mat%2F0606594&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We have analyzed the image formation and dynamic properties in laser speckle\nimaging (LSI) both experimentally and with Monte-Carlo simulation. We show for\nthe case of a liquid inclusion that the spatial resolution and the signal\nitself are both significantly affected by scattering from the turbid\nenvironment. Multiple scattering leads to blurring of the dynamic inhomogeneity\nas detected by LSI. The presence of a non-fluctuating component of scattered\nlight results in the significant increase in the measured image contrast and\ncomplicates the estimation of the relaxation time. We present a refined\nprocessing scheme that allows a correct estimation of the relaxation time from\nLSI data."}, "authors": ["P. Zakharov", "A. C. Voelker", "A. Buck", "B. Weber", "F. Scheffold"], "author_detail": {"name": "F. Scheffold"}, "author": "F. Scheffold", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OL.31.003465", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0606030v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0606030v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "submitted to Optics Letters", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0606030v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0606030v1", "journal_reference": null, "doi": "10.1364/OL.31.003465", "fulltext": "Quantitative modeling of laser speckle imaging\nPavel Zakharov and Andreas Völker\nDepartment of Physics, University of Fribourg, 1700 Fribourg, Switzerland\n\narXiv:cond-mat/0606030v1 [cond-mat.soft] 1 Jun 2006\n\nAlfred Buck and Bruno Weber\nDivision of Nuclear Medicine, University Hospital Zurich, 8091 Zurich, Switzerland\n\nFrank Scheffold\nDepartment of Physics, University of Fribourg, 1700 Fribourg, Switzerland\nCompiled July 22, 2013\nWe have analyzed the image formation and dynamic properties in laser speckle imaging (LSI) both experimentally and with\nMonte-Carlo simulation. We show for the case of a liquid inclusion that the spatial resolution and the signal itself are both significantly affected by scattering from the turbid environment. Multiple scattering leads to blurring of the dynamic inhomogeneity as\ndetected by LSI. The presence of a non-fluctuating component of scattered light results in the significant increase in the measured\nimage contrast and complicates the estimation of the relaxation time. We present a refined processing scheme that allows a correct\nestimation of the relaxation time from LSI data.\n© 2013 Optical Society of America\n\nLaser speckle imaging (LSI) is an efficient and simple\nmethod for full-field monitoring of dynamics in heterogeneous media.1 It is widely used in biomedical imaging of\nblood flow1–5 since it provides access to physiological processes in vivo with excellent temporal and spatial resolution.\nIn a more general context LSI can be considered a simplified version of the dynamic light scattering (DLS) approach,\nwhich analyzes the temporal intensity fluctuations of scattered laser light in order to derive the microscopic properties of the scatterers position and motion. In LSI an image\nof dynamic heterogeneities is obtained by analysing the local speckle contrast in the image plane. The local contrast K\nis defined as the ratio of the standard deviation of the intensity fluctuations to the mean intensity:1 K = σarea /hIiarea . In\nthe absence of scatterers motion the contrast takes a value of\nK = 1, while motion blurs the speckle pattern and thus the\ncontrast decreases. Therefore the value K can be used to estimate the time scale of intensity fluctuations and local scatter\nmotion.1 However the quantitative interpretation of the LSI\ndata is not straightforward. Multiple scattering of light can\ninfluence the apparent size of the object due to diffuse blurring. Access to the local dynamic properties, such as blood\nflow or Brownian motion, is complicated by the complex interplay between the measured contrast and the full fluctuation\nspectrum of scattered light. The latter is usually not accessible\nif technical simplicity of LSI is to be preserved.\nIn this letter we present a quantitative approach to analyze\nLSI images. We address the problem of spatial resolution and\nblurring due to multiple scattering via model experiments and\nMonte-Carlo simulations. Further we will demonstrate, that\nprevious attempts to relate quantitatively LSI images to the\nmicroscopic motion have been hampered by an incorrect data\nanalysis.We present a refined processing scheme to access\nthis information from a standard LSI experiment. The main\nnew element of our analysis is to take into account quantitatively the contribution of the non-fluctuating part of scattered\n\nintensity. We furthermore suggest a simple experimental procedure that allows to access this important quantity.\nModel experiments have been carried out using a homogeneous block of solid Teflon and a home-made heterogeneous\nsample. This medical phantom mimics a liquid inclusion in\nsolid tissue. It is obtained by milling a cylindrical hole of diameter D = 3 mm in a block of solid Teflon. A layer of variable thickness 0.45 − 2.1 mm separates the cylindrical inclusion from the interface that is imaged. The void is filled with a\ndispersion of 710 nm polystyrene particles in water. The particle concentration is adjusted to match the optical properties\nof the liquid to the solid (volume fraction ca. 1.3%; scattering\ncoefficient μ s = 36 mm−1 , mean free path l∗ ≈ 277 μm and\nanisotropy factor g ≈ 0.9). Thus our sample does not show\nany static scattering differences. The imaging setup has been\ndescribed in detail in Ref. 6. Briefly, the cylindric inclusion\nwith flat base of 3 mm diameter oriented to the surface is\nimaged with a CCD camera (PCO Pixelfly, Germany) with\na standard camera objective lens ( f = 50 mm). The sample\nis illuminated with a diode laser (wavelength 785 nm, max.\n50 mW). The beam is expanded by a slow-rotating ground\nglass in order to reduce statistical noise.6 For each depth the\ncontrast as a function of radial distance r from the inclusion\ncenter is determined. The results of this procedure for different depths of the inclusion are shown in Fig. 1.\nFor the Monte-Carlo simulation we followed the photon\npacket approach of light propagation in a turbid medium.7\nThe Henyey-Greenstein phase function was used based on an\naverage scattering angle hcos θi.7 The degree of polarization\nwas assumed to decay exponentially.8 The reflections and refractions on the boundaries were treated according to Fresnel\nformulas. As the refractive index of the Teflon (n = 1.35) is\nvery close to water (n = 1.33) interactions with boundaries\nof dynamic inclusion were not considered. The photon packets back-reflected from the sample where registered within a\nnumerical aperture 0.17. Only depolarized photons were reg1\n\n\f0.9\n0.8\n\n1\n\nd = 2.10 mm\n\nr = 4.5 mm\n\n0.7\n0.6\n\n0.4\n0.6\n\n0.3\nd = 0.45 mm\n\n0.2\n\ng1 (τ)\n\n0.7\n\nd = 1.20 mm\n\nr = 3.0 mm\n3 mm\n\nσgrad, mm\n\n0.5\nK\n\n0.8\n\nd, mm\n\n0.5\n\n0.6\nr\n\n0.4\n\nr = 1.5 mm\n0.2\n\n0.1\n\n0.4\n\n0\n\nd = 0.10 mm\n0\n\n1\n\nr = 0.0 mm\n\n0.0 0.5 1.0 1.5 2.0\n2\n\n3\n\n4\n\n0\n10-6\n\n5\n\nr, mm\n\nFig. 1. Contrast K as a function of distance r from the center\nof the inclusion for different depths d. Curves represent simulation results, symbols - experimental results. Vertical line\nshows the inclusion boundary. Inset: Measured width of the\nliquid solid-boundary as a function of depth (\b - simulation\ndata, \u0003 - experiment, line is a guide for the eye).\n\n10-5\n\n10-4\n\n10-3\nτ, s\n\n10-2\n\n10-1\n\n100\n\nFig. 2. Simulated correlation functions g1 (τ) for the inclusion\ndepth d = 100 μm. Solid lines show the fits with DWS theory with baseline. The relaxation times τ0 for the fits were\nobtained by the contrast K inversion (see Fig. 3).\n\nin practice as compared to the complex correlation function\ncharacterizing the full spectrum of intensity fluctuations and\nthus particular care has to be taken which and how information can be extracted.\nIn our work we have access to both K and g1 (t) and thus we\nare able to analyze the LSI detection process quantitatively.\nWe first analyze the characteristic features of the correlation\nfunctions presented in Fig. 2. Overall the functions are well\ndescribed by the usual stretched-exponential form derived for\ndiffusing-wave spectroscopy\n(DWS) of a colloid suspension:\n√\ng1 (τ) = exp(−γ 6τ/τ0 ), where in our case relaxation time\nτ0 = 1/Dk02 characterizes Brownian motion (diffusion coefficient D) and γ ≈ 2 is a constant.13, 14 It is worthwhile to\nnote that for the case of blood flow the relaxation time τ0 is\ninversely proportional to the root mean square of the flow velocity .\nThe presence of a non-fluctuating static scattering part,\nhowever, leads to a non-zero baseline. Since the relative\namount of the static light scattering increases with the distance r from the center, the plateau of the ACF increases\nas well. It has been noted previously that a non-zero baseline significantly influences or even dominates the resulting\nvalues of the contrast K.1 Nevertheless it is rather common\nin the biomedical community to convert the obtained contrast\nvalues directly to relaxation times neglecting contributions of\nstatic scattering.2, 4, 5, 15–17\nIf the detected light is composed of dynamic and static\ncomponents: E(t) = Ed (t) + E s (t) the measured field correlation function is defined as following:18\n\nistered to match the experimental conditions. The field autocorrelation function (ACF) g1 (τ) of the scattered light was\ndetermined from the photon packet history as explained in\nRef. 9.\nIn order to quantify the effect of image blurring caused by\nmultiple scattering we determine the standard deviation of\nthe contrast gradient σgrad . As can be seen in Fig. 1 starting from the smallest depths the apparent width is increased.\nThis increase is of the order of a few l∗ , which is the relevant length scale for an incident photon to propagate laterally.\nThe smearing increases with depth until for large depths the\nwidth becomes of the order of the depth, as expected for diffuse light propagation.10 Our results show the importance of\ndiffuse blurring in the image formation already for small and\nmoderate depths and can thus provide important guidelines\nfor the analysis of actual experiments in biomedical imaging.3–5\nA typical set of simulated correlation functions is presented\nin the Fig.2. If g1 (τ) is known, then the speckle contrast K of\nthe time-integrated speckle fluctuations can be obtained via\nthe following relation11, 12\nZ\n2β T\nhI 2 i\n2\n|g1 (τ)|2 (1 − τ/T ) dτ,\n(1)\n−1=\nK =\nT 0\nhIi2\nwhere T is the integration time of the detector and β the coherence factor of the detection optics. It is important to note that\nthis equation is different to the traditionally used expression\nof Fercher and Briers.1 As reaffirmed by Durian and coworkers the correct expression, eq. (1), has to take into account the\neffect of triangular averaging of the correlation function.11\nAs shown in Fig. 1 the resulting values of the contrast are\nfound in quantitative agreement with the experimental data\nwithout any adjustable parameter.\nA comparison of Fig. 1 and Fig. 2 immediately reveals the\nmain limitation of LSI. A single contrast value K is recorded\n\ng1 (τ) = ρ |g1 d (τ)| + (1 − ρ) ,\n\n(2)\n\nwhere ρ = hId i/(hId i + hI s i) characterizes the fluctuating part\nof the detected light intensity and g1 d (τ) is the field correlation function of the dynamic component. The resulting\ncontrast value can be calculated by substituting eq. (2) into\n2\n\n\f1 / τ 0, 1 / s\n\n10\n\n2\n\n10\n\n1\n\n10\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\nimpact of the static scattering on the quantitative interpretation of LSI images. A simple procedure has been suggested\nto perform a quantitative analysis in actual LSI experiments.\nFinancial support from the Swiss National Science\nfoundation is gratefully acknowledged. Correspondence should be addressed to Frank Scheffold (e-mail,\nFrank.Scheffold@unifr.ch) or Pavel Zakharov (e-mail,\nPavel.Zakharov@unifr.ch)\nReferences\n\n0\n\n0.5\n\n1\n\n1.5\n\n1. J. D. Briers. Laser doppler, speckle and related techniques\nfor blood perfusion mapping and imaging. Physiological\nMeasurement, 22(4):R35–R66, 2001.\n2. A. K. Dunn, H. Bolay, M. A. Moskowitz, and D. A. Boas. Dynamic imaging of cerebral blood flow using laser speckle. J.\nCereb. Blood Flow Metab., 21:195 – 201, 2001.\n3. B. Weber, C. Burger, M. T. Wyss, G. K. von Schulthess,\nF. Scheffold, and A. Buck. Optical imaging of the spatiotemporal dynamics of cerebral blood flow and oxidative metabolism\nin the rat barrel cortex. Eur J Neurosci, 20(10):2664, 2004.\n4. T. Durduran, M. G. Burnett, C. Zhou G. Yu, D. Furuya, A. G.\nYodh, J. A. Detre, and J. H. Greenberg. Spatiotemporal quantification of cerebral blood flow during functional activation in\nrat somatosensory cortex using laser-speckle flowmetry. Journal of Cerebral Blood Flow & Metabolism, 24:518–525, 2004.\n5. A.K. Dunn, A. Devor, A.M. Dale, and D.A. Boas. Spatial extent of oxygen metabolism and hemodynamic changes during\nfunctional activation of the rat somatosensory cortex. NeuroImage, 27(15):279 – 290, 2005.\n6. A.C. Völker, P. Zakharov, B. Weber, F. Buck, and F. Scheffold.\nLaser speckle imaging with active noise reduction scheme.\nOpt. Exp., 13(24):9782 – 9787, 2005.\n7. S. A. Prahl, M. Keijzer, S. L. Jacques, and A. J. Welch. A\nmonte carlo model of light propagation in tissue. In G. J.\nMüller and D. H. Sliney, editors, SPIE Proceedings of Dosimetry of Laser Radiation in Medicine and Biology, volume IS 5,\npages 102 – 111, 1989.\n8. D. A. Zimnyakov. On some manifestations of similarity in\nmultiple scattering of coherent light. Waves Random Media,\n10:417 – 434, 2000.\n9. D.J. Durian. Accuracy of diffusing-wave spectroscopy theories. Phys. Rev. E , 51:3350 – 3358, 1995.\n10. M. Heckmeier and G. Maret. Dark speckle imaging of colloidal\nsuspensions in multiple light scattering media. PROGRESS IN\nCOLLOID AND POLYMER SCIENCE, 104:12 – 16, 1997.\n11. K Schätzel. Noise on photon correlation data. i. autocorrelation\nfunctions. Quantum Optics: Journal of the European Optical\nSociety Part B, 2(4):287–305, 1990.\n12. R. Bandyopadhyay, A.S. Gittings, S.S. Suh, P.K. Dixon, and\nD.J. Durian. Speckle-visibility spectroscopy: A tool to study\ntime-varying dynamics. Rev. Sci. Instrum., 76:093110, 2005.\n13. B.J. Berne and R. Pecora. Dynamic Light Scattering. With Applications to Chemistry, Biology, and Physics. Dover Publications, Inc., New York, 2000.\n14. D.J. Pine, D.A. Weitz, P.M. Chaikin, and E. Herbolzheimer.\nDiffusing-wave spectroscopy. Phys. Rev. Lett. , 60:1134–1137,\n1988.\n15. A. Dunn, A. Devor, M. Andermann, H. Bolay, M. Moskowitz,\nA. Dale, and D. Boas. Simultaneous imaging of total cerebral\nhemoglobin concentration, oxygenation and blood flow during\nfunctional activation. Optics Letters, 28:28 – 30, 2003.\n\n2\n\nd, mm\n\nFig. 3. Inverse of the relaxation time 1/τ0 as a function of\ndepth obtained by directly converting the contrast K based\non Eq.1 neglecting the static part: \b - simulation data, △ experiment and using the correct procedure based on Eq. 3:\n\u0004 - simulation and ^ - experiment. Horizontal dashed line actual value of the relaxation time.\neq. (1):\nKm2\n\n=\n=\n\nZ\n\u0003\n2β T \u0002\nρ |g1d (τ)| + (1 − ρ) 2 (1 − τ/T ) dτ\nT 0\ni\nh\n(3)\nβ ρ2 K22 d + 2ρ (1 − ρ) K12 d + (1 − ρ)2 ,\n\nRT\nwhere K22 d = 1/T 0 |g1 d (τ)|2 (1 − τ/T ) dτ and K12 d =\nRT\n1/T 0 |g1 d (τ)| (1 − τ/T ) dτ are the normalized variances of\nthe intensity and field fluctuations of the dynamic part of the\ndetected signal with K2 d < K1 d . The last term in eq. (3) is\ntime independent and reflects the impact of the static scattering contribution. Thus the contrast Km measured in an LSI\nexperiment is given by the dynamic contrast of intensity fluctuations K2 d , the dynamic contrast of the field fluctuations\nK1 d and ρ.\nIn an actual LSI experiment an additional processing step\nhas to be introduced in order to separate the dynamic and\nstatic part. The camera exposure time T is usually larger\ncompared to the relaxation time τ0 related to blood flow and\nsubsequent frames are separated by a period ∆t larger than\nT . Since ∆t > T > τ0 two sequential frames are free of\nthe dynamic component of interest and thus the time and\nspace dependent static or pseudo-static component can be\neasily found by cross-correlating sequential frames ρ (t, r) =\nh\ni1/2\n1 − hI (t, r) I (t + ∆t, r)i s /hI (t, r)i2s − 1 .\nFig. 3 shows a comparison of the correct inversion procedure based on eq. (3) as compared to the one neglecting static scattering.12 While the correct procedure produces\nvalues comparable to the relaxation time of Brownian motion\nτ0 the direct conversion can deviate by several orders of magnitude.\nIn conclusion, we studied the image blurring of an object\nburied in turbid media and found that the resolution of the obtained images can be affected significantly by multiple scattering. We furthermore introduced a model that reflects the\n3\n\n\f16. S. Yuan, D.A. Boas, and A.K. Dunn. Determination of optimal\nexposure time for imaging of blood flow changes with laser\nspeckle contrast imaging. Appl. Opt. , 2005.\n17. Haiying Cheng, Qingming Luo, Qian Liu, Qiang Lu, Hui\nGong, and Shaoqun Zeng. Laser speckle imaging of blood\nflow in microcirculation. Physics in Medicine and Biology,\n49(7):1347–1357, 2004.\n18. D. A. Boas and A. G. Yodh. Spatially varying dynamical properties of turbid media probed with diffusing temporal light correlation. JOSA, 14(1):192 – 215, 1997.\n\n4\n\n\f"}