{"id": "http://arxiv.org/abs/cond-mat/0308624v2", "guidislink": true, "updated": "2004-05-07T14:42:06Z", "updated_parsed": [2004, 5, 7, 14, 42, 6, 4, 128, 0], "published": "2003-08-29T14:13:07Z", "published_parsed": [2003, 8, 29, 14, 13, 7, 4, 241, 0], "title": "The statistical geometry of scale-free random trees", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0308235%2Ccond-mat%2F0308316%2Ccond-mat%2F0308518%2Ccond-mat%2F0308092%2Ccond-mat%2F0308065%2Ccond-mat%2F0308575%2Ccond-mat%2F0308565%2Ccond-mat%2F0308396%2Ccond-mat%2F0308628%2Ccond-mat%2F0308115%2Ccond-mat%2F0308133%2Ccond-mat%2F0308378%2Ccond-mat%2F0308011%2Ccond-mat%2F0308314%2Ccond-mat%2F0308075%2Ccond-mat%2F0308142%2Ccond-mat%2F0308167%2Ccond-mat%2F0308234%2Ccond-mat%2F0308529%2Ccond-mat%2F0308101%2Ccond-mat%2F0308172%2Ccond-mat%2F0308241%2Ccond-mat%2F0308318%2Ccond-mat%2F0308112%2Ccond-mat%2F0308548%2Ccond-mat%2F0308165%2Ccond-mat%2F0308220%2Ccond-mat%2F0308593%2Ccond-mat%2F0308308%2Ccond-mat%2F0308153%2Ccond-mat%2F0308450%2Ccond-mat%2F0308591%2Ccond-mat%2F0308562%2Ccond-mat%2F0308223%2Ccond-mat%2F0308404%2Ccond-mat%2F0308417%2Ccond-mat%2F0308512%2Ccond-mat%2F0308197%2Ccond-mat%2F0308111%2Ccond-mat%2F0308498%2Ccond-mat%2F0308405%2Ccond-mat%2F0308310%2Ccond-mat%2F0308070%2Ccond-mat%2F0308189%2Ccond-mat%2F0308470%2Ccond-mat%2F0308375%2Ccond-mat%2F0308549%2Ccond-mat%2F0308155%2Ccond-mat%2F0308213%2Ccond-mat%2F0308569%2Ccond-mat%2F0308170%2Ccond-mat%2F0308359%2Ccond-mat%2F0308524%2Ccond-mat%2F0308154%2Ccond-mat%2F0308523%2Ccond-mat%2F0308105%2Ccond-mat%2F0308625%2Ccond-mat%2F0308536%2Ccond-mat%2F0308064%2Ccond-mat%2F0308541%2Ccond-mat%2F0308005%2Ccond-mat%2F0308473%2Ccond-mat%2F0308386%2Ccond-mat%2F0308377%2Ccond-mat%2F0308301%2Ccond-mat%2F0308624%2Ccond-mat%2F0308186%2Ccond-mat%2F0308277%2Ccond-mat%2F0308527%2Ccond-mat%2F0308088%2Ccond-mat%2F0308445%2Ccond-mat%2F0308059%2Ccond-mat%2F0308285%2Ccond-mat%2F0308157%2Ccond-mat%2F0308266%2Ccond-mat%2F0308069%2Ccond-mat%2F0308173%2Ccond-mat%2F0308242%2Ccond-mat%2F0308454%2Ccond-mat%2F0308257%2Ccond-mat%2F0308094%2Ccond-mat%2F0308061%2Ccond-mat%2F0308357%2Ccond-mat%2F0308616%2Ccond-mat%2F0308456%2Ccond-mat%2F0308603%2Ccond-mat%2F0308084%2Ccond-mat%2F0308145%2Ccond-mat%2F0308434%2Ccond-mat%2F0308488%2Ccond-mat%2F0308117%2Ccond-mat%2F0308444%2Ccond-mat%2F0308368%2Ccond-mat%2F0308060%2Ccond-mat%2F0308134%2Ccond-mat%2F0308422%2Ccond-mat%2F0308563%2Ccond-mat%2F0308568%2Ccond-mat%2F0308554%2Ccond-mat%2F0308618%2Ccond-mat%2F0308103&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The statistical geometry of scale-free random trees"}, "summary": "The properties of scale-free random trees are investigated using both\npreconditioning on non-extinction and fixed size averages, in order to study\nthe thermodynamic limit. The scaling form of volume probability is found, the\nconnectivity dimensions are determined and compared with other exponents which\ndescribe the growth. The (local) spectral dimension is also determined, through\nthe study of the massless limit of the Gaussian model on such trees.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0308235%2Ccond-mat%2F0308316%2Ccond-mat%2F0308518%2Ccond-mat%2F0308092%2Ccond-mat%2F0308065%2Ccond-mat%2F0308575%2Ccond-mat%2F0308565%2Ccond-mat%2F0308396%2Ccond-mat%2F0308628%2Ccond-mat%2F0308115%2Ccond-mat%2F0308133%2Ccond-mat%2F0308378%2Ccond-mat%2F0308011%2Ccond-mat%2F0308314%2Ccond-mat%2F0308075%2Ccond-mat%2F0308142%2Ccond-mat%2F0308167%2Ccond-mat%2F0308234%2Ccond-mat%2F0308529%2Ccond-mat%2F0308101%2Ccond-mat%2F0308172%2Ccond-mat%2F0308241%2Ccond-mat%2F0308318%2Ccond-mat%2F0308112%2Ccond-mat%2F0308548%2Ccond-mat%2F0308165%2Ccond-mat%2F0308220%2Ccond-mat%2F0308593%2Ccond-mat%2F0308308%2Ccond-mat%2F0308153%2Ccond-mat%2F0308450%2Ccond-mat%2F0308591%2Ccond-mat%2F0308562%2Ccond-mat%2F0308223%2Ccond-mat%2F0308404%2Ccond-mat%2F0308417%2Ccond-mat%2F0308512%2Ccond-mat%2F0308197%2Ccond-mat%2F0308111%2Ccond-mat%2F0308498%2Ccond-mat%2F0308405%2Ccond-mat%2F0308310%2Ccond-mat%2F0308070%2Ccond-mat%2F0308189%2Ccond-mat%2F0308470%2Ccond-mat%2F0308375%2Ccond-mat%2F0308549%2Ccond-mat%2F0308155%2Ccond-mat%2F0308213%2Ccond-mat%2F0308569%2Ccond-mat%2F0308170%2Ccond-mat%2F0308359%2Ccond-mat%2F0308524%2Ccond-mat%2F0308154%2Ccond-mat%2F0308523%2Ccond-mat%2F0308105%2Ccond-mat%2F0308625%2Ccond-mat%2F0308536%2Ccond-mat%2F0308064%2Ccond-mat%2F0308541%2Ccond-mat%2F0308005%2Ccond-mat%2F0308473%2Ccond-mat%2F0308386%2Ccond-mat%2F0308377%2Ccond-mat%2F0308301%2Ccond-mat%2F0308624%2Ccond-mat%2F0308186%2Ccond-mat%2F0308277%2Ccond-mat%2F0308527%2Ccond-mat%2F0308088%2Ccond-mat%2F0308445%2Ccond-mat%2F0308059%2Ccond-mat%2F0308285%2Ccond-mat%2F0308157%2Ccond-mat%2F0308266%2Ccond-mat%2F0308069%2Ccond-mat%2F0308173%2Ccond-mat%2F0308242%2Ccond-mat%2F0308454%2Ccond-mat%2F0308257%2Ccond-mat%2F0308094%2Ccond-mat%2F0308061%2Ccond-mat%2F0308357%2Ccond-mat%2F0308616%2Ccond-mat%2F0308456%2Ccond-mat%2F0308603%2Ccond-mat%2F0308084%2Ccond-mat%2F0308145%2Ccond-mat%2F0308434%2Ccond-mat%2F0308488%2Ccond-mat%2F0308117%2Ccond-mat%2F0308444%2Ccond-mat%2F0308368%2Ccond-mat%2F0308060%2Ccond-mat%2F0308134%2Ccond-mat%2F0308422%2Ccond-mat%2F0308563%2Ccond-mat%2F0308568%2Ccond-mat%2F0308554%2Ccond-mat%2F0308618%2Ccond-mat%2F0308103&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The properties of scale-free random trees are investigated using both\npreconditioning on non-extinction and fixed size averages, in order to study\nthe thermodynamic limit. The scaling form of volume probability is found, the\nconnectivity dimensions are determined and compared with other exponents which\ndescribe the growth. The (local) spectral dimension is also determined, through\nthe study of the massless limit of the Gaussian model on such trees."}, "authors": ["Luca Donetti", "Claudio Destri"], "author_detail": {"name": "Claudio Destri"}, "author": "Claudio Destri", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0305-4470/37/23/004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0308624v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0308624v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, 2 figures, revtex4, minor changes (published version)", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0308624v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0308624v2", "journal_reference": "J. Phys. A: Math. Gen. 37 (2004) 6003", "doi": "10.1088/0305-4470/37/23/004", "fulltext": "The statistical geometry of scale-free random trees\nLuca Donetti∗ and Claudio Destri†\nDipartimento di Fisica G. Occhialini, Università di Milano-Bicocca and INFN,\nSezione di Milano, Piazza delle Scienze 3 - I-20126 Milano, Italy\n\narXiv:cond-mat/0308624v2 [cond-mat.other] 7 May 2004\n\nThe properties of random trees (Galton-Watson trees) with scale-free (power-like) probability\ndistribution of coordinations are investigated in the thermodynamic limit. The scaling form of\nvolume probability is found, the connectivity dimensions are determined and compared with other\nexponents which describe the growth. The (local) spectral dimension is also determined, through\nthe study of the massless limit of the Gaussian model on such trees.\nPACS numbers: 02.50.-r,05.40.-a,46.65.+g\n\nContents\n\n1\n\nI. Introduction and summary\nII. Random trees\nA. Generalities about graphs\nB. Generalities about random trees\nC. Trees with bounded coordination\nD. Scale-free trees\n\n2\n2\n4\n5\n5\n\nIII. Growth statistics\nA. Scaling probabilities for local surface and volume\nB. Fixed volume expectation values\nC. Probability of the average surface\n\n6\n6\n8\n11\n\nIV. Spectral dimension\n\n14\n\nA. Details on probability distributions\n1. β > 3\n2. 2 < β < 3\n\n16\n16\n18\n\nB. Vn moments\n\n20\n21\n\nReferences\nI.\n\nINTRODUCTION AND SUMMARY\n\nGraph theory and its applications play an important role in many areas of scientific research, from pure mathematics,\nto physics, statistics, biology and social sciences. In particular random graphs, that is graphs extracted with some\nprobability from a suitable statistical ensemble, are interesting as a mean to implement the intrinsic complexity and/or\nchaotic nature of many physical, biological and social systems [1].\nAmong graphs, trees (that is graphs without loops) play a distinguished role: they retain a deep interest and wide\napplicability while still being amenable to detailed analytic studies. Random trees appears in several distinct contexts,\nlike polymer physics, critical percolation [2] and two–dimensional quantum gravity (branched polymers [3]).\nGenerically, in a random graph the local coordination is itself a random variable taking values according to some\nprobability distribution; while in the classical Erdős-Rényi theory of random graphs [4] this distribution is Poissonian,\nin several examples of \"experimental\" complex networks it turns out to be \"scale-free\", that is with a long power-law\n\n∗ Electronic\n† Electronic\n\naddress: Luca.Donetti@mib.infn.it\naddress: Claudio.Destri@mib.infn.it\n\n\ftail [5]. This implies that on an infinite scale-free graph nodes with diverging coordination are rather frequent, causing\nsome subtleties in the application of the law of large numbers.\nIn this paper we concentrate our attention to homogeneous scale-free random trees subject only to the physically\nnatural constraint of being embeddable in a finite dimensional Euclidean space. This class of random trees has been\nstudied already in [6, 7], although from a viewpoint different from ours: while in these works only some statistical\naverages relevant to characterize the geometry of these trees were analyzed, we study here in depth the probability\ndistributions of the basic observables which specify the intrinsic geometry. Our results apply therefore to any single\n\"generic\" (infinite) scale-free random tree and not just to their statistical ensemble.\nThe outline of this paper is as follows. First of all we recall some definitions of graph theory and we introduce the\nalgorithm used to build homogeneous random trees, summarizing known results. The local connectivity dimension\nis then obtained from the scaling properties of the probability distributions for the volume and the surface of the\nspheres centered at the origin of the tree-constructing algorithm. Details of the scaled probabilities are studied and\ntheir asymptotic behavior is determined. Then the probability distributions for the graph-averaged volume and the\nsurface are considered; the average connectivity dimension is extracted from their scaling properties.\nOur results for the growth properties of a random tree can be summarized in very concise heuristic formulas as\nfollows: consider a sphere (intrinsically defined in terms of the chemical distance alone) of radius r centered on some\nnode; for large r the volume v of the sphere and the coordination fluctuation ∆z within the sphere are random\nvariables simply related as\nv ≃ (∆z)2 r2\nThis relation apply to all random trees with bounded growth rate (see below) regardless of whether ∆z has a finite\nlimit as v → ∞ or not. In the former case, as it happens for instance on trees with bounded coordination, one\nreads immediately out the connectivity dimension dc = 2. In the latter case, one need to estimate the asymptotic\ndependence of ∆z on v. For scale-free trees with tail exponent 2 < β < 3 (see below for the proper definitions), one\nfinds ∆z ∼ v (3−β)/(β−1) , yielding the β−dependent connectivity dimension\ndc =\n\nβ−1\nβ−2\n\nSuppose instead that one is interested in the graph-averaged volume v obtained by averaging over all locations of the\ncenter of the sphere (for a finite tree with large volume V ). The random variable v is related to the coordination\nfluctuation ∆z over the whole tree just as before, that is\nv ≃ (∆z)2 r2\nNow the behavior in r is always quadratic, regardless of the way the coordinations are distributed. Of course, in\nthe scale-free trees with 2 < β < 3 one has ∆z ∼ V (3−β)/(β−1) , making it impossible to consider the standard\nthermodynamic limit V → ∞. Nonetheless, we find that a well defined limit exists for the \"renormalized\" volume\nv V (β−3)/(β−1) . Therefore, in all cases we conclude for the average connectivity dimension\nd ̄c = 2\nFinally, in the last section, the analysis of the probability distribution for the effective squared mass, defined through\nthe Gaussian model on the tree, allows us to rigorously determine also the local spectral dimension ds . It fulfills\nthe long-conjectured [8] relation ds = 2dc /(dc + 1) already verified in [7] through a general but completely different\nargument.\nII.\nA.\n\nRANDOM TREES\n\nGeneralities about graphs\n\nA graph G is defined by a set of nodes (finite or countable), pairwise connected by a set of unordered links. If the set\nof nodes is finite, its cardinality will be denoted by |G|. The coordination number (or degree, or simply coordination)\nof a node x is the number of its nearest neighbors and it is denoted by zx . The intrinsic properties of the graph are\ndetermined only by the connections between the nodes; the metric is given by the so-called chemical distance: the\ndistance d(x, y) is equal to the number of links of the shortest connected path between x and y. This distance is used\nto define spheres; the \"volume\" vr (x) is defined as the number of nodes of the radius r sphere centered at node x,\n\n\fand the \"surface\" sr (x) is the number of nodes of the corresponding spherical shell. Here we shall consider connected\ngraphs in the limit of infinitely many nodes.\nGiven a function F defined on the nodes, its average value F is defined as the infinite radius limit of the average\nover spheres; if such limit exists, it does not depend on the center of the spheres provided F is bounded from below\nand the graph has a bounded growth rate [9], that is the surface vanishes with respect to the volume in the infinite\nsize limit.\nThe properties of graphs can be described by various parameters; here we consider the connectivity dimension [10]\nand the spectral dimension [11]. The connectivity dimension describes how the volume of spheres scales with its\nradius r for r → ∞; we can define a local connectivity dimension dc using the spheres centered on any given node x\nvr (x) ∼ rdc\n\n(1)\n\nIt is not difficult to show that dc does not depend on x when the graph has a bounded growth rate. We can define\nalso an average dimension d ̄c , if the average volume is used (provided the limit defining it exists finite)\n ̄\n\nvr ∼ rdc\n\n(2)\n\nThese two connectivity dimensions usually coincide, but on strongly inhomogeneous graphs they can be different [12].\nThe spectral dimension is related to long time properties of random walks on the graph, as well as to many other\nphysical properties such as the infrared behavior of the Gaussian model [13]. On a generic connected graph G this\nmodel is defined by assigning a real-valued random variable φx to each node x ∈ G with the Hamiltonian\nH=\n\n1 X 2 1 X\n(φx − φy )2\nμ0\nφx +\n2\n2\nx\n\n(3)\n\nhx,yi\n\nwhere hx, yi denotes nearest neighbors pairs of nodes and μ0 > 0 is a free parameter (the squared mass in field–\ntheoretic sense). The spectral dimension is determined by the infrared μ0 → 0 singularity of the diagonal element of\nthe covariance\nd /2−1\n\nSing hhφ2x ii ∼ μ0s\n\n(4)\n\nwhere hh*ii denotes standard Gibbs expectation values weighted with exp(−H). One can show that ds does not depend\non the choice of the node x [13]. As for the connectivity dimension, it is possible to split the spectral dimension into\na local one and an average one. The definition in eq. (4) evidently corresponds to the local one; the average spectral\ndimension d ̄s characterizes in the same way the singularity of the graph average of hhφ2x ii. Again, the two dimensions\nusually coincide, but on strongly inhomogeneous graphs they can be different [12].\nSuppose now that a certain statistical ensemble G of (infinite) graphs is given. As a consequence, connectivity\nand spectral dimensions become in principle random variables with probability distributions derived from the \"microscopic\" one specifying G. Consider the connectivity dimension: if the graphs of G are rooted, we can use the root,\ndenoted by o, as the center of the spheres those growth define dc ; then the corresponding volumes vr (o) are random\nvariables distributed with some probability Pr[vr (o) = v]. If this probability has a well defined scaling behavior for\nr → ∞, that is\n1 \u0010v\u0011\nPr[vr (o) = v] ≃ d p d\nr\nr\nthen the random variable vr (o)r−d has a well defined probability distribution in the limit r → ∞ and we may write\nagain\nvr (o) ∼ rd\nas in eq. (1), identifying d with a non-fluctuating local connectivity dimension dc . In other words dc is a property\nof a \"generic\" specimen of the ensemble, that is a a property of G itself. A similar argument applies to the average\nconnectivity dimension d ̄c and to the spectral dimensions using the random variable hhφ2x ii and its graph average.\nAn alternative approach is used in ref. [6], where averages in the canonical or grand-canonical ensembles of certain\nrandom trees (i.e. graphs without loops) are studied rather than a single \"generic\" sample tree. Two parameters\nare introduced to describe the intrinsic geometry of these trees, also called \"branched polymers\": the Hausdorff\ndimensions dH and dL . The former is related to how the average two-point distance on graphs with V nodes scales\nwith the size V :\nhd(x, y)iV ∼ V 1/dH\n\n(5)\n\n\fThe latter (called local Hausdorff dimension in [6]) is related to the behavior of the two-points correlation function\n(2)\ngV (r) (proportional to the number of couples of nodes which are at distance r) for distances which are large, but\nmuch smaller than V 1/dH :\n(2)\n\ngV (r)\n\nV →∞\n\n∼\n\nrdL −1 ,\n\n1 ≪ r ≪ V 1/dH\n\n(6)\n\nIt is claimed in [6] that dH and dL differ on a certain class of \"exotic\" random trees characterized by unbounded local\ncoordinations.\nActually, it is not a priori obvious if and how parameters such as dH and dL are connected to the connectivity\ndimensions dc and d ̄c , although it is common lore to identify the Hausdorff dimension with the connectivity dimension\nwhen no distinction is made about local or average dimensions. One of the aims of the present work is just to fully\nanswer this question in the case of homogeneous random trees, as we shall see below.\nB.\n\nGeneralities about random trees\n\nHomogeneous random trees are built by the random independent extraction of every node's degree from a given\ndistribution fz . This process can be formulated as a Galton-Watson branching process [14]; in particular, since we\nare interested in trees with bounded growth rate, we must consider the critical Galton-Watson case. The given\ncoordination distribution must be properly normalized\nX\nfz = 1\n(7)\nz\n\nand the average coordination must be equal to 2 because of the condition of bounded growth rate (see ref. [9])\nX\nhzi =\nzfz = 2\n\n(8)\n\nz\n\nClearly these sums have a finite number of addends if the coordination is bounded, while they become series if it is\nunbounded as in the scale-free case. The series, however, must be properly convergent in order equations (7) and (8)\nto hold, so that fz must vanish faster than z −2 for z → ∞. Let us also introduce the probability generating function\ng(λ)\nX\ng(λ) =\nfz λz−1 = f1 + f2 λ + f3 λ2 + . . .\n(9)\nz\n\nwhich enjoys the properties\ng(1) = 1 ,\n\ng ′ (1) = 1\n\n(10)\n\neasily derived from those of fz .\nA branching process effectively ends when a shell (that is a given generation of sibling branches) is made only by\nnodes with coordination 1, so that the next shell is empty. The trees produced in this way are all finite because the\nsurviving probability after r generations vanishes for r → ∞ in the critical Galton-Watson process [14]. Since we\nare interested in the thermodynamic limit we have two possibilities [9]. The first one is an explicit preconditioning\non non-extinction: this means that modified branching probabilities are used to avoid finite trees, while keeping\nunaltered the properties of the infinite trees [15]. This is achieved if the root coordination is chosen with probability\nfz while on every successive shell the coordination of the first node is extracted with a modified probability distribution\nf ̃z = (z − 1)fz . The other possibility consists in calculating probabilities conditioned on the number of nodes V of\nthe resulting trees, and then take the limit V → ∞. In this latter case the root coordination must be extracted with\nthe refined probability\nfz\n,\nfbz = N1\nz\n\nX fz\n1\n=\nN1\nz\nz\n\n(11)\n\nsince the root has as many branches as its coordination while every other node has one branch less than its coordination\n[see section 3.1 of ref. [9] for details].\n\n\fC.\n\nTrees with bounded coordination\n\nIn [9] and [16] the geometrical and spectral properties of bounded random trees were determined using non-extinction\npreconditioning. The surface and volume probability, in the large radius limit, are shown to be function only of the\nscaled variables s/r and v/r2 , respectively. Moreover, after the discussion of the auto-averaging property, also average\nsurface and volume are fully analyzed. These results allow the rigorous determination of the connectivity dimension,\nboth local and average: dc = d ̄c = 2. The study of the Gaussian model on such trees leads also to the determination\nof the spectral dimension ds = 4/3. Using a simple scaling hypothesis it is shown that the relation ds = 2dc /(dc + 1)\nshould hold on a wider class of random trees.\nAn important universality property is also found: all the average values and probability distributions in the large\nradius limit depend on the fz distribution only through its second moment or, equivalently, g ′′ (1). This parameter\nquantifies the coordination fluctuations, since\nX\ng ′′ (1) =\nfz [z − hzi]2\nz\n\nand characterizes all asymptotic behaviors. Altogether, these results can be summarized as\nv ≃ g ′′ (1) r2\n\n(12)\n\nmeaning that v/[g ′′ (1)r2 ], as r → ∞, is a random variable with a well defined universal probability distribution.\nThe approach based of the grand-canonical ensemble of branched polymers yields the result dH = dL = 2 when the\ncoordination of each node is bounded. This corresponds to the \"generic phase\" of random trees according to [6].\nD.\n\nScale-free trees\n\nIn this paper we turn to scale-free trees, that is trees whose coordination distribution has a long power–law tail:\nfz ≃ A z −β ,\n\nfor z → ∞\n\nwhere β > 2. When the coordination is unbounded, the function g(λ) may have singularities; in the scale-free case it\nbecomes singular for λ = 1. For any non-integer exponent1 its expansion contains a term proportional to (1 − λ)β−1 ,\nthat is:\ng(λ) = ga (λ) + c∗ (1 − λ)β−1\n\n(13)\n\nga (λ) = 1 − (1 − λ) + c2 (1 − λ)2 + . . . + ck (1 − λ)k + . . .\n\n(14)\n\nwhere ga (λ) is analytic in λ = 1\n\nand c∗ = A Γ(1 − β). Therefore, if 2 < β < 3, g ′′ (λ) diverges for λ → 1; since we found g ′′ (1) to be an important\nparameter in the bounded coordination case, we expect this divergence to have many important consequences. As a\nfirst example it causes the divergence of hvr (o)i, the expected volume of the balls around the root of the branching\nprocess. This can be intuitively explained, using non-extinction preconditioning, because on every shell the coordination of one node is chosen with probability distribution f ̃z , whose first moment is infinite. If auto-averaging holds,\nthen also vr would diverge on a single scale-free tree and the definition (2) of average connectivity dimension appears\ntroublesome for scale-free trees. Thus, in order to deal with finite graph-averaged quantities, we will also use the finite\nvolume approach, regarding the volume V as a regulator.\nWe may then find an heuristic argument based on eq. (12) to determine the connectivity dimensions dc and d ̄c for\nscale-free random trees. First of all, if β > 3 nothing changes because g ′′ (1) is still finite, so that dc = d ̄c = 2. On the\ncontrary, if 2 < β < 3, we have to face the divergence of g ′′ (1). But coordination fluctuations are finite for a finite\nnumber N of nodes, and diverge with N in a way fixed by the long tail of fz , since all coordination extractions are\nindependent. Let zmax (N ) be the largest coordination extracted, estimated from\n∞\nX\n\n1−β\nfz ∼ zmax\n=\n\nz=zmax\n\n1\n\n1\nN\n\nfor integer β the singularity has a different, logarithmic, form; however, since the final results will be analytic in β, one is able to extend\nthem also to integer values of β.\n\n\fthen we may estimate fluctuations by\nzmax (N )\n\nX\nz=1\n\n(z − hzi)2 fz ∼ [zmax (N )]3−β = N ν\n\nwhere we defined the exponent ν as\nν = (3 − β)/(β − 1)\nThus for the local growth we have the consistency relation\nvr ≃ vrν r2\nwhich implies\nvr ≃ r2/(1−ν) = r(β−1)/(β−2)\n\n⇒\n\ndc =\n\nβ−1\nβ−2\n\nWhen the graph-averaged vr is considered for trees of V nodes, the coordination fluctuation over the whole graph\nshould be used instead:\nvr ≃ r2 V (3−β)/(β−1)\nFrom this we read the scaling exponent 2 independently on V , but without the standard thermodynamic limit. Of\ncourse this is not a real proof and a more rigorous approach confirming these results is adopted in the following\nsections (see also Appendix A); at any rate, these exponents are the same as those calculated for scale-free branched\npolymers with 2 < β < 3 in the grand-canonical approach: dH = (β − 1)/(β − 2) [7] and dL = 2 [6].\nIII.\nA.\n\nGROWTH STATISTICS\n\nScaling probabilities for local surface and volume\n\nThe probability Pr[sr (o) = s] (Pr[vr (o) = v]) for the surface (volume) of the radius r sphere around the root of an\ninfinite tree can be found, recursively on r, using the modified probabilities given by explicit preconditioning (see [9],\nwhere a slightly different notation is used). The corresponding generating functions\nX\nGsr (λ) =\nλs Pr[sr (o) = s]\ns\n\nGvr (λ)\n\n=\n\nX\n\nλv Pr[vr (o) = v]\n\nv\n\nsatisfy functional recursion rules easier to analyze, given by equations (15) and (16) in [9], that is\nGsr+1 (λ) = λ gr+1 (λ) gr′ (λ)\nGvr+1 (λ, 1)\nhr+1 (λ)\n= λ g ′ (hr−1 (λ))\nv\nGr (λ, 1)\nhr (λ)\nwhere\ngr+1 (λ) = g(gr (λ))\nhr+1 (λ) = λ g(hr (λ))\n\ng0 (λ) = λ\nh0 (λ) = λ\n\n(15)\n(16)\n\nThese recursions involve only g(λ) and g ′ (λ), which are finite for 0 ≤ λ ≤ 1 for every value of β > 2, and therefore can\nbe solved numerically with high accuracy for any r (subject only to computational limits), thus providing a solution\nof our problem from a practical point of view. In figure 1 the r = 10 volume probability corresponding to a tree with\nβ = 2.5 is plotted against the \"experimental\" frequency distribution; this is obtained by sampling, over 1000 different\ngraph of 8 * 106 nodes each, the volume of 2000 balls centered on randomly chosen nodes. The agreement is good,\nand we notice the power law tail with exponent that can be estimated as ≃ −1.5. In other cases (not shown) this is\nalways equal to 1 − β.\n\n\fβ = 2.5,\n\nr = 10\n\n−4\n\n−6\n\nlog(p)\n\n−8\n\n−10\n\n−12\n\n−14\nPSfrag replacements\n\n−16\n2\n\n3\n\n4\n\n5\n\n6\n\nlog(v)\n\n7\n\n8\n\n9\n\n10\n\nFIG. 1: Numerically calculated volume distribution vs. simulation histogram\n\nAnalytically, upon substitution of eqs. (13) and (14) for g(λ), one can solve the recursions rules (15), (16) for the\nfirst terms of the expansions of gr (λ) and hr (λ) as λ → 1:\ngr (λ) ≃ 1 − (1 − λ) + c2 r(1 − λ)2 + . . . + c∗ r(1 − λ)β−1\nc2\nc∗\nhr (λ) ≃ 1 + r(1 − λ) + r3 (1 − λ)2 + . . . + rβ (1 − λ)β−1\n3\nβ\n\n(17)\n\nwhere only the leading order term in r is shown for every power of (1 − λ). Similarly for Gsr (λ) and Gvr (λ) one finds\nGsr (λ) ≃ 1 − 2c2 r(1 − λ) + . . . − (β − 1)c∗ r(1 − λ)β−2\n\nGvr (λ) ≃ 1 − c2 r2 (1 − λ) + . . . − c∗ rβ−1 (1 − λ)β−2\n\n(18)\n\nThrough the rules of (inverse) discrete Laplace transform, the singular terms with noninteger powers in 1 − λ determinine power law tails in the probability distributions at fixed r:\ns→∞\n\nPr[sr (o) = s] ≃ A rs−(β−1) ,\n\nv→∞\n\nPr[vr (o) = v] ≃\n\nA β−1 −(β−1)\nr\nv\nβ−1\n\nin agreement with numerical data. The local connectivity dimension dc is determined if we find scaling forms of these\nprobabilities such that, as s → ∞ or v → ∞ and r → ∞,\n\u0010 s \u0011\n1\n1 \u0010 v \u0011\nPr[sr (o) = s] ≃ dc −1 φ dc −1 ,\nPr[vr (o) = v] ≃ dc Φ dc\nr\nr\nr\nr\n\nThis means that dc must be such that Gsr (exp(−u/rdc −1 ) and Gvr (exp(−ξ/rdc ) have finite non-trivial limits for r → ∞.\nThe right scaling exponent is found by examining equation (18): if β > 3 the leading order term in (1 − λ) is the\nlinear one so that finite functions of u and ξ are obtained with\ndc = 2\n\nfor β > 3\n\n\fwhile if 2 < β < 3 the most important term is the singular one so that the correct scaling is given by\ndc =\n\nβ−1\nβ−2\n\nfor 2 < β < 3\n\n(19)\n\nIn appendix A we present all explicit calculations about the surface and volume probability distributions, for the two\ncases β > 3 and β < 3, which confirm this simple scaling analysis.\nB.\n\nFixed volume expectation values\n\nIn this section we study the local growth properties of scale-free random trees of finite volume V . We shall\nreconstruct the dependence on V of the surface and volume probability distributions from the expectation values of\nsr (o) and vr (o) and their powers. We are lead to consider expectation values over finite-size trees, regarding their\nvolume V as a regulator, because the power-law tails with exponent 1−β found in the previous section for Pr[sr (o) = s]\nand Pr[vr (o) = v] imply the divergence with V of high enough moments of sr (o) or vr (o).\nLet us observe that in this context the average is made over all possible rooted trees with V nodes; this can also\nbe seen as the graph average over all nodes of an unrooted tree, which is then further averaged over all possible\nrealization of the unrooted tree, that is\nhOiV = hOiV\n\n(20)\n\nfor every observable O. In particular\nhsr (o)n iV = hsnr iV\nwith a similar relation for the volumes. No dependence on the root o survives and we shall drop it from the expectation\nvalues.\nLet us start by studying the probability Pb (V ) that any rooted tree T with V nodes is produced by the branching\nprocess without the non-extinction precondition\nPb (V ) = Pr[|T | = V ]\n\nBy the tree-producing algorithm, Pb (V ) satisfies the identity\nPb (V ) =\n\nX\nz\n\nfbz\n\nX\n\nV1 ,...,Vz\n\nδ(V − 1 −\n\nz\nX\n\nVj )\n\nj=1\n\nz\nY\n\nP (Vj )\n\nj=1\n\nwhere P (V ) = Pr[|B| = V ] is the same probability relative to a branch B, that is a tree whose root has an incoming\nlink (and z − 1 branches) and whose coordination is extracted with probability fz ; it satisfies a similar equation with\nz − 1 instead of z and fz instead of fbz :\nP (V ) =\n\nX\nz\n\nb\nThe generating functions G(λ)\n=\n\nP\n\nV\n\nfz\n\nX\n\nV1 ,...,Vz−1\n\nδ(V − 1 −\n\nPb (V )λV and G(λ) =\n\nG(λ) = λ g(G(λ))\n\n,\n\nP\n\nV\n\nz−1\nX\nj=1\n\nVj )\n\nz−1\nY\n\nP (Vj )\n\nj=1\n\nP (V )λV satisfy\n\nb\nG(λ)\n= λ gb(G(λ))\n\nwhere g(λ) is the usual probability generating function defined in equation (9), while\nX\ngb(λ) =\nλz fbz\n\n(21)\n\nz\n\nNormalization of fbz implies b\ng (1) = 1 and from the definition easily follows that gb(λ) derivatives are proportional to\nthose of g(λ); more precisely we have\ngb(k) (λ) = N1 g (k−1) (λ)\n\n\fSince we are interested in the V → ∞ limit, which corresponds to λ → 1, we can use expansions (13) and (14) to\nb\nobtain the asymptotic behavior of G(λ) and G(λ).\nFor different values of β we have different situations depending on\nwhich term, the singular one or the quadratic one, is lower order.\nFor β > 3 we have\n−1/2\n\nG(λ) ≃ 1 − c2\n\n(1 − λ)1/2\n\n−1/2\nb\nG(λ)\n≃ 1 − N1 c2 (1 − λ)1/2\n\nso that, in the V → ∞, the probability Pb (V ) reads\n\n1\nPb (V ) ≃ N1 √\nV −3/2\n2 c2 π\n\nFor 2 < β < 3, instead, the singular term produces\n\n−1/(β−1)\n\nG(λ) ≃ 1 − c∗\n\n(1 − λ)1/(β−1)\n\n−1/(β−1)\nb\nG(λ)\n≃ 1 − N 1 c∗\n(1 − λ)1/(β−1)\n\nThus we have, for V → ∞\n\n−1/(β−1)\n\n−c∗\nPb(V ) ≃ N1\nV −β/(β−1)\nΓ(−1/(β − 1))\n\n(22)\n\nLet us now turn to the calculation of the expected size of a shell of radius r in trees with volume V . First of all let\nus introduce the joint probability Pbr (s, V ) that the size of the tree is V and the r-th shell has s nodes:\nPbr (s, V ) = Pr[sr (o) = s, |T | = V ]\n\nIt is related to the same probability relative to branches Pr (s, V ) as\nPbr (s, V ) =\n\nX\nz\n\nfbz\n\nX\n\nX\n\nV1 ,...,Vz s1 ,...,sz\n\nδ(V − 1 −\n\nz\nX\nj=1\n\nVj ) δ(s −\n\nz\nX\n\nsj )\n\nz\nY\n\nPr−1 (sj , Vj )\n\nj=1\n\nj=1\n\nwhile Pr (s, V ) satisfies a similar recursion which is obtained from the previous one by replacing z with z − 1 and fbz\nwith fz ,\nPr (s, V ) =\n\nX\n\nX\n\nfz\n\nz\n\nX\n\nV1 ,...,Vz−1 s1 ,...,sz−1\n\nδ(V − 1 −\n\nz−1\nX\nj=1\n\nVj ) δ(s −\n\nz−1\nX\n\nsj )\n\nj=1\n\nz−1\nY\n\nPr−1 (sj , Vj )\n\nClearly the expectation value of sr (o) on trees with V nodes is now given by\nP\nb V [s]\nsPbr (s, V )\nE\nhsr iV = s\n= r\nPb(V )\nPb (V )\n\nb V [s] is defined as the weighted sum in the first numerator. Analogously we can define E V [s] as\nwhere E\nr\nr\nX\nErV [s] =\ns Pr (s, V )\ns\n\nand the two generating functions\n\nb λ [s] =\nE\nr\n\nX\nV\n\nb V [s] ,\nλV E\nr\n\nErλ [s] =\n\ns\n\nV\n\nX\nz\n\n=λ\n\nλV ErV [s]\n\nV\n\nA recursion equation for the latter can be found using equation (23)\nX\nX\nErλ [s] =\nλV\ns Pr (s, V )\n=λ\n\nX\n\nX\nz\n′\n\nfz\n\nX\n\nX\n\nV1 ,...,Vz−1 s1 ,...,sz−1\n\nfz (z −\n\nz−1\n\u0010X\n\nk=1\n\nλ\n1)Er−1\n[s]G(λ)z−2\n\nλ\n= λ g (G(λ))Er−1\n[s]\n\nsk\n\n\u0011 z−1\nY\nj=1\n\n(23)\n\nj=1\n\nλVj Pr−1 (sj , Vj )\n\n(24)\n\n\fb λ [s] is similarly obtained\nand one for E\nr\n\nb λ [s] = λ gb′ (G(λ))E λ [s] = N1 λ g(G(λ))E λ [s]\nE\nr\nr−1\nr−1\n\nSince s0 (o) = 1, E0V [s] is equal to P (V ), so that the initial condition reads\nE0λ [s] = G(λ)\nThen, for r ≥ 0, the solutions read\n\nh\nir\nErλ [s] = G(λ) λ g ′ (G(λ))\nh\ni r−1\nb λ [s] = N1 λ G(λ)g(G(λ)) λ g ′ (G(λ))\nE\nr\n\n(25)\n\nNow hsr iV can be easily found, but we have to consider the cases β > 3 and β < 3 separately.\nbrλ [s] reads\nFor β > 3 the λ → 1 asymptotic expansion of E\nh\ni\nbrλ [s] ≃ N1 1 − (2 + 2c2 (r − 1))c−1/2 (1 − λ)1/2\nE\n2\nwhich imply the large V limit of hsr iV\n\nhsr iV ≃ 2 + 2c2 (r − 1)\nFor 2 < β < 3 we have, instead,\n\nand\n\nh\ni\nbrλ [s] ≃ N1 1 − (r − 1)(β − 1)c1/(β−1)\nE\n(1 − λ)(β−2)/(β−1)\n∗\nhsr iV ≃ k1 (β)(r − 1) V ν\n\n(26)\n\nwhere\n2/(β−1)\n\nk1 (β) = (β − 1)c∗\n\nΓ(−1/(β − 1))\nΓ(−(β − 2)/(β − 1))\n\nIn the first case the V → ∞ limit is finite, while the second one we find a divergence, as expected. To understand\nhow equation (26) relates with the known dc , we now calculate higher moments of sr . First of all we generalize the\nb V [O] and E\nb λ [O] to every observable O\nnotation Pbr (O, V ), E\nr\nr\nPbr (O, V ) = Pr[Or (x) = O, |T | = V ]\nX\nb V [O] =\nE\nOPbr (O, V )\nr\nO\n\nb λ [O] =\nE\nr\n\nX\nV\n\nb V [O]\nλV E\nr\n\ntogether with their branch counterparts Pr (O, V ), ErV [O] and Erλ [O]. Now it is easy to show that the recurrence rule\nbrλ [s2 ] reads:\nfor E\nλ\nλ\nbrλ [s2 ] = λ b\nE\ng ′ (G(λ))Er−1\n[s2 ] + λ gb′′ (G(λ)) (Er−1\n[s])2\n\nThus for 2 < β < 3 the second moment is found to read\n\nhs2r iV ≃ k2 (β)(r − 1) V ν+1/(β−1)\nwhere k2 (β) is some function of β only.\nλ\nbrλ [sn ] we find, as a general rule, that the single Er−1\nFor all higher moments E\n[sn ] on the right hand side is multiplied\nλ\nby λb\ng ′ (G(λ)) while the products of k Er−1\n[*] are multiplied by λb\ng (k) (G(λ)). Moreover the equations for Erλ [O] are the\n\n\fb λ [O] with b\nsame as those for E\ng(*) substituted by g(*). Therefore we obtain for all higher moments, up to the leading\nr\nterms in the λ → 1 limit,\nb λ [sn ] ≃ λ gb′ (G(λ))E λ [sn ] + . . .\nE\nr\nr−1\n\nλ\nλ\nErλ [sn ] ≃ λ g ′ (G(λ))Er−1\n[sn ] + λ g (n) (G(λ))Er−1\n[s]n + . . .\n\nThis entails the final result\n\n(27)\n\nhsnr iV ≃ kn (β)(r − 1)V ν+(n−1)/(β−1)\nwhich is compatible with a scaling form for the sr probability just given by a finite-size scaling of the one found in\nsection III A, that is\n\u0013\n\u0012\nr dc\ns\nPbr (s, V )\n1\nb\nPr (s|V ) =\n≃ dc −1 q dc −1 ,\nr\nr\nV\nPb(V )\n\nwhere dc is the already known local connectivity dimension\ndc =\n\nβ−1\nβ−2\n\nand the function q(x, y) is such that\nZ\n\nxn q(x, y)dx ≃ y (β−2−n)/(β−1)\n\nSimilarly it is possible to calculate the finite volume moments of the volume vr (o) which read:\nhvrn iV ∼ rn+1 V (n+2−β)/(β−1)\n\n(28)\n\nThe proper scaling compatible with this result is\n\u0013\n\u0012\nv r dc\n1\nb\nPr (v|V ) ≃ dc p dc ,\nr\nr\nV\n\n(29)\n\nif the moments of the scaling function p(x, y) behave as\nZ\nxn p(x, y)dx ≃ y (β−2−n)/(β−1)\nScaling (29) agrees with numerical simulations as shown in figure 2. For several different values of r and V , we\nbuilt 720 trees and calculated the volume v of radius r balls around 1000 (for each tree) randomly chosen nodes. Thus\ndifferent \"experimental\" probability distributions are found; we considered the integrated probability Qr (v|V ) =\nP\nb\nv ′ ≤v Pr (v|V ) and plotted the values of v corresponding to Qr (v|V ) = 0.1, 0.2, 0.4, 0.6, 0.8, 0.9; (after the proper\nrescaling by rdc ) versus rdc /V . For everyone of the six values of Qr (v|V ), the points corresponding to different values\nof r and V fall roughly on a curve, apart from statistical errors (fluctuations are expecially large for Qr (v|V ) = 0.9,\ndue to the long power-law tail of Pbr (v|V )), so that the form (29) of the probability scaling is supported.\nC.\n\nProbability of the average surface\n\nIn the bounded coordination case we were able to prove the auto-averaging property for every local observable: the\ngraph average O is non-fluctuating on infinite trees and coincides with the expectation value hOi in the branching\nprocess around the origin [9, 16]. This implies immediately that local and average connectivity dimensions coincide.\nIn the scale-free case the situation is more involved because many relevant expectation values do not even exist on\ninfinite trees, so that we cannot prove the auto-averaging property in the same way. Thus, to determine the average\nconnectivity dimension d ̄c we will try to directly investigate the probability distribution of the average surface sr in\nthe large r limit. In particular, we look for a scaling form of the type\n\u0012\n\u0013\ns\n1\nPr[sr = s] ≃ d ̄ −1 f d ̄ −1\nr c\nr c\n\n\fβ = 8/3,\n\ndc = 5/2,\n\nintegrated probability: 10% 20% 40% 60% 80% 90%\n\n−1\n\n10\n\n1000000\n2000000\n4000000\n8000000\n\n−2\n\nr dc /V\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\nPSfrag replacements\n\n−5\n\n10\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nv/r dc\nFIG. 2: Group of symbols of the same color (online version) or shade of gray (printed version) correspond to all possible\ncombinations of r = 10, 20, 30, 40, 50 (using the same symbol) and V = 1, 2, 4, 8 * 106 (using different symbols as explained in\nthe legend).\n\nA very close approach is possible also for the average volume vr , but it is more involved and will not be reported here.\nThe results of the previous section, together with equation (20), allow us to calculate only the first moment of such\nprobability distribution. We now reconstruct it (at least its scaling form) through the calculation of higher moments.\nThis can be done by introducing Sr , defined as the sum of sr (x) over all nodes x of a tree:\nX\nSr =\nsr (x)\nx∈T\n\nThen on a finite-sized tree, the average surface sr , is given by\nsr =\n\nSr\nV\n\nand its (finite volume) moments are simply obtained\nh(sr )n iV =\n\nhSrn iV\nVn\n\nThe recursive nature of the trees allows us again to find the composition rule for Sr in terms of the values of Sr,j\nand the local surface sk,j (with k < r) relative to j−th branch around the root o. It reads\n\n\nr−2 X\nX\nX\nSr,j + 2sr−1,j +\n(30)\nsk,j sr−k−2,j ′ \nSr =\nj\n\nk=0 j ′ 6=j\n\n\fThe recursion rule for the joint probability of Sr , s1 , . . . , sr−1 and V easily follows from (30) and the recursion rules\nfor sr and V . With calculations similar to those of the previous section one obtains\nλ\nb λ [S] = λ gb′ (G(λ))E λ [S] + 2λ b\nE\ng ′ (G(λ))Er−1\n[s] + λ gb′′ (G(λ))\nr\nr\n\nr−2\nX\n\nλ\nEkλ [s]Er−k−2\n[s]\n\nk=0\n\nand, as usual, the equation for Erλ [S] which is equal to this one with all gb(*) substituted by g(*). The expectation\nvalue\nhsr iV =\n\nb λ [S]\nE\nr\nV Pb(V )\n\nis then obtained by straightforward calculations in the V → ∞ limit, and the result is equal to the large V limit of\nhsr iV , as expected [recall eq. (20)].\nThe differences of course emerge when higher moments are considered, since snr 6= (sr )n for n > 1. h(sr )2 iV can be\nobtained using the equations (only the leading terms are displayed)\nb λ [S 2 ] ≃λ gb′ (G(λ))E λ [S 2 ] + . . .\nE\nr\nr\n\nErλ [S 2 ] ≃λ g ′ (G(λ))Erλ [S 2 ] + λ g ′′ (G(λ))Erλ [S]2 +\n+ λ g (4) (G(λ))\n\nr−2 X\nr−2\nX\n\nk=0\n\nλ\nλ\nEkλ [s]Ekλ′ [s]Er−k−2\n[s]Er−k\n′ −2 [s] + . . .\n\nk′ =0\n\nand turns out to read\n2\n\nh(sr ) iV ≃\n\n(\n\n(2 + 2c2 (r − 1))2\nk̄2 (β)(r − 1)2 V 2ν\n\nfor β > 3\nfor 2 < β < 3\n\nwhere k̄2 (β) does not depend on r or V .\nThen all the following moments can be calculated through the equations\nb λ [S n ] ≃ λ b\nE\ng ′ (G(λ))Erλ [S n ] + . . .\nr\n\nErλ [S n ] ≃ λ g ′ (G(λ))Erλ [S n ] + λ g ′′ (G(λ))\n+ λ g ′′′ (G(λ))\n\n1X\nn!\nE λ [S j ]Erλ [Srn−j ]+\n2 j j!(n − j)! r\n\n′\n′\nn!\n1 X\nE λ [S j ]Erλ [S j ]Erλ [S n−j−j ]+\n3! ′ j!j ′ !(n − j − j ′ )! r\n\n(31)\n\nj,j\n\n+ . . . + λ g (n) (G(λ))Erλ [S]n +\nX\nλ\nλ\n[s] + . . .\n[s] * * * Ekλn [s]Er−k\nEkλ1 [s]Er−k\n+ λ g (2n) (G(λ))\nn −2\n1 −2\nk1 ,...,kn\n\nFrom the leading singularity in 1 − λ we read their asymptotic behavior for large V :\n(\n(2 + 2c2 (r − 1))n for β > 3\nn\nh(sr ) iV ≃\nk̄n (β)(r − 1)n V nν for 2 < β < 3\n\n(32)\n\nFor β > 3, since all moments are powers of the same finite quantity, the probability distribution for sr must be a\ndelta function in the V → ∞ limit\nPr[sr = s] = δ(s − (2 + 2c2 (r − 1)) = δ(s − hsr i)\nThus in the thermodynamic limit the average does not fluctuate and coincides with the expectation value for the\nsurface around the root of the tree and the auto-averaging property is verified for the observable sr . In particular we\ncan extract the average connectivity dimension\nd ̄c = dc = 2\n\n\fSimilarly the auto-averaging property can be verified for the volume; we expect it to hold in general for every observable\nwith a finite expectation value.\nWhen 2 < β < 3 instead, from eq. (32) we can read the following scaling form for the average surface probability\n\u0013\n\u0012\ns\n1\nb\n(33)\nPr (s|V ) ≃\nq\nrV ν\nrV ν\n\nThis shows that for every V there exists a scaling form of the probability distribution of s for all scale-free trees of\nsize V , but it does not have a non-trivial standard thermodynamic limit. Although sr diverges on infinite trees and\nthe standard definition of average connectivity dimension cannot be applied, we see that a V -independent probability\nexists for the \"renormalized\" average surface sV −ν and that this scales according to the average connectivity dimension\nd ̄c = 2.\nFor finite trees a comparison can be made with the definition of dL (equation (6)): since the average surface differs\nfrom the two point function only through a normalization factor\n(2)\n\ngV (r) ∝ hsr iV ∝ r\nour calculation not only confirms the value dL = 2; it also shows that this is not a property of the first moment only,\nbut it holds \"in probability\", that is for every \"generic\" scale-free random tree.\nIV.\n\nSPECTRAL DIMENSION\n\nIn order to find the (local) spectral dimension of scale-free trees, we may repeat the approach of [16] substituting\nfixed radius averages with fixed volume averages. The quantity hhφ2x ii is given by a normalized Gaussian integral over\nall variables φy , y ∈ G; if we perform all integrations except the one over φx we are left with a last integral which is\nalso Gaussian and normalized, thanks to the self-reproducing property of Gaussian integrals. Therefore we can define\nthe effective squared mass μ(x) from the width of this last integral:\nr\nZ\n2\n1\nμ(x)\n2\nhhφx ii =\ndφx φ2x e−μ(x)φx /2 =\n2π\n2μ(x)\nOn a tree produced by a branching process the rules of Gaussian integration allow us to express the effective squared\nmass of the root as a function of those of the branches [16].\nX\n\nμ(x) = μ0 +\n\ny branches\nof x\n\nμ(y)\n1 + μ(y)\n\n(34)\n\nSimilarly the effective squared mass of a branch can be expressed as a function of those if its sub-branches, in a\nrecursive way. Since the recursion rule for μ(x) is highly nontrivial we are not able to find directly its probability\ndistribution or its moments; instead we expand μ(x) in powers of μ0 and we consider the coefficients Vn\nμ(x) =\n\n∞\nX\n\n(−1)n+1 Vn (x)μn0\n\nn=1\n\nSubstituting this expansion in equation (34), recursion rules for the cofficients are obtained:\nX\nV1 (x) = 1 +\nV1 (y)\nV2 (x) =\n\nX\n\ny branches\nof x\n\ny branches\nof x\n\ni\nh\nV2 (y) + V1 (y)2\n\nand, in general\nVn (x) = δn,1 +\n\nX\n\ny branches\nof x\n\n\u0002\n\u0003\nVn (y) + Fn (V1 (y), V2 (y), . . . , Vn−1 (y))\n\n\fwhere Fn is explicitly given in appendix B. The important feature which allows the calculation of Vn moments is\nthat the expression of Vn (x) is linear in the Vn (y).\nClearly V1 is just the volume V so that\nhV1 iV = V\n\nhV1n iV = V n\n\nand\n\nb V [*], E\nb λ [*],\nNow we need the averages hVn iV for n ≥ 2. We use the same notation as in the previous sections (Pb(*), E\nP (*), . . . ) with the only difference that now observables do not depend on r.\nb λ [V2 ] and E λ [V2 ] can be easily obtained in the same\nLet us start with the expectation value of V2 ; equations for E\nway as before\nh\ni\nb λ [V2 ] = λ gb′ (G(λ)) E λ [V2 ] + E λ [V 2 ]\nE\n1\nh\ni\nE λ [V2 ] = λ g ′ (G(λ)) E λ [V2 ] + E λ [V12 ]\n(35)\nh\ni−1\nλ g ′ (G(λ))E λ [V12 ]\n= 1 − λ g ′ (G(λ))\nThis is valid for any fz distribution, but now the 2 < β < 3 and β > 3 cases must be examined separately.\nWhen 2 < β < 3 we can read the asymptotic behavior of hV2 i from the leading 1 − λ singularity in equation (35):\nhV2 iV =\n\nb V [V2 ]\nE\n∼ V (3β−4)/(β−1)\nPb (V )\n\n,\n\nV →∞\n\nIn a similar way it can be proved that (see appendix B for details):\nhVn iV =\nWe can then write\n\nb V [Vn ]\nE\n∼ V 1+(n−1)(2β−3)/(β−1)\nPb (V )\n\n,\n\nV →∞\n\n\u0011\n\u0010\nhμiV ≃ μ0 V F1 μ0 V (2β−3)/(β−1)\n\n(36)\n\n(37)\n\nThe existence of the thermodynamic limit[13] requires that F1 (t) ∼ t−(β−1)/(2β−3) for t → ∞ so that the powers of\nV cancel out and a finite limit is obtained. After the V → ∞ limit, for μ0 → 0 we have (see section 5 of [16] for a\ndiscussion on the order of the limits)\n(β−2)/(2β−3)\n\nhμi∞ = lim hμiV ∝ μ0\nV →∞\n\n,\n\nμ0 → 0\n\nEquation (B3) in appendix B can be used to show that the higher moments of μ follow similar scaling laws:\n\u0011\n\u0010\nhμn iV ≃ μn0 V n Fn μ0 V (2β−3)/(β−1)\n\nso that\n\nn(β−2)/(2β−3)\n\nhμn i∞ ∼ μ0\n\n,\n\nμ0 → 0\n\nSince all moments are proportional to powers of the same quantity, we can say that there exists a limit probability\n−(β−2)/(2β−3)\nso that the local spectral dimension reads:\ndistribution for the scaled variable μμ0\nds = 2\n\nβ−1\n2β − 3\n\nfor 2 < β < 3\n\nWhen β > 3 equation (35) allows us to write\nhV2 iV =\n\nb V [V2 ]\nE\n∼ V 5/2\nPb (V )\n\n,\n\nV →∞\n\nAll other moments are calculated in appendix B and, following the same steps as before, we can write\nn/3\n\nhμn i∞ ∼ μ0\n\n,\n\nμ0 → 0\n\n\fso that\nds =\n\n4\n3\n\nfor β > 3\n\nas in the bounded coordination case[16].\nFinally we notice that in both cases the relation\nds = 2\n\ndc\ndc + 1\n\nbetween the connectivity and the spectral dimension is fulfilled.\nAPPENDIX A: DETAILS ON PROBABILITY DISTRIBUTIONS\n\nIn order to find the probability distributions for surface and volume we can follow the same steps of [9]. If the\nproper scaling form of the surface and volume generating functions are substituted in their recursion rules, differential\nequations are obtained by consistency requirements. The solutions are the Laplace transform of the scaled surface\nand volume probability distributions. For β > 3 both Laplace transforms can be calculated, while for 2 < β < 3 only\nthe surface probability Laplace transform and the asymptotic behavior of the volume one can be obtained.\n1.\n\nβ>3\n\nWhen β > 3, dc is equal to 2 and we can write gr (λ) as\n\nwith the condition\n\n\u0001\na(u)\na∗ (u)\ngr e−u/r = 1 −\n+ * * * + β−2 + * * *\nr\nr\na′ (0) = 1\n\na(0) = 0 ,\n\n(A1)\n\n(A2)\n\nthat follows from gr (1) = gr′ (1) = 1 and\na∗ (u) ≃ c∗ uβ−1\n\nfor u → 0\n\n(A3)\n\nderived from equation (17). This expansion imply those of Gsr (λ) and Pr[sr (o) = s]:\n\u0001\na′ (u)\nGsr e−u/r = a′ (u) + . . . − ∗β−3 + . . .\nr\n\u0010s\u0011\n1 \u0010s\u0011\n1\nPr[sr (o) = s] = φ\n+ . . . + β−2 φ∗\n+ ...\nr\nr\nr\nr\n\n(A4)\n\nwhere φ(x) and φ∗ (x) are the inverse Laplace transforms of a′ (u) and a′∗ (u), respectively. The analytic term φ(x)\nis the same as in the bounded case; the singular term φ∗ (x), even if it is suppressed by powers of r, is essential\nin order to reproduce the power-law tail. The functions a(u) and a∗ (u) are determined by inserting equation (A1)\nin the recurrence (15), and equating the coefficients of the corresponding powers of r. Thus two coupled differential\nequations are obtained (see ref. [9] for details on the method in the case of bounded trees, when only a(u) is required):\nua′ (u) = a(u) − c2 a(u)2\n\nua′∗ (u) = (β − 2)a∗ (u) − 2c2 a(u)a∗ (u) + c∗ a(u)β−1\nThe solution of the former, obtained with the use of the initial condition (A2), reads\na(u) =\n\nu\n1 + c2 u\n\nwhile the general solution of the latter reads\na∗ (u) =\n\n\u0014\n\u0015\nc∗\nk\n1\n−\nuβ−2\nc2 (β − 4)\n(1 + c2 u)2\n(1 + c2 u)β−2\n\n\fThe value of k is found by comparison with the condition (A3) and turns out to be k = 1. The inverse Laplace\ntransforms φ(x) of a′ (u) is\nφ(x) =\n\nx −x/c2\ne\nc22\n\nwhile only the asymptotic x → ∞ behavior of φ∗ (x) can be explicitly calculated:\nφ∗ (x) ≃ A x−(β−1)\nTherefore, even if the contribution of φ∗ (x) in equation (A4) is suppressed by powers of r, it is the most important\none for large x because of its power-law tail compared with the exponential one of φ(x). Moreover, if β > 4 there\nare other lower order corrections before the singular one; however since their contribution in the Laplace transform\nGsr (exp(u/r)) is analytic for u → 0, they are exponentially vanishing for large s/r. The large s tail is therefore due to\nthe singular term.\nSimilar calculations can also be done for the volume probability. The first step consists in writing the expansion of\nhr (λ) with the proper scaling:\nhr e−ξ/r\nwith the condition\n\n2\n\n\u0001\n\n=1−\n\nb∗ (ξ)\nb(ξ)\n+ * * * + β−2 + * * *\nr\nr\n\nb(0) = 0 ,\n\nb′ (0) = 1\n\n(A5)\n\n(A6)\n\nthat comes from hr (1) = 1 and h′r (1) = r and\nb∗ (ξ) ≃\n\nc∗ β−1\nu\nβ\n\n(A7)\n\nderived from equation (17). Inserting equation (A5) in the recurrence for hr (λ) (equation (16)) and equating the\ncoefficients of corresponding powers of r, we obtain:\n2ξb′ (ξ) = b(ξ) − c2 b(ξ)2 + ξ\n\n2ξb′∗ (ξ) = (β − 2)b∗ (ξ) − 2c2 b(ξ)b∗ (ξ) + c∗ b(ξ)β−1\nTheir solutions, imposing the conditions (A6) and (A7), can be found to read:\nr\np\nξ\nb(ξ) =\ntanh c2 ξ\nc2\n!β \"\n\u0001#\nr\n√\np\nc∗\nξ\nβ − 2 2 F1 1, β/2; 1 + β/2; (tanh c2 ξ)2\n√\ntanh c2 ξ\nb∗ (ξ) =\n1−\n2ξ\nc2\nβ\n(cosh c2 ξ)2\nwhere 2 F1 (a, b; c; z) is the hyper-geometric function; in our case it can also be written as:\n2 F1 (1, b; 1 + b; z) =\n\n∞\nX\n\nb\nzn\nb\n+\nn\nn=0\n\nThe volume probability Pr[vr (o) = v] and its generating function Gvr (λ) now can be written as\n\u0012\n\u0013\n\u0001\nl∗ (ξ)\nv −ξ/r 2\n= l(ξ) 1 + . . . − β−3 + . . .\nGr e\nr\n\u0010v\u0011\n\u0011\n\u0010\n1\n1\nv\nPr[vr (o) = v] = 2 Φ 2 + . . . + β−1 Φ∗ 2 + . . .\nr\nr\nr\nr\n\n(A8)\n\nwhere Φ(x) and Φ∗ (x) are the inverse Laplace transforms of l(ξ) and l(ξ)l∗ (ξ), respectively. Probability normalization\nrequires l(0) = 1 and l∗ (0) = 0; the functions l(ξ) and l∗ (ξ) related to b(ξ) and b∗ (ξ) by the differential equations:\nξl′ (ξ) = −c2 b(ξ)l(u)\n\n2ξl∗′ (ξ) = (β − 3)l∗ (ξ) − 2c2 b∗ (ξ) + c∗ (β − 1)b(ξ)β−2\n\n\fThe solution of the former is found in [9] and reads\nl(ξ) =\n\n1\n√\n(cosh c2 ξ)2\n\nwhile for the latter we obtain\nl∗ (ξ) =\n\nc∗\nc2\n\n\u0012\n\nξ\nc2\n\n\u0012\n\u0013\nβ−1 β+1 2\ntβ−1 2 F1 1,\n;\n;t +\n2\n2\n\u0012\n\u0013\nβ\n+\n1 β+3 2\nβ\n−\n1\n;\n;t +\n+tβ+1\n2 F1 1,\nβ+1\n2\n2\n\u0012\n\u0013\u0015\nβ\n−\n2\nβ\nβ\n−tβ+1\n; t2\n2 F1 1, ; 1 +\nβ\n2\n2\n\n\u0013(β−3)/2 \u0014\n\n√\nwhere t = tanh c2 ξ. The solution l∗ (ξ) can also be written as a power series using equation (A8)\n#\n\u0012 \u0013(β−3)/2 \"\nX tβ−1+2n\nX tβ+1+2n (2n + 2)\nc∗ ξ\nl∗ (ξ) =\n(β − 1)\n+\nc2 c2\nβ − 1 + 2n\n(β + 2n)(β + 1 + 2n)\nn\nn\nfrom which we can extract the asymptotic behavior for vanishing ξ\nl∗ (ξ) ≃ c∗ ξ β−2\nThese results imply Φ(x) has an exponentially vanishing x → ∞ tail (see [9])\nΦ(x) ≃\n\nπ 2 x −π4 x/(4c2 )\ne\nc22\n\nwhile Φ∗ (x) has a power-law one\nΦ∗ (x) ≃ A x−(β−1)\nTherefore we may repeat the same consideration as in the surface probability calculation: even if Φ∗ (x) is suppressed\nby powers of r, it is the most important term for large v/r2 .\n2.\n\n2<β<3\n\nu\n\n\u0011\u0011\n\nIn this case the expansion of gr (λ) reads\n\nwith the conditions\n\n\u0010\n\u0010\ngr exp −\n\nr1/(β−2)\n\na(0) = 0\n\n=1−\n\na(u)\nr1/(β−2)\n\n+ ***\n\nand a′ (0) = 1\n\n(A9)\n\n(A10)\n\nThe surface probability distribution and its generating function Gsr (λ) can then be written as functions of scaled\nvariables as\n\u0010 s \u0011\n1\nPr[sr (o) = s] = dc −1 φ dc −1 + . . .\nr\nr\ns\ndc −1\nGr (exp(−u/r\n)) = a′ (u) + . . .\nwhere φ(x) is the inverse Laplace transform of a′ (x). As before, by substituting equation (A9) in the recurrence\nequation for gr (λ) and by equating the numerators of the subleading terms, we obtain the differential equation\nua′ (u) = a(u) − c∗ (β − 2)a(u)β−1\n\n\fThe solution, using the conditions (A10), reads\na(u) =\n\nu\n[1 + c∗ (β − 2)uβ−2 ]1/(β−2)\n\n(A11)\n\nNow, from the asymptotic behavior of a′ (u)\ni−(β−1)/(β−2)\nh\n≃\na (u) = 1 + c∗ (β − 2)uβ−2\n′\n\n(\n\n1 − c∗ (β − 1)uβ−2\n[c∗ (β − 2)]−(β−1)/(β−2) u−β+1\n\nfor u → 0\nfor u → ∞\n\nwe can determine that of the scaling function φ(x)\nφ(x) ∼\n\n(\n\nx−(β−1)\nxβ−2\n\nfor x → ∞\nfor x → 0\n\nwhich has the expected power-law behavior.\nLet us now turn to the volume probability. The conditions hr (1) = 1 and h′ (r) = r lead to the the expansion\n\u0001\nb(ξ)\nhr exp(−ξ r−dc ) = 1 − dc −1 + * * *\nr\n\nwith\n\nb(0) = 0 ,\n\nb′ (0) = 1\n\n(A12)\n\nThe differential equation for b(ξ) is found by substituting this expansion in the recurrence (16); it reads\n(β − 1)ξb′ (ξ) = b(ξ) − c∗ (β − 2)b(ξ)β−1 + (β − 2)ξ\n\n(A13)\n\nBy direct substitution one can easily verify that\nb(ξ) = (ξ/c∗ )1/(β−1)\nis a solution, but does not satisfy the second condition of equation (A12). However we obtain a separable differential\nequation if we let b(ξ) = ξ 1/(β−1) b̄(ξ)\nb̄′ (ξ) =\nThe solution is now implicitly given by\n\u0012\nb̄ 2 F1 1,\n∞\nX\n\nk=0\n\n\u0001\n1\nβ−2\n1 − c∗ b̄(ξ)β−1 ξ − β−1\nβ−1\nβ\n1\n;\n; c∗ b̄β−1\nβ−1 β−1\n\n\u0013\n\nβ−2\n\n= ξ β−1\n\nβ−2\n1\nck∗ b̄1+k(β−1) = ξ β−1\n1 + k(β − 1)\n\nThis allows us to determine the asymptotic behavior of the solution b(ξ)\n(\nξ − (c∗ /β)ξ β−1 for ξ → 0\nb(ξ) ∼\nξ 1/(β−1)\nfor ξ → ∞\nThe volume probability and its scaled generating function can now be written as\nGvr (exp(−ξ/rdc )) = l(ξ) + . . .\n1 \u0010 v \u0011\nPr[vr (o) = v] = dc Φ dc + . . .\nr\nr\n\n\fwhere l(ξ) is the Laplace transform of Φ(x). As before l(0) = 1 by normalization and l(ξ) is obtained from the\ndifferential equation\nξl′ (ξ) = −c∗ (β − 2)l(ξ)b(ξ)β−2\n\n(A14)\n\nThe small and large ξ asymptotic behavior of l(ξ) can be obtained from those of b(ξ), and read\n(\n1 − c∗ ξ β−2\nfor ξ → 0\nl(ξ) ≃\n(β−2)/(β−1)\nexp(−c∗ (β − 1)ξ\n) for ξ → ∞\n\n(A15)\n\nTherefore the asymptotic behavior of Φ(x) reads\n(\nx−(β−1)\nfor x → ∞\nΦ(x) ∼\nx−β/2 exp(−kx2−β ) for x → 0\nwith\nk = c∗β−1 (β − 2)β−2\nThe probability distribution is exponentially vanishing for small volumes and it has a power law tail with exponent\n1 − β, as expected.\nAPPENDIX B: Vn MOMENTS\n\nFirst of all let us write the explicit form of Fn (V1 , V2 , . . . , Vn−1 )\nFn (V1 , V2 , . . . , Vn−1 ) =\n\nn n−1\nX\nX\n\n...\n\nk=2 n1 =1\n\nn−1\nX\n\nnk =1\n\nk\nk\n\u0011Y\n\u0010\nX\nVnj\nni\nδ n−\nj=1\n\nj=1\n\nNow we can write an expression for E V [Vn ] and its generating function E λ [Vn ] involving only V1 , V2 , . . . , Vn−1 :\noY\n\u0011Xn\nX\nX\nX \u0010\nP ({Vk,j })\nVn,j + Fn (V1,j , V2,j , . . . , Vn−1,j )\nV1,j\nδ V1 − 1 −\nE V [Vn ] =\nfz\nz\n\n=\n\nX\nz\n\nj\n\nj\n\nj\n\n{Vk,j }\n\noY\n\u0011Xn\nX \u0010\nX\nE V1,j [Vn ] + E V1,j [Fn (V1 , V2 , . . . , Vn−1 )]\nP (V1,j ′ )\nfz\nV1,j\nδ V1 − 1 −\nj\n\nV1,j\n\nE λ [Vn ] = λ\n\nX\nz\n\nj\n\nj ′ 6=j\n\nn\no\nfz (z − 1) E λ [Vn ] + E λ [Fn (V1 , V2 , . . . , Vn−1 )] G(λ)z−2\n\nn\no\n= λ g ′ (G(λ)) E λ [Vn ] + E λ [Fn (V1 , V2 , . . . , Vn−1 )]\nh\ni−1\n= 1 − λ g ′ (G(λ))\nλ g ′ (G(λ))E λ [Fn (V1 , V2 , . . . , Vn−1 )]\n\nThis shows that E λ [Vn ] is more singular than E λ [Fn (V1 , V2 , . . . , Vn−1 )], which has now to be calculated. To do this\nwe need an expression for the generic multiple moment E λ [V1k1 V2k2 * * * Vnkn ]. First of all notice that powers of V1 can\nbe extracted, that is\nE V [V1k1 V2k2 * * * Vnkn ] = V k1 E V [V2k2 * * * Vnkn ]\n\nThe recurrence rule for E λ [V2k2 * * * Vnkn ] reads\n\nn\nh\ni−1 n\nX\nk −1\nE λ [V2k2 * * * Vnkn ] = 1 − λ g ′ (G(λ))\nλ g ′ (G(λ))\nE λ [V2k2 . . . kj Vj j Fj * * * Vnkn ]+\nj=2\n\n′′\n\nλ g (G(λ))\n\nX\n\nkj,1 ,kj,2\n\n***\nλ g (N ) (G(λ))\n\nk\n\nk\n\nE λ [V2 2,1 * * * Vnkn,1 ]E λ [V2 2,2 * * * Vnkn,2 ]+\n\nX\n\nN\nY\n\nkj,1 ,...,kj,N l=1\n\nk\n\nk\n\nE λ [V2 2,l * * * Vn n,l ]\n\no\n\n(B1)\n\n\fP\nP\nwhere N = j kj , the sums over kj,l are such that l kj,l = kj , and only most singular terms are kept. Equation (B1)\ncan be recursively used; the moments on the right-hand side either involve products with fewer terms or lower j Vj 's\nso that we end with moments of V1 , which are trivial.\nThe general expression of E λ [V2k2 * * * Vnkn ] for both 2 < β < 3 and β > 3 cases\n(\nP\nj kj ((2β−3)j−β+2)]/(β−1)\n(1 − λ)[1− P\n2<β<3\nk1 k2\nλ\nkn\n(B2)\nE [V1 V2 * * * Vn ] ≃\n1\n1\nkj (3j−1)\n−2\nj\n2\nβ>3\n(1 − λ)\ncan now be proved by induction. Substituting equation (B2) in the right-hand side of equation (B1) we see that all\nterms have the same singular behavior when 2 < β < 3, while the g ′ (G(λ)) and g ′′ (G(λ)) terms are the leading order\nones for β > 3.\nThe branch probability moments just calculated are related to the tree probability ones by\nh\ni\nb λ [Vn ] = λ gb′ (G(λ)) E λ [Vn ] + E λ [Fn (V1 , V2 , . . . , Vn−1 )]\nE\n= λ gb′ (G(λ))E λ [Vn ] + . . .\n\nand\n\nb λ [V k2 * * * Vnkn ] = λ gb′ (G(λ))E λ [V k2 * * * Vnkn ] + . . .\nE\n2\n2\n\nb λ [V k1 * * * V kn ] has the same asymptotic behavior (equation (B2) as E λ [V k1 * * * V kn ]. This imply the\nTherefore E\nn\nn\n1\n1\nb V [V k1 V k2 * * * Vnkn ]\nfollowing asymptotic behavior of E\n1\n2\n( P\n[ j kj ((2β−3)j−β+2)−β]/(β−1)\n2<β<3\nb V [V k1 V k2 * * * V kn ] ≃ V 1 P\nE\nn\n2\n1\nkj (3j−1)− 23\nj\n2\nV\nβ>3\nand finally\n\nhV1k1 V2k2\n\n* * * Vnkn iV\n\n≃\n\n(\n\nV\nV\n\nP\n1\n2\n\nj kj ((2β−3)j−β+2)/(β−1)\nP\nj kj (3j−1)\n\n2<β<3\nβ>3\n\n[1] M. E. J. Newman, preprint cond–mat/0202208;\nR. Albert, A.-L. Barabasi, Rev. Mod. Phys. 74, 47 (2002).\n[2] D. Stauffer and A. Aharony, Introduction to percolation theory, Taylor & Francis, London (1994).\n[3] J. Ambjorn, B. Durhuus and T. Jonsson, Phys. Lett. B 244, 403 (1990);\nJ. Ambjorn, B. Durhuus and T. Jonsson, Quantum Geometry, Cambridge, 1997.\n[4] B. Bollobas, Random Graphs, Academic Press, New York (1985).\n[5] A.-L. Barabasi, R. Albert Science 286, 509 (1999).\n[6] Z. Burda, J. Erdmann, B. Petersson, M. Wattenberg, Phys. Rev. E 67, 026105 (2003).\n[7] Z. Burda, J. D. Correia, A. Krzywicki Phys. Rev. E 64, 046118 (2001).\n[8] S. Havlin and D. Ben–Avraham, Adv. Phys. 36 695–798 (1987).\n[9] C. Destri and L. Donetti, J. Phys. A 35, 5147 (2002).\n[10] M. Suzuki, Progr. Theor. Phys. 69, 65 (1983)\n[11] S. Alexander and R. Orbach, J. Phys. Lett. 43, 625 (1982).\n[12] R. Burioni, D. Cassi, Phys. Rev. E 51, 2865 (1995)\nD. Cassi and S. Regina, Mod. Phys. Lett. B 6, 1397 (1992).\n[13] K. Hattori, T. Hattori and H. Watanabe, Progr. Theor. Phys. Suppl. 92, 108 (1987).\n[14] K.B. Athreya, P.E. Ney, Branching Processes, Springer-Verlag, New York (1972).\n[15] H. Kesten, Ann. Inst. H. Poincaré Probab. Statist. 22, 425 (1987).\n[16] C. Destri and L. Donetti, J. Phys. A 35, 9499 (2002).\n\n(B3)\n\n\f"}