{"id": "http://arxiv.org/abs/cond-mat/0612242v2", "guidislink": true, "updated": "2006-12-12T15:06:54Z", "updated_parsed": [2006, 12, 12, 15, 6, 54, 1, 346, 0], "published": "2006-12-10T18:09:25Z", "published_parsed": [2006, 12, 10, 18, 9, 25, 6, 344, 0], "title": "Flow boundary conditions from nano- to micro-scales", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0612557%2Ccond-mat%2F0612443%2Ccond-mat%2F0612039%2Ccond-mat%2F0612552%2Ccond-mat%2F0612549%2Ccond-mat%2F0612019%2Ccond-mat%2F0612465%2Ccond-mat%2F0612600%2Ccond-mat%2F0612325%2Ccond-mat%2F0612259%2Ccond-mat%2F0612658%2Ccond-mat%2F0612558%2Ccond-mat%2F0612299%2Ccond-mat%2F0612589%2Ccond-mat%2F0612012%2Ccond-mat%2F0612583%2Ccond-mat%2F0612648%2Ccond-mat%2F0612182%2Ccond-mat%2F0612041%2Ccond-mat%2F0612681%2Ccond-mat%2F0612578%2Ccond-mat%2F0612680%2Ccond-mat%2F0612263%2Ccond-mat%2F0612271%2Ccond-mat%2F0612422%2Ccond-mat%2F0612677%2Ccond-mat%2F0612087%2Ccond-mat%2F0612237%2Ccond-mat%2F0612185%2Ccond-mat%2F0612357%2Ccond-mat%2F0612584%2Ccond-mat%2F0612431%2Ccond-mat%2F0612312%2Ccond-mat%2F0612089%2Ccond-mat%2F0612127%2Ccond-mat%2F0612452%2Ccond-mat%2F0612141%2Ccond-mat%2F0612234%2Ccond-mat%2F0612652%2Ccond-mat%2F0612161%2Ccond-mat%2F0612074%2Ccond-mat%2F0612144%2Ccond-mat%2F0612242%2Ccond-mat%2F0612545%2Ccond-mat%2F0612178%2Ccond-mat%2F0612476%2Ccond-mat%2F0612556%2Ccond-mat%2F0612666%2Ccond-mat%2F0612212%2Ccond-mat%2F0612146%2Ccond-mat%2F0612383%2Ccond-mat%2F0612122%2Ccond-mat%2F0612322%2Ccond-mat%2F0612616%2Ccond-mat%2F0612205%2Ccond-mat%2F0612135%2Ccond-mat%2F0612196%2Ccond-mat%2F0612069%2Ccond-mat%2F0612696%2Ccond-mat%2F0612290%2Ccond-mat%2F0612379%2Ccond-mat%2F0612110%2Ccond-mat%2F0612215%2Ccond-mat%2F0612394%2Ccond-mat%2F0612463%2Ccond-mat%2F0612344%2Ccond-mat%2F0612649%2Ccond-mat%2F0612384%2Ccond-mat%2F0612107%2Ccond-mat%2F0612349%2Ccond-mat%2F0612017%2Ccond-mat%2F0612586%2Ccond-mat%2F0612334%2Ccond-mat%2F0612604%2Ccond-mat%2F0612123%2Ccond-mat%2F0612260%2Ccond-mat%2F0612386%2Ccond-mat%2F0612316%2Ccond-mat%2F0612293%2Ccond-mat%2F0612395%2Ccond-mat%2F0612148%2Ccond-mat%2F0612294%2Ccond-mat%2F0612369%2Ccond-mat%2F0612136%2Ccond-mat%2F0612438%2Ccond-mat%2F0612314%2Ccond-mat%2F0612542%2Ccond-mat%2F0612323%2Ccond-mat%2F0612690%2Ccond-mat%2F0612338%2Ccond-mat%2F0612235%2Ccond-mat%2F0612694%2Ccond-mat%2F0612169%2Ccond-mat%2F0612016%2Ccond-mat%2F0612187%2Ccond-mat%2F0612688%2Ccond-mat%2F0612200%2Ccond-mat%2F0612599%2Ccond-mat%2F0612327%2Ccond-mat%2F0612094%2Ccond-mat%2F0612475&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Flow boundary conditions from nano- to micro-scales"}, "summary": "The development of microfluidic devices has recently revived the interest in\n\"old\" problems associated with transport at, or across, interfaces. As the\ncharacteristic sizes are decreased, the use of pressure gradients to transport\nfluids becomes problematic, and new, interface driven, methods must be\nconsidered. This has lead to new investigations of flow near interfaces, and to\nthe conception of interfaces engineered at various scales to reduce flow\nfriction. In this review, we discuss the present theoretical understanding of\nflow past solid interfaces at different length scales. We also briefly discuss\nthe corresponding phenomenon of heat transport, and the influence of surface\nslip on interface driven (e.g. electro-osmotic) flows.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0612557%2Ccond-mat%2F0612443%2Ccond-mat%2F0612039%2Ccond-mat%2F0612552%2Ccond-mat%2F0612549%2Ccond-mat%2F0612019%2Ccond-mat%2F0612465%2Ccond-mat%2F0612600%2Ccond-mat%2F0612325%2Ccond-mat%2F0612259%2Ccond-mat%2F0612658%2Ccond-mat%2F0612558%2Ccond-mat%2F0612299%2Ccond-mat%2F0612589%2Ccond-mat%2F0612012%2Ccond-mat%2F0612583%2Ccond-mat%2F0612648%2Ccond-mat%2F0612182%2Ccond-mat%2F0612041%2Ccond-mat%2F0612681%2Ccond-mat%2F0612578%2Ccond-mat%2F0612680%2Ccond-mat%2F0612263%2Ccond-mat%2F0612271%2Ccond-mat%2F0612422%2Ccond-mat%2F0612677%2Ccond-mat%2F0612087%2Ccond-mat%2F0612237%2Ccond-mat%2F0612185%2Ccond-mat%2F0612357%2Ccond-mat%2F0612584%2Ccond-mat%2F0612431%2Ccond-mat%2F0612312%2Ccond-mat%2F0612089%2Ccond-mat%2F0612127%2Ccond-mat%2F0612452%2Ccond-mat%2F0612141%2Ccond-mat%2F0612234%2Ccond-mat%2F0612652%2Ccond-mat%2F0612161%2Ccond-mat%2F0612074%2Ccond-mat%2F0612144%2Ccond-mat%2F0612242%2Ccond-mat%2F0612545%2Ccond-mat%2F0612178%2Ccond-mat%2F0612476%2Ccond-mat%2F0612556%2Ccond-mat%2F0612666%2Ccond-mat%2F0612212%2Ccond-mat%2F0612146%2Ccond-mat%2F0612383%2Ccond-mat%2F0612122%2Ccond-mat%2F0612322%2Ccond-mat%2F0612616%2Ccond-mat%2F0612205%2Ccond-mat%2F0612135%2Ccond-mat%2F0612196%2Ccond-mat%2F0612069%2Ccond-mat%2F0612696%2Ccond-mat%2F0612290%2Ccond-mat%2F0612379%2Ccond-mat%2F0612110%2Ccond-mat%2F0612215%2Ccond-mat%2F0612394%2Ccond-mat%2F0612463%2Ccond-mat%2F0612344%2Ccond-mat%2F0612649%2Ccond-mat%2F0612384%2Ccond-mat%2F0612107%2Ccond-mat%2F0612349%2Ccond-mat%2F0612017%2Ccond-mat%2F0612586%2Ccond-mat%2F0612334%2Ccond-mat%2F0612604%2Ccond-mat%2F0612123%2Ccond-mat%2F0612260%2Ccond-mat%2F0612386%2Ccond-mat%2F0612316%2Ccond-mat%2F0612293%2Ccond-mat%2F0612395%2Ccond-mat%2F0612148%2Ccond-mat%2F0612294%2Ccond-mat%2F0612369%2Ccond-mat%2F0612136%2Ccond-mat%2F0612438%2Ccond-mat%2F0612314%2Ccond-mat%2F0612542%2Ccond-mat%2F0612323%2Ccond-mat%2F0612690%2Ccond-mat%2F0612338%2Ccond-mat%2F0612235%2Ccond-mat%2F0612694%2Ccond-mat%2F0612169%2Ccond-mat%2F0612016%2Ccond-mat%2F0612187%2Ccond-mat%2F0612688%2Ccond-mat%2F0612200%2Ccond-mat%2F0612599%2Ccond-mat%2F0612327%2Ccond-mat%2F0612094%2Ccond-mat%2F0612475&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The development of microfluidic devices has recently revived the interest in\n\"old\" problems associated with transport at, or across, interfaces. As the\ncharacteristic sizes are decreased, the use of pressure gradients to transport\nfluids becomes problematic, and new, interface driven, methods must be\nconsidered. This has lead to new investigations of flow near interfaces, and to\nthe conception of interfaces engineered at various scales to reduce flow\nfriction. In this review, we discuss the present theoretical understanding of\nflow past solid interfaces at different length scales. We also briefly discuss\nthe corresponding phenomenon of heat transport, and the influence of surface\nslip on interface driven (e.g. electro-osmotic) flows."}, "authors": ["Lydéric Bocquet", "J. -L. Barrat"], "author_detail": {"name": "J. -L. Barrat"}, "author": "J. -L. Barrat", "arxiv_comment": "submitted to \"Soft Matter\"", "links": [{"href": "http://arxiv.org/abs/cond-mat/0612242v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0612242v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0612242v2", "affiliation": "LPMCN", "arxiv_url": "http://arxiv.org/abs/cond-mat/0612242v2", "journal_reference": null, "doi": null, "fulltext": "Flow boundary conditions from nano- to micro-scales\nLydéric Bocquet\n\narXiv:cond-mat/0612242v2 [cond-mat.mtrl-sci] 12 Dec 2006\n\nUniversité Lyon I Laboratoire de Physique de la Matière Condensée et des Nanostructures; CNRS,\nUMR 5586, 43 Bvd. du 11 Nov. 1918, 69622 Villeurbanne Cedex, France\n\nJean-Louis Barrat\nUniversité de Lyon; Univ. Lyon I, Laboratoire de Physique de la Matière Condensée et des Nanostructures; CNRS,\nUMR 5586, 43 Bvd. du 11 Nov. 1918, 69622 Villeurbanne Cedex, France\n(Dated: August 22, 2016)\nThe development of microfluidic devices has recently revived the interest in \"old\" problems associated with transport at, or across, interfaces. As the characteristic sizes are decreased, the use\nof pressure gradients to transport fluids becomes problematic, and new, interface driven, methods\nmust be considered. This has lead to new investigations of flow near interfaces, and to the conception of interfaces engineered at various scales to reduce flow friction. In this review, we discuss the\npresent theoretical understanding of flow past solid interfaces at different length scales. We also\nbriefly discuss the corresponding phenomenon of heat transport, and the influence of surface slip on\ninterface driven (e.g. electro-osmotic) flows.\n\nI.\n\nINTRODUCTION\n\nThe nature of boundary conditions of fluid at solid surfaces has been revisited over the recent years. Beyond the\nfondamental understanding of the fluid-solid dynamics,\nthe reason for such a strong interest lies in its potential\napplications in microfluidics. The driving of liquids in\never tiny channels raises a number of difficulties, one being the huge increase in hydrodynamic resistance when\nthe channel size decreases. Releasing the no-slip boundary condition at the surfaces, and thereby allowing for\nboundary slippage, would allow to bypass this stringent\nconditions by decreasing wall friction. There is therefore\na big hope to take benefit of slippage for microfluidic\napplications.\nMany experiments have been performed on the subject, with sometimes contradicting results. We refer to\nthe review of Lauga, Brenner and Stone for an exhaustive\ndiscussion of the experimental approaches to investigate\nslippage [1]. While experimental investigations focused\nfirst on slippage on bare (atomically smooth) surfaces,\nmore recent works have turned towards structured surfaces, in particular superhydrophobic surfaces, characterized by patterns at the micro- or nano-scales.\nIn this review we concentrate on the theoretical understanding and expectations for the fluid-solid boundary condition. In particular, we will discuss the relevant\ntheoretical framework for mechanisms that take place at\ndifferent scales, and lead to slippage at solid-fluid interfaces.\nII.\n\nFLOW PAST IDEAL INTERFACES/\n\nFrom a conceptual standpoint, the simplest situation\nthat can be considered is that of a semi infinite solid,\nbounded by an atomically smooth surface, in contact\nwith a liquid that occupies the second half space. By\natomically smooth, we mean for example a dense plane\n\nof a perfect crystalline lattice. The location of this lattice\nplane defines the xOy plane. The theoretical question becomes then simply to describe momentum transfer from\nthe fluid to the solid (assumed here to be at rest) in terms\nof the velocity field existing in the fluid. Let us consider\nthe case, where the fluid is undergoing a laminar, planar\nCouette flow in the x direction, e.g. driven by a second\nflat boundary far away in the z direction. In a stationary state, the stress component σxz is uniform, and the\nvelocity profile of a Newtonian fluid reads, far away from\nthe solid wall\nvx (z) = γ̇z + vs\n\n(1)\n\nThe shear stress is η γ̇, where η is the shear viscosity\nof the bulk fluid and γ̇ the shear rate. By definition,\nvs is the slip velocity. To achieve a complete hydrodynamic description of the system, a constitutive equation\ninvolving the interface has to be introduced. Such a constitutive equation is generally described as a \"boundary\ncondition\". Although we will also use this traditional vocabulary, we emphasize that it is somewhat misleading.\nIn many cases, \"boundary conditions\" are seen as auxiliary mathematical constraints that allow to solve partial\ndifferential equations. In our mind, the status of the\nconstitutive equation relative to the interface is in every\nrespect comparable to the one of the bulk equations, e.g.\n• it is a material property, involving the chemical nature of the two phases that create the ideal interface.\n• it should be amenable to the same type of microscopic justifications and statistical mechanical\ntreatments as bulk properties.\n• it can be extracted unambiguously from transport\nmeasurements.\nAs for any constitutive equation, the writing of the\ninterfacial constitutive equation involves a first step of\n\n\f2\n\nFIG. 1: Schematic representation of the definition of the slip\nlength b\n\nmodeling based on considerations of symmetry and linearity. The simplest possible relation, consistent with the\ngeneral description for newtonian fluids, assumes that the\ntangential stress exerted on the solid surface is proportional to the slip velocity, i.e.\nσxz = κvs\n\n(2)\n\nCombining (2) with the constitutive equation for the bulk\nNewtonian fluid, σxz = η∂z vx , one arrives at the so called\nNavier boundary condition\nvs =\n\nη\n∂z vx = b∂z vx\nκ\n\n(3)\n\nwhich can be used as a boundary condition (in the mathematical sense) that complements the Navier-Stokes equation inside the fluid. This boundary condition is applied\nwithin one atomic distance of the first solid plane [2],\nwhere the stress (3) acts on the solid. By construction, the \"hydrodynamic\" flow that results from using\nthis boundary condition will be identical to the actual,\nmacroscopic flow far away from the boundaries. At the\nmicroscopic level, a thin interfacial region exists in which\nthe flow may differ from the hydrodynamic calculation.\nWe insist that this region, in which the velocity field can\nbe obtained only from molecular scale studies, is not our\nmain concern here. Studies at the molecular scales may\nresult into velocity profiles that are not solution of the\nStokes equation, or need to artificially introduce a position dependent viscosity.\nThe second equality in (3) introduces the slip length\nb = η/κ. The significance of this length is illustrated in\nfigure 1, as the distance inside the solid to which the velocity profile has to be extrapolated to reach zero. The\nstandard \"no slip\" boundary condition corresponds to\nb = 0, i.e. κ → ∞. Conventionally a positive slip\nlength is associated with a positive slip velocity, while\n\na (less common) negative length would indicate an apparent change in the sign of the velocity field near the\nsolid. We emphasize that b is not an interfacial property\nin the usual sense, rather it is the ratio of a truly interfacial property, the friction κ, to a bulk property, the\nviscosity η. In particular, b is, in principle, completely\nunrelated to the width of the interfacial region alluded\nto above. All our knowledge of interfaces between solids\nand simple liquids indicates that -if critical phenomena\nare excluded- the width of the interfacial region is at most\nof a few atomic diameters. The slip length, on the other\nhand, can (theoretically) be made to diverge by going to\nthe limit of a perfectly flat (in the mathematical sense)\nsolid wall. Such a procedure, on the other hand, would\nnot significantly alter the width of the interfacial region.\nThe determination of the interfacial constitutive relation, often described as \"measurement of the slip\nlength\", has been the subject of numerous experimental [1, 3, 4, 5, 6, 7] and theoretical [2, 8, 9, 10, 11, 12, 13]\ninvestigations in the past 20 years . In spite of the experimental difficulties associated with the definition of\n\"ideal\" surfaces in experiments, the combination of increasingly accurate measurement methods and of insights\nfrom simulation and theory has produced a rather complete understanding of the \"ideal\" situation discussed\nhere. The results can be summarized as follows.\n(i) The linear relation (3) can be used to describe results for simple liquids, within the range of experimentally accessible shear rates [7]. Numerically, non linear behavior has been reported for shear rates of order\n108 s−1 for simple liquids [14].\n(ii) The friction coefficient κ, and hence the slip length\nb, depend strongly on the strength of the solid liquid\ninteractions. Early measurements [3, 4] were performed\non fluid/solid interfaces that correspond to a \"wetting\"\nsituation, with a low contact angle. These measurements\nclearly reported a \"no slip\" boundary condition, with a\nslip length smaller than the molecular dimensions.\n(iii) When the interaction between liquid and solid becomes weaker, so that the contact angle of the liquid on\nthe substrates increases, larger values of b can be measured, typically in the range 10-50 nanometers.\n(iv) Points (ii) and (iii) correspond to a general trend,\nbut there is not a unique correlation between contact\nangle and friction. Other factors, such as the crystallinity\nof the solid, do influence the friction κ [8, 15].\nThese findings can be rationalized within the context\nof a linear response theory [2, 9] (see also [16]), which\nhas been successfully compared to molecular simulations\n[9, 12]. A possible starting point is the Kubo like formula, which relates the interfacial transport coefficient\nfor momentum (i.e. the friction κ) to the integral of the\nautocorrelation function of the momentum flux (i.e. the\nforce exerted by the liquid on the solid):\nS\nκ=\nkB T\n\nZ\n\n0\n\n∞\n\ndthfx (t)fx (0)i\n\n(4)\n\n\f3\nwhere S is the surface area, and fx (t) is the tangential\nstress (force per unit area) exerted by the fluid on the\nsolid at time t in the x direction[62]. Note that this\nformula can obviously be generalized to the case where κ\nwould be anisotropic, represented by a 2 × 2 matrix, as\nwould be the case for a surface of low symmetry. We will\nlimit ourselves to the standard case of isotropic friction.\nKubo formula such as (4) cannot in general be evaluated\nanalytically. The correlation function can be computed\nin direct numerical simulations, or approximated using\nthe standard methods of liquid state theory.\nA simple approximation of the result of equation (4)\nwas derived in [9], and allows one to quantify the main\ningredients that enter the friction. The approximate expression reads\nZ ∞\nSk (q0 )\ndzρ(z)VF S (z)2\n(5)\nκ⋍\nDk kB T 0\nHere q0 is the first wave-vector of the reciprocical lattice\nof the crystalline substrate; Sk (q0 ) is the structure factor\nof the fluid evaluated for this wave-vector, in the interfacial region; Dk is a collective diffusion coefficient computed at the wave-vector q0 ; ρ(z) is the density profile of\nthe fluid perpendicular to the interface, and VF S (z) is the\ninteraction potential between a molecule in the fluid and\nthe solid wall. The physical content of the various factors\nentering (5) is clear. The structure factor describes the\nresponse of the fluid to the fixed atomic corrugation of\nthe solid wall. A large Sk (q0 ) indicates \"commensurability\" of some sort between the liquid and the solid, which\nwill increase momentum transfer. The diffusion constant\nsets, roughly, the time scale for the decay of stress-stress\ncorrelations.\nNote that when κ is divided by η to obtain 1/b, the\nproduct Dk η will be formed. For simple liquids, this\nratio is typically equal to kB T divided by a molecular\nsize σ, so that any explicit reference to the microscopic\ndynamics disappears from the resulting expression for the\nslip length.\nb⋍\n\n(k T )2\nR ∞B\nSk (q0 )σ 0 dzρ(z)VF S (z)2\n\n(6)\n\nIt is therefore expected to be independent of the fluid\nviscosity for simple liquids.\nThe last important factor is the integral, which involves the wall fluid interaction and the density profile.\nIt is through this integral, that the wetting properties of\nthe fluid with respect to the solid enter the friction κ. As\na crude approximation, let us assume that the density\nprofile consists of a layer of density ρc (the \"contact density\") within a molecular thickness σ, followed by a bulk\ndensity ρB . We moreover assume van der Waals interactions with Hamaker constant AH . Then the integral can\nbe crudely approximated by (A2H /ρB σ 2 ) × (ρc /ρB ).\nGathering the different ingredients that enter equation\n(5), it is easily seen that the only one that can display\nlarge variations is the \"contact density\", i.e. the average\n\ndensity of the liquid very close to the solid surface, typically within one molecular size, and, to some extent, the\nratio AH /kB T . Both factors go into the same direction,\nnamely large slip lengths are favored by a small liquid\nsolid interaction. However, it is Rclear that, from a di∞\nmensional viewpoint, the integral 0 dzρ(z)VF S (z)2 will\nalways remain a \"molecular\" quantity, so that the length\nscale that emerges from equation (6) is not expected to\nbecome very large unless very special state points are\nconsidered. In fact, our simulations show that the slip\nlengths that are achieved for simple Lennard-Jones models vary between a few molecular diameters and 50 to 60\nmolecular diameters, depending on the value of the interaction parameter that defines the solid liquid attraction\n(Hamaker constant). This is in very reasonable agreement, at a qualitative level, with the most recent experimental results [7].\nThe same framework may be applied to melts of short\npolymers. In this case, the substrate wave-vector q0 is\nmuch larger than the inverse radius of gyration of the\npolymer, so that the collective diffusion is measured at\nthe monomer scale : Dk is accordingly expected to be\nindependent of the molecular weight N . This predicts\nthat the ratio Dk η scales like η and increases with the\npolymer length, similar the predictions of de Gennes for\nlonger chains [17]. This prediction and the validity of Eq.\n(5) has been exhaustively verified for short polymers (up\nto 16 monomers) using Molecular Dynamics simulations\nby Priezjev and Troian [12]. The experimental situation\nmay be more complex since slippage will be strongly dependent on the polymer adsorption at the surface. Polymers also display strong nonlinear effects at moderate\nshear rates, which are not accounted for in our description, and have been extensively studied experimentally\n[18, 19] and theoretically [20].\nAnother interesting example of the use of equation (4)\nis the recent study of the influence of electrostatic effects\non the solid-liquid friction in ionic solutions [21, 22]. A\nsimple estimate of these effects based on Eq. (4) leads to\nan electrostatic friction contribution to the friction factor, varying as κ′ ∝ ηΣ2 lB , with Σ the surface charge (in\nunits of the elementary charge e), and lB = e2 /4πǫkB T\nthe Bjerrum length (with ǫ the dielectric constant). Interestingly this contribution is independent of the Debye\nlength.\nWhile the theoretical and numerical descriptions converge unambiguously, a number of experimental reports\nhave appeared over the years, that would appear to contradict either (i) or (ii) above, or both [5, 11, 23, 24].\nIn some cases, these discrepancies can be attributed to\nexperimental artefacts associated with the measurement\napparatus [7, 25]. However, another possible source of\nmisunderstandings and errors lies in the structuration effects described below. The intrinsic constitutive boundary condition discussed in this section may be rather different from what is probed in flow experiments at larger\nlength scales.\n\n\f4\nWe conclude with a brief discussion of a view of the\nsolid liquid interface which is sometimes proposed, in\nwhich the interfacial region is described as a \"film\" of\nthickness wi , formed by some interfacial fluid (or vapor)\nof viscosity ηi . Standard \"no slip\" boundary conditions\nare applied at the film boundary. A straightforward calculation shows that, within this description, the friction\nκ that enters the constitutive equation for the interface\nis given by\n\u0013\n\u0012\n1\n1\n1\nwi\n(7)\n−\n=\nκ\nηi\nη\nand the equivalent slip length is\n\u0012\n\u0013\nη\nb = wi\n−1\nηi\n\n(8)\n\nSuch a description does not have a clear microscopic\nfunding. In general, it is impossible to identify a \"phase\"\nwith distinct properties at the interface. However, it\ngives a useful insight into the sensitivity of interfacial\ntransport parameters to the structure of the interface.\nFor example, assuming that the viscosity ηi is that of a\nvapor layer, it is easily shown that a slip length of 20nm\ncorresponds to an interface thickness of just 0.25 nm (for\nwater), hardly the size of a single molecule. Clearly this\n\"layer\" cannot correspond to a real phase, but is merely\na very schematic representation of the depletion close to\nhydrophobic solid walls.\n\nIII.\n\nCLIMBING THE STRUCTURATION SCALE\nA.\n\nEffective slippage on patterned surfaces\n\nThe situation of an atomically smooth surface, as described in the previous paragraph, involves basically two\nlengths scales : the microscopic scale, l, characterizing\nthe liquid-solid interface, typically of the order of the\natomic size; and the macroscopic size L, corresponding\nto the flow scale, e.g. the size of the channel in which the\nflow is conducted.\nIntermediate scales may however be present, for example when the surface exhibits large scale structuration, associated with roughness or chemical patterns on\na scale L. Assuming a scale separation between the different lengths, l ≪ L < L, the microscopic information\nassociated with the liquid-solid dynamics may be integrated out and summarized in the local slip length on the\npatterned surface. In this case, the hydrodynamic quantities, velocity profile and pressure, do obey the Stokes\nequation, complemented by the local Navier condition\nwith local slip lengths {b} (of order l) at the interface.\nOnce the solution of this set of equations has been\ncalculated, it is possible to define an effective boundary\ncondition, by integrating out the intermediate scale L.\nThis introduces an effective slip length beff , which may\n\nbe defined in terms of the friction force Ff on the solid\ninterface and an averaged slip velocity hVs i, as :\nFf = −A η\n\nhVs i\nbeff\n\n(9)\n\nThe averaged slip velocity hVs i is computed in a given\nplane parallel to the interface and the effective slip length\nwill thus depend on the specific choice for the location of\nthis plane (e.g., top, bottom or mean of the roughness).\nThis definition of beff integrates out the modulation\nof the surface at the scale L. The effective slip length,\nbeff , thus defines the effective boundary condition for the\nvelocity profile v, at scales larger than L :\nvs = beff ∂z vx\n\n(10)\n\nThe friction force on the surface can be obtained from\nthe pressure P and viscous stress tensor σ at the solid\ninterface ∂Σ :\nZ\n\u0001\n−P I + σ * dS\nFf =\n(11)\n∂Σ\n\nwith I the unit tensor. From the previous definition, the\ncalculation of the effective slip length therefore reduces\nto the resolution of the initial (pure) hydrodynamic problem, involving the evaluation of the hydrodynamic velocity field and pressure fields. These fields are obtained\nfrom Stokes equation, complemented by the local boundary condition on the interface, with local slip lengths {b}.\nAs a first example of such a procedure we consider the\nsimple case of flow past a wavy solid surface. For simplicity we consider a flow velocity perpendicular to the modulation of the surface, so that the situation is effectively\ntwo dimensional. The effective slip length is obtained in\nterms of the geometrical parameters of the interface, the\nperiod λ = 2π/q and amplitude u (≪ λ) of the roughλ\nness : beff = 2π\nf (qu). In the case where a perfect slip\nboundary condition applies locally on the surface, one\nobtains f (qu) ∝ (qu)−2 [26], while for a local no-slip\nboundary condition on the surface, f (qu) ∝ (qu)2 [27].\nIn both cases, the effective boundary condition applies\nat the averaged position of the surface. Though simple,\nthese results provide some interesting insights into the\nnature of effective boundary condition :\n• The result for the perfectly slipping interface shows\nthat roughness inevitably decrease slippage. The\nfriction originates accordingly in the viscous dissipation as the fluid flows past the roughness pattern.\nThis result was first pointed out by Richardson [28],\nwho showed that the no-slip boundary condition\nmeasured at the macroscopic scale follows from the\nroughness of surfaces. Recent MD simulations confirm this result [6, 29].\n• On the other hand the result for a wavy surface\nwith a local no-slip boundary condition suggests\nan effective slip on a wavy no-slip surface, while an\n\n\f5\nincreased dissipation is expected on a modulated\nsurface. This is a direct consequence of the choice\nfor the position of the boundary plane, where the\neffective boundary condition applies : for the above\nresults the averaged position has been chosen. For\na boundary plane position at the bottom of the interface, the effective slip length is shifted by −u and\nthus negative, in agreement with the increased dissipation on the modulated surface. This shows that\nthe effective BC applies at some position between\nthe bottom and top of the roughness.\n• The above results applies for a single surface. If the\nflow is conducted in a channel with two confining\nsurfaces separated by a distance H, the above expressions for the effective slip lengths are modified,\nand do depend on H ! (see eg [27]). Such a dependence is exhibited when the gap size compares with\nthe roughness period H . λ. This points to the fact\nthat effective boundary condition is not a characteristic of the liquid-solid interface solely, but may\ndepend on the flow configuration when the surface\nmodulation scale L ≡ λ becomes comparable (or\nlarger) than the flow scale L ≡ H.\nB.\n\nSlippage on superhydrophobic surfaces\n\nAnother situation which has been the object of a strong\ninterest over the recent years is that of superhydrophobic\nsurfaces. These surfaces combine hydrophobicity at the\nmolecular scale with roughness at intermediate scales,\nleading to the so-called \"Lotus leaf effect\" [30]. The\nroughness amplifies the natural non-wetting caracter of\nthe surface, leading to very large contact angles - up to\n175◦ for a liquid drop on the surface. We consider here\nthe situation where the liquid surface remains at the top\nof the roughness (Cassie state). The liquid surface is\nin contact with the solid only through a small fraction\nφs of the surface, while the remaining is free-standing.\nAt the hydrodynamic level, this composite surface leads\nto a spatially dependent boundary condition with a noslip boundary condition on the real solid-liquid interface\n(with fraction φs ), while the remaining surface is characterized by a perfect slip boundary condition (b = ∞) on\nthe liquid-vapor interface.\nAlthough the hydrophobicity of the surface at the\nmolecular scale tends (according to the discussion of section II) to increase the slip length at small scale, the essential role of hydrophobicity is here a structural rather\nthan dynamical one. The rough hydrophobic surface replaces part of the liquid solid interface with a stress free\nliquid vapour interface.\nThis problem has been first tackled theoretically by\nPhilip [31] and more recently by Lauga and Stone [32] and\nCottin-Bizonne et al. [33]. Several numerical approaches\nhave also been proposed either at the molecular scale,\nusing molecular dynamics [34], or at larger mesoscopic\n\nFIG. 2: Schematic representation of a surface patterned with\nnanoposts, and equivalent representation in terms of flow\nboundary conditions.\n\nscales using finite element methods, Lattice Boltzmann\nor phase field models [35, 36, 37]. For a pattern composed\nof stripes, the expression for the effective slip length beff\ndepends on the direction of the flow. For a flow parallel\nto the stripes, beff reads :\nbeff =\n\nL\n1\nlog(\n)\nπ\nπ\ncos[ 2 (1 − φs )]\n\n(12)\n\nFor a flow in the direction perpendicular to the flow, the\nresult is given by the above expression divided by a factor\n2. These expressions exhibit a weak (logarithmic) dependency on φs . In practice, the logarithmic term only varies\nin the interval [0.4; 1.0] for φs between 0.1 and 5%, i.e.\nfor feasible surfaces.\nAt a qualitative level, the theoretical results for the\nstripes can be summarized by stating that the effective\nslip length beff essentially saturates at the value fixed by\nthe lateral scale of the roughness L, with an unfavorable\nprefactor (1/(2π) in Eq. (12)). For example Eq. (12)\nshows that a slip length larger than the period of the\npattern, beff = L, is obtained only when φs ≤ 10−3 . A\nlarge slippage is therefore difficult to obtain within the\nstripe geometry.\nAnother, more 'natural', geometry is that of a pattern\nof posts (see figure 2). In this case the hydrodynamic\nmodel consists in assuming a flat interface with a no-slip\nBC on the top of the posts, while the remaining of the\nsurfaces obeys a shear-free BC.\nNo analytical resolution of Stokes equation with this\nset of boundary conditions has been performed up to\nnow. However a simple 'scaling' argument accounts for\nthe effective slip length in the limit of a small fraction\nφs of solid zones [38]. The friction force on the surface\nreduces to the force on the solid zones Ff = Aφs η γ̇s ,\nwith γ̇s the averaged shear rate on the solid patch. To\nestimate γ̇s , one may note that the velocity profile in the\nliquid is influenced by the solid zones only in a region\nof their size, a, in all directions : this behavior is due\n\n\f6\nto the Laplacian character of the Stokes equation obeyed\nby the fluid velocity. One therefore expects γ̇s ∼ U/a,\nwhere U is the slip velocity of the fluid on the free slip\nzones. Therefore F ≃ Aφs ηU/a. Now the effective slip\nlength is defined by Ff = AV /beff , with V ≈ U the slip\nvelocity. One therefore deduces, in the limit φs → 0,\nbeff ∝\n\na\n.\nφs\n\n(13)\n\nFor a pattern made √\nof individual posts, φs = (a/L)2 ,\nand beff ∼ L2 /a ∼ L/ φs . A numerical resolution of the\nStokes equation with a pattern of no-slip square dots confirms the validity of the heuristic argument above in the\nlimit of small φs (basically φs < 40%) [38]. It moreover\ngives the prefactor of the predicted relationship, which is\nvery close to 1/π, so that [38] (in the limit φs → 0):\nbeff ≃\n\n1 L\n√\nπ φs\n\n(14)\n\nThis simple prediction would deserve an analytical justification, which has not been performed up to now.\nWe note that the above argument is independent of\nthe geometry of the pattern - posts or stripes - and one\nshould recover the expression in Eq. (12) for stripes.\nFor solid zones made of stripes, we have φs = a/L, so\nthat beff ∼ L : up to slowly varying logarithmic terms,\nthis is in good agreement with the Philip-Lauga-Stone\nprediction, beff ∼ L/ log(1/φs ). As we emphasized above,\nin this geometry, the effective slip length is mainly fixed\nby the roughness period, L.\nFrom the experimental point of view, several experimental studies have been conducted to measure slippage effects on superhydrophobic surfaces. Using pressure drop experiments, Rothstein and coworkers have reported slip lengths in the micron range on patterns of\nstripes [39, 40], with periodicity of the stripe in the tens\nof microns range (up to 150μm). Experiments are in good\nagreement with the prediction of hydrodynamic model\nof Philip [31]. More recently Choi et al. performed slip\nmeasurements on the same geometry but with nanoscale\npatterns [41], showing a slip length of a few hundred of\nnanometers, again in agreement with theoretical hydrodynamic predictions.\nOn surfaces made of a pattern of pillars and using rheological measurements, Choi and Kim [42] reported slip\nlengths in the tens of micron range on a surface made of\nnanoposts, beff ≃ 20μm for water. The expression for√the\nslip length on dilute posts derived above, beff ≃ π1 L/ φs ,\nrequires a very small solid fraction in their case to reach\na 20μm slip length (with L ∼ 1μm) : φs ∼ 0.03%. The\ncontact angle on such surfaces with ultra-low solid fractions is expected to be very close to 180◦: with this solid\nfraction a contact angle of 179◦ i sexpected, on the basis of the Cassie relationship [43], and assuming a contact angle of θ0 = 110◦ on the solid posts. Contact angles ∼ 180◦ are indeed reported by Choi and Kim for\ntheir 'nanoturf' surface [42]. Note that the slip length is\n\nstrongly dependent on the solid fraction in this regime\n: for example a slip length of 4.5μm is predicted for a\nsolid fraction of φs = 0.5%, corresponding to a contact\nangle of 175◦ . More recently, and using also rheological\nmeasurements, Truesdell et al. report huge slippage (in\nthe millimeter range) for surfaces with a strip geometry\n[44], while φs ∼ 50% in their case. This result is at odds\nwith theoretical expectations and would require further\nverifications. This points to the experimental difficulties to measure slippage effects inherent to rheological\nmeasurements, see Ref. [45]. Eventually, we mention\nthe results of Joseph et al. who measured slip length on\nsuperhydrophobic carbon nanotube carpets using microparticle velocimetry (μ-PIV)measurements. Slip lengths\nin the micron range are found and measured to be proportional to the underlying pattern period L (with fixed\nsurface fraction of solid φs ∼ 0.15 in their case) [46]. This\nresults is in full agreement, both qualitative and quantitative, with theoretical predictions of Eq. (14).\nAs an overall conclusion, these results and predictions\ndo show that very large slip lengths may be obtained\nonly at the expense of important efforts to obtain nanoengineered surfaces with very small solid fraction. Typically, slip length larger than tens of microns are expected\nonly with micro-patterned surfaces for which the measured contact angle is larger than 178◦ . This is a very\nstringent condition.\nC.\n\nEffective boundary condition on porous surfaces\n\nIn this context, it is interesting to point out the differences and similarities between our approach of ideal or\nstructured interfaces and the approach used in the field\nof porous media. Effective slip boundary conditions at\nthe interface between a bulk liquid and a porous media\nhave been introduced empirically by Beavers and Joseph\n[47, 48, 49], and strongly resemble equation (2). They\ncan be justified on the basis of matching a Brinkman\ndescription of the flow field in the porous media\nηe f f ∇2 v − ∇P =\n\nη\nv\nK\n\n(15)\n\nwith the standard Stokes flow in the fluid. The resulting\nboundary condition is\nr\nηef f /η\n(vx (0) − U )\n(16)\n∂z vx (0) =\nK\nwhere K is the permeability of the porous medium, and\nU = −K∇P is the drainage velocity deep inside the\nporous wall. This condition is often empirically modified to account for variations in the local permeability or\nviscosity near the interface [49]. From a conceptual viewpoint, this approach is different from the one described in\nsection II, as it does not attribute physical properties to\nthe interface. Rather, the usual hydrodynamic approach\nis used everywhere, with particular approximations relevant to porous media. The approach described in the\n\n\f7\npresent section is somewhat closer in spirit, with the difference that it uses essentially exact results to describe\nthe flow in the interfacial region.\nIV.\n\nANALOGY WITH THERMAL BOUNDARY\nCONDITIONS\n\nAn interesting analogy can be established between the\nflow of a fluid past a solid interface [50], and the flow\nof heat (or energy) transport across an interface. Let\nus consider two media (1 and 2) separated by an ideal\nplanar interface perpendicular to the z axis, and a steady\nheat flux J = Jez perpendicular to the interface. Each\nmedium is assumed to be described by Fourier's law, with\nconductivity κi . The temperature profile in medium i is\nlinear\nTi (z) =\n\nJ\nz + Ti (0)\nκi\n\n(17)\n\nThe temperature jump at the interface, T1 (0) − T2 (0), is\nthe exact analog of the slip velocity. Again, note that\nTi (0) can be defined unambiguously as extrapolations of\nthe bulk temperature field in the interface region, without\nany reference to a local temperature at the interface. A\nconstitutive equation for the interfacial region is written\nin analogy with equation (2)\nTi (0) − T2 (0) =\n\n1\nJṅ12\nRK\n\n(18)\n\nEquation (18) defines the Kapitsa resistance RK (also\nknown as thermal boundary resistance), as the transport\ncoefficient describing the thermal effect of the interface.\nIn order to complete the analogy with the slip length,\na \"Kapitsa length\" lK can be defined using a suitable\nthermal conductivity, e.g. κ1 . lK = RK κ1 is then the\nthe thickness of material 1 which is thermally equivalent\nto the interface.\nThis transport coefficient has been extensively studied\nin the context of semiconductor physics, where the resistance can be interpreted in terms of phonon scattering\nat the interface [51]. It is also well known in the field\nof superfluid liquid helium [51] (where Kapitsa originally\nintroduced the notion), where the very large conductivity\nof Helium II makes the effect particularly important. A\nKubo formula similar to (4) can be formulated and reads\n[50, 52]\nZ ∞\nS\n1\n=\ndthq(t)q(0)i\n(19)\nRK\nkB T 0\nwhere q(t) is the heat flux (per unit area) across the interface at time t, and S is the interfacial area.\nFor simple fluid/solid interfaces, the effect of the\nKapitsa resistance has attracted much less attention. In\nthe recent years a number of numerical and experimental studies have appeared, motivated in particular by the\ninterest in thermal properties of \"nanofluids\" (colloidal\n\nsolution of oxide or metallic particles). The general trend\nfrom simulation results [50, 53] is that the Kapitsa length\nwill depend on the interfacial or wetting properties in a\nway that is comparable to the slip length. A weaker\naffinity between the solid and the liquid, will result in\nhigher resistances. Other ingredients, that are irrelevant for the slip length, include the difference in acoustic\nimpedance between the liquid ans the solid [54]. Experimental studies involve transient absorption or transient\nreflectivity experiments [55, 56]. Typical values found\nfor G = 1/RK are in the range 50 − 300GW.m−2 .K−1 ,\nwith the smallest values obtained for hydrophobic interfaces in contact with water [53, 56]. This corresponds\nto a Kapitsa length (using the heat conductivity of water) of order 12nm, indeed comparable to the slip length\nat similar interfaces. If an attempt to model such a resistance through an \"equivalent vapor layer\" is made, a\nthickness of the order of one molecular size is found. This\nshows again that such transport coefficients are intrinsically interfacial properties, that cannot be assigned to\nthe existence of a different \"phase\" at the interface.\nWe are not aware of any theoretical or experimental\nstudies of heat transport across structured interfaces similar to those studied above for the slip properties. Obviously, strong effects, involving thermally driven dewetting, could be expected in the case of structured hydrophobic surfaces.\n\nV.\nA.\n\nTHE EXPECTED BENEFITS OF SLIPPAGE\npermeability and hydrodynamic dispersion\n\nOne of the reason for the recent interest in slippage is\nthat it may facilitate flows in micrometric chanel, e.g. for\nmicrofluidic purposes. A simple calculation shows that\nfor a pressure drop flow in a slit with thickness h and\nslip length b on the surfaces, the mean velocity is increased by a factor 1 + 6b/h as compared to the no-slip\nsurfaces [63]. Slippage thus increases the permeability\nof channels and porous materials. A second interesting\nproperty of slip flows is the reduction of hydrodynamic\ndispersion of a probe transported in the channel using\na pressure drop flow. This dispersion originates in the\nvanishing velocity at the surface, while it is maximum\nin the middle of the channel. For slipping surfaces, the\nvelocity does not vanish at the surface, thereby reducing the difference between the maximum and minimum\nvelocities. A criterium for dispersion may be defined as\n∆v = (vmax − vmin )/vmax , which for a slipping channel\nequals ∆v = (1 + 4b/h)−1 .\nFor both phenomena, the efficiency of slippage is determined by the ratio b/h. This shows that micrometric\nslip lengths have to be reached for the slippage effects\nto be relevant for microfluidic purposes. As discussed\nabove, this requires a specific engineering of the surfaces\nsince slip lengths on bare surfaces are well below the micron (b ∼ 20nm for water on hydrophobic surfaces). For\n\n\f8\n\nFIG. 3: Schematic representation of electro-osmotic flow past\na slippery surface.\n\nexample, for a channel with size H ∼ 10μm and a slip\nlength b ∼ 20nm, the increase of permeability is of order\nof one percent ! For a slip length b ∼ 2μm as measured\ne.g. in [46], this permeability is more than twice its value\nfor no-slip surfaces.\n\nfrom the competition between the attraction of ions at\nthe charged surface and entropic effects. Its typical size\nλD depends on the salt concentration in the liquid, and\nis of the order of a few nanometers : λD ∼ 3nm for a concentration of salt of 10−2 molar. The interfacial Debye\nlayer is electrically charged, while the remaining bulk solvent is electrically neutral. Therefore, when applying an\nelectric field, the electric driving force is located within\nthe Debye layer only. The driving force per unit surface acting on the liquid thus writes fe = σE with σ the\ncharge of the Debye layer, which is exactly opposite to the\nsurface charge σ ≃ ǫV0 /λD , for weak surface potentials\nV0 . This leads to fe ≃ −ǫ λVD0 E. Now the electro-osmotic\nvelocity results from the balance between this electric\ndriving force in the Debye layer and the viscous stress at\nthe surface. For a no-slip boundary condition, the latter is fη ∼ ηvEO /λD , since the velocity varies on a scale\ngiven by the Debye length. If slippage is exhibited at the\nsurface, the velocity varies on the size λD + b and the\nviscous stress becomes accordingly fη = ηvEO /(λD + b),\nlower than for the no-slip BC. Gathering these results we\nget\nη\n\nB.\n\nInterfacial transport phenomena\n\nThe above discussion relies on the fact that the flow is\ndriven on the scale of the channel h. However alternative\nmethods do generate flows within the interfacial structure at the solid-liquid interface. Electro-osmosis, i.e.\nflow generation by an electric field, is one such example\nwhich is commonly used in microfluidics. As discussed\nin references [57, 58, 59] these interfacially driven transport phenomena are considerably amplified by surface\nslippage, even for nanometric slip length. The reason for\nthis amplification is that slip length b now compares with\nthe thickness of the interfacial structure λ, and one expects a amplification ratio for the transport of order b/λ.\nFor typical conditions, this ratio is larger than one even\nfor nanometric slip lengths and slippage strongly increase\nthe efficiency of interfacial transport phenomena.\nLet us precise the underlying mechanisms on the example of electro-osmosis. Under the application of an\nelectric field E, the solvent acquires a plug flow like velocity profile, with a velocity vEO proportional to E and\ngiven by the Smoluchowski formula :\nvEO = −\n\nǫζ\nE\nη\n\n(20)\n\nwith ǫ the dielectric permittivity of the solvent, η its\nviscosity; ζ is the Zeta potential of the surface, which is\ntraditionally assumed to match the electrostatic potential\nat the position where the velocity profile vanishes (the\nshear-plane position) [60].\nElectro-osmosis originates within the Debye layer at\nthe interface [60]. The Debye layer quantifies the width\nof the interfacial regions at a charged surface and results\n\nvEO\nV0\nE\n∼ −ǫ\nλD + b\nλD\n\n(21)\n\nThis simple argument leads to the Smoluchowski formula,\nEq. (20), and provides an expression of the zeta potential\nin the form\n\u0013\n\u0012\nb\n(22)\nζ = V0 1 +\nλD\nThis expression can be obtained using more rigourous\ndescription, see [21, 57, 59]. Molecular dynamics simulations of charge transport confirm fully this relationship\n[21, 57]. They show, furthermore, that for a non-slipping\nsurface V0 can be identified with the potential at the\nplane of shear V0 = V (zs ), with zs of the order of one\nliquid layer. As expected a strong amplification of charge\ntransport is therefore demonstrated on slipping surfaces.\nThis behaviour can be generalized to all interfacial\ntransport phenomena. As practical examples, one may\ncite diffusio-osmosis and thermo-osmosis. These two phenomena correspond to the induction of a flow by the gradient of a solute concentration for the former and by a\ngradient of temperature for the latter [61]. The flow velocity for these phenomena is found to be proportional to\nthe applied gradient of the observable O under consideration (electric potential, concentration, temperature) :\n1\ndO\nvs = − ΓL.[1 + b/L].\nη\ndx\n\n(23)\n\nΓ and L defined in terms of the (equilibrium) interfacial stress anisotropy, Σeq (x, y) = σn − σt : Γ =\nR∞\nR ∞ ∂Σeq\n∂Σ\ndy. ∂O (y), and L = Γ−1 0 dy.y. ∂Oeq (y). These\n0\nquantities are length scales of the order of the range of\ninteraction of the solute with the solid surface [58]\n\n\f9\nThe origin of the phenomena thus lies in the thin interface layer of size L where the solute interacts specifically\nwith the surface. For the diffusio-osmosis phenomena,\nthe driving force is an osmotic pressure gradient within\nthe interface layer. For thermo-osmosis, this is surface\nenergy gradient induced by the temperature dependence\nof the stress anisotropy.\nFor all these phenomena, slippage again amplifies the\ntransport phenomena with a ratio b/L. Slippage, even\nnanometric, is therefore relevant to amplify interfacial\ntransport in microfluidic systems.\nVI.\n\nPERSPECTIVES\n\nIn this short review, we have tried to establish a clear\npicture of our present understanding of slippage at different scales. At the molecular scale, we consider surfaces\nas ideal and introduce an \"intrinsic\" constitutive relation\nfor the interface. The corresponding slip length depends\nstrongly on the nature of intermolecular interactions (hydrophobicity effect), but stays within \"molecular\" orders\nof magnitude, a few ten nanometers at most.\nA different picture is obtained by considering surfaces\nstructured on an intermediate scale. To describe such\nsituations, we adopt a mesoscopic view of the interface,\nin which the molecular details are hidden in a local, position dependent slip length. Such a view can be validated through molecular simulations. Hydrophobicity\neffects are essential to reduce the contact area between\nsolid and liquid, so that a significant reduction of the\nsolid-liquid friction is obtained. When this reduction is\nachieved, much larger slip lengths can be observed. The\nslip length is essentially determined by the scale of the\nsurface pattern and the surface area of the \"dewetted\"\npart, on which a perfect slip boundary condition applies\nat the local level.\nThis description at two different levels is necessary to\ndescribe the full complexity of surfaces that can now be\nengineered at a submicrometer scale, with a combination\nof local hydrophobic properties and of a complex geometric pattern. For patterns whose typical scale is much\nlarger than the intrinsic slip length, the separation of\n\n[1] E. Lauga, M. P. Brenner, and H. A. Stone, in Handbook of Experimental Fluid Dynamics, edited by C. T.\nJ. Foss and A. Yarin (Springer, 2005), chap. 15, to appear, cond-mat/0501557.\n[2] L. Bocquet and J.-L. Barrat, Phys. Rev. E 49, 3079\n(1994).\n[3] D. Y. C. Chan and R. G. Horn, J. Chem. Phys. 83, 5311\n(1985).\n[4] J.-M. Georges, S. Millot, J.-L. Loubet, and A. Tonck, J.\nChem. Phys. 98, 7345 (1993).\n[5] R. Pit, H. Hervet, and L. Léger, Phys. Rev. Lett. 85, 980\n(2000).\n\nlengths scales allows a complete decoupling between the\nmolecular and the hydrodynamic descriptions. Molecular simulations indicate that the same type of approach\nis possible, even when the length scale of the pattern and\nthe intrinsic slip length are similar.\nFrom this complete theoretical description, it is clear\nthat the control of actual flow properties through surface\nengineering necessitates a control of the surface state at\neach different scale. When such a control is achieved,\nthe flow of simple liquids appear to be relatively well\nunderstood, both experimentally and theoretically. More\ncomplex situations, such as the amplification of interface\ndriven flows by molecular slippage described in section\nV B, have not been studied experimentally in detail yet,\nbut are promising for the design of microfluidic devices.\nIn section IV we discussed the analogy between \"temperature slip\" and \"velocity slip\". Experiments and simulations have already shown that this analogy can be\nmade quantitative, at least when ideal surfaces are concerned. The role of nano-structuration of the surfaces\nfor thermal transport has not been explored up to now.\nNonlinear effects may be expected for strong heat fluxes,\nwhile cross effects between heat and momentum transport are expected to be negligible, based on symmetry\narguments.\nFinally, it could be interesting, at least from a formal\npoint of view, to extend the above discussion of heat and\nmomentum transport across an interface to diffusive mass\ntransport. The standard description assumes a local partition equilibrium at the interface, or equivalently a continuity of the chemical potential. Following the approach\noutlined here, it would seem more consistent to introduce\na discontinuity in chemical potential proportional to the\ndiffusive flux across the interface. The magnitude of this\ndiscontinuity has not, to our knowledge, be explored at\nthe molecular scale.\nAcknowledgments\n\nWe thank A. Ajdari, C. Barentin, E. Charlaix, C.\nCottin-Bizonne, P. Joseph, L. Léger, and C. Ybert for\nmany stimulating discussions.\n\n[6] C. Cottin-Bizonne, C. Barentin, E. Charlaix, L. Bocquet,\nand J.-L. Barrat, Eur. Phys. J. E 15, 427 (2004).\n[7] C. Cottin-Bizonne, B. Cross, A. Steinberger, and\nE. Charlaix, Phys. Rev. Lett. 94, 056102 (2005).\n[8] P. A. Thompson and M. O. Robbins, Phys. Rev. A 41,\n6830 (1990).\n[9] J.-L. Barrat and L. Bocquet, Faraday Discuss. 112, 119\n(1999).\n[10] M. Cieplak, J. Koplik, and J. R. Banavar, Phys. Rev.\nLett. 86, 803 (2001).\n[11] Y. Zhu and S. Granick, Phys. Rev. Lett. 87, 096105\n(2001).\n\n\f10\n[12] N. V. Priezjev and S. M. Troian, Phys. Rev. Lett. 92,\n018302 (2004).\n[13] A. Jabbarzadeh, P. Harrowell, and R. I. Tanner, J. Chem.\nPhys. 125 (2006).\n[14] P. A. Thompson and S. M. Troian, Nature 389, 360\n(1997).\n[15] P. A. Thompson, G. S. Grest, and M. O. Robbins, Phys.\nRev. Lett. 68, 3448 (1992).\n[16] E. D. Smith, M. O. Robbins, and M. Cieplak, Phys. Rev.\nB 54, 8252 (1996).\n[17] P.-G. de Gennes, Comptes rendus de l'Acadmie des Sciences 288, 219 (1979).\n[18] L. Leger, H. Hervet, G. Massey, and et al., Journal Of\nPhysics-condensed Matter 9, 7719 (1997).\n[19] R. Fetzer, M. Rauscher, A. Munch, and et al., Europhysics Letters 75, 638 (2006).\n[20] F. Brochardwyart, P. G. Degennes, H. Hervert, and et al.,\nLangmuir 10, 1566 (1994).\n[21] L. Joly, C. Ybert, L. Bocquet, and E. Trizac, Houille\nBlanche-revue Internationale De L Eau pp. 53–58 (2006).\n[22] L. Joly, C. Ybert, and L. Bocquet, J. Chem. Phys in\npress (2006).\n[23] C. Neto, D. R. Evans, E. Bonaccurso, H. J. Butt, and\nV. S. J. Craig, Reports On Progress In Phys. 68, 2859\n(2005).\n[24] E. Bonaccurso, H.-J. Butt, and V. S. J. Craig, Phys. Rev.\nLett. 90, 144501 (2003).\n[25] O. I. Vinogradova and G. E. Yakubov, Langmuir 19, 1227\n(2003).\n[26] P.-G. de Gennes, Langmuir 18, 3413 (2002).\n[27] A. D. Stroock, S. K. Dertinger, G. M. Whitesides, and\net al., Analytical Chemistry 74, 5306 (2002).\n[28] S. Richardson, J. Fluid Mech. 59, 707 (1973).\n[29] C. Cottin-Bizonne, J.-L. Barrat, L. Bocquet, and\nE. Charlaix, Nature Mat. 2, 237 (2003).\n[30] D. Quere, Reports On Progress In Phys. 68, 2495 (2005).\n[31] J. R. Philip, Z. Angew. Math. Phys. 23, 960 (1972).\n[32] E. Lauga and H. A. Stone, J. Fluid Mech. 489, 55 (2003).\n[33] C. Cottin-Bizonne, C. Barentin, E. Charlaix, L. Bocquet,\nand J. L. Barrat, European Phys. J. E 15, 427 (2004).\n[34] C. Cottin-Bizonne, S. Jurine, J. Baudry, J. Crassous,\nF. Restagno, and E. Charlaix, Houille Blanche-revue Internationale De L Eau pp. 116–119 (2003).\n[35] N. Priezjev, A. Darhuber, and S. Troian, Phys. Rev. Lett.\n71, 041608 (2005).\n[36] R. Benzi, L. Biferale, M. Sbragaglia, S. Succi, and\nF. Toschi, Mathematics Computers In Simulation 72, 84\n(2006).\n[37] J. Harting, C. Kunert, and H. J. Herrmann, Europhysics\nLett. 75, 328 (2006).\n\n[38] C. Ybert, C. Barentin, C. Cottin-Bizonne, and L. Bocquet, submitted to Physics of Fluids (2007).\n[39] J. Ou, B. Perot, and J. P. Rothstein, Phys. Fluids 16,\n4635 (2004).\n[40] J. Ou and J. P. Rothstein, Phys. Fluids 17 (2005).\n[41] C. H. Choi, U. Ulmanella, J. Kim, C. M. Ho, and C. J.\nKim, Phys. Fluids 18 (2006).\n[42] C. H. Choi and C. J. Kim, Phys. Rev. Lett. 96 (2006).\n[43] M. Callies and D. Quere, Soft Matter 1, 55 (2005).\n[44] R. Truesdell, A. Mammoli, P. Vorobieff, and et al., Physical Review Letters 97, 044504 (2006).\n[45] L. Bocquet, P. Tabeling, and S. Manneville, Physical Review Letters 97, 109601 (2006).\n[46] P. Joseph, C. Cottin-Bizonne, C. Y. J.-M. Benoı̂t,\nC. Journet, P. Tabeling, and L. Bocquet, Phys. Rev. Lett.\n97, 156104 (2006).\n[47] D. D. Joseph, Journal Of Applied Mechanics 33, 753\n(1966).\n[48] G. S. Beavers, Journal Of Fluid Mechanics 30, 197\n(1967).\n[49] B. Goyeau, D. Lhuillier, D. Gobin, and et al., International Journal Of Heat And Mass Transfer 46, 4071\n(2003).\n[50] J. L. Barrat and F. Chiaruttini, Molecular Physics 101,\n1605 (2003).\n[51] E. T. Swartz and R. O. Pohl, Reviews Of Modern Physics\n61, 605 (1989).\n[52] L. Puech, G. Bonfait, and B. Castaing, Journal Of Low\nTemperature Physics 62, 315 (1986).\n[53] H. A. Patel, S. Garde, and P. Keblinski, Nano Letters 5,\n2225 (2005).\n[54] M. Vladkov and J. L. Barrat, Nano Letters 6, 1224\n(2006).\n[55] O. M. Wilson, X. Y. Hu, D. G. Cahill, and et al., Physical\nReview B 66, 224301 (2002).\n[56] Z. B. Ge, D. G. Cahill, and P. V. Braun, Physical Review\nLetters 96, 186101 (2006).\n[57] L. Joly, C. Ybert, E. Trizac, and L. Bocquet, Phys. Rev.\nLett. 93 (2004).\n[58] A. Ajdari and L. Bocquet, Phys. Rev. Lett. 96 (2006).\n[59] H. Stone, A. Stroock, and A. Ajdari, Ann. Rev. Flu.\nMech. 36, 381 (2004).\n[60] R. J. Hunter, Foundations of colloid science (Oxford\nUniv. Press, Oxford, 2001), 2nd ed.\n[61] J. L. Anderson, Annual Review Of Fluid Mechanics 21,\n61 (1989).\n[62] A matrix generalization of 4 is easily obtained for\nanisotropic surfaces.\n[63] A factor 1 + 8b/h is found for a cylindrical channel\n\n\f"}