{"id": "http://arxiv.org/abs/cond-mat/0001102v1", "guidislink": true, "updated": "2000-01-10T11:59:59Z", "updated_parsed": [2000, 1, 10, 11, 59, 59, 0, 10, 0], "published": "2000-01-10T11:59:59Z", "published_parsed": [2000, 1, 10, 11, 59, 59, 0, 10, 0], "title": "Combined He-atom scattering and theoretical study of the low energy\n  vibrations of physisorbed monolayers of Xe on Cu(111) and Cu(001)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0411048%2Ccond-mat%2F0411629%2Ccond-mat%2F0411064%2Ccond-mat%2F0411645%2Ccond-mat%2F0411118%2Ccond-mat%2F0411096%2Ccond-mat%2F0411304%2Ccond-mat%2F0411347%2Ccond-mat%2F0411265%2Ccond-mat%2F0411620%2Ccond-mat%2F0411097%2Ccond-mat%2F0411510%2Ccond-mat%2F0411455%2Ccond-mat%2F0411424%2Ccond-mat%2F0411433%2Ccond-mat%2F0411456%2Ccond-mat%2F0411188%2Ccond-mat%2F0411375%2Ccond-mat%2F0411180%2Ccond-mat%2F0411009%2Ccond-mat%2F0411396%2Ccond-mat%2F0411500%2Ccond-mat%2F0411698%2Ccond-mat%2F0411073%2Ccond-mat%2F0411040%2Ccond-mat%2F0411517%2Ccond-mat%2F0411020%2Ccond-mat%2F0411420%2Ccond-mat%2F0411574%2Ccond-mat%2F0411008%2Ccond-mat%2F0411624%2Ccond-mat%2F0411627%2Ccond-mat%2F0411557%2Ccond-mat%2F0411331%2Ccond-mat%2F0411520%2Ccond-mat%2F0411749%2Ccond-mat%2F0411381%2Ccond-mat%2F0411603%2Ccond-mat%2F0411125%2Ccond-mat%2F0411151%2Ccond-mat%2F0411592%2Ccond-mat%2F0411266%2Ccond-mat%2F0411422%2Ccond-mat%2F0411007%2Ccond-mat%2F0001123%2Ccond-mat%2F0001102%2Ccond-mat%2F0001262%2Ccond-mat%2F0001387%2Ccond-mat%2F0001317%2Ccond-mat%2F0001158%2Ccond-mat%2F0001045%2Ccond-mat%2F0001252%2Ccond-mat%2F0001191%2Ccond-mat%2F0001295%2Ccond-mat%2F0001244%2Ccond-mat%2F0001455%2Ccond-mat%2F0001376%2Ccond-mat%2F0001449%2Ccond-mat%2F0001215%2Ccond-mat%2F0001259%2Ccond-mat%2F0001005%2Ccond-mat%2F0001148%2Ccond-mat%2F0001302%2Ccond-mat%2F0001047%2Ccond-mat%2F0001271%2Ccond-mat%2F0001381%2Ccond-mat%2F0001306%2Ccond-mat%2F0001032%2Ccond-mat%2F0001210%2Ccond-mat%2F0001400%2Ccond-mat%2F0001220%2Ccond-mat%2F0001101%2Ccond-mat%2F0001360%2Ccond-mat%2F0001225%2Ccond-mat%2F0001350%2Ccond-mat%2F0001207%2Ccond-mat%2F0001132%2Ccond-mat%2F0001121%2Ccond-mat%2F0001398%2Ccond-mat%2F0001017%2Ccond-mat%2F0001044%2Ccond-mat%2F0001002%2Ccond-mat%2F0001037%2Ccond-mat%2F0001116%2Ccond-mat%2F0001291%2Ccond-mat%2F0001062%2Ccond-mat%2F0001327%2Ccond-mat%2F0001334%2Ccond-mat%2F0001417%2Ccond-mat%2F0001129%2Ccond-mat%2F0001060%2Ccond-mat%2F0001012%2Ccond-mat%2F0001023%2Ccond-mat%2F0001222%2Ccond-mat%2F0001100%2Ccond-mat%2F0001298%2Ccond-mat%2F0001325%2Ccond-mat%2F0001089%2Ccond-mat%2F0001213%2Ccond-mat%2F0001167%2Ccond-mat%2F0001263&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Combined He-atom scattering and theoretical study of the low energy\n  vibrations of physisorbed monolayers of Xe on Cu(111) and Cu(001)"}, "summary": "The surface phonon dispersion curves of commensurate Xe monolayers on Cu(111)\nand incommensurate Xe monolayers on Cu(001) surfaces have been measured using\nHe atom scattering (HAS) time of flight (TOF) spectroscopy. The TOF spectra are\ninterpreted by combining quantum scattering calculations with the dynamical\nmatrix description of the surface vibrations. Both a vertically polarized\nEinstein-like mode and another, acoustic-like mode of dominantly longitudinal\ncharacter, are identified. The latter mode is characterized by the presence and\nabsence of the zone center frequency gap in the commensurate and incommensurate\nadlayers, respectively. The microscopic description of the TOF spectral\nintensities is based on the extensive theoretical studies of the interplay of\nthe phonon dynamics, projectile-surface potentials, multi-quantum interference\nand projectile recoil, and their effect on the HAS spectra. Both single and\nmulti-quantum spectral features observed over a wide range of He atom incident\nenergies and substrate temperatures are successfully explained by the theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0411048%2Ccond-mat%2F0411629%2Ccond-mat%2F0411064%2Ccond-mat%2F0411645%2Ccond-mat%2F0411118%2Ccond-mat%2F0411096%2Ccond-mat%2F0411304%2Ccond-mat%2F0411347%2Ccond-mat%2F0411265%2Ccond-mat%2F0411620%2Ccond-mat%2F0411097%2Ccond-mat%2F0411510%2Ccond-mat%2F0411455%2Ccond-mat%2F0411424%2Ccond-mat%2F0411433%2Ccond-mat%2F0411456%2Ccond-mat%2F0411188%2Ccond-mat%2F0411375%2Ccond-mat%2F0411180%2Ccond-mat%2F0411009%2Ccond-mat%2F0411396%2Ccond-mat%2F0411500%2Ccond-mat%2F0411698%2Ccond-mat%2F0411073%2Ccond-mat%2F0411040%2Ccond-mat%2F0411517%2Ccond-mat%2F0411020%2Ccond-mat%2F0411420%2Ccond-mat%2F0411574%2Ccond-mat%2F0411008%2Ccond-mat%2F0411624%2Ccond-mat%2F0411627%2Ccond-mat%2F0411557%2Ccond-mat%2F0411331%2Ccond-mat%2F0411520%2Ccond-mat%2F0411749%2Ccond-mat%2F0411381%2Ccond-mat%2F0411603%2Ccond-mat%2F0411125%2Ccond-mat%2F0411151%2Ccond-mat%2F0411592%2Ccond-mat%2F0411266%2Ccond-mat%2F0411422%2Ccond-mat%2F0411007%2Ccond-mat%2F0001123%2Ccond-mat%2F0001102%2Ccond-mat%2F0001262%2Ccond-mat%2F0001387%2Ccond-mat%2F0001317%2Ccond-mat%2F0001158%2Ccond-mat%2F0001045%2Ccond-mat%2F0001252%2Ccond-mat%2F0001191%2Ccond-mat%2F0001295%2Ccond-mat%2F0001244%2Ccond-mat%2F0001455%2Ccond-mat%2F0001376%2Ccond-mat%2F0001449%2Ccond-mat%2F0001215%2Ccond-mat%2F0001259%2Ccond-mat%2F0001005%2Ccond-mat%2F0001148%2Ccond-mat%2F0001302%2Ccond-mat%2F0001047%2Ccond-mat%2F0001271%2Ccond-mat%2F0001381%2Ccond-mat%2F0001306%2Ccond-mat%2F0001032%2Ccond-mat%2F0001210%2Ccond-mat%2F0001400%2Ccond-mat%2F0001220%2Ccond-mat%2F0001101%2Ccond-mat%2F0001360%2Ccond-mat%2F0001225%2Ccond-mat%2F0001350%2Ccond-mat%2F0001207%2Ccond-mat%2F0001132%2Ccond-mat%2F0001121%2Ccond-mat%2F0001398%2Ccond-mat%2F0001017%2Ccond-mat%2F0001044%2Ccond-mat%2F0001002%2Ccond-mat%2F0001037%2Ccond-mat%2F0001116%2Ccond-mat%2F0001291%2Ccond-mat%2F0001062%2Ccond-mat%2F0001327%2Ccond-mat%2F0001334%2Ccond-mat%2F0001417%2Ccond-mat%2F0001129%2Ccond-mat%2F0001060%2Ccond-mat%2F0001012%2Ccond-mat%2F0001023%2Ccond-mat%2F0001222%2Ccond-mat%2F0001100%2Ccond-mat%2F0001298%2Ccond-mat%2F0001325%2Ccond-mat%2F0001089%2Ccond-mat%2F0001213%2Ccond-mat%2F0001167%2Ccond-mat%2F0001263&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The surface phonon dispersion curves of commensurate Xe monolayers on Cu(111)\nand incommensurate Xe monolayers on Cu(001) surfaces have been measured using\nHe atom scattering (HAS) time of flight (TOF) spectroscopy. The TOF spectra are\ninterpreted by combining quantum scattering calculations with the dynamical\nmatrix description of the surface vibrations. Both a vertically polarized\nEinstein-like mode and another, acoustic-like mode of dominantly longitudinal\ncharacter, are identified. The latter mode is characterized by the presence and\nabsence of the zone center frequency gap in the commensurate and incommensurate\nadlayers, respectively. The microscopic description of the TOF spectral\nintensities is based on the extensive theoretical studies of the interplay of\nthe phonon dynamics, projectile-surface potentials, multi-quantum interference\nand projectile recoil, and their effect on the HAS spectra. Both single and\nmulti-quantum spectral features observed over a wide range of He atom incident\nenergies and substrate temperatures are successfully explained by the theory."}, "authors": ["A. Siber", "B. Gumhalter", "J. Braun", "A. P. Graham", "M. F. Bertino", "J. P. Toennies", "D. Fuhrmann", "Ch. Wöll"], "author_detail": {"name": "Ch. Wöll"}, "author": "Ch. Wöll", "arxiv_comment": "21 figure files (postscript)", "links": [{"href": "http://arxiv.org/abs/cond-mat/0001102v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0001102v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0001102v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0001102v1", "journal_reference": "A. Siber, B. Gumhalter, J. Braun, A.P. Graham, M.F. Bertino, J.P.\n  Toennies, D. Fuhrmann and Ch. Woll, Phys. Rev. B 59(8), 5898 (1999)", "doi": null, "fulltext": "A combined He-atom scattering and theoretical study of the low\n\narXiv:cond-mat/0001102v1 [cond-mat.mtrl-sci] 10 Jan 2000\n\nenergy vibrations of physisorbed monolayers of Xe on Cu(111)\nand Cu(001)\nA. Šiber and B. Gumhalter∗\nInstitute of Physics of the University, P.O. Box 304, 10001 Zagreb, Croatia\n\nJ. Braun, A.P. Graham, M. F. Bertino and J.P. Toennies\nMax-Planck-Institut für Strömungsforschung, Bunsenstrasse 10, D-37073 Göttingen, Germany\n\nD. Fuhrmann and Ch. Wöll\nRuhr-Universität Bochum, Lehrstuhl für Physikalische Chemie I, Universitätstrasse 150, D-44801\nBochum, Germany\n(October 28, 2018)\n\n∗ Corresponding\n\nauthor. E-mail: branko@ifs.hr\n\n1\n\n\fAbstract\n\nThe surface phonon dispersion curves of commensurate Xe monolayers on\nCu(111) and incommensurate Xe monolayers on Cu(001) surfaces have been\nmeasured using He atom scattering (HAS) time of flight (TOF) spectroscopy.\nThe TOF spectra are interpreted by combining quantum scattering calculations with the dynamical matrix description of the surface vibrations. Both\na vertically polarized Einstein-like mode and another, acoustic-like mode of\ndominantly longitudinal character, are identified. The latter mode is characterized by the presence and absence of the zone center frequency gap in the\ncommensurate and incommensurate adlayers, respectively. The microscopic\ndescription of the TOF spectral intensities is based on the extensive theoretical studies of the interplay of the phonon dynamics, projectile-surface potentials, multi-quantum interference and projectile recoil, and their effect on\nthe HAS spectra. Both single and multi-quantum spectral features observed\nover a wide range of He atom incident energies and substrate temperatures\nare successfully explained by the theory.\n\n2\n\n\fI. INTRODUCTION\n\nIn the past, investigations of physisorption potentials for particles on solid substrates as\nwell as the potentials describing interadsorbate interactions were mainly motivated by the\nexperimental studies of adsorption and phase transitions at surfaces. Several new developments have recently stimulated renewed interest. First, the possibility to manipulate and\ndisplace single atoms and molecules with low-temperature scanning tunneling microscopes\n[1,2] has not only added to our understanding of adsorbate-substrate interactions but also\nunderlined the need for more detailed microscopic data. Second, the recent progress in\nunderstanding sliding friction [3] calls for more precise information on the potential energy\nsurfaces and energy dissipation to the substrate [4]. Although physisorption energies can\nbe determined in a rather straightforward fashion using thermal desorption spectroscopy\n(TDS), information on the interparticle potentials can be only extracted indirectly, either\nthrough precise analyses of the shape of TDS-peaks or by detailed investigations of phase\ntransitions within the adsorbed adlayers [5].\nAs the interplay between adsorption and interadsorbate potentials determines the low\nenergy dynamics of adlayers, studies of physisorbed rare gas monolayers are of special interest\nin the above discussed context because of their allegedly simple vibrational properties. In\nthe present paper we describe a determination of the parameters of these potentials on the\nprototype commensurate and incommensurate physisorbed monolayers of Xe on Cu(111) and\nCu(001), respectively, by using He atom scattering (HAS) time of flight (TOF) spectroscopy\nto measure the dispersion of the low-energy adlayer-modes in combination with a theoretical\nanalysis of the scattering data. This provides direct information on the force constants\nwhich couple the adsorbates to the substrate, the effective corrugation of the potential\nenergy surface (PES) describing the motion of the particles on the substrate, and the force\nconstants coupling the adjacent adsorbates. Although the first HAS-TOF measurements on\nrare gas overlayers were carried out almost twenty years ago, these early experiments were\nonly able to detect the vertically polarized Einstein-like S-mode [6,7]. Only recently was an\n3\n\n\fadditional mode found for Xe on Cu(110) [8] and shortly thereafter also for Xe on Cu(001)\n[9], Cu(111) [10] and NaCl(001) [11] surfaces. This new mode was interpreted as being due\nto low-energy longitudinally polarized motion of the adsorbates. However, simple model\ncalculations suggest a significant discrepancy between the fits based on this assignment\n[9,10] and empirical potential models used so far to model the adsorbate-adsorbate and\nadsorbate-substrate interactions. This has created some controversy in the literature [12]\nwhich calls for a critical reassessment of the HAS data on the low energy vibrations of\nphysisorbed Xe monolayers.\nIn this paper we present the analysis of the experimental data obtained for a commen√\n√\nsurate ( 3 × 3)R30◦ Xe adlayer adsorbed on Cu(111) and a similar system, viz. the\nhexagonal incommensurate Xe adlayer adsorbed on Cu(001). Measurements are reported\non the dispersion curves and the excitation probabilities of two adlayer induced modes, the\nvertically polarized Einstein-like phonon branch over the entire surface Brillouin zone (SBZ)\nand the new in-the-surface plane polarized acoustic-like mode over the main part of the SBZ.\nIn particular, for the latter mode in Xe/Cu(111) it was possible to measure the zone-center\nphonon gap which provides particularly important information on the Xe-substrate potential\nenergy surface, and to compare this result to the recently published data on the incommensurate Xe-overlayer adsorbed on Cu(001) [9]. The first, tentative assignment of the modes\nobserved in both systems was made by combining the symmetry selection rules applicable\nto the excitation of phonons of different polarization in the single phonon scattering regime\nwith the results of lattice-dynamical analysis of the adlayers. This analysis showed that\na good agreement between theoretical and experimental dispersion curves for Xe-induced\nmodes could be obtained only with intralayer force constants derived from the Xe-Xe pair\ninteraction unexpectedly softer than the one deduced from accurate gas phase potentials\n[13] or bulk phonon data [14]. As the use of this procedure was recently questioned [12], further progress in understanding the HAS data for monolayers of Xe on Cu(111) and Cu(001)\nnecessitates resolving this controversy by carrying out a comprehensive and consistent analysis of the measured spectral features. Here we demonstrate that additional support to\n4\n\n\fthe discussed assignments, and in particular of the dominantly longitudinal character of the\nobserved acoustic mode, can be obtained by carefully examining the scattering intensities\nin the HAS TOF spectra. To this end we have performed detailed calculations of the absolute and relative excitation probabilities of the adlayer localized modes in the single and\nmultiphonon scattering regime using a recently developed theoretical approach [15,16] and\ncompared them with experimental HAS TOF intensities. A good agreement of the results\nof calculations with the experimental data provides a strong and convincing argument in\nfavor of the present assignments and therefore of the strong modification of the monolayer\nforce constants. It thereby points to some peculiar characteristics of the Xe-Xe interaction\nin adlayers of monoatomic thickness which still await a microscopic interpretation through\ndetailed calculations of the adlayer electronic and structural properties.\nThe present article starts with a brief description of the experimental procedure and the\npreparation of Xe monolayers outlined in Sec. II. The experimental results are presented\nin Sec. III where a tentative assignment and interpretation of the modes observed in HAS\nfrom Xe monolayers on Cu(111) and Cu(001) is discussed. The theoretical model used to\ninterpret the HAS TOF intensities measured both in the single and multiphonon scattering\nregimes is described in Sec. IV. The basic ingredients of the model relevant to the calculations of HAS from adlayers are discussed and illustrated for the example of realistic He-Xe\ninteraction potentials. In Sec. V the experimental HAS TOF intensities are compared with\nthe theoretical model predictions and physical implications of the good agreement are discussed. Section VI presents a way to determine the corrugation of the adlayer-substrate\npotential energy surface using the present approach. Finally, Sec. VII summarizes all the\nrelevant findings and the most important conclusions. Preliminary reports on some results\nof the present work have been published previously [9,10].\n\n5\n\n\fII. EXPERIMENTAL\n\nThe experiments have been carried out in a high resolution helium atom scattering\napparatus (base pressure 8 × 10−11 mbar, fixed total scattering angle θSD ) described elsewhere [17]. The crystal was mounted on a home made crystal holder and the sample could\nbe cooled down to 40 K with liquid helium. The sample temperatures were measured using\na cromel-alumel thermocouple and could be stabilized to within ±0.5 K. The Cu(111) crystal previously oriented to within 0.15◦ was cleaned by cycles of Ar ion sputtering (600 eV,\n1μA/cm2 ) followed by annealing at 1100 K. Prior to the experiments described here the\ncleanliness and the structural quality of the surface were checked by XPS and LEED. The\n99.99% pure Xe gas was backfilled into the scattering chamber through a leak valve to a\npressure of 4 × 10−8 mbar. During the preparation of the Xe monolayer structures the crystal temperature was kept at 70 K in order to avoid the formation of bi- and multilayers,\nwhich are stable only at temperatures below 68 K. For temperatures below 68 K the Heatom TOF spectra revealed the appearance of an additional loss, which could be assigned\nto vertically polarized vibrations of the second layer of Xe atoms. At the temperature of\npreparation of the Xe monolayer on Cu(111) the commensurate-incommensurate transitions\nare not expected as they have been detected to occur at around 47 K [18]. A description of\nthe preparation of the Xe monolayer on the Cu(001) surface has been given in Refs. [9,19]\n\nIII. EXPERIMENTAL RESULTS\n\n√\n√\nThe right hand side of Fig. 1.a shows the structure of the commensurate ( 3 × 3)R30◦\nmonolayer of Xe atoms adsorbed on Cu(111) surface [20,21] and indicates the two principal\ndirections (azimuths) of the substrate crystal surface. The left hand side (LHS) shows the\nfirst SBZ of the substrate (dashed lines) and the two dimensional Brillouin zone of the\nadlayer (full lines). Figure 1.b shows an angular distribution of He atoms scattered from\n√\n√\n( 3 × 3)R30◦ Xe/Cu(111) surface for incident wave vector ki = 9.2 Å−1 (Ei = 45 meV)\n\n6\n\n\fand the substrate temperature Ts =60 K along the [110]-azimuth relative to the substrate\nsurface. The intensities are normalized to the specular peak height. In addition to the (1,0)\ndiffraction peak, two additional, Xe (1/3,0) and (2/3,0) diffraction peaks of the order onethird were observed [19]. The sharpness of the peaks and relatively low background indicate\nthe presence of a well-ordered, largely defect-free Xe-overlayer.\nFigure 2 shows an angular distribution along the substrate [100]-azimuth obtained by\nscattering He atoms from a monolayer of Xe atoms adsorbed on Cu(001) for incident wave\nvector ki = 5.25 Å−1 (Ei = 14.36 meV) and Ts =52 K. This distribution indicates a well\ndefined structure. The earlier LEED studies at Ts ≥ 77 K have identified a hexagonally\nordered adlayer incommensurate with the underlying substrate [22,23], so as that the [100]\nsubstrate direction lies along equivalent non-high symmetry directions for the two domains\nof the Xe monolayer, one rotated by 300 from the other. The geometrical structure of\nthese domains is shown in Fig. 6 of Ref. [22] and Fig. 2 of Ref. [23]. The present outof-the-high-symmetry-plane measurements indicate sharp diffraction peaks commensurate\nwith the orientation of the Xe overlayer along the Cu(001) [110] azimuth except for the two\nbumps at each side of the specular peak. Their presence is related to inelastic resonance\nprocesses involving the Cu(001) surface Rayleigh wave and intense nondispersive Xe mode\nwith polarization perpendicular to the surface, as determined by the TOF measurements\ndescribed below. These characteristics of He-angular distribution spectra from Xe/Cu(001)\nfor Ts < 65 K indicate a \"floating\" incommensurate Xe adlayer. Hence, in the case of both Cu\nsubstrates the Xe adlayers may be considered planar and periodic with hexagonal symmetry,\nirrespective of the (in)commensurability with the underlying substrate. The periodicity and\nsymmetry of the adlayers is then reflected in their vibrational properties. The adlayer\nvibrational modes can be classified as dominantly in-plane polarized (longitudinal (L) and\nshear horizontal (SH)) and shear vertical (S) [24].\n√\n√\nFigure 3 shows typical He atom TOF spectra for the ( 3 × 3)R30◦ Xe/Cu(111) surface\nalong the [112̄] substrate azimuth (i.e. along the Γ̄K̄Xe direction of the superstructure),\nfor θSD = θi + θf = 90.50 and three different He atom incident energies Ei spanning the\n7\n\n\ftransition from the single to the multi-quantum scattering regime. The TOF spectra have\nbeen converted from flight time to energy transfer scale. Arbitrary units are used for spectral\nintensities on the vertical axis. The spectrum at the lowest incident energy (Ei =9.9 meV)\nis typical of the single phonon scattering regime and is dominated by two well defined peaks\nat ±2.62 meV on the energy loss and gain sides of the TOF spectrum, respectively. Within\nthe experimental error these energies do not change in the interval beyond ∆K = 0.1\nÅ−1 in the first SBZ of the superstructure. In accordance with previous works on noble\ngas atoms adsorbed on other substrates [7,26], this mode is assigned to the excitation of\ncollective vibrations of Xe-atoms with a polarization vector vertical to the surface and is\ndesignated the S-mode. The lack of dispersion indicates that the frequency of the vertically\npolarized phonon is mainly determined by the adsorbate coupling to the substrate, with\nonly a weak coupling to adjacent adsorbates. Deviation from a dispersionless behavior\noccurs only at the intersection with the substrate Rayleigh-mode [25,26]. The energy of this\nS-mode (h̄ωS = 2.62 meV), is slightly larger than for the (110)-face of Cu (h̄ωS = 2.5 meV\n[8]). The small, but significant deviation of 0.12 meV is consistent with a slightly deeper\npotential well for Xe on Cu(111) and Cu(001) than on Cu(110) [27,28].\nIn addition to the intense S-peaks the measured spectrum also reveals the presence of\na weak but clearly resolved feature (labeled \"L\") near the elastic or zero energy loss line.\nThe energy of this mode changes with the angle of incidence θi and thus shows dispersion.\nThe spectral intensity of this mode relative to that of the S-mode in each TOF measurement was found to decrease strongly with the magnitude of its wave vector so that for the\nHe→Xe/Cu(111) system the corresponding data points could only be obtained for parallel\nwavevector up to one third of the distance between the Γ̄ and K̄Xe points in the first Brillouin zone of the superstructure (interval shown in Fig. 5). Since in the displayed TOF\nspectra the energy of the \"L\" mode is always significantly below that of the lowest surface\nphonon of the clean Cu(111) surface [29], this must be a pure Xe adlayer-induced mode\nwhich cannot couple to the substrate for wavevectors over a wide range of the SBZ. As\n√\n√\nfor the ( 3 × 3)R30◦ Xe/Cu(111) system the [112̄] direction has a high symmetry mirror\n8\n\n\fplane the vibrational modes are partitioned in two orthogonal classes [30]. Two thirds of the\nmodes are polarized in the sagittal plane (including the adlayer induced S- and L-modes).\nThe remaining one third of the modes are polarized in the surface plane and normal to\nthe mirror plane and designated shear horizontal or SH-modes. The three possible adlayer\ninduced orthogonal modes with the wavevector in the [112̄] direction (c.f. Fig. 1.a) are thus\ncharacterized by either a combination of the components with S- and L-polarization or pure\nSH-polarization. Combining the symmetry selection rules pertinent to the probabilities of\nexcitation of in-plane phonons at ideal surfaces (c.f. Refs. [31,32] and Sec. IV below) with\nthe fact that the data were recorded in the first SBZ of the superstructure and in the sagittal\nplane which coincides with the high symmetry plane of the Xe/Cu(111) system, the observation of the SH-mode under these experimental conditions can be ruled out. Hence, this\nmode is tentatively assigned to the longitudinal mode of the adlayer which is known to couple to the scattered He atoms under similar conditions [31,32]. However, as demonstrated\nfor NaCl, the SH-modes can be excited along a high symmetry direction in the second SBZ\n[33].\nThe other two spectra in Fig. 3 demonstrate the transition from a single to a multiphonon\nscattering regime as Ei is increased. This transition takes place already at rather low He\natom incident energies due to the very low excitation energies of the adlayer-induced S-modes\nwhose vertical polarization gives rise to a strong projectile-phonon coupling (c.f. Sec. IV).\nAlthough some single phonon features are still discernible at incident energy Ei = 21.4 meV,\nboth spectra are dominated by a number of uniformly spaced peaks at energies ±n × 2.62\nmeV. For Ei = 45.1 meV the true multiphonon scattering regime is reached because the\nintensity of the elastic peak is smaller than that of the multi-quantum S-peak for n = 2.\nFigure 4 shows three representative He-atom time-of-flight spectra for the incommensurate Xe monolayer on Cu(001) for three different He atom incident energies along the\nh100i substrate azimuth which lies halfway between the two high symmetry directions of\nthe adlayer SBZ. In all essential aspects these spectra are similar to those shown in Fig. 2.\nThey also exhibit strong dispersion of the \"L\" mode and the multiple excitation of S-modes\n9\n\n\fat energies ±n × 2.71 meV. In addition, the Rayleigh mode (labeled RW) of the underlying\nCu(001) substrate is also observed at low and intermediate energies Ei . The RW dispersion\ncurves of clean Cu(111) and Cu(001) surfaces are well known from the previous work [25,29].\nIt is noteworthy that for both adlayers the multiphonon lines are all, to within experimental error, located at integral multiples of a fundamental frequency ωS , 2.62 meV/h̄ for\nXe/Cu(111) and 2.71 meV/h̄ for Xe/Cu(001). At the first sight this seems to imply a very\nharmonic Xe-Cu potential since anharmonic shifts, which are expected to be negative, would\nproduce overtone energies smaller than the corresponding multiples of the fundamental frequency ωS (c.f. Sec. VI). However, the theoretical analyses of the Xe-metal interactions\n[27,28,34] show that the potential is notably anharmonic but, as we show in the next sections,\nthe multiple spectral peaks can be explained by multiple excitation of delocalized phonon\nmodes which involve the lowest harmonic states of many adatoms rather than a single higher\nanharmonic state localized on a single adatom. In this case there is no anharmonic shift as\neach multiphonon excitation is distributed over several Xe atoms in the overlayer.\nFrom up to about a couple of hundred of TOF spectra with different θi the experimental\ndispersion curves were determined and are shown in Figs. 5 and 6. For both Xe/Cu(111)\nand Xe/Cu(001) the vertically polarized S-mode exhibits negligible dispersion over the major\npart of the SBZ except at the point of avoided crossing with the substrate RW [35]. The most\nstriking difference between the vibrational dynamics of the two adsorbate phases manifests\nitself in the dispersion of the \"L\" mode. The \"L\" mode for the commensurate Xe/Cu(111)\nstructure exhibits a zone center gap of about 0.4 ± 0.1 meV whereas for the incommensurate\nphase the frequency at the zone center goes to zero linearly with the wave vector.\nTo further aid the assignments of the modes in the He→Xe/Cu(111) TOF spectra and\nanalyze their dispersion we have carried out a full lattice dynamics calculation of the vi√\n√\nbrationally coupled ( 3 × 3)R30◦ Xe/Cu(111) system with Xe atoms placed in on-top\nsites on both sides of a 40 layer thick slab of substrate atoms and interadsorbate distance\ndXe−Xe = 4.42 Å. The interaction between nearest-neighbor Cu atoms was accounted for by\na single radial force constant β Cu = 28.0 N/m as obtained from a fit of the bulk Cu phonon\n10\n\n\fdispersion curves [36]. The other parameters describing the coupling of the Xe atoms to\nthe nearest neighbor Cu substrate atoms was fitted to the dispersion curves, which yielded\na radial force constant β Xe = 3.7 N/m and a tangential force constant αXe = 0.086 N/m.\nAssigning the longitudinal character to the observed \"L\" mode to comply with the above\ndiscussed symmetry selection rules, the interaction between the atoms in the adlayer could\nbe described by a radial force constant β Xe−Xe = 0.5 N/m and a tangential force constant\nαXe−Xe = 0. The results of the full calculation are shown in Fig. 9 in the next section\nand in Fig. 5 we present only the dispersion for the surface projected S- and longitudinal modes which reproduce the experimental data very satisfactorily. The radial Xe-Xe\nforce constant β Xe−Xe = 0.5 N/m resulting from this procedure is, however, significantly\nsmaller than the value predicted from the highly precise HFD-B2 gas-phase potential [13],\nXe−Xe\n= 1.67 N/m, which produces a significantly steeper dispersion curve for longitudinal\nβHF\nD\n\nphonons denoted by dash-dotted curve in Fig. 5.\nIn the case of incommensurate monolayer of Xe on Cu(001) it was only possible to set\nup a three-dimensional dynamical matrix describing the three vibrational modes localized\nin the adlayer, namely the S-, L- and SH-modes (c.f. Refs. [7,24]). Since the experimental\ndata were taken halfway between the two high symmetry directions of the two dimensional\nhexagonal Xe adlayer Brillouin zone, the broken symmetry no longer forbids excitation of\nthe SH-mode. However, since the calculated polarization vector of the SH-mode is nearly\nperpendicular and of the L-mode nearly parallel to the present azimuthal direction [37], the\ncorresponding excitation probabilities of the SH-phonon are expected to be much smaller\nthan those of the L-phonon (c.f. Refs. [31,32] and Sec. IV). Hence, as in the case of the\ncommensurate system, a longitudinal polarization is assigned to the observed low energy\nadlayer-induced acoustic \"L\" mode also in the incommensurate system Xe/Cu(001). The\ninteradsorbate distance was fixed at dXe−Xe = 4.40 Åand the best-fit force constants in the\n[001] direction are: β Xe = 3.8 N/m, β Xe−Xe = 0.42 N/m, and αTXe−Xe = 0.012 N/m, which\nare similar to force constants for the Cu(111) substrate. These results are also presented in\nFig. 6 and reproduce the experimental data very well. For comparison the dispersion of the\n11\n\n\fXe−Xe\nL-mode calculated by using βHF\nis also shown as a dash-dotted line and does not fit to\nD\n\nthe data. However, in the case of both Xe adlayers, the physical origin of the unexpected\nlarge softening of the radial Xe-Xe force constants introduced to reconcile the symmetry\nrequirements with the experimental data remains unclear. A clue to this effect in the case of\nCu(001) and Cu(111) surfaces may be provided by their peculiar electronic structure which\ngives rise to surface electronic states with corresponding electronic wave functions extending\nfar across the adsorbed Xe atoms [38]. Alternatively, a delocalization of the electronic charge\nwithin the monolayer itself could give rise to softening of intralayer forces which then might\nexplain the same phenomenon observed for an insulating substrate like NaCl(001) [11].\nRecently, it was suggested that the observed \"L\"-mode could be interpreted as a SHmode as this would be consistent with a thermodynamic analysis of the Xe/Cu(001) system\n[12]. This has created the controversy in the literature referred to in the Introduction and\nadditionally motivated the present study. However, the model calculations of the HAS-TOF\nintensities reported in the next sections do not support such an interpretation.\n\nIV. THEORETICAL DESCRIPTION OF He ATOM SCATTERING FROM Xe\nADLAYERS ON Cu(001) AND Cu(111)\n\nSince the assignments of the peaks in the experimental TOF spectra discussed in the\npreceding section have been questioned [12] additional corroboration by theoretical arguments is called for. To this end we have carried out extensive calculations based on the\nrecently developed fully quantum model of inelastic He atom-surface scattering [15,16,39,40]\nwhich is especially suitable for scattering from adlayers [10,19,41]. In this model, the single\nand multiphonon excitation processes can be treated on an equivalent footing without invoking additional quasi-classical approximations for the scattered particle dynamics [42,43].\nA detailed description of the model was presented in Ref. [15], so only its salient properties\nrelevant to the calculations of HAS from adlayers are outlined here.\nIn view of the HAS angular distributions characteristic of the present Xe/Cu(111) and\n12\n\n\fXe/Cu(001) surfaces (c.f. Figs. 1 and 2), the static corrugation of the He-surface interaction\npotential will be neglected so that the Xe overlayers are assumed to be flat and free of\ndefects. The assumption of a planar and perfectly periodic Xe adlayer justifies the use of\nthe dynamical matrix approach in the description of the vibrational properties of the surface\nin terms of phonon modes characterized by their parallel wave vector and branch index. The\nmodel Hamiltonian describing inelastic atom-surface collisions can then be cast in the form:\nH = H0part + H0ph + V (r),\n\n(1)\n\nwhere\nH0part =\n\np2\n+ U(z)\n2M\n\n(2)\n\nis the Hamiltonian describing unperturbed motion of the projectile in the flat static potential U(z) of the target. The projectile particle is characterized by its coordinate and\nmomentum operators r = (ρ, z) and p = (P, pz ), respectively, and mass M. Here ρ, z\nand P, pz denote the parallel (lateral) and vertical (normal) to the surface components of\nr and p, respectively. H0ph is the Hamiltonian of the unperturbed phonon field which can\nbe constructed once the dispersion and polarization of the vibrational modes of the Xe/Cu\nsystem are known, and V (r) is the dynamic projectile-surface interaction. The distorted\nwaves hr | ki = hρ, z | K, kz i, which are the eigenstates of H0part , are described by the quantum numbers K = P/h̄ and kz = pz /h̄ denoting, respectively, the asymptotic parallel and\nnormal projectile wave vectors far outside the range of the potential U(z). The corresponding unperturbed energy of the projectile is then given by Ek = h̄2 (K2 + kz2 )/2M. Using\nthe box normalization these eigenstates can be orthonormalized to satisfy hk | k′ i = δk,k′ ,\nand are except for a phase factor equal to the unperturbed incoming and outgoing states\nsatisfying the scattering boundary conditions [31]. Explicitly, for a flat surface we have, in\nthe coordinate representation,\nhr | ki =\n\neiKρ χkz (z)\nq\n\nLz L2s\n\n13\n\n,\n\n(3)\n\n\fwhere Ls and Lz are the quantization lengths in the parallel and perpendicular to the\nsurface directions, respectively, and χkz (z) satisfies the limit χkz (z → ∞) → 2 cos(kz z + η).\nA more detailed description of the distorted wave scattering formalism was given in Refs.\n[31,32,44–46].\nThe theoretical description of the scattering event described by Hamiltonian (1) is sought\nin terms of a scattering spectrum N(∆E, ∆K), which gives the probability density that an\namount of energy ∆E and parallel momentum h̄∆K are transferred from the He atom to\nthe substrate phonon field. The particular choice of these two variables is dictated by the\nsymmetry of the problem, the conservation of the total energy and, for a periodic surface, the\nconservation of the parallel momentum to within a reciprocal lattice vector G. Therefore,\n∆E and ∆K completely determine the final state of the scattered particle provided its\ninitial state ki = (Ki , kzi ) is well specified. With these prerequisites the energy and parallel\nmomentum resolved scattering spectrum is defined by [15,39,40,44,47–49]\nNki (∆E, ∆K) = lim hΨ(t) | δ[∆E − (H0ph − εi )]δ(h̄∆K − P̂ph ) | Ψ(t)i,\nt→∞\n\n(4)\n\nwhere P̂ph is the parallel momentum operator of the unperturbed phonon field, εi is the\ninitial energy of the phonon field, ∆K = Ki − Kf , and | Ψ(t)i is the wave function of the\nentire interacting system. For calculational convenience, the phonon creation (annihilation)\nprocesses are assigned positive (negative) ∆E and ∆K since they refer to the phonon field\nquantum numbers. The corresponding experimental quantities have, however, opposite signs\nbecause they refer to the measured changes of energy and parallel momentum of the projectile. The spectrum (4) is inherently normalized to unity and hence satisfies the optical\ntheorem. It is also directly proportional to the experimental time-of-flight (TOF) spectrum\n[16]. Based on the translational symmetry of the system we shall in the following describe\nthe phonon modes propagating in Xe monolayers by their wave vector Q parallel to the\nsurface, branch index j, polarization vector e(Q, j) and energy h̄ωQ,j [7,24]. The problem\nof localized modes characteristic of either mixed layers with broken or reduced translational\nsymmetry [50] or of isolated adsorbates will be treated elsewhere.\n14\n\n\fUnder the conditions in which the HAS experiments were carried out, the uncorrelated\nphonon exchange processes dominate over the correlated ones [15]. Then the angular resolved\nscattering spectrum is accurately represented by the expression:\n(∆E, ∆K) =\nNkEBA\ni ,Ts\n\nZ\n\n∞\n\n−∞\n\ndτ d2 R i [(∆E)τ −h̄(∆K)R]\ne h̄\nexp[2W EBA (R, τ ) − 2W EBA (0, 0)],\n3\n(2πh̄)\n\n(5)\n\nwhere τ and R = (X, Y ) are auxiliary variables occurring after the temporal and spatial\nFourier representation of the energy and parallel momentum delta-functions, respectively,\nare introduced on the RHS of expression (4) [15], 2W EBA (R, τ ) is the exponentiated Born approximation (EBA) expression for the so-called scattering or driving function which contains\nall information on uncorrelated phonon exchange processes in the atom-surface scattering\ngives the Debye-Waller exponent (DWE)\nevent. Its zero point value 2W EBA (0, 0) = 2WTEBA\ns\n], gives the\nin the EBA and the corresponding Debye-Waller factor (DWF), exp[−2WTEBA\ns\nprobability of the elastically scattered specular beam [51]. Since in the EBA the correlations between two subsequent phonon scattering events are neglected, the expression for\n(∆E, ∆K) on the LHS of (5) must be combined with the conservation laws for the\nNkEBA\ni ,Ts\ntotal energy and parallel momentum [52].\nThe EBA expression for the scattering spectrum (5) holds irrespective of the form of\nthe projectile-phonon coupling. However, it has been shown [53] that, for the projectilephonon coupling to all orders in the lattice displacements, the higher order phonon exchange\nprocesses which involve only single phonon vertices and originate from linear coupling give\nmuch larger contribution to the scattering matrix than the non-linear many-phonon processes\nof the same multiplicity (c.f. Fig. 1 of Ref. [53] and Fig. 1 of Ref. [15]). Hence, in the\npresent approach, only the linear projectile-phonon coupling will be retained, in which case\nthe scattering function takes the form [15]:\n2W EBA (R, τ ) =\n\nX\n\nQ,G,j,kz′\n\nh\n\n| VkKz′ i,k,Q+G,j\n(+) |2 [n̄(h̄ωQ,j ) + 1]e−i(ωQ,j τ −(Q+G)R) +\nzi\ni\n\n+ | VkKz′ i,k,Q+G,j\n(−) |2 n̄(h̄ωQ,j )ei(ωQ,j τ −(Q+G)R) .\nzi\n\n(6)\n\nHere n̄(ωQ,j ) is the Bose-Einstein distribution of phonons of energy h̄ωQ,j at the substrate\n15\n\n\ftemperature Ts and the symbols\ni ,j\nVkKz′ i,k,Q+G,j\n(±) = 2πVkKz′ ,ki ∓Q+G,K\nδ(EKi ∓Q+G,kz′ − EKi ,kzi ± h̄ωQ,j )\nzi\nzi\n\n(7)\n\ndenote the on-the-energy and momentum-shell one-phonon emission (+) and absorption\n(−) matrix elements or the probability amplitudes of inelastic He atom-surface scattering\n[15] expressed through the corresponding off-the-energy-shell interaction matrix elements\ni ,j\nVkKz′ ,ki ∓Q+G,K\n(see below). In the present fully three dimensional calculations the wave\nzi\n\nvectors of real phonons exchanged in the collision will be restricted to the first SBZ of the\nsuperstructure (i.e. G=0) because the major part of the experimental data was recorded in\nthis region. However, for integrated quantities such as the DWF, the relevant summations\nsometimes need to be extended beyond the first SBZ (see below). The matrix elements\ngiven by expression (7) are normalized to unit particle current normal to the surface, jz =\nvz /Lz = h̄kz /MLz . This can be easily verified if according to the box normalization the\nenergy conserving δ-function in (7) is converted into the Kronecker symbol following the\nidentity\nLz\n2\n),\n2πδ(EK∓Q,kz′ − EK,kz ± h̄ωQ,j ) = √ ′ δkz′ ,k̄zi Θ(k̄zi\nh̄ vz vz\n\n(8)\n\n2\n2\n2\n2\nwhere k̄zi\n= ±2Ki * Q − Q2 + kzi\n∓ 2MωQ,j /h̄ and Θ(k̄zi\n) is the step function restricting k̄zi\n\nonly to open scattering channels in which h̄kz′2 /2M > 0. The factor of Lz appearing in (8) is\nKi ∓Q,Ki ,j\ncanceled by the factor L−1\nwhich arises from the box normalization\nz appearing in Vkz′ ,kzi\n\nof the projectile wave functions (c.f. Eq. (3)). This enables a straightforward summation\nover kz′ on the RHS of expression (6). The quantization lengths in the parallel directions\nalso cancel out from expression (6) after the final summation over Q. The Debye-Waller\nexponent is then obtained from Eq. (6) by a straightforward substitution R = 0 and τ = 0.\ni ,j\nIn the following we shall adopt for VkKz′ ,ki ∓Q,K\nthe expressions obtained by taking the\nzi\n\nmatrix elements of the vibrating part V (r) of the total He-Xe/Cu potential Vtot (r) which\nwill be modeled by a pairwise sum [54] of atomic He-Xe interaction potentials v(r − rl )\n[55,56]. Hence:\n16\n\n\fV (r) = (Vtot (r))vib =\n\nX\nl\n\nv(r − rl − ul )\n\n!\n\n,\n\n(9)\n\nvib\n\nwhere rl = (ρl , zl ) ranges over the equilibrium positions of Xe atoms and ul denotes the\ndisplacement of the l-th Xe atom from equilibrium. The static part of Vtot (r), which is equal\nto the average of the pairwise sum in the brackets on the RHS of Eq. (9), is then identified\nwith the static atom-surface potential U(z) which is included in H0part in Eq. (2). The\nthus formulated scattering theory is equally appropriate to treat single and multiphonon\nscattering processes in HAS and incorporates the single phonon DWBA scattering theory\nreviewed in Refs. [31] and [32] as a special limit.\nTo simplify the numerical calculations and in particular the treatment of the interaction matrix elements and the scattering function, we shall approximate U(z) by a suitably\nadjusted Morse potential:\nU(z) = D(e−2α(z−z0 ) − 2e−α(z−z0 ) ),\n\n(10)\n\nwhere D, z0 and α denote the potential well depth, position of the minimum and the inverse\nrange, respectively. This approximation is justified in the range of energies of the present\nHAS experiments [57]. The values of these potential parameters appropriate to the two\nstudied collision systems are given in Sec. V in which they are explicitly quoted as the input\nin the calculations of the scattering intensities for comparison with the experimental results.\nFollowing the findings of Ref. [58] that the repulsive and attractive components of the pair\npotentials contribute to the vibrating part of the total dynamic atom-surface interaction,\nboth components are included in the dynamic atom-adlayer interaction. Then the matrix\nelements for linear atom-phonon coupling acquire a simple form [31,32]:\n= u∗ (Q, j) * F(K′ − K, kz′ , kz )δK′ ,K∓Q,\nVkK∓Q,K,j\n′\nz ,kz\n\n(11)\n\nwhere u(Q, j) is the vector of quantized displacement of the adlayer atoms corresponding\nto the phonon mode (Q, j) defined below in Eq. (15). The parallel momentum conserving\nKronecker symbols δK′ ,K∓Q arise as a result of the summation over adsorption sites of pair\n17\n\n\fpotential contributions from all adsorbates in the periodic adlayer. The matrix element of\nthe force F(K′ − K, kz′ , kz ) exerted on the projectile by an atom in the adlayer is expressed\nas [31,32]:\nF(K′ − K, kz′ , kz ) = hχkz′ | (i(K′ − K), −∂/∂z)v(K′ − K, z) | χkz i,\n\n(12)\n\nwhere v(K′ − K, z) is a two-dimensional Fourier transform of v(r) which appears in expression (12) after taking the matrix element between the parallel components of the projectile\nwave functions hρ | K′ i and hρ | Ki. The scalar product appearing in expression (11)\ngives the afore mentioned symmetry selection rules for excitation amplitudes of the various\none-phonon scattering processes. In particular, for a purely SH-polarized phonon with a\npolarization vector in the surface plane and perpendicular to the mode wave vector Q in the\nfirst SBZ, the scalar product in (11) will be equal to zero, leading to a vanishing excitation\nprobability. Expressions (11) and (12) also indicate that for small parallel momentum transfer to phonons the projectile-phonon coupling is strongest for vibrations with polarization\nvector perpendicular to the surface.\nThe parallel or (K′ − K)-dependence of v(K′ − K, z) was modeled by introducing the\ncut-off wave vector Qc which gives an approximate upper bound on the parallel momentum transfer in the one-phonon exchange processes (Hoinkes-Armand effect [59]). Denoting\nK′ − K = Q this yields:\nv(Q, z) = D(e−2α(z−z0 ) e−Q\n\n2 /2Q2\nc\n\n− 2e−α(z−z0 ) e−Q\n\n2 /Q2\nc\n\n).\n\n(13)\n\nwith the property v(Q = 0, z) = U(z). The appearance of different effective cut-offs in\nthe Q-dependence of the repulsive and attractive components of v(Q, z) in Eq. (13) (viz.\n√\n2Qc versus Qc ) is a consequence of the different ranges of the repulsive and attractive\ncomponents of the model pair potential v(r − rl ) consistent with expression (10) [58]. In the\ncase of exponential potentials of range 1/β the value of Qc is approximately given by [54]:\nQc =\n\ns\n\nβ\n,\nzt\n\n18\n\n(14)\n\n\fwhere zt is the (energy dependent) average value of the He atom turning point in the surface\npotential U(z). Although the numerical evaluation of the matrix elements (12) avoids the\nexplicit introduction of Qc [57] the effect of the cut off in the parallel momentum transfer\nremains [60]. The matrix elements described by Eq. (12) were all calculated by using the\npair potentials v(r − rl ) to obtain v(Q, z), Eq. (13), with the parameters corresponding to\nthe two studied systems explicitly defined in the next section. Figures 7.a and 7.b illustrate\nthe behavior of the one dimensional off-shell matrix elements hχkz′ | v(Q = 0, z) | χkz i\nand hχkz′ | −(∂/∂z)v(Q = 0, z) | χkz i which determine the parallel and perpendicular\ncomponents of expression (12), respectively. The minima occurring in these plots are the\nconsequence of the competition between the contributions coming from the repulsive and\nattractive components of v(Q = 0, z).\nAs is clear from Eq. (11), the calculations of the full interaction matrix elements also\nrequire the dynamical displacements ul of atoms in the adlayer. For Xe adsorption on\nCu(001) the overlayer structure is incommensurate with the underlying substrate which\nnecessitates an approximate but consistent description of the adlayer vibrational properties.\nFollowing the experimental evidence indicating a defect free and well structured monolayer\n(c.f. Fig. 2) we assume as in Sec. III a planar \"floating adlayer\" with perfect hexagonal\nsymmetry in which the phonon dynamics takes into account only the averaged Xe-substrate\npotential perpendicular to the surface as well as inter-adsorbate interactions. In this case\nthe polarization vectors and eigenfrequencies are solutions of a three-dimensional dynamical\nmatrix [24]. Hence, the adsorbate displacements can be expanded in terms of normal phonon\nmodes of the adlayer in terms of phonon creation (a†Q,j ) and annihilation (aQ,j ) operators:\nul =\n\nX\nQ,j\n\nh̄\n2Ma Na ωQ,j\n\n!1/2\n\neiQρl e(Q, j)(aQ,j + a†−Q,j ),\n\n(15)\n\nwhich also defines u(Q, j) = (h̄/2Ma Na ωQ,j )1/2 e(Q, j) in Eq. (11). Here ρl is the parallel\ncomponent of the radius vector of the l-th adsorbate in equilibrium, and Ma and Na are\nthe mass and the number of Xe atoms in the adlayer, respectively. In the floating adlayer\nmodel the index j ranges over the S- (shear vertical), L- (longitudinal horizontal) and SH19\n\n\f(shear horizontal) adlayer modes. By construction the floating adlayer phonon modes are\nlocalized in the adlayer and the polarizations of L- and SH-modes are strictly in the surface\nplane. The corresponding dispersion curves calculated with the adjusted force constants\nquoted in Sec. III are shown in Fig. 8. Consequently, the symmetry selection rules for\nprobability of phonon excitation in a floating adlayer are more stringent than in the case of\na dynamical matrix description which includes the substrate dynamics in some way. This is\nreflected in the calculated probability of excitation of an SH-phonon for in-the-sagittal plane\ninelastic scattering within the first SBZ of the superstructure. This probability turns out to\nbe much smaller than for the L-mode for all azimuths, and is exactly zero along the two high\nsymmetry directions ΓK̄Xe and ΓM̄Xe of the superstructure. These effects will be further\ndiscussed below in conjunction with the effects which the scattering potential imparts to the\nscattering intensities and in Sec. V where we discuss a comparison between experimental\nand theoretical results.\nTo calculate the required eigenfrequencies and the corresponding polarization vectors of\nthe full dynamical matrix corresponding to the commensurate Xe/Cu(111) system we have\nused the force constants given in the previous section. The results for the dispersion curves\nare shown in Fig. 9.a. Here we can also trace how each phonon mode of the composite system\nis localized at the surface (i.e. within the adlayer) and how typical surface modes may get\ndelocalized for certain values of the wave vector. A measure of the adlayer localization of the\nS-, L- and SH-modes near the center of the first BZ of the superstructure is shown in Fig.\n9.b. Further important information concerning the ellipticity of polarization (perpendicular\nversus longitudinal) of the L-mode in the same region is illustrated in Fig. 9.c.\nThe calculation of the force matrix elements, Eq. (12), can be performed analytically [61]\nusing the wave functions of Eq. (3) and the two dimensional Fourier transform of the pair\ninteraction, Eq. (13) [58]. With the aid of these matrix elements and using Eqs. (7) and (8),\nwe can obtain first order or distorted wave Born approximation (DWBA) transition probabilities for He atoms in Eq. (6). Multiplying them by the corresponding Bose distributions\nwe obtain the DWBA inelastic state-to-state reflection coefficients for one phonon scattering\n20\n\n\f[31]. Carrying out the summation over kz′ by making use of Eq. (8), fixing θSD = θi + θf ,\nEi and Ts , and varying θi we obtain the Q-dependent scattering intensities which can be\ndirectly related to the one phonon intensities in the TOF spectra (c.f. next section). Here\nwe shall only illustrate some of their general and most interesting features.\nFigure 10 shows a plot of the DWBA scattering intensities for emission (energy loss)\nor absorption (energy gain) of a single dispersionless S-phonon in HAS from the \"floating\"\nXe adlayer on Cu(001) surface. The calculated intensities reveal a relatively simple and\nexpected structure as a function of the exchanged phonon momentum which is mainly due\nto simple properties of S-phonons characteristic of the \"floating\" adlayer model (absence\nof dispersion and the polarization vector localized in and perpendicular to the adlayer).\nOn the other hand, due to the more complicated model of vibrational dynamics of the\ncommensurate Xe monolayer adsorbed on Cu(111) surface the analogous intensities shown\nin Fig. 10.b exhibit a more complicated structure despite the similarity in the corresponding\npotential parameters (for the magnitude of the latter see next section). Here the S-phonon\npolarization vector becomes delocalized over the first few layers of the Xe/Cu slab for the\nvalues of Q at which the S-phonon dispersion curve meets the dispersion curves of substrate\nphonons (c.f. Fig. 9.a). This makes the coupling of the He atom to S-phonons weaker in\nthis region of the Q-space which is then reflected in the occurrence of pronounced minima\nin the scattering intensities.\nHowever, for nondispersive S-phonons the intensities of the measured single quantum\nloss or gain peaks acquire additional weight due to the multi-quantum interference between\nthe emission of n ± 1 and annihilation of n nondispersive phonons of different wave vectors\n[62,63]. These additional contributions are automatically included in the EBA with account\nof recoil effects, as demonstrated in Ref. [64]. The difference between the single S-phonon\nloss and gain scattering intensities obtained in first order DWBA theory and in the EBA\n(which takes into account such interference processes) can also be visualized in Figs. 10.a\nand 10.b for incommensurate and commensurate Xe adlayers, respectively. It is seen from\nthe figures that for given projectile incoming energies these differences may be already quite\n21\n\n\fsubstantial. In particular, the noticeably larger EBA intensities for larger wave vectors are\nsolely due to multi-quantum interference processes. This necessitates the use of the EBA\nin calculating the scattering intensities for comparison with the experimental data. On the\nother hand, we have found that the same type of renormalization of the scattering intensities\nof dispersive L-modes by emission and absorption of nondispersive S-modes gives a negligible\neffect.\nThe differences in magnitude between the projectile transition probabilities in one phonon\nloss and gain processes can be best illustrated by repeating the above calculation for the\nscattering intensities but without multiplying the phonon loss and gain transition probabilities by the corresponding Bose distributions. The results of such a calculation for an S-mode\nemission and absorption are depicted in the insets in Figs. 10.a and 10.b. These differences\narise from and give a measure of the quantum recoil effects and are more pronounced at\nlower projectile incoming energies (c.f. Fig. (6) in Ref. [19]). The trend that the results for\nloss processes give smaller values than for the gain processes reflects the fact that the phase\nspace or density of states for transitions of the projectile to a state with lower energy (case of\nphonon emission) is smaller than to a state with higher energy (case of phonon absorption).\nFigure 11.a shows first order or DWBA intensities for HAS from L-phonons in the incommensurate adlayer of Xe on Cu(001) surface for finite substrate temperature Ts which\ndetermines the temperature of the Bose-Einstein distributions for adlayer phonons in expression (6). In the present \"floating\" adlayer model for the dynamical matrix the L-mode\nfrequency follows acoustic dispersion ωQ,L ∝ cL Q for small Q (c.f. Fig. 8). The corresponding polarization vector e(Q, L) lies strictly in the adlayer plane and remains dominantly\nparallel to Q even outside the high symmetry directions of the BZ of the superstructure.\nConsequently, the L-phonon DWBA intensity for small Q (for which ωQ,L ∝ Q) and finite\n2\nwhich saturates at a finite\nTs becomes proportional to the factor | Q * e(Q, L) |2 kTs /ωQ,L\n\nvalue for Q → 0. As a result of that and the properties of the matrix elements depicted\nin Fig. 7.a the L-phonon scattering intensity in the case of the incommensurate monolayer\nexhibits a maximum near the zone center. The minima in the intensity occur for those val22\n\n\fues of Q at which the on-the-energy-shell counterparts of these matrix elements go through\na minimum or zero. All these features clearly manifest themselves in the Q-dependence of\nthe L-phonon scattering intensity shown in Fig. 11.a. In contrast to the L-mode behavior,\nthe polarization of the SH-mode remains dominantly perpendicular to Q also outside the\nhigh symmetry directions of the first SBZ of the superstructure [37]. Therefore for ideally\nstructured \"floating\" adlayers it will always give a much smaller contribution to the intensity\nof the one phonon processes for HAS in the sagittal plane and Q restricted to the first SBZ\n(c.f. next section).\nFigure 11.b shows the single L-phonon HAS intensity for Xe/Cu(111) system as a function\nof the phonon wave vector on the same scale as in Fig. 11.a. Apart from the trends leading\nto zero scattering intensities for some isolated Q-values due to the behavior of the offshell matrix elements shown in Fig. 7.a, which are common to both incommensurate and\ncommensurate Xe layers, some basic differences with respect to the Xe/Cu(001) system\ncan be observed. The commensurability of the adlayer with the substrate gives rise to\nnon-vanishing Xe-Cu shear stress force constants entering the full dynamical matrix of the\nXe/Cu slab, thereby producing two important effects regarding the phonon dynamics. First,\nit causes the appearance of a zone center phonon gap in the dispersion curves of L-phonons\n2\nand hence the intensity factor | Q*e(Q, L) |2 kTs /ωQ,L\n∝ Q2 for small Q because ωQ=0,L 6= 0.\n\nSecond, the polarization vector of the L-phonons is no longer constrained to the surface plane\nbut for the values of Q at which the L-mode and substrate modes are degenerate it also\nacquires a component in the direction perpendicular to the surface and its localization to the\nadlayer is reduced (c.f. Figs. 9.b and 9.c). For a completely in-surface-plane polarization\nof the L-mode and finite Ts the first effect causes a drop in the scattering intensity which\nis quadratic in Q towards the zone center. The beginning of this trend is clearly visible\nin Fig. 11.b. However, by increasing Q the second effect begins to play a role and, since\nthe coupling to perpendicular vibrations is much stronger than to the parallel ones, the Lphonon scattering intensity rises rapidly up and reaches a maximum in two spikes near the\nzone center. Hence, the interplay between the parallel and perpendicular polarizations, or the\n23\n\n\fellipticity of the L-mode polarization in the commensurate Xe/Cu(111) system, introduces\nfast variations of the scattering intensity as a function of the exchanged phonon momentum.\nRegarding the role of the SH-modes of the slab on the HAS intensities, we find that the\nsituation here is completely analogous to the case of a floating Xe adlayer, i.e. within the\npresent model description their coupling to He atom is generally negligible for in-sagittalplane collision geometry and Q lying in the first SBZ, and is strictly zero along the high\nsymmetry directions. However, this conclusion does not apply to the magnitude of the\nDebye-Waller factor because the Debye-Waller exponent is obtained by carrying out the\nmomentum transfer summations over the entire first SBZ and also beyond if the coupling\nmatrix elements are strong there (c.f. Figs. 10 and 11). In fact, for the matrix elements of\nappreciable magnitude in the second SBZ the SH-mode can produce even larger contributions\nto the DW exponent than the L-mode due to its lower excitation frequency. This situation\nis illustrated in Fig. 12.\nAn important point to be observed in connection with Figs. 10 and 11 is a relatively large\ndifference between the one phonon loss and gain scattering probabilities at lower projectile\nincident energies. This is due to an interplay between the projectile recoil and temperature\neffects. The amplitude for a transition of the projectile to a state with higher energy is\nlarger than to a state with lower energy (c.f. insets in Figs. 10.a and 10.b) because of the\nlarger phase space for the states of higher energy. Thus, for the same incoming energy the\nmatrix elements | V(−) |2 for phonon absorption in expression (6) for the scattering function\nwill be generally larger than | V(+) |2 which describe phonon emission (c.f. also Fig. 6 in\nRef. [19]). On the other hand, the temperature effects entering expression (6) through the\ncorresponding Bose-Einstein distribution factors n̄ and (n̄ + 1) for phonon absorption and\nemission, respectively, act just in the opposite direction because n̄ < (n̄ + 1) . Hence, the\ntotal scattering intensity for phonon emission or absorption calculated from the scattering\nfunction (6) depends on the trade off between these two effects.\n\n24\n\n\fV. COMPARISON OF THEORETICAL AND EXPERIMENTAL RESULTS\n\nA real test of the assumptions underlying the present model interpretation of HAS from\nXe monolayers on Cu(001) and Cu(111) surfaces should come through a comparison of relative excitation intensities of the various modes in the experimental and calculated scattering\nspectra. This is equally relevant for the single and multiphonon scattering regimes.\nIn this section we first calculate the relative intensities of the various adlayer modes in the\nsingle phonon scattering regime using the approaches described in the preceding sections.\nThe parameters characterizing the He-Xe potential in expression (13) are given by:\nD = 6.60 meV, α−1 = 0.8202 Å, and z0 = 3.49 Å,\nfor the commensurate system Xe/Cu(111), and\nD = 6.40 meV, α−1 = 1.032 Å, and z0 = 3.6 Å,\nfor the incommensurate system Xe/Cu(001). These are not the parameters obtained from\npairwise summation of pure He-Xe gas-phase potentials [56] which yields:\n−1\nDgas = 7.2 meV, αgas\n= 0.77 Å, and z0,gas = 3.51 Å,\n\nbut slightly modified ones to produce a softer He-surface potential. The present set of\nparameters for the Xe/Cu(111) system also differs from the one quoted in Ref. [10] which\nis a result of additional consistency requirement imposed to obtain a unified set describing\nthe TOF spectral intensities equally well in the single and multiphonon scattering regimes.\nSuch a necessity for modification of the sum of gas-phase pair potentials is not uncommon\nin HAS studies (c.f. Refs. [60,65]) and here it is also necessary to consistently reproduce the\nrelative peak intensities in the measured TOF spectra.\nA comparison of the experimental and calculated spectral intensities of S- and L-modes\nin the single phonon scattering regime of HAS from Xe/Cu(111) is shown in Fig. 13. Here\nwe note that our calculations always yield smaller intensities for the elastic peaks compared\nwith the experiment as the latter also includes contributions from diffuse elastic scattering\nfrom defects not accounted for by the present model. Hence, this missing component has\nbeen added to the elastic peak intensity because in combination with the finite peak width\n25\n\n\fit can also contribute to the background intensity of the L-peaks. With this proviso a good\nagreement between experimental and theoretical results is achieved which illustrates the\nconsistency of the present interpretation of the inelastic peaks in the TOF spectra.\nSince in the floating adlayer model applied to the Xe/Cu(001) system the interference\nbetween the adlayer modes and the substrate Rayleigh wave (RW) cannot be obtained,\nwe have selected the TOF spectra in which the peaks assigned to S- and L-modes could\nbe maximally separated from those of the RW and then calculated only the adlayer mode\nintensities in the EBA by neglecting the S-mode frequency shifts and delocalization occurring\nat avoided crossing with the dispersion curve of the RW. Along the direction of measurement\nthe polarization of the SH mode is not strictly perpendicular to its wave vector, and this in\nprinciple could give rise also to SH-mode-induced structures in the TOF spectra. However,\nin this direction the present theoretical analysis gives the SH-mode intensity of the order\nof only five percent relative to the contribution from the L-mode. Only the introduction of\ncoupling of the SH mode to the modes of the underlying substrate could induce a breakdown\nof symmetry leading to a removal of such stringent selection rules and thereby to a larger\nSH-mode excitation probability. The calculated relative intensities of the S- and L-modes\nfor the Xe/Cu(001) system in the single phonon scattering regime, but with inclusion of\nmulti-quantum interference of nondispersive S-modes, are compared with the experimental\ndata in Fig. 14. Given all the approximations used in the calculation, it is seen that the\nmodel reproduces the relative TOF intensities quite satisfactory. The only exception occurs\non the energy loss side in the lower panel of Fig. 14 where the afore mentioned avoided\ncrossing between the substrate RW (energy loss at 3.05 meV) and the adlayer S-mode takes\nplace, with the effect of S-mode frequency shift and intensity enhancement. In Fig. 14\nwe also demonstrate how the use of the unsoftened force constants derived from the threedimensional Xe-Xe gas phase potential [13] produces the position and intensity of L-peaks\nfor which the disagreement with the experimental data is evident. On the other hand,\nthe SH-peaks calculated for the present scattering geometry by using the same gas phase\npotentials are of negligible relative intensity to be experimentally observable although their\n26\n\n\ffrequency may coincide with that of the measured acoustic mode. Hence, with the present\nmode assignments and the corresponding model dispersion relations based on the softened\nradial intralayer force constants we can consistently describe the HAS-TOF intensities for\nthe Xe/Cu(001) system as well.\nAs the coupling of He atoms to S-modes is much stronger than to the L-modes, as illustrated in Figs. 10 and 11, the multiphonon scattering spectra will be dominated by a\nseries of multi-quantum S-peaks. All other dispersive modes may only add weak structures\non top of this basic one. Eventually, these structures will turn into a broad Gaussian-like\nbackground (cf. Eq. (73) in Ref. [15] and Eq. (9) and Fig. 3 in Ref. [16]) in the limit\nof high incident projectile energies. The multiphonon scattering spectra from Xe/Cu(111)\nand Xe/Cu(001) adlayers have been studied in detail in Ref. [19] and for the sake of completeness we here briefly illustrate their features in Figs. 15.a and 15.b, respectively, by\nconsistently employing the potentials from the corresponding single phonon calculations.\nFigure 15.b is interesting in that it illustrates the behavior of the experimental scattering\nspectra of He→Xe/Cu(001) collisions in the single phonon scattering regime regarding the\nmodes which weakly couple to He atoms. This is shown by the appearance of a Rayleigh\nwave-induced hump and an L-mode-induced shoulder near the elastic line. However, this\nscattering regime simultaneously appears to be a multiphonon one for the S-modes whose\ncoupling to the scattering He atoms is much stronger. Concerning the agreement between\nexperimental and theoretical results we observe that although the multiphonon TOF spectra\nof the incommensurate Xe/Cu(001) system can be relatively well reproduced, except for the\nelastic line which was not corrected for diffuse scattering contribution in the theoretical plot,\nthe agreement for the commensurate Xe/Cu(111) system is better. Interestingly enough, in\nthe latter case (Fig. 15.a) the diffuse elastic scattering correction for the elastic line was\nunnecessary due to the true multiphonon character of the spectrum at this higher incident\nenergy. This spectrum can be viewed as a convolution of a series of well defined equidistant peaks, signifying the uncorrelated multiple emission and absorption of nondispersive\nS-phonons and not the overtones (for overtone frequencies see next section), with a broad\n27\n\n\fbackground arising from the multiple excitation of L- and SH-phonons (whose polarizations\nin this regime are no more constrained by the symmetry selection rules), and also from the\nsubstrate surface projected modes which may couple to the scattered He atoms. As implied\nin expression (6), the phonon absorption processes of any kind can take place only for Ts > 0.\nIt is also noteworthy that the resulting multi-quantum S-mode intensities in the spectra\nshown in Figs. 15.a and 15.b do not generally follow the Poisson distribution. This arises as\na consequence of the projectile recoil effects and the dependence of the magnitude of each\npeak maximum on the exchanged parallel momentum, which both act so as to prevent the\nappearance of a simple Poissonian structure. These features were discussed in detail in Refs.\n[19,64,66].\n\nVI. CORRUGATION OF Xe-Cu(111) POTENTIAL ENERGY SURFACE\n\nThe value of the zone center gap for the longitudinal phonon mode in the case of Xe\nadsorbed on Cu(111) surface also provides information on the Xe/Cu(111) potential energy surface. Since, in the past, precise information on the lateral corrugation for noble\ngases adsorbed on metal surfaces has been missing, an approach based on the work by\nSteele [67] has frequently been used in applications [68] in which the periodic adsorbatesubstrate potential Vs (r) is obtained by a summation of Lennard-Jones pair potentials\nV (r) = 4ǫ[(σ/r)12 − (σ/r)6 ] describing interaction between noble gas atom and substrate\natoms. The resulting sum can be expressed in the form\nVs (ρ, z) = ǫ[V0 (z) + f V1 (z)\n\n3\nX\ni=1\n\ncos(Gi * ρ)].\n\n(16)\n\nwhere now ρ and z denote the adsorbate parallel and perpendicular coordinate, respectively,\nthe latter being measured from the first layer of substrate atoms. The symbols ±Gi , i = 1\nto 3, denote the six shortest reciprocal lattice vectors, and the definition of V0 and V1 is given\nin Ref. [67]. The original expression (16) was derived in Ref. [67] for the case f = 1 and\nthe extra factor f which may differ from unity has been added following Ref. [68] to adjust\n28\n\n\fthe corrugation without changing the adsorption energy. Since this type of the potential\nhas been used in molecular dynamics simulations of sliding monolayers we can estimate\nits relevance to the present problem even without invoking the precise information on the\nadsorption sites. Thus, setting σ to 3.487 Å, the arithmetic mean of σXe−Xe (describing\nthe Xe-Xe interaction), the Cu nearest neighbor distance [69] and putting ǫ = 19 meV,\nyields a Xe-surface potential with a total depth of around 200 meV, a reasonable value [27].\nFor the interaction between noble gas atoms and metal surfaces with highly delocalized\nconduction electrons the parameter f has previously been reduced to values of the order 0.1\nto account for small corrugations observed experimentally, and values as small as 0.03 have\nbeen proposed for the case of Kr on Au(111) [68].\nAlthough we have not used the parametrized expression (16) in our dynamical matrix\nanalysis of Xe adlayer vibrations, we would like to point out that for the potential parameters\nappropriate to Xe on Cu(111) (see above) a value of f = 0.1 yields a zone center phonon gap\nenergy of 0.25 meV, significantly smaller than the value reported here. In addition, using\nthis potential energy surface (PES) the computed S-phonon energy amounts to 4.55 meV\n(i.e. much larger than the present experimental value h̄ωS = 2.62 meV), and the anharmonic\nshift of the fifth overtone to ∼0.5 meV. The same conclusion can be also derived by using\nthe Xe-Cu(111) potentials parametrized in Refs. [27,28]. To get the correct curvature of\nthe PES at the adsorption site one should either change by a substantial amount the depth\nof the potential (16) in the normal direction (governed by ǫ), or modify its width which is\ncontrolled by σ, or both. Drastic changes in the potential depth leading to the experimental\nvibrational energies are physically implausible in view of the correct fitting of the desorption\nenergies. On the other hand, the correct curvature can be achieved by a modest, 10%\nsoftening of the repulsive component of the potential. This is consistent with the softening\nof the L-mode force constants discussed in Sec. III and the modification (also in the direction\nof softening) of the He-Xe adlayer potential noted in Sec. V. All three features, which derive\nfrom independent analyses of the experimental data, unambiguously point towards the effect\nof softening of pair interactions involving Xe atoms in adsorbed monolayer phase.\n29\n\n\fIn the previous report of the present results for Xe/Cu(111) [10] an incorrect reference\nwas made to the work of Cieplak, Smith and Robbins [68] in which the results of molecular\ndynamics simulations for Kr adsorbed on Au(111), i.e. not Xe on Ag(111), were reported.\nConsidering the analysis presented in the last paragraph, we believe that the PES used in\nthat work [68] may be too weakly corrugated when the factor f is reduced to below the value\nof 0.1. Since the molecular dynamics results on friction of sliding noble gas adlayers show\na pronounced dependence on the strength of lateral corrugation [68,70] it would be highly\ndesirable to experimentally determine the zone center gap of the longitudinally polarized\nphonon modes of Kr and Xe adsorbed on Ag(111) or Au(111). Unfortunately, however,\nsuch measurements are hampered by the fact that on these substrates both noble gases\nform incommensurate overlayers in which the zone center phonon gap is zero because of the\ntranslational invariance.\n\nVII. SUMMARY AND CONCLUSIONS\n\nIn this work we have carried out a comprehensive comparative experimental and theoretical study of low energy dynamics of monolayers Xe on Cu(111) and Cu(001) surfaces by\nutilizing the HAS-TOF spectroscopy and a recently developed quantum theory of inelastic\nHAS from surfaces which treats single and multiphonon scattering processes on an equivalent footing. The inelastic HAS data were obtained for a wide range of initial scattering\nconditions (Ei , θi , Ts ) spanning the single and multiphonon scattering regimes. The data\nhave been carefully analyzed by combining the dynamical matrix approach for description\nof the adlayer vibrational dynamics with the developed scattering theory.\nFor both substrates the angular distributions (diffraction spectra) of scattered He atoms\n√\n√\nsignified hexagonally ordered Xe monolayers, the commensurate ( 3 × 3)R300 adlayer in\nthe case of the Cu(111) surface [20,21] and the incommensurate one in the case of the Cu(001)\nsurface [22,23]. The measured phonon dispersion relations deduced from the TOF spectra\nfor the two types of monolayers exhibited great similarities in the case of the nondispersive\n30\n\n\foptical-like S-phonons localized in the adlayer. However, a striking difference occurred in the\ncase of the very soft dispersive phonon branch labeled \"L\". In the incommensurate phase it\nis genuinely acoustic-like whereas in the commensurate phase it exhibits a frequency band\ngap at the zone center.\nThe tentative mode assignment was first made by employing the symmetry selection\nrules applicable to one-phonon excitation processes in HAS in the sagittal plane in combination with the dynamical matrix description of the adlayer vibrational modes. Since in the\ncase of the Xe/Cu(001) system no signature of a possible high order commensurate phase\nhas been found, the dynamical matrix treatment of the two adlayers was markedly different.\nOn Cu(001) it was only possible to treat incommensurate Xe adlayer as an ideally structured hexagonal monolayer floating on a structureless substrate surface with adlayer modes\ncompletely decoupled from those of the substrate. On the other hand, for the monolayer\nof Xe on Cu(111) it was possible to construct a full dynamical matrix of the vibrationally\ncoupled Xe/Cu(111) system. Despite these differences it was possible to establish a unified\nmodel interpretation of the observed modes in both systems in terms of a consistent set\nof adjusted Xe-Xe and Xe-Cu force constants. In this picture the S-mode is dominantly\nadlayer localized and F Tz or vertically polarized. In order to reconcile the symmetry selection rules for excitation of in-plane-polarized adlayer-induced modes in HAS from ideally\nstructured adlayers with the dynamical matrix description of the modes, we had to assign\na dominantly longitudinal polarization to the \"L\"-mode (L-phonon), with a possibility of\na relatively strong vertical or z-admixture (up to ∼ 15%) near the avoided crossings with\nother surface projected modes. By consistently carrying out this procedure we found that\nthe radial Xe-Xe force constants determining the dispersion of the thus assigned longitudinal modes turned out much softer than by directly applying the sophisticated HFD-B2\nXe-Xe gas phase pair potential [13]. Such a modification of the interadsorbate interactions\nstill awaits its interpretation through a detailed calculation of the electronic structure of\nXe adlayers on Cu(111) and Cu(001). The magnitude of the band gap in the dispersion of\nL-phonons in the commensurate Xe/Cu(111) phase was used to obtain information on the\n31\n\n\fcorrugation of the Xe atom-substrate potential in this system [10].\nThe assignment of the observed acoustic modes to shear horizontal or SH-modes in the\nfirst SBZ, which were the subject of recent controversy [12], was ruled out for both systems\nfirst by invoking the symmetry selection rules (c.f. Sec. III) for the excitation of the various\nin-plane modes in HAS. Following these arguments, in the present model in which the ideal\nstructure of Xe adlayers is an essential ingredient, the SH-mode can give only a negligible\ncontribution to the scattering intensity relative to the longitudinal mode.\nThese interpretations were then corroborated by detailed theoretical analyses of the scattering intensities in the HAS-TOF spectra. We have first analyzed and demonstrated the\ndifference between the interaction matrix elements coupling the scattering He atoms to the\nperpendicular and parallel to the surface vibrations of the adlayer for small parallel momentum transfer and variable incoming projectile energy. Combining this with the calculated\nproperties of the polarization vectors of the adlayer modes, we were able to obtain the onephonon HAS intensities of the adlayer modes and compare them with experiments. A good\nand consistent agreement between experimental and model theoretical results for the S- and\nL-modes was obtained in all aspects of the measured data for both types of Xe adlayers.\nThe theory was then extended to calculations of the scattering spectra in the transition\nfrom the single to the truly multiphonon scattering regime which is characterized by the value\nof the corresponding Debye-Waller exponent larger than unity. Interestingly enough, for the\nS-modes, which strongly couple to the scattered He atoms, the multiphonon regime is already\nreached for the scattering conditions which still favor the single L-phonon scattering. The\ninterplay of these two types of couplings gives rise to the characteristic spectral shapes of the\nmultiphonon HAS TOF spectra. A very good agreement between the calculated results and\nthe TOF data in this regime gives further support to our earlier assignments, the consistency\nof the model description of the low energy dynamics of the two distinct monolayer phases of\nXe, and the adequacy of the present treatment of single and multiphonon He atom scattering\nfrom these adlayers.\n\n32\n\n\fACKNOWLEDGMENTS\n\nThe work in Zagreb has been supported in part by the National Science Foundation\ngrant JF-133, and the work in Bochum in part by the German DFG grant Wo 464/14-1.\n\n33\n\n\fREFERENCES\n[1] D.M. Eigler and E.K. Schweizer, Nature (London) 344,524(1990).\n[2] G. Meyer, L. Bartels, S. Zöphel, E. Henze and K.-H. Rieder, Phys. Rev. Lett.\n78,1512(1997).\n[3] See articles in: Physics of Sliding Friction, edited by B.N.J. Persson and E. Tosatti,\nKluwer Academic Publishers, Dordrecht/Boston/London, 1996.\n[4] G. Witte, K. Weiss, P. Jakob, J. Braun, K.L. Kostov and Ch. Wöll, Phys. Rev. Lett.\n80,121(1998).\n[5] See for example: W. Widdra, P. Trischberger, W. Friess, D. Menzel, S.H. Payne and\nH.J. Kreuzer, Phys. Rev. B57,4111(1998); and references therein.\n[6] B.F. Mason and B.R. Williams, Phys. Rev. Lett. 46,1138(1981).\n[7] K. D. Gibson, S. J. Sibener, B. Hall, D. L. Mills, and J. E. Black, J. Chem. Phys.\n83,4256(1985).\n[8] P. Zeppenfeld, M. Büchel, R. David, G. Comsa, C. Ramseyer and C. Giradet, Phys.\nRev. B50,14667(1994).\n[9] A.P. Graham, M.F. Bertino, F. Hofmann, J.P. Toennies and Ch. Wöll, J. Chem. Phys.\n106,6194(1997).\n[10] J. Braun, D. Fuhrmann, A. Šiber, B. Gumhalter and Ch. Wöll, Phys. Rev. Lett.\n80,125(1998).\n[11] R. Gerlach, A.P. Graham, J.P. Toennies and H. Weiss, J. Cem. Phys. 109,5319(1998).\n[12] L.W. Bruch, J. Chem. Phys. 107,4443(1997); A.P. Graham, M.F. Bertino, F. Hofmann,\nJ.P. Toennies, and Ch. Wöll, J. Chem. Phys. 107,4445(1997); L.W. Bruch, preprint\n(MPI für Strömungsforschung, Göttingen, 1997).\n\n34\n\n\f[13] A.K. Dham, W.J. Meath, A.R. Allnatt, R.A. Aziz, and M.J. Slaman, Chem. Phys.\n142,173(1990).\n[14] M.T. Dove, Introduction to Lattice Dynamics (Cambridge University Press, Cambridge,\n1993).\n[15] A. Bilić and B. Gumhalter, Phys. Rev. B 52,12307(1995).\n[16] B. Gumhalter and A. Bilić, Surf. Sci. 370,47(1997).\n[17] B.J. Hinch, A. Lock, H.H. Madden, J.P. Toennies and G. Witte, Phys. Rev. B\n42,1547(1990).\n[18] J. Jupille, J.-J. Erhardt, D. Fargues and A. Cassuto, Faraday Discuss. Chem. Soc.\n89,323(1990); Vacuum 41/No. 1-3,399(1990).\n[19] J. Braun, D. Fuhrmann, M. Bertino, A.P. Graham, J.P. Toennies, Ch. Wöll, A. Bilić\nand B. Gumhalter, J. Chem. Phys. 106,9922(1997).\n[20] M.A. Chesters, M. Hussain and J. Pritchard, Surf. Sci. 35,161(1973).\n[21] Th. Seyller, M. Caragiu, R.D. Diehl, P. Kaukasoina and M. Lindroos, Chem. Phys. Lett.\n291,567(1998).\n[22] M.A. Chesters and J. Pritchard, Surf. Sci. 28,460(1971).\n[23] A. Glachant and U. Bardi, Surf. Sci. 87,187(1979).\n[24] Ch. Wöll, Appl. Phys. A53,377(1991).\n[25] U. Harten, J.P. Toennies and Ch. Wöll, Faraday Discuss. Chem. Soc. 80,137(1985).\n[26] B. Hall, D. L. Mills, P. Zeppenfeld, K. Kern, U. Becher and G. Comsa, Phys. Rev.\nB40,6326(1989).\n[27] A. Chizmeshya and E. Zaremba, Surf. Sci. 268,432(1992).\n\n35\n\n\f[28] G. Vidali, G. Ihm, H.-Y. Kim, M.W. Cole, Surf. Sci. Rep. 12,133(1991).\n[29] G. Benedek, J. Ellis, N.S. Luo, A. Reichmuth, P. Ruggerone and J.P. Toennies\nPhys. Rev. B48,4917(1993); C. Kaden, P. Ruggerone, J.P. Toennies, G. Zhang and\nG. Benedek, Phys. Rev. B46,13509(1992).\n[30] R. E. Allen, G. P. Alldredge, and F. W. de Wette, Phys. Rev. B4, 1648 (1971).\n[31] V. Celli in Surface Phonons, editors W. Kress and F.W. de Wette (Springer, Berlin\n1991), p.167.\n[32] G. Santoro and V. Bortolani in Inelastic Energy Transfer in Interactions with Surfaces\nand Adsorbates, edited by B. Gumhalter, A.C. Levi and F. Flores (World Scientific,\nSingapore, 1993), p. 1.\n[33] A. Glebov, W. Silvestri, J.P. Toennies, G. Benedek and J.G. Skofronick, Phys. Rev.\nB54,17866(1996).\n[34] N.D. Lang, Phys. Rev. Lett. 46,842(1981); N.D. Lang and A. R. Williams, Phys. Rev.\nB25,2940(1982).\n[35] B. Hall, D.L. Mills and J.E. Black, Phys. Rev. B 32,4932(1985).\n[36] J. Ellis, J.P. Toennies and G. Witte, J. Chem. Phys. 102,5059(1995).\n[37] B. Gumhalter, unpublished.\n[38] M. Wolf, E. Knoesel and T. Hertel, Phys. Rev. B54,R5295(1996).\n[39] K. Burke, B. Gumhalter and D.C. Langreth, Phys. Rev. B47,12852(1993-I).\n[40] B. Gumhalter, K. Burke and D.C. Langreth, Surf. Rev. Lett., 1,133(1994).\n[41] J. Braun, D. Fuhrmann, J.P. Toennies, Ch. Wöll, A. Bilić and B. Gumhalter, Surf. Sci.\n368,232(1996).\n[42] V. Celli, D. Himes, P. Tran, J.P. Toennies, Ch. Wöll and G. Zhang, Phys. Rev. Lett.\n36\n\n\f66,3160(1991).\n[43] J.R. Manson, V. Celli and D. Himes, Phys. Rev. B49,2782(1994); J.R. Manson, Comput. Phys. Communications 80,145(1994).\n[44] V. Bortolani and A.C. Levi, La Rivista del Nuovo Cimento 9/No. 11,1(1986).\n[45] V. Bortolani, A. Franchini, G. Santoro, J.P. Toennies, Ch. Wöll and G. Zhang,\nPhys. Rev. B40,3524(1989).\n[46] G. Witte, J.P. Toennies and Ch. Wöll, Surf. Sci. 323,228(1995).\n[47] W. Brenig, Z. Physik B 36,81(1979).\n[48] H.-D. Meyer, Surf. Sci. 104,117(1981).\n[49] R. Brako, Surf. Sci. 123,439(1982).\n[50] K. Kern, P. Zeppenfeld, R. David and G. Comsa, J. Electron Spec. Rel. Phen.\n44,215(1987).\n[51] B. Gumhalter, Surf. Sci. 347,237(1996).\n[52] It has been shown that an approximate expression similar to (5) can be obtained also for\nthe probability of electron scattering by optical surface phonons (see E. Evans and D.L.\nMills, Phys. Rev. B7,853(1973)). The validity of such expression has been demonstrated\nin a passage from quantum-mechanical to quasiclassical description of the projectile\nmotion assuming long range projectile-phonon interaction.\n[53] (a): J.R. Manson and G. Armand, Surf. Sci. 184,511(1987); (b): ibid. Surf. Sci.\n195,513(1988).\n[54] V. Celli, G. Benedek, U. Harten, J.P. Toennies, R.B. Doak and V. Bortolani, Surf. Sci.\n143,L376(1984).\n[55] K.T. Tang and J.P. Toennies, Z. Phys. D1,91(1986).\n\n37\n\n\f[56] U. Kleinekathöfer, K.T. Tang, J.P. Toennies and C.L. Yiu, Chem. Phys. Lett.\n249,257(1996); U. Kleinekathöfer, Ph.D. thesis, University Göttingen, 1996; MaxPlanck-Institut für Strömungsforschung Bericht 6/1996.\n[57] G. Gašparović, B.Sci. thesis, University of Zagreb, 1997 (unpublished).\n[58] A. Šiber and B. Gumhalter, Surf. Sci. 385,270(1997).\n[59] H. Hoinkes, H. Nahr and H. Wilsch, Surf. Sci. 33(1972)516, ibid. 40(1973)129; G. Armand, J. Lapujoulade and Y. Lejay, Surf. Sci. 63(1977)143.\n[60] A. Franchini, G. Santoro, V. Bortolani, A. Bellman, D. Cvetko, L. Floreano, A. Morgante, M. Peloi, F. Tommasini and T. Zambelli, Surf. Rev. Lett. 1,67(1994).\n[61] A.F. Devonshire, Proc. Roy. Soc. A 158,253(1937).\n[62] H. Kasai and W. Brenig, Z. Phys. B59,429(1985).\n[63] J.R. Manson, Phys. Rev. B37,6750(1988).\n[64] B. Gumhalter, A. Šiber and J.P. Toennies, submitted for publication.\n[65] D. Eichenauer, U. Harten, J.P. Toennies and V. Celli, J. Chem. Phys. 86,3693(1957).\n[66] C.M. Hedenäs and M. Persson, Phys. Rev. B45,11273(1992).\n[67] W.Steele, Surf. Sci. 36, 317 (1973)\n[68] M. Cieplak, E.D. Smith and M.O. Robbins, Science 265,1209 (1994)\n[69] A.D. Crowell and R.B. Steele, J. Chem. Phys. 34,1347 (1961).\n[70] B.N.J. Persson and A. Nitzan, Surf. Sci. 367,261(1996).\n\n38\n\n\fFIGURES\n√\n√\nFIG. 1. (a) Right panel: Structure of ( 3 × 3)R30◦ monolayer of Xe atoms (shaded circles)\non (111) surface of Cu crystal, with two high symmetry directions (azimuths) in the substrate\nsurface plane denoted. Left panel: Two dimensional Brillouin zones of the Cu(111) surface (dashed\nlines) and of Xe adlayer (full lines). (b) He-atom angular distribution along the [11̄0] azimuth of\n√\n√\nCu(111) from Xe ( 3 × 3)R30◦ monolayer for incident wave vector ki = 9.2 Å−1 (Ei =45 meV)\nand surface temperature 60 K. Peaks normalized to the height of the specular peak.\nFIG. 2. He-atom angular distribution along the [100] azimuth of the substrate from an incommensurate hexagonal monolayer of Xe atoms adsorbed on Cu(001) for ki = 5.25 Å−1 (Ei = 14.36\nmeV) and substrate temperature 52 K.\nFIG. 3. Series of measured HAS TOF spectra for a monolayer of Xe on Cu(111) along the\n[112̄] direction of the substrate surface for three representative He atom incident energies. θi and\nθSD denote the angle of incidence and the fixed total scattering angle, respectively. Vertical scale\nmeasures relative peak heights in arbitrary units. Scattering parameters shown in the insets.\nFIG. 4. Series of measured HAS TOF spectra for a monolayer of Xe on Cu(001) along the\n[100] direction of Cu surface for three representative He atom incident energies. Vertical scale in\narbitrary units. Scattering parameters shown in the insets.\nFIG. 5. Phonon dispersions for Xe/Cu(111) surface along the [112̄] direction relative to the\nsubstrate as determined by HAS (full circles). The solid line denotes the best fit achieved for the\nlongitudinal (L) mode in the Xe adlayer and the dashed-dotted line is the result for the L-mode\nusing the gas phase Xe-Xe potential. The theoretical dispersion curve for the vertically polarized\nS-mode is marked by the long dashed line and of the Rayleigh phonon and the projected bulk\nphonon edge of the Cu substrate by the full thin and dotted line, respectively. For force constants\nsee main text.\n\n39\n\n\fFIG. 6. Phonon dispersions for Xe/Cu(001) surface along the [100] direction relative to the Cu\nsubstrate as determined by HAS (full circles). The full curve represents the best fit achieved for the\nlongitudinal (L) mode, the flat dashed curve shows a theoretical dispersion curve for the S-mode,\nthe dot-dashed line indicates the position of the L-mode using the gas phase force constant. Dashed\ncurve indicates the position of the Rayleigh wave on the Cu(001) surface. For force constants see\nmain text.\nFIG. 7. (a) Off-shell matrix elements of the potential which couples the projectile to in-plane\nsurface vibrations (see text) for Q = 0 and three different values of the incoming perpendicular\nwave vector: kzi = 3.5 Å(full line), kzi = 7.0 Å(dashed line) and kzi = 14.0 Å(dotted line), as\nfunction of scattered wave vector kz′ . Potential parameters corresponding to Xe/Cu(111) system.\n(b) Same for projectile coupling to perpendicular vibrations.\nFIG. 8. Calculated dispersion curves of S-, L- and SH-phonons (from top to bottom) over 1/6\nof the two dimensional first Brillouin zone, i.e. between two equivalent high symmetry directions,\ncorresponding to a floating Xe adlayer on Cu(001). For force constants parametrization see main\ntext. The angle φ is measured relative to Γ̄M̄Xe direction of the Brillouin zone of the superstructure.\nFIG. 9. (a) Dispersion curves for Xe/Cu(111) system along the [112̄] direction calculated using\nthe dynamical matrix approach (see text) with Xe atoms on-top of Cu atoms. Force constants\nparametrization same as in Ref. [10]. Note the S-, L- and SH-mode dispersion curves detached\nfrom the bulk quasi-continuum. (b) Surface localization of Xe induced S-, L- and SH-modes on\nthe adlayer expressed through the sum of the components of the respective polarization vectors in\nthe adlayer. Numbers below symbols △ denote frequencies (in meV) of the S-mode. (c) Ellipticity\n(vertical vs. longitudinal polarization) of the L-mode in Xe adlayer on Cu(111) substrate as function\nof phonon wave vector. Percentage above full squares denotes surface localization of the L-mode.\n\n40\n\n\fFIG. 10. (a) Calculated DWBA and EBA scattering intensities for emitting one S-phonon\n(lower and upper full curves, respectively, marked by (+)) and absorbing one S-phonon (lower\nand upper dashed curves, respectively, marked by (−)) in HAS from Xe/Cu(001) as function of\nexchanged phonon wave vector Q for the scattering conditions as denoted. For potential parameters\nsee main text. Inset: Corresponding projectile transition probabilities in one phonon loss and gain\nprocesses denoted by full and dashed lines, respectively. (b) Same for Xe/Cu(111) system.\nFIG. 11. (a) Calculated DWBA HAS intensity for L-phonon emission (full curve) and L-phonon\nabsorption (dashed curve) in Xe/Cu(001) as function of exchanged phonon momentum. For interpretation of the maxima and minima see main text. (b) Same for Xe/Cu(111) system.\nFIG. 12.\n\nPlots of the various contributions to the Debye-Waller factor pertinent to\n\nHe→Xe/Cu(001) collision system as function of substrate temperature Ts and for the scattering conditions as denoted. Dotted line: only S-phonons included; dashed line: S- and L-phonons\nincluded; full line: S-, L- and SH-phonons included. Note the logarithmic scale on the ordinate\naxis. Here the Q summation in Eq. (6) to obtain the DW exponent was carried out over the first\nand second surface Brillouin zone of the superstructure.\nFIG. 13. Comparison of experimental and calculated S- and L-mode intensities in the single-phonon scattering spectra typical of He→Xe/Cu(111) collisions.\nFIG. 14. Comparison of experimental and calculated S- and L-mode intensities in the single-phonon scattering spectra typical of He→Xe/Cu(001) collisions. Expanded contours in the\ntopmost panel show the positions and relative intensities of the L-mode peaks calculated with\nthe present softened Xe-Xe radial force constants (full curve) and unmodified gas phase potential-derived [13] force constants (diamonds). Similar differences are obtained for other two spectra.\nSH-derived peaks not discernible on the present scale.\n\n41\n\n\fFIG. 15. (a) Comparison of experimental and calculated EBA multiphonon scattering spectra\ntypical of He→Xe/Cu(111) collisions using the same potentials and dispersion relations as in Fig.\n13. (b) Same for He→Xe/Cu(001) collisions using the potentials and dispersion relations as in Fig.\n14.\n\n42\n\n\fK\nΓ\n\nMXe\n\nM\nKXe\n[112]\n\na)\n\nNormalized Intensity\n\n[110]\n\n1.0 T =60K\nS\n\nx75\n\n[110]\n\n-1\n0.8 k=9.1Å\n\n2 1\n3\n\n0.6\n0.4\n\n1\n3\n\n0.2\n0.0\n-6\n\n-4\n\n-2\n\n0\n\n2\n\n∆K [Å ]\n-1\n\n4\n\n6\nb)\n\n\f600000\n\nCu(100)+Xe\n\nIntensity [cps]\n\n500000\n\n400000\n\n300000\n\n200000\n\nx25\n100000\n\n0\n-2\n\n0\n\n∆K [Å\n\n2\n\n-1\n\n]\n\n\fIntensity\n\nθ i = 43o\n\nEi = 9.9 meV\nTS = 57 K\n\n\"L\"\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\nθ i = 50o\n\nXe/Cu(111)<112>\n\nEi = 21.4 meV\n\nθ SD = 90.5o\n\nTS = 58 K\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\nθ i = 50o\n\nEi = 45.1 meV\nTS = 58 K\n\n-20\n\n-10\n\n0\n\n10\n\nEnergy transfer [meV]\n\n20\n\n\fIntensity\n\nθ i = 50.4o\n\nEi = 8.1 meV\nTS = 50 K\n\n\"L\"\n\n-4\n\n-2\n\n0\n\n2\n\nθ i = 46o\n\nXe/Cu(001)<100>\nθ SD = 95.8o\n\n-10\n\n4\n\nEi = 16.3 meV\n\nRW\n\n-5\n\nTS = 50 K\n\n0\n\n5\n\n10\n\nθ i = 46o\n\nEi = 36.3 meV\nTS = 44 K\n\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\nEnergy transfer [meV]\n\n15\n\n\f4\n\nhω [meV]\n\n3\n\nS\n\n2\n\n1\nL\n0\n0.0\n\n0.1\n\n0.2\nQ [Å-1]\n\n0.3\n\n\f4\nRW\n\nhω [meV]\n\n3\nS\n\n2\nL\n\n1\n\n0\n\n0.0\n\n0.2\n\n0.4\n\n-1\n\nQ [A ]\n\n0.6\n\n0.8\n\n\fmatrix element of potential\n10\n\n5\n\n0\n\n-5\n0\n\na)\n\n5\n10\n\nkz' [1/Å]\n\n15\n20\n\n\fmatrix element of derivative of potential\n30\n\n20\n\n10\n\n0\n0\n\nb)\n\n5\n10\n\nkz' [1/Å]\n\n15\n20\n\n\f3.0\n\nhω [m eV]\n\n2.5\n2.0\n1.5\n1.0\n0.5\n0\n20\n\nφ[\n\nde\n\n40\n\ng]\n\n60\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\nQ [1 /Å ]\n\n0.8\n\n\f12\n\nhω [meV]\n\n10\n8\n\na)\n\n6\n\nXe / Cu(111) <112>\n\n4\n\nS\nL\n\n2\n\nSH\n0\n0.0\n\n0.2\n\n0.4\n\nQ [1/Å]\n\n0.6\n\n0.8\n\n\fΣ (all polarizations) | eQ,j | 2 in Xe layer\n\n1.0\n(2.52) (2.55) (2.56) (2.57)\n(2.48)\n\n0.9\n\nb)\n\n(2.61)\n(2.40)\n\n(2.68)\n\n0.8\n(2.57)\n\nSH mode\nL mode\nS mode\n\n0.7\n\n0.6\n0.0\n\n(2.62)\n\n0.1\n\n0.2\n\n0.3\n\nQ [1/Å]\n\n0.4\n\n0.5\n\n\fEllipticity of L - mode [%]\n\n16\n80 %\n\n14\n\nc)\n\n12\n88 %\n10\n8\n96 %\n\n95 %\n\n6\n98 %\n4\n\n98 %\n\n2\n0\n0.00\n\n0.01\n\n0.02\n\n0.03\n\nQ [1/Å]\n\n0.04\n\n0.05\n\n\fS - intensity\n\na)\n0.02\n\nHe Xe / Cu(001)\nEi = 8.5 meV, TS = 50 K\n\ntransition probabilities\n\n0.03\n\n0.006\n\n0.004\n\n0.002\n\n0.000\n\n-1\n\n0\n\n1\n\nQ [1/Å]\n\nθ SD = 95.8o\n\n+\n+\n\n0.01\n\n_\n_\n0.00\n-1\n\n0\n\nQ [1/Å]\n\n1\n\n\fb)\nS - intensity\n\n0.03\n\n0.02\n\nHe Xe / Cu(111)\nEi = 9.9 meV, TS = 60 K\n\ntransition probabilities\n\n0.04\n\n0.008\n0.006\n0.004\n0.002\n0.000\n\n-1\n\n0\n\n1\n\nQ [1/Å]\n\n+\n\nθ SD = 90.5o\n\n+\n_\n\n0.01\n\n_\n0.00\n-1\n\n0\n\nQ [1/Å]\n\n1\n\n\f0.0020\nHe\nXe / Cu(001)\nEi = 8.5 meV , TS = 50 K\n\na)\n\nθ SD = 95.8\n\nL - intensity\n\n0.0015\n\no\n\n0.0010\n\n0.0005\n\n0.0000\n-1.0\n\n-0.5\n\n0.0\n\nQ [1/Å]\n\n0.5\n\n1.0\n\n\f0.003\nHe <112>Xe / Cu(111)\nEi = 9.9 meV , TS = 60 K\n\nb)\n\nθ SD = 90.5\n\no\n\nL - intensity\n\n0.002\n\n0.001\n\n0.000\n-1.0\n\n-0.5\n\n0.0\n\nQ [1/Å]\n\n0.5\n\n1.0\n\n\f1\nHe\n\nXe/Cu(001)\n\nDWF\n\nEi = 8.5 meV , θi = 50o\n\n0.1\n0.05\n0\n\n20\n\n40\n\nTS [K]\n\n60\n\n80\n\n\fXe / Cu(111)\n\nEi=9.84 meV , TS=60 K\nθi=47o , θ SD=90.50o\n\nEi=9.85 meV , TS=58.6 K\n\nIntensity\n\nθi=44.5o , θ SD=90.50o\n\nEi=9.87 meV , TS=59.1 K\nθi=44.02o , θ SD=90.50o\n\n-4\n\n-2\n\n0\n\n2\n\nEnergy transfer [meV]\n\n4\n\n\fXe / Cu(001)\n\nEi=8.1 meV , TS=50 K\nθi=51.9o , θ SD=95.8o\n\nx7\n\nIntensity\n\nEi=8.50 meV , TS=50 K\nθi=45.9o , θ SD=95.8o\n\nEi=8.08 meV , TS=50 K\nθi=39.4o , θ SD=95.8o\n\n-4\n\n-2\n\n0\n\n2\n\nEnergy transfer [meV]\n\n4\n\n\fa)\n\nHe <112>Xe / Cu(111)\nEi = 45.11 meV , TS = 58.2 K\no\n\no\n\nIntensity\n\nθi = 50 , θ SD = 90.5\n\n-20\n\n-10\n\n0\n\n10\n\nEnergy transfer [meV]\n\n20\n\n\fHe Xe / Cu(001)\nEi = 16.27 meV , TS = 50 K\n\nb)\n\no\n\no\n\nIntensity\n\nθi = 45.9 , θ SD = 95.8\n\n-10\n\n-5\n\n0\n\n5\n\nEnergy transfer [meV]\n\n10\n\n\f"}