{"id": "http://arxiv.org/abs/cond-mat/0007449v1", "guidislink": true, "updated": "2000-07-27T18:03:29Z", "updated_parsed": [2000, 7, 27, 18, 3, 29, 3, 209, 0], "published": "2000-07-27T18:03:29Z", "published_parsed": [2000, 7, 27, 18, 3, 29, 3, 209, 0], "title": "Ohta-Jasnow-Kawasaki Approximation for Nonconserved Coarsening under\n  Shear", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0007022%2Ccond-mat%2F0007234%2Ccond-mat%2F0007269%2Ccond-mat%2F0007462%2Ccond-mat%2F0007175%2Ccond-mat%2F0007291%2Ccond-mat%2F0007124%2Ccond-mat%2F0007493%2Ccond-mat%2F0007248%2Ccond-mat%2F0007323%2Ccond-mat%2F0007297%2Ccond-mat%2F0007167%2Ccond-mat%2F0007471%2Ccond-mat%2F0007029%2Ccond-mat%2F0007485%2Ccond-mat%2F0007044%2Ccond-mat%2F0007172%2Ccond-mat%2F0007441%2Ccond-mat%2F0007237%2Ccond-mat%2F0007286%2Ccond-mat%2F0007087%2Ccond-mat%2F0007372%2Ccond-mat%2F0007197%2Ccond-mat%2F0007162%2Ccond-mat%2F0007300%2Ccond-mat%2F0007315%2Ccond-mat%2F0007140%2Ccond-mat%2F0007502%2Ccond-mat%2F0007504%2Ccond-mat%2F0007232%2Ccond-mat%2F0007348%2Ccond-mat%2F0007284%2Ccond-mat%2F0007196%2Ccond-mat%2F0007351%2Ccond-mat%2F0007436%2Ccond-mat%2F0007193%2Ccond-mat%2F0007046%2Ccond-mat%2F0007353%2Ccond-mat%2F0007271%2Ccond-mat%2F0007439%2Ccond-mat%2F0007336%2Ccond-mat%2F0007099%2Ccond-mat%2F0007400%2Ccond-mat%2F0007134%2Ccond-mat%2F0007475%2Ccond-mat%2F0007364%2Ccond-mat%2F0007506%2Ccond-mat%2F0007005%2Ccond-mat%2F0007217%2Ccond-mat%2F0007468%2Ccond-mat%2F0007304%2Ccond-mat%2F0007102%2Ccond-mat%2F0007198%2Ccond-mat%2F0007488%2Ccond-mat%2F0007334%2Ccond-mat%2F0007394%2Ccond-mat%2F0007164%2Ccond-mat%2F0007080%2Ccond-mat%2F0007066%2Ccond-mat%2F0007088%2Ccond-mat%2F0007498%2Ccond-mat%2F0007337%2Ccond-mat%2F0007505%2Ccond-mat%2F0007413%2Ccond-mat%2F0007213%2Ccond-mat%2F0007360%2Ccond-mat%2F0007016%2Ccond-mat%2F0007386%2Ccond-mat%2F0007252%2Ccond-mat%2F0007149%2Ccond-mat%2F0007257%2Ccond-mat%2F0007395%2Ccond-mat%2F0007437%2Ccond-mat%2F0007344%2Ccond-mat%2F0007283%2Ccond-mat%2F0007318%2Ccond-mat%2F0007158%2Ccond-mat%2F0007350%2Ccond-mat%2F0007145%2Ccond-mat%2F0007470%2Ccond-mat%2F0007006%2Ccond-mat%2F0007241%2Ccond-mat%2F0007327%2Ccond-mat%2F0007250%2Ccond-mat%2F0007368%2Ccond-mat%2F0007011%2Ccond-mat%2F0007402%2Ccond-mat%2F0007347%2Ccond-mat%2F0007335%2Ccond-mat%2F0007407%2Ccond-mat%2F0007059%2Ccond-mat%2F0007449%2Ccond-mat%2F0007138%2Ccond-mat%2F0007028%2Ccond-mat%2F0007416%2Ccond-mat%2F0007309%2Ccond-mat%2F0007190%2Ccond-mat%2F0007201%2Ccond-mat%2F0007404%2Ccond-mat%2F0007447%2Ccond-mat%2F0007249&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ohta-Jasnow-Kawasaki Approximation for Nonconserved Coarsening under\n  Shear"}, "summary": "We analytically study coarsening dynamics in a system with nonconserved\nscalar order parameter, when a uniform time-independent shear flow is present.\nWe use an anisotropic version of the Ohta-Jasnow-Kawasaki approximation to\ncalculate the growth exponents in two and three dimensions: for d=3 the\nexponents we find are the same as expected on the basis of simple scaling\narguments, that is 3/2 in the flow direction and 1/2 in all the other\ndirections, while for d=2 we find an unusual behavior, in that the domains\nexperience an unlimited narrowing for very large times and a nontrivial\ndynamical scaling appears. In addition, we consider the case where an\noscillatory shear is applied to a two-dimensional system, finding in this case\na standard t^1/2 growth, modulated by periodic oscillations. We support our\ntwo-dimensional results by means of numerical simulations and we propose to\ntest our predictions by experiments on twisted nematic liquid crystals.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0007022%2Ccond-mat%2F0007234%2Ccond-mat%2F0007269%2Ccond-mat%2F0007462%2Ccond-mat%2F0007175%2Ccond-mat%2F0007291%2Ccond-mat%2F0007124%2Ccond-mat%2F0007493%2Ccond-mat%2F0007248%2Ccond-mat%2F0007323%2Ccond-mat%2F0007297%2Ccond-mat%2F0007167%2Ccond-mat%2F0007471%2Ccond-mat%2F0007029%2Ccond-mat%2F0007485%2Ccond-mat%2F0007044%2Ccond-mat%2F0007172%2Ccond-mat%2F0007441%2Ccond-mat%2F0007237%2Ccond-mat%2F0007286%2Ccond-mat%2F0007087%2Ccond-mat%2F0007372%2Ccond-mat%2F0007197%2Ccond-mat%2F0007162%2Ccond-mat%2F0007300%2Ccond-mat%2F0007315%2Ccond-mat%2F0007140%2Ccond-mat%2F0007502%2Ccond-mat%2F0007504%2Ccond-mat%2F0007232%2Ccond-mat%2F0007348%2Ccond-mat%2F0007284%2Ccond-mat%2F0007196%2Ccond-mat%2F0007351%2Ccond-mat%2F0007436%2Ccond-mat%2F0007193%2Ccond-mat%2F0007046%2Ccond-mat%2F0007353%2Ccond-mat%2F0007271%2Ccond-mat%2F0007439%2Ccond-mat%2F0007336%2Ccond-mat%2F0007099%2Ccond-mat%2F0007400%2Ccond-mat%2F0007134%2Ccond-mat%2F0007475%2Ccond-mat%2F0007364%2Ccond-mat%2F0007506%2Ccond-mat%2F0007005%2Ccond-mat%2F0007217%2Ccond-mat%2F0007468%2Ccond-mat%2F0007304%2Ccond-mat%2F0007102%2Ccond-mat%2F0007198%2Ccond-mat%2F0007488%2Ccond-mat%2F0007334%2Ccond-mat%2F0007394%2Ccond-mat%2F0007164%2Ccond-mat%2F0007080%2Ccond-mat%2F0007066%2Ccond-mat%2F0007088%2Ccond-mat%2F0007498%2Ccond-mat%2F0007337%2Ccond-mat%2F0007505%2Ccond-mat%2F0007413%2Ccond-mat%2F0007213%2Ccond-mat%2F0007360%2Ccond-mat%2F0007016%2Ccond-mat%2F0007386%2Ccond-mat%2F0007252%2Ccond-mat%2F0007149%2Ccond-mat%2F0007257%2Ccond-mat%2F0007395%2Ccond-mat%2F0007437%2Ccond-mat%2F0007344%2Ccond-mat%2F0007283%2Ccond-mat%2F0007318%2Ccond-mat%2F0007158%2Ccond-mat%2F0007350%2Ccond-mat%2F0007145%2Ccond-mat%2F0007470%2Ccond-mat%2F0007006%2Ccond-mat%2F0007241%2Ccond-mat%2F0007327%2Ccond-mat%2F0007250%2Ccond-mat%2F0007368%2Ccond-mat%2F0007011%2Ccond-mat%2F0007402%2Ccond-mat%2F0007347%2Ccond-mat%2F0007335%2Ccond-mat%2F0007407%2Ccond-mat%2F0007059%2Ccond-mat%2F0007449%2Ccond-mat%2F0007138%2Ccond-mat%2F0007028%2Ccond-mat%2F0007416%2Ccond-mat%2F0007309%2Ccond-mat%2F0007190%2Ccond-mat%2F0007201%2Ccond-mat%2F0007404%2Ccond-mat%2F0007447%2Ccond-mat%2F0007249&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analytically study coarsening dynamics in a system with nonconserved\nscalar order parameter, when a uniform time-independent shear flow is present.\nWe use an anisotropic version of the Ohta-Jasnow-Kawasaki approximation to\ncalculate the growth exponents in two and three dimensions: for d=3 the\nexponents we find are the same as expected on the basis of simple scaling\narguments, that is 3/2 in the flow direction and 1/2 in all the other\ndirections, while for d=2 we find an unusual behavior, in that the domains\nexperience an unlimited narrowing for very large times and a nontrivial\ndynamical scaling appears. In addition, we consider the case where an\noscillatory shear is applied to a two-dimensional system, finding in this case\na standard t^1/2 growth, modulated by periodic oscillations. We support our\ntwo-dimensional results by means of numerical simulations and we propose to\ntest our predictions by experiments on twisted nematic liquid crystals."}, "authors": ["Andrea Cavagna", "Alan J. Bray", "Rui D. M. Travasso"], "author_detail": {"name": "Rui D. M. Travasso"}, "author": "Rui D. M. Travasso", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.62.4702", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0007449v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0007449v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 RevTeX pages, 7 EPS figures. To be published in Phys. Rev. E", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0007449v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0007449v1", "journal_reference": "Phys. Rev. E 62, 4702 (2000).", "doi": "10.1103/PhysRevE.62.4702", "fulltext": "Ohta-Jasnow-Kawasaki Approximation for Nonconserved Coarsening under Shear\nAndrea Cavagna∗, Alan J. Bray† and Rui D. M. Travasso‡\n\narXiv:cond-mat/0007449v1 [cond-mat.stat-mech] 27 Jul 2000\n\nDepartment of Physics and Astronomy, The University, Oxford Road, Manchester, M13 9PL, United Kingdom\n(July 27, 2000)\nWe analytically study coarsening dynamics in a system with nonconserved scalar order parameter,\nwhen a uniform time-independent shear flow is present. We use an anisotropic version of the OhtaJasnow-Kawasaki approximation to calculate the growth exponents in two and three dimensions:\nfor d = 3 the exponents we find are the same as expected on the basis of simple scaling arguments,\nthat is 3/2 in the flow direction and 1/2 in all the other directions, while for d = 2 we find an\nunusual behavior, in that the domains experience an unlimited narrowing for very large times and\na nontrivial dynamical scaling appears. In addition, we consider the case where an oscillatory shear\nis applied to a two-dimensional system, finding in this case a standard t1/2 growth, modulated by\nperiodic oscillations. We support our two-dimensional results by means of numerical simulations\nand we propose to test our predictions by experiments on twisted nematic liquid crystals.\n\nI. INTRODUCTION\n\nWhen a statistical system in its homogeneous disordered phase is suddenly quenched below the critical temperature,\ndeep into a multi-phase coexistence region, a dynamical process known as coarsening, or phase-ordering, results:\ndomains of the different ordered phases are formed and compete with each other in the attempt to break the symmetry\nand project the system on to one single equilibrium state [1]. An equivalent phenomenon occurs in the case of binary\nfluids: a system at the critical concentration tries to phase-separate after the quench, by forming domains of the two\ndifferent components (spinodal decomposition). An interesting problem is the analysis of the dynamical evolution\nof these domains, and in particular the determination of their growth rate. In this aim a property shared by many\nstatistical systems, called dynamical scaling, stating that space and time scale homogeneously in the equal-time twopoint correlation function, C(r, t) = f [r/L(t)], proves very useful. It is then natural to identify the length scale L(t)\nas the typical size of the domains during coarsening. This length scale has generally a power-law dependence on\ntime, L(t) ∼ t1/z , sometimes with logarithmic corrections. The determination of the exponent z for many different\nstatistical systems has been the object of much effort in the past years and we can say that ordinary coarsening is\nnow quite well understood [1].\nA related topic, which is attracting growing attention in recent years, is the problem of phase-ordering when the\nsystem is subject to an external shear. Apart from the great technological relevance of such a problem, especially in\nthe case of spinodal decomposition, the basic theoretical understanding of the phenomena involved is far from being\nwell established [2–4]. When a shear is present, domain growth is heavily affected by the presence of the induced\nflow and the dynamical scaling behavior is drastically different from the case of ordinary coarsening. In particular,\ntwo main points are worthy of careful investigation: First, the growth of the domains is anisotropic and therefore the\ndynamical evolution is described by more than one exponent. The determination of the shear exponents is, of course,\nof the uppermost importance. Secondly, it is not clear whether the shear causes an interruption of coarsening, the\ndynamical balance between growth and deformation giving rise to a stationary state (as argued in [5]), or, on the\ncontrary, whether domain growth continues indefinitely. Experimental, numerical and theoretical evidence concerning\nboth these points is still very tentative [6].\nIn the present work we perform a theoretical investigation of the coarsening dynamics in a statistical system with\nnonconserved scalar order parameter (model A, in the classification of Hohenberg and Halperin [7]), when a shear\nflow uniform in space is present. If, on one hand, such a model is unsuitable for describing spinodal decomposition in\nbinary fluids, on the other hand it allows us to compute the growth exponents in any spatial dimension, in the context\nof a suitably modified version of the classic Ohta-Jasnow-Kawasaki (OJK) approximation [8]. When considering the\nrelevance of nonconserved dynamics for an advance in our understanding of domain growth in the presence of a shear,\nwe must take into account the fact that the only existing analytic calculations of the growth exponents for spinodal\n\n∗\n\nE-mail:andrea@a13.ph.man.ac.uk\nE-mail:bray@a13.ph.man.ac.uk\n‡\nE-mail:rui@a13.ph.man.ac.uk\n†\n\n1\n\n\fdecomposition (conserved dynamics, or model B) have been performed in the limit of infinite dimension N of the\norder parameter [9], where no saturation of coarsening is found. However, in that case the very concept of domains\nis meaningless and thus a calculation which takes into account the more physical case of a scalar order parameter\nis desirable. Besides, an understanding of the effect of shear on nonconserved coarsening is by itself an interesting\nproblem, both from the theoretical and experimental point of view. Indeed, experiments have been performed in the\npast on twisted nematic liquid crystals [10], showing that these systems are a perfect test for analytical results in\nstatistical models with nonconserved order parameter. Many results, from growth laws to persistence exponents, have\nbeen successfully tested on twisted nematic liquid crystals [11] and we therefore propose a shear experiment on such\nsystems to check the results of our calculation.\nWe investigate two very different cases: in the first, a shear uniform in time is applied and the behavior of the system\nis analyzed asymptotically for very large times. In the second case, we consider a shear flow which is periodically\noscillating in time and we study the properties of the model for times much longer than the period of the oscillation.\nThe primary effect of the shear flow is naturally to stretch the domains in the direction of the flow, such that they can\nbe roughly represented as highly elongated ellipsoids, with the growth taking place along the main axes. Two natural\nlength scales therefore arise, Lk and L⊥ , the size of the domain along the largest and the smallest axes, respectively.\nThe determination of the growth laws for these two length scales is the main objective of this work.\nIn the case of a time-independent shear, our results are nontrivial and, especially in two dimensions, quite unexpected. For d = 2 our calculation gives Lk ∼ γ 1/2 t (ln t)1/4 and L⊥ ∼ γ −1/2 (ln t)−1/4 , where γ is the shear rate,\nwhile for d = 3 we find Lk ∼ γt3/2 and L⊥ ∼ t1/2 . The three-dimensional exponents are the same as one would\nexpect on the basis of simple scaling arguments and are compatible with calculations for conserved dynamics in the\nlarge-N limit [9]: the growth along the flow is enhanced by a factor γt, while the transverse growth is unaffected by\nthe shear. On the other hand, the two-dimensional result comes as quite a surprise: the short size of the domains\nL⊥ goes asymptotically to zero for very large times, while the scale area grows as in the unsheared case, Lk L⊥ ∼ t.\nAs we shall show, there are topological arguments supporting this last result. As long as our approach is valid, we\ndo not find any evidence of the onset of a stationary state giving rise to an interruption of the coarsening process.\nHowever, in two dimensions our calculation breaks down when the thickness of the domains becomes comparable\nwith the interfacial width. We cannot say what happens when this stage is reached, but it is possible that some\nkind of stationary\nstate occurs in this\npregime. In the case of an oscillatory shear flow in two dimensions, we find\np\nLk ∼ t1/2 γ/ω fk (t) and L⊥ ∼ t1/2 ω/γ f⊥ (t), where ω is the frequency of the periodic flow: both length scales\ngrow like t1/2 , but are modulated by oscillatory functions, fk (t) and f⊥ (t), with the same period as the flow and with\nmutually opposite phase. In this case also, therefore, we do not find any stationary state.\nThe structure of the paper is the following. In Section II we introduce the OJK approximation, with the appropriate\nmodifications due to the presence of the shear. We end Section II by formulating some self-consistency equations for\nthe matrix encoding the anisotropy of the domains (the elongation matrix). Given the technical difficulty of such\nequations, in Section III we present some simple geometric arguments useful to achieve a better understanding of the\nasymptotic behavior of the many quantities involved in the calculation. The explicit solution of the equations in two\ndimensions, together with the calculation of the growth exponents, is carried out in Section IV for a time independent\nshear rate and in Section V for an oscillatory shear rate, while in Section VI we solve the time-independent problem\nin three dimensions. In Section VII we present some numerical simulations in two dimensions, supporting our results,\nand in Section VIII we discuss a possible experimental test in the context of twisted nematic liquid crystals. Finally,\nwe draw our conclusions in Section IX. A shorter account of part of this work can be found in [12].\nII. THE OJK APPROACH\n\nThe time evolution of a statistical system with nonconserved scalar order parameter φ(~x, t) is described by the\ntime-dependent Ginzburg-Landau equation [13]\n∂φ(~x, t)\n= ∇2 φ(~x, t) − V ′ (φ) ,\n∂t\n\n(1)\n\nwhere V (φ) is a double-well potential. Under the hypothesis that the thickness ξ of the interface separating different\ndomains is much smaller than the size L of the domains, it is possible to write an equation for the motion of the\ninterface itself, assumed to be well localized in space. This is the Allen-Cahn equation [14], asserting that the velocity\nv of the interface is proportional to the local curvature\n~ * ~n(~x, t) ,\nv(~x, t) = −∇\n2\n\n(2)\n\n\f~ * ~n(~x, t) is the curvature. The normal vector can be\nwhere ~n(~x, t) is the unit vector normal to the interface and ∇\nwritten in general as\n~n(~x, t) =\n\n~\n∇m(~\nx, t)\n,\n~\n|∇m(~\nx, t)|\n\n(3)\n\nwhere m(~x, t) can be any field which is zero at the interface of the domain, defined by the vanishing of the order\nparameter φ(~x, t). Given that this is the only restriction on the field m(~x, t), it is convenient not to use the order\nparameter itself in order to describe the motion of the interface via equation (2), but a smoother field [8]. Indeed,\nas we shall see, the principal effect of the OJK approximation is to produce a Gaussian distribution for the field\nm(~x, t), which would be particularly unsuitable for the highly non-Gaussian, double-peaked distribution of the order\nparameter φ(~x, t).\nFrom equations (2) and (3) we have\n!\nd\nd\nX\nX\n∇2 m(~x, t)\n∂a m(~x, t)\n∂a m(~x, t)∂b m(~x, t) ∂a ∂b m(~x, t)\n∂\n=−\n+\n.\n(4)\nv(~x, t) = −\n~\n~\n~\n~\n∂xa |∇m(~\nx, t)|\n|∇m(~x, t)|\n|∇m(~\nx, t)|2\n|∇m(~\nx, t)|\na=1\n\na,b=1\n\nBy considering a frame co-moving with the interface, we can write\n0=\n\ndm(~x, t)\n∂m(~x, t)\n~\n=\n+ ~vtot * ∇m(~\nx, t) .\ndt\n∂t\n\n(5)\n\nIf a shear flow is present, it can be taken into account by including in the total velocity ~vtot of the interface, a\ncontribution due to velocity field ~u induced by the shear\n~vtot = v~n + ~u ,\n\n(6)\n\nwhere v~n is the curvature driven velocity, with direction orthogonal to the interface and modulus given by (4). By\n~ = |∇m|,\n~\nsubstituting relation (4) into equation (5) and by noting that ~n * ∇m\nwe finally get the OJK equation\nd\nd\nX\n∂ 2 m(~x, t)\n∂m(~x, t) X ∂m(~x, t)\n= ∇2 m(~x, t) −\nna (~x, t) nb (~x, t)\n.\n+\nua\n∂t\n∂xa\n∂xa ∂xb\na=1\n\n(7)\n\na,b=1\n\nThis is an exact relation for the field m(~x, t). The OJK equation is highly nonlinear due to the dependence of the\nvector ~n on the field m through eq.(3). The OJK approximation [8] consists in replacing the factor na nb by its spatial\naverage\nDab (t) ≡ hna (~x, t)nb (~x, t)i .\n\n(8)\n\nNote that the elongation matrix Dab must satisfy the obvious sum rule\nd\nX\n\nDaa (t) = 1 .\n\n(9)\n\na=1\n\nIn the isotropic case (~u = 0) the elongation matrix is just Dab = δab /d by symmetry, and the OJK equation reduces\nto a simple diffusion equation with diffusion constant equal to (d − 1)/d. On the other hand, when a shear flow is\npresent the matrix Dab must encode the anisotropy induced by the shear and it must therefore depend on time, as\nthe average shape of the domains does. The system of equations we have to solve is therefore\nd\nd\nX\n∂m(~x, t) X ∂m(~x, t)\n∂ 2 m(~x, t)\n= ∇2 m(~x, t) −\nDab (t)\n,\n+\nua\n∂t\n∂xa\n∂xa ∂xb\na=1\na,b=1\n\u001d\n\u001c\n∂a m(~x, t) ∂b m(~x, t)\nP\n.\nDab (t) =\nx, t)]2\nc [∂c m(~\n\n(10)\n(11)\n\nIn this paper we will consider a space-uniform shear in the y direction, with flow in the x direction. The velocity\nprofile is therefore given by\n3\n\n\f~u = γy~ex ,\n\n(12)\n\nwhere γ is the shear rate and ~ex is the unit vector in the flow direction. In the present Section we will consider the\ncase of a time-independent shear rate γ. A straightforward generalization of the calculation to the periodic case will\nbe given in Section V.\nBy going into Fourier space we can rewrite equation (10) as\n\n\nd\nd\nX\n∂m(~k, t)  X 2\n∂m(~k, t)\n= −\n− γkx\nka +\nDab (t)ka kb  m(~k, t) .\n(13)\n∂t\n∂ky\na=1\na,b=1\n\nNote that a naive scaling analysis of the left-hand side of this equation would give\nLx (t) ∼ γt Ly (t) ,\n\n(14)\n\nwhere Lx and Ly are the characteristic domain sizes in the x and y directions respectively. If we assume that the\ndomain growth in the directions transverse to the flow is not modified by the shear, we obtain from (14) the results\nLx (t) ∼ γt3/2\nLy (t) ∼ t\n\n1/2\n\n(15)\n\n,\n\nwhere Ly now represents any transverse direction. This is the simple scaling we mentioned in the Introduction. As\nwe shall see, result (15) only holds in three dimensions, while a completely different situation occurs for d = 2.\nIn order to solve equation (13) we perform the change of variables\nqx = kx\nqy = ky + γkx t\nqa = ka , ∀ a ≥ 3\n\n(16)\n\nτ =t,\n\nintroducing the field μ(~\nq , τ ) ≡ m(~k, t). The corresponding equation for μ reads\nd\nX\n∂ ln μ(~\nq, τ )\n2\n2\n= −qx − (qy − γqx τ ) −\nqa2 +\n∂τ\na=3\n\n(17)\n\nD11 (τ )qx2 + 2D12 (τ )qx (qy − γqx τ ) + D22 (τ )(qy − γqx τ )2 +\n\nd\nX\n\nDab (τ )qa qb .\n\na,b=3\n\nThe original OJK equation (7), with a shear flow given by (12), is invariant under any transformation which preserves\nthe sign of the product xy. In order to keep this symmetry, it is necessary for the elongation matrix Dab to have the\nfollowing block-diagonal form\nD1a (t) = D2a (t) = 0\n\n,\n\nDab (t) = D33 (t) δab\n\n,\n\n∀ a, b ≥ 3 ,\n\n(18)\n\nwhere, to simplify the notation, we have used D33 (t) to denote all the diagonal elements for a ≥ 3. Equation (17) can\nnow be integrated to give\n\"\n#\n1X\nμ(~\nq , τ ) = μ(~\nq , 0) exp −\n(19)\nqa Rab (τ ) qb ,\n4\nab\n\nwith\n\nR11 (τ ) = 4\nR12 (τ ) = 4\n\nZ\n\nZ0 τ\n0\n\nR22 (τ ) = 4\n\nτ\n\nZ\n\n0\n\nτ\n\ndτ ′ {[1 − D11 (τ ′ )] + 2γτ ′ D12 (τ ′ ) + γ 2 τ ′2 [1 − D22 (τ ′ )]}\ndτ ′ {−D12 (τ ′ ) − γτ ′ [1 − D22 (τ ′ )]}\ndτ ′ [1 − D22 (τ ′ )]\n\n(20)\n\nR1a (τ ) = R2a (τ ) = 0 , ∀ a ≥ 3\nZ τ\nRab (τ ) = 4δab\ndτ ′ [1 − D33 (τ ′ )] ≡ R33 (τ ) δab , ∀ a, b ≥ 3 .\n0\n\n4\n\n\fWe can now go back to the original field m(~k, t), via the relation\nm(~k, t) = μ(kx , ky + γkx t, k3 , . . . , kd , t) ,\n\n(21)\n\nto obtain\n\"\n\n1X\nka Mab (t) kb\nm(~k, t) = m(kx , ky + γkx t, k3 , . . . , kd , 0) exp −\n4\nab\n\n#\n\n,\n\n(22)\n\nwith\nM11 (t) = R11 (t) + 2γtR12 (t) + γ 2 t2 R22 (t)\nM12 (t) = R12 (t) + γtR22 (t)\nM22 (t) = R22 (t)\n\n(23)\n\nM1a (t) = M2a (t) = 0 , ∀ a ≥ 3\nMab (t) = R33 (t) δab ≡ M33 (t) δab , ∀ a, b ≥ 3 .\nRelation (22) can be better understood in real space: due to the shear flow, the field m at point (x, y, . . .), at time t, is\nthe propagation of the initial condition at point (x − γyt, y, . . .). Note that, if we assume a Gaussian distribution for\nm(~k, 0) (disordered initial condition), the field maintains a Gaussian distribution at all the times, due to the linearity\nof equation (10). In order to get the correlation of m(~x, t) in real space we have to average over the initial conditions\n√\nhm(~k, 0)m(~k ′ , 0)i = ∆ δ(~k + ~k ′ ) .\n(24)\nThe equal time pair-correlation function of m is therefore\ns\n#\n\"\nd/2 ∆\nX\n1\n(2π)\nexp −\nra [M −1 ]ab (t) rb ,\nCm (~x, ~x′ ; t) ≡ hm(~x, t)m(~x′ , t)i =\ndet M (t)\n2\n\n(25)\n\nab\n\nwhere ra = xa − x′a . All the information on the domain growth is contained in the correlation matrix Mab (t). Indeed,\nthe eigenvectors of Mab (t) give the principal elongation axes of the domains and the square roots of its eigenvalues\ngive the domain sizes along these axes.\nThe correlation matrix is connected to the elongation matrix by equations (20) and (23). In order to close the\nproblem we have thus to write another set of equations, relating Mab (t) and Dab (t), by exploiting relation (11). If we\nintroduce the field φa (~x, t) ≡ ∂a m(~x, t), we can write\nZ\nZ\nZ\nP\n2\nφa (~x, t)φb (~x, t)\n1\n1 ∞\nDab (t) = DP (φ) P\ndy\nDP (φ) e− 2 y c φc (~x,t) φa (~x, t)φb (~x, t) ,\n=\n(26)\n2\n2 0\nx, t)\nc φc (~\n\nand we have thus to work out the probability distribution DP (φ). The field φ is Gaussian and therefore we just need\nto compute its correlator. From equation (25) we have\ns\n(2π)d/2 ∆\n−1\n,\n(27)\nhφa (~x, t)φb (~x, t)i = κ [M ]ab (t)\n,\nκ=\ndet M (t)\nand therefore\n\"\n#\n1 X\n1\nexp −\nφa (~x, t)Mab (t)φb (~x, t) Dφ ,\nDP (φ) =\nZ\n2κ\n\n(28)\n\nab\n\nwhere the constant Z normalizes the distribution. By defining\nNab (y, t) = Mab (t) + y δab ,\n√\nand by performing the rescaling φ → φ κ, y → y/κ, we can write\n5\n\n(29)\n\n\f1\nDab (t) =\n2\n\nZ\n\n0\n\n∞\n\ndy\n\nR\n\n1\n\nDφ e− 2\nR\n\n1p\n=\ndet M (t)\n2\n\nZ\n\n0\n\n∞\n\nP\n\nφa′ (~\nx,t)Na′ b′ (y,t)φb′ (~\nx,t)\nφa (~x, t)φb (~x, t)\nP\n1\n−\nx\n,t)M\nx,t)\n′ b′ (t)φb′ (~\n′ b′ φa′ (~\na\na\n2\ne\n\na′ b′\n\nDφ\n\n[N −1 ]ab (y, t)\n.\ndy p\ndet N (y, t)\n\n(30)\n\nLet us introduce the following parameters in order to explicitly write the relation above:\nσ(t) ≡ M11 (t)M22 (t) − M12 (t)2 = R11 (t)R22 (t) − R12 (t)2 ,\nτ (t) ≡ M11 (t) + M22 (t) .\n\n(31)\n\nThe first equation is a particular case of the more general relation det M = det R, a consequence of the fact that (16)\nis an orthogonal transformation. We can finally write\nZ ∞\nq\n11\n1\nM22\n(t) + y\n22\nσ(t)M33 (t)d−2\nD11\n(t) =\ndy\nd−2\n3\n2\n2\n[y + τ (t)y + σ(t)] 2 [M33 (t) + y] 2\n0\nZ ∞\nq\n1\nM12 (t)\nσ(t)M33 (t)d−2\n(32)\n−D12 (t) =\ndy\nd−2\n3\n2\n2\n[y + τ (t)y + σ(t)] 2 [M33 (t) + y] 2\n0\nZ ∞\nq\n1\n1\nd−2\nσ(t)M33 (t)\nD33 (t) =\ndy\n1\nd .\n2\n2\n[y + τ (t)y + σ(t)] 2 [M33 (t) + y] 2\n0\nRelations (20), (23) and (32) form a closed set of equations for the correlation matrix Mab (t), or, equivalently, for the\nelongation matrix Dab (t). Before attempting to solve them, it is helpful to use physical considerations as a guide to\nthe expected asymptotic form of the elongation matrix in the limit of very large times. To this aim, we will consider\nthe case of a time-independent shear rate.\nIII. PHYSICAL CONSIDERATIONS ON THE ELONGATION MATRIX\n\nWhen a time-independent shear flow in the x direction is present, the domains will be highly elongated along this\ndirection and therefore most of the surface of the domains will tend to become parallel to the x direction for very\nlarge times. We thus expect the following relation to hold\nD11 (t) = hnx nx i → 0\n\n,\n\nt→∞.\n\n(33)\n\nIn the two-dimensional case, due to the sum rule (9), this relation implies\nD22 (t) = hny ny i → 1\n\n,\n\nt→∞ ,\n\nd=2,\n\n(34)\n\nwhile in dimensions d ≥ 3 it is not a priori clear whether both D22 and D33 remain nonzero or not. The only thing\nwe can write is\nD22 (t) + (d − 2)D33 (t) → 1 ,\n\nt→∞ ,\n\nd≥3.\n\n(35)\n\nWith regard to the off-diagonal elements of the elongation matrix, it is not hard to convince oneself that the only\nnonzero ones can be D12 (t) = D21 (t) = hnx ny i (see equation (18)): indeed, due to the shear, the domains are\n(xy)\nelongated along two main axes which are not the (xy) axes, unless t = ∞. Therefore, the sub-matrix Dab (t) cannot\nbe diagonal for any finite time. On the other hand, for t → ∞ the two elongation axes become coincident with (xy)\nand thus we expect that\nD12 (t) → 0\n\n,\n\nt→∞.\n\n(36)\n\nIt is finally clear that no qualitative difference can exist between d = 3 and d > 3. Indeed, in this paper we will\nexplicitly state the results only for d = 2 and d = 3.\nA useful exercise is to approximate a domain with an ellipsoid and compute the asymptotic value of Dab (t) as a\nfunction of the main axes. We will do this explicitly in two dimensions and we will just quote the main results for\nd = 3. Let us call Lk and L⊥ the largest and smallest axis of a two-dimensional ellipse. Besides, let θ be the tilt\nangle, that is the angle between the x axis and the Lk axis (see Fig.1).\n6\n\n\fy\n\nflow direction\n\nL\nL\n\nθ\nx\n\nFIG. 1. A two-dimensional domain in the elliptic approximation.\n\nWhen a time-independent shear is applied, it is natural to assume for t → ∞:\nθ→0 ,\n\nLk ≫ L⊥ ,\n\n(37)\n\nas an expression of the extreme elongation of the domain in the direction of the flow. We can now parametrise the\ntilted ellipse in the following way\n1\n1\nLk cos ω − θL⊥ sin ω\n2\n2\n1\n1\ny(ω) = θLk cos ω + L⊥ sin ω ,\n2\n2\n\nx(ω) =\n\n(38)\n\nwith ω ∈ [0, 2π] and where we have used the fact that θ is very small. The average of any quantity A along the\nperimeter of the ellipse can now be calculated as,\nR 2π\ndω μ(ω)A(ω)\n,\n(39)\nhAi = 0 R 2π\n0 dω μ(ω)\nwith the metric μ given by\n\nμ(ω) =\n\n1 2 2\n(L sin ω + L2⊥ cos2 ω)1/2 .\n2 k\n\n(40)\n\nIt is useful to compute explicitly the normalizing factor in (39), i.e. the asymptotic perimeter of the ellipse,\nZ\n\n0\n\n2π\n\n1\ndω μ(ω) = Lk\n2\n\nZ\n\n0\n\n2π\n\nL2\nL2\ncos2 ω)1/2 ∼ 2Lk + ⊥ ln\ndω (sin ω + ⊥\n2\nLk\nLk\n2\n\n\u0012\n\nLk\nL⊥\n\n\u0013\n\n,\n\n(41)\n\nwhere we have used the relation Lk ≫ L⊥ . The asymptotic perimeter divided by the total area, Lk L⊥ , is the\ninterfacial density ρ of the domains, which must be proportional to the energy density E of the system. In the elliptic\napproximation we therefore have\n\u0013\n\u0012\nLk\n2\nL⊥\nE∼ρ∼\n.\n(42)\n+ 2 ln\nL⊥\nLk\nL⊥\nIt will be interesting to compare this simple result with the one obtained from the OJK calculation in the next Section.\nThe vector normal to the interface can be easily found by imposing its orthogonality with the tangent vector\n(∂ω x, ∂ω y). This gives\n−θLk sin ω + L⊥ cos ω\nμ(ω)\nLk sin ω + θL⊥ cos ω\nny (ω) =\n.\nμ(ω)\n\nnx (ω) =\n\n7\n\n(43)\n\n\fWe can now use the relations above to compute the elongation matrix of the ellipse, Dab = hna nb i. By doing this we\nget\n\u0013\n\u0012\nLk\nL2⊥\n2\n→0\nD11 (t) ∼ θ + 2 ln\nLk\nL⊥\nD12 (t) ∼ −θ → 0 .\n\n(44)\n\nNote that a priori we cannot say which one of the two pieces of D11 is going to dominate in the limit t → ∞.\nIn dimension d = 3 it is possible to perform a similar analysis, by introducing a third axis Lz orthogonal to the\n(xy) plane. The result is\nD11 (t) ∼ θ2 +\n\nL2⊥\n→0\nL2k\n\nD12 (t) ∼ −θ → 0 .\n\n(45)\n\nBesides, it is possible to show that if the ratio L⊥ /Lz remains constant for t → ∞, then both D22 and D33 are nonzero\nin this limit, and\nD22 (t) = g2 (L⊥ /Lz )\nD33 (t) = g3 (L⊥ /Lz ) ,\n\n(46)\n\nwhere the two scaling functions must satisfy the relation\ng2 (x) + g3 (x) = 1 .\n\n(47)\n\nThe results of this Section confirm our expectation on the behavior of the elongation matrix and also give us some\nhint on the relation between the elongation matrix and the domain sizes, whose determination is, of course, our final\ngoal.\nIV. TIME INDEPENDENT SHEAR IN TWO DIMENSIONS\n\nFinding a solution of the set of equations (20), (23) and (32) is, even in two dimensions and with a time-independent\nshear rate, not entirely straightforward. Therefore, we will first try to exploit a naive scaling analysis to find a suitable\nansatz for the elongation matrix, and eventually we will modify our initial guess in such a way to self-consistently\nsatisfy all our equations.\nFirst, note that in two dimensions it is relatively simple to compute the integrals in (32). We obtain\np\n11\n11\nτ (t)M22\n(t) − 2σ(t) − σ(t) [2M22\n(t) − τ (t)]\n22\nD11 (t) =\n(48)\n2\nτ (t) − 4σ(t)\np\nτ (t) − 2 σ(t)\nD12 (t) = −M12 (t)\n,\nτ (t)2 − 4σ(t)\nwhere it is easy to check that sum rule (9) is satisfied. Note that, of course, eqs.(48) are valid also for a time-dependent\nrate γ(t) and we will therefore use them also in the next Section in the case of an oscillatory shear.\nA crucial task is now to understand which terms dominate in the limit t → ∞ in the equations above. A useful\nstarting point is the correlation function in equation (25): if we assume that there are just two length scales, Lx (t)\nand Ly (t), a naive consequence we can draw is the following\nM11 (t) ∼ Lx (t)2\n\nM12 (t) ∼ Lx (t)Ly (t)\nM22 (t) ∼ Ly (t)2 .\n\n(49)\n\nMoreover, the physics of the system suggests that\nLx (t) ≫ Ly (t) .\n8\n\n(50)\n\n\fNote that Lx and Ly do not in general coincide with Lk and L⊥ , as defined in the last Section. Indeed, this is the\nmain difference between the naive approach and the final full solution in two dimensions. Relation (50) implies\nM11 (t) ≫ M12 (t) ≫ M22 (t) ,\n\n(51)\n\nand thus\nτ (t) ∼ M11 (t)\n\n,\n\nσ(t) ≪ M11 (t)2 .\n\n(52)\n\nIn order to find the asymptotic behavior of equations (48) we need an extra relation. From definition (31), it seems\nnatural to assume that σ(t) ∼ M11 (t)M22 (t), and therefore, from (51), that\nσ(t) ≫ M22 (t)2 .\n\n(53)\n\nWhat we are (naively) assuming is that there are no cancellations in σ(t). This assumption will fail in the final\nsolution, but it will only logarithmically fail, such that relation (53) will still be true. By using relations (52) and (53)\nin (48), we finally obtain\np\nσ(t)\n(54)\nD11 (t) =\nM11 (t)\nM12 (t)\n,\n(55)\nD12 (t) = −\nM11 (t)\nat leading order for t → ∞. Substituting relations (49) into (54) and (55), and by using the naive scaling relation\nLx (t) ∼ γtLy (t), obtained in Section II, we get\n1\nLy (t)\n∼\nLx (t)\nγt\n1\nLy (t)\n∼−\n,\nD12 (t) = −\nLx (t)\nγt\n\n(56)\n\nD11 (t) =\n\n(57)\n\nwhere again we have assumed that σ(t) ∼ M11 (t)M22 (t). If we now use this asymptotic form of the elongation matrix\nin relations (20) and (23), we obtain\nM11 (t) = γ 2 t2 R22 (t)\nM12 (t) = γt R22 (t)\n\n(58)\n\nM22 (t) = R22 (t) ,\nand\nσ(t) = R11 (t)R22 (t) ,\n\n(59)\n\nwith\nZ t\nR11 (t) = 4γ 2\ndt′ t′2 D11 (t′ )\n0\nZ t\nR22 (t) = 4\ndt′ D11 (t′ ) ,\n\n(60)\n\n0\n\nalways at leading order. Relations (58) are consistent with equation (51), and by substituting (58) into (55) we find\nself-consistently the asymptotic form D12 (t) ∼ −1/γt. Moreover, by assuming once again that σ(t) ∼ M11 (t)M22 (t)\nand by substituting (58) into (54) we get D11 (t) ∼ 1/γt and all our assumptions seem thus to be self-consistent.\nUnfortunately, this is not the case and it is not hard to understand that something is going wrong. Indeed, if\nwe now plug into equation (54) the form of σ(t) coming from equation (59), rather than the naive assumption\nσ(t) ∼ M11 (t)M22 (t), we get the following self-consistent equation for D11 (t):\np\nR11 (t)R22 (t)\n1\nD11 (t) =\n= 2\nγ 2 t2 R22 (t)\nγt\n9\n\nRt\n0\n\ndt′ t′2 D11 (t′ )\n\nRt\n0\n\ndt′ D11 (t′ )\n\n!1/2\n\n.\n\n(61)\n\n\fIf we insert into the r.h.s. of this equation the asymptotic form of D11 found above, we find an unpleasant surprise,\nthat is\na\n,\n(62)\nD11 (t) = √\nγt ln γt\n√\nwith a = 1/ 2, in contradiction with (56). However, the situation is far from being desperate, because if we try this\nvery form of D11 in equation (61) we fortunately find self-consistency with a = 1/2. Our initial result (56) only failed\nto capture a logarithmic correction and it is possible to check that, with this new form of D11 , we recover all the\nrelevant relations of this Section, namely (60), (59), (58), (55), (54), (53), (52) and (51), but not (56).\nSummarizing, the correct final form of the elongation matrix in the two-dimensional case is therefore (always at\nleading order for t → ∞):\n1\n√\n2γt ln γt\n1\nD12 (t) = −\nγt\nD22 (t) = 1 − D11 (t) ,\nD11 (t) =\n\n(63)\n\nwhile equation (56) is not correct. From (60) we have\nγ t2\nR11 (t) = √\nln γt\n√\n4 ln γt\n,\nR22 (t) =\nγ\n\n(64)\n\nwhereas, from (58), the correlation matrix is\np\nM11 (t) = 4γt2 ln γt\np\nM12 (t) = 4t ln γt\n√\n4 ln γt\nM22 (t) =\nγ\n2\nσ(t) = 4t .\n\n(65)\n\nIt is possible to see now that the critical assumption which went wrong in our initial analysis was σ(t) ∼ M11 (t)M22 (t).\nIndeed, from equations (65) we see that σ(t) is smaller than this, because there are some non-trivial cancellations\nin the determinant of Mab . For this same reason, one should not be misled by the fact that apparently in (65) the\ndeterminant of Mab is null: we did not write the sub-leading contributions to the correlation matrix which make\nσ(t) ∼ t2 ≪ t2 ln t.\nIn order to obtain the domain size along the principal elongation axes, Lk (t) and L⊥ (t), we have to find the\neigenvalues λ1 (t) and λ2 (t) of Mab (t). This is easily done by recalling that the characteristic polynomial is just\nλ2 − τ λ + σ, where τ and σ are the trace and the determinant of Mab (t), respectively (cfr. eq.(31)). The final result\nfor the two-dimensional case is:\np\np\n√\nLk (t) = λ1 (t) = τ (t) = 2 γ t (ln γt)1/4\ns\np\n1\nσ(t)\n=√\nL⊥ (t) = λ2 (t) =\n.\n(66)\nτ (t)\nγ (ln γt)1/4\nNote how striking the effect of the shear is in two dimensions: the size of the domains along the minor axis shrinks\nto zero, even though very slowly, for t → ∞. The asymptotic effect of this unlimited narrowing of the domains for\nvery large times is still unclear to us. However, we do expect our approach to break down when L⊥ (t) becomes of the\nsame order as the interface thickness ξ, when equation (2) ceases to be valid. This happens after a very large time,\nof the order exp(1/γ 2 ξ 4 ). What we can say is that, if a steady state exists, it can be reached only when the thickness\nof the domains becomes comparable with the interface width.\nAn important feature of the solution we have found is the failure of standard (x, y) scaling. In order to appreciate\nthis fact, we have to remember that, even though Lk and L⊥ are the natural domain sizes along the eigen-axes of the\ncorrelation matrix, other length scales can be defined, as shown in Fig.2:\n10\n\n\fflow direction\n\nLy\n\nLx\n\nHy\n\nHx\nFIG. 2. The length scales Lx , Ly , Hx and Hy .\n\nFirst of all, we have Lx and Ly : from the correlation function (25), it follows that\n\nand from (65) we get\n\n1\nLx (t) = p\n[M −1 ]11\n1\nLy (t) = p\n,\n[M −1 ]22\n√\nγt\n(ln γt)1/4\n1\nLy (t) = √\n.\nγ (ln γt)1/4\n\n(67)\n\nLx (t) =\n\n(68)\n\nSecondly, we can define Hx and Hy , as the maximum extension of the domain in the x and y directions, that is\nHx = Lk cos θ\nHy = Lk sin θ ,\n\n(69)\n\nwhere θ is the usual tilt angle (see Fig.1), which can be easily computed from the eigenvectors of M . These are\n\u0013\n\u0012\n\u0013\n\u0012\n1\n1\n, ~e⊥ = − , 1 ,\n(70)\n~ek = 1,\nγt\nγt\nand therefore\nθ=\n\n1\n.\nγt\n\n(71)\n\nIn this way we have\n√\nHx (t) = 2 γt (ln γt)1/4\nHy (t) =\n\n2(ln γt)1/4\n.\n√\nγ\n\n(72)\n\nIn the absence of shear all these length scales would coincide, that is we would have Lk = Lx = Hx and L⊥ = Ly =\nHy . With the shear this is no longer true, simply because M12 6= 0. Still, we would expect these length scales to differ\nonly by some constant factors, such that they would all be of the same order asymptotically in time. If this situation\nheld, we would have a standard (x, y) scaling, even though with anisotropic domains. However, in two dimensions the\nsituation is very different, because the length scales above differ by logarithmic corrections. More precisely, we have\np\nLk (t) ∼ ln γt Lx (t) ∼ Hx (t)\n1\nHy (t) .\n(73)\nL⊥ (t) ∼ Ly (t) ∼ √\nln γt\nThe fact that Lk 6= Lx , and therefore the emergence of a nonstandard dynamical scaling, is closely related to the\nvanishing of the determinant of M at the leading order, and its consequence is that (x, y) are not the correct scaling\n11\n\n\faxes. We shall see that this fact does not happen in three dimensions. In order to obtain the right scaling, we have to\nrefer to the eigenvectors of the correlation matrix M , from which we can finally write the scaling form of the two-point\ncorrelation function in two dimensions\n\u0013\n\u0012\nu\ns\n,\n(74)\n,\nC(x, y; t) = f\nLk (t) L⊥ (t)\nwith\ns = x + y/γt\nu = y − x/γt .\n\n(75)\n\nIn the expression above, f is a scaling function, while s and u are coordinates along the main scaling axes of the\ndomains. Note that by x and y we actually mean rx and ry .\nFurthermore, note that the elongation matrix can be written as\nD11 (t) =\n\nL⊥\nLk\n\nD12 (t) = −θ ,\n\n(76)\n\nto be compared with the result for Dab obtained with the elliptic approximation (eq.(44)).\nAn interesting quantity which can be easily computed is the interfacial density ρ(t), defined as\nZ\n~\nρ(t) = h δ(m(~x, t)) |∇m(~\nx, t)| i = DP (m, φ) δ(m(~x, t)) |~\nφ(~x, t)| ,\n\n(77)\n\nwhere, as in Section II, we have put φa (~x, t) = ∂a m(~x, t). The calculation is easy to do because the Gaussian fields\nm and φ are uncorrelated. From relations (25) and (28) we have\nZ\n1\nσ(t)1/2\nρ(t) =\nφ(~x, t)| .\n(78)\nDφ e− 2 φa Mab φb |~\n3/2\n(2π)\nBy using the following formula\n|~\nφ| =\n\nR∞\n\n\u0010\n\ndy\n0 y 3/2\nR ∞ dy\n0 y 3/2\n\ne−φ\n\n2\n\ny\n\n−1\n\n(e−y − 1)\n\n\u0011\n\n=\n\n1\nΓ(− 21 )\n\nZ\n\n∞\n0\n\n\u0011\ndy \u0010 −φ2 y\ne\n−\n1\n,\ny 3/2\n\n(79)\n\nwe can perform the Gaussian integral over φ in (78) and, by proceeding as at the end of Section II, we get\n√\nr\n\u0013\n\u0012\n\u0012 2\u0013\n\u0014\n\u0015 r\nZ ∞\nLk\n1\nL⊥\n1 σ\nτ\n1\n2\nτ\ndy\nρ(t) =\n∼\n, (80)\n+\nln\n+\nln\n∼\n−\n1\nσ\nτ τ\nσ\nL⊥\nL2k\nL⊥\nΓ(− 21 )(2π)3/2 0 y 3/2 (1 + yτ /σ + y 2 /σ)1/2\nwhere we have used the asymptotic expressions (65) for τ (t) and σ(t), together with relations (66). Remarkably, this\nformula for the interfacial density has the same asymptotic form as the one we have obtained in the context of the\nelliptic description of domains (see eq.(42)). Besides, we note an important point: ρ(t) is proportional to the energy\ndensity of the system and therefore, given that L⊥ (t) decreases with time (equation (66)), equation (80) means that\nthe energy in the two-dimensional case increases with time\nE(t) ∼\n\n1\n√\n∼ γ (ln γt)1/4 ,\nL⊥ (t)\n\n(81)\n\nwhere we have subtracted the trivial ground-state contribution. This may seem a surprising result, but we have to\nremember that due to the shear the system is not isolated, and therefore the dynamics is not a simple gradient descent\n(in other words, no Lyapunov functional exists). A simple example can make this point clearer. Imagine we prepare\na two-dimensional system between two boundaries in a striped configuration (see Fig.2), with the stripes orthogonal\nto the boundaries (assume fixed boundary conditions according to the stripes). This configuration is stable at T = 0.\nIf we now shear this system, by moving the boundaries in opposite directions, the stripes will be stretched and the\ninterfacial length per unit area will increase (see Fig.3). Thus, in this simple case, the energy of the system increases\nunder the application of a shear. This example shows that there is no general reason why the energy of a sheared\nsystem cannot increase with time. Of course, it would be important to test equation (80), together with all our\npredictions, in a numerical simulation or even better in a real experiment (see Section VIII).\n12\n\n\fFIG. 3. Increasing the energy of a system by shearing it.\n\nThe OJK theory also gives an explicit expression for the scaling form of the correlation function [8], which simply\nfollows from equation (25) and from the scaling relations above\n!#)\n(\n\"\n\u001a\n\u001b\n2\n2\ns\nhm(1)m(2)i\n1\nu\n2\n2\n.\n(82)\n+ 2\n= sin−1 exp −\nCOJK (x, y; t) = sin−1\nπ\nπ\n2 L2k\nL⊥\nhm(1)2 i1/2 hm(2)2 i1/2\nIt has been noted in [15] that in an unsheared, but anisotropic system the OJK form of the correlation function fits\nvery well the numerical data. Note, however, that in the present case, unlike in [15], the scaling laws along the two\nmain directions are radically different due to the shear, and therefore it is not a priori clear to what extent (82) is a\ngood approximation to the scaling function f in (74). On the other hand, we believe that the scaling form we find\nin (74) has a general validity. Finally, let us note the elliptic symmetry of the OJK correlation function, which could\nexplain the partially correct results we obtained by approximating the domains with ellipses. The same will be true\nin three dimensions.\nAn important property of the result we have found is that the scale area of a domain A(t) satisfies the following\nrelation:\nA(t) = Lk L⊥ = 2t ,\n\n(83)\n\nas in the case where no shear is present. As we are going to explain, there are topological reasons why in two\ndimensions relation (83) must be satisfied either with or without shear. Equation (83) is thus a necessary condition\nfulfilled by our result, which, by itself, clearly shows that the transverse growth must be depressed if the longitudinal\none is enhanced.\nLet us consider an isolated domain in two dimensions in the absence of shear. The rate of variation of the area\nenclosed in the loop is\nI\nI\ndA(t)\n~ * ~n ,\n= dl v = − dl ∇\n(84)\ndt\n\n~ * ~n is the local curvature (see eq.(2)). By virtue of the Gauss-Bonnet\nwhere v is the velocity of the interface and ∇\ntheorem, the right-hand side of equation (84) is in two dimensions a topological invariant, and therefore independent\nof the shape of the domain.\nWhen a shear is present, we have to add to the velocity due to the curvature the flow velocity ~u in the direction\northogonal to the interface. The right-hand side of equation (84) is thus corrected by the following term:\nI\nZ\n~ * ~u = 0 ,\ndl ~n * ~u = d2 x ∇\n(85)\n\nthe final equality holding for any divergence-free shear flow. Equation (83), therefore, holds in two dimensions\nirrespective of the presence of the shear. It is interesting that the OJK approximation, in the self-consistent anisotropic\nversion we have presented here, is able to capture this essential topological feature of phase ordering in two dimensions.\nNote also that the constant 2 in relation (83) is exactly the same as one would obtain from the domain size in the\nabsence of shear. We will find the same constant in the case of an oscillatory shear, as a further confirmation of the\nvalidity of our method.\n13\n\n\fV. OSCILLATORY SHEAR IN TWO DIMENSIONS\n\nThe rather surprising results we have obtained in two dimensions could raise the question whether the OJK method,\nin the modified form we are using here, is actually suitable for studying the physics of a sheared system. Indeed,\nthe skeptical reader may very well think that the shrinking of the transverse domains size, with the consequent\nincrease in the total energy of the system, could be an artifact of the technique, rather than a genuine property of\nthe model. On the other hand, as we have seen at the end of the last Section, our two-dimensional result satisfies\nthe highly nontrivial topological relation on the growth of the scale area, eq. (83), supporting the validity of our\nfindings. Therefore, to check how robust our method is, we test its compatibility with the two-dimensional topological\nconstraint in a completely different situation. To this end we study in this Section the effect of an oscillatory shear\non phase ordering in two dimensions.\nIt must be said that the case of oscillatory shear is interesting in itself. Indeed, a realistic experimental situation is\nvery unlikely to involve an indefinite time-independent shear. More reasonably, a shear flow periodically depending on\ntime, typically with some random modulation, is what we expect. Of course, real experiments with time independent\nshear can be performed (and we are proposing one in Section VIII): what we are saying is that a generalization of our\ncalculation to a time-dependent oscillatory shear can shed some light on a more natural experimental setup.\nWe consider a sheared system with a velocity profile given by\n~u = γ y G(t) ~ex ,\n\n(86)\n\nwhere the only assumption we make on the shear function G(t) is that it is a periodic function with fundamental\nfrequency ω and zero time average. One of the interesting aspects of the following calculation is that the results are to\na great extent independent of the explicit form of G(t). The derivation of the OJK equation is completely analogous\nto the one in Section II, and it follows simply from the obvious substitution\nγkx\n\n∂m(~k, t)\n∂ky\n\n→\n\nγG(t)kx\n\n∂m(~k, t)\n.\n∂ky\n\n(87)\n\nIn order to solve the equations we have therefore to perform the change of variables (compare with (16))\nqy = ky +\n\nγ\ng(t)kx ,\nω\n\n(88)\n\nwith\ng(t) ≡ ω\n\nZ\n\nt\n\ndt′ G(t′ ) .\n\n(89)\n\n0\n\nOf course, for G(t) = 1 we reproduce the time-independent shear case. All the equations of Section II can now be\ngeneralized to the oscillatory shear case by means of the following trivial substitution\nγt →\n\nγ\ng(t) .\nω\n\n(90)\n\nA critical issue to understand concerns the regime of the parameters, in particular time, that we have to consider.\nFirst of all, we cannot afford to have too high a frequency, otherwise there would be a delay in the response of the\nsystem to the shear. This means we must take the shearing frequency, ω, much smaller than the shear rate, γ. On\nthe other hand, we need to observe the system on time scales much larger than a period. Therefore, we will consider\nthe following regime\n1\n1\n≪ ≪t,\nγ\nω\n\n(91)\n\nγ\n≫1.\nω\n\n(92)\n\nwhich implies\nα≡\n\nNote that, in this way, we cannot recover from our final results the ω → 0 case, nor can we extrapolate to the ω → ∞\nlimit. On the other hand, the large parameter α will be useful for extracting the leading terms from our results.\n14\n\n\fBefore going further, let us explain our general strategy. Due to the periodic shear, all our quantities will exhibit\noscillations: some of them, like D11 , which is positive definite, will oscillate around a nonzero value, while others, like\nD12 , will oscillate around zero, due to the oscillation in the orientation of the domains. Given that all these quantities\nenter the time integrals in equations (20), a natural approach, for times much longer than the period, is to exploit\ntheir time-average: if B(t) is an oscillatory quantity we write, to leading order for t → ∞,\nZ t\ndt′ B(t′ ) t′n ∼ B̄ tn+1 ,\n(93)\n0\n\nwith\nB̄ =\n\nω\n2π\n\nZ\n\n2π\nω\n\ndt′ B(t′ ) .\n\n(94)\n\n0\n\nIn this way from equations (20) we get\nn\no\nR11 (t) = 4t 1 − D11 + 2α gD12 + α2 g 2 D11\n\b\nR12 (t) = 4t −D12 − α gD11\n\n(95)\n\nR22 (t) = 4t D11 .\n\nNote the striking difference from the time-independent shear case: due to the oscillations the whole matrix Rab is now\nof order t, as it would be in the absence of shear. As mentioned above, we expect D12 to oscillate around zero with\nthe same period as g. Thus, in the equations above we can disregard terms like D12 and gD11 , whose time average is\nzero. As a consequence, we have\nR12 (t) = 0 ,\n\n(96)\n\nthat is, the isotropy is restored at the level of the matrix Rab . On the other hand, we have to keep mixed terms like\ngD12 , because their time average will be nonzero. Using equations (23) we can now write\no\nn\nM11 (t) = 4t 1 − D11 + 2α gD12 + α2 g 2 D11 + α2 g 2 (t) D11\nM12 (t) = 4t α g(t) D11\nM22 (t) = 4t D11 .\n\n(97)\n\nFirst of all note that, apart from the oscillation induced by the explicit presence of g(t), the correlation matrix Mab\nis of order t, strongly suggesting that we will end up with a t1/2 growth. On the other hand, M12 6= 0, meaning that\nthe system is still anisotropic, even though the anisotropy has zero time average.\nFrom relation (92) and from equations (97), we have that M11 ≫ M12 ≫ M22 , and therefore the self-consistent\nequations (48), become\np\nM22 (t) + σ(t)\nD11 (t) =\nM11 (t)\nM12 (t)\nD12 (t) = −\n.\n(98)\nM11 (t)\nAs usual, we need a starting point to break into these equations and some physical considerations may help here.\nFirst, note that naively M12 ∼ Lx Ly ∼ t, from the topological relation (83). The second of equations (97) then\nsuggests that D11 ∼ 1/α. Secondly, from the form of the velocity profile, we have another naive relation, that is\nx ∼ α y g(t). Thus, we expect that −D12 ∼ θ ∼ y/x ∼ 1/α. We therefore make the following ansatz\n1\nf (t)\nα\n1\n−D12 (t) = h(t) ,\nα\nD11 (t) =\n\n(99)\n\nwith f (t) ≥ 0, while we expect h to oscillate around zero. Both f and h must now be determined self-consistently.\nInserting this ansatz into (97) and considering only the leading terms in α, we have\n15\n\n\fM11 (t) = 4t α[u + r g 2 (t)]\nM12 (t) = 4t g(t)r\nr\nM22 (t) = 4t\nα\nσ(t) = 16t2 ru ,\n\n(100)\n(101)\n\nwith the two constants u and r given by\nu ≡ g2f .\n\nr≡f\n\n(102)\n\nBy inserting this form of Mab into equations (98), we find that the powers of α balance and we obtain two equations\nfor the functions f and h\n√\nru\n(103)\nf (t) =\nu + rg 2 (t)\nrg(t)\nh(t) =\n.\nu + rg 2 (t)\nAveraging the first equation, we get\n√\nru = Ω(r/u) ,\n\n(104)\n\nwith\nΩ(x) =\n\n\u001a\n\n1\n1 + xg 2 (t)\n\n\u001b\n\n.\n\nOn the other hand, by multiplying the same equation by g 2 (t) and averaging again, we have\n√\nru = 1 − Ω(r/u) ,\n\n(105)\n\n(106)\n\nand therefore\n√\nru = Ω(r/u) = 1/2 .\n\n(107)\n\nIn order to compute the domain sizes we can use the same formulae as in Section IV, because we still have τ 2 ≃\n2\nM11\n≫ σ. We obtain\nr\n√\nγ p\n1/2\nLk (t) = τ = 2t\nu + rg 2 (t)\n(108)\nω\nr\n√\nr\nσ\nω\nru\np\n,\n(109)\nL⊥ (t) =\n= 2t1/2\nτ\nγ\nu + rg 2 (t)\n\nand, happily, we find for the scale area\n\n√\nA(t) = Lk (t)L⊥ (t) = 4t ru = 2t ,\n\n(110)\n\nindependent of the explicit form of the shear function G(t). Note also that the factor 2 in this formula is exactly the\nsame as in the time-independent shear case and in the unsheared case. This is an important result, supporting the\nvalidity of our method for the study of the effect of shear in this type of system.\nAs expected, apart from the oscillations, the growth follows a t1/2 law. The interesting thing is that both Lk and\nL⊥ oscillate in time, but, as expected, with an opposite phase: when g(t) has its maximum (i.e. at the maximum\nshear displacement), Lk is maximum and of course L⊥ is minimum, because this is the point of maximum elongation\nof the domains. On the other hand, for g(t) = 0 (i.e. zero shear displacement) Lk is minimum and L⊥ maximum,\nbut always with Lk ≫ L⊥ . We want to stress that this oscillatory dynamics is only deceptively simple. To better\nappreciate this fact we have to compute Lx and Ly (see Fig.2 and eq.(67)). These quantities read\n\n16\n\n\fLx (t) = 2t1/2\nLy (t) = 2t1/2\n\nγ √\nu\nω\n√\nr\nω\nru\np\n.\nγ u + rg 2 (t)\nr\n\n(111)\n(112)\n\nFirst of all, note that Lx , unlike Ly , does not oscillate in time, and this had to be expected from its very definition (see\nFig.2). Secondly, note that for g(t) = 0, we have Lx = Lk ≫ Ly = L⊥ : at the points of zero shear displacement the\ndomains are very flat and large. Besides, we can compute the tilt angle θ from the eigenvectors of M , thus obtaining\ntan θ =\n\nrg(t)\nω\n.\nγ u + rg 2 (t)\n\n(113)\n\nWe can see that θ is zero at the zero displacement point (g(t) = 0), and increases with increasing displacement, up\nto a maximum, whose value decreases with increasing shear rate γ. This fact may seem counterintuitive, especially\nbecause in the case of a time-independent shear rate we have seen that the tilt angle was decreasing with time, while\nhere it is increasing. However, there is no contradiction: the key point is that at g(t) = 0 the domains are already very\nelongated, that is Lx ≫ Ly , as an effect of the shear experienced in the former periods. We can better understand\nwhat happens by using the simple case of a linearly sheared ellipse (no growth), with initial axes Lx and Ly , and\nLx ≫ Ly . The ellipse is described by the parametric equation\nx = Lx cos φ + γyt\ny = Ly sin φ ,\n\n(114)\n\nwith φ ∈ [0, 2π]. We can estimate the tilt angle by computing the ratio y/x at the point where the x displacement is\nmaximum. This gives\ntan θ =\n\nγt\n.\nγ 2 t2 + L2x /L2y\n\n(115)\n\n1 Lx\n,\nγ Ly\n\n(116)\n\nThis function has a maximum at\ntmax =\n\nand decreases asymptotically like 1/γt for t → ∞. In the case of time-independent shear rate, the initial condition\nt = 0 has Lx /Ly ∼ 1, and therefore the maximum of θ is quickly reached at tmax ∼ 1/γ, which is much smaller than\nthe times we consider, t ≫ 1/γ. For this reason, in the time region of interest the tilt angle monotonically decreases.\nIn the oscillatory shear case, on the other hand, at the zero displacement point, g = 0, we have Lx /Ly ∼ γ/ω and\nthus tmax ∼ 1/ω: the tilt angle therefore increases during the period of the oscillations, and this explains the apparent\ncontradiction between the two cases.\nFrom the tilt angle (113) we can compute the additional length scales Hx and Hy by using definition (69). We have\nr\nγ p\n1/2\nHx (t) = 2t\nu + rg 2 (t)\n(117)\nω\nr\nrg(t)\nω\np\nHy (t) = 2t1/2\n.\n(118)\nγ u + rg 2 (t)\nNote that Hy (t) is the only length scale to vanish at the zero displacement point. After the discussion above, the\nreason for this should now be clear.\nIn order to compute r and u, we need to know the explicit form of g(t), and therefore of G(t). However, these\nare just numerical constants and the time evolution of the domain sizes is not affected by them. For the particularly\nsimple case where\nG(t) = cos ωt ,\nthe constants are\n\n√\n3\nr=\n2\n\n1\nu= √ .\n2 3\n\n17\n\n(119)\n\n(120)\n\n\fVI. TIME INDEPENDENT SHEAR IN THREE DIMENSIONS\n\nIn dimension larger than two it becomes very difficult to explicitly compute the integrals in equations (32). Notwithstanding this, if we formulate a suitable ansatz for the elongation matrix Dab (t), we can then find Mab (t) from equations\n(20) and (23), and finally obtain a self-consistent relation for Dab (t) by an asymptotic evaluation for large times of\nthe integrals in (32). In the present Section we will carry out this program for a time-independent shear rate.\nFirst of all, we note that many of the terms in equations (20) can be estimated by means of the following reasonable\nansatz:\nD11 (t) → 0\n\n, t→∞\n1\n.\nD12 (t) ∼ −\nγt\n\n(121)\n\nBoth these relations are also obtained in any dimension by the calculation of Section III. By inspection of equations\n(20) it is now clear that the key quantity needed to evaluate Rab (t), and thus Mab (t), is [1 − D22 (t)]. We could be\ntempted to try an ansatz similar to the case d = 2, by taking [1 − D22 (t)] ∼ (ln γt)a1 /ta2 → 0, for t → ∞. However,\na careful analysis of the equations shows that this ansatz is not consistent. Therefore, the most natural thing to do\nis to assume that both D22 (t) and D33 (t) remain nonzero for t → ∞, that is (according to the usual sum rule)\nD22 (t) → 1 − K\n\n(122)\n\nD33 (t) → K ,\n\nand to fix self-consistently the value of the constant K. From equations (20), (23), (31) and (122) we have\n4\nKγ 2 t3\n3\nM12 (t) = 2Kγt2\n\nM11 (t) =\n\nM22 (t) = 4Kt\nM33 (t) = 4(1 − K) t\n4\nσ(t) = K 2 γ 2 t4 ,\n3\n\n(123)\n\nat leading order for t → ∞. Note that the explicit forms of D11 (t) and D12 (t) do not enter in Mab (t). Using relations\n(123) it is now possible to evaluate the asymptotic value of the integrals in equations (32) and get an equation for the\nconstant K. In three dimensions equations (32) read\nZ ∞\n1p\ny 2 + M11 (t) y + M11 (t)M33 (t)\nD22 (t) =\ndy 3\nσ(t)M33 (t)\n2\n2\n{y + M11 (t) y + [M11 (t)M33 (t) + σ(t)] y + σ(t)M33 (t)}3/2\n0\nZ\n∞\n1p\ny 2 + M11 (t) y + σ(t)\nD33 (t) =\n,\nσ(t)M33 (t)\ndy 3\n2\n{y + M11 (t) y 2 + [M11 (t)M33 (t) + σ(t)] y + σ(t)M33 (t)}3/2\n0\n\nwhere we have used the relation M11 (t) ≫ M22 (t) ∼ M33 (t), according to (123). By performing the rescaling y → ty\nand by using relations (123) in the two integrals above, it is possible to see that in the limit t → ∞ we can disregard\nthe terms y 2 at the numerator and y 3 at the denominator. In this way we obtain\n√ Z ∞\nα\ny+1−β\nD22 (t) =\ndy 2\n2 0\n(y + y + α)3/2\n√ Z ∞\nα\ny+β\ndy 2\nD33 (t) =\n,\n(124)\n2 0\n(y + y + α)3/2\nwith\n4K(1 − K)\n(4 − 3K)2\nK\nβ=\n.\n4 − 3K\n\nα=\n\n18\n\n(125)\n\n\fThe fact that there is no time-dependence left in the right-hand sides of equations (124) shows that ansatz (121) and\n(122) give rise to a self-consistent solution for the three-dimensional case. Moreover, it is straightforward to check\nthat sum rule (9) is satisfied. The integrals in (124) can now be easily performed and, by using relations (122), after\nsome algebra we find\nK = 1/5 .\n\n(126)\n\nA similar treatment of the integrals in (32) for D11 (t) and D12 (t) shows that,\nln(γt)\nγ 2 t2\n1\nD12 (t) ∼ −\nγt\n\nD11 (t) ∼\n\nconsistent with ansatz (121). Let us note that relations (121), (122) and (123) are self-consistent in any dimension\nd ≥ 3, as can be easily verified by using these relations in equations (32) and rescaling y → ty in the integrals. Our\nfinal result will therefore be qualitatively the same for any dimension d ≥ 3 (for d > 3 only numerical factors, such as\nthe values of K and the amplitudes in equations (127) below, are changed).\nWe can now compute the eigenvalues of the correlation matrix Mab (t), in order to find the sizes of the domains\nalong the principal elongation axes. From (123) and (126), we have\n2\nγ t3/2\nL|| (t) = √\n15\n1\nL⊥ (t) = √ t1/2\n5\n4\nLz (t) = √ t1/2 ,\n5\nwhose corresponding eigenvectors are\n\u0013\n\u0012\n\u0013\n\u0012\n3\n3\n,0\n, ~e⊥ = −\n, 1, 0\n, ~ez = (0, 0, 1) ,\n~ek = 1,\n2γt\n2γt\n\n(127)\n\n(128)\n\nwhere we recall that L|| and L⊥ are the larger and smaller orthogonal axes of the domain in the (xy) plane, whereas\nLz is the axis of the domain in z direction (or any direction orthogonal to the (xy) plane, if d > 3). The domain\ngrowth in dimension d ≥ 3 is therefore the one we would expect on the basis of the simple scaling arguments given\nin Section II (see equations (15)): the growth exponent along the flow direction is augmented by one, whereas the\nothers are left unchanged. Unlike the two-dimensional case, there are no topological restrictions on the product of\nthe domain sizes, because the integral over the domain surface of the local curvature is not, in d 6= 2, a topological\ninvariant.\nAs already anticipated, for d = 3 standard scaling holds. Indeed, one can immediately check that\nLk (t) ∼ Lx (t) ∼ Hx (t)\nL⊥ (t) ∼ Ly (t) ∼ Hy (t) .\n\n(129)\n\nThere is therefore no real difference between growth along the principal axes of the domains and growth in the (xyz)\ndirections, and the correlation function displays the simple asymptotic scaling form\n\u0013\n\u0012\nx y z\n.\n(130)\n,\n,\nC(x, y, z; t) = f\nLk L⊥ Lz\nAccording to the OJK theory [8], we have, for t → ∞,\n!#)\n(\n\"\n2\n1 (x + 3y/2γt)2 (y − 3x/2γt)2\nz2\n−1\nCOJK (x, y, z; t) = sin\n.\n+\nexp −\n+ 2\nπ\n2\nL2k\nL2⊥\nLz\n\n(131)\n\nIn the scaling limit, where x, y, z, t → ∞ with x/Lk , y/L⊥ and z/Lz fixed, the term 3y/2γt can be dropped, but the\nterm 3x/2γt cannot, and the OJK scaling function has ellipsoidal symmetry as expected.\n19\n\n\fAs in two dimensions, we can compute the interfacial density by applying equation (77). The final result is\nρ(t) ∼\n\nL⊥\n1\n+ 2 ,\nL⊥\nLk\n\n(132)\n\nwhich shows that the energy density in the three dimensional case decreases in the standard way,\nE(t) ∼ t−1/2 .\n\n(133)\n\nVII. NUMERICAL SIMULATIONS IN TWO DIMENSIONS\n\nIn the present Section we will present some numerical simulations for a two-dimensional system subject to a timeindependent uniform shear. We have considered a system of Ising spins on a lattice, governed by zero-temperature\nMonte Carlo dynamics. As in the rest of this paper, the shear flow is applied in the x direction, according to the\nprofile given by equation (12). From a practical point of view, we have sheared the system by shifting each row of\nspins by an amount proportional to the y coordinate and to the time t̂ (measured in Monte Carlo steps)\n∆x(y, t̂) = y ns (t̂) ,\n\n(134)\n\nwhere ns (t̂) is the number of discrete shear steps up to time t̂. Of course, the discrete nature of the system is reflected\nin the discrete nature of the shearing process. To simulate a shear rate γ (defined by ∆xcontinuous = γy t̂)) we require\nns (t̂) = Int (γ t̂): After each 1/γ Monte-Carlo steps a discrete shear process, where each row moves one lattice spacing\nrelative to the row below it, is applied. In the large-time limit, where t̂ ≫ 1/γ, the system's behavior should not be\nvery different from that of a continuously sheared system.\nWe have to be careful in choosing the boundary conditions for a sheared system, because normal periodic boundary\nconditions would clearly be wrong. The idea is to replicate the original system infinitely many times on the (x, y)\nplane and to shear each sub-system with respect to the others. In other words, if (x, y) are the coordinates on the\ninfinite plane, and (i, j) are the coordinates on our numerical system, we have\ni = ModNx (x + y ns (t̂))\nj = ModNy (y) ,\n\n(135)\n\nwhere Nx and Ny are the sizes of the numerical system in the x and y directions, and the function ModN (z) is just\nthe value of z modulo N . Clearly, for t̂ = 0 equations (135) reduce to standard periodic boundary conditions.\nOne of the main difficulties in simulating a system subject to a shear is that the domains grow very quickly in the\ndirection of the flow, soon reaching a size comparable with the size of the system. On the other hand, as we have\nseen, we expect the growth to be highly depressed in the transverse direction. Thus, the most reasonable thing to do\nis to take Nx ≫ Ny , in order to reduce as much as possible finite size effects. In all our simulation we have taken\nNx = 20000 and Ny = 100. As we shall see, even for our longest times, the domains are much smaller than the size of\nthe system in both directions. A possible proposal in order to reduce the finite size effects due to the shear-induced\nelongation of the domains is to work at very low γ. However, all our results hold in the limit Lx ≫ Ly : if we decrease\nthe shear we will have to wait for a longer time to enter the asymptotic regime of interest, and thus we will still have\nthe problem of long domains compared to the system size. There is, therefore, no easy way out of this situation and\nwe had to tune our parameters to take this problem into consideration. For this reason we run our simulations for\nonly one value of the shear rate, namely γ = 1/4: in order to study the dependence of all the observables on the shear\nrate we would have to consider values of γ far from the suitable numerical domain.\nThe first thing we want to check is the behavior of the length scales Lx (t) and Ly (t). As we have seen, x and y\nare not the correct scaling axes, but we want to test our prediction for Lx and Ly against the naive expectation of\nequation (15). Indeed, it must be remembered that this naive scaling is also the one found in the case of conserved\ndynamics in the limit of infinite dimension of the field [9]. We recall our analytic prediction\n√\nγt\nLx (t) ∼\n(ln γt)1/4\n1\nLy (t) ∼ √\n∼ L⊥ (t) .\n(136)\nγ (ln γt)1/4\n20\n\n\fNote that Ly is, at the leading order, equal to L⊥ , and therefore we can limit ourselves to measure the former. This is\nimportant, because a numerical measure of L⊥ would be very difficult: the domain size in the perpendicular direction\nis very small and for long times this direction passes through very few lattice sites, such that practically there are no\npoints where the correlation function is different from zero. This problem does not exists for the correlation in the\nx, y and parallel direction. In order to extract the the domain scale at a given time we have performed a fit of the\ncorrelation function to the OJK form and have located the point where the fit is equal to 1/e. We have checked that\nthe behavior of the domain size with time is almost entirely insensitive to the particular fit we use. Numerically, we\ndo not expect to be able to detect the logarithmic corrections in (136), so our goal is to check the leading behavior\nLx ∼ t and Ly ∼ O(1). Our results are shown in Fig.4.\n1000\n\nLx\nLy\n\ndomain size\n\n100\n\n10\n\n1\n\n1\n\n10\n\n100\ntime\n\n1000\n\n10000\n\nFIG. 4. The domain sizes in the x and y direction as a function of time. The full line is a power fit giving Lx ∼ t1.02 . The\ndashed line is Lnaive\n∼ t3/2 , and the dotted line is Lnaive\n∼ t1/2 , for a comparison. In both cases, the data are averaged over 5\nx\ny\nsamples.\n\nAs we can see, Lx is definitely not growing like t3/2 . A power fit gives\nLx (t) ∼ t1.02 .\n\n(137)\n\nFurthermore, Ly is, on this scale, compatible with a constant, and is certainly not growing like t1/2 . Both Lx (t) and\nLy (t) have the expected behavior, apart from the logarithmic corrections, and the naive exponents 3/2 and 1/2 are\nclearly not correct.\nThe value of Ly is very small and in order to have a better idea of the fast decay of the correlation in the y direction,\nwe plot in Fig.5 the correlation function and the OJK fit for a given fixed value of the time. Note that actually the\ncorrelation vanishes on average after six lattice spacings.\nThe next important quantity we want to measure is the energy. From relation (81) we can see that E(t) is a direct\nmeasure of L⊥ (t). Note that the relation between E and L⊥ is, at leading order, completely independent on the OJK\napproximation we are using: indeed, the simple assumption Lk ≫ L⊥ is sufficient to conclude that, at leading order,\nE ∼ 1/L⊥ . However, we stress that the condition Lk ≫ L⊥ is only satisfied for large times (see Fig.4). In Fig.6 we\nplot the energy as a function of time, both for the sheared and the unsheared case. We see that, after an initial drop\nin the time regime where we do not expect relation (81) to hold, the energy becomes compatible with a constant on\nthis scale. The difference with the unsheared case is striking. In the inset of this figure we show a magnification of\nthe last part of the curve for the sheared case: it is encouraging to see that, despite the significantly large error bars,\nan increase in the energy for very large times is clearly visible, compatible with our analytic prediction\n√\nE(t) ∼ γ (ln γt)1/4 .\n(138)\nHowever, we stress that longer simulational times and larger system sizes are necessary to test this prediction (in\nparticular, the power of the logarithm) more carefully.\n21\n\n\f1\nNumerical data\nOJK fit\n\ncorrelation function\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0\n\n0\n\n2\n\n4\ny\n\n6\n\n8\n\nFIG. 5. Correlation function in the y direction as a function of y, for t̂ = 144. The symbols are the numerical data for 5\nsamples; the full line is the OJK fit.\n\n10.0\n\n0.36\n0.35\n0.34\n0.33\n0.32\n0.31\n0.30\n\n1.0\nenergy\n\n0.29\n0.28\n\n10\n\n100\n\n1000\n\n10000\n\nγ=1/4\nγ=0\n\n0.1\n\n1\n\n10\n\n100\ntime\n\n1000\n\n10000\n\nFIG. 6. The energy as a function of time in the sheared case (γ = 1/4), averaged over 41 samples, and the unsheared case\n(γ = 0) averaged over 5 samples. The full line is a power fit for the unsheared case, giving Eun ∼ t−0.51 . The horizontal broken\nline is a guide to the eye. Inset: energy in the sheared case as a function of time (magnification).\n\nThe last quantity we measure is Lk (t), whose form (66) differs from that of Lx (t) only by a logarithmic correction.\nIn Fig.7 we plot Lk as a function of the time. Even if slightly faster, the growth of the domains in the parallel direction\nis compatible with t. Indeed, a power fit gives\nLk (t) ∼ t1.14 .\n\n(139)\n\nNot surprisingly, at a simulational level we are unable to detect any significant difference between the growth of Lx\nand Lk .\n22\n\n\fparallel domain size\n\n1000\n\n100\n100\n\n1000\nTime\n\nFIG. 7. Domain size Lk as a function of time, averaged over 10 samples. The full line is a power fit, giving Lk (t) ∼ t1.14 .\n\nSummarizing, we can say that, up to the simulational times we were able to reach, numerical data are largely\ncompatible with our theoretical results. In particular, the nontrivial leading behavior of Lx (t), Ly (t) and Lk (t) are\ncorrectly reproduced, while the naive expectations for the domain growth is sharply ruled out by the simulations.\nNote that, of course, a longer simulational time would be desirable, especially to check whether the curve of the\nenergy develops a well defined minimum and eventually starts increasing as (ln t)1/4 . Unfortunately, as we have seen,\nthe high values of Lx and Lk make this impossible with the system sizes we were able to reach, otherwise finite size\neffects would heavily come into play. Also for this reason, in the next Section we propose a real experimental test of\nour analytical results.\n\nVIII. AN EXPERIMENTAL TEST OF THE TWO-DIMENSIONAL RESULTS\n\nTheoretical and numerical results on nonconserved two-dimensional coarsening dynamics can be experimentally\ntested by means of thin films of uniaxial twisted nematic liquid crystal (TNLC) subjected to rapid thermal quenches.\nSince the classic experiments of Orihara, Ishibashi and Nagaya [10], showing that a dynamical scaling compatible with\nthe law L(t) ∼ t1/2 actually takes place in this system [16], many other workers have successfully tested numerical\nand theoretical results on nonconserved coarsening in TNLC [11]. In particular, let us note that this kind of system\nseems to be particularly suitable for testing our analytic calculation: indeed, it has been shown in [10] that the scaling\nfunction describing the two-dimensional coarsening dynamics in TNLC is very well approximated by the analytic\nexpression given by the OJK theory [8]. Moreover, it has been explicitly checked [10] that the Allen-Cahn equation\n(2), describing the motion of an interface due to its curvature, holds to a very good degree of accuracy for TNLC.\nOur aim is to describe in this Section the basic experimental setup for TNLC and to propose a shear experiment on\nsuch systems, in order to test our nonstandard two-dimensional results in the case of simple, time-independent shear.\nA typical TNLC cell is obtained by confining the sample of nematic liquid crystal between two glass plates, previously\nprepared by rubbing them in two mutually perpendicular directions. In this way the orientations of the crystal\nmolecules belonging to the two layers close to the plates have a relative rotation of π/2. At high temperature, in\nthe isotropic phase, the boundary conditions only affect the system close to the boundaries, but when the crystal is\nquenched below the transition temperature (also called the clearing point), deep into the nematic phase, the alignment\nof the molecules with the boundary conditions on the plates extends into the bulk. In this way two different states\nappear, corresponding to the possibility of the molecules to rotate between the directions imposed by the two boundary\nplates in either a clockwise or an anti-clockwise sense. In other words, after the quench the TNLC cell develops two\nequivalent states, which we may call left-handed and right-handed. Domains of the two states are separated by\ndisclination lines [10], defined as the points where the sense of rotation changes sign. The system is effectively two-\n\n23\n\n\fdimensional and the dynamics of the left and right-handed domains is very well described by nonconserved coarsening\ndynamics.\nIn order to reproduce the situation studied in the present paper, it is necessary to shear the TNLC cell in a such\na way that the shear direction is parallel to the two plates (the flow direction is of course parallel to them). Namely,\nthe mutual orientation of the two plates must not be changed in the experiment, while the orthogonal walls must be\nmoved in order to create the shear. In this way our (xy) plane would be parallel to the rubbed glass plates.\nGiven that a vital condition for testing our asymptotic results, in the case of time-independent shear, is the\npossibility to shear the system for a long time, it seem to us that a linear geometry is probably unsuitable for such an\nexperiment. On the contrary, a circular setup may be more convenient: by taking two circular glass plates, rubbed\ntangentially and radially, it is possible to create a cell whose wall, orthogonal to the plates, can now be rotated\nindefinitely. In order to create the shear it is necessary to place a fixed cylinder at the center of the system. In this\nway the material in contact with this cylinder is stationary, while the layers close to the outer walls move with a given\ntangential velocity u0 , creating a velocity profile given by\n\u0013\n\u0012\nRc2\nu0 R0\n, Rc < r < R0 ,\n(140)\nr\n−\nu(r) = 2\nR0 − Rc2\nr\nwhere R0 and Rc are the radius of the cell and of the internal cylinder, respectively. If Rc − R0 ≪ R0 , it is possible to\nproduce a flow identical to the one studied in the present work and to study the long time dynamics of the domains\nunder shear. Indeed, by setting r = Rc + y, we have\nu(y) =\n\n2u0 R0\ny\nR02 − Rc2\n\n,\n\ny ≪ Rc ,\n\n(141)\n\nto be compared with relation (12).\nFinally, testing our results in the case of oscillatory shear should be easier from the experimental point of view,\nsince the periodicity of the shear function allows for the simpler linear geometry. As we have seen, the main growth\nfollows a t1/2 law, modulated by some oscillations in the longitudinal direction. In particular, it should not be difficult\nto test whether the ratio of perpendicular and parallel domain sizes satisfies the relation\nL⊥\nω\n∼\n,\nLk\nγ\n\n(142)\n\nin the regime where γ ≫ ω.\nIX. CONCLUSIONS\n\nIn this paper we have analytically studied the effect of a shear flow on phase ordering, for a statistical system\nwith nonconserved scalar order parameter. We have developed a self-consistent anisotropic version of the OJK\napproximation, by means of which we have calculated the growth exponents for time-independent shear in two and\nthree dimensions (relations (66) and (127)), and we have found the scaling form of the equal-time two-point correlation\nfunction in both cases (relations (74), (75) and (130)). While for d = 3 our results are consistent with some simple\nscaling arguments and with the results obtained for conserved dynamics in the limit of large dimension N of the order\nparameter, in d = 2 we find that domain growth is so heavily affected by the shear, that the domains experience a\nnarrowing which in principle makes their thickness vanish in the limit t → ∞. However, as we have pointed out,\nour calculation is likely to break down for very long times, when the interface and the domain thickness are of the\nsame order. What happens beyond this stage is still unclear to us: it is possible that a time-dependent steady state\ndevelops, with very narrow domains coalescing and giving rise to new thicker domains, which start narrowing again.\nAnother possible scenario is that when L⊥ ∼ ξ domains start breaking and stretching again, giving rise to a steady\nstate like the one depicted in [5]. Further work is needed to clarify this point and it is to be hoped that experiments on\ntwisted nematic liquid crystals, as described in the last Section, will lead to a deeper understanding of this problem.\nWe have also studied the case of an oscillatory shear in two dimensions, finding a standard t1/2 growth, modulated\nby periodic oscillations which occur in opposition of phase for the parallel and perpendicular direction. Interestingly\nenough, all our results in this case are largely independent on the particular form of the shear rate oscillations.\nIt is important to note that, in two dimensions, our results satisfy the topological constraint on the growth of the\nscale area, both in the time-independent and oscillatory case. This fact, together with the results of our numerical\nsimulations, strongly support the validity of our method in the study of coarsening systems under shear.\n24\n\n\fOf course, it would be very interesting to know whether some of our results (in particular in dimension two) are\npreserved for conserved dynamics, which is the relevant case for describing spinodal decomposition in binary fluids.\nUnfortunately, the OJK approximation cannot be used in this case, since the very starting point, the Allen-Cahn\nequation for the interface motion, does not hold when the order parameter is conserved. It is therefore still unclear\nhow to go beyond the large-N limit in the context of spinodal decomposition under shear.\n\nACKNOWLEDGMENTS\n\nIt is a pleasure to thank F. Colaiori, I. Giardina and F. Thalmann for useful discussions. This work was supported\nby EPSRC under grant GR/L97698 (AC and AB), and by Fundação para a Ciência e a Tecnologia (RT).\n\n[1] See A.J. Bray, Adv. Phys. 43, 357 (1994), and references therein.\n[2] See A. Onuki, J. Phys.: Condens. Matter 9, 6119 (1997), and references therein.\n[3] C. K. Chan, F. Perrot, and D. Beysens, Phys. Rev. A 43, 1826 (1991); A. H. Krall, J. V. Sengers, and K. Hamano, Phys.\nRev. Lett. 69, 1963 (1992); T. Hashimoto, K. Matsuzaka, E. Moses, and A. Onuki, Phys. Rev. Lett. 74, 126 (1995); J.\nLäuger, C. Laubner, and W. Gronski, Phys. Rev. Lett. 75, 3576 (1995).\n[4] D. H. Rothman, Phys. Rev. Lett. 65, 3305 (1990); P. Padilla and S. Toxvaerd, J. Chem. Phys. 106, 2342 (1997); A. J.\nWagner and J. M. Yeomans, Phys. Rev. E 59, 4366 (1999).\n[5] T. Ohta, H. Nozaki, and M. Doi, Phys. Lett. A 145, 304 (1990); J. Chem. Phys. 93, 2664 (1991).\n[6] For a discussion of domain growth saturation and finite size effects, see M. E. Cates, V. M. Kendon, P. Bladon, and J.-C.\nDesplat, Faraday Discuss. 112, 1 (1999).\n[7] P.C. Hohenberg, and B.I. Halperin, Rev. Mod. Phys. 49, 435 (1977).\n[8] T. Ohta, D. Jasnow, and K. Kawasaki, Phys. Rev. Lett. 49, 1223 (1982).\n[9] F. Corberi, G. Gonnella, and A. Lamura, Phys. Rev. Lett. 81, 3852 (1998); N. P. Rapapa and A. J. Bray, Phys. Rev. Lett.\n83, 3856 (1999).\n[10] H. Orihara and Y. Ishibashi, J. Phys. Soc. Jpn. 55, 2151 (1986); T. Nagaya, H. Orihara and Y. Ishibashi, J. Phys. Soc.\nJpn. 56, 3086 (1987).\n[11] I. Chuang, N. Turok, and B. Yurke, Phys. Rev. Lett. 66, 2472 (1991); R. Snyder, A.N. Pargellis, P.A. Graham, and B.\nYurke, Phys. Rev. A 45, R2169 (1992); N.Mason, A.N. Pargellis, and B.Yurke, Phys. Rev. Lett. 70, 190 (1993); B.Yurke,\nA.N. Pargellis, S.N. Majumdar, and C. Sire, Phys. Rev. E 56, R40 (1997).\n[12] A. J. Bray and A. Cavagna, cond-mat/0001299 (2000).\n[13] L.D. Landau and I.M. Khalatnikov, Dokl. Akad. Nauk SSSR 96, 469 (1954).\n[14] S. M. Allen and J. W. Cahn, Acta Metall. 27, 1085 (1979).\n[15] E. N. M. Cirillo, G. Gonnella and S. Stramaglia, Phys. Rev. E 56, 5065 (1997).\n[16] The actual value of the dynamical exponent found by Orihara and Ishibashi was 1/z = 0.44.\n\n25\n\n\f"}