{"id": "http://arxiv.org/abs/cond-mat/0505751v2", "guidislink": true, "updated": "2005-07-23T05:44:43Z", "updated_parsed": [2005, 7, 23, 5, 44, 43, 5, 204, 0], "published": "2005-05-31T10:37:09Z", "published_parsed": [2005, 5, 31, 10, 37, 9, 1, 151, 0], "title": "Flat-Bands on Partial Line Graphs -- Systematic Method for Generating\n  Flat-Band Lattice Structures", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0505333%2Ccond-mat%2F0505083%2Ccond-mat%2F0505519%2Ccond-mat%2F0505226%2Ccond-mat%2F0505687%2Ccond-mat%2F0505685%2Ccond-mat%2F0505504%2Ccond-mat%2F0505705%2Ccond-mat%2F0505567%2Ccond-mat%2F0505282%2Ccond-mat%2F0505057%2Ccond-mat%2F0505280%2Ccond-mat%2F0505354%2Ccond-mat%2F0505244%2Ccond-mat%2F0505309%2Ccond-mat%2F0505250%2Ccond-mat%2F0505760%2Ccond-mat%2F0505471%2Ccond-mat%2F0505758%2Ccond-mat%2F0505360%2Ccond-mat%2F0505079%2Ccond-mat%2F0505285%2Ccond-mat%2F0505613%2Ccond-mat%2F0505542%2Ccond-mat%2F0505411%2Ccond-mat%2F0505209%2Ccond-mat%2F0505346%2Ccond-mat%2F0505694%2Ccond-mat%2F0505525%2Ccond-mat%2F0505495%2Ccond-mat%2F0505273%2Ccond-mat%2F0505458%2Ccond-mat%2F0505475%2Ccond-mat%2F0505039%2Ccond-mat%2F0505319%2Ccond-mat%2F0505408%2Ccond-mat%2F0505128%2Ccond-mat%2F0505278%2Ccond-mat%2F0505043%2Ccond-mat%2F0505353%2Ccond-mat%2F0505289%2Ccond-mat%2F0505643%2Ccond-mat%2F0505505%2Ccond-mat%2F0505558%2Ccond-mat%2F0505692%2Ccond-mat%2F0505126%2Ccond-mat%2F0505157%2Ccond-mat%2F0505351%2Ccond-mat%2F0505169%2Ccond-mat%2F0505093%2Ccond-mat%2F0505587%2Ccond-mat%2F0505679%2Ccond-mat%2F0505251%2Ccond-mat%2F0505752%2Ccond-mat%2F0505172%2Ccond-mat%2F0505485%2Ccond-mat%2F0505008%2Ccond-mat%2F0505158%2Ccond-mat%2F0505085%2Ccond-mat%2F0505575%2Ccond-mat%2F0505339%2Ccond-mat%2F0505395%2Ccond-mat%2F0505217%2Ccond-mat%2F0505442%2Ccond-mat%2F0505032%2Ccond-mat%2F0505684%2Ccond-mat%2F0505751%2Ccond-mat%2F0505648%2Ccond-mat%2F0505268%2Ccond-mat%2F0505584%2Ccond-mat%2F0505255%2Ccond-mat%2F0505001%2Ccond-mat%2F0505332%2Ccond-mat%2F0505539%2Ccond-mat%2F0505328%2Ccond-mat%2F0505772%2Ccond-mat%2F0505190%2Ccond-mat%2F0505375%2Ccond-mat%2F0505449%2Ccond-mat%2F0505027%2Ccond-mat%2F0505283%2Ccond-mat%2F0505633%2Ccond-mat%2F0505635%2Ccond-mat%2F0505524%2Ccond-mat%2F0505340%2Ccond-mat%2F0505237%2Ccond-mat%2F0505523%2Ccond-mat%2F0505509%2Ccond-mat%2F0505082%2Ccond-mat%2F0505160%2Ccond-mat%2F0505538%2Ccond-mat%2F0505508%2Ccond-mat%2F0505484%2Ccond-mat%2F0505265%2Ccond-mat%2F0505394%2Ccond-mat%2F0505686%2Ccond-mat%2F0505713%2Ccond-mat%2F0505728%2Ccond-mat%2F0505734%2Ccond-mat%2F0505715%2Ccond-mat%2F0505476&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Flat-Bands on Partial Line Graphs -- Systematic Method for Generating\n  Flat-Band Lattice Structures"}, "summary": "We introduce a systematic method for constructing a class of lattice\nstructures that we call ``partial line graphs''.In tight-binding models on\npartial line graphs, energy bands with flat energy dispersions emerge.This\nmethod can be applied to two- and three-dimensional systems. We show examples\nof partial line graphs of square and cubic lattices. The method is useful in\nproviding a guideline for synthesizing materials with flat energy bands, since\nthe tight-binding models on the partial line graphs provide us a large room for\nmodification, maintaining the flat energy dispersions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0505333%2Ccond-mat%2F0505083%2Ccond-mat%2F0505519%2Ccond-mat%2F0505226%2Ccond-mat%2F0505687%2Ccond-mat%2F0505685%2Ccond-mat%2F0505504%2Ccond-mat%2F0505705%2Ccond-mat%2F0505567%2Ccond-mat%2F0505282%2Ccond-mat%2F0505057%2Ccond-mat%2F0505280%2Ccond-mat%2F0505354%2Ccond-mat%2F0505244%2Ccond-mat%2F0505309%2Ccond-mat%2F0505250%2Ccond-mat%2F0505760%2Ccond-mat%2F0505471%2Ccond-mat%2F0505758%2Ccond-mat%2F0505360%2Ccond-mat%2F0505079%2Ccond-mat%2F0505285%2Ccond-mat%2F0505613%2Ccond-mat%2F0505542%2Ccond-mat%2F0505411%2Ccond-mat%2F0505209%2Ccond-mat%2F0505346%2Ccond-mat%2F0505694%2Ccond-mat%2F0505525%2Ccond-mat%2F0505495%2Ccond-mat%2F0505273%2Ccond-mat%2F0505458%2Ccond-mat%2F0505475%2Ccond-mat%2F0505039%2Ccond-mat%2F0505319%2Ccond-mat%2F0505408%2Ccond-mat%2F0505128%2Ccond-mat%2F0505278%2Ccond-mat%2F0505043%2Ccond-mat%2F0505353%2Ccond-mat%2F0505289%2Ccond-mat%2F0505643%2Ccond-mat%2F0505505%2Ccond-mat%2F0505558%2Ccond-mat%2F0505692%2Ccond-mat%2F0505126%2Ccond-mat%2F0505157%2Ccond-mat%2F0505351%2Ccond-mat%2F0505169%2Ccond-mat%2F0505093%2Ccond-mat%2F0505587%2Ccond-mat%2F0505679%2Ccond-mat%2F0505251%2Ccond-mat%2F0505752%2Ccond-mat%2F0505172%2Ccond-mat%2F0505485%2Ccond-mat%2F0505008%2Ccond-mat%2F0505158%2Ccond-mat%2F0505085%2Ccond-mat%2F0505575%2Ccond-mat%2F0505339%2Ccond-mat%2F0505395%2Ccond-mat%2F0505217%2Ccond-mat%2F0505442%2Ccond-mat%2F0505032%2Ccond-mat%2F0505684%2Ccond-mat%2F0505751%2Ccond-mat%2F0505648%2Ccond-mat%2F0505268%2Ccond-mat%2F0505584%2Ccond-mat%2F0505255%2Ccond-mat%2F0505001%2Ccond-mat%2F0505332%2Ccond-mat%2F0505539%2Ccond-mat%2F0505328%2Ccond-mat%2F0505772%2Ccond-mat%2F0505190%2Ccond-mat%2F0505375%2Ccond-mat%2F0505449%2Ccond-mat%2F0505027%2Ccond-mat%2F0505283%2Ccond-mat%2F0505633%2Ccond-mat%2F0505635%2Ccond-mat%2F0505524%2Ccond-mat%2F0505340%2Ccond-mat%2F0505237%2Ccond-mat%2F0505523%2Ccond-mat%2F0505509%2Ccond-mat%2F0505082%2Ccond-mat%2F0505160%2Ccond-mat%2F0505538%2Ccond-mat%2F0505508%2Ccond-mat%2F0505484%2Ccond-mat%2F0505265%2Ccond-mat%2F0505394%2Ccond-mat%2F0505686%2Ccond-mat%2F0505713%2Ccond-mat%2F0505728%2Ccond-mat%2F0505734%2Ccond-mat%2F0505715%2Ccond-mat%2F0505476&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce a systematic method for constructing a class of lattice\nstructures that we call ``partial line graphs''.In tight-binding models on\npartial line graphs, energy bands with flat energy dispersions emerge.This\nmethod can be applied to two- and three-dimensional systems. We show examples\nof partial line graphs of square and cubic lattices. The method is useful in\nproviding a guideline for synthesizing materials with flat energy bands, since\nthe tight-binding models on the partial line graphs provide us a large room for\nmodification, maintaining the flat energy dispersions."}, "authors": ["Shin Miyahara", "Kenn Kubo", "Hiroshi Ono", "Yoshihiro Shimomura", "Nobuo Furukawa"], "author_detail": {"name": "Nobuo Furukawa"}, "author": "Nobuo Furukawa", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1143/JPSJ.74.1918", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0505751v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0505751v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0505751v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0505751v2", "journal_reference": "J. Phys. Soc. Japan, Vol. 74, No. 7, July, 2005, pp.1918-1921", "doi": "10.1143/JPSJ.74.1918", "fulltext": "Typeset with jpsj2.cls <ver.1.2>\n\nLetter\n\narXiv:cond-mat/0505751v2 [cond-mat.str-el] 23 Jul 2005\n\nFlat-Bands on Partial Line Graphs\n- Systematic Method for Generating Flat-Band Lattice Structures -\nShin Miyahara ∗ , Kenn Kubo, Hiroshi Ono, Yoshihiro Shimomura and Nobuo Furukawa\nDepartment of Physics and Mathematics, Aoyama Gakuin University, Sagamihara 229-8558, Japan\nWe introduce a systematic method for constructing a class of lattice structures that we\ncall \"partial line graphs\". In tight-binding models on partial line graphs, energy bands with\nflat energy dispersions emerge. This method can be applied to two- and three-dimensional\nsystems. We show examples of partial line graphs of square and cubic lattices. The method\nis useful in providing a guideline for synthesizing materials with flat energy bands, since the\ntight-binding models on the partial line graphs provide us a large room for modification,\nmaintaining the flat energy dispersions.\nKEYWORDS: flat-band, partial line graph, tight-binding model, ferromagnetism\n\nIt has been known that several novel phenomena occur in electronic systems with \"flatbands\", i.e., energy bands with flat dispersions in an entire k-space. Flat-band ferromagnetism\nis the most well-known example, and many research studies have been devoted to this subject.\nMielke first proved the existence of ferromagnetism in a Hubbard model on \"line graphs\".1–3\nLater, Tasaki showed rigorously the existence of ferromagnetic ground states in the so-called\nTasaki model.4 These tight-binding models have a flat-band as the lowest band. Since the\nsingle-electron states in the lowest band are completely degenerate, the ground states of\nnoninteracting models with the half-filled lowest band are highly degenerate due to possible\nspin configurations. The introduction of a Hubbard interaction does not change the energy\nof perfectly ferromagnetic ground states since these states do not encounter on-site repulsive\ninteractions. If the energies of other states are increased by such interactions, the so-called flatband ferromagnetism is realized. Such a flat-band ferromagnetism can be stable against small\nperturbations to hopping terms.5–7 It is known that a flat-band also appears in a tight-binding\nmodel on a bipartite lattice with different numbers of sub-lattice sites. The ground state of\nthe half-filled Hubbard model on this type of lattice was shown to be ferrimagnetic (Lieb\ntheorem).8 Motivated by these studies, several attempts at finding a flat-band ferromagnetism\nin real materials have been carried out. Following the guiding concept of constructing localized\nwave functions, tight-binding models with flat-bands were proposed in several theoretical\nstudies.9–12 For example, in the graphite with zigzag edges, the edge states formed a flat-band\nand the magnetism caused by the edge band was predicted.10\n∗\n\nE-mail address: miyahara@phys.aoyama.ac.jp\n\n1/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\nImada and Kohno argued that a flat dispersion may enhance the pairing instabilities in the\nsystems near a Mott insulator with a singlet ground state. According to them, the enhanced\ndegeneracy and suppression of single-particle processes due to the flat dispersion may enhance\npairing instability in doped systems, which may be the cause of the high-Tc in cuprates.13\nIn this manner, the search for tight-binding models with flat-bands is strongly desired\nfrom both theoretical and experimental points of view. Thus far, several attempts at constructing tight-binding models with a flat-band have been carried out. In most cases, we have\nto determine the parameters in the models as realize a localized wave function by solving the\nSchrödinger equation directly.11, 12 Although a few systematic methods for constructing flatband tight-binding models, e.g., \"line graph\" and \"cell construction\", have been proposed,1, 2, 4\nthe application of these methods can be possible in certain artificial models. Thus, the number\nof constructed models is limited. In this paper, we introduce a new simple systematic method\nfor constructing tight-binding models on a class of lattice structures that we call \"partial line\ngraphs\" in which flat-bands emerge. We can apply this method to any two-dimensional (2D)\nor three-dimensional (3D) lattices. In addition, the generalization of the \"partial line graphs\"\nis also possible, which makes the flat-band stable in a wide parameter range. Such a flexibility is important as a guideline for constructing a material with a flat-band. First, we show\nthe method for constructing a partial line graph. Several tight-binding models produced by\ngeneralizing the partial line graph also realize flat-bands. We describe the rules for the generalization and show examples of generalized partial line graphs of square and cubic lattices.\nFinally, we prove the realization of flat-bands in these systems.\nGiven a 2D or 3D lattice, we can construct its partial line graphs in the following manner.\nWe divide the lattice into N sublattices (N > 1), where each site on a sublattice is equivalent\nand connected only to the sites on different sublattices. Next, we select a site of one (A) of\nthe sublattices, which is connected to z sites on different sublattices, and replace the selected\nsite with z sites (A1 , A2 , * * * , Az ) created on bonds connecting the selected site to other sites.\nWe connect A1 , A2 , * * * and Az to each other through bonds. Repeating the same process\non all the sites on the A sublattice, we construct a partial line graph of the given lattice,\nwhere the A sublattice is replaced by a lattice of clusters composed of z sites. Namely, we\napply the concept of the line graph only to one of the sublattices. The constructed lattice has\nN + z − 1 sites within a unit cell. A tight-binding single-particle model with the same hopping\namplitude t on all bonds realizes flat-bands at the energy −t, as will be shown later.\nAs an example, let us consider a partial line graph of the square lattice. First, we divide\nthe lattice into two sublattices (A and B), as shown in Fig. 1(a). We then create four sites\n(A1 , A2 , A3 and A4 ) on the bonds connected to the sites on the A sublattice (see Fig. 1(b)).\nConnecting the new sites, we obtain a partial line graph shown in Fig. 1(c), which contains five\nunidentical sites in the unit cell. Assuming the hopping amplitude t on all bonds, we calculate\n\n2/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\n4\n3\n\n5\n2\n1\n\n(a)\n\n(b)\n(c)\n\nFig. 1. (a) 2D square lattice (z = 4) with two sublattices, where A and B sublattices are shown by\nblack and white circles, respectively. (b) All sites on the A sublattice are removed, and new sites\non the bonds connected to the removed sites are created. (c) The new sites on the clusters are\nconnected. The partial line graph of the 2D square lattice is obtained. The unit cell is shown by\na dashed line.\n\nthe energy dispersion. The result is shown in Fig. 2(a), where doubly degenerate flat-bands\nexist at E = −t. Furthermore, all the dispersion relations along the highly symmetric lines in\nthe k-space, k = (0, ky ) or (kx , 0), are flat, as shown in Fig. 2(a).\nAs mentioned above, we have assumed that all the hopping amplitudes and the on-site\npotential energies on all sites are the same. However, a flat-band emerges in more generalized\nmodels containing different hopping amplitudes and/or on-site energies, if we choose these\nparameters properly. The generalized partial line graphs are constructed by the following procedures. In the following discussions, we call all the sites other than those on the A sublattice\nsimply as B sites, although they may belong to different sublattices.\n(i) The on-site energies on the B sites do not affect flat-bands at E = −t. For example,\nthe value of the on-site energies of the B sites ǫ on the partial line graph of the square lattice\nmay be arbitrary. We show the energy dispersions for ǫ = 0.5t in Fig. 2(a) together with those\nfor ǫ = 0.\n(ii) We can take arbitrary hopping amplitudes on the bonds that connect the A and B sites\nor two B sites, while fixing the amplitudes within A clusters to be t. Flat-bands at E = −t\nare also realized in this case. One of these models is shown in Fig. 3(a) and an example of its\nband dispersions is shown in Fig. 2(b).\n(iii) The hopping amplitudes within A clusters can also be tuned if z ≥ N + 2. We\nclassify z sites in an A cluster into M subsets (S1 , S2 , * * * , SM ), where M should satisfy\nz − N ≥ M > 1. When the hopping amplitudes between sites in the same subset and between\nthose in the subsets Si and Sj are considered to be t0 and tij , respectively, the model has a\n\n3/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n4\n4\n\n2\nE/t\n\nE/t\n\n2\n\n0\n\n0\n-2\n\u000f=0\n-4 \u000f=0.5\nM\n\nΓ\n(kx,ky)\n\nX\n\n-2\nM\n\nM\n\nΓ\n(kx,ky)\n\n(a)\n\nX\n\nM\n\nX\n\nM\n\n(b)\n\n4\n4\n2\n\nE/t\n\nE/t\n\n2\n0\n\n-2\n\n-4\n\n0\n\n-2\n\nM\n\nΓ\n\n(kx,ky)\n\nX\n\nM\n\n(c)\n\n-4\n\nM\n\nΓ\n\n(kx,ky)\n\n(d)\n\nFig. 2. (a) Dispersion relations for the partial line graph of the square lattice (Fig. 1(c)). The on-site\nenergy ǫ on the B site are considered to be 0 and 0.5t, while the on-site energies within four-site\nclusters are 0. (b) Dispersion relations for the generalized partial line graph shown in Fig. 3(a)\nwith t1 /t = 0.2 and t2 /t = 0.8. (c) Dispersion relations for the generalized partial line graph shown\nin Fig. 3(b). (d) Dispersion relations for the generalized partial line graph shown in Fig. 3(c).\n\nflat-band at E = −t0 . For example, we divide an A cluster of the partial line graph of the\n2D square lattice into two subsets, S1 and S2 , as shown in Fig. 3(b) and assume t0 = 0 and\nt12 = t. The band dispersions of this model with a flat-band at E = 0 are shown in Fig. 2(c).\n(iv) We can even maintain the original sites on the A sublattice, which was removed in\nthe original partial line graphs. This type of lattice contains A clusters composed of z + 1\nsites. An example of this generalization of the 2D square lattice and its band dispersions are\nshown in Figs. 3(c) and 2(d), respectively. Note that applying procedure (iii) for the model\nin Fig. 3(c) reproduces the Lieb model.8\nThus far, we have shown only the examples constructed from the 2D square lattice. However, many types of tight-binding model with flat-bands can be constructed systematically\nby applying the above-mentioned procedures and their combinations to any type of lattice\nstructure. As an example of 3D models, we introduce a generalized partial line graph of a 3D\ncubic lattice (Fig. 4(a)) and show its dispersion relations in Fig. 4(b). In this case, flat-bands\nappear at E = 0 and −2t.\nLet us now prove the existence of flat-bands. We prove first that flat-bands emerge at\nE = −t on an original partial line graph. Electronic states are described using the Bloch wave\nfunction φk with the wave vector k:\nP\nφk = R [b1 k φB 1 (R) + * * * + bN −1 k φB N −1 (R)\n4/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\nt\nt1\nt2\n\nS1\nS2\nt\n\nt\n\n(a)\n(c)\n\n(b)\n\nFig. 3. Generalized partial line graphs of the 2D square lattice. (a) Arbitrary hopping amplitudes\nfrom the B1 original sublattices. (b) Generalization for the hopping amplitude within the A cluster.\n(c) Addition of the original site on the A cluster.\n\n6\n4\n\nE/t\n\n2\n0\n-2\n\nK\n\n(a)\n\nΓ\n\nH\n(kx,ky)\n\nN\n\nP\n\n(b)\n\nFig. 4. (a) Generalized partial line graph of a 3D cubic lattice, where all hopping amplitudes on the\nbonds are assumed to be t. (b) Dispersion relation.\n\n+a1 k φA 1 (R) + * * * + az k φA z (R)] eik*R ,\n\n(1)\n\nwhere the wave functions φA 1 , * * * , φA z represent the atomic states within A clusters, and\nthose on B sites are given by φB 1 , * * * , φB N −1 . The wave function φk for the energy Ek\nsatisfies the eigenvalue equation Hφk = Ek φk . The Hamiltonian H for the wavevector k is\nrepresented by an (N + z − 1) × (N + z − 1) matrix, which can be written as\n!\nB(k) G(k)\nH=\n.\nG † (k)\nT\n\n(2)\n\nHere, B(k) and G(k) are the (N − 1) × (N − 1) and (N − 1) × z block matrices, respectively.\nThe z × z block matrix T is independent of the wave vector k, and all matrix elements, except\n\n5/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\nthe diagonal elements, are t:\n\n\n\n\n\nT =\n\n\n\n0\n\nt\n\n***\n\nt\n\nt\n..\n.\n\n0\n..\n.\n\n***\n..\n.\n\nt\n..\n.\n\nt\n\nt\n\n***\n\n0\n\n\n\n\n\n\n.\n\n\n\n(3)\n\nAssume that the eigenfunction φf k for the eigenvalue −t has no amplitude on B sites, i.e.,\nbi k = 0 for 1 ≤ i ≤ N − 1 in eq.(1). Then, all z equations (T + tI) t (a1 k , a2 k , * * * , az k ) = 0\nare identical, and the eigenvalue equation is reduced to N independent linear equations for\nthe unknown z coefficients a1 k , a2 k , * * * , az k :\nG(k) t (a1 k , a2 k , * * * , az k )\n\n=\n\n0,\n\n(4)\n\na1 k + a2 k + * * * + a z k\n\n=\n\n0.\n\n(5)\n\nHence, we obtain z − N independent solutions for z unknowns if the condition z > N is\nsatisfied. That is, we have z − N -fold degenerate energy bands at Ek = −t, whose dispersions\nare flat in the entire k space. For any wave vectors k, by making nodes on B sites, a wave\nfunction takes the eigenvalue −t.\nIt is obvious that the flat-bands at E = −t do not depend on the on-site energy on the\nB sites and the hopping amplitudes from/to the B sites, since they modify only eq. (4) and\ndo not change the number of independent equations. Thus, once all the on-site energies in\nthe A clusters are identical, we can choose an on-site energy on the B sites and an arbitrary\namplitude from/to the B sites to realize flat-bands, as was already illustrated for the 2D\nsquare lattice in Figs. 2(a) and 2(b).\nIn generalization (iii), we tune the hopping amplitudes within an A cluster by dividing\nthe cluster into M subsets {S1 , S2 , * * * , SM } and taking the hopping amplitudes in the same\nsubsets to be t0 and those between the subset Si and Sj to be tij . We prove that flat-bands\nemerge at E = −t0 . In this case the block matrix T in eq. (2) is written as\n\n\nT0\nT1 2 * * * T1 M\n\n\n T2 1\nT0\n* * * T2 M \n\n\nT = .\n,\n.\n.\n.\n ..\n..\n..\n.. \n\n\nTM 1\n\nTM 2\n\n***\n\n(6)\n\nT0\n\nwhere\n\n\n\n\n\n\nT0 = \n\n\n\n0\n\nt0\n\n***\n\nt0\n\nt0\n..\n.\n\n0\n..\n.\n\n***\n..\n.\n\nt0\n..\n.\n\nt0\n\nt0\n\n***\n\n0\n\n6/9\n\n\n\n\n\n\n,\n\n\n\n(7)\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\nand\n\n\ntij\n .\n.\nTij = \n .\ntij\n\n***\n..\n.\n***\n\n\ntij\n.. \n. \n.\ntij\n\n(8)\n\nIf we assume the eigenfunction φ′f k with no amplitudes on B sites for the eigenvalue −t0 , the\nequation (T + t0 I)(a1 k , a2 k , * * * , az k )t = 0 is transformed to M independent equations:\nt0 A1 + t1 2 A2 + * * * + t1 M AM\n\n=\n\n0\n\n(9)\n\nt2 1 A1 + t0 A2 + * * * + t2 M AM\n..\n.\n\n=\n\n0\n\n(10)\n\ntM 1 A1 + tM 2 A2 + * * * + t0 AM\n\n=\n\n0,\n\n(11)\n\nwhere\nAm =\n\nX\n\nai k .\n\n(12)\n\ni∈Sm\n\nBy adding eq. (4), we obtain N + M − 1 independent equations for z unknowns, which leads\nto z − N − M + 1-fold degenerate flat-bands at E = −t0 . The examples with t0 = 0, which\nresult in flat-bands at E = 0, are shown in Figs. 3(b) and 4 (a). It is interesting to note that\nin the 3D example (Fig. 4(a)), another flat-band appears at E = −2t. This is a unique feature\nof the model where the hopping amplitudes tij between the subsets Si and Sj are independent\nof i and j, and M = 3.\nFinally, let us prove generalization (iv). Here, we maintain the original sites on the A\nsublattice, which has been eliminated on the partial line graphs. Even in this lattice, we may\nassume the wave function φf k , which has no amplitudes on B sites for the eigenvalue −t.\nThen we have N independent equations for z + 1 unknowns, and can determine the z − N + 1\nindependent solutions. Thus, there are flat-bands at E = −t with z − N + 1-fold degeneracy.\nIn this paper, we have introduced a systematic method for constructing tight-binding\nmodels on generalized partial line graphs with flat energy bands. We have shown above only\nexamples for the lattices divided originally into two sublattices. However, we can apply the\nmethod to the lattices with any number of sublattices. One realizes that the combinations\nof the described generalizations are numerous and useful for generating flat-band models.\nSince the flatness of the dispersion may lead to instabilities in the presence of interactions, it\nis important to study the many-body effects of the electrons on the generalized partial line\ngraphs. For example, the ground state with a half-filled flat-band can be a partially polarized\nferromagnetic state. It might be obvious that a ferrimagnetic state is a ground state in some\nof the generalized partial line graphs of Fig. 3(c), since one of them is the Lieb lattice, where\nit is proven rigorously that the ground state is a ferrimagnetic state. On the other hand, it\n\n7/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\nis well known that the fully polarized state on the flat-band |Ψi is the unique ground state,\nwhen the flat-band is the lowest (highest) energy band and the single-particle density matrix\nρxy ∝ hΨ|c†x↑ cy↑ |Ψi is irreducible.3 Although the energy eigenvalue of the flat-band in the\npartial line graphs is not the lowest (highest), such a partially polarized ferromagnetic state\ncan be a ground state when the band gaps on both sides of the flat-band exist for U/t ≪ 1.3 In\nfact, in a chain of square models, where a flat-band can be isolated, a flat-band ferromagnetism\nis realized for small U/t with appropriate parameters.14 Since we can isolate a flat-band by\ntuning the parameters as shown in Fig2. 2(b) and 2(d), a partially polarized ferromagnetic\nstate can be a ground state in certain generalized partial line graphs.\nWe expect that the method is also useful in providing a guideline for synthesizing materials\nwith flat-bands, since there is a large room for modifying the models. We can vary on-site\nenergies, hopping amplitudes, and other parameters, while maintaining the flat-bands. Such\nflexibility is important in the view point of material designing. The fact that the on-site\nenergies on B sites do not affect the flatness of the dispersion is particularly important. This\nfact indicates that the atomic species on B sites can be different from those in A clusters in a\nrealistic system. Thus, we may expect that a generalized partial line graph may be realized in\ncertain compounds. As a candidate, we expect that the quasi-one-dimensional lattice shown\nin Fig. 3(a), the 2D one in Fig. 3(b), and the 3D one in Fig. 4(a) will be realized in real\nmaterials. It is also useful that the position of the flat-band can be tuned by changing the\nhopping amplitudes, which indicates that the position of the flat-band can be moved toward\nthe Fermi level without changing the carrier density by applying (chemical) pressure to the\nmaterial. A clusters can be considered as z-fold degenerate orbitals as treated in refs. 11 and\n12, which is also useful in the view point of material designing.\nThis work is supported by a Grant-in Aid from the Ministry of Education, Culture, Sports,\nScience and Technology of Japan.\n\n8/9\n\n\fJ. Phys. Soc. Jpn.\n\nLetter\n\nReferences\n1) A. Mielke: J. Phys. A 24 (1991) 3311.\n2) A. Mielke: J. Phys. A 25 (1992) 4335.\n3) A. Mielke: Phys. Lett. A 174 (1993) 443.\n4) H. Tasaki: Phys. Rev. Lett. 69 (1992) 1608.\n5) K. Kusakabe and H. Aoki: Phys. Rev. Lett. 72 (1994) 144.\n6) H. Tasaki: Phys. Rev. Lett. 73 (1994) 1158.\n7) H. Tasaki: Phys. Rev. Lett. 75 (1995) 4678.\n8) E. H. Lieb: Phys. Rev. Lett. 62 (1989) 893.\n9) N. Shima and H. Aoki: Phys. Rev. Lett. 71 (1993) 4389.\n10) M. Fujita, K. Wakabayashi, K. Nakada and K. Kusakabe: J. Phys. Soc. Jpn. 66 (1996) 1920.\n11) S. Nishino, M. Goda and K. Kusakabe: J. Phys. Soc. Jpn. 72 (2003) 2015.\n12) S. Nishino and M. Goda: J. Phys. Soc. Jpn. 74 (2005) 393.\n13) M. Imada and M. Kohno: Phys. Rev. Lett. 84 (2000) 143.\n14) R. Arita, K. Kuroki, H. Aoki, A. Yajima and M. Tsukada: Phys. Rev. B 57 (1998) 6854.\n\n9/9\n\n\f"}