{"id": "http://arxiv.org/abs/cond-mat/0410185v1", "guidislink": true, "updated": "2004-10-07T16:40:26Z", "updated_parsed": [2004, 10, 7, 16, 40, 26, 3, 281, 0], "published": "2004-10-07T16:40:26Z", "published_parsed": [2004, 10, 7, 16, 40, 26, 3, 281, 0], "title": "Integral equations for simple fluids in a general reference functional\n  approach", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0410468%2Ccond-mat%2F0410351%2Ccond-mat%2F0410710%2Ccond-mat%2F0410153%2Ccond-mat%2F0410451%2Ccond-mat%2F0410338%2Ccond-mat%2F0410631%2Ccond-mat%2F0410255%2Ccond-mat%2F0410742%2Ccond-mat%2F0410281%2Ccond-mat%2F0410426%2Ccond-mat%2F0410273%2Ccond-mat%2F0410538%2Ccond-mat%2F0410017%2Ccond-mat%2F0410768%2Ccond-mat%2F0410131%2Ccond-mat%2F0410759%2Ccond-mat%2F0410182%2Ccond-mat%2F0410741%2Ccond-mat%2F0410045%2Ccond-mat%2F0410263%2Ccond-mat%2F0410260%2Ccond-mat%2F0410371%2Ccond-mat%2F0410095%2Ccond-mat%2F0410628%2Ccond-mat%2F0410138%2Ccond-mat%2F0410400%2Ccond-mat%2F0410259%2Ccond-mat%2F0410394%2Ccond-mat%2F0410757%2Ccond-mat%2F0410210%2Ccond-mat%2F0410455%2Ccond-mat%2F0410165%2Ccond-mat%2F0410743%2Ccond-mat%2F0410300%2Ccond-mat%2F0410537%2Ccond-mat%2F0410749%2Ccond-mat%2F0410674%2Ccond-mat%2F0410066%2Ccond-mat%2F0410262%2Ccond-mat%2F0410690%2Ccond-mat%2F0410419%2Ccond-mat%2F0410331%2Ccond-mat%2F0410367%2Ccond-mat%2F0410599%2Ccond-mat%2F0410037%2Ccond-mat%2F0410434%2Ccond-mat%2F0410359%2Ccond-mat%2F0410180%2Ccond-mat%2F0410756%2Ccond-mat%2F0410444%2Ccond-mat%2F0410392%2Ccond-mat%2F0410101%2Ccond-mat%2F0410774%2Ccond-mat%2F0410314%2Ccond-mat%2F0410650%2Ccond-mat%2F0410568%2Ccond-mat%2F0410061%2Ccond-mat%2F0410432%2Ccond-mat%2F0410596%2Ccond-mat%2F0410541%2Ccond-mat%2F0410574%2Ccond-mat%2F0410376%2Ccond-mat%2F0410616%2Ccond-mat%2F0410269%2Ccond-mat%2F0410318%2Ccond-mat%2F0410196%2Ccond-mat%2F0410494%2Ccond-mat%2F0410602%2Ccond-mat%2F0410334%2Ccond-mat%2F0410025%2Ccond-mat%2F0410661%2Ccond-mat%2F0410672%2Ccond-mat%2F0410727%2Ccond-mat%2F0410511%2Ccond-mat%2F0410453%2Ccond-mat%2F0410777%2Ccond-mat%2F0410232%2Ccond-mat%2F0410539%2Ccond-mat%2F0410519%2Ccond-mat%2F0410467%2Ccond-mat%2F0410586%2Ccond-mat%2F0410393%2Ccond-mat%2F0410078%2Ccond-mat%2F0410507%2Ccond-mat%2F0410311%2Ccond-mat%2F0410623%2Ccond-mat%2F0410014%2Ccond-mat%2F0410139%2Ccond-mat%2F0410765%2Ccond-mat%2F0410183%2Ccond-mat%2F0410046%2Ccond-mat%2F0410126%2Ccond-mat%2F0410333%2Ccond-mat%2F0410558%2Ccond-mat%2F0410555%2Ccond-mat%2F0410135%2Ccond-mat%2F0410423%2Ccond-mat%2F0410185%2Ccond-mat%2F0410227%2Ccond-mat%2F0410663&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integral equations for simple fluids in a general reference functional\n  approach"}, "summary": "The integral equations for the correlation functions of an inhomogeneous\nfluid mixture are derived using a functional Taylor expansion of the free\nenergy around an inhomogeneous equilibrium distribution. The system of\nequations is closed by the introduction of a reference functional for the\ncorrelations beyond second order in the density difference from the equilibrium\ndistribution. Explicit expressions are obtained for energies required to insert\nparticles of the fluid mixture into the inhomogeneous system. The approach is\nillustrated by the determination of the equation of state of a simple,\ntruncated Lennard--Jones fluid and the analysis of the behavior of this fluid\nnear a hard wall. The wall--fluid integral equation exhibits complete drying\nand the corresponding coexisting densities are in good agreement with those\nobtained from the standard (Maxwell) construction applied to the bulk fluid.\nSelf--consistency of the approach is examined by analyzing the\nvirial/compressibility routes to the equation of state and the Gibbs--Duhem\nrelation for the bulk fluid, and the contact density sum rule and the Gibbs\nadsorption equation for the hard wall problem. For the bulk fluid, we find good\nself--consistency for stable states outside the critical region. For the hard\nwall problem, the Gibbs adsorption equation is fulfilled very well near phase\ncoexistence where the adsorption is large.For the contact density sum rule, we\nfind some deviationsnear coexistence due to a slight disagreement between the\ncoexisting density for the gas phase obtained from the Maxwell construction and\nfrom complete drying at the hard wall.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0410468%2Ccond-mat%2F0410351%2Ccond-mat%2F0410710%2Ccond-mat%2F0410153%2Ccond-mat%2F0410451%2Ccond-mat%2F0410338%2Ccond-mat%2F0410631%2Ccond-mat%2F0410255%2Ccond-mat%2F0410742%2Ccond-mat%2F0410281%2Ccond-mat%2F0410426%2Ccond-mat%2F0410273%2Ccond-mat%2F0410538%2Ccond-mat%2F0410017%2Ccond-mat%2F0410768%2Ccond-mat%2F0410131%2Ccond-mat%2F0410759%2Ccond-mat%2F0410182%2Ccond-mat%2F0410741%2Ccond-mat%2F0410045%2Ccond-mat%2F0410263%2Ccond-mat%2F0410260%2Ccond-mat%2F0410371%2Ccond-mat%2F0410095%2Ccond-mat%2F0410628%2Ccond-mat%2F0410138%2Ccond-mat%2F0410400%2Ccond-mat%2F0410259%2Ccond-mat%2F0410394%2Ccond-mat%2F0410757%2Ccond-mat%2F0410210%2Ccond-mat%2F0410455%2Ccond-mat%2F0410165%2Ccond-mat%2F0410743%2Ccond-mat%2F0410300%2Ccond-mat%2F0410537%2Ccond-mat%2F0410749%2Ccond-mat%2F0410674%2Ccond-mat%2F0410066%2Ccond-mat%2F0410262%2Ccond-mat%2F0410690%2Ccond-mat%2F0410419%2Ccond-mat%2F0410331%2Ccond-mat%2F0410367%2Ccond-mat%2F0410599%2Ccond-mat%2F0410037%2Ccond-mat%2F0410434%2Ccond-mat%2F0410359%2Ccond-mat%2F0410180%2Ccond-mat%2F0410756%2Ccond-mat%2F0410444%2Ccond-mat%2F0410392%2Ccond-mat%2F0410101%2Ccond-mat%2F0410774%2Ccond-mat%2F0410314%2Ccond-mat%2F0410650%2Ccond-mat%2F0410568%2Ccond-mat%2F0410061%2Ccond-mat%2F0410432%2Ccond-mat%2F0410596%2Ccond-mat%2F0410541%2Ccond-mat%2F0410574%2Ccond-mat%2F0410376%2Ccond-mat%2F0410616%2Ccond-mat%2F0410269%2Ccond-mat%2F0410318%2Ccond-mat%2F0410196%2Ccond-mat%2F0410494%2Ccond-mat%2F0410602%2Ccond-mat%2F0410334%2Ccond-mat%2F0410025%2Ccond-mat%2F0410661%2Ccond-mat%2F0410672%2Ccond-mat%2F0410727%2Ccond-mat%2F0410511%2Ccond-mat%2F0410453%2Ccond-mat%2F0410777%2Ccond-mat%2F0410232%2Ccond-mat%2F0410539%2Ccond-mat%2F0410519%2Ccond-mat%2F0410467%2Ccond-mat%2F0410586%2Ccond-mat%2F0410393%2Ccond-mat%2F0410078%2Ccond-mat%2F0410507%2Ccond-mat%2F0410311%2Ccond-mat%2F0410623%2Ccond-mat%2F0410014%2Ccond-mat%2F0410139%2Ccond-mat%2F0410765%2Ccond-mat%2F0410183%2Ccond-mat%2F0410046%2Ccond-mat%2F0410126%2Ccond-mat%2F0410333%2Ccond-mat%2F0410558%2Ccond-mat%2F0410555%2Ccond-mat%2F0410135%2Ccond-mat%2F0410423%2Ccond-mat%2F0410185%2Ccond-mat%2F0410227%2Ccond-mat%2F0410663&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The integral equations for the correlation functions of an inhomogeneous\nfluid mixture are derived using a functional Taylor expansion of the free\nenergy around an inhomogeneous equilibrium distribution. The system of\nequations is closed by the introduction of a reference functional for the\ncorrelations beyond second order in the density difference from the equilibrium\ndistribution. Explicit expressions are obtained for energies required to insert\nparticles of the fluid mixture into the inhomogeneous system. The approach is\nillustrated by the determination of the equation of state of a simple,\ntruncated Lennard--Jones fluid and the analysis of the behavior of this fluid\nnear a hard wall. The wall--fluid integral equation exhibits complete drying\nand the corresponding coexisting densities are in good agreement with those\nobtained from the standard (Maxwell) construction applied to the bulk fluid.\nSelf--consistency of the approach is examined by analyzing the\nvirial/compressibility routes to the equation of state and the Gibbs--Duhem\nrelation for the bulk fluid, and the contact density sum rule and the Gibbs\nadsorption equation for the hard wall problem. For the bulk fluid, we find good\nself--consistency for stable states outside the critical region. For the hard\nwall problem, the Gibbs adsorption equation is fulfilled very well near phase\ncoexistence where the adsorption is large.For the contact density sum rule, we\nfind some deviationsnear coexistence due to a slight disagreement between the\ncoexisting density for the gas phase obtained from the Maxwell construction and\nfrom complete drying at the hard wall."}, "authors": ["M. Oettel"], "author_detail": {"name": "M. Oettel"}, "author": "M. Oettel", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-8984/17/3/003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0410185v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0410185v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "29 pages", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0410185v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0410185v1", "journal_reference": "J. Phys.: Condes. Matter 17 (2005) 429", "doi": "10.1088/0953-8984/17/3/003", "fulltext": "arXiv:cond-mat/0410185v1 [cond-mat.soft] 7 Oct 2004\n\nIntegral equations for simple fluids in a general\nreference functional approach\nM. Oettel†§\n† Max–Planck–Institut für Metallforschung, Heisenbergstr. 3, 70569 Stuttgart\nInstitut für Theoretische und Angewandte Physik, Universität Stuttgart,\nPfaffenwaldring 57, 70569 Stuttgart\nAbstract. The integral equations for the correlation functions of an inhomogeneous\nfluid mixture are derived using a functional Taylor expansion of the free energy around\nan inhomogeneous equilibrium distribution. The system of equations is closed by the\nintroduction of a reference functional for the correlations beyond second order in the\ndensity difference from the equilibrium distribution. Explicit expressions are obtained\nfor energies required to insert particles of the fluid mixture into the inhomogeneous\nsystem. The approach is illustrated by the determination of the equation of state of\na simple, truncated Lennard–Jones fluid and the analysis of the behavior of this fluid\nnear a hard wall. The wall–fluid integral equation exhibits complete drying and the\ncorresponding coexisting densities are in good agreement with those obtained from\nthe standard (Maxwell) construction applied to the bulk fluid. Self–consistency of the\napproach is examined by analyzing the virial/compressibility routes to the equation\nof state and the Gibbs–Duhem relation for the bulk fluid, and the contact density\nsum rule and the Gibbs adsorption equation for the hard wall problem. For the\nbulk fluid, we find good self–consistency for stable states outside the critical region.\nFor the hard wall problem, the Gibbs adsorption equation is fulfilled very well near\nphase coexistence where the adsorption is large. For the contact density sum rule,\nwe find deviations of up to 20% in the ratio of the contact densities predicted by the\npresent method and predicted by the sum rule. These deviations are largely due to\na slight disagreement between the coexisting density for the gas phase obtained from\nthe Maxwell construction and from complete drying at the hard wall.\n\nPACS numbers: 05.20Jj, 68.08Bc\n\nSubmitted to:\n\n§ oettel@mf.mpg.de\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n2\n\n1. Introduction\nIntegral equations have become a popular and increasingly accurate tool in describing\nthe thermodynamics and the bulk structure of one–component simple liquids and, to a\nsmaller degree of accuracy, of fluid mixtures. In the early, formal work (see references\n[1, 2, 3] and references therein) the structural ingredients (pair correlation function,\ndirect correlation function and bridge function) have been defined in terms of graphical\nexpansions and two exact equations relating these three functions have been established.\nThe unknown third equation which is necessary for a closed system of equations is\nusually referred to as the closure relation. A number of approximations have been\ndeveloped in the past for the closure relation. Some of the more succesful ones for the\nstructure and thermodynamics of a one–component liquid are the optimized random\nphase approximation (ORPA) [4], the hierarchical reference theory (HRT) [5], the\nself–consistent Ornstein–Zernike approximation (SCOZA) [6], the Martynov–Sarkisov\nclosure [7] and the reference hypernetted chain equations (RHNC) [8]. For a general\nintroduction into the subject treating some of these and other common closures, see\nreference [9]. The extension of integral equation theories to a general inhomogeneous\nsystem defined by an external potential (a wall, say) is possible by incorporating the\nsource of inhomogeneity as a second component in the dilute limit (the wall particle)\nand treating the originally inhomogeneous problem as a bulk (homogeneous) problem\nin the two–component mixture. This generalization fails for all of the above closures\nwhenever the phenomenon of wetting in the presence of the external (wall) potential is\ninvolved.\nOn the one hand this failure is linked to the difficulties of defining the free energy\nand chemical potential accurately and consistently in the two–component (wall–fluid)\nmixture. Or, whenever a free energy approximation underlying a certain closure relation\ncan be formulated, its form does not allow for wetting. For example, it can be proved\nthat in the hard wall case the HNC and RHNC closures miss the phenomenon of complete\ndrying for the above reason (for HNC, the proof is given in reference [10] and it can be\neasily extended to RHNC). This problem was tackled tentatively in references [11, 12] in\nwhat is termed the hydrostatic HNC approach and this will be commented on in section\n3.3.\nOn the other hand, one is inclined to link this failure to the difficulty of\nincorporating the wall as a second component. As the formal framework embodied in the\ngraphical expansions holds equally well for a general inhomogeneous situation, one may\nabandon the mixture idea and study the one–component fluid using the common closure\nrelations but now for the inhomogeneous correlation functions. These are defined in the\npresence of an external potential which necessarily entails a loss of symmetry for the\ncorrelation functions and thus results in a noticeable increase in computational power\nrequired for a numerical solution. Nevertheless, the problem of defining the chemical\npotential in the inhomogeneous situation still persists; for a review of possible solutions\nfor a range of commonly used closures see reference [13]. Away from phase transitions,\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n3\n\ninhomogeneous integral equation closures may give very accurate density profiles; for\nthe example of a fluid confined in a slit see reference [14]. However, systematic studies\nof wetting and drying phenomena within this approach have remained fragmentary, see\nreferences [15, 16, 17, 18]. Very recently and quite distinct from the usual closures, an\nimplementation of HRT for the inhomogeneous problem has been presented in reference\n[19].\nParallel to the development of integral equation approaches, density functional\nmodels have become established as a widespread tool for the investigation of\ninhomogeneous fluids and for the study of wetting phenomena, in particular. The first\nstudy of the latter using a 'modern' density functional theory has been reported in\nreference [20]; for a summary of the initial development of the field see reference [21]. In\ncontrast to integral equations, a very simple mean–field type of functional (with a local\nand therefore actually quite inadequate treatment of the sharply repulsive interatomic\npotentials) predicts rich wetting phenomena at walls, see e.g. references [22, 23]. This\nis related to the underlying bulk equation of state which can be derived from the mean–\nfield functional: it is a reasonable zeroth–order approximation to the true equation of\nstate. The drawback of the simplest models of the type discussed in references [22, 23]\nconsists in their complete failure to describe realistically fluid correlation functions.\nThis is due to the inadequate treatment of the short–range repulsive forces. By now\nthe treatment of short–ranged correlations within hard sphere density functionals has\nreached a very satisfactory level of precision and internal consistency; for landmark\ndevelopments see references [24, 25, 26]. By contrast, the treatment of the attractive\ntails in the interatomic potentials has remained on the mean–field level which leaves the\nequation of state treated in zeroth order approximation.\nIn order to relate density functional results in the presence of a wall, say, to\nquasi–exact results as obtained from simulations, a number of methods have been\nproposed. First, one can observe that away from the critical region, density functional\nresults accurately reproduce simulation results if the mean–field coexistence curve is\nappropriately scaled [27]. Second, close to exact correlation functions obtained from\nintegral equation methods may be used as input in density functionals, see references\n[28, 29, 30]. These amendments generally improve the agreement between density\nprofiles obtained from theory and simulation. However, by introducing these ad–hoc\nmodifications some key properties of the basic functionals (hard sphere functional plus\nmean field treatment of attractions) are destroyed such as e.g. the compliance with the\nresults of exact sum rules. Additionally, if this modified class of density functionals\nis applied to reproduce the bulk fluid correlation functions (this so–called test particle\nlimit is obtained by choosing the fluid interatomic potential as the external potential)\nthere is, in general, no agreement between the integral equation input and the density\nfunctional output.\nThis requirement of test particle consistency was the starting point for the density\nfunctional theory developed in [31] which tries to combine standard density functional\nand integral equation approaches more consistently. By making a Taylor expansion of\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n4\n\nthe free energy functional around bulk densities the standard bulk integral equations\nare derived and the bridge function in the bulk is determined via a density functional\nfor a suitably chosen reference system of hard spheres, thereby providing the necessary\nclosure relation. The latter resembles the RHNC closure. Results for the bulk structure\nof the one–component plasma [32] and for a few state points of the Lennard–Jones fluid\n[33] show a similar level of agreement (if not better) with simulation data as RHNC\nresults.\nIn this paper we will develop this idea, the reference functional approach, in\nmore detail, generalizing the method to an arbitrary inhomogeneous situation and also\nanalyzing bulk fluid and wall–fluid correlations using the mixture description. We will\nsee that by introducing the reference functional insertion free energies (i.e., the chemical\npotential in the bulk) are obtained quite naturally. For the wall–fluid problem treated\nin the bulk mixture approach this implies that the insertion free energy of the wall is\nexplicitly given; using it we can show that in the case of a hard wall complete drying is\npredicted.\nThe paper is structured as follows: In section 2 we consider a fluid mixture in\nan arbitrary inhomogeneous equilibrium state and derive a general closure for the\ncorresponding integral equations using the concept of the reference functional. This\npermits us to derive expressions for the insertion free energies corresponding to the\nchange in grand potential when inserting the mixture particles into the inhomogeneous\nequilibrium state. In section 3 we apply the approach to a mixture of a Lennard–Jones\nfluid and hard particles. In the limit of infinite radius of the hard particles (upon\nwhich the particles become hard walls) and infinitely small hard particle density we\nsolve the equations for the fluid and wall–fluid correlation functions. For the bulk fluid,\nwe find very good agreement with simulation for both the virial and internal energy\nequation of state. The liquid–vapour coexistence curve is obtained by (i) the usual\nMaxwell construction and (ii) the requirement of complete drying at the hard wall.\nWe discuss the form of the wall–fluid bridge function required to account for complete\ndrying. Furthermore, we consider the consistency of our theory by analyzing two sum\nrules appropriate to the density distributions at a hard wall. We discuss the relation of\nthe reference functional method to commonly used density functional mean field models.\nSection 4 contains a summary and perspectives for further research.\n2. Theory\nWe consider a liquid mixture which contains n components. The interaction potential\nbetween atoms of species i and j is given by uij (r) with r = |ri − rj | denoting\nthe distance between the two atoms (i, j = 1 . . . n). The ith element of the vector\nρ(r) = {ρ1 (r), . . . , ρn (r)} describes the density distribution of species i and likewise\nthe ith element of the vector V(r) = {V1 (r), . . . , Vn (r)} denotes the external potential\nacting on an atom of species i. In equilibrium, there exists a unique correspondence\nbetween the external potential V(r) and the density distribution which we denote by ρV\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n5\n\nto highlight this correspondence. As a consequence, there exists a unique free–energy\nfunctional [34]\n= F id [ρ] + F ex [ρ]\nXZ\n\u0001\nid\nβF [ρ] =\ndr ρi (r) log(ρi (r)Λ3i ) − 1\nF [ρ]\n\n(1)\n(2)\n\ni\n\nwhich is usually split into the exactly known ideal part (containing the species–specific\nde–Broglie wavelength Λi ) and the excess contribution. The grand free energy functional\nis defined by\nZ\nΩ[ρ] = F [ρ] − dr (μid (ρi,0 ) + μex (ρi,0 ) − V(r)) * ρ(r)\n(3)\n\nwith μid (ρi,0 ) denoting the chemical potential for an ideal mixture and μex (ρi,0 ) its excess\n(over ideal) for the asymptotic densities ρ0 = {ρ1,0 , . . . , ρn,0 }. The asymptotic densities\ncorrespond to the homogeneous density distribution for V = 0. The components of the\n3\nideal chemical potential are given by βμid\ni = log(ρi,0 Λi ) and β = 1/(kB T ) is the inverse\ntemperature with Boltzmann's constant kB . The equilibrium density distribution follows\nfrom\nδΩ\n=0.\n(4)\nδρ(r) ρ=ρV\nThe free energy functional generates the hierarchy of (inhomogeneous) direct\ncorrelation functions by\nβ\n\nδ n F ex\nδρi1 (r1 ) . . . δρin (rn )\n\n= −c(n),i1 ...in (r1 , . . . , rn ; ρV ) .\n\n(5)\n\nρ=ρV\n\nThe first member of the hierarchy is determined through equation (4):\nc(1),i (r; ρV ) = log\n\nρV,i (r)\n− βμex\ni (ρ0 ) + βVi (r) .\nρ0,i\n\n(6)\n\nWe are now interested in the change of the density distribution ρV generated through\na perturbation corresponding to the external potential V′ = V + ∆V. To this end we\nperform a functional Taylor expansion of the unknown excess free energy in the function\nvariable ∆ρ(r) = ρ(r) − ρV (r) and define:\nF ex = F HNC + F B .\n\n(7)\n\nHere, F HNC (the meaning of the label will become clear shortly) contains terms up to\nsecond order in ∆ρ and all terms beyond second order are subsumed in F B . By virtue\nof definition (5),\nXZ\nHNC\nex\nβF\n= βA (ρV ) −\ndr c(1),i (r; ρV )∆ρi (r) −\ni\n\n1X\n2 ij\n\nZ\n\ndr dr′ c(2),ij (r, r′; ρV )∆ρi (r)∆ρj (r′ ) ,\n\n(8)\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n6\n\nwhere Aex (ρV ) is the excess free energy of the equilibrium state corresponding to the\nexternal potential V. Then the perturbed density distribution ρV′ corresponding to the\nexternal potential V + ∆V is according to equations (4) and (6)\nXZ\nρV′ ,i (r)\n+ β∆Vi =\ndr′ c(2),ik (r, r′; ρV )∆ρk (r′ ) −\nlog\nρV,i (r)\nk\n\nβ\n\nδF B\nδρi (r)\n\n.\n\n(9)\n\nρ=ρV′\n\nIt may appear that we have not gained very much from this formal manipulation:\nthe density profile ρV′ is just expressed through the unknown density profile ρV , the\ncorresponding unknown inhomogeneous direct correlation function c(2),ij (r, r′ ; ρV ) and\nthe unknown functional F B . Therefore we go to the test particle limit, i.e. we define the\nperturbation to V by fixing one atom of species j at position r0 , thus ∆Vi (r) = uij (r−r0 ).\nFor this particular choice of the perturbing potential, the density profiles are connected\nto the inhomogeneous pair correlation functions g ij and hij = g ij − 1 through\n= ρV,i (r) g ij (r, r0 ; ρV ) ,\n\n(10)\n\n∆ρV′ ,i (r)|V ′ (r)=Vi (r)+uij (r−r0 ) = ρV,i (r) hij (r, r0 ; ρV ) .\n\n(11)\n\nρV′ ,i (r)|V ′ (r)=Vi (r)+uij (r−r0 )\ni\n\ni\n\nThe inhomogeneous pair correlation functions are linked to the direct correlation\nfunctions via the inhomogeneous Ornstein–Zernike relation\nXZ\nij\n(2),ij\ndr′ ρV,k (r′ )c(2),ik (r, r′ ; ρV ) *\nh (r, r0 ; ρV ) − c\n(r, r0 ; ρV ) =\nk\n\nhkj (r′ , r0; ρV ) .\n\n(12)\n\nInserting equations (10)–(12) into equation (9) we recover the general closure relation\nfor the inhomogeneous correlation functions\nlog g ij (r, r0; ρV ) + βuij (r − r0 ) = hij (r, r0 ; ρV ) − c(2),ij (r, r0; ρV ) −\nδF B\n,\n(13)\nβ\nδρi (r) ρi =ρV,i gij\nwhich permits us to identify the density derivative of F B with the inhomogeneous bridge\nfunction:\nδF B\n.\n(14)\nbij (r, r0; ρV ) = β\nδρi (r) ρi (r)=ρV,i (r) gij (r,r0 ;ρV )\nSo far all is exact, and at this point we recognize that upon setting F B = 0 we recover\nthe inhomogeneous HNC equations. Thus the HNC equations are generated by the\nsecond–order functional for the excess free energy, F HNC , in the test particle limit. All\nhigher orders in the density expansion of F ex contribute to the bridge function.\nThe unknown density profile ρV (r) is connected to the correlation functions through\nthe exact YBG equations:\nXZ\n∇ log ρV,i (r) = β ∇Vi (r) + β\ndr′ hij (r, r′ ; ρV ) ρV,j (r′ ) ∇Vj (r′ ) .(15)\nj\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n7\n\nUsing the inhomogeneous Ornstein–Zernike relation, equation (12), the last equation\ncan be transformed into one connecting ρV,i and c(2),ij :\nXZ\n∇ log ρV,i (r) = β ∇Vi (r) +\ndr′ c(2),ij (r, r′; ρV )∇ρV,j (r′ ) .\n(16)\nj\n\nAlternatively, this equation follows directly by taking the gradient in equation (6). Thus\nwe see that upon specification of a suitable model for F B , we have a closed system of\nequations for hij , c(2),ij and ρV,i consisting of equations (12), (13), and (15) or equations\n(12), (13), and (16). This set of equations is standard in the theory of classical liquids\nand is usuallly derived using diagrammatic expansions [2] or functional methods [3].\nThe excess free energy pertaining to the external potential V, Aex (ρV ), and the\ncorresponding one–body direct correlation function c(1),i (r; ρV ) do not appear in this\nsystem of equations. The latter can be determined using the Potential Distribution\nTheorem [35] which states that −c(1),i /β is equivalent to the insertion free energy, i.e.\nthe chemical potential, of a particle of species i into the inhomogeneous system defined\nby V. By definition, this insertion free energy is the difference in grand potential with\nthe test particle fixed at r0 , say, and the grand potential without the test particle:\n(1),i\nβμex\n(r0 ; ρV )\ni (r0 ; ρV ) ≡ β Ω[ρ]|ρ=ρV′ − β Ω[ρ]|ρ=ρV = −c\n\n(17)\n\nwhere Vj′ (r) = Vj (r) + uji (r − r0 ). Explicit evaluation yields (using the definition of Ω,\nequation (3), the expressions for the excess free energy, equations (7) and (8), and the\ndefinitions for the inhomogeneous correlation functions in equations (10) and (11))\nXZ\n\u0001\n(1),i\n− c (r0 ) =\ndr ρV,j (r) g ji(r, r0 ) log g ji (r, r0) + βuji (r − r0 ) −\nj\n\n1X\n2 jk\nXZ\n\nZ\n\ndr\n\nZ\n\ndr′ ρV,j (r)ρV,k (r′ ) c(2),jk (r, r′)hji (r, r0)hki (r′ , r0 ) −\n\ndr ρV,j (r) hji (r, r0 ) + β F B [ρ]\n\nρj (r)=ρV,j g ji (r,r0 )\n\n.\n\n(18)\n\nj\n\nFor compactness, we have suppressed the variable \"ρV \" in all correlation functions\nwhich indicates that these pertain to the inhomogeneous density distribution defined by\nV. We note that in deriving the last equation, Aex and c(1),i have dropped out on the\nright hand side. To simplify this expression, we use the general closure relation (13),\nthe inhomogeneous Ornstein–Zernike equation (12) and the definition (14):\nXZ\n(1),i\n(1),i\n− c (r0 ) = − cHNC (r0 ) −\ndr ρV,j (r) g ji (r, r0 ) bji (r, r0 ) +\nj\n\nB\n\nβ F [ρ]\n\nρj (r)=ρV,j g ji (r,r0 )\n\n.\n\n(19)\n\nThis result, which is the main formal result of our paper, constitutes the generalization\nof the well–known HNC result for the chemical potential in inhomogeneous systemsk to\nk See reference [13] for a derivation using the well–known charging method.\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n8\n\n(1),i\n\nclosures with non–vanishing bridge functions. Here, −cHNC (r0 )/β describes the position–\ndependent HNC insertion free energy for F B = 0:\n\u0012\n\u0013\nXZ\n\u0002 ji\n\u0003\n1 ji\n(1),i\n(2),ji\n(2),ji\n− cHNC (r0 ) =\ndr ρV,j (r)\nh (r, r0) h (r, r0 ) − c\n(r, r0) − c\n(r, r0) .\n2\nj\n\n(20)\n\nNote that c(1),i is determined by the density distribution ρV through equation (6) which\nimposes a consistency constraint on all subsequent approximations to F B . Considering\nthe limit |r0 | → ∞, we may assume that the external potential vanishes, V(r0) → 0,\nthus ρV → ρ0 and the inhomogeneous correlation functions become the bulk correlation\nfunctions, g ji (r, r0 ) → g ji (r − r0 ). Then equations (6) and (19) imply an equation for\nthe excess chemical potential of species i in the bulk:\nZ\nX\nex,HNC\nex\nβμi (ρ0 )\n= βμi\nρ0,j dr g ji (r) bji (r) + β F B [ρ] ρj (r)=ρ0,j gji (r) , (21)\n(ρ0 ) −\nj\n\nβμiex,HNC (ρ0 )\n\n=\n\nX\nj\n\nρ0,j\n\nZ\n\ndr\n\n\u0012\n\n\u0003\n1 ji \u0002 ji\nh (r) h (r) − c(2),ji (r) − c(2),ji (r)\n2\n\n\u0013\n\n.\n\n(22)\n\nThe same equation is derived if V = 0 is assumed from the outset, i.e. if the functional\nexpansion of the excess free energy is performed around the bulk state described by ρ0 .\nIn general, the excess free energy functional beyond second order, the bridge\nfunctional F B , is not known. However, we may approximate F B by a density functional\nfor a reference system in the following manner:\nF B [ρ] ≈ F B,ref [ρ] = F ref [ρ] − F HNC,ref [ρ] ,\n\n(23)\n\nwhere the second order HNC contribution is given by equation (8):\nXZ\n(1),i\nHNC,ref\nex,ref\ndr cref (r; ρV )∆ρi (r) −\nβF\n[ρ] = βA\n(ρV ) −\ni\n\n1X\n2 ij\n\nZ\n\n(2),ij\n\ndr dr′ cref (r, r′ ; ρV )∆ρi (r)∆ρj (r′ ) ,\n\n(24)\n\n(1),i\n\n(2),ij\n\n∆A = F ex [ρ] − F ex,ref [ρ] = F HNC [ρ] − F HNC,ref [ρ]\nZ\n1X\n(1),i\ndr (c(1),i − cref )(r; ρV )∆ρi (r) −\n= const. −\nβ i\nZ\n1 X\n(2),ij\ndr dr′ (c(2),ij − cref )(r, r′; ρV )∆ρi (r)∆ρj (r′ ) .\n2β ij\n\n(25)\n\nFor an explicitly given functional F ref , the direct correlation functions cref and cref\nare obtained through equation (5). The reference functional approximation implies that\nall direct correlations beyond second order are well approximated by the corresponding\ndirect correlations of the reference system. Equivalently, it states that the contributions\nto the excess free energy beyond those of the reference system are of second order in the\ndensity difference ∆ρ,\n\n(26)\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n9\n\nThus the reference functional approximation defines a kind of a generalized mean–field\napproximation in treating a general fluid beyond a given reference system where the\n(2),ij\ncoefficient in the quadratic term, c(2),ij − cref , is determined self–consistently.\nIn practice, there are only three reference systems for which we possess reasonably\naccurate density functionals. They are all related to hard–sphere systems where we\ncan use geometric arguments for their construction. These encompass (i) functionals of\nRosenfeld type for hard–sphere mixtures (see e.g. references [25, 26]), (ii) a functional\nfor the Asakura–Oosawa colloid–polymer mixture [36], and (iii) a recently proposed\nfunctional for non–additive hard–sphere mixtures [37]. The functionals of type (i) have\nbeen tested in a variety of inhomogeneous situations and can be regarded as very robust.\nThe functional (ii) has been applied to the structure of free interfaces and near a hard\nwall, predicting a wealth of interesting phenomena [36]. A drawback is that the polymers\nare treated only linearly in their density, consequently correlations from the functional\nare deficient if they are sensitive to higher orders in the polymer density. The functional\n(iii) has not been tested yet for inhomogeneous situations. It contains the functional\nfor the Asakura–Oosawa model as a limiting case, so similar merits and problems may\nbe expected there.\nSummarizing the literature which is concerned with the reference functional idea,\nwe note that the formalism presented above has been formulated previously only for\nfunctionals of type (i) and for functional expansions around bulk densities ρ0 , i.e.\nV = 0. In fact, the reference functional approximation as expressed by equation (23)\nwas introduced in reference [31] and used to describe the one–component plasma with\nhigh accuracy and its similarity to the reference HNC equations was also pointed out.\nLater on, the numerical efficacy of this idea was illustrated for a few state points of the\none–component Lennard–Jones (LJ) fluid [33] and of binary mixtures with their size\nasymmetry being not too large [38]. Comparison with simulation results for both the\ncorrelation functions and thermodynamic properties shows very good agreement.\nAlthough the hard sphere functionals of type (i) are very robust, they are not\nexact. For example, the bulk direct correlation function obtained from the functionals\nby direct functional differentiation, equation (5), represent good approximations for its\nbehaviour inside the hard core but predict it to be zero outside. In order to improve\nupon the accuracy of the correlation functions, the reference functional method may\nbe applied to the hard sphere reference system itself. As a result, for one–component\nhard spheres the bridge function for the bulk integral equations generated by using the\nWhite Bear functional of reference [26] appears to be the most accurate one known\nup to now. Applied to binary hard–sphere mixtures and size asymmetries > 10, the\nbulk integral equation closure shows deficiencies in calculating the distribution function\nbetween the big spheres [39]. This may be related to the inadequacy of the functional\nTaylor expansion around bulk densities for large size asymmetries or to the inadequacy\nof the functionals themselves (as manifest in a low–density analysis of the third–order\ndirect correlation function c(3) [40]).\nThe advantage of the present formalism is that for a general, inhomogeneous density\n\n\f10\n\nIntegral equations for simple fluids in a general reference functional approach\n\ndistribution ρV it is possible to determine directly insertion free energies using equation\n(19). Of much interest is e.g. obtaining the insertion free energy for colloids at fluid\ninterfaces which determines their adsorption behaviour at the interface. However, a\nnumerical solution of equations (12)–(15) requires large numerical efforts. Functional\nminimization in two or three dimensions is complicated by the nature of the three types\nof functionals mentioned above; these contain δ and θ–like distributions.\nIn this paper, we confine ourselves to an illustration of the approach for a simple\none–component fluid and for V = 0. On the one hand, the solution to the homogeneous\nOrnstein–Zernike equation with the integral equation closure defined by equation (13)\ngives the pressure p(ρ) and the chemical potential μ(ρ) for a fixed temperature via the\nvirial equation of state and equation (21), respectively. This permits the determination\nof the liquid–vapour coexistence curve via a standard Maxwell construction as is usually\ndone in integral equation theories. On the other hand, by considering a binary mixture of\nthe fluid with hard spherical cavities in the limit of vanishing cavity density and infinite\ncavity radius we can derive a wall–particle integral equation. The onset of complete\ndrying at the planar hard wall (the cavity with infinite radius) permits an independent\ndetermination of the coexistence curve. We examine the degree of consistency between\nthese two different routes.\n3. Application: Equation of state for a simple fluid and drying at a hard\nwall\nWe consider a binary mixture of cut–off and shifted Lennard–Jones particles (species 1)\nwith hard cavities of radius Rc (species 2). Let\n\u0002\n\u0003\nuLJ (r) = 4ǫ (r/σ)−6 − (r/σ)−12\n(27)\n\nthen the interaction potentials in the mixture are given by\n(\nuLJ (r) − uLJ (rc )\nu11 (r)\n=\n0\n\n(r ≤ rc )\n, (28)\n(r > rc )\n\nexp(−βu12 (r)) = exp(−βu21 (r)) = θ(Rc − r) ,\n\n(29)\n\nexp(−βu22 (r))\n\n(30)\n\n= θ(2Rc − r) .\n\nWe apply the formalism from the last chapter with ρV = {ρ1,0 , ρ2,0 } and for the reference\nsystem we use the original Rosenfeld functional [25] which contains two unknown hard–\nsphere diameters d1 and d2 . In the limit ρ2,0 → 0 (ρ1,0 ≡ ρ0 ) the equations for h11 ≡ h\nand c(2),11 ≡ c(2) (fluid correlations) and h12 (cavity–fluid correlation) decouple. The\nintegral equation system for the LJ fluid (cf. equations (12) and (13)) is given by:\nlog g(r) + βu11 (r) = h(r) − c(2) (r) − β\nh(r) − c(2) (r)\n\nδF B,ref\nδρ(r)\n\n,\n\n(31)\n\nρ(r)=ρ0 g(r)\n\n= ρ0 h ∗ c(2) (r)\n\u0012\n\u0013\nZ\n(2)\n′ (2)\n′\n′\nh ∗ c (r) = dr c (r − r ) h(r ) ,\n\n(32)\n(33)\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n11\n\nwith g(r) ≡ g(r) etc. Following the reference functional assumption, F B has been\nreplaced by the corresponding functional for the reference system, cf. equation (23),\nand the fluid bridge function is given by\nb(r) = β\n\nδF B,ref\nδρ(r)\n\n.\n\n(34)\n\nρ(r)=ρ0 g(r)\n\nUsing the Ornstein–Zernike equation in the limit ρ2,0 → 0 in equation (13) yields a\nsingle equation for the cavity–particle correlation which, however, needs as input the\nsolution for c(2) , the pair direct fluid correlation function:\nlog g 12 (r) + βu12 (r) = ρ0 h12 ∗ c(2) (r) − β\n\nδF B,ref\nδρ(r)\n\n.\n\n(35)\n\nρ(r)=ρ0 g 12 (r)\n\nIn taking the planar hard wall limit Rc → ∞, we shift the origin of the coordinate system\nsuch that limRc →∞ exp(−βu12 (r)) = θ(z). In this limit, the cavity–fluid correlation\nfunctions will be referred to as the wall–fluid correlation functions.\nNote that in the dilute limit ρ2,0 → 0 both the system of equations (31), (32)\nand equation (35) can be derived directly from minimization of the grand potential\nemploying the excess free energy functional of the one–component LJ fluid, F HNC [ρ(r)]+\nF B,ref [ρ(r); d1 ], and using u11 and u12 , respectively, as external potentials. Consequently,\nthe reference functional F B,ref is derived from the one–component Rosenfeld functional\nand contains only one unknown parameter, the hard–sphere diameter d1 .\nBoth equations (31) and (35) are similar to the reference HNC closure [8]. There, the\nbridge function is approximated directly by the bridge function of the reference system\nwhereas here the bridge function is obtained from the reference system free energy\nfunctional. For state points near the triple point, both prescriptions agree with each\nother closely. However, in reference HNC the fluid bridge function remains short–ranged\nnear the bulk critical point as does the wall–fluid bridge function near coexistence on\nthe liquid side. Thus reference HNC omits effects of bulk criticality and of drying at the\nhard wall. In the present scheme, the fluid bridge function becomes long–ranged through\nits functional dependence on the fluid correlation function g (which is long–ranged near\nthe critical point) and so does the wall–fluid bridge function near coexistence through\nits dependence on the wall–particle correlation function g 12 . As will be seen, this does\nnot lead to the correct bulk critical behaviour for the fluid but drying at the hard wall\nis described very well.\nFor the determination of the unknown hard–sphere diameter d1 we propose the\nfollowing criterion,\n\u0001 !\n∂\nF B,ref [ρ0 g(r); d1] − F B,ref [ρ0 g ref (r); d1 ] = 0 ,\n(36)\n∂d1\nwhich corresponds to extremizing the free energy difference between the fluid and the\nreference system with respect to d1 . The correlation function of the reference system\ng ref is taken to be the Percus–Yevick correlation function consistent with the Rosenfeld\nfunctional. This criterion is local in the bulk state space (ρ, T ) and turns out to be\npracticable and reliable, furthermore it is seen in the numerical results that in the\n\n\f12\n\nIntegral equations for simple fluids in a general reference functional approach\n\nmoderate to high density region it is equivalent to the usual reference HNC criterion [8].\nHowever, a deeper understanding of equation (36) with regard to a unique specification\nof the reference system is absent at this point.\nFor the numerical calculations, we use the cut–off rc = 4 σ for which an extensive\nbody of simulation data for the equation of state exists [41].\n3.1. Equation of state\nThe pressure p and the excess (over ideal) internal energy per particle u are determined\nfrom the fluid pair correlation function through the well–known equations:\nZ ∞\n2\nβp\ndu11(r)\n= 1 − π ρ0 β\n,\n(37)\ndr r 3 g(r)\nρ0\n3\ndr\n0\nFigure 1. (colour online) Left panel: Virial equation of state at various temperatures,\np∗ = p∗ (ρ∗0 ). The pressure is calculated according to equation (37). Right panel:\nInternal energy equation of state at various temperatures, βu = βu(ρ∗0 ). The excess\ninternal energy is calculated according to equation (38). The symbols denote simulation\ndata taken from reference [41].\n\n0\n6\n\n5\n\n*\n\nT = 1.4\n1.3\n1.2\n1.1\n1.0\n0.9\n0.8\n\n-1\n-2\n-3\n\nβu\n\np\n\n*\n\n4\n\n3\n\n-4\n\n2\n\n-5\n\n1\n\n-6\n\n*\n\nT = 1.4\n1.3\n1.2\n1.1\n1.0\n0.9\n0.8\n\n-7\n\n0\n0.2\n\n0.4\n\n∗\nρ0\n\n0.6\n\n0.8\n\n-8\n0\n\n0.2\n\n0.4\n\n∗\nρ0\n\n0.6\n\n0.8\n\n\fIntegral equations for simple fluids in a general reference functional approach\nZ ∞\nu = 2π ρ0\ndr r 2 g(r) u11(r) .\n\n13\n(38)\n\n0\n\nThe usual consistency check of integral equation closures proceeds via the compressibility\nrelation\nZ ∞\n∂p\n= 1 − 4π\ndr r 2 c(2) (r) .\n(39)\nβ\n∂ρ0\n0\nIn principle, the excess Helmholtz free energy per particle aex can be determined through\nintegration of equation (38) along isochores,\nZ β\nex\nβa =\nu(β ′) dβ ′,\n(40)\n0\n\nand the excess chemical potential follows by differentiating on an isotherm\n∂aex\nex\nex\n.\n(41)\nμ = a + ρ0\n∂ρ0\nHowever, in the reference functional approach the excess chemical potential is given\ndirectly by (see equation (21))\nZ ∞\nex\nex,HNC\nβμ\n= βμ\n− 4π ρ0\ndr r 2 b(r) g(r) + βF B,ref [ρ0 g(r); d1] , (42)\n\u0013\n\u0012 0\nZ ∞\n\u0002\n\u0003\n1\n(2)\n(2)\nex,HNC\n2\nh(r) h(r) − c (r) − c (r) .\n(43)\nβμ\n= 4π ρ0\ndr r\n2\n0\n\nConsistency with the virial equation (37) may be checked using the isothermal Gibbs–\nDuhem relation\n∂p\n= ρ0 ,\n(μ = μid + μex ) .\n(44)\n∂μ\nFrom the simulations of reference [41] the critical temperature and density of the\ncut–off and shifted LJ fluid can be estimated as Tc∗ ≈ 1.25 and ρ∗c ≈ 0.31¶. In Figure 1,\nwe present our results for p∗ (ρ∗0 ) and βu(ρ∗0 ) for temperatures T ∗ = 0.8 . . . 1.4. We see\nthat for all temperatures and densities (both close to and away from the critical region)\nthe pressure and internal energy calculated from the reference functional match the\nsimulation data very well. This indicates that the pair correlation function g(r) is very\naccurate within the range of u11 (r) (see equations (37) and (38)). In Figure 2, we check\nthe consistency of the virial and the compressibility equation of state (upper panel) and\nthe Gibbs–Duhem relation (lower panel) with the chemical potential calculated via the\ninsertion method, equation (42). Clearly, for the critical region, roughly delineated\nby T ∗ = 1.2 . . . 1.3 and ρ∗0 = 0.15 . . . 0.5, we observe inconsistencies between the\nvirial and compressibility equation of state, and, somewhat weaker, deviations from\n(∂p/∂μ) / ρ0 = 1. However, outside the critical region and for stable bulk densities ρ0 ,\nthe ratio of ∂p/∂ρ0 calculated via equation (39) and via the derivative of equation (37)\nindicates violations of at most 20%, and the Gibbs-Duhem relation is satisfied rather\nwell. This will be important for the subsequent investigation of drying at the hard wall.\n¶ Reduced units, denoted by an asterisk, are defined by setting ǫ = σ = 1.\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n14\n\nFigure 2. (colour online) Testing the consistency of the equation of state at various\ntemperatures. Upper panel: The ratio of the density derivatives of the pressure,\ncalculated (i) using the compressibility equation (39) and (ii) via the derivative of\na polynomial fit to the virial pressure, equation (37). Lower panel: The ratio of the\nchemical potential derivative of the virial pressure and the bulk density. In order\nto perform the derivative, both the virial pressure, equation (37), and the chemical\npotential, equation (42), were fitted to polynomials in the bulk density. In both\npanels, the density coordinate of the filled circles for the three lowest temperatures\nT ∗ indicates the corresponding coexistence density of the liquid phase obtained from\nsimulations [41].\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n15\n\n3.2. Two routes to liquid–vapour coexistence and drying at the hard wall\nIntegral equations usually give results for pair correlation functions in the metastable\nas well as in the stable region, and therefore it is customary to obtain the coexistence\ncurve by requiring μ(ρl ) = μ(ρg ) and p(ρl ) = p(ρg ); this is equivalent to employing a\ncommon tangent or Maxwell construction. The density of the coexisting liquid is given\nby ρl , while ρg denotes the coexisting gas density. The pressure is given by equation\n(37) and the chemical potential may be calculated by either equation (41) or in our case\nequation (42).\nHowever, one may avoid the problem of dealing with correlation functions in the\nmetastable domain altogether if one defines ρl as the bulk density for which complete\ndrying at a hard wall occurs at a given T < Tc . Correspondingly, ρg is then the density\nin the bulk of the infinitely extended drying film.\nIn order to understand the physics of drying [42], let us consider a liquid of density\nρ0 near a hard wall at fixed temperature which is close to coexistence, expressed by\nδμ = μ(ρ0 ) − μ(ρl ) > 0 and δμ small. Since the wall exerts no attractive forces on the\nfluid molecules, we would expect the fluid density near the wall to be gaslike as this\nis energetically more favourable. Corroborating this argument, there exists a sum rule\nrelating the fluid density at the hard wall, ρc , to the bulk pressure of the liquid,\nρc = βp(μ(ρ))\n≈ β(p(μ(ρl )) + ρl δμ) ,\n≈ ρg + β(β1 ρ2g /2 + ρl δμ) ,\n\n(45)\n\n(see also equation (63) below). Since the second virial coefficient of a simple liquid, β1 ,\nis negative, this sum rule tells us that ρc < ρg for δμ → 0. Therefore the density profile\nmust pass from a value smaller than the coexisting gas density at the wall to the liquid\ndensity in the bulk. Since we can safely assume (for T < Tc ) that the transition from\nρg to ρl happens within a few molecular diameters we are led to the hypothesis that\nupon δμ → 0 a gas layer forms between the hard wall and the bulk liquid whose width\nl goes to infinity as δμ → 0 for all T < Tc – complete drying occurs. More formally, the\nemergence of the gas film may be treated using a coarse–grained interface Hamiltonian\nwhich in mean–field approximation predicts a slow divergence of the gas film width\nupon approaching coexistence: l ∝ − ln δμ. For a recent general analysis of liquids with\nshort–ranged attractions near spherical hard walls, see reference [43].\nThe coexisting densities in the hard wall route are obtained by inspecting the grand\npotential\nΩ[ρ] = F id[ρ(r)] + F HNC [ρ(r)] + F B,ref [ρ(r)] −\nZ\ndr(μ(ρl ) − u12 (r))ρ(r) ,\n\n(46)\n\nwith u12 (r) → u12 (z), the planar hard wall potential. The excess free energy functional\nF HNC + F B,ref is given by the Taylor expansion around the liquid bulk density ρ0 = ρl .\nWhen examining the stability conditions of an infinitely extended drying film between\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n16\n\nthe wall and the infinitely extended bulk liquid, we can neglect the hard wall potential\nu12 and the grand potential functional in equation (46) simply becomes the bulk grand\npotential in a Taylor expansion around ρl . As a first condition, the grand potential of\nthe drying film with density ρg must be stationary\nδΩ\n!\n=0.\n(47)\nδρ(r) ρ(r)=ρg\nLet V denote the system volume. We introduce the bulk densities of the grand potential,\nω(ρ) = Ω(ρ)/V and of the free energy, f (ρ) = F (ρ)/V . The second condition is that\nthe drying film can only coexist with the liquid if the grand potential densities for the\ntwo bulk densities ρg and ρl are equal:\n!\n\nω(ρg ) − ω(ρl ) = 0 .\n\n(48)\n\nWe insert the grand potential of equation (46) into the above two conditions, evaluate\nthem at the required coexisting bulk densities and using the abbreviations ∆μ =\nμ(ρg ) − μ(ρl ), ∆ω = ω(ρg ) − ω(ρl ) we obtain:\n!\n\n0 = β∆μ = βμex,ref (ρg ; d1,l ) − βμex,ref (ρl ; d1,l ) +\n\u0002 (2)\n\u0003\nρl\n,\n(49)\nc̃ (0; ρl ) − c̃(2),ref (0; d1,l) (ρg − ρl ) + log\nρg\n1\n!\n0 = ∆ω = f ex,ref (ρl ; d1,l ) − f ex,ref (ρg ; d1,l ) + (ρl − ρg ) −\nβ\n\u0002\n\u0003\nex,ref\nex,ref\nρl μ\n(ρl ; d1,l ) − ρg μ\n(ρg ; d1,l ) +\n\u0003\n1 \u0002 (2)\nc̃ (0; ρl ) − c̃(2),ref (0; d1,l ) (ρ2l − ρ2g )\n(50)\n2β\nHere, d1,l = d1 (ρl ) is the reference hard–sphere diameter which is determined by\ncondition (36) and c̃(2) (k) is the Fourier transform of c(2) (r). The system of equations\n(49) and (50) can be solved for ρl and ρg along with the simultaneous solution to the\nintegral equations (31) and (32) for the liquid (which is needed to obtain c̃(2) (0; ρl )).\nIn Figure 3 we compare the coexistence curve from the standard Maxwell\nconstruction (using equations (37) and (42)) and that from hard–wall drying with a\ncurve fitted to simulation data from reference [41] which was obtained from an equation\nof state. In agreement with our findings concerning the accuracy of the Gibbs–Duhem\nequation (cf. Figure (2)), the Maxwell construction gives an excellent description of\nthe coexistence curve away from the critical region. Closer to the critical point, we\nare not able to find a solution using the Maxwell construction. This can be traced\nback to the violation of the Gibbs–Duhem equation. Hard–wall drying yields coexisting\nliquid densities with similar accuracy but there are clear deviations from simulations\nfor the coexisting gas densities are clearly visible. The reason for this lies in the error\nin extrapolating the bulk grand potential density, equation (50), to low densities, using\nonly bulk properties of the reference system and the pair direct correlation function of\nthe coexisting liquid state point. Nevertheless, the fair agreement between the results\nfrom the Maxwell construction and from hard–wall drying is most encouraging, and, to\nour knowledge, has not been achieved before within integral equation approaches.\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n17\n\nFigure 3. (colour online) Liquid–gas coexistence for the cut–off and shifted LJ\nfluid. The curve is derived from an empirical fit to the free energy of the full LJ\nfluid, using mean–field corrections to account for the cutoff and shift in the potential\n[41]. The squares are the coexistence points derived by the Maxwell construction\nusing equations (37) and (42). The diamonds are the coexistence points obtained by\nconsidering complete drying at the hard wall expressed through equations (49) and\n(50).\n\n1.3\n1.2\n\nT\n\n*\n\n1.1\n1\n0.9\n\nempirical eos\nMaxwell construction\nhard-wall drying\n\n0.8\n0.7\n0\n\n0.2\n\n0.4\n\n∗\nρ0\n\n0.6\n\n0.8\n\nUpon approaching the coexisting liquid density from above on an isotherm, the\nwall–liquid adsorption density Γwl diverges and the wall–liquid surface tension γwl\napproaches the sum of the liquid–gas surface tension γgl∞ and the wall–gas surface tension\nγwg . A mean field analysis of an effective interface Hamiltonian for this situation gives\n[44]:\n\u0014 \u0012\n\u0013\n\u0015\na\n∞\nγwl (μ) = γwg (μ) + γgl + ξ ∆ρ δμ ln\n+1 ,\n(51)\n∆ρ δμ\n\u0012\n\u0013\na\nΓwl (μ) = Γwg (μ) − ξ ∆ρ ln\n.\n(52)\n∆ρ δμ\n\nHere, μ = μ(ρ0 ) is the chemical potential in the bulk, far away from the wall (δμ =\nμ − μ(ρl )), ∆ρ = ρl − ρg is the difference of the coexisting densities and ξ is the decay\nlength of the correlation function in the gas phase. The effective parameter a is of order\nO(kB T /ξ 3). Fluctuations are expected to change the above behaviour only slightly; a\ntreatment within the interface Hamiltonian approach [44] yields a renormalization of\nthe bulk correlation length: ξ → (1 + ω/2) ξ with ω = kB T /(4π γgl∞ ξ 2 ).\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n18\n\nFigure 4. (colour online) Surface tension (top panel) and adsorption density (bottom\npanel) of the cut–off and shifted LJ fluid at a hard wall at temperature T ∗ = 1.0.\nSymbols are integral equation results and curves correspond to a fit near coexistence\nto the functional form given in equations (51) and (52), setting γwg (μ) to a constant\nand neglecting Γwg (μ). From the fit we extract the bulk correlation length ξ ≈ 0.45 σ\nand a ≈ 0.89 kB T /σ 3 . The range of the chemical potential covered by the integral\nequation results corresponds to the bulk densities ρ∗0 = 0.686 . . . 0.9.\n\n1\n0.9\n\nγwl\n\n*\n\n0.8\n0.7\n0.6\n0.5\n0.4\n\n0\n\n1\n\n2\n\n0\n\n1\n\n2\n\nδμ\n\n∗\n\n3\n\n4\n\n3\n\n4\n\n0.5\n0\n\nΓwl\n\n*\n\n-0.5\n-1\n-1.5\n-2\n-2.5\n\nδμ\n\n∗\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n19\n\nWe have analyzed the surface tension and the adsorption density for the isotherm\nT = 1.0. The adsorption density is given by\nZ ∞\nΓwl = ρ0\nh12 (z)dz ,\n(53)\n∗\n\n0\n\nwhile the surface tension γwl can be derived from the general formula (17). Its explicit\nform is given in Appendix A. In Figure 4 we show the surface tension and the adsorption\ndensity obtained from the reference functional theory together with a fit to the mean–\nfield prediction given by equations (51) and (52). We observe that the latter describes\nthe integral equation results not only close to the coexisting density ρ∗l ≈ 0.686 but also\nup to densities ρ∗0 = 0.8 (δμ∗ ≈ 1.5) where we can observe a crossover of the adsorption\ndensity from negative to positive values which is equivalent to a maximum in the surface\ntension. This result is consistent with the idea that the wall–fluid correlations are derived\nfrom a generalized mean field functional; see equation (26) and the discussion thereafter.\nNote that results very similar to those in Figure 4 were obtained in one of the pioneering\nstudies of hard–wall drying [42], in simulations for a square–well fluid.\nNext, we compare the predictions for the wall–fluid bridge function b12 (z) using\nthe reference functional with those of the reference HNC equations. This comparison is\nshown in Figure 5 for a state point very close to coexistence (ρ∗0 = 0.6859) and a state\npoint deep in the stable liquid domain (ρ∗0 = 0.9). In reference HNC, the bridge function\nis derived purely from the reference system (hard spheres with diameter d1 at the hard\nwall) and this bridge function is approximated very well by\nb12\nRHNC (z) = β\n\nδF B,ref\nδρ(r)\n\n.\n\n(54)\n\nρ(r)=ρ0 g 12,ref (z)\n\nHere, g 12,ref is the wall–fluid correlation function for hard spheres at the hard wall\nobtained by minimizing the Rosenfeld hard sphere functional in the presence of the hard\nwall potential. For the higher bulk density (lower panel in Figure 5) b12 and b12\nRHNC show\nvery similar, short–ranged behaviour whereas for the density close to coexistence (upper\npanel in Figure 5) b12 acquires a long–ranged component of approximately the same\nextent as the drying film (compare with the plot of g 12 in Figure 5). Such a long–range\nbehaviour is completely absent in b12\nRHNC which stays short–ranged and consequently the\ndrying film formation is not captured by the reference HNC equations.\n3.3. Comparison with the hydrostatic HNC approach\nAt this point it is worthwhile to compare the present approach with the hydrostatic HNC\n(HHNC) equations of references [11, 12] which is to the author's knowledge the only\nsystematic attempt to account for wetting (drying) phenomena within integral equation\ntheories. Following reference [11], we imagine that an atom of species 2 (originally our\nhard cavities) exerts a very weak and slowly varying potential on an atom of species 1.\nLet the slowly varying correlation functions between species 2 and species 1 be denoted\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n20\n\nFigure 5. (colour online) Wall–liquid bridge functions from the reference functional\nmethod (red lines) and reference HNC (blue lines) at temperature T ∗ = 1.0. Upper\npanel: Bulk density ρ∗0 = 0.6859 ≈ ρl . Lower panel: Bulk density ρ∗0 = 0.9. The\nwall–fluid correlation function g 12 from the reference functional method is given by\nthe dashed line. For the density close to coexistence, g 12 displays a thick drying film\nwhose extent is similar to that of b12 , i.e. about 5 σ. By contrast, b12\nRHNC remains\nshort–ranged.\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n21\n\nby hs and gs = hs + 1. Then the HHNC bridge function is\n∂(βμex )\n(ρ0 ) .\n(55)\n∂ρ\nHere, μex (ρ) is the excess chemical potential of the fluid (species 1) which is supposed\nto be known exactly. This expression for the bridge function is exact for slowly varying\npotentials (hydrodynamic limit). Furthermore we note the thermodynamic identity\nZ ∞\n(β∂μex )\nρ0\n(ρ0 ) = −4π\ndr r 2 c(2) (r) = −c̃(2) (0)\n(56)\n∂ρ\n0\nwhich follows from equations (39) and (44). In order to apply this approximation for\nthe bridge function to potentials which vary sharply over molecular distances (i.e., the\nhard wall potential or the fluid potential u11 ) the authors of references [11, 12] introduce\na normalized weight function w(r) which smoothes the correlation functions:\nex\nex\nb12\nHHNC (r) = βμ (ρ0 gs (r)) − βμ (ρ0 ) − ρ0 hs (r)\n\nhs (r) = w ∗ h12 (r),\n\ngs (r) = w ∗ g 12 (r) .\n\n(57)\n\nAs previously, the asterisk denotes a convolution. Thus the bridge function is\nex\nex\n(2)\n12\nb12\nHHNC (r) = βμ (ρ0 gs (r)) − βμ (ρ0 ) + ρ0 c̃ (0) w ∗ h (r) .\n\n(58)\n\nThe wall–fluid integral equation based on this bridge function,\nlog g 12 + βu12 = ρ0 h12 ∗ c(2) − b12\nHHNC\n\n(59)\n\nsupports a drying solution at the \"true\" coexisting densities. To see this, let ρ0 = ρl ,\nthen within the thick drying film g 12 = ρg /ρl and βμex (ρ0 gs (r)) − βμex (ρ0 ) = log(ρl /ρg ),\nconsistent with equation (59). The drawback of this reasoning is that one needs explicitly\nthe function μex (ρ) (which one would like to actually obtain from the fluid integral\nequation) and the introduction of the weight function is purely phenomenological.\nFurthermore, if one applies this form of the bridge function to the integral equation of\nthe fluid itself, the results are clearly inferior to the present method or to reference HNC.\nThus there appears to be no route in HHNC to obtain the excess chemical potential\nμex (ρ) self–consistently.\nOn the other hand, the formally exact bridge function is given by\nb12 = β\n\nδF B\nδρ(r)\n\nρ(r)=ρ0 g 12 (z)\n\nex\n\n= βμ [ρ0 g 12 (z)] − βμex (ρ0 ) + ρ0 h12 ∗ c(2) (z) ,\n\n(60)\n\nwhich follows from equations (7) and (8). Its approximation in the reference functional\nformalism is given by\nb12 ≈ βμex,ref [ρ0 g 12 (z); d1 ] − βμex,ref (ρ0 ; d1 ) + ρ0 h12 ∗ c(2),ref (z; d1 )\n\n(61)\n\nHere the excess chemical potentials μex [*] and μex,ref [*] are given by\nμex[,ref] [ρ(r)] =\n\nδF ex[,ref]\nδρ(r)\n\n(62)\n\nIn the case of the Rosenfeld functional, μex,ref [*] involves double convolutions with a\ncertain set of geometric weight functions [25]. Comparing equations (58) and (61)\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n22\n\nwe note that instead of employing the exact fluid chemical potential μex and direct\ncorrelation function c(2) , the respective reference system quantities appear and that the\nphenomenological weight function w is replaced by more complicated expressions related\nto the nature of the reference functional. The comparison illustrates that compared to\nHHNC, the bridge function within the reference functional method takes account of the\nshort–range correlation much better because of the use of the very accurate Rosenfeld\nfunctional. On the other hand, through the introduction of the reference system, the\nhydrostatic limit is not fulfilled by the reference functional method; this is reflected by\nthe fact that the coexisting densities derived from hard–wall drying (equations (49) and\n(50)) are nor perfectly consistent with those from the Maxwell construction.\n3.4. Sum rules and the relation to mean–field DFT\nFor the planar hard wall problem, two important sum rules exist:\nβp\n= g 12 (0) ,\nρ0\n∂γwl\n−\n= Γwl (μ) .\n∂μ\n\n(63)\n(64)\n\nThe first is the contact sum rule (see equation (45)) which links the pressure p in the\nbulk to the fluid density at contact with the wall. The second is the Gibbs adsorption\nequation and links the surface tension to the adsorption density. As usual, the derivative\nis performed on an isotherm.\nThe Gibbs adsorption rule remains valid for local density functionals and functionals\nwhich are constructed from weighted densities (WDA). The contact rule remains only\nvalid for free energy functionals of WDA type [27]. This has rendered such functionals\na popular tool for the investigation of inhomogeneous matter. However, one should add\nthe proviso that in equation (63), the pressure p is the one derived from the free energy\nfunctional for bulk densities, i.e. from the compressibility equation of state. Simple\nfluids are almost exclusively treated in density functional theory using a mean–field\napproximation for the attractive tails (see below) for which the consistency between\nthe virial and compressibility equation of state is not very good. Moreover, one might\nobject that agreement with sum rule (64) does not guarantee the accuracy of γwl and\nΓwl themselves, as these quantities depend strongly on the quality of the free energy\nfunctional.\nFor hard spheres, these problems are solved to a high degree of accuracy by presently\navailable functionals [26, 45]. The simplest mean–field treatment of fluids in which the\npair potential u11 (r) has an attractive tail is given by\nZ\n1\nex\nex,ref\ndr ρ(r) watt ∗ ρ(r) ,\n(65)\nF [ρ(r)] = F\n[ρ(r); d1 = const.] +\n2\nwhere we consider a one–component system. Here, the weight function watt is given\nby the attractive tail of the interparticle potential (for which various recipes exist in\nthe literature). If we compare the second term in equation (65) with the excess free\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n23\n\nFigure 6. (colour online) The difference between the direct correlation functions of\nthe fluid and of the reference system for various stable liquid states.\n\n2\n\n∗\n\n)/ β\n(2),ref\n\n1\n\n*\n\n∗\n\n*\n\n∗\n\nT = 1.2, ρ = 0.9\n∗\nρ = 0.8\n∗\nρ = 0.7\n\n0.5\n\n-c\n(2)\n\n∗\n\nT = 1.0, ρ = 0.9\n∗\nρ = 0.8\n∗\nρ = 0.7\n\n1.5\n\n(c\n\n*\n\nT = 0.8, ρ = 0.9\n∗\nρ = 0.8\n\n0\n-0.5\n-1\n0\n\n0.5\n\n1\n\nr/ σ\n\n1.5\n\n2\n\n2.5\n\nenergy beyond the reference system in our approach (see equation (26)), then the\nreference functional approach predicts roughly mean–field behaviour for the density\ndeviations from the bulk. Thus we may conclude, if the prefactor of the quadratic term\nin equation (26), (c(2) − c(2),ref )/β, does not vary appreciably with the bulk density ρ0\nthen a description in terms of the functional given in equation (65) will capture the\nessential physics. Checking the numerical results (see Figure 6), we find that for r > σ\nindeed a single function describes this prefactor for all stable liquid state points except\nfor the ones in the critical region. Inside the harshly repulsive core (r < σ) we notice\nsome variation which is, however, small when compared to the magnitude of the direct\npair correlation function of the reference system. Thus the \"mean–field\" expansion\naround the bulk density as given in equation (26) is expected to entail similar physics\nas that in the mean–field functional (65) but the former has the effect of giving a more\naccurate equation of state and very reliable fluid correlation functions. The mean field\napproach (26) is, in turn, computationally less demanding and has the advantage that\nthe sum rules hold analytically (with respect to the compressibility equation of state).\nIt is important to note that the very concept of expanding around a fixed bulk\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n24\n\nFigure 7. (colour online) Testing the consistency of the contact density sum rule,\nequation (63). We have plotted the ratio p∗ /(ρ∗0 g 12 (0)) for various temperatures\nT ∗ = 0.8 . . . 1.4. The sum rule value of this ratio, T ∗ , is shown by a horizontal straight\nline. For the three lowest temperatures, results are plotted for the stable liquid phase\nonly.\n\n1.2\n\n∗ 12\n\np / [ρ0 g (0)]\n\n1.4\n\n*\n\n1\n\n0.8\n\n0.6\n0\n\n*\n\nT = 1.4\n1.2\n1.0\n0.8\n\n0.2\n\n0.4\n\n∗\nρ0\n\n0.6\n\n0.8\n\ndensity implies that the sum rule proofs which work for weighted density functionals do\nnot hold for the Taylor expanded functional [46]. Therefore we have tested both sum\nrules numerically for various temperatures. In Figure 7 we have plotted the ratio of\nthe virial pressure to the density at contact, p∗ /[ρ0 g 12 (0)] (which should give T ∗ ), for\ntemperatures ranging from T ∗ = 0.8 . . . 1.4. The deviations are up to 20%. However,\ndespite these deviations these results are encouraging since here the virial (= quasi–\nexact) pressure is used. In Figure 8 we compare the adsorption densities calculated by\nequation (53) with the adsorption density obtained from the surface tension via the sum\nrule (64). Again we find very reasonable agreement.\n4. Summary and conclusions\nIn this article, we have analyzed the pair correlation functions of an inhomogeneous\nfluid mixture by means of a functional Taylor expansion of the free energy around an\ninhomogeneous density profile. We have derived a general integral equation closure for\ninhomogeneous systems which is based on the introduction of a reference functional for\nthe excess free energy beyond second order in the Taylor expansion. A benefit of this\n\n\f25\n\nIntegral equations for simple fluids in a general reference functional approach\n\nFigure 8. (colour online) Testing the consistency of the Gibbs adsorption\nR rule,\nequation (64). We show a comparison of the adsorption density Γwl = ρ0 dzh12\n(symbols) with the same quantity obtained from sum rule (64) as a function of the\nbulk density for various temperatures T ∗ = 0.8 . . . 1.4. To perform the μ derivative of\nthe surface tension γwl , both μ and γwl have been fitted to polynomials in ρ0 . The fit\nis of limited accuracy only very close to coexistence. The vertical dashed lines for the\nthree lowest temperatures mark the coexisting liquid densities.\n\n0.5\n*\n\n*\n\n0.2\n\nT = 1.2\n\nT = 1.4\n\n0\n0\n\nΓwl\n\nΓwl\n\n*\n\n*\n\n-0.5\n\n-0.2\n\n-1\n-1.5\n\n-0.4\n\n0\n\n0.2\n\n0.4\n\n∗\nρ0\n\n0.6\n\n-2\n0.5\n\n0.8\n\n0.5\n\n0.6\n\n0.7\n\n∗\n\n0.8\n\n0.9\n\n0.8\n\n0.9\n\nρ0\n\n0.5\n*\n\n*\n\nT = 1.0\n\nT = 0.8\n\n0\n\n*\n\nΓwl\n\nΓwl\n\n*\n\n0\n-0.5\n\n-0.5\n-1\n-1\n-1.5\n0.5\n\n0.6\n\n0.7\n\n∗\n\nρ0\n\n0.8\n\n0.9\n\n0.5\n\n0.6\n\n0.7\n\n∗\n\nρ0\n\napproach is that explicit expressions (see equation (19)) for the insertion free energies\nof particles into the inhomogeneous equilibrium distribution are obtained, which reduce\nto explicit expressions for the excess chemical potential if the expansion is performed\naround a homogeneous (bulk) state.\nAs an application, we have considered the equation of state for a bulk cut–off and\nshifted Lennard–Jones fluid and the structure and adsorption of this fluid at a hard\nwall. Treating this problem within the mixture theory and expanding around the bulk\nstate, we find excellent agreement between the virial and internal energy routes to the\nequation of state for the fluid and with simulations. Thermodynamic consistency is\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n26\n\ngood for stable state points outside the critical region. By virtue of the underlying\nhard sphere reference functional, complete drying is predicted for the hard wall–liquid\ninterface and the corresponding coexisting densities for the liquid branch are in excellent\nagreement with those from the Maxwell construction. However, there are deviations for\nthe coexisting densities on the gas branch. Nevertheless, this reasonable consistency\nbetween the Maxwell construction and hard wall drying is a novel result within integral\nequation approaches.\nTwo sum rules related to the hard wall problem, the contact density rule, equation\n(63), and the Gibbs adsorption equation (64), have been investigated over a wide range\nof densities and temperatures. Although these sum rules are not satisfied exactly, the\ndeviations are reasonably small, especially near coexistence.\nThe numerical results for both the fluid–fluid and the wall-fluid correlations suggest\na generalized mean field behavior outside the critical region. In the reference functional\napproach, the difference between the fluid free energy and the free energy of the reference\nsystem is expanded up to second order in the density difference (from the bulk density),\nsee equation (26). The coefficient of the second–order term, the difference between the\npair direct correlation functions of the fluid and the reference system, is determined self–\nconsistently and turns out to be quite insensitive to variations in temperature and bulk\ndensity for liquid states, see Figure 6. Therefore we argue that for physical problems\nrelated to wetting and drying a description with density functionals composed of an\naccurate reference part and a mean field attractive term should be sufficient to capture\nall the essential features and will be much less demanding in computational effort.\nRelated to the efficacy of generalized mean–field treatments of simple fluids, we\nnote that a quite different mean–field treatment of the density deviations from the bulk\nwas already developed in reference [47] in which the behaviour of a LJ fluid at a hard\nwall was studied as well. In contrast to the present study, the properties of the hard\nsphere reference system were fixed by considering the first YBG equation, for details see\nreference [47]. Good agreement between simulated and calculated density profiles was\nobtained for selected supercritical state points.\nWe anticipate interesting perspectives for further computations in the problem of\nsmall colloidal particles at interfaces. The free energy profile for particles dragged\nthrough the interface or their mutual interactions at the interface are only beginning\nto be understood. These observables can be analyzed within the reference functional\napproach for inhomogeneous distributions; the challenging numerical implementation\nremains a task for future work.\nAcknowledgments\nThe author is grateful to the Alexander von Humboldt–Foundation for a research grant\nsupporting a stay in Bristol during which a good part of this work was completed. He\nthanks the Physics Department in Bristol and especially Bob Evans and Andy Archer for\ntheir hospitality and for enjoyable discussions. Bob Evans has followed the development\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n27\n\nof the work presented here with great interest and has provided many helpful suggestions\nand he is also thanked for a thorough reading of the manuscript. Furthermore, the\nauthor thanks Roland Roth for beneficial discussions.\nAppendix\nAppendix A. Surface tension at the hard wall\nThe hard wall–liquid surface tension is defined by the expression\nZ ∞\nγwl =\ndz(ω(z) + p) ,\n\n(A.1)\n\nwhere A denotes the area of the wall.\nZ We use the definition\nΩ[ρ(r)] = F [ρ(r)] − dr(μ(ρ0 ) − ξ u12 (r)) ρ(r) .\n\n(A.3)\n\n0\n\nwhere ω(z) is the grand potential volume density and p = p(ρ0 ) is the bulk pressure\nof the liquid with density ρ0 . In terms of the grand potential density functional, this\nequation is equivalent to\n\u0011\n\u0010\n(A.2)\nγwl = Ω[ρ(r)]|ρ(r)=ρ0 g12 (z) − Ω[ρ(r)]|ρ(r)=ρ0 θ(z) /A ,\n\nwith ξ = 1 for the first term in equation (A.2) and ξ = 0 for the second term. According\nto the discussion below equation (35) concerning the hard wall limit, the functional of\nthe free energy is the functional for the one–component LJ fluid,\nF [ρ(r] = F id[ρ(r)] + F HNC [ρ(r)] + F B,ref [ρ(r); d1 ] ,\n\n(A.4)\n\nwith d1 = d1 (ρ0 ) denoting the reference system hard sphere diameter. Straightforward\nevaluation gives\nZ ∞\n\u0010\n\u0003 12 \u0011\nρ0 \u0002 (2)\n12\n(cz − c(2),ref\n)\n∗\nh\nh\n+\nβγwl =\ndz ρ0 g 12 ln g 12 − h12 (1 + βμex,ref (ρ0 )) −\nz\n2\n0\nZ ∞\nex,ref\n12\nβF\n[ρ0 g ] − β\ndz f ex,ref + Iwall ,\n(A.5)\n0\n\u0012\nZ 0\nIwall =\ndz β[f ex (ρ0 ) − f ex,ref (ρ0 )] +\n(A.6)\n−∞\n\u0013\n\u0003 12\nρ20 \u0002 (2)\n(2),ref\n12\n12\nex\nex,ref\n.\n(cz − cz\n)∗h\nh\nρ0 h β(μ (ρ0 ) − μ\n(ρ0 )) −\n2\n\nHere, f ex (ρ0 ) and f ex,ref (ρ0 ) are the bulk free energy volume densities of the fluid and\nthe hard–sphere reference system, respectively. We note that the non–local expansion\nof the free energy in terms of ∆ρ = ρ0 h12 (= −ρ0 for z < 0) introduces contributions\ninside the wall, contained in Iwall . Furthermore,\nZ ∞\n(2)[,ref]\ncz\n(z) = 2π\nrdr c(2)[,ref] (r) ,\n(A.7)\n|z|\n\nand we have introduced the one–dimensional\nconvolution\nZ ∞\nc(2)[,ref]\n∗ h12 (z) =\ndz ′ c(2)[,ref]\n(z − z ′ )h12 (z ′ ) .\nz\nz\n−∞\n\n(A.8)\n\n\fIntegral equations for simple fluids in a general reference functional approach\n\n28\n\nThe unknown free energy density of the liquid f ex (ρ0 ) appearing in the integral Iwall is\nfixed by the requirement that beyond the wall (z < 0) the density is zero and therefore\nalso f ex (0) = 0. On the other hand, f ex (0) is determined by the functional Taylor\nexpansion of the fluid excess free energy around ρ0 , evaluated at zero density. Therefore\nwe find:\n\u0003\nρ20 \u0002 (2)\nex\nex,ref\nex\nex,ref\nc̃ (0) − c̃(2),ref (0) .\n(A.9)\nf (ρ0 ) = f\n(ρ0 ) + ρ0 (μ (ρ0 ) − μ\n(ρ0 )) +\n2\nThis expression is inserted into Iwall and we obtain the expression:\nZ\n\u0002\n\u0003 \u0002\n\u0003\n\u0001\nρ20 0\n(2),ref\nIwall =\ndz c̃(2) (0) − c̃(2),ref (0) − (c(2)\n) ∗ h12 h12 .\n(A.10)\nz − cz\n2 −∞\nThis completes the prescription for calculating γwl .\n\nReferences\n[1] Morita T and Hiroike K 1960 Prog. Theor. Phys 23 1003\n[2] Stell G 1964 in The Equilibrium Theory of Classical Fluids edited by Frisch H L and Lebowitz J\nL (New York:Benjamin) p II-171\n[3] Percus J K 1964 in The Equilibrium Theory of Classical Fluids edited by Frisch H L and Lebowitz\nJ L (New York:Benjamin) p II-33\n[4] Pastore G, Akinlade O, Matthews F, and Badirkhan Z 1998 Phys. Rev. E 57 460\n[5] Parola A and Reatto L 1995 Adv. Phys. 44 211\n[6] Pini D and Stell G 2002 Physica A 306 270\n[7] Vompe A G and Martynov G A 1996 J. Chem. Phys. 106 6095\n[8] Lado F, Foiles S M, and Ashcroft N W 1983 Phys. Rev. A 28 2374\n[9] Hansen J-P and McDonald I 1990 Theory of Simple Liquids (London:Academic Press)\n[10] Evans R, Tarazona P, and Marconi U M B 1983 Mol. Phys. 50 993\n[11] Zhou Y and Stell G 1990 J. Chem. Phys. 92 5533\n[12] Zhou Y and Stell G 1990 J. Chem. Phys. 92 5544\n[13] Kjellander R and Sarman S 1989 J. Chem. Phys. 90 2768\n[14] Kjellander R and Sarman S 1990 Mol. Phys. 70 215\n[15] Nieminen R and Ashcroft N W 1981 Phys. Rev. A 24 560\n[16] McGough R A and Miller M D 1986 Phys. Rev. A 34 457\n[17] Plischke M and Henderson D 1986 J. Chem. Phys. 84 2846\n[18] Bruno E, Caccamo C, and Tarazona P 1987 Phys. Rev. A 35 1210\n[19] Orlandi A, Parola A, and Reatto L 2004 A microscopic approach to critical phenomena at\ninterfaces: an application to complete wetting in the Ising model Preprint cond-mat/0409188\n[20] Ebner C and Saam W F 1977 Phys. Rev. Lett. 38 1486\n[21] Evans R 1992 in Fundamentals of Inhomogeneous Fluids edited by Henderson D (New York:Dekker)\np 85-175\n[22] Evans R and Tarazona P 1983 Phys. Rev. A 28 1864\n[23] Kroll D M and Meister T F 1985 Phys. Rev. B 31 392\n[24] Tarazona P 1985 Phys. Rev. A 31 2672\n[25] Rosenfeld Y 1989 Phys. Rev. Lett. 63 980\n[26] Roth R, Evans R, Lang A, and Kahl G 2002 J. Phys.: Cond. Matt. 14 12063\n[27] van Swol F and Henderson J R 1989 Phys. Rev. A 40 2567\n[28] Choudhury N and Ghosh S 2001 J. Chem. Phys. 114 8530\n[29] Gillespie D, Nonner W, and Eisenberg R S 2003 Phys. Rev. E 68 031503\n[30] Tang Y and Wu J 2003 J. Chem. Phys. 119 7388\n\n\fIntegral equations for simple fluids in a general reference functional approach\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n\n29\n\nRosenfeld Y 1993 J. Chem. Phys. 98 8126\nRosenfeld Y 1996 Phys. Rev. E 54 2827\nRosenfeld Y 1998 Mol. Phys. 94 929\nEvans R 1979 Adv. Phys. 28 143\nHenderson J R 1983 Mol. Phys. 50 741\nBrader J M, Evans R, and Schmidt M 2003 Mol. Phys. 101 3349\nSchmidt M 2004 Rosenfeld functional for non-additive hard spheres Preprint cond-mat/0407013\nKahl G, Bildstein B, and Rosenfeld Y 1996 Phys. Rev. E 54 5391\nOettel M 2004 Phys. Rev. E 69 041404\nCuesta J A, Martinez-Raton Y, and Tarazona P 2002 J. Phys.: Condens. Matter 14 11965\nJohnson J K, Zollweg A, and Gubbins K E 1993 Mol. Phys. 78 591\nHenderson J R and van Swol F 1985 Mol. Phys. 56 1313\nEvans R, Henderson J R, and Roth R 2004 Non–analytic curvature contributions to solvation free\nenergies: influence of drying Preprint cond-mat/0410179 accepted in J. Chem. Phys.\nDietrich S 1988 in Phase Transitions and Critical Phenomena edited by Domb C L and Lebowitz\nJ L (London:Academic) vol 12 p 1\nBryk P, Roth R, Mecke K R, and Dietrich S 2003 Phys. Rev. E 68 031602\nSweatman M B 2000 Mol. Phys. 98 573\nWeeks J D, Katsov K, and Vollmayr K 1998 Phys. Rev. Lett. 81 4400\n\n\f"}