{"id": "http://arxiv.org/abs/cond-mat/0311489v1", "guidislink": true, "updated": "2003-11-20T18:41:42Z", "updated_parsed": [2003, 11, 20, 18, 41, 42, 3, 324, 0], "published": "2003-11-20T18:41:42Z", "published_parsed": [2003, 11, 20, 18, 41, 42, 3, 324, 0], "title": "Spontaneous Symmetry Breaking for Driven Interacting Particles on\n  Triangular Substrates", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0311474%2Ccond-mat%2F0311448%2Ccond-mat%2F0311229%2Ccond-mat%2F0311640%2Ccond-mat%2F0311611%2Ccond-mat%2F0311040%2Ccond-mat%2F0311235%2Ccond-mat%2F0311292%2Ccond-mat%2F0311013%2Ccond-mat%2F0311032%2Ccond-mat%2F0311161%2Ccond-mat%2F0311171%2Ccond-mat%2F0311627%2Ccond-mat%2F0311322%2Ccond-mat%2F0311459%2Ccond-mat%2F0311551%2Ccond-mat%2F0311359%2Ccond-mat%2F0311633%2Ccond-mat%2F0311063%2Ccond-mat%2F0311368%2Ccond-mat%2F0311433%2Ccond-mat%2F0311315%2Ccond-mat%2F0311016%2Ccond-mat%2F0311469%2Ccond-mat%2F0311338%2Ccond-mat%2F0311636%2Ccond-mat%2F0311341%2Ccond-mat%2F0311031%2Ccond-mat%2F0311374%2Ccond-mat%2F0311265%2Ccond-mat%2F0311587%2Ccond-mat%2F0311006%2Ccond-mat%2F0311424%2Ccond-mat%2F0311319%2Ccond-mat%2F0311089%2Ccond-mat%2F0311283%2Ccond-mat%2F0311202%2Ccond-mat%2F0311275%2Ccond-mat%2F0311473%2Ccond-mat%2F0311146%2Ccond-mat%2F0311653%2Ccond-mat%2F0311302%2Ccond-mat%2F0311065%2Ccond-mat%2F0311244%2Ccond-mat%2F0311574%2Ccond-mat%2F0311199%2Ccond-mat%2F0311579%2Ccond-mat%2F0311411%2Ccond-mat%2F0311189%2Ccond-mat%2F0311351%2Ccond-mat%2F0311380%2Ccond-mat%2F0311495%2Ccond-mat%2F0311035%2Ccond-mat%2F0311294%2Ccond-mat%2F0311144%2Ccond-mat%2F0311108%2Ccond-mat%2F0311036%2Ccond-mat%2F0311575%2Ccond-mat%2F0311628%2Ccond-mat%2F0311208%2Ccond-mat%2F0311362%2Ccond-mat%2F0311606%2Ccond-mat%2F0311182%2Ccond-mat%2F0311090%2Ccond-mat%2F0311435%2Ccond-mat%2F0311397%2Ccond-mat%2F0311635%2Ccond-mat%2F0311573%2Ccond-mat%2F0311621%2Ccond-mat%2F0311386%2Ccond-mat%2F0311596%2Ccond-mat%2F0311490%2Ccond-mat%2F0311408%2Ccond-mat%2F0311356%2Ccond-mat%2F0311489%2Ccond-mat%2F0311018%2Ccond-mat%2F0311506%2Ccond-mat%2F0311379%2Ccond-mat%2F0311254%2Ccond-mat%2F0311413%2Ccond-mat%2F0311240%2Ccond-mat%2F0311181%2Ccond-mat%2F0311041%2Ccond-mat%2F0311658%2Ccond-mat%2F0311250%2Ccond-mat%2F0311017%2Ccond-mat%2F0311331%2Ccond-mat%2F0311114%2Ccond-mat%2F0311190%2Ccond-mat%2F0311080%2Ccond-mat%2F0311078%2Ccond-mat%2F0311021%2Ccond-mat%2F0311423%2Ccond-mat%2F0311576%2Ccond-mat%2F0311530%2Ccond-mat%2F0311291%2Ccond-mat%2F0311391%2Ccond-mat%2F0311390%2Ccond-mat%2F0311344%2Ccond-mat%2F0311659%2Ccond-mat%2F0311048&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spontaneous Symmetry Breaking for Driven Interacting Particles on\n  Triangular Substrates"}, "summary": "For collectively interacting repulsive particles driven on triangular\nsubstrates, we show that for certain directions of drive a spontaneous symmetry\nbreaking phenomena occurs where the particles can flow in one of two directions\nthat are not aligned with the external drive, giving rise to a positive or\nnegative Hall current. Along these directions, the particle flow is highly\nordered, while in the direction of the drive the flow is disordered. We also\nfind a number of dynamical phase transitions and unusual hysteretic properties\nthat arise due to the symmetry breaking properties of the flows.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0311474%2Ccond-mat%2F0311448%2Ccond-mat%2F0311229%2Ccond-mat%2F0311640%2Ccond-mat%2F0311611%2Ccond-mat%2F0311040%2Ccond-mat%2F0311235%2Ccond-mat%2F0311292%2Ccond-mat%2F0311013%2Ccond-mat%2F0311032%2Ccond-mat%2F0311161%2Ccond-mat%2F0311171%2Ccond-mat%2F0311627%2Ccond-mat%2F0311322%2Ccond-mat%2F0311459%2Ccond-mat%2F0311551%2Ccond-mat%2F0311359%2Ccond-mat%2F0311633%2Ccond-mat%2F0311063%2Ccond-mat%2F0311368%2Ccond-mat%2F0311433%2Ccond-mat%2F0311315%2Ccond-mat%2F0311016%2Ccond-mat%2F0311469%2Ccond-mat%2F0311338%2Ccond-mat%2F0311636%2Ccond-mat%2F0311341%2Ccond-mat%2F0311031%2Ccond-mat%2F0311374%2Ccond-mat%2F0311265%2Ccond-mat%2F0311587%2Ccond-mat%2F0311006%2Ccond-mat%2F0311424%2Ccond-mat%2F0311319%2Ccond-mat%2F0311089%2Ccond-mat%2F0311283%2Ccond-mat%2F0311202%2Ccond-mat%2F0311275%2Ccond-mat%2F0311473%2Ccond-mat%2F0311146%2Ccond-mat%2F0311653%2Ccond-mat%2F0311302%2Ccond-mat%2F0311065%2Ccond-mat%2F0311244%2Ccond-mat%2F0311574%2Ccond-mat%2F0311199%2Ccond-mat%2F0311579%2Ccond-mat%2F0311411%2Ccond-mat%2F0311189%2Ccond-mat%2F0311351%2Ccond-mat%2F0311380%2Ccond-mat%2F0311495%2Ccond-mat%2F0311035%2Ccond-mat%2F0311294%2Ccond-mat%2F0311144%2Ccond-mat%2F0311108%2Ccond-mat%2F0311036%2Ccond-mat%2F0311575%2Ccond-mat%2F0311628%2Ccond-mat%2F0311208%2Ccond-mat%2F0311362%2Ccond-mat%2F0311606%2Ccond-mat%2F0311182%2Ccond-mat%2F0311090%2Ccond-mat%2F0311435%2Ccond-mat%2F0311397%2Ccond-mat%2F0311635%2Ccond-mat%2F0311573%2Ccond-mat%2F0311621%2Ccond-mat%2F0311386%2Ccond-mat%2F0311596%2Ccond-mat%2F0311490%2Ccond-mat%2F0311408%2Ccond-mat%2F0311356%2Ccond-mat%2F0311489%2Ccond-mat%2F0311018%2Ccond-mat%2F0311506%2Ccond-mat%2F0311379%2Ccond-mat%2F0311254%2Ccond-mat%2F0311413%2Ccond-mat%2F0311240%2Ccond-mat%2F0311181%2Ccond-mat%2F0311041%2Ccond-mat%2F0311658%2Ccond-mat%2F0311250%2Ccond-mat%2F0311017%2Ccond-mat%2F0311331%2Ccond-mat%2F0311114%2Ccond-mat%2F0311190%2Ccond-mat%2F0311080%2Ccond-mat%2F0311078%2Ccond-mat%2F0311021%2Ccond-mat%2F0311423%2Ccond-mat%2F0311576%2Ccond-mat%2F0311530%2Ccond-mat%2F0311291%2Ccond-mat%2F0311391%2Ccond-mat%2F0311390%2Ccond-mat%2F0311344%2Ccond-mat%2F0311659%2Ccond-mat%2F0311048&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "For collectively interacting repulsive particles driven on triangular\nsubstrates, we show that for certain directions of drive a spontaneous symmetry\nbreaking phenomena occurs where the particles can flow in one of two directions\nthat are not aligned with the external drive, giving rise to a positive or\nnegative Hall current. Along these directions, the particle flow is highly\nordered, while in the direction of the drive the flow is disordered. We also\nfind a number of dynamical phase transitions and unusual hysteretic properties\nthat arise due to the symmetry breaking properties of the flows."}, "authors": ["C. Reichhardt", "C. J. Olson Reichhardt"], "author_detail": {"name": "C. J. Olson Reichhardt"}, "author": "C. J. Olson Reichhardt", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/epl/i2004-10182-9", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0311489v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0311489v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 postscript figures", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0311489v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0311489v1", "journal_reference": "Europhys. Lett. 68, 303 (2004)", "doi": "10.1209/epl/i2004-10182-9", "fulltext": "Spontaneous Symmetry Breaking For Driven Interacting Particles on Triangular\nSubstrates\nC. Reichhardt and C.J. Olson Reichhardt\n\narXiv:cond-mat/0311489v1 [cond-mat.soft] 20 Nov 2003\n\nCenter for Nonlinear Studies and Theoretical Division, Los Alamos National Laboratory, Los Alamos, New Mexico 87545\n(November 13, 2018)\nFor collectively interacting repulsive particles driven on triangular substrates, we show that for\ncertain directions of drive a spontaneous symmetry breaking phenomena occurs where the particles\ncan flow in one of two directions that are not aligned with the external drive, giving rise to a positive\nor negative Hall current. Along these directions, the particle flow is highly ordered, while in the\ndirection of the drive the flow is disordered. We also find a number of dynamical phase transitions\nand unusual hysteretic properties that arise due to the symmetry breaking properties of the flows.\nPACS numbers:82.70.Dd,74.25.Qt,05.70.Ln,05.60.Cd\n\nA number of systems can be represented as collectively\ninteracting particles moving over an underlying periodic\nsubstrate, such as models of atomic friction [1], vortex\nflow in superconductors with periodic arrays of pinning\nsites [2–4], and colloids interacting with periodic optical trap arrays [5–7]. Typically these systems exhibit a\nrich variety of dynamical phase transitions under increasing applied drive, such as transitions from highly disordered fluctuating flows to highly ordered one-dimensional\n(1D) and 2D flows, with strong hysteresis between the\nphases [1,3,4]. Other effects such as negative resistance\nand switching can also occur in conjunction with these\ndynamic transitions [1,3]. Usually in these systems the\naverage drift velocity is finite in the direction of the applied force but zero in the direction transverse to the\nforce. Under certain conditions, however, the particles\ndo not flow in the direction of drive, but lock into a symmetry direction of the underlying lattice. For a square\nsubstrate lattice, changing the angle of drive with respect\nto the substrate produces a series of dynamical locking\nphases forming a Devil's staircase structure [4]. Locking effects have been demonstrated for vortices moving\nin superconductors with periodic pinning arrays in both\nsimulations [4] and experiments [8], theoretically for electrons on periodic substrates [9], and in experiments [5]\nand theory [10] for colloids driven over periodic traps,\nwhere it was shown that the locking can be used to sort\nparticles [11]. The directional locking effects are not due\nto collective interactions of the driven particles and can\noccur for a single driven particle.\nFor certain periodic substrate lattice geometries, there\nare two symmetry directions of the substrate that the\nparticles could follow instead of the direction of drive.\nAn example is a triangular lattice oriented such that the\napplied drive is between two symmetry directions, as illustrated schematically in Fig. 1. In this work we show\nthat when there are many interacting driven particles in\nsuch a geometry, spontaneous symmetry breaking can occur where the particles preferentially flow globally along\neither of the two symmetry directions rather than in the\ndirection of drive. Since the substrate is symmetric, the\noccurrence of the global flow can be viewed as a spon-\n\ntaneous symmetry breaking. This transition is driven\nby collective interactions between the repulsive particles.\nIn the limit of a single particle, symmetry breaking is\nnot observed. When the global flow follows one of the\nsymmetry directions of the substrate, the flow is ordered\nwith few fluctuations and a uniform spacing between the\nparticles, reducing their interaction energy. If the global\nflow instead follows the direction of the drive, the particle configuration and flow are much more disordered.\nAt T = 0 for ordered configurations of the driven particles, such as at commensurate fillings, the particles flow\nin the direction of drive. At incommensurate fillings or\nfinite temperatures, however, enough perturbations can\noccur to allow the system to order into one of the two easy\nflow directions. For different system parameters such as\nwaiting times, ramp rates, fillings, and initial conditions,\n\nf\n\nd\n\ny\n\nx\nFIG. 1. Schematic of the system with a triangular substrate. The potential minima are at the center of the circles.\nEach minima captures one or more interacting particles. The\napplied driving force is fd ŷ (solid arrow). There are two easy\nflow directions at ±30◦ from the drive (dashed arrows).\n\n1\n\n\fthe symmetry breaking is equally likely to occur in either\ndirection; thus, for an ensemble of realizations, the symmetry is restored in the statistical sense. Additionally we\nfind a series of dynamical phase transitions where the particle flow changes from ordered to disordered. This can\nproduce unusual hysteretic effects. For example, when increasing the drive, the transverse velocity may lock to the\npositive direction at low drives, but if the system passes\nthrough a disordered flow regime at high drives, then\nwhen decreasing the drive the flow has an equal probability to lock in the negative direction. We explicitly\nshow this effect for colloids moving over periodic substrates and vortices in superconductors with triangular\npinning arrays.\nWe consider a system of Nc overdamped repulsively\ninteracting particles interacting with an underlying triangular periodic substrate with N minima. The equation\nof motion for a particle i is\n\nVy\n\n4 (a)\n2\n\nVx\n\n0 (b)\n0\n-0.5 I\n-1\n(c)\n\nIII\n\nII\n\nIV\n\n0.5\n\nVx\n\ndri\n= fij + fs + fd + fT .\n(1)\ndt\nHere the particle-particle interaction force is fij =\nPN\n− j6=ci ∇i V (rij ), where we use a Yukawa or screened\nCoulomb interaction potential appropriate for colloids,\ngiven by V (rij ) = (q 2 /|ri − rj |) exp(−κ|ri − rj |). Here q\nis the colloid charge, 1/κ is the screening length, and ri(j)\nis the position of particle i(j). We also consider vortices\nin thin film superconductors with periodic pinning. In\nthis case the vortices interact with a logarithmic potential\nV (rij ) = − ln(rij ). For the colloids we consider a triangular substrateP\nwhich can capture multiple colloids per\nminima: fs = 3i=1 A sin(2πpi /a0 )[cos(θi )x̂ − sin(θi )ŷ],\nwhere pi = x cos(θi ) − y sin(θi ) + a0 /2, θ1 = π/6,\nθ2 = π/2, and θ3 = 5π/6. Such substrates can be created with optical trap arrays [7] and have been studied in\nprevious simulations [12]. In the case of vortices, the pinning sites are modeled as short range attractive parabolic\npinning sites in a triangular lattice that capture one vortex each. The additional vortices sit in the interstitial\nregions between the pinned vortices. Length is measured\nin units of the substrate lattice constant a0 and we use a\nscreening length for the colloids of κ = 3/a0 . The thermal force fT is a randomly fluctuating force from random\nkicks. We consider both T = 0 and finite T . The initial\nparticle positions are obtained by simulated annealing\nfrom a high temperature. The driving force fd is applied\nin the y direction as shown in Fig. 1. The drive is increased in small increments to a finite value and then\nsimilarly decreased back to zero. We P\nmeasure both the\nN\nvelocity in the direction of drive, Vy = i vi * ŷ, and the\nPN\nvelocity transverse to the drive, Vx = i vy * x̂.\nWe first consider the case of colloidal particles interacting with a triangular substrate. We concentrate on a\nregime where the number of colloids is greater than the\nnumber of potential minima, as in recent experiments on\ntriangular substrates [7]. Fig. 1 shows a schematic of\n\n0\n\n-0.5\n0\n\n1\n\n2\n\n3\n\n4\n\nfd\nFIG. 2. (a) Velocity in the direction of drive Vy vs applied\ndrive fd for a system of interacting colloids on a triangular\nsubstrate for Nc /N = 1.39. (b) Corresponding transverse\nvelocity Vx vs fd . Regions I-IV correspond to different particle\nflow regimes. (c) The transverse velocity Vx vs fd for the same\nsystem as above but for slightly different initial conditions\nshowing that the transverse velocity reverses from (b).\n\nour system. The dashed arrows indicate the symmetry\ndirections for particle flow. In Fig. 2(a) we plot the average particle velocity in the direction of the drive, Vy ,\nvs applied force for a system with Nc /N = 1.39. In\nFig. 2(b) we show the corresponding average velocity in\nthe x-direction, Vx . Here four distinct dynamic regions\ncan be observed. The first region, I, is the pinned phase\nwhere particles do not move in either direction. Region\nII is the spontaneous symmetry breaking phase where\nthe global flow of particles follows either the positive or\nnegative 30◦ direction as in Fig. 1. In this regime Vy and\nVx both increase linearly with increasing fd . In Fig. 2(b)\nthe particles flow along −30◦ , producing a negative Vx\nor Hall current. As fd increases, the particles start to\nmove in the direction of the drive and there is a transition to region III flow. This transition appears as a sharp\ndrop in Vx with a corresponding increase in the slope of\nVy . Region III is a disordered flow regime with zero average flow in the x-direction. At higher drives we find\na crossover to a more ordered flow in Region IV, which\ncan be identified by the reduction of fluctuations in Vy .\n2\n\n\fIn region IV there can be a slight initial drift in the x\ndirection due to the orientation of the moving particle\nlattice with respect to the triangular substrate, but as fd\nfurther increases, Vx goes to zero.\nIn Fig. 2(c) we show Vx for the same system as in\nFig. 2(a,b) but with slightly different initial particle positions. Here the curve appears almost the same as in\nFig. 2(b), but the flow in region II is in the positive xdirection. We find such symmetry breaking flow, which is\nequally likely to be in the positive or negative direction,\nfor fillings Nc /N > 1.0. There is a small region below\nthe onset of region II where the flow shifts transiently\nbetween the positive and negative directions before it\nlocks to one of the directions. We have done simulations\nfor larger systems and find the same type of velocityforce curves; however, the transitory time for the flow\nto organize into region II increases with system size. At\nNc /N = 2 and 3 and T = 0, region II does not occur because the particle configurations are completely ordered\nat these commensurate fillings and there are no perturbations to knock the system into one of the symmetry\ndirections of the lattice. At finite temperatures, however,\nregion II reappears for these fillings. At incommensurate\nfillings there is a symmetry breaking due to the positional\ndisorder of the particles. For fillings 1.0 < N/Nc < 2.0\nthe velocity force curves look very similar to the curves\nshown in Fig. 2. For N/Nc > 2.0, region II can still\noccur; however, additional dynamical phases arise which\nappear as features in the velocity force curves and the\nnoise fluctuations. We have also studied the temperature dependence of the phases in Fig. 2. We find that\nthere is a sharp transition temperature at which region\nII ends. This temperature is about 0.7Td, where Td is the\nonset temperature for particle diffusion at fd = 0. In the\ninset of Fig. 4, we plot Vx for fixed fd = 1.0 as a function\nof temperature showing the two branches of the velocity\nflow up to Tc where region II is lost. The sharp loss of\nregion II as a function of T is consistent with the sharp\ntransition from region II to the disordered region III.\nIn Fig. 3 we plot the particle positions and trajectories\nfor the different phases. Fig. 3(a) shows the pinned phase\nfor the system in Fig. 2, where a portion of the sites capture two or more colloids. In Fig. 3(b) region II is shown\nfor Fig. 2(b) at fd = 1.0, with the particles moving in 1D\npaths along −30◦ . In Fig. 3(c), the case for Fig. 2(c) is\nshown for the same fd with the flow along +30◦ . Fig. 3(d)\nillustrates region III flow from Fig. 2(c) at fd = 3.2,\nwhere the particle positions and trajectories are disordered. Region IV flow at higher fd is much more ordered\nand the particles move mostly straight along the y direction; however, there are still some dislocations which\ncause the trajectories to be partially disordered.\nThe region II flow can be regarded as an example of\nspontaneous symmetry breaking. There is no asymmetry\nacross the x-axis and in any given realization the system\nis equally likely to lock to either +30◦ or −30◦ .\n\ny\n\ny\nx\n\n(a)\n\ny\n\nx\n\n(b)\n\nx\n\n(d)\n\ny\nx\n\n(c)\n\nFIG. 3. Colloid positions (black dots) and trajectories\n(black lines) for the system in Fig. 2. (a) Pinned region I,\nfd = 0. (b) −30◦ symmetry breaking flow at fd = 1. (c) +30◦\nsymmetry breaking flow at fd = 1. (d) Disordered flow in\nregion III, fd = 3.2.\n\nSpontaneous symmetry breaking in general is not limited\nto equilibrium systems. In condensed matter, the most\nfamiliar example is that of a ferromagnet in zero external\nfield where there are two energy minima. A small perturbation from temperature or dynamics biases the system\nin one direction or another. In our system, when the flow\nfollows one of the symmetry directions, the flow is more\nordered and the particle spacing is more uniform.\nWe have also considered a single particle for the system\nin Fig. 1 as well as other fillings with Nc /N < 1.0. In\nthese cases the global flow locking does not occur. This\nis due to the lack of interactions at these low fillings. At\ndepinning, each particle can move in either the positive\nor negative direction at each potential maximum. If there\nare no neighboring particles blocking one of the routes,\nthe particle flows in a random zig-zag pattern.\nSome of the features in the velocity force curves in\nFig. 2 can be understood by force balance arguments.\nFor the commensurate case Nc = N , the colloid configurations are completely symmetric and the interaction\nforces are zero, so depinning occurs at fd = fsmax , where\nfsmax = 3.0 is the maximum force force from the substrate. For higher Nc , some substrate minima capture\nmore than one colloid. In these dimerised phases, a colloid feels an additional force from the other colloid in the\nsame minima. This will reduce the force needed to depin\nthe colloids by the interaction force fij (a0 /2). Using our\nparameters this would give a depinning force of 0.8 which\n\n3\n\n\f-0.5 Vx 0\n\n0.5\n\n0 T/Td 0.5\n\nVx\n\nsituation occurs for vortices driven in superconductors\nwith periodic pinning arrays. In this case we considered\neach pinning site to capture one vortex. At fields with\nmore than two vortices per pinning site, the same dimer\nstates occur for vortices in the interstitial regions between\nthe pinned vortices and the same phases arise.\nTo summarize, we have found a novel spontaneous\nsymmetry breaking phenomena for collectively interacting driven particles on triangular substrates. The global\nparticle flow occurs along one of two symmetry directions\nand not in the direction of the applied drive. This appears as a positive and a negative finite Hall velocity. The\nflow along the symmetry directions is much more ordered\nthan the flow in the direction of the drive. We also find\na series of dynamical phase transitions between ordered\nand disordered flows which produce jumps in the longitudinal and transverse velocity force curves. The symmetry breaking combined with the flow transverse to the\ndrive produces interesting hysteresis phenomena in the\ntransverse velocity curves where the particles may lock\nto different directions upon increasing and decreasing the\ndrive, as long as the particles pass through a disordered\nflow regime. The results in this work can be realized for\ncolloids driven over optical trap arrays and vortices in\nsuperconductors with periodic pinning arrays. Similar\neffects may be possible for atomic friction systems.\nThis work was supported by the U.S. DoE under Contract No. W-7405-ENG-36.\n\n0.5\n\n1\n\n1\n\n0\n\n-0.5\n\nUp\n-1\n0\n\nDown\n1\n\nUp\n2\n\n3\n\nTime\nFIG. 4. The transverse velocity Vx for the ramp up phase\nof 0.0 < fd ≤ 4.8 for time 0 < t/tr < 1; down from fd = 4.8\nto 0, 1 < t/tr < 2; and up again to fd = 4.8, 2 < t/tr < 3.\nHere tr = 2.24 × 106 molecular dynamics time steps. Inset:\ntransverse velocity for fixed fd = 1.0 vs T /Td .\n\nis somewhat higher than the measured value due to the\ncollective interactions of many dimers. Fig. 3(a) shows\nthat the dimerised states preferably orient either in the\npositive or negative 30◦ direction, so that is the direction\nin which they depin. The transition to region IV flow\noccurs for fd > fsmax where the colloids can move freely\nover the substrate potential maxima.\nWe next consider the hysteretic properties of the\nphases by performing simulations where the external\ndrive is cycled up, down, and up again. In Fig. 4 we\nshow the results for the same system as in Fig. 2 for\nthree drive cycles. For 0 < t/tr < 1 where tr = 2.24×106\nmolecular dynamics time steps, fd is increased from zero\nto fd = 4.8. On the ramp down, beginning at t/tr = 1,\nthere is clear hysteresis in the III-II transition with region\nIII persisting longer on the downward sweep. Hysteresis across the II-III transition is consistent with the first\norder-like sharp jump in Vx across the II-III transition.\nOn the ramp down, region II is again in the negative\ndirection. The slope is also smaller as there are more\ncommensurate pinned rows. We note that because the\nsystem goes through region III the flow is disordered so\nthat the pinned phase near the end of the ramp down\nphase is not necessarily the same as the initial pinned\nphase. On the next ramp up, beginning at t/tr = 2, Vx\nin region II reverses and is in the positive direction. For\ncontinued cycling, even at T = 0, the direction of the\nregion II flow falls randomly in either direction. This is\ndue to the dynamical disordering introduced by the region III flow, which destroys the memory of the previous\npinned phase. We observe similar hysteresis effects for\nother fillings in the range 1 < Nc /N < 4.\nIn addition to the colloidal system, essentially the same\n\n[1] B.N.J. Persson, Phys. Rev. Lett. 71, 1212 (1993);\nO.M. Braun et al., ibid. 78, 1295 (1997); E. Granato\nand S.C. Ying, ibid. 85, 5368 (2000).\n[2] M. Baert et al., Phys. Rev. Lett. 74, 3269 (1995);\nK. Harada et al., Science 274, 1167 (1996); J.I. Martı́n\net al., Phys. Rev. Lett. 83, 1022 (1999).\n[3] C. Reichhardt, C.J. Olson, and F. Nori, Phys. Rev. B 58,\n6534 (1998); B.Y. Zhu et al, ibid. 64, 012504 (2001).\n[4] C. Reichhardt and F. Nori, Phys. Rev. Lett. 82, 414\n(1999).\n[5] P.T. Korda, M.B. Taylor, and D.G. Grier, Phys. Rev.\nLett. 89, 128301 (2002).\n[6] P.T. Korda, G.C. Spalding, and D.G. Grier, Phys. Rev. B\n66, 024504 (2002).\n[7] M. Brunner and C. Bechinger, Phys. Rev. Lett. 88,\n248302 (2002).\n[8] J.E. Villegas et al., cond-mat/0307432, to appear in\nPhys. Rev. B; A.V. Silhanek et al., cond-mat/0302173,\nto appear in Phys. Rev. B.\n[9] J. Wiersig and K.-H. Ahn, Phys. Rev. Lett. 87, 026803\n(2001).\n[10] A. Gopinathan and D.G. Grier, cond-mat/0311117.\n[11] K. Ladavac, K. Kasza, and D.G. Grier, condmat/0310396.\n[12] C. Reichhardt and C.J. Olson, Phys. Rev. Lett. 88,\n248301 (2002).\n\n4\n\n\f"}