{"id": "http://arxiv.org/abs/cond-mat/0008081v1", "guidislink": true, "updated": "2000-08-04T23:04:43Z", "updated_parsed": [2000, 8, 4, 23, 4, 43, 4, 217, 0], "published": "2000-08-04T23:04:43Z", "published_parsed": [2000, 8, 4, 23, 4, 43, 4, 217, 0], "title": "On the Dynamics of the Evolution of the HIV Infection", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0008469%2Ccond-mat%2F0008400%2Ccond-mat%2F0008422%2Ccond-mat%2F0008381%2Ccond-mat%2F0008452%2Ccond-mat%2F0008361%2Ccond-mat%2F0008454%2Ccond-mat%2F0008313%2Ccond-mat%2F0008450%2Ccond-mat%2F0008061%2Ccond-mat%2F0008388%2Ccond-mat%2F0008473%2Ccond-mat%2F0008140%2Ccond-mat%2F0008002%2Ccond-mat%2F0008075%2Ccond-mat%2F0008086%2Ccond-mat%2F0008212%2Ccond-mat%2F0008336%2Ccond-mat%2F0008324%2Ccond-mat%2F0008050%2Ccond-mat%2F0008255%2Ccond-mat%2F0008114%2Ccond-mat%2F0008411%2Ccond-mat%2F0008327%2Ccond-mat%2F0008427%2Ccond-mat%2F0008455%2Ccond-mat%2F0008409%2Ccond-mat%2F0008096%2Ccond-mat%2F0008081%2Ccond-mat%2F0008164%2Ccond-mat%2F0008335%2Ccond-mat%2F0008302%2Ccond-mat%2F0008279%2Ccond-mat%2F0008200%2Ccond-mat%2F0008286%2Ccond-mat%2F0008128%2Ccond-mat%2F0008262%2Ccond-mat%2F0008425%2Ccond-mat%2F0008375%2Ccond-mat%2F0008211%2Ccond-mat%2F0008132%2Ccond-mat%2F0008418%2Ccond-mat%2F0008273%2Ccond-mat%2F0008374%2Ccond-mat%2F0008196%2Ccond-mat%2F0008004%2Ccond-mat%2F0008085%2Ccond-mat%2F0008424%2Ccond-mat%2F0008099%2Ccond-mat%2F0008351%2Ccond-mat%2F0008148%2Ccond-mat%2F0008416%2Ccond-mat%2F0008325%2Ccond-mat%2F0008263%2Ccond-mat%2F0008017%2Ccond-mat%2F0008289%2Ccond-mat%2F0008149%2Ccond-mat%2F0008474%2Ccond-mat%2F0008357%2Ccond-mat%2F0008153%2Ccond-mat%2F0008141%2Ccond-mat%2F0008165%2Ccond-mat%2F0008184%2Ccond-mat%2F0008290%2Ccond-mat%2F0008144%2Ccond-mat%2F0008460%2Ccond-mat%2F0008053%2Ccond-mat%2F0008249%2Ccond-mat%2F0008078%2Ccond-mat%2F0008246%2Ccond-mat%2F0008100%2Ccond-mat%2F0008346%2Ccond-mat%2F0008461%2Ccond-mat%2F0008056%2Ccond-mat%2F0008169%2Ccond-mat%2F0008018%2Ccond-mat%2F0008037%2Ccond-mat%2F0008221%2Ccond-mat%2F0008188%2Ccond-mat%2F0008121%2Ccond-mat%2F0008130%2Ccond-mat%2F0008207%2Ccond-mat%2F0008331%2Ccond-mat%2F0008439%2Ccond-mat%2F0008328%2Ccond-mat%2F0008011%2Ccond-mat%2F0008131%2Ccond-mat%2F0008471%2Ccond-mat%2F0008420%2Ccond-mat%2F0008116%2Ccond-mat%2F0008038%2Ccond-mat%2F0008160%2Ccond-mat%2F0008354%2Ccond-mat%2F0008108%2Ccond-mat%2F0008220%2Ccond-mat%2F0008402%2Ccond-mat%2F0008001%2Ccond-mat%2F0008458%2Ccond-mat%2F0008139%2Ccond-mat%2F0008443%2Ccond-mat%2F0008477&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the Dynamics of the Evolution of the HIV Infection"}, "summary": "We use a cellular automata model to study the evolution of HIV infection and\nthe onset of AIDS. The model takes into account the global features of the\nimmune response to any pathogen, the fast mutation rate of the HIV and a fair\namount of spatial localization. Our results reproduce quite well the\nthree-phase pattern observed in T cell and virus counts of infected patients,\nnamely, the primary response, the clinical latency period and the onset of\nAIDS. We have also found that the infected cells may organize themselves into\nspecial spatial structures since the primary infection, leading to a decrease\non the concentration of uninfected cells. Our results suggest that these cell\naggregations, which can be associated to syncytia, leads to AIDS.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0008469%2Ccond-mat%2F0008400%2Ccond-mat%2F0008422%2Ccond-mat%2F0008381%2Ccond-mat%2F0008452%2Ccond-mat%2F0008361%2Ccond-mat%2F0008454%2Ccond-mat%2F0008313%2Ccond-mat%2F0008450%2Ccond-mat%2F0008061%2Ccond-mat%2F0008388%2Ccond-mat%2F0008473%2Ccond-mat%2F0008140%2Ccond-mat%2F0008002%2Ccond-mat%2F0008075%2Ccond-mat%2F0008086%2Ccond-mat%2F0008212%2Ccond-mat%2F0008336%2Ccond-mat%2F0008324%2Ccond-mat%2F0008050%2Ccond-mat%2F0008255%2Ccond-mat%2F0008114%2Ccond-mat%2F0008411%2Ccond-mat%2F0008327%2Ccond-mat%2F0008427%2Ccond-mat%2F0008455%2Ccond-mat%2F0008409%2Ccond-mat%2F0008096%2Ccond-mat%2F0008081%2Ccond-mat%2F0008164%2Ccond-mat%2F0008335%2Ccond-mat%2F0008302%2Ccond-mat%2F0008279%2Ccond-mat%2F0008200%2Ccond-mat%2F0008286%2Ccond-mat%2F0008128%2Ccond-mat%2F0008262%2Ccond-mat%2F0008425%2Ccond-mat%2F0008375%2Ccond-mat%2F0008211%2Ccond-mat%2F0008132%2Ccond-mat%2F0008418%2Ccond-mat%2F0008273%2Ccond-mat%2F0008374%2Ccond-mat%2F0008196%2Ccond-mat%2F0008004%2Ccond-mat%2F0008085%2Ccond-mat%2F0008424%2Ccond-mat%2F0008099%2Ccond-mat%2F0008351%2Ccond-mat%2F0008148%2Ccond-mat%2F0008416%2Ccond-mat%2F0008325%2Ccond-mat%2F0008263%2Ccond-mat%2F0008017%2Ccond-mat%2F0008289%2Ccond-mat%2F0008149%2Ccond-mat%2F0008474%2Ccond-mat%2F0008357%2Ccond-mat%2F0008153%2Ccond-mat%2F0008141%2Ccond-mat%2F0008165%2Ccond-mat%2F0008184%2Ccond-mat%2F0008290%2Ccond-mat%2F0008144%2Ccond-mat%2F0008460%2Ccond-mat%2F0008053%2Ccond-mat%2F0008249%2Ccond-mat%2F0008078%2Ccond-mat%2F0008246%2Ccond-mat%2F0008100%2Ccond-mat%2F0008346%2Ccond-mat%2F0008461%2Ccond-mat%2F0008056%2Ccond-mat%2F0008169%2Ccond-mat%2F0008018%2Ccond-mat%2F0008037%2Ccond-mat%2F0008221%2Ccond-mat%2F0008188%2Ccond-mat%2F0008121%2Ccond-mat%2F0008130%2Ccond-mat%2F0008207%2Ccond-mat%2F0008331%2Ccond-mat%2F0008439%2Ccond-mat%2F0008328%2Ccond-mat%2F0008011%2Ccond-mat%2F0008131%2Ccond-mat%2F0008471%2Ccond-mat%2F0008420%2Ccond-mat%2F0008116%2Ccond-mat%2F0008038%2Ccond-mat%2F0008160%2Ccond-mat%2F0008354%2Ccond-mat%2F0008108%2Ccond-mat%2F0008220%2Ccond-mat%2F0008402%2Ccond-mat%2F0008001%2Ccond-mat%2F0008458%2Ccond-mat%2F0008139%2Ccond-mat%2F0008443%2Ccond-mat%2F0008477&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We use a cellular automata model to study the evolution of HIV infection and\nthe onset of AIDS. The model takes into account the global features of the\nimmune response to any pathogen, the fast mutation rate of the HIV and a fair\namount of spatial localization. Our results reproduce quite well the\nthree-phase pattern observed in T cell and virus counts of infected patients,\nnamely, the primary response, the clinical latency period and the onset of\nAIDS. We have also found that the infected cells may organize themselves into\nspecial spatial structures since the primary infection, leading to a decrease\non the concentration of uninfected cells. Our results suggest that these cell\naggregations, which can be associated to syncytia, leads to AIDS."}, "authors": ["Rita Maria Zorzenon dos Santos", "Sergio Coutinho"], "author_detail": {"name": "Sergio Coutinho"}, "author": "Sergio Coutinho", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.87.168102", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0008081v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0008081v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 postscript figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0008081v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0008081v1", "journal_reference": "Physical Review Letters, 87 168102 (2001).", "doi": "10.1103/PhysRevLett.87.168102", "fulltext": "On the Dynamics of the Evolution of HIV Infection\nRita Maria Zorzenon dos Santos∗\n\narXiv:cond-mat/0008081v1 [cond-mat.stat-mech] 4 Aug 2000\n\nInstituto de Fı́sica de São Carlos, Universidade de São Paulo, CP 369, CEP 13560-970, São Carlos, São Paulo, Brazil.\n\nSérgio Coutinho\nLaboratório de Fı́sica Teórica e Computacional, Universidade Federal de Pernambuco, CEP 50670-901, Recife, Pernambuco,\nBrazil.\n\nreduction of CD4+ T-cell populations in the peripheral\nblood. The third phase of the disease is achieved when\nthe concentration of the T-cells is lower than a critical\nvalue (∼ 30%), leading to the development of AIDS. As a\nconsequence, the patient normally dies from opportunistic diseases, which would be usually controlled by the\nimmune system. This common pattern observed during\nthe course of the HIV infection1 is depicted in Fig. 1,\nwhich shows the plasma viremia titer and the CD4+ T\ncell counts in the peripheral blood as functions of time.\nSeveral theories2 have been proposed to explain why\nand how the virus remain (albeit in low concentrations)\nin the organism after the primary immune response, and\nthe causes of the decline of T-cell counts, leading to the\nonset of AIDS. So far, none of them has provided, a complete explanation for the entire process. The most common assumption made to explain the permanence of the\nvirus is that of fast mutation rate of the HIV, due to\nits rapid replication and its high degree of variability3,4 .\nThis assumption plays a central role in our theory as well.\nThe challenge to understand the dynamics of the HIV\ninfection has also attracted the attention of mathematicians and physicists that have been working on mathematical models5 to describe different aspects of the dynamics of the host-parasite interaction. Although many\nof these models have contributed to the understanding of\nvarious aspects of the development of the disease, they\nfail to describe either the changes in the amount of virus\ndetected in the body (blood, tissues and other body fluids) during the entire process or the two time scales observed in the course of the HIV infection, i.e., the primary\nresponse which runs from days to weeks and the clinical\nlatency period that may vary from months to years. From\nthe dynamical point of view, these different time scales\nmay be related to two distinct kinds of interactions: one\nlocal and fast; and the other long-ranged and slow.\nMost of the mathematical models proposed so far use\npopulation equations, treating the infected patient as a\nhomogenous entity. Therefore local interactions and spatial inhomogeneities, caused by localization of the initial\nof immune response in lymphoid organs, are not taken\ninto account. We believe that this feature, which is a natural ingredient of our model, are of central importance.\nExperimental evidences6 support that the lymphoid\ntissue is a major reservoir of HIV infection in vivo. Moreover a snapshot of the distribution of cells among the\ndifferent compartments of the immune system will show\nonly a small fraction (2 − 4%) of the cells circulating in\n\nWe use a cellular automata model to study the evolution\nof HIV infection and the onset of AIDS. The model takes into\naccount the global features of the immune response to any\npathogen, the fast mutation rate of the HIV and a fair amount\nof spatial localization. Our results reproduce quite well the\nthree-phase pattern observed in T cell and virus counts of\ninfected patients, namely, the primary response, the clinical\nlatency period and the onset of AIDS. We have also found\nthat the infected cells may organize themselves into special\nspatial structures since the primary infection, leading to a\ndecrease on the concentration of uninfected cells. Our results\nsuggest that these cell aggregations, which can be associated\nto syncytia, leads to AIDS.\nPACS: 02.70c,05.45-a,87.15a,87.18Hf\n\nThe human immunodeficiency virus (HIV), which\ncauses AIDS (the acquired immunodeficiency syndrome)\nhas been the subject of most intense studies, that encompass diverse fields of scientific research, ranging from\nthe natural to the social sciences. Major progress has\nbeen achieved by medical and biological researchers in\nunderstanding the genetic code of the virus, the role of\nits high mutation rate, the virus-host interaction, the apparent failure of the immune system to control and eliminate the virus, and the onset of AIDS. Nevertheless, the\nmechanisms by which HIV causes AIDS still remain unexplained.\nThe immune response to any virus pathogen (virus,\nbacteria, etc.) is generated by a complex web of interactions, involving the cooperative and collective behavior\nof different types of white blood cells (monocytes, T- and\nB-cells). The time scale involved to develop a specific immune response may vary from days to weeks. The complex dynamic of HIV infection and the ensuing onset of\nAIDS involves a wide range of time scales1 . The primary\ninfection exhibits the same characteristics as any other\nviral infection: a dramatic increase of the virus population during the first 2 − 6 weeks, followed by a sharp\ndecline, due to the action of the immune system. For\nHIV, however, instead of being completely eliminated after the primary infection, a low virus burden is detected\nfor a long asymptomatic time: the clinical latency period. This period may vary from two to ten (or more)\nyears, depending on the patient. Besides the low concentration of HIV detected during this period, a gradual\ndeterioration of the immune system is manifested by the\n1\n\n\fit has no infected-A1 neighbor but does have at least R\n(2 < R < 8) infected-A2 neighbors, it becomes infectedA1 (c): otherwise it stays healthy.\nRule 1a mimics the spread of the HIV infection by contact, before the immune system had developed its specific\nresponse against the virus. Rule 1b represents the fact\nthat infected-A2 cells may, before dying, contaminate a\nhealthy cell if their concentration is above some threshold.\nRule 2: An infected-A1 cell becomes infected-A2 after τ\ntime steps.\nAn infected-A2 cell is one against which the immune response has developed and hence its ability to spread the\ninfection is reduced. Here τ represents the time required\nfor the immune system to develop a specific response to\nkill an infected cell. Such a time delay is required for\neach infected cell since in our model we view each new\ninfected cell as carrying a different lineage (strain) of the\nvirus. This is the way we incorporate the fast mutation\nrate of the virus in our model. When a healthy cell is\ninfected, the virus uses the cell's DNA in order to transcribe its RNA and replicate. During each transcription\nan error may occur, producing, on the average, one mutation per generation and hence a new strain of the virus\nis produced3,4 .\nRule 3: Infected-A2 cells become dead cells.\nThis rule simulates the depletion of the infected cells by\nthe immune response.\nRule 4: (a) Dead cells can be replaced by healthy cells\nwith probability prepl in the next time step, (or remain\ndead with probability 1 − prepl ). (b) Each new healthy\ncell introduced may be replaced by an infected-A1 with\nprobability pinf ec .\nRule 4a describes the bone marrow replenishment of the\ndepleted cells, mimicking the high ability of the immune\nsystem to recover from the immunosupression generated\nby infection. As a consequence, it will also mimic some\ndiffusion of the cells in the tissue. Rule 4b simulates the\nentrance of new infected cells in the system that could\ncome from other compartments of the immune system.\nThis four-state automaton allows transitions from each\nof its four states into the next one in a cyclic manner.\nWe performed simulations of the model on square lattices with periodic boundary conditions of N = L2 sites,\nwith L ranging from 300 up to 1000. All the parameters\nadopted in the simulations were based on experimental\ndata. The initial concentration of HIV, pHIV = 0.05, was\nchosen based on the observation that the order of one in\n102 or 103 T cells harbor viral DNA during the primary\ninfection10 . We adopted pinf ec = 10−5 due to the fact\nthat only one in 104 to 105 cells in the peripheral blood of\ninfected individual express viral proteins. Since the immune system has a high ability to replenish the depleted\ncells, we used prepl = 0.99, although smaller probabilities\ncould also be considered, representing different individuals. Since the time delay parameter (τ ) may vary from\n2 to 6 weeks, we chose τ = 4. Each of our time steps\ncorresponds to one week.\n\nblood and lymph, while the majority is found in the lymphoid organs7. Paradoxically, the process of mobilization\nand activation of immune cells directed against the virus\nby the immune system, which occurs in the lymphoid\nmicro-environment in this case, provides a milieu that\ncontributes to the virus spread.6 .\nSuch spatial structure emerges naturally in discrete\nmodels, based on cellular automata that were shown8\nto describe well cooperative and collective patterns in\nexperimentally observed immune response9 . Therefore\nwe model the course of the HIV infection by a cellular\nautomaton. Our model takes into account the main features of the immune response to any pathogen, the high\nmutation rate of the HIV and a fair amount of spatial\nlocalization that may occur in the lymphoid tissues. Our\naim is to test whether the combination of these hypotheses can explain the three-phase dynamics observed on the\ncourse of the HIV infection (see Fig. 1). The results obtained by simulations of our model are shown in Fig. 2\nand, as far as we know, this is the first time that the\ncomplex dynamics of the HIV infection process has been\nso faithfully reproduced by a theoretical model.\n+\n\nViremia\n\nCD4 T Cells\n1100\n1000\nClinical Latency\n\n1:512\n\n800\n\n1:256\n\n700\n\n1:128\n\n600\n\n1:64\n\n500\n\n1:32\n\n400\n\n1:16\n\n300\n\n1:8\n\n200\n\n1:4\n\n100\n\nPlasma Viremia Titer\n\nCD4 T Cell/mm\n\n3\n\n900\n\n1:2\n\n0\n\n0\n\n5\n\n10\n\nWeeks\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\nYears\n\nFIG. 1. The common pattern exhibited by infected patients, first presented by Pantaleo et al1 . The plasma viremia\ntiter (black circles) and CD4+ T cell counts (squares) versus\ntime show a three-phase dynamics.\n\nWe model the immune system cells in the lymphoid\ntissues by a two-dimensional cellular automaton. To each\nlattice site we associate a cell, that may be a target for\nthe HIV (as for instance, a CD4+T cell or a monocyte).\nEach cell can be in one of four states: (a) healthy; (b)\ninfected-A1, corresponding to an infected cell that is free\nto spread the infection; (c) infected-A2, an infected cell\nagainst which a specific immune response has already\ndeveloped and, finally (d) dead, an infected cell that was\neliminated by the immune response.\nThe initial configuration is mainly composed of healthy\ncells, with a small fraction, pHIV , of infected-A1 cells,\nrepresenting the initial contamination by the HIV. In one\ntime step the entire lattice is updated in a synchronized\nparallel way, according to the rules described below. The\nupdated state of a cell depends on the states of its eight\nnearest neighbors.\nRule 1: Update of a healthy cell: (a): if it has at least\none infected-A1 neighbor, it becomes infected-A1. (b): if\n\n2\n\n\finfected cells in the initial configuration is less than or\nequal (2τ + 1), the independent pulses achieve a maximum coverage of the lattice. For τ = 4 the maximum\ncoverage occurs after five weeks as shown in Fig. 3a.\nNote that the distribution of dead (red) cells corresponds\nto the initial configuration of infected cells. After that\nthe concentration of infected cells decreases to a minimal\nvalue at 2(τ + 1) time steps, establishing the end of the\nprimary infection phase (10 weeks, in this case).\n\nWe present in Fig. 2 the evolution of the densities\nof healthy cells, infected cells (considering both A1 and\nA2 types) and dead cells, obtained in simulations of our\nmodel . We show results averaged over one hundred simulations (that used different initial configurations) and\nthe corresponding standard deviations (shown as error\nbars). There is excellent qualitative agreement between\nour results for the density of healthy and infected cells\nand the time evolution of the number of CD4+ T cells in\nthe peripheral blood and the plasma viremia titer showed\nin Fig. 1. The model reproduces the two time scales\nobserved in the dynamics of the HIV infection: a short\none associated with the primary infection and a long one\nrelated to the clinical latency period and the onset of\nAIDS. The small error bars related to the first stage of\nthe infection indicated that its dynamics is insensitive to\nthe initial configuration. However, the large error bars\nduring the latency period suggest the presence of some\nmechanism regulating this phase of infection.\n1,0\n\nCell Densities\n\n0,8\n\n0,6\n\nFIG. 3. (Color) Four snapshots of parts of the lattice configuration for different time steps:(a)-(d) correspond to 5, 18,\n25 and 200 weeks, respectively. During the latency period\nwe observe an organization of different types of cells in layers\nwhich interpenetrate each other. We have adopted the same\nparameters used in Figure 2.\n\n0,4\n\n0,2\n\n0,0\n0\n\n5\n\nWeeks\n\n10\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10 11 12\n\nYears\n\nFIG. 2. The results obtained from our simulations for a\ntwo-dimensional lattice with L = 700, pHIV = 0.05, R = 4,\nτ = 4, pinf ec = 10−5 , prepl = 0.99. The evolution of the\npopulation densities exhibit the same three-phase dynamics\nobserved for infected patients. We have adopted open squares\nfor healthy cells, full circles for infected cells.\n\nIn the following time steps the presence of infected\ncells will be dictated by pinf ec , according to rule 4b.\nWhen new infected cells are introduced, they may generate two different kinds of structures. The simplest case\ncorresponds, as discussed above, to a wave of infected\ncells propagating in all directions, but in this case since\npinf ec << pHIV the average distance hl2 i between the\nnew infected cells, introduced with probability pinf ec at\nrandom locations, is much larger than (2τ + 1). Examples of such structure are shown in the bottom right part\nof Figs. 3b and 3c. The spread of infection generated\nby these structures alone takes a longer time to reach\nnearly complete lattice coverage, and after that the infection vanishes. It is very rare, however, to find only\nthese simple structures. A second type of structure also\noccurs, due to an interplay between rules 1b, 4a and 4b.\nThese special structures are generated by \"sources\" of\ninfected cells. These sources appear, for instance, when\na new infected-A1 cell, introduced by rules 4a and 4b,\nis surrounded by at least four dead cells. At every every (τ + 3) time steps they launch a propagating wave\nfront of infected cells with width (τ + 1). The period\nof the wave fronts corresponds to the period of time the\ninfected-A1 cell (source) remains in the same state (τ )\nplus the three time steps to transition to types infectedA2, dead and healthy, in this sequence. Figs 3b and\n\nThe results presented in Fig. 2 are global properties,\ni.e. average quantities over the entire system. Our model\nallows also a closer look at local behavior, which in fact,\nmay provide the clue for understanding also the global\nproperties. From the analysis of the spatial configurations generated by the model in various individual simulations, we noticed that the slow dynamics observed in\nthe latency period is related to the emergence, after completion of the primary response, of some special spatial\nstructures of infected cells. These growing special structures spread the infection in such way that they slowly\ncommit more and more healthy cells, segregating and\ntrapping uninfected cells.\nIn Fig. 3 we present four \"snapshots\" of typical configurations obtained during one particular simulation.\nStarting form an initial configuration mostly composed\nof healthy cells (blue) with a random distribution of\ninfected-A1 cells (yellow), in subsequent time steps each\nindividual infected-A1 cell generates a pulse of infected\ncells, of width (τ + 1), propagating in all directions.\nWhenever the average distance hl1 i between individual\n3\n\n\fnence of the virus in the system, based on the analysis of the similarities between HIV infection and other\ndiseases2,11 .\nFinally we emphasize that our cellular automaton\nmodel is, as far as we know, the first model which succeeded to reproduce the general features of the complex\ndynamics of the HIV infection, as observed in infected\npatients. This work further substantiates claims made\nin previous studies9 , that discrete models may be useful to describe emergent properties of complex biological\nsystems, and to understand the mechanisms underlying\nits dynamical behavior. The reason for our success in\ndescribing the three-stage dynamics, whereas the other\napproaches fail, is that they do not take into account the\nspatial localization effects that play a major role on the\ncourse of the infection. A detailed study of the mechanisms underlying the dynamics described by our model\nmay lead to new differential equation approaches, more\nsuitable to describe the kind of dynamics observed in the\ncourse of HIV infection.\nWe thank Dr. M. Curié Cabral, I. Procaccia, S. Bocalletti, and J-P. Eckmann for enlightening discussions and\nto Borko Stǒsic for assistance with color graphics. RMZS'\nthanks J.F. Fontanari for the hospitality during her visit\nto IFSC-USP, and FAPESP (project 99/09999-1) for supporting her stay. This work was partially supported by\nthe Brazilian Agencies CNPq, CAPES, FINEP (under\nthe grant PRONEX 94.76.0004/97) and FAPERJ.\n\n3c (upper left) show the growing of such structures for\ntwo subsequent periods, corresponding respectively to 18\nand 25 weeks. As these structures grow, the number of\ninfected cells increases and the concentration of healthy\ncells decreases. Moreover they segregate and trap uninfected cells between two consecutive waves of infected\ncells. These special pattern of cell aggregations explain\nthe slow decrease of T cells in infected patients during the\nlatency period. These growing structures may eventually\ncover the entire lattice, with final densities of different\ncells evolving towards a steady state with average concentrations: (τ + 1)/(τ + 3) for all the infected cells, and\n1/(τ + 3) for both the dead and healthy cells. Note that\nthe average density for healthy cells at the steady state\nis always lower than the observed critical value(∼ 30%)\nof CD4+ T cells counts related to the onset of AIDS in\ninfected patients, i.e, the system's breakdown. Therefore\nthe dynamics of real experimental data is related to the\ntransient behavior of our model and not to its steady\nstate. The long time scale, associated with this transient\nperiod that follows the primary infection, during which\nthe model relaxes towards its steady state, corresponds\nto the clinical latency period.\nAnalysis of the source distribution at any given\ntime shows that the latency period depends on hl3 i,\nthe average distance between sources and, consequently, on the probability of occurrence of sources (∼\nprepl .pinf ec .pHIV ). Actually, since new sources can be\nreleased at any time step, the length of this transient\ntime depends on the spatio-temporal average of the distance between sources.\nIn this work we have shown that our cellular automaton model reproduces quite well the three-stage dynamics\nobserved in the course of the HIV infection, and the different time scales observed in this process. The short\ntime scale, characteristic of the primary infection, increases when τ is increased or when pHIV decreases. The\nlong time scale, responsible for the clinical latency period\nand the onset of AIDS, is associated with the emergence\nof special structures, that increase slowly the number of\ninfected cells and confine healthy cells. This special pattern formation depends on the value of the parameter\nR of rule 1b, prepl and pinf ec . Smaller values of prepl\nenhance the presence of dead cells and favor the formation of the special growing structures. We have also performed a careful investigation of the parameter space,\nand found that three-phase dynamics is reproducible for\na wide range of the parameters. The complete study of\nthe parameter space, the detalied discussion of the necessary conditions to generate the special spatial structures\nand the role they play spreading the infection, is under\npreparation and will be published elsewhere.\nThe growing structures of infected cells may be associated with syncytia, the aggregation of cells observed\nexperimentally, suggesting according to our results that\nthey are responsible for the depletion of T cells leading to\nAIDS. These results actually corroborate some previous\nsuggestions that syncytia are responsible for the perma-\n\nPermanent address: Instituto de Fı́sica, Universidade\nFederal Fluminense, Av. Litorânea s/n- CEP 24210-340Niterói, Rio de Janeiro, Brazil.\n1\nG. Pantaleo, C. Graziozi and A. S. Fauci, New England J.\nof Med. 328, 327 (1993)\n2\nA. S. Fauci, Science 239, 617 (1988)\n3\nM. A. Nowak and A. J. Michael, Sci. American 273, 42,\nAugust 1995\n4\nW. C. Drosopoulos et al., J. Mol. Med. 76, 604 (1998).\n5\nA. S. Perelson and P. W. Nelson, SIAM Review, 41, 3\n(1999), and references therein.\n6\nO. J. Cohen, G. Pantaleo, G. K. Lam and A. S. Fauci,\nSpringer Seminars in Immunopathology 18, 305 (1997).\n7\nD. J. Steckel, J. Theor. Biol. 186, 491 (1997); D. J. Steckel\net al, Immunol. Today 18, 216 (1997).\n8\nR. M. Zorzenon dos Santos, in Annual Reviews of Computational Physics VI, 159-202, ed. by D. Stauffer, World\nScientific (1999).\n9\nR. M. Zorzenon dos Santos and A. T. Bernardes, Phys.\nRev. Lett. 81, 3034 (1998).\n10\nS. M. Schnittman et al., Science 245, 305 (1998); S. M.\nSchnittman et al., Ann. Int. Med, 113, 438 (1990).\n11\nR. A. Weiss, Science 272, 1885 (1996).\n\n∗\n\n4\n\n\f"}