{"id": "http://arxiv.org/abs/cond-mat/0404685v2", "guidislink": true, "updated": "2004-04-29T15:42:05Z", "updated_parsed": [2004, 4, 29, 15, 42, 5, 3, 120, 0], "published": "2004-04-28T17:32:07Z", "published_parsed": [2004, 4, 28, 17, 32, 7, 2, 119, 0], "title": "Phase Effects on the Conductance Through Parallel Double Dots", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0404368%2Ccond-mat%2F0404178%2Ccond-mat%2F0404394%2Ccond-mat%2F0404603%2Ccond-mat%2F0404190%2Ccond-mat%2F0404290%2Ccond-mat%2F0404646%2Ccond-mat%2F0404705%2Ccond-mat%2F0404273%2Ccond-mat%2F0404505%2Ccond-mat%2F0404286%2Ccond-mat%2F0404283%2Ccond-mat%2F0404486%2Ccond-mat%2F0404237%2Ccond-mat%2F0404699%2Ccond-mat%2F0404289%2Ccond-mat%2F0404476%2Ccond-mat%2F0404126%2Ccond-mat%2F0404648%2Ccond-mat%2F0404557%2Ccond-mat%2F0404320%2Ccond-mat%2F0404451%2Ccond-mat%2F0404218%2Ccond-mat%2F0404560%2Ccond-mat%2F0404137%2Ccond-mat%2F0404361%2Ccond-mat%2F0404682%2Ccond-mat%2F0404513%2Ccond-mat%2F0404364%2Ccond-mat%2F0404487%2Ccond-mat%2F0404533%2Ccond-mat%2F0404685%2Ccond-mat%2F0404750%2Ccond-mat%2F0404243%2Ccond-mat%2F0404559%2Ccond-mat%2F0404372%2Ccond-mat%2F0404749%2Ccond-mat%2F0404388%2Ccond-mat%2F0404165%2Ccond-mat%2F0404393%2Ccond-mat%2F0404406%2Ccond-mat%2F0404337%2Ccond-mat%2F0404629%2Ccond-mat%2F0404193%2Ccond-mat%2F0404215%2Ccond-mat%2F0404258%2Ccond-mat%2F0404453%2Ccond-mat%2F0404369%2Ccond-mat%2F0404180%2Ccond-mat%2F0404195%2Ccond-mat%2F0404208%2Ccond-mat%2F0404747%2Ccond-mat%2F0404198%2Ccond-mat%2F0404012%2Ccond-mat%2F0404674%2Ccond-mat%2F0404245%2Ccond-mat%2F0404722%2Ccond-mat%2F0404093%2Ccond-mat%2F0404638%2Ccond-mat%2F0404631%2Ccond-mat%2F0404389%2Ccond-mat%2F0404524%2Ccond-mat%2F0404604%2Ccond-mat%2F0404523%2Ccond-mat%2F0404612%2Ccond-mat%2F0404449%2Ccond-mat%2F0404209%2Ccond-mat%2F0404332%2Ccond-mat%2F0404010%2Ccond-mat%2F0404134%2Ccond-mat%2F0404107%2Ccond-mat%2F0404620%2Ccond-mat%2F0404070%2Ccond-mat%2F0404566%2Ccond-mat%2F0404401%2Ccond-mat%2F0404711%2Ccond-mat%2F0404730%2Ccond-mat%2F0404532%2Ccond-mat%2F0404459%2Ccond-mat%2F0404259%2Ccond-mat%2F0404622%2Ccond-mat%2F0404334%2Ccond-mat%2F0404725%2Ccond-mat%2F0404739%2Ccond-mat%2F0404595%2Ccond-mat%2F0404294%2Ccond-mat%2F0404450%2Ccond-mat%2F0404221%2Ccond-mat%2F0404381%2Ccond-mat%2F0404250%2Ccond-mat%2F0404552%2Ccond-mat%2F0404072%2Ccond-mat%2F0404675%2Ccond-mat%2F0404634%2Ccond-mat%2F0404474%2Ccond-mat%2F0404084%2Ccond-mat%2F0404071%2Ccond-mat%2F0404510%2Ccond-mat%2F0404504%2Ccond-mat%2F0404138%2Ccond-mat%2F0404663&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Phase Effects on the Conductance Through Parallel Double Dots"}, "summary": "Phase effects on the conductance of a double-dot system in a ring structure\nthreaded by a magnetic flux are studied. The Aharonov-Bohm effect combined with\nthe dot many-body charging effects determine the phases of the currents going\nthrough each arm of the ring. The cases for zero magnetic flux or half a\nquantum of flux are discussed in detail. It is shown that, depending upon the\nmagnetic flux and the state of charge of the dots, controlled by gate\npotentials, the dephasing of the upper and lower arm current gives rise to a\n$S=1/2$ or S=1 Kondo regime. We also show that even in the absence of a\nmagnetic flux there can be a circulating current in the ring, depending on the\nsystem parameters.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0404368%2Ccond-mat%2F0404178%2Ccond-mat%2F0404394%2Ccond-mat%2F0404603%2Ccond-mat%2F0404190%2Ccond-mat%2F0404290%2Ccond-mat%2F0404646%2Ccond-mat%2F0404705%2Ccond-mat%2F0404273%2Ccond-mat%2F0404505%2Ccond-mat%2F0404286%2Ccond-mat%2F0404283%2Ccond-mat%2F0404486%2Ccond-mat%2F0404237%2Ccond-mat%2F0404699%2Ccond-mat%2F0404289%2Ccond-mat%2F0404476%2Ccond-mat%2F0404126%2Ccond-mat%2F0404648%2Ccond-mat%2F0404557%2Ccond-mat%2F0404320%2Ccond-mat%2F0404451%2Ccond-mat%2F0404218%2Ccond-mat%2F0404560%2Ccond-mat%2F0404137%2Ccond-mat%2F0404361%2Ccond-mat%2F0404682%2Ccond-mat%2F0404513%2Ccond-mat%2F0404364%2Ccond-mat%2F0404487%2Ccond-mat%2F0404533%2Ccond-mat%2F0404685%2Ccond-mat%2F0404750%2Ccond-mat%2F0404243%2Ccond-mat%2F0404559%2Ccond-mat%2F0404372%2Ccond-mat%2F0404749%2Ccond-mat%2F0404388%2Ccond-mat%2F0404165%2Ccond-mat%2F0404393%2Ccond-mat%2F0404406%2Ccond-mat%2F0404337%2Ccond-mat%2F0404629%2Ccond-mat%2F0404193%2Ccond-mat%2F0404215%2Ccond-mat%2F0404258%2Ccond-mat%2F0404453%2Ccond-mat%2F0404369%2Ccond-mat%2F0404180%2Ccond-mat%2F0404195%2Ccond-mat%2F0404208%2Ccond-mat%2F0404747%2Ccond-mat%2F0404198%2Ccond-mat%2F0404012%2Ccond-mat%2F0404674%2Ccond-mat%2F0404245%2Ccond-mat%2F0404722%2Ccond-mat%2F0404093%2Ccond-mat%2F0404638%2Ccond-mat%2F0404631%2Ccond-mat%2F0404389%2Ccond-mat%2F0404524%2Ccond-mat%2F0404604%2Ccond-mat%2F0404523%2Ccond-mat%2F0404612%2Ccond-mat%2F0404449%2Ccond-mat%2F0404209%2Ccond-mat%2F0404332%2Ccond-mat%2F0404010%2Ccond-mat%2F0404134%2Ccond-mat%2F0404107%2Ccond-mat%2F0404620%2Ccond-mat%2F0404070%2Ccond-mat%2F0404566%2Ccond-mat%2F0404401%2Ccond-mat%2F0404711%2Ccond-mat%2F0404730%2Ccond-mat%2F0404532%2Ccond-mat%2F0404459%2Ccond-mat%2F0404259%2Ccond-mat%2F0404622%2Ccond-mat%2F0404334%2Ccond-mat%2F0404725%2Ccond-mat%2F0404739%2Ccond-mat%2F0404595%2Ccond-mat%2F0404294%2Ccond-mat%2F0404450%2Ccond-mat%2F0404221%2Ccond-mat%2F0404381%2Ccond-mat%2F0404250%2Ccond-mat%2F0404552%2Ccond-mat%2F0404072%2Ccond-mat%2F0404675%2Ccond-mat%2F0404634%2Ccond-mat%2F0404474%2Ccond-mat%2F0404084%2Ccond-mat%2F0404071%2Ccond-mat%2F0404510%2Ccond-mat%2F0404504%2Ccond-mat%2F0404138%2Ccond-mat%2F0404663&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Phase effects on the conductance of a double-dot system in a ring structure\nthreaded by a magnetic flux are studied. The Aharonov-Bohm effect combined with\nthe dot many-body charging effects determine the phases of the currents going\nthrough each arm of the ring. The cases for zero magnetic flux or half a\nquantum of flux are discussed in detail. It is shown that, depending upon the\nmagnetic flux and the state of charge of the dots, controlled by gate\npotentials, the dephasing of the upper and lower arm current gives rise to a\n$S=1/2$ or S=1 Kondo regime. We also show that even in the absence of a\nmagnetic flux there can be a circulating current in the ring, depending on the\nsystem parameters."}, "authors": ["V. M. Apel", "Maria A. Davidovich", "G. Chiappe", "E. V. Anda"], "author_detail": {"name": "E. V. Anda"}, "author": "E. V. Anda", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.72.125302", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0404685v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0404685v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Submitted to PRL 10/2003", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0404685v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0404685v2", "journal_reference": null, "doi": "10.1103/PhysRevB.72.125302", "fulltext": "arXiv:cond-mat/0404685v2 [cond-mat.mes-hall] 29 Apr 2004\n\nPhase Effects on the Conductance Through Parallel Double Dots\nV.M. Apel1 , Maria A. Davidovich1 , G. Chiappe2 and E.V. Anda1\n1 Departamento\n\nde Fı́sica, Pontifı́cia Universidade Católica do Rio de Janeiro, 22453-900, Brazil\n\n2 Departamento\n\nde Fı́sica, Facultad de Ciencias Exactas y Naturales,\n\nUniversidad de Buenos Aires, 1428, Argentina\nPhase effects on the conductance of a double-dot system in a ring structure\nthreaded by a magnetic flux are studied. The Aharonov-Bohm effect combined\nwith the dot many-body charging effects determine the phases of the currents going\nthrough each arm of the ring. The cases for zero magnetic flux or half a quantum\nof flux are discussed in detail. It is shown that, depending upon the magnetic flux\nand the state of charge of the dots, controlled by gate potentials, the dephasing of\nthe upper and lower arm current gives rise to a S = 1/2 or S = 1 Kondo regime.\nWe also show that even in the absence of a magnetic flux there can be a circulating\ncurrent in the ring, depending on the system parameters.\nPACS numbers: 73.63.-b,73.63.Kv\n\nIn the last years attention has been focused on the properties of double-quantum-dot\nsystems1 since they are expected to be basic building blocks for quantum computing2 . In this\ncontext mesoscopic coherent transport is a key phenomenon that can probe entanglement3\nand phases accumulated by electrons traversing the system. The phase-coherent transport\neffects can be analyzed by embedding the dots into an Aharonov-Bohm ring threaded by a\nmagnetic flux and connected to leads. Theoretical4 and experimental5 works have discussed\nthe transmission phase shifts of single and double quantum dot systems in the Coulomb\nblockade regime. More recently the effect of Kondo correlation on the transmission phase of\na quantum dot has been measured6 and theoretically discussed7,8,9,10,11,12 .\nThe two-quantum-dot system is particularly interesting since, when each dot is inserted\ninto one arm of a ring connected to leads, as represented in Fig. 1, it presents two paths for\nthe electrons to go through, producing interferences that depend upon the phase in each arm.\nThe effect of the interferences on the spectral densities of such a system has been studied14 ,\ntaking the intra and inter-dot Coulomb repulsion to be infinite. This limit restricts the study\n\n\f2\nof the Kondo phenomenon and the phase shift interference effects to a situation in which the\nnumber of electrons in the system cannot be greater than one. However, depending on the\nmagnetic flux enclosed by the ring, new and very interesting physics appear when both dots\nare charged and in the Kondo regime. Moreover, the general problem of the transmission\nphases in this system as the magnetic flux and the state of charge of the dots are varied\nhas not been yet clarified. The dephasing between the two contributions to the current do\nnot depend exclusively upon the state of charge of each dot, as a naive interpretation of the\nFriedel sum rule could predict. This is a consequence of the fact that the phases associated\nto the arms are not independent objects because one is renormalized by the other7,8 .\nThe purpose of this letter is to contribute to the understanding of this problem. We discuss phase effects on the conductance of this system using an exact numerical diagonalization\nalgorithm that provides only the ground state of the system. Our study is therefore restricted\nto zero temperature. This procedure permits us to take into account in an adequate way\nthe interference effects due to the interaction between the two ring arms. Different Kondo\nregimes are accessed by varying the magnetic flux and the charge in the dots controlled by\nthe gate potentials. The Aharonov-Bohm effect combined with the dot many-body charging\neffects determine the phases of the currents going through each arm of the ring. In order\nto have confiability in the numerical results, we adopt a dot-lead interaction such that the\nKondo cloud is of the order of the cluster we exactly diagonalize13 . In this case the plateau\nshape of the conductance, when the system is in the Kondo regime, is more like a Lorentzian.\nThe conductance shows quite different behaviors for the magnetic flux Φ = 0 and Φ = Φ0 /2.\nIn the first case the dots act coherently and the system is in a Kondo state of total spin\nS ∼ 1 while in the second, the dots are uncorrelated and in a S =\n\n1\n2\n\nKondo regime. For\n\nother fluxes the conductance shows intermediate behavior between these two extremes. As\nan important consequence of interference we also find that current can circulate around the\nring even in the absence of magnetic fluxes.\nAn Anderson two-impurity first-neighbor tight-binding Hamiltonian represents the system shown in Fig. 1,\nH =\n\nX\nU\nc+\nVr + nrσ̄ nrσ + t\niσ cjσ\n2\ni,j\n\nX \u0012\n\nr=α,β\nσ\n\n\u0014\n\ni π2\n\n+ t′ e\n\nΦ\nΦ0\n\n\u0013\n\n\u0015\n\n+\n+\n+\n(c+\nασ c1σ +c1σ cβσ +cβσ c1̄σ +c1̄σ cασ) +c.c.\n\n(1)\n\n\f3\nwhere Vα and Vβ are the gate potentials applied to the dots, U is the Coulomb repulsion,\nconsidered to be equal for the two dots and Φ is the magnetic flux threading the ring. The\nparameters t' and t are, respectively, the hopping matrix element between the dots and\ntheir neighbors and between sites in the leads. The one particle Green functions G are\nimposed to satisfy a Dyson equation Ĝ = ĝ + ĝ T̂ Ĝ where ĝ is the Green function matrix of\na cluster containing the ring with the dots and a number of atoms of each lead and T̂ is the\nmatrix Hamiltonian that couples the cluster to the rest of the system. The undressed Green\nfunction ĝ is calculated using the cluster ground state obtained by the Lanczos method. This\napproximation13 has shown to be very accurate when the cluster is of the size of the Kondo\ncloud hvF /TK , where vF is the Fermi velocity and TK the Kondo temperature, although\nit gives qualitatively reliable results even for smaller clusters, compatible with the Friedel\nsum-rule and the Fermi liquid properties of the system.\nThe transport properties are studied as a function of the gate potentials applied to the\ndots. Taking the energies in units of the Coulomb interaction U, we set the leads bandwidth\nW = 8 and Γ = t′2 /W = 0.05. The Fermi level is chosen to be ǫF = 0. The conductance\nG = dI/dV is obtained using the Keldysh formalism to calculate the total current I =\nP\n\ni=α,β Ii ,\n\nwhere Iα and Iβ are the contributions coming from the two ring arms given by,\n\nIi =\n\ni\n2et′2 Z ∞ h −+\n(gL (ω) − gR−+ (ω)) × Im {Gr1̄1̄ (ω)Ga1̄i (ω) − Gr1̄1 (ω)Ga1i (ω)} dω\nh −∞\n\n(2)\n\nwhere sites 1 and 1̄ are the dots first neighbors, Gr and Ga are the dressed retarded and\nadvanced Green functions and gL−+ and gR−+ are, respectively, the density of states at the\nleft and right contacts multiplied by the Fermi distribution function. The Green functions\nare calculated at the Fermi level.\nThe conductance for two values of the magnetic flux, Φ = 0 and Φ0 /2, is represented in\nFig. 2 as a function of the energy of the dot levels. It results to be weakly dependent upon\nthe magnetic flux in the regions of the parameter space where only one dot is active so that\ncurrent flows essentially along one arm of the ring. It possesses the characteristics of the\none-dot conductance with a width, as a function of the gate potential, of the order of U due\nto the Kondo effect of the charging dot. On the other hand, when Vα ∼ Vβ , the conductance\nis strongly dependent upon the magnetic flux, showing special different features for the cases\nΦ = 0 and Φ0 /2. Let us focus on the region −1 < Vα , Vβ < 0 of Fig. 2. The differences\nin the conductance between these two cases are more striking when the dot level energies\n\n\f4\nare similar, ∆E ∼ 0 (diagonal continuous line). In this case the two arms are at resonance\nsince both dots are in the Kondo regime. For Φ = 0 the two arm currents are in phase\nand interfere constructively and the conductance has one broad peak. As the magnetic flux\nis turned on, the currents along the two arms are no longer in phase and the transport\nproperties change qualitatively. For Φ = Φ0 /2, the current arm amplitudes are out of phase\nand the conductance for ∆E = 0 cancels out for all values of the gate potentials, as shown\nin Fig. 2b.\nFor small values of ∆E, the conductance presents two peaks for Φ = Φ0 /2, and three\nfor Φ = 0, the most interesting case. The spin-spin correlation, the charge at the dots and\nthe conductance are displayed in Fig. 3 as a function of Vα for ∆E = 0.6(Vα = Vβ − 0.6),\ncorresponding to the dashed line in Fig. 2. We first analyze the case Φ = 0. As Vα\ndecreases from the value 0.5 and charge begins to enter into dot α its spin gets negatively\ncorrelated to the conduction electrons. The dot is in the Kondo regime and the conductance\nincreases up to a quantum of conductance maximum around Vα = −0.2. At Vα = −0.5\nthe conductance cancels out and the various spin-spin correlations change abruptly. In the\n~α S\n~c i and hS\n~β S\n~c i, gets\nregion −0.5 < Vα < −1.1 the Kondo correlation of both dots, hS\nstronger (Fig. 3b) and the conductance grows again reaching a second maximum at the\nelectron-hole symmetry condition, Vα = −0.8, where the system has just two electrons.\nThe most interesting aspect of the conductance is that its lateral peaks are due to a Kondo\nregime that is different from the one of the central peak. This conclusion can be obtained\nfrom the analysis of the spin-spin correlation of the two dots, shown in Fig. 3b. When the\ngate potential is reduced from Vα = 0.5, dot α enters into resonance and into the Kondo\nregime, while the other is well above the Fermi level and empty of charge. The current\ncirculates only along dot α giving rise to the first peak of the conductance. It is a typical\nS = 1/2 Kondo effect. As the gate potential is further reduced the electronic charge begins\nto drop also into dot β, giving rise to a new Kondo peak that, due to level repulsion, pushes\nthe other one, at α, to values below the Fermi level. This reduces the DOS at the Fermi\nlevel, diminishing the conductance of the system, and raises the dot α charge to a value\nabove unity (Fig. 3c), increasing the energy of the ground state due to Coulomb interaction.\nAs a consequence, a level crossing takes place and an excited state with total dots spin mean\nvalue < ST >∼ 1 and less charge at dot α becomes the new ground state of the system.\nThis process gives rise to an abrupt reduction of the dot charge and to a restoration of\n\n\f5\nthe Kondo resonance at the Fermi level. While in the gate potential region corresponding\nto the original ground state the two dots are weakly antiferromagnetic correlated, in this\nnew ground state they adopt a coherent behavior and have a strong ferromagnetic spin-spin\n~α S\n~β i, independent of the gate potential, as shown in Fig. 3b. The system\ncorrelation, hS\nis in a S = 1 Kondo regime. The two crossing states have opposite parity. The crossing\nitself and the consequent abrupt change of the physical properties is derived from the fact\nthat the system is spatially invariant under reflection so that parity is a good quantum\nnumber. When this symmetry is broken by introducing a small magnetic field (note that\nwe are analyzing the case φ = 0) or an asymmetric perturbation to the Hamiltonian, the\nground state results to be a linear combination of these two previous states. In this case the\nlevel crossing transforms into a cross-over behavior and the abrupt changes of the physical\nquantities are eliminated. This phenomenon is enhanced when the interaction among the\ndots and the conduction electrons is increased. When this interaction is large enough, the\nKondo cloud is reduced to the size of the cluster we exactly diagonalize. In this region of\nthe parameter space our approximation is almost numerically exact and independent of the\ncluster size we adopt, for sizes greater than the Kondo cloud.\nThe physics of the Φ = Φ0 /2 case is diverse from the previously discussed. In this situation\nthe dot spins are weakly correlated while each dot is independently Kondo correlated to the\nelectrons of the leads, as appears in Fig. 3e. This different behavior can be clarified by a\nperturbation theory argument. The effective correlation between the dots can be obtained\nby taking the non-diagonal matrix elements that connect the dots to the rest of the circuit,\nt′ , as a perturbation. Due to the system topology it is clear that to get the dominant\ncontribution to the effective inter-dot interaction it is necessary to go to forth order in\nperturbation theory. In this case, while for Φ = 0 the contributions that go from one dot\nto the other and return along the same path sum-up with the circulating contributions, for\nΦ = Φ0 /2 these two contributions, having opposite signs, tend to cancel each other, giving\nrise to a weak interdot correlation. For small ∆E the conductance(Fig. 3d) possesses only\none peak that develops into two as ∆E increases. The charge at the dots has a smooth\ndependence upon the gate potential, as shown in Fig. 3f.\nIn order to better understand these behaviors, we have calculated the conductance of each\narm of the ring, using equation (2), as well as the phases of the electronic wave functions\nrelated to these two paths. The conductances are displayed in Fig. 4 as a function of the\n\n\f6\ngate potential Vα . For ∆E = 0 and Φ = 0 (Fig. 4a) the two arms are identical and their\ncurrents circulate along the ring in opposite direction summing up to constitute the total\ncurrent in the leads. However, if Φ = Φ0 /2 (Fig. 4b) the two arm currents circulate in the\nsame direction giving rise to a persistent current along the ring and a total zero conductance.\nSatisfying a well known property, the circulating current changes sign as the total charge\nof the ring varies, as shown in the figure. The same phenomenon shows up in the case\nΦ = Φ0 /2 and ∆E = 0.6, presented in Fig. 4d.\nHowever, the existence of a magnetic flux crossing the ring is not a necessary condition to\nobtain a circulating current, as can be seen in Fig. 4c, for Φ = 0 and ∆E = 0.6. When the\ntwo dots are unequally charged there is a region of the gate potential parameter for which\na net current circulates around the ring. This is due to an interference effect among the\ncharges going along the two arms. For other values of the gate potentials, both currents are\npositive and the circulation disappears.\nThe quantum interference among the electrons are studied by calculating the phase and\namplitude of the transmission that is proportional to the square modulus of Gr1̄,1 = gc t′ (Grα,1 +\nGrβ,1 ), where gc is the retarded Green function of the disconnected lead at the site 1̄ and\nthe two terms represent the contributions coming from the two arms of the system. Taking\nthe contribution from arm α as a reference, the total transmission can be written as |Aα +\nAβ eiφα,β |2 , where Aα and Aβ are, respectively, proportional to the modulus of Grα,1 and Grβ,1 ,\nand φα,β is their phase difference. It is important to notice that Grα,1 and Grβ,1 incorporate\nall the renormalization of one arm due to the existence of the other. As a consequence, the\nphase of each trajectory is a function not only of its own dot charge but also of the charge\nof the other dot, and depends as well upon the topology of the whole system7 . According\nto the Onsager relation the conductance of our system, that possesses a closed geometry,\nis an even function of the applied magnetic flux threading it, which implies φα,β = 0 or π,\ndepending upon the gate potentials applied to the dots. The transmission amplitudes and\nthe phase difference are shown in Fig. 5 as a function of the gate potential for the case\nΦ = 0, ∆E = 0.6. When the transmission amplitudes are equal, Aα = Aβ , the conductance\ncancels or has a maximum depending upon the phase difference being φα,β = π (Vα = −0.5\nand −1.1) or φα,β = 0 (Vα = −0.8).\nIn summary we have studied a double-dot system in a ring threaded by a magnetic flux\nand connected to leads. The cases Φ = 0 and Φ0 /2 are discussed. It is shown that the\n\n\f7\ndephasing of the upper and lower arm current determines whether the system is in a S = 1\nKondo regime, when the two dots behave coherently, or in a S = 1/2 Kondo regime, when\nthey are uncorrelated. We show as well that, depending on the parameters, a circulating\ncurrent appears even if there is no magnetic flux threading the ring. This very interesting\nphenomenon will be discussed in detail somewhere else.\nWe acknowledge FAPERJ, CNPq, CIAM (CNPq), CAPES(CAPG-BA,12/02) and CONICET for financial support. G.C. also acknowledges the support of the Buenos Aires University (UBACYT x210) and Fundacion Antorchas.\n\n1\n\nW.G.van der Wiel et al., Rev. Mod. Phys. 75, 1 (2003); C.A. Busser et al., Phys. Rev. B 62,\n9907 (2000); D. Loss et al., Phys. Rev. A 57, 120 (1998).\n\n2\n\nD.P. DiVicenzo Science 720 255 (1995); G. Burkard et al., Phys. Rev. B 592070 (1999).\n\n3\n\nD. Loss et al., Phys. Rev. Lett. 84, 1035 (2000).\n\n4\n\nA. Aharony et al., Phys. Rev. B 66, 115311 (2002); J. Konig et al., Phys. Rev. Lett. 86, 3855\n(2001); A.Y. Smirnov et al., App. Phys. Lett. 77, 578 (2000).\n\n5\n\nA.W. Holleitner et al., Phys. Rev. Lett. 87, 256802 (2001); A. Yacoby et al., Phys. Rev. Lett.\n74, 4047 (1995).\n\n6\n\nY. Ji et al., Phys. Rev. Lett. 88, 076601 (2002); U. Gerland et al., Phys. Rev. Lett. 84, 3710\n(2000).\n\n7\n\nA. Aharony et al., Phys. Rev. Lett. 90, 156802 (2003).\n\n8\n\nW. Hofstetter et al., Phys. Rev. Lett. 87, 156803 (2001).\n\n9\n\nE. Anda et al., Phys. Rev. B. 66, 035307 (2002).\n\n10\n\nK. Kang et al., Phys. Rev. B. 63, 113304 (2001)\n\n11\n\nH.P. Eckle et al., Phys. Rev. Lett. 87, 016602 (2001)\n\n12\n\nS.Y. Cho et al., Phys. Rev. B. 64, 033314 (2001)\n\n13\n\nV. Ferrari et al., Phys. Rev. Lett. 82, 5088 (1999).\n\n14\n\nD. Boese et al., Phys. Rev. B 66, 125315 (2002); ibid Phys. Rev. B 64, 125309 (2001).\n\n\f8\nβ\n\nβ\n1\n\nt ́\n\nt ́\n\nΦ\n\nL\n\nt ́\n\n1\nR\n\nt ́\n\nα\n\nα\n\nFIG. 1: Aharonov-Bohm interferometer with two embedded quantum dots, threaded by a magnetic\nflux Φ, connected to leads.\n\n1.6\n\nVβ/U\n\n0.8\n\n0.0\n\n-0.8\n\n-1.6\n1.6\n\nVβ/U\n\n0.8\n\n0.0\n\n-0.8\n\n-1.6\n-1.6\n\n-0.8\n\n0.0\nVα/U\n\n0.8\n\n1.6\n\nFIG. 2: Conductance (white, maximum; black, minimum) as a function of the gate potentials at\nthe dots, Vα and Vβ . Φ = 0(upper panel), Φ = Φ0 /2(lower panel); ∆E = 0 (continuous line),\n∆E = 0.6(dashed line).\n\n\f9\n1\n\nConductance\n\nΦ=0\n\nΦ=Φ0/2\n\nSpin-Correlation\n\n0.5\n\n(a)\n\n0\n0.2\n\n(d)\n\n<SαSc>\n<SβSc>\n<SαSβ>\n\n<SαSc>\n<SβSc>\n<SαSβ>\n\n0\n-0.2\n2\n\nCharge\n\n(e)\n\n(b)\nDot α\nDot β\n\nDot α\nDot β\n\n1.5\n1\n\n(f)\n\n(c)\n\n0.5\n0\n-2.4 -1.6 -0.8\n\nVα/U\n\n0\n\n0.8 -2.4 -1.6 -0.8\n\n0\n\n0.8\n\nVα/U\n\nFIG. 3: Conductance (in units of 2e2 /h), spin correlation and charge (in units of e) at the dots for\n∆E = 0.6 (Vβ = Vα + 0.6) and Φ = 0 (left) and Φ = Φ0 /2 (right), as a function of Vα .\n\n\f∆Ε=0.6\n\n0.00\n\n0.5\n\n0.0\n-0.02\n\nArm Conductance\n\n0.3\n\n0.5\n\n0.1\n\nArm Conductance\n\n0.4\n\n0.0\n-0.4\n-0.8\n-1.2\n-1.6\n0.5\n\nΦ = 0(upper) and Φ = Φ0 /2(lower).\n\n10\n\nβ (dashed line), as a function of Vα for ∆E = 0.(left) and ∆E = 0.6(right) and magnetic fluxes\n\nFIG. 4: Conductance (in units of 2e2 /h) of the ring arm that contains dot α (solid line) and dot\n\nb) Φ=Φ0/2\n\nVα/U\nVα/U\n\n0.0\n-0.5\n-1.0\n-1.5\n\n__ Dot α\n- - Dot β\n\nd) Φ=Φ0/2\n∆Ε=0\n0.02\n\n0.0\n0.2\n\n1.0\n__ Dot α\n- - Dot β\n\nc) Φ=0\n∆Ε=0.6\n0.5 a) Φ=0\n∆Ε=0\n\n\f0.0\n-0.8\n0\n\n1\n\n-1.0\n\n-0.5\n\n0.0\n\n2\n\nTransmission Amplitude\n\na)\n\nb)\n\n-1.6\n\n-1.2\n\nVα\n\n__ Dot α\n- - Dot β\n\n-0.4\n\nΦ=0\n∆Ε=0.6\n\nΦ=0\n∆Ε=0.6\n\n11\n\nφα- φβ\n\nFIG. 5: Transmission through the two ring arms as a function of Vα , for Φ = 0 and ∆E = 0.6. (a)\nphase difference (units of π); (b) modulus(arb.units).\n\n\f"}