{"id": "http://arxiv.org/abs/cond-mat/0208252v1", "guidislink": true, "updated": "2002-08-13T13:54:16Z", "updated_parsed": [2002, 8, 13, 13, 54, 16, 1, 225, 0], "published": "2002-08-13T13:54:16Z", "published_parsed": [2002, 8, 13, 13, 54, 16, 1, 225, 0], "title": "Evaluating the Surface Tension Using Grand Canonical Transition Matrix\n  Monte Carlo and Finite-Size Scaling", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0208060%2Ccond-mat%2F0208206%2Ccond-mat%2F0208581%2Ccond-mat%2F0208351%2Ccond-mat%2F0208484%2Ccond-mat%2F0208068%2Ccond-mat%2F0208469%2Ccond-mat%2F0208222%2Ccond-mat%2F0208289%2Ccond-mat%2F0208442%2Ccond-mat%2F0208017%2Ccond-mat%2F0208162%2Ccond-mat%2F0208470%2Ccond-mat%2F0208562%2Ccond-mat%2F0208128%2Ccond-mat%2F0208033%2Ccond-mat%2F0208570%2Ccond-mat%2F0208280%2Ccond-mat%2F0208568%2Ccond-mat%2F0208393%2Ccond-mat%2F0208038%2Ccond-mat%2F0208411%2Ccond-mat%2F0208078%2Ccond-mat%2F0208046%2Ccond-mat%2F0208336%2Ccond-mat%2F0208382%2Ccond-mat%2F0208051%2Ccond-mat%2F0208262%2Ccond-mat%2F0208290%2Ccond-mat%2F0208116%2Ccond-mat%2F0208510%2Ccond-mat%2F0208309%2Ccond-mat%2F0208271%2Ccond-mat%2F0208221%2Ccond-mat%2F0208473%2Ccond-mat%2F0208454%2Ccond-mat%2F0208251%2Ccond-mat%2F0208030%2Ccond-mat%2F0208465%2Ccond-mat%2F0208027%2Ccond-mat%2F0208242%2Ccond-mat%2F0208069%2Ccond-mat%2F0208248%2Ccond-mat%2F0208174%2Ccond-mat%2F0208493%2Ccond-mat%2F0208429%2Ccond-mat%2F0208014%2Ccond-mat%2F0208199%2Ccond-mat%2F0208500%2Ccond-mat%2F0208489%2Ccond-mat%2F0208538%2Ccond-mat%2F0208591%2Ccond-mat%2F0208331%2Ccond-mat%2F0208353%2Ccond-mat%2F0208029%2Ccond-mat%2F0208240%2Ccond-mat%2F0208322%2Ccond-mat%2F0208015%2Ccond-mat%2F0208444%2Ccond-mat%2F0208590%2Ccond-mat%2F0208175%2Ccond-mat%2F0208091%2Ccond-mat%2F0208605%2Ccond-mat%2F0208502%2Ccond-mat%2F0208082%2Ccond-mat%2F0208443%2Ccond-mat%2F0208419%2Ccond-mat%2F0208232%2Ccond-mat%2F0208013%2Ccond-mat%2F0208340%2Ccond-mat%2F0208110%2Ccond-mat%2F0208257%2Ccond-mat%2F0208236%2Ccond-mat%2F0208390%2Ccond-mat%2F0208035%2Ccond-mat%2F0208059%2Ccond-mat%2F0208099%2Ccond-mat%2F0208557%2Ccond-mat%2F0208101%2Ccond-mat%2F0208545%2Ccond-mat%2F0208103%2Ccond-mat%2F0208184%2Ccond-mat%2F0208373%2Ccond-mat%2F0208139%2Ccond-mat%2F0208293%2Ccond-mat%2F0208056%2Ccond-mat%2F0208481%2Ccond-mat%2F0208152%2Ccond-mat%2F0208197%2Ccond-mat%2F0208517%2Ccond-mat%2F0208188%2Ccond-mat%2F0208427%2Ccond-mat%2F0208252%2Ccond-mat%2F0208394%2Ccond-mat%2F0208531%2Ccond-mat%2F0208261%2Ccond-mat%2F0208299%2Ccond-mat%2F0208508%2Ccond-mat%2F0208189%2Ccond-mat%2F0208193%2Ccond-mat%2F0208348&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evaluating the Surface Tension Using Grand Canonical Transition Matrix\n  Monte Carlo and Finite-Size Scaling"}, "summary": "This letter describes a novel approach for determining the surface tension of\na model system that is applicable over the entire liquid-vapor coexistence\nregion. At the heart of the method is a new technique for determining\ncoexistence properties that utilizes transition probabilities of attempted\nMonte Carlo moves during a grand canonical simulation. Finite-size scaling\ntechniques are implemented to determine the infinite system surface tension\nfrom a series of finite-size simulations. To demonstrate the new method, the\nsurface tension of the Lennard-Jones fluid is determined at temperatures\nranging from the triple point to the critical point.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0208060%2Ccond-mat%2F0208206%2Ccond-mat%2F0208581%2Ccond-mat%2F0208351%2Ccond-mat%2F0208484%2Ccond-mat%2F0208068%2Ccond-mat%2F0208469%2Ccond-mat%2F0208222%2Ccond-mat%2F0208289%2Ccond-mat%2F0208442%2Ccond-mat%2F0208017%2Ccond-mat%2F0208162%2Ccond-mat%2F0208470%2Ccond-mat%2F0208562%2Ccond-mat%2F0208128%2Ccond-mat%2F0208033%2Ccond-mat%2F0208570%2Ccond-mat%2F0208280%2Ccond-mat%2F0208568%2Ccond-mat%2F0208393%2Ccond-mat%2F0208038%2Ccond-mat%2F0208411%2Ccond-mat%2F0208078%2Ccond-mat%2F0208046%2Ccond-mat%2F0208336%2Ccond-mat%2F0208382%2Ccond-mat%2F0208051%2Ccond-mat%2F0208262%2Ccond-mat%2F0208290%2Ccond-mat%2F0208116%2Ccond-mat%2F0208510%2Ccond-mat%2F0208309%2Ccond-mat%2F0208271%2Ccond-mat%2F0208221%2Ccond-mat%2F0208473%2Ccond-mat%2F0208454%2Ccond-mat%2F0208251%2Ccond-mat%2F0208030%2Ccond-mat%2F0208465%2Ccond-mat%2F0208027%2Ccond-mat%2F0208242%2Ccond-mat%2F0208069%2Ccond-mat%2F0208248%2Ccond-mat%2F0208174%2Ccond-mat%2F0208493%2Ccond-mat%2F0208429%2Ccond-mat%2F0208014%2Ccond-mat%2F0208199%2Ccond-mat%2F0208500%2Ccond-mat%2F0208489%2Ccond-mat%2F0208538%2Ccond-mat%2F0208591%2Ccond-mat%2F0208331%2Ccond-mat%2F0208353%2Ccond-mat%2F0208029%2Ccond-mat%2F0208240%2Ccond-mat%2F0208322%2Ccond-mat%2F0208015%2Ccond-mat%2F0208444%2Ccond-mat%2F0208590%2Ccond-mat%2F0208175%2Ccond-mat%2F0208091%2Ccond-mat%2F0208605%2Ccond-mat%2F0208502%2Ccond-mat%2F0208082%2Ccond-mat%2F0208443%2Ccond-mat%2F0208419%2Ccond-mat%2F0208232%2Ccond-mat%2F0208013%2Ccond-mat%2F0208340%2Ccond-mat%2F0208110%2Ccond-mat%2F0208257%2Ccond-mat%2F0208236%2Ccond-mat%2F0208390%2Ccond-mat%2F0208035%2Ccond-mat%2F0208059%2Ccond-mat%2F0208099%2Ccond-mat%2F0208557%2Ccond-mat%2F0208101%2Ccond-mat%2F0208545%2Ccond-mat%2F0208103%2Ccond-mat%2F0208184%2Ccond-mat%2F0208373%2Ccond-mat%2F0208139%2Ccond-mat%2F0208293%2Ccond-mat%2F0208056%2Ccond-mat%2F0208481%2Ccond-mat%2F0208152%2Ccond-mat%2F0208197%2Ccond-mat%2F0208517%2Ccond-mat%2F0208188%2Ccond-mat%2F0208427%2Ccond-mat%2F0208252%2Ccond-mat%2F0208394%2Ccond-mat%2F0208531%2Ccond-mat%2F0208261%2Ccond-mat%2F0208299%2Ccond-mat%2F0208508%2Ccond-mat%2F0208189%2Ccond-mat%2F0208193%2Ccond-mat%2F0208348&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This letter describes a novel approach for determining the surface tension of\na model system that is applicable over the entire liquid-vapor coexistence\nregion. At the heart of the method is a new technique for determining\ncoexistence properties that utilizes transition probabilities of attempted\nMonte Carlo moves during a grand canonical simulation. Finite-size scaling\ntechniques are implemented to determine the infinite system surface tension\nfrom a series of finite-size simulations. To demonstrate the new method, the\nsurface tension of the Lennard-Jones fluid is determined at temperatures\nranging from the triple point to the critical point."}, "authors": ["Jeffrey R. Errington"], "author_detail": {"name": "Jeffrey R. Errington"}, "author": "Jeffrey R. Errington", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.67.012102", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0208252v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0208252v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0208252v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0208252v1", "journal_reference": null, "doi": "10.1103/PhysRevE.67.012102", "fulltext": "Evaluating the Surface Tension Using Grand Canonical Transition Matrix\nMonte Carlo and Finite-Size Scaling\nby\nJeffrey R. Errington∗\nDepartment of Chemical Engineering, University at Buffalo, The State University of New York,\nBuffalo, NY 14260-4200\n\n(Submitted to Physical Review Letters August 13, 2002)\n\nAbstract\nThis letter describes a novel approach for determining the surface tension of a model system\nthat is applicable over the entire liquid-vapor coexistence region. At the heart of the method is\na new technique for determining coexistence properties that utilizes transition probabilities of\nattempted Monte Carlo moves during a grand canonical simulation. Finite-size scaling techniques are implemented to determine the infinite system surface tension from a series of finitesize simulations. To demonstrate the new method, the surface tension of the Lennard-Jones\nfluid is determined at temperatures ranging from the triple point to the critical point.\n\n∗\n\nElectronic address: jerring@buffalo.edu\n\n\fThe interfacial tension of fluids plays a key role in many industrial processes and scientific\nphenomena. Examples include the development of protective coatings and the self-assembly of\namphiphilic polymers. Although the scientific and industrial importance of the interfacial tension has been realized for some time, development of a robust method for calculating the surface\ntension of a model system using molecular simulation techniques that is applicable over the entire liquid-vapor coexistence region has proven to be particularly challenging. There are two\ncomputational techniques that are commonly used for determining interfacial tensions. In one,\nthe surface tension is calculated using elements of the pressure tensor evaluated during a molecular dynamics or Monte Carlo simulation in which an explicit interface is formed [1-7]. This\napproach is most appropriate at moderate to low reduced temperatures. As the critical temperature is approached, it becomes difficult to maintain the interface. Moreover, the results are\nknown to be highly sensitive to the procedure used for truncating the potential and the size of the\nsystem simulated [8,9]. A second technique utilizes the finite-size scaling formalism introduced\nby Binder [10]. In this approach, grand canonical [11] or isothermal-isobaric [12] simulations\nare used to evaluate the free energy barrier between the liquid and vapor phase for a series of\nsystem sizes, after which finite-size scaling is used to extrapolate the infinite system value. This\nmethod has enjoyed success for calculations performed at temperatures close to the critical point.\nHowever, at lower temperatures, the calculations necessary to negotiate the liquid-vapor free energy barrier become intractable.\nThis paper describes a novel approach for directly determining the liquid-vapor phase coexistence, including the free energy barriers, of a model system at any temperature along the coexistence line. The method relies on transition matrix Monte Carlo ideas [13-17]. In particular,\nMonte Carlo transition dynamics and variance reduction techniques, developed by Fitzgerald et\n\n2\n\n\fal. [16,17], are implemented. The transition matrix algorithms were originally developed for\ninvestigation of discrete systems. Here, the concepts are incorporated with the grand canonical\nensemble to provide a framework for determining the thermodynamic properties of continuous\nsystems. The new method utilizes information from the attempted transitions between states\nalong the Markov chain as opposed to tracking the number of times the chain visits a given state.\nThe data collection scheme for the proposed technique is highly efficient; at no point is any of\nthe data discarded. Determination of surface tensions is completed using the finite-size scaling\nformalism of Binder [10]. This approach provides a means to estimate the behavior of the infinite system from finite-size calculations. The methods presented in this paper are general. To\nillustrate the concepts, the surface tension of the Lennard-Jones fluid is determined at temperatures ranging from slightly above the triple point to slightly below the critical point.\nConsider a system in the grand canonical ensemble [18], where the volume V, temperature\nT, and chemical potential μ are fixed and the number of particles N and energy E fluctuate. For\nsuch a system, the Markov chain visits a given microstate s = s ( r1 , r2 ,... , rN ) with probability,\n\nπs =\n\n1\nV Ns\nexp ( − β Es ) exp ( βμ N s ) ,\nΞ Λ3 Ns N s !\n\n(1)\n\nwhere β denotes the inverse temperature ( β = 1 kBT , kB is the Boltzmann factor), Λ is the de\n\nBroglie wavelength, and Ξ is the partition function, defined such that\n\n∑π\n\ns\n\n= 1 . For phase coex-\n\ns\n\nistence calculations, one must determine the probability Π N of finding the system with the macrostate variable N, given by Π N =\n\n∑\n\ns , Ns = N\n\nπ s . To obtain an estimate of Π N , a standard grand ca-\n\nnonical simulation is performed with a simple bookkeeping scheme that enables one to deduce\n\n3\n\n\fthe transition probabilities PN , N ′ , which indicate the probability of moving to state N ′ given that\nthe current state is N. The algorithm consists of three parts [17]:\n1. For each Monte Carlo step, propose a move to a new microstate s′ from the current\nmicrostate s with probability qs , s′ [19].\n2. Accept the proposed configuration with probability as , s′ = min {1, π s′ π s } .\n3. Regardless of whether the move is accepted, update a matrix C N , N ′ as follows,\nC N , N ′ = C N , N ′ + as , s′\n\n(2a)\n\nand\n\nC N , N = C N , N + 1 − as , s ′\n\n(2b)\n\nThis bookkeeping scheme is superior to earlier techniques that required one to update the C N , N ′\nmatrix by either zero or one after each step [13]. At any point during the simulation, an estimate\nof the transition probabilities is obtained as follows,\nCN , N ′\n,\nP\"N , N ′ =\n∑ CN , N ′′\n\n(3)\n\nN ′′\n\nwhere the tilde (~) is used to indicate an estimate of the transition probabilities. After obtaining\nan estimate of PN , N ′ , the Monte Carlo detailed balance expression is employed to find the macrostate probabilities Π N ,\nΠ N PN , N ′ = Π N ′ PN ′, N .\n\n(4)\n\nIn the above expression, the transition matrix PN , N ′ is a stochastic matrix with a stationary solution of Π N . For the grand canonical simulation with a single particle creation or annihilation\nproposal mechanism, the transition matrix PN , N ′ is banded with three bands. This greatly simpli-\n\n4\n\n\ffies the determination of Π N . An iterative scheme can be used to determine the macrostate\nprobabilities,\n\n(\n\n)\n\n\" N +1 = ln Π\n\" N + ln P\"N , N +1 P\"N +1, N .\nln Π\n\n(5)\n\nTo traverse the region between coexisting liquid and vapor phases, the system has to visit\nlow probability states that are often inadequately sampled during a conventional grand canonical\nsimulation. To address this problem, a simulation is often biased such that all macrostates\nwithin a specified interval are sampled with equal probability. This so called multicanonical\nsampling [20] is accomplished by assigning each macrostate a weight η N that is inversely proportional to the frequency of observing the macrostate during a conventional simulation,\n\nη\"N = − ln Π\" N .\n\n{\n\nThe\n\nacceptance\n\nprobability\n\nin\n\nstep\n\n2\n\nabove\n\nnow\n\nbecomes,\n\n}\n\naηs , s′ = min 1, eηN′ π s′ eηN π s . During the simulation, the weighting function is reevaluated at\nregular intervals. The success of the current approach lies in the efficiency of the technique.\nAlthough a bias in the sampling has been introduced, the update scheme for C N , N ′ remains the\nsame, i.e., after each Monte Carlo trial, C N , N ′ is incremented by the probability that the proposed\nmove would be accepted in the absence of multicanonical sampling. This simplification allows\none to periodically update the weighting function without having to eliminate the previous data.\nOver time, the weighting function evolves and eventually the entire macrostate interval of interest is sampled. The run is terminated when the weighting function, and thus the particle number\nprobability distribution, converges.\nOnce the macrostate probabilities have been determined, the coexistence properties are\ncalculated in a straightforward manner. Histogram reweighting [21] is used to locate the chemical potential that provides coexistence at the given temperature. The coexisting densities are\n5\n\n\fsubsequently determined from the first moment of the corresponding liquid and vapor peaks of\nthe Π coex\ndistribution. If the zero particle limit is sampled during the simulation, the vapor presN\nsure is determined using the ideal gas as a reference state [22,23],\n\n\n\n\nβ pV = ln  ∑ Π coex\nΠ 0coex  − ln ( 2 ) .\nN\n\n\nN\n\n\n\n(6)\n\nFinally, the liquid-vapor free energy barrier F for a system with box length L [24] is obvap\ntained from the maximum probabilities in the liquid Π liq\nNmax and vapor Π Nmax phases and the\n\nminimum probability Π Nmin in the region enclosed by the two maxima [25],\n\nβ FL =\n\n1\nvap\nln Π liq\n(\nNmax + ln Π Nmax ) − ln Π Nmin .\n2\n\n(7)\n\nThe finite-size scaling formalism of Binder [10] is used to determine the liquid-vapor surface tension. According to this method, the finite-size interfacial tension γ L of a three dimensional system is given by,\n\nβγ L =\n\nβ FL\n2\n\n2L\n\n= c1\n\n1\nln L\n+ c2 2 + βγ ,\n2\nL\nL\n\n(8)\n\nwhere γ is the infinite system interfacial tension and c1 and c2 are constants. The expression\nsuggests that the term β FL 2 L2 becomes linear in the scaling variable ln ( L ) L2 as the system\nsize approaches infinity. The formalism enables one to extrapolate the infinite system size interfacial tension from a series of finite system calculations.\nThe Lennard-Jones fluid [26] has been selected to demonstrate the new approach. The energy of interaction u between any two particles in the system separated by a distance r is given\nby,\n12\n6\nu ( r ) = 4ε (σ r ) − (σ r )  ,\n\n\n\n(9)\n\n6\n\n\fwhere ε and σ are energy and size parameters, respectively. From this point forward, all quantities are nondimensionalized using ε and σ as characteristic energy and length scales, respectively. For example, temperature is reduced by ε kB and the interfacial tension by ε σ 2 . The\nmethod outlined above is used to evaluate the liquid-vapor interfacial tension at temperatures of\n\nT = 0.70 , T = 0.85 , T = 1.10 , and T = 1.30 . Grand canonical transition matrix Monte Carlo\nsimulations are carried out with systems ranging in size from L = 6 to L = 14 using as many as\n20 billion MC steps with the weighting function updated every one million MC steps. The potential cutoff is set at one-half the box length and standard tail corrections are applied [27].\nThe density distributions at coexistence for various system sizes with T = 0.85 are displayed in Figure 1. The results indicate that probabilities as low as 10-200 are accessible using\nthe transition matrix approach. This range of probabilities is significantly greater than possible\nwhen using multicanonical methods that implement a visited states strategy [11].\nFigure 2 shows the liquid-vapor interfacial tension as a function of the scaling variable for\nthe four temperatures examined. One of the more striking features of the plot is the precision of\nthe calculations. For example, at T = 0.85 the uncertainty in the interfacial tension is less than\n0.5 percent of the mean for all system sizes [28]. As expected, the data points do not collapse\nonto a straight line as a function of the scaling variable, but rather display a small degree of curvature. The best method for extrapolating the infinite system interfacial tension from the finitesize data is not clear [12]. In this work, the infinite system interfacial tension was estimated\nfrom a straight line fit using data points with L ≥ 9 . Note that the infinite system values become\nmore sensitive to the extrapolation technique as the temperature increases. For example, at\n\nT = 0.70 the L = 12 interfacial tension is within 3.9 percent of the infinite system result,\n\n7\n\n\fwhereas the equivalent value at T = 1.30 is 42 percent. The infinite system surface tensions and\nthe corresponding coexistence properties are collected in Table 1.\nThe surface tensions obtained in this study, along with those from previous investigations,\nare displayed as a function of temperature in Figure 3. The agreement among the data sets is\nexcellent. At low temperatures, the results generated using the transition matrix approach are\nconsistent with the investigations of Mecke et al. [5] and Chen et al. [7], where techniques that\nrequire an explicit interface were employed. The approach presented here has a number of advantages over explicit interface methods: (i) the new technique is straightforward to use, requiring just slightly more overhead to implement than a standard grand canonical simulation, (ii) the\nprecision of the results from this work appears to be superior to that of data from previous investigations, (iii) there exists a well-developed framework to describe how the interfacial tension\nscales as a function of system size, and (iv) the new method does not fail at near-critical temperatures. As expected, the current results are also consistent with those of Potoff and Panagiotopoulos [11], who utilized grand canonical ensemble simulations coupled with the visited states\ntechnique for obtaining multicanonical weights. The limitations of the visited states method\nprevented the authors from obtaining surface tensions below T = 0.95 . The current study demonstrates that adopting the transition matrix approach allows one to probe the entire liquid-vapor\ncoexistence region.\nIn summary, a general method has been presented for directly locating the phase coexistence of a model system at a given temperature. Implementation of the method requires the addition of a simple bookkeeping scheme that tracks the transition probabilities for addition and\ndeletion of particles during a grand canonical simulation. The method is applicable over the entire liquid-vapor coexistence region and does not appear to be limited by system size. It is\n\n8\n\n\fstraightforward to couple the new technique to the finite-size scaling framework of Binder for\naccurate determination of interfacial tensions.\nThe outlook for the approach presented in this paper is bright. The results from this study\nindicate, that for a single component system containing spherically symmetric particles, the new\nmethod is just as straightforward to implement and potentially more accurate than equivalent\nGibbs ensemble [29] calculations. Whether this conclusion holds true for more complicated systems will be addressed in future investigations. The overall performance of transition matrix\nmethods has been remarkable. In addition to the current study, they have been used with equal\nsuccess to determine solid-liquid phase coexistence and free energies of solvation of nonpolar\nmolecules in water [30].\n\nAcknowledgement\nI thank Professor David Kofke for helpful discussions and comments on the manuscript. Financial support for this project was provided by startup funds from the University at Buffalo. Computational resources were provided in part by the University at Buffalo Center for Computational\nResearch.\n\n9\n\n\fReferences\n\n[1]\n\nM. Rao and D. Levesque, J. Chem. Phys. 65, 3233 (1976).\n\n[2]\n\nG.A. Chapela, G. Saville, S.M. Thompson, and J.S. Rowlinson, J. Chem. Soc., Faraday\nTrans. 2 73, 1133 (1977).\n\n[3]\n\nM. Rao and B.J. Berne, Mol. Phys. 37, 455 (1979).\n\n[4]\n\nM.J.P. Nijmeijer, A.F. Baker, C. Bruin, and J.H. Sikkenk, J. Chem. Phys. 89, 3789 (1988).\n\n[5]\n\nM. Mecke, J. Winkelman, and J. Fisher, J. Chem. Phys. 107, 9264 (1997).\n\n[6]\n\nM.P. Moody and P. Attard, J. Chem. Phys. 115, 8967 (2001).\n\n[7]\n\nB. Chen, J.I. Siepmann, K.J. Oh, and M.L. Klein, J. Chem. Phys. 115, 10903 (2001).\n\n[8]\n\nA. Trokhymchuk and J. Alejandre, J. Chem. Phys. 111, 8510 (1999).\n\n[9]\n\nC.D. Holcomb, P. Clancy, and J.A. Zollweg, Mol. Phys. 78, 437 (1993).\n\n[10] K. Binder, Phys. Rev. A 25, 1699 (1982).\n[11] J.J. Potoff and A.Z. Panagiotopoulos, J. Chem. Phys. 112, 6411 (2000).\n[12] J.E. Hunter and W.P. Reinhardt, J. Chem. Phys. 103, 8627 (1995).\n[13] G.R. Smith and A.D. Bruce, Journal of Physics A 28, 6623 (1995).\n[14] J.S. Wang, T.K. Tay, and R.H. Swendsen, Phys. Rev. Lett. 82, 476 (1999).\n[15] J.S. Wang and R.H. Swendsen, J. Stat. Phys. 106, 245 (2002).\n[16] M. Fitzgerald, R.R. Picard, and R.N. Silver, Europhys. Lett. 46, 282 (1999).\n[17] M. Fitzgerald, R.R. Picard, and R.N. Silver, J. Stat. Phys. 98, 321 (2000).\n[18] G.E. Norman and V.S. Filinov, High Temp. 7, 216 (1969).\n[19] In this work, new microstates are generated such that qs , s′ = qs′, s .\n\n10\n\n\f[20] B.A. Berg and T. Neuhaus, Phys. Rev. Lett. 68, 9 (1992).\n[21] A.M. Ferrenberg and R.H. Swendsen, Phys. Rev. Lett. 61, 2635 (1988).\n[22] J.R. Errington and A.Z. Panagiotopoulos, J. Chem. Phys. 109, 1093 (1998).\n[23] The ln ( 2 ) correction appears due to the summation over both the liquid and vapor phases.\n[24] In all cases the simulation cell is cubic.\n[25] All probabilities are evaluated at coexistence.\n[26] J.E. Lennard-Jones, Proc. R. Soc. London, Ser. A 106, 441 (1924); 106, 463 (1924).\n[27] M.P. Allen and D.J. Tildesley, Computer Simulation of Liquids (Clarendon, Oxford,\n1987).\n[28] Uncertainties were determined as the standard deviation of four independent runs.\n[29] A.Z. Panagiotopoulos, Mol. Phys. 61, 812 (1987).\n[30] J.R. Errington, Unpublished results.\n\n11\n\n\fTables\nTable 1. Coexistence properties of the Lennard-Jones fluid.\npa\nT\nρliqa\nρvapa\n0.70\n0.001367 (2)\n0.8424 (13)\n0.001992 (2)\n0.85\n0.007618 (5)\n0.7760 (10)\n0.009611 (9)\n1.10\n0.04592 (5)\n0.6410 (7)\n0.05485 (5)\n1.30\n0.1212 (1)\n0.4271 (13)\n0.2096 (13)\na\nCalculated using a system size of V = 1000 .\n\n12\n\nγ\n1.182 (10)\n0.837 (2)\n0.343 (2)\n0.0050 (5)\n\n\fFigure Captions\nFigure 1. The probability of observing a system with a given density while at coexistence with\n\nT = 0.85 for a range of system sizes.\n\nFigure 2. The system size dependence of the effective surface tension. The plots from top to\n\nbottom are for T = 1.30 , T = 1.10 , T = 0.85 , and T = 0.70 . The circles represent simulation\ndata and the dashed lines provide an extrapolation to infinite system size using data from systems\nwith L ≥ 9 .\n\nFigure 3. The surface tension of the Lennard-Jones fluid as a function of temperature. This\n\nwork (filled circles), Mecke et al. [5] (squares), Chen et al. [7] (triangles), and Potoff et al. [11]\n(diamonds). The dashed line serves as a guide to the eye.\n\n13\n\n\f0\n\nL=6\n8\n\nln ΠN\n\n-100\n\n10\n-200\n\n12\n-300\n\n14\n-400\n\n0\n\n0.2\n\n0.4\n\nρ = N/V\nFigure 1\n\n0.6\n\n0.8\n\n\f0.010\n0.005\n\nT = 1.30\n\n0.000\n0.3\n\nβFL / 2L\n\n2\n\nT = 1.10\n\n0.2\n1.0\n\nT = 0.85\n\n0.9\n0.8\n1.7\n\nT = 0.70\n1.6\n1.5\n\n0\n\n0.01\n\n0.02\n\n0.03\n\nln(L) / L\nFigure 2\n\n0.04\n2\n\n0.05\n\n\f1.4\n1.2\n1.0\n\nγ\n\n0.8\n0.6\n0.4\n0.2\n0.0\n\n0.6\n\n0.8\n\n1.0\n\nT\n\nFigure 3\n\n1.2\n\n1.4\n\n\f"}