{"id": "http://arxiv.org/abs/cond-mat/0512292v3", "guidislink": true, "updated": "2006-01-24T01:37:36Z", "updated_parsed": [2006, 1, 24, 1, 37, 36, 1, 24, 0], "published": "2005-12-14T05:11:07Z", "published_parsed": [2005, 12, 14, 5, 11, 7, 2, 348, 0], "title": "Integer Lattice Gases at Equilibrium", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0512566%2Ccond-mat%2F0512553%2Ccond-mat%2F0512650%2Ccond-mat%2F0512080%2Ccond-mat%2F0512033%2Ccond-mat%2F0512471%2Ccond-mat%2F0512490%2Ccond-mat%2F0512293%2Ccond-mat%2F0512561%2Ccond-mat%2F0512305%2Ccond-mat%2F0512694%2Ccond-mat%2F0512648%2Ccond-mat%2F0512413%2Ccond-mat%2F0512140%2Ccond-mat%2F0512194%2Ccond-mat%2F0512005%2Ccond-mat%2F0512009%2Ccond-mat%2F0512433%2Ccond-mat%2F0512245%2Ccond-mat%2F0512527%2Ccond-mat%2F0512606%2Ccond-mat%2F0512619%2Ccond-mat%2F0512134%2Ccond-mat%2F0512385%2Ccond-mat%2F0512211%2Ccond-mat%2F0512623%2Ccond-mat%2F0512557%2Ccond-mat%2F0512420%2Ccond-mat%2F0512336%2Ccond-mat%2F0512387%2Ccond-mat%2F0512503%2Ccond-mat%2F0512264%2Ccond-mat%2F0512313%2Ccond-mat%2F0512472%2Ccond-mat%2F0512204%2Ccond-mat%2F0512249%2Ccond-mat%2F0512118%2Ccond-mat%2F0512315%2Ccond-mat%2F0512318%2Ccond-mat%2F0512668%2Ccond-mat%2F0512375%2Ccond-mat%2F0512388%2Ccond-mat%2F0512265%2Ccond-mat%2F0512105%2Ccond-mat%2F0512369%2Ccond-mat%2F0512066%2Ccond-mat%2F0512641%2Ccond-mat%2F0512197%2Ccond-mat%2F0512638%2Ccond-mat%2F0512072%2Ccond-mat%2F0512240%2Ccond-mat%2F0512254%2Ccond-mat%2F0512104%2Ccond-mat%2F0512591%2Ccond-mat%2F0512442%2Ccond-mat%2F0512179%2Ccond-mat%2F0512302%2Ccond-mat%2F0512607%2Ccond-mat%2F0512205%2Ccond-mat%2F0512493%2Ccond-mat%2F0512481%2Ccond-mat%2F0512190%2Ccond-mat%2F0512721%2Ccond-mat%2F0512073%2Ccond-mat%2F0512531%2Ccond-mat%2F0512367%2Ccond-mat%2F0512403%2Ccond-mat%2F0512019%2Ccond-mat%2F0512459%2Ccond-mat%2F0512348%2Ccond-mat%2F0512715%2Ccond-mat%2F0512316%2Ccond-mat%2F0512469%2Ccond-mat%2F0512086%2Ccond-mat%2F0512036%2Ccond-mat%2F0512241%2Ccond-mat%2F0512304%2Ccond-mat%2F0512571%2Ccond-mat%2F0512172%2Ccond-mat%2F0512270%2Ccond-mat%2F0512292%2Ccond-mat%2F0512281%2Ccond-mat%2F0512193%2Ccond-mat%2F0512526%2Ccond-mat%2F0512540%2Ccond-mat%2F0512131%2Ccond-mat%2F0512157%2Ccond-mat%2F0512696%2Ccond-mat%2F0512670%2Ccond-mat%2F0512136%2Ccond-mat%2F0512398%2Ccond-mat%2F0512704%2Ccond-mat%2F0512039%2Ccond-mat%2F0512112%2Ccond-mat%2F0512479%2Ccond-mat%2F0512303%2Ccond-mat%2F0512708%2Ccond-mat%2F0512453%2Ccond-mat%2F0512289%2Ccond-mat%2F0512043%2Ccond-mat%2F0512279&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integer Lattice Gases at Equilibrium"}, "summary": "Integer lattice gas automata can be utilized as building blocks in\nstatistical mechanics. The presented deterministic and reversible automaton\ngenerates semiclassical statistical distributions. A possible approach to\nBose-Einstein statistics from cellular automata position is discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0512566%2Ccond-mat%2F0512553%2Ccond-mat%2F0512650%2Ccond-mat%2F0512080%2Ccond-mat%2F0512033%2Ccond-mat%2F0512471%2Ccond-mat%2F0512490%2Ccond-mat%2F0512293%2Ccond-mat%2F0512561%2Ccond-mat%2F0512305%2Ccond-mat%2F0512694%2Ccond-mat%2F0512648%2Ccond-mat%2F0512413%2Ccond-mat%2F0512140%2Ccond-mat%2F0512194%2Ccond-mat%2F0512005%2Ccond-mat%2F0512009%2Ccond-mat%2F0512433%2Ccond-mat%2F0512245%2Ccond-mat%2F0512527%2Ccond-mat%2F0512606%2Ccond-mat%2F0512619%2Ccond-mat%2F0512134%2Ccond-mat%2F0512385%2Ccond-mat%2F0512211%2Ccond-mat%2F0512623%2Ccond-mat%2F0512557%2Ccond-mat%2F0512420%2Ccond-mat%2F0512336%2Ccond-mat%2F0512387%2Ccond-mat%2F0512503%2Ccond-mat%2F0512264%2Ccond-mat%2F0512313%2Ccond-mat%2F0512472%2Ccond-mat%2F0512204%2Ccond-mat%2F0512249%2Ccond-mat%2F0512118%2Ccond-mat%2F0512315%2Ccond-mat%2F0512318%2Ccond-mat%2F0512668%2Ccond-mat%2F0512375%2Ccond-mat%2F0512388%2Ccond-mat%2F0512265%2Ccond-mat%2F0512105%2Ccond-mat%2F0512369%2Ccond-mat%2F0512066%2Ccond-mat%2F0512641%2Ccond-mat%2F0512197%2Ccond-mat%2F0512638%2Ccond-mat%2F0512072%2Ccond-mat%2F0512240%2Ccond-mat%2F0512254%2Ccond-mat%2F0512104%2Ccond-mat%2F0512591%2Ccond-mat%2F0512442%2Ccond-mat%2F0512179%2Ccond-mat%2F0512302%2Ccond-mat%2F0512607%2Ccond-mat%2F0512205%2Ccond-mat%2F0512493%2Ccond-mat%2F0512481%2Ccond-mat%2F0512190%2Ccond-mat%2F0512721%2Ccond-mat%2F0512073%2Ccond-mat%2F0512531%2Ccond-mat%2F0512367%2Ccond-mat%2F0512403%2Ccond-mat%2F0512019%2Ccond-mat%2F0512459%2Ccond-mat%2F0512348%2Ccond-mat%2F0512715%2Ccond-mat%2F0512316%2Ccond-mat%2F0512469%2Ccond-mat%2F0512086%2Ccond-mat%2F0512036%2Ccond-mat%2F0512241%2Ccond-mat%2F0512304%2Ccond-mat%2F0512571%2Ccond-mat%2F0512172%2Ccond-mat%2F0512270%2Ccond-mat%2F0512292%2Ccond-mat%2F0512281%2Ccond-mat%2F0512193%2Ccond-mat%2F0512526%2Ccond-mat%2F0512540%2Ccond-mat%2F0512131%2Ccond-mat%2F0512157%2Ccond-mat%2F0512696%2Ccond-mat%2F0512670%2Ccond-mat%2F0512136%2Ccond-mat%2F0512398%2Ccond-mat%2F0512704%2Ccond-mat%2F0512039%2Ccond-mat%2F0512112%2Ccond-mat%2F0512479%2Ccond-mat%2F0512303%2Ccond-mat%2F0512708%2Ccond-mat%2F0512453%2Ccond-mat%2F0512289%2Ccond-mat%2F0512043%2Ccond-mat%2F0512279&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integer lattice gas automata can be utilized as building blocks in\nstatistical mechanics. The presented deterministic and reversible automaton\ngenerates semiclassical statistical distributions. A possible approach to\nBose-Einstein statistics from cellular automata position is discussed."}, "authors": ["Alex Khaneles"], "author_detail": {"name": "Alex Khaneles"}, "author": "Alex Khaneles", "arxiv_comment": "15 pages, 2 figures, submitted to the International Journal of\n  Applied Mathematics & Statistics, updated prospective development", "links": [{"href": "http://arxiv.org/abs/cond-mat/0512292v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0512292v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CG", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0512292v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0512292v3", "journal_reference": "International Journal of Applied Mathematics & Statistics\n  (IJAMAS), March 2006, Vol. 4, No. M06, 44-57", "doi": null, "fulltext": "Integer Lattice Gases at Equilibrium\nAlex Khaneles\nVinshtok Software Development, LLC\n19 Kingsland Circle, Monmouth Junction NJ 08852, USA\ne-mail: akhaneles@yahoo.com\n\nABSTRACT\nInteger lattice gas automata can be utilized as building blocks\nin statistical mechanics. The presented deterministic and\nreversible automaton generates semiclassical statistical\ndistributions. A possible approach to Bose-Einstein statistics\nfrom cellular automata position is discussed.\nKeywords: cellular automata, statistical physics, quantum statistics\nAMS Subject Classification: 82B20, 82B30, 82-04, 82B05, 82B10\n\n1.\n\nINTRODUCTION\n\nA computer technique of Cellular Automata (CA) was invented by\nStanislaw Ulam and John von Neumann in the late 1940's. This method\nis capable of simulating a system consisting of multiple identical\nelements and has found a variety of scientific applications including\nmodeling in physics. One class of cellular models – lattice gases – was\nespecially successful in the areas of hydrodynamics and turbulence.\nThese models use point particles moving on a discrete grid and imitate\nmolecular dynamics.\nIn such modeling, a cellular grid is often considered to be a simplified\ndiscrete substitution to the space continuum with finite spatial resolution.\nThe local, deterministic and reversible character of some CA rules\nappears appropriate to express microscopic dynamics. At the same time,\n\n\fthe discrete grid has certain limitations as a model of space. Although\nthe lack of isotropy was overcome in hydrodynamics applications by a\ntriangular lattice in the FHP model [6], deficiency of rotational symmetry\nis still apparent at the fundamental level [8]. On the other hand, clear-cut\nlocality is not suitable in quantum physics (with Bell's inequality).\nAnother area of feasible CA applications is statistical mechanics, which\noperates with an ensemble of states rather than with space and where\nquestions in interpretation of space are secondary. CA can simulate such\nan ensemble as a set of cells. An attractive feature of the method is the\nability to keep track of each and all of cellular elements during evolution.\nIt is possible to perform any measurements or observations without\ndisturbing the system. Although full knowledge of the system requires\nintense calculations, today's personal computer is capable of handling\nabout 106 cells and simple models in reasonable time. This\ncomputational power is adequate for analysis of thermodynamic behavior\nof some important model systems.\nIt is possible to express the ideas of microscopic dynamics as CA rule.\nSubsequently one can observe the manifestation of this microdynamics\nin a statistical embodiment as the evolution occurs. Thus, the technique\nsimplifies study of macroscopic behavior and may provide new insights,\nfor example, to questions like: how can irreversible macroscopic\nbehavior arise from time symmetric microscopic dynamics?\nOne of the advanced lattice gas methods is an integer lattice gas that\ngeneralizes this kind of automata to include arbitrary numbers of\nparticles moving in each lattice direction. It was introduced first on a\ntriangular grid for hydrodynamic modeling as an expansion of FHP gas\n[1]. Integer cell characteristics enrich behavior of cellular system and\nallow generating additional statistical distributions.\nIn this paper we utilize an integer lattice gas of massless particles\nimplemented on a rectangular lattice. The statistical behavior of the\nautomaton shows a similarity to Planck's harmonic oscillators and\nreproduces certain aspects of semi-classical statistics at equilibrium.\nDepending on the CA rule, the resulting statistical distributions can be\n\n\fshaped differently. We will discuss the possibility of obtaining BoseEinstein statistics from a deterministic CA position.\n\n2.\n\nINTEGER HPP GAS\n\nHPP gas (named after its inventors) [7] is a discrete abstraction of an\nideal gas for CA modeling where one bit particles are moving along four\npossible directions on the two-dimensional rectangular lattice. Its\nbehavior was investigated in detail, and illustrations of sound wave\npropagation, some optical phenomena and more [13, 4] are available.\nPresented here, the automaton is an extension of HPP gas which\naccommodates any number of particles in each cell moving in each\nlattice direction. We will call this automaton Integer HPP gas (IHPP).\n(Notions that are specific to the context of this paper are printed in italics\nwhen used for the first time.)\nThe Lattice\nWe utilize a two-dimensional rectangular CA grid where each cell has\nfour neighbors (the von Neumann neighborhood). The lattice has finite\nsize, and the boundaries are connected to opposite sides (torus-like\ntopology).\nThe Cell State\nThe cell state consists of four integer characteristics:\n−\n\n+\n\nEx ; − E x ; + E y ;\n\nE y . Each integer contains the number of particles moving in one of four\n+\n\n−\n\n+\n\npossible directions on the grid ( x , x , y , and\n\n−\n\ny ).\n\nThe Rule\nThe particles are moving along axes without changing direction until they\nmeet others moving in the opposite direction (a head-on collision or\nscattering) that results in changing their direction on the perpendicular.\n\n\fThe rule forms the next state of neighboring cells from the current state\nof a single cell and should be performed for each cell in the grid in each\nevolution step:\n1. Calculate the numbers of collided/scattered particles along x and y\nas:\n+\n\n−\n\n+\n\n−\n\n(the numbers of x particles scattered into y ) = min( E x ; E x )\nand\n(the numbers of y particles scattered into x ) = min( E y ; E y ) ;\n2. All particles are moving from the current cell to the neighboring cells.\nThe scattered particles travel in new directions. The remaining\nparticles travel in unchanged directions.\nThe rule articulates the ideas of continuation of motion without\ninteractions and detailed balancing in interactions. It is simpler than the\nHPP rule in that there is no necessity to exclude scattering into the cell\ncharacteristics which are already occupied.\n\n3.\n\nIHPP GAS FEATURES\n\nSince the interest of this paper is IHPP gas in a state of equilibrium, we\nmention here some related features that are inherited from HPP gas.\nIHPP gas conserves energy - the total number of particles in the system:\n(energy) =\n\n∑( E\n+\n\nx\n\n+ −E x + +E y + −E y ) = const ,\n\nN\n\nwhere N is a number of cells in the system.\nIt conserves momentum components – the differences of the total\nnumbers of particles moving in opposite directions:\n\n\f(momentum along x ) =\n\n∑( E\n+\n\nx\n\n− −E x ) = const ;\n\nN\n\n(momentum along y ) =\n\n∑( E\n+\n\ny\n\n− −E y ) = const .\n\nN\n\nGrowing disorder in the cellular system (from certain initial states) to a\nstate of equilibrium illustrates the Second Law of Thermodynamics. No\ninformation is lost during evolutions, and at any moment we can reverse\nthe direction of time and bring the system back step by step to its initial\nstate. It demonstrates how seemingly irreversible behavior in kinetic\ntheory could arise from fully reversible underlying dynamics ('reversibility\nparadox' of Josef Loschmidt, 1876) and Boltzmann's understanding of\nthe statistical nature of the Second Law. Illustrations of this kind with\nHPP gas have been presented in literature previously [13, 4, 14]1.\nUsing numbers instead of bits as characteristics of the cell state in our\nIHPP gas leads to an extra dimension in the behavior of the system.\nEach integer characteristic in the cell state can be regarded as an\noccupation number ( n ). To analyze this extra dimension we have an\nadditional instrument - statistical distributions.\nInitialization\nThe attributes of cells can be initialized uniformly with the same numbers\nor with different numbers. If the symmetry is broken at initialization then\nsuch a system will keep disorder growing during evolutions and will come\nto the state of stable equilibrium. The more irregularities that are created\nat initialization, the faster disorder will grow. In our simulation ~ 3 ⋅ 10\n\n5\n\nevolutions are considered as sufficient relaxation time for the grid of\n\nN ~ 2 ⋅ 10 6 cells.\nSome specifics of initialization should be mentioned here. The smallest\nnumber used in initialization will stay as a minimum occupation number\nover all evolutions. It will be named zero point energy. It is possible to set\n\n\fa step in occupation numbers as well. If we use only numbers (2; 5; 8;\n11) with particular interval between them (in this sample - 3) to initialize\nthe cell states, the spectrum will maintain the same step size (2; 5; 8; 11;\n14; 17; ...) throughout the evolutions.\nTo summarize, the initialization sets three parameters which will affect\nthe statistical picture at equilibrium:\n1. Zero point energy: z - any (including negative) integer number;\n2. The mean occupation number: n ( n > z );\n3. The step in occupation numbers: s - any positive integer number.\nThese parameters will be accommodated to analyze the results of\nsimulation as well.\nOccupation Number Distribution\nFigure 1 shows the occupation number distributions for three simulation\nseries. The exponential shape of these distributions corresponds to\nstandard expectations of statistical mechanics. We compare the\nsimulation results with the empirical function:\n\n(n − z ) n− z\n1 \n1 \n= N ⋅a⋅s⋅\nf ( n) = N ⋅ a ⋅ s ⋅\n1 +\n\nn − z +1\nn − z +1  n − z \n(n − z +1)\n\n− ( n− z )\n\n(1)\n\nwhere a is the number of attributes in each cell ( a = 4 for the twodimensional system).\nIf we limit simulation conditions to z = 0 and s = 1, the number of\nparameters in the generic formula (1) will be reduced and the formula\nitself will come to what is familiar for Planck's oscillators (a photon\nnumber distribution for a single mode of thermal radiation):\n\n\f−n\n\n1  1\nf ( n)\nnn\n=\n=\n1 +  .\nn +1\nN ⋅ a (n +1)\nn +1  n \n\n(2)\n\nFor these exponential distributions (2) it would be natural to introduce\nsuch notions as quanta of energy ( ε 0 ) and temperature ( T ) and to use\nPlanck's distribution function to describe our IHPP gas:\n\n1+\n\n1\n= eε 0\nn\n\nk BT\n\n,\n\n(3)\n\nwhere k B has the same meaning as Boltzmann constant, or\n\nn=\n\n1\ne\n\nε 0 k BT\n\n−1\n\n.\n\n(4)\n\nThe logic of our model is purely discrete, and real numbers are used only\nto compare the results of simulation with commonly used mean values,\nformulas, etc.\nIHPP gas illustrates Planck's harmonic oscillators (only a single mode of\nthermal radiation). Planck introduced discontinuity of energy to explain\nblackbody radiation. Therefore IHPP gas can illustrate other ideas\nhistorically related to the explanation of thermal radiation and to obtain\nWien's distribution (see Appendix A and Figure 2).\nIt has been known that Boltzmann statistics would bring us to Wien's\nformula and not to Planck's radiation law [2]. The next question was\n'what changes must be made in the classical statistics in order that it\nmay become possible to deduce Planck's radiation law by purely\nstatistical reasoning, without making use of the roundabout road by way\nof an absorbing and emitting oscillator' [2]. Satyendranath Bose\nanswered this question with the invention of quantum statistics in 1924\n[3].\n\n\fWhat would it mean in terms of CA to get Planck's radiation law without\n'the roundabout road'? In our picture, the roots of statistics are in the CA\nrule and to change statistics means to change the rule. Could BoseEinstein statistics be reproduced this way?\n\n4.\n\nDETERMINISTIC CA OUTLOOK ON BOSE-EINSTEIN\nSTATISTICS\n'Bose's arguments divert Planck's law of all\nsupererogatory elements of electromagnetic theory\nand base its derivation on the bare essentials. ... I\nbelieve there had been no such successful shot in the\ndark since Planck introduced the quantum in 1900.'\nA. Pais [11]\n\nTo come to the blackbody energy spectrum, Bose presumed that\nPlanck's quanta form a single mode of thermal radiation and introduced\nmultiple modes and a recipe to count the densities of different modes.\nWe have seen how statistical behavior of Planck's quanta can arise from\ndeterministic microscopic dynamics of IHPP gas. Could we capitalize on\nthe same basis (as Bose did) to obtain quantum statistics and blackbody\nradiation distribution from CA rule?\nThe multiple modes (species) of quanta in Bose reasoning are\ncharacterized by their energy ε s ( s = 0 to s = ∞ ). Our set of cells would\nrepresent only the single mode in an infinite number of modes. Although\nto make the transition from Planck distribution (4) to Bose-Einstein\ndistribution:\n\nns =\n\n1\ne\n\nε s k BT\n\n−1\n\n,\n\n(5)\n\n\fonly the index s has to be added.\nWhile incorporating these ideas in a formula is straightforward, their\napplication in CA logic is not apparent. Does this index mean that we\nshould multiply entities of cell states and put them into an infinite number\nof layers (modes)? It would be a vast increase in the amount of\ninformation. It is not clear how to manage this information and\nredistribute energy between modes. Simply adding another dimension to\nthe cellular system is not appropriate – the number of cells (density of\nstates) in each mode should be a function of the energy\n\nεs .\n\nShould we try to fulfill such significant changes in the entire structure or\nare there other more attractive directions for further development? The\nindistinguishable states and multiple modes of radiation not only break\nthe rules of Boltzmann statistics (what Bose did not suspect in 1924\n[11]), they also do not fit well into the concept of deterministic CA. As\nlong as it was fairly easy to arrive at Planck's oscillators with IHPP gas\nand to obtain the shape of the Wien's law (Appendix A), it should not be\nso complicated to approach the seemingly not much different Planck's\nradiation law. An effort to find an alternative approach with CA would be\nsupported at least by Occam's razor: entities should not be multiplied\nunnecessarily. With lattice gas technique we can increase complexity of\nthe rule and the amount of information gradually.\nAs demonstrated, IHPP gas described here generates classical\nstatistical behavior and replicates Planck's oscillators but has not much\nto do with quantum statistics. Nonclassical features could be introduced\nby including a new content into the integer lattice gas rule and as a result\naltering the statistical distributions2. Perhaps we just have to deploy\nadditional vital physical principles in CA to exhibit the behavior that is\nassociated with photons and Bose-Einstein statistics.\nIn the evolution of the explanation of blackbody radiation, attention has\nbeen gradually deflected from its electromagnetic nature (to 'the bare\nessentials'). With CA we can try to move in the opposite direction – not to\n\n\fdivert 'supererogatory elements' but to take them in as essentials and\nprepare the rule of microscopic dynamics from the elements of Maxwell's\nelectrodynamics to study statistical consequences.\n\n5.\n\nPROSPECTIVE DEVELOPMENT\n\nThe first step in this new trend would be to employ two integer cell state\nattributes in each lattice direction (instead of one in IHPP gas). These\nattributes could be interpreted as components of energy or electrical and\nmagnetic fields. Using two integer attributes in each direction would\nprovide a sufficient amount of information to introduce elements of light\npolarization or two possible photon spin orientations. In order to develop\nnew ideas in the CA rule, however, it is important to utilize different grids\nsuch as triangular or 3-dimensional. More than two axes in the grid\nwould allow for different scattering directions ( x → y → z → K ,\n\nx → z → y → K ). Allowing a conversion of energy between two\n\ncomponents with different scattering directions can bring new features\ninto the basic statistical picture. This kind of CA could become a useful\ninstrument in furthering our understanding of quantum statistics and its\nconnection to spin. The nature of this connection has been considered to\nbe quite complicated [12, 10, 5].\n\n6.\n\nCONCLUSION\n\nThe integer lattice gas described here generates semiclassical statistical\ndistributions from deterministic and reversible CA rule based on the\nideas of continuation of motion without interactions and detailed\nbalancing in interactions. The lattice gases of this kind do allow building\ndifferent statistics and might be helpful in understanding the origins of\nquantum statistics. To produce new statistics, the CA rule can be\nexpanded or changed to accommodate other (not mechanical) physical\nconcepts. Future prospects of this work are to consider two cell\n\n\fcharacteristics in each direction and investigate possible relationship\nbetween them. Such CA rules could resemble ideas of Maxwell\nelectrodynamics with electric and magnetic field components.\n\nAcknowledgements\nThe author would like to thank Valeri Golovlev for comprehensive\ndiscussions and valuable suggestions and Catherine Smith for critical\ncomments.\n\nEndnotes\n1\n\nIHPP rule is not the best to demonstrate reversibility. A rule of this kind\ncan be time-symmetrical i.e. remain exactly the same for both time\ndirections. IHPP gas was chosen here because its predecessor (HPP)\nhas been well-investigated and some attractive physical interpretations\nhave been provided already.\n2\n\nThe changes in the distributions can be shown even without any\nsignificant novelties in the CA rule. For example, two or three identical\nIHPP cellular systems can be thought of as one with doubled or tripled\nnumber of cell characteristics in each direction and the same rule for\neach subset. Then the occupation number or energy in one direction\nwould be a sum of two or three components and corresponding\ndistributions obviously would be very different from original distribution\nfor one-component variable (see Figure 2 as a sample for threecomponent variables).\n\nREFERENCES\n[1]\n\nBoghosian, B.M., Yepez, J., Alexander, F.J., and Margolus, N.H.,\n1997, Integer Lattice Gases, Phys. Rev. E 55, 4137-4147; compgas/9602001.\n\n\f[2]\n\nBorn, M., 1946, Atomic Physics, translation from German by\nJohn Dougall, BLACKIE & SON LIMITED (fourth edition).\n\n[3]\n\nBose, S.N., 1924, Z. Phys. 26, 178; English translation: Theimer,\nO. and Ram, B., 1976, The beginning of quantum statistics, Am.\nJ. Phys. 44(11), 1056.\n\n[4]\n\nChopard, B. and Droz, M., 1998, Cellular automata modeling of\nphysical systems, Cambrige University Press.\n\n[5]\n\nDuck, I., Sudarshan, E. C. G., 1998, Toward an understanding of\nthe spin-statistics theorem, American Journal of Physics, 66(4),\n284-303.\n\n[6]\n\nFrisch, U., Hasslacher, B., and Pomeau, Y., 1986, Lattice-gas\nautomata for the navier-stokes equitation, Phys. Rev. Lett. 56,\n1505.\n\n[7]\n\nHardy, J., Pomeau, Y., and de Pazzis, O., 1973, Time evolution\nof a two-dimensional model system. I. Invariant states and time\ncorrelation functions, J. Math Phys. 14, 1746; 1976, Molecular\ndynamics of a classical lattice gas: Transport properties and time\ncorrelation functions, Phys. Rev., A 13, 1949.\n\n[8]\n\n't Hooft, G., 2003, Can Quantum mechanics be reconciled with\nCellular Automata?, International Journal of Theoretical Physics,\n42, 2, 349-354.\n\n[9]\n\nKuhn, T. S., 1987, Black-Body Theory and the Quantum\nDiscontinuity, 1894-1912, University of Chicago Press, Chicago\n& London.\n\n[10]\n\nNeuenschwander, D. E., 1994, Has anyone made any progress\ntoward an 'elementary' argument for the spin-statistics theorem?,\nAmerican Journal of Physics, 62(11), 972.\n\n[11]\n\nPais, A., 1982, Subtle is the Lord..., Oxford University Press.\n\n[12]\n\nPauli, W., 1940, The Connection Between Spin and Statistics,\nPhys. Rev. 58, 716-722.\n\n[13]\n\nToffoli, T. and Margolus, N., 1987, Cellular Automata Machines-A New Environment for Modeling, MIT Press.\n\n[14]\n\nWolfram, S., 2002, A New Kind of Science, Wolfram Media.\n\n\fAPPENDIX A: THREE-DIMENSIONAL IHPP GAS AND WIEN'S\nDISTRIBUTION\nLord Rayleigh interpreted blackbody radiation as rest waves in a threedimensional cavity (the detailed history of this development at the\nbeginning of 20th century can be found in [9]). The permissible modes of\nelectromagnetic field vibrations were governed by three integers\n\nk1 , k 2 , k 3 :\n\nλ = 2L\n\nk12 + k 22 + k 32 , where λ is a wavelength, L – the side of a\n\ncubical cavity.\nThe integer numbers – k1 , k 2 , k 3 – can be thought of as discrete\nmomentum (or electric field) components. This approach led to \"ultraviolet catastrophe\".\nIHPP gas replicates Planck's oscillators and is able to illustrate a mixture\nof Planck's and Rayleigh's ideas. We could construct triplets like\n( k1 , k 2 , k 3 ) from cell state components, if our cellular system were\nthree-dimensional. Expansion into three dimensions can be done quite\neasily. The 3d cell state will contain six (instead of four) integer\ncharacteristics:\n\n+\n\nE x ; − E x ; + E y ; − E y , + E z , and − E z , corresponding to\n\nsix possible directions on the 3d grid.\nThe 3d IHPP rule will not be much different from the 2d one either. In the\n2d rule, the scattering was going from x direction into y and back from\n\ny into x . In the 3d, it could be arranged from x into y ; from y into z ;\nand from z into x . This rule will exhibit the same kind of statistical\nbehavior that we have seen already for 2d lattice gas. The occupation\nnumber distribution (Figure 1) for the 3d cellular system will look exactly\nthe same.\n\n\fWe can imagine that the components of one cell can act together and\ndefine composite variables to picture this idea:\n+\n\nn = +E x + +E y + +E z ;\n\n+\n\nnm =\n\n+\n\nE x2 + + E y2 + + E z2 ;\n\n−\n\nn = −E x + −E y + −E z ;\n\n−\n\nnm =\n\n−\n\n(A.1)\n\nE x2 + −E y2 + −E z2 .\n\n(A.2)\n\nIt does not matter how to divide the cell components into groups of three,\nas long as the IHPP rule does not generate correlations between them.\n±\n\n+\n\n−\n\nFigure 2 presents distribution of triplets by n ( n and n ) and another\none of the same kind by\n\n±\n\nnm ( + nm and − nm ). The distributions can be\n\ndescribed by function:\n\nN ⋅s\n\n1 \n\nf ( n) =\n( n − 3 z ) 1 +\n\n3\n(n − z )\n n−z \n\n− ( n −3 z )\n\n2\n\n(A.3)\n\nThe function parameters ( n , z , s ) for the first distribution (by\n\n±\n\nn ) are\n±\n\nthe same as those used for simulation. The second distribution (by nm )\nhas similar shape but the value of n is much less.\nIf we accept z = 0, s = 1 and apply Planck distribution (3), this function\nwould come to:\n\n1\n\nf ( n ) = 3 n 1 + \n n\nn\nN\n\n2\n\n−n\n\n=\n\nN\nn\n\n3\n\nn 2 e − nε 0\n\nk BT\n\n(A.4)\n\nThus, the straightforward combination of elements of Planck's and\nRayleigh's ideas bring us to the shape of Wien's distribution (A.4). To get\nenergy distribution it should be multiplied by nε 0 . We do not pay\n\n\f2 − nε 0 k B T\n\nattention here to the geometrical factor before n e\n\nin the formula\n\nsince distance, speed of light, and volume is not defined in our model.\nBoth composite variables (A.1) and (A.2) are somewhat artificial, as far\nas the CA rule does not lead to correlations between cell state\ncomponents. Even less justification could be found for (A.2), which\nincorporates the concepts of continuous metric space and looks quite\ninappropriate for the discrete lattice. In spite of almost the same shape of\nthe distributions (Figure 2), the variables (A.2) lead to confusion in\ninterpretation of temperature that was a measure of the mean occupation\nnumber or mean energy for Planck's oscillators (4) and Wien's\ndistribution (A.4).\nWilhelm Wien introduced his formula in 1896. It is quite close to Planck's\nradiation law and was one of the best candidates to describe\nexperimental blackbody radiation spectrum. Friedrich Paschen in 1897\ncame to this conclusion about Wien's formula: 'It would seem very\ndifficult to find another function that represents data with as few\nconstants.' (quoted from [11]).\n\n\f1E8\nSimulation results:\nn = 0.1; z = 0; s = 1\n\nNumber of states, f(n)\n\n1E7\n\nn = 1.1; z = 1; s = 1\nn = 0.01; z = 0; s = 1\n\nLines are function graphs:\n\n1000000\n\nf (n) = N ⋅ a ⋅ s ⋅\n\n(n − z ) n − z\nn − z +1\n( n − z +1)\n\n100000\n10000\n1000\n100\n10\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nOccupation number, n\nFIGURE 1: Occupation Number Distribution of IHPP Gas Cell\nAttributes.\nIHPP gas exhibits an exponential occupation number distribution\nwith inclination – ( n − z ). It is shifted by z along axis n.\n\n6\n\n\f6000\n\n5000\n\nNumber of triplets, f(n)\n\nn = 300; z = 1; s = 1\n\nSimulation parameters:\nDistribution variables:\n−\n\nn = −E x + −E y + −E z and\n\n+\n\nnm =\n\n+\n\n−\n\nn = −E x + −E y + −E z\n\nE x2 + + E y2 + + E z2 and − n m =\n\n−\n\nE x2 + − E y2 + − E z2\n\n4000\nFunction graphs:\n\nf (n) =\n\n3000\n\nN⋅s\n\n(n − 3z)2\n\n⋅\n3\n( n−3z )\n(n − z) [1+1 (n − z)]\n\nn = 300; z = 1; s = 1\n2000\n\nn = 210; z = 1; s = 1\n\n1000\n\n0\n0\n\n500\n\n1000\n\n1500\n\n2000\n\nn\n\nFIGURE 2\n\nDistribution variables are constructed as triplets from all six\ncharacteristics of each cell.\n\n2500\n\n3000\n\n\f"}