{"id": "http://arxiv.org/abs/cond-mat/0502263v1", "guidislink": true, "updated": "2005-02-10T14:58:00Z", "updated_parsed": [2005, 2, 10, 14, 58, 0, 3, 41, 0], "published": "2005-02-10T14:58:00Z", "published_parsed": [2005, 2, 10, 14, 58, 0, 3, 41, 0], "title": "Ultra fast bit addressing in a magnetic memory matrix with crossed wire\n  write line geometry", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0502531%2Ccond-mat%2F0502257%2Ccond-mat%2F0502666%2Ccond-mat%2F0502232%2Ccond-mat%2F0502492%2Ccond-mat%2F0502118%2Ccond-mat%2F0502424%2Ccond-mat%2F0502342%2Ccond-mat%2F0502664%2Ccond-mat%2F0502411%2Ccond-mat%2F0502508%2Ccond-mat%2F0502362%2Ccond-mat%2F0502659%2Ccond-mat%2F0502510%2Ccond-mat%2F0502422%2Ccond-mat%2F0502258%2Ccond-mat%2F0502522%2Ccond-mat%2F0502093%2Ccond-mat%2F0502506%2Ccond-mat%2F0502670%2Ccond-mat%2F0502113%2Ccond-mat%2F0502403%2Ccond-mat%2F0502075%2Ccond-mat%2F0502032%2Ccond-mat%2F0502521%2Ccond-mat%2F0502394%2Ccond-mat%2F0502430%2Ccond-mat%2F0502151%2Ccond-mat%2F0502005%2Ccond-mat%2F0502121%2Ccond-mat%2F0502209%2Ccond-mat%2F0502187%2Ccond-mat%2F0502053%2Ccond-mat%2F0502170%2Ccond-mat%2F0502360%2Ccond-mat%2F0502231%2Ccond-mat%2F0502404%2Ccond-mat%2F0502067%2Ccond-mat%2F0502625%2Ccond-mat%2F0502372%2Ccond-mat%2F0502266%2Ccond-mat%2F0502336%2Ccond-mat%2F0502453%2Ccond-mat%2F0502671%2Ccond-mat%2F0502066%2Ccond-mat%2F0502299%2Ccond-mat%2F0502488%2Ccond-mat%2F0502528%2Ccond-mat%2F0502467%2Ccond-mat%2F0502260%2Ccond-mat%2F0502370%2Ccond-mat%2F0502135%2Ccond-mat%2F0502174%2Ccond-mat%2F0502503%2Ccond-mat%2F0502457%2Ccond-mat%2F0502330%2Ccond-mat%2F0502216%2Ccond-mat%2F0502224%2Ccond-mat%2F0502311%2Ccond-mat%2F0502276%2Ccond-mat%2F0502516%2Ccond-mat%2F0502480%2Ccond-mat%2F0502617%2Ccond-mat%2F0502193%2Ccond-mat%2F0502263%2Ccond-mat%2F0604580%2Ccond-mat%2F0604047%2Ccond-mat%2F0604358%2Ccond-mat%2F0604676%2Ccond-mat%2F0604108%2Ccond-mat%2F0604267%2Ccond-mat%2F0604343%2Ccond-mat%2F0604177%2Ccond-mat%2F0604440%2Ccond-mat%2F0604018%2Ccond-mat%2F0604226%2Ccond-mat%2F0604533%2Ccond-mat%2F0604478%2Ccond-mat%2F0604265%2Ccond-mat%2F0604464%2Ccond-mat%2F0604604%2Ccond-mat%2F0604472%2Ccond-mat%2F0604230%2Ccond-mat%2F0604311%2Ccond-mat%2F0604571%2Ccond-mat%2F0604095%2Ccond-mat%2F0604390%2Ccond-mat%2F0604367%2Ccond-mat%2F0604304%2Ccond-mat%2F0604441%2Ccond-mat%2F0604465%2Ccond-mat%2F0604269%2Ccond-mat%2F0604063%2Ccond-mat%2F0604556%2Ccond-mat%2F0604646%2Ccond-mat%2F0604585%2Ccond-mat%2F0604515%2Ccond-mat%2F0604538%2Ccond-mat%2F0604572%2Ccond-mat%2F0604021%2Ccond-mat%2F0604449&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Ultra fast bit addressing in a magnetic memory matrix with crossed wire\n  write line geometry"}, "summary": "An ultra fast bit addressing scheme for magnetic random access memories\n(MRAM) in a crossed wire geometry is proposed. In the addressing scheme a word\nof cells is programmed simultaneously by sub nanosecond field pulses making use\nof the magnetization precession of the free layer. Single spin simulations of\nthe free layer dynamics show that the pulse parameters for programming an\narbitrary word of the array can be chosen such that the magnetization of the\ncells to be written performs either a half or a full precessional turn during\napplication of the programming pulse depending on the initial and final\nmagnetization orientation of the addressed cells. Such bit addressing scheme\nleads to a suppression of the magnetization ringing in all cells of the memory\narray thereby allowing ultra high MRAM write clock rates above 1 GHz.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0502531%2Ccond-mat%2F0502257%2Ccond-mat%2F0502666%2Ccond-mat%2F0502232%2Ccond-mat%2F0502492%2Ccond-mat%2F0502118%2Ccond-mat%2F0502424%2Ccond-mat%2F0502342%2Ccond-mat%2F0502664%2Ccond-mat%2F0502411%2Ccond-mat%2F0502508%2Ccond-mat%2F0502362%2Ccond-mat%2F0502659%2Ccond-mat%2F0502510%2Ccond-mat%2F0502422%2Ccond-mat%2F0502258%2Ccond-mat%2F0502522%2Ccond-mat%2F0502093%2Ccond-mat%2F0502506%2Ccond-mat%2F0502670%2Ccond-mat%2F0502113%2Ccond-mat%2F0502403%2Ccond-mat%2F0502075%2Ccond-mat%2F0502032%2Ccond-mat%2F0502521%2Ccond-mat%2F0502394%2Ccond-mat%2F0502430%2Ccond-mat%2F0502151%2Ccond-mat%2F0502005%2Ccond-mat%2F0502121%2Ccond-mat%2F0502209%2Ccond-mat%2F0502187%2Ccond-mat%2F0502053%2Ccond-mat%2F0502170%2Ccond-mat%2F0502360%2Ccond-mat%2F0502231%2Ccond-mat%2F0502404%2Ccond-mat%2F0502067%2Ccond-mat%2F0502625%2Ccond-mat%2F0502372%2Ccond-mat%2F0502266%2Ccond-mat%2F0502336%2Ccond-mat%2F0502453%2Ccond-mat%2F0502671%2Ccond-mat%2F0502066%2Ccond-mat%2F0502299%2Ccond-mat%2F0502488%2Ccond-mat%2F0502528%2Ccond-mat%2F0502467%2Ccond-mat%2F0502260%2Ccond-mat%2F0502370%2Ccond-mat%2F0502135%2Ccond-mat%2F0502174%2Ccond-mat%2F0502503%2Ccond-mat%2F0502457%2Ccond-mat%2F0502330%2Ccond-mat%2F0502216%2Ccond-mat%2F0502224%2Ccond-mat%2F0502311%2Ccond-mat%2F0502276%2Ccond-mat%2F0502516%2Ccond-mat%2F0502480%2Ccond-mat%2F0502617%2Ccond-mat%2F0502193%2Ccond-mat%2F0502263%2Ccond-mat%2F0604580%2Ccond-mat%2F0604047%2Ccond-mat%2F0604358%2Ccond-mat%2F0604676%2Ccond-mat%2F0604108%2Ccond-mat%2F0604267%2Ccond-mat%2F0604343%2Ccond-mat%2F0604177%2Ccond-mat%2F0604440%2Ccond-mat%2F0604018%2Ccond-mat%2F0604226%2Ccond-mat%2F0604533%2Ccond-mat%2F0604478%2Ccond-mat%2F0604265%2Ccond-mat%2F0604464%2Ccond-mat%2F0604604%2Ccond-mat%2F0604472%2Ccond-mat%2F0604230%2Ccond-mat%2F0604311%2Ccond-mat%2F0604571%2Ccond-mat%2F0604095%2Ccond-mat%2F0604390%2Ccond-mat%2F0604367%2Ccond-mat%2F0604304%2Ccond-mat%2F0604441%2Ccond-mat%2F0604465%2Ccond-mat%2F0604269%2Ccond-mat%2F0604063%2Ccond-mat%2F0604556%2Ccond-mat%2F0604646%2Ccond-mat%2F0604585%2Ccond-mat%2F0604515%2Ccond-mat%2F0604538%2Ccond-mat%2F0604572%2Ccond-mat%2F0604021%2Ccond-mat%2F0604449&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An ultra fast bit addressing scheme for magnetic random access memories\n(MRAM) in a crossed wire geometry is proposed. In the addressing scheme a word\nof cells is programmed simultaneously by sub nanosecond field pulses making use\nof the magnetization precession of the free layer. Single spin simulations of\nthe free layer dynamics show that the pulse parameters for programming an\narbitrary word of the array can be chosen such that the magnetization of the\ncells to be written performs either a half or a full precessional turn during\napplication of the programming pulse depending on the initial and final\nmagnetization orientation of the addressed cells. Such bit addressing scheme\nleads to a suppression of the magnetization ringing in all cells of the memory\narray thereby allowing ultra high MRAM write clock rates above 1 GHz."}, "authors": ["H. W. Schumacher"], "author_detail": {"name": "H. W. Schumacher"}, "author": "H. W. Schumacher", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.1999030", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0502263v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0502263v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "30 pages, 6 figures, submitted to Journal of Applied Physics", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0502263v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0502263v1", "journal_reference": "JOURNAL OF APPLIED PHYSICS 98, 033910 (2005)", "doi": "10.1063/1.1999030", "fulltext": "Ultra fast bit addressing in a magnetic memory matrix with\ncrossed wire write line geometry\n\nH.W. Schumacher\n\nPhysikalisch-Technische Bundesanstalt, Bundesallee 100, D-38116 Braunschweig, Germany.\n\nE-mail:\n\nhans.w.schumacher@ptb.de,\n\nphone:\n\n+49 (0)531 592 2414,\n\nfax:\n\n+49 (0)531 592 2205\n\nAbstract\nAn ultra fast bit addressing scheme for magnetic random access memories (MRAM) in a\ncrossed wire geometry is proposed. In the addressing scheme a word of cells is programmed simultaneously by sub nanosecond field pulses making use of the magnetization precession of the free layer. Single spin simulations of the free layer dynamics show\nthat the pulse parameters for programming an arbitrary word of the array can be chosen\nsuch that the magnetization of the cells to be written performs either a half or a full\nprecessional turn during application of the programming pulse depending on the initial\nand final magnetization orientation of the addressed cells. Such bit addressing scheme\nleads to a suppression of the magnetization ringing in all cells of the memory array\nthereby allowing ultra high MRAM write clock rates above 1 GHz.\n\n1\n\n\fI. INTRODUCTION\nMagnetic random access memories (MRAM) (1,2) are now sometimes also referred to as \"universal memories\" (3) as they combine features which were previously\nthought as being incompatible like non-volatility, low power consumption, unlimited\nwrite endurance and high speed of operation. Concerning the speed of a write operation\nof an MRAM one limiting aspect is the minimum duration of the magnetic field pulse\nresulting in reliable magnetization reversal of the magnetic memory cell. A further aspect\nis related to the damping of magnetic excitations after the decay of the magnetic field\npulse - the so called ringing of the magnetization. Such ringing can persist for several\nnanoseconds thereby limiting the MRAM write clock rate to values below a few hundred\nMHz. Optimum MRAM write clock rate could in principle be achieved by making use of\nthe so-called ballistic magnetization reversal (4,5). During ballistic magnetization reversal a well tailored transverse magnetic field pulse induces exactly a 180° precessional\nturn of the magnetization. As the field pulse is matched to the half of the magnetic precession period (i.e. to a 180° turn) the magnetization turns directly from the initial to the\nfinal reversed orientation without any remaining magnetization ringing after field pulse\ndecay (6,7,8,9). Unfortunately, the suppression of ringing after the decay of the switching\nfield pulse is only one side of the coin. In the most common MRAM architecture the selection of a certain magnetic memory cell for programming is done via two sets of metallization write lines running row and column wise and intersecting at each magnetic memory cell. Bit addressed switching is performed by applying so-called half select field\npulses to one row line and one column line at the same time. A half-select pulses is not\nsufficient to reverse the magnetization of a cell whereas the superposition of the two half2\n\n\fselect pulses at the intersection is. Experiments showed that also superposed pulses generated by a crossed wire geometry allow ultra fast quasi ballistic magnetization switching\n(10,11). But what about the other cells subjected to the half-select pulse only? Here, a\nstrong ringing can still occur which will limit the MRAM clock speed.\nIn previous work (12) a first solution to the problem of ringing of the half selected\ncells in an MRAM was proposed. The underlying concept was to find parameters for the\nhalf select pulse fulfilling the following two requirements: (i) the half select field pulse\nalone induces a full precessional turn of the magnetization (13) and (ii) the superposition\nof two half select field pulses at the addressed magnetic memory cell induces a half precessional turn of the magnetization. Upon pulse decay in case (i) the magnetization is oriented again along its initial orientation and in case (ii) the magnetization is oriented along\nthe reversed orientation. In both cases the magnetization ringing is suppressed as the\nmagnetization is already in or at least very near equilibrium when the half and full select\npulses decay. It was shown that parameters for such ringing free bit addressing can be\nfound for weak magnetization damping and for a special device geometry involving hard\naxis pulses only. The drawback of this device geometry is however that the memory\ncould only be operated in a toggle switch mode. Programming of a cell into a predefined\nmemory state is thus only possible when the initial state of the memory cell is known and\na pre-write read-out of the cell must be performed.\nIn this work the concept of ringing free bit addressing is extended to a standard\ncrossed wire memory cell layout. The bit addressing scheme allows directed programming of a cell into a predefined state regardless of the initial state of the cell. From symmetry considerations it is shown that optimized bit addressing can be obtained most eas3\n\n\fily when programming a whole row of memory cells (\"word\") simultaneously. Numerical\nsimulations of the magnetization dynamics of the cells in a single spin approximation\nshown that it is possible to tailor the pulses such that for all cells of the word to be written\nthe magnetization performs either a half or a full precessional turn during pulse application. This bit addressing scheme results in a suppressed magnetization ringing in all cells\nof the MRAM array allowing ultra high write clock rates above 1 GHz per word and thus\nof several GHz per bit.\n\nII. MRAM ARRAY LAYOUT\nFig. 1 shows a sketch of the MRAM array layout studied in this work. The ellipticc magnetic memory cells are arranged in a matrix of m rows and n columns (n,m are\ninteger numbers). The easy axis of the cells corresponds to the long axis of the ellipsoids.\nEach cell comprises a magnetic free layer consisting of a single ferromagnetic layer. The\ndigital information of the cells is stored in the orientation of the magnetization M of the\nfree layer as indicated by the arrows in some of the cells of Fig. 1.\nProgramming of the cells is performed using the conductive wiring consisting of\nthe bit lines (BL1 ... BLn) running vertically and the word lines (WL1 ... WLm) running\nhorizontally. The bit lines are aligned parallel to the in plane hard axis of the free layer\nand the word lines are aligned parallel to the easy axis of the free layer. A current pulse\nIBL through one of the bit lines (e.g.: BLν) generates an easy axis magnetic field pulse at\nall cells of the column ν whereas a current pulse IWL in one of the word lines (e.g.:\nWLν) generates a hard axis magnetic field pulse at all cells of the row ν. The field pulses\n4\n\n\fgenerated by the bit lines can have two different easy axis orientations to program the\ncells into the two digital memory states. For the hard axis pulses generated by the world\nline unipolar fields are sufficient.\nIn the bit addressing scheme under consideration a whole row of memory cells of\nthe magnetic memory cell array (also called a \"word\") is programmed at the same time.\nIn the array shown in Fig. 1 the word ν is written. The word ν corresponds to the cells\nsituated along a word line WLν. To program the word ν of the array of Fig. 1 a word line\ncurrent pulse IWLν is applied to the word line WLν. This word line current pulse IWLν\nresults in a magnetic field pulse hY along the in plane hard axis for all cells situated in the\nrow ν of the array. At the same time bit line current pulses IBL1 - IBLn are applied to all\nbit lines BL1-BLn. The bit line current pulses generate easy axis field pulses hX1... hXn\nat the cells of the corresponding bit lines. The easy axis field pulses from the different bit\nlines BL have the same amplitude but different orientations. The final orientation of the\nmagnetization M of each bit μ of the word ν to be written is determined by the orientation of the easy axis field hXμ generated by the corresponding bit line BLμ (i.e. by the\npolarity of the bit line current pulse IBLμ). The bit sequence of the word ν and the corresponding bit line current orientations are sketched on the bottom part of the figure. As in\nstandard MRAM bit addressing schemes the easy axis fields ±hX alone (created by the bit\nlines BL) are not sufficient to reverse the magnetization M of the cells situated at the\ncorresponding bit lines. Only the combination of the easy axis bit line field ±hX with the\nhard axis word line field hY allows reversal of the cell magnetization. After application of\nthe combined easy and hard axis field pulse ±hX and hY the magnetization of each cell\n\n5\n\n\fcombined easy and hard axis field pulse ±hX and hY the magnetization of each cell will\nthen be aligned along the applied easy axis field ±hX of the corresponding bit line BLμ.\nDuring the programming of a word the different cells of the array are subject to\ndifferent magnetic field pulses. The cells can be classified in four categories a-d of different relative orientations of the initial magnetization M of the free layer and of the applied magnetic field H. Examples of cells of the four categories are marked by the circles\na-d in Fig. 1. The relative field orientations of the four categories are sketched in more\ndetail in Fig. 2 a-d. The cells which do not belong to the word ν to be written are only\nsubject to the easy axis field generated by the bit lines BL. Depending on the initial easy\naxis orientation of the magnetization M of the cells and on the orientation of the bit line\neasy axis field ±hX the applied easy axis field is either oriented parallel to the initial\nmagnetization as in case a or antiparallel as in case b. In both cases the final orientation\nof the magnetization after pulse application should be the same as the initial one (see Fig.\n2 a,b on the right hand side). Also in the programmed word ν two different relative orientations of the field vector H = (±hX,hY) and the magnetization M can occur. For all cells\nin the word ν the applied field is tilted out of the easy axis due to the non vanishing hard\naxis field component hY generated by the word line WLν (Fig. 2 c,d). Again one can distinguish between the case c where the easy axis component hX is oriented parallel to the\ninitial magnetization M and the case d where the easy axis component hX is oriented antiparallel to M. Also in the case c (like in the cases a and b) the applied field pulse should\nnot induce magnetization reversal and the initial and final magnetization states are the\nsame. Only in case d the magnetization of the cell must be reversed after the application\nof the magnetic field pulse. In the four cases only switching from the initial negative easy\n6\n\n\faxis orientation to positive orientation is considered. Due to the symmetry the reverse\nswitching process (i.e. from positive to negative easy axis orientation) is of course also\ncovered by the four cases of field application. Note again, that these four cases cover all\npossible relative orientations of initial magnetization and applied field in this bit addressing scheme. Either the cells are subject to an easy axis half select field H = (±hX,0) generated by the bit lines (cases a,b) or the cells are subject to a tilted full select field H =\n(±hX,hY≠0) generated by the bit and word line. As the whole word is programmed simultaneously a further case of hard axis half selection generated by the word line does not\noccur.\nAs already mentioned the aim is to reduce the magnetization ringing in the array\nof cells after the decay of the bit addressing pulses. In this bit addressing scheme the ringing is most pronounced in the programmed word ν as here the largest tilt of M out of the\neasy axis during pulse application occurs. This ringing could be suppressed when the following conditions are met:\n(i)\n\nwhen M is not to be reversed upon pulse decay (case c) M undergoes a full pre-\n\ncessional turn about the effective field during field pulse application.\n(ii)\n\nwhen M is to be reversed upon pulse decay (case d) M undergoes a half preces-\n\nsional turn about the effective field during field pulse application and performs a ringing\nfree ballistic switching trajectory (5).\nIn both cases the free layer magnetization M of all cells of the word to be written\nis again oriented very near the easy axis and thus near the equilibrium conditions. Conse-\n\n7\n\n\fquently, the ringing of the magnetization M of the free layer will be strongly reduced if\nnot fully suppressed.\nSuch suppression of ringing after a full precessional turn (no switch) (13) and after a half\nprecessional turn (ballistic switch) (7) has been achieved in microscopic magnetic memory cells by tailoring the duration and amplitude of the applied magnetic field pulses. One\nthus has to properly tailor the duration TPulse and the field values for the pulse HS that\nswitches the magnetization and for the pulse HNS that does not switch the magnetization\nunder the constraints of the given device geometry. The pulse parameters then have to\nfulfill the \"no-ringing criterion\" given by\nTpulse = TPrec(HNS) = 1⁄2 TPrec(HS).\nHere, TPrec(HNS) is the duration of the first precessional turn upon application of the \"noswitch\" field HNS and 1⁄2 TPrec(HS) is the duration of the first half precessional turn upon\napplication of the switching field HS. If one is able to find field values HS, HNS fulfilling\nthe right hand side part of the no ringing criterion one just has to choose the pulse duration Tpulse accordingly. Then ultra fast and practically ringing free MRAM write operation\nis possible.\n\nIII. OPTIMIZATION OF THE BIT ADDRESSING PULSE PARAMETERS\nTo obtain this optimal situation in our device geometry the parameters of the easy\naxis and hard axis field pulses generated by the bit and word lines have to be adapted to\nthe specific magnetic properties of the free layer of the cells. Parameters of the field\n8\n\n\fpulses which can be varied are e.g. the easy and hard axis field components, the pulse\nduration TPulse, and the rise and fall times of the easy axis and hard axis field pulses Trise,\nTfall. The properties of the free layer which play a role are e.g.: the saturation magnetization MS (which is depends on the magnetic material of the free layer), the geometry of the\nfree layer (and thus the shape anisotropy), the other material dependent anisotropies of\nthe magnetic free layer. Of further importance are also the magnetic coupling of the free\nlayer to the pinned layer and to other layers of the cell stack.\nIn the following an example is presented of an optimization of the pulse parameters for a certain set of cell parameters and for the device geometry of Fig. 1. The parameter optimization is done using numerical simulations of the magnetization dynamics\nof the cell's free layer in a simple single spin model. In this example only the pulse duration TPulse and the pulse amplitudes along the hard and easy axis are varied to achieve optimum bit addressing trajectories. The free layer of the magnetic cells is modeled as a rotational ellipsoid of permalloy (NiFe) having a saturation magnetization of 4πMS = 10800\nOe. The demagnetizing factors are NX/4π = 0.00615 (easy axis), NY/4π = 0.01746 (inplane hard axis), and NZ/4π = 0.9764 (out of plane) corresponding to ellipsoid dimensions of 500 nm x 200 nm x 5 nm (14). Other anisotropies than shape anisotropy are not\ntaken into account. In the calculations the easy axis is along the x-axis, the intermediate\naxis (in plane hard axis) is along the y-axis, and hard axis (out of plane hard axis) is along\nthe z-axis as marked in Figs 1 and 2.\nThe time evolution of the magnetization response to the transverse field pulses is\nderived by numerically solving the Landau-Lifshitz-Gilbert (LLG) equation (15)\n\n9\n\n\fdM\nα ⎛\ndM ⎞\n= − γ (M × H eff )+\n⎜M×\n⎟\ndt\nMS ⎝\ndt ⎠\n\nin the single spin approximation i.e. under the assumption of a homogeneous orientation\nof the magnetization in the free layer (4). In the LLG equation γ is the gyromagnetic ratio, Heff the effective field, and α is the Gilbert damping parameter. In the simulations a\nGilbert damping parameter of α = 0.03 is used which has also been measured in realistic\nmagnetic memory cells (7). Due to the symmetry of the system only the trajectories for\nswitching from negative easy axis orientation to positive easy axis orientation is computed. Initially, i.e. before pulse application M is practically oriented along the negative\neasy axis orientation. Only a small initial tilt of M of 1° in plane out of the easy axis orientation is assumed: M = (mX,mY,mZ) = (-0.98, 0.02, 0) ≈ (-1,0,0). The hard axis field\ncomponent is always applied in the +hY direction. The easy axis field component is either\napplied in the negative easy axis direction (-hX, no switch, case c) or in the positive easy\naxis direction (+hX, switch, case d).\nDuring bit addressing the rise of the tilted field pulse H induces a precessional\nmotion of the free layer magnetization M. M then precesses about the vector of the effective field Heff being the sum of the applied field H = (hX,hY,0) and an internal field Hint. In\nthe general case Hint is due to the various magnetic anisotropies of the free layer and\ncomprises the demagnetizing field HD. The internal field Hint depends on the relative orientation of H and M. Consequently, also the precession period TPrec (H) depends on the\nrelative orientation of the applied field H and the initial orientation of M.\n\n10\n\n\fThis dependence of the computed precession period on the field strength and field\norientation is displayed in Fig. 3. Fig. 3 (a) shows the duration of the first full precession\nperiod TPrec(H) upon application of a magnetic field step H. Fig. 3 (b) shows the duration\nof the first half precessional turn 1⁄2TPrec(H) upon application of the same magnetic field\nstep H. The values of TPrec and 1⁄2TPrec are derived from the LLG simulation of the magnetization response to an in-plane field step having an amplitude H=(hX,hY,0) and a realistic rise time of Trise = 100 ps. In Fig. 3 (a,b) the values of the (half) precession period\nare grey scale encoded. The grey scale map is plotted as a function of the hard axis field\ncomponent hY (horizontal axis) and of the easy axis field component hX (vertical axis).\nLong durations of the precession period are encoded in dark and short durations are encoded light (see grey scale bar on the right hand side). The scales and grey scale encodings of the two maps in (a) and (b) are identical. For symmetry reasons only data for positive hard axis field values is computed and displayed (hY > 0).\nAs already mentioned the initial magnetization M is oriented along the negative\neasy axis orientation M ≈ (-1,0,0). In the Figure M thus initially points to the bottom. In\nthe upper half of the plots M is initially oriented antiparallel to the easy axis field component as shown in the sketch in (b). In the lower half of the plots (i.e. for negative easy\naxis fields -hX) M is initially oriented parallel to the easy axis field component -hX as\nshown in the sketch in (a). In parts (a) and (b) of Fig. 3 light values corresponding to\nshort (half) precession periods are found in the lower half i.e. for parallel easy axis field\ncomponents. The applied field H and the internal field Hint are adding up resulting in a\nstrong effective field Heff and thus in short precession periods. The longest (half) precession periods are found in the dark region running from the upper left to the centre right of\n11\n\n\fboth plots. In this region the transition from non-switching to switching occurs. Below\nthis transition the magnetization does not overcome the hard axis during pulse application\nand no magnetization reversal is possible. Above this region M overcomes the hard axis\nduring pulse application and magnetization reversal occurs. The transition corresponds\napproximately to the well known Stoner-Diamond describing the quasi static magnetization switching thresholds. Near this switching limit the applied field H and the internal\nfields Hint are approximately of the same strength but of opposite sign. The effective field\nHeff thus nearly vanishes resulting in very long precession periods. Above this limit the\napplied fields starts to dominate and the effective field values rise again resulting in a decrease of the precession periods with increasing applied field amplitude.\nLet us now consider the consequences for the two relevant cases for MRAM operation. In the case c of Fig. 2 the field for non switching HNS has a non-vanishing hard\naxis component hY ≠ 0 and an easy axis component along the initial magnetization. The\neasy axis component -hX is negative. Under the application of HNS the magnetization\nshould perform a full precessional turn. The relevant values are thus found in the lower\nhalf of Fig. 3(a). Here, the duration of the full precession period TPrec is short due to the\ninfluence of the parallel internal fields. Conversely, case d of Fig. 2 corresponds to a field\nwith the same non vanishing hard axis component hY ≠ 0 and a positive easy axis component +hX. Here M should perform approximately a half precessional turn under the application of the switching field pulse HS. The relevant values are thus found in the upper\nhalf of Fig. 3(b) slightly above the dark region of the switching limit. Here, the duration\nof the half precession period 1⁄2 TPrec is long due to the influence of the antiparallel internal fields. The existence of a region of long half precession periods for an antiparallel\n12\n\n\feasy axis field orientation and of a region of short full precession periods for the opposite\neasy parallel axis field orientation could allow to find a set of field values allowing optimum bit addressing according to the no-ringing criterion. One thus has to find a pair of\nfield values (±hX,hY) having the same hard axis component hY and an easy axis component of opposite sign and equal absolute value ±hX. The field value for switching is HS =\n(+hX,hY) is found in the upper half of Fig. 3(b) and the field value for non-switching HNS\n= (-hX,hY) is found in the lower half of Fig. 3(a).\nTo make it easier to find the corresponding field values in the data of Fig. 3 a new\nfigure of merit for the no-ringing criterion is computed: the precession mismatch\n∆T(|hX|,hY). The precession mismatch is calculated for each field value pair (±hX,hY) and\nis the absolute value of the difference of duration of the first half precession period\n1⁄2TPrec(+hX,hY) at positive easy axis fields and of the duration of the full precession period TPrec(-hX,hY) at negative easy axis fields: ∆T(|hX|,hY) = |1⁄2TPrec(+hX,hY) – TPrec(hX,hY)|. If ∆T = 0 the durations of the half and the full precession period at the field value\npair (±hX,hY) match and the right hand side of the no-ringing criterion is exactly fulfilled.\nIn Fig. 4a the precession mismatch ∆T(|hX|,hY) is displayed in a grey scale map.\n∆Τ is plotted as a function of the hard axis field (horizontal axis) and of the absolute easy\naxis field |hX| (vertical axis). In the black region marked by the arrow the precession\nmismatch is smaller than 10 ps. Here, the right hand side equation of the no-ringing criterion is approximately fulfilled which is a prerequisite for optimized bit addressing. The\nsecond prerequisite is that the switch field value HS results in ballistic magnetization reversal and that the ringing upon switch pulse application is suppressed. In Fig. 4b the\n13\n\n\fswitching field threshold and the field values for which ballistic reversal trajectories are\npossible are displayed. As mentioned before for field values above the switching field\nthreshold the magnetization trajectories overcome the hard axis during field step application. The field region above the switching field threshold is marked in grey. Furthermore,\nthe fields for which no-ringing trajectories are possible (5) are marked in black. Here, the\nmagnetization trajectories pass through the reversed equilibrium position M ≈ (1,0,0) during the application of the field steps. When the pulse decay occurs at this point of the trajectory optimum ballistic magnetization reversal occurs. For optimized bit addressing the\nfield value (±hX,hY) should thus also be chosen from the black region of the no-ringing\nswitching trajectories.\nIn Fig. 5 the relevant parts of Fig. 4a and b are overlaid in the same plot. The region of small precession mismatch ∆Τ < 10 ps and the region of no-ringing switching are\ndifferently hatched. The two regions overlap at the cross hatched a field range around |hX|\n≈ 26-36 Oe and hY ≈ 77-81 Oe marked by the arrow. In this field range optimized bit addressed magnetization reversal in the array is possible if the pulse duration Tpulse of the\neasy and hard axis pulses is properly matched to the duration of the precession periods\naccording to no-ringing criterion.\n\nIV. BIT ADDRESSING TRAJECTORIES\nIn the following a set of magnetization trajectories which allow ultra fast MRAM\noperation is presented. The easy and hard axis field values are taken from the region of\n\n14\n\n\foptimum bit addressing of Fig. 5. The time evolution of the hard and easy axis field\npulses and the time dependence of the magnetization trajectories upon application of\nthese field pulses is displayed in Fig. 6. A set of optimized bit addressing pulses taken\nfrom the cross hatched field range of Fig. 5 is shown in the uppermost panel. The pulse\nduration of the pulses is matched to the corresponding precession periods of the noringing criterion. The pulse duration of the hard and easy axis pulse is TPulse = 325 ps\nwhen measured at half of the maximum amplitude. The pulse starts to rise at 0 ps and\nfully decays to zero at a time of 425 ps. The fall and rise times of the pulse are Trise = Tfall\n= 100 ps. The amplitude of the hard axis field pulse is hY = 78 Oe. The amplitude of the\neasy axis field pulse is hX = ± 28 Oe. In the four lower panels a-d of Fig. 6 the components of the magnetization M = (mX,mY,mZ) are plotted as a function of time. The relative\nfield orientation in the four cases a-d is again sketched on the right hand side. The resulting magnetization trajectories during application of these field pulses are now briefly discussed.\nIn case a only the easy axis field hX generated by the bit line is acting on the magnetization M of the free layer. The magnetic field pulse H = (-28 Oe,0) is applied parallel\nto the initial magnetization. Consequently, the torque on the magnetization M according\nto the LLG equation practically vanishes and no precession of the magnetization occurs.\nFurthermore the magnetization is not reversed upon field pulse decay (mX = -1). Also in\ncase b only an easy axis bit line field pulse H = (+28 Oe,0) is acting on the magnetization\nM. Now the field is applied antiparallel to the initial magnetization. Also in this case the\ntorque on the magnetization according to the LLG equation is practically zero. Furthermore the applied easy axis field is well below the easy axis switch field threshold and\n15\n\n\fpractically no tilt of the magnetization occurs. Consequently, no magnetization ringing is\nfound and the magnetization is not reversed upon field pulse decay (mX = -1).\nIn case c the applied field components are hX = -28 Oe and hY = 78 Oe. The easy\naxis component is oriented parallel to the initial magnetization. Here the magnetization\nperforms approximately a full precessional turn about the effective field during pulse\napplication. Due to this full precessional turn the magnetization is oriented near the initial\neasy axis upon pulse decay and only little ringing of the magnetization after pulse application occurs. The slight remaining ringing is however inevitable due to the finite damping parameter of α = 0.03. The damping results in a relaxation of the magnetization towards the tilted effective field during precession. In this example at the moment of pulse\ndecay M is still tilted by about 11° out of the easy axis (see arrow). Due to this rather\nsmall tilt the resulting ringing is not very pronounced. After a first precessional \"ringing\"\nturn of the magnetization about the internal fields after field pulse decay (i.e. at a time of\nabout 700 ps after the rise of the field pulse) the maximum occurring tilt is less than 6°\nout of the easy axis. The magnetization ringing can thus be neglected within less than 1\nns after the initial rise of the magnetic field pulse. Furthermore, the magnetization is not\nreversed upon field pulse decay (mX = -1).\nIn case d the applied field components are hX = +28 Oe and hY = 78 Oe. The easy\naxis component is now oriented antiparallel to the initial magnetization. Here the magnetization performs approximately a half precessional turn about the effective field during pulse application. After the half precessional turn the magnetization is now oriented\nalong the reversed easy axis (mX = +1) upon pulse decay and practically no magnetization ringing occurs. Note, that after this ballistic magnetization reversal the ringing is\n16\n\n\feven weaker than in the case c as the pulse fields are chosen from the region of the noringing trajectories allowing an excellent alignment of M along the reversed easy axis\ndirection upon pulse decay.\nAs already pointed out these four cases cover all possible relative field orientations and thus all possible magnetization trajectories which occur in the cell array during\nbit addressing. Consequently, after the programming of a word the ringing is suppressed\nin all cells of the array and the following word could be written immediately after. The\nachievable write rates are above 1 GHz per word and thus of several GHz per bit depending on the number of bits per word.\nV. CONCLUSIONS\nThis work described a way to find field pulse parameters for optimum bit addressing trajectories that allow ultra fast MRAM write operation. The basic concept for optimum MRAM write operation is that (i) optimum switching is obtained when M performs\na half precessional turn (ii) optimum non-switching is obtained when M performs a full\nprecessional turn during magnetic field pulse application. Using simple simulations of the\ntime evolution of the free layer magnetization for a certain set of cell parameters optimized parameters for the bit addressing field pulses were derived. In the proposed bit addressing scheme a whole set of cells (\"word\") is written simultaneously thereby eliminating the case of half selection by a hard axis field pulse only. As a consequence of this\nelimination only two relative field orientations (cases c and d) which induce a strong\ntorque on the magnetization (and thus can generate a pronounced ringing of the magnetization) occur during bit addressing. For these two cases it is possible to match the preces-\n\n17\n\n\fsion periods for switching and non-switching trajectories and thus to obtain optimum bit\naddressing trajectories.\nIn the simplified model of the magnetic memory cells only the shape anisotropy\nof the free layer was taken into account. No further anisotropies or any effects resulting\nfrom an inhomogeneous magnetization in the sample were included. However, fast reversal experiments on microscopic memory cells have shown that such simple simulations\ncan well describe the basic physics of ultra fast magnetization motion in MRAM cells\n(6,7,8) and thus that the results could be indeed transferred to realistic MRAM cells.\nNevertheless, as a further step micromagnetic simulations which take into account more\nrealistic device parameters and eventually an experimental test of such optimized bit addressing would be desirable. Further modifications like variation of the pulse shape and\nof the delay between the bit and word line pulse could be possible and should also be\ntested for the occurrence of no-ringing bit addressing trajectories.\nAll numerical values of this work like the maximum write clock rate, pulse duration, pulse amplitude, precession periods etc. depend strongly on the device parameters\n(geometry and demagnetizing factors, further anisotropies, saturation magnetization,\netc.). However, the order of magnitude is valid for a realistic memory cell. Furthermore it\nshould be noted that the value of the Gilbert damping parameter α plays an important role\nfor such ultra fast bit addressing. As pointed out in the literature (5) the position of the\nno-ringing trajectories (compare Figs. 4, 5) depends on the value of α. For decreasing α\nthe position of the no-ringing trajectories is shifted towards the hard axis and for increasing α towards the easy axis. The optimum bit addressing parameters must be changed\n\n18\n\n\faccordingly. Note that for very low damping parameters (α << 0.01) the optimum field\norientation is along the hard axis. In this case only a toggle switching and not a directed\nswitching of the memory cells is possible as studied in earlier work (12).\nSuch optimized bit addressing should not only be fast but also stable. Upon pulse\ntermination of all field pulses the final magnetization is very near the equilibrium conditions and thus near the lowest energy state. Thereby reducing the probability of erroneous\nwriting by half-select pulses e.g. due to thermal activation. In the calculated example the\nringing of the magnetization in all cell was on a negligible level within about 700 ps after\nthe initial rise of the bit addressing field pulse. The achievable write rates are therefore\nabove 1 GHz per word and consequently of several GHz per bit depending on the number\nof bits per word. Using this bit addressing scheme ultra fast MRAMs operating with GHz\nwrite clock rates thus seems possible.\n\n19\n\n\fFIGURE CAPTIONS:\nFIGURE 1:\nSketch of the array of magnetic memory cells and of the conductive bit lines (BL) and\nword lines (WL) for magnetic field generation. To program the word ν of the array (i.e.\nthe cells along the word line WLν) a word line current pulse IWLν is applied to the word\nline WLν and simultaneously a set of bit line current pulses IBL1-IBLn is applied to all\nbit lines BL1-BLn. The polarity of the bit line current pulses IBL defines easy axis field\norientation and thus the digital state of the word to be written as sketched on the bottom.\nFour cases (a-d) of different relative orientation of the generated magnetic field and the\ninitial magnetization are marked by the dotted circles.\n\nFIGURE 2:\nDetailed sketch of the four cases (a-d) of relative orientation between the applied field H\nand the initial free layer magnetization M during programming. The initial states are\nsketched on the left hand side and the final states on the right hand side. (a) H is applied\nparallel to the M. (b) H is applied antiparallel to M. (c) H is tilted with respect to M. The\neasy axis component -hX is parallel to M. (d) H is tilted with respect to M. The easy axis\ncomponent +hX is antiparallel to M. Only the case (d) should result in magnetization reversal.\n\n20\n\n\fFIGURE 3:\nComputed duration of the first full precessional turn TPrec(H) (a) and of the first half precessional turn 1⁄2 TPrec(H) (b) upon application of an in plane magnetic field step H =\n(±hX,hY). TPrec(H) and 1⁄2TPrec(H) are plotted as a function of the easy axis field component hX (vertical axis) and of the hard axis field component hY (horizontal axis). The rise\ntime of the field step is 100 ps. The magnetization is initially oriented along the negative\neasy axis M ≈ (-1,0,0). The lower (upper) half of the plots corresponds to fields having an\n(anti)parallel easy axis component as sketched in the pictograms. Light shades correspond to short (half) precession periods and dark shades correspond to long (half) precession periods. The longest values (black) of TPrec(H) and 1⁄2 TPrec(H) are found near the\ntransition from switching to non-switching trajectories.\n\nFIGURE 4:\n(a) grey scale plot of the precession mismatch ∆T(|hX|,hY) as computed from the data of\nFig. 3(a,b) (see text). ∆T is plotted as a function of the absolute value of the easy axis\nfield component |hX| (vertical axis) and of the hard axis field component hY (horizontal\naxis). In the black region marked by the arrow the durations of the first full and half precession periods at opposite easy axis fields approximately match. Here, TPrec(-hX,hY) and\n1⁄2TPrec(+hX,hY) differ by less than 10 ps. (b) plot of the field threshold for magnetization\nreversal as a function of the easy axis field component hX (vertical axis) and of the hard\naxis field component hY (horizontal axis). In the white region no magnetization reversal\nis possible. In the light grey region M overcomes the hard axis during field step applica-\n\n21\n\n\ftion and magnetization reversal occurs. The black line marks the field values for which\nringing free ballistic bit addressing trajectories are possible.\n\nFIGURE 5:\nField range allowing optimum bit addressing. The easy axis field component hX is varied\nalong the vertical axis and the hard axis field component hY along the horizontal axis.\nThe region of good precession match ∆T(|hX|,hY) < 10 ps of Fig. 4(a) is displayed together with the region of occurrence of no-ringing trajectories of Fig. 4(b). Both regions\nare hatched in different directions. The two regions overlap in the cross-hatched region\nfor field values of |±hX| ≈ 26-36 Oe and hY ≈ 77-81 (arrow). For these field values optimum bit addressing parameters when programming a word of the MRAM array can be\nobtained.\n\nFIGURE 6:\nApplied field pulses and magnetization trajectories for the four relevant cases (a-d) for\noptimized bit addressing. The pulse fields are taken from the cross hatched region of Fig.\n5. The applied field components are plotted vs. time in the uppermost panel. The field\namplitudes are hX = ±28 Oe and hY = 78 Oe. The pulse duration is matched to the precession period according to the no-ringing criterion. The rise and fall time of the pulses are\n100 ps. The pulses start to rise at the time 0 ps and decay to zero at 405 ps. The pulse duration measured at half of the maximum amplitude is 325 ps. (a-d) Magnetization components mX,mY,mZ vs. time during and after application of the field pulses shown in the\n\n22\n\n\fupper panel. The relative field orientation in the four cases (a-d) is again sketched on the\nright hand side. Only the case (d) induces magnetization reversal. Only in the case (c) a\nslight tilt of the M upon field pulse decay (arrow) and a subsequent ringing of the magnetization occurs. The weak ringing can be practically neglected within less than 1 ns after the initial rise of the bit addressing field pulses. Such bit addressing trajectories allow\nMRAM write clock rates above 1GHz.\n\n23\n\n\fReferences:\n\n(1) S.S.P. Parkin et al., J. Appl. Phys. 85, 5828 (1999).\n(2) S. Tehrani et al., IEEE Trans. Mag. 36, 2752 (2000).\n(3) John DeBrosse et al. IEEE J. Solid State Circuits 39, 678 (2004).\n(4) M. Bauer et al., Phys. Rev. B 61, 3410 (2000).\n(5) J. Miltat, G. Alburquerque, and A. Thiaville in Spin Dynamics in Confined Magnetic\nStructures, B. Hillebrands and K. Ounadjela (eds.) (Springer, Berlin, 2001).\n(6) S. Kaka and S. E. Russek, Appl. Phys. Lett. 80, 2958 (2002).\n(7) H. W. Schumacher et al. Phys. Rev. Lett. 90, 017201 (2003); H. W. Schumacher et al.\nPhys. Rev. Lett. 90, 017204 (2003).\n(8) Th. Gerrits et al., Nature 418, 509 (2002).\n(9) W. K. Hiebert, L. Lagae, and J. De Boeck, Phys. Rev. B 68, 020402(R) (2003).\n(10) W. K. Hiebert, L. Lagae, J. Das, J. Bekaert, R. Wirix-Speetjens, and J. De Boeck, J.\nAppl. Phys. 93, 6906 (2003).\n(11) A. Krichevsky and M. R. Freeman, J. Appl. Phys. 95, 6601 (2004).\n(12) H.W. Schumacher, submitted to Appl. Phys. Lett and cond-mat/0501753.\n(13) H. W. Schumacher, C. Chappert, P. Crozat, R. C. Sousa, P. P. Freitas, M. Bauer,\nAppl. Phys. Lett. 80, 3781 (2002).\n(14) S. Chikazumi: The Physics of Magnetism, p. 21-22, Wiley, New York, ISBN 088275-662-1.\n(15) L. Landau, and E. Lifshitz, Phys. Z. Sowjetunion 8, 153, (1935); T. L. Gilbert, Phys.\nRev. 100, 1243 (1955).\n\n24\n\n\fBL1\n\n...\n\nBLμ\n\n...\n\nb\n\nBLn\na\nWL1\n\n...\n\nc\n\nd\nWLν\n\nIWLν\n...\nWLm\n\ny\nx\n1\nIBL1\n\n0\n\n0\n\n0\n\n...\nH. W. Schumacher\nFigure 1\n\n1\nIBLn\n\n\finitial\n\nfinal\n\nH\nM\n\n(a)\n\n(b)\n\n(c)\n\n(d)\ny\nx\nH. W. Schumacher\nFigure 2\n\n\f(a)\n0.20\n0.24\n0.28\n0.32\n0.36\n0.40\n0.44\n0.48\n0.52\n0.56\n0.60\n\n50\n\n0\n\n-50\n\nfull precession period (ns)\n\neasy axis field (Oe)\n\n100\n\n-100\n0\n\n50\n\n(b)\n\n100\n\neasy axis field (Oe)\n\n0.20\n0.24\n\n50\n\n0.28\n0.32\n0.36\n\n0\n\n0.40\n0.44\n0.48\n\n-50\n\n0.52\n0.56\n0.60\n\n-100\n0\n\n50\n\nhard axis field (Oe)\n\nH. W. Schumacher\nFigure 3\n\nhalf precession period (ns)\n\nhard axis field (Oe)\n\n\f|easy axis field| (Oe)\n\n(a)\n100\n\n0.01\n\n50\n0.06\n0.10\n\n0\n0\n\n50\n\nhard axis field (Oe)\n100\n\neasy axis field (Oe)\n\n∆T (ns)\n\n(b)\nswitch\n\n50\n\nno switch\n0\n\nno-ringing trajectories\n-50\n\n-100\n0\n\n50\n\nhard axis field (Oe)\n\nH.W. Schumacher\nFigure 4\n\n\feasy axis field (Oe)\n\n100\n\nswitch\n\n50\n\nno switch\n0\n-50\n-100\n0\n\n50\n\nhard axis field (Oe)\n\nH.W. Schumacher\nFigure 5\n\n\fhX,Y (Oe)\n\n50\n\nmX,Y,Z\n\nmX\n\nhY\n\nmY\n\n|hX|\n\nmZ\n\n0\n1\n0\n\na\n\nmX,Y,Z\n\n-1\n1\n\nb\n\n0\n\nmX,Y,Z\n\n-1\n1\n\nc\n\n0\n\nmX,Y,Z\n\n-1\n1\n\nd\n\n0\n\ny\n\n-1\n0\n\n1\n\ntime (ns)\n\nH.W. Schumacher\nFigure 6\n\nx\n\n\f"}