{"id": "http://arxiv.org/abs/cond-mat/0311439v1", "guidislink": true, "updated": "2003-11-19T10:01:30Z", "updated_parsed": [2003, 11, 19, 10, 1, 30, 2, 323, 0], "published": "2003-11-19T10:01:30Z", "published_parsed": [2003, 11, 19, 10, 1, 30, 2, 323, 0], "title": "High-bias stability of monatomic chains", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0311323%2Ccond-mat%2F0311428%2Ccond-mat%2F0311577%2Ccond-mat%2F0311248%2Ccond-mat%2F0311436%2Ccond-mat%2F0311476%2Ccond-mat%2F0311324%2Ccond-mat%2F0311439%2Ccond-mat%2F0311388%2Ccond-mat%2F0311318%2Ccond-mat%2F0311039%2Ccond-mat%2F0311160%2Ccond-mat%2F0311531%2Ccond-mat%2F0311540%2Ccond-mat%2F0311465%2Ccond-mat%2F0311057%2Ccond-mat%2F0311515%2Ccond-mat%2F0311366%2Ccond-mat%2F0311163%2Ccond-mat%2F0311488%2Ccond-mat%2F0311286%2Ccond-mat%2F0311533%2Ccond-mat%2F0311470%2Ccond-mat%2F0311472%2Ccond-mat%2F0311649%2Ccond-mat%2F0311068%2Ccond-mat%2F0311222%2Ccond-mat%2F0311033%2Ccond-mat%2F0311452%2Ccond-mat%2F0311447%2Ccond-mat%2F0311644%2Ccond-mat%2F0311288%2Ccond-mat%2F0311030%2Ccond-mat%2F0311392%2Ccond-mat%2F0311370%2Ccond-mat%2F0311529%2Ccond-mat%2F0311541%2Ccond-mat%2F0311207%2Ccond-mat%2F0311335%2Ccond-mat%2F0311110%2Ccond-mat%2F0311131%2Ccond-mat%2F0311561%2Ccond-mat%2F0311064%2Ccond-mat%2F0311508%2Ccond-mat%2F0311556%2Ccond-mat%2F0311552%2Ccond-mat%2F0311188%2Ccond-mat%2F0311298%2Ccond-mat%2F0311638%2Ccond-mat%2F0311072%2Ccond-mat%2F0311153%2Ccond-mat%2F0311297%2Ccond-mat%2F0311130%2Ccond-mat%2F0311425%2Ccond-mat%2F0311175%2Ccond-mat%2F0311520%2Ccond-mat%2F0311398%2Ccond-mat%2F0311285%2Ccond-mat%2F0311172%2Ccond-mat%2F0311204%2Ccond-mat%2F0311486%2Ccond-mat%2F0311273%2Ccond-mat%2F0311167%2Ccond-mat%2F0311220%2Ccond-mat%2F0311462%2Ccond-mat%2F0311165%2Ccond-mat%2F0311599%2Ccond-mat%2F0311141%2Ccond-mat%2F0311445%2Ccond-mat%2F0311200%2Ccond-mat%2F0311201%2Ccond-mat%2F0311009%2Ccond-mat%2F0311610%2Ccond-mat%2F0311464%2Ccond-mat%2F0311088%2Ccond-mat%2F0311217%2Ccond-mat%2F0311311%2Ccond-mat%2F0311280%2Ccond-mat%2F0311025%2Ccond-mat%2F0311478%2Ccond-mat%2F0311565%2Ccond-mat%2F0311052%2Ccond-mat%2F0311555%2Ccond-mat%2F0311568%2Ccond-mat%2F0311625%2Ccond-mat%2F0311364%2Ccond-mat%2F0311082%2Ccond-mat%2F0311223%2Ccond-mat%2F0311261%2Ccond-mat%2F0311600%2Ccond-mat%2F0311401%2Ccond-mat%2F0311212%2Ccond-mat%2F0311301%2Ccond-mat%2F0311354%2Ccond-mat%2F0311582%2Ccond-mat%2F0311554%2Ccond-mat%2F0311505%2Ccond-mat%2F0311545%2Ccond-mat%2F0311227%2Ccond-mat%2F0311346%2Ccond-mat%2F0311560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High-bias stability of monatomic chains"}, "summary": "For the metals Au, Pt and Ir it is possible to form freely suspended\nmonatomic chains between bulk electrodes. The atomic chains sustain very large\ncurrent densities, but finally fail at high bias. We investigate the breaking\nmechanism, that involves current-induced heating of the atomic wires and\nelectromigration forces. We find good agreement of the observations for Au\nbased on models due to Todorov and coworkers. The high-bias breaking of atomic\nchains for Pt can also be described by the models, although here the parameters\nhave not been obtained independently. In the limit of long chains the breaking\nvoltage decreases inversely proportional to the length.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0311323%2Ccond-mat%2F0311428%2Ccond-mat%2F0311577%2Ccond-mat%2F0311248%2Ccond-mat%2F0311436%2Ccond-mat%2F0311476%2Ccond-mat%2F0311324%2Ccond-mat%2F0311439%2Ccond-mat%2F0311388%2Ccond-mat%2F0311318%2Ccond-mat%2F0311039%2Ccond-mat%2F0311160%2Ccond-mat%2F0311531%2Ccond-mat%2F0311540%2Ccond-mat%2F0311465%2Ccond-mat%2F0311057%2Ccond-mat%2F0311515%2Ccond-mat%2F0311366%2Ccond-mat%2F0311163%2Ccond-mat%2F0311488%2Ccond-mat%2F0311286%2Ccond-mat%2F0311533%2Ccond-mat%2F0311470%2Ccond-mat%2F0311472%2Ccond-mat%2F0311649%2Ccond-mat%2F0311068%2Ccond-mat%2F0311222%2Ccond-mat%2F0311033%2Ccond-mat%2F0311452%2Ccond-mat%2F0311447%2Ccond-mat%2F0311644%2Ccond-mat%2F0311288%2Ccond-mat%2F0311030%2Ccond-mat%2F0311392%2Ccond-mat%2F0311370%2Ccond-mat%2F0311529%2Ccond-mat%2F0311541%2Ccond-mat%2F0311207%2Ccond-mat%2F0311335%2Ccond-mat%2F0311110%2Ccond-mat%2F0311131%2Ccond-mat%2F0311561%2Ccond-mat%2F0311064%2Ccond-mat%2F0311508%2Ccond-mat%2F0311556%2Ccond-mat%2F0311552%2Ccond-mat%2F0311188%2Ccond-mat%2F0311298%2Ccond-mat%2F0311638%2Ccond-mat%2F0311072%2Ccond-mat%2F0311153%2Ccond-mat%2F0311297%2Ccond-mat%2F0311130%2Ccond-mat%2F0311425%2Ccond-mat%2F0311175%2Ccond-mat%2F0311520%2Ccond-mat%2F0311398%2Ccond-mat%2F0311285%2Ccond-mat%2F0311172%2Ccond-mat%2F0311204%2Ccond-mat%2F0311486%2Ccond-mat%2F0311273%2Ccond-mat%2F0311167%2Ccond-mat%2F0311220%2Ccond-mat%2F0311462%2Ccond-mat%2F0311165%2Ccond-mat%2F0311599%2Ccond-mat%2F0311141%2Ccond-mat%2F0311445%2Ccond-mat%2F0311200%2Ccond-mat%2F0311201%2Ccond-mat%2F0311009%2Ccond-mat%2F0311610%2Ccond-mat%2F0311464%2Ccond-mat%2F0311088%2Ccond-mat%2F0311217%2Ccond-mat%2F0311311%2Ccond-mat%2F0311280%2Ccond-mat%2F0311025%2Ccond-mat%2F0311478%2Ccond-mat%2F0311565%2Ccond-mat%2F0311052%2Ccond-mat%2F0311555%2Ccond-mat%2F0311568%2Ccond-mat%2F0311625%2Ccond-mat%2F0311364%2Ccond-mat%2F0311082%2Ccond-mat%2F0311223%2Ccond-mat%2F0311261%2Ccond-mat%2F0311600%2Ccond-mat%2F0311401%2Ccond-mat%2F0311212%2Ccond-mat%2F0311301%2Ccond-mat%2F0311354%2Ccond-mat%2F0311582%2Ccond-mat%2F0311554%2Ccond-mat%2F0311505%2Ccond-mat%2F0311545%2Ccond-mat%2F0311227%2Ccond-mat%2F0311346%2Ccond-mat%2F0311560&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "For the metals Au, Pt and Ir it is possible to form freely suspended\nmonatomic chains between bulk electrodes. The atomic chains sustain very large\ncurrent densities, but finally fail at high bias. We investigate the breaking\nmechanism, that involves current-induced heating of the atomic wires and\nelectromigration forces. We find good agreement of the observations for Au\nbased on models due to Todorov and coworkers. The high-bias breaking of atomic\nchains for Pt can also be described by the models, although here the parameters\nhave not been obtained independently. In the limit of long chains the breaking\nvoltage decreases inversely proportional to the length."}, "authors": ["R. H. M. Smit", "C. Untiedt", "J. M. van Ruitenbeek"], "author_detail": {"name": "J. M. van Ruitenbeek"}, "author": "J. M. van Ruitenbeek", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0957-4484/15/7/055", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0311439v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0311439v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0311439v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0311439v1", "journal_reference": "Nanotechnology, vol. 15 (2004) pp. S472 - S478.", "doi": "10.1088/0957-4484/15/7/055", "fulltext": "High-bias stability of monatomic chains\nR.H.M. Smit,1 C. Untiedt,1, 2 and J.M. van Ruitenbeek1\n\narXiv:cond-mat/0311439v1 [cond-mat.mes-hall] 19 Nov 2003\n\n1\n\nKamerlingh Onnes Laboratorium, Universiteit Leiden,\nPostbus 9504, 2300 RA Leiden, The Netherlands\n2\npresent address: Departamento de Fı́sica Aplicada, Universidad de Alicante,\nCampus de San Vincente del Raspeig, E-03690 Alicante, Spain\n(Dated: June 4, 2018)\nFor the metals Au, Pt and Ir it is possible to form freely suspended monatomic chains between\nbulk electrodes. The atomic chains sustain very large current densities, but finally fail at high bias.\nWe investigate the breaking mechanism, that involves current-induced heating of the atomic wires\nand electromigration forces. We find good agreement of the observations for Au based on models\ndue to Todorov and coworkers. The high-bias breaking of atomic chains for Pt can also be described\nby the models, although here the parameters have not been obtained independently. In the limit of\nlong chains the breaking voltage decreases inversely proportional to the length.\nPACS numbers: 65.80+n,68.65.-k,73.63.Rt\n\nI.\n\nINTRODUCTION\n\nAs the down-scaling of electronic components is advancing at an impressive rate, the general interest in dissipation and thermal transport at comparable scales is\nincreasing. Technical applications using these small scale\ndevices will have higher and higher densities of components making heat generation one of the biggest problems\nto overcome. We, therefore, need to develop a better\nfundamental understanding of the properties of matter\nat small size scales. A recent review1 on thermal transport at the nanoscale shows how fast this field has been\ngrowing during the last few years. It also shows that at\nscales of the order of several nanometers the quantum\nbehavior of matter starts to have a major impact on the\nthermal behavior of the sample. As an example, Yao et\nal.2 have shown that the current through a single-wall\ncarbon nanotube is saturating as the voltage reaches values of several volts, a behavior which is not expected\nfrom a simple down-scaling of classical effects.\nHere we study the thermal behavior of metals at the\nsmallest length-scales, below 1 nm. A review of results in\nthis field has recently appeared3 . In recent experiments it\nwas shown that some metals have the property of spontaneously forming monatomic chains just before rupture4,5 .\nAlthough atomic chains are intrinsically metastable, experiments at high bias voltages showed they have a surprising current-carrying capacity4 , and current densities\nup to 109 A/mm2 could be reached. Currently the\nlengths of these chains is limited to about seven atoms. A\nbetter understanding of dissipation and relaxation phenomena may lead the way to fabricate longer chains.\nWith these monatomic chains being nearly ideal onedimensional conductors this would provide means to further study the fundamental properties of conductors in\none dimension.\nIn the experiments described below we probe the stability of many individual monatomic chains by looking\nat their rate of survival at high bias voltages. Although\nthese nanowires due to their small size are ballistic, high\n\nbias results in a small probability for inelastic scattering of the electrons to phonons. Energy dissipation has\nbeen demonstrated to come into play when eV for the\nbias voltages applied is raised above the characteristic\nzone-boundary phonon energy6 . Energy dissipation will\ntake place on the scale of the electron-phonon scattering\nlength (typically ≫100 nm), but the number of scattering events per volume will be largest inside the atomic\nwire itself due to the large current density. As a consequence the average lattice vibration energy at the narrowest cross-section will be larger than anywhere else in the\ncontact, which can be viewed as an increased local effective temperature, Teff . This elevated local temperature\ncan lead to the rupture of the contact and is therefore an\nimportant parameter.\nThere have been several experimental attempts in measuring this local effective temperature inside metallic\npoint contacts, but it has been difficult to obtain quantitative results. Van den Brom et al.7 have exploited\nthe switching rate between two different configurations\nin atomic sized contacts. When the energy barrier between the two configurations is low enough (which is often found on the verge of an atomic reconstruction) the\nlocal temperature can activate the jumps between the\ntwo levels, and the switching rate is determined by the\nratio of the effective barrier and the thermal energy. To\nobtain the effective temperature from this switching rate\nan estimate of this barrier is required, which is difficult in\nview of the unknown atomic configurations. In order to\ncircumvent this problem the switching rate between the\ntwo states was followed while changing the bias voltage\nand the bath temperature independently8 . A comparison\nbetween the changes in the switching rates in these two\ncases would provide a calibration of the relation between\nthe bias voltage and the effective temperature. However, the thermal expansion in the electrodes due to the\nchanging temperature changes the atomic configuration\nconsiderably, making it difficult to draw definite conclusions.\nHere we discuss measurements of the fracture rate of\n\n\f2\natomic chains as a function of the voltage bias. The advantage over previous work on Teff in atomic-sized conductors is that they are free of lattice imperfections and\nimpurities and the structure is known, except for the configuration at the end points. The energy barrier that\nhas to be considered in the process is therefore less complex. Moreover, it is possible to consider chains of various lengths, which provides us with a control parameter\nof the point contact geometry.\nThe paper is organized as follows. After some details\non the experimental techniques we show in section III\nthat the breaking of an ensemble of chains cannot be\ndescribed by a simple activated process. We argue (section IV) that there are a number of parameters involved\nthat lead to a distribution of Boltzmann factors and we\nshow that the observed distribution in breaking voltages\ncan be fairly well described without adjustable parameters. One of the assumptions, here, is that there is a\nvariation in effective barriers to breaking as a result of a\ndistribution of tensile forces in the chains. We verify this\nassumption in section V by comparison to the measured\nphonon mode energy in the chains, which reflects the actual tensile force in the monatomic wire. All experiments\nto this point were done on gold chains and this is compared to results for platinum in section VI, which can\nonly be qualitative for lack of data available in the literature. We conclude (section VII) that we have a fairly\ngood description of Joule heating in these atomic-sized\nconductors and we obtain a realistic estimate for the lattice temperature at finite bias.\n\nII.\n\nEXPERIMENTAL TECHNIQUES\n\nThe experiments have been performed using the\nMechanically Controllable Break Junction (MCBJ)\ntechnique9 . By this technique one breaks a wire of the\ndesired metal in a controlled fashion with the use of a\npiezo-electric element. The wire is only broken once the\nsample is under vacuum and the temperature in the vacuum chamber is stable at 4.2 K. Thermal contact to the\nsample is provided by a copper finger in order to avoid\nusing thermal contact gas. The advantages of the MCBJ\ntechnique are, firstly, a large mechanical stability due to\nthe small mechanical loop connecting the two wire ends.\nThis can be of crucial importance when one tries to determine the stability of monatomic chains. Secondly, the\ncryogenic vacuum without use of thermal exchange gases\nascertains the absence of gas molecules in the environment that could lead to additional cooling of the contact\nand contamination of the metal nanowire. Our relying on\ncryogenic vacuum has the disadvantage that we cannot\nincrease the temperature of the experiment much since\nthis would lead to a deterioration of the vacuum. The\ngold and platinum wires used here have a purity of at\nleast 99.998 %.\nChains of atoms were produced in the following way.\nDuring the breaking of the wire by use of the piezo-\n\nelement the wire conductance decreases in steps10 , which\nhave been shown to be due to atomic reconfigurations11.\nThe last plateau in the conductance, observed just before the conductance suddenly drops to a negligible value\nand the wire is broken, is generally due to a contact with\nthe cross section of a single atom12 . When the length\nof this plateau exceeds the typical length for a single\natom it can be considered as a measure for the length of\nan atomic chain being formed4,13 . In order to fabricate\natomic chains of a given length L the process is repeated\nas long as the contact breaks before the plateau (and\nchain) reaches the desired length: The two electrodes are\npushed together again to reestablish a big contact and\na new atomic contact is pulled out. When after several\nattempts the desired chain-length is reached the piezo\nmovement is halted and measurements on the properties\nof the atomic chain are started. During this procedure\nthe conductance of the atomic contact is measured using\na constant bias voltage of the order of 10 mV.\nThe effective length L that we will use as a parameter below refers to the length of the last plateau in the\nconductance, as was done in previous studies4,13 . The\nlength measures the stretching of the contact from the\npoint where the conductance first drops to the value of\na single-atom contact. It is widely accepted that the\nstarting point corresponds to a contact of one atom. Depending on the detailed evolution of the chain a plateau\nlength of L = 0.5 nm for gold would have two or three\natoms in a row, and L = 1 nm would have four or five\natoms. Some recent model calculations14,15 suggest that\nthe structure of the contact at the starting point of a\nplateau can be viewed as two electrodes ending in a single atom and touching vertex-atom to vertex-atom which\nwould make the chains one atom longer, but this remains\nto be verified experimentally.\nIII.\n\nRATE OF DECAY OF ATOMIC CHAINS\n\nOne would expect the stability of the monatomic chain\nto be determined by the ratio of the energy barrier\nagainst breaking, W , and the effective temperature, Teff .\nA population, P, of chains would then show an exponential decay as a function of time, t,\nP(t) = P(0)*exp(−t/τ ),\n\nτ=\n\n1\nexp(W/kB Teff ), (1)\nf\n\nwhere f is the frequency by which the system attempts\nto overcome the barrier. In estimates and simulations\ngiven below we will take f = 3.5 × 1012 Hz, a typical\nphonon frequency for monatomic gold chains6,16 .\nIn order to investigate this stability by a simple experiment the decay of a population of monatomic gold chains\nwas followed as a function of time. The moment a chain\nof the desired length is created is taken as t = 0 and the\ntime until the chain spontaneously breaks was stored for\na set of consecutively formed chains. The evolution of\nthe number of surviving chains as a function of time, out\n\n\f3\n\nPopulation (normalized)\n\n1,0\n\n1,0\n0,8\n\n0,9\n\n0,6\n\n0,8\n\n0,4\n0,2\n\n0,7\n\n0,0\n\n0,01\n\n0,6\n\n0,1\n\n1\n\n10\n\n0,5\n0\n\n10\n\n20\n\n30\n\ntime (s)\n\nterm is motivated by model calculations by Todorov et\nal.17,18 Using a single-orbital tight-binding model they\nhave shown that the barrier against breaking reduces linearly with voltages up to 1 V. More recent calculations\nbased on density functional theory by Brandbyge et al.19\nhave shown that the electromigration force can be highly\nnon-linear. However, for many configurations it will be a\nreasonable approximation.\nApart from a variation in the energy barrier we should\nalso consider the local effective temperature at the point\ncontact. For vanishing bias voltages the effective temperature approaches the bath temperature, T0 . Beyond\na certain threshold voltage it should rise due to a voltagedriven term, TV . Following reference 17 we describe the\nlocal effective temperature of the atomic contact as:\nTeff = (T04 + TV4 )1/4 .\n\nFIG. 1: The number of monatomic chains remaining intact\nas a function of time out of an initial population of 100. The\ninset shows the same data on a logarithmic time-axis. The\nresults were obtained for monatomic gold chains with an effective length of 0.4 nm, at a temperature of 4.2 K and at a\nconstantly applied bias voltage of 200 mV.\n\nof an initial population of 100, is presented in figure 1.\nClearly, the observed dependence is not described by the\nexpected exponential decay. The inset in figure 1 shows\nthat it actually more closely follows a logarithm. A logarithm can be obtained if we consider for the chains in\nthe population a distribution of barriers, a distribution\nof effective temperatures, or both. Note that the characteristic time for breaking is influenced by the applied\nbias voltage, which is 200 mV in the example of figure 1.\nNear zero bias the lifetime of atomic chains at 4.2 K is\nmainly limited by the patience of the experimentalist.\nIV.\n\nA DISTRIBUTION OF BOLTZMANN\nFACTORS\n\nThe distribution of lifetimes for given effective length\nL observed in figure 1 may result from a variation in\nthe energy barrier W of the chain, which is likely due\nto variation in the tensile force. From the fact that a\nchain will always break when the tensile force exerted is\nlarge enough, one can conclude that the effective barrier\nheight must decrease with force. As shown by the force\nmeasurements on monatomic chains performed by Rubio\net al.11 the force varies strongly while pulling to form a\nchain, and will sensitively depend on the atomic configurations at the connection points to the banks. Assuming\na dominant lowest order (linear) term the barrier energy\ncan be written as\nW = W0 − α|V | − β|F |,\n\n(2)\n\nwhere W0 is the equilibrium barrier energy. We have also\nincluded a linear decrease of the barrier due to electromigration upon application of a bias voltage V . This\n\n(3)\n\nAn estimate for the dependence of TV on voltage can\nbe obtained from an earlier paper by Todorov20. Three\nterms are included in the estimate: (1) Heating by the\nelectrons due to creation of phonons in the atomic wire,\n(2) the cooling by the electrons due to absorbtion of\nphonons, and (3) cooling by the thermal transport of energy away from the point contact into the metal banks.\nIf only the first two terms are included the temperature is simply proportional to the voltage, kB Teff ≃ eV ,\nwhere it has been assumed that electrons exchange at\nmost a single quantum of vibration energy. Note that\nrecent experimental work by Zhitenev et al.21 on molecular junctions indicates that several vibrational quanta\ncan be deposited per electron. However, this effect can\nbe attributed to the relatively long residing times of the\nelectrons inside the molecular bridge22 . Earlier experimental work on phonon spectroscopy in monatomic gold\nchains6 shows that multiple phonon scattering is negligibly small for these ballistic wires, in agreement with the\nassumption by Todorov.\nAn effective temperature kB Teff ≃ eV would correspond to thousands of Kelvins at commonly employed\nbias voltages. However, the third term, the thermal conduction to the banks, limits the heating considerably. It\nis more difficult to make precise estimates, but when the\nbehavior of the banks is taken to follow the bulk heat\nconduction and heat capacity we obtain20\np\nTV = γ L|V |\n(4)\n\nwhere γ is a proportionality constant given as γ =\n60 K V−1/2 nm−1/2 and L is the length of the chain. This\nwas qualitatively confirmed by an independent approach\nby Chen et al.23 .\nIn order to investigate experimentally the effect of bias\nvoltage heating on the stability of the chains, taking a distribution of wire properties into account, we proceeded\nas follows. First chains of the desired length are produced following the procedure described above. This is\ndone at a bias voltage of 10 mV, a value which is below the typical electron-phonon excitation energy6 . This\n\n\f4\n70\n\nL = 0.5 nm\nExperiment\nSimulation\n\nCounts\n\n60\n50\n40\n30\n20\n10\n0\n0,0\n\n0,5\n\n70\n\n1,0\n1,5\n2,0\nBreak voltage (V)\n\n2,5\n\nL = 1.0 nm\nExperiment\nSimulation\n\n60\nCounts\n\n50\n40\n30\n20\n10\n0\n0,0\n\n0,5\n\n1,0\n1,5\n2,0\nBreak voltage (V)\n\n2,5\n\nFIG. 2: A distribution of the number of gold atomic chains\nas a function of bias voltage at which they were observed to\nbreak. The upper panel shows the experimental and simulated result for 500 chains with L = 0.5 nm long at a temperature of 4.2 K, while the lower panel shows similar data for\nchains of L =1.0 nm long.\n\nensures that the effective temperature in the point contact will remain close to the bath temperature. Once a\nchain has been formed we wait for 1 s to see whether the\nchain is indeed stable. Next, the voltage is ramped with\na constant speed of about 1 V/s until the chain breaks.\nThe bias voltage at breaking is stored and it is reset to\n10 mV. The electrodes are then pushed together again\nto repeat the experiment for the next chain. The results for such an experiment are represented in figure 2.\nThe top panel shows a histogram constructed from the\nmeasured bias voltages at breaking for a set of 500 gold\natomic chains with L = 0.5 nm. The distribution clearly\npeaks at 1.2 V with a full width at half maximum of 0.6 V.\nThe lower panel shows a similar set of experimental results for chains of L = 1.0 nm in length. In this case\nwe observe two peaks in the distribution, one at low bias\nrepresenting a large fraction of chains that break early,\nand a second peak at 0.8 V. A possible dependence on\nthe voltage ramp speeds was not investigated, but earlier work found negligible influence of this parameter in\natomic contacts24 .\nWe have suggested above that the breaking of the\n\natomic chains can be described as a thermally activated\nprocess. However, for this we need to verify that the\nenergy barrier is not significantly modified by thermal\nexpansion due to the rising of the local effective temperature at high bias voltage. In a test we measured two\nsets of 500 atomic chains. With the first set the bias\nvoltage was suddenly increased from 15 to 800 mV once\nthe chains had been formed. A large number of chains\nwas seen to break following a similar logarithmic time\ndependence as displayed in figure 1. With the second set\nwe suddenly dropped the voltage from 300 to 50 mV after which we observed not a single chain breaking. Note\nthat a higher bias should lead to thermal expansion of\nthe electrodes25 and thus to a smaller tensile stress than\nat low bias. These two tests show that the influence of\nthe thermal expansion on the energy barrier, if present,\nis dominated by the thermally activated breaking.\nIn order to compare the results of figure 2 with the\nproposed model for the variation of the energy barrier\nand effective temperature on bias voltage we need realistic estimates for the constants in equation 2. We adopt\nthe values W0 = 0.738 eV and α = 0.14 eV/V obtained\nin reference 17 from a non-equilibrium tight-binding calculation for a gold atomic chain. The value for β in\nequation 2 can be estimated from the results by Rubio et\nal.11 They found that gold atomic chains typically break\nat a tensile force of 1.5 nN. At the point of breaking the\nlifetime, τ , of a chain has been reduced to the experimental time scale, which is ∼ 0.1 s in the experiments of\nreference 11. The local effective temperature at the point\ncontact will be given by the bath temperature in view of\nthe low bias voltage of 10 mV used in these experiments.\nFor τ = 0.1 s and Teff = T0 = 4.2 K we obtain from equation 1 an average barrier of 0.011 eV at breaking. The\nbarrier of 0.738 eV therefore nearly vanishes under the\ninfluence of a tensile force of 1.5 nN, resulting in a value\nof β = 0.49 eV/nN.\nWe will now see whether the combination of these values give a reasonable description of the experimental results of figure 2. We assume here that the only missing,\ni.e. not measured, parameter is the tensile force. The average tensile force on an atomic chain can be estimated\nfrom figure 1 in reference 11 to be 0.95 ± 0.15 nN. We\nperformed a numerical simulation of these data based\non equations 1 to 4 and using a normal distribution of\nforces with a mean value of 0.95 nN and a standard deviation of 0.15 nN, which produces the distribution presented in figure 2. The peak position and width agree\nvery well with those observed in the experiment. Note\nthat all parameters have been obtained from independent\nmodel calculations and experimental data, so that there\nare no adjustable parameters. For an effective length\nL =1 nm (lower panel) the peak in the numerical simulation is slightly higher than observed. A more significant\ndisagreement is in the width of the distribution, which is\nabout twice as large in the numerical result, and also the\npeak at zero bias remains unexplained. Nevertheless, the\nqualitatively agreement obtained using literature values\n\n\f5\nPeak in break voltage (V)\n\n1,4\n\nV.\n\n1,2\n1,0\n0,8\n0,6\n\nAu:\nExperiment\nSimulation\n\n0,4\n0,2\n0,0\n0,0\n\n0,2\n\n0,4\n\n0,6\n\n0,8\n\n1,0\n\n1,2\n\nChain length (nm)\nFIG. 3: Position of the maximum in the distribution of breaking voltages (figure 2) for monatomic gold chains as a function\nof their effective length. The bullets represent the experimental results obtained by fitting a Gaussian curve to each\npopulation formed by 500 chains. The curve is a numerical\nsimulation, as described in the text.\n\nfor the parameters suggests that we have at least captured some of the physics involved. Thus, this analysis\nsuggests that the broad distribution in breaking voltages\nis mainly caused by the large distribution of tensile forces\nin an ensemble of atomic chains. The processes leading to\nthe relatively unstable chains breaking at very low voltages is unclear as of yet. A possible explanation would be\na large portion of chains quickly breaking when the bias\nvoltage reaches the threshold value of the lowest phonon\nmode in the point contact.\nIn order to follow the length dependence in more detail we have constructed histograms similar to the ones\nshown in figure 2 for many chain-lengths. From the histograms we extract the position of the maximum of the\ndistribution at finite bias and plot this as a function of\nlength. This dependence is depicted in figure 3 and shows\nthat the average breaking voltage decreases from 1.2 V at\nL = 0.45 nm to just below 0.6 V at L = 1.25 nm.\nWith the same values for the model parameters as used\nabove we obtained the curve shown in figure 3. In view\nof the fact that there are no free parameters the agreement between the model and experiment is surprisingly\ngood, although the values at greater length demonstrate\na larger deviation. The reason for the deviation may be in\nthe model or the choice of parameters. However, one aspect that we have ignored and that should become important for longer chains is the contribution of the entropy.\nThe larger number of bonds present in longer chains will\nreduce the effective barrier26.\n\nTEST OF THE VARIATION IN TENSILE\nFORCES\n\nIn order to test whether the width in the experimental distribution at higher bias voltages is the result of a\nvariation in the tensile forces one would like to be able\nto measure the forces in the point contact. The MCBJ\nin its original configuration is not suitable to determine\nthese, but it is possible to obtain some information in an\nindirect way using Point Contact Spectroscopy (PCS)27 .\nBy this technique one probes the differential conductance\ndI/dV as a function of voltage using a small modulation\nsuperimposed on the dc bias ramp. As soon as the excess\nenergy, eV , of the electrons shooting through the point\ncontact becomes larger than the energy of a phonon mode\ninside the contact a new channel for back-scattering sets\nin resulting in a sudden reduction of the conductance.\nThis technique was applied to atomic contacts by Untiedt\net al.28 and to monatomic gold chains by Agraı̈t et al.6 ,\nwho showed that the observed phonon energy decreases\nwhen the tensile force on the chain is increased. This is\nas intuitively expected: As the tensile force F increases\nthe distance between the atoms a in the chain increases\nleading to a weaker bond and a lower stiffness κ = dF/da.\nSince the observed\n√ longitudinal phonon mode energy is\nproportional to κ the phonon frequency changes accordingly.\nWe make use of this effect in the following experiment.\nFirst we produce a chain of the desired length via the procedure described above. Next, a point contact spectrum\nis recorded by measuring the differential conductance as\na function of bias voltage in the interval between -50 and\n+50 mV, using a lock-in amplifier. Some chains are lost\nduring this procedure due to an increase of the effective\ntemperature caused by the increased bias voltage. When\nthis happens the data are discarded and a new chain is\nformed. After having measured the differential conductance the bias voltage is ramped up similar as in the previous experiment, at a rate of 1 V/s. The data are stored\nand analyzed after collecting a large set of curves. For\nall point contact spectra that show a clear phonon signal\nthe phonon frequency can be compared to the breaking\nvoltage. The data are then sorted according to the observed phonon frequencies and collected in bins of 1 meV\nwide. For the data within each bin the average breaking\nvoltage and its standard deviation are evaluated.\nFigure 4 shows the average breaking voltage as a function of the observed phonon frequencies, where the error\nbars on each data point represent the standard deviation.\nFor a small fraction of about 2% of the spectra more than\none phonon frequency could be identified, and these were\nnot taken into account in figure 4. The break voltage in\nthe graph clearly rises as a function of phonon energy,\njust as is expected. For a higher phonon frequency the\nforce constant κ is higher and the chain is expected to\nbe less strained, and thus the energy barrier to breaking is higher. The distribution of breaking voltages at\neach phonon energy is still quite broad. From this ob-\n\n\f6\n400\n40\n\n20\n\n0,4\n10\n\n0,2\n0,0\n\n0\n\n10\n\n12\n\n14\n\n16\n\n18\n\n20\n\nPhonon energy (meV)\n\nFIG. 4: Average breaking voltage of gold chains with an\neffective length of 0.9 nm as a function of the observed phonon\nfrequency (bullets). The bars indicate the number of data\npoints used to obtain the average (right axis). The standard\ndeviation in the break voltage for each phonon frequency is\nrepresented by the size of the error bar.\n\nservation one can conclude that the tensile force indeed\nplays the expected role on the stability, but that there\nare still other parameters that influence the survival rate\nof atomic chains at high bias voltage. Such parameters\ncould be variations in the shape of the leads giving rise to\ndifferences in thermal conduction and effective temperatures. Also, various atomic configurations of the leads at\nthe connection points to the chain may give rise to different equilibrium values for the barrier at zero voltage\nand zero strain, W0 . This may also lead to a variation\nin the dependence of the barrier on bias voltage via electromigration forces.\n\nVI.\n\nPLATINUM\n\nGold is not unique in forming atomic chains and it is\nnow known that this property is shared with Pt and Ir29 .\nIn contrast to Au, Pt is a metal with both a significant\ndensity of s and of d-electrons at the Fermi energy. The\nbehavior for Pt could therefore deviate from the results\npredicted by the model presented above, since the theory was largely based on the single-orbital tight-binding\nstudies by Todorov et al.17 .\nThe inset of figure 5 shows a histogram of breaking\nvoltages for 500 Pt atomic chains, measured by the same\nmethod as figure 2 for Au. Since the conductance for\nPt single-atom contacts or monatomic chains is not as\nsharply defined near a quantum unit of conductance as\nis the case for Au the length of the atomic chain is less obviously defined. This problem was discussed and successfully addressed in reference 29 and we employ the same\napproach for determining the effective chain length. Although the results in figure 5 are largely similar to those\nobtained for Au they differ in some respects. First, for\n\n350\n\n60\nCounts\n\n30\n\n0,6\n\nBreak Voltage (mV)\n\n0,8\n\n80\n\nNumber of chains\n\nMean break voltage (V)\n\n1,0\n\n300\n\n40\n20\n\n250\n\n0\n\n200\n150\n100\n0,0\n\n0\n\n1\n2\n3\nBreak Voltage (mV)\n\n4\n\nPlatinum\n\n0,2\n\n0,4 0,6 0,8 1,0\nEffective length (nm)\n\n1,2\n\n1,4\n\nFIG. 5: The main panel shows the evolution of the maximum\nin the distribution of breaking voltages (illustrated for 500\nchains of length L = 1.0 nm in the inset) for Pt atomic chains\nas a function of length. Filled squares show the data points\nthat are in the same interval as measured for Au in figure 3;\nopen squares represent data points outside this interval. The\nfull curve shows the result of the model calculation described\nin the text.\n\nan effective length of L = 1.0 nm the position of the maximum is now located at 0.17 V, much lower than found\nfor Au, while the width of 0.12 V is only slightly smaller.\nAlso, the fraction of chains breaking at very low currents\nis significantly smaller.\nJust as for Au one can follow the position of the maximum in the breaking currents as a function of length.\nSuch a graph is presented in figure 5, where the filled\ndata points represent data in the same length interval\nthat was also measured for Au, while the open symbols\nare at smaller lengths. This is to emphasize that the differences in behavior are less dramatic than a comparison\nof the two figures may suggest. The rapid rise towards\nsmaller lengths may not be unique for Pt. We would like\nto use again equations 2 through 4 to describe the experimental results for the breaking voltage as a function of\nlength. However, in contrast to Au most parameters in\nthe model cannot be found in the literature. Therefore,\nwe take a slightly different approach and start from the\nassumption that all chains break as soon as their mean\nlifetime becomes of the order of the characteristic experimental time-scale. We further assume that the effective\ntemperature at breaking is much larger than the bath\ntemperature, so that Teff ≃ TV . Combining equations 2\n– 4 we obtain\n!\n1\nWF − α|V |\np\nτ = exp\n,\n(5)\nf\nkB γ L|V |\n\nwhere WF = W0 − βh|F |i represents the barrier against\nbreaking averaged over a distribution of forces. We set\nτ equal to an experimental time scale of 10 ms, but the\nchoice affects the results only logarithmically. Taking\nWF = 0.23 eV, (note, this is W0 reduced by the averaged\n\n\f7\nstrain) γ = 200 KV−1/2 nm−1/2 and α = 0.39 eV/V, a set\nof values which is within reasonable limits, the resulting\ncurve shown in figure 5 describes the experimental data\nquite well. This set of values is not unique as can be seen\nfrom inspection of equation 5: the values of α, γ and WF\ncan be scaled by an arbitrary constant. Yet, we can find\nreasonable values for the constants and obtain a good\nqualitative description of the data using the same model\nas for Au above. For L → 0 the break voltage assumes a\nvalue WF /α while for large L the break voltage decreases\nas 1/L, but is expected to saturate when eV approaches\nthe characteristic phonon energies of the chain.\nVII.\n\nCONCLUSIONS\n\nWe have studied monatomic chains for Au and Pt and\nfind a systematic dependence of the characteristic chainbreaking voltage vs the chain length. Atomic chains sustain surprisingly large current densities, but the maximum current (or voltage) decreases as the chain length\ngrows. We have adopted a model proposed by Todorov\nand coworkers and find a satisfactory agreement with\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\nCahill D G, Ford w K, Goodson K E, Mahan G D, Majumdar A, Maris H J, Merlin R and Phillpot S R 2003 J.\nAppl. Phys. 93 793\nYao Z, Kane C L and Dekker C 2000 Phys. Rev. Lett. 84\n2941\nAgraı̈t N, Levy Yeyati A and van Ruitenbeek J M 2003\nPhys. Rep. 377 81\nYanson A I, Rubio Bollinger G, van den Brom H E, Agraı̈t\nN and van Ruitenbeek J M 1998 Nature 395 783\nOhnishi H, Kondo Y and Takayanagi K 1998 Nature 395\n780\nAgraı̈t N, Untiedt C, Rubio-Bollinger G and Vieira S 2002\nChem. Phys. 281 231\nvan den Brom H, Yanson A I and van Ruitenbeek J M\n1998 Physica B 252 69\nvan den Brom H E, Noat Y and van Ruitenbeek J M\n2001 In: Kondo Effect and Dephasing in Low-Dimensional\nMetallic Systems Chandrasekhar V, van Haesendonck C\nand Zawadowski A, editors (Kluwer Academic Publishers,\nDordrecht) 249\nvan Ruitenbeek J M, Devoret M H, Esteve D and Urbina\nC 1997 Phys. Rev. B 56 12566\nMuller C J, van Ruitenbeek J M and de Jongh L J 1992\nPhys. Rev. Lett. 69 140\nRubio-Bollinger G, Bahn S R, Agraı̈t N, Jacobsen K W\nand Vieira S 2001 Phys. Rev. Lett. 87 026101\nKrans J M, Muller C J, Yanson I K, Govaert Th C M,\nHesper R and van Ruitenbeek J M 1993 Phys. Rev. B 48\n14721\nUntiedt C, Yanson A I, Grande R, Rubio-Bollinger G,\nAgraı̈t N, Vieira S and van Ruitenbeek J M 2002 Phys.\nRev. B 66 85418\n\nthe observations. Especially for gold the agreement is\nsurprisingly good in view of the fact that we have not\nused any adjustable parameter. Yet, there are deviations that are not captured by the model and that require further study. For Pt the general behavior of the\naverage breaking voltage as a function of length can also\nbe closely described by the model, although the parameters have not been independently verified. The agreement obtained inspires confidence in equations 3 and 4\nand we can now estimate the effective (lattice) temperature inside the atomic wire. It rises proportional to the\nsquare root of of the bias voltage for sufficiently large\nbias and for a monatomic gold chain of length L = 1 nm\nat V = 1 V it reaches a temperature of 60 K, which is\nwell above the bath temperature of 4.2 K.\nWe thank M. Pohlkamp and M. Heijdra for valuable\nassistance with the experiments and gratefully acknowledge discussions with T.N. Todorov, J. Hoekstra and A.P.\nSutton. This work is part of the research program of the\n\"Stichting FOM,\". C.U. has been supported by the European Union under contract No. HPMF-CT-2000-00724\nand by the Spanish 'Ramón y Cajal' program of the\nMCyT.\n\n14\n\n15\n\n16\n\n17\n\n18\n19\n\n20\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\nJelinek P, Perez R, Ortega J and Flores F 2003 Phys. Rev.\nB 68 085403\nNakamura A, Brandbyge M, Hansen L B and Jacobsen K\nW 1999 Phys. Rev. Lett. 82 1538\nMontgomery M J, Hoekstra J, Todorov T N and Sutton A\nP 2003 J. Phys.: Condens. Matter 15 731\nTodorov T N, Hoekstra J and Sutton A P 2001 Phys. Rev.\nLett. 86 3606\nTodorov T N 2002 J. Phys.: Condens. Matter 14 3049\nBrandbyge M, Stokbro K, Taylor J, Mozos J-L and Ordejón P 2003 Phys. Rev. B 67 193104\nTodorov T N 1998 Philosophical Magazine B 77 965\nZhitenev N B, Meng H and Bao Z 2002 Phys. Rev. Lett.\n88 226801\nAji V, Moore J E and Varma C M 2003 Preprint\ncond-mat/0302222\nChen Y-C, Zwolak M and Di Ventra M 2003 Preprint\ncond-mat/0302425\nNielsen S K 2002 PhD thesis, University of Aarhus, Denmark\nKolesnychenko O Yu, Toonen A J, Shklayarevskii O I and\nvan Kempen H 2001 Appl. Phys. Lett. 79 2707\nHageman J C L, de Wijs G A, de Groot R A and Meier R\nJ 2000 Macromolecules 33 9098\nYanson I K 1974 Zh. Eksp. Teor. Fiz. 66 1035 [Sov. Phys.JETP 39 506]\nUntiedt C, Rubio Bollinger G, Vieira S and Agraı̈t N 2000\nPhys. Rev. B 62 9962\nSmit R H M, Untiedt C, Yanson A I and van Ruitenbeek\nJ M 2001 Phys. Rev. Lett. 87 266102\n\n\f"}