{"id": "http://arxiv.org/abs/cond-mat/0106156v2", "guidislink": true, "updated": "2001-11-12T19:59:08Z", "updated_parsed": [2001, 11, 12, 19, 59, 8, 0, 316, 0], "published": "2001-06-08T11:50:43Z", "published_parsed": [2001, 6, 8, 11, 50, 43, 4, 159, 0], "title": "Towards the Evaluation of the Relevant Degrees of Freedom in Nonlinear\n  Partial Differential Equations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0106323%2Ccond-mat%2F0106384%2Ccond-mat%2F0106016%2Ccond-mat%2F0106354%2Ccond-mat%2F0106123%2Ccond-mat%2F0106373%2Ccond-mat%2F0106379%2Ccond-mat%2F0106521%2Ccond-mat%2F0106558%2Ccond-mat%2F0106240%2Ccond-mat%2F0106013%2Ccond-mat%2F0106142%2Ccond-mat%2F0106235%2Ccond-mat%2F0106431%2Ccond-mat%2F0106607%2Ccond-mat%2F0106061%2Ccond-mat%2F0106529%2Ccond-mat%2F0106039%2Ccond-mat%2F0106204%2Ccond-mat%2F0106041%2Ccond-mat%2F0106282%2Ccond-mat%2F0106588%2Ccond-mat%2F0106372%2Ccond-mat%2F0106631%2Ccond-mat%2F0106313%2Ccond-mat%2F0106066%2Ccond-mat%2F0106444%2Ccond-mat%2F0106656%2Ccond-mat%2F0106156%2Ccond-mat%2F0106586%2Ccond-mat%2F0106597%2Ccond-mat%2F0106285%2Ccond-mat%2F0106194%2Ccond-mat%2F0106137%2Ccond-mat%2F0106627%2Ccond-mat%2F0106516%2Ccond-mat%2F0106020%2Ccond-mat%2F0106102%2Ccond-mat%2F0106401%2Ccond-mat%2F0106584%2Ccond-mat%2F0106220%2Ccond-mat%2F0106227%2Ccond-mat%2F0106179%2Ccond-mat%2F0106419%2Ccond-mat%2F0106355%2Ccond-mat%2F0106578%2Ccond-mat%2F0106524%2Ccond-mat%2F0106359%2Ccond-mat%2F0106368%2Ccond-mat%2F0106487%2Ccond-mat%2F0106378%2Ccond-mat%2F0106221%2Ccond-mat%2F0106324%2Ccond-mat%2F0106331%2Ccond-mat%2F0106387%2Ccond-mat%2F0106049%2Ccond-mat%2F0106434%2Ccond-mat%2F0106511%2Ccond-mat%2F0106559%2Ccond-mat%2F0106143%2Ccond-mat%2F0106460%2Ccond-mat%2F0106320%2Ccond-mat%2F0106263%2Ccond-mat%2F0106257%2Ccond-mat%2F0106596%2Ccond-mat%2F0106406%2Ccond-mat%2F0106382%2Ccond-mat%2F0106489%2Ccond-mat%2F0106557%2Ccond-mat%2F0106094%2Ccond-mat%2F0106087%2Ccond-mat%2F0106315%2Ccond-mat%2F0106605%2Ccond-mat%2F0106248%2Ccond-mat%2F0106207%2Ccond-mat%2F0106074%2Ccond-mat%2F0106216%2Ccond-mat%2F0106291%2Ccond-mat%2F0106482%2Ccond-mat%2F0106541%2Ccond-mat%2F0106113%2Ccond-mat%2F0106478%2Ccond-mat%2F0106211%2Ccond-mat%2F0106533%2Ccond-mat%2F0106403%2Ccond-mat%2F0106005%2Ccond-mat%2F0106031%2Ccond-mat%2F0106159%2Ccond-mat%2F0106107%2Ccond-mat%2F0106550%2Ccond-mat%2F0106165%2Ccond-mat%2F0106188%2Ccond-mat%2F0106364%2Ccond-mat%2F0106050%2Ccond-mat%2F0106009%2Ccond-mat%2F0106190%2Ccond-mat%2F0106174%2Ccond-mat%2F0106461%2Ccond-mat%2F0106498%2Ccond-mat%2F0106318%2Ccond-mat%2F0106424&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Towards the Evaluation of the Relevant Degrees of Freedom in Nonlinear\n  Partial Differential Equations"}, "summary": "We investigate an operator renormalization group method to extract and\ndescribe the relevant degrees of freedom in the evolution of partial\ndifferential equations. The proposed renormalization group approach is\nformulated as an analytical method providing the fundamental concepts of a\nnumerical algorithm applicable to various dynamical systems. We examine\ndynamical scaling characteristics in the short-time and the long-time evolution\nregime providing only a reduced number of degrees of freedom to the evolution\nprocess.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0106323%2Ccond-mat%2F0106384%2Ccond-mat%2F0106016%2Ccond-mat%2F0106354%2Ccond-mat%2F0106123%2Ccond-mat%2F0106373%2Ccond-mat%2F0106379%2Ccond-mat%2F0106521%2Ccond-mat%2F0106558%2Ccond-mat%2F0106240%2Ccond-mat%2F0106013%2Ccond-mat%2F0106142%2Ccond-mat%2F0106235%2Ccond-mat%2F0106431%2Ccond-mat%2F0106607%2Ccond-mat%2F0106061%2Ccond-mat%2F0106529%2Ccond-mat%2F0106039%2Ccond-mat%2F0106204%2Ccond-mat%2F0106041%2Ccond-mat%2F0106282%2Ccond-mat%2F0106588%2Ccond-mat%2F0106372%2Ccond-mat%2F0106631%2Ccond-mat%2F0106313%2Ccond-mat%2F0106066%2Ccond-mat%2F0106444%2Ccond-mat%2F0106656%2Ccond-mat%2F0106156%2Ccond-mat%2F0106586%2Ccond-mat%2F0106597%2Ccond-mat%2F0106285%2Ccond-mat%2F0106194%2Ccond-mat%2F0106137%2Ccond-mat%2F0106627%2Ccond-mat%2F0106516%2Ccond-mat%2F0106020%2Ccond-mat%2F0106102%2Ccond-mat%2F0106401%2Ccond-mat%2F0106584%2Ccond-mat%2F0106220%2Ccond-mat%2F0106227%2Ccond-mat%2F0106179%2Ccond-mat%2F0106419%2Ccond-mat%2F0106355%2Ccond-mat%2F0106578%2Ccond-mat%2F0106524%2Ccond-mat%2F0106359%2Ccond-mat%2F0106368%2Ccond-mat%2F0106487%2Ccond-mat%2F0106378%2Ccond-mat%2F0106221%2Ccond-mat%2F0106324%2Ccond-mat%2F0106331%2Ccond-mat%2F0106387%2Ccond-mat%2F0106049%2Ccond-mat%2F0106434%2Ccond-mat%2F0106511%2Ccond-mat%2F0106559%2Ccond-mat%2F0106143%2Ccond-mat%2F0106460%2Ccond-mat%2F0106320%2Ccond-mat%2F0106263%2Ccond-mat%2F0106257%2Ccond-mat%2F0106596%2Ccond-mat%2F0106406%2Ccond-mat%2F0106382%2Ccond-mat%2F0106489%2Ccond-mat%2F0106557%2Ccond-mat%2F0106094%2Ccond-mat%2F0106087%2Ccond-mat%2F0106315%2Ccond-mat%2F0106605%2Ccond-mat%2F0106248%2Ccond-mat%2F0106207%2Ccond-mat%2F0106074%2Ccond-mat%2F0106216%2Ccond-mat%2F0106291%2Ccond-mat%2F0106482%2Ccond-mat%2F0106541%2Ccond-mat%2F0106113%2Ccond-mat%2F0106478%2Ccond-mat%2F0106211%2Ccond-mat%2F0106533%2Ccond-mat%2F0106403%2Ccond-mat%2F0106005%2Ccond-mat%2F0106031%2Ccond-mat%2F0106159%2Ccond-mat%2F0106107%2Ccond-mat%2F0106550%2Ccond-mat%2F0106165%2Ccond-mat%2F0106188%2Ccond-mat%2F0106364%2Ccond-mat%2F0106050%2Ccond-mat%2F0106009%2Ccond-mat%2F0106190%2Ccond-mat%2F0106174%2Ccond-mat%2F0106461%2Ccond-mat%2F0106498%2Ccond-mat%2F0106318%2Ccond-mat%2F0106424&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate an operator renormalization group method to extract and\ndescribe the relevant degrees of freedom in the evolution of partial\ndifferential equations. The proposed renormalization group approach is\nformulated as an analytical method providing the fundamental concepts of a\nnumerical algorithm applicable to various dynamical systems. We examine\ndynamical scaling characteristics in the short-time and the long-time evolution\nregime providing only a reduced number of degrees of freedom to the evolution\nprocess."}, "authors": ["Andreas Degenhard", "Javier Rodriguez-Laguna"], "author_detail": {"name": "Javier Rodriguez-Laguna"}, "author": "Javier Rodriguez-Laguna", "arxiv_comment": "49 pages, 23 ps figures. Accepted for publication in Journal of\n  Statistical Physics", "links": [{"href": "http://arxiv.org/abs/cond-mat/0106156v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0106156v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0106156v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0106156v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:cond-mat/0106156v2 [cond-mat.stat-mech] 12 Nov 2001\n\nTowards the Evaluation of\nthe Relevant Degrees of Freedom in\nNonlinear Partial Differential Equations\nAndreas Degenhard∗\nThe Institute of Cancer Research, Department of Physics,\nDowns Road, Sutton, Surrey SM2 5PT, UK\nJavier Rodrı́guez-Laguna\nInstituto de Matemáticas y Fı́sica Fundamental, CSIC.\nC/ Serrano 123, Madrid 28006, Spain.\nAbstract\nWe investigate an operator renormalization group method to extract and describe the relevant degrees of freedom in the evolution of\npartial differential equations. The proposed renormalization group\napproach is formulated as an analytical method providing the fun∗ e-mail:\n\nandreasd@icr.ac.uk, phone: +44 (0) 208 6613494, fax: +44 (0) 208 6610846\n\n1\n\n\fdamental concepts of a numerical algorithm applicable to various\ndynamical systems. We examine dynamical scaling characteristics\nin the short-time and the long-time evolution regime providing only\na reduced number of degrees of freedom to the evolution process.\n\nPACS Numbers: 02.30.Jr , 02.60.Cb , 05.45.-a , 05.10.Cc , 64.60.Ak ,\n64.60.Ht\n\nKEY WORDS: Renormalization group; coarse-graining; nonlinear evolutionary dynamics; partial differential equations.\n\n1\n\nIntroduction\n\nBased on the arguments of L.P. Kadanoff [1], K.G. Wilson developed a\n(numerical) renormalization group (RG) approach in the context of critical\nphenomena [2] and later used the developed formalism to solve the Kondo\nproblem [3]. In practical RG applications to systems with many degrees\nof freedom a RG transformation is established for a stepwise elimination\nof the irrelevant degrees of freedom in the system. The universality of the\ncritical behaviour of the physical system emerges in the RG approach in a\nnatural way, with a set of universal exponents for each universality class.\nSoon after the considerable success of the RG for equilibrium systems a\ngeneralization of the method was introduced to handle dynamic properties\n\n2\n\n\fof spin systems [4]. The goal was to obtain critical exponents for stochastic equations and the developed generalization of the Wilson's equilibrium\ntheory has become known as the dynamic RG (DRG) method for nonequilibrium systems [5]. The DRG method, inherently defined as a Fourier\nspace technique, was further developed and improved by other authors including D. Forster, D. Nelson and M. Stephen who studied the dynamics of\nthe noisy Burgers equation [6]. In 1986 Burgers equation was transformed\ninto the language of growth processes by M. Kardar, G. Parisi and Y.-C.\nZhang [7] later called the KPZ equation. Applying the DRG to the KPZ\nequation the corresponding universal critical exponents were derived perturbatively within various higher order expansions [8, 9].\nHowever, the impact of dimensionality on applying the DRG method to\nthe KPZ or the related Burgers equation is crucial [10]. For dimension\nd > 1 the exhibited strong coupling RG flow behaviour is not accessible\nby perturbative expansions and the standard approaches fail to calculate\ncritical exponents [11]. New analytic approximations were proposed [12]\nincluding RG methods based on technical variations or combining different\napproaches like perturbation and scaling techniques [13]. Furthermore numerical simulation techniques were developed to allow for estimating the\ncritical exponents [14, 15] although these approaches can suffer from numerical instabilities [16].\nContrary non-perturbative Real-Space RG techniques have been proven to\n3\n\n\fproduce accurate results within strong-coupling regimes [17, 18] and therefore offer, in principle, the possibility to study models that belong to the\nKPZ universality class. Why is it then that currently no satisfying generally applicable Real-Space RG approach is available for dynamical systems\nas this is the case for their equilibrium counterparts? In the following we\nwould like to answer this question in detail and we propose a list of the\nfundamental problems arising in the context.\nMany of the modern Real-Space RG (RSRG) methods for strong-coupled\nsystems use an operator formalism to define the RG transformation (RGT)\n[19, 20] which under iterative application defines the RG flow. The RGT\nin the operator formalism is formally based on the application of two linear\nmaps, a truncation or fine-to-coarse operator and an embedding or coarseto-fine operator [20, 21]. Usage of these two operators should be sufficient\nfor the construction of renormalized or effective quantities. Within the\nequilibrium operator RSRG an effective observable, including in particular\nthe Hamiltonian, is defined by first applying the coarse-to-fine operator\nfollowed by the original observable. Finally the fine-to-coarse operator is\nused as a map back on the effective vector-space.\nRecently N. Goldenfeld, A. McKane and Q. Hou investigated the use of\noperator RSRG methods to solve partial differential equations (PDEs) numerically [22] and carried on their ideas in a further paper [23]. In their\nwork the authors generalized the operator concept of the RSRG to non4\n\n\fequilibrium system by replacing the equilibrium Hamiltonian operator by\nthe time evolution operator of a partial differential equation. However the\nauthors showed that such an approach is, in principle, not well-defined.\nFurthermore the proposed approach is less systematic and unsatisfactory\nfor several reasons. Here we summarize the concerns of Goldenfeld et al\nand complete the list by considerations of the present authors.\n1. Neither the coarse-to-fine operator nor the fine-to-coarse operator\nare uniquely defined. The chosen coarse-graining procedure does not\ndepend on the specific dynamical system.\n2. The coarse-to-fine operator and the time evolution operator do not\ncommute in general. Therefore no consistent and well defined RSRG\noperator formalism can be established.\n3. The geometric construction of the coarse-to-fine operator is unsatisfactory since it assumes the relevant degrees of freedom to be distributed within the long wavelength fluctuations. This is not necessarily the case for the evolution of many degrees of freedom interacting through nonlinear dynamics.\n4. Instead of coarse-graining the governing PDE in a systematic procedure, the provided initial field configuration at time t = 0 is coarsegrained with respect to a larger lattice spacing. Evolving a coarsegrained field configuration is not equivalent to successive RGTs re5\n\n\fmoving the relevant degrees of freedom in time.\n5. In a practical application of the operator concept introduced by Goldenfeld et al the coarse-graining procedure and the time evolution\nprocedure are successive operations. However, performing an equilibrium RG step followed by an evolution of the system in time is, in\ngeneral, not equivalent to a dynamic RG step.\n6. The proposed operator scheme does not allow to calculate the distribution of the relevant degrees of freedom in a dynamical system.\nAccordingly, RG flow equations do not yield any insight to the relevant physics of the system.\nIn our previous work [24], which can be considered as a further development of the work of Goldenfeld et al [22], we developed a consistent and\nmathematically well defined RSRG operator approach. The basic concepts\nalso used in this article are briefly summarized in section 2 and generalized by including time evolution operators. In our previous work we used\nthe introduced operator formalism to construct the embedding and truncation maps by a quasi-static geometric coarse-graining. The conceptional\ndisadvantage of a geometric approach is that it inherently integrates out\nthe small scales which, because of scale interference in the evolutionary\nprocess, are not necessarily the scales one wishes to ignore [22]. However,\nthe technique can be easily applied to a great variety of physical problems,\n6\n\n\feven if defined on very large lattices.\nThe essential difference in the approach proposed here is a non-geometric\nconstruction of the coarse-to-fine and fine-to-coarse operators involving the\nevolution dynamics of the particular PDE of interest. In this work we solve\nall reported problems summarized above and calculate observables to determine the universal characteristics in a class of nonlinear PDEs. As a\nnon-geometric generalization of our earlier RSRG operator approach the\nproposed method provides a non-perturbative real-space RG analogue to\nthe DRG Fourier space method.\nWe continue to present the fundamental concepts of the non-geometric\nRSRG operator approach in section 3. In particular, we develop two concepts applicable in the short and long time regime of the evolutionary\ndynamics respectively. In section 4 we solve the linear diffusion problem\nexactly and present an analytic construction scheme for the coarse-to-fine\nand fine-to-coarse operator. We continue in section 5 by generalizing the\nmethod as a numerical algorithm applicable to nonlinear evolution equations in general. Using transformations which are local in time allows for\nexact mapping of the non-linear dynamics to linear evolution dynamics\ngoverned by the diffusion equation.\nIn this work we denote the dependence of a function f on spatial variables\nx and temporal variables t as f (x, t). Contrarily the spatial and temporal\ndependence of a discretized function f will be denoted by indexing sets\n7\n\n\fi, i + 1, . . . and t, t + 1, . . . respectively. Here i, i − 1 and i, i + 1 refer to\nneighbouring sites in the lattice whereas t− 1, t, t+ 1 denote successive time\nsteps. Not necessarily neighbouring sites are denoted as i, j and by using\ncapital letters I, J we refer to the sites of the effective lattice. Quantities\ndefined in this effective vector space are equipped with a prime. A set of\nvectors is denoted as {|vi i}N\ni=M where the indexing set starts at i = M and\nextends to i = N .\n\n2\n\nThe Operator Real-space RG Approach\n\nIn this work we consider examples of evolution equations of the form\n∂t φ = H̃φ,\n\n(1)\n\nwith φ = φ(x, t) a function of space x and time t and the operator H̃ acting\nas the generator of the evolution. Although every operator H̃ acting locally\nin time can be considered, we restrict our calculations for clarity to linear\nand quadratic evolution operators, H and Q respectively,\nH̃ = (H + Q) .\n\n(2)\n\nDiscretizing equation (1) in space and time using (2) yields\nφi,t+∆t =\n\nN\nX\nj=1\n\n(1i,j + ∆t * Hi,j )φj,t + ∆t\n\nN\nX\n\nQi,j,k φj,t φk,t := fi [φt ]\n\nj,k=1\n\n(3)\n\n8\n\n\fwith i ∈ {1, . . . , N } and N denoting the number of sites in the lattice.\nThe spatial lattice spacing is denoted as ∆x and the discrete temporal\nintegration interval as ∆t. The function φt defines a vector in a vector\nspace V N and the functional f [φt ] defined in (3) is a map\nf [φt ] : V N\n\n\u001f\u007f\n\n/ VN .\n\n(4)\n\nUsing this vector space notation the concept of a truncation or fine-tocoarse operator G together with an embedding or coarse-to-fine operator\nGp is provided by the not necessarily commuting diagram\nV N\u007f _\n\n\u001f\u007f\n\nf [φt ]\n\n/ VN\nO\n\n(5)\nand\n\nGp\n\nG\n\n\u000f\n\nVM\n\n\u001f\u007f\nf ′ [φ′t ]\n\n\u001f\n/ V? M\n\nM ≤N\n\n.\n\nHere the truncation operator G is defined by the relation\nφ′I\n\n=\n\nN\nX\n\nGI,i φi ,\n\n(6)\n\ni=1\n\nwhere capital indexing letters I ∈ {1, . . . , M } refer to lattice sites in the\neffective vector space V M . If M = N and Ker(G) = ∅, the embedding\noperator Gp may be chosen as the natural inverse of the truncation operator\nG defined as\nφi =\n\nM\nX\n\nGpi,I φ′I =\n\nI=1\n\nM\nX\n\n′\nG−1\ni,I φI\n\n(7)\n\nI=1\n\nand the diagram (5) commutes.\nHowever, within practical applications the idea is to choose M < N and\n9\n\n\freplace equation (3) with a coarse grained evolution equation providing less\ndegrees of freedom. Considering G as a projector on the relevant degrees of\nfreedom the inverse operator G−1 does not exist. This naturally demands\nfor a generalized definition of the embedding operator Gp as the pseudoinverse\nφi =\n\nM\nX\n\nGpi,I φ′ I\n\n(8)\n\nI=1\n\ncalculated by Singular Value Decomposition (SVD) [25]. For M < N the\nfunctional f ′ [φ′t ] is defined as in (3) on an effective lattice with a reduced\nnumber of lattice sites M\nf ′ [φ′t ] : V M\n\nand\n\nφ′ I,t \u001f\n\n/ φ′ I,t+∆t =\n\n\u001f\u007f\n\nM\nX\n\nJ=1\n\n/ VM\n\n′\nφ′ J,t\n1I,J + ∆t * HI,J\n\n+ ∆t\n\nM\nX\n\n\u0001\n\nQ′I,J,K φ′ J,t φ′ K,t . (9)\n\nJ,K=1\n\nIn equation (9) H ′ and Q′ denote the effective linear and quadratic evolution operators defined as [24]\n′\nHI,J\n:= GI,i Hi,j Gpj,J\n\nand\n\nQ′I,J,K := GI,i Qi,j,k Gpj,J Gpk,K .\n(10)\n\nInserting (6), (8) and (9) into the non-commuting diagram (5) we replace\nequation (3) by an approximate field evolution equation on a coarse grained\n\n10\n\n\flattice as\nφi,t+∆t ≈\n\nM\nN X\nX\n\nj=1 J=1\n\n′\nGpi,I (1I,J + ∆t * HI,J\n)GJ,j φj,t\n\n+ ∆t\n\nN\nM\nX\nX\n\nGpi,I Q′I,J,K GJ,j GK,k φj,t φk,t\n\nj,k=1 J,K=1\n\n=\n\nh\n\nGp (1 + ∆t * H ′ + ∆t * Q′ ) G φt\n\ni\n\ni\n\n,\n\n(11)\n\ndescribing the evolution of the field φ under a reduced number of degrees\nof freedom.\nEquation (11) defines a RG transformation (RGT) within the operator\nformalism and iterating the RGT defines a RG flow. Carrying out one\nRGT is called a RG step (RGS) and according to the concept developed\nin this section is equivalent to an approximate field evolution using less\ndegrees of freedom. Equation (11) defines the real-space analogue of a\nRGT established within the DRG method. The field itself provides the set\nof parameters used to establish a RGT [20]. Furthermore, equation (11)\nfuses the coarse-graining and the time evolution procedure and provides a\nsolution to the problem number 5 formulated in the introduction.\n\n11\n\n\f3\n\nNon-geometric reduction of the degrees of\nfreedom\n\nIn this section we provide a general concept for reducing the degrees of\nfreedom in evolutionary systems without geometrically coarse-graining the\nlattice equations. Including the temporal characteristics of the particular\npartial differential equation (PDE) into the construction of the embedding\nand truncation operators we distinguish between a short-time regime and\na long-time regime.\n\n3.1\n\nShort-time evolution\n\nWithin the short-time regime we describe the evolution of the field as a\nperturbation of the initial field configuration at time t = 0. Evolving the\ninitial field φ0 for M time steps ∆t the dynamics within this short-time\ninterval is conserved by the set of vectors\nS := {φ0 , H̃φ0 , H̃ 2 φ0 , . . . , H̃ M−1 φ0 }\n\n(12)\n\nwhere H̃ is the evolution operator defined in (2). Using the set of vectors in\n(12) as the columns and rows of the linear operators G and Gp (previously\northonormalized), these can be considered as projection maps from and\ninto the space V M respectively.\n\n12\n\n\fIf M ≤ N the relation\nφt = Gp\n\n\u0010\n\n1 + ∆tH̃ ′\n\n\u0011M\n\nG φ0\n\nwith H̃ ′ = H ′ + Q′\n\n(13)\n\ngoverns an exact evolution of the field φt on the effective coarse-grained\nlattice for t < M ∆t. In this case the states in (12) span a subspace V M\nof the full vector-space V N conserving the relevant degrees of freedom for\nthe short-time evolutionary regime. In the considered short-time regime,\nwe may rewrite equation (13) as\nφt =\n\nh\n\nGp\n\n\u0010\n\n\u0011\n\n1 + ∆tH̃ ′ G\n\niM\n\nφ0\n\n(14)\n\nwhich determines a RG flow in the short time regime and a RGS is defined\nby relation (11).\nHowever, if t ≥ M ∆t equation (14) is an approximation to the evolved\nfield φt . In this case the approach is only applicable if no relevant scale\ninterference in the evolutionary process occurs. This is unlikely the case\nfor longer times in nonlinear dynamical systems and relation (14) becomes\na crude approximation giving rise to numerical instabilities.\n\n3.2\n\nLong-time evolution\n\nNonlinear evolution processes exhibit most of their characteristics in the\nlong-time regime. The asymptotic form of the field or surface configuration\n\n13\n\n\fin growth phenomena [7] or the formation of turbulent states out of spiral\nwaves [34] are only two examples. This gives rise to a reduction scheme\nfor the degrees of freedom of a dynamical system valid in the long-time\nasymptotics. This in turn demands for new concepts in the construction of\nthe embedding and truncation operators Gp and G away from any initial\nfield configuration.\nTherefore our task is to minimize the magnitude of the non-commutativity\nin the diagram (5) for all times of the evolution process. This in turn\nrises the important question if such a minimum exists and if a numerical\nalgorithm will uniquely converge. To measure the non-commutativity in the\ndiagram (5) we calculate the difference between the approximately evolved\nfield using a reduced number of degrees of freedom and the exactly evolved\nfield as\nEφt := (1 + ∆tH̃)φt − (Gp )(1 + ∆tH̃ ′ )G φt .\n\n(15)\n\nWe call E the error operator and generalize the operator concept introduced\nin section 2 according to the commutative diagram\nV N\u007f _\n\n\u001f\u007f\n\nG\n\nf [φt ]\n\n/ VN \u001f\u007f\n\nEφt\n\n/VN\nI\nand\n\n=\n\n\u000f\n\nVM\n\n\u001f\u007f\nf ′ [φ′t ]\n\n/ VM\n\n%\u0005\n\nG\n\nM <N\n\n.\n\np\n\n(16)\n\n14\n\n\fThe introduced minimization concept is one of the fundamental principles\nin equilibrium operator RSRG techniques [17, 21]. Using the established\nnotation in the formulation of the dynamic operator RSRG, (1 + ∆tH)φt\nis called the target state [17] and (Gp )(1 + ∆tH̃ ′ )G φt an optimal representation of the target state [17] in the subspace V M ⊂ V N .\nWe are interested in the limit Eφt → 0 for t ≫ 0 subject to any field configuration φ0 . To exclude the explicit field dependence from the minimization\nprocedure we rewrite equation (15) in operator form as\nE = (1 + ∆tH) − Gp (1 + ∆tH̃ ′ )G .\n\n(17)\n\nTo make this operator as small as possible we minimize E in the matrix\nnotation according to the Frobenius norm † . Inserting the definitions (10)\nwe rewrite equation (17) using the Frobenius norm ||F as\n|E|F :=\n\nn\n\nio2\n\nh\n\n1 − (Gp G) + ∆t H − (Gp G) H̃ (Gp G)\n\n.\n\n(18)\n\nThe measured magnitude of the non-commutativity in the original diagram\n(5) has become a number |E|F greater or equal to zero. According to\nequation (18) the minimization of the error operator E only depends on\nthe composed operator Gp G. Therefore two different G matrices for which\n\u007f\nGp G is the same operator V N \u001f\n† In\n\n/ V N yield the same error number\n\nprinciple every matrix norm can be used, although the Frobenius norm can be\n\neasily related to concepts from linear algebra like singular value decomposition. It is\ndefined to be the sum of the squares of all the entries in a matrix.\n\n15\n\n\f|E|F .\nThe matrix Gp G is called the reduction operator since it governs the field\nevolution under a reduced number of degrees of freedom. To make this more\nobvious we rewrite G and Gp in terms of a Singular Value Decomposition\nG =\n\nM\nX\ni=1\n\nλi |ui i hvi |\n\nand\n\nGp =\n\nM\nX\ni=1\n\nλ−1\ni |vi i hui | ,\n\n(19)\n\nM\nwhere {|vi i}M\ni=1 and {|ui i}i=1 are respectively sets of N -dimensional and\n\nM -dimensional vectors. By means of (19) we define the reduction operator\nas\nR := Gp G =\n\nM\nX\ni=1\n\n|vi i hvi | .\n\n(20)\n\nIn this notation the reduction operator R is composed of M states and acts\non the original vector space V N , with N > M . Since there are some states\nM\n{|vi i}N\ni=M+1 which together with {vi }i=1 represent a whole orthonormal\n\nbasis of VN , the reduction operator R projects out those states representing\nthe less relevant degrees of freedom in the evolution process.\nWe would like to point out that different truncation operators G can be used\nto construct the same reduction operator R = Gp G. In fact every RSRG\napproach requires a correct choice of the RG transformation (RGT) which\nis not uniquely defined. In the operator formalism the embedding and\ntruncation operators are used to construct the RGT [20]. In the dynamic\noperator RSRG method introduced in this work, the RGT is defined as\none time step in the field evolution equation (11). From this point of view\n16\n\n\fall truncation operators yielding the same reduction operator R represent\nan error equivalence class as far as the evolution error is the only concern.\nOther computational considerations, such as the sparseness of the H̃ matrix\nshall force us to choose one or another truncation operator.\nBefore we discuss the field evolution according to the reduction operator\nR we would like to give a remark concerning the structure of equation\n(18). Choosing ∆t = 0, i.e. no dynamics is involved, equation (18) reduces\nto the geometric operator real space RG approach [24]. For ∆t > 0 the\nthird summand on the right hand side includes the evolution operator of\nthe particular PDE into the minimization process. Furthermore this term\nis weighted by the time interval ∆t. Therefore the particular evolution\noperator is included into the minimization process and resulting relevant\ndegrees of freedom for the evolutionary dynamics can depend on the chosen\ntime interval.\nTo reformulate the approximate field evolution in terms of the reduction\noperator we insert the definitions (10) and (20) into (11) resulting in\nφi,t+∆t = R [φt + ∆t * ( H + Q ) R φt ] .\n\n(21)\n\nWithin practical calculations the process of constructing R can be decomposed according to successive dimensional reduction of the target space\nVN\n\n\u001f\u007f\n\n/ V N −1 \u001f \u007f\n\n/ V N −2 \u001f \u007f\n\n17\n\n/ ... \u001f \u007f\n\n/ VM .\n\n(22)\n\n\f\u007f\nWithin the first dimensional reduction V N \u001f\n\n/ V N −1 we have to mini-\n\nmize (18) by adjusting the N components of the vector |vN i which defines\nthe first order reduction operator as\nR1 :=\n\nN\n−1\nX\ni=1\n\n|vi i hvi | =\n\n1 − |vN i hvN | ,\n\n(23)\n\nwhere we used the notation of relation (20). Analogously we calculate the\nsecond order reduction operator as\n2\n\nR\n\n:=\n\nN\n−2\nX\ni=1\n\n|vi i hvi | =\n\n1 − |vN i hvN | − |vN −1 i hvN −1 |\n\n= R1 − P|vN −1 i .\n\n(24)\n\nIn (24) we have introduced the notation of the projection operator P|vi\ndefined as the projection map P|vi = (|vi hv|) onto the state |vi.\nIterating up to the M th order the reduction operator is calculated as\nRM = RM+1 − |vN +1−M i hvN +1−M | = RM+1 − P|vN +1−M i ,\n\n(25)\n\nwith R0 = 1. In equation (25) we have denoted by P|vN +1−M i the projection operator onto the state |vN +1−M i which is the target to calculate in\nthe M th minimization procedure.\nSimilar calculations can be performed for the error operator E. Using the\nabbreviation |vi := |viN the error operator for the first dimensional reduc-\n\n18\n\n\ftion is defined as\nE1 =\n\nh\n\n1 − (1 − |vi hv|) + ∆t H̃ − (1 − |vi hv|) H̃ (1 − |vi hv|)\n\n\u0010\n\u0011\n= P|vi + ∆t H̃P|vi + P|vi H̃ − hv| H̃ |vi P|vi .\n\ni\n(26)\n\nUsing the iterative scheme (25) we write the minimization procedure for\nthe state |vN +1−M i as\n|E M |F =\n\n\u0010\n\n\u0011\n\n1 − RM + ∆t H̃ − RM H̃ RM .\n\n\u007f\nAccording to relation (27) we call a truncation V N \u001f\n\n(27)\n\n/ V N −M of the\n\noriginal vector space V N an order M truncation or a reduction of order M\nin the degrees of freedom. The ratio\nλ := N/(N − M )\n\n(28)\n\nis defined as the reduction factor λ.\n\n4\n\nAn Exactly Solvable Lattice Model\n\nIn this section we treat the special case H̃ = H, i.e. a linear evolution\ndynamics. For both a selfadjoint and a non-selfadjoint evolution operator\nthe reduction operator can be calculated exactly up to an arbitrary order in\ndimensional reduction of the original vector space V N . As an example for\na selfadjoint linear evolution operator we examine the diffusion equation\n\n19\n\n\fgiven by\n∂w(x, t)\n= ν * ∇2 w(x, t) ,\n∂t\n\n(29)\n\nwhere the diffusion coefficient ν describes the strength of the relaxation\nprocess.\nIn figure 1 we evolved the initial field configuration (dashed line) according\nto the method described in section 3.1 for a total time t = 100 and t = 1000.\nThe solid curve shows the field evolution on the original lattice composed of\n(a)\n\n(b)\n\nFigure 1: The initial and the evolved fields for a lattice composed of 32\nsites after 100 and 1000 time steps (a) and (b) respectively. The initial field\nconfiguration is drawn by the dashed curve. The fields were evolved using\na time interval ∆t = 1 and a diffusion parameter ν = 0.01. The numerical\nminimization was performed up to the 16th order reduction in the degrees\nof freedom equivalent to a reduction factor of λ = 2.\n32 sites. The field evolved with half of the degrees of freedom corresponding\nto an evolution on a lattice composed of 16 sites is displayed by a \u0003 for\n20\n\n\fevery lattice site. The embedding and truncation operators Gp and G were\ncomposed according to (12) with M=16. For the numerical evolution of\nequation (29) we consider the following discrete differencing of (29)\n#\n\"\nwi,t+∆t − wi,t\nwi+1,t − 2wi,t − wi−1,t\n.\n= ν*\n2\n∆t\n(∆t)\n\n(30)\n\nIn equation (30) we used a forward Euler scheme in time [25] and the linear\nevolution operator H is defined as\n\n\n\n2\n\n\n−2ν/(∆t)\n\n\n\n\n\n\u0001\n2\n2\nHi,j := ν * ∇ i,j :=\nν/(∆t)\n\n\n\n\n\n\n\n\n 0\n\nif i = j\nif j nearest neighbour site of i\nelse .\n(31)\n\nFrom figure 1 it is obvious that the evolution under a reduced number of\ndegrees of freedom does not differ from the evolution of the field using all\ndegrees of freedom. Even for longer evolution times which corresponds to\nequation (14) with M ≫ N the field evolved with half of the degrees of\nfreedom does not differ from the exact evolution. This indicates that the\nrelevant degrees of freedom can already be deduced from the early time\ndynamics. Therefore the degrees of freedom do not mix in linear evolution,\ni.e. small scale dynamics and large scale dynamics do not interfere.\nTo calculate the long-time evolution characteristics we have to minimize\n|E|F in (18) by iterative application of (27) according to (25). We diagonalize the self-adjoint operator H according to the orthonormal basis\n21\n\n\f{|ui i}N\ni=1 with real eigenvalues Ei given by\nH =\n\nN\nX\ni=1\n\nEi |ui i hui | .\n\n(32)\n\nThe eigenvalues Ei are supposed to be real and in increasing order: E1 ≤\nE2 ≤ . . . ≤ EN . If the basis {|ui i}N\ni=1 is orthonormal the vector |vi in (26)\ncan be decomposed according to\n|vi =\nwhere we are assuming μi ∈\n\nN\nX\n\nμj |uj i ,\n\nj=1\n\n(33)\n\nR for all i. Using relation (33) the different\n\nsummands in equation (26) can be calculated explicitly as\nP|vi =\nHP|vi =\n\nN\nX\n\nμi μj |ui i huj |\n\nN\nX\n\nμi μj Ei |ui i huj |\n\ni,j=1\n\ni,j=1\n\nhv| H |vi =\nP|vi H =\n\nN\nX\ni=1\n\nμ2i Ei ≡ hHi\n\nN\nX\n\ni,j=1\n\nμi μj Ej |ui i huj |\n(34)\n\nand relation (26) becomes\nEij =\n\nh\n\ni\n\n1 + ∆t (Ei + Ej − hHi) μi μj .\n\n(35)\n\nAccording to definition (18) we have to minimize\n|E|F =\n\nN h\nX\n\ni,j=1\n\n1 + ∆t (Ei + Ej − hHi)\n\ni2\n\nμ2i μ2j .\n\n(36)\n\nExpanding into explicit summands and retaining only terms which are first\norder in ∆t this yields\n|E|F = 1 + 2∆t hHi .\n22\n\n(37)\n\n\fTherefore hHi must be minimized as a function of the {μi }i , restricted to\nthe condition\n\nP\n\nμ2i = 1. To include the constraint in the minimization we\n\nintroduce a Lagrangian parameter λ as\nhHi =\n\nN\nX\n\nμ2i Ei\n\n+λ\n\nN\nX\n\nμ2i\n\ni=1\n\ni=1\n\n−1\n\n!\n\n.\n\n(38)\n\nDerivation with respect to each of the μi yields\n(Ei + λ) μi = 0\n\nfor all i ∈ {1, . . . , N } .\n\n(39)\n\nThus, for each i, either μi = 0 or Ei = λ. But, if all eigenvalues Ei are\ndifferent the latter condition may apply to only one value of i. In order to\nfulfill the unit norm condition, the i-th component must have value μi = 1.\nTherefore the state |vi which minimizes the error operator is\nμ1 = 1\n\nand μi = 0 if i 6= 1 ,\n\n(40)\n\nbecause it corresponds to the smallest eigenvalue of H. In the case of\ndegenerate eigenvalues, there is not a unique minimum vector, but a minimum eigen-subspace.\nTo validate this result numerically we minimized the error operator (27)\nof order M = 8 and M = 16 by calculating the set of states {|vi i}N\ni=N −M\niteratively. To perform the minimization we used a sequential quadratic\nprogramming (SQP) method [26] provided by the NAG Library [27]. The\nSQP algorithm used the 32 components of each of the vectors in the set\n{|vi i}N\ni=N −M as adjusted variables and the necessary 32 gradient elements\n23\n\n\fhave been numerically estimated within the NAG Library. Both for a\ntruncation of order M = 8 and M = 16 the SQP algorithm converged\ninto a unique minimum stated by the NAG Library as the optimal solution found. The computer time required to evaluate a reduction operator\nof order M = 16 was about an hour on a SUN-SPARK Ultra 10 workstation (SUN Microsystems, Inc., Palo Alto, USA). In agreement with the\nanalytical scheme introduced above we always recalculated the eigenstate\ncorresponding to the highest eigenvalue within machine precision.\nIn figure 2 we plotted the corresponding field evolution of the diffusion\nequation (29). Using the approximate evolution equation (21) together\nwith a reduction operator R of order M = 8 no difference occurs compared\nto the field evolution using all degrees of freedom. However for a reduction\nfactor λ = 2 as shown in figure 2 very small deviations can be observed.\nWe would like to point out, that both the exact calculation and the numerical results are highly dependent on linearity and adjointness of the Hamiltonian, which account physically for the existence of normal modes. A\nsimilar calculation for non-selfadjoint linear operators using singular value\ndecomposition is given in the appendix.\n\n24\n\n\f(a)\n\n(b)\n\nFigure 2: The initial and the evolved fields for a lattice composed of 32\nsites. The approximate field evolution (\u0003) is calculated according to the\nrelation (21) with a reduction of order M = 8 (a) and M = 16 (b) in\nthe degrees of freedom. The field is plotted after 100 time steps using a\ntemporal integration interval ∆t = 1.0. The fields were evolved using a\ndiffusion parameter ν = 0.01.\n\n5\n\nA General Approach to Nonlinear Evolution Equations.\n\nIn this section we apply the theoretical concepts developed in section 2 and\nsection 3 to the deterministic Kardar-Parisi-Zhang (KPZ) equation [7] and\nthe deterministic Burgers equation [28]. Each equation provides a different\ntype of non-linearity to the numerical minimization process and exhibits a\ndifferent physical characteristics. As the main milestone in the direction\nof nonlinear surface growth the KPZ equation has been intensively inves-\n\n25\n\n\ftigated as the correct interface equation governing the physics of lateral\ngrowth phenomena [29]. The Burgers equation describes a vorticity-free\ncompressible fluid flow and the velocity field v(x, t) becomes the analogue\nof the (surface) height function h(x, t) in the KPZ equation [30].\nIn this section we monitor the evolution of both fields h(x, t) and v(x, t)\nover different time scales. We compute the scaling characteristics for the\nfield fluctuations and various observables are measured in the long time\nscaling regime. We compare the performance of the evolution using a reduced number of degrees of freedom with the evolution by direct numerical\nintegration in time. In addition, by using transformations both equations\ncan be mapped on the linear diffusion problem which was exactly solved\nregarding the reduction operator R in section 4. These transformations\nprovide an alternative exact construction of the reduction operator R for\nboth the KPZ and the Burgers equation.\n\n5.1\n\nThe relevant degrees of freedom in the KPZ equation\n\nThe deterministic KPZ equation is defined as\n\u0002\n\u00032\n∂h(x, t)\n= ν∇2 h(x, t) + κ ∇h(x, t) ,\n∂t\n\n(41)\n\nwhere the first term on the right-hand side describes diffusive relaxation of\nthe surface and the second term introduces the desired sideways growth.\n26\n\n\fWe discretize the linear part of equation (41) as proposed in (30) and the\nadditional non-linear evolution operator defined in (2) as\n\n\n\n\n\nκ/(2∆t)2 if j = i − 1; k = i − 1 or j = i + 1; k = i + 1\n\n\n\n\n\nQi,j,k := −κ/(2∆t)2 if j = i − 1; k = i + 1 or j = i + 1; k = i − 1\n\n\n\n\n\n\n\n\n\n0\nelse .\n\n(42)\n\nIn analogy to figure 1 in section 4 figure 3 shows the result of the shorttime RG approach introduced in section 3.1 as applied to the initial surface profile. The approximately evolved field displayed in figure 3 has been\n(a)\n\n(b)\n\nFigure 3: The initial and the evolved surface profiles for a lattice composed\nof 32 sites after 100 time steps (a) and 300 time steps (b) using a temporal\nintegration interval ∆t = 1. The dashed curve represents the initial surface\nprofile and the fields were evolved using a surface tension ν = 0.01 and a\ngrowth velocity κ = 0.1.\nevolved according to a reduction of order M = 16 in the degrees of free27\n\n\fdom. Although the exact field evolution is recovered up to a time t = 100,\nfor t = 300 the approximately evolved field exhibits a significant deviation from the evolution using all the degrees of freedom. For even larger\ntimes this results in uncontrollable numerical instabilities. The reported\nbehaviour is expected for RG techniques which are not able to cope with\nscale interference [23].\nTo incorporate possible scale interference in the truncation procedure it is\nnecessary to apply the concepts developed in section 3.2 and minimize |E|F\nin (18). In addition to the direct numerical minimization procedure we\nfurther propose a more sophisticated approach based on the exact solution\npreviously established in section 4. There it was shown that for the linear\nevolution problem H̃ = H the dynamic RSRG approach is equivalent to\nan exact diagonalization of the evolution operator. Since equation (41)\ncan be mapped to the linear diffusion equation (29) using the Hopf-Cole\ntransformation [7]\nw(x, t) = e(κ/ν)*h(x,t) ,\n\n(43)\n\nwe are able to provide an exact reduction operator R to evolve the field\nunder a reduced number of degrees of freedom † . In this case we decompose\nthe construction of the reduction operator into three steps. First the initial\nfield configuration h(x, 0) is transformed to w(x, 0) according to equation\n† Utilizing\n\nthe Hopf-Cole transformation some authors reported about less instabilities\n\nin numerical integration schemes [16, 32].\n\n28\n\n\f(43). The exactly calculated reduction operator including the relevant degrees of freedom of the linear evolution operator H is applied within (21)\nto evolve the field in time. Using the inverse of transformation (43) the\nfinal field is recovered by using a reduced number of degrees of freedom.\nIn figure 4 the final evolved growth profile h after time t = 100 is displayed for lattices of different size. The approximate field evolution is\nperformed using a reduction operator calculated by direct numerical minimization (square) of |E|F and alternatively using the exact transformation\n(43). Figure 4(a) shows the evolved growth profiles for a reduction factor\nof λ = 4/3 for a periodic lattice composed of 16 sites, i.e. a truncation of\norder M = 4. In figure 4(b) the initial field is equally evolved using a reduction factor λ = 2. Compared to figure 4(a) the approximate equation (21)\nfails to evolve the field correctly. In Figure 4(c) and (d) the corresponding surface evolutions are displayed for a lattice composed of 32 lattice\nsites. The results displayed in figure 4 demonstrate that the construction\nof the reduction operator R is sensitive to finite size effects. In particular\nthe reduction operator constructed by direct numerical minimization on a\nlattice composed of 16 sites fails to generate the characteristic paraboloid\nsegments [7].\nAnalogously to the numerical minimization procedure of the linear diffusion problem carried out in section 4, the SQP minimization algorithm\nwas provided by the NAG Library [27]. Again the optimal solution was\n29\n\n\f(a)\n\n(b)\n\n(c)\n\n(d)\n\nFigure 4: The initial and the evolved fields for a lattice composed of 16\nsites ((a) and (b)) and 32 sites ((c) and (d)) after 100 time steps using a\ntemporal integration interval ∆t = 1.0. The dashed curve represents the\ninitial profile according to a periodic random initialization. The fields were\nevolved using a surface tension ν = 0.01 and a growth velocity κ = 0.1.\n\n30\n\n\ffound by the algorithm which in turn characterizes the minimization approach in (27) as a well defined and numerically stable procedure also in\nthe non-linear case where no general analytical approach exists. However\nthe numerical minimization turns out to be much more time consuming\nsince the error operator norm |E|F in equation (18) is increasingly complex\nfor non-linear evolution problems.\nTo characterize the scaling behaviour of the KPZ equation we consider the\ndecay of the density of surface steps for a lattice composed of N sites,\ndefined by\nN\n1 X\nh ∇hi (t) i .\nρ(t) :=\nN i=1\n\n(44)\n\nHere the brackets h i denote averaging with respect to an ensemble of initial\nsurfaces (t = 0) characterized by the covariance\nh hi − hj i ∼ |i − j|ζ\n\n(45)\n\nwith the roughness exponent ζ. The dynamic observable defined in equation (44) obeys the scaling relation [31]\nρ(t) ∼ t(ζ−1)/z\n\n(46)\n\nwhere z denotes the dynamic exponent for the lateral correlation length\nξ determined by ξ ∼ t1/z . For the deterministic KPZ equation a scaling\nrelation for z can be established in terms of ζ as [31]\nz = 2−ζ .\n31\n\n(47)\n\n\fTo generate an ensemble of initial surfaces according to (45) we initialize\nthe surface profile by the graph of a one dimensional Brownian bridge as visualized in figure 5. The initial surface profile shown in figure 5 corresponds\nInitial surface profile\nSurface heigh h\n\nGraph of a periodic random walk\n\n0\nNumber of steps\nof the walker\n\n0\n\nN\n\nFigure 5: An initial surface profile generated from the graph of a random\nwalk using periodic boundary conditions (Brownian bridge).\n\nto a Brownian bridge of length N introducing a finite size correction to the\ncorrelation function which vanishes for N −→ ∞. This dependence on\nthe lattice size needs to be considered in a measurement for the roughness\nexponent of the theoretical value ζ = 1/2 [35]. According to the technical realization of the periodic boundary conditions the probability for the\nwalker to go left and right after a certain number of surface steps depends\non the remaining steps to go and the position of the walker.\nIn figure 6(a)-(d) the density of surface steps observable is compared for\nfour different reduction factors λ = 4/3, 8/5, 2 and 8/3. We expect a deviation from the exact scaling relation in the early time regime because\nof the finite size dependence of the initial surface profile constructed as a\nBrownian bridge. Therefore, inserting (47) into equation (46) we derive\n32\n\n\f(a)\n\n(b)\n\n(c)\n\n(d)\n\nFigure 6: The inverse of the density of surface steps observable plotted\naccording to the scaling relation ρ(t)−1 ∼\n\n√\n3\nt for a different number of\n\neliminated degrees of freedom (λ = 4/3, 8/5, 2 and 8/3). The observable is\nmeasured over a total time of 100 time evolution steps of temporal distance\n∆t = 1 and the ensemble average was taken over 400 surfaces with ζ = 1/2.\nThe surfaces were evolved using a surface tension ν = 0.01 and a growth\nvelocity κ = 0.1.\n\n33\n\n\fthe scaling relation ρ(t)−1 ∼ t1/3 plotted in figure 6 valid in the long time\nregime. As expected both curves show a significant deviation from the\ntheoretical scaling behaviour in the short time regime. For longer times\nthe evolution generated by using a reduction operator providing more than\nhalf of all the degrees of freedom for the nonlinear surface growth process\nrecovers the desired long-time linear behaviour. Using a reduction factor\nof λ = 2 or an even higher order in the reduction of the degrees of freedom\nthe observable measured using the approximate field evolution displays an\nincreasing deviation from the measurement using a field evolved with all\nthe degrees of freedom.\nAs a central observation in surface growth phenomena surface fluctuations\nexhibit a dynamical scaling behaviour [33]. The surface width of a growing\nsurface is defined as [33]\nv\nu\nN \u0010\n\u00112\nu1 X\nWt = t\nhi,t − h ̄t\nN i=1\n\nN\n1 X\nwith h ̄t =\nhi,t .\nN i=1\n\n(48)\n\nIn particular the scaling of the interface width (48) on the length scale N\nis expected to be of the form [29]\nWt = N ζ ft/N z ,\n\n(49)\n\nwhere ft/N z denotes a scaling function different from the one in the stochastic case. Using relation (47) we calculate for the KPZ equation the scaling\n\n34\n\n\fcharacteristics\n1\n√ Wt = ft/N 3/2 .\nN\n\n(50)\n\nIn figure 7 the surface width observable is plotted in analogy to figure 6\nmeasured using equally evolved surface profiles. All measurements of the\nsurface width observable are calculated according to an ensemble average\nof 400 surface configurations to be consistent with the literature [31]. The\nmeasurements for the observable W represent the same dependence on the\nreduction factor λ as the analogue measurements for the observable ρ in\nfigure 6.\n\n5.2\n\nThe relevant degrees of freedom in the Burgers\nequation\n\nAs a quasi one dimensional analogue of the Navier-Stokes equations the\nBurgers equation is defined as\n∂v(x, t)\n= ν∇2 v(x, t) − κv(x, t) * ∇v(x, t) ,\n∂t\n\n(51)\n\nwhere the parameter ν denotes the viscosity of the velocity field v(x, t).\nThe nonlinear term on the right hand side is a transport or convection\nterm in which the speed of the convection depends on the magnitude of\nv(x, t) † . Compared to the KPZ equation analyzed in the previous section\n† In\n\nthe original equation as introduced by Burgers κ = 1 [28].\n\n35\n\n\f(a)\n\n(b)\n\n(c)\n\n(d)\n\nFigure 7: The surface width observable plotted according to the scaling\ncharacteristics of the KPZ equation. From (a)-(d) increasing reduction\nfactors of λ = 4/3, λ = 8/5, λ = 2 and λ = 8/3 are used. The observable is\nmeasured over a total time of 100 time evolution steps of temporal distance\n∆t = 1. The ensemble average was taken over 400 surfaces with ζ = 1/2\neach generated by a periodic random walk as displayed in figure 5. All\nsurfaces were evolved using a surface tension ν = 0.01 and a growth velocity\nκ = 0.1.\n\n36\n\n\fthe convection term provides a different discretization scheme to the direct\nnumerical minimization procedure.\nInserting the transformation v(x, t) = (∂/∂x)h(x, t) into equation (51) we\nrederive the KPZ equation defined in (41). By further applying (43) results\nin the linear diffusion equation for which we can calculate the reduction\noperator exactly as described in section 4. Again, following the steps outlined for the case of the KPZ equation below (43) we are able to provide an\nalternative exact reduction operator R to evolve the velocity field under a\nreduced number of degrees of freedom.\nFigure 8 shows an evolved velocity field after a total evolution time t = 100\nusing a lattice composed of 32 sites. In figure 8 the performance between\nthe reduction operator R constructed by directly minimizing |E|F and the\nexact one using the proposed transformations is compared for two different\nreduction factors λ = 4/3 and λ = 2. Although both methods perform reasonably well for a reduction factor λ = 4/3 for a reduction factor λ = 1/2\nthe direct numerical minimization performs far superior to the evolution\nincorporating the exact transformations. The stated performance of the\nSQP algorithm using the NAG Library [27] is equal to the examined case\nof the KPZ equation in section 5.1, so that also in this case the numerical minimization converges in a well defined minimum subject to equation\n(18).\nBurgers showed that the decay of the step density follows the dynamical\n37\n\n\f(a)\n\n(b)\n\nFigure 8: The initial and the evolved velocity fields for a lattice composed\nof 32 sites after 100 time steps using a temporal integration interval ∆t = 1.\nThe initial velocity field configuration (dashed curve) is evolved with a reduction factor λ = 4/3 (a) and λ = 2 (b). The evolution using a reduced\nnumber of degrees of freedom is shown using a reduction operator constructed by numerical minimization and by using an exact transformation.\nThe velocity fields were evolved with a surface tension ν = 0.01 and a\ngrowth velocity κ = 0.1.\nscaling behaviour [28]\n1\n\nh| v(x, t) |i ∼ t− 3\n\n(52)\n\nwhich is equivalent to the scaling relation (46) with ζ = 1/2 and z = 3/2\nusing the transformation v(x, t) = (∂/∂x)h(x, t). Here the brackets h i\ndenote an ensemble average of stationary and locally uncorrelated initial\nvelocity field configurations v(x, 0). In figure 9 we have plotted the asymptotic time behaviour (52) over a total time t = 1000. The velocity field\n38\n\n\f(a)\n\n(b)\n\nFigure 9: The inverse of the decay of the density of surface steps observable\nplotted according to the scaling relation (52) for a reduction factor λ = 4/3\n(a) and λ = 2 (b). The observable is measured over a total time of 1000\ntime evolution steps of temporal distance ∆t = 1. The ensemble average\nwas taken over 400 random surfaces. All surfaces were evolved using a\nsurface tension ν = 0.01 and a growth velocity κ = 0.1.\nhas been evolved by a reduction of order M = 8 and M = 16 degrees of\nfreedom respectively, the latter corresponding to a λ = 2 reduction. Following Burgers [28] we generated an ensemble of stationary and locally\nuncorrelated initial velocity field configurations vi (x, 0) by calculating\nvi (x, 0) = (∂/∂x)hi (x, 0)\n\nand i ∈ {1, . . . , 400} .\n\n(53)\n\nIn equation (53) hi (x, 0) denotes the graph of a Brownian bridge as shown\nin figure 5.\nTo confirm the results in figure 8 and 9 quantitatively we investigate the\nnumerical stability within the evolution of the velocity field in dependence\n39\n\n\fof the order of the truncation in the limit of long-time evolutionary dynamics. Using (21) together with an iterative construction of the reduction\noperator RM of order M according to equation (25), table 1 summarizes\nthe mean square deviation (MSD) as measured in comparison with the exact velocity field evolution. The convergence in time of the MSD for each\nTable 1: The accuracy of the approximate velocity field evolution using\ndirect numerical minimization as compared to the exact velocity field evolution using all degrees of freedom in the long-time limit. The approximate\nvelocity field evolution is compared for a reduction of different orders by\ncalculating the mean square deviation (MSD) between the approximately\nand the exactly evolved velocity field. All reductions calculated refer to an\noriginal lattice composed of 32 sites.\nReduction in the\n\nTotal evolution\n\nTotal evolution\n\nTotal evolution\n\ndegrees of freedom\n\ntime t = 100\n\ntime t = 1000\n\ntime t = 10000\n\nof order M = 8\n\n6.451 * 10−4\n\n7.906 * 10−5\n\n3.012 * 10−6\n\nof order M = 12\n\n1.866 * 10−3\n\n1.074 * 10−4\n\n5.737 * 10−6\n\nof order M = 16\n\n3.600 * 10−3\n\n1.534 * 10−4\n\n6.428 * 10−6\n\nof order M = 20\n\n8.852 * 10−3\n\n7.267 * 10−3\n\n9.851 * 10−4\n\nof order M = 24\n\n1.320 * 10−2\n\n8.976 * 10−3\n\n1.211 * 10−3\n\nof order M = 28\n\n2.319 * 10−2\n\n1.258 * 10−2\n\n1.473 * 10−3\n\n40\n\n\forder of the reduction in the degrees of freedom illustrates the numerical\nstability in the long-time scaling regime. However, for a reduction factor\nλ > 2 (M = 16) the accuracy of the approximately evolved velocity field in\nthe long-time evolution decreases by at least two orders of magnitude. This\nindicates that at least half of the available degrees of freedom are relevant\nfor an accurate evaluation of the long-time characteristics in the Burgers\nequation.\n\n6\n\nConclusions\n\nIn this paper we applied an operator real-space RG method to partial\ndifferential equations (PDEs) in general. The fundamental concept is to\nconstruct a linear map, the reduction operator R, projecting to a subspace\nof the full vector space including the relevant degrees of freedom governing\nthe physics of the evolutionary dynamics. In technical terms the reduction\noperator is composed as the product of the truncation and embedding operator, which are already established objects in the equilibrium real-space\nRG literature.\nTwo basic approaches are provided for the construction of the reduction\noperator R. In the first approach a transformation to a linear PDE is used\nfor which the reduction operator can be constructed using exact or numerically fast diagonalization techniques. If such a transformation is missing\n\n41\n\n\fa direct numerical minimization is applied using a sequential quadratic\nprogramming (SQP) algorithm to construct the reduction operator. The\nadvantage of the first approach over the second one is dominated by the\nsaving of computer time depending on the particular nonlinear problem of\ninterest. However, again depended on the particular PDE, it was observed\nin this work that numerical instabilities in the field evolution can prove\nthe first approach to be useless. Although the computer calculation time\nincreases with the lattice size the computed reduction operator does not\ndepend on a particular initial field configuration and can be stored and\napplied to the evolution of any other initial field configuration.\nIn fully developed turbulence or related non-integrable dynamical systems\nthe dynamics and evolution of many degrees of freedom interacts through\nnonlinear PDEs. Direct numerical simulations are difficult and show a clear\ndemand for a reduction to the relevant degrees of freedom. Choosing the\nBurgers equation to test our RG approach we have examined one of the\nsimplest archetypes describing a vorticity-free, compressible fluid flow. The\nmeasured decay of the step density can be generalized to higher order correlation functions corresponding to structure functions in fully developed\nturbulence [30].\nOne of the goals of the real-space RG method presented in this paper is\ncertainly the reduction in complexity of the problem yielding to a reduced\namount of computer time within simulations, after a reduction operator R\n42\n\n\fhas been provided. Since this operator contains information on the relevant degrees of freedom the proposed real-space RG method gives rise to\nimproved understanding of the physics of non-linear evolutionary dynamics.\n\nAcknowledgment\nThe authors wish to thank the Department of Mathematical Physics at\nthe University of Bielefeld, Germany, for the warm and kind atmosphere\nduring their visit in which the foundations of this work were developed.\nSpecial thanks are given to Silvia N. Santalla for her continuous help in\nthe realization of the project.\n\nAppendix\nIn the case of a non-selfadjoint Hamiltonian, the approach in section 4 must\nbe slightly changed. There exists no decomposition of the functional space\ninto eigenvectors of the evolution operator H, so the natural approach requires a singular value decomposition [25]\nH =\n\nN\nX\ni=1\n\nEi |ui i hvi | .\n\n(54)\n\nIn equation (54) the vectors {|vi i}i denote the \"input states\" and the vectors {|ui i}i make up the \"output states\". It is important to state that both\nsets of vectors belong to the same functional space.\n43\n\n\fChanging slightly our notation for clarity |φi denotes the target state,\nwhose removal minimizes the error operator\n\u0002\n\u0003\nE := P|φi + ∆t HP|φi + P|φi H − hφ| H |φi P|φi .\n\n(55)\n\nWe decompose |φi in both the input and the output basis as\n|φi =\n\nN\nX\ni=1\n\nμi |vi i\n\n|φi =\n\nand\n\nN\nX\n\nχi |ui i .\n\ni=1\n\n(56)\n\nAnalogously to (34) we arrange the resulting operators in (55) using the\ntwo alternative representations in (56) by\nP|φi =\n\nHP|φi =\n\nN\nX\n\nχi μj |ui i hvj |\n\nN\nX\n\nEi μi μj |ui i hvj |\n\ni,j=1\n\ni,j=1\n\nhφ| H |φi =\nP|φi H =\n\nN\nX\ni=1\n\nμi χi Ei ≡ hHi\n\nN\nX\n\ni,j=1\n\nχi χj Ej |ui i hvj |\n\n.\n(57)\n\nTherefore, in the basis of the evolution operator\nE =\nwith\n\nN\nX\n\ni,j=1\n\nEij |ui i hvj |\n\n\u0011\n\u0010\nEij = χi μj + ∆t Ei μi μj + χi χj Ej − hHi χi μj .\n\n(58)\n\nSquaring and retaining only terms which are linear in ∆t\n\u0011\n\u0010\n2\nEij\n≈ χ2i μ2i + 2∆t Ei μi χi μ2j + Ej χ2i χj μj − hHi χ2i μ2j .\n\n(59)\n\nSummation over all the values in (59) yields\nN\nX\n\ni,j=1\n\n2\nEij\n= 1 + 2 * ∆t hHi\n\n44\n\n(60)\n\n\fto first order in ∆t. The result is equivalent to equation (37) and a again\nhHi must be minimized. However one has to remember that the set of\nnumbers {μi }i and {χi }i are not independent since they represent the same\nfield.\nThe idea is to represent the vectors {|vi i}i in the basis of the vectors {|ui i}i\naccording to\n|vi i =\n\nN\nX\nj=1\n\nCij |uj i\n\n(61)\n\nThe matrix Cij may be obtained by the SVD of the evolution operator H\nusing\nCij ≡ |vj i hui | .\n\n(62)\n\nThe equality of both representations in (56) yields a relation between the\n{μi }i and the {χi }i :\n\nN\nX\ni=1\n\nμi |vi i =\n\nN\nX\n\ni,j=1\n\nμi Cij |uj i =\n\nN\nN\nX\nX\nj=1\n\nCij μi\n\ni=1\n\n!\n\n|uj i =\n\nN\nX\nj=1\n\nχj |uj i (63)\n\nAs the {|uj i}i form an orthonormal basis we may deduce\nχj =\n\nN\nX\n\nCij μi .\n\n(64)\n\ni=1\n\nUsing (57) and inserting (64) the value to be minimized equals\nhHi = hφ| H |φi =\n\nN\nX\n\nμi χi Ei =\n\nN\nX\n\ni,j=1\n\ni=1\n\n45\n\nEi μi Cji μj .\n\n(65)\n\n\fEquation (65) defines a quadratic form based on a matrix which is not\nsymmetric. Defining\nKij ≡\n\n1\n(Ei Cji + Ej Cij )\n2\n\n(66)\n\nthe problem is reduced to the minimization of the quadratic form\nhHi =\nwith the restriction\n\nP\n\ni\n\nN\nX\n\nKij μi μj\n\n(67)\n\ni,j=1\n\nμ2i = 1. This problem is equivalent to the self-\n\nadjoint case examined in section 4 and the solution is the lowest eigenvalue\nof the matrix K.\nThe eigenvector corresponding to the minimum eigenvalue of the matrix K\nis to be interpreted as a set of μi values. Thus, the |φi eigenvector shall be\ngiven by the calculation of\n\nP\n\ni\n\nμi |ui i with the appropriate values of μi .\n\nReferences\n[1] L.P. Kadanoff. Physics 2, 263 (1966).\n[2] K.G. Wilson. Phys. Rev. B4, 3174 (1971). Phys. Rev. B4, 3184\n(1971). Phys. Rev. Lett. 28, 548 (1972).\n[3] K.G. Wilson. Rev. Mod. Phys. 47, 773 (1975).\n\n46\n\n\f[4] S.K. Ma. Modern Theory of Critical Phenomena. Benjamin/Cummings Publishing Company, Reading (1976).\n[5] P.C. Hohenberg and B.I. Halperin Rev. Mod. Phys. 49, 435\n(1977).\n[6] D. Forster, D. Nelson and M. Stephen Phys. Rev. A 16, 732\n(1977).\n[7] M. Kardar, G. Parisi and Y.-C. Zhang Phys. Rev. Lett. 56, 889\n(1986).\n[8] E. Medina, T. Hwa, M. Kardar and Y. Zhang Phys. Rev. A 39,\n3053 (1989).\n[9] E. Frey and U.C. Taeuber Phys. Rev. E 50, 1024 (1994).\n[10] T. Nattermann and L.H. Tang Phys. Rev. A 45, 7156 (1992).\n[11] J.P. Bouchaud and M.E. Cates Phys. Rev. E 47, R1455 (1993).\n[12] M. Schwartz and S.F. Edwards Europhys. Lett. 20, 301 (1992).\n[13] T. Halpin-Healy Phys. Rev. Lett. 62, 442 (1990). Phys. Rev. A 42,\n711 (1990).\n[14] D.E. Wolf and J. Kertész Europhys. Lett. 4, 651 (1987).\n[15] B.M. Forrest and L. Tang J. Stat. Phys. 60, 181 (1990).\n\n47\n\n\f[16] M. Beccaria and G. Curci Phys. Rev. E, 4560 (1994).\n[17] S.R. White. Phys. Rev. B48, 10345 (1993).\n[18] J.R. de Sousa. Phys. Lett. A216, 321 (1996).\n[19] M.A. Martin-Delgado, J. Rodrı́guez-Laguna and G. Sierra\nNucl. Phys. B473, 685 (1996).\n[20] A. Degenhard. J. Phys. A: Math. Gen. 33, 6173 (2000).\n[21] J. Gonzales, M.A. Martin-Delgado, G. Sierra and A.H. Vozmediano New and old real-space renormalization group methods. In:\nQuantum Electron Liquids and High-Tc Superconductivity. Lecture\nNotes in Physics 38, Springer, Berlin (1995).\n[22] N. Goldenfeld, A. McKane and Q. Hou. J. Stat. Phys. 93, 699\n(1998).\n[23] Q. Hou, N. Goldenfeld and A. McKane. Phys. Rev. E 63, 36125\n(2001).\n[24] A. Degenhard and J. Rodrı́guez-Laguna.\n\ncond-mat/0106155\n\n(2001). Submitted to Phys. Rev. E.\n[25] W.H. Press, S.A. Teukolsky, W.T. Vetterling and B.P. Flannery. Numerical Recipies. The Art of Scientific Computing. Cambridge, University Press (1992).\n48\n\n\f[26] P.E. Gill, W. Murray and M.H. Wright. Practical optimization.\nNew York, Academic Press (1981).\n[27] The Numerical Algorithms Group Inc. NAG Fortran Library,\nMark 17. Oxford, United Kingdom (1995).\n[28] J.M. Burgers. The Nonlinear Diffusion Equation. Riedel, Boston\n(1974).\n[29] T. Halpin-Healy and Y.-C. Zhang. Phys. Rep. 254, 215 (1995).\n[30] J. Krug. Phys. Rev. Lett. 72(18), 2907 (1994).\n[31] J. Krug and H. Spohn. Phys. Rev. A 38(8), 4271 (1988).\n[32] S.E. Esipov and T.J. Newman. Phys. Rev. E 48(6), 1046 (1993).\n[33] J.G. Amar and F. Family. Phys. Rev. E 47(3), 1595 (1993).\n[34] Y. Kuramoto.\n\nChemical Oscillations, Waves and Turbulence.\n\nSpringer, Berlin (1984).\n[35] C. Itzykson and J.M. Drouffe. Statistical field theory. University\nPress, Cambridge (1991).\n\n49\n\n\f"}