{"id": "http://arxiv.org/abs/cond-mat/0311484v1", "guidislink": true, "updated": "2003-11-20T16:58:38Z", "updated_parsed": [2003, 11, 20, 16, 58, 38, 3, 324, 0], "published": "2003-11-20T16:58:38Z", "published_parsed": [2003, 11, 20, 16, 58, 38, 3, 324, 0], "title": "Correlated quantum percolation in the lowest Landau level", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0311095%2Ccond-mat%2F0311100%2Ccond-mat%2F0311118%2Ccond-mat%2F0311113%2Ccond-mat%2F0311517%2Ccond-mat%2F0311232%2Ccond-mat%2F0311342%2Ccond-mat%2F0311347%2Ccond-mat%2F0311047%2Ccond-mat%2F0311145%2Ccond-mat%2F0311258%2Ccond-mat%2F0311345%2Ccond-mat%2F0311454%2Ccond-mat%2F0311567%2Ccond-mat%2F0311376%2Ccond-mat%2F0311177%2Ccond-mat%2F0311569%2Ccond-mat%2F0311271%2Ccond-mat%2F0311566%2Ccond-mat%2F0311012%2Ccond-mat%2F0311357%2Ccond-mat%2F0311191%2Ccond-mat%2F0311612%2Ccond-mat%2F0311246%2Ccond-mat%2F0311571%2Ccond-mat%2F0311308%2Ccond-mat%2F0311657%2Ccond-mat%2F0311135%2Ccond-mat%2F0311069%2Ccond-mat%2F0311137%2Ccond-mat%2F0311256%2Ccond-mat%2F0311353%2Ccond-mat%2F0311591%2Ccond-mat%2F0311142%2Ccond-mat%2F0311458%2Ccond-mat%2F0311178%2Ccond-mat%2F0311434%2Ccond-mat%2F0311648%2Ccond-mat%2F0311522%2Ccond-mat%2F0311103%2Ccond-mat%2F0311073%2Ccond-mat%2F0311136%2Ccond-mat%2F0311168%2Ccond-mat%2F0311111%2Ccond-mat%2F0311518%2Ccond-mat%2F0311075%2Ccond-mat%2F0311237%2Ccond-mat%2F0311507%2Ccond-mat%2F0311116%2Ccond-mat%2F0311058%2Ccond-mat%2F0311019%2Ccond-mat%2F0311360%2Ccond-mat%2F0311371%2Ccond-mat%2F0311639%2Ccond-mat%2F0311157%2Ccond-mat%2F0311305%2Ccond-mat%2F0311004%2Ccond-mat%2F0311260%2Ccond-mat%2F0311086%2Ccond-mat%2F0311152%2Ccond-mat%2F0311332%2Ccond-mat%2F0311457%2Ccond-mat%2F0311143%2Ccond-mat%2F0311450%2Ccond-mat%2F0311155%2Ccond-mat%2F0311251%2Ccond-mat%2F0311024%2Ccond-mat%2F0311660%2Ccond-mat%2F0311211%2Ccond-mat%2F0311243%2Ccond-mat%2F0311109%2Ccond-mat%2F0311407%2Ccond-mat%2F0311525%2Ccond-mat%2F0311558%2Ccond-mat%2F0311349%2Ccond-mat%2F0311056%2Ccond-mat%2F0311326%2Ccond-mat%2F0311099%2Ccond-mat%2F0311214%2Ccond-mat%2F0311193%2Ccond-mat%2F0311588%2Ccond-mat%2F0311106%2Ccond-mat%2F0311010%2Ccond-mat%2F0311264%2Ccond-mat%2F0311400%2Ccond-mat%2F0311593%2Ccond-mat%2F0311484%2Ccond-mat%2F0311255%2Ccond-mat%2F0311320%2Ccond-mat%2F0311005%2Ccond-mat%2F0311104%2Ccond-mat%2F0311493%2Ccond-mat%2F0311008%2Ccond-mat%2F0311133%2Ccond-mat%2F0311514%2Ccond-mat%2F0311564%2Ccond-mat%2F0311432%2Ccond-mat%2F0311557%2Ccond-mat%2F0311164%2Ccond-mat%2F0311287%2Ccond-mat%2F0311607&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Correlated quantum percolation in the lowest Landau level"}, "summary": "Our understanding of localization in the integer quantum Hall effect is\ninformed by a combination of semi-classical models and percolation theory.\nMotivated by the effect of correlations on classical percolation we study\nnumerically electron localization in the lowest Landau level in the presence of\na power-law correlated disorder potential. Careful comparisons between\nclassical and quantum dynamics suggest that the extended Harris criterion is\napplicable in the quantum case. This leads to a prediction of new localization\nquantum critical points in integer quantum Hall systems with power-law\ncorrelated disorder potentials. We demonstrate the stability of these critical\npoints to addition of competing short-range disorder potentials, and discuss\npossible experimental realizations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0311095%2Ccond-mat%2F0311100%2Ccond-mat%2F0311118%2Ccond-mat%2F0311113%2Ccond-mat%2F0311517%2Ccond-mat%2F0311232%2Ccond-mat%2F0311342%2Ccond-mat%2F0311347%2Ccond-mat%2F0311047%2Ccond-mat%2F0311145%2Ccond-mat%2F0311258%2Ccond-mat%2F0311345%2Ccond-mat%2F0311454%2Ccond-mat%2F0311567%2Ccond-mat%2F0311376%2Ccond-mat%2F0311177%2Ccond-mat%2F0311569%2Ccond-mat%2F0311271%2Ccond-mat%2F0311566%2Ccond-mat%2F0311012%2Ccond-mat%2F0311357%2Ccond-mat%2F0311191%2Ccond-mat%2F0311612%2Ccond-mat%2F0311246%2Ccond-mat%2F0311571%2Ccond-mat%2F0311308%2Ccond-mat%2F0311657%2Ccond-mat%2F0311135%2Ccond-mat%2F0311069%2Ccond-mat%2F0311137%2Ccond-mat%2F0311256%2Ccond-mat%2F0311353%2Ccond-mat%2F0311591%2Ccond-mat%2F0311142%2Ccond-mat%2F0311458%2Ccond-mat%2F0311178%2Ccond-mat%2F0311434%2Ccond-mat%2F0311648%2Ccond-mat%2F0311522%2Ccond-mat%2F0311103%2Ccond-mat%2F0311073%2Ccond-mat%2F0311136%2Ccond-mat%2F0311168%2Ccond-mat%2F0311111%2Ccond-mat%2F0311518%2Ccond-mat%2F0311075%2Ccond-mat%2F0311237%2Ccond-mat%2F0311507%2Ccond-mat%2F0311116%2Ccond-mat%2F0311058%2Ccond-mat%2F0311019%2Ccond-mat%2F0311360%2Ccond-mat%2F0311371%2Ccond-mat%2F0311639%2Ccond-mat%2F0311157%2Ccond-mat%2F0311305%2Ccond-mat%2F0311004%2Ccond-mat%2F0311260%2Ccond-mat%2F0311086%2Ccond-mat%2F0311152%2Ccond-mat%2F0311332%2Ccond-mat%2F0311457%2Ccond-mat%2F0311143%2Ccond-mat%2F0311450%2Ccond-mat%2F0311155%2Ccond-mat%2F0311251%2Ccond-mat%2F0311024%2Ccond-mat%2F0311660%2Ccond-mat%2F0311211%2Ccond-mat%2F0311243%2Ccond-mat%2F0311109%2Ccond-mat%2F0311407%2Ccond-mat%2F0311525%2Ccond-mat%2F0311558%2Ccond-mat%2F0311349%2Ccond-mat%2F0311056%2Ccond-mat%2F0311326%2Ccond-mat%2F0311099%2Ccond-mat%2F0311214%2Ccond-mat%2F0311193%2Ccond-mat%2F0311588%2Ccond-mat%2F0311106%2Ccond-mat%2F0311010%2Ccond-mat%2F0311264%2Ccond-mat%2F0311400%2Ccond-mat%2F0311593%2Ccond-mat%2F0311484%2Ccond-mat%2F0311255%2Ccond-mat%2F0311320%2Ccond-mat%2F0311005%2Ccond-mat%2F0311104%2Ccond-mat%2F0311493%2Ccond-mat%2F0311008%2Ccond-mat%2F0311133%2Ccond-mat%2F0311514%2Ccond-mat%2F0311564%2Ccond-mat%2F0311432%2Ccond-mat%2F0311557%2Ccond-mat%2F0311164%2Ccond-mat%2F0311287%2Ccond-mat%2F0311607&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Our understanding of localization in the integer quantum Hall effect is\ninformed by a combination of semi-classical models and percolation theory.\nMotivated by the effect of correlations on classical percolation we study\nnumerically electron localization in the lowest Landau level in the presence of\na power-law correlated disorder potential. Careful comparisons between\nclassical and quantum dynamics suggest that the extended Harris criterion is\napplicable in the quantum case. This leads to a prediction of new localization\nquantum critical points in integer quantum Hall systems with power-law\ncorrelated disorder potentials. We demonstrate the stability of these critical\npoints to addition of competing short-range disorder potentials, and discuss\npossible experimental realizations."}, "authors": ["Nancy Sandler", "Hamid Maei", "Jane' Kondev"], "author_detail": {"name": "Jane' Kondev"}, "author": "Jane' Kondev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.70.045309", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0311484v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0311484v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 12 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0311484v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0311484v1", "journal_reference": "Phys. Rev. B 70, 045309 (2004).", "doi": "10.1103/PhysRevB.70.045309", "fulltext": "Correlated quantum percolation in the lowest Landau level\nNancy Sandler∗\n\narXiv:cond-mat/0311484v1 [cond-mat.mes-hall] 20 Nov 2003\n\nDept. of Physics and Astronomy, Ohio University, Ohio, OH 45701, USA\n\nHamid R. Maei†\nGatsby Unit, University College London, London, UK\n\nJané Kondev‡\nDepartment of Physics, Brandeis University ,Waltham, MA 02454, USA\n(Dated: November 20, 2018)\nOur understanding of localization in the integer quantum Hall effect is informed by a combination\nof semi-classical models and percolation theory. Motivated by the effect of correlations on classical\npercolation we study numerically electron localization in the lowest Landau level in the presence\nof a power-law correlated disorder potential. Careful comparisons between classical and quantum\ndynamics suggest that the extended Harris criterion is applicable in the quantum case. This leads to\na prediction of new localization quantum critical points in integer quantum Hall systems with powerlaw correlated disorder potentials. We demonstrate the stability of these critical points to addition\nof competing short-range disorder potentials, and discuss possible experimental realizations.\n\nI.\n\nINTRODUCTION\n\nOne of the hallmarks of the quantum Hall effect is the\nappearance of plateaus in the Hall resistance of a twodimensional electron gas as a function of applied magnetic field. Transitions between plateaus have been associated with a quantum critical point1 . This critical point\ncorresponds to a localization-delocalization transition for\nthe electron's wave-function. Unlike the Anderson metalinsulator transition here the transition is between two insulating states: an extended wave function emerges at a\nsingle value of the magnetic field corresponding to the\ncenter of a Landau band. Experiments and numerical\nsimulations have revealed many important properties of\nthis critical point2 , such as the value of the correlation\nlength exponent, νq ≈ 2.3. Attempts at formulating an\nanalytically tractable theory of the transition have by\nand large failed.\nA very fruitful approach to unraveling the physics of\nplateau transitions has been the semi-classical description of electron dynamics in the lowest Landau level3 .\nClassically the electron's motion can be described as a\nfast cyclotron rotation in the plane accompanied by a\nslow E × B drift of the center of the circular orbit along\nlines of constant random potential, V (x) =const. Quantum mechanics adds tunneling and interference to the\nmix.\nThe purpose of this work is to understand the relation between classical and quantum dynamics of electrons in the lowest Landau level, in the presence of a\nrandom potential. In particular we investigate the effect\nof the fractal geometry of the classical orbits on the critical properties of the quantum localization-delocalization\ntransition, such as the value of νq . One of our main results is that we have identified a family of random potentials for which the classical electron orbits have continuously varying fractal properties, while the quantum crit-\n\nical point remains unchanged. These random potentials\nare characterized by decaying power-law correlations in\nspace. When the decay of correlations is not too fast we\nfind new quantum critical points which are the quantum\nanalogs of correlated percolation4 .\nPreviously, a real-space renormalization group treatment of correlated quantum percolation appeared in\nRef. 5. Preliminary results of our numerical approach\nwere reported in Ref. 6. Here we provide a detailed account of the numerical methods used to study the effect\nof power-law correlated disorder potentials on the integer quantum Hall transition (IQHT), as well as theoretical arguments supporting them. We also describe new\nresults on the stability of these quantum critical points\nto the presence of short-range correlated disorder. The\nstability analysis provides connections with experiments7\nwhere these new quantum critical points might be observed.\nThe work presented here addresses two different aspects of the problem. On one side the motivation is provided by understanding the role of disorder in determining the transport properties of quantum Hall systems.\nOn the other side, we are motivated by the possibility of\nextending correlated percolation results in the classical\nregime to the quantum regime.\nA.\n\nDisorder and the quantum Hall effect\n\nThe role of disorder in the quantum Hall effect was\nrecognized shortly after its discovery. From scaling theory it is known that electron wave-functions are localized\nby potential disorder in two-dimensions8 . This remains\ntrue in the presence of a strong perpendicular magnetic\nfield for states in the tails of the Landau bands, and leads\nto the observed plateaus in the Hall resistance9. Toward\nthe center of a Landau band the localization length increases signaling the appearance of a delocalized state.\n\n\f2\nThis results in the observed transition between plateaus\nin the Hall resistance and the peak in the longitudinal\nresistance.\nThe precise nature of the disordered potential experienced by electrons in quantum Hall systems remains\npoorly understood. The canonical picture (say, for GaAs\nheterostructures) is that ionized donors located between\nthe two-dimensional electron gas and the sample surface\nare responsible for the random potential. Important experimental progress has come from scanning techniques\nwhich provide a map of the electrostatic potential seen\nby electrons in a semiconductor heterostructure10 . Interestingly enough the experiment measures random potential fluctuations that extend over distances that are\nmore than an order of magnitude larger than the typical\nspacing between the impurities and the electron gas, suggesting that the potential might be longer ranged that\npreviously thought. Scanning techniques and the ability to manipulate single atoms on surfaces also opens up\nthe possibility of engineering the random potential so as\nto produce novel transport effects. For example, an enhancement of the conductivity (compared to the Drude\nvalue) of a two-dimensional electron gas was observed in\nRef. 7 due to the presence a random magnetic field. In\nthis case the random field was produced by a thin film\nof rough magnetic material brought in close proximity to\nthe electron gas. The fluctuations of the field were inherited from the height fluctuations of the films surface.\nInspired by these experimental advances here we describe how power-law correlated disorder can lead to\nnovel critical behavior of the electron gas in the integer quantum Hall setting. We also analyze the effect\nof competing disorders, which are necessarily present in\nsemiconductor heterostructures, on the stability of these\ncritical points.\n\nB.\n\nQuantum percolation\n\nThe classical percolation problem provides one of the\nmost intuitive examples of a critical point. Lattice sites\nare occupied with some probability p. Nearest neighboring sites which are occupied form clusters with a typical\nsize ξ. As p is tuned to its critical value pc , which depends\non the lattice type, the correlation length ξ diverges as\nξ ∼ |pc − p|−νc . νc is the correlation length exponent,\nand in two dimensions νc = 4/3 independent of the lattice type11 .\nAn analogous picture has been put forward to describe\nthe localization transition in the integer quantum Hall\nsystem3 . For a smooth random potential (one that varies\nlittle on the scale of the magnetic length) the electron\nwave-function is localized along the level lines. For random potential symmetric around V = 0 level lines away\nfrom the zero level are closed and have a typical size ξ\nwhich is identified with the localization length. As the\nelectron's energy is tuned to the center of the Landau\nband the corresponding level line approaches V = 0 and\n\nξ diverges. If the random potential has short range correlations in space this is precisely the classical percolation\nproblem12 and one would predict a localization length\nexponent νq = νc = 4/3.\nExperiments that measure a localization length exponent in the integer quantum Hall system find νq ≈ 2.3,\nsignaling a break-down of the simple percolation picture.\nThe essential physics that has been left out is one of electron tunneling, which readily occurs at the saddle points\nof the random potential, as well as quantum interference. This was beautifully demonstrated by Chalker and\nCoddington who proposed a lattice model which takes\ninto account these purely quantum effects, by describing\nelectron dynamics as hopping from one saddle point to\nthe next with scattering matrices associated with each\nsaddle13 . The saddle points themselves occupy the vertexes of a square lattice. Computer measurements of the\nlocalization exponent for this model yield values in agreement with the experimental results. Moreover, taking a\nclassical limit of the network model, in which the scattering matrices become classical probabilities for the two\npossible outcomes of a scattering event at a vertex, leads\nto classical percolation and a localization length exponent\nof 4/314 . This provides an intriguing connection between\nthe critical points of classical and quantum percolation.\nHere we investigate the nature of this connection when\npower-law correlations are introduced in the random potential. In the classical case it was shown that this can\nlead to new critical points if the power-law decay is not\ntoo fast. We show that a similar effect occurs for the\nquantum version of percolation provided by electron localization in the lowest Landau level.\nThe paper is organized as follows. In section II we discuss the physics of classical and quantum electron motion in a disordered potential in the presence of a strong\nmagnetic field. We present scaling arguments that show\nhow the value of the critical exponent ν can be extracted\nfrom the time dependent mean square displacement (classical motion) and the time dependent wave-packet spread\n(quantum motion). In section III we describe in detail the numerical methods used to obtain the value of\nν in the classical and quantum setting. As evidence\nof the suitability of these methods, we present results\nfor short-range correlated disorder potentials that are in\ngood quantitative agreement with previous experimental\nand theoretical works2,13,14 . Section IV contains the numerical results obtained for classical and quantum electron motion in power-law correlated disorder potentials.\nIn section V we propose a framework based on the classical Harris criterion15 and its extension16 that provides\nthe theoretical support for our numerical results.\nFinally, in section VI we present results on classical\nand quantum localization in the presence of competing short-range and power-law correlated disorders. In\nexperiments7 , which we believe have a good chance of\nobserving the newly discovered quantum critical points,\nboth types of disordered potentials are present. The key\nquestion here is whether correlated quantum percolation\n\n\f3\nis stable to the addition of short-range correlated disorder.\nII.\n\nCLASSICAL AND QUANTUM MOTION IN\nTHE LOWEST LANDAU LEVEL\n\nThe methods and tools used to describe the\nlocalization-delocalization transition in the lowest Landau level (LLL) in the classical regime are considerably\ndifferent from the ones used in the quantum regime. In\nthis section, we review both approaches and present the\narguments leading to the connection between the localization exponent ν and electron dynamics.\nA.\n\nClassical motion\n\nThe two-dimensional semi-classical motion of an electron in a disorder potential under a strong constant magnetic field (along the ẑ-axis), is described by the drift motion of the electron's guiding center along equipotential\nlines:\ndr\nc\n=\n∇V (r) × ẑ;\ndt\neB\n\n(1)\n\nwhere r is the position vector for the guiding center in\nthe (x̂, ŷ) plane. This equation is derived in the adiabatic\napproximation, i.e., under the assumption that the cyclotron radius lc = v/ωc is much smaller than the typical\ndistance over which the potential changes17 . Therefore\nthe localization-delocalization transition in the LLL in\nthe classical regime, implies the study and characterization of the trajectories determined by this equation.\nEq. (1) was extensively studied in two different albeit\nrelated contexts. F. Evers18 used this equation in numerical studies of classical motion along the hulls of percolation clusters. He demonstrated interesting scaling behavior of the time-dependent density-density correlation\nfunction close to the percolation critical point.\nV. Gurarie et al.19 arrived at Eq. (1) from the classical\nlimit of the Liouvillian equation of motion for electrons\nin the lowest Landau level of the integer quantum Hall\nregime. In both cases, the authors considered smooth\nrandom potentials with short-range correlations in space.\nOne goal of this work is to study numerically properties\nof closed trajectories determined by Eq. (1), where V (r)\nis power-law correlated in space. In particular, we focus\non the scaling law, and its associated critical exponent ν,\nwhich describes how the size of a closed trajectory grows\nas the energy approaches the critical value determined\nby the V (r) = 0 equipotential.\nTo make explicit the connection between ν and the dynamics of a particle moving in a two-dimensional random\npotential, let us briefly review the argument presented in\nRef. 19. For a fixed constant value of V (r) = V0 , there\nis a set of equipotentials associated with closed electron\n\ntrajectories. These trajectories are the outer boundaries\n(hulls) of percolation clusters, with the occupation probability p of the percolation problem determined by V0 . In\nparticular, the critical value of pc = 1/2 corresponds to\nV0 = 0 in the units chosen. Several studies18,19,20 have\nshown that the mean squared displacement between two\npoints on a given trajectory ∆r2 (r is the position vector\nfor the particle on the trajectory), when averaged over\nall trajectories for fixed V0 , follows a diffusive law:\nh∆r2 (t)iV0 = D t\n\n(t ≪ t∗ ).\n\n(2)\n\nHere t∗ is a characteristic time that depends on V0 .\nAway from the percolation critical point particle trajectories are closed, and in the long-time limit the mean\nsquared displacement reaches a constant value\nh∆r2 (t)iV0 = ξ 2\n\n(t ≫ t∗ ),\n\n(3)\n\nwhere ξ(V0 ) is the localization length.\nThese considerations lead to a scaling form (at fixed\nV0 ) for the mean squared displacement\nh∆r2 (t)iV0 = D t f\n\n\u0012\n\nDt\nξ2\n\n\u0013\n\n,\n\n(4)\n\nwhere f is a scaling function. The classical result from\npercolation theory20 for the correlation length, ξ ∝ |p −\npc |−νc , leads to the expression ξ ∝ V0−νc , which in turn\nimplies\n2\n\nh∆r (t)iV0 = D t f\n\n\u0012\n\nDt\nV0−2νc\n\n\u0013\n\n.\n\n(5)\n\nFinally, by averaging this equation over all values of\nV0 one obtains the scaling relation\nh∆r2 (t)i ∼ tθ ,\n\n(6)\n\nwhere θ = 1 − 1/2νc is the anomalous diffusion exponent.\nFrom simulations h∆r2 (t)i can be computed which leads\nto a value for θ and, via the scaling relation just derived,\nto a value for the localization length exponent νc in the\nclassical regime.\nB.\n\nQuantum motion\n\nOne approach to study the localization-delocalization\ntransition in disordered quantum systems is based on\nthe different contributions that extended and localized\nelectron wave-functions make to the frequency dependent electrical conductivity21 . Localized states appear in\nthe electrical conductivity through the retarded densitydensity Green's function, a quantity that has an intuitive\n\n\f4\ninterpretation when written in terms of wave-functions.\nWhen the electron is represented by a localized wavepacket at position r and time t = 0, the Green's function\ngives the value of the wave-packet spread at time t. Since\nthis wave-packet describes the probability of finding the\nelectron at a given position and time, its spread is a measure of the uncertainty on the electron's position, and as\nsuch, an indicator of localization.\nIn most studies of localization, the Green's function\nis calculated in the momentum-frequency domain and\nstudied in detail in the limit of large momenta/small\nfrequency2,22 . The purpose of this section is to show\nexplicitly how the critical exponent νq can be extracted\nfrom the Green's function using instead the real time domain, as proposed by Sinova, Meden and Girvin23 .\nWithin this approach, one studies the disorder averaged density-density correlation function projected onto\nthe LLL, i.e., the focus is on the unconstrained spectral function. As pointed out in Ref.19, the applicability\nof the method rests upon the assumption that delocalized states in the IQH transition are isolated from each\nother and located at the centers of the Landau bands.\nThus, when the density-density correlation function is restricted to one Landau level (the lowest being considered\nfor simplicity), the contribution of the (single) delocalized state in that level dominates the sum over states\nin the small (q, ω) limit. Equivalently, the integral of\nthe spectral function over all energies is dominated by\nthe contribution from the critical energy in that limit.\nFor our purposes, the main advantage of this approach is\nthat it clearly spells out a numerical scheme for studying\nthe effect of power-law correlated disorder potentials on\nlocalization in the lowest Landau level.\nIn order to make connections with electron motion in\nthe classical regime and also to fix the notation used in\nthe rest of the paper, we review some of the main points\nof the approach. Consider 2d spinless electrons (the electron spin is fixed by the magnetic field and we assume\nthat spin-flipping interactions are not allowed) in the xy plane, under the combined effects of a magnetic field\nB = B ẑ, perpendicular to the plane and a random potential V (r) due to the presence of impurities.\nThe electron-impurity interaction is given by:\nH =\n\nX\n\nV−k ρk ,\n\nwith the projected one-particle density operator taking\nthe form:\n2\n\nρ̄k = e−lc k\n\nX\nk\n\nV−k ρ̄k ,\n\n(8)\n\ne\n\n(9)\n\nc\nΠy\neB\nc\n= y +\nΠx .\neB\n\nCx = x −\nCy\n\n(10)\n\nHere Π = p + ec A and (x, y) are the canonical momentum and position operators for one particle.\nThe formalism used to project the density operator\nρq = e−iq*r onto the LLL was developed in Refs. 25,26.\nThere it was shown that the commutation relation for the\nprojected density operator obeys a closed algebra (the\nmagnetic translation operator algebra):\n\n[ρ ̄k , ρ ̄q ] = 2 i sin\n\n\u0012\n\nl2c\nk×q\n2\n\n\u0013\n\ne\n\n−l2\nc\n2\n\nq*k\n\nρk+q ,\n\n(11)\n\nwith k × q = (k × q) * ẑ. This property implies that the\nequation of motion for the density operator\n\nı h̄\n\n∂\nρ̄ = [H̄, ρ̄]\n∂t\n\n(12)\n\nis closed and can, in principle, be solved exactly.\nFollowing the same line of argument, one can show\nthat similar results hold also for the correlation function\nof the projected density operator:\nG(r, t) = T r (ρ̄(r, t) ρ̄(0, 0))\n\n(13)\n\nnote that the trace extends over states in the lowest Landau level only. The density-density correlation function\nG in k-space satisfies the equation23 :\n\u0013\n\u0012 2\nX\n∂\nlc\nı h̄ G(k, t) =\nk × q V (k − q)\n2 i sin\n∂t\n2\nq\nexp[−\n\nk\n\nH̄ =\n\n/4 ık*C\n\nwith C, the position vector for the guiding center of a\none-particle orbit, defined as24 :\n\n(7)\n\nwhere ρk = eik*r is the one-particle density operator\nand Vk is the Fourier transform of the disorder potential. At high enough magnetic fields (or low enough temperatures), the kinetic energy is quenched to the value\nof the lowest Landau band and the sum is reduced to a\nsum over states in the LLL. Let H̄ and ρ̄ be the Hamiltonian and one-particle density operator projected onto\nthe LLL. Then,\n\n2\n\nl2c 2\n(k − k * q)] G(q, t)\n2\n\n(14)\n\nwhich follows from Eq. (11). This is a Schröedinger-like\nequation where the effective Hamiltonian is the Liouvillian matrix:\nl2c 2\n(k − k * q)]\n2\n(15)\n(The name Liouvillian is used because of the analogy\nwith the Liouvillian operator in classical mechanics.)\nAn interesting feature of Eq. (14) is that for a fixed\nvalue of the magnetic field, the magnetic length lc (l2c =\nLkq = 2 ı sin\n\n\u0012\n\nl2c\nk×q\n2\n\n\u0013\n\nV (k − q) exp[−\n\n\f5\nh̄c\neB ), vanishes in\nc\neB = 1, Eq. (14)\n\nthe classical limit h̄ → 0. In units of\ngives19 :\n< ∆r2 (t) >E ′ = D t f ′\n\n∂\nG(r, t) = ǫij ∂i V (r)∂j G(r, t).\n∂t\n\n(16)\n\nA solution of this equation is G(r, t) = δ(r−r(t)) where\ndr\n= ∇V (x, y) × ẑ .\ndt\n\n\u0012\n\nDt\nξ 2 (E ′ )\n\nci (t)|i >\n\n(21)\n\nwhere f ′ is the appropriate scaling function. Now if a\nlocalized wave-packet at time t = 0 is constructed with\nall the eigenstates (including the lone delocalized state\nat the center of the LLL), its wave-vector can be written\nas:\n′\nE\n=0\nX\n\n|ψ(t) >=\n\n|ψE ′ (t) > .\n\n(18)\n\n(22)\n\nE ′ →−∞\n\nUsing this decomposition the dispersion of |ψ(t) > can\nbe expressed as\n\n<\n\n∆r2 (t)\n\n>≃\n\nZ\n\nE ′ =0\n\ndE ′ < ∆r2 (t) >E ′ g(E ′ ) , (23)\nE ′ →−∞\n\nwhere g(E ′ ) is the density of states; the contribution\nof the cross terms can be neglected assuming that the\nextended state is non-degenerate. Specifically, it can be\nshown that the cross terms are a correction to the leading\nbehavior if there is only one extended state at the critical\nenergy (E = 0). Replacing < ∆r2 (t) >E ′ by Eq. (21),\nusing the fact that the density of states is non-singular\nand that ξ is related to E ′ by ξ(E ′ ) ∼ (E ′ )−νq , we obtain:\n\n< ∆r2 (t) > =\n\nZ\n\n0\n\ndE ′ D t g(E ′ ) f ′ (\n\n−∞\n\n|ψE ′ (t) >=\n\n,\n\n(17)\n\nIn other words, Eq. (16) describes the classical motion\nof the electron's guiding center along equipotentials of\nV (r)24 .\nAs argued above, the Liouvillian driving the quantum\ndynamics of an electron in the LLL, contains information\nabout localization and the value of the critical exponent\nνq . The following scaling argument provides a numerical algorithm for extracting the localization exponent\nfrom the time dependent projected density-density correlation function. (We would like to draw attention to\na close analogy between the present argument and the\nideas presented in Sec. II A.)\nLet us start with Eq. (8), and assume that all eigenvalues and eigenstates, localized and delocalized, are known.\nAssume next that the disorder potential breaks completely the degeneracy of the LLL, and that there is only\none extended state at energy E = 0. We construct a\nwavepacket at time t = 0 using only localized states with\nenergies in the ∆ neighborhood E ′ 6= 0, and then we let\nthe wave-packet evolve in time. The state-vector corresponding to such wave-packet is:\n′\nEX\n+∆\n\n\u0013\n\nDt\n)\nE ′−2νq\n\n(24)\n\nFinally, an appropriate rescaling gives:\n\ni=E ′ −∆\n\nwhere |i > are eigenvectors of the Hamiltonian projected\nonto the LLL (see Eq. (8)).\nAt very short times, the spread of the wave-packet as a\nfunction of time is ballistic (see Appendix for derivation).\nHowever, after some crossover time and before the localization length corresponding to the energy E ′ is reached,\nthe spread of the wave-packet averaged over disorder realizations is diffusive:\n< ∆r2 (t) >E ′ = D t\n\n(t ≪ t∗ (E ′ )) .\n\n(19)\n\nAt times much longer than t∗ ∼ ξ 2 , the localization\nlength is reached and\n< ∆r2 (t) >E ′ = ξ 2 (E ′ )\n\n(t ≫ t∗ (E ′ )) .\n\n(20)\n\nIn close analogy with the classical argument, a scaling form for the average dispersion of the wave-packet\nfollows:\n\n< ∆r2 (t) > ∝ tθ ; θ = 1 − 1/2νq ,\n\n(25)\n\nand we conclude, as in the classical case, that the spread\nof the wave-packet is sub-diffusive with an anomalous\ndiffusion exponent θ.\nTherefore, by computing < ∆r2 (t) >, the value of ν\ncan be obtained. An alternative derivation of this result has been proposed in Ref. 27, where the energy integrated Liouvillian propagator is analyzed in the finite\n(q, ω) regime and the limits of q → 0 and small ω are\ntaken.\nIII.\n\nSHORT RANGE DISORDER POTENTIAL\n\nWe introduce next the numerical procedures used to\ncalculate the value of the critical exponent ν. We do\nthis first in the case of a short-range correlated disorder\npotential, where we test the effectiveness of these numerical techniques by re-deriving previously known results.\nWe begin by introducing the method used for analyzing\n\n\f6\nclassical localization, where the connection to percolation theory provides a testing ground for our numerics.\nIn subsection III B we describe how the Liouvillian approach is implemented following the method introduced\nin Ref. 28 to analyze quantum localization. The numerical values thus obtained compare favorably to experimental results and previous numerical calculations.\n\nA.\n\nClassical motion\n\nTo study the classical motion of the electron's guiding\ncenter along the equipotentials of V (r) we make use of\na lattice model, used previously to compute geometrical\nexponents for contour loops of rough interfaces29 .\nConsider a square lattice L with N sites and periodic\nboundary conditions. Each site in the lattice has assigned\nto it a random number that represents the value of the\ndisorder potential V (r) at that point in space. Its dual\nlattice L∗ is the set of points that describe the positions\nof the electron in this potential landscape. Thus, an electron originally located at a site r0 of L∗ will move along\na path that joins points on this lattice. The trajectories are contour loops of the disorder potential. They are\ngenerated by first randomly selecting the initial position\nr0 from the set of points in L∗ . The choice of the initial position of the trajectory also fixes the value of the\nlevel V0 . V0 is computed as the average of the values for\nV (r) at the four vertexes (sites in L) that surround the\ninitial position r0 . Once V0 is determined, all the lattice sites of L can be labeled by + or −, depending on\nwhether they are at a potential higher or lower than V0 .\nThe numerical algorithm updates the electron's position\nby selecting the bond on the dual lattice that connects\nthe point r0 with one of its nearest neighbor points, with\nthe additional property that it crosses a +− bond on the\nlattice L. With this construction, the contour loop is a\ndirected walk along the bonds of the dual lattice L∗ , that\nseparates potentials lying above (below) V0 on the inside\n(outside) of the loop (see Fig. 1).\nAt each step, the square of the displacement vector\nbetween the current and original positions on the dual\nlattice is calculated. The procedure is repeated for different starting points r0 , and different disorder realizations. All the calculated quantities are averaged over all\ntrajectories and over all disorder realizations.\nA technical subtlety of this procedure is the existence\nof saddle-point plaquettes, where there are + − +− signs\ncyclically around them. In these cases, two contours (four\nlinks) meet at the center and it is necessary to add an\nadditional rule to resolve the connectivity, so as to convert this pattern into two 90◦ turns that are not quite\ntouching. A physically sensible rule makes use of the average potential Vplaq of the four potentials around the\nsaddle-point plaquette. If Vplaq < V0 , the center of the\nplaquette is at a lower potential than the contour loop\nand the connectivity is resolved by having the + sites inside the 90◦ turns. In the opposite case, Vplaq > V0 , the\n\n−0.28\n\n0.11\n\n0.25\n\n0.45\n\n−0.10\n\nV0 =−0.095\n\n0.09\n\n−0.30\n\n0.20\n\n−0.01\n\n0.01\n\n0.05\n\n−0.05\n\n−0.30\n\n0.23\n\n−0.19\n\n0.04\n\n−0.20\n\n0.20\n\n−0.10\n\n0.20\n\nSaddle point\n0.13\n\n0.02\n\n−\n\n+\n+\n\n0.06\n\n+\n\n−\n\nFIG. 1: Classical trajectory of the electron's guiding center, in the presence of a random potential whose values are\nindicated. V0 is the average potential around the plaquette\nsurrounding the initial point of the trajectory. The resolution of a saddle point is determined by the average potential\naround the plaquette surrounding the saddle.\n\n+ sites are outside of the 90◦ turns (see Fig. 1).\nAs in Ref. 19 we find from simulations that the average\ntime for an electron to traverse a certain distance on L∗\nis proportional to the distance. This observation justifies\nusing the number of steps along L∗ to measure the time\nelapsed. In this way time is rendered dimensionless.\nThe computations were carried out on two-dimensional\nsquare lattices with system sizes N = 256, 512 and 1024.\nThe values for the short-range correlated potential were\nchosen independently from site to site from a uniform\ndistribution over the range [−0.5, 0.5]. This choice leads\nto V = 0 for the value of the critical equipotential energy.\nFig. 2 shows results for a 1024 x 1024 lattice obtained\nby averaging over 3 × 104 trajectories and 1000 different\ndisorder realizations.\n\nAs discussed above, the diffusive (slope θ = 1), shorttime (t < t∗ ∼ 10), behavior is followed by a crossover\nto a critical regime where the value of the slope θ is a\nmeasure of the critical exponent νc ; θ = 1 − 1/2νc. By\nfitting the critical region to a line on a log-log graph we\nfind\nνc = 1.25 ± 0.05\n\n(26)\n\nwhere the error bars reflect the uncertainty associated\nwith choosing the critical region.\nThis value compares well with the exact result from\n\n\f7\nThe electron density operator ρ(k1 , k2 )\n=\nexp(2πi(k1 x + k2 y)) projected onto the LLL using this basis, is a matrix of the form:\n\u0013\n\u0012 2\nk + k22\nπ L(k1 , k2 )\nρ̄(k1 , k2 ) = exp − 1\n2N\n\n0.1\n\n2\n\n< ∆ r (t) >\n\n1\n\n(28)\n\nwhere k1 , k2 are integers ((k1 , k2 ) 6= (0, 0)), and the matrix L(k1 , k2 ) is given in terms of two unitary unimodular\nN xN matrices:\n\nν = 1.25 +/- 0.05\n0.01\n\n1\n\n10\n\n100\n\nt\n\n1000\n\n10000\n\n1e+05\n\nFIG. 2: Averaged mean square displacement for a classical\nparticle drifting along equipotentials of a random short-range\ncorrelated potential. Distance is measured in units of lattice\nspacing and time in number of lattice steps. System size is\n1024 × 1024. ν is related to the slope in the critical region θ,\nby θ = 1 − 1/2ν.\n\npercolation theory νc = 4/311 . The critical regime\nextends until finite size effects become dominant and\n< ∆r2 > saturates, as observed in Fig. 2 for t > 2 × 104 .\n\nB.\n\nQuantum motion\n\nFollowing the ideas presented in Sec.II B, we studied\nnumerically the role played by quantum effects on electron dynamics in the lowest Landau level and in the presence of a short-range correlated random potential.\nWe use the approach proposed in Ref. 19 and use the\neigenstates of the Hamiltonian for an electron on a torus\ngeometry as the basis of states for the LLL. The corresponding wave-functions written in the Landau gauge\nare:\n\nψα (x, y) =\n\n\"\n\n∞\nX\n\nexp (2π(x + ıy)(N m + α)−\n\nm=−∞\n\n(N m + α)2\nπ\nN\n\n\u0013\u0015\n\ne−πN x\n\n2\n\nL(k1, k2) = ǫk1 k2 /2 f k1 hk2\n\n\n0 1 ... ...0\n 0 0 1 ...0 \nh = \n...... ... ... ... \n0 ... ... ...0\n\n(27)\n\nwhere m takes integer values, N is the number of flux\nquanta through the torus, and the index α goes from 0\nto N − 1, labeling the N states in the LLL. These wavefunctions are periodic functions in the interval (x, y) ∈\n[0, 1) × [0, 1), and are centered along narrow strips (of\nwidth lc ) around the lines x = α/N ; an example is shown\nin Fig. 4a). In Eq. (27) (x, y) are dimensionless variables\nexpressed in units in which the magnetic length is lc =\n1/2πN .\n\nf = diag(1, ǫ, ..., ǫN −1 )\n\nwith ǫ = exp( 2πi\nN ); note that h is a cyclic permutation\nmatrix. These matrices satisfy: h f = ǫ f h and hN =\nf N = 1. The explicit expression for the matrix elements\nof L(k1 , k2 ) is:\n[L(k1 , k2 )]α,β = ǫk1 k2 /2+k1 (α−1) δα,β−k2 |modN\n\n(29)\n\nBecause the basis of states is restricted to the LLL, the\nkinetic energy is a constant and the projected Hamiltonian, reduces to:\nH̄ =\n\nX\n\nV (−k1 , −k2 ) ρ̄(k1 , k2 )\n\n(30)\n\nk1 ,k2\n\n=\n\nX\n\nk1 ,k2\n\n\u0013\n\u0012 2\nk + k22\nπ L(k1 , k2 )\nV (−k1 , −k2 ) exp − 1\n2N\n\nwhere the sum runs over all integer values of (k1 , k2 ), and\nV (0, 0) = 0 (this choice amounts to fixing the critical\nenergy at zero).\nIn this basis, the Hamiltonian is a random N xN matrix that can be diagonalized exactly. Notice that the\nprojection operation introduces the exponential factor in\nEq. (31) that effectively reduces the amplitude of the\nlarge (k1 , k2 ) Fourier components of the potential (it acts\nas a soft large-momentum cutoff). The presence of this\nfactor seems to indicate that the transition is driven by\nthe small momenta components of the disorder potential. It is important to remark, that even when a numerical calculation procedure fails (due to large but finite precision) to detect the contribution coming from\nmomenta components higher than a maximum value for\n(k12 + k22 )/2N (numerically, the Hamiltonian matrix becomes a banded-matrix), it is incorrect to replace the\nexponential factor by a hard-cutoff, since the commutation relations of the projected density operator25 are\nviolated. (In numerical calculations, this translate into\n\n\f8\nhaving results that are extremely sensitive to the value\nof the hard-cutoff chosen.)\nThe values for the Fourier components of the disorder\npotential in Eq. (31) are chosen randomly from a flat\ndistribution over the interval [−0.5, 0.5] in units of h̄ωc .\nWe diagonalize the Hamiltonian to obtain all N eigenvalues and eigenfunctions. Figure 3 shows examples of\na localized state at the tail of the Landau band, and a\ndelocalized one close to the band center, obtained with a\nbasis of N = 1000 states.\n\nfor the localized wave-packet and different disorder realizations. The spread is averaged over all initial positions\nand disorder realizations. A typical result for a basis of\n1000 states and some 1000 disorder realizations is plotted\nin Fig.5.\nAs in the classical case, three regimes can be identified.\nFor long enough times (t > 10 in Fig.5) the spread of\nthe wave-packet reaches a constant value indicating the\ninfluence of the finite system size. The critical region\ncorresponds to intermediate times (0.4 < t < 10), and the\nvalue of νq (\"q\" for quantum) can be related to the slope\nof the line, which is the anomalous diffusion exponent θ\n(see Eq. (25)). As seen in the inset to Fig.5, the slope\nin the critical region shows a strong dependence on the\nsystem size. To take into account these finite size effects,\nwe determined the slope for systems sizes ranging from\nN = 200 to N = 1500 and compute the value for an\ninfinite sized system by linear extrapolation to obtain\nνq = 2.33 ± 0.09.\nOur result compares favorably to the values measured\nin experiments (ν = 2.3 ± 0.1)30 and previous numerical\nsimulations (ν = 2.35 ± 0.05)2 . This provides an important check on the numerical method.\nOur data shows that at very short times the slope θ ≃ 2\nwhich implies ballistic spreading of the wave-packet. In\nthe Appendix we present a calculation based on perturbation theory that shows that this is a result of averaging the evolution equation over random disorder, at short\nenough times.\nIV.\n\nFIG. 3: Squared amplitude of a localized eigenstate with\nenergy E = 9.6 (top), and a delocalized one with E = 0.011\n(bottom), in the lowest Landau level with degeneracy N =\n1000. The disorder potential is short ranged.\n\nA localized wave-packet is constructed with all the\neigenstates for a given disorder realization and, as it\nevolves, its spread along the x-direction is computed as\na function of time. The wave-packets are chosen from\namong the basis states, Eq. (27), which are localized\nin the x-direction and completely spread out in the ydirection (see Fig. 4a). Thus, the contribution to the\ntotal spread from the y-direction is a constant proportional to the system size. Fig.4 shows a set of 'snapshots'\nfor the evolution of the wave-packet initially localized at\nx = 0.5.\nThe procedure is repeated for different initial positions\n\nPOWER-LAW CORRELATED DISORDER\nPOTENTIAL\n\nIn this section we address the central issue raised by\nthe present work: how a change in the properties of the\nprobability distribution for the disorder potential affect\nthe nature of localization in the lowest Landau level. The\nnumerical procedure outlined in previous sections allows\nus to investigate this point in a straightforward manner\nfor both the classical and the quantum regime. Basically,\nit amounts to an appropriate modification of the probability distribution for the Fourier components for the random potential in Eq. (31). Since we are interested in the\neffect of power-law correlations on localization properties\nof the Hamiltonian in Eq. (31), the Fourier components\nare chosen independently with a Gaussian distribution\nwith zero mean, and variance\n|V (k)|2 ∝ 1/|k|2−α .\n\n(31)\n\nInverse Fourier transforming to real-space leads to powerlaw correlations\nV (r)V (0) ∼ 1/|r|α .\n\n(32)\n\nThe constant in Eq. (31) is fixed so that the variance of V (r) is normalized to one. Long-range correlations strongly modify the real-space configuration of the\n\n\f9\n\nFIG. 4: Evolution of a wave-packet made of all eigenstates that is initially localized at x = 0.5. The squared amplitude of the\nwave-packet is plotted as a function of the real space coordinates (x, y) at four different times.\n\nequipotential lines as can be seen in Fig. 6 where a comparison between a short-range and a power-law correlated\npotential with α = 0.5 is given.\n\nA.\n\nClassical motion\n\nIn the classical limit of the IQH transition, the effect\nof power-law correlations in the disorder potential can\nbe described in terms of a purely geometric effect: they\nchange the fractal geometry of the equipotential contours\nmodifying the electron's path, and correspondingly, the\nanomalous diffusion law for its mean squared displacement.\nTo study numerically this regime, we repeated the procedure described in Sec.III A, and computed h∆r2 (t)i for\nvalues of α ranging from 0.33 to 1.8. Fig. 7 shows the\ncurves obtained for a system of 512 x 512 lattice sites.\nAs in the case of short-range correlations, three regimes\ncan be identified with the onset of each of them depending on the value of α. From the figure, a qualitative\n\nchange in the spread of the electrons position in time\nis observed. Namely, in the critical regime (typically for\n30 < t < 1100), the value of the slope becomes dependent\non α when α ≤ 1.5. As the value of α decreases (correlations increase) below a critical value of α∗c ≃ 1.5 ('c' is for\n'classical'), the slope θ in the critical region increases and\nν becomes an increasing function of α tending to infinity\nas α approaches zero.\n\nB.\n\nQuantum motion\n\nIn contrast to the classical regime, the effect of powerlaw correlations in the disorder potential on the properties of quantum localization, does not have a simple\ngeometrical interpretation. In particular, we find that\nchanging the fractal properties of the equipotentials does\nnot always lead to a change in the quantum critical exponents.\nThe numerical procedure introduced in Sec. III B is\neasily extended to the present case allowing us to study\n\n\f10\n0.1\n\n2\n\n< ∆ x (t) >\n\nν = 2.33 +/- 0.09\n0.01\n\n0.96\n0.92\n\nθ 0.88\n\n0.001\n\n0.84\n0.8\n0.76\n0\n\n0.0001\n0.1\n\n0.002\n\n0.004\n\n1/N\n1\n\nt\n\n10\n\n100\n\nFIG. 5: Spread of wave-packet as a function of time, in the\npresence of short-range correlated disorder potential with a\nbasis of N = 1000 states. The spread at intermediate times\nis sub-diffusive. The inset shows the anomalous diffusion exponent θ as a function of basis size N . The intercept gives\nthe infinite-system-size value of θ which leads to the quoted\nvalue of the localization exponent ν (ν = 1/(2 − 2θ)).\n\nthe problem in detail. The Fourier components of the\nrandom potential are taken from the same distribution\nas in the classical case and the corresponding quantum\nHamiltonian (Eq. (31)) is diagonalized. Then, < ∆x2 >\nis computed as a function of time for values of α ranging\nfrom 0.1 to 1.9. A typical set of results obtained with a\nbasis of 1000 states is shown in Fig. 8 together with the\ncurve obtained for a short-range correlated potential. As\nin the short-range case, the exponent θ was calculated\nfor different systems sizes ranging from N = 300 to N =\n1000.\nLike in the classical case, a qualitative difference in\nthe slopes of the critical regime develops as α changes.\nA careful comparison among the different curves shows\nthat the value of the slope in the critical region starts\nto increase below a critical value of α∗q ≃ 0.85. A detailed quantitative analysis of these results together with\na comparison to the classical case is the subject of the\nfollowing section.\n\nV.\n\nEXTENDED HARRIS CRITERION\n\nThe effect of a random disorder potential on the properties of continuous phase transitions in classical systems\nis summarized by the Harris criterion15 . Basically, the\ncriterion states that critical exponents of the disordered\nand the corresponding clean system remain equal as long\nas the value for the correlation length exponent ν satisfies: dν − 2 ≥ 0, where d is the dimensionality of the classical system under consideration. The criterion is derived\nby requiring that the fluctuations of the thermodynamic\n\nFIG. 6: Contour plot of a typical realization of a short-range\ncorrelated potential (top) and a power-law correlated one with\nexponent α = 0.5.\n\nquantity which couples to the disorder, within a volume\nset by the correlation length ξ, do not grow faster than\nits average value, as the transition is approached and\nξ → ∞. It was proved rigorously and generalized to a\nwider class of systems if an appropriate definition for the\ncorrelation length is adopted31 . An extension of the criterion to power-law correlated disorder was proposed by\nWeinrib and Halperin16 .\nIn the case of two-dimensional percolation with powerlaw correlations in the occupation probabilities, with\nthe power-law exponent α, the extended Harris criterion\nstates:\nα > α∗c = 3/2\nα < α∗c = 3/2\n\n4\n3\n2\nνc = .\nα\n\nνc =\n\n(33)\n\nAs a numerical check on Eq. (33), we computed the\nvalues of the anomalous diffusion exponent θ for classical\nelectron motion and plotted them as a function of α in\nFig. 9. The values of θ were obtained from fitting the data\n\n\f11\n1.1\n\n1\n\nθ = 1 − α/4\n\n0.9\n\nθ\n\n0.1\n\n2\n\n< ∆ r (t) >\n\n1\n\n0.8\n\nα = 1.90\nα = 1.80\nα = 1.66\nα = 1.50\nα = 1.33\nα = 1.00\nα = 0.66\nα = 0.33\n\n0.01\n\n0.001\n1\n\n10\n\n100\n\nt\n\n1000\n\n10000\n\n0.7\n\n0.6\n\n0\n\nθ = 0.625 +/− 0.01\n1\n\n0.5\n\n1.5\n\nα\n\n2\n\n1e+05\n\nFIG. 7: Classical motion: averaged mean square displacement\nas a function of time for 512 × 512 system size. Distances are\nmeasured in units of lattice spacing and time in number of\nlattice steps.\n\nFIG. 9: Classical regime: exponent θ as a function of powerlaw correlated disorder exponent α. The horizontal line represents the theoretical value of θ = 0.625 corresponding to the\nvalue of νc = 4/3 obtained from 'classical' percolation theory.\nThe linear dependence of θ = 1 − α/4 is the prediction of the\nextended Harris criterion, Eq. (33)\n.\n\nfollowing the same procedure as in the classical case. The\nvalues plotted are the extrapolation corresponding to an\ninfinite system size. We see that the numerical results\npresented in Fig. 10 are in good agreement with the extended Harris criterion which now reads:\nα > α∗q ≈ 0.85\nα < α∗q ≈ 0.85\n\nFIG. 8: < ∆x2 > as a function of time for various values\nof the power-law correlated disorder exponent. Anomalous\ndiffusion appears at intermediate times. The top four curves\nhave been multiplied by a factor of 10 for clarity.\n\nin Fig. 7, in the critical region, to a line using a leastsquares method; θ is the slope of the line. We see that\nthe data is well described by the theoretical prediction:\nabove α∗c = 3/2 the anomalous diffusion constant θ =\n1 − 1/2νc = 5/8 is constant, while below this value it\nvaries as θ = 1 − α/4. Similar results were obtained\npreviously by Prakash et al.32 .\nAnalogous results hold true for the quantum case. In\nFig. 10 we plot the anomalous diffusion exponent θ, which\ndescribes the spreading of an initially localized wavepacket in the lowest Landau level, as a function of α.\nThe exponent θ was computed using the data in Fig. 8\n\nνq ≈ 2.33\n2\nνq = .\nα\n\n(34)\n\nSupport for the validity of the extended Harris criterion for quantum critical points was also provided by\nstudies of random quantum magnets33 .\nIn the case of quantum percolation (i.e., localization\nin the lowest Landau level) the extended Harris criterion\ncan be argued for in close analogy to the classical case16 .\nNamely, consider the average size of the fluctuations of\nthe electron's energy in an area set by the localization\nlength ξ. Like the electron's energy, it is also determined\nby the random disorder potential, and can be approximated as:\n\nE2\n\n≈\n\n\u0012\n\n1\n∼\nξ\n\n1\nξ2\nZ\n\nZ\n\nd2 xV\nξ2\n\n\u00132\n(x)\n\nd2 x|x|−α\n\n(35)\n\nξ2\n\nwhere in deriving the second equation we have made use\nof < V (x)V (x′ ) >∼ 1/|x − x′ |α .\nFor the quantum critical point associated with localization in the lowest Landau level to be stable to the\nintroduction of power-law correlations in the random potential, the fluctuations in the electron's energy should be\n\n\f12\n1.1\n\nexponent ν according to Eq. (33). For instance, a value\nof α = 1 gives νq = 2.33 while νc = 2.0. This analysis\nsuggests that the relation given by Eq. (37) (whatever\nthe argument used to support it) is inconsistent with the\nHarris criterion.\n\nθ = 1 − α/4\n1\n\nθ 0.9\nVI.\n0.8\n\nθ = 0.786 +/− 0.008\n0.7\n0\n\n0.5\n\n1\n\nα\n\n1.5\n\n2\n\nFIG. 10: Quantum regime: anomalous diffusion exponent\nθ = 1 − 1/2νq as a function of the exponent α, which determines the power-law correlations of the disorder. The lines\nare predictions of the extended Harris criterion (Eq. (34)) using the value νq = 2.33 for the quantum localization length\nexponent, in the case of short-range correlated disorder.\n\nsmall when compared to its energy E. Using Eq. (35),\nand the scaling relation E ∼ ξ −1/ν we arrive at the estimates\n\nE 2ν−2\n\nE2\n2ν−2\nln(E)−ν\n∼ E\n\nE2\nE αν−2\n\n: α>2\n: α=2\n: α<2.\n\n(36)\n\nThe quantum percolation critical point is expected to\nbe unaffected by the introduction of power-law correlations if E 2 /E 2 → 0 when E → 0, or, equivalently, when\nξ → ∞. Since ν > 1 this is always the case when α ≥ 2.\nHowever for α < 2 there are two regimes to consider.\nWhen 2 > α > 2/ν, E 2 /E 2 → 0 and the localization\ncritical point due to short-ranged potential disorder is\nagain stable to introduction of power-law correlations in\nthe random potential. In contrast, for values of α < 2/ν\na power-law correlated potential produces large fluctuations in the energy thus destabilizing the critical point.\nThe usual expectation is that this relevant perturbation leads to a new quantum critical point characterized\nby a new value of ν. This is confirmed by our numerical\nresults.\nAn important consequence of the present result regards\nthe validity of the expression put forward in Ref. 34, that\nrelates the values of νq and νc as follows:\nνq = νc + 1\n\n(37)\n\nAccording to the analysis presented above, a quantum system with a long-range correlated potential has\nthe same critical exponent as one with short-range correlations as long as α ≥ 0.85. However, a classical system\nwith potential correlations with a value for α in the region 0.85 < α < 1.5, has a continuously varying critical\n\nCOMPETING DISORDERS\n\nIn this section we undertake a numerical study of the\neffect of competing disorders on localization in the LLL.\nWe investigate first the classical regime, which is in the\nuniversality class of correlated percolation. Analytical\ncalculations4 have shown that in these systems the classical critical point generated by a long-range correlated\npotential is stable against perturbations produced by a\nshort-range correlated potential. As shown below, our\nnumerical results in this regime, provide support for this\npicture.\nIn the quantum case we investigate the effect of competing power-law correlated and short-range correlated\ndisorders on localization. Numerical studies of this particular case are relevant for experiments attempting to\nmeasure properties of the correlated quantum percolation critical point. Namely, since short-range correlated\npotentials are always present in experimental setups, it is\nimportant to understand quantitatively how their presence affects the values of the new localization length exponents described in the previous sections.\nTo proceed with the appropriate numerical model we\nfirst establish the following conventions. The total disorder potential is defined as a weighted sum of two potentials: one with short-range correlations Vs (r) and one\nwith long-range correlations Vl (r). The units chosen are\nsuch that the mean values of short- and long-range correlated potentials are set equal to zero while their variances\nare normalized to one. In this way, the maximum amplitudes of both potentials are comparable. In order to\nvary the relative strength of each potential we introduce\na parameter κ with values in the range 0 ≤ κ ≤ 1 such\nthat the total potential is:\nVef f (r) = κ Vs (r) + (1 − κ) Vl (r) .\n\n(38)\n\nNotice that when κ = 0 the total potential has powerlaw correlations only, while the short-ranged part is increasingly dominant as the value of κ increases toward 1.\nThis definition ensures that the variance of the total po2\ntential Vef f remains fixed as κ changes and hVef\nf (r)i = 1.\nThe numerics were performed with short-range correlated potentials constructed from random Fourier components V (k) sampled from a uniform distribution, and\nfrom a Gaussian distribution with variance ∼ |k|α−2 with\nα > α∗ . In real space this leads to delta-correlations\nand power-law correlations with exponent α, respectively.\nLong-range correlated potentials were generated with\npower-law correlations with exponent β < α∗ , for which\nthe extended Harris criterion predicts a new localization\n\n\f13\nTABLE I: Statistical properties of the short-range and longrange correlated potentials used in section VI.\nVef f (r)\nhVs (r)i = hVl (r)i\nhVs2 (r)i = hVl2 (r)i\nhVs (r)Vs (r′ )i\nhVl (r)Vl (r′ )i\n\n=\n=\n=\n∝\n∝\n\nκ Vs (r) + (1 − κ) Vl (r)\n0\n1\n|r − r′ |−α , δ(r − r′ )\n|r − r′ |−β\n\nlength exponent ν = 2/β. The properties of the total\npotential and its components is summarized in Table I.\nA note on the evaluation of errors: as it will be shown\nin the following sections, the effect of tuning κ 6= 0 depends on system size for both classical and quantum\nregimes. Hence, it was not possible to carry out the finitesize study similar to the one done previously, where there\nis only one type of disorder present. As a consequence,\nthe errors have been estimated from the largest systematic error involved in the procedure, which appears in the\ndetermination of the slope of the critical region.\n\nthe value of θ (and hence of ν) remains closer to the\npure long-range value up to fairly large values of κ\n(roughly 55% − 60%). The increasing sharpness of the\ncrossover with increasing system sizes suggests a very\nsharp crossover in the thermodynamic limit. In the language of renormalization group, this is an indication of\nthe stability of the long-range critical point when perturbed with a short-range correlated potential. Notice,\nas it was pointed out above, that this crossover is strongly\ndependent on the system size, rendering useless the finitesize scaling analysis used previously. An interesting effect\nis observed in the raw data that points to the way the\ncrossovers occur in finite size systems. Between the initial\ncrossover from diffusive to sub-diffusive motion and the\nfinal crossover from sub-diffusive motion to saturation,\nthere are two clearly distinguishable regimes. At the earlier times, the slope is determined by the short-range\ncorrelated potential. Only at latest times (and before\nsaturation effects dominate), a new slope appears that\ncorresponds to the value of θ determined by the exponent of the power-law (long-range) correlated potential.\n\nB.\nA.\n\nComputations were carried out for system sizes N =\n256, 512 and N = 1024. The values of the anomalous diffusion exponent θ were extracted from the critical region\nof the spread of the classical position of the electron, as\nin section IV A. Values of θ were obtained for a range\nof values of the parameter κ. Fig. 11 shows result that\ncorrespond to a combination of a power-law correlated\npotential with exponent β = 0.5 (for the long-range part)\nand α = 1.8 (for the short-range piece).\n\n0.9\n\n0.8\nN= 1024\nN= 512\nN = 256\n\nθ 0.7\n0.6\n\n0.5\n\nθ = 0.625\n0\n\n0.2\n\nQuantum Regime\n\nClassical Regime\n\n0.4\n\nκ\n\n0.6\n\n0.8\n\n1\n\nFIG. 11: Classical regime: slope θ as a function of parameter κ. κ = 0(1) indicates a pure long-range (short-range)\ncorrelated potential.\n\nThe figure shows that, as the system size increases\n\nIn contrast to the classical regime, up to date, there\nis no experimental or theoretical work to our knowledge\nthat attempted to investigate the influence of mixed longrange and short-range correlated disorder potentials on\nthe integer quantum Hall transitions. The numerical\nstrategy used in section IV B, provides us with a framework to study this situation and allows us to examine the\nstability of newly found quantum critical points.\nComputations for quantum systems were carried out\nwith a basis of N = 500, 700 and N = 1000 states. The\nvalues of the slope θ were extracted from the critical region and plotted as a function of the parameter κ, as in\nthe classical regime. The results shown in Fig. 12 were\nobtained with power-law correlated potentials Vs and Vl\nwith exponents α = 1.8 and β = 0.5, respectively.\nAs the figure shows, data for the quantum regime is\nnoisier than its classical counterpart. Finite size effects\nare also more prominent as can clearly be observed in the\nvariation of the values of the slope θ. However, the trend\nobserved is in agreement with the expected behavior in\nthe thermodynamic limit. It suggests that the new quantum correlated critical points are indeed stable against\nthe perturbation introduced by a short-range correlated\npotential. This opens up the prospect of measuring the\nnew localization length exponents νq in experiments in\nwhich random disorder with power-law correlations is introduced. The idea would be to engineer a random potential with desired properties which would then compete with the short-range disorder due to the presence\nof impurities in the semiconductor heterostructure. An\nexample of such a system was described in Ref. 7 where\na thin magnetic film was placed in close proximity to\nthe two-dimensional electron gas resulting in a random\n\n\f14\n1\n0.95\n\nθ\n\n0.9\n0.85\n\nN=1000\nN=700\nN=500\n\nθ = 0.786\n\n0.8\n0.75\n\n0\n\n0.2\n\n0.4\n\nκ\n\n0.6\n\n0.8\n\n1\n\nFIG. 12: Quantum regime: slope θ as a function of parameter\nκ. κ = 0 indicates a purely long-range correlated potential,\nκ = 1 corresponds to a purely short-range correlated potential.\n\nmagnetic field. By controlling the height fluctuations of\nthe film one can in principle engineer a random potential\nwith desired correlations.\n\nVII.\n\nCONCLUSIONS\n\nWe have analyzed the effect of spatial correlations of\nthe disorder potential on the localization-delocalization\ntransition in the integer quantum Hall system. The main\npurpose of the analysis was to understand separately the\nrole played by quantum effects and disorder on the critical properties of the transition by comparing classical\nand quantum localization.\nThe analysis of electron localization in the classical\ncase reveals that the localization length exponent is completely determined by the statistical properties of the\nlevel lines of the random potential. Using the tools of\npercolation theory, we were able to implement well established numerical methods to perform a detailed check\nof the validity of the Harris criterion. We found numerical support for the extended version of the criterion, confirming previous theoretical arguments4 .\nThe quantum regime was analyzed by studying the real\ntime density-density propagator as proposed in Ref.23.\nThis method, originally introduced as an alternative way\nto calculate the critical exponent ν for a short-range\ncorrelated potential, proved to be an excellent testing\nground to analyze the role of disorder. We obtained (following a rather simplistic finite size analysis) a value for\nν = 2.33 ± 0.09 remarkably close to experimentally measured values and numerically calculated ones. We also\nfound that when the decay of power-law correlations of\nthe random potential is slow enough this can destabilize the quantum critical point and lead to new critical\nbehavior, as predicted by the extended Harris criterion.\n\nComparison between classical and quantum regimes\nwith long-range correlated disorder potentials, indicate\nthat the effect of disorder correlations are qualitatively\nsimilar for quantum and classical systems. The main difference between these two cases seems to be the critical\nvalue of α (the exponent determining the long-range correlations) below which the value of ν is changed. The\nvalue of α∗q ≃ 0.85 is smaller compared to its classical\ncounterpart α∗c = 1.5. This suggests that quantum fluctuations can be thought of as effectively smearing out the\ncorrelations in the random potential thus shifting α∗ .\nAn immediate consequence of these results is that in\nthe quantum case, there is no direct connection between\nthe statistical properties of equipotential lines and the localization length exponent. Specifically, we were able to\nshow that the fractal geometry of the equipotential lines\ncan be continuously varied while the quantum localization length exponent does not not change.\nThe detailed numerical study of the variation of the\ncritical exponent ν with the power-law exponent α, led\nus to propose a precise statement for the quantum version\nof the extended Harris criterion. These numerical results\nare supported by a scaling argument, in close analogy\nwith the classical case.\nIn order to address the experimentally relevant situation of samples with disorder potentials of different origins and likely, different correlations, we analyzed the\neffect of competing correlations in disorder potentials on\nthe IQHT. In the semi-classical limit, our numerical results give support to previous theoretical arguments for\nthe stability of the classical correlated-percolation critical points. In the quantum regime we observed that,\nwhile the value of the critical exponent ν varies as the\nshort-range correlated potential is introduced, the trend\nis similar to the one observed in the classical regime.\nAs a consequence, our results show no qualitative difference between classical and quantum regimes regarding\nthe stability of these critical points. More importantly,\nthey point to the possibility of seeing effects of the correlated quantum percolation critical points in experiments\non two-dimensional electron gases in semiconductor heterostructures where short-range disorder due to impurities is unavoidable.\nIt is a pleasure to acknowledge useful conversations\nwith B. Halperin, J. Sinova, V. Gurarie, S. Boldyrev, J.\nMoore, H. Castillo, S. Simon and G. Murthy. JK is supported by the NSF under grant number DMR-9984471,\nand is a Cottrell Scholar of Research Corporation.\n\nAPPENDIX\n\nIn this appendix we present a calculation based on perturbation theory that shows that at short times the wavepacket has a ballistic spread, which is what was observed\nnumerically. If |ψ(t)i is the wave-function of the wavepacket at time t, the spread is given by:\n\n\f15\n\nhψ(t)|∆x2 |ψ(t)i = hψ(t)|x2 |ψ(t)i − hψ(t)|x|ψ(t)i2 (A.1)\n\nhψ(t)|x2 |ψ(t)i = hψ(0)|x2 (0)|ψ(0)i\n(A.4)\n+ i t hψ(0)|[H; x2 (0)]|ψ(0)i\n(i t)2\nhψ(0)|[H; [H; x2 (0)]]|ψ(0)i + O(t3 ).\n+\n2!\n\nHere we analyze the first term in detail, while the second one can be dealt with in a similar way.\nIn the Heisenberg representation:\n2\n\n2\n\nhψ(t)|x |ψ(t)i = hψ(0)|x (t)|ψ(0)i\n\n(A.2)\n\nx2 (t) = eiHt x2 (0) e−iHt .\n\n(A.3)\n\nwhere\n\nUsing the well known operator identity:\n\n∗\n†\n‡\n1\n\n2\n\n3\n4\n5\n\n6\n\n7\n\n8\n\n9\n10\n\n11\n12\n13\n\n14\n\n15\n16\n\n17\n\n18\n\nElectronic address: sandler@ohio.edu\nElectronic address: maei@brandeis.edu\nElectronic address: kondev@brandeis.edu\nH. Levine, S. B. Libby, and A. M. M. Pruisken, Phys. Rev.\nLett. 51, 1915 (1983).\nB. Huckestein, Rev. Mod. Phys. 67, 357 (1995), and references therein.\nS. A. Trugman, Phys. Rev. B 27, 7359 (1983).\nA. Weinrib, Phys. Rev. B 29, 387 (1984).\nP. Cain, R. A. Römer, M. Schreiber, and M. E. Raikh,\nPhys. Rev. B 64, 235326 (2001).\nN. Sandler, H. Maei, and J. Kondev, Phys. Rev. B (2003),\nin press.\nL. Zielinski, K. Chaltikian, K. Birnbaum, C. M. Marcus,\nK. Campman, and A. C. Gossard, Europhys. Lett. 42, 73\n(1998).\nE. Abrahams, P. Anderson, D. Licciardello, and T. Ramakrishnan, Phys. Rev. Lett. 42, 673 (1979).\nR. Laughlin, Phys. Rev. B 23, 5632 (1981).\nG. Finkelstein, P. Glicofirdis, R. Ashoori, and\nM. Shayegan, Science 289, 90 (2000).\nM. P. M. den Nijs, J. Phys. A 12, 1857 (1979).\nM. Isichenko, Rev. Mod. Phys. 64, 961 (1992).\nJ. T. Chalker and P. D. Coddington, J. Phys. C 21, 2665\n(1988).\nD.-H. Lee, Z. Wang, and S. A. Kivelson, Phys. Rev. Lett.\n70, 4130 (1993).\nA. B. Harris, J. Phys. C 7, 1671 (1974).\nA. Weinrib and B. I. Halperin, Phys. Rev. B 27, 413\n(1983).\nT. G. Northrop, The adiabatic motion of charged particles\n(John Wiley and Sons, New York, 1963).\nF. Evers, Phys. Rev. E 55, 2321 (1997).\n\nThe probability distribution of energies is determined\nby the probability distribution of the disorder potential,\nwhich is chosen to be symmetric around the value V = 0.\nSince the wave-packet contains all the eigenstates, the\naveraging over disorder (average over energies) eliminates\nthe linear term in the expansion above. Thus, the first\nnon-vanishing contribution at short times is given by the\nquadratic term which corresponds to a ballistic spread.\n\n19\n\n20\n\n21\n22\n\n23\n\n24\n\n25\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n\n33\n34\n\nV. Gurarie and A. Zee, Int. Journal of Modern Physics B\n15, 1225 (2001).\nR. M. Ziff, X. P. Kong, and E. G. D. Cohen, Phys. Rev. A\n44, 2410 (1991).\nD. J. Thouless, Phys. Rep. 13, 93 (1974).\nJ. T. Chalker and G. D. Daniell, Phys. Rev. Lett. 61, 593\n(1988).\nJ. Sinova, V. Meden, and S. M. Girvin, Phys. Rev. B 62,\n2008 (2000).\nZ. F. Ezawa, Quantum Hall Effects:Field Theoretical Approach and Related Topics (World Scientific, Singapore ;\nRiver Edge, NJ, 2000).\nS. Girvin and T. Jach, Phys. Rev. B 29, 5617 (1984).\nS. Girvin, in Proc. of Les Houches Summer School on Topological aspects of low dimensional systems. France 1998.,\nedited by A. Comtet, T. Jolicoer, S. Ouvry, and F. David\n(Springer-Verlag, France, 2000).\nV. Oganesyan, J. T. Chalker, and S. L. Sondhi, Phys. Rev.\nB 68, 45318 (2003).\nS. Boldyrev and V. Gurarie, Journal of Physics, Condensed\nMatter 15, L125 (2003), cond-mat/0009203.\nJ. Kondev, D. Salinas, and C. Henley, Phys. Rev. E 61,\n104 (2000).\nS. Koch, R. J. Haug, K. von Klitzing, and K. Ploog, Phys.\nRev. Lett. 67, 883 (1993).\nJ. T. Chayes, L. Chayes, D. S. Fisher, and T. Spencer,\nPhys. Rev. Lett. 57, 2999 (1986).\nS. Prakash, A. Havlin, M. Schwartz, and H. E. Stanley,\nPhys. Rev. A 46, 1724 (1992).\nH. Rieger and F. Iglói, Phys. Rev. Lett. 83, 3741 (1999).\nG. V. Mil'nikov and I. M. Sokolov, JETP Lett. 48, 536\n(1989).\n\n\f"}