{"id": "http://arxiv.org/abs/cond-mat/0205089v2", "guidislink": true, "updated": "2002-10-11T13:11:10Z", "updated_parsed": [2002, 10, 11, 13, 11, 10, 4, 284, 0], "published": "2002-05-06T05:45:07Z", "published_parsed": [2002, 5, 6, 5, 45, 7, 0, 126, 0], "title": "Stress response function of a two-dimensional ordered packing of\n  frictional beads", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0205155%2Ccond-mat%2F0205236%2Ccond-mat%2F0205320%2Ccond-mat%2F0205356%2Ccond-mat%2F0205394%2Ccond-mat%2F0205310%2Ccond-mat%2F0205252%2Ccond-mat%2F0205550%2Ccond-mat%2F0205570%2Ccond-mat%2F0205516%2Ccond-mat%2F0205523%2Ccond-mat%2F0205282%2Ccond-mat%2F0205013%2Ccond-mat%2F0205304%2Ccond-mat%2F0205149%2Ccond-mat%2F0205045%2Ccond-mat%2F0205203%2Ccond-mat%2F0205109%2Ccond-mat%2F0205250%2Ccond-mat%2F0205336%2Ccond-mat%2F0205281%2Ccond-mat%2F0205083%2Ccond-mat%2F0205237%2Ccond-mat%2F0205334%2Ccond-mat%2F0205595%2Ccond-mat%2F0205220%2Ccond-mat%2F0205226%2Ccond-mat%2F0205342%2Ccond-mat%2F0205315%2Ccond-mat%2F0205384%2Ccond-mat%2F0205612%2Ccond-mat%2F0205436%2Ccond-mat%2F0205244%2Ccond-mat%2F0205476%2Ccond-mat%2F0205005%2Ccond-mat%2F0205464%2Ccond-mat%2F0205207%2Ccond-mat%2F0205486%2Ccond-mat%2F0205019%2Ccond-mat%2F0205121%2Ccond-mat%2F0205633%2Ccond-mat%2F0205194%2Ccond-mat%2F0205593%2Ccond-mat%2F0205420%2Ccond-mat%2F0205089%2Ccond-mat%2F0205618%2Ccond-mat%2F0205128%2Ccond-mat%2F0205311%2Ccond-mat%2F0205407%2Ccond-mat%2F0205458%2Ccond-mat%2F0205120%2Ccond-mat%2F0205661%2Ccond-mat%2F0205465%2Ccond-mat%2F0205448%2Ccond-mat%2F0205037%2Ccond-mat%2F0205405%2Ccond-mat%2F0205216%2Ccond-mat%2F0205091%2Ccond-mat%2F0205267%2Ccond-mat%2F0205518%2Ccond-mat%2F0205159%2Ccond-mat%2F0205335%2Ccond-mat%2F0205389%2Ccond-mat%2F0205510%2Ccond-mat%2F0205488%2Ccond-mat%2F0205084%2Ccond-mat%2F0205092%2Ccond-mat%2F0205662%2Ccond-mat%2F0205472%2Ccond-mat%2F0205017%2Ccond-mat%2F0205233%2Ccond-mat%2F0205631%2Ccond-mat%2F0205177%2Ccond-mat%2F0205577%2Ccond-mat%2F0205344%2Ccond-mat%2F0205640%2Ccond-mat%2F0205061%2Ccond-mat%2F0205317%2Ccond-mat%2F0205422%2Ccond-mat%2F0205379%2Ccond-mat%2F0205126%2Ccond-mat%2F0205115%2Ccond-mat%2F0205117%2Ccond-mat%2F0205364%2Ccond-mat%2F0205279%2Ccond-mat%2F0205147%2Ccond-mat%2F0205087%2Ccond-mat%2F0205173%2Ccond-mat%2F0205016%2Ccond-mat%2F0205188%2Ccond-mat%2F0205034%2Ccond-mat%2F0205146%2Ccond-mat%2F0205196%2Ccond-mat%2F0205241%2Ccond-mat%2F0205480%2Ccond-mat%2F0205574%2Ccond-mat%2F0205666%2Ccond-mat%2F0205139%2Ccond-mat%2F0205251%2Ccond-mat%2F0205347%2Ccond-mat%2F0205544&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stress response function of a two-dimensional ordered packing of\n  frictional beads"}, "summary": "We study the stress profile of an ordered two-dimensional packing of beads in\nresponse to the application of a vertical overload localized at its top\nsurface. Disorder is introduced through the Coulombic friction between the\ngrains which gives some indeterminacy and allows the choice of one constrained\nrandom number per grain in the calculation of the contact forces. The so-called\n`multi-agent' technique we use, lets us deal with systems as large as\n$1000\\times1000$ grains. We show that the average response profile has a double\npeaked structure. At large depth $z$, the position of these peaks grows with\n$cz$, while their widths scales like $\\sqrt{Dz}$. $c$ and $D$ are analogous to\n`propagation' and `diffusion' coefficients. Their values depend on that of the\nfriction coefficient $\\mu$. At small $\\mu$, we get $c_0-c \\propto \\mu$ and $D\n\\propto \\mu^\\beta$, with $\\beta \\sim 2.5$, which means that the peaks get\ncloser and wider as the disorder gets larger. This behavior is qualitatively\nwhat was predicted in a model where a stochastic relation between the stress\ncomponents is assumed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0205155%2Ccond-mat%2F0205236%2Ccond-mat%2F0205320%2Ccond-mat%2F0205356%2Ccond-mat%2F0205394%2Ccond-mat%2F0205310%2Ccond-mat%2F0205252%2Ccond-mat%2F0205550%2Ccond-mat%2F0205570%2Ccond-mat%2F0205516%2Ccond-mat%2F0205523%2Ccond-mat%2F0205282%2Ccond-mat%2F0205013%2Ccond-mat%2F0205304%2Ccond-mat%2F0205149%2Ccond-mat%2F0205045%2Ccond-mat%2F0205203%2Ccond-mat%2F0205109%2Ccond-mat%2F0205250%2Ccond-mat%2F0205336%2Ccond-mat%2F0205281%2Ccond-mat%2F0205083%2Ccond-mat%2F0205237%2Ccond-mat%2F0205334%2Ccond-mat%2F0205595%2Ccond-mat%2F0205220%2Ccond-mat%2F0205226%2Ccond-mat%2F0205342%2Ccond-mat%2F0205315%2Ccond-mat%2F0205384%2Ccond-mat%2F0205612%2Ccond-mat%2F0205436%2Ccond-mat%2F0205244%2Ccond-mat%2F0205476%2Ccond-mat%2F0205005%2Ccond-mat%2F0205464%2Ccond-mat%2F0205207%2Ccond-mat%2F0205486%2Ccond-mat%2F0205019%2Ccond-mat%2F0205121%2Ccond-mat%2F0205633%2Ccond-mat%2F0205194%2Ccond-mat%2F0205593%2Ccond-mat%2F0205420%2Ccond-mat%2F0205089%2Ccond-mat%2F0205618%2Ccond-mat%2F0205128%2Ccond-mat%2F0205311%2Ccond-mat%2F0205407%2Ccond-mat%2F0205458%2Ccond-mat%2F0205120%2Ccond-mat%2F0205661%2Ccond-mat%2F0205465%2Ccond-mat%2F0205448%2Ccond-mat%2F0205037%2Ccond-mat%2F0205405%2Ccond-mat%2F0205216%2Ccond-mat%2F0205091%2Ccond-mat%2F0205267%2Ccond-mat%2F0205518%2Ccond-mat%2F0205159%2Ccond-mat%2F0205335%2Ccond-mat%2F0205389%2Ccond-mat%2F0205510%2Ccond-mat%2F0205488%2Ccond-mat%2F0205084%2Ccond-mat%2F0205092%2Ccond-mat%2F0205662%2Ccond-mat%2F0205472%2Ccond-mat%2F0205017%2Ccond-mat%2F0205233%2Ccond-mat%2F0205631%2Ccond-mat%2F0205177%2Ccond-mat%2F0205577%2Ccond-mat%2F0205344%2Ccond-mat%2F0205640%2Ccond-mat%2F0205061%2Ccond-mat%2F0205317%2Ccond-mat%2F0205422%2Ccond-mat%2F0205379%2Ccond-mat%2F0205126%2Ccond-mat%2F0205115%2Ccond-mat%2F0205117%2Ccond-mat%2F0205364%2Ccond-mat%2F0205279%2Ccond-mat%2F0205147%2Ccond-mat%2F0205087%2Ccond-mat%2F0205173%2Ccond-mat%2F0205016%2Ccond-mat%2F0205188%2Ccond-mat%2F0205034%2Ccond-mat%2F0205146%2Ccond-mat%2F0205196%2Ccond-mat%2F0205241%2Ccond-mat%2F0205480%2Ccond-mat%2F0205574%2Ccond-mat%2F0205666%2Ccond-mat%2F0205139%2Ccond-mat%2F0205251%2Ccond-mat%2F0205347%2Ccond-mat%2F0205544&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the stress profile of an ordered two-dimensional packing of beads in\nresponse to the application of a vertical overload localized at its top\nsurface. Disorder is introduced through the Coulombic friction between the\ngrains which gives some indeterminacy and allows the choice of one constrained\nrandom number per grain in the calculation of the contact forces. The so-called\n`multi-agent' technique we use, lets us deal with systems as large as\n$1000\\times1000$ grains. We show that the average response profile has a double\npeaked structure. At large depth $z$, the position of these peaks grows with\n$cz$, while their widths scales like $\\sqrt{Dz}$. $c$ and $D$ are analogous to\n`propagation' and `diffusion' coefficients. Their values depend on that of the\nfriction coefficient $\\mu$. At small $\\mu$, we get $c_0-c \\propto \\mu$ and $D\n\\propto \\mu^\\beta$, with $\\beta \\sim 2.5$, which means that the peaks get\ncloser and wider as the disorder gets larger. This behavior is qualitatively\nwhat was predicted in a model where a stochastic relation between the stress\ncomponents is assumed."}, "authors": ["Laurent Breton", "Philippe Claudin", "Éric Clément", "Jean-Daniel Zucker"], "author_detail": {"name": "Jean-Daniel Zucker"}, "author": "Jean-Daniel Zucker", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/epl/i2002-00309-6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0205089v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0205089v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 7 figures, accepted version to Europhys. Lett", "arxiv_primary_category": {"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0205089v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0205089v2", "journal_reference": null, "doi": "10.1209/epl/i2002-00309-6", "fulltext": "Europhysics Letters\n\nPREPRINT\n\narXiv:cond-mat/0205089v2 11 Oct 2002\n\nStress response function of a two-dimensional ordered\npacking of frictional beads\nLaurent Breton 1 , Philippe Claudin 2 , Éric Clément 2\nand Jean-Daniel Zucker 1\n1\nLaboratoire d'Informatique de Paris 6 - pôle I.A. (UMR 7606),\n4 place Jussieu - case 169, 75252 Paris Cedex 05, France.\n2\nLaboratoire des Milieux Désordonnés et Hétérogènes (UMR 7603),\n4 place Jussieu - case 86, 75252 Paris Cedex 05, France.\n\nPACS. 05.40.-a – Fluctuation phenomena, random processes, noise, and Brownian motion.\nPACS. 45.70.Cc – Static sandpiles.\nPACS. 83.80.Fg – Granular solids.\n\nAbstract. – We study the stress profile of an ordered two-dimensional packing of beads\nin response to the application of a vertical overload localized at its top surface. Disorder is\nintroduced through the Coulombic friction between the grains which gives some indeterminacy\nand allows the choice of one constrained random number per grain in the calculation of the\ncontact forces. The so-called 'multi-agent' technique we use, lets us deal with systems as large\nas 1000×1000 grains. We show that the average response profile has a double peaked structure.\n√\nAt large depth z, the position of these peaks grows with cz, while their widths scales like Dz.\nc and D are analogous to 'propagation' and 'diffusion' coefficients. Their values depend on\nthat of the friction coefficient μ. At small μ, we get c0 − c ∝ μ and D ∝ μβ , with β ∼ 2.5,\nwhich means that the peaks get closer and wider as the disorder gets larger. This behavior\nis qualitatively what was predicted in a model where a stochastic relation between the stress\ncomponents is assumed.\n\nThe statics of granular materials is subject to an active research, see e.g. [1]. One of the\nmain issues concerns the link between the distribution of stresses in a granular medium and\nits 'past history' which has induced, at the microscopic level, a certain texture to the packing.\nAs a matter of fact, the mechanical properties of an assembly of grains depends on the way it\nhas been prepared. A now famous example is that of the sandpile: when built from the source\npoint of a hopper, the pressure profile at the bottom of a pile shows an unambiguous minimum\nright below its apex [2]. By contrast, this profile is almost flat with a slight hump when the pile\nhas been prepared by successive horizontal layers [3]. The difference between the two sandpiles\ncould be seen at the level of the grains whose contacts and forces are oriented in relation to\nthe external solicitation applied: during the construction, grains tend to gain strong contacts\n– i.e. carrying a large force – in the direction of compression [4]. This strong texture can be\nvisualized in photoelasticity experiments which show clear 'force chains' structures [5]. The\nminimum of pressure at the bottom of a sandpile can then be interpreted as a screening effect\nof the weight of the grains by these chains.\nc EDP Sciences\n\n\f2\n\nEUROPHYSICS LETTERS\n\nConceptually, the simplest test to probe the internal packing structure of a layer of grains\nis to perform a stress response function: the layer is submitted to a given force F~ localized\nat a point of its top surface, and the resulting additional stress is measured at some distance\nfrom that point. F~ must be small and supportable by the packing, in order to avoid contact\nrearrangements. The interesting point is that the shape of the averaged response function\ngives some information on the grain packing.\nLet us take few instructive examples. Recent experiments were performed with layers of\nnatural sand submitted to a vertical overload [6]. The response pressure at the bottom of\nthe layer presents a single centered peaked profile whose width scales linearly with the layer\nthickness. Such shape and scaling resemble that of the isotropic elastic response. However the\nmeasurements have shown that these profiles are very dependent on the system preparation:\ncompacted sand layers have a much wider response peak than loose ones [7]. Other experiments were performed on 2d pilings of photoelastic grains [8], showing the importance of the\namount of disorder. The stress response function of a regular packing of monodiperse beads\nhas a double peaked structure localized on the two diagonals of the triangular lattice – the\nbehavior in 3d ordered systems is similar [9]. Polydispersity in the distribution of the grain diameters make these two peaks move closer to each other. They eventually merge into a single\none at large disorder. Numerical results are also available in 2d: the stress response function of a polydisperse assembly of frictionless discs was computed using the generic isostatic\nproperty of such systems [10]. The corresponding response profile has two peaks that become\nasymmetrical when the packing is initially sheared. By contrast, Contact Dynamics simulations of a disordered layer of frictional pentagons show a single peaked response, although the\ndistribution of contact orientation has two clear oblique preferred directions [11].\nThe stress response function can also be used as a test to discriminate between all the\nmodels which aim at describing the statics of granular materials. As a matter of fact, the\ndifferent classes of models give qualitatively different response profiles. Models with equations\nof the elliptic class, like those from elastic theories, typically lead to single peaked shapes,\nwith peak widths scaling like the depth h. They can however also give double peaked response\nprofiles if some strong anisotropy is included [12], but these profiles keep a linear scaling with\nh [13]. In models which handle scalar variables like the\n√ q-model [14], response profiles also\nshow a single peak, but narrower: its width grows like h only. Note that such a behavior was\nclaimed to be observed, but on a quite particular and rather small scale 'brick' packing [15].\nInitially proposed to explain the central minimum of pressure below a sandpile built from a\nhopper, the models 'osl' (for 'Oriented Stress Linearity') where one postulates, as a closure\nrelation, a phenomenological linear relationship between the stress tensor components [16, 17]\nof the type σxx = ησzz + η ′ σxz , give by contrast hyperbolic equations. Such equations are\nformally identical to wave propagative equations and have so-called 'characteristics lines' along\nwhich stresses are transmitted. The coefficients η and η ′ encode here the texture of the system\nthey describe and thus depend on the way the packing was prepared – they are 'history\ndependent'. As a consequence, the corresponding response functions have two narrow peaks\nresulting from the two characteristics initiated at the overload point. Edwards and Grinev\nwho studied isostatic assemblies of grains with infinite friction obtained a 'stress-geometry'\nequation which, in the simplest case, is equivalent to the osl relation written above [18], see\nalso [19]. Tkachenko and Witten also deduced a large scale relation of the osl type from\nmicroscopic quantities, but this time on isostatic packings of frictionless beads [20]. This is\nconsistent with the result of Head et al. cited above, but rather contradictory to the conclusions\nof the extensive work of Roux on the mechanical properties of isostatic systems [21].\nIn this context, Eloy and Clément have proposed few years ago to study the statics of\na regular two-dimensional layer of beads [22]. Although in this system each grain has six\n\n\fL. Breton et al.: Stress response function etc...\n\n3\n\nx\n\nf\n\n1\n\nf\n\n2\n\nf\n\n3\n\nf\n\n4\n\nz\n\nFig. 1 – Left: Grains are placed on a regular triangular lattice, but have four contacts with their\nupper and lower neighbors only. x is the horizontal axis, and z measures the depth from the surface.\nAll lengths are measured in units of grains diameters. Only compressive forces are admissible for\nthese cohesionless grains. The tangent of the angle θi that the force f~i makes with the contact\ndirection (dashed lines) cannot exceed the Coulomb friction coefficient μ. These forces must satisfy\nthe equilibrium relations f~1 + f~2 + f~3 + f~4 = 0 and f1 sin θ1 + f2 sin θ2 + f3 sin θ3 + f4 sin θ4 = 0, leaving\none undetermined unknown per grain chosen at random. Right: Forces on a 70 × 60 piling due to a\nvertical overload localized at its top surface. Forces are larger when the grains are darker. One can\nclearly see the double peaked response. This picture has been computed with μ = 0.1.\n\nneighbors, only upper and lower contacts were considered – see figure 1 (left). For frictionless\nbeads, all contact forces f~i must be along the normal at the contact point, and it is easy to see\nthat they can all be uniquely computed layer by layer, from the force balance equations and the\ntop boundary conditions. More interesting is the case where each bead contact is subject to\na Coulombic friction condition |fiT | ≤ μfiN , where fiT and fiN are respectively the tangential\nand the normal components of the contact force f~i . μ = tan φ is the friction coefficient: all\nforces have to be in the Coulomb cone of angle φ. The force and torque balance equations give\nfor each grain three relations, while there are four unknowns – note that each contact belongs\nto two adjacent beads. The idea is to explore the space of mechanically acceptable solutions\nby choosing one of the four unknowns at random among the values permitted by the friction\nconditions. Besides, we also impose that all contact forces have to be positive. Therefore, this\nsimple toy model, where disorder is governed by friction only, gives a clear framework where\none can compute contact forces.\nThe stochastic calculation begins at the surface z = 0 where overload forces are given, and\ncontinues deeper and deeper, one layer after another. Sometimes, the interval of admissible\n\n\f4\n\nEUROPHYSICS LETTERS\n\nvalues in which the random number must be chosen is empty and thus makes the choice of\nthis random number impossible. It means that for given upper forces on such a grain, at least\none of the lower forces would be out of its Coulomb cone, or that a contact force is negative.\nA rearrangement has then to occur. In the original work of [22], the random numbers of the n\nprevious layers were simply recomputed until the calculation could go on, where n was chosen\nproportionally to the number of failures encountered in the current layer. Such a procedure\nis of course very slow and actually makes the total computation time increase exponentially\nwith both the size of the system and the value of the friction. The pile could then be entirely\nrebuilt hundreds of times before having the chance to generate no impossibilities at all. In\npractice, it was not possible to built, in a reasonable cpu time, piles larger than 50 grains\nfor μ ≤ 0.6, which makes statistical and large scale studies difficult. On these rather small\npilings, osl features were evidenced [22].\nA much more sophisticated method called GranuSolve [23] involving a so called 'multiagent' representation and eco-solving algorithms [24] have been used here to improve the\ncomputation of the model. In this method, we consider each bead as an 'agent' whose 'goal'\nis to reach its static equilibrium with respect to its mechanical conditions, i.e. to 'solve itself'.\nWhen a grain is solved, it communicates its contact forces to its lower neighbors. The lower\nbead-agents continue the process, and solve themselves until a failure is encountered by one\nof them. In such a case, the bead-agent asks its upper neighbors to change theirs own values\nfor the contact forces they have in common. The rearrangements are therefore treated locally\nby the grains and we do not need to recompute all random numbers from the upper layers\nbut only in the local area from where the failure occurred. When averaging the data, all\nconfigurations are taken with the same weight. To avoid any bias in the scan of the space of\nsolutions, we were particulary carreful in the choice that the simulation makes for the next\nbead-agent that needs to get priority treatment. The choice that we finally kept was to solve\ngrain layers from top to bottom, starting on a new random grain on each layer, and treating\nunsolved grains as 'clusters'. With this technique, the computation time is linear with the\nnumber of grains, and a complete resolution of a 1000 × 1000 pile takes few minutes on a G4\n400 MHz machine, up to friction coefficients as large as μ ∼ 1.7. We shall however restrict\nour discussion to relatively small values of μ for which averaged data confidence is high.\nIn this letter we would like to present features of the stress response function of this\nmodel. Gravity is switched off. All grains of the top surface z = 0 are overloaded with a\nunitary vertical force fz = 1, except for the central bead at x = 0 on which we apply fz = 2,\nsee figure 1 (right). For a given value of the friction coefficient, all contact forces are computed\nand averaged over typically few thousands of samples. The uniform unitary confining overload\nis subtracted. We call P (x, z) the resulting vertical pressure at point x and depth z. Note\nthat this is not the standard response procedure, which should have been the following: (i)\napply a uniform overload at the top and solve for all contact forces in the layer; (ii) add a\nsmall extra force at x = 0, and solve for the new forces, keeping the same random numbers\nfor each grain; (iii) subtract the two previous stress profiles to get the response. Of course,\nthis would have been much slower. To justify our alternative procedure, we checked that, as\nlong as μ is not too large, the percentage of grains that have to change their random number\nin step (ii) in order to satisfy the friction conditions with the new forces is reasonably small –\nof the order of 0.5% for μ = 0.1, 2.4% for μ = 0.3. Besides, these rearrangements are rather\nlocalized and concern preferentially forces that are small compared to the additional overload.\nTwo pressure profiles are shown on figure 2. They have been computed on 500 × 200\nsystems with μ = 0.3, and measured at 30 (left) and 90 (right) grain layers depth. They have\n\n\fL. Breton et al.: Stress response function etc...\n\n5\n\n0.2\n\npressure response P\n\n0.15\n\n0.1\n\n0.05\n\n0\n\n−0.05\n−75\n\n−50\n\n−25\n0\n25\nhorizontal position x\n\n50\n\n75\n0.2\n\npressure response P\n\n0.15\n\n0.1\n\n0.05\n\n0\n\n−0.05\n−75\n\n−50\n\n−25\n0\n25\nhorizontal position x\n\n50\n\n75\n\nFig. 2 – Vertical pressure profile P (x) in response to a unitary force localized at x = z = 0, measured\nat 30 (left) and 90 (right) grain layers depth, i.e. at z = 95.8 and z = 147.7. The thin lines are\nnumerical data averaged over 3461 different samples. The bold ones are the corresponding gaussian\nfits G(x) which give the peak positions ±xp and width W . As the depth z increases, the peaks move\naway from each other, and get smaller and wider. These data were computed with μ = 0.3.\n\na double peaked structure which can be well fitted by a double symmetrical gaussian profile\n\u0014\n\u0015\n(x+xp )2\n(x−xp )2\n1\n−\n−\n2\n2\n2W\n2W\nG(x) = √\ne\n,\n(1)\n+e\n2 2πW 2\nwhere ±xp are the positions of the peaks and W their widths. As the depth z increases, the\npeaks move away from each other, and they\n√ also get smaller and wider. Although residual\nfluctuations are large – they regress like 1/ Nr , where Nr is the√number of realizations – we\nare able to extract a response whose amplitude decreases like 1/ z.\nWe have studied the evolution of the two parameters xp and W of the pressure profiles as\na function of depth. As evidenced on figure 3, at large z the ratios xp /z and W 2 /z saturate to\nsome asymptotic values. In other words, we can define, in analogy to wave propagation\nand\n√\ndiffusion a coefficient of 'propagation' c and 'diffusion' D such that xp = cz and W = Dz. We\nemphasize that these scalings are not compatible with a homogeneous, anisotropic elasticity\nanalysis. The coefficients c and D depend on the value of the friction μ. As a trivial example,\nc = c0 = tan 30o and D = 0 at zero friction. c and D as functions of μ are plotted in the insets\nof the graphs on figure 3. As one can expect, D increases with μ. Less intuitively, c is weakly\nreduced by the friction. This last result is in agreement with the experimental observation [8].\n\n\f6\n\nEUROPHYSICS LETTERS\n\n0.4\n\n0.59\n'propagation' coeff. c\n\n'propagation' coeff. c\n\n0.6\n\n0.2\n\n0.57\n\n0.55\n\n0.53\n0.0\n\n0.0\n\n0\n\n50\n\n100\ndepth z\n\n0.2\n0.4\nfriction coeff. μ\n150\n\n0.6\n\n200\n0.3\n0\n\n'diffusion' coeff. D\n\n'diffusion' coeff. D\n\n10\n\n0.2\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\nfriction coeff. μ\n\n0\n\n10\n\n0.1\n\n0.0\n\n0\n\n50\n\n100\ndepth z\n\n150\n\n200\n\nFig. 3 – Left: At large depth, the positions of the response peaks scale linearly with z: xp = ±cz\nwhere c is the 'propagation' coefficient. This quantity decreases linearly with the\n√ friction coefficient\nμ. Right: Similarly, the peak width grows like in a 'diffusion' process: W = Dz at large depth.\nD varies like μβ , with β ∼ 2.5 (solid line) – see also figure 4. The curve c(z) and D(z) have been\ncomputed with μ = 0.3.\n\nMore quantitatively, we get the following scalings: c0 − c ∝ μ and D ∝ μβ , with β ∼ 2.5.\nThe features of the pressure response profiles obtained in these calculations resemble very\nmuch those which were predicted in [25]. The goal of that paper was to study the role\nof the disorder on osl equations, i.e. to close the equilibrium equations by the relation\nσxx = η [1 + v(x, z)] σzz , which represents the local heterogeneities of the granular packing.\nv is a random noise. Its mean value is zero and its correlation function is chosen to have\nthe factorable form hv(x, z)v(x′ , z ′ )i = ∆2 gx (x − x′ )gz (z − z ′ ), where the functions gx and\ngz are taken short ranged. ∆ is the amplitude of the disorder. When the disorder vanishes,\nthe pressure response function is simply that of a wave-like equation, i.e. the sum of two\n√\nδ-functions centered at xp = ±c0 z, where c0 = η. For finite disorder, although the exact\nshape of the response profile is more complicated than a double gaussian like (1), it can also\nbe characterized\nby the position of the peaks x = ±cz and the amplitude of their width\n√\nW = Dz. The calculation, carried out in the limit of small ∆, gave c20 − c2 ∝ ∆2 and\nD − D0 ∝ ∆2 . D0 is the diffusion coefficient due to the underlying lattice on which the\nmodel is defined – in the case of the triangular lattice used here, D0 = 0. In other words, the\nquantitative role of disorder that was predicted is the same as what is obtained here with this\n\n\fL. Breton et al.: Stress response function etc...\n\n7\n\n0.59\n−1\n\n0.57\n\nc0−c\n\n'propagation' coefficient c\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n0.55\n\n−3\n\n10\n\n−2\n\n−1\n\n10\n\n10\n\n0\n\n10\n\nD\n\n0.53\n\n0.51\n0.0\n\n0.2\n\n0.4\n'diffusion' coefficient D\n\n0.6\n\n0.8\n\nFig. 4 – This plot shows the 'propagation' coefficient c as a function of the 'diffusion' one D. Each\npoint corresponds to a different value of μ. As emphasized by the inset, c0 − c ∝ Dα at small D, were\nthe best fit gives α = 1/β ∼ 0.4 ± 0.01 (solid line).\n\nnumerical model, but the scaling seems to be different. The theory in [25] predicts a linear\nrelationship between c and D, at least at small D. Figure 4 shows the corresponding plot\nfrom the numerics. As evidenced in the inset we rather get c0 − c ∝ Dα , with α = 1/β ∼ 0.4.\nHow can we account for this difference? It is actually not easy to identify the clear\ncorrespondence between the random noise v of the theory in [25] and the disorder generated\nby a random choice of a contact force under Coulombic friction conditions. An important\ndifference, however, lies in the fact that, in contrast to the noise v, the random variable\nimplemented in these numerics certainly leads to a noise with a finite mean value. This bias\nis probably dominant in the behavior of c, but not on that of D.\nTo check this point, we plan to use one of the 'microscopic justifications' of the stochastic\nosl relation proposed in [25], which was called the 'three leg model'. In this model, the beads\nlie on a rectangular lattice and transmit their forces to their three lower neighbors, the central\nforce being random. Thus, although no friction condition was explicitly written, the spirit of\nthe two modellings is very close. The advantage is that we know how to relate the mean of the\nrandom number to the mean propagation coefficient c ̄0 , which should allow us to extract the\nadditional effect due to a zero mean noise. In the three leg model however, no backtracking\ncalculation was implemented, and eventually negative forces (tractions) appeared at some\nfinite depth, making the calculation invalid beyond this point. In the future, we plan to\nuse the highly efficient multi-agent technique at work in the GranuSolve algorithm that we\ndevised, to test the three leg model on large scale simulations with the self-consistent condition\nof positive forces.\nFinally, as mentioned in the introduction of this letter, experiments showed that strongly\ndisordered frictional granular systems actually have single peaked response functions [6,7,8,9].\nIn these simulations, even at very high friction coefficient (up to 1.7), we were not able to\nobserve any peak merging. A possible explanation may be that some additional geometrical\ndisorder is required. We then plan to extend our work to packings where some random links\nbetween grains are opened and thus cannot transmit any force.\n∗∗∗\n\n\f8\n\nEUROPHYSICS LETTERS\n\nThis work has been partially supported by a grant to the \"Découverte\" Research Team (a\n\"Jeune équipe CNRS'). We thank R.P. Behringer, R. Bouamrane, J.-P. Bouchaud, S. Galam,\nG. Reydellet and J.E.S. Socolar for useful discussions and suggestions.\nREFERENCES\n[1] P.-G. de Gennes, Rev. Mod. Phys. 71, S374 (1999).\n[2] J. Šmı́d, and J. Novosad, Proc. Powtech. Conference 1981, Ind. Chem. Eng. Symp. 63, D3V 1\n(1981); R. Brockbank, J.M. Huntley and R.C. Ball, J. Phys. (France) II 7, 1521 (1997).\n[3] L. Vanel, D.W. Howell, D. Clark, R.P. Behringer and E. Clément, Phys. Rev. E 60, R5040 (1999).\n[4] F. Radjai and S. Roux, proceedings of the conference Powders and Grains, Kishino editor,\nBalkema, Lisse, 21 (2001).\n[5] P. Dantu, Ann. des Ponts et Chaussées 4, 144 (1967); G. Josselin de Jong and A. Verruijt, Cah.\nGroupe Fr. Rheol. 2, 73 (1969).\n[6] G. Reydellet and E. Clément, Phys. Rev. Lett. 86, 3308 (2001).\n[7] D. Serero, G. Reydellet, P. Claudin, E. Clément and D. Levine, Eur. Phys. J. E 6, 169 (2001).\n[8] J. Geng et al., Phys. Rev. Lett. 87, 035506 (2001).\n[9] N.W. Mueggenburg, H.M. Jaeger and S.R. Nagel, cond-mat/0204533.\n[10] D.A. Head, A.V. Tkachenko and T.A. Witten, Eur. Phys. J. E 6, 99 (2001).\n[11] J.-J. Moreau, in the proceedings of the conference Physique et mécanique des matériaux granulaires, Champs-sur-Marne (France), LCPC editor, 199 (2000).\n[12] C. Goldenberg and I. Goldhirsch, cond-mat/0108297; R. da Silveira, G. Vidalenc and C. Gay,\ncond-mat/0208214.\n[13] M. Otto, P. Claudin, J.-P. Bouchaud and J.E.S. Socolar, in preparation.\n[14] C.-h. Liu et al., Science 269, 513 (1995); S.N. Coppersmith et al., Phys. Rev. E 53, 4673 (1996).\n[15] M. da Silva and J. Rajchenbach, Nature 406, 70 (2000).\n[16] J.-P. Bouchaud, M.E. Cates, and P. Claudin, J. Phys. (France) I 5, 639 (1995).\n[17] J.P. Wittmer, P. Claudin, M.E. Cates and J.-P. Bouchaud, Nature 382, 336 (1996); J.P.\nWittmer, P. Claudin, M.E. Cates, J. Phys. (France) I 7, 39 (1997).\n[18] S.F. Edwards, D.V. Grinev, Physica A 263, 545 (1999); Phys. Rev. Lett. 82, 5397 (1999).\n[19] R.C. Ball and R. Blumenfeld, Phys. Rev. Lett. 88, 115505 (2002).\n[20] A.V. Tkachenko and T.A. Witten, Phys. Rev. E 60, 687, (1999); Phys. Rev. E 62, 2510, (2000).\n[21] J.-N.Roux, Phys. Rev. E 61, 6802 (2000); Comment on [10], to appear in Eur. Phys. J. E.\n[22] C. Eloy and E. Clément, J. Phys. I 7, 1541 (1997).\n[23] L. Breton, J.-D. Zucker and E. Clément, proceedings of the worshop Multi-Agent Based Simulation, Boston (USA), S. Moss and P. Davidson editors, Springer, 108 (2000).\n[24] A. Drogoul,and C. Dubreuil, Decentralized A.I. 3, E. Werner, E. and Y. Demazeau editors,\nElsevier N.H., Amsterdam, 283 (1991).\n[25] P. Claudin, J.-P. Bouchaud, M.E. Cates and J.P. Wittmer, Phys. Rev. E 57, 4441 (1998).\n\n\f"}