{"id": "http://arxiv.org/abs/cond-mat/0306566v1", "guidislink": true, "updated": "2003-06-23T12:56:56Z", "updated_parsed": [2003, 6, 23, 12, 56, 56, 0, 174, 0], "published": "2003-06-23T12:56:56Z", "published_parsed": [2003, 6, 23, 12, 56, 56, 0, 174, 0], "title": "Transition from Ekman flow to Taylor vortex flow in superfluid helium", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0306636%2Ccond-mat%2F0306737%2Ccond-mat%2F0306216%2Ccond-mat%2F0306283%2Ccond-mat%2F0306231%2Ccond-mat%2F0306749%2Ccond-mat%2F0306064%2Ccond-mat%2F0306551%2Ccond-mat%2F0306349%2Ccond-mat%2F0306306%2Ccond-mat%2F0306115%2Ccond-mat%2F0306004%2Ccond-mat%2F0306318%2Ccond-mat%2F0306651%2Ccond-mat%2F0306108%2Ccond-mat%2F0306696%2Ccond-mat%2F0306232%2Ccond-mat%2F0306608%2Ccond-mat%2F0306672%2Ccond-mat%2F0306109%2Ccond-mat%2F0306168%2Ccond-mat%2F0306182%2Ccond-mat%2F0306098%2Ccond-mat%2F0306575%2Ccond-mat%2F0306107%2Ccond-mat%2F0306654%2Ccond-mat%2F0306171%2Ccond-mat%2F0306165%2Ccond-mat%2F0306540%2Ccond-mat%2F0306695%2Ccond-mat%2F0306088%2Ccond-mat%2F0306315%2Ccond-mat%2F0306603%2Ccond-mat%2F0306577%2Ccond-mat%2F0306375%2Ccond-mat%2F0306726%2Ccond-mat%2F0306353%2Ccond-mat%2F0306638%2Ccond-mat%2F0306061%2Ccond-mat%2F0306031%2Ccond-mat%2F0306542%2Ccond-mat%2F0306657%2Ccond-mat%2F0306073%2Ccond-mat%2F0306220%2Ccond-mat%2F0306478%2Ccond-mat%2F0306464%2Ccond-mat%2F0306467%2Ccond-mat%2F0306566%2Ccond-mat%2F0306705%2Ccond-mat%2F0306633%2Ccond-mat%2F0306700%2Ccond-mat%2F0306348%2Ccond-mat%2F0306237%2Ccond-mat%2F0306378%2Ccond-mat%2F0306146%2Ccond-mat%2F0306507%2Ccond-mat%2F0306079%2Ccond-mat%2F0306157%2Ccond-mat%2F0306466%2Ccond-mat%2F0306234%2Ccond-mat%2F0306578%2Ccond-mat%2F0306291%2Ccond-mat%2F0306091%2Ccond-mat%2F0306249%2Ccond-mat%2F0306072%2Ccond-mat%2F0306001%2Ccond-mat%2F0306093%2Ccond-mat%2F0306390%2Ccond-mat%2F0306320%2Ccond-mat%2F0306155%2Ccond-mat%2F0306525%2Ccond-mat%2F0306637%2Ccond-mat%2F0306214%2Ccond-mat%2F0306150%2Ccond-mat%2F0306114%2Ccond-mat%2F0306649%2Ccond-mat%2F0306094%2Ccond-mat%2F0306742%2Ccond-mat%2F0306132%2Ccond-mat%2F0306129%2Ccond-mat%2F0306536%2Ccond-mat%2F0306463%2Ccond-mat%2F0306032%2Ccond-mat%2F0306586%2Ccond-mat%2F0306710%2Ccond-mat%2F0306499%2Ccond-mat%2F0306070%2Ccond-mat%2F0306686%2Ccond-mat%2F0306350%2Ccond-mat%2F0306340%2Ccond-mat%2F0306601%2Ccond-mat%2F0306358%2Ccond-mat%2F0306722%2Ccond-mat%2F0306394%2Ccond-mat%2F0306282%2Ccond-mat%2F0306267%2Ccond-mat%2F0306673%2Ccond-mat%2F0306411%2Ccond-mat%2F0607372%2Ccond-mat%2F0607781%2Ccond-mat%2F0607600&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Transition from Ekman flow to Taylor vortex flow in superfluid helium"}, "summary": "By numerically computing the steady axisymmetric flow of helium II confined\ninside a finite aspect ratio Couette annulus, we determine the transition from\nEkman flow to Taylor vortex flow as a function of temperature and aspect\nratio.We find that the low-Reynolds number flow is quite different to that of a\nclassical fluid, particularly at lower temperatures.At high aspect ratio our\nresults confirm the existing linear stability theory of the onset of Taylor\nvortices, which assumes infinitely long cylinders.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0306636%2Ccond-mat%2F0306737%2Ccond-mat%2F0306216%2Ccond-mat%2F0306283%2Ccond-mat%2F0306231%2Ccond-mat%2F0306749%2Ccond-mat%2F0306064%2Ccond-mat%2F0306551%2Ccond-mat%2F0306349%2Ccond-mat%2F0306306%2Ccond-mat%2F0306115%2Ccond-mat%2F0306004%2Ccond-mat%2F0306318%2Ccond-mat%2F0306651%2Ccond-mat%2F0306108%2Ccond-mat%2F0306696%2Ccond-mat%2F0306232%2Ccond-mat%2F0306608%2Ccond-mat%2F0306672%2Ccond-mat%2F0306109%2Ccond-mat%2F0306168%2Ccond-mat%2F0306182%2Ccond-mat%2F0306098%2Ccond-mat%2F0306575%2Ccond-mat%2F0306107%2Ccond-mat%2F0306654%2Ccond-mat%2F0306171%2Ccond-mat%2F0306165%2Ccond-mat%2F0306540%2Ccond-mat%2F0306695%2Ccond-mat%2F0306088%2Ccond-mat%2F0306315%2Ccond-mat%2F0306603%2Ccond-mat%2F0306577%2Ccond-mat%2F0306375%2Ccond-mat%2F0306726%2Ccond-mat%2F0306353%2Ccond-mat%2F0306638%2Ccond-mat%2F0306061%2Ccond-mat%2F0306031%2Ccond-mat%2F0306542%2Ccond-mat%2F0306657%2Ccond-mat%2F0306073%2Ccond-mat%2F0306220%2Ccond-mat%2F0306478%2Ccond-mat%2F0306464%2Ccond-mat%2F0306467%2Ccond-mat%2F0306566%2Ccond-mat%2F0306705%2Ccond-mat%2F0306633%2Ccond-mat%2F0306700%2Ccond-mat%2F0306348%2Ccond-mat%2F0306237%2Ccond-mat%2F0306378%2Ccond-mat%2F0306146%2Ccond-mat%2F0306507%2Ccond-mat%2F0306079%2Ccond-mat%2F0306157%2Ccond-mat%2F0306466%2Ccond-mat%2F0306234%2Ccond-mat%2F0306578%2Ccond-mat%2F0306291%2Ccond-mat%2F0306091%2Ccond-mat%2F0306249%2Ccond-mat%2F0306072%2Ccond-mat%2F0306001%2Ccond-mat%2F0306093%2Ccond-mat%2F0306390%2Ccond-mat%2F0306320%2Ccond-mat%2F0306155%2Ccond-mat%2F0306525%2Ccond-mat%2F0306637%2Ccond-mat%2F0306214%2Ccond-mat%2F0306150%2Ccond-mat%2F0306114%2Ccond-mat%2F0306649%2Ccond-mat%2F0306094%2Ccond-mat%2F0306742%2Ccond-mat%2F0306132%2Ccond-mat%2F0306129%2Ccond-mat%2F0306536%2Ccond-mat%2F0306463%2Ccond-mat%2F0306032%2Ccond-mat%2F0306586%2Ccond-mat%2F0306710%2Ccond-mat%2F0306499%2Ccond-mat%2F0306070%2Ccond-mat%2F0306686%2Ccond-mat%2F0306350%2Ccond-mat%2F0306340%2Ccond-mat%2F0306601%2Ccond-mat%2F0306358%2Ccond-mat%2F0306722%2Ccond-mat%2F0306394%2Ccond-mat%2F0306282%2Ccond-mat%2F0306267%2Ccond-mat%2F0306673%2Ccond-mat%2F0306411%2Ccond-mat%2F0607372%2Ccond-mat%2F0607781%2Ccond-mat%2F0607600&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "By numerically computing the steady axisymmetric flow of helium II confined\ninside a finite aspect ratio Couette annulus, we determine the transition from\nEkman flow to Taylor vortex flow as a function of temperature and aspect\nratio.We find that the low-Reynolds number flow is quite different to that of a\nclassical fluid, particularly at lower temperatures.At high aspect ratio our\nresults confirm the existing linear stability theory of the onset of Taylor\nvortices, which assumes infinitely long cylinders."}, "authors": ["K. L. Henderson", "C. F. Barenghi"], "author_detail": {"name": "C. F. Barenghi"}, "author": "C. F. Barenghi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/S0022112004009206", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0306566v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0306566v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 8 figures; submitted", "arxiv_primary_category": {"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0306566v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0306566v1", "journal_reference": null, "doi": "10.1017/S0022112004009206", "fulltext": "1\n\nUnder consideration for publication in J. Fluid Mech.\n\narXiv:cond-mat/0306566v1 23 Jun 2003\n\nTransition from Ekman flow to Taylor vortex\nflow in superfluid helium\nBy K A R E N L. H E N D E R S O N1\nC A R L O F. B A R E N G H I2\n1\n\nAND\n\nSchool of Mathematical Sciences, University of the West of England,\nBristol, BS16 1QY, UK.\ne-mail: Karen.Henderson@uwe.ac.uk\n2\nSchool of Mathematics, University of Newcastle,\nNewcastle upon Tyne, NE1 7RU, UK.\ne-mail: C.F.Barenghi@ncl.ac.uk\n(Received 9 November 2018)\n\nBy numerically computing the steady axisymmetric flow of helium II confined inside a\nfinite aspect ratio Couette annulus, we determine the transition from Ekman flow to\nTaylor vortex flow as a function of temperature and aspect ratio. We find that the lowReynolds number flow is quite different to that of a classical fluid, particularly at lower\ntemperatures. At high aspect ratio our results confirm the existing linear stability theory\nof the onset of Taylor vortices, which assumes infinitely long cylinders.\n\n1. The equations of motion of superfluid helium\nAs the temperature is reduced through T = Tλ = 2.1768 K, liquid helium undergoes a\nphase transition from helium I (a classical Navier–Stokes fluid) to helium II (a superfluid).\nThe superfluid state persists through to absolute zero at vapour pressure. The motion\nof helium II is well described by the hydrodynamic two-fluid theory of Landau & Tisza\n(1987). According to this theory, helium II comprises two perfectly mixed fluids, the\nviscous normal fluid and the inviscid superfluid, of densities ρn and ρs respectively. The\ntotal density of helium II, ρ = ρn + ρs , does not vary much with the temperature T ,\nwhereas ρn and ρs depend strongly on T . At absolute zero, T = 0 K, the normal fluid\ncomponent vanishes and helium II is entirely superfluid (ρn = 0), whilst at the lambda\npoint, T = Tλ , the superfluid component is zero (ρs = 0) and helium II becomes helium I,\nwhich is a classical Navier–Stokes fluid. If helium II is rotated with angular velocity Ω\ngreater than some small critical value, then vortex filaments appear in the superfluid\n(Donnelly, 1991). The circulation around each vortex filament is quantised, in that\nI\nv s *dl = Γ\n(1.1)\nC\n\ns\n\nwhere v is the superfluid velocity field, Γ = 9.97 × 10−4 cm2 sec−1 is the quantum of\ncirculation (the ratio of Plank's constant and the mass of one helium atom) and C is an\narbitrary integration path around the axis of the filament. When helium II rotates the\nvortices align themselves to the direction of rotation and form a regular configuration\nwith areal density (number of vortex filaments crossing the unit area perpendicular to\nthe direction of rotation) N = 2Ω/Γ (Feynman's rule).\nThe hydrodynamics of the superfluid state is an interesting topic per se, but it is\n\n\f2\n\nK. L. Henderson and C. F. Barenghi\n\nworth mentioning that attention to this problem has additional motivations. The first\narises from the engineering applications: helium is the only substance available in liquid form at temperatures near absolute zero, so it is important as a cryogenics coolant.\nApplications range from infrared detectors in space science to the cooling of superconducting magnets in particle physics. The second motivation comes from recent experimental developments in which the relation between classical and quantum turbulence is\ninvestigated (for example see Smith et al. 1993; Barenghi, Swanson & Donnelly 1995).\nThe most generally accepted equations for modelling the macroscopic flow of helium II\nare the Hall-Vinen-Bekharevich-Khalatnikov (HVBK) equations which were derived by\na number of people over the years (Hall & Vinen 1956; Hall 1960; Bekharevich & Khalatnikov 1965; Hills & Robert 1977). These equations extend Landau's two-fluid model\nto take into account the presence of quantised vortex lines in the flow. The derivation\nof the equations is based on a continuum approximation, assuming a high density of\nvortex lines, all aligned roughly in the same direction. For such situations, the superfluid\nvorticity, which is discrete in nature, may be approximated as a continuum, resulting in\nan effective superfluid vorticity field ω s = curl v s . The isothermal, incompressible HVBK\nequations may be written as:\nρs\n∂v n\n+ (v n *∇)v n = −∇pn + ν n ∇2 v n + F ,\n∂t\nρ\n\n(1.2)\n\nρn\n∂v s\n+ (v s *∇)v s = −∇ps + T −\nF,\n∂t\nρ\n\n(1.3)\n\n∇* v n = 0,\nn\n\n∇* v s = 0,\n\n(1.4)\n\nn\n\nwhere v is the normal fluid velocity, ν is the kinematic viscosity of the normal fluid\nand pn , ps are effective pressures (∇ps = (1/ρ)∇p − 12 (ρn /ρ)∇(v n − v s )2 and ∇pn =\n(1/ρ)∇p + 21 (ρs /ρ)∇(v n − v s )2 where p is the pressure). The mutual friction force may\nbe written as\nb s × (ω s × (v n − v s − ν s ∇ × ω\nb s )) + 21 B ′ ω s × (v n − v s − ν s ∇ × ω\nb s)\nF = 12 B ω\n\n(1.5)\n\nb s = ω s /|ωs | the unit vector in the direction of superfluid vorticity and B, B ′\nwith ω\nare the temperature-dependent mutual friction parameters (Barenghi, Donnelly & Vinen\n1983, Donnelly & Barenghi 1998). This force is due to collisions between the normal\nfluid (mainly rotons, at temperatures relevant to most experiments) and vortex lines.\nThe vortex tension force may be written as\nb s ),\nT = −ν s ωs × (∇× ω\n\n(1.6)\n\nν s = (Γ/4π) log(b0 /a0 )\n\n(1.7)\n\nand reflects the energy per unit length in the vortex lines. The vortex tension parameter\n\nhas the same dimension as kinematic viscosity but physically it is very different: it represents the ability of a vortex line to oscillate due to vortex waves which can be excited on\nthe vortex lines themselves. The quantity b0 = (|ω s |/Γ)−1/2 represents the intervortex\nspacing and a0 ≈ 10−8 cm is the radius of the superfluid vortex core.\n\n2. Motivation and aim of this work\nIn this paper we apply the HVBK equations to model helium II in a finite aspect ratio\nCouette annulus, that is flow of fluid confined radially between two concentric rotating\ncylinders and axially between two fixed plates separated by a distance H. We consider\n\n\fTransition to Taylor vortex flow in superfluid helium\n\n3\n\nFigure 1. The problem's configuration. The fluid is contained inside a cylindrical box of inner\nradius R1 , outer radius R2 and height H. The inner cylinder rotates at constant angular velocity\nΩ1 , while the outer cylinder and the top and bottom end plate are stationary.\n\nthe inner cylinder (r = R1 ) to be rotating with angular velocity Ω1 and the outer cylinder\n(r = R2 ) to be fixed, see figure 1. Taylor–Couette flow has been used as a bench-mark\nfor fluid mechanics since Taylor's pioneering work (1923) to investigate the transition\nfrom Couette flow to Taylor vortices, which established a firm ground for using the\nNavier–Stokes equations and the no-slip boundary conditions. Progress in helium II has\nbeen slower than for classical fluids due in part to problems of flow visualisation at such\nlow temperatures. In considering a classical fluid, introduction of flakes or other small\nparticles into the working fluid (usually oil or water), results in the Taylor vortices being\nclearly evident. In contrast there are only limited visualisation techniques available to the\nexperimentalist at temperatures close to absolute zero. Recent attempts have been made\nto reveal the flow pattern of helium II by adding small particles (Bielert & Stamm 1993).\nHowever this was only successful at high rotation rates (40 times the critical angular\nvelocity at which linear stability analysis predicts Couette flow becomes unstable); in\nthis regime the flow is turbulent and the validity of the HVBK equations is not clear.\nClearly the lack of direct flow visualisation gives additional motivation to our work.\nExperiments on helium II between concentric cylinders were first performed by Kapitza\nin 1941 and Donnelly & LaMar (1988) have written a review of experiments involving\nhelium II in Couette apparatus. Early Taylor–Couette experiments were concerned with\ndetermining the viscosity of helium II by measuring the torque exerted by the flow\non the stationary cylinder. A break in the linear dependence of the torque with the\nangular velocity of the rotating cylinder is taken to denote a transition from one solution\nto another. A second experimental technique is available, that of measuring the extra\nattenuation of a second sound wave, which can be used to probe the superfluid vorticity.\nSecond sound waves occur when there is a periodic counterflow between the normal fluid\nand superfluid, which corresponds to a wave of heat. Angular velocity is plotted against\nthe attenuation factor and breaks in the curve are interpreted as transitions in the flow.\nBy measuring the extra attenuation of second sound waves in the axial, azimuthal and\nradial directions it is theoretically possible to get an idea of the number and direction\n\n\f4\n\nK. L. Henderson and C. F. Barenghi\n\nof the quantised vortex lines. In practice the information obtained is less complete than\nthis.\nDespite the fact that the HVBK equations were established in 1961, they have been\nused mainly to model helium II in a rotating container (solid body rotation). Unfortunately solid body rotation (which corresponds to a spatially uniform configuration of\nsuperfluid vortices) is not a strict test of the equations of motion because it is too simple;\nthe terms in the HVBK equations which involve the vortex tension vanish. Only recently\nhave the HVBK equations been validated for a non-trivial flow configuration: Couette\nflow. For the case of infinitely long cylinders, both superfluid and normal fluid velocity\nfields have the following Couette flow profile:\nvn = vs =\n\n(−Ω1 R12 r + Ω1 R12 R22 r−1 ) b\nφ\n(R22 − R12 )\n\n(2.1)\n\nb is the unit vector in the azimuthal direcwhere (r, φ, z) are cylindrical coordinates and φ\ntion. After making the usual assumption of infinitely long cylinders, Barenghi & Jones\n(1988) and Barenghi (1992) considered the linear stability of Couette flow with respect\nto infinitesimal perturbations of the form exp(imφ + ikz + σt) where σ is the complex\ngrowth rate, m the azimuthal wavenumber and k the dimensionless axial wavenumber\n(expressed in units of 1/δ where δ = R2 − R1 is the gap width). The driving parameter\nof the problem is the Reynolds number,\nΩ1 R1 δ\n,\n(2.2)\nνn\nwhich represents the dimensionless velocity of the inner cylinder. Barenghi & Jones\n(1988) found that if the inner cylinder rotates sufficiently fast, at a certain critical value\nRe = Recrit the growth rate, Real(σ) of the axisymmetric (m = 0) perturbation becomes positive, hence Couette flow becomes unstable. This transition corresponds to the\nonset of Taylor vortices for a classical fluid. Barenghi & Jones (1988) also determined\nthe temperature dependence of the critical Reynolds number, Recrit , and of the critical\naxial wavenumber, kcrit . Their work prompted further experiments and good agreement\nbetween the predicted and measured values of Recrit was found (Barenghi 1992), particularly for temperatures close to the lambda point. The success of the linear stability analysis prompted further work, namely the study of nonlinear Taylor flow in infinitely long\ncylinders (Henderson, Barenghi & Jones 1995). Comparisons with existing experimental\ndata and numerical results further validated the HVBK model in the high temperature\nregime (Henderson & Barenghi 1994).\nUnfortunately at lower temperatures (T < 2 K), although there was qualitative agreement, the measured critical Reynolds numbers were larger than those predicted by the\nlinear stability analysis. In the classical Taylor–Couette problem the critical value of the\ndimensionless axial wavenumber is kcrit ≈ π, hence each individual Taylor vortex cell\nis approximately square (the extension in the axial direction is equal to the gap's size).\nIn the case of helium II, Barenghi & Jones (1998) found that kcrit → π as T → Tλ , as\nexpected in the limit of a pure normal fluid. However, as the temperature is reduced, they\nfound that kcrit decreases and tends to zero in the limit of a pure superfluid. This result\nsuggests that the discrepancy between theory and experiments for T < 2 K is due to end\neffects: there are not enough Taylor vortex cells in the typical experimental apparatus,\nthus the infinite cylinder assumption breaks down. A better theory is required and that\nis what we set out to do in this paper.\nIt is known in the classical Taylor–Couette literature that the presence of fixed ends\ninduces a large scale Ekman circulation in which the fluid moves radially inward near the\nRe =\n\n\fTransition to Taylor vortex flow in superfluid helium\n\n5\n\ntop and bottom ends of the Couette apparatus and moves radially outward in the middle.\nThis effect is caused by the no-slip boundary conditions; the centrifugal force pushes the\nfluid outwards at the centreline, where the braking effect of the end plates is least, so the\nfluid near the end plates moves inwards to conserve mass. In the case of helium II the\nnormal fluid obeys the same no-slip boundary condition of an ordinary classical fluid,\nbut there are also superfluid boundary conditions to take into account. A discussion\nof what these superfluid boundary conditions should be is contained in our previous\npaper (Henderson & Barenghi 2000), in which we also showed that the competition\nbetween the normal fluid and superfluid boundary conditions has unexpected effects on\nthe direction of rotation of the Ekman circulation in a unit aspect ratio annulus. The\naim of the current paper is to understand how the appearance of Taylor vortex flow\nis effected by the underlying Ekman circulation. Firstly we shall investigate the low\nReynolds number flow of helium II at varying aspect ratios to see how it differs from\nthe flow of a classical Navier–Stokes fluid. Secondly, we shall determine the transition\nfrom Ekman cells to Taylor vortices and compare the Taylor–Couette flow of helium II in\nan enclosed annulus to the flow in an infinite apparatus (Henderson et al. 1995). If, for\nsufficiently long cylinders, the results of the linear stability theory are recovered, contact\nwill be made between theory and experiments at low temperatures.\n\n3. Model\nWe consider the fluid to be confined radially between two concentric cylinders of inner\nand outer radius R1 and R2 , and axially between two fixed plates which are separated\nby a distance H. The top and bottom plates and the outer cylinder are held stationary\nand the inner cylinder rotates at constant angular velocity Ω1 . Throughout this work we\nshall consider the radius ratio, η = R1 /R2 = 0.976 as in the experimental apparatus of\nSwanson & Donnelly (1991) and will vary the Reynolds number, Re = Ω1 R1 δ/ν n , the\naspect ratio, h = H/δ and the temperature, T .\nIn order to solve the HVBK equations (1.2-1.4) we need boundary conditions. The\nboundary conditions for the normal fluid are no-slip, that is, working in cylindrical cob at r = R1 and v n = 0 at r = R2 , z = 0, z = H. The boundary\nordinates v n = Ω1 R1 φ\nconditions for the superfluid are more delicate. Given n, a normal to the boundary,\nwe have that v s * n = 0 at r = R1 , R2 and z = 0, H, ensuring no flow normal to the\nboundaries. For the remaining conditions we have taken\nb = 0 at r = R1 , R2 and z = 0, H,\nωs × z\n\n(3.1)\n\nb is the unit vector in the axial direction. Thus the superfluid vorticity is taken to\nwhere z\nbe purely axial at the boundaries. The condition on the cylinder walls, r = R1 and r = R2 ,\nhas been discussed in a previous paper (Henderson et al. 1995) whilst the condition on\nthe ends of the cylinder, z = 0 and z = H, corresponds to perfect sliding of the vortex\nlines (Khalatnikov 1965). It must be stressed that as yet there is no experimental evidence\nfor the boundary conditions which we propose; in fact, a motivation behind or work is to\nexplore the consequence of assuming certain boundary conditions, hoping to stimulate\nexperimental work on this issue. Other possibilities are that the vortex lines remain\ntotally or partially pinned at the boundaries. Total pinning of the vortex lines on the\nends of the cylinders cannot occur because each rotation would wrap up the vortex lines\nuntil de-pinning takes place. Partial sliding is a possibility, however this would introduce\nextra unknown parameters into the problem depending on the nature and the smoothness\nof the boundaries, so we have chosen to adopt perfect sliding.\nWe make the simplifying assumption that the flow is axisymmetric and introduce\n\n\f6\n\nK. L. Henderson and C. F. Barenghi\n\nstream functions ψ n , ψ s such that\n1 ∂ψ p\n1 ∂ψ p\n,\nvzp =\n(3.2a,b)\nr ∂z\nr ∂r\nwhere p = n, s represents the normal fluid, superfluid respectively. Introducing the\nstream functions ensures that continuity (1.4) is automatically satisfied. A finite difference\napproach is used to obtain solutions for ψ p , vφp and ωφp . The equations satisfied by these\nquantities are obtained by taking the φ component of (1.2,1.3) and the φ component of the\ncurl of (1.2,1.3). A Poisson's equation links the stream function ψ p with the azimuthal\ncomponent of vorticity ωφp . These equations are solved on the computational domain\nR1 ≤ r ≤ R2 , 0 ≤ z ≤ H/2 and symmetry is assumed to calculate the derivatives on\nthe centreline z = H/2. A uniform grid is used in both the radial and axial direction\nand the equations are stepped forward in time until a steady solution is achieved. The\ncomputational cost given our criterion of convergence determines the largest aspect ratio\nwhich we compute (h = 8). The equations are made dimensionless using the gap width\nδ as the unit of length and the normal fluid viscous time scale δ 2 /ν n as the unit of time.\nFor further details of the numerical method, see Henderson & Barenghi (2000).\nvrp = −\n\n4. Results\nIn this section we refer to previous results (Henderson & Barenghi 2000) in which we\nconsidered the low Reynolds number flow of helium II in a unit aspect ratio Couette annulus; this geometry constrains the flow to a simple Ekman circulation. The key discovery\nwas the anomalous Ekman motion of helium II, compared to a classical Navier–Stokes\nfluid. We found that the pair of superfluid Ekman cells always rotate in a counter-classical\ndirection (which means for example that vrs < 0 at the centreline z = H/2), whilst the\nnormal fluid Ekman cells rotate classically (vrn > 0 at z = H/2) at temperatures close\nto the lambda temperature, but reverse (vrn < 0 at z = H/2) at lower temperatures. It\nwas also found that the azimuthal superfluid velocity is almost independent of z. This\neffect becomes more pronounced at lower temperatures and was found to be due to the\ntension in the superfluid vortex lines.\nIn this paper, the parameters which are varied are the temperature T , Reynolds number\nRe of the inner cylinder and aspect ratio h. Figures 2–4,6 show contour plots of the normal\nand superfluid stream functions, where the plots are shown for the complete cross-section\nof the annulus; R1 ≤ r ≤ R2 , 0 ≤ z ≤ H with the inner/outer cylinder on the left/right\nrespectively. The maximum value of each field is printed underneath the corresponding\ncontour plot. Light and dark regions correspond to positive and negative contour lines\nrespectively.\nIn figure 2 we investigate how varying the aspect ratio effects the flow of helium II\nat T = 2.11 K and Re = 100. This Reynolds number is appreciably below the critical\nReynolds number (Recrit = 355) at which the linear stability analysis predicts Couette flow becomes unstable in the infinite cylinder approximation. It is apparent from\nfigure 2 (a) that since the normal fluid and superfluid stream functions increase with\nz across the centreline z = H/2, (3.2 a) predicts that the radial velocity components\nare negative at the centreline, in contrast to the motion of a classical Navier–Stokes\nfluid. Thus for small aspect ratios (h ≤ 2.5) both the normal fluid and superfluid rotate\ncounter-classically in a pair of matching Ekman cells. This behaviour has been reported\npreviously (Henderson & Barenghi 2000) and is due to the boundary conditions satisfied\nby the vortex lines on the top and bottom of the cylinders. Figure 2 also shows that the\nsuperfluid Ekman cells fill the whole annulus, becoming more elongated as the aspect\n\n\fTransition to Taylor vortex flow in superfluid helium\n\n7\n\nFigure 2. Contour plots of the stream function of the normal fluid (n) and the superfluid (s)\nat T = 2.11 K and Re = 100 at aspect ratios: (a) h = 1, (b) h = 2.5, (c) h = 3, (d) h = 6, (e)\nh = 8.\n\nratio is increased. In contrast, the normal fluid Ekman cells, tend to retain their size and\nare positioned towards the ends of the cylinders.\nAs the aspect ratio is increased further (h > 2.5) the superfluid remains in the form\nof two counter-rotating cells whilst the normal fluid splits into four cells with the cells\nadjacent to the ends of the cylinder rotating in the same direction as the superfluid.\nThe inner cells of the normal fluid strengthen and fill the annulus as the aspect ratio is\nincreased. At aspect ratio h = 8 the superfluid splits into four cells and although the size\nof the cells is different to those of the normal fluid, the direction of rotation is the same\nfor both fluids.\nTaken together these results demonstrate that the low-Reynolds number flow of helium II is dominated by end effects, which force the outer cells of the normal and superfluid to rotate counter-classically. As the aspect ratio is increased the influence of the\nends at the centre of the apparatus becomes weaker and classical behaviour is observed\nin both fluids, with outflow at the centreline, z = H/2. In our previous work (Henderson\n& Barenghi 2000) we highlighted the columnar motion of the azimuthal component of\nsuperfluid velocity. We find that as the aspect ratio is increased this column like motion\nbecomes less pronounced.\nIn figure 3 we show how varying the temperature effects the flow of helium II at Re =\n100 and h = 4. At this aspect ratio, the maximum axial wavelength of a disturbance is,\nλmax = 4 giving a corresponding minimum admissible axial wavenumber of kmin = π/2.\nGiven this, the Reynolds number, Re = 100 is below the critical value predicted by\nlinear stability analysis at which Couette flow become unstable for all temperatures\nconsidered. At temperatures close to the lambda temperature (T ≥ 2.16K) the normal\nfluid and superfluid rotate in a pair of Ekman cells. The normal fluid rotates in a classical\ndirection and the superfluid rotates counter-classically. As the temperature is reduced the\nnormal fluid splits into four cells, whilst the superfluid remains as two cells. In this region,\nthe normal fluid cells closest to the ends of the cylinder rotate in the same direction\nas the superfluid and become stronger in magnitude and also fill more of the annulus\nas the temperature is reduced. The columnar behaviour of the azimuthal superfluid\n\n\f8\n\nK. L. Henderson and C. F. Barenghi\n\nFigure 3. Contour plots of the stream function of the normal fluid (n) and the superfluid (s)\nat Re = 100 and h = 4 at temperatures: (a) T = 2.16 K, (b) T = 2.15 K, (c) T = 2.1 K.\n\nFigure 4. Contour plots of the stream function of the normal fluid (n) and the superfluid (s)\nat T = 2.17 K and h = 6 at Reynolds numbers: (a) Re = 100, (b) Re = 250, (c) Re = 270, (d)\nRe = 280, (e) Re = 300.\n\nvelocity is not evident at temperatures close to the lambda temperature but becomes\nmore pronounced as the temperature is reduced.\nIn figure 4 we investigate the transition from Ekman flow to Taylor vortex flow at\nT = 2.17 K and h = 6. At low Reynolds numbers (Re = 100) the normal fluid consists\nof a pair of classically rotating Ekman cells. The superfluid has four cells, with the cells\nadjacent to the ends of the cylinders rotating counter-classically, as predicted by the\nboundary conditions. As the Reynolds number is increased both the normal fluid and\nthe superfluid develop more cells, with the cells closest to the ends rotating classically\nand counter-classically for the normal and superfluid respectively, as a consequence of\nthe boundary conditions. At Re = 300 Taylor vortex flow is fully developed and we can\nsee that despite the superfluid having an additional weak pair of cells close to the ends of\nthe cylinders, the two fluids appear to match each other. In figure 5 we plot the centreline\naverage values of the radial components of the normal fluid (solid) and superfluid (dashed)\nagainst Reynolds number. From the graph we can see that the transition to Taylor\nvortices occurs at approximately Re = 275, whilst stability analysis in the infinitely long\ncylinders approximation predicts Recrit = 278.7 at kcrit = 2.9.\nIn figure 6 we repeat the calculation at h = 6 but setting a lower temperature,\nT = 2.16 K. At low Reynolds numbers (Re = 100) the normal fluid has a pair of\n\n\fTransition to Taylor vortex flow in superfluid helium\n\n9\n\nFigure 5. Plot of the average values of (a) vrn (solid) and (b) vrs (dashed) at the centreline\nz = H/2 against Reynolds number.\n\nFigure 6. Contour plots of the stream function of the normal fluid (n) and the superfluid (s)\nat T = 2.16 K and h = 6 at Reynolds numbers: (a) Re = 100, (b) Re = 180, (c) Re = 275, (d)\nRe = 300, (e) Re = 310.\n\nclassically rotating Ekman cells. As before, the superfluid has four cells, and the cells\nwhich are adjacent to the ends of the cylinders rotate counter-classically, as predicted by\nthe boundary conditions. As the Reynolds number is increased, the normal fluid develops\nfour cells which fill the whole apparatus, not six as at T = 2.17 K. The outer cells rotate\nclassically due to the boundary conditions. The superfluid remains as four cells up to\nRe = 300, with the outer cells rotating counter-classically and the inner cells strengthing\nwith increasing Reynolds number. At Re = 310 the superfluid develops an additional\nsmall weak pair of cells at the centre of the apparatus.\nIn figure 7 we plot the centreline average values of the radial components of the normal\nfluid (solid) and superfluid (dashed) against Reynolds number. The transition from the\nEkman flow to the Taylor vortex flow is harder to distinguish than at higher temperatures\nand is slightly different for the normal and superfluid. It occurs at approximately Re =\n270. What is interesting about these results is that the Taylor vortices for the normal fluid\n\n\f10\n\nK. L. Henderson and C. F. Barenghi\n\nFigure 7. Plot of the average values of (a) vrn (solid) and (b) vrs (dashed) at the centreline\nz = H/2 against Reynolds number.\n\nare elongated, being 1 12 times longer than they are wide. This is consistent with the linear\nstability analysis which predicts that Recrit = 310.68 at the critical axial wavenumber of\nkcrit = 2.35. The elongation of the Taylor cells was first predicted by Barenghi & Jones\n(1988) and this is the first time that it has been observed numerically taking end effects\ninto account.\nWe find that in general the superfluid vorticity is primarily axial and concentrated\ntowards the ends of the cylinders close to the inner cylinder. This predicted result could\nbe observed experimentally by measuring the extra attenuation of second sound waves\ndue to the vortex lines at the centre and ends of the apparatus. As the Reynolds number is\nincreased, there is a much larger deflection of the vortex lines in the radial direction. This\ndeflection has been observed experimentally in the transition to Taylor vortices (Swanson\n& Donnelly 1991). In figure 8 we plot the superfluid vorticity components of helium II\nat T = 2.16 K, h = 6 at the Reynolds numbers (a) Re = 100 and (b) Re = 300 for the\nmiddle two-thirds of the apparatus (1 ≤ z/δ ≤ 5). This enables us to see what happens to\nthe vortex lines in the centre of the apparatus away from the cylinder ends, where there\nis stronger shear which would make the contour lines in the middle of the apparatus less\nvisible. The deflection in the radial direction is clearly visible for Re = 300. In the Taylor\nvortex flow regime, the vorticity pattern is similar to that found when considering the\nTaylor–Couette flow of helium II without end effects (Henderson et al. 1995).\n\n5. Conclusions\nBy solving the nonlinear HVBK equations in a finite aspect ratio configuration we have\ndetermined how the fixed ends of the cylinders effect the Ekman flow and the transition\nto Taylor vortex flow.\nFor low-Reynolds number flow, the main result is the anomalous Ekman circulation\nof helium II when compared to that of a classical Navier–Stokes fluid. At short aspect\nratios both normal fluid and superfluid rotate as a pair of Ekman cells. The superfluid\ncells always rotate counter-classically, whilst the sense of rotation of the normal fluid is\ntemperature dependent. At larger aspect ratios the influence of the ends of the cylinders\n\n\fTransition to Taylor vortex flow in superfluid helium\n\n11\n\nFigure 8. Contour plots of the components of superfluid vorticity: (i) ωrs , (ii) ωφs , (iii) ωzs at\nT = 2.16 K, h = 6 for (a) Re = 100, (b) Re = 300 in the middle two-thirds of the annulus,\n1 ≤ z/δ ≤ 5. The maximum and minimum values of each field are printed underneath the\ncorresponding plot.\n\ntowards the centre of the apparatus diminishes and at lower temperatures the normal fluid\ndevelops additional cells resulting in classical outflow at the centreline. The superfluid\nalso develops extra cells to match the flow of the normal fluid at the centre.\nWe have found that at T = 2.17 K and aspect ratio as small as h = 6, in the regions\nway from the ends of the cylinders, the superfluid's pattern matches that of the normal\nfluid. The transition to Taylor vortex flow occurs at a Reynolds number close to that\npredicted by the linear stability analysis in the infinite cylinder approximation. At the\nslightly lower temperature of T = 2.16 K we find that the normal fluid develops elongated\nTaylor cells, as predicted by the linear stability analysis. The superfluid flow pattern is\nsimilar to that of the normal fluid away from the ends of the cylinders but the matching\nis not as pronounced as at higher temperatures.\nFinally we note that gaining more insight into the flow of helium II is particularly\nworthwhile because of the lack of direct flow visualisation at temperature close to absolute\nzero.\nREFERENCES\nBarenghi, C. F. 1992 Vortices and the Couette flow of helium II. Physical Review B 45,\n2290–2293.\nBarenghi, C. F., Donnelly, R. J. & Vinen, W. F. 1983 Friction on quantized vortices in\nHe II. A review. Journal of Low Temperature Physics 52, 189–247.\nBarenghi, C. F. & Jones, C. A. 1988 The stability of the Couette flow of helium II. Journal\nof Fluid Mechanics 197, 551–569.\nBarenghi, C. F., Swanson, C. J. & Donnelly, R. J. 1995 Emerging issues in helium turbulence. Journal of Low Temperature Physics 100, 385–413.\nBekharevich, I. L. & Khalatnikov, I. M. 1961 Phenomenological derivation of the equations\nof vortex motion in He II. Soviet Phys. JETP 13, 643–646.\nBielert, F. & Stamm, G. 1993 Visualisation of Taylor Couette flow in superfluid helium.\nCryogenics 33, 938–940.\nDonnelly, R. J. 1991 Quantized Vortex Lines in Helium II . Cambridge University Press.\nDonnelly, R. J. & Barenghi, C. F. 1998 The observed properties of liquid helium at the\nsaturated vapour pressure. J. Physical and Chemical Reference Data 27, 1217–1274.\nDonnelly, R. J. & Lamar, M. M. 1988 Flow and stability of helium II between rotating\ncylinders. Journal of Fluid Mechanics 186, 163–198.\n\n\f12\n\nK. L. Henderson and C. F. Barenghi\n\nFeynman, R. P. 1955 Application of quantum mechanics to liquid helium. In Progress in Low\nTemperature Physics, , vol. 1. C. J. Gorter, North Holland.\nHall, H. E. 1960 The rotation of liquid helium II. Advances in Physics 9, 89–146.\nHall, H. E. & Vinen, W. F. 1956 The rotation of liquid He II. II the theory of mutual friction\nin uniformly rotating He II. Proceedings of the Royal Society of London A 238, 215–234.\nHenderson, K. L. & Barenghi, C. F. 1994 Calculation of the torque in nonlinear Taylor\nvortex flow of helium II. Physics Letters A 191, 438–442.\nHenderson, K. L. & Barenghi, C. F. 2000 The anomalous motion of superfluid helium in a\nrotating cavity. Journal of Fluid Mechanics 406, 199–219.\nHenderson, K. L., Barenghi, C. F. & Jones, C. 1995 Nonlinear Taylor-Couette flow of\nhelium II. Journal of Fluid Mechanics 283, 329–340.\nHills, R. N. & Roberts, P. H. 1977 Superfluid mechanics for a high density of vortex lines.\nArch Rat Mech Anal 66, 43–71.\nKapitza, P. L. 1941 Journal of Physics, USSR 4, 181.\nKhalatnikov, I. M. 1965 An Introduction to the Theory Superfluidity. Benjamin.\nLandau, L. D. & Lifshitz, E. M. 1987 Fluid Mechanics. Pergamon.\nSmith, M. R., Donnelly, R. J., Goldenfeld, N. & Vinen, W. F. 1993 Decay of vorticity\nin homogeneous turbulence. Physical Review Letters 71, 2583–2586.\nSwanson, C. J. & Donnelly, R. J. 1991 Instability of Taylor-Couette flow of helium II.\nPhysical Review Letters 67, 1578–1581.\nTaylor, G. I. 1923 Stability of a viscous liquid contained between two rotating cylinders. Phil.\nTrans. Roy. Soc. Lond. A 223, 289–343.\n\n\f"}