{"id": "http://arxiv.org/abs/cond-mat/0306572v2", "guidislink": true, "updated": "2003-11-06T21:36:18Z", "updated_parsed": [2003, 11, 6, 21, 36, 18, 3, 310, 0], "published": "2003-06-23T14:34:16Z", "published_parsed": [2003, 6, 23, 14, 34, 16, 0, 174, 0], "title": "Three-dimensional flows in slowly-varying planar geometries", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0306506%2Ccond-mat%2F0306052%2Ccond-mat%2F0306429%2Ccond-mat%2F0306630%2Ccond-mat%2F0306147%2Ccond-mat%2F0306422%2Ccond-mat%2F0306712%2Ccond-mat%2F0306293%2Ccond-mat%2F0306104%2Ccond-mat%2F0306142%2Ccond-mat%2F0306405%2Ccond-mat%2F0306590%2Ccond-mat%2F0306559%2Ccond-mat%2F0306239%2Ccond-mat%2F0306675%2Ccond-mat%2F0306523%2Ccond-mat%2F0306356%2Ccond-mat%2F0306711%2Ccond-mat%2F0306611%2Ccond-mat%2F0306059%2Ccond-mat%2F0306746%2Ccond-mat%2F0306479%2Ccond-mat%2F0306645%2Ccond-mat%2F0306337%2Ccond-mat%2F0306480%2Ccond-mat%2F0306435%2Ccond-mat%2F0306045%2Ccond-mat%2F0306628%2Ccond-mat%2F0306527%2Ccond-mat%2F0306087%2Ccond-mat%2F0306456%2Ccond-mat%2F0306069%2Ccond-mat%2F0306380%2Ccond-mat%2F0306363%2Ccond-mat%2F0306492%2Ccond-mat%2F0306236%2Ccond-mat%2F0306644%2Ccond-mat%2F0306269%2Ccond-mat%2F0306038%2Ccond-mat%2F0306486%2Ccond-mat%2F0306496%2Ccond-mat%2F0306397%2Ccond-mat%2F0306565%2Ccond-mat%2F0306077%2Ccond-mat%2F0306452%2Ccond-mat%2F0306265%2Ccond-mat%2F0306573%2Ccond-mat%2F0306005%2Ccond-mat%2F0306443%2Ccond-mat%2F0306121%2Ccond-mat%2F0306240%2Ccond-mat%2F0306017%2Ccond-mat%2F0306185%2Ccond-mat%2F0306273%2Ccond-mat%2F0306414%2Ccond-mat%2F0306223%2Ccond-mat%2F0306090%2Ccond-mat%2F0306720%2Ccond-mat%2F0306036%2Ccond-mat%2F0306187%2Ccond-mat%2F0306477%2Ccond-mat%2F0306531%2Ccond-mat%2F0306548%2Ccond-mat%2F0306571%2Ccond-mat%2F0306620%2Ccond-mat%2F0306083%2Ccond-mat%2F0306039%2Ccond-mat%2F0306589%2Ccond-mat%2F0306433%2Ccond-mat%2F0306016%2Ccond-mat%2F0306140%2Ccond-mat%2F0306137%2Ccond-mat%2F0306388%2Ccond-mat%2F0306430%2Ccond-mat%2F0306398%2Ccond-mat%2F0306564%2Ccond-mat%2F0306242%2Ccond-mat%2F0306584%2Ccond-mat%2F0306572%2Ccond-mat%2F0306520%2Ccond-mat%2F0306439%2Ccond-mat%2F0306612%2Ccond-mat%2F0306406%2Ccond-mat%2F0306465%2Ccond-mat%2F0306244%2Ccond-mat%2F0306184%2Ccond-mat%2F0306598%2Ccond-mat%2F0306434%2Ccond-mat%2F0306194%2Ccond-mat%2F0306653%2Ccond-mat%2F0306028%2Ccond-mat%2F0306448%2Ccond-mat%2F0306704%2Ccond-mat%2F0306543%2Ccond-mat%2F0306703%2Ccond-mat%2F0306218%2Ccond-mat%2F0306221%2Ccond-mat%2F0306219%2Ccond-mat%2F0306364%2Ccond-mat%2F0306367%2Ccond-mat%2F0306641&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Three-dimensional flows in slowly-varying planar geometries"}, "summary": "We consider laminar flow in channels constrained geometrically to remain\nbetween two parallel planes; this geometry is typical of microchannels obtained\nwith a single step by current microfabrication techniques. For pressure-driven\nStokes flow in this geometry and assuming that the channel dimensions change\nslowly in the streamwise direction, we show that the velocity component\nperpendicular to the constraint plane cannot be zero unless the channel has\nboth constant curvature and constant cross-sectional width. This result implies\nthat it is, in principle, possible to design \"planar mixers\", i.e. passive\nmixers for channels that are constrained to lie in a flat layer using only\nstreamwise variations of their in-plane dimensions. Numerical results are\npresented for the case of a channel with sinusoidally varying width.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0306506%2Ccond-mat%2F0306052%2Ccond-mat%2F0306429%2Ccond-mat%2F0306630%2Ccond-mat%2F0306147%2Ccond-mat%2F0306422%2Ccond-mat%2F0306712%2Ccond-mat%2F0306293%2Ccond-mat%2F0306104%2Ccond-mat%2F0306142%2Ccond-mat%2F0306405%2Ccond-mat%2F0306590%2Ccond-mat%2F0306559%2Ccond-mat%2F0306239%2Ccond-mat%2F0306675%2Ccond-mat%2F0306523%2Ccond-mat%2F0306356%2Ccond-mat%2F0306711%2Ccond-mat%2F0306611%2Ccond-mat%2F0306059%2Ccond-mat%2F0306746%2Ccond-mat%2F0306479%2Ccond-mat%2F0306645%2Ccond-mat%2F0306337%2Ccond-mat%2F0306480%2Ccond-mat%2F0306435%2Ccond-mat%2F0306045%2Ccond-mat%2F0306628%2Ccond-mat%2F0306527%2Ccond-mat%2F0306087%2Ccond-mat%2F0306456%2Ccond-mat%2F0306069%2Ccond-mat%2F0306380%2Ccond-mat%2F0306363%2Ccond-mat%2F0306492%2Ccond-mat%2F0306236%2Ccond-mat%2F0306644%2Ccond-mat%2F0306269%2Ccond-mat%2F0306038%2Ccond-mat%2F0306486%2Ccond-mat%2F0306496%2Ccond-mat%2F0306397%2Ccond-mat%2F0306565%2Ccond-mat%2F0306077%2Ccond-mat%2F0306452%2Ccond-mat%2F0306265%2Ccond-mat%2F0306573%2Ccond-mat%2F0306005%2Ccond-mat%2F0306443%2Ccond-mat%2F0306121%2Ccond-mat%2F0306240%2Ccond-mat%2F0306017%2Ccond-mat%2F0306185%2Ccond-mat%2F0306273%2Ccond-mat%2F0306414%2Ccond-mat%2F0306223%2Ccond-mat%2F0306090%2Ccond-mat%2F0306720%2Ccond-mat%2F0306036%2Ccond-mat%2F0306187%2Ccond-mat%2F0306477%2Ccond-mat%2F0306531%2Ccond-mat%2F0306548%2Ccond-mat%2F0306571%2Ccond-mat%2F0306620%2Ccond-mat%2F0306083%2Ccond-mat%2F0306039%2Ccond-mat%2F0306589%2Ccond-mat%2F0306433%2Ccond-mat%2F0306016%2Ccond-mat%2F0306140%2Ccond-mat%2F0306137%2Ccond-mat%2F0306388%2Ccond-mat%2F0306430%2Ccond-mat%2F0306398%2Ccond-mat%2F0306564%2Ccond-mat%2F0306242%2Ccond-mat%2F0306584%2Ccond-mat%2F0306572%2Ccond-mat%2F0306520%2Ccond-mat%2F0306439%2Ccond-mat%2F0306612%2Ccond-mat%2F0306406%2Ccond-mat%2F0306465%2Ccond-mat%2F0306244%2Ccond-mat%2F0306184%2Ccond-mat%2F0306598%2Ccond-mat%2F0306434%2Ccond-mat%2F0306194%2Ccond-mat%2F0306653%2Ccond-mat%2F0306028%2Ccond-mat%2F0306448%2Ccond-mat%2F0306704%2Ccond-mat%2F0306543%2Ccond-mat%2F0306703%2Ccond-mat%2F0306218%2Ccond-mat%2F0306221%2Ccond-mat%2F0306219%2Ccond-mat%2F0306364%2Ccond-mat%2F0306367%2Ccond-mat%2F0306641&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider laminar flow in channels constrained geometrically to remain\nbetween two parallel planes; this geometry is typical of microchannels obtained\nwith a single step by current microfabrication techniques. For pressure-driven\nStokes flow in this geometry and assuming that the channel dimensions change\nslowly in the streamwise direction, we show that the velocity component\nperpendicular to the constraint plane cannot be zero unless the channel has\nboth constant curvature and constant cross-sectional width. This result implies\nthat it is, in principle, possible to design \"planar mixers\", i.e. passive\nmixers for channels that are constrained to lie in a flat layer using only\nstreamwise variations of their in-plane dimensions. Numerical results are\npresented for the case of a channel with sinusoidally varying width."}, "authors": ["Eric Lauga", "Abraham D. Stroock", "Howard A. Stone"], "author_detail": {"name": "Howard A. Stone"}, "author": "Howard A. Stone", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.1760105", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0306572v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0306572v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0306572v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0306572v2", "arxiv_comment": null, "journal_reference": "Phys. Fluids (2004) 16, 3051-3062", "doi": "10.1063/1.1760105", "fulltext": "Three-dimensional flows in slowly-varying planar geometries\nEric Lauga1 , Abraham D. Stroock2 and Howard A. Stone1\n\narXiv:cond-mat/0306572v2 [cond-mat.soft] 6 Nov 2003\n\n1\n\nDivision of Engineering and Applied Sciences,\nHarvard University, Cambridge, MA 02138,\n\n2\n\nSchool of Chemical and Biomolecular Engineering,\nCornell University, Ithaca, NY 14853.\n(Dated: June 12, 2018)\n\nAbstract\nWe consider laminar flow in channels constrained geometrically to remain between two parallel\nplanes; this geometry is typical of microchannels obtained with a single step by current microfabrication\ntechniques. For pressure-driven Stokes flow in this geometry and assuming that the channel dimensions\nchange slowly in the streamwise direction, we show that the velocity component perpendicular to the\nconstraint plane cannot be zero unless the channel has both constant curvature and constant crosssectional width. This result implies that it is, in principle, possible to design \"planar mixers\", i.e.\npassive mixers for channels that are constrained to lie in a flat layer using only streamwise variations of\ntheir in-plane dimensions. Numerical results are presented for the case of a channel with sinusoidally\nvarying width.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe rapid development of microfluidic systems and their applications in domains such as\naeronautics, chemistry, material synthesis, medical diagnostics and drug delivery has recently\nmotivated investigations of new research questions in fluid dynamics at small scales ([1, 2, 3]). A\nparticularly active research area is the design of mixers for microdevices. This task has proven\nitself to be a real engineering challenge due to a variety of physical and practical constraints.\nPhysically, the typical cross-sectional dimensions of microchannels in current microfluidic systems are on the order of 10 − 100 μm ([2, 4]). On this scale, practical flows of common liquids\n(U ≈ 0.1 − 10 cm/s) have low Reynolds numbers, Re < 10, and turbulent mixing of the fluid\ndoes not generally occur. At the same time, the Peclet number for mass transfer in these flows,\ndefined as the ratio of a typical diffusive time to a typical advection time is high, P e > 100,\nand purely diffusive mixing across the flow is slow. For applications that require mixing, it is\ntherefore necessary to design channels that will lead to efficient convective mixing.\nIn a channel geometry, the strongest gradients of concentration are typically oriented in\na direction normal to the principal axis of the channel, because the gradients exist between\nco-flowing streams of distinct chemical makeup. An effective mixing flow in a channel must\ntherefore stir the fluid over the cross-section with transverse flows as the fluid progresses downstream in the axial flow; such a flow must possess three non-zero components. An effective\nstirring flow rapidly folds the fluid into itself so as to decrease the distance that diffusion must\nact to homogenize concentrations. The potential of a given channel-flow to mix efficiently can\nbe judged by several characteristics: (1) the ratio of the transverse to the axial velocities. If this\nratio is too small, then the axial length of channel required for mixing is likely to be impractically long, regardless of the detailed character of the flow; (2) the distribution of transverse\nflows within the cross-section of the channel. If the flows are confined to small areas within\nthe cross-section, then they will be ineffective at exchanging fluid between these areas and with\nareas in which no flow exists. (3) the evolution of the transverse flows as a function of axial\nposition along the channel. An efficient mixer should produce Lagrangian chaos; in particular,\nno streamwise symmetries should be present [5]. This feature is achieved in a channel-geometry\nwhen the position and orientation of transverse flows vary axially such that all fluid elements\ntravelling in the channel experience an alternating sequence of rotational and extensional flows\n2\n\n\f([6]).\nIn designing a laminar mixer for microfluidic applications, it is also important to take into\naccount the constraints imposed by technology and conversation laws. Designs of mixers should\nbe scalable to smaller systems, resistant to fouling by particulate matter, and efficient with\nrespect to power consumption. Moreover, the typical lithographic processes currently used in\nmicrofabrication lead to planar geometries.\nA variety of active ([7, 8]) and passive ([9, 10, 11, 12, 13]) methods have recently been\nproposed to generate stirring flows for mixing purposes. All of the passive designs that have\nbeen demonstrated to be effective rely however on multilayer or non-planar structures in order\nto generate three-dimensional flows. A single lithographic step generates a single flat layer of\nstructure with horizontal top and bottom walls and (relatively) vertical side walls (see Figure\n1) ([14]). More complicated structures, e.g. a non-intersecting cross-over between two channels,\nrequire multiple lithographic steps, with spatial alignment between each layer of structure. Each\nadded layer of structure increases the difficulty of fabrication and complicates scaling down to\nsmaller devices.\nMotivated by such practical considerations in this paper, we will be interested in characterizing the potential for mixing of the simplest planar geometrical configurations obtained in a\nsingle fabrication step. Two such geometries are illustrated in Figure 1. Suppose we fabricate\na channel constrained between two parallel planes of constant separation, can such a configuration mix? In order to be able to give an answer to this question that is robust to change in\nflow conditions, we will assume zero Reynolds number flows in the channel. This assumption\nalso implies that our conclusions will remain valid in smaller flow systems of the same design.\nIt is known that the steady-state velocity field in a straight channel of constant rectangular\ncross section is unidirectional ([15]) and therefore cannot mix except by molecular diffusion;\nsimilarly, the velocity field in a curved channel of constant cross-section and constant curvature\nis unidirectional ([16])[27]. As a consequence, the simplest potential design for a steady-state\nmixer for Stokes flow is that of a channel with variations of shape, that include changes of both\ncurvature and cross-sectional dimensions in the streamwise direction.\nIn order for flow in such a channel to potentially mix by advection in the three dimensions\nof the channel, the velocity field needs three non-zero components. While it is clear that these\nvariations in shape will lead to non-zero in-plane components of the velocity, as would also\n3\n\n\fbe the case in a truly two-dimensional channel, it is not obvious that the (third) out-of-plane\ncomponent will always be non-zero. We ask therefore the following question: under which\ncircumstances is the out-of-plane component of the velocity field always non-zero? And in this\ncase, what is the expected magnitude of the vertical flow?\nThe flows in a circular pipe of varying cross-section ([17]) or varying small curvature ([18])\nhave been studied and three-dimensional flow is obtained at zero Reynolds number. However,\nbecause the equation for the shape of a circular pipe couples the two directions that are perpendicular to its axis of symmetry, these results cannot be applied to the flow in a planar geometry\nand a separate analysis has to be carried out. Recently, Balsa [19] studied the secondary flow\nin a Hele-Shaw cell in which a vertical cylinder is immersed, at Reynolds number unity based\non the cylinder length, and showed the presence of streamwise vorticity in a boundary layer on\nthe cylinder surface; an earlier study by Thompson [20] focused on viscous features.\nThe geometry of a generic microchannel constrained between two parallel planes with fixed\nseparation and with no obstacles is illustrated in Figure 1 (top). The shape of the channel can\nbe entirely described by two degrees of freedom: (1) the shape of its centerline plane and (2)\nthe local symmetric width of the channel around this centerline. We will consider in this paper\nthe consequences of both and will treat each of them separately for simplicity.\nThe paper is organized as follows. In section II A we consider the case of a straight channel\nwith varying cross section in the direction perpendicular to both the flow and the constraint\nplane and in section II B we consider the case of a curved channel of constant cross section\nbut varying curvature. In both cases, under the assumption of an arbitrary but slowly varying\ncross section and curvature respectively, we show that the velocity component perpendicular\nto the constraint plane cannot be zero unless cross-section and curvature are both constant,\nand therefore the flow is fully three-dimensional in all other cases. We apply these results in\nsection III where we calculate the leading-order velocity field in the case of a straight channel\nof varying cross section and illustrate the flow patterns on a sinusoidally varying channel. We\nconclude in section IV with a discussion of both the practical advantages and limitations that\nthese results imply for mixing design. Appendices A 1 and A 2 present proofs for some of the\nresults used in sections II A and II B respectively and Appendix B presents the calculation for\nthe leading-order velocity field in the case of a channel of arbitrary shape.\n\n4\n\n\fII.\n\nTHREE-DIMENSIONALITY OF THE FLOW\nA.\n\nStraight microchannel of varying cross section\n\nIn this section we consider the case of a straight microchannel of varying cross section, as\nillustrated in Figure 2. A pressure-driven flow takes place in the x direction of a channel of\nconstant height 2h in the z-direction and varying width 2hf (x/λ) in the y direction, where λ\nis the axial length scale on which such variations occur. The equations of motion and mass\nconservation for an incompressible Stokes flow are written\n∇p = μ∇2 u,\n\n∇.u = 0\n\n(1)\n\nwith the no-slip boundary condition u(x, y = ±hf (x/λ), z) = u(x, y, z = ±h) = 0, on the four\nbounding surfaces. The flow rate Q is set by upstream conditions and is constant\nZ\n\nh\n−h\n\nZ\n\n+hf (x/λ)\n\n(u.ex ) dy dz = Q.\n\n(2)\n\n−hf (x/λ)\n\nWe now make the assumption that the width of the channel is slowly varying. If we define\nǫ = h/λ, this assumption is equivalent to assuming that ǫ ≪ 1. Using the notations u = (u, v, w)\nfor the velocity field, we can now nondimensionalize the previous set of equations (1)-(2) by\nscaling lengths, velocities and pressure by\n(x, y, z) = (λx̃, hỹ, hz̃),\n\n(u, v, w) =\n\nQ\n(ũ, ǫṽ, ǫw̃),\nh2\n\np=\n\nλμQ\np̃.\nh4\n\n(3)\n\nDropping the tildes in the dimensionless variables for convenience, the dimensionless Stokes\nequation is\n∇p =\n\n\u0013\n\u0012\n2\n∂2\n∂2 h 2 2 i\n2 ∂\nu, ǫ v, ǫ w\n+\n+\nǫ\n∂x2 ∂y 2 ∂z 2\n\n(4)\n\nand the dimensionless continuity equation is\n\n∂u ∂v ∂w\n+\n+\n= 0.\n∂x ∂y\n∂z\n\n(5)\n\nWe look for a regular perturbation expansion for both the velocity and pressure fields under\nthe form\n(u, v, w, p) = (u0 , v0 , w0 , p0 ) + ǫ2 (u2 , v2 , w2 , p2 ) + O(ǫ4 )\n5\n\n(6)\n\n\fwhich is usual in lubrication theory (see e.g. [21]). The leading-order O(ǫ0 ) term of Stokes\nequation (1) is given by\n∂p0\n=\n∂x\n\n\u0012\n\n∂2\n∂2\n+\n∂y 2 ∂z 2\n\n\u0013\n\nu0 ,\n\n∂p0\n∂p0\n=\n=0\n∂y\n∂z\n\n(7)\n\nsubject to the no-slip boundary condition u0 (x, y = ±f (x), z) = u0 (x, y, z = ±1) = 0, and\nconstant flow rate\n4\n\nZ\n\n0\n\n1\n\nZ\n\nf (x)\n\nu0 dy dz = 1.\n\n(8)\n\n0\n\nThe axial velocity u0 is then easily calculated by separation of variables ([15])\n(\n)\n\u0012\n\u0013\nn\nX\n4(−1)\ncosh kn y\n1 dp0\n(z 2 − 1) +\ncos kn z\nu0 (x, y, z) =\n3\n2 dx\nkn\ncosh kn f (x)\nn≥0\n\n(9)\n\nwith kn = (n + 21 )π. This solution is simply the axial Poiseuille velocity in a straight channel\nof constant cross section evaluated at each location along the channel. The leading-order axial\npressure gradient is then given by the flow rate condition (8) which leads to\n3\ndp0\n=\ndx\n4f (x)\n\n(\n\n6 X tanh(kn f (x))\n−1\nf (x) n≥0\nkn5\n\n)−1\n\n*\n\n(10)\n\nNote that (4) and (5) show that at next order in ǫ2 , the leading-order out of plane velocity\nfield (v0 , w0 ) satisfies a two-dimensional Stokes equation with an effective distribution of mass\nsources and sinks given by −du0 /dx. Let us now assume these sources and sinks lead to a\nplanar velocity field is planar in the sense that the component of the velocity perpendicular to\nthe constraint plane is zero, w0 = 0. In this case, the continuity equation from (1) is written\n∂u0 ∂v0\n+\n= 0,\n∂x\n∂y\n\n(11)\n\nand allows us to solve explicitly for the y-component of the velocity v0 . Using the fact that u0\nsatisfies the no-slip condition on the walls of the channels, it is straightforward to obtain that\nv0 is given by\n∂\nv0 (x, y, z) =\n∂x\n\nZ\n\ny\n\nu0 (x, y ′ , z) dy ′ .\n\n(12)\n\n−f (x)\n\nThe solution (12) satisfies the no-slip conditions for v0 at z = ±1 and y = −f (x). If it also\nsatisfies the remaining no-slip condition at y = f (x) then the leading-order solution would be\n\n6\n\n\fentirely characterized and the flow would be planar at leading-order. The condition at y = f (x)\nwill however be satisfied if and only if\n∂\n∂x\n\nZ\n\nf (x)\n\nu0 (x, y ′ , z) dy ′ = 0\n\n(13)\n\n−f (x)\n\nfor all values of x and z in the channel. Using the solution (9), (13) can be integrated once to\nget\ndp0\ndx\n\n(\nX (−1)n\nn≥0\n\nkn4\n\n(tanh(kn f (x)) − kn ) cos kn z\n\n)\n\n= Φ(z).\n\n(14)\n\nIn order for equation (14) to be satisfied for all |z| ≤ 1 and x ≥ 0, it is then necessary that for\nall n ≥ 0,\n\ndp0\n(tanh(kn f (x)) − kn ) = δn\ndx\n\n(15)\n\nwhere the {δn } are constants independent of x. As is shown in Appendix A 1, this can only\nbe true if f (x) is constant, i.e. if the channel cross section is constant. As a consequence,\nthe vertical component of the velocity field w0 cannot be zero unless the cross section of the\nchannel is constant, in which case v0 = w0 = 0. When this is not the case and the cross section\nis changing along the channel, then the two-dimensional solution (9)-(12) is inconsistent and\nthe velocity field is fully three-dimensional at this order.\n\nB.\n\nChannel of constant cross section with varying curvature\n\nWe now proceed in the same manner as in section II A for the case of the channel of constant\ncross section but varying curvature, as illustrated in Figure 3. A pressure-driven flow takes\nplace in the axial direction, denoted as s, of a channel of constant height 2h in the z-direction\nand constant width 2d in the third direction, denoted as n for \"normal\". The centerline of\nthe channel is not straight but curved with local radius of curvature R(s) = R0 f (s/λ) in the\northogonal (en , es , ez ) frame, where λ is the typical length scale along the channel on which this\nlocal curvature changes. In this geometry, and using the notations u = (u, v, w) for the velocity\nfield, it is possible after some algebra to write the dimensional Stokes equation (1) under the\n\n7\n\n\fform\n\u00132 2\n\u0012\n\u0012\n\u0013\n∂ u\n1\n∂2u\nR(s)\n∂\n∂\n1 R(s) ∂p\n=\n+\n+\n(R(s) + n)u\nμ R(s) + n ∂s\n∂z 2\nR(s) + n\n∂s2 ∂n R(s) + n ∂n\n2R(s) ∂v\nR(s)\n∂v dR\n+\n+\n,\n2\n2\n(R(s) + n) ∂s (R(s) + n) ∂n ds\n\u00132 2\n\u0012\n\u0012\n\u0013\n∂ v\n1\n∂2v\n∂\nR(s)\n∂\n1 ∂p\n=\n+\n+\n(R(s) + n)v\nμ ∂n\n∂z 2\nR(s) + n\n∂s2 ∂n R(s) + n ∂n\n\u0012\n\u0013\n2R(s) ∂u\n∂v\nR(s)\ndR\n−\nn\n+\n−u ,\n(R(s) + n)2 ∂s (R(s) + n)3 ds\n∂s\n\u00132 2\n\u0012\n\u0013\n\u0012\n∂w\n∂ w\n∂2w\n1\nR(s)\n∂\n1 ∂p\n(R(s) + n)\n=\n+\n+\nμ ∂z\n∂z 2\nR(s) + n\n∂s2\nR(s) + n ∂n\n∂n\nnR(s) dR ∂w\n+\n,\n(R(s) + n)3 ds ∂s\nand the continuity equation is written\n\u0013\n\u0012\n∂u\n1\n∂w\n∂\nR(s)\n+\n((R(s) + n)v) +\n= 0.\nR(s) + n ∂s R(s) + n ∂n\n∂z\n\n(16a)\n\n(16b)\n\n(16c)\n\n(17)\n\nThe two sets of equations (16) and (17) are associated with the no-slip boundary condition on\nthe walls of the channel u(s, n = ±d, z) = u(s, n, z = ±h) = 0, as well as with the condition of\nconstant flow rate along the channel\nZ\n\nh\n\n−h\n\nZ\n\nd\n\n(u.es ) dz dn = Q.\n\n(18)\n\n−d\n\nAs in section II A, we now assume a slowly varying curvature, i.e. we assume that both h/λ ≪ 1\nand d/λ ≪ 1. Equations (16) - (18) can be nondimensionalized by scaling lengths, velocities\nand pressure by\n(s, n, z) ∼ (λs̃, dñ, hz̃),\n\n(u, v, w) =\n\nQ\nǫ\n(ũ, ṽ, ǫw̃),\nhd\nα\n\np=\n\nλμQ\np̃\nh3 d\n\n(19)\n\nwhere we denoted the aspect ratio α = h/d = O(1). Defining β = d/R0 and ǫ = h/λ ≪ 1,\nand dropping the tildes in the dimensionless variables for convenience, the dimensionless Stokes\n\n8\n\n\fequation is\n\u00132 2\n\u0012\n\u0012\n\u0013\n∂ u\nα2\n∂2u\nf (s)\n∂\n∂\nf (s) ∂p\n2\n=\n+ǫ\n+\n(f (s) + βn)u\nf (s) + βn ∂s\n∂z 2\nf (s) + βn\n∂s2\n∂n f (s) + βn ∂n\nǫ2 f (s)f ′(s) ∂v\n2ǫ2 βf (s) ∂v\n+\n,\n(20a)\n+\n(f (s) + βn)2 ∂s (f (s) + βn)2 ∂n\n\u00132 2\n\u0012\n\u0012\n\u0013\n∂p\n∂ v\n1\nǫ2 ∂ 2 v\nǫ4\nf (s)\n∂\n2 ∂\n= 2 2+ 2\n+ǫ\n(f (s) + βn)v\n∂n\nα ∂z\nα\nf (s) + βn\n∂s2\n∂n f (s) + βn ∂n\n\u0012\n\u0013\nǫ ∂v\nǫ3 βf (s)f ′(s)\n2ǫ2 βf (s) ∂u\nn\n+\n−u ,\n(20b)\n−\n(f (s) + βn)2 ∂s α(f (s) + βn)3\nα ∂s\n\u00132 2\n\u0012\n\u0013\n\u0012\n2\n∂w\n∂ w\nǫ2 α2\nf (s)\n∂\n∂p\n2∂ w\n4\n(f (s) + βn)\n= ǫ\n+ǫ\n+\n∂z\n∂z 2\nf (s) + βn\n∂s2\nf (s) + βn ∂n\n∂n\nnǫ4 βf (s)f ′ (s) ∂w\n+\n,\n(20c)\n(f (s) + βn)3 ∂s\nand the dimensionless continuity equation\n1\n∂w\n∂\nf (s) ∂u\n+\n(f (s) + βn)v +\n= 0.\nf (s) + βn ∂s f (s) + βn ∂n\n∂z\n\n(21)\n\nNote that β is not necessary small in actual MEMS applications [22]. We then look for a regular\nperturbation expansion for both the dimensionless velocity and pressure fields under the form\n(u, v, w, p) = (u0 , v0 , w0, p0 ) + ǫ2 (u2 , v2 , w2, p2 ) + O(ǫ4 ).\nThe leading-order O(ǫ0 ) of the Stokes equation (16) is\n\u0012\n\u0013\nf (s) ∂p0\nα2\n∂ 2 u0\n∂\n∂\n=\n+\n(f (s) + βn)u0\nf (s) + βn ∂s\n∂z 2\n∂n f (s) + βn ∂n\n∂p0\n∂p0\n=\n=0\n∂n\n∂z\n\n(22)\n\n(23a)\n(23b)\n\ntogether with the no-slip boundary condition u0 (s, n = ±1, z) = u0 (s, n, z = ±1) = 0, and\nconstant flow rate\nZ\n\n1\n\n−1\n\nZ\n\n1\n\nu0 dz dn = 1.\n\n(24)\n\n−1\n\nUsing separation of variables, it is possible to solve for the axial velocity component in equations\n(23) - (24), similarly to what was done by Rieger & Sĕsták (1973) for the case of a curved\nrectangular channel of constant curvature. We obtain\n(\n)\nX \u0012 kn (f (s) + βn) \u0013\nz2 − 1\ndp0\ncos kn z ,\n+\nUn\nu0 (s, n, z) = f (s)\nds 2(f (s) + βn) n≥0\nαβ\n9\n\n(25)\n\n\fwhere the set of functions Un are defined by\nUn (η) = En (s)K1 (η) + Fn (s)I1 (η) ,\n\n(26)\n\nwith I1 and K1 as the order-one modified Bessel functions of the first and second kind respectively, and with\n\b\n(f (s) − β)I1 (kn− (s)) − (f (s) + β)I1 (kn+ (s)) Gn (s),\n\b\nFn (s) = (f (s) + β)K1 (kn+ (s)) − (f (s) − β)K1 (kn− (s)) Gn (s)\n\nEn (s) =\n\nwhere\n\nGn (s) =\nand\n\n\b\n2(−1)n\nI1 (kn− (s))K1 (kn+ (s)) − I1 (kn+ (s))K1 (kn− (s))\n3\n2\n2\nkn (f (s) − β )\n\n(27a)\n(27b)\n\n−1\n\n,\n\n(28)\n\nkn (f (s) ± β)\n*\n(29)\nαβ\nUsing the identities K0′ = −K1 and I0′ = −I1 and the flow rate condition (24) we obtain the\nkn± (s) =\n\npressure gradient\n1\ndp0\n=\nds\n2f (s)\n\n(\n\n1\nHn (s)\nα\n(−1)n 2 −\nln\nk\n3β\nn\nn≥0\nX\n\n\u0012\n\nf (s) + β\nf (s) − β\n\n\u0013)−1\n\n,\n\n(30)\n\nwith\n\b\n\b\nHn (s) = En (s) K0 (kn− (s)) − K0 (kn+ (s)) + Fn I0 (kn+ (s)) − I0 (kn− (s)) *\n\n(31)\n\nAs in section II A, let us now make the assumption that the flow is planar, i.e. that the\nleading-order vertical component of the velocity field is zero, w0 = 0. In this case the continuity\nequation (17) becomes\n∂u0\n1 ∂\n+\n(f (s) + βn)v0 = 0.\n∂s\nf (s) ∂n\nwhich can be used to solved exactly for v0\n\u001aZ n\n\u001b\nf (s)\n∂\n′\n′\nu0 (t, n , z) dn *\nv0 (s, n, z) = −\nf (s) + βn ∂s\n−1\n\n(32)\n\n(33)\n\nThe solution (33) satisfies the no-slip boundary condition at z = ±1 and n = −1; if the\ncondition at n = 1 was also satisfied, the leading-order velocity field would be two-dimensional\nat leading-order, w0 = 0. The no-slip boundary condition evaluated at n = 1 will however be\nsatisfied if and only if\n∂\n∂s\n\n\u001aZ\n\n1\n′\n\n′\n\nu0 (t, n , z) dn\n−1\n\n10\n\n\u001b\n\n= 0,\n\n(34)\n\n\ffor all values of s and z. Using the solution for the axial velocity (25), (34) can be integrated\nonce to obtain\n\n\n\n\n\nn\nX\ndp0\nαHn (s)\n2(−1)\n\u0010\n\u0011  = Ψ(z),\nf (s)\ncos kn z \n−\n\nds  n≥0\nkn\nβkn3 ln ff (s)+β\n(s)−β\n\n(35)\n\nwhere Hn is defined in (31). In order for (35) to be satisfied for all |z| ≤ 1 and s ≥ 0, it is\nnecessary that all for all n ≥ 0,\n\n\n\n\nn\ndp0 αHn (s)\n2(−1)\n\u0010\n\u0011 = γn\nf (s)\n−\n\nds  kn\nβkn3 ln ff (s)+β\n(s)−β\n\n(36)\n\nwhere the {γn } are constants independent of s. As is shown in Appendix A 2, (36) can be\nsatisfied if and only if f (s) is constant, i.e. if the curvature of the channel is constant, in\nwhich case v0 = w0 = 0. When this is not the case and the curvature is changing along the\nchannel, then the two-dimensional solution (25)-(33) is inconsistent and the velocity field is\nfully three-dimensional at this order.\n\nIII.\n\nILLUSTRATION OF THE THREE-DIMENSIONAL FLOWS\n\nWe have demonstrated in the previous two sections that flows in channels constrained to\nremain in a layer of constant thickness are in general three-dimensional, i.e. they possess a\nnon-zero component of the velocity perpendicular to the constraint plane. We illustrate these\nresults in this section for the case studied in section II A of a straight channel of varying width.\nWe calculate the three components of the leading-order velocity field (u0 , v0 , w0 ) and illustrate\nthe flow patterns in a sinusoidally varying channel; the calculation for the general case of an\nasymmetric channel is more intricate and we present it in Appendix B for the interested reader.\n\nA.\n\nGoverning equations\n\nBecause the velocity field (u0 , v0 , w0 ) is three-dimensional, the continuity equation in (1)\nbecomes\n∂u0 ∂v0 ∂w0\n+\n+\n= 0,\n∂x\n∂y\n∂z\n11\n\n(37)\n\n\fwhere u0 is still given by equation (9). Under Stokes flow conditions, the pressure is harmonic\n∇2 p = 0, and therefore the velocity field always satisfies the biharmonic equation ∇4 u = 0.\nConsequently, within the lubrication approximation (3) and (6), the y and z component of the\ndimensionless velocity field satisfy\n∇4⊥ v0\n\n= 0,\n\n∇2⊥\n\nwhere\n\n≡\n\n∇4⊥ w0 = 0.\n\n\u0012\n\n∂2\n∂2\n+\n∂y 2 ∂z 2\n\n\u0013\n\n(38a)\n(38b)\n\nSimilarly, the vorticity is harmonic ∇2 ω = 0, so that under the lubrication approximation, its\nleading-order axial component ω0 =\n\n∂w0\n∂y\n\n−\n\n∂v0\n∂z\n\nsatisfies\n\n∇2⊥ ω0 = 0.\n\n(39)\n\nIt is necessary to solve the set of equations (37), (38) and (39) along with the no-slip boundary\nconditions in order to obtain the final solution for (v0 , w0 ).\n\nB.\n\nSubset of equations\n\nLet us now show that it is sufficient to solve equations (37) and (38a) to obtain (38b) and\n(39). Let us suppose (37) and (38a) are satisfied. Evaluating the bi-harmonic ∇2⊥ of the\ncontinuity equation (37) leads to\n∂ 4\n∇ w0 = 0 → ∇4⊥ w0 = Γ(x, y).\n∂z ⊥\n\n(40)\n\nBecause of the symmetries in the configuration illustrated in Figure 1, the solution of Stokes\nequation has to satisfy w0 (x, y, −z) = −w0 (x, y, z) (and also v0 (x, y, −z) = v0 (x, y, z)). Conse-\n\nquently ∇4⊥ w0 is also odd with respect to z and necessarily Γ(x, y) = 0, so that equation (38b)\n\nis satisfied. In the same fashion, it is straightforward from (37) to obtain\n∂ω0\n= 0 → ω0 = Λ(x, y).\n∂z\n\n(41)\n\nUsing the fact that w0 and v0 are respectively odd and even with respect to z, it is clear that ω0\nis odd with respect to z so that Λ(x, y) = 0. The result of equation (39) is therefore recovered.\nAs a consequence, it is sufficient to solve equations (37) and (38a) to obtain the complete\nsolution for the leading-order velocity field.\n12\n\n\fC.\n\nVelocity field calculation\n\nTo obtain the leading-order solution for the three-dimensional velocity field in the channel,\nwe solve equations (38a) and (37), along with the no-slip boundary conditions for v0 and w0\nand with the axial velocity u0 given by (9). In order to do so, we use the technique introduced\nmore than a century ago by Lamé ([23]) to solve planar elasticity problem where biharmonic\nequations arise (see also the general discussion in [24]). Here we effectively demonstrate that\nthese ideas also apply as well to slowly varying flows. Using the following symmetries in the\nvelocity field\nv0 (x, y, −z) = v0 (x, y, z),\n\nv0 (x, −y, z) = −v0 (x, y, z),\n\n(42a)\n\nw0 (x, −y, z) = w0 (x, y, z),\n\nw0 (x, y, −z) = −w0 (x, y, z),\n\n(42b)\n\nwe look for a solution of (38a) under the form of a double Fourier series in y and z\n\u0013\n\u0012\nX\nX\nlm y\n,\nv0 (x, y, z) =\nAn (x, y) cos kn z +\nBm (x, z) sin\nf\n(x)\nm>0\nn≥0\n\n(43)\n\nwith lm = mπ and kn = (n + 1/2)π. In order for (38a) and (42a) to be satisfied, the functions\nAn and Bm are given by[28]\nAn (x, y) = an (x)Pn (x, y),\n\nBm (x, z) = bm (x)Qm (x, z)\n\n(44)\n\nwith\nPn (x, y) = f (x) sinh(kn y) − y cosh(kn y) tanh(kn f (x))\n\u0013\n\u0012\n\u0013\n\u0012\n\u0013\n\u0012\nlm z\nlm z\nlm\ncosh\n− z sinh\nQm (x, z) = tanh\nf (x)\nf (x)\nf (x)\n\n(45a)\n(45b)\n\nand where both (an (x)) and (bm (x)) are unknown functions to be determined. With the axial\nsolution (9) written\nu0 (x, y, z) =\n\nX\nn≥0\n\nUn (x, y) cos kn z,\n\n2(−1)n dp0\nUn (x, y) =\nkn3 dx\n\n\u0012\n\ncosh(kn y)\n−1\ncosh(kn f (x))\n\n\u0013\n\n(46)\n\nand with (43), integration of the continuity equation (37) leads to the third component of the\nvelocity field\n\u0013\n\u0013\n\u0012\nX lm bm (x)Tm (x, z)\nX 1 \u0012 ∂Un\nlm y\n∂Pn\nsin kn z −\n+ an (x)\ncos\nw0 (x, y, z) = −\nk\n∂x\n∂y\nf (x)\nf (x)\nm>0\nn≥0 n\n13\n\n(47)\n\n\fwith\nTm (x, z) =\n\n\u0012\n\nf (x)\ntanh\nlm\n\n\u0012\n\nlm\nf (x)\n\n\u0013\n\nf (x)2\n+ 2\nlm\n\n\u0013\n\nsinh\n\n\u0012\n\nlm z\nf (x)\n\n\u0013\n\nf (x)\n−\nz cosh\nlm\n\n\u0012\n\nlm z\nf (x)\n\n\u0013\n\n*\n\n(48)\n\nThe sets of unknown functions (an ) and (bm ) are finally determined by enforcing the no-slip\nboundary condition for the solution (47) at both z = ±1 and y = ±f (x). As is usually the\ncase for problems involving biharmonic equations (e.g. [24]), the final result involves an infinite\nsystem of linear algebraic equations given by\n\nX\n\na\n(x)\n=\na\n(x)\n+\nAnm (x)bm (x) (n ≥ 0),\n n\nn\n\nm>0\nX\n\nb\n(x)\n+\nBmn (x)an (x) (m > 0),\nb\n(x)\n=\n\nm\nm\n\n\n(49)\n\nn≥0\n\nwith\n\n∂Un\n(x, f (x))\nan (x) = −\n∂x\n\n\u001a\n\n∂Pn\n(x, f (x))\n∂y\n\n\u001b−1\n\n,\n\n\u001a\n\u001b−1 Z 1\n2(−1)m+1 lm kn ∂Pn\n(x, f (x))\nTm (x, z) sin kn z dz,\nAnm (x) =\nf (x)\n∂y\n0\n\u0013\n\u0012\nX (−1)n+1 Z f ∂Un\n2\nlm y\nbm (x) =\ndy,\n(x, y) cos\nlm Tm (x, 1) n≥0\nkn\n∂x\nf (x)\n0\n\u0013\n\u0012\nZ f\n2(−1)n+1\nlm y\n∂Pn\nBmn (x) =\ndy.\n(x, y) cos\nkn lm Tm (x, 1) 0 ∂y\nf (x)\n\n(50a)\n(50b)\n(50c)\n(50d)\n\nNote that, at a given position x, both the (an (x)) and (bn (x)) are entirely determined by the\ninstantaneous values of f (x) and f ′ (x); each subsequent order in the long-wavelength expansion\n(6) will bring an additional dependance on a higher derivative of f (x).\n\nD.\n1.\n\nFurther calculations\nAxial vorticity\n\nGiven the sets of {an } and {bn }, we can evaluate the axial component of the vorticity\nω0 =\n\n∂w0\n∂y\n\n−\n\n∂v0\n:\n∂z\n\n\u0013\nX 1 \u0012 ∂ 2 Un\n∂ 2 Pn\n2\n+ an (x) 2 − kn an (x)Pn (x, y) sin kn z\nω0 (x, y, z) = −\nk\n∂x∂y\n∂y\nn≥0 n\n\u0013\n\u0012\n\u0013\n\u0012\nX l2 bm (x)Tm (x, z)\nlm y\n∂Qm\nm\nsin\n*\n− bm (x)\n+\n2\nf\n(x)\n∂z\nf\n(x)\nm>0\n14\n\n(51a)\n(51b)\n\n\f2.\n\nQuadrant-averaged velocities\n\nThe quadrant-averaged velocities can also be evaluated, for example in the quadrant (y >\n0, z > 0). The flow rate condition (8) leads to a constant average axial velocity, < u0 > (x) =\n1/4. Integration of (43) and (47) across the quadrant leads to\n< v0 > (x) =\n\nX (−1)n an Z\nn≥0\n\nand\n\nE.\n\nkn f (x)\n\n0\n\nf (x)\n\nX bm f (x)(1 + (−1)m+1 ) Z 1\nPn (x, y)dy +\nQm (x, z)dz, (52)\nl\nm\n0\nm>0\n\n\u0015\nX 2(−1)n+1 d \u0014 dp0\n(tanh(kn f (x)) − kn f (x)) .\n< w0 > (x) =\n6 f (x) dx\nk\ndx\nn\nn≥0\n\n(53)\n\nCase of a sinusoidally varying wall\n\nWe chose to illustrate the flow patterns in the case where the wall shape is described by\nthe dimensionless function f (x) = 1 + 0.7 sin x; recall that the actual dimensional wall shape\nis described by f (ǫx) where ǫ = h/λ. The infinite system of linear equations (49) was solved\nnumerically by truncating it at finite values of n and m. The integrals in (50) only involve\nlinear and trigonometric functions and are evaluated exactly. Note that apart from the system\n(49), summations are also involved in equations (10) for the pressure gradient and (50c) for\nbm (x), and they also require numerical truncations.\nFor each case, numerical results were obtained, the truncation was refined and the results\nwere found to converge quickly to a final solution. The truncations at n = 50 in equations\n(10) and (50c) were found to be suitable to obtain the final solution. Further, a truncation at\nn = m = 20 in the infinite set of linear equations equation (49) was also found to be appropriate\nto resolve the flow fields, with results essentially unchanged for higher truncation numbers.\nSuch techniques allow us to obtain everywhere in space the three leading-order velocity\ncomponents and therefore, with a simple time advancement scheme, to follow the motion of\nindividual fluid elements and obtain streamlines.\nThe main results of our flow illustration are displayed in Figures 4, 5 and 6. Figure 4 presents\nin-plane velocity plots at three locations along the channel direction, as well as iso-value maps\nat these locations for both in-plane velocity components (v0 ,w0 ) and for the axial component\nof the vorticity (ω0 ) [29]. Figure 5 displays the flow streamlines along the expansion part of the\n15\n\n\fchannel (3π/2 < x < 5π/2). Finally, Figure 6 displays the maximum cross-sectional as well as\naverage value of the three components (u0 , v0 , w0 ) of the leading-order dimensionless velocity\nas a function of the location along the channel centerline.\nThe numerical results confirm that the flow at leading-order is fully three-dimensional. The\nplots in Figure 4 allow us to visualize the regions of high and low velocity and vorticity and\nthe streamlines in Figure 5 show the fluid elements are indeed vertically displaced as they are\nadvected along the channel. Note that the similar plots for the contracting part of the channel\nwere not included here as they can be deduced from those in Figure 4 and 5 by symmetry of\nStokes's equation.\nWe also note in Figure 4 that the qualitative picture for the iso-values of v0 do not vary much\nbetween the point of minimum width (x = 3π/2) and the point of maximum width (x = 5π/2).\nIn contrast to v0 , the distribution of vertical velocity w0 is modified appreciably: it changes\nfrom a monotonic variation across the channel (left picture in Figure 4c) to a variation with\nlocal minimum/maximum in the middle of the channel and global maximum/minimum near\nthe channel walls (middle and right picture in Figure 4c). Moreover, as can be seen in Figure\n4d, the axial vorticity is maximum at the top and bottom walls and decays towards the middle\nof the channel (z=0); the contracting part is therefore the position along the channel where the\nstrongest stirring of material surfaces would occur.\nFurther, the results of Figure 6 show that under the lubrication approximation, the\nmagnitude of the vertical flow component w0 decreases monotonically during an expansion\n(3π/2 < x < 5π/2); by symmetry of Stokes's equation, w0 increases in a similar fashion during\na contraction of the channel, (π/2 < x < 3π/2).\nWe see also that for the particular case considered here, and within the lubrication approximation, the leading-order y-component of the velocity v0 is always about one order of\nmagnitude smaller that the axial component u0 and that the vertical component w0 is about\none order of magnitude smaller than v0 ; back to the dimensional variables, these statements\nbecome v ≈ ǫu/10 and w ≈ ǫu/100.\nFinally, the integrated effect of the vertical flow along the channel length is illustrated in\nFigure 5 by the vertical deflection of streamlines. The deflection is larger far from the horizontal\ncenterplane (see Figure 5b) and far from the vertical centerplane (see Figure 5a). Over the\nchannel half period, a fluid element on the upper right streamline in Figure 5a experiences a\n16\n\n\fvertical displacement of about 10% of the channel half-height.\n\nIV.\n\nCONCLUSION\n\nWe have shown in this paper that the only planar channel shapes for which the velocity field\nis two-dimensional under Stokes flow conditions have both constant curvature and constant\ncross section (in which case the flow field is in fact unidirectional). In all other cases for\nthe variation of the cross-section and curvature, the velocity is fully three-dimensional at zero\nReynolds number and could in principle be used to mix species in simple microdevices that can\nbe manufactured with one step of microfabrication.\nA qualitative summary for the occurrence of the third component of the flow can be given\nusing the two-dimensionality condition, i.e. equation (13) or (34). The velocity field remains\nR\ntwo-dimensional in the channel if the two-dimensional flow rate Q(z) = udy is constant along\nthe channel for each z. When this is not the case and Q(z) is streamwise-dependent, a vertical\nvelocity component is induced by mass conservation. What our study shows is that, under\nthe lubrication approximation, the only channel geometries with no embedded obstacles for\nwhich this is not the case are those of both constant width and constant curvature. Note that\nalternatively, the presence of obstacles such as cylinders in an otherwise straight channel would\nprovide similar geometric features necessary for the occurrence of a three-dimensional flow [20].\nAs the general form of the continuity equation shows, the magnitude of the ratio of the outof-plane velocity component w to the axial component u scales as the ratio of the cross-sectional\nlength scale h to the length scale λ over which the variations of the channel geometry occur,\nw\nh\n≈ = ǫ.\nu\nλ\n\n(54)\n\nThe numerical results presented in section III E for a sinusoidal change in cross-section show\nthat the prefactors for this scaling is about 0.01 for the ratio of the leading-order velocity fields\nw0 to u0 and indicate poor mixing. For the case h ≈ λ, we could expect however all orders in\nthe perturbation expansion to contribute in a non trivial way, and we expect therefore that with\nthis simple design a vertical flow of strength comparable to the axial flow could exist; if that\nis not the case and the prefactors for the full calculation are not of order one, the channel will\nlikely present poor mixing characteristics. Note that as the Reynolds number in micromixers\n17\n\n\fis not exactly zero but can be as high as 100, we also expect in this case the occurrence of\nnon-trivial Dean flow-like contributions to the vertical flow.\nWe propose to design \"planar mixers\" by a succession of n mixing cells of length λ along a\nsingle channel. In each cell, we expect the integrated displacements δy and δz of fluid elements\nin the cross-section, advected by the flow at velocity Uaxial , to be given by\nδy ≈ δz ≈ t⊥ U⊥ ,\n\n(55)\n\nwhere t⊥ is the residence time for the flow in the cell t⊥ ≈ λ/Uaxial and U⊥ is the magnitude\nof the transverse flow, at most U⊥ ≈ hUaxial /λ so that δy ≈ δz ≈ h. Since the total length\nof the mixer is nλ and the displacements δy and δz are independent of the cell length, small\ncells λ ≈ h should be chosen. The challenge in the mixing design would then concern (1) the\ndesign of each cell, i.e. the variations of its radius of curvature and its cross-section, in order to\nobtain the maximum cross-sectional displacement and (2) the setup of the cell succession in a\nway that mixing adds up instead of cancelling out; for example the channel studied in section\nIII E would obviously make very poor mixing cells because by symmetry of Stokes flow, every\nfluid stirring taking place in one part of the channel would be unstirred in the other part of the\nchannel located immediately downstream. In general, good performance may be achieved by\navoiding any geometrical symmetry along the streamwise direction.\nThe calculations presented in this paper assumed slowly varying cross-sectional and curvature change along the channel, ǫ ≪ 1. As was shown by Lucas (1972) for two-dimensional\nchannels of varying shape, the regular perturbation expansions (6) or (22) are expected to have\nhave order one or larger radius of convergence in ǫ; as a consequence, the conclusions reached\nusing the leading-order velocity fields are valid for the entire velocity field when ǫ is O(1), and\npresumably higher even though our results cannot be applied directly. With current microfabrication techniques, the minimum in-plane dimension (≈ λ) that can be generated is typically\ngreater than the minimum out-of-plane dimension (≈ h). As a consequence, the cross-sectional\ndimensions of microchannels tend to satisfy the criterion, ǫ < 1, and the results obtained in\nthis paper are expected to apply for all such cases.\nThe limitation of the passive mixing strategy proposed here lies in the top-bottom symmetry\nfor the velocity field, (u, v, w)(x, y, −z) = (u, v, −w)(x, y, z), due to the symmetries of the\nStokes equations. Mixing can therefore not be achieved between the fluids located in the z > 0\n18\n\n\fand z < 0 planes and consequently, the streams of solutions that are to be mixed must be\nintroduced at the inlet of the channel with alignment in the vertical direction. The case of a\nstraight channel of varying section studied in section II A also possess a right/left symmetry,\n(u, v, w)(x, −y, z) = (u, −v, w)(x, y, z), (see Figure 4) and therefore cannot mix species fluids\nlocated in the y > 0 and y < 0 planes. The configuration studied in section II B does not\npossess such a symmetry and should be used to transport fluid between the n > 0 and n < 0\nplanes, similarly to what was achieved in Stroock et al. (2002). A fully numerical approach\nto the problem (using e.g. a boundary element method or a commercial code) would allow a\ndetailed study of the proposed mixing design, its optimization, and dispersion characteristics.\n\nAcknowledgments\n\nThe authors acknowledge fruitful discussions with M. Brenner and T. Squires on the subject. We also thank two anonymous referees for useful suggestions. Funding from the Harvard\nMRSEC and the NSF Division of Mathematical Sciences is gratefully acknowledged.\n\nAPPENDIX A: PROOFS\n1.\n\nProof of result (15) for straight channels\n\nWe show in this section that the only set of width functions f (x) that satisfy (15) are the\nconstant functions. Let us assume that (15) is satisfied for a function f (x). We first rewrite\nequation (10) for the pressure gradient under the form\n6\n\ndp0\n3\ndp0 X tanh(kn f (x))\n− f (x)\n= *\n5\ndx n≥0\nkn\ndx\n4\n\n(A1)\n\nWe then rewrite the condition (15) for two-dimensionality of the flow as\ndp0\ndp0\ntanh(kn f (x)) = δn + kn\ndx\ndx\n\n(A2)\n\nSubstituting the expression obtained in (A2) into (A1) leads to a closed form solution for the\naxial pressure gradient\n∆1\ndp0\n=\n,\ndx\n∆2 − f (x)\n\n∆1 =\n\nX δn\n3\n,\n−6\n4\nk5\nn≥0 n\n19\n\n∆2 = 6\n\nX 1\n*\nk4\nn≥0 n\n\n(A3)\n\n\fAs a conclusion, the functional form (A3) obtained for the pressure gradient is not consistent\nwith that given by the assumption of the two-dimensionality of the flow (15)\ndp0\nδn\n=\n,\ndx\ntanh(kn f (x)) − kn\n\n(A4)\n\nunless the function f (x) is constant.\n\n2.\n\nProof of result (36) for curved channels\n\nWe show in this section that the only set of curvature functions f (s) that satisfy (36) are\nthe constant functions. Let us assume that (36) is satisfied for a function f (s). We first rewrite\nequation (30) for the pressure gradient under the form\n\u0013\n\u0012\nf (s) + β\n2f (s) dp0\ndp0 X\nn αHn (s)\n(−1)\n= 1.\nln\n−\n2f (s)\nds n≥0\nkn2\n3β ds\nf (s) − β\n\n(A5)\n\nWe then rewrite the condition (36) for two-dimensionality of the flow as\nf (s)\n\ndp\n2(−1)n\ndp0 αHn (s)\n\u0011 f (s) 0 + γn .\n\u0010\n=\nds kn\nds\nβkn3 ln ff (s)+β\n(s)−β\n\n(A6)\n\nSubstituting (A6) into (A5) leads to a closed-form solution for the streamwise pressure gradient\n\u0011\n\u0010\nf (s)+β\n∆\nln\n3\nf (s)−β\ndp0\n\u0011\n\u0010\nf (s)\n,\n=\n2 f (s)+β\nds\nln f (s)−β − ∆4\n\n∆3 = 3β\n\n(\nX (−1)n γn\nn≥0\n\nkn\n\n−\n\n1\n2\n\n)\n\n,\n\n∆4 = 6\n\nX 1\n*\nk4\nn≥0 n\n\n(A7)\n\nFurther, it is possible to use the asymptotic behaviors near x ∼ ∞ of Bessel functions (see e.g.\n√\n√\n[26]) Ip (x) ∼ ex / 2πx, Kq (x) ∼ πe−x / 2x to obtain the asymptotic behaviors of En (s), Fn (s),\nGn (s) as n → +∞, from equations (27a), (27b) and (28) respectively. It is then straightfoward\nto obtain the asymptotic behavior of Hn\nHn (s) ∼\n\n4(−1)n f (s)\n*\nkn3 (f (s)2 − β 2 )\n\n(A8)\n\nThis behavior and the condition of two-dimensionality (36) allows to obtain an alternate functional behavior for the streamwise pressure gradient\n\u0013\n\u0012\ndp0\nβkn3 (−1)n+1 γn\nf (s) + β\nf (s)\n, ∆5 =\n∼ ∆5 ln\n*\nds\nf (s) − β\n2\n\n(A9)\n\nAs a conclusion, the two functional forms obtained assuming two-dimensionality of the flow\n(A7) and (A9) are not consistent with each other unless the function f (s) is a constant.\n20\n\n\fAPPENDIX B: LEADING ORDER VELOCITY FIELD FOR ASYMMETRIC WALL\nPROFILE\n\nWe present in this section the solution for the leading-order lubrication velocity field in the\ncase of a planar channel of general shape; the calculation presented here contains that presented\nin section III C as a special case. We use a cartesian coordinate system, as illustrated in Figure 7.\nAll notations are the same as in section II A, with the difference that the channel is not right/left\nsymmetric and we denote its boundaries by the equations y = hf1 (x/λ) and y = −hf2 (x/λ),\nwith f1 (x) > 0 and f2 (x) > 0. Using the same nondimensionalizations and regular expansion\nas in section II A and defining the convenient notations f1 , f1 (x) and f2 , f2 (x), we obtain\nthat the leading-order axial velocity field is given by\nu0 (x, y, z) =\n\nX\nn≥0\n\nUn (x, y) cos kn z,\n\ndp0 (−1)n\nUn (x, y) = 2\ndx kn3\n\n(\n\ncosh kn\n\nand a pressure gradient obtained by enforcing the flow rate condition\nZ 1 Z f1\n2\nu0 dy dz = 1,\n0\n\nf2 −f1\n2\n\u0001\nf1 +f2\n2\n\ncosh kn y +\n\n\u0001\n\n)\n\n− 1 , (B1)\n\n(B2)\n\n−f2\n\nwhich leads to\n3\ndp0\n=\ndx\n2(f1 + f2 )\n\n(\n\n12 X\nf1 + f2 n≥0\n\n2\ntanh kn f1 +f\n2\nkn5\n\n\u0001!\n\n−1\n\n)−1\n\n*\n\n(B3)\n\nConcerning the other two velocity components, the arguments presented in section III B also\napply to the configuration considered here and the equations to solve for v0 and w0 are equations\n(38a) and (37), along with the no-slip boundary conditions. Using the top/bottom symmetries\nin the velocity field\nv0 (x, y, −z) = v0 (x, y, z),\n\nw0 (x, y, −z) = −w0 (x, y, z)\n\nwe look for for a solution of (38a) under the form of a double Fourier series in y and z,\n\u0012\n\u0013\nX\nX\nlm (2y + f2 − f1 )\nv0 (x, y, z) =\nAn (x, y) cos kn z +\nBm (x, z) sin\nf1 + f2\nm>0\nn≥0\n\u0013\n\u0012\nX\nkp (2y + f2 − f1 )\n,\n+\nCp (x, z) cos\nf1 + f2\np≥0\n21\n\n(B4)\n\n(B5)\n\n\fwhere kn = (n + 1/2)π, lm = mπ, kp = (p + 1/2)π and\nAn (x, y) = an (x)Pn (x, y) + bn (x)Qn (x, y),\n\n(B6a)\n\nBm (x, z) = cm (x)Sm (x, z),\n\n(B6b)\n\nCp (x, z) = dp (x)Tp (x, z),\n\n(B6c)\n\nwith\nPn (x, y) = (f1 + f2 ) sinh kn (f1 − y) − (f1 − y) cosh kn (f1 − y) tanh kn (f1 + f2 ),\n\n(B7a)\n\nQn (x, y) = (f1 − y) sinh kn (f1 − y) − (f1 − y) cosh kn (f1 − y) tanh kn (f1 + f2 ),\n\u0010\n\u0011\n2lm z\n\u0013\n\u0012\nsinh f1 +f2\n2lm z\n\u0011,\n\u0010\n−z\nSm (x, z) = cosh\nf1 + f2\nm\ntanh f12l+f\n2\n\u0010\n\u0011\n2kp z\n\u0013\n\u0012\nsinh\nf1 +f2\n2kp z\n\u0011*\n\u0010\n−z\nTp (x, z) = cosh\n2kp\nf1 + f2\ntanh\n\n(B7b)\n(B7c)\n\n(B7d)\n\nf1 +f2\n\nNote that the solution in (B5) satisfies the no-slip boundary condition on all four walls. The\nintegration of the continuity equation (37) leads to the general form of the vertical velocity\ncomponent\n\u0013\u001b\nX \u001a 1 \u0012 ∂Un\n∂Pn\n∂Qn\nsin kn z\n+ an (x)\n+ bn (x)\nw0 (x, y, z) =\n−\nk\n∂x\n∂y\n∂y\nn\nn≥0\n\u0012\n\u0013\nX\nlm (2y + f2 − f1 )\n+\nlm cm (x)Ym (x, z) cos\nf1 + f2\nm>0\n\u0013\n\u0012\nX\nkp (2y + f2 − f1 )\n*\n+\nkp dp (x)Zp (x, z) sin\nf1 + f2\np≥0\n\n(B8)\n\nwith\n\u0010\n\u0011\n\n\n\u0012\n\u0013 z cosh 2lm z \n\nf1 +f2\n1 \n2lm z\n1\n\u0011\n\u0010\n\u0011  sinh\n\u0011 (B9a)\n\u0010\nYm (x, z) = −\n−\n,\n1+ \u0010\n2lm\n2lm\n2lm\n\nlm \nf1 + f2\ntanh\ntanh\nf1 +f2\nf1 +f2\nf1 +f2\n\u0010\n\u0011\n\n\n\u0012\n\u0013 z cosh 2kp z \n\nf1 +f2\n2kp z\n1 \n1\n\u0011\n\u0010\n\u0011  sinh\n\u0011 * (B9b)\n\u0010\n−\nZp (x, z) =\n1+ \u0010\n2kp\n2kp\n2kp\n\nkp \nf\n+\nf\n1\n2\ntanh\ntanh\nf1 +f2\n\nf1 +f2\n\nf1 +f2\n\nThe sets of unknown functions (an ), (bn ), (cn ) and (dn ) are finally determined by enforcing the\nno-slip boundary condition for w0 in (B8) on the four walls z = ±1, y = f1 and y = −f2 , and\n22\n\n\fwe obtain a set of four infinite linear algebraic equations\n\nX (2)\nX (3)\nX (4)\n\na\n(x)\n+\nA\n(x)b\n(x)\n+\nA\n(x)c\n(x)\n+\nAip (x)dp (x)\na\n(x)\n=\n\ni\nn\nm\ni\nin\nim\n\n\n\nm>0\nn≥0\np≥0\n\n\nX (1)\nX\nX\n\n(3)\n(4)\n\n\nb\n(x)\n+\nB\n(x)a\n(x)\n+\nB\n(x)c\n(x)\n+\nBnp\n(x)dp (x)\nb\n(x)\n=\nn\ni\nm\nn\n\nnm\nni\n\nm>0\ni≥0\np≥0\nX (1)\nX\nX\n(2)\n(4)\n\n\ncm (x) = cm (x) +\nCmi (x)ai (x) +\nCmn\n(x)bn (x) +\nCmp\n(x)dp (x)\n\n\n\n\ni≥0\nn≥0\np≥0\n\nX (1)\nX\nX\n\n\n(2)\n(3)\n\nDpi (x)ai (x) +\nDpn\n(x)bn (x) +\nDpm\n(x)cm (x)\n dp (x) = dp (x) +\n\ni≥0\n\nm>0\n\nn≥0\n\n(i ≥ 0),\n(n ≥ 0),\n(m > 0),\n\n(B10)\n\n(p ≥ 0),\n\nwith\n\nai (x) = −\nbn (x) = −\n\n\u0012\n\n\u0012\n\n∂Pi\n(x, f1 (x))\n∂y\n\n\u0013−1\n\n∂Qn\n(x, −f2 (x))\n∂y\n\n∂ui\n(x, f1 (x)),\n∂x\n\n\u0013−1\n\n∂Un\n(x, −f2 (x)),\n∂x\n(Z\nf1\nX (−1)j ∂uj\n\n2\nlm Ym (x, 1)(f1 + f2 )\n−f2\n(Z\nf1\n2\ndp (x) =\nkp Zp (x, 1)(f1 + f2 )\n−f2\n\ncm (x) =\n\n(B11a)\n\n(B11b)\n!\n\u0013 )\n\u0012\nlm (2y + f2 − f1 )\ndy(B11c)\n,\n(x, y) cos\nkj ∂x\nf1 + f2\nj≥0\n!\n\u0013 )\n\u0012\nX (−1)j ∂uj\nkp (2y + f2 − f1 )\ndy (B11d)\n,\n(x, y) sin\nk\n∂x\nf\n+\nf\nj\n1\n2\nj≥0\n\n23\n\n\fand\n(2)\nAin (x)\n\n=\n\n(3)\n\nAim (x) =\n(4)\n\nAip (x) =\n(1)\n\nBni (x) =\n(3)\nBnm\n(x) =\n(4)\nBnp\n(x) =\n(1)\n\nCmi (x) =\n(2)\nCmn\n(x) =\n(4)\nCmp\n(x) =\n(1)\n\nDpi (x) =\n(2)\nDpn\n(x) =\n(3)\nDpm\n(x) =\n\n\u0013−1\n∂Qi\n∂Pi\n(x, f1 (x))\n(x, f1 (x)),\n(B12a)\n−δin\n∂y\n∂y\n\u0012\n\u0013−1 Z 1\n∂Pi\nm\n2(−1) ki lm\n(x, f1 (x))\nYm (x, z) sin(kn z) dz,\n(B12b)\n∂y\n0\n\u0013−1 Z 1\n\u0012\n∂Pi\np\n(x, f1 (x))\nZp (x, z) sin(kn z) dz,\n(B12c)\n2(−1) ki kp\n∂y\n0\n\u0013−1\n\u0012\n∂Pn\n∂Qn\n(x, −f2 (x))\n(x, −f2 (x)),\n(B12d)\n−δni\n∂y\n∂y\n\u0012\n\u0013−1 Z 1\n∂Qn\nm\n2(−1) kn lm\n(x, −f2 (x))\nYm (x, z) sin(kn z) dz,\n(B12e)\n∂y\n0\n\u0013−1 Z 1\n\u0012\n∂Qn\np+1\n(x, −f2 (x))\nZp (x, z) sin(kn z) dz,\n(B12f)\n2(−1) kn kp\n∂y\n0\n\u0013\n\u0012\nZ f1\n∂Pi\nlm (2y + f2 − f1 )\n2(−1)i\ndy,\n(B12g)\n(x, y) cos\nki lm Ym (x, 1)(f1 + f2 ) −f2 ∂y\nf1 + f2\n\u0013\n\u0012\nZ f1\n2(−1)n\n∂Qn\nlm (2y + f2 − f1 )\ndy,\n(B12h)\n(x, y) cos\nkn lm Ym (x, 1)(f1 + f2 ) −f2 ∂y\nf1 + f2\n\u0012\n\u0013\n\u0012\n\u0013\nZ f1\nlm (2y + f2 − f1 )\nkp (2y + f2 − f1 )\n−2kp Zp (x, 1)\ncos\nsin\ndy,\n(B12i)\nlm Ym (x, 1)(f1 + f2 ) −f2\nf1 + f2\nf1 + f2\n\u0013\n\u0012\nZ f1\n2(−1)i\n∂Pi\nkp (2y + f2 − f1 )\ndy,\n(B12j)\n(x, y) sin\nki kp Zp (x, 1)(f1 + f2 ) −f2 ∂y\nf1 + f2\n\u0013\n\u0012\nZ f1\n2(−1)n\n∂Qn\nkp (2y + f2 − f1 )\ndy,\n(B12k)\n(x, y) sin\nkn kp Zp (x, 1)(f1 + f2 ) −f2 ∂y\nf1 + f2\n\u0012\n\u0013\n\u0012\n\u0013\nZ f1\n−2lm Ym (x.1)\nlm (2y + f2 − f1 )\nkp (2y + f2 − f1 )\ncos\nsin\ndy*\n(B12l)\nkp Zp (x, 1)(f1 + f2 ) −f2\nf1 + f2\nf1 + f2\n\u0012\n\nSimilar numerical technique as the ones illustrated in section III E can be used to solve (B10)\nand obtain the leading-order velocities in the general case given by (B5) and (B8).\n\n[1] C.-M. Ho, and Y.-C. Tai \"Micro-electro-mechanical systems (MEMS) and fluid flows,\" Ann. Rev.\nFluid Mech. 30, 579 (1999).\n[2] G.M. Whitesides and A.D. Stroock \"Flexible methods for microfluidics,\" Physics Today 54(6),\n42, (2001).\n\n24\n\n\f[3] H.A. Stone A.D. Stroock and A. Ajdari \"Engineering flows in small devices: Microfluidics towards\na lab-on-a-chip,\" Ann. Rev. Fluid Mech. 36 (to appear) (2004).\n[4] A. Manz, D.J. Harrison, E.M.J. Verpoorte, J.C. Fettinger, H. Ludi and H.M. Widmer \"Miniaturization of chemical-analysis systems - a look into next century technology or just a fashionable\ncraze,\" Chimia 45(4), 103 (1991).\n[5] I. Mezic and S. Wiggins \"On the Integrability and Perturbation of Three-Dimensional Fluid Flows\nwith Symmetry,\" J. Nonlinear Science, 4(2), 157 (1994).\n[6] Ottino, J.M. (1990) The Kinematics of Mixing: Stretching, Chaos and Transport. Cambridge,\nCambridge University Press\n[7] J.C. Rife, M.I. Bell, J.S. Horwitz, M.N. Kabler, R.C.Y. Auyeung and W.J. Kim \"Miniature\nvalveless ultrasonic pumps and mixers,\" Sensors and Actuators 86, 135 (2000).\n[8] Y.K. Lee, J. Deval, P. Tabeling and C.M. Ho \"Chaotic mixing in electrokinetically and pressure\ndriven micro flows,\" Prod IMRET 5. (2001).\n[9] F.G. Bessoth, A.J. deMello and A. Manz \"Microstructure for efficient continuous flow mixing,\"\nAnal. Commun. 36, 213 (1999).\n[10] R.H. Liu, K.V. Sharp, M.G. Olsen, M.A. Stremler, J.G. Santiago, R.J. Adrian, H. Aref and D.J.\nBeebe \"A passive three dimensional 'C-shape' helical micromixer,\" J. Microelectromech. Syst.\n9, 190 (2000).\n[11] A. Bertsch, A. Heimgartner, P. Cousseau, and P. Renaud \"Secondary flow in a Hele-Shaw cell,\"\nLab-on-a-Chip 1, 56 (2001).\n[12] T.J. Johnson, D. Ross, and L.E. Locascio \"Rapid microfluidic mixing,\" Anal. Chem 74, 45\n(2002).\n[13] A.D. Stroock, S.K.W. Dertinger, A. Ajdari, I. Mezic, H.A. Stone and G.M. Whitesides \"Chaotic\nmixer for microchannels,\" Science 295, 647 (2002).\n[14] G.T.A. Kovacs Micromachined transducers sourcebook. Boston, WCB/McGraw-Hill (1998).\n[15] G.K. Batchelor An Introduction to Fluid Dynamics. Cambridge, Cambridge University Press\n(1967).\n[16] F. Rieger and J. Sĕsták \"Creeping flow of Newtonian fluids in curved rectangular channels,\" App.\nSci. Res. 28, 89 (1973).\n[17] M.J. Manton \"Low Reynolds number flow in slowly varying axisymmetric tubes,\" J. Fluid Mech.\n\n25\n\n\f49, 451 (1971).\n[18] S. Murata, Y. Miyake and T. Inaba \"Laminar flow in curved pipe with varying curvature,\" J.\nFluid Mech. 73, 735 (1976).\n[19] T.F. Balsa \"Secondary flow in a Hele-Shaw cell,\" J. Fluid Mech. 372, 25 (1998).\n[20] B.W. Thompson \"Secondary flow in a Hele-Shaw cell,\" J. Fluid Mech. 31, 379 (1968).\n[21] S. Ghosal \"Lubrication theory for electroosmotic flow in a microfluidic channel of slowly varying\ncross-section and wall charge,\" J. Fluid Mech. 459, 103 (2002).\n[22] H. Song, J.D. Tice and R.F. Ismagilov \"A Microfluidic System for Controlling Reaction Networks\nin Time,\" Angew. Chem. Int. Edit. 42(7) 768 (2003).\n[23] G. Lamé Leçons sur la théorie mathématiques de l'élasticité des corps solides. Bachelier, Paris\n(1852).\n[24] V.V. Meleshko \"Steady Stokes flow in a rectangular cavity,\" Proc. Roy. Soc. A 452, 1999 (1996).\n[25] R.D. Lucas A perturbation solution for viscous incompressible flow in channels. Ph.D. thesis,\nStanford University (1972).\n[26] M. Abramowitz and I.A. Stegun Handbook of Mathematical Functions. New-York, Dover Publications (1972).\n[27] Note that both these results are in fact valid independently of the cross-sectional shape of the\nchannel as long as the shape remains constant. Note also that time-periodic flows in these geometries are also unidirectional and cannot be used for low-Reynolds number mixing (see e.g. the\nreview in [6]).\n[28] Note that in (44) we use the indices n and m twice but do not imply this is an implicit summation\nnotation.\n[29] Note that the velocity plots in Figure 4a display the two-dimensional (y, z) secondary flow of a\nthree-dimensional flow, which is not to be confounded with a two-dimensional flow.\n\n26\n\n\fFIGURES\n\n27\n\n\f+\n\nFIG. 1: Generic view of a microchannel constrained to remain between two parallel planes. The design\nof channel has two degrees of freedom: (1) the shape of its centerline and (2) the relative width of the\nchannel around this centerline.\n\n28\n\n\fy=h f(x/λ)\n\nez\ney\n\nz=h\nex\n\n2h\n\ny=-h f(x/λ)\n\nFIG. 2: Straight channel of slowly varying cross section in the y direction.\n\n29\n\n\fez\nz=h\n\n2d\n\nes\n\nR=R0 f(s/λ)\n\nen\n2h\nn=-d\nFIG. 3: Curved microchannel of constant cross section and slowly varying planar curvature.\n\n30\n\n\f2\n1\ny 0\n−1\n−2\n0\n\n4\n\n6\n\n8\n\nx\n\n10\n\n0.5\n\n0.5\n\n0.5\n\n0\n\n0\n\n0\n\n−0.5\n\nz\n\n1\n\nz\n\n1\n\nz\n\n(a)\n\n2\n\n1\n\n−0.5\n\n−0.5\n\n−1\n\n−0.2\n\n0\ny\n\n−1\n\n0.2\n\n1\n\n12\n\n−0.5\n\n0\ny\n\n−1\n\n0.5\n\n1\n\n−1\n\n−0.5\n\n0\ny\n\n0.5\n\n1\n\n1\n0.06\n\n0.1\n\n0.1\n\n0.04\n\n0.5\n\n0.5\n\n0.02\n\n0\n\n−0.05\n\n−0.1\n\n0\n\n0\n\nz\n\nz\n\n0\n\n−0.5\n\n0.5\n\n0.05\n\n0\n\nz\n\n(b)\n\n0.05\n\n0\n−0.02\n\n−0.05\n\n−0.5\n\n−0.1\n\n−0.04\n\n−0.5\n\n−0.06\n\n−0.15\n\n−1\n\n−0.2\n\n0\ny\n\n−1\n\n0.2\n\n−0.15\n\n−0.5\n\n0\ny\n\n−1\n\n0.5\n\n−1\n\n−0.5\n\n0\ny\n\n0.5\n\n1\n\n−3\n\n1\n\n−3\n\nx 10\n\n1\n0.04\n\nx 10\n1.5\n\n1\n\n6\n1\n\n0.03\n\n0.5\n\n4\n\n0.5\n\n0.02\n\n0\n\n−0.01\n\n0\n\n−0.03\n\n−6\n\n0\ny\n\n−1\n\n0.2\n\n−0.5\n\n0\ny\n\n0.2\n\n0.5\n\n0.2\n\n0.1\n\n0\n\n0\n\n0\ny\n\n0.5\n\n1\n\n0.15\n\n0\n\n0.1\n\n0.5\n0.05\n0\n\nz\n\n0\n\n−0.5\n\n0.3\n\nz\n\nz\n\n(d)\n\n−1\n\n1\n\n0.4\n\n0.6\n\n0.5\n\n−1.5\n\n−1\n\n0.5\n\n1\n\n1\n0.4\n\n−1\n\n−0.5\n\n−8\n\n−0.05\n\n−0.2\n\n−0.5\n\n−4\n\n−0.5\n\n−0.04\n\n−1\n\n0\n\n−2\n\n−0.02\n\n−0.5\n\n0\n\nz\n\nz\n\nz\n\n0\n\n0\n\n0.5\n\n2\n\n0.01\n\n(c)\n\n0.5\n\n−0.1\n\n−0.2\n\n0\n−0.05\n\n−0.2\n−0.4\n\n−0.5\n\n−0.5\n\n−0.3\n\n−0.1\n\n−0.5\n\n−0.6\n\n−0.15\n\n−0.4\n−0.8\n\n−1\n\n−0.2\n\n0\ny\n\n0.2\n\n−1\n\n−0.5\n\n−0.5\n\n0\ny\n\n31\n\n0.5\n\n−1\n\n−0.2\n\n−1\n\n−0.5\n\n0\ny\n\n0.5\n\n1\n\n\fFIG. 4: Illustration of the leading-order three-dimensional flow in the straight planar channel of varying\ndimensionless cross-section given by f (x) = 1 + 0.7 sin x. Top: view the channel. Bottom: plots of\nthe leading-order dimensionless cross-sectional velocity field (v0 , w0 ) and axial vorticity ω0 at three\nlocations along the channel: x = 5.25, 6.15 and 7.05; (a): in-plane velocity plots (the velocities are\nnormalized by their maximum in-plane values); (b): iso-values of the y-component v0 of the velocity,\nfrom equation (43); (c): iso-values of the z-component of the velocity w0 , from equation (47); (d):\niso-values of the x-component of the vorticity ω0 , from equation (51).\n\n32\n\n\fz\n\n1\n\n0.5\n\n0\n\n1.5\n\n1\n\ny\n0.5\n\n0\n\n6\n\n5\n\n4\n\n1\n\n7\n\n10\n\n9\n\n8\n\n11\n\n12\n\nx\n\n1\n\n(a)\n\n(b)\n0.8\n\n0.6\n\n0.6\nz\n\nz\n\n0.8\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\ny\n(b)\n\n33\n\n0\n4.5\n\n5\n\n5.5\n\n6\n\nx\n\n6.5\n\n7\n\n7.5\n\n8\n\n\fFIG. 5: Three-dimensional leading-order streamlines in the planar channel of varying dimensionless\ncross-section given by f (x) = 1 + 0.7 sin x. The channel is the same as the one illustrated in Figure\n4 and only the streamlines in the quadrant (y > 0, z > 0) are reported; those in the other quadrants\ncan be found using the flow symmetries (42). The dimensionless time step used for computation is\n0.025 and 35 initially evenly spaced streamlines are considered. Top: three-dimensional view of the\nstreamlines between the location of minimum width x = 3π/2 (squares, filled) and the location of\nmaximum width x = 5π/2 (diamonds); the channel boundary and centerplane are also displayed.\nBottom: (a) projection of the streamlines onto the (y, z) plane; (b) projection of the streamlines onto\nthe (x, z) plane.\n\n34\n\n\f1.6\n1.4\n\n0.5\n\n(a)\n\n1.2\n\n<u >\n0\n<v0>\n<w >\n\n(c)\n\nmax(u )\n0\nmax(v )\n0\nmax(w )\n\n0.4\n\n0\n\n0\n\n0.3\n\n1\n0.8\n\n0.2\n\n0.6\n0.1\n\n0.4\n0.2\n\n0\n\n0\n−0.2\n0\n\n1\n\n2\n\n3\n\n4\n\nx\n\n5\n\n6\n\n7\n\n−0.1\n0\n\n8\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nx\n\n2\n\n2\n\n10\n\n10\nmax(|u |)\n0\nmax(|v |)\n0\nmax(|w0|)\n\n(b)\n\n0\n\n|<u >|\n0\n|<v >|\n0\n|<w0>|\n\n(d)\n\n0\n\n10\n\n10\n\n−2\n\n−2\n\n10\n\n10\n\n−4\n\n−4\n\n10\n\n0\n\n10\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n0\n\n1\n\n2\n\nx\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nx\n\nFIG. 6: Illustration of the leading-order three-dimensional flow strength in the planar channel of\nvarying dimensionless cross-section f (x) = 1 + 0.7 sin x. The channel is the same as the one illustrated\nin Figure 4 and only the velocities in the quadrant (y > 0, z > 0) are considered. Figures (a) and (b):\nmaximum cross-sectional values of the three components of the leading-order dimensionless velocity\nalong the channel u0 (circles), v0 (squares, filled) and w0 (triangles); (a): regular scale, (b): semi-log\nscale; note that when v0 and w0 were found to be zero, which happens at each location along the\nchannel where f ′ (x) = 0 under the lubrication approximation, they were replaced by 10−5 for the\nsemi-log figures. Figures (c) and (d): same as in (a) and (b) for the quadrant-averaged velocities\n< u0 >, < v0 > and < w0 >; (c): regular scale, (d): semi-log scale.\n\n35\n\n\fy=h f1(x/λ)\n\nez\ney\n\nz=h\nex\n2h\ny=-h f2(x/λ)\nFIG. 7: General shape of a (asymmetric) planar channel.\n\n36\n\n\f"}