{"id": "http://arxiv.org/abs/cond-mat/0507539v3", "guidislink": true, "updated": "2005-09-19T19:13:28Z", "updated_parsed": [2005, 9, 19, 19, 13, 28, 0, 262, 0], "published": "2005-07-22T17:45:41Z", "published_parsed": [2005, 7, 22, 17, 45, 41, 4, 203, 0], "title": "Actively Tuned and Spatially Trapped Polaritons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0507691%2Ccond-mat%2F0507425%2Ccond-mat%2F0507456%2Ccond-mat%2F0507280%2Ccond-mat%2F0507062%2Ccond-mat%2F0507366%2Ccond-mat%2F0507720%2Ccond-mat%2F0507164%2Ccond-mat%2F0507454%2Ccond-mat%2F0507202%2Ccond-mat%2F0507706%2Ccond-mat%2F0507629%2Ccond-mat%2F0507499%2Ccond-mat%2F0507142%2Ccond-mat%2F0507339%2Ccond-mat%2F0507669%2Ccond-mat%2F0507566%2Ccond-mat%2F0507308%2Ccond-mat%2F0507653%2Ccond-mat%2F0507682%2Ccond-mat%2F0507057%2Ccond-mat%2F0507352%2Ccond-mat%2F0507187%2Ccond-mat%2F0507509%2Ccond-mat%2F0507216%2Ccond-mat%2F0507513%2Ccond-mat%2F0507419%2Ccond-mat%2F0507334%2Ccond-mat%2F0507137%2Ccond-mat%2F0507087%2Ccond-mat%2F0507136%2Ccond-mat%2F0507081%2Ccond-mat%2F0507151%2Ccond-mat%2F0507393%2Ccond-mat%2F0507091%2Ccond-mat%2F0507241%2Ccond-mat%2F0507096%2Ccond-mat%2F0507717%2Ccond-mat%2F0507271%2Ccond-mat%2F0507388%2Ccond-mat%2F0507305%2Ccond-mat%2F0507291%2Ccond-mat%2F0507427%2Ccond-mat%2F0507488%2Ccond-mat%2F0507636%2Ccond-mat%2F0507403%2Ccond-mat%2F0507310%2Ccond-mat%2F0507177%2Ccond-mat%2F0507486%2Ccond-mat%2F0507674%2Ccond-mat%2F0507176%2Ccond-mat%2F0507161%2Ccond-mat%2F0507248%2Ccond-mat%2F0507379%2Ccond-mat%2F0507539%2Ccond-mat%2F0507318%2Ccond-mat%2F0507508%2Ccond-mat%2F0507002%2Ccond-mat%2F0507468%2Ccond-mat%2F0507552%2Ccond-mat%2F0507707%2Ccond-mat%2F0507561%2Ccond-mat%2F0507543%2Ccond-mat%2F0008398%2Ccond-mat%2F0008275%2Ccond-mat%2F0008186%2Ccond-mat%2F0008448%2Ccond-mat%2F0008166%2Ccond-mat%2F0008173%2Ccond-mat%2F0008110%2Ccond-mat%2F0008322%2Ccond-mat%2F0008447%2Ccond-mat%2F0008101%2Ccond-mat%2F0008366%2Ccond-mat%2F0008042%2Ccond-mat%2F0008395%2Ccond-mat%2F0008467%2Ccond-mat%2F0008235%2Ccond-mat%2F0008269%2Ccond-mat%2F0008300%2Ccond-mat%2F0008134%2Ccond-mat%2F0008012%2Ccond-mat%2F0008352%2Ccond-mat%2F0008340%2Ccond-mat%2F0008405%2Ccond-mat%2F0008036%2Ccond-mat%2F0008396%2Ccond-mat%2F0008248%2Ccond-mat%2F0008109%2Ccond-mat%2F0008137%2Ccond-mat%2F0008251%2Ccond-mat%2F0008201%2Ccond-mat%2F0008005%2Ccond-mat%2F0008373%2Ccond-mat%2F0008198%2Ccond-mat%2F0008446%2Ccond-mat%2F0008150%2Ccond-mat%2F0008341%2Ccond-mat%2F0008181%2Ccond-mat%2F0008025%2Ccond-mat%2F0008384&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Actively Tuned and Spatially Trapped Polaritons"}, "summary": "We report active tuning of the polariton resonance of quantum well excitons\nin a semiconductor microcavity using applied stress. Starting with the quantum\nwell exciton energy higher than the cavity photon mode, we use stress to reduce\nthe exciton energy and bring it into resonance with the photon mode. At the\npoint of zero detuning, line narrowing and strong increase of the\nphotoluminescence are seen. By the same means, we create an in-plane harmonic\npotential for the polaritons, which allows trapping, potentially making\nBose-Einstein condensation of polaritons analogous to trapped atoms possible.\nWe demonstrate drift of the polaritons into this trap.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0507691%2Ccond-mat%2F0507425%2Ccond-mat%2F0507456%2Ccond-mat%2F0507280%2Ccond-mat%2F0507062%2Ccond-mat%2F0507366%2Ccond-mat%2F0507720%2Ccond-mat%2F0507164%2Ccond-mat%2F0507454%2Ccond-mat%2F0507202%2Ccond-mat%2F0507706%2Ccond-mat%2F0507629%2Ccond-mat%2F0507499%2Ccond-mat%2F0507142%2Ccond-mat%2F0507339%2Ccond-mat%2F0507669%2Ccond-mat%2F0507566%2Ccond-mat%2F0507308%2Ccond-mat%2F0507653%2Ccond-mat%2F0507682%2Ccond-mat%2F0507057%2Ccond-mat%2F0507352%2Ccond-mat%2F0507187%2Ccond-mat%2F0507509%2Ccond-mat%2F0507216%2Ccond-mat%2F0507513%2Ccond-mat%2F0507419%2Ccond-mat%2F0507334%2Ccond-mat%2F0507137%2Ccond-mat%2F0507087%2Ccond-mat%2F0507136%2Ccond-mat%2F0507081%2Ccond-mat%2F0507151%2Ccond-mat%2F0507393%2Ccond-mat%2F0507091%2Ccond-mat%2F0507241%2Ccond-mat%2F0507096%2Ccond-mat%2F0507717%2Ccond-mat%2F0507271%2Ccond-mat%2F0507388%2Ccond-mat%2F0507305%2Ccond-mat%2F0507291%2Ccond-mat%2F0507427%2Ccond-mat%2F0507488%2Ccond-mat%2F0507636%2Ccond-mat%2F0507403%2Ccond-mat%2F0507310%2Ccond-mat%2F0507177%2Ccond-mat%2F0507486%2Ccond-mat%2F0507674%2Ccond-mat%2F0507176%2Ccond-mat%2F0507161%2Ccond-mat%2F0507248%2Ccond-mat%2F0507379%2Ccond-mat%2F0507539%2Ccond-mat%2F0507318%2Ccond-mat%2F0507508%2Ccond-mat%2F0507002%2Ccond-mat%2F0507468%2Ccond-mat%2F0507552%2Ccond-mat%2F0507707%2Ccond-mat%2F0507561%2Ccond-mat%2F0507543%2Ccond-mat%2F0008398%2Ccond-mat%2F0008275%2Ccond-mat%2F0008186%2Ccond-mat%2F0008448%2Ccond-mat%2F0008166%2Ccond-mat%2F0008173%2Ccond-mat%2F0008110%2Ccond-mat%2F0008322%2Ccond-mat%2F0008447%2Ccond-mat%2F0008101%2Ccond-mat%2F0008366%2Ccond-mat%2F0008042%2Ccond-mat%2F0008395%2Ccond-mat%2F0008467%2Ccond-mat%2F0008235%2Ccond-mat%2F0008269%2Ccond-mat%2F0008300%2Ccond-mat%2F0008134%2Ccond-mat%2F0008012%2Ccond-mat%2F0008352%2Ccond-mat%2F0008340%2Ccond-mat%2F0008405%2Ccond-mat%2F0008036%2Ccond-mat%2F0008396%2Ccond-mat%2F0008248%2Ccond-mat%2F0008109%2Ccond-mat%2F0008137%2Ccond-mat%2F0008251%2Ccond-mat%2F0008201%2Ccond-mat%2F0008005%2Ccond-mat%2F0008373%2Ccond-mat%2F0008198%2Ccond-mat%2F0008446%2Ccond-mat%2F0008150%2Ccond-mat%2F0008341%2Ccond-mat%2F0008181%2Ccond-mat%2F0008025%2Ccond-mat%2F0008384&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report active tuning of the polariton resonance of quantum well excitons\nin a semiconductor microcavity using applied stress. Starting with the quantum\nwell exciton energy higher than the cavity photon mode, we use stress to reduce\nthe exciton energy and bring it into resonance with the photon mode. At the\npoint of zero detuning, line narrowing and strong increase of the\nphotoluminescence are seen. By the same means, we create an in-plane harmonic\npotential for the polaritons, which allows trapping, potentially making\nBose-Einstein condensation of polaritons analogous to trapped atoms possible.\nWe demonstrate drift of the polaritons into this trap."}, "authors": ["R. B. Balili", "D. W. Snoke", "L. Pfeiffer", "K. West"], "author_detail": {"name": "K. West"}, "author": "K. West", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.2164431", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0507539v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0507539v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0507539v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0507539v3", "journal_reference": null, "doi": "10.1063/1.2164431", "fulltext": "Actively Tuned and Spatially Trapped Polaritons\nR.B. Balili1 , D.W. Snoke1 , L. Pfeiffer2 , and K. West2\n\narXiv:cond-mat/0507539v3 [cond-mat.other] 19 Sep 2005\n\n1\n\nDepartment of Physics and Astronomy,\n\nUniversity of Pittsburgh, 3941 O'Hara St., Pittsburgh, PA 15260\n2\n\nBell Labs, Lucent Technologies, 700 Mountain Ave., Murray Hill, NJ 07974\n\nAbstract. We report active tuning of the polariton resonance of quantum well\nexcitons in a semiconductor microcavity using applied stress. Starting with the\nquantum well exciton energy higher than the cavity photon mode, we use stress to\nreduce the exciton energy and bring it into resonance with the photon mode. At the\npoint of zero detuning, line narrowing and strong increase of the photoluminescence\nare seen. By the same means, we create an in-plane harmonic potential for the\npolaritons, which allows trapping, potentially making Bose-Einstein condensation\nof polaritons analogous to trapped atoms possible. We demonstrate drift of the\npolaritons into this trap.\n\n\f2\nMicrocavity polaritons have in the past decade been the object of great interest for many\nscientists[1, 2, 3, 4, 5, 6, 7, 8, 9] interested in the study of Bose-Einstein condensation (BEC).\nThese particles, which are mixed states of photons and excitons, have a very light mass, which\nin principle allows them to condense at critical temperatures near room temperature. For\ntwo-dimensional bosonic systems to truly condense at finite temperatures, the application\nof potential traps or confinement in a region of finite size is essential.[10] Here we present\na method to actively couple the exciton mode to the cavity mode at fixed k|| = 0 and at\nthe same time create an in-plane spatial trap for both the lower and upper polaritons. The\npolariton photoluminescence (PL) jumps up dramatically at resonance, and both the PL\nand the reflectivity show line narrowing as the system approaches resonance.\nThe sample studied consists of three sets of four GaAs/AlAs quantum wells embedded in\na GaAs/AlGaAs microcavity, with each set of quantum wells at an antinode of the confined\nmode, similar to the structure used in previous work.[1] The cavity is designed in such a way\nthat it is initially negatively detuned, with δ ≈ −20 meV (δ = Ecav − Eex ). A force is applied\non back side of the 150 μm thick substrate with a rounded-tip pin, with approximately 50\nμm tip radius, as shown in Figure 1. This pushes the exciton energy down toward the cavity\nmode, at the same time creating a harmonic potential, following the method published\npreviously[11, 12] for excitons. The harmonic potential is centered in the plane of at the\npoint of pin-sample contact.\nFigure 2 shows the reflectivity spectrum as a function of position on the sample, showing\nthe anticrossing of the upper and lower polariton branches as the cavity length is varied,\ndue to the thinning of the layer thickness by about 10% toward the edge of the wafer,\nwhich is part of the growth process. The pin stress point is chosen several millimeters to\n\n\f3\n\nFIG. 1: Upper diagram: geometry of the experiment. Lower right: structure of the microcavity.\nLower left: effect of stress tuning.\n\nthe right of the crossover point, the point of strongest coupling. Figures 3 and 4 show\nphotoluminescence and reflectivity data for a sequence of increasing stresses applied to this\nsample. For the photoluminescence, a helium-neon laser source (633 nm) is used to excite\nthe sample off-resonantly, well above the band gap, at θ = 12◦ incidence, and defocused to a\nspot size of several millimeters to cover the entire region of observation. Photoluminescence\nemission collected normal to the sample is directed to a spectrometer and captured with\na Photometrics back-illuminated CCD camera. For the sample reflectivity, a collimated\n\n\f4\n\nFIG. 2: Reflectivity spectrum as a function of position on the sample, for zero stress. The polariton\nenergy shifts as the cavity length shifts, due to the thinning of the layers away from the center of\nthe wafer.\n\nlight beam (750 nm−1000 nm) is directed normal to the sample. The reflected light is also\ncollected normal to the sample. The mirror placed in the same plane as the sample is used\nto normalize the sample reflectance. For all the experiments, the sample was maintained at\nthe temperature of 4.2 K. At this low temperature, no luminescence is seen from the upper\npolariton. Upper polariton emission for this sample starts to appear at about 40 K.\nAs seen in these figures, a harmonic potential for both the upper and lower polaritons is\n\n\f5\ncreated. The polaritons are clearly in the strong coupling regime, since if they were not, only\nthe exciton states would respond to stress; the stress has negligible effect on the dielectric\nconstants of the materials and therefore negligible effect on the cavity mode in the weak\ncoupling limit. The energy gap between the upper and lower polariton branches decreases,\nwhile the overall energy shifts lower due to the band gap reduction.\nIn addition to the energy shift of the bands, a striking increase of the photoluminescence\noccurs, as seen in Figure 4. This is similar to the increase of photoluminescence at resonance seen by tuning of the resonance using a wedge of varying cavity thickness,[13] but the\nincrease in the present case is dramatic, a factor of about 100. The increase of the total\nphotoluminescence emitted from the front surface is consistent with an increase of the coupling constant at resonance. Consistent with the strong coupling, one can see in Figure 4 the\nnarrowing of the reflectivity spectra as the bare excitons and bare photon modes approach\nresonance[15] during stress tuning.\nSince there is an energy gradient for the polaritons, one expects that they will undergo\ndrift. Figure 5 shows spatially resolved photoluminescence when the laser is tightly focused\nand moved to one side of the potential minimum in the lower polariton branch. Drift is\nclearly observed over a distance of more than 100 μm, similar to the drift seen earlier[14] for\npolaritons in an energy gradient created by a wedge of the cavity thickness. The increase of\nthe PL intensity seen in Figure 4 may be partly related to this effect, since polaritons will\nconcentrate at the bottom of the well instead of diffusing away from the excitation spot.\nThis method of trapping opens a wide variety of possibilities and promise in the area of\nmicrocavity research and BEC of polaritons. Typically, only a tiny region of a wafer is in\nthe strong coupling regime, due to the wedge of the layer thicknesses in standard growth\n\n\f6\n\nFIG. 3: Left: Luminescence spectrum as a function of position on the sample, for various levels\nof force on the pin stressor, (a) unstressed, (b) 0.75 N, (c) 1.50 N, (d) 2.25 N, (e) 2.63 N, (f) 2.85\nN (white: minimum; black: maximum intensity). These images were created by illuminating the\nentire observed region (2.2 mm diameter) with a 5 mW HeNe laser. Right: The corresponding\nreflectivity (black: 0.0; white: 1.0). A harmonic potential is clearly seen in both upper and lower\n\n\f7\nprocesses. By using stress, one is no longer limited to this small region; the method allows\nthe freedom to use nearly any part of the wafer and tune the bands to the region of strong\ncoupling. Using electric field to tune the resonance[16] has the drawback that the oscillator\nstrength of the exciton changes strongly with electric field. Also, as discussed above, a\nharmonic potential minimum is essential for Bose-Einstein condensation of polaritons or any\nother particles in two dimensions. The point of high stress becomes a confining point for\ncarriers, which can be used in a polariton laser. In previous experiments,[1] the carriers were\nin free expansion with diffusion, with energy shifts which depended on the local density.[7]\nThe present experiments allow theory to treat a quasiequilibrium gas with a known confining\npotential.\nAcknowledgements. We wish to thank V. Hartwell, Z. Vörös, and A. Heberle for\nthe invaluable comments and discussions, and H. Deng, G. Weihs, and Y. Yamamoto for\ncontributions to the design of this sample. This material has been supported by the National\nScience Foundation under Grant No. 0404912 and by DARPA under Army Research Office\nContract No. W911NF-04-1-0075.\n\n[1] H. Deng, G. Weihs, D. Snoke, J. Bloch, and Y. Yamamoto, Proc. Nat. Acad. Sci. 100, 15318\n(2003).\n[2] S. Kundermann, M. Saba, C. Ciuti, T. Guillet, U. Oesterle, J.L. Staehli, and B. Deveaud,\nPhys. Rev. Lett. 91, 107402 (2003).\n[3] F.P. Laussy, G. Malpuech, A. Kavokin, and P. Bigenwald, Phys. Rev. Lett. 93, 016402 (2004).\n[4] A. Huynh, J. Tignon, O. Larsson, Ph. Roussignol, C. Delalande, R. Andre, R. Romestain, and\nL.S. Dang, Phys. Rev. Lett. 90, 106401 (2003).\n\n\f8\n[5] R.M. Stevenson, V.N. Astratov, M.S. Skolnick, D.M. Whittaker, M. Emam-Ismail, A.I. Tartakovskii, P.G. Savvidis, J.J. Baumberg, and J.S. Roberts, Phys. Rev. Lett. 85, 3680 (2000).\n[6] D. Poras, C. Ciuti, J.J. Baumberg, and C. Tejedor, Physical Review B 66, 085304 (2002).\n[7] J. Keeling, P.R. Eastham, M.H. Szymanska, and P.B. Littlewood, Phys. Rev. Lett. 93, 226403\n(2004).\n[8] G. Messin, J.Ph. Karr, A. Baas, G. Khitrova, R. Houdre, R.P. Stanley, U. Oesterle, and E.\nGiacobino, Phys. Rev. Lett. 87, 127403 (2001).\n[9] For a review of condensation of excitons and polaritons, see D. Snoke, Science 298, 1368\n(2002).\n[10] E.g., W.J. Mullin, J. Low. Temp. Phys. 106, 615 (1997).\n[11] V. Negoita, D. W. Snoke, and K. Eberl, Applied Phys. Lett. 75, 2059 (1999).\n[12] D.W. Snoke, Y. Liu, Z. Vörös, L. Pfeiffer, and K. West, Solid State Comm. 134, 37 (2005).\n[13] R.P. Stanley R. Houdre, C. Weisbuch, U. Oesterle, and M. Ilegrams, Phys. Rev. B 53, 10995\n(1996).\n[14] B. Sermage, G. Malpuech, A.V. Kavokin, V. Thierry-Mieg, Physical Review B 64, R081303\n(2001).\n[15] C. Weisbuch, M. Nishioka, A. Ishikawa, and Y. Arakawa, Phys. Rev. Lett. 69, 3314 (1992).\n[16] J. H. Dickerson, J. K. Son, E. E. Mendez, and A. A. Allerman, Appl. Phys. Lett. 81, 803\n(2002).\n\n\f9\n\nFIG. 4: Top: Reflectivity at the bottom of the stress well, for a series of applied forces. Bottom:\nPhotoluminescence emission of the lower polariton, taken with the HeNe excitation source (900\nμW) focused (75 μm) at the bottom of the stress well.\n\n\f10\n\nFIG. 5: Spatially resolved photoluminescence for 2.85 N applied force (white: minimum, black:\nmaximum intensity) with the laser focused (75 μm) and shifted away from the bottom of the\nstress well. The photoluminescence is superposed on the reflectivity spectrum (gray) for the same\nconditions, to show the location of the well.\n\n\f"}