{"id": "http://arxiv.org/abs/cond-mat/0201045v1", "guidislink": true, "updated": "2002-01-04T14:20:17Z", "updated_parsed": [2002, 1, 4, 14, 20, 17, 4, 4, 0], "published": "2002-01-04T14:20:17Z", "published_parsed": [2002, 1, 4, 14, 20, 17, 4, 4, 0], "title": "Size Effect in Fracture: Roughening of Crack Surfaces and Asymptotic\n  Analysis", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0201356%2Ccond-mat%2F0201255%2Ccond-mat%2F0201584%2Ccond-mat%2F0201379%2Ccond-mat%2F0201455%2Ccond-mat%2F0201227%2Ccond-mat%2F0201322%2Ccond-mat%2F0201166%2Ccond-mat%2F0201211%2Ccond-mat%2F0201042%2Ccond-mat%2F0201108%2Ccond-mat%2F0201301%2Ccond-mat%2F0201097%2Ccond-mat%2F0201294%2Ccond-mat%2F0201248%2Ccond-mat%2F0201500%2Ccond-mat%2F0201194%2Ccond-mat%2F0201320%2Ccond-mat%2F0201198%2Ccond-mat%2F0201473%2Ccond-mat%2F0201125%2Ccond-mat%2F0201547%2Ccond-mat%2F0201564%2Ccond-mat%2F0201503%2Ccond-mat%2F0201188%2Ccond-mat%2F0201232%2Ccond-mat%2F0201160%2Ccond-mat%2F0201181%2Ccond-mat%2F0201419%2Ccond-mat%2F0201100%2Ccond-mat%2F0201163%2Ccond-mat%2F0201233%2Ccond-mat%2F0201260%2Ccond-mat%2F0201107%2Ccond-mat%2F0201339%2Ccond-mat%2F0201045%2Ccond-mat%2F0201196%2Ccond-mat%2F0201056%2Ccond-mat%2F0201474%2Ccond-mat%2F0201154%2Ccond-mat%2F0201403%2Ccond-mat%2F0201075%2Ccond-mat%2F0201400%2Ccond-mat%2F0201559%2Ccond-mat%2F0201047%2Ccond-mat%2F0201115%2Ccond-mat%2F0201436%2Ccond-mat%2F0201250%2Ccond-mat%2F0201286%2Ccond-mat%2F0201308%2Ccond-mat%2F0201417%2Ccond-mat%2F0201502%2Ccond-mat%2F0201359%2Ccond-mat%2F0201180%2Ccond-mat%2F0201365%2Ccond-mat%2F0201091%2Ccond-mat%2F0201543%2Ccond-mat%2F0201164%2Ccond-mat%2F0201369%2Ccond-mat%2F0201022%2Ccond-mat%2F0201441%2Ccond-mat%2F0201001%2Ccond-mat%2F0201130%2Ccond-mat%2F0201063%2Ccond-mat%2F0201378%2Ccond-mat%2F0201437%2Ccond-mat%2F0201495%2Ccond-mat%2F0201266%2Ccond-mat%2F0201084%2Ccond-mat%2F0201218%2Ccond-mat%2F0201019%2Ccond-mat%2F0201221%2Ccond-mat%2F0201458%2Ccond-mat%2F0201021%2Ccond-mat%2F0201141%2Ccond-mat%2F0201311%2Ccond-mat%2F0201504%2Ccond-mat%2F0201197%2Ccond-mat%2F0201586%2Ccond-mat%2F0201405%2Ccond-mat%2F0201480%2Ccond-mat%2F0201536%2Ccond-mat%2F0201516%2Ccond-mat%2F0201288%2Ccond-mat%2F0201529%2Ccond-mat%2F0201423%2Ccond-mat%2F0201072%2Ccond-mat%2F0201367%2Ccond-mat%2F0201425%2Ccond-mat%2F0201143%2Ccond-mat%2F0201454%2Ccond-mat%2F0201486%2Ccond-mat%2F0201171%2Ccond-mat%2F0201397%2Ccond-mat%2F0201535%2Ccond-mat%2F0201549%2Ccond-mat%2F0201526%2Ccond-mat%2F0201032%2Ccond-mat%2F0201070%2Ccond-mat%2F0201104%2Ccond-mat%2F0201406&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Size Effect in Fracture: Roughening of Crack Surfaces and Asymptotic\n  Analysis"}, "summary": "Recently the scaling laws describing the roughness development of fracture\nsurfaces was proposed to be related to the macroscopic elastic energy released\nduring crack propagation [Mor00]. On this basis, an energy-based asymptotic\nanalysis allows to extend the link to the nominal strength of structures. We\nshow that a Family-Vicsek scaling leads to the classical size effect of linear\nelastic fracture mechanics. On the contrary, in the case of an anomalous\nscaling, there is a smooth transition from the case of no size effect, for\nsmall structure sizes, to a power law size effect which appears weaker than the\nlinear elastic fracture mechanics one, in the case of large sizes. This\nprediction is confirmed by fracture experiments on wood.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0201356%2Ccond-mat%2F0201255%2Ccond-mat%2F0201584%2Ccond-mat%2F0201379%2Ccond-mat%2F0201455%2Ccond-mat%2F0201227%2Ccond-mat%2F0201322%2Ccond-mat%2F0201166%2Ccond-mat%2F0201211%2Ccond-mat%2F0201042%2Ccond-mat%2F0201108%2Ccond-mat%2F0201301%2Ccond-mat%2F0201097%2Ccond-mat%2F0201294%2Ccond-mat%2F0201248%2Ccond-mat%2F0201500%2Ccond-mat%2F0201194%2Ccond-mat%2F0201320%2Ccond-mat%2F0201198%2Ccond-mat%2F0201473%2Ccond-mat%2F0201125%2Ccond-mat%2F0201547%2Ccond-mat%2F0201564%2Ccond-mat%2F0201503%2Ccond-mat%2F0201188%2Ccond-mat%2F0201232%2Ccond-mat%2F0201160%2Ccond-mat%2F0201181%2Ccond-mat%2F0201419%2Ccond-mat%2F0201100%2Ccond-mat%2F0201163%2Ccond-mat%2F0201233%2Ccond-mat%2F0201260%2Ccond-mat%2F0201107%2Ccond-mat%2F0201339%2Ccond-mat%2F0201045%2Ccond-mat%2F0201196%2Ccond-mat%2F0201056%2Ccond-mat%2F0201474%2Ccond-mat%2F0201154%2Ccond-mat%2F0201403%2Ccond-mat%2F0201075%2Ccond-mat%2F0201400%2Ccond-mat%2F0201559%2Ccond-mat%2F0201047%2Ccond-mat%2F0201115%2Ccond-mat%2F0201436%2Ccond-mat%2F0201250%2Ccond-mat%2F0201286%2Ccond-mat%2F0201308%2Ccond-mat%2F0201417%2Ccond-mat%2F0201502%2Ccond-mat%2F0201359%2Ccond-mat%2F0201180%2Ccond-mat%2F0201365%2Ccond-mat%2F0201091%2Ccond-mat%2F0201543%2Ccond-mat%2F0201164%2Ccond-mat%2F0201369%2Ccond-mat%2F0201022%2Ccond-mat%2F0201441%2Ccond-mat%2F0201001%2Ccond-mat%2F0201130%2Ccond-mat%2F0201063%2Ccond-mat%2F0201378%2Ccond-mat%2F0201437%2Ccond-mat%2F0201495%2Ccond-mat%2F0201266%2Ccond-mat%2F0201084%2Ccond-mat%2F0201218%2Ccond-mat%2F0201019%2Ccond-mat%2F0201221%2Ccond-mat%2F0201458%2Ccond-mat%2F0201021%2Ccond-mat%2F0201141%2Ccond-mat%2F0201311%2Ccond-mat%2F0201504%2Ccond-mat%2F0201197%2Ccond-mat%2F0201586%2Ccond-mat%2F0201405%2Ccond-mat%2F0201480%2Ccond-mat%2F0201536%2Ccond-mat%2F0201516%2Ccond-mat%2F0201288%2Ccond-mat%2F0201529%2Ccond-mat%2F0201423%2Ccond-mat%2F0201072%2Ccond-mat%2F0201367%2Ccond-mat%2F0201425%2Ccond-mat%2F0201143%2Ccond-mat%2F0201454%2Ccond-mat%2F0201486%2Ccond-mat%2F0201171%2Ccond-mat%2F0201397%2Ccond-mat%2F0201535%2Ccond-mat%2F0201549%2Ccond-mat%2F0201526%2Ccond-mat%2F0201032%2Ccond-mat%2F0201070%2Ccond-mat%2F0201104%2Ccond-mat%2F0201406&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recently the scaling laws describing the roughness development of fracture\nsurfaces was proposed to be related to the macroscopic elastic energy released\nduring crack propagation [Mor00]. On this basis, an energy-based asymptotic\nanalysis allows to extend the link to the nominal strength of structures. We\nshow that a Family-Vicsek scaling leads to the classical size effect of linear\nelastic fracture mechanics. On the contrary, in the case of an anomalous\nscaling, there is a smooth transition from the case of no size effect, for\nsmall structure sizes, to a power law size effect which appears weaker than the\nlinear elastic fracture mechanics one, in the case of large sizes. This\nprediction is confirmed by fracture experiments on wood."}, "authors": ["S. Morel", "E. Bouchaud", "G. Valentin"], "author_detail": {"name": "G. Valentin"}, "author": "G. Valentin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.65.104101", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0201045v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0201045v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 6 figures, accepted for publication in Physical Review B", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0201045v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0201045v1", "journal_reference": null, "doi": "10.1103/PhysRevB.65.104101", "fulltext": "Size effect in fracture: roughening of crack surfaces and asymptotic analysis\nStéphane Morel,1 Elisabeth Bouchaud,2 and Gérard Valentin 1\n\narXiv:cond-mat/0201045v1 [cond-mat.mtrl-sci] 4 Jan 2002\n\n1\n\nLab. de Rhéologie du Bois de Bordeaux, UMR 5103, Domaine de l'Hermitage, B.P.10, 33610 Cestas Gazinet, France\n2\nC.E.A.- Saclay (DSM/DRECAM/SPCSI), 91130 Gif-Sur-Yvette Cedex, France\nRecently the scaling laws describing the roughness development of fracture surfaces was proposed\nto be related to the macroscopic elastic energy released during crack propagation13 . On this basis,\nan energy-based asymptotic analysis allows to extend the link to the nominal strength of structures.\nWe show that a Family-Vicsek scaling leads to the classical size effect of linear elastic fracture\nmechanics. On the contrary, in the case of an anomalous scaling, there is a smooth transition from\nthe case of no size effect, for small structure sizes, to a power law size effect which appears weaker\nthan the linear elastic fracture mechanics one, in the case of large sizes. This prediction is confirmed\nby fracture experiments on wood.\n\nI. INTRODUCTION\n\nIn solid mechanics, an essential scaling problem is the effect of the structure size on its nominal strength. This\neffect is particularly important in the case of quasibrittle materials which are characterized by the existence of a\nlarge fracture process zone containing many damage microcracks. Materials as different as concretes, mortar and\nrocks, some composites, toughened ceramics and wood belong to this category. Bažant1,2 has shown that in this case,\ncontrary to what happens for Weibull's statistics3 , the size effect is linked to the very existence of the development of\nsuch a large microcracked zone, which implies stress redistributions and stored energy release.\nOn the other hand, in quasibrittle materials, damage has a strong influence on the local deviations of the main\ncrack through its elastic interactions with the microcracks4–6 . Consequently, the roughness of the fracture surfaces\ncan be considered as an inheritance of the damage process and it is naturally tempting to correlate their morphology\n(and especially their fractal properties) to macroscopic mechanical properties such as fracture energy or fracture\ntoughness7–13 .\nIn this paper, on the basis of a link recently established13 between the roughening of crack surfaces and the\nmacroscopic energy released during crack propagation (this work is summarized in Section II), we propose an energybased asymptotic analysis in Section III which allows to extend this link to the nominal strength of large (Sec. III A)\nand small (Sec. III B) structures. An approximate size effect valid everywhere is proposed in Sec. III C. This\nprediction is shown to be in agreement with experimental results obtained on wood Sec. IV. Finally, we discuss\nmaterial-dependent properties in Sec. V.\nII. SCALING LAWS OF CRACK SURFACES AND ENERGY RELEASE RATE\n\nThe statistical characterization of the fractal morphology of fracture surfaces is nowadays a very active field of\nresearch. It is now well established that these surfaces, for very different types of materials (from ductile aluminium\nalloys14,15 to brittle materials like rock17,16,18 or wood19,20 ), exhibit self-affine scaling properties in a large range of\nlengthscales (see21 for a more detailed account of experiments). Moreover, in addition to this self-affine character,\nrecent studies focussed on the complete description (3D) of the morphology of crack surfaces18,20 have shown that\nthe scaling laws governing the crack developments in longitudinal and transverse directions are different and material\ndependent20 .\nLet us consider the development of a fracture surface from a straight notch of length L with zero roughness.\nThe mean plane of the crack surface is defined as (x, y) where the x axis is perpendicular to the direction of crack\npropagation and the y axis is parallel to this direction. For two quasibrittle materials (granite18 and wood20 ), it has\nbeen found that the fluctuations ∆h of the height on the fracture surfaces, estimated over a window of size l along\nthe x axis and at a distance y from the initial notch exhibited anomalous scaling properties which are quite similar\nto those obtained in some models of nonequilibrium kinetic roughening22,23 :\n\u001a ζ\nl loc ξ(y)ζ−ζloc if l ≪ ξ(y)\n∆h(l, y) ≃ A\n(1)\nξ(y)ζ\nif l ≫ ξ(y)\nwhere ξ(y) = By 1/z depends on the distance y to the initial notch and characterizes a crossover length along the x\naxis. For length scales smaller than ξ(y), the surface is self-affine, and characterized by the local roughness exponent\n1\n\n\fζloc . This self-affine character is observed in most experiments and a local roughness exponent ζloc ≃ 0.8 is reported in\nall cases. Hence, it has been suggested that this local roughness exponent might be a universal index, i.e. independent\nof the fracture mode and of the material15 .\nAccording to Eq. (1), the magnitude of the roughness increases as a function of the distance y until the self-affine\ncorrelation length ξ(y) reaches the system size L. This happens at a certain distance ysat = (L/B)z from the notch:\nξ(y ≫ ysat ) = L. Thus, the first growth regime of the roughness (i.e. for y ≪ ysat ) is followed by a stationary regime\n(for y ≫ ysat ) where the magnitude of the roughness remains constant and where the global roughness (i.e. measured\nover the system size L) is driven by the global roughness exponent ζ: ∆h(L, y ≫ ysat ) ∼ Lζ . The main consequence of\nan anomalous scaling [Eq. (1)] is that, in this stationary regime, the magnitude of the local roughness (i.e. measured on\nwindows l ≪ L) is not only a function of the window size l but also of the system size L: ∆h(l, y ≫ ysat ) ∼ lζloc Lζ−ζloc .\nExperimental results obtained on quasibrittle materials have shown the following values for the global roughness\nexponent: ζ = 1.2 for granite18 and 1.35 and 1.60 for wood (pine and spruce respectively)20 . Note that the exponent\nz (called the \"dynamic exponent\") and the prefactors A and B seem also to be material-dependent20 .\nThe Family-Vicsek scaling law24 , where the height fluctuations ∆h scale as:\n\u001a ζ\nl loc\nif l ≪ ξ(y)\n∆h(l, y) ≃ A\n(2)\nξ(y)ζloc if l ≫ ξ(y)\ncan be seen as a particular case of the anomalous scaling [Eq. (1)] where ζ = ζloc . In this case [Eq. (2)], the magnitudes\nof the local and global roughnesses at saturation, respectively ∆h(l, y ≫ ysat ) ∼ lζloc and ∆h(L, y ≫ ysat ) ∼ Lζloc ,\nare driven by the same roughness exponent (the local roughness exponent ζloc ). Furthermore, the local roughness\nis independent of the system size. This is drastically different from what happens in the case of an anomalous\nscaling. It is worth noticing that both the Family-Vicsek and the anomalous scaling laws were used to describe\nthe roughness development of the same granite fracture surface17,18 , and that more accurate results were obtained\nassuming anomalous scaling18 .\nThe anomalous and Family-Vicsek scalings were recently shown to be linked to drastically different mechanical\nbehaviors in terms of elastic energy release13 . Within the framework of an equivalent linear elastic problem, a\nfracture criterion, linking the elastic energy release rate G at the macroscale and the fractal nature of the crack at the\nmicroscale, was proposed: G = 2γ ψ(y)/L. In this fracture criterion, γ is the so-called specific surface energy and the\nratio ψ(y)/L can be considered as a \"roughness factor\". As a matter of fact, it is precisely the ratio of the length of a\nvirtual crack front over its projected length L (the system size, i.e. the specimen width). This virtual front, parallel\nto the initial notch, is assumed to be rough only out of the average fracture plane (x, y), and this roughness can be\ndefined from the functions ∆h(l, y) at a fixed position y from the initial notch.\nAccording to an anomalous scaling [Eq. (1)], the estimate of the real length ψ of the virtual front (which corresponds\nto the length of a self-affine curve13 ) leads to the following expressions of the energy release rate:\nr\n\u0010 ζ−ζ \u00112\n\nloc\n\n 1 + AB1−ζloc\n∆a2(ζ−ζloc )/z if ∆a ≪ ∆asat\nlo\nr\nGR (∆a) ≃ 2γ\n(3)\n\u00112\n\u0010\n\n\nA\n2(ζ−ζloc )\n 1+\nL\nif\n∆a\n≫\n∆a\nsat\nl 1−ζloc\no\n\nwhere the crack length increments ∆a and ∆asat defined from the initial notch correspond respectively to the crack\npositions y and ysat defined in Eq. (1). In the zone where the roughness grows, i.e. for ∆a ≪ ∆asat , the fracture\nequilibrium leads to an energy release rate function of the crack length increment ∆a [Eq. (3)]. The subscript R in\nGR emphasizes the fact that the resistance to fracture growth is similar to the behavior described by a resistance\ncurve (usually called R-curve6). Note that the square root terms in Eq. (3) are dimensionless and correspond to the\nroughness factor ψ(y)/L. The term lo is the lower cutoff of the fractal range of the virtual front (i.e. the characteristic\nsize of the smaller microstructural element relevant for the fracture process). When the crack increment is large,\ni.e. for ∆a ≫ ∆asat [Eq. (3)] which corresponds to the saturation state of the roughness, the resistance to fracture\ngrowth becomes independent of the crack length increment because the self-affine correlation length has reached the\nsystem size: ξ(∆a ≫ ∆asat ) ≃ L. Introducing the crossover length LC = (lo 1−ζloc /A)1/(ζ−ζloc ) , the resistance to crack\ngrowth for large crack length increments becomes:\ns\n\u00132(ζ−ζloc )\n\u0012\nL\nGR (∆a ≫ ∆asat ) ≃ GRC ≃ 2γ 1 +\n(4)\nLC\nwhere the subscript C in GRC emphasizes that the resistance to crack growth has reached an asymptotic or critical\nvalue. The main consequence of the link between fracture mechanics and anomalous roughening of fracture surfaces13\n2\n\n\fis the size effect on the critical resistance to crack growth [Eq. (4)]. This size effect is the result of the dependence of\nthe maximum magnitude of the roughness at saturation on the structure size L. As shown in Fig. 1, the size effect\naffecting the critical resistance GRC exhibits two asymptotic behaviors separated by the crossover length LC . For\nsmall structure sizes (i.e. L ≪ LC ) where the roughness of the fracture surface is weak, there is no size effect, and\nGRC ≃ 2γ. For large structure sizes (i.e. L ≫ LC ), corresponding to an important fracture roughness, the critical\nresistance evolves as a power law : GRC ∼ Lζ−ζloc .\nIn the case of the Family-Vicsek scaling [Eq. (2)], on the contrary, the link between roughnening of fracture surfaces\nand material fracture properties13 reduces to a resistance to crack growth independent of the crack increment ∆a and\nof the specimen size L:\ns\n\u00132\n\u0012\nA\n(5)\nGC (∆a) ≃ 2 γ 1 +\nlo 1−ζloc\nThus, an anomalous scaling accounts for an R-curve behavior and a size effect on the critical resistance to crack\ngrowth while a Family-Vicsek scaling reflects a purely elastic brittle fracture behavior.\nIII. SIZE EFFECT ON THE NOMINAL STRENGTH\n\nWe now extend the connection just summarized13 to the nominal strength of structures.\nWithin the framework of Bažant's theory25 , the size effect (for two-dimensional problem) can be described from\ngeometrically similar structures of different sizes (with geometrically similar initial cracks or notches) by introducing\na nominal stress:\nσN =\n\nP\ndL\n\n(6)\n\nwhere P is the external load applied to the structure (considered to be a load independent of the displacement), L is\nthe characteristic size of the structure, and d is any length of the structure (for instance, as shown in Fig. 2 in the\ncase of TDCB specimens, d corresponds to the ligament length). When P = Pu which corresponds to the ultimate or\nmaximum load, σN is called the nominal strength of the structure.\nOn the other hand, at the maximum load Pu , the elastic energy release rate G (obtained at a constant load Pu\nor σN ) must be equal, according to the linear elastic fracture mechanics (LEFM), to the critical resistance to crack\ngrowth GRC :\n\u0014\n\u0015\n1 ∂W ∗\n= GRC\n(7)\nG=\nL ∂a σN\nwhere the complementary energy W ∗ characterizes the energy stored in the structure. This energy W ∗ can be written\nin the following form: W ∗ = σN 2 L d 2 f (α)/E where f is a dimensionless function characterizing the geometry of the\nstructure and α = a/d is the relative crack length. Thus, when the maximum load is reached, the nominal strength\nof the structure can also be written as:\ns\nE GRC\nσN =\n(8)\nd g(α)\nwhere g(α) = ∂f (α)/∂α corresponds to the dimensionless energy release rate function.\nUsually, the main problem with Eq. (8) is to determine the relative crack length α = a/d for which the maximum\nload Pu is reached. Let us consider exclusively a structure of \"positive geometry\", i.e. ∂g(α)/∂α > 0 under load\ncontrol.\nIf the material exhibits a purely elastic brittle behavior such as the one obtained for a Family-Vicsek scaling [Eq.\n(5)], the relative crack length increment α at the maximum load corresponds to αo = ao /d (ao being the length of the\nnotch or initial crack). Thus, in the case of a Family-Vicsek scaling, replacing the resistance to crack growth GC by\nits expression in [Eq. 5] and α by αo in Eq. (8), we obtain the following size effect relation:\nv\n\"\nu\n\u0012\n\u00132 #1/2\nu 2γE\nA\nt\nσN =\n1+\nL−1/2\n(9)\nmg(αo )\nlo 1−ζloc\n3\n\n\fwhere m is a proportionality coefficient between d and L (d = mL). In Eq.(9), the term under the square root is a\nconstant, which means that the nominal strength of structures evolves as σN ∼ L−1/2 . This is in agreement with the\nexpected LEFM size effect, i.e. the size effect of a purely elastic brittle fracture behavior.\nIn the case of an anomalous scaling, the problem appears more complicated. Indeed, under the conditions evoked\nin the previous case (i.e., structures of positive geometry and under load control), if the material exhibits an R-curve\nbehavior [Eq. (3)], the crack length increment ∆asat (limit of the R-curve) is actually the limit of stability. Thus,\nthe relative crack length at the maximum load can be defined as α = αo + θ where θ = ∆asat /d. Hence, in the case\nof an anomalous scaling, which reflects the fracture behavior of quasibrittle materials, the knowledge of the evolution\nof the crack length increment ∆asat as a function of the structure size is the key of the size effect problem. However,\nthe dependence between ∆asat and the specimen size does not appear clearly from the roughness analysis18,20 .\nIn order to resolve this problem - which is the central point of this paper -, a possible way suggested by Bažant25\nconsists in considering that the failure of a quasibrittle material is not only characterized by the specific surface\nenergy 2γ (related to the actual crack surface), but also by a critical damage energy release rate Gd per unit volume\nof damaged material (i.e. per unit volume of fracture process zone). Thus, one can assume that failure at the maximum\nload is obtained for the energy balance:\nGd VF P Z = 2γ Ar (∆asat )\n\n(10)\n\nwhere the volume of the fracture process zone can be estimated as VF P Z = L ∆asat 2 /n with L∆asat the projected\ncrack surface and ∆asat /n the height of the process zone (where n is assumed constant, i.e. independent of the\nsize L). The surface Ar (∆asat ) corresponds to the real fracture surface produced during the crack advance ∆asat .\nNote that the fracture criterion [Eq. (10)] actually corresponds to an equivalent linear elastic problem25,26 where the\neffective size of the fracture process zone at the maximum load is assumed equal to the crack length increment for\nwhich the resistance to crack growth does not follow the R-curve [Eq. (3)] but remains constant and equal to the\ncritical resistance: GR (∆asat ) = GRC [Eq. (4)].\nIn the following, on the basis of the fracture criterion defined in Eq. (10), the asymptotic values of ∆asat are\nestimated for large and small structures in order to obtain the nominal strength respectively for large and small-size\nasymptotic expansions.\nA. Large-size asymptotic expansion of the size effect\n\nAs previously mentioned, the square root terms in Eq. (3) and Eq. (4) correspond to the ratio of the virtual\ncrack front length ψ(∆a) over its projected length L. Moreover, from Eq. (4), relative to the roughness saturation\np regime, one can obtain the maximum length of the virtual crack front since ψ(∆a ≫ ∆asat ) ≃ ψmax ≃\nL 1 + (L/LC )2(ζ−ζloc ) 13 . Thus, for large structure sizes, i.e. L ≫ LC , the asymptotic value of the real crack surface\nAr produced for a crack advance ∆asat can be estimated from ψmax as: Ar ≃ β L ∆asat (L/LC )ζ−ζloc where β is a\nconstant (function of the scaling exponents). Substituting Ar in Eq. (10) yields the expression of the crack length\nincrement:\n\u0012\n\u0013ζ−ζloc\nL\n∗\n∆asat = c β\n(11)\nLC\nwhere c∗ = n2γ/Gd is a material-dependent length scale. Thus, for large structure sizes, the relative size of the\nfracture process zone (i.e. θ = ∆asat /d) is expected to evolve as a power law θ ∼ Lζ−ζloc −1 . Moreover, from the\nvalues of the scaling exponents obtained in the roughness analysis of quasibrittle materials18,20 , it appears that the\nrelative size of the process zone becomes negligible when the system size increases: lim θ = 0 for L → +∞. In other\nterms, in large structures, the process zone is expected to lie within only an infinitesimal volume fraction of the body\nand so lim α = αo for L → +∞. Note that this result is in agreement with Bažant's assumption25 . Hence, the\ndimensionless energy release rate function g(α) being generally a smooth function, we may expand it into a Taylor\nseries around α = αo and Eq.(8) thus yields :\nr\n\u0014\n\u0015−1/2\nθ2\nθ3\nE GRC\ng(αo ) + g1 (αo ) θ + g2 (αo )\n+ g3 (αo )\n+ ...\nσN =\n(12)\nd\n2!\n3!\nv\n\u00131/2\n\u0012\nu\n\u0001\nu\nL 2(ζ−ζloc )\nu\n1\n+\nLC\nu\n(13)\n= σM t\n\u0001\n\u0001\n\u00012 L \u00013(ζ−ζloc )\n2(ζ−ζloc )\nL ζ−ζloc\nL\n+ b3 LL1\n+ ...\n+ b2 LL1 LLC\nL1 + LC\nLC\n4\n\n\fwhere g1 (αo ) = ∂g(αo )/∂α, g2 (αo ) =\n3\ng(αo )2 g3 (αo )/(6g1 (αo ) ), ..., and,\ns\nσM =\n\n∂ 2 g(αo )/∂α2 , ...,\n\n2γE\n,\nmg(αo )L1\n\nL 1 = c∗\n\nand b2\n\n=\n\ng(αo )g2 (αo )/(2g1 (αo )2 ),\n\nβ g1 (αo )\nm g(αo )\n\nb3\n\n=\n\n(14)\n\nare all constants. Equation (13) provides a large-size asymptotic series expansion of the size effect because the terms\ncontaining non zero powers of L in denominator vanish for L → ∞. Note that Eq. (13) is expected to diverge for\nstructure sizes L → 0 as shown in Fig. 3. A first-order asymptotic approximation at large sizes can be obtained by\ntruncating the series after the linear term:\nv\n\u00131/2\nu\u0012\n\u0001\nu\nu 1 + L 2(ζ−ζloc )\nLC\nu\n(15)\nσN = σM t\n\u0001\nL\nL ζ−ζloc\nL1 + LC\n\nThe main consequence of the anomalous roughening in the case of large structure sizes is that the nominal strength is\nexpected to decrease as σN ∼ L−1/2+(ζ−ζloc )/2 (as shown in Fig. 3). This result disagrees with the size effect proposed\nby Bažant25 where the nominal strength of large structures decreases as σN ∼ L−1/2 which is the theoretical size\neffect of LEFM. The difference originates in the fact that, for an anomalous roughening, the critical resistance to\ncrack growth GRC [Eq. (4)] is expected to evolve as a power law GRC ∼ Lζ−ζloc for large structure sizes while in\nLEFM, the critical resistance GRC is assumed to be constant (i.e. independant of the specimen size). Hence, the size\neffect on the nominal strength obtained for an anomalous roughening is weaker than the size effect in LEFM.\nB. Small-size asymptotic expansion of the size effect\n\nIn Bažant's theory25 , no size effect is expected for small structure sizes (L → 0); this is the domain of the strength\ntheory. A possible justification is that, in small structures, the fracture process zone fills the whole volume of the\nstructure and hence, there is no stress concentration and, as a consequence, failure occurs with no crack propagation.\nSuch an argument can be also obtained from the link between anomalous roughening of crack surfaces and material\nfracture properties. Indeed, in small structure sizes (i.e. L ≪ LC ), the roughness being negligible, the virtual\ncrack front length tends to its projected length L. This implies that, for small structures, the actual crack surfaces\nproduced during a crack advance ∆asat are not so different from the projected one: Ar ≃ L∆asat . Hence, substituting\nAr ≃ L∆asat into the fracture criterion [Eq. (10)] yields the crack length increment: ∆asat = n2γ/Gd = c∗ for\nL ≪ LC . In other terms, the effective size of the process zone tends to the material length for small structure sizes.\nThus, when the material length c∗ = d − ao (Fig. 2), the fracture process zone occupies the entire ligament of the\nstructure.\nOn the basis of Bažant's theory25 and in order to obtain a small-size asymptotic expansion of the size effect, let us\nnow introduce a new variable and a new function:\nη=\n\n1\nd\n,\n=\nθ\n∆asat\n\nφ(αo , η) =\n\ng(αo + θ)\n= η g(αo + 1/η)\nθ\n\n(16)\n\nThe function φ(αo , η) corresponds to the dimensionless energy release rate function of the inverse relative size of the\nprocess zone. Substituting Eq. (16) into Eq. (8) and expanding φ(αo , η) into Taylor series around the point (αo , 0)\nsince lim η = 0 when d or L → 0, yields the nominal strength:\nr\n\u0014\n\u0015−1/2\nE GRC\nη2\nη3\nσN =\nφ(αo , 0) + φ1 (αo , 0) η + φ2 (αo , 0)\n+ φ3 (αo , 0)\n+ ...\n(17)\nc∗\n2!\n3!\nv\n\u0012\n\u00131/2\nu\n\u0001\nu\nL 2(ζ−ζloc )\nu\n1\n+\nLC\nu\n(18)\n= σM ′ t\n\u00012\n\u00013\n+ c3 LL2\n+ ...\n1 + LL2 + c2 LL2\n\nwhere φ1 (αo , 0) = ∂φ(αo , 0)/∂η, φ2 (αo , 0) = ∂ 2 φ(αo , 0)/∂η2 , ..., and c2 = φ2 (αo , 0)φ(αo , 0)2 /(2φ1 (αo , 0)2 ), c3 =\n3\nφ3 (αo , 0)φ(αo , 0)3 /(6φ1 (αo , 0) ), ..., and,\n5\n\n\fσM ′ =\n\ns\n\n2γE\n,\nφ(αo , 0)c∗\n\nL 2 = c∗\n\nφ(αo , 0)\nm φ1 (αo , 0)\n\n(19)\n\nare all constants. Equation (18) provides a small-size asymptotic series expansion of the size effect and is plotted\nin Fig. 3. When L → 0, the nominal strength tends to a constant (i.e. σM ′ as expected in the case of a strength\ntheory25 ) but diverges from the asymptotic behavior of the size effect obtained in the case of large structure sizes [Eq.\n(13)].\nC. Approximate size effect\n\nNow, the main problem consists in interpolating between the large-size [Eq. (13)] and the small-size [Eq. (18)]\nasymptotic series expansion in order to obtain an approximate size effect valid everywhere. The theory of intermediate\nasymptotics27 is not easily applicable in our case. Nevertheless, it is interesting to observe in Fig. 3 that a satisfactory\napproximate size effect can be obtained by truncating the small-size asymptotic series expansion [Eq. (18)] after the\nlinear term:\nv\nu\u0012\n\u00131/2\nu\n\u0001\nu 1 + L 2(ζ−ζloc )\nu\nLC\nσN = σmax t\n(20)\n1 + LLo\n\nwhere the contants σmax and Lo will be discussed in what follows. Indeed, Eq. (20) allows to obtain the transition\nbetween a horizontal asymptote characterizing the strength theory for which there is no size effect, and a decreasing\nasymptote, corresponding to a power law of exponent: −1/2 + (ζ − ζloc )/2 for large structure sizes. A possible\njustification is that, in the large-size first-order expansion [Eq. (15)], the second term in numerator has no influence\non the power law σN ∼ L−1/2+(ζ−ζloc )/2 for large sizes but induces a divergence at small sizes.\nOne limitation of the approximate size effect is that in Eq. (20), the values of σM and σM ′ , and the values of L1\nand L2 , are assumed to be equal and respectively characterized by σmax and Lo . Indeed, the estimate of these values\nwould be surely different from large size data or from small size data. Thus, the approximate size effect only gives\nthe shape of the size effect relation on the nominal strength but does not allow for a determination of the parameter\nvalues σmax and Lo . Only the crossover length LC and the scaling exponents ζloc and ζ are univocally determined\nfrom the roughness analysis. However, it seems reasonnable to assume that the difference between σM and σM ′ will\nbe masked by the scatter of the experimental data. On the other hand, it seems difficult to compare the crossover\nlengths L1 and L2 (characterized by Lo in Eq. (20)) to the crossover length LC using their analytical expressions,\nbecause the former is deduced from a mechanical approach and the latter from a roughness analysis. Nevertheless,\nfrom a physical point of view, both have the same meaning. For small structure sizes, i.e. L ≪ LC or Lo , the energy\nreleased by the structure is negligible, while for large sizes, i.e. L ≫ LC or Lo , the energy released is dominant. Hence,\nit seems reasonnable to assume that both crossover lengths are of the same order of magnitude (it is the case in Fig.\n3 where it is assumed that Lo = LC ).\nIV. EXPERIMENT\n\nIn the following the experimental setup of mode I fracture tests on a quasibrittle material, wood, is described.\nTwo wood species have been tested: Maritime pine (Pinus pinaster Ait ) and Norway spruce (Picea Abies L.). The\naverage oven dry specific densities were respectively 0.55 and 0.40 and the moisture content of all specimens was\nmeasured between 11 and 13 %. Tests were made on modified tapered double cantilever beam specimens (TDCB)\noriented along the longitudinal-tangential directions of wood (Fig. 2). Six sets of geometrically similar specimens\ncharacterized by their width L = 7.5, 11.3, 15.0, 22.5, 30.0 and 60.0 mm have been used. A straight notch is machined\nwith a band saw (thickness 2 mm) and prolonged a few millimeters with a razor blade (thickness 0.2 mm). Fracture\nis obtained through uniaxial tension at a constant opening rate. The fracture surfaces are generated along the average\nlongitudinal-radial plane of wood. Load-deflection values were continuously recorded during the tests.\nThe roughness analysis20 , performed from these fracture tests, has shown an anomalous roughening [Eq. (1)] of the\ncrack surfaces driven by the global and local roughness exponents, ζ = 1.35 ± 0.10 and ζloc = 0.88 ± 0.07 in the case\nof pine, and, ζ = 1.60 ± 0.10 and ζloc = 0.87 ± 0.07 in the case of spruce. Hence, the experimental R-curve behaviors\nand the size effects on critical energy release rates and nominal strengths should be described respectively by Eq. (3),\nEq. (4) and Eq. (20).\n6\n\n\fFrom an equivalent linear elastic approach (which is the frame of the model described in Sec. II and Sec.III) where\nthe crack lengths can be estimated from the unloading compliance of the specimens , the elastic energy release rate\nGR are computed from the load-deflection curves for any crack length increment ∆a. Two examples of the energy\nrelease rate evolution GR as a function of the crack length extension ∆a obtained for both wood species and for\na specimen size L = 11.3 mm are given in Fig. 4. An R-curve behavior is observed for both wood species, i.e. a\npronounced evolution of the resistance to crack growth as a function of the equivalent crack length increment6 . After\na characteristic propagation distance (∆asat ≃ 23 mm for pine (a) and 40 mm for spruce (b)) which corresponds\napproximately to the ultimate load Pu , the energy release rate becomes independent of the crack length increment\n∆a. The post R-curve behavior arises at constant resistance to crack growth and corresponds to critical resistance\nGRC . In Figure 4 the R-curves and post R-curve behaviors are fitted with the Eq. (3). These fits are obtained in\nkeeping three free parameters: the specific surface energy γ, the ratio A/lo 1−ζloc and the scaling exponent (ζ − ζloc )/z.\nThe expected R-curve behavior [Eq. (3)] provides a good description of the increase of the experimental resistances to\ncrack growth. For both wood species, the fitted exponents (ζ − ζloc )/z are close to those measured from the roughness\nanalysis20 which are given in brackets in Fig. 4. Note that the R-curve is more pronouced in pine than in spruce\n(i.e. the critical energy release rate GRC is greater for a smaller crack length increment ∆asat than in spruce). This\ntrend has also been observed for the other specimen sizes L.\nOn the other hand, for both wood species, it has been shown that the sizes L of tested specimens were greater\nthan the crossover lengths LC 13 [defined in Eq.(4) and Eq. (20) relative to the size effect]. Thus, according to Eq.\n(4) and for L ≫ LC , the size effect on the critical energy release rates of both wood species is expected to evolve as\na power law: GRC ∼ Lζ−ζloc . The critical energy release rates obtained for both wood species are plotted in Fig. 5\nversus the characteristic specimen sizes L. Experimental size effects are fitted by a power law GRC (L) ∼ Lβ whose\nthe exponents β = 0.42 for pine (a) and β = 0.64 for spruce (b) are in fair agreement with the expected exponents\nζ − ζloc = 0.47 ± 0.17 for pine (a) and 0.73 ± 0.17 for spruce (b). Note that the size effect on critical energies of spruce\nis stronger than the one obtained for pine.\nIn the same way, in Fig. 6, the nominal strengths σN obtained for both wood species are plotted versus the\ncharacteristic specimen sizes L. According to Eq. (20) and, as previously mentioned for L ≫ LC , the size effect\non nominal strengths is expected to evolve as: σN ∼ L−1/2+(ζ−ζloc )/2 . Note that latter asymptotic behaviour is\nobtained with the assumption Lo = LC in Eq. (20) as previously discussed in Sec III C. As shown in Fig. 6, simple\npower law fits of the experimental nominal strengths give exponent which are in good agreement with those expected,\ni.e. − 21 + ζ−ζ2loc = −0.27 ± 0.09 for pine (a) and −0.14 ± 0.09 for spruce (b). By comparison of the size effects on the\ncritical energy release rates and on the nominal strengths it is appeared that, as expected intuitively, the more the\nsize effect on critical energies is important the more the size effect on nominal strengths is weak.\nV. CONCLUSION\n\nFrom an energy-based analysis, a link between the scaling laws describing the fracture surfaces and the size effect\non the nominal strength of the structures is proposed. On the basis of a Family-Vicsek scaling, which has been shown\nto reflect a purely elastic brittle fracture behavior13 , the size effect obtained is in agreement with the classical size\neffect of linear elastic fracture mechanics: σN ∼ L−1/2 [Eq. (9)]. In the case of an anomalous scaling, reflecting the\nfracture behavior of quasibrittle materials13 , an asymptotic analysis allows to estimate the size effect relation on the\nnominal strength, and especially, the crack length increment for which the maximum load is reached. From large-size\nand small-size asymptotic series expansion of the size effect, an approximate size effect [Eq. (20)] of general validity\nis proposed. This relation represents a smooth transition from the case of no size effect, for small structure sizes, to a\npower law size effect which appears weaker than the size effect of LEFM. Thus, in the case of quasibrittle materials,\nthe approximate size effect relation [Eq. (20)] is different from the classical size effect law proposed by Bažant25\nand especially for large structure sizes where an asymptotic behavior σN ∼ L−1/2+(ζ−ζloc )/2 is predicted instead\nof the size effect of LEFM suggested by Bažant's theory. The difference can be explained by the fact that, for an\nanomalous scaling of fracture surfaces, the critical resistance to crack growth at the maximum load evolves as a power\nlaw GRC ∼ Lζ−ζloc for large structure sizes while this resistance is assumed to be constant in LEFM. Experiments\nperformed on geometrically similar wood specimens of various sizes, for which anomalous roughening of crack surfaces\nhas been observed previously20 , show that the size effects on the critical resistances and on the nominal strengths are\nin fair agreement with the predicted asymptotic behaviors GRC ∼ Lζ−ζloc and σN ∼ L−1/2+(ζ−ζloc )/2 . On the other\nhand, if one considers a weakly anomalous roughening of the fracture surfaces (i.e. ζ → ζloc ), R-curve [Eq. (3)] and\nsize effect on the critical resistance [Eq. (4)] vanish progressively and as a consequence, the size effect characteristic\nof a quasibrittle material [Eq. (20)] tends to the classical size effect of a purely elastic brittle material [Eq. (9)].\nExperiments on different kinds of quasi-brittle materials are currently being performed to test our predictions.\n\n7\n\n\f1\n\nZ.P. Bažant, J. Eng. Mech. 110, 518 (1984).\nZ.P. Bažant, Appl. Mech. Rev. 50 (10), 593 (1997) and references therein.\n3\nW. Weibull, Proc. Royal Swedish Inst. of Eng. Res. (Ingeniors Vetenskaps Akademien) 153, 1 (1939)\n4\nM. Hori, and S. Nemat-Nasser, J. Mech. Phys. Solids 35 (5), 601 (1987).\n5\nM. Kachanov, Adv. in Appl. Mech. 30, 259 (1994).\n6\nB.R. Lawn, Fracture of Brittle Solids, (2nd ed, Cambridge University Press, Cambridge, England, 1993)\n7\nA.B. Mosolov, Europhys. Lett. 24 (8), 673 (1993).\n8\nA. Carpinteri, Int. J. Solids Struct. 31 (3), 291 (1994).\n9\nE. Bouchaud, and J.-P. Bouchaud, Phys. Rev. B 50 (23), 17752 (1994).\n10\nA.S. Balankin, Int. J. Fract. 76, R63 (1996).\n11\nF.M. Borodich, J. Mech. Phys. Solids. 45 (2), 239 (1997).\n12\nZ.P. Bažant, Int. J. Fract. 83, 41 (1997).\n13\nS. Morel, J. Schmittbuhl, E. Bouchaud, and G. Valentin, Phys. Rev. Lett. 85 (8), 1678 (2000)\n14\nR.H. Dauskardt, F. Haubensak, and R.O. Ritchie, Acta Metall. Mater. 38 (2), 143 (1990).\n15\nE. Bouchaud, G. Lapasset, and J. Planés, Europhys. Lett. 13, 73 (1990).\n16\nF. Plouraboué, P. Kurowski, J.-P. Hulin, S. Roux,and J. Schmittbuhl, Phys. Rev. E 51, 1675 (1995).\n17\nJ. Schmittbuhl, S. Roux, Y. Berthaud, Europhys. Lett. 28 (8), 585 (1994).\n18\nJ.M. López, J.Schmittbuhl, Phys. Rev. E 57, 6405 (1998).\n19\nT. Engøy, K.J. Måløy, A. Hansen, and S. Roux, Phys. Rev. Lett. 73 (6), 834 (1994).\n20\nS. Morel, J. Schmittbuhl, J.M. López, and G. Valentin, Phys. Rev. E 58 (6), 6999 (1998).\n21\nE. Bouchaud, J. Phys. Cond. Mat. 9, 4319 (1997).\n22\nS. Das Sarma, S.V. Ghaisas, and J.M. Kim, Phys. Rev. E 49 (1), 122 (1994).\n23\nJ.M. López, M.A. Rodrı́guez, R. Cuerno, Phys. Rev. E. 56 (4), 3993 (1997).\n24\nF. Family and T. Vicsek, Dynamics of fractal surfaces (World Scientific, Singapore, 1991).\n25\nZ.P. Bažant, Int. J. Fract. 83, 19 (1997).\n26\nZ.P. Bažant, M.T. Kazemi, J. Am. Ceram. Soc. 73 (7), 1841 (1990).\n27\nC.M. Bender and S.A. Orszag, Advanced Mathematical Methods for Scientists and Engineers, chapters 9-11 (Springer-Verlag,\nNew-York, 1999).\n2\n\n8\n\n\fFIG. 1. Size effect on the critical resistance to crack growth GRC obtained in the case of an anomalous scaling (ζ = 1.3,\nζloc = 0.8, A = 0.1 and lo = 1: arbitrary values\n\nFIG. 2. Geometrically similar Tapered Double Cantilever Beam (TDCB) fracture specimens of different sizes\nL = 7.5, 11.3, 15.0, 22.5, 30.0 and 60.0 mm.\n\nFIG. 3. Approximate size effect on the nominal strength (solid curve, Eq. (20)) and asymptotic series expansions (dashed\ncurves, Eq. (13) and Eq. (18))\n\nFIG. 4. Examples of R-curves GR (∆a) respectively obtained for pine (a) and spruce (b) from specimens of characteristic\nsize L = 11, 3 mm.\n\nFIG. 5. Size effect on critical energy release rate GRC respectively for pine (a) and spruce (b). The expected slopes from the\nroughness analysis20 are ζ − ζloc = 0.47 ± 0.17 for pine (a) and 0.73 ± 0.17 for spruce (b).\n\nFIG. 6. Size effect on nominal strength respectively for pine (a) and spruce (b). The expected slopes from the roughness\nanalysis20 are − 12 + ζ−ζ2loc = −0.27 ± 0.09 for pine (a) and −0.14 ± 0.09 for spruce (b).\n\n9\n\n\fGRC / 2γ\n\nFigure1-Morel et al.-PRB\n\n10.0\n\nζ−ζloc\n\n10\n\n1.0\n\n0.01\n\n0.10\n\n1.00\n\nL / LC\n\n10.00\n\n100.00\n\n\fP\nb\n\nao\n\nP\n\nL\n\nT\n\nd\n\ne\n\nc\n\nh\n\nL\nFigure2-Morel et al.-PRB\n\n11\n\n\fFigure3-Morel et al.-PRB\n\nstrength theory\n\nLog10( σN )\n\napproximate\nsize effect\n\nlarge−size\nasympt. exp.\n\n2\n1−(ζ−ζloc)\n\n12\n\nsmall−size\nasympt. exp.\nLC = Lo\n\nLog10( L )\n\n\f450\n\nGRC\n\n2\n\nGR (J/m )\n\n350\n\n250\n\n2γ=9.0 J/m\n(a)\n\n150\n\n(ζ−ζloc)/z=0.30 (0.26)\n\n0\n\n2\n\nGR (J/m )\n\n200\n\n2\n\n10\n\n∆asat\n20\n\n30\n\nGRC\n\n150\n\n100\n2\n\n2γ=12.1 J/m\n(b)\n50\n\n0\n\n(ζ−ζloc)/z=0.25 (0.28)\n10\n\n∆asat\n\n20\n\n30\n\n∆a (mm)\n\nFigure4-Morel et al.-PRB\n\n13\n\n40\n\n50\n\n\f3.2\n\nLog10( GRC )\n\n3\n\n0.42\n\n2.8\n\n2.6\n\n2.4\n\n(a)\n\n2.8\n\nLog10( GRC )\n\n2.6\n\n0.64\n\n2.4\n\n2.2\n\n2\n\n(b)\n1.8\n\n0.8\n\n1.0\n\n1.2\n\n1.4\n\nLog10( L )\n\nFigure5-Morel et al.-PRB\n\n14\n\n1.6\n\n1.8\n\n\fLog10( σN )\n\n−1.2\n\n−1.3\n\n0.23\n\n−1.4\n\n−1.5\n\n(a)\n\nLog10( σN )\n\n−1.4\n\n−1.5\n\n0.14\n−1.6\n\n−1.7\n\n(b)\n0.8\n\n1.0\n\n1.2\n\n1.4\n\nLog10( L )\n\nFigure6-Morel et al.-PRB\n\n15\n\n1.6\n\n1.8\n\n\f"}