{"id": "http://arxiv.org/abs/cond-mat/0703054v3", "guidislink": true, "updated": "2008-07-16T20:16:53Z", "updated_parsed": [2008, 7, 16, 20, 16, 53, 2, 198, 0], "published": "2007-03-02T11:33:05Z", "published_parsed": [2007, 3, 2, 11, 33, 5, 4, 61, 0], "title": "Nuclear-induced time evolution of entanglement of two-electron spins in\n  anisotropically coupled quantum dot", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0703816%2Ccond-mat%2F0703298%2Ccond-mat%2F0703187%2Ccond-mat%2F0703189%2Ccond-mat%2F0703057%2Ccond-mat%2F0703617%2Ccond-mat%2F0703705%2Ccond-mat%2F0703248%2Ccond-mat%2F0703597%2Ccond-mat%2F0703424%2Ccond-mat%2F0703665%2Ccond-mat%2F0703608%2Ccond-mat%2F0703370%2Ccond-mat%2F0703172%2Ccond-mat%2F0703368%2Ccond-mat%2F0703254%2Ccond-mat%2F0703313%2Ccond-mat%2F0703814%2Ccond-mat%2F0703811%2Ccond-mat%2F0703222%2Ccond-mat%2F0703071%2Ccond-mat%2F0703596%2Ccond-mat%2F0703538%2Ccond-mat%2F0703166%2Ccond-mat%2F0703115%2Ccond-mat%2F0703240%2Ccond-mat%2F0703738%2Ccond-mat%2F0703724%2Ccond-mat%2F0703113%2Ccond-mat%2F0703670%2Ccond-mat%2F0703012%2Ccond-mat%2F0703446%2Ccond-mat%2F0703193%2Ccond-mat%2F0703599%2Ccond-mat%2F0703284%2Ccond-mat%2F0703461%2Ccond-mat%2F0703144%2Ccond-mat%2F0703024%2Ccond-mat%2F0703584%2Ccond-mat%2F0703262%2Ccond-mat%2F0703091%2Ccond-mat%2F0703462%2Ccond-mat%2F0703076%2Ccond-mat%2F0703612%2Ccond-mat%2F0703505%2Ccond-mat%2F0703117%2Ccond-mat%2F0703804%2Ccond-mat%2F0703221%2Ccond-mat%2F0703015%2Ccond-mat%2F0703737%2Ccond-mat%2F0703699%2Ccond-mat%2F0703768%2Ccond-mat%2F0703274%2Ccond-mat%2F0703045%2Ccond-mat%2F0703078%2Ccond-mat%2F0703141%2Ccond-mat%2F0703228%2Ccond-mat%2F0703458%2Ccond-mat%2F0703292%2Ccond-mat%2F0703054%2Ccond-mat%2F0703771%2Ccond-mat%2F0703230%2Ccond-mat%2F0703602%2Ccond-mat%2F0703069%2Ccond-mat%2F0703644%2Ccond-mat%2F0703421%2Ccond-mat%2F0703728%2Ccond-mat%2F0703472%2Ccond-mat%2F0703081%2Ccond-mat%2F0703716%2Ccond-mat%2F0703663%2Ccond-mat%2F0703643%2Ccond-mat%2F0703235%2Ccond-mat%2F0703267%2Ccond-mat%2F0703503%2Ccond-mat%2F0703466%2Ccond-mat%2F0703750%2Ccond-mat%2F0703371%2Ccond-mat%2F0703582%2Ccond-mat%2F0703245%2Ccond-mat%2F0703008%2Ccond-mat%2F0703441%2Ccond-mat%2F0703211%2Ccond-mat%2F0703036%2Ccond-mat%2F0703001%2Ccond-mat%2F0703033%2Ccond-mat%2F0703564%2Ccond-mat%2F0703097%2Ccond-mat%2F0703700%2Ccond-mat%2F0703763%2Ccond-mat%2F0703423%2Ccond-mat%2F0703711%2Ccond-mat%2F0703233%2Ccond-mat%2F0703786%2Ccond-mat%2F0703639%2Ccond-mat%2F0703023%2Ccond-mat%2F0703281%2Ccond-mat%2F0703631%2Ccond-mat%2F0703524%2Ccond-mat%2F0703321%2Ccond-mat%2F0703552&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Nuclear-induced time evolution of entanglement of two-electron spins in\n  anisotropically coupled quantum dot"}, "summary": "We study the time evolution of entanglement of two spins in anisotropically\ncoupled quantum dot interacting with the unpolarized nuclear spins environment.\nWe assume that the exchange coupling strength in the z-direction $J_z$ is\ndifferent from the lateral one $J_l$. We observe that the entanglement decays\nas a result of the coupling to the nuclear environment and reaches a saturation\nvalue, which depends on the value of the exchange interaction difference $J=\\|\nJ_l-J_z\\|$ between the two spins and the strength of the applied external\nmagnetic field. We find that the entanglement exhibits a critical behavior\ncontrolled by the competition between the exchange interaction $J$ and the\nexternal magnetic field. The entanglement shows a quasi-symmetric behavior\nabove and below a critical value of the exchange interaction. It becomes more\nsymmetric as the external magnetic field increases. The entanglement reaches a\nlarge saturation value, close to unity, when the exchange interaction is far\nabove or below its critical value and a small one as it closely approaches the\ncritical value. Furthermore, we find that the decay rate profile of\nentanglement is linear when the exchange interaction is much higher or lower\nthan the critical value but converts to a power law and finally to a Gaussian\nas the critical value is approached from both directions. The dynamics of\nentanglement is found to be independent of the exchange interaction for\nisotropically coupled quantum dot.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0703816%2Ccond-mat%2F0703298%2Ccond-mat%2F0703187%2Ccond-mat%2F0703189%2Ccond-mat%2F0703057%2Ccond-mat%2F0703617%2Ccond-mat%2F0703705%2Ccond-mat%2F0703248%2Ccond-mat%2F0703597%2Ccond-mat%2F0703424%2Ccond-mat%2F0703665%2Ccond-mat%2F0703608%2Ccond-mat%2F0703370%2Ccond-mat%2F0703172%2Ccond-mat%2F0703368%2Ccond-mat%2F0703254%2Ccond-mat%2F0703313%2Ccond-mat%2F0703814%2Ccond-mat%2F0703811%2Ccond-mat%2F0703222%2Ccond-mat%2F0703071%2Ccond-mat%2F0703596%2Ccond-mat%2F0703538%2Ccond-mat%2F0703166%2Ccond-mat%2F0703115%2Ccond-mat%2F0703240%2Ccond-mat%2F0703738%2Ccond-mat%2F0703724%2Ccond-mat%2F0703113%2Ccond-mat%2F0703670%2Ccond-mat%2F0703012%2Ccond-mat%2F0703446%2Ccond-mat%2F0703193%2Ccond-mat%2F0703599%2Ccond-mat%2F0703284%2Ccond-mat%2F0703461%2Ccond-mat%2F0703144%2Ccond-mat%2F0703024%2Ccond-mat%2F0703584%2Ccond-mat%2F0703262%2Ccond-mat%2F0703091%2Ccond-mat%2F0703462%2Ccond-mat%2F0703076%2Ccond-mat%2F0703612%2Ccond-mat%2F0703505%2Ccond-mat%2F0703117%2Ccond-mat%2F0703804%2Ccond-mat%2F0703221%2Ccond-mat%2F0703015%2Ccond-mat%2F0703737%2Ccond-mat%2F0703699%2Ccond-mat%2F0703768%2Ccond-mat%2F0703274%2Ccond-mat%2F0703045%2Ccond-mat%2F0703078%2Ccond-mat%2F0703141%2Ccond-mat%2F0703228%2Ccond-mat%2F0703458%2Ccond-mat%2F0703292%2Ccond-mat%2F0703054%2Ccond-mat%2F0703771%2Ccond-mat%2F0703230%2Ccond-mat%2F0703602%2Ccond-mat%2F0703069%2Ccond-mat%2F0703644%2Ccond-mat%2F0703421%2Ccond-mat%2F0703728%2Ccond-mat%2F0703472%2Ccond-mat%2F0703081%2Ccond-mat%2F0703716%2Ccond-mat%2F0703663%2Ccond-mat%2F0703643%2Ccond-mat%2F0703235%2Ccond-mat%2F0703267%2Ccond-mat%2F0703503%2Ccond-mat%2F0703466%2Ccond-mat%2F0703750%2Ccond-mat%2F0703371%2Ccond-mat%2F0703582%2Ccond-mat%2F0703245%2Ccond-mat%2F0703008%2Ccond-mat%2F0703441%2Ccond-mat%2F0703211%2Ccond-mat%2F0703036%2Ccond-mat%2F0703001%2Ccond-mat%2F0703033%2Ccond-mat%2F0703564%2Ccond-mat%2F0703097%2Ccond-mat%2F0703700%2Ccond-mat%2F0703763%2Ccond-mat%2F0703423%2Ccond-mat%2F0703711%2Ccond-mat%2F0703233%2Ccond-mat%2F0703786%2Ccond-mat%2F0703639%2Ccond-mat%2F0703023%2Ccond-mat%2F0703281%2Ccond-mat%2F0703631%2Ccond-mat%2F0703524%2Ccond-mat%2F0703321%2Ccond-mat%2F0703552&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the time evolution of entanglement of two spins in anisotropically\ncoupled quantum dot interacting with the unpolarized nuclear spins environment.\nWe assume that the exchange coupling strength in the z-direction $J_z$ is\ndifferent from the lateral one $J_l$. We observe that the entanglement decays\nas a result of the coupling to the nuclear environment and reaches a saturation\nvalue, which depends on the value of the exchange interaction difference $J=\\|\nJ_l-J_z\\|$ between the two spins and the strength of the applied external\nmagnetic field. We find that the entanglement exhibits a critical behavior\ncontrolled by the competition between the exchange interaction $J$ and the\nexternal magnetic field. The entanglement shows a quasi-symmetric behavior\nabove and below a critical value of the exchange interaction. It becomes more\nsymmetric as the external magnetic field increases. The entanglement reaches a\nlarge saturation value, close to unity, when the exchange interaction is far\nabove or below its critical value and a small one as it closely approaches the\ncritical value. Furthermore, we find that the decay rate profile of\nentanglement is linear when the exchange interaction is much higher or lower\nthan the critical value but converts to a power law and finally to a Gaussian\nas the critical value is approached from both directions. The dynamics of\nentanglement is found to be independent of the exchange interaction for\nisotropically coupled quantum dot."}, "authors": ["Gehad Sadiek", "Zhen Huang", "Omar Aldossary", "Sabre Kais"], "author_detail": {"name": "Sabre Kais"}, "author": "Sabre Kais", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1080/00268970802290313", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0703054v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0703054v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages and 7 figures. v3: major changes", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0703054v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0703054v3", "journal_reference": "Molecular Physics 106, 1777 (2008)", "doi": "10.1080/00268970802290313", "fulltext": "Nuclear-induced time evolution of entanglement of two-electron\n\narXiv:cond-mat/0703054v3 [cond-mat.mes-hall] 16 Jul 2008\n\nspins in anisotropically coupled quantum dot\nGehad Sadiek,1,2,3 Zhen Huang,4 Omar Aldossary,1 and Sabre Kais4\n1\n\nDepartment of Physics, King Saud University, Riyadh 11451-2455, Saudi Arabia\n2\n\nDepartment of Physics, Purdue University, West Lafayette, IN 47907, USA\n3\n\nDepartment of Physics, Ain Shams University, Cairo 11566, Egypt and\n4\n\nDepartment of Chemistry and Birck Nanotechnology Center,\nPurdue University, West Lafayette IN 47907, USA\n\nAbstract\nWe study the time evolution of entanglement of two spins in anisotropically coupled quantum\ndot interacting with the unpolarized nuclear spins environment. We assume that the exchange\ncoupling strength in the z-direction Jz is different from the lateral one Jl . We observe that the\nentanglement decays as a result of the coupling to the nuclear environment and reaches a saturation\nvalue, which depends on the value of the exchange interaction difference J = kJl − Jz k between the\ntwo spins and the strength of the applied external magnetic field. We find that the entanglement\nexhibits a critical behavior controlled by the competition between the exchange interaction J and\nthe external magnetic field. The entanglement shows a quasi-symmetric behavior above and below a\ncritical value of the exchange interaction. It becomes more symmetric as the external magnetic field\nincreases. The entanglement reaches a large saturation value, close to unity, when the exchange\ninteraction is far above or below its critical value and a small one as it closely approaches the\ncritical value. Furthermore, we find that the decay rate profile of entanglement is linear when the\nexchange interaction is much higher or lower than the critical value but converts to a power law\nand finally to a Gaussian as the critical value is approached from both directions. The dynamics\nof entanglement is found to be independent of the exchange interaction for isotropically coupled\nquantum dot.\n\n1\n\n\fI.\n\nINTRODUCTION\n\nCoherence and entanglement lie in the heart of quantum mechanics since its birth and\nare of fundamental interest in modern physics. Particular fields where they play a crucial\nrole are quantum information processing and quantum computing [1, 2, 3, 4]. Decoherence\nis considered as one of the main obstacles toward achieving a practical quantum computing system as it acts to randomize the relative phases of the two-state quantum computing\nunits (qubits) due to coupling to the environment[5]. Quantum entanglement is a nonlocal\ncorrelation between two (or more) quantum systems such that the description of their states\nhas to be done with reference to each other even if they are spatially well separated. Entanglement arises naturally when manipulating linear superpositions of quantum states to\nimplement the different proposed quantum computing algorithms [6, 7]. Different physical\nsystems have been proposed as reliable candidates for the underlying technology of quantum\ncomputing and quantum information processing [8, 9, 10, 11, 12, 13, 14]. There has been\nspecial interest in solid state systems as they can be utilized to build up integrated networks\nthat can perform quantum computing algorithms at large scale. Particularly, the semiconductor quantum dot is considered as one of the most promising candidates for playing the\nrole of a qubit [15, 16, 17]. The main idea is to use the spin S of the valence electron\non a single quantum dot as a two-state quantum system, which gives rise to a well-defined\nqubit. On the other hand, the strong coupling of the electron spin on the quantum dot to its\nenvironment stands as a real challenge toward achieving the high coherent control over the\nspin required for information and computational processing. The main mechanisms responsible for spin decoherence are spin-orbit coupling and spin-nuclear spins (of the surrounding\nlattice) coupling [17, 18]. Recent experiments show that the spin relaxation time due to\nspin-orbit coupling (tens of ms) is about six orders of magnitude longer than that due to\ncoupling to nuclear spins (few ns) [19, 20, 21]. This made the electron spin coupling to the\nnuclear spins the target of large number of theoretical [22, 23, 24, 25, 26] and experimental\n[27, 28, 29, 30, 31, 32] research works. The dipolar interaction between the nuclei in the\ndot does not conserve the total nuclear spin and as a result the change in the nuclear spin\nconfiguration happens within Tnuc ∼ 10−4 s which is the precession time of a single nuclear\nspin in the local magnetic field of the other spins. This precession time is much longer\nthan the decoherence time of the electron spin due to hyperfine coupling in the dot (∼ 10−6\n2\n\n\fs), therefore we can safely ignore this interaction as well as the fluctuation of the nuclear\nmagnetic field when treating the entanglement and decoherence problem of the electron\nspins. In addition to the proposals for using the single quantum dot as a qubit, there has\nbeen others for using coupled quantum dots as quantum gates[15, 17]. The aim is to find\na controllable mechanism for forming an entanglement between the two quantum dots (two\nqubits) in such a way to produce a fundamental quantum computing gate such as XOR. In\naddition, we need to be able to coherently manipulate such an entangled state to provide an\nefficient computational process. Such coherent manipulation of entangled states has been\nobserved in other systems such as isolated trapped ions [33] and superconducting junctions\n[34]. Recently an increasing effort to investigate entangled states in coupled quantum dots\nhas emerged. The coherent control of a two-electron spin state in a coupled quantum dot\nwas achieved experimentally, where the coupling mechanism is the Heisenberg exchange interaction between the electron spins [30, 31, 32]. The mixing of the two-electron singlet and\ntriplet states due to coupling to the nuclear spins was observed. The induced decoherence\n(leading to the singlet triplet mixing) in the system has been studied theoretically, where\neach one of the two electrons were assumed to localized on its own dot and coupled to a\ndifferent nuclear spin environement [35, 36, 37]. There has been proposals for experimental\nscheme to create, detect and control entangled spin states in coupled quantum dots [38].\nRecently, there has been an increasing interest in studying the anisotropy in the exchange\ninteraction in coupled quantum dot systems, which is mainly due to the spin-orbit coupling,\nthe unavoidable asymmetry of the dots structure and the effect of the external magnetic\nfield [39, 40, 41, 42]. Furthermore, there has been proposals to utilize this anisotropy, rather\nthan removing it, in introducing a set of quantum logic gates to be implemented in quantum\ncomputing [43, 44, 45].\nIn this paper we study the dynamics of entanglement of two electron spins confined\nin a system of two laterally coupled quantum dots with one net electron per dot. The two\nelectron spins are coupled through exchange interaction. Modeling the coupling between the\ntwo electrons on a couple dot system by exchange interaction, including the low barrier case,\nhas been studied in detail in Ref. [17]. We assume that the exchange coupling is anisotropic\nsuch that the two spins couple in the transverse (z-direction) with a coupling strength that\nis different from the one in the lateral direction (x and y-directions). An external magnetic\nfield is applied perpendicularly to the plane of confinement. We assume that the potential\n3\n\n\fbarrier between the two dots is low enough that the two electrons are delocalized over the two\ndots and as a result are coupled to a common nuclear environment which splits the two spins\nspace into two unmixable subspaces (one contains the singlet state and the other contains the\nthree triplets). Therefore, the singlet-triplet mixing can not take place for this system set up\nin contrast to the case studied in Ref. [35] and [36]. Nevertheless, mixing within the triplets\nsubspace is possible and in order to study it we assume that the system was initially prepared\nin a maximally entangled triplet spin state with a total antisymmetric wave function, which\nis experimentally an achievable task [31, 32]. The two spins are coupled through hyperfine\ninteraction to the surrounding unpolarized nuclear spins in the two dots. We study the time\nevolution of the entanglement of the two spins induced by the nuclear spins at different\nstrengths of the external magnetic field and exchange interaction, which can be tuned and\nmeasured experimentally by controlling the different gate voltages on the two dots [32]. We\nfound that the entanglement which is initially maximum decays as a result of coupling to\nthe nuclear spins within a decoherence time of the order of 10−4 . The entanglement decay\nrate and its saturation value vary over wide range and are determined by the value of the\nexchange interaction difference (between the transverse and lateral components) and the\nstrength of the external magnetic field. The entanglement exhibits a critical behavior which\nis decided based on the competition between the exchange interaction difference (regardless\nof its sign) and the external magnetic field, it shows a quasi-symmetric behavior above and\nbelow a critical value of the exchange interaction difference which is determined based on the\nvalue of the external magnetic field. The behavior becomes more symmetric as the external\nmagnetic field increases. Comparable decay rates and saturation values were observed for the\nentanglement on both sides of the critical exchange interaction value. Far from the critical\nexchange value, the entanglement shows high saturation values and slow power law decay\nrates. Close to the critical value, the saturation values become much lower and the decay rate\nshows Gaussian profiles. Our results suggest that for maintaining the entanglement between\nthe two spins, the difference between the values of the exchange interaction difference and\nthe external magnetic field should be tuned to be large. This paper is organized as follows.\nIn sec. II we introduce our model and the calculations of the spin correlation functions.\nIn sec. III we show the evaluation of entanglement. In sec. IV we present our results,\ndiscussing and explaining the different important findings we obtained. We close with our\nconclusions in Sec V.\n4\n\n\fII.\n\nTWO ELECTRON SPINS COUPLED TO A BATH OF NUCLEAR SPINS\n\nWe consider two coupled quantum dots with a net single valence electron per dot. The\ntwo electron spins S1 and S2 couple to each other through exchange interaction and couple to\nthe same external magnetic field B and to the common unpolarized nuclear spins on the two\ndots {Ii } through hyperfine interaction. The exchange interaction is taken to be anisotropic\nwith the coupling strength in the z-direction to be Jz and in the x and y directions as Jl .\nThe spin-orbit coupling and the dipolar interactions between the nuclei are ignored. The\nsystem is described by the Hamiltonian\nĤ = Jz S1z S2z + Jl (S1x S2x + S1y S2y ) + gμB S * B + S * h2N ,\n\n(1)\n\nwhere g is the electron g factor and μB the Bohr magneton. S = S1 + S2 and h2N =\nP\n\ni\n\nAi Ii = gμB H2N , where H2N is the two dot nuclear magnetic field and the sum is running\n\nover the entire space. Ai is the coupling constant of S with the i th nucleus and is equal to\nAv0 |ψA (ri )|2 , where A is a hyperfine constant, v0 (= a2 az /N) is the volume of the crystal cell,\na and az are the single dot sizes in the lateral and transverse directions, and ψA (ri ) is the two\n\nelectrons envelope antisymmetric wave function at the nuclear site ri . For a typical single\nquantum dot size, the number of nuclei N = 106 and their typical nuclear magnetic field\n√\naffecting the electron spin through hyperfine coupling is of the order of ∼ A/( NgμB ) [46],\nwhich is approximately of magnitude ≃ 5 mT [32], with an associated electron precession\n√\nfrequency ωN ≃ A/ N, where ωN ≫ 1/Tnuc , and a ∼ 15 nm. The presence of an external\nmagnetic field causes Zeeman splitting for the electron spin and in addition has a polarizing\neffect on the nuclear spins. The magnitude of these effects and the associated electron\nprecession frequency depends on the strength of the applied field which we consider as a\nvarying parameter in this work and is changed over a wide range. Therefore, the precession\nfrequency about the external magnetic field can be higher or lower than ωN depending on\nthe strength of the external field compared to the nuclear field. We consider some particular\nunpolarized nuclear configuration, represented in terms of the Iˆiz nuclear spin eigenbasis as\n|Izi i, with Iiz = ±1/2, where we have considered nuclear spin 1/2 for simplicity. This nuclear\nconfigurations have the same time evolution as the more general initial tensor product states\ncorresponding to arbitrary directions of individual spins [18]. The Hamiltonian H (Eq. 1)\nis symmetric under exchange of the two electron spins S1 and S2 which reflects the fact\nthat in this model the two electrons are considered indistinguishable (delocalized over the\n5\n\n\ftwo dots). This Hamiltonian splits the the two spins space into two subspaces, one of them\ncontains the singlet state and the other contains the three triplet states. In this system\nset up (described by the Hamiltonian H), the two subspaces never get mixed. The only\nmechanism by which these two subspaces can get mixed is that each electron spin couples\nto a different nuclear magnetic field (or even a different magnetic field), which is not the\ncase here. We assume that the two coupled electron spins are initially (t = 0) in a triplet,\nmaximally entangled, state described in the coupled representation by |T0 i = | ⇑⇓ + ⇓⇑i.\nWe are interested in investigating the dynamics of entanglement of this state (dynamics of\nentanglement and its non-monoticity behavior has been studied in many works, for example\nsee Ref. [40] and references therein). For that purpose we evaluate the correlators\nCij (t) = hn|Ŝi (t)Ŝj (t)|ni,\n\ni, j = x, y, z\n\n(2)\n\nwhere |ni is the total system (two electrons and nuclei) state given by |T0 i|{Iiz }i and Ŝi (t) =\n\neitĤ Ŝi e−itĤ . The initial state |ni is an eigenstate of the Hamiltonian\n\n2\n2\nX\nX\n1\nĤ0 = Jz Ŝ1z Ŝ2z + Jl (Ŝ1+ Ŝ2− + Ŝ1− Ŝ2+ ) + ǫz\nŜiz ,\nŜiz + ĥ2N z\n2\ni=1\ni=1\n\n(3)\n\nwith an eigenenergy ǫn = −Jz /4 + Jl /2, where ǫz = gμB Bz , consequently we can expand in\n\nthe perturbation (where we use the fact that for a typical nuclear configuration A2k /h2n << 1\n\nwhich acts as our expansion parameter as can be noticed in the coming calculations [18, 46])\nV̂ =\n\n2\nX\ni=1\n\n(Ŝi+ ĥ2N − + Ŝi− ĥ2N + ),\n\n(4)\n\nwhere the total Hamiltonian Ĥ = Ĥ0 + V̂ . Using the time evolution operator Û (t) =\nT̂ exp[−it\n\nRt\n0\n\ndt′ V̂ (t′ )], where T̂ is the usual time-ordering operator, we obtain\n(0)\n\nCij (t) = Cij + Cij (t)\n\n(5)\n\n(0)\n\nwhere Cij is the correlator corresponding to V̂ = 0, while Cij (t) is corresponding to the\ncorrections due to the perturbation V̂ and are given by\n(0)\n\nCij = hn|Ŝi Ŝj |ni\n\n(6)\n\nand\nCij (t) = hn|Û † (t)Ŝi (t)Û (t)Û † (t)Ŝj (t)Û |ni\n=\n\nX\nk1\n\nhn|Û † (t)Ŝi (t)Û (t)|k1 ihk1|Û † (t)Ŝj (t)Û |ni\n\n+\n\nX\n\nhn|Û † (t)Ŝi (t)Û (t)|k2 ihk2|Û † (t)Ŝj (t)Û |ni\n\nk2\n\n6\n\n(7)\n\n\fwhere the intermediate state |k1 >= |T+1 i|{Izi }i = | ⇑⇑i|{* * *, Izk1 = −1/2, * * *}i and\n\n|k2 >= |T−1 i|{Izi }i = | ⇓⇓i|{* * *, Izk2 = +1/2, * * *}i, while for the singlet state |S0 i we have\nhT0 |V̂ |S0 i = 0. The non-vanishing correlators to the leading order in V̂ read\n1 1\nz\nS12\n= hn|Ŝ1z Ŝ2z |ni = − + (Γ1 (t) + Γ2 (t)) ,\n4 4\n1\n,\n4\n1\ny\nS12\n= hn|Ŝ1y Ŝ2y |ni = ,\n4\n1\nM1z = hn|Ŝ1z |ni = (Γ1 (t) − Γ2 (t)) ,\n2\n1\nM2z = hn|Ŝ2z |ni = (Γ1 (t) − Γ2 (t)) ,\n2\nx\nS12\n= hn|Ŝ1x Ŝ2x |ni =\n\n(8)\n(9)\n(10)\n(11)\n(12)\n\nwhere\n\n|Vn,ki |2\nΓi (t) = 4\nsin2 (ωn,ki t/2) ,\ni = 1, 2\n(13)\n2\nωn,ki\nki\n√\nwhere Vn,k1 = hn|V̂ |k1 i = Ak1 / 2 is the matrix element between initial state |ni = |T0 i|{* *\n√\n*, Izk1 = 1/2, * * *}i and the intermediate state |k1i and Vn,k2 = Ak2 / 2 is between |ni =\nX\n\n|T0 i|{* * *, Izk2 = −1/2, * * *}i and |k2i and\nωn,k1 = ǫn − ǫk1 = [\n\n1\n1\nJ\n− (ǫz + (hz )2n )] − Ak1 ≡ ω− − Ak1 ,\n2\n2\n2\n\n(14)\n\nωn,k2 = ǫn − ǫk2 = [\n\nJ\n1\n1\n+ (ǫz + (hz )2n )] + Ak2 ≡ ω+ + Ak2 ,\n2\n2\n2\n\n(15)\n\nwhere J = Jl −Jz is the exchange interactions difference due to the anisotropy of the coupling\nand (hz )2n = hn|h2N z |ni ≃ hn|\n\nP\n\ni6=ki\n\nIzi |ni. We will use h2n instead of (hz )2n from now on for\n\nsimplicity. As a result of the large value of N, we can replace the sum over ki by integrals\n(\n\nP\n\nki\n\nR\n\nFki = 1/v0 F (r) + O(1/N)) and we obtain\nΓ1 (t) =\n\n1\n[I0 − I1 cos(ω− t) − I2 sin(ω− t)] ,\n2\nω−\n\n(16)\n\nΓ2 (t) =\n\n1\n[I0 − I1 cos(ω+ t) + I2 sin(ω+ t)] ,\n2\nω+\n\n(17)\n\nwhere\n1\nI0 =\nv0\nI1 =\n\nZ\n\ndxdydz[A(x, y, z)t]2 ,\n\n1 Z\ndxdydz[A(x, y, z)]2 cos[A(x, y, z)t/2] ,\nv0\n7\n\n(18)\n(19)\n\n\fI2 =\n\n1\nv0\n\nZ\n\ndxdydz[A(x, y, z)]2 sin[A(x, y, z)t/2] ,\n\n(20)\n\nand where\nA(x, y, z) = Av0 |ψ(x, y, z)|2 .\n\n(21)\n\n|ψ(x, y, z)|2 is the two electrons envelope antisymmetric wave-function which we construct\nstarting from the two single state wave functions (which is the typical wave function used\nto describe the electron state in the confining potential of a quantum dot system [17, 18])\n2 /a2\n\nφ1 (x1 , y1 , z1 ) = e−(x1 −b)\n\n2 /a2\n\nφ2 (x2 , y2 , z2 ) = e−(x2 +b)\n\n2\n\n2\n\n2\n\n2\n\ne−y1 /a e−z1 /az ,\n2\n\n2\n\n2\n\n2\n\ne−y2 /a e−z2 /az\n\n(22)\n\nwhich are mixed to obtain an antisymmetric wave function ψ(x1 , y1 , z1 ; x2 , y2 , z2 ). Finally\nintegrating out the coordinates of one of the two electrons, squaring and normalizing we\nobtain\n|ψ(x, y, z)|2 =\n\n√\n\nπ 3/2 a2 az\n\n2\n2\n2\n2\n2\n2\n2\n2\n2\ne−2y /a e−2z /az e−2x /a [cosh(4bx/a2 ) − e−2b /a ] , (23)\n2\n2\nsinh(2b /a )\n\nwhere 2b is the interdot distance. In our calculations we set b = a/2. The integrals I0 , I1\nand I2 were evaluated numerically.\n\nIII.\n\nEVALUATING THE ENTANGLEMENT OF FORMATION\n\nIn this paper we investigate the time evolution of two-spin entangled state by calculating\nthe entanglement of formation E between them. The concept of entanglement of formation\nis related to the amount of entanglement needed to obtain the maximum entanglement state\nρ, where ρ is the density matrix in the two-spin uncoupled representation basis. It was shown\nby Wootters[48] that\nE(ρ) = E(C(ρ)),\nwhere the function E is given by\nE = h(\n\n1+\n\n√\n\n1 − C2\n),\n2\n\n(24)\n\n(25)\n\nwhere h(x) = −xlog2 x − (1 − x)log2 (1 − x) and the concurrence C is defined as\nC(ρ) = max{0, λ1 − λ2 − λ3 − λ4 }.\n8\n\n(26)\n\n\fFor a general state of two qubits, λi 's are the eigenvalues, in decreasing order, of the Hermitian matrix\nR≡\n\nq√\n\nρ ρ̃\n\n√\n\nρ,\n\n(27)\n\nwhere ρ̃ is the spin-flipped state of the density matrix ρ, and defined as\nρ̃ = (σy ⊗ σy )ρ∗ (σy ⊗ σy ).\n\n(28)\n\nwhere ρ∗ is the complex conjugate of ρ.\nAlternatively, the λi 's are the square roots of the eigenvalues of the non-Hermitian ρρ̃.\nSince the density matrix ρ follows from the symmetry properties of the Hamiltonian, the ρ\nmust be real and symmetrical[49], plus the symmetric property in X and Y direction in our\nsystem ,we obtain\n\n\nρ=\n\n\n\n\n\n\n\n\n\n\n\nρ1,1\n\n0\n\n0\n\n0 ρ2,2 ρ2,3\n0 ρ2,3 ρ3,3\n0\n\n0\n\n\n\n0 \n\n0 \n\n.\n\n0 \n\n\n0 ρ4,4\n\n(29)\n\n\n\nThe λi 's can be written as\nλa = λb =\n\n√\n\n√\n√\nρ1,1 ρ4,4 , λc = | ρ2,2 ρ3,3 + |ρ2,3 ||, λd = | ρ2,2 ρ3,3 − |ρ2,3 ||.\n\n(30)\n\nUsing the definition < A >= T r(ρA), we can express all the matrix elements in the\ndensity matrix in terms of the different spin-spin correlation functions [47, 50]:\n\n1\n1\n1\nz\nρ1,1 = M1z + M2z + S12\n+ ,\n2\n2\n4\n\n(31)\n\n1\n1\n1\nz\n+ ,\nρ2,2 = M1z − M2z − S12\n2\n2\n4\n1\n1\n1\nz\nρ3,3 = − M1z + M2z − S12\n+ ,\n2\n2\n4\n1\n1\n1\nz\n+ ,\nρ4,4 = − M1z − M2z + S12\n2\n2\n4\n\n(33)\n\ny\nx\nρ2,3 = S12\n+ S12\n,\n\n(35)\n\n9\n\n(32)\n\n(34)\n\n\fNote that if the sign of J is inverted (i.e. J → −J), ω+ → −ω− and vice versa and as\na result Γ1 and Γ2 exchange their expressions (Γ1 ↔ Γ2 ). The only physical quantities that\nare affected by this sign flip are M1z and M2z (Eqs. (11), (12)) which flip sign as well. Despite\nthese sign flips the eigenvalues of the matrix R given by Eq. 30 are not affected because\nunder this sign change the density matrix elements ρ1,1 ↔ ρ4,4 and ρ2,2 ↔ ρ3,3 whereas the\nother elements are invariant.\n\nIV.\n\nRESULTS AND DISCUSSIONS\n\nIn this paper, we focus on the dynamic behavior of entanglement of two coupled electron spins under different external magnetic field strengths and at different values of the\nHeisenberg exchange interactions difference J. Interestingly, the entanglement is independent of the sign of the exchange interaction difference J, as was explained in sec. 3, which\nmeans that regardless of which coupling component is dominant (Jl or Jz ) the behavior of\nthe entanglement as a function of J stays the same. Firstly, we study the nuclear-induced\ntime evolution of entanglement in absence of external magnetic field and with a very small\nanisotropy in the exchange interaction. In fig. 1, we plot the entanglement of two quantum\ndots versus time with J = A/5000 and ǫz = 0. The initial state of the coupled quantum\ndot is triplet\n\n√1 (|\n2\n\n⇑⇓i + | ⇓⇑i), where the two spins are maximally entangled. As shown\n\nin fig. 1, the entanglement is initially maximum (E=1). Once the interaction between the\nnuclear magnetic field and quantum dots is turned on, the entanglement starts decaying\nwith a rapid oscillation and reaches a saturation value of about 0.921 within a decay time\nof the order of 10−4 s. As can be noticed the envelope of this oscillating entanglement decreases with a power law profile under this condition before reaching saturation. From the\nprocess of constructing the density matrix to calculate the entanglement, the entanglement,\nmagnetization and spin correlations are directly related. We plot the time evolution of the\nz\nspin correlation function in the z-direction S12\nin the inner panel. The correlation function\n\nexhibits a very similar behavior to that of the entanglement, it begins with a maximum\nvalue, -0.25, then decays to a saturation value of about -0.236 within the same decay time.\nUnder the first order perturbation theory, the spin correlations in x and y directions are\nunaffected by nuclear spins. This leads to the higher saturation value of entanglement in\nour calculation, which may change at higher orders. Furthermore, because of the initial\n10\n\n\funpolarized state for the nuclear spins and absence of external magnetic field, the magnetization of the two quantum dots remains zero. The effect of the external magnetic field with\na very small anisotropy in exchange coupling between the two spins is shown in fig. 2 where\nǫz is set to be A/50 >> h2n and J = A/5000. The entanglement evolves with a similar\ndecaying behavior to what we have observed in fig. 1 except that the decaying amplitude of\noscillation is much smaller and the saturation value, for both entanglement and correlation,\nis much higher (0.99935 and -0.24989 respectively), which emphasis the important role the\nexternal magnetic field plays, as expected, significantly enhancing the entanglement between\nthe two spins. In fig. 3, we focus on the role played by exchange interaction difference J.\nThe dynamics of entanglement is considered at different values of J at two different specific\nexternal magnetic fields, zero and A/50. In the two panels, J is set to be A/150 and A/130\nin the upper and lower panels respectively. Interestingly, comparing with fig. 1, the saturation value of the entanglement increases, from 0.92 to 0.997, as we increase J from A/5000\nto A/150 but then decreases back, to 0.93, as we increase J further to A/130. This indicates\nthat the larger J does not always help maintaining the entanglement between the two spins,\ni.e. the entanglement is not a monotonic function of J. Obviously, there is an inversion point\nof E between these values of J. The effect of the magnetic field is clear in the three case,\nit suppresses the amplitude of the decaying oscillation and enhances the entanglement as a\nresult of its polarizing effect, giving raise to a higher saturation value in the three cases.\nIn fact, the entanglement shows very similar behavior at different magnitudes of the external magnetic field and exchange interaction difference, however the asymptotic saturation\nvalues and decay rates vary significantly based on the values of J and ǫz . In principle, each\nelectron spin is in a precession motion about two fields, magnetic which is uniform and\nthe non-uniform nuclear field. This precession motion is the reason behind the oscillatory\nbehavior of the entanglement, whereas coupling to the non-uniform nuclear field is responsible for the decay where the spin energy is dissipated to the nuclear environment (the same\nbehavior was discussed in detail in Ref. [18] for a single spin on a single dot). Therefore,\nit is of great interest to study the mutual effect of the exchange interaction difference and\nthe external magnetic field on the entanglement. The phase diagram of the system is shown\nin fig. 4 where The saturation value of entanglement is plotted versus J at different values\nof the external magnetic field. As the entanglement mostly reaches its saturation value at\nt ∼ 10−4 s, we use the value of E at t = 10−4 to approximately represent the saturation\n11\n\n\fvalue at each J. There are three pairs of curves with each pair corresponding to a specific\nvalue of the external magnetic field given by, from left to right, A/50, A/500, 0. The pair\nof curves corresponding to ǫz = A/50 are replotted in the inner panel for clarity. It is very\ninteresting to note that for each ǫz the behavior of the entanglement is almost symmetric\nabout a critical value of J, we call it Jc . On each pair, the entanglement saturation value\nis initially unity or very close to unity ,depending on the external magnetic field strength,\nthen starts to decrease as J increases. It decays exponentially as J approaches Jc but once J\nexceeds Jc it raises up exponentially again reaching a value of unity or close. The decay rate\nof the entanglement saturation value for J > Jc is more rapid than J < Jc but they become\nmore symmetric as ǫz increases. Surprisingly, this phase diagram shows a very peculiar role\nplayed by the exchange interaction difference, namely that small values (J << Jc ) and great\nvalues as well (J >> Jc ) enhances the entanglement between the two spins, while as J → Jc\nit is reduced significantly.\nUnfortunately, we can not investigate the entanglement behavior when J is very close or\nequal to Jc because the system diverges under this condition. The reason for this divergence\nis the degeneracy (electronic levels crossing) that takes place between the initial state and\nthe intermediate states which causes a break down of the first-order perturbation theory.\nThis degeneracy is manifested in fig. 5, where the energy difference ωn,k1 between the initial\nstate |ni and the first intermediate state |k1 i and the difference ωn,k2 between |ni and |k2 i\n(given by Eqs. 14 and 15) are plotted versus the exchange interaction difference J for chosen\nh2n = A/500 and ǫz = A/50. As can be seen in fig. 5, ωn,k1 vanishes at a particular value\nof J which turns out to be the same as Jc observed in the inner panel in fig. 4 where\nthe same values of parameters are used in that case. Since ωn,k1 appears squared in the\ndenominator of the first order perturbation term (Eq. 13), it is responsible for the divergence\nwhen it vanishes. Also, the symmetric behavior of the entanglement about Jc is due to the\nlinear dependence of the magnitude of ωn,k1 on J as it increases or decreases away from Jc .\nSimilarly, ωn,k2 may cause the same effect if negative values of J were considered. The value\nof the critical exchange interaction Jc corresponding to each ǫz can be easily deduced from\nthe phase diagram to be equal to 2(h2n + ǫz ) coinciding with the observations of fig. 5, which\nemphasis that the external magnetic field does not only enhance the entanglement but also\ndictates the value of Jc .\nAfter the important observations from the phase diagram (fig. 4), in particular concerning\n12\n\n\fthe entanglement critical behavior upon varying J, it is interesting to further investigate the\neffect of J on the entanglement above, below and close to Jc at a fixed value of the external\nmagnetic field. Therefore, the dynamics of entanglement at different exchange interaction\nvalues below Jc in fig. 6 and above it in fig. 7 is examined. Where ǫz is set to be A/100\nand consequently Jc turns out to be A/41.7. In fig. 6 we consider the exchange interaction\nvalues A/45, A/50 and A/55 (< Jc ) whereas in fig. 7 A/40, A/37 and A/35 (> Jc ). As we\ncan see in the two graphs, when the value of J is far from Jc , either higher or lower, the\nentanglement oscillation is small and the decay rate is slow reaching high saturation values\nthat approach unity as J becomes much smaller or much higher than Jc . As J gets very close\nto Jc the entanglement exhibits very rapid oscillation with very large initial amplitude and\ndecays very rapidly as well reaching a low saturation value, 0.74, for J < Jc and very low one,\n0.22, for J > Jc . The contrast between those values gets smaller and smaller with increasing\nthe magnetic field as can be noticed from the phase diagram (fig. 4). To compare the decay\nrates of entanglement at different J values, the corresponding entanglement decay profiles\nare plotted in the inner panels in figs. 6 and 7. As shown, the decay profiles are linear when\nJ is much higher (or lower) than Jc converting to a power-law and then to a Gaussian as J\ngets closer to Jc from above or below. The critical behavior of the entanglement based on\nthe strength of J points out that there is a competition between the effects of the external\nmagnetic field, which enhances the entanglement through polarizing the two spins in its\ndirection, and the exchange interaction difference, which enhances the entanglement on the\nother hand by favoring anti-ferromagnetic correlation. Therefore when one of the two effects\nis dominant, i.e. J << ǫz (or >> ǫz ), there will be a large net correlation one way or the\nother leading to strong entanglement. Tuning the two effects to be comparable reduces the\nnet correlation significantly and forces the entanglement to attenuate to a low value.\n\nV.\n\nCONCLUSIONS\n\nIn Summary, we study the time evolution of entanglement of two electron spins in\nanisotropically coupled quantum dot under coupling with nuclear spins in an applied external magnetic field in the triplet (S = 1) subspace. Our main observations is that the dynamics of entanglement exhibits a critical behavior determined by the competition between\nthe value of the exchange interaction difference between the two spins and the strength of the\n13\n\n\fexternal applied magnetic field. When one of them dominates, the entanglement saturates\nto a very large value close to the maximum. On the other hand, when they are comparable\nthe entanglement attenuates and may reach very low saturation values. We found that for\neach fixed value of the external magnetic field there is a corresponding critical value of the\nexchange interaction difference where the entanglement between the two spins as a function\nof the exchange interaction exhibits symmetrical behavior about it. When we studied the\ntime evolution of the entanglement at values of the exchange interaction difference above and\nbelow the critical value, we observed that the entanglement decay profiles are linear when\nthe exchange interaction value is much higher or lower than the critical value and saturates\nto large values but then converts to a power law and finally to a Gaussian as it approaches\nthe critical value from above or below reaching low saturation values. The system diverges\nwhen the exchange interaction value becomes very close or equal to the critical value which\nmight be a sign of a critical behavior taking place in the environment consisting of the\nnuclear spins. For an isotropic coupling the entanglement becomes absolutely independent\nof the Heisenberg exchange interaction. Our observations suggest that tunning the applied\nexternal magnetic field and (or) the exchange interaction difference between the two spins\nin such a way that they differ significantly in value may sustain the correlation between the\ntwo spins in the coupled quantum dot and lead to a strong entanglement between them.\n\nAcknowledgments\n\nThis work has been supported in part by King Saud University, College of Science Research Center, grant no. Phys2006/19. One of the authors (G.S.) would like to thank E. I.\nLashin for useful discussions.\n\nReferences\n\n[1] Nielsen M A and Chuang I L 2000 Quantum Computation and Quantum Information (Cambridge: Cambridge University Press).\n\n14\n\n\f[2] Boumeester D, Ekert A, and Zeilinger A (eds) 2000 The physics of Quantum information:\nQuantum Cryptography, Quantum Teleportation, Quantum Computing (Berlin: Springer).\n[3] Gruska J 1999 Quantum Computing (New York: McGraw-Hill).\n[4] Machhiavello C, Palma G M and Zeilinger Z 2000 Quantum Computation and Quantum Information Theory (New Jersey: World Scientific).\n[5] For a review, see Zurek W H 1991 Phys. Today 44 36.\n[6] Shor P W 1994 Proc. of the 35th Ann. Symp. on Foundations of Computer Science ed Goldwasser S (Los Alamitos: IEEE Computer Society Press).\n[7] Grover L K 1997 Phys. Rev. Lett. 79 325.\n[8] Barenco Adriano, Deutsch David, Ekert Artur and Jozsa Richard 1995 Phys. Rev. Lett. 74\n4083.\n[9] Vandersypen L M K, Steffen Matthias, Breyta Gregory, Yannoni Costantino S, Sherwood\nMark H, and Chuang Isaac L 2001 Nature 414 883.\n[10] Chuang Isaac L, Gershenfeld Neil A, and Kubinec Mark 1998 Phys. Rev. Lett. 80 3408.\n[11] Jones J A, Mosca M, and Hansen R H 1998 Nature 393 344.\n[12] Cirac J I and Zoller P 1995 Phys. Rev. Lett. 74 4091; Monroe C, Meekhof D M, King B E,\nItano W M and Wineland D J 1995 75 4714.\n[13] Turchette Q A, Hood C J, Lange W, Mabuchi H and Kimble H J 1995 Phys. Rev. Lett. 75\n4710.\n[14] Averin D V 1998 Solid State Commun. 105 659; Shnirman A, Schon G, and Hermon Z 1997\nPhys. Rev. Lett. 79 2371.\n[15] Loss D and DiVincenzo D P 1998 Phys. Rev. A 57 120.\n[16] Destefani C F, Ulloa Sergio E, and Marques G E 2004 Phys. Rev. B 70 205315.\n[17] Burkard G, Loss Daniel and DiVincenzo David P 1999 Phys Rev. B 59 2070.\n[18] Khaetskii A, Loss Daniel and Glazman Leonid 2002 Phys Rev. Lett. 88 186802; Khaetskii A,\nLoss Daniel and Glazman Leonid 2003 Phys. Rev. B 67, 195329.\n[19] Kroutfar M, Ducommun Yann, Heiss Dominik, Bichler Max, Schuh Dieter, Abstreiter Gerhard\nand Finley Jonathan J 2004 Nature (London) 432 81.\n[20] Elzerman J M, Hanson R, Beveren L H Willems van, Witkamp B, Vandersypen L M K and\nKouwenhoven L P 2004 Nature (London) 430 431.\n[21] Florescu M and Hawrylak P 2006 Phys. Rev. B 73 045304.\n\n15\n\n\f[22] Golovach Vitaly N, Khaetskii Alexander, and Loss Daniel 2004 Phys Rev. Lett 93 016601.\n[23] Coish W A and Loss Daniel 2004 Phys. Rev. B 70 195340.\n[24] Shenvi Neil, de Sousa Rogerio, and Whaley K B 2005 Phys. Rev. B 71 144419.\n[25] Klauser D, Coish W A, and Loss Daniel 2006 Phys. Rev. B 73 205302.\n[26] Deng Changxue and Hu Xuedong 2006 Phys. Rev. B 73 241303(R).\n[27] Huttel A K, Weber J, Holleitner A W, Weinmann D, Eberl K and Blick R H 2004 Phys. Rev.\nB 69 073302.\n[28] Tyryshkin A M, Lyon S A, Astashkin A V, and Raitsimring A M 2003 Phys. Rev. B 68\n193207.\n[29] Abe Eisuke, Itoh Kohei M, Isoya Junichi, and Yamasaki Satoshi 2004 Phys. Rev. B 70 033204.\n[30] Johnson A C, Petta J R, Taylor J M, Yacoby A, Lukin M D, Marcus C M, Hanson M P and\nGossard A C 2005 Nature 435 925.\n[31] Koppens F H L, Folk J A, Elzerman J M, Hanson R, Beveren L H Willems van, Vink I T,\nTranitz H P, Wegscheider W, Kouwenhoven L P and Vandersypen L M K 2005 Science 309\n1346.\n[32] Petta J R, Johnson A C, Taylor J M, Laird E A, Yacoby A, Lukin M D, Marcus C M, Hanson\nM P and Gossard A C 2005 Science 309 2180.\n[33] Chiaverini J, Britton J, Leibfried D, Knill E, Barrett M D, Blakestad R B, Itano W M, Jost\nJ D, Langer C, Ozeri R, Schaetz T, and Wineland D J 2005 Science 308 997.\n[34] Vion D, Aassime A, Cottet A, Joyez P, Pothier H, Urbina C, Esteve D and Devoret M H 2002\nScience 296 886.\n[35] Coish W A and Loss Daniel 2005 Phys. Rev. B 72 125337.\n[36] Klauser D, Coish W A and Loss Daniel 2006 Phys. Rev. B 73 205302.\n[37] Huang Z, Sadiek G and Kais S 2006 J. Chem. Phys. 124 144513.\n[38] Blaauboer M and DiVincenzo D P 2005 Phys. Rev. Lett 95 160402.\n[39] K. V. Kavokin 2001 Phys. Rev. B 64 075305.\n[40] S. C. Badescu, Y. Lyanda-Geller and T. L. Reinecke 2005 AIP Conference Proceedings 772\n763.\n[41] O. Olendski and T. V. Shahbazyan 2007 Phys. Rev. B 75 041306(R).\n[42] Mircea Trif, Vitaly N. Golovach and Daniel Loss 2007 Phys. Rev. B 75 085307.\n[43] L. A. Wu and D. A. Lidar 2002 Phys. Rev. A 65 042318.\n\n16\n\n\f[44] Aian-Ao Wu and Daniel A. Lidar 2002 Phys. Rev. B 66 062314.\n[45] D. Stepanenko and N. E. Bonesteel 2004 Phys. Rev. L 93 140501.\n[46] Dyakonov M I and Perel V I 1984 Optical Orientation ed Meier F and Zakharchenya B P\n(Amsterdam: North-Holland) p 11.\n[47] Huang Z and Kais S 2006 Phys. Rev. A 73, 022339.\n[48] Wootters W K 1998 Phys. Rev. Lett. 80 2245.\n[49] Osterloh A, Amico L, Falci G, and Fazio Rosario 2002 Nature 416 608.\n[50] Huang Z and Kais S 2005 Int. J. Quant. Information 3 483.\n\n17\n\n\f1\n\n−0.22\n\nz\n\n0.98\n\nS12\n\n−0.23\n−0.24\n\n0.96\n−0.25\n\n0\n\n1\nt (s)\n\n0.94\n\n2\n−4\n\nx 10\n\n0.92\n\nE\n\n0.9\n0.88\n0.86\n0.84\n0\n\n1\n\nt (s)\n\n2\n−4\n\nx 10\n\nFIG. 1: Time evolution of entanglement and spin correlation in z-direction in absence of external\nmagnetic field and for very small anisotropy J = A/5000. The nuclear magnetic field h2n = A/500,\nwhere A is the hyperfine constant.\n\n18\n\n\f1\n0.9998\n0.9996\n\nE\n\n0.9994\n0.9992\n\n−0.2497\n\nSz12\n\n−0.2498\n\n0.999\n\n−0.2499\n−0.25\n\n0.9988\n0.9986\n0\n\n0\n\n1\nt (s)\n\n2\n−4\n\nx 10\n\n1\n\nt (s)\n\n2\n−4\n\nx 10\n\nFIG. 2: Time evolution of entanglement and spin correlation in the z-direction for very small\nanisotropy J = A/5000 with a large external magnetic field ǫz = A/50 >> h2n .\n\n19\n\n\fE\n\n0.998\n0.996\n\nE\n\n0.994\n1\n0.95\n0.9\n0.85\n0\n\nε = A/50\nz\n\nε =0\nz\n\nJ=A/150\n\nεz = A/50\nε =0\nz\n\nJ=A/130\n\n1\n\nt (s)\n\n2\nx 10\n\n4\n\nFIG. 3: Dynamics of entanglement at different exchange interaction differences A/150, and A/130\nwith the external magnetic field ǫz set at 0 and A/50.\n\n20\n\n\f1\nεz =A/500\n\n0.8\nε =0\n\nε = A/50\n\nz\n\n0.6\n\nz\n\n1\n\nE\n\n0.8\n0.6\nE\n\n0.4\n\n0.4\n0.2\n\n0.2\n\n0\n10\n\n20\n\n30\n\n40\n\nA/J\n\n0\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nA/J\nFIG. 4: The phase diagram of entanglement. The saturation value of the entanglement is plotted vs.\nthe exchange interaction difference J at different values of the external magnetic field ǫz = 0, A/500,\nand A/50. The case corresponding to ǫz = A/50 is replotted in the inner panel to demonstrate the\nsymmetric behavior of E at high external magnetic field.\n\n21\n\n\fωn,k2\n\n0.06\n\n0.04\n\nω/Α\n\nω\n\n0.02\n\nn,k1\n\n0.0\n\n0.02\n\n0.04\n\n0.06\n\n0.08\n\n0.1\n\nJ/Α\n\nFIG. 5: The energy differences ωn,k1 (solid line) and ωn,k2 (dashed line) are plotted versus the\nexchange interaction difference J for chosen h2n = A/500 and ǫz = A/50.\n\n22\n\n\f1\n0.9\n\nJ=A/55\n\nJ=A/50\n\n0.8\n\nJ=A/45\n\nE\n\n0.7\n\n1\n\n0.6\n0.5\n\nE\n\n0.9\n\n0.8\n\n0.4\n0.3\n\n0.7\n\n0.2\n0\n\n0\n\n1\nt (s)\n\n2\n−4\n\nx 10\n\n1\n\nt (s)\n\n2\n−4\n\nx 10\n\nFIG. 6: Dynamics of entanglement with the external magnetic field fixed at ǫz = A/100 while the\nexchange interaction difference J is set at values below the critical value (Jc = A/41.7), J = A/45,\nA/50 and A/55. The inner panel shows the corresponding entanglement decay profiles.\n\n23\n\n\f1\n1\n\nJ=A/35\nJ=A/37\n\n0.8\nE\n\n0.8\n\n0.6\n\n0.6\n\nE\n\n0.4\n0.2\n\n0.4\n\n0\n\n1\nt (s)\n\n2\n−4\n\nx 10\n\n0.2\nJ=A/40\n0\n0\n\n1\n\nt (s)\n\n2\n−4\n\nx 10\n\nFIG. 7: Dynamics of entanglement with the external magnetic field fixed at ǫz = A/100 while the\nexchange interaction difference J is set at values above the critical value (Jc = A/41.7), J = A/35,\nA/37 and A/40. The inner panel shows the corresponding entanglement decay profiles.\n\n24\n\n\f"}