{"id": "http://arxiv.org/abs/cond-mat/0003159v1", "guidislink": true, "updated": "2000-03-09T19:26:28Z", "updated_parsed": [2000, 3, 9, 19, 26, 28, 3, 69, 0], "published": "2000-03-09T19:26:28Z", "published_parsed": [2000, 3, 9, 19, 26, 28, 3, 69, 0], "title": "Solid-phase structures of the Dzugutov pair potential", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0003195%2Ccond-mat%2F0003091%2Ccond-mat%2F0003120%2Ccond-mat%2F0003271%2Ccond-mat%2F0003498%2Ccond-mat%2F0003130%2Ccond-mat%2F0003227%2Ccond-mat%2F0003025%2Ccond-mat%2F0003057%2Ccond-mat%2F0003135%2Ccond-mat%2F0003049%2Ccond-mat%2F0003223%2Ccond-mat%2F0003269%2Ccond-mat%2F0003449%2Ccond-mat%2F0003136%2Ccond-mat%2F0003017%2Ccond-mat%2F0003282%2Ccond-mat%2F0003243%2Ccond-mat%2F0003145%2Ccond-mat%2F0003144%2Ccond-mat%2F0003074%2Ccond-mat%2F0003053%2Ccond-mat%2F0003063%2Ccond-mat%2F0003071%2Ccond-mat%2F0003340%2Ccond-mat%2F0003486%2Ccond-mat%2F0003194%2Ccond-mat%2F0003042%2Ccond-mat%2F0003160%2Ccond-mat%2F0003052%2Ccond-mat%2F0003254%2Ccond-mat%2F0003457%2Ccond-mat%2F0003399%2Ccond-mat%2F0003211%2Ccond-mat%2F0003367%2Ccond-mat%2F0003262%2Ccond-mat%2F0003297%2Ccond-mat%2F0003453%2Ccond-mat%2F0003177%2Ccond-mat%2F0003115%2Ccond-mat%2F0003252%2Ccond-mat%2F0003313%2Ccond-mat%2F0003306%2Ccond-mat%2F0003141%2Ccond-mat%2F0003182%2Ccond-mat%2F0003375%2Ccond-mat%2F0003349%2Ccond-mat%2F0003289%2Ccond-mat%2F0003333%2Ccond-mat%2F0003295%2Ccond-mat%2F0003310%2Ccond-mat%2F0003139%2Ccond-mat%2F0003050%2Ccond-mat%2F0003164%2Ccond-mat%2F0003220%2Ccond-mat%2F0003443%2Ccond-mat%2F0003187%2Ccond-mat%2F0003090%2Ccond-mat%2F0003423%2Ccond-mat%2F0003085%2Ccond-mat%2F0003348%2Ccond-mat%2F0003006%2Ccond-mat%2F0003237%2Ccond-mat%2F0003517%2Ccond-mat%2F0003138%2Ccond-mat%2F0003266%2Ccond-mat%2F0003084%2Ccond-mat%2F0003260%2Ccond-mat%2F0003235%2Ccond-mat%2F0003153%2Ccond-mat%2F0003109%2Ccond-mat%2F0003189%2Ccond-mat%2F0003171%2Ccond-mat%2F0003012%2Ccond-mat%2F0003458%2Ccond-mat%2F0003437%2Ccond-mat%2F0003444%2Ccond-mat%2F0003329%2Ccond-mat%2F0003422%2Ccond-mat%2F0003389%2Ccond-mat%2F0003032%2Ccond-mat%2F0003206%2Ccond-mat%2F0003321%2Ccond-mat%2F0003283%2Ccond-mat%2F0003070%2Ccond-mat%2F0003066%2Ccond-mat%2F0003232%2Ccond-mat%2F0003200%2Ccond-mat%2F0003159%2Ccond-mat%2F0003190%2Ccond-mat%2F0003180%2Ccond-mat%2F0003197%2Ccond-mat%2F0003270%2Ccond-mat%2F0003299%2Ccond-mat%2F0003278%2Ccond-mat%2F0003216%2Ccond-mat%2F0003302%2Ccond-mat%2F0003357%2Ccond-mat%2F0003068%2Ccond-mat%2F0003155%2Ccond-mat%2F0003426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Solid-phase structures of the Dzugutov pair potential"}, "summary": "In recent computer simulations of a simple monatomic system interacting via\nthe Dzugutov pair potential, freezing of the fluid into an equilibrium\ndodecagonal quasicrystal has been reported [M. Dzugutov, Phys. Rev. Lett. 70,\n2924 (1993)]. Here, using a combination of molecular dynamics simulation and\nthermodynamic perturbation theory, we conduct a detailed analysis of the\nrelative stabilities of solid-phase structures of the Dzugutov-potential\nsystem. At low pressures, the most stable structure is found to be a bcc\ncrystal, which gives way at higher pressures to an fcc crystal. Although a\ndodecagonal quasicrystal and a sigma-phase crystal compete with the bcc crystal\nfor stability, they remain always metastable.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0003195%2Ccond-mat%2F0003091%2Ccond-mat%2F0003120%2Ccond-mat%2F0003271%2Ccond-mat%2F0003498%2Ccond-mat%2F0003130%2Ccond-mat%2F0003227%2Ccond-mat%2F0003025%2Ccond-mat%2F0003057%2Ccond-mat%2F0003135%2Ccond-mat%2F0003049%2Ccond-mat%2F0003223%2Ccond-mat%2F0003269%2Ccond-mat%2F0003449%2Ccond-mat%2F0003136%2Ccond-mat%2F0003017%2Ccond-mat%2F0003282%2Ccond-mat%2F0003243%2Ccond-mat%2F0003145%2Ccond-mat%2F0003144%2Ccond-mat%2F0003074%2Ccond-mat%2F0003053%2Ccond-mat%2F0003063%2Ccond-mat%2F0003071%2Ccond-mat%2F0003340%2Ccond-mat%2F0003486%2Ccond-mat%2F0003194%2Ccond-mat%2F0003042%2Ccond-mat%2F0003160%2Ccond-mat%2F0003052%2Ccond-mat%2F0003254%2Ccond-mat%2F0003457%2Ccond-mat%2F0003399%2Ccond-mat%2F0003211%2Ccond-mat%2F0003367%2Ccond-mat%2F0003262%2Ccond-mat%2F0003297%2Ccond-mat%2F0003453%2Ccond-mat%2F0003177%2Ccond-mat%2F0003115%2Ccond-mat%2F0003252%2Ccond-mat%2F0003313%2Ccond-mat%2F0003306%2Ccond-mat%2F0003141%2Ccond-mat%2F0003182%2Ccond-mat%2F0003375%2Ccond-mat%2F0003349%2Ccond-mat%2F0003289%2Ccond-mat%2F0003333%2Ccond-mat%2F0003295%2Ccond-mat%2F0003310%2Ccond-mat%2F0003139%2Ccond-mat%2F0003050%2Ccond-mat%2F0003164%2Ccond-mat%2F0003220%2Ccond-mat%2F0003443%2Ccond-mat%2F0003187%2Ccond-mat%2F0003090%2Ccond-mat%2F0003423%2Ccond-mat%2F0003085%2Ccond-mat%2F0003348%2Ccond-mat%2F0003006%2Ccond-mat%2F0003237%2Ccond-mat%2F0003517%2Ccond-mat%2F0003138%2Ccond-mat%2F0003266%2Ccond-mat%2F0003084%2Ccond-mat%2F0003260%2Ccond-mat%2F0003235%2Ccond-mat%2F0003153%2Ccond-mat%2F0003109%2Ccond-mat%2F0003189%2Ccond-mat%2F0003171%2Ccond-mat%2F0003012%2Ccond-mat%2F0003458%2Ccond-mat%2F0003437%2Ccond-mat%2F0003444%2Ccond-mat%2F0003329%2Ccond-mat%2F0003422%2Ccond-mat%2F0003389%2Ccond-mat%2F0003032%2Ccond-mat%2F0003206%2Ccond-mat%2F0003321%2Ccond-mat%2F0003283%2Ccond-mat%2F0003070%2Ccond-mat%2F0003066%2Ccond-mat%2F0003232%2Ccond-mat%2F0003200%2Ccond-mat%2F0003159%2Ccond-mat%2F0003190%2Ccond-mat%2F0003180%2Ccond-mat%2F0003197%2Ccond-mat%2F0003270%2Ccond-mat%2F0003299%2Ccond-mat%2F0003278%2Ccond-mat%2F0003216%2Ccond-mat%2F0003302%2Ccond-mat%2F0003357%2Ccond-mat%2F0003068%2Ccond-mat%2F0003155%2Ccond-mat%2F0003426&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In recent computer simulations of a simple monatomic system interacting via\nthe Dzugutov pair potential, freezing of the fluid into an equilibrium\ndodecagonal quasicrystal has been reported [M. Dzugutov, Phys. Rev. Lett. 70,\n2924 (1993)]. Here, using a combination of molecular dynamics simulation and\nthermodynamic perturbation theory, we conduct a detailed analysis of the\nrelative stabilities of solid-phase structures of the Dzugutov-potential\nsystem. At low pressures, the most stable structure is found to be a bcc\ncrystal, which gives way at higher pressures to an fcc crystal. Although a\ndodecagonal quasicrystal and a sigma-phase crystal compete with the bcc crystal\nfor stability, they remain always metastable."}, "authors": ["J. Roth", "A. R. Denton"], "author_detail": {"name": "A. R. Denton"}, "author": "A. R. Denton", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.61.6845", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0003159v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0003159v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "41 pages, 18 figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0003159v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0003159v1", "journal_reference": "Phys. Rev. E 61, 6845-6857 (2000)", "doi": "10.1103/PhysRevE.61.6845", "fulltext": "arXiv:cond-mat/0003159v1 [cond-mat.stat-mech] 9 Mar 2000\n\nSolid-phase structures of the Dzugutov pair potential\nJ. Roth, Institut für Theoretische und Angewandte Physik, Universität Stuttgart,\nPaffenwaldring 57, 70550 Stuttgart, Germany\nA. R. Denton, Department of Physics, Acadia University, Wolfville, NS, Canada B0P 1X0\n(October 22, 2018)\n\nAbstract\nIn recent computer simulations of a simple monatomic system interacting\nvia the Dzugutov pair potential, freezing of the fluid into an equilibrium\ndodecagonal quasicrystal has been reported [M. Dzugutov, Phys. Rev. Lett.\n70, 2924 (1993)]. Here, using a combination of molecular dynamics simulation\nand thermodynamic perturbation theory, we conduct a detailed analysis of the\nrelative stabilities of solid-phase structures of the Dzugutov-potential system.\nAt low pressures, the most stable structure is found to be a bcc crystal, which\ngives way at higher pressures to an fcc crystal. Although a dodecagonal\nquasicrystal and a σ-phase crystal compete with the bcc crystal for stability,\nthey remain always metastable.\nPACS numbers: 61.43.Bn, 61.44.Br, 61.50.Ah, 64.70.Dv, 64.70.Pf\n\nTypeset using REVTEX\n\n\fI. INTRODUCTION\n\nSeveral years ago [1], Dzugutov introduced a new model pair potential for the purpose\nof studying glass transitions by means of molecular dynamics (MD) simulation. Most simulations of glass transitions to date have been performed using binary mixtures, since onecomponent simple liquids, when supercooled, readily nucleate crystallites. The Dzugutov\npotential, which features a pronounced maximum at a range typical of next-nearest-neighbor\ncoordination distances in close-packed crystals, suppresses crystallization by construction,\nand thus facilitates glass formation. Following its initial successful use in studies of supercooled liquids [1,2], the Dzugutov potential was subsequently adopted in simulations of\nfreezing [3,4]. Contrary to expectations, however, the observed solid structure was determined to be, remarkably, a monatomic dodecagonal quasicrystal. The structure, also known\nas tetrahedrally or topologically close packed (tcp) [5], is of the Frank-Kasper type and is\ncomposed of layers of square-triangle tilings. In previous work, the Dzugutov potential and\nthe associated dodecagonal structure have been used to study self-diffusion in quasicrystals [6].\nThe motivation for the present work stems primarily from our interest in the nucleation\nand stability of quasicrystal phases. Further motivation comes from the realm of colloid\nphysics, where, given the extreme tunability of colloidal interparticle interactions, it is conceivable that a Dzugutov-like pair potential might be engineered to produce bulk samples of\none-component quasicrystals [7]. The main purpose of the study reported here is to chart,\nby means of both MD simulation and thermodynamic perturbation theory, the fluid-solid\nphase diagram of the Dzugutov-potential system.\nThe paper is organized as follows. In Section II, after specifying the pair potential,\nwe give details of the simulation methods, and describe our analyses of the resulting solid\nstructures. Section III outlines the theoretical methods used, while Section IV characterizes\nthe quasicrystal and other structures of interest. In Section V we present results – from both\nsimulation and theory – for relative stabilities of competing solid structures. Among our\n\n\fmain results, we find that (1) at low temperatures and pressures, the stable solid structure\nis the bcc crystal; (2) at high pressures, the stable solid is the fcc crystal; and (3) the stable\nground state (T = 0) is never the dodecagonal quasicrystal, but rather a periodic crystal\nwhose structure depends on the pressure. Finally, in Section VI we summarize and discuss\nimplications of the results for future work.\n\nII. MOLECULAR DYNAMICS SIMULATIONS\n\nA. The Interaction\n\nThe Dzugutov pair potential [2], plotted in Fig. 1, is defined by\nΦ(r) = Φ1 (r) + Φ2 (r),\n\n(1)\n\nwhere\nΦ1 (r) =\nand\n\n\n\n\n\n\n\n\n\nc\nA(r −m − B) exp r −\na ,\n\u0010\n\nr<a\n\n0,\n\nΦ2 (r) =\nwith the parameters:\n\n\u0011\n\n\n\u0012\n\n\n B exp\n\n\n 0,\n\nm A\n\nc\n\na\n\n\u0013\n\nd\nr−b ,\n\nB\n\n(2)\n\nr ≥ a,\n\nr<b\n\n(3)\n\nr ≥ b,\n\nd\n\nb\n\n16 5.82 1.1 1.87 1.28 0.27 1.94\nThe potential is characterized by a minimum at r = 1.13 σ of depth −0.581 ǫ, having\nthe same form as that of the Lennard-Jones potential, followed by a maximum at r = 1.63\nσ of height 0.460 ǫ. The maximum is designed to prevent the system from crystallizing into\nsimple crystal structures. Beyond the maximum the potential tends to zero continuously and\nis cut off at a range of rc = 1.94 σ, which ensures that CPU times remain within reasonable\nlimits.\n\n\fB. Simulation Method\n\nClassical isothermal (NVT) and isothermal-isobaric (NPT) MD simulations were performed using the constraint method [8]. An extension of this method allows us to introduce\nconstant temperature or pressure gradients [9]. Newton's equations of motion were integrated using a fourth-order Gear predictor-corrector algorithm (see, e.g., [8]) with a time\nq\n\nincrement of δt = 0.0005 σ m/ǫ for all simulations. Periodic boundary conditions were\napplied to an orthorhombic simulation cell, whose volume (in the NPT simulations) was\npermitted to change isotropically.\nThe sample sizes range from 54 to 1024 atoms, with the lengths of the cell along the\nthree orthogonal coordinate axes being chosen to make the sample shapes as close to cubic\nas possible. Simulations with the stable phases were carried out with samples containing 54,\n250, and 1024 atoms for bcc; 60 and 480 atoms for the σ-phase; and 108 and 500 atoms for\nfcc. Most results are reported for 250, 500, and 1024 atoms, though if not explicitly stated,\nthe sample size is irrelevant. The potential energy and enthalpy per atom were found to be\nquite insensitive to sample size.\n\nC. Structural Analysis\n\nTo analyze the structures that arise in a simulation at finite temperature, we quenched\nthe system by setting the temperature in our NPT-MD program to zero, thereby using the\nprogram as a steepest descent algorithm. Quenching forces the system to seek out its local\nenergy minimum, which facilitates structure identification.\nDzugutov [2] has pointed out that vacancies may play a major role in stabilizing quasicrystalline structures. To determine the number of vacancies in a sample, we begin by\nconstructing the Voronoi cells and their dual, the Delaunay cells, and determining from the\nlatter the distribution of free volumes in the structure. Although the free volume distribution gives a reasonable representation of the interstitial sites, it greatly overestimates the\n\n\fvacancies (by a factor of about ten). This is because the Delaunay cells are face-to-face\npacked tetrahedra, whereas the vacancies should be represented by spheres that could easily\ncover several tetrahedra. To determine the correct number of vacancies, we first select the\nDelaunay cells that are large enough to accommodate an atom and do not overlap with an\nalready existing atom. With these cells we create trees of mutually overlapping cells, the\nnodes of the tree being the centers of the Delaunay cells and the edges the distance vectors\nbetween cells too close to be filled simultaneously. We then fill the tree with spheres, starting\nat the outermost ends. After adding a sphere, all the Delaunay cells connected to its node\nare discarded. The next sphere is then added onto the next outermost node remaining. The\nprocedure is repeated until the whole tree is filled, after which the algorithm repeats with\nanother Delauney cell not belonging to the current tree. This method allows us to fill the\nsample as densely as possible with vacancies.\nIn order to help characterize and distinguish the solid structures observed in the simulations, we have computed from the atomic coordinates both radial and angular distribution\nfunctions. However, such averaged functions often do not allow unique identification of a\nstructure, which requires as well the spatial distribution of bonds. Thus, we have also generated bond order diagrams. These are stereographic projections of the nearest-neighbor\nbonds constructed as follows. First, all neighbor vectors are determined and normalized to\nunit length. Next, the vectors are placed at a common origin so that their endpoints lie\non the unit sphere. Finally, the distribution of the points on the sphere is represented by\nstereographic projections along the three coordinate axes. The pictures thus obtained reveal\nthe global symmetry of the sample.\n\nIII. THEORY\n\nFor comparison with the simulation data, we have independently calculated the phase behavior of the system by means of thermodynamic perturbation theory. Taking the Dzugutov\npair potential as input, we apply the approximate theory of Weeks, Chandler, and Andersen\n\n\f(WCA) [10] to a classical system of N pair-wise-interacting particles in a volume V . The\nWCA approach is especially well suited to pair potentials that contain a steeply repulsive\ncore and has been successfully applied to the Lennard-Jones potential [11–13], which has a\nrepulsive core similar to that of the Dzugutov potential.\nThe WCA approximation splits the pair potential φ(r) at its first minimum into a shortrange repulsive reference potential φ0 (r) and a perturbation potential φp (r) and prescribes a\nmapping of the reference system onto an effective hard-sphere (HS) system. The Helmholtz\nfree energy F of the system separates correspondingly into reference and perturbation parts,\naccording to\nF = F0 +\n\nZ\n\n1\n0\n\ndλhΦp iλ ,\n\n(4)\n\nwhere F0 is the free energy of the reference system,\nΦp ≡\n\nX\ni<j\n\nφp (|ri − rj |)\n\n(5)\n\nis the total perturbation energy, and h* * *iλ denotes averaging with respect to the probability\ndistribution of a system with pair potential φλ (r) = φ0 (r) + λφp (r). Expansion of hΦp iλ\nin powers of λ about the reference system (λ = 0) generates an exact perturbation series.\nMapping the reference system onto an effective HS system, the free energy may be expressed,\nto first-order in the perturbation potential, as\nF [ρ(r)] = FHS [ρ(r)] +\n\n2πN 2\nV\n\nZ\n\n∞\n\n0\n\ndr ′ r ′2 gHS (r ′ ; [ρ(r)]) φp (r ′ ),\n\n(6)\n\nwhere FHS [ρ(r)] and gHS (r; [ρ(r)]) are the free energy and radial distribution function (rdf),\nrespectively, of the HS reference system, both functionals of the equilibrium one-particle\nnumber density ρ(r). The rdf is defined, in turn, according to\ngHS (r; [ρ(r)]) ≡\n\n1\n4πρ2 V\n\nZ\n\ndΩ\n\nZ\n\ndr′ ρ(2) (r′ , r′ + r),\n\n(7)\n\nas an orientational and translational average of the two-particle density ρ(2) (r, r′ ). The\nsecond- and higher-order terms are proportional to successively higher powers of inverse\n\n\ftemperature 1/T , the coefficients being related to mean fluctuations of Φp [14]. Accuracy of\nthe first-order approximation [Eq. (6)] is thus assured as long as fluctuations in Φp remain\nsufficiently small relative to the thermal energy kB T .\nThe free energy of the fluid phase is calculated via the uniform limit (ρ(r) −→ ρ) of\nEq. (6), using the essentially exact Carnahan-Starling and Verlet-Weis forms [14] for the\nHS free energy per particle, fHS (ρ), and rdf, gHS (r), respectively. For the solid phase, the\nHS free energy functional is approximated by means of classical density-functional (DF)\ntheory [15]. The DF approach is based on the existence of a functional F [ρ(r)] of the\ndensity ρ(r) that satisfies a variational principle, according to which F [ρ(r)] is minimized –\nfor given average density and external potential – by the equilibrium density, its minimum\nvalue equaling the Helmholtz free energy F . In the absence of an external potential, F [ρ(r)]\nmay be decomposed into an exactly known ideal-gas contribution\nFid [ρ(r)] = kB T\n\nZ\n\nh\n\ni\n\ndrρ(r) ln(ρ(r)Λ3 ) − 1 ,\n\n(8)\n\nwhich is the free energy in the absence of interactions (Λ being the thermal de Broglie wavelength) and an excess contribution Fex [ρ(r)], depending entirely upon internal interactions.\nHere we approximate the excess free energy of the HS solid by the modified weighteddensity approximation (MWDA) [16,17], which gives a reasonable description of the HS\nsystem. The MWDA maps the excess free energy per particle of the solid onto that of a\ncorresponding uniform fluid of effective density, according to\n1 M W DA\nF\n[ρ(r)] = fHS (ρ̂),\nN ex\n\n(9)\n\nwhere the effective (or weighted) density\nρ̂ ≡\n\n1\nN\n\nZ\n\ndr\n\nZ\n\ndr′ρ(r)ρ(r′ )w(|r − r′ |; ρ̂)\n\n(10)\n\nis a self-consistently determined weighted average of ρ(r). The weight function w(r) is\nM W DA\nspecified by normalization and by the requirement that Fex\n[ρ(r)] generate the exact\n\ntwo-particle (Ornstein-Zernike) direct correlation function c(r) in the uniform limit. This\n\n\fleads to an analytic relation [16] between w(r) and the fluid functions fHS and c(r), computed\nhere using the solution of the Percus-Yevick (PY) integral equation for hard spheres [14].\nPractical calculation of FHS [ρ(r)] and gHS (r; [ρ(r)]) requires specifying the solid density,\ni.e., the coordinates of the lattice sites (equilibrium particle positions) and the shape of\nthe density distribution about these sites. Here we consider fcc, hcp, bcc, and σ-phase\ncrystals and the dodecagonal quasicrystal structures described below in Sec. IV. The density\ndistribution is modelled by the Gaussian ansatz. This places at each site R a normalized\nisotropic Gaussian, such that\nρ(r) =\n\n\u0012 \u00133/2 X\n\nα\nπ\n\nR\n\nexp(−α|r − R|2),\n\n(11)\n\nthe single parameter α determining the width of the distribution. The Gaussian ansatz\nhas been shown by simulation [18] to reasonably describe the density distribution of closepacked crystals. For nonoverlapping neighboring Gaussians – consistently the case here –\nthe ideal-gas free energy per particle [Eq. (8)] is very accurately approximated by\n1\n3\n5\nFid = kB T ln(αΛ2 ) − ,\nN\n2\n2\n\n(12)\n\nto within an irrelevant constant. The HS free energy is obtained, for a given solid structure\nand average density, by minimizing the approximate functional FHS[ρ(r)] = Fid[ρ(r)] +\nM W DA\nFex\n[ρ(r)] [from Eqs. (9), (10), and (12)] with respect to α. Predictions of the MWDA\n\nfor free energies and pressures of HS solids are in good agreement with simulation data for\nboth fcc [16] and bcc [19] crystals. Although the theory underpredicts, by roughly 20 %,\nthe Lindemann ratios (ratio of root-mean-square particle displacement to nearest-neighbor\ndistance) at melting for both crystal symmetries, it is only the free energies that determine\nthermodynamic phase behavior. Note that in simulations of the HS bcc crystal a constraint\nof single-cell occupancy is usually imposed in order to stabilize the crystal against shear.\nThe perturbation free energy in Eq. (6) requires knowledge of the hard-sphere rdf, which\nmay be expressed, in general, as a sum over coordination shells:\ngHS (r; [ρ(r)]) =\n\n∞\nX\ni=1\n\ng (i) (r; [ρ(r)]).\n\n(13)\n\n\fThe functionals g (i) (r; [ρ(r)]) are obtained using the approach of Rascón et al. [13], which\napproximates the second and higher coordination shells in mean-field fashion and corrects\nthe first coordination shell for nearest-neighbor correlations. Thus, ignoring correlations for\ni ≥ 2, and substituting ρ(2) (r, r′) = ρ(r)ρ(r′ ), together with Eq. (11), into Eq. (7), yields\ng (i) (r; [ρ]) =\n\n1 α 1/2 ni\n( )\nexp[−α(r − Ri )2 /2],\n4πρ 2π\nrRi\n\ni ≥ 2,\n\n(14)\n\nwhere ni is the coordination number and Ri the lattice vector magnitude of the ith shell.\nThe first peak is parametrized by\ng (1) (r; [ρ(r)]) =\n\nA exp[−α1 (r − r1 )2 /2]\n,\nr\n\nr ≥ d,\n\n(15)\n\nwhere d is the effective HS diameter and where the parameters A, α1 , and r1 are determined\nby imposing three sum rules, namely the virial equation (relating the contact value to\nthe bulk pressure P ), normalization to the nearest-neighbor coordination number n1 , and\napproximation of the first moment by its mean-field value. Together then, the HS pressure\nP = ρ2 ∂fHS /∂ρ and the value of α that minimizes FHS [ρ(r)] determine gHS (r; [ρ(r)]) and\nso the perturbation free energy for a given solid structure. The approximation expressed\nby Eqs. (13)-(15) is in excellent agreement with simulation data for the HS fcc crystal, and\nhas been successfully applied, in a perturbation theory, to Lennard-Jones and square-well\nsolids [13]. The approximation also has been tested against, and found to closely match,\nMonte Carlo simulation data for gHS (r; [ρ(r)]) of a HS bcc crystal (at density ρσ 3 = 1.1),\nsubjected to a single-cell occupancy constraint to suppress shear instability [20]. Further\nsimulations will be required, however, to test the approximation for the HS bcc crystal\nat lower densities, where next-nearest-neighbor correlations and anisotropies in the density\ndistribution may not be negligible.\nIt remains still to specify the effective HS diameter d. According to the WCA prescription, d is the root of the nonlinear equation\nZ\n\ndryHS (r; [ρ(r)]; d)∆e(r) = 0,\n\n(16)\n\n\fwhere yHS (r; [ρ(r)]; d) ≡ exp[φHS (r; d)/kB T ]gHS (r; [ρ(r)]; d) is the HS cavity function and\n∆e(r) = exp[−φ0 (r)/kB T ] − exp[−φHS (r; d)/kB T ]\n\n(17)\n\nis a function that is nonzero only over a narrow range ξd (ξ ≪ 1) around r = d. This\nchoice ensures that the free energy of the reference system differs from that of the effective\nHS system only by terms of O(ξ 4) and higher. In practice, lacking knowledge of the cavity\nfunction of the HS solid for r < d, we expand the quantity r 2 yHS(r; [ρ(r)]; d) in a Taylor\nseries about r = d and retain the first three terms.\nThe theory set out above provides a reasonable approximation for the Helmholtz free\nenergy of the system at temperatures of order ǫ/kB and higher. From the free energy, any\nbulk thermodynamic property then may be calculated. Of particular relevance to phase\nbehavior are the pressure and chemical potential. In Sec. V D, we present our theoretical\npredictions for the phase diagram of the Dzugutov-potential system.\n\nIV. SOLID STRUCTURES\n\nA. Dodecagonal Quasicrystal\n\nThe structural model of the dodecagonal quasicrystal that we have investigated is a\nlayered system that is periodic in one direction, but quasiperiodic and twelve-fold symmetric\nin the perpendicular plane [21]. It is of Frank-Kasper type, i.e., it is mostly tetrahedrally\nclose-packed, and can be described as a periodic ABAB̄ stacking of a primary dodecagonal\nlayer A and two secondary hexagonal layers, B and B̄, which are rotated by 30◦ with respect\nto each other to obtain dodecagonal symmetry. The atoms in layer A form the vertices of\na simple tiling made of squares, triangles, 30◦ rhombi and two kinds of hexagons. The\nthreefold symmetric hexagon is known as the \"shield\". These tiles, together with their\ndecorations, are shown in Fig. 2. A sample of a square-triangle configuration is displayed in\nFig. 3. The dodecagonal quasicrystal structure also can be regarded as the decoration of a\nsimple dodecagonal tiling [22,23].\n\n\fThe stability of the monatomic Frank-Kasper-type decoration of the square-trianglerhombi-shield tiling with the potential of Eq. (1) was reported by Dzugutov [3]. Upon\ncooling below the glass transition temperature, a glass forms, which transforms, after a very\nlong annealing time, into a dodecagonal quasicrystal. The underlying tiling structure is\nmainly a decorated square-triangle tiling with a few rhombi and shields.\nThe aperiodicity of quasicrystals forbids periodic boundary conditions in the simulation.\nTaking a finite patch with open boundary conditions also should be avoided, as the surface\nenergy would affect structural stability. A solution is to use periodic approximants, which are\nfinite, orthorhombic cells whose boundaries match on opposite sides. In this way, periodic\nboundary conditions may be applied, as is done throughout this paper.\n\nB. Square-Triangle Crystals\n\nIn addition to the quasicrystalline tilings, it is also possible to generate crystalline phases\nwith squares and triangles decorated in the same fashion as for the quasicrystals. If only\nsquares are used, the A15- or β-W-phase (also known as cP8 Cr3 Si) is obtained, whereas a\npure triangle tiling results in the Z structure (hp7 Zr3 Al4 ). If both squares and triangles are\npermitted, the σ-phase or β-U (also known as tp30 Cr46 Fe54 ) and the H-phase are obtained.\nThe two phases differ in the arrangement of the tiles. The vertex configurations of the\ncrystalline phases are shown in Fig. 4. They are denoted by a, z, h, σ according to the phase\nin which they appear.\nThe unit cell of the σ-phase can be subdivided into two regular triangles and two squares.\nThe atoms at the vertices of these tiles are 14-fold coordinated, while the atom in the center of\nthe triangles is 15-fold coordinated. The remaining atoms on the edges and in the interior of\nthe square are 12-fold coordinated icosahedra. Since all coordination shells have a triangular\nsurface, all atoms are tetrahedrally close packed. Pure square-triangle structures and tilings\nwith additional shields are very stable [21]. Rhombi, however, are unstable and transform\ninto the other tiles.\n\n\fV. RESULTS\n\nA. Analysis and Comparison of Solid Structures\n\nIn this section we discuss the geometric properties of the amorphous structure, the bcc\nand fcc crystals, the nucleated tcp-phase, and the σ-phase. We have used three diagnostics\nto compare the structures: the radial distribution function (rdf), the angular distribution\nfunction (adf) of nearest neighbors separated by a distance less than the first minimum of\nthe rdf (usually r < 1.6 σ), and bond order diagrams, which aid in identifying the global\nsymmetry even if the symmetry elements are oriented in random directions.\n\n1. Radial Distribution Functions\n\nFigure 5a compares the radial distribution functions of the structures most commonly\nobserved in the simulations. Typical of the amorphous structures is an asymmetric first\npeak, which appears to consist of two overlapping shells, followed by a second maximum in\nthe range 1.7 < r < 2.7 σ, which is the well-known double peak. The unusually sharp slope\non the short-distance side indicates a well-defined second-nearest-neighbor distance, which\nis caused by the repulsive part of the maximum of the potential. The maximum at about\n1.9 σ is formed by two opposite corners of a bipyramid consisting of two regular tetrahedra.\nA second remarkable sharp slope is found at the third maximum at about 2.7 σ. Notice that\nthe rdfs of the tcp structures obtained on cooling are completely indistinguishable from the\namorphous case.\nThe rdf of the σ-phase shows an example of the perfect square-triangle-rhombi-shield\nphases. The quasicrystalline and other crystalline and approximant phases differ only in the\nfine structure of the subpeaks. Evidently the tcp-phase rdf is a broadened envelope of the\nσ-phase rdf.\nThe rdfs of the bcc and fcc structures, however, are radically different. For bcc, the\nfirst maximum is indeed split, and in the second maximum the short-distance part is lower\n\n\fthan the next peak. This maximum is now formed by the distances across the tetragonal\noctahedron in the bcc structure. At higher temperatures, when the peaks of the rdf are\nbroadened and overlap, the rdf of the bcc-phase is similar to the rdf of the tcp-phases except\nthat the weights of the two subpeaks of the second maximum between 1.7 σ and 2.7 σ are\ninterchanged.\nThe rdf of the fcc crystal exhibits a peak at about 1.6 σ. Since this is the position of\nthe potential maximum, it is clear that the fcc-phase is unstable at low pressures. Figure\n5b shows the transition from a bcc-phase to the fcc-phase at kB T /ǫ = 0.75. The small\nmaximum at 1.5 σ indicates formation of regular squares, which are characteristic of fcc.\nThe MD data are strikingly similar to theoretical predictions for the hard-sphere fcc crystal\n(Fig. 5c).\nThe sequence of phases at low temperatures and increasing pressure becomes clear when\nwe examine the rdfs: for bcc and the σ-phase, the first two overlapping atomic shells occupy\nthe minimum of the potential. The next shell is beyond the maximum. For fcc, the first\nshell is also in the minimum and the second shell is at the maximum. If the structures are\ncompressed, the energies of bcc and the σ-phase increase, since the second maximum of the\nrdf moves up the maximum of the potential. The energy of fcc decreases, since the second\nmaximum of the rdf moves down the potential maximum.\n\n2. Angular Distribution Functions\n\nThe results for the angular distribution functions (Fig. 6) are consistent with the results\nfor the rdfs. The amorphous and tcp structures are indistinguishable. The tcp-phase adf\nis a broadened version of the adf of the σ-phase. All of these phases, as well as the liquid\nshow two maxima: a rather narrow extremum at small angles around 60◦ and a broad peak\nat about 120◦ . Both maxima indicate the existence of equilateral triangles. The adfs of bcc\nand fcc are again completely different. Especially remarkable are the maxima at an angle of\n90◦ , indicating the existence of rectangles in these phases. For bcc these angles are formed\n\n\fby distances between atoms along the four-fold axis.\n\n3. Bond Order Diagrams\n\nWe have seen that the amorphous and tcp structures obtained by cooling cannot be\ndistinguished by the rdf and adf. Are they really different? As shown in Fig. 7, bond\norder diagrams can give a clear answer. The diagram for bcc (Fig. 7a) is relatively simple,\nexhibiting seven maxima – four from the separation along the space diagonals and three from\nthe distances along the four-fold directions. As the sample shown here was not perfect, thin\nbridges join the maxima. The liquid (not shown) is characterized by an isotropic distribution\nof the bonds covering the whole sphere homogeneously. The diagram for the tcp-phase\n(Fig. 7b) is somewhat more complicated, featuring an equator with twelve maxima indicating\nthe presence of a quasicrystal. Other prominent features are two further circles of maxima\nat higher latitudes and two peaks at the poles. For non-perfect samples the distribution of\nthe maxima is distorted, and the symmetry may not be dodecagonal. Occasional ring-like\narrangements of overlapping maxima surrounded by further maxima suggest twinning and\nmulti-grain samples.\nComparing samples classified as amorphous or tcp-phases, we find that a continuous\ntransition between the two may be possible. In Fig. 7b the maxima can be seen quite\nclearly. In other samples, however, the maxima are almost obscured by a rather homogeneous\nbackground noise. Quenching and annealing improves the diagrams only marginally. It is\npossible that some of the amorphous samples actually consist of a number of micro-grains.\nIf in fact the case, this would mean that the amorphous and tcp-phases have the same local\narrangement of atoms, although the amorphous sample did not succeed in ordering globally.\n\n4. Real-Space Representation of the Structures\n\nReal space pictures (snapshots) of the samples also help to distinguish the structures. In\nmost cases, the bcc samples look quite defect-free, with only the vacancies visible. Sometimes\n\n\fwe find two differently oriented domains in the simulation box. Liquid samples obviously do\nnot show any regularities. In the quenched amorphous structures, however, there are sometimes partially ordered parts, underlining our claim that they contain micrograins. The tcp\nsamples, as exemplified by Fig. 7c, have layered structures, which, if viewed perpendicular to the layers, resemble the perfect sample in Fig. 3, characterized by centered ring-like\nstructures formed by the 14- and 15-fold coordinated atoms. The quality of the pictures is\noften low, however, as the samples may be twinned or contain several grains.\n\nB. Ground-State Structures\n\nThe equilibrium structure of a specific potential at a given temperature and pressure may\nbe determined, in principle, by a global minimization of the Gibbs free energy G. In practice,\nhowever, this procedure is not feasible with MD simulations, since direct transitions between\nlocal minima are rarely observed. Even if special methods are used to switch between closely\nrelated structures like bcc and fcc, there still may exist a free energy barrier high enough\nto prevent a transition [24]. Instead of attempting to minimize G, one identifies promising\nstructures, computes the thermodynamic functions, and compares them. An alternative is\nthermodynamic integration of P , starting at P = 0 and integrating towards higher pressures.\nAt T = 0, where entropy no longer affects stability, identifying the ground state simplifies\nconsiderably. Here the Helmholtz free energy F equals the internal energy U, which in turn\nequals the potential energy Epot , since the kinetic energy vanishes. Furthermore, the Gibbs\nfree energy G becomes equal to the enthalpy H and the pressure P is determined by the\nvirial equation, since the kinetic pressure kB T also vanishes. Common tangent constructions\non curves of U(V, T = 0) vs. V yield the stability ranges of competing phases and curves of\nenthalpy H(P, T = 0) vs. P intersect at the phase coexistence pressures.\nWe have calculated the ground-state energies by two independent methods. First, taking\nthe perfect structures, we have computed lattice summations of the Dzugutov pair potential.\nSecond, starting from a perfect structure, we have relaxed the system with the MD simulation\n\n\fprogram in an isothermal-isobaric ensemble, setting kB T /ǫ = 0.001 and P to the desired\nvalue. In this mode, molecular dynamics acts as a steepest-gradient optimization algorithm.\nThe pressure is derived from the virial equation. In contrast to a lattice sum calculation,\nwhere only the volume is scaled, in the simulations all atoms may move independently.\nTherefore the results may (and do) differ slightly from the lattice sum calculations for\nperfect structures.\nSince the Dzugutov potential [Eq. (1)] is isotropic and has a single minimum, it should\nfavor densely packed structures if the volume is not restricted. An optimal packing in three\ndimensions would consist of regular tetrahedra, but such a packing does not exist. Now\nthere are two choices to solve this dilemma: either introduce other coordination polyhedra,\nas in fcc crystals, or use irregular tetrahedra, as in tcp phases. In the Frank-Kasper phases\nthe coordination polyhedra are additionally restricted to deltahedra with five or six triangles\nmeeting at a vertex. This condition is fulfilled for the icosahedron, and certain polyhedra\nwith 14, 15 and 16 vertices. Although bcc is tetrahedrally close-packed, it is not a FrankKasper phase since its coordination polyhedron (a rhombic dodecahedron) has vertices where\nonly four triangles meet.\nIn a first step towards identifying stable structures we study stacking variants, distort\nthe phases mentioned above, and examine various tcp structures. The fcc structure can\nbe modified by stacking the densely packed layers differently. We find that the hexagonal\nclose-packed (hcp) and other stacking variants are considerably less stable than fcc at high\npressures where fcc is more stable than bcc and the σ-phase. This result is remarkable since\nfor the Lennard-Jones potential hcp is known to be slightly more stable than fcc [25].\nDistortions of the bcc phase along the principal symmetry axis always reduce the stability.\nThe same happens for the σ-phase if the layer distance is changed from the optimum at\nc/a = 1.03 (a is the edge length of the tiles and c the period along the z-axis).\nThe Frank-Kasper phases are of two types: structures with 16-fold coordinated sites\nand structures without. The dodecagonal quasicrystal, its approximants, and crystalline\nvariants are of the latter type, called the square-triangle class. Structures containing 16-fold\n\n\f(or higher) coordinated atoms have a lower stability. The sites with the high coordination\nnumbers are too numerous and the potential energy increases because of strained bonds.\nWe observe the same trend in the square-triangle class. The stability is lowest for the\npurely triangular Z-phase since the number of 15-fold sites is also considerable. The stability\nincreases if the triangles are separated by squares, but is again rather low if the structure\ncontains only squares as in the A-phase without 15-fold sites, perhaps because the A-phase\nhas full cubic symmetry and is therefore more rigid than the other structures. The σ-phase,\non the other hand, is more stable than the H-phase, since it contains only pairs of triangles\ninstead of rows. More complicated crystalline phases, approximants, and the quasicrystals\nall contain mixtures of squares and triangles in different arrangements. These structures are\nall inferior to the σ-phase since they must contain larger conglomerates of triangles.\nIn a second step towards identifying ground-state structures, we survey the published\ncrystallographic structures. From the lists in Refs. [26–28], a variety of structures have been\nselected according to the following criteria:\n1. Coordination numbers between 10 and 15.\n2. Derivatives of tcp structures.\n3. Derivatives of bcc, especially vacancy-ordered structures.\n4. Quasicrystal approximants.\n5. Icosahedral coordination shells.\nFor each structure examined the required crystallographic data were taken from Ref. [5]. A\nfull list of the structures is given in the Appendix.\nAssembling the results, the following picture emerges at T = 0 (Fig. 8): the bcc-phase has\nthe absolute minimum potential energy at a density of ρσ 3 = 0.866. The σ-phase acts as the\nlower bound for all the square-triangle phases, being minimal at ρσ 3 = 0.879. The fcc-phase\nhas a potential energy minimum at ρσ 3 = 1.013. A common tangent construction shows that\n\n\fbcc is stable up to ρσ 3 = 0.887, and fcc is stable above ρσ 3 = 1.057. The relaxed σ-phase is\nstable, as determined by MD, only within the narrow interval 0.887 < ρσ 3 < 1.057, whereas\nthe ideal σ-phase is never stable, according to a simple lattice sum calculation. Intersections\nof the enthalpy curves yield the stability ranges in terms of pressure. The most stable\nstructures are bcc for P σ 3 /ǫ < 1.70, σ for 1.70 < P σ 3/ǫ < 2.85, and fcc for P σ 3 /ǫ > 2.85.\nThe sequence of ground-state structures with increasing pressure (and density) is therefore:\nbcc – σ – fcc. The properties of the various structures are summarized in Table I.\nVacancy-ordered phases are more stable than pure bcc at densities down to ρσ 3 = 0.7\n(Fig. 8b). In the range 0.6 < ρσ 3 < 0.7 the lowest potential energy is attained by a disordered\nphase formed upon annealing the NiTi2 approximant phase.\n\nC. Finite-Temperature Phases\n\nFrom the ground-state calculations we have determined the stable structures at T = 0.\nInsight into the topology of the phase diagram at finite temperatures now can be obtained\nby observing phase transitions between the melt and the solid upon heating, cooling, and\ncompression. As noted in Sec. V B, it is not possible to determine the relative thermodynamic\nstabilities of two competing phases directly from conventional MD simulations because of the\ndifficulty of computing the entropic contribution to the free energy. However, by observing\nthe temperature and pressure at which a phase becomes unstable, it is possible to establish\nlimits of mechanical stability. The results of our MD stability analysis are consolidated in\nFig. 10a.\n\n1. Heating Simulations\n\nIf the bcc and σ-phase solids are heated at low pressure, the energy and enthalpy for\nbcc remain always lower than those for the σ-phase. At higher pressures, the energy of\nthe σ-phase drops below that of bcc. The differences between the enthalpies at higher\n\n\ftemperatures, however, are smaller than their fluctuations, such that the relative stabilities\nof bcc and the σ-phase cannot be resolved.\nThe determination of the melting line has been discussed in detail in Ref. [29]. Here we\npresent only a brief summary. The phase transition line was determined by preparing a solid\nat kB T /ǫ = 0 or 0.4 at fixed pressure and heating it continuously at rates of kB δT /ǫ=0.001 or\n0.002 per timestep until melting was observed. The criterion for melting was the divergence\nof the mean-square displacement. At the same temperature a sudden rise in the potential\nenergy and an associated drop in the density were observed. Similar simulations have been\ncarried out at constant volume starting at kB T /ǫ = 0.001 and P σ 3/ǫ = 0.001. We emphasize\nthat the transition line thus obtained is not strictly the equilibrium melting line, since\nwith periodic boundary conditions the sample has no surface at which melting could start\nand a two-phase coexistence is not possible because the samples are too small. The solidfluid transition lines differ only slightly for bcc and the σ-phase. The fcc crystal melts at\nsomewhat higher temperatures. At high pressures, however, the σ-phase becomes unstable\nat considerably lower temperatures than bcc and fcc.\nThe transition to the fluid also can be determined by expanding a solid at constant temperature starting from high densities. The transition line obtained in this way for bcc crystals\nis the same as that determined by heating within the statistical fluctuations (Fig. 10a). As\nnoted in Ref. [29], only one fluid phase is observed and no transition between a liquid and\na vapor phase could be found.\n\n2. Cooling Simulations\n\nCooling simulations were carried out in a manner similar to the heating runs. Starting\nsamples were obtained from solids equilibrated at high temperatures. The cooling rate was\nkB δT /ǫ = 0.002 per time step. Similar to melting, the freezing transition is delayed, now\nbecause critical nuclei first must be formed, and subsequent large-scale reordering of atoms\nmay be necessary.\n\n\fWe find that the phase nucleating at pressures above P σ 3 /ǫ = 5 always has bcc symmetry.\nIf the temperature is lowered to about kB T /ǫ = 0.7 − 1.0, bcc becomes unstable relative to\nfcc at pressures above P σ 3 /ǫ = 20. Although a complete transition to fcc cannot be achieved\nwith our simulation method, we observe a clear indication that fcc is the preferred structure.\nIn the radial distribution function (Fig. 5a) we observe the emergence and growth of a new\n√\npeak between the first and the second peaks at about 2 times the nearest-neighbor distance,\nwhich signals the formation of regular squares in the close-packed crystal structures.\nBelow P σ 3 /ǫ = 5 we do not observe a typical freezing transition with a jump in potential\nenergy, but only a sharp kink, reminiscent of a glass transition. The nucleating structures\nare partially ordered and possess features typical of the tcp structure, namely layering, ringlike structures, and the Frank-Kasper polyhedra (see Fig. 7c). In the following, we refer to\nsuch structures as the tcp-phase. Although sometimes dodecagonal, the tcp structures often\ndo not have a perfect symmetry, and thus may have varying degrees of crystallinity.\nBecause of the maximum in the potential, it was not possible in general to obtain perfect\nsamples. If the pressure is too low, there is insufficient cohesion to compactify the samples.\nThis is clearly seen by comparing runs with different cooling rates. However, if equilibrated\nfor a longer time, the samples eventually become much denser.\nThe density ranges for stability have been obtained by cooling at constant volume. For\nthe 500-atom sample we obtain the boundary between the formation of the bcc and the\ntcp-phase at ρσ 3 = 0.87, independent of the cooling rate up to kB δT /ǫ = 0.0005 per time\nstep. For the 1024-atom sample, however, the boundary is shifted to ρσ 3 = 0.84 and is\nobserved at the first time for kB δT /ǫ = 0.00025 per time step. This is remarkable, since the\nminimum of the σ-phase lies at about ρσ 3 = 0.9.\nThe formation of the crystalline structures also depends on the sample sizes and the\ncooling rates. A sample with 250 atoms and a constant density of ρσ 3 = 0.865 froze to bcc\nat a cooling rate of kB δT /ǫ = 0.001. For 500 atoms we had to reduce the cooling rate by a\nfactor of one half, and for 1024 atoms a cooling rate of kB δT /ǫ = 0.00025 per time step was\nnecessary to obtain a perfect bcc phase, although partial bcc ordering was already observed\n\n\fat twice this rate.\nIt is easier to obtain the tcp-phase in a constant volume simulation (as Dzugutov did)\nrather than in a constant pressure ensemble. To some extent, the nucleated structures can be\nannealed also at constant volume. However, most of the defects, especially different domains,\ncannot be so removed. Annealing at constant pressure also turns out to be ineffectual.\nThe transition from fluid to solid also may be observed by compressing the fluid at a\nconstant pressure gradient of δP σ 3 /ǫ = ±0.1. The transition curve is the same as for cooling\n(Fig. 10a), the collapsed structures being again bcc, at least for kB T /ǫ = 0.6, 0.8, 1.0, 1.5,\nand 2.5.\nBetween the melting and freezing curves we observe a broad hysteresis region, within\nwhich the thermodynamic phase transition should occur. The reason for the broad hysteresis\nregion is the peculiar form of the potential. The maximum strongly inhibits freezing and\ncollapsing of the structure, indeed as intended by Dzugutov [30].\nThe structures generated by cooling the samples contain free volumes even if the density\nor pressure during nucleation is high. In the case of constant volume cooling the reason\nis obvious, since the volume of the nucleating regions shrinks with temperature. However,\nconstant pressure cooling also generates free volumes, even at high pressures, since at the\nonset of nucleation the frozen domains have a higher density than the liquid. The rigidity\nof the solid prevents the simulation box from contracting fast enough. With the methods\ndescribed in Sec. II C, we can show that the free volumes in the ordered phases are mostly\nvacancies.\nIf the simulation samples are quenched to T = 0 and P = 0, and the vacancies are\nfilled with atoms, we find that the density of bcc rises to ρσ 3 = 0.864 ± 0.005, whereas the\ndensities of the tcp-phase remain at about ρσ 3 = 0.847 ± 0.005. Although the densities of\nthe bcc samples are close to the ideal value of 0.8638, the densities of the tcp-phase are far\nlower than the ideal value at the potential energy minimum (ρσ 3 = 0.881).\n\n\f3. Compression Simulations\n\nIf the structures are compressed at fixed temperature, bcc destabilizes first. One might\ntherefore expect bcc to be stable only at relatively low temperatures. However, this would\ncontradict the cooling simulations (Sec. V C 2), which yield a bcc structure. A full picture can\nbe obtained only by calculating the Gibbs free energy, since it may be kinetically favorable\nfor the system to nucleate bcc crystallites.\nAt high pressures the stable structure is clearly fcc, which has the lowest energy and\nenthalpy. Upon compression, this close-packed structure remains stable, and radial distribution functions of the decaying bcc and σ-phase structures show new peaks characteristic\nof fcc.\n\nD. Theoretical Predictions\n\nFor comparison with the MD simulation data, we have applied the perturbation theory\ndescribed in Sec. III to predict the thermodynamic phase behavior of the Dzugutov-potential\nsystem. For the fluid phase and selected solid structures, free energies were calculated and\na coexistence analysis performed. Our choice of structures was dictated by the structures\nactually observed in the simulations. Figure 9 compares the HS part of the free energy for the\nfcc, bcc, and σ-phase structures. Also shown, for comparison, are corresponding Monte Carlo\nsimulation data from Ref. [19]. From the maximum HS volume fractions of these structures –\nrespectively 0.74, 0.68, and 0.53 – stability of the HS solid is seen to be strongly influenced by\npacking efficiency. Therefore, at high temperatures and pressures, where entropy dominates\nthe free energy and the system behaves as an effective HS system, the structures that\nare more efficiently packed are favored. As temperature and pressure decrease, internal\nenergy makes an increasing contributon to the free energy. As illustrated by the neighbor\ndistance histograms (Fig. 1) and the corresponding hard-sphere rdfs (Fig. 5c), the first\nfew coordination shells of the bcc and σ-phase structures are more commensurate with the\n\n\fattractive part of the Dzugutov potential than those of the fcc crystal, favoring these more\nloosely packed structures over close-packed fcc.\nConstructing Maxwell common tangents to curves of free energy per volume vs. density,\nthus ensuring equality of chemical potentials and pressures in coexisting phases, we have\nmapped out the phase diagram of the system. Projections onto the P − T and T − ρ\nplanes are shown in Figs. 10b and 11, respectively. As anticipated, the stable solid at high\npressures is the fcc crystal, while the bcc crystal is only metastable relative to fcc (longdashed curve in Fig. 10b). Aside from fcc, bcc, and σ-phase, we have also considered several\ntcp structures observed in the simulations and rational approximants to layered dodecagonal\nquasicrystals. The tcp and quasicrystal structures, however, were found to be at best only\nmetastable relative to the crystal structures. At T = 0, lattice-sum calculations of groundstate energies (Fig. 8a) show that bcc is the stable structure for P σ 3/ǫ < 2.66. From this\nknown limit, we postulate that bcc is also the stable solid structure at low P for small but\nfinite temperatures. The perturbation theory being of uncertain accuracy for kB T /ǫ < 0.5,\nwe further postulate an extrapolation of the fluid-fcc phase boundary to zero pressure. This\nconfines the stable bcc phase to a small pocket in the lower-left corner of the P − T diagram.\nVI. DISCUSSION AND CONCLUSIONS\n\nThe pressure-temperature phase diagram of the Dzugutov potential obtained by MD\nsimulation is surprisingly rich. At low pressures and temperatures, the bcc-phase is stable,\nfollowed, with increasing pressure, by the σ-phase and by fcc (Fig. 10a). The bcc crystal\nis nucleated from the fluid for sufficiently slow cooling rates and sufficiently high density or\npressure. It is also obtained by compressing the fluid. Below P σ 3 /ǫ = 5 or ρσ 3 = 0.85, tcp\nstructures, including the dodecagonal quasicrystal, are formed. The cooling scenario may\nbe summarized as follows:\n1. At high cooling rates a glass is formed, which may be transformed into tcp or bcc\nsolids by annealing at kB T /ǫ = 0.4 − 0.5.\n\n\f2. At lower rates the fluid has sufficient time to reorder locally and crystallizes into a\nbcc crystal. The bcc structure being relatively simple, the samples are in most cases\nperfect except for vacancies.\n3. At sufficiently low density or pressure, a tcp structure is generated. Characterized\nby layered symmetry, the tcp-phase can be formed for a wide variety of coordination\npolyhedra and many energetically similar configurations.\n4. If the bcc crystal is cooled at high pressures or compressed at low temperatures, it\ntransforms, at least partially, into the fcc structure.\nThe stability of the lowest energy tcp-phase, namely the σ-phase, relative to bcc, could\nnot be determined precisely by our simulations. Heating at low pressure shows that the\nenergy and enthalpy of bcc are always lower than those of the σ-phase. Comparing the\ntwo phases at higher pressures and temperatures shows that the difference in enthalpy is no\nlonger significant, but the energy of the σ-phase becomes lower than that of bcc at higher\npressures and temperatures. Furthermore, upon compression bcc becomes unstable at lower\npressure than the σ-phase. The detailed topology of the phase diagram in Fig. 10a is still\nnot completely clear and further simulations are necessary to compute the phase boundaries\nexactly. At low temperatures bcc appears at lower pressures than the σ-phase, whereas in\nthe cooling simulations bcc is formed at higher pressures compared to the tcp structures. It\nmay be, as speculated by Dzugutov [2], that entropy lowers the free energy of the σ-phase,\nand especially of the quasicrystal, thus leading to a stable tcp or quasicrystalline state at\nhigher temperatures.\nOur theoretical calculations for a selection of perfect solid structures suggest that the\nthermodynamically stable solid phases of the Dzugutov-potential system are limited to fcc\nand bcc crystals. Lattice-sum calculations at T = 0 show that the σ-phase is almost degenerate with, though of slightly higher energy than, the bcc crystal. At high temperatures\n(kB T ≫ ǫ), where the attractive well in the potential plays only a minor role, packing efficiency strongly disfavors the σ-phase relative to both fcc and bcc crystals. At intermediate\n\n\ftemperatures (kB T ≃ ǫ), perturbation theory predicts fcc and bcc crystals to be always\nmore stable than the relatively loosely packed σ-phase. Thus the σ-phase appears nowhere\nin the P − T phase diagram and the bcc crystal appears only at low P and T .\nIt may be, of course, that the first-order perturbation theory lacks sufficient accuracy\nto conclusively resolve relative stabilities of such closely competing phases. In particular,\nfluctuations in the total perturbation energy, being stronger for a disorder fluid than for\nordered solids, render the theory inherently less acurate for the fluid phase. Moreover, the\nmean-field neglect of next-nearest-neighbor correlations in the HS rdf is less justifiable for\nmore open structures, such as bcc and the σ-phase, than it is for the close-packed fcc crystal.\nSuch correlations, if significant, would tend to lower the free energies of the open structures\nand might possibly influence the order of stabilities.\nNevertheless, it should be emphasized that the predicted phase diagram is not necessarily at odds with the simulation data, if the tcp and high-T bcc phases, observed in the\nsimulations, are regarded as metastable with respect to fcc. Conceivably, for kinetic reasons, the supercooled fluid first nucleates a metastable bcc crystallite, which upon growth\ntransforms into a stable fcc crystal. In fact, such behavior has been predicted from a\ngeneral density-wave instability argument [31], and has been observed in simulations of a\nsupercooled Lennard-Jones fluid [32]. Furthermore, whereas the theory has been applied to\nperfect structures, the simulations often result in solids replete with defects. We may conjecture, therefore, that the defects in the σ- and tcp-phases observed in the simulations serve\nto improve the packing efficiencies (e.g., by increasing nearest-neighbor distances), while\napproximately preserving the average coordination distances, thereby confering energetic\nadvantage over the fcc structure.\nAfter examining a wide variety of solid structures as candidates for stable phases of\nthe Dzugutov potential, we are drawn to conclude that only such simple structures as bcc\nor fcc are competitive. A possible exception is the σ-phase, a tetrahedrally close-packed\nstructure, although one of the simplest examples of its class. These results appear to place\nthe Dzugutov potential in line with the Yukawa, generalized Lennard-Jones, Rubidium,\n\n\fand Morse potentials, all of which favor bcc, fcc, or hcp crystals, supporting the general\nprinciple that simple pair potentials tend to favor simple structures. Nevertheless, it remains\nconceivable that quasicrystals and other complex structures, such as A15, Z, or H, might\ngain stability through modifications of the Dzugutov potential. Indeed previous work has\nidentified somewhat related pair potentials for simple metals – albeit with no counterpart in\nthe periodic table – for which stable icosahedral quasicrystals have been predicted [33,34].\nFuture work along these lines could examine variations of the Dzugutov potential in attempts\nto modify the relative stabilities of the tcp-phases and dodecagonal quasicrystals.\n\nACKNOWLEDGMENTS\n\nWe thank H.-R. Trebin for a careful reading of the manuscript and Franz Gähler for\nsupplying the data for the quasicrystal structures and some of the square-triangle crystal structures. ARD gratefully acknowledges the Forschungszentrum Jülich for use of its\ncomputing facilities.\n\nAPPENDIX\n\nThe following lists contain the structures investigated as possible ground states in the\nMD simulations. The notation is as found in Ref. [5].\nStacking variants of fcc(abc): hcp(ab), abcacb, abcbcb.\nFrank-Kasper phases: A15 or β-W (cP8 Cr3 Si), Z (hp7 Zr3 Al4 ), σ-phase or β-U (tP30\nCr46 Fe54 ), H, J, F, K', C15 (cF24 MgCu2 ), T (cI162 Mg32 (ZnAl)49 ), μ (hR13 Fe7 W6 ), D\n(V26 Fe44 Si30 ).\nSquare-triangle phases: A, H, Z, σ-phase, J, F, K', inflations of A and Z, doubling of\nthe tiles of σ-phase, a phase with a and h sites mixed, tetragonal approximants of the\nquasicrystal with 23, 36, 172 and 836 tiles.\nVacancy ordered phases derived from bcc: cP1, cI10 β-Hg4Pt, cF12 CaF2 , tC14 AsPd5 Tl,\ncI52 Cu5 Zn8 , cF120 Pd4−x Te, cF120 Sc11 Ir4 , cF116 Mn23 Th6 , cF88 Bi4 Cu4 Mn3 , cI112\n\n\fGa4 Ni3 .\nThe other structures are: oP12 Co2 Si, oP16 AlDy, oC8 BCr, oC10 AlFe2 B2 , oC12 Ge2 Th,\noC12 Si2 Zr, oC16 BCMo2 , oC16 Ga3Pt5 , oC16 HgNa, oC28 Al6 Mn, oI10 B2 CoW2 , oI12\nGd2 Si3 , oI16 BMo, oI20 Al4 U, oF24 Si2 Ti, oF48 CuMg2 , tp14 Hg5 Mn2 , tP20 Al2 Gd3 , tP30\nAlNb2 , tI12 Al2 Cu, tI12 Si2 Th, tI16 BMo, tI28 MnU6 , tI32 Si3 W5 , hP3 Cd2 Ce, hP3 AlB2 ,\nhP5 Al3 Ni2 , hP6 InNi2 , hP6 CaIn2 , hR7 B5 Mo2 , cP8 FeSi, cP20 Mn, cP39 Mg2 Zn11 , cP138\nAl9 Mn2 Si11 , cP140 (AlSi)58 Mn12 , cI12 Ga, cI26 Al12 W, cI58 Mn, cI76 Cu15 Si4 , cF96 NiTi2 .\n\n\fREFERENCES\n[1] M. Dzugutov and U. Dahlborg, J. Non-Crystalline Solids 131-133, 62 (1991).\n[2] M. Dzugutov, Phys. Rev. A 46, R2984 (1992).\n[3] M. Dzugutov, Phys. Rev. Lett. 70, 2924 (1993).\n[4] The vibrational properties of the σ phase have been recently analysed: S. I. Simdyankin,\nS. N. Taraskin, M. Dzugutov, and S. R. Elliott, preprint (Los Alamos e-print archive,\nhttp://xxx.lanl.gov/cond-mat/0002243).\n[5] J. L. C. Daams, P. Villars, and J. H. N. van Vucht, Atlas of Crystal Structure Types for\nIntermetallic Phases (ASM International, Materials Park, 1991).\n[6] J. Roth and F. Gähler, Euro. Phys. J. B 6, 425 (1998).\n[7] A. R. Denton and H. Löwen, Phys. Rev. Lett. 81, 469 (1998).\n[8] M. P. Allen and D. J. Tildesley, Computer Simulations of Liquids (Oxford Science\nPublications, Oxford, 1987).\n[9] F. Lançon and L. Billard, J. Phys. France 49 249 (1988).\n[10] J. D. Weeks, D. Chandler and H. C. Andersen, J. Chem. Phys. 54, 5237 (1971).\n[11] W. A. Curtin and N. W. Ashcroft, Phys. Rev. A 32, 2909 (1985).\n[12] L. Mederos, G. Navascués and P. Tarazona, Phys. Rev. E 49, 2161 (1994).\n[13] C. Rascón, L. Mederos, and G. Navascués Phys. Rev. Lett. 77, 2249 (1996).\n[14] J.-P. Hansen and I. R. McDonald, Theory of Simple Liquids, 2nd edition, (Academic\nPress, London, 1986).\n[15] D. W. Oxtoby, in Liquids, Freezing, and Glass Transition, Les Houches session 51, edited\nby J.-P. Hansen, D. Levesque, and J. Zinn-Justin (North-Holland, Amsterdam, 1991).\n\n\f[16] A. R. Denton and N. W. Ashcroft, Phys. Rev. A 39, 4701 (1989).\n[17] W. A. Curtin and N. W. Ashcroft, Phys. Rev. Lett. 56, 2775 (1986); 57 E1192 (1986).\n[18] R. Ohnesorge, H. Löwen H., and Wagner, Europhys. Lett. 22, 245 (1993); D. A. Young\nand B. J. Alder, J. Chem. Phys. 60, 1254 (1974).\n[19] W. A. Curtin and K. Runge, Phys. Rev. A 35, 4755 (1987).\n[20] M. Watzlawek, private communication.\n[21] J. Roth and F. Gähler, in Diffusion in Materials, edited by H. Mehrer, Chr. Herzig,\nN.A. Stolwijk, H. Bracht, Defect and Diffusion Forum 143-147, 815 (1997).\n[22] F. Gähler, in Quasicrystalline Materials, edited by Ch. Janot and J. M Dubois, p. 272\n(World Scientific, Singapore, 1988).\n[23] C. Beeli, F. Gähler, H.-U. Nissen, and P. Stadelmann, J. Phys. France 51, 661 (1990).\n[24] M. O. Robbins, K. Kremer, and G. S. Grest, J. Chem. Phys. 88, 3286 (1988).\n[25] B. van den Waal, Phys. Rev. Lett. 67, 23 (1991).\n[26] E. E. Ellner and R. Schwarz, in Intermetallic Compunds, Vol. 1: Principles, Chap. 13,\nedited by J. H. Westbrook and R. L. Fleischer, p. 309 (John Wiley, Chichester, 1994).\n[27] W. B. Pearson, The Crystal Chemistry and Physics of Metalls and Alloys (WileyInterscience, New York, 1958).\n[28] P. Villars, K. Matthis, and F. Hullinger, in Cohesion and Structure, Vol. 2, Chap. 1,\nedited by F. R. de Boer and D. G. Pettifor (North Holland, Amsterdam, 1989).\n[29] J. Roth, Euro. Phys. J. B (accepted for publication).\n[30] For the Lennard-Jones potential our simulation methods work much better. Although\nit may not be possible to derive the melting line with high accuracy, there is no problem\nin observing all three phases and the transitions between them.\n\n\f[31] S. Alexander and J. P. McTague, Phys. Rev. Lett. 41, 702 (1978).\n[32] P. R. ten Wolde, M. J. Ruiz-Montero, and D. Frenkel, Phys. Rev. Lett. 75, 2714 (1995).\n[33] A. P. Smith, Phys. Rev. B 43, 11635 (1991); Phys. Rev. B 42, 1189 (1990); A. P. Smith\nand N. W. Ashcroft, Phys. Rev. B 38, 12942 (1988).\n[34] A. R. Denton, J. Hafner, Phys. Rev. B 56, 2469 (1997); Europhys. Lett. 38, 189 (1997).\n\n\fTABLES\nTABLE I. Ground-state structure and reduced density ρσ 3 at which the potential energy per\natom Epot is minimal. The upper half contains MD results at kB T /ǫ = 0.001, the lower half lattice\nsum calculations for perfect structures.\nρσ 3\n\nU\n\nfcc\n\n1.013\n\n-2.19\n\nbcc\n\n0.866\n\n-2.66\n\nσ\n\n0.879\n\n-2.57\n\nfcc\n\n1.057\n\n-2.22\n\nbcc\n\n0.885\n\n-2.29\n\nσ\n\n0.90\n\n-2.27\n\nstructure\n\n\fFIGURES\n\n3\n\nφ(r)/ε\n\n2\n\n1\n\n0\n\n−1\n\n1.0\n\n1.2\n\n1.4\n\n1.6\n\n1.8\n\n2.0\n\nr/σ\nFIG. 1. Dzugutov pair potential together with histograms of neighbor distances for fcc (black\nbars), bcc (gray bars), and σ-phase (unshaded bars) crystals at reduced density ρσ 3 = 0.9. Heights\nof bars are proportional to numbers of neighbors.\n\nFIG. 2. The basic tiles of the dodecagonal model: square, triangle, rhombus, shield, twofold\nsymmetric hexagon. The dotted atoms are placed in A-layers z = 1/4 and 3/4, the white atoms in\nB-layers at z = 0 and the black atoms at Z = 1/2. All tiles can also occur with black and white\natoms exchanged, depending on their orientation. The twofold symmetric hexagon is unstable and\ndoes not occur in our tilings.\n\n\fFIG. 3. Patch of a decorated square-triangle quasicrystal. The dotted atoms are at z = 1/4\nand 3/4 in the A layer, the white atoms are at z = 0 in the B layer and the black atoms at z = 1/2\nin the B̄ layer.\n\nFIG. 4. Vertex configurations of the crystalline phases with a single vertex configuration. From\nleft to right: A-, Z-, H- and σ-phase or a, z, h, and σ vertex, respectively.\n\n\fg(r)\n\na\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\nr/σ\n\ng(r)\n\nb\n\n0.5\n\n1\n\n1.5\n\n2\n\nr/σ\n\n2.5\n\n3\n\n3.5\n\n\fc\n\n6\n\nFCC\nBCC\nσ\n\n5\n\ngHS(r)\n\n4\n3\n2\n1\n0\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\nr/σ\nFIG. 5. Radial distribution functions for various systems. (a) From bottom to top: fcc, bcc,\nσ-phase, tcp-phase, amorphous phase. The samples have been expanded to P σ 3 /ǫ = 0.001 and\nquenched to T = 0. Vertical scale is in arbitrary units, all curves being scaled to the same\nmaximum. (b) A sample obtained from cooling at P σ 3 /ǫ = 25 and kB T /ǫ = 0.75. The shoulder\nat r = 1.5 σ indicates the onset of a transition to fcc; (c) Hard-sphere solid at reduced density\nρσ 3 = 1.0, computed from Eqs. (13)-(15): fcc crystal (solid curve), bcc crystal (long-dashed curve),\n\na(φ)\n\nand σ-phase (short-dashed curve).\n\n-1\n\n-0.6\n\n-0.2\n\n0.2\n\ncos(φ)\n\n0.6\n\n1\n\n\fFIG. 6. Angular distribution functions. From bottom to top: fcc, bcc, σ-phase, tcp-phase,\namorphous phase. The samples have been expanded to P σ 3 /ǫ = 0.001 and quenched to T = 0.\n\na\n\nb\n\n\fc\n\n6\n\n4\n\n2\n\n0\n\n-2\n\n-4\n\n-6\n-6\n\nFIG. 7.\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\n6\n\n(a) Spherical projection of the nearest-neighbor vectors of a non-perfect bcc sample\n\ngenerated by cooling. Three views of the sphere along perpendicular directions are given; (b)\nSpherical projections of the nearest-neighbor vectors of a tcp sample obtained by cooling. Three\nperpendicular views are given. The poles of the sphere are marked by arrows, and the equator is\nindicated with dashes. The six maxima along the equator represent the twelve-fold symmetry; (c)\nProjection of a tcp sample obtained by cooling at P σ 3 /ǫ = 3.5 and kB T /ǫ = 0.55. The sample has\nbeen expanded to P σ 3 /ǫ = 0.001 and quenched to T = 0 after nucleation.\n\na\n\n3\n2\n\nFCC\nBCC\nσ\n\n3\n\nEσ /Vε\n\n1\n0\n−1\n−2\n−3\n0.6\n\n0.7\n\n0.8\n\n0.9\n\nρσ\n\n3\n\n1.0\n\n1.1\n\n1.2\n\n\fb\n\n2\n\n3\n\nEσ /Vε\n\n1\n\nσ\nFCC\nBCC\n\n0\n\n-1\n\n-2\n\n-3\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\n1.2\n\nρσ\n\n3\n\n0\n\n-1\n\n3\n\nEσ /Vε\n\nc\n\n-2\n\n-3\n0.2\n\nbcc\nCuZn\nPdTe\nMnTh\nGaNi\namo\namo\n0.3\n\n0.4\n\n0.5\n\n0.6 3\n\nρσ\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n\fFIG. 8.\n\nGround-state energy per unit volume vs. density, in reduced units. (a) Results of\n\nlattice summation of the Dzugutov pair potential for ideal fcc crystal (solid curve), bcc crystal\n(long-dashed curve), and σ-phase (short-dashed curve); (b) Results of MD simulation, with structural relaxation, for σ-phase (solid curve), fcc (long-dashed curve), and bcc (short-dashed curve);\n(c) MD simulation data for the bcc vacancy phases and the low density amorphous structures. The\nlowest minimum at the right is bcc followed by Cu5 Zn8 , Pd4−x Te, Mn23 Th6 , and Ga4 Ni3 . The\nnext minimum belongs to the amorphous phase formed from NiTi2 . The remaining double-dashed\ncurve is the amorphous phase generated by cooling the melt.\n\nFCC\nBCC\nσ\n\n3\n\nβFσ /V\n\n6\n\n4\n\n0.9\n\nFIG. 9.\n\nρσ\n\n3\n\n1.0\n\n1.1\n\nFree energy per volume vs. density, in reduced units, for the reference hard-sphere\n\nsolid, computed from Eqs. (6), (9), and (12). Curves have the same meaning as in Fig. 8a. Circular\nand square symbols are Monte Carlo simulation data, from Ref. [19], for hard-sphere bcc and fcc\ncrystals, respectively.\n\n\f20\n\nFCC\n\nBCC\n\nre\ns\nhy\nste\n\n3\n\nPσ /ε\n\n15\n\nis\n\na\n\n10\n\nFLUID\n5\n\nfcc\nσ\nbcc\n\n0\n\nbcc unstable\nσ unstable\nbcc melts\nbcc freezes\ntcp forms\n\nTCP\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\nkBT/ε\n\nb\n8\n\nFCC\n\n3\n\nPσ /ε\n\n6\n\n4\n\nFLUID\n2\n\nBCC\n0\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nkBT/ε\nFIG. 10. Pressure-temperature phase diagram. (a) MD simulation results: The instability lines\ndenote boundaries where respective structures are destabilized if compressed to high pressures.\nCapital letters mark phases formed by cooling simulations, lowercase letters phases obtained by\nground-state structure calculations. Crosses characterize region where tcp-phase is found in cooling\nsimulations. The region between the melting/expansion transition line and the cooling/compression\ntransition line is the hysteresis region; (b) Perturbation theory predictions: Phase boundaries are\nshown between fluid and fcc crystal (solid curve) and between fluid and metastable bcc crystal\n(long-dashed curve). Short-dashed curves are postulated extrapolations to low P and T .\n\n\fkBT/ε\n\n1.5\n\nFLUID\n\n1.0\n\nFCC\n0.5\n0.4\n\n0.5\n\n0.6\n\n0.7\n\nρσ\n\n3\n\n0.8\n\n0.9\n\n1.0\n\nFIG. 11. Predictions of perturbation theory for the fluid-solid phase diagram in the temperature-density (T − ρ) plane. For kB T /ǫ > 0.5, theory predicts the fcc crystal to be the only stable\nsolid phase.\n\n\f"}