{"id": "http://arxiv.org/abs/cond-mat/0406185v1", "guidislink": true, "updated": "2004-06-08T09:51:42Z", "updated_parsed": [2004, 6, 8, 9, 51, 42, 1, 160, 0], "published": "2004-06-08T09:51:42Z", "published_parsed": [2004, 6, 8, 9, 51, 42, 1, 160, 0], "title": "Irreversible Dynamics of Abrikosov Vortices in Type-two Superconductors", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0406517%2Ccond-mat%2F0406426%2Ccond-mat%2F0406256%2Ccond-mat%2F0406453%2Ccond-mat%2F0406362%2Ccond-mat%2F0406280%2Ccond-mat%2F0406024%2Ccond-mat%2F0406470%2Ccond-mat%2F0406190%2Ccond-mat%2F0406117%2Ccond-mat%2F0406027%2Ccond-mat%2F0406100%2Ccond-mat%2F0406479%2Ccond-mat%2F0406407%2Ccond-mat%2F0406291%2Ccond-mat%2F0406111%2Ccond-mat%2F0406473%2Ccond-mat%2F0406423%2Ccond-mat%2F0406083%2Ccond-mat%2F0406420%2Ccond-mat%2F0406627%2Ccond-mat%2F0406661%2Ccond-mat%2F0406233%2Ccond-mat%2F0406334%2Ccond-mat%2F0406392%2Ccond-mat%2F0406162%2Ccond-mat%2F0406662%2Ccond-mat%2F0406701%2Ccond-mat%2F0406020%2Ccond-mat%2F0406725%2Ccond-mat%2F0406173%2Ccond-mat%2F0406037%2Ccond-mat%2F0406456%2Ccond-mat%2F0406525%2Ccond-mat%2F0406598%2Ccond-mat%2F0406364%2Ccond-mat%2F0406394%2Ccond-mat%2F0406434%2Ccond-mat%2F0406504%2Ccond-mat%2F0406136%2Ccond-mat%2F0406630%2Ccond-mat%2F0406070%2Ccond-mat%2F0406251%2Ccond-mat%2F0406641%2Ccond-mat%2F0406185%2Ccond-mat%2F0406763%2Ccond-mat%2F0406303%2Ccond-mat%2F0406172%2Ccond-mat%2F0406036%2Ccond-mat%2F0406663%2Ccond-mat%2F0406549%2Ccond-mat%2F0406323%2Ccond-mat%2F0406710%2Ccond-mat%2F0406367%2Ccond-mat%2F0406163%2Ccond-mat%2F0406397%2Ccond-mat%2F0406731%2Ccond-mat%2F0406073%2Ccond-mat%2F0406382%2Ccond-mat%2F0406033%2Ccond-mat%2F0406040%2Ccond-mat%2F0406675%2Ccond-mat%2F0406007%2Ccond-mat%2F0406004%2Ccond-mat%2F0406463%2Ccond-mat%2F0406068%2Ccond-mat%2F0406719%2Ccond-mat%2F0406667%2Ccond-mat%2F0406490%2Ccond-mat%2F0406516%2Ccond-mat%2F0406304%2Ccond-mat%2F0406317%2Ccond-mat%2F0406693%2Ccond-mat%2F0406389%2Ccond-mat%2F0406115%2Ccond-mat%2F0406202%2Ccond-mat%2F0406048%2Ccond-mat%2F0406171%2Ccond-mat%2F0406542%2Ccond-mat%2F0406753%2Ccond-mat%2F0406515%2Ccond-mat%2F0406030%2Ccond-mat%2F0406747%2Ccond-mat%2F0406480%2Ccond-mat%2F0406177%2Ccond-mat%2F0406158%2Ccond-mat%2F0406069%2Ccond-mat%2F0406494%2Ccond-mat%2F0406689%2Ccond-mat%2F0406324%2Ccond-mat%2F0406014%2Ccond-mat%2F0406589%2Ccond-mat%2F0406745%2Ccond-mat%2F0406576%2Ccond-mat%2F0406157%2Ccond-mat%2F0406620%2Ccond-mat%2F0406290%2Ccond-mat%2F0406545%2Ccond-mat%2F0406123%2Ccond-mat%2F0406401%2Ccond-mat%2F0406380&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Irreversible Dynamics of Abrikosov Vortices in Type-two Superconductors"}, "summary": "The voltage shift RfIc with respect to the flux flow ohmic behavior of the\ncurrent-voltage characteristic in type II superconductors is ascribed to the\nirreversible processes occurring when a vortex crosses defects. We include\nirreversible effects of the vortices-defects interaction into an effective law\nof motion. The obtained current-voltage characteristic at finite temperature is\nin agreement with experimental data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0406517%2Ccond-mat%2F0406426%2Ccond-mat%2F0406256%2Ccond-mat%2F0406453%2Ccond-mat%2F0406362%2Ccond-mat%2F0406280%2Ccond-mat%2F0406024%2Ccond-mat%2F0406470%2Ccond-mat%2F0406190%2Ccond-mat%2F0406117%2Ccond-mat%2F0406027%2Ccond-mat%2F0406100%2Ccond-mat%2F0406479%2Ccond-mat%2F0406407%2Ccond-mat%2F0406291%2Ccond-mat%2F0406111%2Ccond-mat%2F0406473%2Ccond-mat%2F0406423%2Ccond-mat%2F0406083%2Ccond-mat%2F0406420%2Ccond-mat%2F0406627%2Ccond-mat%2F0406661%2Ccond-mat%2F0406233%2Ccond-mat%2F0406334%2Ccond-mat%2F0406392%2Ccond-mat%2F0406162%2Ccond-mat%2F0406662%2Ccond-mat%2F0406701%2Ccond-mat%2F0406020%2Ccond-mat%2F0406725%2Ccond-mat%2F0406173%2Ccond-mat%2F0406037%2Ccond-mat%2F0406456%2Ccond-mat%2F0406525%2Ccond-mat%2F0406598%2Ccond-mat%2F0406364%2Ccond-mat%2F0406394%2Ccond-mat%2F0406434%2Ccond-mat%2F0406504%2Ccond-mat%2F0406136%2Ccond-mat%2F0406630%2Ccond-mat%2F0406070%2Ccond-mat%2F0406251%2Ccond-mat%2F0406641%2Ccond-mat%2F0406185%2Ccond-mat%2F0406763%2Ccond-mat%2F0406303%2Ccond-mat%2F0406172%2Ccond-mat%2F0406036%2Ccond-mat%2F0406663%2Ccond-mat%2F0406549%2Ccond-mat%2F0406323%2Ccond-mat%2F0406710%2Ccond-mat%2F0406367%2Ccond-mat%2F0406163%2Ccond-mat%2F0406397%2Ccond-mat%2F0406731%2Ccond-mat%2F0406073%2Ccond-mat%2F0406382%2Ccond-mat%2F0406033%2Ccond-mat%2F0406040%2Ccond-mat%2F0406675%2Ccond-mat%2F0406007%2Ccond-mat%2F0406004%2Ccond-mat%2F0406463%2Ccond-mat%2F0406068%2Ccond-mat%2F0406719%2Ccond-mat%2F0406667%2Ccond-mat%2F0406490%2Ccond-mat%2F0406516%2Ccond-mat%2F0406304%2Ccond-mat%2F0406317%2Ccond-mat%2F0406693%2Ccond-mat%2F0406389%2Ccond-mat%2F0406115%2Ccond-mat%2F0406202%2Ccond-mat%2F0406048%2Ccond-mat%2F0406171%2Ccond-mat%2F0406542%2Ccond-mat%2F0406753%2Ccond-mat%2F0406515%2Ccond-mat%2F0406030%2Ccond-mat%2F0406747%2Ccond-mat%2F0406480%2Ccond-mat%2F0406177%2Ccond-mat%2F0406158%2Ccond-mat%2F0406069%2Ccond-mat%2F0406494%2Ccond-mat%2F0406689%2Ccond-mat%2F0406324%2Ccond-mat%2F0406014%2Ccond-mat%2F0406589%2Ccond-mat%2F0406745%2Ccond-mat%2F0406576%2Ccond-mat%2F0406157%2Ccond-mat%2F0406620%2Ccond-mat%2F0406290%2Ccond-mat%2F0406545%2Ccond-mat%2F0406123%2Ccond-mat%2F0406401%2Ccond-mat%2F0406380&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The voltage shift RfIc with respect to the flux flow ohmic behavior of the\ncurrent-voltage characteristic in type II superconductors is ascribed to the\nirreversible processes occurring when a vortex crosses defects. We include\nirreversible effects of the vortices-defects interaction into an effective law\nof motion. The obtained current-voltage characteristic at finite temperature is\nin agreement with experimental data."}, "authors": ["S. Pace", "G. Filatrella", "G. Grimaldi", "A. Nigro"], "author_detail": {"name": "A. Nigro"}, "author": "A. Nigro", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.physleta.2004.06.048", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0406185v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0406185v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 4 figures, submitted to Phys. Lett. A", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0406185v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0406185v1", "journal_reference": "Physics Letters A 329 (2004) 379-384", "doi": "10.1016/j.physleta.2004.06.048", "fulltext": "1\n\nIrreversible Dynamics of Abrikosov Vortices in Type-two Superconductors\nS. Pace1,2, G. Filatrella1,3, G.Grimaldi1,2, A. Nigro1,2\n1\nINFM, Regional Laboratory of Salerno,Via S. Allende I-84081 Baronissi, Italy\n2\nDept. of Physics \"E.R. Caianiello\", University of Salerno, Via S. Allende I-84081\nBaronissi, Italy\n3\nDept. of Biological and Environmental Sciences, Via Port'Arsa 11, I-82100 Benevento,\nItaly\nAbstract\nThe voltage shift RfIc with respect to the flux flow ohmic behavior of the\ncurrent-voltage characteristic in type II superconductors is ascribed to the irreversible\nprocesses occurring when a vortex crosses defects. We include irreversible effects of the\nvortices-defects interaction into an effective law of motion. The obtained currentvoltage characteristic at finite temperature is in agreement with experimental data.\n\nPACS numbers: 74.25.Qt, 74.25.Fy, 74.40.+k\nKeywords: Vortex dynamics; Pinning; Current voltage characteristics; Type-two\nsuperconductors\n\nCorresponding author:\nSandro Pace\nINFM Regional Laboratory of Salerno\nPhysics Department\nv. S. Allende\nI-84081 Baronissi (SA)\nItaly\nPhone: +39-089965369\nFax: +39-089965275\ne-mail: pace@sa.infn.it\n\n\f2\n\n1. Introduction\nIn the mixed state of type II superconductors the mechanism underlying the\nvortex-defect interaction plays a fundamental role in determining the transport\nproperties as well as the magnetic behavior of actual superconducting samples [1-3].\nMagnetic field and temperature dependences of resistance and critical current have been\ndeeply studied, but important features of current transport properties have not yet been\ncompletely explained. For instance the appearance of quasi-static magnetization cycles\nimplies the existence of intrinsic irreversible processes induced by the flux quanta\nmotion, whose general microscopic origin has not yet been clearly identified. Another\ncommon and unexplained feature observed in low temperature superconductors, is the\nlinear dependence of the electric field E ~ (J-Jc), above the critical current density, Jc [46]. Also in high temperature superconductors a shifted linear behavior in the currentvoltage (I-V) characteristics seems to be asymptotically reached for currents much\nhigher than Ic. As an example, Fig.1 shows the experimental I-V curves at 4.2K of a low\ncritical temperature (Tc) homogeneous material and of a superconducting tape, and of\nhigh temperature superconducting (HTS) films at 77K. Above the critical current, Ic, a\nlinear dependence V=Rf (I-Ic) is observed with the presence of a voltage shift ∆V= Rf Ic,\nwhere Rf is the measured flux flow resistance [7,8]. Due to inhomogeneities the I-V\ncharacteristics of HTS samples do not show in a clear way the linear dependence, and\nfor J≅Jc they can be approximated by a power law dependence V≈In, where the index n\ncharacterizes dissipations: the higher is n the lower are thermal induced losses below Jc\n[6,9,10]. A similar behavior appears in other HTS samples [11].\nMacroscopic dissipations occur in type II superconductors because Abrikosov\nvortices move under the effect of a current density J flowing through the sample; the\ncurrent drives each flux quantum Φ0 via a Lorentz-like force per unit length fL=JXΦ\nΦ 0.\nConsequently for each moving vortex, a friction force − η ⋅ v proportional to the vortex\nvelocity appears, due to the normal current produced by the electric field arising from\nthe motion of the vortex structure [1]. The balance between the Lorentz force and the\nfriction force determines the equilibrium velocity, which is then proportional to the\nvoltage. As a straightforward consequence the I-V characteristic would be expected\nlinear: E= ρfJ, where ρf is the flux flow resistivity. Deviations of the I-V characteristic\nfrom the ohmic behavior E=ρfJ are ascribed to the presence of material defects, such as\nimpurities or spatial inhomogeneities of the superconducting parameters. Indeed defects\nmake the free energy F of a single flux quantum a function of the vortex position, so\nthat metastable equilibrium configurations correspond to F minima. The height ∆F of\nthe well is determined by the energy necessary to create the vortex normal core when\nthe flux quantum is driven outside the defect. Defects are then treated as potential wells,\nwhose gradient determines the pinning force fp. For a weak external driving current,\nvortices cannot move and are pinned by the force fp. Only for fL>fp, i.e. J>Jc, is the\nvortex driven outside the defect in a flux flow state. Above Jc, the flux flow linear\nbranch intersects Jc, as shown in Fig. 1; a proposed explanation for this behavior is the\nexistence of a dynamic pinning force equal to the static one and always opposite to the\nvortex motion [12,13]. The latter assumption is in contrast with the standard potential\nwell description of the pinning center. In this Letter we propose that the contradiction\ncan be overcome by taking into account the irreversible non equilibrium processes that\noccur in the vortex motion through defects. We will also discuss the consequences of\nthe modified single vortex dynamics on the collective vortices motion [14].\n\n\f3\n\nThe paper is organized as follows: in Section 2 we outline the physical\nmechanism leading to the effective law of motion for the vortices; in Section 3 we\nderive the I-V characteristic from the Langevin equation. As usual discussions and\nconclusions are drawn in the last Section.\n2. The Langevin equation of the effective vortex motion\nThe essential point is that rather than being always opposite to the motion, any\nforce due to a potential well should accelerate vortices falling down into the well, and\ndecelerate vortices going up. For this reason, if the external current is sufficiently higher\nthan Jc, the vortex average velocity should be unaffected by the presence of a potential\nwell and it should be equal to the flux flow velocity, leading to a linear I-V dependence\nintersecting the origin. Only for currents just above the critical value should the\npotential well cause substantial changes in this velocity. As an example an analytic\ndescription of the motion in a potential well can be performed, assuming the wellknown washboard potential with a damping force proportional to the velocity [15,16];\nfor J>>Jc, a linear I-V characteristic intersecting the origin is obtained. This result is\nindependent of the particular shape of the potential well [17], so that the presence of the\nexperimental voltage shift cannot be explained by analyzing the motion of independent\nvortices through potential wells. To explain the voltage shift and to overcome the\ncontradiction of the usual description we suggest to consider irreversible non\nequilibrium processes that occur when a vortex crosses defects. We recall that it has\nalready been suggested that non-equilibrium phenomena play a role in the flux flow\nmotion even in the absence of defects [18,19]. Indeed, in non-equilibrium conditions,\nthe work done by a system is always less than its free energy variation so that the free\nenergy cannot be considered like a potential energy. The vortex falling into the defect is\nnot a quasi-static process, and consequently the free energy difference of the vortex\ninside and outside the defect, cannot be treated as a potential well. While entering in the\ndefect the actual heat loss due to excess entropy is larger than the corresponding\nreversible process heat loss, which in the case of a non superconducting defect is\ndetermined by the entropy reduction generated by the disappearing of the vortex normal\ncore. The microscopic origin of this additive dissipation is the condensation energy of\nquasi particles into Cooper pairs, which produces thermal phonon emission [20].\nMoreover, in the reversible exit of the vortex from the defect, a work equal to the free\nenergy variation should be done and, in the same time, the vortex would then absorb the\nheat due to the entropy variation determined by the normal core formation. In dynamic\nnon-equilibrium conditions the work for the vortex exit could be even larger than the\nfree energy variation.\nWe therefore propose an effective equation for a one-dimensional single vortex\nmotion to take into account the irreversible process of a vortex entry into a defect. The\nstarting point is nevertheless the free energy change ∆F of the vortex when trapped by a\npinning center. The shape of the corresponding potential is not known in detail, but to a\nfirst order approximation, we just assume a triangular profile as shown in Fig.2a. The\nbias current introduces a Lorentz force in the x direction and adds a linearly decreasing\npotential U ' ( x) =-fL ⋅ x , as shown in Fig. 2b. In order to account for the irreversible\nprocesses discussed above, an effective potential can be retained as shown in Fig. 2c. In\nfact, starting from the bottom of a pinning center ( x0 ) a potential barrier must be\n\n\f4\n\novercome to allow the vortex to go out. Nevertheless, when the vortex is outside the\nwell ( x0 + b < x < x0 + L ), the Lorentz force only drives the vortex towards the next\ncenter of a defect. Indeed, since the entry into the nearest defect is an irreversible\nprocess, there is no additional force related to the free energy change, which is\ndissipated as heat. This phenomenon is analogous to the expansion of a gas closed in a\ncylinder by a piston [18]: If a sudden expansion is obtained by an external force acting\non the piston, the gas will not help the piston motion, and no force exerted by the gas\nexpansion has to be considered. Similarly we assume negligible the force acting on the\nvortex while entering into the defect.\nThe process described in Fig. 2c can account for an I-V curve shifted respect to\nthe origin rather than one asymptotically reaching V=RfI as results from a purely\nperiodic potential. We note that if the irreversible effects would be included as an\nadditional friction, as was earlier suggested in Ref [18], this would only be reflected in a\ndifferent slope of the I-V curve; rather, one has to treat the details of the interaction\nbetween the vortex and the pinning center. To such purpose we describe the process\ndisplayed in Fig. 2c with the following dynamical equation:\ndx\n= FL + ξ (t )\ndt\ndx\nη\n= ( FL − F p ) + ξ (t )\ndt\n\nη\n\nx 0 + b < x ≤ x 0 + L,\n(1)\nx0 ≤ x ≤ x0 + b.\n\nHere FL and F p are the forces exerted on a single vortex by the bias current and\nthe pinning center, respectively, η is the damping, ξ the stochastic term due to thermal\nfluctuations whose correlator is < ξξ ' >= 2ηK B Tδ (t − t ' ) , L is the distance between two\npinning centers and b is the effective size of the defect. When the vortex reaches the\nnext pinning center, its equation of motion is again approximated by a Langevin\nequation of the type (1). In other words, in the effective Langevin equation the pinning\nforce fp is not periodic – it must be included only when the motion is against the Lorentz\nforce.\n3. I-V characteristics at finite temperature\nSince the main problem is to find out the time a vortex spends to reach the next\npinning center, a natural framework to tackle the problem is to compute the Mean First\nPassage Time (MFPT) t for the basic process of a vortex starting from the bottom of a\npinning center to reach the next one. More precisely, we assume that there is a reflecting\nbarrier in x0 and an absorbing barrier in x0 + L to compute the average time to move\nforward. The formal solution for the MFPT is thus obtained solving the double integral\n[16,21]:\n\nη\nt=\nk BT\n\nx0 + L\n\nU ( y ) \n − U ( z) \n∫x dy exp k BT  x∫ dz exp k BT ,\n0\n0\ny\n\n(2)\n\n\f5\n\nwhere U is the potential that gives rise to the forces of Eq. (1). We see here the\nadvantage of having assumed that the pinning force is piecewise constant: the double\nintegral (2) can be analytically evaluated and the solution reads:\n\n(\n\n)\n\n k bT\n\nηb\n(F − F )b / k T\ne p L B − 1 − 1\n\n(Fp − FL )  (Fp − FL )b\n\n\nη (L − b )  k bT\ne − FL (L −b ) / k k T − 1 − 1 +\n+\n\nFL  FL (L − b )\n\n\nt forward =\n\n(\n\n)\n\n[\n\n(3)\n\n]\n\nηk b T\n(\n1 − e ( FP − FL ) b / k BT )(1 − e − FL (L −b ) / k BT ).\nFL (FL − F p )\nThere is also a finite probability for the vortex to jump backwards, i.e. against\nthe Lorentz force. The corresponding MFPT tbackwards can be analogously computed\nimposing an absorbing barrier in x0 − L for the backward process, and so one finally\nretrieves the average velocity:\n< v >= L ⋅ (1 / t forward − 1 / t backward ).\n\n(4)\n\nEq.s (3,4) are the basic result of this Letter: they state that the vortex average\nvelocity resulting from Eq.(1) can be estimated also at finite temperature. It is\nconvenient to normalize distances respect to the distance L between two defects, time\nrespect to η / (k B T ) , forces respect to the pinning force F p , and to introduce the\nnormalized temperature θ = k B T / F p L . We have reproduced the current (I ∝ FL ) –\nvoltage (V ∝< v > ) characteristic in Fig. 3. From the figure it is clear that the I-V\ncharacteristic can be approximated for I>>Ic by V=Rf(I-Ic). One can find the asymptotic\nsolution for the noiseless system (1) [ ξ (t ) = 0 ] observing that the velocity, to the\nleading order in (b / L ) ⋅ F p / FL is < v >≅ 1 / η FL − bF p / L , or, in terms of the I-V\n\n(\n\n)\n\n(\n\n)\n\ncharacteristic V≅Rf(I- b Ic/ L ). This accounts for the voltage shift of the linear branch in\nFig. 3. On the contrary, the usual washboard potential gives the asymptotic behavior\nV=RfI as shown in Fig.3 (squares).\nIn Fig. 4 we show a detailed temperature dependence of the I-V characteristics.\nWe note that the curves clearly exhibit a voltage shift at all temperatures. Moreover, the\ncritical current density value might be underestimated by the linear extrapolation of the\nexperimental data [6].\n4. Discussion and conclusion\nThe above analysis regards the basic single vortex interaction with defects and\nthe consequent dynamic processes. Actually the vortex physics is much more\ncomplicated due to many interactions such as: a) a single vortex with many pinning\ncenters, b) vortices among them, c) a vortex lattice with pinning centers. The collective\npinning theories include these effects and determine effective pinning potentials for flux\nbundles [14], producing a complex behavior such as the irreversibility line Hirr(T),\nabove which hysteretic behavior disappears [22-26]. However the I-V characteristics\n\n\f6\n\nderived within the collective pinning approach do not account for the observed shift\nabove Ic [27-32]. In a collective pinning approach vortex dynamics has been computed\n[30,33,34]. The overall effect of the interaction among vortices and pinning sites\namounts to an effective force on each vortex opposite to the motion - analogous to the\nforce due to the irreversible processes here considered. However, the aforementioned\ncollective pinning approaches employ a microscopic perturbation technique that,\nstarting from an unperturbed flux flow velocity v, results in a relative change of the\nvortex velocity δv / v that approaches zero for current densities much larger than Jc\n[30,33,34]. (The same approaches explain microscopically the existence of a net pinning\nforce by means of a divergence of the ratio δv / v for J below Jc.) The main point is that,\nas in the single vortex dynamics, also in the collective motion case by increasing the\nexternal current pinning forces due to potential wells average out at zero value. For\nJ>>Jc the vortex array becomes a rigid lattice [31], thus time average and spatial average\nof the pinning forces should result equal to zero [32]. As a consequence, in the presence\nof potential wells, also in the collective pinning theory the I-V characteristics should be\nstraight lines crossing the origin with the Rf slope, which is not the case for J>>Jc (see\nFig. 1). On the contrary in our approach the I-V curve shifted respect to the origin\nresults as the asymptotic high current solution of a single vortex dynamics or,\nequivalently, of a chain of many diluted vortices [17].\nThe forces included in Eq. (1) will also affect the collective vortices motion.\nAssuming that the interacting vortices move equally spaced, as in the widely employed\napproach of Koshelev and Vinokur in the limit of high velocity (i.e., FL >> F p ), the\ntotal force acting on the chain is the average force of the pinning centers [29,31,32]. The\nforces in Eq. (1) do not average to 0 as they would in any periodic potential: We\ntherefore anticipate that our approach will give a shifted linear behavior of the I-V\ncharacteristic for the collective motion at all velocities. In the low drive limit (I≅Ic),\nwhere the vortex-vortex interaction cannot be assumed to be rigid, the effects of spatial\nfluctuations of the inhomogeities are expected to add to the thermal fluctuations,\npossibly giving rise to a melting of the vortex chain. How the melting of vortices arises\nin the presence of irreversible processes such as those considered in this work is at the\nmoment an open question.\nIn summary, we have modified the usual approach to treat the pinning force\narising from the presence of defects in order to include irreversible processes into an\neffective equation of motion. This leads to an analytical expression for the I-V curve\nalso at finite temperature. We have showed that the resulting I-V is shifted with respect\nto the ohmic straight line, in agreement with the experiments. Finally we remark that the\nmicroscopic irreversible mechanism of vortex-defect interaction could give a deeper\nunderstanding of vortex motion and of the derived energy losses. We hope that such\nunderstanding can provide a way forward for improving the transport properties in type\nII superconductors.\nWe thank A. M. Testa, P. Caputo, and C. Senatore for helpful suggestions.\n\n\f7\n\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n\nM. Tinkham, Introduction to Superconductivity (2nd edition McGraw-Hill\nInternational Editions, Singapore, 1996).\nC. P. Poole, H. A. Farach, R. J. Creswick, Superconductivity (Academic Press,\nSan Diego CA, 1995).\nH. Ullmaier, Irreversible properties of type II superconductors (SpringerVerlag, Berlin, 1975).\nM.C.Hellerqvist, D. Ephron, W. R. White, M. R. Beasley, and A. Kapitulnik\nPhys. Rev. Lett. 76, 4022 (1996).\nM. Hilke, S. Reid, R. Gagnon, and Z. Altounian, Phys. Rev. Lett. 91, 127004\n(2003).\nJ. M. E. Geers, C. Attanasio, M. B. S. Hesselberth, J. Aarts, and P. H. Kes.,\nPhys. Rev.B 63,094511 (2001).\nY. B. Kim, C. F. Hempstead, A. R. Strnad, Phys. Rev. 139, A1163 (1965).\nR. P. Huebener, R. T. Kampwirth and A. Seher, J. Low Temp. Phys. 2, 113\n(1970).\nR. G. Jones, E. H. Rhoderick, A. C. Rose-Innes, Phys. Lett. 24A, 318 (1967).\nW. H. Warnes, J. Appl. Phys. 63, 1651 (1988).\nH. S. Edelman and D. C. Larbalestier, J. Appl. Phys. 74, 3312 (1993).\nR. P. Huebener, Magnetic Flux Structures in Superconductors (Springer-Verlag,\nBerlin, 1979).\nV. Zablotskii, M. Jirsa, and P. Petrenko, Phys. Rev.B 65, 224508 (2002).\nA. I. Larkin and Yu. N. Ovchinnikov, J. Low Temp. Phys. 34, 409 (1979).\nA. Barone and G. Paternò, Physics and Applications of the Josephson effect\n(Wiley New York, 1982), Ch 6.\nH. Risken, The Fokker Planck Equation (Springer Series in Sinergetics 18,\nBerlin NewYork, 1984), Ch 11.\nS. Pace, G. Filatrella, G. Grimaldi, and A. Nigro, unpublished.\nM. Tinkham, Phys. Rev Lett. 13, 804 (1964).\nJ. R. Clem, Phys. Rev Lett. 20, 735 (1968).\nS. B. Kaplan, C. C. Chi, D. N. Langenberg, J. J. Chang, S. Jafarey, and D. J.\nScalapino, Phys. Rev.B 14, 4854 (1976).\nP. Hanggi, P. Talkner, and M. Borkavec, Rev. Mod. Phys. 62, 251 (1990).\nE. H. Brandt, Rep. Prog. Phys. 58, 1465 (1995).\nL. F. Cohen, and J. Jensen, Rep. Prog. Phys. 60, 1581 (1997).\nG. W. Crabtree, and D. R. Nelson, Phys. Today, 38 (1997).\nD. S. Fisher, M. P. A. Fisher, D. A. Huse, Phys. Rev.B 43, 130 (1991).\nM. Liu, X.D.Liu, J.Wang, D.Y. Xing, H.Q.Lin, Phys. Lett. A 308, 149\n(2003).\nK. Yamafuji and F. Irie, Phys. Lett. A 25, 387 (1967).\nJ. Lowell, Solid State Phys. 3, 712 (1970).\nA.E. Koshelev and V.M. Vinokur, Phys. Rev. Lett. 73, 3580 (1994).\nG. Blatter, M. V. Feigel'man, V. B. Geshkenbein, A. I. Larkin, and V. M.\nVinokur, Rev. Mod. Phys. 66, 1125 (1994).\nE. Granato, T. Ala-Nissila, and S. C. Ying, Phys. Rev. B 62, 11834 (2000).\n\n\f8\n\n[32]\n[33]\n[34]\n\nG. Blatter, V.B. Geshkenbein, and J.A.G. Koopmann, Phys. Rev. Lett. 92,\n067009 (2004).\nA. Schmid and W. Hauger, J. Low Temp. Phys. 11, 667 (1973).\nA. I. Larkin and Yu.N. Ovchinnikov, Zh. Eksp. Teor. Fiz. 65, 1704 (1973) [Sov.\nPhys. JETP 38, 854 (1974)].\n\n\f9\n\nFigure Captions\nFig. 1. Current-voltage characteristics of type-II superconducting samples . Full squares\nhave been measured on a YBCO thin film (T=77K, in self field), open circles\nhave been recorded on a YBCO thick film deposited on a metallic tape\n(T=77K, in self field). Triangles data are from Ref. [8] for a Nb foil (T=4.22K,\nwith an externally applied field of 0.1 Tesla), crosses are from Ref. [10] for a\nNbTi strand (T=4.2K, with an externally applied field of 5 Tesla). Current data\nare normalized to the critical current values.\nFig. 2. Schematic single vortex (full circle) motion through defects. a) The triangular\nprofile of the standard potential in the absence of bias current. b) The tilted\npotential due to the bias current. c) The effective potential used in our model in\norder to account for the irreversible processes discussed in the text. The dotted\nline corresponds to the vortex entry into the nearest defect (irreversible\nprocess) where the vortex is driven only by the Lorentz force.\nFig. 3. Current-voltage characteristic obtained from Eq.s (3-4) (circles) and the standard\nwashboard potential (squares) compared with the ohmic straight line (dashed\nline). The solid line shows the asymptotic noiseless solution. Parameters of the\nsimulations: distance between two defects L = 2b , normalized temperature\nθ=0.02.\u0001\nFig. 4. Detail of the current-voltage characteristic obtained from Eq.s (3,4) at several\ntemperatures. Solid lines refer to different normalized (respect to FpL/kB)\ntemperatures θ = 0.10, 0.08, 0.06, 0.04, 0.02 (clockwise). The dashed line\ndenotes the ohmic straight line, and the dotted line is the analytic noiseless\nsolution for θ = 0. The distance between two defects is L = 2b .\n\n\f10\n\nFig. 1 S. Pace et al.\n\n\f11\n\nFig. 2 S. Pace et al.\n\n\f12\n\nFig. 3 S. Pace et al.\n\n\f13\n\nFig. 4 S. Pace et al.\n\n\f"}