{"id": "http://arxiv.org/abs/cond-mat/0207503v1", "guidislink": true, "updated": "2002-07-21T13:26:41Z", "updated_parsed": [2002, 7, 21, 13, 26, 41, 6, 202, 0], "published": "2002-07-21T13:26:41Z", "published_parsed": [2002, 7, 21, 13, 26, 41, 6, 202, 0], "title": "Scale invariance in coarsening of binary and ternary fluids", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0207110%2Ccond-mat%2F0207211%2Ccond-mat%2F0207676%2Ccond-mat%2F0207585%2Ccond-mat%2F0207498%2Ccond-mat%2F0207693%2Ccond-mat%2F0207570%2Ccond-mat%2F0207669%2Ccond-mat%2F0207379%2Ccond-mat%2F0207747%2Ccond-mat%2F0207387%2Ccond-mat%2F0207581%2Ccond-mat%2F0207518%2Ccond-mat%2F0207725%2Ccond-mat%2F0207405%2Ccond-mat%2F0207449%2Ccond-mat%2F0207259%2Ccond-mat%2F0207513%2Ccond-mat%2F0207073%2Ccond-mat%2F0207429%2Ccond-mat%2F0207445%2Ccond-mat%2F0207470%2Ccond-mat%2F0207611%2Ccond-mat%2F0207335%2Ccond-mat%2F0207323%2Ccond-mat%2F0207180%2Ccond-mat%2F0207120%2Ccond-mat%2F0207487%2Ccond-mat%2F0207060%2Ccond-mat%2F0207541%2Ccond-mat%2F0207486%2Ccond-mat%2F0207623%2Ccond-mat%2F0207609%2Ccond-mat%2F0207185%2Ccond-mat%2F0207544%2Ccond-mat%2F0207608%2Ccond-mat%2F0207627%2Ccond-mat%2F0207013%2Ccond-mat%2F0207081%2Ccond-mat%2F0207503%2Ccond-mat%2F0207075%2Ccond-mat%2F0207274%2Ccond-mat%2F0207646%2Ccond-mat%2F0207011%2Ccond-mat%2F0207286%2Ccond-mat%2F0207567%2Ccond-mat%2F0207591%2Ccond-mat%2F0207419%2Ccond-mat%2F0207244%2Ccond-mat%2F0207438%2Ccond-mat%2F0207132%2Ccond-mat%2F0207224%2Ccond-mat%2F0207047%2Ccond-mat%2F0207479%2Ccond-mat%2F0207395%2Ccond-mat%2F0207665%2Ccond-mat%2F0207247%2Ccond-mat%2F0207202%2Ccond-mat%2F0207699%2Ccond-mat%2F0207485%2Ccond-mat%2F0207736%2Ccond-mat%2F0207357%2Ccond-mat%2F0207638%2Ccond-mat%2F0207391%2Ccond-mat%2F0207549%2Ccond-mat%2F0207704%2Ccond-mat%2F0207283%2Ccond-mat%2F0207348%2Ccond-mat%2F0207109%2Ccond-mat%2F0207091%2Ccond-mat%2F0207522%2Ccond-mat%2F0207303%2Ccond-mat%2F0207603%2Ccond-mat%2F0207380%2Ccond-mat%2F0207715%2Ccond-mat%2F0207068%2Ccond-mat%2F0207029%2Ccond-mat%2F0207705%2Ccond-mat%2F0207473%2Ccond-mat%2F0207561%2Ccond-mat%2F0207580%2Ccond-mat%2F0207136%2Ccond-mat%2F0207707%2Ccond-mat%2F0207444%2Ccond-mat%2F0207458%2Ccond-mat%2F0207579%2Ccond-mat%2F0207744%2Ccond-mat%2F0207559%2Ccond-mat%2F0207023%2Ccond-mat%2F0207273%2Ccond-mat%2F0207639%2Ccond-mat%2F0207524%2Ccond-mat%2F0207403%2Ccond-mat%2F0207191%2Ccond-mat%2F0207130%2Ccond-mat%2F0207415%2Ccond-mat%2F0207161%2Ccond-mat%2F0207105%2Ccond-mat%2F0207194%2Ccond-mat%2F0207452%2Ccond-mat%2F0207197&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Scale invariance in coarsening of binary and ternary fluids"}, "summary": "Phase separation in binary and ternary fluids is studied using a two\ndimensional Lattice Gas Automata. The lengths, given by the the first zero\ncrossing point of the correlation function and the total interface length is\nshown to exhibit power law dependence on time. In binary mixtures, our data\nclearly indicate the existence of a regime having more than one length scale\nwhere the coarsening process proceeds through the rupture and reassociation of\ndomains. In ternary fluids; in the case of symmetric mixtures there exists a\nregime with a single length scale having dynamic exponent 1/2, while in\nasymmetric mixtures our data establish the break down of scale invariance.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0207110%2Ccond-mat%2F0207211%2Ccond-mat%2F0207676%2Ccond-mat%2F0207585%2Ccond-mat%2F0207498%2Ccond-mat%2F0207693%2Ccond-mat%2F0207570%2Ccond-mat%2F0207669%2Ccond-mat%2F0207379%2Ccond-mat%2F0207747%2Ccond-mat%2F0207387%2Ccond-mat%2F0207581%2Ccond-mat%2F0207518%2Ccond-mat%2F0207725%2Ccond-mat%2F0207405%2Ccond-mat%2F0207449%2Ccond-mat%2F0207259%2Ccond-mat%2F0207513%2Ccond-mat%2F0207073%2Ccond-mat%2F0207429%2Ccond-mat%2F0207445%2Ccond-mat%2F0207470%2Ccond-mat%2F0207611%2Ccond-mat%2F0207335%2Ccond-mat%2F0207323%2Ccond-mat%2F0207180%2Ccond-mat%2F0207120%2Ccond-mat%2F0207487%2Ccond-mat%2F0207060%2Ccond-mat%2F0207541%2Ccond-mat%2F0207486%2Ccond-mat%2F0207623%2Ccond-mat%2F0207609%2Ccond-mat%2F0207185%2Ccond-mat%2F0207544%2Ccond-mat%2F0207608%2Ccond-mat%2F0207627%2Ccond-mat%2F0207013%2Ccond-mat%2F0207081%2Ccond-mat%2F0207503%2Ccond-mat%2F0207075%2Ccond-mat%2F0207274%2Ccond-mat%2F0207646%2Ccond-mat%2F0207011%2Ccond-mat%2F0207286%2Ccond-mat%2F0207567%2Ccond-mat%2F0207591%2Ccond-mat%2F0207419%2Ccond-mat%2F0207244%2Ccond-mat%2F0207438%2Ccond-mat%2F0207132%2Ccond-mat%2F0207224%2Ccond-mat%2F0207047%2Ccond-mat%2F0207479%2Ccond-mat%2F0207395%2Ccond-mat%2F0207665%2Ccond-mat%2F0207247%2Ccond-mat%2F0207202%2Ccond-mat%2F0207699%2Ccond-mat%2F0207485%2Ccond-mat%2F0207736%2Ccond-mat%2F0207357%2Ccond-mat%2F0207638%2Ccond-mat%2F0207391%2Ccond-mat%2F0207549%2Ccond-mat%2F0207704%2Ccond-mat%2F0207283%2Ccond-mat%2F0207348%2Ccond-mat%2F0207109%2Ccond-mat%2F0207091%2Ccond-mat%2F0207522%2Ccond-mat%2F0207303%2Ccond-mat%2F0207603%2Ccond-mat%2F0207380%2Ccond-mat%2F0207715%2Ccond-mat%2F0207068%2Ccond-mat%2F0207029%2Ccond-mat%2F0207705%2Ccond-mat%2F0207473%2Ccond-mat%2F0207561%2Ccond-mat%2F0207580%2Ccond-mat%2F0207136%2Ccond-mat%2F0207707%2Ccond-mat%2F0207444%2Ccond-mat%2F0207458%2Ccond-mat%2F0207579%2Ccond-mat%2F0207744%2Ccond-mat%2F0207559%2Ccond-mat%2F0207023%2Ccond-mat%2F0207273%2Ccond-mat%2F0207639%2Ccond-mat%2F0207524%2Ccond-mat%2F0207403%2Ccond-mat%2F0207191%2Ccond-mat%2F0207130%2Ccond-mat%2F0207415%2Ccond-mat%2F0207161%2Ccond-mat%2F0207105%2Ccond-mat%2F0207194%2Ccond-mat%2F0207452%2Ccond-mat%2F0207197&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Phase separation in binary and ternary fluids is studied using a two\ndimensional Lattice Gas Automata. The lengths, given by the the first zero\ncrossing point of the correlation function and the total interface length is\nshown to exhibit power law dependence on time. In binary mixtures, our data\nclearly indicate the existence of a regime having more than one length scale\nwhere the coarsening process proceeds through the rupture and reassociation of\ndomains. In ternary fluids; in the case of symmetric mixtures there exists a\nregime with a single length scale having dynamic exponent 1/2, while in\nasymmetric mixtures our data establish the break down of scale invariance."}, "authors": ["K. C. Lakshmi", "P. B. Sunil Kumar"], "author_detail": {"name": "P. B. Sunil Kumar"}, "author": "P. B. Sunil Kumar", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.67.011507", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0207503v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0207503v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 13 figures", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0207503v1", "affiliation": "Department of Physics, Indian Institute of Technology Madras", "arxiv_url": "http://arxiv.org/abs/cond-mat/0207503v1", "journal_reference": null, "doi": "10.1103/PhysRevE.67.011507", "fulltext": "Scale invariance in coarsening of binary and ternary fluids\n\narXiv:cond-mat/0207503v1 [cond-mat.soft] 21 Jul 2002\n\nK.C. Lakshmi\n\n∗\n\nDepartment\n\nand P.B. Sunil Kumar†\nof\n\nPhysics,\n\nIndian Institute of Technology Madras,\nChennai\n\n600\n\n036,\n\nIndia\n(Dated: November 23, 2018)\n\nAbstract\nPhase separation in binary and ternary fluids is studied using a two dimensional\nLattice Gas Automata. The lengths, given by the the first zero crossing point of\nthe correlation function and the total interface length is shown to exhibit power law\ndependence on time. In binary mixtures, our data clearly indicate the existence of\na regime having more than one length scale where the coarsening process proceeds\nthrough the rupture and reassociation of domains. In ternary fluids; in the case of\nsymmetric mixtures there exists a regime with a single length scale having dynamic\nexponent 1/2, while in asymmetric mixtures our data establish the break down of\nscale invariance.\n\nPACS numbers: 47.55.K, 64.75.+g, 47.55.D, 47.11.+j\n\n∗\n†\n\nEmail:lakshmi@physics.iitm.ac.in\nEmail:sunil@physics.iitm.ac.in\n\n1\n\n\fI. INTRODUCTION\n\nA mixture of fluids phase separate into domains when quenched below its critical temperature. Since many systems of scientific and technological interest are multi component\nmixtures, the phase behavior of fluid mixtures are of current interest. The equilibrium state\nof incompatible fluids is one in which the pure phases are separated by a single connected\ninterface. However, in the thermodynamic limit, starting from a mixed phase this equilibrium is never reached. In view of this, the kinetics of the phase separation process gains\nimportance.\nIn the case of phase separating binary fluids, experiments (1; 2; 3; 4) and numerical\nsimulations (5; 6; 7) have clearly established the importance of hydrodynamics in the determination of late time domain growth laws. In spite of all efforts, a complete theoretical\nunderstanding of this highly nonlinear phenomena remains unsolved (8). This is mainly due\nto the fact that studying kinetics of liquid phase separation involves the solution of mutually\ncoupled equations; the Navier-Stokes equation for the flow and the equation of continuity\nfor the order parameter.\nEarly experimental and theoretical studies of these binary fluid systems, assume that\nthere exists, at late times, a dynamical scaling regime exhibiting similar behavior under an\nappropriate rescaling of time and length scales. Dynamical scaling is characterized by the\nsingle time-dependent length scale R(t). The domain growth follows a simple and generic\nalgebraic form, R(t) ∝ tα ,where α represents the exponent characteristic of the universality\nclass to which the system belongs. Scaling and dimensional analysis by Siggia (9) , Furukawa\n(10), San Miguel (11) and more recently by Bray (8) addresses this question of the growth\nexponent taking this length scale R(t) to be the average size of the ordering domains. In two\ndimensions, in the case of minority B phase separating from a A rich mixture , the domains\ncoarsen via evaporation-condensation process leading to the exponent α = 1/3. The late\ntime growth is governed by droplet coalescence leading to the exponent α = 1/2. In the case\nof symmetric binary mixtures, thermal fluctuations can drive the initial α = 1/3 regime to\na α = 1/2 regime (11). Most of the studies, however show a cross over from the α = 1/3 to\nan inertial α = 2/3 regime predicted by Furukawa (10).\nMore recently many researchers have pointed out the absence of scaling in two dimensional\nphase separating fluids. It is shown that competition between diffusive and hydrodynamic\n2\n\n\fgrowth leads to breakdown of scale-invariance in symmetric binary fluids (15). In the\nviscous hydrodynamic regime, scaling is observed only in the case of coarsening through\ncoalescence. Even after starting from a droplet state one can enter a bicontinuous state by\ncoalescence induced coalescence mechanism (16) leading to a breakdown of scaling. Alternatively starting from a droplet state scaling is maintained, in symmetric binary mixtures,\nif the droplet morphology is self sustaining (18). In the inertial hydrodynamics regime ,full\nscaling is recovered (17; 18). Excellent scaling is observed also in the cross over regime from\nthe viscous hydrodynamic to the inertial hydrodynamic regime (19).\nVariety of techniques have been used to simulate growth kinetics in the binary immiscible\nfluids. Direct simulations of model H have been used to study the domain growth and\nscaling using variously defined length scales (8; 17). Lattice Boltzmann simulations have\nbeen particularly useful in exploring the late time hydrodynamic regime (12; 13; 14). One\nproblem with this technique is that it does not include thermal fluctuations. On the other\nhand thermal fluctuations are inherent in Lattice Gas models. Rothman and Keller proposed\na Lattice Gas Model (RK model) for the binary immiscible fluids (20). This model has been\nused for simulating 2-D binary fluid phase separation at different overall fluid densities\n(21; 22).\nThough most of the techniques mentioned in the previous paragraph have been extended\nto study a mixture of two fluids and a surfactant (22; 23; 24), our understanding of phase\nseparation wherein all three are fluid components is rather limited. Molecular Dynamics\nsimulations by Laradji et.al (25) seem to indicate that hydrodynamic flow is not likely\nto control the separation process in ternary fluid system. This study indicates that the\nternary system at late times reaches a dynamical scaling regime during which the domains\nshow a growth law R(t) ∝ t1/3 , in agreement with the classical theory of Lifshitz and\nSlyozov. Gunstensen and Rothman extended the Lattice Gas Model (GR Model) to study\nternary immiscible fluids (LGTF) (27) but do not make any comments about the dynamical\nexponents. In this model the total energy function is the sum of the work done by the \"color\n~ i.\n~ i and is given by W = P σi f~i * Q\nflux\" f~i of each component against its \"color field\" Q\n\nMore recently, a level set method was proposed for the study of phase separation in fluid\nmixtures (26). In this method one assumes convective terms to dominate the coarsening;\nlocal volume fraction function φi (x, t) of the components is then coupled to the local velocity\nfield v through the kinetic equation,\n3\n\n\f∂φ\n= −v.∇φ.\n∂t\n\n(1)\n\nThe fluid velocity v satisfies Navier-Stokes equation\n\n∇P\nF\n∂v\n+ (v.∇)v = ν∇2 v −\n− ,\n∂t\nρ\nρ\n\n(2)\n\n.\nHere P is the pressure ,ν is the kinematic viscosity and ρ is the density. The interfacial\nenergy between the domains enters the equations only through the external force F ;\n\nF =\n\nX\n\nσi′ δ(φi )κ(φi )n̂,\n\n(3)\n\ni=A,B,C\n\nwhere κ(φi ) is the curvature of the φi domain interface, σ is the surface tension defined\nsuch that for the AB interface the surface tension is σAi + σBi .\nThe zero contour of the function φi specifies the interface of the domains. Immiscible three\ncomponent mixtures with majority components A and B having the same volume fraction\nand a minority C phase was studied using this method (26). They find a power law\ndependence of interface length with dynamic exponents in the range of 0.5 ∼ 0.6.\nIn this paper we discuss Lattice gas simulations of the binary and ternary mixtures phase\nseparating in two dimensions. We calculate cluster size distribution,total interface length\nand the density density correlation functions for each of the components. We see that, in\nsome cases, the interface length and the first zero of the correlation function; though shows\npower law dependence on time, do not have the same dynamic exponents, thus violating\nscaling.\nIn binary mixtures large difference in the parameters σi of the two components can lead to\nbreak down of scaling with the domains coarsening through rupture and coalescence. In the\nsymmetric ternary mixtures with equal σi and equal volume fractions, we see the average size\nof the ordering domains, R(t) ∝ t1/3 in agreement with the results reported earlier. At late\ntimes, we observe a crossover to a t1/2 regime which is not reported in previous simulations.\nAs we reduce the volume fraction of one of the components this exponent changes to 2/3,\n4\n\n\fconsistent with the inertial regime in two component mixtures. In the asymmetric case;\nwherein one of the component is miscible in the other two, we observe a R(t) ∝ t1/2 and a\ncross over to t2/3 as the volume fraction of the solute is reduced to zero.\nBy choosing a substrate which has minimum interaction with the fluid one should be\nable to conduct experiments on fluid separation problem in two dimensions. Such quasi two\ndimensional geometries have been used for studying three fluid phase separation (4).\nThe paper is organized as follows: In section I,we introduce the problem and summarize\nprevious results. A detailed account of the Lattice Gas Automaton model and the algorithm\nfor computing the cluster size and interface length are given in section II. Next, we discuss\nthe results of our simulations on the binary fluids. Section IV deals with the symmetric\nand asymmetric ternary fluids. In section V,we conclude the paper with a summary of the\nresults.\n\nII. THE MODEL\n\nLattice Gas Automaton (LGA) is an alternative numerical description of fluid flow dynamics. This model approximates reality by constraining motions and collisions of fluid\nparticles to a lattice, where each particle represents a finite mass of fluid. Lattice-gas automaton models represent, in the continuum, the incompressible Navier-Stokes equation\ncorrectly and are extensively used in simulations of fluids.\nIn this paper we discuss simulations using the FHP model for fluids. Much has been\nwritten about the FHP model which was first introduced in 1986 by Frisch, Hasslacher\nand Pomeau (28). The fully discrete microscopic dynamics of the FHP model maps into\nthe macroscopic behavior of hydrodynamics. A modified version of the FHP model for\nimmiscible fluid was introduced by Rothman and Keller (20). In this model, which is defined\non a hexagonal lattice, particles at the lattice sites are allowed to take 7 possible velocities,\nc~i , i ∈ {0, 1, 2, 3, 4, 5, 6} . Boolean variables indicate the occupation number at a particular\nsite at a given time. The dynamics is such that no more than one particle enters the same\nsite at the same time with the same velocity; the exclusion principle. The particles undergo\ncollision that conserves, at every site, the total number of particles,their total momentum\nand the total kinetic energy after each time step.\nMulti phase flows in which different species of fluids coexist, move and interact are an\n5\n\n\f4\n\n3\n\n5 0\n−1 6\n0\n\n+1 2\n1\n\n~ = {1, 0, 1, 0, 0, 1, 0} ,\nFig. 1 The state of a lattice point is given by the vectors φ\nq~1 = {0, 0, 1, 0, 0, 0, 0}, q~−1 = {1, 0, 0, 0, 0, 0, 0} and q~0 = {0, 0, 0, 0, 0, 1, 0}\n\nimportant domain of application of the lattice gas approach. Models for miscible, immiscible\nand reactive flows have been proposed. Interaction between the species are the key ingredient of multi-phase flows and depending on the nature of the physical processes, different\ninteractions will be considered.\nThe Lattice gas approach has the important advantage that the interface between the\ndifferent fluids appear naturally as a consequence of the way the fluids are modeled in terms\nof particles. In this paper, we represent the different phases by assigning the particles a\n~ r ) and the\n\"color\" . Now the state of any vertex at ~r is specified by a total density vector φ(~\ncolor vectors q~i (~r) with Boolean variables φj and qij as the components of this vector. In\nthe case of ternary mixtures, i can take 3 values +1 , -1 and 0 . This is illustrated clearly\nin figure 1. We define the average density as the ratio of total number of particles to the\nP\nmaximum number of particles possible. This is given by d = i=6,j=N\ni=0,j=1 φi (rj )/(7N), where\nN is the total number of sites in the lattice.\n\nDrawing analogies from electrodynamics, we define a \"color flux\" and \"color field\"at\nevery lattice point for each type of particles. In the case of ternary mixture the color flux\nat a lattice site is given by\n\n~1 (~r) =\nQ\n\nj=5\nX\n\nc~j q1j ,\n\n(4)\n\nj=5\nX\n\nc~j q−1j ,\n\n(5)\n\nj=5\nX\n\nc~j q0j .\n\n(6)\n\nj=0\n\nQ~−1 (~r) =\n\nj=0\n\n~0 (~r) =\nQ\n\nj=0\n\n6\n\n\fAnd the local color gradients or fields are defined to be\n\nf~1 (r) =\n\nj=5\nX\n\nc~j\n\nj=0\n\nf~−1 (r) =\n\nj=5\nX\n\nj=5\nX\n\nq1k (~r + cj )\n\n(7)\n\nq−1k (~r + cj )\n\n(8)\n\nq0k (~r + cj )\n\n(9)\n\nk=0\n\nc~j\n\nj=0\n\nf~0 (r) =\n\nk=6\nX\n\nk=6\nX\nk=0\n\nc~j\n\nj=0\n\nk=6\nX\nk=0\n\nFollowing the Gunstensen and Rothman (GR model), we write the work done by the flux\nagainst the field to be:\n\n~1 (r) + σ−1 f~−1 (r).Q~−1 (r) + σ0 f~0 (r).Q\n~0 (r))\nW = −(σ1 f~1 (r).Q\n\n(10)\n\nwhere σi are the parameters which determine the surface tension between different phase\nboundaries. The three phases are labeled by i = ±1, 0.\nThe simulation proceeds in two steps, Collision and Translation. During the collision\nprocess, particles at a given lattice site can exchange their velocity and color. The collision\nrules are such that the work performed by the flux against the field is minimized , subject to\nthe constraints of the exclusion principle as well as the principles of mass ,momentum and\nparticle conservation. There can be a number of configurations which satisfy the above constraints, and in principle one should pick up that configuration which minimizes energy from\nthis full set of possible configurations. In practice only a \"limited\" number of configurations\nare considered. In our simulations we take into account the following possibilities.\nIf a site has more than three particles or if their total momentum is non zero, then we\npick up all possible pairs and an attempt is made to exchange their colors. The exchange is\naccepted only if it lowers the energy.\nWhen 2 particles occupy the same site with opposite velocities there are two cases to\nconsider. In one both the particles are of the same color. Then a rotation of the configuration\nby 0, 60 or 120 degrees is attempted as shown in figure 2. The other possibility is that the\n7\n\n\f4\n\n3\n6\n\n5\n\n2\n1\n\n0\n\n3\n\n4\n6\n\n2\n\n5\n0\n\n4\n\n1\n\n3\n6\n2\n\n5\n0\n\n1\n\nFig. 2 Possible configurations in a two particle collision\n\ntwo are of different colors. Then we need to check the possibilities for 0, ±60, ±120 and 180\ndegree rotation.\nWhen three particles collide at an angle of 120 degrees there are three possibilities.\nWhen all the particles have the same color, they could just reverse their directions or retain\ntheir velocities. When the colors are not the same, similar to two particle collisions, the\nconfiguration could now be rotated by 0, ±60, ±120 and 180 . In all the above cases the\nlowest energy configuration is chosen as the final state.\nThere is one special case of three particle collision in which two particles have opposite\nvelocities and the third one is a zero velocity particle. In this case, apart from rotating the\nconfiguration an exchange of color between pairs is also attempted.\nNext step in the simulation is the translation in which all particles are moved in the\ndirection of their velocities. This collision and translation process completes one time step.\nTo understand the various competing terms in this model we first look at a two component\nfluid mixture and introduce the variables qk = q1k − q−1k , φk = q1k + q−1k , in the direction\nk. The two components are now designated by qk = ±1. Substituting these variables in the\n~1 , Q~−1 , we can obtain from equation 10 the work done to be\nequations for f~1 , f~−1 and Q\nW = −(σ1 f1 Q1 + σ−1 f−1 Q−1 )\n!\nX\nX X\nX X\n= −(\nck qk (σ1 + σ−1 )\nci\nql (r + ci ) + (σ1 − σ−1 )\nci\nφl (r + ci )\nk\n\n+\n\nX\nk\n\nck φ k\n\n(σ1 + σ−1 )\n\ni\n\nl\n\ni\n\nl\n\nX\n\nX\n\nX\n\nX\n\ni\n\nci\n\nφl (r + ci ) − (σ1 − σ−1 )\n\ni\n\nl\n\nci\n\nl\n\n!\n\nql (r + ci ) )(11)\n\nMomentum conservation implies that the last two terms in the above equation do not\ncontribute to the dynamics. The first term decides the energy of the interface between the\ntwo phases. The second term favors movement of particles toward higher or lower densities\n8\n\n\fdepending on their color. For example when σ1 − σ−1 > 0 this terms imply higher diffusivity\nof particles with q = −1. Thus increasing |σ1 − σ−1 | is like increasing the \"temperature\".\nThe earlier lattice gas model for two component fluids by Rothman and Keller (RK\nmodel) used σ1 = σ−1 = σ. In this model the work done is given by\n~\nW = −σ f~ * Q,\n~ r) =\nwhere Q(~\n\nPj=5\n\n~j qj\nj=0 c\n\n(12)\n\nPj=5 Pk=6\n~j k=0 qk (~r + cj ).\nand f~(r) =\nj=0 c\n\nWe can then intro-\n\nduce thermal fluctuation by defining an inverse temperature like parameter β such that\nthe new configuration at every time step is accepted with a probability proportional to\nexp −β(Wold − Wnew ) (22). Unless specified otherwise the results discussed in this paper\nare obtained using the GR model.\n\nA. Correlation functions and domain distribution functions\n\nWe define the pair correlation functions\n*\n+ *\n+*\n+\nX\nX\nX\nX\nCijq (~r, t) =\nqi,k (~x, t)\nqj,k (~x + ~r, t) −\nqi,k (~x)\nqj,k (~x) ,\nk\n\nk\n\nk\n\nCijh (~r, t) = hhi (~x, t)hj (~x + ~r, t)i − hhi (~x)i hhj (~x)i ,\n\n(13)\n\nk\n\n(14)\n\nHere the subscripts i, j represent the color of the particles with i, j = ±1, 0. Field values\nhi determines the phase at every lattice points. A lattice point belongs to the ith phase if hi\nhas a value higher than the other two. This means that most of the particles there belong\nto the ith color. We calculate the length Rij (t) as the first zero of the correlation function\nCijh .\nFor the immiscible case wherein all three phases have the same surface tension, to calculate the border length and cluster size of the domains of a particular phase, say A, we use\nthe following algorithm.\nAll lattice sites are picked sequentially. If a particular site belongs to the phase A and is\nnot assigned a cluster number we give it a new number. All the neighbors of this site are\nthen checked. If the neighbor belongs to the phase A, three possibilities arise. In one, the\nsite does not have an assigned cluster number. We will then give this neighbor the same\n9\n\n\f11\n00\n00\n11\n00\n11\n00\n11\n111\n000\n000\n111\n000\n111\n\nd111\n000\n000\n111\n000\n111\n000\n111\n111\n000\n00\n11\n000\n111\n000\n111\n00\n11\n00\n11\n000\n111\n000\n111\n000\n111\n00\n11\n000\n111\n000\nb\n00\n11\n00111\n11\n000\n111\n00\n11\n00\n11\n000\n111\n000\n111\n000 11\n111\n00\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\na\n00\n11\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n00\n11\n00\n11\n000\n111\n000 c 111\n111\n000\n000\n111\n00011\n111\n000\n111\n00\n11\n00\n11\n00\n11\n000\n111\n000\n111\n000\n111\n00\n000\n111\n00\n11\n00\n000\n00\n11\n00\n11\n00\n11\n00\n11\n000\n111\n000\n111\n000\n111\n00\n11\n000\n111\n00 11\n11\n00111\n11\n00 11\n11\n00111\n000\n00\n11\n00\n11\n00\n11\n00\n11\n000\n111\n000\n111\n000\n111\n00\n11\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n00\n11\n000\n111\n00\n11\n00\n11\n00\n11\n000\n111\n00\n11\n000\n111\n000\n111\n000\n111\n000\n111\n000\n111\n00\n11\n000\n111\n00 11\n00 11\n00111\n000 11\n00111\n000111\n111\n000111\n000 11\n000111\n000 11\n00111\n000\n111\n000\n000\n111\n000\n111\n\nFig. 3 (top) Rules for determining the border. Square represent C phase, Open circles\nrepresent B phase and the hashed circles represent A phase. The dark squares and circles are the\nborder sites between the A-C phase and the B-C phase. (bottom) Snap shot from the simulation\nof ternary fluid with one component miscible in the other two. The dark regions are the border\nbetween th A-C (white) and B-C (gray) domains.\n\ncluster number as the present site. In the second case, the neighbor has a number which\nis the same as the site . Here we do not have to do anything more. In the third case the\nneighbor has a number which is different from that of the present site. That is, the neighbor\nbelongs to a different cluster. In that case, the clusters are merged by assigning smaller of\nthe two numbers to all sites in the two clusters. A lattice site which belong to a particular\nphase is a border site if one of its neighbors is of a different phase.\nIn the case, wherein one of the phases is equally miscible in the other two; for example let\nus consider C miscible in A and B, we have two phases, the A-C phase and the B-C phase,\nsee figure 3. To label the domains we then follow the same procedure as before. Any site\nbelongs to the A-C phase if it is an A site or a C site whose neighbors are all A or C. For\nexample region c in figure 3 belongs to the A-C phase. The border of the A-C domain could\nbe a A or C site. If it is an A site, it should have at least one B neighbor (region d in figure\n3) or a C neighbor with the next nearest neighbor as B (region a in figure 3). If the border\nsite belongs to the C phase then it should either have a neighbor which is a B site (region\nb in figure 3) or a C neighbor with the next nearest neighbor as B (region a in figure 3).\n\n10\n\n\f0.8\n\n6\n\n.6\n\n0\nα=\n\nlog L(t)\n\nlogR(t)\n\n2.0\n\n3\n\n0.3\n\nα=\n\n3.5\n\nlog(t)\n\n4.5\n\nFig. 4 The first zero of the correlation function R (open circles) and the total border length L\n(filled squares) for a binary fluid, with σ1 = σ−1 = 1, as a function of time. The average density\nof the fluids is d = 0.55. The curves are shifted to make the comparison easy. Continuous lines\nwith slope 2/3 and 1/3 are given as guide to the eye\n\nIn the simulations, to prepare the initial configuration a particle is placed at a randomly\nchosen site. The velocity of the particle is chosen randomly from the seven possible directions\nsuch that the total momentum summed over all particles is zero. The color of the particle\nis again assigned randomly depending on the volume fraction of each component. Once\nthe initial configuration is prepared the ensuing dynamics conserved the total number of\nparticles, the net momentum, the total kinetic energy and the volume fraction of each\ncomponents.\nSimulations are performed on a triangular lattice with 360000 lattice points with periodic\nbondary conditions. The results are averaged over 10 initial configurations. The dynamic\nexponents are obtained by a power law fit over one decade in time.\n\nIII. TWO COMPONENT FLUIDS\n\nIn this section we reexamine the well studied case of binary fluid coarsening following a\ncritical quench. The fluids are labeled by i = ±1. Let us first look at the case σ1 = σ−1 = 1.\nThe time dependence of average domain size R(t) which scales the same way as Rij is shown\nin figure 4. At early time we see Lifshitz-Slyozov-Wagner(LSW) t1/3 (8) growth. At late\ntimes the growth of domains is controlled by the inertial hydrodynamics and we have the\nwell known t2/3 growth law (8).\nTo check for scaling we compare the length R given by the first zero of the correlation\nfunction with the total border length L(t) . As can be seen from figure 4, at late time, in\nthe inertial hydrodynamic regime, the length L also exhibits power law dependence with\n11\n\n\f0.65\n\nαR\n\nαL\n\n0.40\n\n0.25\n−0.4\nFig. 5\n\nFig. 6\n\n0\n\nσ2\n\n0.4\n\nDynamic exponents of αR and αL as a function of σ−1 for σ1 = 1. The open circles\nrepresent αL and the dark squares represent αR\n\nTime evolution of binary mixture for d=0.55, σ1 = 1.0, σ−1 = −0.4. The snap shots are\ntaken at (a)t = 25118 and (b)t = 39810.\n\na dynamic exponent 2/3. This agrees with earlier studies on binary fluid phase separation\nwhich predict scaling to hold in the inertial regime (17; 18).\nWe now investigate the more general case of σ1 6= σ−1 with σ−1 < σ1 . The dynamic\nexponents αR and αL characterising the time dependence of R and L seem to vary differently\nwith σ1 − σ−1 This is depicted in figure 5. This results imply break down of scaling . The\nabsence of scaling is clearly manifested in the snap shots given in figure 6, the coarsening\nprocess is through the breaking and joining of domains. Since the length R(t) is decided\nby the big clusters it has a dynamical exponent characteristic of coalescence. On the other\nhand the total border length L(t) has significant contribution from the small clusters which\ncoarsen through evaporation condensation resulting in an exponent 1/3.\n\nFig. 7\n\nTime evolution of binary mixture in the RK model for d=0.55, σ = 1.0, β = 0.03. The\nsnap shots are taken at (a)t = 25118 and (b)t = 39810.\n\n12\n\n\f0.70\n0.55\n\nαL\n\nαR\n\n0.40\n0.25\n\n0\n\n0.2\n\nβ\n\n0.4\n\nFig. 8 Dynamic exponents of αR and αL as a function of β for σ = 1 in the RK model. The\nopen circles represent αL and the dark squares represent αR\n\nSimilar change in the dynamical exponents of R was observed as a function of the inverse\ntemperature like parameter β in the RK model (22). For low β values the coarsening\nmechanism very similar to that operating in the case of σ1 6= σ−1 in the GR model. This\nis shown in figure 7. The time dependence of R and L shown in figure 8 confirms absence\nof scaling. These exponents indicate the presence of more that one coarsening mechanism\noperating at the late time regime.\nIn the case of two fluid mixtures with unequal volume fraction we see the initial LSW\nregime crossing over to the α = 1/2 regime controlled by the droplet coalescence mechanism.\nThe first zero of the correlation function R and the total border length L in this regime seems\nto indicate existence of simple scaling (18).\n\nIV. THREE COMPONENT FLUIDS\n\nIn this section, we look at two separate cases of phase separating three component fluids.In\none, we consider a symmetric ternary mixture with all the components having equal volume\nfraction and with the parameters σi in equation-10 set to σ1 = σ−1 = σ0 . This amounts to\nhaving the same surface tension for the A − B, B − C and A − C interfaces. The other case\nof interest is the asymmetric mixture, where we choose the parameters to be σ1 = σ−1 and\nσ0 < 2(σ1 + σ−1 ). This choice of parameters ensures that one of the components (solute) is\nequally soluble in the other two. We will now discuss these two cases in detail.\n\n13\n\n\fFig. 9 Time evolution of three fluid mixture for d=0.5, σ1 = σ−1 = σ0 = 1. The snap shots are\ntaken at (a)t = 10000,(b)t = 39810,(c)t = 100000.\n0.40\n0.45\n0.55\n\nlogR(t)\n\n1.6\n\n5\n\n0.\n\nα=\n\n0.8\n3.5\nFig. 10\n\nlog(t)\n\n4.5\n\nCorrelation length as a function of time in the immiscible three component case for\ndensities are 0.45,0.5 and 0.55. α = .5 line is given as a guide to the eye.\n\n1. Symmetric case\n\nStarting from the mixed state, the symmetric ternary mixture, when quenched below the\ntransition temperature, evolves to form droplets of individual components. Snap shots from\nthe simulation, shown in figure 9, clearly establish the existance of sharp interfaces between\nthe components. The first zero of correlation function R and the interface length L are\nplotted in figure 10 as a function of time.\nInitial regime corresponds to the formation of droplets. In figure-10 we see a region with\nR(t) ∼ t1/2 , where this droplets coalesce to form bigger domains. If the late time growth is\ndue to the coalescence by droplet diffusion, as it is believed to be, then the following simple\nargument shows that the exponent should be 1/2.\nIf R is the typical radius of a droplet, we have the droplet number density n ∼ v/R2 ,\nwhere v is the volume fraction of the components in two dimensions. The time for a droplet\nto diffuse a distance of order of its radius is tR = R2 /D , where D is the diffusion coefficient.\nThe area swept out by the drop in time t (for t > tR )is of the order R2 t/tR ∼ Dt . If tc\nis the coalescence time , the expected number of drops in an area Dtc is of the order unity,\n14\n\n\f5\n\nlogR(t)\n\nα=\n\nlog L(t)\n\n0.\n\n1.2\n\n3\n\n0.3\n\nα=\n\n0.6\n\n3.5\n\nlog(t)\n\n4.5\n\nFig. 11 The first zero of the correlation function R(open circles) and the total border length L\n(filled squares) for a symmetric ternary fluid with σ1 = σ−1 = σ0 as a function of time. Average\ndensity of the fluids is d=0.55. Continuous lines with slopes 1/3 and 1/2 are given as guide to the\neye\n\nwhich means nDtc = 1. Since in two dimensions, the diffusion coefficient, D ∼ kB T /η, does\nnot have any dependence on the droplet size,\n\ntc ∼\n\nηR2\nR2\n∼\n.\nvD\nvkB T\n\n(15)\n\nThis implies that R grows with time as R ∼ ( vkBη T t )1/2 (9).\nAnother mechanism for droplet coalescence is interfacial diffusion. At non zero temperatures the domains fluctuate from their circular shape. The area explored by the domain\nin time t goes as Db t, where Db is the diffusion coefficient for the interface.The coalescence\ntime tc is then given by\n\ntc ∼\n\nR02\n,\nDb\n\n(16)\n\nhere the length R0 is such that πR02 = area of the droplet. Since the interface diffusion\ncoefficient is not a function of R0 , we get L(t) ∼ t1/2 . Thus both the droplet diffusion and\ninterfacial diffusion could give the same dynamical exponent.\nTo explore the possibility of the second mechanism we studied the stability of a drop to\nfluctuations from the circular shape. As shown in the appendix, in two dimensions, surface\nfluctuations die out exponentially, both in the case of a drop and a strip (11) of one fluid in\nanother. This implies that in the α = 1/2 regime, the dominant mechanism for coarsening\nis the droplet coalescence by diffusion.\n.\n15\n\n\fFig. 12 Time evolution of three fluid mixture for d=0.55 . (a) and (b) are the snap shots from\nthe asymmetric ternary mixture phase separation at t = 25118 and t = 39810 with σ1 = σ−1 = 1\nand σ0 = −1.5. Note the breaking and reorganization of the domains with time. A-C region is\nshown in black and B-C region in white. For comparison we show snap shots (c) and (d) from the\nphase separation of a binary mixture having the same density at the same time steps with\nσ1 = σ−1 = 1.\n\nDroplet coalescence is the only mechanism operating here is further confirmed by the\nexistence of scaling. In figure 11 we compare the time dependence of the total border length\nLA of the domains of component A with that of the first zero of the correlation function\nR11 (t). We observe the same time dependence for both the lengths indicating scaling in the\nlate time regime.\n\n2. Asymmetric case\n\nIn this section, we discuss a ternary mixture with one of the components equally soluble\nin the other two. For this we choose σ1 = σ−1 and σ0 < −(σ1 +σ−1 ) such that the component\nC (i = 0) is the solute. The components A and B are mutually immiscible. We choose A and\nB to have the same volume fraction. We now have A-C and B-C mixtures phase separating\nsimilar to the binary fluid under critical quench.\nAs shown in figure 12, the starting mixed phase separates into percolating domains of\nA-C and B-C phases. Though the early time behavior is similar to the two component\nfluid with σ1 = σ−1 , the late time growth is analogous to the situation where σ1 6= σ−1\ndiscussed in section III. The snap shots do not exhibit self-similarity, domains split up and\ncombine during coarsening. In this regime, the first zero of the correlation function exhibits\na dynamic exponent α = 1/2. We would like to point out that for the same density, the two\ncomponent fluid with σ1 = σ−1 exhibits a late time exponent α = 2/3 and does not show\n\n16\n\n\f1.6\n\n3\n\n0.3\n\nα=\n\n3.5\n\nlog(t)\n\nlog L (t)\n\nlogR(t)\n0.8\n\n5\n\n0.\n\nα=\n\n4.5\n\nFig. 13 The first zero of the correlation function (open circles) and the total border length\n(filled squares) in three component asymmetric fluids. Continuous lines with slopes 0.33 and 0.5\nare given as reference\n\nany evidence of α = 1/2 regime. Thus the third component act to reduce the interfacial\ntension between the A rich and B rich phases leading to fluctuation induced breakup and\nreorganization of the domains. As the volume fraction of the component C is reduced, we\nobserve a gradual change from the α = 1/2 to α = 2/3 regime.\nIn order to investigate the validity of the scaling hypothesis in this regime, we compare\nthe length scales L(t) and R(t). This is depicted in figure 13. It is evident from the figure\nthat these two length scales vary differently at late times.\n\nV. CONCLUSION\n\nWe have presented the dynamics of domain growth in binary and ternary immiscible\nfluids , using a two-dimensional hydrodynamic lattice gas model. Various dynamic regimes\nare investigated by altering parameters like volume fraction, the interaction strength of the\nindividual components and a temperature variable.\nWe examine the validity of scaling in two component fluid coarsening by comparing the\ndynamic nature of the first zero of the correlation function and the total border length. While\nscaling holds in the droplet coalescence and the inertial hydrodynamic regimes, violation of\nscaling is observed in the fluctuation dominated regime.\nIn symmetric ternary mixtures, we show the existence of a coalescence dominated regime\nwith a single length scale exhibiting a dynamical exponent α = 1/2. In asymmetric ternary\nmixtures we use the concentration of the solute as a control parameter. We demonstrate\nthat at higher solute concentrations, the coarsening is driven by fluctuations and scaling is\nviolated.\n17\n\n\fVI. APPENDIX\nA. Stability of the drop\n\nIn this appendix, we look at the stability of a drop with radius R against perturbations in\nits perimeter. We consider a drop of radius R with the fluid in the region r < R characterized\nby density ρ, and kinematic viscosity ν =\n\nη\nρ\n\n′\n\nsurrounded by another fluid with density ρ\n\n′\n\nand kinematic viscosity ν . For an incompressible and vorticity free fluid we can define the\nvelocity component using a streaming potential ψ ss vr =\n\n1 ∂ψ\nr ∂φ\n\nvφ = − ∂ψ\n∂r\n\nNavier-Stokes equation then reduces to\n\n(∂t − ν∇2 )∇2 ψ(r, φ, t) = 0\n\n(17)\n\nWe look for solutions of the form,ψ(r, φ, t) = ψ1 (r, φ, t) + ψ2 (r, φ, t) such that\n∇2 ψ1 = 0.\n\n(18)\n\n(∂t − ν∇2 )∇2 ψ2 (r, φ, t) = 0.\n\n(19)\n\nThe general solutions of these equations in cylindrical polar coordinates is\nψ1 (r, φ, t) = (am r m +\n\nbm imφ ωt\n)e e .\nrm\n\nψ2 (r, φ, t) = (αm Im (kr) + βm Km (kr))eimφ eωt .\n\n(20)\n(21)\n\nWhere k = (ω/ν)1/2 and Im (kr) and Km (kr) are spherical Bessel functions.\n\nThe coefficients am , bm , αm and βm are obtained from the four equations; the continuity\nof vr at r = R , continuity of vφ at r = R, continuity of tangential stress σrφ at r = R and\nthe relation between normal stresses\n\nσrr |r=R− + p− = σrr |r=R+ + p+ + pσ .\n\n(22)\n\nFor the pressure p we write P = p(r)eimφ eωt . The pressure due to surface tension is\nobtained from the Young Laplace formula\nPσ =\n\nσim3\nψr<R .\nR03 ω\n18\n\n(23)\n\n\f.\nThese equations can be written in a matrix form,\n\n\n\nRm\n\n−1/Rm\n\nIm\n\n−Km\n\n\n\nam\n\n\n\n\n\n\nk\nk\n\n\n\nRm−1\n1/Rm+1 −Im /R + m\nIm−1 −Km /R + m\nKm−1 \n\n  bm \n\n\n = 0\n2 +m)\n −2(m2 + m)Rm−2 2(mm+2\n  αm \nA\nA\n33\n34\n\n\n\nR\nA41\nA42\nA43\nA44\nβm\n\n(24)\n\nwhere,\nk 2 2m m2\nmk\nmk\nk\n+ 2 + 2 )Im +\nIm+1 + (\n+ )Im−1 − k 2 Im−2\n(25)\n2\nR\nR\n2R\n2R R\nmk\nmk\nk\nk 2 2m m2\nKm+1 + (\n+ )Km−1 + k 2 Km−2\n( + 2 + 2 )Km +\n2\nR\nR\n2R\n2R R\n3\nσm\nν(2m2 + k 2 R2 − 1 +\n)Rm−2\nRωη\nν(2m2 + k 2 R2 − 1)\nR(m+2)\n1\nσm3\nk\n2k\n2m2 4m\n(1 − 2m)Im−1 + (m − 1)Im−1 )\nν(( 2 − 2 + 2 + 3 )Im −\nR\nR\nR\nR ωη\nmR\nR\n2\n2m\n4m\n1\nk\n2k\nν((− 2 + 2 − 2 )Km −\n(1 − 2m)Km−1 + (m − 1)Km+1 )\nR\nR\nR\nmR\nR\n\nA33 = −(\nA34 =\nA41 =\nA42 =\nA43 =\nA44 =\n\nIn the limit of large viscosity, we can neglect all terms of order\n\np\n(ω/η). The condition\n\nfor non trivial solutions in this limit leads to a relation between ω and m;\nω=\n\nm3 σ\n.\n(1 − 4m2 )Rη\n\n(26)\n\nSince the right hand side of this equation is always negative, we come to the conclusion\nthat in the limit of high viscosity there are no unstable modes. In the more general case,\nthe condition for non trivial solutions leads to a transcendental equation for ω and m. A\nnumerical analysis on this equation does not yield any unstable solutions.\n\nReferences\n[1] Wong N C and Knobler C M 1981 Phys. Rev. A,24, 3205\n[2] Chou Y C and Goldburg W I 1981 Phys. Rev. A,23, 858\n\n19\n\n\f[3] F.Perrot,D.Guenoun,T.Baumberger and D.Beysens, Phys. Rev. Lett,73,688 (1994)\n[4] S. Walheim, M. Ramstein, and U. Steiner., Langmuir., 15, 4828(1999)\n[5] E. Valasco and s. Toxvaerd , Phys. Rev. Lett.,71 ,388 (1993)\n[6] G.Leptoukh,B.Strickland and C.Roland , Phys. Rev. Lett.,74 ,3636 (1995)\n[7] O.T.Valls and James.E.Farrell, Phys. Rev. B,40 ,7027-7039(1989)\n[8] A.J.Bray , Adv. Phys,43 ,557 (1994)\n[9] E.D.Siggia , Phys. Rev. A,20 ,595 (1973)\n[10] H.Furukawa , Physica A,204 ,237 (1994)\n[11] M.San Miguel,M.Grant and J.D.Gunton , Phys. Rev. A,31 ,1001-1005 (1985)\n[12] M.R.Swift,E.Orlandini,W.R.Osborn,J.M.Yeomans, Phys.Rev. E, 54,5041-5052 (1996)\n[13] F.J.Alexander,S.Chen, and D.W.Grunau Phys.Rev. B, 48,634-637 (1993)\n[14] A.J.Wagner and J.M.Yeomans , International journal of Modern physics,9,1373-1382 (1998)\n[15] A.J Wagner and J.M.Yeomans, Phys. Rev. Lett. 80,1429 (1998)\n[16] H.Tanaka. Phys. Rev. Lett. 72 ,1702(1994)\n[17] H. Furukawa, Phys. Rev. E. 61,1423(2000)\n[18] A. J. Wagner and M. E. Cates. Euro. Phys. Lett., 56, 556 (2001)\n[19] I. Pagonobaraga, A. J. Wagner and M. E. Cates. To appear in J. Stat. Phys. (2002)\n[20] D.H.Rothmann and J.M.Keller , J.Stat. Phys. ,2 ,1119-1127 (1988)\n[21] S.Bastea and J.L.Lebowitz ,Phys.Rev.E , 52 ,3821-3826(1995)\n[22] A.N.Emerton,P.V.Coveney, and B.M.Bhogosian Phys. Rev. E ,55 ,708(1997)\n[23] T.Kawakatsu et. al J. Chem. Phys ,99 ,8200(1993)\n[24] G. Gonnella, E. Orandini and J. M. Yeomans et. al Phys. Rev. E, 58 ,8200(480)\n[25] M.Laradji,O.G.Mouritsen and S.Toxvaerd , Europhys. Lett.,28 ,157-162 (1994)\n[26] K. A. Smith at. al Phys. Rev. Lett. 84, 91 (2000)\n[27] A.K.Gunstensen and D.H.Rothman , Physica D , 47 ,47-52(1990)\n[28] B.Chopard and M.Droz , Cellular automata modeling of physical systems, Cambridge University Press (1998)\n\n20\n\n\f"}