{"id": "http://arxiv.org/abs/cond-mat/0108037v2", "guidislink": true, "updated": "2001-11-05T10:43:02Z", "updated_parsed": [2001, 11, 5, 10, 43, 2, 0, 309, 0], "published": "2001-08-02T10:02:58Z", "published_parsed": [2001, 8, 2, 10, 2, 58, 3, 214, 0], "title": "Quasi 2D Bose-Einstein condensation in an optical lattice", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0108102%2Ccond-mat%2F0108220%2Ccond-mat%2F0108168%2Ccond-mat%2F0108065%2Ccond-mat%2F0108189%2Ccond-mat%2F0108278%2Ccond-mat%2F0108081%2Ccond-mat%2F0108172%2Ccond-mat%2F0108492%2Ccond-mat%2F0108212%2Ccond-mat%2F0108372%2Ccond-mat%2F0108284%2Ccond-mat%2F0108078%2Ccond-mat%2F0108098%2Ccond-mat%2F0108516%2Ccond-mat%2F0108405%2Ccond-mat%2F0108384%2Ccond-mat%2F0108316%2Ccond-mat%2F0108047%2Ccond-mat%2F0108359%2Ccond-mat%2F0108109%2Ccond-mat%2F0108208%2Ccond-mat%2F0108045%2Ccond-mat%2F0108381%2Ccond-mat%2F0108236%2Ccond-mat%2F0108272%2Ccond-mat%2F0108258%2Ccond-mat%2F0108330%2Ccond-mat%2F0108043%2Ccond-mat%2F0108037%2Ccond-mat%2F0108515%2Ccond-mat%2F0108499%2Ccond-mat%2F0108079%2Ccond-mat%2F0108449%2Ccond-mat%2F0108185%2Ccond-mat%2F0108367%2Ccond-mat%2F0108510%2Ccond-mat%2F0108139%2Ccond-mat%2F0108371%2Ccond-mat%2F0108306%2Ccond-mat%2F0108493%2Ccond-mat%2F0108455%2Ccond-mat%2F0108070%2Ccond-mat%2F0108213%2Ccond-mat%2F0108395%2Ccond-mat%2F0108144%2Ccond-mat%2F0108015%2Ccond-mat%2F0108194%2Ccond-mat%2F0108111%2Ccond-mat%2F0108299%2Ccond-mat%2F0108155%2Ccond-mat%2F0108245%2Ccond-mat%2F0108140%2Ccond-mat%2F0108093%2Ccond-mat%2F0108243%2Ccond-mat%2F0108545%2Ccond-mat%2F0108251%2Ccond-mat%2F0108424%2Ccond-mat%2F0108341%2Ccond-mat%2F0108445%2Ccond-mat%2F0108321%2Ccond-mat%2F0108064%2Ccond-mat%2F0108188%2Ccond-mat%2F0108338%2Ccond-mat%2F0108193%2Ccond-mat%2F0108071%2Ccond-mat%2F0108206%2Ccond-mat%2F0108490%2Ccond-mat%2F0108331%2Ccond-mat%2F0108169%2Ccond-mat%2F0108013%2Ccond-mat%2F0108365%2Ccond-mat%2F0108400%2Ccond-mat%2F0108332%2Ccond-mat%2F0108461%2Ccond-mat%2F0108248%2Ccond-mat%2F0108095%2Ccond-mat%2F0108487%2Ccond-mat%2F0108468%2Ccond-mat%2F0108273%2Ccond-mat%2F0108205%2Ccond-mat%2F0108135%2Ccond-mat%2F0108458%2Ccond-mat%2F0108296%2Ccond-mat%2F0108086%2Ccond-mat%2F0108414%2Ccond-mat%2F0108148%2Ccond-mat%2F0108101%2Ccond-mat%2F0108399%2Ccond-mat%2F0108114%2Ccond-mat%2F0108059%2Ccond-mat%2F0108495%2Ccond-mat%2F0108256%2Ccond-mat%2F0108026%2Ccond-mat%2F0108110%2Ccond-mat%2F0108549%2Ccond-mat%2F0108441%2Ccond-mat%2F0108285%2Ccond-mat%2F0108054%2Ccond-mat%2F0108340%2Ccond-mat%2F0108061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quasi 2D Bose-Einstein condensation in an optical lattice"}, "summary": "We study the phase transition of a gas of Rb atoms to quantum degeneracy in\nthe combined potential of a harmonically confining magnetic trap and the\nperiodic potential of an optical lattice. For high optical lattice potentials\nwe observe a significant change in the temperature dependency of the population\nof the ground state of the system. The experimental results are explained by\nthe subsequent formation of quasi 2D condensates in the single lattice sites.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0108102%2Ccond-mat%2F0108220%2Ccond-mat%2F0108168%2Ccond-mat%2F0108065%2Ccond-mat%2F0108189%2Ccond-mat%2F0108278%2Ccond-mat%2F0108081%2Ccond-mat%2F0108172%2Ccond-mat%2F0108492%2Ccond-mat%2F0108212%2Ccond-mat%2F0108372%2Ccond-mat%2F0108284%2Ccond-mat%2F0108078%2Ccond-mat%2F0108098%2Ccond-mat%2F0108516%2Ccond-mat%2F0108405%2Ccond-mat%2F0108384%2Ccond-mat%2F0108316%2Ccond-mat%2F0108047%2Ccond-mat%2F0108359%2Ccond-mat%2F0108109%2Ccond-mat%2F0108208%2Ccond-mat%2F0108045%2Ccond-mat%2F0108381%2Ccond-mat%2F0108236%2Ccond-mat%2F0108272%2Ccond-mat%2F0108258%2Ccond-mat%2F0108330%2Ccond-mat%2F0108043%2Ccond-mat%2F0108037%2Ccond-mat%2F0108515%2Ccond-mat%2F0108499%2Ccond-mat%2F0108079%2Ccond-mat%2F0108449%2Ccond-mat%2F0108185%2Ccond-mat%2F0108367%2Ccond-mat%2F0108510%2Ccond-mat%2F0108139%2Ccond-mat%2F0108371%2Ccond-mat%2F0108306%2Ccond-mat%2F0108493%2Ccond-mat%2F0108455%2Ccond-mat%2F0108070%2Ccond-mat%2F0108213%2Ccond-mat%2F0108395%2Ccond-mat%2F0108144%2Ccond-mat%2F0108015%2Ccond-mat%2F0108194%2Ccond-mat%2F0108111%2Ccond-mat%2F0108299%2Ccond-mat%2F0108155%2Ccond-mat%2F0108245%2Ccond-mat%2F0108140%2Ccond-mat%2F0108093%2Ccond-mat%2F0108243%2Ccond-mat%2F0108545%2Ccond-mat%2F0108251%2Ccond-mat%2F0108424%2Ccond-mat%2F0108341%2Ccond-mat%2F0108445%2Ccond-mat%2F0108321%2Ccond-mat%2F0108064%2Ccond-mat%2F0108188%2Ccond-mat%2F0108338%2Ccond-mat%2F0108193%2Ccond-mat%2F0108071%2Ccond-mat%2F0108206%2Ccond-mat%2F0108490%2Ccond-mat%2F0108331%2Ccond-mat%2F0108169%2Ccond-mat%2F0108013%2Ccond-mat%2F0108365%2Ccond-mat%2F0108400%2Ccond-mat%2F0108332%2Ccond-mat%2F0108461%2Ccond-mat%2F0108248%2Ccond-mat%2F0108095%2Ccond-mat%2F0108487%2Ccond-mat%2F0108468%2Ccond-mat%2F0108273%2Ccond-mat%2F0108205%2Ccond-mat%2F0108135%2Ccond-mat%2F0108458%2Ccond-mat%2F0108296%2Ccond-mat%2F0108086%2Ccond-mat%2F0108414%2Ccond-mat%2F0108148%2Ccond-mat%2F0108101%2Ccond-mat%2F0108399%2Ccond-mat%2F0108114%2Ccond-mat%2F0108059%2Ccond-mat%2F0108495%2Ccond-mat%2F0108256%2Ccond-mat%2F0108026%2Ccond-mat%2F0108110%2Ccond-mat%2F0108549%2Ccond-mat%2F0108441%2Ccond-mat%2F0108285%2Ccond-mat%2F0108054%2Ccond-mat%2F0108340%2Ccond-mat%2F0108061&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the phase transition of a gas of Rb atoms to quantum degeneracy in\nthe combined potential of a harmonically confining magnetic trap and the\nperiodic potential of an optical lattice. For high optical lattice potentials\nwe observe a significant change in the temperature dependency of the population\nof the ground state of the system. The experimental results are explained by\nthe subsequent formation of quasi 2D condensates in the single lattice sites."}, "authors": ["S. Burger", "F. S. Cataliotti", "C. Fort", "P. Maddaloni", "F. Minardi", "M. Inguscio"], "author_detail": {"name": "M. Inguscio"}, "author": "M. Inguscio", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/epl/i2002-00532-1", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0108037v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0108037v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages (including 3 figures)", "arxiv_primary_category": {"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0108037v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0108037v2", "journal_reference": "Europhys. Lett. 57, 1 (2002).", "doi": "10.1209/epl/i2002-00532-1", "fulltext": "arXiv:cond-mat/0108037v2 5 Nov 2001\n\nQuasi 2D Bose-Einstein condensation\nin an optical lattice\nS. Burger, F. S. Cataliotti, C. Fort, P. Maddaloni,\nF. Minardi, and M. Inguscio\nLaboratorio Europeo di Spettroscopia Nonlineare (LENS),\nIstituto Nazionale per la Fisica della Materia,\nDipartimento di Fisica dell' Università di Firenze,\nLargo Enrico Fermi, 2, I-50125 Firenze, Italia\nOctober 24, 2018\nAbstract\nWe study the phase transition of a gas of 87 Rb atoms to quantum\ndegeneracy in the combined potential of a harmonically confining magnetic trap and the periodic potential of an optical lattice. For high optical lattice potentials we observe a significant change in the temperature\ndependency of the population of the ground state of the system. The\nexperimental results are in good agreement with a model assuming the\nsubsequent formation of quasi 2D condensates in the single lattice sites.\nPACS numbers: 03.75.Fi, 32.80.-t, 85.35.Be\n\nThe physical behaviour of a system is strongly influenced by its dimensionality.\nA well known example is the appearance of plateaus in the Hall resistance across\na twodimensional (2D) electron gas as a function of the number of electrons\n(quantum Hall effect [1]).\nIn atomic physics, important steps towards the realization of pure 2D systems\nof neutral atoms have been made in different systems: Significant fractions of\natomic systems could be prepared in the 2D potentials of optical lattices [2, 3]\nand of an evanescent wave over a glass prism [4], quasicondensates could be\nobserved in 2D atomic hydrogen trapped on a surface covered with liquid 4 He [5],\nand 3D condensates of 23 Na with low atom numbers could be transferred to the\n2D regime by an adiabatic deformation of the trapping potential [6].\nBy using Bose-Einstein condensates (BECs) confined to optical lattices it has\nbecome possible to overcome major limitations of previous experiments: First,\n1\n\n\fan optical lattice can confine a large array of 2D systems, which allows measurements with a much higher number of involved atoms with respect to a single\nconfining potential. Second, the macroscopic population of a single quantum\nstate (BEC) naturally transfers the whole system to a pure occupation of the\n2D systems, which could so far not be realized with thermal atomic clouds.\nExperiments in which BECs were transferred [7, 8, 9, 10] or produced [11, 12, 13]\nin optical lattices concentrated on the measurement of ground state, tunnelling\nand dynamical properties and on atom optical applications. The effects on the\ncondensation process and the change of dimensionality by the superimposement\nof an optical lattice onto a magnetic trapping potential have so far not been\ninvestigated.\nIn this letter, we report on the Bose-Einstein condensation of a dilute gas of 87 Rb\natoms to the combined potential of a static magnetic trap and a one-dimensional\noptical lattice. Varying the temperature of the evaporatively cooled cloud we\nprobe the momentum distribution of atomic clouds across the transition to\nBEC for different strengths of the optical lattice. Besides a shift in the critical\ntemperature, Tc , we find a dramatic change of the temperature-dependency of\nthe condensate fraction with respect to the 3D case which can be explained\nby the subsequent formation of quasi 2D BECs in the lattice sites, each at a\ndifferent transition temperature.\nThe dimensionality of a gas of weakly interacting bosons has important consequences on the thermodynamic properties of the system. While in 3D the gas\nundergoes the phase transition to BEC even in free space, in 2D systems BEC\nat finite temperatures can only exist in a confining potential [14]. Also, quasicondensates, i.e., condensates with regions of uncorrelated phase are expected\nto occur in 2D, as well as in onedimensional (1D) and even in very elongated 3D\nsystems [14, 15, 16]. The mechanisms leading to the lack a global condensate\nphase are quantum fluctuations and – for a temperature T > 0 – interactions\nwith atoms from the thermal cloud. Similar mechanisms lead to the loss of\nphase coherence between condensates confined to different sites of the optical\nlattice [8, 10, 17].\nFor the ideal gas in a 2D harmonic trap with the fundamental frequency ω the\nanalytical solutions for the condensation temperature, Tc , and the dependence\nof the condensate fraction, N0 /N (number of particles in the ground state, N0 ,\nand total particle number, N ) are given by [18, 19]:\n\u00131/2\n\u0012 \u00132\n\u0012\nN0\nT\nN\n,\n=1−\n,\n(1)\nkB Tc = h̄ω\nζ(2)\nN\nTc\nP∞\nwhere ζ(s) is the zeta-function, defined as ζ(s) = n=1 1/ns . In the 3D case\nthese dependencies are:\n\u0012\n\u00131/3\n\u0012 \u00133\nN\nN0\nT\nkB Tc = h̄ω\n,\n=1−\n.\n(2)\nζ(3)\nN\nTc\nIn the experiment we create an array of 2D condensates by superimposing a far2\n\n\fFigure 1: Schematic setup of the experiment. A blue-detuned standing-wave is superposed to the static magnetic trap.\ndetuned, standing laser wave to the long (horizontal) axis of our static magnetic\ntrap. While the magnetic trapping potential is a 3D potential which confines\nthe atoms to an overall cigarshaped distribution, in a 1D optical lattice the\natoms are confined to 2D planes. Therefore, by increasing the depth of the\nnodal planes of the optical lattice superposed to a 3D potential it is possible to\nfollow the transition from a 3D BEC to an array of 2D degenerate atomic clouds\nconfined radially by the magnetic potential and assorted in the axial direction\nlike disks in a shelf.\nDue to the magnetic trapping potential, the central lattice wells are populated\nwith a higher number of atoms, which – according to Eqn. 1 – leads to a higher\ncritical temperature for the central clouds than for the clouds in the wings of the\noverall density distribution. BECs form first in the central 2D disks, lowering\nthe temperature leads to BEC formation at more and more lattice sites. The\ninvestigation of this successive formation of BECs is one of the main purposes\nof the experiments presented in this paper.\nIn the purely magnetic trap (fundamental trapping frequencies ωx = 2π × 8.7 Hz\nand ω⊥ = 2π×90 Hz along the axial and radial directions, respectively) we reach\nthe phase transition to BEC at a temperature of T ≈ 240 nK with a number of\n87\nRb atoms of N ≈ 2 × 106 in the quantum state F=1, mF = −1.\n\nThe 1D optical lattice is created by a retroreflected laser beam superposed\nto the long axis of the magnetic trap (see Fig. 1). The beam is created by a\nstabilized diode laser, with a frequency detuning of ∆ = 2π 150 GHz with respect\nto the D1-line of the Rubidium atoms (wavelength λ = 795 nm, wavenumber\nk = 2π/λ). The dipole potential experienced by the atoms has the form U (~r ) =\nU0 cos2 kx, the depth of the standing-wave dipole-potential wells amounts up to\nU0 ≈ 5 Erec . Here, Erec is the recoil energy of an atom in the optical lattice,\nErec = (h̄k)2 /2m with m being the atomic mass. With this detuning and\nintensity of the light the spontaneous-scattering rate R of photons from the\noptical lattice is of the order R = 10 Hz.\nIn the experiments presented here Bose-Einstein condensates in the combined\nmagnetic trap and optical lattice are prepared by the following procedure: First\nwe cool the atomic cloud in the purely magnetic trap by RF-induced evaporative\ncooling. At a time tl = 50 ms before the end of the RF-ramp we superpose the\n3\n\n\fFigure 2: Absorption images of a thermal cloud (a), a mixed cloud (b) [21], and a pure\nBEC (c), expanded for 26.5 ms from the combined magnetic trap and optical lattice.\nThe corresponding temperatures and atom numbers are T ≈ 210 nK and N ≈ 4 × 105\n(a), T ≈ 110 nK and N ≈ 1.5 × 105 (b), T < 50 nK and N ≈ 1.5 × 104 (c).\n\noptical lattice ot the trapping potential and continue to evaporatively cool the\nensemble. In order to assure that the state reached by the atoms after the end of\nthe RF-ramp is a steady state of the system we use the fact that the periodically\nmodulated density distribution of the BECs in real space corresponds to a comb\nof equally spaced peaks in momentum space. In a time-of-flight measurement we\ncheck that the fraction of atoms in the different momentum components of the\nground state does not depend on tl but only on the depth of the dipole-potential\nwells [12, 20].\nFor reaching the quasi 2D regime, the motion of the particles has to be effectively\n\"frozen\" in the direction of the optical lattice beam [14], i.e., the fundamental\nfrequency in a single lattice site, ωl has to fulfill h̄ωl ≫ kB T . For our experimental parameters of T < 200 nK and ωl ≈ 2π14 kHz (for U0 ≈ 4 Erec ) this relation\nis well satisfied. Nevertheless, due to the small width of the barriers atoms can\ntunnel between the lattice sites. The low energy of thermal atoms allows them\nto tunnel only over a few sites during the duration of the experiment. Therefore\nwe expect only minor changes of the thermodynamic properties due to such\nprocesses. In contrast, tunnelling of ground state atoms is greatly enhanced\nbecause the ground state is macroscopically occupied. As a result, the BECs\nat the optical lattice sites form a phase coherent ensemble giving rise to the\n\n4\n\n\fFigure 3: Ground state occupation vs. temperature in the combined trap with V0 ≈\n4 Erec (circles), and in the 3D purely magnetic trap (triangles). The solid (resp.\ndotted) line gives the expected dependence for the combined (resp. purely magnetic)\ntrap, according to Eqn. 3 (resp. Eqn. 2). The inset shows the dependence of the total\natom number on the temperature reached by forced evaporative cooling. Also here,\ncircles correspond to ensembles in the combined trap and triangles to ensembles in the\npurely magnetic trap.\n\ninterference pattern in the expansion. The fundamental difference in tunnelling\nbehaviour of the thermal cloud and the macroscopically occupied quantum fluid\nis also experimentally seen by applying an external potential to a mixed cloud\nin a similar setup which forces only the ground state fraction to move while the\nthermal distribution of atoms sticks to its initial position [12].\nIn order to measure the effects of the dimensionality on Tc and on N0 /N (T ) we\nhave varied the final temperature of the atomic clouds and recorded the atomic\ndensity distributions by absorption imaging. Figure 2 shows absorption images\nof ensembles at different temperatures, expanded from a combined trap with a\nlattice-potential height of U0 ≈ 4 Erec . Due to their coherence, the interference\npattern of the expanding array of BECs appears in three spatially separated\npeaks (in Fig. 2 b,c) [13]. In order to determine the temperature of the gas we\nfit a 2D bimodal distribution (Gauss + Thomas-Fermi) to the central part of\nthe absorption image (zero order of the diffraction pattern of the BEC array).\nFor the calculation of all temperatures given in this paper we use the Gaussian\nwidth in the radial direction where we expect the expansion not to be affected\nby the presence of the optical lattice.\nBy integrating over the atomic density distribution we obtain the number of\natoms in the ground state, N0 , and in the thermal cloud, Nth = N −N0 . Figure 3\nshows the ground state fraction N0 /N , in dependence of the temperature of the\nensemble. The corresponding total atom numbers are shown in the inset of this\n\n5\n\n\ffigure [22]. In the case of the 3D potential of the pure magnetic trap (triangles\nin Fig. 3) this ratio reproduces the shape expected from Eqn. 2 (dotted line,\nusing a linear fit to the measured function N (T )). The shape of the curve\nfor ensembles produced in the combined trap is much smoother around the\ntransition temperature and mixed clouds with a relatively small condensate\nfraction exist in a broad temperature range well below Tc . It is also seen from\nFig. 3 that in the presence of the optical lattice the transition temperature is\nreduced by a factor of ∼ 2.\n\nThe shape of the curve N0 /N (T ) and the change in transition temperature\ncan be qualitatively understood with the following simplifying picture: We\nassume that, before applying the optical lattice, the envelope of the linear\natomic density of the gas in x-direction is given\np\n√ by a Boltzmann distribution,\nn(x) = α exp(−x2 /2a2th ), with α = N (T )/( 2πath ) and ath =\nkT /mωx2 ,\nwhere the atomnumber N depends on temperature. At a given temperature T ,\na single lattice site, i, is populated by Ni atoms, Ni = ni * λ/2 (ni is the linear\natomic density at site i, λ/2 is the width of a lattice site). According to Eqn. 1\nthere exists a different critical temperature Tci for each lattice site, and in all\nsites with Tci > T the number of ground state atoms is N0i . Therefore the sum\nof particles in the ground state is given by\nN0 (T, N ) =\n\nX\ni\n\nN0i =\n\nX\ni\n\nNi\n\n1−\n\n\u0012\n\nT\nTci\n\n\u00132 !\n\n,\n\n(3)\n\nwhere the summation is performed over all lattice sites with Tci > T . This sum\nof the ground state occupations of the 2D BECs is shown in the solid line in\nFig. 3, where the total atom number N(T) is given by a linear fit to the measured\nvalues. The good agreement of the shapes of the curves indicates that the basic\nprinciple of the phase transition to the array of 2D BECs is accounted for by\nthe simple model. A more sophisticated theoretical modelling of the problem\nshould include interactions and effects like changes of the scattering length, or\nthe effect of tunnelling through the periodic lattice potentials on the density of\nstates and on thermodynamic properties.\nIn conclusion, we have experimentally investigated the Bose-Einstein phasetransition of a weakly interacting atomic gas confined to a periodically modulated potential. We have observed a change of the transition temperature and\nof the ground state occupation of the gas, indicating that we have reached a\nregime of virtually independent formation of 2D BECs at the single lattice sites.\nAs an important result we have found that in order to attain a high ground state\noccupation (\"pure BEC\") of a bosonic ensemble in an optical lattice, one has to\ncool to much lower temperatures than necessary for a pure BEC in the corresponding magnetic trap. The understanding of the thermodynamic properties\nof a BEC in a periodic potential is crucial for future applications of these system, e.g., in atom optics or quantum computing. We plan to further investigate\nexperimental signatures of the 2D regime like changes in the dynamical BEC\nproperties [23] in future studies.\n6\n\n\fWe acknowledge discussions with F. Ferlaino, G. Ferrari, M. Modugno, L. Pitaevskii, G. V. Shlyapnikov, and S. Stringari, and support by the EU under Contracts\nHPRI-CT 1999-00111 & HPRN-CT-2000-00125, and by MURST through the\nPRIN 1999 & 2000 Initiatives.\n\nReferences\n[1] See, e.g., v. Klitzing K., Rev. Mod. Phys., 58 (1986) 519.\n[2] Vuletić V. et al., Phys. Rev. Lett., 81 (1998) 5768.\n[3] Bouchoule I. et al., e-print quant-ph/0106032 (2001).\n[4] Gauck H. et al., Phys. Rev. Lett., 81 (1998) 5298.\n[5] Safonov A. I. et al., Phys. Rev. Lett., 81 (1998) 4545.\n[6] Görlitz A. et al., Phys. Rev. Lett., 87 (2001) 130402.\n[7] Anderson B. P. and Kasevich M. A., Science, 282 (1998) 1686.\n[8] Orzel C. et al., Science, 291 (2001) 2386.\n[9] Morsch O. et al., Phys. Rev. Lett., 87 (2001) 140402.\n[10] Greiner M. et al., Phys. Rev. Lett., 87 (2001) 160405.\n[11] Burger S. et al., Phys. Rev. Lett., 86 (2001) 4447.\n[12] Cataliotti F. S. et al., Science, 293 (2001) 843.\n[13] Pedri P. et al., Phys. Rev. Lett., 87 (2001), in production; e-print\ncond-mat/0108004 (2001).\n[14] Petrov D. S. , Holzmann M., and Shlyapnikov G. V.. Phys. Rev. Lett., 84\n(2000) 2551.\n[15] Petrov D. S., Shlyapnikov G. V., and Walraven J. T. M., Phys. Rev. Lett.,\n87 (2001) 050404.\n[16] Dettmer S. et al., Phys. Rev. Lett., 87 (2001) 160406.\n[17] Pitaevskii L. and Stringari S., Phys. Rev. Lett., 87 (2001) 180402.\n[18] Bagnato V. and Kleppner D., Phys. Rev. A, 44 (1991) 7439.\n[19] Dalfovo F. et al., Rev. Mod. Phys., 71 (1999) 463.\n[20] Strictly, this criterion is valid for reaching the groundstate within the single\nwells. A further indication that we reach also the thermodynamic steady\nstate of the system is given by the fact that for similar starting conditions,\nvery differing momentum distributions in the cloud are observed, ranging\nfrom thermal clouds to pure BECs, dependent on temperature (see Fig. 2).\n[21] Please note that Josephson tunnelling of ground state atoms leads to the\nformation of a well defined phase over the whole array of 2D condensates\neven when a thermal component is present [12, 13].\n[22] We have calibrated the measurement of the atomic density using Eqn. 2.\nThe observed reduction of N is compatible with the expected loss due to\nlight scattering from the optical lattice beams; heating effects are neglected\non the time scales of our experiments.\n[23] S. Stringari, priv. comm.\n\n7\n\n\f"}