{"id": "http://arxiv.org/abs/cond-mat/0012412v1", "guidislink": true, "updated": "2000-12-21T17:07:11Z", "updated_parsed": [2000, 12, 21, 17, 7, 11, 3, 356, 0], "published": "2000-12-21T17:07:11Z", "published_parsed": [2000, 12, 21, 17, 7, 11, 3, 356, 0], "title": "Dynamical quenching and annealing in self-organization multiagent models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0012002%2Ccond-mat%2F0012440%2Ccond-mat%2F0012382%2Ccond-mat%2F0012412%2Ccond-mat%2F0012365%2Ccond-mat%2F0012394%2Ccond-mat%2F0012413%2Ccond-mat%2F0012027%2Ccond-mat%2F0012284%2Ccond-mat%2F0012307%2Ccond-mat%2F0012200%2Ccond-mat%2F0012410%2Ccond-mat%2F0012098%2Ccond-mat%2F0012439%2Ccond-mat%2F0012429%2Ccond-mat%2F0012146%2Ccond-mat%2F0012148%2Ccond-mat%2F0012054%2Ccond-mat%2F0012314%2Ccond-mat%2F0012003%2Ccond-mat%2F0012166%2Ccond-mat%2F0012220%2Ccond-mat%2F0012517%2Ccond-mat%2F0012250%2Ccond-mat%2F0012255%2Ccond-mat%2F0012043%2Ccond-mat%2F0012455%2Ccond-mat%2F0012454%2Ccond-mat%2F0012227%2Ccond-mat%2F0012397%2Ccond-mat%2F0012498%2Ccond-mat%2F0012107%2Ccond-mat%2F0012310%2Ccond-mat%2F0012262%2Ccond-mat%2F0012147%2Ccond-mat%2F0012087%2Ccond-mat%2F0012071%2Ccond-mat%2F0012231%2Ccond-mat%2F0012014%2Ccond-mat%2F0012101%2Ccond-mat%2F0012420%2Ccond-mat%2F0012165%2Ccond-mat%2F0012138%2Ccond-mat%2F0012448%2Ccond-mat%2F0012380%2Ccond-mat%2F0012059%2Ccond-mat%2F0012179%2Ccond-mat%2F0012224%2Ccond-mat%2F0012283%2Ccond-mat%2F0012158%2Ccond-mat%2F0012141%2Ccond-mat%2F0012355%2Ccond-mat%2F0012491%2Ccond-mat%2F0012019%2Ccond-mat%2F0012325%2Ccond-mat%2F0012092%2Ccond-mat%2F0012425%2Ccond-mat%2F0012094%2Ccond-mat%2F0012264%2Ccond-mat%2F0012040%2Ccond-mat%2F0012334%2Ccond-mat%2F0012082%2Ccond-mat%2F0012130%2Ccond-mat%2F0012076%2Ccond-mat%2F0012416%2Ccond-mat%2F0012236%2Ccond-mat%2F0012273%2Ccond-mat%2F0012377%2Ccond-mat%2F0012189%2Ccond-mat%2F0012142%2Ccond-mat%2F0012281%2Ccond-mat%2F0012305%2Ccond-mat%2F0012360%2Ccond-mat%2F0012105%2Ccond-mat%2F0012277%2Ccond-mat%2F0012428%2Ccond-mat%2F0012463%2Ccond-mat%2F0012203%2Ccond-mat%2F0012242%2Ccond-mat%2F0012349%2Ccond-mat%2F0012100%2Ccond-mat%2F0012370%2Ccond-mat%2F0012079%2Ccond-mat%2F0012431%2Ccond-mat%2F0012097%2Ccond-mat%2F0012503%2Ccond-mat%2F0012433%2Ccond-mat%2F0012062%2Ccond-mat%2F0012489%2Ccond-mat%2F0012443%2Ccond-mat%2F0012457%2Ccond-mat%2F0012033%2Ccond-mat%2F0012402%2Ccond-mat%2F0012132%2Ccond-mat%2F0012256%2Ccond-mat%2F0012072%2Ccond-mat%2F0012175%2Ccond-mat%2F0012298%2Ccond-mat%2F0012182%2Ccond-mat%2F0012373%2Ccond-mat%2F0012204&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamical quenching and annealing in self-organization multiagent models"}, "summary": "We study the dynamics of a generalized Minority Game (GMG) and of the Bar\nAttendance Model (BAM) in which a number of agents self-organize to match an\nattendance that is fixed externally as a control parameter. We compare the\nusual dynamics used for the Minority Game with one for the BAM that makes a\nbetter use of the available information. We study the asymptotic states reached\nin both frameworks. We show that states that can be assimilated to either\nthermodynamic equilibrium or quenched configurations can appear in both models,\nbut with different settings. We discuss the relevance of the parameter $G$ that\nmeasures the value of the prize for winning in units of the fine for losing. We\nalso provide an annealing protocol by which the quenched configurations of the\nGMG can progressively be modified to reach an asymptotic equlibrium state that\ncoincides with the one obtained with the BAM.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cond-mat%2F0012002%2Ccond-mat%2F0012440%2Ccond-mat%2F0012382%2Ccond-mat%2F0012412%2Ccond-mat%2F0012365%2Ccond-mat%2F0012394%2Ccond-mat%2F0012413%2Ccond-mat%2F0012027%2Ccond-mat%2F0012284%2Ccond-mat%2F0012307%2Ccond-mat%2F0012200%2Ccond-mat%2F0012410%2Ccond-mat%2F0012098%2Ccond-mat%2F0012439%2Ccond-mat%2F0012429%2Ccond-mat%2F0012146%2Ccond-mat%2F0012148%2Ccond-mat%2F0012054%2Ccond-mat%2F0012314%2Ccond-mat%2F0012003%2Ccond-mat%2F0012166%2Ccond-mat%2F0012220%2Ccond-mat%2F0012517%2Ccond-mat%2F0012250%2Ccond-mat%2F0012255%2Ccond-mat%2F0012043%2Ccond-mat%2F0012455%2Ccond-mat%2F0012454%2Ccond-mat%2F0012227%2Ccond-mat%2F0012397%2Ccond-mat%2F0012498%2Ccond-mat%2F0012107%2Ccond-mat%2F0012310%2Ccond-mat%2F0012262%2Ccond-mat%2F0012147%2Ccond-mat%2F0012087%2Ccond-mat%2F0012071%2Ccond-mat%2F0012231%2Ccond-mat%2F0012014%2Ccond-mat%2F0012101%2Ccond-mat%2F0012420%2Ccond-mat%2F0012165%2Ccond-mat%2F0012138%2Ccond-mat%2F0012448%2Ccond-mat%2F0012380%2Ccond-mat%2F0012059%2Ccond-mat%2F0012179%2Ccond-mat%2F0012224%2Ccond-mat%2F0012283%2Ccond-mat%2F0012158%2Ccond-mat%2F0012141%2Ccond-mat%2F0012355%2Ccond-mat%2F0012491%2Ccond-mat%2F0012019%2Ccond-mat%2F0012325%2Ccond-mat%2F0012092%2Ccond-mat%2F0012425%2Ccond-mat%2F0012094%2Ccond-mat%2F0012264%2Ccond-mat%2F0012040%2Ccond-mat%2F0012334%2Ccond-mat%2F0012082%2Ccond-mat%2F0012130%2Ccond-mat%2F0012076%2Ccond-mat%2F0012416%2Ccond-mat%2F0012236%2Ccond-mat%2F0012273%2Ccond-mat%2F0012377%2Ccond-mat%2F0012189%2Ccond-mat%2F0012142%2Ccond-mat%2F0012281%2Ccond-mat%2F0012305%2Ccond-mat%2F0012360%2Ccond-mat%2F0012105%2Ccond-mat%2F0012277%2Ccond-mat%2F0012428%2Ccond-mat%2F0012463%2Ccond-mat%2F0012203%2Ccond-mat%2F0012242%2Ccond-mat%2F0012349%2Ccond-mat%2F0012100%2Ccond-mat%2F0012370%2Ccond-mat%2F0012079%2Ccond-mat%2F0012431%2Ccond-mat%2F0012097%2Ccond-mat%2F0012503%2Ccond-mat%2F0012433%2Ccond-mat%2F0012062%2Ccond-mat%2F0012489%2Ccond-mat%2F0012443%2Ccond-mat%2F0012457%2Ccond-mat%2F0012033%2Ccond-mat%2F0012402%2Ccond-mat%2F0012132%2Ccond-mat%2F0012256%2Ccond-mat%2F0012072%2Ccond-mat%2F0012175%2Ccond-mat%2F0012298%2Ccond-mat%2F0012182%2Ccond-mat%2F0012373%2Ccond-mat%2F0012204&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the dynamics of a generalized Minority Game (GMG) and of the Bar\nAttendance Model (BAM) in which a number of agents self-organize to match an\nattendance that is fixed externally as a control parameter. We compare the\nusual dynamics used for the Minority Game with one for the BAM that makes a\nbetter use of the available information. We study the asymptotic states reached\nin both frameworks. We show that states that can be assimilated to either\nthermodynamic equilibrium or quenched configurations can appear in both models,\nbut with different settings. We discuss the relevance of the parameter $G$ that\nmeasures the value of the prize for winning in units of the fine for losing. We\nalso provide an annealing protocol by which the quenched configurations of the\nGMG can progressively be modified to reach an asymptotic equlibrium state that\ncoincides with the one obtained with the BAM."}, "authors": ["E. Burgos", "H. Ceva", "R. P. J. Perazzo"], "author_detail": {"name": "R. P. J. Perazzo"}, "author": "R. P. J. Perazzo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.64.016130", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/cond-mat/0012412v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cond-mat/0012412v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "around 20 pages, 10 figures", "arxiv_primary_category": {"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cond-mat/0012412v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cond-mat/0012412v1", "journal_reference": "Physical Review E64, 016130 (2001)", "doi": "10.1103/PhysRevE.64.016130", "fulltext": "Dynamical quenching and annealing in self-organization\nmultiagent models\nE. Burgos1∗ , Horacio Ceva1† , R.P.J. Perazzo2,3‡\n1 Departamento\n\narXiv:cond-mat/0012412v1 21 Dec 2000\n\nde Fı́sica, Comisión Nacional de Energı́a Atómica,\nAvda. del Libertador 8250,1429 Buenos Aires, Argentina\n2 Departamento de Fı́sica FCEN,Universidad de Buenos Aires,\nCiudad Universitaria - Pabellón 1, 1428 Buenos Aires, Argentina\n3 Centro de Estudios Avanzados, Universidad de Buenos Aires,\nUriburu 950, 1114 Buenos Aires, Argentina\n(21 December 2000)\n\nAbstract\nWe study the dynamics of a generalized Minority Game (GMG) and of the\nBar Attendance Model (BAM) in which a number of agents self-organize to\nmatch an attendance that is fixed externally as a control parameter. We compare the usual dynamics used for the Minority Game with one for the BAM\nthat makes a better use of the available information. We study the asymptotic\nstates reached in both frameworks. We show that states that can be assimilated to either thermodynamic equilibrium or quenched configurations can\nappear in both models, but with different settings. We discuss the relevance\nof the parameter G that measures the value of the prize for winning in units\nof the fine for losing. We also provide an annealing protocol by which the\nquenched configurations of the GMG can progressively be modified to reach\nan asymptotic equlibrium state that coincides with the one obtained with the\nBAM.\nPACS Numbers: 02.50.Le,05.40.-a, 64.60.Ak, 89.90.+n\n\nI. INTRODUCTION\n\nIn recent times considerable attention has been given to the description of selforganization processes in multiagent models. These are geared to explain how (and which)\n\n∗ e-mail\n\nburgos@cnea.gov.ar\n\n† e-mail\n\nceva@cnea.gov.ar\n\n‡ perazzo@df.uba.ar\n\n1\n\n\findividual decisions give rise to cooperative effects that show up in the behavior of the system as a whole. Such models have a wide number of interesting applications in a variety\nof situations that range from routing of messages in an information network to the way in\nwhich equilibrium is (dynamically) achieved by an ensemble of economic agents.\nThe main question posed in this line of analysis is how a system composed of multiple\nagents acting in a decentralized fashion is able to reach a state of \"macroscopic order\" in\nwhich individual decisions appear to be coordinated with one another. A well know example\nof this line of research is the Bar Attendance Model (BAM) proposed by B. Arthur in Ref [1].\nThis model has been developed to illustrate a case of coordination through a process that\ncan be assimilated to inductive learning.\nIn the BAM a (large) number of individuals have to decide whether or not to go to a\nbar at a certain date. They share the common perception that attendance is not desirable\nwhen the number of people who are present exceeds a critical value, which is smaller than\nthe total population of clients. Otherwise they derive utility from going to the bar.\nA dynamics is proposed by which each agent individually updates her criteria to decide\nthe attendance. These are based upon public information, that concerns the total attendance\nin the previous days. Agents use inductive reasoning to predict the number of customers in\nthe following day.\nIt is simple to realize that the model is self-deceiving: if everybody decides to attend,\ncrowding is produced and everybody loses. Everybody will then refrain to go the next day\nsituation in which, again, everybody loses because many could go without crowding. In an\niterated version of the model agents plan their attendance for the next few days. In this case\nit is more evident that the only stable solution is a situation in which a diversity of individual\nstrategies compensate with each other saturating the capacity of the bar every day. The\nsystem self-organizes in a (dynamic) Nash equilibrium in which every agent optimizes their\nrespective situation given what has been done by the rest of the players. In this case any\nplayer that changes unilaterally her rules ends up loosing. Such equilibrium is also Pareto\noptimal because no agent can improve her situation without harming that of some other\nplayer. If adaptation is stocastic, the attendance equilibrates at the accepted value with\nrandom fluctuations.\nAn alternative version of the BAM called the Minority Game (MG) has recently received\nmuch attention [2], [3], [4], [5]. The main feature of this framework is that agents derive\nutility whenever their choice coincides with that of the minority. Self deceiving is also evident\nwithin this framework. The MG has been presented as a simplified version of the BAM. In\nthe present paper we concentrate in the approach of the MG introduced in ref. [5] and make\na detailed comparison of the MG and the BAM. We will see that the MG, besides being a\nparticular case of the BAM (namely one in which the optimal attendance has been fixed at\nhalf of the total number of customers) it makes a different use of the same information [6].\nThe treatments of the BAM have traditionally [1], [7] been based upon genetic algorithms\n[11]. Each agent is assumed to keep a set of strings that encode her possible attendance\nschedules for the following days. After that period each agent computes the outcome of all\nher possible plans and chooses the best to use it during the next period. The attendance\nschedules are considered as the \"genomes\" of a genetic algorithm and are updated by selection, random mutations and crossover. The BAM can be regarded as an iterated version of\nthe MG, i.e. one in which players have to make their choices for several rounds of the same\n2\n\n\fgame. There is however one important difference. The BAM only involves (the iteration\nof) pure strategies where players either go or not go to the bar. The players in the MG\nhave instead mixed strategies, i.e. they make their choice of going or not going with a given\nprobability. The iterated pure strategies in the BAM undergo an adaptive process. Within\nthe MG mixed strategies also change. Each agent randomly attends the bar (with a given\nprobability) and collects points or pays fines depending that the attendance is below or above\nthe acceptable level. The mixed strategy (i.e.her attendance probability) is changed when\nher account falls below a given threshold. Both the BAM and the probabilistic approach\nof ref. [5] can be regarded as mean field descriptions because only the aggregate effect of\nthe whole ensemble of agents is relevant for both adaptive processes. On the other hand,\nthe mixed strategy played by the agents in the MG can be assimilated to a time averaged\nversion of the iterated attendace schedules of the players in the BAM.\nIn order to render possible a comparison between the MG and the BAM two elements\nhave to be considered. On the one hand a generalized version of the MG (the GMG) has\nto be developed to describe situations traditionally considered within the BAM, namely\ncases in which the winning choice is to meet the one taken by an arbitrary fraction of the\npopulation, not just the minority. There are no systematic studies of this GMG. On the\nother hand a probabilistic (mixed strategy) mean field approach of the BAM has to be\ndeveloped. There are a number of possibilities to define the mixed strategies for these two\nmodels. In the present paper we consider for the GMG an obvious extension of the adaptive\nupdating dynamics that reproduces the well known selforganizing features of the MG. For\nthe BAM we propose instead a mixed strategy that reproduces the results obtained with\nthe usual treatments of this model that use iterated, pure strategies. It turns out that both\ndynamics are different. It happens that the one associated to the BAM makes a better use of\nthe available information than in the GMG. Although in both frameworks - GMG and BAM\n- all agents have access to the same information, with the proposed BAM rules they are able\nto keep better track of the causes for winning or loosing thus making a more effective use of\nit than in the GMG. These seamingly minor changes produce widely different cooperative\nbehaviors. The GMG leads in general to quenched states that are far from equilibrium.\nThe BAM evolution leads instead to an asymptotic configuration that can be thought of as\na thermodynamic equilibrium: it has lost memory of the initial conditions, the individual\nstrategies continue to be updated at all times and yet the density distribution of attendance\nstrategies remains stationary. In the following sections we discuss how both models yield\nsimilar results in a rather reduced portion of the space of parameters but turn out to be\nlargely different in all the rest. We show that an essential parameter that governs the selforganized configuration of the system is determined by the rewards and punishments that\nare contained in the scoring of successes and failures of the agents. The control parameter\nis the value G of the prize for winning relative to the fine for losing. Ordinarily the effect\nof this parameter has been disregarded and the only case studied in the literature is G = 1.\nQuenching and equilibrium regions change significantly for G 6= 1.\nIn the next Section we describe and characterize the quenched state in the GMG and\ndiscuss the phase diagram that is found if G is left as a free parameter. In Section 3 we\ncompare this to the BAM. In Sect. 4 we provide an analytic discussion to support the results\npresented in the previous sections. In Sect. 5 we present an annealing protocol that makes\nuse of the fact that quenching is a consequence of the memory stored in the system encoded\n3\n\n\fby the points gained by the agents. The protocol allows to reach equilibrium using the MG\ndynamics by modifying progressively the quenched state removing the memory stored in the\nsystem.\nII. THE GMG MODEL\n\nWe consider an N-agent system in which each has an mixed attendance strategy expressed by a probability pi (i = 1, 2, . . . , N) to go to the bar. We take n to be the acceptable\nlevel of attendance without crowding. The prescription to adapt the individual strategies is\nthe following. If the attendance A turns out to be A ≤ n, and the agent chooses to go to\nthe bar, she gains G points. Otherwise, pays a fine of one point. The value G is left as a\nfree parameter .\nThe balance of gains and losses keeps a record of successes and failures of each agent. If\nthe latter are more frequent than the former, her account ends up by falling below some fixed\nthreshold (that we take to be 0). In this case her account is reset to zero and her strategy\npi is updated. This is done by changing the value of pi by one chosen at random within the\ninterval (pi − δp, pi + δp). The witdth of this interval (we take δp = .05) is left unchanged\nduring the whole process. Reflective boundary conditions for pi are used whenever necessary.\nAll N agents have initially 0 points and their initial attendance strategies are chosen with\nsome criterion. In the present section we restrict ourselves to consider the case in which all\np's are initially chosen at random from the interval [0, 1] with uniform probability.\nThe state of the many agent system is well described by the density distribution P (p)\nthat gives the fraction of agents that have a strategy within the interval (p, p + dp). In\norder to calculate this we generate an ensemble of H histories of the N-agent system by\nevolving it during a fixed number of iterations and starting from statistically equivalent\ninitial conditions. The density P (p) is obtained by normalizing the frequency of occurrence\nof a given strategy in the whole set of the H histories. The number of iterations is fixed by\nchecking that a stationary configuration has been reached.\nWe also compute other parameters that describe the state of the system. One is the\nattendance A(t) averaged over the H histories as a function of the iteration number t; in the\nfollowing we quote M(t) ≡ A(t)/N, to facilitate the comparison for different values of N.\nA second important parameter is the fraction of agents Cs (t) that change their individual\nstrategies as a function of the iteration number. This fraction provides a direct measure of\nthe stability of the state that has been reached. We will use P∞ to refer to the asymptotic\ndistribution, t → ∞, whenever the system reaches an stationary state.\nA well known result obtained within the framework of the pure MG is a strong polarMG\nization of the population. A distribution P∞\n(p) is reached in which essentially half of the\nagents always go to the bar while the other half never go . As a consequence M(t) → 1/2\nexcept for random fluctuations due to the updating of individual strategies that take place\nat all times [5], [9].\nThe evolution of a system with the GMG rules and n 6= N/2 has been studied by Johnson\n[8] and by us [6]. If the reduced acceptable level of attendance μ ≡ n/N is close enough\nto 1/2 an equilibrium situation is reached that resembles the MG results (see Fig.1a)).\nEquilibrium is shown by the fact that M → μ and Cs (t) stabilizes at a constant, non zero\nvalue after a transient. In Fig. 1b) we show typical plots of M(t) and Cs (t) for this situation.\n4\n\n\fOn the contrary, if μ is larger than a critical value μcr (see below) a situation is reached in\nwhich no further updating of the strategies takes place ('quenched' configuration). In Fig. 2\nwe show an example of the distribution Pq (p) that is obtained by setting μ > μcr > 1/2.\nGM G\nThe distribution Pq (p) that is obtained strongly differs from P∞\n(p). The fact that\nCs (t) tends exponentially to 0 (see Fig.2b)) indicates that a situation has been found that\nis completely different than the one commented before. This happens because the largest\nfraction of the population has gained many points and even though their accounts may fluctuate, they are not expected to fall below the threshold required to update their individual\nstrategies. The consequence of this is that M stabilizes at a value that may be far from μ.\nWhile the situation for μ ∼ 1/2 can be thought as some kind of thermodynamic equilibrium, this case should instead be associated to a quenched configuration in which the state\nvariables are rapidly fixed at values that are close to the initial conditions.\nWe have performed extensive numerical simulations to investigate this situation using\nvalues of μ above and below 1/2 and several values of G. As expected an overall symmetry\nis found around μ = 1/2. This is because matching an attendance level greater than 1/2 is\nequivalent as matching a symmetric absence level equally greater than 1/2. As will shortly\nbecome evident symmetry is not strict. We discuss this point in Section 5.\nSeveral features that are displayed in the quenched distribution shown in Fig. 2 are worth\nto be remarked. In the first place it is found that Pq (p) = 0 for 0 < p < 1/2 and μ ≫ 1/2.\nThis can easily be understood. When μ ≫ 1/2 the agents that have p < 1/2 lose more\nfrequently that they win and therefore update their attendance strategies more frequently\nincreasing the value of p whenever possible. Once their individual strategies are greater that\n1/2 the inverse happens, agents seldom lose points and therefore are not forced to update\ntheir individual strategies. This also justifies that the width of the hump near p = 1/2 turns\nout to be only a function of δp.\nThe above arguments indicate that the shape of Pq (p) strongly depends upon the initial\nconditions. This is the reason why we prefer to call this effect \"quenching\" rather that\n\"freezing\". The latter suggests a new ordering that bears no relationship with the initial\nconditions, while the former indicates that a dynamics has been imposed that suddenly\nreaches a fixed point leaving the internal parameters of the system at values that are close\nto the ones chosen with the initial conditions and that may be far from equilibrium.\nIn Fig. 3 we illustrate some cases in which quenching takes place. We plot the asymptotic\nvalue of the reduced attendance M reached by the system as a function of μ, displaying only\nthe sector with μ > 1/2, for several values of G.\nIn Fig.(3b) we also show a plot of the dispersion σM of the values of M obtained in all\nP\n2\n2\nthe H histories of the ensemble (σM\n= H\nh (A∞ (h)− < A∞ >H ) )/NH). This parameter\nplays the rôle of a susceptibility. It displays a peak located at the transition region and is\nessentially constant outside it. The finite width of the peak as well as the irregularities of\nM in the transition region are to be attributed to the finiteness of the system.\nIt is possible to associate a critical value μcr with the change between both regimes. In\nthe numerical experiments, the large fluctuations of M near μcr are due to the fact that some\nof the histories that make up the ensemble happen to quench while others, purely due to\nrandom fluctuations, reach instead equilibrium. As μ increases, the proportion between both\ntypes of histories gradually changes leading to the situation in which all possible evolutions\nlead to quenched states. The peaked behavior of σM at μ = μcr supports the picture that a\n5\n\n\fsort of critical phenomenon actually takes place in the system for a precise value of μ.\nThere are several criteria to define μcr . We have chosen to define it by the minimum value\nof μ for which the dynamics leads the system to a situation in which the whole population\nhas accumulated a fixed gain, that we (arbitrarily) chose to be not less than 20 points. In\nFig.(3b) we show φ20 , the fraction of the population that has accumulated at least 20 points\nas a function of μ. It is clear that if this happens any further changes in the distribution\nP (p) or in the attendance are extremly unlikely to occur. Another possibility is to choose\nthe value of μ that corresponds to the intersection of the lines that are associated to both\nregimes or the maximum of σM . Again the difference between these deffinitions are to be\nattributed to the finitness of the systems that we have studied.\nThe value of μcr depends both upon G and N. Changes in G have not been explored\npreviously and cause important changes in the region in which quenching occurs as well\nGM G\nas in the shape of the distribution P∞\n(p). The effects of the value of G in μcr can be\nseen in Fig. 3a). The general phase diagram (see Fig.4) shows two regions that correspond\nto quenched and unquenched systems. The border between both regions is given by the\nfunction μcr (G). Finite size effects are also displayed in this figure through the values of\nμcr (G) for two values of N. The results displayed in Fig. 4 allows to conjecture that for an\ninfinite system with G = 1 and μ = 1/2 the usual settings of the Minority Game lead to an\nunstable quenched phase.\nGM G\nThe changes in the distribution P∞\n(p) that are due to changes in μ keeping G fixed\nare shown in figs 1 and 2 and 5a). An increase in μ produces an increasingly asymmetric\ndistribution. This hold up to the point in which μ > μcrit and quenching occurs giving rise to\na humped distribution PqGM G (p). The changes introduced by different values of G are shown\nin Fig. 5b). The overall effect of this parameter is to increase the polarization, preserving\nthe level of asymmetry fixed by μ. Values of G < 1 are reflected in distributions that are\nbarely peaked at the corners. The polarization increases for G = 1 and values of G that\nGM G\nare only slightly larger than 1 produce distributions P∞\n(p) that vanish for all values of p\nexcept in the close neighborhood of p = 0 and p = 1. Values of G that are even larger places\nthe system into the quenching region of the phase diagram because every successful initial\nmove produces such a large gain that a revision of the strategy becomes extremely unlikely;\ntherefore the evolution of the system produces only mild changes in the initial distribution.\nIII. THE BAM MODEL\n\nThe dynamics of the GMG does not keep track of the situations that lead to succeses or\nfailures. This is instead stressed in the BAM. It has been customary to accept that agents\nderive utility in two situations: one when they decide to go to the bar and M ≤ μ and also\nwhen they refrain to go to the bar and M > μ.\nWe propose for the BAM an adaptive dynamics that is based upon the same information\nas in the GMG but uses it differently in order to keep track of the situations that lead to\ngains or losses i.e. by correlating them with the action of going or not going to the bar.\nTo this end we introduce \"points\" and \"credits\". Points are gained or lost if the option of\nattending the bar is correct or not. Credits are instead gained or lost depending whether\nthe option of not attending the bar is correct or not. We therefore carry a double account.\nIf an agent chooses to attend (not to attend) the bar and M < μ (M > μ) gains a point (a\n6\n\n\fcredit). Otherwise, she loses a point (a credit). When either the number of points or the\nnumber of credits falls below some threshold, the corresponding account of points or credits\nis reset to zero and the strategy is changed in the same fashion as already mentioned for the\nGMG.\nNote that the attendance strategy of an agent is changed by either of two reasons. Such\nupdating rule makes use of information that is lost with the scoring rules used for the GMG.\nSuppose for instance that an agent having initially all her accounts in zero chooses to go to\nthe bar one day in which M < μ and chooses not to go the next day when the attendance\nturns out to be again M < μ. Within the GMG rules she ends up with zero points and her\nstrategy is not updated. With the double account of the BAM she ends up instead with one\npositive point and one negative credit and is therefore forced to update her strategy [10].\nWe have performed numerical simulations using this dynamics with similar settings than\nthose reported in the preceeding section. The results for the BAM are compared with those\nobtained with the GMG dynamics in Figs. 1,2. When quenching is absent in the GMG, the\nBAM\nGM G\nasymptotic distributions P∞\n(p) can barely be distinguished from P∞\n(p). For this case\nthe values of the attendance A(t) and Cs (t) for the BAM are shown in Fig. 1b). A strong\ndifference however occurs when μ > μcr and the GMG gets trapped in a quenched configuration. For the same settings the BAM converges instead to equilibrium. The asymptotic\nBAM\ndistribution P∞\nshows a strong polarization and the attendance reaches the accepted\nlevel without difficulty. The nature of the asymptotic state has no difference with that for\nμ < μcr . This can be seen in Fig. 2b).\nA more profound diference between the two model arises when the above analysis is\nrepeated for G 6= 1. While the GMG dynamics can be checked to lead to quenched configurations for essentially all values of G, as shown in Fig.4, the BAM model displays no\nquenching independently of the value of G. Quenching can however occur in the BAM but\nfor different initial conditions than a uniform distribution. We turn to this point in the next\nsection.\nIV. ANALYTIC DISCUSSION\n\nIn this section we discuss analytically the relevant features of the density distribution\nP (p) as well as the occurrence of quenching within both the GMG and the BAM.\nA. The density distribution\n\nThe shape of the distribution P (p) is the combined result of the actions of the whole\nensemble of agents. Each player adjusts her attendance attempting to minimize her individual loss. When equilibrium is reached the resulting P∞ (p) for both GMG and BAM,\nconcentrates the population in the immediate neighborhood of p ≃ 0 and p ≃ 1, plus an\nalmost vanishing contribution from intermediate values. The ratio of the areas below the\ntwo peaks is, essentially, equal to μ/(1 − μ). An intuitive guess for P (p) could well be\ninstead a sharply peaked function centered at p ≃ μ. The difference has to be sought in the\nproperties of the distribution P(A) that gives the probability of occurrence of a party of A\ncustomers attending the bar. The distribution P(A) is of course completely determined by\n7\n\n\fP (p). If P (p) ≃ δ(p − μ) the corresponding P(A) turns out to be large for values of A that\ndiffer from the optimal one, the highly polarized equilibrium distribution that is actually\ngenerated produces instead a P(A) that is much more concentrated near A = Nμ.\nLet us assume without loss of generality that all the agents distribute themselves into D\ndifferent strategies pi ; i = 1 . . . D according to:\nP (p) =\n\nD\nX\ni\n\nwhere\n\nPD\ni\n\nni\nδ(p − pi ).\nN\n\n(1)\n\nni = N. With this assumption, the distribution P(A) can be written as:\nP(A) =\n\nn1\nX\n\n...\n\nl1 =0\n\nnD Y\nD\nX\n\nlD =0 i\n\nD\nX\nni li\nlj ).\npi (1 − pi )ni −li ] × δ(A −\n[\nli\nj\n\n!\n\n(2)\n\nThe value (A − Nμ)2 measures the departure from the optimal attendance, and therefore\nP\nC 2 = A P(A)(A − Nμ)2 can be taken to measure the square of the average cost incurred\nby the ensemble of agents while adjusting their individual strategies [12].\nAlthough Eq.2 is in general difficult to evaluate, C 2 can be calculated without great\ndifficulties. In fact if its definition is introduced into Eq.2, the summation over A can be\nP\nperformed first, taking advantage of the δ(A − D\nj lj ) and all the summations over the lj\nindices decouple from each other. It results\n2\n\nC =\n\nn1\nX\n\nl1 =0\n\n...\n\nnD Y\nD\nX\n\nlD =0 i\n\nD\nX\nni li\nni −li\nlj )2 .\n] × (Nμ −\npi (1 − pi )\n[\nli\nj\n\nMoreover, from Eq.(1), < p >=\nD → ∞ one gets\n\n!\n\nP\n\ni\n\nni pi /N and < p2 >=\n\nP\n\ni\n\n(3)\n\nni p2i /N, thus in the limit\n\nC 2 = N 2 (μ− < p >)2 + N(< p > − < p2 >)\n\n(4)\n\nIn Eq.4 < p > stands for pP (p)dp. If P (p) = 1/N as for the case of the initial\nconditions chosen in all the simulations in the preceeding sections, the dispersion turns out\nto be C 2 = N 2 (μ − 1/2)2 + N/6. We thus see that such initial condition is a good guess\nfor the traditional settings of the MG when μ ≃ 1/2, but is indeed very poor for the GMG\nwhen μ 6= 1/2.\nThe equilibrium result < p >= μ that is always found, is seen to eliminate the O(N 2 )\nterms in C 2 . This is also achieved with the guess P (p) = δ(p − μ). However, all O(N) terms\ndo not cancel because C 2 = Nμ(1 − μ). If the two peaked equilibrium distribution is roughly\napproximated by P (p) = nN1 δ(p − p1 ) + nN2 δ(p − p2 ) one readily sees that the O(N 2 ) terms\nare eliminated when n1 p1 + n2 p2 = μN. The O(N) terms also cancel if the two peaks are\np1 = 0; n1 = N(1 − μ) and p2 = 1; n2 = Nμ.\nFrom this point of view, quenched states are far from optimizing the average aggregate\ncost C 2 because the corresponding Pq (p) do not even cancel the O(N 2 ) terms. The relaxation\ndynamics that tends to minimize individual losses is thus seen to also optimize a global\nparameter (C 2 ) only if equilibrium is reached. Otherwise the relaxation stops when no agent\nloses. This situation, in general, does not corresponds to a minimal average cost.\nR\n\n8\n\n\fB. BAM\n\nIn this section we discuss the occurrence of equilibrium and quenching within the BAM.\nThis can only be made without any approximation if one assumes a distribution P (p) =\nδ(p − po ). This is seen to be appropriate except for O(N) terms in the dispersion of party\nsizes.\nGiven an acceptable level of attendance n, if all agents have the same attendance strategy\npo , the probability of occurrence of a party of less than n agents is S(N, n, po ) where\nS(N, n, po) =\n\nn−1\nX\ni=0\n\n!\n\nN −1 i\npo (1 − po )N −1−i .\ni\n\n(5)\n\nThis is a continuous and monotonous decreasing function of po and fulfills the following three\nconditions:\nS(N, n, 0) = 1 ∀n\nS(N, n, 1) = 0 ∀n\nS(N, n + m, po ) ≥ S(N, n, po ) ∀po , m > 0\n\n(6)\n(7)\n(8)\n\nIf an agent decides to go to the bar, her account in points will remain equilibrated when\nthe expected rewards equals the expected fine, i.e. when the attendance strategy pp that is\ncommon to all the agents fulfills:\nS(N, n, pp ) =\n\n1\n1+G\n\n(9)\n\nIf an agent decides instead not to go to the bar a similar condition can also be written for\nher account in credits. This is:\nS(N, n + 1, pc ) =\n\nG\n1+G\n\n(10)\n\nGiven G, N and n, the two equations (9) and (10) define the two roots pp and pc that are\nrespectively the probabilities with which all agents have to go if they hope to equilibrate,\nrespectively their accounts of points and credits.\nAssume now that G = 1. Bearing in mind Eq.( 8) the two roots fulfill pp < pc . If the\nagents choose to attend the bar with a probability po < pp , they gain points. On the other\nhand, if they choose to attend with probability po > pc they gain credits. However, due to\nthe fact that pp < pc if they gain points they lose credits and viceversa. In either case all\nagents will continue to update their strategies, quenching is not possible and equilibrium is\neventually reached.\nFor a δ-type distribution of strategies the only chance to have a quenched phase using\nthe BAM dynamics is to find a situation in which pc ≤ pp . For finite N this can only happen\nif G > 1 (see Fig. 6). From the above two equations it is easy to see that the root pc\nbecomes smaller for increasing values of G and the opposite happens for pp . A value GBAM\ncrit\ncan eventually be found in which both roots fulfill pp = pc ≡ pcrit . For any G > GBAM\nthe\ncrit\nregions for winning points and credits start to overlap and quenching occurs within a narrow\n9\n\n\foverlapping interval (pc , pp ). In Fig. 7 we show the two roots pp and pc as a function of G.\nIt further turns out that for finite values of N the value of GBAM\ncrit is nearly independent of μ.\nThe evolution of a δ-type distribution centered at a value of po depends upon the choice\nof G and μ. If G > GBAM\ncrit , and po is inside the quenching interval (pc , pp ) the distribution\nwill not change and the attendance M will remain fixed at the value chosen for the initial\nconditions. This is so because because all agents win both points and credits. If po lies\noutside of the quenching region, agents are forced to update their strategies either because\nthey lose point or because they lose credits. The average attendance M will approach\nthe value μ. Note that the average Rattendance and the average of individual strategies\nare completely equivalent i.e. M = pP (p)dp . Therefore when the average attendance\napproaches the quenching interval (pc , pp ) , the evolution will progressively come to a stop.\nFor values of G up to G ∼ 5Gcrit the quenching interval (pc , pp ) is always small (| pp − pc |∼\n.1) and the convergence to a quenched phase is in general very slow. As the mean of\nthe distribution approaches the quenching interval, a smaller fraction of agents have to\nupdate their strategies and therefore the fraction Cs (t) tends slowly to zero approaching very\nis almost\nnearly a power law, for a considerable number (∼ 106 ) of iterations. Since GBAM\ncrit\nindependent of μ this behaviour does not change with its particular value. In the cases\nin which po ∈\n/ (pc , pp ) the corresponding (asymmetric) distributions PqBAM (p) associated\nto quenched configurations look similar to those associated to equilibrium because involve\nagents with all possible attendance strategies.\nC. GMG\n\nA similar analysis as the one performed for the BAM can be made for the GMG. If the\nsystem is prepared with a distribution P0 (p) = δ(p − po ) the single account of points remains\nequilibrated provided that the probability of winning Pw (N, n, p) fulfills:\nPw (N, n, po ) = po S(N, n, po ) + (1 − po )(1 − S(N, n + 1, po )) =\n\n1\n1+G\n\n(11)\n\nIn Fig. 6 we show an example of the functions S(N, n, p), S(N, n + 1, p) and Pw (N, n, p)\nfor typical values of N and n, and n > N/2.\nThe situation for the GMG is completely different than for the BAM. The function\nPw (N, n, p) has one maximum in the interval 0 ≤ p ≤ 1, and to a high degree of accuracy\ndisplays the symmetry Pw (N, n, p) = Pw (N, N − n, 1 − p). Symmetry however is not strict.\nTo see this note that if n = N, going to the bar is always a winning option no matter the\noption of the rest of the agents. If n = 0, the action of not going is not enough to win,\nbecause that depends upon the choice made by all the other agents.\nG\nG\nA critical value GGM\nand a critical probability of attendance pGM\ncan be defined for\ncr\ncrit\nthe GMG as the p value that corresponds to the maximum of Pw (N, n, p) given by Eq.( 11)\nthrough\nG\nmax\nPw (pGM\n= maxp Pw (N, n, p)\ncrit ) = Pw\n1\nG\nGGM\n= max − 1\ncr\nPw\n\n10\n\n(12)\n(13)\n\n\fFor a given value of n and N quenching is produced if p = pcr and G ≥ Gcr . the values of\nGcr for the GMG are completely different from those of the BAM. While in the latter there\nexists a common value of Gcr independent of μ this is not the case for the GMG (see Fig. 4).\nAbove Gcr and initial condition P0 (p) = δ(p − p1 ), the quenching condition is fulfilled for\nany p1 in the interval p< < p < p> that are the two roots of Eq.( 11). Any system prepared\nwith p1 within that region will rapidly be quenched. Assume for the sake of concretness that\nwe choose μ > 0.5. The system evolves quite differently if po < p< or po > p> . In the first\ncase the whole population of agents is forced to update their strategies in order to change the\nindividual p's in order to surpass the value p< . Once this happens, updating progressively\ncomes to a stops as the average attendance gets into the interval (p< , p> ) and the system\ngets quenched with a value of M below the accepted fraction μ. The fact that Pw (N, n, p)\nis such that p> is very nearly similar to μ causes that for p1 > p> the initial condition of a\nGM G\nδ−type distribution changes into P∞\n(p) with a mean value that is very close to μ that can\nnot be distinguished from an equilibrium distribution. In addition, updating of strategies\ncontinues to take place continuously. Examples are shown in Fig. 8.\nD. Finite-size effects\n\nAn estimate of the finite size effects of the models on the values of Gcr and pcr can\neasily be made for the usual settings of the MG, by assuming a δ−type distribution as\nan initial condition. For μ = 1/2, and from Eqs.(11) and (13) it follows immediately\nG\nthat pcrit = 1/2 ∀N and the value of GGM\ncan directly be estimated from the value of\ncrit\nGM G\nPw\n(p = 1/2) using Eq. (11) and standard asymptotic expansions. It turns out:i\n√\n[2πN] + 2\nGM G\nGcr\n=√\n(14)\n[2πN] − 2\nIf this result remains valid for a uniform initial distribution, the usual settings for the\nMG (G = 1 and μ = 1/2) correspond to a critically quenched system.\nG\nBAM\nIn Fig 9a) are shown GGM\ncrit (μ = 1/2) and Gcrit (μ = 1/2) as a function of 1/N. It is\nG\nseen that GGM\n≃ GBAM\nas N → ∞.The corresponding values for μ 6= 1/2 can be related\ncrit\ncrit\nto those shown in Fig. 9a). In the first place one should notice that the value of GBAM\ncrit\nG\nis independent of μ. On the other hand, the curves of GGM\n(μ\n=\n6\n1/2)\ncan\nbe\nreduced\ncrit\nG\nGM G\nto the one shown through GGM\ncrit (μ) = (aμ + b)Gcrit (μ = 1/2) to a very good degree of\napproximation (a and b ∼ constants, up to terms O(1/N)).\nG\nIn what refers to the values of pcrit one can check (Fig. 9b)) that pBAM\nand pGM\ncrit\ncrit\n∞\napproach each other and tend to the common limiting value pcrit = μ, as expected from a\nnaı̈ve estimate of the probability of attendance. One can also conjecture that GBAM\ncrit (∞) = 1.\nV. ANNEALING\n\nThe situations described hitherto indicate that outside a very restricted region of μ and\nfor different initial conditions, the dynamics of the GMG rapidly approaches quenching. The\nmany agent system stops evolving, the attendance remains fixed at a value that is far from\nthe tolerated fraction μ and all the other internal parameters remain close to the initial\n11\n\n\fBAM\nconditions. Opposed to this, the BAM approaches always a distribution P∞\n(p) that\ncorresponds to what one expects of thermodynamics equilibrium: the attendance fluctuates\naround the expected fraction μ, agents continue to update their individual strategies and\nBAM\nP∞\n(p) remains stationary.\nThere is a way to regain equilibrium within the framework of the GMG through an\niterative procedure that can be regarded as an annealing protocol. The key point is to\nrealize that quenching is produced by the memory stored in the points gained by the agents.\nIn fact the quenched state remains unchanged because on the average agents continue to\ngain points. To correct the quenched phase, a procedure can be implemented that consists\nin obliterating periodically the memory of the system. This is donne removing all the points\ngained by all the agents in each iteration. In each annealing episode the system is allowed to\nevolve freely during a maximum of ns steps; at the end, several parameters are calculated:\nthe fraction φ5 of agents that have gained not less that 5 points, the relative attendance M,\nthe fraction of histories fh where the system does not reach a quenched configuration in the\nallowed ns steps, and the fraction fq = nq /ns , where nq is the actual number of evolution\nsteps that are needed to quench the system.\nThe results obtained are shown in Fig.10 for two values of G and μ = 850/1001. At the\nend of the first episode the distribution Pq (Fig.10a)) that is found is entirely similar to the\nhumped distribution shown in Fig2, and φ5 = 1, thus corresponding to a quenched phase.\nAs agents are repeatedly deprived of points some of them are increasingly forced to update\ntheir strategies. For G = 1 (Fig.10b)) and during the first 30 annealing episodes very few\nsteps are required in order to have φ5 = 1; after ∼ 35 annealing episodes a clear transition\ntakes place that can be interpreted as a gradual melting of the system: the fraction φ5 drops\nwhile fh and fq grow abruptly, almost reaching their maximum possible values. For G = 1.1\n(Fig.10c)) this transition is not present as can be seen from the fact that φ5 is constantly\nequal to one, while fh = 0. It is most remarkable, however, that the relative attendance M\nstill reaches the value μ, as for G = 1. In other words, the annealing protocol is seen to\nbe able to drive the system towards M ≃ μ with or without a change of the phase of the\nsystem.\n\nVI. CONCLUSIONS\n\nIn the present work we have discussed the self organization properties of two multi agent\nmodels, the BAM and the GMG. We have shown the relevance of two control parameters.\nOne is the fraction of the population of agents μ that has to be joined in order to make the\ncorrect decision. The other is G that represents the gain produced by a correct decision,\nmeasured in units of the fine payed for making the wrong one. For the sake of concreteness\nwe have borrowed the framework of the BAM in which the decision that has to be made is\nto go or not to a bar. The decision is the correct one if the fraction of the population that\nhas decided to go does not exceed μ.\nThe system under consideration lacks any interaction or internal correlation among the\nagents. Each agent feels the presence of the rest only through the value of an aggregate\nparameter that is the total attendance and rewards or penalties of individual actions are\ndecided with respect to its particular value in each moment. Otherwise, agents act independently from each other. With these rules, the many agent system adapts and always reaches\n12\n\n\fstable asymptotic configurations. These are, however, of quite different nature depending\nupon the values of the control parameters, of the initial conditions and on the information\nthat is used to guide the individual actions.\nThe usual framework of the minority game, if generalized to take into account arbitrary\nvalues of μ, gives rise either to states of equilibrium or to quenched configurations. The\nformer have a density distribution of individual strategies that only depends upon the value\nof G and μ and remains stationary while a fraction of the population Cs continuously\nupdates their strategies. Quenched states have instead frequency distributions that may be\nvery different depending upon the initial conditions, while Cs drops exponentially to zero in\nall cases.\nA phase diagram for the GMG can be established in the μ − G plane. Quenching\noccurs outside a region limited by a critical line μcr (G). This border line has been obtained\nnumerically for uniform initial conditions. If a δ− type distribution is assumed analytic\nexpressions can be obtained. In both cases finite size effects are found. A rigorous estimate\ncan be made for an infinite system in this later case. It is found that if N → ∞ the point\n(G = 1, μ = 1/2) belongs to the critical line. A numerical estimate of finite size effects for\na uniform initial distribution is also in agreement with this result. It is interesting to note\nthat these are the usual settings for the minority game widely used in the literature.\nThe shape of the distribution P (p) is the combined result of the actions of many 'independent' agents. In spite of such independence we have proven that the equilibrium\ndistribution optimizes the statistical occurrence of the most convenient coordinated state\nor, equivalently, minimizes the average aggregate cost of the ensemble of agents.\nA quenched state is reached when the individual updating of strategies stops. This should\nhowever not be considered to correspond to a \"frozen\" configuration. If this where the case,\nan internal ordered state would be found bearing no relationship with the initial conditions.\nContrary to this, the quenched state is far from being unique, the \"glassy\" structure of\nthe quenched phase lacks any preferred internal ordering. This should be regarded as the\nsignature of the absence of interactions among the agents and has to be attributed purely to\ndynamic effects. While equilibrium is associated to the optimization of the global magnitude,\nthis is no longer true for a quenched configuration.\nReaching a quenched phase is a direct consequence of the evolution dynamics contained\nin the rules for updating the individual strategies. This effect is evident when the GMG is\ncompared to the dynamics arising from the BAM with mixed strategies, as we have presented\nhere. Contrary to the GMG, when starting from a uniform distribution the BAM always\nreaches a state of equilibrium, independently of the values of μ and G. The two models\ndiffer in the use of the available information. While the GMG dynamics only keeps record\nof good and wrong decisions, the seemingly minor modifications implied in the BAM rules,\nallows to keep also track of the reasons for such successes and failures. The system thus\nkeeps a better \"memory\" of the previous steps in the dynamics. The consequence of this is\nthat the system always self organizes in such a way that M → μ.\nThe many agent system that has been presented here has several features that are reminiscent of the physics of many body systems. In the first place one should note that a\nquenched phase can be induced for critical values of μ and G. A sort of order parameter\ncan be established with the relative attendance M(t). Two regions can be individualized in\nparameter space, one in which M(t) → μ and the other in which M(t) → M∞ 6= μ. For\n13\n\n\fcritical values of μ and G, the system undergoes an internal transformation reflected by a\npeak in the dispersion σA that reminds the behavior of the susceptibility at a second order\nphase transition.\nAlthough the model does not contain any two body interaction, within this analogy \"particles\" accomodate themselves following an ocupational constraint (the maximum allowed\nattendance) very much in the same fashion as in many fermion system. To support this viewpoint, one could note that very few \"particles\" participate in the dynamics. The parameter\nμ fixes the total attendance and therefore plays the role of the chemical potential through\nan effective collective interaction. From this point of view individual gains should be related\nto (the negative of) a kind of single particle energy: those agents that have accumulated\nlarge gains are less likely to participate in the dynamics.\nA resemblance can also be established between quenching in GMG and similar situations\nfound in many body systems. In fact we have described a gradual modification of the\nquenched configuration through a procedure that is entirely similar to an annealing protocol.\nIt turns out that a quenched state can gradually be \"melted\" into a state of equilibrium if\nall the points that have been gained by the agents are periodically eliminated. The points\naccumulated by the agents keep memory of the previous results and each remotion can be\nthought as an exchange of 'energy' with a thermal bath in order to reach equilibrium.\nThe concept of temperature has been introduced in the MG in several contexts. In\nall cases it is assimilated to random fluctuations. In this work we have not attempted\nto introduce the temperature. It is worthwhile to mention, however, that in fact there is\nan individual source of fluctuations present, associated with the update of pi described in\nSection II. We recall that every time a new value of pi has to be chosen, it is randomly\nselected from an interval of width δp around it. Hence, this fluctuation acts as a source of\nfixed temperature, T0 say, and can be recognized as the final reason that explains why the\ndistribution function P (p) does not simply converges to the sum of several δ's. Hence, our\nwork can be considered to describe the relaxation to equilibrium at that fixed temperature\nT = 0, except when the annealing protocol is applied. This framework could be extended\nto a situation at T 6= 0 by introducing fluctuations allowing for instance individual agents\nto change probabilistically their assistance strategies.\nThe BAM has been worked out to show how internal coordination of markets or economic\nsystems can derive from uncoordinated individual actions that are inspired by a common\nbelief. It is a clear example in which an ensemble of agents with limited information about\nsomebody else's decisions can nevertheless give rise to a self organized pattern within a\nscheme referred to as \"bounded rationality\". The relaxation process reminds what in economics is known as \"tatonnement\". Opposed to this, the \"rational expectations\" solution\nto the BAM or the GMG would be a distribution P (p) = δ(p − μ) because it describes the\nonly common action that is consistent with the general knowledge of all agents about everybody else's decisions concerning the acceptable attendance. It is interesting to note that\nthis solution is in general far from equilibrium and hence is neither stationary nor optimal.\nThe Minority Game, regarded as a simplified version of the BAM has also been repeatedly presented as a schematic framework with similar interest for economics. However the\noccurrence of quenched asymptotic configurations in a straightforward generalization of the\nMG puts some limitations to the aplicability of the model to stylized economic situations.\nQuenched configurations are trivial examples of equilibria because the adaptation dynamic\n14\n\n\fhas stopped, but they are neither Nash equilibria nor Pareto optimal. In fact, if M 6= μ\nmany individual situations can be improved without harming the situation of any other\nagent. It is intersting to note that such configurations are produced by the limited use that\nagents make of the available information. GMG can therefore safely be used if quenching is\navoided or special situations are considered in which this is not particularly relevant. Otherwise, one should bear in mind that to simulate market environments it is mandatory to\nassume that the agents must make full use of all the available information.\nE.B. has been partially supported by CONICET of Argentina, PICT-PMT0051;H.C. and\nR.P. were partially supported by EC grant ARG/b7-3011/94/27, Contract 931005 AR.\n\n15\n\n\fREFERENCES\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n\n[11]\n[12]\n\nAmer. Econ. Assoc. Papers Proc. 84, 406 (1994)\nD. Challet, Y.C. Zhang, Physica A246, 407 (1997); Physica A256, 514 (1998)\nR. Savit, R. Manuca, R. Riolo, Phys. Rev. Lett. 82, 2203 (1999)\nA. Cavagna, Phys. Rev. E59, R3783 (1999)\nN.F. Johnson, P.M. Hui, R. Jonson, T.S. Lo, Phys. Rev. Lett. 82, 3360 (1999)\nE. Burgos, H. Ceva, R. Perazzo, cond-mat /0007010\nD. Heymann, R.P.J. Perazzo and A. Schuschny, preprint\nN.F. Johnson, D.J.T. Leonard, P.M. Hui, T.S. Lo, cond-mat /9905939 v2. See also:\nN.F. Johnson, P.M. Hui, Dafang Zeng, C.W. Tai, Physica A269, 493 (1999)\nE. Burgos, H.Ceva, Physica A284, 489 (2000)\nWithin the rules for the BAM, an agent that loses credits is in the position to use the\nfact that her losses are due to the repeated action of not attending the bar. She could\nthen use this to update her attendance strategy increasing that probability. This speeds\nup the convergence to the accepted value of μ in a dramatic way, but adds no conceptual\nchange to the structure of the asymptotic behavior of the system. We did not use it\nin order to stress that the different behaviors are only due to the different use of the\navailable information.\nA.Goldberg Genetic Algorithms in Search, Optimization, and Machine Learning, Addison - Wesley (1989).\nNote that C differs from σM introduced previously, because the former is the dispersion\nat time t with respect to the allowed attendance Nμ, while the later is the dispersion of\nthe asymptotic attendance with respect to its average.\n\n16\n\n\fFIGURES\nFIG. 1. GMG and BAM without quenching. In this case, N = 1001, G = 1 and μ = 600/1001.\nThe data is averaged over 200 histories. In (a) we show P∞ (p) for both cases; (b) illustrates the\ntime evolution of the reduced attendance M (t) and Cs (t), the fraction of moving agents. Notice\nthat Cs (t) does not vanish\nFIG. 2. BAM and GMG with quenching, for the same values of N and G than in the previous\nfigure, but μ = 800/1001. In (a) we show that the shape of P (p) has little changes for the BAM,\nwhile the GMG distribution is strongly modified. Correspondingly, in (b) one can see that GMG\ndoes not reach the allowed assistance (M 6= μ) because the system stops evolving (Cs = 0) very\nrapidly. Data for GMG is averaged over 3000 histories. In the broken x-axis we show that BAM\ndoes not quench even after 106 time steps\nFIG. 3. (a) Reduced attendance as a function of μ, for N = 101. It can be seen that μcr is a\nfunction of G. Size effects are shown in the inset. (b) transition from a non-quenched (φ20 6= 1) to\na quenched state (φ20 = 1)\nFIG. 4. Phase diagram for the GMG in the μ − G plane. (△) shows an analytic solution for\na δ-type initial condition, while (✷ and (✸) correspond to numerical solutions starting from a\nuniform distribution. The critical border for the BAM with δ-type initial conditions would be a\nvertical line at G ≃ 1, 22 for N = 100\nFIG. 5. Change of P (p) with G, for μ = 0.6\nFIG. 6. The roots pp and pc of Eqs.(9) and (10) are exemplified for N = 20 and n = 14. These\nvalues are chosen for the sake of clarity of the figures. Notice that as G increases pc becomes\nsmaller and pp becomes larger\nFIG. 7. Quenching for the BAM for δ-type initial conditions is possible for G > Gcr . The roots\npp and pc are ploted as a function of G and the indicated values of μ. Both roots are equal for\nG = Gcr . The value of Gcr is largely independent of μ.\nFIG. 8. Distributions P (p) for the GMG (right axis), obtained from three initial conditions\nδ(p − p0 ). We also show Pw , (left axis) to help to understand the evolution of the systems. The\nroots p< and p> correspond to the two roots Pw = 1/2. In this case, μ = 75/101\nFIG. 9. (a) Gcrit vs 1/N up to N = 1000. Eq.14 provides an excellent fit that can not be\ndistinguished from numerical data for GMG, G = 1, μ = 0.5 ; (b) pcr as a function of 1/N for the\nsame values of μ.\n\n17\n\n\fFIG. 10. Annealing in the GMG\n\n18\n\n\f20\n\n15\n\nP(p)\n\n(a)\n\nGMG\nBAM\n\n10\n\n5\n\n0\n0,0\n\n0,2\n\n0,4\n\n0,6\n\n0,8\n\n1,0\n\np\n0,6\n\nM\n\n0,5\n\n(b)\n0,4\nBAM\nGMG\nGMG\n\n0,3\n0,2\n\nCs\n\n0,1\n0,0\n0\n\n200\n\n400\n\n600\n\nsteps\n\n800\n\n1000\n\n200000\n\n\f40\n35\n30\n\nGMG\nBAM\n\nP(p)\n\n25\n4\n\n(a)\n\n2\n\n0\n0,0\n\n0,2\n\n0,4\n\n0,6\n\n0,8\n\n1,0\n\np\n0,8\n\nM\n\n0,7\n0,6\n\nBAM\nGMG\nGMG\n\n0,5\n0,4\n0,3\n\n(b)\n\n0,2\n\nCs\n\n0,1\n0,0\n0\n\n2000\n\n4000\n\n6000\n\n8000\n\nsteps\n\n10000\n\n1000000\n\n\f0,9\n0,7\n\n0,8\n\nG=0.5\n0,6\n\nN=1001\nG=1.00\n\nM\n\n0,5\n\n0,7\n\nG=1.00\n0,5\n\n0,6\n\n0,7\n\n0,8\n\n0,9\n\n1,0\n\nG=1.25\n\n0,6\n\n0,5\n\n(a)\n0,5\n\n0,6\n\n0,7\n\nμ\n\n0,8\n\n0,9\n\n1,0\n\n0,030\n1,0\n0,025\n\nφ 20\n\nG=1\n\n0,8\n\nσM\n\n0,6\n\nσ\n\n0,015\n\n0,4\n0,010\n\n(b)\n0,5\n\n0,6\n\n0,7\n\nμ\n\n0,8\n\n0,9\n\n0,2\n1,0\n\nφ20\n\n0,020\n\n\fN = 101\nN = 1001\nN = 101\n\n1,0\n0,9\n\nQUENCHING\n\nμ\n\n0,8\n0,7\n0,6\n0,5\n0,0\n\nNO QUENCHING\n\n0,2\n\n0,4\n\n0,6\n\n0,8\n\nG\n\n1,0\n\n1,2\n\n1,4\n\n\f40\n\nG=0.6\nG=1.00\nG=1.02\nG=1.15\n\nP(p)\n\n30\n20\n4\n3\n2\n1\n0\n0,0\n\n0,2\n\n0,4\n\np\n\n0,6\n\n0,8\n\n1,0\n\n\f1,0\n\n0,8\n\nS(N,n,p)\nS(N,n+1,p)\nG/(1+G)\n\n0,4\n\n1/(1+G)\n\nS\n\n0,6\n\n0,2\n\npp\n\n0,0\n0,0\n\n0,2\n\n0,4\n\np\n\n0,6\n\npc\n0,8\n\n1,0\n\n\f0,9\n\nμ=0.8\n0,8\n\npoints\ncredits\n\np\n\n0,7\n\nμ=0.2\n0,2\n\nGcr\n0,1\n0,0\n\n0,5\n\n1,0\n\nG\n\n1,5\n\n2,0\n\n\f1,0\n50\n\n0,9\n\np0=0.4\np0=0.7\np0=0.9\n\n0,8\n0,7\n\n40\n\nPw\n\n0,6\n30\n0,5\n0,4\n\n20\n\n0,3\n0,2\n\n10\n\n0,1\n0\n\n0,0\n\n0,0\n\n0,1\n\n0,2\n\n0,3\n\n0,4\n\n0,5\n\np\n\n0,6\n\n0,7\n\n0,8\n\n0,9\n\n1,0\n\n\f1,2\n1,1\n1,0\n\nμ =0.5, BAM\nμ =0.5, GMG\n\nGcr\n\n0,9\n\nμ =0.7, BAM\nμ =0.7, GMG\n\n0,8\n0,7\n0,6\n\n(a)\n0,5\n0,000\n\n0,002\n\n0,004\n\n0,006\n\n0,008\n\n0,010\n\n1/N\n0,72\n\n0,68\n\npcr\n\n0,64\n\n0,60\n0,52\n\n(b)\n0,48\n0,000\n\n0,002\n\n0,004\n\n0,006\n\n1/N\n\n0,008\n\n0,010\n\n\f16\n14\n\ninitial:\nfinal:\ninitial :\nfinal :\n\n12\n\nP(p)\n\n10\n\nG=1.00\nG=1.00\nG=1.10\nG=1.10\n\n(a)\n\n8\n6\n4\n2\n0\n0,0\n\n1,0\n0,8\n0,6\n\n0,2\n\n0,0\n\np\n\n0,6\n\n0,8\n\n1,0\n\nφ5\n\n(b)\n\nM\nG=1\n\n0,4\n0,2\n\n0,4\n\nfq\nfh\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\nannealing step\n1,0\n0,8\n0,6\n\nφ5\n\nM\n\n0,4\n0,2\n0,0\n\n(c)\nG=1.1\n\nfq\nfh\n0\n\n10 20 30 40 50 60 70 80 90 100 110\n\nannealing step\n\n\f"}