{"id": "http://arxiv.org/abs/cs/0609049v2", "guidislink": true, "updated": "2007-05-08T07:34:29Z", "updated_parsed": [2007, 5, 8, 7, 34, 29, 1, 128, 0], "published": "2006-09-11T09:35:57Z", "published_parsed": [2006, 9, 11, 9, 35, 57, 0, 254, 0], "title": "Scanning and Sequential Decision Making for Multi-Dimensional Data -\n  Part I: the Noiseless Case", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cs%2F0609130%2Ccs%2F0609021%2Ccs%2F0609056%2Ccs%2F0609166%2Ccs%2F0609088%2Ccs%2F0609103%2Ccs%2F0609162%2Ccs%2F0609126%2Ccs%2F0609070%2Ccs%2F0609167%2Ccs%2F0609031%2Ccs%2F0609054%2Ccs%2F0609105%2Ccs%2F0609165%2Ccs%2F0609002%2Ccs%2F0609049%2Ccs%2F0609164%2Ccs%2F0609067%2Ccs%2F0609080%2Ccs%2F0609076%2Ccs%2F0609158%2Ccs%2F0609039%2Ccs%2F0609009%2Ccs%2F0609136%2Ccs%2F0609008%2Ccs%2F0609069%2Ccs%2F0609041%2Ccs%2F0609149%2Ccs%2F0609122%2Ccs%2F0609097%2Ccs%2F0609139%2Ccs%2F0609007%2Ccs%2F0609037%2Ccs%2F0609124%2Ccs%2F0609053%2Ccs%2F0609116%2Ccs%2F0609141%2Ccs%2F0609029%2Ccs%2F0609001%2Ccs%2F0609140%2Ccs%2F0609028%2Ccs%2F0609163%2Ccs%2F0609159%2Ccs%2F0609134%2Ccs%2F0609035%2Ccs%2F0609017%2Ccs%2F0609022%2Ccs%2F0609061%2Ccs%2F0609016%2Ccs%2F0609077%2Ccs%2F0609047%2Ccs%2F0609094%2Ccs%2F0609074%2Ccs%2F0609108%2Ccs%2F0609086%2Ccs%2F0609102%2Ccs%2F0609084%2Ccs%2F0609052%2Ccs%2F0609095%2Ccs%2F0609125%2Ccs%2F0609065%2Ccs%2F0609082%2Ccs%2F0609051%2Ccs%2F0609112%2Ccs%2F0609046%2Ccs%2F0609010%2Ccs%2F0609093%2Ccs%2F0609045%2Ccs%2F0609120%2Ccs%2F0609104%2Ccs%2F0609115%2Ccs%2F0609150%2Ccs%2F0609129%2Ccs%2F0609018%2Ccs%2F0609092%2Ccs%2F0609033%2Ccs%2F0609146%2Ccs%2F0609087%2Ccs%2F0609106%2Ccs%2F0609160%2Ccs%2F0609138%2Ccs%2F0307008%2Ccs%2F0307041%2Ccs%2F0307035%2Ccs%2F0307048%2Ccs%2F0307003%2Ccs%2F0307034%2Ccs%2F0307021%2Ccs%2F0307010%2Ccs%2F0307073%2Ccs%2F0307072%2Ccs%2F0307062%2Ccs%2F0307004%2Ccs%2F0307054%2Ccs%2F0307018%2Ccs%2F0307006%2Ccs%2F0307064%2Ccs%2F0307066%2Ccs%2F0307031%2Ccs%2F0307001%2Ccs%2F0307027&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Scanning and Sequential Decision Making for Multi-Dimensional Data -\n  Part I: the Noiseless Case"}, "summary": "We investigate the problem of scanning and prediction (\"scandiction\", for\nshort) of multidimensional data arrays. This problem arises in several aspects\nof image and video processing, such as predictive coding, for example, where an\nimage is compressed by coding the error sequence resulting from scandicting it.\nThus, it is natural to ask what is the optimal method to scan and predict a\ngiven image, what is the resulting minimum prediction loss, and whether there\nexist specific scandiction schemes which are universal in some sense.\n  Specifically, we investigate the following problems: First, modeling the data\narray as a random field, we wish to examine whether there exists a scandiction\nscheme which is independent of the field's distribution, yet asymptotically\nachieves the same performance as if this distribution was known. This question\nis answered in the affirmative for the set of all spatially stationary random\nfields and under mild conditions on the loss function. We then discuss the\nscenario where a non-optimal scanning order is used, yet accompanied by an\noptimal predictor, and derive bounds on the excess loss compared to optimal\nscanning and prediction.\n  This paper is the first part of a two-part paper on sequential decision\nmaking for multi-dimensional data. It deals with clean, noiseless data arrays.\nThe second part deals with noisy data arrays, namely, with the case where the\ndecision maker observes only a noisy version of the data, yet it is judged with\nrespect to the original, clean data.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cs%2F0609130%2Ccs%2F0609021%2Ccs%2F0609056%2Ccs%2F0609166%2Ccs%2F0609088%2Ccs%2F0609103%2Ccs%2F0609162%2Ccs%2F0609126%2Ccs%2F0609070%2Ccs%2F0609167%2Ccs%2F0609031%2Ccs%2F0609054%2Ccs%2F0609105%2Ccs%2F0609165%2Ccs%2F0609002%2Ccs%2F0609049%2Ccs%2F0609164%2Ccs%2F0609067%2Ccs%2F0609080%2Ccs%2F0609076%2Ccs%2F0609158%2Ccs%2F0609039%2Ccs%2F0609009%2Ccs%2F0609136%2Ccs%2F0609008%2Ccs%2F0609069%2Ccs%2F0609041%2Ccs%2F0609149%2Ccs%2F0609122%2Ccs%2F0609097%2Ccs%2F0609139%2Ccs%2F0609007%2Ccs%2F0609037%2Ccs%2F0609124%2Ccs%2F0609053%2Ccs%2F0609116%2Ccs%2F0609141%2Ccs%2F0609029%2Ccs%2F0609001%2Ccs%2F0609140%2Ccs%2F0609028%2Ccs%2F0609163%2Ccs%2F0609159%2Ccs%2F0609134%2Ccs%2F0609035%2Ccs%2F0609017%2Ccs%2F0609022%2Ccs%2F0609061%2Ccs%2F0609016%2Ccs%2F0609077%2Ccs%2F0609047%2Ccs%2F0609094%2Ccs%2F0609074%2Ccs%2F0609108%2Ccs%2F0609086%2Ccs%2F0609102%2Ccs%2F0609084%2Ccs%2F0609052%2Ccs%2F0609095%2Ccs%2F0609125%2Ccs%2F0609065%2Ccs%2F0609082%2Ccs%2F0609051%2Ccs%2F0609112%2Ccs%2F0609046%2Ccs%2F0609010%2Ccs%2F0609093%2Ccs%2F0609045%2Ccs%2F0609120%2Ccs%2F0609104%2Ccs%2F0609115%2Ccs%2F0609150%2Ccs%2F0609129%2Ccs%2F0609018%2Ccs%2F0609092%2Ccs%2F0609033%2Ccs%2F0609146%2Ccs%2F0609087%2Ccs%2F0609106%2Ccs%2F0609160%2Ccs%2F0609138%2Ccs%2F0307008%2Ccs%2F0307041%2Ccs%2F0307035%2Ccs%2F0307048%2Ccs%2F0307003%2Ccs%2F0307034%2Ccs%2F0307021%2Ccs%2F0307010%2Ccs%2F0307073%2Ccs%2F0307072%2Ccs%2F0307062%2Ccs%2F0307004%2Ccs%2F0307054%2Ccs%2F0307018%2Ccs%2F0307006%2Ccs%2F0307064%2Ccs%2F0307066%2Ccs%2F0307031%2Ccs%2F0307001%2Ccs%2F0307027&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the problem of scanning and prediction (\"scandiction\", for\nshort) of multidimensional data arrays. This problem arises in several aspects\nof image and video processing, such as predictive coding, for example, where an\nimage is compressed by coding the error sequence resulting from scandicting it.\nThus, it is natural to ask what is the optimal method to scan and predict a\ngiven image, what is the resulting minimum prediction loss, and whether there\nexist specific scandiction schemes which are universal in some sense.\n  Specifically, we investigate the following problems: First, modeling the data\narray as a random field, we wish to examine whether there exists a scandiction\nscheme which is independent of the field's distribution, yet asymptotically\nachieves the same performance as if this distribution was known. This question\nis answered in the affirmative for the set of all spatially stationary random\nfields and under mild conditions on the loss function. We then discuss the\nscenario where a non-optimal scanning order is used, yet accompanied by an\noptimal predictor, and derive bounds on the excess loss compared to optimal\nscanning and prediction.\n  This paper is the first part of a two-part paper on sequential decision\nmaking for multi-dimensional data. It deals with clean, noiseless data arrays.\nThe second part deals with noisy data arrays, namely, with the case where the\ndecision maker observes only a noisy version of the data, yet it is judged with\nrespect to the original, clean data."}, "authors": ["Asaf Cohen", "Neri Merhav", "Tsachy Weissman"], "author_detail": {"name": "Tsachy Weissman"}, "author": "Tsachy Weissman", "arxiv_comment": "46 pages, 2 figures. Revised version: title changed, section 1\n  revised, section 3.1 added, a few minor/technical corrections made", "links": [{"href": "http://arxiv.org/abs/cs/0609049v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cs/0609049v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.LG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.IT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "H.1.1; I.2.6", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cs/0609049v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cs/0609049v2", "journal_reference": null, "doi": null, "fulltext": "Scanning and Sequential Decision Making for\n\narXiv:cs/0609049v2 [cs.IT] 8 May 2007\n\nMulti-Dimensional Data - Part I: the Noiseless Case∗\nAsaf Cohen†, Neri Merhav† and Tsachy Weissman‡\nDecember 27, 2017\n\nAbstract\nWe investigate the problem of scanning and prediction (\"scandiction\", for short) of multidimensional data arrays. This problem arises in several aspects of image and video processing,\nsuch as predictive coding, for example, where an image is compressed by coding the error\nsequence resulting from scandicting it. Thus, it is natural to ask what is the optimal method\nto scan and predict a given image, what is the resulting minimum prediction loss, and whether\nthere exist specific scandiction schemes which are universal in some sense.\nSpecifically, we investigate the following problems: First, modeling the data array as a\nrandom field, we wish to examine whether there exists a scandiction scheme which is independent of the field's distribution, yet asymptotically achieves the same performance as if this\ndistribution was known. This question is answered in the affirmative for the set of all spatially\nstationary random fields and under mild conditions on the loss function. We then discuss the\nscenario where a non-optimal scanning order is used, yet accompanied by an optimal predictor,\nand derive bounds on the excess loss compared to optimal scanning and prediction.\nThis paper is the first part of a two-part paper on sequential decision making for multidimensional data. It deals with clean, noiseless data arrays. The second part deals with noisy\n∗\n\nThe material in this paper was presented in part at the IEEE International Symposium on Information Theory,\n\nSeattle, Washington, United States, July 2006, and the Electricity 2006 convention, Eilat, Israel, November 2006.\n†\nAsaf Cohen and Neri Merhav are with the Department of the Electrical Engineering, Technion - I.I.T., Haifa\n32000, Israel. E-mails: {soofsoof@tx,merhav@ee}.technion.ac.il.\n‡\nTsachy Weissman is with the Department of Electrical Engineering, Stanford University, Stanford, CA 94305,\nUSA. E-mail: tsachy@stanford.edu.\n\n1\n\n\fdata arrays, namely, with the case where the decision maker observes only a noisy version of\nthe data, yet it is judged with respect to the original, clean data.\nIndex Terms-Universal scanning, Scandiction, Sequential decision making, Multi-dimensional\ndata, Random Field, Individual image.\n\n1\n\nIntroduction\n\nConsider the problem of sequentially scanning and predicting a multidimensional data array,\nwhile minimizing a given loss function. Particularly, at each time instant t, 1 ≤ t ≤ |B|, where\n|B| is the number of sites (\"pixels\") in the data array, the scandictor chooses a site to be\nvisited, denoted by Ψt , and gives a prediction, Ft , for the value at that site. Both Ψt and Ft\nmay depend of the previously observed values - the values at sites Ψ1 to Ψt−1 . It then observes\nthe true value, xΨt , suffers a loss l(xΨt , Ft ), and so on. The goal is to minimize the cumulative\nloss after scandicting the entire data array.\nThe problem of sequentially predicting the next outcome of a one-dimensional sequence (or\nany data array with a fixed, predefined, order), xt , based on the previously observed outcomes,\nx1 , x2 , . . . , xt−1 , is well studied. The problem of prediction in multidimensional data arrays (or\nwhen reordering of the data is allowed), however, has received far less attention. Apart from\nthe on-line strategies for the sequential prediction of the data, the fundamental problem of\nscanning it should be considered. We refer to the former problem as the prediction problem,\nwhere no reordering of the data is allowed, and to the latter as the scandiction problem.\nThe scandiction problem mainly arises in image compression, where various methods of\npredictive coding are used (e.g., [1]). In this case, the encoder may be given the freedom\nto choose the actual path over which it traverses the image, and thus it is natural to ask\nwhich path is optimal in the sense of minimal cumulative prediction loss (which may result in\nmaximal compression). The scanning problem also arises in other areas of image processing,\nsuch as one-dimensional wavelet [2] or median [3] processing of images, where one seeks a\nspace-filling curve which facilitates the one-dimensional signal processing of multidimensional\ndata, digital halftoning [4], where a space filling curve is sought in order to minimize the\neffect of false contours, and pattern recognition [5], where it is shown that under certain\nconditions, the Bayes risk as well as the optimal decision rule are unchanged if instead of\nthe original multidimensional classification problem one transforms the data using a measurepreserving space-filling curve and solves a simpler one-dimensional problem. More applications\n\n2\n\n\fcan be found in multidimensional data query [6], [7] and indexing [8], where multidimensional\ndata is stored on a one-dimensional storage device, hence a locality-preserving space-filling\ncurve is sought in order to minimize the number of continuous read operations required to\naccess a multidimensional object, and rendering of three-dimensional graphics [9], [10], where\na rendering sequence which minimizes the number of cache misses is required.\nThe above applications have already been considered in the literature, and the benefits\nof not-trivial scanning orders have been proved (see [11], or [12] and [13] which we discuss\nlater). Yet, the scandiction problem may have applications that go beyond image scanning\nalone. For example, consider a robot processing various types of products in a warehouse.\nThe robot identifies a product using a bar-code or an RFID, and processes it accordingly.\nIf the robot could predict the next product to be processed, and prepare for that operation\nwhile commuting to the product (e.g., prepare an appropriate writing-head and a message to\nbe written), then the total processing time could be smaller compared to preparing for the\noperation only after identifying the product. Since different sites in the warehouse my be\ncorrelated in terms of the various products stored in them, it is natural to ask what is the\noptimal path to scan the entire warehouse in order to achieve minimum prediction error and\nthus minimal processing time.\nIn [14], a specific scanning method was suggested by Lempel and Ziv for the lossless compression of multidimensional data. It was shown that the application of the incremental parsing\nalgorithm of [15] on the one dimensional sequence resulting from the Peano-Hilbert scan yields\na universal compression algorithm with respect to all finite-state scanning and encoding machines. These results where later extended in [16] to the probabilistic setting, where it was\nshown that this algorithm is also universal for any stationary Markov random field [17]. Using\nthe universal quantization algorithm of [18], the existence of a universal rate-distortion encoder\nwas also established. Additional results regarding lossy compression of random fields (via pattern matching) were given in [19] and [20]. For example, in [20], Kontoyiannis considered a\nlossy encoder which encodes the random field by searching for a D-closest match in a given\ndatabase, and then describing the position in the database.\nWhile the algorithm suggested in [14] is asymptotically optimal, it may not be the optimal\ncompression algorithm for real life images of sizes such as 256 × 256 or 512 × 512. In [12],\nMemon et. al. considered image compression with a codebook of block scans. Therein, the\nauthors sought a scan which minimizes the zero order entropy of the difference image, namely,\nthat of the sequence of differences between each pixel and its preceding pixel along the scan.\n\n3\n\n\fSince this problem is computationally expensive, the authors aimed for a suboptimal scan\nwhich minimizes the sum of absolute differences. This scan can be seen as a minimum spanning\ntree of a graph whose vertices are the pixels in the image and whose edges weights represent\nthe differences (in gray levels) between each pixel and its adjacent neighbors. Although the\noptimal spanning tree can be computed in linear time, encoding it may yield a total bit rate\nwhich is higher than that achieved with an ordinary raster scan. Thus, the authors suggested\nto use a codebook of scans, and encode each block in the image using the best scan in the\ncodebook, in the sense of minimizing the total loss.\nLossless compression of images was also discussed by Dafner et. al. in [13]. In this work, a\ncontext-based scan which minimizes the number of edge crossing in the image was presented.\nSimilarly to [12], a graph was defined and the optimal scan was represented through a minimal\nspanning tree. Due to the bit rate required to encode the scan itself the results fall short\nbehind [14] for two-dimensional data, yet they are favorable when compared to applying the\nalgorithm in [14] to each frame in a three-dimensional data (assuming the context-based scans\nfor each frame in the algorithm of [13] are similar).\nNote that although the criterion chosen by Memon et. al. in [12], or by Dafner et. al. in [13],\nwhich is to minimize the sum of cumulative (first order) prediction errors or edge crossings,\nis similar to the criterion defined in this work, there are two important differences. First, the\nweights of the edges of the graph should be computed before the computation of the optimal\n(or suboptimal) scan begins, namely, the algorithm is not sequential in the sense of scanning\nand prediction in one pass. Second, the weights of the edges can only represent prediction\nerrors of first order predictors (i.e., context of length one), since the prediction error for longer\ncontext depends on the scan itself - which has not been computed yet. In the context of lossless\nimage coding it is also important to mention the work of Memon et. al. in [21], where common\nscanning techniques (such as raster scan, Peano-Hilbert and random scan) were compared in\nterms of minimal cumulative conditional entropy given a finite context (note that for unlimited\ncontext the cumulative conditional entropy does not depend on the scanning order, as will be\nelaborated on later). The image model was assumed to be an isotropic Gaussian random\nfiled. Surprisingly, the results of [21] show that context-based compression techniques based\non limited context may not gain by using Hilbert scan over raster scan. Note that under a\ndifferent criterion, cumulative squared prediction error, the raster scan is indeed optimal for\nGaussian fields, as it was shown later in [22], which we discuss next.\nThe results of [14] and [16] considered a specific, data independent scan of the data set.\n\n4\n\n\fFurthermore, even in the works of Memon et. al. [12] or Dafner et. al. [13], where data dependent\nscanning was considered, only limited prediction methods (mainly, first order predictors) were\ndiscussed, and the criterion used was minimal total bit rate of the encoded image. However,\nfor a general predictor, loss function and random field (or individual image), it is not clear\nwhat is the optimal scan. This more general scenario was discussed in [22], where Merhav\nand Weissman formally defined the notion of a scandictor, a scheme for both scanning and\nprediction, as well as that of scandictability, the best expected performance on a data array.\nThe main result in [22] is the fact that if a stochastic field can be represented autoregressively\n(under a specific scan Ψ) with a maximum-entropy innovation process, then it is optimally\nscandicted in the way it was created (i.e., by the specific scan Ψ and its corresponding optimal\npredictor).\nWhile defining the yardstick for analyzing the scandiction problem, the work in [22] leaves\nmany open challenges. As the topic of prediction is rich and includes elegant solutions to\nvarious problems, seeking analogous results in the scandiction scenario offers plentiful research\nobjectives.\nIn Section 3, we consider the case where one strives to compete with a finite set F of\nscandictors. Specifically, assume that there exists a probability measure Q which governs the\ndata array. Of course, given the probability measure Q and the scandictor set, one can compute\nthe optimal scandictor in the set (in some sense which will be defined later). However, we are\ninterested in a universal scandictor, which scans the data independently of Q, and yet achieves\nessentially the same performance as the best scandictor in F (see [23] for a complete survey of\nuniversal prediction). The reasoning behind the actual choice of the scandictor set F is similar\nto that common in the filtering and prediction literature (e.g., [24] and [25]). On the one hand,\nit should be large enough to cover a wide variety of random fields, in the sense that for each\nrandom field in the set, at least one scandictor is sufficiently close to the optimal scandictor\ncorresponding to that random field. On the other hand, it should be small enough to compete\nwith, at an acceptable cost of redundancy.\nAt first sight, in order to compete successfully with a finite set of scandictors, i.e., construct\na universal scandictor, one may try to use known algorithms for learning with expert advice,\ne.g., the exponential weighting algorithm suggested in [26] or the work which followed it. In this\nalgorithm, each expert is assigned a weight according to its past performance. By decreasing\nthe weight of poorly performing experts, hence preferring the ones proved to perform well\nthus far, one is able to compete with the best expert, having neither any a priori knowledge\n\n5\n\n\fon the input sequence nor which expert will perform the best. However, in the scandiction\nproblem, as each of the experts may use a different scanning strategy, at a given point in time\neach scanner might be at a different site, with different sites as its past. Thus, it is not at all\nguaranteed that one can alternate from one expert to the other. The problem is even more\ninvolved when the data is an individual image, as no statistical properties of the data can be\nused to facilitate the design or analysis of an algorithm. In fact, the first result in Section\n3 is a negative one, stating that indeed in the individual image scenario (or under expected\nminimum loss in the stochastic scenario), it is not possible to successfully compete with any two\nscandictors on any individual image. This negative result shows that the scandiction problem\nis fundamentally different and more challenging than the previously studied problems, such as\nprediction and compression, where competition with an arbitrary finite set of schemes in the\nindividual sequence setting is well known to be an attainable goal. However, in Theorem 4 of\nSection 3, we show that for the class of spatially stationary random fields, and subject to mild\nconditions on the prediction loss function, one can compete with any finite set of scandictors\n(under minimum expected loss). Furthermore, in Theorem 8, our main result in this section,\nwe introduce a universal scandictor for any spatially stationary random field. Section 3 also\nincludes almost surely analogues of the above theorems for mixing random fields and basic\nresults on cases where universal scandiction of individual images is possible.\nIn Section 4, we derive upper bounds on the excess loss incurred when non-optimal scanners\nare used, with optimal prediction schemes. Namely, we consider the scenario where one cannot\nuse a universal scandictor (or the optimal scan for a given random field), and instead uses an\narbitrary scanning order, accompanied by the optimal predictor for that scan. In a sense, the\nresults of Section 4 can be used to assess the sensitivity of the scandiction performance to the\nscanning order. Furthermore, in Section 4 we also discuss the scenario where the Peano-Hilbert\nscanning order is used, accompanied by an optimal predictor, and derive a bound on the excess\nloss compared to optimal finite state scandiction, which is valid for any individual image and\nany bounded loss function. Section 5 includes a few concluding remarks and open problems.\nIn [27], the second part of this two-part paper, we consider sequential decision making\nfor noisy data arrays. Namely, the decision maker observes a noisy version of the data, yet,\nit is judged with respect to the clean data. As the clean data is not available, two distinct\ncases are interesting to consider. The first, scanning and filtering, is when YΨt is available\nin the estimation of XΨt , i.e., Ft depends on YΨ1 to YΨt , where {Y } is the noisy data. The\nsecond, noisy scandiction, is when the noisy observation at the current site is not available\n\n6\n\n\fto the decision maker. In both cases, the decision maker cannot evaluate its performance\nprecisely, as l(xΨt , Ft ) cannot be computed. Yet, many of the results for noisy scandiction\nare extendable from the noiseless case, similarly as results for noisy prediction were extended\nfrom results for noiseless prediction [28]. The scanning and filtering problem, however, poses\nnew challenges and requires the use of new tools and techniques. Thus, in [27], we formally\ndefine the best achievable performance in these cases, derive bounds on the excess loss when\nnon-optimal scanners are used and present universal algorithms. A special emphasis is given\non the cases of binary random fields corrupted by a binary memoryless channel and real-valued\nfields corrupted by Gaussian noise.\n\n2\n\nProblem Formulation\n\nThe following notation will be used throughout this paper.1 Let A denote the alphabet, which\nd\n\nis either discrete or the real line. Let Ω = AZ denote the space of all possible data arrays in\nZd . Although the results in this paper are applicable to any d ≥ 1, for simplicity, we assume\nfrom now on that d = 2. The extension to d ≥ 2 is straightforward. A probability measure Q\n\non Ω is stationary if it is invariant under translations τi , where for each x ∈ Ω and i, j ∈ Z2 ,\n\nτi (x)j = xj+i (namely, stationarity means shift invariance). Denote by M(Ω) and MS (Ω)\nthe spaces of all probability measures and stationary probability measures on Ω, respectively.\nElements of M(Ω), random fields, will be denoted by upper case letters while elements of Ω,\nindividual data arrays, will be denoted by the corresponding lower case.\nLet V denote the set of all finite subsets of Z2 . For V ∈ V, denote by XV the restrictions\n\nof the data array X to V . For i ∈ Z2 , Xi is the random variable corresponding to X at site\n\ni. Let R\u0003 be the set of all rectangles of the form V = Z2 ∩ ([m1 , m2 ] × [n1 , n2 ]). As a special\ncase, denote by Vn the square {0, . . . , n − 1} × {0, . . . , n − 1}. For V ⊂ Z2 , let the interior\n\ndiameter of V be\n△\n\nR(V ) = sup{r : ∃c s.t. B(c, r) ⊆ V },\n\n(1)\n\nwhere B(c, r) is a closed ball (under the l1 -norm) of radius r centered at c. Throughout, log(*)\nwill denote the natural logarithm, and entropies will be measured in nats.\nDefinition 1 ([22]). A scandictor for a finite set of sites B ∈ V is the following pair (Ψ, F ):\n|B|\n\n• {Ψt }t=1 is a sequence of measurable mappings, Ψt : At−1 7→ B determining the site to\n1\n\nFor easy reference, we try to follow the notation of [22] whenever possible.\n\n7\n\n\fFigure 1: A graphical representation of the scandiction process. A scandictor (Ψ, F ) first chooses\nan initial site Ψ1 . It then gives its prediction for the value at that site, F1 . After observing the\ntrue value at Ψ1 , it suffers a loss l(xΨ1 , F1 ), chooses the next site to be visited, Ψ2 (xΨ1 ), gives its\nprediction for the value at that site, F2 (xΨ1 ), and so on.\nbe visited at time t, with the property that\nn\n\n\u0011o\n\u0010\n= B,\nΨ1 , Ψ2 (xΨ1 ), Ψ3 (xΨ1 , xΨ2 ) . . . , Ψ|B| xΨ1 , . . . , xΨ|B|−1\n\n∀x ∈ AB .\n\n(2)\n\n|B|\n\n• {Ft }t=1 is a sequence of measurable predictors, where for each t, Ft : At−1 7→ D determines the prediction for the site visited at time t based on the observations at previously\nvisited sites, and D is the prediction alphabet.\n|B|\n\n|B|\n\nWe allow randomized scandictors, namely, scandictors such that {Ψt }t=1 or {Ft }t=1 can be\nchosen randomly from some set of possible functions. At this point, it is important to note\nthat scandictors for infinite data arrays are not considered in this paper. Definition 1, and the\nresults to follow, consider only scandictors for finite sets of sites, ones which can be viewed\nmerely as a reordering of the sites in a finite set B. We will consider, though, the limit as the\nsize of the array tends to infinity. A scandictor, such that there exists a finite set of sites B,\nfor which there is no deterministic finite point in time by which all sites in B are scanned, is\nnot included in the scope of Definition 1. Figure 1 includes a graphical representation of the\nscandiction process.\nDenote by L(Ψ,F ) (xVn ) the cumulative loss of (Ψ, F ) over xVn , that is\nL(Ψ,F ) (xVn ) =\n\n|Vn |\nX\nt=1\n\n\u0001\nl xΨt , Ft (xΨ1 , . . . , xΨt−1 ) ,\n\n8\n\n(3)\n\n\fwhere l : A × D → [0, ∞) is a given loss function. Throughout this paper, we assume that\nl(*, *) is non-negative and bounded by lmax < ∞. The scandictability of a source Q ∈ M(Ω)\non B ∈ V is defined by\nU (l, QB ) =\n\ninf\n\n(Ψ,F )∈S(B)\n\nEQB\n\n1\nL\n(XB ),\n|B| (Ψ,F )\n\n(4)\n\nwhere QB is the marginal probability measure of X restricted to B and S(B) is the set of all\npossible scandictors for B. The scandictability of Q ∈ M(Ω) is defined by\nU (l, Q) = lim U (l, QVn ).\nn→∞\n\n(5)\n\nBy [22, Theorem 1], the limit in (5) exists for any Q ∈ MS (Ω) and, in fact, for any sequence\n{Bn } of elements of R\u0003 for which R(Bn ) → ∞ we have\nU (l, Q) = lim U (l, QBn ) = inf U (l, QB ).\nn→∞\n\n2.1\n\nB∈R\u0003\n\n(6)\n\nFinite-Set Scandictability\n\nIt will be constructive to refer to the finite set scandictability as well. Let F = {Fn } be a\nsequence of finite sets of scandictors, where for each n, |Fn | = λ < ∞, and the scandictors\nin Fn are defined for the finite set of sites Vn . A possible scenario is one in which one has\na set of \"scandiction rules\", each of which defines a unique scanner for each n, but all these\nscanners comply with the same rule. In this case, F = {Fn } can also be viewed as a finite set\nF which includes sequences of scandictors. For example, |Fn | = 2 for all n, where for each\nn, Fn includes one scandictor which scans the data row-wise and one which scans the data\ncolumn-wise. We may also consider cases in which |Fn | increases with n (but remains finite\nfor every finite n). For Q ∈ MS (Ω) and F = {Fn }, we thus define the finite set scandictability\nof Q as the limit\n△\n\nUF (l, Q) = lim\n\nmin\n\nn→∞ (Ψ,F )∈Fn\n\nEQVn\n\n1\nL\n(XVn ),\n|Vn | (Ψ,F )\n\n(7)\n\nif it exists. Observe that the sub-additivity property of the scandictability as defined in [22],\nwhich was fundamental for the existence of the limit in (5), does not carry over verbatim to\nfinite set scandictability. This is for the following reason. Suppose (Ψ, F ) ∈ S is the optimal\n\nscandictor for XV and (Ψ′ , F ′ ) ∈ S is optimal for XU (assume V ∩ U = ∅). When scanning\n\nXV ∪U , one may not be able to apply (Ψ, F ) for XV and then (Ψ′ , F ′ ) for XU , as this scandictor\n\nmight not be in S. Hence, we seek a universal scheme which competes successfully (in a sense\nsoon to be defined) with a sequence of finite sets of scandictors {Fn }, even when the limit in\n(7) does not exist.\n\n9\n\n\f3\n\nUniversal Scandiction\n\nThe problem of universal prediction is well studied, with various solutions to both the stochastic\nsetting as well as the individual. In this section, we study the problem of universal scandiction.\nNotwithstanding strongly related to its prediction analogue, we first show that this problem\nis fundamentally different in several aspects, mainly due to the enormous degree of freedom\nin choosing the scanning order. Particularly, we first give a negative result, stating that while\nin the prediction problem it is possible to compete with any finite number of predictors and\non every individual sequence, in the scandiction problem one cannot even compete with any\ntwo scandictors on a given individual data array. Nevertheless, we show that in the setting\nof stationary random fields, and under the minimum expected loss criterion, it is possible to\ncompete with any finite set of scandictors. We then show that the set of finite-state scandictors\nis capable of achieving the scandictability of any spatially stationary source. In Theorem 8,\nour main result in this section, we give a universal algorithm which achieves the scandictability\nof any spatially stationary source.\n\n3.1\n\nA Negative Result on Scandiction\n\nAssume both the alphabet A and the prediction space D are [0, 1]. Let l be any non-degenerated\nloss function, in the sense that prediction of a bernoulli sequence under it results in a positive\nexpected loss. As an example, squared or absolute error can be kept in mind, though the\nresult below applies to many other loss functions. The following theorem asserts that in the\nindividual image scenario, it is not possible to compete successfully with any two arbitrary\nscandictors (it is possible, though, to compete with some scandictor sets, as proved in Section\n3.6).\nTheorem 2. Let A = D = [0, 1] and assume l is a non-degenerated loss function. There exist\ntwo scandictors (Ψ, F )1 and (Ψ, F )2 for Vn , such that for any scandictor (Ψ, F ) for Vn there\nexists xVn for which\nL(Ψ,F )(xVn ) − min{L(Ψ,F )1 (xVn ), L(Ψ,F )2 (xVn )} = Θ(|Vn |).\n\n(8)\n\nIn words, there exist two scandictors such that for any third scandictor, there exists an\nindividual image for which the redundancy when competing with the two scandictors does not\nvanish. Theorem 2 marks a fundamental difference between the case where reordering of the\ndata is allowed, e.g., scanning of multidimensional data or even reordering of one-dimensional\n\n10\n\n\fdata, and the case where there is one natural order for the data. For example, using the\nexponential weighting algorithm discussed earlier, it is easy to show that in the prediction\nproblem (i.e., with no scanning), it is possible to compete with any finite set of predictors\nunder the above alphabets and loss functions. Thus, although the scandiction problem is\nstrongly related to its prediction analogue, the numerous scanning possibilities result in a\nsubstantially richer and more challenging problem.\nTheorem 2 is a direct application of the lemma below.\nLemma 3. Let A = D = [0, 1] and assume l is a non-degenerated loss function. There exist a\nrandom field XVn and two scandictors (Ψ, F )1 and (Ψ, F )2 for Vn , such that for any scandictor\n(Ψ, F ) for Vn ,\nEL(Ψ,F ) (XVn ) − E min{L(Ψ,F )1 (XVn ), L(Ψ,F )2 (XVn )} = Θ(|Vn |).\n\n(9)\n\nLemma 3 gives another perspective on the difference between the scandiction and prediction\nscenarios. The lemma asserts that when ordering of the data is allowed, one cannot achieve\na vanishing redundancy with respect to the expected value of the minimum among a set of\nscandictors. This should be compared to the prediction scenario (no reordering), where one\ncan compete successfully not only with respect to the minimum of the expected losses of all\nthe predictors, but also with respect to the expected value of the minimum (for example, see\n[29, Corollary 1]). The main result of this section, however, is that for any stationary random\nfield and under mild conditions on the loss function, one can compete successfully with any\nfinite set of scandictors when the performance criterion is the minimum expected loss.\nProof. (Lemma 3) Let YVn be a random field such that Y (1, 1) is distributed uniformly on\n[0, 1], and YVn \\ Y (1, 1) = Y (1, 2), . . . , Y (1, n), Y (2, 1), Y (2, 2), . . . , Y (n, n) are simply the first\nn2 − 1 bits in the binary representation of Y (1, 1) (ordered row-wise). Note that YVn \\ Y (1, 1)\n\nare i.i.d. unbiased bits, yet conditioned on Y (1, 1), they are deterministic and known. Assume\nnow that XVn is a random cyclic shift of YVn , in the same row-wise order YVn was created.\nFor concreteness, we assume the squared error loss function. In this case, it is easy to\nidentify the constant of the Θ(*) expression in (8). However, the computations below are\neasily generalized to other non-degenerated loss functions. We first show that the expected\ncumulative squared error of any scandictor on XVn is at least (n2 + 1)/8, as the expected\nnumber of steps until the real valued site is located is (n2 + 1)/2, with a loss of 1/4 until that\ntime. More specifically, let J be the random number of cyclic shifts, that is, J is uniformly\ndistributed on {0, 1, . . . , n2 − 1}. For fixed j, let G be the random index such that ΨG is the\n\n11\n\n\freal-valued X (i.e., G is the time the real valued random variable is located by the scanner\nΨ). Let φs denote the Bayes envelope associated with the squared error loss, i.e.,\nφs (p) = min [(1 − p)q 2 + p(q − 1)2 ].\n\n(10)\n\nq∈[0,1]\n\nFor any scandictor (Ψ, F ), we have,\n\n\nn2 \u0010\nX\n\u00112 \nΨ\nXΨi − Fi (XΨ1i−1 ) j\nEL(Ψ,F ) (XVn ) = EJ E\n\n\ni=1\n\nn2 \u0010\nG \u0010\nX\n\u00112\n\u0011\nX\nΨ\nΨi−1 2\n= EJ E\nXΨi − Fi (XΨ1i−1 )\nXΨi − Fi (XΨ1 ) +\n\ni=1\ni=G+1\n)\n( G\n\u00112\nX\u0010\nΨ\nXΨi − Fi (XΨ1i−1 ) j\n≥ EJ E\n\nj\n\n\n\n\n\ni=1\n\n≥ EJ E\n= EJ E\n=\n=\n\n( G\nX\ni=1\n\n(\n\n\u0011\n\u0010\nΨ\nφs P (XΨi |XΨ1i−1 ) j\n\nGφs (P (XΨ1 = 1)) j\n\n1\nE{G}\n4\nn2 + 1\n.\n8\n\n)\n\n)\n\n(11)\n\nOn the other hand, consider the expected minimum of the losses of the following two scandictors: (Ψ, F )1 which scandicts XVn row-wise from X(1, 1) to X(n, n), and (Ψ, F )2 which\nscandicts XVn row-wise from X(n, n) to X(1, 1). Using the same method as in (11), it is\npossible to show that this expected loss is smaller than n2 /16 + o(n2 ), as the expected number\nof steps until the first locates the real-valued site is (n2 + 1)2 /(4n2 ), after which zero loss\nis incurred. This is since once the real-valued site is located, the rest of the values can be\ncalculated by the predictor by cyclic shifting the binary representation of the real-valued pixel.\nThis completes the proof.\nProof. (Theorem 2) By Lemma 3, there exists a stochastic setting under which the expected\nminimum of the losses of two scandictors is smaller than the expected loss of any single\nscandictor. Thus, for any scandictor there exists an individual image on which it cannot\ncompete successfully with the two scandictors.\n\n12\n\n\f3.2\n\nUniversal Scandiction With Respect to Arbitrary Finite\n\nSets\nAs mentioned in Section 1, straightforward implementation of the exponential weighting algorithm is not feasible, since one may not be able to alternate from one expert to the other at\nwish. However, the exponential weighting algorithm was found useful in several lossy source\ncoding works such as Linder and Lugosi [30], Weissman and Merhav [31], Gyorgy et. al. [32]\nand the derivation of sequential strategies for loss functions with memory [33], all of which\nconfronted a similar problem. A common method used in these works, is the alternation of\nexperts only once every block of input symbols, necessary to bear the price of this change (e.g.,\ntransmitting the description of the chosen quantizer [30]-[32]). Thus, although the difficulties\nin these examples differ from those we confront here, the solution suggested therein, which is\nto persist on using the same expert for a significantly long block of data before alternating it,\nwas found useful in our universal scanning problem.\nParticularly, we divide the data array into smaller blocks and alternate scandictors only\neach time a new block of data is to be scanned. Unlike the case of sequential prediction dealt\nwith in [33], here the scandictors must be restarted each time a new block is scanned, as it is\nnot at all guaranteed that all the scandictors scan the data in the same (or any) block-wise\norder (i.e., it is not guaranteed that a scandictor for Vn divides the array to sub-blocks of size\nm × m and scans each of them separately). Hence, in order to prove that it is possible to\ncompete with the best scandictor at each stage n, we go through two phases. In the first,\nwe prove that an exponential weighting algorithm may be used to compete with the best\nscandictor among those operating in a block-wise order. This part of the proof will refer to\nany given data array (deterministic scenario). In the second phase, we use the stationarity of\nthe random field to prove that a block-wise scandictor may perform essentially as well as one\nscanning the data array as a whole. The following theorem stands at the basis of our results,\nestablishing the existence of a universal scandictor which competes successfully with any finite\nset of scandictors.\nTheorem 4. Let X be a stationary random field with a probability measure Q. Let F = {Fn }\nbe an arbitrary sequence of scandictor sets, where Fn is a set of scandictors for Vn and |Fn | =\nλ < ∞ for all n. Then, there exists a sequence of scandictors {(Ψ̂, F̂ )n }, where (Ψ̂, F̂ )n is a\nscandictor for Vn , independent of Q, for which\nlim inf EQVn E\nn→∞\n\n1\n1\n(XVn ) ≤ lim inf min EQVn\nL\nL\n(XVn )\nn→∞ (Ψ,F )∈Fn\n|Vn | (Ψ̂,F̂ )n\n|Vn | (Ψ,F )\n\n13\n\n(12)\n\n\ffor any Q ∈ MS (Ω), where the inner expectation in the l.h.s. of (12) is due to the possible\nrandomization in (Ψ̂, F̂ )n .\nBefore we prove Theorem 4, let us discuss an \"individual image\" type of result, which will\nlater be the basis of the proof. Let xVn denote an individual n × n data array. For m < n,\n△ \u0006n\u0007\n− 1. We divide xVn into K 2 blocks of size m × m and 2K + 1 blocks of possibly\ndefine K = m\nsmaller size. Denote by xi , 0 ≤ i ≤ (K + 1)2 − 1 the i'th block under some fixed scanning\n\norder of the blocks. Since we will later see that this scanning order is irrelevant in this case,\nassume from now on that it is a (continuous) raster scan from the upper left corner. That is,\nthe first line of blocks is scanned left to right, the second line is scanned right to left, and so\non. We will refer to this scan simply as \"raster scan\".\nAs mentioned, the suggested algorithm scans the data in xVn block-wise, that is, it does not\napply any of the scandictors in Fn , only scandictors from Fm . Omitting m for convenience,\ndenote by Lj,i the cumulative loss of (Ψ, F )j ∈ Fm after scanning i blocks, where (Ψ, F )j is\nrestarted after each block, namely, it scans each block separately and independently of the\nP\nl\nother blocks. Note that Lj,i = i−1\nl=0 Lj (x ) and that for i = 0, Lj,i = 0 for all j. Since we\n\nassumed the scandictors are capable of scanning only square blocks, for the 2K + 1 possibly\nsmaller (and not square) blocks the loss may be lmax throughout. For η > 0, and any i and j,\ndefine\n\u0011\n\u0010\ne−ηLj,i\nPi j|{Lj,i }λj=1 = Pλ\n,\n−ηLj,i\ne\nj=1\n\n(13)\n\nwhere λ = |Fm |. We offer the following algorithm for a block-wise scan of the data array\n\nx. For each 0 ≤ i ≤ (K + 1)2 − 1, after scanning i blocks of data, the algorithm computes\n\u0010\n\u0011\nPi j|{Lj,i }λj=1 for each j. It then randomly selects a scandictor according to this distribution,\n\nindependently of its previous selections, and uses this scandictor as its output for the (i + 1)-st\n\nblock. Namely, the universal scandictor (Ψ̂, F̂ )n , promised by Theorem 4, is the one which\ndivides the data to blocks, performs a raster scan of the data block-wise, and uses the above\nalgorithm to decide which scandictor out of Fm to use for each block.\nIt is clear that both the block size and the number of blocks should tend to infinity with\nn in order to achieve meaningful results. Thus, we require the following: a. m = m(n)\ntends to infinity, but strictly slower than n, i.e., m(n) = o(n). b. m(n) is an integer-valued\nmonotonically increasing function, such that for each K ∈ Z there exists n such that m(n) = K.\nThe results are summarized in the following two propositions, the first of which asserts that\nfor m(n) = o(n), vanishing redundancy is indeed possible, while the second asserts that under\nslightly stronger requirements on m(n), this is also true in the a.s. sense (with respect to the\n\n14\n\n\frandom selection of the scandictors in the algorithm).\nProposition 5. Let Lalg (xVn ) be the cumulative loss of the proposed algorithm on xVn , and\ndenote by L̄alg (xVn ) its expected value, where the expectation is with respect to the randomized\nscandictor selection of the algorithm. Let Lmin denote the cumulative loss of the best scandictor\nin Fm , operating block-wise on xVn . Assume |Fm | = λ. Then, for any xVn ,\np\nlmax\nL̄alg (xVn ) − Lmin (xVn ) ≤ m(n)(n + m(n)) log λ √ .\n(14)\n2\n\u0001\nProposition 6. Assume m(n) = o n1/3 . Then, for any image xVn , the difference between\n\nthe normalized cumulative loss of the proposed algorithm and that of the best scandictor in Fm ,\noperating block-wise, converges to 0 with probability 1 with respect to the randomized scandictor\nselection of the algorithm.\nThe proofs of Propositions 5 and 6 are rather technical and are based on the very same\nmethods used in [34] and [33]. See Appendices A.1 and A.2 for the details.\nOn the more technical side, note that the suggested algorithm has \"finite horizon,\" that\nis, one has to know the size of the image in order to divide it to blocks, and only then can\nthe exponential weighting algorithm be used. It is possible to extend the algorithm to infinite\nhorizon. The essence of this generalization is in dividing the infinite image into blocks of\nexponentially growing size2 , and to apply the finite horizon algorithm for each block. We may\nnow proceed to the proof of Theorem 4.\nProof of Theorem 4. Since the result of Proposition 5 applies to any individual data array, it\ncertainly applies after taking the expectation with respect to Q. Therefore,\nEQVn\n\np\n1\nm(n)\n1\nL̄\n−\nE\nL\n≤\nl\n2 log λ.\nQ\nmin\nmax\nalg\nVn\nn2\nn2\nn\n\n(15)\n\nHowever, remember that we are not interested in competing with EQVn n12 Lmin , as this is the\nperformance of the best block-wise scandictor. We wish to compete with the best scandictor\n2\n\nFor example, take four blocks of size l × l, then three of size 2l × 2l, and so on.\n\n15\n\n\foperating on the entire data array XVn , that is, on the whole image of size n × n. We have\n1\nEQVn 2 Lmin\nn\n\n=\n\n1\nEQVn 2\nn\n\n(K+1)2\n\nmin\n\n(Ψ,F )j ∈Fm(n)\n\nX\n\nLj (X i )\n\ni=1\n\n(K+1)2\n\n≤\n\nmin\n\n(Ψ,F )j ∈Fm(n)\n\n(a)\n\n≤\n\nmin\n\n(Ψ,F )j ∈Fm(n)\n\n1 X\nLj (X i )\nn2\ni=1\n\u0014\n1\n* K 2 EQVn Lj (X 0 )\nn2\n\nEQVn\n\n+2Km(n)(n − Km(n))lmax + (n − Km(n))2 lmax\n≤\n\nmin\n\n(Ψ,F )j ∈Fm(n)\n\nEQVn\n\n1\nm(n)\nlmax ,\nLj (X 0 ) + 2\n2\nm(n)\nn\n\n\u0015\n(16)\n\nwhere (a) follows from the stationarity of Q, the assumption that each (Ψ, F )j operates in the\nsame manner on each m(n) × m(n) block, no matter what its coordinates are, and the fact\nthat each (Ψ, F )j may incur maximal loss on non-square rectangles. From (15) and (16), we\nhave\nEQVn\n\np\n1\nm(n)\nm(n)\n1\n0\n∗ (m(n)) (X ) + 2\nL̄\n≤\nE\nL\nl\n+\nl\n2 log λ\nQ\nmax\nmax\nalg\nj\nVn\nn2\nm(n)2\nn\nn\n\u0012\n\u0013\n1\nm(n) p\n0\n= EQVn\nlog\nλ\nL\n∗\n(X\n)\n+\nO\nm(n)2 j (m(n))\nn\n\n(17)\n\nwhere (Ψ, F )j ∗ (m(n)) is the scandictor achieving the minimum in (16). Finally, by our assumptions on {m(n)}, we have\n\u001b\n\u001a\n1\n≤\ninf EQVk 2 L̄alg\nk≥n\nk\n\n\u001b\n\u001a\np\n1\nm(k)\n0\ninf EQVk\nL∗\n(X ) +\nlmax (2 + 2 log λ)\nk≥n\nm(k)2 j (m(k))\nk\n\u001a\n\u001b\np\n1\nm(n)\n0\n≤ inf EQVk\n2 log λ)\nL\n∗ (m(k)) (X )\n+\nl\n(2\n+\nmax\nj\nk≥n\nm(k)2\nn\n\u001b\n\u001a\np\nm(n)\n1\nlmax (2 + 2 log λ).\n(18)\n≤ inf EQVk 2 Lj ∗ (k) (XVk ) +\nk≥n\nk\nn\n\nTaking the limit as n → ∞ and using the fact that m(k)/k → 0 together with the arbitrariness\nof k, gives:\nlim inf EQVn\nn→∞\n\n1\n1\nL̄alg ≤ lim inf EQVn 2 Lj ∗ (n) (XVn ),\n2\nn→∞\nn\nn\n\n(19)\n\nwhich completes the proof of (12).\nIt is evident from (14) and (18) that although the results of Theorem 4 and Proposition\n5 are formulated for fixed λ < ∞ (the cardinality of the scandictor set), these results hold\nfor the more general case of λ = λ(n), as long as the redundancy vanishes, i.e., as long as\n√\nlog λ → 0 when n → ∞. The requirement that\nm(n) = o(n) and λ(n) is such that m(n)\nn\n\n16\n\n\f\u0010 n2 \u0011\nλ(n) = o e m(n)2 still allows very large scandictor sets, especially when m(n) grows slowly\n\nwith n. Furthermore, it is evident from equation (17) that whenever the redundancy vanishes,\nthe statement of Theorem 4 is valid with lim sup as well ,i.e.,\nlim sup EQVn E\nn→∞\n\n3.3\n\n1\n1\nL(Ψ̂,F̂ )n (XVn ) ≤ lim sup min EQVn\nL\n(XVn ).\n|Vn |\n|Vn | (Ψ,F )\nn→∞ (Ψ,F )∈Fn\n\n(20)\n\nFinite-State Scandiction\n\nConsider now the set of finite-state scandictors, very similar to the set of finite-state encoders\ndescribed in [14]. At time t = 1, a finite-state scandictor starts at an arbitrary initial site Ψ1 ,\nwith an arbitrary initial state s0 ∈ S and gives F (s0 ) as its prediction for xΨ1 . Only then it\nobserves xΨ1 . After observing xΨi , it computes its next state, si , according to si = g(si−1 , xΨi )\nand advances to the next site, xΨi+1 , according to Ψi+1 = Ψi + d(si ), where g : S × A 7→ S\n\nis the next state function and d : S 7→ B is the displacement function, B ⊂ Z2 denoting\na fixed finite set of possible relative displacements. It then gives its prediction F (si ) to the\nvalue xΨi+1 . Similarly to [14], we assume the alphabet A includes an additional \"End of File\"\n\n(EoF) symbol to mark the image edges. The following lemma and the theorem which follows\nestablish the fact that the set of finite-state scandictors is indeed rich enough to achieve the\nscandictability of any stationary source, yet not too rich to compete with.\nLemma 7. Let FS = {(Ψ, F )j } be the set of all finite-state scandictors with at most S states.\nThen, for any Q ∈ MS (Ω),\nlim UFS (l, Q) = U (l, Q).\n\nS→∞\n\n(21)\n\nThat is, the scandictability of any spatially stationary source is asymptotically achieved with\nfinite-state scandictors.\nProof. Take B = Vm and let (Ψ̄, F̄ )m be the achiever of the infimum in (4). That is,\nEQVm\n\n1\n1\nL(Ψ̄,F̄ )m (XVm ) ≤\ninf\nEQVm 2 L(Ψ,F ) (XVm ).\n2\nm\nm\n(Ψ,F )∈S(Vm )\n\n(22)\n\nSince Vm is a rectangle of size m × m, the scandictor (Ψ̄, F̄ )m is certainly implementable\nwith a finite-state machine having S(m) < ∞ states. In other words, since Vm is finite, any\n\nscanning rule Ψt : At−1 7→ B and any prediction rule Ft : At−1 7→ A can be implemented with\n2\n\na finite-state machine having at most S̃(m) = Am × m2 states, where in a straightforward\n2\n\nimplementation Am states are required to account for all possible inputs and m2 states are\nrequired to implement a counter.\n\n17\n\n\fNow, for an n × n image (assuming now that m divides n, as dealing with the general case\ncan be done in the exact same way as (16)), we take (Ψ̄′ , F̄ ′ )n to be the scandictor which scans\nthe image in the block-by-block raster scan described earlier, applying (Ψ̄, F̄ )m to each m × m\nblock. Namely, Ψ̄′ scans all the blocks in the first m lines left-to-right until it reaches an EoF\nsymbol, then moves down m lines, scans all the blocks right-to-left until an EoF is reached,\nand so on. The predictor F ̄′ simply implements F̄ for each block separately, i.e., it resets to its\ninitial values at the beginning of each block. It is clear that the scanner Ψ̄′ is implementable\nwith a finite-state machine having S(m) = S̃(m) + 2 < ∞ states and thus (Ψ̄′ , F ̄′ ) ∈ FS(m) .\nFrom the stationarity of Q, we have\ninf\n\n(Ψ,F )∈S(Vn )\n\nEQVn\n\n1\nL\n(XVn ) ≤\nn2 (Ψ,F )\n\nmin\n\n(Ψ,F )∈FS(m)\n\nEQVn\n\n1\nL\n(XVn )\nn2 (Ψ,F )\n\n1\nL ′  ̄′ (XVn )\nn2 (Ψ̄ ,F )n\n1\n= EQVm 2 L(Ψ̄,F̄ )m (XVm )\nm\n1\n≤\ninf\nEQVm 2 L(Ψ,F )(XVm ).\nm\n(Ψ,F )∈S(Vm )\n\n≤ EQVn\n\n(23)\n\nTaking the limits lim supn→∞ and lim inf n→∞ , by (6), we have\nU (l, Q) ≤ lim sup\n\nmin\n\nn→∞ (Ψ,F )∈FS(m)\n\n≤\n\ninf\n\n(Ψ,F )∈S(Vm )\n\nEQVm\n\nEQVn\n\n1\nL\n(XVn )\nn2 (Ψ,F )\n\n1\nL\n(XVm )\nm2 (Ψ,F )\n\n(24)\n\nand\nU (l, Q) ≤ lim inf\n\nmin\n\nn→∞ (Ψ,F )∈FS(m)\n\n≤\n\ninf\n\n(Ψ,F )∈S(Vm )\n\nEQVm\n\nEQVn\n\n1\nL\n(XVn )\nn2 (Ψ,F )\n\n1\nL\n(XVm ).\nm2 (Ψ,F )\n\n(25)\n\nThe proof is completed (including the existence of the limit in the l.h.s. of (21)) by taking m to infinity, applying (6), and remembering that UFS (l, Q) is monotone in S, thus the\nconvergence of the sub-sequence {UFS(m) (l, Q)}∞\nm=1 implies the convergence of the sequence\n\n{UFS (l, Q)}∞\nS=1 ).\n\nIn words, Lemma 7 asserts that for any m, finite-state machines attain the m × m Bayesian\nscandictability for any stationary random field. Note that the reason such results are accomplishable with FSMs is their ability to scan the entire data, block by block, with a machine\nhaving no more than S(m) states, regardless of the size of the complete data array. The\nnumber of the states depends only on the block size.\n\n18\n\n\f3.4\n\nA Universal Scandictor for Any Stationary Random Field\n\nWe now show that a universal scandictor which competes successfully with all finite-state\nmachines of the form given in the proof of Lemma 7, does exist and can, in fact, be implemented\nusing the exponential weighting algorithm. In order to show that we assume that the alphabet\nA is finite and the prediction space D is either finite or bounded (such as the |D| − 1 simplex\nof probability measures on D). In the latter case we further assume that l(x, F ) is Lipschitz in\nits second argument for all x, i.e, there exists a constant c such that for all x, F and ǫ we have\n|l(x, F ) − l(x, F + ǫ)| ≤ c|ǫ|. The following theorem establishes, under the above assumptions,\nthe existence of a universal scandictor for all stationary random fields.\nTheorem 8. Let X be a stationary random field over a finite alphabet A and a probability\nmeasure Q. Let the prediction space D be either finite or bounded (with l(x, F ) then being\nLipschitz in its second argument). Then, there exists a sequence of scandictors {(Ψ, F )n },\nindependent of Q, for which\nlim EQVn E\n\nn→∞\n\n1\nL\n(XVn ) = U (l, Q)\n|Vn | (Ψ,F )n\n\n(26)\n\nfor any Q ∈ MS (Ω), where the inner expectation in the l.h.s. of (26) is due to the possible\nrandomization in (Ψ, F )n .\nProof. Assume first that the range D of the predictors {Ft } is finite. Consider the exponential\nweighting algorithm described in the proof of Theorem 4, where at each m(n)× m(n) block the\nalgorithm computes the cumulative loss of every possible scandictor for an m(n) × m(n) block,\nthen chooses the best scandictor (according to the exponential weighting regime described\ntherein) as its output for the next block. By (17), we have\nEQVn\n\n1\n1\nL̄alg ≤\nmin\nEQV\nL(Ψ,F ) (X 0 ) + O\nm(n) m(n)2\nn2\n(Ψ,F )∈S(Vm(n) )\n\n\u0012\n\n\u0013\nm(n) p\nlog λ ,\nn\n\n(27)\n\nwhere S(Vm(n) ) is the set of all possible scandictors on m(n) × m(n) and λ is the size of that\n\u0011\n\u0010\n√\nlog\nλ\nexpression indeed\nset. Since λ = λ (m(n)), all that is left to check is that the O m(n)\nn\n\ndecays to zero as n tends to infinity.\n\nIndeed, the number of possible scanners for a field B over an alphabet A is\nn\no\n|B|\n{Ψt }t=1 , Ψt : At−1 7→ B\n\n19\n\n=\n\n|B|\nY\n\n(|B| − k)|A|\n\nk\n\nk=0\n\n≤ (|B|!)|A|\n\n|B|\n\n,\n\n(28)\n\n\fwhile the number of possible predictors is\nn\n\n|B|\n\n{Ft }t=1 , Ft : At−1 7→ D\n\no\n\n=\n\n|B|\nY\n\nk=1\n\n|D||A|\n\n≤ |D||B||A|\n\nk\n\n|B|−1\n\n.\n\n(29)\n\nThus, using the Stirling approximation, log k! ≈ k log k, in the sense that limk→∞\n\nlog k!\nk log k\n\n= 1,\n\nwe have\nr h\ni\nm(n)\nm(n)2\nm(n)2 −1\nlog (m(n)2 !)|A|\n|D|m(n)2 |A|\nn\nq\nm(n)\n≈\n2|A|m(n)2 m(n)2 log m(n) + m(n)2 |A|m(n)2 −1 log |D|\nn\nq\nm(n)2\n≈\n|A|m(n)2 log m(n),\n(30)\nn\n√\n√\nwhich decays to zero as n → ∞ for any m(n) = o( log n). Namely, for m(n) = o( log n),\nm(n) p\nlog λ ≤\nn\n\nequation (27) results in\nlim inf EQVn\n\n1\n1\nL̄alg ≤ lim inf\nmin\nEQVm(n)\nL\n(X 0 ),\nn→∞ (Ψ,F )∈S(Vm(n) )\nn2\nm(n)2 (Ψ,F )\n\n(31)\n\nlim sup EQVn\n\n1\n1\nL̄alg ≤ lim sup\nmin\nEQVm(n)\nL\n(X 0 ).\n2\nn\nm(n)2 (Ψ,F )\nn→∞ (Ψ,F )∈S(Vm(n) )\n\n(32)\n\nn→∞\n\nand\nn→∞\n\n1\n0\nSince m(n) → ∞ as n → ∞, by [22] the limit limn→∞ min(Ψ,F )∈S(Vm(n) ) EQVm(n) m(n)\n2 L(Ψ,F ) (X )\n\nexists and equals the scandictability of the source, U (l, Q). However, by definition, U (l, Q) is\nthe best achievable scandiction performance for the source Q, hence,\nlim inf EQVn\nn→∞\n\n1\nL̄alg ≥ U (l, Q),\nn2\n\n(33)\n\nwhich results in\nlim EQVn\n\nn→∞\n\n1\nL̄alg = U (l, Q).\nn2\n\n(34)\n\nFor the case of infinite (but bounded) range D, similarly to [25], we use the fact that the\nloss function l is Lipschitz and take an ǫ-approximation of D. We thus have\nEQVn\n\n1\n1\nL̄alg ≤\nmin\nEQV\nL\n(X 0 )\n2\nm(n)\nn\nm(n)2 (Ψ,F )\n(Ψ,F )∈S(Vm(n) )\n2\n\n+ cm(n) ǫ (m(n)) + O\n\n\u0012\n\nm(n) p\nlog λ\nn\n\n1\n1\n4\nfor some constant c. Choosing ǫ (m(n)) = m(n)\n4 results in |D| = 2 m(n) , hence\n√\nstill decays to zero for any m(n) = O( log n) and (34) is still valid.\n\n20\n\n\u0013\n\n(35)\n\nm(n) √\nlog λ\nn\n\n\fNote that the proof of Theorem 8 does not use the well established theory of universal\nprediction. Instead, the exponential weighting algorithm is used for all possible scans (within\na block) as well as all possible predictors. This is since important parts of the work on prediction in the probabilistic scenario include some assumption on the stationarity of the measure\ngoverning the process, such as stationarity or asymptotically mean stationarity [35].3 In the\nscandiction scenario, however, the properties of the output sequence are not easy to determine,\nand it is possible, in general, that the output sequence is not stationary or ergodic even if the\ninput data array is. Thus, although under certain assumptions, one can use a single universal\npredictor, applied to any scan in a certain set of scans, this is not the case in general.\n\n3.5\n\nUniversal Scandiction for Mixing Random Fields\n\nThe proof of Theorem 4 established the universality of (Ψ̂, F̂ )n under the expected cumulative loss criterion. In order to establish its universality in the Q-a.s. sense, we examine the\nconditions on the measure Q such that the following equality holds.\n2\n\nK\n1 X\nLj (xi ) = EQVm Lj (X 0 ) Q − a.s.\nlim\nn→∞ K 2\n\n(36)\n\ni=1\n\nTo this end, we briefly review the conditions for the individual ergodic theorem for general\ndynamical systems given in [37], specialized for Z2 . Let {An } be a sequence of subsets of Z2 .\nFor each n, the set An is the set of sites over which the arithmetical average is taken. Let A△B\ndenote the symmetric difference between the sets A and B, A ∪ B r A ∩ B, and remember that\nτi (x)j = xj+i .\nCondition 1 ([37, E1′ ]). For all i ∈ Z2 ,\nlim\n\nn→∞\n\n|An △τi (An )|\n= 0.\n|An |\n\n(37)\n\nCondition 2 ([37, E3′′ ]). There exists a constant C1 < ∞ such that for all n,\n|k : k = i − j,\n\ni, j ∈ An | ≤ C1 |An |.\n\n(38)\n\nCondition 3 ([37, E4]). There exists a sequence of measurable sets {Mn } such that,\nlim inf\nn→∞\n\n|k : k = i + j,\n\ni ∈ An , j ∈ Mn |\n= C2 < ∞.\n|Mn |\n\n(39)\n\nBy [37, Theorem 6.1′ ], if the sequence {An } satisfies conditions 1-3, then, for any stationary\nrandom field X with E|X0 | < ∞, we have,\n1 X\nXi = E{X0 |I} Q − a.s.,\nlim\nn→∞ |An |\ni∈An\n\n3\n\nAn important exception is the Kalman filter [36, Section 7.7].\n\n21\n\n(40)\n\n\fwhere Q is the measure governing X and I is the σ-algebra of invariant sets of Ω, that is,\nA ∈ I iff τi (A) = A for all i ∈ Z2 .\n\n(41)\n\nIf Q is ergodic, namely, for each A ∈ I, Q(A) ∈ {0, 1}, then E{X0 |I} is deterministic and\nequals EX0 .\nClearly, since Lj (xi ) depends on a set of m2 sites, with the average in taken over the sets\nAn = {i : i = m * j, j ∈ VK }, (36) may not hold, even if Q is ergodic, as, for example, Condition\n\n1 is not satisfied.4 These two obstacles can be removed by defining an alternative random field,\nX̃, over the set of sites m * Z2 = {j : j = m * i, i ∈ Z2 }, where X̃i equals Lj (X k ) and X k is the\ncorresponding m × m block of X. Note that since the loss function l(*) is bounded and m is\nfinite, E|X̃0 | < ∞. It is not hard to see that conditions 1-3 are now satisfied (with the new\n\nspace being m * Z2 ). However, for E{X̃0 |Im } to be deterministic, where Im is the σ-algebra\nof m-invariant sets,\nA ∈ Im iff τj (A) = A\n\nfor all j = i * m, i ∈ Z2 ,\n\n(42)\n\nit is required that Im is the trivial σ-algebra. In other words, block ergodicity of Q is required.\nWe now show that if the measure Q is strongly mixing, then it is block-ergodic for any\nfinite block size. For A, B ∈ Z2 , define\nαQ (A, B) = sup{|Q(U ∩ V ) − Q(U )Q(V )|, U ∈ σ(XA ), V ∈ σ(XB )},\n\n(43)\n\nwhere σ(XB ) is the smallest sigma algebra generated by XB . Let αQ\na,b (k) denote the strong\nmixing coefficient [38, Sec. 1.7] of the random field Q\nQ\nαQ\na,b (k) = sup{α (A, B), |A| ≤ a, |B| ≤ b, d(A, B) ≥ k},\n\n(44)\n\nwhere d is a metric on Z2 and d(A, B) is the distance between the closest points, i.e., d(A, B) =\nmini∈A,j∈B d(i, j). Assume now that Q is strongly mixing in the sense that for all a, b ∈\n\nN ∪ {∞}, αQ\na,b (k) → 0 as k → ∞. It is easy to see that Q(A) ∈ {0, 1} for all A ∈ Im . Indeed,\nlim\n\nd(i,0)→∞\n\n|Q(τi*m (A) ∩ A) − Q(τi*m (A))Q(A)| = 0,\n\n(45)\n\nhowever, since A is m-invariant, τi*m (A) = A and thus Q(A) = Q(A)2 . Hence Q is m-block\nergodic for each m (i.e., totally ergodic).\nThe following theorem asserts that under the assumption that the random field Q is strongly\nmixing, the results of Theorem 4 apply in the a.s. sense as well.\n4\n\nIn fact, Tempelman's work [37] also includes slightly weaker conditions, but neither are satisfied in the current\n\nsetting.\n\n22\n\n\fTheorem 9. Let X be a stationary strongly mixing random field with a probability measure\nQ. Let F = {Fn } be a sequence of finite sets of scandictors and assume that UF (l, Q) exists.\nThen, if the universal algorithm suggested in the proof of Theorem 4 uses a fixed block size m,\nwe have\nlim inf\nn→∞\n\n1\nLalg (XVn ) ≤ UF (l, Q) + δ(m)\n|Vn |\n\nQ − a.s.\n\n(46)\n\nfor any such Q and some δ(m) such that δ(m) → 0 as m → ∞.\nProof. For each xVn , we have,\n2\n\n1\nLmin (xVn ) =\n|Vn |\n≤\n\n(K+1)\nX\n1\nLj (xi )\nmin\n|Vn | (Ψ,F )j ∈Fm\ni=1\n\n\nK2\nX\n1 \nmin\nLj (xi ) + 2Km(n − Km)lmax + (n − Km)2 lmax \n|Vn | (Ψ,F )j ∈Fm\ni=1\n\n2\n\n≤\n\nK\nm\n1 X\n1\nLj (xi ) + 2 lmax .\nmin\n2\n|Vm | (Ψ,F )j ∈Fm K\nn\n\n(47)\n\ni=1\n\nBy Proposition 5,\n\nThus,\n\n1\nm(n + m) p\n1\nlmax\nLmin (xVn ) +\nL̄alg (xVn ) ≤\nlog λ √ .\n|Vn |\n|Vn |\n|Vn |\n2\n\nlim inf\nn→∞\n\n1\n1\nL̄alg (xVn ) ≤ lim inf\nLmin (xVn )\nn→∞ |Vn |\n|Vn |\n≤\n\n(48)\n\n2\n\nK\n1\n1 X\nLj (xi )\nlim inf min\n|Vm | n→∞ (Ψ,F )j ∈Fm K 2\ni=1\n2\n\n≤\n\nK\n1\n1 X\nLj (xi ).\nmin lim inf\n|Vm | (Ψ,F )j ∈Fm n→∞ K 2\n\n(49)\n\ni=1\n\nSince K → ∞ as n → ∞, by the block ergodicity of Q and the fact that for finite m and each\n(Ψ, F )j ∈ Fm , Lj (X) is a bounded function, it follows that\n2\n\nK\n1 X\nLj (xi ) = EQVm Lj (X 0 ) Q − a.s.\nlim inf 2\nn→∞ K\n\n(50)\n\ni=1\n\nFinally, since UF (l, Q) exists, there exists δ(m) such that δ(m) → 0 as m → ∞ and we have\nlim inf\nn→∞\n\n1\nL̄alg (xVn ) ≤ UF (l, Q) + δ(m)\n|Vn |\n\nQ − a.s.\n\n(51)\n\nThe fact that L̄alg (xVn ) converges to Lalg (xVn ) a.s. is clear from the proof of Proposition 6.\nVery similar to Theorem 9, we also have the following corollary.\n\n23\n\n\fCorollary 10. Let X be a stationary strongly mixing random field over a finite alphabet A and\na probability measure Q. Let the prediction space D be either finite or bounded (with l(x, F )\nthen being Lipschitz in its second argument). Then, there exists a sequence of scandictors\n{(Ψ, F )n }, independent of Q, for which\nlim inf\nn→∞\n\n1\nLalg (XVn ) ≤ U (l, Q) + δ(m)\n|Vn |\n\nQ − a.s.\n\n(52)\n\nfor any such Q and some δ(m) such that δ(m) → 0 as m → ∞. Thus, when m → ∞, the\nperformance of {(Ψ, F )n } equals the scandictability of the source, Q − a.s.\n\n3.6\n\nUniversal Scandiction for Individual Images\n\nThe proofs of Theorems 4 and 9 relied on the stationarity, or the stationarity and mixing\nproperty, of the random field X (respectively). In the proof of Theorem 4, we used the fact\nthat the cumulative loss of any scandictor (Ψ, F ) on a given block of data has the same\nexpected value as that on any other block. In the proof of Theorem 9, on the other hand,\nthe fact that the Cesaro mean of the losses on finite blocks converges to a single value, the\nexpected cumulative loss, was used.\nWhen x is an individual image, however, the cumulative loss of the suggested algorithm may\nbe higher than that of the best scandictor in the scandictors set since restarting a scandictor\nat the beginning of each block may result in arbitrarily larger loss compared to the cumulative\nloss when the scandictor scans the entire data. Compared to the prediction problem, in the\nscandiction scenario, if the scanner is arbitrary, then different starting conditions may yield\ndifferent scans (i.e., a different reordering of the data) and thus arbitrarily different cumulative\nloss, even if the predictor attached to it is very simple, e.g., a Markov predictor. It is expected,\nhowever, that when the scandictors have some structure, it will be possible to compete with\nfinite sets of scandictors in the individual image scenario.\nIn this subsection, we suggest a basic scenario under which universal scandiction of individual images is possible. Further research in this area is required, though, in order to identify\nlarger sets of scandictors under which universality is achievable. As mentioned earlier, since\nthe exponential weighting algorithm used in the proofs of Theorems 4 and 9 applied only\nblock-wise scandictors, i.e., scandictors which scan every block of the data separately from all\nother blocks, stationarity or stationarity and ergodicity of the data were required in order to\nprove its convergence. Here, since the data is an individual image, we impose restrictions on\nthe families of scandictors in order to achieve meaningful results (this reasoning is analogous\n\n24\n\n\fto that described in [23, Section I-B] for the prediction problem). The first restriction is that\nthe scanners with which we compete are such that the actual path taken by each scanner when\nit is applied in a block-wise order has some kind of an overlap (in a sense which will be defined\nlater) with the path taken when it is applied to the whole image. The second restriction is\nthat the predictors are Markovian of finite order (i.e., the prediction depends only on the last k\nsymbols seen, for some finite k). Note that the first restriction does not restrict us to compete\nonly with scandictors which operate in a block-wise order, only requires that the excess loss\ninduced when the scandictors operate in a block-wise order, compared to operating on the\nentire image, is not too large, if, in addition, the predictor is Markovian.\nThe following definition, and the results which follow, make the above requirements precise.\nFor two scanners Ψ and Ψ′ for the data array xB , define NB,K (xB , Ψ, Ψ′ ) as the number of\nsites in B such that their immediate past (context of unit length) under Ψ is contained in the\ncontext of length K under Ψ′ , namely,\nNB,K (xB , Ψ, Ψ′ ) =\n\n\b\n\n1 ≤ i ≤ |B| : ∃1≤j≤|B|,k≤K\n\n(Ψi , Ψi−1 ) = (Ψ′j , Ψ′j−k )\n\n.\n\n(53)\n\nNote that in the above definition, a \"context\" of size w for a site in B refers to the set of w sites\nwhich precede it in the discussed scan, and not their actual values. When {Ψn } is a sequence\nof scanners, where Ψn is a scanner for Vn , it will be interesting to consider the number of sites\nin B ⊂ Vn2 , where B is an n1 × n1 rectangle, n1 ≤ n2 , such that their immediate past under\nΨn2 (applied to Vn2 ) is contained in the context of length K under Ψn1 (applied to B), that is\nNB,K (xB , Ψn2 , Ψn1 ) =\n\nn\n1 ≤ i ≤ |B| : ∃1≤j≤|Vn2 |,k≤K\n\no\n(Ψn2 ,i , Ψn2 ,i−1 ) = (Ψn1 ,j , Ψn1 ,j−k ) ,\n\n(54)\n\nwhere Ψn* ,i is the i'th site the scanner Ψn* visits. The following proposition is proved in\nAppendix A.3.\nProposition 11. Consider two scanners Ψ and Ψ′ for B such that for any individual image\nxB we have\n\nNB,K (xB , Ψ, Ψ′ )\n= 1 − o(|B|).\n|B|\n\n(55)\n\nL(Ψ′ ,F Kw,opt ) (xB ) ≤ L(Ψ,F w,opt ) (xB ) + o(|B|)(K + 1)w−1 lmax ,\n\n(56)\n\nThen, for any xB ,\n\nwhere for each scandictor (Ψ, F w,opt ), F w,opt denotes the optimal w-order Markov predictor for\nthe scan Ψ.\n\n25\n\n\fNote that in order to satisfy the condition in (55) for any array xB , it is likely (but not\na compulsory) that both Ψ and Ψ′ are data-independent scans. However, they need not be\nidentical. If, for example, Ψ is a raster scan from left to right, and Ψ′ applies the same left to\nright scan, but with a different ordering of the rows, then the condition is satisfied for any xB .\nThe result of Proposition 11 yields the following corollary, which gives sufficient conditions\non the scandictors sets under which a universal scandictor for any individual image exists. The\nproof can be found in Appendix A.4.\nCorollary 12. Let {Fn }, |Fn | = λ < ∞, be a sequence of scandictor sets, where\n\nFn = {(Ψ1n , F 1 ), (Ψ2n , F 2 ), . . . , (Ψλn , F λ )} is a set of scandictors for Vn . Assume that the predictors are Markov of finite order w, the prediction space D is finite, and that there exists\nm(n) = o(n) (yet m(n) → ∞ as n → ∞) such that for all 1 ≤ i ≤ λ, n, and xVn we have\n\u0010\n\u0011\nNBm(n) ,K xBm(n) , Ψin , Ψim(n)\n\u0001\n= 1 − o m(n)2 ,\n(57)\n2\nm(n)\nk2\nj\nn\nsub-blocks of size m(n)× m(n) of Vn . Then, there exists\nwhere Bm(n) is any one of the m(n)\na sequence of scandictors {(Ψ̂, F̂ )n } such that for any image x\nlim inf E\nn→∞\n\n1\n1\nL(Ψ̂,F̂ )n (xVn ) ≤ lim inf min\nL(Ψ,F ) (xVn )\nn→∞\n|Vn |\n(Ψ,F )∈Fn |Vn |\n\n(58)\n\nwhere the expectation in the l.h.s. of (58) is due to the possible randomization in (Ψ̂, F̂ )n .\nAlthough the condition in (57) is limiting, and may not be met by many data-dependent\nscans, Corollary 12 still answers on the affirmative the following basic question: do there exist\nscandictor sets for which one can find a universal scandictor in the individual image scenario?\nFor example, by Corollary 12, if the scandictor set includes all raster-type scans (e.g., left-toright, right-to-left, up-down, down-up, diagonal, etc.), accompanied with Markov predictors of\nfinite order, then there exists a universal scandictor whose asymptotic normalized cumulative\nloss is less or equal than that of the best scandictor in the set, for any individual image x. The\ncondition in (57) is also satisfied for some well-known \"self-similar\" space filling curves, such\nas the Sierpinski or Lebesgue curves [39].\n\n4\n\nBounds on the Excess Scandiction Loss for Non-\n\nOptimal Scanners\nWhile the results of Section 3 establish the existence of a universal scandictor for all stationary\nrandom fields and bounded loss function (under the terms of Theorem 8), it is interesting to\n\n26\n\n\finvestigate, from both practical and theoretical reasons, what is the excess scandiction loss\nwhen non-optimal scanners are used. I.e., in this section we answer the following question:\nSuppose that, for practical reasons for example, one uses a non-optimal scanner, accompanied\nwith the optimal predictor for that scan. How large is the excess loss incurred by this scheme\nwith respect to optimal scandiction?\nFor the sake of simplicity, we consider the scenario of predicting the next outcome of a\nbinary source, with D = [0, 1] as the prediction space. Hence, l : {0, 1} × [0, 1] → R is the loss\nfunction. Furthermore, we assume deterministic scanner (though data-dependent, of course).\nThe generalization to randomized scanners is cumbersome but straightforward.\nLet φl denote the Bayes envelope associated with l, i.e.,\nφl (p) = min [(1 − p)l(0, q) + pl(1, q)].\n\n(59)\n\nǫl = min max |αhb (p) + β − φl (p)|,\n\n(60)\n\nq∈[0,1]\n\nWe further define\nα,β 0≤p≤1\n\nwhere hb (p) is the binary entropy function. Thus ǫl is the error in approximating φl (p) by the\nbest affine function of hb (p). For example, when l is the Hamming loss function, denoted by\nlH , we have ǫlH = 0.08 and when l is the squared error, denoted by ls , ǫls = 0.0137. For the\nlog loss, however, the expected instantaneous loss equals the conditional entropy, hence the\nexpected cumulative loss coincides with the entropy, which is invariant to the scan, and we\nhave ǫl = 0. To wit, the scan is inconsequential under log loss.\nAlthough the definitions of φl (p) and ǫl refer to the binary scenario, the results below\n(Theorem 13 and Propositions 14 and 15) hold for larger alphabets, with ǫl defined as in (60),\nwith the maximum ranging over the simplex of all distributions on the alphabet, and h(p)\n(replacing hb (p)) and φl (p) denoting the entropy and Bayes envelope of the distribution p,\nrespectively.\n1\nL(Ψ,F opt ) (XB ) denote the\nLet Ψ be any (possibly data dependent) scan, and let EQB |B|\n\nexpected normalized cumulative loss in scandicting XB with the scan Ψ and the optimal\npredictor for that scan, under the loss function l. Remembering that U (l, QB ) denotes the\n1\nL(Ψ,F opt) (XB ),\nscandictability of XB w.r.t the loss function l, namely, U (l, QB ) = inf Ψ EQB |B|\n\nour main result in this section is the following.\nTheorem 13. Let XB be an arbitrarily distributed binary field. Then, for any scan Ψ,\nEQB\n\n1\nopt (XB ) − U (l, QB ) ≤ 2ǫl .\nL\n|B| (Ψ,F )\n\n27\n\n(61)\n\n\fThat is, the excess loss incurred by applying any scanner Ψ, accompanied with the optimal\npredictor for that scan, with respect to optimal scandiction is not larger than 2ǫl .\nTo prove Theorem 13, we first introduce a prediction result (i.e., with no data reordering)\non the error in estimating the cumulative loss of a predictor under a loss function l with the\nbest affine function of the entropy. We then generalize this result to the multi-dimensional\ncase.\nn\nProposition 14. Let X n be an arbitrarily distributed binary n-tuple and let ELopt\nl (X ) denote\n\nthe expected cumulative loss in predicting X n with the optimal distribution-dependent scheme\nfor the loss function l. Then,\n1\n1\nn\nαl H(X n ) + βl − ELopt\nl (X ) ≤ ǫl ,\nn\nn\n\n(62)\n\nwhere αl and βl are the achievers of the minimum in (60).\nProof. Let αl and βl be the achievers of the minimum in (60). We have,\n1\n1\nn\nαl H(X n ) + βl − ELopt\nl (X )\nn\nn\nn\n1 XX\nP (xt−1 )\n=\nn\nt\nt=1 x\n\nh\n\n(a)\n\n=\n\ni\n−αl P (xt |xt−1 ) log P (xt |xt−1 ) + P (xt |xt−1 )βl − P (xt |xt−1 )l(xt , Ftopt (xt−1 ))\n\nn\n\u0002\n\u0003\n1 XX\nP (xt−1 ) αl hb (P (*|xt−1 )) + βl − φl (P (*|xt−1 ))\nn\nt−1\n\n≤\n\n1\nn\n\n≤\n\n1\nn\n\nt=1 x\nn\nXX\n\nt=1 xt−1\nn X\nX\nt=1 xt−1\n\nP (xt−1 ) αl hb (P (*|xt−1 )) + βl − φl (P (*|xt−1 ))\nP (xt−1 ) max |αl hb (p) + βl − φl (p)|\np\n\n= max |αl hb (p) + βl − φl (p)|\np\n\n= ǫl ,\n\n(63)\n\nwhere (a) is by the definition of φl (*) and the optimality of Ftopt with respect to l.\nThe following proposition is the generalization of Proposition 14 to the multi-dimensional\ncase.\nProposition 15. Let XB be an arbitrarily distributed binary random field. Then, for any scan\nΨ,\nαl\n\n1\n1\nopt (XB ) ≤ ǫl ,\nH(XB ) + βl − EQB\nL\n|B|\n|B| (Ψ,F )\n\n28\n\n(64)\n\n\fwhere αl and βl are the achievers of the minimum in (60).\nFor data-independent scans, the proof follows the proof of Proposition 14 verbatim by applying it to the reordered |B|-tuple XΨ1 , . . . , XΨ|B| and remembering that H(XB ) = H(XΨ1 , . . . , XΨ|B| ).\nFor data-dependent scans, the proof is similar, but requires more caution.\nProof of Proposition 15. Let αl and βl be the achievers of the minimum in (60). For a given\ndata array xB , Ψ1 , Ψ2 (xΨ1 ), . . . , Ψ|B| (xΨ|B|−1 ) are fixed, and merely reflect a reordering of xB\nas a |B|-tuple. Thus,\nαl\n\n1\n1\nopt (XB )\nH(XB ) + βl − EQB\nL\n|B|\n|B| (Ψ,F )\n\n\n|B|\nX\n1 X\nl(xΨt , Ftopt (xΨt−1 )) + βl\n−αl P (xB ) log P (xB ) − P (xB )\n=\n|B| x\nt=1\nB\n\n\n|B|\n|B|\nX\nX\n1 X\n=\n−αl P (xB )\nlog P (xΨt |xΨt−1 ) − P (xB )\nl(xΨt , Ftopt (xΨt−1 )) + βl\n|B| x\nt=1\n\nB\n\nt=1\n\n|B|\n\u0010\n\u0011\n1 XX\n=\nP (xB ) − αl log P (xΨt |xΨt−1 ) + βl − l(xΨt , Ftopt (xΨt−1 )) .\n|B|\nx\nt=1\n\n(65)\n\nB\n\nFix t = t0 in the sum over t. Consider all data arrays xB such that for a specific scanner Ψ\nwe have\nn\n\no\nΨ1 , Ψ2 (xΨ1 ), . . . , Ψt0 −1 (xΨ1 , . . . , xΨt0 −2 ) = I(Ψ),\n\n(66)\n\nwhere I(Ψ) ⊂ B is a fixed set of sites, and (xΨ1 , . . . , xΨt0 −1 ) = a, for some a ∈ {0, 1}t0 −1 . In\nthis case, Ψt (xΨt0 −1 ) is also fixed, and since the term in the parentheses of (65) depends only\n\non I, a and xΨt0 , we have\nX\nxn\n\n=\n\n\u0010\n\u0011\nΨt0 −1\nP (xn ) − αl log P (xΨt0 |xΨt0 −1 ) + βl − l(xΨt0 , Ftopt\n(x\n))\n0\n\nX\nI,a\n\nP (xI = a)\n\nX\n\nxΨt ∈{0,1}\n0\n\n\u0010\n\u0011\nP (xΨt0 |xI = a) − αl log P (xΨt0 |xI = a) + βl − l(xΨt0 , Ftopt\n.\n(a))\n0\n(67)\n\n29\n\n\fConsequently,\nαl\n\n1\n1\nopt (XB )\nH(XB ) + βl − EQB\nL\n|B|\n|B| (Ψ,F )\n|B|\n\n1 XX\n≤\nP (xI = a)\n|B| t=1\nI,a\nX\n\nxΨt ∈{0,1}\n\n\u0010\n\u0011\nP (xΨt |xI = a) − αl log P (xΨt |xI = a) + βl − l(xΨt , Ftopt (a))\n\n|B|\n\n1 XX\n=\nP (xI = a) |αl hb (P (*|xI = a)) + βl − φl (P (*|xI = a))|\n|B| t=1\nI,a\n|B|\n\n1 XX\nP (xI = a) max |αl hb (p) + βl − φl (p)|\n≤\np\n|B| t=1\nI,a\n= max |αl hb (p) + βl − φl (p)|\np\n\n= ǫl .\n\n(68)\n\nIt is now easy to see why Theorem 13 holds.\nProof of Theorem 13. The proof is a direct application of Proposition 15, as for any scan Ψ,\nEQB\n\n1\nopt (XB ) − U (l, QB )\nL\n|B| (Ψ,F )\nαl\n1\nαl\n≤\nH(XB ) + βl − EQB\nL(Ψ,F opt) (XB ) +\nH(XB ) + βl − U (l, QB )\n|B|\n|B|\n|B|\n≤ 2ǫl .\n(69)\n\nAt this point, a few remarks are in order. For the bound in Theorem 13 to be tight, the\nfollowing conditions should be met. First, equality is required in (64) for both the scan Ψ\nand the optimal scan (which achieves U (l, QB )). It is not hard to see that for a given scan Ψ,\nequality in (64) is achieved if and only if P (*|xΨt−1 ) = p for all xΨt−1 , where p is a maximizer\nof (60). However, for (61) to be tight, it is also required that\nαl\n1\nαl\nH(XB ) + βl − EQB\nL(Ψ,F opt ) (XB ) = −\nH(XB ) − βl + U (l, QB ),\n|B|\n|B|\n|B|\n\n(70)\n\nso the triangle inequality is held with equality. Namely, it is required that under the scan\nΨ, for example, P (*|xΨt−1 ) = p for all xΨt−1 , where p is such that αl hb (p) + βl − φl (p) = ǫl ,\n′\n\n′\n\nyet under the optimal scan, say Ψ′ , P (*|xΨt−1 ) = p′ for all xΨt−1 , where p′ is such that\n\n30\n\n\fαl hb (p′ ) + βl − φl (p′ ) = −ǫl . Clearly this is not always the case, and thus, generally, the bound\nin Theorem 13 is not tight. Indeed, although under a different setting (individual images),\nin subsection 4.1 we derive a tighter upper bound on the excess loss for the specific case of\nHamming loss. Using this bound, it is easy to see that the 0.16 bound given here (as ǫl = 0.08\nfor Hamming loss) is only a worst case, and typically much tighter bounds on the excess loss\napply, depending on the image compressibility. For example, consider a 1st order symmetric\nMarkov chain with transition probability 1/4. Scanning this source in the trivial (sequential)\norder results in an error rate of 1/4. By [22], this is indeed the optimal scanning order for this\nsource, as it can be represented as an autoregressive process whose innovation process has a\nmaximum entropy distribution with respect to the Hamming distance. The \"odds-then-evens\"\nscan5 , however, which was proved useful for this source but with larger transition probabilities\n(larger than 1/2, [22]), results in an error rate of 5/16, which is 1/16 away from the optimum.\nIt is not hard to show that different transition probabilities result in lower excess loss.\n\n4.1\n\nIndividual Images and the Peano-Hilbert Scan\n\nIn this subsection, we seek analogous results for the individual image scenario. Namely, the\ndata array xB has no stochastic model. A scandictor (Ψ, F ), in this case, wishes to minimize\nthe cumulative loss over xVn , that is, L(Ψ,F ) (xVn ) as defined in (3).\nIn this setting, although one can easily define an empirical probability measure, the invariance of the entropy H(X n ) to the reordering of the components, which stood at the heart\nof Theorem 13, does not hold for any reordering (scan) and any finite n. Thus, we limit the\npossible set of scanners to that of the finite state machines discussed earlier. Moreover, in\nthe sequel, we do not bound the difference in the scandiction losses of any two scandictors\nfrom that set, only that between the Peano-Hilbert scan (which is asymptotically optimal for\ncompression of individual images [14]) and any other finite state scanner (both accompanied\nwith an optimal Markov predictor), or between two scans (finite state or not) for which the\nFS compressibility of the resulting sequence is the same.\n|B|\n\nWe start with several definitions. Let ΨB be a scanner for the data array xB . Let x1\n\nbe the sequence resulting from scanning xB with ΨB . Fix k < |B| and for any s ∈ {0, 1}k+1\n5\n\nAn \"odds-then-evens\" scanner for a one-dimensional vector xn1 , first scans all the sites with an odd index, in an\n\nascending order, then all the sites with an even index.\n\n31\n\n\fdefine the empirical distribution of order k + 1 as\n(s) =\nP̂Ψk+1\nB\n\n\b\n1\nk < i ≤ |B| : xii−k = s\n|B| − k\n\n.\n\n(71)\n\n(s),\nThe distributions of lower orders, and the conditional distribution are derived from P̂Ψk+1\nB\ni.e., for s′ ∈ {0, 1}k and x ∈ {0, 1} we define\n([s′ , 1])\n([s′ , 0]) + P̂Ψk+1\n(s′ ) = P̂Ψk+1\nP̂Ψk+1\nB\nB\nB\nand\n(x|s′ ) =\nP̂Ψk+1\nB\n\n([s′ , x])\nP̂Ψk+1\nB\n(s′ )\nP̂Ψk+1\nB\n\n(72)\n\n,\n\n(73)\n\nk+1\n(X|X k ) be the\nwhere 0/0 is defined as 1/2 and [*, *] denotes string concatenation.6 Let ĤΨ\nB\n\nempirical conditional entropy of order k, i.e.,\nk+1\n(X|X k ) = −\nĤΨ\nB\n\nX\n\n(s)\nP̂Ψk+1\nB\n\ns∈{0,1}k\n\nX\n\n(x|s).\n(x|s) log P̂Ψk+1\nP̂Ψk+1\nB\nB\n\n(74)\n\nx∈{0,1}\n\nFinally, denote by F k,opt the optimal k-th order Markov predictor, in the sense that it minimizes\n|B|\n\n(*|*) and x1 . The following proposition is the individual\nthe expected loss with respect to P̂Ψk+1\nB\nimage analogue of Proposition 15.\nProposition 16. Let xB be any data array. Let\n\n1\n|B| L(ΨB ,F k,opt ) (xB )\n\ndenote the normalized\n\ncumulative loss of the scandictor (ΨB , F k,opt ), where ΨB is any (data dependent) scan and\nF k,opt is the optimal k-th order Markov predictor with respect to ΨB and l. Then,\nk+1\n(X|X k ) + βl −\nαl ĤΨ\nB\n\nklmax\n1\nL(ΨB ,F k,opt ) (xB ) ≤ ǫl +\n,\n|B|\n|B|\n\n(75)\n\nwhere αl and βl are the achievers of the minimum in (60).\n|B|\n\nSince xB is an individual image, x1 = ΨB (xB ) is fixed. In that sense, the proof resembles\nthat of Proposition 14 and we write xt for the value of x at the t-th site ΨB visits. On the\n(*) and avoid the\nother hand, since the order of the predictor, k, is fixed, we can use P̂Ψk+1\nB\nsummation over the time index t. The complete details can be found in Appendix A.5.\nThe bound in Proposition 16 differs from the one in Proposition 15 for two reasons. First,\nk+1\n(X|X k )\nit is only asymptotic due to the O(k/|B|) term. Second, the empirical entropy ĤΨ\nB\n\nis not invariant to the scanning order. This is a profound difference between the random and\n6\n\nNote that defining P̂Ψk+1\n(x|s′ ), s′ ∈ {0, 1}k as\nB\n\nk+1\nP̂Ψ\n([s′ ,x])\nB\n\nk (s′ )\nP̂Ψ\nB\n\nP̂Ψk+1\n([s′ , 1]).\nB\n\n32\n\nis not consistent since generally P̂Ψk B (s′ ) 6= P̂Ψk+1\n([s′ , 0])+\nB\n\n\fthe individual settings, and, in fact, is at the heart of [14]. In the random setting, the chain\nrule for entropies implies invariance of the entropy rate to the scanning order. This fact does\nnot hold for a k-th order empirical distribution of an individual image, hence the usage of the\nPeano-Hilbert scanning order.7 Consequently, we cannot directly compare between any two\nscans. Nevertheless, Proposition 16 has the following two interesting applications, given by\nProposition 17 and Corollary 18.\nFor Ψ = {Ψn }, where Ψn is a scan for Vn , and an infinite individual image x define\nLkΨ (x) = lim sup\nn→∞\n\n1\nL\nk,opt ) (xVn )\n|Vn | (Ψn ,F\n\n(76)\n\nand\nLΨ (x) = lim LkΨ (x).\nk→∞\n\n(77)\n\nProposition 17 relates the asymptotic cumulative loss of any sequence of finite state scans\nΨ to that resulting from the Peano-Hilbert sequence of scans, establishing the Peano-Hilbert\nsequence as an advantageous scanning order for any loss function.\nProposition 17. Let x be any individual image. Let P H denote the Peano-Hilbert sequence of\nscans. Then, for any sequence of finite state scans Ψ and any loss function l : {0, 1} × [0, 1] →\nR,\nLP H (x) ≤ LΨ (x) + 2ǫl .\n\n(78)\n\nBefore we prove Proposition 17, define the asymptotic k-th order empirical conditional\nentropy under {Ψn } as\n\nk+1\nk+1\n(X|X k )\n(x) = lim sup ĤΨ\nĤΨ\nn\n\n(79)\n\nk+1\n(x).\nĤΨ (x) = lim ĤΨ\n\n(80)\n\nn→∞\n\nand further define\nk→∞\n\nThe existence of ĤΨ (x) is established later in the proof of Proposition 17, where it is also\nk (X k ). By [15, Theorem 3], the latter\nshown that this limit equals limk→∞ lim supn→∞ k1 ĤΨ\nn\n\nlimit is no other than the asymptotic finite state compressibility of x under the sequence of\nscans Ψ, namely,\n1 k\nlim lim sup ĤΨ\n(X k ) = ρ(Ψ(x))\nn\nk→∞ n→∞ k\n= lim lim sup ρE(s) (Ψn (xVn )),\ns→∞ n→∞\n\n(81)\n\nwhere ρE(s) (xn1 ) is the minimum compression ratio for xn1 over the class of all finite state\nencoders with at most s states [15, eq. (1)-(4)]. We may now introduce the following corollary.\n7\n\nYet, the Peano-Hilbert is by no means the only optimal scan. We Elaborate on this issue later in this section.\n\n33\n\n\fCorollary 18. Let Ψ1 and Ψ2 be any two sequences of scans such that ĤΨ1 (x) = ĤΨ2 (x) (in\nparticular, if both Ψ1 and Ψ2 are finite state sequences of scans they result in the same finite\nstate compressibility). Then,\n|LΨ1 (x) − LΨ2 (x)| ≤ 2ǫl .\n\n(82)\n\nfor any loss function l : {0, 1} × [0, 1] → R.\nFor a given sequence of scans Ψ, the set of scanning sequences Ψ′ satisfying ĤΨ (x) = ĤΨ′ (x)\nis larger than one might initially think. For example, a close look at the definition of finite\nstate compressibility given in [15] shows that the finite state encoders defined therein allow\nlimited scanning schemes, as an encoder might read a large data set before its output for that\ndata set is given. Thus, a legitimate finite state encoder in the sense of [15] may reorder\nthe data in a block (of bounded length, as the number of states is bounded) before actually\nencoding it. Consequently, for any individual sequence x one can define several permutations\nhaving the same finite state compressibility. In the multidimensional scenario this sums up to\nsaying that for each scanning sequence Ψ there exist several different scanning sequences Ψ′\nfor which HΨ (x) = ĤΨ′ (x).\nProof of Proposition 17. For each n, Ψn is a scanner for Vn . Thus, by Proposition 16, we have\nk+1\n(X|X k ) + βl −\nαl ĤΨ\nn\n\nklmax\n1\nL\n,\nk,opt ) (xVn ) ≤ ǫl +\n|Vn | (Ψn ,F\n|Vn |\n\n(83)\n\nTaking the limsup as n → ∞ yields\nk+1\n(X|X k ) + βl − LkΨ (x) ≤ ǫl .\nαl lim sup ĤΨ\nn\nn→∞\n\n(84)\n\nFor a stationary source, it is well known (e.g., [40, Theorem 4.2.1]) that limk→∞ H(Xk |X1k−1 )\nexists and in fact\n1\nH(X1k ).\nk→∞ k\n\nlim H(Xk |X1k−1 ) = lim\n\nk→∞\n\n(85)\n\nTo this end, we show that the same holds for empirical entropies. We start by showing that\nk+1\n(X|X k ) is a decreasing sequence in k. Since conditioning reduces the entropy,\nlim supn→∞ ĤΨ\nn\nk+1\nk+1\n(*).\n(X|X k−1 ), where both are calculated using P̂Ψk+1\n(X|X k ) ≤ ĤΨ\nit is clear that ĤΨ\nn\nn\nn\n\nk+1\nk (X|X k−1 ), as\n(X|X k−1 ) is replaced by ĤΨ\nHowever, the above may not be true when ĤΨ\nn\nn\n\nthe later is calculated using P̂Ψk n (*). Nevertheless, using a simple counting argument, it is not\ntoo hard to show that for every k, 0 < j ≤ k and s ∈ {0, 1}i , where 0 < i ≤ j, we have\n(s) −\nP̂Ψk+1\nn\n\nk+1−j\nk+1−j\n≤ P̂Ψj n (s) ≤ P̂Ψk+1\n.\n(s) +\nn\n|Vn | − k\n|Vn | − k\n\n34\n\n(86)\n\n\fThus, by the continuity of the entropy function, we have\nk+1\nk+1\n(X|X k−1 )\n(X|X k ) ≤ lim sup ĤΨ\nlim sup ĤΨ\nn\nn\nn→∞\n\nn→∞\n\nk\n= lim sup ĤΨ\n(X|X k−1 ),\nn\n\n(87)\n\nn→∞\n\nk (X|X k−1 ) is decreasing in k. Since it is a non negative sequence, Ĥ (x)\nhence lim supn→∞ ĤΨ\nΨ\nn\n\nas defined in (80) exists and we have\nαl ĤΨ (x) + βl − LΨ (x) ≤ ǫl .\n\n(88)\n\nWe now show that indeed ĤΨ (x) equals ρ(Ψ(x)) for every sequence of finite state scans Ψ,\nhence when Ψ is a sequence of finite state scans the results of [14] can be applied. The method\nis similar to that in [40, Theorem 4.2.1]), with an adequate handling of empirical entropies.\nBy (86),\nk\n1X k\n1 k\nk\nlim sup ĤΨn (X ) = lim sup\nĤΨn (Xi |X1i−1 )\nn→∞ k\nn→∞ k\n\n= lim sup\nn→∞\n\n1\nk\n\ni=1\nk\nX\ni=1\n\ni\n(Xi |X1i−1 ).\nĤΨ\nn\n\n(89)\n\ni (X |X i−1 ) converges to Ĥ (x) as i → ∞, thus its Cesaro\nBut the sequence lim supn→∞ ĤΨ\ni\nΨ\n1\nn\n\nmean converges to the same limit and we have\n1 k\n(X k )\nlim lim sup ĤΨ\nn\nk→∞ n→∞ k\n= ρ(Ψ(x)).\n\nĤΨ (x) =\n\n(90)\n\nConsider now the Peano-Hilbert sequence of finite state scans, denoted by P H. Let ρ(x)\ndenote the (finite state) compressibility of x as defined in [14, eq. (4)]. For any other sequence\nof finite state scans Ψ̃ we have\nĤP H (x) ≤ ρ(x)\n≤ ĤΨ̃ (x),\n\n(91)\n\nwhere the first inequality is by [14, eq. (9) and (16)] and the second is straightforward from\nthe definition of ρ(x). Finally,\nLP H (x)\n\n(a)\n\n≤\n\nǫl + βl + αl ĤP H (x)\n\n≤\n\nǫl + βl + αl ĤΨ̃ (x)\n\n≤\n\n2ǫl + LΨ̃ (x),\n\n(b)\n\n35\n\n(92)\n\n\fwhere (a) and (b) result from the application of (88) to the sequences P H and Ψ̃ respectively.\n\nThe proof of Corollary 18 is straightforward, using (88) for both Ψ1 and Ψ2 and the triangle\ninequality.\n\n4.1.1\n\nHamming Loss\n\nThe bound in Proposition 17 is valid for any loss function l : {0, 1} × [0, 1] → R. When l is\nthe Hamming loss, the resulting bound is\nLHamming\n(x) ≤ LHamming\n(x) + 0.16,\nPH\nΨ\n\n(93)\n\nfor any other finite state sequence of scans, namely, a uniform bound, regardless of the compressibility of x. However, using known bounds on the predictability of a sequence (under\nHamming loss) in terms of its compressibility can yield a tighter bound.\nIn [41], Feder, Merhav and Gutman proved that for any next-state function g ∈ Gs , where\n\nGs is the set of all possible next state functions with s states, and for any sequence xn1\n1\nρ(g, xn1 ),\n2\nn\nμ(g, xn1 ) ≥ h−1\nb (ρ(g, x1 )) ,\nμ(g, xn1 ) ≤\n\n(94)\n\nwhere μ(g, *) (ρ(g, *)) is the best possible prediction (compression) performance when the next\nstate function is g. Consequently, for any two finite-state scans Ψ1n and Ψ2n for xVn ,\nmin μ(g,Ψ1n (xVn )) − min μ(g, Ψ2n (xVn ))\n\ng∈Gs\n\ng∈Gs\n\n\u0001\n1\n≤ min ρ(g, Ψ1n (xVn )) − min h−1\nρ(g, Ψ2n (xVn )\nb\ng∈Gs 2\ng∈Gs\n\u0012\n\u0013\n1\n2\n= min ρ(g, Ψ1n (xVn )) − h−1\nρ(g,\nΨ\n(x\nmin\n))\n.\nn Vn\nb\ng∈Gs\n2 g∈Gs\n\n(95)\n\nTaking Ψ1n to be the Peano-Hilbert scan, the results of [14] imply that\nmin ρ(g, ΨP H (xVn )) ≤ min ρ(g, Ψn (xVn )) + ǫn,s\n\ng∈Gs\n\n(96)\n\ng∈Gs\n\nfor any finite-state scan Ψn , where ǫn,s satisfies lims→∞ lim supn→∞ ǫn,s = 0. Hence,\nmin μ(g, ΨP H (xVn )) − min μ(g, Ψ(xVn ))\n\ng∈Gs\n\ng∈Gs\n\n1\n≤ min ρ(g, ΨP H (xVn )) − h−1\nb\n2 g∈Gs\n\n\u0012\n\nmin ρ(g, ΨP H (xVn )) − ǫn,s . (97)\n\ng∈Gs\n\nTaking the limits lim supn→∞ and then s → ∞ implies the following proposition.\n\n36\n\n\u0013\n\n\fProposition 19. Let x be any individual image. Let P H denote the Peano-Hilbert sequence\nof scans. Then, under the Hamming loss function, for any sequence of finite state scans Ψ we\nhave\n1\nLP H (x) ≤ LΨ (x) + ρ(x) − h−1\nb (ρ(x)),\n2\n\n(98)\n\nwhere ρ(x) is the compressibility of the individual image x.\nIn other words, the specific scandictor composed of the Peano-Hilbert scan followed by the\noptimal predictor, adheres to the same asymptotic bounds (on predictability in terms of the\ncompressibility) as the best finite-state scandictor. Figure 2 plots the function 21 ρ − h−1\nb (ρ).\nThe maximum possible loss is 0.16, similar to the bound given in Proposition 17, yet this value\nis achieved only when the image's FS compressibility is around 0.75 bits/symbol. For images\nwhich are highly compressible, for example, when ρ < 0.1 the resulting excess loss is smaller\nthan 0.04.\nUpper bound on the redundancy in using the Peano−Hilbert scan.\n0.18\n\n0.5ρ − h−1(ρ): the maximum possible redundancy\n\n0.16\n\n0.14\n\n0.12\n\n0.1\n\n0.08\n\n0.06\n\n0.04\n\n0.02\n\n0\n\n−0.02\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n0.5\n0.6\n0.7\nρ: the compressibility of the image\n\n0.8\n\n0.9\n\n1\n\nFigure 2: A plot of 21 ρ − h−1 (ρ). The maximum redundancy is not higher than 0.16 in worst case,\nbut will be much lower for more compressible arrays.\n\n5\n\nConclusion\n\nIn this paper, we formally defined finite set scandictability, and showed that there exists a\nuniversal algorithm which successfully competes with any finite set of scandictors when the\nrandom field is stationary. Moreover, the existence of a universal algorithm which achieves the\n\n37\n\n\fscandictability of any spatially stationary random field was established. We then considered\nthe scenario where non-optimal scanners are used, and derived a bound on the excess loss in\nthat case, compared to optimal scandiction.\nIt is clear that the scandiction problem is even more intricate than its prediction analogue.\nFor instance, very basic results in the prediction scenario do not apply to the scandiction case\nin a straightforward way, and, in fact, are still open problems. To name a few, consider the\ncase of universal scandiction of individual images, briefly discussed in Section 3.6. Although\nthe question whether there exists a universal scandictor which competes successfully with any\nfinite set of scandictors on any individual image was answered negatively in Section 3.1, it is\ninteresting to discover interesting sets of scandictors for which universal scandiction is possible.\nThe sequential prediction literature also includes an elegant result [41] on the asymptotic\nequivalence between finite state and Markov predictors. We conjecture that this equivalence\ndoes not hold in the multi-dimensional scenario for any individual image. Finally, the very\nbasic problem of determining the optimal scandictor for a given random field X with a known\nprobability measure Q, is still unsolved in the general case.\nIt is also interesting to consider the problems of scanning and prediction, as well as filtering, in a noisy environment. These problems are intimately related to various problems in\ncommunications and image processing, such as filtering and denoising of images and video. As\nmentioned in Section 1, these problems are the subject of [27].\n\nA\n\nAppendixes\n\nA.1\n\nProof of Proposition 5\n\nFor the sake of simplicity, we suppress the dependence of m(n) in n. Define Wi =\nWe have\nlog\n\nW(K+1)2\nW0\n\n= log\n\nλ\nX\n\n−ηLj,(K+1)2\n\ne\n\nj=1\nj\n\n−ηLj,i .\nj=1 e\n\n− log λ\n\n−ηLj,(K+1)2\n\n≥ log max e\n\nPλ\n\n− log λ\n\n= −η min Lj,(K+1)2 − log λ\nj\n\n= −ηLmin − log λ.\n\n38\n\n(99)\n\n\fMoreover,\nWi+1\nlog\nWi\n\n= log\n\nPλ\n\n= log\n\nλ\nX\n\n−η(Lj,i +Lj (xi ))\nj=1 e\nPλ\n−ηLj ′ ,i\nj ′ =1 e\n\nj=1\n\n≤ −η\n\nλ\nX\nj=1\n\n\u0011\n\u0010\ni\nPi j|{Lj,i }λj=1 e−ηLj (x )\n\u0011\n\u0010\n2\nm4 lmax\nη2\nPi j|{Lj,i }λj=1 Lj (xi ) +\n,\n8\n\n(100)\n\nwhere the last inequality follows from the extension to Hoeffding's inequality given in [33] and\nthe fact that −ηLj (xi ) is in the range [−ηm2 lmax , 0]. Thus,\nW(K+1)2\nlog\nW0\n\n=\n\n(K+1)2 −1\n\nX\n\nlog\n\ni=0\n\n≤ −η\n\nWi+1\nWi\n\n(K+1)2 −1 λ\nX X\ni=0\n\n= −η L̄alg +\n\n\u0011\n\u0010\n2\nη 2 (K + 1)2\nm4 lmax\nPi j|{Lj,i }λj=1 Lj (xi ) +\n8\n\nj=1\n4\n2\nm lmax\nη 2 (K\n\n8\n\n+ 1)2\n\n.\n\n(101)\n\nFinally, from (99) and (101), we have\n2\nlog λ m4 lmax\nη(K + 1)2\n+\nη\n8\n2\n2\nlog λ m lmax η(n + m)2\n+\n.\nη\n8\n\nL̄alg − Lmin ≤\n≤\n\n(102)\n\nThe bound in (14) easily follows after optimizing the right hand side of (102) with respect to\nη.\n\nA.2\n\nProof of Proposition 6\n\nLet δ(n) be some sequence satisfying δ(n) → 0 as n → ∞. Define the sets\n\u001a\n\u001b\nLalg (xVn ) − Lmin (xVn )\n2\nAn = ω :\n> δ(n ) ,\nn2\nwhere (Ω, P ) is the probability space. We wish to show that\n\u0012\n\u0013\nP lim sup An = 0,\nn→∞\n\n(103)\n\n(104)\n\nthat is, P (An i.o.) = 0. Let (Ψ, F )k be the scandictor chosen by the algorithm for the k + 1\nblock, xk . Define\no\nn\nZk = L(Ψ,F )k (xk ) − E L(Ψ,F )k (xk )|{Lj,k }λj=1 ,\n\n39\n\n(105)\n\n\f\u0010\n\u0011\nwhere the expectation is with respect to Pk j|{Lj,k }λj=1 . Namely, the actual randomization\n\nin Zk is in the choice of (Ψ, F )k . Thus, {Zk } are clearly independent, and adhere to the\n\nfollowing Chernoff-like bound [33, eq. 33]\n\n\n\u001b\n\u001a\n(K+1)2\nX\n2(K + 1)2 ǫ2\n2 \n\nP\nZk ≥ (K + 1) ǫ ≤ exp −\n(m2 lmax )2\n\n(106)\n\nk=1\n\nfor any ǫ > 0. Note that\n\n(K+1)2\n\nX\nk=1\n\nZk = Lalg (xVn ) − L̄alg (xVn ),\n\n(107)\n\nthus, together with eq. (14), we have\nP\n\n\u0012\n\np\nlmax\nLalg (xVn ) − Lmin (xVn ) ≥ (K + 1) ǫ + m(n + m) log λ √\n2\n2\n\n\u0013\n\n\u001a\n\u001b\n2(K + 1)2 ǫ2\n≤ exp −\n. (108)\n(m2 lmax )2\n\nSet\nδ(n) =\n\n√\n√\n(K + 1)2 ǫ + m(n + m) log λ lmax\n2\nn2\n\n.\n\n(109)\n\nClearly δ(n) → 0 as n → ∞ for any m(n) = o(n) satisfying m(n) → ∞. For the summability\n\u0001\nof the r.h.s. of (108) we further require that m(n) = o n1/3 . The proposition then follows\n\ndirectly by applying the Borel-Cantelli lemma.\n\nA.3\n\nProof of Proposition 11\n\nWe show, by induction on w, that the number of sites in B for which the context of size w (in\nterms of sites in B) under the scan Ψ is not contained in the context of size Kw under the\nscan Ψ′ is at most o(|B|)(K + 1)w−1 . This proves the proposition, as the cumulative loss of\n(Ψ′ , F Kw,opt) is no larger than o(|B|)(K + 1)w−1 lmax on these sites, and is at least as small as\nthat of (Ψ, F w,opt ) on all the rest |B| − o(|B|)(K + 1)w−1 sites.\n\nFor w = 1 this is indeed so, by our assumption on Ψ and Ψ′ - i.e., (55). We say that a site\n\nin B satisfies the context-condition with length w − 1 if its context of size i − 1, 1 < i ≤ w,\n\nunder the scan Ψ is contained in its context of size K(i − 1) under the scan Ψ′ . Assume\nthat the number of sites in B which do not satisfy the context-condition with length w − 1\nis at most o(|B|)(K + 1)w−2 . We wish to lower bound the number of sites in B for which\n\nthe context-condition with length w is satisfied. A sufficient condition is that the contextcondition with length w − 1 is satisfied for both the site itself and its immediate past under\nΨ. If the context-condition with length w − 1 is satisfied for a site, its immediate past under\n\n40\n\n\fΨ is contained in its past of length K under Ψ′ . Thus, if the context-condition of length w − 1\n\nis satisfied for a given site, and for all K preceding sites under Ψ′ , then it is also satisfied for\nlength w. In other words, each site in B which does not satisfy the context-condition with\nlength w − 1 results in at most K + 1 sites (itself and K more sites) which do not satisfy the\ncontext-condition with length w. Hence, if our inductive assumption is satisfied for w − 1,\nthe number of sites in B which do not satisfy the context-condition with length w is at most\no(|B|)(K + 1)w−2 (K + 1), which completes the proof.\n\nA.4\n\nProof of Proposition 12\n\nThe proof is a direct application of Propositions 5 and 11. For each n, define the scandictors\nset\nF̃n =\n\nn\n\n(Ψ1n , F Kw,1 ), (Ψ1n , F Kw,2 ), . . . , (Ψ1n , F Kw,|D|\n\n|A|Kw\n\n(Ψ2n , F Kw,1 ), (Ψ2n , F Kw,2 ), . . . , (Ψ2n , F Kw,|D|\n\n), . . .\n\n|A|Kw\n\n), . . .\n\n...\n(Ψλn , F Kw,1 ), (Ψλn , F Kw,2 ), . . . , (Ψλn , F Kw,|D|\n|D||A|\n\nwhere {F Kw,i }i=1\n\nKw\n\n|A|Kw\n\no\n) ,\n\n(110)\n\nis the set of all Markov predictors of order Kw.8 Applying the results\n\nof Proposition 5 to {F̃n }, we have, for any image x and all n,\nEL(Ψ̂,F̂ )n (xVn ) −\n\nmin\n(Ψ,F )∈F̃m(n)\n\nL(Ψ,F ) (xVn ) ≤ m(n) (n + m(n))\n\nq\n\nlmax\nlog λ|D||A|Kw √ ,\n2\n\n(111)\n\nwhere min(Ψ,F )∈Fm(n) L(Ψ,F ) (xVn ) is the cumulative loss of the best scandictor in Fm(n) operating block-wise on xVn . However, by Proposition 11, for any 1 ≤ i ≤ λ, x and n,\nmin\n1≤j≤|D||A|\n\nKw\n\nEL(Ψi\n\nm(n)\n\n,F Kw,j ) (xVn )\n\n2\n\n≤ EL(Ψin ,F i ) (xVn ) + o m(n)\n\n\u0001\n\nw−1\n\n(K + 1)\n\nlmax\n\n\u0016\n\n\u00172\nn\n.\nm(n)\n(112)\n\nNote that\nmin\n(Ψ,F )∈F̃m(n)\n\nL(Ψ,F ) (xVn ) =\n\nmin\n\nmin\n\n1≤i≤λ 1≤j≤|D||A|Kw\n\nEL(Ψi\n\n(\n\nm(n)\n\n,F Kw,j ) (xVn )\n\n\u00172 )\nn\n≤ min EL(Ψin ,F i ) (xVn ) + o m(n) (K + 1)\nlmax\n1≤i≤λ\nm(n)\n\u00172\n\u0016\n\u0001\nn\n2\nw−1\n.\n=\nmin EL(Ψ,F ) (xVn ) + o m(n) (K + 1)\nlmax\nm(n)\n(Ψ,F )∈Fn\n(113)\n8\n\n2\n\n\u0001\n\nw−1\n\n\u0016\n\nAlternatively, one can use one universal predictor which competes successfully with all the Markov predictors of\n\nthat order.\n\n41\n\n\fThus, together with (111), we have\nEL(Ψ̂,F̂ )n (xVn ) −\n\nmin\n\n(Ψ,F )∈Fn\n\n≤ m(n) (n + m(n))\n\nEL(Ψ,F ) (xVn )\n\nq\n\nlmax\nlog λ|D||A|Kw √\n2\n\n2\n\n+ o m(n)\n\n\u0001\n\nw−1\n\n(K + 1)\n\nlmax\n\n\u0016\n\nn\nm(n)\n\n\u00172\n\n, (114)\n\nwhich completes the proof since |D|, |A|, K and w are finite.\n\nA.5\n\nProof of Proposition 16\n\nSimilar to the proof of Proposition 14, we have,\n1\nL\nk,opt ) (xB )\n|B| (ΨB ,F\n\n\n|B|\nk\nX\nX\n1 \nk+1\n\n= αl ĤΨ\nl(xt , F k,opt(xt−1\n(X|X k ) + βl −\nl(xt , F k,opt (xt−1\n1 )) +\nt−k ))\nB\n|B| t=1\n\nk+1\n(X|X k ) + βl −\nαl ĤΨ\nB\n\nt=k+1\n\nk+1\n(X|X k ) + βl −\n= αl ĤΨ\nB\n\n\u0012\n\u0013\n|B|\nk\nX\nk\n1\n1 X\nk,opt t−1\nl(xt , F\n(x1 )) − 1 −\nl(xt , F k,opt (xt−1\nt−k ))\n|B| t=1\n|B| |B| − k\nt=k+1\n\nk+1\n≤ αl ĤΨ\n(X|X k ) + βl −\nB\n\n|B|\n\nX\n1\nklmax\n.\nl(xt , F k,opt (xt−1\n)) +\nt−k\n|B| − k\n|B|\n\n(115)\n\nt=k+1\n\n(s) ans sum over\nSince the order of the predictor is fixed, we can use the definition of P̂Ψk+1\nB\ns ∈ {0, 1}k+1 instead of t. Thus,\nk+1\n(X|X k ) + βl −\nαl ĤΨ\nB\n\n1\nL\nk,opt ) (xB )\n|B| (ΨB ,F\n\nk+1\n≤ αl ĤΨ\n(X|X k ) + βl −\nB\n\n=\n\nX\n\n(s′ )\nP̂Ψk+1\nB\n\ns′ ∈{0,1}k\n\n+\n=\n\nX\n\nX\n\n(s)l(sk+1 , F k,opt(sk1 )) +\nP̂Ψk+1\nB\n\ns∈{0,1}k+1\n\nx∈{0,1}\n\nklmax\n|B|\n\nX\n\n\u0011\n\u0010\n′\nk,opt ′\n′\nk+1\n(x|s\n)\n+\nβ\n−\nl(x,\nF\n(s\n))\n(x|s\n)\n−α\nlog\nP̂\nP̂Ψk+1\nl\nl\nΨB\nB\n\n\u0011\n\u0010\nklmax\nk+1\nk+1\n′\n′\n′\n(*|s\n))\n(*|s\n))\n+\nβ\n−\nφ\n(\nP̂\n(s\n)\nα\nh\n(\nP̂\nP̂Ψk+1\n+\nl\nl\nl\nb\nΨB\nΨB\nB\n|B|\nk\n\ns′ ∈{0,1}\n\n≤\n\nX\n\ns′ ∈{0,1}k\n\n= ǫl +\n\nklmax\n|B|\n\n(s′ ) max |αl hb (p) + βl − φl (p)| +\nP̂Ψk+1\nB\np\n\nklmax\n.\n|B|\n\nklmax\n|B|\n(116)\n\n42\n\n\fReferences\n[1] M.J. Weinberger, G. Seroussi, and G. Sapiro, \"LOCO-I: A low complexity, context-based,\nlossless image compression algorithm,\" Proc. IEEE Data Compression Conf., pp. 140–149,\n1996.\n[2] C.-H. Lamarque and F. Robert, \"Image analysis using space-filling curves and 1D wavelet\nbases,\" Pattern Recognition, vol. 29, no. 8, pp. 1309–1322, 1996.\n[3] A. Krzyzak, E. Rafajlowicz, and E. Skubalska-Rafajlowicz, \"Clipped median and space\nfilling curves in image filtering,\" Nonlinear Analysis, vol. 47, pp. 303–314, 2001.\n[4] L. Velho and J. M. Gomes, \"Digital halftoning with space filling curves,\" Computer\nGraphics, vol. 25, no. 4, pp. 81–90, July 1991.\n[5] E. Skubalska-Rafajlowicz, \"Pattern recognition algorithms based on space-filling curves\nand orthogonal expansions,\" IEEE Trans. Inform. Theory, vol. 47, no. 5, pp. 1915–1927,\nJuly 2001.\n[6] T. Asano, D. Ranjan, T. Roos, E. Welzl, and P. Widmayer, \"Space-filling curves and\ntheir use in the design of geometric data structures,\" Theoretical Computer Science, vol.\n181, pp. 3–15, 1997.\n[7] K.-L. Chung, Y.-H. Tsai, and F.-C. Hu, \"Space-filling approach for fast window query on\ncompressed images,\" IEEE Trans. img. processing, vol. 9, no. 12, pp. 2109–2116, 2000.\n[8] B. Moon, H. V. Jagadish, C. Faloutsos, and J. H. Saltz, \"Analysis of the clustering properties of the Hilbert space-filling curve,\" IEEE Trans. Knowledge and Data Engineering,\nvol. 13, no. 1, pp. 124–141, January/February 2001.\n[9] A. Bogomjakov and C. Gotsman, \"Universal rendering sequences for transparent vertex\ncaching of progressive meshes,\" Computer Graphics Forum, vol. 21, no. 2, pp. 137–148,\n2002.\n[10] R. Niedermeier, K. Reinhardt, and P. Sanders,\n\n\"Towards optimal locality in mesh-\n\nindexings,\" Discrete Applied Mathematics, vol. 117, pp. 211–237, 2002.\n[11] H. Tang, S.-I. Kamata, K. Tsuneyoshi, and M.-A. Kobayashi, \"Lossless image compression\nvia multi-scanning and adaptive linear prediction,\" IEEE Asia-Pacific Conference on\nCircuits and Systems, pp. 81–84, December 2004.\n\n43\n\n\f[12] N. D. Memon, K. Sayood, and S. S. Magliveras, \"Lossless image compression with a\ncodebook of block scans,\" IEEE Journal on Selected Areas In Communications, vol. 13,\nno. 1, pp. 24–30, January 1995.\n[13] R. Dafner, D. Cohen-Or, and Y. Matias, \"Context-based space filling curves,\" EUROGRAPHICS, vol. 19, no. 3, 2000.\n[14] A. Lempel and J. Ziv, \"Compression of two-dimensional data,\" IEEE Trans. Inform.\nTheory, vol. IT-32, no. 1, pp. 2–8, January 1986.\n[15] J. Ziv and A. Lempel, \"Compression of individual sequences via variable-rate coding,\"\nIEEE Trans. Inform. Theory, vol. IT-24, pp. 530–536, September 1978.\n[16] T. Weissman and S. Mannor, \"On universal compression of multi-dimensional data arrays\nusing self-similar curves,\" in Proc. 38th Annu. Allerton Conf. Communication, Control,\nand Computing, October 2000, vol. I, pp. 470–479.\n[17] Z. Ye and T. Berger, Information measures for discrete random fields, Science Press,\nBeijing, 1998.\n[18] J. Ziv, \"On universal quantization,\" IEEE Trans. Inform. Theory, vol. IT-31, pp. 344–\n347, May 1985.\n[19] A. Dembo and I. Kontoyiannis, \"Source coding, large deviations, and approximate pattern\nmatching,\" IEEE Trans. Inform. Theory, vol. 48, no. 6, pp. 1590–1615, June 2002.\n[20] I. Kontoyiannis, \"Pattern matching and lossy data compression on random fields,\" IEEE\nTrans. Inform. Theory, vol. 49, pp. 1047–1051, April 2003.\n[21] N. Memon, D. L. Neuhoff, and S. Shende, \"An analysis of some common scanning techniques for lossless image coding,\" IEEE Trans. on Image Processing, vol. 9, no. 11, pp.\n1837–1848, November 2000.\n[22] N. Merhav and T. Weissman, \"Scanning and prediction in multidimensional data arrays,\"\nIEEE Trans. Inform. Theory, vol. 49, no. 1, pp. 65–82, January 2003.\n[23] N. Merhav and M. Feder, \"Universal prediction,\" IEEE Trans. Inform. Theory, vol. 44,\nno. 6, pp. 2124–2147, October 1998.\n[24] L. Gyorfi, G. Lugosi, and G. Morvai, \"A simple randomized algorithm for sequential\nprediction of ergodic time series,\" IEEE Trans. Inform. Theory, vol. 45, no. 7, pp. 2642–\n2650, November 1999.\n\n44\n\n\f[25] T. Weissman and N. Merhav, \"Universal prediction of random binary sequences in a noisy\nenvironment,\" Ann. App. Prob., vol. 14, no. 1, pp. 54–89, February 2004.\n[26] V. G. Vovk, \"Aggregating strategies,\" Proc. 3rd Annu. Workshop Computational Learning\nTheory, San Mateo, CA, pp. 372–383, 1990.\n[27] A. Cohen, T. Weissman, and N. Merhav, \"Scanning and sequential decision making for\nmulti-dimensional data - part II: the noisy case,\" 2007, in preparation.\n[28] T. Weissman and N. Merhav, \"Universal prediction of individual binary sequences in the\npresence of noise,\" IEEE Trans. Inform. Theory, vol. 47, pp. 2151–2173, September 2001.\n[29] T. Weissman, E. Ordentlich, M. Weinberger, A. Somekh-Baruch, and N. Merhav, \"Universal filtering via prediction,\" IEEE Trans. Inform. Theory, vol. 53, no. 4, pp. 1253–1264,\nApril 2007.\n[30] T. Linder and G. Lugosi, \"A zero-delay sequential scheme for lossy coding of individual\nsequences,\" IEEE Trans. Inform. Theory, vol. 47, no. 6, pp. 2533–2538, September 2001.\n[31] T. Weissman and N. Merhav, \"On limited-delay lossy coding and filtering of individual\nsequences,\" IEEE Trans. Inform. Theory, vol. 48, no. 3, pp. 721–733, March 2002.\n[32] A. Gyorgy, T. Linder, and G. Lugosi, \"Efficient adaptive algorithms and minimax bounds\nfor zero-delay lossy source coding,\" IEEE Trans. Signal Processing, vol. 52, no. 8, pp.\n2337–2347, August 2004.\n[33] N. Merhav, E. Ordentlich, G. Seroussi, and M. J. Weinberger, \"On sequential strategies\nfor loss functions with memory,\" IEEE Trans. Inform. Theory, vol. 48, pp. 1947–1958,\nJuly 2002.\n[34] D. Haussler, J. Kivinen, and M. K. Warmuth, \"Sequential prediction of individual sequences under general loss functions,\" IEEE Trans. on Information Theory, vol. 44, no.\n5, pp. 1906–1925, 1998.\n[35] R. M. Gray and J. C. Kieffer, \"Asymptotically mean stationary measures,\" Ann. Prob.,\nvol. 8, no. 5, pp. 962–973, 1980.\n[36] B. Porat, Digital Processing of Random Signals, Prentice-Hall, New Jersey, 1994.\n[37] A. A. Tempelman, \"Ergodic theorems for general dynamical systems,\" Trans. Moscow\nMath. Soc., pp. 94–132, 1972.\n[38] X. Guyon, Ramdom Fields on a Network, Springer-Verlag, 1995.\n\n45\n\n\f[39] H. Sagan, Space-Filling Curves, Springer-Verlag, New York, 1994.\n[40] T. M. Cover and J. A. Thomas, Elements of Information Theory, Wiley, New York, 1991.\n[41] M. Feder, N. Merhav, and M. Gutman, \"Universal prediction of individual sequences,\"\nIEEE Trans. Inform. Theory, vol. 38, pp. 1258–1270, July 1992.\n\n46\n\n\f"}