{"id": "http://arxiv.org/abs/cs/0504022v1", "guidislink": true, "updated": "2005-04-06T20:04:55Z", "updated_parsed": [2005, 4, 6, 20, 4, 55, 2, 96, 0], "published": "2005-04-06T20:04:55Z", "published_parsed": [2005, 4, 6, 20, 4, 55, 2, 96, 0], "title": "A Matter of Opinion: Sentiment Analysis and Business Intelligence\n  (position paper)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cs%2F0504045%2Ccs%2F0504054%2Ccs%2F0504009%2Ccs%2F0504101%2Ccs%2F0504042%2Ccs%2F0504078%2Ccs%2F0504072%2Ccs%2F0504109%2Ccs%2F0504077%2Ccs%2F0504066%2Ccs%2F0504002%2Ccs%2F0504022%2Ccs%2F0504100%2Ccs%2F0504023%2Ccs%2F0504107%2Ccs%2F0504018%2Ccs%2F0504108%2Ccs%2F0504040%2Ccs%2F0504106%2Ccs%2F0504047%2Ccs%2F0504081%2Ccs%2F0504102%2Ccs%2F0504020%2Ccs%2F0504007%2Ccs%2F0504082%2Ccs%2F0504073%2Ccs%2F0504049%2Ccs%2F0504096%2Ccs%2F0504051%2Ccs%2F0504056%2Ccs%2F0504026%2Ccs%2F0504070%2Ccs%2F0504069%2Ccs%2F0504036%2Ccs%2F0504038%2Ccs%2F0504105%2Ccs%2F0504011%2Ccs%2F0504003%2Ccs%2F0504086%2Ccs%2F0504014%2Ccs%2F0504037%2Ccs%2F0504059%2Ccs%2F0504021%2Ccs%2F0504031%2Ccs%2F0504061%2Ccs%2F0504028%2Ccs%2F0504010%2Ccs%2F0504103%2Ccs%2F0504048%2Ccs%2F0504057%2Ccs%2F0504060%2Ccs%2F0504094%2Ccs%2F0504062%2Ccs%2F0504006%2Ccs%2F0504050%2Ccs%2F0504001%2Ccs%2F0105001%2Ccs%2F0105035%2Ccs%2F0105026%2Ccs%2F0105016%2Ccs%2F0105036%2Ccs%2F0105021%2Ccs%2F0105004%2Ccs%2F0105010%2Ccs%2F0105007%2Ccs%2F0105029%2Ccs%2F0105030%2Ccs%2F0105037%2Ccs%2F0105012%2Ccs%2F0105025%2Ccs%2F0105014%2Ccs%2F0105002%2Ccs%2F0105019%2Ccs%2F0105017%2Ccs%2F0105034%2Ccs%2F0105009%2Ccs%2F0105003%2Ccs%2F0105018%2Ccs%2F0105015%2Ccs%2F0105031%2Ccs%2F0105008%2Ccs%2F0105028%2Ccs%2F0105023%2Ccs%2F0105024%2Ccs%2F0105006%2Ccs%2F0105020%2Ccs%2F0105011%2Ccs%2F0105032%2Ccs%2F0105027%2Ccs%2F0105013%2Ccs%2F0105022%2Ccs%2F0105033%2Ccs%2F0105005%2Ccs%2F0503035%2Ccs%2F0503059%2Ccs%2F0503034%2Ccs%2F0503009%2Ccs%2F0503051%2Ccs%2F0503027%2Ccs%2F0503088%2Ccs%2F0503011&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Matter of Opinion: Sentiment Analysis and Business Intelligence\n  (position paper)"}, "summary": "A general-audience introduction to the area of \"sentiment analysis\", the\ncomputational treatment of subjective, opinion-oriented language (an example\napplication is determining whether a review is \"thumbs up\" or \"thumbs down\").\nSome challenges, applications to business-intelligence tasks, and potential\nfuture directions are described.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=cs%2F0504045%2Ccs%2F0504054%2Ccs%2F0504009%2Ccs%2F0504101%2Ccs%2F0504042%2Ccs%2F0504078%2Ccs%2F0504072%2Ccs%2F0504109%2Ccs%2F0504077%2Ccs%2F0504066%2Ccs%2F0504002%2Ccs%2F0504022%2Ccs%2F0504100%2Ccs%2F0504023%2Ccs%2F0504107%2Ccs%2F0504018%2Ccs%2F0504108%2Ccs%2F0504040%2Ccs%2F0504106%2Ccs%2F0504047%2Ccs%2F0504081%2Ccs%2F0504102%2Ccs%2F0504020%2Ccs%2F0504007%2Ccs%2F0504082%2Ccs%2F0504073%2Ccs%2F0504049%2Ccs%2F0504096%2Ccs%2F0504051%2Ccs%2F0504056%2Ccs%2F0504026%2Ccs%2F0504070%2Ccs%2F0504069%2Ccs%2F0504036%2Ccs%2F0504038%2Ccs%2F0504105%2Ccs%2F0504011%2Ccs%2F0504003%2Ccs%2F0504086%2Ccs%2F0504014%2Ccs%2F0504037%2Ccs%2F0504059%2Ccs%2F0504021%2Ccs%2F0504031%2Ccs%2F0504061%2Ccs%2F0504028%2Ccs%2F0504010%2Ccs%2F0504103%2Ccs%2F0504048%2Ccs%2F0504057%2Ccs%2F0504060%2Ccs%2F0504094%2Ccs%2F0504062%2Ccs%2F0504006%2Ccs%2F0504050%2Ccs%2F0504001%2Ccs%2F0105001%2Ccs%2F0105035%2Ccs%2F0105026%2Ccs%2F0105016%2Ccs%2F0105036%2Ccs%2F0105021%2Ccs%2F0105004%2Ccs%2F0105010%2Ccs%2F0105007%2Ccs%2F0105029%2Ccs%2F0105030%2Ccs%2F0105037%2Ccs%2F0105012%2Ccs%2F0105025%2Ccs%2F0105014%2Ccs%2F0105002%2Ccs%2F0105019%2Ccs%2F0105017%2Ccs%2F0105034%2Ccs%2F0105009%2Ccs%2F0105003%2Ccs%2F0105018%2Ccs%2F0105015%2Ccs%2F0105031%2Ccs%2F0105008%2Ccs%2F0105028%2Ccs%2F0105023%2Ccs%2F0105024%2Ccs%2F0105006%2Ccs%2F0105020%2Ccs%2F0105011%2Ccs%2F0105032%2Ccs%2F0105027%2Ccs%2F0105013%2Ccs%2F0105022%2Ccs%2F0105033%2Ccs%2F0105005%2Ccs%2F0503035%2Ccs%2F0503059%2Ccs%2F0503034%2Ccs%2F0503009%2Ccs%2F0503051%2Ccs%2F0503027%2Ccs%2F0503088%2Ccs%2F0503011&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A general-audience introduction to the area of \"sentiment analysis\", the\ncomputational treatment of subjective, opinion-oriented language (an example\napplication is determining whether a review is \"thumbs up\" or \"thumbs down\").\nSome challenges, applications to business-intelligence tasks, and potential\nfuture directions are described."}, "authors": ["Lillian Lee"], "author_detail": {"name": "Lillian Lee"}, "author": "Lillian Lee", "arxiv_comment": "2 pages", "links": [{"href": "http://arxiv.org/abs/cs/0504022v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/cs/0504022v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.CL", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.CL", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "I.2.7", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/cs/0504022v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/cs/0504022v1", "journal_reference": "Presented at the IBM Faculty Summit on the Architecture of\n  On-Demand Business, May 2004", "doi": null, "fulltext": "A Matter of Opinion: Sentiment Analysis and Business Intelligence\n(position paper)\nLillian Lee, Cornell University\n\narXiv:cs/0504022v1 [cs.CL] 6 Apr 2005\n\nPresented at the IBM Faculty Summit on the Architecture of On-Demand Business, May 2004\n\nMotivation In the novel Hard Times, Charles Dickens described the fictional \"Coketown\" as\nfollows:\nFact, fact, fact, everywhere in the material aspect of the town; fact, fact, fact, everywhere in the immaterial. The M'Choakumchild school was all fact, and the school of\ndesign was all fact, and the relations between master and man were all fact, and everything was fact between the lying-in hospital and the cemetery, and what you couldn't\nstate in figures, or show to be purchasable in the cheapest market and salable in the\ndearest, was not, and never should be, world without end, Amen.\nIn real-life business intelligence, facts are of course very important, but opinion also plays a crucial\nrole. Consider, for instance, the following scenario. A major computer manufacturer, disappointed\nwith unexpectedly low sales, finds itself confronted with this question:\nWhy aren't consumers buying our laptop?\nWhile concrete data such as the laptop's weight or the price of a competitor's model are obviously\nrelevant, answering this question requires focusing more on people's personal views of such objective characteristics. Moreover, subjective judgments regarding intangible qualities - e.g., \"the\ndesign is tacky\" or \"customer service was condescending\" - or even misperceptions - \"updated\ndevice drivers aren't available\" - must be taken into account as well.\nSentiment-analysis technologies for extracting opinions from unstructured human-authored\ndocuments would be excellent tools for handling many business-intelligence tasks related to the\none just described. Continuing with our example scenario: it would be difficult to try to directly\nsurvey laptop purchasers who haven't bought the company's product. Rather, we could employ a\nsystem that (a) finds reviews or other expressions of opinion on the Web - newsgroups, individual\nblogs, and aggregation sites such as epinions.com are likely to be productive sources - and then\n(b) creates condensed versions of the reviews or a digest of the overall consensus. This would\nsave the analyst from having to read potentially dozens or even hundreds of versions of the same\ncomplaints. Note that Internet sources can vary wildly in form, tenor, and even grammaticality;\nthis fact underscores the need for robust techniques even when only one language (e.g., English) is\nconsidered.\nChallenges in sentiment classification Given the multitude of potential applications, researchers\nhave been devoting more and more attention to sentiment analysis. Much of the current work is\ndevoted to classification problems: determining whether a particular document or portion thereof\nis subjective or not, and/or determining whether the opinion it expresses is positive or negative.\n1\n\n\fAt first blush, this might not appear so hard: one might expect that we need simply look for obvious sentiment-indicating words, such as \"great\". The difficulty lies in the richness of human\nlanguage use. First, there can be an amazingly large number of ways to say the same thing (especially, it seems, when that thing is a negative perception); this complicates the task of finding\na high-coverage set of indicators. Furthermore, the same indicator may admit several different\ninterpretations. Consider, for example, the following sentences:\n• This laptop is a great deal.\n• A great deal of media attention surrounded the release of the new laptop model.\n• If you think this laptop is a great deal, I've got a nice bridge you might be interested in.\nEach of these sentences contains the three words \"a great deal\", but the opinions expressed are,\nrespectively, positive, neutral, and negative. The first two sentences use the same phrase to mean\ndifferent things. The last sentence involves sarcasm, which, along with related rhetorical devices,\nis an intrinsic feature of texts from unrestricted domains such as blogs and newsgroup postings.\nIn general, researchers have adopted one of two approaches to meeting the challenges that\nsentiment analysis presents. Many groups are working to directly improve the selection and interpretation of indicators through the incorporation of linguistic knowledge; given the subtleties of\nnatural language, such efforts will be critical to building operational systems. Others have been\npursuing a different tack: employing learning algorithms that can automatically infer from text\nsamples what indicators are useful. Besides being potentially more cost-effective, more easily\nported to other domains and languages, and more robust to grammatical mistakes, learning-based\nsystems can also discover indicators that humans might neglect. For example, in our own work,\nwe found that the phrase \"still,\" (comma included) is a better indicator of positive sentiment than\n\"good\" - a typical instance of use would be a sentence like \"Still, despite these flaws, I'd go with\nthis laptop\". Nevertheless, it bears repeating that incorporating deep knowledge about language\nwill be absolutely crucial to developing systems capable of high-quality (as opposed to merely\nhigh-throughput) sentiment analysis. Both the linguistic and the learning approach have considerable merits; it seems very safe to say that the community will need to turn towards finding ways to\ncombine their advantages.\nRelated problems, new directions The classification problems discussed above only involve the\ndetermination of sentiment. However, there is growing interest in capturing interactions between\nsubjectivity and subject - we not only need to know what an author's opinion is, but what that\nopinion is about. For example, while in a broad sense a review of a particular laptop is only about\none topic (the laptop itself), it almost surely discusses various specific aspects of the machine. We\nwould ideally like a sentiment-analysis system to reveal whether there are particular features that\nthe review's author disapproves of even if his or her overall impression was positive.\nAnother interesting research direction of potentially great importance is to integrate into sentiment analysis the notion of the status of an opinion holder, perhaps via adaptation of the hubsand-authorities techniques used in Web search or link-analysis methods in reputation systems. For\n\n2\n\n\fexample, we might want to identify bellwethers - thought leaders with enough influence that others explicitly adopt their opinions - or barometers - those whose opinions are generally held\nby the majority of the population of interest. Tracking the views of these two types of people\ncould both streamline and enhance the process of gathering business intelligence to a large degree.\nSurely that sounds like a great deal!\n\n3\n\n\f"}