{"id": "http://arxiv.org/abs/gr-qc/0606100v1", "guidislink": true, "updated": "2006-06-23T00:15:57Z", "updated_parsed": [2006, 6, 23, 0, 15, 57, 4, 174, 0], "published": "2006-06-23T00:15:57Z", "published_parsed": [2006, 6, 23, 0, 15, 57, 4, 174, 0], "title": "A lattice bosonic model as a quantum theory of gravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0606072%2Cgr-qc%2F0606058%2Cgr-qc%2F0606053%2Cgr-qc%2F0606063%2Cgr-qc%2F0606115%2Cgr-qc%2F0606093%2Cgr-qc%2F0606029%2Cgr-qc%2F0606106%2Cgr-qc%2F0606097%2Cgr-qc%2F0606012%2Cgr-qc%2F0606067%2Cgr-qc%2F0606123%2Cgr-qc%2F0606118%2Cgr-qc%2F0606087%2Cgr-qc%2F0606039%2Cgr-qc%2F0606126%2Cgr-qc%2F0606002%2Cgr-qc%2F0606119%2Cgr-qc%2F0606114%2Cgr-qc%2F0606105%2Cgr-qc%2F0606001%2Cgr-qc%2F0606111%2Cgr-qc%2F0606134%2Cgr-qc%2F0606049%2Cgr-qc%2F0606009%2Cgr-qc%2F0606041%2Cgr-qc%2F0606096%2Cgr-qc%2F0606083%2Cgr-qc%2F0606014%2Cgr-qc%2F0606062%2Cgr-qc%2F0606132%2Cgr-qc%2F0606026%2Cgr-qc%2F0606052%2Cgr-qc%2F0606038%2Cgr-qc%2F0606068%2Cgr-qc%2F0606037%2Cgr-qc%2F0606048%2Cgr-qc%2F0606040%2Cgr-qc%2F0606133%2Cgr-qc%2F0606130%2Cgr-qc%2F0606047%2Cgr-qc%2F0606078%2Cgr-qc%2F0606055%2Cgr-qc%2F0606098%2Cgr-qc%2F0606035%2Cgr-qc%2F0606073%2Cgr-qc%2F0606018%2Cgr-qc%2F0606056%2Cgr-qc%2F0606051%2Cgr-qc%2F0606070%2Cgr-qc%2F0606074%2Cgr-qc%2F0606081%2Cgr-qc%2F0606005%2Cgr-qc%2F0606050%2Cgr-qc%2F0606095%2Cgr-qc%2F0606091%2Cgr-qc%2F0606031%2Cgr-qc%2F0606024%2Cgr-qc%2F0606107%2Cgr-qc%2F0606129%2Cgr-qc%2F0606117%2Cgr-qc%2F0606046%2Cgr-qc%2F0606008%2Cgr-qc%2F0606017%2Cgr-qc%2F0606010%2Cgr-qc%2F0606020%2Cgr-qc%2F0606044%2Cgr-qc%2F0606045%2Cgr-qc%2F0606076%2Cgr-qc%2F0606006%2Cgr-qc%2F0606108%2Cgr-qc%2F0606135%2Cgr-qc%2F0606057%2Cgr-qc%2F0606127%2Cgr-qc%2F0606121%2Cgr-qc%2F0606059%2Cgr-qc%2F0606088%2Cgr-qc%2F0606019%2Cgr-qc%2F0606116%2Cgr-qc%2F0606036%2Cgr-qc%2F0606064%2Cgr-qc%2F0606101%2Cgr-qc%2F0606023%2Cgr-qc%2F0606099%2Cgr-qc%2F0606113%2Cgr-qc%2F0606094%2Cgr-qc%2F0606043%2Cgr-qc%2F0606092%2Cgr-qc%2F0606082%2Cgr-qc%2F0606077%2Cgr-qc%2F0606042%2Cgr-qc%2F0606090%2Cgr-qc%2F0606027%2Cgr-qc%2F0606003%2Cgr-qc%2F0606069%2Cgr-qc%2F0606013%2Cgr-qc%2F0606125%2Cgr-qc%2F0606007%2Cgr-qc%2F0606100%2Cgr-qc%2F0606011%2Cgr-qc%2F0606086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A lattice bosonic model as a quantum theory of gravity"}, "summary": "A local quantum bosonic model on a lattice is constructed whose low energy\nexcitations are gravitons described by linearized Einstein action. Thus the\nbosonic model is a quantum theory of gravity, at least at the linear level. We\nfind that the compactification and the discretization of metric tenor are\ncrucial in obtaining a quantum theory of gravity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0606072%2Cgr-qc%2F0606058%2Cgr-qc%2F0606053%2Cgr-qc%2F0606063%2Cgr-qc%2F0606115%2Cgr-qc%2F0606093%2Cgr-qc%2F0606029%2Cgr-qc%2F0606106%2Cgr-qc%2F0606097%2Cgr-qc%2F0606012%2Cgr-qc%2F0606067%2Cgr-qc%2F0606123%2Cgr-qc%2F0606118%2Cgr-qc%2F0606087%2Cgr-qc%2F0606039%2Cgr-qc%2F0606126%2Cgr-qc%2F0606002%2Cgr-qc%2F0606119%2Cgr-qc%2F0606114%2Cgr-qc%2F0606105%2Cgr-qc%2F0606001%2Cgr-qc%2F0606111%2Cgr-qc%2F0606134%2Cgr-qc%2F0606049%2Cgr-qc%2F0606009%2Cgr-qc%2F0606041%2Cgr-qc%2F0606096%2Cgr-qc%2F0606083%2Cgr-qc%2F0606014%2Cgr-qc%2F0606062%2Cgr-qc%2F0606132%2Cgr-qc%2F0606026%2Cgr-qc%2F0606052%2Cgr-qc%2F0606038%2Cgr-qc%2F0606068%2Cgr-qc%2F0606037%2Cgr-qc%2F0606048%2Cgr-qc%2F0606040%2Cgr-qc%2F0606133%2Cgr-qc%2F0606130%2Cgr-qc%2F0606047%2Cgr-qc%2F0606078%2Cgr-qc%2F0606055%2Cgr-qc%2F0606098%2Cgr-qc%2F0606035%2Cgr-qc%2F0606073%2Cgr-qc%2F0606018%2Cgr-qc%2F0606056%2Cgr-qc%2F0606051%2Cgr-qc%2F0606070%2Cgr-qc%2F0606074%2Cgr-qc%2F0606081%2Cgr-qc%2F0606005%2Cgr-qc%2F0606050%2Cgr-qc%2F0606095%2Cgr-qc%2F0606091%2Cgr-qc%2F0606031%2Cgr-qc%2F0606024%2Cgr-qc%2F0606107%2Cgr-qc%2F0606129%2Cgr-qc%2F0606117%2Cgr-qc%2F0606046%2Cgr-qc%2F0606008%2Cgr-qc%2F0606017%2Cgr-qc%2F0606010%2Cgr-qc%2F0606020%2Cgr-qc%2F0606044%2Cgr-qc%2F0606045%2Cgr-qc%2F0606076%2Cgr-qc%2F0606006%2Cgr-qc%2F0606108%2Cgr-qc%2F0606135%2Cgr-qc%2F0606057%2Cgr-qc%2F0606127%2Cgr-qc%2F0606121%2Cgr-qc%2F0606059%2Cgr-qc%2F0606088%2Cgr-qc%2F0606019%2Cgr-qc%2F0606116%2Cgr-qc%2F0606036%2Cgr-qc%2F0606064%2Cgr-qc%2F0606101%2Cgr-qc%2F0606023%2Cgr-qc%2F0606099%2Cgr-qc%2F0606113%2Cgr-qc%2F0606094%2Cgr-qc%2F0606043%2Cgr-qc%2F0606092%2Cgr-qc%2F0606082%2Cgr-qc%2F0606077%2Cgr-qc%2F0606042%2Cgr-qc%2F0606090%2Cgr-qc%2F0606027%2Cgr-qc%2F0606003%2Cgr-qc%2F0606069%2Cgr-qc%2F0606013%2Cgr-qc%2F0606125%2Cgr-qc%2F0606007%2Cgr-qc%2F0606100%2Cgr-qc%2F0606011%2Cgr-qc%2F0606086&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A local quantum bosonic model on a lattice is constructed whose low energy\nexcitations are gravitons described by linearized Einstein action. Thus the\nbosonic model is a quantum theory of gravity, at least at the linear level. We\nfind that the compactification and the discretization of metric tenor are\ncrucial in obtaining a quantum theory of gravity."}, "authors": ["Zheng-Cheng Gu", "Xiao-Gang Wen"], "author_detail": {"name": "Xiao-Gang Wen"}, "author": "Xiao-Gang Wen", "arxiv_comment": "4 pages. RevTeX4. Homepage http://dao.mit.edu/~wen", "links": [{"href": "http://arxiv.org/abs/gr-qc/0606100v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0606100v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0606100v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0606100v1", "journal_reference": null, "doi": null, "fulltext": "A lattice bosonic model as a quantum theory of gravity\nZheng-Cheng Gu† ,†† and Xiao-Gang Wen†\nDepartment of Physics, Massachusetts Institute of Technology, Cambridge, Massachusetts 02139†\nCenter for Advanced Study, Tsinghua University, Beijing, China, 100084††\n(Dated: March 27, 2018)\n\narXiv:gr-qc/0606100v1 23 Jun 2006\n\nA local quantum bosonic model on a lattice is constructed whose low energy excitations are\ngravitons described by linearized Einstein action. Thus the bosonic model is a quantum theory\nof gravity, at least at the linear level. We find that the compactification and the discretization of\nmetric tenor are crucial in obtaining a quantum theory of gravity.\n\nSeven wonders of our universe: Our world has\nmany mysteries and wonders. At the most fundamental\nlevel, there are may be seven deep mysteries and/or wonders in our universe: (1) Identical particles. (2) Gauge\ninteractions.1–3 (3) Fermi statistics.4,5 (4) Tiny masses of\nfermions (∼ 10−20 of the Planck mass).6,7,12 (5) Chiral\nfermions.8,9 (6) Lorentz invariance.10 (7) Gravity.11 Here\nwe would like to question where those wonderful and mysterious properties come from. We wish to have a single\nunified understanding of all of the above mysteries. Or\nmore precisely, we wish that we can start from a single\nmodel to obtain all of the above wonderful properties.\nRecent progresses showed that, starting from a single origin – a local bosonic model (which is also called\nspin model), the first four properties in the above list\nemerge at low energies.12–15 Thus we may say that the\nlocal bosonic model provides a unified origin for identical particles, gauge interactions, Fermi statistics and\nnear masslessness of the fermions. Gauge interaction and\nFermi statistics are unified under this point of view of\nemergence. However, three more mysteries remain to be\nunderstood. In this paper, we will show that it is possible\nto construct a local bosonic model from which gravitons\nemerge. On one hand, such a model can be viewed as\na theory of quantum gravity. It solves a long standing\nproblem of putting quantum mechanics and gravity together. On the other hand, the model provides a design\nof a condensed matter system which has an emergent\nquantum gravity at low energies. This allows us to study\nsome quantum effects of gravity (a simulated one) in a\nlaboratory.\nThe belief that all the wonderful phenomena of our\nuniverse (such as gauge interaction, Fermi statistics, and\ngravitons) emerge from a lowly local bosonic model is\ncalled locality principle.12 Using local bosonic model as\na underlying structure to understand the deep mysteries of our universe represent a departure from the traditional approach of gaining a better understanding by\ndividing things in to smaller parts. In the traditional\napproach, we assume that the division cannot continue\nforever and view everything as made of some simple indivisible building blocks – the elementary particles. However, the traditional approach may represent a wrong direction. For example, phonons behave just like any other\nelementary particles at low energies. But if we look at\nphonons closely, we do not see smaller parts that form a\n\nphonon. We see the atoms that form the entire lattice.\nThe phonons are not formed by those atoms, the phonons\nare simply collective motions of those atoms. This makes\nus to wonder that photons, electrons, gravitons, etc , may\nalso be emergent phenomena just like phonons. They\nmay not be the building blocks of everything. They may\nbe collective motions of a deeper underlying structure.\nThis paper uses a particular emergence approach: we\ntry to obtain everything from a local bosonic model. The\ndetail form of the bosonic model is not important. The\nimportant issue is how the bosons (or the spins) are organized in the ground state. It is shown that if bosons\norganize into a string-net condensed state, then photons,\nelectrons and quarks can emerge naturally as collective\nmotions of the bosons.12–15 In this paper, we will find an\norganization of bosons such that the collective motions\nof bosons lead to gravitons.\nOther emergence approaches were developed in superstring theory16 in last 10 years, as demonstrated by the\nduality relations among various superstring models and\nmatrix models.17 The anti-de Sitter-space/conformalfield-theory duality even shows how space-time and gravity emerge from a gauge theory.18\nThe rule of game: There are many different approaches to quantum gravity20–22 based on different principles. Some approaches, such as loop quantum gravity,23\nstress the gauge structure from the diffeomorphism of\nthe space-time. Other approaches, such as superstring\ntheory,16,17 stress the renormalizability of the theory. In\nthis paper, we follow a different rule of game by stressing\nfiniteness and locality.\nOur rule of game is encoded in the following working\ndefinition of quantum gravity. Quantum gravity is\n(a) a quantum theory.\n(b) Its Hilbert space has a finite dimension.\n(c) Its Hamiltonian is a sum of local operators.\n(d) The gapless helicity ±2 excitations are the only low\nenergy excitations.\n(e) The helicity ±2 excitations have a linear dispersion.\n(f) The gravitons35 can interact in the way consistent\nwith experimental observations.\nThe condition (b) implies that the quantum gravity\nconsidered here has a finite cut-off. So the renormalizability is not an issue here. The condition (c) is a locality\ncondition. It implies two additional things: (1) the total\nHilbert space is a direct product of local Hilbert spaces\n\n\f2\nHtot = ⊗n Hn , (2) the local operators are defined as operators that act within each local Hilbert space Hn or\nfinite products of local operators. The conditions (a –\nc) actually define a local bosonic model. Certainly, any\nquantum spin models satisfy (a – c). It is the conditions\n(d–f) that make the theory to look like gravity.\nThe condition (d) is very important. It is very easy\nto construct a quantum model that contains helicity ±2\ngapless excitations, such as the theory described by the\nfollowing Lagrangian L = 21 ∂0 hij ∂0 hij − 21 ∂k hij ∂k hij .\nSuch a theory is not a theory of gravity since it also\ncontain helicity 0, ±1 gapless excitations.\nSuperstring theory16,17 satisfies the conditions (a), (e)\nand (f), but in general not (d) due to the presence of\ndilatons (massless scaler particles). The superstring theory (or more precisely, the superstring field theory) also\ndoes not satisfy the condition (b) since the cut-off is not\nexplicitly implemented. The spin network24 or the quantum computing25 approach to quantum gravity satisfies\nthe condition (a,b) or (a–c). But the properties (d–f) are\nremain to be shown. The induced gravity from superfluid\n3\nHe discussed in Ref. 26 does not satisfy the condition (d)\ndue to the presence of gapless density mode. In Ref. 27,\nit is proposed that gravitons may emerge as edge excitations of a quantum Hall state in 4 spatial dimensions.\nAgain the condition (d) is not satisfied due to the presence of infinite massless helicity ±1 ,±2, ±3, * * * modes.\nIn Ref. 28, a very interesting bosonic model is constructed which contains gapless helicity 0 and ±2 excitations with quadratic dispersions. The model satisfies\n(a–c), but not (d,e). In this paper, we will fix the two\nproblems and construct a local bosonic model that satisfies the conditions (a – e) and possibly (f). To quadratic\norder, the low energy effective theory of our model is the\nlinearized Einstein gravity. The key step in our approach\nis to discretize and compactify the metric tensor.\nReview of emergence of U (1) gauge theory: Our\nmodel for emergent quantum gravity is closely related\nto the rotor model that produces emergent U (1) gauge\ntheory.19,30 So we will first discuss the emergence of U (1)\ngauge theory to explain the key steps in our argument in\na simpler setting.\nTo describe the rotor model, We introduce an angular\nvariable aij ∼ aij + 2π and the corresponding angular\nmomentum Eij for each link of a cubic lattice. Here i\nlabels the sites of the cubic lattice and aij and Eij satisfy\naij = −aji and Eij = −Eji . The phase space Lagrangian\nfor physical degrees of freedom aij and Eij is given by19\nL=\n\nX\nhiji\n\nX\nJX 2\nUX 2\ncos Bijkl −\nEij + g\nQi\n2\n2\ni\nhijkli\nhiji\nX\n+ ajk + akl + ali , Qi =\nEij\n(1)\n\nEij ȧij −\n\nBijkl = aij\nP\n\nj next to i\n\nP\nsums over all sites, hiji over all links, and\nhijkli over all square faces of the cubic lattice. We note\nthat after quantization, Eij are quantized as integers.\n\nwhere\nP\n\ni\n\nTo obtain the low energy dynamics of the above rotor model, let us assume that the fluctuation of Eij are\nlarge and treat Eij as a continuous quantity. We also\nassume that the fluctuations of aij are small and expand\n(1) to the quadratic order of aij . Then we take the continuum limit by introducing the continuous fields (E i , ai )\nRj\nRj\nand identifying Eij = i dxi E i and aij = i dxi ai . Here\nwe have assumed that the lattice constant a = 1. The\nresulting continuum effective theory is given by\n1\n1\n1\nL = −E i ∂0 ai − J(E i )2 − g(B i )2 − U (∂i E i )2 ,\n2\n2\n2\n\n(2)\n\nwhere B i = ǫijk ∂j ak . We find that the rotor model has\nthree low lying modes. Two of them √are helicity ±1\nmodes with a linear dispersion ωk ∼ gJ|k| and the\nthird mode is the helicity 0 mode with zero frequency\nωk = 0. We know that a U (1) gauge theory only have\ntwo helicity ±1 modes at low energies. Thus the key to\nunderstand the emergence U (1) gauge theory is to understand how the helicity 0 mode obtain an energy gap.\nTo understand why helicity 0 mode is gapped, let us\nconsider the quantum fluctuations of E i and ai . We note\nthat the longitudinal mode and the transverse modes separate. Introduce E i = E|| + E⊥ and ai = a|| + a⊥ , we find\nthat the dynamics of the transverse mode is described\n2\n− g2 ∂i a⊥ ∂i a⊥ . At the lattice\nby L⊥ = a⊥ ∂0 E⊥ − J2 E⊥\nscale δx ∼ 1, the quantum fluctuations\nof E⊥ and a⊥ are\nq\npg\nJ\ngiven by δE⊥ ∼ J and δa⊥ ∼ g . We see that the assumptions that we used to derive the continuum limit are\nvalid when J ≪ g. In this limit we can trust the result\nfrom the continuum effective theory and conclude that\nthe transverse modes (or the helicity ±1 modes) have a\nlinear gapless dispersion.\nThe longitudinal mode is described by (f (x), π(x))\nwith ai = ∂i f and π = ∂i E i . Its dynamics is determined\nby L|| = π∂0 f − J2 π(−∂ −2 )π − 12 U π 2 . At the lattice scale,\nthe quantum fluctuations of π and f are given by δπ = 0\nand δf = ∞. We see that a positive U and J will make\nthe fluctuations of f much bigger than the compactification size 2π and the fluctuations of π much less then\nthe discreteness of E i which is 1. In this limit, the result\nfrom the classical equation of motion cannot be trusted.\nIn fact the weak quantum fluctuations in the discrete\nvariable π and the strong quantum fluctuations in the\ncompact variable f indicate that the corresponding mode\nis gapped after the quantization. Since π has weak fluctuations which is less than the discreteness of π, the ground\nstate is basically given by π = 0. A low lying excitation\nis then given by π = 0 everywhere except in a unit cell\nwhere π = 1. Such an excitation have an energy of order U . The gapping of helicity 0 mode is confirmed by\nmore careful calculations.19 From those calculations, we\nfind that the weak fluctuations of π lead to a constraint\nπ = ∂i E i = 0 and the strong fluctuations of f lead to\na gauge transformation ai → ai + ∂i f . The Lagrangian\n(2) equipped with the above constraint and the gauge\ntransformation becomes the Lagrangian of a U (1) gauge\n\n\f3\ntheory. We will use this kind of argument to argue the\nemergence of gravitons and the linearized Einstein action.\nThe emergence of quantum gravity: First, let us\ndescribe a model that will have emergent gravitons at\nlow energies. The model has six variables θxx (i), θyy (i),\nθzz (i), Lxx (i), Lyy (i), and Lzz (i) on each vertex of a\ncubic lattice. The model also has two variables on each\nsquare face of the cubic lattice. For example, on the\nsquare centered at i+ x2 + y2 , the two variables are θxy (i+\ny\ny\ny\nx\nx\nx\nxy\nyx\n2 + 2 ) = θyx (i + 2 + 2 ) and L (i + 2 + 2 ) = L (i +\ny\nx\n2 + 2 ). The bosonic model is described by the following\nphase space Lagrangian\nX\na b\na b\nL=\nLab (i + + )∂0 θab (i + + )\n2\n2\n2\n2\ni,ab=xy,yz,zx\nX\n+\nLaa (i)∂0 θaa (i) − HU − HJ − Hg\n(3)\n\nSuch an algebra has only one nG dimensional representation. This nG dimensional representation becomes our\nlocal Hilbert space Hi,ab . The total Hilbert space of our\nmodel (3) is given by H = ⊗i,ab Hi,ab after quantization.\nIn other words, there are n3G states on each vertex and\nnG states on each square face of the cubic lattice. Note\nthat the Hamiltonian\nH = HU + HJ + H g\n\n(6)\n\nis a function of the physical operators WLab , Wθab and\ntheir hermitian conjugates. So the quantum model defined through the Hamiltonian (6) and the algebra (5)\nis a bosonic model whose local Hilbert spaces have finite\ndimensions.\nNext, we would like to understand low energy excitations\nof the quantum bosonic model (6) in large nG limit.\ni,a=x,y,z\nWe first assume that the fluctuations of φij ≡ 2πLij /nG\nwhere\nand θij are much bigger then 1/nG (the discreteness of\nX X\nφij and θij ) so that we can treat φij and θij as continHU =nG U1\n{1 − cos[2πQ(i, i + a)/nG ]}\nuous variables. We also assume that the fluctuations of\ni a=x,y,z\nX\nφij and θij are much smaller then 1 so that we can treat\n+nG U2\n{1 − cos[η(i)]}\nφij and θij as small variables. Under those assumptions,\ni\nwe can use semiclassical approach to understand the low\nX\nenergy dynamics of the quantum bosonic model (6).\nHJ =nG J\n{1 − cos[2πLaa (i)/nG ]}\nExpanding the Lagrangian (3) to quadratic order in φij\ni,a=x,y,z\nX\nX\nand θij , we can find the dispersions of collective modes\na b\n+2nG J\n{1 − cos[2πLab (i + + )/nG ]} of the bosonic model. There are total of six collective\n2\n2\ni ab=xy,yz,zx\nmodes. We find four of them have zero frequency for all\nX\nX\n1\nk, and two modes have a linear dispersion relation near\naa\n{1 − cos[2π\nL (i)/nG ]}\n− nG J\nk = (π, π, π). Near k = (π, π, π), the dynamics of the\n2\na=x,y,z\ni\nsix modes are described by the following continuum field\nX\nnG g\ntheory:\nHg =\n{1 − cos[ρaa (i)]}\n4\ni,a=x,y,z\nn\nX\nJ h ij 2 (φii )2 i g\nnG g\nsin[ρab (i)] sin[ρba (i)]}\n(4)\n+\nL = nG φij θ̇ij −\n(φ ) −\n− θij Rij\n4\n2\n2\n2\ni,ab=xy,yz,zx\no\nU\nU1\n2\n(∂i φij )2 −\n(Rii )2\n(7)\n−\nHere ρij (i), η(i) and Q(i, i + x) are defined as ρxx (i) =\n2\n2\nz\nx\nz\nx\nθzx (i + y + 2 + 2 ) + θzx (i + 2 + 2 ) − θxy (i + z +\ny\ny\nx\nx\nρxy (i) = −θyz (i + z2 +\nwhere Rij = ǫimk ǫjln ∂m ∂l θnk and we define the contin2 + 2 ) − θxy (i +y 2 + 2 ),\ny\nz\nx\n)\n−\nθ\n(i\n+\n−\n)\n+\n2θ\n(i\n+\nz)\n+\n2θ\n(i),\nρ\n(i)\n=\nuum field θab (x) as −(−1)i 21 θab (i + a2 + 2b ) for a 6= b and\nyz\nyy\nyy\nz\n2\n2\n2\ny\ny\nz\nz\n−2θzz (i + P\ny) − 2θzz (i)\n+\nθ\n(i\n+\n+\n)\n+\nθ\n(i\n+\n−\n),\nyz\nyz\nas (−1)i θab (i) for a = b. The helicity\n±2 modes have\n2\n2\n2\n2\nP\n√\n[θ\n(i\n+\na)\n+\nθ\n(i\n−\na)\n+\nη(i) =\nbb\nbb\na\nlinear\ndispersion\nrelation\nω\n∼\ngJ|k|.\nWe find that\na=x,y,z\nb=x,y,z\nk\nP\n2θbb (i)] − a=x,y,z [θaa (i + a) + θaa (i − a) + 2θaa (i)] −\nfor large nG , the quantum fluctuations\nof the helicity ±2\np\nP\na\nb\na\nb\nmodes is of order δφij , δθij ∼ 1/nG (assuming U1,2 , J\nab=xy,yz,zx [θab (i + 2 + 2 ) + θab (i − 2 + 2 ) + θab (i +\nand\ng are of the same order). So the fluctuations of φij\na\nb\na\nb\nxx\n2 − 2 ) + θab (i − 2 − 2 )], and Q(i, i + x) = L (i + x) +\nand θij satisfy 1/nG ≪ δφij , δθij ≪ 1 and the semiclassiLxx (i) + Lyx (i + x2 + y2 ) + Lyx (i + x2 − y2 ) + Lzx (i + x2 +\ncal approximation is valid√for the helicity ±2 modes. In\nz\nx\nz\nzx\n2 ) + L (i + 2 − 2 ). Other components are obtained by\nthis\ncase, the result ωk ∼ gJ|k| can be trusted.\ncycling xyz to yzx and zxy.\nThe\nhelicity ±1 modes and one of the helicity 0 mode\nab\nNote that both θab and its canonical conjugate L are\nare\ndescribed\nby θij = ∂i θj + ∂j θi and φi = ∂j φji . Their\nab\nab\ncompactified: θab ∼ θab + 2π, L ∼ L + nG . Hence\nfrequency ωk = 0. For such modes, the Hamiltonian\nafter quantization they are both discretized and nG is\nonly contains φi . Thus the quantum fluctuations satisab\nan integer. Due to the compactification, only WL =\nab\nfies δφi ≪ 1/nG and δθi ≫ 1. So the semiclassical ape2π i L /nG , Wθab = e i θab and their products are physical\nproximation is not valid and the result ωk = 0 cannot be\noperators. For a fix ab and i, WLab (i) and Wθab (i) satisfy\ntrusted. Using the similar argument used in emergence\nthe algebra\nof U (1) gauge bosons, we conclude that those modes are\ngapped. The strong fluctuations δθij = ∂i θj + ∂j θi ≫ 1\n(5)\nWLab (i)Wθab (i) = e2π i /nG Wθab (i)WLab (i)\n\n\f4\nand the weak fluctuations φi ≪ 1/nG lead to gauge transformations and the constraints\nθij → θij + ∂i θj + ∂j θi ,\n\n∂j φji = 0\n\n(8)\n\nThe second helicity 0 mode is described by φij =\n(δij ∂ 2 − ∂i ∂j )φ and θ = (δij ∂ 2 − ∂i ∂j )θij . Its frequency is\nagain ωk = 0. The Hamiltonian for such a mode contains\nonly θ. So the quantum fluctuations satisfies δφ ≫ 1 and\nδθ ≪ 1/nG . The second helicity 0 mode is also gapped.\nThe strong fluctuations δφij = (δij ∂ 2 − ∂i ∂j )φ ≫ 1 and\nthe weak fluctuations θ = (δij ∂ 2 − ∂i ∂j )θij ≪ 1/nG lead\nto a gauge transformation and a constraint\nφij → φij + (δij ∂ 2 − ∂i ∂j )φ,\n\n(δij ∂ 2 − ∂i ∂j )θij = 0 (9)\n\nThe Lagrangian (7) equipped with the gauge transformations and the constraints (8,9) is nothing but the\nlinearized Einstein Lagrangian of gravity, where θij ∼\ngij − δij represents the fluctuations of the metric tenor\ngij around the flat space. So the linearized Einstein gravity emerge from the quantum model (6) in the large nG\nlimit. The local bosonic model (6) can be viewed as a\nquantum theory of gravity.\nWe have seen that the gapping of the helicity 0 mode in\nthe rotor model (1) leads to an emergence of U (1) gauge\nstructure at low energies. The emergence of a gauge\nstructure also represents a new kind of order – quantum\norder12,31 – in the ground state. In Ref. 32, it was shown\nthat the emergent U (1) gauge invariance, and hence the\nquantum order, is robust against any local perturbations\nof the rotor model. Thus the gaplessness of the emergent photon is protected by the quantum order.33 Similarly, the gapping of the two helicity 0 modes and the\n\n1\n2\n3\n4\n5\n6\n\n7\n8\n9\n10\n11\n12\n13\n\n14\n15\n16\n\n17\n\n18\n19\n\nH. Weyl, Space, Time, Matter (Dover, 1952).\nW. Pauli, Rev. Mod. Phys. 13, 203 (1941).\nC. N. Yang and R. L. Mills, Phys. Rev. 96, 191 (1954).\nE. Fermi, Z. Phys. 36, 902 (1926).\nP. A. M. Dirac, Proc. Roy. Soc. A112, 661 (1926).\nD. J. Gross and F. Wilczek, Phys. Rev. Lett. 30, 1343\n(1973).\nH. D. Politzer, Phys. Rev. Lett. 30, 1346 (1973).\nT. Lee and C. Yang, Phys. Rev. 104, 254 (1956).\nC. Wu et al., Phys. Rev. 105, 1413 (1957).\nA. Einstein, Annalen der Physik 17, 891 (1905).\nA. Einstein, Annalen der Physik 49, 769 (1916).\nX.-G. Wen, Phys. Rev. D 68, 065003 (2003).\nM. A. Levin and X.-G. Wen, Rev. Mod. Phys. 77, 871\n(2005).\nM. Levin and X.-G. Wen, hep-th/0507118.\nX.-G. Wen, cond-mat/0508020.\nM. B. Green, J. H. Schwarz, and E. Witten, Superstring\nTheory (Cambridge University Press, 1988).\nJ. Polchinski, String Theory (Cambridge University Press,\n1998).\nO. Aharony etal, Phys. Rept. 323, 183 (2000).\nX.-G. Wen, Quantum Field Theory of Many-Body Systems\n\nhelicity ±1 modes in the bosonic model (6) leads to an\nemergent gauge invariance of the linearized coordinate\ntransformation. This indicates that the ground state of\nthe bosonic model contains a new kind of quantum order\nthat is different from those associated with emergent ordinary gauge invariances of internal degrees of freedom.\nWe expect such an emergent linearized diffeomorphism\ninvariance to be robust against any local perturbation of\nthe bosonic model. Thus the gaplessness of the emergent\ngravitons is protected by the quantum order.\nThe emergent gravitons in the model (3) naturally interact but the interaction may be different from that described by the higher order non-linear terms in Einstein\ngravity. However, those higher order terms are irrelevant\nat low energies. Thus it may be possible to generate\nthose higher order terms by fine tuning the lattice model\n(3), such as modifying the Hamiltonian (HJ and Hg ),\nthe constraints (HU ), as well as the Berry's phase term\nin (3). So it may be possible that local bosonic models\ncan generate proper non-linear terms to satisfy (f).29\nOur result appears to contradict with the WeinbergWitten theorem34 which states that in all theories with\na Lorentz-covariant energy-momentum tensor, composite as well as elementary massless particles with helicity\nh > 1 are forbidden. However, the energy-momentum\ntensor in our model is not invariant under the linearized\ndiffeomorphism (although the action is invariant). This\nmay be the reason why emergent gravitons are possible\nin our model.\nWe would like to thank J. Polchinski and E. Witten for\ntheir very helpful comments. This research is supported\nby NSF grant No. DMR-0433632 and ARO grant No.\nW911NF-05-1-0474.\n\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n\n31\n32\n\n33\n34\n35\n\n– From the Origin of Sound to an Origin of Light and\nElectrons (Oxford Univ. Press, Oxford, 2004).\nT. Thiemann, gr-qc/0210094.\nS. Carlip, Rept. Prog. Phys. 64, 885 (2001).\nP. Peldan, Class. Quant. Grav. 11, 1087 (1994).\nL. Smolin, hep-th/0408048.\nC. Rovelli and L. Smolin, Phys.Rev. D52, 5743 (1995).\nL. Smolin, hep-th/0507235.\nG. Volovik, J. Low. Temp. Phys. 113, 667 (1998).\nS.-C. Zhang and J. Hu, Science 294, 823 (2001).\nC. Xu, cond-mat/0602443.\nZ.-C. Gu and X.-G. Wen, to appear.\nO. I. Motrunich and T. Senthil, Phys. Rev. Lett. 89,\n277004 (2002).\nX.-G. Wen, Phys. Rev. B 65, 165113 (2002).\nM. B. Hastings and X.-G. Wen, Phys. Rev B 72, 045141\n(2005).\nX.-G. Wen, Phys. Rev. Lett. 88, 11602 (2002).\nS. Weinberg and E. Witten, Phys. Lett. B 96, 59 (1980).\nIn this paper, we define gravitons as linearly dispersing\ngapless helicity ±2 excitations.\n\n\f"}