{"id": "http://arxiv.org/abs/gr-qc/0404104v1", "guidislink": true, "updated": "2004-04-26T02:45:10Z", "updated_parsed": [2004, 4, 26, 2, 45, 10, 0, 117, 0], "published": "2004-04-26T02:45:10Z", "published_parsed": [2004, 4, 26, 2, 45, 10, 0, 117, 0], "title": "Can the galactic rotation curves be explained in brane world models?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0404060%2Cgr-qc%2F0404106%2Cgr-qc%2F0404104%2Cgr-qc%2F0404075%2Cgr-qc%2F0404065%2Cgr-qc%2F0404015%2Cgr-qc%2F0404078%2Cgr-qc%2F0404095%2Cgr-qc%2F0404011%2Cgr-qc%2F0404103%2Cgr-qc%2F0404115%2Cgr-qc%2F0404008%2Cgr-qc%2F0404123%2Cgr-qc%2F0404027%2Cgr-qc%2F0404059%2Cgr-qc%2F0404013%2Cgr-qc%2F0404017%2Cgr-qc%2F0404052%2Cgr-qc%2F0404073%2Cgr-qc%2F0404035%2Cgr-qc%2F0404032%2Cgr-qc%2F0404046%2Cgr-qc%2F0404094%2Cgr-qc%2F0404044%2Cgr-qc%2F0404003%2Cgr-qc%2F0404064%2Cgr-qc%2F0404125%2Cgr-qc%2F0404034%2Cgr-qc%2F0404099%2Cgr-qc%2F0404001%2Cgr-qc%2F0404070%2Cgr-qc%2F0404114%2Cgr-qc%2F0404117%2Cgr-qc%2F0404018%2Cgr-qc%2F0404022%2Cgr-qc%2F0404026%2Cgr-qc%2F0404105%2Cgr-qc%2F0404051%2Cgr-qc%2F0404016%2Cgr-qc%2F0404012%2Cgr-qc%2F0404077%2Cgr-qc%2F0404109%2Cgr-qc%2F0404010%2Cgr-qc%2F0404085%2Cgr-qc%2F0404097%2Cgr-qc%2F0404054%2Cgr-qc%2F0404092%2Cgr-qc%2F0404047%2Cgr-qc%2F0404038%2Cgr-qc%2F0404082%2Cgr-qc%2F0404107%2Cgr-qc%2F0404110%2Cgr-qc%2F0404098%2Cgr-qc%2F0404118%2Cgr-qc%2F0404041%2Cgr-qc%2F0404100%2Cgr-qc%2F0404112%2Cgr-qc%2F0404087%2Cgr-qc%2F0404037%2Cgr-qc%2F0404091%2Cgr-qc%2F0404053%2Cgr-qc%2F0404066%2Cgr-qc%2F0404063%2Cgr-qc%2F0404129%2Cgr-qc%2F0404050%2Cgr-qc%2F0404023%2Cgr-qc%2F0404072%2Cgr-qc%2F0404071%2Cgr-qc%2F0404024%2Cgr-qc%2F0404033%2Cgr-qc%2F0404113%2Cgr-qc%2F0404079%2Cgr-qc%2F0404028%2Cgr-qc%2F0404048%2Cgr-qc%2F0404086%2Cgr-qc%2F0404081%2Cgr-qc%2F0404036%2Cgr-qc%2F0404116%2Cgr-qc%2F0404090%2Cgr-qc%2F0404069%2Cgr-qc%2F0404005%2Cgr-qc%2F0404021%2Cgr-qc%2F0404045%2Cgr-qc%2F0404042%2Cgr-qc%2F0404061%2Cgr-qc%2F0404080%2Cgr-qc%2F0404031%2Cgr-qc%2F0404043%2Chep-ph%2F0303162%2Chep-ph%2F0303044%2Chep-ph%2F0303121%2Chep-ph%2F0303156%2Chep-ph%2F0303226%2Chep-ph%2F0303103%2Chep-ph%2F0303170%2Chep-ph%2F0303246%2Chep-ph%2F0303081%2Chep-ph%2F0303161%2Chep-ph%2F0303107%2Chep-ph%2F0303207%2Chep-ph%2F0303033&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Can the galactic rotation curves be explained in brane world models?"}, "summary": "We consider solutions with conformal symmetry of the static, spherically\nsymmetric gravitational field equations in the vacuum in the brane world\nscenario. By assuming that the vector field generating the symmetry is\nnon-static, the general solution of the field equations on the brane can be\nobtained in an exact parametric form, with the conformal factor taken as\nparameter. As a physical application of the obtained solutions we consider the\nbehavior of the angular velocity of a test particle moving in a stable circular\norbit. In this case the tangential velocity can be expressed as a function of\nthe conformal factor and some integration constants only. For a specific range\nof the integration constants, the tangential velocity of the test particle\ntends, in the limit of large radial distances, to a constant value. This\nbehavior is specific to the galactic rotation curves, and is explained usually\nby invoking the hypothesis of the dark matter. The limiting value of the\nangular velocity of the test particle can be obtained as a function of the\nbaryonic mass and radius of the galaxy. The behavior of the dark radiation and\ndark pressure terms is also considered in detail, and it is shown that they can\nbe expressed in terms of the rotational velocity of a test particle. Hence all\nthe predictions of the present model can be tested observationally. Therefore\nthe existence of the non-local effects, generated by the free gravitational\nfield of the bulk in a conformally symmetric brane, may provide an explanation\nfor the dynamics of the neutral hydrogen clouds at large distances from the\ngalactic center.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0404060%2Cgr-qc%2F0404106%2Cgr-qc%2F0404104%2Cgr-qc%2F0404075%2Cgr-qc%2F0404065%2Cgr-qc%2F0404015%2Cgr-qc%2F0404078%2Cgr-qc%2F0404095%2Cgr-qc%2F0404011%2Cgr-qc%2F0404103%2Cgr-qc%2F0404115%2Cgr-qc%2F0404008%2Cgr-qc%2F0404123%2Cgr-qc%2F0404027%2Cgr-qc%2F0404059%2Cgr-qc%2F0404013%2Cgr-qc%2F0404017%2Cgr-qc%2F0404052%2Cgr-qc%2F0404073%2Cgr-qc%2F0404035%2Cgr-qc%2F0404032%2Cgr-qc%2F0404046%2Cgr-qc%2F0404094%2Cgr-qc%2F0404044%2Cgr-qc%2F0404003%2Cgr-qc%2F0404064%2Cgr-qc%2F0404125%2Cgr-qc%2F0404034%2Cgr-qc%2F0404099%2Cgr-qc%2F0404001%2Cgr-qc%2F0404070%2Cgr-qc%2F0404114%2Cgr-qc%2F0404117%2Cgr-qc%2F0404018%2Cgr-qc%2F0404022%2Cgr-qc%2F0404026%2Cgr-qc%2F0404105%2Cgr-qc%2F0404051%2Cgr-qc%2F0404016%2Cgr-qc%2F0404012%2Cgr-qc%2F0404077%2Cgr-qc%2F0404109%2Cgr-qc%2F0404010%2Cgr-qc%2F0404085%2Cgr-qc%2F0404097%2Cgr-qc%2F0404054%2Cgr-qc%2F0404092%2Cgr-qc%2F0404047%2Cgr-qc%2F0404038%2Cgr-qc%2F0404082%2Cgr-qc%2F0404107%2Cgr-qc%2F0404110%2Cgr-qc%2F0404098%2Cgr-qc%2F0404118%2Cgr-qc%2F0404041%2Cgr-qc%2F0404100%2Cgr-qc%2F0404112%2Cgr-qc%2F0404087%2Cgr-qc%2F0404037%2Cgr-qc%2F0404091%2Cgr-qc%2F0404053%2Cgr-qc%2F0404066%2Cgr-qc%2F0404063%2Cgr-qc%2F0404129%2Cgr-qc%2F0404050%2Cgr-qc%2F0404023%2Cgr-qc%2F0404072%2Cgr-qc%2F0404071%2Cgr-qc%2F0404024%2Cgr-qc%2F0404033%2Cgr-qc%2F0404113%2Cgr-qc%2F0404079%2Cgr-qc%2F0404028%2Cgr-qc%2F0404048%2Cgr-qc%2F0404086%2Cgr-qc%2F0404081%2Cgr-qc%2F0404036%2Cgr-qc%2F0404116%2Cgr-qc%2F0404090%2Cgr-qc%2F0404069%2Cgr-qc%2F0404005%2Cgr-qc%2F0404021%2Cgr-qc%2F0404045%2Cgr-qc%2F0404042%2Cgr-qc%2F0404061%2Cgr-qc%2F0404080%2Cgr-qc%2F0404031%2Cgr-qc%2F0404043%2Chep-ph%2F0303162%2Chep-ph%2F0303044%2Chep-ph%2F0303121%2Chep-ph%2F0303156%2Chep-ph%2F0303226%2Chep-ph%2F0303103%2Chep-ph%2F0303170%2Chep-ph%2F0303246%2Chep-ph%2F0303081%2Chep-ph%2F0303161%2Chep-ph%2F0303107%2Chep-ph%2F0303207%2Chep-ph%2F0303033&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider solutions with conformal symmetry of the static, spherically\nsymmetric gravitational field equations in the vacuum in the brane world\nscenario. By assuming that the vector field generating the symmetry is\nnon-static, the general solution of the field equations on the brane can be\nobtained in an exact parametric form, with the conformal factor taken as\nparameter. As a physical application of the obtained solutions we consider the\nbehavior of the angular velocity of a test particle moving in a stable circular\norbit. In this case the tangential velocity can be expressed as a function of\nthe conformal factor and some integration constants only. For a specific range\nof the integration constants, the tangential velocity of the test particle\ntends, in the limit of large radial distances, to a constant value. This\nbehavior is specific to the galactic rotation curves, and is explained usually\nby invoking the hypothesis of the dark matter. The limiting value of the\nangular velocity of the test particle can be obtained as a function of the\nbaryonic mass and radius of the galaxy. The behavior of the dark radiation and\ndark pressure terms is also considered in detail, and it is shown that they can\nbe expressed in terms of the rotational velocity of a test particle. Hence all\nthe predictions of the present model can be tested observationally. Therefore\nthe existence of the non-local effects, generated by the free gravitational\nfield of the bulk in a conformally symmetric brane, may provide an explanation\nfor the dynamics of the neutral hydrogen clouds at large distances from the\ngalactic center."}, "authors": ["M. K. Mak", "T. Harko"], "author_detail": {"name": "T. Harko"}, "author": "T. Harko", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.70.024010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0404104v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0404104v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 5 figures, accepted for publication in PRD", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0404104v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0404104v1", "journal_reference": "Phys.Rev.D70:024010,2004", "doi": "10.1103/PhysRevD.70.024010", "fulltext": "gr-qc/0404104\n\nCan the galactic rotation curves be explained in brane world models?\nM. K. Mak∗\nDepartment of Physics, The University of Hong Kong, Pokfulam Road, Hong Kong\n\nT. Harko†\n\narXiv:gr-qc/0404104v1 26 Apr 2004\n\nDepartment of Physics, The University of Hong Kong, Pokfulam Road, Hong Kong\n(Dated: April 26, 2004)\nWe consider solutions with conformal symmetry of the static, spherically symmetric gravitational\nfield equations in the vacuum in the brane world scenario. By assuming that the vector field\ngenerating the symmetry is non-static, the general solution of the field equations on the brane can\nbe obtained in an exact parametric form, with the conformal factor taken as parameter. As a\nphysical application of the obtained solutions we consider the behavior of the angular velocity of a\ntest particle moving in a stable circular orbit. In this case the tangential velocity can be expressed\nas a function of the conformal factor and some integration constants only. For a specific range of\nthe integration constants, the tangential velocity of the test particle tends, in the limit of large\nradial distances, to a constant value. This behavior is specific to the galactic rotation curves, and is\nexplained usually by invoking the hypothesis of the dark matter. The limiting value of the angular\nvelocity of the test particle can be obtained as a function of the baryonic mass and radius of the\ngalaxy. The behavior of the dark radiation and dark pressure terms is also considered in detail, and\nit is shown that they can be expressed in terms of the rotational velocity of a test particle. Hence\nall the predictions of the present model can be tested observationally. Therefore the existence of the\nnon-local effects, generated by the free gravitational field of the bulk in a conformally symmetric\nbrane, may provide an explanation for the dynamics of the neutral hydrogen clouds at large distances\nfrom the galactic center.\nPACS numbers: 04.50.+h, 04.20.Jb, 04.20.Cv, 95.35.+d\n\nI.\n\nINTRODUCTION\n\nEinstein's theory of general relativity, and some of its generalizations, proved to be in excellent agreement with\nthe observational or experimental results in the solar system, binary star systems or laboratory [1]. However, it\nhas long been known that Newtonian or general relativistic mechanics applied to the visible matter in galaxies and\nclusters does not correctly describe the dynamics of those systems. The rotation curves of spiral galaxies [2] are one\nof the best evidences showing the problems Newtonian mechanics and/or standard general relativity has to face on\nthe galactic/intergalactic scale. In these galaxies neutral hydrogen clouds are observed at large distances from the\ncenter, much beyond the extent of the luminous matter. Assuming a non-relativistic Doppler effect and emission from\nstable circular orbits in a Newtonian gravitational field, the frequency shifts in the 21 cm line hydrogen emission lines\nallows the measurement of the velocity of the clouds. Since the clouds move in circular orbits with velocity vtg (r),\n2\n/r and the gravitational attraction\nthe orbits are maintained by the balance between the centrifugal acceleration vtg\n2\nforce GM (r)/r of the total mass M (r) contained within the orbit. This allows the expression of the mass profile of\n2\nthe galaxy in the form M (r) = rvtg\n/G.\nObservations show that the rotational velocities increase near the center of the galaxy and then remain nearly\n2\nconstant at a value of vtg∞ ∼ 200 km/s [2]. This leads to a mass profile M (r) = rvtg∞\n/G. Consequently, the\nmass within a distance r from the center of the galaxy increases linearly with r, even at large distances where very\nlittle luminous matter can be detected. This behavior of the galactic rotation curves is explained by postulating the\nexistence of some dark (invisible) matter, distributed in a spherical halo around the galaxies. The dark matter is\nassumed to be a cold, pressureless medium. There are many possible candidates for dark matter, the most popular\nones being the weekly interacting massive particles (WIMP). Their interaction cross section with normal baryonic\nmatter, while extremely small, are expected to be non-zero and we may expect to detect them directly. It has also\nbeen suggested that the dark matter in the Universe might be composed of superheavy particles, with mass ≥ 1010\n\n∗ Electronic\n† Electronic\n\naddress: mkmak@vtc.edu.hk\naddress: harko@hkucc.hku.hk\n\n\f2\nGeV. But observational results show the dark matter can be composed of superheavy particles only if these interact\nweakly with normal matter or if their mass is above 1015 GeV [3].\nFrom a general relativistic point of view the space-time geometries associated with dark matter halos were considered\nin [4], where several properties of this space-time and the characteristics of the possible energy-momentum tensors\nwhich could produce such geometries have been discussed. The form of the galactic potentials can be obtained, within\na general relativistic framework, from the observed rotation curves, without specific reference to any metric theory of\ngravity. Given the potential, the gravitational mass can be determined by way of an anisotropy function of the static,\nspherically symmetric gravitational galactic field [5]. The possibility that dark matter has a substantial amounts of\npressure, comparable in magnitude to the energy density has been investigated in [6]. Galaxy halos models, consistent\nwith observations of flat rotation curves, are possible for a variety of equations of state with anisotropic pressures.\nHowever, despite more than 20 years of intense experimental and observational effort, up to now no non-gravitational\nevidence for dark matter has ever been found: no direct evidence of it and no annihilation radiation from it. Moreover,\naccelerator and reactor experiments do not support the physics (beyond the standard model) on which the dark matter\nhypothesis is based.\nTherefore, it seems that the possibility that Einstein's (and the Newtonian) gravity breaks down at the scale\nof galaxies cannot be excluded a priori. Several theoretical models, based on a modification of Newton's law or of\ngeneral relativity, have been proposed to explain the behavior of the galactic rotation curves. A modified gravitational\npotential of the form φ = −GM [1 + α exp (−r/r0 )] / (1 + α) r, with α = −0.9 and r0 ≈ 30 kpc can explain flat\nrotational curves for most of the galaxies [7].\nIn an other model, called MOND, and proposed by Milgrom [8], the Poisson equation for the gravitational potential\n∇2 φ = 4πGρ is replaced by an equation of the form ∇ [μ (x) (|∇φ| /a0 )] = 4πGρ, where a0 is a fixed constant and\nμ (x) a function satisfying the conditions μ (x) = x for x << 1 and μ (x) = 1 for x >> 1. The force law, giving\n√\nthe acceleration a of a test particle becomes a = aN for aN >> a0 and a = aN a0 for aN << a0 ,where aN is the\nusual Newtonian acceleration. The rotation curves of the galaxies are predicted to be flat, and they can be calculated\nonce the distribution of the baryonic matter is known. Alternative theoretical models to explain the galactic rotation\ncurves have been elaborated recently by Mannheim [9] and Moffat and Sokolov [10].\nA general analysis of the possibility of an alternative gravity theory explaining the dynamics of galactic systems\nwithout dark matter was performed by Zhytnikov and Nester [11]. From very general assumptions about the structure\nof a relativistic gravity theory (the theory is metric, and invariant under general coordinates transformation, has a\ngood linear approximation, it does not possess any unusual gauge freedom and it is not a higher derivative gravity)\na general expression for the metric to order (v/c)2 has been derived. This allows to compare the predictions of the\ntheory with various experimental data: the Newtonian limit, light deflection and retardation, rotation of galaxies and\ngravitational lensing. The general conclusion of this study is that the possibility for any gravity theory to explain the\nbehavior of galaxies without dark matter is rather improbable.\nThe idea that our four-dimensional Universe might be a four-dimensional space-time, embedded in a higher dimensional space-time, had been proposed and studied, from both mathematical and physical points of view, for a long\ntime (for a full account of the existing results on the subject and on the early references see [12]). The embedding\napproach to gravity has its origins in the book by Eisenhart [13]. The mathematical problems of the embeddings in\nhigher dimensional space-times, with applications to general relativity have been discussed in detail as early as 1965\n[14]. By using a more physical approach Akama [15] and Rubakov and Shaposhnikov [16] have suggested that we may\nlive on a domain wall in a higher dimensional space. Earlier references to these topics can also be found in Bandos\nand Kummer [17]. In this paper a generalization of the embedding approach for d-dimensional gravity based upon\np-brane theories is considered.\nRecently, due to the proposal by Randall and Sundrum [18] that our four-dimensional space-time is a threebrane, embedded in a five-dimensional space-time (the bulk), the idea of the embedding of our Universe in a higher\ndimensional space had attracted again a considerable interest. According to the brane-world scenario, the physical\nfields (electromagnetic, Yang-Mills etc.) in our four-dimensional Universe are confined to the three brane. These fields\nare assumed to arise as fluctuations of branes in string theories. Only gravity can freely propagate in both the brane\nand bulk space-times, with the gravitational self-couplings not significantly modified. This model originated from the\nstudy of a single 3-brane embedded in five dimensions, with the 5D metric given by ds2 = e−f (y) ημν dxμ dxν + dy 2 ,\nwhich, due to the appearance of the warp factor, could produce a large hierarchy between the scale of particle physics\nand gravity. Even if the fifth dimension is uncompactified, standard 4D gravity is reproduced on the brane. Hence\nthis model allows the presence of large, or even infinite non-compact extra dimensions. Our brane is identified to a\ndomain wall in a 5-dimensional anti-de Sitter space-time. For a review of dynamics and geometry of brane Universes\nsee [19].\nDue to the correction terms coming from the extra dimensions, significant deviations from the Einstein theory occur\nin brane world models at very high energies [20]. Gravity is largely modified at the electro-weak scale 1 TeV. The\ncosmological implications of the brane world theories have been extensively investigated in the physical literature [21].\n\n\f3\nGravitational collapse can also produce high energies, with the five dimensional effects playing an important role in\nthe formation of black holes [22].\nFor standard general relativistic spherical compact objects the exterior space-time is described by the Schwarzschild\nmetric. In the five dimensional brane world models, the high energy corrections to the energy density, together with\nthe Weyl stresses from bulk gravitons, imply that on the brane the exterior metric of a static star is no longer the\nSchwarzschild metric [23]. The presence of the Weyl stresses also means that the matching conditions do not have a\nunique solution on the brane; the knowledge of the five-dimensional Weyl tensor is needed as a minimum condition for\nuniqueness. Static, spherically symmetric exterior vacuum solutions of the brane world models have been proposed\nfirst by Dadhich et al. [23] and Germani and Maartens [24]. The solution obtained in [23] has the mathematical form\nof the Reissner-Nordstrom solution, in which a tidal Weyl parameter plays the role of the electric charge of the general\nrelativistic solution. A second exterior solution, which also matches a constant density interior, has been derived in\n[24]. Other classes of exact or approximate (using the multipole (1/r) expansion) solutions of vacuum field equations\non the brane have been obtained in [25].\nThe vacuum field equations on the brane have been reduced to a system of two ordinary differential equations,\nwhich describe all the geometric properties of the vacuum as functions of the dark pressure and dark radiation terms\n(the projections of the Weyl curvature of the bulk, generating non-local brane stresses) in [26]. Several classes of exact\nsolutions of the vacuum gravitational field equations on the brane have been derived, and vacuums with particular\nsymmetries have been investigated by using Lie group techniques. A homology theorem for the static, spherically\nsymmetric gravitational field equations in the vacuum on the brane has also been proven.\nIt is the purpose of the present paper to extend the approach initiated in [26] by considering vacuum space-times\non the brane that are related to some more general Lie groups of transformations, and to investigate their possible\nphysical relevance for the explanation of the dynamics of galaxies. As a group of admissible transformations we chose\nthe one-parameter group of conformal motions. More exactly, we consider spherically symmetric and static solutions\nof the gravitational field equations for which the metric tensor gμν has the property Lξ gμν = ψ (r) gμν , where the\nleft-hand side is the Lie derivative of the metric tensor, describing the gravitational field in vacuum on the brane, with\nrespect to the vector field ξ μ , and ψ, the conformal factor, is an arbitrary function of the radial coordinate r. As for the\nvector field ξ μ we assume that it is non-static. With these assumptions the gravitational field equations, describing the\nstatic vacuum brane, can be integrated in Schwarzschild coordinates, and an exact solution, corresponding to a brane\nadmitting a one-parameter group of motions can be obtained. The general solution of the field equations depends on\nthree arbitrary integration constants. The conformal symmetry also uniquely fixes the mathematical form of the dark\nradiation and dark pressure terms, respectively, which describe the non-local effects induced by the gravitational field\nof the bulk.\nAs a physical application of the conformally symmetric vacuum brane model we consider the behavior of the angular\nvelocity of a test particle moving in a stable circular orbit. It turns out that for this case the tangential velocity can be\nexpressed as a function of the conformal factor ψ and some constants of integration only, the velocity being inversely\nproportional to the conformal factor ψ. For a specific range of the integration constants the tangential velocity of the\ntest particle tends, in the limit of large radial distances, to a constant value. This behavior is specific to the galactic\nrotation curves, and is explained usually by invoking the hypothesis of the dark matter. However, in the present\napproach the constant velocity in the large r limit of a test particle moving in the gravitational field of a galaxy\nis due to the existence of the non-local effects from the bulk, transmitted via the non-zero components of the bulk\nWeyl tensor, and of the conformally symmetric geometrical structure of the static gravitational field on the brane.\nThe existence of the dark radiation term generates an equivalent mass term, which is linearly increasing with the\ndistance, and is proportional to the baryonic mass of the galaxy. All the relevant physical parameters (metric tensor\ncomponents, dark radiation and dark pressure) can be obtained as functions of the tangential velocity, and hence they\ncan be determined observationally.\nThe present paper is organized as follows. The basic equations describing the spherically symmetric gravitational\nfield equations in the vacuum on the brane are derived in Section II. The general solution of the vacuum brane\nspace-times admitting a one parameter group of conformal motions, with non-static conformal symmetry, is obtained\nin Section III. The behavior of the angular velocity of a test particle in stable circular motion is considered in Section\nIV. We conclude and discuss our results in Section V.\nII.\n\nTHE FIELD EQUATIONS FOR A STATIC, SPHERICALLY SYMMETRIC VACUUM BRANE\n\nOn the 5-dimensional space-time (the bulk), with the negative vacuum energy Λ5 and brane energy-momentum as\nsource of the gravitational field, the Einstein field equations are given by\n\u0003\n\u0002\nmatter\n,\n(1)\nGIJ = k52 TIJ ,\nTIJ = −Λ5 gIJ + δ(Y ) −λb gIJ + TIJ\n\n\f4\nwith λb the vacuum energy on the brane and k52 = 8πG5 . In this space-time a brane is a fixed point of the Z2\nsymmetry. In the following capital Latin indices run in the range 0, ..., 4, while Greek indices take the values 0, ..., 3.\nAssuming a metric of the form ds2 = (nI nJ + gIJ )dxI dxJ , with nI dxI = dχ the unit normal to the χ =constant\nhypersurfaces and gIJ the induced metric on χ =constant hypersurfaces, the effective four-dimensional gravitational\nequations on the brane (the Gauss equation), take the form [20]:\nGμν = −Λgμν + k42 Tμν + k54 Sμν − Eμν ,\n\n(2)\n\nwhere Sμν is the local quadratic energy-momentum correction\nSμν =\n\n\u0001\n1\n1\n1\nT Tμν − Tμ α Tνα + gμν 3T αβ Tαβ − T 2 ,\n12\n4\n24\n\n(3)\n\nand Eμν is the non-local effect from the free bulk gravitational field, the transmitted projection of the bulk Weyl\ntensor CIAJB , EIJ = CIAJB nA nB , with the property EIJ → Eμν δIμ δJν as χ → 0. We have also denoted k42 = 8πG,\nwith G the usual four-dimensional gravitational constant.\nThe four-dimensional\ncosmological constant, Λ, and the four-dimensional coupling constant, k4 , are given by Λ =\n\u0001\nk52 Λ5 + k52 λ2b /6 /2 and k42 = k54 λb /6, respectively. In the limit λ−1\nb → 0 we recover standard general relativity.\nThe Einstein equation in the bulk and the Codazzi equation also imply the conservation of the energy-momentum\ntensor of the matter on the brane, Dν Tμ ν = 0, where Dν denotes the brane covariant derivative. Moreover, from\nthe contracted Bianchi identities on the brane it follows that the projected Weyl tensor should obey the constraint\nDν Eμ ν = k54 Dν Sμ ν .\nThe symmetry properties of Eμν imply that in general we can decompose it irreducibly with respect to a chosen\n4-velocity field uμ as [19]\n\u0014 \u0012\n\u0013\n\u0015\n1\nEμν = −k 4 U uμ uν + hμν + Pμν + 2Q(μ uν) ,\n(4)\n3\nwhere k = k5 /k4 , hμν = gμν + uμ uν projects orthogonal\nto uμ , the \"dark \u0003radiation\" term U = −k 4 Eμν uμ uν is a\n\u0002\n4 α\n4\nα\nscalar, Qμ = k hμ Eαβ a spatial vector and Pμν = −k h(μ hν) β − 31 hμν hαβ Eαβ a spatial, symmetric and trace-free\ntensor.\nIn the case of the vacuum state we have ρ = p = 0, Tμν ≡ 0 and consequently Sμν = 0. Therefore, by neglecting\nthe effect of the cosmological constant, the field equations describing a static brane take the form\nRμν = −Eμν ,\n\n(5)\n\nwith the trace R of the Ricci tensor Rμν satisfying the condition R = Rμμ = Eμμ = 0.\nIn the vacuum case Eμν satisfies the constraint Dν Eμ ν = 0. In an inertial frame at any point on the brane we have\nμ\nu = δ0μ and hμν =diag(0, 1, 1, 1). In a static vacuum Qμ = 0 and the constraint for Eμν takes the form [24]\n1\n4\nDμ U + U Aμ + Dν Pμν + Aν Pμν = 0,\n3\n3\n\n(6)\n\nwhere Dμ is the projection (orthogonal to uμ ) of the covariant derivative and Aμ = uν Dν uμ is the\u00014-acceleration. In\nthe static spherically symmetric case we may choose Aμ = A(r)rμ and Pμν = P (r) rμ rν − 13 hμν , where A(r) and\nP (r) (the \"dark pressure\") are some scalar functions of the radial distance r, and rμ is a unit radial vector [23].\nWe chose the static spherically symmetric metric on the brane in the form\n\u0001\n(7)\nds2 = −eν(r) dt2 + eλ(r) dr2 + r2 dθ2 + sin2 θdφ2 .\n\nThen the gravitational field equations and the effective energy-momentum tensor conservation equation in the\nvacuum take the form [26]\n\u0012\n\u0013\n1\n1\nλ′\n48πG\n−λ\n−e\n+ 2 = 4 U,\n−\n(8)\n2\nr\nr\nr\nk λb\ne\n\ne\n\n−λ\n\n−λ\n\n\u0012\n\n1\nν′\n+ 2\nr\nr\n\n\u0013\n\n−\n\n1\n16πG\n= 4\n(U + 2P ) ,\nr2\nk λb\n\n\u0013\n\u0012\n32πG\nν ′ − λ′\nν ′ λ′\nν ′2\n′′\n= 4\n(U − P ) ,\n+\n−\nν +\n2\nr\n2\nk λb\n\n(9)\n\n(10)\n\n\f5\n\nν′ = −\n\n6P\nU ′ + 2P ′\n−\n.\n2U + P\nr (2U + P )\n\n(11)\n\nIn the following we shall denote α = 16πG/k 4 λb .\nIII.\n\nGENERAL SOLUTION OF THE VACUUM BRANE FIELD EQUATIONS WITH NONSTATIC\nCONFORMAL SYMMETRY\n\nThe system of the field equations for the vacuum on the brane is under-determined. A functional relation between\nthe dark energy U and the dark pressure P must be specified in order to solve the equations. An alternative method,\nwhich avoids ad hoc specifications, is to assume that the brane is mapped conformally onto itself along the direction\nξ, so that\nλ\nλ\nLξ gμν = gμν,λ ξ λ + gλν ξ,μ\n+ gμλ ξ,ν\n= ψgμν ,\n\n(12)\n\nwhere ψ is the conformal factor. As for the choice of ξ, Herrera et al. [27] assumed that\nξ = ξ 0 (r)\n\n∂\n∂\n+ ξ 1 (r) .\n∂t\n∂r\n\n(13)\n\nUsing this form of the conformal vector in Eqs. (12) one obtains ξ 0 = A, ξ 1 = (B/2) r exp (−λ/2), ψ (r) =\nB exp (−λ/2) and exp (ν) = C 2 r2 , where A, B, C are constants. A may be set to zero since A∂/∂t is a Killing vector\nand B may be set to 1 by a rescaling ξ → B −1 ξ, ψ → B −1 ψ, which leaves Eqs. (12) invariant. This form of ξ gives\nthe most general ξ invariant under the Killing symmetries, that is [∂/∂t, ξ] = 0 = [Xα , ξ], where Xα generates SO (3).\nThis form of the metric, obtained by imposing static conformal symmetry, has been used in [28] to investigate the\nproperties of strange stars. The general solution of the vacuum brane gravitational field equations for this choice of\nξ has been obtained in [26].\nA more general conformal symmetry has been proposed by Maartens and Maharajah [29], which generalizes the\nisotropic conformal vector t∂/∂t + r∂/∂r of the Minkowski space-time, but weakens the static symmetry of ξ in Eq.\n(13):\nξ = ξ 0 (t, r)\n\n∂\n∂\n+ ξ 1 (t, r) .\n∂t\n∂r\n\n(14)\n\nMoreover, we assume that the conformal factor ψ is static, ψ = ψ (r). With this form of ξ Eqs. (12) give immediately\n(we denote ′ = d/dr):\nν ′ξ1 + 2\n\n∂ξ 0\n= ψ,\n∂t\n\n(15)\n\nλ′ ξ 1 + 2\n\n∂ξ 1\n= ψ,\n∂r\n\n(16)\n\nξ1 =\n\nrψ\n.\n2\n\n(17)\n\nBy solving Eqs. (15)-(17) we obtain [29]\nξ0 = A +\n\n1k\nt,\n2B\n\n(18)\n\nψ = Be−λ/2 ,\n\n(19)\n\n\u0013\n\u0012\nZ\ndr\n−1\n,\ne = C r exp −2kB\nrψ\n\n(20)\n\nν\n\n2 2\n\n\f6\nwhere k is a separation constant and A, B and C are integration constants. Without any loss of generality we can\nchose A = 0. Thus for the vector field ξ we obtain\nξ=\n\nrψ (r) ∂\n1k ∂\nt +\n,\n2 B ∂t\n2 ∂r\n\n(21)\n\nwhile the metric tensor components of the static vacuum brane can\nas a function of the conformal factor\nR be expressed\n\u0001\nin the form exp (λ) = B 2 ψ −2 and exp (ν) = C 2 r2 exp −2kB −1 dr/rψ , respectively.\nSubstitution of these forms of the metric functions in the field equations (8)-(10) gives\n\u0013\n\u0012\nψ2 1\n1\n2 ψ′\n− 2\n+ 2 = 3αU,\n+\n(22)\n2\nB\nr\nr ψ\nr\nψ2\nB2\n\nψ\n\n2\n\n\u0012\n\n\u0012\n\n3\nk 1\n−2\nr2\nB r2 ψ\n\n\u0013\n\n−\n\n1\n= α (U + 2P ) ,\nr2\n\n1\nk 1\nk2 1\nψ′\n+ 2\n−2\n+\n2\nrψ\nB r2 ψ B 2 r2 ψ 2\nr\n\n\u0013\n\n(23)\n\n= α (U − P ) .\n\n(24)\n\nBy multiplying Eq. (24) by 2, adding the equation thus obtained to Eq. (23) and equating the resulting equation\nwith Eq. (22) gives the following differential equation satisfied by the function ψ:\n3rψψ ′ + 3ψ 2 − 3\n\nk2\nk\nψ + 2 − B 2 = 0.\nB\nB\n\n(25)\n\nFor k 6= ±B 2 the general solution of Eq. (25) is given by\nr2 = R02\n\nF (ψ)\n,\nk\nk2\n2\n3ψ 2 − 3 B\nψ+ B\n2 − B\n\n(26)\n\nwhere R0 is an arbitrary constant of integration,\nk\nF (ψ) = exp −3\nB\n\ndψ\nk\n2\n3ψ − 3 B ψ +\n\nZ\n\nk2\nB2\n\n− B2\n\n!\n\n,\n\n(27)\n\nand\nF (ψ) =\n\n\u0012\n\n|ψ − ψ2 |\n|ψ − ψ1 |\n\nF (ψ) = exp\n\n\u0012\n\n\u0013m\n\n\u0001\n, k ∈ −2B 2 , 2B 2 ,\n\n±2B\nψ∓B\n\n\u0013\n\n, k = ±2B 2 ,\n\n\u0014\n\n\u0013\u0015\n\u0012\n\u0001\n\u0001\nk\nk\nF (ψ) = exp − n arctan n ψ −\n, k ∈ −∞, −2B 2 ∪ 2B 2 , +∞ .\nB\n2B\n\nIn Eqs. (28)-(30) we have also denoted\nq\nk\nk2\n3B\n± 12B 2 − 3 B\n2\n6\n3k\nψ1,2 =\n,n = q\n.\n,m = q\n2\n2\n6\nk\nk\nB 12B 2 − 3 B 2\n3 B 2 − 12B 2\n\nFor the dark radiation and dark pressure we obtain the general expressions\n\u0011\n\u0010\nk\nk\nk2\nk2\n1 2\n2\n3ψ 2 − 3 B\nψ2 − 2 B\nψ+B\nψ + 32 B\n2 − B\n2 + 3B\nU (ψ) =\n,\n3αB 2 R02 F (ψ)\n\n(28)\n\n(29)\n\n(30)\n\n(31)\n\n(32)\n\n\f7\nand\nk2\nB2\n\n3ψ 2 − 3 Bk ψ +\n\nP (ψ) =\n\n\u0010\nk\n4ψ 2 − 2 B\nψ−\n\n− B2\n\n1\n3\n\n3αR02 F (ψ)\n\n\u0010\n\nk2\nB2\n\n\u0011\n\u0011\n− B2 − 2\n\n,\n\n(33)\n\nrespectively.\nGenerally, ψ cannot be expressed in an exact analytical form as a function of r. Hence the functions exp (λ) =\nB 2 ψ −2 ,\nexp (ν) =\n\nF (ψ)\n\n3ψ 2\n\nC 2 R02\nk\nψ+\n− 3B\n\nk2\nB2\n\n− B2\n\n\u0001,\n\n(34)\n\nU (ψ) and P (ψ) can be obtained, as functions of the radial distance r, only in a parametric form, with ψ taken as\nparameter.\nHowever, because of the arbitrariness in the choice of the reference system in the general theory of relativity we\ncan subject the coordinates to any transformation which does not violate the central symmetry of the line element.\nTherefore, by introducing a new radial coordinate r̄ = ψ (r), so that\np\nR0 F (r̄)\nr = r (r̄) = q\n,\n(35)\nk2\nk\n2\nr̄ + B\n3r̄2 − 3 B\n2 − B\nwe obtain the line element of the static, spherically symmetric metric admitting a conformal symmetry with a nonstatic vector field on the vacuum brane in the form\n#\n\"\n2\n2 2\n2\nR\n9B\nF\n(r̄)\ndr̄\n0\n2\n2\n, k 6= ±B 2 ,\n(36)\nds2 =\n−C 2 dt2 +\n2 + F (r̄) dΩ\nk2\n2\n2\nF (r̄) 3r̄2 − 3 Bk r̄ + B\n2 − B\n3r̄2 − 3 k r̄ + k 2 − B 2\nB\n\n2\n\n2\n\n2\n\nB\n\n2\n\nwhere dΩ = dθ + sin θdφ is the metric of a unit sphere.\nTherefore, by using the new variable r̄ the three classes of conformally symmetric solutions of the gravitational field\nequations on the brane take the form\n\"\n#\n2m−2\n2m\nm−1\n2\n\u0001\nR\n|r̄\n−\nψ\n|\n|r̄\n−\nψ\n|\n|r̄\n−\nψ\n|\n2\n2\n1\n2\n2\nds2 = 0\n−C 2 dt2 + B 2\n, k ∈ −2B 2 , 2B 2 ,\n(37)\n2m+2 dr̄ +\n2m dΩ\n3 |r̄ − ψ2 |m+1\n|r̄ − ψ1 |\n|r̄ − ψ1 |\n\u0010\n\u0010\n\u0011\n\u0011\n\n±4B\n∓2B\n\u0012\n\u0013\n2 exp r̄∓B\nexp r̄∓B\nR\n±4B\n2\n−C 2 dt2 + B 2\nds2 = 0\ndΩ2  , k = ±2B 2 ,\n4 dr̄ + exp r̄ ∓ B\n3 (r̄ ∓ B)2\n(r̄ ∓ B)\nds\n\n2\n\n=\n\nR02 exp\n(\n\n\u0002k\n\nB n arctan n\nk2\nk\nr̄ + B\n3r̄2 − 3 B\n2\n\n−C 2 dt2 +\n\nk\n2B\nB2\n\nr̄ −\n\n\u0001\u0003\n\n×\n−\n\u0002\n9B 2 exp −2 Bk n arctan n r̄ −\n\nk ∈ −∞, −2B\n\n\u0001\n2\n\n(38)\n\nk\n3r̄2 − 3 B\nr̄ +\n\u0001\n2\n∪ 2B , +∞ .\n\nk2\nB2\n\n− B2\n\nk\n2B\n2\n\n\u0001\u0003\n\ndr̄2\n\n)\n\u0013\u0015\n\u0012\nk\nk\ndΩ2 ,\n+ exp −2 n arctan n r̄ −\nB\n2B\n\u0014\n\n(39)\n\nThe general solution of the field equations can be obtained in an exact analytical form for some particular values\nof k. Hence by taking k = ±B 2 we immediately obtain\nψ=\n\nR0\n± B,\nr\n\n(40)\n\nwith the corresponding line element given by\nds2 =\n\n1\nR0\nr\n\n±B\n\n\u0001\n\u0001\n2\n2\n2\n2\n2\n2 2\n2 2\n\u00012 −C dt + B dr + r dθ + sin θdφ , k = ±B .\n\nFor the dark radiation and the dark pressure we find\n\u0012 \u00134\n\u0012\n\u0013 \u0012 \u00133\n2\nR0\n2R0\nR0\n1\n, P (r) =\n, k = ±B 2 .\n±B\nU (r) =\nαR02\nr\nαR02\n3r\nr\n\n(41)\n\n(42)\n\n\f8\nIV.\n\nSTABLE CIRCULAR ORBITS IN CONFORMALLY SYMMETRIC SPACE-TIMES ON THE BRANE\n\nWe shall consider now the problem of constructing stable circular timelike geodesic orbits in a static spherically,\nspherically symmetric field on the brane, with line element given in a general form by Eq. (7). The motion of a test\nparticle in the gravitational field can be described by the Lagrangian [4]\n\u0012 \u00132\n\u0012 \u00132\n\u0012 \u00132\n\u0012 \u00132\nds\ndt\ndr\ndΩ\n2L =\n= −eν(r)\n+ eλ(r)\n+ r2\n,\n(43)\ndτ\ndτ\ndτ\ndτ\nwhere we denoted by τ the affine parameter along the geodesics. In the timelike case τ corresponds to the proper\ntime. In the following we denote by an overdot the differentiation with respect to τ . From the Lagrangian given by\nEq. (43) it follows that the energy E = eν ṫ and the φ-component lφ = r2 sin2 θφ̇ of the angular momentum of the\nparticle are conserved quantities, E =const. and lφ =const. The θ-component of the angular momentum, lθ = r2 θ̇ is\nnot a constant of the motion, but the total angular momentum l2 = lθ2 + (lφ / sin θ)2 is a conserved quantity, l2 =const.\nThe total angular momentum can be expressed in terms of the solid angle as l2 = r4 Ω̇2 [4].\nIn the timelike case the equation of the geodesic orbits can be written in the form\nṙ2 + V (r) = 0,\n\n(44)\n\n\u0013\n\u0012\nl2\nV (r) = −e−λ E 2 e−ν − 2 − 1 .\nr\n\n(45)\n\nwhere the potential V (r) is given by\n\nRestricting the radial motion to stable circular orbits implies imposing the conditions ṙ = 0 and ∂V /∂r = 0, so that\nthe potential describes an extremum of the motion. In order this extremum be a minimum the condition ∂ 2 V /∂r2 > 0\nis also required. These three conditions imply that the circular motion is stable. They also lead to the following\nexpressions of the energy and total angular momentum of the particle [4], [5]:\nE2 =\n\n2eν\nr3 ν ′\n, l2 =\n.\n′\n2 − rν\n2 − rν ′\n\n(46)\n\nOn the other hand, the line element, given by Eq. (7), can be rewritten in terms of the spatial components of\nthe velocity,\u0001normalized with the speed of light, measured by an inertial observer far from the source, as ds2 =\n−dt2 1 − v 2 [4], where\n\" \u0012 \u0013\n\u0012 \u00132 #\n2\ndΩ\ndr\n.\n(47)\n+ r2\nv 2 = e−ν eλ\ndt\ndt\nFor a stable circular orbit ṙ = 0, and the tangential velocity of the test particle can be expressed as\n\u0012 \u00132\nr2 dΩ\n2\nvtg\n= ν\n.\ne\ndt\n\n(48)\n\nIn terms of the conserved quantities the angular velocity is given by\n2\nvtg\n=\n\neν l 2\n.\nr2 E 2\n\n(49)\n\nrν ′\n.\n2\n\n(50)\n\nWith the use of Eqs. (46) we obtain\n2\nvtg\n=\n\nThus, the rotational velocity of the test body is determined by the metric coefficient exp (ν) only.\nIn the case of the motion of a test particle in a conformally symmetric, static spherically symmetric space-time,\nwith a non-static vector field generating the symmetry, the metric coefficient exp (ν) is given by Eq. (20). Therefore\nfor the angular velocity we find the simple expression\n2\nvtg\n=1−\n\nk 1\n.\nBψ\n\n(51)\n\n\f9\nEq. (51)h gives a simple\nphysical interpretation of the conformal factor ψ in terms of the tangential velocity,\n\u0001 i\n2 −1\n. On the other hand, the metric coefficient exp (λ) can also be expressed as a function of the\nψ = (k/B) 1 − vtg\ntangential velocity only:\nexp (λ) =\n\n\u0001\nB4\n2 2\n.\n1 − vtg\n2\nk\n\n(52)\n\nFrom Eq. (51) it follows that the general, physically acceptable, range of the parameter ψ is ψ ∈ [k/B, ∞),\ncorresponding to\u0001 a variation of the tangential velocity between zero and the speed of light. However, in the case\nk ∈ −2B 2 , 2B 2 , the limiting value of the radial coordinate, r → ∞, is obtained, as one can see from Eq. (28), in\nthe limits ψ → ψ1 or ψ → ψ2 (the corresponding limit depends on the numerical values of the parameters k and B).\nAssuming that r → ∞ for ψ → ψ1 , it follows that in the large r limit the tangential velocity of a test particle in stable\ncircular motion in a conformally symmetric static vacuum space-time on the brane tends to a limiting, non-zero value\nvtg∞ , v → vtg∞ , r → ∞, given by\ns\n6k\n√\nvtg∞ = 1 −\n.\n(53)\n3k + 12B 4 − 3k 2\nFor B = 1.00000034 and k = 0.9999999 the limiting tangential velocity is given by vtg∞ ∼ 0.00072 ∼ 216.3 km/s,\nwhich is of the order of the observed galactic rotational velocities.\nIn the case of a conformally symmetric static vacuum space-time on the brane, the general dependence of the\ntangential velocity vtg on the radial coordinate r is given, with the use of Eq. (26), in a parametric form, with ψ\ntaken as parameter. In this model it is not possible to express the tangential velocity as an analytical function of r.\nThe variation of vtg as a function of the radial distance is represented, for some particular values of k and B, in\nFig. 1.\n\n0.012\n0.01\n\nvtg\n\n0.008\n0.006\n0.004\n0.002\n0\n0\n\n10000 20000 30000 40000 50000 60000\nr/R0\n\nFIG. 1: Variation, as a function of the parameter r/R0 , of the tangential velocity vtg of a test particle in a stable circular\norbit in a conformally symmetric vacuum space-time on the brane, for B = 1.00001 and different values of k: k = 0.9999 (solid\ncurve), k = 0.99985 (dotted curve) and k = 0.9998 (dashed curve).\n\nIn the limit of large r, r → ∞, and for this choice of the numerical values of the arbitrary parameters k and B, the\ntangential velocity tends to a constant value. The numerical value of the limiting velocity is extremely sensitive to\nthe values of k and B.\nThe variations of the metric coefficients exp(ν) and exp(λ) are represented in Figs. 2 and 3, respectively.\n\nThe metric components satisfy the conditions exp(ν) ≤ 1 and exp(λ) ≥ 1, respectively.\n\n\f10\n\nexp(ν)/C2 R0 2\n\n0.3346\n\n0.3344\n\n0.3342\n\n0.334\n\n0\n\n20000\n\n40000\n\n60000\nr/R0\n\n80000 100000 120000\n\nFIG. 2: Variation, as a function of the parameter r/R0 , of the metric coefficient exp(ν) /C 2 R02 for a static, conformally\nsymmetric vacuum space-time on the brane, for B = 1.00001 and different values of k: k = 0.9999 (solid curve), k = 0.99985\n(dotted curve) and k = 0.9998 (dashed curve).\n\n1.0004\n\nexp(λ)\n\n1.00035\n1.0003\n1.00025\n1.0002\n1.00015\n1.0001\n0\n\n20000\n\n40000\nr/R0\n\n60000\n\n80000\n\nFIG. 3: Variation, as a function of the parameter r/R0 , of the metric coefficient expλ for a static, conformally symmetric\nvacuum space-time on the brane, for B = 1.00001 and different values of k: k = 0.9999 (solid curve), k = 0.99985 (dotted\ncurve) and k = 0.9998 (dashed curve).\n\nThe dark radiation and dark pressure terms can also be represented, as a function of the tangential velocity of a\ntest body, in the form\n\nand\n\n\u0001\n\u0001\u0003\n\u0001\n\u0003\n\u0002\n\u0001\n\u0002 2\n\b 4\n2 2\n2\n2\n2\n2\n− B 4 1 − vtg\n1 + vtg\n− 1 k 2 1 + vtg\n1 + vtg\n+ k 2 2vtg\nB 1 − vtg\nh\nU (vtg ) =\n,\n\u0001 i\n\u0001\n2 4 F k 1 − v 2 −1\n9αR02 B 6 1 − vtg\ntg\nB\n\u0001\n\u0001\u0003\n\u0001\u0003\n\u0002\n\u0001\n\u0002\n\b 2 2\n\u0001\n2 2\n2\n2\n2\n2\n2\n− B 4 1 − vtg\n1 + vtg\nk 2 1 + vtg\n8 − vtg\n+ k 2 5 + vtg\nB B − 6 1 + vtg\nh\nP (vtg ) =\n,\n\u0001 i\n2 −1\n9αR02 B 4 F Bk 1 − vtg\n\nrespectively.\nThe variation of the dark radiation U is represented, as a function of r/R0 , in Fig. 4.\n\n(54)\n\n(55)\n\n\f11\n-12\n\n6*10\n\n-12\n\n5*10\n3αB2 R20 U\n\n-12\n\n4*10\n\n-12\n\n3*10\n\n-12\n\n2*10\n\n-12\n\n1*10\n\n5000\n\n10000\n\n15000\nr/R0\n\n20000\n\n25000\n\n30000\n\nFIG. 4: Variation, as a function of the parameter r/R0 , of the dark radiation term 3αB 2 R02 U for a static, conformally symmetric\nvacuum space-time on the brane, for B = 1.00001 and different values of k: k = 0.9999 (solid curve), k = 0.99985 (dotted\ncurve) and k = 0.9998 (dashed curve).\n\nThe dark radiation term is positive for all values of the radial coordinate r, U (r) ≥ 0, ∀r ∈ (0, ∞). In the limit of\nlarge r, U tends to zero, limr→∞ U (r) = 0. The variation of the dark pressure as a function of r is represented in Fig.\n5.\n\n-12\n\n-2*10\n\n-12\n\n3αR02 P\n\n-4*10\n\n-12\n\n-6*10\n\n-12\n\n-8*10\n\n-11\n\n-1*10\n\n-11\n\n-1.2*10\n\n-11\n\n-1.4*10\n\n5000\n\n10000\n15000\nr/R0\n\n20000\n\n25000\n\nFIG. 5: Variation, as a function of the parameter r/R0 , of the dark pressure term 3αR02 P for a static, conformally symmetric\nvacuum space-time on the brane, for B = 1.00001 and different values of k: k = 0.9999 (solid curve), k = 0.99985 (dotted\ncurve) and k = 0.9998 (dashed curve).\n\nIn the present model the dark pressure is negative, satisfying the condition P (r) ≤ 0, ∀r ∈ (0, ∞). In the large\ntime limit, similar to the dark radiation term, the dark pressure also tends to zero, limr→∞ P (r) = 0.\nV.\n\nDISCUSSIONS AND FINAL REMARKS\n\nIn order to obtain a manifestly coordinate invariant characterization of certain geometrical properties of geometries,\nlike for example curvature singularities, Petrov type of the Weyl tensor etc., the scalar invariants of the Riemann tensor\nhave been extensively used. Two scalars, which have been considered in the physical literature, are the Kretschmann\nscalars, RiemSq ≡ Rijkl Rijkl and RicciSq ≡ Rij Rij , where Rijkl is the Riemann curvature tensor.\nFor space-times which are the product of two 2-dimensional spaces, one Lorentzian and one Riemannian, subject\nto a separability condition on the function which couples the 2-spaces, it has been suggested in [30] that the set\n\n\f12\nC = {R, r1 , r2 , w2 } form an independent set of scalar polynomial invariants, satisfying the number of degrees of\nfreedom in the curvature. R = g il g jk Rijkl is the Ricci scalar and the quantities r1 , r2 and w2 are defined according\nto [31]:\nr1 = φAB ȦḂ φAB ȦḂ =\n\nEF AB\nw2 = ΨABCD ΨCD\n=\nEF Ψ\n\n1 b a\n1\nB Ḃ CAĊ Ȧ\nS S , r2 = φAB ȦḂ φC\nφ\n= − Sab Sbc Sca ,\nĊ\n4 a b\n8\n\n\u0001\n\u0001\ni\n1\n3Eba Hcb Hac − Eba Ecb Eac +\nHba Hcb Hac − 3Eba Ecb Hac ,\n32\n32\n\n(56)\n\n(57)\n\nwhere Sab = Rab − 41 Rδab is the trace-free Ricci tensor, φAB ȦḂ denotes the spinor equivalent of Sab , ΨABCD denotes\nthe spinor equivalent of the Weyl tensor Cabcd and C̄abcd denotes the complex conjugate of the self-dual Weyl tensor,\n+\n∗\nCabcd\n= 12 (Cabcd − i ∗ Cabcd ). Eac = Cabcd ub ud and Hac = Cabcd\nub ud are the \"electric\" and \"magnetic\" parts of the\nef\n∗\nWeyl tensor, respectively, where ua is a timelike unit vector and Cabcd\n= 12 ηabef Ccd\nis the dual tensor. The expressions\nof the invariants for some particular values of the integration constants k and B are presented in the Appendix. Due\nto their complicated form we shall not present the values of the invariants for other values of k and B. For the B = 1,\nk = 2 case the invariants diverge at r = 1, while for the B = 1, k = ±1 case they diverge for r → 0.\nIn the present paper we have obtained all the conformally symmetric solutions of the vacuum field equations in\nthe brane world model, under the assumption of a non-static conformal symmetry, and we have discussed some of\ntheir physical properties. In particular we have considered the behavior of the angular velocity of a test particle\nin stable circular orbit on the brane. The conformal factor ψ, together with two constants of integration, uniquely\ndetermines the rotational velocity of the particle. In the limit of large radial distances and for a particular set of\nvalues of the integration constants the angular velocity tends to a constant value. This behavior is typical for massive\nparticles (hydrogen clouds) outside galaxies. Thus the rotational galactic curves can be naturally explained in brane\nworld models. The galaxy is embedded in a modified, spherically symmetric geometry, generated by the non-zero\ncontribution of the Weyl tensor from the bulk. The extra-terms, which can be described in terms of a dark radiation\nterm U and a dark pressure term P , act as a \"matter\" distribution outside the galaxy. The particles moving in this\ngeometry feel the gravitational effects of U and P , which can also be described, equivalently, by means of a mass\nterm.\nThe behavior of the metric coefficients and of the angular velocity in the solutions we have obtained depend on\ntwo arbitrary constants of integration k and B. Their numerical value can be obtained by assuming the continuity\nof the metric coefficient exp (λ) across the vacuum boundary of the galaxy. For simplicity we assume that inside\nthe \"normal\" (baryonic) luminous matter, with density ρB , which form a galaxy, the non-local effects of the Weyl\ntensor can be neglected. We define the vacuum boundary r0 of the galaxy (which for simplicity is assumed to\nhave spherical symmetry) by the condition\nR r ρB (r0 ) ≈ 0. Therefore at the vacuum boundary the metric coefficient\nexp (λ) = 1−2GMB /r0 , where MB = 4π 0 0 ρB (r) r2 dr is the total baryonic mass inside the radius r0 . The continuity\nof exp (λ) through the surface r = r0 gives\n1−\nleading to\n\n2GMB\nψ 2 (r0 )\nk2\n1\n=\n=\n\u0002\n\u0003 ,\n2\n4\n2\nr0\nB\nB 1 − vtg (r0 ) 2\nk2\n=\nB4\n\n\u0013\n\u0012\n\u00032\n2GMB \u0002\n2\n1−\n1 − vtg\n(r0 ) .\nr0\n\n(58)\n\n(59)\n\nTherefore the ratio k 2 /B 4 can be determined observationally. With the help of Eq. (59) the limiting angular\nvelocity of the test particle rotating in the conformally symmetric gravitational field on the brane, given by Eq. (53),\ncan be expressed, as a function of the total baryonic mass of the galaxy only, in the form\nv\nq\n\u0010\n\u0011\nu\nB\nB\nu\n1 − GM\n1 − 2GM\n6\nr0\nr0\nu\n(60)\nvtg∞ = u1 − q\n\u0010\n\u0010\n\u0011 r\n\u0011\u0010\n\u00112 ,\nt\n2GMB\n2GMB\nGMB\nGMB\n3 1 − r0\n1 − r0\n+ 12 − 3 1 − r0\n1 − r0\n\n2\nwhere we have also used the Newtonian approximation vtg\n(r0 ) = GMB /r0 to eliminate the angular velocity of a test\nparticle at the vacuum boundary of the galaxy.\n\n\f13\nSince for a galaxy GMB /r0 has a very small value, we can expand vtg∞ in a power series of GMB /r0 , thus obtaining\n\nvtg∞\n\n2\n≈ √\n3\n\nr\n\n1\nGMB\n+ √\nr0\n12 3\n\n\u0012\n\nGMB\nr0\n\n\u00133/2\n\n+O\n\n\"\u0012\n\nGMB\nr0\n\n\u00135/2 #\n\n.\n\n(61)\n\nFor a galaxy with baryonic mass of the order 109 M⊙ and radius of the order of r0 ≈ 70 kpc, Eq. (61) gives\nvtg∞ ≈ 287 km/s, which is of the same order of magnitude as the observed value of the angular velocity of the galactic\nrotation curves.\nFrom the field equation Eq. (8) it follows that in the vacuum outside the galaxy the metric tensorR component\nr\nexp (−λ) can be expressed in terms of the dark radiation only as exp (−λ) = 1−2GMU /r, where MU = 3α r0 U (r)r2 dr\nrepresents the \"mass\" associated to the dark radiation component of the energy-momentum tensor on the brane. By\nusing the conformal symmetry and the expression of the ratio k 2 /B 4 we obtain for MU the expression\n\n#2 \n\u0013\"\n\u0012\n2\n1 − vtg\n(r0 ) \nr \n2GMB\nMU (r) =\n.\n(62)\n1− 1−\n2 (r)\n\n2G \nr0\n1 − vtg\n\n2\n2\nSince vtg\n(r0 ) and vtg\n(r) are much smaller than one, it follows that the dark radiation mass can be approximated\nby the very simple scaling relation\n\nMU (r) ≈ MB\n\nr\n.\nr0\n\n(63)\n\nMU is linearly increasing with the distance and is proportional to the baryonic mass of the galaxy. In the Newtonian\n2\nlimit, from the equality between the centrifugal force and the gravitational force it follows MB /r0 = vtg\n(r0 ) /G, leading\nto\nMU (r) ≈\n\n2\nvtg\n(r0 )\nr.\nG\n\n(64)\n\nIn conclusion, in the present paper we have investigated conformally symmetric vacuum solutions of the gravitational\nfield equations on the brane, and analyzed the motion of test particles in stable circular orbits in this geometry. By\nusing the continuity of the metric coefficients a complete description of the motion of the particles outside a galaxy\ncan be obtained. In the large distance limit the angular velocity of the particles tend to a constant value, which can\nbe determined as a function of the baryonic (luminous) mass and the radius of the galaxy. All the relevant physical\nquantities, including the dark energy and the dark pressure terms, which describe the non-local effects due to the\ngravitational field of the bulk, are expressed in terms of observable parameters. More general conformally symmetric\nsolutions on the brane, and their physical properties, will be considered in detail in a future publication.\nAppendix\n\nIn this Appendix we present the values of the Kretschmann scalars RiemSq ≡ Rijkl Rijkl and RicciSq ≡ Rij Rij and\nsome values of the independent set of the scalar polynomial invariants {R, r1 , r2 , w2 } for the exact static, spherically\nsymmetric vacuum brane with conformal symmetry for some particular values of the integration constants k and B.\nFor k = 2 and B = 1 the expressions of the invariants are\n\u0001\n4\n4\n(65)\nR = 0, RicciSq = 18R0−4 e− r−1 (r − 1) 9 − 8r + 12r2 − 16r3 + 6r4 ,\n4\n\n4\n\nRiemSq = 72R0−4 e− r−1 (r − 1)\n\nr1 =\n\n\u0001\n6 − 4r + 6r2 − 8r3 + 3r4 ,\n\n\u0001\n\u0001\n6\n81 − r−1\n1\n6\ne\nRicciSq, r2 =\n(r − 1) r2 − 2 1 − 4r + 2r2 ,\n6\n4\n4R0\nRe (w2 ) = −\n\n6\n81 − r−1\n6\n(r − 1) .\ne\n4R06\n\n(66)\n\n(67)\n\n(68)\n\n\f14\nFor B = 1 and k = ±1 we obtain\n\u0001\n4R02 6r2 ± 8R0 r + 3R02\nR = 0, RicciSq =\n,\nr8\n\n(69)\n\nRiemSq = 2RicciSq,\n\n(70)\n\n\u0001\n3R03 2r3 ± 5R0 r2 + 4R02 r ± R03\nRicciSq\n,\n, r2 =\nr1 =\n4\nr12\n\n(71)\n\nRe (w2 ) = 0.\n\n(72)\n\n[1] C. M. Will, Theory and experiment in gravitational physics, Cambridge, Cambridge University Press, (1993).\n[2] J. Binney and S. Tremaine, Galactic dynamics, Princeton, Princeton University Press, (1987); M. Persic, P. Salucci and\nF. Stel, Month. Not. R. Acad. Sci. 281, 27 (1996); A. Boriello and P. Salucci, Month. Not. R. Acad. Sci. 323, 285 (2001).\n[3] I. F. M. Albuquerque and L. Baudis, Phys. Rev. Lett. 90, 221301 (2003).\n[4] T. Matos and F. S. Guzman, Class. Quant. Grav. 18, 5055 (2001); L. G. Cabral-Rosetti, T. Matos, D. Nuez and R. A.\nSussman, Class. Quant. Grav. 19, 3603 (2002); J. E. Lidsey, T. Matos and L. Arturo Urena-Lopez, Phys. Rev. D66, 023514\n(2002); T. Matos and D. Nunez, astro-ph/0303594 (2003).\n[5] K. Lake, to appear in Phys. Rev. Letter; gr-qc/0302067 (2003).\n[6] S. Bharadwaj and S. Kar, Phys. Rev. D68, 023516 (2003).\n[7] R. H. Sanders, Astron. Astrophys. 136, L21 (1984); R. H. Sanders, Astron. Astrophys. 154, 135 (1986).\n[8] M. Milgrom, Astrophys. J. 270, 365 (1983); J. Bekenstein and M. Milgrom, Astrophys. J. 286, 7 (1984); M. Milgrom, New\nAstron. Rev. 46, 741, (2002); M. Milgrom, Astrophys. J. 599, L25, (2003).\n[9] P. D. Mannheim, Astrophys. J. 419, 150 (1993); P. D. Mannheim, Astrophys. J. 479, 659 (1997).\n[10] J. W. Moffat and I. Y. Sokolov, Phys. Lett. B378, 59 (1996).\n[11] V. V. Zhytnikov and J. M. Nester, Phys. Rev. Lett. 73, 2950 (1994).\n[12] M. Pavsic and V. Tapia, Resource Letter on geometrical results for Embeddings and Branes, gr-qc/0010045.\n[13] L. P. Eisenhart, Riemannian geometry, Princeton University Press, Princeton, (1949).\n[14] I. Robinson and Y. Ne'eman, Seminar on the Embedding Problem, Rev. Mod. Phys. 37, 201 (1965).\n[15] K. Akama, Pregeometry, in Lect. Notes Phys., 176, Gauge Theory and Gravitation, Proceedings, Nara, 1982, edited by\nK. Kikkawa, N. Nakanishi and H. Nariai, Springer Verlag, 267 (1983).\n[16] V. A. Rubakov and M. E. Shaposhnikov, Phys. Lett B125, 136 (1983).\n[17] I. A. Bandos and W. Kummer, Int. J. Mod. Phys. A14, 4881 (1999).\n[18] L. Randall and R. Sundrum, Phys. Rev. Lett. 83, 3370 (1999); L. Randall and R. Sundrum, Phys. Rev. Lett 83, 4690\n(1999).\n[19] R. Maartens, gr-qc/0312059 (2003).\n[20] T. Shiromizu, K. Maeda and M. Sasaki, Phys. Rev. D62, 024012 (2000); M. Sasaki, T. Shiromizu and K. Maeda, Phys.\nRev. D62, 024008 (2000).\n[21] K. Maeda and D. Wands, Phys. Rev. D62, 124009 (2000); R. Maartens, Phys. Rev. D62, 084023 (2000); A. Campos and\nC. F. Sopuerta, Phys. Rev. D63, 104012 (2001); A. Campos and C. F. Sopuerta, Phys. Rev. D64, 104011 (2001); C.-M.\nChen, T. Harko and M. K. Mak, Phys. Rev. D64, 044013 (2001); D. Langlois, Phys. Rev. Lett. 86, 2212 (2001); C.-M.\nChen, T. Harko and M. K. Mak, Phys. Rev. D64, 124017 (2001); L. Anchordoqui, J. Edelstein, C. Nunez, S. P. Bergliaffa,\nM. Schvellinger, M. Trobo and F. Zyserman, Phys. Rev. D64, 084027 (2001); A. Coley, Phys. Rev. D66, 023512 (2002);\nA. Coley, Class. Quantum Grav. 19, L45 (2002); J. D. Barrow and R. Maartens, Phys. Lett. B532, 153 (2002); H. Kudoh\nand T. Tanaka, Phys. Rev. D65, 104034 (2002); H. A. Bridgman, K. A. Malik and D. Wands, Phys. Rev. D65, 043502\n(2002); C.-M. Chen, T. Harko, W. F. Kao and M. K. Mak, Nucl. Phys. B64, 159 (2002); M. Szydlowski, M. P. Dabrowski\nand A. Krawiec, Phys. Rev. D66, 064003 (2002); T. Harko and M. K. Mak , Class. Quantum Grav. 20, 407 (2003), C.-M.\nChen, T. Harko, W. F. Kao and M. K. Mak, JCAP 0311, 005 (2003); I. Brevik, K. Brkje and J. P. Morten, gr-qc/0310103,\nT. Harko and M. K. Mak, Class. Quantum. Grav. 21, 1489 (2004).\n[22] N. Dadhich and S. G. Ghosh, Phys. Lett. B518, 1 (2001); M. G. Santos, F. Vernizzi and P. G. Ferreira, Phys. Rev. D64,\n063506 (2001); M. Bruni, C. Germani and R. Maartens, Phys. Rev. Lett. 87, 231302 (2001); H.-C. Kim, S.-H. Moon and J.\nH. Yee, JHEP 0202, 046 (2002); M Govender and N. Dadhich, Phys. Lett. B538, 233 (2002); T. Wiseman, Class. Quant.\nGrav. 19, 3083 (2002); R. Neves and C. Vaz, Phys. Rev. D66, 124002 (2002); L. A. Anchordoqui, H. Goldberg and A. D.\nShapere, Phys. Rev. D66, 024033 (2002); H. Kudoh, T. Tanaka and T. Nakamura, gr-qc/0301089.\n\n\f15\n[23] N. Dadhich, R. Maartens, P. Papadopoulos and V. Rezania, Phys. Lett. B487, 1 (2000).\n[24] C. Germani and R. Maartens, Phys. Rev. D64, 124010 (2001).\n[25] R. Casadio, A. Fabbri and L. Mazzacurati, Phys. Rev. D65, 084040 (2002); S. Shankaranarayanan and N. Dadhich,\ngr-qc/0306111 (2003); M. Visser and D. L. Wiltshire, Phys. Rev. D67, 104004 (2003); R. Casadio and L. Mazzacurati,\nMod. Phys. Lett. A18, 651 (2003).\n[26] T. Harko and M. K. Mak, Phys. Rev. D, to be published; gr-qc/0401049 (2004).\n[27] L. Herrera and J. Ponce de Leon, J. Math. Phys. 26, 2303 (1985); L. Herrera and J. Ponce de Leon, J. Math. Phys. 26,\n2018 (1985); L. Herrera and J. Ponce de Leon, J. Math. Phys. 26, 778 (1985).\n[28] M. K. Mak and T. Harko, Int. Journal Mod. Phys. D 13, 149 (2004).\n[29] R. Maartens and M. S. Maharaj, J. Math. Phys. 31, 151 (1990).\n[30] K. Santusuosso, D. Pollney, N. Pelavas, P. Musgrave and K. Lake, Comp. Phys. Comm. 115, 381 (1998).\n[31] E. Zakhary and J. Carminati, J. Math. Phys. 42 1474 (2001); J. Carminati, E. Zakhary and R. G. McLenaghan, J. Math.\nPhys. 43 492 (2002).\n\n\f"}