{"id": "http://arxiv.org/abs/gr-qc/0509053v2", "guidislink": true, "updated": "2006-04-27T01:42:43Z", "updated_parsed": [2006, 4, 27, 1, 42, 43, 3, 117, 0], "published": "2005-09-15T13:39:41Z", "published_parsed": [2005, 9, 15, 13, 39, 41, 3, 258, 0], "title": "Spontaneous excitation of an accelerated atom in a spacetime with a\n  reflecting plane boundary", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0407038%2Cgr-qc%2F0407039%2Cgr-qc%2F0407114%2Cgr-qc%2F0407059%2Cgr-qc%2F0407049%2Cgr-qc%2F0407083%2Cgr-qc%2F0407017%2Cgr-qc%2F0407062%2Cgr-qc%2F0407007%2Cgr-qc%2F0407063%2Cgr-qc%2F0407116%2Cgr-qc%2F0407104%2Cgr-qc%2F0407029%2Cgr-qc%2F0407028%2Cgr-qc%2F0407069%2Cgr-qc%2F0407093%2Cgr-qc%2F0407023%2Cgr-qc%2F0407077%2Cgr-qc%2F0407032%2Cgr-qc%2F0407094%2Cgr-qc%2F0407036%2Cgr-qc%2F0407009%2Cgr-qc%2F0407060%2Cgr-qc%2F0407098%2Cgr-qc%2F0407045%2Cgr-qc%2F0407078%2Cgr-qc%2F0407024%2Cgr-qc%2F0407046%2Cgr-qc%2F0407043%2Cgr-qc%2F0407068%2Cgr-qc%2F0407096%2Cgr-qc%2F0407006%2Cgr-qc%2F0407034%2Cgr-qc%2F0407091%2Cgr-qc%2F0509121%2Cgr-qc%2F0509072%2Cgr-qc%2F0509035%2Cgr-qc%2F0509101%2Cgr-qc%2F0509005%2Cgr-qc%2F0509082%2Cgr-qc%2F0509115%2Cgr-qc%2F0509084%2Cgr-qc%2F0509045%2Cgr-qc%2F0509037%2Cgr-qc%2F0509097%2Cgr-qc%2F0509013%2Cgr-qc%2F0509052%2Cgr-qc%2F0509059%2Cgr-qc%2F0509066%2Cgr-qc%2F0509034%2Cgr-qc%2F0509123%2Cgr-qc%2F0509067%2Cgr-qc%2F0509011%2Cgr-qc%2F0509111%2Cgr-qc%2F0509006%2Cgr-qc%2F0509043%2Cgr-qc%2F0509119%2Cgr-qc%2F0509033%2Cgr-qc%2F0509019%2Cgr-qc%2F0509125%2Cgr-qc%2F0509004%2Cgr-qc%2F0509007%2Cgr-qc%2F0509083%2Cgr-qc%2F0509120%2Cgr-qc%2F0509025%2Cgr-qc%2F0509126%2Cgr-qc%2F0509085%2Cgr-qc%2F0509001%2Cgr-qc%2F0509087%2Cgr-qc%2F0509100%2Cgr-qc%2F0509065%2Cgr-qc%2F0509050%2Cgr-qc%2F0509080%2Cgr-qc%2F0509008%2Cgr-qc%2F0509014%2Cgr-qc%2F0509099%2Cgr-qc%2F0509027%2Cgr-qc%2F0509079%2Cgr-qc%2F0509056%2Cgr-qc%2F0509053%2Cgr-qc%2F0509003%2Cgr-qc%2F0509026%2Cgr-qc%2F0509078%2Cgr-qc%2F0509118%2Cgr-qc%2F0509021%2Cgr-qc%2F0509128%2Cgr-qc%2F0509108%2Cgr-qc%2F0509103%2Cgr-qc%2F0509015%2Cgr-qc%2F0509070%2Cgr-qc%2F0509009%2Cgr-qc%2F0509040%2Cgr-qc%2F0509049%2Cgr-qc%2F0509088%2Cgr-qc%2F0509046%2Cgr-qc%2F0509018%2Cgr-qc%2F0509093%2Cgr-qc%2F0509109%2Cgr-qc%2F0509117%2Cgr-qc%2F0509075%2Cgr-qc%2F0509036&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spontaneous excitation of an accelerated atom in a spacetime with a\n  reflecting plane boundary"}, "summary": "We study a two-level atom in interaction with a real massless scalar quantum\nfield in a spacetime with a reflecting boundary. The presence of the boundary\nmodifies the quantum fluctuations of the scalar field, which in turn modifies\nthe radiative properties of atoms. We calculate the rate of change of the mean\natomic energy of the atom for both inertial motion and uniform acceleration. It\nis found that the modifications induced by the presence of a boundary make the\nspontaneous radiation rate of an excited inertial atom to oscillate near the\nboundary and this oscillatory behavior may offer a possible opportunity for\nexperimental tests for geometrical (boundary) effects in flat spacetime. While\nfor accelerated atoms, the transitions from ground states to excited states are\nfound to be possible even in vacuum due to changes in the vacuum fluctuations\ninduced by both the presence of the boundary and the acceleration of atoms, and\nthis can be regarded as an actual physical process underlying the Unruh effect.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0407038%2Cgr-qc%2F0407039%2Cgr-qc%2F0407114%2Cgr-qc%2F0407059%2Cgr-qc%2F0407049%2Cgr-qc%2F0407083%2Cgr-qc%2F0407017%2Cgr-qc%2F0407062%2Cgr-qc%2F0407007%2Cgr-qc%2F0407063%2Cgr-qc%2F0407116%2Cgr-qc%2F0407104%2Cgr-qc%2F0407029%2Cgr-qc%2F0407028%2Cgr-qc%2F0407069%2Cgr-qc%2F0407093%2Cgr-qc%2F0407023%2Cgr-qc%2F0407077%2Cgr-qc%2F0407032%2Cgr-qc%2F0407094%2Cgr-qc%2F0407036%2Cgr-qc%2F0407009%2Cgr-qc%2F0407060%2Cgr-qc%2F0407098%2Cgr-qc%2F0407045%2Cgr-qc%2F0407078%2Cgr-qc%2F0407024%2Cgr-qc%2F0407046%2Cgr-qc%2F0407043%2Cgr-qc%2F0407068%2Cgr-qc%2F0407096%2Cgr-qc%2F0407006%2Cgr-qc%2F0407034%2Cgr-qc%2F0407091%2Cgr-qc%2F0509121%2Cgr-qc%2F0509072%2Cgr-qc%2F0509035%2Cgr-qc%2F0509101%2Cgr-qc%2F0509005%2Cgr-qc%2F0509082%2Cgr-qc%2F0509115%2Cgr-qc%2F0509084%2Cgr-qc%2F0509045%2Cgr-qc%2F0509037%2Cgr-qc%2F0509097%2Cgr-qc%2F0509013%2Cgr-qc%2F0509052%2Cgr-qc%2F0509059%2Cgr-qc%2F0509066%2Cgr-qc%2F0509034%2Cgr-qc%2F0509123%2Cgr-qc%2F0509067%2Cgr-qc%2F0509011%2Cgr-qc%2F0509111%2Cgr-qc%2F0509006%2Cgr-qc%2F0509043%2Cgr-qc%2F0509119%2Cgr-qc%2F0509033%2Cgr-qc%2F0509019%2Cgr-qc%2F0509125%2Cgr-qc%2F0509004%2Cgr-qc%2F0509007%2Cgr-qc%2F0509083%2Cgr-qc%2F0509120%2Cgr-qc%2F0509025%2Cgr-qc%2F0509126%2Cgr-qc%2F0509085%2Cgr-qc%2F0509001%2Cgr-qc%2F0509087%2Cgr-qc%2F0509100%2Cgr-qc%2F0509065%2Cgr-qc%2F0509050%2Cgr-qc%2F0509080%2Cgr-qc%2F0509008%2Cgr-qc%2F0509014%2Cgr-qc%2F0509099%2Cgr-qc%2F0509027%2Cgr-qc%2F0509079%2Cgr-qc%2F0509056%2Cgr-qc%2F0509053%2Cgr-qc%2F0509003%2Cgr-qc%2F0509026%2Cgr-qc%2F0509078%2Cgr-qc%2F0509118%2Cgr-qc%2F0509021%2Cgr-qc%2F0509128%2Cgr-qc%2F0509108%2Cgr-qc%2F0509103%2Cgr-qc%2F0509015%2Cgr-qc%2F0509070%2Cgr-qc%2F0509009%2Cgr-qc%2F0509040%2Cgr-qc%2F0509049%2Cgr-qc%2F0509088%2Cgr-qc%2F0509046%2Cgr-qc%2F0509018%2Cgr-qc%2F0509093%2Cgr-qc%2F0509109%2Cgr-qc%2F0509117%2Cgr-qc%2F0509075%2Cgr-qc%2F0509036&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study a two-level atom in interaction with a real massless scalar quantum\nfield in a spacetime with a reflecting boundary. The presence of the boundary\nmodifies the quantum fluctuations of the scalar field, which in turn modifies\nthe radiative properties of atoms. We calculate the rate of change of the mean\natomic energy of the atom for both inertial motion and uniform acceleration. It\nis found that the modifications induced by the presence of a boundary make the\nspontaneous radiation rate of an excited inertial atom to oscillate near the\nboundary and this oscillatory behavior may offer a possible opportunity for\nexperimental tests for geometrical (boundary) effects in flat spacetime. While\nfor accelerated atoms, the transitions from ground states to excited states are\nfound to be possible even in vacuum due to changes in the vacuum fluctuations\ninduced by both the presence of the boundary and the acceleration of atoms, and\nthis can be regarded as an actual physical process underlying the Unruh effect."}, "authors": ["Hongwei Yu", "Shizhuan Lu"], "author_detail": {"name": "Shizhuan Lu"}, "author": "Shizhuan Lu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.72.064022", "rel": "related", "type": "text/html"}, {"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.73.109901", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0509053v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0509053v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "A few typographical errors corrected", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0509053v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0509053v2", "journal_reference": "Phys.Rev.D72:064022,2005; Erratum-ibid.D73:109901,2006", "doi": "10.1103/PhysRevD.72.064022 10.1103/PhysRevD.73.109901", "fulltext": "Spontaneous excitation of an accelerated atom\nin a spacetime with a reflecting plane boundary\nHongwei Yu\nCCAST(World Lab.), P. O. Box 8730, Beijing, 100080,\nP. R. China and Department of Physics and Institute of Physics,\n\narXiv:gr-qc/0509053v2 27 Apr 2006\n\nHunan Normal University, Changsha, Hunan 410081, China∗\nShizhuan Lu\nDepartment of Physics and Institute of Physics,\nHunan Normal University, Changsha, Hunan 410081, China\n\nAbstract\nWe study a two-level atom in interaction with a real massless scalar quantum field in a spacetime\nwith a reflecting boundary. The presence of the boundary modifies the quantum fluctuations of\nthe scalar field, which in turn modifies the radiative properties of atoms. We calculate the rate of\nchange of the mean atomic energy of the atom for both inertial motion and uniform acceleration.\nIt is found that the modifications induced by the presence of a boundary make the spontaneous\nradiation rate of an excited inertial atom to oscillate near the boundary and this oscillatory behavior\nmay offer a possible opportunity for experimental tests for geometrical (boundary) effects in flat\nspacetime. While for accelerated atoms, the transitions from ground states to excited states are\nfound to be possible even in vacuum due to changes in the vacuum fluctuations induced by both\nthe presence of the boundary and the acceleration of atoms, and this can be regarded as an actual\nphysical process underlying the Unruh effect.\nPACS numbers: 04.62.+v, 42.50.Lc,\n\n∗\n\nMailing address\n\n1\n\n\fI.\n\nINTRODUCTION\n\nSpontaneous emission is one of the most important features of atoms and so far mechanisms such as vacuum fluctuations [1, 2], radiation reaction [3], or a combination of them\n[4] have been put forward to explain why spontaneous emission occurs. The ambiguity in\nphysical interpretation arises from different choices of ordering of commuting operators of\natom and field in a Heisenberg picture approach to the problem. Significant progress has\nbeen made by Dalibard, Dupont-Roc and CohenTannoudji(DDC), who argued in Ref.[5]\nand Ref.[6] that there exists a symmetric operator ordering that the distinct contributions\nof vacuum fluctuations and radiation reaction to the rate of change of an atomic observable\nare separately Hermitian. If one demands such a ordering, each contribution can possess\nan independent physical meaning. The DDC prescription resolves the problem of stability for ground-state atoms when only radiation reaction is considered and the problem of\n\"spontaneous absorption\" of atoms when only vacuum fluctuations are taken into account.\nUsing this prescription one can show that for ground-state atoms, the contributions of vacuum fluctuations and radiation reaction to the rate of change of the mean excitation energy\ncancel exactly and this cancellation forbids any transitions from the ground state and thus\nensures atom's stability. While for any initial excited state, the rate of change of atomic\nenergy acquires equal contributions from vacuum fluctuations and from radiation reaction.\nRecently, Audretsch, Müeller and Holzmann [7, 8, 9] have generalized the formalism of\nDDC [6] to evaluate vacuum fluctuations and radiation reaction contributions to the spontaneous excitation rate and radiative energy shifts of an accelerated two-level atom interacting\nwith a scalar field in a unbounded Minkowski space. In particular, their results show that\nwhen an atom is accelerated, then the delicate balance between vacuum fluctuations and radiation reaction is altered since the contribution of vacuum fluctuations to the rate of change\nof the mean excitation energy is modified while that of the radiation reaction remains the\nsame. Thus transitions to excited states for ground-state atoms become possible even in\nvacuum. This result not only is consistent with the Unruh effect [10], but also provides\na physically appealing interpretation of it. The Unruh effect, which is closely related to\nthe Hawking radiation of black holes, predicts that a linearly accelerated two-level particle\ndetector becomes excited when moving through the Minkowski vacuum and it behaves as if\nit were immersed (inertial) in a bath of thermal radiation at the Unruh temperature proportional to its acceleration, when coupling with massless scalar fields is considered. However,\nit is worth noting that the equality between the behavior of uniformly accelerated two-level\nparticle detectors coupled with massless scalar fields and the inertial detectors lying at rest\nin a thermal bath may not be valid in general when the massless scalar field is replaced\nby other fields [11]. Let us illustrate this as follows. Couple an Unruh-DeWitt detector\n(two-level monopole) with energy gap ∆E to a massive scalar field with mass m > ∆E.\nThe excitation per proper time of this detector when it is uniformly accelerated with proper\n\n2\n\n\facceleration a =constant) goes for ∆E << m as\nP/T ∼ a\n\nZ\n\n0\n\n∞\n\nq\n\ndxxK02 [ x2 + (m/a)2 ] ,\n\n(1)\n\nwhere Kν (z) is a Bessel function of imaginary argument. This is clearly non-vanishing\nbecause the external agent is making work on the detector. On the other hand, the same\ndetector lying inertial(!) at rest in a thermal bath with temperature T = a/2π is unable\nto excite because ∆E < m ≤ ω, where ω is the energy of the massive scalar particles.\nOf course, this fact does not challenge by any means the Unruh effect because what the\nUnruh effect does state is that Eq. (1) can be recovered by using Fulling's quantization in\nconjunction with the fact that the Minkowski vacuum is a thermal state of Rindler particles\n[11].\nIn this sense, the Unruh effect is intrinsically related to the effects of modified vacuum\nfluctuations induced by the acceleration of the atom (or detector) in question. On the other\nhand, however, It is well-known that the presence of boundaries in a flat spacetime also\nmodifies the vacuum fluctuations of quantum fields, and it has been demonstrated that this\nmodification (or changes) in vacuum fluctuations can lead to a lot of novel effects, such as\nthe Casimir effect [12], the light-cone fluctuations when gravity is quantized [13, 14, 15, 16],\nand the Brownian (random) motion of test particles in electromagnetic vacuum [17, 18],\njust to name a few. Therefore, it remains interesting to see what happens to the radiation\nproperties of accelerated atoms found in Ref.[7] when the vacuum fluctuations are further\nmodified by the presence of boundaries. In this paper, following the formalism developed by\nAudretsch and Müller[7], we will calculate the effects of modified vacuum fluctuations and\nradiation reaction due to the presence of a reflecting plane boundary upon the spontaneous\nexcitation of both an inertial and a uniformly accelerated atom interacting with a quantized\nreal massless scalar field. Let us note here that the response rate of a uniformly accelerated\nsource interacting with a massless real scalar field in the presence of boundaries has recently\nbeen discussed [19].\nThe paper is organized as follows, we will review the formalism developed in Refs. [7]\nin Sec. II, then apply it to the case of an inertial atom in Sec. III and to the case of an\naccelerated atom in Sec. IV. Finally we will conclude with some discussions in Sec. V\n\nII.\n\nTHE GENERAL FORMALISM FOR VACUUM FLUCTUATIONS AND RA-\n\nDIATION REACTION\n\nTo study how the spontaneous emission of atoms is modified by the presence of a reflecting\nplane boundary, we examine a simple case: a two-level atom in interaction with a real\nmassless scalar quantum field which obeys the Dirichlet boundary condition φ(x)|z=0 = 0.\nHere we have assumed that the reflecting plane boundary is located at z = 0 in space. Let\nus consider a pointlike two-level atom on a stationary space-time trajectory x(τ ), where τ\n3\n\n\fdenotes the proper time on the trajectory. The stationary trajectory guarantees the existence\nof stationary atomic states, |+i and |−i, with energies ± 12 ω0 and a level spacing ω0 . The\natom's Hamiltonian which controls the time evolution with respect to τ is given, in Dicke's\nnotation [20], by\nHA (τ ) = ω0 R3 (τ ),\n(2)\nwhere R3 = 21 |+ih+| − 21 |−ih−| is the pseudospin operator commonly used in the description\nof two-level atoms[20]. The free Hamiltonian of the scalar quantum field that governs its\ntime evolution with respect to τ is\nHF (τ ) =\n\nZ\n\nd3 k ω~k a~†k a~k\n\ndt\n.\ndτ\n\n(3)\n\nHere a~†k , a~k are the creation and annihilation operators with momentum ~k. Following Ref.\n[7], we assume that the interaction between the atom and the quantum field is described by\na Hamiltonian\nHI (τ ) = μR2 (τ )φ(x(τ )),\n(4)\nwhere μ is a coupling constant which we assume to be small, R2 = 21 i(R− − R+ ), and\nR+ = |+ih−|, R− = |−ih+|. The coupling is effective only on the trajectory x(τ ) of the\natom.\nWe can now write down the Heisenberg equations of motion for the atom and field observables. The field is always considered to be in its vacuum state |0i. We will separately discuss\nthe two physical mechanisms that contribute to the rate of change of atomic observables: the\ncontribution of vacuum fluctuations and that of radiation reaction. For this purpose, we can\nsplit the solution of field φ of the Heisenberg equations into two parts: a free or vacuum part\nφf , which is present even in the absence of coupling, and a source part φs , which represents\nthe field generated by the interaction between the atom and the field. Following DDC[5, 6],\nwe choose a symmetric ordering between atom and field variables and consider the effects of\nφf and φs separately in the Heisenberg equations of an arbitrary atomic observable G. Then,\nwe obtain the individual contributions of vacuum fluctuations and radiation reaction to the\nrate of change of G. Since we are interested in the spontaneous emission of the atom, we will\nconcentrate on the mean atomic excitation energy hHA (τ )i. The contributions of vacuum\nfluctuations(vf) and radiation reaction(rr) to the rate of change of hHA i can be written as\n( cf. Ref.[5, 6, 7] )\n*\n\n+\n\ndHA (τ )\ndτ\n\n*\n\ndHA (τ )\ndτ\n\n= 2iμ2\n\nZ\n\n= 2iμ2\n\nZ\n\nvf\n\n+\n\nrr\n\nτ\nτ0\nτ\nτ0\n\nd A\nχ (τ, τ ′ ),\ndτ\n\n(5)\n\nd A\nC (τ, τ ′ ),\ndτ\n\n(6)\n\ndτ ′ C F (x(τ ), x(τ ′ ))\ndτ ′ χF (x(τ ), x(τ ′ ))\n\nwith |i = |a, 0i representing the atom in the state |ai and the field in the vacuum state |0i.\nHere the statistical functions of the atom, C A (τ, τ ′ ) and χA (τ, τ ′ ), are defined as\nC A (τ, τ ′ ) =\n\n1\nha|{R2f (τ ), R2f (τ ′ )}|ai,\n2\n4\n\n(7)\n\n\f1\nha|[R2f (τ ), R2f (τ ′ )]|ai\n2\n\nχA (τ, τ ′ ) =\n\n(8)\n\nand those of the field are\n1\nh0|{φf (x(τ )), φf (x(τ ′ ))}|0i,\n2\n1\nF\n′\nχ (x(τ ), x(τ )) = h0|[φf (x(τ )), φf (x(τ ′ ))]|0i.\n2\n\nC F (x(τ ), x(τ ′ )) =\n\n(9)\n(10)\n\nC A is called the symmetric correlation function of the atom in the state |ai, χA its linear susceptibility. C F and χF are the Hadamard function and Pauli-Jordan or Schwinger function\nof the field respectively.\nThe explicit forms of the statistical functions of the atom are given by\n\u0011\n\u0010\n1X\n′\n′\n|ha|R2f (0)|bi|2 eiωab (τ −τ ) + e−iωab (τ −τ ) ,\n2 b\n\u0011\n\u0010\n1X\n′\n′\n|ha|R2f (0)|bi|2 eiωab (τ −τ ) − e−iωab (τ −τ ) ,\nχA (τ, τ ′ ) =\n2 b\n\nC A (τ, τ ′ ) =\n\n(11)\n(12)\n\nwhere ωab = ωa − ωb and the sum runs over a complete set of atomic states. Using the\nmethod of images, at a distance z from the boundary, the statistical functions of the field\ncan be written as\n1\n1\n1\n−\n−\nC (x(τ ), x(τ )) =\n2\n2\n2\n8π\n(∆t + iǫ) − |∆~x|\n(∆t − iǫ)2 − |∆~x|2\n1\n+\n(∆t + iǫ)2 − [(x − x′ )2 + (y − y ′)2 + (z + z ′ )2 ]\n\u001b\n1\n+\n,\n(∆t − iǫ)2 − [(x − x′ )2 + (y − y ′)2 + (z + z ′ )2 ]\ni\nǫ(∆t){δ(∆t2 − ((x − x′ )2 + (y − y ′ )2 + (z + z ′ )2 ))\nχF (x(τ ), x(τ ′ )) =\n4π\n−δ(∆t2 − |∆~x|2 )},\nF\n\n′\n\n\u001a\n\n(13)\n\n(14)\n\nwhere ∆t = t(τ ) − t(τ ′ ), ∆~x = ~x(τ ) − ~x(τ ′ ), and\nǫ(∆t) =\n\n(\n\n+1\n\nf or\n\n∆t > 0\n\n−1\n\nf or\n\n∆t < 0\n\n(15)\n\nis the sign function.\n\nIII.\n\nSPONTANEOUS EMISSION FROM A UNIFORMLY MOVING ATOM\n\nIn the present Section, we apply the formalism given in the proceeding Section to study\nthe spontaneous emission of an inertial atom in the presence of a reflecting plane boundary.\n5\n\n\fFor an inertial atom moving in the x-direction with a constant velocity v at a distance z\nfrom the plane, one has\nt(τ ) = γτ,\n\nx(τ ) = x0 + vγτ,\n\ny(τ ) = y0 ,\n\nz(τ ) = z\n\n(16)\n\n1\n\nwhere γ = (1 − v 2 )− 2 . From the general forms Eq.(13) and Eq.(14), we can easily obtain\nthe statistical functions of the field\n\u0012\n1\n1\n1\nF\n′\nC (x(τ ), x(τ )) = − 2\n−\n′\n2\n′\n8π (τ − τ + iǫ)\n(τ − τ + iǫ)2 − 4z 2\n\u0013\n1\n1\n+\n,\n(17)\n−\n(τ − τ ′ − iǫ)2 (τ − τ ′ − iǫ)2 − 4z 2\ni\n(18)\nχF (x(τ ), x(τ ′ )) = − ǫ(γ(τ − τ ′ )){δ((τ − τ ′ )2 ) − δ((τ − τ ′ )2 − 4z 2 )}.\n4π\nWe can now evaluate Eq.(5) and Eq.(6) using the statistical functions given above, With\na substitution u = τ − τ ′ , we get, for the contribution of the vacuum fluctuations to the rate\nof change of atomic excitation energy,\n*\n\ndHA (τ )\ndτ\n\n+\n\nvf\n\n+∞\nμ2 X\n1\n1\nf\n2\n=\n+\ndu\nω\n|ha|R\n(0)|bi|\nab\n2\n2\n2\n8π b\n(u + iǫ)\n(u − iǫ)2\n−∞\n\u0013\n1\n1\n−\neiωab u , (19)\n−\n(u − 2z + iǫ)(u + 2z + iǫ) (u − 2z − iǫ)(u − 2z − iǫ)\n\nZ\n\n\u0012\n\nand for that of radiation reaction\n*\n\ndHA (τ )\ndτ\n\n+\n\nrr\n\n\u001a Z +∞\nμ2 X\nδ(u) iωab u\nf\n2\n= i\ne\ndu\nωab |ha|R2 (0)|bi|\n4π b\nu\n−∞\n\nǫ(γu)\n[δ(u + 2z) + δ(u − 2z)]eiωab u\n4z\n0\n\u001b\nZ 0\nǫ(−γu)\niωab u\n,\n[δ(−u + 2z) − δ(−u − 2z)]e\n+\ndu\n4z\n−∞\n\n−\n\nZ\n\n∞\n\ndu\n\n(20)\n\nwhere we have extended the range of integration to infinity for sufficiently long times τ − τ0 .\nThe integrals in Eq (19) and Eq (20) can be evaluated via the residue theorem to get\n*\n\ndHA (τ )\ndτ\n\n+\n\nvf\n\n\u0015\n\u0014\nμ2 X\nωab\nf\n2 1 2\n= −\nω −\nsin(2zωab )\n|ha|R2 (0)|bi|\n2π ωa >ωb\n2 ab\n4z\n\n1 2\nωab\nμ2 X\n|ha|R2f (0)|bi|2 ωab\n−\nsin(2zωab ) ,\n+\n2π ωa <ωb\n2\n4z\n\u0014\n\n\u0015\n\n(21)\n\nfor the contribution of vacuum fluctuation to the rate of change of the atomic excitation\nenergy and\n*\n\ndHA (τ )\ndτ\n\n+\n\nrr\n\n\u0015\n\u0014\nμ2 X\nωab\nf\n2 1 2\n= −\nω −\nsin(2zωab )\n|ha|R2 (0)|bi|\n2π ωa >ωb\n2 ab\n4z\n\n\u0014\n\u0015\nμ2 X\nωab\nf\n2 1 2\n−\n|ha|R2 (0)|bi|\nω −\nsin(2zωab ) .\n2π ωa <ωb\n2 ab\n4z\n\n6\n\n(22)\n\n\ffor that of radiation reaction\nA few comments are now in order here. One can see from Eq. (21) that for an atom\ninitially\nin the\nE excited state (|ai = |+i), only the first term (ωa > ωb ) contributes and one\nD\ndHA (τ )\n< 0. While for an atom initially in the ground state (|ai = |−i), only the\nhas\ndτ\nvf\n\nD\n\nE\n\n*\n\n+\n\nA (τ )\nsecond term survives (ωa > ωb ) and so dHdτ\n> 0. Therefore, if only contributions of\nvf\nvacuum fluctuations are considered, both spontaneous excitation and de-excitation would\nequally occur. This leads to the well-known problem of spontaneous absorption for a ground\nstate atom in vacuum. On the other\nD hand,\nE Eq. (22) shows that radiation reaction always\ndHA (τ )\nmakes the atom to lose energy since\n< 0, no matter if it is in the ground or excited\ndτ\nrr\nstate. This leads to a problem similar to the instability of atoms in classical electrodynamics.\nHowever, by adding the contributions of vacuum fluctuations and radiation reaction, we\nobtain the total rate of change of the atomic excitation energy\n\n*\n\ndHA\ndτ\n\n+\n\n=\ntot\n\n*\n\ndHA\ndτ\n\n+\n\nvf\n\ndHA\n+\ndτ\n\n2\n\nμ\n= −\n2π\n\nX\n\nrr\n\n2\n|ha|R2f (0)|bi|2(ωab\n\nωa >ωb\n\n!\n\nωab\n−\nsin(2zωab )) .\n2z\n\n(23)\n\nIt follows that for an atom in the DgroundEstate (ωa < ωb ), the effects of both contributions\nA (τ )\nis canceled exactly by the corresponding term\nexactly cancel, since each term in dHdτ\nvf\n\nD\n\nE\n\nA (τ )\nin dHdτ\n. Therefore, the presence of a plane boundary conspires to modify the vacuum\nrr\nfluctuations and radiation reaction in such a way that the delicate balance between the\nvacuum fluctuations and radiation reaction found in Ref. [7] in absence of boundaries remains\nand this ensures the stability of ground-state inertial atoms in vacuum with a reflecting\nboundary.\n\nEq. (23) gives the radiation rate of an excited atom. The corrections induced by the\npresence of the boundary are represented by z dependent terms in all the above results and\nthey are oscillating functions of z and ωab . Let us note first that corrections only change\nthe rate of change of atomic energy quantitatively but not qualitatively since we always\n2\nhave ωab\n− ω2zab sin(2zωab ) ≥ 0. Secondly, as z, distance of the atom from the boundary,\napproaches infinity, our results reduce to those of the unbounded Minkowski space [7] as\nexpected. Thirdly, for a given atom, the radiation rate is a function of z and it could either\nbe enhanced or be weakened as compared with the case without any boundary, depending on\nthe atom's distance to the plane boundary. Finally, the radiation rate becomes zero, as the\natom is placed closer and closer to the boundary. This can be understood as a result of the\nfact that the scalar field vanishes on the boundary and so does the interaction Hamiltonian\nEq.(4).\nLet us now calculate the Einstein A coefficient for the spontaneous emission of inertially\nmoving atoms in the presence of the boundary. For this purpose, following Ref. [7], we can\n\n7\n\n\fobtain a differential equation for the atomic excitation energy in order μ2 ,\n*\n\ndHA (τ )\ndτ\n\n+\n\ntot\n\nμ2\n1\n= − ω0\nω0 + hHA (τ )i\n8π\n2\n\u0012\n\n\u0013\n\n!\n\nsin(2zω0 )\n.\n1−\n2zω0\n\n(24)\n\nThe solution of (24) is\n1\n1\nhHA (τ )i = − ω0 + hHA (0)i + ω0 e−Aτ ,\n2\n2\n\u0012\n\n\u0013\n\n(25)\n\nthe familiar exponential decay to the atomic ground state hHA i = − 12 ω0 . The spontaneous\nemission rate is given by the Einstein A coefficient of the scalar theory:\nμ2\nsin(2zω0 )\nA=\n.\nω0 1 −\n8π\n2zω0\n!\n\n(26)\n\nWe see once again that the rate of spontaneous emission is modified by the presence of the\nboundary and the Einstein coefficient is function of z for a given atom.\n\nIV.\n\nUNIFORMLY ACCELERATED ATOM\n\nLet us now turn to the case in which the atom is uniformly accelerated in a direction\nparallel to the reflecting plane boundary. We assume that the atom is at a distance z\nfrom the boundary and is being accelerated in the x direction with a proper acceleration a.\nSpecifically, the atom's trajectory is described by\nt(τ ) =\n\n1\nsinh aτ,\na\n\nx(τ ) =\n\n1\ncosh aτ,\na\n\nz(τ ) = z,\n\ny(τ ) = 0 .\n\n(27)\n\nThe statistical functions of the field for the trajectory Eq. (27) can be evaluated from their\ngeneral forms Eq. (13) and Eq. (14). After some calculations, we obtain\na2\n1\n1\n+\n2\n2\na\na\n32π 2 sinh [ 2 (τ − τ ′ ) + iǫ] sinh [ 2 (τ − τ ′ ) − iǫ]\n\u0013\n1\n1\n−\n−\nsinh2 [ a2 (τ − τ ′ ) + iǫ] − (az)2 sinh2 [ a2 (τ − τ ′ ) − iǫ] − (az)2\n(28)\n\u0012\na\ni\nδ(τ − τ ′ )\nχF (x(τ ), x(τ ′ )) = −\na\n′\n8π sinh 2 (τ − τ )\n1\n2\n− q\nδ(τ − τ ′ − sinh−1 (az))\na\n2 1 + (az)2\n\nC F (x(τ ), x(τ ′ )) = −\n\n\u0012\n\n2\nδ(τ − τ + sinh−1 (az)) .\n+ q\na\n2 1 + (az)2\n1\n\n′\n\n8\n\n\u0013\n\n(29)\n\n\fWith the help of the following integral, which can be readily evaluated by residues,\nZ\n\n∞\n\n\u0012\n\n−∞\n\n=\n\n1\n1\n+\n2 a\n2 a\n2\nsinh ( 2 u + iǫ) − (az)\nsinh ( 2 u − iǫ) − (az)2\n\n\u0012\n\n1+\n\n−1\n\n2\ne2π|ωab |/a − 1\n\n\u0013\n\n4π sin( 2ωab sinh\na\n\n(az)\n\n)\n\nq\n\na2 z 1 + (az)2\n\n\u0013\n\neiωab u du\n\n,\n\n(30)\n\nwe can calculate the contribution of vacuum fluctuation to the rate of change of the atomic\nexcitation energy to get\n*\n\ndHA (τ )\ndτ\n\n+\n\nvf\n\nμ2\n= −\n2π\n−\n\n\"\n\nX\n\n2\nωab\n|ha|R2f (0)|bi|2\n\nf (ωab , a, z)\n\nωa >ωb\n\nX\n\n2\nωab\n|ha|R2f (0)|bi|2 f (ωab , a, z)\n\nωa <ωb\n\n!\n\n1\n1\n+ 2π ω\n2 e a ab − 1\n!#\n1\n\n1\n+\n2 e 2πa |ωab| − 1\n\n,\n(31)\n\nwhere\n2ωab z sinh−1 (az)\nq\nf (ωab , a, z) = 1 −\nsin\naz\n2ωab z 1 + (az)2\n1\n\n!\n\n.\n\n(32)\n\nComparing the above result with Eq. (56) of Ref. [7], one can see that the function f (ωab , a, z)\ngives the modification induced by the presence of the boundary. When z → ∞, the function\nf (ωab , a, z) approaches 1 and we recover the result obtained in Ref. [7] for a uniformly\naccelerated atom in a unbounded Minkowski space as expected. On the other hand, if\n(az) → 0, one has\nf (ωab , a, z) ≈ 1 −\n\nsin(2ωab z)\n.\n2ωab z\n\n(33)\n\nLet us note that (az) → 0 can be fulfilled either by keeping a at fixed finite value and letting z\napproach zero or keeping z fixed and letting a go zero. For the former case, f (ωab , a, z) ≈ 0.\nThis reveals that as the atom gets closer and closer to the boundary the contribution of\nthe vacuum fluctuations to the rate of change of the atomic excitation energy dies off in\nan oscillatory manner, no matter if the atom is in inertial motion (refer to Eq. (21)) or is\naccelerated as long as the proper accelerated is finite. While for the latter case, plugging\nEq. (33) into Eq. (31), one recovers the result for an inertially moving atom, i.e., Eq. (21).\nSimilarly, one has for the contribution of radiation reaction,\n*\n\ndHA (τ )\ndτ\n\n+\n\n= −\nrr\n\n\u0014\nμ2 X\nωab\n1 2\n|ha|R2f (0)|bi|2 ωab\n− q\n2π ωa >ωb\n2\n4z 1 + (az)2\n\n2ωab z sinh−1 (az)\n× sin\naz\n\u0012\n\n\u0013\u0015\n\n−\n\nμ2 X\n|ha|R2f (0)|bi|2\n2π ωa <ωb\n\nωab\n2ωab z sinh−1 (az)\n1 2\n− q\nsin\n× ωab\n2\naz\n4z 1 + (az)2\n\u0012\n\n\u0014\n\n9\n\n\u0013\u0015\n\n.\n\n(34)\n\n\fThe above result reduces to that of an inertially moving atom, i.e., Eq. (22), when a goes to\nzero and it vanishes if the boundary is approached. However, the most distinct feature with\nthe presence of a boundary is that the contribution of radiation reaction now depends on the\nacceleration of the atom, in sharp contrast to the unbounded Minkowski space where it has\nbeen shown that for accelerated atoms on arbitrary stationary trajectory, the contribution\nof radiation reaction is generally not altered from its inertial value [9].\nAdding up the two contributions, one finds the total rate of change of the atomic excitation energy\n\n*\n\ndHA\ndτ\n\n+\n\n=\ntot\n\nX\nμ2\n2\nωab\n|ha|R2f (0)|bi|2 f (ωab , a, z)\n−\n2π\nωa >ωb\n\"\n\n1+\n\n1\n2π\n\ne a ωab − 1\n#\nX\n1\nf\n2\n2\nωab |ha|R2 (0)|bi| f (ωab , a, z) 2π |ω |\n+\n.\ne a ab − 1\nωa <ωb\n\n!\n\n(35)\n\nFor an excited atom, only ωa > ωb contributes. One can see that the spontaneous emission\nis modified by the appearance of the thermal term as compared to an inertial atom near\na reflecting boundary on one hand, and modified by the appearance of f (ωab , a, z) when\ncompared to a uniformly accelerated atom in an unbounded Minkowski space on the other.\nHowever, for a ground-state atom, the delicate balance between the vacuum fluctuations and\nradiation reaction no longer exists, although both contributions of the vacuum fluctuations\nand radiation are altered for accelerated atoms in the presence of the boundary, as opposed\nto no change in the contribution of radiation reaction in absence of boundaries. There is a\npositive contribution from the ωa < ωb term, therefore transitions of ground-state atoms to\nexcited states are allowed to occur even in vacuum. The presence of the boundary modulates\nthe transition rate with the function f (ωab , a, z) and makes the rate a function of z, the atom\ndistance from the boundary. It is interesting to note that the spontaneous excitation rate of\naccelerated atoms (or the Unruh effect) becomes smaller and smaller as the atom is placed\ncloser and closer to the boundary, since f (ωab , a, z) approaches 0 as z → 0 for any finite\nvalue of a.\nNow we wan to evaluate the Einstein coefficient. In the present case, we have two competing spontaneous processes, i.e., the spontaneous excitation and de-excitation. Thus there\nare two Einstein coefficients A↓ and A↑ which describe the corresponding transition rates.\nConsider an ensemble of N atoms. Let N1 denote the number of atoms in the ground state,\nN2 the number in the excited state. The rate equations are given by\ndN1\ndN2\n=−\n= A↑ N1 − A↓ N2\ndτ\ndτ\nwith\nhHA i =\n\n1\n1\n1\n− ω0 N1 + ω0 N2 .\nN\n2\n2\n\u0012\n\n\u0013\n\n10\n\n(36)\n\n(37)\n\n\fThe solution of the above equations is\n!\n\n1\nA↑\n1\nA↑\nhHA (τ )i = − ω0 + ω0\n+ hHA (0)i + ω0 −\nω0 e−(A↑ +A↓ )τ .\n2\nA↑ + A↓\n2\nA↑ + A↓\n\n(38)\n\nOn the other hand, we can simplify Eq. (35) to obtain a differential equation for hHA i\n*\n\ndHA (τ )\ndτ\n\n+\n\nμ2\n1\n1\n1\n= − ω0\nω0 + f (ω0 , a, z)\n+ 2π ω\nhHA (τ )i\n4π\n4\n2 ea 0 −1\n!\n\n!\n\n,\n\n(39)\n\nthe solution of which gives the time evolution of the mean atomic excitation energy\n!\n\n1\n1\nω0\nω0\nhHA (τ )i = − ω0 + 2π ω\n.\n+ hHA (0)i + ω0 − 2π ω\n0\n2\n2\nea +1\nea 0 +1\n\"\n!\n#\nμ2\n1\n1\nexp − ω0\nf (ω0 , a, z)τ .\n+\n4π\n2 e 2πa ω0 − 1\n\n(40)\n\nThis indicates that the atom evolves with a modified decay parameter towards the equilibrium value\nω0\n1\n,\n(41)\nhHA i = − ω0 + 2π ω\n2\nea 0 +1\nrevealing a thermal excitation with temperature T = a/2π above the ground state. The + 1\nin the denominator of the second term suggests that the atom obeys Fermi-Dirac statistics in\nthermal equilibrium. This remarkable feature can be understood as a result of the fermionic\nnature of a two-level system (for example, the atomic raising and lowering operators obey\nthe anticommutation relation {R+ , R− } = 1).\nThe Einstein coefficients A↓ and A↑ for an accelerated atom near a reflecting plane boundary readily follows from (40) and (38),\n1\nμ2\nω0 1 + 2π ω\nA↓ =\nf (ω0 , a, z),\n8π\nea 0 −1\n!\n\nA↑ =\n\nf (ω0 , a, z)\nμ2\nω0 2π ω\n.\n8π\nea 0 −1\n\n(42)\n\nA comparison of the coefficient A↓ for spontaneous emission from an accelerated atom near\nthe plane boundary with the corresponding Einstein coefficients for an inertial atom near a\nplane boundary obtained in the last section and for an accelerated atom in an unbounded\nMinkowski space found in Ref. [7] shows that rate of spontaneous emission is enhanced by\nthe thermal contribution as compared to the inertial case with the presence of the boundary\nand is modulated by the function f (ω0 , a, z) as compared to the accelerating case in an unbounded flat space. Since f (ω0 , a, z) is an oscillating function, the spontaneous emission rate\ncan either be enhanced or weakened as compared to the case of an accelerated atom without\nthe presence of the boundary, depending on the value of f (ω0, a, z). At the meantime, it is\neasy to see that the transition rate A↑ for the spontaneous excitation is nonzero as long as\na 6= 0 or z 6= 0 and it vanishes as a → 0 as expected.\n\n11\n\n\fV.\n\nCONCLUSIONS\n\nIn conclusion, assuming a dipole like interaction between the atom and a scalar quantum\nfield, we have studied the spontaneous emission of a two-level atom in a space with a\nreflecting plane boundary and examined both the contributions of vacuum fluctuations and\nradiation reaction for both inertial motion and uniform acceleration following the method\ndeveloped in Refs. [5, 6, 7].\nIn the case of an inertial atom, our results show that for ground-state atoms, the contributions of vacuum fluctuations and radiation reaction to the rate of change of the mean\nexcitation energy hHA (τ )i cancel exactly and the cancellation ensures that there are no\nupward radiative transitions in vacuum. For any initial excited state, the rate of change\nof atomic energy acquires equal contributions from vacuum fluctuations and from radiation\nreaction regardless of the distance from the plane boundary (refer to Eq.(21) and Eq.(22)\n). Therefore, the presence of a plane boundary does not change the delicate balance between the effects of vacuum fluctuations and radiation reaction and these two different effects\nseem to be equally important both in the unbounded Minkowski space and the space a plane\nboundary. Although the corrections induced by the presence of a boundary does not change\nthe physical picture qualitatively, it does quantitatively. At distances far from the plane\n(zωab ≫ 1), the corrections become negligible as one would expect. It is interesting to note\nthat close to the plane(zωab ≪ 1), the corrections becomes so large that the total radiation\nrate of the atom diminishes to zero in a oscillatory manner as the boundary is approached.\nFinally, let us note that the oscillatory behavior of the spontaneous radiation rate of an\nexcited atom near a reflecting boundary may offer a possible opportunity for experimental\ntests for geometrical (boundary) effects in flat spacetime.\nIn the case of a uniformly accelerated atom, both contributions of the vacuum fluctuations\nand radiation reaction are altered by the presence of a reflecting plane boundary and the\ndelicate balance between these two contributions existing in the case of inertial ground-state\natoms is disturbed, making possible the spontaneous excitations from ground states. There\nare some interesting features to be noted as compared to the case without any boundary.\nFirst, the rate of change of the mean atomic excitation energy is now a function of the\ndistance to the boundary and it dies off in an oscillatory way the boundary is approached,\nand second, the contribution of radiation reaction is now dependent on the acceleration of\nthe atom, in sharp contrast to the unbounded Minkowski space where it has been shown\nthat for accelerated atoms on arbitrary stationary trajectory, the contribution of radiation\nreaction is generally not altered from its inertial value [9].\n\n12\n\n\fAcknowledgments\n\nThis work was supported in part by the National Natural Science Foundation of China\nunder Grant No. 10375023, the Program for NCET (No. 04-0784), the Key Project of\nChinese Ministry of Education (No. 205110), the Key Project of Hunan Provincial Education\nDepartment (No. 04A030) and the National Basic Research Program of China under Grant\nNo. 2003CB71630.\n\n[1] T. A. Welton, Phys. Rev. 74, 1157(1948).\n[2] G. Compagno, R. Passante and F. Persico, Phys. Lett. A 98,253(1983).\n[3] J. R. Ackerhalt, P. L. Knight and J. H. Eberly, Phys. Rev. Lett. 30, 456(1973).\n[4] P. W. Milonni, Phys. Scr. T21, 102(1988); P. W. Milonni and W. A. Smith, Phys. Rev. A 11,\n814(1975).\n[5] J. Dalibard, J. Dupont-Roc and C. Cohen-Tannodji, J. Physsique43, 1617(1982).\n[6] J. Dalibard, J. Dupont-Roc and C. Cohen-Tannodji, J. Physsique 45, 637(1984).\n[7] J. Audretsch and R. Müller, Phys. Rev. A 50, 1755(1994).\n[8] J. Audretsch and R. Müller, Phys. Rev. A 52, 629(1995).\n[9] J. Audretsch, R. Müller and M. Holzmann, Class. Quant. Grav. 12, 2927(1995).\n[10] W.G. Unruh, Phys. Rev. D 14, 870(1976).\n[11] See for example,D. A. T. Vanzella and G. E. A. Matsas, Phys. Rev. Lett. 87, 151301 (2001).\n[12] H. B. G. Casimir, Proc.K.Ned.Akad.Wet. 51, 793(1948).\n[13] H. Yu and L. H. Ford, Phys. Rev. D 60, 084023(1999).\n[14] H. Yu and L. H. Ford, Phys. Lett. B 496, 107(2000).\n[15] H. Yu and L. H. Ford, e-print gr-qc/0004063(2000).\n[16] H. Yu and P.X. Wu, Phys. Rev. D 68, 084019(2003).\n[17] H. Yu and L.H. Ford, Phys. Rev. D 70, 065009 (2004).\n[18] H. Yu and J. Chen, Phys. Rev. D 70, 125006(2004).\n[19] D. T. Alves and L. C. B. Crispino, Phys. Rev. D 70, 107703(2004).\n[20] R. H. Dicke Phys. Rev. 93, 99(1954).\n\n13\n\n\f"}