{"id": "http://arxiv.org/abs/gr-qc/0402009v2", "guidislink": true, "updated": "2004-02-26T07:26:23Z", "updated_parsed": [2004, 2, 26, 7, 26, 23, 3, 57, 0], "published": "2004-02-02T21:02:12Z", "published_parsed": [2004, 2, 2, 21, 2, 12, 0, 33, 0], "title": "A perspective on Quantum Gravity Phenomenology", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0112051%2Cgr-qc%2F0112043%2Cgr-qc%2F0112054%2Cgr-qc%2F0112077%2Cgr-qc%2F0112030%2Cgr-qc%2F0112013%2Cgr-qc%2F0112032%2Cgr-qc%2F0112005%2Cgr-qc%2F0112069%2Cgr-qc%2F0112028%2Cgr-qc%2F0112074%2Cgr-qc%2F0112058%2Cgr-qc%2F0112073%2Cgr-qc%2F0112066%2Cgr-qc%2F0112012%2Cgr-qc%2F0112064%2Cgr-qc%2F0112050%2Cgr-qc%2F0112044%2Cgr-qc%2F0112025%2Cgr-qc%2F0112059%2Cgr-qc%2F0112075%2Cgr-qc%2F0112002%2Cgr-qc%2F0112006%2Cgr-qc%2F0112007%2Cgr-qc%2F0112045%2Cgr-qc%2F0112010%2Cgr-qc%2F0112080%2Cgr-qc%2F0112021%2Cgr-qc%2F0112049%2Cgr-qc%2F0112055%2Cgr-qc%2F0112068%2Cgr-qc%2F0112056%2Cgr-qc%2F0112052%2Cgr-qc%2F0112072%2Cgr-qc%2F0112033%2Cgr-qc%2F0112041%2Cgr-qc%2F0112057%2Cgr-qc%2F0112022%2Cgr-qc%2F0112016%2Cgr-qc%2F0112053%2Cgr-qc%2F0112020%2Cgr-qc%2F0112011%2Cgr-qc%2F0112018%2Cgr-qc%2F0112040%2Cgr-qc%2F0112034%2Cgr-qc%2F0112046%2Cgr-qc%2F0112008%2Cgr-qc%2F0112029%2Cgr-qc%2F0112079%2Cgr-qc%2F0112063%2Cgr-qc%2F0112067%2Cgr-qc%2F0112037%2Cgr-qc%2F0112065%2Cgr-qc%2F0112048%2Cgr-qc%2F0402074%2Cgr-qc%2F0402097%2Cgr-qc%2F0402092%2Cgr-qc%2F0402045%2Cgr-qc%2F0402066%2Cgr-qc%2F0402083%2Cgr-qc%2F0402079%2Cgr-qc%2F0402075%2Cgr-qc%2F0402061%2Cgr-qc%2F0402117%2Cgr-qc%2F0402089%2Cgr-qc%2F0402058%2Cgr-qc%2F0402085%2Cgr-qc%2F0402099%2Cgr-qc%2F0402105%2Cgr-qc%2F0402062%2Cgr-qc%2F0402053%2Cgr-qc%2F0402009%2Cgr-qc%2F0402021%2Cgr-qc%2F0402023%2Cgr-qc%2F0402093%2Cgr-qc%2F0402123%2Cgr-qc%2F0402104%2Cgr-qc%2F0402039%2Cgr-qc%2F0402124%2Cgr-qc%2F0402100%2Cgr-qc%2F0402110%2Cgr-qc%2F0402030%2Cgr-qc%2F0402035%2Cgr-qc%2F0402025%2Cgr-qc%2F0402119%2Cgr-qc%2F0402026%2Cgr-qc%2F0402078%2Cgr-qc%2F0402034%2Cgr-qc%2F0402003%2Cgr-qc%2F0402018%2Cgr-qc%2F0402050%2Cgr-qc%2F0402125%2Cgr-qc%2F0402042%2Cgr-qc%2F0402001%2Cgr-qc%2F0402015%2Cgr-qc%2F0402014%2Cgr-qc%2F0402027%2Cgr-qc%2F0402080%2Cgr-qc%2F0402113%2Cgr-qc%2F0402077%2Cgr-qc%2F0402084&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A perspective on Quantum Gravity Phenomenology"}, "summary": "I give a brief overview of some Quantum-Gravity-Phenomenology research lines,\nfocusing on studies of cosmic rays and gamma-ray bursts that concern the fate\nof Lorentz symmetry in quantum spacetime. I also stress that the most valuable\nphenomenological analyses should not mix too many conjectured new features of\nquantum spacetime, and from this perspective it appears that it should be\ndifficult to obtain reliable guidance on the quantum-gravity problem from the\nanalysis of synchrotron radiation from the Crab nebula and from the analysis of\nphase coherence of light from extragalactic sources. Forthcoming observatories\nof ultra-high-energy neutrinos should provide several opportunities for clean\ntests of some simple hypothesis for the short-distance structure of spacetime.\nIn particular, these neutrino studies, and some related cosmic-ray studies,\nshould provide access to the regime $E>\\sqrt{m E_p}$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0112051%2Cgr-qc%2F0112043%2Cgr-qc%2F0112054%2Cgr-qc%2F0112077%2Cgr-qc%2F0112030%2Cgr-qc%2F0112013%2Cgr-qc%2F0112032%2Cgr-qc%2F0112005%2Cgr-qc%2F0112069%2Cgr-qc%2F0112028%2Cgr-qc%2F0112074%2Cgr-qc%2F0112058%2Cgr-qc%2F0112073%2Cgr-qc%2F0112066%2Cgr-qc%2F0112012%2Cgr-qc%2F0112064%2Cgr-qc%2F0112050%2Cgr-qc%2F0112044%2Cgr-qc%2F0112025%2Cgr-qc%2F0112059%2Cgr-qc%2F0112075%2Cgr-qc%2F0112002%2Cgr-qc%2F0112006%2Cgr-qc%2F0112007%2Cgr-qc%2F0112045%2Cgr-qc%2F0112010%2Cgr-qc%2F0112080%2Cgr-qc%2F0112021%2Cgr-qc%2F0112049%2Cgr-qc%2F0112055%2Cgr-qc%2F0112068%2Cgr-qc%2F0112056%2Cgr-qc%2F0112052%2Cgr-qc%2F0112072%2Cgr-qc%2F0112033%2Cgr-qc%2F0112041%2Cgr-qc%2F0112057%2Cgr-qc%2F0112022%2Cgr-qc%2F0112016%2Cgr-qc%2F0112053%2Cgr-qc%2F0112020%2Cgr-qc%2F0112011%2Cgr-qc%2F0112018%2Cgr-qc%2F0112040%2Cgr-qc%2F0112034%2Cgr-qc%2F0112046%2Cgr-qc%2F0112008%2Cgr-qc%2F0112029%2Cgr-qc%2F0112079%2Cgr-qc%2F0112063%2Cgr-qc%2F0112067%2Cgr-qc%2F0112037%2Cgr-qc%2F0112065%2Cgr-qc%2F0112048%2Cgr-qc%2F0402074%2Cgr-qc%2F0402097%2Cgr-qc%2F0402092%2Cgr-qc%2F0402045%2Cgr-qc%2F0402066%2Cgr-qc%2F0402083%2Cgr-qc%2F0402079%2Cgr-qc%2F0402075%2Cgr-qc%2F0402061%2Cgr-qc%2F0402117%2Cgr-qc%2F0402089%2Cgr-qc%2F0402058%2Cgr-qc%2F0402085%2Cgr-qc%2F0402099%2Cgr-qc%2F0402105%2Cgr-qc%2F0402062%2Cgr-qc%2F0402053%2Cgr-qc%2F0402009%2Cgr-qc%2F0402021%2Cgr-qc%2F0402023%2Cgr-qc%2F0402093%2Cgr-qc%2F0402123%2Cgr-qc%2F0402104%2Cgr-qc%2F0402039%2Cgr-qc%2F0402124%2Cgr-qc%2F0402100%2Cgr-qc%2F0402110%2Cgr-qc%2F0402030%2Cgr-qc%2F0402035%2Cgr-qc%2F0402025%2Cgr-qc%2F0402119%2Cgr-qc%2F0402026%2Cgr-qc%2F0402078%2Cgr-qc%2F0402034%2Cgr-qc%2F0402003%2Cgr-qc%2F0402018%2Cgr-qc%2F0402050%2Cgr-qc%2F0402125%2Cgr-qc%2F0402042%2Cgr-qc%2F0402001%2Cgr-qc%2F0402015%2Cgr-qc%2F0402014%2Cgr-qc%2F0402027%2Cgr-qc%2F0402080%2Cgr-qc%2F0402113%2Cgr-qc%2F0402077%2Cgr-qc%2F0402084&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I give a brief overview of some Quantum-Gravity-Phenomenology research lines,\nfocusing on studies of cosmic rays and gamma-ray bursts that concern the fate\nof Lorentz symmetry in quantum spacetime. I also stress that the most valuable\nphenomenological analyses should not mix too many conjectured new features of\nquantum spacetime, and from this perspective it appears that it should be\ndifficult to obtain reliable guidance on the quantum-gravity problem from the\nanalysis of synchrotron radiation from the Crab nebula and from the analysis of\nphase coherence of light from extragalactic sources. Forthcoming observatories\nof ultra-high-energy neutrinos should provide several opportunities for clean\ntests of some simple hypothesis for the short-distance structure of spacetime.\nIn particular, these neutrino studies, and some related cosmic-ray studies,\nshould provide access to the regime $E>\\sqrt{m E_p}$."}, "authors": ["Giovanni Amelino-Camelia"], "author_detail": {"name": "Giovanni Amelino-Camelia"}, "author": "Giovanni Amelino-Camelia", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/9789812704030_0015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0402009v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0402009v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, LaTex. These notes provided the basis for the ``summary\n  talk\" which I gave as chairman of the QG1 session (``Quantum Gravity\n  Phenomenology\") at the \"10th Marcel Grossmann Meeting on General Relativity\"\n  (Rio de Janeiro, July 20-26, 2003). V2: Additional remarks (especially on\n  synchrotron radiation) and additional references", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0402009v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0402009v2", "journal_reference": null, "doi": "10.1142/9789812704030_0015", "fulltext": "A perspective on Quantum Gravity Phenomenology1\n\narXiv:gr-qc/0402009v2 26 Feb 2004\n\na\n\nGiovanni Amelino-Camelia\nDipart. Fisica, Univ. Roma \"La Sapienza\" and INFN Sez. Roma1\nP.le Moro 2, 00185 Roma, Italy\n\nABSTRACT\nI give a brief overview of some Quantum-Gravity-Phenomenology research lines, focusing\non studies of cosmic rays and gamma-ray bursts that concern the fate of Lorentz symmetry\nin quantum spacetime. I also stress that the most valuable phenomenological analyses should\nnot mix too many conjectured new features of quantum spacetime, and from this perspective\nit appears that it should be difficult to obtain reliable guidance on the quantum-gravity\nproblem from the analysis of synchrotron radiation from the Crab nebula and from the\nanalysis of phase coherence of light from extragalactic sources. Forthcoming observatories\nof ultra-high-energy neutrinos should provide several opportunities for clean tests of some\nsimple hypothesis for the short-distance structure of spacetime. In particular, these neutrino\nq\nstudies, and some related cosmic-ray studies, should provide access to the regime E > mEp .\n\n1\n\nQuantum Gravity Phenomenology\n\nQuantum-gravity research used to be completely detached from experiments. The horrifying\nsmallness of the expected quantum-gravity effects, due to the overall suppression by powers\nof the ratio of the Planck length (Lp ∼ 10−35 m) versus the characteristic wavelength of the\nparticles involved in the process, had led to the conviction that experiments could never\npossibly help. But recently there has been a sharp change in the attitude of a significant\nfraction of the quantum-gravity community. This is reflected also by the tone of recent\nquantum-gravity reviews (see, e.g., Refs. [1, 2, 3, 4])] as compared to the tone of quantumgravity reviews published up to the mid 1990s (see, e.g., Ref. [5, 6]).\nThe fact that the smallness of an effect does not necessarily imply that it cannot be studied experimentally is not actually a new idea, and indeed it finds support in several examples\nin physics. Even remaining in the context of fundamental physics there is the noteworthy\nexample of studies of the prediction of proton decay within certain grandunified theories of\nparticle physics. The predicted proton-decay probability is really small, suppressed by the\nfourth power of the ratio between the mass of the proton and the grandunification scale\n[mproton /Egut ]4 ∼ 10−64 , but in spite of this truly horrifying suppression, with a simple idea\nwe have managed to acquire an excellent sensitivity to the new effect. The proton lifetime\n1\n\nThese notes provided the basis for the \"summary talk\" which I gave as chairman of the QG1 session\n(\"Quantum Gravity Phenomenology\") at the \"10th Marcel Grossmann Meeting on General Relativity\" (Rio\nde Janeiro, July 20-26, 2003).\n\n\fpredicted by grandunified theories is of order 1039 s and \"quite a few\" generations of physicists should invest their entire lifetimes staring at a single proton before its decay, but by\nmanaging to keep under observation a large number of protons our sensitivity to proton\ndecay is dramatically increased.\nWe should therefore focus our attention[7] on experiments which have something to\ndo with spacetime and such that there is an ordinary-physics dimensionless quantity large\nenough that it could amplify the extremely small effects we are hoping to discover. Over\nthese past few years several new ideas for tests of Planck-scale effects have appeared at\nan increasingly fast pace, with a growing number of research groups joining the quantumgravity-phenomenology effort.\nAmong the quantum-gravity-phenomenology research lines the one which has been so far\nmost extensively developed concerns the investigation of the fate of Lorentz symmetry in\nquantum gravity. The relevant proposals of Lorentz-symmetry tests focus primarily on the\nimplications of Planck-scale effects for the analysis of gamma-ray bursts[8, 9], the possible\nrole of the Planck scale in the determination of the energy-momentum-conservation threshold\nconditions for certain particle-physics reaction processes[10, 11, 12, 13, 14, 15], and the\npossible role of the Planck scale in the evaluation of particle-decay amplitudes[16, 17].\nAnother key area of interest for quantum-gravity phenomenology is the one of interferometry. Possible signatures of Planck-scale physics have been considered for matter\ninterferometers[18], for large \"free-mirror\" laser-light interferometers[19, 20], and for smallsize laser-light interferometers whose mirrors are rigidly connected[21]. Moreover, there is\na long-term research programme which focuses on possible Planck-scale-induced departures\nfrom CPT symmetry[22, 23, 24, 25, 26]. And together with these most developed quantumgravity-phenomenology research lines several other proposals are being considered by small\nnetworks of research groups.\nRather than attempting a comprehensive review, in Section 2 I will use the example of\ncertain tests of Lorentz symmetry to illustrate the general structure of a quantum-gravityphenomenology research line. The discussion of gamma-ray bursts and ultra-high-energy\ncosmic rays that I present in Section 2 focuses on finding a direct link between one or two\nsimple hypotheses about new properties of quantum spacetime and certain characteristic\nnew effects. I will argue that this conservative strategy, in which the analysis does not\nmix too many simultaneous assumptions about the structure of spacetime at the Planck\nscale, can provide valuable insight on the quantum-gravity problem. In Section 3 I consider\ncertain types of observations which represent tempting opportunities to speculate about\npossible implications of quantum properties of spacetime, but require us to combine several\nassumptions about the structure of spacetime at the Planck scale, and I argue that in these\ncases it might be hard to obtain reliable guidance on the quantum-gravity problem. In\nthe closing section (Section 4) I comment on forthcoming UHE (ultra-high-energy) neutrino\nobservatories, as one of our best chances, for the near future, of enriching significantly\nthe type of data used in Quantum Gravity Phenomenology. And I will stress that the\nrelevant UHE neutrinos, just like the UHE cosmic rays considered in Section 2, can give us\naccess to a \"Planck-scale ultrarelativistic regime\", in which the ratio E/m (energy versus\nmass of the particle) is larger than the ratio Ep /E, where Ep is the Planck energy scale\n(Ep ≡ 1/Lp ∼ 1028 eV ).\n\n\f2\n\nThe fate of Lorentz symmetry in quantum spacetime\n\nModels based on an approximate Lorentz symmetry, with Planck-scale-dependent departures from exact Lorentz symmetry, have been recently considered in most quantum-gravity\nresearch lines, including models based on \"spacetime foam\" pictures[8, 27], \"loop quantum gravity\" models[28], certain \"string theory\" scenarios[29, 30], and \"noncommutative\ngeometry\"[29, 31, 32].\nThe most studied characterization of these Planck-scale departures from Lorentz symmetry assumes that the energy/momentum dispersion relations for fundamental particles2\nshould be modified\n0 = f (E, ~p2, m; Ep ) ≃ E 2 − p~2 − m2 − η\n\nEn 2\np~ ,\nEpn\n\n(1)\n\nwhere the power n parametrizes one of the possible differences between alternative quantum\npictures of spacetime (with the cases n = 1 and n = 2 usually favoured in the literature), and\nessentially η parametrizes the precise value of the scale of departures from Lorentz symmetry,\nwhich may of course be somewhat different from the Planck scale (but on the other hand\none does expect, in order to work within the quantum-gravity premises of these analyses,\nthat roughly η ∼ 1).\nThe fact that the literature has focused primarily on this parametrization of the dispersion relation is mostly due to its simplicity, which makes it a natural first step in a\nphenomenology of Planck-scale departures from Lorentz symmetry. However, this scenario\nis also more or less directly connected with various quantum-gravity proposals. In Loop\nQuantum Gravity preliminary results[28, 33] provide support for the dispersion relation (1).\nIn some rather popular noncommutative spacetimes[34] one also finds evidence in favour\nof (1). In String Theory it appears that the modification of the dispersion relation is not\nautomatic but emerges in presence of certain natural background fields[29, 30], and for some\nbackground configurations a dispersion relation of the type (1) is encountered[30]. The role\nthat phenomenological studies of (1) could have in the overall development of quantumgravity research has been stressed in the most recent reviews by experts of the field (see,\ne.g., Refs. [1, 3, 4]).\n\n2.1\n\nGamma-ray bursts\n\nIn principle one could test (1) by making simultaneous measurements of energy and (space)momentum. This turns out to be rather unpractical, at least when one is aiming for the\nneeded Planck-scale sensitivity. It is therefore generally assumed that (1) should be tested\nin combination with some other key kinematic property. Perhaps the most natural proposal\nis to study (1) with the additional assumption that the velocity v of the particle should be\n2\n\nFor composites of several fundamental particles the dispersion relation could take a very different form.\nIn particular, if the momentum of the composite is obtained by a simple sum of the momenta of the composing\nparticles, then the energy-momentum of a composite formed by N identical fundamental particles all carrying\nroughly the same energy-momentum is governed by the dispersion relation ET2 OT ≃ N 2 E 2 = N 2 ~p2 +N 2 m2 +\nηN n E n N 2 p~2 /(N n Epn ) ≃ p~2T OT + m2T OT + ηETnOT ~p2T OT /(N n Epn ).\n\n\fstill obtainable from the dispersion relation using v = dE/dp, as it happens to be the case\nin classical spacetime both in nonrelativistic (Galilei) physics and in relativistic (Einstein)\nphysics. By assuming the validity of the relation v = dE/dp one is essentially only assuming3\nthat it should be possible to introduce some form of Hamiltonian description of particle\nsystems with standard Heisenberg commutator ([x, p] = 1, v = dx/dt ∼ [x, H], where H is\nthe energy/Hamiltonian). Combining (1) with v = dE/dp one is led to a velocity law which\nat \"intermediate energies\" (m < E ≪ Ep ) takes the form\nv ≃1−\n\nn + 1 En\nm2\n.\n+\nη\n2E 2\n2 Epn\n\n(2)\n\nSuch a modified velocity law can be sensitively studied experimentally focusing on the fact\nthat, whereas in ordinary special relativity two photons (m = 0) emitted simultaneously\nwould always reach simultaneously a far-away detector, according to (2) two simultaneouslyemitted photons should reach the detector at different times if they carry different energy.\nThis type of effect can be significant[8, 9] in the analysis of short-duration gamma-ray\nbursts that reach us from cosmological distances. For a gamma-ray burst it is not uncommon\nto find a time travelled before reaching our Earth detectors of order T ∼ 1017 s. Microbursts\nwithin a burst can have very short duration, as short as 10−3 s (or even 10−4 s), and this\nmeans that the photons that compose such a microburst are all emitted at the same time,\nup to an uncertainty of 10−3 s. Some of the photons in these bursts have energies that extend\nat least up to the GeV range. For two photons with energy difference of order ∆E ∼ 1GeV a\nspeed difference η∆E/Ep over a time of travel of 1017 s would lead to a difference in times of\narrival of order ∆t ∼ ηT ∆E/Ep ∼ 10−2 s, which is significant (the time-of-arrival differences\nwould be larger than the time-of-emission differences within a single microburst).\nSuch a Planck-scale-induced time-of-arrival difference could be revealed[8, 9] upon comparison of the structure of the gamma-ray-burst signal in different energy channels. Considering the achievable sensitivities[39] one concludes that the next generation of gamma-ray\ntelescopes, such as GLAST[39], can test very significantly (2) in the case n = 1 (whereas the\neffects found in the case n = 2 are too small for GLAST).\nAn even higher sensitivity to possible Planck-scale modifications of the velocity law could\nbe achieved by exploiting the fact that, according to current models[40], gamma-ray bursters\nshould also emit a substantial amount of high-energy neutrinos. Some neutrino observatories\nshould soon observe neutrinos with energies between 1014 and 1019 eV , and one could, for\nexample, compare the times of arrival of these neutrinos emitted by gamma-ray bursters to\nthe corresponding times of arrival of low-energy photons. Assuming that some technical and\nconceptual challenges can be overcome4 one could use this strategy to test very reliably the\n3\nIndeed most of the relevant phenomenological analyses assume the validity of v = dE/dp. But alternatives are being, legitimately, considered by some authors (see, e.g., Refs. [35, 36, 37, 38]). While these\nstudies of alternatives to v = dE/dp rely of a large variety of arguments (some more justifiable some less) in\nmy own perception a key issue here is whether quantum gravity leads to a modified Heisenber uncertainty\nprinciple, [x, p] = 1 + F (p), in which case the relation v = dx/dt ∼ [x, H(p)] would not lead to v = dE/dp.\n4\nFor example, this type of analysis requires an understanding of gamma-ray bursters good enough to\nestablish whether there are typical at-the-source time delays. The analysis would loose much of its potential\nif one cannot exclude some systematic tendency of gamma-ray bursters to emit high-energy neutrinos with,\n\n\fcase of (2) with n = 1, and even perhaps gain some access to the investigation of the case\nn = 2.\n\n2.2\n\nUHE cosmic rays\n\nIn alternative to the proposals considered in the previous subsection, in which one investigates the dispersion relation (1) in combination with the relation v = dE/dp, there has\nalso been strong interest in the possibility of testing the implications of (1) when combined\nwith the assumption of unmodified laws of energy-momentum conservation. With a given\ndispersion relation and a given rule for energy-momentum conservation one has a complete\n\"kinematic scheme\" for the analysis of particle production in collisions or decay processes.\nIn the case in which one combines (1) with unmodified laws of energy-momentum conservation the analysis of course involves the added element of complexity due to the fact that\none must necessarily introduce a preferred class of inertial frames5 . The parameters (e.g.\nthe parameter η) will take different values in different inertial frames and therefore in order\nto combine meaningfully the limits obtained working in different frames it is necessary to\ntransform all the results into limits applicable in a given inertial frame. It is customary to\nadopt as this \"preferred\" frame the natural frame for the description of the CMBR (Cosmic\nMicrowave Background Radiation).\nIt has been observed that the combination of (1) with unmodified energy-momentum\nconservation can significantly affect the threshold requirements for certain particle-producing\nprocesses. Let us for example consider collisions between a soft photon of energy ǫ and a highenergy photon of energy E that creates an electron-positron pair: γγ → e+ e− . For given\nsoft-photon energy ǫ, the process is allowed only if E is greater than a certain threshold\nenergy Eth which depends on ǫ and m2e . For n = 1, combining (1) with unmodified energymomentum conservation, this threshold energy Eth is found to satisfy\nEth ǫ + η\n\n3\nEth\n= m2e\n8Ep\n\n(3)\n\n(assuming ǫ ≪ me ≪ Eth ≪ Ep ). The special-relativistic result Eth = m2e /ǫ corresponds\nof course to the η → 0 limit of (3). For |η| ∼ 1 the Planck-scale correction can be safely\nneglected as long as ǫ > (m4e /Ep )1/3 . But eventually, for sufficiently small values of ǫ and\ncorrespondingly large values of Eth , the Planck-scale correction cannot be ignored. For\nǫ ∼ 0.01eV the modification of the threshold is already significant, and this is relevant for\nthe observation of multi-T eV photons from certain Blazars[12, 13].\nAnd the process γγ → e+ e− is not the only case in which this type of Planck-scale\nmodification can be important. There has been strong interest[10, 12, 13, 14, 16, 17, 41]\nsay, a certain delay with respect to microbursts of photons (although by combining several observations from\ngamma-ray bursters at different distances one could partly compensate for this possible systematic effect).\n5\nIt has been recently realized[31, 32] that a dispersion relation of the type of (1) can be adopted without\nnecessarily renouncing to the equivalence of inertial frames, at the cost of a deformation of boost\np transformations (just like one can replace the Galileian m = p2 /2E with the special-relativistic m = (E 2 − c2 p2 )/c4\nwithout renouncing to the equivalence of inertial frames, at the cost of replacing Galilei boosts with Lorentz\nboosts). However, if one insists both on the equivalence of inertial frames and on a dispersion relation of\ntype (1) the law of energy-momentum conservation cannot remain unmodified[31].\n\n\fin \"photopion production\", pγ → pπ, where again the combination of (1) with unmodified\nenergy-momentum conservation leads to a modification of the minimum proton energy required by the process (for fixed photon energy). In the case in which the photon energy is the\none typical of CMBR photons one finds that the threshold proton energy can be significantly\nshifted upward (for negative η), and this in turn should affect at an observably large level\nthe expected \"GZK cutoff\" for the observed cosmic-ray spectrum. Observations reported\nby the AGASA[42] cosmic-ray observatory provide some encouragement for the idea of such\nan upward shift of the GZK cutoff, but the issue must be further explored. Forthcoming\ncosmic-ray observatories, such as Auger[43], should be able[10, 13] to fully investigate this\npossibility.\n\n3\n\nLimitations of \"cocktail analyses\" in the search of\nquantum-gravity signatures in astrophysics\n\nI stressed that it would be ideal to test directly (1), without the need of relying on any other\nassumption on properties of Planck-scale physics. This Quantum-Gravity Phenomenology\nis trying to provide some hints for the solution of the quantum-gravity problem and a test\nof (1) could be useful from this perspective. But if our phenomenology mixes (1) with other\nassumptions we will only test a certain \"cocktail\" of assumptions for quantum gravity, with\nan obvious decrease in the quality of the insight gained. As mentioned we are unable to test\nsensitively (1) on its own, but still we should give priority to tests which require the fewest\nand the simplest (most natural) assumptions in combination with (1). The assumption\nof v = dE/dp, considered in Subsection 2.1, and the assumption of unmodified energymomentum conservation, considered in Subsection 2.2, are good examples of what could\nbe a single extra assumption to combine with (1). Unfortunately in certain observational\ncontexts which at first sight appear to provide a good chance for Planck-scale sensitivity\none then finds out that a comprehensive phenomenological analysis requires a combination\nof several assumptions about the Planck-scale regime. Two examples which I consider in\nthis section will illustrate the limitations that can emerge from relying on such cocktails of\nassumptions.\n\n3.1\n\nSynchrotron radiation from the Crab nebula\n\nA recent series of papers[44, 45, 46, 47, 48, 49, 50] has focused on the possibility to set limits\non Planck-scale modified dispersion relations focusing on their implications for synchrotron\nradiation. By comparing the content of the first estimates6 produced in this research line[44]\nwith the understanding that emerged from follow-up studies[45, 46, 47, 48, 49, 50] one\ncan gain valuable insight on the risks involved in analyses based on cocktails of several\n6\n\nRef. [44] is at this point obsolete, since the relevant manuscript has been revised for the published\nversion[46] and the recent Ref. [50] provides an even more detailed and careful analysis. It is nevertheless\nuseful to consider this series of manuscripts [44, 46, 50] as an illustration of the inevitable increasing level of\ncomplexity of the analysis that emerges as more and more interplays within the system of assumptions are\ntaken into account.\n\n\fassumptions about Planck-scale physics. In Ref.[44] the starting point is the observation\nthat in the conventional (Lorentz-invariant) description of synchrotron radiation one can\nestimate the characteristic energy Ec of the radiation through a heuristic analysis[51] leading\nto the formula\n1\n,\n(4)\nEc ≃\nR*δ*[vγ − ve ]\nwhere ve is the speed of the electron, vγ is the speed of the photon, δ is an angle obtained\nfrom the opening angle between the direction of the electron and the direction of the emitted\nphoton, and R is the radius of curvature of the trajectory of the electron. Ref. [44] implicitly\nrelies on several assumptions[45, 47, 48, 49, 50], including: (i) the assumption that both\nthe dispersion relation (1) and the relation v = dE/dp are verified; (ii) the assumption that\nthe same heuristic derivation of the synchrotron-radiation cutoff energy applies exactly also\nat the Planck-scale, which in particular requires[45, 46, 48] that an ordinary effective lowenergy field-theory description is possible; (iii) the assumption that the relation between the\n\"opening angle\" δ and the energy E of the electron emitting the radiation is unaffected by\nthe Planck-scale departures from Lorentz symmetry.\nAs an opportunity to test the corresponding modification of the value of the synchrotronradiation cutoff one can hope to use some relevant data[44, 46] on photons detected from the\nCrab nebula. The observational information on synchrotron radiation being emitted by the\nCrab nebula is rather indirect: some of the photons we observe from the Crab nebula are\nattributed to sychrotron processes on the basis of a promising (but unconfirmed) conjecture,\nand the value of the relevant magnetic fields is also conjectured (not directly measured). But\nlet me set aside these (however important) facts about the observational situation, since I\nhere want to focus on the problems that arise when relying on \"cocktails of assumptions\"\n(independently of the reliability of the data which are being considered). The assumptions on\nwhich Ref. [44] relies clearly limit the insight gained through the phenomenological analysis.\nAssuming that indeed the observational situation has been properly interpreted and relying on the additional assumptions (i), (ii) and (iii) one could basically rule out[44] the case\nn = 1 for the modified dispersion relation (1). However, it was then realized[52] that the\nassumptions (i) and (ii) are not fully compatible: if one sets up dynamics according to the\nrules of effective low-energy field theory one cannot assume the dispersion relation (1) to apply to photons. At linear order in the Planck length (n = 1) one can write terms that modify\nthe dispersion relation for photons but the effect is then automatically such that it involves a\nstrong helicity dependence: if right-circular polarized photons satisfy the dispersion relation\nE 2 ≃ p2 + ζp3 then necessarily left-circular polarized photons satisfy the \"opposite sign\"\ndispersion relation E 2 ≃ p2 − ζp3. For spin-1/2 particles Ref. [52] does not appear to impose\nupon us a similar helicity dependence but of course in a context in which photons experience\nsuch a complete correlation of the effect with helicity it would be awkward to assume that\ninstead for electrons the effect is completely helicity independent. One therefore introduces\ntwo independent parameters η+ and η− to characterize the modification of the dispersion\nrelation for electrons. In the more recent quantum-gravity analyses of synchrotron radiation\nfrom the Crab nebula[50] this realization has led to more prudent claims concerning the\nimplications of these observations for the idea of modifications of the dispersion relations\nwith terms linear in the Planck length (n = 1): the analysis (as presently formulated) is\n\n\fonly relevant for quantum-gravity scenarios that are compatible with the type of needed\nlow-energy effective field theory that is used in the analysis and in those contexts it can\nonly be used to constrain one of the three parameters (ζ,η+ ,η− ) that would characterize the\nmodification of the dispersion relation in a low-energy effective-field-theory setup.\nI must stress that, while it is of course legitimate to develop a quantum-gravity-phenomenology\ntest theory that is formulated in the effective-field-theory language, by adopting an effectivefield-theory formalism one can anyway only provide rather limited insight for the overall\neffort of quantum-gravity research. In fact, a significant portion of the quantum-gravity\ncommunity is justifiably skeptical about the insight gained from analyses relevant for the\nquantum-gravity problem done within low-energy effective field theory. In particular, the\nfirst natural prediction of low-energy effective field theory in the gravitational realm is a\nvalue of the energy density which is some 120 orders of magnitude greater7 than allowed\nby observations. Somewhat related to this \"cosmological constant problem\" is the fact that\na description of possible Planck-scale departures from Lorentz symmetry within effective\nfield theory can only be developed with a rather strongly pragmatic attitude; in fact, while\none can introduce Planck-scale suppressed effects at tree level, one of course expects8 that\nloop corrections would naturally lead to inadmissibly large departures from ordinary Lorentz\nsymmetry.\nPerhaps most importantly, if we look at the quantum pictures of spacetime that provide\nsupport for the proposal (1), which usually involve either noncommutative geometry or Loop\nQuantum Gravity, at the present time one does not find any encouragement for this type\nof low-energy effective-field-theory description. The noncommutative spacetimes in which\nmodifications of the dispersion relation are being most actively considered are characterized\nby spacetime-coordinate noncommutativity of the type [xμ , xν ] = iθμν + iρβμν xβ , and it is\nwell known that the construction of quantum field theories in these spacetimes requires the\nintroduction of several new technical tools, which in turn lead to the emergence of several\nnew physical features, even at low energies. When the matrix ρ is present (ρ 6= 0) we are still\nstruggling in the search of a satisfactory formulation of a quantum field theory[55, 56]. For\nthe special case ρ = 0 the community has achieved substantial progress in the development of\nquantum field theories[57], but the results actually show that it is not possible to rely on an\nordinary effective low-energy quantum-field-theory description. In fact, one finds a surprising\n\"IR/UV mixing\"[29, 57, 58], i.e. the high-energy sector of the theory does not decouple from\nthe low-energy sector, and this in turn affects very severely[58] the outlook of analyses based\non an ordinary effective low-energy quantum-field-theory description. Indeed in the study\nreported in Ref. [59], which was announced soon after the first papers on the quantumgravity implications of synchrotron radiation from the Crab nebula, a quantum field theory\nin noncommutative spacetime with modified dispersion relation was analyzed focusing on\nsynchrotron radiation and it was argued that the limitations suggested by Ref. [44, 46] do\n7\n\nAnd the outlook of low-energy effective field theory in the gravitational realm does not improve much\nthrough the observation that exact supersymmetry could protect from the emergence of any energy density.\nIn fact, Nature clearly does not have supersymmetry at least up to the TeV scale, and this would still lead\nto a natural prediction of the cosmological constant which is some 70 orders of magnitude too high.\n8\nIndeed some studies, notably Refs. [53, 54], have shown mechanisms such that within an effective-fieldtheory approach loop effects would lead to inadmissibly large departures from ordinary Lorentz symmetry.\n\n\fnot actually apply.\nThe assumption of availability of an ordinary effective low-energy quantum-field-theory\ndescription finds also no support in Loop Quantum Gravity. Indeed, so far, in Loop Quantum\nGravity all attempts to find a suitable limit of the theory which can be described in terms of\na quantum-field-theory in background spacetime have failed. And on the basis of some recent\nstudies[60] it appears plausible that in most contexts in which one would naively expect a\nlow-energy field theory description Loop Quantum Gravity might predict a density-matrix\ndescription.\nAlso worrisome is the assumption that the relation between the opening angle δ and the\nenergy E of the electron emitting the radiation should be unaffected by the Planck-scale\ndepartures from Lorentz symmetry. It is in fact well established that assuming (1) in the\nanalysis of particle-physics processes one naturally finds striking modifications of the formulas\nthat relate the energy-momentum of the incoming particles with the opening angles between\nthe directions of motion of the outgoing particles. For example, the result here discussed\nin Subsection 2.2, the modification of the threshold energy for γ + γ → e+ + e− , can be\nviewed[45] as an effect due to a significant modification of an opening-angle formula.\nThis concern for the opening-angle estimate of Ref. [44, 46, 50] becomes even more\nserious considering the fact that synchrotron radiation can be described in terms of Compton\nscattering with the virtual photons of the magnetic field. Describing the virtual photon as a\nparticle with momentum P∗ and energy E∗ one finds that in the process e− +γvirtual → e− +γ\nthe opening angle φ between the outgoing particles must satisfy the relation\ncos(φ) ≃\n\n2pf Eγ,out − 2Ei E∗ − 2pi P∗ − (E∗ 2 − P∗ 2 ) +\n2pf Eγ,out\n\nEγ,out 2\nme\nEf\n\n+\n\n2ηEf2 Eγ,out\nEp\n\n,\n\n(5)\n\nwhere Ei (pi ) is the energy (momentum) of the incoming electron, Ef is the energy of the\noutgoing electron, and Eγ,out is the energy of the (real, on-shell) photon that is emitted. For\nnegative η the Planck-scale correction term can induce a significant reduction of the opening\nangle, which would affect9 the analysis of Ref. [44, 46, 50].\n\n3.2\n\nPhase coherence of light from extragalactic sources and time\nquantization\n\nThe analysis of Ref. [61] can provide a second example of a physical context in which at first\nsight there appears to be a good chance for Planck-scale sensitivity but then it emerges that\na comprehensive phenomenological analysis requires a combination of too many assumptions\nabout the Planck-scale regime. The observations that are relevant for the analysis of Ref. [61]\nare the ones that provide evidence of a good phase coherence of light from extragalactic\nsources. And the key objective of the analysis reported in Ref. [61] is a test of the possibility\n9\n\nFrom private communications I infer that Jacobson, Liberati and Mattingly are not too concerned about\nthis opening-angle issue (while they are making a dedicated effort of exploration[50] of the consistency\nrequirements that emerge from the use of effective field theory in their analysis). They do comment briefly\non this opening-angle issue in Ref. [47], but I must leave to the interested reader the task of assessing whether\nthose brief comments do provide sufficient reassurance.\n\n\fthat time may be fuzzy/quantized at the Planck scale (τp quantization, with τp ∼ 10−44 s the\nPlanck time).\nI should mention parenthetically that the analysis of Ref. [61] has been criticized at a\nmerely computational level, especially for what concerns the way in which nonsistematic\neffects were combined[62] and the nature of the conventional-physics processes that lead to\nphase coherence of light from extragalactic sources[63]. Just like I set aside in the previous\nsubsection the concerns for the nature of the data on synchrotron radiation from the Crab\nNebula, here I want to set aside this type of skepticism toward the analysis reported in\nRef. [61]. I intend to focus on the fact that in the phenomenological analysis presented in\nRef. [61] the hypothesis of Planck-scale time quantization is not tested directly, but rather it\nis combined with a rich cocktail of assumptions, including: (j) that time quantization should\nbe accompanied by a corresponding level of distance quantization, i.e. a combined measurement of space-position and time should be affected by δx > Lp and δt > τp uncertainties, (jj)\nthat a framework hosting these Planck-scale uncertainties in time and space-position should\nnecessarily also predict irreducible uncertainties for energy and space-momentum measurement of the type δE > E 2 /Ep and δp > p2 /Ep , and (jjj) that one should also necessarily\nhave a modification of the dispersion relation roughly of the type (1).\nWhile each of these conjectured features for quantum spacetime are individually plausible,\nit is rather \"optimistic\" to expect that all of them should be realized in the correct quantumgravity theory. And actually some results in the literature show that there is no absolute\nlink between the assumptions (j), (jj) and (jjj). Once again I can mention some results\nobtained in the study of spacetime noncommutativity of the type [xμ , xν ] = iθμν + iρβμν xβ ,\nwhich is one of the most popular and simplest ways to introduce spacetime quantization.\nA wide body of literature (see, e.g., Refs. [29, 34, 56, 57, 64, 65, 66]) shows that in these\nquantized spacetimes energy and momentum, when properly introduced, are not affected by\nany minimum-uncertainty conditions, contrary to the assumption (jj).\nMoreover, for the most popular choices of the matrices θ and ρ the emerging spacetime\nquantization does not lead to the conclusion that a combined measurement of space-position\nand time should be affected by δx > Lp and δt > τp uncertainties. For example the socalled κ-Minkowski spacetime is characterized by [xj , xl ] = 0 , [xj , t] = ixj /κ (where κ is\na noncommutativity scale with dimensions of mass) and is therefore fully compatible with\nthe possibility of assigning sharp values to the space coordinates xj (while indeed the time\ncoordinate t is subject to a meaningful Planck-scale discretization[65]).\n\n4\n\nThe Planck-boost regime\n\nTogether with a brief review and reanalysis of existing areas of interest in quantum-gravity\nphenomenology, I like to include in these notes also some remarks on a previously unnoticed\nopportunity which I see for this subject. I can do this while remaining in the context of the\nresearch line that investigates the fate of Lorentz symmetry in quantum spacetime, on which\nI mainly focused throughout these notes.\nMy point originates from the realization that some rather different \"amplification mechanisms\" are at work in the various processes I considered. For example, the threshold\nanomalies can get large when the two colliding particles have a large energy difference (one\n\n\fis soft and one is very hard), i.e. when the laboratory frame is highly boosted with respect\nto the center-of-mass frame. The time-of-travel analyses, which I considered in discussing\ngamma-ray bursts, get larger at higher particle energy, and for a massive particle they are\ntherefore more significant if the laboratory frame is highly boosted with respect to the rest\nframe of the particle.\nMy discussion was mainly focused on a specific model of Planck-scale departures from\nLorentz symmetry, and it is clearly strongly model dependent (if the model is changed one\ncan expect even sizeable changes in the nature and magnitude of the effects). But there\nis one aspect that might have more general, nearly model-independent, validity: the new\nPlanck-scale effects become significant for high boosts with respect to the center-of-mass\n(or particle-rest) frame. Within a specific model a detailed analysis is needed in order to\nestablish which type of high boosts are sufficient for a significant size of the effects. But it\nwould be useful to have a more general intuition for a large-boost regime that is of interest\nfrom a quantum-gravity perspective. For example, in studies of the short-distance structure\nof spacetime different pictures lead to different expectations for the distance scale where the\nnonclassical features become relevant, but there is a distance scale which is perceived to\nbe intrinsically of interest from a quantum-gravity perspective: when the processes involve\ndistance scales of the order of the Planck length most researchers share the expectation\nthat new effects should be present, quite independently of the specific models that different\nresearchers are pursuing. For boosts we do not yet have a similar intuition. The Planck scale\nis interpreted equivalently as a length or energy scale, but there is no common expectation\nof a characteristic size of boosts that corresponds to the Planckian regime. To the idea of a\nlarge boost most researchers associate the image of particles with velocity \"close to 1\", but\nno standard measure of \"how close is close enough\" has been adopted. Distance scales are\nsmall enough to be potentially sensitive to Planck-scale effects when they are of the order\nof the Planck length. Is there a model-independent way to describe a particle's velocity as\n\"high enough to be potentially sensitive to Planck-scale effects\"?\nIt seems to me that the Planck length also allows to introduce an objective reference\nfor the magnitude of boosts, at least in certain contexts. Take in particular a particle of\nrest energy m. By going from the rest frame to some boosted frames the same particle\nwill carry a frame-dependent energy E, and the size of the energy of the particle measures\nthe magnitude of the boost needed to connect the laboratory frame to the rest frame. In\nordinary special relativity E/m = cosh(ξ), where ξ is the rapidity of the laboratory frame\nwith respect to the rest frame. So energy can measure, in an appropriate sense, the magnitude\nof some relevant boosts. And I observe that the availability of the Planck scale allows to\nintroduce two different regimes: the low-boost regime E/m < Ep /E and the high-boost\nregime E/m > Ep /E. In principle one can consider even a series\nof energy/boost\nvalues that\nq\nq\nget us deeper and deeper in the Planck regime: m < E < mEp , mEp < E < (mEp2 )1/3 ,\n(mEp2 )1/3 < E < (mEp3 )1/4 , . . ..\nThe key point of this simple observation is that it suggests that, while normally one refers\nto the Planck regime as the regime of energies close to the Planck energy, there is a sense in\nwhich access to the Planck regime could be characterized as a requirement for a combination\nof particle energy, particle mass and Planck scale.\nThere is also a rather amusing quantitative observation that I can report on this point.\n\n\fThe standard estimate of the mentioned GZK scale forqcosmic-ray observations is of order\n5*1019eV , which happens to be[67] just above the scale mproton Ep ∼ 3*1018eV for a cosmicray proton. One could therefore suspect that the anomalies reported by the AGASA[42] observatory for the cosmic-ray spectrum (if at all\nqto be trusted) might reflect some new physics\nin the high-boost/high-velocity regime E > mEp . Of course a minimum requirement for\njustifying interest in this numerological observation is confirmation by the mentioned forthcoming Auger data. But it is noteworthy that, in case it is needed, cosmic rays are not\nthe only opportunity to access the high-boost regime. In fact, as mentioned, some neutrino\nobservatories should soon observe neutrinos with energies between 1014 and 1019 eV , and\nalthough the precise values of the neutrino masses remain undetermined, on the basis of the\npresent upper limits one can expect thatqthese data will be sufficient to explore the highboost regime for neutrinos (for example mEp < 1014 eV only requires that m < 1eV ). By\ncombining the information from observations of UHE cosmic rays and observations of UHE\nneutrinos we might gain in the near future some access to the Planck-boost regime.\n\nAcknowledgments\nI am grateful to A. Grillo, T. Jacobson, T.J. Konopka, S. Liberati, D. Mattingly, D. Sudarsky,\nL. Urrutia, who were kindly available for discussions while I was preparing this manuscript.\n\nReferences\n[1] L. Smolin, hep-th/0303185; L. Smolin, Three Roads to Quantum Gravity (Weidenfeld\nand Nicolson, London, 2000).\n[2] A. Ashtekar, gr-qc/9901023.\n[3] C. Rovelli, gr-qc/0006061 (in proceedings of 9th Marcel Grossmann Meeting).\n[4] S. Carlip, gr-qc/0108040, Rept. Prog. Phys. 64, 885 (2001).\n[5] C.J. Isham, Structural issues in quantum gravity, in Proceedings of General relativity and\ngravitation (Florence 1995).\n[6] A. Ashtekar and J. Stachel (editors), Conceptual problems of quantum gravity\n(Birkhauser, Boston, 1991).\n[7] G. Amelino-Camelia, Are we at the dawn of quantum-gravity phenomenology?, grqc/9910089, Lect. Notes Phys. 541, 1 (2000); gr-qc/0204051, Mod. Phys. Lett. A17,\n899 (2002).\n[8] G. Amelino-Camelia, J. Ellis, N.E. Mavromatos and D.V. Nanopoulos, hep-th/9605211,\nInt. J. Mod. Phys. A12, 607 (1997); G. Amelino-Camelia, J. Ellis, N.E. Mavromatos,\nD.V. Nanopoulos and S. Sarkar, astro-ph/9712103, Nature 393, 763 (1998).\n\n\f[9] S.D. Biller et al, Phys. Rev. Lett. 83, 2108 (1999).\n[10] T. Kifune, Astrophys. J. Lett. 518, L21 (1999).\n[11] R. Aloisio, P. Blasi, P.L. Ghia and A.F. Grillo, Phys. Rev. D62, 053010 (2000).\n[12] R.J. Protheroe and H. Meyer, Phys. Lett. B493, 1 (2000).\n[13] G. Amelino-Camelia and T. Piran, astro-ph/0008107, Phys. Rev. D64, 036005 (2001);\nG. Amelino-Camelia, gr-qc/0012049, Nature 408, 661 (2000).\n[14] T. Jacobson, S. Liberati and D. Mattingly, hep-ph/0112207, Phys. Rev. D66, 081302\n(2002).\n[15] T.J. Konopka and S.A. Major, New J. Phys. 4, 57 (2002); D. Heyman, F. Hinteleitner,\nand S. Major, gr-qc/0312089.\n[16] G. Amelino-Camelia, gr-qc/0107086, Phys. Lett. B528, 181 (2002); G. AmelinoCamelia, M. Arzano, Y.J. Ng, T. Piran, H. Van Dam, hep-ph/0307027.\n[17] O. Bertolami, hep-ph/0301191.\n[18] I.C. Perival and W.T. Strunz, Proc. R. Soc. A453, 431 (1997).\n[19] G. Amelino-Camelia, gr-qc/9808029, Nature 398, 216 (1999); gr-qc/9903080,\nPhys. Rev. D62, 024015 (2000); gr-qc/0104086, Nature 410, 1065 (2001); gr-qc/0104005.\n[20] Y.J. Ng and H. van Dam, gr-qc/9906003, Found. Phys. 30, 795 (2000).\n[21] S. Schiller, C. Laemmerzahl, H. Mueller, C. Braxmaier, S. Herrmann and A. Peters,\ngr-qc/0401103.\n[22] P. Huet and M.E. Peskin, Nucl. Phys. B434, 3 (1995).\n[23] V.A. Kostelecky and R. Potting, Phys. Rev. D51, 3923 (1995); O. Bertolami, D. Colladay, V.A. Kostelecky and R. Potting, Phys.Lett. B395, 178 (1997).\n[24] J. Ellis, J. Lopez, N.E. Mavromatos and D.V. Nanopoulos, Phys. Rev. D53, 3846 (1996).\n[25] F. Benatti and R. Floreanini, Nucl. Phys. B488, 335 (1997).\n[26] G. Amelino-Camelia and F. Buccella, hep-ph/0001305, Mod. Phys. Lett. A15, 2119\n(2000).\n[27] L.J. Garay, Phys. Rev. Lett. 80, 2508 (1998).\n[28] R. Gambini and J. Pullin, Phys. Rev. D59, 124021 (1999).\n[29] A. Matusis, L. Susskind and N. Toumbas, hep-th/0002075, JHEP 0012, 002 (2000).\n[30] O. Bertolami and L. Guisado, hep-th/0306176.\n\n\f[31] G. Amelino-Camelia, gr-qc/0012051, Int. J. Mod. Phys. D11, 35 (2002); hepth/0012238, Phys. Lett. B510, 255 (2001); gr-qc/0207049, Nature 418, 34 (2002); grqc/0210063, Int. J. Mod. Phys. D11, 1643 (2002).\n[32] J. Kowalski-Glikman, hep-th/0102098, Phys. Lett. A286, 391 (2001); R. Bruno,\nG. Amelino-Camelia and J. Kowalski-Glikman, hep-th/0107039, Phys. Lett. B522,\n133 (2001); G. Amelino-Camelia, D. Benedetti, F. D'Andrea and A. Procaccini, hepth/0201245, Class. Quant. Grav. 20, 5353 (2003); J. Kowalski-Glikman and S. Nowak,\nhep-th/0204245.\n[33] L. Smolin, hep-th/0209079.\n[34] J. Lukierski, H. Ruegg and W.J. Zakrzewski Ann. Phys. 243, 90 (1995).\n[35] P. Kosinski and P. Maslanka, hep-th/0211057, Phys. Rev. D68, 067702 (2003).\n[36] S. Mignemi, hep-th/0302065, Phys. Lett. A316, 173 (2003).\n[37] M. Daszkiewicz, K. Imilkowska and J. Kowalski-Glikman, hep-th/0304027.\n[38] J. Kowalski-Glikman, hep-th/0312140.\n[39] J.P. Norris, J.T. Bonnell, G.F. Marani, J.D. Scargle, astro-ph/9912136; A. de Angelis,\nastro-ph/0009271.\n[40] P. Meszaros, S. Kobayashi, S. Razzaque, B. Zhang, astro-ph/0305066.\n[41] Y.J. Ng, D.S. Lee, M.C. Oh, and H. van Dam, Phys. Lett. B507, 236 (2001); G.\nAmelino-Camelia, Y.J. Ng, and H. van Dam, gr-qc/0204077, Astropart. Phys. 19, 729\n(2003).\n[42] M. Takeda et al, Phys. Rev. Lett. 81, 1163 (1998).\n[43] J. Blumer (for the Pierre Auger Collaboration), J. Phys. G29, 867 (2003).\n[44] T. Jacobson, S. Liberati and D. Mattingly, arXiv.org/abs/astro-ph/0212190v1\n[45] G. Amelino-Camelia, gr-qc/0212002.\n[46] T. Jacobson, S. Liberati and D. Mattingly, arXiv.org/abs/astro-ph/0212190v2, Nature\n424, 1019 (2003).\n[47] T. Jacobson, S. Liberati and D. Mattingly, gr-qc/0303001.\n[48] S. Carroll, Nature 424, 1007 (2003).\n[49] J. Ellis, N.E. Mavromatos and A.S. Sakharov, astro-ph/0308403.\n[50] T.A. Jacobson, S. Liberati, D. Mattingly and F.W. Stecker, astro-ph/0309681.\n[51] J.D. Jackson, Classical Electrodynamics (J. Wiley & Sons).\n\n\f[52] R.C. Myers and M. Pospelov, hep-ph/0301124, Phys. Rev. Lett. 90, 211601 (2003).\n[53] A. Perez and D. Sudarsky, gr-qc/0306113.\n[54] J. Collins, A. Perez, D. Sudarsky, L. Urrutia and H. Vucetich, preprint (presented by\nD. Sudarsky at the 40th Karpacz Winter Shool in Theoretical Physics, on 5 Feb 2004).\n[55] P. Kosinski, J. Lukierski and P. Maslanka, Czech. J. Phys. 50, 1283 (2000).\n[56] G. Amelino-Camelia and M. Arzano, hep-th/0105120, Phys. Rev. D65, 084044 (2002);\nA. Agostini, G. Amelino-Camelia, F. D'Andrea, hep-th/0306013.\n[57] N.R. Douglas and N.A. Nekrasov, Rev. Mod. Phys. 73, 977 (2001).\n[58] G. Amelino-Camelia, G. Mandanici and K. Yoshida hep-th/0209254, JHEP 0401, 037\n(2004).\n[59] P. Castorina and D. Zappala, hep-ph/0310116, Europhys. Lett. 64, 641 (2003).\n[60] R. Gambini, R. Porto and J. Pullin, gr-qc/0305098.\n[61] R. Lieu and L. W. Hillman, astro-ph/0301184, Astrophys. J. 585, L77 (2003).\n[62] Y.J. Ng, H. van Dam and W.A. Christiansen, astro-ph/0302372, Astrophys. J. 591, L87\n(2003).\n[63] D.H. Coule, astro-ph/0302333, Class. Quant. Grav. 20, 3107 (2003).\n[64] S. Majid and H. Ruegg, Phys. Lett. B334, 348 (1994).\n[65] G. Amelino-Camelia and S. Majid, hep-th/9907110, Int. J. Mod. Phys. A15, 4301\n(2000).\n[66] J. Madore, S. Schraml, P. Schupp and J. Wess, hep-th/0001203, Eur. Phys. J. C16,\n161 (2000).\n[67] G. Amelino-Camelia, astro-ph/0209232, Int. J. Mod. Phys. D12, 1211 (2003).\n\n\f"}