{"id": "http://arxiv.org/abs/gr-qc/0702074v1", "guidislink": true, "updated": "2007-02-14T02:56:59Z", "updated_parsed": [2007, 2, 14, 2, 56, 59, 2, 45, 0], "published": "2007-02-14T02:56:59Z", "published_parsed": [2007, 2, 14, 2, 56, 59, 2, 45, 0], "title": "The Momentum Four-Vector in the $eψ$N Formalism and the Angular\n  Momentum Imparted to Test Particles by Gravitational Waves", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0001081%2Cgr-qc%2F0001051%2Cgr-qc%2F0702014%2Cgr-qc%2F0702058%2Cgr-qc%2F0702067%2Cgr-qc%2F0702128%2Cgr-qc%2F0702074%2Cgr-qc%2F0702143%2Cgr-qc%2F0702088%2Cgr-qc%2F0702103%2Cgr-qc%2F0702112%2Cgr-qc%2F0702053%2Cgr-qc%2F0702026%2Cgr-qc%2F0702138%2Cgr-qc%2F0702006%2Cgr-qc%2F0702040%2Cgr-qc%2F0702100%2Cgr-qc%2F0702022%2Cgr-qc%2F0702037%2Cgr-qc%2F0702096%2Cgr-qc%2F0702001%2Cgr-qc%2F0702119%2Cgr-qc%2F0702132%2Cgr-qc%2F0702149%2Cgr-qc%2F0702120%2Cgr-qc%2F0702055%2Cgr-qc%2F0702131%2Cgr-qc%2F0702115%2Cgr-qc%2F0702048%2Cgr-qc%2F0702077%2Cgr-qc%2F0702019%2Cgr-qc%2F0702069%2Cgr-qc%2F0702093%2Cgr-qc%2F0702090%2Cgr-qc%2F0702123%2Cgr-qc%2F0702024%2Cgr-qc%2F0702104%2Cgr-qc%2F0702150%2Cgr-qc%2F0702017%2Cgr-qc%2F0702142%2Cgr-qc%2F0702011%2Cgr-qc%2F0702049%2Cgr-qc%2F0702079%2Cgr-qc%2F0702057%2Cgr-qc%2F0702020%2Cgr-qc%2F0702118%2Cgr-qc%2F0702012%2Cgr-qc%2F0702072%2Cgr-qc%2F0702136%2Cgr-qc%2F0702102%2Cgr-qc%2F0702109%2Cgr-qc%2F0702002%2Cgr-qc%2F0702032%2Cgr-qc%2F0702108%2Cgr-qc%2F0702084%2Cgr-qc%2F0702137%2Cgr-qc%2F0702114%2Cgr-qc%2F0702071%2Cgr-qc%2F0702135%2Cgr-qc%2F0702035%2Cgr-qc%2F0702030%2Cgr-qc%2F0702116%2Cgr-qc%2F0702051%2Cgr-qc%2F0702062%2Cgr-qc%2F0702029%2Cgr-qc%2F0702036%2Cgr-qc%2F0702094%2Cgr-qc%2F0702050%2Cgr-qc%2F0702010%2Cgr-qc%2F0702083%2Cgr-qc%2F0702007%2Cgr-qc%2F0702105%2Cgr-qc%2F0702091%2Cgr-qc%2F0702085%2Cgr-qc%2F0702045%2Cgr-qc%2F0702126%2Cgr-qc%2F0702082%2Cgr-qc%2F0702092%2Cgr-qc%2F0702081%2Cgr-qc%2F0702097%2Cgr-qc%2F0702078%2Cgr-qc%2F0702034%2Cgr-qc%2F0702068%2Cgr-qc%2F0702107%2Cgr-qc%2F0702124%2Cgr-qc%2F0702130%2Cgr-qc%2F0702122%2Cgr-qc%2F0702027%2Cgr-qc%2F0702140%2Cgr-qc%2F0702042%2Cgr-qc%2F0702052%2Cgr-qc%2F0702110%2Cgr-qc%2F0702101%2Cgr-qc%2F0702134%2Cgr-qc%2F0702031%2Cgr-qc%2F0702152%2Cgr-qc%2F0702113%2Cgr-qc%2F0702147%2Cgr-qc%2F0702023%2Cgr-qc%2F0702065%2Cgr-qc%2F0702063&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Momentum Four-Vector in the $eψ$N Formalism and the Angular\n  Momentum Imparted to Test Particles by Gravitational Waves"}, "summary": "Since gravitational waves are solutions of Einstein's field equations with a\nzero stress-energy tensor, the reality of these waves was questioned. To\ndemonstrate it, the momentum imparted to test particles by such waves was\nevaluated. A closed form expression for this quantity was provided by Qadir and\nSharif, using an extension of the pseudo-Newtonian formalism. That formalism\ncarried with it the zero component of the momentum vector, which could not be\ninterpreted as the energy imparted to the test particle. Sharif proposed that\nit may represent the angular momentum imparted to test particles by\ngravitational waves. In this paper it is shown that this interpretation is not\nvalid. An alternative explanation has been provided.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0001081%2Cgr-qc%2F0001051%2Cgr-qc%2F0702014%2Cgr-qc%2F0702058%2Cgr-qc%2F0702067%2Cgr-qc%2F0702128%2Cgr-qc%2F0702074%2Cgr-qc%2F0702143%2Cgr-qc%2F0702088%2Cgr-qc%2F0702103%2Cgr-qc%2F0702112%2Cgr-qc%2F0702053%2Cgr-qc%2F0702026%2Cgr-qc%2F0702138%2Cgr-qc%2F0702006%2Cgr-qc%2F0702040%2Cgr-qc%2F0702100%2Cgr-qc%2F0702022%2Cgr-qc%2F0702037%2Cgr-qc%2F0702096%2Cgr-qc%2F0702001%2Cgr-qc%2F0702119%2Cgr-qc%2F0702132%2Cgr-qc%2F0702149%2Cgr-qc%2F0702120%2Cgr-qc%2F0702055%2Cgr-qc%2F0702131%2Cgr-qc%2F0702115%2Cgr-qc%2F0702048%2Cgr-qc%2F0702077%2Cgr-qc%2F0702019%2Cgr-qc%2F0702069%2Cgr-qc%2F0702093%2Cgr-qc%2F0702090%2Cgr-qc%2F0702123%2Cgr-qc%2F0702024%2Cgr-qc%2F0702104%2Cgr-qc%2F0702150%2Cgr-qc%2F0702017%2Cgr-qc%2F0702142%2Cgr-qc%2F0702011%2Cgr-qc%2F0702049%2Cgr-qc%2F0702079%2Cgr-qc%2F0702057%2Cgr-qc%2F0702020%2Cgr-qc%2F0702118%2Cgr-qc%2F0702012%2Cgr-qc%2F0702072%2Cgr-qc%2F0702136%2Cgr-qc%2F0702102%2Cgr-qc%2F0702109%2Cgr-qc%2F0702002%2Cgr-qc%2F0702032%2Cgr-qc%2F0702108%2Cgr-qc%2F0702084%2Cgr-qc%2F0702137%2Cgr-qc%2F0702114%2Cgr-qc%2F0702071%2Cgr-qc%2F0702135%2Cgr-qc%2F0702035%2Cgr-qc%2F0702030%2Cgr-qc%2F0702116%2Cgr-qc%2F0702051%2Cgr-qc%2F0702062%2Cgr-qc%2F0702029%2Cgr-qc%2F0702036%2Cgr-qc%2F0702094%2Cgr-qc%2F0702050%2Cgr-qc%2F0702010%2Cgr-qc%2F0702083%2Cgr-qc%2F0702007%2Cgr-qc%2F0702105%2Cgr-qc%2F0702091%2Cgr-qc%2F0702085%2Cgr-qc%2F0702045%2Cgr-qc%2F0702126%2Cgr-qc%2F0702082%2Cgr-qc%2F0702092%2Cgr-qc%2F0702081%2Cgr-qc%2F0702097%2Cgr-qc%2F0702078%2Cgr-qc%2F0702034%2Cgr-qc%2F0702068%2Cgr-qc%2F0702107%2Cgr-qc%2F0702124%2Cgr-qc%2F0702130%2Cgr-qc%2F0702122%2Cgr-qc%2F0702027%2Cgr-qc%2F0702140%2Cgr-qc%2F0702042%2Cgr-qc%2F0702052%2Cgr-qc%2F0702110%2Cgr-qc%2F0702101%2Cgr-qc%2F0702134%2Cgr-qc%2F0702031%2Cgr-qc%2F0702152%2Cgr-qc%2F0702113%2Cgr-qc%2F0702147%2Cgr-qc%2F0702023%2Cgr-qc%2F0702065%2Cgr-qc%2F0702063&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Since gravitational waves are solutions of Einstein's field equations with a\nzero stress-energy tensor, the reality of these waves was questioned. To\ndemonstrate it, the momentum imparted to test particles by such waves was\nevaluated. A closed form expression for this quantity was provided by Qadir and\nSharif, using an extension of the pseudo-Newtonian formalism. That formalism\ncarried with it the zero component of the momentum vector, which could not be\ninterpreted as the energy imparted to the test particle. Sharif proposed that\nit may represent the angular momentum imparted to test particles by\ngravitational waves. In this paper it is shown that this interpretation is not\nvalid. An alternative explanation has been provided."}, "authors": ["Asghar Qadir", "M. Sharif", "M. Shoaib"], "author_detail": {"name": "M. Shoaib"}, "author": "M. Shoaib", "arxiv_comment": "8 pages, LaTex", "links": [{"href": "http://arxiv.org/abs/gr-qc/0702074v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0702074v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0702074v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0702074v1", "journal_reference": "Nuovo Cim. B115 (2000) 419-425", "doi": null, "fulltext": "arXiv:gr-qc/0702074v1 14 Feb 2007\n\nThe Momentum Four-Vector in the\neψN Formalism and the Angular\nMomentum Imparted to Test\nParticles by Gravitational Waves\nAsghar Qadir∗, M. Sharif†and M. Shoaib\nDepartment of Mathematics, Quaid-i-Azam University,\nIslamabad, Pakistan\n\nAbstract\nSince gravitational waves are solutions of Einstein's field equations with a zero stress-energy tensor, the reality of these waves was\nquestioned. To demonstrate it, the momentum imparted to test particles by such waves was evaluated. A closed form expression for this\nquantity was provided by Qadir and Sharif, using an extension of the\npseudo-Newtonian formalism. That formalism carried with it the zero\ncomponent of the momentum vector, which could not be interpreted\nas the energy imparted to the test particle. Sharif proposed that it\nmay represent the angular momentum imparted to test particles by\ngravitational waves. In this paper it is shown that this interpretation\nis not valid. An alternative explanation has been provided.\n\nPACS: 04.20 Classical general relativity,\n04.20.Cv-Fundamental problems and general formalism,\n04.30 - Gravitational waves: theory.\n∗\n\nSenior Associate, Abdus Salam International Center for Theoretical Physics, Trieste,\nItlay\n†\nPermanent address: Department of Mathematics, Punjab University, LahorePakistan.\n\n1\n\n\f1\n\nIntroduction\n\nEinstein's General Relativity (GR) predicts the existence of gravitational\nwaves as solutions of the vacuum Einstein equations [1]. The significance\nof these solutions as gravitational waves was questioned on account of the\nfact that they cannot posses any energy, since the stress-energy tensor is zero\nThe problem was resolved by Ehlers and Kundt [2], Pirani [3] and Weber and\nWheeler [4], by considering test particles in the path of the waves. It was\nshown that these particles acquired momentum from the waves. The standard procedure [5] to evaluate the momentum is fairly complicated. Qadir\nand Sharif [6] provided a closed form expression for the momentum imparted\nin arbitrary spacetimes, using an extension [7] of the pseudo-Newtonian (ψN)\nformalism [8]. The original formalism applied to only static spacetimes and,\nin the appropriate Fermi Walker frame [9], gave a purely spatial force vector.\nIts extension to non-static spacetimes introduced a zero component for the\nforce vector. The problem was to interpret this extra term. The original ψN\nforce could be expressed as the gradient of a scalar potential but the spatial\npart of the eψN force had to be written as the spatial gradient of one potential and the zero component as the time derivative of another. This was not\nsatisfactory.The alternative method [6] of treating the force 4-vector as the\nproper time derivative of the momentum 4-vector was adopted. This procedure provided the momentum imparted to test particles by gravitational\nwaves as\nZ\npμ = Fμ dt,\n(1)\nwhere\n\ng ij gij,0\nA\nF0 = m[(ln( √ )),0 − ,0\n],\ng00\n4A\n√\nFi = m(ln g00 ),i ,\nq\n\nA = ( − det(gij )),0 .\n\n(2)\n(3)\n(4)\n\nIn this paper the problem of identification of the zero component of the\nmomentum 4-vector was mentioned. Sharif [10] proposed that it could be\ninterpreted as the spin imparted to test rods. In the next section this suggestion will be reviewed and it will be demonstrated that it does not work.\nTo find an alternative check on its validity, the geodesic analysis [2] for the\n\n2\n\n\fangular momentum imparted to test articles by gravitational waves is undertaken in sect. 3. Finally, in the conclusion a proposal for the interpretation\nof the zero component of the momentum 4-vector is discussed.\n\n2\n\nSpin Imparted to Test Particles by Gravitational Waves\n\nSharif [10] considered a test rod of length λ in the path of a gravitational\nwave whose preferred direction is given by li in the preferred reference frame.\nIt was argued that the maximum angular momentum imparted would be\nS i = p0 l i ,\n\n(5)\n\nwhere li is the vector representing the rod. Thus the maximum angular\nmomentum imparted to a test rod, when it lies in the plane perpendicular\nto the preferred direction, is\nS = p0 λ = mλ\n\nZ\n\nij\n[(ln(Af ),0 − g,0\ngij,0/4A]dt.\n\n(6)\n\nHence the physical significance of the zero component of the momentum 4vector would be that it provides an expression for the spin imparted to a test\nrod in an arbitrary spacetime.\nThis formula was applied to plane and cylindrical gravitational waves to\ngive, respectively, a constant S and\nS = −mλ[(1 + AJ 0 /ωρJ0′ ) ln |1 − 2AωρJ0′ cos(ωt) + constant.\n\n(7)\n\nNotice that here can be no spin angular momentum imparted to test\nparticles in a perfectly homogeneous and isotropic cosmological model; its\nhigh degree of symmetry, in particular, spherical symmetry - is incompatible\nwith spin being imparted to particles. However when we use the above\nformula for cosmological models, it gives exactly this error [11]. For example,\nconsider the Friedmann model, which is isotropic and homogeneous. For the\nflat Friedmann model\nη\nS = mλ ln .\n(8)\n2\nFor the closed Friedmann model there was a problem, as a straight forward\napplication of the formula led to an infinite value of F 0 at the phase of maximum expansion. This arose because the coefficient of F 0 in the constraint\n3\n\n\fequation vanished. The problem was resolved by re-setting the zero of acceleration at the phase of maximum expansion. Setting S to zero at the phase\nof maximum expansion.\nS = mλ[ln\n\nq\n\n1 − cos η −\n\n√\n3\n1\n5\ncos η +\ncos2 η + ln 2 + ].\n8\n16\n16\n\n(9)\n\nFor the open Friedmann model\nS = −mλ ln\n\nsinh η\n.\ncosh η − 1\n\n(10)\n\nEquations (8), (9) and (10) give a non-zero spin imparted to test particles\nby flat, open, and closed Friedmann models. Since no spin can be imparted,\nthe spin interpretation of p0 cannot be correct.\nFor the De Sitter universe in usual coordinates the spin turns out to be\nconstant and in the Lemaitre form to be\nS = −mλ(Λ/3)1/2 t + constant.\n\n(11)\n\nThis does not seem reasonable, because for the former version we could get rid\nof the spin by choosing the constant to be zero, while for the latter we cannot.\nThus it is clear that the interpretation is not even internally consistent.\n\n3\n\nThe Geodesic Analysis for the Angular Momentum Imparted to test Particles in Various Cosmological Models\n\nConsider a time-like congruence of world lines ( not necessarily geodetic) with\ntangent vector ua . Decompose ua;b by means of the operator hab projecting\ninto the infinitesimal 3-space orthogonal to ua [2]:\n1\nua;b = −ωab + σab + θhab − u̇a ub ,\n3\n\n(12)\n\nwhere\n− ωab ≡ u[a,b] + u̇[a ub] ,\nθ ≡ ua;a,\n\nu̇a = ua;b ub ,\n\nhab = gab + ua ub,\n4\n\n(13)\n(14)\n\n\f1\n(15)\nσab ≡ u(a;b) + u̇(a ub) − θhab (σaa = 0).\n3\nFor an observer along one of the world lines and using Fermi propagated\naxes, ωab describes the velocity of rotation, σab shear and θ the expansion\nof the cloud of neighboring free particles. Since the ψN-formalism uses the\nFermi-Walker frame, it could be expected that the results of this analysis\nshould be consistent with it, as indeed they are for the momentum imparted.\nFor our purpose only ωab is needed. Choose the coordinates so that the\ntangent vector is ua = √g100 δ0a . Thus, from eq.(13) we have\n1\nωi0 = −\n2\n\n(\n\n0\n0\n\ni\n\n)\n\n(i = 1, 2, 3),\n\n(16)\n\nfor the cases when g00 = 1. For the Friedmann or the Lemaitre form of the\nDe Sitter universe this gives zero. Even for the De Sitter universe in usual\ncoordinates we get a zero spin, as required. For the Gödel universe the spin\nturns out to be the physically reasonable.\nω10 = −\n\n1 am2 (x)\n,\n4 l(x) + m2 (x)\n\nω20 = ω30 = 0.\n\n(17)\n\nFor gravitational waves we have to introduce a procedure so that the\nspacetime is Minkowski before the wave arrives and acquires a non-static\nmetric afterwards. The geodesic analysis for gravitational waves is given\nelsewhere [12] as it is not directly relevant here. The expressions are quite\ncomplicated, involving delta functions so as to incorporate the step function\non the metric. They are consequently omitted here.\n\n4\n\nConclusion\n\nIn the absence of any momentum 3-vector and F0 , we should be able to\nidentify p0 with E. Thus we define\n0\n\n∆E = p − E = g\n\n00\n\nZ\n\n1\n\nF0 dt − [(m2 − pi pj gij ) 2 + m],\n\n(18)\n\nwhere the last term corresponds to an integration constant. Let us calculate\nthis difference for the three cases of the Friedmann metric. They give ∆E =\nS/λ, with S given by eqs.(8), (9) and (10) for the corresponding cases.\n5\n\n\fThe three expressions have the same asymptotic behavior for sufficiently\nsmall values of η, namely ∆E ∼ m ln η. At the phase of maximum expansion\nof the closed model we get ∆E = m(ln 2 + 3/4). We could equally well have\nset ∆E = 0 at the phase of maximum expansion and had a difference for it\nfrom the other two cases for small η (in the constant term). Note that for\nall the three models ∆E diverges as η goes to zero and it also diverges as η\ngoes to 2π for the closed model. For k = +1 we have chosen to display the\nconstant term so ∆E for the closed Friedmann model with m taken to be\nunity. This becomes infinite at the bang and the crunch and becomes zero at\nthe phase of maximum expansion. ∆E for the flat Friedmann model, again\nm is taken to be unity. ∆E diverges at the bang only. ∆E for the open\nFriedmann model, again m is taken to be unity. Again, ∆E diverges at the\nbang only. that ∆E = 0 at η = π. The proposal does not seem inconsistent,\nbut still needs further discussion. For this purpose we shall briefly recall the\nkey points of the definition of the eψN-force.\nThe original ψN-formalism, constructed for static spacetimes only, was\nbased on the observation that even in free-fall the tidal force can be operationally determined by an accelerometer consisting of two masses connected\nby a spring, whose end can move as a needle on a dial. Using Riemann normal coordinates, the extremal value of this tidal force gives the directional\nderivative of the relativistic analogue of the Newtonian gravitational force,\ncalled the ψN-force. The extension to non-static spacetimes was achieved\nby retaining the requirement of Riemann normal coordinates spatially, but\ndropping it temporally. Consequently, a \"memory\" of the zero-setting of\nthe accelerometer is built into the formalism. Note that in the case of the\nclosed Friedmann model the \"memory\" comes from the phase of maximum\nexpansion rather than from the bang, or any other time prior to the present.\nThe fact that F0 has the zero setting built into it is the key to the interpretation of both F0 and p0 . Essentially, as F0 has the dimensions of\npower, it should correspond to the \"power\" imparted to the test particle, or\nabsorbed from it, by the gravitational field of the spacetime. For a static\nspacetime this would be zero, as energy would be conserved. However, in\na time-varying spacetime there must be energy imparted to, or withdrawn\nfrom, all (test) particles in it. This would provide a direct measure of the\nextent of non-conservation of energy in the spacetime.\nThe interpretation of p0 in the ψN-formalism is now clear. It is the extra\nenergy imparted to test particles or extracted from them) by the gravitational\nfield, in the following sense. The energy imparted, as at the time considered,\n6\n\n\frelative to the spacetime then is the usual.\nET = E +\n\nZ\n\nF0 dt = E + p0 .\n\n(19)\n\nIt should be borne in mind that p0 can be negative. It may also be remarked\nthat the previously introduced \"second potential\", U, is the same as p0 (up\nto an arbitrary constant of integration, not fixed for either of them).\nThe question still unanswered is how to convert this measure of the gravitational energy of the field into an actual expression for it, without reference\nto the test particle. The problem is that the mass of the test particle enters\ninto the expression for the energy. The problem is that the mass of the test\nparticle enters into the expression for the energy. One would be tempted\nto replace it by ρdV, and use the energy density in the spacetime to obtain\nρ. This procedure cannot work. To see this, consider a gravitational wave\nspacetime. Clearly, it does not have any stress-energy tensor, and hence one\nwould have to put ρ = 0. However, there is obviously a gravitational energy\nin the field, p0 6= 0, in general.\nOne needs to, somehow, use the very gravitational energy of the field we\nare trying to evaluate to give the required ρ. How this is to be done is not\nclear at present.\nAcknowledgments\nOne of us (AQ) would like to thank Prof. R. Ruffini for financial support\nat ICRA, where some of this work was done and two of us (AQ and M.\nShoaib) would like to acknowledge the Quaid-i-Azam University Research\nFund for support facilities for this work.\nReferences\n[1] Misner C.W., Thorne K.S. and Wheeler J.A., Gravitation (W.H. Freeman, San Francisco) 1973.\n[2] Ehlers J. and Kundt W., Gravitation: An Introduction to Current Research, edited by L. Witten (Wiley, New York) 1962, p. 49.\n[3] Pirani F.A.E., Gravitation:An Inroduction to Current Research, eidted\nby L. Witten (Wiley, New York) 1962, p. 199.\n7\n\n\f[4] Weber J. and Wheeler J.A., Rev Mod. Phys., 29(1957)509.\n[5] Weber J., General Relativity and Gravitational Waves (Interscience, New\nYork) 1961.\n[6] Qadir A. and Sharif M., Phys. Lett. A167(1992)331.\n[7] Qadir A. and Sharif M., Nuovo Cimento B107(1992)1071;\nSharif M., Ph.D Thesis, Quaid-i-Azam University (1991).\n[8] Qadir A., Nuovo Cimento B112(1997)485;\nMahajan S.M., Qadir A. and Valanju P.M., Nuovo Cimento B65(1981)\n404;\nQuamar J., Ph.D. Thesis, Quaid-i-Azam University (1984);\nQadir A. and Quamar J., Proceedings of the Third Marcel Grossman\nMeeting on General Relativity, edited by Hu Ning (Science Press and\nNorth Holland Publishing Co.) 1983, p. 189.\n[9] Qadir A. and Zafarullah I., Nuovo Cimento B111(1996)79.\n[10] Sharif M., Astrophys. Space Sci., 253(1997)159.\n[11] Sharif M., Astrophys. Space Sci., 262 (1999)297.\n[12] Shoaib M., M. Phil dissertation, Quaid-i-Azam University (1999).\n\n8\n\n\f"}