{"id": "http://arxiv.org/abs/gr-qc/0602010v1", "guidislink": true, "updated": "2006-02-02T17:30:28Z", "updated_parsed": [2006, 2, 2, 17, 30, 28, 3, 33, 0], "published": "2006-02-02T17:30:28Z", "published_parsed": [2006, 2, 2, 17, 30, 28, 3, 33, 0], "title": "Group field theory formulation of 3d quantum gravity coupled to matter\n  fields", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0602116%2Cgr-qc%2F0602021%2Cgr-qc%2F0602015%2Cgr-qc%2F0602017%2Cgr-qc%2F0602119%2Cgr-qc%2F0602025%2Cgr-qc%2F0602114%2Cgr-qc%2F0602001%2Cgr-qc%2F0602107%2Cgr-qc%2F0602098%2Cgr-qc%2F0602060%2Cgr-qc%2F0602095%2Cgr-qc%2F0602038%2Cgr-qc%2F0602005%2Cgr-qc%2F0602061%2Cgr-qc%2F0602082%2Cgr-qc%2F0602023%2Cgr-qc%2F0602094%2Cgr-qc%2F0602069%2Cgr-qc%2F0602034%2Cgr-qc%2F0602066%2Cgr-qc%2F0602115%2Cgr-qc%2F0602113%2Cgr-qc%2F0602020%2Cgr-qc%2F0602013%2Cgr-qc%2F0602051%2Cgr-qc%2F0602010%2Cgr-qc%2F0602083%2Cgr-qc%2F0602099%2Cgr-qc%2F0602117%2Cgr-qc%2F0602032%2Cgr-qc%2F0602009%2Cgr-qc%2F0602039%2Cgr-qc%2F0602084%2Cgr-qc%2F0602081%2Cgr-qc%2F0602101%2Cgr-qc%2F0602112%2Cgr-qc%2F0602076%2Cgr-qc%2F0602071%2Cgr-qc%2F0602002%2Cgr-qc%2F0602030%2Cgr-qc%2F0602029%2Cgr-qc%2F0602096%2Cgr-qc%2F0602047%2Cgr-qc%2F0602065%2Cgr-qc%2F0602100%2Cgr-qc%2F0602011%2Cgr-qc%2F0602054%2Cgr-qc%2F0602037%2Cgr-qc%2F0602073%2Cgr-qc%2F0602079%2Cgr-qc%2F0602053%2Cgr-qc%2F0602102%2Cgr-qc%2F0602097%2Cgr-qc%2F0602088%2Cgr-qc%2F0602062%2Cgr-qc%2F0602044%2Cgr-qc%2F0602106%2Cgr-qc%2F0602104%2Cgr-qc%2F0602057%2Cgr-qc%2F0602059%2Cgr-qc%2F0602050%2Cgr-qc%2F0602087%2Cgr-qc%2F0602067%2Cgr-qc%2F0602103%2Cgr-qc%2F0602006%2Cgr-qc%2F0602003%2Cgr-qc%2F0602016%2Cgr-qc%2F0602019%2Cgr-qc%2F0602018%2Cgr-qc%2F0602027%2Cgr-qc%2F0602035%2Cgr-qc%2F0602024%2Cgr-qc%2F0602056%2Cgr-qc%2F0602086%2Cgr-qc%2F0602048%2Cgr-qc%2F0602007%2Cgr-qc%2F0602068%2Cgr-qc%2F0602036%2Cgr-qc%2F0602120%2Cgr-qc%2F0602091%2Cgr-qc%2F0602040%2Cgr-qc%2F0602046%2Cgr-qc%2F0602074%2Cgr-qc%2F0602022%2Cgr-qc%2F0602045%2Cgr-qc%2F0006056%2Cgr-qc%2F0006072%2Cgr-qc%2F0006095%2Cgr-qc%2F0006099%2Cgr-qc%2F0006012%2Cgr-qc%2F0006001%2Cgr-qc%2F0006060%2Cgr-qc%2F0006040%2Cgr-qc%2F0006035%2Cgr-qc%2F0006005%2Cgr-qc%2F0006029%2Cgr-qc%2F0006075%2Cgr-qc%2F0006090%2Cgr-qc%2F0006045%2Cgr-qc%2F0006021&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Group field theory formulation of 3d quantum gravity coupled to matter\n  fields"}, "summary": "We present a new group field theory describing 3d Riemannian quantum gravity\ncoupled to matter fields for any choice of spin and mass. The perturbative\nexpansion of the partition function produces fat graphs colored with SU(2)\nalgebraic data, from which one can reconstruct at once a 3-dimensional\nsimplicial complex representing spacetime and its geometry, like in the\nPonzano-Regge formulation of pure 3d quantum gravity, and the Feynman graphs\nfor the matter fields. The model then assigns quantum amplitudes to these fat\ngraphs given by spin foam models for gravity coupled to interacting massive\nspinning point particles, whose properties we discuss.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0602116%2Cgr-qc%2F0602021%2Cgr-qc%2F0602015%2Cgr-qc%2F0602017%2Cgr-qc%2F0602119%2Cgr-qc%2F0602025%2Cgr-qc%2F0602114%2Cgr-qc%2F0602001%2Cgr-qc%2F0602107%2Cgr-qc%2F0602098%2Cgr-qc%2F0602060%2Cgr-qc%2F0602095%2Cgr-qc%2F0602038%2Cgr-qc%2F0602005%2Cgr-qc%2F0602061%2Cgr-qc%2F0602082%2Cgr-qc%2F0602023%2Cgr-qc%2F0602094%2Cgr-qc%2F0602069%2Cgr-qc%2F0602034%2Cgr-qc%2F0602066%2Cgr-qc%2F0602115%2Cgr-qc%2F0602113%2Cgr-qc%2F0602020%2Cgr-qc%2F0602013%2Cgr-qc%2F0602051%2Cgr-qc%2F0602010%2Cgr-qc%2F0602083%2Cgr-qc%2F0602099%2Cgr-qc%2F0602117%2Cgr-qc%2F0602032%2Cgr-qc%2F0602009%2Cgr-qc%2F0602039%2Cgr-qc%2F0602084%2Cgr-qc%2F0602081%2Cgr-qc%2F0602101%2Cgr-qc%2F0602112%2Cgr-qc%2F0602076%2Cgr-qc%2F0602071%2Cgr-qc%2F0602002%2Cgr-qc%2F0602030%2Cgr-qc%2F0602029%2Cgr-qc%2F0602096%2Cgr-qc%2F0602047%2Cgr-qc%2F0602065%2Cgr-qc%2F0602100%2Cgr-qc%2F0602011%2Cgr-qc%2F0602054%2Cgr-qc%2F0602037%2Cgr-qc%2F0602073%2Cgr-qc%2F0602079%2Cgr-qc%2F0602053%2Cgr-qc%2F0602102%2Cgr-qc%2F0602097%2Cgr-qc%2F0602088%2Cgr-qc%2F0602062%2Cgr-qc%2F0602044%2Cgr-qc%2F0602106%2Cgr-qc%2F0602104%2Cgr-qc%2F0602057%2Cgr-qc%2F0602059%2Cgr-qc%2F0602050%2Cgr-qc%2F0602087%2Cgr-qc%2F0602067%2Cgr-qc%2F0602103%2Cgr-qc%2F0602006%2Cgr-qc%2F0602003%2Cgr-qc%2F0602016%2Cgr-qc%2F0602019%2Cgr-qc%2F0602018%2Cgr-qc%2F0602027%2Cgr-qc%2F0602035%2Cgr-qc%2F0602024%2Cgr-qc%2F0602056%2Cgr-qc%2F0602086%2Cgr-qc%2F0602048%2Cgr-qc%2F0602007%2Cgr-qc%2F0602068%2Cgr-qc%2F0602036%2Cgr-qc%2F0602120%2Cgr-qc%2F0602091%2Cgr-qc%2F0602040%2Cgr-qc%2F0602046%2Cgr-qc%2F0602074%2Cgr-qc%2F0602022%2Cgr-qc%2F0602045%2Cgr-qc%2F0006056%2Cgr-qc%2F0006072%2Cgr-qc%2F0006095%2Cgr-qc%2F0006099%2Cgr-qc%2F0006012%2Cgr-qc%2F0006001%2Cgr-qc%2F0006060%2Cgr-qc%2F0006040%2Cgr-qc%2F0006035%2Cgr-qc%2F0006005%2Cgr-qc%2F0006029%2Cgr-qc%2F0006075%2Cgr-qc%2F0006090%2Cgr-qc%2F0006045%2Cgr-qc%2F0006021&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a new group field theory describing 3d Riemannian quantum gravity\ncoupled to matter fields for any choice of spin and mass. The perturbative\nexpansion of the partition function produces fat graphs colored with SU(2)\nalgebraic data, from which one can reconstruct at once a 3-dimensional\nsimplicial complex representing spacetime and its geometry, like in the\nPonzano-Regge formulation of pure 3d quantum gravity, and the Feynman graphs\nfor the matter fields. The model then assigns quantum amplitudes to these fat\ngraphs given by spin foam models for gravity coupled to interacting massive\nspinning point particles, whose properties we discuss."}, "authors": ["Daniele Oriti", "James Ryan"], "author_detail": {"name": "James Ryan"}, "author": "James Ryan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/23/22/027", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0602010v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0602010v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "RevTeX; 28 pages, 21 figures", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0602010v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0602010v1", "journal_reference": "Class.Quant.Grav. 23 (2006) 6543-6576", "doi": "10.1088/0264-9381/23/22/027", "fulltext": "Group field theory formulation of 3d quantum gravity coupled to matter fields\nDaniele Oriti∗ and James Ryan†\nDepartment of Applied Mathematics and Theoretical Physics,\nCentre for Mathematical Sciences,\nUniversity of Cambridge,\nCambridge CB3 0WA, England, EU\n\narXiv:gr-qc/0602010v1 2 Feb 2006\n\nABSTRACT\nWe present a new group field theory describing 3d Riemannian quantum gravity coupled to matter\nfields for any choice of spin and mass. The perturbative expansion of the partition function produces\nfat graphs colored with SU (2) algebraic data, from which one can reconstruct at once a 3-dimensional\nsimplicial complex representing spacetime and its geometry, like in the Ponzano-Regge formulation\nof pure 3d quantum gravity, and the Feynman graphs for the matter fields. The model then assigns\nquantum amplitudes to these fat graphs given by spin foam models for gravity coupled to interacting\nmassive spinning point particles, whose properties we discuss.\n\nI.\n\nINTRODUCTION\nA.\n\nBackground\n\nSpin foam models [1, 2] emerged recently as a general formalism for quantum gravity, and a point of convergence of\ndifferent approaches, including loop quantum gravity (of which they may be thought of as a path integral formulation),\ntopological field theories using ideas from category theory, and simplicial gravity. They assign geometric data to the\nsimplicial spacetime in an algebraic form. In turn, spin foam models have been shown to be obtainable from so-called\ngroup field theories [3, 4], i.e. field theories over group manifolds that can be seen as a generalisation of matrix\nmodels in that they produce, in their perturbative expansion in Feynman graphs, a sum over simplicial complexes of\ndimension higher than 2, with the configuration/momentum variables of the field being interpreted as geometric data\nfor these complexes. This sum over simplicial complexes constructed as Feynman diagrams of the group field theory,\nimplies also a sum over topologies; therefore the group field theory formalism can be interpreted [3, 4] as a realization\nof a third quantization of gravity at the simplicial level. There exist promising and currently much studied spin foam\nmodels, and group field theories, in 4-dimensions [1, 2], whose validity is, however, still under investigation. In the\nsimpler case of 3-dimensional gravity (both Riemannian and Lorentzian, with and without cosmological constant) it\nis now established that spin foam models provide a consistent quantization, equivalent, but also presenting distinctive\nadvantages, to those obtained from other approaches. The relevant model for 3d gravity without cosmological constant\nis the Ponzano-Regge model [5], whose group field theory derivation was given by Boulatov in [6].\nThe coupling of matter fields to quantum gravity in the spin foam framework is of paramount importance for various\nreasons, apart from the obvious one that for a consistent theory of quantum gravity to be correct, it should be able to\ndescribe in full the interactions between gravity and matter fields. First of all, matter coupling may provide the best,\nif not the only, way to define quantum observables for the theory that have a clear physical meaning, given that such\nobservables are very difficult to define in a pure gravity theory [7, 8, 9]. In particular, the inclusion of matter fields\nmay prove to be the main avenue towards the construction of a quantum gravity phenomenology that could be put to\ntest in future experiments [10], the idea being that quantum gravity will modify the usual dynamics of matter fields\n(e.g. dispersion relations, scattering amplitudes, etc.) even in an approximately flat background, leading to potentially\ntestable effects. Also, it is hoped that quantum gravity will not only modify the usual predictions of quantum field\ntheory, but also solve various problems of the same, including that of ultraviolet divergences, providing a kind of\nbuilt-in covariant cut-off at the Planck scale. Whether any of these hopes are actually fulfilled can be shown only by\nexplicit work on matter couplings in quantum gravity models, including spin foams. Recently much research has been\n\n∗\n†\n\nd.oriti@damtp.cam.ac.uk\nj.p.ryan@damtp.cam.ac.uk\n\n\f2\ndevoted to this issue. After some more speculative proposals [13, 14, 15], a spin foam model for gravity coupled to\ngauge fields in 4d has been constructed in [16], and later re-derived using different methods in [17], but most of the\nwork on matter fields in spin foam models for quantum gravity has been done in the past two years [5, 11, 12, 18, 25]\nand focused on the 3d case. The work of [18], starts off from a canonical perspective and build on results that have\nbeen obtained in the context of loop quantum gravity [19, 20, 21, 22], and obtains a spin foam description of the\ndynamics of matter and quantum gravity by an explicit construction of the projector onto physical quantum states\nof the coupled system. On the other hand the construction of [5, 11, 12] uses a covariant/path integral picture from\nthe start and is phrased in a discrete (simplicial) context. It is then more directly linked both in terms of language\nused and results obtained to the group field theory context. In fact, in this paper we are going to construct a group\nfield theory whose corresponding Feynman amplitudes are exactly the spin foam amplitudes for gravity coupled to\nparticles of any spin derived in [5] and further analysed in [11, 12]. The basic ideas of the construction in [5] are the\nfollowing: 1) Feynman graphs for particle interactions (like those coming from usual quantum field theories), including\ntheir coupling with gravity, can be considered as (non-local) observables for quantum gravity, and therefore treated as\nsuch, i.e. inserted as appropriate operators in the pure gravity partition function, so that the theory would allow the\ncomputation of their expectation value; the formal expression of this expectation value is that of a modified spin foam\nmodel where the modified amplitudes encode both the geometric and particle degrees of freedom; 2) matter arises as\na kind of symmetry-breaking singular configuration of the gravitational field, in the sense that pure gauge degrees of\nfreedom are turned into physical degrees of freedom (characterizing matter) at the location of the particles. We will\nsee in the following how these ideas are realised also in our model at the group field theory level. In particular, the first\nidea has a very natural implementation in the group field theory formalism (in a sense, it suggests such a formalism)\nand it is rather new and likely to be a key for future developments towards quantum gravity phenomenology, thanks to\nthe possibility of extracting an effective non-commutative field theory for matter fields encoding the quantum gravity\neffects [12]. On the other hand, the idea of matter as a topological defect of gravity in 3d is well-established since\nthe work of S. Deser, R. Jackiw, and G. 't Hooft [23, 24] both at the classical and quantum continuum level, but\nfinds a beautiful purely algebraic and combinatorial realisation in the spin foam construction of [5], and therefore in\nthe present work. A similar use of Feynman graphs as observables for quantum gravity, as a basis for studying the\ncoupling of matter fields to it, was done in [25] in the context of the Turaev-Viro spin foam model for 3d gravity\nwith cosmological constant, where the diagrams considered included colored knots. It is of great importance for the\ngroup field theory programme [3, 4] to be able to include matter couplings in it, and reproduce the known coupled\nspin foam models, in order to be entitled to consider it a fundamental definition of a theory of quantum gravity,\nand in particular as the truly fundamental definition of spin foam models themselves, rather than just an auxiliary\nformalism. Work on a group field theoretic description of quantum gravity coupled to matter fields has started only\nvery recently, the first constructions having been presented in [26] and [27]. In [26] a very elegant extension of the\nBoulatov group field theory model for 3d quantum gravity to the DSU (2) quantum group is performed, motivated\nby the fact that the coupled spin foam amplitudes of [5] present a symmetry under this particular deformation of\nthe Poincare' group [11] and that particle states result in being labeled by DSU (2) representations. However, the\nresulting model does not have a clear interpretation in terms of particle configurations. Still in [26] a new class of\nspin foam models admitting such interpretation is constructed using chain mail techniques (see also [11]), but with no\nderivation of the same from group field theories. In [27] a group field theory that produces spin foam amplitudes for\nmatter coupled to 3d gravity was proposed, and shown to reproduce the amplitudes of [5] in the special case of massive\nscalar particles/fields (more precisely, for particles with no spin nor angular momentum). The model we present in\nthis paper can be seen as a generalisation and an appropriate modification of that proposed in [27]; it does not only\ngeneralise it to the case of spinning matter fields and generic interaction, but it also uses a simpler formalism with a\nclearer physical interpretation, as we will show in the following. This is not a direct generalisation, however, in the\nsense that even in the particular case of spinless particles it provides an alternative way to couple matter to gravity in\ngroup field theory, as we will see in the following. We believe that the model in [27] has a very interesting structure\nand that its peculiar features deserve further investigation.\nB.\n\nThe new GFT model: general ideas\n\nLet us summarise and introduce the main ideas behind our model. Of course, all of the following will be made\nprecise and explicit later in this work. The spin foam model of [5], as we mentioned above, is based (as is the work of\n[25]) on the idea that one should couple a full history of particle interactions and evolution, represented by a Feynman\n\n\f3\ndiagram of the type produced by matter field theories, to a history of the gravitational field represented by a spin\nfoam, and define an appropriate quantum amplitude for the composite history. Now, the spin foam itself is just a\nspecific Feynman diagram for the group field theory so that the coupled spin foam is best interpreted as a Feynman\ndiagram for both gravity and matter fields and this leads naturally to the search for the modified group field theory\nthat generates it in its perturbative expansion. This means that we want to realise the third quantization of gravity in\na simplicial setting and the second quantization of matter living on the same simplicial structures in one stroke, and\ndefine a field theory on a group manifold that produces at once, in perturbative expansion, a sum over spacetimes and\ngeometries and a sum over Feynman diagrams for matter interactions, understood as taking place in such spacetimes.\nAs for the representation of matter degrees of freedom, we base ourselves on the extensive knowledge of matter in\n3d gravity coming from both continuum classical analyses [23], loop quantum gravity [18] and spin foams [5]. By\nvirtue of its spin (and angular momentum), a particle breaks locally the gauge invariance of pure gravity, so that the\nSU (2) gauge degrees of freedom are turned into physical degrees of freedom of the particle at its location. This is a\nkinematical feature that is evident before any dynamics are imposed. In the framework of loop quantum gravity, and\nthus for what concerns the boundary states of spin foam models, this implies that the relevant combinatorial/algebraic\nstructures describing states of the gravity+matter system are open spin networks with one loose end labelled by the\nspin of the particle; one can thus encode the presence of a particle in the spin network describing a boundary state of\na spin foam model by replacing one of its 3-valent vertices (in 3d) with a 4-valent vertex having an extra loose link\nlabelled with the particle data. In the dual simplicial geometric interpretation of spin networks in a spin foam context,\nthis means that one is replacing a triangle on the boundary of the simplicial 3-manifold dual to the spin foam, with\na modified triangle carrying a particle and thus possessing a modified geometry. In the simplicial third quantization\nprovided by the group field theory the object that corresponds to a geometric triangle is the field itself, so the starting\nidea for extending the setting to include spinning particles is to allow for a different type of field with a modified\ncombinatorial structure and a modified gauge symmetry, as we will see. The mass of the particles can be dealt with\nat the dynamical level, since it does not influence the kinematics of the fields, and should manifest itself by producing\nlocally a deviation from the pure gravity flatness constraint at the location of the particle, i.e. as the presence of\ndistributional curvature or a conical singularity along the particle trajectories. In other words, we are going to encode\nthe presence of a massive particle in its interaction with the gravitational field. So we modify the interaction term\nof the pure gravity group field theory to include extra terms describing both the interaction of matter fields among\nthemselves (modified by the gravity degrees of freedom), and the propagation of these matter fields in the quantum\ngravity background, effected by the generation of curvature along the particle trajectory, again following [5].\nThe end result is a field theory whose perturbative expansion gives fat graphs, as in the pure gravity case, but with\nextra combinatorial structures and algebraic data, so that one can identify from them both a labelled 2-complex that\nallows to reconstruct a 3d triangulation, its geometry and a Feynman graph for the interacting matter fields (of any\nspin and mass) alongside it. The quantum amplitudes for these fat graphs then describe how the matter field Feynman\ngraphs are embedded in the simplicial complex and assign a total probability amplitude to the gravity plus matter\nconfiguration, that coincide with the amplitudes constructed in [5].\nII.\n\nTHE MODEL\n\nTo recapitulate, the main aim for this section is to construct a group field theory with the following hallmark: when\nwe expand its partition function, the sum over Feynman diagrams contains a sum over spin foams for matter coupled\nto gravity. These spin foam amplitudes were obtained recently from a path integral quantisation of first order gravity\ncoupled to relativistic point particles (with arbitrary spin) [5]. Results and properties of this model are outlined in\nAppendix A, and we will refer to these spin foam amplitudes as Coupled Ponzano-Regge (CPR) amplitudes.\nIn conventional field theory, we usually distinguish between kinematic (field and symmetries) and dynamic structures\n(action, partition function, etc). We follow a similar route here.\nThe outline of this section is as follows: we begin by defining the fields and their symmetries and show how they\nincorporate the kinematic scene; later, we define an action and examine its dynamic input; finally, we provide a more\nin-depth discussion of generic Feynman amplitudes to link back to the spin foam stage.\n\n\f4\nA.\n\nClassical and quantum kinematics\n\nWe divide our exploration of the kinematic sector into two parts: pure gravity and matter coupled to gravity, dealing\nwith both in a similar way.\nWe describe the pure gravity sector of our theory using the field arising in Boulatov's field theory [6]. This theory\nis a GFT for 3d Riemannian quantum gravity: its Feynman diagrams are Ponzano-Regge (PR) spin foams associated\nto 3-(pseudo)manifolds. The sum in the expansion of the partition function is over all geometries for given topology\nand chosen triangulation (that is, over all triangulations for given topology), as well as over all topologies. Since the\nPR amplitude is a topological invariant it does not depend on the geometry. First of all, the field is defined as a map\nfrom the Cartesian product of three copies of SU(2) to the complex numbers:\nφ : SU(2) × SU(2) × SU(2) → C;\n\nφ(g1 , g2 , g3 ).\n\n(1)\n\nWe refer to this field as the Boulatov field. It has two symmetries:\n• we require φ to be invariant under (even) elements σ of the permutation group of three elements S3 , acting on\nthe field variables,\nφ(g1 , g2 , g3 ) = φ(gσ(1) , gσ(2) , gσ(3) ),\n\n(2)\n\nthe Feynman amplitudes produced by the corresponding group field theory are in one-to-one correspondence\nwith orientable 2-complexes, as explained in [37, 38]; odd permutations map this field to its complex conjugate;\n• we require the field to be Lorentz invariant; we ensure this by projecting the field onto its SU(2) invariant part:\nZ\nPα φ(g1 , g2 , g3 ) ≡\ndα φ(g1 α, g2 α, g3 α).\n(3)\nSU(2)\n\nNow that we have defined the field and its symmetries we want to recover a full understanding of how these structures\nrelate to the kinematic regime. We then expand this field into its Fourier modes by means of a Peter-Weyl decomposition. This gives a field dependence on three irreducible representations, one corresponding to each copy of SU(2).\nWe perform the expansion on the projected field in Appendix B explicitly and the result is:\nX p\nj3\nj2\nj1\nj1 j2 j3\nPα φ(g1 , g2 , g3 ) =\ndj1 dj2 dj3 Φm\n(4)\n(g3 )Cnj11 nj22 nj33 ,\n(g2 )Dm\n(g1 )Dm\nDm\n3 n3\n2 n2\n1 n1\n1 m2 m3\nji ,mi ,ni\n1≤i≤3\n\nwhere D is a representation matrix of SU(2), C is an SU(2) 3j-symbol and dj is the dimension of the j representation.\nFurthermore, the field Φ has the symmetries of an SU(2) 3j-symbol1.\nThe group field theory formalism is a path integral formulation and transition amplitudes arise as 'two-point'\nfunctions where the two 'points' are possible boundary data of the theory. The states have the same structure as spin\nnetwork functionals. These are 'coloured' closed trivalent graphs, where the edges are labelled by matrix elements\nj\nDmn\n(g) of the holonomy g along the edge in a fixed representation j and the vertices are labelled by invariant\nintertwiners Cnj11 nj22 nj33 contracting the matrices. Thus a single vertex and its three incident edges are given by\nj3\nj2\nj1\n(g3 )Cnj11 nj22 nj33 ,\n(g2 )Dm\n(g1 )Dm\nDm\n3 n3\n2 n2\n1 n1\n\n(5)\n\nwhich we recognise from (4) as constituting much of the Boulatov field. Indeed, we seek a way to translate the spin\nnetwork functional into the language of group field theory. We accomplish this naturally by considering the same spin\nj2 j3\nwhich is\nnetwork graphs but with the edges now labelled by the fixed representation and the vertices by Φjm1 1 m\n2 m3\nindeed an invariant intertwiner. Thus a boundary state in the Boulatov model is a product of Φ fields [39], contracted\n\n1\n\nThe 3j-symbol is the unique invariant intertwiner of three representations of SU(2).\n\n\f5\n\nFIG. 1: The pure gravity field.\n\nwith respect to the 'magnetic' indices m, and diagrammatically represented by a spin network. This state charts the\ngravitational information of a 2d hypersurface.\nAs for the geometric interpretation, in the kinematic arena, a spin network vertex is dual topologically to a triangle,\nthe representations are related to its edge lengths and the intertwiner ensures that the triangle inequalities are satisfied;\ntherefore, we think of the Boulatov field as representing a triangle in the triangulation of a boundary 2-manifold\nkinematically, and later of a 3-manifold dynamically.\nThere is a new field to represent the sector of our theory where matter couples to gravity. This field provides us with\nexplicit information about the momentum and spin of the particle. These are the two quantities needed to thoroughly\naccount for a point particle coupled to gravity. We define the field as a map from the Cartesian product of four copies\nof SU(2) to the complex numbers:\nψs (g1 , g2 , g3 ; u) : SU(2) × SU(2) × SU(2) × SU(2) → C.\n\n(6)\n\nWe refer to ψs as the coupled field. It has four arguments, the first three still encapsulate the gravitational degrees of\nfreedom while the new fourth argument is related to the momentum of the particle. We perform a partial decomposition\nto clarify the definition of the field.\nX\nI\nI\nψs (g1 , g2 , g3 ; u) =\nψsn\n(g1 , g2 , g3 )Dsn\n(u).\n(7)\nI,n\n\nThe s index is fixed and refers to the spin of the particle, the representation I denotes its total angular momentum.\nAlso, the new field ψs can be understood as the result of projecting a generic four-argument field ψ to a specific\nspin component s by means of a projector operator Ps acting, on its fourth argument, as:\nψs (g1 , g2 , g3 ; u) = (Ps ψ)(g1 , g2 , g3 ; u) =\n\nXZ\nJ\n\nSU(2)\n\nJ\ndgdJ Dss\n(ug −1 ψ(g1 , g2 , g3 ; g).\n\n(8)\n\nWe impose one symmetry on the field. This is Lorentz symmetry that is once again ensured by projection onto the\nSU(2) invariant part of the field, by simultaneous right action on all four arguments:\nZ\ndα ψs (g1 α, g2 α, g3 α; uα).\n(9)\nPα ψs (g1 , g2 , g3 ; u) ≡\nSU(2)\n\nWe will discuss later why we do not impose permutation symmetry and what consequences this has on the resulting\nFeynman amplitudes.\nOnce again we expand this field into its Fourier modes:\nX\nXp\nI\nj3\nj2\nj2 j3 I L j1\ndj1 dj2 dj3 dI Ψjm1 1 m\nPα ψs (g1 , g2 , g3 ; u) =\n(g3 )Dsn\n(u)C̃nj11 nj22 nj33 nI L , (10)\n(g2 )Dm\nDm1 n1 (g1 )Dm\n3 n3\n2 n2\n2 m3 s\nI,n,ji ,mi ,ni L\n1≤i≤3\n\nwhere C̃ is an invariant intertwiner of four representations, L labels a basis in the space of 4-valent intertwiners2 and\nΨ has the symmetries of a 4-valent SU (2) intertwiner.\n\n2\n\nThe vector space of 4-valent intertwiners is not 1-dimensional, unlike the trivalent case.\n\n\f6\nWe use our knowledge of the boundary states of the CPR spin foam model to explain the kinematic information\ncontained in the coupled field. The boundary spin foam states for matter coupled to gravity are open coloured trivalent\nspin network functionals. That is, some edges do not join trivalent vertices but instead join a trivalent vertex to an\nendpoint. On these edges and endpoints reside the kinematic data of the particles. The edges are labelled with the\nmatrix elements of the holonomy along that edge and at the endpoints are projected down to the spin-s component.\nThe matrix elements naturally furnish the particle arena with a Poincaré representation labelled by its spin and mass\n(s, m):\nM\b\nI\nVs,m =\nDsn\n(u) : I − s ∈ N ; |n| ≤ I .\n(11)\nI\n\nIn the Poincaré representation of a particle, I labels the particle's total angular momentum, s its spin, and u its\nmomentum. Therefore, we label a trivalent vertex with an open edge and two normal edges with\nI\nj2\nj1\n(g2 )Dsn\n(u)Cnj11 nj22 nI .\n(g1 )Dm\nDm\n2 n2\n1 n1\n\n(12)\n\nTo translate this state into the GFT language we want to consider the same open trivalent spin network and label\nthe edges with representations and the trivalent vertices with fields, as we did in the pure gravity case. For those\nvertices with three normal edges, we can label them as before with the Boulatov field. For those special vertices with\nj2 j3 I L\nan open edge, we wish to label them with the coupled field Ψjm1 1 m\n; this naturally labels a 4-valent vertex, which\n2 m3 s\nin turn can be decomposed into two trivalent vertices joined by a new intermediate edge that is labelled by the SU(2)\nrepresentation L. Thus we use the coupled field to label two trivalent vertices: one normal and one special. In the\nend, a boundary state is given by a product of Φ and Ψ fields, contracted according to the combinatorics of the graph.\nWe view the ψs field as a triangle with extra particle degrees of freedom on one of its vertices, as seen in FIG.2.\n\nFIG. 2: The coupled field.\n\nB.\n\nClassical dynamics and kinetic and vertex terms\n\nThe action defines the classical dynamics of the fields. From this, one could calculate the classical equations of\nmotion of the group field theory (i.e. Euler-Lagrange equations). The classical equations of motion of the Boulatov\nGFT describe the local evolution of pure quantum gravity in a simplicial setting, and a recent proposal by Freidel [3],\nsuggests that the classical structure of the GFT is what only matters for the definition of the inner product between\ncanonical states in a GFT formulation of pure quantum gravity. Certainly, a similar interpretation is possible for our\ncoupled GFT, and a parallel analysis should be carried out for the GFT model we propose here, so to unveil all the\ninformation about local evolution and canonical inner product for gravity coupled to matter, but we leave this for\n\n\f7\nfuture work. We state our action as follows:\nint−2\nint−3\nint−4\nkin\nS[φ, ψs ] = Sgr + Sgr+mat = Sgr + Sgr+mat\n+ Sgr+mat\n+ Sgr+mat\n+ Sgr+mat\n=\nZ Y\n3\n1\n=\ndgi Pα φ(g1 , g2 , g3 )Pᾱ φ(g1 , g2 , g3 )\n2 i=1\nZ Y\n6\nl\ndgi Pα1 φ(g1 , g2 , g3 )Pα2 φ(g3 , g5 , g4 )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\n+\n4! i=1\nZ 3\n1 Y\ndgi du Pα ψs (g1 , g2 , g3 ; u)Pᾱ ψs (g1 , g2 , g3 ; u)\n+\n2 i=1\nZ Y\n6\n−1 −1\nua , g3 , g5 ; ua )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\ndgi dua Pα1 ψs (g1 , g2 , g3 u−1\n+ μ2\na hua ; ua )Pα2 ψs (g4 ua h\ni=1\n\n+ μ3\n\nZ Y\n6\n\n−1 −1\nub , g3 , g5 ; ub )Pα3 ψs (g6 , g4 , g2 u−1\ndgi dua dub duc Pα1 ψs (g1 , g2 , g3 u−1\nc huc ; uc )\na hua ; ua )Pα2 ψs (g4 ub h\n\ni=1\n−1 −1\nub u−1\n× Pα4 φ(g6 , g5 , g1 )δ(u−1\na hua ub h\nc huc )\n\nX\n\nIb\nIc\nIa\n(uc )CnIaa nIbb nIcc\n(ua )Dsn\n(ub )Dsn\nDsn\nc\na\nb\n\nIa ,Ib ,Ic\nna ,nb ,nc\n\n+ μ4\n\nZ Y\n6\n\n−1 −1\nub , g3 , g5 ; ub )\ndgi dua dub duc dud Pα1 ψs (g1 , g2 , g3 u−1\na hua ; ua )Pα2 ψs (g4 ub h\n\ni=1\n−1 −1\n−1\nub uc h−1 uc u−1\n× Pα3 ψs (g2 u−1\nd hud )\nd hud , g6 , g4 ; uc )Pα4 ψs (g6 , g4 , g2 ; ud )δ(ua hua ub h\nX\nId\nIb\nIc\nIa\n×\n(uc )Dsn\n(ud )C̃nIaa nIbb nIcc nIdd L ,\n(ua )Dsn\n(ub )Dsn\nDsn\nc\na\nd\nb\nIa ,Ib ,Ic ,Id ,L\nna ,nb ,nc ,nd\n\n(13)\nwhere h ∈ U (1) encodes the mass of the particle3 . Furthermore, the first line of the equation gives a schematic form of\nthe later terms. Sgr symbolises the first two terms (pure gravity), and Sgr+mat binds up the later four terms (matter\nint−2\ncoupled to gravity). We give each of the matter terms its own separate name, for example Sgr+mat\ndenotes a vertex\nterm with a bivalent particle interaction. We explain this in more detail later.\nWe deal in Section II C with the nature of the quantum dynamics. In order to proceed down that road we need\nto state precisely a partition function based on this action, and furthermore to construct the Feynman diagrams we\nrequire Feynman rules. We specify these explicitly in the form of propagators and vertex operators which we extract\nfrom the kinetic and interaction terms in the action, a standard modus operandi in field theory. The split occurs as\n\n3\n\nh = emJ0 and J0 is an su(2) generator of the U(1) subgroup.\n\n\f8\nfollows:\nS[φ, ψs ] =\n\n1\n2\n\nZ Y\n3\n\ndgi dḡi φ(g1 , g2 , g3 )φ(ḡ1 , ḡ2 , ḡ3 )Kφ (gi , ḡi )\n\n+\n\nZ\n\ndgi dḡi φ(g1 , g2 , g3 )φ(ḡ3 , g5 , g4 )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )Vφ (gi , ḡi )\n\ni=1\n6\nY\n\ni=1\n\nZ\n1\ns\ndgi dḡi du dū ψs (g1 , g2 , g3 ; u)ψs (g1 , g2 , g3 ; u)Kψ\n(gi , ḡi , u, ū)\n2\nZ Y\n6\ns\ndgi dḡi dua dub ψs (g1 , g2 , g3 ; ua )ψs (g4 , ḡ3 , g5 ; ub )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )V2ψ\n(gi , ḡi , ua , ub )\n+\n\n+\n\ni=1\n\n+\n\nZ Y\n6\n\ns\ndgi dḡi dua dub duc ψs (g1 , g2 , g3 ; ua )ψs (g4 , ḡ3 , g5 ; ub )ψs (g6 , ḡ4 , ḡ2 ; uc )φ(ḡ6 , ḡ5 , ḡ1 )V3ψ\n(gi , ḡi , ua , ub , uc )\n\n+\n\nZ Y\n6\n\ndgi dḡi dua dub duc dud ψs (g1 , g2 , g3 ; ua )ψs (g4 , ḡ3 , g5 ; ub )ψs (ḡ2 , g6 , ḡ4 ; uc )\n\ni=1\n\ni=1\ns\n× ψs (ḡ6 , ḡ5 , ḡ1 ; ud )V4ψ\n(gi , ḡi , ua , ub , uc , ud ).\n\n(14)\nThe operators above are the kinetic and interaction operators for the φ and ψ fields, stated explicitly as:\nZ\n−1\nPφ ≡ Kφ = Kφ = dα dᾱ δ(ḡ1 ᾱ−1 αg1−1 )δ(ḡ2 ᾱ−1 αg2−1 )δ(ḡ3 ᾱ−1 αg3−1 ),\nVφ =\n\nl\n4!\n\nZ Y\n4\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 g2 )δ(ḡ3 α2 α1 g3 )δ(ḡ4 α3 α2 g4 )\n\ni=1\n\ns\nPψs ≡ Kψ\ns\nV2ψ\n= μ2\n\n(15)\n\n−1\n\n−1\n−1\n−1\n× δ(ḡ5 α−1\n4 α2 g5 )δ(ḡ6 α4 α3 g6 ),\nZ\ns\n= Kψ\n= dα dᾱ δ(ḡ1 ᾱ−1 αg1−1 )δ(ḡ2 ᾱ−1 αg2−1 )δ(ḡ3 ᾱ−1 αg3−1 )δ(ūᾱ−1 αu−1 ),\n\nZ Y\n4\n\n(16)\n(17)\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 g2 )δ(ḡ3 α2 α1 ua hua g3 )δ(ḡ4 α3 α2 ub hub g4 )\n\ni=1\n−1\n−1\n−1\n−1\n−1\n× δ(ḡ5 α−1\n4 α2 g5 )δ(ḡ6 α4 α3 g6 )δ(ua α1 α2 ub )\n\ns\nV3ψ\n= μ3\n\nZ Y\n4\n\n(18)\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 g2 )δ(ḡ3 α2 α1 ua hua g3 )δ(ḡ4 α3 α2 ub hub g4 )\n\ni=1\n−1\n−1\n−1\n−1\n−1 −1\n−1\n−1\n−1\n× δ(ḡ5 α−1\nub α−1\n4 α2 g5 )δ(ḡ6 α4 α3 g6 )δ(α1 ua hua α1 α2 ub h\n2 α3 uc huc α3 )\nX\n−1\n−1\nIa Ib Ic\nIb\nIc\nIa\n×\n(ua α−1\nDsn\n1 )Dsnb (ub α2 )Dsnc (uc α3 )Cna nb nc ,\na\n\n(19)\n\nIa ,Ib ,Ic\nna ,nb ,nc\n\ns\nV4ψ\n= μ4\n\nZ Y\n4\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 ud hud g2 )δ(ḡ3 α2 α1 ua hua g3 )δ(ḡ4 α3 α2 ub hub g4 )\n\ni=1\n−1\n−1\n−1\n−1\n−1 −1\n−1\n−1\n−1\n−1\n× δ(ḡ5 α−1\nub α−1\nuc α−1\n4 α2 g5 )δ(ḡ6 α4 α3 g6 )δ(α1 ua hua α1 α2 ub h\n2 α3 uc h\n3 α4 ud hud α4 )\nX\n−1\n−1\n−1\nId\nIa Ib Ic Id L\nIb\nIc\nIa\n(20)\n(ua α−1\nDsn\n×\n1 )Dsnb (ub α2 )Dsnc (uc α3 )Dsnd (ud α4 )C̃na nb nc nd ,\na\nIa ,Ib ,Ic ,Id ,L\nna ,nb ,nc ,nd\n\nPψs\n\nwhere Pφ and\nare the propagators for the field theory.\nBefore we describe in detail the type of amplitudes that arise once we implement the Feynman rules, let us expound\nthe attributes of the individual terms.\n\n\f9\nThe first two terms Sgr , with operators Pφ and Vφ , are those from Boulatov's group field theory. Thus, pure gravity\ndiagrams occur as a subset of graphs in our model. Although the Boulatov vertex operator is well known, we describe\nit in more detail here as later vertex operators are but augmentations of this more basic structure. The vertex term\nhas four φ fields, thus four triangles, and the matching of their arguments within is such that the four triangles they\nrepresent form a tetrahedron. Moving on to the operator (16) itself, we see that it contains six δ-functions. Their\narguments represent holonomies around wedges dual to the edges of the tetrahedron. We can see this diagrammatic\nstructure in FIG. 3. The δ-functions force the holonomies to be the identity which is the discrete analogue of forcing\nthe wedge to have zero curvature. We have a flat tetrahedron.\n\na1\n\na4\n\ng1\ng1\n\nFIG. 3: The pure gravity (Boulatov) tetrahedron.\n\nThe propagator Pφ for the pure gravity sector represents geometrically the gluing of two tetrahedra obtained by\nidentifying one triangle from each tetrahedron. The third term is the kinetic term for the coupled field. Its operator\nproduces the propagator, Pψs , by inversion. The propagator is the identity on function space. It has an important role\nto play in the conservation of momentum as a particle travels from one tetrahedron to the next and we will discuss this\nin more detail in Section II C, when we come to deal with generic Feynman diagrams generated by the perturbative\nexpansion of the partition function.\nint−2\ns\nThe fourth term in the action Sgr+mat\n, with operator V2ψ\n, has two ψs fields and two φ fields. This time two of\nthe triangles have extra degrees of freedom related to matter. The arrangement of the gravity arguments once again\ngives it the form of a tetrahedron. In the operator (18), we have six δ-functions over the holonomies around the\nwedges. Only four are forced to be flat; two have defects inserted. We wrote the amplitude for the particle degrees\nof freedom in a very simple form, however. This hides a more explicit description of the particle degrees of freedom\nand furthermore, it does not look like a CPR spin foam building block. We prove in Appendix E that the vertex term\nint−2\nSgr+mat\nsatisfies the following equality:\nμ2\n\nZ Y\n6\n\n−1 −1\nub , g3 , g5 ; ua )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\ndgi dua Pα1 ψs (g1 , g2 , g3 u−1\na hua ; ua )Pα2 ψs (g4 ub h\n\ni=1\n\n= μ2\n\nZ Y\n6\n\n−1 −1\nub , g3 , g5 ; ub )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 ) (21)\ndgi dua dub Pα1 ψs (g1 , g2 , g3 u−1\na hua ; ua )Pα2 ψs (g4 ub h\n\ni=1\n−1 −1\n× δ(u−1\nub )\na hua ub h\n\nX\n\nI\nI\n(ua )Dsn\n(ub )δna nb .\nDsn\na\nb\n\nna ,nb\n\nThe amplitude coming from this vertex term lends itself to a much more explicit description of the particles' degrees\nof freedom.\ns\nV2ψ\n=μ2\n\nZ Y\n4\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 g2 )δ(ḡ3 α2 α1 ua hua g3 )δ(ḡ4 α3 α2 ub hub g4 )\n\ni=1\n−1\n−1\n−1\n−1\n−1 −1\n−1\n× δ(ḡ5 α−1\nub α−1\n4 α2 g5 )δ(ḡ6 α4 α3 g6 )δ(α1 ua hua α1 α2 ub h\n2 )\nX\nI\nI\n×\n(ua )Dsn\n(ub )δna nb ,\nDsn\na\nb\nna ,nb\n\n(22)\n\n\f10\nwhere I is any fixed representation of SU(2) such that I − s ∈ N. We reiterate here that we label both particles, a\nand b, by the same angular momentum I and we do not sum over I. This stems from the fact that a bivalent particle\ninteraction does not have any dependence on the total angular momenta and summing redundantly over them would\nresult in infinities. In fact, we chose I = s from now on. The defects we mentioned earlier are the momenta u−1 hu of\nthe particles associated to two edges of the tetrahedron. We illustrate them by the emboldened lines in FIG. 4, and\n−1 −1\ndenote them by k, the particle graph. We denote the δ-function, δ(α1 ua−1 hua α−1\nub α−1\n1 α2 ub h\n2 ) imposing explicit\nmomentum conservation by a dotted curve encircling the vertex of the tetrahedron at which the two particles interact.\nThis deals with the mass side of the particles' degrees of freedom. But we must also account for their spin. The\nangular momenta, both the total and spin, reside on a dual particle graph k∗ . We draw this as the dashed line in\nFIG. 4. We label k∗ by the matrix elements of the holonomy along the dashed line in the total angular momentum\nrepresentation I = s. At the endpoints of the holonomies, we project the momenta of the particles down to the spin-s\ncomponent:\n−1\ns\ns\n(ua α−1\nDsn\n1 )Dsnb (ub α2 )\na\n\n(23)\n\nThe bivalent interaction in k∗ occurs at the dual vertex, where we place the intertwiner δna nb . We emphasise that\nthe topological equivalence of the k and k∗ is an imperative quality and determines in a large part how we define our\nmodel (see Appendix A).\n\nS\n\nS\n\nFIG. 4: The tetrahedron with a bivalent particle interaction.\n\nThe vertex amplitude (22), as we have defined it is still not recognisable as a suitable building block for the amplitudes\nof the CPR model. This is due to the presence of the δ-function enforcing explicit momentum conservation, and indeed\nthe removal of this factor would supply us with a correct amplitude for one tetrahedron with two particles present. As\na matter of fact the CPR spin foam amplitudes contain a type of implicit momentum conservation, which we explain\nprecisely in Section III A. Importantly for us, the presence of this δ-function means that our amplitude satisfies an\nequation given pictorially in FIG. 5.\n\n=\n\nFIG. 5: The 1-4 equality satisfied by the bivalent particle interaction term.\n\n\f11\nThis graphically represents the following equation:\nZ Y\n6\n\ndgi dḡi dua dub ψs (g1 , g2 , g3 ; ua )ψs (g4 , ḡ3 , g5 ; ub )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )\n\ni=1\n\n× μ2\n\nZ Y\n4\n\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 g2 )δ(ḡ3 α2 α1 ua hua g3 )\n\ni=1\n−1\n−1\n−1\n−1\n−1\n−1\n× δ(ḡ4 α−1\n3 α2 ub hub g4 )δ(ḡ5 α4 α2 g5 )δ(ḡ6 α4 α3 g6 )\nX\n−1\n−1 −1\n−1\nI\nI\n× δ(α1 u−1\n(ua α−1\nub α−1\nDsn\na hua α1 α2 ub h\n1 )Dsnb (ub α2 )δna nb\n2 )\na\nna ,nb\n\n=\n\nZ Y\n6\n\ni=1\n\ndgi dḡi dua dub\n\nZ Y\n4\n\ndαi\n\ni=1\n\n4\nY\n\ndγjk ψs (g1 , g2 , g3 ; ua γ14 α1 )ψs (g4 , ḡ3 , g5 ; ub γ24 α2 )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )\n\nj,k=1 : j<k\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n× μ2 δ(ḡ1 α−1\n4 γ14 α1 g1 )δ(ḡ2 α3 γ13 α1 g2 )δ(ḡ3 α2 γ12 α1 g3 )δ(ḡ4 α3 γ23 α2 g4 )δ(ḡ5 α4 γ24 α2 g5 )δ(ḡ6 α4 γ34 α3 g6 )\n−1 −1 −1 −1\n−1\n−1 −1 −1\n−1\n× δ(γ12\nγ24 ua h ua γ14 )δ(γ13\nγ23 γ12 )δ(γ23\nγ34 ub hub γ24 )δ(γ13 γ14\nγ34 )\nX\nI\nI\nDsna (ua )Dsnb (ub )δna nb .\nna ,nb\n\n(24)\nwhere the γ variables refer to the holonomies along the newly introduced dual edges. In words, the left hand side is\nthe amplitude V2ψ as it occurs in (18). On the right hand side the tetrahedron has been replaced by four tetrahedra;\nthis is the analogue of the 1-4 Pachner move of pure gravity in the case in which particles are present. The particle\ngraph k has been 'dragged' into the interior and does not propagate along the original edges. Also we do not have\nexplicit momentum conservation at the vertex of k. So we see that our vertex operator is a building block for a CPR\namplitude with a more refined triangulation. We prove this equality explicitly in Appendix C.\nint−3\ns\ns\nThe fifth term Sgr+mat\n, with operator V3ψ\n, has a slightly different structure to V2ψ\n, except there are three triangles\nwith extra degrees of freedom. As usual, it has a tetrahedral structure, but now three of the δ-functions have defects\nindicative of particles on their associated edges. These form the particle graph k. Moreover, there is explicit momentum\nconservation. For the angular momenta, the structure of the operator identifies a dual particle graph k∗ with three\nedges and a trivalent intertwiner at the dual vertex. We mention also that the total angular momenta of the particles\nare different as a trivalent interaction depends on their individual values. We sum to get the most general amplitudes.\nThe two graphs, k and k∗ , are again topologically equivalent. Finally, the explicit momentum conservation makes it\nagain different at first sight from the CPR amplitude for three particles on one tetrahedron. However, the very same\nδ-function is crucial for showing the equality of this amplitude to an amplitude of the CPR-type. This equality has\nthe same form as that given in (24) but with an extra particle added. We represent it pictorially in FIG. 6.\n\n=\n\nFIG. 6: The equality satisfied by the trivalent particle interaction term.\nint−4\nThe final term Sgr+mat\n, is that of the 4-valent particle interaction. Every vertex of a tetrahedron is trivalent, and\ntherefore, to define a 4-valent particle interaction we must do it in a situation where there is a 4-valent vertex at\nleast. Thus, it is clear that the vertex amplitude as we wrote it in (20) is hiding some information, that is, we have\n\n\f12\nint−4\nintegrated out some variables to write it in a simpler form. But as in all these cases the vertex term Sgf\n+mat satisfies\nan equality:\n\nμ4\n\nZ Y\n6\n\n−1 −1\ndgi dua dub duc dud ψs (g1 , g2 , g3 u−1\nub , g3 , g5 ; ub )ψs (g2 u−1\na hua ; ua )ψs (g4 ub h\nd hud , g6 , g4 ; uc )\n\ni=1\n−1 −1\n× ψs (g6 , g4 , g2 ; ud )δ(u−1\nub uc h−1 uc ud−1 hud )\na hua ub h\nX\nId\nIb\nIc\nIa\n×\n(uc )Dsn\n(ud )C̃nIaa nIbb nIcc nIdd L\n(ua )Dsn\n(ub )Dsn\nDsn\nc\na\nd\nb\nIa ,Ib ,Ic ,Id ,L\nna ,nb ,nc ,nd\n\n= μ4\n\nZ Y\n6\n\ni=1\n\ndgi dḡi\n\n4\nY\n\ndαj dua dub duc dud ψs (g1 , g2 , g3 ; ua γ14 α1 )ψs (g4 , ḡ3 , g5 ; ub γ24 α2 )ψs (ḡ2 , g6 , ḡ4 ; uc α3 )\n\n(25)\n\nj=1\n−1\n−1\n−1\n−1\n−1\n× ψs (ḡ6 , ḡ4 , ḡ2 ; ud α4 )δ(ḡ1 α−1\n4 γ14 α1 g1 )δ(ḡ2 α3 γ13 α1 g2 )δ(ḡ3 α2 γ12 α1 g3 )\n−1\n−1\n−1\n−1\n−1\n× δ(ḡ5 α−1\n4 γ24 α2 g5 )δ(ḡ4 α3 γ23 α2 g4 )δ(ḡ6 α4 γ34 α3 g6 )\n−1 −1 −1 −1\n−1 −1\n−1 −1 −1\n−1 −1 −1\n× δ(γ12\nγ24 ua h ua γ14 )δ(γ13\nuc huc γ23 γ12 )δ(γ23\nγ34 ub hub γ24 )δ(γ13 γ14\nud h ud γ34 )\nX\n−1\nId\nIa Ib Ic Id L\nIb\nIc\nIa\nDsna (ua )Dsnb (ub )Dsnc (uc γ34 )Dsnd (ud )C̃na nb nc nd ,\n×\nIa ,Ib ,Ic ,Id ,L\nna ,nb ,nc ,nd\n\nwhere we may prove this equality by following the same procedure as in Appendix C. We illustrate this new vertex\nterm in FIG. 7.\n\nFIG. 7: The definition of the 4-valent particle interaction term.\n\nWe see that the vertex common to the four tetrahedra is 4-valent and so can play host to the interaction of the\nmomenta. In the dual, any of the four dual vertices (by symmetry) will serve to facilitate the interaction of the\nangular momenta. We do not have any explicit momentum conservation here, and so we have a CPR building block.\nAll further analysis follows that of the trivalent interaction term. For that reason we do not mention this term for the\nrest of the paper, but we state it here for completeness.\nTo conclude, we exhausted the possibilities for vertex terms. For example, although the vertex term Vψ with one\nψ field allows the propagation of momentum along one edge of the tetrahedron, the spin degree of freedom has no\nsuch path in the dual as this requires two ψ fields at least. Meanwhile, we cannot have more than 4-valent particle\ninteractions in our model, as the dual to a triangulation is 4-valent, and we must preserve topological equivalence.\nC.\n\nQuantum dynamics and Feynman amplitudes\n\nWe examine, in this section, the partition function and transition amplitudes. These define the quantum dynamical\naspects of our theory. The dynamics has two facets: non-perturbative aspects and perturbative aspects. We do not\ninvestigate non-perturbative features as these are not well-understood even in the case of pure gravity (but see the\nimportant work of [28]). In this work we focus on the perturbative features of our quantum theory. The first object\n\n\f13\nof interest, which will receive most attention, is the partition function, defined in perturbative expansion as:\nZ\nZ = Dψs Dφ e−S[φ,ψs] ,\n=\n\nX lv0 [Γ] μv2 [Γ] μv3 [Γ]\n3\n\n2\n\nΓ\n\nsym[Γ]\n\n(26)\nZ[Γ],\n\nWe denote each term in the expansion by a Feynman diagram Γ, and each Γ has an amplitude Z[Γ]. Moreover, sym[Γ]\nis the symmetry factor of the graph, v0 [Γ] is the number of Boulatov tetrahedra, v2 [Γ] is the number of tetrahedra\nwith a bivalent particle interaction and v3 [Γ] is the number of tetrahedra with a trivalent particle interaction. We may\nconstruct these terms in the summation with the aid of a graphical calculus which we have been developing over the\ncourse of the paper. We have a 4-valent graph with two types of line, full and dashed, and three types of vertex: four\nfull lines incident, two full and two dashed, and one full and three dashed. Then we label them as below:\ng1\ng2\n\ng1\ng2\ng3\n\nd\nd\nd\n\ng3\ng1\ng2\ng3\nu\n\nd\nd\nd\nd\n\ng1\ng2\ng3\n\nd\n\nS\n\nu\n\nPψs (gi , g ̄i , u, ū)\n\ng1\n\ng1\n\nPφ (gi , g ̄i )\n\ng2\ng3\n\nZ Y\n6\n\ndgi dḡi Vφ (gi , g ̄i )\n\nZ Y\n6\n\ns\ndgi dḡi dua dub V2ψ\n(gi , g ̄i , ua , ub )\n\nZ Y\n6\n\ns\ndgi dḡi dua dub duc V3ψ\n(gi , g ̄i , ua , ub , uc )\n\ni=1\n\ng1 g\n\ng1\n\n2\n\nd\n\ng3\nua\nS\n\nS\n\nDs\nub\n\ni=1\n\nS\n\nS\nS\n\ni=1\n\nProducts of these form the Feynman graph and its structure is dual to the structure of a triangulation. This is just\nconventional Feynmanology for a path integral formulation of a field theory.\nWe can express the operators using strand diagrams. They are an intermediary calculus between the utter minimalism of the Feynman graphs and the more complicated formalism of the fully reconstruction of the triangulation.\nTo each pure gravity line we associate three strands, and to each coupled line four strands. We label the endpoints\nof the solid strands by the g arguments, and the endpoints of the dotted strand by the momentum of the particle u.\nWe label the solid edges themselves by the δ-function over the holonomy which contains the g arguments of its two\nendpoints, while the dotted strands are labelled by the angular momentum amplitude. Once vertices are glued using\nthe propagators, the solid strands form loops which are the plaquettes dual to an edge of the triangulation and the\ndotted strands form the dual particle graph k∗ .\n\n\f14\nWe have yet to show that each term Z[Γ] is a spin foam amplitude. A generic Feynman graph Γ in the partition\nfunction is a closed 4-valent graph labelled as above. The integration over g and u variables glues the vertex amplitudes,\nthe propagators being essentially identity operators. There are basically three interesting subsets of diagrams that\noccur:\nv0 =\n6 0,\nv0 =\n6 0,\nv0 =\n6 0,\n\nv2 = 0,\nv2 6= 0,\nv2 6= 0,\n\nv3 = 0,\nv3 = 0,\nv3 6= 0,\n\npure gravity,\nnon interacting particles coupled to gravity,\ninteracting particles coupled to gravity.\n\nConsider the first scenario and the simplest. These are the diagrams occurring in Boulatov field theory for pure\ngravity. Note that each of the vertices of the Feynman graph is dual to a tetrahedron and thus the integration of g\nvariables glues tetrahedra together to form a triangulation. To understand the amplitudes we move to the dual picture\nwhere the aforementioned integration glues wedges together to form faces each dual to an edge of the triangulation.\nTherefore, we are left with a δ-function for the holonomy around each face of the dual which enforces the flatness\ncondition on the curvature. This is exactly the Ponzano-Regge spin foam amplitude for pure 3d Riemannian quantum\ngravity [5].\nWe now approach the more delicate task of constructing diagrams including matter in their amplitudes. The form of\nthe amplitudes can be extrapolated from the gluing of two vertices with bivalent particle interactions. The contruction\nworks analogously in the case of 3-valent and 4-valent particle interactions, so we do not discuss these other cases in\ndetail. The propagator glues the tetrahedra together at a face and ensures the conservation of momentum explicitly\nat the vertex of the triangulation where the segments of the particle graphs meet. It also ensures the conservation of\nspin in the dual particles graphs explicitly. We give this visually in FIG. 8.\n\n=\n\nFIG. 8: The gluing of two coupled tetrahedra.\n\nThis can be written as a CPR amplitude very easily after some rearrangement. First we use the 1-4 equality to\nremove the signs of explicit momentum conservation at two of the vertices (see Appendix C). This is given in FIG. 8\nalso. We remove the final explicit δ-function in two steps. The original shared face of the triangulation is now shared\nby two smaller tetrahedra. These are drawn on the lhs of FIG. 9. Each of the tetrahedra has a particle on an edge.\nWe know we can use the 1-4 equality to remove explicit momentum conservation when the particles are in the same\ntetrahedron. Fortunately, the 2-3 Pachner equality is satisfied by these two tetrahedra when particles are present. We\nprove this in Appendix D and draw it here in FIG. 9. Now that the two particles are in the same tetrahedron, a final\n1-4 equality can be invoked. We arrive at an amplitude that has no explicit signs of momentum conservation and is a\nCPR amplitude.\nIn effect the amplitude we see on gluing two of our vertices together is the coarse graining of a CPR spin foam\namplitude for a finer triangulation, i.e. with some of the arguments integrated out. The above reorganisation is\nindicative of the procedure when two coupled tetrahedra are glued together, and gives us the insight necessary to\nchronicle the form of a generic Feynman graph for matter coupled to gravity. For a normal edge of the triangulation\nwe get the usual curvature flatness constraint. For an edge of the particle graph k, we find that there is a defect in\nthe curvature equal to the momentum of the particle. For the dual particle graph k∗ , we labelled it by the matrix\nelements of its holonomy in the total angular momentum interspersed with spin projections, one for each particle, and\nangular momentum intertwiners one for each particle interaction. This is exactly a CPR spin foam amplitude.\n\n\f15\n\n=\n\nFIG. 9: The 2-3 equality satisfied by the coupled tetrahedra.\n\nThe next object is a definition of the transition amplitudes. fortunately, we have done the background work on this\nalready so we can proceed and state it as the 'two point' or more precisely, 'two net' function:\nZ\n< ø1 |ø2 >= Dψs Dφ ø1 [φ, ψs ]ø2 [φ, ψs ]e−S[φ,ψs ]\n(27)\nwhere ø1 and ø2 are the boundary states, i.e. products of the Boulatov and coupled fields based on open spin networks.\nWe give a portion of a typical boundary state in FIG. 10. FIG. 10 evaluates to\n\nj4\nj3\n\nj1\n\nj5\nIa\n\nj2\n\ns\n\nj6\n\nj7\nIb\n\ns\n\nFIG. 10: Portion of a typical boundary state.\n\nj4 j5 Ia La j6 j5 j7 Ib Lb\nj1 j2 j3\nΨ m6 m5 m7 s\n...\nΨjm3 3 m\n. . . Φm\n4 m5 s\n1 m2 m3\n\n(28)\n\nwith repeated indices summed over. This concludes our definition of the model.\nIII.\n\nFEATURES OF THE NEW MODEL - EXTENDED DISCUSSION\nA.\n\nFeynman Amplitudes\n\nIn Section II we detailed the definition of our model but we postponed almost all explanation of our reasons for the\nparticular form we chose. The model in question has many intriguing characteristics which deserve further clarification\nsince they play non-obvious roles in ensuring the faultless realisation of the Feynman amplitudes as CPR spin foam\namplitudes. Among these, two are most notable: the amplitudes are defined with explicit momentum conservation at\nevery vertex of k; also, we do not impose permutation invariance in the coupled field.\nBefore we elucidate our reasoning we give some background information on the CPR amplitudes that is especially\nrelevant here. The topic is the implicit momentum conservation contained in the CPR spin foam model. For sake of\ncompleteness, we start from the very beginning. Classically, first order 3d Riemannian gravity is a BF theory. The\ncurvature F satisfies a Bianchi identity, dF = 0, and as dF is a 3-form it couples to volumes. Upon discretising the\n\n\f16\nmanifold and quantising the theory, the continuum Bianchi identity is lost, understandably, but a discrete remnant\nsurvives. We describe this by considering a vertex of the triangulation ∆, and all the edges emanating from it. Each\nof these edges is dual to a face of the spin foam and therefore has a holonomy associated to it. These faces close\nto form a 3-ball around the vertex and thus identify the boundary of a volume. The discrete version of the Bianchi\nidentity states that there exists an ordered product of these holonomies which evaluates to the unit element [5]. For\npure gravity, since the very quantum amplitude enforces the flatness of the holonomy this identity gives us no more\nrestrictions on the dynamics of the theory4 . Now, consider a vertex where n of the edges have particles propagating\nalong them. The amplitude for these edges is a δ-function over the holonomy with a momentum defect. Thus, the\nholonomy is forced to be the momentum of the particle and the product of holonomies in the Bianchi Identity reduces\nto a product over the momenta incident at the vertex. Thus, we have implicit overall momentum conservation. This is\nnot sufficient for our purposes, however. Unlike the spin foam quantisation, where one has an explicit knowledge of the\ndiscretisation structure, i.e. the triangulation ∆ and the dual spin foam ∆∗ , before one begins, and one has hands-on\ncontrol over the particle graphs, k and k∗ and how one labels them, i.e. what are the variables living on them, the\ngroup field theory does not allow such freedom and control. We generate the spin foams, after all, as Feynman graphs\nand we only know the action to start with. To illustrate the way momentum conservation is realised in our model and\nthe topological equivalence between k and k∗ is mantained, in spite of this lack of control, we develop two examples.\nAs our first case, since in our Feynman expansion we generate all possible graphs given the Feynman rules, one\npossibility is that in FIG. 11. These tetrahedra have one vertex in common and it happens to be the one where\nboth of them have a bivalent particle interaction in k. Implicit momentum conservation here would imply that all\nthe four momenta incident to the vertex would sum up to zero, with orientation taken into account, but this would\nallow for the identification of a 4-valent matter interaction vertex on k, instead of two bivalent ones. This disagrees\nwith the two bivalent particle interactions in k∗ , and so we would not have a CPR amplitude, due to the breaking\nof the equivalence of k and k∗ . In other words, the implicit momentum conservation that we know is present in the\nFeynman amplitudes is not enough to guarantee the well-posedness of the model. Since we have explicit momentum\nconservation, this scenario does not arise and we have the correct particle graph structure. It is gratifying also to see\nthat the introduction of explicit momentum conservation means that we can separate the two particle interactions by\nthe 'dragging' procedure of the 1-4 equality. In this way the ambiguous situation discussed above is simply removed,\nas k and k∗ have now manifestly the same structure. This confirms the more fundamental nature of the dual particle\ngraph k∗ (at least in our model) and that ambiguous configurations arise only as a result of 'pathological' embeddings\nof the dual particle graph in the triangulation, or equivalently, as a result of coarse graining of the same triangulation,\nperformed by means of Pachner moves.\n\n=\n\nFIG. 11: Two tetrahedra sharing the same vertex (both having a bivalent interaction there).\n\nThe second example displays a different problem and its solution. Another possibility in a Feynman diagram is that\n\n4\n\nIn fact it causes an infinity to appear in the amplitude, which signals that their is a gauge symmetry which needs to be fixed [33].\n\n\f17\nwe generate two tetrahedra that share an edge which happens to be an edge where both tetrahedra have a particle\npropagating. This could be at first sight interpreted indeed as the presence of two particles propagating along the same\nedge of the triangulation, and the implicit momentum conservation would be compatible with this interpretation. This\ntype of configuration does not occur in the CPR amplitudes of [5], and is again a pathological result of inappropriate\ncoarse graining of the triangulation. Their pathological nature is clear if we recall that we interpret the particle graphs\nas Feynman graphs of a matter field theory coupled to gravity, so that lines should represent one-particle propagation,\nand that the CPR amplitudes reduce indeed in the effective limit to Feynman diagrams of a non-commutative quantum\nfield theory, so they lie within a larger multiparticle structure. We neither need nor want multiple particles on an\nedge. With 1-4 equality, i.e. by application of a Pachner move on the triangulation labelled by particle degrees of\nfreedom, this pathology can be overcome and the particle graph 'resolved' into a physically equivalent one (because it\nhas equal amplitude) that shows no ambiguous 'multi-particle' appearance.\n\n=\n\nFIG. 12: Two tetrahedra sharing the same edge (both contributing a particle there).\n\nAgain, the crucial point is the topological equivalence of k and k∗ , so let us discuss this a bit more. In the spin\nfoam context where we have complete control of the variables it is natural to consider the particle graph residing\nin ∆ as more fundamental and the particle graph k∗ in ∆∗ as a framing of k in the dual which gives a consistent\npicture of how the angular momenta propagates. This is not, however, the way we picture things when dealing with\nthe amplitudes generated by the GFT, even though they are the same as those of the CPR spin foams. We perform a\nconceptual shift. This begins with the proposal of a new field to describe matter coupled to gravity. We see that this\nhelps create the sense of the particle graph k∗ in ∆∗ as our initial concept. In other words, our Feynman expansion\ncreates first a particle graph k∗ alongside the dual complex from which the triangulation is reconstructed; from this,\ntaking into account the way the variables associated with this dual graph k∗ are coupled with the gravity degrees of\nfreedom, one has to reconstruct a particle graph k, lying on the triangulation itself. In fact, the positioning of the\nmomentum in the field gives rise to the particle graph k when we reconstruct ∆ and all our efforts have been to ensure\nthat k is topologically equivalent to k∗ . Thus we can consider k as an embedding of k∗ into the triangulation. It is\nthen easy to see that topological equivalence forces us not to impose the usual permutation invariance of pure gravity\non the coupled field. To exemplify the type of problematic configurations that arise were we to require permutation\ninvariance in the coupled field, consider the structure obtained by gluing two tetrahedra as in FIG. 13. This is similar\nto the gluing of two tetrahedra in FIG. 8. The edges on the shared face of one tetrahedron, however, are permuted\ncyclically with respect to the edges of the other.\n\nFIG. 13: A configuration coming from requiring permutation invariance.\n\n\f18\nThe particle graph k no longer describes the continuous propagation of a particle, even though momentum is\nconserved. Topological equivalence is lost.\nWe should also discuss to what extent our model encompasses the CPR spin foam amplitudes in all their generality.\nFor spinning particles, topological equivalence requires that the particle graphs of the CPR spin foams have at most\n4-valent interactions. So, no generality is lost there. However, if spinless particles are dealt with as a special case\nof our more general formalism, the same restriction would apply to them, while in the spin foam amplitudes of the\nCPR model no limit on the order of interaction for a scalar field was imposed. Thus at first sight it seems that some\ngenerality may be lost; it is not easy on the other hand to confirm this impression nor to disprove it, given that we\nare able to relate certain graphs arising in our model using Pachner moves, and that this is possible also in the CPR\namplitudes; by doing so higher valent interaction vertices for scalar particles can be resolved into lower valent ones, as\nwell as the opposite. Furthermore, we note that it is possible as well to generalise our model to one that produces higher\nvalent vertices even for spinning particles/fields: we would have to generalise the discretisation structures arising from\nthe perturbative expansion, and in particular those structures we reconstruct from Feynman vertices from tetrahedra\nto polyhedra, as the dual vertex would then have a higher number of incident dual edges. In any case we see that a\nmodel with a restriction on interaction vertices to be 4-valent would thus look more fundamental in nature.\nB.\n\nMany particle species\n\nTo this point, our model incorporated just one species of particle with a fixed mass and spin, albeit arbitrary. We\nextend our model here to include many species of particle. This is done easily at the dynamical level by adding new\nkinetic and vertex terms to the action, with a similar structure to those already present. We write down the terms in\na new shorthand notation, that should, however, be of no difficult to interpret. In this notation, our original action is\nS[φ, ψs,m ] = Sφφ + Sφφφφ + Sψs,m ψs,m + Sψs,m ψs,m φφ + Sψs,m ψs,m ψs,m φ .\n\n(29)\n\nThe new terms are of such a similar form that we can extend as follows:\nS[φ, ψs,m , ψs̄,m̄ ] = S[φ, ψs,m ] + Sψs̄,m̄ ψs̄,m̄ + Sψs̄,m̄ ψs̄,m̄ φφ + Sψs̄,m̄ ψs̄,m̄ ψs̄,m̄ φ + Sψs̄,m̄ ψs,m ψs,m φ + Sψs̄,m̄ ψs̄,m̄ ψs,m φ\n\n(30)\n\nThe first three are just a replica of the terms given for the (s, m) particle earlier. The final two allow for interaction\nbetween the two species. Further generalisations follow the same path.\nWe do not specify the Feynman rules for the partition function and transition amplitude explicitly but we describe\nthe generic structure of the diagrams that occur in the partition function, and their particle graphs. Since the action\ncontains the action of 13, we get all the diagrams that we had before. Furthermore, there is a subset of terms for the\n(s̄, m̄) particles coupled to gravity that are a direct copy of the terms for (s, m). This means we get a copy of the\n(s, m) particle diagrams for the (s̄, m̄) particles. Finally, we get the diagrams charting the interaction between the two\nspecies. We give a portion of a typical example in FIG. 14.\nS\n\nS\n\nS\n\nS\n\nS\n\nFIG. 14: A generic multi-species Feynman diagram.\n\nKinematically, we can have boundary states containing particles of both species, ø(φ, ψs,m , ψs̄,m̄ ). These have the\nsame form as before. They are based on open trivalent graphs where some of the particle vertices are labelled by the\nψs̄,m̄ and some by ψs,m . Thus, there exist non-zero transition amplitudes between multi-species, multi-particle states.\n\n\f19\nC.\n\nDSU(2) structures and Lorentz deformation\n\nLet us discuss briefly the role of non-commutative and specifically DSU (2) structures in our model. It is known\nthat quantum point particles in 3d manifest a symmetry under a quantum group deformation of the Poincaré group,\ni.e. the non-compact double of SU (2), DSU (2) [5, 11, 24, 40], and that this deformed symmetry structure can be\nidentified clearly, made explicit and put to use in the CPR spin foam model [5, 11] and in the effective field theory for\nscalar matter fields derived from it [12]. Therefore, one may wonder what role DSU (2) structures play in our GFT\nmodel, and maybe expect that a correct group field theory derivation of the CPR spin foam model should be based\ndirectly on such DSU (2) structures instead of using only the SU (2) group elements and representations as is the case\nfor our model. We think this is not the case and the evidence that can be gathered from the literature suggests that,\nwhile a DSU (2) symmetry is likely to be implicitly present in our model, a purely SU (2)-based formulation of 3d\ngravity coupled to matter at the group field theory level is in our opinion not only sensible, but arguably the most\nnatural way to proceed.\nThe main reason for this is that not only the expression of the CPR spin foam model, but also both its known\nderivations from covariant path integral methods in a discrete setting [5] and from canonical Hamiltonian methods in\nthe continuum [18], make use of elements and representations of SU (2), and of its inhomogeneous counterpart (i.e.\nthe Poincaré group), only. In [5], the authors started with a discretisation of the continuum action for 3d gravity\ncoupled to point particles, which is invariant under local SU (2) transformations only, and with the particles labelled\nby Poincaré representations. They then derived, using spin foam techniques, the CPR model where, as explained in\ndetail in Appendix A, the modified amplitudes are functions of SU (2) group elements and group representations only.\nAlso, boundary data for the partition function are ordinary open spin networks again based on SU (2). Analogously,\none can start from a conventional definition of canonical kinematical states for matter coupled to quantum gravity in\nterms of open SU (2) spin networks and Poincaré representations. Then, one can define [18] and explicitly construct,\nusing a rigorous discretisation and application of usual loop quantum gravity methods, a projection operator onto\nsolutions of the Hamiltonian constraint and a physical scalar product for canonical states given again by the CPR\nspin foam model. The interesting point is that in spite of this more conventional-looking expression of the partition\nfunction, one can identify [5] a non-trivial braiding for the particles. This results from the action of the braiding matrix\nof the quantum group DSU (2). Also, the same partition function, for a given coupled Feynman graph for matter\nfields, can be re-expressed [11] as the evaluation of a colored chain mail link based again on the same quantum group.\nThese results make clear that quantum group symmetries are a result of the quantum dynamics of gravity coupled to\nparticles and not of the kinematics behind it. But these results also make clear that the use of un-deformed SU (2)\nstructures and of related spin foam techniques for describing these quantum dynamics is fully compatible with the\npresence of deformed symmetries for matter fields and with the use of quantum group techniques for the evaluation\nof the same physical quantities.\nLet us also stress, in support of this conclusion, that the equivalence of the Ponzano-Regge spin foam model,\nexpressed and derived only using SU (2) structures, with a quantum group evaluation of a chain mail link based on\nDSU (2) is true also in the simpler case of pure gravity with no matter coupling [11]. As for the group field theory\nderivation of such a model, it is well known that this is given by the Boulatov group field theory [6], i.e. by a field\ntheory over an ordinary SU (2)-based group manifold, in spite of this alternative reformulation based on DSU (2).\nThere is more. The most striking appearance of non-commutative structures from the CPR model is in our opinion\nthe derivation of an effective non-commutative field theory for a scalar field encoding the quantum gravity corrections\n[12]. Here, it is clear that quantum gravity dynamics is responsible for the deformation of ordinary field theory\nto a non-commutative one. Again, however, in momentum space the resulting field theory is just one based on an\nSU (2) group manifold. The non-commutative structure of spacetime emerges only after harmonic analysis, due to the\ncurvature of momentum space [12]. The DSU (2) symmetry manifests itself not at the level of the action but when\nconsidering multiparticle states, their non-trivial braiding and their modified scattering laws. It is a field theory of this\ntype, based on the SU (2) group manifold, that we expect to obtain from a group field theory action, at an effective\nlevel, after suitable integration of the gravity degrees of freedom.\nIn spite of all this evidence for the adequacy of using only SU (2) structures for constructing a group field theory\ndescribing 3d quantum gravity coupled to matter fields, one may still want to look for an alternative formulation that\nmakes explicit use of the quantum group DSU (2); perhaps for the need for greater simplicity or simply because of the\nbeautiful mathematical structures this would bring into play. This would certainly be an interesting and fascinating\nproject, but the results of [26] lead one to approach this issue with greater caution. As already mentioned, in fact, in\n[26] the author studies the straightforward generalisation of the Boulatov model to the case of DSU (2), and the whole\n\n\f20\nconstruction proceeds beautifully and rigorously, but the resulting model does not admit any clear interpretation in\nterms of matter fields coupled to gravity (and definitely does not reproduce the CPR spin foam model) that can be\nconsidered as a sensible coupling of 3d quantum gravity with Feynman graphs for matter fields. This suggests that\nsomething more elaborate may be needed. We leave this for future work.\nD.\n\nGeneralised model with variable mass and spin\n\nAn interesting generalisation which has received some attention [26] (and we expect it to receive more shortly [30])\nis to relax our constraints on the mass and spin completely. To state things explicitly, we integrate over all masses\nand sum over every spin. From one base, we could regard this as allowing for every possible spin given a certain mass.\nOr from the other, for a given spin every mass is possible. Thus there is an infinite number of species of particles. We\ngive the action as:\nS[φ, ψ] =\n\n1\n2\n\nZ Y\n3\n\nZ Y\n6\n\nl\n+\n4!\n+\n\ndgi Pα φ(g1 , g2 , g3 )Pᾱ φ(g1 , g2 , g3 )\n\ni=1\n\n1\n2\n\ndgi Pα1 φ(g1 , g2 , g3 )Pα2 φ(g3 , g5 , g4 )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\n\ni=1\n\nZ\n\n+ μ2\n\ndgi du\n\nX\n\nPα ψs (g1 , g2 , g3 ; u)Pᾱ ψs (g1 , g2 , g3 ; u)\n\ns\n\nZ Y\n6\n\ndgi dua\n\ni=1\n\nZ\n\ndh\n\nX\n\n−1\nua , g3 , g5 ; ua )\nPα1 ψs (g1 , g2 , g3 ua−1 hua ; ua )Pα2 ψs (g4 u−1\na h\n\ns\n\n× Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\nZ\nZ Y\n6\nX\n−1 −1\ndgi dua dub duc\nPα1 ψsa (g1 , g2 , g3 u−1\ndha dhb dhc\n+ μ3\na ha ua ; ua )Pα2 ψsb (g4 ub hb ub , g3 , g5 ; ub )\nsa ,sb ,sc\n\ni=1\n\n×\n\n−1 −1\n−1\n−1\nPα3 ψsc (g6 , g4 , g2 u−1\nc hc uc ; uc )Pα4 φ(g6 , g5 , g1 )δ(ua ha ua ub hb ub uc hc uc )\n\n×\n\nX\n\nDsIaa na (ua )DsIbb nb (ub )DsIcc nc (uc )CnIaa nIbb nIcc\n\nIa ,Ib ,Ic\nna ,nb ,nc\n\n(31)\nWe should note that in the second vertex term, that is the vertex with a bivalent particle interaction, we have written\nthe two particles with the same mass and spin because even if we allowed them to differ, the relations above would\nforce the amplitude to be zero except when they coincided, due to momentum conservation. On the boundary, we\nretain states with fixed mass and spin for any one particle, and one can obviously have more than one species of\nparticle in a kinematic state. This is what we measure in practice, i.e. in real life situations, and we wish to retain\nsome sort of touch with possible future experiment. This loosening of restrictions affects the amplitudes, of course.\nMore strikingly, it alters the effective limit of the theory, and indeed the abelian limit of the theory where one recovers\nusually ordinary quantum field theory. This group field theory reduces to analogous theories but with the sum over\nall masses and spins maintained, thus to field theories with variable mass and spin; while we are aware of past work\non quantum field theories with indefinite mass (see for example [34, 35]), we do not recall a similar generalisation for\nthe spin degrees of freedom.\nE.\n\nReduced model - scalar fields\n\nLet us consider the limiting case in which both the spin of the particle and its total angular momentum go to\nzero, i.e. the case of 3d quantum gravity coupled to a single scalar field with no angular momentum. In [27], a\nmodel was proposed to describe such happenstance, based on a formalism, a type of field and relative action that are\n\n\f21\nquite different from the ones we use in the corresponding limit of our present model. However, they produce, modulo\nmultiplicative factors, the same Feynman amplitudes. It is interesting then to understand the exact relation between\nthese two models. We converge on a reconciliation first from the side of our new model. The action for scalar particles\nreduces to:\nZ 3\n1 Y\nS[φ, ψ] =\ndgi Pα φ(g1 , g2 , g3 )Pᾱ φ(g1 , g2 , g3 )\n2 i=1\nZ Y\n6\nl\ndgi Pα1 φ(g1 , g2 , g3 )Pα2 φ(g3 , g5 , g4 )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\n+\n4! i=1\nZ\n1\n+\ndgi du Pα ψ0 (g1 , g2 , g3 ; u)Pᾱ ψ0 (g1 , g2 , g3 ; u)\n2\nZ Y\n6\n−1 −1\nua , g3 , g5 ; ua )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\ndgi dua Pα1 ψ0 (g1 , g2 , g3 u−1\n+ μ2\na hua ; ua )Pα2 ψ0 (g4 ua h\ni=1\n\n+ μ3\n\nZ Y\n6\n\n−1 −1\nub , g3 , g5 ; ub )Pα3 ψ0 (g6 , g4 , g2 u−1\ndgi dua dub duc Pα1 ψ0 (g1 , g2 , g3 u−1\nc huc ; uc )\na hua ; ua )Pα2 ψ0 (g4 ub h\n\ni=1\n−1 −1\nub uc−1 huc )\n× Pα4 φ(g6 , g5 , g1 )δ(u−1\na hua ub h\n\n(32)\n∗\n\nWe have no longer spin and angular momentum degrees of freedom identifying a dual particle graph k , we are only\ninterested in the particle graph k, where we still have explicit momentum conservation, and thus have at most trivalent\nparticle interactions (as we have not included 4-valent interaction terms in the above action). No restriction comes\nthen from the need to have topological equivalence of k and k∗ . The above action produces, in perturbative expansion,\nthe CPR amplitudes for scalar particles. The presence of explicit momentum conservation, i.e. of extra deltas relating\nthe u variables, allows for the use of Pachner moves to resolve pathological multiparticle-like configurations (in the\nsense explained above). If we go one step further and remove explicit momentum conservation, we recover a model\nin which multiple particles reside on some edges and we have arbitrary valence interactions in the particle graph k.\nThese are not CPR amplitudes, and correspond to the amplitudes obtained using the alternative model presented in\nsection IVC of [27] in which the extra variables labelling the field of the main model have been removed. As explained\nin [27] the extra structure of the field (extra three arguments labelling possible particle degrees of freedom) serve\nexactly the purpose of avoiding the appearance of such multiparticle configurations, while retaining the possibility of\narbitrary valence of interaction and not imposing momentum conservation explicitly.\nNow let us approach this problem from the other side. In the model of [27] the number of arguments in the field\nis doubled and the new ones are identified with the particle degrees of freedom but in a manner different from what\nwe are used to in this paper. They are not used to ensure explicit momentum conservation at the vertices and so\nwe can have an arbitrary valence of interaction. This is perfectly fine for scalar particles in the CPR model where\nno topological equivalence is required. Further, these new variables are used to propagate information around a dual\nface so that, should there be multiple particles on an single edge, they cancel out in pairs, so that in the end one is\nleft with either one or zero particles on an edge. The problem of multiparticle configuration was thus solved in a very\ndifferent way from the one we adopted here. The introduction of these new variables also had the effect of increasing\nthe order of infinity of the graphs above that of the CPR amplitudes; this is attributed to redundant additional gauge\nsymmetry with respect to the pure gravity case, which must be fixed by some procedure. Modulo these infinities,\nthe model indeed generates CPR amplitudes for scalar particles coupled to quantum gravity. As we said above, if\none removes the doubling of arguments in the field, one recovers a model, presented as a possible alternative in [27],\nin which multiple particles reside on some edges and we have arbitrary valence interactions in the particle graph k.\nHowever, these are not CPR amplitudes.\nSo we can see more clearly now, that the model proposed in [27] and the one we obtain here in the special case\nof scalar fields, solve the problem of matter coupling to 3d quantum gravity in two very different but easily related\nways. The new model, however, allows for the description of other types of fields as well, and when non-zero spin and\nnon-zero angular momentum are considered, it has the added responsibility to ensure that the two particle graphs k\n(which indicates where the curvature of spacetime is modified by the presence of matter), and k∗ , (which describes\nthe actual Feynman graph of the field and the propagation of spin and angular momentum degrees of freedom), are\n\n\f22\ntopologically equivalent and so necessitates a different structure. It would be very interesting to know whether it is\npossible to generalise the model of [27] to spinning particles, but this will only be the subject of future work.\nIV.\n\nCONCLUSIONS AND OUTLOOK\n\nIn this paper we have presented a group field theory formulation of 3-dimensional Riemannian quantum gravity\ncoupled to matter fields of any mass and any spin, thus generalising the work of [27]; the model is a rather simple\ngeneralisation of the Boulatov model for pure 3d gravity, and in particular simpler in structure than the one presented\nin [27], despite the fact that the configurations generated by the last arise as a particular case of the new model. The\nnew model reproduces exactly the spin foam amplitudes for gravity coupled to particles constructed in [5], and can\nbe seen as a simultaneous realisation of a simplicial third quantization of gravity and a second quantization of matter.\nIn fact the perturbative expansion of the partition function of the group field theory produces at once a sum over 3d\nsimplicial complexes of any topology, a sum over the corresponding geometries, and a sum over Feynman graphs for\nmatter fields interactions.\nMatter configurations arise as topological defects of gravity configurations labeled by the Poincaré group, thus\ncarrying mass and spin, consistently with the known results for the quantization of point particles in 3d [23, 24].\nThese results on the one hand confirm the flexibility and power of the group field theory formalism, on the other\nhand give further support to the view that it represents a fundamental definition of quantum gravity in terms of spin\nfoams and not merely an auxiliary formalism.\nMost important, we believe that our results may be crucial for further developments in this area. Let us then\ngive a brief outlook of possible future work, in relation to what we have presented in this paper. An important\nachievement that was made possible by the construction of a spin foam model for 3d quantum gravity coupled to\nmatter [5] was the identification of an effective non-commutative field theory for (scalar) matter that reproduces the\nFeynman amplitudes including the quantum gravity corrections in the perturbative expansion [12]. The importance is\nalso that this result on the one hand clarifies the role of non-commutative geometry in quantum gravity from the point\nof view of a fundamental formulation of the theory, on the other hand it connects directly and precisely spin foam\nmodels with effective models of quantum gravity in flat spacetimes like Deformed (or Doubly) Special Relativity [29],\nthus representing a good starting point for tackling issues of quantum gravity phenomenology. Therefore, having now\nobtained a group field theory that produces the Feynman amplitudes of [5], the first issue is to derive and understand\nthe non-commutative field theory of [12] and its extensions (e.g. to non-zero spin) from the group field theory itself.\nIt is natural to expect that it is the very action of the new GFT we have constructed in this paper that, after suitable\nintegration over quantum gravity degrees of freedom, will reduce to the effective non-commutative field theory for\nmatter. Work on this is indeed in progress [31].\nA second issue, to be tackled in the near future concerns gauge fields. The model we presented can accommodate\nthe description of spin 1 fields with no difficulty but this is not enough to interpret them as gauge bosons; first of all\nthe case of zero mass is not completely straightforward, and more work is needed to understand it in full; second, and\nmost important, the interpretation of these interacting spin 1 particles as gauge bosons for some (possibly non-abelian)\ngauge theory is not solid at all. Work is in progress [32] on the construction of a coupled and possibly unified model of\nquantum gravity and Yang-Mills theory at the level of group field theory, inspired by the results obtained in [16] at the\nspin foam level, in 4 spacetime dimensions. However, the are two main obstacles in constructing a complete group field\ntheory in which all types of matter fields, bosonic and fermionic, Yang-Mills fields and quantum gravity are encoded\nin one action, combining the results obtained in this paper, and those of [32]: the work of [16, 32] is in 4 dimensions\nand the corresponding model in 3 dimensions is not easily constructed; most important, in [16, 32] Yang-Mills theory\nis obtained in a non-perturbative lattice formulation (suitably generalised to couple it with quantum gravity), while in\nthe work we have presented here we were able to reproduce the perturbative interactions of bosonic particles in terms\nof Feynman diagrams; to reconcile the two pictures is not straightforward, although it is clearly possible.\nGoing back to issues related to group field theories in general, of paramount importance is a complete understanding\nof gravity symmetries, that can be nicely identified and taken care of at the level of spin foam amplitudes [33], at the\nlevel of the group field theory itself, being it the classical action or the partition function of the theory. In particular, the\ngroup field theory origin and manifestation of the translation symmetry characterizing BF theories in any dimension\nand thus gravity in 3 dimensions is still unclear and must be studied as a matter of priority. This is important because\nif spin foam symmetries are not understood as symmetries of the corresponding group field theories, it would be hard\nto maintain the latter as a fundamental definition of the former; moreover, translation symmetries may be the easiest\n\n\f23\ncontext in which to develop techniques and ideas for tackling the general issues of symmetries in group field theories\nand for understanding the quantum origin of the classical symmetries of gravity actions. Of course, diffeomorphism\nsymmetry is, in this respect, the ultimate target.\nNeedless to say, the ultimate goal of the work whose results we presented in this paper is the issue of matter\ncoupling to quantum gravity in 4 spacetime dimensions, again for both a theoretical interest and a move towards\nquantum gravity phenomenology. As concerns this issue, the results obtained can turn out to be useful in that they\nlend themselves to a straightforward generalisation to higher dimensions, albeit a formal one; the difficulty in fact\nis not so much the extension of techniques and structures used here, to group field theory models of 4-dimensional\nquantum gravity, but the physical interpretation in terms of matter fields of the resulting model. To understand matter\ncoupled to quantum gravity in 4 dimensions, one can start, in a sense as it was done in 3 dimensions, from either\nclassical actions for gravity coupled to matter or from Feynman diagrams of the matter quantum field theory [36], then\nconstruct the corresponding coupled spin foam models, and finally obtain the group field theory formulation of them.\nOur results, if suitably generalised to 4-dimensions, would allow to proceed the other way around: start from a group\nfield theory that gives 4d quantum gravity as a spin foam model with extra structures that can be hoped to represent\nmatter, in the light of our results, obtain the corresponding spin foam amplitudes, and either study the no-gravity\nlimit to understand the matter interpretation of the resulting theory, or try to extract an effective non-commutative\nfield theory that admits such interpretation. This is of course a longer term programme, that however is made a bit\neasier by our results.\nV.\n\nACKNOWLEDGEMENTS\n\nWe would like to warmly thank J. W. Barrett, L. Freidel, K. Krasnov, E. Livine, K. Noui and A. Perez for many\nhelpful discussions.\nAPPENDIX A: COUPLED PONZANO-REGGE MODEL\n\nWe outline briefly some characteristic properties of the Coupled Ponzano-Regge model developed in [5]. To begin,\nthe model is a spin foam quantisation of first order 3d Riemannian gravity coupled to spinning point particles. One\ndiscretises a 3-manifold M using a triangulation ∆, constituting of tetrahedra, triangles, edges (e), and vertices (v).\nThe particle graph is discretised also in this process and is replaced by a sequence of contiguous edges, k, contained\nin ∆. No longer are the dynamical quantities represented by entities which are continuous on the manifold, but this\ninformation now resides in their discrete analogues. We can construct also the topological dual of ∆, by placing a\nvertex (v ∗ ) at the centre of every tetrahedron, and joining the vertices of adjacent tetrahedra by edges (e∗ ) passing\nthrough the centre of the triangles. This is called the dual 1-skeleton of the triangulation. These dual edges form loops\nor faces (f ∗ ) around the original edges of the triangulation. These dual faces together with the dual 1-skeleton form\nthe dual 2-skeleton ∆∗ . We label this structure with the discrete dynamical variables and the quantum amplitude is a\nfunction of these variables, it is a spin foam. The action for our theory is a BF action minimally coupled to the point\nparticle action. The essential dynamical quantity for the gravity sector is the holonomy, the parallel transport of the\nconnection, along a dual edge, αe∗ . From this we form the discrete analogue of the curvature. As it is a 2-form, we\ndiscretise it onto the dual faces. Its discrete form is the holonomy around the dual edges bounding f ∗ denoted Ge .\nRemember that the edges e of the triangulation are in one-one correspondence with the faces f ∗ of the dual so we\nuse these notations interchangeably. The point particle in 3d is defined by its mass and spin. In the quantum regime,\nthese are encoded as the momentum, and a spin projector both associated with e. The momentum is an SU(2) group\nelement u−1\ne hue in the conjugacy class of a certain U(1) element h encoding the mass of the particle. To contain the\nspin of the particle we associate to the edges of the particle graph k, two representations of SU(2), Ie and Ie′ , one at\neach vertex. to the edge itself we associate a spin projector which we describe shortly.\nThe quantum amplitude for a manifold with particle graph is given as follows. For edges of the triangulation but\nnot in the particle graph k, we assign to the edge a δ-function over the holonomy of the associated dual face. This is\nthe usual curvature flatness condition. For edges of k, the discretised particle variables cause defects, and contribute\nto the amplitude. The mass breaks the flatness condition and the δ-function is now over the product of the holonomy\nand the particle's momentum. Furthermore, the particle's spin contributes a factor which may be visualised as a\nparticle graph k∗ in the dual. The dual particle graph is a series of contiguous edges in ∆∗ which have the same\n\n\f24\ntopology as k and lie 'close' to k. We define the term 'close' later. We associate to certain vertices of k∗ total angular\nmomentum intertwiners. We do this in the obvious way. If a trivalent interaction occurs in k, then three total angular\nmomentum representations label that vertex. By topological equivalence there will be a trivalent vertex in k∗ and we\nlabel it with an intertwiner over the three total angular momentum variables. Between the intertwiners we place the\nmatrix elements of the holonomy along the dual edges in the total angular momentum representations Ie and Ie′ . At\nsome point At the point where these holonomies meet we place the spin projector\nI′\n\nIe\ne\n(u−1\nD.s\ne )Ds. (ue ).\n\n(A1)\n\nFor a more precise definition of where this happens exactly, see [5]. This completes the description of the amplitude\nwhich we write down mathematically as\nZ Y\nYZ\nY\nX\n\u0001\nIe′\n′\nIe\nTotal angular\nδ(Ge )\ndue δ(Ge u−1\n(xe−1 u−1\nD.s\nZCP R [k] =\ndαe∗\ne hue )\ne )Ds. (ue xe ) × momemtum intertwiners ,\ne∗ ∈∆∗\n\ne∈∆/k\n\ne∈k\n\nIe ,Ie′\n\n(A2)\nwhere Ge , xe and x′e are all products of the holonomies αe∗ . We have only included a spin s particle but we could\ninclude many more just by making the mass and spin dependent on the edge, that is, h → he and s → se . This is a\nviable proposition because these amplitudes have the properties of implicit momentum conservation which we explain\nin detail in Section III A and of implicit spin conservation, in that we only intertwine the total angular momenta but\nthe only non-zero amplitudes are those for which the spin is conserved at the interaction vertices.\nAn important property of the CPR spin foam model, is that the particle graphs are topologically equivalent and\nalso that they are 'close' together. By close we mean that the dual particle graph k∗ lies only on those edges e∗ of the\nspin foam ∆∗ lying in the dual tube Tk∗ , where\nTk∗ = {f ∗ ∈ ∆∗ : f ∗ dual to e ∈ Tk ⊂ ∆} ,\nTk = {e ∈ ∆ : e ∩ k 6= 0, e ∈\n/ k} .\n\n(A3)\n\nIn words, the dual tube is the set of faces f ∗ which are dual to edges e of the triangulation that share a vertex with\nthe particle graph k but are not in k. These required properties of the two graphs are satisfied by our gft.\nAPPENDIX B: MODE EXPANSION OF THE FIELDS\n\nWe do some calculations relating to the kinematic regime of our model. We perform a Peter-Weyl decomposition\nof the Boulatov field into its constituent representations.\nZ\nX\nj3\nj2\nj1\n(g\n)\ndα Dnj11 k1 (α)Dnj22 k2 (α)Dnj33 k3 (α) (B1)\nPα φ(g1 , g2 , g3 ) =\n(g\n)D\n(g\n)D\nφjm1 1j2kj13m2 k2 m3 k3 Dm\n3\n2\n1\nm3 n3\nm2 n2\n1 n1\nji ,mi ,ni ,ki\n1≤i≤3\n\nBut the following equality holds\nZ\n\ndα Dkj11 n1 (α)Dkj22 n2 (α)Dkj33 n3 (α) = Ckj11 jk22 kj33 Cnj11 nj22 nj33 ,\n\n(B2)\n\nwhere C is an SU(2) trivalent intertwiner. So we define\n1\nj2 j3\n= p\nΦjm1 1 m\n,\nφj1 j2 j3\n2 m3\ndj1 dj2 dj3 m1 k1 m2 k2 m3 k3\nand this means that we can write the above projected field as in equation (4):\nX p\nj3\nj2\nj1\nj2 j3\ndj1 dj2 dj3 Φjm1 1 m\nPα φ(g1 , g2 , g3 ) =\n(g3 )Cnj11 nj22 nj33\n(g2 )Dm\n(g1 )Dm\nDm\n3 n3\n2 n2\n1 n1\n2 m3\nji ,mi ,ni\n1≤i≤3\n\n(B3)\n\n(B4)\n\n\f25\nWe follow a the same procedure for the coupled field. We expand into representations\nX\nX\nj1 j2 j3 I\nI\nj3\nj2\nj1\n(g3 )Dsn\n(u)\n(g2 )Dm\n(g1 )Dm\nPα ψ(g1 , g2 , g3 ; u) =\nψm\nDm\n3 n3\n2 n2\n1 n1\n1 k1 m2 k2 m3 k3 sk\nI,n,k\n\nji ,mi ,ni ,ki\n1≤i≤3\n\n(B5)\n×\n\nZ\n\ndα\n\nI\n(α).\nDnj11 k1 (α)Dnj22 k2 (α)Dnj33 k3 (α)Dnk\n\nThere is a similar equality that holds for a product of four SU(2) representations:\nZ\nX\nI\n(α) =\ndα Dnj11 k1 (α)Dnj22 k2 (α)Dnj33 k3 (α)Dnk\nC̃nj11 nj22 nj33 nI L C̃kj11 kj22kj33kI L ,\nL\n\n(B6)\n\nwhere C̃ is a 4-valent SU(2) intertwiner and L labels a basis in the vector space of intertwiners. Once again we define\n1\nj2 j3 I L\nΨjm1 1 m\n= p\nψ j1 j2 j3 I\n,\n2 m3 s\ndj1 dj2 dj3 dI m1 k1 m2 k2 m3 k3 sk\n\n(B7)\n\nand so we can write our field as in (10):\nXp\nX\nI\nj3\nj2\nj2 j3 I L j1\n(g3 )Dsn\n(u)C̃nj11 nj22 nj33 nI L (B8)\n(g2 )Dm\nPα ψs (g1 , g2 , g3 ; u) =\nDm1 n1 (g1 )Dm\ndj1 dj2 dj3 dI Ψjm1 1 m\n3 n3\n2 n2\n2 m3 s\nI,n,ji ,mi ,ni L\n1≤i≤3\n\nAPPENDIX C: 1-4 EQUALITY\n\nThe 1-4 equality was given pictorially as FIG. 5 in Section II B. We prove this statement here for the vertex term\nwith a bivalent particle interaction but it hold for the trivalent term also. We couch the proof of the equality in\nterms of the action term as this has a self-contained integration over all variables and allows us to maintain control\nand knowledge of all redefinitions of the variables. The lhs of FIG. 5 has the action term as stated in (14) with the\noperator (18)\nZ Y\n6\n\ndgi dḡi dua dub ψs (g1 , g2 , g3 ; ua )ψs (g4 , ḡ3 , g5 ; ub )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )\n\ni=1\n\n× μ2\n\nZ Y\n4\n\n−1\n−1\n−1\n−1\n−1\n−1\ndαi δ(ḡ1 α−1\n4 α1 g1 )δ(ḡ2 α3 α1 g2 )δ(ḡ3 α2 α1 ua hua g3 )\n\ni=1\n−1\n−1\n−1\n−1\n−1\n−1\n× δ(ḡ4 α−1\n3 α2 ub hub g4 )δ(ḡ5 α4 α2 g5 )δ(ḡ6 α4 α3 g6 )\nX\n−1\n−1 −1\n−1\nI\nI\n× δ(α1 u−1\nub α−1\n(ua α−1\nDsn\na hua α1 α2 ub h\n2 )\n1 )Dsnb (ub α2 )δna nb .\na\nna ,nb\n\n(C1)\nNow we start from the other end. The vertex term for the rhs of FIG. 5 is\nZ Y\nZ Y\n4\n4\n6\nY\ndαi\ndγjk ψs (g1 , g2 , g3 ; ua γ14 α1 )ψs (g4 , ḡ3 , g5 ; ub γ24 α2 )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )\ndgi dḡi dua dub\ni=1\n\n×\n\ni=1\n\nj,k=1 : j<k\n\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\n−1\nμ2 δ(ḡ1 α−1\n4 γ14 α1 g1 )δ(ḡ2 α3 γ13 α1 g2 )δ(ḡ3 α2 γ12 α1 g3 )δ(ḡ4 α3 γ23 α2 g4 )δ(ḡ5 α4 γ24 α2 g5 )δ(ḡ6 α4 γ34 α3 g6 )\n−1 −1 −1 −1\n−1\n−1 −1 −1\n−1\n× δ(γ12\nγ24 ua h ua γ14 )δ(γ13\nγ23 γ12 )δ(γ23\nγ34 ub hub γ24 )δ(γ13 γ14\nγ34 )\n\nX\n\nI\nI\n(ua )Dsn\n(ub )δna nb .\nDsn\na\nb\n\nna ,nb\n\n(C2)\n\n\f26\nUpon integrating with respect to γ12 , γ13 and γ23 our action reduces to\nZ Y\n6\n\ni=1\n\ndgi dḡi dua dub\n\nZ Y\n4\n\ni=1\n\ndαi\n\n3\nY\n\ndγj4 ψs (g1 , g2 , g3 ; ua γ14 α1 )ψs (g4 , ḡ3 , g5 ; ub γ24 α2 )φ(ḡ4 , ḡ2 , g6 )φ(ḡ6 , ḡ5 , ḡ1 )\n\nj=1\n\n−1\n−1 −1\n−1\n−1 −1 −1 −1\n× μ2 δ(ḡ1 α−1\nua γ14 α1 g3−1 )\n4 γ14 α1 g1 )δ(ḡ2 α3 γ34 γ14 α1 g2 )δ(ḡ3 α2 γ24 ua h\n\n(C3)\n\n−1\n−1 −1 −1\n−1\n−1\n−1\nδ(ḡ4 α−1\n3 γ23 α2 g4 )δ(ḡ5 α3 γ34 ub hub α2 g5 )δ(ḡ6 α4 γ34 α3 g6 )\nX\n−1 −1\n−1\nI\nI\n(ua α−1\n× δ(u−1\nub )\nDsn\na hua ub h\n1 )Dsnb (ub α2 )δna nb .\na\nna ,nb\n\nand redefining γ14 α1 → α1 , γ24 α2 → α2 and γ34 α3 → α3 followed by ua α1 → ua and ub α2 → ub we end up with (C1).\nAPPENDIX D: 2-3 EQUALITY\n\nWe drew the 2-3 move in FIG. 9 of Section II C. Here, we will prove this relation explicitly. We place the amplitudes\nfor the lhs and rhs figures in two columns:\n\n−1\n−1\nδ(g1′ ᾱ−1\n1 ᾱ4 α4 α1 g1 )\n−1\n′ −1\nδ(g5 ᾱ2 ᾱ4 α4 α2 g5−1 )\n−1\n−1\nδ(g9′ ᾱ−1\n3 ᾱ4 α4 α3 g9 )\n−1\n\n−1\n′\nδ(g2′ ᾱ−1\n1 ua hua ᾱ3 g 8 )\n−1 −1 −1\nδ(g2 α1 ub h ub α3 g8−1 )\n\nδ(g1′ γ1−1 γ2 g1−1 )\nδ(g5′ γ̃1−1 γ̃2 g5−1 )\nδ(g9′ γ̄1−1 γ̄2 g9−1 )\n−1\n\n−1\n′\nδ(g2′ γ1−1 γ4 u−1\na hua γ̄3 γ̄1 g 8 )\n−1\n−1 −1\n−1\nδ(g2 γ2 γ4 ub h ub γ̄3 γ̄2 g8−1 )\n\n−1\n\nδ(g3′ γ1−1 γ3 γ̃4−1 γ̃1 g ′ 4 )\nδ(g3 γ2−1 γ3 γ̃4−1 γ̃2 g4−1 )\n\n−1\n\nδ(g6′ γ̃1−1 γ̃3 γ̄4−1 γ̄1 g ′ 7 )\nδ(g6 γ̃2−1 γ̃3 γ̄4−1 γ̄2 g7−1 )\n\n′\nδ(g3′ ᾱ−1\n1 ᾱ2 g 4 )\n−1\nδ(g3 α1 α2 g4−1 )\n′\nδ(g6′ ᾱ−1\n2 ᾱ3 g 7 )\n−1\nδ(g6 α2 α3 g8−1 )\n\n−1\n\n−1\n\nδ(γ3−1 γ4 γ̄3−1 γ̄4 γ̃3−1 γ̃4 )\n−1\nδ(ua α4 ᾱ−1\n4 ub )\nIa\ns\ns\nIa\nDs.\n(ua α3 )Dsm\n(ua α4 ) Dsm\n(ub ᾱ4 )Ds.\n(ub ᾱ3 )\n\nδ(ua u−1\nb )\nIa\ns\ns\nIa\nDs.\n(ua γ̄2 )Dsm\n(ua ) Dsm\n(ub )Ds.\n(ub γ̄1 )\n\nFrom here we are going to manipulate the rhs to have the same form as the left by redefining variables and using one\nintegration. We have neglected to insert the explicit integration of the variables.\n\n\f27\n• Step 1. Redefine the following variables for the rhs:\nγ̄3−1 γ̄1 → γ̄1 ,\n\nγ̄3−1 γ̄2 → γ̄2 ,\n\nγ4−1 γ1 → γ1 , γ4−1 γ2 → γ2 ,\n\nγ̃4−1 γ̃1 → γ̃1 ,\n\nγ̃4−1 γ̃2 → γ̃2 .\n\n(D1)\n\n• Step 2. Integrate w.r.t. γ̃4 .\n• Step 3. Redefine:\n\nγ4−1 γ3 γ̃1 → γ̃1 ,\n\nγ4−1 γ3 γ̃2 → γ̃2 . At this point the rhs looks like:\n\nδ(g1′ γ1−1 γ2 g1−1 )δ(g5′ γ̃1−1 γ̃2 g5−1 )δ(g9′ γ̄1−1 γ̄2 g9−1 )\n−1\n\n−1 −1 −1\n′\nub γ̄2 g8−1 )\nδ(g2′ γ1−1 u−1\na hua γ̄1 g 8 )δ(g2 γ2 ub h\n−1\n\nδ(g3′ γ1−1 γ̃1 g ′ 4 )δ(g3 γ2−1 γ̃2 g4−1 )\n\n(D2)\n\n−1\nδ(g6′ γ̃1−1 γ̄1 g ′ 7 )δ(g6 γ̃2−1 γ̄2 g7−1 )\ns\ns\nIa\nIa\nδ(ua u−1\nb )Ds. (ua γ̄2 )Dsm (ua ) Dsm (ub )Ds. (ub γ̄1 )\n\n• Step 4. Relabel:\n\nγ1 → ᾱ−1\n4 ᾱ1 ,\n\n• Step 5. Redefine:\n\nua → ua α4 ,\n\nγ̃1 → ᾱ−1\n4 ᾱ2 ,\n\nγ̄1 → ᾱ−1\n4 ᾱ3 ,\n\nγ2 → α4−1 α1 ,\n\nγ̃2 → α−1\n4 α2 ,\n\nγ̄2 → α−1\n4 α3 .\n\nub → ub ᾱ4 .\n\nThat finishes the proof of the equality.\nAPPENDIX E: EQUALITY OF THE TWO BIVALENT VERTEX TERMS\n\nIn Section II B, equation (21), we stated a result concerning the equality of two vertex terms with a bivalent particle\ninteraction. We prove this here. The new term as given in (21) is\nμ2\n\nZ Y\n6\n\n−1 −1\nub , g3 , g5 ; ub )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 )\ndgi dua dub Pα1 ψs (g1 , g2 , g3 u−1\na hua ; ua )Pα2 ψs (g4 ub h\n\ni=1\n\n(E1)\n−1 −1\n× δ(u−1\nub )\na hua ub h\n\nX\n\nI\nI\n(ua )Dsn\n(ub )δna nb\nDsn\na\nb\n\nna ,nb\n\nUpon integrating with respect to ub we find that the δ-function is satisfied if ub = kua for all k ∈ U (1) the same U (1)\nsubgroup that contains h. Thus our vertex becomes\nμ2\n\nZ Y\n6\n\ndgi dua dub\n\ni=1\n\nZ\n\nU(1)\n\n−1 −1\nua , g3 , g5 ; kua )Pα3 φ(g4 , g2 , g6 )\ndk Pα1 ψs (g1 , g2 , g3 u−1\na hua ; ua )Pα2 ψs (g4 ua h\n\n×\n\n(E2)\n\nI\n(k)\nPα4 φ(g6 , g5 , g1 )Dss\n\n−1\nJ\nua , g3 , g5 ; kua ) =\nBut we note that Dss\n= e−isøk for all J and a given øk such that 0 ≤ øk ≤ 2π. Thus, ψs (g4 u−1\na h\nisøk\n−1 −1\ne\nψs (g4 ua h ua , g3 , g5 ; kua ) and the k dependent part of this amplitude is\n2π\n\ndøk −isøk isøk\ne\ne\n= 1.\n2π\n\n(E3)\n\n−1 −1\nua , g3 , g5 ; ua )Pα3 φ(g4 , g2 , g6 )Pα4 φ(g6 , g5 , g1 ),\ndgi dua Pα1 ψs (g1 , g2 , g3 u−1\na hua ; ua )Pα2 ψs (g4 ua h\n\n(E4)\n\nZ\n\n0\n\nWe are finally left with\nμ2\n\nZ Y\n6\n\ni=1\n\n\f28\nwhich is independent of k and I as promised.\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n\nD. Oriti, Rept. Prog. Phys. 64, 1489 (2001), gr-qc/0106091;\nA. Perez, Class. Quant. Grav. 20, R43 (2003), gr-qc/0301113\nL. Freidel , Int. J. Theor. Phys. 44, 1769 (2005)hep-th/0505016\nD. Oriti, in \"Mathematical and Physical Aspects of Quantum Gravity\", B. Fauser, J. Tolksdorf and E. Zeidler, eds.,\nBirkhaeuser, Basel (2006), gr-qc/0512103\nL. Freidel, D. Louapre, Class. Quant. Grav. 21, 5685 (2004), hep-th/0401076\nD. Boulatov, Mod. Phys. Lett. A 7, 1629 (1992), hep-th/9202074\nC. Rovelli, Class. Quant. Grav. 8, 297 (1991)\nC. Rovelli, Phys. Rev. D 65, 124013 (2002), gr-qc/0110035;\nB. Dittrich, gr-qc/0507106;\nG. Amelino-Camelia, gr-qc/0412136\nL. Freidel, D. Louapre, gr-qc/0410141\nL. Freidel, E. Livine, hep-th/0502106\nL. Crane, gr-qc/0110060\nL. Smolin, Nucl. Phys. Proc. Suppl. 88, 103 (2000), hep-th/9801022\nA. Mikovic, Class. Quant. Grav. 19, 2335 (2002), hep-th/0108099\nD. Oriti, H. Pfeiffer, Phys. Rev. D 66, 124010 (2002), gr-qc/0207041\nA. Mikovic, Class. Quant. Grav. 20, 239 (2003), gr-qc/0210051\nK. Noui, A. Perez, Class. Quant. Grav. 22, 4489 (2005), gr-qc/0402111\nH. Morales-Tecotl, C. Rovelli, Phys. Rev. Lett. 72, 3642 (1994), gr-qc/9401011\nK. Krasnov, Phys. Rev. D 53, 1874 (1996), gr-qc/9506029\nJ. Baez, K. Krasnov, J. Math. Phys. 39, 1251 (1998), hep-th/9703112\nT. Thiemann, Class. Quant. Grav. 15, 1281 (1998), gr-qc/9705019\nS. Deser, R. Jackiw, G. 't Hooft, Annals Phys. 152, 220 (1984)\nH. J. Matschull, M. Welling Class. Quant. Grav. 15, 2981 (1998), gr-qc/9708054\nJ. W. Barrett, Mod. Phys. Lett. A 20, 1271 (2005), gr-qc/0412107; J. W. Barrett, gr-qc/0502048\nK. Krasnov, hep-th/0505174\nL. Freidel, D. Oriti, J. Ryan, gr-qc/0506067\nA. Baratin, L. Freidel, E. Livine, in preparation;\nJ. Kowalski-Glikman, hep-th/0405273\nK. Noui, in preparation\nD. Oriti, J. Ryan, in preparation\nR. Oeckl, D. Oriti, J. Ryan, in preparation\nL. Freidel, D. Louapre, Nucl. Phys. B 662, 279 (2003), gr-qc/0212001\nR. P. Feynman, Phys. Rev. 80, 440-457 (1950);\nL. Hostler, J. Math. Phys. 21, 2461 (1980);\nA. Baratin, L. Freidel, in preparation\nR. De Pietri, C. Petronio, J. Math. Phys. 41, 6671-6688 (2000), gr-qc/0004045\nR. De Pietri, L. Freidel, K. Krasnov and C. Rovelli, Nucl. Phys. B 574, 785 (2000), hep-th/9907154\nReisenberger MP and Rovelli C, Class. Quant. Grav. 18 (2001) 121,gr-qc/0002095\nL. Freidel, J. Kowalski-Glikman, L. Smolin, Phys. Rev. D 69, 044001 (2004), hep-th/0307085\n\n\f"}