{"id": "http://arxiv.org/abs/gr-qc/0607097v1", "guidislink": true, "updated": "2006-07-23T00:49:44Z", "updated_parsed": [2006, 7, 23, 0, 49, 44, 6, 204, 0], "published": "2006-07-23T00:49:44Z", "published_parsed": [2006, 7, 23, 0, 49, 44, 6, 204, 0], "title": "Semiclassical states for quantum cosmology", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0607131%2Cgr-qc%2F0607061%2Cgr-qc%2F0607085%2Cgr-qc%2F0607073%2Cgr-qc%2F0607047%2Cgr-qc%2F0607068%2Cgr-qc%2F0607038%2Cgr-qc%2F0607041%2Cgr-qc%2F0607050%2Cgr-qc%2F0607004%2Cgr-qc%2F0607106%2Cgr-qc%2F0607058%2Cgr-qc%2F0607080%2Cgr-qc%2F0607087%2Cgr-qc%2F0607051%2Cgr-qc%2F0607081%2Cgr-qc%2F0607007%2Cgr-qc%2F0607133%2Cgr-qc%2F0607079%2Cgr-qc%2F0607129%2Cgr-qc%2F0607057%2Cgr-qc%2F0607048%2Cgr-qc%2F0607019%2Cgr-qc%2F0607037%2Cgr-qc%2F0607113%2Cgr-qc%2F0607018%2Cgr-qc%2F0607067%2Cgr-qc%2F0607096%2Cgr-qc%2F0607065%2Cgr-qc%2F0607059%2Cgr-qc%2F0607090%2Cgr-qc%2F0607064%2Cgr-qc%2F0607034%2Cgr-qc%2F0607142%2Cgr-qc%2F0607016%2Cgr-qc%2F0607108%2Cgr-qc%2F0607035%2Cgr-qc%2F0607025%2Cgr-qc%2F0607093%2Cgr-qc%2F0607140%2Cgr-qc%2F0607084%2Cgr-qc%2F0607075%2Cgr-qc%2F0607121%2Cgr-qc%2F0607030%2Cgr-qc%2F0607043%2Cgr-qc%2F0607105%2Cgr-qc%2F0607032%2Cgr-qc%2F0607026%2Cgr-qc%2F0607053%2Cgr-qc%2F0607063%2Cgr-qc%2F0607071%2Cgr-qc%2F0607008%2Cgr-qc%2F0607112%2Cgr-qc%2F0607091%2Cgr-qc%2F0607015%2Cgr-qc%2F0607088%2Cgr-qc%2F0607125%2Cgr-qc%2F0607066%2Cgr-qc%2F0607045%2Cgr-qc%2F0607101%2Cgr-qc%2F0607097%2Cgr-qc%2F0607024%2Cgr-qc%2F0607029%2Cgr-qc%2F0607052%2Cgr-qc%2F0607123%2Cgr-qc%2F0607072%2Cgr-qc%2F0607040%2Cgr-qc%2F0607001%2Cgr-qc%2F0607077%2Cgr-qc%2F0607098%2Cgr-qc%2F0607092%2Cgr-qc%2F0607022%2Cgr-qc%2F0607130%2Cgr-qc%2F0607013%2Cgr-qc%2F0607107%2Cgr-qc%2F0607124%2Cgr-qc%2F0607100%2Cgr-qc%2F0607006%2Cgr-qc%2F0607141%2Cgr-qc%2F0607137%2Cgr-qc%2F0607028%2Cgr-qc%2F0607060%2Cgr-qc%2F0607031%2Cgr-qc%2F0607046%2Cgr-qc%2F0607078%2Cgr-qc%2F0607012%2Cgr-qc%2F0607122%2Cgr-qc%2F0607021%2Cgr-qc%2F0607138%2Cgr-qc%2F0607014%2Cgr-qc%2F0607003%2Cgr-qc%2F0607139%2Cgr-qc%2F0607086%2Cgr-qc%2F0607094%2Cgr-qc%2F0607054%2Cgr-qc%2F0607036%2Cgr-qc%2F0607027%2Cgr-qc%2F0607042%2Cgr-qc%2F0607049%2Cgr-qc%2F0607056%2Cgr-qc%2F0607062&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Semiclassical states for quantum cosmology"}, "summary": "In a metric variable based Hamiltonian quantization, we give a prescription\nfor constructing semiclassical matter-geometry states for homogeneous and\nisotropic cosmological models. These \"collective\" states arise as infinite\nlinear combinations of fundamental excitations in an unconventional \"polymer\"\nquantization. They satisfy a number of properties characteristic of\nsemiclassicality, such as peaking on classical phase space configurations. We\ndescribe how these states can be used to determine quantum corrections to the\nclassical evolution equations, and to compute the initial state of the universe\nby a backward time evolution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0607131%2Cgr-qc%2F0607061%2Cgr-qc%2F0607085%2Cgr-qc%2F0607073%2Cgr-qc%2F0607047%2Cgr-qc%2F0607068%2Cgr-qc%2F0607038%2Cgr-qc%2F0607041%2Cgr-qc%2F0607050%2Cgr-qc%2F0607004%2Cgr-qc%2F0607106%2Cgr-qc%2F0607058%2Cgr-qc%2F0607080%2Cgr-qc%2F0607087%2Cgr-qc%2F0607051%2Cgr-qc%2F0607081%2Cgr-qc%2F0607007%2Cgr-qc%2F0607133%2Cgr-qc%2F0607079%2Cgr-qc%2F0607129%2Cgr-qc%2F0607057%2Cgr-qc%2F0607048%2Cgr-qc%2F0607019%2Cgr-qc%2F0607037%2Cgr-qc%2F0607113%2Cgr-qc%2F0607018%2Cgr-qc%2F0607067%2Cgr-qc%2F0607096%2Cgr-qc%2F0607065%2Cgr-qc%2F0607059%2Cgr-qc%2F0607090%2Cgr-qc%2F0607064%2Cgr-qc%2F0607034%2Cgr-qc%2F0607142%2Cgr-qc%2F0607016%2Cgr-qc%2F0607108%2Cgr-qc%2F0607035%2Cgr-qc%2F0607025%2Cgr-qc%2F0607093%2Cgr-qc%2F0607140%2Cgr-qc%2F0607084%2Cgr-qc%2F0607075%2Cgr-qc%2F0607121%2Cgr-qc%2F0607030%2Cgr-qc%2F0607043%2Cgr-qc%2F0607105%2Cgr-qc%2F0607032%2Cgr-qc%2F0607026%2Cgr-qc%2F0607053%2Cgr-qc%2F0607063%2Cgr-qc%2F0607071%2Cgr-qc%2F0607008%2Cgr-qc%2F0607112%2Cgr-qc%2F0607091%2Cgr-qc%2F0607015%2Cgr-qc%2F0607088%2Cgr-qc%2F0607125%2Cgr-qc%2F0607066%2Cgr-qc%2F0607045%2Cgr-qc%2F0607101%2Cgr-qc%2F0607097%2Cgr-qc%2F0607024%2Cgr-qc%2F0607029%2Cgr-qc%2F0607052%2Cgr-qc%2F0607123%2Cgr-qc%2F0607072%2Cgr-qc%2F0607040%2Cgr-qc%2F0607001%2Cgr-qc%2F0607077%2Cgr-qc%2F0607098%2Cgr-qc%2F0607092%2Cgr-qc%2F0607022%2Cgr-qc%2F0607130%2Cgr-qc%2F0607013%2Cgr-qc%2F0607107%2Cgr-qc%2F0607124%2Cgr-qc%2F0607100%2Cgr-qc%2F0607006%2Cgr-qc%2F0607141%2Cgr-qc%2F0607137%2Cgr-qc%2F0607028%2Cgr-qc%2F0607060%2Cgr-qc%2F0607031%2Cgr-qc%2F0607046%2Cgr-qc%2F0607078%2Cgr-qc%2F0607012%2Cgr-qc%2F0607122%2Cgr-qc%2F0607021%2Cgr-qc%2F0607138%2Cgr-qc%2F0607014%2Cgr-qc%2F0607003%2Cgr-qc%2F0607139%2Cgr-qc%2F0607086%2Cgr-qc%2F0607094%2Cgr-qc%2F0607054%2Cgr-qc%2F0607036%2Cgr-qc%2F0607027%2Cgr-qc%2F0607042%2Cgr-qc%2F0607049%2Cgr-qc%2F0607056%2Cgr-qc%2F0607062&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In a metric variable based Hamiltonian quantization, we give a prescription\nfor constructing semiclassical matter-geometry states for homogeneous and\nisotropic cosmological models. These \"collective\" states arise as infinite\nlinear combinations of fundamental excitations in an unconventional \"polymer\"\nquantization. They satisfy a number of properties characteristic of\nsemiclassicality, such as peaking on classical phase space configurations. We\ndescribe how these states can be used to determine quantum corrections to the\nclassical evolution equations, and to compute the initial state of the universe\nby a backward time evolution."}, "authors": ["Viqar Husain", "Oliver Winkler"], "author_detail": {"name": "Oliver Winkler"}, "author": "Oliver Winkler", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.75.024014", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0607097v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0607097v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0607097v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0607097v1", "journal_reference": "Phys.Rev.D75:024014,2007", "doi": "10.1103/PhysRevD.75.024014", "fulltext": "Semiclassical states for quantum cosmology\nViqar Husain and Oliver Winkler\nDepartment of Mathematics and Statistics,\nUniversity of New Brunswick,\nFredericton, NB E3B 5A3, Canada.\nPerimeter Institute of Theoretical Physics\nWaterloo, ON Canada.\n\narXiv:gr-qc/0607097v1 23 Jul 2006\n\nEMail: husain@math.unb.ca,\nowinkler@perimeterinstitute.ca\n\nIn a metric variable based Hamiltonian quantization, we give a prescription for\nconstructing semiclassical matter-geometry states for homogeneous and isotropic cosmological models. These \"collective\" states arise as infinite linear combinations of\nfundamental excitations in an unconventional \"polymer\" quantization. They satisfy\na number of properties characteristic of semiclassicality, such as peaking on classical\nphase space configurations. We describe how these states can be used to determine\nquantum corrections to the classical evolution equations, and to compute the initial\nstate of the universe by a backward time evolution.\n\nI.\n\nINTRODUCTION\n\nOne of the foundational questions in cosmology is how a large universe described effectively by classical physics emerges from a small and highly quantum one. There are many\nfacets to this question, ranging from a \"theory of initial conditions\" for the Wheeler-DeWitt\nequation to the origin of the vacuum state responsible for the emergence of density fluctuations, to how such fluctuations become classical. At present, there are no final answers to\nthese questions.\nWhile the relation between a quantum system and its classical counterpart has many\nfacets, see [1] for a nice overview and [2] for a discussion in the context of quantum gravity,\nthe notion of semiclassical state plays an important role. For a \"standard\" quantum system\nsuch as the harmonic oscillator there is a well-developed notion of semiclassical state, namely\nthe \"coherent state\", characterized by properties such as minimum uncertainty, peakedness\non a classical configuration, and the relationship to classical physics that arises via Ehrenfest theorems. For quantum gravity the WKB approximation has been the more common\napproach for exploring semiclassical physics, although there has been work in cosmology\nthat uses a notion of semiclassical state [3].\nIn this paper we develop the semiclassical sector of quantum cosmology. To do this\n\n\f2\nwe use a \"polymer\" quantization of Friedmann-Robertson-Walker (FRW) cosmology in the\nArnowitt-Deser-Misner (ADM) canonical variables that was recently presented in [4]. (For a\nrelated discussion using connection-triad variables see Refs. [5, 6, 7].) We give a construction\nof semiclassical states, and show that these states have properties such as being peaked on\na point in classical phase space, and satisfying minimal uncertainty relations.\nWe then outline how these states can be used in applications. First we discuss how\nto calculate quantum corrections to the classical FRW dynamics by calculating expectation\nvalues of the quantum dynamical equations in those coherent states. There are some options\navailable for this, reflecting approaches one can take to gravitational dynamics.\nThe second application concerns the question of the initial state of the universe. The\nbasic idea is to posit that the present state of the universe is described by a semiclassical\nstate (to be described below), and then ask questions about the history of the universe by\nevolving this state backward (or forward) in time. Or, put the other way around, what\nquantum state when evolved for a sufficiently long time leads to the state that we observe\ntoday, i.e. a semiclassical state peaked on a flat FRW cosmology with some matter content?\nThis requires a notion of time and its corresponding true Hamiltonian, which we obtain by\nfixing a time gauge. This provides a computational framework that allows one to compute\nthe \"initial state\" of the universe.\nThe paper is structured as follows: In section II we describe the classical system. In\nsection III we recall its quantization as developed in [4], with slight modifications to better\nsuit our goals here, and then introduce semiclassical states. We prove several properties\nwhich are physical requirements for a semiclassical interpretation of these states. In the\nfinal section we present an outline of two interesting applications of these coherent states.\n\nII.\n\nCLASSICAL THEORY\n\nOur starting point is the ADM Hamiltonian action for general relativity minimally coupled to a massless scalar field\n1\nS=\n8πG\n\nZ\n\n\u0010\n\nd3 xdt π̃ ab q̇ab + pφ φ̇ − NH − N a Ca\n\n\u0011\n\n(1)\n\nwhere the Hamiltonian and diffeomorphism constraints are\n\u0012\n\n\u0013\n\n1\n1 √ ab\n1\n1\n√\nH = √ π̃ ab π̃ab − π̃ 2 + q(Λ − R(q)) + 8πG( √ p2φ +\nqq ∂a φ∂b φ)\nq\n2\n2 q\n2\nCa = Dc π̃ac + 8πGpφ ∂a φ,\n\n(2)\n(3)\n\nwhere π̃ = π̃ ab qab , R(q) is the Ricci scalar of the spatial metric qab , and Λ is the cosmological\nconstant.\n\n\f3\nA reduction to the flat homogeneous isotropic case may be done by writing a parametrization for the canonical pair (qab , π̃ ab ). For FRW cosmology a suitable choice is\nqab = a2 (t)eab\npa (t) ab\ne\nπ̃ ab =\n2a\n\n(4)\n(5)\n\nwhere eab is the flat Euclidean metric. Plugging this into the ADM 3+1 action gives the\nreduced action\nZ\n\u0011\n1 \u0010\nRed\nS\n= dt\npa ȧ + pφ φ̇ − NHR\n(6)\n8πG\nwhere the reduced Hamiltonian constraint, or equivalently the Friedman equation in canonical coordinates, is\np2φ\n3 p2a\n3\n+ |a| Λ + 8πG\n= 0.\n(7)\nHR = −\n8 |a|\n2|a|3\n\nThe fundamental Poisson bracket relations are\n{a, pa } = 8πG,\n\n{φ, pφ } = 1.\n\n(8)\n\nThe topology of the reduced phase space (for gravity and matter) is R2 × R2 . In c = 1 units\nthe gravitational phase space variables each have dimension length.\nThe configuration and translation variables a and\nUλ (pa ) = exp (iλpa /L)\n\n(9)\n\nsatisfy the algebra\n\n8πG\niλUλ .\n(10)\nL\nAs the classical limit for the coherent states constructed below is obtained by sending a\ndimensionless parameter t to zero (the correct implementation of the textbook style \"~ → 0\"\nlimit), it turns out to be useful to work with the dimensionless variables ã = La and p̃a = pLa ,\nfor which the Poisson bracket becomes\n{a, Uλ } =\n\n{ã, Ũλ } =\n\n8πG\niλŨλ ,\nL2\n\n(11)\n\nwhere Ũλ = exp(iλp̃a ). From here onwards we drop the tilde and use the dimensionless\nvariables. This is the basic bracket that will be realized as a commutator in the quantum\ntheory.\nAnother observable of interest is the inverse scale factor 1/a, which may be represented\nby classical identities of the type [8]\n1\n4L4\n=−\n|a|\n(8πG)2 λ2\n\n\u0012\n\n\u001a\n\nUλ∗ Uλ ,\n\nq\n\n\u001b\u00132\n\n|a|\n\n.\n\n(12)\n\n\f4\nSuch expressions are useful in that a representation of the variables a and Uλ leads, via\nthe right hand side, to a realization of inverse scale factor and curvature operators that are\nwell-defined even on the state corresponding to the classical singularity.\nFor a dynamical system with a Hamiltonian constraint there are two ways to proceed to\nquantization– either via a reduced Hamiltonian obtained from a time gauge-fixing, or by a\nHamiltonian constraint operator. The former has the advantage that it \"solves\" the problem\nof time at the classical level by an explicit deparametrization, but it leaves open the question\nof unitary equivalence of quantum theories obtained from different time gauges. The latter\nis aimed at obtaining fully gauge invariant states in which the problem of time must still be\naddressed in some way before dynamical processes can be described.\nIn vacuum gravity a gauge choice is a suitable function of the canonical coordinates and\nmomenta t = f (q, π). The functions f may be subdivided into three classes – intrinsic,\nextrinsic or mixed depending on whether f depends on the 3-metric q, its conjugate momentum π, or on both. If there is matter coupling, there is the additional possibility of\nchoosing the time (and other coordinate gauges) by choosing functions f that depend only\non the matter variables. When a canonical gauge fixing condition is used, the requirement\nthat it be preserved in time leads to equations that fix the lapse and shift functions.\nFor the covariant Einstein equations, gauge choices are made by fixing directly the lapse\nand shift. For example the choice N =constant is often made in cosmology. A canonical\nchoice for gravity coupled to a scalar field that has been much studied is t = φ [9, 10],\nespecially in relation to the problem of curvature singularity avoidance. We exhibit here the\ncanonical gauge-fixing conditions corresponding to the covariant choices N = 1 (\"Hubble\ntime\") and N = a(t) (conformal time), and derive the corresponding reduced Hamiltonians.\nWe do the same for the gauge condition φ = t.\nConsider first the time gauge t = ka2 /pa where k is a constant. The requirement that\nthis condition be preserved in time is\nṫ = 1 =\n\n(\n\n)\n\nka2\n, NH ,\npa\n\n(13)\n\nwhich gives (for Λ = 0)\nN = sgn(a)k\n\n−1\n\n9 12πGp2φ\n− −\n8\na2 p2a\n\n!−1\n\n.\n\n(14)\n\nSolving the Hamiltonian constraint strongly gives\n8πGp2φ\n3\n= ,\n2\n2\na pa\n4\n\n(15)\n\nso we get N = −sgn(a)4/9k. Thus k = −sgn(a)9/4 gives N = 1. The main point here is\nthe observation that Hubble time gauge corresponds to a canonical time choice proportional\nto a2 /pa .\n\n\f5\nThe reduced Hamiltonian is proportional to the variable canonically conjugate to the\ntime choice, evaluated on the solution of the Hamiltonian constraint. For the Hubble time\ngauge this is\ns\n2 8πGp2φ\n.\n(16)\nh=±\n3t\n3\nConsider next the time gauge t = ka/pa where k is again a constant. This leads to the\nlapse function\n!−1\na\n9 12πGp2φ\nN = sgn(a)\n,\n(17)\n− −\nk\n8\na2 p2a\nwhich gives N = a for k = −9/4. This leads to the FRW metric written in conformal time\n. The corresponding reduced Hamiltonian is\n1\nh=±\nt\n\ns\n\n8πGp2φ\n,\n3\n\n(18)\n\nwhich is proportional to the Hubble time Hamiltonian. This is an accident of homogeneity\nand the fact that ht ∼ apa for both of these time choices. Note also that the Hamiltonian gauge conditions corresponding to these commonly used covariant gauge choices are a\nmixture of the geometrodynamic coordinates and momenta.\nFinally for the t = φ gauge, the lapse function is\na3\n,\n8πGpφ\n\n(19)\n\n3\napa ,\n32πG\n\n(20)\n\nN = sgn(a)\nand the reduced Hamiltonian is\ns\n\nh=±\nwhich is time independent.\n\nIII.\n\nQUANTIZATION\n\nWe summarize briefly the quantization of this model presented in [4]. The definition\nof basic variables used here is slightly different in that we use dimensionless phase space\nvariables for quantization, which leads to a dimensionless parameter t = (lP /L)2 in the\noperator expressions (lP is the Planck length and L is an external scale). This parameter is\nthen utilized in the construction of semiclassical states.\nThe (kinematical) Hilbert space on which the basic variables are realized has a basis given\nby the kets |μi ≡ |exp(iμpa )i, where the quantum numbers μ ∈ R, with the inner product\nhμ|νi = δμν .\n\n(21)\n\n\f6\nThe basic variables are represented by\nâ|μi = 8πtμ|μi,\n\n(22)\n\nÛλ |μi = |μ − λi,\n\n(23)\n\n[â, Ûλ ] = −8πtλÛλ .\n\n(24)\n\nwhich gives the commutator\nThe (kinematical) Hilbert space is not separable since, unlike the Schrödinger representation,\nthe inner product is such that configuration variable eigenstates are normalizable. As a\nconsequence, the infinitesimal generators of translations, i.e. operators corresponding to\npa , do not exist in this Hilbert space. This is the essential difference from the Schrodinger\nrepresentation, and it leads to a fundamental inherent lattice structure at the quantum level.\nThe interested reader is referred to [4] for more details, and to [11, 12] for other applications\nof this type of quantization.\nWith the representation (23) an inverse scale factor operator is readily constructed using\n(12). It is diagonal in the basis with eigenvalue given by\nd\n1\n\n|a|\n\n|μi =\n\n\u0011\n\u0010\n1\n1/2\n1/2 2\n|μ|\n−\n|μ\n−\nλ|\n|μi.\n2πλ2 t\n\n(25)\n\nAlthough the (kinematical) Hilbert space used in this quantization is not separable, the\ndynamics selects a separable subspace, once an initial state has been chosen. Thus all computations are naturally restricted to separable subspaces, and this extends to the semiclassical\nsector constructed below. An example is given by the span of the vectors\n|mi ≡ |μ0 + mμi,\n\n(26)\n\nwhere m is an integer, and μ and μ0 are arbitrary real numbers; μ0 may be viewed as the\n\"origin\" of a lattice with spacing given by μ. In order to utilize this subspace, we must work\nwith operators that do not take us out of it. Since all operators are constructed from a and\nUλ , this is accomplished by working only with those Uλ 's adapted to the subspace, ie. we\nmust set λ = μ. In the following we set μ0 = 0 and work in the subspace |mλ >.\nIV.\n\nSEMICLASSICAL STATES\n\nCoherent states for a particle in the Schrödinger representation are of the form\n1\n2\nψ ∼ √ e−(x−x0 ) /2t+ixp0 .\nt\n\n(27)\n\nThese are peaked at the classical phase space point (x0 , p0 ) – in this sense they are semiclassical. The peaking properties may be seen by computing the expectation values of the x̂ and\n\n\f7\np̂ operators in this state. They also have the additional property that they are eigenstates\nof the operator x̂ − ip̂.\nWe would like to construct semiclassical states for FRW cosmology in the representation\ndescribed above, motivated by the same considerations. Such states have been discussed in\nloop quantum gravity [13], where the holonomy of a connection based on a spatial loop is\nthe analog of the translation variable Uλ . In particular the case of the U(1) gauge theory\ncoherent states discussed there is similar to what we require.\nThese considerations motivate the definition of states\n|α, βit,λ =\n\n∞\nt\n1 X\n2\ne− 2 (λm) emλα eimλβ |mi.\nC m=−∞\n\n(28)\n\nThe normalization constant C > 0 is given by the convergent sum\nC2 =\n\n∞\nX\n\n2 m2\n\ne−tλ\n\ne2αλm .\n\n(29)\n\nm=−∞\n\nThe real parameters α and β correspond to a classical configuration in the same sense as\nthe parameters x0 , p0 in the state (27), as we now show.\nA first check is to verify that the states (28) are eigenstates of an operator analogous\nto the annihilation operator Â = x̂ + ip̂ for a Schrodinger particle. However, since the\nmomentum operator is not directly represented in this quantization, the closest we have is\nthe exponential eA ≡ ex+ip , which is represented by the operator\neγâ Ûλ (p̂a ),\n\n(30)\n\nwhere the parameter γ is determined by the condition that the state (28) is an eigenstate\nof it. It is straightforward to verify that\n2 /2\n\ne(λ/8π)â Ûλ |α, βit,λ = etλ\n\neλ(α+iβ) |α, βit,λ.\n\n(31)\n\nThis result suggests that the expectation values of operators Ô(â, Ûγ ) are peaked at the\ncorresponding classical phase space functions O(a, pa ) in the limit t → 0. That this is in fact\nthe case is established by direct calculation of expectation values. The limit t → 0 requires\nuse of the Poisson re-summation formula\n\u0012\n\n∞\nX\n\n\u0013\n\n∞\n2π X\n2πm\n,\nf (sm) =\nf ̄\ns m=−∞\ns\nm=−∞\n\n(32)\n\nwhere s is a real parameter, f is function on the real line, and f ̄ is its Fourier transform\nf ̄(k) =\n\nZ\n\n∞\n\n−∞\n\ndx f (x)e−ikx .\n\n(33)\n\n\f8\nAs illustrative examples, let us compute in the state (28) the expectation value of â,\nÛλ , and of an expression for the momentum operator. The latter in this quantization is\nrepresented by\n\u0011\n1 \u0010\nÛλ − Ûλ† .\n(34)\np̂λa ≡\n2iλ\nLet us first note that the normalization constant for the semiclassical states (29) may be\nrewritten using (32) as\nC2 =\n\nr\n\n\n\n\n\n\u0013\n\n\u0012\n\nX\nπ α2 /t \n2πmα −π2 m2 /tλ2 \ne\ne\n.\n1\n+\n2\ncos\n2\nλt\nλt\nm6=0\n\n(35)\n\nThis form of the result facilitates taking the t → 0 limit since the terms in the sum gets\ndamped to zero. Using this we obtain\n\n\nhâi = 8πα \n\n1+2\n\n−tλ2 /4\n\nhÛλ i = eiλβ e\n\n1\n\nP\n\n\n\n\nm6=0 cos\n\n1+2\n\nP\n\nh\n\n2πmα\nλt\n\nm6=0\n\n1+2\n\ni\n\ncos\n\nP\n\ne−π2 m2 /tλ2\n\nh\n\n2πmα\nλt\n\nm6=0 cos\n\nh\n\n\u0010\n\n\n\n,\n\n1+\n\n2πmα\nλt\n\ni\n\ntλ\n2α\n\n(36)\n\u0011i\n\ne−π\n\n2 m2 /tλ2\n\ne−π2 m2 /tλ2\n\n\n\n.\n\n(37)\n\nNote that these expressions have the limits expected of semiclassical states:\nlim hâi = 8πα,\n\n(38)\n\nlim hÛλ i = eiλβ .\n\n(39)\n\nt→0\n\nt→0\n\nEquation (37) together with the definition (34) gives the expectation value\nhp̂λa i\n\n\n\nsin(βλ) −tλ2 /4 \n=\ne\nλ\n\n1+2\n\nP\n\nm6=0 cos\n\n1+2\n\nP\n\nh\n\n2πmα\nλt\n\nm6=0 cos\n\nh\n\n\u0010\n\n1+\n\n2πmα\nλt\n\ni\n\ntλ\n2α\n\n\u0011i\n\ne−π\n\n2 m2 /tλ2\n\ne−π2 m2 /tλ2\n\n\n\n,\n\n(40)\n\nwhere the Poisson re-summation formula has been used in the last step. This formula has\nthe limits\nlim hp̂λa i = sin(βλ)/λ,\nt→0\n\nlim hp̂λa i = β.\n\nλ→0\n\n(41)\n(42)\n\nThe first shows that the semiclassical state on the lattice is peaked at the corresponding phase\nspace value. The second shows that the continuum limit of the momentum expectation value\nhas the appropriate peaked value in this state, even though only the translation operators\nexist in the representation we are using for the quantum theory [18].\nIt is also possible to define λ dependent creation and annihilation operators in this quantization via\nÂλ ≡ â − ip̂λa\n(43)\n\n\f9\nand its adjoint. From the above result for the expectation value of p̂λa it follows that\nlim hÂλ i = α + iβ,\n\n(44)\n\nt→0\n\nand hence that the semiclassical state with α = β = 0 may be compared to the usual\noscillator vacuum in this alternative quantization. This \"vacuum\" |α = 0, β = 0i may be\nviewed as a \"collective\" state in the sense that it is an infinite linear combination of suitably\nweighed elementary states |mi. The states resulting from repeated action of Aλ† on this\nvacuum similarly provide a correspondence with the excited oscillator states. This idea\nmay also be applied to a related quantization of the scalar field [15], and the gravity scalar\nfield model in spherical symmetry [16] to gain more insight into how the usual background\ndependent Fock quantization of the scalar field is related to the present one.\nIt is also possible to see that the wave function corresponding to the state (28) is peaked\nin the same way as the one for the oscillator. Recall that the basis elements in which we write\nthe semiclassical state are configuration eigenstates with wave function e−iλmp . Therefore\nthe momentum space wave function corresponding to the state (28) is\nψ(α,β) (p) =\n\n1\nC\n\n∞\nX\n\nt\n\n2\n\ne− 2 (λm) emλα eimλ(β−p) .\n\n(45)\n\nm=−∞\n\nThis gives the momentum space probability distribution\n1\n|ψ(α,β) (p)|2 =\nC2\n\ns\n\n4π −(p−β)2 /2t\ne\nλ2 t\n\n1+2\n\nP\n\nm6=0 cos\n\n1+2\n\nP\n\n\u0010\n\n2πmα\nλt\n\nm6=0\n\ncos\n\n\u0011\n\n\u0010\n\ne−π\n\n2 m2 /tλ2 −2πm(p−β)/λt\n\n2πmα\nλt\n\n\u0011\n\ne−π2 m2 /tλ2\n\n2\n\n.\n\n(46)\n\nIt is evident from this expression that in the limit t → 0 the distribution is peaked at the\nmomentum value β, just as the position space oscillator wave function (27) is peaked at\nx0 . This is because the sums in the numerator and denominator are damped to zero in this\nlimit.\nSo far we have verified that the peaking property of the expectation value holds for the\nbasic phase space variables a and Uλ (pa ). This is expected to be true also for any function\nof the basic variables. For example, the explicit calculation for the expectation value of the\ninverse scale factor (12) gives\n* +\n1b\n1\nlim\n=\n,\n(47)\nt→0 a\n8πα\nwhich is the inverse of hâi (38) in this limit.\nAll the above properties establish that the states defined in eqn. (28) have the required\nsemiclassical properties.\n\n\f10\nV.\n\nAPPLICATIONS AND DISCUSSION\n\nIn this section we propose two applications of semiclassical states to cosmology. The\nfirst concerns computing quantum corrections to classical dynamics and makes use of the\nHeisenberg interpretation. The second concerns implementing an idea to obtain the wave\nfunction at early times by evolving a semiclassical state backward in time, and uses the\nSchrodinger representation. Their implemention will appear elsewhere.\n\nA.\n\nQuantum corrections to classical dynamics\n\nOne of the expectations from a quantum theory of gravity is that it provide a mechanism\nfor the emergence of a classical spacetime in an appropriate limit, and a procedure for\ncomputing quantum corrections to classical equations. An immediate application would be\nto cosmology, which is perhaps the only arena where a quantum gravity theory may be\ntestable.\nA possible approach for computing quantum corrections to classical cosmological equations is suggested by the peaking results for semiclassical states proven above. The basic idea\nis to obtain the Heisenberg equations of motion for the relevant observables, and compute\nthe expectation values of the commutator terms in the semiclassical states. In the t → 0\nlimit the resulting equation would give the classical equations because to the results of the\nlast section.\nThere are two ways that this idea can be implemented – with or without a time gauge\nfixing. In the former case the Hamiltonian h corresponding to the time gauge fixing is derived\nat the classical level and converted to an operator. The quantum corrected equations are\nthen postulated to be\nh\ni\nȧ = hα, β| â, ĥ |α, βi\n(48)\nfor the scale factor, with similar equations for the scalar field and the conjugate momenta.\nThe right hand side may be expanded in powers of the parameter t to give the classical term\nand its corrections order by order.\nIf working without a time gauge fixing, the Hamiltonian constraint operator would be\nused with an arbitrary lapse function to obtain the evolution equation. This requires a\ndefinition of the Hamiltonian constraint operator ĤR coming from the classical expression\n(7). The square of the momentum in this constraint may be realized by the operator\n\u0010\n\n\u00112\n\n\u0011\n1 \u0010\n†\n2\n−\nÛ\n−\nÛ\n.\n(49)\nλ\nλ\nλ2\nThis, together with the operator corresponding to 1/|a| given in Eqn. (12) gives an expression for the first term in the Hamiltonian constraint operator (with a choice of operator\nordering).\n\np̂λa\n\n=\n\n\f11\nThe semiclassical state peaked on a classical solution of the constraint satisfies\nlimhĤR i = 0 + O(tσ ),\nt→0\n\n(50)\n\nwhere the power σ > 0 of the first quantum correction to expectation value may depend on\nthe choice of operator ordering in the p2a /a factor in the constraint (7). Without the limit,\nthis equation gives quantum corrections to the Friedman equation. Similarly, corrections to\nthe Hamiltonian evolution are obtained by computing the right hand sides of lapse dependent\nequations such as\nh\ni\nȧ = Nhα, β| â, ĤR |α, βi.\n(51)\nWe emphasize that this procedure is quite different from what is usually called \"the\nsemiclassical approximation\" in quantum gravity, which treats gravity classically and matter\nquantum mechanically. The central difference is that here the matter and gravity variables\nare treated at the same level – the full state used to compute quantum corrections is the\ntensor product of the matter and gravity semiclassical states. It is however possible, and\nquite straightforward to obtain this usual and more limited approximation from our more\ngeneral procedure by taking the t → 0 limit in the expectation values for only those term\nthat contain the gravitational variables. This effectively makes gravity variables classical,\nwith the matter and interaction parts receiving the t dependent quantum corrections, with\nan implicit choice of \"vacuum\" defined by the matter semiclassical state.\n\nB.\n\nInitial state of the Universe\n\nSemiclassical states may be used as a \"present time condition\" for the cosmological state\nof the Universe. This is a reasonable assumption because observations suggest that an FRW\nmodel provides a good large scale description. This state may be evolved into the past or\nthe future using the Hamiltonian operator obtained by a time gauge fixing. It is apparent\nfrom the form of the Hamiltonian that such evolution leads, after some time steps, to a new\nstate that is not of the form (28). An initial state can be tracked to early times by following\nthe evolution of the probability density (46).\nIt is perhaps easiest to implement this procedure using the time independent Hamiltonian\nobtained from the φ = t gauge. After this gauge fixing the canonical variables are the pair\n(a, pa ) with Hamiltonian h ∼ apa . A time step evolution of an initial state using a simple\nscheme such as\n\u0010\n\u0011\nψ(t + ∆t) = I + i~∆t ĥ ψ(t)\n(52)\n\nmay be implemented numerically to see how the state evolves to the past and future, and\nalso to obtain an idea of the degree of coherence that is retained by evolution.\n\n\f12\nAlthough such evolution is unitary by construction, numerical implementation restores\nit only up to some order in the time step ∆t. For example for the simple explicit scheme\ngiven above, unitarity is not exact with violations of order ∆t2 . There are known implicit\nschemes whose unitary behaviour is much better. An example is provided by a modified\nCrank-Nicholson method where the Schrodinger equation is discretised as\nĥ\ni\n[ψ(t + ∆t) − ψ(t)] = [ψ(t + ∆t) + ψ(t)] .\n∆t\n2\n\n(53)\n\nThis time stepping scheme remains useful if the gauge fixing is such that the Hamiltonian\nhas explicit time dependence.\nThere are other physical situations where these semiclassical states may be used in cosmology. One of these is the question of quantum gravity corrections to the spectrum of\ndensity perturbations. There has been an initial exploration of this question without coherent states [17], where a quantum gravity corrected FRW scalar wave equation is obtained\nby replacing inverse scale factor terms by the eigenvalue of the corresponding operator (12)\nin a basis state. In the energy regime where this calculation is normally done, spacetime\nis approximately classical. Therefore it would be interesting to do such a calculation with\nthe expectation value taken in the appropriate semiclassical state, and expanded to the\ndesired order in the Planck length. This would give controlled corrections to the usual\nquantum-fields-on-a-classical-background semiclassical approximation. Work on developing\nthese applications is in progress.\nAcknowledgements: This work was supported in part by the Natural Science and Engineering Research Council of Canada.\n\n[1] N.P. Landsman, Between classical and quantum, to appear in Handbook of the Philosophy of\nScience, North Holland (2006).\n[2] C. Kiefer, in Canonical Gravity - from classical to quantum, Springer (1994).\n[3] See for example B. Bolen, L. Bombelli, A. Corichi Class. Quant. Grav. 21, 4087 (2004), and\nreferences therein.\n[4] V. Husain, O. Winkler, Phys. Rev. D 69 084016 (2004).\n[5] M. Bojowald, Inverse scale factor in isotropic quantum geometry, Phys. Rev. D64 084018\n(2001).\n[6] M. Bojowald, Loop quantum cosmology IV: discrete time evolution, Class. Quant. Grav. 18,\n1071 (2001).\n\n\f13\n[7] A. Ashtekar, M. Bojowald, and J. Lewandowski, Mathematical structure of loop quantum\ncosmology, Class. Quant. Grav. (2003).\n[8] T. Thiemann, Class. Quant. Grav. 15, 839 (1998).\n[9] W. F. Blyth, C. J. Isham, Phys. Rev. D11, 768 (1975).\n[10] M. J. Gotay, J. Demaret, Nucl. Phys. B (Proc. Suppl.) 57, 227 (1977).\n[11] H. Halvorson, Complementarity of representations in quantum mechanics, Stud. Hist. Phil.\nMod. Phys. 35, 45 (2004).\n[12] A. Ashtekar, S. Fairhurst, and J. Willis, Quantum gravity, shadow states, and quantum mechanics, Class. Quan. Grav. 20, 1031 (2003).\n[13] T. Thiemann, Class. Quant. Grav. 18, 2025 (2001); T. Thiemann, O. Winkler, Class. Quant.\nGrav. 18, 2561 (2001);\nT. Thiemann, O. Winkler, Class. Quant. Grav. 18, 4629(2001).\n[14] K. Fredenhagen, F. Reszewski, \"Polymer state approximations of Schrödinger wave functions,\"\ngr-qc/0606090.\n[15] A. Ashtekar, J. Lewandowski, H. Sahlmann, Class. Quant. Grav. 20, L11 (2003).\n[16] V. Husain, O. Winkler, Class. Quant. Grav. 22, L127 (2005); Class. Quant. Grav. 22, L 135\n(2005).\n[17] S. Hofmann, O. Winkler, gr-qc/0411124.\n[18] After this work was completed, we became aware of ref. [14] where there is a related discussion\nof an approximate momentum operator in this representation.\n\n\f"}