{"id": "http://arxiv.org/abs/gr-qc/0006068v1", "guidislink": true, "updated": "2000-06-20T06:36:00Z", "updated_parsed": [2000, 6, 20, 6, 36, 0, 1, 172, 0], "published": "2000-06-20T06:36:00Z", "published_parsed": [2000, 6, 20, 6, 36, 0, 1, 172, 0], "title": "Localization of gravitational field energy and a procedure proposed for\n  its experimental verification", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0006028%2Cgr-qc%2F0006083%2Cgr-qc%2F0006063%2Cgr-qc%2F0006085%2Cgr-qc%2F0006010%2Cgr-qc%2F0006084%2Cgr-qc%2F0006025%2Cgr-qc%2F0006086%2Cgr-qc%2F0006043%2Cgr-qc%2F0006073%2Cgr-qc%2F0006081%2Cgr-qc%2F0006098%2Cgr-qc%2F0006058%2Cgr-qc%2F0006078%2Cgr-qc%2F0006050%2Cgr-qc%2F0006020%2Cgr-qc%2F0006065%2Cgr-qc%2F0006032%2Cgr-qc%2F0006015%2Cgr-qc%2F0006034%2Cgr-qc%2F0006088%2Cgr-qc%2F0006076%2Cgr-qc%2F0006011%2Cgr-qc%2F0006002%2Cgr-qc%2F0006003%2Cgr-qc%2F0006008%2Cgr-qc%2F0006067%2Cgr-qc%2F0006044%2Cgr-qc%2F0006108%2Cgr-qc%2F0006057%2Cgr-qc%2F0006006%2Cgr-qc%2F0006105%2Cgr-qc%2F0006014%2Cgr-qc%2F0006104%2Cgr-qc%2F0006039%2Cgr-qc%2F0006027%2Cgr-qc%2F0006094%2Cgr-qc%2F0006066%2Cgr-qc%2F0006013%2Cgr-qc%2F0006030%2Cgr-qc%2F0006074%2Cgr-qc%2F0006042%2Cgr-qc%2F0006097%2Cgr-qc%2F0006037%2Cgr-qc%2F0006055%2Cgr-qc%2F0006080%2Cgr-qc%2F0006046%2Cgr-qc%2F0006077%2Cgr-qc%2F0006026%2Cgr-qc%2F0006092%2Cgr-qc%2F0006017%2Cgr-qc%2F0006049%2Cgr-qc%2F0006007%2Cgr-qc%2F0006052%2Cgr-qc%2F0006069%2Cgr-qc%2F0006041%2Cgr-qc%2F0006079%2Cgr-qc%2F0006059%2Cgr-qc%2F0006064%2Cgr-qc%2F0006100%2Cgr-qc%2F0006106%2Cgr-qc%2F0006036%2Cgr-qc%2F0006089%2Cgr-qc%2F0006018%2Cgr-qc%2F0006087%2Cgr-qc%2F0006019%2Cgr-qc%2F0006051%2Cgr-qc%2F0006022%2Cgr-qc%2F0006071%2Cgr-qc%2F0006102%2Cgr-qc%2F0006082%2Cgr-qc%2F0006096%2Cgr-qc%2F0006009%2Cgr-qc%2F0006031%2Cgr-qc%2F0006053%2Cgr-qc%2F0006109%2Cgr-qc%2F0006107%2Cgr-qc%2F0006024%2Cgr-qc%2F0006016%2Cgr-qc%2F0006054%2Cgr-qc%2F0006033%2Cgr-qc%2F0006038%2Cgr-qc%2F0006093%2Cgr-qc%2F0006068%2Cgr-qc%2F0006048%2Cgr-qc%2F0006023%2Cgr-qc%2F0006004%2Cgr-qc%2F0006091%2Cgr-qc%2F0006070%2Cgr-qc%2F0006103%2Cgr-qc%2F0006061%2Cgr-qc%2F0006047%2Cgr-qc%2F0006101%2Cgr-qc%2F0006062%2Cgr-qc%2F0611042%2Cgr-qc%2F0611120%2Cgr-qc%2F0611101%2Cgr-qc%2F0611090%2Cgr-qc%2F0611048%2Cgr-qc%2F0611147%2Cgr-qc%2F0611044&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Localization of gravitational field energy and a procedure proposed for\n  its experimental verification"}, "summary": "Introduction of Vaidya metrics into the Expansive Nondecelerative Universe\nmodel allows to localize the energy of gravitational field. On the assumption\nthat there is an interaction of long-range gravitational and electromagnetic\nfields, the localization might be verified experimentally. In this contribution\nsome details on such an experiment are given.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0006028%2Cgr-qc%2F0006083%2Cgr-qc%2F0006063%2Cgr-qc%2F0006085%2Cgr-qc%2F0006010%2Cgr-qc%2F0006084%2Cgr-qc%2F0006025%2Cgr-qc%2F0006086%2Cgr-qc%2F0006043%2Cgr-qc%2F0006073%2Cgr-qc%2F0006081%2Cgr-qc%2F0006098%2Cgr-qc%2F0006058%2Cgr-qc%2F0006078%2Cgr-qc%2F0006050%2Cgr-qc%2F0006020%2Cgr-qc%2F0006065%2Cgr-qc%2F0006032%2Cgr-qc%2F0006015%2Cgr-qc%2F0006034%2Cgr-qc%2F0006088%2Cgr-qc%2F0006076%2Cgr-qc%2F0006011%2Cgr-qc%2F0006002%2Cgr-qc%2F0006003%2Cgr-qc%2F0006008%2Cgr-qc%2F0006067%2Cgr-qc%2F0006044%2Cgr-qc%2F0006108%2Cgr-qc%2F0006057%2Cgr-qc%2F0006006%2Cgr-qc%2F0006105%2Cgr-qc%2F0006014%2Cgr-qc%2F0006104%2Cgr-qc%2F0006039%2Cgr-qc%2F0006027%2Cgr-qc%2F0006094%2Cgr-qc%2F0006066%2Cgr-qc%2F0006013%2Cgr-qc%2F0006030%2Cgr-qc%2F0006074%2Cgr-qc%2F0006042%2Cgr-qc%2F0006097%2Cgr-qc%2F0006037%2Cgr-qc%2F0006055%2Cgr-qc%2F0006080%2Cgr-qc%2F0006046%2Cgr-qc%2F0006077%2Cgr-qc%2F0006026%2Cgr-qc%2F0006092%2Cgr-qc%2F0006017%2Cgr-qc%2F0006049%2Cgr-qc%2F0006007%2Cgr-qc%2F0006052%2Cgr-qc%2F0006069%2Cgr-qc%2F0006041%2Cgr-qc%2F0006079%2Cgr-qc%2F0006059%2Cgr-qc%2F0006064%2Cgr-qc%2F0006100%2Cgr-qc%2F0006106%2Cgr-qc%2F0006036%2Cgr-qc%2F0006089%2Cgr-qc%2F0006018%2Cgr-qc%2F0006087%2Cgr-qc%2F0006019%2Cgr-qc%2F0006051%2Cgr-qc%2F0006022%2Cgr-qc%2F0006071%2Cgr-qc%2F0006102%2Cgr-qc%2F0006082%2Cgr-qc%2F0006096%2Cgr-qc%2F0006009%2Cgr-qc%2F0006031%2Cgr-qc%2F0006053%2Cgr-qc%2F0006109%2Cgr-qc%2F0006107%2Cgr-qc%2F0006024%2Cgr-qc%2F0006016%2Cgr-qc%2F0006054%2Cgr-qc%2F0006033%2Cgr-qc%2F0006038%2Cgr-qc%2F0006093%2Cgr-qc%2F0006068%2Cgr-qc%2F0006048%2Cgr-qc%2F0006023%2Cgr-qc%2F0006004%2Cgr-qc%2F0006091%2Cgr-qc%2F0006070%2Cgr-qc%2F0006103%2Cgr-qc%2F0006061%2Cgr-qc%2F0006047%2Cgr-qc%2F0006101%2Cgr-qc%2F0006062%2Cgr-qc%2F0611042%2Cgr-qc%2F0611120%2Cgr-qc%2F0611101%2Cgr-qc%2F0611090%2Cgr-qc%2F0611048%2Cgr-qc%2F0611147%2Cgr-qc%2F0611044&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Introduction of Vaidya metrics into the Expansive Nondecelerative Universe\nmodel allows to localize the energy of gravitational field. On the assumption\nthat there is an interaction of long-range gravitational and electromagnetic\nfields, the localization might be verified experimentally. In this contribution\nsome details on such an experiment are given."}, "authors": ["Miroslav Sukenik", "Jozef Sima", "Julius Vanko"], "author_detail": {"name": "Julius Vanko"}, "author": "Julius Vanko", "arxiv_comment": "7 pages, LaTeX", "links": [{"href": "http://arxiv.org/abs/gr-qc/0006068v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0006068v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0006068v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0006068v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:gr-qc/0006068v1 20 Jun 2000\n\nLocalization of gravitational field energy and a procedure proposed\nfor its experimental verification\nMiroslav Sukenika , Jozef Simaa and Julius Vankob\na\nSlovak Technical University, Dep. Inorg. Chem., Radlinskeho 9, 812 37\nBratislava, b Comenius University, Dep. Nucl. Physics, Mlynska dolina F1,\n842 48 Bratislava, Slovakia\ne-mail: sima@chtf.stuba.sk; vanko@fmph.uniba.sk\nAbstract\nIntroduction of Vaidya metrics into the Expansive Nondecelerative Universe\nmodel allows to localize the energy of gravitational field. On the assumption that\nthere is an interaction of long-range gravitational and electromagnetic fields, the\nlocalization might be verified experimentally. In this contribution some details\non such an experiment are given.\nIntroduction\nThe law of universal gravitation was formulated by I. Newton in 1666. 250\nyears later A. Einstein showed that his equations describing gravitation had\nwavelike solutions, similar to the wavelike solutions of Maxwell's equations.\nJust as a time-varying charge distribution excites electromagnetic waves, so\na time-varying mass distribution will excite gravitational waves. Yet, scientific community is still waiting for a direct detection of gravitational waves.\nMoreover, contrary to the other fundamental forces, there is neither comprehensive theory allowing to quantify, localize and measure the gravitational field\nnor any experimental evidence on the above mentioned characteristics of the\ngravitational field. One of the main sources of this marking time lies in the\nSchwarzschild metrics that has been generally accepted in elaborated models of\nthe Universe and gravitation. Usage of this metrics in models of the Universe\nhas led to a conclusion on the impossibility to localize the gravitational field\noutside a body. The model of Expansive Nondecelerative Universe (ENU) is\nvirtually one of the first, if not the only, which is fully consistent with the laws\nof nature (the requirement which must be satisfied by any acceptable model), its\npredictions and conclusions are in accordance with experimental observations\nand, thanks to the introduction of Vaidya metrics into its mathematical tools,\nit provides, contrary to other models, a mode of localization and quantification\nof the gravitational energy.\nWithin the research focused on unification of all four fundamental forces\nseveral important theoretical results have emerged, no experimental data on\na mutual interaction and/or interference of any of them with gravitation are,\nhowever, known. One of the principal obstacles lies in substantially different\nrange of the forces. From this viewpoint only the gravitational and electromagnetic forces are similar since the both are far-reaching and their intensity\nvaries inversely with the square of the distance between two bodies (masses or\n\n1\n\n\fcharges). These similarities have led us to considerations on the theoretical and\nexperimental treatment of possibilities to verify the existence of interference of\nthese forces. In this contribution theoretical background of the verification is\ngiven.\nTheoretical Background\nThe density of gravitational field in the domain of weak fields is described\nby Tolman's equation\nR.c4\nǫg = − 8π.G\n(1)\nwhere R is the scalar curvature. In Schwarzschild metrics\nR=0\n(2)\nthat is interpreted as an impossibility to localize the gravitational energy\noutside a body. In the Expansive Nondecelerative Universe model (further ENU)\n[1 - 3] the gauge factor a is expressed as\nu\n(3)\na = c.tc = 2G.M\nc2\nwhere MU is the mass of the Universe and tc is the cosmologic time and at\npresent\na∼\n(4)\n= 1026 m\n(5)\ntc ∼\n= 4.5 × 1017 s\nIt follows from eq. (3) that in ENU the matter creation occours. The total\nenergy of the Universe must, however, be exactly zero [4]. It is achieved by a\nsimultaneous gravitational field creation, the energy of which is E < 0. Such a\nUniverse may, therefore, permanently expands with the velocity of light c and\nthe fundamental conservation laws are still observed.\nDue to the matter creation, Schwarzschild metrics may not be used and\nshould be replaced by another kind of metrics allowing to take the matter creation phenomenon into account. Such a property exhibits Vaidya metrics [5].\nSince it holds in ENU [2, 3]\nmo\ndm\n(6)\ndt = tc\nwhere mo is the rest mass of a body, using Vaidya metrics and eq. (6),\nrelation (7) defining the scalar curvature is obtained\n3Rg(m)\nR = a.r\n(7)\n2\nin which Rg(m) is the gravitational radius of a body with the mass m. It\nfollows [1] from (1) and (7) that\n3mc2\nǫg = − 4πar\n(8)\n2\nwhere ǫg is the density of gravitational field energy emitted by a body with\nthe mass m in the distance r. Relation (8) can be rewritten as\n3E\nǫg = 4π.λg3\n(9)\nwhere Eg is the energy of a gravitational quantum and λ is its Compton\nwavelength\nh.c\n(10)\nλ = 2π.E\ng\nSubstituting in (9) for (10) and comparing the result with (8), the expression\nfor an energy quantum Eg is obtained [1]:\n2\n\n\f\u00111/4\n\u0010\n3 5\n.c\n(11)\n| Eg | = m.h\n3\n2\n8π a.r\nwhere Eg is the quantum of gravitational energy created by a body with the\nmass m in the distance r. Relation (11) is in conformity with the limiting values:\nthe maximum energy is represented by the Planck energy, the minimum energy\nequals the energy of a photon with the wavelength identical to the Universe\ndimension (a =λ ) .\nGravitational output Pg , defined as the amount of gravitational energy\nemitted by a body with the mass m in a time unit is given as (12)\nR\n3\nm.c2\nd\n(12)\nǫg dV = − m.c\nPg = dt\na = − tc\nExperimental verification\nBoth the gravitational and electromagnetic forces are of long-range nature\nand their intensity decreases with the square of distance. Supposing an interaction of the fields and stemming from the localization of the gravitational field\nenergy, an experiment may be proposed in which the interference of the fields\nmight lead to a change in the mass of the tested body acting as an emitter. To\nperform the experiment, the following requirements must be satisfied.\n(a) A body - emitter with the mass me should emit photons with the energy\nEph identical to the energy of Earth gravitational field quanta Eg,Ea . Taking\nthe known mass mEa of the Earth (5.97 x 1024 kg), its mean radius rEa (6.37\nx 106 m) and the values of the other members in (11) into account, it follows\n\u0010\n\u00111/4\n.h3 .c5\n∼\nEg,Ea = m8πEa3 a.r\n(13)\n= 1.49eV\n2\nEa\nthat corresponds to the wavelength\nλ∼\n(14)\n= 834nm\n(this is a wavelength from the near-infrared region used in telecommunications). One of the conditions, therefore, is that the emitter should emit photons\nof the wavelength 834 nm. Such photons might interfere with quanta of the\ngravitational field of the Earth.\n(b) Relation (12) states that the electromagnetic output of the emitter Pe is\nto be\n2\n(15)\nPe = metc.c\nRelations (14) and (15) represent the conditions of equality of the electromagnetic and gravitational output of the emitter. If, in principle, may exist an\ninterference of the electromagnetic and gravitational fields of the emitter and\nthe Earth, such an interference might happen and be observed.\n(c) Since electronic transitions associated to excited state formation and\nradiation deactivation are accompanied by vibrational-rotational (i.e. thermal)\nrelaxation, and the radiation output of the emitter is usually influenced by its\ntemperature, within the proposed experiment it will be necessary to maintain\nconstant temperature.\n(d) After the required energy and output of the emitter Pe are reached,\nthe emitter should be weighted at different directions of the emission. The\n3\n\n\finterference should manifest itself as a change in the emitter weight that, given\na balance with a sufficient sensitivity is used, should be registered.\n(e) There can be a necessity to adjust the wavelength and energy output\nvalues (the accuracy of their values depends on the accuracy of all parameters\nin used relations).\n(f) Providing the radiation is not monochromatic (a common case) the output of that with 834 nm (or that of adjusted wavelength) must correspond to\nthat required by relation (15).\n(g) The mass me of the emitter is its own mass not including peripheral\nparts.\nConclusions\n1. The proposed experimental verification of interference of the gravitational\nand electromagnetic fields may lead to successful results providing three conditions are fulfiled: the ENU model describes the Universe in a correct way; there\nis in principle a possibility of the interference; conditions stated in paragraphs\n(a) to (g) are met.\n2. Any changes in the mass of an emitter caused by the discussed interference\nwould be of far-reaching scientific and technological importance.\n3. The present contribution deals only with the theoretical aspects of the\nexperiment, its realization requires solutions of many practical tasks.\nReferences\n1.J. Sima, M. Sukenik, Preprint: qr-qc/9903090\n2. V. Skalsky, M. Sukenik, Astrophys. Space Sci., 178 (1991) 169\n3. V. Skalsky, M. Sukenik, Astrophys. Space Sci., 181 (1991) 153\n4. S. W. Hawking, A Brief History of Time, From the Big Bang to Black\nHoles, Bantam Books, New York, 1988, p. 129\n5. P.C. Vaidya: Proc. Indian Acad. Sci., A33 (1951) 264\n\n4\n\n\f"}