{"id": "http://arxiv.org/abs/gr-qc/0510084v2", "guidislink": true, "updated": "2014-08-17T00:21:03Z", "updated_parsed": [2014, 8, 17, 0, 21, 3, 6, 229, 0], "published": "2005-10-18T21:47:50Z", "published_parsed": [2005, 10, 18, 21, 47, 50, 1, 291, 0], "title": "General Relativistic Theory of Light Propagation in the Field of\n  Radiative Gravitational Multipoles", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0510062%2Cgr-qc%2F0510091%2Cgr-qc%2F0510109%2Cgr-qc%2F0510073%2Cgr-qc%2F0510008%2Cgr-qc%2F0510019%2Cgr-qc%2F0510057%2Cgr-qc%2F0510084%2Cgr-qc%2F0510100%2Cgr-qc%2F0510120%2Cgr-qc%2F0510050%2Cgr-qc%2F0510108%2Cgr-qc%2F0510005%2Cgr-qc%2F0510009%2Cgr-qc%2F0510127%2Cgr-qc%2F0510105%2Cgr-qc%2F0510034%2Cgr-qc%2F0510078%2Cgr-qc%2F0510033%2Cgr-qc%2F0510049%2Cgr-qc%2F0510101%2Cgr-qc%2F0510056%2Cgr-qc%2F0510076%2Cgr-qc%2F0510055%2Cgr-qc%2F0510106%2Cgr-qc%2F0510110%2Cgr-qc%2F0510054%2Cgr-qc%2F0510043%2Cgr-qc%2F0510126%2Cgr-qc%2F0510029%2Cgr-qc%2F0510129%2Cgr-qc%2F0510012%2Cgr-qc%2F0510114%2Cgr-qc%2F0510013%2Cgr-qc%2F0510072%2Cgr-qc%2F0510042%2Cgr-qc%2F0510090%2Cgr-qc%2F0510039%2Cgr-qc%2F0510096%2Cgr-qc%2F0510022%2Cgr-qc%2F0510130%2Cgr-qc%2F0510031%2Cgr-qc%2F0510121%2Cgr-qc%2F0510036%2Cgr-qc%2F0510065%2Cgr-qc%2F0510099%2Cgr-qc%2F0510015%2Cgr-qc%2F0510035%2Cgr-qc%2F0510104%2Cgr-qc%2F0510079%2Cgr-qc%2F0510003%2Cgr-qc%2F0510046%2Cgr-qc%2F0510071%2Cgr-qc%2F0510018%2Cgr-qc%2F0510068%2Cgr-qc%2F0510030%2Cgr-qc%2F0510086%2Cgr-qc%2F0510080%2Cgr-qc%2F0510060%2Cgr-qc%2F0510117%2Cgr-qc%2F0510059%2Cgr-qc%2F0510001%2Cgr-qc%2F0510002%2Cgr-qc%2F0510011%2Cgr-qc%2F0510023%2Cgr-qc%2F0510119%2Cgr-qc%2F0510032%2Cgr-qc%2F0510025%2Cgr-qc%2F0510074%2Cgr-qc%2F0510028%2Cgr-qc%2F0510095%2Cgr-qc%2F0510118%2Cgr-qc%2F0510026%2Cgr-qc%2F0510053%2Cgr-qc%2F0510010%2Cgr-qc%2F0510066%2Cgr-qc%2F0510116%2Cgr-qc%2F0510004%2Cgr-qc%2F0510017%2Cgr-qc%2F0510089%2Cgr-qc%2F0510103%2Cgr-qc%2F0510064%2Cgr-qc%2F0510087%2Cgr-qc%2F0510014%2Cgr-qc%2F0510027%2Cgr-qc%2F0510093%2Cgr-qc%2F0510047%2Cgr-qc%2F0510094%2Cgr-qc%2F0510077%2Cgr-qc%2F0510070%2Cgr-qc%2F0510112%2Cgr-qc%2F0510098%2Cgr-qc%2F0510045%2Cgr-qc%2F0510075%2Cgr-qc%2F0510107%2Cgr-qc%2F0510007%2Cgr-qc%2F0510092%2Cgr-qc%2F0510067%2Cgr-qc%2F0310126%2Cgr-qc%2F0310064%2Cgr-qc%2F0310040&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "General Relativistic Theory of Light Propagation in the Field of\n  Radiative Gravitational Multipoles"}, "summary": "The extremely high precision of current astronomical observations demands a\nmuch better theoretical treatment of relativistic effects in the propagation of\nelectromagnetic signals through variable gravitational fields of isolated\nastronomical systems emitting gravitational waves. This paper presents a\nconsistent approach giving a complete and exhaustive solution of this problem\nin the first post-Minkowskian approximation of general relativity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0510062%2Cgr-qc%2F0510091%2Cgr-qc%2F0510109%2Cgr-qc%2F0510073%2Cgr-qc%2F0510008%2Cgr-qc%2F0510019%2Cgr-qc%2F0510057%2Cgr-qc%2F0510084%2Cgr-qc%2F0510100%2Cgr-qc%2F0510120%2Cgr-qc%2F0510050%2Cgr-qc%2F0510108%2Cgr-qc%2F0510005%2Cgr-qc%2F0510009%2Cgr-qc%2F0510127%2Cgr-qc%2F0510105%2Cgr-qc%2F0510034%2Cgr-qc%2F0510078%2Cgr-qc%2F0510033%2Cgr-qc%2F0510049%2Cgr-qc%2F0510101%2Cgr-qc%2F0510056%2Cgr-qc%2F0510076%2Cgr-qc%2F0510055%2Cgr-qc%2F0510106%2Cgr-qc%2F0510110%2Cgr-qc%2F0510054%2Cgr-qc%2F0510043%2Cgr-qc%2F0510126%2Cgr-qc%2F0510029%2Cgr-qc%2F0510129%2Cgr-qc%2F0510012%2Cgr-qc%2F0510114%2Cgr-qc%2F0510013%2Cgr-qc%2F0510072%2Cgr-qc%2F0510042%2Cgr-qc%2F0510090%2Cgr-qc%2F0510039%2Cgr-qc%2F0510096%2Cgr-qc%2F0510022%2Cgr-qc%2F0510130%2Cgr-qc%2F0510031%2Cgr-qc%2F0510121%2Cgr-qc%2F0510036%2Cgr-qc%2F0510065%2Cgr-qc%2F0510099%2Cgr-qc%2F0510015%2Cgr-qc%2F0510035%2Cgr-qc%2F0510104%2Cgr-qc%2F0510079%2Cgr-qc%2F0510003%2Cgr-qc%2F0510046%2Cgr-qc%2F0510071%2Cgr-qc%2F0510018%2Cgr-qc%2F0510068%2Cgr-qc%2F0510030%2Cgr-qc%2F0510086%2Cgr-qc%2F0510080%2Cgr-qc%2F0510060%2Cgr-qc%2F0510117%2Cgr-qc%2F0510059%2Cgr-qc%2F0510001%2Cgr-qc%2F0510002%2Cgr-qc%2F0510011%2Cgr-qc%2F0510023%2Cgr-qc%2F0510119%2Cgr-qc%2F0510032%2Cgr-qc%2F0510025%2Cgr-qc%2F0510074%2Cgr-qc%2F0510028%2Cgr-qc%2F0510095%2Cgr-qc%2F0510118%2Cgr-qc%2F0510026%2Cgr-qc%2F0510053%2Cgr-qc%2F0510010%2Cgr-qc%2F0510066%2Cgr-qc%2F0510116%2Cgr-qc%2F0510004%2Cgr-qc%2F0510017%2Cgr-qc%2F0510089%2Cgr-qc%2F0510103%2Cgr-qc%2F0510064%2Cgr-qc%2F0510087%2Cgr-qc%2F0510014%2Cgr-qc%2F0510027%2Cgr-qc%2F0510093%2Cgr-qc%2F0510047%2Cgr-qc%2F0510094%2Cgr-qc%2F0510077%2Cgr-qc%2F0510070%2Cgr-qc%2F0510112%2Cgr-qc%2F0510098%2Cgr-qc%2F0510045%2Cgr-qc%2F0510075%2Cgr-qc%2F0510107%2Cgr-qc%2F0510007%2Cgr-qc%2F0510092%2Cgr-qc%2F0510067%2Cgr-qc%2F0310126%2Cgr-qc%2F0310064%2Cgr-qc%2F0310040&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The extremely high precision of current astronomical observations demands a\nmuch better theoretical treatment of relativistic effects in the propagation of\nelectromagnetic signals through variable gravitational fields of isolated\nastronomical systems emitting gravitational waves. This paper presents a\nconsistent approach giving a complete and exhaustive solution of this problem\nin the first post-Minkowskian approximation of general relativity."}, "authors": ["Sergei Kopeikin", "Pavel Korobkov"], "author_detail": {"name": "Pavel Korobkov"}, "author": "Pavel Korobkov", "arxiv_comment": "58 pages, 4 figures. Published in: \"Frontiers in Relativistic\n  Celestial Mechanics\", Vol. 1, De Gruyter: Berlin, 2014, 401 pp. ISBN:\n  978-3-11-033749-5", "links": [{"href": "http://arxiv.org/abs/gr-qc/0510084v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0510084v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0510084v2", "affiliation": "Solovetsky Monastery, Russia", "arxiv_url": "http://arxiv.org/abs/gr-qc/0510084v2", "journal_reference": null, "doi": null, "fulltext": "General Relativistic Theory of Light Propagation in Multipolar Gravitational Fields\nPavel Korobkov\nSolovetsky Monastery, Arkhangelsk Region 164070, Russia\n\nSergei M. Kopeikin∗\nDepartment of Physics & Astronomy, University of Missouri, 322 Physics Bldg., Columbia, Missouri 65211, USA\n(Dated: August 19, 2014)\n\narXiv:gr-qc/0510084v2 17 Aug 2014\n\nI.\nA.\n\nINTRODUCTION\n\nStatement of the problem\n\nDirect experimental detection of gravitational waves is a fascinating but yet unsolved problem of modern fundamental physics\nEnormous efforts have been undertaken to make progress in its solution both by theorists and experimentalists [7–11]. The\nmain theoretical efforts are presently focused on calculation of templates of the gravitational waves emitted by coalescing binary\nsystems comprised of neutron stars and/or black holes [12–17] as well as creation of improved filtering technique for gravitational\nwave detectors [18, 19] which will enable the extraction of the gravitational wave signal from all kind of interferences present\nin the noisy data collected by the gravitational wave observatories . Direct experimental efforts have led to the construction of\nseveral ground-based optical interferometers with the length of arms reaching a few miles [20–24]. Certain work is under way\nto build super-sensitive cryogenic-bar gravitational-wave detectors of Weber's type [25–28]. Spaceborne laser interferometric\ndetectors like LISA [29], NGO [30] or ASTROD [31, 32] may significantly increase the sensitivity of the gravitational-wave\ndetectors and revolutionize the field of gravitational physics.\nThere is no doubt, the detection of gravitational waves by the specialized gravitational wave antennas would provide the\nmost direct evidence of the existence of these elusive ripples in the fabric of spacetime. On the other hand, there exist a\nnumber of astronomical phenomena which might be used for an indirect detection of gravitational waves and understanding\ngravitational physics of astrophysical systems emitting gravitational waves. It is worth emphasizing that the present-day groundbased gravitational wave detectors are sensitive to a rather narrow band of the gravitational wave spectrum ranging between\n1000÷1 Hz [33, 34]. Spaceborne gravitational wave detectors may bring the sensitivity band down to 1 mHz [30, 32]. In order\nto explore the ultra-long gravitational wave phenomena much below 1 mHz we have to rely upon other astronomical techniques\nfor example, pulsar timing [35, 36] or radiometry of polarization of cosmic microwave background radiation [37, 38]. The short\ngravitational waves can be generated by coalescing binary systems of compact astrophysical objects like neutron stars and/or\nblack holes [39–42]. The ultra-long gravitational waves can be generated by localized gravitational sources and/or topological\ndefects in the early universe [43–47].\nAstronomical observations are conducted with electromagnetic waves (photons) of different frequencies over the spectrum\nspreading from very long radio waves to gamma rays. Therefore, in order to detect the effects of the gravitational waves\nby astronomical technique one has to solve the problem of propagation of electromagnetic waves through the field generated\nby a localized gravitationally-bounded distribution of masses which motion is determined by general relativity. Notice that\ngravitational wave detectors are optical interferometers making use of light propagation. Therefore, correct understanding\nof the process of physical interaction of the laser beam of the interferometer with incoming gravitational waves is important\nfor their unambiguous recognition and detection. Equations of propagation of electromagnetic signals must be derived in the\nframework of the same theory of gravity in order to keep description of gravitational and electromagnetic phenomena on the\nsame theoretical ground. We draw attention of the reader that the parametrized post-Newtonian (PPN) formalism [48] does not\ncomply with this requirement. The PPN formalism is constructed on the ground of plausible physical hypothesis and assumptions\nabout alternatives to general relativity but it does not demand their overall conformity. Therefore, straightforward application\nof PPN formalism to discuss gravitational physics may eventually lead to incorrect results. As an example, we point out that\nPPN formalism does not produce the consistent post-Newtonian equations of motion of extended bodies even in a simplified\ncase of two PPN parameters, β and γ , when more subtle effects of body's gravitational multipoles are taken into account [49].\nPPN formalism applied to interpret gravitational light-ray deflection experiments by major planets of the solar system [50–52]\ncreated a notable \"speed-of-light versus speed-of-gravity\" controversy [53] which originates in the inability of PPN formalism\n\n∗ Electronic\n\naddress: kopeikins@missouri.edu; Corresponding author\n\n\f2\nto distinguish between physical effects of gravity and electromagnetism due to the non-covariant nature of PPN parametrization\nlimited merely by the metric manifolds [54, 55].\nIn the present chapter we rely upon the Einstein theory of general relativity and assume that light propagates in vacuum that\nis the interstellar medium has no impact on the speed of light propagation. General relativity is a geometrized theory of gravity\nand it assumes that both gravity and electromagnetic field propagate locally in vacuum with the same speed which is equal\nto the fundamental speed c in special theory of relativity [1]. Gravitational field is found as a solution of the Einstein field\nequations. The electromagnetic field is obtained by solving the Maxwell equations on the curved spacetime manifold derived at\nprevious step from Einstein's equations. In the approximation of geometric optics the electromagnetic signals propagate along\nnull geodesics of the metric tensor [1–3].\nThe problem of finding solutions of the null ray equations in curved spacetime attracted many researchers since the time\nof discovery of general relativity. Exact solutions of this problem were found in some, particularly simple cases of symmetric spacetimes like Schwarzschild's or Kerr's black hole, homogeneous and isotropic Friedman-Lemeı̂tre-Robertson-Walker\n(FLRW) cosmology, plane gravitational wave , etc. [1–3, 56]. For quite a long time these exact description of null geodesics was\nsufficient for the purposes of experimental gravitational physics. However, real physical spacetime has no symmetries and the\nsolution of such current problems as direct detection of gravitational waves, interpretation of an anisotropy and polarization of\ncosmic microwave background radiation (CMBR), exploration of inflationary models of the early universe, finding new experimental evidences in support of general relativity and quantum gravity, development of higher-precision relativistic algorithms\nfor space missions, and many others, can not fully rely upon the mathematical techniques developed mainly in the symmetric\nspacetimes. Especially important is to find out a method of integration of equations of light geodesics in spacetimes having\ntime-dependent gravitational perturbations of arbitrary multipole order.\nIn the present chapter we consider a case of an isolated astronomical system embedded to an asymptotically-flat spacetime.\nThis excludes Friedmann-Lemeı̂tre-Robertson-Walker spacetime which is not asymptotically-flat (see chapter ??). We assume\nthat gravitational field of this system is characterized by an infinite set of gravitational multipoles emitting gravitational waves.\nPrecise and coordinate-free mathematical definition of the asymptotic flatness is based on the concept of conformal infinity that\nwas worked out in a series of papers [57–62] and we recommend the textbook of R. Wald [3] for a concise but comprehensive\nmathematical introduction to this subject. The asymptotic flatness implies the existence of a comformal compactification of\nthe manifold but it may not exist for a particular case of an astrophysical system. There is also coordinate-free definition of\ngravitational multipoles of an isolated system given by Hansen [63]. However, they make sense only in stationary spacetimes\nbut are not applicable for time-dependent gravitational fields which make them useless for practical analysis of real astronomical\nobservations and for interpretation of relativistic effects in propagation of electromagnetic signals. We use neither Hansen's\nmultipoles in the present chapter nor the comformal compactification technique. Moreover, because observable effects of gravitational waves are weak we shall consider only linear effects of gravitational multipoles so that relativistic effects produced by\nnon-linearity of the gravitational field will be ignored. The linearized approximation of general theory of relativity represents a\nstraightforward and practically useful approach to description of the multipole structure of the gravitational field of a localized\nastronomical system. The multipolar gravitational formalism was developed by several scientists, most notably by Kip Thorne\n[5] and Blanchet & Damour [64–68], and we use their results in the present chapter.\nExact formulation of the problem under discussion in this chapter is as follows (see Fig 1). We assume (in a less restrictive\nsense than the comformal compactification technique does) that spacetime under consideration is asymptotically flat and covered\nglobally by a single coordinate chart, xα = (ct, x), where t is coordinate time and x are spatial coordinates. An electromagnetic\nwave (photon) is emitted by a source of light at time t0 at point x0 towards an observer which receives the photon at the instant\nof time t and at the point x. Photon propagates through the time-dependent gravitational field of the isolated astronomical\nsystem emitting gravitational waves. The structure of the gravitational field is described by a set of Blanchet-Damour multipole\nmoments of the system which are functions of the retarded time t − r/c, where r is the distance from the isolated system to the\nfield point and c is the fundamental speed. The retardation is physically due to the finite speed of gravity which coincides in\ngeneral relativity with the speed of light in vacuum. Some confusion may arise in the interpretation of the observational effects\nbecause both gravity and light propagates in general relativity with the same speed. The discrimination between various effects\nis still possible because gravity and light propagate to observer from different sources and along different spatial directions\n(characteristics of the null cone in spacetime) [54].\nOur task is to find out the relations connecting various physical parameters (direction of propagation, frequency, polarization,\nintensity, etc.) of the electromagnetic signal at the point of emission with those measured by the observer. Gravitational field\naffects propagation of the electromagnetic signal and changes its parameters along the light ray. Observing these changes\nallow us to study various properties of the gravitational field of the astronomical system and to detect gravitational waves with\nastronomical technique. The rest of the chapter is devoted to the mathematical solution of this problem.\n\n\f3\n\nI\n\n+\n\nJ+\n\n(t,x)\n\nJ+\n\nR\n\nI\n\n0\n\nI\n\n0\n\n(t0 ,x0 )\n\nQ\n\nk\n\nJ\n\n−\n\nJ\nk\n\n−\n\nP\n\nI\n\n−\n\nFIG. 1: The Penrose diagram shows a worldline of the isolated system (binary star) originating at past timelike infinity I − and ending at the\nfuture timelike infinity I + . Both light and gravity propagate along null geodesics going from the past null infinity J − to the future null infinity\nJ + . A particular light geodesic is emanating from the event (t0 , x0 ) and ending at the event (t, x). Extrapolation of this light geodesic to the\npast null infinity defines the null wave vector kα = (k0 , k) of the electromagnetic wave under consideration.\n\nB. Historical background\n\nPropagation of electromagnetic signals through stationary gravitational field is a rather well-known subject having been originally discussed in classic textbooks by [69, 70]. Presently, almost any standard textbook on relativity describes solution of\nthe null geodesic equations in the field of a spherically-symmetric and rotating body or black hole. This solution is practical\nsince it is used, for example, for interpretation of gravitational measurements and light-propagation experiments in the solar\nsystem [54]. Another application is gravitational lensing in our galaxy and in cosmology [71–73]. Continually growing accuracy of astronomical observations demands much better treatment of secondary effects in the propagation of light produced\nby the perturbations of the gravitational field associated with the higher-order gravitational multipoles of planets and Sun[74].\n\n\f4\nTime-dependent multipoles emit gravitational waves which perturb propagation of light with the characteristic period of the\ngravitational wave. Influence of these periodic perturbations on light propagation parameters is important for developing correct\nstrategy for understanding the principles of operation of gravitational wave detectors as well as for searching gravitational waves\nby astronomical techniques.\nAmong the most interesting sources of periodic gravitational waves with a well-predicted behaviour are binary systems comprised of two stars orbiting each other around a common barycenter (center of mass). Indirect evidence in support of existence of\ngravitational waves emitted by binary pulsars was given by Joe Taylor with collaborators [75, 76]. However, direct observation\nof gravitational waves remains a challenging problem for experimental gravitational physics. The expected spectrum of gravitational waves extends from ∼ 104 Hz to 10−18 Hz [33, 34]. Within that range, the spectrum of periodic waves from known binary\nsystems extends from about 10−3 Hz – the frequency of gravitational radiation from a contact white-dwarf binary [40], through\nthe 10−4 to 10−6 Hz – the range of radiation from the main-sequence binaries [41], to the 10−7 to 10−9 Hz – the frequencies\nemitted by binary supermassive black holes presumably lurking in active galactic nuclei (AGN) [42]. The dimensionless strain\nof these waves at the Earth, h, may be as great as 10−21 at the highest frequencies, and as great as 3 × 10−15 at the lowest\nfrequencies in the spectrum of gravitational waves [33, 34].\nSazhin [77] was the first who suggested the method of detection of gravitational waves emitted from a binary system by using\ntiming observations of a background pulsar, more distant than the binary lying on the line of sight which passes sufficiently\nclose in the sky to the binary. He had shown that the integrated time delay for the propagation of an electromagnetic pulse\nnear the binary is proportional to 1/d 2 where d is the impact parameter of the unperturbed trajectory of the signal. Similar idea\nwas independently proposed by Detweiler [78] who has focused on discussing an application of pulsar timing for detection of a\nstochastic cosmological background of gravitational waves. More recently, Sazhin & Saphonova [79] have made estimates of the\nprobability of observation of such an effect for pulsars in globular clusters and showed that the probability can be high, reaching\n97%. Sazhin-Detweiler idea is currently used in pulsar timing arrays to detect gravitational waves in nano-Hertz frequency band\n[80–82].\nWahlquist [83] proposed another approach to the detection of periodic gravitational waves based on Doppler tracking of\nspacecraft travelling in deep space. His approach is restricted by the plane gravitational wave approximation developed earlier\nby Estabrook & Wahlquist [84]. Tinto ([85], and references therein) made the most recent theoretical contribution in this\nresearch area. The Doppler tracking technique is used in deep space missions for detection of gravitational waves by seeking for\nthe characteristic triple signature in the continuously recorded phase of radio waves in the radio link between the ground station\nand spacecraft. The presence of this specific signature would indicate to the influence of the Doppler signal by a gravitational\nwave crossing the line of sight from the spacecraft to observer [86, 87].\nBraginsky et al. [88, 89] raised a question about a possibility of using Very-Long Baseline Interferometry (VLBI) as a detector\nof stochastic gravitational waves produced in the early universe. This idea had been also investigated by Kaiser & Jaffe [90] and,\nthe most prominently, by Pyne et al. [91] and Gwinn et al. [92] who showed that the overall effect in the time delay of VLBI\nsignal is proportional to the strain of the metric perturbation, h, caused by the plane gravitational wave. They also calculated\nthe pattern of proper motions of quasars over all the sky as an indicator of the presence of quadrupole and high-order harmonics\nof ultra-long gravitational wave and set an observational limit on the energy density of such gravitational waves present in the\nearly universe. Montanari [93] studied the perturbations of polarization of electromagnetic radiation propagating in the field of\na plane gravitational wave and found that the effects are exceedingly small, unlikely to be observable.\nFakir ([94, 95], and references therein) has suggested to use astrometry to detect the periodic variations in apparent angular\nseparations of appropriate light sources, caused by gravitational waves emitted by isolated sources of gravitational radiation.\nHe was not able to develop a self-consistent approach to tackle the problem with a necessary completeness and rigour. For this\nreason, his estimate of the effect of the deflection of light caused by gravitational wave perturbation, is too optimistic. Another\nattempt to work out a more consistent approach to the calculation of the light deflection angle by the radiation field of an arbitrary\nsource of gravitational waves has been undertaken by Durrer [96]. However, the calculations have been done only for the plane\nwave approximation. Nonetheless, the result obtained was extrapolated to the case of the localized source of gravitational waves\nwithout convincing justification. For this reason the magnitude of the periodic changes of the light deflection angle was largely\noverestimated. The same misinterpretation of the effect of gravitational waves from localized sources can be found in the paper\nby Labeyrie [97] who studied a photometric modulation of background sources of light (stars) by gravitational waves emitted\nby fast-orbiting binary stars. Because of the erroneous predictions, the expected detection of gravitational waves from VLBI\nobservations of a radio source GPS QSO 2022+171 undertaken by Pogrebenko et al. [98] was not based on firm theoretical\nground and did not lead to success.\nDamour & Esposito-Farèse [99] have studied the deflection of light and integrated time delay caused by the time-dependent\ngravitational field generated by a localized astrophysical source lying in the sky close to the line of sight to a background source\nof light. They worked in a quadrupole approximation and explicitly calculated the effects of the retarded gravitational field\nof the astrophysical source in its near, intermediate, and wave zones by making use of the Fourier-decomposition technique.\nContrary to the claims of Fakir [94, 95] and Durrer [96] and in agreement with Sazhin's [77] calculations, they found that the\ncontribution of the wave-zone and intermediate-zone fields to the deflection angle vanish exactly due to some remarkable mutual\ncancellations of different components of the gravitational field. The leading, total time-dependent deflection of light is created\n\n\f5\nonly by the quasi-static, near-zone quadrupolar part of the gravitational field.\nDamour and Esposito-Farese [99] analyzed propagation of light under a simplifying condition that the impact parameter\nof the light ray is small with respect to the distances from observer and the source of light to the isolated system. We have\nfound [6, 100] another way around to solve the problem of propagation of electromagnetic waves in the quadrupolar field of\nthe gravitational waves emitted by the system without making any assumptions on mutual disposition of observer, source of\nlight, and the system, thus, significantly improving and extending the result of paper [99]. At the same time the paper [100]\ndid not answer the question about the impact of the other, higher-order gravitational multipoles of the isolated system on the\nprocess of propagation of electromagnetic signals. This might be important if the effective gravitational wave emission of an\noctupole and/or higher-order multipoles is equal or even exceeds that of the quadrupole as it may be in case of, for example,\nhighly-asymmetric stellar collapse [101], nearly head-on collision of two stars, or break-up of a binary system caused by a recoil\nof two black holes [102].\nIn the present chapter we work out a systematic approach to the problem of propagation of light rays in the field of arbitrary\ngravitational multipole. While the most papers on light propagation consider both a light source and an observer as being located\nat infinity we do not need these assumptions. For this reason, our approach is generic and applicable for any mutual configuration\nof the source of light and observer with respect to the source of gravitational radiation. The integration technique which we use\nfor finding solution of the equations of propagation of light rays was worked out in series of our papers [6, 100, 103, 104].\nThe metric tensor and coordinate systems involved in our calculations are described in section II along with gauge conditions\nimposed on the metric tensor. The equations of propagation of electromagnetic waves in the geometric optics approximation\nare discussed in section III and the method of their integration is given in section IV. Exact solution of the equations of light\npropagation and the exact form of relativistic perturbations of the light trajectory and the coordinate speed of light are obtained\nin section V. Section VI is devoted to the derivation of the primary observable relativistic effects - the integrated time delay,\nthe deflection angle, the frequency shift, and the rotation of the plane of polarization of an electromagnetic wave. We discuss in\nsections VII and VIII two limiting cases of the most interesting relative configurations of the source of light, the observer, and\nthe source of gravitational waves – the gravitational-lens configuration (section VII) and the case of a plane gravitational wave\n(section VIII).\n\nC.\n\nNotations and Conventions\n\nWe consider a spacetime manifold which is asymptotically flat at infinity [115]. Metric tensor of the spacetime manifold is\ndenoted by gαβ and its perturbation\nhαβ = gαβ − ηαβ .\n\n(1)\n\nThe determinant of the metric tensor is negative, and is denoted as g = det[gαβ ]. A four-dimensional, fully antisymmetric\nLevi-Civita symbol εαβ γδ is defined in accordance with the convention ε0123 = +1.\nIn the present chapter we use a geometrodynamic system of units [2] such that the fundamental speed, c, and the universal\ngravitational constant, G, are equal to unity, that is c = G = 1. spacetime is assumed to be globally covered by a Cartesianlike coordinate system (xα ) ≡ (x0 , x1 , x2 , x3 ) ≡ (t, x, y, z) , where t and (x, y, z) are time and space coordinates respectively. This\ncoordinate system is reduced at infinity to the inertial Lorentz coordinates defined up to a global Lorentz-Poincare transformation\n[4]. Sometimes we shall use spherical coordinates (r, θ , φ ) related to (x, y, z) by a standard transformation\nx = r sin θ cos φ ,\n\ny = r sin θ sin φ ,\n\nz = r cos θ .\n\n(2)\n\nSpatial coordinates (xi ) ≡ (x, y, z) in some equations will be denoted with a boldface font, x ≡ (xi ).\nWe shall operate with various geometric objects which have tensor indices. We agree that Greek (spacetime) indices α , β , γ , . . .\nrange from 0 to 3, and Latin (space) indices a, b, c, . . . run from 1 to 3. If not specifically stated the opposite, the Greek indices are\nraised and lowered by means of the Minkowski metric ηαβ ≡ diag(−1, 1, 1, 1), for example, Aα = ε αβ Aβ , Bαβ = εα μ εβ ν Bμν ,\nand so on. The spatial indices are raised and lowered with the help of the Kronecker symbol (a unit matrix), δi j ≡ diag(1, 1, 1).\nRegarding this rule the following conventions for the Cartesian coordinates hold: xi = xi and x0 = −x0 .\nRepeated indices are summed over in accordance with Einstein's rule [2], for example,\nAαβ γ Bα μ ≡ A0β γ B0μ + A1β γ B1μ + A2β γ B2μ + A3β γ B3μ .\n\n(3)\n\nIn the linearized (with respect to G) approximation of general relativity used in the present chapter, there is no difference\nbetween spatial vectors and co-vectors nor between upper and lower space indices. Therefore, we do not distinguish between\nthe superscript and subscript spatial indeses. For example, for a dot (scalar) product of two space vectors we have\nAi Bi = Ai Bi ≡ A1 B1 + A2 B2 + A3 B3 .\n\n(4)\n\n\f6\nIn what follows, we shall commonly use the spatial multi-index notations for three-dimensional, Cartesian tensors [5] like this\nIAl ≡ Ia1 ...al .\n\n(5)\n\nA tensor product of l identical spatial vectors ki will be denoted as a three-dimensional tensor having l indices\nka1 ka2 . . . kal ≡ ka1 ...al .\n\n(6)\n\nFull symmetrization with respect to a group of spatial indices of a Cartesian tensor will be denoted with round brackets embracing\nthe indices\nQ(a1 ...al ) ≡\n\n1\nQσ (1)...σ (l) ,\nl! ∑\nσ\n\n(7)\n\nwhere σ is the set of all permutations of (1, 2, ..., l) which makes Qa1 ...al fully symmetric in a1 . . . al .\nIt is convenient to introduce a special notation for symmetric trace-free (STF) Cartesian tensors by making use of angular\nbrackets around STF indices. The explicit expression of the STF part of a tensor Qa1 ...al is [5, 64]\n[l/2]\n\n∑ alk δ(a1 a2 * * * δa2k−1a2k Sa2k+1...al )b1 b1 ...bk bk ,\n\nQ<a1 ...al > ≡\n\n(8)\n\nk=0\n\nwhere [l/2] is the integer part of the number l/2,\nSa1 ...al ≡ Q(a1 ...al ) ,\n\n(9)\n\nand the numerical coefficients\nalk =\n\nl!\n(2l − 2k − 1)!!\n(−1)k\n.\n(2k)!! (2l − 1)!! (l − 2k)!\n\n(10)\n\nWe also assume that for any integer l ≥ 0\nl! ≡ l(l − 1) . . . 2 * 1 ,\n\n0! ≡ 1 ,\n\n(11)\n\nand\nl!! ≡ l(l − 2)(l − 4) . . . (2 or1) ,\n\n0!! ≡ 1 .\n\n(12)\n\nOne has, for example,\n1\nT<ab> = T(ab) − δab Tcc ,\n3\n1\n1\n1\nT<abc> = T(abc) − δab T(c j j) − δbc T(a j j) − δac T(b j j) ,\n5\n5\n5\n\n(13)\n(14)\n\nand so on.\nCartesian tensors of the mass-type (mass) multipoles I<Al > and spin-type (spin) multipoles S<Al > entirely describing gravitational field outside of an isolated astronomical system are always STF objects that can be checked by inspection of the\ndefinition following from the multipolar decomposition of the metric tensor perturbation hαβ [5, 64]. For this reason, to avoid\nthe appearance of overcomplicated index notations we shall omit the angular brackets around the spatial indices of these (and\nonly these) Cartesian tensors, that is we adopt: IAl ≡ I<Al > and SAl ≡ S<Al > .\nWe shall also use transverse (T) and transverse-traceless (TT) Cartesian tensors in our calculations [2, 5, 64]. These objects\nare defined by making use of the operator of projection\nPjk ≡ δ jk − k jk ,\n\n(15)\n\nonto the plane orthogonal to a unit vector k j . This operator plays a role of a Kroneker symbol in the two dimensional space in\nthe sense that Pi j Pjk = Pik , and Pii = 2. Definitions of the transverse and transverse-traceless tensors is [5, 6]\nQTa1 ...al ≡ Pa1 b1 Pa2 b2 ...Pal bl Qb1 ...bl ,\n\n(16)\n\n[l/2]\n\nQTT\na1 ...al ≡\n\n∑ blk P(a1a2 * * * Pa2k−1a2k Wa2k+1 ...al )b1b1 ...bk bk ,\n\nk=0\n\n(17)\n\n\f7\nwhere again [l/2] is the integer part of l/2, Wa1 ...al ≡ QT(a1 ...a ) , and the numerical coefficients\nl\n\nblk =\n\n(−1)k l(l − k − 1)!!\n.\n4k\nk!(l − 2k)!\n\n(18)\n\nFor instance,\n1\nQTT\nab ≡ Pi(a Pb) j Qi j − Pab Pjk Q jk .\n2\n\n(19)\n\nWe shall also use the polynomial coefficients Cl (p1 , . . . , pn ) in some of our equations . They are defined by\nCl (p1 , . . . , pn ) ≡\n\nl!\n,\np1 ! . . . pn !\n\n(20)\n\nwhere l and pi are positive integers such that ∑ni=1 pi = l. We introduce a Heaviside step function , H(p − q), such that on the set\nof whole numbers\n(\n0, if p ≤ q ,\nH(p − q) =\n(21)\n1, if p > q .\nPartial derivatives of any differentiable function, f = f (t, x), are denoted as follows: f,0 = ∂ f /∂ t and f,i = ∂ f /∂ xi . In general,\ncomma standing after a function denotes a partial derivative with respect to a corresponding coordinate: f ,α ≡ ∂ f (x)/∂ xα . A\ndot above function denotes a total derivative of the function with respect to time\nf ̇ ≡ d f /dt = ∂ f /∂ t + ẋi ∂ f /∂ xi ,\n\n(22)\n\nwhere ẋi denotes velocity along the integral curve xi = xi (t) parametrized with coordinate time t. In this chapter the integral\ncurves are light rays, and the derivatives ẋi are taken along the light ray trajectory (xi ) = x(t). Sometimes the partial derivatives\nwith respect to space coordinate xi will be also denoted as ∂i ≡ ∂ /∂ xi , and the partial time derivative will be denoted as ∂t ≡ ∂ /∂ t.\nA covariant derivative with respect to the coordinate xα will be denoted as ∇α .\nWe shall introduce and distinguish notations for integrals taken with respect to time at a fixed spatial point, from those taken\nalong a light-ray trajectory. Specifically, the time integrals from a function F(t, x), where x is a fixed point in space, are denoted\nas\nF (−1) (t, x) ≡\n\nZt\n\nF(τ , x)d τ ,\n\n−∞\n\nF (−2) (t, x) ≡\n\nZt\n\nF (−1) (τ , x)d τ .\n\n(23)\n\n−∞\n\nThe time integrals from a function F(t, x) taken on a light ray suggest that the spatial coordinate x is a function of time x ≡ x(t),\ntaken along the light ray. These integrals are denoted as\nF [−1] (t, x) ≡\n\nZt\n\nF(τ , x(τ ))d τ ,\n\n−∞\n\nF [−2] (t, x) ≡\n\nZt\n\nF [−1] (τ , x(τ ))d τ ,\n\n(24)\n\n−∞\n\nwhere x ≡ x(t) in the right side of these definitions. The integrals in (23) represent functions of time, t, and spatial, x,\ncoordinates. The integrals in (24) are functions of time, t, only.\nPartial time derivative of the order p from a function F(t, x) is denoted by\nF (p) (t, x) =\n\n∂ p F(t, x)\n,\n∂t p\n\n(25)\n\nso that its action on the time integrals eliminates integration in the sense that\nF (p) (t, x) =\n\n∂ p+1 F (−1) (t, x) ∂ p+2 F (−2) (t, x)\n=\n.\n∂ t p+1\n∂ t p+2\n\n(26)\n\nTotal time derivative of the order p from a function F(t, x) is denoted by\nF [p] (t, x) =\n\nd p F(t, x)\n.\ndt p\n\n(27)\n\n\f8\nThe reader can easily confirm that\nd p+1 F [−1] (t, x) d p+2 F [−2] (t, x)\n=\n.\n(28)\ndt p+1\ndt p+2\nIn what follows, we shall denote spatial vectors by the bold italic letters, for instance, Ai ≡ A, ki ≡ k, etc. The Euclidean\ndot product between two spatial vectors, for example a and b, is denoted with a dot between them: ai bi = a * b. The Euclidean\nwedge (cross) product between two spatial vectors is denoted with a symbol ×, that is εi jk a j bk = (a × b)i . Other particular\nnotations will be introduced as soon as they appear in text.\nF [p] (t, x) =\n\nII.\n\nTHE METRIC TENSOR, GAUGES AND COORDINATES\nA. The canonical form of the metric tensor perturbation\n\nWe consider an isolated astronomical system emitting gravitational waves and assume that gravitational field is weak everywhere so that the metric tensor can be expanded in a Taylor series with respect to the powers of gravitational constant G which\nlabels the order of products of the metric tensor perturbations that are kept in the solution of the Einstein equations. We shall\nconsider only a linearised post-Minkowskian approximation of general relativity and discard all terms of the order of G2 and\nhigher. The metric tensor is a linear combination of the Minkowski metric, ηαβ , and a small perturbation hαβ\ngαβ = ηαβ + Ghαβ + O(G2 ) ,\ng\n\nαβ\n\n= ηαβ − Gh\n\nαβ\n\n(1)\n\n2\n\n+ O(G ) ,\n\n(2)\n\nwhere hαβ ≪ 1 and we use ηαβ to rise and lower indices so that, for example, hαβ = η α μ η β ν hμν . In many cases the origin of the\ncoordinates is placed to the center of mass of the astrophysical system. It eliminates the dipole component of the gravitational\nfield which is associated with a coordinate degree of freedom. In some cases, however, it is necessary to keep the dipole\ncomponent unrestricted in order to determine position of the center of mass of the system under consideration with respect to\nanother coordinate chart which is introduced independently for solving some other astronomical problems. This is important\nfor unambiguous interpretation of gravitational experiments done with astrometric instruments [54, 104]. Fact of the matter is\nthat the displacement of the center of mass of an astrophysical system from the origin of the coordinates induces translational\ndeformations of the higher-order multipole moments of the gravitational field which introduce a bias to the physical values of\nthe multipoles. Therefore, physical interpretation of the observed values of the multipoles requires identification of the dipole\nmoment and subtraction of the coordinate deformations caused by it. We shall discard the dipole component of the gravitational\nfield in our solution.\nThe most general expression for the linearised perturbation of the metric tensor outside of the astronomical system emitting\ngravitational radiation was derived by Blanchet and Damour [64] by solving Einstein's equations. The perturbation is given in\nterms of the symmetric and trace-free (STF) mass and spin multipole moments (similar formulas were derived by Thorne [5])\nand is described by the following expression\nhαβ = hcan.\nαβ + wα ,β + wβ ,α ,\n\n(3)\n\nwhere wα are, the so-called, gauge functions describing the freedom in the choice of coordinates covering the manifold. The\ncanonical perturbation, hcan.\nαβ , obeys the homogeneous wave equation in vacuum\n\u0003hcan.\nαβ = 0 ,\n\n(4)\n\nwhich solution is chosen as\n\u0014\n\u0015\n∞\n(−1)l IAl (t − r)\n2M\n+2∑\n,\nr\nr\n,Al\nl=2 l!\n\u0014\n\u0015\n∞\n2εipq S p (t − r)Nq\n(−1)l l εipq S pAl−1 (t − r)\ncan.\nh0i (t, x) = −\n−4∑\n+\nr2\nr\n,qAl−1\nl=2 (l + 1)!\n\"\n#\n∞\n(−1)l I ̇iAl−1 (t − r)\n,\n4∑\nr\nl=2 l!\n\nhcan.\n00 (t, x) =\n\n(5)\n(6)\n\n,Al−1\n\ncan.\ncan.\nhcan.\ni j (t, x) =δi j h00 (t, x) + qi j (t, x)\n∞\n\n\"\n\n(−1)l I ̈i jAl−2 (t − r)\nr\nl=2 l!\n\nqcan.\ni j (t, x) =4 ∑\n\n,\n#\n\n(7)\n(−1)l l ε pq(i S ̇j)pAl−2 (t − r)\nr\nl=2 (l + 1)!\n∞\n\n−8 ∑\n\n,Al−2\n\n\"\n\n#\n\n,qAl−2\n\n.\n\n(8)\n\n\f9\nHere M and Si are the total mass and spin (angular momentum) of the system, and IAl and SAl are two independent sets\nof mass-type and spin-type multipole moments, N i = xi /r is a unit vector directed from the origin of the coordinate system to\nthe field point. Because the origin of the coordinate system has been chosen at the center of mass, the expansions (5) – (8)\ndo not depend on the mass-type dipole moment, Ii , which is equal to zero by definition. We emphasize that in the linearised\napproximation the total mass M and spin Si of the astronomical system are constant while all other multipoles are functions of\ntime which temporal behaviour obeys the equations of motion derived from the law of conservation of the stress-energy tensor\nof the system [1, 2]. Gravitational waves emitted by the system reduce its energy, linear and angular momenta. This effect does\nnot appear in the linearised general relativity but in higher order approximations we would obtain where the mass, spin, and\nlinear momentum of the system must be considered as functions of time like any other multipole. Higher-order gravitational\nperturbations in the metric going beyond (5)–(8) are shown in a review paper by Blanchet [105]. They are not of concern in the\npresent chapter.\nThe canonical metric tensor (5)–(8) depends on the multipole moments IAl (t − r) and SAl (t − r) taken at the retarded instant\nof time. The retardation is explained by the finite speed of propagation of gravity (light propagation will be considered below).\nIn the near zone of the isolated system the retardation due to the propagation of gravity is small and all functions of time in the\nmetric tensor can be expanded in Taylor series around the present time t [5, 64]. This near-zone expansion of the metric tensor\nis called the post-Newtonian expansion leading to the post-Newtonian successive approximations [54]. The post-Newtonian\nexpansion can be smoothly matched to the solution of the linearized Einstein equations in the domain of space being occupied\nby matter of the isolated system. The matching allows us to express the multipole moments in terms of matter variables [65]\n\nσ ≡ T 00 + T kk ,\n\nσ i ≡ T 0i ,\n\n(9)\n\nwhere T αβ is the stress-energy tensor of matter bounded in space. In the first post-Newtonian approximation the multipole\nmoments have a matter-compact support [65]\n\u001a\n\u001b\nZ\n|x|2 x<Al > 2\n4(2l + 1)x<iAl >\n1PN\n3\nIAl\n=\nd x x<Al > σ +\n∂ σ−\n∂t σi + O(c−4 ) ,\n(10)\n2(2l + 3) t\n(l + 1)(2l + 3)\nV\nSA1PN\n=\nl\n\nZ\n\nV\n\nd 3 xε pq<al xAl−1 p> σq + O(c−2 ) ,\n\n(11)\n\nwhere notations have been explained in section I C. In the higher post-Newtonian approximations the multipole moments have\ncontributions coming directly from the stress-energy tensor of gravitational field (Landau-Lifshitz pseudotensor) which have\nnon-compact support. Therefore, the multipole moments are expressed by more complicated functionals [105]. Radiative\napproximation of the canonical metric tensor reveals that contribution of the tails of gravitational waves must be added to the\ndefinitions of the multipole moments (10), (11) so that the multipole moments in the radiative zone of the isolated system read\n[66, 67, 106]\nIAl =\n\nIA1PN\n+ 2M\nl\n\nZ+∞\n0\n\nSAl =\n\nSA1PN\n+ 2M\nl\n\nd ζ I ̈A1PN\n(t − r − ζ )\nl\n\n\" \u0012 \u0013\n#\nl−2\nζ\n2l 2 + 5l + 4\n1\nln\n+\n,\n+∑\n2b\nl(l + 1)(l + 2) k=1\nk\n\nZ+∞\n0\n\n\" \u0012 \u0013\n#\nl−1\nζ\n1\nl−1\n1PN\n ̈\nd ζ SAl (t − r − ζ ) ln\n+\n,\n+∑\n2b\nl(l + 1) k=1\nk\n\n(12)\n\n(13)\n\nwhere b is a normalization constant which value is supposed to be absorbed to the definition of the origin of time scale in the\nradiative zone but this statement has not been checked so far.\nB. The harmonic coordinates\n\nEquation (3) holds in an arbitrary gauge imposed on the metric tensor. The harmonic gauge is defined by the condition [54]\n2h\nμ\n\nαβ\n,β\n\n− h,α = 0 ,\n\n(14)\n\nwhere h ≡ h μ . The gauge condition (14) reduces the Einstein vacuum field equations to the wave equation (4) for the gravitational potentials hαβ . Harmonic coordinates xα are defined as solutions of the homogeneous wave equation \u0003xα = 0 up to\nthe gauge functions wα . In particular, the harmonic canonical coordinates are defined by the condition that all gauge functions\nwα = 0. The canonical metric tensor (5) – (8) depends on two sets of multipole moments [5, 64] which reflects the existence of\n\n\f10\nonly two degrees of freedom of a free (detached from matter) gravitational field in general relativity [1–3]. At the same time one\ncan obtain a generic expression for the harmonic metric tensor by making use of infinitesimal coordinate transformation\nx′α = xα − wα\n\n(15)\n\nfrom the canonical harmonic coordinates xα to arbitrary harmonic coordinates x′α with the harmonic gauge functions wα which\nsatisfy to a homogeneous wave equation\n\u0003wα = 0 .\n\n(16)\n\nThe most general solution of this vector equation contains four sets of STF multipoles [5, 64]\n∞ \u0014 W (t − r) \u0015\nAl\n,\nw0 = ∑\nr\n,Al\nl=0\ni\n\n∞\n\nw =\n\n∑\n\n\u0014\n\nl=0\n∞ \u0014\n\n∑\n\nXAl (t − r)\nr\n\nεipq\n\nl=1\n\n\u0015\n\n∞\n\n,iAl\n\n+∑\n\nl=1\n\nZqAl−1 (t − r)\nr\n\n\u0014\n\n\u0015\n\nYiAl−1 (t − r)\nr\n\n\u0015\n\n+\n\n(17)\n\n(18)\n\n,Al−1\n\n,\n\n,pAl−1\n\nwhere WAl , XAl , YiAl−1 , and ZqAl−1 are Cartesian tensors depending on the retarded time. Their specific form is a matter of\ncomputational convenience (or the boundary conditions) for derivation and interpretation of observable effects but it does not\naffect the invariant quantities like the phase of electromagnetic wave propagating through the field of the multipoles.\nThe most convenient choice simplifying the structure of the metric tensor perturbations, is given by the following gauge\nfunctions\n\n\nl I (−1) (t − r)\n∞\n(−1)\n Al\n ,\n(19)\nw0 = ∑\nl!\nr\nl=2\n,Al\n\n\n\n\n\n(−2)\n∞\n(−1)l  IAl (t − r) \n\nwi = ∑\n\nl=2\n\n∞\n\nl!\n\nr\n\n−\n\n(20)\n\n,iAl\n\nl\n\nIiAl−1 (t − r)\n+\nr\n,Al−1\n\n\n(−1)\n∞\n(−1)l l  εiba SbAl−1 (t − r) \n4∑\nr\nl=2 (l + 1)!\n(−1)\nl=2 l!\n\n4∑\n\n\u0014\n\n\u0015\n\n.\n\n,aAl−1\n\nThese functions, after they are substituted to equation (3), transform the canonical metric tensor perturbation to a remarkably\nsimple form\nh00 =\n\n2M\n,\nr\n\nh0i = −\n\n2εipq S p Nq\n,\nr2\n\nhi j = δi j h00 + hTT\nij ,\nhTi jT = Pi jkl qcan.\nkl ,\n\n(21)\n(22)\n(23)\n(24)\n\nwhere the TT-projection differential operator Pi jkl , applied to the symmetric tensors depending on both time and spatial coordinates, is given by\n1\nPi jkl = (δik − ∆−1∂i ∂k )(δ jl − ∆−1∂ j ∂l ) − (δi j − ∆−1∂i ∂ j )(δkl − ∆−1∂k ∂l ) ,\n2\n\n(25)\n\n\f11\nand ∆ and ∆−1 denote the Laplacian and the inverse Laplacian respectively.\nWhen comparing the canonical metric tensor with that given by equations (21)–(24) it is instructive to keep in mind that\n(−2) I ̈ (t − r) = I (t − r) and ∆(I (t − r)/r) = I ̈ (t − r)/r for r 6= 0. This is a consequence of the fact that function\nAl\nAl\nAl\nAl\nh\ni\n(−2) I ̈ (t − r) is a solution of the homogeneous d'Lambert's equation, that is, \u0003 (−2) I (t − r)/r = 0 for r 6= 0. We also notice\nAl\nAl\n\u0002\n\u0003\n\u0002\n\u0003\nthat IAl (t − r)/r = ∆−1 I ̈Al (t − r)/r and (−2) I Al (t − r)/r = ∆−1 IAl (t − r)/r . The metric tensor harmonic perturbation\n(21)–(24) is similar to the Coulomb gauge in electrodynamics [107, 108].\nC. The ADM coordinates\n\nThe Arnowitt-Deser-Misner (ADM) gauge condition in the linear approximation is given by two equations [61]\n2h0i,i − hii,0 = 0 ,\n\n3hi j, j − h j j,i = 0 ,\n\n(26)\n\nwhere the second equation holds exactly, and for any function f = f (t, x) we use notations: f,0 = ∂ f /∂ t and f,i = ∂ f /∂ xi . For\ncomparison, the harmonic gauge condition (14) in the linear approximation reads:\n2h0i,i − hii,0 = h00,0 ,\n\n2hi j, j − h j j,i = −h00,i .\n\n(27)\n\nThe ADM gauge condition (26) brings the space-space component of the metric to the following form\n1\ngi j = δi j (1 + hkk ) + hTT\nij ,\n3\n\n(28)\n\nwhere hTi jT denotes the transverse-traceless part of hi j and hkk = 3h00. The ADM and harmonic gauge conditions are not\ncompatible inside the regions occupied by matter. However, outside of matter they can co-exist simultaneously. Indeed, it\nis straightforward to check out that the metric tensor (21)–(24) satisfies both the harmonic and the ADM gauge conditions in the\nlinear approximation along with the assumption that M ̇ = 0. This was first noticed in [100]. We call the coordinates in which\nthe metric tensor is given by equations (21)–(24) as the ADM-harmonic coordinates.\nThe experimental problem of detection of gravitational waves is reduced to the observation of motion of test particles in\nthe field of the incident or incoming gravitational wave. These test particles are photons in the electromagnetic wave used in\nobservations and mirrors in ground-based gravitational-wave detectors or pulsars and Earth in case of using a pulsar timing\narray. The gravitational wave affects propagation of photons and perturbs motion of the mirrors or pulsars and Earth. These\nperturbations must be explicitly calculated and clearly separated from noise to avoid possible misinterpretation of observable\neffects due to the gravitational wave. It turns out that the canonical form of the metric tensor (5) – (8) is well-adapted for\nperforming an analytic integration of equations of light rays. At the same time, freely-falling mirrors (or pulsars and Earth)\nexperience influence of gravitational waves emitted by the isolated astronomical system and move with respect to the coordinate\ngrid of the canonical harmonic coordinates in a complicated way. For this reason, the perturbations produced by the gravitational\nwaves on the light propagation get mixed up with the motion of massive test particles in these coordinates.\nArnowitt, Deser and Misner [61] showed that there exist canonical ADM coordinates which have a special property such that\nfreely-falling massive particles are not moving with respect to this coordinates despite that they are perturbed by the gravitational\nwaves. This means that the ADM coordinates themselves are not inertial and, although have an advantage in treating motion\nof massive test particles, should be used with care in the interpretation of gravitational wave experiments. Making use of the\ncanonical ADM coordinates simplifies analysis of the gravitational wave effects observed at gravitational wave observatories\n(LIGO, LISA, NGO, etc.) or by astronomical technique because the motion of observer (proof mass) is excluded from the\nequations. However, the mathematical structure of the metric tensor in the canonical ADM coordinates does not allow us to\ndirectly integrate equations for light rays analytically because it contains terms that are instantaneous functions of time. Integrals\nfrom these instantaneous functions of time cannot be performed explicitly [100].\nThe ADM-harmonic coordinates have the advantages of both harmonic and ADM coordinates. Thus, the ADM-harmonic\ncoordinates allow us to get a full analytic solution of the light-ray equations and to eliminate the effects produced by the\nmotion of observers with respect to the coordinate grid caused by the influence of gravitational waves. In other words, all\nphysical effects produced by gravitational waves are contained merely in the solution of the equations of light propagation. This\nconclusion is, of course, valid in the linear approximation of general relativity and is not extended to the second approximation\nwhere gravitational-wave effects on light and motion of observers can not be disentangled and have to be analysed together.\nSimilar ideology based on the introduction of TT coordinates , has been earlier applied for analysis of the output signal of the\ngravitational-wave detectors with freely-suspended masses [1, 2, 25] placed to the field of a plane gravitational wave, that is at the\ndistance far away from the localized astronomical system emitting gravitational waves where the curvature of the gravitationalwave front is negligible. Our ADM-harmonic coordinates are an essential generalization of the standard TT coordinates because\nthey can be constructed at an arbitrary distance from the astronomical system, thus, covering the near, intermediate and radiative\nzones.\n\n\f12\nIII.\n\nEQUATIONS OF PROPAGATION OF ELECTROMAGNETIC SIGNALS\nA.\n\nMaxwell equations in curved spacetime\n\nIn this section we treat gravitational field exactly without approximation. Therefore, all indices are raised and lowered by\nmeans of the metric tensor gαβ with gαβ defined in accordance with the standard rule gαβ gβ γ = δβα . The general formalism\ndescribing the behavior of electromagnetic radiation in an arbitrary gravitational field is well known and can be found, for example, in textbooks [1, 2, 109] or in reviews [110, 111]. Electromagnetic field is defined in terms of the (complex) electromagnetic\ntensor Fαβ as a solution of the Maxwell equations. In the high-frequency limit one can approximate the electromagnetic tensor\nFαβ as [1, 2]\nFαβ = {Aαβ exp(iφ )} ,\n\n(1)\n\nwhere Aαβ is a slowly varying (complex) amplitude and φ is a rapidly varying phase of the electromagnetic wave which is called\neikonal [1, 112], and i is the imaginary unit, i2 = −1. In the most general case of propagation of light in a transparent medium\nthe eikonal is a complex function which real and imaginary parts are connected by the Kramers-Kr ́'onig dispersion relations\n[107]. We shall consider propagation of light in vacuum and neglect the imaginary part of the eikonal that is associated with\nabsorption. Of course, the amplitude, Aαβ , and phase, φ , are functions of both time and spatial coordinates.\nThe source-free (vacuum) Maxwell equations are given by [1, 2]\n∇α Fβ γ + ∇β Fγα + ∇γ Fαβ = 0 ,\n\n(2)\n\n∇β F αβ = 0 ,\n\n(3)\n\nwhere ∇α denotes covariant differentiation. Taking a covariant divergence from equation (2), using equation (3) and applying\nthe rule of commutation of covariant derivatives of a tensor field of a second rank, we obtain the covariant wave equation for the\nelectromagnetic field tensor\nμ\n\nμ\n\n\u0003g Fαβ + Rαβ μν F μν + Rμα Fβ − Rμβ Fα = 0 ,\n\n(4)\n\nγ\n\nwhere \u0003g ≡ gαβ ∇α ∇β , Rαβ μν is the Riemann curvature tensor, and Rαβ = R αγβ is the Ricci tensor (definitions of the Riemann\nand Ricci tensors in this chapter are the same as in the textbook [3]). We consider the case of propagation of light in vacuum\nwhere the stress-energy tensor of matter, T αβ , is absent. Due to the Einstein equations it yields Rαβ = 0. Hence, in our case (4)\nis reduced to a more simple form\n\u0003g Fαβ + Rαβ μν F μν = 0 .\n\n(5)\n\nDifferential operator \u0003g in (4) taken along with the Riemann and Ricci tensors is called de Rham's operator for the electromagnetic field [2? ].\nB. Maxwell equations in the geometric optics approximation\n\nLet us now assume that the electromagnetic tensor Fαβ shown in (1) can be expanded with respect to a small dimensionless\nparameter ε = λem /L where λem is a characteristic wavelength of the electromagnetic wave and L is a characteristic radius\nof spacetime curvature. The parameter ε is a bookkeeping parameter of the high-frequency approximation in expansion of\nthe electromagnetic field beyond the limit of the geometric optics. More specifically, we assume that the expansion of the\nelectromagnetic field given by equation (1) has the following form [2]\n\u0012 \u0013\n\u0001\niφ\n,\n(6)\nFαβ = aαβ + ε bαβ + ε 2 cαβ + ... exp\nε\nwhere aαβ , bαβ , cαβ , etc. are functions of time and spatial coordinates.\nSubstituting expansion (6) into equation (2), taking into account a definition of the electromagnetic wave vector, lα ≡ ∂ φ /∂ xα ,\nand arranging the terms with similar powers of ε , lead to the chain of equations\nlα aβ γ + lβ aγα + lγ aαβ = 0 ,\n\n(7)\n\n∇α aβ γ + ∇β aγα + ∇γ aαβ = −i lα bβ γ + lβ bγα + lγ bαβ ,\n\u0001\n\n(8)\n\n\f13\nwhere we have neglected the effects of spacetime curvature which are of the order of O(ε 2 ) that are too small to measure.\nSimilarly, equation (3) gives a chain of equations\nlβ aαβ = 0 ,\n\n(9)\n\n∇β aαβ + ilβ bαβ = 0 ,\n\n(10)\n\nwhere we again neglected the effects of spacetime curvature.\nEquation (9) implies that the amplitude, aαβ , of the electromagnetic field tensor is orthogonal in the four-dimensional sense\nto a wave vector lα , at least, in the first approximation. Contracting equation (7) with lα and accounting for (9), we find that the\nwave vector lα is null, that is\nlα l α = 0 .\n\n(11)\n\nTaking a covariant derivative from this equation and using the fact that\n∇[β lα ] = 0 ,\n\n(12)\n\nbecause lα = ∇α φ , one can show that the vector lα obeys the null geodesic equation\nl β ∇β l α = 0 .\n\n(13)\n\nIt means that the null vector l α is parallel transported along itself in the curved spacetime. Equation (13) can be expressed more\nexplicitly as\ndl α\n+ Γβα γ l β l γ = 0 ,\ndσ\n\n(14)\n\nwhere σ is an affine parameter along the light-ray trajectory, and\n\u0001\n1\nΓβα γ = gα μ ∂γ gμβ + ∂β gμγ − ∂μ gβ γ ,\n2\n\n(15)\n\nare the Christoffel symbols.\nFinally, contracting equation (8) with l γ , and using (7), (9), (10) along with (12) we can show that in the first approximation\nl γ ∇γ aαβ + θ aαβ = 0 ,\n\n(16)\n\nθ ≡ (1/2)∇α l α ,\n\n(17)\n\nwhere\n\nis the expansion of the light-ray congruence defined at each point of spacetime by the derivative of the wave vector l α .\nEquation (16) represents the law of propagation of the tensor amplitude of electromagnetic wave along the light ray. In\nthe most general general case, when the expansion θ 6= 0, the tensor amplitude of the electromagnetic wave is not paralleltransported along the light rays. It can be shown that the expansion θ of the light-ray congruence is defined only by the\nstationary components of the gravitational field of the isolated astronomical system determined by its mass M , and spin S i , but\nit does not depend on the higher-order multipole moments. It means that gravitational waves do not contribute to the expansion\nof the light-ray congruence in the linearised approximation of general relativity and their impact on θ is postponed to the terms\nof the second order of magnitude with respect to the universal gravitational constant G.\nC. Electromagnetic eikonal and light-ray geodesics\nThe unperturbed congruence of light rays\n\nWe have assumed that geometric optics approximation is valid and electromagnetic waves propagate in vacuum. We also assume that each electromagnetic wave has a wavelength λem much smaller than the characteristic wavelength λgw of gravitational\nwaves emitted by the isolated astronomical system. Physical speed of light in vacuum, measured locally, is equal to the speed of\npropagation of gravitational waves, and is equal to the fundamantal speed c in tangent Minkowski spacetime. We have neglected\nall relativistic effects associated with the curvature tensor of spacetime in equations of light propagation. In accordance with the\nconsideration given in previous section III B, a kinematic description of propagation of each electromagnetic wave can be given\n\n\f14\n\nNorth\n\nJ\nτ\n\nI0\n\nξi\n\nK\n\nTo observer\n\nVector field of light rays\n\nθ\n\nΩ\n\nx i = k iτ + ξi\n\nξ\n\ni\n\nK0\n\nI\n\nEast\n\nτ\n\nTo observer\n\nPlane of the sky\nFIG. 2: Astronomical coordinates used in calculation of light propagation. The origin of the coordinates is at the center-of-mass of the source\nof gravitational waves. The bundle of light rays is defined by a vector field ki . Vector K i = −ki + O(c−2 ) is directed from observer towards\nthe source of light. Vector K0i is directed from the observer towards the source of gravitational waves. We define K0i = −N i = −xi /r, where\nxi are the coordinates of observer with respect to the source of gravitational waves, and r = |x|. The picture shows the plane of the sky being\northogonal to vector K i .\n\nby tracking position of its phase φ , which is a null hypersurface in spacetime, as a function of time or by following the congruence of light rays that are orthogonal to the phase. Quantum electrodynamics tells us that the light rays are tracks of massless\nparticles of the quantized electromagnetic field (photons) which are moving along light-ray geodesics defined by equation (14).\nParticular solution of these equations can be found after imposing the initial-boundary conditions\ndx(−∞)\n=k.\ndt\n\nx(t0 ) = x0 ,\n\n(18)\n\nThese conditions determine the spatial position, x0 , of an electromagnetic signal (a photon) at the time of its emission, t0 , and\nthe initial direction of its propagation given by the unit vector, k, at the past null infinity , that is at the infinite spatial distance\nand at the infinite past [2, 3] where the spacetime is assumed to be flat (see Fig. 1). We imply that vector k is directed towards\nobserver. Notice that the initial-boundary conditions (18) have been chosen as a matter of convenience only. Instead of them,\nwe could chose two boundary conditions when both the point of emission and that of observation of the electromagnetic signal\nare fixed in time and space. It is always possible to convert solution of equations of the null geodesics given in terms of the\ninitial-boundary conditions to that given in terms of the boundary conditions. We discuss it in section V C.\nIn the next sections we will derive an explicit form of equations of null geodesics and solve them by iterations with the initial\nboundary conditions (18). At the first iteration we can neglect relativistic perturbation of photon's motion and approximate it by\na straight line\nxi = xiN (t) ≡ xi0 + ki (t − t0 ) ,\n\n(19)\n\nwhere t0 is the time of emission of electromagnetic signal, xi0 are spatial coordinates of the source of the electromagnetic signal\ntaken at the time t0 , and ki = k is the unit vector along the trajectory of photon's motion defined in (18).\nThe bundle of light rays makes 2+1 split of space by projecting any point in space onto the plane being orthogonal to the\nbundle (see Figure 2). This allows to make a transformation to new independent variables, τ and ξ i , defined as follows\n\nτ = ki xiN\n\n,\n\nξ i = Pij xNj ,\n\n(20)\n\n\f15\nwhere\nPij = δ ji − ki k j ,\n\n(21)\n\nτ ≡ k * x = t − t∗ ,\n\n(22)\n\nt ∗ ≡ k * x0 − t0 ,\n\n(23)\n\nis the operator of projection on the plane being orthogonal to k. It is easy to see that the parameter τ is equivalent to time\n\nwhere\n\nis the time of the closest approach of the electromagnetic signal to the origin of the spatial coordinates which is taken, in our\ncase, coinciding with the center of mass of the isolated astronomical system. Because for each light ray the time t ∗ is fixed, we\nconclude that the time differential d τ = dt on the light ray. The reader may expect that the results of our calculation of observable\nquantities are to depend on the parameters ξ i and t ∗ . This is, however, not true since ξ i and t ∗ depend on the choice of the origin\nof the coordinates and direction of its spatial axes that is they are coordinate-dependent. The observable quantities have nothing\nto do with the choice of coordinates and, thus, ξ i and t ∗ cannot enter the expressions for observable quantities. Inspection of the\nresulting equations in the sections which follow, shows that parameters ξ i and t ∗ do vanish from the observed quantities.\nThe unperturbed light-ray trajectory (19) written in terms of the new variables (20) reads\nxiN (τ ) = ki τ + ξ i ,\n\n(24)\n\nso that the new variable ξ i ≡ ξ = k × (x × k) should be understood as a vector drawn from the origin of the coordinate system\ni\ni\ntowards\np the point of the closest approach of the ray to the origin. For vectors k and ξ are orthogonal, the unperturbed distance\nrN = xi xi between the photon and the origin of the coordinate system\np\n(25)\nrN = τ 2 + d 2 ,\nwhere d = |ξ| is the impact parameter of the unperturbed light-ray trajectory with respect to the coordinate origin.\nWe introduce two other operators of partial derivatives with respect to τ and ξ i determined for any smooth function taken on\nthe congruence of light rays. These operators will be denoted with a hat above them and are defined as\n\n∂\n∂ˆτ ≡\n∂τ\n\n,\n\n∂\n,\n∂ˆi ≡ Pi j\n∂ξ j\n\n,\n\n∂\n∂ˆt ∗ ≡ ∗\n∂t\n\n(26)\n\nso that, for example,\nki ∂ˆi = 0 .\n\n(27)\n\nAn important consequence of the projective structure of the bundle of the light rays is that for any smooth function F(t, x)\ndefined on the light-ray trajectories, one has\n\u0013\n\u0014\u0012\n\u0013\n\u0015\n\u0012\n∂\n∂\n∂\n∂\nF(t ∗ + τ , ξ + kτ ) ,\n+\nk\n(28)\nF(t\n,\nx)\n+\nk\n=\ni\ni\ni\n∂ xi\n∂t\n∂\nξ\n∂\nτ\nx=x0 +k(t−t0 )\n\u0013\n\u0015\n\u0014\u0012\nd\n∂\ni ∂\n+ k i F(t , x)\n= F(t ∗ + τ , ξ + kτ ) ,\n(29)\n∂t\n∂x\nd\nτ\nx=x0 +k(t−t0 )\n\u0015\n\u0014\n∂\n∂\nF(t , x)\n= ∗ F(t ∗ + τ , ξ + kτ ).\n(30)\n∂t\n∂\nt\nx=x0 +k(t−t0 )\nHere, in the left sides of Eqs. (28)–(30) one must, first, calculate the partial derivatives and only after that substitute the unperturbed trajectory of the light ray, x = x0 + k(t −t0 ), while in the right side of these equations one, first, substitute the unperturbed\ntrajectory parameterized by the variables τ and ξ i and, then, differentiate. Equations (28)–(30) define the commutation rule of\ninterchanging the operations of substitution of the light ray trajectory to a function defined on spacetime manifold and the calculation of the partial derivatives from the function. It turns out to be very effective for analytic integration of the light-ray geodesic\nequations.\nIt is worth noticing that (30) allows us to re-write (28) as follows\n\u0014\n\u0015\n\u0013\n\u0012\n∂ F(t, x)\n∂\n∂\n∂\n∗\n−\nk\n(31)\n=\n+\nk\ni ∗ F(t + τ , ξ + k τ ) .\ni\ni\n∂ xi\n∂\nξ\n∂\nτ\n∂\nt\nx=x0 +k(t−t0 )\nThis equation will be used later for decomposing STF spatial derivatives from the potentials of gravitational field depending on\nretarded time.\n\n\f16\nThe eikonal equation\n\nThe eikonal φ is related to the wave vector l α of the electromagnetic wave as lα = ∂α φ . This definition along with equation\n(11) immediately gives us a differential Hamilton-Jacobi equation for the eikonal propagation [1]\ngαβ\n\n∂φ ∂φ\n=0.\n∂ xα ∂ xβ\n\n(32)\n\nThe unperturbed solution of this equation is a plane electromagnetic wave\n\nφN = φ0 + ω kα xα ,\n\n(33)\n\nwhere φ0 is a constant, ω = 2πν∞ , ν∞ is a constant frequency of the electromagnetic wave at infinity, and kα is the unperturbed\ndirection of the co-vector lα . Equation (32) assumes that kα is a null co-vector with respect to the Minkowski metric in the sense\nthat\n\nη αβ kα kβ = 0 .\n\n(34)\n\nWe postulate that the co-vector kα = (−1, k) where the unit Euclidean vector k is defined at past null infinity by equation (18).\nIn the linearized approximation of general relativity the eikonal can be decomposed in a linear combination of unperturbed,\nφN , and perturbed, ψ , parts\n\nφ = φN + ωψ ,\n\n(35)\n\n\u0012\n\u0013\n∂ψ\nlα = ω kα + α ,\n∂x\n\n(36)\n\nso that the wave co-vector\n\nMaking use of equations (2) and (32)–(36) yield a partial differential equation of the first order for the perturbed part of the\neikonal\nkα\n\n∂ψ\n1\n= hαβ kα kβ .\n∂ xα\n2\n\n(37)\n\nThis equation can be solved in all space by the method of characteristics [? ] which, in the case under consideration, are the\nunperturbed light-ray geodesics given by Eq. (24). Hence, after making use of relation (29) one gets an ordinary differential\nequation for finding the eikonal perturbation\n\u0001\ndψ\n1\n0\nα β\nˆ i i\n,\n= hcan.\nαβ (τ , ξ)k k + ∂τ k w − w\ndτ\n2\n\n(38)\n\nwhere both the gauge functions wα and the canonical metric tensor perturbation hcan.\nαβ are taken on the unperturbed light-ray\ntrajectory. In particular, the components of the metric tensor perturbation have the following form\np\n∞ l\n2M\nl pq\n+ 2 ∑ ∑ ∑ h 00 (t ∗ , τ , ξ) ,\n(M)\nr\nl=2 p=0 q=0\n\u0015\n∞ l−1 p \u0014\n2εiba S b N a\nl pq ∗\nl pq ∗\nh\n(t\n,\nτ\n,\nξ)\n+\nh\nτ\n,\nξ)\n,\n(t\n,\nhcan.\n=\n−\n+\n4\n∑ ∑ ∑ (S)0i\n0i\n0i\n(M)\nr2\nl=2 p=0 q=0\n\nhcan.\n00 =\n\ncan.\ncan.\nhcan.\ni j =δi j h00 + qi j ,\n∞ l−2 p\n\nqcan.\ni j =4 ∑\n\n∑∑\n\n(39)\n(40)\n(41)\n\n∞ l−2 p\n\n∑∑∑\n\nl pq\nl pq\nqi j (t ∗ , τ , ξ)\nq i j (t ∗ , τ , ξ) − 8\nl=2 p=0 q=0 (S)\nl=2 p=0 q=0 (M)\n\n,\n\n(42)\n\n\f17\nwhere\nh l00pq (t ∗ , τ , ξ)\n(M)\n\n\n\n(p−q)\nIAl\n(t − r)\n(−1)l+p−q\nq\n,\n=\nCl (l − p, p − q, q)k<a1...a p ∂ˆa p+1 ...al > ∂ˆτ \nl!\nr\n\nh l0ipq (t ∗ , τ , ξ) =\n\n(M)\n\nhl0ipq (t ∗ , τ , ξ) =\n\n(S)\n\nq i j (t ∗ , τ , ξ) =\nl pq\n\n(M)\n\n∗\nqli pq\nj (t , τ , ξ) =\n\n(S)\n\n(−1)l+p−q\nCl−1 (l − p − 1, p − q, q)×\nl!\n\n\n(p−q+1)\nIiAl−1 (t − r)\nq\n,\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτ \nr\n\n(−1)l+p−q l\nCl−1 (l − p − 1, p − q, q)×\n(l + 1)!\n\n\n(p−q)\nε\nS\n(t\n−\nr)\niab\nbA\nl−1\n,\n(∂ˆa + ka∂ˆτ − ka ∂ˆt ∗ )∂ˆτq \nr\n\n(−1)l+p−q\nCl−2 (l − p − 2, p − q, q)×\nl!\n\n\n(p−q+2)\nI\n(t\n−\nr)\ni jAl−2\nq\n,\nk<a1 ...a p ∂ˆa p+1 ...al−2 > ∂ˆτ \nr\n\n(−1)l+p−ql\nCl−2 (l − p − 2, p − q, q)(∂ˆa + ka ∂ˆτ − ka ∂ˆt ∗ )×\n(l + 1)!\n\n\n(p−q+1)\nS\n(t\n−\nr)\nε\nba(i\nj)bA\nl−2\n.\nk<a1 ...a p ∂ˆa p+1 ...al−2 > ∂ˆτq \nr\n\n(43)\n\n(44)\n\n(45)\n\n(46)\n\n(47)\n\nAll quantities in the right side of (43)–(47), which are explicitly shown as functions of xi , r = |x| and t, must be understood as\ntaken on the unperturbed light-ray trajectory and expressed in terms of ξ i , d = |ξ|, τ and t ∗ in accordance with equations (22),\n(p−q)\n(25). For example, the ratio IAl\n(t − r)/r in equation (43) must be understood as\n(p−q)\n\nIAl\n\nr\n\n(t − r)\n\n(p−q)\n\n≡\n\nIAl\n\n√\n(t ∗ + τ − τ 2 + d 2 )\n√\n,\nτ 2 + d2\n\n(48)\n\nand the same replacement rule is applied to the other equations. After accounting for (39)–(47), equation (38) can be solved\nanalytically with the mathematical technique shown in section IV.\nLight-ray geodesics\n\nThe geodesic equation for light rays is given in (14). It is reduced to a more explicit form after making use of the linearized\npost-Minkowskian expressions for the Christoffel symbols\n1\nΓ000 = − ∂t h00 (t, x) ,\n2\n1\n0\nΓ0i = − ∂i h00 (t, x) ,\n2\n\u0003\n1\u0002\n0\nΓi j = − ∂i h0 j (t, x) + ∂ j h0i (t, x) − ∂t hi j (t, x) ,\n2\n1\ni\nΓ00 = ∂t h0i (t, x) − ∂i h00 (t, x) ,\n2\n\u0003\n1\u0002\ni\n∂ j h0i (t, x) − ∂ih0 j (t, x) + ∂t hi j (t, x) ,\nΓ0 j =\n2\n1\ni\nΓ j p = [∂ j hip (t, x) + ∂ phi j (t, x) − ∂i h j p (t, x)] .\n2\n\n(49)\n(50)\n(51)\n(52)\n(53)\n(54)\n\n\f18\nThe affine parameter σ in this equation is an implicit function of the coordinate time t. Relation between σ and t is derived\nfrom the time component of (14)\n\u0012\n\u0013\n\u0001 dt 2\nd 2t\n0\n0 p\n0 p q\n=0,\n+\nΓ\n+\nΓ\nẋ\n+\nΓ\nẋ\nẋ\npq\n00\n0p\ndσ 2\ndσ\n\n(55)\n\nwhere the dot above coordinates denote a derivative with respect to the coordinate time, ẋ p ≡ dx p /dt. Effectively, there is no\nneed to solve (55) explicitly as we are not interested in the parameter σ because the coordinate time t is more practical parameter\nwhich can be measured with clocks. Therefore, we express the spatial components of the geodesic equation (14) in terms of\nthe Christoffel symbols (49)–(54), and replace differentiation with respect to the canonical parameter σ by differentiation with\nrespect to the coordinate time t. With the help of equation (55) the spatial components of the geodesic equation for light ray\npropagation becomes\n1\n1\nẍi (t) = h00,i − h0i,0 − h00,0ẋi − hik,0 ẋk − (h0i,k − h0k,i )ẋk −\n2\n2\n\u0013\n\u0012\n\u0013\n\u0012\n1\n1\nk j\nk i\nh00,k ẋ ẋ − hik, j − hk j,i ẋ ẋ +\nhk j,0 − h0k, j ẋk ẋ j ẋi ,\n2\n2\n\n(56)\n\nwhere h00 , h0i , hi j are components of the metric tensor taken on the unperturbed light-ray trajectory as shown in equations\n(39)–(47), that is hαβ ≡ hαβ (t, xN (t)).\nEquation (56) can be further simplified after substituting the unperturbed light-ray trajectory (24) to the right side of Eq. (56)\nand making use of equation (28). Working in arbitrary coordinates one obtains\n\u0012\n\u0013\n1 i j p can.\nd 2 xi (τ ) 1 α β ˆ can. ˆ\nα can.\nk\n=\nk\n∂\n−\n∂\nh\n−\n(57)\nk\nh\nk\nk\nk\nq\n− ∂ˆττ (wi − ki w0 ).\ni\nτ\niα\njp\nαβ\ndτ 2\n2\n2\nwhere all functions in equation (57) are taken (before any differentiation) on the unperturbed light-ray trajectory given by\nequation (24) and the gauge functions wα (they are explained in (3)) have not yet been specified which means that equations\n(57) are gauge-invariant. We discuss the choice of the gauge functions later on in next subsection.\nThe main advantage of the form (57) to which we have reduced the light ray propagation equation (14) is the convenience of\nits analytic integration. Indeed, when we integrate along the light-ray path the following rules, applied to any smooth function\nF(τ , ξ), can be used\nZ\nZ\n\n∂\nF(τ , ξ) d τ =F(τ , ξ) + C(ξ) ,\n∂τ\n∂\n∂\nF(τ , ξ) d τ = i\n∂ξi\n∂ξ\n\nZ\n\nF(τ , ξ) d τ .\n\n(58)\n\n(59)\n\nThis means that terms which are represented as partial derivatives with respect to the time parameter τ can be immediately\nintegrated out by making use of (58). At the same time (59) shows that one can change the order of integration and differentiation\nwith respect to the parameter ξ i . It allows us to calculate the integral along the light ray from a more simple scalar expression\ninstead of integrating a vector function. This technique will be demonstrated explicitly in next sections.\nEquation (57) is linear with respect to the perturbation of the metric tensor, hαβ . Hence, it can be linearly decomposed in the\nequation for perturbations of the light-ray trajectory caused separately by mass and spin multipole moments. Substitution of the\nmetric tensor (5) – (8) to Eq. (57) and replacement of spatial derivatives with respect to xi with those with respect to parameters\nξ i and τ by making use of (30) yield the following linear superposition\nẍi = ẍi(G) + ẍi(M) + ẍi(S) ,\n\n(60)\n\nwhere ẍi(M) and ẍi(S) are the components of photon's coordinate acceleration caused by mass and spin multipoles of the metric\ntensor respectively, and ẍi(G) is the gauge-dependent acceleration. These components read\n\u0003\n\u0002\nẍi(G) = ∂ˆττ (ki φ 0 − φ i ) + (ki w0 − wi ) ,\n\n(61)\n\n\f19\nM\nẍi(M) =2(∂ˆi − ki ∂ˆτ ) +\nr\np\n∞ l\n(−1)l+p−q\nCl (l − p, p − q, q)H(2 − q)×\n2∂ˆi ∑ ∑ ∑\nl!\nl=2 p=0 q=0\n\u0012\n\u0013\u0012\n\u0013\n\u0015\n\u0014\np−q\np−q\np−q ˆ q IAl (t − r)\nˆ\nˆ\n1−\n1−\nk<a1 ...a p ∂a p+1 ...al > ∂t ∗ ∂τ\n−\nl\nl−1\nr\n\u0010\n∞ l\n(−1)l+p\np\u0011\n2∂ˆτ ∑ ∑\n×\nCl (l − p, p) 1 −\nl!\nl\nl=2 p=0\n\u0014\n\u001a\u0012\n\u0013\n\u0015\np\np IAl (t − r)\nˆ\nˆ\nki<a1 ...a p ∂a p+1 ...al > ∂t ∗\n−\n1+\nl−1\nr\n\u0015\u001b\n\u0014\nIiAl−1 (t − r)\n2p\n,\nk<a1 ...a p−1 ∂ˆa p ...al−1 > ∂ˆtp∗\nl−1\nr\n\n(62)\n\nand\n\u0010\n\u0011ε S\njba b\nẍi(S) =2 k j ∂ˆia − δi j ∂ˆaτ\n−\nr\n∞ l−1 p\n(−1)l+p−q l\n4k j ∂ˆia ∑ ∑ ∑\nCl−1 (l − p − 1, p − q, q)H(2 − q)×\nl=2 p=0 q=0 (l + 1)!\n\u0013\n\u0015\n\u0014\n\u0012\np−q\np−q ˆ q ε jba SbAl−1 (t − r)\nˆ\nˆ\nk<a1 ...a p ∂a p+1 ...al−1 > ∂t ∗ ∂τ\n+\n1−\nl−1\nr\n\u0010\n\u0011 ∞ l−1 (−1)l+p l\n4 ∂ˆa − ka ∂ˆt ∗ ∂ˆτ ∑ ∑\nCl−1 (l − p − 1, p)×\nl=2 p=0 (l + 1)!\n\u0013\n\u0015\n\u0012\n\u0014\nεiba SbAl−1 (t − r)\np\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆtp∗\n+\n1−\nl−1\nr\n∞ l−1\n\n(−1)l+p l\nCl−1 (l − p − 1, p)\nl=2 p=0 (l + 1)!\n#\n\"\nε jbal−1 S ̇îbAl−2 (t − r)\np\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆt ∗\nr\n\n4k j ∂ˆτ\n\n(63)\n\n∑∑\n\n(64)\n,\n\nwhere a dot above any function denotes a partial time derivative with respect to the parameter t ∗ [113], wα are the gauge functions\ncoming from (3), and φ α are the gauge functions which appear as a result of integration of the light ray propagation equation.\nThese terms enter the equations of motion in the form of combination ki φ 0 − φ i given in next section. It is worth emphasizing\nthat we do not intend to separate ki φ 0 − φ i in two functions, φ i and φ 0 because such a separation is not unique while the linear\ncombination ki φ 0 − φ i is unambiguous. We have not combined functions φ α with the gauge functions wα for two reasons:\n1. to indicate that the solution of equations of light-ray geodesic, performed in one specific coordinate system, leads to\ngeneration of terms which can be eliminated by gauge transformation,\n2. to simplify the final form of the result of the integration as all terms with second and higher order time derivatives are\nimmediately integrated in accordance with (58).\nGauge functions wα are still arbitrary which makes our equations gauge-invariant. However, for the sake of physical interpretation of the result of integration of equations of light-ray geodesic, we shall choose a specific form of functions wα to make our\ncoordinate system both harmonic and ADM which makes the coordinate description of motion of free-falling particles in these\ncoordinates simple. Specific form of the gauge functions wα at arbitrary field point is shown in equations (17), (18) and their\nform at any point on the light-ray trajectory is given in equations (66),(67).\nIt is important to notice that all terms depending on mass-type multipoles of the order l in the right sides of (62) have\na numerical factor 1 − p/l where p is the summation index. Such terms vanish when p = l. It means that (62) does not\ncontain terms with the time derivatives of the order l from the multipoles of the l-th order which, actually, describe gravitational\nwave emission from the astrophysical system because they decay slowly as 1/r. The same is true with regard to the spin-type\nmultipoles of the order l − 1 in (63) – the time derivatives of the order of l − 1 from the spin-type multipoles (which decay as 1/r)\nvanish in the right side of (63). Explicit analytic integration of such terms would be impossible but they simply do not present in\n\n\f20\nthe solution of general relativistic equations of light propagation for the reason mentioned above. It is this property of the null\ngeodesic in general relativity which prevents the amplification of the gravitational wave perturbation for a light ray propagating\nclosely to an astrophysical system emitting multipolar gravitational radiation (binary star, etc.). This fact was established in\n[100] in a quadrupole approximation and extended to any multipole in [103]. Present chapter confirms this result. The reader\nshould notice that the cancellation of these terms occurs only in general relativity.\nGauge freedom of equations of propagation of light\n\nGauge functions wα , generating the coordinate transformation from the canonical harmonic coordinates to the ADM-harmonic\nones, are given by equations (19), (20). They transform the metric tensor as follows\nhcan.\nαβ = hαβ − ∂α wβ − ∂β wα ,\n\n(65)\n\ncan. is the canonical form of the metric tensor in harmonic coordinates given by equations (5)–(8) and h\nwhere hαβ\nαβ is the metric\ntensor given in the ADM-harmonic coordinates by equations (21)–(24).\nThe gauge functions taken on the light-ray trajectory and expressed in terms of the variables ξ and τ can be written down in\nthe next form\n\nw0 =\n\n∞\n\nl\n\np\n\n∑∑∑\n\nZ τ +t ∗\n\nl=2 p=0 q=0 −∞\n\ndu h l00pq (u, τ , ξ),\n∞\n\np\n\nl\n\n∑∑\n\nwi = (∂ˆi + ki ∂ˆτ − ki ∂ˆt ∗ ) ∑\n\nZ τ +t ∗\n\nl=2 p=0 q=0 −∞\n\n∞ l−1 p\n\n−4 ∑\n\n∑∑\n\n(66)\n\n(M)\n\nZ τ +t ∗\n\ndu\n\nl=2 p=0 q=0 −∞\n\ndv\n\nZ v\n\n−∞\n\ndu h l00pq (u, τ , ξ)\n(M)\n\n\u0015\n\n\u0014\n\nl pq\nl pq\nh 0i (u, τ , ξ) + h0i (u, τ , ξ)\n(S)\n(M)\n\n(67)\n\n,\n\nwhere h l00pq (u, τ , ξ), h l0ipq (u, τ , ξ) and hl0ipq (u, τ , ξ) are defined by the Eqs. (43), (44) and (45) after making use of the substitution\n(M)\n\n(M)\n\n(S)\n\nt ∗ → u. It is worth noticing the following relationships\np\n∞ l\n∂ w0\nl pq\nh (t ∗ , τ , ξ),\n=\n∑\n∑\n∑\n∂ t ∗ l=2 p=0 q=0 (M)00\np\n∞ l\n∂ wi\n=\n∑∑∑\n∂ t ∗ l=2\np=0 q=0\n\nZ τ +t ∗\n−∞\n\n∞ l−1 p\n\n−4∑\n\n∑∑\n\nl=2 p=0 q=0\n\n(68)\n\ndu(∂ˆi + ki ∂ˆτ ) h l00pq (u, τ , ξ)\n\n(69)\n\n(M)\n\n\u0014\n\n\u0015\n\nh l0ipq (t ∗ , τ , ξ) + hl0ipq (t ∗ , τ , ξ)\n(M)\n(S)\n\n,\n\nand\n\n∂ wi\nki ∗\n∂t\n\np\n∞ l\n∂ w0\n− ∗ =∑ ∑ ∑\n∂t\nl=2 p=0 q=0\n\n\u0014Z\n\nτ +t ∗\n−∞\n\n\u0015\nl pq\nl pq ∗\nˆ\ndu∂τ h 00 (u, τ , ξ) − h 00 (t , τ , ξ)\n(M)\n\n(M)\n\n(70)\n\n∞ l−1 p\n\n−4∑\n\n∑\n\n\u0014\n\u0015\ni l pq ∗\ni l pq ∗\n∑ k h 0i (t , τ , ξ) + k h0i (t , τ , ξ) ,\n\nl=2 p=0 q=0\n\n(M)\n\n(S)\n\nwhich are helpful in calculation of the gravitational shift of the frequency of light.\nA linear combination, ki φ 0 − φ i , of the gauge-dependent functions φ α that appear in (61), is given by the expressions\n0\ni\n0\ni\nki φ 0 − φ i = (ki φ(M)\n− φ(M)\n) + (ki φ(S)\n− φ(S)\n),\n\n(71)\n\n\f21\n∞\n\np\n\nl\n\n(−1)l+p−q\nCl (l − p, p − q, q)×\nl!\nl=2 p=2 q=2\n\n0\ni\n− φ(M)\n= 2∂ˆi ∑\nki φ(M)\n\n∑∑\n\n(72)\n\n\n\n\u0013\u0012\n\u0013\n\u0012\n(p−q)\nI\n(t\n−\nr)\np−q\np−q\nA\n+\n1−\nk<a1 ...a p ∂ˆa p+1 ...al > ∂ˆτq−2  l\n1−\nl\nl −1\nr\n∞\n\nl\n\np\n\n(−1)l+p−q\nCl (l − p, p − q, q)×\n∑∑\nl!\nl=2 p=1 q=1\n\n2∑\n\n\n\n\u0013 \u001a\u0012\n\u0013\n\u0012\n(p−q)\nI\n(t\n−\nr)\np−q\np−q\nA\n−\n1+\nki<a1 ...a p ∂ˆa p+1 ...al > ∂ˆτq−1  l\n1−\nl\nl−1\nr\n\n\n(p−q)\n\nI\n(t\n−\nr)\np−q\niAl−1\n ,\n2\nk<a1 ...a p−1 ∂ˆa p ...al−1> ∂ˆτq−1 \n\nl−1\nr\n0\ni\n− φ(S)\n=2\nki φ(S)\n\nεiab ka S b\n+\nr\n\n(73)\n\n∞ l−1 p\n\n(−1)l+p−q l\nCl−1 (l − p − 1, p − q, q)×\n(l + 1)!\nl=3 p=2 q=2\n\n\n(p−q)\n\u0012\n\u0013\nS\n(t\n−\nr)\nε\njab bAl−1\np−q\nq−2\n−\n1−\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτ \nl−1\nr\n\n4k j ∂ˆia ∑\n\n∑∑\n\n\u0010\n\u0011 ∞ l−1\n4 ∂ˆa − ka ∂ˆt ∗ ∑ ∑\n\np\n\n(−1)l+p−ql\nCl−1 (l − p − 1, p − q, q)×\nl=2 p=1 q=1 (l + 1)!\n\n\n(p−q)\n\u0013\n\u0012\nS\n(t\n−\nr)\nε\niab\np−q\nbA\nq−1\nl−1\n−\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτ \n1−\nl−1\nr\n\n∑\n\n∞ l−1 p\n\n(−1)l+p−ql\nCl−1 (l − p − 1, p − q, q)×\nl=2 p=0 q=0 (l + 1)!\n\n\n(p−q)\n\u0013\n\u0012\nε\nS\n(t\n−\nr)\niab\np−q\nbAl−1\nq\n+\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτ \n1−\nl−1\nr\n\n4ka ∑\n\n∑∑\n\n∞ l−1 p\n\n(−1)l+p−ql\nCl−1 (l − p − 1, p − q, q)×\nl=2 p=1 q=1 (l + 1)!\n\n\n(p−q+1)\n(t − r)\nε jbal−1 SîbA\nq−1\nl−2\n\nk<a1 ...a p ∂ˆa p+1 ...al−1> ∂ˆτ \nr\n\n4k j ∑\n\n∑∑\n\nD. Polarization of light and the Stokes parameters\nReference tetrad\n\nPropagation of electromagnetic fields in vacuum and evolution of their physical parameters in curved spacetime can be studied\nwith various mathematical techniques. One of the most convenient techniques was worked by Newman and Penrose [114, 115]\nand is called the Newman-Penrose formalism [110]. This formalism introduces at each point of spacetime a null tetrad of four\nvectors associated with the bundle of light rays defined by the electromagnetic wave vector field l α . The Newman-Penrose\ntetrad consists of two real and two complex null vectors – (l α , nα , mα , m̄α ) – where the bar above function indicates complex\nconjugation. The null tetrad vectors are normalized in such a way that nα l α = −1 and mα m̄α = +1 are the only non-vanishing\nproducts among the four vectors of the tetrad.\n\n\f22\nThe vectors of the null tetrad are not uniquely determined by specifying l α . Indeed, for a fixed direction l α the normalization\nconditions for the tetrad vectors are preserved under the linear transformations (null rotation) [110, 114]\nl ′α = Al α ,\nn′α = A−1 (nα + B̄mα + Bm̄α + BB̄l α ) ,\n\n(74)\n(75)\n\nm′α = e−iΘ (mα + B̄l α ) ,\n\n(76)\n\nm̄\n\n′α\n\niΘ\n\nα\n\nα\n\n= e (m̄ + Bl ) ,\n\n(77)\n\nwhere A, Θ are real scalars and B = B1 + iB2 is a complex scalar. These transformations form a four-parameter (A, B1 , B2 , Θ)\nsubgroup of the homogeneous Lorentz group which is equivalent to the point-like Lorentz transformations [109].\nFor doing mathematical analysis of the intensity and polarization of electromagnetic waves it is useful to introduce a local\northonormal reference frame of observer moving with a four velocity uα who is seeing the electromagnetic wave travelling in\nthe positive\nn direction of z axis\no of the reference frame. It means that at each point of spacetime the observer uses a tetrad frame\nα\nα\nα\nα\nα\ne (β ) = e (0) , e (1) , e (2) , e (3) defined in such a way that\neα(0) = uα\n\nh\ni\neα(3) = (−lα uα )−1 l α + (lβ uβ )uα ,\n\n,\n\n(78)\n\nand two other vectors of the observer's tetrad, eα(1) and eα(2) , are the unit space-like vectors being orthogonal to each other as\nwell as to eα(0) and eα(3) . In other words, vectors of the observer tetrad are subject to the following normalization conditions\nβ\n\ngαβ eα(μ ) e (ν ) = ημν\n\nβ\n\nη μν eα(μ ) e (ν ) = gαβ .\n\n,\n\n(79)\n\nIt is worth noticing that the observer's tetrad eβα has two group of indices. The indices without round brackets run from 0 to 3 and\nare associated with time and space coordinates. The indices enclosed in the round brackets numerate vectors of the tetrad and\nalso run from 0 to 3. The coordinate-type indices of the tetrad have no relation to the tetrad indices. If one changes spacetime\ncoordinates (passive coordinate transformation) it does not affect the tetrad indices while the coordinate indices of the tetrad\nchange in accordance with the transformation law for vectors. On the other hand, one can change the tetrad vectors at each\npoint in spacetime by doing the Lorentz transformation (active coordinate transformation) without changing the coordinate chart\n[115].\nLet us define at each point of spacetime a coordinate basis of static observers\n\u0012\n\u0013\n1\nα\nE (0) = 1 + h00 , 0 , 0 , 0 ,\n(80)\n2\n\u0013\n\u0012\n1\n(81)\nE α(1) = h0 j a j , ai − hi j a j ,\n2\n\u0012\n\u0013\n1\nE α(2) = h0 j b j , bi − hi j b j ,\n(82)\n2\n\u0012\n\u0013\n1\nE α(3) = h0 j k j , ki − hi j k j ,\n(83)\n2\nwhich is written down for the case of weak gravitational field, gαβ = ηαβ + hαβ . Here the unit spatial vectors a = (a1 , a2 , a3 ),\nb = (b1 , b2 , b3 ), and k = (k1 , k2 , k3 ) are orthonormal in the Euclidean sense (δi j ai b j = δi j ai k j = δi j bi k j = 0 and δi j ai a j =\nδi j bi b j = δi j ki k j = 1) with vector k pointing to the direction of propagation of the light ray at infinity as given in (18). These\nbasis vectors are convenient to track the changes in the parameters of the electromagnetic wave as it travels from the point of\nemission of light to the point of its observation.\nThe local tetrad eα(β ) of observers moving with four-velocity uα with respect to the static observers relates to the tetrad E α(β )\nby means of the Lorentz transformation\nγ\n\nγ\n\neα(β ) = Λ β E α(γ ) ,\n\nE α(β ) = λ β eα(γ ) ,\n\n(84)\n\nwhere the matrix of the Lorentz transformation is [2]\nΛ00 = u0 ≡ γ\n\nΛi0\n\n=\n\nΛ0i\n\n(85)\n0\n\n=u ,\n\nΛi j = δ i j +\n\nui u j\n1+γ\n\n(86)\n,\n\n(87)\n\n\f23\nand the inverse matrix of the Lorentz transformation λ αβ is obtained from Λαβ by replacing ui → −ui that complies with the\nβ\n\ndefinition of the inverse matrix Λαβ λ γ = δγα .\nThe connection between the null tetrad and the observer's tetrad frame, eα(β ) , is given by equations\nh\ni\nl α = −(lγ uγ ) eα(0) + eα(3) ,\nh\ni\n1\nnα = − (lγ uγ ) eα(0) − eα(3) ,\n2\ni\n1 h α\nα\nm = √ e (1) + ieα(2) ,\n2\ni\nh\n1\nm̄α = √ eα(1) − ieα(2) .\n2\n\n(88)\n(89)\n(90)\n(91)\n\nVector pairs eα(0) , eα(3) and eα(1) , eα(2) split spacetime at the point in two sub-spaces. In particular, vectors eα(1) , eα(2) defines the\nplane of polarization in spacetime. If vectors eα(0) and eα(3) are fixed, then, vectors eα(1) and eα(2) are defined up to an arbitrary\nrotation in the plane of polarization. Transformations (76), (77) with B = 0 yield\n′α\n= cos Θ eα(1) + sin Θ eα(2) ,\ne(1)\n\nα\ne′(2)\n\n=\n\n− sin Θ eα(1) + cosΘ eα(2)\n\n(92)\n,\n\n(93)\n\nwhere Θ is the rotation angle of the vectors in the plane of polarization. We notice that, since vectors eα(1) , eα(2) are orthogonal\nto eα(0) = uα , the two null vectors, mα and m̄α , are also orthogonal to the four-velocity,\nmα u α = 0\n\nm̄α uα = 0 .\n\n,\n\n(94)\n\nThe null vector nα is also orthogonal to uα , nα uα = 0. On the other hand, the scalar product of l α with four-velocity yields the\nangular frequency of electromagnetic wave, ω ≡ −lα uα .\nPropagation laws for the reference tetrad\n\nDiscussion of the rotation of the polarization plane and the change of the Stokes parameters of electromagnetic radiation is\ninconceivable without understanding of how the local reference frame propagates along the light-ray geodesic from the point of\nemission of light to the point of its observation. To this end we construct the reference tetrad frame of observer at the point of\nobservation of light and render a parallel transport of it backward in time along the light-ray geodesic. By definition, vectors of\nthe tetrad frame of the observer, eα(β ) , and those of the null tetrad (l α , nα , mα , m̄α ) do not change in a covariant sense as they\nare parallel transported along the light ray. The propagation equation for the tetrad vectors are, thus, obtained by applying the\noperator D ≡ l α ∇α of the parallel transport along the null vector l α . Explicit form of the parallel transport of the reference tetrad\nis\ndeα(μ )\ndσ\n\nγ\n\n+ Γβα γ l β e (μ ) = 0 ,\n\n(95)\n\nwhere σ is an affine parameter along the light ray. Using definition of the Christoffel symbols (15) and changing parameter σ to\nthe proper time τ of the observer we recast (95) to\n\u0014\n\u0015\n\u0001\n1\n1\nd\nβ\nγ\neα(μ ) + hαβ e (μ ) = η αν ∂ν hγβ − ∂γ hνβ kβ e (μ ) .\n(96)\ndτ\n2\n2\nThe propagation of the null vectors mα and m̄α along the direction of the null vector l α is given by\ndmα\n+ Γβα γ l β mγ = 0 ,\ndλ\nd m̄α\n+ Γβα γ l β m̄γ = 0 ,\ndλ\n\n(97)\n(98)\n\nand the same laws are valid for nα and l α (see, for example, (14)). Equations (96)–(98) are the main equations for the discussion\nof the rotation of the plane of polarization and variation of the Stokes parameters.\n\n\f24\nRelativistic description of polarized electromagnetic radiation\n\nWe consider propagation of a bundle of plane electromagnetic waves from the point of emission to the point of observation.\nEach of these waves have an electromagnetic tensor Fαβ = Fαβ + O(ε ) defined in the first approximation by equation [110, 111]\n\u0012 \u0013\niφ\n,\n(99)\nFαβ = aαβ exp\nε\n(100)\naαβ = Φ m[α lβ ] + Φ̄ m̄[α lβ ]\nwhere Φ is a complex scalar amplitude of the wave with a real and imaginary components which are independent of each other\nα\nin the most general case of incoherent radiation. In the proper frame of the observer with 4-velocity\n√ u the components of\nthe electric and magnetic field vectors are defined respectively as E α = −F αβ uβ and H α = (−1/2 −g)ε αβ γδ Fγδ uβ [3]. The\nelectric field is a product of slowly-changing amplitude Eα = −aαβ uβ and fast-oscillating phase exponent\n\u0012 \u0013\niφ\n.\n(101)\nEα = Eα exp\nε\nThe polarization properties of electromagnetic radiation consisting of an ensemble of the waves with equal frequencies but\ndifferent phases are defined by the components of the electric field measured by observer. In the rest frame of the observer with\n4-velocity uα , the intensity and polarization properties of the electromagnetic radiation are described in terms of the polarization\ntensor [1, 107]\nJαβ =< Eα Ēβ >=< Eα E ̄β > ,\n\n(102)\n\nwhere the angular brackets represent an average with respect to an ensemble of the electromagnetic waves with randomly\ndistributed phases. This averaging eliminates all fast-oscillating terms from Jαβ . One has to notice [1] that the polarization\ntensor Jαβ is symmetric only for a linearly polarized radiation. In all other cases, the polarization tensor is not symmetric. The\npolarization tensor Jαβ is purely spatial at the point of observation which means it is orthogonal to the four-velocity of observer,\nJαβ uβ . Furthermore, because the polarization tensor is defined in the sub-space of the polarization plane, it is orthogonal to the\nwave vector Jαβ l β = 0. This equality follows directly from its definition (102) and (9).\nThe vector amplitude Eα of the electric field can be decomposed in two independent components in the plane of polarization.\nTwo vectors of the null tetrad, mα , m̄α , form the circular-polarization basis, and vectors eα(1) , eα(2) form a linear polarization basis.\nThe decomposition reads\nE α = EL mα + ERm̄α ,\nE α = E(1) eα(1) + E(2)eα(2) ,\n\n(103)\n(104)\n\nwhere\n1\nEL = ω Φ\n2\n\n,\n\n1\nER = ω Φ̄ ,\n2\n\n(105)\n\nare left and right circularly-polarized components of the electric field,\n1\nE(1) = √ (EL + ER )\n2\n\n,\n\ni\nE(2) = √ (EL − ER) ,\n2\n\n(106)\n\nare linearly polarized components, ω = −lα uα is the angular frequency of the electromagnetic wave, and we have taken into\naccount the condition of orthogonality (94).\nThere are for electromagnetic Stokes parameters Sα = (S0 , S1 , S2 , S3 ). They are defined by projecting the polarization tensor\nJαβ on four independent combination of the tensor products of the two vectors, eα(1) , eα(2) making up the polarization plane.\nMore specifically, [107, 116]\ni\nh\nβ\nβ\n(107)\nS0 = Jαβ eα(1) e (1) + eα(2) e (2) ,\nh\ni\nβ\nβ\nS1 = Jαβ eα(1) e (1) − eα(2) e (2) ,\n(108)\ni\nh\nβ\nβ\n(109)\nS2 = Jαβ eα(1) e (2) + eα(2) e (1) ,\nh\ni\nβ\nβ\nS3 = iJαβ eα(1) e (2) − eα(2) e (1) ,\n(110)\n\n\f25\nwhere S0 ≡ I is the intensity, S1 ≡ Q and S2 ≡ U characterize the degree of a linear polarization, and S3 ≡ V is the degree of a\ncircular polarization of the electromagnetic wave.\nMaking use of equation (102) in (107)–(110) allows us to represent the Stokes parameters in the linear polarization basis as\nfollows [107]\n< |E(1) |2 + |E(2)|2 > ,\n\n(111)\n\n< |E(1) | − |E(2)| > ,\n< E(1) E ̄(2) + E ̄(1) E(2) > ,\n\n(112)\n\nS3 = i < E(1) E ̄(2) − E ̄(1) E(2) > ,\n\n(114)\n\nS0 =\nS1 =\nS2 =\n\n2\n\n2\n\n(113)\n\nwhere E(n) = Eα eα(n) for n = 1, 2.\nIt is important to emphasize that though the Stokes parameters have four components, they do not form a 4-dimensional\nspacetime vector because they do not behave like a vector under transformations of the Lorentz group [1, 107]. Indeed, if we\nperform a pure Lorentz boost all four Stokes parameters remain invariant [1]. However, for a constant rotation of angle Θ in the\npolarization plane, the Stokes parameters transform as [1]\nS0′\nS1′\nS2′\nS3′\n\n=\n=\n=\n=\n\nS0 ,\nS1 cos 2Θ + S2 sin 2Θ ,\nS1 cos 2Θ − S2 sin 2Θ ,\nS3 .\n\n(115)\n(116)\n(117)\n(118)\n\nThis is what would be expected for a spin-1/2 field. That is, under a duality rotation of Θ = π /4, one linear polarization state\nturns into the other, while the circular polarization state remains the same. The transformation properties (115)–(118) of the\nStokes parameters point out that the Stokes parameters S1 , S2 represent a linearly polarized components, and S3 represents a\ncircularly polarized component.\nThe polarization vector P = (P1 , P2 , P3 ) and the degree of polarization P = |P | of the electromagnetic radiation can be\ndefined in terms of the normalized Stokes parameters by P = (S1 /I, S2 /I, S3 /I). Any partially polarized wave may be thought\nof as an incoherent superposition of a completely polarized wave with the degree of polarization P and the polarization vector\nP , and a completely unpolarized wave with the degree of polarization 1 − P and nil polarization vector, P = 0, so that for\nan arbitrary polarized radiation one has: (S0 , S1 , S2 , S3 ) = I(P, P1 , P2 , P3 ) + I(1 − P, 0, 0, 0). For completely polarized waves,\nvector P describes the surface of the unit sphere introduced by Poincaré [1]. The center of the Poincaré sphere corresponds\nto an unpolarized radiation and the interior to a partially polarized radiation. Orthogonally polarized waves represent any two\nconjugate points on the Poincaré sphere. In particular, (P1 = ±1, P2 = 0, P3 = 0), and (P1 = 0, P2 = 0, P3 = ±1) represent\northogonally polarized waves corresponding to the linear and circular polarization bases, respectively.\nPropagation law of the Stokes parameters\n\nTaking definition (100) of the electromagnetic tensor and accounting for the parallel transport of the null vectors l α , mα , m̄α\nalong the light ray and the laws of propagation of the electromagnetic tensor given by equations (16), yield the law of propagation\nof the complex scalar functions Φ and Φ̄\ndΦ\n+θΦ = 0 ,\ndσ\nd Φ̄\n+ θ Φ̄ = 0 ,\ndσ\n\n(119)\n(120)\n\nwhere σ is an affine parameter along the ray and θ is the expansion of the light-ray congruence defined in (17).\nLet us consider a sufficiently small, two-dimensional area A in the cross-section of the congruence of light rays lying on a\nnull hypersurface of constant phase φ that is in the polarization plane. The law of transportation of the cross-sectional area is\n[2, 71, 110]\ndA\n− 2θ A = 0 .\ndσ\nThus, the product, A |Φ|2 = A ΦΦ̄, remains constant along the congruence of light rays:\n\u0001\nl α ∇α A |Φ|2 = 0 .\n\n(121)\n\n(122)\n\n\f26\nThis law of propagation for the product A |Φ|2 corresponds to the conservation of photon's flux [2, 71].\nThe law of conservation of the number of photons propagating along the light ray, corresponds to the propagation law of\nvector |Φ|2 l α . Indeed, taking covariant divergence of this quantity and making use of the equations (119), (120) along with\ndefinition (17) for the expansion θ of the bundle of light rays, yields [2, 71]\n\u0001\n∇α |Φ|2 l α = 0 .\n(123)\n\nThis equation assumes that the scalar amplitude Φ of the electromagnetic wave can be interpreted in terms of the number density,\nN , of photons in phase space and the energy of one photon, Eω = h̄ω , as follows\n|Φ| =\n\n\u0012 \u00131/2\n√\nN\n8π h̄\n,\nEω\n\n(124)\n\nwhere the reduced Planck constant h̄ = h/2π and the normalizing factor were introduced for consistency between classical and\nquantum definitions of the energy of an electromagnetic wave [2].\nEach of the Stokes parameter is proportional to the square of frequency of light, ω = −uα lα , as directly follows from equations\n(111)–(114) and (106). Therefore, the variation of the Stokes parameters along the light ray can be obtained directly from their\ndefinitions (107)–(110) along the light ray and making use of the laws of propagation (119), (120). However, the set of the Stokes\nparameters Sα (α = 0, 1, 2, 3) is not directly observed in astronomy and we do not discuss their laws of propagation. Instead\nthe set of four other polarization parameters (Fω , P1 , P2 , P3 ) is practically measured [71, 117] and we focus on the discussion\nof the laws of propagation for these parameters. Here P = (P1 , P2 , P3 ) is the polarization vector as defined at the end of the\npreceding section, and Fω is the specific flux of radiation (also known as the monochromatic flux of a light source [117]) entering\na telescope from a given source. The specific flux is defined as an integral of the specific intensity (also known as the surface\nbrightness [117]) indexsurface brightness of the radiation, Iω ≡ Iω (ω , l), over the total solid angle (assumed ≪ 4π ) subtended\nby the source on the observer's sky:\nFω =\n\nZ\n\nIω (ω , l)dΩ(l̂) ,\n\n(125)\n\nwhere l̂ = (sin θ̂ cos φ̂ , sin θ̂ sin φ̂ , cos θ̂ ) is the unit vector in the direction of the radiation flow and d Ω̂(l) = sin θ̂ d θ̂ d φ̂ is the\nelement of the solid angle formed by light rays from the source and measured in the observer's local Lorentz frame.\nThe specific intensity Iω of radiation at a given frequency ω = 2πν , flowing in a given direction, l̂, as measured in a specific\nlocal Lorentz frame, is defined by\nIω =\n\nd(energy)\n.\nd(time)d(area)d(frequency)d(solid angle)\n\n(126)\n\nA simple calculation (see, for instance, the problem 5.10 in [118]), reveals that\nN =\n\n8π 3 Iω\n,\nh4 ω 3\n\n(127)\n\nwhere h is the Planck's constant. The number density N is invariant along the light ray and does not change under the Lorentz\ntransformation. Invariance of N is a consequence of the kinetic equation for photons (radiative transfer equation) which in the\ncase of gravitational field and without any other scattering processes, assumes the following form [2]\ndN\n=0.\ndλ\n\n(128)\n\nEquations (127), (128) tell us that the ratio Iω /ω 3 is invariant along the light-ray trajectory, that is\nIω\n=\nIω0\n\n\u0012\n\nω\nω0\n\n\u00133\n\n,\n\n(129)\n\nwhere ω0 , ω are frequency of light at the point of emission and observation respectively, Iω0 is the surface brightness of the\nsource of light at the point of emission, and Iω is the surface brightness of the source of light at the point of observation.\nEquations (119)–(129) make it evident that in the geometric optics approximation the gravitational field does not mix up the\nlinear and circular polarizations of the electromagnetic radiation but can change its surface brightness Iω due to gravitational\n(and Doppler) shift of the light frequency caused by the time-dependent part of the gravitational field of the isolated system\nemitting gravitational waves. Furthermore, the monochromatic flux from the source of radiation changes due to the distortion\nof the domain of integration in equation (125) caused by the gravitational light-bending effect. Taking into account that the\n\n\f27\ngravitationally-unperturbed solid angle dΩ(k) = sin θ d θ d φ , and introducing the Jacobian, J(θ , φ ), of transformation between\nthe spherical coordinates (θ̂ ,φ̂ ) and (θ ,φ ) at the point of observation, one obtains that the measured monochromatic flux is\nFω =\n\nZ\n\ndφ\n\nZ\n\nIω0 (θ , φ )J(θ , φ )(ω /ω0 )3 sin θ d θ .\n\n(130)\n\nEquation (130) tells us that the monochromatic flux of the source of light can vary due to:\n1. the gravitational Doppler shift of the electromagnetic frequency of light when it travels from the point of emission to the\npoint of observation;\n2. the change in the solid angle at the point of observation caused by the gravitational light deflection. The \"magnification\"\nmatrix is the Jacobian of the transformation of the null directions on the celestial sphere generated by the bending of the\nlight-ray trajectories by the gravitational field of the isolated system.\nSpatial orientation of two components, P1 and P2 , of the polarization vector P at the point of observation differs from that taken\nat the point of emission of the electromagnetic wave due to the parallel transport of the polarization vector. The reference tetrad\nwith resepct to which the orientation of the polarization vector is measured is subject to the same law of the parallel transport.\nTherefore, in order to understand the change in the orientation of the polarization vector it is sufficient to consider the change in\nthe orientation of the reference tetrad as it propagates from the point of emission of light to the point of observation. The change\nin the polarization can be easily extracted then from the law of transformation of the Stokes parameters under the change of the\nreference tetrad. As we will see later in section VI D, only two vectors of the tetrad, eα(1) and eα(2) , will undergo the change in\ntheir orientation as they propagate along the light ray. Consequently, only two components of the polarization vector, P1 and\nP2 will change. This can be seen after taking into account equations (92), (93) where the rotational angle Θ is determined as a\nsolution of the parallel transport equation (96) for the reference tetrad (see section VI D). Thus, the gravitational field changes\nthe tilt angle of the polarization ellipse as light propagates along the light-ray trajectory. This gravitationally-induced rotation of\nthe polarization ellipse is called the Skrotskii effect [119, 120]. It was also predicted and discussed independently in [121, 122].\nIts observation would play a significant role for detection of gravitational waves of cosmological origin by CMBR-radiometry\nspace missions [38, 123]. The third component of the polarization vector, P3 , remains the same along the light-ray trajectory\nbecause it represents the circularly polarized component of the radiation and is not affected by the rotation of the reference tetrad\nas it propagates along the light-ray path.\nIV.\n\nMATHEMATICAL TECHNIQUE FOR ANALYTIC INTEGRATION OF LIGHT-RAY EQUATIONS\n\nThis section provides mathematical technique for performing integration of equations of propagation of various characteristics\nof electromagnetic wave from the point of emission of light x0 to the point of its observation x. It has been worked out in\n[6, 100, 103, 104]. The basic function, which is to be integrated, is the metric tensor perturbation, hαβ (t, x), generated by\nthe localized astronomical system and taken at the points lying on the light-ray trajectory. The metric tensor depends on the\nmultipole moments and/or their derivatives taken at the retarded instant of time s = t − r divided by the radial distance from\nthe system, r, taken to some power. The most difficult integrals are those taken from the functions like this, F(s)/r, with\nF(s) being a multipole moment of the gravitating system depending on the retarded time s. Calculation of the integrals goes\nslightly differently for stationary and non-stationary components of the metric tensor and these issues are treated in the next two\nsubsections.\nA.\n\nMonopole and dipole light-ray integrals\n\nThe monopole and dipole parts of the metric tensor perturbation (5)–(8) are formed by terms being proportional to the mass\nM and spin S i of the isolated system. These terms are given in the solution of the light-ray equations by integrals [M (s)/r][−1] ,\n[M (s)/r][−2] and [S i (s)/r][−1] , [S i (s)/r][−2] . In this section we shall assume for simplicity that mass M and spin S i of the\nisolated system are constant during the time of propagation of light from the source of light to observer. The assumption of\nconstancy of the mass M and spin S i of the isolated system is valid as long as one neglects the energy emitted in the form\nof the gravitational waves by the isolated system under consideration. For light ray propagating from the sources at the edge\nof our visible universe (quasars) the characteristic interval of time of emission of gravitational waves by an isolated system is\ncomparable with the interval of time the light takes to travel from the point of emission to observer. In this case the time evolution\nof the mass-monopole and spin-dipole is to be taken into account for correct calculation of the perturbations of the trajectory of\nlight ray (see section V A for more detail). Mass and spin of the isolated system can also change due to a catastrophic disruption\nof the isolated system resulting in supernova explosion. Specific details of how this process affects the light-ray propagation are\nnot considered in the present chapter but, perhaps, are worthwhile to study.\n\n\f28\nIn the case when mass and spin are constant, the integrals that we need to carry out are reduced to [1/r][−1] and [1/r][−2] which\nare formally divergent at the lower limit of integration at the past null infinity when time t → −∞. However, one must bear in\nmind that these integrals do not enter equations of light-ray geodesics (57) alone but appear in these equations after taking at\nleast one partial derivative with respect to either ξ i or τ parameters. This differentiation effectively eliminates divergent parts of\nthe integrals from the final result. Hence, in what follows, we drop out the formally divergent terms so that the integrals under\ndiscussion assume the following form\n\u0014 \u0015[−1]\n\u0015\n\u0014\nZ t\nZ\ndτ\ndτ\n1\nr(τ ) − τ\n≡\n,\n= √\n= − ln\nr\nrE\n−∞ r\nd2 + τ 2\n\u0014 \u0015[−2]\n\u0014\n\u0015\nZ t \u0014 \u0015[−1]\n1\nr(τ ) − τ\n1\n≡\nd τ = −τ ln\n− r(τ ) ,\nr\nrE\n−∞ r\n\n(1)\n\n(2)\n\nwhere τ = t − t ∗ and we used equation (25) explicitly while expressing the distance r = rN (τ ) as a function of time τ . The\nconstant distance rE was introduced to make the argument of the logarithmic function dimensionless. This constant is not\nimportant for calculations as it always cancel out in final formulas. However, in the case of gravitational lensing it is convenient\nto identify the scale constant rE with the radius of the Einstein ring [71–73, 124]\nrE =\n\n\u0012\n\n4GM rr0\nc2 R\n\n\u00131/2\n\n,\n\n(3)\n\nwhere r, r0 are distances from the isolated system (the deflector of light) to observer and to the source of light respectively, and\nR = τ + τ0 . The radius of the Einstein ring is a characteristic distance separating naturally the case of weak gravitational lensing\n(d > rE ) from the strong lensing (d < rE ). The Einstein ring at the observer's point has the angular size given by\n\nθE =\n\nrE\n=\nr\n\n\u0012\n\n4GM r0\nc2 Rr\n\n\u00131/2\n\n.\n\n(4)\n\nThe angular radius θE defines the angular scale for a lensing situation. For example, in cosmology typical mass of an isolated\nsystem is M ≃ 1012M⊙ and distances r, r0 , R are of the order of 1 Gpc (Gigaparsec). Consequently, the angular Einstein radius\nθE is of the order of one arcsecond, and the linear radius rE is of the order of 1 Kpc (Kiloparsec). A typical star within our galaxy\nhas mass M ≃ M⊙ and distances r, r0 , R are of the order 10 Kpc. It yields an angular Einstein radius θE of the order of one 1μ as\n(one milli-arcsecond) and the linear radius rE is of the order of 10 au (10 astronomical units).\nB.\n\nLight-ray integrals from quadrupole and higher-order multipoles\n\nTime-dependent terms in the metric tensor (5) – (8) result from the multipole moments which can be either periodic (a binary\nsystem) or aperiodic (a supernova explosion) functions of time. The most straightforward way to calculate the impact of the gravitational field of such a source on the propagation of light would be to decompose its multipole moments F(s) := {IL (s), SL (s)}\nin the Fourier series [100]\n1\nF(t − r) = √\n2π\n\nZ +∞\n−∞\n\nF̃(ω̃ )eiω̃ (t−r) d ω̃ ,\n\n(5)\n\nwhere ω̃ is a Fourier frequency, then to substitute this decomposition to the light-ray propagation equations and to integrate them\nterm by term. This method makes an impression that in order to obtain the final result of the integration the (complex-valued)\nFourier image F̃(ω̃ ) of the multipole moments of the isolated system must be specified explicitly, otherwise neither explicit\nintegration nor the convolution of the integrated Fourier series will be possible. However, this impression is misleading, at least\nin general relativity. We shall show below that the explicit structure of F̃(ω̃ ) is irrelevant for general-relativistic calculation of\nthe light-ray integrals. This may be understood better, if one recollects that in general relativity gravitational field propagates\nwith the same speed as light in vacuum. In alternative theories of gravity the speed of gravity and light may be different [125], so\nit can lead to the appearance of terms being proportional to the difference between the speed of gravity and the speed of light that\nwill drastically complicates calculations which will do require to know the explicit form of the Fourier images of gravitationalwave sources as functions of ω̃ . All such terms, which might depend on the difference between the speed of gravity and the\nspeed of light are cancelled out in general relativity, thus, making integration of the light ray propagation equations manageable\nand applicable for any source of gravitational waves without particular specification of its temporal behaviour. It may be worth\nmentioning that the experimental limit on the difference between the speed of gravity and the speed of light in general relativity\ncan be measured in the solar system experiments with major planets as predicted in [126]. It was experimentally tested with the\n\n\f29\nprecision 20% in the jovian light-ray deflection experiment with VLBI network [127]. No deviation from general relativity was\ndetected.\nWe notice that the integration of the light-ray equations is effectively reduced to the calculation of only two types of integrals\nalong the light ray: [F(s)/r][−1] and [F(s)/r][−2] , where F(s) = F(t − r) denotes any type of the time-dependent multipole\nmoments of the gravitational field of the localized astronomical system. These integrals can be performed after introducing a\nnew variable [100]\np\n(6)\ny ≡ s − t ∗ = τ − r(τ ) = τ − d 2 + τ 2 ,\n\nwhich is the interval of time between two spacetime events: position of photon xα = (τ , x) on the light ray and that of the center\nof mass of the isolated system zα = (y, 0) taken at the retarded time y [148]. Equation (6) is a retarded solution of the null cone\nequation in flat spacetime\n\nηαβ (xα − zα )(xβ − zβ ) = 0 ,\n\n(7)\n\ngiving the time of propagation of gravity from the isolated system to the photon along the null cone characteristic of Einstein's\nequations. This retardation of gravity effect presents in the time argument of the solution (5)–(8) of the linearized Einstein\nequations. The replacement of the time argument τ with the retarded time y = τ − r(τ ) allows us to perform integration of\nequations of light-ray geodesics completely without making specific assumptions about the time dependence of the multipole\nmoments. It is worth noting that while the parameter τ runs from −∞ to +∞, the retarded time y runs from −∞ to 0, that is, y is\nalways negative, y ≤ 0.\nEquation (6) leads to other useful transformations\n\nτ=\n\ny2 − d 2\n,\n2y\n\np\n1 d 2 + y2\nd2 + τ 2 = −\n,\n2 y\n\n(8)\n\n1 d 2 + y2\ndy .\n2 y2\n\n(9)\n\nand\ndτ =\n\nMaking use of the new variable y and relationships (8), (9) the integrals under discussion can be explicitly displayed as follows:\n\u0014\n\nF(t − r)\nr\n\n\u0015[−1]\n\n= −\n\nZy\n\n\u0014\n\nF(t − r)\nr\n\n\u0015[−2]\n\n= −\n\n1\n2\n\n−∞\n\nF(t ∗ + ζ )\ndζ ,\nζ\n\nZy Zη\n\n−∞ −∞\n\nd2\nF(t ∗ + ζ )\ndζ dη −\nζ\n2\n\n(10)\nZy\n\n−∞\n\n1\nη2\n\nZη\n\n−∞\n\nF(t ∗ + ζ )\ndζ dη ,\nζ\n\n(11)\n\nwhere ζ , η are the dummy variables of the integration replacing the integration along the light-ray trajectory by that along a\nnull characteristic of the gravitational field, and t ∗ is the time of the closest approach of photon to the origin of the coordinate\nchart coinciding with the center of mass of the isolated gravitational system. The time t ∗ has no physical meaning in the most\ngeneral case and appears in calculations as an auxiliary (constant) parameter which vanishes in the final result. The reason is\nsimple, by choosing the origin of the coordinate chart at a different point we change the numerical value of t ∗ but it cannot\nchange physical observables – the angle of light-ray deflection, frequency shift, etc. The time of the closest approach t ∗ can\nbe used as an approximation of the retarded time s = t − r in the case of a small impact parameter d of the light ray with\nrespect to the isolated astronomical system, that is s ≃ t ∗ + O(d 2 /cr) (see equation (6)). This approximation makes an erroneous\nimpression that the physical effect of propagation of gravity is unimportant for calculation of observable effects caused by\nvariable gravitational field of the isolated system. This misinterpretation of the role of gravity's propagation in the interpretation\nof the observable astronomical effects did happen in some papers [53, 128] which used the simplifying approximation s = t ∗\nfrom the very beginning of calculations but it precludes to spatially disentangle the null cone characteristics of gravity and light.\nThe only case when the time t ∗ makes physical sense is when observer is located in infinity. Indeed, in this case the radial\ndistance r = ∞, and the retarded time s = t ∗ exactly, because the residual terms O(d 2 /r) = 0 irrespectively of the choice of the\ncoordinate origin [99].\nA remarkable property of the integrals in the right side of equations (10), (11) is that√\nthey depend on the parameters ξ i and\nτ only through either the upper limit of the integration, which is the variable y = τ − d 2 + τ 2 , or the square of the impact\nparameter, d 2 = (ξ * ξ) standing in front of the second integral in the right side of equation (11). For this reason, differentiation\n\n\f30\nof the integrals in the left part of equations (10), (11) with respect to either ξ i or τ will effectively eliminate the integration along\nthe light ray trajectory. For example,\n(\u0014\n\u0015[−1] )\nF(t ∗ + y) ˆ\nF(t\n−\nr)\nξi\n=−\n(12)\n∂ˆi\n∂i y = F(t − r) .\nr\ny\nyr\nSimilar calculation can be easily performed in case of differentiation of integral [F(t − r)/r][−1] with respect to τ . It results in\n(\u0014\n\u0015[−1] )\nF(t ∗ + y) ˆ\nF(t\n−\nr)\nτ \u0011 F(t − r)\nF(t ∗ + y) \u0010\n=−\n,\n(13)\n1−\n=\n∂ˆτ\n∂τ y = −\nr\ny\ny\nr\nr\nas it could be expected because the partial differentiation with respect to τ keeps ξ i and t ∗ fixed and, hence, is equivalent to\ntaking a total time derivative with respect to t along the light ray. Since all terms in the solution of the light geodesic equation are\nrepresented as partial derivatives from the integrals [F(t − r)/r][−1] and [F(t − r)/r][−2] with respect to the parameters ξ i and/or\nτ , it is clear from equations (12), (13) that the solution will not contain any single integral like [F(t − r)/r][−1] at all – only the\nderivatives of this integral will appear which are ordinary functions.\nDealing with the double integrals of type [F(t − r)/r][−2] is more sophisticated. We notice that taking the first and second\nderivatives from the double integral [F(t − r)/r][−2] do not eliminate the integration along the light ray trajectory\n\n\n(\u0014\n\u0015[−2] )\n\u0014\n\u0015[−1] Zy\nZη\n\n\n∗\nF(t − r)\n1\nF(t + ζ )\n1 F(t − r)\n∂ˆk\nd\nζ\nd\nη\n,\n(14)\n= ξk\n−\n\ny\nr\nr\nη2\nζ\n−∞\n−∞\n(\u0014\n\u0015 )\nξ k ξ j F(t − r)\nF(t − r) [−2]\nˆ∂ jk\n=\n(15)\nr\ny2\nr\n\n\n 1 \u0014 F(t − r) \u0015[−1] Zy 1 Zη F(t ∗ + ζ )\n\n+ P jk\n,\nd\nζ\nd\nη\n−\ny\n\nr\nη2\nζ\n−∞\n\n−∞\n\nHowever, taking one more (a third) derivative eliminates all integrals from equation (15) completely. More specifically, we have\n(\u0014\n\u0015 )\n\u001a\u0012\n\u0013\n\u0015\n\u001b\u0014\n1\nξij ˆ\nF(t − r) [−2]\nF(t − r) [−1]\nij\njk ˆ\njˆ\nˆ∂i jk\n=\nP +\n,\n(16)\n∂k + P ∂i + ξ ∂ik\nr\ny\nyr\nr\n\nand making use of equations (12), (15) for explicit calculation of partial derivatives in the right part of equation (16) proves that\nall integrations disappear, that is\n(\u0014\n\u0015 )\nPi j ξ k + P jk ξ i + Pik ξ j F(t − r)\nF(t − r) [−2]\nˆ∂i jk\n=\n(17)\nr\ny2\nr\n\u0013\n\u0015\n\u0014\u0012\n2 1\nξ iξ jξ k\n+\nF(t − r) − Ḟ(t − r) ,\n−\ny2 r 2\ny r\nwhere Ḟ(t − r) ≡ ∂t F(t − r). The same kind of reasoning works for the third derivatives with respect to the parameter τ and to\nthe mixed derivatives taken with respect to both ξ i and τ .\nWe shall obtain solution of the light geodesic in terms of (STF) partial derivatives taken with respect to the impact parameter\nvector, ξ i , of the light ray acting on the single and double integrals having a symbolic form ∂ˆ<a1 ...ak > [F(t − r)/r][−1] and\n∂ˆ<a1 ...ak > [F(t − r)/r][−2] where the angular brackets around the spatial indices indicate the STF symmetry. Explicit expression\nfor this STF derivative can be obtained directly by applying the differentiation rules shown in equations (14) – (16). In what\nfollows, we shall see that the solution of the equations of propagation of light rays will always contain three or more derivatives\nacting on the integrals from the higher-order multipole moments (with the multipole index l ≥ 2) which have the same structure\nas that shown in equations (10), (11). It means that the final result of the integration of the light-ray propagation equations\ndepending on the higher-order multipoles of the localized astronomical system can be expressed completely solely in terms of\nthese multipoles taken at the retarded instant of time s = t − r. In other words, the observed effects of light deflection, etc. does\nnot depend in general relativity directly on the past history of photon's propagation that is the effects of temporal variations of\nthe gravitational field (gravitational waves) do not accumulate. On the other hand, the past history of the isolated system can\n\n\f31\naffect the propagation of light ray, at least in principle, through the tails of the gravitational waves which contribute to the present\nvalue of multipole moments of the system as shown in equations (12), (13).\nWe would like to point out that if an electromagentic wave propagated through a dispersive medium, the physical speed\nof light would be different from the speed of gravity. In such case the effects of the temporal variations of the gravitational\nfield can do accumulate and the motion of the electromagnetic signal depends on its past history. This effect was studied by\nBertotti and Catenacci [129] in order to set an upper limit on the light scintillations caused by the stochastic gravitational wave\nbackground. They concluded that such a limit is not very interesting but it might be a good time now to reconsider this conclusion\nin application to the more advanced level of observational technologies..\nV.\n\nGRAVITATIONAL PERTURBATIONS OF THE LIGHT RAY\nA. Relativistic perturbation of the electromagnetic eikonal\n\nPerturbation of eikonal (phase) of electromagnetic signal propagating from the point x0 to the point x are obtained by solving\nequation (38). This solution is found by integrating the metric tensor perturbation along the light-ray trajectory and can be\nwritten down in the linearized approximation as an algebraic sum of three separate terms\n\nψ = ψ(G) + ψ(M) + ψ(S) ,\n\n(1)\n\nwhere ψ(G) represents the gauge-dependent part of the eikonal, and ψ(M) , ψ(S) are eikonal's perturbations caused by the mass and\nspin multipole moments correspondingly. Their explicit expressions are as follows\n\nψ(G) = (ki φ i − φ 0 ) + (ki wi − w0 ) ,\nψ(M)\n\n(2)\n\n\u0015\n\u0010\n∞ l−1\n(−1)l+p\np\u0011\nM (t − r) [−1]\n+2∑ ∑\n= 2\nCl (l − p, p) 1 −\nr\nl!\nl\nl=2 p=0\n\n\n[−1]\n\n\u0013\n(p)\n\u0012\nIAl (t − r)\np\n\n×\n1+\nk<a1 ...a p ∂ˆa p+1 ...al > \n\nl−1\nr\n\n\u0014\n\n−\n\n\n\n2p\nk<a1 ...a p−1 ∂ˆa p ...al−1 > \nl−1\n\n(p)\nki IiAl−1 (t − r)\n\nr\n\n∞ l−1\n\n[−1] \n\n\n\n\n\n\n(−1)l+p l\nCl−1 (l − p − 1, p)\n∑\nl=2 p=0 (l + 1)!\n\n[−1]\n(p)\n\u0013\n\u0012\nki εiba SbAl−1 (t − r)\np\n\nk<a1 ...a p ∂ˆa p+1 ...al−1> \n,\n× 1−\nl−1\nr\n\nψ(S) = 2εabi ka S b ∂ˆi ln (r − τ ) + 4∂ˆa ∑\n\n(3)\n\n(4)\n\nwhere H(p − q) is the Heaviside function defined by the expression (21), Cl (p, q) are the polynomial coefficient given by\nequation (20) and F (p) (t − r) denotes ∂ p F(t − r)/∂ t p where r is considered as constant.\nWe note that the gauge-dependent part of the eikonal, ψ(G) , contains combination of terms ki φ i − φ 0 defined by equations\n(71)–(73) which can be, in principle, eliminated with an appropriate choice of the gravitational field gauge functions w0 and wi .\nHowever, such a procedure will introduce a reference frame in the sky with a coordinate grid being dependent on the direction\nto the source of light rays that is, to the direcion of the unit vector ki . The coordinate frame obtained in this way will have\nthe direction-dependent distortions which can change as time goes on because of the proper motion of stars. For this reason\nthe elimination of functions φ 0 and φ i from equation (2) may be not practically justified. The ADM-harmonic coordinate chart\nadmits a more straightforward treatment of observable relativistic effects. Thus, we leave the gauge functions φ 0 and φ i in\nequation (2) along with the gauge functions w0 and wi that are defined by formulas (66), (67).\nExpressions (3), (4) for the eikonal contain derivatives from the retarded integrals of the mass- and spin-multipoles. After\ntaking the derivatives one can prove that the integrals from all high-order multipoles (l ≥ 2) are eliminated. Indeed, scrutiny\ninspection of equations (3), (4) elucidates that all the integrals from the multipole moments enter the equation in combination\nwith at least one derivative with respect to the impact parameter vector ξ i . Hence, the differentiation rule (12) is applied which\neliminates the integration.\n\n\f32\nThe only integral which must be performed, is that from the mass monopole in equation (3). It can be taken by parts as follows\n\u0014\n\nM (t − r)\nr\n\n\u0015[−1]\n\n= −M (t − r) ln(r − τ ) +\n\nZ y\n\n−∞\n\nM ̇(t ∗ + ζ ) ln ζ d ζ ,\n\n(5)\n\nwhere M ̇ ≡ ∂ M /∂ t ∗ . If one assumes that the mass M is constant, then the second term in the right side of equation (5)\nvanishes and the eikonal does not contain any integral dependence on the past history of the light propagation. This assumption\nis usually implied, for example, in the theory of gravitational lensing [71–73] and other applications of the relativistic theory of\nlight propagation. Here, we extend our approach to take into account the case of time-dependent mass of the isolated system,\nM ̇ 6= 0. The mass may change because stars are losing mass in the form of the stellar wind. We shall not consider this case but\nfocus on another process of the lost of mass by the isolated system due to the emission of gravitational radiation. The rate of the\nmass loss is, then, given by [1, 2]\n\u0001\n1 (3)\n(3)\nM ̇(t) = − 7 Ii j (t)Ii j (t) + O c−9 ,\nc\n\n(6)\n\n\u0001\n(3)\nwhere Ii j represents a third time derivative from the mass quadrupole moment and terms of order O c−9 describe contribution\nof higher-order mass and spin multipoles which we neglect here. Making use of equation (6) in (5) yields\n\u0014\n\nM (t − r)\nr\n\n\u0015[−1]\n\n= −M (t − r) ln(r − τ )\n−\n\n1\nc7\n\nZ y\n\n−∞\n\n(7)\n\n\u0001\n(3)\n(3)\nIi j (t ∗ + ζ )Ii j (t ∗ + ζ ) ln ζ d ζ + O c−9 .\n\nIt is instructive to evaluate contribution of the second term in the right side of equation (5) in the case of light propagating\nin gravitational field of a binary system consisting of two stars with masses m1 and m2 orbiting each other on a circular orbit.\nThe total mass M of the system is defined in accordance with equation (10) (for l = 0) which takes into account the first\npost-Newtonian correction\nM (t) = m1 + m2 −\n\n\u0001\n1 μM\n+ O c−4 ,\n2\n2c a(t)\n\n(8)\n\nwhere μ = m1 m2 /M is the reduced mass of the system and a = a(t) is the orbital radius of the system. Assuming that the lost\nof the orbital energy is due to the emission of gravitational waves from the system in accordance with the quadrupole formula\napproximation (6), the time evolution of the orbital radius is defined by equation [1, 2]\nȧ = −\n\n64 μ M 2\n.\n5c5 a3\n\n(9)\n\nIt has a simple solution [2]\n\u0010\nτ \u00111/4\n,\na(t) = a0 1 −\nT\nT =\n\n5c5 a40\n,\n256 μ M 2\n\n(10)\n(11)\n\nwhere τ = t − t ∗, t ∗ is the time of the closest approach of light ray to the binary system, a0 = a(t ∗ ) is the orbital radius of the\nbinary system at the time of the closest approach, and T is the spiral time of the binary. The lost of the total mass due to the\nemission of the gravitational waves is\n1 μM \u0010\nτ \u0011−5/4\nM ̇ = − 2\n1−\n.\n8c a0 T\nT\n\n(12)\n\nSubstituting equation (12) to the right side of equation (5) and performing integration yields\n1 μM\nM ̇(t ∗ + ζ ) ln ζ d ζ = − 2\nln(r − τ )\n2 c a(s)\n−∞\n( \u0014\n\u0015\n\u0014\n\u0015)\n1 m1 m2\na(s) − a0\na(s)\n+ 2 arctan\nln\n,\n+\n2 c2 a 0\na(s) + a0\na0\n\nZ y\n\n(13)\n\n\f33\nwhere a(s) ≡ a(t − r) denotes the orbital radius of the binary system taken at the retarded time s = t − r. Putting all terms in\nequations (5), (8), (13) together yields\n( \u0014\n\u0015\n\u0015\n\u0014\n\u0015)\n\u0014\na(s) − a0\na(s)\nM (t − r) [−1]\n1 m1 m2\n= −(m1 + m2 ) ln(r − τ ) +\nln\n+ 2 arctan\n,\n(14)\nr\n2 c2 a 0\na(s) + a0\na0\nwhere the first term in the right side of this equation is the standard Shapiro time delay in the gravitational field of the binary system with constant total mass m1 + m2 , and the second term represents relativistic correction due to the emission of gravitational\nwaves by the system causing the overall loss of its orbital energy.\nEikonal describes propagation of a wave front of the electromagnetic wave. Light rays are orthogonal to the wave front and\ntheir trajectories can be easily calculated as soon as the eikonal is known. In the present chapter we do not use this technique\nand obtain solution for the light rays directly from the light-ray geodesic equations that gives identical results.\nB. Relativistic perturbation of the coordinate velocity of light\n\nIntegration of the light-ray propagation equations (60) – (63) is fairly straightforward. Performing one integration of these\nequations with respect to time yields\nẋi (τ ) = ki + Ξ̇i (τ , ξ) ,\nΞ̇i (τ , ξ) = Ξ̇i (τ , ξ) + Ξ̇i (τ , ξ) + Ξ̇i (τ , ξ) ,\n(G)\n\n(M)\n\n(S)\n\nwhere the relativistic perturbations of photon's trajectory are given by\n\u0003\n\u0002\nΞ̇i (τ , ξ) = ∂ˆτ (φ i − ki φ 0 ) + (wi − ki w0 ) ,\n(G)\n\n\u0014 \u0015[−1]\nM\nˆ\nˆ\nΞ̇ (τ , ξ) = 2(∂i − ki ∂τ )\n(M)\nr\ni\n\n∞\n\nl\n\np\n\n(−1)l+p−q\nCl (l − p, p − q, q)H(2 − q)×\nl!\nl=2 p=0 q=0\n[−1]\n\n\u0013\u0012\n\u0013\n\u0012\n(p−q)\nI\n(t\n−\nr)\np−q\np−q\nA\n\n1−\nk<a1 ...a p ∂ˆa p+1 ...al > ∂ˆτq  l\n−\n1−\nl\nl−1\nr\n+ 2∂ˆi ∑\n\n∑∑\n\n\n\n(\u0012\n\u0013\n(p)\n\u0011\n\u0010\nI\n(t\n−\nr)\np\np\nA\n−\n2∑ ∑\n1+\nki<a1 ...a p ∂ˆa p+1 ...al >  l\nCl (l − p, p) 1 −\nl!\nl\nl\n−\n1\nr\nl=2 p=0\n\n)\n(p)\nI\n(t\n−\nr)\n2p\niAl−1\n ,\nk<a ...a ∂ˆa ...a > \nl − 1 1 p−1 p l−1\nr\n∞ l−1\n\n(−1)l+p\n\n(15)\n(16)\n\n(17)\n\n(18)\n\n\f34\n\u0014\n\u0015\nε jba Sb [−1]\nεiba Sb\nˆ\n− 2∂ˆa\n−\nΞ̇ (τ , ξ) = 2k j ∂ia\n(S)\nr\nr\ni\n\n(19)\n\n∞ l−1 p\n\n(−1)l+p−ql\nCl−1 (l − p − 1, p − q, q)H(2 − q)×\nl=2 p=0 q=0 (l + 1)!\n\n[−1]\n(p−q)\n\u0012\n\u0013\nS\n(t\n−\nr)\nε\njba\np−q\nbAl−1\n\n1−\nk<a1 ...a p ∂ˆa p+1 ...al−1> ∂ˆτq \n+\nl−1\nr\n\n∑∑\n\n4k j ∂ˆia ∑\n\n\u0011 ∞ l−1 (−1)l+p l\n\u0010\nCl−1 (l − p − 1, p)×\n4 ∂ˆa − ka∂ˆt ∗ ∑ ∑\nl=2 p=0 (l + 1)!\n\n\n(p)\n\u0012\n\u0013\nεiba SbAl−1 (t − r)\np\n+\n1−\nk<a1 ...a p ∂ˆa p+1 ...al−1 > \nl−1\nr\n\n\n\n(p+1)\nε jbal−1 SîbA (t − r)\n(−1)l+p l\nl−2\n.\n4k j ∑ ∑\nCl−1 (l − p − 1, p)k<a1 ...a p ∂ˆa p+1 ...al−1 > \nr\nl=2 p=0 (l + 1)!\n∞ l−1\n\nHere H(p − q) is a Heaviside function defined by the expression (21) and Cl (p, q) are the polynomial coefficients (20). The\ngauge functions are given in equations (66)–(69).\nMass monopole and spin dipole terms are written down in equations (18), (19) in symbolic form and after taking derivatives\nare simplified\n\u0012\n\u0013\n\u0014 \u0015[−1]\n2M ξ i\nM\ni\nˆ\nˆ\n=\n(20)\n−k ,\n2(∂i − ki ∂τ )\nr\nr\ny\n\u0015\n\u0013\n\u0014\n\u0012\nε jba Sb [−1]\nSb ξ i\nj\nˆ\nˆ\n2k j ∂ia\n.\n(21)\n= 2k ε jba ∂a\nr\nyr\nRemaining integrals shown in the right side of equations (18), (19) are convenient for presentation of the result of integration in\nthe symbolic form. The integration is actually not required because the integrals are always appear in combination with, at least,\none operator of a partial derivative ∂ˆi with respect to the impact parameter vector of the light ray. The derivative operator acts on\nthe integrals in accordance with equation (12) converting the integrals into functions of the retarded time y = τ − r(τ )\n(t − r)\n\n[−1]\n\n= IAl\n\nε jba SbAl−1 (t − r)\n\n[−1]\n\n= ε jba SbAl−1 (t ∗ + y)∂ˆi ln(−y) .\n\n\n\n\n\n∂ˆi \n\n∂ˆi \n\n(p−q)\n\nIAl\n\nr\n(p−q)\n\nr\n\n\n\n\n\n(p−q)\n\n(t ∗ + y)∂ˆi ln(−y) ,\n\n(22)\n\n(p−q)\n\n(23)\n\nWe conclude that at each point of the wave front of the electromagnetic wave the relativistic perturbation of the direction of\npropagation of light ray (wave vector) caused by the time-dependent gravitational field of the isolated system depends only on\nthe value of its multipole moments taken at the retarded instant of time and it does not depend on the past history of the light\npropagation.\nC. Perturbation of the light-ray trajectory\n\nIntegration of equation (15) with respect to time yields the relativistic perturbation of the trajectory of the light ray\nxi (τ ) = xiN + ∆ Ξi +∆ Ξi +∆ Ξi ,\n(G)\n\n(M)\n\n(24)\n\n(S)\n\nwhere\n∆ Ξi ≡ Ξi (τ , ξ) − Ξi (τ0 , ξ) ,\n(G)\n\n(G)\n\n(G)\n\n∆ Ξi ≡ Ξi (τ , ξ) − Ξi (τ0 , ξ) ,\n(M)\n\n(M)\n\n(M)\n\n∆ Ξi ≡ Ξi (τ , ξ) − Ξi (τ0 , ξ) .\n(S)\n\n(S)\n\n(S)\n\n(25)\n\n\f35\nHere, the term\nΞi (τ , ξ) = (φ i − ki φ 0 ) + (wi − ki w0 ) ,\n(G)\n\n(26)\n\nis the gauge-dependent part of the trajectory's perturbation, and the physically meaningful perturbations due to the mass and\nspin multipoles\n\u0014 \u0015[−2]\nM\n+\nΞi (τ , ξ) = 2(∂ˆi − ki ∂ˆτ )\n(M)\nr\n∞\n\n(27)\n\np\n\nl\n\n(−1)l+p−q\nCl (l − p, p − q, q)H(2 − q)×\nl!\nl=2 p=0 q=0\n[−2]\n\n\u0012\n\u0013\u0012\n\u0013\n(p−q)\nIAl\n(t − r)\np−q\np−q\nq\n\n1−\n1−\nk<a1 ...a p ∂ˆa p+1 ...al > ∂ˆτ \n−\nl\nl−1\nr\n\n2∂ˆi ∑\n\n∑∑\n\n∞ l−1\n\n2∑\n\n∑\n\n(−1)l+p\nl!\n\nl=2 p=0\n\n\n[−1]\n(\u0012\n\u0013\n(p)\n\u0010\n\u0011\nI\n(t\n−\nr)\np\np\nA\n\n−\nCl (l − p, p) 1 −\n1+\nki<a1 ...a p ∂ˆa p+1 ...al >  l\nl\nl−1\nr\n\n\n[−1] )\n(p)\nIiAl−1 (t − r)\n2p\n\n,\nk<a1 ...a p−1 ∂ˆa p ...al−1 > \nl−1\nr\nΞi (τ , ξ) = 2k j ∂ˆia\n(S)\n\n\u0014\n\nε jba Sb\nr\n\n\u0015[−2]\n\n∞ l−1 p\n\n\u0014\n\u0015\nεiba Sb [−1]\n− 2∂ˆa\n−\nr\n\n(28)\n\n(−1)l+p−q l\nCl−1 (l − p − 1, p − q, q)H(2 − q)×\nl=2 p=0 q=0 (l + 1)!\n[−2]\n\n(p−q)\n\u0013\n\u0012\nε jba SbAl−1 (t − r)\np−q\nq\n\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτ \n+\n1−\nl−1\nr\n\n4k j ∂ˆia ∑\n\n∑∑\n\n\u0010\n\u0011 ∞ l−1 (−1)l+p l\n4 ∂ˆa − ka ∂ˆt ∗ ∑ ∑\nCl−1 (l − p − 1, p)×\nl=2 p=0 (l + 1)!\n\n[−1]\n(p)\n\u0012\n\u0013\nεiba SbAl−1 (t − r)\np\n\n1−\n+\nk<a1 ...a p ∂ˆa p+1 ...al−1 > \nl−1\nr\n\n\n[−1]\n(p+1)\nε jbal−1 SîbA (t − r)\n(−1)l+p l\nl−2\n\nCl−1 (l − p − 1, p)k<a1 ...a p ∂ˆa p+1 ...al−1 > \n.\n4k j ∑ ∑\nr\nl=2 p=0 (l + 1)!\n∞ l−1\n\nHere, again H(p − q) is a Heaviside function defined by equation (21) and Cl (p, q) are the polynomial coefficients (20).\nRelativistic perturbations (27), (28) contain two types of integrals along the light ray which symbolic form is [F(s)/r][−1]\nand [F(s)/r][−2] where s = t − r is the retarded time. In section IV we have shown that taking a derivative from an integral\n[F(s)/r][−1] reduces the integral to an ordinary function of the retarded time s with no integral dependence on the past history\nof the propagation of light ray. In order to eliminate the integration in integrals [F(s)/r][−2] one needs to take three or more\nderivatives. One can notice that in (27), (28) there are terms with the summation index p = l − 1 or p = l in which the number\nof the derivatives is less than three that is not sufficient to eliminate the integrals. However, all such integrals are multiplied with\na numerical coefficients like 1 − p/l, etc. which gets nil for those values of the summation index p. It effectively eliminates all\nthe integrals in (27), (28) in which the integration cannot be eliminated by the partial derivatives. As an example let us examine\nh\ni[−2]\n(p−q)\nequation (27) for Ξi (τ , ξ). In this expression the term with the double integral I\n(s)/r\nhas l − p + 1 derivatives ∂ˆa and\n(M)\n\nAl\n\nh\ni[−2]\n(p−q)\n(s)/r\ncan contain the explicit\nq derivatives ∂ˆτ . After performing the differentiation, the expression ∂ˆ<a1 ...al−p+1> ∂ˆτq IAl\n\n\f36\nintegrals in the following cases: q = 0 and p = l − 1; q = 0 and p = l; q = 1 and p = l. However, these integrals are multiplied\nwith [1 − (p − q)/l][1 − (p − q)/(l − 1)] and in any case of p and q values mentioned above either the factor 1 − (p − q)/l or\n1 − (p − q)/(l − 1) will vanish. Similar reasoning is applied to the spin-dependent perturbation Ξi (τ , ξ) which shows that there\n(S)\n\nis no need to explicitly integrate the spin multipole moments in order to calculate the perturbation of light ray trajectory.\nThe only integral dependence of the light-ray trajectory perturbation depending on the past history of the propagating photon\nremains in equation (26) which contains the gauge functions φ α and wα used later in this chapter for interpretation of observable\neffects caused by the gravitational waves from the isolated system. The past-history dependence of the light-ray trajectory may\ncome into play also through the integrals from mass monopole and spin-dipole terms: [M /r][−2] and [S /r][−2] , if mass and/or\nspin of the isolated system are not conserved and change as time passes on. The non-conservation can be caused, for example,\nby emission of gravitational waves carrying away the orbital energy and angular momentum of the system. The past-history\ncontribution of these integrals can be calculated similarly to the eikonal perturbation considered in equations (6)–(14).\nSolution of the light-ray equation with the initial-boundary conditions (18) depends on the unit vector k defining direction\nof the light-ray propagation extrapolated backward in time to the past null infinity. In real practice the light ray is emitted at\nthe point x0 where the source of light is located at time t0 , and it arrives to observer at time t to the point x separated from the\nsource of light by a finite coordinate distance R = |x − x0 |. Therefore, solution of the light-ray equations must be expressed in\nthis case in terms of the integrals of the boundary-value problem. It is formulated in terms of the coordinates of the initial, x0 ,\nand the final, x, positions of the photon\nx(t) = x ,\n\nx(t0 ) = x0 ,\n\n(29)\n\nand a unit vector\nKi = −\n\nxi − xi0\n,\n|x − x0|\n\n(30)\n\nthat defines a coordinate direction from the observer towards the source of light and can be interpreted as a unit vector in the\nEuclidean space in the sense that δi j K i K j = 1.\nIn what follows it is convenient to make use of the astronomical coordinates x ≡ xi = (x1 , x2 , x3 ) based on a triad of the\nEuclidean unit vectors (I0 , J0 , K0 ) as shown in Fig. 2. Vector K0 points from observer towards the isolated system emitting\ngravitational waves and deflecting light rays. Vectors I0 and J0 lie in the plane being orthogonal to vector K0 . The unit vector\nI0 is directed to the east, and that J0 points towards the north celestial pole . The origin of the coordinate system is chosen to lie\nat the center of mass of the isolated system.\nWe will need in our discussion an another reference frame based on a triad of the Euclidean unit vectors (I, J, K) that are\nturned at some angle with respect to vectors (I0 , J0 , K0 ). Vector K points from the observer towards the source of light, and\nvectors I and J lie in the plane of the sky defined to be orthogonal to vector K. Mutual orientation of the triads is defined by\nthe orthogonal transformation (rigid rotation)\nI0 = I cos Ω + J sin Ω ,\nJ0 = −I cos θ sin Ω + J cos θ cosΩ + K sin θ ,\nK0 = I sin θ sin Ω − J sin θ cos Ω + K cos θ ,\n\n(31)\n(32)\n(33)\n\nwhere the rotational angles, Ω and θ , are constant.\nIt is rather straightforward to obtain solution of the boundary value problem (29) for light propagation in terms of the unit\nvector K instead of the unit vector k of the initial-boundary value problem. All what we need, is to convert the unit vector k to\nK written in terms of spatial coordinates of the points of emission, x0 , and observation, x, of the light ray. From formula (24)\none has\nki = −K i − β i (τ , ξ) ,\n\n(34)\n\nwhere the relativistic correction β i (τ , ξ) to the vector K i is derived from the solution of the initial-boundary value problem, It is\nexplicitly defined as follows\n\u0015\n\u0014\nj\nj\nj\ni\nP j ∆ Ξ +∆ Ξ +∆ Ξ\n(G)\n(M)\n(S)\nβ i (τ , ξ) =\n,\n(35)\n|x − x0|\nwith Pij = δ ij − ki k j being the operator of projection on the plane being orthogonal to vector ki . Denominator of equation (35)\ncontains the distance R = |x − x0 | between observer and source of light which can be very large, thus, making an impression\nthat the relativistic correction β i (τ , ξ) is probably negligibly small. However, the difference ∆Ξ j (τ , ξ) in the numerator of (35)\n\n\f37\nis proportional either to the distance r = |x| between the observer and the isolated system or to the distance r0 = |x0 | between\nthe source of light and the isolated system. Either one of them or both distances can be comparable with R so that the relativistic\ncorrection β i (τ , ξ) cannot be neglected in general case, and must be taken into account for calculation of relativistic perturbations\nof light-ray trajectory. Only in a case where observer and source of light reside at extremely large distances on opposite sides of\nthe source of gravitational waves can the relativistic correction β i be neglected.\nVI.\n\nOBSERVABLE RELATIVISTIC EFFECTS\n\nIn this section we derive general expressions for four observable relativistic effects – the time delay, the light bending, the\nfrequency shift, and the rotation of the polarization plane.\nA. Gravitational time delay of light\n\nRelativistic time delay for light propagating through time-dependent gravitational field can be obtained either directly from\nexpression (24) or from the electromagnetic eikonal (35), (1) by observing that the eikonal is constant not only on the null\nhypersurface of the wave front of electromagnetic wave but also along the light rays citepfrolov. Both derivations lead, of\ncourse, to the same result\nt − t0 = |x − x0| + ∆(τ , τ0 ) ,\n∆(τ , τ0 ) = ∆ (τ , τ0 ) + ∆ (τ , τ0 ) + ∆ (τ , τ0 ) ,\n(G)\n\n(M)\n\n(S)\n\n(1)\n(2)\n\nwhere xα0 = (t0 , x0 ) are four-coordinates of the point of emission of light, xα = (t, x) are four-coordinates of the point of\nobservation, ∆ (τ , τ0 ), ∆ (τ , τ0 ) and ∆ (τ , τ0 ) are functions describing correspondingly the delay of the electromagnetic signal\n(G)\n\n(M)\n\n(S)\n\ndue to the gauge-freedom, mass and spin multipoles of the gravitational field of the isolated system. These functions are\nexpressed as follows\n\u0014\n\u0015\ni\ni\n(3)\n∆ (τ , τ0 ) = −ki Ξ (τ , ξ) − Ξ (τ0 , ξ) ,\n(G)\n(G)\n(G)\n\u0015\n\u0014\n(4)\n∆ (τ , τ0 ) = −ki Ξi (τ , ξ) − Ξi (τ0 , ξ) ,\n(M)\n(M)\n(M)\n\u0014\n\u0015\n∆ (τ , τ0 ) = −ki Ξi (τ , ξ) − Ξi (τ0 , ξ) .\n(5)\n(S)\n\n(S)\n\n(S)\n\nThere exists a relation between the relativistic perturbations of the eikonal and the light-ray trajectory\n\nψ (τ , ξ) = −ki Ξi (τ , ξ) ,\n\n(6)\n\nwhere the eikonal perturbation, ψ , reads off the equations (1)–(4). From equations (3)–(5) one can infer that in the linear\napproximation the functions describing the time delay are just the projections of vector functions describing the coordinate\nperturbation of the light-ray trajectory onto the unperturbed direction ki from the source of light to the observer.\nEquation (1) defines the light time delay effect in the global time t of the ADM-harmonic reference frame. In order to convert\nit to observable proper time T of the observer, we assume for simplicity that the observer is in a state of free fall and moves with\nvelocity V i with respect to the reference frame of the isolated system. Transformation from the ADM-harmonic coordinate time\nt to the proper time T is made with the help of the standard formula [1, 2]\ndT 2 = −gαβ dxα dxβ .\n\n(7)\n\nSubstituting the metric tensor expansion gαβ = ηαβ + hαβ , where hαβ is given by equations (21)–(24), to equation (7) yields\nq\ndT\ni j\n=\n1 − V 2 − h00 (1 + V 2 ) − 2h0iV i − hTT\nij V V .\ndt\n\n(8)\n\nIn the most simple case, when observer is at rest (V = 0) with respect to the ADM-harmonic reference frame equation (8) is\ndrastically simplified and depends only on h00 component of the metric tensor. Implementation of formula (21) for h00 and\nsubsequent integration of (8) with respect to time yields then\n\n\f38\nT =\n\n\u0013\n\u0012\nM\n(t − ti ) ,\n1−\nr\n\n(9)\n\nwhere ti is the initial epoch of observation. Another simple case of equation (8) is obtained for observer located at the distance\nr so large that one can neglect h00 and h0i quasi-static perturbations of the metric tensor. Then, the difference between the\nobserver's proper time T and coordinate time t is\n\nleading in the case of a small velocity to\n\nq\ndT\n1 − V 2 − hTi jT V iV j ,\n=\ndt\nZ t\np\nV iV j\n2\n√\nhTi jT dt .\nT =\n1 − V (t − ti ) −\n1 − V 2 ti\n\n(10)\n\n(11)\n\nThe last term in the right side of this equation describes the effect of the gravitational waves on the rate of the proper time of\nobserver which may be important under some specific circumstances but is enormously small in real practice and, as a rule, can\nbe neglected. Nonetheless, it would be interesting to study this effect in more detail as a possible tool to detect gravitational\nwaves emitted, for example, in galactic supernova explosions or by powerful gamma-ray bursts (GRB) in distant galaxies.\n\nB. Gravitational deflection of light\n\nThe coordinate direction to a source of light measured at the point of observation x is defined by the spatial components of\nfour-vector of photon l α incoming to an observer from the source of light. This vector depends on the energy (frequency) of\nphoton which is irrelevant for the present section. Normalization of l α to its frequency eliminates the frequency-dependence and\nbrings about a four-vector pα = (1, pi ) where pi = −ẋi and the dot denotes derivative with respect to coordinate time t. Vector\nφ a is null, pα pα = 0, and is only direction-dependent. The spatial part of this vector can be presented as a small deviation from\nthe direction ki of the unperturbed photon's trajectory\npi = −ki − Ξ̇i ,\n\n(12)\n\nwhere the minus sign indicates that the tangent vector pi is directed from the observer to the source of light.\nThe coordinate direction pi is not a directly observable quantity as it is defined with respect to the chosen coordinate grid on\nthe curved spacetime manifold. A real observable vector towards the source of light, sα = (1, si ), is defined with respect to the\nlocal inertial frame co-moving with the observer [130]. In this frame si = −dX i /dT , where T is the observer's proper time, and\nX i are the spatial coordinates of the local inertial frame with the observer at its origin. We shall assume for simplicity that the\nobserver is at rest with respect to the global ADM-harmonic coordinates (t, xi ). The case of an observer moving with respect to\nthe ADM-harmonic system with velocity V i can be treated with the help of the Lorentz transformation which is a straightforward\nprocedure so that we do not discuss it. In case of a static observer, transformation from the global ADM-harmonic coordinates\n(t, xi ) to the local coordinates (T, X i ) is given by the formulas\ndT = Λ00 dt + Λ0j dx j\n\n,\n\ndX i = Λi0 dt + Λi j dx j ,\n\n(13)\n\nwhere the matrix of transformation Λβα is defined by the requirements of orthonormality\nμ\n\ngαβ = ημν Λ α Λνβ .\n\n(14)\n\nIn particular, the orthonormality condition (14) assumes that the spatial angles and lengths at the point of observations are\nmeasured with the Euclidean metric δi j . Because the vector sα is null (sα sα = 0) with respect to the Minkowski metric ηαβ , we\nconclude that the Euclidean length, |s|, of vector si is equal to 1. Indeed, one has\n\nηαβ sα sβ = −1 + s2 = 0 .\n\n(15)\n\nHence, |s| = 1.\nIn the linear approximation with respect to the universal gravitational constant G, the matrix of the transformation is as follows\n[69, 70]\n\n\f39\n1\nΛ00 = 1 − h00 (t, x) ,\n2\nΛ0i = −h0i (t, x) ,\nΛi0 = 0 ,\n\u0014\n\u0015\n1\n1\ni\nΛ j = 1 + h00 (t, x) δi j + hTi jT (t, x) .\n2\n2\n\n(16)\n\nUsing transformation (13) we obtain relationship between the observable vector si and the coordinate direction pi\nsi = −\n\nΛi0 − Λi j p j\n\nΛ00 − Λ0j p j\n\n.\n\n(17)\n\nIn the linear approximation this takes the form\nsi =\n\n\u0001\n1\n1 + h00 − h0 j p j pi + hTi jT p j .\n2\n\n(18)\n\nRemembering that vector |s| = 1, we find the Euclidean norm of the vector pi from the relationship\n1\n|p| = 1 − h00 + h0 j p j − hTi jT pi p j ,\n2\n\n(19)\n\n1\nsi = mi + Pi j mq hTjqT (t, x) ,\n2\n\n(20)\n\nwhich brings equation (18) to the form\n\nwhere Pi j = δ i j − ki k j is the operator of projection onto the plane being orthogonal to ki , and the Euclidean unit vector mi =\npi /|p|.\nLet us now denote by α i the dimensionless vector describing the total angle of deflection of the light ray measured at the point\nof observation, and calculated with respect to vector ki given at past null infinity. It is defined according to [74]\n\nα i (τ , ξ) = ki k * Ξ̇(τ , ξ) − Ξ̇i (τ , ξ) ,\n\n(21)\n\nα i (τ , ξ) = − Pij Ξ̇ j (τ , ξ) .\n\n(22)\n\nor\n\nAs a consequence of definitions (12) and (22), we conclude that\nmi = −ki + α i (τ , ξ) .\n\n(23)\n\nAccounting for expressions (20), (23), and (34) we obtain the observed direction to the source of light\nsi (τ , ξ) = K i + α i (τ , ξ) + β i (τ , ξ) + γ i (τ , ξ) ,\n\n(24)\n\nwhere the unit vector K i is given by equation (30), relativistic correction β i is defined by equation (35), and the perturbation\n1\nγ i (τ , ξ) = − Pi j kq hTjqT (t, x)\n2\n\n(25)\n\ndescribes a deformation of the local coordinates of observer with respect to the global ADM-harmonic frame caused by the\ntransverse-traceless part of the gravitational field of the isolated system at the point of observation.\nLet two sources of light (quasars, stars, etc.) be observed along the directions s1 and s2 corresponding to two different light\nrays passing near the isolated gravitating system at the minimal distances corresponding to the (vector) impact parameters, ξ1\nand ξ2 . The angle Ψ between them, measured in the local inertial frame is\ncos Ψ = s1 * s2 ,\n\n(26)\n\nwhere the dot between the two vectors denotes the usual Euclidean scalar product. It is worth emphasizing that the observed\ndirection si to each source of light includes relativistic deflection of the light ray in the form of three perturbations. Two of them,\nα i and γ i , depend only on the quantities taken at the point of observation, but β i , according to equation (35), is also sensitive to\n\n\f40\nthe strength of the gravitational field taken at the point of emission of light. This remark reveals that according to relation (24)\na single gravitational wave signal may cause different angular displacements and/or time delays for different sources of light\nlocated at different distances from the source of gravitational waves even if the directions to the light sources are the same.\nWithout going into further details of the observational procedure we give an explicit expression for the total angle of the light\ndeflection α i . We have\n\nα i (τ , ξ) = α i (τ , ξ) + α i (τ , ξ) + α i (τ , ξ) ,\n(G)\n\n(M)\n\n(S)\n\n(27)\n\nwhere\n\u0001\nα i (τ , ξ) = −Pi j ∂ˆτ φ j + w j ,\n(G)\n\nα i (τ , ξ) = −\n\n(M)\n\n2M ξ i\nr y\n∞\n\n(28)\n(29)\n\np\n\nl\n\n(−1)l+p−q\nCl (l − p, p − q, q)H(2 − q) ×\nl!\nl=2 p=0 q=0\n[−1]\n\n\u0012\n\u0013\u0012\n\u0013\n(p−q)\nI\n(t\n−\nr)\np−q\np−q\nA\n\n1−\n1−\nk<a1 ...a p ∂ˆa p+1 ...al > ∂ˆτq  l\nl\nl−1\nr\n−2∂ˆi ∑\n\n∑∑\n\n∞ l−1\n\n(−1)l+p\nCl−2 (l − p − 1, p − 1) ×\nl!\nl=2 p=0\n\n\n(p)\nI jAl−1 (t − r)\n,\nk<a1 ...a p−1 ∂ˆa p ...al−1 > \nr\n\u0012\n\u0013\nε jba Sb\nSb ξ i\nα i (τ , ξ) = −2k j ε jba ∂ˆa\n+ 2Pi j ∂ˆa\n(S)\nyr\nr\n−4Pi j ∑\n\n∑\n\n(30)\n\n∞ l−1 p\n\n(−1)l+p−ql\nCl−1 (l − p − 1, p − q, q)H(2 − q) ×\nl=2 p=0 q=0 (l + 1)!\n[−1]\n\n(p−q)\n\u0013\n\u0012\njε\nS\n(t\n−\nr)\nk\njba\np−q\nbA\nl−1\n\nk<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτq \n1−\nl−1\nr\n+4∂ˆia ∑\n\n∑∑\n\n\u0010\n\u0011 ∞ l−1 (−1)l+p l\n−4 ∂ˆa − ka ∂ˆt ∗ ∑ ∑\nCl−2 (l − p − 2, p) ×\nl=2 p=0 (l + 1)!\n\n\n(p)\nSbAl−1 (t − r)\nε\njba\n\nk<a1 ...a p ∂ˆa p+1 ...al−1 > Pi j\nr\n∞ l−1\n\n(−1)l+p l\nCl−1 (l − p − 1, p)×\nl=2 p=0 (l + 1)!\n\n\n(p+1)\nPiq k j ε jbal−1 SqbAl−2 (t − r)\n.\nk<a1 ...a p ∂ˆa p+1 ...al−1 > \nr\n−4 ∑\n\n∑\n\nThese expressions do not contain any explicit integration along the light ray trajectory because all explicit integrals are either\neliminated after taking partial derivatives with respect to the upper limit of the integrals or they are vanish because the numerical\ncoefficient in front of them become nil.\nC. Gravitational shift of frequency\n\nExact calculation of the gravitational shift of frequency of electromagnetic wave travelling from the point of emission to observer plays a crucial role for the adequate interpretation of spectral astronomical investigations of high resolution including the\n\n\f41\nastronomical measurements of radial velocities of stars [131], anisotropy of cosmic microwave background radiation (CMBR),\nand others. In the last decade the technique for measuring the radial velocity of stars had reached an unprecedented precision of\n1 m/sec [132, 133]. At this level the post-Newtonian effects in the orbital motion of spectroscopic binary stars can be measured\n[134, 135]. Gravitational shift of frequency of light affect the apparent brightness of the observed sources according to equation (125). Therefore, it can be important in highly accurate photometric measurements of faint radio sources with large radio\ntelescope like SKA [136]\nLet a source of light move with respect to the ADM-harmonic coordinate frame (t, xi ) with velocity V0 = ẋ0 (t0 ) and emit\ncontinuous electromagnetic radiation at frequency ν0 = 1/(δ T0 ), where t0 and T0 are the coordinate and proper time of the\nsource of light, respectively. We denote by ν = 1/(δ T ) the observed frequency of the electromagnetic radiation measured at\nthe point of observation by an observer moving with velocity V = ẋ(t) with respect to the ADM-harmonic coordinate frame.\nIn the geometric optics approximation we can consider the increments of the proper time, δ T0 and δ T , as infinitesimally small\nwhich allows us to operate with them as with differentials [69, 70]. Time delay equation (1) can be considered as an implicit\nfunction of the emission time t0 = t0 (t) having the time of observation t as its argument. Because the coordinate and proper\ntime at the points of emission of light and its observation are connected through the metric tensor we conclude that the observed\ngravitational shift of frequency 1 + z = ν /ν0 can be defined through the consecutive differentiation of the proper time of the\nsource of light, T0 , with respect to the proper time of the observer, T , [69, 70]\n1+z =\n\ndT0 dt0 dt\ndT0\n=\n.\ndT\ndt0 dt dT\n\n(31)\n\nSynge calls relation (31) the Doppler effect in terms of frequency [137, p. 122]. It is fully consistent with the definition of the\nDoppler shift in terms of energy [137, p. 231] when one compares the energy of photon at the points of emission and observation\nof light. The Doppler shift in terms of energy is given by\n1+z =\n\nν\nlα uα\n,\n=\nν0 l0α uα0\n\n(32)\n\nwhere uα0 , uα and l0α , lα are 4-velocities of the source of light and observer and 4-momenta of photon at the points of emission\nand observation respectively. It is quite easy to see that both mentioned formulations of the Doppler shift effect are equivalent.\nIndeed, taking into account that uα = dxα /dT and lα = ∂ φ /∂ xα , where φ is the phase of the electromagnetic wave (eikonal),\nwe obtain lα uα = d φ /dT , and l0α uα0 = d φ0 /dT0 respectively. Thus, equation (32) yields\n1+z =\n\nd φ dT0\n.\nd φ0 dT\n\n(33)\n\nThe phase of electromagnetic wave remains constant along the light ray trajectory. For this reason, d φ /d φ0 = 1 and, hence,\nequation (33) is reduced to equation (31) as expected on the ground of physical intuition. Detailed comparison of the two\ndefinitions of the Doppler shift and the proof of their identity in general theory of relativity is thoroughly discussed in [54, 138].\nWe emphasize that in equation (31) the time derivative\nh\ni1/2\ndT0\n= 1 − V02 − (1 + V02 )h00 (t0 , x0 ) − 2V0i h0i (t0 , x0 ) − V0iV0j hTi jT (t0 , x0 )\n,\n(34)\ndt0\n\nis taken at the time t0 at the point of emission of light x0 along the world line of the emitter of light while the time derivative\n\n\u0002\n\u0003−1/2\ndt\n,\n(35)\n= 1 − V 2 − (1 + V 2 )h00 (t, x) − 2V i h0i (t, x) − V iV j hTi jT (t, x)\ndT\nis calculated at the time of observation t at the position of observer x along the world line of the observer.\nThe time derivative dt0 /dt is taken along the light-ray trajectory and calculated from the time delay equation (1) where we\nhave to take into account that function ∆(τ , τ0 ) depends on times t0 and t indirectly through the retarded times s0 = t0 − r0 and\ns = t − r that are arguments of the multipole moments of the isolated system and wherein r0 ≡ |x0 | = |x(t0 )|, r = |x| = |x(t)| are\nfunctions of time t0 and t respectively. Function ∆(τ , τ0 ) also depends on the time of the closest approach of light ray, t ∗ , through\nvariables τ = t − t ∗ , τ0 = t0 − t ∗ , and on the unit vector k. Both t ∗ and k should be considered as parameters depending on t0 and\nt because of the relative motion of the observer with respect to the source of light which causes variation in the relative position\nof the source of light and observer and, consequently, to the corresponding change in the parameters characterizing trajectory of\nthe light ray, that is in t ∗ and k. Therefore, the function ∆(τ , τ0 ) must be viewed as parametrically-dependent on four variables\n∆ = ∆(s, s0 ,t ∗ , k). Accounting for these remarks the derivative along the light ray reads as follows\n\u001b\n\u001a\n∂s ∂\n∂ s0 ∂\n∂ t∗ ∂\n∂ ki ∂\n∆(s, s0 ,t ∗ , k)\n+\n1+K*V −\n+\n+\ndt0\n∂t ∂s\n∂ t ∂ s0\n∂ t ∂ t∗\n∂ t ∂ ki\n=\n\u001a\n\u001b\n,\n(36)\ndt\n∂s ∂\n∂ s0 ∂\n∂ t∗ ∂\n∂ ki ∂\n∗\n1 + K * V0 +\n∆(s, s0 ,t , k)\n+\n+\n+\n∂ t0 ∂ s ∂ t0 ∂ s0 ∂ t0 ∂ t ∗ ∂ t0 ∂ ki\n\n\f42\nwhere the unit vector K is defined in (30) and where we explicitly show the dependence of function ∆(τ , τ0 ) on all parameters\nwhich implicitly depend on time.\nThe time derivative of vector k is calculated using the approximation k = −K and formula (30) where the coordinates of the\nsource of light, x0 (t0 ), and of the observer, x(t), are considered as functions of time. These derivatives are\n\n∂ ki (k × (V × k))i\n=\n,\n∂t\nR\n\n(k × (V0 × k))i\n∂ ki\n=−\n,\n∂ t0\nR\n\n(37)\n\nwhere R = |x − x0| is the coordinate distance between the observer and the source of light.\nTime derivatives of the retarded times s and s0 with respect to t and t0 are calculated from their definitions, s = t − r and\ns0 = t0 − r0 , where we have to take into account that the spatial position of the point of observation is connected to the point\nof emission of light by the unperturbed trajectory of light, x = x0 + k (t − t0 ). More explicitly, we use for the calculations the\nfollowing relations\ns = t − |x0 (t0 ) + k (t − t0 )| ,\ns0 = t0 − |x0(t0 )| ,\n\n(38)\n(39)\n\nwhere the unit vector k = k(t,t0 ) must be also considered as a function of two arguments t, t0 with its derivatives given by\nequation (37). It is instructive to notice that relation (38) combines two characteristics of the null cone – the first one is related\nto the propagation of gravitational field from the isolated system to an observer, and the second one is related to the propagation\nof light from the source of light to the same observer. Equation (39) describes a null cone characteristic corresponding to the\npropagation of gravitational field from the isolated system to the point of emission of light. Calculation of the infinitesimal\nvariations of equations (38), (39) immediately gives a set of partial derivatives\n\n∂s\n= 1 − k * N − (k × V ) * (k × N ) ,\n∂t\n\n(40)\n\n∂s\n= (1 − k * V0)(k * N ) ,\n∂ t0\n\n(41)\n\n∂ s0\n= 1 − V0 * N0 ,\n∂ t0\n\n(42)\n\n∂ s0\n= 0,\n∂t\n\n(43)\n\nwhere N i = xi /r and N0i = xi0 /r0 are the unit vectors directed from the isolated system to the observer and to the source of light\nrespectively..\nTime derivatives of the parameter t ∗ = t0 − k * x0(t0 ), where again k = k(t,t0 ), read\nV0 * ξ\n∂ t∗\n= 1 − k * V0 +\n,\n∂ t0\nR\n\nV *ξ\n∂ t∗\n=−\n.\n∂t\nR\n\n(44)\n\nTerms of the order |ξ|/R in both formulas are produced by the time derivatives of vector k.\nIn what follows we shall restrict ourselves with a static case of an observer and a source of light, that is we shall assume\nvelocities V = V0 = 0. Taking into account this restriction in equations (37)–(44) we expand denominator of (36) leaving only\nthe linear with respect to the universal gravitational constant G terms. Reducing, then, similar terms allows us to simplify (36)\nto\nn∂\ndt0\n∂\n∂ o\n(45)\n= 1−\n+\n+ ∗ ∆(s, s0 ,t ∗ , k) .\ndt\n∂ s ∂ s0 ∂ t\n\nFunction ∆ = ∆(s, s0 ,t ∗ , k) is defined by (2) which (in the case of the static observer and the source of light) depends on the\nretarded times s, s0 and the time of the closest approach t ∗ through the arguments (see (6)) y = s − t ∗ , y0 = s0 − t ∗ , and t ∗ , that is\n∆(s, s0 ,t ∗ , k) ≡ ∆(y, y0 ,t ∗ ) = ψ (y,t ∗ ) − ψ (y0,t ∗ ) ,\n\n(46)\n\ndt0\n∂ ψ (y,t ∗ ) ∂ ψ (y0 ,t ∗ )\n+\n.\n= 1−\ndt\n∂ t∗\n∂ t∗\n\n(47)\n\nwhere ψ = −ki Ξ is the relativistic perturbation of the eikonal defined in (6). This particular dependence of ψ on its arguments\nmeans that the partial derivative of ψ (y,t ∗ ) with respect to y and and that of ψ (y0 ,t ∗ ) with respect to y0 vanish in (45) which is\nreduced to a simpler form\n\n\f43\nThe partial time derivative from ψ (y,t ∗ ) is found by differentiating relations (2)–(4)\n\n∂ ψ (y,t ∗ ) ∂ ψ(G) (y,t ∗ ) ∂ ψ(M) (y,t ∗ ) ∂ ψ(S) (y,t ∗ )\n=\n+\n+\n∂ t∗\n∂ t∗\n∂ t∗\n∂ t∗\n\n(48)\n\nwhere\ni\ni\n∂ ψ(G) (y,t ∗ )\n∂φ0\n∂ w0\ni ∂φ\ni∂w\n=\n(k\n−\n)\n+\n(k\n−\n),\n∂ t∗\n∂ t∗\n∂ t∗\n∂ t∗\n∂ t∗\n\n\u0010\n∞ l−1\n∂ ψ(M) (y,t ∗ )\n(−1)l+p\np\u0011\n=\n2\nC\n(l\n−\np,\np)\n1\n−\nl\n∑\n∑\n∂ t∗\nl!\nl\nl=2 p=0\n\n\n[−1]\n\n\u0013\n(p+1)\n\u0012\nIAl\n(t − r)\np\n\n1+\n×\nk<a1 ...a p ∂ˆa p+1 ...al > \n\nl−1\nr\n\n\n[−1] \n\n(p+1)\ni\n\nk IiAl−1 (t − r)\n2p\nˆ\n\n−\nk<a1 ...a p−1 ∂a p ...al−1 > \n\nl−1\nr\n\n\n∞ l−1\n∂ ψ(S) (y,t ∗ )\n(−1)l+p l\nˆa\n∂\n=\n4\nCl−1 (l − p − 1, p)\n∑\n∑\n∂ t∗\nl=2 p=0 (l + 1)!\n[−1]\n\n(p+1)\n\u0012\n\u0013\nki εiba SbAl−1 (t − r)\np\n\n× 1−\nk<a1 ...a p ∂ˆa p+1 ...al−1 > \n.\nl−1\nr\n\n(49)\n\n(50)\n\n(51)\n\nWhen deriving these equations we assumed that the time evolution of both the mass M and the angular momentum S i of the\nisolated system can be neglected. In opposite case, the right side of equations (50) and (51) would contain also time derivatives\nfrom the mass and the angular momentum. Partial derivative from function ψ (y0 ,t ∗ ) is obtained from equations (48)–(51) after\nreplacements y → y0 , t → t0 , and r → r0 . Equations (49)–(51) do not contain explicit integrals along the light ray trajectory\nbecause all of the explicit integrals vanish after taking the partial derivatives in these equations.\nFrequency shift, z, is given by equation (31). In case when both observer and source of light are at rest with respect to\nthe ADM-harmonic reference frame, the frequency (energy) of a photon propagating through the gravitational potential of the\nisolated astronomical system changes in accordance with\ns\n\u0014\n\u0015\nν\n1 − h00(t0 , x0 )\n∂ ψ (y,t ∗ ) ∂ ψ (y0 ,t ∗ )\n=\n1−\n,\n(52)\n+\nν0\n1 − h00(t, x)\n∂ t∗\n∂ t∗\nIn the linear with respect to G approximation, equation (52) is simplified\n\nδν\n∂ ψ (y,t ∗ ) ∂ ψ (y0 ,t ∗ )\n1\n1\n= h00 (t, x) − h00 (t0 , x0 ) −\n+\n,\nν0\n2\n2\n∂ t∗\n∂ t∗\n\n(53)\n\nwhere δ ν ≡ ν − ν0 . The time of the closest approach t ∗ enters equation (53) explicitly. At the first glance, the reader may think\nthat it must be known in order to calculate the gravitational shift of frequency. However, the partial derivative with respect to t ∗\nhave to be understood in the sense of equation (30) which makes it evident that the time derivative with respect to t ∗ taken on the\nlight-ray path is, in fact, the time derivative with respect to time t taken before the using of the light-ray trajectory substitution.\nThus, the gravitational shift of frequency is actually not sensitive to the time of the closest approach t ∗ , and can be recast to the\nform which is more suitable for practical applications,\n\nδν\n∂ ψ (t, x) ∂ ψ (t0 , x0 )\n1\n1\n= h00 (t, x) − h00 (t0 , x0 ) −\n+\n,\nν0\n2\n2\n∂t\n∂ t0\n\n(54)\n\nwhere ψ (t, x) and ψ (t0 , x0 ) are relativistic perturbations of the electromagnetic eikonal taken at the points of observation and\nemission of light respectively. These time derivatives are given by the same equations (48)–(51) after making use of (30).\nEquation (54) has been derived by making use of the definition (31). It is straightforward to prove that the definition (32) brings\nabout the same result. Indeed, in the case of the static observer and the source of light their 4-velocities are, uα = (dt/dT, 0, 0, 0)\n\n\f44\nand uα0 = (dt0 /dT0 , 0, 0, 0), and the wave vector lα = ω (kα + ∂α ψ ) (see equation (36)) where ω is a constant frequency of light\nwave which is conserved along the light ray because of the equation of the parallel transport (14). Substituting these relations to\n(32) leads immediately to equation (54) as expected.\nPhysical interpretation of the relativistic frequency shift given by equation (54) is straightforward although the calculation of\ndifferent components of the time derivatives from the eikonal are tedious. The first two terms in the left side of (54) reads\n1\nGM GM\n1\nh00 (t, x) − h00 (t0 , x0 ) =\n−\n,\n2\n2\nr\nr0\n\n(55)\n\nand represents the difference between the values of the spherically-symmetric part of the Newtonian gravitational potential of\nthe isolated system taken at the point of observation and emission of light. The time derivatives of the eikonal depending on the\nmass and spin multipole moments of the isolated system are given in (50), (51). Scrutiny examination of these equations reveal\nthat these components of the frequency shift depend on the first and higher order time derivatives of the multipole moments\nwhich vanish in the stationary case. The gravitational frequency shift contains the gauge-dependent contribution as well. This\ncontribution is given by equation (49) and can be calculated by making use of equations (66)–(69). The result is as follows\n\n\n\u0015\nl \u0014\nl I (−1) (t − r)\n∞\n∞\ni\n0\n(−1)  Al\n∂w\n∂w\n − ∑ (−1) IAl (t − r)\nki ∗ − ∗ = ki ∇i ∑\n(56)\n∂t\n∂t\nr\nr\n,Al\nl=2 l!\nl=2 l!\n,Al\n\n∞\n\n\"\n\n#\n\nk I ̇iAl−1 (t − r)\nr\n,Al−1\n\"\n#\ni\nl\n∞\n(−1) l k εiba SbAl−1 (t − r)\n+ 4∑\nr\nl=2 (l + 1)!\nl\n\n(−1)\nl=2 l!\n\n− 4∑\n\ni\n\n(57)\n\n,\n\n,aAl−1\n\nki\n\n\u0013\n\u0012\np\n∞ l\n(−1)l+p−q\np−q\n∂φi ∂φ0\n×\n−\n=\n−2\nC\n(l\n−\np,\np\n−\nq,\nq)\n1\n−\nl\n∑∑∑\n∂ t∗\n∂ t∗\nl!\nl\nl=2 p=1 q=1\n\n\n(\u0012\n\u0013\n(p−q+1)\nI\n(t\n−\nr)\np−q\nA\nq−1\n−\n1+\nk<a1 ...a p ∂ˆa p+1 ...al > ∂ˆτ  l\nl−1\nr\n)\n\ni I (p−q+1) (t − r)\nk\np−q\niAl−1\nq−1\n −\nk<a1 ...a p−1 ∂ˆa p ...al−1> ∂ˆτ \n2\nl−1\nr\n\n(58)\n\n∞ l−1 p\n\n(−1)l+p−ql\nCl−1 (l − p − 1, p − q, q)×\nl=2 p=1 q=1 (l + 1)!\n\n\n(p−q+1)\n\u0013\n\u0012\nki εiab SbAl−1 (t − r)\np−q\nq−1\n.\nk<a1 ...a p ∂ˆa p+1 ...al−1> ∂ˆτ \n1−\nl−1\nr\n4∂ˆa ∑\n\n∑∑\n\nTime derivatives ∂ˆt0∗ (ki wi − w0 ) and ∂ˆt0∗ (ki φ i − φ 0 ) can be obtained from equations (56), (58) after making replacements t → t0 ,\nr → r0 , and τ → τ0 .\nD. Gravity-induced rotation of the plane of polarization of light\n\nAny kind of axisymmetric gravitational field induces a relativistic effect of the rotation of the polarization plane of an electromagnetic wave propagating through this field. To some extent this effect is similar to Faraday's effect in electrodynamics [108].\nThe Faraday effect is caused by the presence of magnetic field along the trajectory of propagation of electromagnetic wave while\nthe gravity-induced rotation of the plane of polarization of light is caused by the presence of the, so-called, gravitomagnetic field\nassociated with the angular momentum and spin-type multipoles of the isolated system [139, 140]. This gravitomagnetic effect\nwas first discussed by Skrotskii ([119, 120] and a number of other researches [121, 122, 141–145]. Recently, we have studied\nthe Skrotskii effect caused by a spinning body moving arbitrarily fast and derived the Lorentz-invariant expression for this effect\n[146]. In the present chapter we further generalize the Skrotskii effect to the case of an isolated system emitting gravitational\nwaves of arbitrary multipolarity.\n\n\f45\nWe consider the parallel transport of the reference polarization tetrad eα(β ) defined by equations (84) along the light ray. We\nassume for simplicity that at the past null infinity the spatial vectors of the tetrad, e0(i) , coincide with the spatial unit vectors of\nthe coordinate tetrad defined by equation (80). The parallel transport of the tetrad along the light ray is defined by equation (96).\nWe are interested only in solving equation (96) for vectors eα(n) (n = 1, 2) that are used in description of polarization of light.\nThe propagation equation for the spatial components ei(n) can be written in the following form\n\u0015\n\u0014\nd\n1\nei(n) + hi j e p(n) + εi j p e j(n) Ω p = 0 ,\ndτ\n2\n\n(n = 1, 2.)\n\n(59)\n\nwhere the angular velocity vector\n1\nΩi = − εi j p ∂ j (h pα kα ) ,\n2\n\n(60)\n\ndescribes the rate of the rotation of the plane of polarization of electromagnetic wave caused by the presence of the gravitomagnetic field. As soon as equation (59) is solved, the time component e0(n) of the tetrad is obtained from the orthogonality\ncondition, lα eα(n) = 0, which implies that\ne0(n) = ki ei(n) + h0iei(n) + hi j ki e j(n) + δi j Ξ̇i e j(n) ,\n\n(61)\n\nwhere the relativistic perturbation Ξ̇i of the light-ray trajectory is given in equation (15).\nLet us decompose vector Ωi into three components that are parallel and perpendicular to the unit vector ki . We can use in the\nfirst approximation the well-known decomposition of the Kroneker symbol in the orthonormal basis\n\nδ i j = ai a j + bi b j + k i k j ,\n\n(62)\n\nwhere (a, b, k) are three orthogonal unit vectors of the reference tetrad at infinity. Decomposition of Ωi is, then, given by\nΩi = (a * Ω)ai + (b * Ω)bi + (k * Ω)ki .\n\n(63)\n\nTaking into account that at any point on the light-ray trajectory, vectors ei(1) = ai + O(hαβ ), ei(2) = bi + O(hαβ ), one obtains\nequations of the parallel transport of these vectors (59) in the following form\n\u0015\n\u0014\nd\n1\n(64)\nei(1) + hi j e j(1) − (k * Ω)ei(2) = 0 ,\ndτ\n2\n\u0014\n\u0015\n1\nd\nei(2) + hi j e j(2) + (k * Ω)ei(1) = 0 ,\n(65)\ndτ\n2\nwhere equalities εi jl ei(1) kl = −ei(2) + O(hαβ ), and εi jl ei(2) kl = ei(1) + O(hαβ ) have been used.\nSolutions of equations (64), (65) in the linear approximation with respect to the (post-Newtonian) angular velocity Ωi read\n\u0012Z τ\n\u0013\n1\nj\ni\ni\nk * Ω(σ ) d σ bi ,\n(66)\ne (1) = a − hi j a +\n2\n−∞\n\u0012Z τ\n\u0013\n1\nk * Ω(σ ) d σ ai ,\n(67)\nei(2) = bi − hi j b j −\n2\n−∞\nwhere the second term in the right side of (66), (67) preserve orthogonality of vectors ei(1) and ei(2) in the presence of gravitational\nfield while the last term describes the Skrotskii effect which is a small rotation of each of the vectors at the angle\nΦ(τ ) =\n\nZ τ\n\n−∞\n\nk * Ω dσ\n\n(68)\n\nabout the direction of light propagation, k, in the local plane of vectors e(1) and e(2) . It is worth noting that the Euclidean dot\nproduct k * Ω can be expressed in terms of partial differentiation with respect to the vector ξ i of the impact parameter. This can\nbe done by making use of equation (31) and noting that εi j p k j k p ≡ 0, so that\n1\nk * Ω = kα k j ε j pq ∂ˆq hα p .\n2\n\n(69)\n\n\f46\nHence, the transport equation for the angle Φ assumes the following form\ndΦ 1 α j\n= k k ε j pq ∂ˆq hα p .\ndτ\n2\n\n(70)\n\nThis equation can be split in three, linearly-independent parts corresponding to the contributions of the gauge, Φ(G) , the mass,\nΦ(M) , and the spin, Φ(S) , multipoles of the gravitational field to the Skrotskii effect. Specifically, we have\nΦ = Φ(G) + Φ(M) + Φ(S) + Φ0 ,\n\n(71)\n\nwhere Φ0 is a constant angle characterizing the initial orientation of the polarization ellipse of the electromagnetic wave in the\nreference plane formed by the e(1) and e(2) vectors.\nThe gauge-dependent part of the Skrotskii effect is easily integrated so that we obtain\n1\nΦ(G) = k j ε j pq ∂ˆq (w p + χ p) ,\n2\n\n(72)\n\nwhere the gauge vector functions wi = wi(M) + wi(S) are given in equations (20). The gauge functions χ i appear in the process of\nintegration of the equation of the parallel transport. They can be linearly decomposed in two parts corresponding to the mass\nand spin multipoles:\ni\ni\n+ χ(S)\n,\nχ i = χ(M)\n\n(73)\n\nwhere\n∞ l−1 p\n\n\u0013\n\u0012\n(−1)l+p−q\np−q\nCl−1 (l − p − 1, p − q, q) 1 −\nχ(M) = 4 ∑ ∑ ∑\nl!\nl−1\nl=2 p=1 q=1\n\n\n(p−q+1)\nI\n(t\n−\nr)\niAl−1\n,\n× k<a1...a p ∂ˆa p+1 ...al−1 > ∂ˆτq−1 \nr\ni\n\n(74)\n\n∞ l−1 p\n\n\u0014\n\u0015\n(−1)l+p−q l\np−q\nC\n(l\n−\np\n−\n1,\np\n−\nq,\nq)\n1\n−\nH(l\n−\n1)\nl−1\n∑∑\nl−1\nl=1 p=0 q=0 (l + 1)!\n\n\n(p−q)\nh\ni\nε\nS\n(t\n−\nr)\niba bAl−1\nq−1\n\n× H(q)(∂ˆa − ka ∂ˆt ∗ ) + ka∂ˆτ k<a1 ...a p ∂ˆa p+1 ...al−1 > ∂ˆτ \nr\n\ni\nχ(S)\n= −4∑\n\n(75)\n\n∞ l−1 p\n\n\u0012\n\u0013\n\u0010\n(−1)l+p−q l\nq\np\u0011\n1\n−\nC\n(l\n−\np\n−\n1,\np\n−\nq,\nq)\n1\n−\nl−1\n∑∑\nl\np\nl=3 p=1 q=1 (l + 1)!\n\n\n(p−q)\nε\nS\n(t − r)\nq−1  baal−1 ibAl−2\nˆ\nˆ\n.\n× k<a1...a p ∂a p+1 ...al−1 >a ∂τ\nr\n\n+4∑\n\nThe gauge-dependent equation (72) has the following, more explicit form:\n\np\n∞ l\n(−1)l+p−q l − p + q p − q\n1 j\nm\n=2 ∑ ∑ ∑\nk ε jmn ∂ˆn χ(M)\nCl (l − p, p − q, q)\n2\nl!\n(l − 1) p\nl=2 p=1 q=1\n#[−1]\n\"\n(p−q)\nq−1 ε jbal IbL−1 (t − r)\nˆ\nˆ\n,\n× k<a1...a p ∂a p+1 ...al > j ∂τ\nr\n\n(76)\n\n\f47\np\n∞ l\n(−1)l+p−ql\n1 j\nm\n=2 ∑ ∑ ∑\nk ε jmn ∂ˆn χ(S)\nCl (l − p, p − q, q)\n2\nl=1 p=0 q=0 (l + 1)!\n\u001a\n\u0014\n\u0012\n\u0013\u0015\n\u0010\nl− p−1 p−q\np\u0011\n∂ˆt2∗\n× H(q) 1 −\n−\n1 + H(l − 1)\nl\nl−1\nl−1\n\u0012\n\u0013\u0015\n\u0014\np−q\np−q l− p\np−q−1\nl−p\n+2\n− H(l − 1)\n+2\n−\n∂ˆt ∗ τ\nl\nl\nl\nl−1\nl−1\n\u0014\n\u0015 \u001b\np−q\np−q−1 ˆ2\n+\n∂τ\n1 − H(l − 1)\nl\nl−1\n\" (p−q−1)\n#[−1]\n(t − r)\nq−1 SL\nˆ\nˆ\n× k<a1...a p ∂a p+1 ...al > ∂τ\n,\nr\n\np\n∞ l\n(−1)l+p−q p − q\n1 j\nk ε jmn ∂ˆn wm\nCl (l − p, p − q, q)\n(M) = − 2 ∑ ∑ ∑\n2\nl!\np\nl=2 p=0 q=0\n\"\n#\n(p−q−1)\nI\n(t\n−\nr)\nε\njba\nq\nl\nbL−1\n× k<a1...a p ∂ˆa p+1 ...al > j ∂ˆτ\n,\nr\n\np\n∞ l\n(−1)l+p−ql\n1 j\nk ε jmn ∂ˆn wm\nCl (l − p, p − q, q)\n(S) = − 2 ∑ ∑ ∑\n2\nl=1 p=0 q=0 (l + 1)!\n\u0012\n\u0013\n\u001a\u0010\n\u001b\np−q ˆ2\nl−p\np−q ˆ\np\u0011 ˆ2\n∗\n∂∗−\n∂t τ +\n∂τ\n× 1−\n+2\nl t\nl\nl\nl\n#\n\" (p−q−2)\nS\n(t\n−\nr)\nq\nL\n.\n× k<a1...a p ∂ˆa p+1 ...al > ∂ˆτ\nr\n\n(77)\n\n(78)\n\n(79)\n\nThe reader can notice the presence of integrals in the right side of equations (76) and (77). The integrals are actually not supposed\nto be calculated explicitly since there is sufficient number of partial derivatives in front of them which cancels the integration in\ncorrespondence with the rules of differentiation of such integrals which have been explained in section IV.\nThe Skrotskii effect due to the mass-type multipoles of the isolated system is given by\n\n[−1]\n(p)\nε jbal IbAl−1 (t − r)\nl− p\n(−1)l+p\n\nΦ(M) (τ ) = 2 ∑ ∑\n.\nCl (l − p, p)\nk<a1 ...a p ∂ˆa p+1 ...al > j \nl!\nl−1\nr\nl=2 p=0\n∞\n\nl\n\n(80)\n\nThe gravitational field of the spin-type multipoles rotates the polarization plane of the electromagnetic wave at the following\nangle\n∞\n\nl\n\n\u0010\n(−1)l+p l\np\u0011\nC\n(l\n−\np,\np)\n1\n−\n×\nl\n∑\nl\nl=1 p=0 (l + 1)!\n\nΦ(S) (τ ) = 2 ∑\n\u0014\n\n(81)\n\n\n[−1]\n\u0012\n\u0013\u0015\n(p+1)\nSAl\n(t − r)\n2p\n\n1 + H(l − 1) 1 −\nk<a1 ...a p ∂ˆa p+1 ...al > \nl−1\nr\n\nIntegrals in equations (80) and (81) are eliminated after taking at least one partial derivative so that we do not need to integrate.\nVII.\n\nLIGHT PROPAGATION THROUGH THE FIELD OF GRAVITATIONAL LENS\n\nThis section considers propagation of light in a special case of gravitational lens approximation when the impact parameter\nd of the light ray with respect to an isolated system, is much smaller than both the distance r0 from the isolated system to the\nsource of light and distance r from the isolated system to observer, as illustrated in Fig. 3.\n\n\f48\n\nO\nObserver\n\nτ0\n\nE\n\nτ\nd\n\nr0\n\nr\n\nS\nSource of light\n\nD\nSource of gravitational waves\nFIG. 3: Relative configuration of an observer (O), a source of light (S), and a localized system emitting gravitational waves (D). Static part\nof gravitational field of the localized system and gravitational waves deflect light rays which are emitted at the moment t0 at the point S and\nreceived at the moment t at the point O. The point E on the line OS corresponds to the moment t ∗ of the closest approach of a light ray to the\ndeflector D. We denoted the distances as follows: OS = R, DO = r, DS = r0 , the impact parameter DE = d, OE = τ > 0, ES = τ0 = τ − R < 0.\nThe impact parameter d is much smaller as compared with all other distances.\n\nA.\n\nSmall parameters and asymptotic expansions\n\nIn the case of a small impact parameter of the light ray with respect to the isolated system the near-zone gravitational field of\nthe system strongly affects propagation of the light ray only when the light particle (photon) moves in the close proximity to the\nsystem where the effects on the light ray propagation caused by gravitational waves are suppressed [99, 100]. In what follows,\nwe assume that the impact parameter d of the light ray is small as compared with both distances r and r0 , that is, d ≪ min[r, r0 ]\n(see Fig. 3). This assumption allows us to introduce two small parameters: ε ≡ d/r and ε0 ≡ d/r0 . If the light ray is propagated\nthrough the near-zone of the isolated system one more small parameter can be introduced, ελ ≡ d/λ , where λ is the characteristic\nwavelength of the gravitational radiation emitted by the system proportional to the product of the speed of gravity (= c in general\nrelativity) and the characteristic period of matter oscillations in the isolated system. Parameters ε , ε0 and ελ are not physically\ncorrelated. Parameter ελ is used for the post-Newtonian expansion of the equations describing the observed effects – deflection\nof light, time delay, etc. This expansion can be also viewed as a Taylor expansion with respect to the parameter v/c, where v is\nthe characteristic speed of motion of matter composing the isolated system and c is the speed of propagation of gravity. If the\nlight ray does not enter the near zone of the system the parameter ελ is not small and the post-Newtonian expansion can not be\nperformed.\nThe small-impact-parameter expansions for the retarded time variables y and y0 yield:\n!\n∞\np\nε\ny =\n− ∑ Ck ε 2k−1 ,\nr2 − d 2 − r = −d\n(1)\n2 k=2\n!\nq\n∞\nε0\n2k−1\n2\n2\n,\n(2)\n− ∑ Ck ε0\ny0 = − r0 − d − r0 = −2r0 + d\n2 k=2\nand\n1\n1\n= − 2\nyr\nd\n\n∞\n\n2 + ∑ Ck ε\nk=1\n\n2k\n\n!\n\n,\n\n(3)\n\n1\n1 ∞\n= 2 ∑ Ck ε02k ,\ny0 r0\nd k=1\n\n(4)\n\nwhere the numerical coefficients entering the expansions are\n\u0012\n\u0013\n\u0012\n\u0013\n(−1)k 1 1\n(2k − 1)!\n1\nCk =\n− 1 * ... *\n−k+1 =\n.\nk! 2 2\n2\n(2k)!!\nRetarded time variables, s = t − r and s0 = t0 − r0 , are expanded as follows\n!\n∞\nε\n2k−1\n∗\n,\ns = t −d\n− ∑ Ck ε\n2 k=2\n∗\n\ns0 = t − 2r0 + d\n\n∞\nε0\n− ∑ Ck ε02k−1\n2 k=2\n\n(5)\n\n(6)\n!\n\n,\n\n(7)\n\n\f49\nwhere Ck is given by equation (5) and t ∗ is the time of the closest approach of the light ray to the barycenter of the isolated\nsystem.\nUsing (6) and (7) we can write down the post-Newtonian expansions for functions of the retarded time t − r as follows\n!k\n∞\nε\n2k−1\n− ∑ Ck ε\nF (k) (t ∗ )\n2 k=2\n\u0001\nd\n= F(t ∗ ) − ε Ḟ(t ∗ ) + O ε 2 ελ2 ,\n2\n!k\n∞\n∞\nk\nd\nε0\n2k−1\nF(t0 − r0 ) = ∑\nF (k) (t ∗ − 2r0)\n− ∑ Ck ε0\nk!\n2\nk=0\nk=2\n\u0001\nd\n= F(t ∗ − 2r0 ) + ε0 Ḟ(t ∗ − 2r0 ) + O ε02 ελ2 ,\n2\n∞\n\n(−1)k d k\nF(t − r) = ∑\nk!\nk=0\n\n(8)\n\n(9)\n\nwhere the dot above functions denote the total time derivative. We notice that convergence of the post-Newtonian time series\nfor light propagation depends, in fact, not just on a single parameter, ελ ∼ v/c, that is typical in the post-Newtonian celestial\nmechanics of extended bodies [54, 69, 70], but on the product of two parameters. Therefore, the convergence requires satisfaction\nof two conditions\n\nεελ ≪ 1 ,\nε0 ελ ≪ 1 ,\n\n(10)\n(11)\n\nwhere the numerical value of the parameter ελ must be taken for the smallest wavelength, λmin , in the spectrum of the gravitational radiation emitted by the isolated system. Conditions (10), (11) ensure convergence of the post-Newtonian series in (8)\nand (9) respectively. If the source of light rays and observer are at infinite distances from the isolated system then ε ≃ 0 and\nε0 ≃ 0, and the requirements (10), (11) are satisfied automatically, irrespective of the structure of the Fourier spectrum (5) of\nthe gravitational radiation emitted by the isolated system. In a real astronomical practice such an assumption may not be always\nsatisfied. In such cases it is more natural to avoid the post-Newtonian expansions of the metric tensor and/or observable effects\nand operate with the functions of the retarded time. It is important to notice that the retarded time s = t − r which enters the result\nof the calculation of the is a characteristic of the Einstein equations of gravitational field, not the Maxwell equations. Therefore,\nmeasuring the effect of the gravitational deflection of light caused by time-dependent gravitational field allows us to measure\nthe speed of gravity with respect to the speed of light. This type of experiments have been proposed in our paper [126] and\nsuccessfully performed in 2003 [127]. There were several publications (see review [147]) arguing that the speed of gravity is\nirrelevant in the light-ray deflection experiments by moving bodies. Unfortunately, all the authors of those publications operated\nwith the post-Newtonian expansion of the gravitational field which replaces the retarded time s = t − r of the gravitational field\nwith the time t ∗ of the closest approach of light to the light-ray deflecting body like in equation (6). This explains why the effect\nof the retardation of gravity was confused with the retardation of light in [147].\nIf we assume that the mass and angular momentum of the isolated system are conserved the asymptotic expansions of integrals\n(1), (2) of the stationary part of the metric tensor have the following form\n\u0014 \u0015[−1]\n\u0012\n\u0013\n∞\n1\n(2k − 1)! 2k\nr\nε\n= − ln\n− 2 ln ε − ∑ 2k\n2\nr\n2rE\nk=1 2 (k!)\n\u0015\n1 [−1]\nr0\n\u0014 \u0015[−2]\n1\nr\n\n\u0014\n\n\u0014\n\n1\nr0\n\n\u0015[−2]\n\n= −2 ln d + lnr + ln(2rE ) + O(ε 2 ),\n\u0012\n\u0013 ∞\n\u0013\n\u0012\n(2k − 1)! 2k\n2r0\n2r0\nε\n=\n−\nln\n− ∑ 2k\n+ O(ε02 ),\n= − ln\n2 0\nrE\n2\n(k!)\nr\nE\nk=1\n!\" \u0012\n#)\n(\n\u0013 ∞\n∞\n(2k − 1)! 2k\nε 2r\n2k\nln\nε\n= −r 1 + 1 + ∑ Ck ε\n+ ∑ 2k\n2\n2rE\nk=1\nk=1 2 (k!)\n\u0012 2 \u0013\u0015\n\u0014\nd\nd 1\n= −r − 2r ln d + r ln (2rrE ) − ε\n− ln\n+ O(ε 2 ),\n2 2\n2rrE\n!\" \u0012\n#)\n(\n\u0013 ∞\n∞\n(2k − 1)! 2k\n2r0\n2k\nln\nε\n+ ∑ 2k\n= −r0 1 − 1 + ∑ Ck ε0\n2 0\nrE\nk=1\nk=1 2 (k!)\n\u0014\n\u0013\n\u0013\u0015\n\u0012\n\u0012\nd 1\n2r0\n2r0\n− ε0\n+ O(ε02 ).\n+ ln\n= −r0 + r0 ln\nrE\n2 2\nrE\n\n(12)\n\n(13)\n(14)\n\n(15)\n\n\f50\nNext several equations yield the estimates for the partial derivatives with respect to the parameters ξ i and τ from functions of\nthe retarded time (of gravity). In these estimates the numbers m and n depend on l; we give the estimates from below for m and\nn for l ≥ 1.\n\u0012\n\u0013\nF\nF(t − r)\n=O ε 2 l+1 ,\n(16)\n∂ˆ<a1 ...al >\nr\nd\n\u0013\n\u0012\nF\nF(t0 − r0 )\n∂ˆ<a1 ...al >\n(17)\n=O ε 2 l+1 ,\nr0\nd\n\u0015\n\u0012\n\u0013\n\u0014\nF\nF(t − r)\n=O ε 2 l+1 ,\n(18)\n∂ˆτl\nr\nd\n\u0014\n\u0013\n\u0015\n\u0012\nF(t0 − r0 )\nF\n∂ˆτl\n(19)\n=O ε l+1 ,\nr0\nd\n\u0014\n\u0015[−1]\n\u0012\n\u0013\n2F\nˆ∂<a ...a > F(t0 − r0 )\n=O ε l ,\n(20)\n1\nl\nr0\nd\n\u0014\n\u0013\n\u0015\n\u0012\nF\nF(t0 − r0 ) [−2]\n∂ˆ<a1 ...al >\n(21)\n=O ε 3 l−1 .\nr0\nd\nTwo asymptotic expansions will be also useful.\n\u0014\n\u0015\n\u0013\n\u0012\nF(t − r) [−1]\nF\n= − 2F(t − r)∂ˆ<a1 ...al > ln d + O εελ l ,\n∂ˆ<a1 ...al >\nr\nd\n\u0013\n\u0015[−2]\n\u0014\n\u0012\nF\nˆ∂<a ...a > F(t − r)\nˆ\n= − 2rF(t − r)∂<a1 ...al > ln d + O ελ l−1 ,\n1\nl\nr\nd\n\n(22)\n(23)\n\nThese estimates and asymptotic expansions will be used for obtaining the observable relativistic effects in the gravitational lens\napproximation.\nB. Asymptotic expressions for observable effects\n\nThis section provides the reader with the asymptotic expressions for potentially observable relativistic effects by taking into\naccount only the leading terms and neglecting all terms which are proportional to the parameter ε .\nThe relativistic time delay is given by\n∆ (τ , τ0 ) = ∆ (τ , τ0 ) + ∆ (τ , τ0 ) ,\n\n(24)\n\n∆ (τ , τ0 ) = − 4M ln d + 2M ln(4rr0 )−\n\n(25)\n\n(M)\n\n(S)\n\nwhere\n(M)\n\n∞ l−2\n\n\u0012\n\u0013\n\u0010\np\np\u0011\n(−1)l+p\n1\n−\n×\nC\n(l\n−\np,\np)\n1\n−\n∑ l! l\nl\nl−1\nl=2 p=0\n\n4∑\n\n∂ˆtp∗ IAl (t − r)k<a1 ...a p ∂ˆa p+1 ...al > ln d ,\n∆ (τ , τ0 ) = − 4εibaki Sb ∂ˆa ln d+\n\n(S)\n\n(26)\n\n∞ l−1\n\n\u0013\n\u0012\n(−1)l+p l\np\n×\nC\n(l\n−\np\n−\n1,\np)\n1\n−\nl−1\n∑\nl−1\nl=2 p=0 (l + 1)!\n\n8εiba ki ∂ˆa ∑\n\n∂ˆtp∗ SbAl−1 (t − r)k<a1 ...a p ∂ˆa p+1 ...al−1 > ln d .\n\nThe observable unit vector in the direction from the observer to the source of light is given by the following expression\nsi (τ , ξ) =K i + α i (τ , ξ) + β i (τ , ξ) ,\n\n(27)\n\n\f51\nwhere we have dropped off the quantities β i (τ0 , ξ) and γ i (τ , ξ) as being negligibly small. Vector α i (τ , ξ), characterizing the\ndeflection of light, is given by expression\ni\ni\n(τ , ξ) + α(S)\n(τ , ξ) ,\nα i (τ , ξ) =α(M)\n\n(28)\n\nwhere\ni\nα(M)\n(τ , ξ) =4M ∂ˆi ln d+\n\n(29)\n\n\u0012\n\u0013\n\u0010\n∞ l−2\np\n(−1)l+p\np\u0011\n1−\n×\n4∂ˆi ∑ ∑\nCl (l − p, p) 1 −\nl!\nl\nl−1\nl=2 p=0\n\n∂ˆtp∗ IAl (t − r)k<a1 ...a p ∂ˆa p+1 ...al > ln d ,\ni\nα(S)\n(τ , ξ) =4ε jba k j Sb ∂ˆia ln d−\n\n(30)\n\n\u0013\n\u0012\n∞ l−1\n(−1)l+p l\np\nˆ\n×\n8εiba ki ∂ia ∑ ∑\nCl−1 (l − p − 1, p) 1 −\nl−1\nl=2 p=0 (l + 1)!\n\n∂ˆtp∗ SbAl−1 (t − r)k<a1 ...a p ∂ˆa p+1 ...al−1 > ln d .\n\nThe corresponding relativistic correction to the light-ray deflection is\ni\ni\n(τ , ξ) + β(S)\n(τ , ξ) ,\nβ i (τ , ξ) =β(M)\n\n(31)\n\nwhere\nr i\ni\nβ(M)\n(τ , ξ) = − α(M)\n,\nR\nr i\ni\nβ(S)\n(τ , ξ) = − α(S)\n.\nR\n\n(32)\n(33)\n\nWe can use (8) and (9) to rewrite functions of the retarded time s = t − r in (25), (26), (29) and (30) as functions taken at the\nmoment of the closest approach t ∗ of photon to the gravitating system. This is accomplished by formal replacing t − r → t ∗\nbecause the corrections will be of the higher order with respect to the parameter ε (see Eq. (8)). It should not confuse the reader\nabout the physical meaning of the retardation, which is due to the finite speed of propagation of gravity.\nThe time delay (24) and the light-ray deflection (28) can be written in a very short and concise form by making use of the\ngravitational lens potential, ψ , which is just the eikonal perturbation. More specifically,\n∆ (τ , τ0 ) = − 4ψ + 2M ln(4rr0 ),\nα i (τ , ξ) =4∂ˆi ψ ,\n\n(35)\n\nψ = ψ(M) + ψ(S) ,\n\n(36)\n\n(34)\n\nwhere\n\nand\n\nψ(M) = M ln d +\n∞ l−2\n\n∑∑\n\n(37)\n\n(−1)l+p\n\n\u0012\n\u0013\n\u0010\np\np\u0011\n1−\n×\nCl (l − p, p) 1 −\nl\nl−1\n\nl!\nl=2 p=0\n∂ˆtp∗ IAl (t ∗ )k<a1 ...a p ∂ˆa p+1 ...al > ln d\n\nψ(S) = ε jba k j Sb ∂ˆa ln d −\n∞ l−1\n\n2ε jba k j ∂ˆa ∑\n\n∑\n\nl=2 p=0\n\n,\n(38)\n\n(−1)l+p l\n\n\u0013\n\u0012\np\n×\nCl−1 (l − p − 1, p) 1 −\n(l + 1)!\nl−1\n\n∂ˆtp∗ SbAl−1 (t ∗ )k<a1 ...a p ∂ˆa p+1 ...al−1> ln d .\n\nThis expression takes into account the multipole moments of the isolated gravitating system of all orders and presents a generalization of our previous results obtained in [6] (stationary gravitational field) and [100] (the quadrupolar gravitational field).\n\n\f52\nThe angle of rotation of the polarization plane of electromagnetic wave is simplified if one uses the approximation of gravitational lens. More specifically, the total angle of the rotation is given by\n∆Φ = ∆Φ(M) + ∆Φ(S) ,\n\n(39)\n\nwhere\n∞\n\nl\n\n(−1)l+p\nl−p\nCl (l − p, p)\n×\nl!\nl−1\nl=2 p=0\n\n∆Φ(M) = −4 ∑\n\n∑\n\n(40)\n\n∂ˆtp∗ ε jbal IbAl−1 (t ∗ )k<a1 ...a p ∂ˆa p+1 ...al > j ln d ),\n∆Φ(S)\n\n∞\n\nl\n\n\u0014\n\u0012\n\u0013\u0015\n\u0010\n2p\np\u0011\n(−1)l+p l\n1 + H(l − 1) 1 −\n×\nCl (l − p, p) 1 −\n= −4 ∑ ∑\nl\nl−1\nl=1 p=0 (l + 1)!\nSAl (t ∗ )k<a1 ...a p ∂ˆa p+1 ...al > ln d .\n∂ˆtp+1\n∗\n\nVIII.\n\n(41)\n\nLIGHT PROPAGATION THROUGH THE FIELD OF PLANE GRAVITATIONAL WAVES\nA. Plane-wave asymptotic expansions\n\nWe consider the source of light and observer located respectively at radial distances r0 = |r0 | and r = |r| from the isolated\nsystem emitting gravitational waves. The distance between the source of light and observer is R = |r − r0 |. In the plane\ngravitational-wave approximation we assume that\n(a) the characteristic wavelength of gravitational waves, λ ≪ min[r, r0 ] ,\n(b) the distance between the source of light and observer, R ≪ min[r, r0 ] .\nCondition (a) tells us that both the source of light and observer are lying in the wave zone of the isolated system. Condition (b)\nallows us to consider the gravitational waves emitted by the isolated system as plane waves when they propagate from the source\nof light to observer. This approximation is vizualized in Fig. 4.\nWe introduce small parameters δλ = max[λ /r, λ /r0 ], δ = R/r and δ0 = R/r0 The coordinate relation between r, r0 and\nR = |r − r0 | can be written as follows\nr02 = r2 − 2rR cos θ + R2 = r2 (1 − 2δ cos θ + δ 2 ) ,\n\n(1)\n\nwhere θ – is the angle between the directions \"observer – the source of light\" and \"observer – the gravitating system\" (see Fig.\n4). From (1) it follows that\nr0 = r(1 − δ cos θ ) + O(δ 2 ) ,\n1\n1\n= (1 + δ cos θ ) + O(δ 2 ) .\nr0\nr\n\n(2)\n(3)\n\nFor the variables τ and τ0 we have exact relations,\n\nτ = r cos θ ,\n\nτ0 = τ − R = r cos θ − R.\n\n(4)\n\nQuantities d and y are given in terms of the distance r and the angle τ as follows\nd = r sin θ ,\ny = τ − r = −r(1 − cos θ ) .\n\n(5)\n(6)\n\nThe retarded instants of time s = t − r and s0 = t0 − r0 are related to each other as follows\nt0 − r0 = t − r − R(1 − cos θ ) .\nUsing this expression we can write the Taylor expansion for the functions of the retarded time s = t − r\n\u0001\nF(t0 − r0 ) = F(t − r) − R(1 − cos θ )Ḟ(t − r) + O R2 /λ 2 .\n\n(7)\n\n(8)\n\n\f53\n\nSource of gravitational waves\nD\nN\n\nr\nd\n\nr0\n\nθ\nO\nObserver\n\nk\n\nR\n\nτ0\n\nθ0\n\nS\nSource of light\n\nE\n\nFIG. 4: Relative configuration of observer (O), a source of light (S), and a localized system emitting of gravitational waves (D). The gravitational waves deflect light rays which are emitted at the moment t0 at the point S and received at the moment t at the point O. The point E on the\nline OS corresponds to the moment of the closest approach of light ray to the system D. Notations for distances are OS = R, DO = r, DS = r0 ,\nDE = d - the impact parameter, OE = τ = r cos θ , ES = τ0 = τ − R. The distance R is much smaller than both r and r0 . There is no limitation\non the impact parameter d which can be or may be not small as compared to all other distances.\n\nThe impact parameter vector, ξ i , can be decomposed as follows\n\u0001\nξ i = r N i − ki cos θ .\n\nThis form of the impact parameter vector ξ i is useful in subsequent approximations.\n\n(9)\n\n\f54\nLet us now write out the asymptotic expressions for the derivatives with respect to ξ i and τ of functions depending on the\nretarded time s = t − r. We have\n\u0014\n\u0014\n\u0015\n\u0015\nF(t − r)\nF(t − r)\n∂ˆτn\n(10)\n= (1 − cos θ )n ∂ˆtn∗\n+ O(δ 2 ) ,\nr\nr\n\u0014\n\u0014\n\u0015\n\u0015\nF(t − r)\nF(t − r)\nξa . . . ξa\n∂ˆa1 ...an\n(11)\n= (−1)n 1 n n ∂ˆtn∗\n+ O(δ 2 ) ,\nr\nr\nr\n\u0014\n\u0015[−1]\n\u0015\n\u0014\nn−1 ˆ n−1 F(t − r)\nˆ∂ n F(t − r)\n(12)\n+ O(δ 2 ) ,\n= (1 − cos θ ) ∂t ∗\nτ\nr\nr\n\u0014\n\u0014\n\u0015[−1]\n\u0015\n(−1)n ξa1 . . . ξan ˆ n−1 F(t − r)\nˆ∂a ...a F(t − r)\n(13)\n=\n+ O(δ 2 ) .\n∂t ∗\nn\n1\nr\n1 − cos θ\nrn\nr\nOne more asymptotic expression is given for the integral taken from an STF partial derivative\n(\u0014\n\nF(t − r)\nr\n\n\u0015\n\n,<Al >\n\n)[−1]\n\nl\n\np\n\n∑ ∑ (−1) p−qCl (l − p, p − q, q) ×\n\n=\n\n(14)\n\np=0 q=0\n\n\u0015[−1]\n\u0014\np−q ˆ q F(t − r)\nˆ\nˆ\n.\nk<a1 ...a p ∂a p+1 ...al > ∂t ∗ ∂τ\nr\nTaking into account only the leading order terms in (15), we obtain the asymptotic expansion\n(\u0014\n\nF(t − r)\nr\n\n\u0015\n\n,<Al >\n\n)[−1]\n\n1\n=\n1 − cos θ\n\n\"\n\n(−1)\n\nF(t − r)\nr\n\n#\n\n,<Al >\n\n−\n\n(15)\n\n(−1)l\nF(t − r)\nk<Al > ∂ˆtl−1\n+\n∗\n1 − cos θ\nr\n\u0015\n\u0014\nF(t − r) [−1]\n+ O(δλ ) ,\n(−1)l k<Al > ∂ˆtl∗\nr\nwhere N i = xi /r. Equations (10)–(15) can be checked by induction.\nCorresponding expressions for the functions taken at the retarded instant of time s0 = t0 − r0 can be obtained from (10)–(15)\nby replacing the arguments t, r and θ with t0 , r0 and θ0 respectively.\nB. Asymptotic expressions for observable effects\n\nIn this section we give expressions for the relativistic effects of the time delay, bending of light and the Skrotskii effect in the\ngravitational plane-wave approximation. In this approximation we neglect all terms of the order of δ 2 , δ02 and δλ2 , and higher.\nFor the time delay we have\n∆ = ∆ (τ , τ0 ) + ∆ (τ , τ0 ) ,\n(M)\n\n(16)\n\n(S)\n\nwhere\n∆ (τ , τ0 ) = 2M\n\n(M)\n\nR\n+\nr\n\n(17)\n\n\"\n#T T\n\"\n#T T \n\nI ̇i jAl−2 (t0 − r0 )\n2ki k j ∞ (−1)l  I ̇i jAl−2 (t − r)\n−\n,\n∑ l! \n\n1 − cos θ l=2\nr\nr0\n,Al−2\n\n,Al−2\n\n4ki k j\nεiba ki ξa Sb 1 1\n×\n−\n−\n1 − cos θ\nr r0\n1 − cos θ\n\"\n#T T\n\"\n#T T\n∞\nεba(i S ̇j)bAl−2 (t0 − r0 )\n(−1)l l  εba(i S ̇j)bAl−2 (t − r)\n−\n∑\n\nr\nr0\nl=2 (l + 1)!\n\n∆ (τ , τ0 ) = −2\n\n(S)\n\n\u0012\n\n\u0013\n\n,aAl−2\n\n,aAl−2\n\n(18)\n\n\n\n\n,\n\n\f55\nHere the transverse - traceless (TT) part of the tensors depending on the multipole moments of the isolated astronomical system\nis taken with respect to the direction N i . Taking into account expression (8) for the components of the metric tensor hi j we can\nre-write expressions (16) – (18) for the time delay as follows\n\u0013\n\u0012\nR\nεibaki ξa Sb 1 1\n−\n−\n(19)\n∆ = 2M − 2\nr\n1 − cos θ\nr r0\n\n\nZt0\nZt\nki k j\nT\nT\n hi j (τ , x)d τ − hTi jT (τ , x0 )d τ  .\n2(1 − cos θ )\n−∞\n\n−∞\n\nThe observed astrometric direction from observer to the source of light in the plane gravitational-wave approximation is\nsi (τ , ξ) = K i + α i (τ , ξ) + γ i (τ , ξ) ,\n\n(20)\n\nwhere\n\nα i (τ , ξ) =\n\n\u0003\n1 k p kq \u0002\n(cos θ − 2)ki + N i hTpqT (t, x) + kqhTipT (t, x),\n2 1 − cos θ\n\n(21)\n\n1\nγ i (τ , ξ) = − Pi j kq hTjqT (t, x).\n2\n\nIn expression (20) we have dropped off the quantities β i (τ , ξ) which are negligibly small. Truncated expressions (19) – (21)\nwere obtained in [100] in the spin-dipole, mass-quadrupole approximation. Current expressions (19) – (21) include all multipole\nmoments of arbitrary order.\nIn the case when the distance between observer and the source of light is much smaller than the wavelength of the gravitational\nwaves R ≪ λ , expression (19) is reduced to a well known result [2] for gravitational wave detectors located in a wave-zone of\nan isolated system\n\u0012 \u0013\n∆R 1\nR\n= ki j hTi jT (t, x) + O(δ 2 ) + O\n,\n(22)\nR\n2\nλ\nwhere ∆R = c ∆ (τ , τ0 ).\nRelativistic rotation of the polarization plane of light (the Skrotskii effect) in the gravitational plane-wave approximation\nassumes the next form\n∆Φ =\n\n1 (k × N0 )i k j T T\n1 (k × N)i k j T T\nhi j (t, x) −\nh (t0 , x0 ) .\n2 1−k*N\n2 1 − k * N0 i j\n\n(23)\n\n\f56\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n[48]\n[49]\n[50]\n[51]\n\nLandau, L.D. & Lifshitz, E.M., 1962, The Classical Theory of Fields, Pergamon Press: London\nMisner, C.W., Thorne, K.S. & Wheeler, J.A., 1973, Gravitation, W.H. Freeman & Company: San Francisco\nWald, R.M. General Relativity, 1984, The University of Chicago Press: Chicago\nV.A. Fock, 1959, The Theory of Space, Time and Gravitation, Pergamon Press: London\nThorne K.S., 1980, Review of Modern Physics, 52, 299\nKopeikin S.M., 1997, J. Math. Phys., 38, 2587\nBrown, D. A., et al. 2004, Classical and Quantum Gravity, 21, 1625\nTsunesada, Y. & the TAMA Collaboration 2004, Classical and Quantum Gravity, 21, 703\nAstone, P., et al. 2004, Classical and Quantum Gravity, 21, 759\nCadonati, L., Katsavounidis, E., & the LIGO Scientific Collaboration's Bursts Working Group 2003, Classical and Quantum Gravity,\n20, 633\nCerdonio, M., Baggio, L., & Prodi, G. A. 2003, Proceedings of the SPIE, 4856, 189\nBlanchet, L., Damour, T., Esposito-Farese, G. & Iyer, B.R. 2004, Phys. Rev. Lett. , 93, 091101\nDamour, T, Gopakumar, A. & Iyer, B. R. 2004, Physical Review D, 70, id. 064028 (23 pages)\nBuonanno, A., Chen, Y., Pan, Y., & Vallisneri, M. 2004, Physical Review D, 70, 104003\nBuonanno, A., Chen, Y., & Vallisneri, M. 2003, Physical Review D, 67, 024016\nDamour, T., Iyer, B. R., & Sathyaprakash, B. S. 2001, Physical Review D, 63, 044023\nDamour, T., Iyer, B. R., & Sathyaprakash, B. S. 2002, Physical Review D, 66, 027502\nOwen, B. J. & Sathyaprakash, B. S. 1999, Physical Review D, 60, 022002\nUngarelli, C. & Vecchio, A. 2004, Classical and Quantum Gravity, 21, 857\nRiles, K. 2004, APS Meeting Abstracts, 9001\nSigg, D. 2004, Classical and Quantum Gravity, 21, 409\nAcernese, F., et al. 2004, Astroparticle Physics, 21, 1\nFujimoto, M. & TAMA Collaboration 2000, Advances in Space Research, 25, 1161\nWillke, B., et al. 2003, Proceedings of the SPIE, 4856, 238\nWeber, J., 1961, General Relativity and Gravitational Waves, Interscience Publishers: New York\nCoccia, E. 2000, Physica B Condensed Matter, 280, 525\nConti, L., de Rosa, M., Marin, F., Taffarello, L., & Cerdonio, M. 2003, Journal of Applied Physics, 93, 3589\nAguiar, O. D.; Andrade, L. A., Barroso, J. J., Camargo Filho, L., Carneiro, L. A., Castro, C. S., Castro, P. J., Costa, C. A., Costa, K.\nM. F., de Araujo, J. C. N., de Lucena, A. U., de Paula, W., de Rey Neto, E. C., de Souza, S. T., Fauth, A. C., Frajuca, C., Frossati, G.,\nFurtado, S. R., Lima, L. C., Magalhães, N. S., Marinho, R. M., Jr., Matos, E. S., Melo, J. L., Miranda, O. D., Oliveira, N. F., Jr., Paleo,\nB. W., Remy, M., Ribeiro, K. L., Stellati, C., Velloso, W. F., Jr. & Weber, J. 2004, Classical and Quantum Gravity, 21, 457\nDanzmann, K. 2003, Advances in Space Research, 32, 1233\nAmaro-Seoane, P., Aoudia, S., Babak, S., et al. 2013, GW Notes, 6, 4-110, 6, 4\nAppourchaux, T., Burston, R., Chen, Y., et al. 2009, Experimental Astronomy, 23, 491\nNi, W.-T. 2013, International Journal of Modern Physics D, 22, 41004\nThorne, K.S. 1995, Gravitational Waves, In: Proc. of the Snowmass 95 Summer Study on Particle and Nuclear Astrophysics and\nCosmology, eds. E. W. Kolb & R. Peccei, World Scientific: Singapore, p. 398\nSchutz, B. 1997, In: Proc. of the Alpbach Summer School 1997 Fundamental Physics in Space, ed. A. Wilson, ESA Publications\nDivision, Noordwijk: The Netherlands, SP-420, p. 229\nRiles, K. 2013, Progress in Particle and Nuclear Physics, 68, 1\nKramer, M. 2010, 38th COSPAR Scientific Assembly, 38, 4273\nColes, P., Frewin, R. A. & Polnarev, A. G. 1995, \"CMBR Polarization from Gravitational Waves\", In: Proceedings of the International\nWorkshop Held in Rome, Italy, 18-21 May 1994, edited by F. Occhionero. Springer-Verlag Berlin Heidelberg New York. Also Lecture\nNotes in Physics, 455, 1995, 273–276\nPolnarev, A. G., Miller, N. J., & Keating, B. G. 2008, Monthly Notices of the Royal Astronomical Society, 386, 1053-1063\nSathyaprakash, B. S. 2013, Comptes Rendus Physique, 14, Issue 4, 272–287\nWarner, B. 1995, Ap&SS, 2525, 249\nHils, D., Bender, P., & Webbink, R.F. 1990, Gravitational radiation from the Galaxy, The Astrophysical Journal, 360, 75–94\nRajagopal, M., & Romani, R.W., 1995, Ultra–Low-Frequency Gravitational Radiation from Massive Black Hole Binaries, The Astrophysical Journal, 446, 543\nGrishchuk, L. P., 1975, Amplification of Gravitational Waves in an Isotropic Universe, Sov. Phys. JETP, 40, 409\nGrishchuk, L. P. 2001, Lecture Notes in Physics, Springer: Berlin , 562, 167\nAllen, B., 1988, Stochastic gravity-wave background in inflationary-universe models, Physical Review D, 37, 2078–2085\nAllen, B., 1997, The Stochastic Gravity-Wave Background: Sources and Detection, in: Proc. Spanish Relativity Meeting 1996, eds. J.A.\nMiralles, J.A. Morales and D. Séz, Editions Frontiers: Paris, pp. 3–49\nMartin, X. & Vilenkin, A., 1996, Gravitational Wave Background From Hybrid Topological Defects, Phys. Rev. Lett. , 77, 2879–2882\nC.M. Will, 1993, Theory and Experiment in Gravitational Physics, (Cambridge University Press: Cambridge)\nKopeikin, S. & Vlasov, I., 2004, Physics Reports, 400, 209–318\nKopeikin, S. M. 2001, The Astrophysical Journal Letters, 556, L1–L5\nFomalont, E. B., & Kopeikin, S. M. 2003, The Astrophysical Journal, 598, 704–711\n\n\f57\n[52] Fomalont, E., Kopeikin, S., Jones, D., Honma, M., & Titov, O. 2010, \"Recent VLBA/VERA/IVS tests of general relativity\", In:\nRelativity in Fundamental Astronomy: Dynamics, Reference Frames, and Data Analysis, Proceedings of the International Astronomical\nUnion, IAU Symposium 261, pp. 291–295\n[53] Will, C. M. 2003, The Astrophysical Journal, 590, 683–690\n[54] Kopeikin, S., Efroimsky, M., & Kaplan, G. 2011, Relativistic Celestial Mechanics of the Solar System, Wiley-VCH: Berlin\n[55] Kopeikin, S. M., & Fomalont, E. B. 2006, Foundations of Physics, 36, 1244-1285\n[56] Stephani, H., Kramer, D., MacCallum, M., Hoenselaers, C., & Herlt, E. 2003, Exact solutions of Einstein's field equations, Cambridge\nUniversity Press: Cambridge\n[57] Bondi, H., van der Burg, M.G.J. & Metzner, A.W.K., 1962, Proc. Roy. Soc. Lond., A269, 21\n[58] Sachs, R.K., 1962, Proc. Roy. Soc. Lond., A270, 103\n[59] Penrose, R., 1965, Proc. Roy. Soc. Lond., A284, 159\n[60] Geroch, R.P., 1972, J. Math. Phys., 13, 956\n[61] Arnowitt R., Deser S. & Misner C.W., 1962, The Dynamics of General Relativity, In: Gravitation: An Introduction to Current Research,\ned. L. Witten, John Wiley: New York, p. 227\n[62] Ashtekar, A. Asymptotic Structure of the Gravitational Field at Spatial Infinity, In: General Relativity and Gravitation, Vol. 2, ed. A.\nHeld, Plenum Press: New York\n[63] Hansen, R. O., 1974, J. Math. Phys., 15, 46–52\n[64] Blanchet, L. & Damour, T., 1986, Philos. Trans. R. Soc. London, A320, 379\n[65] Blanchet, L. & Damour, T., 1989, Ann. Inst. H. Poincare, 50, 337\n[66] Blanchet, L. & Damour, T., 1992, Physical Review D, 46, 4304\n[67] Blanchet, L., 1995, Physical Review D, 51, 2559\n[68] Damour, T. & Iyer, B.R., 1991, Physical Review D, 43, 3259\n[69] Brumberg, V.A., 1972, Relativistic Celestial Mechanics, Nauka: Moscow (in Russian)\n[70] Brumberg, V.A., 1991, Essential Relativistic Celestial Mechanics (Adam Hilger: Bristol)\n[71] Schneider, P., Ehlers, J. & Falco, E. E., 1992, Gravitational Lenses, Springer: Berlin\n[72] Zakharov, A.F., 1997, Gravitational Lenses and Microlenses, Janus-K: Moscow (in Russian)\n[73] Courbin, F. & Minniti, D. (eds.), 2002, Gravitational Lensing: An Astrophysical Tool, Lecture Notes in Physics, 608, Springer: Berlin\n[74] Klioner, S.A., & Kopeikin, S.M., 1992 The Astronomical Journal, 104, 897–914\n[75] Taylor, J.H., 1993, Classical and Quantum Gravity, 10, 167\n[76] Weisberg, J. M. & Taylor, J. H., 2003, ASP Conf. Ser. 302: Radio Pulsars, eds. M. Bailes, D.J. Nice and S.E. Thorsett, Astronomical\nSociety of the Pacific: San Francisco, pp. 93–108\n[77] Sazhin M.V., 1978, Sov. Astron., 22, 36\n[78] Detweiler, S., 1979, The Astrophysical Journal, 234, 1100\n[79] Sazhin M.V. & Saphonova, M. V., 1993, Astron. Astrophys. Space Sci., 208, 93\n[80] Tinto, M. 2011, Phys. Rev. Lett. , 106, 191101\n[81] Lee, K. J., Wex, N., Kramer, M., et al. 2011, Monthly Notices of the Royal Astronomical Society, 414, 3251–3264\n[82] Yardley, D. R. B., Coles, W. A., Hobbs, G. B., et al. 2011, Monthly Notices of the Royal Astronomical Society, 414, 1777–1787\n[83] Wahlquist, H. 1987, Gen. Rel. Grav., 19, 1101\n[84] Estabrook, F. B., & Wahlquist, H. D., 1975, GRG, 6, 439\n[85] Tinto, M. 1996, Physical Review D, 53, 5354\n[86] Bertotti, B., Vecchio, A., & Iess, L. 1999, Physical Review D, 59, id. 082001\n[87] Armstrong, J. W. 2006, \"Low-Frequency Gravitational Wave Searches Using Spacecraft Doppler Tracking\", Living Reviews in Relativity, vol. 9, issue 1 URL (cited on November 19, 2013): http://www.livingreviews.org/lrr-2006-1\n[88] Braginsky, V. B., Kardashev, N. S., Polnarev, A. G., & Novikov, I. D. 1990, Nuovo Cim. B, 105, 1141\n[89] Braginsky, V. B., & Grishchuk, L. P., 1985, Soviet Physics - JETP, 62, 427\n[90] Kaiser, N., & Jaffe, A. 1997, The Astrophysical Journal, 484, 545\n[91] Pyne, T., Gwinn, C.R., Birkinshaw, M., Eubanks, T.M., & Matsakis, D.N. 1996, The Astrophysical Journal, 465, 566\n[92] Gwinn, C.R., Eubanks, T.M., Pyne, T., Birkinshaw, M. & Matsakis, D.N. 1997, The Astrophysical Journal, 485, 87\n[93] Montanari, E., 1998, Class. Quant. Grav., 15, 2493\n[94] Fakir, R., 1994, The Astrophysical Journal, 426, 74\n[95] Fakir, R., 1994, Physical Review D, 50, 3795\n[96] Durrer, R. 1994, Phys. Rev. Lett. , 72, 3301\n[97] Labeyrie, A., 1993, A&A, 268, 823\n[98] Pogrebenko, S., Mingaliev, M., Montebugnoli, S., Neizvestny, S., Borisov, N., & Stolyarov, V., 1994, GPS QSO 2022+171 - A Possible\nTarget for VLBI Detection of Gravitational Waves, In: Proc. 2-nd EVN/JIVE Symposium, Toruń, p. 33\n[99] Damour, T., & Esposito-Farèse, G. 1998, Physical Review D, 58, 042001\n[100] Kopeikin S.M., Schäfer G., Gwinn C.R. & Eubanks T.M., 1999, Physical Review D, 59,084023\n[101] Moenchmeyer, R., Schäfer, G., Mueller, E. & Kates, R. E., 1991, Astronomy and Astrophysics, 246, 417\n[102] Bekenstein, J.D., 1973, The Astrophysical Journal, 183, 657\n[103] Kopeikin, S.M., Korobkov, P., & Polnarev, A.G., 2006, Classical and Quantum Gravity, 23, 4299–4322\n[104] Kopeikin, S. M., & Makarov, V. V. 2007, Physical Review D, 75, id. 062002 (22 pages)\n[105] Blanchet, L., 2002, Gravitational Radiation from Post-Newtonian Sources and Inspiralling Compact Binaries, Living Rev. Relativity 5,\n(2002), 3. [Online article]: cited on 21 Nov 2013, http://www.livingreviews.org/lrr-2002-3\n[106] Blanchet, L., Kopeikin, S., & Schäfer, G. 2001, Gravitational Radiation Theory and Light Propagation, Lecture Notes in Physics,\n\n\f58\nSpringer-Verlag: Berlin, Vol. 562, pp. 141–166\n[107] Jackson, J.D., 1998, Classical Electrodynamics, John Wiley: New York\n[108] Landau, L.D., Lifshitz, E.M. & Pitaevskii, L.P., 1982, Electrodynamics of Continuous Media, Elsevier Butterworth-Heinemann: Oxford\n2004 (2nd edition)\n[109] Penrose, R. & Rindler, W., 1988, Spinors and spacetime, Cambridge University Press: Cambridge\n[110] Frolov, V.P., 1977, Problems in the General Theory of Relativity and Theory of Group Representations, In: Proc. of the P.N. Lebedev\nPhysics Institute, 96, 73, ed. by N.G. Basov\n[111] Ehlers, J., 1973, Survey of General Relativity Theory, in: Relativity, Astrophysics and Cosmology, ed. W. Israel\n[112] Synge [137] had developed an elegant theory of propagation of null rays in arbitrary transparent medium and gravitational field. This\ntheory makes analysis of the problem under consideration in the present chapter much more sophisticated and will not be considered\nhere.\n\u0011\n\u0010\n√\n[113] That is, Ḟ(t − r) = ∂ˆt ∗ F t ∗ + τ − τ 2 + d 2 .\n[114] Newman, E.T. & Penrose, R., 1962, J. Math. Phys., 3, 566\n[115] Penrose, R., 1968, Structure of spacetime, In: Battelle Recontres: 1967 Lectures in Mathematics and Physics, eds. C.M. DeWitt and\nJ.A. Wheeler, Benjamin: New York\n[116] Anile, A.M. & Breuer, R.A., 1974, Astrophys. J., 189, 39\n[117] Petters, A.O., Levine, H. & Wambsganss, J., 2001, Singularity Theory and Gravitational Lensing, Birkhäuser: Boston\n[118] Lightman A.P., Press W.H., Price R.H. & Teukolsky S.A., 1975, Problem Book in Relativity and Gravitation, Princeton Univ. Press:\nPrinceton\n[119] Skrotskii, G.V., 1957, Doklady Akademii Nauk SSSR, 114, 73–76 (in Russian)\n[120] Skrotskii, G.V. & Izmest'ev, A.A., 1968, Doklady Akademii Nauk SSSR, 178, 77 (in Russian)\n[121] Balaz, N.L., 1958, Physical Review D, 110, 236\n[122] Plebanski, J. 1960, Physical Review , 118, 1396\n[123] Keating, B. G., Polnarev, A. G., Miller, N. J., & Baskaran, D. 2006, \"The Polarization of the Cosmic Microwave Background due to\nPrimordial Gravitational Waves\", International Journal of Modern Physics A, 21, 2459–2479\n[124] Zakharov, A. F., & Sazhin, M. V. 1998, \"Gravitational microlensing\", Soviet Physics Uspekhi, 41, 945–982\n[125] Kopeikin, S.M., 2004, Classical and Quantum Gravity, 21, 3251–3286\n[126] Kopeikin, S.M., 2002, Astrophys. J. Lett., 556, L1–L5\n[127] Fomalont, E.B. & Kopeikin, S.M., 2003, The Astrophysical Journal, 598, 704\n[128] Asada, H. 2002, \"The Light Cone Effect on the Shapiro Time Delay\", The Astrophysical Journal Letters, 574, L69–L70\n[129] Bertotti, B. & Catenacci, R., 1975, Gen. Rel. Grav., 6, 329\n[130] Kopeikin, S. 2011, \"Relativistic Astrometry\", Scholarpedia, 6, Issue 8, id. 11382\n[131] Lindegren, L., & Dravins, D. 2003, \"The fundamental definition of \"radial velocity\", Astronomy & Astrophysics, 401, 1185–1201\n[132] Konacki, M., Muterspaugh, M. W., Kulkarni, S. R., & Helminiak, K. G. 2010, \"High-precision Orbital and Physical Parameters of\nDouble-lined Spectroscopic Binary Stars - HD78418, HD123999, HD160922, HD200077, and HD210027\", The Astrophysical Journal,\n719, 1293–1314\n[133] Fischer, D. A., Laughlin, G., Marcy, G. W., et al. 2006, \"The N2K Consortium. III. Short-Period Planets Orbiting HD 149143 and HD\n109749\", The Astrophysical Journal, 637, 1094–1101\n[134] Kopeikin, S. M., & Ozernoy, L. M. 1999, The Astrophysical Journal, \"Post-Newtonian Theory for Precision Doppler Measurements of\nBinary Star Orbits\", 523, 771–785\n[135] Zucker, S., & Alexander, T. 2007, \"Spectroscopic Binary Mass Determination Using Relativity\", The Astrophysical Journal Letters,\n654, L83–L86\n[136] Kramer, M. 2010, \"The HTRA potential of the SKA and its relation to observations with large optical telescopes\", In: Proceedings of\nHigh Time Resolution Astrophysics - The Era of Extremely Large Telescopes (HTRA-IV). May 5 - 7, 2010. Agios Nikolaos, Crete\nGreece. Published online at http://pos.sissa.it/cgi-bin/reader/conf.cgi?confid=108, id.38\n[137] Synge J.L., 1960, Relativity: the general theory, North-Holland: Amsterdam.\n[138] Kopeikin, S.M. & Schäfer, G. 1999, Physical Review D, 60, id. 124002\n[139] V. B. Braginskii, C. M. Caves & K. S. Thorne, (1977), Phys. Rev D, 15, 2047\n[140] Kopeikin, S. M., 2006, \"Gravitomagnetism and the Speed of Gravity\", International Journal of Modern Physics D, 15, 305–320\n[141] Mashhoon, B., 1975, Ann. Phys. (NY), 89, 254\n[142] Piran, T., & Safier, P. N. 1985, Nature (London) , 318, 271\n[143] Su, F. S., & Mallett, R. L. 1980, The Astrophysical Journal, 238, 1111\n[144] Ciufolini, I., Kopeikin, S., Mashhoon, B., & Ricci, F. 2003, Physics Letters A, 308, 101\n[145] Sereno, M. 2004, Physical Review D, 69, id. 087501\n[146] Kopeikin, S.M. & Mashhoon, B. 2002, Physical Review D, 65, id. 064025\n[147] Will, C. M., 2006, \"The Confrontation between General Relativity and Experiment\", Living Rev. Relativity 9, 3. URL (cited on\nDecember 1, 2013): http://www.livingreviews.org/lrr-2006-3\n[148] The retarded time y should not be confused with the Cartesian coordinate y.\n\n\f"}