{"id": "http://arxiv.org/abs/gr-qc/0611071v2", "guidislink": true, "updated": "2007-02-24T07:38:27Z", "updated_parsed": [2007, 2, 24, 7, 38, 27, 5, 55, 0], "published": "2006-11-14T04:06:21Z", "published_parsed": [2006, 11, 14, 4, 6, 21, 1, 318, 0], "title": "Unified First Law and Thermodynamics of Apparent Horizon in FRW Universe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0611061%2Cgr-qc%2F0611054%2Cgr-qc%2F0611077%2Cgr-qc%2F0611031%2Cgr-qc%2F0611094%2Cgr-qc%2F0611034%2Cgr-qc%2F0611115%2Cgr-qc%2F0611003%2Cgr-qc%2F0611035%2Cgr-qc%2F0611023%2Cgr-qc%2F0611126%2Cgr-qc%2F0611004%2Cgr-qc%2F0611125%2Cgr-qc%2F0611122%2Cgr-qc%2F0611110%2Cgr-qc%2F0611129%2Cgr-qc%2F0611075%2Cgr-qc%2F0611134%2Cgr-qc%2F0611118%2Cgr-qc%2F0611098%2Cgr-qc%2F0611155%2Cgr-qc%2F0611045%2Cgr-qc%2F0611056%2Cgr-qc%2F0611021%2Cgr-qc%2F0611131%2Cgr-qc%2F0611142%2Cgr-qc%2F0611032%2Cgr-qc%2F0611087%2Cgr-qc%2F0611097%2Cgr-qc%2F0611084%2Cgr-qc%2F0611052%2Cgr-qc%2F0611018%2Cgr-qc%2F0611027%2Cgr-qc%2F0611095%2Cgr-qc%2F0611068%2Cgr-qc%2F0611156%2Cgr-qc%2F0611081%2Cgr-qc%2F0611154%2Cgr-qc%2F0611127%2Cgr-qc%2F0611011%2Cgr-qc%2F0611123%2Cgr-qc%2F0611069%2Cgr-qc%2F0611036%2Cgr-qc%2F0611005%2Cgr-qc%2F0611025%2Cgr-qc%2F0611059%2Cgr-qc%2F0611116%2Cgr-qc%2F0611043%2Cgr-qc%2F0611105%2Cgr-qc%2F0611086%2Cgr-qc%2F0611071%2Cgr-qc%2F0611141%2Cgr-qc%2F0611057%2Cgr-qc%2F0611008%2Cgr-qc%2F0611037%2Cgr-qc%2F0611015%2Cgr-qc%2F0611092%2Cgr-qc%2F0611124%2Cgr-qc%2F0611017%2Cgr-qc%2F0611145%2Cgr-qc%2F0611091%2Cgr-qc%2F0611149%2Cgr-qc%2F0611100%2Cgr-qc%2F0611046%2Cgr-qc%2F0611030%2Cgr-qc%2F0611148%2Cgr-qc%2F0611006%2Cgr-qc%2F0611063%2Cgr-qc%2F0611029%2Cgr-qc%2F0611070%2Cgr-qc%2F0611099%2Cgr-qc%2F0611112%2Cgr-qc%2F0611109%2Cgr-qc%2F0611041%2Cgr-qc%2F0611135%2Cgr-qc%2F0611001%2Cgr-qc%2F0611076%2Cgr-qc%2F0611073%2Cgr-qc%2F0611047%2Cgr-qc%2F0611103%2Cgr-qc%2F0611078%2Cgr-qc%2F0611136%2Cgr-qc%2F0611132%2Cgr-qc%2F0611102%2Cgr-qc%2F0611072%2Cgr-qc%2F0611133%2Cgr-qc%2F0611119%2Cgr-qc%2F0611051%2Cgr-qc%2F0611107%2Cgr-qc%2F0611007%2Cgr-qc%2F0611089%2Cgr-qc%2F0611096%2Cgr-qc%2F0611146%2Cgr-qc%2F0611111%2Cgr-qc%2F0611152%2Cgr-qc%2F0611114%2Cgr-qc%2F0611013%2Cgr-qc%2F0611106%2Cgr-qc%2F0611067%2Cgr-qc%2F0611104%2Cgr-qc%2F0611143&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Unified First Law and Thermodynamics of Apparent Horizon in FRW Universe"}, "summary": "In this paper we revisit the relation between the Friedmann equations and the\nfirst law of thermodynamics. We find that the unified first law firstly\nproposed by Hayward to treat the \"outer\"trapping horizon of dynamical black\nhole can be used to the apparent horizon (a kind of \"inner\" trapping horizon in\nthe context of the FRW cosmology) of the FRW universe. We discuss three kinds\nof gravity theorties: Einstein theory, Lovelock thoery and scalar-tensor\ntheory. In Einstein theory, the first law of thermodynamics is always satisfied\non the apparent horizon. In Lovelock theory, treating the higher derivative\nterms as an effective energy-momentum tensor, we find that this method can give\nthe same entropy formula for the apparent horizon as that of black hole\nhorizon. This implies that the Clausius relation holds for the Lovelock theory.\nIn scalar-tensor gravity, we find, by using the same procedure, the Clausius\nrelation no longer holds. This indicates that the apparent horizon of FRW\nuniverse in the scalar-tensor gravity corresponds to a system of\nnon-equilibrium thermodynamics. We show this point by using the method\ndeveloped recently by Eling {\\it et al.} for dealing with the $f(R)$ gravity.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0611061%2Cgr-qc%2F0611054%2Cgr-qc%2F0611077%2Cgr-qc%2F0611031%2Cgr-qc%2F0611094%2Cgr-qc%2F0611034%2Cgr-qc%2F0611115%2Cgr-qc%2F0611003%2Cgr-qc%2F0611035%2Cgr-qc%2F0611023%2Cgr-qc%2F0611126%2Cgr-qc%2F0611004%2Cgr-qc%2F0611125%2Cgr-qc%2F0611122%2Cgr-qc%2F0611110%2Cgr-qc%2F0611129%2Cgr-qc%2F0611075%2Cgr-qc%2F0611134%2Cgr-qc%2F0611118%2Cgr-qc%2F0611098%2Cgr-qc%2F0611155%2Cgr-qc%2F0611045%2Cgr-qc%2F0611056%2Cgr-qc%2F0611021%2Cgr-qc%2F0611131%2Cgr-qc%2F0611142%2Cgr-qc%2F0611032%2Cgr-qc%2F0611087%2Cgr-qc%2F0611097%2Cgr-qc%2F0611084%2Cgr-qc%2F0611052%2Cgr-qc%2F0611018%2Cgr-qc%2F0611027%2Cgr-qc%2F0611095%2Cgr-qc%2F0611068%2Cgr-qc%2F0611156%2Cgr-qc%2F0611081%2Cgr-qc%2F0611154%2Cgr-qc%2F0611127%2Cgr-qc%2F0611011%2Cgr-qc%2F0611123%2Cgr-qc%2F0611069%2Cgr-qc%2F0611036%2Cgr-qc%2F0611005%2Cgr-qc%2F0611025%2Cgr-qc%2F0611059%2Cgr-qc%2F0611116%2Cgr-qc%2F0611043%2Cgr-qc%2F0611105%2Cgr-qc%2F0611086%2Cgr-qc%2F0611071%2Cgr-qc%2F0611141%2Cgr-qc%2F0611057%2Cgr-qc%2F0611008%2Cgr-qc%2F0611037%2Cgr-qc%2F0611015%2Cgr-qc%2F0611092%2Cgr-qc%2F0611124%2Cgr-qc%2F0611017%2Cgr-qc%2F0611145%2Cgr-qc%2F0611091%2Cgr-qc%2F0611149%2Cgr-qc%2F0611100%2Cgr-qc%2F0611046%2Cgr-qc%2F0611030%2Cgr-qc%2F0611148%2Cgr-qc%2F0611006%2Cgr-qc%2F0611063%2Cgr-qc%2F0611029%2Cgr-qc%2F0611070%2Cgr-qc%2F0611099%2Cgr-qc%2F0611112%2Cgr-qc%2F0611109%2Cgr-qc%2F0611041%2Cgr-qc%2F0611135%2Cgr-qc%2F0611001%2Cgr-qc%2F0611076%2Cgr-qc%2F0611073%2Cgr-qc%2F0611047%2Cgr-qc%2F0611103%2Cgr-qc%2F0611078%2Cgr-qc%2F0611136%2Cgr-qc%2F0611132%2Cgr-qc%2F0611102%2Cgr-qc%2F0611072%2Cgr-qc%2F0611133%2Cgr-qc%2F0611119%2Cgr-qc%2F0611051%2Cgr-qc%2F0611107%2Cgr-qc%2F0611007%2Cgr-qc%2F0611089%2Cgr-qc%2F0611096%2Cgr-qc%2F0611146%2Cgr-qc%2F0611111%2Cgr-qc%2F0611152%2Cgr-qc%2F0611114%2Cgr-qc%2F0611013%2Cgr-qc%2F0611106%2Cgr-qc%2F0611067%2Cgr-qc%2F0611104%2Cgr-qc%2F0611143&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we revisit the relation between the Friedmann equations and the\nfirst law of thermodynamics. We find that the unified first law firstly\nproposed by Hayward to treat the \"outer\"trapping horizon of dynamical black\nhole can be used to the apparent horizon (a kind of \"inner\" trapping horizon in\nthe context of the FRW cosmology) of the FRW universe. We discuss three kinds\nof gravity theorties: Einstein theory, Lovelock thoery and scalar-tensor\ntheory. In Einstein theory, the first law of thermodynamics is always satisfied\non the apparent horizon. In Lovelock theory, treating the higher derivative\nterms as an effective energy-momentum tensor, we find that this method can give\nthe same entropy formula for the apparent horizon as that of black hole\nhorizon. This implies that the Clausius relation holds for the Lovelock theory.\nIn scalar-tensor gravity, we find, by using the same procedure, the Clausius\nrelation no longer holds. This indicates that the apparent horizon of FRW\nuniverse in the scalar-tensor gravity corresponds to a system of\nnon-equilibrium thermodynamics. We show this point by using the method\ndeveloped recently by Eling {\\it et al.} for dealing with the $f(R)$ gravity."}, "authors": ["Rong-Gen Cai", "Li-Ming Cao"], "author_detail": {"name": "Li-Ming Cao"}, "author": "Li-Ming Cao", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.75.064008", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0611071v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0611071v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "v2: revtex, 23 pages, references added, minor changes, to appear in\n  PRD", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0611071v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0611071v2", "journal_reference": "Phys.Rev.D75:064008,2007", "doi": "10.1103/PhysRevD.75.064008", "fulltext": "Unified First Law and Thermodynamics of Apparent Horizon in FRW Universe\nRong-Gen Cai∗\nInstitute of Theoretical Physics, Chinese Academy of Sciences, P.O. Box 2735, Beijing 100080, China\n\nLi-Ming Cao†\nInstitute of Theoretical Physics, Chinese Academy of Sciences, P.O. Box 2735, Beijing 100080, China\n\narXiv:gr-qc/0611071v2 24 Feb 2007\n\nGraduate School of the Chinese Academy of Sciences, Beijing 100039, China\nIn this paper we revisit the relation between the Friedmann equations and the first law\nof thermodynamics. We find that the unified first law firstly proposed by Hayward to treat\nthe \"outer\"trapping horizon of dynamical black hole can be used to the apparent horizon\n(a kind of \"inner\" trapping horizon in the context of the FRW cosmology) of the FRW\nuniverse. We discuss three kinds of gravity theorties: Einstein theory, Lovelock thoery and\nscalar-tensor theory. In Einstein theory, the first law of thermodynamics is always satisfied on\nthe apparent horizon. In Lovelock theory, treating the higher derivative terms as an effective\nenergy-momentum tensor, we find that this method can give the same entropy formula for the\napparent horizon as that of black hole horizon. This implies that the Clausius relation holds\nfor the Lovelock theory. In scalar-tensor gravity, we find, by using the same procedure, the\nClausius relation no longer holds. This indicates that the apparent horizon of FRW universe\nin the scalar-tensor gravity corresponds to a system of non-equilibrium thermodynamics. We\nshow this point by using the method developed recently by Eling et al. for dealing with the\nf (R) gravity.\n\nI.\n\nINTRODUCTION\n\nQuantum mechanics together with general relativity predicts that black hole behaves like a\nblack body, emitting thermal radiations, with a temperature proportional to its surface gravity at\nthe black hole horizon and with an entropy proportional to its horizon area [1, 2]. The Hawking\ntemperature and horizon entropy together with the black hole mass obey the first law of black\nhole thermodynamics (dM = T dS) [3]. The formulae of black hole entropy and temperature have\na certain universality in the sense that the horizon area and surface gravity are purely geometric\nquantities determined by the spacetime geometry.\nSince the discovery of black hole thermodynamics in 1970's, physicists have been speculating\n∗\n†\n\ne-mail address: cairg@itp.ac.cn\ne-mail address: caolm@itp.ac.cn\n\n\f2\nthat there should be some relation between the thermodynamic laws and Einstein equations. Otherwise, how does general relativity know that the horizon area of black hole is related to its entropy\nand the surface gravity to its temperature [4]? Indeed, Jacobson [4] was able to derive Einstein\nequations from the proportionality of entropy to the horizon area, A, together with the fundamental relation (Clausius relation) δQ = T dS, assuming the relation holds for all local Rindler causal\nhorizons through each spacetime point. Here δQ and T are the variation of heat flow and Unruh\ntemperature seen by an accelerated observer just inside the horizon. More recently, Eling et al.\nhave found that one can not get the right equations of motion for f (R) gravity if one simply uses\nthe Clausius relation and the entropy assumption S = αf ′ (R)A. In order to get the equations of\nmotion, an entropy production term has to be added to the Clausius relation. They have argued\nthat this corresponds to the non-equilibrium thermodynamics of space-time [5]. It is interesting to\nsee whether the non-equilibrium thermodynamics is needed in other gravity theories. In this paper,\nwe will discuss the scalar-tensor gravity by following [5]. By using entropy assumption S = αF (φ)A\nin the scalar-tensor gravity and Clausius relation with an appropriate entropy production term,\nwe can obtain correct equations of motion for the scalar-tensor gravity. This suggests that for the\nscalar-tensor gravity the non-equilibrium thermodynamics also has to be employed to derive the\ndynamic equations of motion of space-times.\nOn the other hand, most discussions of black hole thermodynamics have been focused on the\nstationary black holes. For dynamical (i.e., non-stationary) black holes, Hayward has proposed a\nmethod to deal with thermodynamics associated with trapping horizon of a dynamic black hole\nin 4-dimensional Einstein theory [6, 7, 8, 9]. In this method, for spherical symmetric space-times,\nEinstein equations can be rewritten in a form called \"unified first law\". Projecting this unified first\nlaw along trapping horizon, one gets the first law of thermodynamics for dynamical black hole. A\ndefinition of energy-supply, Ψ, is introduced in the unified first law. It is an energy flux defined\nby energy-momentum tensor of matter. After projecting along a vector ξ tangent to trapping\nhorizon, one finds hAΨ, ξi =\n\nκ\n8πG hdA, ξi.\n\nThis equation can be regarded as the Clausius relation of\n\nthe dynamical black hole. The Friedmann-Robertson-Walker (FRW) universe is one kind of nonstationary spherically symmetric space-times. Certainly, we can discuss its thermodynamics on the\ntrapping horizon. However, in the FRW universe, the trapping horizon (\"outer trapping horizon\")\nis absent, instead there exists a kind of cosmological horizon like trapping horizon (\"inner trapping\nhorizon\"). This horizon coincides with the apparent horizon in the context of the FRW cosmology.\nIn this paper, we therefore do not distinguish them. We will focus on this apparent horizon and\ndiscuss associated thermodynamics. An interesting question is whether the field equations for non-\n\n\f3\nEinstein gravity can be written to a form as the unified first law in Einstein gravity. We do not try\nto resolve this issue, instead we rewrite the field equations for non-Einstein gravity to a form of the\nEinstein gravity by introducing an effective energy-momentum tensor. Thus, we can use unified\nfirst law to non-Einstein gravity theories and get the thermodynamics of apparent horizon in the\nFRW universe in those theories. As a result, we have the equation hAΨ, ξi =\n\nκ\n8πG hdA, ξi\n\neven for\n\nthe non-Einstein gravity theories. But, the energy-supply Ψ here includes the contribution of the\neffective energy-momentum tensor.\nIn order to get the heat δQ (defined by integration of pure matter energy flux) in the Clausius\nrelation, we have to extract the contribution of pure matter fields from the hAΨ, ξi in the left\nhand side of the equation hAΨ, ξi =\n\nκ\n8πG hdA, ξi\n\nand put the others into the right hand side of the\n\nequation. Now, does the right hand side of the equation have the correct form of T dS in Clausius\nrelation? If the answer is yes, the Clausius relation holds and we are treating equilibrium thermodynamics. On the contrary, if the answer is no, the Clausius relation in equilibrium thermodynamics\ndoes no longer hold, and we have to treat the system with non-equilibrium thermodynamics. In\nthis paper, we will use this idea to treat the Lovelock gravity and scalar-tensor gravity. We find\nthat the Clausius relation holds in Lovelock gravity, while it breaks for the scalar-tensor gravity.\nWe will also show this point by using the method of Eling et al. developed for the f (R) gravity [5].\nThere exist some works dealing with the relation between the Einstein equations and the first law\nof thermodynamics. In a setup of a special kind of spherically symmetric black hole spacetimes,\nPadmanabhan et al. [10] showed that the Einstein equations on the black hole horizon can be\nwritten into the first law of thermodynamics, dE = T dS − P dV . This also holds in Lovelock\ngravity [10]. In the setting of FRW universe, some authors investigated the relation between the\nfirst law and the Friedmann equations describing the dynamic evolution of the universe [11]. In\nparticular, Cai and Kim in [12] derived the Friedmann equations by applying the fundamental\nrelation δQ = T δS to the apparent horizon of the FRW universe with any spatial curvature and\nassuming that the apparent horizon has temperature and entropy\nT =\n\n1\n,\n2πRA\n\nS=\n\n2\nπRA\n,\nG\n\n(1.1)\n\nwhere RA is the apparent horizon radius. Further they showed that using the same procedure, the\nFriedmann equations can be also derived in the Gauss-Bonnet gravity and more general Lovelock\ngravity. For the scalar-tensor gravity and f (R) gravity, the possibility to derive the corresponding\nFriedmann equations in those theories was investigated in [13]. More recently Akbar and Cai [14]\nhave shown that at the apparent horizon, the Friedmann equation can be written into a form of\n\n\f4\nthe first law of thermodynamics with a volume change term, not only in Einstein gravity, but also\nin Lovelock gravity.\nThis paper is organized as follows. In Sec. II, we give a brief review on the unified first law by\ngeneralizing it to (n + 1)-dimensional Einstein gravity. In Sec. III, we consider a FRW universe\nand give the projection vector which will be used in the following sections. In Sec. IV, we give the\nrigorous first law of thermodynamics on the apparent horizon for the FRW universe in Einstein\ntheory. In Sec. V, we treat the thermodynamics of apparent horizon in the Lovelock gravity and\nfind that the Clausius relation holds for the Lovelock gravity. In Sec. VI, we discuss the scalartensor gravity and show that the Clausius relation no longer holds. In Sec. VII, we derive the\nequations of motion for the scalar-tensor gravity by using the method of Eling et al. developed for\ndealing with the f (R) gravity. We end this paper with conclusion in Sec. VIII.\n\nII.\n\nA BRIEF REVIEW ON THE UNIFIED FIRST LAW\n\nHayward has proposed a general definition of black hole dynamics on trapping horizon in four\ndimensional Einstein theory [6, 7, 8, 9]. In this section, we will make a brief review and generalize\nhis discussions to the (n + 1)-dimensional Einstein gravity.\nFor an arbitrary (n + 1)-dimensional spherical symmetric space-time, locally we can put its\nmetric in the double-null form\nds2 = −2e−f dξ + dξ − + r 2 dΩ2n−1 ,\n\n(2.1)\n\nwhere dΩ2n−1 is the line element of an (n − 1)-sphere with unit radius, r and f are functions of\n(ξ + , ξ − ). Certainly, there are some remainder freedoms to choose the double-null coordinates.\nAssume that the space-time is time-orientable, and ∂± = ∂/∂ξ ± are future-pointing. Considering\nradial null geodesic congruence, from ds2 = 0, one can find that there are two kinds of null geodesics\ncorresponding to ξ + = constant and ξ − = constant, respectively. It is easy to get the expansions\nof these two congruences\nθ± = (n − 1)\n\n∂± r\n.\nr\n\n(2.2)\n\nThe expansion measures whether the light rays normal to the sphere are diverging (θ± > 0), or\nconverging (θ± < 0), or equivalently, whether the area of the sphere is increasing or decreasing in\nthe null directions.\nA sphere is said to be trapped, untrapped or marginal if (on this sphere)\nθ+ θ− > 0 ,\n\nθ+ θ− < 0 ,\n\nor\n\nθ+ θ− = 0 .\n\n(2.3)\n\n\f5\nNote that\ngab ∂a r∂b r = −\n\n2\nef r 2 θ+ θ− ,\n(n − 1)2\n\n(2.4)\n\nwe can write this definition to be\ngab ∂a r∂b r < 0,\n\ngab ∂a r∂b r > 0,\n\ngab ∂a r∂b r = 0 .\n\n(2.5)\n\nIf ef θ+ θ− is a function with nonvanishing derivatives, the space-time is divided into trapped and\nuntrapped regions, separated by marginal surface. Some subdivisions may be made as follows.\n(i) A trapped sphere is said to be future, if θ± < 0 (∂± r < 0) and past if θ± > 0 (∂± r > 0).\n(ii) On an untrapped sphere, a spatial or null normal vector z is outgoing if hdr, zi > 0 and\ningoing if hdr, zi < 0. Equivalently, fixing the orientation by locally θ+ > 0 and θ− < 0, z is\noutgoing if g(z, ∂+ ) > 0 or g(z, ∂− ) < 0 and ingoing if g(z, ∂+ ) < 0 or g(z, ∂− ) > 0. In particular,\n∂+ and ∂− are, respectively, the outgoing and ingoing null normal vectors.\n(iii) A marginal sphere with θ+ = 0 is future if θ− < 0, past if θ− > 0, bifurcating if θ− = 0,\nouter if ∂− θ+ < 0, inner if ∂− θ+ > 0 and degenerate if ∂− θ+ = 0.\nThe closure of a hypersurface foliated by future or past, outer or inner marginal sphere is called a\n(nondegenerate) trapping horizon.\nIn the works of Hayward, the future (past) outer trapping horizon is taken as the definition of\nblack (white) holes. i.e., on the marginal sphere of trapping horizon, we have\nθ+ = 0,\n\nθ− < 0,\n\n∂− θ+ < 0 ,\n\n(2.6)\n\n∂+ r = 0,\n\n∂− r < 0,\n\n∂− ∂+ r < 0 .\n\n(2.7)\n\nor equivalently\n\nHowever, in the FRW universe, we will treat a horizon which is similar to cosmological horizon\nin the de Sitter space-time. In this case, the surface gravity is negative. So, we need not the\nrequirement of \"outer\". In fact, we will take the future inner trapping horizon as a system on\nwhich the thermodynamics will be established.\nThe Misner-Sharp energy [7, 15, 16] is defined to be\nE=\n\n1\n(n − 1)Ωn−1 r n−2 (1 − gab ∂a r∂b r) .\n16πG\n\n(2.8)\n\nThis energy is the total energy (not only the passive energy) inside the sphere with radius r. It\nis a pure geometric quantity. From the definition, the ratio E/r n−2 controls the formation of\n\n\f6\nblack and white holes and trapped sphere generally [7, 16]. There are a lot of definitions for\nenergy in general relativity, such as, ADM mass for asymptotically flat space-time, Bondi-Sachs\nenergy defined at null infinity of the asymptotically flat space-time, Brown-York energy and LiuYau energy etc. [17, 18, 19, 20, 21]. These definitions can be found in a recent review [22]. The\nphysical meanings of Misner-Sharp energy, and the comparison of Misner-Sharp energy to ADM\nmass and Bondi-Sachs energy have been given in [7, 15]. For spherical space-time, Brown-York\nenergy agrees with the Liu-Yau energy, but they both differ from the Misner-Sharp energy. For\nexample, for the four dimensional Reissner-Nordström black hole, the Misner-Sharp energy differs\nfrom the Brown-York or Liu-Yau mass by a term which is the energy of the electromagnetic field\ninside the sphere. The Misner-Sharp energy has the relation to the structure of the space-time and\none can relate it to Einstein equations (see Eq. (2.11) below). This is an important advantage of\nMisner-Sharp energy.\nFrom the energy-momentum tensor Tab , we can give two useful invariants - work and energysupply:\n1\nW = − traceT = −g+− T +− ,\n2\n\n(2.9)\n\nΨa = Ta b ∂b r + W ∂a r .\n\n(2.10)\n\nBy using the Misner-Sharp energy and these two quantities, one can find that the (0, 0) component of Einstein equations can be written as\ndE = AΨ + W dV ,\nwhere A = Ωn−1 r n−1 and V =\n\n1\nn\nn Ωn−1 r\n\n(2.11)\n\nwith Ωn−1 = 2π n/2 /Γ(n/2) are area and volume of\n\na sphere with radius r. Equation (2.11) is called unified first law. It is the natural result of\nEinstein equations for spherical symmetric space-times. The unified first law (2.11) contains rich\ninformation. After projecting it along different directions, this equation gives different meanings.\nFor instance, (i) projecting the unified first law along the future null infinity, one has the Bondi\nenergy loss equation; (ii) projecting the unified first law along the flow of a thermodynamic material\nyields the first law of relativistic thermodynamics; (iii) projecting the unified first law along the\ntrapping horizon, one obtaines the first law of black hole thermodynamics. Here, we will concentrate\non the first law of black hole thermodynamics, which has the form\nhdE, zi =\n\nκ\nhdA, zi + W hdV, zi ,\n8πG\n\n(2.12)\n\n\f7\nwhere κ is the surface gravity of the trapping horizon, and is defined by\nκ=\n\n1 a\n∇ ∇a r ,\n2\n\n(2.13)\n\nwhere ∇ corresponds to the covariant derivative of two dimension space normal to the sphere, and\nz is a vector which is tangent to the trapping horizon (Certainly, z is not arbitrary and must satisfy\nsome conditions on the trapping horizon). In the double null coordinates, z can be expressed as\nz = z + ∂+ + z − ∂− .\n\n(2.14)\n\nThe equation (2.12) is obtained through projecting the unified first law along the vector z. The\nnontrivial part is to show\nhAΨ, zi =\n\nκ\nhdA, zi .\n8πG\n\n(2.15)\n\nAs mentioned above, we take the horizon to be\n∂+ r = 0 .\n\n(2.16)\n\nz a ∂a (∂+ r) = z + ∂+ ∂+ r + z − ∂− ∂+ r = 0 .\n\n(2.17)\n\nThen, one has on the marginal sphere,\n\nUsing Einstein equations and the definition of surface gravity, one can arrive at (2.15). The most\nimportant thing is to note that z is not arbitrary, on the trapping horizon it must satisfy the\nequation above, then\n∂+ ∂+ r\nz−\n.\n=−\n+\nz\n∂− ∂+ r\n\n(2.18)\n\nTherefore z belongs to the one dimensional subspace of the tangent space. The projection along z\nreplaces the extra differential by the differential of state space for black hole, one can arrive at the\nexact first law of the trapping horizon thermodynamics of dynamic black holes [8]. This equation\n(2.18) plays a curial role to get the projection vector. We will give this ratio for the FRW universe\nin the next section.\n\nIII.\n\nTRAPPING HORIZON AND APPARENT HORIZON OF THE FRW UNIVERSE\n\nNow, we consider an (n + 1)-dimensional FRW universe. We put the FRW metric in the form\nds2 = hab dxa dxb + r̃ 2 dΩ2n−1\n\n(3.1)\n\n\f8\nwhere x0 = t, x1 = r, r̃ = ar is the radius of the sphere and a is the scale factor. It should be noted\nhere, that r̃ = r̃(t, r) plays the role of sphere radius r defined in the previous section. Defining\n\u0012\n\u0012\n\u0013\n\u0013\na\na\n1\n1\n+\n−\ndt − √\ndt + √\ndξ = − √\ndr , dξ = − √\ndr ,\n(3.2)\n2\n2\n1 − kr 2\n1 − kr 2\nwhere k is the spatial curvature parameter of the FRW universe, we can put the FRW metric into\na double-null form\nds2 = −2dξ + dξ − + r̃ 2 dΩ2n−1 .\n\n(3.3)\n\nIt is easy to find\n√\n∂\n∂+ = + = − 2 ∂t −\n∂ξ\n\n√\n\n1 − kr 2\n∂r\na\n\n!\n\n,\n\n√\n∂\n∂− = − = − 2 ∂t +\n∂ξ\n\n√\n\n1 − kr 2\n∂r\na\n\n!\n\n,\n\n(3.4)\n\nwhere the minus signs ensure that ∂± are future pointing. The trapping horizon, we denote it by\nr̃A , is defined to be\n∂+ r̃|r̃=r̃A = 0 .\n\n(3.5)\n\nSolving this equation, one finds\n2\nr̃A\n=\n\nH2\n\n1\n+\n\nk\na2\n\n.\n\n(3.6)\n\nThis radius has the same form as apparent horizon [16]. It is not surprised because the trapping\nhorizon and apparent horizon coincide with each other in the FRW universe. On the other hand,\nwe have\n∂− r̃|r̃=r̃A = −2r̃A H < 0 ,\nthat is, this trapping horizon is future. A similar calculation on the trapping horizon gives\n\u0013\n\u0013\n\u0012\n\u0012\nk\nk\n∂− ∂+ r̃|r̃A = 2r̃A Ḣ + 2H 2 + 2 , ∂+ ∂+ r̃|r̃A = 2r̃A Ḣ − 2 .\na\na\nBy definition, one can find the surface gravity\n\u0013\n\u0012\n\u0013\n\u0012\nr̃A\nk\n1\nr̃ ̇A\n2\nκ=−\nḢ + 2H + 2 = −\n1−\n.\n2\na\nr̃A\n2H r̃A\n\n(3.7)\n\n(3.8)\n\n(3.9)\n\nFurther, we define\nǫ=\n\nr̃ ̇A\n.\n2H r̃A\n\n(3.10)\n\n\f9\nHere, we assume ǫ < 1 such that κ < 0. In another words, we are treating an \"inner\" trapping\nhorizon, rather than \"outer \" trapping horizon (with positive surface gravity) discussed by Hayward. Note that in references [11, 12], in fact, an approximation ǫ ≪ 1 has been used in calculating\nthe energy flow crossing the apparent horizon. In the present paper, no any approximation will be\nused. In terms of the horizon radius r̃A , we have\nḢ −\n\n2ǫ\nk\n=− 2 .\n2\na\nr̃A\n\n(3.11)\n\nSubstituting this into (3.8), we get\nz−\n∂+ ∂+ r̃\nǫ\n=−\n|r̃A =\n.\n+\nz\n∂− ∂+ r̃\n1−ǫ\nLet z + = 1, then z − =\n\nǫ\n1−ǫ ,\n\n(3.12)\n\nin the coordinates (t, r), we then can express z as\n√\n\n2\nz=−\n1−ǫ\n\n\u0012\n\n∂\n∂\n− (1 − 2ǫ)Hr\n∂t\n∂r\n\n\u0013\n\n,\n\n(3.13)\n\nwhere we have used the relation\n√\n\n1 − kr 2\n|r̃A = Hr|r̃A ,\na\n\n(3.14)\n\non the trapping horizon. Thus, if we use the (t, r) coordinates instead of double-null coordinates,\nany project vector ξ must have the form\n\u0012\n\u0013\n∂\n∂\nξ = ξt\n− (1 − 2ǫ)Hr\n.\n∂t\n∂r\n\n(3.15)\n\nCertainly, we can choose ξ t = 1. All calculations in this section are pure geometrical. Therefore\nthe results in this section are applicable for the FRW universe in any gravity theory.\n\nIV.\n\nTHERMODYNAMICS OF APPARENT HORIZON IN EINSTEIN GRAVITY\n\nConsider a Lagrangian for an (n + 1)-dimensional Einstein gravity with perfect fluid\nL=\n\nm\n1\nR+ L ,\n16πG\n\n(4.1)\n\nm\n\nwhere L denotes the Lagrangian for the perfect fluid. In the FRW universe, the energy-momentum\ntensor of the perfect fluid has the form\nm\n\nTab =Tab = (ρm + pm )Ua Ub + pm gab ,\n\n(4.2)\n\n\f10\nwhere ρm and pm are the energy density and pressure of the perfect fluid, respectively. It is easy\nto find that the energy-momentum tensor projecting onto two dimensional space-time normal to\nthe sphere has the form\nTab = diag(ρm ,\n\npm a2\n),\n1 − kr 2\n\nTa b = diag(−ρm , pm ).\n\n(4.3)\n\nand then the work term and energy-supply are\n1\nW = (ρm − pm ) ,\n2\n1\nΨt = − (ρm + pm )H r̃ ,\n2\n1\nΨr = (ρm + pm )a ,\n2\n\n(4.4)\n(4.5)\n(4.6)\n\nrespectively. One then has\n1\n1\nΨ = Ψt dt + Ψr dr = − (ρm + pm )H r̃dt + (ρm + pm )adr .\n2\n2\n\n(4.7)\n\nThus, on the trapping horizon/apparent horizon we have\ndE = AΨ + W dV = AΨ + AW dr̃A\n= −A(ρm + pm )H r̃A dt + Aρm dr̃A\n= V dρm + ρm dV = d (ρm V ) .\n\n(4.8)\n\nSubstituting the first Friedmann equation (H 2 + k/a2 = 16πGρm /(n(n − 1))) into the last line in\nthe above equation, one can get nothing but the differential of the Misner-Sharp energy. On the\nother hand, if use the Misner-Sharp energy (2.8) inside the apparent horizon with the radius (3.6),\nthe above equation (4.8) tells us nothing, but the first Friedmann equation [14].\nLet ξ be a vector tangent to the apparent horizon, which can be expressed as (3.15). From now\non we choose ξ t = 1, thus we have\nhdE, ξi = −AH r̃A [(1 − 2ǫ)ρm + pm )] .\n\n(4.9)\n\nA\nκ\ndA = −(n − 1) (1 − ǫ)\n2 (H r̃A dt + adr) .\n8πG\n8πGr̃A\n\n(4.10)\n\nOn the other hand,\n\nBy using Friedmann equation, we have\nA\nκ\nhdA, ξi = −(n − 1)2ǫ (1 − ǫ)\n2 H r̃A\n8πG\n8πGr̃A\n= −(1 − ǫ)AH r̃A (ρm + pm ) .\n\n(4.11)\n\n\f11\nSimilarly, one can show\nhW dV, ξi = ǫAH r̃A (ρm − pm ) .\n\n(4.12)\n\nκ\nhdA, ξi + hW dV, ξi = −AH r̃A [(1 − 2ǫ)ρm + pm )] .\n8πG\n\n(4.13)\n\nCombining them yields\n\nThus we have shown that the unified first law on the inner trapping horizon has the form\nhdE, ξi =\n\nκ\nhdA, ξi + hW dV, ξi.\n8πG\n\n(4.14)\n\nHere some remarks are in order. (i) The unified first law (2.11) is not a real first law of thermodynamics, but just an identity concerning the (0, 0) component of Einstein equations. However, the\nprojection of the unified first law along a trapping horizon (or apparent horizon in FRW cosmology\ncontext) gives a real first law of thermodynamics. (ii) The Misner-Sharp energy plays an important role in the unified first law and the definition of work and energy-supply is very useful. The\nseparation of work and energy-supply gives a very similar form as the first law of thermodynamics\nbefore projecting it along the horizon. (iii) On the horizon, the energy-supply has the form\nhAΨ, ξi =\n\nκ\nhdA, ξi\n8πG\n\n(4.15)\n\nThis is the Clausius relation in the version of black hole thermodynamics. The left hand side of\nthe above equation is nothing but heat flow δQ defined by the matter energy-momentum tensor.\nThe right hand side has the form T dS if one identities that temperature T = κ/2π and S = A/4G.\nThus we conclude that in Einstein theory, the unified first law also imples the Clausius relation\nδQ = T dS. (iv) For the FRW cosmology in Einstein theory, the Misner-Sharp energy inside the\ntrapping horizon is E = ρm V (see (4.8))-the energy density times the volume. This energy form\nfor the FRW cosmology in Einstein theory is very special. In general, the Misner-Sharp energy has\nno such a form in other gravity theories, which will be seen in next sections.\n\nV.\n\nTHERMODYNAMICS OF APPARENT HORIZON IN LOVELOCK GRAVITY\n\nThe Lagrangian of the Lovelock gravity [23] consists of the dimensionally extended Euler densities\nL=\n\nm\nX\ni=0\n\nci Li ,\n\n(5.1)\n\n\f12\nwhere ci is an arbitrary constant, m ≤ [n/2] and Li is the Euler density of a 2i-dimensional manifold\nLi =\n\n1 a1 b1 ***ai bi c1 d1\nci di\nδ\nR\na1 b1 * * * R\nai bi .\n2i c1 d1 ***ci di\n\n(5.2)\n\nL0 corresponds to the cosmological term. L1 is just the Einstein-Hilbert term, and L2 corresponds\nto the so called \"Gauss-Bonnet\" term. Although the Lagrangian of the Lovelock theory contains\nhigher curvature terms, there are no terms with more than second order derivatives of metric in\nequations of motion. This point can be directly found from the equations of motion\nGba =\n\nm\nX\nci aa1 b1 ***ai bi c1d1\nci di\nδbc1 d1 ***ci di R\na1 b1 * * * R\nai bi = 0 .\ni+1\n2\n\n(5.3)\n\ni=0\n\nIf we introduce matter fields, the equations of motion become\nGba\n\nm\nX\nm\nci aa1 b1 ***ai bi c1d1\nci di\na\n=\nδ\nR\n*\n*\n*\nR\n=\n8πG\nT\na\nb\na\nb\n1\n1\nb .\ni\ni\n2i+1 bc1 d1 ***ci di\n\n(5.4)\n\ni=0\n\nIn the FRW cosmology, the energy-momentum tensor is still taken to be that of perfect fluid. We\ncan put this equations of motion into the standard form in Einstein gravity by moving those terms\nexcept the Einstein tensor into the right hand side of the equation\n\u0012m\n\u0013\ne\na\na\na\nGb = 8πG Tb + Tb ,\n\n(5.5)\n\ne\n\nwhere the effective energy-momentum tensor Tba has the expression\ne\nTba\n\nm\nX\nci aa1 b1 ***ai bi c1 d1\n1\nci di\nδbc1 d1 ***ci di R\n=−\na1 b1 * * * R\nai bi .\ni+1\n8πG\n2\n\n(5.6)\n\ni=0,i6=1\n\nIn the FRW metric, some non-vanishing components of Riemann tensor have the forms\n\u0010\n\u0011\nRtr tr = Ḣ + H 2 , Rti tj = Ḣ + H 2 δji ,\n\u0012\n\u0013\n\u0012\n\u0013\nk\nk\nij\nri\n2\ni\nij\n2\nR rj = H + 2 δj , R kl = H + 2 δkl\n.\na\na\n\n(5.7)\n\nSubstituting these into (5.6), we have\n\u0013\n\u0012\nm\nX\nb\nci\n1\nk i\n2\n,\n=−\nH + 2\n8πG\n2\na\n\n(5.8)\n\n\"\u0012\n\u0013i\n\u0013i−1 \u0012\n\u0013#\n\u0012\nm\nX\n2i\nk\nb\nci\nk\nk\n1\nḢ − 2\n,\nH2 + 2\nH2 + 2 +\n=−\n8πG\n2\na\nn\na\na\n\n(5.9)\n\ne\n\nTtt\n\ni=0,i6=1\n\ne\nTrr\n\ni=0,i6=1\n\nwhere\nci =\nb\n\nn!\nci .\n(n − 2i)!\n\n(5.10)\n\n\f13\nThe work term can be decomposed as\nm\n\ne\n\nW =W + W ,\n\n(5.11)\n\nwhere\nm\n1\n1 ab m\nW = − h T ab = (ρm − pm ) ,\n2\n2\n\ne\n1 ab e\nW = − h T ab .\n2\n\nThe higher curvature terms produce the effective work term\n\"\u0012\n\u0013\n\u0013 \u0012\n\u0013#\n\u0012\nm\nX\ne\n1\ni\nk\nb\nci\nk i−1\nk i\n2\n2\nḢ − 2\n.\nH + 2\nH + 2 +\nW =\n8πG\n2\na\nn\na\na\n\n(5.12)\n\n(5.13)\n\ni=0,i6=1\n\nSimilarly, the energy-supply Ψ can also be divided into\nm\n\ne\n\nΨ = Ψ + Ψ,\n\n(5.14)\n\nwhere\nm\n\nm\n\nm\n\nb\nΨa = Ta ∂b r̃ + W ∂a r̃ ,\n\ne\n\ne\n\ne\n\nb\nΨa = Ta ∂b r̃ + W ∂a r̃ .\n\n(5.15)\n\nAfter some calculations we arrive at\nm\n1\n1\nΨ = − (ρm + pm )H r̃dt + (ρm + pm )adr ,\n2\n2\nm\nX\n1\nΨ =\n16πG\ne\n\ni=0,i6=1\n\n\"\n\nm\nX\n1\n−\n16πG\n\n\u0013i−1 \u0012\n\u0013#\nk\nk\nḢ − 2\nH r̃dt\nH2 + 2\na\na\n\u0013 \u0012\n\u0013#\n\u0012\nk\nk i−1\ni\n2\nḢ − 2\nadr .\nH + 2\nb\nci\nn\na\na\n\ni\nci\nb\nn\n\"\n\ni=0,i6=1\n\n(5.16)\n\n\u0012\n\n(5.17)\n\nThus, we have put the Lovelock theory into the form of Einstein theory with an effective energymomentum tensor, and the effective energy-momentum tensor has been used in the work and\nenergy-supply terms. These imply that the unified first law discussed previously is applicable as\nwell here and the energy has the form of the Misner-Sharp energy (2.8).\nThe Friedmann equations of Lovelock gravity read [12]\nm\nX\ni=0\n\nm\nX\ni=0\n\nib\nci\n\n\u0012\n\nci\nb\n\nk\nH + 2\na\n2\n\n\u0012\n\nk\nH + 2\na\n2\n\n\u0013i−1 \u0012\n\n\u0013i\n\nk\nḢ − 2\na\n\n= 16πGρm ,\n\n(5.18)\n\n\u0013\n\n(5.19)\n\n= −n8πG(ρm + pm ) .\n\n\f14\nUsing the Friedmann equations and the work and energy-supply terms given above, one can obtain\nthe differential of the Misner-Sharp energy from the unified first law. Turn around, if we use the\nMisner-Sharp energy and work and energy-supply terms, we can obtain the Friedmann equations\nin the Lovelock gravity from the unified first law. An interesting point is here that for the Lovelock\ngravity, we can not put the Misner-Sharp energy inside the trapping horizon into the form E = ρm V\nsince the effective energy-momentum tensor will make a contribution to the energy inside the\nhorizon [14]. Projecting the unified first law along the trapping horizon, we have\nhdE, ξi =\n\nκ\nhdA, ξi + hW dV, ξi ,\n8πG\n\n(5.20)\n\nsince we have written the equation of motion for the Lovelock gravity to the form of Einstein\ngravity. This projection implies that we have\nκ\nhdA, ξi .\n8πG\n\n(5.21)\n\ne\nκ\nhdA, ξi − hAΨ, ξi .\n8πG\n\n(5.22)\n\nhAΨ, ξi =\nNamely, we have\nm\n\nhAΨ, ξi =\n\nClearly, the left hand side is just the \"energy-supply\" projecting along ξ, which is nothing, but\nthe heat flow δQ defined by pure matter energy-momentum tensor. Thus, an interesting question\nis whether the right hand side of the equation can be of the form T dS in the Clausius relation as\nthe case in Einstein gravity? The answer is yes: the right hand side of the equation can indeed be\nwritten to a form with the surface gravity times the differential of the entropy in Lovelock theory\ne\n\nprojecting along ξ. Now we show this. From the definition of Ψ, we have\ne\nA\nκ\nhdA, ξi − hAΨ, ξi = −\n2 ǫ(1 − ǫ)(n − 1)H r̃A\n8πG\n4πGr̃A\n\"\n\u0012 \u0013#\nm\nX\ni(n − 1)! 1 i\nA\nci\nǫ(1 − ǫ)\n−\nH r̃A .\n2\n4πG\n(n − 2i)! r̃A\n\n(5.23)\n\ni=0,i6=1\n\nHaving considered c1 = 1, we can rewrite the above equation into\n\"\n\u0012 \u0013#\nm\nX\ne\ni(n − 1)! 1 i\nA\nκ\nH r̃A\nci\nhdA, ξi − hAΨ, ξi = −\nǫ(1 − ǫ)\n2\n8πG\n4πG\n(n − 2i)! r̃A\ni=0\n\u0015\nm \u0014\n1\n1 X\ni(n − 1)! n−2i\n= −\nr̃\n(1 − ǫ)Ωn−1 h\ndr̃A , ξi\nci\n2πr̃A\n4G\n(n − 2i)! A\ni=0\n\u0015\nm \u0014\nX\nκ\n1\ni(n − 1)!\nn−2i+1\n=\nΩn−1 h\ndr̃A\n, ξi\nci\n2π\n4G\n(n − 2i + 1)!\ni=0\n(\n\u0015)\nm \u0014\nX\ni(n − 1)!\nA\nκ\nci\nhd\nr̃ 2−2i\n, ξi\n=\n2π\n4G\n(n − 2i + 1)! A\ni=0\n\n= T hdS, ξi ,\n\n(5.24)\n\n\f15\nwhere T = κ/2π and\nS=\n\n\u0015\nm \u0014\nA X\ni(n − 1)!\n2−2i\nr̃A\n.\nci\n4G\n(n − 2i + 1)!\n\n(5.25)\n\ni=0\n\ne\nκ\n8πG hdA, ξi−hAΨ, ξi\n\nThus we have shown that\n\nis exactly the surface gravity times a total differential\n\nprojecting along the tangent direction of the trapping horizon. This total differential is nothing\nbut the differential of the horizon entropy defined in Lovelock gravity [12, 14, 24].\nAbove discussions tell us: In Lovelock gravity, if one uses the pure matter energy-momentum to\nm\n\ndefine δQ, i.e., δQ = hAΨ, ξi, then\n\nκ\n8πG hdA, ξi\n\ne\n\n− hAΨ, ξi is of the form T dS. That is, the Clausius\n\nrelation δQ = T dS still holds in Lovelock gravity.\nAn interesting question arises: does the Clausius relation always hold for any gravity theory?\nIn the next section, using the method developed in this section, we will show that the Clausius\nrelation does not hold in the scalar-tensor theory.\n\nVI.\n\nTHERMODYNAMICS OF APPARENT HORIZON IN SCALAR-TENSOR\nGRAVITY\n\nIn the Jordan frame, the Lagrangian of the scalar-tensor gravity in (n + 1)-dimensional spacetimes can be written as\nL=\n\n1\n1\nF (φ)R − gab ∂a φ∂b φ − V (φ) + Lm ,\n16πG\n2\n\n(6.1)\n\nwhere F (φ) is an positive continuous function of the scalar field φ and V (φ) is its potential. Varying\nthe action, we have the equations of motion\n\u0010 φ\nm \u0011\nF Gab + gab ∇2 F − ∇a ∇b F = 8πG Tab + Tab ,\n′\n\n∇2 φ − V (φ) +\n\n′\n1\nF (φ)R = 0 ,\n16πG\n\n(6.2)\n(6.3)\n\nφ\n\nm\n\nwhere Tab is the energy-momentum tensor of matter. We denote Tab by\n\u0012\n\u0013\nφ\n1 cd\nTab = ∂a φ∂b φ − gab\ng ∂c φ∂d φ + V (φ) .\n2\n\n(6.4)\n\nφ\n\nNote that here Tab is not the energy-momentum tensor of the scalar field. As the case of Lovelock\ngravity, in order to use the unified first law in Einstein gravity, we rewrite the equations of motion\ninto the following form\nGab = 8πGTab = 8πG\n\nm\ne \u0011\n1\u0010 φ\nTab + Tab + Tab ,\nF\n\n(6.5)\n\n\f16\nwhere\n\u0001\n1\n−gab ∇2 F + ∇a ∇b F .\n8πG\n\ne\n\nTab =\n\n(6.6)\n\nIn the FRW metric, it is easy to find that ∇2 F and the non-vanishing components of ∇a ∇b F are\n∇2 F = −F̈ − nH Ḟ ,\n\n∇t ∇t F = F̈ ,\n\n∇r ∇r F = −\n\na2\nH Ḟ ,\n1 − kr 2\n\n(6.7)\n\nrespectively. We then have\ne\n\nTtt =\n\ne\n\n1\nnH Ḟ ,\n8πG\n\nTrr =\n\n\u0011\n1 \u0010\nF̈ + (n − 1)H Ḟ .\n8πG\n\n(6.8)\n\nThe work term can be decomposed as\nφ\n\nm\n\ne\n\nW =W + W + W ,\n\n(6.9)\n\nwith\nφ\n\n1\n(ρφ + ρm − pφ − pm ) ,\n2F\n\n(6.10)\n\n\u0010\n\u0011\n1\nF̈ + (2n − 1)H Ḟ ,\n16πGF\n\n(6.11)\n\nm\n\nW + W=\ne\n\nW= −\nwhere\n\n1\nρφ = φ̇2 + V (φ),\n2\n\npφ =\n\n1 2\nφ̇ − V (φ).\n2\n\n(6.12)\n\nSimilarly, the energy-supply have the form\nφ\n\nm\n\ne\n\nΨ =Ψ + Ψ + Ψ ,\n\n(6.13)\n\nwith\nφ\n\nm\n\nΨ + Ψ= −\ne\n\n1\n1\n(ρφ + ρm + pφ + pm )H r̃dt +\n(ρφ + ρm + pφ + pm )adr ,\n2F\n2F\n\nΨ= −\n\n\u0010\n\u0010\n\u0011\n\u0011\n1\n1\nF̈ − H Ḟ H r̃dt +\nF̈ − H Ḟ adr .\n16πGF\n16πGF\n\n(6.14)\n\n(6.15)\n\nOn the trapping horizon/apparent horizon, the unified first law tells us\ndE = AΨ + W dV = AΨ + AW dr̃A\n\"\nA\n− (ρφ + ρm + pφ + pm )H r̃A dt + (ρφ + ρm )dr̃A\n=\nF\n#\n\u0011\n1 \u0010\n1\n−\nF̈ − H Ḟ H r̃A dt −\nnH Ḟ dr̃A .\n8πG\n8πG\n\n(6.16)\n\n\f17\nBy using Friedmann equations, one can find that dE is nothing but the exterior differential of the\nMisner-Sharp energy\nV\n1\nn−2\n=\n(n − 1)Ωn−1 r̃A\nE=\n16πG\nF\n\n\u0012\n\n1\nnH Ḟ\nρφ + ρm −\n8πG\n\n\u0013\n\n.\n\n(6.17)\n\nOn the other hand, if substituting the Misner-Sharp energy, work and energy-supply terms defined\nabove into the unified first law (6.16), we can obtain the Friedmann equations in the Scalar-Tensor\ngravity [13]:\n1\nn(n − 1)F\n2\n\n\u0012\n\nk\nH + 2\na\n\n\u0012\n\nk\na2\n\n\u0013\n\n− (n − 1)F\n\nḢ −\n\n2\n\n\u0013\n\n+ nH Ḟ = 8πG (ρφ + ρm ) ,\n\n(6.18)\n\n− (F̈ − H Ḟ ) = 8πG (ρφ + pφ + ρm + pm ) ,\n\n(6.19)\n\nwhere ρφ and pφ have the same form as (6.12). Since we have rewritten the equations of motion of\nthe scalar-tensor gravity into a form as in Einstein theory, the following equation should hold\nhdE, ξi =\n\nκ\nhdA, ξi + hW dV, ξi .\n8πG\n\n(6.20)\n\nwhere W is given by (6.9). Further we have\nhAΨ, ξi =\n\nκ\nhdA, ξi ,\n8πG\n\n(6.21)\n\nwhere Ψ is given by (6.13). Substituting Ψ into the above equation, we have\nφ\n\nm\n\nF hA Ψ, ξi + F hA Ψ, ξi =\n\ne\nκF\nhdA, ξi − F hA Ψ, ξi .\n8πG\n\n(6.22)\n\nThe left hand side of this equation can be explicitly expressed as\nφ\nm\n1\n1\nF hA Ψ, ξi + F hA Ψ, ξi = h− (ρφ + ρm + pφ + pm )H r̃dt + (ρφ + ρm + pφ + pm )adr, ξi . (6.23)\n2\n2\n\nThis is just the energy-supply term provided by matter and the scalar field. We denote it by δQ\nas the case in Einstein gravity. Can we put the right hand side of equation (6.22) into a form with\nthe surface gravity times a total differential projecting along the vector ξ as the case of Lovelock\ngravity? The answer is no in the present case. To see this, let us note that the right hand side of\nthe equation can be expressed as\n\u0010\n\u0011\ne\nκ\nκF\nκF\nhdA, ξi − F hA Ψ, ξi =\nA(n − 1)2ǫH r̃A −\nAr̃A F̈ − H Ḟ H r̃A\n8πG\n8πGr̃A\n8πG\n!\nA 2 Ḟ\n2\nr̃\n= T hdS, ξi + T\n,\n2 − H F̈ + H Ḟ\n4G A r̃A\n\n(6.24)\n\n\f18\nwhere\nT =\n\nκ\n,\n2π\n\nS=\n\nF (φ)A\n.\n4G\n\n(6.25)\n\nHere S has the form of the entropy of black holes in the scalar-tensor gravity [25]. Thus equation\n(6.22) can be reexpressed as\nδQ = T dS + T di S ,\nwhere\nA 2\ndi S =\nr̃\n4G A\n\nḞ\n2\n2 − H F̈ + H Ḟ\nr̃A\n\n(6.26)\n!\n\n.\n\n(6.27)\n\nThe equation (6.26) implies that the Clausius relation δQ = T dS does not hold for the scalartensor gravity. The term di S in (6.27) can be interpreted as the entropy production term in\nthe non-equilibrium thermodynamics associated with the apparent horizon. Indeed, in Einstein\ngravity, Jacobson [4] used the Clausius relation δQ = T dS and derived the Einstein field equations.\nHowever, recently Eling et al. [5] have found that the Clausius relation does not hold for the f (R)\ngravity, and that in order to obtain the equations of motion for the f (R) gravity, an entropy\nproduction term has to be added to the Clausius relation like (6.26). In the next section, following\n[4, 5], we will show that indeed for the scalar-tensor gravity, an additional entropy production term\nis needed for deriving the equations of motion.\n\nVII.\n\nSCALAR-TENSOR GRAVITY AND NON-EQUILIBRIUM THERMODYNAMICS\n\nIn [4], Jacobson derived Einstein equations from the proportionality of entropy to the horizon\narea, A, together with the fundamental Clausius relation δQ = T dS, assuming that the relation\nholds for all local Rindler causal horizons through each space-time point. Here δQ and T are\nthe variation of heat and Unruh temperature seen by a accelerated observer just inside the horizon. Recently, Elinget al. [5] have shown that the Clausius relation plus the entropy assumption\nS = αAf ′ (R) can not give the correct equations of motion for the f (R) gravity. In order to get correct equations of motion, one has to modify the equilibrium Clausius relation to a non-equilibrium\none; an entropy production term needs to be added to the Clausius relation of equilibrium thermodynamics. Namely, the f (R) gravity corresponds to a non-equilibrium thermodynamics of\nspace-time. In this section, we will deal with the scalar-tensor gravity by using their method.\nFor a space-time point p in (n + 1)-dimensions, locally, one can define a causal horizon as in [5]:\nChoose a spacelike (n − 1)-surface patch B including p and the choose one side of the boundary\n\n\f19\nof the past of B. Near the point p, this boundary is a congruence of the null geodesics orthogonal\nto B. These comprise the horizon. To define the heat flux, we can employ an approximate boost\nkilling vector χ which is future pointing on the causal horizon and vanishes at p. χ has a relation\nwith the tangent vector of causal horizon k: χ = −λk, where λ is the affine parameter of the\ncorresponding null geodesic line. The heat is defined to be the boost energy current of matter\n(including the scalar field in the scalar-tensor gravity) across the horizon\nδQ =\n\nZ\n\nTab χa dΣb .\n\n(7.1)\n\nUsing relation χ = −λk, and temperature T = ~/2π, we have\nZ\n\n2π\nδQ\n=\nT\n~\n\nTab ka kb (−λ)dλdn−1 A ,\n\n(7.2)\n\nwhere\nφ\n\nm\n\nTab =Tab + Tab .\n\n(7.3)\n\nAssuming that the entropy is of the form\nS = αF (φ)A ,\n\n(7.4)\n\nwhere α is a constant depending on the number and nature of quantum fields, we have\nδS = α\n\nZ\n\n(θF + Ḟ )dλdn−1 A ,\n\n(7.5)\n\nwhere θ is the expansion of null geodesic congruence and the overdot means the derivative with\nrespect to the affine parameter λ (do not confuse with the derivative with respect to t in the\nprevious sections). To extract the O(λ) term from the integrand, we differentiate it with respect\nto λ and use the requirement [5]: (θF + Ḟ )(p) = 0, at the point p, we have\nd\n(θF + Ḟ )|λ=0 = θ̇F − F −1 Ḟ 2 + F̈ .\ndλ\n\n(7.6)\n\nBy using Raychaudhuri equation for the null geodesic congruence in (n + 1)-dimensions\n1\nd\nθ=−\nθ 2 − σab σ ab − Rab ka kb\ndλ\nn−1\n\n(7.7)\n\nand the geodesic equation, we can rewrite equation (7.6) as\n− ka kb (Rab − ∇a ∇b F + F −1 ∇a F ∇b F ) −\n\n1\nF θ 2 − F σab σ ab .\nn−1\n\n(7.8)\n\n\f20\nWe assume that the shear term vanishes in the whole space-time. With the Clausius relation, we\nhave\nF Rab − ∇a ∇b F +\n\nm\n2π φ\nn\nF −1 ∇a F ∇b F + Φgab =\n(Tab + Tab ) .\nn−1\nα~\nφ\n\nwhere Φ is an undetermined function and Tab = ∂a φ∂b φ − gab\n\n1 cd\n2 g ∂c φ∂d φ\n\nm\n\n(7.9)\n\n\u0001\n+ V (φ) . We assume\n\nthat the matter stress tensor is divergence free, i.e., ∇a Tab = 0, but due to the coupling function\nφ\n\nφ\n\nF (φ) between φ and scalar curvature R, the Tab is not conserved, namely, ∇a Tab 6= 0. Instead the\nφ\n\ndivergence of Tab is\nφ\n\n′\n\n∇a Tab = ∇2 φ∇b φ − V (φ)∇b φ .\n\n(7.10)\n\n1\n1\n′\n∇a (F Rab − ∇a ∇b F ) = ∇b (F R) − ∇b ∇2 F − RF ∇b φ\n2\n2\n\n(7.11)\n\nConsidering the identity\n\nand taking divergence for both sides of the equation (7.9), we find\n\u0013\n\u0013\n\u0012\n\u0012\nn\n1\na\n−1\n2\nF ∇a F ∇b F\n∇b Φ = ∇b ∇ F − F R − ∇\n2\nn−1\n\u0012\n\u0011\u0013\n2π \u0010 2\n1 ′\n′\n∇ φ−V\n∇b φ .\nF R+\n+\n2\nα~\n\n(7.12)\n\nThe last term in the right hand side of the above equation is nothing, but the equation of motion\nfor the scalar field. Therefore this term always vanishes. While the left hand side is a pure gradient\n\u0010\n\u0011\nn\nof a scalar, the second term in the right hand side of the equation ∇a n−1\nF −1 ∇a F ∇b F can not\n\nalways be written as the gradient of a scalar. As a result, as the case of f (R) gravity [5], there\nis a contradiction here. To resolve this, we add an entropy production term di S to the Clausius\nrelation. It is easy to find if we choose\ndi S =\n\nZ\n\nσdλdn−1 A\n\n(7.13)\n\nwith entropy production density\nσ=−\n\nn\nαF −1 Ḟ 2 λ\nn−1\n\n(7.14)\n\nand use the equation of motion for the scalar field\n\u0011\n2π \u0010 2\n1 ′\n′\n∇ φ − V = 0,\nF R+\n2\nα~\n\n(7.15)\n\nThe field equations (7.9) for the scalar-tensor theory become\nF Gab − ∇a ∇b F + gab ∇2 F =\n\nm\n2π φ\n(Tab + Tab ) ,\nα~\n\n(7.16)\n\n\f21\nwhere Gab is the Einstein tensor. Taking α =\n\n1\n4G~ ,\n\nequations (7.16) and (7.15) are just the equations\n\nof motion for gab and φ in the scalar-tensor gravity theory, whose Lagrangian is given by (6.1).\nThus we conclude that in order to get the equations of motion in the scalar-tensor gravity, the\nClausius relation has to be modified; we have to add an entropy production term di S (7.13) to the\nClausius relation. This suggests that as the case of f (R) gravity, the scalar-tensor gravity corresponds to non-equilibrium thermodynamics of space-time. We note that this entropy production\nterm (7.13) does not coincide with the entropy production term (6.27) in the setup of the FRW\nuniverse although they look similar to each other. This is not surprised because the analysis of Eling et al. is locally at each space-time point, while our previous analysis is focused on the trapping\nhorizon/apparent horizon of the FRW universe. The common point between them is that both of\nthem imply that the scalar-tensor gravity requires a non-equilibrium thermodynamic treatment as\nthe f (R) gravity.\n\nVIII.\n\nCONCLUSIONS\n\nIn this paper we have revisited the relation between the Friedmann equations and the thermodynamics on the trapping horizon/apparent horizon in the FRW universe. We have generalized\nthe unified first law to the case of (n + 1)-dimensional Einstein theory. After projecting the unified first law along \"inner\" trapping horizon/apparent horizon, we have obtained the first law of\nthermodynamics of the FRW universe, which is very similar to the thermodynamics of dynamic\nblack holes on their \"outer\" trapping horizon. The form of the first law of thermodynamics is\nrigorous without any approximation. For non-Einstein gravity theories, we have rewritten the field\nequations to a form of Einstein gravity by introducing an effective energy-momentum tensor and\ntreated them as Einstein gravity theory. In these theories the first law of thermodynamics for the\napparent horizon in the FRW universe has the same form\nhdE, ξi =\n\nκ\nhdA, ξi + hW dV, ξi .\n8πG\n\nwhere E is the Misner-Sharp energy, as the case of Einstein gravity theory. But here W is an\neffective work term, the Misner-Sharp energy is fixed to be the form of equation (2.8) because it\nis defined through space-time geometry. In the Lovelock gravity, if we define the heat δQ by pure\nmatter energy-supply projecting along the horizon, we find that the Clausius relation\nδQ = T dS\n\n\f22\nstill holds, where T = κ/2π and S is of the exact form of the entropy of black hole horizon in\nthe Lovelock gravity. However, the same treatment tells us that the Clausius relation can not be\nfulfilled for the scalar-tensor gravity. We have to introduce an entropy production term to the\nClausius relation\nδQ = T dS + T di S .\nThis implies that the thermodynamics of apparent horizon is a non-equilibrium thermodynamics\nfor the scalar-tensor theory.\nFollowing Eling et al. [5], we have treated the scalar-tensor gravity and shown that the Clausius\nrelation plus the entropy form S = αF (φ)A can not give the correct equations of motion for the\ntheory. In order to resolve this issue, we have to modify the Clausius relation by introducing an\nentropy production term. This also indicates that the scalar-tensor gravity is the non-equilibrium\nthermodynamics of spacetime as the case of f (R) gravity.\n\nAcknowledgements\n\nWe thank M. Akbar for useful discussions. This research was finished during R.G.C's visit to\nthe ICTS at USTC, Hefei and the department of physics of Fudan university, Shanghai, the warm\nhospitality in both places extended to him is appreciated. This work is supported by grants from\nNSFC, China (Nos. 10325525 and 90403029), and a grants from the Chinese Academy of Science.\n\n[1] S. W. Hawking, Commun. Math. Phys. 43, 199 (1975).\n[2] J. D. Bekenstein, Phys. Rev. D 7, 2333 (1973).\n[3] J. M. Bardeen, B. Carter and S. W. Hawking, Commun. Math. Phys. 31, 161 (1973).\n[4] T. Jacobson, Phys. Rev. Lett. 75, 1260 (1995) [arXiv:gr-qc/9504004].\n[5] C. Eling, R. Guedens, and T. Jacobson, Phys. Rev. Lett. 96, 121301 (2006).\n[6] S. A. Hayward, Phys. Rev. D 49, 6467 (1994).\n[7] S. A. Hayward, Phys. Rev. D 53, 1938 (1996) [arXiv:gr-qc/9408002].\n[8] S. A. Hayward, Class. Quant. Grav. 15, 3147 (1998) [arXiv:gr-qc/9710089].\n[9] S. A. Hayward, S. Mukohyama and M. C. Ashworth, Phys. Lett. A 256, 347 (1999)\n[arXiv:gr-qc/9810006].\n[10] A. Paranjape, S. Sarkar and T. Padmanabhan, arXiv:hep-th/0607240; T. Padmanabhan, Class. Quant.\nGrav. 19, 5387 (2002)[arXiv: gr-qc/0204019]; Phys. Rept. 406, 49 (2005)[arXiv: gr-qc/0311036];\nT. Padmanabhan, arXiv:gr-qc/0606061.\n\n\f23\n[11] A. V. Frolov and L. Kofman, JCAP 0305, 009 (2003) [arXiv:hep-th/0212327]; U. H. Danielsson, arXiv:hep-th/0411172; R. Bousso, arXiv:hep-th/0412197; G. Calcagni, JHEP 0509, 060 (2005)\n[arXiv:hep-th/0507125].\n[12] R. G. Cai and S. P. Kim, JHEP 0502, 050 (2005) [arXiv:hep-th/0501055].\n[13] M. Akbar and R. G. Cai, Phys. Lett. B 635, 7 (2006) [arXiv:hep-th/0602156].\n[14] M. Akbar and R. G. Cai, arXiv:hep-th/0609128.\n[15] C. W. Misner, D. H. Sharp Phys. Rev. 136 B 571 (1964)\n[16] D. Bak and S. J. Rey, Class. Quant. Grav. 17, L83 (2000) [arXiv:hep-th/9902173].\n[17] R. Arnowitt, S. Deser, and C. Misner, 1962, \"The Dynamics of General Relativity\" in Gravitation: An\nIntroduction to Current Research, ed. L. Witten (New York: Wiley).\n[18] H. Bondi, M. G. J. van der Burg and A. W. K. Metzner, Proc. Roy. Soc. Lond. A 269, 21 (1962).\n[19] R. K. Sachs, Proc. Roy. Soc. Lond. A 270, 103 (1962).\n[20] J.D. Brown and J.W. York, Phys. Rev. D47, 1407 (1993).\n[21] C. C. M. Liu, and S. T. Yau, Phys. Rev. Lett. 90, 231102, (2003).\n[22] L. B. Szabados, \"Quasi-Local Energy-Momentum and Angular Momentum in GR: A Review Article,\"\nLiving Rev. Rel. 7, 4 (2004).\n[23] D. Lovelock, J. Math. Phys. 12, 498 (1971).\n[24] R. G. Cai, Phys. Lett. B 582, 237 (2004) [arXiv:hep-th/0311240].\n[25] R. G. Cai and Y. S. Myung, Phys. Rev. D 56, 3466 (1997).\n\n\f"}