{"id": "http://arxiv.org/abs/gr-qc/0511123v2", "guidislink": true, "updated": "2005-11-28T06:44:29Z", "updated_parsed": [2005, 11, 28, 6, 44, 29, 0, 332, 0], "published": "2005-11-23T10:19:49Z", "published_parsed": [2005, 11, 23, 10, 19, 49, 2, 327, 0], "title": "Derivation of the Raychaudhuri Equation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0511116%2Cgr-qc%2F0511005%2Cgr-qc%2F0511114%2Cgr-qc%2F0511050%2Cgr-qc%2F0511111%2Cgr-qc%2F0511007%2Cgr-qc%2F0511113%2Cgr-qc%2F0511015%2Cgr-qc%2F0511159%2Cgr-qc%2F0511163%2Cgr-qc%2F0511104%2Cgr-qc%2F0511051%2Cgr-qc%2F0511052%2Cgr-qc%2F0511096%2Cgr-qc%2F0511032%2Cgr-qc%2F0511038%2Cgr-qc%2F0511148%2Cgr-qc%2F0511060%2Cgr-qc%2F0511145%2Cgr-qc%2F0511155%2Cgr-qc%2F0511044%2Cgr-qc%2F0511056%2Cgr-qc%2F0511075%2Cgr-qc%2F0511132%2Cgr-qc%2F0511149%2Cgr-qc%2F0511120%2Cgr-qc%2F0511091%2Cgr-qc%2F0511065%2Cgr-qc%2F0511123%2Cgr-qc%2F0511092%2Cgr-qc%2F0511003%2Cgr-qc%2F0511108%2Cgr-qc%2F0511128%2Cgr-qc%2F0511054%2Cgr-qc%2F0511057%2Cgr-qc%2F0511097%2Cgr-qc%2F0511061%2Cgr-qc%2F0511110%2Cgr-qc%2F0511124%2Cgr-qc%2F0511069%2Cgr-qc%2F0511047%2Cgr-qc%2F0511152%2Cgr-qc%2F0511013%2Cgr-qc%2F0511006%2Cgr-qc%2F0511041%2Cgr-qc%2F0511134%2Cgr-qc%2F0511040%2Cgr-qc%2F0511137%2Cgr-qc%2F0511158%2Cgr-qc%2F0511106%2Cgr-qc%2F0511019%2Cgr-qc%2F0511021%2Cgr-qc%2F0511133%2Cgr-qc%2F0511066%2Cgr-qc%2F0511009%2Cgr-qc%2F0511088%2Cgr-qc%2F0511028%2Cgr-qc%2F0511062%2Cgr-qc%2F0511150%2Cgr-qc%2F0511077%2Cgr-qc%2F0511135%2Cgr-qc%2F0511103%2Cgr-qc%2F0511083%2Cgr-qc%2F0511153%2Cgr-qc%2F0511010%2Cgr-qc%2F0511034%2Cgr-qc%2F0511089%2Cgr-qc%2F0511023%2Cgr-qc%2F0511074%2Cgr-qc%2F0511157%2Cgr-qc%2F0511127%2Cgr-qc%2F0511082%2Cgr-qc%2F0511031%2Cgr-qc%2F0511020%2Cgr-qc%2F0511035%2Cgr-qc%2F0511080%2Cgr-qc%2F0511026%2Cgr-qc%2F0511043%2Cgr-qc%2F0511079%2Cgr-qc%2F0511011%2Cgr-qc%2F0511055%2Cgr-qc%2F0511004%2Cgr-qc%2F0511085%2Cgr-qc%2F0511146%2Cgr-qc%2F0511076%2Cgr-qc%2F0511117%2Cgr-qc%2F0511002%2Cgr-qc%2F0511046%2Cgr-qc%2F0511094%2Cgr-qc%2F0511068%2Cgr-qc%2F0511090%2Cgr-qc%2F0511063%2Cgr-qc%2F0511049%2Cgr-qc%2F0511081%2Cgr-qc%2F0511042%2Cgr-qc%2F0511018%2Cgr-qc%2F0511012%2Cgr-qc%2F0511143%2Cgr-qc%2F0511048%2Cgr-qc%2F0511099%2Cgr-qc%2F0511101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Derivation of the Raychaudhuri Equation"}, "summary": "As a homage to A K Raychaudhuri, I derive in a straightforward way his famous\nequation and also indicate the problems he was last engaged in.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0511116%2Cgr-qc%2F0511005%2Cgr-qc%2F0511114%2Cgr-qc%2F0511050%2Cgr-qc%2F0511111%2Cgr-qc%2F0511007%2Cgr-qc%2F0511113%2Cgr-qc%2F0511015%2Cgr-qc%2F0511159%2Cgr-qc%2F0511163%2Cgr-qc%2F0511104%2Cgr-qc%2F0511051%2Cgr-qc%2F0511052%2Cgr-qc%2F0511096%2Cgr-qc%2F0511032%2Cgr-qc%2F0511038%2Cgr-qc%2F0511148%2Cgr-qc%2F0511060%2Cgr-qc%2F0511145%2Cgr-qc%2F0511155%2Cgr-qc%2F0511044%2Cgr-qc%2F0511056%2Cgr-qc%2F0511075%2Cgr-qc%2F0511132%2Cgr-qc%2F0511149%2Cgr-qc%2F0511120%2Cgr-qc%2F0511091%2Cgr-qc%2F0511065%2Cgr-qc%2F0511123%2Cgr-qc%2F0511092%2Cgr-qc%2F0511003%2Cgr-qc%2F0511108%2Cgr-qc%2F0511128%2Cgr-qc%2F0511054%2Cgr-qc%2F0511057%2Cgr-qc%2F0511097%2Cgr-qc%2F0511061%2Cgr-qc%2F0511110%2Cgr-qc%2F0511124%2Cgr-qc%2F0511069%2Cgr-qc%2F0511047%2Cgr-qc%2F0511152%2Cgr-qc%2F0511013%2Cgr-qc%2F0511006%2Cgr-qc%2F0511041%2Cgr-qc%2F0511134%2Cgr-qc%2F0511040%2Cgr-qc%2F0511137%2Cgr-qc%2F0511158%2Cgr-qc%2F0511106%2Cgr-qc%2F0511019%2Cgr-qc%2F0511021%2Cgr-qc%2F0511133%2Cgr-qc%2F0511066%2Cgr-qc%2F0511009%2Cgr-qc%2F0511088%2Cgr-qc%2F0511028%2Cgr-qc%2F0511062%2Cgr-qc%2F0511150%2Cgr-qc%2F0511077%2Cgr-qc%2F0511135%2Cgr-qc%2F0511103%2Cgr-qc%2F0511083%2Cgr-qc%2F0511153%2Cgr-qc%2F0511010%2Cgr-qc%2F0511034%2Cgr-qc%2F0511089%2Cgr-qc%2F0511023%2Cgr-qc%2F0511074%2Cgr-qc%2F0511157%2Cgr-qc%2F0511127%2Cgr-qc%2F0511082%2Cgr-qc%2F0511031%2Cgr-qc%2F0511020%2Cgr-qc%2F0511035%2Cgr-qc%2F0511080%2Cgr-qc%2F0511026%2Cgr-qc%2F0511043%2Cgr-qc%2F0511079%2Cgr-qc%2F0511011%2Cgr-qc%2F0511055%2Cgr-qc%2F0511004%2Cgr-qc%2F0511085%2Cgr-qc%2F0511146%2Cgr-qc%2F0511076%2Cgr-qc%2F0511117%2Cgr-qc%2F0511002%2Cgr-qc%2F0511046%2Cgr-qc%2F0511094%2Cgr-qc%2F0511068%2Cgr-qc%2F0511090%2Cgr-qc%2F0511063%2Cgr-qc%2F0511049%2Cgr-qc%2F0511081%2Cgr-qc%2F0511042%2Cgr-qc%2F0511018%2Cgr-qc%2F0511012%2Cgr-qc%2F0511143%2Cgr-qc%2F0511048%2Cgr-qc%2F0511099%2Cgr-qc%2F0511101&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "As a homage to A K Raychaudhuri, I derive in a straightforward way his famous\nequation and also indicate the problems he was last engaged in."}, "authors": ["Naresh Dadhich"], "author_detail": {"name": "Naresh Dadhich"}, "author": "Naresh Dadhich", "arxiv_comment": "8 pages, latex file, Pedagogical, One technical incorrect statement\n  corrected and some minor rephrasing", "links": [{"href": "http://arxiv.org/abs/gr-qc/0511123v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0511123v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0511123v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0511123v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:gr-qc/0511123v2 28 Nov 2005\n\nDerivation of the Raychaudhuri Equation\nNaresh Dadhich\nInter-University Centre for Astronomy & Astrophysics, Post Bag 4,\nPune 411 007, India\nE-mail: nkd@iucaa.ernet.in\n\nAbstract\nAs a homage to A K Raychaudhuri, I derive in a straightforward\nway his famous equation and also indicate the problems he was last\nengaged in.\nPACS numbers: 04.20.Jb, 04.2.Cv, 98.80 Dr\nLet us consider a collection of bodies falling freely under their own\ngravity. They would all attract each other and would tend to converge.\nIf they are expanding or contracting and their gravitational potential\nenergy is greater in magnitude than the kinetic energy, they would all\nmeet in future while if they are expanding with velocity greater than\na critical (escape) value, it could be inferred by extrapolation back in\ntime that they would have all been together at a point in the past.\nIn general we can have a distribution of matter in any form, yet the\nsame result will be expected. At the point of convergence, there will\nbe divergence of density. That is what will characterize singularity\nsignaling breakdown of the gravitational theory there.\nFollowing this Newtonian argument, we could say that if matter\ndistribution is homogeneous and isotropic (all points and all directions\nin space are equivalent and there is no way to distinguish one from\nthe other), gravitational force at any point will vanish. Isotropy of\nspace demands that in any direction there will be equal and opposite\nforce and hence its sum will vanish because force is a vector quantity.\nHomogeneity will ask for this to happen at all points. This means\nin a perfectly homogeneous and isotropic Universe, there is no gravitational force on any body. That is gravity is completely annulled\n\n1\n\n\fout. This should not be true because matter density is non-zero and\nwe have the Poisson equation to solve. This strange result critically\nhinges on gravity being a vector force. We are thus led to a very\nimportant inference that gravity can not be a vector force, it should\nrather be a tensor force. It is indeed a very novel argument again due\nto Raychaudhuri [1] that homogeneity and isotropy of matter distribution at large scale in the Universe can not be consistent with the\nNewtonian gravity. A new theory of gravity is required in which gravitational force is not a vector but a tensor.\nWe come to the Einsteinian theory of gravitation, General Relativity, simply by appealing to the universal property of gravity that it\nlinks/interacts with everything that physically exists. Its interaction\nwith light which always propagates with a constant universal velocity\ncan be realized if and only if gravity curves space (rather spacetime,\nbecause space and time are bound together into one whole, spacetime\nby universal speed of light in vacuum) [2, 3]. That is gravity can\nonly be described by curvature of spacetime. It becomes a property\nof spacetime and hence no longer remains an external force. Motion\nunder gravity is now simply free motion (straight line, geodetic) relative to curved geometry of spacetime. The difficulty that arose earlier\nfor homogeneous and isotropic matter distribution evaporates simply\nbecause matter curves spacetime and particles follow its curvature.\nGravity has now become a tensor force and hence unlike a vetor force\nit can not be canceled out.\nThe law of gravity, the analogue of the Newtonian inverse square\nlaw, should now follow from the geometry of spacetime. It really\ndoes. The Riemann curvature satisfies the differential Bianchi identity\nwhich on contraction yields a divergence free second rank symmetric\ntensor,i.e\n1\n(1)\nGab ;b = 0, Gab = Rab − Rgab\n2\nwhere Rab = Rc acb . Here a semicolon denotes covariant derivative relative to the metric gab which is generalization of the ordinary derivative\nin curved spacetime. We can then write\nGab = −κTab − Λgab\n\n(2)\n\nwith T ab ;b = 0. On the left is a second order differential expression\n\n2\n\n\fin the spacetime metric, gab , potential for gravity. On the right there\nmust be its matter source given by Tab , the stress energy tensor, with\nvanishing divergence which automatically takes care of conservation\nof energy and momentum. Λ is a constant which naturally arises as\na new constant of integration. Ignoring Λ and demanding agreement\nwith the Newtonian gravity in the limit determines κ = −8πG/c2 .\nThis has simply followed from spacetime curvature without any prescription. Why there is an extra constant? Perhaps because here we\ndid not have the comfort of a fixed spacetime background as is the\ncase for all other forces, spacetime itself determined the dynamics of\ngravity. The new constant is a measure of this fact [2, 3].\nThe Einsteinian gravity could intuitively be viewed as the Newtonian inverse square law in curved space which takes care of light's\ninteraction with gravity. In the weak field limit, curvature of space\nwill appear as a correction to the Newtonian effect as planetary orbits\nnot being exactly closed but precessing ellipses. This is all fine but the\ntheory does admit solutions which possess singularity characterized by\ndivergence of spacetime curvature and physical (like density) as well\nas kinematic (like expansion) parameters. Is the occurrence of singularity an artifact of symmetry of spacetime and matter distribution\nlike homogeneity and isotropy for the FRW cosmological model or is\nit generic feature of the theory? Is the big-bang singularity predicted\nby the FRW model generic or special to homogeneity and isotropy\nof matter distribution? This was the precise and profound question\nwhich Raychaudhuri addressed in mid 50s and obtained his celebrated\nequation [4]. We shall now consider the derivation of this beautiful\nequation.\nLet us consider in all generality what happens to a congruence\n(collection) of particles having timelike 4-velocity ua as they fall under their own gravity. We know from fluid motion that it could suffer\nthe following effects:\n(a) Expansion/Contraction of volume which is given by the divergence of ua , defined as θ = ua ;a .\n(b) Shear, distortion in shape without change in volume, is given\nby a symmetric tensor which is trace free (for no change in volume)\n\n3\n\n\fand orthogonal to ua and hence it is defined by\n1\nσab = u(a;b) − θhab − u̇(a ub)\n3\n\n(3)\n\nwhere u(a;b) = 21 (ua;b + ub;a ), hab = gab − ua ub .\n(c) Rotation/Vorticity, rotation without change in shape and it is\ngiven by an antisymmetric tensor orthogonal to ua ,\nωab = u[a;b] − u̇[a ub]\n\n(4)\n\nwhere u[a;b] = 12 (ua;b − ub;a ).\n(d) Acceleration due to non gravitational force like pressure gradient is a vector defined by u̇a = ua;b ub which is orthogonal to ua .\nNow we can resolve in general\n1\nua;b = σab + ωab + θhab + u̇a ub .\n3\n\n(5)\n\nNote that since any second rank tensor could be written in terms of\nits symmetric and anti-symmetric parts and hence the terms involving hab and u̇a cancel out in the above expression. They are however\nrequired for the definitions of shear and rotation in view of they being\northogonal to ua and trace free.\nFor the definition of the Riemann curvature, we have\nua ;bc − ua ;cb = Ra dbc ud .\n\n(6)\n\nContracting by putting a = b and multiplying with uc , we get\nθ; cuc − ua ;ca uc = Rdc ud uc .\n\n(7)\n\nThe second term on the left could be written as\n\nAlso note that\n\n(ua ;c uc );a − ua ;c uc ;a = u̇a ;a − ua;b ub;a .\n\n(8)\n\n1\nua;b ub;a = 2(σ 2 − ω 2 ) + θ 2\n3\n\n(9)\n\n4\n\n\fwhere σab σ ab = 2σ 2 , ωab ω ab = 2ω 2 . Substituting all this in equation\n(7), we obtain,\n1\nθ̇ − u̇a ;a + 2(σ 2 − ω 2 ) + θ 2 = Rab ua ub\n3\n\n(10)\n\nwhere θ̇ = θ;a ua .\nThe Einstein equation reads as\n1\nRab = −8π(Tab − T gab )\n2\n\n(11)\n\nwhere we have set G = c = 1, and Tab is the stress energy tensor of\nmatter distribution, which for the perfect fluid distribution reads as\nTab = (ρ + p)ua ub − pgab .\n\n(12)\n\nThen for perfect fluid, Rab ua ub = −4π(ρ + 3p), and we thus derive the\nRaychaudhuri equation\n1\nθ̇ = −2(σ 2 − ω 2 ) − θ 2 − 4π(ρ + 3p) + u̇a ;a .\n3\n\n(13)\n\n.\nThe active gravitational density is really ρ+3p which also has pressure contribution and further shear contributes in favour of it while\nrotation opposes it. This density is certainly positive for all known\nforms of ponderable matter and its positivity is known as the strong\nenergy condition. Then in the absence of rotation and acceleration,\nwe have\n1\nθ̇ ≤ − θ 2\n(14)\n3\nwhich integrates out to\n1\nθ(τ )−1 ≥ θ0−1 + τ\n3\n\n(15)\n\nwhere θ0 is the initial value of θ and τ is the proper time. If the congruence is initially contracting with θ0 < 0, θ will diverge (θ → −∞)\nin finite proper time τ ≤ 3/|θ0 |. This simply follows for all matter\nsatisfying the strong energy condition (ρ + 3p ≥ 0) from the Raychuadhuri equation without reference to any symmetry. Divergence of\n\n5\n\n\fthe expansion parameter by itself does not however imply singularity\nof spacetime. But this aided with some global arguments does lead to\nspacetime singularity in certain cases. This important consequence of\nthe Raychaudhuri equation ultimately played a key role in the proof\nof the celebrated singularity theorems due to Penrose, Hawking and\nGeroch [5]. In here, singularity was defined in terms of termination\nor incompleteness of a timelike or null geodesic. This definition facilitated proof of certain detailed theorems. A spacetime singularity\nmarks not only the breakdown of the Einsteinian gravity but also of\nwhole of physics - \"End of Everything\".\nThe Raychaudhuri equation has also found applications in the recent developments in holography principle and quantum computation\nof black hole entropy. In particular a covariant bound on the black\nhole entropy can be obtained by studying the evolution of light sheets\n[6] as well as the flow of the Renormalization group in the theory space\ncould be evolved [7]. In fact it would be applicable in any situation\nwhich is universal like gravity and its evolution could be modeled geometrically in an appropriate space. It thus has universal validity and\napplicability.\nThe singularity theorems reigned supreme. Particularly because\nthe observation of CMBR [8] also pointed to a singular birth of the\nUniverse in a Big-Bang. Nothing could be happier and more persuasive than observation verifying theory's prediction. This gave rise to a\ngeneral belief that singularity was inevitable in GR so long as positive\nenergy condition and causality are respected. This belief was however\nshaken by Senovilla's discovery in 1990 of a singularity free cosmological solution [9]. It did not violate the energy and causality conditions.\nHow did it happen then? It brought forth the main suspect in the\ntheorems. Among all the self evident assumptions, the theorems also\nrequired existence of closed trapped surface which is certainly not so\nobvious and self evident. That is gravity should become so strong\nin some bound region of space that even light can't escape from it.\nThis is a very limiting assumption for where gravity should become\nhow strong should be determined by the field equation rather than\nbeing prescribed. This assumption is quite justifiable for the case of\ngravitational collapse of an isolated body. From the study of stellar\nstructure we know that a sufficiently massive body could, as its nu-\n\n6\n\n\fclear fuel exhausts, ultimately undergo indefinite collapse and thereby\nreaching the trapped surface limit. But it is certainly not so obvious\nfor cosmology. This limitation was though known to the experts in the\nfield but not much talked of, perhaps in the belief that a singularity\nfree solution will never be found.\nThis prompted Raychaudhuri once again to the question of singularity theorems. He argued that existence of singularity free cosmological solutions should be recognized and proposed vanishing of space\nand time averages of all the scalars appearing in the Raychaudhuri\nequation as a necessary condition for their existence [10]. He later\nproved a new singularity theorem. It states that some scalar built\nof the Ricci curvature will blow up if (a) the strong energy condition\n(ρ + 3p ≥ 0) is satisfied, (b) the timelike eigenvector of the Ricci tensor is hypersurface orthogonal (this excludes rotation as well as the\nvacuum with vanishing Ricci), and (c) the space average of any of the\nscalars occurring in the Raychaudhuri equation does not vanish [11].\nHe replaces occurrence of closed trapped surface by non vanishing of\nspace average of scalars (vanishing of which is the necessary condition\nfor occurrence of non-singular solutions).\nThe last paper he wrote was in 2004 and in which he attempted\nto deduce the Ruiz-Senovilla family [13] of non-singular solutions for\nnon rotating perfect fluid from very general considerations in a novel\nmanner [12]. It is however known that for imperfect fluid it is easy\nto construct a non-singular and even oscillating models [14, 15]. Even\nfor stiff fluid, it has been shown that there exists a very large family of singularity free cosmological models [16]. The real challenge is\nto obtain rotating perfect fluid solutions. Apart from mathematical\ncomplexity, rotation brings in question occurrence of closed timelike\nlines and thereby causality. We have the well-known rotating Gödel\nuniverse which has closed timelike lines [17]. It would be interesting\nto find a rotating perfect fluid solution without closed timelike lines,\nand that was precisely what he was last working on before he died on\n18th June 2005.\nI thank Sumit Das and Sayan Kar for providing some of the references.\n\n7\n\n\fReferences\n[1] A. K. Raychaudhuri, A Fresh Look at the Singularity Problem,\nin The Universe, eds. N. Dadhich and A. K. Kembhavi, (Kluwer,\n2000).\n[2] N. Dadhich, Subtle is the Gravity, gr-qc/0102009.\n[3] N. Dadhich, Probing Universality of Gravity, gr-qc/0407003.\n[4] A. K. Raychaudhuri, Phys. Rev. 90, 1123 (1955).\n[5] R. M. Wald, General Relativity, (The University of Chicago Press,\n1984).\n[6] R. Bousso, Rev. Mod. Phys. 74, 825 (2002).\n[7] V. Balasubramanian, E. Gimon and D. Minic, JHEP, 0005, 014\n(2000), hep-th/0003147.\n[8] A. A. Penzias and R. W. Wilson, Astrophys. J. 142, 419 (1965).\n[9] J. M. M. Senovilla, Phys. Rev. Lett. 64, 2219 (1990).\n[10] A. K. Raychaudhuri, Phys. Rev. Lett. 80, 654 (1998).\n[11] A. K. Raychaudhuri, Mod. Phys. Lett. A15, 319 (2000).\n[12] A. K. Raychaudhuri, Gen. Relativ. Grav. 36, 343 (2004).\n[13] E. Ruiz and J. M. M. Senovilla, Phys. Rev. D45, 1995 (1992).\n[14] N. Dadhich, J. Astrophys. Astro. 18, 343 (1997).\n[15] N. Dadhich and A. K. Raychaudhuri, Mod. Phys. lett. A14, 2135\n(1999).\n[16] L. Fernandez-Jambrina and L. M. Gonzalez-Romero, Phys. Rev\nD66, 024027 (2002).\n[17] K. Gödel, Monatsh. math. Phys. 38, 173 (1931).\n\n8\n\n\f"}