{"id": "http://arxiv.org/abs/gr-qc/0702051v2", "guidislink": true, "updated": "2007-02-08T21:10:23Z", "updated_parsed": [2007, 2, 8, 21, 10, 23, 3, 39, 0], "published": "2007-02-08T20:15:45Z", "published_parsed": [2007, 2, 8, 20, 15, 45, 3, 39, 0], "title": "Outgassing, Temperature Gradients and the Radiometer Effect in LISA: A\n  Torsion Pendulum Investigation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0001081%2Cgr-qc%2F0001051%2Cgr-qc%2F0702014%2Cgr-qc%2F0702058%2Cgr-qc%2F0702067%2Cgr-qc%2F0702128%2Cgr-qc%2F0702074%2Cgr-qc%2F0702143%2Cgr-qc%2F0702088%2Cgr-qc%2F0702103%2Cgr-qc%2F0702112%2Cgr-qc%2F0702053%2Cgr-qc%2F0702026%2Cgr-qc%2F0702138%2Cgr-qc%2F0702006%2Cgr-qc%2F0702040%2Cgr-qc%2F0702100%2Cgr-qc%2F0702022%2Cgr-qc%2F0702037%2Cgr-qc%2F0702096%2Cgr-qc%2F0702001%2Cgr-qc%2F0702119%2Cgr-qc%2F0702132%2Cgr-qc%2F0702149%2Cgr-qc%2F0702120%2Cgr-qc%2F0702055%2Cgr-qc%2F0702131%2Cgr-qc%2F0702115%2Cgr-qc%2F0702048%2Cgr-qc%2F0702077%2Cgr-qc%2F0702019%2Cgr-qc%2F0702069%2Cgr-qc%2F0702093%2Cgr-qc%2F0702090%2Cgr-qc%2F0702123%2Cgr-qc%2F0702024%2Cgr-qc%2F0702104%2Cgr-qc%2F0702150%2Cgr-qc%2F0702017%2Cgr-qc%2F0702142%2Cgr-qc%2F0702011%2Cgr-qc%2F0702049%2Cgr-qc%2F0702079%2Cgr-qc%2F0702057%2Cgr-qc%2F0702020%2Cgr-qc%2F0702118%2Cgr-qc%2F0702012%2Cgr-qc%2F0702072%2Cgr-qc%2F0702136%2Cgr-qc%2F0702102%2Cgr-qc%2F0702109%2Cgr-qc%2F0702002%2Cgr-qc%2F0702032%2Cgr-qc%2F0702108%2Cgr-qc%2F0702084%2Cgr-qc%2F0702137%2Cgr-qc%2F0702114%2Cgr-qc%2F0702071%2Cgr-qc%2F0702135%2Cgr-qc%2F0702035%2Cgr-qc%2F0702030%2Cgr-qc%2F0702116%2Cgr-qc%2F0702051%2Cgr-qc%2F0702062%2Cgr-qc%2F0702029%2Cgr-qc%2F0702036%2Cgr-qc%2F0702094%2Cgr-qc%2F0702050%2Cgr-qc%2F0702010%2Cgr-qc%2F0702083%2Cgr-qc%2F0702007%2Cgr-qc%2F0702105%2Cgr-qc%2F0702091%2Cgr-qc%2F0702085%2Cgr-qc%2F0702045%2Cgr-qc%2F0702126%2Cgr-qc%2F0702082%2Cgr-qc%2F0702092%2Cgr-qc%2F0702081%2Cgr-qc%2F0702097%2Cgr-qc%2F0702078%2Cgr-qc%2F0702034%2Cgr-qc%2F0702068%2Cgr-qc%2F0702107%2Cgr-qc%2F0702124%2Cgr-qc%2F0702130%2Cgr-qc%2F0702122%2Cgr-qc%2F0702027%2Cgr-qc%2F0702140%2Cgr-qc%2F0702042%2Cgr-qc%2F0702052%2Cgr-qc%2F0702110%2Cgr-qc%2F0702101%2Cgr-qc%2F0702134%2Cgr-qc%2F0702031%2Cgr-qc%2F0702152%2Cgr-qc%2F0702113%2Cgr-qc%2F0702147%2Cgr-qc%2F0702023%2Cgr-qc%2F0702065%2Cgr-qc%2F0702063&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Outgassing, Temperature Gradients and the Radiometer Effect in LISA: A\n  Torsion Pendulum Investigation"}, "summary": "Thermal modeling of the LISA gravitational reference sensor (GRS) includes\nsuch effects as outgassing from the proof mass and its housing and the\nradiometer effect. Experimental data in conditions emulating the LISA GRS are\nrequired to confidently predict the GRS performance. Outgassing and the\nradiometer effect are similar in characteristics and are difficult to decouple\nexperimentally.\n  The design of our torsion balance allows us to investigate differential\nradiation pressure, the radiometer effect, and outgassing on closely separated\nconducting surfaces with high sensitivity. A thermally controlled split copper\nplate is brought near a freely hanging plate-torsion pendulum.We have varied\nthe temperature on each half of the copper plate and have measured the\nresulting forces on the pendulum.\n  We have determined that to first order the current GRS model for the\nradiometer effect, outgassing, and radiation pressure are mostly consistent\nwith our torsion balance measurements and therefore these thermal effects do\nnot appear to be a large hindrance to the LISA noise budget. However, there\nremain discrepancies between the predicted dependence of these effects on the\ntemperature of our apparatus.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0001081%2Cgr-qc%2F0001051%2Cgr-qc%2F0702014%2Cgr-qc%2F0702058%2Cgr-qc%2F0702067%2Cgr-qc%2F0702128%2Cgr-qc%2F0702074%2Cgr-qc%2F0702143%2Cgr-qc%2F0702088%2Cgr-qc%2F0702103%2Cgr-qc%2F0702112%2Cgr-qc%2F0702053%2Cgr-qc%2F0702026%2Cgr-qc%2F0702138%2Cgr-qc%2F0702006%2Cgr-qc%2F0702040%2Cgr-qc%2F0702100%2Cgr-qc%2F0702022%2Cgr-qc%2F0702037%2Cgr-qc%2F0702096%2Cgr-qc%2F0702001%2Cgr-qc%2F0702119%2Cgr-qc%2F0702132%2Cgr-qc%2F0702149%2Cgr-qc%2F0702120%2Cgr-qc%2F0702055%2Cgr-qc%2F0702131%2Cgr-qc%2F0702115%2Cgr-qc%2F0702048%2Cgr-qc%2F0702077%2Cgr-qc%2F0702019%2Cgr-qc%2F0702069%2Cgr-qc%2F0702093%2Cgr-qc%2F0702090%2Cgr-qc%2F0702123%2Cgr-qc%2F0702024%2Cgr-qc%2F0702104%2Cgr-qc%2F0702150%2Cgr-qc%2F0702017%2Cgr-qc%2F0702142%2Cgr-qc%2F0702011%2Cgr-qc%2F0702049%2Cgr-qc%2F0702079%2Cgr-qc%2F0702057%2Cgr-qc%2F0702020%2Cgr-qc%2F0702118%2Cgr-qc%2F0702012%2Cgr-qc%2F0702072%2Cgr-qc%2F0702136%2Cgr-qc%2F0702102%2Cgr-qc%2F0702109%2Cgr-qc%2F0702002%2Cgr-qc%2F0702032%2Cgr-qc%2F0702108%2Cgr-qc%2F0702084%2Cgr-qc%2F0702137%2Cgr-qc%2F0702114%2Cgr-qc%2F0702071%2Cgr-qc%2F0702135%2Cgr-qc%2F0702035%2Cgr-qc%2F0702030%2Cgr-qc%2F0702116%2Cgr-qc%2F0702051%2Cgr-qc%2F0702062%2Cgr-qc%2F0702029%2Cgr-qc%2F0702036%2Cgr-qc%2F0702094%2Cgr-qc%2F0702050%2Cgr-qc%2F0702010%2Cgr-qc%2F0702083%2Cgr-qc%2F0702007%2Cgr-qc%2F0702105%2Cgr-qc%2F0702091%2Cgr-qc%2F0702085%2Cgr-qc%2F0702045%2Cgr-qc%2F0702126%2Cgr-qc%2F0702082%2Cgr-qc%2F0702092%2Cgr-qc%2F0702081%2Cgr-qc%2F0702097%2Cgr-qc%2F0702078%2Cgr-qc%2F0702034%2Cgr-qc%2F0702068%2Cgr-qc%2F0702107%2Cgr-qc%2F0702124%2Cgr-qc%2F0702130%2Cgr-qc%2F0702122%2Cgr-qc%2F0702027%2Cgr-qc%2F0702140%2Cgr-qc%2F0702042%2Cgr-qc%2F0702052%2Cgr-qc%2F0702110%2Cgr-qc%2F0702101%2Cgr-qc%2F0702134%2Cgr-qc%2F0702031%2Cgr-qc%2F0702152%2Cgr-qc%2F0702113%2Cgr-qc%2F0702147%2Cgr-qc%2F0702023%2Cgr-qc%2F0702065%2Cgr-qc%2F0702063&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal modeling of the LISA gravitational reference sensor (GRS) includes\nsuch effects as outgassing from the proof mass and its housing and the\nradiometer effect. Experimental data in conditions emulating the LISA GRS are\nrequired to confidently predict the GRS performance. Outgassing and the\nradiometer effect are similar in characteristics and are difficult to decouple\nexperimentally.\n  The design of our torsion balance allows us to investigate differential\nradiation pressure, the radiometer effect, and outgassing on closely separated\nconducting surfaces with high sensitivity. A thermally controlled split copper\nplate is brought near a freely hanging plate-torsion pendulum.We have varied\nthe temperature on each half of the copper plate and have measured the\nresulting forces on the pendulum.\n  We have determined that to first order the current GRS model for the\nradiometer effect, outgassing, and radiation pressure are mostly consistent\nwith our torsion balance measurements and therefore these thermal effects do\nnot appear to be a large hindrance to the LISA noise budget. However, there\nremain discrepancies between the predicted dependence of these effects on the\ntemperature of our apparatus."}, "authors": ["Scott E Pollack", "Stephan Schlamminger", "Jens H Gundlach"], "author_detail": {"name": "Jens H Gundlach"}, "author": "Jens H Gundlach", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.2405036", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0702051v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0702051v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6th International LISA Symposium", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0702051v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0702051v2", "journal_reference": "AIPConf.Proc.873:158-164,2006", "doi": "10.1063/1.2405036", "fulltext": "Outgassing, Temperature Gradients and the\nRadiometer Effect in LISA: A Torsion Pendulum\nInvestigation\n\narXiv:gr-qc/0702051v2 8 Feb 2007\n\nS E Pollack, S Schlamminger and J H Gundlach\nDepartment of Physics, University of Washington, Seattle, WA 98195-4290\nAbstract. Thermal modeling of the LISA gravitational reference sensor (GRS) includes such effects as outgassing from the proof mass and its housing and the radiometer effect. Experimental data\nin conditions emulating the LISA GRS are required to confidently predict the GRS performance.\nOutgassing and the radiometer effect are similar in characteristics and are difficult to decouple experimentally.\nThe design of our torsion balance allows us to investigate differential radiation pressure, the\nradiometer effect, and outgassing on closely separated conducting surfaces with high sensitivity. A\nthermally controlled split copper plate is brought near a freely hanging plate-torsion pendulum. We\nhave varied the temperature on each half of the copper plate and have measured the resulting forces\non the pendulum.\nWe have determined that to first order the current GRS model for the radiometer effect, outgassing, and radiation pressure are mostly consistent with our torsion balance measurements and\ntherefore these thermal effects do not appear to be a large hindrance to the LISA noise budget.\nHowever, there remain discrepancies between the predicted dependence of these effects on the temperature of our apparatus.\nKeywords: LISA, gravitational wave detectors, torsion balance, torsion pendulum, radiometer,\noutgassing, acceleration noise\nPACS: 04.80.Nn, 07.10.Pz, 07.87.+v, 95.55.Ym, 91.10.Pp, 41.20.Cv\n\nINTRODUCTION\nThe low frequency end of the LISA gravitational wave sensitivity√requires that the\nproof masses are kept in free-fall below δ a = 3 × 10−15 (m/s2 )/ Hz from 0.1 to\n10 mHz [1, 2, 3]. The spurious accelerations linked to random thermal fluctuations have\nbeen allocated one-third of this total budget for meeting the desired LISA sensitivity\n[4]. Thermal fluctuations on the electrode housing of the GRS are estimated to be\nS∆T = 10−10 K2 /Hz [2], which combined with\n√ theoretical understanding of the thermal\n2\n−16\neffects yields δ aT = 3.5 × 10 (m/s )/ Hz, which is one-third of the allocation.\nThe margin in the budget that this assessment creates could be used to relax other\nrequirements. Therefore it is imperative that the models which were used to generate\nthe current assessment are validated in a laboratory setting.\nThe three largest thermal effects in the LISA noise budget are radiation pressure, the\nradiometer effect, and asymmetric outgassing. These three terms add coherently: [5, 6]\n\u0013\n\u0012\n8σ\nA P AGQ0 Θ p\n3\nAT + αP\n+\nδ aT =\nS∆T ,\n(1)\n3Mc\n2M T\n4M T 2\n\n\fwhere σ is the Stefan-Boltzmann constant, c is the speed of light, M = 1.96 kg is the\nmass of the LISA proof mass, A = 2.12 × 10−3 m2 is the area of one face of the LISA\nproof mass, P = 10−5 Pa is the residual gas pressure at the proof mass, and T = 293 K is\nthe temperature. The first term in Equation 1 is due to fluctuating asymmetric radiation\npressure, δ aRP . The second term is due to the radiometer effect, δ aRE . The pressures on\nopposite faces of the proof mass equilibrate quickly so that there is nearly no pressure\ndifference across it. This implies that the contribution due to the radiometer effect should\nbe reduced [7]. Leading to a pressure reduction factor of αP ≈ 0.1 [8]. The last term\nis due to fluctuations in asymmetric outgassing on opposite sides of the proof mass.\nThe outgassing rate Q(T ) most likely will follow an exponential law in temperature\nreferenced to an activation temperature Θ. The value of this activation temperature\nshould be no more than 30000 K [3]. The value for the nominal outgassing rate is taken\nto be Q0 ≈ 4 × 10−10 Torr L cm−2 s−1 ≈ 5 × 10−7 kg/s3 [5]. The factor, G, is related to\ngas particle conductances about the proof mass and through holes in the housing walls,\nand to the outgassing area of the proof mass. The nominal value for LISA is G = 0.4 m/s\n[5].\nThe derivations of these three effects were made assuming a constant temperature\ngradient across the housing which is then varied. This implies that the three effects\ndescribed above are dependent on the√frequency of fluctuations only through the level of\nthe thermal fluctuations themselves, S∆T .\nOur apparatus provides the unique opportunity to investigate the gap spacing dependence as well as the pressure and linearity of the thermal effects. Our results are complimentary to those that have been presented by the University of Trento group [6, 9].\nWhereas they have designed a mock-up of the LISA proof mass and electrode housing\nand therefore emulate the geometry of LISA, we have an increased torque sensitivity, the\nability to change the gap spacing, and a simpler geometry which allows ease in modeling\n[10].\n\nTORSION BALANCE APPARATUS\nOur torsion balance apparatus is described in [10]. Each of the two halves of the copper\nplate has embedded a heating element and a temperature sensor. Further temperature\nsensors are located on the plate translation stage, near the control electrodes, on the\nautocollimator, on the outside of our vacuum chamber, on the inside of the styrofoam\nenclosure, and the temperature controlled laboratory.\nWe predict values for the three thermal noise sources under study for our torsion balance tests. Since our torsion pendulum measures torques we must convert the measured\ntorques into LISA-equivalent accelerations. As mentioned in [10], this conversion is\ndone by using a moment arm at which the spurious forces act on the pendulum and the\nmass of one LISA proof mass. The base pressure of our experiment is ≈ 1.2 × 10−5 Pa.\nWe assume that the outgassing activation temperature and the outgassing rate of copper\nis similar to that assumed for the LISA GRS. The cross-sectional area overlap of one half\nof the copper plate and our pendulum is AUW = 4.7 × 10−3 m2 . The gas conductance rate\nfor our setup should be similar in value to those for the LISA GRS, likewise we assume\nthe same value for the factor G. Note that simple gas dynamics implies that the conduc-\n\n\fTABLE 1. Expected Values of Thermal Noise Sources for LISA using the values given in\nthe introduction, and LISA-equivalent accelerations for our apparatus using the values given in the\ntext. The mean temperature of the copper plate and the residual gas pressure differentiates each\ncolumn. The low and high pressure data were computed with base pressures√of 1.2 × 10−5 Pa and\n1.6 × 10−4 Pa respectively. Values in the table are in units of 10−11 (m/s2 /K) S∆T .\nNoise Source\n\nRadiation Pressure\nRadiometer Effect\nOutgassing\nCoherent Total\n\nLISA\n\nUW (25◦ C) UW (28◦C)\nlow pressure\n\nUW (25◦ C) UW (28◦C)\nhigh pressure\n\nδ aRP\nδ aRE\nδ aOG\n\n1.4\n0.2\n1.4\n\n1.5\n0.2\n1.3\n\n1.6\n0.2\n1.2\n\n1.5\n2.8\n1.3\n\n1.6\n2.8\n1.2\n\nδ aT\n\n3.0\n\n3.0\n\n3.0\n\n5.6\n\n5.6\n\ntance rate should increase if the separation between the pendulum and plate grows, and\ntherefore outgassing effects should decrease with plate-pendulum separation.\nIn Table 1 we list the predicted values for the three thermal effects in Equation (1)\nfor LISA and the predicted values for our experiment. In this table we have computed\nour LISA-equivalent noise levels when the mean temperature of the copper plate in\nour apparatus is 298 K and when it is 301 K. From √\nthese values we predict a thermally\ninduced acceleration noise of 3 × 10−11 (m/s2/K) S∆T relatively independent of the\ntemperature of the copper plate. In addition, we show values for the system at an elevated\npressure of 1.6 × 10−4 Pa, for which we expect an increase by nearly a factor of 2.\nWe present our results in terms of a thermal-to-torque transfer function. The conversion from torque to LISA-equivalent acceleration is ≈ 15 (m/s2 )/(Nm), such that the\nexpected thermal-to-torque transfer function should be 2 × 10−12 Nm/K when the system is at low pressure, and about 4 × 10−12 Nm/K for the high pressure scenario.\nThe copper plate reached 35◦ during the two day mild bakeout of our apparatus under\nvacuum. Our measurements were made 150 days after this bakeout occurred. The copper\nplate is made of oxygen-free high-conductivity (OFHC) copper, which has an outgassing\nrate 10 times lower than that assumed in the above calculations [11].\n\nTHERMAL MEASUREMENTS\nThe temperature difference between the two halves of the copper plate emulates a\ntemperature gradient across the LISA proof mass. Our procedure is to vary this gradient\nrecording the torque, thereby the LISA-equivalent acceleration, as a function of a variety\nof adjustable variables, such as the temperature gradient, the mean temperature of the\ncopper plate, the plate-pendulum separation, and the residual gas pressure inside our\napparatus.\n\nDC Measurements\nApplying constant power to the heater in either the left or right section of the copper\nplate shows a linear rise in temperature of that half as well as a linear response of\n\n\fFIGURE 1. Heating of one half of the copper plate (left) followed by heating of the other half some\ntime later (right) in equals steps of heater output power. The top chart shows the temperature of each half\nof the copper plate as well as the mean temperature all in ◦ C, the middle chart shows the temperature\ngradient between the two halves in K, and the lower chart shows the measured torque on the pendulum.\nThe plate-pendulum separation for this data was 1 mm.\n\nthe torque on the pendulum. Figure 1 shows heating of half of the copper plate in\nconstant steps of heater power. This data was taken with a plate-pendulum separation\nof 1 mm. The heated half changes by about 0.76 K over the course of this data set.\nThermal coupling from one half of the copper plate to the other is ∼30% such that\nthe other half gained 0.23 K. The temperature sensor placed on the electrode side of\nthe apparatus (inside the vacuum chamber) rose by 47 mK over the course of this data\nset. Temperature sensors attached to the outside of the vacuum chamber changed in\ntemperature by ∼46 mK. The temperature of the styrofoam enclosure did not change\nappreciably. This indicates that the thermal feedthrough from the copper plate to the\napparatus is on the order of 10%.\nIt can be seen from the slower rise in the torque as compared with the temperature\ngradient that there is a delay between the temperature gradient and the reaction of\nthe feedback loop of ∼1700 s. We suspect that this delay may be due to an effective\nactivation time of outgassing: the trapped gas at the surface of the copper immediately\nescapes whereas the trapped gas within the copper slowly diffuses. Additionally, transfer\nof heat to the pendulum should raise the pendulum temperature by a fraction of the plate\ntemperature change. The heating of the pendulum should increase outgassing from the\nsilicon. There is a delay between the heating of the copper plate and the heating of the\npendulum leading to a delayed response in the feedback torque.\n\n\fThe temperature gradient between the two halves of the split copper plate is the\nimportant quantity under investigation. The change in temperature gradient makes a\nchange in all three thermal sources under investigation. This causes a pronounced change\nin the torque. The thermal-to-torque transfer function for the data on the left in Figure 1\nis about 2.3 pNm/K.\nAfter some time we heated the other half of the copper plate and brought the temperature gradient back to nearly zero. This data is on the right in Figure 1. The thermalto-torque transfer function for this data is 3.0 pNm/K. Notice that the mean temperature\nof the copper plate in the data on right is ∼1.5 K higher than the data on the left. This\nincrease in the transfer function appears to be a function of the mean temperature of the\ncopper plate as described in more detail below.\n\nAC Measurements\nThe important frequency band of thermal measurements for LISA is from 0.1 to\n1 mHz. Looking at coherent signals allows us to determine the thermal frequency response of our system. By sweeping in frequency from 0.1 to 1 mHz we can map the\ntransfer function from thermal input to torque output. Figure 2 contains data for such a\nfrequency sweep at two mean plate temperatures and two gas pressures. This data was\ntaken with a plate-pendulum separation of 1 mm.\nThe thermal mass of the copper plate creates a low pass filter so that the temperature\ngradient amplitude is smaller at higher frequencies. Our typical amplitude is nearly\n200 mK at 0.1 mHz. From a series of measurements we found that the thermal-totorque response is independent of the signal amplitude at any particular frequency [12].\nHowever, we still observe an apparent low pass response with a corner frequency near\n0.1 mHz and a slope index of −0.75 in amplitude.\nFrom our DC measurements we found a time delay between the temperature gradient\nand the control torque of about 1700 s. At 10 μ Hz this would be a phase delay of\n−18◦ which is in good agreement with the data presented in Figure 2. This phase\ndelay becomes larger for frequencies above 1 mHz following the decrease in transfer\nfunction. However, it appears to turn around at higher frequencies. We suspect this is an\nexperimental artifact due to electrical coupling in our system.\nTo verify that this frequency and phase dependence was not dependent on our frequency sweeping function, we used a variety of different sweep functions, such as linear,\nlogarithmic, and more complicated functions of time, as well as monochromatic sinusoids. We found no dependence on the sweep function. The individual data points in\nFigure 2 are for fixed-frequency sine waves.\n\nDISCUSSION\nWhen the mean temperature of the copper plate is elevated by a few degrees we see an\nincrease in the thermal-to-torque transfer function, which is not predicted by Table 1. An\nincrease in the outgassing rate is likely the cause. As mentioned above, it is also possible\nthat the pendulum is appreciably changing in temperature such that the outgassing rate\n\n\fFIGURE 2. Thermal-to-torque transfer function and phase delay for thermal frequency sweeps between\n30 μ Hz and 1 mHz. The solid (dashed) transfer function traces were taken at a base pressure of 1.2 ×\n10−5 Pa (1.6 × 10−4 Pa). Raising the gas pressure increased the transfer function by a factor of 13. Raising\nthe mean temperature of the copper plate by 3 K raised the transfer function by a factor of 1.5 irregardless\nof the gas pressure in our apparatus.\n\nfrom the silicon increases as well. The outgassing rate should decay with time as a power\nlaw [11, 13]. Observing this decay would yield support for this hypothesis.\nThe radiometer effect is linearly proportional to the gas pressure in the system.\nFigure 2 contains thermal-to-torque traces at an elevated pressure of 1.6 × 10−4 Pa.\nThe thermal-to-torque transfer function at frequencies above 0.1 mHz appears to be a\nfactor of 13 higher when the system is at this higher pressure. This linear response is\nexactly expected for the radiometer effect, if the radiometer effect accounted for the\nbulk of the thermal-to-torque transfer. As demonstrated in Table 1, the radiometer effect\nshould be a small contribution to the total. The three contributing thermal effects add\nlinearly since they are coherent in the temperature gradient. If outgassing and radiation\npressure are independent of gas pressure, then the increase in the transfer function when\nthe system is at high pressure would be due to the radiometer effect. This would imply\nthat the radiometer effect is accounting for the bulk of the transfer, and therefore is a\nfactor of 15 higher than anticipated, i.e., the pressure reduction factor, αP , should be an\namplification of 1.5 not a reduction of 10. However, the radiometer effect is inversely\nproportional to the mean temperature and therefore does not account for the increase of\n1.5 when the copper plate is at an elevated temperature.\nIf instead outgassing is the cause of the increase when the system is warm, then the\noutgassing contribution must also increase when the system is at an elevated pressure\nwhich is currently not included in the LISA models [5].\n\n\fDIRECTIONS FOR FURTHER STUDY\nOur results are reasonably consistent with the current theoretical understanding of the\nthermal effects used in modeling for the LISA GRS. However, there does remain an\nanomalous increase in the thermal-to-torque transfer function when the copper plate is\nheated by a small amount regardless of base pressure. We are currently conducting measurements to help explain this. In addition, we are in the process of making measurements over a range of plate-pendulum separations to determine the distance dependence\nof the thermal effects.\n\nACKNOWLEDGMENTS\nWe would like to thank the members of Eöt-Wash and the Center for Experimental Nuclear Physics and Astrophysics at the University of Washington for infrastructure. This\nwork has been performed under contracts NAS5-03075 through GSFC and 1275177\nthrough JPL, and through NASA Beyond Einstein grant NNG05GF74G.\n\nREFERENCES\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n14.\n15.\n\nP. L. Bender, K. V. Danzmann, and the LISA Study Team, Laser Inteferometer Space Antenna for\nthe Detection of Gravitaional Waves, Pre-Phase A Report, Max-Planck Institute for Quantum Optics,\nGarching, Germany, 1998, MPQ-233 2nd edn.\nA. Hammesfahr, LISA: Study of the Laser Interferometer Space Antenna, Final Technical Report,\nESTEC contract 13631/99/NL/MS, Astrium, 2000.\nR. T. Stebbins, P. L. Bender, J. Hanson, C. D. Hoyle, B. L. Schumaker, and S. Vitale, Classical and\nQuantum Gravity 21, S653–S660 (2004).\nT. Hyde, LISA Error Budget, Tech. rep., NASA GSFC, Greenbelt, MD (2005).\nDRS ITAT, LISA DRS Acceleration Noise Budget, LIST Working Group 3, 2005, January 25.\nL. Carbone, A. Cavalleri, R. Dolesi, C. D. Hoyle, M. Hueller, S. Vitale, and W. J. Weber, Classical\nand Quantum Gravity 22, S509–S519 (2005).\nA. Ruediger, Private communication between P. L. Bender and Albrecht Ruediger (1994).\nR. Dolesi, D. Bortoluzzi, P. Bosetti, L. Carbone, A. Cavalleri, I. Cristofolini, M. DaLio, G. Fontana,\nV. Fontanari, B. Foulon, C. D. Hoyle, M. Hueller, F. Nappo, P. Sarra, D. N. A. Shaul, T. Sumner,\nW. J. Weber, and S. Vitale, Classical and Quantum Gravity 20, S99–S108 (2003).\nM. Hueller, L. Carbone, A. Cavalleri, G. Ciani, R. Dolesi, D. Tombolato, S. Vitale, and W. J.\nWeber, \"Torsion pendulum investigation of thermal gradient-induced forces on LISA test masses,\"\nin Proceedings of the 6th International LISA Symposium, American Institute of Physics, 2006.\nS. Schlamminger, C. A. Hagedorn, S. E. Pollack, and J. H. Gundlach, \"High Sensitivity Torsion Balance Tests for LISA Proof Mass Modeling,\" in Proceedings of the 6th International LISA Symposium,\nAmerican Institute of Physics, 2006.\nW. G. Perkins, J. Vac. Sci. Tehcnol. 10, 543–556 (1973).\nS. E. Pollack, S. Schlamminger, and J. H. Gundlach, in preparation (2007).\nM. Li, and H. F. Dylla, J. Vac. Sci. Technol. 11, 1702–1707 (1993).\nH. Peabody, and S. Merkowitz, Classical and Quantum Gravity 22, S403–S411 (2005).\nM. Lenzen, G. M. Turner, and R. E. Collins, J. Vac. Sci. Technol. 17, 1002–1017 (1999).\n\n\f"}