{"id": "http://arxiv.org/abs/gr-qc/0310016v2", "guidislink": true, "updated": "2003-11-20T20:56:53Z", "updated_parsed": [2003, 11, 20, 20, 56, 53, 3, 324, 0], "published": "2003-10-02T19:56:06Z", "published_parsed": [2003, 10, 2, 19, 56, 6, 3, 275, 0], "title": "Dynamics in Stationary, Non-Globally Hyperbolic Spacetimes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0310113%2Cgr-qc%2F0310001%2Cgr-qc%2F0310021%2Cgr-qc%2F0310098%2Cgr-qc%2F0310002%2Cgr-qc%2F0310081%2Cgr-qc%2F0310008%2Cgr-qc%2F0310074%2Cgr-qc%2F0310005%2Cgr-qc%2F0310087%2Cgr-qc%2F0310084%2Cgr-qc%2F0310107%2Cgr-qc%2F0310097%2Cgr-qc%2F0310034%2Cgr-qc%2F0310022%2Cgr-qc%2F0310067%2Cgr-qc%2F0310056%2Cgr-qc%2F0310101%2Cgr-qc%2F0310053%2Cgr-qc%2F0310111%2Cgr-qc%2F0310120%2Cgr-qc%2F0310104%2Cgr-qc%2F0310132%2Cgr-qc%2F0310068%2Cgr-qc%2F0310118%2Cgr-qc%2F0310006%2Cgr-qc%2F0310029%2Cgr-qc%2F0310109%2Cgr-qc%2F0310070%2Cgr-qc%2F0310089%2Cgr-qc%2F0310012%2Cgr-qc%2F0310086%2Cgr-qc%2F0310045%2Cgr-qc%2F0310114%2Cgr-qc%2F0310038%2Cgr-qc%2F0310125%2Cgr-qc%2F0310063%2Cgr-qc%2F0310036%2Cgr-qc%2F0310060%2Cgr-qc%2F0310065%2Cgr-qc%2F0310123%2Cgr-qc%2F0310042%2Cgr-qc%2F0310030%2Cgr-qc%2F0310119%2Cgr-qc%2F0310061%2Cgr-qc%2F0310094%2Cgr-qc%2F0310124%2Cgr-qc%2F0310135%2Cgr-qc%2F0310011%2Cgr-qc%2F0310136%2Cgr-qc%2F0310091%2Cgr-qc%2F0310069%2Cgr-qc%2F0310048%2Cgr-qc%2F0310051%2Cgr-qc%2F0310100%2Cgr-qc%2F0310010%2Cgr-qc%2F0310130%2Cgr-qc%2F0310071%2Cgr-qc%2F0310076%2Cgr-qc%2F0310007%2Cgr-qc%2F0310037%2Cgr-qc%2F0310116%2Cgr-qc%2F0310017%2Cgr-qc%2F0310080%2Cgr-qc%2F0310004%2Cgr-qc%2F0310083%2Cgr-qc%2F0310031%2Cgr-qc%2F0310050%2Cgr-qc%2F0310077%2Cgr-qc%2F0310016%2Cgr-qc%2F0310062%2Cgr-qc%2F0310044%2Cgr-qc%2F0310078%2Cgr-qc%2F0310024%2Cgr-qc%2F0310121%2Cgr-qc%2F0310055%2Cgr-qc%2F0310122%2Cgr-qc%2F0310088%2Cgr-qc%2F0310003%2Cgr-qc%2F0310099%2Cgr-qc%2F0310054%2Cgr-qc%2F0310093%2Cgr-qc%2F0310082%2Cgr-qc%2F0310090%2Cgr-qc%2F0310058%2Cgr-qc%2F0310127%2Cgr-qc%2F0310009%2Cgr-qc%2F0310023%2Cgr-qc%2F0310039%2Cgr-qc%2F0310015%2Cgr-qc%2F0310075%2Cgr-qc%2F0310133%2Cgr-qc%2F0310106%2Cgr-qc%2F0310043%2Cgr-qc%2F0310095%2Cgr-qc%2F0310117%2Cgr-qc%2F0310103%2Cgr-qc%2F0310073%2Cgr-qc%2F0310027%2Cgr-qc%2F0310026%2Cgr-qc%2F0310110&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamics in Stationary, Non-Globally Hyperbolic Spacetimes"}, "summary": "Classically, the dynamics in a non-globally hyperbolic spacetime is ill\nposed. Previously, a prescription was given for defining dynamics in static\nspacetimes in terms of a second order operator acting on a Hilbert space\ndefined on static slices. The present work extends this result by giving a\nsimilar prescription for defining dynamics in stationary spacetimes obeying\ncertain mild assumptions. The prescription is defined in terms of a first order\noperator acting on a different Hilbert space from the one used in the static\nprescription. It preserves the important properties of the earlier one: the\nformal solution agrees with the Cauchy evolution within the domain of\ndependence, and smooth data of compact support always give rise to smooth\nsolutions. In the static case, the first order formalism agrees with second\norder formalism (using specifically the Friedrichs extension). Applications to\nfield quantization are also discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=gr-qc%2F0310113%2Cgr-qc%2F0310001%2Cgr-qc%2F0310021%2Cgr-qc%2F0310098%2Cgr-qc%2F0310002%2Cgr-qc%2F0310081%2Cgr-qc%2F0310008%2Cgr-qc%2F0310074%2Cgr-qc%2F0310005%2Cgr-qc%2F0310087%2Cgr-qc%2F0310084%2Cgr-qc%2F0310107%2Cgr-qc%2F0310097%2Cgr-qc%2F0310034%2Cgr-qc%2F0310022%2Cgr-qc%2F0310067%2Cgr-qc%2F0310056%2Cgr-qc%2F0310101%2Cgr-qc%2F0310053%2Cgr-qc%2F0310111%2Cgr-qc%2F0310120%2Cgr-qc%2F0310104%2Cgr-qc%2F0310132%2Cgr-qc%2F0310068%2Cgr-qc%2F0310118%2Cgr-qc%2F0310006%2Cgr-qc%2F0310029%2Cgr-qc%2F0310109%2Cgr-qc%2F0310070%2Cgr-qc%2F0310089%2Cgr-qc%2F0310012%2Cgr-qc%2F0310086%2Cgr-qc%2F0310045%2Cgr-qc%2F0310114%2Cgr-qc%2F0310038%2Cgr-qc%2F0310125%2Cgr-qc%2F0310063%2Cgr-qc%2F0310036%2Cgr-qc%2F0310060%2Cgr-qc%2F0310065%2Cgr-qc%2F0310123%2Cgr-qc%2F0310042%2Cgr-qc%2F0310030%2Cgr-qc%2F0310119%2Cgr-qc%2F0310061%2Cgr-qc%2F0310094%2Cgr-qc%2F0310124%2Cgr-qc%2F0310135%2Cgr-qc%2F0310011%2Cgr-qc%2F0310136%2Cgr-qc%2F0310091%2Cgr-qc%2F0310069%2Cgr-qc%2F0310048%2Cgr-qc%2F0310051%2Cgr-qc%2F0310100%2Cgr-qc%2F0310010%2Cgr-qc%2F0310130%2Cgr-qc%2F0310071%2Cgr-qc%2F0310076%2Cgr-qc%2F0310007%2Cgr-qc%2F0310037%2Cgr-qc%2F0310116%2Cgr-qc%2F0310017%2Cgr-qc%2F0310080%2Cgr-qc%2F0310004%2Cgr-qc%2F0310083%2Cgr-qc%2F0310031%2Cgr-qc%2F0310050%2Cgr-qc%2F0310077%2Cgr-qc%2F0310016%2Cgr-qc%2F0310062%2Cgr-qc%2F0310044%2Cgr-qc%2F0310078%2Cgr-qc%2F0310024%2Cgr-qc%2F0310121%2Cgr-qc%2F0310055%2Cgr-qc%2F0310122%2Cgr-qc%2F0310088%2Cgr-qc%2F0310003%2Cgr-qc%2F0310099%2Cgr-qc%2F0310054%2Cgr-qc%2F0310093%2Cgr-qc%2F0310082%2Cgr-qc%2F0310090%2Cgr-qc%2F0310058%2Cgr-qc%2F0310127%2Cgr-qc%2F0310009%2Cgr-qc%2F0310023%2Cgr-qc%2F0310039%2Cgr-qc%2F0310015%2Cgr-qc%2F0310075%2Cgr-qc%2F0310133%2Cgr-qc%2F0310106%2Cgr-qc%2F0310043%2Cgr-qc%2F0310095%2Cgr-qc%2F0310117%2Cgr-qc%2F0310103%2Cgr-qc%2F0310073%2Cgr-qc%2F0310027%2Cgr-qc%2F0310026%2Cgr-qc%2F0310110&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Classically, the dynamics in a non-globally hyperbolic spacetime is ill\nposed. Previously, a prescription was given for defining dynamics in static\nspacetimes in terms of a second order operator acting on a Hilbert space\ndefined on static slices. The present work extends this result by giving a\nsimilar prescription for defining dynamics in stationary spacetimes obeying\ncertain mild assumptions. The prescription is defined in terms of a first order\noperator acting on a different Hilbert space from the one used in the static\nprescription. It preserves the important properties of the earlier one: the\nformal solution agrees with the Cauchy evolution within the domain of\ndependence, and smooth data of compact support always give rise to smooth\nsolutions. In the static case, the first order formalism agrees with second\norder formalism (using specifically the Friedrichs extension). Applications to\nfield quantization are also discussed."}, "authors": ["Itai Seggev"], "author_detail": {"name": "Itai Seggev"}, "author": "Itai Seggev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/21/11/010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/gr-qc/0310016v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/gr-qc/0310016v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 1 figure, AMSLaTeX; v2: expanded discussion of field\n  quantization, new Proposition 3.1, revised Theorem 4.2, corrected typos, and\n  updated references", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/gr-qc/0310016v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/gr-qc/0310016v2", "journal_reference": "Class.Quant.Grav. 21 (2004) 2651-2668", "doi": "10.1088/0264-9381/21/11/010", "fulltext": "Dynamics in Stationary, Non-Globally-Hyperbolic\nSpacetimes\narXiv:gr-qc/0310016v2 20 Nov 2003\n\nItai Seggev∗\nEnrico Fermi Institute and Department of Physics\nUniversity of Chicago\n5640 S. Ellis Avenue, Chicago, IL 60637, USA\nNovember 20, 2003\n\nAbstract\nClassically, the dynamics of a scalar field in a non-globally-hyperbolic spacetime is ill\nposed. Previously, a prescription was given for defining dynamics in static spacetimes in\nterms of a second-order operator acting on a Hilbert space defined on static slices. The\npresent work extends this result by giving a similar prescription for defining dynamics\nin stationary spacetimes obeying certain mild assumptions. The prescription is defined\nin terms of a first-order operator acting on a different Hilbert space from the one used in\nthe static prescription. It preserves the important properties of the earlier prescription:\nthe formal solution agrees with the Cauchy evolution within the domain of dependence,\nand smooth data of compact support always give rise to smooth solutions. In the static\ncase, the first-order formalism agrees with second-order formalism (using specifically\nthe Friedrichs extension). Applications to field quantization are also discussed.\n\n1\n\nIntroduction\n\nLet (M, gab ) be a spacetime, and consider the minimally coupled, massive Klein-Gordon\nequation for a real scalar field1 in this spacetime:\n(g ab ∇a ∇b − m2 )φ = 0.\n\n(1.1)\n\nAs is well known (see, e.g., [1]), if (M, gab ) is globally hyperbolic, the Klein-Gordon equation\nis well posed. That is, given smooth data on a spatial (Cauchy) hypersurface Σ0 , there exists\na unique smooth solution φ : M → R with the given initial data. In a non-globally-hyperbolic\nspacetime, however, no similar result holds. It is possible that no solution exists to given\ninitial data, or, if solutions exist, there may be many which satisfy the initial condition.\nOn the other hand, an analysis of Einstein's equation led Penrose to his \"strong\" cosmic\ncensorship conjecture [2], which postulates that all \"reasonable\" spacetimes are globally\n∗\n1\n\niseggev@uchicago.edu\nA complex scalar field may be treated by analyzing its real and imaginary parts separately.\n\n1\n\n\fhyperbolic. For these reasons, the study of dynamics has often been restricted to globally\nhyperbolic spacetimes.\nIn the absence of strong evidence either for or against cosmic censorship, Wald [3] considered whether a sensible prescription could be given to define dynamics in a non-globallyhyperbolic spacetime. He studied stably causal, static spacetimes, that is, spacetimes with\na hypersurface orthogonal Killing vector field, whose orbits are complete and everywhere\ntimelike.2 In these spacetimes, the Klein-Gordon equation can be split into its spatial and\ntemporal parts, leading to a second-order equation:\n∂2φ\n= −Aφ\n∂t2\n\nA := −αD a (αDa ) + α2 m2 ,\n\n(1.2)\n\nwhere α denotes the norm of the Killing field and Da the spatial covariant derivative. The\noperator A is a positive symmetric operator on an appropriate Hilbert space of initial data.\nThus, at least one self-adjoint extension,3 the Friedrichs extension, always exists [4]. The\nstandard calculus of self-adjoint operators (see, e.g., [5, 6]) can therefore be used to define a\nsolution\n\u0010 1 \u0011\n\u0010 1 \u0011\n− 12\n2\nφt = cos AE t φ0 + AE sin AE2 t (απ0 ),\n(1.3)\nwhere AE denotes some self-adjoint extension of A (not necessearily the Friedrichs extension\nAF ), φ0 the initial field configuration, and π0 the initial canonical momentum (the canonical\nmomentum is π = na ∇a φ, where na denotes the unit normal to the static slices). For\ninitial data in C0∞ , this solution is smooth throughout spacetime, agrees with the classical\nsolution within the domain of dependence D(Σ0 ), and solves the Klein-Gordon equation\nin the pointwise (spacetime) sense. Thus, the map (φ0 , π0 ) → φt assigns to each initial\ndatum pair a unique solution with sensible properties, and thus gives rise to a reasonable\nprescription in the sense defined by Wald and Ishibashi [7]. Indeed, [7] establishes that any\nreasonable prescription must correspond to the one above for some choice of positive, selfadjoint extension AE . In this sense, the choice of extension encodes the \"boundary conditions\nat the singularity\" (or whatever feature gives rise to the non-globally-hyperbolicity).\nThis paper is concerned with a similar prescription for stably casual, stationary spacetimes, i.e., those which possess a complete 1-parameter family of timelike symmetries whose\norbits are not necessarily hypersurface orthogonal. In this case, there are \"mixed space-time\nderivatives\" in the Klein-Gordon equation, so the division into space and time parts of the\nequation that was done in (1.2) is no longer possible. However, following Kay [8] by rewriting the Klein-Gordon equation in Hamiltonian form and using an \"energy-norm\" Hilbert\nspace, the time-evolution operator can be made into a skew-symmetric operator. When this\noperator can be extended to a skew-adjoint operator, a prescription analogous to (1.3) can\nbe given.\nIn contrast to the static case, it is not known a priori that any skew-adjoint extension\nof the time-evolution operator exists. However, if the Killing field does not approach a\nnull vector (in a precise sense explained further in Section 3), it is possible to show that\nskew-adjoint extensions exist when fields with positive mass are considered. Under these\nsame conditions, this prescription preserves the important properties of the second-order\n2\n\nThe standard black hole solutions do not fall into the class of spacetimes being studied because their\n\"time translation\" vector field becomes spacelike inside the event horizon.\n3\nThe theory of self-adjoint extensions of a symmetric operator is reviewed in Section 2.\n\n2\n\n\fprescription: it agrees with the differential equation within the domain of dependence, and\nsmooth data of compact support give rise to smooth solutions. Further, in the static case\nit is possible to compare the first and second-order formalisms and show that they agree so\nlong as the Freidrichs extension AF is used in (1.3). An interesting contrast between the\nfirst and second-order formalisms becomes apparent during this analysis. In the secondorder formalism, a single Hilbert space can be used to define all reasonable dynamics, and\nthe \"boundary conditions at the singularity\" are determined by the choice of self-adjoint\nextension. In order to handle different boundary conditions, the first-order formalism must\nbe modified to allow for different Hilbert spaces. Within each one, there is only one skewadjoint extension of the time-evolution operator. Hence the choice of Hilbert space, not of\nskew-adjoint extension, determines the dynamics and thus encodes the boundary conditions.\nThis paper is organized as follows: Section 2 reviews the theory of self-adjoint extensions\nof symmetric operators and proves a corresponding result regarding skew-adjoint extensions\nof skew-symmetric operators. Section 3 introduces the prescription in detail. In Section 4, it\nis shown that skew-adjoint extensions of the time-evolution operator exist. It is further shown\nthat the prescription agrees with the differential equation within the domain of dependence\nand that smooth data of compact support give rise to smooth solutions. Section 5 examines\nthe static case and compares the first and second-order formalisms. As defining the space\nof classical solutions is the first step towards field quantization, Section 6 show how this\nprescritption may be used to extend the well-known constructions of globally hyperbolic\nspacetimes to non-globally-hyperbolic ones. Section 7 concludes with some open problems.\n\n2\n\nExtensions of Operators\n\nAlthough it is common in the physics literature to treat symmetric operators (also called\nHermitian operators) as equivalent to self-adjoint operators, these two classes are in fact\ndistinct. The key difference is that arbitrary functions (and, in particular, the exponential)\nof self-adjoint operators may be defined, whereas this is not true of a general symmetric\noperator. The reason for this difference is that the proper definition of an operator involves\nnot only specifying its action on vectors but also its domain. A symmetric operator A on a\nHilbert space H is a linear operator defined on a dense vector subspace Dom A ⊆ H, which\n\"acts the same to the left or to the right\" for all vectors in its domain:\nhχ | Aψi = hAχ | ψi ∀ ψ, χ ∈ Dom A.\nA self-adjoint operator is a symmetric operator whose domain is equal to the domain of its\nadjoint. While Dom A may be freely chosen provided it is a dense vector subspace of H, the\ndomain of A∗ is fixed once A is defined. The somewhat convoluted definition is as follows:\nu ∈ Dom A∗ if and only if ∃v ∈ H such that\nhu | Aψi = hv | ψi ∀ ψ ∈ Dom A,\nin which case A∗ u = v. Notice that for a symmetric operator, Dom A is automatically\ncontained in Dom A∗ , so if the domains are not equal then Dom A ( Dom A∗ . The\nequality of domains for self-adjoint operators is crucial to the proof of the spectral theorem,\nwhich allows arbitrary (measurable) functions of the operator to be defined. For a (closed,)\n3\n\n\fsymmetric, non-self-adjoint operator, functions may only be defined by a power series, but\nthis series will always diverge unless it has a finite number of terms.\nThe close relationship between symmetric and self-adjoint operators suggests that a symmetric operator can be turned into self-adjoint operator by enlarging its domain of definition.\nThat this is often the case for operators acting on a complex Hilbert space is a consequence\nof a famous theorem of von Neumann [9, 4].\nTheorem 2.1 Let H be a Hilbert space over C and A : H → H a symmetric operator. Let\nK± := Ker (A∗ ∓ i), and define n± := Dim K± . Self-adjoint extensions of A exist if and\nonly if n+ = n− =: n, in which case they are parametrized by the group U(n).\nThe indices n± are called the deficiency indices. If n± = 0, there is a unique self-adjoint\nextension and A is called essentially self-adjoint. A standard technique for proving that the\ndeficiency indices are equal is the use of a complex conjugation operator. Any involution\n(i.e., an operator whose square is the identity) C is called a complex conjugation if it is\nantilinear and norm preserving. Suppose that χ± ∈ H obeys A∗ χ± = ±iχ± . Assume further\nthat ∃ some complex conjugation operator C which commutes with A. For any operator A,\nnot necessarily symmetric, [A, C] = 0 implies that [A∗ , C] = 0 [10, p. 360]. Thus, it follows\nthat A∗ Cχ± = ∓iCχ± ; that is, C establishes an isomorphism between K+ and K− so that\nthe deficiency indices are equal. Von Neumann also proved an extension of this result [9, 10].\nTheorem 2.2 Let H be a Hilbert space over C and A : H → H a symmetric operator. If\n∃ a complex conjugation C : H → H with [A, C] = 0, then (i) A has self-adjoint extensions,\nand (ii) ∃ self-adjoint extensions of A with C-invariant domain.\nThe previous two theorems only apply to complex Hilbert spaces. However, the theory\nof extensions on a real Hilbert space is naturally related to the theory on complex spaces by\nthe following proposition.\nProposition 2.1 Let HR be a Hilbert space over R, A : HR → HR a symmetric operator,\nand AC the corresponding operator acting on HR ⊗ C. The self-adjoint extensions of A are in\n1-1 correspondence with those self-adjoint extensions of AC whose domain is invariant under\nC, the natural complex conjugation operator defined on HR ⊗ C.\nThis result is implicit in the original work of von Neumann and Stone [10, Theorems 8.1 and\n9.14]. Since AC obviously commutes with C, parts (i) and (ii) of Theorem 2.2 combined with\nProposition 2.1 trivially show:\nProposition 2.2 Let HR be a Hilbert space over R. Any symmetric operator A : HR → HR\nhas self-adjoint extensions.\nIn his original work [3], Wald used the positivity of the operator A in (1.2) to assert the\nexistence of self-adjoint extensions. However, Proposition 2.2 shows that this was unnecessary. Existence follows directly from the fact that A is a symmetric operator defined on a\nreal Hilbert space.\nThe operator considered in the present work is not symmetric but rather skew-symmetric\n(or anti-Hermitian). Skew-symmetric operators share many properties of symmetric operators, but pick up a minus sign when the operator is transposed from the bra to the ket (or\nconversely):\nhχ | Aψi = − hAχ | ψi ∀ ψ, χ ∈ Dom A.\n4\n\n\fIn the case of a complex Hilbert space, there is a one-to-one correspondence between symmetric and skew-symmetric operators because multiplication by i turns one type of operator\ninto the other. Thus, the analogue of Theorem 2.1 is trivial. In the real Hilbert space case\nthere is no such correspondence because multiplication by i is not a well-defined operation.\nHowever, the analogue of Proposition 2.1 remains true. The following elementary proof can\nbe easily modified to apply to symmetric operators as well.\nProposition 2.3 Let HR be a Hilbert space over R, A : HR → HR a skew-symmetric\noperator, and AC the corresponding operator acting on HR ⊗ C. The skew-adjoint extensions\nof A are in 1-1 correspondence with those skew-adjoint extensions of AC whose domain is\ninvariant under the natural complex conjugation operator C.\nProof. Let B be a skew-adjoint extension of A. By construction, B C is skew-symmetric and\nhas a C-invariant domain. The obvious \"definition chasing\" computation shows that B C is\nin fact a skew-adjoint extension of AC .\nConversely, let B C be a skew-adjoint\nextension of AC whose domain is invariant under\n\u0001\n∗\nC. First, recall that [C, AC ] = 0, and notice that, as in the symmetric case, the skew\u0001∗\n\u0001∗\nsymmetry of AC implies that Dom B C ⊆ Dom AC . In other words, B C = − AC DomBC .4\nThis, combined with the assumed C-invariance of the domain, establish that [C, B C ] = 0.\nDefine B : HR → HR , with Dom B = Dom B C ∩ HR , by Bu = B C u. This operator is well\ndefined because [C, B C ] = 0, and clearly B extends A. Another straightforward computation\nestablishes that B is skew-adjoint. \u0004\nEquivalently, since composition with i does not change the domain, the skew-adjoint\nextensions of A are in 1-1 correspondence with the self-adjoint extensions of iAC with Cinvariant domain. Here, a key a difference between self-adjoint and skew-adjoint operators\narises. Since iAC anticommutes, rather than commutes, with C, C relates the spaces K± to\nthemselves rather than to each other. Thus, iAC may not have any self-adjoint extensions.\nd\nA standard example is the operator Aψ = − dx\nψ on Dom A = C0∞ (R+ ) ⊆ L2 (R+ , R). A\nis skew-symmetric, but iAC has deficiency indices n+ = 0, n− = 1 in L2 (R+ , C), so that A\npossesses no skew-adjoint extensions. A key step in later sections will be establishing, in\nTheorem 4.2, that skew-adjoint extensions of the time-evolution operator do indeed exist.\n\n3\n\nThe Prescription\n\nLet (M, gab ) be a non-globally-hyperbolic, connected, stably causal, stationary spacetime. A\ncrucial property of these spacetimes for this prescription is the following:\nProposition 3.1 If (M, gab ) is a connected, stably causal, stationary spacetime, then there\nexists a smoothly embedded spatial hypersurface Σ0 which intersects each orbit of the Killing\nfield exactly once.\n\u0001∗\nThe agreement of B C with − AC is the only place in this proof where the assumption of skew-symmetry\n\u0001∗\nis needed. For the symmetric case, Proposition 2.1, it is replaced by the condition B C agrees with AC .\nVon Neumann and Stone's original analysis of real symmetric operators was based on detailed properties of\nthe Cayley transform, and thus their results could not be easily extended to skew-symmetric operators.\n4\n\n5\n\n\fProof. Since (M, gab ) is stably causal, it posseses a smooth global time function [11], i.e., a\nfunction τ : M → R such that ∇a τ is a past directed\u0001 timelike vector field. Consider τ = 0,\n∂ a\nand without loss of generality take the Killing field ∂t\nto be future directed. As ∇a τ is past\n\u0001\n∂ a\ndirected, it follows that τ is a strictly increasing function on the orbits of ∂t\n, and hence\nno orbit can intersect τ = 0 more\u0001than once. On the other hand, suppose, to the contrary,\n∂ a\nthat there is some orbit O of ∂t\nwhich does not intersect τ = 0. Again without loss of\ngenerality, take O to be entirely to the future of τ = 0. Let B = I ̇+ (O), the boundary of the\nchronological future of O. B is non-empty since the open set τ < 0 does not intersect the\nopen set I + (O), and M is connected. Let It be\u0001 the isometry corresponding to flowing each\n∂ a\npoint of M by Killing parameter t. Since ∂t\nis complete, It (O) = O ∀ t. Furthermore,\n+\n+\n+\nIt (I\u0001 (O)) = I (It (O)) = I (O). This means that It (B) = B ∀ t, or, equivalently, that\n∂ a\nis tangent to B. However, B, as the boundary of the chronological future of a set,\n∂t\nis generated by \u0001null geodesics, and so cannot have a timelike tangent vector. Therefore,\n∂ a\neach orbit of ∂t\nmust intersect τ = 0 exactly once. τ = 0 is also automatically smoothly\nembedded by the inverse function theorem, so it may be taken to be the surface Σ0 . \u0004\nIt may appear that the assumption of stable causality is an overly restrictive causality condition. However, the key property of M from the standpoint of the prescription is the existence\nof the initial surface Σ0 . Furthermore, any stationary spacetime containing such a surface\nis automatically stably causal, as the Killing parameter may be used to define a global time\nfunction on M. Hence, stable causality is precisely the right causality assumption.\nDenote by γab the Riemannian metric induced by gab on Σ0 , (Σ, γab ) the abstract manifold\nso defined, and (Σt , γab ) the translation of Σ0 by Killing parameter t (which need not be\nrelated to the time function\nτ used to define Σ0 ). The lapse function α and shift-vector β a\n\u0001\n∂ a\nof the Killing field ∂t with respect to the future directed unit normal na of Σ0 in M are\ndefined by\n\u0012 \u0013a\n∂\n= αna + β a .\n∂t\nThe classical Hamiltonian for a Klein-Gordon field with mass m in this foliation is given by\n\u0014\n\u0012\u0014\n\u0013\n\u0015\n\u0015\u0014\n\u0015\nZ\n1\nβa\nβa β a 2\nβb\nab\n2 2\nH((φ, π)) =\ndγα 1 − 2 π + γ Da φ + π Db φ + π + m φ\n(3.1)\n2 Σ\nα\nα\nα\non C0∞ (Σ) ⊕ C0∞ (Σ), where πp\n:= na ∇a φ is the canonical momentum, Da is the Levi-Civita\nconnection of γab , and dγ = det γμν dx1 dx2 dx3 is the metric volume form. Note that β a\nis tangent to Σ, so it can be pulled back to Σ and the above formula makes sense. This\nHamiltonian may be expressed on C0∞ (Σ) ⊕ C0∞ (Σ) data as\n\u0014 \u0015\nZ\n\u0002\n\u0003\n1\nφ\nH((φ, π)) =\n,\ndγ φ π A\nπ\n2 Σ\nwhere A is the matrix differential operator\n\u0015\n\u0014\n−(D a α)Da + α(m2 − D a Da ) −(Da β a ) − β a Da\n.\nA=\nβ a Da\nα\n\n(3.2)\n\nLet HA be the completion of C0∞ (Σ) ⊕ C0∞ (Σ) in the energy norm\nkΦk2A := 2H(Φ) = hΦ | AΦiL2 (dγ)⊕L2 (dγ) ,\n6\n\nΦ = (φ, π) ∈ C0∞ (Σ) ⊕ C0∞ (Σ).\n\n(3.3)\n\n\fThus, the squared norm of a field configuration is equal to twice its classical energy, justifying\nthe name \"energy norm.\"\nIt should be noted that while HA is a natural choice of Hilbert space associated to the\nsystem, other choices are possible. That is, it is possible to define an energy norm which\nagrees with the above definition on smooth data of compact support but is defined on a\nlarger set of functions. In Section 5, it will be shown that other choices for HA can be used\nto define different dynamics, although the definitions of A and h (below) would then need\nto be modified somewhat.\nLet j be the standard 2 × 2 symplectic matrix,\n\u0015\n\u0014\n0 1\n,\nj :=\n−1 0\nand let\nh := −jA =\n\n\u0014\n\n−β a Da\n−α\na\n−(D α)Da + α(m2 − D a Da ) −(Da β a ) − β a Da\n\n\u0015\n\n.\n\n(3.4)\n\nHamilton's equations for the scalar field then take the simple form\n∂\nΦ(t) = −hΦ(t).\n∂t\nIt is easy to check by partial integration that h, defined as a differential operator on C0∞ (Σ)⊕\nC0∞ (Σ) ⊆ HA , is a skew-symmetric operator. Formally, the time-evolution equation may be\nsolved by exponentiating h. However, this may not be possible unless h is extended to a\nskew-adjoint operator hSA . Skew-adjoint operators have a spectral decomposition similar to\nthat of symmetric operators (see, e.g., [6, Theorem 13.33]). This may be used to exponentiate\nhSA and give the solution\nSA\nΦt = e−h t Φ0 .\n(3.5)\nEquation (3.5) assigns to each vector in HA a strongly continuous one-parameter family of\nvectors in HA which represents a formal solution to the Klein-Gordon equation. However,\nit is not clear a priori that (I) this one-parameter family defines a smooth function on\nspacetime for smooth initial data of compact support, or that (II) it solves the Klein-Gordon\nequation in the pointwise (spacetime) sense when the initial data are sufficiently regular.\nIn order to make any progress in proving (I) and (II), two technical assumptions are made.\nIt is possible that these assumption are not needed, but the methods of proof used Section\n4 break down. The first assumption restricts consideration to the massive Klein-Gordon\nequation:\n(A) m2 > 0.\n1\n0\nk\n(A) guarantees that any Φ ∈ HA is automatically in Hloc\n⊕ Hloc\n, where Hloc\ndenotes the kth\nlocal Sobolev space (see, e.g., [4]). This ensures that all the vectors in HA are functions and\nnot distributions. The second assumption is a condition on α and β:\n\n(B) α −\n\nβa β a\n≥ ǫ > 0.\nα\n\n\u0001\n\u0001\n∂ a ∂\nNotice that since α is manifestly positive, this condition implies α ≥ ǫ as well as ∂t\n=\n∂t a\nα2 − β 2 > ǫ2 > 0. However, if α diverges then (B) is strictly stronger than the condition that\n7\n\n\fthe norm of Killing is bounded away from zero. Also notice that since it involves β a , (B) is\na condition on the slice Σ0 as well as the Killing field.\n\u0001 Roughly speaking, (B) implies that\n∂ a\na\nthe \"Lorentz boost\" taking the unit normal n to ∂t is bounded, so that the two vectors\ndo not \"approach being null with respect to one another.\"\nA straightforward computation shows that these two conditions together ensure that\nkΦkA ≥ ckΦkL2 (dγ)⊕L2 (dγ) , where c is some constant depending only on ǫ and m. One easy\nconsequence of this inequality is that the symplectic form on smooth, compactly supported\nfunctions, defined by\nσ (F, G) := hF | jGiL2 (dγ)⊕L2 (dγ) ,\n(3.6)\nis a continuous bilinear form on HA , i.e., ∃ some constant cσ so that |σ(F, G)| ≤ cσ kF kAkGkA .\nThis inequality follows from the fact that j is a bounded operator on L2 (dγ) ⊕ L2 (dγ) combined with the fact that A-norm bounds L2 (dγ) ⊕ L2 (dγ)-norm, and it means that σ extends\nuniquely to a continuous bilinear form on all of HA . This will be critical in in the analysis\nof Section 4, which shows that (I) is true and that (II) is true so long as Φ0 is smooth and\nΦ0 ∈ Dom hSA .\nTo summarize, the prescription is as follows. First, choose any smoothly embedded spatial\nhypersurface which intersects each orbit of the Killing vector field exactly once and satisfies\n(B). Second, define the Hilbert space HA with the norm given by equations (3.2) and (3.3),\nas well as the operator h on C0∞ (Σ) ⊕ C0∞ (Σ) by (3.4). Finally, choose an arbitrary skewadjoint extension of h and assign the solution (3.5) to each initial datum Φ0 ∈ HA . Naively,\nthen, two arbitrary choices-the choice of initial surface and the choice of skew-adjoint\nextension-plus a possible third choice, if HA may be replaced by some larger Hilbert space,\nare allowed in the prescription. However, as shown in Section 5, h is essentially skew-adjoint\nin static spacetimes. Even if h is not always essentially skew-adjoint, Theorem 4.2 shows\nthat there is always a preferred skew-adjoint extension. Both these facts suggest that there\nis considerably less freedom available than at first appears. Finally, whether the prescription\ngives rise to the same dynamics when inequivalent slicings in the same spacetime are used\nremains an open question.\n\n4\n\nProperties of the Prescription\n\nThe goal of this section is to prove two theorems. The first assumes the existence of skewadjoint extensions of h, and proves that any such extension gives rise to a prescription with\nreasonable properties. The proof is more or less a direct adaptation of the corresponding\ntheorem in [3]. The second theorem establishes the existence of skew-adjoint extensions as\nwell as a certain preferred extension. As noted in Section 2, such a theorem was not necessary\nin [3].\nTheorem 4.1 Let (Σt , γab ) be a foliation of (M, gab ) which satisfies (B), and consider a\nminimally coupled Klein-Gordon equation obeying (A). Let hSA be any skew-adjoint extension of h, let Φ0 = (φ0 , π0 ) ∈ Dom hSA be smooth initial data,5 let Φt = (φt , πt ) be the\none-parameter family of vectors (3.5), and let ψ be the maximal Cauchy evolution of Φ0 .\n5\n\nAs the proof of Proposition 4.1 makes clear, Φ0 ∈ C 2 (Σ) ⊕ C 1 (Σ) would suffice to show φ = ψ in D(Σ0 );\nhowever, this lower regularity result is not needed in later sections so for simplicity attention is restricted to\n\u0001k\nsmooth data. In any event, the condition that Φ0 ∈ Dom hSA for all k implies that Φ0 is smooth.\n\n8\n\n\fDefine φ : M → R by φ(p, t) = φt (p). Then φ = ψ within the domain of dependence D(Σ0 ).\n\u0001k\nFurther, if Φ0 ∈ Dom hSA\n∀ k ∈ N, then φ is a smooth function on M obeying the\nKlein-Gordon equation. In particular, smooth data of compact support give rise to smooth\nsolutions.\nThe proof of this theorem proceeds in three steps. Proposition 4.1 shows that Φt and\nΨ(*, t) := (ψ(*, t), na ∇a ψ(*, t)) agree almost everywhere within the domain of dependence.\nThis is a meaningful comparison because, as noted above, HA contains only functions. The\ncontinuity of the symplectic form, guaranteed by the assumptions (A) and (B), is crucial to\nthe proof of this first proposition. Since Ψt is necessarily smooth, agreement almost everywhere shows that Φt restricted to the domain of dependence is smooth. Next, Proposition\n4.2 shows that Φt is a smooth function on each spatial slice. Unlike Proposition 4.1, its proof\ndoes not depend at all on assuming (B).6 Finally, the two results are combined to prove the\ntheorem.\nProposition 4.1 Under the conditions of Theorem 4.1, if Ψ is any smooth solution of the\nSA\nKlein-Gordon equation with Ψ|Σ0 ∈ Dom hSA , and Φt := e−(h )t Ψ|Σ0 , then Φt (p) = Ψ(p, t)\na. e. in D(Σ0 ) on each slice Σt . Thus, in particular, they agree a. e. throughout D(Σ0 ).\nProof. Suppose, to the contrary, that ∃ t1 such that Φt1 |D(Σ0 ) and Ψ(*, t1 )|D(Σ0 ) do not\nagree almost everywhere. This supposition implies there is some measurable subset ∆ ⊆\nD(Σ0 ) ∩ Σt1 with positive measure where Φt1 (p) 6= Ψ(p, t1 ). Let S be a Cauchy surface for\nD(Σ0 ) which coincides with Σ1 on an open set O such that O ∩ ∆ has positive measure.\nWithout loss of generality, take t1 > 0, denote by J + (J − ) the causal future (past) of\na set, and let σ be the symplectic form (3.6) on C0∞ (Σ) ⊕ C0∞ (Σ) functions. As noted\nin Section 3, assumptions (A) and (B) mean that σ extends uniquely to a continuous\nbilinear form on all of HA , also denoted σ. Choose Ξ̃ ∈ C0∞ (O) ⊕ C0∞ (O) such that\nσ(Ξ̃, Φt1 − Ψ(*, t1 )) 6= 0. Such a Ξ̃ exists because σ is a non-degenerate bilinear form.\nNow extend Ξ̃ to Ξ, a smooth solution of the Klein-Gordon equation defined in the entire region R := J + (Σ0 ) ∩ J − (Σt1 ), as follows. Within D(Σ0 ) ∩ R, evolve Ξ̃ by the ordinary\nCauchy evolution; in the remainder of R, set it to vanish. Note that, by construction,\nthere is a compact set K̃ with supp Ξ̃ ⊆ K̃ ⊆ Int (S ∩ Σt1 ), and recall that both S and Σ0\nare Cauchy surfaces for D(Σ0 ). From this it follows that there is a compact set K with\nsupp Ξ|D(Σ0 )∩R ⊆ K ⊆ Int J − (Σt1 ∩ S) ∩ J + (Σ0 ) ⊆ Int D(Σ0 ) ∩ R, which shows that Ξ is\nindeed a smooth solution. This situation is illustrated in Figure 1.\nConsider now\nσ(t) := σ (Ξ(*, t), Φt − Ψ(*, t)) = σ (Ξ(*, t), Φt ) − σ (Ξ(*, t), Ψ(*, t))\n\n(4.1)\n\nBy construction, σ(t1 ) 6= 0, whereas σ(0) = 0 because Φ0 = Ψ(*, 0). A contradiction will now\nbe established by showing that the derivative of σ is zero. Since Ξ and Ψ are both smooth\nsolutions of the Klein-Gordon in D(Σ0 ), one of which has compact support, the derivative\n6\n\nAn analysis similar to that preceding Proposition 2.1 shows that a skew-symmetric operator A has\nskew-adjoint extensions if there exists a norm-preserving linear involution which anticommutes with A. This\nmakes it possible to prove that h has skew-adjoint extensions in a stationary axisymmetric spacetime with\ntime-reflection symmetry without assuming (A) and (B). While, as noted in the text, the proof of Proposition\n4.2 continues to hold in this case, the proof of Proposition 4.1, and hence of Theorem 4.1, breaks down. It\nis not known whether this breakdown is an artifact of the method of proof or if the result fails in this case.\n\n9\n\n\fSupp Ξ\nΣt1\n\nS\n\n}R\n\nΣ0\nD( Σ0)\n\nFigure 1: An illustration of the proof that Ξ is smooth. The shaded region is supp Ξ, which\nis compactly contained in J − (S).\nof the second term of σ(t) automatically vanishes. On the other hand, Ξ(*, t) ∈ HA for each\nt ∈ [0, t1 ] because it is smooth and of compact support. Further, this one parameter family of\nvectors is also strongly differentiable in the Hilbert space sense, with derivative −hΞ(*, t) [8].\nBy the generalized Stone's Theorem [6, Theorem 13.35], Φ0 ∈ Dom hSA ⇔ Φt ∈ Dom hSA ,\nΦt is strongly differentiable, and Φ′t = −hSA Φt . Hence the derivative of the first term of σ(t)\nis σ(−hΞ(*, t), Φt ) + σ(Ξ(*, t), −hSA Φt ). Let {Fn } ⊆ C0∞ (Σ) ⊕ C0∞ (Σ), be a sequence which\nconverges to Φt in HA such that −hSA Fn → −hSA Φt . Such a sequence exists because hSA is\na closed operator. Since A is symmetric on smooth data of compact support, and A-norm\nbounds L2 (dγ) ⊕ L2 (dγ)-norm, it follows that\nσ(−hΞ(*, t), Φt ) + σ(Ξ(*, t), −hSA Φt ) =\n=\n=\n=\n\nlim σ(−hΞ(*, t), Fn ) + σ(Ξ(*, t), −hSA Fn )\n\nn→∞\n\nlim h−hΞ(*, t) | jFn iL2 ⊕L2 + hΞ(*, t) | j(−h)Fn iL2 ⊕L2\n\nn→∞\n\nlim hjAΞ(*, t) | jFn iL2 ⊕L2 + Ξ(*, t) j 2 AFn\n\nn→∞\n\nL2 ⊕L2\n\nlim hAΞ(*, t) | Fn iL2 ⊕L2 − hΞ(*, t) | AFn iL2 ⊕L2\n\nn→∞\n\n= 0,\nwhere L2 denotes L2 (dγ). This establishes the contradiction, so Φt and Ψ(*, t) agree a. e. in\nD(Σ0 ). \u0004\nWhile the proof of the next proposition is conceptually similar to the corresponding result\nin [3], it differs significantly in detail. The use of the Hilbert space L2 (α−1 dγ) in [3] allowed\n0\na natural identification of the solution (1.3) with a distribution in Hloc\n, and then the strong\nellipticity of the operator A was used to show the regularity of φt . The key to the proof below\nis the identification of the distribution X (defined below) as a distribution in the negative\n−1\n0\norder Sobolev space Hloc\n⊕ Hloc\n. Further, rather than utilizing the ellipticity of the operator\nAh directly, its detailed form is used to identify an elliptic operator acting on a piece with\nsufficient a priori regularity to allow iteration.\n\n10\n\n\fProposition 4.2 Let Φt =: (φt , πt ) be the one-parameter family of vectors (3.5) correspond\u0001k\ning to Φ0 , and assume (A) holds. If Φ0 ∈ Dom hSA\n∀ k ∈ N, then φ(*, t) := φt and\nπ(*, t) := πt are smooth functions on Σt for each fixed t.\nProof. Suppose Φ0 ∈ Dom hSA . By Stone's Theorem Φt ∈ Dom hSA , which implies that\n1\n0\nhSA Φt ∈ Hloc\n⊕ Hloc\n. Consider the distribution\nX(F ) := − hhF | Φt iA .\nR\nBy the skew-symmetry of hSA in HA , X(F ) = dγF T AhΦt , where T denotes matrix transpose and A and h are now viewed as a differential operator on distributions. Hence, X, φt ,\nand πt satisfy the distributional differential equation\n\u0001\n\u0015\n\u0014\nα2 γ ab + β a β b Da Db πt\u0001+ (Da β a )D b Db φt + lower-order terms\n. (4.2)\nX = AhΦt =\nα2 γ ab + β a β b Da Db φt + lower-order terms\n\n1\nSince φt ∈ Hloc\na priori, the second term in the top component of the right hand side of\n−1\n−1\n(4.2) is in Hloc . The lower-order terms on the right hand side are also contained in Hloc\n.\nOn the other hand, the top left component of A contains two derivatives and the top right\n−1\n1\n0\ncomponent only one, so hSA Φt ∈ Hloc\n⊕ Hloc\nimplies that the top component of X is in Hloc\n.\nHence,\n−1\nEπt := (α2 γ ab + β a β b )Da Db πt ∈ Hloc\n.\n(4.3)\n\n1\nAs E is clearly an elliptic second-order differential operator, (4.3) ⇒ πt ∈ Hloc\n. With both\n1\nπt and φt established as being in Hloc , the lower-order terms in the bottom component of the\n0\nright hand side of Equation (4.2) are at least Hloc\n. Since the bottom left component of A\n1\n0\ncontains one derivative and the bottom right component none, hSA Φt ∈ Hloc\n⊕ Hloc\nimplies\n0\n0\n2\nthat the bottom component of X is in Hloc\n, and hence Eφt ∈ Hloc\n⇒ φt ∈ Hloc\n. Suppose\n\u0001k\nnow that Φ0 ∈ Dom hSA . It is clear that the above argument could be repeated, peeling\nk+1\nk\none hSA at a time. Hence φt ∈ Hloc\nand πt ∈ Hloc\n. As this is true ∀ k by assumption, both\nφt and πt are smooth. \u0004\n\nProof of Theorem 4.1. It remains only to show that φ is smooth solution of the\nKlein-Gordon equation in M.7 Let p ∈ M, and let Σtp be the slice passing through p. Let\nSA\nΦ̃t = eh (t−tp ) Φtp , and let Ψ̃ be the maximal Cauchy evolution of Φtp in D(Σtp ). Again by\nProposition 4.1, Φ̃t = Ψ̃(*, t) in D(Σtp ), which certainly includes some neighborhood of p.\nThe definition of Ψ̃ therefore shows that φ is smooth and obeys the Klein-Gordon equation\nin some neighborhood of p. As p is arbitrary, the result follows. \u0004\nTheorem 4.2 Under the conditions of Theorem 4.1, h possesses a skew-adjoint extension\nwhich has a bounded inverse and conserves the natural symplectic form σ.\nProof. Because the symplectic form σ is continuous with respect to A-norm, the Riesz\nlemma shows ∃ a bounded skew-adjoint operator T : HA → HA such that σ(Φ, Ψ) =\nhΦ | T ΨiA ∀ Φ, Ψ ∈ HA . Further, ∀ F, G ∈ C0∞ (Σ) ⊕ C0∞ (Σ),\nhF | T hGiA = σ(F, hG) = hF | jhGiL2 (dγ)⊕L2 (dγ) = F − j 2 AG\n\nL2 (dγ)⊕L2 (dγ)\n\n= hF | GiA ,\n\nIn the static case, it is necessary to argue that dφ\ndt is smooth on each spatial slice before spacetime\nsmoothness of the φ can be established [3]. In the present case, this is not necessary because Φ0 by itself\ncompletely determines the solution Φt .\n7\n\n11\n\n\for that T h = 1 on C0∞ (Σ) ⊕ C0∞ (Σ). This calculation also shows that Ran T is dense.\nBecause T is skew-adjoint, this suffices to show that T −1 exists and is skew-adjoint [6,\nTheorem 13.11(b)]. But T −1 |C0∞ (Σ)⊕C0∞ (Σ) = h, so that T −1 is a skew-adjoint extension of\nh. T is by construction bounded, and clearly the symplectic form is conserved by the time\nevolution associated to T −1 because [T, T −1 ] = 0. \u0004\n\n5\n\nStatic Spacetimes\n\nIt is interesting to compare the first-order formalism in the static slicing with the previously\nstudied second-order formalism [3, 7, 12, 13]. From this analysis will come the result that the\ndefinition of the Hilbert space determines the dynamics in these spacetimes. This suggests\nthat the choice of Hilbert space in a general stationary spacetime plays at least as large a\nrole, if not a larger role, in determining the dynamics as does the choice of skew-adjoint\nextension h.\nIn the static slicing, β a = 0 so A and h take the form\n\u0015\n\u0015\n\u0014\n\u0014 −1\n0\n−α\nα A 0\n,\n(5.1)\nh=\nA=\nα−1 A 0\n0\nα\nwhere A is the operator (1.2). Thus, HA decomposes as a direct sum HA = X ⊕ Y, where\nX = H01 (αdγ) and Y = L2 (αdγ). Another space which plays a role in the analysis is\nZ := L2 (α−1 dγ); this is the Hilbert space in which A is a symmetric operator. Note that\nπ → απ maps Y bijectively onto Z. This is merely a restatement of the fact the canonical\n= αna ∇a φ = απ.\nmomentum is π = na ∇a φ, whereas the time derivative of φ is ∂φ\n∂t\nThe relationship between X and Z is slightly more complicated. X is the completion of\n∞\nC0 in the norm kf k2X = hf | Af iZ . Clearly kf k2X ≤ kf kA 21 := hf | Af iZ + kf k2Z . However, if\n(B) holds so that α ≥ ǫ > 0, then it is also true (1+ǫ−2 )−1 kf kA 21 ≤ kf kX . Hence X -norm and\n1\n\n1\n\nA 2 -norm are equivalent. The completion of C0∞ in A 2 -norm is qF , the form-domain of the\n1\n\nFriedrichs extension of A [4]. qF is also equal to Dom AF2 , where AF denotes the Friedrichs\nextension of A [5]. These relationships between X , Y, and Z are the key understanding the\ndynamics in static spacetimes.\nTheorem 5.1 Let (M, gab ) be a static spacetime obeying (B) in the static slicing. If (A)\nholds, then h is essentially skew-adjoint.\nProof. The deficiency indices of ihC are computed directly and shown to be zero. Suppose,\nto the contrary,\nthat 0 6= Φ = (φ, π) ∈ K± . This means that ∀ F = (f, g) ∈ C0∞ (Σ) ⊕ C0∞ (Σ),\nR\nΦ satisfies dγΦT A(ihC ± i)F = 0. The preceding discussion shows that the map (φ, π) →\n(φ, απ) injects HA ֒→ Z ⊕ Z, so that the index equations can be written as\n− hφ | AgiZ ∓ hαπ | giZ = 0\nhαπ | Af iZ ∓ hφ | Af iZ = 0.\n\n(5.2)\n(5.3)\n\nEquation (5.2) is nothing but the statement φ ∈ Dom A∗ (where the adjoint is taken in Z)\nand A∗ φ = ∓απ. Equation (5.3) then becomes A∗ (απ) = ±A∗ φ. Clearly, one solution is\nαπ = φ, or A∗ φ = −φ. Suppose that απ = φ + δ were a second solution. This would mean\n12\n\n\fthat A∗ δ = 0, or that hF | (δ, 0)iA = 0 ∀ F ∈ C0∞ (Σ) ⊕ C0∞ (Σ). As C0∞ (Σ) ⊕ C0∞ (Σ) is dense\nin HA , it follows that (δ, 0) = 0 in HA . Thus A∗ φ = −φ, απ = φ is the unique solution to\n(5.2), (5.3). Now, let Fn := {(fn , gn )} ⊆ C0∞ (Σ) ⊕ C0∞ (Σ) be a sequence which converges to\nΦ in HA . Since kFn kA ≥ kFn kZ⊕Z , it follows that fn → φ in Z. But X = qF , which means\nthat k(fn , 0)kA → hφ | AφiZ = −kφk2Z , which is clearly impossible. Hence K± = {0} and h\nis essentially skew-adjoint. \u0004\nIn [7] it was shown that any reasonable prescription agrees with the second-order formalism on C0∞ data for some choice of positive, self-adjoint extension AE of A. The following\ntheorem shows, without invoking the result of [7], that the first-order formalism agrees with\nthe second order formalism when the Friedrichs extension is chosen. It actually shows a\nstronger result, namely that the prescriptions agree for data in HA .\nTheorem 5.2 Let (M, gab ) be a static spacetime obeying (B), and suppose that (A) holds.\nIn the static slicing define U (1) : HA → HA by U (1) = e−h̄t , where h̄ denotes the operator\nclosure of h in HA , and let U (2) : Z ⊕ Y → Z ⊕ Y be given by\n\u0010 1 \u0011 \n\n\u0010 1 \u0011\n− 21\n2\nt\nA\nsin\nAF2 t α\ncos\nA\nF\nF\n(2)\n\n\u0010 1 \u0011\n\u0010 1 \u0011 ,\nU (t) =\n1\n−1\n−1 2\n2\nα cos AF2 t α\n−α AF sin AF t\nwhere AF is the Friedrichs extension of A in Z. Then U (2) (−t)U (1) (t) is a well-defined map\nHA → HA , and further\nU (2) (−t)U (1) (t) = I2×2 .\n(5.4)\nProof. Notice that the operators in (5.4) correspond to evolving the initial state by a time t\nin the first-order formalism, then evolving time backward by t in the second-order formalism.\nThus, if U (2) (−t)U (1) (t) maps HA to itself and further U (2) (−t)U (1) (t) = I2×2 , then these two\nevolutions invert each other, and hence the first-order and second-order formalism agree.\nLet (φ0 , π0 ) ∈ HA and define\nΥt := U (2) (−t)U (1) (t)(φ0 , π0 ).\nIt will at first be assumed that (φ0 , π0 ) ∈ Dom h̄. This assumption will be used to show that\nΥt differentiable in Z ⊕ Y and, in fact, constant. It will then be shown that Υt is constant\nfor arbitrary (φ0 , π0 ) ∈ HA , which establishes the result (5.4).\nIt is first necessary to show that U (2) (−t)U (1) (t) maps HA → HA so that Υt is welldefined. Because Theorem 5.1 shows that h is essentially skew-adjoint, its closure h̄ is\nskew-adjoint. This suffices to show that U (1) (φ0 , π0 ) is a well-defined vector in HA . As noted\n1\n\n1\n\nabove, X = qF = Dom AF2 . Hence the X component of Υt is well-defined because (i) cos(AF2 t)\n1\n\n−1\n\nis a bounded operator (on Z) which leaves qF invariant, and (ii) AF 2 sin(AF2 t) is a bounded\n1\n\noperator on Z with range contained in Dom AF2 , and α maps Y to Z. On the other hand,\n1\n\n1\n\nthe Y component of Υt is well-defined because (iii) ψ ∈ X ⇔ α−1 AF2 sin(AF2 t)ψ ∈ Y, and (iv)\n1\n\ncos(AF2 t) is a bounded operator on Z, combined with the fact that α maps Y to Z bijectively.\nNotice that (iii) and (iv) would continue to hold if AF were replaced by AE in the definition\nof U (2) (t). However, (i) would fail for an arbitrary extension. Further, (ii) necessarily fails for\n13\n\n\fany other extension AE because qF is the closure of the quadratic form associated to A [4].\n1\n\n1\n\n−1\n\n1\n\nThis implies that Dom AE2 ) Dom AF2 [5], and and hence AE 2 sin(AE2 α) maps Y outside of\nX . Therefore this theorem identifies AF as the unique self-adjoint extension whose dynamics\nagree with the first-order formalism.\nSuppose now that (φ0 , π0 ) ∈ Dom h̄, which by definition is the closure of C0∞ (Σ)⊕C0∞ (Σ)\nin the norm:\nk(f, g)k2h̄ := k(f, g)k2A + kh(f, g)k2A\n= hf | Af iZ + f A2 f Z + kαgk2Z + hαg | AαgiZ .\n\n(5.5)\n\n2\n\nOn the one hand, mǫ 2 hf | f i ≤ hf | Af i. On the other hand, the Cauchy-Schwartz inequality\nand the fact that A is symmetric imply that\nhf | Af iZ ≤ kf kZ kAf kZ ≤\n\n1\n1\nhf | f iZ + f A2 f\n(hf | f iZ + hAf | Af iZ ) =\n2\n2\n\nZ\n\n\u0001\n\n.\n\nThus, the first two terms in (5.5) are norm equivalent to hf | f iZ + hf | A2 f iZ , which means\n1\n\nthat φ0 ∈ Dom Ā ⊆ Dom AF . The last two terms in (5.5) are operator-closure norm for AF2 ,\n1\n\nso απ0 ∈ Dom AF2 .\nLet Ψ = (ψ, θ) be such that ψ ∈ Dom AF and θ ∈ Y. Arguments similar to those which\nprove Stone's Theorem as well as the fact that α maps Y to Z bijectively show that U (2) (t)Ψ\nis strongly differentiable in Z ⊕ Y with derivative\n\u0015\n\u0014\n0\nα\n(2) (2)\nU (2) Ψ.\nD U Ψ :=\n−AF 0\nBy the generalized Stone's theorem [6, Theorem 13.35], the strong derivative of U (1) (t)(φ0 , π0 )\nexists in HA and is given by\nD (1) U (1) (t)(φ0 , π0 ) := −h̄(φt , πt ) = (−απt , Āφt ).\nThe last equality follows because action of h on f agrees with the action of A on f in a\ncore domain C0∞ . However, HA -norm bounds Z ⊕ Y-norm, so any one parameter family\nof vectors which is norm differentiable in HA is also norm differentiable in Z ⊕ Y. Hence\nU (1) (t)(φ0 , π0 ) is strongly differentiable in Z ⊕ Y. The generalized Stone's theorem further\nshows that U (1) (t)(φ0 , π0 ) ∈ Dom h̄ and hence that U (1) (t)(φ0 , π0 ) ∈ Dom Ā ⊕ Y for all\nt ∈ R. Thus, the Leibnitz rule may be used, yielding\n\u0013\n\u0012\n\u0002 (1)\n\u0003 (1)\nφ0\n′\n(2)\n(2)\n,\nΥt = U (−t) D − D\nU (t)\nπ0\nAgain because the X component of Dom h̄ is Dom Ā ⊆ Dom AF , it follows that D (2) |Dom h̄ =\nD (1) , or Υ′t = 0. Hence Υt is a constant equal to Υ0 = (φ0 , π0 ).\nIt remains only to show that Υt = Υ0 for arbitrary (φ0 , π0 ) ∈ HA . However, U (1) (t) is\na unitary transformation by the spectral theorem. U (2) (−t) is a bounded operator on HA ,\nas can be shown by a straightforward computation utilizing facts (i)-(iv). Since it inverts\nthe unitary operator U (1) (t) on the dense domain Dom h̄, U (2) (−t)|HA is also unitary and\n\u0001−1\nU (2) (−t)|HA\n= U (1) (t). Thus, U (2) (−t)U (1) (t) = I2×2 on HA . \u0004\n14\n\n\fTheorem 5.1 suggests that the first-order prescription is unique. However, it is known\n[12, 13] that A is not essentially self-adjoint in Z-and hence the choice of dynamics is not\nunique-in a variety of static spacetimes. This raises the question of why the first-order\nformalism appears unique, but the proof of Theorem 5.2 has already provided the answer.\nIt appears unique because HA was defined as the completion of C0∞ (Σ) ⊕ C0∞ (Σ) in A norm.\nTo produce other dynamics, define H̃A := qE ⊕ Y, where qE is the form domain of any other\npositive, self-adjoint extension AE of A in Z. Since C0∞ (Σ) ⊕ C0∞ (Σ) is no longer dense in\nHA , one cannot define h on this domain and take its closure. However, h̃ may be defined\ndirectly in terms of the spectral resolution of AE . The obvious modification of the proof of\nTheorem 5.2 then shows that the dynamics defined by h̃ agrees with the dynamics defined\nby AE on data contained in qE ⊕ Y. Thus, in the first-order formalism, it is the choice of\nHilbert space that encodes the \"boundary conditions at the singularity\", as opposed to the\nsecond-order formalism where they are encoded in the choice of self-adjoint extension of A.\nIt should be emphasized, as noted above, that care must be taken to ensure that an\noperator defined on an energy-type Hilbert space is in fact densely defined. It appears that\nthis point was overlooked in the analysis of [13], leading to a mistaken conclusion that the\noperator A of that reference is not essentially self-adjoint in certain spherically symmetric\nspacetimes. In [13], the operator (1.2), initially defined on C0∞ (Σ), was viewed as an operator\nin H 1 . However, if C0∞ is not a dense subspace of H 1 , then A is not well-defined. On the other\nhand, if C0∞ is dense, then the deficiency subspaces of A are trivial because the solutions to\n(A∗ ± i)φ = 0, while they are square integrable, are not well-approximated by C0∞ functions.\nThis correction actually strengthens the conclusion of that work, in that it means that all\nthe spacetimes considered there are \"wave regular,\" that is, possessing an essentially selfadjoint A. This suggests that the essential skew-adjointness of h in static spacetimes may\nbe a general property of using Sobolev (energy) Hilbert spaces and not of the first-order\nformalism per se.\n\n6\n\nField Quantization\n\nThere is a general prescription for defining a quantum vacuum associated to any give notion\nof energy which was originally proposed by Ashtekar and Magnon [14], further developed\nby Kay [8], and generalized by Chmielowski [15]. For a globally hyperbolic spacetime, the\nprocedure is as follows. Let Σ be a Cauchy surface for the globally hyperbolic spacetime\n(M, gab ) . Denote by (S, σ) the space of classical solutions, which may be identified with the\ninitial data C0∞ (Σ) ⊕ C0∞ (Σ), together with the symplectic form, which may be done as the\ninitial value problem is well-posed in these spacestimes. Let μ be any inner product on S\nwhich satisfies the inequality\np\n|σ(Φ, Ψ)| ≤ 2 μ(Ψ, Ψ)μ(Φ, Φ),\n(6.1)\n\nand let Hμ denote the completion of S in μ-norm. Kay and Wald [16] showed that μ defines\na state in the class of quasifree states, which includes both vacuum and thermal states.\n( 21 μ is essentially the real part of the two-point function of the state. See [16] or [15] for\nthe details.) As σ is skew-symmetric and bounded on Hμ , there is a unique, bounded,\nskew-adjoint operator Tμ on Hμ such that\nσ(Φ, Ψ) = 2μ(Φ, Tμ Ψ) ∀ Φ, Ψ ∈ S.\n15\n\n(6.2)\n\n\fDefine a new inner product on S by μ̃(Φ, Ψ) = μ(Φ, |Tμ |Ψ), where |Tμ | denotes the \"absolute\nvalue\" of Tμ (see, e.g., [5]). The state defined by μ̃ is pure in addition to being quasifree,\nand hence is a vacuum state [15]. Chmielowski further showed that if μ is the Hamiltonian\n(3.1) (rescaled so that it saturates the inequality (6.1)), then the vacuum state so defined is\nthe well-known \"frequency-splitting\" ground state associated to a timelike Killing field.\nThe assumption of global hyperbolicity was used subtly in the above argument, allowing\nthe identification of C0∞ (Σ) ⊕ C0∞ (Σ) with the space of solutions. This meant that the\nsymplectic form defined via the integral (3.6) was well-defined on the space of solutions S\nbecause it is non-degenerate and conserved for solutions of the wave equation. Similarly,\nthe norm μ on the space of solutions could be defined via an integral on some spatial slice\nbecause there was a natural identification of solutions with initial data on that slice. In\nthe non-globally-hyperbolic case, the situtation is much more complicated. In the absence\nof any prescription for selecting solutions, a given initial datum might be identified with\nmany different solutions of the equation. Hence, the Hamiltonian (3.1) would fail to define\nan inner product because there would be non-zero solutions which have zero norm. Worse\nyet, the sympletic form (3.6) would fail to be non-degenerate. Thus, the quantum vacuum\ncannot be defined because the space of all solutions to the wave equation is \"too large.\" By\nanalogy with the globally hyperbolic space, one might try to define a smaller space S̃ by\nrequiring that the solutions be compactly supported on all spatial slices. However, the time\nevolution carries C0∞ (Σ) ⊕ C0∞ (Σ) data to non-compactly supported data, in general, and\nthus C0∞ (Σ) ⊕ C0∞ (Σ) is \"too small\" as the initial data set.\nHowever, the prescription for defining dynamics presented above is automatically defined\nnot on just C0∞ (Σ) ⊕ C0∞ (Σ) but on the whole Hilbert space HA . Further, σ extends to a\nbounded bilinear form on HA , so that HA is a \"small enough\" space to have a well-defined\nsymplectic structure. If one uses the extension hSA = T −1 (where T is as in the proof of\nTheorem 4.2), σ is conserved for all solutions with initial data in Dom hSA , so that space\ncan be identified with a space of solutions. Since the prescription automatically conserves\nA-norm, if an inner product μ is defined by μ(Φ, Φ) = hΦ | ΦiA (plus appropraite rescaling\nto satisfy (6.1)), then μ̃ = μ. This may be seen explicitly from the proof of Theorem 4.2,\nwhich shows that |Tμ | = |T |. The fact that hSA = T −1 has a bounded inverse has an\nimportant physical consequence: the real part of the two-point function in the quantum\nvacuum associated to T −1 is given by\n1\n1\nμ̃T −1 (Φ, Ψ) = hΦ | |T | ΨiA .\n2\n2\nHowever, if T were not bounded, then the smeared two-point function would diverge. Hence,\n|T |−1 has a \"mass gap\" and thus avoids \"infrared divergences\" in its quantum vacuum.\nThe foregoing analysis, along with the results of [12], [13] that in certain static spacetimes\nthe operator A is not essentially self-adjoint, shows there are many different \"energy splitting\"\nground states possible in a non-globally-hyperbolic spacetime. In these static spacetimes, T\n−1\nis a fixed, bounded function of AE 2 , where AE is the self-adjoint extension used to define the\nHilbert space H̃A . Since different extensions have different spectral decompositions (on Z)\n−1\n\nand AE 2 is a bounded operator, it follows that T is different for different choices of H̃A , even\nwhen restricted to C0∞ (Σ) ⊕ C0∞ (Σ). This contrasts sharply with the globally hyperbolic\ncase, where each timelike Killing field defines a unique ground state, and different timelike\nKilling fields almost always give rise to the same \"frequency-splitting\" ground state [15].\n16\n\n\f7\n\nConclusions\n\nThe present work shows that a dynamical prescription with sensible properties can be given\nin a large class of stationary spacetimes. In the case of static spacetimes obeying (B),\nthe present prescription agrees with the previously studied second-order prescription for a\nparticular choice of extension, namely AF . The basic prescription can also be modified to\ninclude all reasonable dynamics (in the sense of [7]) handled by the second-order formalism.\nNonetheless, the present work leaves many questions unanswered.\nFirst and foremost among these is whether the prescriptions given by using the first-order\nformalism with different slicings in the same spacetime give rise to the same dynamics. While\nit is easy to construct examples of spacetimes with inequivalent slicings satisfying (B)8 , it is\nnot clear whether the dynamics produced by these slicings agree. It seems sensible that the\npreferred extension hSA = T −1 would give rise to the same solutions in any slicing, but this\nremains to be shown. A related question is whether h ever has skew-adjoint extensions other\nthan T −1 . The proof presented above does not preclude this possibility, but no examples\nhave thus far been found, either. A different question is whether h possesses a skew-adjoint\nextension in an arbitrary stationary spacetime. Assumptions (A) and (B) were used in crucial\nways in the proofs in Section 4. However, it is not known whether Theorems 4.1 or 4.2 fail\nwithout these assumptions, or whether (A) and (B) are only needed because of the method\nof proof used. Along these same lines, it would be interesting to compare the first and\nsecond-order formalisms in static spacetimes when (B) is dropped. If they could be shown\nto agree, then the results of Theorem 4.1 would follow from the proof in the second-order\nformalism, without imposing (B) (and possibly (A)). On the other hand, when (B) fails, it\n1\nis no longer true that X -norm bounds some multiple of A 2 -norm. Hence X may properly\ncontain qF , which considerably complicates the analysis of Section 5.\nAll of these question deal purely with the classical theory, but there are questions regarding the quantum theory as well. The analysis of Section 6 analyzed the linear theory only.\nIn the past few years, a general prescription for defining interacting quantum field theory\nin globally hyperbolic, curved spacetimes has been given [17, 18, 19, 20]. This prescription\nrelies on detailed properties of the so-called \"wavefront set\" of the Green's functions of the\nfree theory. One additional question to be answered is whether the solutions defined by the\nprescription given in the present work allow the definition of Green's functions satisfying\nthese same conditions. This would allow an interacting quantum theory to be defined in\nnon-globally-hyperbolic spacetimes in an analogous fashion.\n\nAcknowledgments\nThe author is greatly indebted to Robert Wald for his constant support and advice. Thanks\nare also due to Stefan Hollands, Daniel Hoyt, and Mike Seifert for many useful discussions.\nThis work was supported in part by a National Science Foundation Graduate Research\nFellowship and NSF Grant PHY00-90138 to the University of Chicago.\n8\n\nFor example, one may consider a Minkowski \"strip\" spacetime (R × (0, 1)3 , −dt2 +\nstatic slices are \"rotated into the time direction.\"\n\n17\n\nP3\n\ni=1\n\ndx2i ), where the\n\n\fReferences\n[1] R. M. Wald, General Relativity (U. of Chicago P., Chicago, 1984)\n[2] R. Penrose, in General Relativity: An Einstein Centenary Survey, edited by S. W.\nHawking and W. Israel (Cambridge U. P., Cambridge, England, 1979).\n[3] R. M. Wald, J. Math. Phys. 21, 2802 (1980).\n[4] M. Reed and B. Simon, Fourier Analysis, Self-Adjointness (Academic, New York, 1975).\n[5] M. Reed and B. Simon, Methods of Modern Mathematical Physics I: Functional Analysis, Revised and Enlarged Ed (Academic, New York, 1980).\n[6] W. Rudin, Functional Analysis, 2nd Ed, (McGraw-Hill, Boston, 1991).\n[7] A. Ishibashi and R.\n[arXiv:gr-qc/0305012].\n\nM.\n\nWald,\n\nClass.\n\nQuant.\n\nGrav.\n\n20,\n\n3815\n\n(2003)\n\n[8] B. S. Kay, Commun. Math. Phys. 62, 55 (1978).\n[9] J. von Neumann, Math. Ann. 102, 49 (1930).\n[10] M. H. Stone, Amer. Math. Soc. Colloq. Pub., 15, 1932.\n[11] H.-J. Seifert, Gen Rel Grav. 8, 815 (1977)\n[12] G. T. Horowitz and D. Marolf, Phys. Rev. D 52, 5670 (1995) [arXiv:gr-qc/9504028].\n[13] A. Ishibashi and A. Hosoya, Phys. Rev. D 60, 104028 (1999) [arXiv:gr-qc/9907009].\n[14] A. Ashtekar and A. Magnon, Proc. Roy. Soc. Lond. A 346, 375 (1975).\n[15] P. Chmielowski, Class. Quant. Grav. 11, 41 (1994).\n[16] B. S. Kay and R. M. Wald, Horizon,\" Phys. Rept. 207, 49 (1991).\n[17] R. Brunetti, K. Fredenhagen and M. Kohler, Commun. Math. Phys. 180, 633 (1996)\n[arXiv:gr-qc/9510056].\n[18] R. Brunetti and K. Fredenhagen,\n[arXiv:math-ph/9903028].\n\nCommun. Math. Phys. 208,\n\n623 (2000)\n\n[19] S. Hollands and R. M. Wald,\n[arXiv:gr-qc/0103074].\n\nCommun. Math. Phys. 223,\n\n289 (2001)\n\n[20] S. Hollands and R. M. Wald,\n[arXiv:gr-qc/0111108].\n\nCommun. Math. Phys. 231,\n\n309 (2002)\n\n18\n\n\f"}