{"id": "http://arxiv.org/abs/hep-ex/0206011v1", "guidislink": true, "updated": "2002-06-05T13:51:24Z", "updated_parsed": [2002, 6, 5, 13, 51, 24, 2, 156, 0], "published": "2002-06-05T13:51:24Z", "published_parsed": [2002, 6, 5, 13, 51, 24, 2, 156, 0], "title": "Lectures on HERA physics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ex%2F0206020%2Chep-ex%2F0206027%2Chep-ex%2F0206005%2Chep-ex%2F0206051%2Chep-ex%2F0206050%2Chep-ex%2F0206057%2Chep-ex%2F0206002%2Chep-ex%2F0206018%2Chep-ex%2F0206024%2Chep-ex%2F0206012%2Chep-ex%2F0206033%2Chep-ex%2F0206037%2Chep-ex%2F0206073%2Chep-ex%2F0206075%2Chep-ex%2F0206059%2Chep-ex%2F0206071%2Chep-ex%2F0206066%2Chep-ex%2F0206022%2Chep-ex%2F0206049%2Chep-ex%2F0206011%2Chep-ex%2F0206067%2Chep-ex%2F0206001%2Chep-ex%2F0206026%2Chep-ex%2F0206035%2Chep-ex%2F0206043%2Chep-ex%2F0206044%2Chep-ex%2F0206045%2Chep-ex%2F0206015%2Chep-ex%2F0206048%2Chep-ex%2F0206039%2Chep-ex%2F0206062%2Chep-ex%2F0206058%2Chep-ex%2F0206006%2Chep-ex%2F0206021%2Chep-ex%2F0206036%2Chep-ex%2F0206070%2Chep-ex%2F0206023%2Chep-ex%2F0206004%2Chep-ex%2F0206030%2Chep-ex%2F0206019%2Chep-ex%2F0206013%2Chep-ex%2F0703014%2Chep-ex%2F0703049%2Chep-ex%2F0703003%2Chep-ex%2F0703044%2Chep-ex%2F0703016%2Chep-ex%2F0703008%2Chep-ex%2F0703013%2Chep-ex%2F0703021%2Chep-ex%2F0703036%2Chep-ex%2F0703043%2Chep-ex%2F0703004%2Chep-ex%2F0703026%2Chep-ex%2F0703011%2Chep-ex%2F0703023%2Chep-ex%2F0703042%2Chep-ex%2F0703048%2Chep-ex%2F0703018%2Chep-ex%2F0703007%2Chep-ex%2F0703032%2Chep-ex%2F0703037%2Chep-ex%2F0703047%2Chep-ex%2F0703010%2Chep-ex%2F0703025%2Chep-ex%2F0703038%2Chep-ex%2F0703001%2Chep-ex%2F0703006%2Chep-ex%2F0703024%2Chep-ex%2F0703012%2Chep-ex%2F0703022%2Chep-ex%2F0703033%2Chep-ex%2F0703034%2Chep-ex%2F0703009%2Chep-ex%2F0703005%2Chep-ex%2F0703020%2Chep-ex%2F0703045%2Chep-ex%2F0703027%2Chep-ex%2F0703029%2Chep-ex%2F0703002%2Chep-ex%2F0703039%2Chep-ex%2F0703019%2Chep-ex%2F0703028%2Chep-ex%2F0703015%2Chep-ex%2F0703035%2Chep-ex%2F0703017%2Chep-ex%2F0703031%2Chep-ex%2F0703041%2Chep-ex%2F0703030%2Chep-ex%2F0703046%2Chep-ex%2F0703040%2Chep-ex%2F0210057%2Chep-ex%2F0210009%2Chep-ex%2F0210051%2Chep-ex%2F0210026%2Chep-ex%2F0210062%2Chep-ex%2F0210047%2Chep-ex%2F0210020%2Chep-ex%2F0210043%2Chep-ex%2F0210040%2Chep-ex%2F0210053%2Chep-ex%2F0210034&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Lectures on HERA physics"}, "summary": "In these lectures I introduce the basics of HERA physics and give a survey of\nthe major aspects, discussing in somewhat more depth the subject of low $x$\nphysics.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ex%2F0206020%2Chep-ex%2F0206027%2Chep-ex%2F0206005%2Chep-ex%2F0206051%2Chep-ex%2F0206050%2Chep-ex%2F0206057%2Chep-ex%2F0206002%2Chep-ex%2F0206018%2Chep-ex%2F0206024%2Chep-ex%2F0206012%2Chep-ex%2F0206033%2Chep-ex%2F0206037%2Chep-ex%2F0206073%2Chep-ex%2F0206075%2Chep-ex%2F0206059%2Chep-ex%2F0206071%2Chep-ex%2F0206066%2Chep-ex%2F0206022%2Chep-ex%2F0206049%2Chep-ex%2F0206011%2Chep-ex%2F0206067%2Chep-ex%2F0206001%2Chep-ex%2F0206026%2Chep-ex%2F0206035%2Chep-ex%2F0206043%2Chep-ex%2F0206044%2Chep-ex%2F0206045%2Chep-ex%2F0206015%2Chep-ex%2F0206048%2Chep-ex%2F0206039%2Chep-ex%2F0206062%2Chep-ex%2F0206058%2Chep-ex%2F0206006%2Chep-ex%2F0206021%2Chep-ex%2F0206036%2Chep-ex%2F0206070%2Chep-ex%2F0206023%2Chep-ex%2F0206004%2Chep-ex%2F0206030%2Chep-ex%2F0206019%2Chep-ex%2F0206013%2Chep-ex%2F0703014%2Chep-ex%2F0703049%2Chep-ex%2F0703003%2Chep-ex%2F0703044%2Chep-ex%2F0703016%2Chep-ex%2F0703008%2Chep-ex%2F0703013%2Chep-ex%2F0703021%2Chep-ex%2F0703036%2Chep-ex%2F0703043%2Chep-ex%2F0703004%2Chep-ex%2F0703026%2Chep-ex%2F0703011%2Chep-ex%2F0703023%2Chep-ex%2F0703042%2Chep-ex%2F0703048%2Chep-ex%2F0703018%2Chep-ex%2F0703007%2Chep-ex%2F0703032%2Chep-ex%2F0703037%2Chep-ex%2F0703047%2Chep-ex%2F0703010%2Chep-ex%2F0703025%2Chep-ex%2F0703038%2Chep-ex%2F0703001%2Chep-ex%2F0703006%2Chep-ex%2F0703024%2Chep-ex%2F0703012%2Chep-ex%2F0703022%2Chep-ex%2F0703033%2Chep-ex%2F0703034%2Chep-ex%2F0703009%2Chep-ex%2F0703005%2Chep-ex%2F0703020%2Chep-ex%2F0703045%2Chep-ex%2F0703027%2Chep-ex%2F0703029%2Chep-ex%2F0703002%2Chep-ex%2F0703039%2Chep-ex%2F0703019%2Chep-ex%2F0703028%2Chep-ex%2F0703015%2Chep-ex%2F0703035%2Chep-ex%2F0703017%2Chep-ex%2F0703031%2Chep-ex%2F0703041%2Chep-ex%2F0703030%2Chep-ex%2F0703046%2Chep-ex%2F0703040%2Chep-ex%2F0210057%2Chep-ex%2F0210009%2Chep-ex%2F0210051%2Chep-ex%2F0210026%2Chep-ex%2F0210062%2Chep-ex%2F0210047%2Chep-ex%2F0210020%2Chep-ex%2F0210043%2Chep-ex%2F0210040%2Chep-ex%2F0210053%2Chep-ex%2F0210034&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In these lectures I introduce the basics of HERA physics and give a survey of\nthe major aspects, discussing in somewhat more depth the subject of low $x$\nphysics."}, "authors": ["B. Foster"], "author_detail": {"name": "B. Foster"}, "author": "B. Foster", "arxiv_comment": "52 pages, 42 figures; Lectures delivered at 7th Hellenic School on\n  Elementary Particle Physics, Corfu Summer Institute, September 2001", "links": [{"href": "http://arxiv.org/abs/hep-ex/0206011v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ex/0206011v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ex/0206011v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ex/0206011v1", "journal_reference": "Eur.Phys.J. DIRECTA1 (2002) 1-11", "doi": null, "fulltext": "EPJdirect A1, 1–11 (2018)\nDOI 10.1007/s1010518a123\n\nLectures on HERA physics†\n\nEPJdirect\nelectronic only\nc Springer-Verlag 2018\n\nB. Foster1,2\n1\n\narXiv:hep-ex/0206011v1 5 Jun 2002\n\n2\n\nH.H. Wills Physics Laboratory, University of Bristol, Tyndall Avenue, Bristol, BS8\n1TL, U.K.\ne-mail: b.foster@bris.ac.uk\nDESY, Notkestrasse 85, 22607 Hamburg, Germany.\n\nReceived:\nAbstract. In these lectures I introduce the basics of HERA physics and give a survey\nof the major aspects, discussing in somewhat more depth the subject of low x physics.\n\nPACS: not given\n\n1\n\nIntroduction\n\nThe study of deep inelastic lepton-proton scattering has produced some of the\nmajor underpinnings of the Standard Model. For example, the quark-parton\nmodel took shape in the light of the deep inelastic scattering (DIS) experiments [1] begun at SLAC in the late 1960s. Going even further back, the scattering of energetic \"simple\" α particles from the nuclei in a thin gold foil, carried\nout by Geiger and Marsden in Manchester in 1909, led to the concept of the nuclear atom [2, 3] and is clearly analogous to deep inelastic lepton scattering in\nmodern particle physics.\nIn my lectures I first gave an overview before covering one particular area\nin more detail. In the interests of producing a more coherent write-up, I have\nchanged the original order. I first outline the HERA accelerator and detectors\nbefore discussing the theoretical techniques used to derive the basic formulae\nused in the study of electron-quark scattering. Then I give an overview of the\nmain areas of HERA physics, going into somewhat more detail in one particular\narea, that of electron-proton scattering when the interacting quark has a low\nfraction of the original protons momentum, so-called \"low-x\" physics, and related areas such as diffraction. Here, recent theoretical developments and model\nbuilding are changing our perception and improving our understanding of the\nvery rich phenomenology arising from the many different but related channels\nthat can be explored at HERA. I conclude with a discussion of the recent upgrades to both the accelerator and experiments in the HERA II programme and\nthe main areas of physics that they will address.\n\n† Delivered at 7th Hellenic School on Elementary Particle Physics, Corfu Summer Institute,\nSeptember 2001\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n2\n\n2\n\nIntroduction to the HERA machine and experiments\n\nHERA is a unique facility, colliding beams of electrons or positrons with protons at high energy. The protons are accelerated and stored in a ring of superconducting magnets; until 1998 the protons were accelerated to 820 GeV and\nsubsequently to 920 GeV. The electron or positron ring is normal conducting\nand beams are stored at 27.5 GeV. HERA began operation in 1992 and continuously improved its performance in successive years, as illustrated in Fig. 1,\nwhich shows the luminosity delivered to the ZEUS experiment in each year of\nrunning. Because of difficulties with the electron lifetime, the great majority of\ndata has been taken with positron beams; only 32 pb−1 of electron data has\nbeen collected by ZEUS compared to a total of 148 pb−1 of positron data.\n\nIntegrated Luminosity (pb-1)\n\nHERA luminosity 1992 – 2000\n70\n\n2000\n\n70\n\n60\n\n60\n\n50\n\n50\n\n40\n\n40\n\n1999 e+\n\n30\n\n30\n\n1997\n20\n\n99 e\n\n20\n\n-\n\n1996\n10\n\n1995\n\n1998\n\n10\n\n1994\n\n1993\n15.03.\n\n50\n\n100\n\n150\n\n200\n\nDays of running\n\nFig. 1. The luminosity delivered to the ZEUS detector as a function of days of\nthe run, shown separately for each year of running. A continuous improvement\nin the performance of HERA is evident, except for 1998, in which electrons were\nused rather than positrons.\nThere are two \"general-purpose\" detectors at HERA, H1 and ZEUS. In addition the HERMES experiment uses a gas target to examine polarised electron\nor positron-polarised proton scattering, and the HERA-B detector, designed to\nstudy CP violation in the B sector. The latter two are not discussed further in\nthese lectures due to lack of time. Both H1 and ZEUS have a rather similar configuration, as far as possible enclosing the full solid angle with tracking detectors\nsurrounded by calorimetry. Because of the large asymmetry between the proton\nand positron beam energies, the energy flow is predominantly in the proton, or\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n3\n\n\"forward\" direction, so that the detectors are asymmetric, with thicker calorimetery and a higher density of tracking detectors in the forward direction. Figure 2\nshows a diagram of the ZEUS detector, illustrating that its general structure,\nwith the exception of the more complex forward instrumentation, is very typical\nof modern 4π detectors, such as those at LEP and the Tevatron.\n\nFig. 2. A vertical section through the ZEUS detector. The black cylinders in\nthe very centre represent the silicon microvertex detector, which was installed in\n2000. Surrounding this are the tracking detectors (CTD, FDET and RTD) and\nsurrounding these are the uranium/scintillator calorimeters (FCAL, RCAL and\nBCAL). These are surrounded by an iron-scintillator backing calorimeter (BAC)\nwhich also acts as a flux return for the superconducting solenoid which surrounds\nthe CTD. Muon chambers (FMUON, with associated toroidal magnets, BMUO\nand RMUO), a Veto Wall to veto off-momentum protons and a concrete shield\ncomplete the detector.\nWith the advent of HERA, the accessible phase space in the kinematic invariants Q2 (the virtuality of the exchanged virtual photon) and x increased\nby approximately three orders of magnitude in each variable compared to what\nwas available at earlier fixed-target experiments (see Fig. 3). This extension in\nkinematic range has opened up qualitatively new fields of study, both at high\nand low Q2 .\nSince HERA is a high-energy lepton-hadron collider, it clearly gives access\nto hard processes in both the strong and electroweak interactions. HERA is very\nsensitive to the production of new particles that can be formed by the fusion\nof leptons and quarks, e.g. leptoquarks or many of the particles predicted by\nR-parity-violating supersymmetry. It is also very sensitive to any small changes\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n4\n\nFig. 3. The kinematic plane in x and Q2 for experiments probing the parton\ndistribution of the proton. The regions explored by each experiment are shown\nin a variety of shadings as shown in the legend. Hadron-hadron collisions are also\nable to measure the proton structure, predominantly at high x and high Q2 .\nin the pattern of the electroweak interaction predicted by the Standard Model.\nSince the colliding leptons are point-like, HERA allows complete control over\nthe conditions of the collision by varying the Q2 , and thereby the size, of the\nprobe. At high Q2 , HERA is a probe of the complex structure of the proton\nvia the point-like coupling of the photon. At low Q2 , the photon becomes large\nand evolves its own complex structure which can be probed using the pointlike interactions between its parton constituents and those of the proton. The\nhadronic nature of the photon under these conditions gives rise to hadron-hadron\ninteractions with large cross sections; by also analysing diffractive interactions,\nin which the proton can be violently struck but remain intact, the rich structure\nand phenomenology of the strong interactions can be explored.\nOne thing that HERA physics cannot do is be simple. Unlike the situation\nin electron-positron annihilation, energy and quantum numbers are transferred\nbetween the colliding particles, each of which has its own conserved quantum\nnumbers of lepton and baryon number. This means that the single annihilation\nenergy necessary to describe most of electron-positron or high-energy hadronhadron collisions is insufficient; two invariants are required. These can be picked\nfrom several different possibilities, the most common of which are x and Q2 .\nOthers include W 2 , the square of the energy of the hadronic final state, s, the\nsquared centre-of-mass energy of the electron-proton system, or y, the inelasticity, which in the rest frame of the proton is the energy transferred from the\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n5\n\nelectron to the proton. Only two of these variables are independent; their definitions are given in Eq. 1 in terms of the initial- and final-state four-vectors of the\nelectron, k and k ′ respectively, and the same quantities, p and p′ , for the proton.\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\ns\nQ2\n\n=\n=\n\ny\n\n=\n\nW2\n\n=\n\n6\n\n(p + k)2\n−q 2 = −(k ′ − k)2\np*q\np*k\n(p′ )2 = (p + q)2\n\n(1)\n\nEnergy-momentum conservation implies that\nx=\n\nQ2\n2p * q\n\n(2)\n\nso that, ignoring the masses of the lepton and proton:\ny\n\n=\n\nQ2\nsx\n\nW2\n\n=\n\nQ2\n\n(3)\n1−x\nx\n\n(4)\n\nAnother thing that one cannot expect from HERA is to discover the Higgs.\nHERA physics is dominated by the collisions of the lightest quarks with the\nlightest leptons, so that it is the worst place to look for new particles whose\ncouplings are proportional to mass. Neither can HERA produce new particles\nwith mass close to the centre-of-mass energy unless they have the quantum\nnumbers of leptoquarks; a large proportion of the energy must be carried off by\nthe final-state lepton and baryon in the t channel and is not available for the\nproduction of new particles.\nFinally, it cannot be expected that HERA physics will be simple. Many of the\nsimplest problems in QCD have already been studied in detail. The remaining\nones, such as the problem of confinement, are of the highest importance but\nextremely difficult to study in practice, since they manifest themselves in regimes\nin which the strong interaction is really strong.\n\n3\n\nThe formalism of Deep Inelastic Scattering\n\nIt is instructive to remind oneself that the basic formalism of DIS can be relatively easily derived1 from the QED treatment of spin- 21 – spin- 21 scattering.\nIt is convenient to work in a frame in which the interaction of the virtual photon with the constituents in the proton can be considered as incoherent, i.e.\nthe characteristic time of the γ ∗ q interactions is much shorter than any interactions between the partons. A suitable frame is the infinite-momentum frame of\nthe proton, which at HERA can be approximated by the lab. or centre-of-mass\nframe. In such a frame, Lorentz contraction reduces the proton to a \"pancake\"\n1 In my lecturers I spent considerable time in deriving many of the standard DIS equations\nfrom first principles. My approach was based on the use of the Mandelstam variables and\nfollows closely the treatment in Chapters 6 – 10 of Halzen and Martin [4]. Only an outline of\nthe main points is reproduced here.\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n7\n\nand time dilation increases the lifetimes of the fluctuating partons so that the\nproton constituents are effectively \"frozen\". Provided that the quarks have negligible effective mass, i.e. have small rest mass and are asymptotically free, and\nthat Q2 ≪ kT2 , then the interactions can be considered incoherent [5].\nThe basic process of an electron scattering incoherently from a quark is now\nidentical to the classic QED calculation of electron-muon scattering. Writing the\ninitial and final four-momenta of the electron as k, k ′ and those of the proton as\np, p′ , the standard Feyman rules allow us to write the matrix element as\nM = −e2 u(k ′ )γ ν u(k)\n\n1\nu(p′ )γν u(p)\nq2\n\n(5)\n\nUsing standard trace techniques and ignoring mass terms leads to\n2\n\n|M| =\n\n8e4\n[(k ′ * p′ )(k * p) + [(k ′ * p)(k * p′ )]\n(k − k ′ )4\n\n(6)\n\nIt is very convenient to use the Mandelstam variables, s, t and u, since not only\ncan they easily be evaluated in any frame, but also there are several useful\nrelations between them and the more usual DIS variables of Eq. 1 that simplify\nthe algebra. The Mandelstam variables are defined in terms of the four-vectors\nas:\ns\nt\nu\n\n≡\n≡\n≡\n\n(k + p)2 ≃ 2k * p ≃ 2k ′ * p′ ,\n(k − k ′ )2 ≃ −2k * k ′ ≃ −2p * p′ ,\n(k − p′ )2 ≃ −2k * p′ ≃ −2k ′ * p,\n\n(7)\n(8)\n(9)\n\nso that Eq. 6 simplifies to become\n2\n\n|M| =\n\n2e4 2\n(s + u2 )\nt2\n\n(10)\n\nNote that crossing, the replacement of s by t and vice-versa, leads to the wellknown formula for e+ e− → μ+ μ− .\nThe matrix element can be converted to a cross section by using the standard\nformula for 2 → 2 scattering,\n1\ndσ\n2\n=\n|M| ,\n16πŝ2\ndt̂\n\n(11)\n\nto give\n\ndσ\ne4\n(ŝ2 + û2 ),\n(12)\n=\ndt̂\n8πŝ2 t̂2\nwhere the hatted variables represent the Mandelstam variables for the subprocess\nin question, which for e−μ scattering are identical to the unhatted variables, but\nwhich for eq scattering are not. Considering now eq scattering, the Mandelstam\nvariables satisfy\nŝ + t̂ + û = 0,\n(13)\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n8\n\nwhich, assuming that the quark brings a fraction x of the protons energy into\nthe eq collision can be written as\nx(s + u) + t = 0.\n\n(14)\n\nEquation 12 can be converted into a double-differential cross section using the\nappropriate δ function to give\nd2 σ\ne4\n=\n(ŝ2 + û2 )δ(ŝ + t̂ + û),\ndt̂dû\n8πŝ2 t̂2\n\n(15)\n\nwhich, using the appropriate Jacobian, can be written in terms of s, t and u as\n2πα2 xe2q 2\nd2 σ\n(s + u2 )δ(t + x(s + u)),\n=\ndtdu\ns 2 t2\n\n(16)\n\nwhere α is the fine-structure constant, α = e2 /4π and eq is the charge of the\nstruck quark in units of the electron charge. We can then write the total ep cross\nsection as the incoherent sum of all possible eq scatters, i.e.\n\u0012 2 \u0013\n\u0012 2 \u0013\nXZ\nd σ\nd σ\n=\nfi (x)\ndx,\n(17)\ndtdu ep→eX\ndtdu\neqi →eqi\ni\nwhere fi (x) is the density distribution inside the proton of quark i between x\nand x + dx.\nWe can also treat the overall inclusive DIS process ep → eX from first principles using the Feynman rules provided that we take cognizance of the fact that\nthe proton is not a point-like particle. To do that, we parameterise the proton\nvertex contribution to the matrix element in the most general way possible in\nterms of a hadronic tensor, Wμν , given by\n\u0012\n\u0013\nqμ qν\np̂μ p̂ν\nqα qβ\nWμν = −gμν +\nF1 (x, Q2 ) +\nF2 (x, Q2 ) − iεμναβ\nF3 (x, Q2 )\n2\nq\np*q\n2p * q\n(18)\nwhere\np*q\n(19)\np̂μ = pμ − 2 qμ ,\nq\nand F1 , F2 and F3 are \"structure functions\" describing, in the most general way\ncompatible with relativistic invariance, the unknown structure of the proton.\nThe antisymmetric ε tensor shows that the F3 structure function is parity violating; we will ignore it for the moment, restricting the discussion to low-Q2\nneutral current events where the effects of W and Z exchange can be neglected.\nContracting Wμν with the leptonic tensor used to obtain Eq. 6 leads to\n\u0002\n\u0003\nd2 σ\n4πα2\n(s + u)2 xF1 (x, Q2 ) − suF2 (x, Q2 ) ,\n= 2 2\ndtdu\ns t (s + u)\n\n(20)\n\nwhich can now be compared with Eq. 17. Substituting Eq. 16 and evaluating the\nintegral using the δ function leads to\n\u0012 2 \u0013\nX\n2πxα2 eqi2 (s2 + u2 )\nd σ\nfi (x)\n=\n.\n(21)\ndtdu ep→eX\ns 2 t2\ns+u\ni\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n9\n\nComparison with the right-hand side of Eq. 20 shows that, since s and u are\ncontinuous variables, the two equations can only be consistent if the coefficients\nof the s2 + u2 and su terms are equal, i.e.\nX\n(22)\nfi (x)xe2qi = F2 (x, Q2 ).\n2xF1 (x, Q2 ) =\ni\n\nThis relation between F1 and F2 is known as the Callan-Gross [6] relation. Equation 22 also implies that F2 is a function of x only, a phenomenon known as \"scaling\". This was clearly observed in the original SLAC experiments, as shown in\nFig. 4 and is also clearly visible in the HERA data shown in Fig. 5 at similar\n\nFig. 4. The νW2 (≡ F2 ) structure function at ω = 1/x = 4 as a function of Q2\nas measured by the SLAC-MIT group [7]. Data taken at four different scattering\nangles are shown. All data is consistent with being independent of Q2 .\nvalues of x. However, when one looks at other values of x, it is clear that scaling\nbecomes progressively more and more violated.\nThe phenomenon of scaling violation is one of the clearest manifestations of\nQuantum Chromodynamics and is caused by gluon radiation from the struck\nquark. This radiation is accompanied by a transfer of energy to the emitted\ngluon, which leads to a shift of the average quark x to lower values. The emitted\ngluon can also split into further quark-antiquark pairs which are also at low x.\nThus, since the gluon bremsstrahlung depends on Q2 , the cross section develops\na strong Q2 and x dependence. This can conveniently be taken into account by\nre-writing Eq. 20 as a function of x and Q2 using the Jacobian, (s + u)/x, as\n\"\n#\n2\n(s + u)\n2πα2\nu\nd2 σ\n2\n2\n2\n=\nxF1 (x, Q ) − 2 F2 (x, Q )\ndxdQ2\nxQ4\ns\ns\n=\n\n\u0003\n2πα2 \u0002\n2xy 2 F1 + 2(1 − y)F2 ,\n4\nxQ\n\n(23)\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n10\n\nZEUS 96/97\n\n4\n\nH1 96/97\n\nem\n\nF 2 -log10 x\n\nZEUS+H1\nH1 94/00 Prel.\n\nNMC, BCDMS, E665\nZEUS NLO QCD Fit\n\n3.5\n\n(prel. 2001)\nH1 NLO QCD Fit\n\n3\n\n2.5\n\n2\n\n1.5\n\n1\n\n0.5\n\n0\n1\n\n10\n\n10\n\n2\n\n10\n\n3\n\n4\n\n10 2\n2\nQ (GeV )\n\nFig. 5. The F2 structure function as measured by the H1 and ZEUS experiments\nfor bins at high x as a function of Q2 . The bins centred around x = 0.25 are\nwhere scaling was originally observed in the SLAC experiments. Clear scaling\nviolation is observed in the HERA data outside this region, particularly at lower\nx.\nwhere we have used the identity\ny≡\n\np*q\ns+u\n=\n.\np*k\ns\n\n(24)\n\nRearranging and introducing the longitudinal structure function FL = F2 −2xF1\ngives\nd2 σ\ndxdQ2\n\n=\n\n\u0003\n2πα2 \u0002 2\n−y FL + {1 + (1 − y)2 }F2 .\n4\nxQ\n\n(25)\n\nThe longitudinal structure function is zero in the quark-parton model since the\nquarks have zero transverse momentum. Gluon bremsstrahlung however develops\na non-zero pt , leading to non-zero values of FL .\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n11\n\nConsolidating, we can re-introduce the parity-violating xF3 term and write\ndown the most general spin-averaged form for the cross-section as\nd2 σ\ndxdQ2\n\n=\n−\n\n\u0002\n2πα2\n(1 + δ) Y+ * F2 (x, Q2 )\n4\nxQ\n\u0003\ny 2 FL (x, Q2 ) ± Y− * xF3 (x, Q2 ) ,\n\n(26)\n\nwhere the ± before xF3 is taken as positive for electron scattering and negative\nfor positron scattering, Y± are kinematic factors given by\nY± = 1 ± (1 − y)2 ,\n\n(27)\n\nand δ is the QED radiative correction.\nThe F2 structure function can be expressed, in the \"DIS scheme\" of renormalization [8] in a particularly simple way as\nX\n\u0003\n\u0002\n(28)\nF2 (x, Q2 ) =\nAi (Q2 ) xqi (x, Q2 ) + xq i (x, Q2 ).\ni=u,d,s,c,b\n\nThe parton distributions qi (x, Q2 ) and q i (x, Q2 ) refer to quarks and antiquarks\nof type i. For Q2 ≪ MZ2 , where MZ is the mass of the Z 0 boson, the quantities\nAi (Q2 ) are given by the square of the electric charge of quark or antiquark i.\nSimilarly,\nX\n\u0003\n\u0002\n(29)\nxF3 (x, Q2 ) =\nBi (Q2 ) xqi (x, Q2 ) − xq i (x, Q2 ).\ni=u,d,s,c,b\n\nThe full forms for the A and B terms are:\nAi (Q2 )\n2\n\nBi (Q )\n\n2\n\n2\n\n= e2i − 2ei ceV ciV PZ + (ceV 2 + ceA 2 )(ciV + ciA )PZ 2 ,\n=\n\n4ceV ciV ceA ciA PZ 2 ,\n\n−2ei ceA ciA PZ\n\n+\n\nPZ\n\n=\n\nQ2\n+ MZ2\n\nciV\nciA\n\n=\n=\n\nT3i\n\n=\n\n(30)\n(31)\n\nwhere\n\n=\n\n4\n4.1\n\nQ2\n\nT3i − 2ei sin2 θW\nT3i\n1\n+ for i = ν, u, c, t\n2\n1\n− for i = e, d, s, b\n2\n\n(32)\n(33)\n(34)\n(35)\n(36)\n\nThe HERA DIS data\nThe F2 structure function at medium and high Q2\n\nThe determination of the structure functions of the proton is a delicate and\npainstaking process requiring an excellent understanding of the H1 and ZEUS\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n12\n\ndetector response. This understanding has progressed to the extent that the\naccuracy of the HERA data [9, 10, 11] is equal to that of the fixed-target experiments in the kinematic range explored by them. Of course, the HERA data\nalso extends into a much larger region of x and Q2 and matches well onto the\nfixed-target data in the region of overlap. This has already been exhibited in\nFig. 5 for the higher x bins, and is further illustrated in Fig. 6 for the lower x\nbins, where the large scaling violations are even more obvious. The rapid rise of\n\nZEUS 96/97\nH1 96/97\n\nem\n\nF 2 -log10 x\n\nZEUS+H1\n6\nH1 94/00 Prel.\n\nNMC, BCDMS, E665\n\n5.5\n\nZEUS NLO QCD Fit\n\n(prel. 2001)\nH1 NLO QCD Fit\n\n5\n\n4.5\n\n4\n\n3.5\n\n3\n\n2.5\n1\n\n10\n\n10\n\n2\n2\n\n2\n\nQ (GeV )\n\nFig. 6. The F2 structure function as measured by the H1 and ZEUS experiments\nfor bins at low x as a function of Q2 .\nthe structure function at low x can be clearly seen in Fig. 7, which shows F2 in\nthree Q2 bins as a function of x.\n4.2\n\nNext-to-leading-order QCD fits\n\nThe precise measurement of the proton structure at low x at HERA is very\nsensitive both to the details of the evolution in QCD of the density of gluons and\nto the value of the strong coupling constant, αs , which determines the probability\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n13\n\nFig. 7. H1 and ZEUS data on the F2 structure function shown in three bins of\nQ2 as a function of x. The steep rise of the structure function at low x is clearly\napparent.\nof gluon emission. This sensitivity has been exploited by both ZEUS and H1.\nEach experiment has made a global QCD fit to its own data plus some or all of\nthe fixed-target DIS data. There is reasonably good agreement in general terms\nbetween the experiments, although each experiment has a rather different fit\nprocedure as well as a different choice of the fixed-target data. The quality of\nthe fits in both experiments is excellent, as demonstrated by the curves shown\nin Figs. 5 - 7. The results for the density of the gluon are shown in Fig. 8.\nI now use the ZEUS NLOQCD fit to illustrate some points of interest. Figure 9 illustrates the evolution of the gluon density and that of the sea as a\nfunction of Q2 . While at medium Q2 the sea density lies below that of the gluon\nand follows its shape, at low Q2 it is higher than the gluon. This makes the\nnormal interpretation, that the sea is driven by gluon splitting, rather difficult\nto maintain.\nFigure 10 shows that FL also begins to behave strangely at low Q2 , becoming\nvery flat and at the lowest values of Q2 becoming negative, although the size of\nthe uncertainties still allow it in principle to remain positive. The gluon density,\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n14\n\n2\n\nxg(x,Q )\n\nH1+ZEUS\n20\n\nQ2=20 GeV2\n\nH1 NLO-QCD Fit 2000\nxg=a*xb*(1-x)c*(1+d√x+ex)\nFFN heavy-quark scheme\n\n17.5\n\ntotal uncert.\nexp. uncert.\n\nQ2=200 GeV2\n\n15\n\nZEUS NLO-QCD Fit\n(Prel.) 2001\n\n12.5\n\nxg=a*xb*(1-x)c\nRT-VFN heavy-quark scheme\n\n10\n\nexp. uncert.\n\n7.5\n5\n\nQ2=5 GeV2\n\n2.5\n0 -4\n10\n\n10\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\nX\n\nFig. 8. The gluon density in the proton as measured by ZEUS (red shaded band)\nand H1 [10] (yellow and blue shaded bands) as a function of x in three bins of Q2 .\nThe functional form used by the two collaborations in the gluon fit is somewhat\ndifferent and is shown in the legend.\nwhich is directly related to FL in QCD, certainly becomes negative, which is\nsomewhat difficult to interpret in QCD. However, it is not an observable, whereas\nFL is, so that the tendency for FL to become negative at low Q2 implies a breakdown in the QCD paradigm. We will return to this discussion in Section 5.3. The\nquality of the HERA data is now so high that it alone can give constraints on\nthe parton densities scarcely less good than the fits that include also fixed-target\nand other data. However, it is necessary to make\nsome simplifying assumptions, particularly for the high-x valence behaviour,\nin such fits. The results are illustrated in Fig. 11, which shows the gluon density\narising from such a fit, with its associated uncertainty band, in comparison with\nthe result from the standard fit; the general behaviour is similar, with a somewhat\nlarger uncertainty, particularly at low Q2 .\n4.3\n\nThe determination of αs at HERA\n\nAnother output of the NLOQCD fit is a value of αs ; the results from the two experiments are shown in Fig. 12, labelled as \"NLO-QCD fit\". The value obtained\nby ZEUS is\nαs (MZ2 ) = 0.1166 ± 0.008 ± 0.0032 ± 0.0018,\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n15\n\nZEUS\nQ2=1 GeV2\n\n6\n\n2.5 GeV2\n\nZEUS NLO QCD Fit\n\n4\n\nxg\n\nxS\n\n2\nxS\n\n0\nxg\n\n-2\n\n7 GeV2\n\n20 GeV2\n\n20\n\nxf\n\ntot. error\n(αs free)\n\ntot. error\n(αs fixed)\nuncorr. error\n(αs fixed)\n\n10\n\nxg\nxg\nxS\n\nxS\n\n0\n200 GeV2\n\n2000 GeV2\n\n30\n20\nxg\n\n10\n\nxg\n\nxS\n\nxS\n\n0\n10\n\n-4\n\n10\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\n10\n\n-4\n\n10\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\nx\n\nFig. 9. The gluon density in the proton compared to that of the quark-antiquark\nsea in bins of Q2 as a function of x.\nwhere the uncertainties derive from statistical and other uncorrelated experimental uncertainties, correlated experimental uncertainties, normalisation uncertainties and the error related to omissions and simplifications in the NLOQCD\nmodel. The value H1 obtain from their fit to their and the BCDMS data is\nαs (MZ2 ) = 0.1150 ± 0.0017+0.0009\n−0.0005 ± 0.005,\nwhere the first error source takes account of all experimental uncertainties, the\nsecond takes account of the construction of the NLOQCD model and the final\nuncertainty results from the variation in the factorisation and renormalisation\nscale. The values of αs obtained by the two experiments are in good agreement.\nAlso shown in Fig. 12 are a variety of other high-precision measurements\nof αs that can be made at HERA using a variety of techniques. These include\nclassic methods such as the rate of dijet + proton-remnant production compared\nto that of single jet plus remnant, the subjet-multiplicity evolution inside jets\nand the shape of jets. Many of these give excellent precision, comparable to the\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n16\n\nZEUS\n2\n\n0.4 GeV2\n\n0.5 GeV2\n\n0.585 GeV2\n\n0.65 GeV2\n\n0.8 GeV2\n\n1.5 GeV2\n\n2.7 GeV2\n\n3.5 GeV2\n\n4.5 GeV2\n\n6.5 GeV2\n\nQ =0.3 GeV\n\n0.75\n\n2\n\n0.5\n0.25\n0\n0.75\n0.5\n\nFL\n\n0.25\n0\n0.75\n0.5\n0.25\n0\n0.75\n\n10\n\n0.5\n\n-5\n\n10\n\n-3\n\n10\n\n-1\n\n1\n\nZEUS NLO QCD Fit\ntot. error\n\n0.25\n0\n10\n\n-5\n\n10\n\n-3\n\n10\n\n-1\n\n1 10\n\n-5\n\n10\n\n-3\n\n10\n\n-1\n\n1\n\nx\n\nFig. 10. The FL structure function as predicted by the ZEUS NLOQCD fit as\na function of x in bins of Q2 .\nworld average [12, 13]. The dominant uncertainty is usually theoretical and arises\nfrom the lack of predictions at next-to-next-to-leading order.\n4.4\n\nThe charm-quark structure function, F2c\n\nIn addition to the fully inclusive structure functions discussed above, both ZEUS\nand H1 can identify that fraction of F2 that arises from charm production, F2c .\nThis is achieved by looking for the decay mode D∗ → Dπ, in which, because the\nmass difference between the D∗ and D is only just larger than the pion mass, the\ndaughter pion has a very small momentum. The mass difference between the D∗\ncandidate and the D candidate can therefore be measured very accurately, allowing sufficient suppression of the combinatorial background that the charm signal\ncan be cleanly identified. The structure function can then be unfolded from the\nmeasured differential cross section using models to correct for the unmeasured\nparts of the phase space. The measurements of the semi-inclusive charm structure function, F2c , made by both experiments [14, 15] using this technique are\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n17\n\nFig. 11. The gluon density as a function of x in Q2 bins from an NLOQCD fit\nusing only ZEUS data.\nshown in Fig. 13.\nThe data is still of rather limited statistical precision. Since the charm quark\nis produced predominantly via boson-gluon fusion, F2c is driven by the gluon\ndensity and thus rises steeply as x falls.\n4.5\n\nThe FL structure function\n\nSince in principle both F2 and FL are unknown functions that depend on x and\nQ2 , the only way in which they can be separately determined is to measure the\ndifferential cross section at fixed x, Q2 and at different values of y, since as shown\nin Eq. 26, the effect of FL is weighted by y 2 whereas F2 is weighted by 1+(1−y)2 .\nHowever, since Q2 = sxy, fixed x and Q2 implies taking measurements at different values of s. This can certainly in principle be accomplished by reducing the\nbeam energies in HERA. However, the practical difficulties for the experiments\nand the accelerator inherent in reducing either the proton or electron beam energy, or both, by a factor sufficient to permit an accurate measurement of FL\nmean that it has not to date been attempted. An alternative way to achieve\nthe same end is to isolate those events in which the incoming lepton radiates\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n18\n\nFig. 12. Values of the strong coupling constant as determined at HERA. Each\ndifferent measurement is displaced vertically for ease of visibility; each value\narises from a different method as briefly indicated in the legend. The reference\nfor published results is shown below the method label. The world average as\ncalculated by the Particle Data Group[12] and by Bethke [13] are shown at the\nbottom of the figure.\na hard photon in advance of the deep inelastic scattering, thereby reducing the\neffective collision energy. Unfortunately, the acceptance of the luminosity taggers\ntypically used to detect such photons is sufficiently small and understanding the\nacceptance sufficiently difficult that no result has been obtained as yet.\nIn the absence of any direct determination, the H1 collaboration has used\nevents at very large values of y to make an indirect measurement of FL . The\ndeterminations of F2 rely on the fact that most of the measurements are made\nat values of y sufficiently small that the effects of FL are negligible; at higher y,\na QCD estimate of FL , which is normally a small fraction of F2 , is subtracted.\nThe H1 collaboration inverts this procedure by isolating kinematic regions in\nwhich the contribution of FL is maximised and then subtracts off an estimate of\nF2 extrapolated from lower y.\nThe method used by H1 employs the derivatives of the reduced cross section\nwith respect to ln y. The reduced cross section can be expressed as\nxQ4\nd2 σ\n* (1 + δ) dxdQ2\n\n2πα2 Y+\n\n=\n\nσr\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n19\n\nF2c in the NLO DGLAP scheme\nH1\nZEUS\n\nH1 NLO QCD\nfit to F2\n\n0.50\n2\n\n0.25\n\nZEUS semil\nprel\n2\n\nQ = 1.5 GeV2\n\n3.5 GeV\n\n12 GeV\n\n2\n\n18 GeV\n\n(11)\n(12)\n\n(20)\n\n2\n\n6.5 GeV\n\n(4)\n\n(1.8)\n(2.5)\n\n(7)\n(6.5)\n\nF2c\n\n0.00\n\n0.40\n\n2\n\n2\n\n25 GeV\n(30)\n(32.5)\n\n0.00\n2\n\n130 GeV\n\n60 GeV\n\n0.40\n\n(60)\n(55)\n\n2\n\n565 GeV\n\n2\n\n(100)\n\n0.00\n-5 -4 -3 -2 -1 -5 -4 -3 -2 -1 -5 -4 -3 -2 -1 0\n\nlog x\nFig. 13. Values of the charm structure function, F2c from the H1 and ZEUS\nexperiments in bins of Q2 as a function of ln x. The blue squares show the ZEUS\nusing the D∗ → Kππs decay mode, whereas the purple triangles show a ZEUS\ndetermination using the semileptonic decay of the D. The shaded curves show\nthe predictions from the NLO QCD fit to the inclusive F2 data by H1.\n\n=\n\nF2 (x, Q2 ) −\n\ny2\nFL (x, Q2 ),\nY+\n\n(37)\n\nwhich, when differentiated leads to\n∂σr\ny 2 ∂FL\n∂F2\n2y 2 (2 − y)\nFL −\n*\n=\n−\n2\n∂ ln y\n∂ ln y\nY+\nY+ ∂ ln y\n\n(38)\n\nwhich gives improved sensitivity to FL via the stronger y dependence at the\ncost of involving derivatives of σr , F2 and FL , the quantity to be measured. It is\ninstructive to consider various restrictions:\n• Small y - here ∂σr /∂ ln y ∼ ∂F2 /∂ ln y. For low x, F2 can be well approximated by:\nF2\n\n∝\n\nx−λ ∝ y λ\n\n(39)\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n20\n\nso that:\n∂F2\n∂ ln y\n\n=\n\nλy λ\n\n(40)\n\nwhich can be expanded as:\n∂F2\n∝ λeλ ln y ∼ λ(1 + λ ln y . . .)\n∂ ln y\n\n(41)\n\nprovided λ ln y is small. From this it is clear that ∂σr /∂ ln y is linear in\nln y;\n• FL = 0 - for all y, ∂σr /∂ ln y is linear in ln y for the same reason as above;\n\n∂\n\n∂\n\nH1 Collaboration\n\n• FL 6= 0 and large y - ∂σr /∂ ln y is non-linear in ln y and the deviations are\nproportional to FL and its logarithmic derivative;\n\nFigure 8: Measurement of the derivative (\b\u001br=\brln y)Q2 . The curves represent the QCD 2fit reas a function of y in Q bins. The\nFig. 14. The logarithmic derivative 2∂∂σ\nsult to the H1 96/97 data for y < 0:35 and Q ln3y:5 GeV2 calculated with different assumptions\ncurves represent the results of the H1 NLO QCD fit with differing assumptions\non F . The inner error bars represent the statistical errors and the total error bars the statistical\nabout FL asL shown in the legend.\n\n\u0015\n\nand systematical errors, added in quadrature.\n\nThese features can be seen in the preliminary H1 data of Fig. 14. At the\nlargest values of y, the deviation from linearity implies that FL is non-zero.\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n21\n\nAlthough it is in principle possible to solve the differential equation for FL\nimplied by Eq. 38, in practice the data are insufficiently precise and the QCD\nexpectation is that the derivative of FL is negligible. The uncertainty in this\nassumption is included in the systematic error.\n\nFig. 15. Preliminary H1 estimate of FL . The FL values obtained are plotted in\nQ2 bins as a function of x. Also shown are earlier bins at higher x from the\nSLAC and NMC experiments. The curves with error bands are the predictions\nof the H1 NLO QCD fit.\nThe results are shown in Fig. 15, together with earlier determinations from\nSLAC [16], NMC [17] and BCDMS [18, 19]. The curve is the result of an NLO\nQCD fit to the H1 data deriving from the F2 determination, i.e. by deriving the\ngluon and quark distributions from scaling violations and then calculating FL\nusing QCD. The QCD prediction is in good agreement with the H1 estimate.\n\n5\n\nDeep inelastic scattering at low x\n\nUntil now we have concentrated on hard processes, in which Q2 has been large\nand where QCD has shown itself to be applicable. However, the data, in partichttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n22\n\nular the ZEUS \"BPT\" data [20], give access to very low Q2 and x regimes, in\nwhich the strong interaction becomes very strong and perturbative QCD would\nbe expected to break down. This kinematic region has traditionally been understood in terms of Regge theory. The study of how and where the transition\nbetween these two regimes occurs is very interesting, not only intrinsically but\nalso because of the insight it gives us into links between the apparently rather\ndifferent processes of diffraction and deep inelastic scattering. In addition, the\naccess given to very low values of x at these small Q2 in principle gives sensitivity\nto the mechanism of QCD evolution. Given the steep rise in the parton densities\nas x falls, the data at the lowest x values may also be sensitive to high-density\neffects, such as parton recombination, sometimes known as saturation.\n5.1\n\nQCD evolution\n\nWe assume that the parton distribution functions, f , satisfy the schematic equation:\n∂f\nαs (μ2 )\n∼\n* (f ⊗ P)\n(42)\n∂ ln μ2\n2π\nwhere μ represents the renormalisation scale and P is a 'splitting function' that\ndescribes the probability of a given parton splitting into two others. This equation is known as the Dokshitzer-Gribov-Lipatov-Altarelli-Parisi (DGLAP) Equation [21, 22, 23, 24]. There are four distinct Altarelli-Parisi (AP) splitting functions representing the 4 possible 1 → 2 splittings and referred to as Pqq , Pgq , Pqg\nand Pgg . The calculation of the splitting functions in perturbative QCD in Eq. 42\nrequires approximations, both in order of terms which can be taken into account\nas well as the most important kinematic variables. The generic form for the\nsplitting functions can be shown to be [25]:\n#\n\" n\n\u001a \u0012 \u0013\u001bm\n∞ \u0010\nX\nαs \u0011n X (n)\n1\n(n)\n(43)\nxP(x, αs ) =\n+ xP (x)\nAm ln\n2π\nx\nn=0\nm=0\n(n)\n\n(n)\n\nwhere P (x) are the x-finite parts of the AP splitting functions and Am are\nnumerical coefficients which can in principle be calculated for each splitting\nfunction. In the axial gauge, leading ln Q2 terms arise from evolution along the\nparton chain that is strongly ordered in transverse momentum, i.e.\n2\n2\nQ2 ≫ kt,n\n≫ kt,n−1\n≫ ...\n\nLeading-order DGLAP evolution sums up (αs ln Q2 )n terms, while NLO sums\nup αs (αs ln Q2 )n−1 terms, which arise when two adjacent transverse momenta\nbecome comparable, losing a factor of ln Q2 .\nIn some kinematic regions, and in particular at low x, it must become essential to sum leading terms in ln 1/x independent of the value of ln Q2 . This is done\nby the Balitsky-Fadin-Kuraev-Lipatov [26, 27, 28, 29] (BFKL) equation, which\ngoverns the evolution in x at fixed Q2 . The leading-order terms in (αs ln 1/x)n\narise from strong ordering in x, i.e.\nx ≪ xn ≪ xn−1 ≪ . . .\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n23\n\nOne of the most important goals of HERA physics is the search for experimental\neffects that can be unambiguously attributed to BFKL evolution.\nGenerally, however, QCD coherence implies angular ordering. To see the implications of this it is more convenient to work with unintegrated parton density\nfunctions, f (x, kt2 , μ2 ), where μ is the scale of the probe. There are now two\nhard scales, kt and complicated QCD evolution, known as the Ciafaloni, Catani,\nFiorani and Marchesini [30, 31, 32] (CCFM) evolution equation. The DGLAP\nand BFKL equations can then be seen to be two limits of angular ordering. In\nthe DGLAP collinear approximation, the branching angle, θ, where θ ∼ kt /kl ,\ngrows since kt grows; while for BFKL evolution, θ grows because kl ∝ x falls.\nFigure 16 shows the ln 1/x - ln Q2 plane at HERA, together with schematic\nindications of the directions in which GLAP, BFKL and CCFM evolution is\nexpected to be most applicable. Also indicated on the figure are schematic in-\n\nFig. 16. Schematic diagram showing different regions of the ln 1/x and ln Q2\nplane and the evolution equations expected to hold therein. The line marked\n'saturation' represents the boundary between GLAP evolution and evolution\ngoverned by the GLR equation. The 'size' of partons is also indicated in differing\nkinematic regions.\ndications of both the 'size' and density of partons in the proton in different\nkinematic regions.\nThe transverse size of the partons that can be resolved by a probe with\nvirtuality Q2 is proportional to 1/Q, so that the area of the partonic 'dots' in\nFig. 16 falls as Q2 rises. For particular combinations of parton size and density,\nthe proton will eventually become 'black' to probes, or, equivalently, the component gluons will become so dense that they will begin to recombine. The dotted\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n24\n\nline labelled 'Critical line - GLR' refers to the boundary beyond which it is expected that such parton saturation effects will become important, i.e. the region\nin which partons become so densely crowded that interactions between them\nreduce the growth in parton density predicted by the linear GLAP and BFKL\nevolution equations. The parton evolution in this region can be described by the\nGribov-Levin-Riskin [33, 34] equation, which explicitly takes into account an\nabsorptive term in the gluon evolution equation. Naively, it can be assumed [35]\nthat the gluons inside the proton each occupies on average a transverse area of\nπQ−2 , so that the total transverse area occupied by gluons is proportional to\nthe number density multiplied by this area, i.e. πQ−2 xg(x, Q2 ). Since the gluon\ndensity increases quickly as x falls, and the gluon 'size' increases as Q−1 , in the\nregion in which both x and Q2 are small, saturation effects ought to become\nimportant. This should occur when the size occupied by the partons becomes\nsimilar to the size of the proton:\nxg(x, Q2 )\n\nπ\n= πR2\nQ2\n\n(44)\n\nwhere R is the radius of the proton, (∼ 1 fm ∼ 5 GeV−1 ). The measured values\nof xg(x, Q2 ) imply that saturation ought to be observable at HERA [36] at low\nx and Q2 , although the values of Q2 which satisfy Eq. 44 are sufficiently small\nthat possible non-perturbative and higher-twist effects certainly complicate the\nsituation. Of course,\nit is also possible that the assumption of homogenous gluon density is incorrect; for example, the gluon density may be larger in the close vicinity of\nthe valence quarks, giving rise to so-called 'hot spots' [37], which could lead to\nsaturation being observable at smaller distances and thereby larger Q2 .\n5.2\n\nInterpretation and Models\n\nThe region of low Q2 and low x is one in which perturbative QCD meets and\ncompetes with a large variety\nof other approaches, some based on QCD, others either on older paradigms\nsuch as Regge theory or essentially ad-hoc phenomenological models. In a previous article [38] I gave a quite detailed review of these models, and given that\nthere have not been major developments here, I refer the reader to that for\nfurther information.\n5.3\n\nQCD fits\n\nThe extension of the kinematic range and the high-precision data on F2 from\nHERA provided a substantial impetus to the determination of parton distribution functions via global fits to a wide variety of data. The major current\napproaches are due to the CTEQ group [39] and Martin et al. (MRST) [40].\nIn general both groups fit to data from fixed target muon and neutrino deep\ninelastic scattering data, the HERA DIS data from HERMES, H1 and ZEUS,\nthe W -asymmetry data from the Tevatron as well as to selected process varying from group to group such as prompt photon data from Fermilab as well as\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n25\n\nhigh-ET jet production at the Tevatron. The different data sets give different\nsensitivity to the proton distributions, depending on the kinematic range, but\ntogether constrain them across almost the whole kinematic plane, with the possible exception of the very largest values of x, where significant uncertainties still\nremain [41].\nThe approaches of CTEQ and MRST are basically similar, although they differ both in the data sets used as well as in the fitting procedure and the technical\ndetails of the theoretical tools used, e.g. the treatment of heavy quarks in DIS.\nIn their latest fits, CTEQ prefer to omit the prompt photon data because of the\nuncertainties in scale dependence and the appropriate value for the intrinsic kT\nrequired to fit the data. Instead they use single-jet inclusive ET distributions to\nconstrain the gluon distribution at large x. In contrast, until their most recent\npublications, MRST retained the prompt photon data, giving alternative PDFs\ndepending on the value for the prompt-photon intrinsic kT used. Both groups\nparameterise the parton distributions in terms of powers of x and (1 − x) leading to fits with many free parameters. The MRST NLO parameterisation of the\ngluon is shown below as an example:\nxg\n\n√\n= Ag x−λg (1 − x)ηg (1 + ǫg x + γg x)\n\n(45)\n\nwhere Ag , λg , ηg , ǫg and γg are free parameters in the fit.\nThe seminal work of Botje in producing PDFs with associated error matrices\nfor the first time [42] has led to similar fits being produced by other groups.\nCTEQ [43] have produced a global fit with associated errors, while both H1 [44]\nand ZEUS [45] have produced their own fits using DIS data only, as discussed\nin Section 4.2.\nThese fits allow one to see very graphically the salient features of the QCD\nevolution that have been discussed above. For example, the ZEUS NLOQCD fit\nshown in Fig. 9 has already been discussed in Section 4.2. Here we saw that the\nstrange behaviour both of the gluon vs. sea densities, as well as FL , as a function\nof Q2 showed that the normal QCD interpretation may well be breaking down\nat Q2 around 1 GeV2 .\nOne possible reason for the problems with the interpretation of the NLO QCD\nfits could be the need for higher-order QCD fits i.e. next-to-next-to-leading-order\n(NNLO) fits. The first steps in implementing such fits have already begun; some\nmoments of the NNLO splitting functions have been calculated [46]. Using this\nwith other available information, van Neerven and Vogt [47, 48] have produced\nanalytical expressions for the splitting functions which represent the slowest and\nfastest evolution consistent with the currently available information. The MRST\ngroup has recently used this information to investigate NNLO fits to the available\ndata [49]. Such an analysis requires some changes to the parameterisations used,\nso that for example the NLO parameterisation of the gluon of Eq. 45 becomes:\n√\n′\n′\nxg(x, Q20 ) = Ag x−λg (1 − x)ηg (1 + εg x + γg x) − A′g x−λg (1 − x)ηg , (46)\nprimarily in order to facilitate a negative gluon density at low x and low Q2 ,\nwhich, as we have seen, is preferred by the fits, even at NLO. The results of the\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n26\n\n2\n\nFp\n2(x,Q ) + c\n\nx=1.61×10\n\n-4\n\n(c=0.6)\n\n2\nx=2.53×10\n\n-4\n\n(c=0.2)\n\nZEUS 94\n\nNMC\n\nH1 94\n\nE665\n\nH1 94-97\n\nBCDMS\nSLAC\n\n1.75\n\nx=1.3×10\n\n-3\n\n(c=0.2)\n\n1.5\n\n-3\n\nx=8×10\n\n1.25\n\n(c=0.2)\n\n1\n\n0.75\n\nx=5×10\n\n-2\n\n(c=0.1)\n\n0.5\n\nx=0.18 (c=0)\n\n0.25\nx=0.35 (c=0)\n\nNNLO\n\nNLO\n\n0\n1\n\n10\n\n10\n\nLO\n2\n\n2\n\n2\n\nQ (GeV )\n\n10\n\n3\n\nFig. 17. The MRST 'central' NNLO fit to DIS data. The solid line shows the\nNNLO fit, while the NLO fit is shown by the dashed line and the LO fit by the\ndotted line. The data are from H1, ZEUS and the fixed target experiments and\nare plotted in x bins as a function of Q2 with an additive constant added to the\ndata of each x bin to improve visibility.\n'central' fit, between the extremes of the van Neerven-Vogt parameterisation, is\nshown in Fig. 17.\nThere are also changes of the LO and NLO fits with respect to earlier publications, in as much as MRST now follow CTEQ in using the Tevatron high-ET\ndata rather than the prompt-photon data, and HERA F2 data has been included\nin the fit. There is a marked improvement in the quality of the fit in the progression LO → NLO → NNLO, in particular in terms of the NMC data. The\nsize of higher-twist contributions at low x also decreases, so that at NNLO is it\nessentially negligible. The effect of going to NNLO on the PDFs themselves is\nhighly non-trivial. This is illustrated in Fig. 18, where the quite major changes\nin FL , particularly at low x, are evident. There is also a large variation depending on the choices made in the parameter space allowed by the partial NNLO\nansatz. Indeed, the GLAP approach is not convergent for Q2 < 5 GeV2 , which\nmay well be due to the neglect of important ln 1/x contributions. However, the\ninstability seen at low Q2 soon vanishes at higher Q2 .\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n0.5\n\n27\n\n0.5\n\nQ2=2 GeV2\n0.4\n\n2\n\nFL(x,Q )\n\nQ2=5 GeV2\n\nNNLO (average)\nNNLO (extremes)\nNLO\nLO\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\n0\n1\n\n0.5\n2\n\nQ =20 GeV\n\n2\n\nFL(x,Q )\n\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\n10\n\n-2\n\n10\n\n-1\n\n1\n\n0.5\n2\n\n2\n\n0.4\n\n0.3\n\n0.3\n\n0.2\n\n0.2\n\n0.1\n\n0.1\n\n0\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\nx\n\n10\n\n-2\n\n10\n\n-1\n\n2\n\nQ =100 GeV\n\n0.4\n\n0\n1\n\n10\n\n-5\n\n10\n\n-4\n\n10\n\n-3\n\nx\n\n10\n\n-2\n\n10\n\n-1\n\n1\n\nFig. 18. The FL structure function from the MRST fits, taking into account\npart of the NNLO corrections in four bins of Q2 as a function of x. The solid\nline shows the 'average' of the parameter space available to choose the NNLO\nparameters, while the dashed-dotted lines show the two extreme possibilities.\nThe NLO fit is indicated by the dashed line while the LO fit is indicated by the\ndotted line.\nThorne has investigated the question of incorporating ln 1/x terms in the\nsplitting functions by incorporating the solution of the NLO BFKL kernel using\na running coupling constant [50, 51]. The inclusion of the BFKL terms does\nindeed give an improved fit compared to the 'central' NNLO fit, particularly at\nthe lowest Q2 and x. This may be one of the first unambiguous indications of\nthe importance of BFKL evolution.\n5.4\n\nData in the transition region\n\nThe approximate position of the transition between data that can be described\nby pertrubative QCD evolution and that which require the Regge approach can\nbe seen in Fig. 19.\n> 1 GeV2 , the data are roughly independent of Q2 , whereas at lower\nFor Q2 ∼\n2\nQ they fall rapidly, approaching the Q−2 dependence that would be expected\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n28\n\nZEUS 1997\nZEUS QCD fit\nZEUS Regge fit\n\nH1 SVX 1995\nH1 1994\n\n2\n\n2\n\nF2 (x = Q /sy , Q )\n\nZEUS BPT 1997\nZEUS SVX 1995\nZEUS 1994\n\n10\n\n3\n\ny=0.8\n(× 4096)\n\n10\n\ny=0.7\n\n2\n\n(× 2048)\n\ny=0.6\n(× 1024)\n\ny=0.5\n(× 512)\n\ny=0.4\n(× 256)\n\n10\n\ny=0.33\n(× 128)\n\ny=0.26\n(× 64)\n\ny=0.2\n(× 32)\n\n1\n\ny=0.12\n(× 16)\n\ny=0.05\n(× 8)\n\ny=0.025\n\n10\n\n(× 4)\n\n-1\n\ny=0.015\n(× 2)\n\ny=0.007\n(× 1)\n\n10\n\n-2\n\n10\n\n-1\n\n1\n\n10\n\n2\n\n2\n\nQ (GeV )\n\nFig. 19. ZEUS BPT data on F2 in bins of y as a function of Q2 . Also shown are\nearlier ZEUS data as well as data from H1. The solid line shows the results of\nthe ZEUS Regge fit to the form of Eq. 47, while the dotted line shows the result\nof the ZEUS NLO QCD fit.\nin the limit Q2 → 0 from conservation of the electromagnetic current. Although\nQCD gives a good fit to the data down to Q2 ∼ 1 GeV2 , below that it is necessary\nto use a Regge-based fit of the form\n\u0012 2 \u0013\u0012\n\u0012 2 \u0013αIR −1\n\u0013\n\u0012 2 \u0013αIP −1 !\nQ\nQ\nM02\nQ\n2\nF2 (x, Q ) =\n,\nAIR\n+ AIP\n2\n2\n2\n4π α\nM0 + Q\nx\nx\n(47)\nwhere AIR , AIP and M0 are constants and αIR and αIP are the Reggeon and\nPomeron intercepts, respectively. Regge theory is expected to apply at asymptotic energies. The appropriate energy here is W , the centre-of-mass energy of\nthe virtual photon-proton system, given by Eq. 4. Since, at low x, W 2 ∼ 1/x, it\nwould be expected that Regge fits would be applicable at very low x and Q2 .\nThe complete ZEUS data over six orders of magnitude in x and Q2 are shown\nin x bins as a function of ln Q2 in Fig. 20, together with fixed target data from\nNMC and E665, which extends the range in the direction of medium x and Q2 .\nThe availability of this very wide range of precise data makes possible qualhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n29\n\nFig. 20. Compilation of ZEUS F2 data in x bins as a function of Q2 . Each x\nbin is shifted by an additive constant for ease of visibility. Data from NMC and\nE665 are also shown. The dotted lines show lines of constant W , while the solid\nlines are fits to the form of Eq. 48.\nitatively new investigations of models that describe F2 . Since the logarithmic\nderivative of F2 is directly proportional to the gluon density in leading-order\nQCD, which in turn is the dominant parton density at small x, its behaviour\nas a function of both x and Q2 is important. The solid curves on the figure\ncorrespond to fits to a polynomial in ln Q2 of the form\n\u00012\n\u0001\nF2 = A(x) + B(x) log10 Q2 + C(x) log10 Q2 ,\n\n(48)\n\nwhich gives a good fit to the data through the entire kinematic range. The dotted\nlines on Fig. 20 are lines of constant W . The curious 'bulging' shape of these\ncontours in the small-x region immediately implies that something interesting is\ngoing on there. Indeed, simple inspection of Fig. 20 shows that the slope of F2\nat constant W begins flat in the scaling region, increases markedly as the gluon\ngrows and drives the evolution of F2 and then flattens off again at the lowest x.\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n30\n\nFigure 21 shows the logarithmic derivative evaluated at (x, Q2 ) points along\nthe contours of fixed W shown on Fig. 20 according to the derivative of Eq. 48,\nviz.:\n∂F2\n= B(x) + 2C(x) log10 Q2 ,\n(49)\n∂ log10 Q2\nwhere the data are plotted separately as functions of ln Q2 and ln x. The turn-\n\nFig. 21. The logarithmic derivative of the ZEUS F2 data in six bins of W , plotted\nas a function of Q2 and x.\nover in the derivatives in all W bins is marked. Within the framework of pQCD,\nthe interpretation of such an effect is that the growth of the gluon density at\nlow x is tamed as Q2 and x fall. This behaviour can also be seen more clearly\nin Fig. 22, which shows a three-dimensional plot of the derivatives as a function\nof both ln x and ln Q2 , obtained from a parameterisation of the DIS data.\nSuch an effect is by no means necessarily an indication of deviations from\nthe standard DGLAP evolution. It can be seen from Fig. 22 that, for example,\nno turnover effect occurs in bins of constant Q2 . Nevertheless, the features of\nFigs. 21 and 22 can be explained as a natural consequence of parton saturation\nor shadowing. These effects can be naturally discussed in \"dipole models\" [38],\nwhich often explicitly take into account parton-saturation effects. In such models,\nthe \"standard\" picture of deep inelastic scattering in the infinite-momentum\nframe of the proton is replaced by an equivalent picture produced by a Lorentz\nboost into the proton rest frame. In this frame, the virtual photon undergoes\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n+\n\n31\n\n\bF2\n\blog10 Q2\n1.8\nHERA kin. limit\n+\u0011\u0011\n\n1.2\n0.6\n210\n\n0 85\n-6\n30\n-5\n-4\n\nlog10 x\n\n50\n\n1\n\n(W in GeV)\n\n0\n-2-1\n\n3\n\n2\n\n14\n\n-3\n\n130\n\nlog10Q2\n2 in GeV2 )\n\n(Q\n\nFig. 22. The logarithmic derivative of the ZEUS F2 data plotted as a surface in\nthree dimensions versus both Q2 and x. The curves show lines of constant W .\ntime dilation and develops structure far upstream of the interaction with\nthe proton. The dominant configurations of this structure are qq and qqg Fock\nstates, which interact with the proton as a colour dipole. The higher the Q2 of\nthe interaction, the smaller the transverse size of the dipole. For small x, the deep\ninelastic process can be considered semi-classically as the coherent interaction\nof the dipole with the stationary colour field of the proton a long time after\nthe formation of the dipole. As an example, the model of Golec-Biernat and\nWüsthoff (GBW) [52, 53] is shown in Fig. 23, together with the results of the\nZEUS NLOQCD fit.\nIt can be seen that the GBW model reproduces the basic features of the logarithmic derivative plot reasonably well. However, so does the ZEUS NLOQCD\nfit, so that no firm conclusion can be drawn on the existence or otherwise of\nsaturation effects.\n+\n\n6\n\n+\n\nDiffraction\n\nDiffractive DIS is that subset characterised by a hard interaction between the\nproton and the exchanged virtual photon that nevertheless leaves the proton\nintact. Such interactions are normally thought of in Regge theory as proceeding\nvia the exchange of a colourless particle with the quantum numbers of the vacuum, known as the Pomeron. The Pomeron under some circumstances can be\nconsidered to develop its own partonic structure, analogous to the proton, which\ncan be parameterised using diffractive DIS data.\nOne of the most attractive features of dipole models such as that of GBW\ndiscussed in the previous section is the rather natural way in which they can lead\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n32\n\nFig. 23. The logarithmic derivatives of the ZEUS F2 data as shown in Fig. 21.\nThe dotted curves show the predictions of the BGW model for the five highest W\nbins; since these predictions do not include QCD evolution effects, they should\nbecome progressively less accurate as Q2 increases. The solid curves show the\npredictions of the ZEUS NLO QCD fit for all W bins; they are only shown down\nto Q2 ∼ 3 GeV2 .\nto a unified description of diffraction and deep inelastic scattering. The QCD interpretation of the Pomeron is that it is equivalent to the exchange of two gluons\nin a colour-singlet state. In this picture, therefore, diffraction can be considered\nas a subset of fully inclusive DIS, which sums over all possible exchanges between\nthe dipole and the proton, dominantly one- and two-gluon exchange in a colour\noctet, in contrast to the colour-singlet exchange that dominates inclusive DIS.\nThis deep connection between these two processes leads to non-trivial predictions which do indeed seem to be at least qualitatively in agreement with the\ndata. This is illustrated in Fig. 24. This figure is surprising for several reasons.\nIt demonstrates that the diffractive cross section has the same W dependence as\nthe total cross section. To the extent to which the diffractive cross section can\nbe related to the elastic cross section, one would have expected from the Optical\nTheorem that the ratio would have a power-law dependence on W , as indeed\nwould also be expected from Regge theory via the exchange of a Pomeron. A\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n33\n\nFig. 24. The ratio of the diffractive to total cross section in four Q2 bins as\na function of W . The curves show the predictions from the Golec-Biernat &\nWusthoff model.\nstrong W (∼ 1/x) dependence is also expected in QCD models, since the total cross section is dominated by single-gluon exchange, whereas diffraction is\ndominated by two-gluon exchange. The other surprise is the fact that the GBW\nmodel gives a rather good qualitative representation of the data.\nZEUS has also investigated the behaviour of this ratio as Q2 → 0 [54]. FigD(3)\nure 25 shows the diffractive structure function, xIP F2\n(the analogue to F2 ,\nintegrated over t) multiplied by xIP , the fraction of the protons momentum carried by the Pomeron, as a function of Q2 in various bins of W and in two bins\nD(3\nof MX , the mass of the hadronic system other than the proton. The F2\ndata\npoints are determined using two methods, one of which requires the observation\nof a large rapidity gap in the proton-beam direction, while the other uses the\nZEUS Leading Proton Spectrometer (LPS) [55]. This device is an array of six\nstations of silicon-strip detectors placed in Roman pots downstream of the interaction point in the proton beam direction. It uses the HERA beam elements\nto form a magnetic spectrometer to analyse the leading proton from diffractive\ninteractions. Although its acceptance is of necessity small, it avoids the low-mass\nproton dissociative background endemic with other forms of identifying diffractive interactions. The similarity of Fig. 25 to Fig. 19 is striking, again illustrating\nthe Q−2 falloff enforced by electromagnetic current conservation.\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n34\n\nD(3)\n\nFig. 25. xIP F2\nin bins of W and MX as a function of Q2 . The curves refer\nto the model of Bartels et al. [56]\n6.1\n\nVector meson production\n\nThe exclusive production of vector mesons is both a very simple laboratory to\nstudy many aspects of diffraction as well as a process in which dipole models\nare likely to be particularly appropriate. Figure 26 shows the photoproduction\ncross sections for a variety of vector mesons as a function of W , as well as the\ntotal cross section. The relatively slow rise of the total cross section with Q2 is\nindicative of the dominance of soft processes. The J/ψ cross section clearly has\na much steeper rise with Q2 . This is more clearly seen in Fig. 27, where the cross\nsection for several different Q2 is shown as a function of W . It would appear that\nthe mass of the J/ψ is sufficiently large that it gives rise to a hard scale even at\nQ2 ∼ 0.\nIn contrast, the mass of the ρ is small and quite large values of Q2 need\nto be reached before the W dependence rises to the values associated with hard\nprocesses. This can be seen in Fig. 28, which shows the values of the fit to a power\nlaw in W as a function of Q2 . An appropriately hard scale seems to pertain for\nQ2 > 5.\nThis behaviour, in which either Q2 or the mass can act as a hard scale, leads\nto the obvious question of whether a combination of these two quantities can\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fR. Yoshida, DESY Seminar 30 Nov.\n\n16\n\nPHOTPRODUCTION\nOF VECTOR MESONS\nEPJdirect\nA1, 1–11 (2018) Springer-Verlag\n\nW\n\n35\n\nF\n\n0:8 ! (i.e. twice\nrises\nlikephotoproduction\nGeV2with\n) the photopro2 at 10\nFig.J/\n26. The\ntotal\ncross section\ntogether\nduction cross sections for a variety of vector mesons as a function of W from\nH1, ZEUS and several fixed-target experiments. The dotted lines show W to the\nindicated powers.\n\nalso give a hard scale. Figure 28 shows the data on ρ, φ and J/ψ production\nfrom H1 and ZEUS plotted against Q2 + M 2 . There is indeed a tendency for\nthe data for all the vector mesons to lie on a universal curve. However, other\nmore detailed comparisons [57] show that some differences do remain between\nthe different species even when plotted against Q2 + M 2 .\nTo the extent that we can model diffraction by the exchange of a colourless\ntwo-gluon state, we would expect a difference between the W dependence of\nvector meson production and inclusive DIS. This is illustrated in Fig. 29 shows\nthe values of fits to the W -dependence of the inclusive DIS and vector-meson\ncross sections against Q2 and Q2 + M 2 , respectively. For Q2 + M 2 greater than\nabout 5 GeV2 , the value of δ is indeed about twice that at the same value of\nQ2 in inclusive DIS, as would be expected in the simple picture of two-gluon\nexchange.\nProvided that we have a scale sufficiently hard that pQCD is applicable,\nwe can also use vector meson production to probe the gluon density in the\nproton. Since the cross section is proportional to the gluon density squared,\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n36\n\n10\n\nZEUS 96-99 (Preliminary)\nZEUS 95\nH1 95-97\nZEUS PhP (Preliminary)\nH1 PhP\nFit with Wδ\n\n2\n\n2\n\nQ\n\n0 GeV\n\n2\n\n3.1 GeV\n\n2\n\n6.8 GeV\n\n2\n\n10\n\n2\n\nδ\n\nσtot(γ*p→J/ψp) [nb]\n\nZEUS 96-99 Preliminary\n\n1\n\n16 GeV\n\n1\n\n10\n\n2\n\n-1\n0 0\n\n10\n\n5\n\n10 15 20\n2\n2\nQ [GeV ]\n\nFKS (CTEQ4M)\nMRT (CTEQ5M)\n\n100\n\nW [GeV]\nFig. 27. The ZEUS and H1 J/ψ cross section for several bins of Q2 as a function\nof W . The dotted lines show the predictions of the model of Frankfurt, Koepf\nand Strikman [58], the dashed lines show the predictions of Martin, Ryskin and\nTeubner [59] and the solid lines show fits to the form of W δ . The inset shows\nthe δ obtained from these fits as a function of Q2 .\nsuch a determination should in principle be much more sensitive to the gluon\ndensity than, for example, scaling violations in deep inelastic scattering. This is\nillustrated in Fig. 30, which shows ZEUS and H1 data for J/ψ photoproduction\nas a function of W . We have seen already that the J/ψ mass is sufficiently large\nto guarantee that pQCD is applicable even in photoproduction. The quality of\nthe data is sufficiently high that it is in principle sensitive to the gluon density.\nUnfortunately, the wave-function of the J/ψ must be modelled, which leads to\nsubstantial uncertainty in the model predictions, so that this data has not as\nyet been used in global fits to constrain the gluon density. The good agreement\nbetween at least some version of the models and the data, as shown in Fig. 30,\ndoes however indicate that the gluon determined in the global fits to DIS data is\nindeed also able to explain the dynamics of this completely different diffractive\nprocess.\nFinally, it is interesting to investigate whether t can also provide a hard scale\nfor pQCD. ZEUS has precise data out to −t ∼ 12 GeV2 for ρ production and\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\f37\n\nδ\n\nEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n2\n1.8\n1.6\n1.4\n1.2\n1\n0.8\n0.6\n0.4\n0.2\n0\n10\n\n-1\n\n1\n\n10\n\nQ2+M2 (Gev2)\n\nFig. 28. a)Results of a fit to the ZEUS ρ data of the form W δ . The value of the\nexponent is plotted as a function of Q2 . b) The exponent obtained from fits of\nthe form W δ to the vector meson data from ZEUS and H1. The value of the\nexponent δ is plotted against Q2 + M 2 .\nalso to beyond 6 GeV2 for φ and J/ψ. The ratio of the cross sections for φ and\nρ starts somewhat below the SU (4) expectation but reaches it quite quickly, by\n−t ∼ 3 − 4 GeV2 . In contrast, the J/ψ ratio remains below the SU (4) prediction\nfor much longer, hardly reaching it even for −t ∼ 6 GeV2 . Figure 31 shows\nthe ZEUS data for all three vector mesons as a function of −t compared to\na two-gluon exchange model and to a model in which a BFKL gluon ladder\nis exchanged [60]. It can be seen that the two-gluon model completely fails to\nreproduce the data both in magnitude and in shape, whereas the BFKL model,\nwhich has been fit to the ZEUS data, gives an excellent fit for all three mesons.\nAlthough some of the model assumptions, such as a fixed αs and a δ-function\nwave-function for the light vector mesons, are somewhat questionable, the fact\nthat this BFKL model fits the data whereas conventional pQCD fails is very\nstriking. It can thus be concluded that t does form an appropriate hard scale\nfor pQCD calculations. However, the ratios of ZEUS vector-meson cross sections\nbehave differently as a function of t compared to Q2 , so that either these ratios\nare different at asymptotic values of the two variables, or t and Q2 are not\nequivalent hard scales.\n6.2\n\nDeeply virtual Compton scattering\n\nDeeply virtual Compton scattering (DVCS) is an interesting process in that it\nis the simplest possible non-elastic diffractive process. It consists of diffractive\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n38\n\n0.4\n\n<0.00162306>\n<0.00095165>\n<0.00227318>\n<0.0014482>\n<0.00304136>\n<0.00299975>\n<0.00451124>\n<0.00410002>\n<0.00459743>\n<0.00495006>\n<0.00506948>\n<0.00529229>\n<0.00550928>\n<0.00580033>\n<0.0062456>\n<0.00652878>\n\n<0.00364125>\n<0.00309425>\n<0.000360726>\n\n<0.00559217>\n\n<0.00568277>\n\n<0.00485614>\n\n<3.335E-06>\n<6.3483E-06>\n<5.6949E-05>\n<0.000248017>\n<0.000791945>\n<0.000293472>\n<0.00298902>\n\nλeff\n\nZEUS\n0.5\n\n\n\nx\n\nZEUS slope fit 2001 (prel.)\n-λeff\n\nF2 ~ x\n0.3\n\nZEUS QCD 01 (prel.)\nZEUS REGGE 97\nZEUS BPT97\nZEUS SVTX95\nZEUS 96/97\nE665\nNMC\nBCDMS\nSLAC\nx < 0.01\n\n0.2\n\n0.1\n\n0\n1\n\n10\n\n10\n\n2\n\n2\n\n2\n\nQ (GeV )\n\nFig. 29. a) Values of the exponent in fits of the form W δ to the W dependence\nof the inclusive DIS total cross section, as a function of Q2 . b) Values of the\nexponent in fits of the form W δ to the W dependence of the cross section for a\nvariety of vector mesons, as a function of Q2 + M 2 .\nscattering of the virtual photon from the proton, putting the virtual photon\nonto mass shell so that the final state consists of the initial proton and positron\nplus a photon. As such, no fragmentation or hadronic wave-functions complicate\nthe process. The Bethe-Heitler QED process also leads to the same final state,\nwhich is both a blessing and a curse. The curse is that is necessary to separate\nthe two processes; the blessing is that the fact of identical final states leads to\ninterference. Since the amplitude and phase of the QED process is calculable,\nin principle this opens the door to the determination of the unknown QCD\namplitude that governs DVCS. However, we are still some considerable distance\nfrom this goal.\nGiven that a virtual photon participates in the collision with the parton\nin the proton and that it emerges on mass shell, it is clear that the scattered\nparton that must be re-integrated into the final-state proton must undergo a\nchange in its four-momentum corresponding to a change in its x value. Thus the\nDVCS process is sensitive to the so-called \"skewed parton distributions inside\nthe proton, which can be thought of as the cross-correlation function between\npartons of fractional momentum x1 and x2 . Thus much unique information can\nbe obtained by studying these processes.\nThe DVCS process was first seen at HERA by ZEUS [61]. The H1 collaboration has published results on the observation of this process and the first\nmeasurement of the cross section [62]. The background from the Bethe-Heitler\nprocess can be subtracted by utilising the kinematic characteristics of the two\nprocesses. In DVCS, the photon is normally produced at a large angle to the\nincident beam directions and the positron at a small angle, whereas, for the\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n39\n\nZEUS\nσγp → J/ψp (nb)\n\nσγp → J/ψp (nb)\n\nZEUS\n225\nZEUS 96-97 J/ψ → μ μ\n+ ZEUS 99-00 J/ψ → e e\nH1\nE401\nE516\n\n+ -\n\n200\n175\n150\n\n225\n+ -\n\n175\n150\n\n125\n\n125\n\n100\n\n100\n\n75\n\n75\n\n50\n\n0\n\n0\n\n50\n\n100\n\nFMS (CTEQ4L, λ=4)\nMRT (CTEQ5M)\nMRT (MRST99)\nGBW double Gaussian\n\n50\n\nδ\n\nW fit to ZEUS data\nδ = 0.69 ± 0.02 (stat.) ± 0.03 (syst.)\n\n25\n\nZEUS 96-97 J/ψ → μ μ\n+ ZEUS 99-00 J/ψ → e e\n\n200\n\n150\n\n200\n\n250\n\n300\n\nW (GeV)\n\n25\n0\n\n0\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nW (GeV)\n\nFig. 30. a) The ZEUS and H1 data on J/ψ photoproduction, together with the\ndata from two fixed target experiments as a function of W . The curve shows\na fit to the form W δ . b) The ZEUS data together with curves showing the\npredictions using the stated gluon pdfs from the models of Frankfurt, McDermott\nand Strikman [65] and Martin, Ryskin and Teubner [59].\nBethe-Heitler process, the reverse is the case. The sum of Monte Carlo generators describing the two processes gives a good description of the kinematic\nquantities of the data, giving confidence that the DVCS cross section can be\nextracted. The H1 and ZEUS cross sections are shown in Fig. 32. It can be seen\nthat the cross sections are completely dominated by statistical errors and that\nboth collaborations find good agreement with theoretical models, notably that\nof Frankfurt, Freund and Strikman [63] and Donnachie and Dosch [64]. As more\ndata is collected, the possibility of using this process to determine skewed parton\ndistributions will make it a fruitful area of study at HERA II.\nThere are many more areas of diffraction, in particular the diffractive structure functions, which I have not been able to cover. The study of diffraction has\nturned out to be one of the most exciting and rich areas of HERA physics. It\nwill continue at HERA II and will hopefully allow us to make progress in our\nunderstanding of soft interactions and the related, and fundamental, question of\nunderstanding confinement in QCD.\n\n7\n\nHeavy quark production\n\nWe have already touched upon the production of charm quarks at HERA in\nthe discussion of the F2c in Section 4.4. In fact, copious amounts of charm are\nproduced in photoproduction at HERA, so that for many channels, HERA is\na \"charm factory. The ZEUS collaboration has made several contributions to\ncharm spectroscopy results: as an example, Fig. 33 shows the D∗ π spectrum\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n10\n\n3\n\n10\n\n2\n\n40\n\nZEUS\nZEUS 1996-97\nForshaw\nPoludniowski\n\n10\n1\n\n(a)\n\n-1\n\nγ p → ρY\n\n10\n\ndσ/dt (nb/GeV 2)\n\n0\n\n10\n\n2\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n10\n1\n-1\n\n(b)\n\n10\n0\n\nγ p → φY\n\n2\n\n4\n\n6\n\n4\n\n6\n\n10\n1\n(c)\n-1\n\n10\n\n0\n\nγ p → J/Ψ Y\n\n2\n\n2\n\n-t (GeV )\n\nFigure 8:\nThe measured di erential ross se tions d\u001b p!V Y =dt (symbols) for\n(a) \u001a0 , (b) \u001e, and ( ) J= photoprodu tion in the range 80 < W < 120 GeV and\n\nFig. 031.\nZEUS\ndata\nvector-meson\nproduction\nat[16℄.\nhighThe\n−t.inner\nThe bars\ncurve\n:01 The\n< x\n^ <\n1. The\nsolidonurves\nshow a pQCD\nal ulation\nate the statisti al un ertainty and the outer bars represent the statisti al and\nshowsindi\na\nfit\nto\na\nBFKL-model\nby\nForshaw\nand\nPoludniowski.\nsystemati un ertainties added in quadrature. The shaded bands represent the size\nof the orrelated un ertainties due to the modelling of the disso iative system Y:\n\nfrom 110 pb−1 of data. A rather complex set of structures can be observed\nbetween 2.4 and 2.5 GeV, some of which correspond to known resonances and\nsome of which do not. Work continues36to understand this complex area; the\nsensitivity of ZEUS in this sort of investigation is similar to that of the LEP\nexperiments and CLEO.\nBoth H1 and ZEUS have observed beauty production in photoproduction;\nH1 has also published a cross section in DIS. The identification of the b signal\nis based on the use of high-transverse-momentum leptons for ZEUS; H1 also use\ntracks with large impact parameter as measured in their silicon vertex detector.\nThe results as a function of Q2 are shown in Fig. 34. It can be seen that the QCD\npredictions are substantially below the data for all Q2 , thus joining a pattern\nalso seen in proton-antiproton and photon-photon collisions. The tendency for\npQCD to fail to predict B cross sections, which naively would be thought to be\nan area in which it should work well, is becoming increasingly interesting. The\nadvent of HERA II will make an enormous difference to the precision of this type\nof measurement and should allow a stringent test of the theory of heavy-quark\nproduction.\n\n8\n\nHigh-Q2 phenomena\n\nHERA provides an unique opportunity to study the electroweak interaction at\nQ2 sufficiently high that the charged and neutral currents are of similar strength.\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\f41\n\nH1\n\nZEUS\n\n10\n\ndσ/dQ2(pb/GeV2)\n\nDVCS (FFS)\nDVCS (DD)\n\nW = 75 GeV\n2\n| t | < 1 GeV\n\n∗\n\nσ γ p→ γ p [nb]\n\nEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n10\n\n1\n10\n\n-1\n\n-2\n\nZEUS (prel.) 96-97 e+p\nGenDVCS (FFS)\n(elastic only)\n\n-1\n\n10\n\n10\n\n0\n\n5\n\nQ\n\n10\n\n15\n\n2\n\n[ GeV ]\n\n-3\n\nγ\nET\n\n20\n\n> 3 GeV\n\n-0.6 < ηγ < 1\n\n2\n\n40 GeV < W < 140 GeV\n10\n\n-4\n\n10\n2\n\n10\n2\n\n2\n\nQ (GeV )\n\nFig. 32. a) The cross section for deeply virtual Compton scattering as a function\nof Q2 as measured by the H1 collaboration. The dotted area corresponds to\nthe prediction of Frankfurt, Freund and Strikman, while the solid area is the\nprediction of Donnachie and Dosch. b) The DVCS cross section as measured\nby ZEUS. The curve shows the prediction for the elastic process by Frankfurt,\nFreund and Strikman.\nFigure 35 shows the differential cross-sections for the charged and neutral currents as a function of Q2 from H1 and ZEUS. It can be seen that, for e− p\ninteractions, these two processes become of equal strength at Q2 ∼ MZ2 ∼ 104\nGeV2 . For e+ p interactions, the charged current cross-section approaches the\nneutral current cross-section, but remains below it. The features of this plot can\nbe explained by inspection of Eq. 26, together with Eqs. 50 and 51 below:\n\u0012\n\u00132\nCC\n2\nG2F\nMW\nd2 σ\n=\n*\n2\ndxdQ2 e−\n2π MW\n+ Q2\n2x{u(x) + c(x) + (1 − y)2 (d(x) + s(x))}\n(50)\nCC\n\nd2 σ\ndxdQ2 e+\n\n=\n\nG2F\n2π\n\n\u0012\n\n2\nMW\n2\nMW\n+ Q2\n\n\u00132\n\n*\n\n2x{u(x) + c(x) + (1 − y)2 (d(x) + s(x))}\n\n(51)\n\nFor the charged current case, the smaller size of the e+ p cross-section compared to e− p is related to the fact that, at high Q2 , Eq. 3 implies that both\nx, y → 1. There are two main contributory factors to the cross-section difference\nthat flow from this. First, there are twice as many u valence quarks inside the\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fCombinations / 5 MeV\n\nEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n42\n\n350\n\nZEUS 1995-2000\n-1\nPreliminary 110 pb\n\n300\n250\n200\n150\n100\n\nBackgr. wrong charge\n\n50\n0\n\n2.2\n\n2.3\n\n2.4\n\n2.5\n\n2.6\n\n2.7\n\n2.8\n\n2.9\n\nM(Kππ sπ ) - M(K ππ s) + M(D*) (GeV)\n\nFig. 33. The D∗ π spectrum from ZEUS, where the D∗ decays via Dπ and the\nD via Kπ. To improve the accuracy of the reconstruction, the effective mass of\nthe Kπππ system minus the effective mass of the Kππ system that forms the\nD∗ plus the D∗ mass is plotted. The curves show a polynomial background plus\nGaussians for the known D10 resonance at 2.420 GeV and the D2∗ at 2.460 GeV.\nAnother structure at just above 2.4 GeV also seems to be visible.\nproton that can couple to W − as d quarks that can couple to W + . Secondly, the\n(1 − y)2 terms in Eqs. 50 and 51, which arise from the V − A helicity structure\nof the charged weak current, imply that the valence-quark contribution, which\nis dominant at high Q2 , is suppressed for the positron case but not for electrons.\nThe difference between the electron and positron neutral current cross sections shown in Eq. 26 allows the determination of the parity-violating structure\nfunction xF3 by taking the difference of the cross sections. The results [66] are\nshown in Fig. 36. Since its determination requires the subtraction of two quantities that are almost equal, it is dominated by statistical uncertainties, which\nare in turn dominated by the fact that the electron data sample that has so far\nbeen obtained at HERA is much smaller than that for positrons.\nThe high-Q2 regime is also interesting since possible new states from electronquark fusion (e.g. leptoquarks) have masses given by M 2 ∼ sx and since the\nsensitivity to the effects of new currents is maximised. An example of the sensitivity that can be obtained at HERA is shown in Fig. 37, which shows the mass\nagainst coupling limits for two varieties of scalar leptoquark. Both H1 and ZEUS\nhave comparable limits for a whole range of such states with differing quantum\nnumbers. It can be seen from Fig. 37, and it is generally the case, that for some\nstates, in particular in R-parity-violating supersymmetry models or leptoquarks,\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\nσ\n\nData / Theory\n\nvis\n\n6\n5\n\n43\n\n(ep → b X)\n\nH1 μ pTrel\nH1 μ impact param. (prel.)\n-\n\nZEUS e pTrel\n\n4\n3\n2\n\nNLO QCD\n\n1\n0\n\n| {z }\n\nQ2 < 1 GeV2\n\n∫∫\n\n1\n\n10\n\n10\n\n2\n\n2\n\n2\n\nQ (GeV )\n\nFig. 34. The ratio of the measured cross section and the theoretical prediction,\nplotted against Q2 , from H1 on beauty production in photoproduction and DIS\nand from ZEUS in photoproduction,. The band shows the uncertainty on the\npredictions of perturbative QCD.\nHERA has higher sensitivity than either LEP or the Tevatron.\nLimits on excited leptons and quarks have also been obtained by ZEUS and\nH1, which extend the limits from the LEP experiments considerably beyond the\nLEP II centre-of-mass energy.\nAs well as stringent limits on new phenomena, the HERA data also show\nintriguing features which may be signatures for new physics. The H1 collaboration has observed a class of events that have isolated charged leptons with\nlarge missing transverse momentum. Figure 38 shows the distribution of the\ntransverse momentum of the hadronic system, pX\nT , against its transverse mass,\nseparately for electrons (or positrons) and muons in such events. Also shown are\nthe expectations from the Standard Model background, which is dominated by\nsingle W production.\nIt can be seen that the distribution of the events is rather different to\nthe Standard Model expectation. Furthermore, for the transverse mass of the\nhadronic system greater than 25 GeV, H1 sees four electron and six muon events,\ncompared to Standard Model expectations of 1.3 and 1.5 events, respectively.\nUnfortunately, this exciting observation is not confirmed by ZEUS, which, for\nthe same cut in pX\nT , sees one event in each category compared to the Standard\nModel expectation of 1.1 and 1.3, respectively. Intensive discussions between the\ntwo experiments have not revealed any reason why H1 might artificially produce\nsuch an excess nor why ZEUS should not observe it. It would therefore seem that\nthere must be an unlikely fluctuation: either the H1 observation is an upward\nfluctuation from the Standard Model, or ZEUS has suffered a downward fluctu-\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\f44\n\n2\n\ndσ/dQ (pb/GeV )\n\nEPJdirect A1, 1–11 (2018) Springer-Verlag\n\nH1 e+p NC 94-00 prelim.\nH1 e p NC\nZEUS e+p NC 99-00 prelim.\nZEUS e-p NC 98-99 prelim.\n+\nSM e p NC (CTEQ5D)\nSM e p NC (CTEQ5D)\n\n2\n\n10\n1\n10\n10\n10\n10\n10\n10\n10\n\n-1\n\n-2\n\n-3\n\n-4\n\n-5\n\n-6\n\n-7\n\nH1 e+p CC 94-00 prelim.\nH1 e p CC\nZEUS e+p CC 99-00 prelim.\nZEUS e-p CC 98-99 prelim.\nSM e+p CC (CTEQ5D)\nSM e p CC (CTEQ5D)\ny < 0.9\n\n10\n\n3\n\n10\n\n4\n2\n\n2\n\nQ (GeV )\n\nFig. 35. Charged and neutral current differential cross sections for e± scattering\nas a function of Q2 from H1 and ZEUS.\nation from a signal for new physics. More data from HERA II will be required\nto resolve this puzzle.\nOne possible source of an excess of events with isolated leptons with missing\ntransverse momentum would be from a flavour-changing neutral current process\nproducing single top quarks. Both H1 and ZEUS have used the samples described\nabove to put limits on the FCNC couplings of the γ to light quark-top quark\nvertices. The results are shown in Fig. 39. Also shown are the limits from LEP\nand CDF, which are complementary to those from HERA, in the sense that,\nsince the Z-exchange cross section at HERA is so much smaller than that for γ\nexchange, the HERA data limit only the photon coupling.\n\n9\n\nHERA II physics\n\nSince many of the physics results discussed above, particularly those at high Q2 ,\nare statistics limited, there is a clear physics case for a significant increase in\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\f∼\n\nxF3\n\nEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n0.4\n\n45\n\nQ2=1500 GeV2\n\nQ2=3000 GeV2\nH1\nZEUS prel.\n\n0.2\n\nH1 97 PDF Fit\n\n∼\n\nxF3\n\n0\n0.4\n\nQ2=5000 GeV2\n\nQ2=8000 GeV2\n\nQ2=12000 GeV2\n\nQ2=30000 GeV2\n\n0.2\n\n∼\n\nxF3\n\n0\n0.4\n0.2\n0\n10\n\n-1\n\nx\n\n10\n\n-1\n\nx\n\nFig. 36. The xF3 structure function as determined by H1 and ZEUS as a function\nof x in six bins of Q2 .\nintegrated luminosity for H1 and ZEUS. There are also other interesting physics\ninvestigations possible at HERA that have not yet been carried out. For example, there is a natural build-up of transverse polarisation of the lepton beam in\nHERA that occurs through the Sokholov-Ternov effect [67]. As very successfully\ndemonstrated at HERMES using gas targets, this transverse polarisation can be\nrotated into the longitudinal direction and utilised to do physics. The installation\nof spin rotators in H1 and ZEUS would allow polarisation studies to be carried\nout at very much higher Q2 . This is particularly interesting to study the chiral\nproperties of the electroweak interaction. For these and several other reasons, it\nwas decided to embark on a major upgrade of both the HERA accelerator and\nthe H1 and ZEUS detectors. The aim of the HERA II programme is to produce\na factor of approximately five increase in luminosity and accumulate 1 fb−1 of\ndata with both electron and positron collisions in both longitudinal polarisation\nstates.\nThe changes to the HERA accelerator include the replacement of 480 meters\nof the vacuum system and the design and installation of almost 80 magnets in\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n46\n\nλ\n\nConstraints on Scalar Leptoquarks\n1\n\n-1\n\n10\n\nF = 0, LQ → e q\n~\n( S 1 / 2, L )\n\n-2\n\nλ\n\n10\n\nZEUS\nlimit\n+\n(e p, Prelim.)\nLEP indir. limit\nTEVATRON limit\n\n175 200 225 250 275 300 325 350 375 400\n1\n\n-1\n\n10\n\nH1 CI\n\nF = 2, LQ → e q , ν q\n( S 0, L )\n\n-2\n\n10\n\nH1– limit\n(e p, Prelim.)\nH1 limit\n+\n(e p, 94 - 97 )\n\n175 200 225 250 275 300 325 350 375 400\n\nM LQ (GeV)\n\nFig. 37. Limits on coupling strength λ versus mass MLQ for leptoquarks. The\ntop plot shows limits for fermion number = 0 leptoquarks decaying into the eq\nfinal state from ZEUS. The lower plot shows limits from H1 for fermion number\n= 2 leptoquarks decaying into both eq and νq final states. Also shown are limits\nobtained from the Tevatron (yellow shaded area) and LEP (blue striped area).\nThese leptoquark species have identical quantum numbers to squarks that violate\nR-parity.\nthe region around the H1 and ZEUS interaction points. In particular, superconducting quadrupole focussing elements were inserted inside both detectors to\nreduce the beam emittance and spin rotators were installed on either side of the\nH1 and ZEUS interaction regions.\nBoth the ZEUS and H1 detectors have undergone a massive programme\nof consolidation and repair work, as well as major detector upgrades. As an\nexample, I discuss briefly the changes made to ZEUS; the general thrust of the\nupgrade is similar in the two detectors, although the details are different.\n9.1\n\nUpgrades to ZEUS for HERA II\n\nThe ZEUS upgrades have concentrated in three main areas: the vertex region;\nthe forward direction; and the luminosity monitoring.\n9.1.1 The vertex region The tagging of the large flux of heavy quarks\n(charm and beauty) produced at HERA II can be greatly enhanced by the installation of a high-precision charged-particle detector as close as possible to a\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n47\n\n-1 +\n\nH1 PRELIMINARY 101.6pb e p data 94-00\nLMC=500*LDATA\n\n80\n\nP T(GeV)\n\nP T(GeV)\n\n80\n\nH1\n\nb)\n\nX\n\nX\n\na)\n\n60\n\n60\n\n40\n\n40\n\n20\n\n20\n\n0\n10\n\n10\n\n2\n\neν\nMT (GeV)\n\n0\n10\n\n10\n\n2\n\nμν\nM T (GeV)\n\nFig. 38. Distribution of transverse mass versus the pT of the hadronic system\nfor H1 events containing a) isolated electrons and b) isolated muons. The dots\nshow the distribution of Standard Model W Monte Carlo events corresponding\nto a luminosity 500 times that of the data.\nthin beampipe. The ZEUS MVD [68, 69] consists of 20 μm pitch n-type siliconstrip detectors with p+ -type implants. The readout pitch is 120 μm, leading to\nmore than 200,000 readout channels, which are digitised by a custom-built clock,\ncontrol and ADC system. The detectors are organised in two main groups: a \"barrel\", which surrounds the elliptical 2 mm-thick (∼ 1.1% of a radiation length)\naluminium-beryllium beam-pipe; and four \"wheels\", consisting of wedge-shaped\ndetectors mounted perpendicular to the beam-line in the forward direction from\nthe interaction point. Figure 40 shows one half of the MVD before installation\nat DESY. In the barrel region, the ladders, each of which consists of five silicon\ndetectors, and halves of the four forward \"wheels\", can be seen, as can the dense\narray of readout and services cables and the cooling system. The complete MVD\nwas installed in ZEUS in April 2001 and has been fully integrated with the ZEUS\nDAQ system; both cosmic-ray and beam-related data have been taken.\nThe physics programme addressed by the MVD is that of the flavour decomposition of the proton and photon and the search for physics beyond the Standard\nModel. The large increase in luminosity of HERA II, together with the ability to\ntag heavy-quark decays in the MVD, should greatly improve the measurement of\nF2c discussed in Section 4.4. After about 500 pb−1 , an uncertainty of around the\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fvZ\n\nEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n1\n\n48\n\nZEUS Preliminary κtuγ\nH1 Preliminary κtuγ\n\n⇒\n\n0.8\n\n⇒\n\nExcluded by CDF\n0.6\n\n0.4\n\nLEP Preliminary\n\n0.2\n\nmt = 174 GeV\n\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nκγ\n\nFig. 39. Limits on flavour-changing neutral current coupling strength for single\ntop production. Limits from H1 and ZEUS are plotted on the two-dimensional\nspace of the photon and Z coupling strengths. Also shown are similar limits from\nthe combined LEP experiments (to the right of the shaded curve) and from CDF\n(to the right of the black shaded lines).\n2% currently measured on F2 should be obtained. In addition, b-quark production can be measured precisely; a Monte Carlo simulation [70] of a measurement\nof F2b /F2c after 500 pb−1 is shown in Fig. 41.\nIt should also be possible, from a combination of neutral and charged current\nmeasurements, to separate out the u, d, s, c, b and g contribution to F2 .\n9.1.2 Charged-particle tracking in the forward direction The higher\nluminosity expected at HERA II will increase the number of very high-Q2 events\nin which the electron or positron is scattered into the forward direction. It will\nalso give access to rare processes, including possible physics beyond the Standard\nModel, which tend to have forward jets and/or leptons. The pattern-recognition\ncapabilities of the ZEUS Forward Tracker have therefore been improved by the\nreplacement of two layers of transition-radiation detector by layers of straw\ntubes. The straws are approximately 7.5 mm in diameter and range in length\nfrom around 20 cm to just over 1 m. They are constructed from two layers of 50\nμm kapton foil coated with a 0.2 μm layer of aluminium, surrounding a 50 μm\nwire at the centre. The straws are arranged in wedges consisting of three layers rotated with respect to each other to give three-dimensional reconstruction.\nEach of the two \"supermodules\" consists of four layers of such wedges.\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n49\n\nFig. 40. A photograph of one half of the MVD, showing the barrel ladders, one\nhalf of each of the four forward wheels and the cables and services.\n9.1.3 Luminosity monitor The measurement of luminosity at HERA II\nmust cope with the greatly increased synchrotron-radiation background and the\nhigher probability for multiple bremsstrahlung photons in one beam crossing. To\ncompensate for this, two devices, with very different systematic uncertainties,\nhave been constructed. Both devices use the information from a small calorimeter placed around 6 m from the interaction point which detects the radiating\nelectron. It is hoped that the reduction of systematic error that can be obtained\nfrom independent luminosity measurements using very different techniques will\nallow a precision of around 1% to be attained.\n9.2\n\nPolarisation\n\nPolarisations of around 65% have been achieved at HERA I. It is hoped to\nincrease the accuracy with which the polarisation can be measured to δP/P ∼\n2% per bunch per minute. This will be achieved by a collaboration between\nH1, HERMES, ZEUS and the HERA machine in the POL2000 project. The\ncollaboration has constructed two instruments, one to measure the longitudinal\npolarisation and the other to measure the transverse polarisation. Both detect\nasymmetries in back-scattered light from high-intensity polarised lasers.\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n50\n\nFig. 41. The MC prediction for the ratio of the contribution to F2 of b-quark\nto c-quark production in Q2 bins as a function of x after 500 pb−1 of data at\nHERA II.\nThe combination of high-precision measurements of both luminosity and polarisation will be important in a wide range of HERA II physics, particularly in\nthe electroweak sector. The charged current cross section should vanish for the\nappropriate combinations of lepton charge and polarisation. A measurement at\nthree polarisations, such as shown in Fig. 42, even with an integrated luminosity\nof only 50 pb−1 per point, will provide an accurate test of this prediction and\nthereby give sensitivity to possible new currents outside the Standard Model.\nStrong polarisation effects are also predicted at high Q2 in neutral current\ninteractions, where, e.g. at Q2 = 104 GeV2 and x = 0.2, there is a factor of\ntwo difference between the predicted cross sections for left- and right-handed\nelectrons.\nIn addition to the use of precise luminosity and polarisation information in\nthe study of electroweak processes, polarisation also offers an invaluable tool in\nthe study of possible signals beyond the Standard Model. Varying the polarisation to reduce the cross sections of Standard Model processes can improve the\nsignal to background for new physics signals, such as leptoquarks or supersymmetric particles that violate R parity, for which HERA will be competitive with\nthe Tevatron for the next few years.\n\n10\n\nSummary\n\nWe have seen that the study of deep inelastic scattering has been seminal in\nthe development of our current understanding of particle physics. In the last\ndecade, HERA I has changed our perception of QCD out of all recognition.\nIn many cases the precision of the data mandate NNL, or even high order,\nQCD predictions. The study of diffraction and the transition region between\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n51\n\n2\n\nσTOT (Q > 200 GeV ) (pb)\n\nZEUS CC Cross Sections\n120\n\n100\n-\n\n-1\n\n2\n\ne p Data (Prelim. 16 pb )\ne p SM √s=320 GeV\n-\n\nCC\n\n-\n\ne p SM (MC)\n80\n\n√s=320 GeV (50 pb )\n-1\n\n60\n+\n\n-1\n\ne p Data (48 pb )\ne p SM √s=300 GeV\n+\n+\n\ne p SM (MC)\n\n40\n\n√s=300 GeV (50 pb )\n-1\n\n20\n\n0\n\n-1\n\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nP\n\nFig. 42. The cross section for charged current interactions. The points at P =\n0 are obtained from ZEUS preliminary results at the indicated centre-of-mass\nenergies, while those at non-zero polarisation are Monte Carlo simulations of the\nexpected accuracy in ZEUS assuming the Standard Model cross section for an\nintegrated luminosity of 50 pb−1 per point.\nsoft and hard physics may be the beginning of the era of quantitative study\nof the central problem of the strong interaction, confinement. The significant\nincrease in expected luminosity and the use of new tools such as polarisation\npromise that HERA II physics should continue to provide both new results and\nsurprises in the years to come.\n\nAcknowledgements\nI am grateful to George Zoupanos and his colleagues for organising a most stimulating summer school in beautiful surroundings and with outstanding hospitality.\n\nReferences\n1.\n2.\n3.\n4.\n\nSee for example R.E. Taylor, Phil. Trans. R. Soc. Lond. A 359 (2001) 225\nE. Rutherford, Phil. Mag. 21 (1911) 669\nH. Geiger and E. Marsden, Proc. Roy. Soc. Lond. 82 (1909) 495\nF. Halzen and A.D. Martin, Quarks and leptons, John Wiley & sons, New York\n(1984)\n5. J.D. Bjorken and E.A. Paschos, Phys. Rev. 165 (1969) 1975\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n52\n\n6. C.G. Callan and D. Gross, Phys. Rev. Lett. 22 (1969) 156\n7. See for example J.I. Friedman and H.W. Kendall, Ann. Rev. Nucl. Science 22\n(1972) 203\n8. G. Altarelli, R.K. Ellis and G. Martinelli, Nucl. Phys. B 143 (1978) 521 and Nucl.\nPhys. B 146 (1978) 544 (erratum)\n9. H1 Collaboration, C. Adloff et al., Eur. Phys. J. C 13 (2000) 609\n10. H1 Collaboration, C. Adloff et al., Eur. Phys. J. C 21 (2001) 33\n11. ZEUS Collaboration, S. Chekanov et al., Eur. Phys. J. C 21 (2001) 443\n12. Particle Data Group, D.E. Groom et al., Eur. Phys. J. C 15 (2000) 1\n13. S. Bethke, J. Phys. G. 26 (2000) R27\n14. ZEUS Collaboration, J. Breitweg et al., Eur. Phys. J. C 12 (2000) 35\n15. H1 Collaboration, C. Adloff et al., Phys. Lett. B 528 (2002) 199\n16. L.W. Whitlow et al., Phys. Lett. B 282 (1992) 475\n17. NMS Collaboration, M. Arneodo et al., Nucl. Phys. B 483 (1997) 3\n18. BCDMS Collaboration, A.C. Benvenuti et al., Phys. Lett. B 223 (1989) 485\n19. BCDMS Collaboration, A.C. Benvenuti et al., Phys. Lett. B 237 (1990) 592\n20. ZEUS Collaboration, J. Breitweg et al., Phys. Lett. B 481 (2000) 213\n21. L.N. Lipatov, Sov. J. Nucl. Phys. 20 (1975) 95\n22. V.N. Gribov and L.N. Lipatov, Sov. J. Nucl. Phys. 15 (1972) 438\n23. G. Altarelli and G. Parisi, Nucl. Phys. B 126 (1977) 298\n24. Yu.L. Dokshitzer, Sov. Phys. JETP 46 (1977) 641\n25. R.K. Ellis, W.J. Stirling and B.R. Webber, QCD and Collider Physics, Cambridge Monographs on Particle Physics, Nuclear Physics and Cosmology, Volume\n8, Cambridge University Press, Cambridge (1996)\n26. E.A. Kuraev, L.N. Lipatov and V.S. Fadin, Phys. Lett. B 60 (1975) 50\n27. E.A. Kuraev, L.N. Lipatov and V.S. Fadin, Sov. Phys. JETP 44 (1976) 433\n28. E.A. Kuraev, L.N. Lipatov and V.S. Fadin, Sov. Phys. JETP 45 (1977) 199\n29. Ya.Ya. Balitsky and L.N. Lipatov, Sov. J. Nucl. Phys. 28 (1978) 822\n30. M. Ciafaloni, Nucl. Phys. B 296 (1988) 49\n31. S. Catani, F. Fiorani and G. Marchesini, Phys. Lett. B 234 (1990) 339\n32. S. Catani, F. Fiorani and G. Marchesini, Nucl. Phys. B 336 (1990) 18\n33. L.V. Gribov, E.M. Levin and M.G. Ryskin, Phys. Rep. 100 (1983) 1\n34. A.H. Mueller and J. Qiu, Nucl. Phys. B 268 (1986) 427\n35. A. Quadt, Measurement and QCD Analysis of the Proton Structure Function F2\nfrom the 1994 HERA Data using the ZEUS Detector, Ph.D. thesis, University of\nOxford, 1997, RAL-TH-97-004\n36. E. Levin, in Proceedings of the Ringberg Workshop, 'New Trends in HERA\nPhysics', May 1999, hep-ph/9908379\n37. M.G. Ryskin and E.M. Levin, Phys. Rep. 189 (1990) 267\n38. B. Foster, Phil. Trans. R. Soc. Lond. A 359 (2001) 325, and references therein\n39. H.L. Lai et al., Eur. Phys. J. C 12 (2000) 375\n40. A.D. Martin et al., Eur. Phys. J. C 23 (2002) 73\n41. U.K. Yang and A. Bodek, Eur. Phys. J. C 13 (2000) 241\n42. M. Botje, Eur. Phys. J. C 14 (2000) 285\n43. CTEQ Collaboration, J. Pumplin et al., hep-ph/0201195\n44. H1 Collaboration, C. Adloff et al., Eur. Phys. J. C 21 (2001) 33\n45. ZEUS Collaboration, S. Chekanov et al., to be submitted to Phys. Rev. D\n46. S.A. Larin et al., Nucl. Phys. B 492 (1997) 338\n47. W.L. van Neerven and A. Vogt, Nucl. Phys. B 568 (2000) 263\n48. W.L. van Neerven and A. Vogt, Nucl. Phys. B 588 (2000) 345\n49. A.D. Martin et al., Eur. Phys. J. C 18 (2000) 117\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\fEPJdirect A1, 1–11 (2018) Springer-Verlag\n\n53\n\n50. R.S. Thorne, Phys. Lett. B 474 (2000) 373\n51. R.S. Thorne, in Proceedings of Eight International Workshop on Deep Inelastic\nScattering, DIS 2000, J.A. Gracey & T. Greenshaw (eds.), World Scientific, Singapore (2000), p. 174\n52. K. Golec-Biernat and M. Wüsthoff, Phys. Rev. D 59 (1999) 014017\n53. K. Golec-Biernat and M. Wüsthoff, Phys. Rev. D 60 (1999) 114023\n54. ZEUS Collaboration, S. Chekanov et al., hep-ex/0203039, submitted to Eur. Phys.\nJ. C.\n55. ZEUS Collaboration, M. Derrick et al., Z. Phys. C 73 (1997) 253\n56. J. Bartels et al., Eur. Phys. J. C 7 (1999) 443\n57. ZEUS Collaboration, S. Chekanov et al., paper submitted to the International\nEurophysics Conference on High Energy Physics, Budapest, July 2001, Addendum\nto Abstract 548\n58. L. Frankfurt, W. Koepf and M. Strikman, Phys. Rev D 57 (1998) 512\n59. A.D. Martin, M.G. Ryskin and T. Teubner, Phys. Rev. D 62 (2000) 14022\n60. J. Forshaw and G. Poludniowski, hep-ph/0107068\n61. P.R.B. Saull, talk at International Europhysics Conference on High Energy Physics,\nTampere, July 1999\n62. H1 Collaboration, C. Adloff et al., Phys. Lett. B 517 (2001) 47\n63. L. Frankfurt, A. Freund and M. Strikman Phys. Rev. D 58 (1998) 114001 and\nerratum, Phys. Rev. D 59 (1999) 119901E\n64. A. Donnachie and H.G. Dosch, Phys. Lett. B 502 (2001) 74\n65. L. Frankfurt, M. McDermott and M. Strikman, J. High Energy Phys. 103 (2001) 45\n66. H1 Collaboration, C. Adloff et al., Eur. Phys. J. C19 (2001) 269\n67. A.A. Sokholov and M. Ternov, Sov. Phys. Dokl. 8 (1964) 1203\n68. A. Garfagnini, Nucl. Instr. and Meth. A435 (1999) 34\n69. E. Koffeman, Nucl. Instr. and Meth. A473 (2001) 26\n70. K. Daum et al., in Proceedings of the Workshop on Future Physics at HERA, ed.\nA. De Roeck, G. Ingleman and R. Klanner, Vol. 1, p. 89, DESY, Hamburg, (1996).\n\nhttp://link.springer.de/link/service/journals/10105/index.html\n\n\f"}