{"id": "http://arxiv.org/abs/hep-ph/0509119v2", "guidislink": true, "updated": "2006-01-11T23:22:02Z", "updated_parsed": [2006, 1, 11, 23, 22, 2, 2, 11, 0], "published": "2005-09-13T17:02:02Z", "published_parsed": [2005, 9, 13, 17, 2, 2, 1, 256, 0], "title": "Precise Calculation of the Relic Density of Kaluza-Klein Dark Matter in\n  Universal Extra Dimensions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0509147%2Chep-ph%2F0509280%2Chep-ph%2F0509155%2Chep-ph%2F0509026%2Chep-ph%2F0509055%2Chep-ph%2F0509278%2Chep-ph%2F0509345%2Chep-ph%2F0509254%2Chep-ph%2F0509330%2Chep-ph%2F0509199%2Chep-ph%2F0509052%2Chep-ph%2F0509251%2Chep-ph%2F0509170%2Chep-ph%2F0509223%2Chep-ph%2F0509184%2Chep-ph%2F0509169%2Chep-ph%2F0509193%2Chep-ph%2F0509041%2Chep-ph%2F0509230%2Chep-ph%2F0509210%2Chep-ph%2F0509239%2Chep-ph%2F0509209%2Chep-ph%2F0509057%2Chep-ph%2F0509367%2Chep-ph%2F0509012%2Chep-ph%2F0509056%2Chep-ph%2F0509247%2Chep-ph%2F0509141%2Chep-ph%2F0509031%2Chep-ph%2F0509187%2Chep-ph%2F0509202%2Chep-ph%2F0509276%2Chep-ph%2F0509252%2Chep-ph%2F0509261%2Chep-ph%2F0509034%2Chep-ph%2F0509159%2Chep-ph%2F0509272%2Chep-ph%2F0509154%2Chep-ph%2F0509146%2Chep-ph%2F0509051%2Chep-ph%2F0509119%2Chep-ph%2F0509110%2Chep-ph%2F0509042%2Chep-ph%2F0509363%2Chep-ph%2F0509068%2Chep-ph%2F0509221%2Chep-ph%2F0509201%2Chep-ph%2F0509317%2Chep-ph%2F0509118%2Chep-ph%2F0509028%2Chep-ph%2F0509089%2Chep-ph%2F0509061%2Chep-ph%2F0509029%2Chep-ph%2F0509192%2Chep-ph%2F0509297%2Chep-ph%2F0509360%2Chep-ph%2F0509006%2Chep-ph%2F0509291%2Chep-ph%2F0509282%2Chep-ph%2F0509066%2Chep-ph%2F0509321%2Chep-ph%2F0509072%2Chep-ph%2F0509185%2Chep-ph%2F0509289%2Chep-ph%2F0509019%2Chep-ph%2F0509319%2Chep-ph%2F0509131%2Chep-ph%2F0509194%2Chep-ph%2F0509337%2Chep-ph%2F0509306%2Chep-ph%2F0509181%2Chep-ph%2F0509129%2Chep-ph%2F0509207%2Chep-ph%2F0509132%2Chep-ph%2F0509021%2Chep-ph%2F0509218%2Chep-ph%2F0509099%2Chep-ph%2F0509256%2Chep-ph%2F0509219%2Chep-ph%2F0509115%2Chep-ph%2F0509190%2Chep-ph%2F0509271%2Chep-ph%2F0509032%2Chep-ph%2F0509361%2Chep-ph%2F0509341%2Chep-ph%2F0509177%2Chep-ph%2F0509364%2Chep-ph%2F0509180%2Chep-ph%2F0509196%2Chep-ph%2F0509080%2Chep-ph%2F0509294%2Chep-ph%2F0509069%2Chep-ph%2F0509024%2Chep-ph%2F0509135%2Chep-ph%2F0509285%2Chep-ph%2F0509077%2Chep-ph%2F0509354%2Chep-ph%2F0509310%2Chep-ph%2F0509283%2Chep-ph%2F0509246%2Chep-ph%2F0509035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Precise Calculation of the Relic Density of Kaluza-Klein Dark Matter in\n  Universal Extra Dimensions"}, "summary": "We revisit the calculation of the relic density of the lightest Kaluza-Klein\nparticle (LKP) in the model of Universal Extra Dimensions. The Kaluza-Klein\n(KK) particle spectrum at level one is rather degenerate, and various\ncoannihilation processes may be relevant. We extend the calculation of\nhep-ph/0206071 to include coannihilation processes with all level one KK\nparticles. In our computation we consider a most general KK particle spectrum,\nwithout any simplifying assumptions. In particular, we do not assume a\ncompletely degenerate KK spectrum and instead retain the dependence on each\nindividual KK mass. As an application of our results, we calculate the\nKaluza-Klein relic density in the Minimal UED model, turning on coannihilations\nwith all level one KK particles. We then go beyond the minimal model and\ndiscuss the size of the coannihilation effects separately for each class of\nlevel 1 KK particles. Our results provide the basis for consistent relic\ndensity computations in arbitrarily general models with Universal Extra\nDimenions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0509147%2Chep-ph%2F0509280%2Chep-ph%2F0509155%2Chep-ph%2F0509026%2Chep-ph%2F0509055%2Chep-ph%2F0509278%2Chep-ph%2F0509345%2Chep-ph%2F0509254%2Chep-ph%2F0509330%2Chep-ph%2F0509199%2Chep-ph%2F0509052%2Chep-ph%2F0509251%2Chep-ph%2F0509170%2Chep-ph%2F0509223%2Chep-ph%2F0509184%2Chep-ph%2F0509169%2Chep-ph%2F0509193%2Chep-ph%2F0509041%2Chep-ph%2F0509230%2Chep-ph%2F0509210%2Chep-ph%2F0509239%2Chep-ph%2F0509209%2Chep-ph%2F0509057%2Chep-ph%2F0509367%2Chep-ph%2F0509012%2Chep-ph%2F0509056%2Chep-ph%2F0509247%2Chep-ph%2F0509141%2Chep-ph%2F0509031%2Chep-ph%2F0509187%2Chep-ph%2F0509202%2Chep-ph%2F0509276%2Chep-ph%2F0509252%2Chep-ph%2F0509261%2Chep-ph%2F0509034%2Chep-ph%2F0509159%2Chep-ph%2F0509272%2Chep-ph%2F0509154%2Chep-ph%2F0509146%2Chep-ph%2F0509051%2Chep-ph%2F0509119%2Chep-ph%2F0509110%2Chep-ph%2F0509042%2Chep-ph%2F0509363%2Chep-ph%2F0509068%2Chep-ph%2F0509221%2Chep-ph%2F0509201%2Chep-ph%2F0509317%2Chep-ph%2F0509118%2Chep-ph%2F0509028%2Chep-ph%2F0509089%2Chep-ph%2F0509061%2Chep-ph%2F0509029%2Chep-ph%2F0509192%2Chep-ph%2F0509297%2Chep-ph%2F0509360%2Chep-ph%2F0509006%2Chep-ph%2F0509291%2Chep-ph%2F0509282%2Chep-ph%2F0509066%2Chep-ph%2F0509321%2Chep-ph%2F0509072%2Chep-ph%2F0509185%2Chep-ph%2F0509289%2Chep-ph%2F0509019%2Chep-ph%2F0509319%2Chep-ph%2F0509131%2Chep-ph%2F0509194%2Chep-ph%2F0509337%2Chep-ph%2F0509306%2Chep-ph%2F0509181%2Chep-ph%2F0509129%2Chep-ph%2F0509207%2Chep-ph%2F0509132%2Chep-ph%2F0509021%2Chep-ph%2F0509218%2Chep-ph%2F0509099%2Chep-ph%2F0509256%2Chep-ph%2F0509219%2Chep-ph%2F0509115%2Chep-ph%2F0509190%2Chep-ph%2F0509271%2Chep-ph%2F0509032%2Chep-ph%2F0509361%2Chep-ph%2F0509341%2Chep-ph%2F0509177%2Chep-ph%2F0509364%2Chep-ph%2F0509180%2Chep-ph%2F0509196%2Chep-ph%2F0509080%2Chep-ph%2F0509294%2Chep-ph%2F0509069%2Chep-ph%2F0509024%2Chep-ph%2F0509135%2Chep-ph%2F0509285%2Chep-ph%2F0509077%2Chep-ph%2F0509354%2Chep-ph%2F0509310%2Chep-ph%2F0509283%2Chep-ph%2F0509246%2Chep-ph%2F0509035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We revisit the calculation of the relic density of the lightest Kaluza-Klein\nparticle (LKP) in the model of Universal Extra Dimensions. The Kaluza-Klein\n(KK) particle spectrum at level one is rather degenerate, and various\ncoannihilation processes may be relevant. We extend the calculation of\nhep-ph/0206071 to include coannihilation processes with all level one KK\nparticles. In our computation we consider a most general KK particle spectrum,\nwithout any simplifying assumptions. In particular, we do not assume a\ncompletely degenerate KK spectrum and instead retain the dependence on each\nindividual KK mass. As an application of our results, we calculate the\nKaluza-Klein relic density in the Minimal UED model, turning on coannihilations\nwith all level one KK particles. We then go beyond the minimal model and\ndiscuss the size of the coannihilation effects separately for each class of\nlevel 1 KK particles. Our results provide the basis for consistent relic\ndensity computations in arbitrarily general models with Universal Extra\nDimenions."}, "authors": ["Kyoungchul Kong", "Konstantin T. Matchev"], "author_detail": {"name": "Konstantin T. Matchev"}, "author": "Konstantin T. Matchev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2006/01/038", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0509119v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0509119v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "44 pages, 19 figures, typeset in JHEP style", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0509119v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0509119v2", "journal_reference": "JHEP 0601:038,2006", "doi": "10.1088/1126-6708/2006/01/038", "fulltext": "arXiv:hep-ph/0509119v2 11 Jan 2006\n\nPreprint typeset in JHEP style - HYPER VERSION\n\nUFIFT-HEP-05-22\nSeptember 12, 2005\n\nPrecise Calculation of the Relic Density of\nKaluza-Klein Dark Matter in Universal Extra\nDimensions\n\nKyoungchul Kong, Konstantin T. Matchev\nPhysics Department, University of Florida, Gainesville, FL 32611, USA\nE-mail: kong@phys.ufl.edu, matchev@phys.ufl.edu\n\nAbstract: We revisit the calculation of the relic density of the lightest Kaluza-Klein\nparticle (LKP) in the model of Universal Extra Dimensions. The Kaluza-Klein (KK)\nparticle spectrum at level one is rather degenerate, and various coannihilation processes\nmay be relevant. We extend the calculation of hep-ph/0206071 to include coannihilation\nprocesses with all level one KK particles. In our computation we consider a most general\nKK particle spectrum, without any simplifying assumptions. In particular, we do not\nassume a completely degenerate KK spectrum and instead retain the dependence on each\nindividual KK mass. As an application of our results, we calculate the Kaluza-Klein relic\ndensity in the Minimal UED model, turning on coannihilations with all level one KK\nparticles. We then go beyond the minimal model and discuss the size of the coannihilation\neffects separately for each class of level 1 KK particles. Our results provide the basis for\nconsistent relic density computations in arbitrarily general models with Universal Extra\nDimenions.\nKeywords: Dark Matter, Cosmology of Theories beyond the SM, Field Theories in\nHigher Dimensions, Beyond Standard Model, Compactification and String Models.\n\n\fContents\n1. Introduction\n\n1\n\n2. Universal Extra Dimensions\n\n5\n\n3. The Basic Calculation of the Relic Density\n3.1 The standard case\n3.2 The case with coannihilations\n\n6\n6\n8\n\n4. Relic Density in Minimal UED\n\n9\n\n5. Relative Weight of Different Coannihilation Processes\n5.1 Effects due to coannihilations with KK leptons\n5.2 Effects due to coannihilations with KK quarks and KK gluons\n5.3 Effects due to coannihilations with electroweak KK bosons\n\n14\n14\n18\n19\n\n6. Summary and Conclusions\n\n19\n\nA. Annihilation Cross-Sections\nA.1 Leptons\nA.2 Gauge bosons\nA.3 Fermions and Gauge Bosons\nA.4 Quarks\nA.5 Quarks and Leptons\nA.6 Higgs Bosons\nA.7 Higgs Bosons and Gauge Bosons\nA.8 Higgs Bosons and Fermions\n\n22\n23\n26\n29\n30\n31\n32\n36\n38\n\n1. Introduction\nThe Standard Model (SM) of particle physics has been astonishingly successful in explaining\nmuch of the presently available experimental data. However, it still leaves open a number of\noutstanding fundamental questions whose answers are expected to emerge in a more general\ntheoretical framework which extends the SM at higher energy scales. The main motivation\nfor pushing the energy frontier beyond the Terascale comes from two main issues. The first\nis the question, what breaks the electroweak gauge symmetry, and if it is a Higgs field,\nwhy is the Higgs particle so light. The second is the dark matter problem, which has no\nexplanation within the SM. By now we have accumulated a wealth of astrophysical data\n\n–1–\n\n\fwhich all point to the existence of a dark, non-baryonic component of the matter in the\nUniverse. The most recent WMAP data confirm the standard cosmological model and pin\ndown the amount of cold dark matter1 as 0.094 < ΩCDM h2 < 0.129, which is consistent\nwith earlier indications, but much more precise. However, the microscopic nature of dark\nmatter is presently unknown, as all known particles are excluded as dark matter candidates.\nThis makes the dark matter problem the most pressing phenomenological motivation for\nparticles and interactions beyond the Standard Model.\nAmong the most attractive explanations of the dark matter problem is the \"WIMP\" hypothesis - that dark matter consists of stable, neutral, weakly interacting massive particles.\nIndeed, many theoretically motivated extensions of the Standard Model which attempt to\nresolve the gauge hierarchy problem in the electroweak sector, already contain particles\nwhich can be identified as WIMP dark matter candidates. A straightforward calculation\nof the WIMP thermal relic abundance, which we shall review in some detail in Section 3,\nreveals that WIMP particles with masses in the TeV range may provide most of the dark\nmatter.\nSupersymmetry (SUSY) and Extra Dimensions, which appear rather naturally in string\ntheory, are the leading candidate theories for physics beyond the SM. By now they are both\nknown to possess WIMP dark matter candidates. The collider and astroparticle signals\nof SUSY dark matter have been extensively studied [1, 2]. Recently, WIMPs from extra\ndimensional theories, have started to attract similar interest. A particularly appealing scenario is offered by the so called Universal Extra Dimensions (UED), originally proposed\nin [3], where all SM particles are allowed to freely propagate into the bulk of one or more\nextra dimensions. The case of UED bears interesting analogies to supersymmetry, and\nsometimes has been referred to as \"bosonic supersymmetry\" [4]. Many of the virtues of\nsupersymmetry remain valid in the UED framework. For example, the existence of a dark\nmatter candidate, the lightest Kaluza-Klein particle (LKP), is guaranteed by a discrete\nsymmetry, called KK-parity. KK-parity also eliminates dangerous tree-level contributions\nto electroweak precision observables, rendering the model viable for a large range of parameters below the TeV scale.\nThere are also some important differences between SUSY and UED. For example,\nthe mass spectrum of Kaluza-Klein particles is rather degenerate, even after radiative\ncorrections [5]. This means that the computation of the LKP relic density gets rather\ncomplicated, since there are many possible coannihilation processes with other particles in\nthe KK spectrum [6]. This situation should be contrasted with the case of supersymmetric\nmodels where typically the spectrum is widely spread2 , and barring fine-tuned coincidences,\nonly one or at most a few additional particles participate in coannihilation processes.\nA second important distinction between SUSY and UED is the presence of a KK tower\nin the case of extra dimensions. The KK masses roughly scale as n/R, where R is the size\n1\n\nFrom now on and throughout the paper we shall use Ω ≡ ΩCDM to denote the dark matter relic density.\nNotice that the recently proposed little Higgs models with T -parity [7–9] are reminiscent of UED, and\ntheir spectrum does not have to be degenerate, so they are four dimensional examples which bear analogies\nto both UED and SUSY.\n2\n\n–2–\n\n\fof the extra dimension, and n is the KK level. This has an important implication for the\nKK relic density calculation, since the n = 2 particles naturally have masses twice as large\nas the LKP mass, and resonant annihilation processes may become relevant [10, 11].\nA third important difference is encoded in the spins of the new particles. The superpartners have spins which differ by 1/2 unit from their SM counterparts, while the\nspins of the KK particles are the same as in the SM. This has important consequences for\nthe dark matter abundance as well. For example, the dark matter candidate in SUSY is\nusually the lightest neutralino, which is in general some mixture of a Bino, a Wino and\nHiggsinos (the superpartners of the hypercharge gauge boson, the neutral SU (2)W gauge\nboson, and the neutral Higgs bosons, respectively). The neutralino is a Majorana particle,\nand its annihilation to SM fermion final states is helicity suppressed. In contrast, the dark\nmatter candidate in UED is the KK mode of a Higgs or gauge boson, and its annihilation\ncross-sections have no anomalous suppressions. For example, in the Minimal UED model\n(MUED), which we review in more detail below in Section 2, the LKP is B1 , the KK partner of the hypercharge gauge boson, and is a spin one particle. The preferred mass range\nfor the LKP is therefore somewhat larger than in supersymmetry.\nThe first and only comprehensive calculation of the UED relic density to date was performed in [6]. The authors considered two cases of LKP: the KK hypercharge gauge boson\nB1 and the KK neutrino ν1 . The case of B1 LKP is naturally obtained in MUED, where the\nradiative corrections to B1 are the smallest in size, since they are only due to hypercharge\ninteractions. The authors of [6] also realized the importance of coannihilation processes\nand included in their analysis coannihilations with the SU (2)W -singlet KK leptons, which\nin MUED are the lightest among the remaining n = 1 KK particles. It was therefore\nexpected that their coannihilations will be most important. Subsequently, Refs. [10, 11]\nanalyzed the resonant enhancement of the n = 1 (co)annihilation cross-sections due to\nn = 2 KK particles.\nOur goal in this paper will be to complete the LKP relic density calculation of Ref. [6].\nWe will attempt to improve in three different aspects:\n• We will include coannihilation effects with all n = 1 KK particles. The motivation\nfor such a tour de force is twofold. First, recall that the importance of coannihilations\nis mostly determined by the degeneracy of the corresponding particle with the dark\nmatter candidate. In the Minimal UED model, the KK mass splittings are due almost\nentirely to radiative corrections. In MUED, therefore, one might expect that, since\nthe corrections to KK particles other than the KK leptons are relatively large, their\ncoannihilations can be safely neglected. However, the Minimal UED model makes\nan ansatz [5] about the cut-off scale values of the so called boundary terms, which\nare not fixed by known SM physics, and are in principle arbitrary. In this sense, the\nUED scenario should be considered as a low energy effective theory with a multitude\nof parameters, just like the MSSM, and the MUED model should be treated as\nnothing more than a simple toy model with a limited number of parameters, just like\nthe \"minimal supergravity\" version of supersymmetry, for example. If one makes a\n\n–3–\n\n\fdifferent assumption about the inputs at the cut-off scale, both the KK spectrum\nand its phenomenology can be modified significantly. In particular, one could then\neasily find regions of this more general parameter space where other coannihilation\nprocesses become active. On the other hand, even if we choose to restrict ourselves\nto MUED, there is still a good reason to consider the coannihilation processes which\nwere omitted in the analysis of [6]. While it is true that those coannihilations are more\nBoltzmann suppressed, their cross-sections will be larger, since they are mediated by\nweak and/or strong interactions. Without an explicit calculation, it is impossible to\nestimate the size of the net effect, and whether it is indeed negligible compared to\nthe purely hypercharge-mediated processes which have already been considered.\n• We will keep the exact value of each KK mass in our formulas for all annihilation\ncross-sections. This will render our analysis self-consistent. All calculations of the\nLKP relic density available so far [6, 10, 11], have computed the annihilation crosssections in the limit when all level 1 KK masses are the same. This approximation\nis somewhat contradictory in the sense that all KK masses at level one are taken to\nbe degenerate with LKP, yet only a limited number of coannihilation processes were\nconsidered. In reality, a completely degenerate spectrum would require the inclusion\nof all possible coannihilations. Conversely, if some coannihilation processes are being\nneglected, this is presumably because the masses of the corresponding KK particles\nare not degenerate with the LKP, and are Boltzmann suppressed. However, the\nmasses of these particles may still enter the formulas for the relevant coannihilation\ncross-sections, and using approximate values for those masses would lead to a certain\nerror in the final answer. Since we are keeping the exact mass dependence in the\nformulas, within our approach heavy particles naturally decouple, coannihilations\nare properly weighted, and all relevant coannihilation cross-sections behave properly.\nNotice that the assumption of exact mass degeneracy overestimates the corresponding\ncross-sections and therefore underestimates the relic density. This expectation will\nbe confirmed in our numerical analysis in Section 4.\n• We will try to improve the numerical accuracy of the analysis by taking into account\nsome minor corrections which were neglected or approximated in [6]. For example, we\nwill use a temperature-dependent g∗ (the total number of effectively massless degrees\nof freedom, given by eq. (3.6) below) and include subleading corrections (3.19) in the\nvelocity expansion of the annihilation cross-sections.\nThe availability of the calculation of the remaining coannihilation processes is important also for the following reason. Coannihilations with SU (2)W -singlet KK leptons were\nfound to reduce the effective annihilation cross-section, and therefore increase the LKP\nrelic density. This has the effect of lowering the range of cosmologically preferred values\nof the LKP mass, or equivalently, the scale of the extra dimension. However, one could\nexpect that coannihilations with the other n = 1 KK particles would have the opposite\neffect, since they have stronger interactions compared to the SU (2)W -singlet KK leptons\n\n–4–\n\n\fand the B1 LKP. As a result, the preferred LKP mass range could be pushed back up.\nFor both collider and astroparticle searches for dark matter, a crucial question is whether\nthere is an upper limit on the WIMP mass which could guarantee discovery, and if so,\nwhat is its precise numerical value. To this end, one needs to consider the effect of all\ncoannihilation processes which have the potential to enhance the LKP annihilations. We\nwill see that the lowering of the preferred LKP mass range in the case of coannihilations\nwith SU (2)W -singlet KK leptons is more of an exception rather than the rule, and the\ninclusion of all remaining processes is needed in order to derive an absolute upper bound\non the LKP mass.\nThe paper is organized as follows. In Section 2 we review the Minimal model of Universal Extra Dimensions (MUED). In Section 3.1 (3.2) we review the standard calculation\nof the WIMP relic density in the absence (presence) of coannihilations. Then in Section 4\nwe present our results for the LKP relic abundance in MUED. In Section 5 we extend\nour analysis beyond MUED and investigate the size of the coannihilation effects for each\nclass of KK particles at level 1. We summarize and conclude in Section 6. The Appendix\ncontains a list of our formulas for all relevant annihilation cross-sections, in the limit of\nequal masses. Those are given only for reference and contact with previous work [6, 12],\nsince in our numerical code we use the corresponding different values for the individual\nmasses.\n\n2. Universal Extra Dimensions\nThe simplest version of UED has all the SM particles propagating in a single extra dimension of size R, which is compactified on an S1 /Z2 orbifold. More complicated models\nhave also been considered, motivated by ideas about electroweak symmetry breaking and\nvacuum stability [13–15], neutrino masses [16,17], proton stability [18], the number of generations [19] or fermion chirality [20, 21]. A peculiar feature of UED is the conservation of\nKaluza-Klein number n at tree level, which is a simple consequence of momentum conservation along the extra dimension. However, bulk and brane radiative effects [5,22,23] break\nKK number down to a discrete conserved quantity, the so called KK parity, (−1)n . KK\nparity ensures that the lightest KK partners – those at level one – are always pair-produced\nin collider experiments, similar to the case of supersymmetry models with conserved Rparity. On the one hand, this leads to rather weak bounds on KK partner masses from\ndirect searches at colliders [3, 4]. On the other hand, the collider signatures of UED are\nvery similar to those of supersymmetry, and discriminating between the two scenarios at\nlepton [24–28] or hadron [29–36] colliders is currently an active field of study. KK parity\nconservation also implies that the contributions to various precisely measured low-energy\nobservables [37–47] only arise at loop level and are small. As a result, the limits on the\nscale of the extra dimension, from precision electro-weak data, are rather weak, constraining R−1 to be larger than approximately 250 GeV [41]. An attractive feature of UED is the\npresence of a stable massive particle which can be a cold dark matter candidate [5,6,48,50].\nThe lightest KK partner (LKP) at level one is also the lightest particle with negative KK\n\n–5–\n\n\fparity and is stable on cosmological scales. The identity of the LKP is a delicate issue,\nhowever, as it depends on the interplay between the one-loop radiative corrections to the\nKK mass spectrum and the brane terms generated by unknown physics at high scales [5].\nIn the Minimal UED model defined in [4], the LKP turns out to be the KK partner B1\nof the hypercharge gauge boson [5] and its relic density is typical of a WIMP candidate:\nin order to explain all of the dark matter, the B1 mass should be in the range 600 − 800\nGeV, depending on the rest of the KK spectrum [6, 10, 11, 49]. The experimental signals of\nKaluza-Klein dark matter have also been discussed and it has been realized that it offers\nexcellent prospects for direct [50–52] or indirect detection [50, 53–61].\nIn the Minimal UED model, the bulk interactions of the KK modes readily follow from\nthe SM Lagrangian and contain no unknown parameters other than the mass, mh , of the\nSM Higgs boson. In contrast, the boundary interactions, which are localized on the orbifold\nfixed points, are in principle arbitrary, and their coefficients represent new free parameters\nin the theory. Since the boundary terms are renormalized by bulk interactions, they are\nscale dependent [22] and cannot be completely ignored since they will be generated by\nrenormalization effects. Therefore, we need an ansatz for their values at a particular scale.\nAs with any higher dimensional Kaluza-Klein theory, the UED model should be treated\nonly as an effective theory which is valid up to some high scale Λ, at which it matches to\nsome more fundamental theory. The Minimal UED model therefore has only two input\nparameters: the size of the extra dimension, R, and the cutoff scale, Λ. The number of\nKK levels present in the effective theory is simply ΛR and may vary between a few and\n∼ 40, where the upper limit comes from the breakdown of perturbativity already below\nthe scale Λ. Unless specified otherwise, for our numerical results below, we shall always\nchoose the value of Λ so that ΛR = 20, although analyses of unitarity constraints in the\nhigher dimensional Standard Model typically yield a lower bound on Λ [62, 63]. Changing\nthe value of Λ will have very little impact on our results since the Λ dependence of the KK\nmass spectrum is only logarithmic. For the SM Higgs mass mh we shall adopt the value\nmh = 120 GeV.\n\n3. The Basic Calculation of the Relic Density\n3.1 The standard case\nWe first summarize the standard calculation for the relic abundance of a particle species\nχ which was in thermal equilibrium in the early universe and decoupled when it became\nnonrelativistic [6, 64, 65]. The relic abundance is found by solving the Boltzmann equation\nfor the evolution of the χ number density n\ndn\n= −3Hn − hσvi(n2 − n2eq ) ,\ndt\n\n(3.1)\n\nwhere H is the Hubble parameter, v is the relative velocity between two χ's, hσvi is the\nthermally averaged total annihilation cross-section times relative velocity, and neq is the\nequilibrium number density. At high temperature (T ≫ m), neq ∼ T 3 (there are roughly\n\n–6–\n\n\fas many χ particles as photons). At low temperature (T ≪ m), in the nonrelativistic\napproximation, neq can be written as\nneq = g\n\n\u0012\n\nmT\n2π\n\n\u00133\n2\n\ne−m/T ,\n\n(3.2)\n\nwhere m is the mass of the relic χ, T is the temperature and g is the number of internal\ndegrees of freedom of χ such as spin, color and so on. We see from eq. (3.2) that the density\nneq is Boltzmann-suppressed. At high temperature, χ particles are abundant and rapidly\nconvert to lighter particles and vice versa. But shortly after the temperature T drops below\nm, the number density decreases exponentially and the annihilation rate Γ = hσvin drops\nbelow the expansion rate H. At this point, χ's stop annihilating and escape out of the\nequilibrium and become thermal relics. hσvi is often approximated by the nonrelativistic\nexpansion3\n\u0012 \u0013\n1\n2\n4\n,\n(3.3)\nhσvi = a + bhv i + O(hv i) ≈ a + 6b/x + O\nx2\nwhere\nx=\n\nm\n.\nT\n\n(3.4)\n\nBy solving the Boltzmann equation analytically with appropriate approximations [6,64,65],\nthe abundance of χ is given by\nΩχ h2 ≈\n\n1\n1.04 × 109\nx\np F\n,\nMP l\ng∗ (xF ) a + 3b/xF\n\n(3.5)\n\nwhere the Planck mass MP l = 1.22 × 1019 GeV and g∗ is the total number of effectively\nmassless degrees of freedom,\ng∗ (T ) =\n\nX\n\ngi +\n\ni=bosons\n\n7\n8\n\nX\n\ngi .\n\n(3.6)\n\ni=f ermions\n\nThe freeze-out temperature, xF , is found iteratively from\nr\n\nxF = ln c(c + 2)\n\n45 g mMP l (a + 6b/xF )\np\n8 2π 3\ng∗ (xF )xF\n\n!\n\n,\n\n(3.7)\n\nwhere the constant c is determined empirically by comparing to numerical solutions of the\nBoltzmann equation and here we take c = 12 as usual. The coefficient 87 in the right hand\nside of (3.6) accounts for the difference in Fermi and Bose statistics. Notice that g∗ is\na function of the temperature T , as the thermal bath quickly gets depleted of the heavy\nspecies with masses larger than T .\n3\n\nNote, however, that the method fails near s-channel resonances and thresholds for new final states [66].\nIn the interesting parameter region of UED, we are always sufficiently far from thresholds, while for the\ntreatment of resonances, see [10, 11].\n\n–7–\n\n\f3.2 The case with coannihilations\nWhen the relic particle χ is nearly degenerate with other particles in the spectrum, its\nrelic abundance is determined not only by its own self-annihilation cross-section, but also\nby annihilation processes involving the heavier particles. The previous calculation can be\ngeneralized to this \"coannihilation\" case in a straightforward way [6, 65, 66]. Assume that\nthe particles χi are labeled according to their masses, so that mi < mj when i < j. The\nnumber densities ni of the various species χi obey a set of Boltzmann equations. It can be\nshown that under reasonable assumptions [66], the ultimate relic density n of the lightest\nspecies χ1 (after all heavier particles χi have decayed into it) obeys the following simple\nBoltzmann equation\ndn\n= −3Hn − hσef f vi(n2 − n2eq ) ,\n(3.8)\ndt\nwhere\nσef f (x) =\n\nN\nX\n\nσij\n\nij\n\ngef f (x) =\n\nN\nX\n\ngi gj\n3/2\n(1 + ∆j )3/2 exp(−x(∆i + ∆j )) ,\n2 (1 + ∆i )\ngef\nf\n\ngi (1 + ∆i )3/2 exp(−x∆i ) ,\n\n(3.9)\n\n(3.10)\n\ni=1\n\n∆i =\n\nmi − m1\n.\nm1\n\n(3.11)\n\nHere σij ≡ σ(χi χj → SM ), gi is the number of internal degrees of freedom of particle χi\nP\nand n = N\ni=1 ni is the density of χ1 we want to calculate. This Boltzmann equation can\nbe solved in a similar way [6, 66], resulting in\nΩχ h2 ≈\nwith\n\n1\nx\n1.04 × 109\np F\n,\nMP l\nI\n+\n3I\ng∗ (xF ) a\nb /xF\n\nIa = xF\nIb =\n\nZ\n\n2x2F\n\n∞\n\n(3.12)\n\naef f (x)x−2 dx ,\n\n(3.13)\n\nxF\n\nZ\n\n∞\n\nbef f (x)x−3 dx .\n\n(3.14)\n\nxF\n\nThe corresponding formula for xF becomes\nr\n\nxF = ln c(c + 2)\n\n45 gef f (xF ) mMP l (aef f (xF ) + 6bef f (xF )/xF )\np\n8\n2π 3\ng∗ (xF )xF\n\n!\n\n.\n\n(3.15)\n\nHere aef f and bef f are the first two terms in the velocity expansion of σef f\nσef f (x) v = aef f (x) + bef f (x) v 2 + O(v 4 ) .\n\n–8–\n\n(3.16)\n\n\fComparing eqs. (3.9) and (3.16), one gets\naef f (x) =\n\nN\nX\n\naij\n\ngi gj\n3/2\n(1 + ∆j )3/2 exp(−x(∆i + ∆j )) ,\n2 (1 + ∆i )\ngef\nf\n\n(3.17)\n\nbij\n\ngi gj\n3/2\n(1 + ∆j )3/2 exp(−x(∆i + ∆j )) ,\n2 (1 + ∆i )\ngef\nf\n\n(3.18)\n\nij\n\nbef f (x) =\n\nN\nX\nij\n\nwhere aij and bij are obtained from σij v = aij + bij v 2 + O(v 4 ).\nConsidering relativistic corrections [64, 67, 68] to the above treatment results in an\nadditional subleading term which can be accounted for by the simple replacement\n1\nb→b− a\n4\n\n(3.19)\n\nin the above formulas.\n\n4. Relic Density in Minimal UED\nFor the purposes of our study we have implemented the relevant features of the Minimal\nUED model in the CompHEP event generator [69]. We incorporated all n = 1 and n = 2 KK\nmodes as new particles, with the proper interactions and one-loop corrected masses [5].\nSimilar to the SM case, the neutral gauge bosons at level 1, Z1 and γ1 , are mixtures of\nthe KK modes of the hypercharge gauge boson and the neutral SU (2)W gauge boson.\nHowever, as shown in [5], the radiatively corrected Weinberg angle at level 1 and higher\nis very small. For example, γ1 , which is the LKP in the minimal UED model, is mostly\nthe KK mode of the hypercharge gauge boson. Therefore, for simplicity, in the code we\nneglected neutral gauge boson mixing for n = 1. We then use our UED implementation\nin CompHEP to derive analytic expressions for the (co)annihilation cross-sections between\nany pair of n = 1 KK particles. Our code has been subjected to numerous tests and crosschecks. For example, we reproduced all results from [6]. We have also used the same code\nfor independent studies of the collider and astroparticle signatures of UED [25, 33, 61, 70]\nand thus have tested it from a different angle as well.\nThe mass spectrum of the n = 1 KK partners in Minimal UED can be found, for\nexample, in Fig. 1 of [4]. In MUED the next-to-lightest KK particles are the singlet KK\nleptons and their fractional mass difference from the LKP is4\n∆lR1 ≡\n\nmlR1 − mγ1\n∼ 0.01 .\nmγ1\n\n(4.1)\n\nNotice that the Boltzmann suppression\ne−∆lR1 xF ∼ e−0.01*25 = e−0.25\n4\n\nIn this paper we follow the notation of [6] where the two types of n = 1 Dirac fermions are distinguished\nby an index corresponding to the chirality of their zero mode partner. For example, lR1 stands for an\nSU (2)W -singlet Dirac fermion, which has in principle both a left-handed and a right-handed component.\n\n–9–\n\n\fis not very effective and coannihilation processes with lR1 are definitely important, hence\nthey were considered in [6]. What about the other, heavier particles in the n = 1 KK\nspectrum in MUED? Since their mass splittings from the LKP\n∆i ≡\n\nmi − mγ1\nmγ1\n\n(4.2)\n\nare larger, their annihilations suffer from a larger Boltzmann suppression. However, the\ncouplings of all n = 1 KK partners other than lR1 are larger compared to those of γ1 and\nlR1 . For example, SU (2)W -doublet KK leptons lL1 couple weakly, and the KK quarks\nq1 and KK gluon g1 have strong couplings. Therefore, their corresponding annihilation\ncross-sections are expected to be larger than the cross-section of the main γ1 γ1 channel.\nWe see that for the other KK particles, there is a competition between the increased\ncross-sections and the larger Boltzmann suppression. An explicit calculation is therefore\nneeded in order to evaluate the net effect of these two factors, and judge the importance\nof the coannihilation processes which have been neglected so far. One might expect that\ncoannihilations with SU (2)W -doublet KK leptons might be numerically significant, since\ntheir mass splitting in MUED is ∼ 3% and the corresponding Boltzmann suppression factor\nis only e−0.03*25 ∼ e−0.75 .\n\nIn our code we keep all KK masses different while we neglect all the masses of the\nStandard Model particles. As an illustration, let us show the a and b terms for γ1 γ1\n ̄\nannihilation only. For fermion final states we find the a-term and b-term of σ(γ1 γ1 → f f)v\nas follows\na=\n\nX 32πα21 Nc m2γ\n\n1\n\n9\n\nf\n\n≈\n\nX 8πα2\n\nb=−\n\n≈−\n\n1\n\n9m2γ1\n\nf\n\nNc Yf4L\n\nYf4L\n\n+\n(m2γ1 + m2fL1 )2 (m2γ1 + m2fR1 )2\n\u0012 \u0013\n\u0001 8πα21 95\n4\n+ Y fR =\n,\n9m2γ1 18\n\n11m4γ1 + 14m2 m2fL1 − 13m4fL1\n\n+Yf4R\n\n11m4γ1 + 14m2 m2fL1 − 13m4fL1\n\n1\n\n27\n\nX πα2\n1\nNc Yf4L\n9m2γ1\nf\n\n!\n\nYf4L\n\nX 4πα21 Nc m2γ\nf\n\nYf4R\n\n(4.3)\n(4.4)\n\n(m2γ1 + m2fR1 )4\n\n(m2γ1 + m2fR1 )4\n\u0012 \u0013\n\u0001\nπα21 95\n4\n+ Y fR = − 2\n,\n9mγ1 18\n\n!\n\nwhere g1 is the gauge coupling of the hypercharge U (1)Y gauge group, α1 =\nfor f = q and Nc = 1 for f = l. Yf is the hypercharge of the fermion f .\n\n– 10 –\n\n(4.5)\n(4.6)\n\ng12\n4π\n\nand Nc = 3\n\n\fFigure 1: The a-term of the annihilation cross-section for (a) γ1 γ1 → e+ e− and (b) γ1 γ1 → φφ∗ , as\na function of the mass of the t-channel particle(s). We fix the LKP mass at mγ1 = 500 GeV and vary\n(a) the KK lepton mass meR1 = meL1 or (b) the KK Higgs boson mass mφ1 . The blue solid lines\nare the exact results (4.3) and (4.7), while the red dotted lines correspond to the approximations\n(4.4) and (4.8).\n\nFor the Higgs boson final states we get\na=\n\ni\n\n(m2γ1 + m2φi )2\n\n9m2γ1\n\ni\n\n≈\n\n11m4γ1 − 2m2γ1 m2φi + 3m4φi\n\nX 2πα21 Yφ4\n\nX 2πα21 Yφ4\n\ni\n\nb=−\n≈−\n\n=\n\n3m2γ1\n\ni\n\nX πα21 Yφ4\ni\ni\n\n108m2γ1\n\nX πα21 Yφ2\n\ni\n\ni\n\n12m2γ1\n\n4πα21 Yφ4\n3m2γ1\n\n!\n\n,\n\n(4.8)\n\n121m8γ1 + 140m6γ1 m2φi − 162m4γ1 m4φi + 60m2γ1 m6φi − 15m8φi\n(m2γ1 + m2φi )4\n\n=−\n\nπα21 Yφ2\n6m2γ1\n\n(4.7)\n\n.\n\n!\n\n(4.9)\n\n(4.10)\n\nIn the limit where all KK masses are the same (the second line in each formula above),\nwe recover the result of [6]. Notice the tremendous simplification which arises as a result\nof the mass degeneracy assumption. In Fig. 1 we show the a terms of the annihilation\ncross-section for two processes: (a) γ1 γ1 → e+ e− and (b) γ1 γ1 → φφ∗ , as a function of\nthe mass of the t-channel particle(s). We fix the LKP mass at mγ1 = 500 GeV and vary\n(a) the KK lepton mass meR1 = meL1 or (b) the KK Higgs boson mass mφ1 . The blue\nsolid lines are the exact results (4.3) and (4.7), while the red dotted lines correspond to\nthe approximations (4.4) and (4.8) in which the mass difference between the t-channel\nparticles and the LKP has been neglected. We see that the approximations (4.4) and (4.8)\ncan result in a relatively large error, whose size depends on the actual mass splitting of the\nKK particles. This is why in our code we keep all individual mass dependencies.\n\n– 11 –\n\n\fFigure 2: The quantities (a) g∗ (TF ) and (b) xF as a function of R−1 in MUED.\n\nAnother difference between our analysis and that of Ref. [6] is that here we shall use\na temperature-dependent g∗ function as defined in (3.6). The relevant value of g∗ which\nenters the answer for the LKP relic density (3.12) is g∗ (TF ), where TF = mγ1 /xF is the\nfreeze-out temperature. In Fig. 2a we show a plot of g∗ (TF ) as a function of R−1 in\nMUED, while in Fig. 2b we show the corresponding values of xF . In Fig. 2a one can\nclearly see the jumps in g∗ when crossing the bb̄, W + W − , ZZ and hh thresholds (from left\nto right). The tt̄ threshold is further to the right, outside the plotted range. As we shall see\nbelow, cosmologically interesting values of Ωh2 are obtained for R−1 below 1 TeV, where\ng∗ (TF ) = 86.25, since we are below the W + W − threshold. The analysis of Ref. [6] assumed\na constant value of g∗ = 92, which is only valid between the W + W − and ZZ thresholds.\nThe expert reader has probably noticed from Fig. 2b that the values of xF which we\nobtain in MUED are somewhat larger than the xF values one would have in typical SUSY\nmodels. This is due to the effect of coannihilations, which increase gef f (see Fig. 5c below)\nand therefore xF , in accordance with (3.15).\nWe are now in a position to discuss our main result in MUED. In Fig. 3 we show\nthe LKP relic density as a function of R−1 in the Minimal UED model. We show the\nresults from several analyses, each under different assumptions, in order to illustrate the\neffect of each assumption. We first show several calculations for the academic case of no\ncoannihilations. The three solid lines in Fig. 3 account only for the γ1 γ1 process. The\n(red) line marked \"a\" recreates the analysis of Ref. [6], assuming a degenerate KK mass\nspectrum. The (blue) line marked \"b\" repeats the same analysis, but uses T -dependent g∗\naccording to (3.6) and includes the relativistic correction to the b-term (3.19). The (black)\nline marked \"c\" further relaxes the assumption of KK mass degeneracy, and uses the actual\nMUED mass spectrum.\nComparing lines \"a\" and \"b\", we see that, as already anticipated from Fig. 2a, accounting for the T dependence in g∗ has the effect of lowering g∗ (xF ), σef f (xF ), and\n\n– 12 –\n\n\fFigure 3: Relic density of the LKP as a function of R−1 in the Minimal UED model. The (red) line\nmarked \"a\" is the result from considering γ1 γ1 annihilation only, following the analysis of Ref. [6],\nassuming a degenerate KK mass spectrum. The (blue) line marked \"b\" repeats the same analysis,\nbut uses T -dependent g∗ according to (3.6) and includes the relativistic correction to the b-term\n(3.19). The (black) line marked \"c\" relaxes the assumption of KK mass degeneracy, and uses the\nactual MUED mass spectrum. The dotted line is the result from the full calculation in MUED,\nincluding all coannihilation processes, with the proper choice of masses. The green horizontal band\ndenotes the preferred WMAP region for the relic density 0.094 < ΩCDM h2 < 0.129. The cyan\nvertical band delineates values of R−1 disfavored by precision data.\n\ncorrespondingly, increasing the prediction for Ωh2 . This, in turns, lowers the preferred\nmass range for γ1 . Next, comparing lines \"b\" and \"c\", we see that dropping the mass\ndegeneracy assumption has a similar effect on σef f (xF ) (see Fig. 1), and further increases\nthe calculated Ωh2 . This can be easily understood from the t-channel mass dependence\nexhibited in (4.3) and (4.7). The t-channel masses appear in the denominator, and they\nare by definition larger than the LKP mass. Therefore, using their actual values can only\ndecrease σef f and increase Ωh2 .\nThe dotted line in Fig. 3 is the result from the full calculation in MUED, including\nall coannihilation processes, with the proper choice of masses. The green horizontal band\ndenotes the preferred WMAP region for the relic density 0.094 < ΩCDM h2 < 0.129. The\ncyan vertical band delineates values of R−1 disfavored by precision data [41]. We see that\naccording to the full calculation, the cosmologically ideal mass range is mγ1 ∼ 500 − 600\nGeV, when γ1 accounts for all of the dark matter in the Universe. This range is somewhat\n\n– 13 –\n\n\flower than earlier studies have indicated, mostly due to the effects discussed above. Since\nthe MUED model will be our reference point for the investigations in Section 5, the dotted\nline from Fig. 3 will be appearing in all subsequent plots in Section 5 below.\n\n5. Relative Weight of Different Coannihilation Processes\nAs we already explained in the Introduction, the assumptions behind the MUED model\ncan be easily relaxed by allowing nonvanishing boundary terms at the scale Λ. This would\nmodify the KK spectrum and correspondingly change our prediction for the KK relic\ndensity from the previous section. Our code is able to handle such more general cases with\nease, since we use as inputs the physical KK masses. In order to gain some insight into\nthe cosmology of such non-minimal scenarios, we have studied the effects of varying the\nn = 1 KK masses one at a time. The change in any given KK mass will not only enhance\nor suppress the related coannihilation processes, but also impact any other cross-sections\nwhich happen to have a dependence on the mass parameter being varied. Thus the results\nin this section may allow one to judge the importance of each individual coannihilation\nprocess, and anticipate the answer for Ωh2 in non-minimal models.\nWe have classified the discussion in this section by particle types. Section 5.1 contains\nour results for the annihilation processes with KK leptons. Many of our results have already\nappeared in Ref. [6]. The new element here is the discussion of lL1 coannihilations. The\nresults presented in Sections 5.2 and 5.3 are completely new – there we investigate the\ncoannihilation effects with strongly interacting KK modes and electroweak gauge bosons\nand/or Higgs bosons, respectively.\n5.1 Effects due to coannihilations with KK leptons\nWe begin with a discussion of γ1 coannihilations with the n = 1 SU (2)W -singlet leptons\nlR1 and the n = 1 SU (2)W -doublet leptons lL1 . One might expect that those processes\nwill be important, since the KK leptons receive relatively small one-loop mass corrections.\nFor example, in the Minimal UED model ∆lR1 ∼ 1% and ∆lL1 ∼ 3%. It is natural to\nexpect that this degeneracy might persist in non-minimal models as well.\nOur approach is as follows. Since we keep separate values for the KK masses, when\nwe start varying any one of them, we have to somehow fix the remainder of the KK mass\nspectrum. We choose to use MUED as our reference model, hence the masses which are not\nbeing varied, will be fixed according to their MUED values. We shall still show results for\nΩh2 as a function of R−1 , but for various fixed values of the corresponding mass splitting\n∆i defined in eq. (4.2). We shall also always display the reference MUED model line, for\nwhich, of course, ∆i takes its MUED value.\nOur first example is shown in Fig. 4, where we illustrate the size of the coannihilation\neffects for (a) 1 generation or (b) 3 generations of degenerate singlet KK leptons lR1 . The\nlines show the LKP relic density as a function of R−1 , for several choices of the mass\nsplitting ∆lR1 between the LKP and the SU (2)W -singlet KK fermions lR1 . The solid lines\nfrom top to bottom in both (a) and (b) correspond to ∆eR1 = 0, 0.3, 0.1, and the dotted\n\n– 14 –\n\n\fFigure 4: Coannihilation effects of (a) 1 generation or (b) 3 generations of singlet KK leptons.\nThe lines show the LKP relic density as a function of R−1 , for several choices of the mass splitting\n∆lR1 between the LKP and the SU (2)W -singlet KK fermions lR1 . In each case we use the MUED\nspectrum to fix the masses of the remaining particles, and then vary the lR1 mass by hand. The\nsolid lines from top to bottom in both (a) and (b) correspond to ∆eR1 = 0, 0.3, 0.1. The dotted line\nis the nominal UED case from Fig. 3.\n\nline is the nominal UED case from Fig. 3, for which ∆lR1 = 0.01. As expected, all lines\nfollow the general trend of Fig. 3. In accord with the observations of Ref. [6], we see that\nlR1 coannihilations increase the prediction for Ωh2 . Such a behavior may seem peculiar at\nfirst sight, since in supersymmetry one finds the opposite phenomenon - coannihilations\nwith sleptons tend to reduce the SUSY WIMP relic density. The difference between the\ntwo cases can be intuitively understood as follows. In SUSY, the cross-section for the\n ̄ is helicity suppressed, but the coannihilation\nmain annihilation channel (χ̃01 χ̃01 → f f)\nprocesses are not. Adding coannihilations therefore can only increase the effective crosssection (3.9) and correspondingly decrease Ωh2 . In contrast, in UED the main annihilation\nchannel (γ1 γ1 → f f ̄) is already of normal strength. The effect of coannihilations can be\neasily guessed only if the additional processes have either much weaker or much stronger\ninteractions. In the case of lR1 , however, the additional processes are of the same order\n(both γ1 and lR1 have hypercharge interactions only) and the sign of the coannihilation\neffect depends on the detailed balance of numerical factors, which will be illustrated in\nFig. 5 and discussed in more detail below.\nThe spread in the lines in Fig. 4 is indicative of the importance of the coannihilations.\nComparing Fig. 4a and Fig. 4b, we see that in the case of three generations, the effects are\nmagnified correspondingly. A similar conclusion was reached in Ref. [6].\nNotice the peculiar ordering of the lines corresponding to different ∆lR1 . With respect\nto variations of ∆lR1 , the maximum possible value of Ωh2 is obtained for ∆lR1 → 0, where\nthe effect of coannihilations is maximal. Then, as we increase the mass splitting between lR1\nand γ1 , at first Ωh2 decreases (see the sequence of ∆lR1 = 0, ∆lR1 = 0.01 and ∆lR1 = 0.1)\n\n– 15 –\n\n\fFigure 5: Plots of various quantities entering the LKP relic density computation, as a function\nof the mass splitting ∆eR1 between the LKP and the SU (2)W -singlet KK electron, for R−1 = 500\n2\nGeV in MUED. (a) Relic density, (b) aef f (xF ), (c) gef f (xF ) and (d) aef f (xF )gef\nf (xF ).\n\nbut then starts increasing again and the Ωh2 values that we get for ∆lR1 = 0.3 are slightly\nlarger than those for ∆lR1 = 0.1. This behavior can be seen more clearly from Fig. 5a,\nwhere we vary the mass of the SU (2)W -singlet KK electron eR1 and plot Ωh2 versus ∆eR1\nfor a fixed R−1 = 500 GeV.\nThe interesting behavior of Ωh2 exhibited in Fig. 5a can be understood in terms of\nthe mlR1 dependence of the effective annihilation cross-section (3.9) which is dominated\nby its a-term (3.17). Both σef f and aef f are functions of x, but for the purposes of our\ndiscussion here it is sufficient to concentrate on the fixed value x = xF which dominates\nthe integrals (3.13) and (3.14). We plot aef f (xF ) as a function of ∆eR1 in Fig. 5b. We see\nthat aef f (xF ) exhibits exactly the opposite dependence to Ωh2 , and in particular, has an\nanalogous local extremum at ∆eR1 ∼ 0.1. Therefore, in order to understand qualitatively\nthe behavior of Ωh2 , we only need to concentrate on aef f (xF ).\nLet us start with the large ∆eR1 region in Fig. 5b. The SU (2)W -singlet KK electron\n\n– 16 –\n\n\fFigure 6: The same as Fig. 4 but illustrating the effects of varying the SU (2)W -doublet KK electron\nmass. From top to bottom, the solid lines show Ωh2 as a function of R−1 , for ∆eL1 = 0.01, 0.001, 0.\nThe dotted line is the nominal UED case from Fig. 3.\n\neR1 is then too heavy to participate in any relevant coannihilation processes. The effective\ncross-section (3.9) then receives no contributions from processes with eR1 . Nevertheless,\nthe mass of eR1 enters σef f through the cross-section for the process γ1 γ1 → e+ e− (see\neqs. (4.3) and (4.5)). Then as we lower meR1 , σ(γ1 γ1 → e+ e− ) is increased and this leads\nto a corresponding increase in aef f as seen in Fig. 5b. This trend continues down to\n∆eR1 ∼ 0.1, where coannihilations with eR1 start becoming relevant. This can be seen in\nFig. 5c, where we plot gef f (xF ) as a function of ∆eR1 . From its defining equation (3.10) we\nsee that gef f (x) starts to deviate from a constant only when the exponential terms (which\nsignal the turning on of coannihilations) become non-negligible. The exponential terms are\nall positive and increase gef f . At the same time, there are new cross-section terms entering\nthe sum for σef f , so we expect the numerator in (3.9) to increase as well. This is confirmed\n2 (x ). From Figs. 5c\nin Fig. 5d, where we plot the numerator of (3.9) simply as aef f (xF )gef\nF\nf\nand 5d we see that both the numerator and the denominator of (3.17) increase at low ∆eR1 ,\nand so it is a priori unclear how their ratio will behave with ∆eR1 . In this particular case,\ngef f wins, and aef f (xF ) is effectively decreased as a result of turning on the coannihilations\nwith eR1 . This feature was also observed in Ref. [6].\nWe are now in position to repeat the same analysis, but for the case of the SU (2)W doublet KK leptons lL1 . In Fig. 6, in complete analogy to Fig. 4, we illustrate the effects on\nthe relic density from varying the SU (2)W -doublet KK electron mass. From top to bottom,\nthe solid lines show Ωh2 as a function of R−1 , for ∆eL1 = 0.01, 0.001, 0. The dotted line is\nagain the MUED reference model. We see that the case of SU (2)W -doublet KK leptons is\ndifferent. Unlike lR1 , they have weak interactions, and the extra terms which they bring\ninto the sum (3.9) are larger than the main annihilation channel. The increase in gef f is\nsimilar as before. As a result, this time the increase in the numerator of (3.9) wins, and the\n\n– 17 –\n\n\fFigure 7: The same as Figs. 4(b) and 6(b), but for the case of KK quarks. Each solid line is\nlabeled by the value of (a) ∆qR1 or (b) ∆qL1 used. The dotted line is the nominal UED case from\nFig. 3.\n\nnet effect is to increase the effective annihilation cross-section. This leads to a reduction in\nthe predicted value for the relic density, as evidenced from Fig. 6. Notice how the decrease\nin Ωh2 is monotonic with ∆eL1 .\nAnother difference between lR1 and lL1 coannihilations is revealed by comparing the\ncase of 1 generation (panels (a) in Figs. 4 and 6) and 3 generations (panels (b) in Figs. 4\nand 6). We see that for SU (2)W singlets, the coannihilations are more prominent for the\ncase of 3 generations, while for SU (2)W doublets, it is the opposite. This is due to the\ndifferent number of degrees of freedom contributed to gef f in each case, which shifts the\ndelicate balance between the numerator and denominator of (3.9), as discussed above.\n5.2 Effects due to coannihilations with KK quarks and KK gluons\nWe will now consider coannihilation effects with colored KK particles (KK quarks and\nKK gluons). Since they couple strongly, we expect on general grounds that the effective\nannihilation cross-sections will be enhanced, and the preferred range of the LKP mass\nwill correspondingly be shifted higher. These expectations are confirmed by our explicit\ncalculation whose results are shown in Figs. 7 and 8. In Fig. 7 we show the effects on\nthe relic density from varying the masses of all three generations of (a) SU (2)W -singlet\nKK quarks and (b) SU (2)W -doublet KK quarks. The solid lines show Ωh2 as a function\nof R−1 , and are labeled by the corresponding value of ∆qR1 or ∆qL1 used. As before, the\ndotted line is the MUED reference model. Comparing the results in Figs. 7a and 7b, we\nfind that the coannihilations with qR1 and qL1 have very similar effects, as they are both\ndominated by the strong interactions, which are the same for qR1 and qL1 . Fig. 8 shows\nthe analogous result for the case of varying the KK gluon mass, where the labels now show\nthe values of ∆g1 . There is a noticeable distortion of the lines around R−1 ∼ 2300 GeV,\nwhich is due to the change in g∗ (see Fig. 2a).\n\n– 18 –\n\n\fFigure 8: The same as Fig. 7, but for the case of varying the KK gluon mass. The lines are labeled\nby the value of ∆g1 . The dotted line is the nominal UED case from Fig. 3.\n\nFrom Figs. 7 and 8 we see that in non-minimal UED models where the colored KK\nmodes happen to exhibit some sort of degeneracy with the LKP, multi-TeV values for\nmγ1 are in principle possible. From that point of view, unfortunately, there is no \"no-lose\"\ntheorem for the LHC or ILC regarding a potential absolute upper bound on the LKP mass.\n5.3 Effects due to coannihilations with electroweak KK bosons\nWe finally show our coannihilation results for the case of electroweak KK gauge bosons (W10\nand W1± ) and KK Higgs bosons (H10 , G01 and G±\n1 ). The results are displayed in Figs. 9a\nand 9b, correspondingly. Due to the SU (2)W symmetry, all three n = 1 KK W -bosons are\nvery degenerate, and we have assumed a common parameter ∆W1 for all three. Similarly,\nthe masses of the n = 1 KK Higgs bosons differ only by electroweak symmetry breaking\neffects, which we neglect throughout the calculation. We have therefore assumed a common\nparameter ∆H for them as well.\nSince both the electroweak KK gauge bosons and the KK Higgs bosons have weak\ninteractions, we expect the results to be similar to the case of SU (2)W -doublet leptons in\nthe sense that coannihilations would lower the predictions for Ωh2 . This is confirmed by\nFig. 9. We observe that the effects from the KK W -bosons are actually quite significant,\nand can push the preferred LKP mass as high as 1.4 TeV.\n\n6. Summary and Conclusions\nIn this paper we revisited the calculation of the LKP relic density in the scenario of Universal Extra Dimensions. We extended the analysis of Ref. [6] to include all coannihilation\n\n– 19 –\n\n\fFigure 9: The same as Fig. 8, but illustrating the effect of varying simultaneously the masses of\nall (a) SU (2) KK gauge bosons and (b) KK Higgs bosons. In (a) the lines are labeled by the value\nof ∆W1 , while in (b) the values of ∆H are (from top to bottom) ∆H = 0.05, 0.01, 0.001, 0. The\ndotted line is the nominal UED case from Fig. 3.\n\nprocesses involving n = 1 KK partners. This allowed us to predict reliably the preferred\nmass range for the KK dark matter particle in the Minimal UED model. We found that in\norder to account for all of the dark matter in the universe, the mass of γ1 should be within\n500 − 600 GeV, which is somewhat lower than the range found in [6]. This is due to a\ncombination of several factors. Among the effects which caused our prediction for Ωh2 to\ngo up are the following: we used a lower value of g∗ , we kept the individual KK masses in\nour formulas, and we accounted for the relativistic correction (3.19). On the other hand,\nas we saw in Section 5, including the effect of coannihilations with KK particles other than\nSU (2)W -singlet KK leptons, always has the effect of lowering the predicted Ωh2 . Finally,\nthe cosmologically preferred range for Ωh2 itself has shifted lower since the publication\nof [6].\nThe lower range of preferred values for R−1 is good news for collider and astroparticle\nsearches for KK dark matter. It should be kept in mind that it is quite plausible, and in fact\nvery likely, that the dark matter is made up of not one but several different components,\nin which case the LKP could be even lighter. We should mention that several collider\nstudies [4, 25, 32, 33] have already used an MUED benchmark point with R−1 = 500 GeV,\na choice which we now see also happens to be relevant for cosmology.\nIn Section 5 we also investigated how each class of n = 1 KK partners impacts the\nKK relic density. We summarize the observed trends in Fig. 10, where we fix Ωh2 =\n0.1 and then show the required R−1 for any given ∆i , for each class of KK particles.\nWe show variations of the masses of one (red dotted) or three (red solid) generations of\nSU (2)W -singlet KK leptons; three generations of SU (2)W -doublet leptons (magenta); three\ngenerations of SU (2)W -singlet quarks (blue) (the result for three generations of SU (2)W doublet quarks is almost identical); KK gluons (cyan) and electroweak KK gauge bosons\n\n– 20 –\n\n\fFigure 10: The change in the cosmologically preferred value for R−1 as a result of varying the\ndifferent KK masses away from their nominal MUED values. Along each line, the LKP relic density\nis Ωχ h2 = 0.1. To draw the lines, we first fix the MUED spectrum, and then vary the corresponding\nKK mass and plot the value of R−1 which is required to give Ωχ h2 = 0.1. We show variations of\nthe masses of one (red dotted) or three (red solid) generations of SU (2)W -singlet KK leptons; three\ngenerations of SU (2)W -doublet leptons (magenta); three generations of SU (2)W -singlet quarks\n(blue) (the result for three generations of SU (2)W -doublet quarks is almost identical); KK gluons\n(cyan) and electroweak KK gauge bosons (green). The circle on each line denotes the MUED values\nof ∆ and R−1 .\n\n(green). The circle on each line denotes the MUED values of ∆ and R−1 .\nFig. 10 summarizes our results from Section 5. It also provides a quick reference\nguide for the expected variations in the predicted value of Ωh2 as we move away from the\nMinimal UED model. For example, it is clear that unlike the case of coannihilations with\nlR1 , which was considered in [6], coannihilations with all other KK particles will lower the\nprediction for Ωh2 and correspondingly increase the preferred range of R−1 . This is due to\nthe larger couplings of those particles. Fig. 10 can also be used to quantitatively estimate\nthe variations in the preferred value of R−1 in non-minimal models.\nOn a final note, in the non-minimal UED model, other neutral KK particles such as Z1\ncan also be dark matter candidates. On dimensional grounds, the relic density is inversely\nproportional to the square of the LKP mass,\nΩh2 ∼\n\ng14\n,\nm2γ1\n\n(6.1)\n\nΩh2 ∼\n\ng24\n.\nm2Z1\n\n(6.2)\n\nDue to the larger coupling g2 of the SU (2)W gauge interactions, we expect the upper bound\n\n– 21 –\n\n\fon mZ1 , consistent with WMAP, to be larger than the bound on mγ1 roughly by a factor\nof g22 /g12 ∼ 3. However, in the Z1 LKP case, SU (2)W symmetry implies that the charged\nW1 states are almost degenerate with Z1 , and therefore coannihilations with W1± will be\nvery important and will need to be considered. The analysis of the cases of Z1 and H1\nLKP and their detection prospects is currently in progress [71]. The results presented in\nthis paper are also relevant for the case of KK graviton superwimps [72–74], whose relic\ndensity is still determined by the freeze-out of the next-to-lightest KK particle.\nIn conclusion, dark matter candidates from theories with extra dimensions should be\nconsidered on an equal footing with more conventional candidates such as SUSY dark matter or axions. The framework of Universal Extra Dimensions provides a useful playground\nfor gaining some experience about the signals one could expect from extra dimensional dark\nmatter. If extra dimensions have indeed something to do with the dark matter problem,\nthe explicit realization of that idea may look quite differently (see for example [75–77]),\nespecially if one wants to resolve the radion stabilization problem [78,79]. Nevertheless, we\nbelieve that the methods and insight we developed in this paper will prove useful in more\ngeneral contexts.\nNote added: During the completion of this work we became aware of an analogous\ncalculation done independently by another group [12]. We have compared extensively the\nformulas for the annihilation cross-sections involving KK quarks, KK leptons and KK gauge\nbosons, in the limit of degenerate KK masses, as listed in the Appendix. In all considered\ncases we found perfect agreement.\n\nAcknowledgments\nWe are grateful to F. Burnell and G. Kribs for extensively comparing their results with ours.\nWe are grateful to A. Birkedal, G. Servant and T. Tait for extensive discussions and/or\ncorrespondence regarding the calculation of annihilation cross-sections in UED. This work\nis supported in part by a US Department of Energy Outstanding Junior Investigator award\nunder grant DE-FG02-97ER41209.\n\nA. Annihilation Cross-Sections\nIn this section, we summarize the annihilation cross sections of any pair of n = 1 KK\nparticles into SM fields in the limit of no electroweak symmetry breaking, as in [6]. In\norder to render the formulas manageable for publication, in this Appendix we list our\nresults in the limit of equal KK masses. However, in our numerical calculation, we kept\ndifferent masses for all KK particles, which often leads to enormously complicated analytical\nexpressions. We also assume all SM particles to be massless, since we are working in the\nlimit where we neglect electroweak symmetry breaking (EWSB) effects of order vR, where\nv is the Higgs vacuum expectation value in the SM. All cross-sections are calculated at\ntree level. All vertices satisfy KK-number conservation and KK-parity since KK-number\n\n– 22 –\n\n\fviolating interactions are only induced at the loop level [5]. Some of the cross-sections have\nalready appeared in [6] and we find perfect agreement with those results. We define a few\nconstants below which are commonly used in our formulas for the cross-sections.\ne\n,\ncw\ne\ng2 =\n,\nsw\ne\n,\ngZ =\n2s c\nrw w\n4m2\n,\nβ = 1−\n\u0012 s \u0013\n1−β\nL = log\n= −2 tanh−1 β .\n1+β\n\n(A.1)\n\ng1 =\n\n(A.2)\n(A.3)\n(A.4)\n(A.5)\n\nHere g1 , g2 and g3 are the gauge couplings of U (1)Y , SU (2)W and SU (3). β is the velocity\nof the incoming KK particle in the annihilation process. Notice that L is negative since\n0 < β < 1. m is the KK mass which for the purposes of this appendix is the same for all\nKK particles, e is the electric charge and cw and sw are the cosine and sine of the Weinberg\nangle in the SM. Table 1 provides a quick reference guide for the different process types.\n\nGauge bosons\nLeptons\nQuarks\nHiggses\n\nGauge bosons\n\nLeptons\n\nQuarks\n\nHiggses\n\nA.2\nA.3\nA.3\nA.7\n\nA.1\nA.5\nA.8\n\nA.4\nA.8\n\nA.6\n\nTable 1: A guide to the formulas in the Appendix. Each box in the table corresponds to a\nparticular type of an initial state. The entry points to the section in the Appendix where the\ncorresponding annihilation cross-sections can be found. Here \"gauge bosons\" include EW KK\ngauge bosons (W1± , Z1 and γ1 ) and the KK gluon (g1 ). \"Higgses\" stands for the KK Higgs (H1 )\nand KK Goldstone bosons (G±\n1 and G1 ). Leptons contain both SU (2)W -singlet KK leptons (lR1 )\nand SU (2)W -doublet KK leptons (lL1 and νl1 ). Quarks include both SU (2)W -doublet KK quarks\n(qR1 ) and SU (2)W -singlet KK quarks (qL1 ).\n\nA.1 Leptons\nCoannihilations with SU (2)W -singlet KK leptons lR1 are important since they are expected\nto be the next-to-lightest KK particles in the Minimal UED model [5, 6]. For fermion final\nstates with f 6= l, the cross-section is\n−\nσ(l+\nR1 lR1\n\n ̄ =\n→ f f)\n\nNc g14 Yl2 (Yf2L + Yf2R )(s + 2m2 )\n24πβs2\n\n– 23 –\n\n,\n\n(A.6)\n\n\fwhere Nc is 3 for quarks and 1 for leptons. For cases with the same lepton flavor in the\ninitial and final state, we have\n−\n+ −\nσ(l+\nR1 lR1 → l l ) =\n\n+\n\ng14 Yl4R1 (5βs + 2(2s + 3m2 )L)\n32πβ 2 s2\ng14 Yl4R1 (β(4s + 9m2 ) + 8m2 L)\n\n64πm2 β 2 s\ng14 Yl2R1 (Yl2R + Yl2L )(s + 2m2 )\n+\n,\n24πβs2\n\n±\n± ±\nσ(l±\nR1 lR1 → l l ) =\n\ng14 Yl4 (−m2 (4s − 5m2 )L − βs(2s − m2 ))\n,\n32πβ 2 s2 m2\n\n(A.8)\n\ng14 Yl4 (4s − 3m2 )\n,\n64πβsm2\n\n(A.9)\n\ng14 Yl4 (β(4s + 9m2 ) + 8m2 L)\n,\n64πβ 2 sm2\n\n(A.10)\n\n±\n\n±\n\n′\n± ′\nσ(l±\nR1 l R1 → l l ) =\n∓\n\n(A.7)\n\n∓\n\n′\n± ′\nσ(l±\nR1 l R1 → l l ) =\n\nwhere l and l′ are the leptons from different families. For the remaining final states we get\n−\n∗\nσ(l+\nR1 lR1 → φφ ) =\n−\nσ(l+\nR1 lR1 → B0 B0 ) =\n\ng14 Yl2 Yφ2 (s + 2m2 )\n48πβs2\n\n,\n\ng14 Yl4 (2(s2 + 4m2 s − 8m4 ) − βs(s + 4m2 ))\n.\n8πβ 2 s3\n\n(A.11)\n(A.12)\n\nOur results, (A.6-A.12), exactly agree with (C.1) - (C.8) from [6].\nThe cross-sections among left handed fermions are somewhat complicated since they\ninvolve SU (2)W gauge bosons as well as U (1)Y gauge bosons. For KK neutrinos we find\n2 )(s + 2m2 )\nNc gZ2 (ḡL2 + ḡR\nσ(νl1 ν̄l1 → f f ̄) =\n,\n24πβs2\n\nσ(νl1 ν̄l1 → φφ∗ ) =\nσ(νl1 ν̄l1 → ZZ) =\n\ngφ2 gZ2 (s + 2m2 )\n48πβs2\n\n,\n\ngZ4 ((8m4 − s2 − 4m2 s)L − βs(s + 4m2 ))\n,\n8πβ 2 s3\n5g24 (s + 2m2 ) g24 (βs − 2m2 L)\n+\n96πβs2\n32πβ 2 s2\ng4 (β(s + 4m2 ) + (s + 2m2 )L)\n− 2\n,\n32πβ 2 s2\n\n(A.13)\n\n(A.14)\n(A.15)\n\nσ(νl1 ν̄l1 → W + W − ) = −\n\nσ(νl1 νl1 → νl νl ) =\n\n(A.16)\n\ngZ4 (βs(2s − m2 ) − m2 (4s − 5m2 )L)\n,\n32πβ 2 s2 m2\n\n(A.17)\n\ngZ4 (4s − 3m2 )\n,\n64πβsm2\n\n(A.18)\n\nσ(νl1 νl′ 1 → νl νl′ ) =\n\n– 24 –\n\n\fσ(νl1 ν̄l′ 1 → νl ν̄l′ ) =\n+\n\nσ(νl1 ν̄l′ 1 → l− l′ ) =\n\ngZ4 (β(4s + 9m2 ) + 8m2 L)\n,\n64πβ 2 sm2\n\n(A.19)\n\ng24 (β(4s + 9m2 ) + 8m2 L)\n,\n256πβ 2 sm2\n\n(A.20)\n\ngZ ĝL2 ḡL (5βs + 2(2s + 3m2 )L)\n32πβ 2 s2\n2\n2\n2\n2\ng (ḡ + ḡR )(s + 2m ) ĝL4 (β(4s + 9m2 ) + 8m2 L)\n+ Z L\n+\n.\n(A.21)\n24πβs2\n64πm2 β 2 s\n√\n\u0001\nHere ḡL(R) = swecw T 3 − Qf s2w , ĝL = gZ for neutrinos and ĝL = g2 / 2 for charged leptons.\n\u0001\ngφ = swecw T 3 − Qφ s2w with Qφ = 1 for the upper entry in the Higgs doublet and Qφ = 0\nfor the lower entry. Since we ignore EWSB, all gauge bosons have transverse polarizations\nonly. φ represents either a charged Higgs boson (φu , isospin 12 ) or a neutral Higgs boson\n(φd , isospin − 12 ).\nThe previous results allow us to immediately obtain\nσ(νl1 ν̄l1 → l+ l− ) =\n\n−\n∗\nσ(νl1 ν̄l1 → φφ∗ ) = σ(l+\nL1 lL1 → φφ ) ,\n\n−\nσ(νl1 ν̄l1 → ZZ) = σ(l+\nL1 lL1 → ZZ + Zγ + γγ) ,\n\n−\n+\n−\nσ(νl1 ν̄l1 → W + W − ) = σ(l+\nL1 lL1 → W W ) ,\n±\n± ±\nσ(νl1 νl1 → νl νl ) = σ(l±\nL1 lL1 → l l ) ,\n\nσ(νl1 νl′ 1 → νl νl′ ) =\n\n=\n\nσ(νl1 ν̄l′ 1 → νl ν̄l′ ) =\n\nσ(νl1 l′L1 → νl l′ )\n± ′±\n′±\nσ(l±\nL1 l L1 → l l )\n′∓\n± ′∓\nσ(l±\nL1 l L1 → l l )\n\n(A.22)\n\n,\n.\n\nFor at least one charged KK lepton in the initial state we get\n4\n2\n−\n ̄ or l+ l− ) = Nc g (s + 2m ) ,\n→\nf\nf\nl\nσ(l+\nR R\nL1 L1\n24πβs2\n\nĝL2 g2 (5βs + 2(2s + 3m2 )L)\n32πβ 2 s2\n4\nĝ (β(4s + 9m2 ) + 8m2 L) g4 (s + 2m2 )\n+ L\n+\n,\n64πm2 β 2 s\n24πβs2\n\n(A.23)\n\n+ −\n−\nσ(l+\nL1 lL1 → νl ν̄l or lL lL ) =\n\n2\n4\n ̄′ ) = Nc g2 (s + 2m ) ,\nν̄\n→\nf\nf\nσ(l−\nL1\nL1\n96πβs2\n∗\nσ(l−\nL1 ν̄L1 → φu φd ) =\n−\nσ(l−\nL1 ν̄L1 → W B0 ) =\n\ng24 (s + 2m2 )\n,\n192πβs2\n\ng12 g22 ((8m4 − s2 − 4m2 s)L − βs(s + 4m2 ))\n,\n32πβ 2 s3\n\n– 25 –\n\n(A.24)\n\n(A.25)\n(A.26)\n(A.27)\n\n\f5g24 (s + 2m2 ) g24 (βs − 2m2 L)\n+\n48πs2 β\n32πs2 β 2\ng4 (β(s + 4m2 ) + (s + 2m2 )L) g24 m2 L\n− 2\n+\n,\n64πs2 β\n16πs2\n\n−\n0\nσ(l−\nL1 ν̄L1 → W W3 ) = −\n\ng1 g23 (5βs + 2(2s + 3m2 )L)\n64πβ 2 s2 (2s2w − 1)\ng 2 g2 (β(4s + 9m2 ) + 8m2 L) g24 (s + 2m2 )\n+\n,\n+ 1 2\n64πm2 β 2 s(2s2w − 1)2\n96πβs2\n\n(A.28)\n\n−\nσ(l−\nL1 ν̄L1 → l ν̄l ) =\n\ng1 g23 (−2m2 (4s − 5m2 )L + m2 βs)\n64πβ 2 s2 m2 (2s2w − 1)\n\u0012\n\u0013\ng12 g22\ng24\nβs(4s − 3m2 )\n+\n,\n+\n64πβ 2 s2 m2\n(2s2w − 1)2\n4\n\n(A.29)\n\n−\nσ(l−\nL1 νL1 → l νl ) =\n\ng24 (4s − 3m2 )\n,\n256πm2 sβ\n\n(A.31)\n\ng12 g22 (4s − 3m2 )\n,\n64πm2 sβ(2s2w − 1)2\n\n(A.32)\n\nσ(νL1 l′L1 → νl′ l− ) =\nσ(νL1 l′L1 → νl l′− ) =\nσ(ν̄L1 l′L1 → ν̄l l′− ) =\nσ(lL1 l̄′L1 → νl ν̄l′ ) =\n\n(A.30)\n\ng12 g22 (β(4s + 9m2 ) + 8m2 L)\n,\n64πm2 sβ 2 (2s2w − 1)2\n\n(A.33)\n\ng24 (β(9m2 + 4s) + 8m2 L)\n,\n256πm2 sβ 2\n\n(A.34)\n\nwhere g2 = g12 Yf YlR + g22 Tf3 Tl3L . The above cross-sections, (A.13-A.34) are consistent with\n(B.48) - (B.62) and (B.71) - (B.74) in [6].\nFor one SU (2)W -singlet KK lepton and one SU (2)W -doublet KK lepton we get\nσ(lR1 lL1\n\n\u0001\ng14 Ye2L Ye2R\n2\n2\n8m\n,\nL\n+\nβ(9m\n+\n4s)\n→ ll) =\n64πm2 sβ 2\n\nσ(lR1 l̄L1 → ll̄) =\n\n(A.35)\n\n\u0001\ng14 Ye2L Ye2R\n4s − 3m2 .\n2\n64πm sβ\n\n(A.36)\n\n± ′∓\n± ′∓\n± ′±\n′±\nThese two formulas have the same structure as σ(l±\nR1 l R1 → l l ) and σ(lR1 l R1 → l l ).\n\nA.2 Gauge bosons\nThe self-annihilation cross-sections of γ1 are\n ̄ =\nσ(γ1 γ1 → f f)\n\nNc g14 (Yf4L + Yf4R )\n72πs2 β 2\n∗\n\nσ(γ1 γ1 → φφ ) =\n\n– 26 –\n\n−5s(2m2 + s)L − 7sβ\ng14 Yφ4\n12πsβ\n\n.\n\n\u0001\n\n,\n\n(A.37)\n\n(A.38)\n\n\fThese two cross-sections are identical to (A.44) and (A.47) in [6]. For Z1 self-annihilation\ninto fermions and Higgs bosons,\n ̄ =\nσ(Z1 Z1 → f f)\n\n\u0001\nNc g24\n−5(2m2 + s)L − 7sβ ,\n2\n2\n1152πs β\n\nσ(Z1 Z1 → φφ∗ ) =\n\ng24\n.\n192πsβ\n\n(A.39)\n\n(A.40)\n\nThe cross-section for the above two processes are obtained from σ(γ1 γ1 → f f ̄) and\nσ(γ1 γ1 → φφ∗ ) by replacing g1 Y with g2 /2, which corresponds to the Z couplings to\nSM fermions and Higgs bosons. For the coannihilations of SU (2)W KK bosons into SM\ngauge bosons, we get\n\u0001\ng24\n12m2 (s − 2m2 )L + sβ(12m4 + 3sm2 + 4s2 ) ,\n2\n3\n2\n18πm s β\n(A.41)\n4\n\u0001\ng\n2\n12m4 (s − 2m2 )L + sβ(12m4 + 3sm2 + 4s2 ) ,\nσ(W1+ W1+ → W + W + ) =\n2\n3\n2\n36πm s β\n(A.42)\n4\n\u0001\ne\nσ(W1+ W1− → γγ) =\n12m4 (s − 2m2 )L + sβ(12m4 + 3sm2 + 4s2 ) , (A.43)\n36πm2 s3 β 2\nσ(Z1 Z1 → W + W − ) =\n\nσ(W1+ W1− → γZ) =\nσ(W1+ W1− → ZZ) =\n\n\u0001\ng22 e2 c2w\n12m4 (s − 2m2 )L + sβ(12m4 + 3sm2 + 4s2 ) , (A.44)\n2\n3\n2\n18πm s β\n\n\u0001\ng24 c4w\n12m4 (s − 2m2 )L + sβ(12m4 + 3sm2 + 4s2 ) . (A.45)\n2\n3\n2\n36πm s β\n\nWe see that the above five cross-sections contain similar expressions up to overall factors\ndue to the gauge structure of SU (2)W ×U (1)Y . For W1± annihilation into other final states,\nwe have\n ̄ =\nσ(W1+ W1− → f f)\n\n\u0001\n−Nc g24\n2\n2\n(12m\n+\n5s)L\n+\n2β(4m\n+\n5s)\n,\n576πs2 β 2\n\n(A.46)\n\n\u0001\ng24\n2m2 (3m2 + 2s)L + β(11m4 + 5sm2 + 2s2 ) ,\n2\n2\n2\n18πm s β\n(A.47)\n4 (s − m2 )\ng\n.\n(A.48)\nσ(W1+ W1− → φφ∗ ) = 2\n144πs2 β\n\nσ(W1+ W1− → W + W − ) =\n\nThese three cross-sections are different since they involve s-channel Z diagrams. For γ1 Z1\nand γ1 W1− into fermions we can recycle σ(γ1 γ1 → f f ̄) and obtain\nσ(γ1 Z1 → f f ̄) =\nσ(γ1 W1−\n\n→ f f ̄′ ) =\n\n−Nc g12 g22 Yf2\n288πs2 β 2\n\n−Nc g12 g22 Yf2\n144πs2 β 2\n\n– 27 –\n\n5(2m2 + s)L + 7sβ\n\n\u0001\n\n5(2m2 + s)L + 7sβ\n\n\u0001\n\n,\n\n(A.49)\n\n.\n\n(A.50)\n\n\fFor the annihilation of two different KK gauge bosons into Higgs bosons we have\nσ(γ1 Z1 → φφ∗ ) =\n\ng12 g22\n,\n192πsβ\n\n(A.51)\n\nσ(γ1 W1− → φd φ∗u ) =\n\ng12 g22\n,\n96πsβ\n\n(A.52)\n\nσ(Z1 W1− → φd φ∗u ) =\n\ng24 β\n,\n288πs\n\n(A.53)\n\nwhich can be obtained from σ(γ1 γ1 → φφ∗ ). The cross-section for Z1 W1− into fermions\nσ(Z1 W1− → f f ̄′ ) =\n\n\u0001\n−Nc g24\n(14m2 + 5s)L + β(16m2 + 13s) ,\n2\n2\n576πs β\n\n(A.54)\n\nhas a different structure compared to other fermion final states due to an s-channel W\ndiagram. The cross-sections for Z1 W1− into gauge boson final states\nσ(Z1 W1− → ZW − ) =\n\n\u0001\ng24 c2w\n2\n2\n4\n2\n2\n2m\n, (A.55)\n(3m\n+\n2s)L\n+\nβ(11m\n+\n5sm\n+\n2s\n)\n18πm2 s2 β 2\n\nσ(Z1 W1− → γW − ) =\n\n\u0001\ne2 g22\n2m2 (3m2 + 2s)L + β(11m4 + 5sm2 + 2s2 ) , (A.56)\n2\n2\n2\n18πm s β\n\ncan be obtained from σ(W1+ W1− → W + W − ). For KK gluons we get\n\n\u0001\ng34\n8m2 (s2 + 3sm2 − 3m4 )L + sβ(34m2 + 13sm2 + 8s2 ) ,\n2\n3\n2\n64πm s β\n(A.57)\n4\n\u0001\n−g3\nσ(g1 g1 → q q̄) =\n2(20s + 49m2 )L + β(72m2 + 83s) ,\n(A.58)\n2\n2\n3456πs β\n\nσ(g1 g1 → gg) =\n\nfor which there are no analogous processes. The cross-sections associated with one gluon\nand one electroweak gauge bosons in the initial state\nσ(g1 γ1 → q q̄) =\n\n\u0001\ng12 g32 (Yq2L + Yq2R )\n−5(2m2 + s)L − 7sβ ,\n2\n2\n144πs β\n\nσ(g1 Z1 → q q̄) =\nσ(g1 W1− → q q ̄′ ) =\n\n\u0001\ng22 g32\n−5(2m2 + s)L − 7sβ ,\n2\n2\n576πs β\n\n\u0001\ng22 g32\n−5(2m2 + s)L − 7sβ ,\n2\n2\n288πs β\n\n(A.59)\n\n(A.60)\n\n(A.61)\n\n ̄ σ(γ1 Z1 → f f)\n ̄ and σ(γ1 W − → f f ̄′) by simple coupling\nare obtained from σ(γ1 γ1 → f f),\n1\nreplacements and accounting for the additional color factors.\n\n– 28 –\n\n\fA.3 Fermions and Gauge Bosons\nNote that in UED, the Dirac KK fermions are constructed out of two Weyl fermions with\nthe same SU (2)W × U (1)Y quantum numbers while a Dirac fermion in the Standard Model\nis made up of two Weyl fermions of different SU (2)W ×U (1)Y quantum numbers. Therefore\nthe couplings of KK fermions to zero mode gauge bosons are vector-like. This difference\nshows up in processes involving gauge-boson couplings with fermions. For the vertices\nwhich involve n = 1 gauge bosons, we need one KK fermion and one SM fermion in order\nto conserve KK number. In this case, there is always a projection operator associated with\nthe subscript (L/R) of the KK fermion. The annihilation cross-sections with SU (2)W singlet KK fermions and SU (2)W KK gauge bosons (Z1 and W1± ) are zero:\nσ(fR1 Z1 → SM ) = 0 ,\n\nσ(fR1 W1± → SM ) = 0 .\n\n(A.62)\n\nThe cross-section for SU (2)W -singlet leptons and γ1 is\nYl4 g14 (−6L − β)\n.\n96πsβ 2\n\n(A.63)\n\ng12 g32 Yq21\nσ(q1 γ1 → qg) =\n(−6L − β) .\n72πsβ 2\n\n(A.64)\n\n±\nσ(γ1 l±\nR1 → B0 l ) =\n\nFor a KK quark and γ1 we have\n\n±\nThis cross-section is basically the same as σ(γ1 l±\nR1 → B0 l ), up to a group factor. In\nσ(q1 γ1 → qg), the vertex associated with the SM gluon g contains a Gell-Mann matrix taij .\nIn the squared matrix element, we then get [80]\n8\n3\nX\n1 X\na=1\n\n3\n\ntaij taji =\n\ni,j=1\n\n1 4\n4\n× ×3= .\n3 3\n3\n\n(A.65)\n\nSimilarly, for the SU (2)W -doublet quarks with Z1 , we get\nσ(qL1 Z1 → gq) =\n\ng22 g32\n(−6L − β) ,\n288πsβ 2\n\n(A.66)\n\nby replacing the g1 coupling in σ(q1 γ1 → qg) with g2 /2. For W1± , one should use the\n√\ncoupling g2 / 2 instead:\nσ(qL1 W1 → gq ′ ) =\n\ng22 g32\n(−6L − β) .\n144πsβ 2\n\n(A.67)\n\nFor the SU (2)W -doublet KK leptons and γ1 or Z1 , we get\nσ(lL1 γ1 → lL γ/Z) =\n\ng14\n(−6L − β) ,\n1536πsβ 2 s2w\n\n– 29 –\n\n(A.68)\n\n\fσ(lL1 Z1 → lL γ/Z) =\nσ(lL1 γ1 → νl W ) =\n\ng24\n(−6L − β) ,\n1536πsβ 2 c2w\n\n(A.69)\n\ng12 g22\n(−6L − β) .\n768πsβ 2\n\n(A.70)\n\nThe last 7 cross-sections have a similar structure since they all have s- and t-channel\ndiagrams only. For the cross-sections associated with SU (2)W -doublet KK leptons and\nelectroweak KK gauge bosons into other final states, we have\nσ(lL1 Z1 → νl W ) =\n\n\u0001\ng24\n26m2 L + β(23m2 + 32s) ,\n2\n2\n768πm sβ\n\nσ(lL1 W1 → νl′ (γ + Z)) =\n\nσ(lL1 W1− → lL W − ) =\nσ(lL1 W1+ → lL W + ) =\n\ng24\nm2 (32c2w − 6)L\n768πm2 sβ 2 c2w\n\u0001\n+βm(24c2w − 1) + 32sβc2w ,\n\u0001\ng24\n2\n−3m\nL\n+\n4sβ\n,\n192πm2 sβ 2\n\n\u0001\ng24\n16m2 L + β(11m2 + 8s) ,\n2\n2\n384πm sβ\n\nσ(lL1 W1− → lL W − ) = σ(νl1 W1+ → νl W + ) ,\n\nσ(lL1 W1+\n\n+\n\n→ lL W ) =\n\nσ(νl1 W1−\n\n−\n\n→ νl W ) .\n\n(A.71)\n\n(A.72)\n(A.73)\n(A.74)\n(A.75)\n(A.76)\n\nFor KK gluon - KK quark annihilation, we obtain\nσ(g1 q1 → gq) =\nA.4 Quarks\n\n\u0001\ng34\n2\n2\n24m\nL\n+\nβ(25m\n+\n36s)\n.\n846πm2 sβ 2\n\n(A.77)\n\nThe annihilation cross-section of two KK quarks into SM quarks of different flavor\nσ(q1 q̄1 → q ′ q̄ ′ ) =\n\ng34 (s + 2m2 )\n54πs2 β\n\n(A.78)\n\n−\n ̄\ncan be obtained from σ(l+\nR1 lR1 → f f ) by multiplying with the following group factor [80]\n\n1 1 \u0010 a b\u0011 \u0010 b a\u0011 1\n1 1\n2\ntr t t tr t t = C(r)2 δab δab = * * 8 = .\n33\n9\n9 4\n9\n\n(A.79)\n\nHere C(r) = 1/2 is the quadratic Casimir operator for the fundamental representation of\nSU (3). KK quark annihilation into same flavor SM quarks is given by\nσ(q1 q1 → qq) =\n\n\u0001\ng34\n2m2 (4s − 5m2 )L + (6s − 5m2 )sβ .\n2\n2\n2\n432πm s β\n\n(A.80)\n\nIn this process, there are three terms in the squared matrix element since we have both\n±\n± ±\nt- and u-channel diagrams. This process also has an analogy with σ(l±\nR1 lR1 → l l ).\n\n– 30 –\n\n\fHowever, each term gets a different group factor. The squares of the t- and u-channel\ndiagrams get the same factor of 2/9 but for the cross term we obtain [80]\n\u0013\n\u0012 \u00132 \u0010\n\u0012\n\u0011\n1\n1\n1\na b a b\ntr t t t t =\nC2 (2) − C2 (G) tr (ta ta )\n3\n9\n2\n\u0012\n\u0013\n1 4 3 4\n2\n2\n=\n−\n=− =−\n.\n9 3 2 3\n9\n27\n\n(A.81)\n\nFor q1 q̄1 annihilation into same flavor SM quarks we get\nσ(q1 q̄1 → q q̄) =\n\n\u0001\ng34\n4m2 (4s − 3m2 )L + β(32m4 + 33sm2 + 12s2 ) ,\n2\n2\n2\n864πm s β\n\n(A.82)\n\n−\n+ −\nwhich can also be obtained using the analogy to σ(l+\nR1 lR1 → l l ) and taking into account\ngroup factors. For the final state with gluons we have\n\nσ(q1 q̄1 → gg) =\n\n\u0001\n−g34\n4(m4 + 4sm2 + s2 )L + sβ(31m2 + 7s) .\n3\n2\n54πs β\n\n(A.83)\n\nFor different quark flavors in the initial state, we have\nσ(q1 q1′ → qq ′ ) =\nσ(q1 q̄1′ → q q̄ ′ ) =\n\ng34 (4s − 3m2 )\n,\n288πm2 sβ\n\n\u0001\ng34\n8m2 L + β(9m2 + 4s) .\n2\n2\n288πm sβ\n\n(A.84)\n(A.85)\n\n± ′∓\n± ′±\n′±\nThe above two cross-sections can be obtained from σ(l±\nR1 l R1 → l l ) and σ(lR1 l R1 →\nl± l′ ∓ ), correspondingly, by multiplying with the group factor 2/9. The remaining crosssections are\n\n ̄ ,\nσ(q1 q̄1′ → q q̄ ′ ) = σ(uR1 d ̄R1 → ud)\n= σ(uR1 dL1 → ud) ,\n\n(A.86)\n\n= σ(uR1 uL1 → uu) ,\nand\nσ(q1 q1′ → qq ′ ) = σ(uR1 dR1 → ud) ,\n ̄ ,\n= σ(uR1 d ̄L1 → ud)\n\n(A.87)\n\n= σ(uR1 ūL1 → uū) .\n\nA.5 Quarks and Leptons\nThe cross-sections listed below are mediated by t- or u-channel diagrams with KK gauge\nbosons. For one KK lepton and one KK quark in the initial state, we get\nσ(lL1 uL1 → lu) =\n\n(4g12 YeL YuL − g22 )2 (4s − 3m2 )\n,\n1024πm2 sβ\n\n– 31 –\n\n(A.88)\n\n\fσ(ν1 uL1 → νu) =\n\n(4g12 YeL YuL + g22 )2 (4s − 3m2 )\n,\n1024πm2 sβ\n\n(A.89)\n\ng24 (4s − 3m2 )\n.\n256πm2 sβ\n\n(A.90)\n\nσ(lL1 uL1 → νd) =\n\n± ′±\n′±\nThese three cross-sections can be obtained from σ(l±\nR1 l R1 → l l ). For one KK lepton\nand one KK anti-quark in the initial state, we have\n\n ̄ =\nσ(ν1 ūL1 → ld)\nσ(lL1 ūL1 → lū) =\nσ(ν1 ūL1 → ν ū) =\n\n\u0001\ng24\n8m2 L + β(9m2 + 4s) ,\n2\n2\n256πm sβ\n\n\u0001\n(4g12 YeL YuL − g22 )2\n8m2 L + β(9m2 + 4s) ,\n2\n2\n1024πm sβ\n\n\u0001\n(4g12 YeL YuL + g22 )2\n8m2 L + β(9m2 + 4s) ,\n2\n2\n1024πm sβ\n\n(A.91)\n\n(A.92)\n(A.93)\n\n± ′∓\n′∓\nwhich can be obtained from σ(l±\nR1 l R1 → l l ). If one of the particles in the initial state\nis an SU (2)W -singlet fermion, only γ1 can mediate the process and the cross-sections can\nbe obtained from our previous results:\n\nσ(lR1 uL1 → lu) = σ(lL1 uR1 → lu) = σ(lR1 ūR1 → lū) ,\n= σ(lR1 l ̄′ R1 → ll ̄′ ) = σ(lR1 lL1 → ll) ,\nσ(lR1 ūL1 → lū) = σ(lL1 ūR1 → lū) = σ(lR1 uR1 → lu) ,\n= σ(lR1 l′R1 → ll′ ) = σ(lR1 ēL1 → ll̄) .\n\n(A.94)\n\n(A.95)\n\nA.6 Higgs Bosons\nThe mass terms for the KK SU (2)W -singlets appear with the wrong sign in the fermion\nLagrangian. For example, the mass term for the KK quarks leads to the following structure\nfor the mass matrix at tree level\n!\n!\nn\nm\n(ūLn (x), ūRn (x)) R\nuLn (x)\n.\n(A.96)\nn\nm −R\nuRn (x)\nThe corresponding mass eigenstates u′Ln and u′Rn have mass\nr\u0010 \u0011\nn 2\n+ m2 .\nMn =\nR\n\n(A.97)\n\nThese mass eigenstates receive different radiative corrections which lift the degeneracy [5].\nThe interaction eigenstates are related to the mass eigenstates by\n!\n!\n!\ncos α γ5 sin α\nu′Ln\nuLn\n,\n(A.98)\n=\nu′Rn\nsin α −γ5 cos α\nuRn\n\n– 32 –\n\n\fwhere α is the mixing angle between SU (2)W -singlet and SU (2)W -doublet fermions defined\nby\nm\ntan 2α =\n.\n(A.99)\nn/R\nThis mixing is very small except for the top quark. However, even with α ≈ 0 the effect\nof the rotation (A.98) is present in the Yukawa couplings through the redefinition uRn →\n−γ 5 uRn . It does not affect the gauge-fermion couplings. We use the following notation for\nKK Higgs bosons,\n!\nG+\n1\n.\n(A.100)\nH1√\n+iG1\n2\n\nWe keep only the top-Yukawa coupling and we also keep the Higgs self-coupling assuming\nmh = 120 GeV. Below we list the cross-sections associated with two KK Higgs bosons in\nthe initial state.\n1\n8e2 m2 λ2 s2w L + β{(2s + m2 )e4\nσ(H1 H1 → G+ G− ) =\n2\n64πm Sβ 2 s4w\n\u0001\n+4λm2 s2w e2 + 4λ2 m2 s4w } ,\n(A.101)\nσ(H1 H1 → HH) =\n\nσ(H1 H1 → GG) =\n\nσ(H1 H1 → ZZ) =\n\n1\n\n9λ2\n,\n32πsβ\n\n8e2 m2 λs2w c2w L + β{(2s + m2 )e4\n\u0001\n+4λm2 e2 s2w c2w + 4λ2 m2 s4w c4w } ,\n\n128πm2 sβ 2 s4w c4w\n\n\u0001\ng24\n2\n2\n2\nsβ(s\n+\n4m\n)\n+\n4m\n(s\n−\n2m\n)L\n,\n64πs3 β 2 c4w\n\nσ(H1 H1 → W + W − ) =\n\n(A.102)\n\n\u0001\ng24\n2\n2\n2\nsβ(s\n+\n4m\n)\n+\n4m\n(s\n−\n2m\n)L\n,\n32πs3 β 2 c4w\n\nσ(H1 H1 → tt̄) =\n\n\u0001\n3yt4\n−(s + 2m2 )L − 2sβ ,\n2\n2\n16πs β\n\n(A.103)\n(A.104)\n(A.105)\n(A.106)\n\n1\n−16e2 m2 λs2w c2w L\n128πm2 sβ 2 s4w c4w\n\u0001\n+ β{(2s + m2 )e4 − 8λm2 e2 s2w c2w + 16λ2 m2 s4w c4w } , (A.107)\n\n+\n+ +\nσ(G+\n1 G1 → G G ) =\n\n−\nσ(G+\n1 G1 → tt̄) =\n\n1\n72s4w c2w yt2 (−3sc2w yt2 − 4m2 e2 )L − 432sβs4w c4w yt4\n1152πs2 β 2 s4w c4w\n\u0001\n+ sβ 3 (20s4w − 12s2w + 9)e4 − 144sβs4w c2w yt2 e2 ,\n(A.108)\n\n−\nσ(G+\n1 G1 → bb̄) =\n\n1\n72s2w c2w yt2 (−3ss2w c2w yt2 + e2 m2 (4s2w − 3))L\n1152πs2 β 2 s4w c4w\n−432sβs4w c4w yt4 + sβ 3 (20s4w − 24s2w + 9)e4\n(A.109)\n\u0001\n−36sβs2w yt2 e2 (4s4w − 7s2w + 3) ,\n\n– 33 –\n\n\f−1\n6m2 e2 s(e2 + 4λs2w c2w )L − 48λ2 m2 ss4w c4w\n192πm2 s2 β 2 s4w c4w\n\u0001\n+ β{e4 (m4 − 7sm2 − 3s2 ) − 12λm2 ss2w c2w e2 } ,\n(A.110)\n\n−\n+ −\nσ(G+\n1 G1 → G G ) =\n\n−\nσ(G+\n1 G1 → GH) =\n\n1\n8s2w m2 e2 λL + β{(2s + m2 )e4\n128πm2 sβ 2 s4w\n\u0001\n+4λs2w m2 e2 + 4λ2 m2 s4w } ,\n\ngZ4\n24m2 c2w sL − β{4(1 − 2s2w )2 m4\n48πm2 s2 β 2\n\u0001\n+ s(92s4w − 140s2w + 47) − 24s2 c4w } ,\n\n(A.111)\n\n−\nσ(G+\n1 G1 → GH) =\n\n−\nσ(G+\n1 G1 → ZZ) =\n−\nσ(G+\n1 G1 → γZ) =\n\n\u0001\ngZ4 (1 − 2s2w )4\n2\n2\n2\n4m\n(s\n−\n2m\n)L\n+\nsβ(s\n+\n4m\n)\n,\n4πs3 β 2\n\n\u0001\ne2 gZ2 (1 − 2s2w )2\n4m2 (s − 2m2 )L + sβ(s + 4m2 ) ,\n3\n2\n2πs β\n\n−\nσ(G+\n1 G1 → γγ) =\n\n\u0001\ne4\n4m2 (s − 2m2 )L + sβ(s + 4m2 ) ,\n3\n2\n4πs β\n\n−\n+\n−\nσ(G+\n1 G1 → W W ) =\n\n\u0001\ng24\n6m2 L + β(s + 11m2 ) ,\n2\n2\n24πs β\n\n−\n ̄\nσ(G+\n1 G1 → f f) =\n\n\u0001\nNc gZ4 β 2\n2\nĝL + ĝR\n,\n24πs\n\n(A.112)\n(A.113)\n(A.114)\n(A.115)\n(A.116)\n(A.117)\n\nwhere f represents leptons and first two generations of quarks and\n2\nĝL(R)\n= −e2 Qf − 2gZ2 (1 − 2s2w )(Tf3 − Qf s2w ).\n\nA number of cross-sections can be simply related:\nσ(G1 G1 → G+ G− ) = σ(H1 H1 → G+ G− ) ,\nσ(G1 G1 → GG) = σ(H1 H1 → HH) ,\n\nσ(G1 G1 → HH) = σ(H1 H1 → GG) ,\nσ(G1 G1 → ZZ) = σ(H1 H1 → ZZ) ,\n\nσ(G1 G1 → W + W − ) = σ(H1 H1 → W + W − ) ,\nσ(G1 G1 → tt̄) = σ(H1 H1 → tt̄) ,\n\n−\n+ −\nσ(G+\n1 G1 → GG) = σ(G1 G1 → HH) ,\n\n−\n+ −\nσ(G+\n1 G1 → HH) = σ(G1 G1 → GG) ,\n1\n= σ(H1 H1 → G+ G− ) .\n2\n\n– 34 –\n\n(A.118)\n\n\fThe rest of the cross-sections are\n1\n\nσ(H1 G1 → HG) =\n\n192πm2 s2 β 2 s4w c4w\n4\n2\n\n6m2 e2 s(e2 − 2λs2w c2w )L\n\n−β{(m − 7sm − 3s2 )e4\n+6λm\n\nσ(H1 G1 → G+ G− ) =\n\nσ(H1 G1 → W + W − ) =\nσ(H1 G1 → tt̄) =\n+\n\n2\n\nss2w c2w e4\n\n2\n\n− 12λ m\n\n2\n\n(A.119)\nss4w c4w }\n\n\u0001\n\n,\n\ngZ4\n24m2 c2w sL + β{−4(1 − 2s2w )2 m4\n48πm2 s2 β 2\n\u0001\n+sm2 (−92s4w + 140s2w − 47) + 24s2 c4w } ,\n\n\u0001\ng24\n12m2 (2m2 + s)L + sβ(32m2 + s) ,\n3\n2\n96πs β\n1\n\n288πs2 β 2 c2w s2w\nβ{−54syt4 c2w s2w\n\n(A.120)\n(A.121)\n\n−54yt2 (e2 m2 + c2w s2w (s − 2m2 )yt2 )L\n\u0001\n− 27e2 yt2 s + e2 gZ2 sβ 2 (32s4w − 24s2w + 9)} ,(A.122)\n\n\u0001\nNc βgZ2 2\n2\nḡL + ḡR\n,\nσ(H1 G1 → f f ̄) =\n24πs\n\n(A.123)\n\n1\n\n6m2 e2 s(e2 − 2λs2w )L − 12λ2 m2 ss4w\n\u0001\n− β{(m − 7sm − 3s2 )e4 + 6λm2 ss2w e4 } ,\n(A.124)\n\n+\nσ(H1 G+\n1 → HG ) =\n\n192πm2 s2 β 2 s4w\n4\n2\n\n+\nσ(H1 G+\n1 → GG ) =\n\ngZ4\n12m2 (1 − 2s2w )(2 − 32w )L\n48πm2 s2 β 2\n−β{(4m4 + 47sm2 − 24s2 )c4w\n\n(A.125)\n\n\u0001\n−24(m2 − s)ss2w c2w − 3s(m2 + 4s)s4w } ,\n\ngZ4\n6m2 L{(1 − 2s2w )(4m2 − 2ss2w + s) + s}\n6πs3 β 2\n\u0001\n+ sβ{4s4w (s + 11m2 ) + (1 − 2s2w )(s + 32m2 )} ,\n\n+\nσ(H1 G+\n1 → ZW ) =\n\n+\nσ(H1 G+\n1 → γW ) =\n\nσ(H1 G+\n1 → tb̄) =\n\n\u0001\ne2 g22\n2\n2\n6m\nL\n+\nβ(11m\n+\ns)\n,\n24πs2 β 2\n\n(A.126)\n(A.127)\n\n1\n\n−6s2w (2e2 m2 + ss2w yt2 )yt2 L\n\u0001\n+ β{sβ e − 6ss4w yt2 e2 − 12ss4w yt4 } ,\n64πs2 β 2 s4w\n2 4\n\n4\n ̄′ ) = Nc g2 β ,\nσ(H1 G+\n→\nf\nf\n1\n192πs\n\n– 35 –\n\n(A.128)\n(A.129)\n\n\f+\n+\n+\nσ(G1 G+\n1 → GG ) = σ(H1 G1 → HG ) ,\n\n+\n+\n+\nσ(G1 G+\n1 → HG ) = σ(H1 G1 → GG ) ,\n\n+\n+\n+\nσ(G1 G+\n1 → ZW ) = σ(H1 G1 → ZW ) ,\n\nσ(G1 G+\n1\n\nσ(H1 G+\n1\n+\nσ(H1 G1\n\n+\n\n→ γW ) =\n→ f f ̄′ ) =\n\nσ(G1 G+\n1\n\n(A.130)\n\n+\n\n→ γW ) ,\n→ f f ̄′ ) .\n\nA.7 Higgs Bosons and Gauge Bosons\nThe cross-sections involving one KK Higgs boson and one KK gauge boson are given below.\nThey are rather simple compared to the cross-sections from Section A.6.\nσ(H1 g1 → tt̄) =\n\n\u0001\ng32 yt2\n2\n2\n2\n2m\n(s\n−\nm\n)L\n+\n(2s\n−\n5m\n)sβ\n,\n48πm2 s2 β 2\ng24\n(L + 4β) ,\n96πc2w sβ 2\n\nσ(H1 Z1 → ZH) =\nσ(H1 Z1 → W − G+ ) =\nσ(H1 Z1 → tt̄) =\n\n\u0001\ng24\n4m2 L + sβ(4s + m2 ) ,\n2\n2\n2\n96πm s β\n\n\u0001\ng22 yt2\n2m2 L + (4s − 11m2 )β ,\n2\n2\n64πm sβ\n\n+\nσ(G+\n1 Z1 → ZG ) =\n\n(A.136)\n\n(A.138)\n\ng12 g22\n(L + 4β) ,\n96πsβ 2\n\n(A.139)\n(A.140)\n\ng12 g22 (1 − 2s2w )2\n(L + 4β) ,\n96πc2w sβ 2\n\n(A.141)\n\ne2 g12\n(L + 4β) ,\n24πsβ 2\n\n(A.142)\n\n+\nσ(G+\n1 γ1 → γG ) =\n+\n+\n+\nσ(G+\n1 W1 → G W ) =\n\n(A.137)\n\ng12 g22\n(L + 4β) ,\n96πc2w sβ 2\n\n\u0001\ng12 yt2\n−2m2 (7s + 8m2 )L + (4s − 43m2 )sβ ,\n2\n2\n2\n2\n576πm cw s β\n\n+\nσ(G+\n1 γ1 → ZG ) =\n\n(A.134)\n\ne2 g22\n(L + 4β) ,\n24πsβ 2\n\nσ(G1 γ1 → W − G+ ) =\nσ(H1 γ1 → tt̄) =\n\n(A.133)\n\n(A.135)\n\n\u0001\ng22 yt2\n2m2 L + (4s − 11m2 )β ,\n2\n2\n64πm sβ\n\nσ(H1 γ1 → ZH) =\n\n(A.132)\n\ng24 (1 − 2s2w )2\n(L + 4β) ,\n96πc2w sβ 2\n\n+\nσ(G+\n1 Z1 → γG ) =\n\nσ(G+\n1 Z1 → tb̄) =\n\n(A.131)\n\n\u0001\ng24\n2\n2\n12m\nL\n+\nβ(6m\n+\n5s)\n,\n96πm2 sβ 2\n\n– 36 –\n\n(A.143)\n\n\fσ(H1 W1+ → G+ Z) =\n\ng24\nm2 (2 − s2w − 2s4w )L\n96πm2 sβ 2 c2w\n\u0001\n−β{m2 (4s4w − s2w + 1) + (3s4w − 7s2w + 4)} ,\n\nσ(H1 W1+ → G+ γ) =\n\n\u0001\ng12 e2\n−2m2 L + β(4m2 + 3s) ,\n2\n2\n96πm sβ\n\nσ(H1 W1+ → HW + ) =\n+\n+ −\nσ(G−\n1 W1 → W G ) =\n\n+\nσ(G−\n1 W1 → ZG) =\n\n\u0001\ng24\n2\n2\n−2m\nL\n+\nβ(4m\n+\n3s)\n,\n96πm2 sβ 2\n\n(A.145)\n\n(A.146)\n\n(A.147)\n\ng24\nm2 (12s4w − 15s2w + 4)L\n96πm2 sβ 2 c2w\n\u0001\n+β{(6s4w − 3s2w + 1)m2 + s(5s4w − 9s2w + 4)} , (A.148)\n\n+\nσ(G−\n1 W1 → γG) =\n\n+\nσ(G−\n1 W1 → tt̄) =\n\ng24\n(L + 4β) ,\n96πsβ 2\n\n(A.144)\n\n\u0001\ng22 e2\n12m2 L + β(6m2 + 5s) ,\n2\n2\n96πm sβ\n\n\u0001\ng22\n−4m2 yt2 L + β{e2 m2 + 2(4s − 11m2 )yt2 } ,\n2\n2\n64πm sβ\n\n(A.149)\n\n(A.150)\n\nwhere yt is the top quark Yukawa coupling. The cross-sections listed below are obtained\nfrom our previous calculations. For one KK Higgs boson and one KK gluon we get\nσ(H1 g1 → tt̄) = σ(G1 g1 → tt̄) ,\n\n= σ(G+\n1 g1 → tb̄) .\n\n(A.151)\n\nFor one KK Higgs boson and one Z1 we have\nσ(H1 Z1 → ZH) = σ(G1 Z1 → ZH) ,\n\nσ(H1 Z1 → W − G+ ) = σ(G1 Z1 → W − G+ ) ,\n+\n= σ(G+\n1 Z1 → W G) ,\n\n+\n= σ(G+\n1 Z1 → W H) ,\n\n= σ(W1+ H1 → W + G) ,\n=\n\nσ(W1+ H1\n\n+\n\n→ W H) ,\n\nσ(H1 Z1 → tt̄) = σ(G1 Z1 → tt̄) ,\n\n+\nσ(G+\n1 Z1 → tb̄) = σ(H1 W1 → tb̄) ,\n\n= σ(G1 W1+ → tb̄) .\n\n– 37 –\n\n(A.152)\n\n\fFor one KK Higgs boson and one γ1 we obtain\nσ(H1 γ1 → ZH) = σ(G1 γ1 → ZG) ,\n\nσ(G1 γ1 → W − G+ ) = σ(H1 γ1 → W − G+ ) ,\n+\n= σ(G+\n1 γ1 → W G) ,\n\n+\n= σ(G+\n1 γ1 → W H) ,\n\n(A.153)\n\nσ(H1 γ1 → tt̄) = σ(G1 γ1 → tt̄) ,\n\n= σ(G+\n1 γ1 → tb̄) .\n\nFor one KK Higgs boson and one W1± , we get\nσ(H1 W1+ → G+ Z) = σ(G1 W1+ → G+ Z) ,\nσ(H1 W1+ → G+ γ) = σ(G1 W1+ → G+ γ) ,\n\nσ(H1 W1+ → HW + ) = σ(G1 W1+ → GW + ) ,\n+\nσ(G−\n1 W1 → ZG)\n+\nσ(G−\n1 W1 → γG)\n\n=\n\n=\n\n+\nσ(G−\n1 W1\n+\nσ(G−\n1 W1\n\n(A.154)\n\n→ ZH) ,\n→ γH) .\n\nA.8 Higgs Bosons and Fermions\nFor the cross-sections between one KK Higgs boson and one KK SU (2)W -singlet fermion,\nwe have\ng14 Yf2\n\u0001\nm2 L + sβ ,\n(A.155)\nσ(H1 fR1 → f G) =\n2\n2\n32πm sβ\nσ(H1 tR1 → gt) = −\n\ng32 yt2\n(2L + 3β) ,\n48πsβ 2\n\n(A.156)\n\n1\n12c2w e2 m2 yt2 + m2 L{+12c2w (m2 − s)yt2 e2\n288πm2 s2 β 2 c2w\n\u0001\n+ 9c4w (m2 − s)yt2 + 4se4 } + sβ{4se4 − 9c4w m2 yt4 } ,\n(A.157)\n\n+\nσ(G+\n1 tR1 → tG ) =\n\nσ(H1 fR1 → f G) = σ(G1 fR1 → f H) ,\n\n+\n= σ(G+\n1 fR1 → f G ) ,\n\n−\n= σ(G−\n1 fR1 → f G ) ,\n\nσ(H1 tR1 → gt) = σ(H1 tL1 → gt) ,\n\n(A.158)\n\n= σ(G1 tR1 → gt) ,\n\n= σ(G−\n1 tR1 → gb) ,\n1\n= σ(G+\n1 bL1 → gt) .\n2\nFor the cross-sections between one KK Higgs boson and one KK SU (2)W -doublet fermion,\nwe get\ne2 (Tf3 cw g2 − 2g1 sw Yf )2\n\u0001\nm2 L + sβ ,\n(A.159)\nσ(H1 fL1 → Gf ) =\n2\n2\n2\n2\n128πm sw cw sβ\n\n– 38 –\n\n\fσ(H1 f1+ → f − G+ ) =\n+\nσ(G+\n1 tL1 → tG ) =\n\n\u0001\ng24\nm2 L + sβ ,\n2\n2\n64πm sβ\n\n(A.160)\n\n\u0001\n\u0001\ne2 (cw g2 − 2g1 sw Yf )2\nyt4\n2\nm2 L + sβ , (A.161)\nm\nL\n+\nsβ\n+\n2\n2\n2\n2\n2\n2\n128πm sw cw sβ\n32πs β\n+\nσ(G+\n1 tL1 → tW ) = −\n\ng22 yt2 L\n,\n32πsβ 2\n\n\u0001\ne2 (cw g2 − 2g1 sw Yf )2\nm2 L + sβ\n2\n2\n2\n2\n128πm sw cw sβ\n1\ny 2 L{se2 (c2w − 2s2w Yb )\n+\n2\n32πcw s2w s2 β 2 t\n\u0001\n+c2w s2w (s − m2 )yt2 − s2w c2w sβ 2 yt2 } ,\n\n(A.162)\n\n−\nσ(G−\n1 bL1 → bG ) =\n\n(A.163)\n\nwhere Tf3 denotes the fermion isospin.\n\n1\n+\nσ(G+\n1 tL1 → tW ) ,\n2\n→ Gf ) = σ(G1 fL1 → Hf ) ,\n\nσ(H1 bL1 → Gf ) =\nσ(H1 fL1\n\n±\n= σ(G±\n1 fL1 → G f ) ,\n\nσ(H1 f1+ → f − G+ ) = σ(H1 f1− → f + G− ) ,\n= σ(G1 f1+ → f − G+ ) ,\n=\n\n=\n=\n\n(A.164)\n\nσ(G1 f1− → f + G− ) ,\n−\n+\nσ(G+\n1 f1 → f G) ,\n+\n−\nσ(G−\n1 f1 → f G) ,\n\nwhere f stands for any lepton or quark, except tL1 and bL1 , and f + (f − ) denotes isospin\n+1/2 (isospin −1/2) fermions.\n\nReferences\n[1] D. J. H. Chung, L. L. Everett, G. L. Kane, S. F. King, J. Lykken and L. T. Wang, \"The soft\nsupersymmetry-breaking Lagrangian: Theory and applications,\" Phys. Rept. 407, 1 (2005)\n[arXiv:hep-ph/0312378].\n[2] G. Jungman, M. Kamionkowski and K. Griest, \"Supersymmetric dark matter,\" Phys. Rept.\n267, 195 (1996) [arXiv:hep-ph/9506380].\n[3] T. Appelquist, H. C. Cheng and B. A. Dobrescu, \"Bounds on universal extra dimensions,\"\nPhys. Rev. D 64, 035002 (2001) [arXiv:hep-ph/0012100].\n[4] H. C. Cheng, K. T. Matchev and M. Schmaltz, \"Bosonic supersymmetry? Getting fooled at\nthe LHC,\" Phys. Rev. D 66, 056006 (2002) [arXiv:hep-ph/0205314].\n[5] H. C. Cheng, K. T. Matchev and M. Schmaltz, \"Radiative corrections to Kaluza-Klein\nmasses,\" Phys. Rev. D 66, 036005 (2002) [arXiv:hep-ph/0204342].\n\n– 39 –\n\n\f[6] G. Servant and T. M. Tait, \"Is the lightest Kaluza-Klein particle a viable dark matter\ncandidate?,\" Nucl. Phys. B 650, 391 (2003) [arXiv:hep-ph/0206071].\n[7] H. C. Cheng and I. Low, \"TeV symmetry and the little hierarchy problem,\" JHEP 0309,\n051 (2003) [arXiv:hep-ph/0308199].\n[8] H. C. Cheng and I. Low, \"Little hierarchy, little Higgses, and a little symmetry,\" JHEP\n0408, 061 (2004) [arXiv:hep-ph/0405243].\n[9] J. Hubisz and P. Meade, \"Phenomenology of the littlest Higgs with T-parity,\" Phys. Rev. D\n71, 035016 (2005) [arXiv:hep-ph/0411264].\n[10] M. Kakizaki, S. Matsumoto, Y. Sato and M. Senami, \"Significant effects of second KK\nparticles on LKP dark matter physics,\" Phys. Rev. D 71, 123522 (2005)\n[arXiv:hep-ph/0502059].\n[11] M. Kakizaki, S. Matsumoto, Y. Sato and M. Senami, \"Relic Abundance of LKP Dark\nMatter in UED model including Effects of Second KK Resonances,\" arXiv:hep-ph/0508283.\n[12] F. Burnell, G. Kribs, arXiv:hep-ph/0509118.\n[13] N. Arkani-Hamed, H. C. Cheng, B. A. Dobrescu and L. J. Hall, \"Self-breaking of the\nstandard model gauge symmetry,\" Phys. Rev. D 62, 096006 (2000) [arXiv:hep-ph/0006238].\n[14] P. Bucci and B. Grzadkowski, \"The effective potential and vacuum stability within universal\nextra dimensions,\" Phys. Rev. D 68, 124002 (2003) [arXiv:hep-ph/0304121].\n[15] P. Bucci, B. Grzadkowski, Z. Lalak and R. Matyszkiewicz, \"Electroweak symmetry breaking\nand radion stabilization in universal extra dimensions,\" JHEP 0404, 067 (2004)\n[arXiv:hep-ph/0403012].\n[16] T. Appelquist, B. A. Dobrescu, E. Ponton and H. U. Yee, \"Neutrinos vis-a-vis the\nsix-dimensional standard model,\" Phys. Rev. D 65, 105019 (2002) [arXiv:hep-ph/0201131].\n[17] R. N. Mohapatra and A. Perez-Lorenzana, \"Neutrino mass, proton decay and dark matter\nin TeV scale universal extra dimension models,\" Phys. Rev. D 67, 075015 (2003)\n[arXiv:hep-ph/0212254].\n[18] T. Appelquist, B. A. Dobrescu, E. Ponton and H. U. Yee, \"Proton stability in six\ndimensions,\" Phys. Rev. Lett. 87, 181802 (2001) [arXiv:hep-ph/0107056].\n[19] B. A. Dobrescu and E. Poppitz, \"Number of fermion generations derived from anomaly\ncancellation,\" Phys. Rev. Lett. 87, 031801 (2001) [arXiv:hep-ph/0102010].\n[20] B. A. Dobrescu and E. Ponton, \"Chiral compactification on a square,\" JHEP 0403, 071\n(2004) [arXiv:hep-th/0401032].\n[21] G. Burdman, B. A. Dobrescu and E. Ponton, \"Six-dimensional gauge theory on the chiral\nsquare,\" arXiv:hep-ph/0506334.\n[22] H. Georgi, A. K. Grant and G. Hailu, \"Brane couplings from bulk loops,\" Phys. Lett. B\n506, 207 (2001) [arXiv:hep-ph/0012379].\n[23] G. von Gersdorff, N. Irges and M. Quiros, \"Bulk and brane radiative effects in gauge\ntheories on orbifolds,\" Nucl. Phys. B 635, 127 (2002) [arXiv:hep-th/0204223].\n[24] H. C. Cheng, \"Universal extra dimensions at the e- e- colliders,\" Int. J. Mod. Phys. A 18,\n2779 (2003) [arXiv:hep-ph/0206035].\n\n– 40 –\n\n\f[25] M. Battaglia, A. Datta, A. De Roeck, K. Kong and K. T. Matchev, \"Contrasting\nsupersymmetry and universal extra dimensions at the CLIC multi-TeV e+ e- collider,\"\nJHEP 0507, 033 (2005) [arXiv:hep-ph/0502041].\n[26] G. Bhattacharyya, P. Dey, A. Kundu and A. Raychaudhuri, \"Probing universal extra\ndimension at the International Linear Collider,\" Phys. Lett. B 628, 141 (2005)\n[arXiv:hep-ph/0502031].\n[27] S. Riemann, \"Z ′ signals from Kaluza-Klein dark matter,\" arXiv:hep-ph/0508136.\n[28] B. Bhattacherjee and A. Kundu, \"The International Linear Collider as a Kaluza-Klein\nfactory,\" Phys. Lett. B 627, 137 (2005) [arXiv:hep-ph/0508170].\n[29] T. G. Rizzo, \"Probes of universal extra dimensions at colliders,\" Phys. Rev. D 64, 095010\n(2001) [arXiv:hep-ph/0106336].\n[30] C. Macesanu, C. D. McMullen and S. Nandi, \"Collider implications of universal extra\ndimensions,\" Phys. Rev. D 66, 015009 (2002) [arXiv:hep-ph/0201300].\n[31] A. J. Barr, \"Determining the spin of supersymmetric particles at the LHC using lepton\ncharge asymmetry,\" Phys. Lett. B 596, 205 (2004) [arXiv:hep-ph/0405052].\n[32] J. M. Smillie and B. R. Webber, \"Distinguishing Spins in Supersymmetric and Universal\nExtra Dimension Models at the Large Hadron Collider,\" JHEP 0510, 069 (2005)\n[arXiv:hep-ph/0507170].\n[33] M. Battaglia, A. K. Datta, A. De Roeck, K. Kong and K. T. Matchev, \"Contrasting\nsupersymmetry and universal extra dimensions at colliders,\" arXiv:hep-ph/0507284.\n[34] A. Datta, K. Kong and K. T. Matchev, \"Discrimination of supersymmetry and universal\nextra dimensions at hadron colliders,\" arXiv:hep-ph/0509246.\n[35] A. Datta, G. L. Kane and M. Toharia, \"Is it SUSY?,\" arXiv:hep-ph/0510204.\n[36] A. J. Barr, \"Measuring slepton spin at the LHC,\" arXiv:hep-ph/0511115.\n[37] K. Agashe, N. G. Deshpande and G. H. Wu, \"Can extra dimensions accessible to the SM\nexplain the recent measurement of anomalous magnetic moment of the muon?,\" Phys. Lett.\nB 511, 85 (2001) [arXiv:hep-ph/0103235].\n[38] K. Agashe, N. G. Deshpande and G. H. Wu, \"Universal extra dimensions and b → s\ngamma,\" Phys. Lett. B 514, 309 (2001) [arXiv:hep-ph/0105084].\n[39] T. Appelquist and B. A. Dobrescu, \"Universal extra dimensions and the muon magnetic\nmoment,\" Phys. Lett. B 516, 85 (2001) [arXiv:hep-ph/0106140].\n[40] F. J. Petriello, \"Kaluza-Klein effects on Higgs physics in universal extra dimensions,\" JHEP\n0205, 003 (2002) [arXiv:hep-ph/0204067].\n[41] T. Appelquist and H. U. Yee, \"Universal extra dimensions and the Higgs boson mass,\"\nPhys. Rev. D 67, 055002 (2003) [arXiv:hep-ph/0211023].\n[42] D. Chakraverty, K. Huitu and A. Kundu, \"Effects of universal extra dimensions on B0 anti-B0 mixing,\" Phys. Lett. B 558, 173 (2003) [arXiv:hep-ph/0212047].\n[43] A. J. Buras, M. Spranger and A. Weiler, \"The impact of universal extra dimensions on the\nunitarity triangle and rare K and B decays,\" Nucl. Phys. B 660, 225 (2003)\n[arXiv:hep-ph/0212143].\n\n– 41 –\n\n\f[44] J. F. Oliver, J. Papavassiliou and A. Santamaria, \"Universal extra dimensions and Z → bb̄,\"\nPhys. Rev. D 67, 056002 (2003) [arXiv:hep-ph/0212391].\n[45] A. J. Buras, A. Poschenrieder, M. Spranger and A. Weiler, \"The impact of universal extra\ndimensions on B → X/s gamma, B → X/s gluon, B → X/s mu+ mu-, K(L) → pi0 e+ e-,\nand epsilon'/epsilon,\" Nucl. Phys. B 678, 455 (2004) [arXiv:hep-ph/0306158].\n[46] E. O. Iltan, \"The μ → eγ and τ → μγ decays in the general two Higgs doublet model with\nthe inclusion of one universal extra dimension,\" JHEP 0402, 065 (2004)\n[arXiv:hep-ph/0312311].\n[47] S. Khalil and R. Mohapatra, \"Flavor violation and extra dimensions,\" Nucl. Phys. B 695,\n313 (2004) [arXiv:hep-ph/0402225].\n[48] K. R. Dienes, E. Dudas and T. Gherghetta, \"Grand unification at intermediate mass scales\nthrough extra dimensions,\" Nucl. Phys. B 537, 47 (1999) [arXiv:hep-ph/9806292].\n[49] D. Majumdar, \"Relic densities for Kaluza-Klein dark matter,\" Mod. Phys. Lett. A 18, 1705\n(2003).\n[50] H. C. Cheng, J. L. Feng and K. T. Matchev, \"Kaluza-Klein dark matter,\" Phys. Rev. Lett.\n89, 211301 (2002) [arXiv:hep-ph/0207125].\n[51] G. Servant and T. M. Tait, \"Elastic scattering and direct detection of Kaluza-Klein dark\nmatter,\" New J. Phys. 4, 99 (2002) [arXiv:hep-ph/0209262].\n[52] D. Majumdar, \"Detection rates for Kaluza-Klein dark matter,\" Phys. Rev. D 67, 095010\n(2003) [arXiv:hep-ph/0209277].\n[53] D. Hooper and G. D. Kribs, \"Probing Kaluza-Klein dark matter with neutrino telescopes,\"\nPhys. Rev. D 67, 055003 (2003) [arXiv:hep-ph/0208261].\n[54] G. Bertone, G. Servant and G. Sigl, \"Indirect detection of Kaluza-Klein dark matter,\" Phys.\nRev. D 68, 044008 (2003) [arXiv:hep-ph/0211342].\n[55] D. Hooper and G. D. Kribs, \"Kaluza-Klein dark matter and the positron excess,\" Phys.\nRev. D 70, 115004 (2004) [arXiv:hep-ph/0406026].\n[56] L. Bergstrom, T. Bringmann, M. Eriksson and M. Gustafsson, \"Gamma rays from\nKaluza-Klein dark matter,\" Phys. Rev. Lett. 94, 131301 (2005) [arXiv:astro-ph/0410359].\n[57] E. A. Baltz and D. Hooper, \"Kaluza-Klein dark matter, electrons and gamma ray\ntelescopes,\" JCAP 0507, 001 (2005) [arXiv:hep-ph/0411053].\n[58] L. Bergstrom, T. Bringmann, M. Eriksson and M. Gustafsson, \"Two photon annihilation of\nKaluza-Klein dark matter,\" JCAP 0504, 004 (2005) [arXiv:hep-ph/0412001].\n[59] T. Bringmann, \"High-energetic cosmic antiprotons from Kaluza-Klein dark matter,\" JCAP\n0508, 006 (2005) [arXiv:astro-ph/0506219].\n[60] A. Barrau, P. Salati, G. Servant, F. Donato, J. Grain, D. Maurin and R. Taillet,\n\"Kaluza-Klein dark matter and galactic antiprotons,\" Phys. Rev. D 72, 063507 (2005)\n[arXiv:astro-ph/0506389].\n[61] A. Birkedal, K. T. Matchev, M. Perelstein and A. Spray, \"Robust gamma ray signature of\nWIMP dark matter,\" arXiv:hep-ph/0507194.\n\n– 42 –\n\n\f[62] R. S. Chivukula, D. A. Dicus, H. J. He and S. Nandi, \"Unitarity of the higher dimensional\nstandard model,\" Phys. Lett. B 562, 109 (2003) [arXiv:hep-ph/0302263].\n[63] A. Muck, L. Nilse, A. Pilaftsis and R. Ruckl, \"Quantization and high energy unitarity of 5D\norbifold theories with brane kinetic terms,\" Phys. Rev. D 71, 066004 (2005)\n[arXiv:hep-ph/0411258].\n[64] M. Srednicki, R. Watkins and K. A. Olive, \"Calculations Of Relic Densities In The Early\nUniverse,\" Nucl. Phys. B 310, 693 (1988).\n[65] E. W. Kolb and M. S. Turner, \"The Early Universe,\" Addison-Wesley, Redwood City, 1990.\n[66] K. Griest and D. Seckel, \"Three Exceptions In The Calculation Of Relic Abundances,\"\nPhys. Rev. D 43, 3191 (1991).\n[67] J. D. Wells, \"Annihilation cross-sections for relic densities in the low velocity limit,\"\narXiv:hep-ph/9404219.\n[68] A. B. Lahanas, D. V. Nanopoulos and V. C. Spanos, Phys. Rev. D 62, 023515 (2000)\n[arXiv:hep-ph/9909497].\n[69] A. Pukhov et al., \"CompHEP: A package for evaluation of Feynman diagrams and\nintegration over multi-particle phase space. User's manual for version 33,\"\narXiv:hep-ph/9908288.\n[70] A. Birkedal, K. Matchev and M. Perelstein, \"Dark matter at colliders: A\nmodel-independent approach,\" Phys. Rev. D 70, 077701 (2004) [arXiv:hep-ph/0403004].\n[71] K. Kong and K. Matchev, in preparation.\n[72] J. L. Feng, A. Rajaraman and F. Takayama, \"Superweakly-interacting massive particles,\"\nPhys. Rev. Lett. 91, 011302 (2003) [arXiv:hep-ph/0302215].\n[73] J. L. Feng, A. Rajaraman and F. Takayama, \"SuperWIMP dark matter signals from the\nearly universe,\" Phys. Rev. D 68, 063504 (2003) [arXiv:hep-ph/0306024].\n[74] J. L. Feng, A. Rajaraman and F. Takayama, \"Graviton cosmology in universal extra\ndimensions,\" Phys. Rev. D 68, 085018 (2003) [arXiv:hep-ph/0307375].\n[75] M. Byrne, \"Universal extra dimensions and charged LKPs,\" Phys. Lett. B 583, 309 (2004)\n[arXiv:hep-ph/0311160].\n[76] K. Agashe and G. Servant, \"Warped unification, proton stability and dark matter,\" Phys.\nRev. Lett. 93, 231805 (2004) [arXiv:hep-ph/0403143].\n[77] K. Agashe and G. Servant, \"Baryon number in warped GUTs: Model building and (dark\nmatter related) phenomenology,\" JCAP 0502, 002 (2005) [arXiv:hep-ph/0411254].\n[78] E. W. Kolb, G. Servant and T. M. P. Tait, \"The radionactive universe,\" JCAP 0307, 008\n(2003) [arXiv:hep-ph/0306159].\n[79] A. Mazumdar, R. N. Mohapatra and A. Perez-Lorenzana, \"Radion cosmology in theories\nwith universal extra dimensions,\" JCAP 0406, 004 (2004) [arXiv:hep-ph/0310258].\n[80] M. E. Peskin and D. V. Schroeder, \"An Introduction to quantum field theory,\"\nHarperCollins Publishers (1995).\n\n– 43 –\n\n\f"}