{"id": "http://arxiv.org/abs/hep-ph/0508224v2", "guidislink": true, "updated": "2006-12-18T14:12:36Z", "updated_parsed": [2006, 12, 18, 14, 12, 36, 0, 352, 0], "published": "2005-08-22T11:17:24Z", "published_parsed": [2005, 8, 22, 11, 17, 24, 0, 234, 0], "title": "Energy from the nonperturbative QCD vacuum", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0508276%2Chep-ph%2F0508293%2Chep-ph%2F0508242%2Chep-ph%2F0508140%2Chep-ph%2F0508084%2Chep-ph%2F0508161%2Chep-ph%2F0508180%2Chep-ph%2F0508173%2Chep-ph%2F0508304%2Chep-ph%2F0508237%2Chep-ph%2F0508068%2Chep-ph%2F0508060%2Chep-ph%2F0508290%2Chep-ph%2F0508103%2Chep-ph%2F0508263%2Chep-ph%2F0508126%2Chep-ph%2F0508101%2Chep-ph%2F0508277%2Chep-ph%2F0508274%2Chep-ph%2F0508227%2Chep-ph%2F0508017%2Chep-ph%2F0508286%2Chep-ph%2F0508071%2Chep-ph%2F0508130%2Chep-ph%2F0508013%2Chep-ph%2F0508033%2Chep-ph%2F0508163%2Chep-ph%2F0508160%2Chep-ph%2F0508043%2Chep-ph%2F0508203%2Chep-ph%2F0508117%2Chep-ph%2F0508089%2Chep-ph%2F0508257%2Chep-ph%2F0508032%2Chep-ph%2F0508027%2Chep-ph%2F0508315%2Chep-ph%2F0508102%2Chep-ph%2F0508308%2Chep-ph%2F0508314%2Chep-ph%2F0508256%2Chep-ph%2F0508133%2Chep-ph%2F0508100%2Chep-ph%2F0508061%2Chep-ph%2F0508216%2Chep-ph%2F0508255%2Chep-ph%2F0508159%2Chep-ph%2F0508285%2Chep-ph%2F0508078%2Chep-ph%2F0508271%2Chep-ph%2F0508112%2Chep-ph%2F0508046%2Chep-ph%2F0508296%2Chep-ph%2F0508077%2Chep-ph%2F0508079%2Chep-ph%2F0508150%2Chep-ph%2F0508224%2Chep-ph%2F0508055%2Chep-ph%2F0508205%2Chep-ph%2F0508222%2Chep-ph%2F0508116%2Chep-ph%2F0508238%2Chep-ph%2F0508108%2Chep-ph%2F0508125%2Chep-ph%2F0508247%2Chep-ph%2F0508020%2Chep-ph%2F0508268%2Chep-ph%2F0508025%2Chep-ph%2F0508002%2Chep-ph%2F0508076%2Chep-ph%2F0508235%2Chep-ph%2F0508156%2Chep-ph%2F0508034%2Chep-ph%2F0508280%2Chep-ph%2F0508212%2Chep-ph%2F0508295%2Chep-ph%2F0508052%2Chep-ph%2F0508022%2Chep-ph%2F0508201%2Chep-ph%2F0508234%2Chep-ph%2F0508016%2Chep-ph%2F0508145%2Chep-ph%2F0508209%2Chep-ph%2F0508057%2Chep-ph%2F0508162%2Chep-ph%2F0508279%2Chep-ph%2F0508206%2Chep-ph%2F0508082%2Chep-ph%2F0508261%2Chep-ph%2F0508148%2Chep-ph%2F0508015%2Chep-ph%2F0508192%2Chep-ph%2F0508258%2Chep-ph%2F0508080%2Chep-ph%2F0508196%2Chep-ph%2F0508005%2Chep-ph%2F0508202%2Chep-ph%2F0508035%2Chep-ph%2F0508309%2Chep-ph%2F0508041%2Chep-ph%2F0508124%2Chep-ph%2F0508317&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Energy from the nonperturbative QCD vacuum"}, "summary": "Using the effective potential approach for composite operators, we have\nformulated a general method of calculation of the truly nonperturbative\nYang-Mills vacuum energy density (the Bag constant apart from the sign, by\ndefinition). It is the main dynamical characteristic of the QCD ground state.\nWe define it as an integration of the truly nonperturbative effective charge\nover the nonperturbative region (soft momentum region). It is free of all types\nof the perturbative contributions, by construction. For the considered truly\nnonperturbative effective charge it is finite, negative and it has no imaginary\npart (stable vacuum), as well as it is a manifestly gauge-invariant, i.e., not\nexplicitly depending on the gauge-fixing parameter. A nontrivial minimization\nprocedure makes it possible to determine the Bag constant as a function either\nof the mass gap, which is responsible for the large-scale structure of the true\nQCD vacuum, or of the effective scale, which separates the nonperturbative\nregion from the perturbative one. We have also argued that the Bag constant is\na quant of energy density which can be released from the QCD vacuum, which, in\nits turn, is considering as an infinite and permanent reservoir of energy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0508276%2Chep-ph%2F0508293%2Chep-ph%2F0508242%2Chep-ph%2F0508140%2Chep-ph%2F0508084%2Chep-ph%2F0508161%2Chep-ph%2F0508180%2Chep-ph%2F0508173%2Chep-ph%2F0508304%2Chep-ph%2F0508237%2Chep-ph%2F0508068%2Chep-ph%2F0508060%2Chep-ph%2F0508290%2Chep-ph%2F0508103%2Chep-ph%2F0508263%2Chep-ph%2F0508126%2Chep-ph%2F0508101%2Chep-ph%2F0508277%2Chep-ph%2F0508274%2Chep-ph%2F0508227%2Chep-ph%2F0508017%2Chep-ph%2F0508286%2Chep-ph%2F0508071%2Chep-ph%2F0508130%2Chep-ph%2F0508013%2Chep-ph%2F0508033%2Chep-ph%2F0508163%2Chep-ph%2F0508160%2Chep-ph%2F0508043%2Chep-ph%2F0508203%2Chep-ph%2F0508117%2Chep-ph%2F0508089%2Chep-ph%2F0508257%2Chep-ph%2F0508032%2Chep-ph%2F0508027%2Chep-ph%2F0508315%2Chep-ph%2F0508102%2Chep-ph%2F0508308%2Chep-ph%2F0508314%2Chep-ph%2F0508256%2Chep-ph%2F0508133%2Chep-ph%2F0508100%2Chep-ph%2F0508061%2Chep-ph%2F0508216%2Chep-ph%2F0508255%2Chep-ph%2F0508159%2Chep-ph%2F0508285%2Chep-ph%2F0508078%2Chep-ph%2F0508271%2Chep-ph%2F0508112%2Chep-ph%2F0508046%2Chep-ph%2F0508296%2Chep-ph%2F0508077%2Chep-ph%2F0508079%2Chep-ph%2F0508150%2Chep-ph%2F0508224%2Chep-ph%2F0508055%2Chep-ph%2F0508205%2Chep-ph%2F0508222%2Chep-ph%2F0508116%2Chep-ph%2F0508238%2Chep-ph%2F0508108%2Chep-ph%2F0508125%2Chep-ph%2F0508247%2Chep-ph%2F0508020%2Chep-ph%2F0508268%2Chep-ph%2F0508025%2Chep-ph%2F0508002%2Chep-ph%2F0508076%2Chep-ph%2F0508235%2Chep-ph%2F0508156%2Chep-ph%2F0508034%2Chep-ph%2F0508280%2Chep-ph%2F0508212%2Chep-ph%2F0508295%2Chep-ph%2F0508052%2Chep-ph%2F0508022%2Chep-ph%2F0508201%2Chep-ph%2F0508234%2Chep-ph%2F0508016%2Chep-ph%2F0508145%2Chep-ph%2F0508209%2Chep-ph%2F0508057%2Chep-ph%2F0508162%2Chep-ph%2F0508279%2Chep-ph%2F0508206%2Chep-ph%2F0508082%2Chep-ph%2F0508261%2Chep-ph%2F0508148%2Chep-ph%2F0508015%2Chep-ph%2F0508192%2Chep-ph%2F0508258%2Chep-ph%2F0508080%2Chep-ph%2F0508196%2Chep-ph%2F0508005%2Chep-ph%2F0508202%2Chep-ph%2F0508035%2Chep-ph%2F0508309%2Chep-ph%2F0508041%2Chep-ph%2F0508124%2Chep-ph%2F0508317&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using the effective potential approach for composite operators, we have\nformulated a general method of calculation of the truly nonperturbative\nYang-Mills vacuum energy density (the Bag constant apart from the sign, by\ndefinition). It is the main dynamical characteristic of the QCD ground state.\nWe define it as an integration of the truly nonperturbative effective charge\nover the nonperturbative region (soft momentum region). It is free of all types\nof the perturbative contributions, by construction. For the considered truly\nnonperturbative effective charge it is finite, negative and it has no imaginary\npart (stable vacuum), as well as it is a manifestly gauge-invariant, i.e., not\nexplicitly depending on the gauge-fixing parameter. A nontrivial minimization\nprocedure makes it possible to determine the Bag constant as a function either\nof the mass gap, which is responsible for the large-scale structure of the true\nQCD vacuum, or of the effective scale, which separates the nonperturbative\nregion from the perturbative one. We have also argued that the Bag constant is\na quant of energy density which can be released from the QCD vacuum, which, in\nits turn, is considering as an infinite and permanent reservoir of energy."}, "authors": ["V. Gogokhia"], "author_detail": {"name": "V. Gogokhia"}, "author": "V. Gogokhia", "arxiv_comment": "10 pages, no tables, no figures, unnecessary material and references\n  have been removed", "links": [{"href": "http://arxiv.org/abs/hep-ph/0508224v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0508224v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0508224v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0508224v2", "journal_reference": null, "doi": null, "fulltext": "ENERGY FROM THE NONPERTURBATIVE QCD VACUUM\nV. Gogokhia∗\n\narXiv:hep-ph/0508224v2 18 Dec 2006\n\nHAS, CRIP, RMKI, Depart. Theor. Phys., Budapest 114, P.O.B. 49, H-1525, Hungary\n(Dated: June 26, 2018)\nUsing the effective potential approach for composite operators, we have formulated a general\nmethod of calculation of the truly nonperturbative Yang-Mills vacuum energy density (the Bag\nconstant apart from the sign, by definition). It is the main dynamical characteristic of the QCD\nground state. We define it as an integration of the truly nonperturbative effective charge over\nthe nonperturbative region (soft momentum region). It is free of all types of the perturbative\ncontributions, by construction. For the considered truly nonperturbative effective charge it is finite,\nnegative and it has no imaginary part (stable vacuum), as well as it is a manifestly gauge-invariant,\ni.e., not explicitly depending on the gauge-fixing parameter. A nontrivial minimization procedure\nmakes it possible to determine the Bag constant as a function either of the mass gap, which is\nresponsible for the large-scale structure of the true QCD vacuum, or of the effective scale, which\nseparates the nonperturbative region from the perturbative one. We have also argued that the Bag\nconstant is a quant of the energy density which can be released from the QCD vacuum, which, in\nits turn, is considering as an infinite and permanent reservoir of energy.\nPACS numbers: 11.15.Tk, 12.38.Lg\n\nI.\n\nINTRODUCTION\n\nThe Lamb shift and the Casimir effect are probably the two most famous experimental evidences of zero-point\nenergy fluctuations in the vacuum of Quantum Electrodynamics (QED) [1, 2]. The both effects are rather weak, since\nthe QED vacuum is mainly perturbative (PT) by origin, character and magnitude (the corresponding fine structure\nconstant is weak). However, even in this case there have been already made attempts to exploit the Casimir effect in\norder to release energy from the vacuum (see, for example Refs. [3, 4] and references in the above-mentioned reviews\n[1, 2]). Let us also note that in Ref. [5] by investigating the thermodynamical properties of the quantum vacuum it\nhas been concluded that no energy can be extracted cyclically from the vacuum (see, however Ref. [2] and references\ntherein).\nContrary to the QED vacuum, the vacuum of Quantum Chromodynamics (QCD) is a very complicated confining\nmedium and its dynamical and topological complexity [6, 7] means that its structure can be organized at various levels:\nclassical [6, 7, 8] and quantum [9]. It is mainly nonperturbative (NP) by origin, character and magnitude, since the\ncorresponding fine structure constant is strong. So the idea to exploit the NP QCD vacuum in order to extract energy\nfrom it seems to be more attractive. However, before to discuss the ways how to extract, it is necessary to discuss\nwhich minimum/maxmimum amount of energy at all can be released in a single cycle. The vacuum of QCD due\nto its above-mentioned dynamical and topological complexity contains many different components and ingredients.\nThey contribute to the truly NP vacuum energy density (VED), one of the main characteristics of the QCD ground\nstate. It is well known that the VED in general badly diverges in quantum field theory, in particularly QCD. Thus\nthe main problem is how to correctly define the truly NP VED which should be finite, negative and it should have\nno imaginary part (stable vacuum). Being one of the main physical characteristics of the QCD vacuum, the truly NP\nVED should not depend explicitly on the gauge-fixing parameter as well.\nLet us also remind that in order to calculate physical observables from first principles in QCD it is not enough to\nknow its Lagrangian. It is also necessary and important to know the true structure of its ground state. It is just\nthe response of the true QCD vacuum which substantially modifies all the QCD Green's functions from their free\ncounterparts. Just these full (\"dressed\") Green's functions are needed for the above-mentioned calculations.\nThe main purpose of this paper is twofold. First of all, to define correctly the truly NP VED, that is free of all\ntypes of the PT contributions (\"PT contaminations\"), as well as to make it a manifestly gauge-invariant quantity (not\nexplicitly depending on the gauge-fixing parameter). Secondly, to discuss in general terms which amount of energy\ncan be extracted from the QCD ground state, which in its turn is considering as an infinite and permanent reservoir\nof energy.\n\n∗ gogohia@rmki.kfki.hu\n\n\f2\nII.\n\nTHE VED\n\nThe quantum part of the VED is determined by the effective potential approach for composite operators [10, 11].\nIn the absence of external sources the effective potential is nothing but the VED. It is given in the form of the loops\nexpansion, where the number of the vacuum loops (consisting in general of the confining quarks and gluons properly\nregularized with the help of ghosts) is equal to the power of the Plank constant, ~.\nHere we are going to formulate a general method of numerical calculation of the quantum part of the truly NP\nYang-Mills (YM) VED in the covariant gauge QCD. The gluon part of the VED which to-leading order (log-loop level\n∼ ~) is given by the effective potential for composite operators as follows [10]:\ni\nV (D) =\n2\n\nZ\n\nd4 q\nT r{ln(D0−1 D) − (D0−1 D) + 1},\n(2π)4\n\n(2.1)\n\nwhere D(q) is the full gluon propagator and D0 (q) is its free counterpart (see below). The traces over space-time\nand color group indices are understood. Evidently, the effective potential is normalized to V (D0 ) = 0 as usual.\nNext-to-leading and higher contributions (two and more vacuum loops) are suppressed by one order of magnitude in\npowers of ~ at least, and thus are not important from the numerical point of view.\nThe two-point Green's function, describing the full gluon propagator, is\n\b\nDμν (q) = − Tμν (q)d(−q 2 , ξ) + ξLμν (q)\n\n1\n,\nq2\n\n(2.2)\n\nwhere ξ is the gauge-fixing parameter and Tμν (q) = gμν − qμ qν /q 2 = gμν − Lμν (q). Its free counterpart\n0\n(q) is obtained by putting the full gluon form factor d(−q 2 , ξ) in Eq. (2.2) simply to one, i.e.,\nD0 ≡ Dμν\n0\nDμν (q) = − {Tμν (q) + ξLμν (q)} (1/q 2 ). In order to evaluate the effective potential (2.1), on account of Eq. (2.2), we\nuse the well-known expression, namely\nT r ln(D0−1 D) = 8 × 4 ln det(D0−1 D) = 32 ln[(3/4)d(−q 2 , ξ) + (1/4)].\n\n(2.3)\n\nIt becomes zero (in accordance with the above-mentioned normalization condition) when the full gluon form factor is\nreplaced by its free counterpart.\nGoing over to four-dimensional Euclidean space in Eq. (2.1), and evaluating some numerical factors, one obtains\n(ǫg = V (D))\n1\nǫg = − 2\nπ\n\nZ\n\n2\n\ndq q\n\n2\n\n\u0014\n\n\u0015\n3\n2\nln[1 + 3d(q , ξ)] − d(q , ξ) + a ,\n4\n2\n\n(2.4)\n\nwhere constant a = (3/4) − 2 ln 2 = −0.6363 and the integration from zero to infinity is assumed. The VED ǫg derived\nin Eq. (2.4) is already colorless quantity, since it has been already summed over color indices. It does not also depend\nexplicitly on the unphysical (longitudinal) part of the full gluon propagator due to the product (D0−1 D), which in its\nturn comes from the above-mentioned normalization to zero (see above).\nHowever, it still suffers from the two serious problems. The coefficient of the transversal Lorentz structure (the\neffective charge d(q 2 , ξ)) may still depend explicitly on ξ. Also, it is badly divergent at least as the fourth power of\nthe ultraviolet (UV) cutoff, and therefore suffers from different types of the PT contributions (see below).\nIII.\n\nTHE TRULY NP VED\n\nIn order to define the VED free of all the above-mentioned problems, let us make first the identical transformation\nof the full gluon form factor (which is nothing but the effective charge) in Eq. (2.2) as follows (Euclidean signature\nalready):\nd(q 2 , ξ) = d(q 2 , ξ) − dP T (q 2 , ξ) + dP T (q 2 , ξ) = dN P (q 2 , ξ) + dP T (q 2 , ξ),\n\n(3.1)\n\nwhere dP T (q 2 , ξ) correctly describes the PT structure of the effective charge d(q 2 , ξ), including its behavior in the\nUV limit (asymptotic freedom [12]), otherwise remaining arbitrary. On the other hand, dN P (q 2 , ξ), defined by the\n\n\f3\nabove-made subtraction, is assumed to correctly reproduce the NP structure of the effective charge, including its\nasymptotic in the deep infrared (IR) limit, underlying thus the strong intrinsic influence of the IR properties of the\ntheory on its NP dynamics. Evidently, both terms are valid in the whole energy/momentum range, i.e, they are not\nasymptotics. Let us also emphasize the principle difference between d(q 2 , ξ) and dN P (q 2 , ξ). The former is the NP\nquantity \"contaminated\" by the PT contributions, while the latter one being also NP, nevertheless, is free of them.\nThus the exact separation between the truly NP effective charge dN P (q 2 , ξ) and its PT counterpart dP T (q 2 , ξ) is\nachieved (for the concrete example considered below this separation is unique as well).\nThere is also another serious reason for the subtraction (3.1). The problem is that the UV asymptotic of the full\neffective charge due to asymptotic freedom may depend on the gauge-fixing parameter, namely to leading order\nd(q 2 , ξ) ∼q2 →∞ (ln(q 2 /Λ2QCD ))c0 /b0 ,\n\n(3.2)\n\nwhere the exponent c0 /b0 explicitly depends on the gauge- fixing parameter via the coefficient c0 [12], and Λ2QCD is\nthe QCD asymptotic scale parameter. Evidently, in the decomposition (3.1) precisely the PT part of the full effective\ncharge will be responsible for this explicit dependence on the gauge choice. Subtracting it, we will be guaranteed that\nthe remaining part will not explicitly depend on the gauge-fixing parameter (see below).\nSubstituting the exact decomposition (3.1) into Eq. (2.4) and doing some trivial rearrangement, one obtains\nǫg = −\n\n1\nπ2\n\nZ\n\n\u0015\n\u0014\n3\ndq 2 q 2 ln[1 + 3dN P (q 2 , ξ)] − dN P (q 2 , ξ) + ǫP T ,\n4\n\n(3.3)\n\nwhere we introduce the following notation\n\nǫP T = −\n\n1\nπ2\n\n\u0014\ndq 2 q 2 ln[1 +\n\nZ\n\n\u0015\n3 PT 2\n3dP T (q 2 , ξ)\n]\n−\nd\n(q\n,\nξ)\n+\na\n.\n1 + 3dN P (q 2 , ξ)\n4\n\n(3.4)\n\nIt contains the contribution which is mainly determined by the PT part of the full gluon propagator, dP T (q 2 , ξ). The\nconstant a also should be included, since it comes from the normalization of the free PT vacuum to zero. However, this\nis not the whole story yet. The first term in Eq. (3.3), depending only on the truly NP effective charge, nevertheless,\nassumes the integration over the PT region (up to infinity), which should be subtracted as well. The problem is that\nthe first term in Eq. (3.3) may still be divergent in the UV limit. A priori, there is only one restriction on its UV\nasymptotic, namely do not contradict to asymptotically free behavior of the full effective charge, to leading order\nshown in Eq. (3.2). For example, if dN P (q 2 , ξ) is a linearly falling at infinity function, then the integral in Eq. (3.3)\nstill diverges as mentioned above.\n2\nIf we separate the NP region from the PT one, by introducing the so-called effective scale qef\nf explicitly, then we\nget\n\nǫg = −\n\n1\nπ2\n\nZ\n\n2\nqef\nf\n\n0\n\n\u0014\n\u0015\n3\ndq 2 q 2 ln[1 + 3dN P (q 2 , ξ)] − dN P (q 2 , ξ) + ǫP T + ǫ′P T ,\n4\n\n(3.5)\n\nwhere evidently\nǫ′P T = −\n\n1\nπ2\n\nZ\n\n∞\n\n2\nqef\nf\n\n\u0015\n\u0014\n3\ndq 2 q 2 ln[1 + 3dN P (q 2 , ξ)] − dN P (q 2 , ξ) .\n4\n\n(3.6)\n\nThis integral represents contribution to the VED which is determined by the truly NP part of the full gluon propagator\nbut integrated out over the PT region. Along with ǫP T given in Eq. (3.4) it also represents a type of the PT\ncontribution into the gluon part of the VED (3.5). This means that the two remaining terms in Eq. (3.5) should be\nsubtracted by introducing the truly NP YM VED ǫY M as follows:\nǫY M = ǫg − ǫP T − ǫ′P T ,\n\n(3.7)\n\nwhere the explicit expression for ǫY M is given by the integral in Eq. (3.5) (see below as well). Concluding this section,\nlet us only note that the above-mentioned necessary subtractions can be done in a more sophisticated way by means\nof ghost degrees of freedom [9]. In other words, the ghost degrees of freedom are to be included into the PT parts of\nthe VED. Evidently, the subtracted terms are of no importance for our present consideration.\n\n\f4\nIV.\n\nTHE BAG CONSTANT\n\nThe Bag constant (the so-called the Bag pressure) is defined as the difference between the PT and the NP VED\n[13]. So in our notations for YM fields, and as it follows from the definition (3.7), it is nothing but the truly NP YM\nVED apart from the sign, i.e.,\nBY M = −ǫY M = ǫP T + ǫ′P T − ǫg\n2\n\u0014\n\u0015\nZ qef\nf\n3 NP 2\n1\nNP 2\n2 2\n= 2\ndq q ln[1 + 3d (q , ξ)] − d (q , ξ) .\nπ 0\n4\n\n(4.1)\n\nThis is a general expression for any model effective charge in order to calculate the Bag constant (or the truly NP\nYM VED apart from the sign) from first principles. It is our definition of the truly NP YM VED and thus of the Bag\nconstant (apart from the sign) as integrated out the truly NP effective charge over the NP region (soft momentum\n2\nregion, 0 ≤ q 2 ≤ qef\nf ). It is free of all types of the PT contributions, by construction. In this connection, let us\nrecall that ǫg is also NP, but \"contaminated\" by the PT contributions, which just to be subtracted in order to get\nexpression (4.1).\nComparing expressions (2.4) and (4.1), one comes to the following prescription to derive Eq. (4.1) directly from\nEq. (2.4).\n(i). Replacing d(q 2 ) → dN P (q 2 ).\n(ii). Omitting the constant a which normalizes the free PT vacuum to zero.\n2\n(iii). Introducing the effective scale qef\nf which separates the NP region from the PT one.\n(iv). Omitting the minus sign for the Bag constant.\nAt this stage the Bag constant (4.1) is free of all types of the PT \"contaminations\", and it is finite quantity, for sure.\nAll other its properties mentioned above (positivity, no imaginary part, etc.) depend on the chosen effective charge. It\nis worth emphasizing once more that the Bag constant and hence the truly NP VED is the main physical characteristic\nof the true QCD ground state. Let us note that in defining correctly the truly NP YM VED (or equivalently the Bag\nconstant), the three types of the corresponding subtractions have been introduced. The first one - in Eq. (3.1) at the\nfundamental gluon level and the two others - in Eq. (3.7). For the general discussion of necessity in such types of the\nsubtractions see Ref. [14].\nThe quantum part of the total truly NP VED at log-loop level is\nǫt = ǫY M + Nf ǫq ,\n\n(4.2)\n\nwhere ǫq is the truly NP quark loop contribution. It is an order of magnitude less than ǫY M because of much less\nquark degrees of freedom in the vacuum, and it is positive because of overall minus due to quark loop. Evidently, in\nterms of the Bag constant, one obtains\nǫt = −BY M [1 − Nf ν],\n\n(4.3)\n\nwhere we introduce ǫq = νBY M and ν ≪ 1.\nV.\n\nNUMERICAL EVALUATION OF THE BAG CONSTANT\n\nEq. (4.1) is the main subject of our consideration in what follows. The only problem remaining to solve is to\nchoose such truly NP effective charge dN P (q 2 , ξ) which should not explicitly depend on the gauge-fixing parameter\nξ. Here it is worth emphasizing that the implicit gauge dependence is not problem. Such kind of the dependence\nis unavoidable in gauge theories like QCD, since fields themselves are gauge-dependent [15]. For different truly NP\neffective charges dN P (q 2 , ξ) we will get different numerical results. That is why the choice for its explicit expression\nshould be physically and mathematically well justified.\nFor concrete numerical evaluation of the Bag constant (4.1), let us choose the truly NP effective charge as follows:\nP 2\n2\n2\ndN P (q 2 ) ≡ αN\ns (q ) = ΛN P /q ,\n\n(5.1)\n\nwhere ΛN P is the mass scale parameter (the mass gap) responsible for the large-scale structure of the true QCD\nvacuum. First of all, in continuous QCD it is the NP solution of the Schwinger-Dyson (SD) equation for the full gluon\n\n\f5\npropagator [14] (and references therein). It is well known that in this theory it leads to the linear rising potential\nbetween heavy quarks, \"seen\" by lattice QCD [16] as well ((q 2 )−2 -type behavior for the full gluon propagator).\nSecondly, it does not depend explicitly on the gauge choice. Also, the separation between the truly NP and PT\neffective charge is not only exact but is unique as mentioned above, since the PT effective charge is always regular\nat zero, while the truly NP effective charge (5.1) is singular at origin. Let us note in advance that it leads to many\nother desirable properties for the Bag constant (see below).\nIn order to proceed to the explicit numerical calculation of the Bag constant for the truly NP effective charge (5.1),\nlet us introduce now dimensionless variable and parameter as follows:\nz = q 2 /Λ2N P ,\n\n2\n2\nzc = qef\nf /ΛN P ,\n\ndN P (q 2 ) = dN P (z) = 1/z.\n\n(5.2)\n\nFrom the general expression for the Bag constant (4.1) one then gets the dimensionless truly NP YM effective potential\n4\ndefined at a fixed effective scale squared qef\nf as follows:\nΩY M (zc ) =\n\n1\n4\nqef\nf\n\n4\nǫY M (qef\nf , zc ) =\n\n1 −2\nz\nπ2 c\n\nZ\n\nzc\n\ndz z\n0\n\n\u0014\n\n\u0015\n3 NP\nd (z) − ln[1 + 3dN P (z)] ,\n4\n\n(5.3)\n\nwhich obviously makes it possible to factorize the scale dependence in the truly NP YM VED (4.1). Performing\nalmost trivial integration in this expression, one obtains\n\u0014\n\u0013\u0015\n\u0012\n\u0010\nzc \u0011 3\n3\n1 −2\n2\n− zc − zc ln 1 +\n.\nΩY M (zc ) = 2 zc 9 ln 1 +\n2π\n3\n2\nzc\n\n(5.4)\n\nIt is easy to see now that as a function of zc , the effective potential (5.4) diverges as ∼ zc−1 at small zc (the unphysical\nregime, ΛN P → ∞ because the mass gap is either finite or zero, i.e., it cannot be infinitely large). It converges as\n∼ −zc−1 at infinity (PT limit, ΛN P → 0), i.e. it approaches zero from below. Let us emphasize that in the PT limit\n2\nthe truly NP phase vanishes and the PT phase survives only. At a fixed effective scale qef\nf it follows that zc → ∞,\nindeed. In other words, at a fixed effective scale one recovers correct PT limit, while at a fixed mass gap it evidently\ncannot be recovered.\nFrom the above one can conclude that the effective potential (5.4) as a function of zc has a minimum at some\nfinite point (local minimum), so its minimization makes sense. In general, by taking first derivatives of the effective\npotential one recovers the corresponding equations of motion [10, 11]. Thus the above-mentioned minimization of\nthe effective potential (5.4) makes it possible to fix the constant of integration which is zc in our case. Requiring\n∂ΩY M (zc )/∂zc = 0, yields the following \"stationary\" condition\nzc = 4 ln[1 + (zc /3)].\n\n(5.5)\n\nzcmin = 2.2,\n\n(5.6)\n\nIts numerical solution is\n\nso at the \"stationary\" state the effective potential (5.3) can be written down as follows:\nΩY M (zcmin )\n\n\u0012\n\u0014\n\u0013\u0015\n1 3 min −1\n3\n= 2\n(z\n) − ln 1 + min\n= −0.0263.\n2π 4 c\nzc\n\n(5.7)\n\nThe truly NP YM VED (5.3) and hence the Bag constant thus becomes\n4\n4\nBY M = −ǫY M = 0.0263qef\nf = 0.1273 × ΛN P ,\n\n(5.8)\n\n2\nmin 2\nqef\nΛN P = 2.2Λ2N P\nf = zc\n\n(5.9)\n\nwhere the relation\n\nhas been already used.\nSo, we have explicitly demonstrated that the Bag constant (5.8) at the \"stationary\" state is finite, positive, and it\nhas no imaginary part, indeed. It depends only on the mass gap responsible for the truly NP dynamics in the QCD\nground state, or equivalently on the effective scale separating the NP region from the PT one. Evidently, only the\nminimization of the effective potential (5.4) makes it possible to fix exactly the numerical relation (5.9) between them.\n\n\f6\nVI.\n\nNUMERICAL RESULTS\n\nIn order to complete the numerical calculation of the Bag constant (5.8) all we need now is the concrete value for\nthe effective scale qef f , which separates the NP region from the PT one. Equivalently, the concrete value for a a scale\nat which the NP effects become important, that is the mass gap ΛN P , also allows one to achieve the same goal.\nIf the PT region starts conventionally from 1 GeV , then this number is a natural choice for the effective scale. It\nmakes it also possible to directly compare our values with the values of many phenomenological parameters calculated\njust at this scale (see Appendix A below). We consider this value as well justified and realistic upper limit for the\neffective scale defined above. Thus, we put\n2\nqef f = qef\nf = 1 GeV,\n\n(6.1)\n\nthen for the mass gap, on account of the relation (5.8), we get\nΛN P = 0.6756 GeV.\n\n(6.2)\n\nEquivalently, the numerical value of the mass gap ΛN P has been obtained from the experimental value for the pion\ndecay constant, Fπ = 93.3 M eV , by implementing a physically well-motivated scale-setting scheme [17, 18]. The pion\ndecay constant is good experimental number, since it is directly measured quantity in comparison, for example with\nthe quark or the gluon condensates, etc. For the mass gap we have obtained the following numerical result:\nΛN P = 0.5784 GeV,\n\n(6.3)\n\nwhich for the effective scale yields\nqef f = 0.857 GeV,\n\n2\n2\nqef\nf = 0.735 GeV .\n\n(6.4)\n\nIn what follows we will consider this value as a realistic lower limit for the effective scale. One has to conclude that we\nhave obtained rather close numerical results for the effective scale and the mass gap, by implementing rather different\nscale-setting schemes. It is worth emphasizing that the effective scale (6.4) quite well covers not only the deep IR\nregion but the substantial part of the intermediate one as well.\nFor the Bag constant (and hence for the truly NP YM VED) from Eq. (5.8), one obtains\nBY M = −ǫY M = (0.0142 − 0.0263) GeV 4\n= (1.84 − 3.4) GeV /f m3 = (1.84 − 3.4) × 1039 GeV /cm3 .\n\n(6.5)\n\nThis is a huge amount of energy stored in one cm3 of the NP QCD vacuum even in \"God-given\" units ħ = c = 1. In\norder to restore the explicit dependence on ~ [10], the right-hand-side of Eq. (6.5) should be multiplied by it, which\nnumerical value in different units is ~ = 1 × 10−34 J s = 6.6 × 10−25 GeV s. Evidently, using the number of different\nconversion factors (see, for example Ref. [15] or Particle Data Group) the Bag constant can be expressed in different\nsystems of units (SI, CGS, etc.).\nTaking into account that\n1 GeV = 0.15 × 10−9 J = 0.48 × 10−17 W,\n\n(6.6)\n\nfrom Eq. (6.5) one finally gets (1 W = 10−3 kW = 10−6 M W = 10−9 GW )\nBY M = (0.88 − 1.63) × 1013 GW/cm3 ,\n\n(6.7)\n\nin familiar units of watt (W). This number still indicates a huge amount of energy stored in one cm3 of the NP QCD\nvacuum especially in comparison with the total nuclear energy produced in one year and which is estimated about\n360 GW only.\n\n\f7\nVII.\n\nDISCUSSION\n\nWe have already pointed out that the VED is badly divergent as the fourth power of the UV cutoff, so we can write\nǫg = −Λ4UV = −λ4 B,\n\n(7.1)\n\nwhich can be always done without loosing generality, and where λ is the dimensionless UV cutoff. At the same time,\nwe have obtained that the truly NP VED is finite and it is ǫY M = −B. This means that the further analysis can be\ndone in terms of the Bag constant.\nLet us imagine now that we can extract the finite portion ǫY M from the vacuum in k different places (different\n\"vacuum energy releasing facilities\" (VERF)). It can be done by nm times in each place, where m = 1, 2, 3...k. Then\nthe remaining (R) VED becomes\n\nǫR = ǫg − ǫE = ǫg −\n\nk\nX\n\nnm ǫ Y M = ǫ g + B\n\nm=1\n\nk\nX\n\nnm ,\n\n(7.2)\n\nm=1\n\nwhere, evidently, ǫE denotes the extracting (E) VED.\nThe ideal case (which, however, will never be achieved) is when we could extract the finite portion of the VED an\ninfinitely number times and in an infinitely number places, so we should consider the following limits:\n\nǫR = B\n\nh\n\nlim\n\n(λ,k,nm )→∞\n\n−λ4 +\n\nk\nX\n\nm=1\n\ni\nnm .\n\n(7.3)\n\nThus, one can conclude that in the ideal case\n\nǫE = B\n\nlim\n\n(λ,k,nm )→∞\n\nk\nX\n\nnm ∼ B × λ2 ,\n\n(7.4)\n\nm=1\n\ndiverges quadratically since due to the limits pointed out in Eq. (7.3), we can approximate k ∼ λ, nm ∼ λ, λ → ∞.\nAt the same time, the initial VED ǫg diverges quartically, i.e., ǫg ∼ −B × λ4 , λ → ∞ (see Eq. (7.1)). This means\nthat the remaining VED\nǫR = ǫg − ǫE ∼ B lim [−λ4 + λ2 ],\nλ→∞\n\n(7.5)\n\nwill be always equal to the initial VED ǫg in the limit pointed out above, i.e., in units of B one has\nǫR = ǫg − ǫE = ǫg + O(1/λ2 ),\n\nλ → ∞.\n\n(7.6)\n\nThis will be especially so in the real case when the integer numbers k and nm are very big, but finite. The true QCD\nvacuum is an infinite and permanent source of energy. The only problem is how to extract it in the profitable way.\nThis is, of course, beyond the scope of this paper, though there are some preliminary ideas on this and related issues.\nIt is instructive to show explicitly that the same relation (7.6) takes place between not only the different VED's\nbut between different types of energy themselves. Indeed, the different VED's should be multiplied by volume (V) in\norder to get energy. Then from Eqs. (6.5) and (7.4) in units of [(1.84 − 3.4) GeV ] it follows that\n\nEE = V ǫE = −(1.84 − 3.4) GeV\nsince V /f m3 ∼ λ3 always when λ goes to infinity.\nIn the same units, one gets\n\nk\nX\nV\n×\nlim\nnm ∼ −λ5 ,\nf m3 (λ,k,nm )→∞ m=1\n\n(7.7)\n\n\f8\n\nEg = V ǫg = −(1.84 − 3.4) GeV\n\nV\n× λ4 ∼ −λ7 .\nf m3\n\n(7.8)\n\nSo the difference between them which is nothing but the remaining energy ER becomes\nER = Eg − EE = Eg + O(1/λ2 ),\n\nλ → ∞,\n\n(7.9)\n\nin complete agreement with the relation (7.6) as it should be. Let us remind that [(1.84 − 3.4) GeV ] units are equal\nto [B f m3 ] units, so in fact this simple analysis is again performed in terms of the Bag constant.\nVIII.\n\nCONCLUSIONS\n\nIn summary, we have formulated a general method as to how to numerically calculate the quantum part of the truly\nNP YM VED (the Bag constant, apart from the sign, by definition) in the covariant gauge QCD ground state, using\nthe effective potential approach for composite operators. The Bag constant is defined as integrated out the truly NP\npart of the effective charge over the NP region (soft momentum region), Eq. (4.1). At this general stage the Bag\nconstant is colorless (color-singlet), finite, and it is free of all types of the PT contributions, by construction. The\nseparation of \"truly NP versus PT\" contributions into the VED is exact and unique because of the subtraction at the\nfundamental level (3.1), as well as due to all other subtractions explicitly shown in Eq. (3.7).\nFor the considered truly NP effective charge (5.1) in addition it is negative, and it has no imaginary part (stable\nvacuum). It is also a manifestly gauge-invariant quantity (i.e., does not explicitly depend on the gauge-fixing parameter\nas it is required). The separation of \"soft versus hard\" gluon momenta is also exact because of the minimization\nprocedure. It becomes possible since the effective potential (5.4) as a function of the dimensionless effective scale zc ,\nwhich separates the NP region form the PT one, has a local minimum. Our numerical value for the Bag constant is\nin a good agreement with other NP quantities such as the gluon condensate. In order to demonstrate this we have\nused the trace anomaly relation, not applying to the weak coupling solution for the β function (see Appendix A).\nOur method can be generalized on the multi-loop contributions in the effective potential, as well as to take into\naccount the quark degrees of freedom. These terms, however, will produce numerically the contributions an order of\nmagnitude less, at least, in comparison with the leading log-loop level gluon term. What is necessary indeed, is to\nbe able to extract the finite part of the truly NP VED in a self-consistent and manifestly gauge-invariant ways. Just\nthis is provided by our method which thus can be applied to any QCD vacuum quantum and classical models. It\nmay serve as a test of them, providing an exact criterion for the separation \"stable versus unstable\" vacua. Using our\nmethod we have already shown that the vacuum of classical dual Abelian Higgs model with string and without string\ncontributions is unstable against quantum corrections [19, 20].\nThe Bag constant calculated here is a manifestly gauge-invariant and colorless finite quantity, i.e., it is a physical\nquantity. That is why it makes sense to discuss its releasing from the vacuum. That's the VED in general is badly\ndivergent is not a mathematical problem. This reflects an universal reality. Vacuum is everywhere and it always\nexists. Our Universe in general and our real word in particular is only its special type of excitation due to the Big\nBang. As underlined above, the vacuum is infinite and hence permanent source of energy. The only problem is how\nto release the finite portion (the Bag constant) and whether it will be profitable or not by introducing some type of\ncyclic process. \"Perpetuum mobile\" does not exist, but \"perpetuum source\" of energy does exist and it is the QCD\nground state. Analogously to the Plank constant ~ which determines a quant of energy emitted by quantum physical\nsystems, the Bag constant determines a quant of energy which can be released from the QCD vacuum.\nA financial support from HAS-JINR Scientific Collaboration Fund and Hungarian OTKA-T043455 (P. Levai) is to\nbe acknowledged.\nAPPENDIX A: THE TRACE ANOMALY RELATION\n\nThe truly NP VED (and hence the Bag constant) is important in its own right as the main characteristic of the\nQCD ground state. Furthermore it assists in calculating such an important phenomenological parameter as the gluon\ncondensate, introduced in the QCD sum rules approach to resonance physics [21]. The famous trace anomaly relation\n[22] in the general case (nonzero current quark masses m0f ) is\nΘμμ =\n\nX\nβ(αs ) a a\nGμν Gμν +\nm0f q f qf .\n4αs\nf\n\n(A1)\n\n\f9\nwhere Θμμ is the trace of the energy-momentum tensor and Gaμν being the gluon field strength tensor while αs = g 2 /4π.\nSandwiching Eq. (A.1) between vacuum states and on account of the obvious relation h0|Θμμ |0i = 4ǫt , one obtains\n\n4ǫt = h0|\n\nX\nβ(αs ) a a\nGμν Gμν |0i +\nm0f h0|q f qf |0i.\n4αs\n\n(A2)\n\nf\n\nHere ǫt is the sum of all possible independent, NP contributions to the VED (the total VED) and h0|qf qf |0i is the\nchiral quark condensate. From this equation in the case of the pure YM fields (i.e., when the number of quark fields\nis zero Nf = 0), one obtains\n\nh0|\n\nβ(αs ) a a\nG G |0i = 4ǫY M ,\n4αs μν μν\n\n(A3)\n\nwhere, evidently, we saturate the total VED ǫt by the truly NP YM VED ǫY M defined in Eq. (4.1) and calculated in\nEq. (6.5) at log-loop level, i.e., setting ǫt = ǫY M + .... If confinement happens then the β function is always in the\ndomain of attraction (i.e., always negative) without IR stable fixed point [12]. Therefore it is convenient to introduce\nthe general definition for the gluon condensate (i.e., without using the weak coupling limit solution to the β function)\nas follows:\nhG2 i ≡ −h0|\n\nβ(αs ) a a\nG G |0i = −4ǫY M = 4BY M .\n4αs μν μν\n\n(A4)\n\nSuch defined general gluon condensate will be always positive as it should be.\nThe renormalization group equation for the β function\n\nq2\n\ndαs (q 2 )\n= β(αs (q 2 ))\ndq 2\n\n(A5)\n\nafter substitution of our solution for the truly NP effective charge (5.1) yields\nβ(αs (q 2 )) = −αs (q 2 ),\n\n(A6)\n\nso that β(αs )/αs = β(αs (q 2 ))/αs (q 2 ) = −1, and Eq. (A.4) numerically becomes\nhG2 i ≡ −h0|\n\nβ(αs ) a a\n1\nG G |0i = h0| Gaμν Gaμν |0i = 4BY M = (0.0568 − 0.1032) GeV 4 ,\n4αs μν μν\n4\n\n(A7)\n\nwhere we have used the numerical value for the Bag constant (6.5). To the gluon condensate (A.7) it can be assigned\na physical meaning indeed as the global (average) vacuum characteristic which measures a density of the NP gluon\nfields configurations in the true QCD vacuum.\nHowever, it cannot be directly compared with the phenomenological values for the standard gluon condensate\nestimated within different approaches [23]. The problem is that it is necessary to remember that any value at the\nscale ΛN P (lower bound in the right-hand-side of Eq. (A.7)) is to be recalculated at the 1 GeV scale. Moreover, both\nvalues explicitly shown in Eq. (A.7) should be recalculated at the same parametrization, which is nothing but the\nratio β(αs )/αs . In phenomenology the standard parametrization for the gluon condensate is\nG2 = h\n\nαs 2\nαs\nG i = h0| Gaμν Gaμν |0i ≈ 0.012 GeV 4 ,\nπ\nπ\n\n(A8)\n\nwhich can be changed within a factor of 2 [19].\nThus in order to achieve the same parametrization the both sides of Eq. (A.7) should be multiplied by 4(αs /π). For\nthe numerical value of the strong fine structure constant we use αs = αs (mZ ) = 0.1187 from the Particle Data Group.\nIn addition the lower bound should be multiplied by the factor 1 CeV /ΛN P = 1.57, coming form the numerical value\n(6.3). Then the recalculated gluon condensate (A.7), which is denoted as Ḡ2 , finally becomes\n\n\f10\n\nḠ2 = (0.014 − 0.022) GeV 4 .\n\n(A9)\n\nJust this numerical value for the gluon condensate should be compared with the numerical value coming from the\nphenomenology, see Eq. (A.8) above. So there is no doubt that all our numerical results are in good agreement with\nother phenomenological estimates [23].\n\n[1] K. A. Milton, hep-th/0406024.\n[2] M. D. Roberts, hep-th/0012063;\nG. L. Klimchitskaya, V. M. Mostepanenko, quant-ph/0609145.\n[3] S.-S. Xue, Phys. Lett. B 508 (2001) 211.\n[4] S.-S. Xue, Phys. Rev. D 68 (2003) 013004.\n[5] M. Scandurra, hep-th/0104127.\n[6] Confinement, Duality, and Nonperturbative Aspects of QCD, edited by by P. van Baal, NATO ASI, Series B: Physics, vol.\n368 (Plenum, New York, 1997).\n[7] Non-Perturbative QCD, Structure of the QCD Vacuum, edited by K-I. Aoki, O. Miymura, and T. Suzuki [Prog. Theor.\nPhys. Suppl. 131 (1998) 1].\n[8] T. Schafer, E. V. Shuryak, Rev. Mod. Phys. 70 (1998) 323;\nV. A. Rubakov, Classical Thory of Gauge Fields (Prinston University Press, 2002).\n[9] V. Gogohia, Gy. Kluge, Phys. Rev. D 62 (2000) 076008.\n[10] J. M. Cornwall, R. Jackiw, E. Tomboulis, Phys. Rev. D 10 (1974) 2428.\n[11] A. Barducci et al., Phys. Rev. D 38 (1988) 238;\nR. W. Haymaker, Riv. Nuovo Cim. 14 (1991) 1-89.\n[12] W. Marciano, H. Pagels, Phys. Rep. C 36 (1978) 137.\n[13] E. V. Shuryak, Phys. Rep. 115 (1984) 151;\nM. S. Chanowitz, S. Sharpe, Nucl. Phys. B 222 (1983) 211.\n[14] V. Gogokhia, hep-ph/0606060.\n[15] M. E. Peskin, D. V. Schroeder, An Introduction to Quantum Field Theory (AW, Advanced Book Program, 1995).\n[16] K. D. Born et al., Phys. Lett. B 329 (1994) 325;\nV. M. Miller et al., Phys. Lett. B 335 (1994) 71.\n[17] V. Gogohia, Gy. Kluge, H. Toki, T. Sakai, Phys. Lett. B 453 (1999) 281.\n[18] V. Gogohia, H. Toki, T. Sakai, Gy. Kluge, Inter. Jour. Mod. Phys. A 15 (2000) 45.\n[19] V. Gogohia, Gy. Kluge, Phys. Lett. B 477 (2000) 387.\n[20] V. Gogohia, M. Prisznyak, Phys. Lett. B 494 (2000) 109.\n[21] M. A. Shifman, A. I. Vainshtein, V. I. Zakharov, Nucl. Phys. B 147 (1979) 385.\n[22] R. J. Crewther, Phys. Rev. Lett. 28 (1972) 1421;\nM. S. Chanowitz, J. Ellis, Phys. Rev. D 7 (1973) 2490;\nJ. C. Collins, A. Duncan, S. D. Joglecar, Phys. Rev. D 16 (1977) 438.\n[23] S. Narison, Phys. Lett. B 387 (1996) 162.\n\n\f"}