{"id": "http://arxiv.org/abs/hep-ph/0107228v1", "guidislink": true, "updated": "2001-07-22T18:27:45Z", "updated_parsed": [2001, 7, 22, 18, 27, 45, 6, 203, 0], "published": "2001-07-22T18:27:45Z", "published_parsed": [2001, 7, 22, 18, 27, 45, 6, 203, 0], "title": "About the origins of the Supersymmetric Standard Model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0212123%2Chep-ph%2F0212282%2Chep-ph%2F0212320%2Chep-ph%2F0212137%2Chep-ph%2F0212081%2Chep-ph%2F0212336%2Chep-ph%2F0212311%2Chep-ph%2F0212204%2Chep-ph%2F0212281%2Chep-ph%2F0212236%2Chep-ph%2F0212221%2Chep-ph%2F0212061%2Chep-ph%2F0212299%2Chep-ph%2F0212328%2Chep-ph%2F0212143%2Chep-ph%2F0212359%2Chep-ph%2F0212189%2Chep-ph%2F0212174%2Chep-ph%2F0212014%2Chep-ph%2F0212399%2Chep-ph%2F0212181%2Chep-ph%2F0212372%2Chep-ph%2F0212165%2Chep-ph%2F0212273%2Chep-ph%2F0212038%2Chep-ph%2F0212080%2Chep-ph%2F0212121%2Chep-ph%2F0212078%2Chep-ph%2F0212142%2Chep-ph%2F0212301%2Chep-ph%2F0212206%2Chep-ph%2F0212225%2Chep-ph%2F0212158%2Chep-ph%2F0212313%2Chep-ph%2F0212401%2Chep-ph%2F0212410%2Chep-ph%2F0212063%2Chep-ph%2F0212309%2Chep-ph%2F0212087%2Chep-ph%2F0212145%2Chep-ph%2F0212288%2Chep-ph%2F0212140%2Chep-ph%2F0212329%2Chep-ph%2F0212120%2Chep-ph%2F0212360%2Chep-ph%2F0212005%2Chep-ph%2F0212402%2Chep-ph%2F0212044%2Chep-ph%2F0212278%2Chep-ph%2F0212265%2Chep-ph%2F0212066%2Chep-ph%2F0212241%2Chep-ph%2F0212365%2Chep-ph%2F0212151%2Chep-ph%2F0212054%2Chep-ph%2F0212064%2Chep-ph%2F0212114%2Chep-ph%2F0107160%2Chep-ph%2F0107285%2Chep-ph%2F0107002%2Chep-ph%2F0107119%2Chep-ph%2F0107276%2Chep-ph%2F0107216%2Chep-ph%2F0107289%2Chep-ph%2F0107134%2Chep-ph%2F0107204%2Chep-ph%2F0107248%2Chep-ph%2F0107148%2Chep-ph%2F0107271%2Chep-ph%2F0107098%2Chep-ph%2F0107066%2Chep-ph%2F0107221%2Chep-ph%2F0107287%2Chep-ph%2F0107034%2Chep-ph%2F0107274%2Chep-ph%2F0107220%2Chep-ph%2F0107012%2Chep-ph%2F0107218%2Chep-ph%2F0107267%2Chep-ph%2F0107028%2Chep-ph%2F0107308%2Chep-ph%2F0107093%2Chep-ph%2F0107200%2Chep-ph%2F0107264%2Chep-ph%2F0107044%2Chep-ph%2F0107286%2Chep-ph%2F0107196%2Chep-ph%2F0107224%2Chep-ph%2F0107296%2Chep-ph%2F0107026%2Chep-ph%2F0107228%2Chep-ph%2F0107135%2Chep-ph%2F0107074%2Chep-ph%2F0107194%2Chep-ph%2F0107103%2Chep-ph%2F0107037%2Chep-ph%2F0107082%2Chep-ph%2F0107041%2Chep-ph%2F0107099%2Chep-ph%2F0107250%2Chep-ph%2F0107132&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "About the origins of the Supersymmetric Standard Model"}, "summary": "Could one use supersymmetry to relate the fermions, constituants of matter,\nwith the bosons messengers of the interactions? This is, ideally, what a\nsymmetry between fermions and bosons would be expected to do.\n  However many obstacles seemed, long ago, to prevent supersymmetry from\npossibly being a fundamental symmetry of Nature. Which fermions and bosons\ncould be related? Is spontaneous supersymmetry breaking possible at all? If\nyes, where is the corresponding spin-1/2 Goldstone fermion? Supersymmetric\ntheories also involve Majorana fermions, unknown in Nature. And how could we\ndefine conserved quantum numbers like B and L, when these are carried by\nfundamental (Dirac) fermions only, not by bosons?\n  An early attempt to relate the photon with a ``neutrino'' led us to\nR-invariance and to a new R quantum number carried by the supersymmetry\ngenerator, but this ``neutrino'' had to be reinterpreted as a new particle, the\nphotino. We also had to introduce bosons carrying ``fermion numbers'' B and L,\nwhich became the squarks and sleptons. This led to the Supersymmetric Standard\nModel, involving SU(3) x SU(2) x U(1) gauge superfields interacting with chiral\nquark and lepton superfields, and two doublet Higgs superfields responsible for\nquark and lepton masses. R-parity, deeply related with B and L conservation\nlaws, appeared as a remnant of the original R-invariance, reduced to a discrete\nsymmetry so that the gravitino and gluinos can acquire masses. We also comment\nabout supersymmetry breaking.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0212123%2Chep-ph%2F0212282%2Chep-ph%2F0212320%2Chep-ph%2F0212137%2Chep-ph%2F0212081%2Chep-ph%2F0212336%2Chep-ph%2F0212311%2Chep-ph%2F0212204%2Chep-ph%2F0212281%2Chep-ph%2F0212236%2Chep-ph%2F0212221%2Chep-ph%2F0212061%2Chep-ph%2F0212299%2Chep-ph%2F0212328%2Chep-ph%2F0212143%2Chep-ph%2F0212359%2Chep-ph%2F0212189%2Chep-ph%2F0212174%2Chep-ph%2F0212014%2Chep-ph%2F0212399%2Chep-ph%2F0212181%2Chep-ph%2F0212372%2Chep-ph%2F0212165%2Chep-ph%2F0212273%2Chep-ph%2F0212038%2Chep-ph%2F0212080%2Chep-ph%2F0212121%2Chep-ph%2F0212078%2Chep-ph%2F0212142%2Chep-ph%2F0212301%2Chep-ph%2F0212206%2Chep-ph%2F0212225%2Chep-ph%2F0212158%2Chep-ph%2F0212313%2Chep-ph%2F0212401%2Chep-ph%2F0212410%2Chep-ph%2F0212063%2Chep-ph%2F0212309%2Chep-ph%2F0212087%2Chep-ph%2F0212145%2Chep-ph%2F0212288%2Chep-ph%2F0212140%2Chep-ph%2F0212329%2Chep-ph%2F0212120%2Chep-ph%2F0212360%2Chep-ph%2F0212005%2Chep-ph%2F0212402%2Chep-ph%2F0212044%2Chep-ph%2F0212278%2Chep-ph%2F0212265%2Chep-ph%2F0212066%2Chep-ph%2F0212241%2Chep-ph%2F0212365%2Chep-ph%2F0212151%2Chep-ph%2F0212054%2Chep-ph%2F0212064%2Chep-ph%2F0212114%2Chep-ph%2F0107160%2Chep-ph%2F0107285%2Chep-ph%2F0107002%2Chep-ph%2F0107119%2Chep-ph%2F0107276%2Chep-ph%2F0107216%2Chep-ph%2F0107289%2Chep-ph%2F0107134%2Chep-ph%2F0107204%2Chep-ph%2F0107248%2Chep-ph%2F0107148%2Chep-ph%2F0107271%2Chep-ph%2F0107098%2Chep-ph%2F0107066%2Chep-ph%2F0107221%2Chep-ph%2F0107287%2Chep-ph%2F0107034%2Chep-ph%2F0107274%2Chep-ph%2F0107220%2Chep-ph%2F0107012%2Chep-ph%2F0107218%2Chep-ph%2F0107267%2Chep-ph%2F0107028%2Chep-ph%2F0107308%2Chep-ph%2F0107093%2Chep-ph%2F0107200%2Chep-ph%2F0107264%2Chep-ph%2F0107044%2Chep-ph%2F0107286%2Chep-ph%2F0107196%2Chep-ph%2F0107224%2Chep-ph%2F0107296%2Chep-ph%2F0107026%2Chep-ph%2F0107228%2Chep-ph%2F0107135%2Chep-ph%2F0107074%2Chep-ph%2F0107194%2Chep-ph%2F0107103%2Chep-ph%2F0107037%2Chep-ph%2F0107082%2Chep-ph%2F0107041%2Chep-ph%2F0107099%2Chep-ph%2F0107250%2Chep-ph%2F0107132&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Could one use supersymmetry to relate the fermions, constituants of matter,\nwith the bosons messengers of the interactions? This is, ideally, what a\nsymmetry between fermions and bosons would be expected to do.\n  However many obstacles seemed, long ago, to prevent supersymmetry from\npossibly being a fundamental symmetry of Nature. Which fermions and bosons\ncould be related? Is spontaneous supersymmetry breaking possible at all? If\nyes, where is the corresponding spin-1/2 Goldstone fermion? Supersymmetric\ntheories also involve Majorana fermions, unknown in Nature. And how could we\ndefine conserved quantum numbers like B and L, when these are carried by\nfundamental (Dirac) fermions only, not by bosons?\n  An early attempt to relate the photon with a ``neutrino'' led us to\nR-invariance and to a new R quantum number carried by the supersymmetry\ngenerator, but this ``neutrino'' had to be reinterpreted as a new particle, the\nphotino. We also had to introduce bosons carrying ``fermion numbers'' B and L,\nwhich became the squarks and sleptons. This led to the Supersymmetric Standard\nModel, involving SU(3) x SU(2) x U(1) gauge superfields interacting with chiral\nquark and lepton superfields, and two doublet Higgs superfields responsible for\nquark and lepton masses. R-parity, deeply related with B and L conservation\nlaws, appeared as a remnant of the original R-invariance, reduced to a discrete\nsymmetry so that the gravitino and gluinos can acquire masses. We also comment\nabout supersymmetry breaking."}, "authors": ["Pierre Fayet"], "author_detail": {"name": "Pierre Fayet"}, "author": "Pierre Fayet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0920-5632(01)01495-5", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0107228v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0107228v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Invited talk at the International Symposium ``30 Years of\n  Supersymmetry'', Minneapolis, October 13-15, 2000. 18 pages, 3 tables", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0107228v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0107228v1", "journal_reference": "Nucl.Phys.Proc.Suppl. 101 (2001) 81-98", "doi": "10.1016/S0920-5632(01)01495-5", "fulltext": "1\n\nABOUT THE ORIGINS OF THE\nSUPERSYMMETRIC STANDARD MODEL\n\narXiv:hep-ph/0107228v1 22 Jul 2001\n\nP. Fayet a\na\n\n∗\n\nLaboratoire de Physique Théorique de l'Ecole Normale Supérieure\n24 rue Lhomond, 75231 Paris Cedex 05, France\n\nInvited talk at the International Symposium \"30 Years of Supersymmetry\"\nMinneapolis, Oct. 13-15, 2000\nCould one use supersymmetry to relate the fermions, constituants of matter, with the bosons messengers of\nthe interactions ? This is, ideally, what a symmetry between fermions and bosons would be expected to do.\nHowever many obstacles seemed, long ago, to prevent supersymmetry from possibly being a fundamental\nsymmetry of Nature. Which fermions and bosons could be related ? Is spontaneous supersymmetry breaking\npossible at all ? If yes, where is the corresponding spin- 12 Goldstone fermion ? Supersymmetric theories also\ninvolve Majorana fermions, unknown in Nature. And how could we define conserved quantum numbers like B\nand L, when these are carried by fundamental (Dirac) fermions only, not by bosons ?\nAn early attempt to relate the photon with a \"neutrino\" led us to R-invariance and to a new R quantum\nnumber carried by the supersymmetry generator, but this \"neutrino\" had to be reinterpreted as a new particle,\nthe photino. We also had to introduce bosons carrying \"fermion numbers\" B and L, which became the squarks\nand sleptons. This led to the Supersymmetric Standard Model, involving SU (3)×SU (2)×U (1) gauge superfields\ninteracting with chiral quark and lepton superfields, and two doublet Higgs superfields responsible for quark and\nlepton masses. R-parity, deeply related with B and L conservation laws, appeared as a remnant of the original\nR-invariance, reduced to a discrete symmetry so that the gravitino and gluinos can acquire masses. We also\ncomment about supersymmetry breaking.\n\n1. GENERAL OVERVIEW\nWhere is the idea of a \"Superworld\" coming\nfrom ? Could half of the particles, at least, have\nescaped our direct observations ?\nAccording to common wisdom supersymmetry is an algebraic structure which allows in\nprinciple to relate particles of half-integer spins,\n∗ UMR\n\n8549, Unité Mixte du CNRS et de l'Ecole Normale\nSupérieure.\n\nLPTENS/01-34\n\nnamely fermions, with particles of integer spins,\nwhich are bosons. Could one relate the fermions,\nconstituants of matter, with the bosons, which appear as the messengers of interactions, and then\narrive at some sort of unification between Matter\nand Forces ? This would certainly be very attractive, but unfortunately things are not so simple.\nLet's go back in time, about thirty years ago.\nThe algebraic structure of supersymmetry in four\ndimensions, whose origins in the East and in the\nWest were related in details at this Conference,\n\n\f2\nwas introduced in the beginning of the seventies by Gol'fand and Likhtman [ 1], Volkov and\nAkulov [ 2], and Wess and Zumino [ 3]. It involves\na spin- 12 fermionic symmetry generator relating\nfermionic with bosonic fields, in relativistic quantum field theories.\nSupersymmetry essentially appeared, at the\nbeginning, as a rather formal mathematical structure. At that time it was not at all clear if,\nand even less how, supersymmetry could have a\nchance to actually relate fermions with bosons,\nin a physical theory of particles. Even more, although supersymmetry is commonly known as relating fermions with bosons, its algebra does not\neven require the existence of elementary bosons\nat all ! (In the framework of non-linear supersymmetry a fermionic field can be turned into\na composite bosonic field made of two fermionic\nones [ 2].) In any case, supersymmetry as an algebraic structure does not by itself require the existence of superpartners for all particles, to which\nwe are so accustomed now.\nConsidering an algebra is not sufficient to give\nit a physical meaning. The existence of SU (2) as\na mathematical structure does not mean isospin\nor weak-interaction symmetries, charm is not a\nconsequence of SU (4), nor grand-unification a\nprediction of SU (5) ... An algebra may be of\ninterest, in physics, depending on if and how it\ncan actually be used to describe the real world.\nIn the early days of supersymmetry the hopes\nwere more like using it as a tool to understand\nbetter the properties of relativistic field theories;\nor trying to relate amplitudes involving integerspin mesons with those involving half-integer-spin\nbaryons; or at best, if supersymmetry could actually be used in the description of the real world\nand were to be realized at a fundamental level,\nto attempt to use it to relate spin-1 gluons with\nspin- 21 quarks, for example. However, while very\ninteresting from the point of view of relativistic\nfield theory, supersymmetry seemed, in the early\ndays, clearly inappropriate for a description of our\nphysical world, for obvious and less obvious reasons, which often tend to be somewhat forgotten,\nnow that we got so accustomed to deal with Supersymmetric extensions of the Standard Model.\n\nAt first, one could not identify physical bosons\nand fermions that might be related under such\na symmetry, in contrast with other symmetries which relate known particles together,\nsuch as isospin, electroweak-interaction or grandunification symmetries. Even if it still remains\nhypothetical, the grand-unification symmetry, for\nexample, should relate known leptons with known\nquarks, while supersymmetry does not seem to\nallow for similar relations between known bosons\nand known fermions.\nIt even seemed initially that supersymmetry\ncould not be spontaneously broken at all – also in\ncontrast with ordinary symmetries like internal\nor gauge symmetries – which would imply that\nbosons and fermions be systematically degenerated in mass ! Unless of course supersymmetrybreaking terms are explicitly introduced \"by\nhand\", which would spoil the fundamental rôle\nof the supersymmetry and prevent it from being\nrealized as a local gauge symmetry. In any case,\nwe know significantly more fundamental fermion\nfields, describing leptons and quarks, than boson\nfields. To help better set the stage, let us recall\nthat at the time, in 1974, only two fermion families were known and not even complete with the\ncharm quark still to be discovered, neutral current\neffects had just been discovered the year before, in\n1973, with very little information available about\nthe structure of the weak neutral current(s?), and\nthe lower limit on the mass of a charged W boson was something like 5 GeV/c2 . The Standard\nModel was a recent theoretical construction, far\nfrom \"Standard\" in today's sense; its W ± and Z\nbosons, of course hypothetical, were considered\nas really very heavy; and even-more-hypothetical\nHiggs fields were generally viewed as a technical\ndevice to trigger or mimic the spontaneous breaking of the gauge symmetry.\nFurthermore, independently of the previous\nproblems of supersymmetry, these theories also\ninvolve, systematically, self-conjugate Majorana\nspinors, while Majorana fermions are completely\nunknown in Nature – the fermions that we\nknow all appearing as Dirac fermions carrying conserved quantum numbers, B and L.\nSpeaking of B and L, how could we account\nfor the conservation of these \"fermionic numbers\"\n\n\f3\n(only carried by fermions) in a supersymmetric\ntheory, in which fermions are related to bosons ?\nShould some bosons carry fermionic number –\nand what about \"fermion number\" conservation,\nespecially if such bosons carrying \"fermion number\" could be exchanged between quarks and leptons ? In view of all these problems, or even without being explicitly aware of them, most physicists considered supersymmetry as irrelevant for\n\"real physics\".\nStill this algebraic structure could be taken\nseriously as a possible symmetry of the physics\nof fundamental particles and interactions, once\nwe understood that the above obstacles preventing the application of supersymmetry to the real\nworld could be overcome. In particular the\nlast questions about the conservation of quantum\nnumbers led us to consider the possibilities of having an additive quantum number carried by the\nsupersymmetry generator – and this was the R\nquantum number associated with the continuous\n\"R-invariance\", also implying restrictions on the\nallowed superpotential – and to have bosons carrying \"fermion numbers\" B and L, which became the squarks and sleptons.\nAfter an initial attempt illustrating how far\none could go in trying to relate known particles\ntogether (in particular the photon with a \"neutrino\", and the W ± 's with charged \"leptons\",\nalso related with charged Higgs bosons H ± ), and\nthe limitations of this approach, in a SU (2) ×\nU (1) electroweak theory involving two doublet\nHiggs superfields now known as H1 and H2 [ 4],\nwe were quickly led to reinterpret the fermions of\nthis model (which all possess ±1 unit of a conserved additive R quantum number carried by\nthe supersymmetry generator) as belonging to a\nnew class of particles. The \"neutrino\" ought to\nbe considered as a really new particle, a \"photonic neutrino\", a name I transformed in 1977\ninto photino; the fermionic partners of the colored gluons (quite distinct from the quarks) then\nbecoming the gluinos, and so on. More generally this led us to postulate the existence of\nnew R-odd \"superpartners\" for all particles and\nconsider them seriously, despite their rather nonconventional properties: e.g. new bosons carrying \"fermion\" number, now known as sleptons\n\nand squarks, or Majorana fermions transforming as an SU (3) color octet, which are precisely the gluinos, etc.. In addition the electroweak breaking must be induced by a pair of\nelectroweak Higgs doublets, not just a single one\nas in the Standard Model, which requires the existence of charged Higgs bosons, and of several\nneutral ones [ 5, 6].\nThis construction illustrates that supersymmetry is the framework in which fundamental\nspin-0 (Englert-Brout) Higgs fields find their natural place. In ordinary gauge theories spin-0\nHiggs fields were generally considered as ad hoc\nadditions to the sectors of spin-1 gauge bosons\nand spin- 21 fermions, and much effort was subsequently devoted at attempting to avoid them,\nas in technicolor theories for example (which still\ncould not get rid of them completely, independently of other problems). In this framework\nof supersymmetry fundamental spin-0 fields are\ntaken seriously from the beginning, exactly on\nthe same footing as spin- 12 fields which appear\nas their fermionic counterparts under supersymmetry. The number of categories of fundamental objects is decreased from 3 in ordinary gauge\ntheories (spin-1 gauge bosons interacting with\nspin- 21 fermions and spin-0 Higgs fields) to 2\nonly in supersymmetric gauge theories: (spin-1/\nspin- 12 ) multiplets of \"gauge particles\" interacting with (spin- 12 /spin-0) \"chiral\" multiplets describing spin-0 Higgs fields as well as spin- 21 lepton and quark fields – although they are not directly related by the supersymmetry. (Indeed a\nnew discrete symmetry known as R-parity comes\nin to distinguish, among spin- 21 /spin-0 chiral\nmultiplets, the two separate sectors of Higgs multiplets on one hand, and quark and lepton multiplets, on the other hand.)\nIn the same manner the number of categories\nof coupling constants gets also reduced down to\n2, namely gauge and Yukawa couplings only. The\nHiggs potential in a supersymmetric theory is\nnow determined by the gauge and Yukawa couplings of spin- 12 particles, with Higgs mass parameters identical to fermion mass parameters up\nto supersymmetry-breaking contributions (naturally expected to be <\n∼ electroweak scale given\ntheir interplay with Higgs v.e.v.'s, if no excessive\n\n\f4\nfine-tuning is to be performed). In particular,\nthe quartic couplings of the two Higgs doublets\ndescribed by the superfields H1 and H2 mentioned earlier, as they appear for example in the\n\"minimal\" version of the Supersymmetric Standard Model, are completely fixed by the supersymmetry in terms of g 2 and g 2 + g ′2 ( g and g ′\nbeing the SU (2) × U (1) electroweak gauge couplings), a fact at the origin of various mass relations involving massive spin-1 gauge bosons and\nspin-0 Higgs bosons.\nThe still-hypothetical superpartners may be\ndistinguished by a new quantum number called\nR -parity, first defined in terms of the previous\nR quantum number as Rp = (−1)R , i.e. +1\nfor the ordinary particles and −1 for their superpartners. It is associated with a Z2 remnant of the previous R-symmetry acting continuously on gauge, lepton, quark and Higgs superfields as in [ 5], which must be be abandoned\nas a continuous symmetry so as to allow for the\ngravitino [ 6] and gluinos [ 7] – upon which the\ncontinuous R-symmetry acts chirally – to acquire masses (whatever is the actual mechanism, still unknown, ultimately responsible for\nthe spontaneous breaking of the supersymmetry).\nThis new discrete quantum number defined as Rparity [ 7] may be multiplicatively conserved in\na natural way, and is especially useful to guarantee the absence of unwanted interactions mediated by squark or slepton exchanges – in connection with the fact that R-symmetries imply restrictions on the allowed superpotential, actually\npermitting, in the present case, all useful superpotential terms necessary to generate quark and\nlepton masses, while excluding dangerous B and\nL -violating terms. The conservation (or nonconservation) of R-parity is therefore closely related with the conservation (or non-conservation)\nof baryon and lepton numbers, B and L, as illustrated by the well-known formula reexpressing\nR-parity in terms of baryon and lepton numbers,\nas (−1) 2S (−1) 3B+L [ 8].\nThe finding of the basic building blocks of the\nSupersymmetric Standard Model, whether \"minimal\" or not, allowed for the experimental searches\nfor \"supersymmetric particles\", which started\nwith the first searches for gluinos and photinos,\n\nselectrons and smuons, in the years 1978-1980,\nand have been going on continuously since. These\nsearches often use the \"missing energy\" signature\ncorresponding to energy-momentum carried away\nby unobserved neutralinos [ 5, 8, 9, 10]. A conserved R-parity also ensures the stability of the\n\"lightest supersymmetric particle\", a good candidate to constitute the non-baryonic Dark Matter\nthat seems to be present in the Universe.\nThe general opinion of the scientific community towards supersymmetry and supersymmetric\nextensions of the Standard Model has considerably changed since the early days, in view of all\nthe nice features of such theories, including their\nfundamental relation with gravity, their improved\nrenormalisation properties (with the softening or\ncancellation of divergencies between boson and\nfermion contributions), the effects of the new particles on the high-energy evolution of gauge couplings, the rôle of supersymmetry in the consistency of (super)string theories, etc.. And it is now\nwidely admitted that supersymmetry may well be\nthe next fundamental symmetry to be discovered\nin the physics of fundamental particles and interactions, although this remains to be experimentally proven.\n2. NATURE DOES NOT SEEM TO BE\nSUPERSYMMETRIC !\n(\n\nThe supersymmetry algebra\n{ Q, Q̄ } =\n[ Q, P μ ]\n\n=\n\n− 2 γμ P μ\n0\n\n,\n(1)\n,\n\nwas introduced, in the years 1971-1973, by three\ndifferent groups, with quite different motivations. Gol'fand and Likhtman [ 1] first introduced it with the hope of understanding parityviolation: when the Majorana supersymmetry\ngenerator is written as a two-component chiral\nDirac spinor (say QL ), one may have the impression that the supersymmetry algebra, which then\ninvolves a chiral projector in the right-handside of\nthe anticommutation relation (1), is intrinsically\nparity-violating; they suggested that such models\nmust therefore necessarily violate parity, probably thinking this could lead to an explanation\nfor parity-violation in weak interactions. Volkov\n\n\f5\nand Akulov [ 2] hoped to explain the masslessness of the neutrino from a possible interpretation as a spin- 21 Goldstone particle, while Wess\nand Zumino [ 3] wrote the algebra by extending to\nfour dimensions the \"supergauge\" (i.e. supersymmetry) transformations [ 11], and algebra [ 12],\nacting on the two-dimensional string worldsheet.\nHowever, the mathematical existence of an algebraic structure does not imply that it has to play\na rôle as an invariance of the fundamental laws of\nNature.\nIndeed many obstacles seemed, long ago, to\nprevent supersymmetry from possibly being a\nfundamental symmetry of Nature. Which bosons\nand fermions could be related by supersymmetry ? May be supersymmetry could act at\nthe level of composite objects, e.g. as relating\nbaryons with mesons ? Or should it act at a fundamental level, i.e. at the level of quarks and\ngluons ? But quarks are color triplets, and electrically charged, while gluons transform as an\nSU (3) color octet, and are electrically neutral !\nIs spontaneous supersymmetry breaking possible at all ? If yes, where is the spin- 21 Goldstone fermion of supersymmetry, if not one of the\nknown neutrinos ? Can we use supersymmetry\nto relate directly known bosons and fermions ?\nAnd, if not, why ? If known bosons and fermions\ncannot be directly related by supersymmetry, do\nwe have to accept this as the sign that supersymmetry is not a symmetry of the fundamental\nlaws of Nature ? If we still insist to work within\nthe framework of supersymmetry, how could it\nbe possible to define conserved baryon and lepton numbers in such theories, which systematically involve self-conjugate Majorana fermions,\nunknown in Nature, while B and L are carried\nonly by fundamental (Dirac) fermions – not by\nbosons ? And, once we are finally led to postulate the existence of new bosons carrying B and\nL – the new spin-0 squarks and sleptons – can\nwe prevent them from mediating new unwanted\ninteractions, which would have disastrous effects ?\nWhile bosons and fermions should have equal\nmasses in a supersymmetric theory, this is certainly not the case in Nature. Supersymmetry\nshould then clearly be broken. But spontaneous\nsupersymmetry breaking is notoriously difficult to\n\nachieve, to the point that it was even initially\nthought to be impossible ! Why is it so ? Here\nit is important to point out an important difference between supersymmetry and other symmetries such as internal or gauge symmetries for example. To break spontaneously such \"ordinary\"\nsymmetries, it is sufficient to arrange so that the\nsymmetry-preserving would-be vacuum state has\nmore energy than symmetry-breaking vacua, so\nthat it gets unstable. This is for example how the\nelectroweak symmetry gets spontaneously broken\nin the Standard Model, as soon as the Higgs mass\nparameter μ2 is taken to be negative.\nBut in supersymmetry one no longer has the\nsame freedom to fix at will the potential of scalar\nfields as in ordinary gauge theories, since this potential is now largely determined by gauge and\nYukawa couplings. Furthermore supersymmetry is in fact a very special symmetry, since the\nHamiltonian, which governs the determination of\nthe vacuum state through the minimization of the\npotential, is also directly related by the supersymmetry algebra itself to the supersymmetry generator, precisely the one that we would like to\nsee spontaneously broken. Actually this hamiltonian H, which appears in the right-handside\nof the anticommutation relations (1), can be expressed proportionally to the sum of the squares\nof the components\nsupersymmetry generaP of the\n2\nQ\n.\nThis implies that a sutor, as H = 14\nα\nα\npersymmetry preserving vacuum state must have\nvanishing energy, while any candidate for a \"vacuum state\" which would not be invariant under\nsupersymmetry may naı̈vely be expected to have\na larger, positive, energy [ 13] 2 . As a result,\npotential candidates for supersymmetry breaking\nvacuum states seemed to be necessarily unstable,\nleading to the question:\nIs spontaneous supersymmetry breaking\npossible at all ?\n\n(2)\n\nIn spite of the above argument, several ways of\nbreaking spontaneously global or local supersymmetry have been found. But spontaneous super2 Such\n\na would-be supersymmetry breaking state corresponds, in global supersymmetry, to a strictly positive energy density – the scalar potential being expressed proportionally to the sum of the squaresP\nof the auxiliary D, F\n( D 2 + F 2 + G2 ) .\nand G components, as V = 12\n\n\f6\nsymmetry breaking remains in general rather difficult to obtain, at least for global supersymmetry, due to the strong tendency of such theories\nto resist spontaneous supersymmetry breaking by\npreferring systematically supersymmetric vacua.\nOnly in very exceptional situations can the existence of such vacua be completely avoided !\nGauge symmetries, on the other hand, get rather\neasily (even sometimes too easily) spontaneously\nbroken, in supersymmetric theories.\nIn global supersymmetry a non-supersymmetric state has, in principle, always more energy\nthan a supersymmetric one; it then seems that it\nshould always be unstable ! Still it is possible to\nescape this general result – and this is the key\nto spontaneous supersymmetry breaking – if one\ncan arrange to be in one of those rare situations\nfor which no supersymmetric state exists at all –\nthe set of equations for the auxiliary field v.e.v.'s\n< D >′ s = < F >′ s = < G >′ s = 0 having no\nsolution at all . But these situations are in general quite exceptional. (This is in sharp contrast\nwith ordinary symmetries, in particular gauge\nsymmetries, for which it is sufficient to arrange\nfor non-symmetric states to have less energy than\nsymmetric ones, which is easy to achieve.) These\nrare situations usually involve an abelian U (1)\ngauge group [ 14], allowing for a linear \" ξ D \"\nterm in the Lagrangian density 3 ; and/or an appropriate set of chiral superfields with special\nsuperpotential interactions which must be very\ncarefully chosen [ 15], preferentially with the help\nof additional symmetries such as R-symmetries.\nIn local supersymmetry [ 16], which includes gravity, one also has to arrange, at the price of a very\nsevere fine-tuning, for the energy density of the\nvacuum to vanish exactly [ 17], or almost exactly,\nto an extremely good accuracy, so as not to generate an unacceptably large value of the cosmological constant Λ .\nWhatever the mechanism of supersymmetry\nbreaking, we still have to get a physical world\nwhich looks like ours (which will lead to pos3 Even\n\nin the presence of such a term, one frequently still\ndoes not get a spontaneous breaking of the supersymmetry: one has to be very careful so as to avoid the presence\nof supersymmetry restoring vacuum states with vanishing\nenergy, which generally tend to exist.\n\ntulate the existence of the superpartners). Of\ncourse just accepting the possibility of explicit\nsupersymmetry breaking without worrying too\nmuch about the origin of supersymmetry breaking terms, as is frequently done now, makes things\nmuch easier – but also at the price of introducing a large number of arbitrary parameters, coefficients of these supersymmetry breaking terms.\nIn any case such terms must have their origin in\na spontaneous supersymmetry breaking mechanism, if we want supersymmetry to play a fundamental rôle, especially if it is to be realized as a\nlocal fermionic gauge symmetry, as in supergravity theories. We shall come back to this question\nof supersymmetry breaking later. In between, we\nnote that the spontaneous breaking of the global\nsupersymmetry must in any case generate a massless spin- 21 Goldstone particle, leading to the next\nquestion,\nWhere is the spin- 12 Goldstone fermion\nof supersymmetry ?\n\n(3)\n\nCould it be one of the known neutrinos [ 2] ? A\nfirst attempt at implementing this idea within a\nSU (2) × U (1) electroweak model of \"leptons\" [ 4]\nquickly illustrated that it could not be pursued\nvery far. The \"leptons\" of this first electroweak\nmodel were soon reinterpreted to become the\n\"charginos\" and \"neutralinos\" of the Supersymmetric Standard Model.\nIf the Goldstone fermion of supersymmetry is\nnot one of the known neutrinos, why hasn't it\nbeen observed ? Today we tend not to think at\nall about the question, since: 1) the generalized\nuse of soft terms breaking explicitly the supersymmetry seems to make this question irrelevant;\n2) since supersymmetry has to be realized locally anyway, within the framework of supergravity [ 16], the massless spin- 21 Goldstone fermion\n(\"goldstino\") should in any case be eliminated in\nfavor of extra degrees of freedom for a massive\nspin- 32 gravitino [ 6, 17].\nBut where is the gravitino, and why has no one\never seen a fundamental spin- 23 particle ? Should\nthis already be taken as an argument against supersymmetry and supergravity theories ? Indeed\nshould one consider that the crucial test of such\ntheories should be the discovery of a new funda-\n\n\f7\nmental spin- 32 particle ? In that case, how could\nit manifest its presence ?\nTo discuss this question properly we need to\nknow how this spin- 32 particle should couple to\nthe other ones, which requires us to know how\nbosons and fermions could be associated under\nsupersymmetry [ 5]. In any case, we might\nalready anticipate that the interactions of the\ngravitino, with amplitudes proportional\n√ to the\nGN ≃\nsquare root of the Newton constant\n10−19 GeV−1 , should be absolutely negligible\nin particle physics. Quite surprisingly this may,\nhowever, not necessarily be true, despite the extreme smallness of Newton's constant ! If the\nspin- 32 gravitino turns out to be light (which is\nthe case if supersymmetry is broken \"at the electroweak scale\" or even at some larger intermediate scale) it would still interact very much\nlike the massless spin- 12 goldstino of global supersymmetry, according to the \"equivalence theorem\" of supersymmetry [ 6]. We are then\nback again to our initial question, where is the\nspin- 12 Goldstone fermion of supersymmetry ?\nBut we are now in a position to answer, the\ndirect detectability of the gravitino depending\ncrucially on the value of its mass m3/2 , itself\n√\nfixed (according to the relation m3/2 = κd/ 6 )\n√\nby the supersymmetry breaking scale d = Λss ≈\np\nm3/2 mPlanck [ 6, 18]. In particular the\ngravitino gets essentially \"invisible\" in particle\nphysics experiments, as soon as the supersymmetry breaking scale is large enough, compared\nto the electroweak scale. This seems indeed the\nmost likely situation. On the other hand, a sufficiently light gravitino could be directly detectable\nin particle physics experiments !\nIn any case, irrespective of the question of supersymmetry breaking, the crucial question, if supersymmetry is to be relevant in particle physics,\nis:\nWhich bosons and fermions\ncould be related by supersymmetry ?\n\n(4)\n\nBut there seems to be no answer since known\nbosons and fermions do not appear to have much\nin common – excepted, maybe, for the photon\nand the neutrino. This track deserved to be ex-\n\nplored [ 4], but one cannot really go very far in\nthis direction. In a more general way the number of (known) degrees of freedom is significantly\nlarger for the fermions (now 90, for three families of quarks and leptons) than for the bosons\n(27 for the gluons, the photon and the W ± and\nZ bosons, ignoring for the moment the spin-2\ngraviton and the not-yet-discovered Higgs boson).\nAnd these fermions and bosons have very different gauge symmetry properties !\nAs we have already mentioned, supersymmetric theories also involve, systematically, selfconjugate Majorana spinors – unobserved in Nature – while the fermions that we know all appear\nas Dirac fermions carrying conserved B and L\nquantum numbers. This leads to the question\nHow could one define (conserved)\nbaryon and lepton numbers,\nin a supersymmetric theory ?\n\n(5)\n\nThese quantum numbers, presently known to\nbe carried by fundamental fermions only, not by\nbosons, seem to appear in Nature as intrinsicallyfermionic numbers. Such a feature cannot be\nmaintained in a supersymmetric theory, and one\nhas to accept the (then rather heretic) idea\nof attributing baryon and lepton numbers to\nfundamental bosons, as well as to fermions.\nThese new bosons carrying B or L are the superpartners of the spin- 21 quarks and leptons,\nnamely the now-familiar (although still unobserved) spin-0 squarks and sleptons . Altogether,\nall known particles should be associated with new\nsuperpartners [ 5].\nNowadays we are so used to deal with spin-0\nsquarks and sleptons, carrying baryon and lepton\nnumbers almost by definition, that we can hardly\nimagine this could once have appeared as a problem. Its solution went through accepting the idea\nof attributing baryon or lepton numbers to a large\nnumber of new fundamental bosons. But if such\nnew spin-0 squarks and sleptons are introduced,\ntheir direct (Yukawa) exchanges between ordinary quarks and leptons, if allowed, could lead\nto an immediate disaster, preventing us from getting a theory of electroweak and strong interactions mediated by spin-1 gauge bosons only (and\n\n\f8\nnot spin-0 particles), with conserved B and L\nquantum numbers !\nHow can we avoid unwanted interactions\nmediated by spin-0 squark and slepton\nexchanges ?\n\n(6)\n\nFortunately, we can naturally avoid such unwanted interactions, thanks to R-parity (a\ndiscrete remnant of the continuous U (1) Rsymmetry) which, if present, guarantees that\nsquarks and sleptons cannot be directly exchanged between ordinary quarks and leptons, allowing for conserved baryon and lepton numbers\nin supersymmetric theories.\n\n3. R -INVARIANCE, AND\nWEAK BREAKING\n\nELECTRO-\n\nLet us now return to an early attempt at relating existing bosons and fermions together [ 4],\nalso at the origin of the definition of the continuous R -invariance 4 (the discrete version of which\n4 This\n\nmodel is reminiscent of a presupersymmetry model\ninvolving two Higgs doublets and (associated) fermion\ndoublets, with Yukawa and φ4 interactions already restricted by a continuous Q-invariance in a way which prepares for these Higgs and fermion doublets to get related\nby a supersymmetry [ 19]. One unit of Q is then carried\nby the supersymmetry generator. These Q transformations act on gauge and Higgs superfields as follows:\n\n\u001a\n\nV ( x, θ, θ̄ )\nH1,2 ( x, θ )\n\nQ\n\nV ( x, θ e−iα , θ̄ eiα ) ,\n\nQ\n\neiα H1,2 ( x, θ e−iα ) ,\n\n−→\n\n−→\n\nallowing for a direct μ H1 H2 Higgs superfield mass term\nin the superpotential. The definition of Q -invariance was\nthen modified, so that it survives the spontaneous breaking of the electroweak symmetry [ 4]. This led to R invariance, acting as follows:\n\n\u001a\n\nV ( x, θ, θ̄ )\nH1,2 ( x, θ )\n\nR\n\nV ( x, θ e−iα , θ̄ eiα ) ,\n\nR\n\nH1,2 ( x, θ e−iα ) .\n\n−→\n\n−→\n\nThe direct μ H1 H2 mass term (with R-index n = 0 ),\nnow forbidden by R-invariance, was replaced by a trilinear coupling to an extra singlet chiral superfield N transR\n\nforming as N ( x, θ ) −→ e2 iα N ( x, θ e−iα ) , with\nan \"R-invariant\" superpotential written, in modern notations, as\nW = λ H1 H2 N + σ N .\n\nIt has R-index n = 2 and transforms according to eq. (16)\nof section 5, so that it generates R-invariant interactions.\nBoth the electroweak symmetry and the supersymmetry\nget spontaneously broken.\n\nleading to R-parity). It also showed how one\ncan break spontaneously the SU (2) × U (1) electroweak symmetry in a supersymmetric theory,\nusing a pair of chiral doublet Higgs superfields\nthat would now be called H1 and H2 . This involves a mixing angle (initially called δ) known\nas β , defined by\nv2\n.\n(7)\ntan β =\nv1\nThe fermions of this early supersymmetric model,\nwhich are in fact gaugino-higgsino mixtures,\nshould no longer be considered as lepton candidates, but became essentially the \"charginos\"\nand \"neutralinos\" of the Supersymmetric Standard Model [ 5, 6].\nDespite the general lack of similarities between\nknown bosons and fermions, we tried as an exercise to see how far one could go in attempting to\nrelate the spin-1 photon with a spin- 21 neutrino. If\nwe want to attempt to identify the companion of\nthe photon as being a \"neutrino\", despite the fact\nthat it initially appears as a self-conjugate Majorana fermion, we need to understand how this\nparticle could carry a conserved quantum number\nthat we might interpret as a \"lepton\" number.\nThis was made possible through to the definition\nof a continuous U (1) R-invariance [ 4], which\nalso guaranteed the masslessness of this \"neutrino\" (\"νL \", carrying +1 unit of R ), by acting\nchirally on it, i.e. also by acting chirally on the\nGrassmann coordinate θ which appears in the\nexpression of gauge and chiral superfields. The\nsupersymmetry generator Qα carries one unit\nof the corresponding additive conserved quantum\nnumber, called R, so that one has ∆ R = ± 1\nbetween a boson and a fermion related by supersymmetry.\nAttempting to relate the photon with one of\nthe neutrinos could only be an exercise of limited\nvalidity. The would-be \"neutrino\", while having\nin this model a V − A coupling to its associated \"lepton\" and the charged W ± boson, was in\nfact what we would now call a \"photino\", not directly coupled to the Z ! Still this first attempt,\nwhich essentially became a part of the Supersymmetric Standard Model, illustrated how one can\nbreak spontaneously a SU (2) × U (1) gauge symmetry in a supersymmetric theory, through an\n\n\f9\nelectroweak breaking induced by a pair of chiral\ndoublet Higgs superfields, now known as H1 and\nH2 ! (Using a single doublet Higgs superfield\nwould have left us with a massless charged chiral\nfermion, which is evidently unacceptable.) Our\nprevious charged \"leptons\" were in fact what we\nnow call two winos, or charginos, obtained from\nthe mixing of charged gaugino and higgsino components, as given by the mass matrix\n√\n\ng v2\n√ = mW 2 sin β\n2\n,\nM =  g v1\n√\n√ = mW 2 cos β\nμ = 0\n2\n\n\n\n( m2 = 0 )\n\n(8)\n\nin the absence of a direct higgsino mass that\nwould have originated from a μ H1 H2 mass\nterm in the superpotential 5 . The whole construction showed that one could deal elegantly with\nelementary spin-0 Higgs fields (not a very popular ingredient at the time), in the framework of\nspontaneously-broken supersymmetric theories.\nQuartic Higgs couplings are no longer arbitrary,\nbut get fixed by the gauge coupling constants\n– here the electroweak couplings g and g ′ –\n′2\n~2\nthrough the following \"D-terms\" (i.e. D2 + D2 )\n6\nin the scalar potential given in [ 4] :\nVHiggs\n2\n\n=\n\nand\n\ng2\n.\n2\n\n(10)\n\n2\n\nThe quartic term g2 | h†1 h2 |2 in this scalar\npotential 7 is responsible for the fact that the vacuum expectation values of the two doublet Higgs\nfields \"align\", in order to minimize the energy,\nso that only neutral components of these doublets acquire non vanishing v.e.v.'s., the U (1)\nsubgroup of electromagnetism remaining unbroken, and the photon massless. This√term is also\n0\nresponsible, from < h1,2\n>= v1,2 / 2 , for the\n1 2\n2\n2\ncontribution 4 g (v1 + v2 ) |H − |2 = mW2 |H − |2\nto the mass2 of the charged Higgs bosons H ±\n(initially called w± ).\nFurther contributions to this quartic Higgs potential also appear in the presence of additional\nsuperfields, such as the neutral singlet chiral superfield N already introduced in this model,\nwhich will play an important rôle in the NMSSM,\ni.e. in \"next-to-minimal\" or \"non-minimal\" versions of the Supersymmetric Standard Model. In\nany case charged Higgs bosons H ± are present in\nthis framework, as well as several neutral ones,\nnow called H, h, A, ... , and one gets in general\nmass relations such as\nmH2± = mW2 + susy-breaking terms, ... .\n\ng 2 + g ′2\ng2 †\n( h†1 h1 − h†2 h2 )2 +\n| h1 h2 |2 + ... .\n8\n2\n(9)\n\nThis is precisely the quartic Higgs potential of the\n\"minimal\" version of the Supersymmetric Standard Model, the so-called MSSM, with its quartic\n5 The\n\ng 2 + g ′2\n8\n\n(11)\n\n′2\n\ng\ng\n( h†1 ~τ h1 + h†2 ~τ h2 )2 +\n(h†1 h1 − h†2 h2 )2 + ...\n8\n8\n\n=\n\nHiggs coupling constants equal to\n\nμ H1 H2 term initially introduced in [ 4], which\nwould have broken explicitly the continuous U (1) Rinvariance then intended to be associated with \"lepton\" number conservation, was quickly replaced by a\nλ H1 H2 N trilinear coupling involving an extra neutral\nsinglet chiral superfield N .\n6 With a different denomination for the two Higgs doublets,\nsuch that φ′′ 7→ h1 , (φ′ )c 7→ h2 , tan δ = v′ /v′′ 7→\ntan β = v2 /v1 .\n\nThe exact mass spectrum depends of course on\nthe details of the supersymmetry breaking mechanism considered: use of soft-breaking terms, possibly \"derived from supergravity\", presence or\nabsence of extra-U (1) gauge fields and/or additional chiral superfields, rôle of radiative corrections, etc..\n7 For\n\nthis quartic contribution to the Higgs potential, the\ncorrespondence between old and new notations is as follows:\ng2\n(φ′† φ′ φ′′† φ′′ − φ′† φ′′ φ′′† φ′ )\n2\n\n≡\n\ng2\n| h†1 h2 |2 .\n2\n\nThe vanishing of this quantity implies that the v.e.v.'s of\nthe two Higgs doublets are correctly \"aligned\", with\n\u0013\n\u0012\n\u0012\n√ \u0013\n0\nv1 / 2\n√\n.\n< h1 > =\n,\n< h2 > =\n0\nv2 / 2\n\n\f10\n4. THE SUPERSYMMETRIC\nDARD MODEL\n\nSTAN-\n\nThese two doublet Higgs superfields are precisely the two doublets, now called H1 and H2 ,\nused in 1977 to generate the masses of charged\nleptons and down quarks (from < H1 >), and\nof up quarks (from < H2 >), in supersymmetric extensions of the standard model [ 5]. At the\ntime having to introduce Higgs fields was generally considered as rather unpleasant. While one\nHiggs doublet was taken as probably unavoidable\nto get to the standard model or at least simulate\nthe effects of the spontaneous breaking of the electroweak symmetry, having to consider two Higgs\ndoublets, necessitating charged Higgs bosons as\nwell as several neutral ones, was usually considered as a too heavy price, in addition to the \"doubling of the number of particles\", once considered as an indication of the irrelevance of supersymmetry. As a matter of fact considerable work\nwas devoted for a time on attempts to avoid fundamental spin-0 Higgs fields, before returning to\nfundamental Higgses, precisely in this framework\nof supersymmetry.\nIn the previous SU (2)×U (1) model [ 4], it was\nimpossible to view seriously for very long \"gaugino\" and \"higgsino\" fields as possible building\nblocks for our familiar lepton fields. On the contrary they should describe new particles. This led\nus to consider that all quarks and leptons ought\nto be associated with new bosonic partners, the\nspin-0 squarks and sleptons. Gauginos and higgsinos, mixed together by the spontaneous breaking\nof the electroweak symmetry, correspond to a new\nclass of fermions, now known as \"charginos\" (cf.\nthe mass matrix of eq. (8)) and \"neutralinos\". In\nparticular, the partner of the photon under supersymmetry, which cannot be identified with any of\nthe known neutrinos, should be viewed as a new\n\"photonic neutrino\", the photino ; the fermionic\npartner of the gluon octet is an octet of selfconjugate Majorana fermions called gluinos , etc.\n– although at the time colored fermions belonging to octet representations of the color SU (3)\ngauge group were generally believed not to exist\n(to the point that one could think of using the\nabsence of such particles as a general constraint\n\nto select admissible grand-unified theories [ 20]).\nThe two doublet Higgs superfields H1 and H2\nintroduced previously can now be used to generate quark and lepton masses 8 [ 5]. To generate\nthe appropriate mass terms we first write the relevant bilinear products of left-handed lepton (L)\nand quark (Q) doublet superfields, with the conjugates of the right-handed superfields describing right-handed quarks and leptons, now known\nto be electroweak singlets. The latter are lefthanded superfields denoted as Ē, Ū and D̄, in\nmodern notations. The resulting bilinear terms\nĒ L, D̄ Q and Ū Q are then coupled in a supersymmetric and gauge invariant way to the\ntwo doublet Higgs superfields H1 and H2 , which\nleads to the familiar trilinear superpotential\nW = he H1 .Ē L + hd H1 .D̄ Q − hu H2 .Ū Q .\n(12)\nThe corresponding superpotential interactions\nare also invariant under continuous R-symmetry\ntransformations, as well as under an \"extra-U (1)\"\nsymmetry, two important features to which we\nshall return later. We certainly don't attempt at\nthis point to write further terms in the superpotential that would be odd functions of quark and\nlepton superfields, since we know in advance that\nthey would lead to B and/or L -violations, and it\nwould be somewhat foolish to rush to reestablish\nthe problems of B and L conservation laws that\nwere elegantly solved by attributing baryon and\nlepton numbers to bosons (squarks and sleptons)\nas well as to fermions. (Such B or L-violating\nterms, in addition, would not be invariant under\nR nor under the extra U (1) symmetry 9 , but we\n8 The\n\ncorrespondance between earlier notations for doublet\nHiggs superfields, and modern ones, is as follows:\nS=\n\n\u0012\n\nS0\n\n\u0013\n\nS−\n\n(left-h.)\n\n, T=\n\n\u0012\n\nT0\n\n\u0013\n\nT−\n\n(right-h.)\n\n→ H1 =\n\n\u0012\n\nH10\n\n\u0013\n\nH1−\n\n, H2 =\n\n\u0012\n\nH2+\nH20\n\n\u0013\n\n,\n\n(both left-h.)\n\nso that S gets now replaced by H1 and T † by H2 . Furthermore, we originally denoted, generically, by Si , lefthanded, and Tj , right-handed, the chiral superfields describing the left-handed and right-handed spin- 12 quark\nand lepton fields, together with their spin-0 partners.\n9 It is interesting to note, in particular, that if the ex-\n\n\f11\nTable 1\nThe basic ingredients of the Supersymmetric\nStandard Model.\n1) SU (3) × SU (2) × U (1) gauge superfields;\n2) chiral superfields for\nthe three quark and lepton families;\n3) two doublet Higgs superfields H1 and H2\nresponsible for electroweak breaking,\nand quark and lepton masses, through\n\nTable 2\nMinimal particle content of the Supersymmetric\nStandard Model.\nSpin 1\n\nSpin 1/2\n\ngluons\nphoton\n----\nW±\nZ\n\ngluinos g̃\nphotino γ̃\n−−−−−−\nf±\nwinos W\n1,2\ne1,2\nzinos Z\nhiggsino h̃0\n\n4) the trilinear superpotential (12) .\nleptons l\nquarks q\n\nshall return later to the fate of these two additional symmetries.)\nThe vacuum expectation values of the two\nHiggs doublets generate charged-lepton and\ndown-quark masses (for the Higgs doublet described by H1 ), and up-quark masses (for the\none described by H2 ). They are given, with\nan appropriate\n√ normalization √convention, by\nme = √\nhe v1 / 2 , md = hd v1 / 2 , and mu =\nhu v2 / 2 , respectively. All this constitutes the\nbasic structure of the Supersymmetric Standard\nModel , which involves at least the minimal set\nof ingredients shown in Table 1. Other ingredients, such as a μ H1 H2 direct mass term in the\nsuperpotential, or an extra singlet chiral superfield N with a trilinear superpotential coupling\nλ H1 H2 N + ... possibly acting as a replacement\nfor a μ H1 H2 direct mass term [ 4], and/or extra U (1) factors in the gauge group (which could\nhave been responsible for spontaneous supersymmetry breaking) may or may not be present, depending on the particular version of the Supersymmetric Standard Model considered.\nIn any case, independently of the details of the\nsupersymmetry breaking mechanism ultimately\nconsidered, we obtain the minimal particle contra U (1) of eq. (20) is gauged B, L and R become automatic symmetries which follow from the requirement of\nlocal gauge invariance.\n\nSpin 0\n\n------–\n\nH± \n\n\nHiggs\nH\nbosons\n\n\n\nh, A\nsleptons  ̃l\nsquarks q̃\n\ntent of the Supersymmetric Standard Model, as\ngiven in Table 2. Each spin- 12 quark q or charged\nlepton l− is associated with two spin-0 partners\ncollectively denoted by q̃ or  ̃l− , while a lefthanded neutrino νL is associated with a single\nspin-0 sneutrino ν̃. We have ignored for simplicity further mixings between the various \"neutralinos\" described by neutral gaugino and higgsino fields, denoted in this table by γ̃, Z̃1,2 and\nh̃0 . More precisely, all such models include four\nneutral Majorana fermions at least, corresponding to mixings of the fermionic partners of the\ntwo neutral SU (2) × U (1) gauge bosons (usually denoted by Z̃ and γ̃, or W̃3 and B̃ ) and\nof the two neutral higgsino components ( h ̃10 and\nh ̃20 ). Non-minimal models also involve additional\ngauginos and/or higssinos.\n\n5. FROM R-INVARIANCE TO R-PARITY\nLet us return to the definition of the continuous R-symmetry, and discrete R-parity, transformations. R-parity is associated with a Z2\nsubgroup of the group of continuous U (1) Rsymmetry transformations, acting on the gauge\nsuperfields and the two doublet Higgs superfields\nH1 and H2 as in [ 4] (cf. footnote 4 in sec-\n\n\f12\ntion 3), with their definition extended to quark\nand lepton superfields so that quarks and leptons carry R = 0 , and squarks and sleptons,\nR = ± 1 (more precisely, R = + 1 for q̃L , l̃L ,\nand R = − 1 for q̃R , l̃R ) [ 5]. R-parity appears in fact as the remnant of this continuous\nR-invariance when gravitational interactions are\nintroduced [ 6], in the framework of local supersymmetry (supergravity). Either the continuous\nR-invariance, or simply its discrete version of Rparity, if imposed, naturally forbid the unwanted\ndirect exchanges of the new squarks and sleptons\nbetween ordinary quarks and leptons.\nThese continuous U (1) R-symmetry transformations, which act chirally on the anticommuting\nGrassmann coordinate θ appearing in the definition of superspace and superfields, act on the\ngauge and chiral superfields of the Supersymmetric Standard Model as follows 10 :\nAction of continuous R-symmetry :\n\n\n\n\n\n\n\n\n\n\n\n\nR\n\nV ( x, θ e−iα , θ̄ eiα ) ,\n\nR\n\nH1,2 ( x, θ e−iα ) ,\n\nR\n\neiα S( x, θ e−iα ) ,\n\nV ( x, θ, θ̄ )\n\n−→\n\nH1,2 ( x, θ )\n\n−→\n\nS( x, θ )\n\n−→\n\n\nSU (3)×SU (2)×U (1) gauge superfields,\n\n\n\n\n left-h. Higgs superfields H and H ,\n1\n2\nfor\n\n left-h. (anti)quark and lepton superfields\n\n\n\nS = { Q, Ū , D̄, L, Ē } ,\nrespectively .\n\n(13)\n\nThese transformations are defined so as not to act\non ordinary particles, which have R = 0 , while\ntheir superpartners have, therefore, R = ±1 .\n\n10\n\nIf we also introduce as in [ 4] an extra neutral singlet\nchiral superfield N coupled to the two doublet Higgs superfields H1 and H2 , it gets transformed under R as\nfollows:\nN ( x, θ )\n\nR\n\n−→ e2 iα N ( x, θ e−iα ) ,\n\nso that the trilinear superpotential coupling λ H1 H2 N is\n\"R-invariant\", in the sense that it transforms according to\neq. (16).\n\nThey allow us to distinguish between two separate\nsectors of R-even and R-odd particles. R-even\nparticles include the gluons, photon, W ± and Z\nbosons, the various Higgs bosons, quarks and leptons – and the graviton. R-odd particles include\ntheir superpartners, i.e. the gluinos and the various neutralinos and charginos, squarks and sleptons – and the gravitino (cf. Table 3). According\nto this first definition, R-parity simply appears as\nthe parity of the above additive quantum number\nR , as given by the expression [ 7]:\nR-parity Rp =\n(\n( − 1 )R =\n\n+ 1 for ordinary particles,\n−1\n\nfor superpartners.\n(14)\n\nBut why should we limit ourselves to the discrete R-parity symmetry, rather than considering its full continuous parent R-invariance ? This\ncontinuous U (1) R-invariance, from which Rparity has emerged, is indeed a symmetry of all\nfour necessary basic building blocks of the Supersymmetric Standard Model [ 5]:\n1) the Lagrangian density for SU (3)× SU (2)×\nU (1) gauge superfields;\n2) the SU (3)×SU (2)×U (1) gauge interactions\nof the quark and lepton superfields;\n3) the SU (2) × U (1) gauge interactions of the\ntwo chiral doublet Higgs superfields H1 and H2\nresponsible for the electroweak breaking;\n4) and the trilinear \"superYukawa\" interactions\n(12) responsible for quark and lepton masses.\nIndeed the bilinear products of left-handed\n(anti)lepton and (anti)quark superfields Ē L,\nD̄ Q and Ū Q that we have to consider to generate quark and lepton mass terms in a supersymmetric extension of the standard model transform\nunder R as follows, according to eq. (13):\nR\n\nĒ L ( x, θ ) −→ e2 iα Ē L ( x, θ e−iα ) , ... . (15)\nWhen these terms are combined with H1 (for\nĒ L and D̄ Q ) and H2 (for Ū Q ) to give the\ntrilinear superpotential (12), this one transforms\nunder the continuous R-symmetry (13) with \" R-\n\n\f13\nTable 3\nR-parities in the Supersymmetric Standard\nModel.\nBosons\n\nFermions\n\ngauge and Higgs bosons\n\ngauginos and higgsinos\n\ngraviton\n\ngravitino\n\n(R = 0)\n\n( R = ±1 )\n\nR-parity +\n\nR-parity −\n\nsleptons and squarks\n\nleptons and quarks\n\n(R = ±1)\n\n(R = 0)\n\nR-parity −\n\nR-parity +\n\nweight\" nW =\nR\n\nP\n\ni\n\nni = 2 , i.e. according to\n\nW ( x, θ ) −→ e2 iα W ( x, θ e−iα ) .\n\n(16)\n\nIts auxiliary \" F -component\" (obtained from the\ncoefficient of the bilinear θ θ term in the expansion of W ), is therefore R-invariant, generating\nR-invariant interaction terms in the Lagrangian\ndensity 11 .\nHowever, an unbroken continuous Rinvariance, which acts chirally on the Majorana\noctet of gluinos,\nR\n\ng̃ −→ e γ5 α g̃ .\n\n(17)\n\nwould constrain gluinos to remain massless, even\nafter a breaking of the supersymmetry. We would\nthen expect the existence of relatively light \"Rhadrons\" [ 8, 9] made of quarks, antiquarks and\ngluinos, which have not been observed. We know\ntoday that gluinos, if they do exist, should be\n11 Note,\n\nhowever, that a direct Higgs superfield mass term\nμ H1 H2 in the superpotential, which has R-weight n = 0 ,\ndoes not lead to interactions which are invariant under the\ncontinous R symmetry; but it gets in general reallowed,\nas for example in the MSSM, as soon as the continuous R\nsymmetry gets reduced to its discrete version of R-parity.\n\nrather heavy, requiring a significant breaking of\nthe continuous R-invariance, in addition to the\nnecessary breaking of the supersymmetry. Once\nthe continuous R-invariance is abandoned, and\nsupersymmetry is spontaneously broken, radiative corrections do indeed allow for the generation\nof gluino masses [ 21], a point to which we shall\nreturn later (cf. section 6).\nFurthermore, the necessity of generating a mass\nfor the Majorana spin- 32 gravitino, once local supersymmetry is spontaneously broken, also forces\nus to abandon the continuous R-invariance, in\nfavor of the discrete R-parity symmetry, thereby\nalso allowing for gluino and other gaugino masses,\nat the same time as the gravitino mass m3/2 , as\nalready noted in 1977 [ 6]. A third reason for\nabandoning the continuous R-symmetry could\nnow be the non-observation at LEP of a charged\nwino – also called chargino – lighter than the\nW ± , that would exist in the case of a continuous\nU (1) R-invariance [ 4, 5], as shown by the mass\nmatrix M of eq. (8) (the just-discovered τ − particle could tentatively be considered, in 1976, as\na possible light wino/chargino candidate, before\ngetting clearly identified as a sequential heavy\nlepton.)\nOnce we drop the continuous R-invariance in\nfavor of its discrete R-parity version, we may ask\nhow general is this notion of R-parity, and, correlatively, are we forced to have this R-parity\nconserved ? As a matter of fact, there is from the\nbeginning a close connection between R-parity\nand baryon and lepton number conservation laws,\nwhich has its origin in our desire to get supersymmetric theories in which B and L could\nbe conserved, and, at the same time, to avoid\nunwanted exchanges of spin-0 squarks and sleptons. Actually the superpotential of the theories discussed in Ref. [ 5] was constrained from\nthe beginning, for that purpose, to be an even\nfunction of quark and lepton superfields, more\nspecifically involving, for left-handed electroweak\ndoublets and right-handed singlets, the bilinear\ncombinations ĒL, D̄Q and Ū Q. Odd superpotential terms, which would have violated the\n\"matter-parity\" symmetry ( −1)(3B+L) , were excluded, to be able to recover B and L conser-\n\n\f14\nvation laws, and avoid direct Yukawa exchanges\nof spin-0 squarks and sleptons between ordinary\nquarks and leptons. Tolerating unnecessary superpotential terms which are odd functions of\nquark and lepton superfields (i.e. Rp -violating\nterms), does create, in general, immediate problems with baryon and lepton number conservation laws (most notably, a much too fast proton\ninstability, if both B and L violations are simultaneously allowed).\nThis intimate connection between R-parity and\nB and L conservation laws can be made quite\nobvious by noting that for usual particles (−1) 2S\ncoincides with (−1) 3B+L , so that the original\nR-parity (14) may be reexpressed in terms of the\nspin S and the \"matter-parity\" (−1) 3B+L , as\nfollows [ 8]:\nR-parity = (−1) 2S (−1) 3B+L .\n\n(18)\n\nThis may also be written as (−1)2S (−1) 3 (B−L) ,\nshowing that this discrete symmetry may still\nbe conserved even if baryon and lepton numbers\nare separately violated, as long as their difference\n( B − L ) remains conserved, at least modulo 2.\nThe R-parity symmetry operator may also be\nviewed as a non-trivial geometrical discrete symmetry associated with a reflection of the anticommuting fermionic Grassmann coordinate, θ →\n− θ , in superspace [ 22]. This R-parity operator\nplays an essential rôle in the discussion of the experimental signatures of the new particles (even\nif it should turn out not to be exactly conserved).\nA conserved R-parity guarantees that the new\nspin-0 squarks and sleptons cannot be directly exchanged between ordinary quarks and leptons,\nas well as the absolute stability of the \"lightest\nsupersymmetric particle\" (or LSP), a good candidate for non-baryonic Dark Matter in the Universe.\n6. ABOUT SUPERSYMMETRY BREAKING, IN THE EARLY TIMES\nLet us come back to the question of supersymmetry breaking, which still has not received\na definitive answer yet. The inclusion, in the\nLagrangian density, of universal soft dimension-\n\n2 supersymmetry breaking terms for all squarks\nand sleptons,\nX\nm02 ( q̃ † q̃ + l̃†  ̃l ) ,\n(19)\nLsoft = −\nq̃, l̃\n\nwas already considered in 1976. Such terms\nbreaking explicitly the supersymmetry, as soon\nas they are allowed or tolerated, can immediately\nmake superpartners heavy with no difficulty, in\nsupersymmetric extensions of the standard model\nwith an SU (3) × SU (2) × U (1) gauge group (no\nextra U (1) ), and quarks and charged leptons\nmassive through their couplings to H1 and H2\n[ 5]. These models may involve an additional singlet superfield N coupled to H1 and H2 as in [ 4],\nwith a trilinear coupling λ H1 H2 N + ... in place\nof the initial μ H1 H2 (cf. \"NMSSM\"). One may\nalso disregard this extra superfield, then restoring the μ H1 H2 mass term, which leads to the\nminimal version of the Supersymmetric Standard\nModel 12 .\nWe were however more ambitious, since it was\nalso understood that such soft-breaking terms of\ndimension 2 should better originate from a spontaneous supersymmetry breaking mechanism, especially if supersymmetry is to be realized locally. This required additional work. As a matter of fact, in view of progressing towards a true\nspontaneous breaking mechanism, the soft breaking terms of eq. (19) were first generated spontaneously with the help of the \"D-term\" associated with an \"extra U (1)\" gauge symmetry, acting axially on lepton and quark fields, thereby\nproviding a common positive mass2 contribution\nm02 (that was initially called μ2 ) for all (\"lefthanded\" as well as \"right-handed\") slepton and\nsquark fields. One can then disregard this potentially unpleasant extra U (1) by sending it to an\n\"invisible sector\", ultimately taking the limit in\nwhich its gauge coupling g ′′ vanishes, as done in\nthe first paper of ref. [ 5]. The spin- 12 goldstino\n(here the gaugino of the extra U (1) ) gets \"invisible\" then decouples. The supersymmetry, first\nspontaneously broken but \"at a very high scale\"\n12 In\n\nboth cases, the photon and gluons remain massless as\nthey should, and there is no massless or light spin-0 boson\nsince no spontaneously broken extra U (1) is present, once\nthe singlet N and/or the various soft-breaking terms are\nincluded.\n\n\f15\np\n√\n(here d = Λss ≈\nm02 /g ′′ ≫ mW ), remains\nbroken – now explicitly – in the limit; but only\nsoftly, through the slepton and squark (universal, in the simplest case) dimension-2 mass terms\n(19). The approach illustrated also very well the\nspecial rôle played by the \"susy-breaking scale parameter\", which could well be very large while the\nmass splittings between bosons and fermions still\nremain much smaller, typically <\n∼ electroweak\nscale.\nConsidering such an extra U (1) is indeed natural in the framework of supersymmetric theories, in which two doublet Higgs superfields are\nseparately responsible for the masses of charged\nleptons and down quarks (H1 ), and of up quarks\n(H2 ), as we have seen. One may therefore take\nadvantage of this special feature of supersymmetric theories, also imposed by the necessity of\navoiding massless charged fermions, to perform\nindependent phase transformations on the two\nHiggs doublets. More precisely one can perform\nU (1)Y × extra-U (1) gauge transformations, acting independently on the two Higgs doublets H1\nand H2 . This corresponds to the invariance of\nthe trilinear superpotential (12) responsible for\nquark and lepton masses under an extra U (1)\nsymmetry defined, in the simplest case, as follows:\nAction of extra U (1) :\n\nV ( x, θ, θ̄ )\n\n\n\nH1,2 (x, θ)\n\n\n\nS(x, θ)\n\n−→\n−→\n−→\n\nV ( x, θ, θ̄ ) ,\ne\n\n− iα\n\ne\n\niα\n2\n\nm20 =\n\n1 ′′\ng < −D′′ > ,\n2\n\nso that one gets the mass relations:\n(\nmq̃2 = mq2 + m20 ,\nml̃2\n\n=\n\nml2 + m20 .\n\n(21)\n\n(22)\n\nAdditional contributions to m02 , which depend\nlinearly on the weak isospin and hypercharge\nquantum numbers T3 and Y , may also be generated from non-vanishing contributions of the\n< D > 's associated with SU (2) × U (1) , but\nthey remain family-independent (which is useful\nto avoid potential difficulties with flavor-changing\nneutral current effects). In the presence of such\nterms, the previous formula (22) becomes:\n2\nmq̃,2l̃ = mq,l\n+ m20\n\u0010\n\u0011\n′\n∓ g T3 < D3 > + g2 Y < D′ > , (23)\n\nH1,2 (x, θ) ,\nS(x, θ) ,\n\n\nSU (3)×SU (2)×U (1) gauge superfields,\n\n\n\n\n left-h. Higgs superfields H and H ,\n1\n2\nfor\n\n\nleft-h. (anti)quark and lepton superfields\n\n\n\nS = { Q, Ū , D̄, L, Ē } .\n\n(20)\n\nThis extra U (1) is associated, in the above simple case, with a purely axial new neutral current\nfor all quarks and charged leptons 13 . The whole\n13\n\nconstruction is designed so as to make the set of\nequations < D >′ s = < F >′ s = < G >′ s = 0\nto have no solution at all, in order to obtain a true\nspontaneous breaking of the supersymmetry with\na physically coupled goldstino (later to be \"eaten\"\nby the gravitino), as well a spontaneous breaking\nof the extra U (1) and of the electroweak symmetry, with the SU (3)×U (1) of QCD × QED remaining unbroken: quite a non-trivial result given\nall the constraints to be satisfied simultaneously.\nThe soft breaking terms m02 of eq. (19) are then\ngenerated by the v.e.v. of the D-component associated with the extra U (1) , which reads in the\nsimplest case:\n\nWhen we also introduce the extra neutral singlet chiral\nsuperfield N coupled to H1 and H2 , it gets transformed\n\nin which the sign ∓ corresponds to the two different (left and right, respectively) handedness of\nthe sfermion fields considered.\n\nThis illustrates clearly the reason for having introduced such an extra U (1), in order to\nget spontaneous supersymmetry breaking with\nunder the extra U (1) as follows:\nN ( x, θ )\n\n−→\n\ne2 iα N ( x, θ )\n\nso that its trilinear superpotential coupling λ H1 H2 N be\ninvariant under the extra U (1). (A superpotential term\nlinear in N , if present as in [ 4], would however break\nexplicitly the extra U (1) symmetry, as would also do N 2\nor N 3 terms.)\n\n\f16\nheavy squarks and sleptons. Indeed in a spontaneously broken globally supersymmetric theory\nwith SU (3)×SU (2)×U (1) (or a fortiori SU (5) )\nas the gauge group, possible supersymmetrybreaking contributions to the mass2 matrices of\nsquarks and sleptons originating from the weak\nhypercharge and weak isospin \"D-terms\" in the\nscalar potential always depend linearly on the\nY and T3 gauge quantum numbers of (lefthanded) matter superfields, and therefore cannot\nall be positive; and F -term contributions mixing\nsquarks or sleptons together cannot come to the\nrescue. As a result one at least among the four ũ\nand d ̃ squarks would then have a negative mass2\n(unless they all remain light), which is evidently\nunacceptable. This is well illustrated by the mass\nsum rule established in [ 23], which reads, in the\nabsence of such an extra U (1) :\nX\nX\nm2 (squarks) = 2\nm2 (quarks) . (24)\n\nThe average mass2 is the same for squarks and\nquarks, for example (up to radiative corrections),\nin a spontaneously broken globally supersymmetric theory, in the absence of an extra U (1). The\nuse of a \"non-traceless\" extra U (1) , as we had\nintroduced a few years before precisely for that\nreason, allowed for a non-vanishing supertrace:\nSupertrace M2(squarks and quarks)\n=\n\nX\n\nm2 (squarks) − 2\n\nX\n\nm2 (quarks)\n\n≈ g ′′ < Dextra-U(1)> Trquark sf. extra-U (1) > 0 ;\n(25)\nand for heavy squarks and sleptons, already at\nthe classical level, in spontaneously broken global\nsupersymmetry.\nThe problem of having all squarks and sleptons\nheavy, in a spontaneously broken supersymmetric theory, appears solved for the moment, at the\nprice of the extension of the gauge group to include an extra U (1) factor. Otherwise one would\nhave to rely, as it was proposed later, on rather\ncomplicated effects of radiative corrections, or to\ngo to supergravity theories. Of course, in all cases\none may always decide to return to explicit supersymmetry breaking, which immediately leads us\n\nto physically acceptable SU (3) × SU (2) × U (1)\ntheories, without or with additional neutral singlet chiral superfields. This makes the difficult\nquestion of supersymmetry breaking immediately\ndisappear, although one still has to wonder about\nthe physical origin of this breaking.\nThe previous method of spontaneous supersymmetry breaking quickly faced several difficulties. In addition to the question of anomalies\n(connected with the non-traceless feature of the\nextra U (1), but maybe anomalous U (1)'s could\nbe tolerated after all ... ), it required new neutral current interactions. This was fine in 1977,\nbut such interactions did not show up, as the\nSU (2) × U (1) neutral current structure of the\nStandard Model got brilliantly confirmed. (The\nquestion is in fact more complex than it seems,\nin particular since one may also consider situations for which the new gauge boson would be\nboth very light and very weakly coupled, but we\ndo not elaborate on this here .) This mechanism\nalso left us with the question of generating large\ngluino masses, to which we shall return soon. Altogether, the gauging of an extra U (1) no longer\nappears as an appropriate way to generate large\nsuperpartner masses – even if such an U (1) may\nstill have a rôle to play – and we can now close\nthis parenthesis. One now uses again, in general,\nsoft supersymmetry-breaking terms [ 24] generalizing those of eq. (19) – possibly \"induced by supergravity\", or other mechanisms for which the\nsupersymmetry is in general spontaneously broken \"at a high scale\". These terms essentially\nserve as a parametrization of our ignorance about\nthe true mechanism of supersymmetry breaking\nchosen by Nature to make superpartners heavy.\nBut let us return to gluino masses. As we\nsaid before continuous R-symmetry transformations act chirally on gluinos, so that an unbroken R-invariance would require them to remain\nmassless, even after a spontaneous breaking of\nthe supersymmetry ! Thus the need, once it became experimentally clear that massless or even\nlight gluinos could not be tolerated, to generate a\ngluino mass either from radiative corrections [ 21],\nor from supergravity (see already [ 6]), with, in\nboth cases, the continuous R-invariance reduced\nto its discrete R-parity subgroup.\n\n\f17\nIn the framework of global supersymmetry it is\nnot so easy to generate large gluino masses. Even\nif global supersymmetry is spontaneously broken,\nand if the continuous R-symmetry is not present,\nit is still in general rather difficult to obtain large\nmasses for gluinos, since: i) no direct gluino\nmass term is present in the Lagrangian density;\nand ii) no such term may be generated spontaneously, at the tree approximation, since gluino\ncouplings involve colored spin-0 fields, which cannot be translated. A gluino mass may then\nbe generated by radiative corrections involving a\nnew sector of quarks sensitive to the source of supersymmetry breaking [ 21], that would now be\ncalled \"messenger quarks\", but iii) this can only\nbe through diagrams which \"know\" both about:\na) the spontaneous breaking of the global supersymmetry, through some appropriately-generated\nv.e.v.'s for auxiliary components, < D >, < F >\nor < G > 's;\nb) the existence of superpotential interactions which do not preserve the\ncontinuous U (1) R-symmetry. Such radiativelygenerated gluino masses, however, generally tend\nto be rather small, unless one introduces, in some\noften rather complicated \"hidden sector\", very\nlarge mass scales ≫ mW .\nFortunately gluino masses may also result directly from supergravity, as already observed\nin 1977 [ 6].\nGravitational interactions require, within local supersymmetry, that the spin2 graviton be associated with a spin-3/2 partner [ 16], the gravitino. Since the gravitino is\nthe fermionic gauge particle of supersymmetry\n√\nit must acquire a mass, m3/2 (= κ d/ 6 ≈\nd/mPlanck ), as soon as the local supersymmetry\ngets spontaneously broken. Since the gravitino is\na self-conjugate Majorana fermion its mass breaks\nthe continuous R-invariance which acts chirally\non it, just as for the gluinos, forcing us to abandon the continuous U (1) R-invariance, in favor\nof its discrete R-parity subgroup. In particular, in the presence of a spin- 23 gravitino mass\nterm m3/2 , which corresponds to a change in\nR ∆R = ± 2 , the \"left-handed sfermions\" f ̃L ,\nwhich carry R = + 1, can mix with the \"righthanded\" ones f ̃R , carrying R = − 1, through\nmixing terms having ∆R = ± 2 , which may naturally (but not necessarily) be of order m3/2 mf\n\n– so that the lightest of the sfermions may well\nturn out to be one of the two stop quarks t̃ .\nSupergravity theories also offer, in addition, a\nnatural framework in which to include direct\ngaugino Majorana mass terms\n−\n\ni\n ̄ G̃ − i m W̃\n ̄ W̃ − i m B̃\n ̄ B̃ ,\nm3 G̃\na\na a\n2\na\n1\n2\n2\n2\n(26)\n\nwhich also correspond to ∆R = ± 2 , just as for\nthe gravitino mass itself. The SU (3) × SU (2) ×\nU (1) gaugino mass parameters m3 , m2 and m1\nmay naturally (but not necessarily) be of the\nsame order as the gravitino mass m3/2 .\nOnce the continuous R-invariance is reduced to\nits discrete R-parity subgroup, a direct Higgs superfield mass term μ H1 H2 , which was not allowed by the continuous U (1) R-symmetry, gets\nreallowed in the superpotential, as for example in\nthe MSSM. The size of this supersymmetric μ\nparameter might conceivably have been a source\nof difficulty, in case this parameter, present even\nif there is no supersymmetry breaking, turned out\nto be large. But since the μ term breaks explicitly\nboth the continuous R-invariance (13) and the\n(global) extra U (1) symmetry (20) its size may\nbe controlled by considering one or the other of\nthese two symmetries. Even better, since μ got\nreallowed just as we abandoned the continuous\nR-invariance so as to allow for gluino and gravitino masses, the size of μ may naturally be of\nthe same order as these gaugino (and gravitino)\nmasses, since they all appear in violation of the\ncontinuous R-symmetry (13). Altogether there\nis here no specific hierarchy problem associated\nwith the size of μ . In general, irrespective of the\nsupersymmetry breaking mechanism considered,\nstill unknown (and generally parametrized using\na variety of possible soft supersymmetry breaking terms), one normally expects the various superpartners not to be too heavy, otherwise the\ncorresponding new mass scale introduced in the\ngame would tend to contaminate the electroweak\nscale, thereby creating a hierarchy problem in the\nSupersymmetric Standard Model. Superpartner\nmasses are then normally expected to be naturally of the order of mW , or at most in the ∼\nTeV/c2 range.\n\n\f18\nThe Supersymmetric Standard Model (\"minimal\" or not), with its R-parity symmetry (absolutely conserved, or not), provided the basis\nfor the experimental searches for the new superpartners and Higgs bosons, starting with the first\nsearches for gluinos and photinos, selectrons and\nsmuons, at the end of the seventies. How the\nsupersymmetry should actually be broken, if indeed it is a symmetry of Nature, is not known\nyet. Many good reasons to work on the Supersymmetric Standard Model and its various extensions have been discussed, dealing with Dark\nMatter, supergravity, gauge coupling unification,\nextended supersymmetry, new spacetime dimensions, superstrings, \"M -theory\", ... . Despite all\nthe efforts made for more than twenty years to\ndiscover the new inos and sparticles, we are still\nwaiting for experiments to disclose this missing\nhalf of the SuperWorld. Still supersymmetry may\nwell be, beyond quantum physics and general relativity, the next fundamental symmetry to be discovered in the physics of fundamental particles\nand interactions, enlarging our vision of space and\ntime to the new anticommuting dimensions of superspace.\n\nREFERENCES\n1. Yu. A. Gol'fand and E.P. Likhtman, ZhETF\nPis. Red. 13 (1971) 452 [JETP Lett. 13 (1971)\n323].\n2. D.V. Volkov and V.P. Akulov, Phys. Lett. B\n46 (1973) 109.\n3. J. Wess and B. Zumino, Nucl. Phys. B 70\n(1974) 39; Phys. Lett. B 49 (1974) 52; Nucl.\nPhys. B 78 (1974) 1.\n4. P. Fayet, Nucl. Phys. B 90 (1975) 104.\n5. P. Fayet, Phys. Lett. B 64 (1976) 159; B 69\n(1977) 489.\n6. P. Fayet, Phys. Lett. B 70 (1977) 461.\n7. P. Fayet, in New Frontiers in High-Energy\nPhysics, Proc. Orbis Scientiae, Coral Gables\n(Florida, USA), 1978, eds. A. Perlmutter and\nL.F. Scott (Plenum, N.Y., 1978) p. 413.\n8. G.R. Farrar and P. Fayet, Phys. Lett. B 76\n(1978) 575.\n9. G.R. Farrar and P. Fayet, Phys. Lett. B 79\n(1978) 442.\n\n10. G.R. Farrar and P. Fayet, Phys. Lett. B 89\n(1980) 191.\n11. P. Ramond, Phys. Rev. D 3 (1971) 2415\n(1971); A. Neveu and J. Schwarz, Nucl. Phys.\nB 31 (1971) 86.\n12. J.-L. Gervais and B. Sakita, Nucl. Phys. B 34\n(1971) 632.\n13. J. Iliopoulos and B. Zumino, B 76 (1974) 310.\n14. P. Fayet and J. Iliopoulos, Phys. Lett. B 51\n(1974) 461.\n15. P. Fayet, Phys. Lett. B 58 (1975) 67; L.\nO'Raifeartaigh, Nucl. Phys. B 96 (1975) 331.\n16. S. Ferrara, D.Z. Freedman and P. van\nNieuwenhuizen, Phys. Rev. D 13 (1976) 3214;\nS. Deser and B. Zumino, Phys. Lett. B 62\n(1976) 335.\n17. E. Cremmer et al., Phys. Lett. B 147 (1979)\n105.\n18. P. Fayet, Phys. Lett. B 86 (1979) 272; B 175\n(1986) 471.\n19. P. Fayet, Nucl. Phys. B 78 (1974) 14.\n20. M. Gell-Mann, P. Ramond and R. Slansky,\nRev. Mod. Phys. 50 (1978) 721.\n21. P. Fayet, Phys. Lett. B 78 (1978) 417.\n22. P. Fayet, in History of original ideas and basic\ndiscoveries in Particle Physics, eds. H. Newman and T. Ypsilantis, Proc. Erice Conf.,\nNATO Series B 352 (Plenum, N.Y., 1996) p.\n639.\n23. P. Fayet, Phys. Lett. B 84 (1979) 416.\n24. L. Girardello and M.T. Grisaru, Nucl. Phys.\nB 194 (1982) 65.\n\n\f"}