{"id": "http://arxiv.org/abs/hep-th/0302173v2", "guidislink": true, "updated": "2003-04-21T16:48:42Z", "updated_parsed": [2003, 4, 21, 16, 48, 42, 0, 111, 0], "published": "2003-02-21T17:58:10Z", "published_parsed": [2003, 2, 21, 17, 58, 10, 4, 52, 0], "title": "Hopf Algebra Primitives in Perturbation Quantum Field Theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0302179%2Chep-th%2F0302206%2Chep-th%2F0302036%2Chep-th%2F0302215%2Chep-th%2F0302047%2Chep-th%2F0302017%2Chep-th%2F0302063%2Chep-th%2F0302048%2Chep-th%2F0302119%2Chep-th%2F0302163%2Chep-th%2F0302014%2Chep-th%2F0302069%2Chep-th%2F0302118%2Chep-th%2F0302212%2Chep-th%2F0302155%2Chep-th%2F0302090%2Chep-th%2F0302120%2Chep-th%2F0302092%2Chep-th%2F0302175%2Chep-th%2F0302224%2Chep-th%2F0302057%2Chep-th%2F0302144%2Chep-th%2F0302186%2Chep-th%2F0302127%2Chep-th%2F0302159%2Chep-th%2F0302061%2Chep-th%2F0302020%2Chep-th%2F0302049%2Chep-th%2F0302028%2Chep-th%2F0302082%2Chep-th%2F0302138%2Chep-th%2F0302046%2Chep-th%2F0302065%2Chep-th%2F0302210%2Chep-th%2F0302015%2Chep-th%2F0302070%2Chep-th%2F0302146%2Chep-th%2F0302143%2Chep-th%2F0302166%2Chep-th%2F0302112%2Chep-th%2F0302140%2Chep-th%2F0302078%2Chep-th%2F0302153%2Chep-th%2F0302071%2Chep-th%2F0302195%2Chep-th%2F0302067%2Chep-th%2F0302207%2Chep-th%2F0302208%2Chep-th%2F0302010%2Chep-th%2F0302027%2Chep-th%2F0302033%2Chep-th%2F0302189%2Chep-th%2F0302007%2Chep-th%2F0302225%2Chep-th%2F0302026%2Chep-th%2F0302181%2Chep-th%2F0302039%2Chep-th%2F0302197%2Chep-th%2F0302102%2Chep-th%2F0302205%2Chep-th%2F0302062%2Chep-th%2F0302228%2Chep-th%2F0302183%2Chep-th%2F0302226%2Chep-th%2F0302223%2Chep-th%2F0302160%2Chep-th%2F0302162%2Chep-th%2F0302109%2Chep-th%2F0302154%2Chep-th%2F0302182%2Chep-th%2F0302105%2Chep-th%2F0302009%2Chep-th%2F0302011%2Chep-th%2F0302022%2Chep-th%2F0302217%2Chep-th%2F0302111%2Chep-th%2F0302121%2Chep-th%2F0302060%2Chep-th%2F0302128%2Chep-th%2F0302076%2Chep-th%2F0302043%2Chep-th%2F0302012%2Chep-th%2F0302131%2Chep-th%2F0302123%2Chep-th%2F0302016%2Chep-th%2F0302211%2Chep-th%2F0302108%2Chep-th%2F0302100%2Chep-th%2F0302168%2Chep-th%2F0302050%2Chep-th%2F0302101%2Chep-th%2F0302167%2Chep-th%2F0302086%2Chep-th%2F0302096%2Chep-th%2F0302075%2Chep-th%2F0302178%2Chep-th%2F0302139%2Chep-th%2F0302002%2Chep-th%2F0302064%2Chep-th%2F0302169%2Chep-th%2F0302173&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hopf Algebra Primitives in Perturbation Quantum Field Theory"}, "summary": "The analysis of the combinatorics resulting from the perturbative expansion\nof the transition amplitude in quantum field theories, and the relation of this\nexpansion to the Hausdorff series leads naturally to consider an infinite\ndimensional Lie subalgebra and the corresponding enveloping Hopf algebra, to\nwhich the elements of this series are associated. We show that in the context\nof these structures the power sum symmetric functionals of the perturbative\nexpansion are Hopf primitives and that they are given by linear combinations of\nHall polynomials, or diagrammatically by Hall trees. We show that each Hall\ntree corresponds to sums of Feynman diagrams each with the same number of\nvertices, external legs and loops. In addition, since the Lie subalgebra admits\na derivation endomorphism, we also show that with respect to it these\nprimitives are cyclic vectors generated by the free propagator, and thus\nprovide a recursion relation by means of which the (n+1)-vertex connected Green\nfunctions can be derived systematically from the n-vertex ones.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0302179%2Chep-th%2F0302206%2Chep-th%2F0302036%2Chep-th%2F0302215%2Chep-th%2F0302047%2Chep-th%2F0302017%2Chep-th%2F0302063%2Chep-th%2F0302048%2Chep-th%2F0302119%2Chep-th%2F0302163%2Chep-th%2F0302014%2Chep-th%2F0302069%2Chep-th%2F0302118%2Chep-th%2F0302212%2Chep-th%2F0302155%2Chep-th%2F0302090%2Chep-th%2F0302120%2Chep-th%2F0302092%2Chep-th%2F0302175%2Chep-th%2F0302224%2Chep-th%2F0302057%2Chep-th%2F0302144%2Chep-th%2F0302186%2Chep-th%2F0302127%2Chep-th%2F0302159%2Chep-th%2F0302061%2Chep-th%2F0302020%2Chep-th%2F0302049%2Chep-th%2F0302028%2Chep-th%2F0302082%2Chep-th%2F0302138%2Chep-th%2F0302046%2Chep-th%2F0302065%2Chep-th%2F0302210%2Chep-th%2F0302015%2Chep-th%2F0302070%2Chep-th%2F0302146%2Chep-th%2F0302143%2Chep-th%2F0302166%2Chep-th%2F0302112%2Chep-th%2F0302140%2Chep-th%2F0302078%2Chep-th%2F0302153%2Chep-th%2F0302071%2Chep-th%2F0302195%2Chep-th%2F0302067%2Chep-th%2F0302207%2Chep-th%2F0302208%2Chep-th%2F0302010%2Chep-th%2F0302027%2Chep-th%2F0302033%2Chep-th%2F0302189%2Chep-th%2F0302007%2Chep-th%2F0302225%2Chep-th%2F0302026%2Chep-th%2F0302181%2Chep-th%2F0302039%2Chep-th%2F0302197%2Chep-th%2F0302102%2Chep-th%2F0302205%2Chep-th%2F0302062%2Chep-th%2F0302228%2Chep-th%2F0302183%2Chep-th%2F0302226%2Chep-th%2F0302223%2Chep-th%2F0302160%2Chep-th%2F0302162%2Chep-th%2F0302109%2Chep-th%2F0302154%2Chep-th%2F0302182%2Chep-th%2F0302105%2Chep-th%2F0302009%2Chep-th%2F0302011%2Chep-th%2F0302022%2Chep-th%2F0302217%2Chep-th%2F0302111%2Chep-th%2F0302121%2Chep-th%2F0302060%2Chep-th%2F0302128%2Chep-th%2F0302076%2Chep-th%2F0302043%2Chep-th%2F0302012%2Chep-th%2F0302131%2Chep-th%2F0302123%2Chep-th%2F0302016%2Chep-th%2F0302211%2Chep-th%2F0302108%2Chep-th%2F0302100%2Chep-th%2F0302168%2Chep-th%2F0302050%2Chep-th%2F0302101%2Chep-th%2F0302167%2Chep-th%2F0302086%2Chep-th%2F0302096%2Chep-th%2F0302075%2Chep-th%2F0302178%2Chep-th%2F0302139%2Chep-th%2F0302002%2Chep-th%2F0302064%2Chep-th%2F0302169%2Chep-th%2F0302173&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The analysis of the combinatorics resulting from the perturbative expansion\nof the transition amplitude in quantum field theories, and the relation of this\nexpansion to the Hausdorff series leads naturally to consider an infinite\ndimensional Lie subalgebra and the corresponding enveloping Hopf algebra, to\nwhich the elements of this series are associated. We show that in the context\nof these structures the power sum symmetric functionals of the perturbative\nexpansion are Hopf primitives and that they are given by linear combinations of\nHall polynomials, or diagrammatically by Hall trees. We show that each Hall\ntree corresponds to sums of Feynman diagrams each with the same number of\nvertices, external legs and loops. In addition, since the Lie subalgebra admits\na derivation endomorphism, we also show that with respect to it these\nprimitives are cyclic vectors generated by the free propagator, and thus\nprovide a recursion relation by means of which the (n+1)-vertex connected Green\nfunctions can be derived systematically from the n-vertex ones."}, "authors": ["M. Rosenbaum", "J. David Vergara", "H. Quevedo"], "author_detail": {"name": "H. Quevedo"}, "author": "H. Quevedo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0393-0440(03)00088-3", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0302173v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0302173v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, accepted for publication in J.Geom.and Phys", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0302173v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0302173v2", "journal_reference": null, "doi": "10.1016/S0393-0440(03)00088-3", "fulltext": "arXiv:hep-th/0302173v2 21 Apr 2003\n\nICN–2002–100, November 16, 2018\n\nHOPF ALGEBRA PRIMITIVES IN\nPERTURBATION QUANTUM FIELD\nTHEORY\nM. Rosenbaum∗, J. David Vergara† and H.\nQuevedo‡\nInstituto de Ciencias Nucleares,\nUniversidad Nacional Autónoma de México,\nA. Postal 70-543,\nMéxico D.F., México.\nAbstract\nThe analysis of the combinatorics resulting from the perturbative expansion of the transition amplitude in quantum field theories, and the relation of this expansion to the Hausdorff series leads naturally to consider\nan infinite dimensional Lie subalgebra and the corresponding enveloping\nHopf algebra, to which the elements of this series are associated. We show\nthat in the context of these structures the power sum symmetric functionals of the perturbative expansion are Hopf primitives and that they are\ngiven by linear combinations of Hall polynomials, or diagrammatically by\nHall trees. We show that each Hall tree corresponds to sums of Feynman\ndiagrams each with the same number of vertices, external legs and loops.\nIn addition, since the Lie subalgebra admits a derivation endomorphism,\nwe also show that with respect to it these primitives are cyclic vectors\ngenerated by the free propagator, and thus provide a recursion relation\nby means of which the (n+1)-vertex connected Green functions can be\nderived systematically from the n-vertex ones.\nMSC: 16W30, 57T05, 81T15, 81T75.\n\n∗ E-mail:\n\nmrosen@nuclecu.unam.mx\nvergara@nuclecu.unam.mx\n‡ E-mail: quevedo@nuclecu.unam.mx\n† E-mail:\n\n\f1\n\nIntroduction\n\nIt has been conjectured [1] that because of the interplay of Quantum Mechanics\nand General Relativity at the Planck scale, space-time ought to be regarded as a\nderived concept whose structure should follow from the properties of Quantum\nField Theory. Perturbative quantum field theory (PQFT), albeit its conceivable\nlimitations at distances of the order of the Planck length, is the only computational tool available at present, and so the elucidation of the mathematical\nstructures behind that theory is a suggestive first step in pursuing this line of\nthought. One of these structures, which is based on the original work of Kreimer\n[2] and further developed in [3, 4, 5, 6], is now generally known as the Hopf Algebra of Renormalization and it provides the underlying mathematics behind\nthe Forest Formula in the process of renormalization. Basically this Hopf algebra can be represented by Feynman diagrams or decorated rooted trees, where\ndecorations are one-particle irreducible (1PI) divergent diagrams without subdivergences. Other Hopf algebras related to rooted trees and to the Hopf Algebra\nof Renormalization have been discussed in the literature, such as the vector\nspace Hopf algebra of rooted trees of Larson and Grossman [7]. The connection\nof this algebra with the algebra of Kreimer and Connes was analyzed in [8] and\nmore recently revised in [9]. For a formulation in terms of a single mathematical\nconstruction of the several Hopf algebras described by rooted trees see van der\nLaan [10].\nThe essential point of the Kreimer-Connes formalism is that given that a\ntheory is renormalizable an appropriately defined twisted antipode, based on\nthe minimal subtraction scheme of renormalization, generates the counterterms\ncorresponding to the BPHZ Forest Formula and the antipode axiom provides\na systematic procedure for deriving the physically correct and finite expression\nfor a given diagram. However, the mere fact that the twisted antipode axiom,\nor for that matter the Forest Formula, provide a finite answer does not suffice\nto make the theory physical. It is crucial, in order that the theory be renormalizable, that the resulting counterterms are of the same form as those in the\noriginal Lagrangian and that they can be absorbed into the bare parameters\nof the renormalized Lagrangian in a consistent manner. Generally this is not\npossible, and in such a case the theory is described as non-renormalizable. Of\ncourse if we know a priori that the theory is renormalizable then the Hopf algebra of decorated rooted trees or of Feynman diagrams remains most valuable\nboth as the mathematical structure behind the Forest Formula as well as for a\nsystematic construction of renormalized Green functions.\nAnother Hopf algebra related to rooted trees by a canonical mapping is the\nalgebra of normal coordinates that was recently discussed in [11]. In that work\nundecorated rooted trees were considered, and the relevance of normal coordinates to the concept of k-primitiveness as well as their role in the process of\nrenormalization was analyzed. It was also shown there that for undecorated ladder trees, or to that effect for non-branched trees with only one decoration (such\n1\n\n\fas in rainbow diagrams), the renormalization of the associated normal coordinates is a one step procedure. However, when the diagrams for a theory involve\nmore than one decoration (as is usually the case) ladder normal coordinates are\nin general no longer primitive, even though one can still expect them to posses a\nmilder pole structure than that present in the rooted tree coordinates. Some of\nthe pertinent questions left open in the above cited paper concerned the physical\ninterpretation of the normal coordinates and whether perturbation theory could\nbe formulated directly in terms of them without having to go first through the\nalgebra of rooted trees or Feynman diagrams. These questions provided some\npartial motivation for the present work where we investigate some additional\nHopf algebra structures that can be associated naturally to the Hausdorff series\nexpansion of PQFT. Specifically, we show here that the power sum symmetric\nfunctionals of these perturbative expansions are elements of a free Lie subalgebra as well as Hopf primitives of its enveloping free algebra. Moreover these\nprimitives can be expressed as linear combinations of Hall polynomials and, diagrammatically, as Hall trees. We show also that a Hall tree corresponds to\nsums of Feynman diagrams, each with the same number of vertices, external\nlegs and loops.\nIn addition, since the Lie subalgebra admits a derivation endomorphism, we\nfurther show that - with respect to it - these primitives are cyclic vectors generated by the free propagator, and thus provide a recursion relation by means\nof which the (n+1)-vertex connected Green functions can be derived systematically from the n-vertex ones. Lastly we show that the Hopf primitives considered here are normal coordinates resulting from a canonical mapping applied to\nthe Poincaré-Birkhoff-Witt basis constructed from the complete homogeneous\nsymmetric functionals, which appear also naturally in the Hausdorff series expansion of PQFT. This combinatorics is reminiscent of the one appearing in\n[11], but the possibility of a deeper relationship between the two Hopf algebras,\nand therefore a possible physical interpretation for the normal coordinates in\n[11], requires further investigation.\nThe paper is structured as follows: In section 2 we begin with a brief review of the main steps that lead to the perturbative expansion of the transition\namplitude, and describe its relation to the Hausdorff series and to the associated Hopf algebras for which the power sum functionals are primitives. In\nsubsections 2.1.1-2.1.3 the free algebra related to these structures is discussed\nand it is shown that the functional primitives are linear combinations of the\nHall polynomials that generate the Lie subalgebra of our free algebra. We also\nshow that this Lie subalgebra admits a derivation endomorphism with respect\nto which all the primitives are cyclic vectors generated by the free propagator.\nThe diagrammatic representation of the primitives in terms of Hall trees is also\ndiscussed in this section and shown to give a clear image of this cyclicity and\nof the iteration process by means of which the (n + 1)-vertex connected Green\nfunctions can be constructed from the n-vertex ones. Section 3 is devoted to a\ndiscussion of our main results and possible lines of future related research. We\n2\n\n\falso give there an explicit and heuristic argument, based on a Birkhoff decomposition of the Hopf algebra considered here, which we believe helps to stress\nsome of the points made in this Introduction.\n\n2\n\nAlgebraic Structures in Perturbation Quantum Field Theory\n\nLet us begin with a brief summary of the essential steps in PQFT leading to\nthe Green functions, with the dual purpose of making our presentation self contained as well as for identifying the basic mathematical and physical entities to\nwhich the Hopf algebras considered here are related.\nFor an arbitrary field theory the Euclidean transition amplitude (the formulation in Minkowski space is achieved by analytic continuation) is given by\nZ\nR d\nWE [J] = N DΦ e− d x[L0 +Lint −J*Φ] .\n(1)\n\nHere Φ denotes the set of fields appearing in the theory, and J denotes the set of\narbitrary currents introduced to drive each field1 . Using functional derivatives\nthe amplitude (1) can be rewritten as\nWE [J] = e−hLint ( δJx )ix e−Z\nδ\n\nwhere Lint\n\n\u0010\n\nδ\nδJx\n\n\u0011\n\n0\n\n[J]\n\nW0 [0]\n\n(2)\n\nis the Lagrangian of interaction written in terms of functional\n0\n\nderivatives of the field currents J(x), and W0 [J] = e−Z [J] W0 [0] is the free generating functional. The symbol h ix stands for integration over the variable x\n(after acting to the right with the functional derivative). Note that the functional derivatives with respect to the currents act according to the Leibnitz rule\n0\non the term e−Z [J] , and functional derivatives that go through to the right of\nthat term cancel when acting on W0 [0]. Thus here WE [J] is a functional and\nnot an operator.\nTo simplify our exposition we shall consider the neutral scalar φ4 theory in\nEuclidean 4-dimensions when doing explicit calculations. It is well known that\nthis theory is renormalizable and a clear discussion of the steps leading to its\nrenormalization may be found in [12]. For this case the transition amplitude in\n(1) reduces to\nZ\nR 4 1\n2 2\n1\nWE [J] = N Dφ e− d x[ 2 ∂μ φ∂μ φ+ 2 m φ +V (φ)−Jφ] ,\n(3)\nand (2) becomes\nδ\n\nWE [J] = e−hV ( δJx )ix e−Z\n1 Following\n\n0\n\n[J]\n\nW0 [0],\n\n(4)\n\nRef.[12] we use the notation WE [J] for the generating functional of connected\nand disconnected graphs, and ZE [J] for the generating functional of connected graphs, sometimes the opposite notation is used in other works.\n\n3\n\n\fwhere\n\nZ\nδ\nλ δ4\n)ix = d4 x\n,\nδJx\n4! δJx4\nZ\nR 4 1\n2 2\n1\nW0 [0] = N Dφ e− d x[ 2 ∂μ φ∂μ φ+ 2 m φ ] ,\nhV (\n\nZ 0 [J] =\nand\n∆xy\n\n1\nhJ(x)∆xy J(y)ixy ,\n2\n\n1\n=\n(2π)4\n\nZ\n\nd4 p\n\n(5)\n(6)\n(7)\n\neip*(x−y)\np 2 + m2\n\n(8)\n\nis the Feynman propagator in 4-dimensional Euclidean space.\nWriting WE [J] = e−ZE [J] and rearranging (4) results in\n\u0010\n\u0010\n\u0011\n\u0011\n0\n0\nδ\nZE [J] = − ln W0 [0] + Z 0 [J] − ln 1 + eZ [J] e−hV ( δJ )i − 1 e−Z [J] (1) , (9)\n\nwhere, in order to make both sides of the above equation consistent, we have\nexplicitly included the action on the identity function of the operator inside the\n0\nlogarithm, so as to cancel derivations to the right of e−Z [J] . Now let\n\u0011\n\u0010\nX\n0\n0\nδ\nλk Sk [J],\n(10)\nσ(λ) := eZ [J] e−hV ( δJ )i − 1 e−Z [J] (1) =\nk≥1\n\nwhere the second equality is the formal power series expansion of the first one\nin terms of the coupling constant λ in the potential. If we further define\nX\nX\nψ(λ) :=\nλk ψk [J] = ln(1 +\nλk Sk [J]),\n(11)\nk≥1\n\nk≥1\n\nit then readily follows from (9) that\nZE [J] = − ln W0 [0] + Z 0 [J] −\n\nX\n\nλk ψk [J].\n\n(12)\n\nk≥1\n\nNote that in the theory of symmetric functions [13, 14] an expression like\n(11) relates the complete homogeneous symmetric functions to the so called\npower sum symmetric functions or Schur polynomials, so we can use the combinatorics of that theory to write down the explicit (invertible) relation between\nthe functionals ψk [J] and the Si [J], as homogeneous polynomials of order k in\nthe latter. This is given by\nψk [J] =\n\nX\n\n(−1)l(I)−1\n\n|I|=k\n\nSI\n,\nl(I)\n\n(13)\n\nP\nwhere I is a composition I = (i1 , . . . , ir ) of nonnegative integers, |I| = k ik is\nits weight, l(I) = r is its length and S I = Si1 Si2 . . . Sir . In terms of the Feynman diagrammatic representation, the ψk [J] correspond to linear combinations\n4\n\n\fof connected graphs each with k vertices.\nDefining the operator\nX\n\n=\n=\n\n\u0012\n\u0013\n0\n1 Z 0 [J]\nδ\n− e\nhV (\ne−Z [J]\n)ix\nλ\nδJx1 1\n\u0012\n\u0013\n1X 1\nδ\n0\nn\n−\n)ix ,\nad(Z [J]) hV (\nλ\nn!\nδJx1 1\n\n(14)\n\nn≥0\n\nwhere the adjoint operator in the second equality is defined as the right normed\nbracketing: ad(b)n (a) ≡ [b, [b, . . . , [b, a]] . . . ], one can verify that the functionals\nSk introduced above are given by the recursion relations\nS1 [J] = X(1)\n1\nX(Sn−1 [J])(1),\nSn [J] =\nn\n\n(15)\n\nwhere X(1) denotes the action of the operator (14) on the identity function.\nIn the same way that X generates a recursion relation for the functionals\nSk , we will show bellow that a derivation operator can be defined which when\nacting on the ψk [J] leads to expressions analogous to (15). We first analyze\nsome of the algebraic structures behind the operators occurring in (4) and (9).\n\n2.1\n\nAlgebraic Structures\n\nAs mentioned in the Introduction, one of our goals in this paper is to investigate\nthe relevance to the process of renormalization of Hopf algebra primitives that\noccur naturally at a prediagram stage in PQFT. Therefore these primitives must\nbe related to the two entities appearing in the perturbation expansion of the\ntransition amplitude, i.e. the complete homogeneous symmetric functionals and\nthe power sum symmetric functionals.\nFrom the theory of symmetric functions we know that one can associate respective Hopf algebra structures to these two sets of functionals for which the\nψk [J] are primitives. In addition to the above, there is a free algebra generated\nby the operator hV i and the functional Z 0 [J] for which the ψk [J] are also primitives. We describe these three Hopf algebras which are related by the following\ndiagram\n⊂ K <S{Ψk } >\nLK ({Ψk })\n\n֒→\n֒→\n\nψk\n5\n\nK <SY >\nLK (Y )\n\nS\n\nS\n\nK < {Sk } >≃ K < {ψk } >\n\n\f2.1.1\n\nThe Free Algebra K < Y > and its Hopf Algebra Structure\n\nLet K < Y > be the unital free associative K-algebra over a field of characteristic zero (including Q) and generated by the two-letter alphabet Y =\n{Z 0 [J], hV ( δJδ x )ix } of non-commuting variables, with concatenation as multiplication and unit (neutral) element 1 the empty word. Let LK (Y ) be the\ninfinite dimensional free Lie algebra on Y where its elements are submodules\nof K < Y > with Lie bracket as multiplication. K < Y > is the enveloping\nalgebra of LK (Y ). We can give K < Y > a Hopf algebra structure [15] by\ndefining a primitive coproduct on the alphabet letters:\n∆(1) =\n∆(Z 0 [J]) =\n∆(hV i)\n\n=\n\n1 ⊗ 1,\n1 ⊗ Z 0 [J] + Z 0 [J] ⊗ 1,\n\n(16)\n(17)\n\n1 ⊗ hV i + hV i ⊗ 1,\n\n(18)\n\nand extending it to words by the connection axiom. The antipode is given by\nS(a) =\n\n−a, (a = hV i, or Z 0 [J])\n\n(19)\n\nS(1) =\n\n1,\n\n(20)\n\nand is extended to words by the antihomorphism\nS(a1 . . . an ) = S(an ) . . . S(a1 ).\n\n(21)\n\nThe counit map ε : K < Y >→ K is defined on the generating letters by\nε(a) =\nε(1) =\n\n0 (a = hV i, or Z 0 [J])\n1,\n\n(22)\n(23)\n\nand is extended to words by the connection axiom. All the elements (Lie polynomials) P ∈ LK (Y ) are primitives of this Hopf algebra:\n∆(P ) = 1 ⊗ P + P ⊗ 1,\n\n(24)\n\nand\nS(P ) =\n\n−P,\n\n(25)\n\nε(P ) =\n\n(P, 1),\n\n(26)\n\nwhere (P, 1) is the coefficient in P of the unit element.\nWe introduce now on K < Y > a derivation which maps hV ( δJδx )ix onto 0,\nand Z 0 [J] onto X by means of the operator\nD = −X\n\n∂\n.\n∂Z 0 [J]\n\nClearly D is an endomorphism on K < Y >.\n\n6\n\n(27)\n\n\fSince Z 0 [J] and hV ( δJδ x )ix do not commute, the action of the derivation D\non an arbitrary function of Z 0 [J] is given by [15]:\nD(f (Z 0 [J])) =\n\nX 1\n\u0001\n\u0001\nad(Z 0 [J])k−1 DZ 0 [J] f (k) Z 0 [J] ,\nk!\n\n(28)\n\nk≥1\n\nand, in particular,\nD(e−Z\n\n0\n\n[J]\n\n) =\n\n=\n=\n=\n\nX 1\n0\nad(−Z 0 [J])k−1 (X) e−Z [J]\nk!\nk≥1\n!\n0\n0\nead(−Z [J]) − 1\n(X) e−Z [J]\n0\nad(−Z [J])\n0\n\n0\n\n0\n\ne−Z [J] (X)eZ [J] * e−Z [J]\n\u0013\n\u0012\n0\nδ\n1\nix e−Z [J] ,\n− hV\nλ\nδJx\n\n(29)\n\nwhere in going from the third to the last line we have made use of (14). Moreover\nsince D(hV ( δJδx )ix ) = 0, we immediately get\nn\n\nn\n\nλ D (e\n\n−Z 0 [J]\n\n)=\n\n\u0012\n\n−hV\n\n\u0012\n\n\u0013 \u0013n\n0\nδ\nix e−Z [J] .\nδJx\n\n(30)\n\nUsing now once more the fact that D is a derivation, we have that the exponential map μ = eλD is a homomorphism of algebras and\nμ(e−Z\n\n0\n\n[J]\n\n) =\n=\n\nX λn\n0\nDn (e−Z [J] )\nn!\nn≥0\n\u0012\n\u0013 \u0013n\nX 1 \u0012\n0\nδ\n−hV\nix e−Z [J]\nn!\nδJx\nn≥0\n\n=\n\nδ\n\ne−hV ( δJx )ix e−Z\n\n0\n\n[J]\n\n.\n\n(31)\n\nFurthermore, since μ is a continuous homomorphism,\n\u0011\n\u0010\n0\n0\nδ\ne−hV ( δJx )ix e−Z [J] = μ e−Z [J]\n=\n\n=\n\n0\n\neμ(−Z\n\n\n[J])\n\n\nX λn\nexp \nDn (Z 0 [J]) ,\nn!\n\n(32)\n\nn≥0\n\nwhere\n\n\u0012\n\u0013\n\u0012\n\u0013\n∂\n∂\n(Z 0 [J]).\nDn (Z 0 [J]) = (−1)n X\n.\n.\n.\nX\n∂Z 0 [J]\n∂Z 0 [J]\n{z\n}\n|\nn\n\n7\n\n(33)\n\n\fWriting\nδ\n\neΨ = e−hV ( δJx )ix e−Z\n\n0\n\n[J]\n\n,\n\n(34)\n\nwe obtain from (32) and (34) the Hausdorff series relation\nΨ = Z 0 [J] +\n\nX λn\nDk (Z 0 [J]).\nk!\n\n(35)\n\nn≥1\n\nLet us now define\n\n1 k 0\nD (Z [J]),\n(36)\nk!\nwhich exhibits the operators Ψk as cyclic vectors with respect to D generated\nby Z 0 [J], and rewrite X, introduced in (14), as\nΨk :=\n\nd\n\nX=−\n\n1X 1 0\n[Z [J], hV\nλ j=0 j!\n\n\u0012\n\n\u0013\nδ\nix ]j ,\nδJx\n\n(37)\n\nwhere [Z 0 [J], hV ( δJδx )ix ]j is defined recursively by [Z 0 [J], hV ( δJδx )ix ]j =\n[Z 0 [J], [Z 0 [J], hV ( δJδx )ix ]j−1 ], [Z 0 [J], hV ( δJδx )ix )]0 = hV ( δJδx )ix , and the upper\nindex d in the sum above is the degree of the functional derivative in hV ( δJδx )ix\n(n=4 for the φ4 theory).\nIt clearly follows from this and (33) that the cyclic vectors Ψk are elements\nof LK (Y ) and, hence, primitive elements of the Hopf algebra K < Y >.\nIn addition, since D is also an endomorphism on LK (Y ) there is a Hochschild\ncohomology associated with this algebra for which D is a 1-cochain D : LK (Y ) →\nLK (Y ) with coboundary\nbD(P ) = (id ⊗ D)∆(P ) − D(P ) ⊗ 1; P ∈ LK (Y ).\n\n(38)\n\nEvidently bD(P ) = 0, because of (24), so the Lie polynomials P , and in\nparticular the Ψk , are 1-cocycles for this cohomology.\nNote that by applying both sides of (35) to the identity function and recalling\n(4) we recover (12), with the functional ψk [J] given by\nψk [J] = −\n\n1 k 0\nD (Z [J])(1).\nk!\n\n(39)\n\nFurthermore, since the ψk [J] are made up by linear combinations of Lie monomials that do not cancel when acting from the left on the identity they are\nobviously also elements of LK (Y ) and primitives of the Hopf algebra K < Y >.\n\n8\n\n\fWe can derive a recursion relation for the cyclic functionals ψk [J] by observing that the right side of (39) can be written as\n\n\n\u0013\n\u0012\n\u0013 \n\u0012\n∂\n∂\n\nD (Z [J])(1) = (−1)  X\nX  (1).\n... X\n\n\n∂Z 0 [J]\n∂Z 0 [J]\n{z\n}\n|\nn\n\n0\n\nn\n\n(40)\n\nn−1\n\nIn particular, for n = 1\n\n−D(Z 0 [J])(1) =\n\n\u0012\n\nX\n\n\u0013\n∂\n0\n(Z\n[J])\n(1) = X(1) = ψ1 ,\n∂Z 0 [J]\n\n(41)\n\nwhich is in agreement with (15) and (13).\nTo further see how to interpret the right side of (40) for n ≥ 2, use (37)\nand note that in order to take into account the fact that the identity cancels\nfunctional derivatives acting on it, we must first apply the n − 1 derivations in\n(40) to X following the Leibnitz rule, evaluate each of the resulting derivations\non X inside the commutators by acting on the identity function according to\n(39), and finally act with the resulting bracket polynomial on the identity. Thus\n\u0012\u0012\n\u0013 \u0013\n1\n∂\nψ2 = −\nX\nX (1)\n2\n∂Z 0 [J]\n\u0012\n\u0013\u0012\n1\n∂\n1\n=\nX\nhV i − [hV i, Z 0 [J]] + [[hV i, Z 0 [J]], Z 0 [J]]\n2λ\n∂Z 0 [J]\n2\n\nd\nX\n1 0\n[Z [J], hV i]j  (1)\n+\nj!\nj=3\n=\n\n1\n1\n1\n(−[hV i, ψ1 ] + [[hV i, ψ1 ], Z 0 [J]] + [[hV i, Z 0 [J]], ψ1 ] + . . . )(1),\n2λ\n2\n2\n\n9\n\n(42)\n\n\f\u0012\u0012\n\u0013\u0012\n\u0013 \u0013\n∂\n∂\nX\nX\nX (1)\n∂Z 0 [J]\n∂Z 0 [J]\n\u0012\n\u0013\u0012\n∂\n1\n1\nX\n−[hV i, X] + [[hV i, X], Z 0 [J]]\n=−\n6λ\n∂Z 0 [J]\n2\n\u0013\n1\n+ [[hV i, Z 0 [J]], X] + . . . (1)\n2\n\u0012 \u0014\n\u0012\u0012\n\u0013 \u0013 \u0015\u0013\n∂\n1\n− hV i,\nX\nX (1)\n=−\n(43)\n6λ\n∂Z 0 [J]\n\u0014\u0014\n\u0012\u0012\n\u0013 \u0013 \u0015\n\u0015\n1\n∂\n+\nhV i,\nX\nX (1) , Z 0 [J]\n2\n∂Z 0 [J]\n\u0014\n\u0012\u0012\n\u0013 \u0013 \u0015\n\u0013\n∂\n1\n[hV i, Z 0 [J]],\nX\nX\n(1)\n+\n[[hV\ni,\nψ\n],\nψ\n]\n+\n.\n.\n.\n(1)\n+\n1\n1\n2\n∂Z 0 [J]\n1\n=−\n2[hV i, ψ2 ] − [[hV i, ψ2 ], Z 0 [J]] + [[hV i, ψ1 ], ψ1 ]\n6λ\n\u0001\n−[[hV i, Z 0 [J]], ψ2 ] + . . . (1).\n\nψ3 =\n\n1\n6\n\nIterating on the above, we get the general recursion relation\nψn+1 [J] =\n\n∂\n1\n1\nDψn [J] = −\nψ1\nψn .\nn+1\nn + 1 ∂Z 0 [J]\n\n\u0003\n\n(44)\n\nIt should be recalled\nhowever that inithe implementation of (44) one has to take\nPd 1 h 0\n1\nψ1 = − λ j=1 j! Z [J], hV ( δJδ x )ix , perform the derivations to the required\nj\n\norder and then evaluate on the identity function.\n\nWe can express the above results in graphical form by making use of Hall\ntrees. To this end recall [15] that each Hall tree h of order at least 2 can\nbe written as h = (h′ , h′′ ), where h′ and h′′ are the immediate left and right\nsubtrees, respectively, and such that the total ordering\nh < h′′ , h′ < h′′ and either h′ ∈ Y, or h′ = (x, y) and y > h′′\n\n(45)\n\nis satisfied. This ordering is lexicographical and is determined by the letters in\nthe alphabet Y that label the leaves. Also, each node in a tree corresponds to\na Lie bracket and the foliage f (h) of the tree is the canonical mapping defined\nby f (a) = a if a is in Y and f (h) = f (h′ )f (h′′ ) if h = (h′ , h′′ ) is of degree\n≥ 2. Now, since a Hall word is the foliage of a unique Hall tree, and since for\neach Hall word h there is a Lie polynomial Ph , it can be shown that these Hall\npolynomials form an infinite dimensional basis of the Lie algebra LK (Y ) viewed\nas a K-module. Parenthetically, one also has that the decreasing products of\nHall polynomials Ph1 . . . Phn , h1 ≥ . . . hn form a basis of the free associative\nalgebra K < Y >.\nConsequently, using the ordering hV i < Z 0 for our two letter alphabet Y and\n10\n\n\fthe algorithm given in the proof of Theorem 4.9 in [15], we can always write the\nψi [J]'s, as derived from (36) and (44), as linear combinations of Hall polynomials\n(equivalently Hall trees). Thus, for example\n\n\u0012\n1\nΨ1 ≡ X = −\nhV i −\nλ\n\n1\n+\n2\n\nhV i\n\nZ0\n\n1\n−\n6\n\nZ0\nhV i\n\nZ0\n\nZ0\nZ0\nhV i\n\nZ0\n\n1\n+\n24\n\nZ0\nZ0\nZ0\nhV i Z0\n\n\u0013\n, (46)\n\nso\n\nψ1 [J] = Ψ1 (1) = −\n\n1\n2λ\n\nZ0\nhV i\n\nZ0\n\n1\n+\n4λ\n\n\u0012\n\n+\n\n1\n6λ\n\nZ0\nZ0\nhV i\n\n−\n\nZ0\n\n1\n24λ\n\nZ0\nZ0\nZ0\nhV i Z0\n\n;\n\n(47)\n\nand\n\nΨ2\n\n=\n\n1\n−\n2λ\n\n−\n\n+\n\nψ2 [J] = −\n\nhV i\n\nΨ1\n\n1\n12λ\n\n\u0012\n\n1\n48λ\n\n\u0012\n\n1\n2λ\n\nZ0\nZ0\n\nhV i\n\n+\nhV i ψ1 [J]\n\n\u0012\n\n1\n+\n48λ\n\n\u0012\n\nhV i\n\n1\n4λ\nZ0\n\nZ0\n\nZ0\nΨ1\nZ0\nhV i Z0\n\nhV i\n\nψ1 [J]\n\nZ0\n\n\u0013\n\nψ1 [J]\n\n(48)\n\nψ1 [J]\nZ0\nZ0\nhV i Z0\n\n\u0013\n.(49)\n\n\u0013\n\nZ0\n\nZ0\nψ1 [J]\nZ0\nhV i Z0\n\n\u0013\n,\n\nΨ1\nZ0\nZ0\nhV i Z0\n\nZ0\nhV i\n\n+\n\nZ0\n\n+\n\nψ1 [J]\n\n+\n\nZ0\n\nZ0\nZ0\nψ1 [J]\nhV i Z0\n\nZ0\n\n+\n\nZ0\nhV i\n\n+\n\n+\n\nψ1 [J]\n\n+\n\nψ1 [J]\n\nZ0\nZ0\nZ0\nhV i ψ1 [J]\n\nZ0\nZ0\nΨ1\nhV i Z0\n\nhV i\n\nΨ1\nhV i\n\nZ0\n\nZ0\n\nZ0\n\n+\n\nΨ1\n\n\u0012\n\nΨ1\nhV i\n\nZ0\nhV i\n\n+\n\n+\n\nΨ1\n\n+\n\nΨ1\n\nZ0\nZ0\nZ0\nhV i Ψ1\n\n1\n−\n12λ\n\nZ0\nhV i\n\n\u0013\n\n+\n\n\u0013\n\nNote that (47) and (49) for the functionals ψ1 [J] and ψ2 [J] imply acting on\nthe identity function from the left with the diagrams and replacing in addition\nthe Ψ1 in the foliage of (48) by ψ1 [J]. The corresponding Hall tree for ψ2 [J]\n11\n\n\fis obtained by grafting (47) onto each of the branches labeled with ψ1 [J] and\nimplementing the above mentioned algorithm. The procedure is then iterated\nto whatever order of the ψ's one is interested.\nBy a straightforward calculation one can verify that the final expressions for\nψ1 [J] and ψ2 [J] in terms of propagators for the φ4 theory are\n1\n[h∆xa ∆xb ∆xc ∆xd Ja Jb Jc Jd i\n4!\n− 6h∆xx ∆xa ∆xb Ja Jb i + 3h∆2xx i],\n\nψ1 [J] = −\n\n1\n1\n1\nψ2 [J] = − hJa ∆ax ( ∆3xy + ∆xx ∆xy ∆yy )∆yb Jb ixyab\n2\n6\n4\n1\n− hJa ∆ax ∆2xy ∆yy ∆xb Jb ixyab\n8\n2\n+ hJa ∆ax ∆xx ∆xy ∆yb ∆yc ∆yd Jb Jc Jd ixyabcd\n4!\n3\nhJa Jb ∆ax ∆bx ∆2xy ∆yc ∆yd Jc Jd ixyabcd\n+\n2(4!)\n1\n−\nhJa Jb Jc ∆xa ∆xb ∆xc ∆xy ∆yd ∆ye ∆yf Jd Je Jf ixyabcdef\n2(3!)2\n3\n1\nh∆xx ∆2xy ∆yy ixy ,\n+ h∆4xy ixy +\n48\n2(4!)\n\n(50)\n\n(51)\n\nThe expressions for higher order ψ's are increasingly more lengthy, but amenable\nto a systematic derivation by the above procedure. This we have done by developing a REDUCE program which confirms the results given above.\n\n2.1.2\n\nThe Hopf algebra K < {Sk } >\n\nAs we have seen in Eq.(12) the power sum symmetric functionals ψk [J] appear\nnaturally in PQFT as a result of a perturbative expansion (in the coupling\nparameter of the theory) of the transition amplitude. In terms of the Si [J]\nthese ψk [J] are given (cf Eq.(13)) by the Schur polynomials. Using as generators the Si 's, one can construct a universal enveloping algebra K < {Sk } >\nby introducing a Poincaré-Birkhoff-Witt basis {1, Si1 , Si1 Si2 , . . . }, and defining\nmultiplication m as the disjoint union of the elements of this basis. Further, a\ncoalgebra structure can be generated by defining the coproduct\n∆(Sk ) =\n\nk\nX\n\nSi ⊗ Sk−i , S0 ≡ 1,\n\n(52)\n\ni=0\n\nand a counit ε as the augmentation of the algebra by\nε(S0 ) = 1, ε(Sk ) = 0, k 6= 0.\n12\n\n(53)\n\n\fWe can give this coalgebra the structure of a Hopf algebra by additionally\ndefining an antipode S as the involutive homomorphism (because of commutativity)\n ̃ k ),\nS(Sk ) = −Sk − m(S ⊗ id)∆(S\n(54)\n ̃ is the coproduct operation with the primitive contributions removed.\nwhere ∆\nSince K < {Sk } > is commutative, by the Milnor-Moore theorem there is a\ncocommutative Hopf algebra in duality with it which is necessarily isomorphic to\nthe universal enveloping algebra U(L), where L is a Lie algebra. The generators\nZi of L are infinitesimal characters of K < {Sk } >, i.e they are linear mappings\nZi : K < {Sk } >→ K < {Sk } > fulfilling the conditions :\nhZi , Sk i =\nhZi , Sk Sl i =\n\nδik ,\nhZi , Sk iε(Sl ) + ε(Sk )hZi , Sl i.\n\n(55)\n(56)\n\nWe shall denote [16] by ∂CharK < {Sk } > the set of infinitesimal characters of\nK < {Sk } >. Note that L is Abelian, since the coproduct in K < {Sk } > is\ncocommutative.\nP\nP\nThe exponential mapping i αi Zi → exp( i αi Zi ) ∈ G, equipped with a\nconvolution product ∗ and unit 1∗ :\nhχ ∗ η, Sk i =\nh1∗ , Sk i =\n\nhχ ⊗ η, ∆Sk i, χ, η ∈ G,\nε(Sk ),\n\n(57)\n(58)\n\ntogether with the inverse\nχ−1 = χ ◦ S,\n\n(59)\n\ngenerates a subgroup G of the group of characters of K < {Sk } >.\nG is dual to the Hopf algebra K < {Sk } > and it is multiplicative, i.e. it\nsatisfies\nhχ, Sk Sl i = hχ, Sk ihχ, Sl i χ ∈ G.\n(60)\nMoreover, from (57) and the fact that the Lie algebra of ∂CharK < {Sk } >\nis Abelian, we have that the convolutive product in our case reduces to\ne\n2.1.3\n\nP\n\ni\n\nαi Zi\n\n∗e\n\nP\n\nj\n\nβj Zj\n\n=e\n\nP\n\ni (αi +βi )Zi\n\n.\n\n(61)\n\nThe Hopf algebra K < {ψk } >\n\nThe Hopf algebra K < {Sk } > induces another Hopf algebra K < {ψk } > by\napplying a change to normal coordinates [11] to our original Poincaré-BirkhoffWitt basis, constructed from\nthe Si coordinates, by means of the map with the\nP\ncanonical element C = e i Zi ⊗ψi which acts as an identity map, i.e.:\nhe\n\nP\n\ni\n\nZi ⊗ψi\n\n, Sk ⊗ idi = Sk .\n13\n\n(62)\n\n\fIt is not difficult to verify that the non-linear relation between the ψk 's and\nSi 's resulting from (62) is given by (13), and that the ψk 's acquire a primitive\ncoproduct\n∆ψk = 1 ⊗ ψk + ψk ⊗ 1,\n(63)\nand an antipode given by\nS(ψk ) = −ψk .\n\n(64)\n\nNote that since (13) is invertible K < {Sk } >≃ K < {ψk } >.\nAs a parenthetical remark we point out that the normal coordinates that\nwe construct here differ from those recently discussed in [11] in relation to the\nHopf algebra of rooted trees, by the fact that in the context of the latter the\ncomultiplication given by (63) corresponded to non-branched trees, and that for\nthe more general case of branched trees it was determined by application of the\nBaker-Hausdorff-Campbell formula.\n\n2.2\n\nHopf Primitives and Connected Green Functions\n\nIn order to establish explicitely the relation of the ψk [J] functionals to the\nGreen functions, observe that because the n-legged connected Green functions\nin PQFT are obtained from the functional variation\n(n)\n\nGE (x1 , . . . , xn ) = −\n\nδ n ZE [J]\nδJ1 . . . δJn\n\nJ=0 ,\n\n(65)\n\nwe have that\nψk [J] =\n\n1 X 1\n(n)\nhG (x1 , . . . , xn )J1 . . . Jn i,\nλk n=0 (n)! k\n\n(66)\n\n(n)\n\nwhere Gk are the Euclidean Green functions resulting from adding all the connected Feynman graphs with k vertices and n external legs (n is even for the φ4\ntheory). Note also that (66) contains contributions from the Green functions\n(0)\nGk which correspond to vacuum terms. These contributions may be absorbed\nin the ln W0 [0] term in (12) via the normalization constant N .\nThe analytical expressions for the graphs composing the Green functions\nresult, in general, in ultraviolet divergences, and the standard procedure for removing them is to first apply dimensional regularization and then successively\nthe Forest Formula. It is at this stage where the Kreimer-Connes Hopf algebra formalism provides an important insight into the underlying mathematics\nbehind the Forest Formula of renormalization. Indeed, by noting that each\nFeynman diagram corresponds to a decorated rooted tree (or a sum of decorated rooted trees in the case of overlapping diagrams) and that these rooted\ntrees, as well as the diagrams themselves, are the generators of respective universal enveloping Hopf algebras, these authors have shown that the operation\nwith a twisted antipode on the algebra provides a systematic application of the\n14\n\n\fForest Formula and, consequently, a systematic procedure for generating the\ncounterterms needed by the theory in order to cancel the unwanted infinities.\nConnes and Kreimer further show [6] the relation between the algebra of characters, dual to their Hopf algebra, and the Birkhoff algebraic decomposition.\nA detailed exposition of these ideas may be found in the papers cited in the\nIntroduction.\nHere we only stress once more the fact that in our approach we deal with the\nHopf primitives ψk ∈ LK (Y ) rather than with Feynman graphs directly. As we\nhave seen, these Hopf primitives are Lie polynomials where each monomial is a\nHall tree that itself corresponds to a sum of Feynman diagrams with k-vertices\neach and an equal number of external legs and loops. This last observation can\nbe read off directly from the word composed by the foliage of a Hall tree. First\nbecause the number of external legs E in the Feynman diagrams constituting a\nHall tree is given by\nE = 2NZ 0 − N δ V,\n(67)\nδJ\n\nwhere\nNZ 0\nNδ\n\n=\n=\n\nnumber of times the letter Z 0 appears in the word\ndegree of the functional derivation in the potential\n\nV\n\n=\n=\n\nnumber of vertices\nnumber of times the letter hV i appears in the word,\n\nδJ\n\nso all Feynman diagrams composing a given Hall tree have the same number of\nexternal legs. Second, because the topology of the Feynman diagrams implies\nthat the number of loops is fixed by the number of vertices and the number of\nexternal legs by the relation\n(N − 2)V = E + 2L − 2,\n\n(68)\n\nwhere N is the total number of legs per vertex (N =4 for the φ4 theory), and\nL is the number of loops, so also all Feynman diagrams composing a Hall tree\nhave the same loop number.\n\n3\n\nDiscussion\n\nAs already mentioned in the Introduction, given that a theory is renormalizable,\nthe Hopf Algebra of Renormalization developed by Connes and Kreimer provides insight into the mathematical structures behind the Forest Formula and\nis extremely useful in numerical calculations since it gives a systematic procedure (amenable to computer programming [18]) for evaluating the renormalized\nGreen functions. In a parallel vein, the Hopf algebra K < Y > investigated\nhere, helps to exhibit some complementary mathematical structures associated\nwith the Hausdorff series expansion of perturbation theory.\n\n15\n\n\fWe have shown the relation of the ψk [J]'s to the Hall polynomials, and that\nof their graphic representation in terms of Hall trees to the Feynman diagrams.\nAlso, making use of the cyclic vector character of the ψk [J]'s with respect to\nthe derivation endomorphism D, which appears as part of the structure of the\nLie subalgebra of K < Y >, we have obtained a systematic procedure (also\nsubject to computer programming) for constructing all the Green functions of\nthe theory starting from the generator Z 0 [J]. Moreover, since each action of D\nintroduces an additional vertex in the commutators conforming the ψk [J]'s, one\ncould hope that a further study of this operator and its possible deformations\nwould result in further mathematical insights on the process of renormalization.\nNote, however, that because of the Hopf primitive character of our ψk [J]'s\nand their relation to the Green functions given by (66) one should not expect that the application of the algebraic Birkhoff decomposition to our Hopf\nalgebra should be immediately related to the Forest Formula. The Hopf Algebra of Renormalization begins where our Hopf algebra ends. Nonetheless,\na unital K-algebra homomorphism φ : {K < Y >} → A from the free algebra K < Y > to the (unital) K-algebra A of meromorphic functions on the\nRiemann sphere with poles at the origin, followed by a the Birkhoff decomposition allows us to exhibit more explicitely and in a heuristic fashion the\npoint made in the second paragraph of the Introduction. Indeed [16], if we\nlet A = A− ⊕ A+ be a Birkhoff sum of the K-linear multiplicative subspaces\nA− and A+ , where A− = {polynomials in z −1 without constant term} and\nA+ = {Restriction to (C − {0}) of functions in Holom(C)}, and if we further\nlet T : A → A− be the Rota-Baxter projection operator, satisfying the multiplicative constraints\nT (ab) + (T a)(T b) = T [(T a)b + a(T b)], a, b ∈ A,\n\n(69)\n\nthen the algebraic Birkhoff decomposition\nφ+ = φ− ⋆ φ,\n\n(70)\n\n(where the operator ⋆ denotes the convolution product (φ ⋆ φ′ )(w) = mA (φ ⊗\nφ′ )(∆w), φ, φ′ ∈ HomK−alg (K < Y >, A)), together with the Hopf primitive\ncharacter of the ψk [J]'s immediately imply that\nφ(ψk [J]) = φ+ (ψk [J]) − φ− (ψk [J]) = φ+ (ψk [J]) + T φ(ψk [J]).\n\n(71)\n\nThus, by virtue of (66),\nφ+ (ψk ) =\n\n1 X 1 \u0010 (n)\nhGk (x1 , . . . , xn )J1 . . . Jn i\nλk\n(n)!\nn≥1\n\u0011\n(n)\n−hT [Gk (x1 , . . . , xn )]J1 . . . Jn i ,\n\n(72)\n\nwhere we have put the projector T inside of the integration in the second term\nof (72) after taking into account that the currents Ji are good test functions, so\n16\n\n\fthe pole structure of the integrals is determined by that of the Green functions.\nIn addition, the projection by T to A− of the connected Green functions is\ntaken in the Mass Independent Renormalization Scheme.\nRecall now the basic equation of the renormalization group which relates\nthe dimensionally regularized bare and renormalized connected Green functions,\nand which in our notation reads:\n∂\n∂\n∂ X\n∂ X k\n(λb )k (ψk [J])b =\nλ (ψk [J])R .\n...\n...\n∂J1\n∂Jn\n∂J1\n∂Jn\nk≥0\n\n(73)\n\nk≥0\n\nIn the above, the subscript b denotes that the regularized Green functions\nin the momentum representation, occurring in the ψk [J]'s, are expressed in\nP\n(n)\nterms of the bare parameters of the theory, i.e. (ψk [J])b = n=0 (ψk [J])b =\nP\n(n)\n1\n1\n2\n2\nn=0 (n)! h(Gk )b (p1 , . . . , pn ; λb , mb , ǫ), λb = Zλ λ, mb = Zm m , (Jk )b =\nλk\nb\n\n−1/2\n\nZφ Jk , while the subscript R on the right side of (73) denotes the ψk 's evaluated with the renormalized Green functions. Furthermore, in the Mass Independent Scheme the counterterms contain no finite contributions and are\npolynomials in inverse powers of ǫ with coefficients depending only on λ, so the\nrenormalization parameters Zλ , Zφ and Zm are polynomials in inverse powers\nof ǫ with coefficients depending only on λ.\nIf we replace (71) in (73) and observe that the right side of the later equation\nis finite, we thus arrive at the following set of equations:\nX\n−n\n(n)\nlim [Finite{ (Zλ )k Zφ 2 (Gk (p1 , . . . , pn ; λ, Zm m2 , ǫ))(+) }] =\nǫ→0\n\nk≥0\n\nX\n\n(n)\n\n(Gk (p1 , . . . , pn ; λ, m, )R ,\n\n(74)\n\nk≥0\n\nand\nPoles{\n\nX\n\n−n\n\n(n)\n\n(Zλ )k Zφ 2 (Gk (p1 , . . . , pn ; λ, Zm m2 , ǫ))(−) } = 0,\n\n(75)\n\nk≥0\n\nwhere\n(n)\n\n(Gk (p1 , . . . , pn ; λ, Zm m2 , ǫ))(+) :=\n(n)\n\n(n)\n\n[Gk (p1 , . . . , pn , Zm m2 , ǫ) − T (Gk (p1 , . . . , pn , Zm m2 , ǫ)],\n\n(76)\n\nand\n(n)\n\n(n)\n\n(Gk (p1 , . . . , pn ; λ, Zm m2 , ǫ))(−) := T (Gk (p1 , . . . , pn , Zm m2 , ǫ).\n\n(77)\n\nBut if, and only if, the theory is renormalizable the equations (75) can be\nsolved consistently and order by order in the powers of λ, i.e. only then the\ncounterterms can be absorbed into the parameters of the theory, and only then\n17\n\n\fthe theory will be physical. Formally, the substitution of the resulting renormalization functions into the left side of (74) would then yield the physically\nmeaningful renormalized Green functions. In such a case, however, the standard\nrecursive elimination of subdivergences via the Forest Formula (or the ConnesKreimer Hopf algebra) would clearly be a more efficient manner to derive these\nquantities. On the other hand, the opposite is not necessarily true: The fact\nthat the forest formula provides a finite answer does not suffice to make the\ntheory physical, it is also necessary that the poles of the ill-defined regularized\nGreen functions can be absorbed into the bare parameters of the theory.\nTo conclude, we would like to comment on several other possible lines for\nfuture work in addition to the ones already mentioned. Thus, for example, since\nthere is a duality between concatenation and shuffle products [15, 19], there are\nactually two bialgebra structures on K < Y >: The one considered here with\nproduct (words) made out by concatenation of letters of the alphabet Y and\ncoproduct defined by (16-18), the other one with shuffle product and coproduct\ndefined by\nX\n∆′ (w) =\n(w, uv)u ⊗ v,\n(78)\nu,v∈Y ∗\n\n∗\n\nwhere Y is the free monoid on Y . It may be interesting to investigate the\nrelation of this other bialgebra to the primitives ψk [J] discussed here, and if\nthis relation has a possible relevance to renormalization.\nOne could also ask if it is possible to carry out a program starting from the\nHopf algebra of Feynman diagrams and perform a Legendre transformation to a\nHopf algebra of ψk , which would no longer be primitive, and by exponentiation\nto a Hopf algebra of Sk . It would be interesting then to consider not only the\nHopf algebra K{ψk } but also K{ψk }/ ∼, where ∼ stands for an equivalence\nrelation coming e.g. from a Ward identity (we are grateful to the referee for\npointing out this possible program). Some of these lines of work are under\npresent consideration and the results will be reported elsewhere.\n\n4\n\nAcknowledgment\n\nThe authors are grateful to Prof. Dirk Kreimer and to the referee for valuable\ncomments and suggestions regarding this work and recommendations leading to\nthe improvement of the presentation. We are also grateful to Dr. J.C. LópezVieyra for help with the graphs. We acknowledge partial support from CONACYT project G245427-E (M.R.), DGAPA-UNAM grant IN112401 (H.Q.), and\nDGAPA-UNAM grant IN117000 (J.D.V.).\n\nReferences\n[1] A. Connes and D. Kreimer, Lessons from quantum field theory, Lett. Math.\nPhys. 48, 85-96 (1999).\n18\n\n\f[2] D. Kreimer, On the Hopf algebra structure of perturbative quantum field\ntheories, Adv. Theor. Math. Phys. 2, 303-334 (1998).\n[3] D. Kreimer, On overlapping divergences, Commun. Math. Phys. 204, 669689 (1999).\n[4] D. Kreimer, Combinatorics of (perturbative) quantum field theory,\nPhys.Rept. 363, 387-424 (2002), hep-th/00110059.\n[5] A. Connes and D. Kreimer, Hopf algebras, renormalization and noncommutative geometry, Commun. Math. Phys. 199, 203-242 (1998); A. Connes\nand D. Kreimer, From local perturbation theory to Hopf and Lie algebras\nof Feynman graphs, Lett.Math.Phys. 56, 3-15 (2001).\n[6] A. Connes and D. Kreimer, Renormalization in quantum field theory and\nthe Riemann-Hilbert problem I: the Hopf algebra structure of graphs and\nthe main theorem, Commun. Math. Phys. 210 , 249-273 (2000); A. Connes\nand D. Kreimer, Renormalization in quantum field theory and the RiemannHilbert problem II: the β-function, diffeomorphisms and the renormalization\ngroup, Commun. Math. Phys. 216, 215-241 (2001).\n[7] R. Grossman and R.G. Larson, Hopf-algebraic structure of families of trees,\nJ. Algebra 126, 184-210 (1989).\n[8] F. Panaite, Relating the Connes-Kreimer and Grossman-Larson Hopf algebras built on rooted trees, Lett. Math. Phys. 51, 211-219 (2000).\n[9] M. E. Hoffman, Combinatorics of rooted trees and Hopf algebras,\narXiv:math., CO/0201253.\n[10] P. van der Laan, Some Hopf algebras of trees, arXiv:math., QA/0106244.\n[11] C. Chryssomalakos, H. Quevedo, M Rosenbaum and J.D. Vergara, Normal\ncoordinates and primitive elements in the Hopf algebra of renormalization,\nCommun. Math. Phys. 225, 465-485 (2002).\n[12] P. Ramond Field Theory. A Modern Primer, Frontiers in physics: Lecture\nNotes Series 51. Benjamin/Cummings Publishing Coompany Inc., 1981.\n[13] I.G. Macdonald, Symmetric functions and Hall polynomials, Oxford Math.\nMonographs, Oxford university Press, 1995.\n[14] I.M. Gelfand, D. Krob, A. Lascoux, B. Leclerc, V.S. Retakh and J.Y. Thibon, Noncommutative Symmetric functions, hep-th/9407124.\n[15] C. Reutenauer, Free Lie Algebras, London Mathematical Society Monographs New Series, Oxford University Press Inc, 1993.\n[16] D.\nKastler,\nFields\nmath-ph/0104017.\n\nInstitute\n\n19\n\nCommunications\n\nXX\n\n(2001),\n\n\f[17] D. Kreimer, Chen's iterated integral represents the operator product expansion, Adv. Theor. Math. Phys. 3 , 627-670 (1999).\n[18] D.J. Broadhurst and D. Kreimer, Renormalization automated by Hopf algebra, J. Symb. Comp. 27, 581 (1999).\n[19] M. Sweedler, Hopf Algebras, Benjamin, (1969).\n\n20\n\n\f"}