{"id": "http://arxiv.org/abs/hep-ph/0606050v1", "guidislink": true, "updated": "2006-06-05T15:11:11Z", "updated_parsed": [2006, 6, 5, 15, 11, 11, 0, 156, 0], "published": "2006-06-05T15:11:11Z", "published_parsed": [2006, 6, 5, 15, 11, 11, 0, 156, 0], "title": "The Role of Invariant Functions in Understanding Masses and Mixings", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0606005%2Chep-ph%2F0606043%2Chep-ph%2F0606059%2Chep-ph%2F0606131%2Chep-ph%2F0606209%2Chep-ph%2F0606305%2Chep-ph%2F0606271%2Chep-ph%2F0606050%2Chep-ph%2F0606237%2Chep-ph%2F0606321%2Chep-ph%2F0606250%2Chep-ph%2F0606122%2Chep-ph%2F0606152%2Chep-ph%2F0606147%2Chep-ph%2F0606254%2Chep-ph%2F0606079%2Chep-ph%2F0606085%2Chep-ph%2F0606207%2Chep-ph%2F0606159%2Chep-ph%2F0606232%2Chep-ph%2F0606089%2Chep-ph%2F0606107%2Chep-ph%2F0606138%2Chep-ph%2F0606273%2Chep-ph%2F0606117%2Chep-ph%2F0606185%2Chep-ph%2F0606163%2Chep-ph%2F0606091%2Chep-ph%2F0606307%2Chep-ph%2F0606015%2Chep-ph%2F0606214%2Chep-ph%2F0606182%2Chep-ph%2F0606009%2Chep-ph%2F0606156%2Chep-ph%2F0606166%2Chep-ph%2F0606168%2Chep-ph%2F0606019%2Chep-ph%2F0606211%2Chep-ph%2F0606063%2Chep-ph%2F0606206%2Chep-ph%2F0606143%2Chep-ph%2F0606037%2Chep-ph%2F0606192%2Chep-ph%2F0606175%2Chep-ph%2F0606275%2Chep-ph%2F0606048%2Chep-ph%2F0606035%2Chep-ph%2F0606141%2Chep-ph%2F0606184%2Chep-ph%2F0606142%2Chep-ph%2F0606115%2Chep-ph%2F0606227%2Chep-ph%2F0606012%2Chep-ph%2F0606001%2Chep-ph%2F0606231%2Chep-ph%2F0606304%2Chep-ph%2F0606263%2Chep-ph%2F0606264%2Chep-ph%2F0606289%2Chep-ph%2F0606073%2Chep-ph%2F0606308%2Chep-ph%2F0606313%2Chep-ph%2F0606197%2Chep-ph%2F0606169%2Chep-ph%2F0606097%2Chep-ph%2F0606007%2Chep-ph%2F0606069%2Chep-ph%2F0606082%2Chep-ph%2F0606137%2Chep-ph%2F0606267%2Chep-ph%2F0606174%2Chep-ph%2F0606303%2Chep-ph%2F0606062%2Chep-ph%2F0606196%2Chep-ph%2F0606003%2Chep-ph%2F0606151%2Chep-ph%2F0606096%2Chep-ph%2F0606041%2Chep-ph%2F0606210%2Chep-ph%2F0606051%2Chep-ph%2F0606139%2Chep-ph%2F0606070%2Chep-ph%2F0606014%2Chep-ph%2F0606323%2Chep-ph%2F0606100%2Chep-ph%2F0606223%2Chep-ph%2F0606146%2Chep-ph%2F0606272%2Chep-ph%2F0606270%2Chep-ph%2F0606087%2Chep-ph%2F0606030%2Chep-ph%2F0606284%2Chep-ph%2F0606047%2Chep-ph%2F0606078%2Chep-ph%2F0606193%2Chep-ph%2F0606238%2Chep-ph%2F0606135%2Chep-ph%2F0606148%2Chep-ph%2F0606294%2Chep-ph%2F0606276%2Chep-ph%2F0606160&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Role of Invariant Functions in Understanding Masses and Mixings"}, "summary": "One of the central questions in theoretical particle physics, since already\nseveral decades, has been that of \"masses and mixings of the quarks. With the\nentry of neutrino oscillations into the field, the issue of lepton masses has\nadded a new dimension to the problem. In the literature one finds many models\nof quark and lepton mass matrices. However, the mass and mixing problems remain\nunsolved.\n  In this talk I will present my own contributions to this field, however as\nyou may expect without offering a solution. I encourage you to go ahead and\nthink about the problem but be aware of the pitfalls.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0606005%2Chep-ph%2F0606043%2Chep-ph%2F0606059%2Chep-ph%2F0606131%2Chep-ph%2F0606209%2Chep-ph%2F0606305%2Chep-ph%2F0606271%2Chep-ph%2F0606050%2Chep-ph%2F0606237%2Chep-ph%2F0606321%2Chep-ph%2F0606250%2Chep-ph%2F0606122%2Chep-ph%2F0606152%2Chep-ph%2F0606147%2Chep-ph%2F0606254%2Chep-ph%2F0606079%2Chep-ph%2F0606085%2Chep-ph%2F0606207%2Chep-ph%2F0606159%2Chep-ph%2F0606232%2Chep-ph%2F0606089%2Chep-ph%2F0606107%2Chep-ph%2F0606138%2Chep-ph%2F0606273%2Chep-ph%2F0606117%2Chep-ph%2F0606185%2Chep-ph%2F0606163%2Chep-ph%2F0606091%2Chep-ph%2F0606307%2Chep-ph%2F0606015%2Chep-ph%2F0606214%2Chep-ph%2F0606182%2Chep-ph%2F0606009%2Chep-ph%2F0606156%2Chep-ph%2F0606166%2Chep-ph%2F0606168%2Chep-ph%2F0606019%2Chep-ph%2F0606211%2Chep-ph%2F0606063%2Chep-ph%2F0606206%2Chep-ph%2F0606143%2Chep-ph%2F0606037%2Chep-ph%2F0606192%2Chep-ph%2F0606175%2Chep-ph%2F0606275%2Chep-ph%2F0606048%2Chep-ph%2F0606035%2Chep-ph%2F0606141%2Chep-ph%2F0606184%2Chep-ph%2F0606142%2Chep-ph%2F0606115%2Chep-ph%2F0606227%2Chep-ph%2F0606012%2Chep-ph%2F0606001%2Chep-ph%2F0606231%2Chep-ph%2F0606304%2Chep-ph%2F0606263%2Chep-ph%2F0606264%2Chep-ph%2F0606289%2Chep-ph%2F0606073%2Chep-ph%2F0606308%2Chep-ph%2F0606313%2Chep-ph%2F0606197%2Chep-ph%2F0606169%2Chep-ph%2F0606097%2Chep-ph%2F0606007%2Chep-ph%2F0606069%2Chep-ph%2F0606082%2Chep-ph%2F0606137%2Chep-ph%2F0606267%2Chep-ph%2F0606174%2Chep-ph%2F0606303%2Chep-ph%2F0606062%2Chep-ph%2F0606196%2Chep-ph%2F0606003%2Chep-ph%2F0606151%2Chep-ph%2F0606096%2Chep-ph%2F0606041%2Chep-ph%2F0606210%2Chep-ph%2F0606051%2Chep-ph%2F0606139%2Chep-ph%2F0606070%2Chep-ph%2F0606014%2Chep-ph%2F0606323%2Chep-ph%2F0606100%2Chep-ph%2F0606223%2Chep-ph%2F0606146%2Chep-ph%2F0606272%2Chep-ph%2F0606270%2Chep-ph%2F0606087%2Chep-ph%2F0606030%2Chep-ph%2F0606284%2Chep-ph%2F0606047%2Chep-ph%2F0606078%2Chep-ph%2F0606193%2Chep-ph%2F0606238%2Chep-ph%2F0606135%2Chep-ph%2F0606148%2Chep-ph%2F0606294%2Chep-ph%2F0606276%2Chep-ph%2F0606160&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "One of the central questions in theoretical particle physics, since already\nseveral decades, has been that of \"masses and mixings of the quarks. With the\nentry of neutrino oscillations into the field, the issue of lepton masses has\nadded a new dimension to the problem. In the literature one finds many models\nof quark and lepton mass matrices. However, the mass and mixing problems remain\nunsolved.\n  In this talk I will present my own contributions to this field, however as\nyou may expect without offering a solution. I encourage you to go ahead and\nthink about the problem but be aware of the pitfalls."}, "authors": ["C. Jarlskog"], "author_detail": {"name": "C. Jarlskog"}, "author": "C. Jarlskog", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0031-8949/2006/T127/023", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0606050v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0606050v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Talk presented at the conference SNOW 2006", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0606050v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0606050v1", "journal_reference": "Phys.Scripta T127 (2006) 64-66", "doi": "10.1088/0031-8949/2006/T127/023", "fulltext": "The Role of Invariant Functions in Understanding Masses and Mixings\nC. Jarlskog\nDivision of Mathematical Physics\nLTH, Lund University\nBox 118, S-22100 Lund, Sweden\n\narXiv:hep-ph/0606050v1 5 Jun 2006\n\nAbstract\nOne of the central questions in theoretical particle physics, since already several decades,\nhas been that of \"masses and mixings of the quarks. With the entry of neutrino oscillations\ninto the field, the issue of lepton masses has added a new dimension to the problem. In the\nliterature one finds many models of quark and lepton mass matrices. However, the mass and\nmixing problems remain unsolved.\nIn this talk I will present my own contributions to this field, however as you may expect\nwithout offering a solution. I encourage you to go ahead and think about the problem but\nbe aware of the pitfalls.\n\n1\n\nIntroduction\n\nUnderstanding the pattern of masses and mixings of the fundamental fermions is generally considered to be extremely important. In the literature one finds several methods of approaching this\nproblem. Let me consider first the quark sector and mention only three approaches.\nThe first one could be called the \"brute force method\". One makes ad hoc assumptions about\nthe quark mass matrices, diagonalises them and determines the masses and mixings. An ambitious\napproach within this category is to \"scan\" all possible mass matrices. Actually, assuming that there\nare three families, we know the quark mass matrices from experiments (though not accurately)\nsince about twenty years already! Why then scan and look for something that you already have\nat hand? The reason, I believe, is that one hopes to find an \"elegant\" solution which may lead to\na deeper insight and understanding.\nA second method is to go beyond the standard model. After all, within the Standard Model,\nthe masses and mixings are arbitrary parameters to be determined by experiments. But, for\nexample, in grand unified models one may make predictions for ratios of masses. However, the\nsituation is not yet satisfactory.\nA third method is to try to detect numerical relations among either masses or masses and\nmixings or the mixing angles themselves, hoping that these may indicate a profitable direction for\nfurther work. One recent example is the so-called quark-lepton complementarity relations which\nhave recently enjoyed some popularity.\n\n2\n\nWhy invariant functions\n\nIn mid 1980's a question which was being asked was how does one define maximal CP violation in\nthe Standard Model and is CP maximally violated as is parity? As is often the case, there were\n1\n\n\fconflicting opinions on what was meant by maximal CP violation. Some authors were advocating\nthat CP is maximally violated if the CP phase in the quark mixing matrix is 90 degrees. However,\nsuch a definition did not make sense because there is no such unique CP phase. This phase is\nconvention dependent, your CP phase is in general a function of my CP phase and mixing angles.\nTherefore it was important to understand the structure of CP violation in the Standard Model.\nIt turned out that there is indeed a convention independent invariant for CP violation [1] and this\ngave rise to the concept of invariant functions of mass matrices [2]. These were further studied in\n[3].\n\n3\n\nDefinition of invariant functions\n\nThe gauge structure of the Standard Model is defined by the product of three local unitary groups\nSU(3) × SU(2) × U(1). However, in the quark sector there are additional global symmetries, as\nfollows. For n families, we have as usual n left-handed doublets as well as 2n right-handed singlets,\n\u0012\n\u0013\nuj\n, u′j ,\nd′j\n(1)\ndj\nwhere j = 1 − n. Here the uj and dj stand for the left-handed up-type and down-type quarks\nrespectively while their primed counterparts represent the right-handed singlets. We can thus\nform four vectors\n ′ \n ′ \n\n\n\n\nd1\nu1\nd1\nu1\n′ \n′ \n\n\n d2 \n u2 \nu\n , Q′u =  2  , Q′d =  d2 \n , Qd = \n(2)\nQu = \n . \n . \n . \n . \nd′n\nu′n\ndn\nun\nIn special relativity we learn that physics does not depend on the choice of the inertial frame of\nreference. Something similar happens here where the frames are related to each other by unitary\nrotations. The transformations between these frames correspond to:\nI. Rotating the right-handed up-type quarks by an arbitrary global unitary matrix, i.e., Q′u →\n\nXu′ Q′u .\n\nII. Rotating the right-handed down-type quarks by an arbitrary global unitary matrix, Q′d →\nXd′ Q′d .\nIII. Rotating the left-handed up-type and down-type quarks simultaneously with the same\nunitary matrix Qu → XQu , Qd → XQd .\nThe X's above are all arbitrary unitary matrices.\nIV. In addition to the above symmetries there is also the freedom of choosing the phases of\nthe physical quarks.\nIn this article, due to lack of allocated space, I will only briefly list a number of results that I\nhave obtained, some in collaboration with colleagues, by making use of the above symmetries.\n2\n\n\fThe first two symmetries can be used to make the quark mass matrices Hermitian without loss\nof generality , if one so wishes. This is useful for certain applications [4].\nThe symmetry denoted by III gives the largest class of invariant functions. These functions appear\noften in physics. Indeed what enters in the Standard Model is not the mass matrices Mu and Md\nfor the up-type and down-type quarks respectively but\nSu ≡ Mu Mu† , Sd ≡ Md Md†\n\n(3)\n\nThese are frame dependent. Under III they change\nSu → XSu X † ,\n\nSd → XSd X †\n\n(4)\n\nFor the case of three families one may construct an invariant function that automatically keeps\ntrack of the 14 conditions that are required to get CP violation. This function is given by ([1],\n[2]).\n(5)\ndet [Su , Sd ] = 2iJ v(Su )v(Sd )\nwhere J is an invariant whose magnitude equals twice the area of any of the six by now well-known\nunitarity triangles [5]. The quantities v(Su ) and v(Sd ) are given by v(Su ) = (m2u − m2c )(m2c −\nm2t )(m2t − m2u ) and v(Sd ) = (m2d − m2s )(m2s − m2b )(m2b − m2d ) (for a pedagogical discussion see [6]).\nLooking into literature, we see the determinant in Eq.(5) in essentially every computation\ninvolving CP violation, in all its glory when all the six quarks enter on equal footing but otherwise\nin a well-defined truncated form, where some factors are missing due to assumptions made in the\ncalculation [3]. Examples of the first kind are the renormalization of the θ-parameter of QCD by\nthe electroweak interactions and the calculation of the baryon asymmetry of the universe in the\nstandard model. An example of the second kind is the computation of the electric dipole moment\nof a quark, say the down quark. Since in such a computation, the down quark appears in the\nexternal legs, it is tacitly assumed that we know the identity of this quark, i.e., md 6= ms and\nmd 6= mb . Therefore the factors (m2d − m2s ) and (m2b − m2d ) are missing but all the other factors\nare present.\nThe above commutator is the simplest in a family of commutators of functions of mass matrices\n[2] which I will not discuss here. These give us new invariant functions, some of which enter in\nthe computation of neutrino oscillations [7]. In addition, for example, the absolute values of the\nelements of the quark mixing matrix are measurable quantities and thus invariant functions. These\nfunctions were constructed in [3] (see also [8]).\n\n4\n\nTextures and quark-lepton relations\n\nTheorists love zeros. Generally zeros in the mass matrices make their diagonalisation and thus life\nsimpler. However, we have seen that such zeros are not invariants! If you give me mass matrices\nwith some zeros I may use symmetry III whereby the zeros could evaporate. In the case of leptons\nin most models one ends up with an effective three-by-three mass matrix for the neutrinos. In this\ncase there is no known justification for making assumptions about how the neutrino mass matrix\nshould look like in a frame where the charged-lepton mass matrix is diagonal. This frame is highly\n3\n\n\f\"fine-tuned\". You have to ask yourself how does the Standard Model find this very special frame\nin an infinite class of all possible frames?\nMy problem with the quark-lepton complementarity relations (see the talk by Mohapatra where\nthe subject is briefly discussed) is again that such relations are not invariants. Mixing angles, for\nthree or more families, are convention dependent. Your mixing angles and phases are in general\nfunctions of my corresponding quantities. Even the order in which the Euler-type rotations are\nintroduced is not preset. Let us take a very simple example. As mentioned before, in most models\nthe leptonic mixing matrix appears essentially in the same form as the quark mixing matrix. In a\nsimplified notation we have\n\n\nν1\n(e, μ, τ )U  ν2 \n(6)\nν3\n\nSuppose that we decide to write the mixing matrix U in two different but equivalent forms\n′\n′\n′\nV ′ = R12\nR13\nR23\n\nV = R23 R13 R12 ,\n\n(7)\n\nwhere Rjk denotes a rotation in the jk-plane by the angle θjk while its primed counterpart denotes\n′\nthe same rotation by the angle θjk\n. In this example the second matrix is obtained from the first\n′\none by transposition and redefinition of the angles, V ′ = Ṽ (θjk → −θjk\n).\n′\nNow compare the two limits θ13 → 0 and θ13 . For nondegenerate neutrinos they are physically\ninequivalent. In one case the electron couples only to two physical neutrinos while the muon and\nthe tau couple to all three. In the other case it is the tau that couples only to two neutrinos.\nThis simple example shows that it doesn't make sense to compare mixing angles as these are\nill-defined. The problems become more serious when one adds mixing angles from the quark and\nlepton sectors. We don't even know whether we should add or subtract, what are the relative\nphases, etc. Some of these issues have been discussed in [9].\n\n5\n\nOutlook\n\nThe issue of masses and mixings remains an unsolved problem that deserves our attention. However, we should always keep in mind that important results can't be frame dependent. So, if you\nhave an important message to transmit, you should be able to formulate it in an invariant form.\nUnfortunately, I have no space to describe some work done along this line [10], nor some work\nthat I have done on parameterisation of unitary matrices [11] which may be of interest to you.\n\n6\n\nAcknowledgements\n\nI wish to thank the Organisers of the SNOW 2006, specially Tommy Ohlsson, for a wonderful\nmeeting where this talk was presented.\n\n4\n\n\fReferences\n[1] C. Jarlskog, Phys. Rev. Lett. 55 (1985) 1039\n[2] C. Jarlskog, Zeit. f. Phys. C29 (1985) 491 C29 (1985) 491\n[3] C. Jarlskog, Phys. Rev. D35 (1987) 1685; ibid D36 (1987) 2128\n[4] P. H. Frampton and C. Jarlskog, Phys. Lett. B 154 (1985) 421\n[5] C. Jarlskog and R. Stora, Phys. Lett. B208 (1988) 268\n[6] C. Jarlskog in CP Violation, Ed. C. Jarlskog (World Scientific, 1989) p. 3\n[7] C. Jarlskog, Phys. Lett. B 609 (2005) 323\n[8] C Jarlskog and A Kleppe, Nucl. Phys. B286 (1987) 245\n[9] C. Jarlskog, Phys. Lett. B 625 (2005) 63\n[10] P. Harrison and W. G. Scott, , Phys. Lett. B 628 (2005) 93\n[11] C. Jarlskog, J. Math. Phys. 46 (2005) 103508;\nibid 47 (2006) 013507\n\n5\n\n\f"}