{"id": "http://arxiv.org/abs/hep-ph/0203201v2", "guidislink": true, "updated": "2002-07-18T09:12:10Z", "updated_parsed": [2002, 7, 18, 9, 12, 10, 3, 199, 0], "published": "2002-03-21T01:51:41Z", "published_parsed": [2002, 3, 21, 1, 51, 41, 3, 80, 0], "title": "Extraction of alpha_s from the Gross--Llewellyn Smith sum rule using\n  Borel resummation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0203121%2Chep-ph%2F0203129%2Chep-ph%2F0203103%2Chep-ph%2F0203201%2Chep-ph%2F0203231%2Chep-ph%2F0203102%2Chep-ph%2F0203010%2Chep-ph%2F0203002%2Chep-ph%2F0203070%2Chep-ph%2F0203004%2Chep-ph%2F0203087%2Chep-ph%2F0203258%2Chep-ph%2F0203054%2Chep-ph%2F0203151%2Chep-ph%2F0203040%2Chep-ph%2F0203135%2Chep-ph%2F0203123%2Chep-ph%2F0203224%2Chep-ph%2F0203017%2Chep-ph%2F0203122%2Chep-ph%2F0203145%2Chep-ph%2F0203146%2Chep-ph%2F0203263%2Chep-ph%2F0203111%2Chep-ph%2F0203131%2Chep-ph%2F0203252%2Chep-ph%2F0203106%2Chep-ph%2F0203214%2Chep-ph%2F0203074%2Chep-ph%2F0203063%2Chep-ph%2F0203067%2Chep-ph%2F0203097%2Chep-ph%2F0203026%2Chep-ph%2F0203251%2Chep-ph%2F0203024%2Chep-ph%2F0203170%2Chep-ph%2F0203154%2Chep-ph%2F0203177%2Chep-ph%2F0203166%2Chep-ph%2F0203222%2Chep-ph%2F0203016%2Chep-ph%2F0203199%2Chep-ph%2F0203018%2Chep-ph%2F0203250%2Chep-ph%2F0203061%2Chep-ph%2F0203023%2Chep-ph%2F0203092%2Chep-ph%2F0203215%2Chep-ph%2F0203051%2Chep-ph%2F0203208%2Chep-ph%2F0203130%2Chep-ph%2F0203128%2Chep-ph%2F0203270%2Chep-ph%2F0203037%2Chep-ph%2F0203175%2Chep-ph%2F0203022%2Chep-ph%2F0203072%2Chep-ph%2F0203167%2Chep-ph%2F0203236%2Chep-ph%2F0203232%2Chep-ph%2F0203066%2Chep-ph%2F0203189%2Chep-ph%2F0203190%2Chep-ph%2F0203211%2Chep-ph%2F0203064%2Chep-ph%2F0203141%2Chep-ph%2F0203077%2Chep-ph%2F0203047%2Chep-ph%2F0203271%2Chep-ph%2F0203060%2Chep-ph%2F0203243%2Chep-ph%2F0203168%2Chep-ph%2F0203036%2Chep-ph%2F0203245%2Chep-ph%2F0203207%2Chep-ph%2F0203160%2Chep-ph%2F0203085%2Chep-ph%2F0203139%2Chep-ph%2F0203178%2Chep-ph%2F0203035%2Chep-ph%2F0203118%2Chep-ph%2F0203083%2Chep-ph%2F0203075%2Chep-ph%2F0203246%2Chep-ph%2F0203050%2Chep-ph%2F0203079%2Chep-ph%2F0203008%2Chep-ph%2F0203205%2Chep-ph%2F0203242%2Chep-ph%2F0203133%2Chep-ph%2F0203013%2Chep-ph%2F0203015%2Chep-ph%2F0203134%2Chep-ph%2F0203041%2Chep-ph%2F0203117%2Chep-ph%2F0203034%2Chep-ph%2F0203086%2Chep-ph%2F0203171%2Chep-ph%2F0203046%2Chep-ph%2F0203157%2Chep-ph%2F0203200&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Extraction of alpha_s from the Gross--Llewellyn Smith sum rule using\n  Borel resummation"}, "summary": "Using the CCFR data for the Gross--Llewellyn Smith (GLS) sum rule, we extract\nthe strong coupling constant via Borel resummation of the perturbative QCD\ncalculation. The method incorporates the correct nature of the first infrared\nrenormalon singularity, and employs a conformal mapping to improve the\nconvergence of the QCD perturbation expansion. The important twist-four\ncontribution is calculated from resummation of the perturbation theory, which\nis based on the ansatz that the higher--twist contribution has a cut\nsingularity only along the positive real axis on the complex coupling plane.\nThus obtained, the strong coupling constant corresponding to the central GLS\nexperimental value is in good agreement with the world average.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0203121%2Chep-ph%2F0203129%2Chep-ph%2F0203103%2Chep-ph%2F0203201%2Chep-ph%2F0203231%2Chep-ph%2F0203102%2Chep-ph%2F0203010%2Chep-ph%2F0203002%2Chep-ph%2F0203070%2Chep-ph%2F0203004%2Chep-ph%2F0203087%2Chep-ph%2F0203258%2Chep-ph%2F0203054%2Chep-ph%2F0203151%2Chep-ph%2F0203040%2Chep-ph%2F0203135%2Chep-ph%2F0203123%2Chep-ph%2F0203224%2Chep-ph%2F0203017%2Chep-ph%2F0203122%2Chep-ph%2F0203145%2Chep-ph%2F0203146%2Chep-ph%2F0203263%2Chep-ph%2F0203111%2Chep-ph%2F0203131%2Chep-ph%2F0203252%2Chep-ph%2F0203106%2Chep-ph%2F0203214%2Chep-ph%2F0203074%2Chep-ph%2F0203063%2Chep-ph%2F0203067%2Chep-ph%2F0203097%2Chep-ph%2F0203026%2Chep-ph%2F0203251%2Chep-ph%2F0203024%2Chep-ph%2F0203170%2Chep-ph%2F0203154%2Chep-ph%2F0203177%2Chep-ph%2F0203166%2Chep-ph%2F0203222%2Chep-ph%2F0203016%2Chep-ph%2F0203199%2Chep-ph%2F0203018%2Chep-ph%2F0203250%2Chep-ph%2F0203061%2Chep-ph%2F0203023%2Chep-ph%2F0203092%2Chep-ph%2F0203215%2Chep-ph%2F0203051%2Chep-ph%2F0203208%2Chep-ph%2F0203130%2Chep-ph%2F0203128%2Chep-ph%2F0203270%2Chep-ph%2F0203037%2Chep-ph%2F0203175%2Chep-ph%2F0203022%2Chep-ph%2F0203072%2Chep-ph%2F0203167%2Chep-ph%2F0203236%2Chep-ph%2F0203232%2Chep-ph%2F0203066%2Chep-ph%2F0203189%2Chep-ph%2F0203190%2Chep-ph%2F0203211%2Chep-ph%2F0203064%2Chep-ph%2F0203141%2Chep-ph%2F0203077%2Chep-ph%2F0203047%2Chep-ph%2F0203271%2Chep-ph%2F0203060%2Chep-ph%2F0203243%2Chep-ph%2F0203168%2Chep-ph%2F0203036%2Chep-ph%2F0203245%2Chep-ph%2F0203207%2Chep-ph%2F0203160%2Chep-ph%2F0203085%2Chep-ph%2F0203139%2Chep-ph%2F0203178%2Chep-ph%2F0203035%2Chep-ph%2F0203118%2Chep-ph%2F0203083%2Chep-ph%2F0203075%2Chep-ph%2F0203246%2Chep-ph%2F0203050%2Chep-ph%2F0203079%2Chep-ph%2F0203008%2Chep-ph%2F0203205%2Chep-ph%2F0203242%2Chep-ph%2F0203133%2Chep-ph%2F0203013%2Chep-ph%2F0203015%2Chep-ph%2F0203134%2Chep-ph%2F0203041%2Chep-ph%2F0203117%2Chep-ph%2F0203034%2Chep-ph%2F0203086%2Chep-ph%2F0203171%2Chep-ph%2F0203046%2Chep-ph%2F0203157%2Chep-ph%2F0203200&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using the CCFR data for the Gross--Llewellyn Smith (GLS) sum rule, we extract\nthe strong coupling constant via Borel resummation of the perturbative QCD\ncalculation. The method incorporates the correct nature of the first infrared\nrenormalon singularity, and employs a conformal mapping to improve the\nconvergence of the QCD perturbation expansion. The important twist-four\ncontribution is calculated from resummation of the perturbation theory, which\nis based on the ansatz that the higher--twist contribution has a cut\nsingularity only along the positive real axis on the complex coupling plane.\nThus obtained, the strong coupling constant corresponding to the central GLS\nexperimental value is in good agreement with the world average."}, "authors": ["Carlos Contreras", "Gorazd Cvetic", "Kwang Sik Jeong", "Taekoon Lee"], "author_detail": {"name": "Taekoon Lee"}, "author": "Taekoon Lee", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.66.054006", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0203201v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0203201v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "22 pages, version to appear in Phys. Rev. D", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0203201v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0203201v2", "journal_reference": "Phys.Rev. D66 (2002) 054006", "doi": "10.1103/PhysRevD.66.054006", "fulltext": "Extraction of αs from the Gross–Llewellyn Smith sum rule using Borel resummation\nCarlos Contreras1, Gorazd Cvetič1 , Kwang Sik Jeong2 and Taekoon Lee2\n1\n\n2\n\nDept. of Physics, Universidad Técnica Federico Santa Marı́a, Valparaı́so, Chile\nDept. of Physics, Korea Advanced Institute of Science and Technology, Daejon 305-701, Korea\n\narXiv:hep-ph/0203201v2 18 Jul 2002\n\nOctober 26, 2018\nUsing the CCFR data for the Gross–Llewellyn Smith (GLS) sum rule, we extract the strong\ncoupling constant via Borel resummation of the perturbative QCD calculation. The method incorporates the correct nature of the first infrared renormalon singularity, and employs a conformal\nmapping to improve the convergence of the QCD perturbation expansion. The important twist–four\ncontribution is calculated from resummation of the perturbation theory, which is based on the ansatz\nthat the higher–twist contribution has a cut singularity only along the positive real axis on the complex coupling plane. Thus obtained, the strong coupling constant corresponding to the central GLS\nexperimental value is in good agreement with the world average.\n\nI. INTRODUCTION\n\nMany low–energy Quantum Chromodynamic (QCD) observables, including the Gross–Llewellyn Smith (GLS) sum\nrule, with characteristic energy scale a few GeVs are analyzed in perturbative QCD within the framework of operator\nproduct expansion (OPE). In this scheme usually the most important is the perturbative contribution from the\nWilson coefficient of the unit operator, and there are nonperturbative, power suppressed, higher–twist contributions.\nGenerally, the higher order coefficients in the perturbative contribution grow rapidly due to the asymptotic nature\nof the perturbative expansion. The uncalculated higher order corrections are thus expected to be large, and this\ncan cause a large uncertainty in data analysis that employs the unprocessed, finite order perturbative expansion. It\nis therefore important to properly handle the divergent perturbation expansion via resummation, since it can give\na more accurate result with reduced theoretical uncertainty. Besides, resummation serves to give a well defined\nmeaning to the higher–twist contributions. Without a proper resummation of the perturbative part, the higher–twist\ncontributions are ambiguous [1–4].\nAn often used resummation technique is the Borel resummation. It has a sound theoretical basis since it is built\non our understanding about the singularities in the Borel plane which cause the divergence of the perturbative\nexpansion. Its use generally improves the quality of data analysis, as can be seen from the reduced dependence on\nthe renormalization scheme and scale, and from the reduced dependence on the uncertainty of the uncalculated next\nhigher order perturbative coefficient.\nAt moderate values of the strong coupling αs (Q) at a few GeV, the Borel integral receives most of its value from\nthe interval between the origin and the first infrared (IR) renormalon singularity, and just beyond it, in the Borel\nplane. Let us call this loosely defined interval, for convenience, the primary interval. In Borel resummation it is thus\nvery important to describe the Borel transform, which determines the Borel integral, as accurately as possible in the\nprimary interval using the calculated first terms of perturbation theory.\nFor this purpose two steps can be taken: (1) an explicit incorporation of the first IR renormalon singularity in\nthe Borel transform, and (2) use of an optimal conformal mapping. With the usual power expansion of the Borel\ntransform about the origin the information on the renormalon singularity is lost. To remedy this, one may explicitly\nincorporate the first renormalon singularity by writing a Borel transform D̃(b), which behaves as 1/(1 − b/b0 )1+ν\naround the singularity at b = b0 , as\nD̃(b) =\n\nR(b)\n(1 − b/b0 )1+ν\n\n(1)\n\nwith R(b) ≡ D̃(b)(1 − b/b0 )1+ν . The function R(b)1 is by definition bounded and has softer singularity at the first\n\n1\n\nThis function was first introduced in [5] in Borel resummation and independently in [6] in renormalon residue calculation.\n\n1\n\n\fIR renormalon. Hence we can expect that the Borel transform in the form of (1), with R(b) perturbatively expanded\nabout the origin, would give a better approximation than the direct expansion of D̃(b).\nThe step (2) utilizes the information on the locations of the singularities in the Borel plane. Use of conformal\nmapping in Borel resummation has a long history [7], and its use in perturbative QCD was particularly emphasized in\n[8]. On the Borel plane there are IR renormalon singularities on the positive real axis and ultraviolet (UV) renormalons\non the negative axis.2 By pushing the singularities away from the primary interval one can obtain a smoother R in\nthe new primary interval on the mapped plane. This would render the perturbation of R in the mapped plane to\nconverge better. Among the several mappings considered in the literature we find that the one proposed in [9] is\nparticularly suited when used in combination with the Borel transform in the form of Eq. (1). This mapping moves\nthe first IR renormalon singularity that defines the primary interval to a point within the unit circle and all other\nsingularities to the unit circle. Since the effect of the first IR renormalon is softened by the step (1), we expect this\nmapping in our case to be better suited than, for example, a mapping that moves all singularities to the unit circle\n[10].\nThese techniques were applied to the hadronic tau decay width [9–11] and to the hadronic contribution to the muon\nanomalous magnetic moment [12]. In this work we apply them to the GLS sum rule. The CCFR analysis [13,14] of\nthe GLS sum rule was based on evaluation of the truncated perturbation series (TPS) in MS scheme. Aside from the\ninherent ambiguity of the higher–twist contributions, this method gives predictions which are not stable under the\ninclusion of an additional term (∼ α4s ) in the TPS. As we shall see, these problems can be avoided with the use of\nBorel resummation.\nA crucial new element of our analysis comes with the calculation of the nonperturbative contribution. Aside from the\nperturbative part, an important contribution to the GLS sum rule comes from the nonperturbative, hadronic matrix\nelement of the twist–four operator. Being nonperturbative, this contribution is usually fitted using the QCD sum\nrule calculation. Recently it was proposed by one of us [15], motivated by an observation that the nonperturbative\namplitudes in lower dimensional solvable models have a simple analyticity in complex coupling plane, that these\nhigher–twist contributions can in principle be calculated from the Borel resummation of the perturbation series. The\nproposal was based on the conjecture that the higher–twist contributions have cuts only along the positive real axis in\nthe complex coupling plane, which allows to relate the real part of the nonperturbative amplitude to its perturbatively\ncalculable imaginary part. This scheme was shown to work well in model field theories. When applied to some of the\nsolvable lower dimensional theories, it allowed the associated nonperturbative amplitudes to be accurately calculated\nfrom the first terms of the perturbation theory in the respective theories.\nFrom our analysis we obtain for the strong coupling parameter the central value αs (MZ ) ≈ 0.117. Compared to\nthe corresponding CCFR central value αs (MZ ) = 0.114, our value is closer to the world average αs (MZ ) ≈ 0.118.\nThe main improvement comes from the correct incorporation of the renormalon singularity on the Borel amplitude\nand the calculation of the nonperturbative contribution.\nThe paper is organized in the following way. In Sec. II we describe the resummation method, incorporating in it\nthe known structure of the leading IR renormalon and the nonperturbative part, as well as the conformal mapping.\nSection III contains the numerical application of the method to the GLS sum rule, leading to predictions for αs (MZ ).\nIn Sec. IV we compare our predictions with those of other methods. In Sec. V we discuss some general features of\nthe Borel resummation and the OPE approaches to understand precisely where the two methods deviate from each\nother. In Sec. VI we summarize our results and present conclusions.\nII. THE METHOD\n\nIn this section we give an overview of our method used for the QCD analysis of the GLS sum rule. Its implementation\nin detail will be given in the following section. The QCD correction ∆(Q2 ) to the GLS sum rule is defined by\nZ\n\n1\n0\n\ndxF3νN (x, Q2 ) = 3(1 − ∆(Q2 )) ,\n\n(2)\n\nwhere F3νN is the non-singlet deep inelastic scattering (DIS) structure function in νN scattering. Here we shall ignore\nthe target mass correction since it is irrelevant for our present discussion, but it will be included in the numerical\nanalysis presented in the next section.\n\n2\n\nThere are also instanton-caused singularities, which can be safely ignored in our case.\n\n2\n\n\fWe first begin by reviewing the old but important problem [1,2] with the conventional QCD formulation of ∆(Q2 )\nin OPE framework, which is widely used in data analysis. This problem is not confined to the GLS sum rule, but\ngeneric to any perturbative OPE formulations. ∆(Q2 ) in OPE up to twist–four operator is given by\n∆(Q2 ) = W0 (αs (Q)) + W1 (αs (Q))\n\n≪O≫\n,\nQ2\n\n(3)\n\nwhere αs (Q) is the strong coupling constant, and ≪O≫ is the reduced nucleonic matrix element of the twist–four\noperator that was first derived in Ref. [16]\nOμ = ūG̃μν γ ν γ5 u + d ̄G̃μν γ ν γ5 d ,\nλa\n1\n, hP |Oμ |P ispin averaged = 2 pμ ≪ O ≫ .\nG̃μν = ǫμναβ Gaαβ\n2\n2\nHere, λa are the usual Gell-Mann matrices and we used the notations of Ref. [17]. Throughout the article we shall\nconsider only the twist–four contribution as the nonperturbative effect, and ignore higher twist contributions since\nthey are believed to be small.\nIn conventional QCD analysis the Wilson coefficients Wi , (i = 0, 1), in (3) are taken from the finite order, perturbative QCD calculation in an usual renormalization scheme, say MS scheme, and the reduced matrix element ≪O≫\nfrom data fitting or QCD sum rule calculations, etc. However, this scheme is, in principle, fundamentally flawed,\nsince perturbatively the Wilson coefficients are not well–defined. In perturbative calculation of the Wilson coefficients\nthe quantum fluctuations of all energy scale contribute, and in particular at large orders the contribution from the\nfar infrared regimes, where perturbative QCD should fail, is large and gives rise to a same sign, factorially growing\nlarge order behavior [18]. Thus, without some kind of resummation of the divergent perturbation series, the Wilson\ncoefficients are not well–defined, and therefore neither is the OPE (3). As a consequence, no well–defined meaning\nthat is independent of the definition of the Wilson coefficient W0 , can be assigned to the matrix element ≪O≫ [1–3].\nOne could in principle introduce an infrared cutoff μ2 (≪ Q2 ) in the perturbative calculation of W0 , and regard\nthe twist–four term to contain all the low momentum −k 2 ≡ K 2 < μ2 contributions [19,20]. This would remove\nthe infrared renormalon and make the perturbation expansion for W0 convergent, and the twist–four term to be\nμ2 dependent [20]. However, to do this in practice is impossible, because it is impossible to compute arbitrarily\ncomplicated Feynman amplitudes of arbitrarily high power, and in particular their small momentum contributions,\nas stressed by the authors of Ref. [20].\nThe problem discussed so far is not of academic nature only, but has important practical implications. One might\nstill think the OPE (3), with finite order perturbative Wilson coefficients, is a good approximation scheme, since at\nany rate the perturbative Wilson coefficients can be regarded as a good approximation at reasonably small values\nof the strong coupling constant. Actually, this would be the case, provided that the nonperturbative, higher–twist\neffect is far larger than the ignored next higher perturbative term in W0 . In practice, however, this condition is not\nsupported by data analysis. For instance, if this were the case, we would expect little variation in the fitted values for\nthe twist–four contribution over the order of perturbation in W0 . But the variation is not small at all. In the QCD sum\nrule calculation using the next–to–leading order (NLO) W0 [17], the twist–four contribution was found not to be small,\nroughly equal to the perturbative correction at Q = 1 GeV. But, it was observed in Refs. [21,22] that the twist–four\ncontribution virtually vanishes when fitted with the next–to–next–to–leading order (NNLO) W0 against the parton\ndistribution functions extracted from experiments, and most of the twist–four contribution extracted in the NLO fit\ncan be accounted for by the perturbative NNLO contributions. This can be interpreted as a clear manifestation of the\ninherent ambiguity of the OPE approach. Moreover, this tendency of strong dependence of higher–twist contribution\non the order of perturbation appears not to be special to the GLS sum rule, but generic. The recent new estimate\nof the gluon condensate [23], from fitting the vectorial spectral function of hadronic tau decay using NNLO Adler\nfunction, gives a small central value of only 1/3 that of the original QCD sum rule estimate [24] which uses the leading\norder perturbation. These examples strongly indicate that the inherent ambiguity of the OPE can have important\nconsequences in practical applications, and demands a careful treatment.\nBorel resummation resolves this problem, which proceeds as follows [7]. The perturbation series for W0\nW0 =\n\n∞\nX\n0\n\nwn a(Q)n+1\n\n[a(Q) ≡ αs (Q)/π] ,\n\n(4)\n\nwhich is, being of same sign at large orders3 , non-Borel resummable at physical, positive coupling a(Q). So it is\n\n3\n\nHere we ignore, for the moment, the UV renormalons, which give rise to sign-alternating large order behaviors. Being Borel\n\n3\n\n\ffirst Borel resummed at negative a(Q) which yields a Borel resummed amplitude ∆P (a(Q)). Then to obtain a Borel\nresummed physical amplitude one may analytically continue ∆P to positive a(Q) in the complex coupling plane. This\ngives for a(Q) > 0 [15]\n∆P (a(Q) ± iǫ) =\n\n1\nβ0\n\nZ\n\n∞±iǫ\n\ndb e−b/β0 a(Q) W̃0 (b)\n\n(5)\n\n0±iǫ\n\nwith\nW̃0 (b) =\n\n∞\nX\nwn\n(b/β0 )n .\nn!\nn=0\n\n(6)\n\nInserted for normalization convenience, β0 is the one–loop coefficient of the QCD β-function. Eq. (5) shows explicitly\nthat in case of existing singularities on the line of integration, i.e., IR renormalons, the real part of the Borel integral\n∆P is the (generalization of the) Cauchy Principal Value. The Borel transform (6) is believed to be convergent on the\nunit disk |b| < 1, and is known to have a branch cut along the positive real axis beginning at b = 1. Near the branch\ncut it behaves as [3]\nW̃0 (b) =\n\nC\nβ 1+ν (1 − b)−1−ν (1 + O(1 − b)) + (Analytic part)\nΓ(−ν) 0\n\n(7)\n\nwith\nν = (β1 /β0 − γ2 )/β0 ,\n\n(8)\n\nwhere β1 and γ2 are respectively the two–loop coefficient of the QCD β–function and the one–loop coefficient of the\nanomalous dimension of the twist–four operator appearing in the OPE (3). In our case ν is positive; for instance,\nν = 32/81 when three quark flavors (nf = 3) are active [16].4 Note that the Borel transform beyond the convergence\ndisk of the series (6) can be obtained by analytic continuation. The analytic part, which is analytic around the\nsingularity, is not calculable, but the residue C, a real number, is calculable perturbatively [6,25].\nBecause of the branch cut the Borel integrals in (5) develop imaginary parts beginning at b = 1. Since the QCD\ncorrection ∆(Q2 ) must be real, clearly ∆P alone cannot reproduce the true amplitude. There must be something else.\nPrecisely at this point, the nonperturbative amplitude, denoted ∆NP (a(Q)), comes to the rescue, which cancels the\nimaginary parts of ∆P , rendering the sum of the two to be real. This ∆NP can be shown to be directly related to the\ntwist–four contribution in the OPE (3) [26], with its overall form governed by the associated RG equation, and may\nbe regarded as a refinement of the latter, now free from the inherent ambiguity of the OPE. The QCD correction may\nnow be written as\n∆(Q2 ) = ∆P (a ± iǫ) + ∆NP (a ± iǫ)\n= Re[∆P (a ± iǫ)] + Re[∆NP (a ± iǫ)] .\n\n(9)\n\nEither sign can be taken because the result is independent of the sign chosen.\nWhat can we tell about the nonperturbative amplitude ∆NP ? Its imaginary part at a positive coupling is certainly\ncalculable from the perturbation theory because it is essentially the imaginary part of ∆P , albeit with opposite sign,\nwhich is calculable in principle from the perturbation theory. However, as we see in (9), what we need is the real\npart, which is certainly not directly calculable.\nThere is, however, an intriguing possibility of perturbative calculation of the real part. From the perspective of\nBorel resummation the sole reason for the introduction of the nonperturbative amplitude above was to cancel the\nimaginary parts arising from the analytic continuation of ∆P to physical coupling in the complex coupling plane.\nWith the Borel integral (5) and the singular Borel transform (7), we can see that ∆P (a(Q)), which by definition can\nhave a singularity only along the positive real axis in the complex a(Q) plane, has a branch cut of the form (see\nAppendix A)\n\nsummable, the UV renormalons can in principle be treated separately, and do not affect our discussion in any essential way.\n4\nAccording to Ref. [16]: γ2 = (Nc−1/Nc )/3 = 8/9. Our convention for parameters βj (and cj ≡ βj /β0 ) is specified by Eq. (21)\nin the next Section. For nf = 3, we have β0 = 9/4, β1 = 4. Therefore, ν = 32/81.\n\n4\n\n\f− C(−a(Q))−ν e−1/β0 a(Q) [ 1 + O(a) ] .\n\n(10)\n\nThe nonperturbative amplitude ∆NP should cancel the imaginary part arising from this at positive coupling. The\nsimplest functional form for ∆NP that can achieve this purpose can be obtained by postulating that, as has ∆P , the\nnonperturbative amplitude have a branch cut only along the positive real axis in the coupling plane. This then leads\nto the following conjecture for ∆NP [15]:\n∆NP (a(Q)) = C(−a(Q))−ν e−1/β0 a(Q) [ 1 + O(a) ]\n\n(11)\n\nThis has a very important implication because it allows to relate the real part of the nonperturbative amplitude to\nthe calculable imaginary part. In this paper we will adopt this conjecture, which appears very plausible, at least to\nus, and as will be mentioned shortly it is supported by some lower dimensional solvable models. Now with (9) and\n(11) we can write the QCD correction with only the calculable ∆P as\n∆P (Q2 ) + ∆NP (Q2 ) = {Re ∓ cot(νπ) Im} [∆P (a(Q) ± iǫ)] .\n\n(12)\n\nThis equation is the basis of our numerical analysis in the following section. In Appendix A we present, for reference,\nsome explicit formulas leading to (10)–(12).\nThe argument that led to the determination of the nonperturbative amplitude above did not rely on any special\nproperty of OPE, but only on the general property of Borel resummation of a same sign divergent perturbation theory.\nThus it can be applied to any perturbation theory with a same sign large order behavior. Application of this scheme to\nthe lower dimensional, solvable models such as the double well potential and the two-dimensional nonlinear σ model\nin large N limit, allowed an accurate calculation of the associated nonperturbative amplitude using only the first\nterms of the perturbation expansion in the respective models [15]. Moreover, interestingly, the numerical estimate\nof the gluon condensate from this scheme applied to the Adler function gives a value virtually identical to the new\nestimate [23].\nGiven the QCD correction in the form (12) with ∆P (a ± iǫ) given by (5), our aim is now to describe the Borel\ntransform W̃0 as accurately as possible in the primary interval using the known first terms of the perturbation series.\nFor this, following the outline in Introduction, we write the Borel integral (5) as\nZ ∞±iǫ\n1\nR(b)\n(13)\n∆P (a(Q) ± iǫ) =\ndb e−b/β0 a(Q)\nβ0 0±iǫ\n(1 − b)1+ν\nwith R(b) now defined by\nR(b) ≡ (1 − b)1+ν W̃0 (b)\n\n(14)\n\nand ν given in (8) (ν = 32/81). This step is expected to greatly improve the perturbative description of the Borel\ntransform in the primary interval because it implements the renormalon singularity correctly, and renders us to deal\nwith a much softer singularity. The singularity of R(b) at b = 1 is a branch cut and thus softer than that of W̃0 (b).\nWe can obtain further improvement by use of a conformal mapping that exploits the known locations of the\nsingularities of W̃0 (b). The latter is known to have renormalon singularities at non-zero integer values of b on the real\naxis [27,28]. To speed up the convergence of the perturbative expansion of R(b), we may push the singularities, save\nthe unavoidable first IR renormalon, as far away from the origin as possible. This way we can reduce the influence\nof the renormalon singularities and make R(b(w)) smoother around the primary interval. One such a mapping we\nconsider is [9]\np\n√\n1 + b − 1 − b/2\n8w\np\nw(b) = √\n.\n(15)\n⇒ b(w) =\n(3w2 − 2w + 3)\n1 + b + 1 − b/2\n\nThis maps the first IR renormalon to w = 1/3 and all other singularities to the unit circle |w| = 1. We expect this\nmapping combined with the implementation (14) to provide an optimized environment for the Borel integral. In the\nmapped plane the Borel integral now assumes the form\nZ\n1\nR(b(w))\ndb(w)\n∆P (a(Q) ± iǫ) =\n,\n(16)\ndw e−b(w)/β0 a(Q)\nβ0 C±\ndw (1 − b(w))1+ν\nwhere one of the integration contours C− is shown in Fig. 1. Again, since the answer is independent of the sign\nchosen, either contour can be taken. In the next section we perform a numerical analysis of our implementation of\nthe QCD correction: Eqs. (12) and (16).\n5\n\n\fIII. NUMERICAL ANALYSIS\n\nIn this Section we will apply the method described in the previous Section to the Gross–Llewellyn Smith (GLS) sum\n2\nrule, deducing values of the QCD coupling parameter αMS\ns (MZ ) from the GLS values extracted from experiments. In\nthe first Subsection, we will present the resummed expression for the contributions of the three massless quark flavors.\nAs a byproduct of the obtained expression, we will obtain an estimate of the next–to–next–to–next–to–leading (N3 L)\ncoefficient w3 of the perturbative expansion. In the subsequent Subsection, we will include the effects of the massive\nfourth quark flavor (c–quark) to the GLS observable. In the last Subsection, the available measured GLS values will\n2\nbe confronted with our resummed expression and values of αMS\ns (MZ ) will be extracted.\nA. GLS – the massless nf = 3 part\n\nThe GLS quantity M3 (Q2 ) is the following integral (first moment) of the charged–current non–polarized DIS\nstructure function F3 ≡ (F3νp + F3νn )/2 over the Bjorken parameter x:\n\"\n\u0012\n\u00131/2 #\nZ\n2\n4m2N x2\n1 1\n2 ζ\n2\n,\n(17)\ndx F3 (x; Q ) 2 1 + 2 1 +\nM3 (Q ) =\n3 0\nx\nQ2\np\nwhere ζ ≡ 2x/(1 + 1 + 4m2N x2 /Q2 ) is the Nachtmann variable [29], and mN is the nucleon mass. The quantity M3\nis the first Nachtmann moment of F3 which absorbs all the kinematical power corrections (target mass corrections:\nTMC) ∼ (m2N /Q2 )n . The quantity Q2 = −q 2 is the virtuality of the exchanged gauge boson; Q2 characterizes the\ntypical process momenta of the observable M3 (Q2 ). When expanding the integrand in Eq. (17) in powers of m2N /Q2 ,\nwe can rewrite\n\"\n\u0012 2 2 \u00132\n\u0012 6 \u0013#\nZ 1\n2 m2N x2\nmN x\nmN\n2\n2\nM3 (Q ) =\ndx F3 (x; Q ) 1 −\n.\n(18)\n+\n+O\n2\n2\n3 Q\nQ\nQ6\n0\nThe above GLS moment can be written in the form\n\u0001\nM3 (Q2 ) ≡ 3 1 − ∆(Q2 ) ,\n\n(19)\n\n∆(Q2 ) 7→ W0 (Q2 ) = a(1 + w1 a + w2 a2 + w3 a3 + * * *) .\n\n(20)\n\nwhere the \"canonical\" quantity ∆(Q2 ) has the following power expansion W0 [cf. Eq. (3)]:\n\nHere, a ≡ αs (μ2 ; c2 , c3 , . . .)/π is the QCD coupling parameter with a given choice of the renormalization scale (RScl)\nμ2 and the renormalization scheme (RSch) parameters cj (j ≥ 2). The evolution of a with the RScl is governed by\nthe renormalization group equation (RGE)\n∂a(μ2 ; c2 , c3 , . . .)\n= −β0 a2 (1 + c1 a + c2 a2 + c3 a3 + * * *) ,\n∂ ln μ2\n\n(21)\n\nwhere the parameters cj ≡ βj /β0 (j ≥ 2) characterize the choice of the RSch, and β0 and c1 ≡ β1 /β0 are universal\nconstants.5 The evolution of parameter a with cj 's (j ≥ 2) is governed by analogous differential equations, which\nfollow from the Stevenson equation (see Appendix A of Ref. [30]). The next–to–leading (NL) coefficient w1 has been\ncalculated in Ref. [31], and the NNL coefficient w2 in Ref. [32]. At the specific RScl μ2 = Q2 and MS RSch, and when\nthe number of the active quark flavors is nf = 3, these coefficients have the values6\n(0)\n\n(0)\nw2\n\n5\n6\n\nw1 ≡ w1 (μ2 = Q2 ) = 3.58333 ,\n≡ w2 (μ\n\n2\n\n= Q ; cMS\n2 )\n(0)\nw2 (l.l.)\n2\n\n= 20.2153 +\n\n(22)\n(0)\nw2 (l.l.)\n\n,\n\n= −1.23954 .\n\nβ0 = (11 − 2nf /3)/4, c1 = (102 − 38nf /3)/(16β0 ), where nf is the number of active quark flavors.\n(0)\nThe superscript '(0)' in wj denotes the special RScl–choice μ2 = Q2 and MS RSch.\n\n6\n\n(23)\n(24)\n\n\fIn the NNL coefficient, the small \"light–by–light\" part was separated off. The \"light–by–light\" contribution should\nnot be included in resummations of ∆(Q2 ; P), as will be argued at the end of this Subsection.\nThe Borel integral (16), which will be together with (12) the basis for our resummation, is independent of the choice\nof the RScl μ2 and the RSch (c2 , c3 , . . .) used in the integrand.7 Thus, we can rewrite it as (see also Fig. 1)\n∆P (Q2 ± iǫ) = e±iφ\n\n1\nβ0\n\nZ\n\n1\n\ndx\n\n0\n\n\u0015\n\u0014\nR(b(w); μ2 /Q2 )\nb(w)\ndb(w)\nexp −\n2\ndw\nβ0 a(μ ) (1 − b(w))113/81\n\n,\n\n(25)\n\nw=xe±iφ\n\nAt this stage we can, as a byproduct of formula (14), obtain an estimate of the yet unknown N3 L coefficient w3\nappearing in the perturbative expansion (20) [9,33]. If working with the RScl μ2 = Q2 and in the MS scheme, the\nexpansion of R(b(w)) in powers of w gives us:\nR(b(w)) = 1 + 0.526749 w + 0.709369 w2\n(0)\n\n+(−43.2574 + 0.277464w3 )w3 + O(w4 ) ,\n\n(26)\n\n(0)\n\nwhere we excluded the \"light–by–light\" part (24) of the NNL coefficient w2 (23). Looking at the coefficients appearing\nin (26), it is reasonable to expect that the coefficient R3 at w3 is |R3 | ∼ 1. If we assume R3 = 1 ± 1, we obtain a rather\n<\n(0)\n(0)\nstringent estimate w3 = 159.5 ± 3.6. If we adopt a more cautious assumption |R3 | ∼ 101 , we obtain w3 ≈ 160 ± 30.\nIf we apply Padé approximant (PA) [1/1]R (w) to the expansion (26) and re–expand it back in powers of w up to w3 ,\n(0)\nwe obtain an estimate w3 = 159.3. On the other hand, if applying the [1/2]R (w) and demanding wpole = 1 (i.e.,\n(0)\n(0)\nb = +2, IR2 ), the prediction is w3 = 158.5; if demanding wpole = −1 (i.e., b = −1, UV1 ), the prediction is w3 = 157.0.\nVery similar estimates are obtained if we do not apply the conformal transformation b(w) (15). Therefore, we will\n(0)\nadopt the following estimate for w3\n(0)\n\nw3\n\n\u0002\n\n\u0003\n≡ w3 (μ2 = Q2 ; MS) = 158 ± 30 .\n\n(27)\n\nWe emphasize that this estimate excludes the \"light–by–light\" contributions, which are assumed to be suppressed\nat the N3 L order. The exclusion of the \"light–by–light\" contributions reduces the (NNL) perturbative expansion of\nthe (non-polarized) GLS sum rule to that of the Bjorken polarized sum rule (BjPSR) [32]. It is interesting that the\n(0)\neffective charge method (ECH) [34–36] and the (TPS) principle of minimal sensitivity (PMS) [30] predict w3 ≈ 130\n[37], based on the assumption that cECH\n≈ cPMS\n≈ cMS\n3 . Further, an RScl– and RSch–invariant method [38] that\n3\n3\n(0)\nis somewhat related to the PA and PMS approaches, also predicts w3 ≈ 130. This is at the lower end of our\nnew estimate (27). We thus conclude that the explicit (and exact) structure of the leading IR renormalon of the\nGLS–observable (BjPSR–observable) in the Borel plane, as given in Eq. (14), is responsible for the somewhat higher\n(0)\nestimate of w3 in comparison with the ECH, PMS, and PA–related methods of resummation.\nWe add here a few remarks on the question of the \"light–by–light\" contributions. The power expansion of the\nmassless part of the GLS sum rule to N3 L order ∼ a3 (see Refs. [31,32]), in the MS scheme and at the RScl μ2 = Q2 ,\nis given by\n3\n3\n21\n23\n1\n(− CF )W0 (Q2 ) = a(− CF ) + a2 CF ( CF − CA + nf )\n4\n4\n32\n16\n4\n\"\n3 3\n1241 11\n5437 55\n3\n2\n+a −\nC +(\n− ζ3 )CF2 CA + (−\n+ ζ5 )CF CA\n128 F\n576\n12\n864\n24\n133\n5\n3535 3\n5\n115\n− ζ3 )CF2 nf + (\n+ ζ3 − ζ5 )CF CA nf −\nCF n2f\n1152 24\n1728\n8\n12\n864\n#\ndabc dabc\n11\n1\n(−\n+nf\n+ ζ3 ) + O(a4 ) ,\nNc\n192 8\n+(−\n\n(28)\n\nwhere the Casimir coefficients for QCD (Nc = 3) are CF = 4/3, CA = 3, and the group–theoretical factor appearing in\nthe last term in (28) is\n\n7\n\nThe location of the renormalon pole b = 1 and the power ν = 32/81 (8) are independent of the choice of the RScl and RSch.\n\n7\n\n\fdabc dabc =\n\n40\n.\n3\n\n(29)\n\nThis group–theoretical factor is not present in the calculation of the GLS sum rule up to the two–loop (∼ a2 ) order,\nand it appears for the first time at the three–loop (∼ a3 ) order. This term is called \"light–by–light,\" it corresponds\nto diagrams with a new topology involving exchange of three gluons. In our calculation we will add this \"light–by–\nlight\" contribution ∆l.l. (Q2 ), given by the last term in Eq. (28), as a separate term not included in our resummation\napproach. The reason for this is the following: Resummation approaches cannot be expected to predict (and resum)\nthose higher order terms which are characterized by new higher order group–theoretical factors, when we have only\none such term (∼ a3 ) explicitly available. We assume that such resummed \"light–by–light\" contributions are small,\ncomparable to the quite small ∼ a3 \"light–by–light\" contribution in (28). Similar considerations can be found in\nRefs. [39,37], in cases of various observables and beta functions.\nB. Inclusion of the massive quark flavor (c) contribution and nuclear corrections\n\nIn the approximation of massless quarks, the calculation of the N3 L (∼ a3 ) QCD correction to the GLS sum rule\nhas been carried out in Ref. [32]. The inclusion of the heavy (c–)quark contributions is important at the precision\nlevel at which we are working. In addition, it is important in order to estimate the scales Q2 where the (c–)quarks can\nbe treated as massless or massive quarks. This point is important because it indicates which number of light flavors\nnf should be used in the (resummed) \"massless\" part of the the perturbation series. The calculation of the heavy\nflavor contribution to the GLS sum rule up to the second order (∼ a2 ) was performed in Ref. [40] and discussed in\n[41]. According to this approach: (a) the quarks u, d, s are massless and result in the dominant nf = 3 massless QCD\ncontribution to the GLS sum rule ∆(Q2 ); (b) for Q2 ≈ 2–4 GeV2 , the massive flavor is the c–quark and it contributes\na relatively small correction to the aforementioned nf = 3 massless contribution. The other heavy quark flavors are\nignored due to the strong suppression by the mixing angles in the Cabibbo–Kobayashi–Maskawa matrix and by the\nsmall values of Q2 .\nThe heavy (c–)flavor correction contributions to ∆(Q2 ) are\n∆c (Q2 ) = ∆(1)\n+ ∆(2)\n,\nc\n\u001a\n\u001b\u0015\n\u0014c\n1\nln(1 + ξ)\n1\n2 (1)\n2 CF\nsin2 θc ,\n∆c (Q ) =\n− a(μ )\n+2\n3(1 + ξ)\n4\n1+ξ\n1+ξ\n\"\u0012\n\u0013\n1 2 16\n2 (2)\n2 2 CF TF\n∆c (Q ) = −a(μ )\nξ + ξ ln ξ\n16\n105\n45\n\u0012\n\u0013\n2\n62528 1\n2783 6740 1 137552 1\n1\n+\nξ+\n+\n+\n+ 4\nλ\n105\n315\n63 ξ\n315 ξ 2\n105 ξ 3\n\n(31)\n\n1\nλ5\n\n1 2 142\n298432 1\n494 1516 1 23024 1\n+\nξ +\nξ+\n+\n+\n2\n105\n315\n63\n21 ξ\n63 ξ\n315 ξ 3\n!\n#\n102656 1\nλ+1\n20 1 2 λ + 1\n+\nln(\nln (\n)−\n) ,\n105 ξ 4\nλ−1\n3 ξ2\nλ−1\n\n−\n\n(30)\n\n(32)\n\np\nwhere ξ = Q2 /m2c , λ = 1+4m2c /Q2 , CF = 4/3, TF = 1/2. The heavy flavor corrections (31)–(32) will not be included\nin the resummation procedure for ∆, but will be added separately.\nIn addition to the discussed heavy flavor contributions, there are also nuclear corrections to the GLS sum rule, due\nto the nuclear effects in the F3 structure functions. These effects were calculated in Ref. [42] and were found for the\niron target (used by the CCFR Collaboration) to be small:\n∆Fe (Q2 ) ≈\n\n4 * 10−3 GeV2\n.\nQ2\n\n(33)\n\nThis contribution, at Q2 = 2–3 GeV2 , turns out to be in its magnitude smaller than the heavy flavor effects by a\nfactor of 3–4, but larger than the \"light–by–light\" contribution by a factor of about 2.\n\n8\n\n\fC. Extraction of αs values\n\nThe values of the GLS sum rule M3 (Q2 ), for various specific Q2 , have been obtained from the experimentally\nextracted values of the structure function F3 (x; Q2 ), by the Fermilab CCFR Collaboration [13]. They have large\nsystematic experimental uncertainties, primarily because of the uncertainties in the normalization of xF3 and in the\nintegration in the regions x ≪ 1 and x > 0.5. The systematic uncertainties are somewhat smaller, comparable to the\nstatistical experimental uncertainties, only when the values of the exchanged boson virtuality are Q2 = 2.00, 3.16 GeV2\n(see their Table III). These values, including the target mass correction terms of (17)–(18), as well as the nuclear\ncorrection term (33), are8\nQ2 = 2.00 GeV2 :\nQ2 = 3.16 GeV2 :\n\nM3 (Q2 ) = 2.49 ± 0.13\nM3 (Q2 ) = 2.55 ± 0.12\n\n⇔ ∆(Q2 ) = 0.168 ± 0.043 ,\n⇔ ∆(Q2 ) = 0.149 ± 0.039 .\n\n(34)\n(35)\n\nHere we added in quadrature the statistical and the systematic experimental uncertainties. In addition, the values\n∆(Q2 ) in (34)–(35) have the aforementioned nuclear correction contribution (33) subtracted out; however, ∆(Q2 ) still\nincludes the massless (perturbative and nonperturbative) contribution (12), the light–by–light contribution w2 (l.l.) a3\n[cf. (24)] and the c–quark contribution (30)–(32).\nFor a given value of αs (Q2 , MS), our expression for ∆(Q2 ) = ∆P (Q2 )+∆NP (Q2 )+∆l.l. (Q2 )+∆c (Q2 ), given in the\nprevious Subsections, still has the freedom (ambiguity) of the choice of the RScl μ2 and the RSch.\nIn the following analysis, we fix first the RSch to be MS, with the beta function being the PA β(x) = [2/3](x) based\non the N3 L TPS of the βMS (x). This PA choice of the beta function has reasonable behavior in the region of large\nx ≡ αs /π and has been used in Refs. [9,11,38] in the analyses of low energy QCD observables. We will comment later\non how the results change when we use N3 L TPS of the βMS (x), and when we change the RSch even more drastically.\nThe RScl–dependence is yet another source of the theoretical ambiguity. In Figs. 2 and 3 we show the dependence\nof the predicted values of ∆(Q2 ) on the RScl μ2 at the NNL and N3 L level, at Q2 = 2.00, 3.16 GeV2 , respectively,\nfor given fixed representative values of αs (Q2 , MS). The NNL level means that we take for R(b(w)) in the Borel\nintegrations in (25) and (12) the NNL TPS (quadratic polynomial in w), i.e., only the knowledge of w1 and w2\ncoefficients is used. The N3 L level means that R(b(w)) is the N3 L TPS (cubic polynomial in w), i.e., we use,\n(0)\nin addition, w3 = 158 according to the estimate (27). From Figs. 2,3 we see that the N3 L expressions drastically\nimprove the stability of the predictions under the change of the RScl. In the case Q2 = 2.00 GeV2 , the N3 L values of the\nmassless quantity ∆P+NP (Q2 ) achieve minimal ln μ2 –sensitivity at μ2 /Q2 ≈ 3.3 : d∆P+NP (Q2 )/d ln μ2 ≈ −1.45 * 10−4 .\nAt Q2 = 3.16 GeV2 , there is unfortunately no point of minimal RScl–sensitivity; the slope is negative and getting\nweaker when μ2 increases. However, the RScl–sensitivity is very weak when μ2 /Q2 > 2.5, and almost stabilizes\nwhen μ2 /Q2 ≈ 3.3 : d∆P+NP (Q2 )/d ln μ2 ≈ −1.55 * 10−3 . Therefore, we will take, for definiteness, the RScl choice\nμ2 = 3.3 Q2 in the case of both Q2 values. Later on, we will comment on the ambiguity of our results when the RScl\nis varied.\nHaving fixed the RSch (MS, with [2/3]β (x) PA) and the RScl (μ2 = 3.3 Q2 ), our expressions for ∆(Q2 ) = ∆(Q2 , P+\nNP+l.l.+c) become unambiguous functions of the input value of αs (Q2 ; MS). Adjusting simply the latter value so\nthat the experimental values (34)–(35) are achieved, we obtain:\nQ2 = 2.00 GeV2 :\n2\n\nQ = 3.16 GeV\n\n2\n\n:\n\nαs (Q2 ; MS) = 0.348+?\n−0.093 (exp.)\n\n(36)\n\n0.305+0.132\n−0.074 (exp.)\n\n(37)\n\n2\n\nαs (Q ; MS) =\n\nThe central, upper and lower values here correspond to the pertaining experimental values of ∆(Q2 ) in (34)–(35). In\nthe case Q2 = 2.00 GeV2 , the upper bound for the coupling parameter cannot be obtained from the experimental\ndata because the applied resummation method predicts values of ∆(Q2 ) which are always lower than the presently\nallowed experimental upper bound: ∆(Q2 )meth. ≤ 0.196 [< ∆(Q2 )max exp. = 0.168+0.043]. The situation in the case\nQ2 = 3.16 GeV2 is somewhat similar, the experimental upper bound being now slightly below the maximal value\nallowed by the method. This situation is presented graphically in Figs. 4 and 5 which show ∆(Q2 ) as function of\nαs (Q2 ) as predicted by the applied method, for Q2 = 2.00, 3.16 GeV2 cases, respectively. The central, upper and\nlower experimental bounds are included as straight dotted lines.\nWe now return to the question of the uncertainties of our predictions under the variation of the RScl and RSch. If\nwe vary the RScl parameter ξ 2 ≡ μ2 /Q2 around 3.3 across the interval 1.5 ≤ ξ 2 ≤ 5, the predictions for αs (Q2 ; MS)\n\n8\n\nIn the entries of Table III of Ref. [13], the target mass corrections are included, but the nuclear corrections neglected.\n\n9\n\n\fvary by at most ±0.002. On the other hand, variation of the RSch leads to larger ambiguities. For example, if we\nrepeat the calculation in the 't Hooft RSch (c2 = c3 = 0, we take [2/3]β (x) for definiteness),9 keeping ξ 2 = 3.3, the\npredictions for αs (Q2 ; MS) change by 0.009 (Q2 = 2.00 GeV2 ) and 0.005 (Q2 = 3.16 GeV2 ). We will regard these\nvalues as characteristic values for the RSch–uncertainties of our results. The replacement of the MS [2/3]β (x) by the\nN3 L TPS MS beta function changes our predictions for αs (Q2 ; MS) by only about 0.001.\nYet another source of the theoretical uncertainty in our predictions may be the truncation in the (N3 L) TPS\n(0)\nR(b(w)). We regard the uncertainty ±30 in the estimated value of w3 , Eq. (27), as the major source of the\n2\ntruncation uncertainty. This changes the prediction for αs (Q ; MS) by only ±0.001.\nThe other sources of theoretical uncertainty come from the massive (c–)quark contributions presented in Subsec. III B, due to the uncertainties mc = 1.25 ± 0.10 GeV and sin(θCabibbo ) = |Vcd | = 0.224 ± 0.016 [43]. The resulting\nuncertainties of the predictions for αs (Q2 ; MS) are ±0.002 and ±0.002, respectively, when Q2 = 2.00 GeV2 , and ±0.001\nand ±0.001 when Q2 = 3.16 GeV2 .\nThe final predictions for αs are presented in Table I. In the Table, we presented the central predictions for\n\nαs (Q2 )\nδαs (> 0, exp.)\nδαs (< 0, exp.)\nδαs (RSch)\nδαs (RScl)\nδαs (w3 )\nδαs (mc )\nδαs (sin θc )\nδαs (evol.)\n\nQ2 = 2.00 GeV2\n0.348\n+?\n−0.093\n±0.009\n±0.002\n±0.001\n±0.002\n±0.002\n–\n\n⇒ MZ2\n0.1166\n+?\n−0.0115\n±0.0008\n±0.0002\n±0.0001\n±0.0002\n±0.0003\n±0.0003\n\nQ2 = 3.16 GeV2\n0.305\n+0.132\n−0.074\n±0.005\n±0.002\n±0.001\n±0.001\n±0.001\n-\n\n⇒ MZ2\n0.1167\n+0.0128\n−0.0118\n±0.0006\n±0.0003\n±0.0002\n±0.0002\n±0.0002\n±0.0003\n\n2\nMS\n2\nTABLE I. Predictions for αMS\ns (Q ) and αs (MZ ), extracted by the comparison of the results of the applied resummation method\n\nwith the measured GLS values (34),(35).\n\nαs (Q2 ; MS) when Q2 = 2.00 and 3.16 GeV2 , and the uncertainties of the predictions due to various sources. Further,\nwe RGE–evolved these predictions to the canonical scale MZ2 and included the results in Table I. This RGE evolution\nwas carried out by using the [2/3] Padé approximant of the four–loop MS TPS beta function, using the values of the\nfour–loop coefficient c3 (nf ) [44] and the corresponding three–loop matching conditions [45] for the flavor thresholds.10\nWhen adding in quadrature the various theoretical uncertainties, the predictions of Table I can be summarized as\nQ2 = 2.00 GeV2 :\n⇒\n\nαs (Q2 ; MS) = 0.348+?\n−0.093 (exp.) ± 0.010(th.) ,\n\n(38)\n\nαs (Q2 ; MS) = 0.305+0.132\n−0.074 (exp.) ± 0.006(th.) ,\n\n(40)\n\nαs (MZ2 ; MS)\n\n=\n\n0.1166+?\n−0.0115 (exp.)\n\n± 0.0010(th.) ;\n\n(39)\n\nand\nQ2 = 3.16 GeV2 :\n⇒\n\nαs (MZ2 ; MS)\n\n=\n\n0.1167+0.0128\n−0.0118 (exp.)\n\n± 0.0008(th.) .\n\n(41)\n\nWe see that the predictions of the applied method suggest that the experimental data on the GLS should be refined\nsignificantly in order to increase the predictive power for the QCD coupling parameter.\nAnother observation, evident from Figs. 2–5, is that the nonperturbative massless contributions (NP) to ∆(Q2 ) are\nvery significant, and negative. They have their origin, as explained in the previous Section, in the first IR renormalon\nsingularity at b = 1, or equivalently, they correspond approximately to the d = 2 massless power corrections (∼ 1/Q2 ).\nFor Q2 = 2.00, 3.16 GeV2 , they lead to about 11%, 8%, decrease of the value of ∆(Q2 ), respectively. This is to be\n\n9\n\nFor comparison, cMS\n= 4.471 cMS\n= 20.99, for nf = 3.\n2\n3\nFor details on the corresponding evolution uncertainties, we refer to Ref. [9]. They include the variation when the [2/3]\nPadé form of the beta function is replaced by the TPS form.\n10\n\n10\n\n\fcontrasted with the heavy (c–)quark contribution11 which is positive and leads to only about 3.6%, 3.1% increase of\n∆(Q2 ), respectively. If the c–quark contribution were not included, the central predicted values in (38)–(41) would\nchange to αs (Q2 ) = 0.367, 0.316 [αs (MZ2 ) = 0.1183, 0.1180] for Q2 = 2.00, 3.16 GeV2 , respectively.\nThe small negative \"light–by–light\" contribution was separated from our resummation and then added as the term\n(0)\n∆l.l. (Q2 ) ≈ w2 (l.l.)a3 (μ2 ; c2 , . . .). The \"light–by–light\" part of ∆l.l. (Q2 ), by the special topology of the Feynman\ndiagrams representing it, is a quasiobservable in the sense that it is RScl– and RSch–invariant. Thus, the coefficient\n(0)\nw2 (l.l.) (24) is the leading coefficient of that quasiobservable and is therefore unchanged under the changes of the\nRScl and RSch. The \"light–by–light\" part decreases ∆(Q2 ) by only about 0.4% and 0.3%, for Q2 = 2.00, 3.16 GeV2 ,\nrespectively.\nIV. COMPARISON WITH OTHER APPROACHES\n\nOne may ask how crucial is the introduction of the conformal transformation (15) for obtaining the numerical\npredictions (38)–(41). If we repeat the same analysis, but this time without the conformal transformation, and\nkeeping ξ 2 = 3.3, we obtain\n+?\n2\nQ2 = 2.00 GeV2 : αs (Q2 ; MS) = 0.346+?\n−0.092 (exp.), αs (MZ ; MS) = 0.1163−0.0113 (exp.);\n2\n\n2\n\n2\n\nQ = 3.16 GeV : αs (Q ; MS) =\n\n0.304+0.125\n−0.073 (exp.)),\n\nαs (M2Z ; MS)\n\n=\n\n0.1165+0.0124\n−0.0117 (exp.).\n\n(42)\n(43)\n\nThese results are very close to the results (38)–(41). Thus, we see that the introduction of the conformal transformation\n(15), which had the task of reducing the influence of the UV and the nonleading IR renormalons, does not influence\nsignificantly the predictions. Therefore, we can conclude that these renormalon singularities (at b = −1, −2, . . . and\nb = 2, 3, . . .) are in GLS numerically much less important than the leading IR renormalon singularity (at b = 1), even\nwhen no conformal transformation is introduced.\nWe can ask how our predictions compare with those of other, alternative, OPE based methods which, in contrast\nwith the method applied here, do not take into account explicitly the structure of the leading IR renormalon singularity\nin the Borel plane.\nOne such an alternative method is the (TPS) PMS optimization of the perturbative contribution, which fixes the\nRScl and RSch in the TPS in a judicious manner [30]. Resummations of the GLS sum rule based on this method\nwere theoretically and numerically investigated in 1992 by the authors of Ref. [46]. They were confronting the TPS\nresults with the measured values, paying particular attention to the RScl– and RSch–dependence of the predicted\nvalues of αs (MZ2 ; MS). For the nonperturbative massless (twist–four) d = 2 contribution, they employed the positive\nvalue as obtained in Ref. [17] [∆NP (Q2 ) ≈ 0.1 GeV2 /Q2 ]. Further, the authors of Ref. [46] accounted for the quark\n12\nmass threshold effects (neff.\nFurthermore, they\nf ) by introducing a judiciously chosen weighted average of nf = 3, 4, 5.\n2\n2\nused the GLS measured values available at that time [∆(Q = 3GeV ) = 0.167 ± 0.027] which differ significantly from\nthe presently available values (35). Their central value prediction was αs (MZ2 ) = 0.115, which is lower than our central\nvalue predictions (39),(41).\nThe CCFR group [13,14] carried out a numerical analysis similar to that of the authors of Ref. [46], but with the\nnewer, lower, experimental data (34)–(35) for ∆(Q2 ), and using in the TPS–part MS RSch (and RScl μ2 = Q2 ).\nTheir central value is αs (3 GeV2 ) = 0.278 [14]13 and αs (MZ2 ) = 0.114, thus slightly lower than that of Ref. [46], and\nsignificantly lower than our central value predictions (39) and (41). The principal reason for this difference shall be\n(0)\ndiscussed in the following section. Further, if they included in their method the N3 LO term in the TPS, with w3 as\n2\nestimated in Eq. (27), the predicted value of αs (MZ ) would decrease by about 0.002.\nFurthermore, the CCFR group mentioned that their central value increases to αs (3 GeV2 ) ≈ 0.305 [14] and αs (MZ2 ) =\n0.118 [13,14]14 when they set the twist–four (d = 2) contribution approximately equal to zero. Such higher–twist values\n\n11\n\nThe latter is, to a large degree, a d = 2 massive power correction ∝ m2c /Q2 , see Subsec. III B.\nThis is different from our approach, where we separately added the contributions (30)–(32) of the heavy (c–)quark as\ncorrections to the massless nf = 3 GLS sum rule, as recently suggested in Ref. [41].\n13\nThe values of αs (3 GeV2 ) obtained from our central values of Eqs. (38) and (40) are 0.309 and 0.310, respectively.\n14\nWe note that the RGE evolution of αs from Q2 to MZ2 gives in our approach different results: αs (3 GeV2 ) = 0.278(0.305)\ngives αs (MZ2 ) = 0.1124(0.1162) when using the three–loop or four–loop TPS β–function, 0.1123(0.1161) when using the (four–\nloop) [2/3] PA β–function – we use the corresponding two–loop and three–loop matching conditions for the flavor thresholds\n12\n\n11\n\n\ffor the GLS sum rule are suggested by the calculation by the authors of Ref. [48] based on an IR renormalon model\nwith dispersive approach of Ref. [49], and also by the calculation by the authors of Ref. [50] based on the bag model.\nIt looks reasonable that the result with the aforementioned IR renormalon model method gives prediction rather close\nto our prediction, since our method also accounts for the IR renormalon contribution, although in a different manner.\nHowever, the calculations in Refs. [48,50] apparently do not give us a clear handle on how to treat the perturbative\npart, i.e., whether to take it as a LO, NLO, or NNLO TPS, or in any other form. This is in contrast with our method,\nwhere the perturbative and nonperturbative parts are clearly connected with each other. We discuss this aspect in\nmore detail in the next section.\nAt this point, we would like to point out that the PMS method has a signal casting doubts on its applicability in\nthe discussed GLS cases– namely, the PMS RScl is very low in this case: μ2PMS ≈ 0.203Q2. For Q2 = 2.00, 3.16 GeV2 ,\nthis implies the scales μPMS ≈ 0.64, 0.80 GeV, respectively, which may be too low for the application of perturbative\napproaches such as PMS. The same problem appears when applying the effective charge (ECH) method [34–36] to\nthese GLS cases.\n2\nThe present world average for the QCD coupling parameter is αMS\ns (Mz ) = 0.1173 ± 0.0020 by Ref. [51] and\n0.1184 ± 0.0031 by Ref. [52]. Comparing this with our predictions (39) and (41), we see that the method applied\nin the present paper gives us the central values which agree well with the present world average. We wish to point\nout that this agreement suggests that the method applied in the present paper for the nonperturbative massless\ncorrection to ∆(Q2 ) is at least consistent with the experiments. If this correction were zero, or had the opposite sign,\nthe obtained central prediction for αs (MZ2 ) would be at the lower edge or even outside the interval of the present\nworld average. These considerations do not necessarily imply, but indicate, that the applied method gives the correct\nnonperturbative contributions. For a more definite statement in this respect, the experimental uncertainties in the\nGLS sum rule would have to be reduced significantly.\nV. BOREL RESUMMATION VERSUS OPE APPROACH\n\nIn the discussions so far, we considered the amplitudes of Borel resummation or OPE approach only at fixed values\nof Q2 . Here we mean, for convenience, by the OPE approach the usual perturbative expansion plus a power suppressed\nterm representing the twist–four contribution. In this section we consider them over a continuous range of Q2 . This\nslight change of view will reveal the characteristic features of the two approaches, and enable us to better understand\nthe cause of the significant difference in the extracted strong coupling constants seen in the previous section.\nWe first note the remarkable stability of the Borel resummed amplitudes over the order of perturbation involved\nin their calculation. In Fig. 6 (a)-(b), we plot, over the interval 1 < Q2 < 10, in GeV2 , the real part of the Borel\nresummed amplitudes for ∆P (Q2 ) using NLO, NNLO, and N3 LO perturbations and the corresponding amplitudes of\nthe ordinary TPS's in the OPE approach. In all of the plots in Fig. 6 the N3 LO QCD β-function was used in the\nrunning of the strong coupling. We also take the RG scale at μ2 = Q2 , since the RG scale dependence is sufficiently\nsmall for our present discussion. The aforementioned stability of the Borel resummed amplitudes becomes clear when\nthe two figures are compared. Note the variation in the Borel resummed amplitudes is very small, whereas the TPS\namplitudes have significant order dependence. While this stability is not completely unexpected, because the leading\nrenormalon singularity is effectively softened by the use of the function R(b) in the Borel integration, the degree of\nthe stability is still remarkable. This suggests that the renormalon–induced asymptotic behavior of the perturbative\ncoefficients sets in quite early in perturbation, and that the use of R(b) and conformal mapping in Borel resummation is\nvery efficient in handling the renormalon singularity. We also note in passing that the stability of the Borel resummed\namplitudes for ∆P (Q2 )+∆NP (Q2 ), which are not shown in the figure, is comparable to that of ∆P (Q2 ).\nIn the previous section we have seen there is a significant difference between the Borel resummation and the OPE\napproach in the prediction of the strong coupling constant. While there are obvious differences in the two approaches,\nit was not clear what aspect of the Borel resummation is primarily responsible for the difference. Is it because of the\nperturbative part ∆P (Q2 ) or because of our specific implementation of the nonperturbative part ∆NP (Q2 ), or both?\nTo answer this question we plot in Fig. 6 (c) the Borel resummed ∆P (Q2 )+∆NP (Q2 ) against the OPE amplitudes\n(NLO TPS) + 0.1/Q2 , whose power term representing the twist–four contribution is from the sum rule calculation\n\n[45]; other details given in Ref. [9]. The CCFR Collaboration apparently uses an approximate three–loop RGE evolution [a\ntruncated expansion in inverse powers of ln(μ2 /ΛMS )] and different matching conditions for the flavor thresholds, possibly of\nRef. [47], giving them the values 0.114(0.118).\n\n12\n\n\f[17],15 and (NNLO TPS) + 0.02/Q2. The small power term in the latter was chosen for the amplitude to match\nthe NLO OPE amplitude at large values of Q2 in the plots. In the figure we first notice that the NLO and NNLO\nOPE amplitudes with a large difference in twist–four contribution agree reasonably well over the whole range of\nQ2 considered. This implies that the higher–twist term in the NLO amplitude can be largely accounted for by the\nNNLO perturbative term, which is in qualitative agreement with the observation in Refs. [21,22]. This also shows\nthat the use of the NLO sum rule calculation of the higher–twist contribution with a TPS of different order, which is\nnot an uncommon practice, can be dangerous. Higher–twist contributions calculated at a given order of the leading\nperturbative contribution should never be used with a TPS of different order.\nOn the other hand, the Borel resummed amplitude is in a reasonably good agreement with the OPE amplitudes\nat large Q2 (> 4 GeV2 ), but deviates significantly at small momenta. Obviously, this deviation at small momenta\nexplains the difference in the prediction of the strong coupling. Before we answer the origin of this deviation, we note\nthat the good agreement of the two approaches at large momenta is a nontrivial result. Even though the amplitudes\nfrom the two approaches should agree at very high momenta (or at small couplings), since they have the same low\norder perturbations, the degree of agreement seen here is unlikely to be a random consequence. For instance, if our\n∆NP (Q2 ) had the wrong sign or were zero, then we would see a significant difference at high momenta (see the dotted\nplot for the wrong sign case). Thus this good agreement of our Borel resummed amplitude with the OPE amplitudes\nat high momenta may be regarded as a partial support for our prescription of the nonperturbative part.\nNow back to the question of what causes the deviation at low momenta. It is not difficult to see ∆P (Q2 ) must be\nresponsible for the deviation. The reason is as follows. Since the nonperturbative part ∆NP (Q2 ) essentially behaves\nlike a power suppressed term,16 and ∆P (Q2 )+∆NP (Q2 ) is in agreement with the OPE amplitudes at large momenta,\nso should it be at low momenta, too, were ∆P (Q2 ) to behave like an OPE amplitude. Thus the primary cause of\nthe difference in the predicted strong coupling constant must be that the Borel resummed ∆P (Q2 ) at low momenta\ncannot be parametrized in the form of an OPE amplitude. We can see this explicitly by looking at the plots in Fig.\n6 (d) where, as an example, the NNLO Re[∆P (Q2 )] is plotted against an OPE amplitude (NNLO TPS)+ 0.16/Q2.\nThe power suppressed term in the latter was fixed so that the two amplitudes match at high momenta in the plots.\nClearly, they deviate significantly at low momenta, with the Borel resummed growing more slowly than the OPE\namplitude as the momentum is decreased.\nThis suggests the OPE amplitude tends to overestimate at low momenta. We can easily see that this tendency\narises from the bad functional form of the polynomial Borel transform (TPS of (6)) around the renormalon singularity\nat b = 1. In Fig. 7 (a) the N3 LO Borel transforms in the two approaches are plotted in the variable b. For b > 1 the\nBorel transform in our approach defined through R(b) in (14) is complex, and its real part is plotted. It is obvious\nthat the OPE Borel transform is badly broken around and beyond the renormalon singularity. When the coupling\nis small this is not a serious problem because the dominant contribution to the Borel integral (5) comes from the\nregion close to the origin. However, as the coupling becomes larger the relevant integration region extends to the\nrenormalon singularity, and beyond, and as we see in the plots, the OPE Borel transform can grossly overestimate at\nlarge couplings. The amplitudes obtained from these Borel transforms are plotted in Fig. 7 (b). As expected, at small\nmomenta (large coupling) the OPE amplitude is larger than the Borel resummed. Note, on the other hand, at high\nmomenta it is smaller than the latter. This is because the OPE Borel transform in the region 0 < b < 1, from which\nthe dominant contribution comes at small couplings, is smaller than the other one, which is a characteristic feature\nrendered automatically by the correct implementation of the renormalon singularity in the latter. This difference\nbetween the Borel resummed and the OPE amplitude at small couplings may be regarded as the resummation of the\nunaccounted higher order terms in the same sign asymptotic series.\nThat the Borel resummed ∆P (Q2 ) cannot be approximated by an OPE amplitude of a TPS plus a power suppressed\nterm representing the renormalon effect may appear contradictory to the common opinion which states otherwise.\nThe latter opinion, which is based on the factorially growing large order behavior and the running coupling, would be\ntrue in a sense, provided the strong coupling were sufficiently small, and a TPS of large order (∼ 1/αs ) was used. In\nreality, however, the strong couplings at the low momenta we consider are not so small, and there is no guarantee that\nthe Borel resummed ∆P (Q2 ) at those momenta can be parameterized as an OPE amplitude. The example here clearly\nshows that cannot be generally true. A Borel resummed amplitude can have a much more complex functional behavior\nthan the sum of a TPS and a power term intended to account for the renormalon effect. This consideration suggests\nthat several existing analyses of low energy QCD observables based on the OPE approach should be reexamined, since\n\n15\n\nWe note, however, there are some variations in the estimate of the twist–four contribution. The sum rule calculation of\nRef. [53] predicts the (d = 2) power term 0.16 GeV 2 /Q2 .\n16\n∆NP (Q2 ) ∼ αs (Q2 )γ2 /β0 /Q2 = αs (Q2 )32/81 /Q2 , in accordance with Eqs. (11)–(12) and the OPE calculation of Ref. [16].\n\n13\n\n\fthe issues raised here are likely to be relevant there, too.\nTo sum up this section, we have made two observations concerning the Borel resummation and the OPE approach.\nFirst, our method of calculation of the perturbative plus nonperturbative contribution in Borel resummation is\nconsistent at larger Q2 > 4 GeV2 with the OPE approach using QCD sum rule calculation, and secondly, at low\nenergies the OPE amplitude tends to overestimate, and the Borel resummed amplitude with a proper incorporation\nof the leading renormalon cannot be approximated by an OPE amplitude of a TPS with a power suppressed term.\nIt is the second observation that directly accounts for the differences in the extracted strong coupling constants from\nthe two approaches.\nVI. CONCLUSIONS\n\nWe performed a resummation of the Gross–Llewellyn Smith (GLS) sum rule by fully accounting for the correct\nknown form of the leading infrared (IR) renormalon singularity at b = 1 in the Borel plane. As one direct consequence of this singularity, the resummed \"perturbative\" part ∆P (αs (Q)) of the GLS has a branch cut of the form\nγ /β\n(−αs (Q2 ))−ν exp(−π/β0 αs (Q))[1 + O(αs )], i.e., a twist–four term (−1)−ν (1/Q2 )αs 2 0 [1 + O(αs )] with the branch\ncut discontinuity factor exp(±iπν). Here, γ2 = 8/9 is the known one–loop coefficient of the anomalous dimension of\nthe corresponding twist–four d = 2 operator appearing in the OPE. A crucial element of the analysis was the fixing of\nthe \"nonperturbative\" part as the negative of the aforementioned branch cut term, thus making the resummed (\"perturbative\" plus \"nonperturbative\") GLS sum rule manifestly real. This procedure is free from the known ambiguity of\nseparation of the \"perturbative\" and \"nonperturbative\" parts. In the Borel resummation of the \"perturbative\" part,\nwe further employed a conformal transformation to minimize the numerical influence of other renormalon singularities.\nAll this allowed us to perform the resummation of the massless part of the GLS sum rule, i.e., of the contributions\nof the three light quark flavors. The contributions of the heavy (c–)quark were added separately, as were the target\nnuclear correction contributions and the light–by–light contributions. These three types of contributions turned out\nto be small, in contrast to the \"nonperturbative\" contributions which turned out to be significant. The calculations\nwere performed in the MS renormalization scheme, and the renormalization scale μ2 (∼ Q2 ) was taken in the region\nof the smallest μ2 –sensitivity of our results.\nWe then confronted the resummed expressions with the Fermilab CCFR Collaboration data [13] for the GLS (at\nQ2 = 2, 3.16 GeV2 ) which already include the target mass corrections. Our central value prediction for the QCD\ncoupling parameter, corresponding to the central GLS values of the CCFR, is αs (MZ ) ≈ 0.117 [see Eqs. (38) and\n(41)], in good agreement with the present world average. This is different from the central value predictions of\nprevious analyses of the GLS sum rule by the CCFR Collaboration [13] (αs (MZ ) ≈ 0.114) and by the authors of [46]\n(αs (MZ ) ≈ 0.115) which are below or at the lower edge of the world average. We have seen that our approach to the\ncalculation of the nonperturbative contribution is consistent with the OPE approach, and the main reason for the\ndifference between the two approaches is that at small Q2 < 4 GeV2 , the OPE approach tends to overestimate and\nthe Borel resummed perturbative contribution cannot be approximated by an OPE amplitude.\nThe GLS sum rule, at the low gauge boson transfer momenta Q2 = 2–4 GeV2 , is a very important quantity to\nmeasure, because it has apparently a strong nonperturbative component, stronger than in some other low–energy\nQCD observables such as the semihadronic tau decay rate. The more precise experimental values of the GLS sum\nrule would help determining the higher–twist contributions more accurately.\nACKNOWLEDGMENTS\n\nThe work of C.C. was supported by DGIP (UTFSM). The work of G.C. was supported by the FONDECYT (Chile)\nGrant No. 1010094. The work of T.L. and K.S.J. was supported in part by the BK21 Core Program.\nAppendix A. BRANCH CUT SINGULARITY AND THE NONPERTURBATIVE PART\n\nIn this Appendix, we show explicitly formulas leading to Eqs. (10)–(12), using the identity (5) and the leading IR\nrenormalon singularity structure (7). The latter structure around b = 1 can be rewritten more explicitly as\nW̃0 (b) =\n\n\u0002\n\u0003\nC\nβ 1+ν (1 − b)−1−ν 1 + κ1 (1 − b) + κ2 (1 − b)2 + * * *\nΓ(−ν) 0\n+(Analytic part) .\n14\n\n(A.1)\n\n\fThe leading part is known (ν), while the coefficients κj (j ≥ 1) of the subleading parts are not yet known. Inserting\nthe above expansion into the Borel integration formula (5) and performing the change of the integration variable\nb = 1 + β0 at, we obtain\nIm∆P (a(Q) ± iǫ) =\n\nC\ne−1/β0 a(Q) a(Q)−ν f± (a(Q)) ,\nΓ(−ν)\n\n(A.2)\n\nwhere\nZ\n\n∞±iǫ\n\n\u0002\n\u0003\ndt e−t (−t)−1−ν 1 + κ1 (β0 a)(−t) + κ2 (β0 a)2 (−t)2 + * * *\n0±iǫ\nZ ∞\n\u0002\n\u0003\n= ∓ sin(πν)\ndt e−t t−1−ν 1 + κ1 (β0 a)(−t) + κ2 (β0 a)2 (−t)2 + * * *\n0\n\u0002\n\u0003\n= ∓Γ(−ν) sin(πν) 1 + κ1 (β0 a)ν + κ2 (β0 a)2 ν(ν −1) + * * *\n\nf± (a) = Im\n\n(A.3)\n\nNow requiring the imaginary parts of ∆P at positive a(Q) to match those in (A.2) ∆P for general complex a(Q) can\nbe written as\nn\n∆P (a(Q)) = −Ce−1/β0 a(Q) (−a(Q))−ν + κ1 (−ν)β0 (−a(Q))−ν+1\no\n+κ2 (−ν)(−ν +1)β02 (−a(Q))−ν+2 + * * *\n ̃ P (a(Q)) ,\n+∆\n\n(A.4)\n\n ̃ P (a) is the part with no singularities (no cuts) for a > 0. 17 According to Ref. [15], the nonperturbative\nwhere ∆\npart ∆NP (a(Q) ± iǫ) must cancel the imaginary part of ∆P (a(Q) ± iǫ), and ∆NP was chosen to have the simplest,\npresumably the most natural, form – i.e., just the negative of the branch cut term of (A.4)\nn\n∆NP (a(Q)) = +Ce−1/β0 a(Q) (−a(Q))−ν + κ1 (−ν)β0 (−a(Q))−ν+1\no\n+κ2 (−ν)(−ν +1)β02 (−a(Q))−ν+2 + * * * .\n(A.5)\nFurther, since (−a ∓ iǫ)−ν+n = a−ν+n exp[±i(ν−n)π], expressions (A.2) and (A.5) immediately relate Re∆NP (a ± iǫ)\nwith the (calculable) Im∆P (a ± iǫ)\nRe∆NP (a ± iǫ) = ∓ cot(νπ)Im∆P (a ± iǫ) ,\n\n(A.6)\n\ngiving the result (12).\n\n17\n\nThe absolute value of the singular term in (A.4) can be rewritten as ∼ (Λ2 /Q2 )a(Q)+γ2 /β0 [1 + O(a)], where Λ is a Q–\nindependent scale, and γ2 is the one–loop coefficient of the anomalous dimension of the twist–four (d = 2) operator ≪ O(Q) ≫∼\nΛ2 a(Q)+γ2 /β0 appearing in the OPE (3).\n\n15\n\n\f[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n\n[40]\n[41]\n[42]\n[43]\n\nF. David, Nucl. Phys. B234, 237 (1984).\nF. David, Nucl. Phys. B263, 637 (1986).\nA. H. Mueller, Phys. Lett. B308, 355 (1993).\nG. Grunberg, Phys. Lett. B325, 441 (1994).\nD. E. Soper and L. R. Surguladze, Phys. Rev. D54, 4566 (1996), hep-ph/9511258.\nT. Lee, Phys. Rev. D56, 1091 (1997), hep-th/9611010.\nJ. C. Le Guillou and J. Zinn-Justin, Large order behavior of perturbation theory, (Amsterdam, Netherlands: North-Holland,\n1990), and references therein.\nA. H. Mueller, The QCD perturbation series. Talk given at Workshop on QCD: 20 Years Later, Aachen, Germany, 9-13\nJun 1992:162-171 (QCD161:W586:1992) .\nG. Cvetič and T. Lee, Phys. Rev. D64, 014030 (2001), hep-ph/0101297.\nI. Caprini and J. Fischer, Phys. Rev. D60, 054014 (1999), hep-ph/9811367.\nG. Cvetič, C. Dib, T. Lee, and I. Schmidt, Phys. Rev. D64, 093016 (2001), hep-ph/0106024.\nG. Cvetič, T. Lee, and I. Schmidt, Phys. Lett. B520, 222 (2001), hep-ph/0107069.\nJ. H. Kim et al., Phys. Rev. Lett. 81, 3595 (1998), hep-ex/9808015.\nJ. H. Kim, \"A measurement of αs from the Gross–Llewellyn Smith sum rule,\" PhD thesis, Columbia University, 1998\n(unpublished).\nT. Lee (2001), hep-ph/0104306, to appear in Phys. Rev. D.\nE. V. Shuryak and A. I. Vainshtein, Nucl. Phys. B 199, 451 (1982); ibid. 201, 141 (1982).\nV.M. Braun, and A.V. Kolesnichenko, Nucl. Phys.. B283, 723 (1987).\nB. Lautrup, Phys. Lett. B69, 109 (1977).\nV.A. Novikov, M.A. Shifman, A.I. Vainshtein, and V.I. Zakharov, Nucl. Phys. B249, 445 (1985).\nA comprehensive review on power corrections and renormalons can be found in: M. Beneke and V.M. Braun, hepph/0010208.\nA. L. Kataev, A. V. Kotikov, G. Parente and A. V. Sidorov, Phys. Lett. B 417, 374 (1998) [arXiv:hep-ph/9706534];\nA. L. Kataev, G. Parente and A. V. Sidorov, Nucl. Phys. B 573, 405 (2000) [arXiv:hep-ph/9905310]; A. L. Kataev,\nG. Parente and A. V. Sidorov, arXiv:hep-ph/0106221.\nU.K. Yang, and A. Bodek, Phys. Rev. Lett. 82, 2467 (1999); U.K. Yang, A. Bodek, and Q. Fan, hep-ph/9806457.\nB.V. Geshkenbein, B.L. Ioffe, and K.N. Zyablyuk, Phys. Rev. D64, 093009 (2001).\nA. Shifman, A.I. Vainshtein, and V.I. Zakharov, Nucl. Phys. B147, 448 (1979).\nT. Lee, Phys. Lett. B462, 1 (1999).\nG. Parisi, Nucl. Phys. B150, 163 (1979).\nC. N. Lovett-Turner and C. J. Maxwell, Nucl. Phys. B452, 188 (1995).\nM. Beneke, Phys. Rept. 317, 1 (1999), and references therein.\nO. Nachtmann, Nucl. Phys. B63, 237 (1973).\nP. M. Stevenson, Phys. Rev. D23, 2916 (1981).\nS. G. Gorishny and S. A. Larin, Phys. Lett. B 172, 109 (1986); E. B. Zijlstra and W. Van Neerven, Phys. Lett. B 297,\n377 (1992).\nS. A. Larin and J. A. M. Vermaseren, Phys. Lett. B 259, 345 (1991);\nK.S. Jeong and T. Lee, hep-ph/0204150.\nG. Grunberg, Phys. Lett. 95B, 70 (1980), 110B, 501(E) (1982); 114B, 271 (1982); Phys. Rev. D 29, 2315 (1984).\nA. L. Kataev, N. V. Krasnikov and A. A. Pivovarov, Nucl. Phys. B 198, 508 (1982) [Erratum-ibid. B 490, 505 (1982)]\n[hep-ph/9612326].\nA. Dhar and V. Gupta, Phys. Rev. D 29, 2822 (1984); V. Gupta, D. V. Shirkov, and O. V. Tarasov, Int. J. Mod. Phys. A\n6, 3381 (1991).\nA. L. Kataev and V. V. Starshenko, Mod. Phys. Lett. A 10, 235 (1995).\nG. Cvetič, Phys. Lett. B 486, 100 (2000); G. Cvetič and R. Kögerler, Phys. Rev. D63 (2001) 056013.\nS. J. Brodsky, G. P. Lepage and P. B. Mackenzie, Phys. Rev. D 28, 228 (1983). A. L. Kataev and V. V. Starshenko, Phys.\nRev. D 52, 402 (1995) [arXiv:hep-ph/9412305]; J. R. Ellis, I. Jack, D. R. Jones, M. Karliner and M. A. Samuel, Phys.\nRev. D 57, 2665 (1998) [arXiv:hep-ph/9710302]. F. A. Chishtie and V. Elias, Phys. Lett. B 521, 434 (2001) [arXiv:hepph/0107052].\nM. Buza, Y. Matiounine, J. Smith and W. L. van Neerven, Nucl. Phys. B 485, 420 (1997) [arXiv:hep-ph/9608342].\nJ. Blümlein and W. L. van Neerven, Phys. Lett. B 450, 417 (1999) [arXiv:hep-ph/9811351].\nS. A. Kulagin, Nucl. Phys. A640, 435 (1998).\nParticle Data Group, D. E. Groom et al., Eur. Phys. J. C 15, 695 (2000).\n\n16\n\n\f[44]\n[45]\n[46]\n[47]\n[48]\n[49]\n[50]\n[51]\n[52]\n[53]\n\nT. van Ritbergen, J. A. M. Vermaseren and S. A. Larin, Phys. Lett. B 400, 379 (1997).\nK. G. Chetyrkin, B. A. Kniehl, and M. Steinhauser, Phys. Rev. Lett. 79, 2184 (1997).\nJ. Chyla and A. L. Kataev, Phys. Lett. B 297, 385 (1992) [arXiv:hep-ph/9209213].\nW. J. Marciano, Phys. Rev. D 29, 580 (1984).\nM. Dasgupta and B. R. Webber, Phys. Lett. B 382, 273 (1996) [arXiv:hep-ph/9604388].\nY. L. Dokshitzer, G. Marchesini and B. R. Webber, Nucl. Phys. B 469, 93 (1996) [arXiv:hep-ph/9512336].\nS. Fajfer and R. J. Oakes, Phys. Lett. B 163, 385 (1985).\nI. Hinchliffe and A. V. Manohar, Ann. Rev. Nucl. Part. Sci. 50, 643 (2000) [arXiv:hep-ph/0004186].\nS. Bethke, J. Phys. G 26, R27 (2000) [arXiv:hep-ex/0004021].\nG. G. Ross and R. G. Roberts, Phys. Lett. B 322, 425 (1994) [arXiv:hep-ph/9312237].\n\ni\nw−plane\n\nw(b=1)\n\nw(b=−1)=−1\n\nφ\n\nw(b=2)=1\n\nC_ ray\nw(b=3)\n\nw(b=infinity)\n\nFIG. 1. Integration in the w–plane along the C− ray w = x exp(−iφ) (0 < x < 1, φ = 0.67967) gives the same result as the integration\nparallel to the positive real axis (0 < w < 1) and arc w = exp(−iφ′ ) (0 < φ′ < φ). If integrating in the first quadrant, the paths are those\nobtained from the presented paths by reflection across the real axis, and the C+ ray is w = x exp(+iφ).\n\n17\n\n\f0.19\n\nQ2 = 2.00 GeV2\nαs(Q2, barMS) = 0.3483\n\n0.185\n\nP (N3L)\n\n∆(Q2)\n\n0.18\n0.175\n\nP (N2L)\n\n0.17\n\n0.168\n\ntotal (N3L)\ntotal (N2L)\n\n0.165\n\nP+NP (N3L)\nP+NP (N2L)\n\n0.16\n0.155\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n2\n\nμ /Q\n=\n\n∆(Q2 , P+NP)\n\n∆(Q2 , l.l.)\n\n∆(Q2 , c\n\n3.5\n\n4\n\n4.5\n\n5\n\n+\n+\n− quark), as well as the nf = 3 perturbative part ∆(Q2 , P ) and\nnonperturbative part\nas functions of the renormalization scale μ2 , as given by the applied resummation method. Given are\n3\nthe results at the N L level, and for comparison, at the NNL level. The curves are for Q2 = 2.00 GeV2 and αs (Q2 , MS) = 0.3483.\n\nFIG. 2. The (total)\n\n∆(Q2 )\n\n3\n2\n\n∆(Q2 , N P ),\n\n18\n\n\f0.17\nQ2 = 3.16 GeV2\nαs(Q , barMS) = 0.3053\n2\n\n0.165\n0.16\n\n∆(Q2)\n\nP (N3L)\n0.155\nP (N2L)\n0.15\n\ntotal (N3L)\ntotal (N2L)\n\n0.149\n\n0.145\n\nP+NP (N3L)\nP+NP (N2L)\n\n0.14\n0.135\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n2\n\n3\n\nμ /Q\n\n3.5\n\n4\n\n4.5\n\n5\n\n2\n\nFIG. 3. Same as in Fig. 2, this time for Q2 = 3.16 GeV2 and αs (Q2 , MS) = 0.3053.\n\n0.25\n\nQ2=2.00 GeV2\nξ2=3.3\n\n∆(P)\n0.168 + 0.043\n\n∆(total)\n\n0.2\n\n∆(Q2)\n\n0.168\n\n∆(P+NP)\n\n0.15\n\n0.168 – 0.043\n\n0.1\n\n0.05\n∆(c)\n∆(l.-l.)\n\n0\n0.2\n\n0.3\n\n0.4\n\n0.5\nαs(Q , barMS)\n\n0.6\n\n0.7\n\n0.8\n\n2\n\nFIG. 4. The (total) ∆(Q2 ) = ∆(Q2 , P+NP) + ∆(Q2 , l.l.) + ∆(Q2 , c − quark), and the separate parts, as functions of αs (Q2 , MS), as\ngiven by the applied resummation method. The renormalization scale was fixed to be ξ 2 ≡ μ2 /Q2 = 3.3, and the W –boson virtuality is\nQ2 = 2.00 GeV2 . The present experimental bounds and the central value, for the total ∆(Q2 ) in this case, are denoted as three horizontal\ndashed lines.\n\n19\n\n\fQ2=3.16 GeV2\n\n0.25\n\n∆(P)\n\nξ2=3.3\n\n∆(Q2)\n\n0.2\n\n0.15\n\n∆(total)\n\n0.149 + 0.039\n\n∆(P+NP)\n\n0.149\n\n0.149 – 0.039\n\n0.1\n\n0.05\n∆(c)\n∆(l.-l.)\n\n0\n0.2\n\n0.3\n\n0.4\n\n0.5\nαs(Q , barMS)\n\n0.6\n\n0.7\n\n0.8\n\n2\n\nFIG. 5. Same as in Fig. 4, but this time for the W –boson virtuality Q2 = 3.16 GeV2 .\n\n20\n\n\fFIG. 6. Borel resummed and OPE amplitudes versus Q2 (GeV2 ). αs (2GeV 2 ) = 0.35 is assumed. (a): Borel resummed amplitudes\nof the perturbative part Re[∆P (Q2 )] at NLO, NNLO, and N3 LO; (b): NLO (dot–dashed), NNLO (dashed), and N3 LO TPS (solid) of\nW0 (αs (Q)); (c): Borel resummed ∆P (Q2 )+∆NP (Q2 ) (solid line) against NLO (dashed) and NNLO (dot–dashed) OPE amplitudes. Dotted\nline denotes the Borel resummed with the wrong sign; (d): Borel resummed Re[∆P (Q2 )] (solid) versus an NLO OPE amplitude (dashed).\n\n21\n\n\fFIG. 7. (a): N3 LO Borel transforms. The solid line represents the real part of the Borel transform with the renormalon at b = 1\nproperly taken into account, and the dashed line represents the TPS Borel transform. (b): N3 LO Borel resummed Re[∆P (Q2 )] (solid line)\nversus N3 LO TPS (dashed).\n\n22\n\n\f"}