{"id": "http://arxiv.org/abs/hep-th/0505029v2", "guidislink": true, "updated": "2005-05-07T04:08:13Z", "updated_parsed": [2005, 5, 7, 4, 8, 13, 5, 127, 0], "published": "2005-05-03T19:29:23Z", "published_parsed": [2005, 5, 3, 19, 29, 23, 1, 123, 0], "title": "Supersymmetry Breaking from a Calabi-Yau Singularity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0505143%2Chep-th%2F0505157%2Chep-th%2F0505219%2Chep-th%2F0505068%2Chep-th%2F0505159%2Chep-th%2F0505074%2Chep-th%2F0505062%2Chep-th%2F0505085%2Chep-th%2F0505146%2Chep-th%2F0505130%2Chep-th%2F0505248%2Chep-th%2F0505166%2Chep-th%2F0505087%2Chep-th%2F0505255%2Chep-th%2F0505091%2Chep-th%2F0505208%2Chep-th%2F0505222%2Chep-th%2F0505193%2Chep-th%2F0505236%2Chep-th%2F0505077%2Chep-th%2F0505037%2Chep-th%2F0505272%2Chep-th%2F0505071%2Chep-th%2F0505174%2Chep-th%2F0505133%2Chep-th%2F0505266%2Chep-th%2F0505014%2Chep-th%2F0505003%2Chep-th%2F0505267%2Chep-th%2F0505237%2Chep-th%2F0505018%2Chep-th%2F0505132%2Chep-th%2F0505096%2Chep-th%2F0505258%2Chep-th%2F0505049%2Chep-th%2F0505136%2Chep-th%2F0505007%2Chep-th%2F0505125%2Chep-th%2F0505113%2Chep-th%2F0505076%2Chep-th%2F0505052%2Chep-th%2F0505214%2Chep-th%2F0505126%2Chep-th%2F0505168%2Chep-th%2F0505205%2Chep-th%2F0505070%2Chep-th%2F0505210%2Chep-th%2F0505200%2Chep-th%2F0505103%2Chep-th%2F0505239%2Chep-th%2F0505121%2Chep-th%2F0505259%2Chep-th%2F0505098%2Chep-th%2F0505172%2Chep-th%2F0505055%2Chep-th%2F0505223%2Chep-th%2F0505204%2Chep-th%2F0505009%2Chep-th%2F0505042%2Chep-th%2F0505213%2Chep-th%2F0505152%2Chep-th%2F0505015%2Chep-th%2F0505250%2Chep-th%2F0505167%2Chep-th%2F0505198%2Chep-th%2F0505116%2Chep-th%2F0505024%2Chep-th%2F0505247%2Chep-th%2F0505137%2Chep-th%2F0505269%2Chep-th%2F0505057%2Chep-th%2F0505199%2Chep-th%2F0505117%2Chep-th%2F0505060%2Chep-th%2F0505260%2Chep-th%2F0505092%2Chep-th%2F0505163%2Chep-th%2F0505186%2Chep-th%2F0505154%2Chep-th%2F0505145%2Chep-th%2F0505065%2Chep-th%2F0505273%2Chep-th%2F0505150%2Chep-th%2F0505115%2Chep-th%2F0505160%2Chep-th%2F0505005%2Chep-th%2F0505176%2Chep-th%2F0505032%2Chep-th%2F0505139%2Chep-th%2F0505257%2Chep-th%2F0505197%2Chep-th%2F0505226%2Chep-th%2F0505187%2Chep-th%2F0505020%2Chep-th%2F0505251%2Chep-th%2F0505161%2Chep-th%2F0505102%2Chep-th%2F0505100%2Chep-th%2F0505274%2Chep-th%2F0505029%2Chep-th%2F0505212&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Supersymmetry Breaking from a Calabi-Yau Singularity"}, "summary": "We conjecture a geometric criterion for determining whether supersymmetry is\nspontaneously broken in certain string backgrounds. These backgrounds contain\nwrapped branes at Calabi-Yau singularites with obstructions to deformation of\nthe complex structure. We motivate our conjecture with a particular example:\nthe $Y^{2,1}$ quiver gauge theory corresponding to a cone over the first del\nPezzo surface, $dP_1$. This setup can be analyzed using ordinary supersymmetric\nfield theory methods, where we find that gaugino condensation drives a\ndeformation of the chiral ring which has no solutions. We expect this breaking\nto be a general feature of any theory of branes at a singularity with a smaller\nnumber of possible deformations than independent anomaly-free fractional\nbranes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0505143%2Chep-th%2F0505157%2Chep-th%2F0505219%2Chep-th%2F0505068%2Chep-th%2F0505159%2Chep-th%2F0505074%2Chep-th%2F0505062%2Chep-th%2F0505085%2Chep-th%2F0505146%2Chep-th%2F0505130%2Chep-th%2F0505248%2Chep-th%2F0505166%2Chep-th%2F0505087%2Chep-th%2F0505255%2Chep-th%2F0505091%2Chep-th%2F0505208%2Chep-th%2F0505222%2Chep-th%2F0505193%2Chep-th%2F0505236%2Chep-th%2F0505077%2Chep-th%2F0505037%2Chep-th%2F0505272%2Chep-th%2F0505071%2Chep-th%2F0505174%2Chep-th%2F0505133%2Chep-th%2F0505266%2Chep-th%2F0505014%2Chep-th%2F0505003%2Chep-th%2F0505267%2Chep-th%2F0505237%2Chep-th%2F0505018%2Chep-th%2F0505132%2Chep-th%2F0505096%2Chep-th%2F0505258%2Chep-th%2F0505049%2Chep-th%2F0505136%2Chep-th%2F0505007%2Chep-th%2F0505125%2Chep-th%2F0505113%2Chep-th%2F0505076%2Chep-th%2F0505052%2Chep-th%2F0505214%2Chep-th%2F0505126%2Chep-th%2F0505168%2Chep-th%2F0505205%2Chep-th%2F0505070%2Chep-th%2F0505210%2Chep-th%2F0505200%2Chep-th%2F0505103%2Chep-th%2F0505239%2Chep-th%2F0505121%2Chep-th%2F0505259%2Chep-th%2F0505098%2Chep-th%2F0505172%2Chep-th%2F0505055%2Chep-th%2F0505223%2Chep-th%2F0505204%2Chep-th%2F0505009%2Chep-th%2F0505042%2Chep-th%2F0505213%2Chep-th%2F0505152%2Chep-th%2F0505015%2Chep-th%2F0505250%2Chep-th%2F0505167%2Chep-th%2F0505198%2Chep-th%2F0505116%2Chep-th%2F0505024%2Chep-th%2F0505247%2Chep-th%2F0505137%2Chep-th%2F0505269%2Chep-th%2F0505057%2Chep-th%2F0505199%2Chep-th%2F0505117%2Chep-th%2F0505060%2Chep-th%2F0505260%2Chep-th%2F0505092%2Chep-th%2F0505163%2Chep-th%2F0505186%2Chep-th%2F0505154%2Chep-th%2F0505145%2Chep-th%2F0505065%2Chep-th%2F0505273%2Chep-th%2F0505150%2Chep-th%2F0505115%2Chep-th%2F0505160%2Chep-th%2F0505005%2Chep-th%2F0505176%2Chep-th%2F0505032%2Chep-th%2F0505139%2Chep-th%2F0505257%2Chep-th%2F0505197%2Chep-th%2F0505226%2Chep-th%2F0505187%2Chep-th%2F0505020%2Chep-th%2F0505251%2Chep-th%2F0505161%2Chep-th%2F0505102%2Chep-th%2F0505100%2Chep-th%2F0505274%2Chep-th%2F0505029%2Chep-th%2F0505212&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We conjecture a geometric criterion for determining whether supersymmetry is\nspontaneously broken in certain string backgrounds. These backgrounds contain\nwrapped branes at Calabi-Yau singularites with obstructions to deformation of\nthe complex structure. We motivate our conjecture with a particular example:\nthe $Y^{2,1}$ quiver gauge theory corresponding to a cone over the first del\nPezzo surface, $dP_1$. This setup can be analyzed using ordinary supersymmetric\nfield theory methods, where we find that gaugino condensation drives a\ndeformation of the chiral ring which has no solutions. We expect this breaking\nto be a general feature of any theory of branes at a singularity with a smaller\nnumber of possible deformations than independent anomaly-free fractional\nbranes."}, "authors": ["D. Berenstein", "C. P. Herzog", "P. Ouyang", "S. Pinansky"], "author_detail": {"name": "S. Pinansky"}, "author": "S. Pinansky", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2005/09/084", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0505029v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0505029v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "32 pages, 6 figures, latex, v2: minor changes, refs added", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0505029v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0505029v2", "journal_reference": "JHEP0509:084,2005", "doi": "10.1088/1126-6708/2005/09/084", "fulltext": "hep-th/0505029\nNSF-KITP-05-27\n\narXiv:hep-th/0505029v2 7 May 2005\n\nSupersymmetry Breaking from a Calabi-Yau\nSingularity\nD. Berenstein∗, C. P. Herzog†, P. Ouyang∗, and S. Pinansky∗\n† Kavli Institute for Theoretical Physics\nUniversity of California\nSanta Barbara, CA 93106, USA\n\n∗ Physics Department\nUniversity of California\nSanta Barbara, CA 93106, USA\n\nAbstract\nWe conjecture a geometric criterion for determining whether supersymmetry is spontaneously broken in certain string backgrounds. These backgrounds contain wrapped\nbranes at Calabi-Yau singularites with obstructions to deformation of the complex\nstructure. We motivate our conjecture with a particular example: the Y 2,1 quiver\ngauge theory corresponding to a cone over the first del Pezzo surface, dP1 . This setup\ncan be analyzed using ordinary supersymmetric field theory methods, where we find\nthat gaugino condensation drives a deformation of the chiral ring which has no solutions. We expect this breaking to be a general feature of any theory of branes at a\nsingularity with a smaller number of possible deformations than independent anomalyfree fractional branes.\n\nMay 2005\n\n\f1\n\nIntroduction\n\nSupersymmetry and supersymmetry breaking are central ideas both in contemporary particle physics and in mathematical physics. In this paper, we argue that for a large new\nclass of D-brane models there exists a simple geometric criterion which determines whether\nsupersymmetry breaking occurs.\nThe models of interest are based on Calabi-Yau singularities with D-branes placed at or\nnear the singularity. By taking a large volume limit, it is possible to decouple gravity from\nthe theory, and ignore the Calabi-Yau geometry far from the branes. Although one typically\nbegins the construction with branes free to move throughout the Calabi-Yau space, many\ninteresting theories include fractional branes (or wrapped branes), which are D-branes stuck\nat the singularity and which cannot move away from it. These fractional branes can lead\nto topology changes in the geometry via gaugino condensation, which can be understood\nin terms of deformations of the complex structure of the Calabi-Yau singularity, and result\nin the replacement of branes by fluxes [1, 2]. Models of this type, Calabi-Yau geometries\nwith fluxes, are among the ingredients used to construct viable cosmological models within\nstring theory with a positive cosmological constant [3], and which, because of that positivity,\nultimately break supersymmetry. With current approaches in the literature, the issue of\nwhether or not supersymmetry breaking is under control is controversial.\nIt turns out that there exist some singular geometries which admit fractional branes, but\nfor which the associated complex structure deformations are obstructed. We will argue that\nin such setups a deformation can still take place, but that the geometric obstruction induces\nsupersymmetry breaking.\nConjecture. Given a set of ordinary and fractional branes probing a Calabi-Yau singularity,\nsupersymmetry breaking by obstructed geometry (SUSY-BOG) occurs when the singularity\nadmits fewer deformations than the number of (anomaly free) independent fractional branes\nthat one can add to the system.\nIn this paper we will show how this breaking occurs in one particular example, D-branes\nprobing the singularity of the Calabi-Yau cone over the first del Pezzo surface, dP1 . This\ncase can be analyzed using the gauge theory/gravity correspondence. In field theory, the\nmechanism that spontaneously breaks SUSY is simply gaugino condensation. In terms of the\ndual gravity theory and its local Calabi-Yau geometry, the deformation obstruction causes\nthe breaking. The SUSY-BOG adds a new feature to the string theory landscape.\ndP1 belongs to a large class of singularities for which this geometric obstruction is easy\nto understand. We need the technical concept from algebraic geometry of a singularity\nwhich is an \"incomplete intersection variety.\" These varieties are described by n equations\nin m variables, where the dimension of the variety is strictly greater than m − n. Although\n1\n\n\fthe n equations or relations are redundant, it is impossible to reduce the number of equations further without changing the geometry. In the case of an incomplete intersection, the\nredundancy makes it hard to deform the equations consistently, giving an obstruction to\ndeformation. These incomplete intersections are believed to be more generic than \"complete\nintersections,\" where the dimension of the variety is equal to m − n.\nIn the dual field theory, the m complex variables can be associated to generators of the\nchiral ring of the theory, while the relations in the geometry can be understood as relations\nin the chiral ring. We will develop this picture further to make this set of ideas more precise.\nA generic property of fractional branes is that they have gaugino condensation on their\nworldvolume, which translates to non-trivial deformed relations in the chiral ring of the field\ntheory. When it is possible to deform the equations of the chiral ring consistently, the field\ntheory realizes a supersymmetric vacuum. If it is impossible to deform the equations in the\nchiral ring consistently, then the theory spontaneously breaks supersymmetry.\n\n1.1\n\nThe Conifold vs. dP1\n\nPerhaps the prototypical example of a Calabi-Yau singularity with fractional branes is the\nconifold singularity, in the setups of Klebanov and Witten [4] (see also [5, 6]), and its generalization to the warped deformed conifold geometry of Klebanov and Strassler (KS) [1]. The\nKS solution is an example of a space with no obstruction to deformation, and in this case\nchiral symmetry breaking and confinement in the strongly coupled dual gauge theory may\nbe identified with the deformation in a precise way.\nRecall that the construction of the KS solution begins by placing a stack of N D3-branes\nand M D5-branes at the tip of the conifold:\n4\nX\n\nzi2 = 0 .\n\n(1)\n\ni=1\n\nThe D5-branes are fractional. In the supergravity solution, the D-branes are replaced by their\ncorresponding RR five-form and three-form fluxes. The three-form flux from the D5-branes\nleads to a singularity unless the conifold is deformed:\n4\nX\n\nzi2 = ǫ .\n\n(2)\n\ni=1\n\nThis ǫ parameter is interpreted as a gaugino condensate in the dual theory and breaks the\nR-symmetry to Z2 . Moreover, cutting off the cone at a radius ǫ produces confining behavior\nof strings in this geometry which are dual to electric flux tubes in the gauge theory.\nNaively, one could imagine that a very similar phenomenon occurs for the cone over dP1 ,\nbut there is an obstruction. A theorem by Altmann [7] claims that there are no deformations\n2\n\n\fof this cone. While the conifold has the single defining equation (1), we recall below that\nthe cone over dP1 requires twenty algebraic relations in C9 which are not all independent. It\nis impossible to alter all twenty consistently by adding the analog of ǫ in (2).\nThe conformal analog of the dP1 model with no D5-branes was first proposed separately\nby Kehagias [6] and by Morrison and Plesser [5] as an example of a generalized AdS/CFT\ncorrespondence. Type IIB string theory propagating in AdS5 × Y , where Y is a particular\nU(1) bundle over dP1 , is equivalent to a superconformal N = 1 gauge theory whose field\ncontent and superpotential were later derived in [8] using techniques from toric geometry\n(see Fig. 1).\nRecently, the metric on Y was discovered. Martelli and Sparks [9] have shown that this\nU(1) bundle over dP1 , Y = Y 2,1 , is a particular example of the Y p,q Sasaki-Einstein manifolds\nfound in [10, 11]. Using the explicit metric, impressive comparisons of the conformal anomaly\ncoefficients and R-charges between the AdS and the CFT sides were carried out for dP1 in\n[12, 13].\nAs was the case for the conifold, adding D5-branes to the tip of the cone over dP1 breaks\nconformal invariance and leads to a cascading gauge theory [14, 15]. Recently, a supergravity\nsolution dual to this cascading theory was derived by Herzog, Ejaz, and Klebanov (HEK)\n[16]. The HEK solution shares many of the features of the predecessor of the KS solution, the\nKlebanov-Tseytlin (KT) solution [17]. Like the KT solution, the HEK solution is singular\nin the infrared (small radius); at large radius, in the ultraviolet, the KT solution approaches\nthe KS solution. The large radius region can be used to calculate geometrically the NSVZ\nbeta functions and logarithmic running in the number of colors, and this geometric behavior\nmatches our field theoretic understanding of a duality cascade.\nHowever, there currently is no known analog of the KS solution for dP1 that smooths\nthe singularity in the infrared. The motivation behind this research was to understand the\ninfrared physics of dP1 .\n\n1.2\n\nSummary of the dP1 Argument\n\nSince the Calabi-Yau deformations are obstructed, we argue that supersymmetry is broken\nat the bottom of the duality cascade for dP1 . Our argument has three field theoretic legs.\nFirst we argue that there is no superconformal fixed point to which the cascading theory\nmay flow, ruling out strong coupling behavior that is not confinement. Next, turning on\nFayet-Iliopoulos terms in the field theory, we show that the theory should confine in the\ninfrared. Last, using the Konishi anomaly [18], we show there are no solutions to the F-term\nequations.\nThe last step requires some immediate clarification. The field theory analysis is well\n3\n\n\fsuited for studying vacua where mesonic operators get expectation values – the mesonic\nbranch – and is less so for the baryonic branch. We will show that the mesonic branch of\nthe dP1 field theory spontaneously breaks supersymmetry.\nWe have a traditional field theory argument that supersymmetry is not preserved along\nthe baryonic branch, but the argument is not as rigorous as the Konishi anomaly approach.\nIt may be that there exists a supersymmetric, pure flux supergravity solution (which does not\ninvolve a Calabi-Yau manifold), similar to the recent SU(3) structure solutions of [19, 20].\nRecall that the KS solution represents a particular point in the baryonic branch of the conifold\nfield theory [21]. As one moves along the baryonic branch, one finds that the geometry is no\nlonger Calabi-Yau but is instead an SU(3) structure solution where probe D3-branes break\nsupersymmetry.\nFor generic initial number of D3- and D5-branes in the UV, we expect to have left-over\nD3-branes at the bottom of the cascade. The KS solution represents a particular point\nin the baryonic branch where these D3-branes will remain supersymmetric. However, even\nif there is an SU(3) structure solution for dP1 , the left-over D3-branes will always break\nsupersymmetry.\nWe emphasize that the supersymmetry breaking is an infrared effect. The warp factor\nin the geometry will lead to an exponential separation between the ultraviolet and infrared\nscales, giving a natural way of achieving low-scale supersymmetry breaking should we embed\nthis cone over dP1 in a compact Calabi-Yau. An optimistic point of view is that one might\nbe able to build supergravity solutions from compactified versions of this cone over dP1 , and\nusing these solutions, produce realistic cosmological models similar to [3] where all stringy\nmoduli are stabilized and supersymmetry is broken in a controlled way. Such solutions\ndeserve further study.\n\n2\n\nThe Gauge Theory for dP1\n\nThe quiver theory for the first del Pezzo has four gauge groups and a number of bifundamental\nfields conveniently summarized using a quiver diagram (see Fig. 1). The superpotential for\nthe first del Pezzo takes the form\nW = ǫαβ ULα V β Y1 − ǫαβ URα Y2 V β − ǫαβ ULα Y3 URβ Z .\n\n(3)\n\nThere is an SU(2) global symmetry: the indices α and β are either one or two and ǫ12 = 1.\nIn the case M = 0, the gauge theory has a superconformal fixed point with an AdS/CFT\ndual description: type IIB string theory in a AdS5 × Y 2,1 background. Adding M D5-branes\nbreaks the superconformal symmetry and starts a Seiberg duality cascade, as argued in\n[14, 15, 16]. In the limit M ≪ N, we can calculate the NSVZ β-functions and find that\n4\n\n\fZ\n\nSU(N)\n\nSU(N+3M)\n\nY2\n\nY1\n\nUL\n\nSU(N+2M)\n\nUR\n\nSU(N+M)\n\nV , Y3\n\nFigure 1: The quiver theory for Y 2,1 , also known as an irregular U(1) fibration of P2 blown\nup at a point.\ngenerically the SU(N +3M) group runs to strong coupling first as the energy scale decreases.\nTaking the Seiberg dual of the SU(N + 3M) group yields the same quiver and superpotential\nbut with N → N − M, i.e. the number of D3-branes slowly decreases with energy scale.\nBefore tackling the problem of what happens when N becomes of order M, we would like\nto demonstrate how the geometry of the first del Pezzo can be recovered from the F-term\nrelations of this gauge theory.\n\n2.1\n\nThe Chiral Ring\n\nThe superpotential (3) gives rise to the ten classical F-term equations\n∂W\n=0,\n∂Xi\n\n(4)\n\none for each Xi , where Xi = ULα , URα , V α , Yj , or Z. We list these ten equations:\nUL1 V 2 = UL2 V 1 ,\n1\n\nV UR2\nUR1 ZUL2\nUL1 Y3 UR2\nV β Y1\n\n= V\n=\n=\n=\n\nβ\n\n=\n\nY1 ULβ\n\n=\n\nY2 V\n\n2\n\nUR1\n\n,\n\nUR2 ZUL1 ,\nUL2 Y3 UR1 ,\nY3 URβ Z ,\nZULβ Y3 ,\nURβ Y2 .\n\n(5)\n(6)\n(7)\n(8)\n(9)\n(10)\n(11)\n\nTo see the geometry emerge from the F-term equations, we study the spectrum of chiral\n5\n\n\fprimary operators of the schematic form\nO = tr (Xi1 Xi2 Xi3 . . . Xin ) ,\n\n(12)\n\nwhere we contract all of the color indices to form a gauge invariant operator. The trace\nstructure means that these gauge invariant operators will correspond to loops in the quiver\ndiagram.\nThe reason this expression (12) is schematic is that the actual chiral primary operator\nwill be a polynomial of such traces. The traces generate the chiral ring. Just as we think of\nharmonic forms as representatives of classes in cohomology, we can think of a chiral primary\noperator as a representative of a class of operators related by the F-term equations. By only\ngiving a single trace, we are really specifying a class of such operators related to each other\nby the F-term equations.\nThere are six types of operators that loop just once around the quiver\nURα Y2 Y3 ;\n\nURα Y2 V β ;\n\nY1 ULα Y3 ;\n\nY1 ULα V β ;\n\nURα ZULβ V γ .\n\nURα ZULβ Y3 ;\n\n(13)\n\nFrom these six building blocks, we can form any operator of the form (12). The final trace\nwill always be over the gauge group in the lower right hand corner of the quiver.\nNow of these six building blocks, only three are independent. Note that from (11),\n= Y1 ULα Y3 and that URα Y2 V β = Y1 ULα V β . Moreover, under (10), URα Y2 V β = URα ZULβ Y3 .\nWe will choose the three independent blocks\nURα Y2 Y3\n\nURα Y2 Y3 ;\n\nURα ZULβ Y3 ;\n\nURα ZULβ V γ .\n\n(14)\n\nThese blocks satisfy some additional important relations. They are symmetric under\ninterchange of their SU(2) indices. From (7), we see that URα ZULβ Y3 = URβ ZULα Y3 . Moreover,\nfrom (7) and (5), we see that\nURα ZULβ V γ = URα ZULγ V β = URγ ZULα V β .\n\n(15)\n\nWe now study what happens when we assemble these blocks into larger operators. We\nfind that\nURα Y2 Y3 * URβ ZULγ V δ = URα Y2 V β Y1 ULγ V δ\nURα ZULβ Y3 URγ Y2 V δ\nURα ZULβ Y3 * URγ ZULδ Y3\n\n=\n=\n6\n\n(16)\n.\n\n\fThe * has been added as a guide to the eye. Similar types of manipulation reveal also that\nthese blocks commute with one another. In particular\nURα Y2 Y3 * URβ ZULγ Y3 = URβ ZULγ Y3 * URα Y2 Y3 ,\n\n(17)\n\nURα ZULβ Y3 * URγ ZULδ V ǫ = URγ ZULδ V ǫ * URα ZULβ Y3 .\n\n(18)\n\nand that\nFinally, with a little more work, one can show that any product of the (14) is symmetric in\nthe SU(2) indices.\nFrom these assembled facts, we conclude that the most general operator of the form (12)\ntakes the schematic form\n!\nn\nm\nY\nY\nγ\ntr\n(URαi ZULβi Y3 ) (URj Y2 Y3 )\n(19)\ni=1\n\nor\n\nj=1\n\nm\nn\nY\nY\nγ\nδ\nβi\nαi\n(UR ZUL Y3 ) (URj ZULj V ǫj )\ntr\ni=1\n\nj=1\n\n!\n\n.\n\n(20)\n\nThese operators are understood to be totally symmetric in the SU(2) indices. The first\noperator transforms in a 2n + m + 1 dimensional representation of SU(2) while the second\ntransforms in a 2n + 3m + 1 dimensional representation.1\nAt this point, it is convenient to introduce some new notation for the building blocks\n(14):\nc1 = UR1 ZUL1 V 1\n1\n1\nb\n=\nU\nZU\nY\n1\n3\nR\nL\nc2 = UR1 ZUL1 V 2\na1 = UR1 Y2 Y3\n1\n2\n,\n,\n.\n(21)\nb\n=\nU\nZU\nY\n2\n3\nR\nL\na2 = UR2 Y2 Y3\nc3 = UR1 ZUL2 V 2\n2\n2\nb3 = UR ZUL Y3\nc4 = UR2 ZUL2 V 2\nFrom these nine operators, which we can treat as commuting, we can construct any\noperator of the form (19) or (20) subject to some relations. In particular, we know that the\nresulting operator must be totally symmetric in the SU(2) indices and moreover an a and\nc type operator annihilate to form two b operators (16). The set of twenty relations these\noperators satisfy is given in Appendix A.\nWe can find a set of monomials with identical algebraic properties. In particular, we let\n1\n\nIn the case M = 0, there is a superconformal symmetry and we can assign R-charges to these elements of\nthe chiral ring. The R-charge of (19) is 2n+m(RU +2RY ) while the R-charge of (20) is 2n+m(2RU +RZ +RV ).\nWe will recalculate these charges in the appendix directly from the metric.\n\n7\n\n\fx, y, z ∈ C and\nc1\nb1 = xy 2\n2\nc2\na1 = x y\n2 , b2 = xyz ,\nc3\na2 = x z\nb3 = xz 2\nc4\n\n= y3\n= y2z\n.\n= yz 2\n= z3\n\n(22)\n\nIn this way, the operators commute by construction and the number of x's labels whether\nthe operator is of type a, b, or c. The number of y's equals the number of SU(2) indices\nset to one while the number of z's equals the number of SU(2) indices set to two. In any\nproduct of the a, b, and c, the fact that the x, y, and z commute is equivalent to the fact\nthat the operator is totally symmetric in the SU(2) indices. Only slightly more difficult to\nsee is (16).\nBecause the ai , bj and ck commute, one can diagonalize all of these matrix valued operators simultaneously. Eigenvalue by eigenvalue, these operators describe a three dimensional\nvariety, parametrized above by x, y, z. This variety is the Calabi-Yau geometry we are interested in. The description of a general point in the moduli space is a set of N unordered\npoints of the Calabi-Yau geometry. We call this moduli space the mesonic branch of the\ntheory. That we have found a Calabi-Yau in this way is in line with the expectations of\nreverse geometric engineering [22].\nNow, treating x, y, and z as homogenous coordinates on P2 , this set of monomials can be\nreinterpreted as a set of linearly independent polynomials on P2 which vanish at the point\n(1, 0, 0) ∼ (λ, 0, 0) for λ ∈ C∗ . This set of monomials then provides a map from P2 → P8 with\nthe point (1, 0, 0) missing because the origin is not contained in P8 . The smallest surface\ncontaining the image of this map is well known to be the first del Pezzo, or P2 blown up at\na point.\n\n2.2\n\nThe First del Pezzo\n\nWe can be more precise in our description of this first del Pezzo. It is easy to embed P2\nblown up at a point inside P2 × P1 . Let x, y, and z be homogenous coordinates on the P2 ,\nas above, and let w1 and w2 be coordinates on the P1 . The first del Pezzo is described as\nthe hypersurface dP1 ⊂ P2 × P1 satisfying yw2 = zw1 .\nWe now construct a map from P2 × P1 to P11 by considering all monomials linear in the\nwi and quadratic in the x, y, and z. (Algebraic geometers would call this map a composition\nof the Segre and Veronese maps.)\nP2 × P1 −→ P11\n(x, y, z; w1, w2 ) 7−→ (x2 w1 , xyw1 , xzw1 , y 2w1 , yzw1 , z 2 w1 ,\nx2 w2 , xyw2 , xzw2 , y 2w2 , yzw2 , z 2 w2 )\n8\n\n\fThis map restricts to an injective map from dP1 to P8 by requiring yw2 = zw1 – of the twelve\nmonomials above, only nine are linearly independent under this relation.\nNow for a point on dP1 where y and z do not both vanish, the constraint yw2 = zw1\nfixes a point on the P1 which we can take to be w2 = z and w1 = y. In this case, the twelve\nmonomials in P11 reduce precisely to the nine monomials given as (22). Thus this dP1 ⊂ P8\ncertainly contains the image of the map described above from P2 → P8 .\nUsing the twelve monomials that depend on the wi , we can also describe the extra blown\nup P1 in dP1 . Consider the case y = 0 and z = 0. Now, the wi are unconstrained, and\nthe only two nonvanishing monomials in the P11 are x2 w1 and x2 w2 , which parametrize the\nblown up P1 .\nNaively, this description of the first del Pezzo seems overly complicated. For example,\nwe may just as easily consider the simpler Segre map to P5 :\nP2 × P1 −→ P5\n(x, y, z; w1, w2 ) 7−→ (xw1 , yw1, zw1 , xw2 , yw2, zw2 )\nSubject to the relation yw2 = zw1 we have a simpler embedding of the first del Pezzo\ninside P4 . However, we are not just describing the geometry of the Del-Pezzo surface, but\na particular algebraic cone over it, which results from blowing down the zero section of the\ntotal space of a line bundle over dP1 which makes the space a Calabi-Yau geometry.\n\n3\n\nD5-branes and Superconformal Fixed Points\n\nWe will now give a plausible argument that the field theory on a stack of D3-branes and D5branes probing a dP1 singularity does not have a superconformal fixed point in the infrared.\nThis absence helps rule out strong coupling behaviors in the IR field theory which are not\ngaugino condensation.\nA necessary condition for the presence of a superconformal fixed point in a gauge theory\nis the vanishing of the NSVZ beta functions and the requirement that the superpotential\nbe marginal. We will assume that there is an SU(2) global symmetry. As a result, the\nanomalous dimensions of the doublet fields will be equal, γV 1 = γV 2 and similarly for the UL\nand UR . Moreover, because of this SU(2), there will only be three independent superpotential\ncouplings.\nWe find it convenient to work with R-charges rather than with the anomalous dimensions\nγ. Recall that at a superconformal fixed point, the supersymmetry algebra implies that\n3R = 2 + γ.\n\n9\n\n\fFor the NSVZ beta functions to vanish, the following expressions must vanish:\nβ0 = 2N + (N + 3M)(RZ − 1) + (N + M)(RY1 − 1) + 2(N + 2M)(RUL − 1) ,\nβ1 = 2(N + M) + (N + 2M)(RY3 − 1) + 2(N + 2M)(RV − 1) +\nN(RY1 − 1) + 2(N + 3M)(RUR − 1) ,\nβ2 = 2(N + 2M) + (N + M)(RY3 − 1) + 2(N + M)(RV − 1) +\n(N + 3M)(RY2 − 1) + 2N(RUL − 1) ,\nβ3 = 2(N + 3M) + N(RZ − 1) + (N + 2M)(RY2 − 1) + 2(N + M)(RUR − 1) .\nMoreover, the superpotential couplings must be marginal, which implies that each of the bi\nhave R-charge two:\n2 = RUL + RY1 + RV\n2 = RUR + RY2 + RV ,\n2 = RZ + RUR + RY3 + RUL .\nThis set of seven equations is not linearly independent. In the case M = 0, there is a two\nparameter family of solutions. In the case M 6= 0, there is just a one parameter family.\nHowever, the existence of a family of solutions to these beta function constraints is not\nsufficient to guarantee the existence of a superconformal fixed point. From Intriligator and\nWecht [23], we know that at a superconformal fixed point, the conformal anomaly a ∼ TrR3\nshould be at a local maximum. Here, TrR3 is a trace over the R-charges of all of the fermions\nin the gauge theory. For the M = 0 case, it is indeed possible to maximize a over the two\nparameter family of solutions, and one can match the results to geometric expectations\n[9, 12, 13]. However, in the case M 6= 0, a cannot be maximized. If we let RV parametrize\nthe family of solutions to the beta function constraints, it is straightforward to see that\ntrR3 = 24(−19M 2 − 27MN − 9N 2 + (M + N)(2M + N)RV )\n\n(23)\n\nis a linear function in R.\nIn fact, one can see the pathology in the M 6= 0 case even before computing a. The\nR-charges of the ai , bj and ck operators of the previous section do not depend on RV . One\nfinds that Rck = 6 while Rai = −2. In other words, a finite fraction of operators in the chiral\nring – those with enough of the ai as building blocks – will have a conformal dimension below\nthe unitarity bound.\nSuch a pheonomenon has been encountered before studying simpler SQCD like gauge\ntheories [24, 25] where it was argued that accidental U(1) symmetries emerge in the infrared\nwhich decouple these troublesome operators from the theory once their dimension reaches the\nunitarity bound. However, in these simpler cases, there was a finite number of such operators\n10\n\n\fand there was also a well defined ultraviolet where the theory became asymptotically free.\nWe have an infinite number of troublesome operators, and truncating them from the theory\nwill radically change the geometry.\nA simpler and we believe more probable resolution to this pair of problems – an inability\nto maximize a and an infinite set of operators below the unitarity bound – is that the\ncorresponding superconformal fixed point does not exist.\nAt the beginning, we assumed an SU(2) symmetry. If we allow this SU(2) to be broken,\nwe can maximize a but there will still be an infinite number of operators with negative\nconformal dimension.\n\n4\n\nThe Quantum Moduli Space\n\nWe begin by analyzing the theory with no D3-branes and N D5-branes. Such a gauge theory\ncan be thought of as the last step in the Seiberg duality cascade, starting in the UV with a\nmultiple nN of D3-branes. Starting with the pure D5-brane theory precludes the possibility\nof a baryonic branch, a possibility we will return to later.\nThe pure D5-brane gauge theory has gauge group U(3N) × U(2N) × U(N) and classical\nsuperpotential\nW = UR2 Y2 V 1 − UR1 Y2 V 2 .\n(24)\nWe will keep the SU(2) global symmetry, and thus single loops involving the Y3 field cannot\nappear in the superpotential. Most aspects of our analysis are standard in the study of\nN = 1 supersymmetric gauge theories. See [26] for a selection of relevant reviews.\nFirst, we argue that confinement and gluino condensation occur at low energies in our\ngauge theory. Because these gauge groups are U(N), they will have three decoupled U(1)\nsubgroups, some of which allow the addition of Fayet-Iliopoulos (FI) terms.2 Suppose we\nadd an FI term κ for the U(1) ⊂ U(2N). For the purposes of this argument we take κ to\nbe large compared to other scales in the problem and temporarily ignore the superpotential.\nThe relevant piece of the classical Kähler potential for the gauge theory is\n(κ + V 1 (V 1 )† + V 2 (V 2 )† + Y3 Y3† − Y2 Y2† ) .\n2\n\n(25)\n\nAn FI term for the U (3N ) group is forbidden. When we write out the full matrix structure of the D-term\nequations, the D-term equation for the U (3N ) gauge group is of the form ζδji = (Y2 )ia (Y2† )aj − (URα† )im (URα )m\nj\nwith the Y2 field contracted on its U (2N ) indices and the UR fields contracted on their U (N ) indices. For\npositive (negative) ζ we may consider giving Y2 (UR ) an expectation value independent of the other field. But\nby applying gauge rotations to this field it is always possible to eliminate components of the field such that\nthe contracted form is diagonal and nonvanishing only on 2M of its 3M diagonal components, inconsistent\nwith the D-term equations.\n\n11\n\n\fFor negative κ we may give expectation values to V 1 and V 2 .\nNow, consider the D-term equation associated with the U(N) gauge group:\n(ζ + UR1 (UR1 )† + UR2 (UR2 )† − V 1 (V 1 )† − V 2 (V 2 )† − Y3 Y3† ) .\n\n(26)\n\nWe choose the FI term ζ = −2κ and set the expectation values of URα and Y2 , Y3 equal to\nzero.\nTurning now to the superpotential, we see that the large expectation values for the V α\ngive large masses to the URα and Y2 superfields, which we may then integrate out. But after\nintegrating out these fields, we see that the U(3N) group decouples from the other gauge\ngroups, and we know that pure U(3N) gauge theory with no flavors generically confines and\nthat the gauginos condense.\nAlthough we have carried out the analysis for large κ, we can now tune κ away to zero.\nSince confinement and chiral symmetry breaking are low energy phenomena controlled by\nF-terms, we expect their presence or absence to be independent of κ. Therefore we expect\nconfinement and chiral symmetry breaking for our triangle quiver gauge theory.\nThis analysis applies to the general point in the mesonic branch, with or without extra\nprobe D3-branes in the bulk. If we had additional branes in the bulk, confinement of the\nfractional brane stuck at the singularity should still happen. There is a lot of evidence that\nbranes in the bulk do not modify the essential dynamics of the fractional branes [27], although\nthe fractional branes do modify the dynamics of the branes in the bulk by deforming their\nmoduli space. In essence, the analysis of the fractional branes can be done without ever\nmentioning the branes in the bulk, but the result will be correct even if branes in the bulk\nare present. If gaugino condensation happens, we should expect to see a deformed moduli\nspace for the branes in the bulk: the quantum moduli space of the gauge theory.\nAn important point is that our SU(3N) × SU(2N) × SU(N) theory has no flat mesonic\ndirections. The F-term equations for the classical superpotential imply that URα Y2 = 0.\nThus, we cannot form any nonzero gauge invariant trace operators. There are some antisymmetrized products of fields, the dibaryon operators, for example\nB = ǫα1 ***α2N ǫβ1 ***βN ǫγ1 ***γN (Y3 )αβ11 * * * (Y3 )αβNN (V 1 )γα1N+1 * * * (V 1 )αγN2N .\n\n(27)\n\nBy turning on FI terms for the U(2N) and U(N) gauge groups, we can fix the expectation\nvalue of B.\n\n4.1\n\nSUSY Breaking for Strongly Coupled SU (3N )\n\nIgnoring the U(1) subgroups for the moment, note that the SU(3N) group is the only one\nof the three gauge groups to have Nf < Nc , so it is natural to suppose that it runs to strong\n12\n\n\fcoupling first. In this case we may construct the effective superpotential at low energies\nby standard arguments. Ignoring strong coupling effects from the other gauge groups, the\nquantum modified superpotential is [25]\n\u0012 7N \u00131/N\nΛ3\n2 1\n1 2\nW =M V −M V +N\n(28)\ndet M\nwhere we have defined the mesonic operators M α = URα Y2 and a square matrix M =\n(M 1 , M 2 ). At strong coupling we treat the mesons M as if they were fundamental fields.\nThe equation of motion for the V α sets M i = 0. However, the equation of motion for the\nM i tells us that\ni\nΛ7 minor(Mab\n)\n0 = ǫij Vabj − 3\n.\n(29)\n(N\n+1)/N\n(det M)\nThis equation is not consistent with setting the M i = 0 and we conclude that supersymmetry\nis broken.\nBecause the SU(3N) theory has the largest number of colors and smaller number of\nflavors, we generically expect SU(3N) to run to strong coupling first. It is possible that the\nother two groups run to strong coupling as well, which might invalidate the analysis done\nabove. In the next subsection an exact argument using the generalized Konishi anomaly\ndemonstrates that the SU(N), SU(2N), and SU(3N) groups cannot be strongly coupled at\nthe same time.\n\n4.2\n\nKonishi Anomaly Equations\n\nWe have argued that supersymmetry is broken when Λ3 is the dominant scale in the problem.\nAs the couplings become large, anomalous dimensions can also become large and in the\nabsence of a superconformal fixed point it is very difficult to control the RG flow. At generic\npoints in the space of coupling constants, the approximations made in section 4.1 may be\ninvalid and it is not clear whether supersymmetry will be broken.\nTo make a stronger argument we need a better method to determine the possible quantum\nmodifications to W . A technique that we will find very powerful is based on the Konishi\nanomaly [18]; see also the review of Amati et al [26] and the more recent developments of\n[28]. Some of this analysis can be rephrased in terms of the language of the Dijkgraaf-Vafa\nmatrix model approach [29], which is a useful way of encoding the same set of quantum\nmodified equations of motion. These matrix models and Konishi anomaly calculations can\nencode the (quantum) deformations of complex structure of the Calabi-Yau space [27].\nThe generalized Konishi anomaly equations are derived by considering infinitesimal variations of the fields, which leave the path integral invariant, and obtaining the associated Ward\nidentities, restricted to the chiral ring. For a variation of the bifundamental X → X + δX\n13\n\n\fwhere we take δX = f (X, Wα W α ) and Wα is the supersymmetric gauge field strength, one\nfinds\n*\n\u0015\u001b j +\n\u001a\n\u0014\n1 X\n∂f\n−\n= htr(f (X, Wα W α )∂X W )i .\n(30)\nWα , W α ,\n32π 2 i,j\n∂Xij i\n\nThe particular gauge group under which W α transforms is fixed by gauge invariance, which\nin practice corresponds to whether W α appears on the left or right side of f . Inside a\ntrace, we have the convenient result that tr(φ[Wα W α , X]) = 0, where φ is some arbitrary\ncombination of bifundamentals. It is also useful to recall that {Wα , Wβ } = 0 in the chiral\nring.\nLet us consider the Konishi equations for δX = X. On varying the fields appearing in\nthe superpotential, we find that\ntr(UR1 Y2 V 2 ) = NS3 + 3NS1 = 3NS2 + 2NS3 ,\ntr(UR2 Y2 V 1 ) = −NS3 − 3NS1 = −3NS2 − 2NS3 ,\n\n(31)\n\ntr(UR2 Y2 V 1 ) − tr(UR1 Y2 V 2 ) = −2NS1 − NS2 .\nwhere we have defined Sk = −trk Wα W α /32π 2 , and the trace is over the gauge group with\nrank kN. There is an additional anomaly equation from varying Y3 , which does not appear\nin the superpotential:\n2NS1 + NS2 = 0.\n(32)\nThese equations taken collectively give relations amongst the Sk , and it is easy to verify that\nthey have no solution other than the trivial one, with all the Sk = 0. The anomaly equations\nrequire that the infrared gauge theory does not undergo gaugino condensation. However,\nthis is inconsistent with the D-term arguments given earlier, which implied that some of the\nSk have to be non-zero. Our anomaly arguments assumed supersymmetry, so we conclude\nthat supersymmetry must be broken (or that the vacuum of the theory is in some other way\nill-defined.)\nThe inability to satisfy these constraints is reminiscent of the geometric obstruction to\ndeformation discovered by Altmann [7] (see Appendix A for a brief review). The cone over\ndP1 can be expressed in terms of twenty (dependent) equations in nine variables. It is possible to deform these equations by a parameter ǫ, but one finds that mutual consistency\nof the deformed equations requires that ǫ2 vanishes. If ǫ were not obstructed, we would\nidentify this deformation of the geometry with the quantum deformed moduli space of the\nmesonic branch: gaugino condensation leads to a quantum modified chiral ring, and we have\nalready described in the previous section how the chiral ring and the Calabi-Yau geometry\nare related. Our analysis suggests a strong relation between the geometry of the Calabi-Yau\nspace and spontaneous SUSY breaking. We correlate the geometric deformation obstruc14\n\n\ftion to inconsistencies of the quantum modified chiral ring. Thus the name SUSY-BOG:\nsupersymmetry breaking by obstructed geometries.\nFor completeness let us consider another set of anomaly equations, which we obtain from\nthe variations δX = X Wα W α . The anomaly equations for the URα and the V β give\n1\ntr(Wα W α UR1 Y2 V 2 ) = −S1 S3 = −S1 S2 ,\n32π 2\n1\ntr(Wα W α UR2 Y2 V 1 ) = S1 S3 = S1 S2 ,\n−\n32π 2\n\n−\n\n(33)\n\nwhile for the Y2 , we find\n−\n\n1\n32π 2\n\ntr(Wα W α UR2 Y2 V 1 ) − tr(Wα W α UR1 Y2 V 2 )\n\nA similar equation for Y3 yields\nS1 S2 = 0 .\n\n\u0001\n\n= S2 S3 ,\n\n(34)\n\n(35)\n\nbecause Y3 does not appear in the superpotential.\nTaking these quadratic relations for the Sk on their own, we would conclude that two\nof the Sk are zero. Furthermore, if only one of the gauge groups has a nonzero Sk , we can\nassume for that particular gauge group Nf < Nc . The only reasonable possibility is S3 6= 0\n– but we have already shown that if the SU(3N) group flows to strong coupling first, then\nsupersymmetry should be broken.\n\n4.3\n\nThe Baryonic Branch\n\nAll our analysis so far has concerned the pure D5-brane theory, but as argued before, this\nanalysis extends to the case where there are branes in the bulk: what happens at the\nsingularity is independent of the branes in the bulk and supersymmetry is broken on the\nmesonic branch of the general theory.\nHowever, there are other baryonic branches in moduli space which we have not analyzed\nyet. For our quiver theory, we can halt our Seiberg duality cascade one step up from the\nbottom, at the SU(4N) × SU(3N) × SU(2N) × SU(N ) theory. If the group with the largest\nnumber of colors SU(4N) runs to strong coupling first, we have effectively Nf = Nc SQCD\nwith a tree level superpotential. As was noticed in [16], such a theory will have a quantum\nmodified superpotential. In addition to the mesonic branch, there is a branch of moduli\nspace where baryonic operators get expectation values.\nWe will argue that supersymmetry is broken even if we give these baryonic operators\nexpectation values. To to try to gain a deeper understanding of the various possibilities, it is\nuseful to review what happens in the case of the conifold. One step up from the bottom of the\n15\n\n\fduality cascade on the conifold, we have an SU(2N) × SU(N) theory with bifundamentals\nAi and Bi , i = 1, 2 and a quartic superpotential\nWtree = ǫij ǫkl Ai Bk Aj Bl\n\n(36)\n\nAt strong coupling for the SU(2N) group, we form the mesonic operators Mij = Ai Bj , and\nthe superpotential is modified by quantum effects [30]\nWef f = Wtree + X(det M + BB̃ − Λ2N ) .\n\n(37)\n\nOn the baryonic branch, hBB̃i = Λ2N while the mesonic expectation values and the Lagrange\nmultiplier X vanish. One may obtain a low-energy effective theory on this branch by integrating out the mesons, leaving us with a pure SU(N) gauge theory supplemented by the\nbaryonic operators B, B̃, which lie on a flat direction.\nThe Klebanov-Strassler supergravity solution corresponds to the symmetric point B = B̃\non the baryonic branch [21, 31]. A one real parameter family of supersymmetric supergravity\nsolutions corresponding to changing |B| was worked out by [19]. The remarkable fact about\nthis one parameter family of solutions is that it does not involve a Calabi-Yau manifold.\nInstead, it requires only a manifold with SU(3) structure.\nThe Altmann theorem mentioned in the introduction states only that the Calabi-Yau\ncone over dP1 has no complex structure deformations. If we relax the Calabi-Yau condition\nto an SU(3) structure condition, there may still be supersymmetric supergravity solutions,\nas there are for more general points on the baryonic branch of the conifold theory.\nWe now exclude the possibility of an SU(3) structure solution. Returning to the fournode quiver theory with gauge group SU(4N) × SU(3N) × SU(2N) × SU(N), with the\nSU(4N) group at strong coupling, we argue that although this theory has a baryonic branch\nthe Konishi anomaly arguments still imply that supersymmetry is broken. The first step is to\nreplace the elementary fields charged under the SU(4N) gauge group by mesons and baryons\nwhich are SU(4N) singlets. Specifically, we construct mesons MYα = URα Y2 and MZα = URα Z,\nwhich have their SU(4N) indices contracted, and baryons B = [UR1 * * * UR1 UR2 * * * UR2 ] and B̃ =\n[Y2 * * * Y2 Z * * * Z], whose SU(4N) indices are fully antisymmetrized. This theory develops a\nquantum-modified superpotential of the form (37) and has a baryonic branch, along which\nthe baryons acquire expectation values. On this branch one also finds that the Lagrange\nmultiplier X and det M vanish.\nWhat happens to the remaining mesons? The mesons MZ appear only in a cubic term in\nthe tree-level superpotential, so they remain as light fields in the theory. On the other hand,\nthe mesons MY have a mass term from the tree-level superpotential of the form V α MYβ ǫαβ\nand we may integrate these fields out. The F-terms for the mesons MY force V α = 0, while\nthe F-terms from varying V α require MYα = Y1 ULα . By applying gauge rotations to the Y1\n16\n\n\fand UL fields one can see that the determinant of the meson matrix vanishes, and that the\nF-term equations are therefore satisfied consistently on this branch.\nAfter integrating out these massive fields, and relabeling the light fields, one finds that the\nresulting low-energy effective theory is precisely that of the three-node quiver, supplemented\nby the baryonic operators. However, the baryons do not communicate with the SU(3N) ×\nSU(2N) × SU(N) degrees of freedom. This baryonic flat direction cannot interfere with the\narguments for supersymmetry breaking given in section 4.\nProbe D3-branes\nThe preceding argument about supersymmetry breaking along the baryonic branch was not\nas strong as the Konishi anomaly arguments about the mesonic branch. For example, we\nwere not able to analyze the possibility that both the SU(3N) and SU(4N) groups ran to\nstrong coupling at once. Hedging our bets, we will assume for the moment the existence of\na supersymmetry preserving baryonic branch for the dP1 theory and a corresponding SU(3)\nstructure supergravity solution.\nWe may ask what happens to probe D3-branes in this putative supersymmetric vacuum.\nAfter all, for generic initial numbers of D3- and D5-branes in the UV, the duality cascade will\ngenerically leave some left over D3-branes in the bulk. In the Klebanov-Strassler solution,\nthese extra D3-branes were supersymmetric, but what happens at an arbitrary point on the\nbaryonic branch?\nAway from the KS point, these probe D3-branes in the conifold should break supersymmetry. The authors of [19] claim that this baryonic branch supergravity solution for\nthe conifold interpolates between the KS and the Maldacena-Nunez (MN) [32] supergravity\nsolutions. Moreover, for MN, D3-brane probes break supersymmetry.\nLet us describe more explicitly these supersymmetry conditions for D3-brane probes. Let\nǫ be a Killing spinor in the ten dimensional geometry. The presence of N = 1 supersymmetry\nin four dimensions guarantees the existence of at least a four dimensional representation of\nsuch spinors. For a probe D3-brane to be supersymmetric, ǫ must be an eigenspinor of the\ncorresponding κ-symmetry matrix for the probe: Γκ ǫ = ǫ. For a D3-brane aligned in the\ngauge theory directions, x, y, z, and t, the κ-symmetry matrix is just the four dimensional\ngamma matrix\nΓκ = iΓt Γx Γy Γz .\n(38)\nIn other words, ǫ must have positive chirality in the four gauge theory directions.\nThe Killing spinors in the [20] SU(3) structure solutions take the general form\nǫ = αζ+ ⊗ η+ + βζ− ⊗ η− ,\n\n17\n\n(39)\n\n\fwhere ζ± are the chiral and anti-chiral four dimensional spinors, and η± are chiral and antichiral six dimensional spinors. The α and β are complex functions of coordinates on the\nsix-dimensional transverse geometry. In the KS solution, β = 0, and so Γκ ǫ = ǫ, while\nfor the MN solution, β = −iα∗ , and the D3-brane breaks supersymmetry. Indeed, for any\nnonzero value of β, the D3-brane will break supersymmetry.\nUsing the table of possible SU(3) structure solutions in [20], we can make a stronger,\nmore general statement. If the D3-brane preserves supersymmetry, then β = 0. If β = 0, the\nsix dimensional transverse geometry must be Calabi-Yau. However, Altmann claims there is\nno Calabi-Yau deformation of the cone over dP1 . Therefore, if there is an SU(3) structure\nsolution corresponding to the baryonic branch of this dP1 field theory, probe D3-branes will\nbreak supersymmetry.\n\n5\n\nOutlook\n\nWe have shown, using a combination of traditional field theory and supergravity arguments,\nthat generically supersymmetry is spontaneously broken at low energies in the duality cascade constructed from the cone over dP1 . Traditional field theory convinced us that the\nmesonic branch must break supersymmetry. Although there is a small possibility that the\nbaryonic branch remains supersymmetric, for generic initial numbers of D3- and D5-branes,\nthere will be extra D3-branes at the bottom of the cascade which we argued should also lead\nto supersymmetry breaking.\nThis mechanism for supersymmetry breaking by obstructed geometries, or SUSY-BOG,\nshould work more generally. We start with some Calabi-Yau cone to which we add D3and D5-branes. Generically, a duality cascade will result, where the number of D3-branes\nis gradually reduced as we move toward the tip of the cone. When we reach the bottom of\nthe cascade, we expect to find a confining theory and presumably confinement will happen\nvia gaugino condensation. In such a situation, we expect a deformed chiral ring and hence\na deformed complex structure of the geometry.3 The unifying feature of the SUSY-BOG\nmechanism is an obstruction in the complex deformation space of the Calabi-Yau cone. Our\nconjecture is that in all of these situations supersymmetry will be spontaneously broken.\nThe cone over dP1 is not alone in having such an obstruction. For example, we expect to be\nable to set up a duality cascade using the Y p,q space [16], but there is such an obstruction\nfor all the Y p,q , p > q > 0.\nFor the higher del Pezzos dPn , 1 < n < 9, there will also generically be a problem. We\nexpect to be able to set up a duality cascade. For the general dPn there are n vanishing two3\n\nSee [33] for more examples of unobstructed deformations where the endpoint of the cascade is either a\nconfining theory or a superconformal fixed point.\n\n18\n\n\fcycles and thus n types of D5-branes. However, in general there are fewer than n complex\nstructure deformations [34]. For example, for dP2 , there is only one such deformation. Thus,\nunless the initial numbers of D5-branes are chosen carefully, we expect SUSY-BOG to occur\nat low energies, at the end of the duality cascade.\nWhile we were finishing this paper, [35] appeared. The authors claim to find a first\norder complex structure deformation of the cone over dP1 and construct from this first order\ndeformation the analog of the KS solution [1] for dP1 . This construction is completely\ncompatible with our story. We anticipate, from [7], that they will not be able to continue\ntheir deformation to higher order in ǫ. It would be very interesting, but presumably quite\ndifficult, to construct a non-supersymmetric gravity solution for the deformed cone.\nNote Added After this work was completed, we became aware of the closely related\npapers [36, 37] which reach similar conclusions.\n\nAcknowledgments\nWe would like to thank Marcus Berg, Aaron Bergman, Henriette Elvang, Michael Haack,\nIgor Klebanov, Matt Strassler, and Brian Wecht for useful discussions and comments. P.O.\nthanks the University of Washington Particle Theory Group for hospitality while this work\nwas being completed. The work of D. B. and S. P is supported in part by DOE grant\nDE-FG02-91ER40618. The research of C. P. H. is supported in part by the NSF under\nGrant No. PHY99-07949. The work of P. O. is supported in part by the DOE under grant\nDOE91-ER-40618 and by the NSF under grant PHY00-98395.\n\nA\n\nRelations for the first del Pezzo\n\nThe twenty relations among the ai , bj , and ck for the first del Pezzo are\nb22 = a1 c3\nb22 = b1 b3\nb22 = a2 c2\nc23 = c2 c4\nb21 = a1 c1\nb23 = a2 c4\nb1 c3 = b2 c2 b1 c4 = b2 c3 b2 c3 = b3 c2\na1 b2 = a2 b1 a1 b3 = a2 b2 b2 c2 = b3 c1\na1 c4 = b2 b3 c1 c4 = c2 c3 a2 c1 = b1 b2\n\nc22 = c1 c3\nb1 c2 = b2 c1\nb2 c4 = b3 c3\na1 c2 = b1 b2\na2 c3 = b2 b3\n\n(40)\n\nBecause the cone over dP1 is a toric variety, there is an easy way to summarize these\nrelations. Given a set of vectors fi which generate the lattice inside the dual toric cone σ ∨ ,\nthe set of relations among the coordinate ring is easily summarized as the set of integer\n\n19\n\n\fz3\nx z2\n\nyz2\n\nx 2z\n\nx yz\n\ny2z\n\nx 2y\n\nx y2\n\ny3\n\nFigure 2: The lattice points which generate the dual cone for P2 blown up at a point.\nvalued vectors m\n~ I such that\nX\n\nfi miI = 0 .\n\n(41)\n\ni\n\nFor the first del Pezzo, we can read off twenty such relations from Figure 2:\nAltmann claims [7] that the one dimensional space of complex structure deformations is\nobstructed at second order. One can modify the above twenty equations by adding ǫ:\nb2 (b2 − 2ǫ) = a1 c3\nc23 = c2 c4\nb1 c3 = (b2 − ǫ)c2\na1 (b2 − 3ǫ) = a2 b1\na1 c4 = b2 b3\n\nb2 (b2 − 3ǫ) = b1 b3\nb21 = a1 c1\nb1 c4 = (b2 − ǫ)c3\na1 b3 = a2 b2\nc1 c4 = c2 c3\n\nb2 (b2 − 4ǫ) = a2 c2\nb23 = a2 c4\n(b2 − 2ǫ)c3 = b3 c2\n(b2 − 2ǫ)c2 = b3 c1\na2 c1 = b1 (b2 − 3ǫ)\n\nc22 = c1 c3\nb1 c2 = (b2 − ǫ)c1\n(b2 − 2ǫ)c4 = b3 c3\na1 c2 = b1 (b2 − ǫ)\na2 c3 = (b2 − 2ǫ)b3\n\n(42)\n\nHowever, for consistency, ǫ2 = 0.\n\nB\n\nGauge Theories and Chiral Rings for the Y p,q\n\nIn studying the chiral ring for dP1 , we found it was easy to generalize to the more complicated\nquivers dual to the Y p,q spaces. We include these results in this appendix.\nIn this section, we review the construction of the Y p,q gauge theories. As derived in [13],\nthe quivers for these Y p,q gauge theories can be constructed from two basic units, σ and τ .\nThese units are shown in Figure 3. To construct a general quiver for Y p,q , we define some\nbasic operations with σ and τ . First, there are the inverted unit cells, σ̃ and τ̃ , which are\nmirror images of σ and τ through a horizontal plane. To glue the cells together, we identify\nthe double arrows corresponding to the U α fields on two unit cells. The arrows have to be\n20\n\n\fb)\n\na)\n\nY\n\nY\n\nU\n\nY\n\nU\n\nU\n\nU\n\nV\n\nc)\n\nZ\nZ\n\nY\n\nY\nU\n\nU\n\nU\n\nV\n\nY\n\nY\n\nU\n\nU\n\nY\nY\n\nV\n\nY\n\nV\n\nFigure 3: Shown are a) the unit cell σ; b) the unit cell τ ; and c) the quiver for Y 4,3 , στ̃ σσ̃.\npointing in the same direction for the identification to work. So for instance we may form\nthe quiver στ̃ = τ̃ σ, but στ is not allowed. In this notation, the first unit cell is to be glued\nnot only to the cell on the right but also to the last cell in the chain. A general quiver might\nlook like\nσσ̃στ̃ τ σ̃ .\n(43)\nIn general, a Y p,q quiver consists of p unit cells of which q are of type σ. The Y p,p−1 gauge\ntheories will have only one τ type unit cell, while the Y p,1 theories will have only one σ type\nunit cell.\nEach node of the quiver corresponds to a gauge group while each arrow is a chiral field\ntransforming in a bifundamental representation. For the Y p,q spaces, there are four types of\nbifundamentals labeled U α , V α , Y , and Z where α = 1 or 2. To get a conformal theory, we\ntake all the gauge groups to be SU(N).\nThe superpotential for this quiver theory is constructed by summing over gauge invariant\noperators cubic and quartic in the fields U α , V α , Y , and Z. For each σ unit cell in the gauge\ntheory, we add two cubic terms to the superpotential of the form\nǫαβ ULα V β Y and ǫαβ URα Y V β .\n\n(44)\n\nHere, the indices R and L specify which group of U α enter in the superpotential, the U α on\n21\n\n\fthe right side or the left side of σ. The trace over the color indices has been suppressed. For\neach τ unit cell, we add the quartic term\nǫαβ ULα Y URβ Z .\n\n(45)\n\nThe signs should be chosen so that no phases appear in the relations.\n\nB.1\n\nChiral Primaries for General Y p,q\n\nThe quivers for general Y p,q are quite complicated, but some easy patterns emerge. We\nalways expect to find the b1 , b2 , and b3 type building blocks, for these operators are just the\nindependent superpotential type loops transforming in a three dimensional representation\nof SU(2). At the superconformal point, the R-charges of the bi are clearly all equal to two.\nThe ai and ci type operators also have analogs for general p and q.\nFor the ai , it turns out there exists a loop in the quiver with p Y type fields and p − q\ntype U fields. Such a loop naturally transforms in a p − q + 1 dimensional representation of\nSU(2) and has an R-charge\nRa = pRY + (p − q)RU .\n(46)\nFor the ci , there is a loop with p type U operators, q type V operators and p − q type Z\noperators. Such a loop transforms in a p + q + 1 dimensional representation of SU(2) and\nhas R-charge\nRc = pRU + qRV + (p − q)RZ .\n(47)\nNote that (46) and (47) are consistent with the R-charges given for Ra and Rc in footnote 1.\nOne can also see the a, b, and c type operators emerge from the toric diagram for the\ncones over the Y p,q . Recall [9] that the toric cone is given by the four vectors:\ne1 = (1, 0, 0) ;\n\ne2 = (1, 1, 0) ;\n\ne3 = (1, p, p) ;\n\ne4 = (1, p − q − 1, p − q) .\n\n(48)\n\nThe dual cone σ ∨ must then be bounded by the vectors orthogonal to the faces of σ:\ne∨1 = (0, 0, −1) ;\n\ne∨2 = (−p, p, −p + 1) ;\n\ne∨3 = (−p, −q, q + 1) ;\n\ne∨4 = (0, −p + q, p − q − 1) .\n(49)\n\nWe now study σ ∨ . Notice that e∨1 and e∨4 lie along the line x = 0 and z = −y − 1. This\nline will thus include p − q + 1 lattice points, and we tentatively identify these points with\nthe ai . Similarly, e∨2 and e∨3 lie along the line x = −p and z = −y + 1. This line includes\np + q + 1 lattice points, and we identify these points with the ci .\nFinally, consider the three lattice points (−1, 0, 0), (−1, 1, −1) and (−1, −1, 1). These\nthree points would be good candidates for the bi – the points would lead to expected relations\n22\n\n\fz\n\ny\n\nFigure 4: The dual cone σ ∨ for Y 5,1 . The a type operators correspond to lattice points\nalong the red line, the b type operators to lattice points along the green line, and the c type\noperators to lattice points along the blue line.\n\n23\n\n\fof the form ac ∼ bp . Note that (−1, 1, −1) lies on the plane spanned by e∨1 and e∨2 :\n\nand similarly\n\n1\n(−1, 1, −1) = (e∨1 + e∨2 ) ,\np\n\n(50)\n\n1\n(−1, −1, 1) = (e∨3 + e∨4 ) .\np\n\n(51)\n\nThus these three lattice points do indeed lie inside σ ∨ .\nThese three sets of lattice points ai , bi , and ci span the cone σ ∨ . More precisely, we\nexpect that for any lattice point p inside σ ∨ ,\nX\nX\nX\np=\nli ai +\nmi bi +\nni ci\n(52)\n\nfor li , mi and ni non-negative integers.\n\nC\n\nFrom the Metric to the Chiral Ring\n\nIn this section, we will relate the ai , bj , and ck building blocks of the chiral ring directly to\nthe metric coordinates on the Calabi-Yau cone. It turns out that it is just as easy to work\nout the relationship for all the Y p,q at once.\nWe choose coordinates on Y p,q such that the Sasaki-Einstein metric takes the form [10, 11]\n\u0001\n1−y\n1\ndθ2 + sin2 θdφ2 +\ndy 2\n6\nw(y)v(y)\nv(y)\n(dψ − cos θdφ)2 + w(y) (dα + f (y)(dψ − cos θdφ))2\n+\n9\n\nds2 =\n\n(53)\n\nwith the three functions f (y), v(y), w(y) given by\nb − y2\n1−y\nb − 3y 2 + 2y 3\nv(y) =\nb − y2\nb − 2y + y 2\nf (y) =\n.\n6(b − y 2 )\n\nw(y) = 2\n\n(54)\n(55)\n(56)\n\nFor the metric to be complete,\nb=\n\n1 p2 − 3q 2 p 2\n−\n4p − 3q 2 .\n2\n4p3\n24\n\n(57)\n\n\fThe coordinate y is allowed to range between the two smaller roots of the cubic b − 3y 2 + 2y 3:\n\u0011\np\n1 \u0010\ny1 =\n(58)\n2p − 3q − 4p2 − 3q 2 ,\n4p\n\u0011\np\n1 \u0010\n2\n2\ny2 =\n2p + 3q − 4p − 3q\n.\n(59)\n4p\n\nThe period of α is 2πl where\n\nl=−\n\nq\n4p2 y\n\n1 y2\n\n.\n\n(60)\n\nThe remaining coordinates are allowed the following ranges: 0 ≤ θ < π, 0 ≤ φ < 2π, and\n0 ≤ ψ < 2π.\nIn these coordinates the scalar Laplacian is\n∇2 =\n\nC.1\n\n6\n∂\n6\n1 ∂\n1 ∂2\nsin θ\n+\n1 − y sin θ ∂θ\n∂θ 1 − y sin2 θ ∂φ2\n\u0013 2\n\u0012\n∂\n6\n6\n1 ∂\n∂\n1\n9\n−\n+\n+\nvw(1 − y)\n+\n2\n2\nv 1 − y 1 − y sin θ ∂ψ\n1 − y ∂y\n∂y\n\u0013 2\n\u0012 2\n2\n2\n∂\n1\n12 cos θ ∂\n18f ∂\n9f\n+\n+\n−\n.\n+\n2\n2\nv\nw ∂α\n1 − y sin θ ∂φ∂ψ\nv ∂α∂ψ\n\n(61)\n\nChiral Primary Solutions\n\nThe Laplacian on the cone dr 2 + r 2 ds2 over Y p,q can be written as\n\u0003=\n\n1\n1 ∂ 3∂\nr\n+ 2 ∇2 .\n5\nr ∂r ∂r r\n\n(62)\n\nThis cone is a Kaehler manifold and \u0003 = 2(∂∂ † + ∂ † ∂). Thus any holomorphic function\nshould satisfy the Laplace equation, \u0003ω = 0. These holomorphic functions are our chiral\nprimary operators.\nMartelli and Sparks [9] provide three meromorphic functions on the cone over Y p,q :\nz1 = eiφ tan\n\nθ\n2\n\n(63)\n3\n\n−6iα−iψ\n\nz2 = e\nz3\n\n2 Y\n− 1\n(y − yi ) 2yi\nsin θ i=1\n\n3\nY\n1 3 iψ\n=\nr e sin θ (y − yi )1/2 .\n2\ni=1\n\n(64)\n(65)\n\nOne can check that away from their singularities, these zi satisfy \u0003zi = 0. Of these three\nfunctions, z3 is also holomorphic. The function z1 has a singularity at θ = π, while z2 has\n25\n\n\fsingularities at θ = 0, θ = π, and y = y2 . (Recall that y1 < 0.) The function z2 has the\nadditional pathology of not being periodic under shifts α → α + 2πl.\nUsing these three zi , we would like to assemble a family of better behaved holomorphic\nfunctions on the cone. For this family, we assume the ansatz\n−a/6 n−a/6\nz3\n\nFmna (zi ) = z1m z2\n\n(66)\n\n= r 3n−a/2 eimφ einψ eiaα sinn+m\nwhere\nei =\n\nθ\nθ\ncosn−m\n2\n2\n\n3\nY\n\n(y − yi )ei\n\ni=1\n\n1\n(a(1 − yi ) + 6nyi ) .\n12yi\n\n(67)\n\nTo be free of singularities in θ, we must take −n ≤ m ≤ n. To be free of singularities in\ny, we have the two conditions ei ≥ 0 for i = 1, 2. We also have a number of periodicity\nconstraints. For periodicity in α, we need a = P/l where P is an integer. We will assume\nthat φ is periodic under shifts by 2π and that φ + ψ is periodic under shifts by 4π. These\nconstraints then imply that m and n are either both integer or both half-integer.\nOne easy set of holomorphic functions can be found by setting a = 0. We find\n3\n\nb1 = z3 z1−1 = r 3 ei(ψ−φ) cos2\n\nθY\n(y − yi )1/2\n2 i=1\n\n(68)\n\n3\n\nb2 = z3 = r 3 eiψ sin\n\nθ\nθY\n(y − yi )1/2\ncos\n2\n2 i=1\n\n(69)\n\n3\n\n3 i(ψ+φ)\n\nb3 = z3 z1 = r e\n\nθY\nsin\n(y − yi )1/2\n2 i=1\n2\n\n(70)\n\nwhere we have identified these objects with the holomorphic monomials of the previous\nsection. Superficially, b1 seems not to be single valued at θ = 0 while b3 would not be single\nvalued at θ = π. In fact, at these poles, the metric on Y p,q degenerates such that the good\nangular coordinate at θ = 0 is no longer ψ but ψ − φ and at θ = π, ψ + φ.\nTo find the other holomorphic functions, we explore the boundaries of the singularity\nconditions on y. In particular, consider the limit ei = 0. In the case i = 1, we find that\na=−\n\n6ny1\n;\n1 − y1\n\ne2 =\n\nnp\n.\nq+p\n\n(71)\n\nThe periodicity condition on α implies that\nn=\n\nq+p\nP .\n2\n26\n\n(72)\n\n\fChoosing the smallest nontrivial value P = 1 that avoids a singularity at y = y2 , we find\nthat e2 = p/2. These operators take the form\nc im =\n\nz1m r ∆ ei(p+q)ψ/2+iα/l\n\nwhere the R-charge\n\nand\n\n\u0012\n\nθ\nθ\nsin cos\n2\n2\n\n\u0013(p+q)/2\n\n(y − y2 )p/2 (y − y3 )e3 ,\n\n(73)\n\n2\n2y2\nR= ∆=p\n,\n3\ny2 − y1\n\n(74)\n\n\u0012\n\u0013\nq+p\ny1 (1 − y3 )\ne3 =\n1−\n.\n4\ny3 (1 − y1 )\n\n(75)\n\nWe have labelled these operators to suggest the relationship to the ci of the previous section.\nThese operators fill out a q + p + 1 dimensional representation of SU(2).\nNext consider the limit e2 = 0, in which case\na=−\n\n6ny2\n;\n1 − y2\n\ne1 =\n\nnp\n.\np−q\n\n(76)\n\nPeriodicity on α now implies that\nn=−\n\np−q\nP .\n2\n\n(77)\n\nChoosing the smallest nontrivial value of P = −1 that avoids a singularity, we find that\ne1 = p/2. These operators take the form\naim =\n\nz1m r ∆ ei(p−q)ψ/2−iα/l\n\nwhere the R-charge\n\nand\n\n\u0012\n\u0013(p−q)/2\nθ\nθ\nsin cos\n(y − y1 )p/2 (y − y3 )e3 ,\n2\n2\n\n2\n2y1\nR = ∆ = −p\n,\n3\ny2 − y1\np−q\ne3 =\n4\n\n\u0012\n\u0013\ny2 (1 − y3 )\n1−\n.\ny3 (1 − y2 )\n\n(78)\n\n(79)\n\n(80)\n\nThese operators fill out a p − q + 1 dimensional representation of SU(2) like the ai of the\nprevious section.\nUsing for example the table in [13], one may easily check that the R-charges computed\nfrom these holomorphic functions agrees with the R-charges computed from field theory. In\nother words, (79) agrees with (46) and (74) is eqal to (47).\n\n27\n\n\fWe now check that these aj and cj are indeed single valued at y = y2 and y\nrespectively. From the metric, we see that at y = yi , the good angular coordinate\nlonger α but\n1 yi − 1\nα + f (yi )ψ = α +\nψ.\n6 yi\nCorrespondingly, the exponent for the aj can be written\n\u0012\n\u0013\np−q\n(q − p)l\n1\n1\nα+\nψ− α=−\nψ\n2\nl\nl\n2\n\n= y1\nis no\n(81)\n\n(82)\n\nand it is not difficult to check that\n(q − p)l\ny2 − 1\n=\n.\n2\n6y2\n\n(83)\n\nFor the cj , we find that\n1\n1\np+q\nψ+ α=\n2\nl\nl\nand\n\n\u0012\n\u0013\n(p + q)l\nα+\nψ\n2\n\n(p + q)l\ny1 − 1\n=\n.\n2\n6y1\n\n(84)\n\n(85)\n\nReferences\n[1] I. R. Klebanov and M. J. Strassler, \"Supergravity and a confining gauge theory: Duality cascades and chiSB-resolution of naked singularities,\" JHEP 0008, 052 (2000)\n[arXiv:hep-th/0007191].\n[2] R. Gopakumar and C. Vafa, \"On the gauge theory/geometry correspondence,\" Adv.\nTheor. Math. Phys. 3, 1415 (1999) [arXiv:hep-th/9811131].\n[3] S. Kachru, R. Kallosh, A. Linde and S. P. Trivedi, \"De Sitter vacua in string theory,\"\nPhys. Rev. D 68, 046005 (2003) [arXiv:hep-th/0301240].\n[4] I. R. Klebanov and E. Witten, \"Superconformal field theory on threebranes at a CalabiYau singularity,\" Nucl. Phys. B 536, 199 (1998) [arXiv:hep-th/9807080].\n[5] D. R. Morrison and M. R. Plesser, \"Non-spherical horizons. I,\" Adv. Theor. Math. Phys.\n3, 1 (1999) [arXiv:hep-th/9810201].\n[6] A. Kehagias, \"New type IIB vacua and their F-theory interpretation,\" Phys. Lett. B\n435, 337 (1998) [arXiv:hep-th/9805131].\n28\n\n\f[7] K. Altmann, \"The versal Deformation of an isolated toric Gorenstein Singularity,\"\narXiv:alg-geom/9403004.\n[8] B. Feng, A. Hanany and Y. H. He, \"D-brane gauge theories from toric singularities and\ntoric duality,\" Nucl. Phys. B 595, 165 (2001) [arXiv:hep-th/0003085].\n[9] D. Martelli and J. Sparks, \"Toric geometry, Sasaki-Einstein manifolds and a new infinite\nclass of AdS/CFT duals,\" arXiv:hep-th/0411238.\n[10] J. P. Gauntlett, D. Martelli, J. Sparks and D. Waldram, \"Supersymmetric AdS(5)\nsolutions of M-theory,\" Class. Quant. Grav. 21, 4335 (2004) [arXiv:hep-th/0402153].\n[11] J. P. Gauntlett, D. Martelli, J. Sparks and D. Waldram, \"Sasaki-Einstein metrics on\nS(2) x S(3),\" arXiv:hep-th/0403002.\n[12] M. Bertolini, F. Bigazzi and A. L. Cotrone, \"New checks and subtleties for AdS/CFT\nand a-maximization,\" arXiv:hep-th/0411249.\n[13] S. Benvenuti, S. Franco, A. Hanany, D. Martelli and J. Sparks, \"An infinite family of superconformal quiver gauge theories with Sasaki-Einstein duals,\" arXiv:hep-th/0411264.\n[14] S. Franco, A. Hanany, Y. H. He and P. Kazakopoulos, \"Duality walls, duality trees and\nfractional branes,\" arXiv:hep-th/0306092.\n[15] S. Franco, Y. H. He, C. Herzog and J. Walcher, \"Chaotic duality in string theory,\"\nPhys. Rev. D 70, 046006 (2004) [arXiv:hep-th/0402120];\n\"Chaotic Cascades for D-branes on Singularities,\" proceedings of the Cargese Summer\nSchool 2004, [arXiv:hep-th/0412207].\n[16] C. P. Herzog, Q. J. Ejaz and I. R. Klebanov, \"Cascading RG flows from new SasakiEinstein manifolds,\" arXiv:hep-th/0412193.\n[17] I. R. Klebanov and A. A. Tseytlin, \"Gravity duals of supersymmetric SU(N) x SU(N+M)\ngauge theories,\" Nucl. Phys. B 578, 123 (2000) [arXiv:hep-th/0002159].\n[18] K. Konishi, \"Anomalous Supersymmetry Transformation Of Some Composite Operators\nIn Sqcd,\" Phys. Lett. B 135, 439 (1984).\n[19] A. Butti, M. Grana, R. Minasian, M. Petrini and A. Zaffaroni, \"The Baryonic Branch\nof Klebanov-Strassler Solution: a Supersymmetric Family of SU(3) Structure Backgrounds,\" arXiv:hep-th/0412187.\n\n29\n\n\f[20] M. Grana, R. Minasian, M. Petrini and A. Tomasiello, \"Supersymmetric\nbackgrounds from generalized Calabi-Yau manifolds,\" JHEP 0408, 046 (2004)\n[arXiv:hep-th/0406137].\n[21] S. S. Gubser, C. P. Herzog and I. R. Klebanov, \"Symmetry breaking and axionic strings\nin the warped deformed conifold,\" JHEP 0409, 036 (2004) [arXiv:hep-th/0405282];\n\"Variations on the warped deformed conifold,\" arXiv:hep-th/0409186.\n[22] D. Berenstein, \"Reverse geometric engineering of singularities,\" JHEP 0204, 052 (2002)\n[arXiv:hep-th/0201093].\n[23] K. Intriligator and B. Wecht, \"The exact superconformal R-symmetry maximizes a,\"\nNucl. Phys. B 667, 183 (2003) [arXiv:hep-th/0304128].\n[24] D. Kutasov, A. Parnachev and D. A. Sahakyan, \"Central charges and U(1)R symmetries\nin N = 1 super Yang-Mills,\" JHEP 0311, 013 (2003) [arXiv:hep-th/0308071].\n[25] N. Seiberg, \"Electric - magnetic duality in supersymmetric nonAbelian gauge theories,\"\nNucl. Phys. B 435, 129 (1995) [arXiv:hep-th/9411149].\n[26] D. Amati, K. Konishi, Y. Meurice, G. C. Rossi and G. Veneziano, \"Nonperturbative\nAspects In Supersymmetric Gauge Theories,\" Phys. Rept. 162, 169 (1988);\nK. A. Intriligator and N. Seiberg, \"Lectures on supersymmetric gauge theories and electric-magnetic duality,\" Nucl. Phys. Proc. Suppl. 45BC, 1 (1996)\n[arXiv:hep-th/9509066];\nM. A. Shifman, \"Nonperturbative dynamics in supersymmetric gauge theories,\" Prog.\nPart. Nucl. Phys. 39, 1 (1997) [arXiv:hep-th/9704114].\n[27] D. Berenstein, \"Quantum moduli spaces from matrix models,\" Phys. Lett. B 552, 255\n(2003) [arXiv:hep-th/0210183];\nD. Berenstein, \"Solving matrix models using holomorphy,\" JHEP 0306, 019 (2003)\n[arXiv:hep-th/0303033];\nD. Berenstein, \"D-brane realizations of runaway behavior and moduli stabilization,\"\narXiv:hep-th/0303230.\n[28] F. Cachazo, M. R. Douglas, N. Seiberg and E. Witten, \"Chiral rings and anomalies in\nsupersymmetric gauge theory,\" JHEP 0212, 071 (2002) [arXiv:hep-th/0211170].\n[29] R. Dijkgraaf and C. Vafa, \"Matrix models, topological strings, and supersymmetric\ngauge theories,\" Nucl. Phys. B 644, 3 (2002) [arXiv:hep-th/0206255];\nR. Dijkgraaf and C. Vafa, \"On geometry and matrix models,\" Nucl. Phys. B 644, 21\n(2002) [arXiv:hep-th/0207106];\n30\n\n\fR. Dijkgraaf and C. Vafa, \"A perturbative window into non-perturbative physics,\"\narXiv:hep-th/0208048.\n[30] N. Seiberg, \"Exact results on the space of vacua of four-dimensional SUSY gauge theories,\" Phys. Rev. D 49, 6857 (1994) [arXiv:hep-th/9402044].\n[31] O. Aharony, \"A note on the holographic interpretation of string theory backgrounds\nwith varying flux,\" JHEP 0103, 012 (2001) [arXiv:hep-th/0101013].\n[32] J. M. Maldacena and C. Nunez, \"Towards the large N limit of pure N = 1 super Yang\nMills,\" Phys. Rev. Lett. 86, 588 (2001) [arXiv:hep-th/0008001].\n[33] S. Franco, A. Hanany and A. M. Uranga, \"Multi-flux warped throats and cascading\ngauge theories,\" arXiv:hep-th/0502113;\nJ. F. G. Cascales, F. Saad and A. M. Uranga, \"Holographic dual of the standard model\non the throat,\" arXiv:hep-th/0503079.\n[34] F. Cachazo, B. Fiol, K. A. Intriligator, S. Katz and C. Vafa, \"A geometric unification\nof dualities,\" Nucl. Phys. B 628, 3 (2002) [arXiv:hep-th/0110028];\n[35] B. A. Burrington, J. T. Liu, M. Mahato and L. A. P. Zayas, \"Towards supergravity duals of chiral symmetry breaking in Sasaki-Einstein cascading quiver theories,\"\narXiv:hep-th/0504155.\n[36] S. Franco, A. Hanany, F. Saad and A. M. Uranga, \"Fractional Branes and Dynamical\nSupersymmetry Breaking,\" arXiv:hep-th/0505040.\n[37] M. Bertolini, F. Bigazzi and A. L. Cotrone, \"Supersymmetry breaking at the end of a\ncascade of Seiberg dualities,\" arXiv:hep-th/0505055.\n\n31\n\n\f"}