{"id": "http://arxiv.org/abs/hep-ph/0301195v1", "guidislink": true, "updated": "2003-01-22T18:45:48Z", "updated_parsed": [2003, 1, 22, 18, 45, 48, 2, 22, 0], "published": "2003-01-22T18:45:48Z", "published_parsed": [2003, 1, 22, 18, 45, 48, 2, 22, 0], "title": "Multiple Parton Scattering in Nuclei: Beyond Helicity Amplitude\n  Approximation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0301012%2Chep-ph%2F0301189%2Chep-ph%2F0301131%2Chep-ph%2F0301100%2Chep-ph%2F0301064%2Chep-ph%2F0301230%2Chep-ph%2F0301043%2Chep-ph%2F0301088%2Chep-ph%2F0301146%2Chep-ph%2F0301027%2Chep-ph%2F0301272%2Chep-ph%2F0301162%2Chep-ph%2F0301216%2Chep-ph%2F0301157%2Chep-ph%2F0301105%2Chep-ph%2F0301147%2Chep-ph%2F0301195%2Chep-ph%2F0301243%2Chep-ph%2F0301114%2Chep-ph%2F0301118%2Chep-ph%2F0301209%2Chep-ph%2F0301045%2Chep-ph%2F0301185%2Chep-ph%2F0301080%2Chep-ph%2F0301021%2Chep-ph%2F0301086%2Chep-ph%2F0301159%2Chep-ph%2F0301144%2Chep-ph%2F0301127%2Chep-ph%2F0301013%2Chep-ph%2F0301182%2Chep-ph%2F0301039%2Chep-ph%2F0301032%2Chep-ph%2F0301215%2Chep-ph%2F0301206%2Chep-ph%2F0301059%2Chep-ph%2F0301225%2Chep-ph%2F0301276%2Chep-ph%2F0301202%2Chep-ph%2F0301250%2Chep-ph%2F0301278%2Chep-ph%2F0301172%2Chep-ph%2F0301253%2Chep-ph%2F0301140%2Chep-ph%2F0301196%2Chep-ph%2F0301073%2Chep-ph%2F0301070%2Chep-ph%2F0301148%2Chep-ph%2F0301258%2Chep-ph%2F0301142%2Chep-ph%2F0301252%2Chep-ph%2F0301053%2Chep-ph%2F0301001%2Chep-ph%2F0301044%2Chep-ph%2F0301060%2Chep-ph%2F0301193%2Chep-ph%2F0301267%2Chep-ph%2F0301173%2Chep-ph%2F0301028%2Chep-ph%2F0301030%2Chep-ph%2F0301222%2Chep-ph%2F0301101%2Chep-ph%2F0301197%2Chep-ph%2F0301087%2Chep-ph%2F0301122%2Chep-ph%2F0301116%2Chep-ph%2F0301280%2Chep-ph%2F0301061%2Chep-ph%2F0301019%2Chep-ph%2F0301163%2Chep-ph%2F0301266%2Chep-ph%2F0301110%2Chep-ph%2F0301035%2Chep-ph%2F0301199%2Chep-ph%2F0301205%2Chep-ph%2F0301082%2Chep-ph%2F0301135%2Chep-ph%2F0306108%2Chep-ph%2F0306033%2Chep-ph%2F0306205%2Chep-ph%2F0306114%2Chep-ph%2F0306003%2Chep-ph%2F0306021%2Chep-ph%2F0306213%2Chep-ph%2F0306062%2Chep-ph%2F0306299%2Chep-ph%2F0306234%2Chep-ph%2F0306208%2Chep-ph%2F0306042%2Chep-ph%2F0306280%2Chep-ph%2F0306309%2Chep-ph%2F0306014%2Chep-ph%2F0306284%2Chep-ph%2F0306180%2Chep-ph%2F0306250%2Chep-ph%2F0306149%2Chep-ph%2F0306058%2Chep-ph%2F0306290%2Chep-ph%2F0306113%2Chep-ph%2F0306015%2Chep-ph%2F0306110&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multiple Parton Scattering in Nuclei: Beyond Helicity Amplitude\n  Approximation"}, "summary": "Multiple parton scattering and induced parton energy loss in deeply inelastic\nscattering (DIS) off heavy nuclei is studied within the framework of\ngeneralized factorization in perturbative QCD with a complete calculation\nbeyond the helicity amplitude (or soft bremsstrahlung) approximation. Such a\ncalculation gives rise to new corrections to the modified quark fragmentation\nfunctions. The effective parton energy loss is found to be reduced by a factor\nof 5/6 from the result of helicity amplitude approximation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0301012%2Chep-ph%2F0301189%2Chep-ph%2F0301131%2Chep-ph%2F0301100%2Chep-ph%2F0301064%2Chep-ph%2F0301230%2Chep-ph%2F0301043%2Chep-ph%2F0301088%2Chep-ph%2F0301146%2Chep-ph%2F0301027%2Chep-ph%2F0301272%2Chep-ph%2F0301162%2Chep-ph%2F0301216%2Chep-ph%2F0301157%2Chep-ph%2F0301105%2Chep-ph%2F0301147%2Chep-ph%2F0301195%2Chep-ph%2F0301243%2Chep-ph%2F0301114%2Chep-ph%2F0301118%2Chep-ph%2F0301209%2Chep-ph%2F0301045%2Chep-ph%2F0301185%2Chep-ph%2F0301080%2Chep-ph%2F0301021%2Chep-ph%2F0301086%2Chep-ph%2F0301159%2Chep-ph%2F0301144%2Chep-ph%2F0301127%2Chep-ph%2F0301013%2Chep-ph%2F0301182%2Chep-ph%2F0301039%2Chep-ph%2F0301032%2Chep-ph%2F0301215%2Chep-ph%2F0301206%2Chep-ph%2F0301059%2Chep-ph%2F0301225%2Chep-ph%2F0301276%2Chep-ph%2F0301202%2Chep-ph%2F0301250%2Chep-ph%2F0301278%2Chep-ph%2F0301172%2Chep-ph%2F0301253%2Chep-ph%2F0301140%2Chep-ph%2F0301196%2Chep-ph%2F0301073%2Chep-ph%2F0301070%2Chep-ph%2F0301148%2Chep-ph%2F0301258%2Chep-ph%2F0301142%2Chep-ph%2F0301252%2Chep-ph%2F0301053%2Chep-ph%2F0301001%2Chep-ph%2F0301044%2Chep-ph%2F0301060%2Chep-ph%2F0301193%2Chep-ph%2F0301267%2Chep-ph%2F0301173%2Chep-ph%2F0301028%2Chep-ph%2F0301030%2Chep-ph%2F0301222%2Chep-ph%2F0301101%2Chep-ph%2F0301197%2Chep-ph%2F0301087%2Chep-ph%2F0301122%2Chep-ph%2F0301116%2Chep-ph%2F0301280%2Chep-ph%2F0301061%2Chep-ph%2F0301019%2Chep-ph%2F0301163%2Chep-ph%2F0301266%2Chep-ph%2F0301110%2Chep-ph%2F0301035%2Chep-ph%2F0301199%2Chep-ph%2F0301205%2Chep-ph%2F0301082%2Chep-ph%2F0301135%2Chep-ph%2F0306108%2Chep-ph%2F0306033%2Chep-ph%2F0306205%2Chep-ph%2F0306114%2Chep-ph%2F0306003%2Chep-ph%2F0306021%2Chep-ph%2F0306213%2Chep-ph%2F0306062%2Chep-ph%2F0306299%2Chep-ph%2F0306234%2Chep-ph%2F0306208%2Chep-ph%2F0306042%2Chep-ph%2F0306280%2Chep-ph%2F0306309%2Chep-ph%2F0306014%2Chep-ph%2F0306284%2Chep-ph%2F0306180%2Chep-ph%2F0306250%2Chep-ph%2F0306149%2Chep-ph%2F0306058%2Chep-ph%2F0306290%2Chep-ph%2F0306113%2Chep-ph%2F0306015%2Chep-ph%2F0306110&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multiple parton scattering and induced parton energy loss in deeply inelastic\nscattering (DIS) off heavy nuclei is studied within the framework of\ngeneralized factorization in perturbative QCD with a complete calculation\nbeyond the helicity amplitude (or soft bremsstrahlung) approximation. Such a\ncalculation gives rise to new corrections to the modified quark fragmentation\nfunctions. The effective parton energy loss is found to be reduced by a factor\nof 5/6 from the result of helicity amplitude approximation."}, "authors": ["Ben-Wei Zhang", "Xin-Nian Wang"], "author_detail": {"name": "Xin-Nian Wang"}, "author": "Xin-Nian Wang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0375-9474(03)01003-0", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0301195v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0301195v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 14 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0301195v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0301195v1", "journal_reference": "Nucl.Phys.A720:429-451,2003", "doi": "10.1016/S0375-9474(03)01003-0", "fulltext": "Multiple Parton Scattering in Nuclei: Beyond Helicity Amplitude\nApproximation\nBen-Wei Zhanga and Xin-Nian Wangb,c\na\n\narXiv:hep-ph/0301195v1 22 Jan 2003\n\nInstitute of Particle Physics, Huazhong Normal University, Wuhan 430079, China\nb\nNuclear Science Division, MS 70R0319, Lawrence Berkeley National Laboratory, Berkeley, CA 94720 USA\nc\nDepartment of Physics, Shandong University, Jinan 250100, China\nMultiple parton scattering and induced parton energy loss in deeply inelastic scattering (DIS) off heavy nuclei is studied within the framework of generalized factorization in perturbative QCD with a complete calculation beyond the helicity amplitude\n(or soft bremsstrahlung) approximation. Such a calculation gives rise to new corrections to the modified quark fragmentation functions. The effective parton energy\nloss is found to be reduced by a factor of 5/6 from the result of helicity amplitude\napproximation.\n\nI. INTRODUCTION\n\nSuppression of jet production or jet quenching in high-energy nuclear collisions has been proposed\nas a good probe of the hot and dense medium [1,2] that is produced during the violent collisions.\nThe quenching of an energetic parton is caused by multiple scattering and induced parton energy\nloss during its propagation through the hot QCD medium. It suppresses the final leading hadron\ndistribution giving rise to modified fragmentation functions and the final hadron spectra [3,4]. Recent\ntheoretical estimates [5–9] all show that the effective parton energy loss is proportional to the\ngluon density of the medium. Therefore measurements of the parton energy loss will enable one to\nextract the initial gluon density of the produced hot medium. Strong suppression of high transverse\nmomentum hadron spectra is indeed observed by experiments [10,11] at the Relativistic Heavy-Ion\nCollider (RHIC) at the Brookhaven National Laboratory (BNL), indicating large parton energy\nloss in a medium with large initial gluon density. However, one cannot unambiguously extract the\ninitial gluon density from the experiments of heavy-ion collisions alone because of the theoretical\nuncertainty in relating the parton energy loss to the initial gluon density. For this purpose, one has\nto rely on other complimentary experimental measurements such as parton energy loss in deeply\ninelastic scattering (DIS) of nuclear targets. One can then at least extract the initial gluon density\nin heavy-ion collisions relative to that in a cold nucleus [12].\nModified quark fragmentation function inside a nucleus in DIS and the effective parton energy\nloss has been derived recently by Guo and Wang [13]. Generalized factorization of twist-four processes [14] was applied to the inclusive process of jet fragmentation in DIS in order to derive the\nmodified fragmentation functions. Taking into account of gluon bremsstrahlung induced by multiple\nparton scattering and the Landau-Pomeranchuck-Migdal (LPM) interference effect, one finds that\nthe leading twist-four contributions to the modified fragmentation function and the effective parton\nenergy loss depend quadratically on the nuclear size RA . They also depend linearly on the effective\ngluon distribution in nuclei. One can also extend the study to parton propagation inside a hot QCD\nmedium reproducing earlier results [12]. This allows one to relate parton energy loss in both hot\n\n1\n\n\fand cold nuclear medium.\nThere are all together 23 cut-diagrams that contribute to the leading twist-four corrections to the\nquark fragmentation function in eA DIS. For simplification of the calculation, the helicity amplitude\napproximation was used in Ref. [13] in the limit of soft gluon radiation zg = 1 − z → 0 where zg\n\nis the momentum fraction carried by the radiated gluon and z the fraction carried by the leading\nquark. Such an approximation enables one to simplify the calculation of the radiation amplitudes.\nThe final results are obtained by squaring the sum of all possible amplitudes, giving rise not only\nto the contributions of double scattering but also various interferences. In this approximation, the\namplitudes of initial and final state radiation are the same except the opposite signs and different\ncolor matrices. Because of the different color matrices in the initial and final state radiation, there is\nno complete cancellation of the radiation amplitudes. In addition, there is also gluon radiation from\nthe exchanged gluon via triple-gluon coupling. These non-Abelian features of QCD radiation lead\nto a finite gluon spectra even in the helicity amplitude approximation. However, under the same\napproximation, the photon spectra from QED bremsstrahlung would be zero because of almost\ncomplete cancellation between initial and final state radiation. One therefore has to go beyond\nthe helicity approximation. In this paper, we will study the correction to the gluon radiation\nspectra when we go beyond the helicity amplitude approximation and its effect in the modified\nquark fragmentation function. We will also compute the effective quark energy loss and compare to\nthe result in the helicity amplitude approximation.\n\nII. GENERALIZED FACTORIZATION\n\nIn order to study the quark fragmentation in eA DIS, we consider the following semi-inclusive\nprocesses, e(L1 ) + A(p) −→ e(L2 ) + h(lh ) + X, where L1 and L2 are the four momenta of the\n\nincoming and the outgoing leptons, and lh is the observed hadron momentum. The differential cross\nsection for the semi-inclusive process can be expressed as\nEL2 Elh\n\nh\nα2EM 1\ndW μν\ndσDIS\n=\nL\nE\n,\nμν\nl\nh\nd3 L2 d3 lh\n2πs Q4\nd3 lh\n\n(1)\n\nwhere p = [p+ , 0, 0⊥ ] is the momentum per nucleon in the nucleus, q = L2 − L1 = [−Q2 /2q − , q − , 0⊥ ]\nthe momentum transfer, s = (p + L1 )2 and αEM is the electromagnetic (EM) coupling constant. The\n\nleptonic tensor is given by Lμν = 1/2 Tr(γ * L1 γμ γ * L2 γν ) while the semi-inclusive hadronic tensor\nis defined as,\n\nElh\n\ndWμν\n1X\n=\nhA|Jμ (0)|X, hihX, h|Jν (0)|Ai\n3\nd lh\n2\nX\n\n× 2πδ 4 (q + p − pX − lh )\n\nwhere\n\nP\n\nX\n\nruns over all possible final states and Jμ =\n\nP\n\nq\n\n(2)\n\neq ψ̄q γμ ψq is the hadronic EM current.\n\nIn the parton model with collinear factorization approximation, the leading-twist contribution\nto the semi-inclusive cross section can be factorized into a product of parton distributions, parton\nfragmentation functions and the partonic cross section. Including all leading log radiative corrections,\nthe lowest order contribution (O(α0s )) from a single hard γ ∗ + q scattering can be written as\n2\n\n\fS\nX\ndWμν\n=\ne2q\ndzh\nq\n(0)\nHμν\n(x, p, q) =\n\nZ\n\n(0)\ndxfqA (x, μ2I )Hμν\n(x, p, q)Dq→h (zh , μ2 ) ;\n\n2π\n1\nTr(γ * pγμ γ * (q + xp)γν )\nδ(x − xB ) ,\n2\n2p * q\n\n(3)\n(4)\n\n−\n2\n+ −\nwhere the momentum fraction carried by the hadron is defined as zh = l−\nh /q and xB = Q /2p q\n\nis the Bjorken variable. μ2I and μ2 are the factorization scales for the initial quark distributions\nfqA (x, μ2I ) in a nucleus and the fragmentation functions Dq→h (zh , μ2 ), respectively. The renormalized\nquark fragmentation function Dq→h (zh , μ2 ) satisfies the Dokshitzer-Gribov-Lipatov-Altarelli-Parisi\n(DGLAP) QCD evolution equations [16].\nIn a nuclear medium, the propagating quark in DIS will experience additional scatterings with\nother partons from the nucleus. The rescatterings may induce additional gluon radiation and cause\nthe leading quark to lose energy. Such induced gluon radiations will effectively give rise to additional\nterms in the evolution equation leading to the modification of the fragmentation functions in a\nmedium. These are so-called higher-twist corrections since they involve higher-twist parton matrix\nelements and are power-suppressed. We will consider those contributions that involve two-parton\ncorrelations from two different nucleons inside the nucleus. They are proportional to the size of the\nnucleus [17] and thus are enhanced by a nuclear factor A1/3 as compared to two-parton correlations\nin a nucleon. Like in previous studies [13], we will neglect those contributions that are not enhanced\nby the nuclear medium.\n\nq\n\nq\n\nl\n\nlq\n\nx3p+kT\n\nxp\n0\n\nx2p+kT\ny2\n\ny1\n\nx1p\ny\n\nAp\n\nAp\nL\n\nC\n\nR\n\nFIG. 1. A typical diagram for quark-gluon re-scattering processes with three possible cuts, central(C),\nleft(L) and right(R).\n\nWe will employ the generalized factorization of multiple scattering processes [14]. In this approximation, the double scattering contribution to radiative correction from processes like the one\nillustrated in Fig. 1 can be written in the following form,\nZ\nD\nX Z 1 dz\ndWμν\ndy − − − 1\n=\nDq→h (zh /z)\ndy1 dy2 hA|ψ̄q (0) γ + Fσ+ (y2− ) F +σ (y1− ) ψq (y − )|Ai\ndzh\nz\n2π\n2\nz\nh\nq\n#\n\u0013\"\n\u0012\n∂2\n1\n1 αβ\nD\n− − −\n× − g\nH (y , y1 , y2 , kT , p, q, z)\n,\n(5)\n2\n2 ∂kTα ∂kTβ μν\nkT =0\n\nafter collinear expansion of the hard partonic cross section with respect to the transverse momentum\nD\n\nof the initial partons, where H μν (y − , y1− , y2− , kT , p, q, z) is the Fourier transform of the partonic hard\ne μν (x, x1 , x2 , kT , p, q, z) in momentum space,\npart H\n3\n\n\fD\nH μν (y − , y1− , y2− , kT , p, q, z)\n\n=\n\nZ\n\ndx\n\ndx1 dx2 ix1 p+ y− +ix2 p+ y− +i(x−x1 −x2 )p+ y−\n1\n2\ne\n2π 2π\n\nD\ne μν\n×H\n(x, x1 , x2 , kT , p, q, z) ,\n\n(6)\n\nand kT is the relative transverse momentum carried by the second parton in the double scattering.\nThis is the leading term in the collinear expansion that contributes to the double scattering process.\nThe first term in the collinear expansion gives the eikonal contribution to the leading-twist results,\nmaking the matrix element in the single scattering process gauge invariant, while the second (or\nlinear) term vanishes for unpolarized initial and final states after integration over kT .\ne μν (x, x1 , x2 , kT , p, q, z), always conThe hard part of the partonic scattering for each diagram, H\ntains two δ-functions from the on-shell conditions of the two cut-propagators. These δ-functions,\n\ntogether with the contour integrations which contain different sets of poles in the un-cut propagators, will determine the values of the momentum fractions x, x1 , and x2 [13]. The phase factors\nD\n\nin H μν (y − , y1− , y2− , kT , p, q, z) [Eq. (6)] can then be factored out, which will be combined with the\npartonic fields in Eq. (5) to form twist-four partonic matrix elements or two-parton correlations. The\ndouble scattering corrections in Eq. (5) can then be factorized into the product of fragmentation\nfunctions, twist-four partonic matrix elements and the partonic hard scattering cross section.\nIII. BEYOND HELICITY AMPLITUDE APPROXIMATION\n\nTo simplify the calculation of various cut-diagrams of double scattering and illustrate the underlying physical processes, helicity amplitude approximation was used in Ref. [13]. In this approximation,\none neglects the transverse recoil induced by the scattering and consider only the part of the amplitudes in which quarks' helicity is unchanged in the scattering. The final results will agree with the\ncomplete calculation in the limit of soft radiation.\nTake photon bremsstrahlung for example. A complete calculation of photon radiation induced by\na single scattering with transverse momentum transfer kT gives a spectra\nα\ndN\n=\ndl2T dz\n2π\n\n\"\n\n~lT\n~lT + (1 − z)~kT\n−\n2\nlT\n(~lT + (1 − z)~kT )2\n\n#2\n\n1 + z2\n.\n1−z\n\n(7)\n\nHere we denote the momentum of the photon (or gluon in QCD) to be l which carries 1 − z momen-\n\ntum fraction of the struck quark. Under helicity amplitude approximation, the splitting function\nwill become 2/(1 − z) and furthermore the term (1 − z)kT in the final state radiation amplitude\n\nwill be neglected. The interference between initial and final state radiation will effectively reduce\nthe photon radiation spectrum to zero, apparently not a precise approximation. In QCD, the corresponding gluon radiation has similar amplitudes, except additional color matrices. Because the gluon\nexchange in the scattering transfers color, the emitted gluon in the initial and final state radiation\ncan carry different colors. In this case, there is no complete destructive interference between initial\nand final state radiation as in QED. The helicity amplitude approximation is, therefore, a better\napproximation in QCD than in QED. However, it still neglects the corrections which contribute the\nmost in photon radiation in QED. This finite correction is what we will study in this paper.\n\n4\n\n\fWe first consider the contribution from Fig. 1 in detail and will list the results of other diagrams\nafterwards. Using the conventional Feynman rule, one can write down the hard partonic part of the\ncentral cut-diagram of Fig. 1 [13],\nZ\n\nZ\ndx1 dx2 ix1 p+ y− +ix2 p+ y− +i(x−x1 −x2 )p+ y−\nd4 l\n1\n2\ne\n2π 2π\n(2π)4\ni\nh\n−\n1\nb σρ γν 2πδ+ (l2 ) δ(1 − z − l ) .\n× Tr p * γγμ pσ pρ H\n2\nq−\n\nD\n\nH C μν (y − , y1− , y2− , kT , p, q, z) =\n\ndx\n\nb σρ = CF g 4 γ * (q + x1 p) γα γ * (q + x1 p − l) γσ γ * lq γρ\nH\n2Nc (q + x1 p)2 − iǫ\n(q + x1 p − l)2 − iǫ\nγ * (q + xp)\nγ * (q + xp − l)\nγβ\n2πδ+ (l2q ) ,\n× εαβ (l)\n2\n(q + xp − l) + iǫ\n(q + xp)2 + iǫ\n\n(8)\n\n(9)\n\nwhere εαβ (l) is the polarization tensor of a gluon propagator in an axial gauge, n * A = 0 with\nn = [1, 0− , ~0⊥ ], and l, lq = q + (x1 + x2 )p + kT − l are the 4-momenta carried by the gluon and\n−\nthe final quark, respectively. z = l−\nq /q is the fraction of longitudinal momentum (the large minus\n\ncomponent) carried by the final quark.\nTo simplify the calculation, we also apply the collinear approximation to complete the trace of\nthe product of γ-matrices,\nb σρ pρ ≈ γ * lq\npσ H\n\ni\nh\n1\n− σ b\nρ\n.\n− Tr γ p Hσρ p\n4lq\n\n(10)\n\nAfter carrying out momentum integration in x, x1 , x2 and l± with the help of contour integration\nand δ-functions, the partonic hard part can be factorized into the production of γ-quark scattering\nD\n\n(0)\n\nmatrix Hμν (x, p, q) [Eq. (4)] and the quark-gluon rescattering part H ,\nZ\nD\nD\n(0)\nH μν (y − , y1− , y2− , kT , p, q, z) = dxHμν\n(x, p, q) H (y − , y1− , y2− , kT , x, p, q, z) .\n\n(11)\n\nContributions from all the diagrams have this factorized from. Therefore, we will only list the\nrescattering part H\n\nD\n\nfor different diagrams in the following. For the central-cut diagram in Fig. 1\n\nit reads [13],\nD\nH C(F ig.1) (y − , y1− , y2− , kT , x, p, q, z)\n\nZ\n\n1 + z2\ndl2T αs\nC\nF\nl2T 2π\n1−z\n2παs\n×\nI C(F ig.1) (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n=\n\n+ −\n\nI C(F ig.1) (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\ny +ixD p+ (y1− −y2− )\n+ −\ny2\n\n× (1 − e−ixL p\n\n(12)\n\nθ(−y2− )θ(y − − y1− )\n+\n\n)(1 − e−ixL p\n\n(y − −y1− )\n\n).\n\n(13)\n\nHere, the fractional momentum is defined as\nxL =\n\nl2T\n+\n−\n2p q z(1\n\n− z)\n\n, xD =\n\nand x = xB = Q2 /2p+ q − is the Bjorken variable.\n\n5\n\nkT2 − 2~kT * ~lT\n,\n2p+ q − z\n\n(14)\n\n\fThe above contribution resembles the cross section of dipole scattering and contains essentially\nfour terms. The first diagonal term corresponds to the so-called hard-soft process where the gluon\nradiation is induced by the hard scattering between the virtual photon and an initial quark with\nmomentum fraction x. The quark is knocked off-shell by the virtual photon and becomes on-shell\nagain after radiating a gluon. Afterwards the on-shell quark (or the radiated gluon) will have a\nsecondary scattering with another soft gluon from the nucleus. The second diagonal term is due to\nthe so-called double hard process where the quark is on-shell after the first hard scattering with the\nvirtual photon. The gluon radiation is then induced by the scattering of the quark with another gluon\nthat carries finite momentum fraction xL + xD . The other two off-diagonal terms are interferences\nbetween hard-soft and double hard processes. In the limit of collinear radiation (xL → 0) or when\n\nthe formation time of the gluon radiation, τf ≡ 1/xL p+ , is much larger than the nuclear size, the\ntwo processes have destructive interference, leading to the LPM interference effect.\nD\n\nOne can similarly obtain the rescattering part H of other central-cut diagrams (a-d) in Fig. 2:\nZ\nαs\n1 + z2\ndl2T\nD\n− − −\nCA\nH C(a) (y , y1 , y2 , kT , x, p, q, z) =\n1−z\n(l~T − k~T )2 2π\n2παs\n×\nI C(a) (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\ny +ixD p+ (y1− −y2− )\n\nI C(a) (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\n+ −\ny2 /(1−z)\n\n× [eixD p\n\n+\n\n× [eixD p\n\n(y\n\n−\n\nZ\n\n+ −\ny2\n\n− e−ixL p\n\n−y1− )/(1−z)\n\n]\n+\n\n− e−ixL p\n\n(y − −y1− )\n\n],\n\n(15)\n\ndl2T\n\nαs\n1 + z2\nCF\n1−z\n(l~T − (1 − z)k~T )2 2π\n2παs\nI C(b) (y − , y1− , y2− , lT , kT , x, p, q, z) ,\n×\nNc\n\nD\n\nH C(b) (y − , y1− , y2− , kT , x, p, q, z) =\n\n+ −\n\nI C(b) (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n+\n\n× e−ixL p\nD\nH C(c) (y − , y1− , y2− , kT , x, p, q, z)\n\nθ(−y2− )θ(y − − y1− )\n\n=\n×\n\nZ\n\ny +ixD p+ (y1− −y2− )\n\n(y − −y1− ) −ixL p+ y2−\n\ne\n\ny +ixD p+ (y1− −y2− )\n\n+ −\ny2\n\n× e−ixL p\n\n+\n\n× [eixD p\n\n×\n\n(16)\n\n2παs\nI C(c) (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nD\n\n,\n\n(l~T − k~T ) * (l~T − (1 − z)k~T ) αs CA 1 + z 2\n(l~T − k~T )2 (l~T − (1 − z)k~T )2 2π 2 1 − z\n\ndl2T\n\nI C(c) (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\nH C(d) (y − , y1− , y2− , kT , x, p, q, z) =\n\nθ(−y2− )θ(y − − y1− )\n\nZ\n\n(y − −y1− )/(1−z)\n\nθ(−y2− )θ(y − − y1− )\n+\n\n− e−ixL p\n\n(y − −y1− )\n\n],\n\n(17)\n\n(l~T − k~T ) * (l~T − (1 − z)k~T ) αs CA 1 + z 2\n(l~T − k~T )2 (l~T − (1 − z)k~T )2 2π 2 1 − z\n\ndl2T\n\n2παs\nI C(d) (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nI C(d) (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n+\n\n× e−ixL p\n\ny +ixD p+ (y1− −y2− )\n\n(y − −y1− )\n\n+ −\ny2 /(1−z)\n\n× [eixD p\n\n6\n\nθ(−y2− )θ(y − − y1− )\n\n+ −\ny2\n\n− e−ixL p\n\n].\n\n(18)\n\n\fTo complete the calculation we also have to consider the asymmetrical-cut diagrams(left cut and\nright cut) that represent interferences between single and triple scatterings. They can be obtained\nwith similar procedures. We list the rescattering part H\n\nD\n\nof all those asymmetrical-cut diagrams\n\nin the Appendix.\nTo obtain the double scattering contribution to the semi-inclusive processes of hadron production\nD\n\nin Eq. (5), one will then have to calculate the second derivatives of the rescattering part H .\nAfter a closer examination of these rescattering parts, one can find that all contributions from the\nasymmetrical-cut diagrams have the form as\nD\n\nH asym =\n\nl~T * (l~T − f (z)k~T ) iXp+ Y −\ne\n,\nl2 (l~T − f (z)k~T )2\n\n(19)\n\nT\n\nwhere f (z) = 0, 1, 1 − z, z is only a function of z, X is the longitudinal momentum fraction and Y −\n\nthe spatial coordinates. One can prove that the second derivative of the above expression vanishes\nat kT = 0,\n∇2kT\n\nl~T * (l~T − f (z)k~T )\n= 0.\nl2 (l~T − f (z)k~T )2\n\n(20)\n\nT\n\nTherefore, all contributions from the asymmetrical-cut(right-cut and left-cut) diagrams will vanish\nafter we make the second partial derivative with respect to kT when we keep only the leading terms\nup to O(xB /Q2 l2T ),\nD\n\n∇2kT H asym |kT =0 = 0 + O(xB /Q2 l2T ).\n\n(21)\n\nIn the same way we find that some of the central-cut diagrams will not contribute to the final results,\neither. In fact, after making the second partial derivative with respect to kT only four central-cut\ndiagrams shown in Fig. 2 will contribute to the final result.\n\nq\n\nq\n\nq\n\nq\n\nxp\n\nx1p\n\nxp\n\nx1p\n\nAp\n\nAp\n\nAp\n\nAp\n\n(a)\n\n(b)\n\nq\n\nq\n\nq\n\nq\n\nxp\n\nx1p\n\nxp\n\nx1p\n\nAp\n\nAp\n\nAp\n\n(c)\n\nAp\n(d)\n\nFIG. 2. Four central-cut Diagrams that contribute to the final results.\n\n7\n\n\fIncluding only those contributions that does not vanish after second derivative with respect to\nkT , we have\nD\n∇2kT H |kT =0\n\n=\n×\n\nZ\n\u0014\n\ndl2T\n\nαs 1 + z 2 i(x+xL )p+ y− 2παs\nθ(−y2− )θ(y − − y1− )\ne\n2π 1 − z\nNc\n\n−\n+ −\n+\n−\n4CA\n(1 − e−ixL p y2 )(1 − e−ixL p (y −y1 ) )\nl4T\n\n4CF (1 − z)2 −ixL p+ (y− −y− ) −ixL p+ y−\n1 e\n2\ne\nl4T\n−\n+\n−\n2CA (1 − z) −ixL p+ y−\n2 (1 − e−ixL p (y −y1 ) )\ne\n+\nl4T\n\u0015\n2CA (1 − z) −ixL p+ (y− −y− )\n−ixL p+ y2−\n2 2\n1\n+\ne\n(1 − e\n) + O(xB /Q lT )\nl4T\n+\n\n(22)\n\nD\n\nThe first term at the right-hand side in Eq. (22) comes from the contribution of H C(a) which is the\nmain contribution in the previous calculation [13] with helicity amplitude approximation. It contains\nhard-soft, double hard processes and their interferences. The other three terms come from diagram\n(b),(c),(d) of Fig. 2 respectively. They constitute corrections to the first term in powers of 1 − z.\nThe second term that are proportional to (1 − z)2 is from the final state radiation from the quark\n\nin the double hard process in Fig. 2-(b). This term is the only contribution to the finite photon\n\nspectra in the corresponding QED bremsstrahlung. The third and fourth terms are the results of\nthe interference of the final state radiation from the quark and other radiation processes (initial\nstate radiation and radiation from the gluon line). They contain both double hard processes and\ninterferences between hard-soft and double hard processes in Fig. 2-(c) and (d). In the limit of soft\ngluon radiation, (1 − z) → 0, these three terms can be neglected and we recover the result in the\nhelicity amplitude approximation [13].\n\nIV. MODIFIED FRAGMENTATION FUNCTION AND PARTON ENERGY LOSS\n\nSubstituting Eq. (22) into Eq. (11), Eq. (5) and adding the gluon fragmentation processes, we\nhave the semi-inclusive tensor from double quark-gluon scattering including the contribution beyond\nthe helicity amplitude approximation,\nZ 1\nD,q\nXZ\nWμν\n1 + z2\nαs\ndz\n(0)\n=\nDq→h (zh /z) CA\ndxHμν\n(xp, q)\ndzh\n2π\n1−z\nzh z\nq\n\u0014\n\u0015\nZ\nCF\ndl2T 2παs\nA\nA(1)\n2 A(2)\nT\n(x,\nx\n)\n+\n(1\n−\nz)T\n(x,\nx\n)\n+\n(1\n−\nz)\nT\n(x,\nx\n)\n×\nL\nL\nL\nqg\nqg\nqg\nl4T Nc\nCA\n+ (g − fragmentation) + (virtual corrections) ,\n\n(23)\n\nwhere\nA\nTqg\n(x, xL ) =\n\nZ\n\n−\n+ −\n+\n−\n+ −\ndy − − −\ndy1 dy2 (1 − e−ixL p y2 )(1 − e−ixL p (y −y1 ) )ei(x+xL )p y\n2π\n\n1\nhA|ψ̄q (0) γ + Fσ+ (y2− ) F +σ (y1− ) ψq (y − )|Aiθ(−y2− )θ(y − − y1− ) ,\n2\nZ\ni\n−\n−\n+ −\n+\n−\ndy − − − h −ixL p+ (y− −y− )\nA(1)\n1\nTqg\n(x, xL ) =\n+ e−ixL p y2 − 2e−ixL p (y −y1 +y2 )\ndy1 dy2 e\n2π\n8\n\n(24)\n\n\f+ − 1\nei(x+xL )p y hA|ψ̄q (0) γ + Fσ+ (y2− ) F +σ (y1− ) ψq (y − )|Aiθ(−y2− )θ(y − − y1− ) ,\n4\nZ\n−\n−\n−\n+ −\n+\ndy\nA(2)\ndy1− dy2− eixp y +ixL p (y1 −y2 )\nTqg\n(x, xL ) =\n2π\n1\nhA|ψ̄q (0) γ + Fσ+ (y2− ) F +σ (y1− ) ψq (y − )|Aiθ(−y2− )θ(y − − y1− )\n2\n\n(25)\n\n(26)\n\nare twist-four parton matrix elements of the nucleus. Apparently these parton matrix elements are\nA\nnot independent of each other. Tqg\n(x, xL ) has the complete four terms of soft-hard, double hard\n\nprocesses and their interferences. Therefore it contains essentially four independent parton matrix\nA(1)\n\nelements. Tqg\n\nA(2)\n\n(x, xL ) and Tgq\n\n(x, xL ) are the results of the corrections beyond helicity amplitude\n\nA\napproximation. But these two matrix elements are already contained in Tqg\n(x, xL ).\n\nDuring the collinear expansion, we have kept lT finite and took the limit kT → 0. As a conse-\n\nquence, the gluon field in one of the twist-four parton matrix elements in Eqs. (24)-(26) carries zero\nmomentum in the soft-hard process. However, the gluon distribution xfg (x) at x = 0 is not defined\nin QCD. As argued in Ref. [13], this is due to the omission of higher order terms in the collinear\n\nexpansion. As a remedy to the problem, a subset of the higher-twist terms in the collinear expansion\ncan be resummed to restore the phase factors such as exp(ixT p+ y − ), where xT ≡ hkT2 i/2p+ q − z is\n\nrelated to the intrinsic transverse momentum of the initial partons. As a result, soft gluon fields in\nthe parton matrix elements will carry a fractional momentum xT .\nUsing the factorization approximation [13,14,17] we can relate the twist-four parton matrix elements of the nucleus to the twist-two parton distributions of nucleons and the nucleus,\nA\nTqg\n(x, xL ) =\n\n2\n2\nC\n(1 − e−xL /xA )[fqA (x + xL ) xT fgN (xT ) + fqA (x)(xL + xT )fgN (xL + xT )]\nxA\n\n(27)\n\nwhere C is a constant, xA = 1/M RA , fqA (x) is the quark distribution inside a nucleus, and fgN (x) is\nthe gluon distribution inside a nucleon. A Gaussian distribution in the light-cone coordinates was\n√\n2\n−2\n−\nassumed for the nuclear distribution, ρ(y − ) = ρ0 exp(y − /2RA\n), where RA\n= 2RA M/p+ and M\nis the nucleon mass. We should emphasize that the twist-four matrix elements is proportional to\n1/xA = RA M , or the nuclear size [17].\nNotice that the off-diagonal matrix elements that correspond to the interferences between hardsoft and double hard processes is suppressed by a factor of exp(−x2L /x2A ). This is because in the\ninterferences between double-hard and hard-soft processes, there is actually momentum flow of\nxL p+ between the two nucleons where the initial quark and gluon come from. Without strong long\nrange two-nucleon correlation inside a nucleus, the amount of momentum flow xL p+ should then\n−\nbe restricted to the amount allowed by the uncertainty principle, 1/RA\n∼ p+ /RA M . Similarly, the\n\nother two parton matrix elements in Eqs. (25) and (26) can be approximated as\n\n\u0003\n2\n2\nC n\u0002 A\nfq (x + xL ) xT fgN (xT ) + fqA (x)(xL + xT )fgN (xL + xT ) e−xL /xA\n2xA\n− 2fqA (x)(xL + xT )fgN (xL + xT ) ,\nC A\nA(2)\nf (x)(xL + xT )fgN (xL + xT ) .\nTqg\n(x, xL ) =\nxA q\n\nA(1)\nTqg\n(x, xL ) =\n\nA(1)\n\nA\nFrom the above estimate of the matrix elements, both Tqg\n(x, xL ) and Tqg\n\n1−e\n\n−x2L /x2A\n\n(28)\n(29)\n\n(x, xL ) contain a factor\n\nbecause of the LPM interference effect. Such an interference factor will effectively\n9\n\n\fcut off the integration over the transverse momentum at xL ∼ xA in Eq. (23). As we will show\nlater in the calculation of the effective energy loss, the integration with such a restriction in the\ntransverse momentum due to LPM interference effect will give rise to a factor 1/xA in addition to\nthe coefficient fqA (x)/xA . Consequently, contributions from double scattering in Eq. (23) that are\nA(1)\n\nA\nassociated with Tqg\n(x, xL ) and Tqg\n\n2 A\n(x, xL ) will be proportional to RA\nfq (x). These are the leading\n\ndouble scattering contributions in the limit of large nuclear size. On the other hand, the third term\nA(2)\n\nTqg\n\n(x, xL ) in Eq. (23), which does not contain any interference effect, will only contribute to a\n\ncorrection that is proportional to RA fqA (x). In the limit of a large nucleus, A1/3 ≫ 1, we will neglect\n\nthis term in the double scattering processes. It is interesting to point out, however, that the physical\nprocess associated with this term is totally responsible for the non-vanishing photon spectra in QED\nbremsstrahlung which otherwise vanishes in the helicity amplitude approximation. As we can see,\nthe leading correction beyond helicity amplitude approximation comes from the interference between\nthis process and other radiation processes that contribute to the leading result in the first term.\nThe virtual correction in Eq. (23) can be obtained via unitarity requirement similarly as in\nRef. [13]. Including these virtual corrections and the single scattering contribution, we can rewrite\ne q→h (zh , μ2 ),\nthe semi-inclusive tensor in terms of a modified fragmentation function D\nX\ndWμν\n=\ndzh\nq\n\nZ\n\n(0)\ne q→h (zh , μ2 )\ndxfeqA (x, μ2I )Hμν\n(x, p, q)D\n\n(30)\n\nwhere feqA (x, μ2I ) is the quark distribution functions which in principle should also include the higher-\n\ntwist contribution [18] of the initial state scattering. The modified effective quark fragmentation\nfunction is defined as\n\nZ\n\nμ2\n\ndl2T αs\nl2T 2π\n\nZ\n\n1\n\ndz \u0002\n∆γq→qg (z, x, xL , l2T )Dq→h (zh /z)\nzh z\n0\n\u0003\n+ ∆γq→gq (z, x, xL , l2T )Dg→h (zh /z) ,\n\ne q→h (zh , μ2 ) ≡ Dq→h (zh , μ2 ) +\nD\n\n(31)\n\nwhere Dq→h (zh , μ2 ) and Dg→h (zh , μ2 ) are the leading-twist fragmentation functions. The modified\nsplitting functions are given as\n\u0015\n\u0014\n2παs CA\n1 + z 2 A(m)\nA(m)\n2\n2\nTqg (x, xL ) + δ(1 − z)∆Tqg (x, lT )\n,\n∆γq→qg (z, x, xL , lT ) =\n2\n(1 − z)+\nlT Nc feqA (x, μ2I )\n∆γq→gq (z, x, xL , l2T ) = ∆γq→qg (1 − z, x, xL , l2T ),\nZ 1\ni\n1 h A(m)\nA(m)\n2\nA(m)\n∆Tqg (x, lT ) ≡\ndz\n(x, xL ) ,\n2Tqg (x, xL )|z=1 − (1 + z 2 )Tqg\n1−z\n0\nA(m)\nA\nA(1)\nTqg\n(x, xL ) ≡ Tqg\n(x, xL ) + (1 − z)Tqg\n(x, xL ) .\n\n(32)\n(33)\n(34)\n(35)\n\nThe above modified fragmentation function is almost the same as in the previous calculation\nA\nwith helicity amplitude approximation, except that the twist-four parton matrix element Tqg\n(x, xL )\nA(m)\n\nis replaced by a modified one Tqg\n\n(x, xL ) in Eq. (35). One can then calculate numerically the\n\nmodified fragmentation function as in Refs. [12,13]. To further simplify the calculation, we assume\nxT ≪ xL ≪ x. The modified parton matrix elements can be approximated by\n\u0015\n\u0014\ne\n1−z\nC\n−x2L /x2A\nA\nA(m)\n,\n(1 − e\n)fq (x) 1 −\nTqg (x, xL ) ≈\nxA\n2\n10\n\n(36)\n\n\fe ≡ 2CxT f N (xT ) is a coefficient which should in principle depends on Q2 and xT . Here we\nwhere C\ng\n\nwill simply take it as a constant. The new correction term in this calculation is thus negative in\nthe modified splitting function. This will reduce the nuclear suppression of hadron spectra at large\nvalues of z and thus reduce the effective quark energy loss.\nBecause of momentum conservation, the fractional momentum in a nucleon is limited to xL < 1.\nThough the Fermi motion effect in a nucleus can allow xL > 1, the parton distribution in this\nregion is still significant suppressed. It therefore provides a natural cut-off for xL in the integration\nover z and lT in Eq. (31). Shown in Fig. 3 are the calculated nuclear modification factor for the\nquark fragmentation function DA (z, Q2 )/DN (z, Q2 ) inside a nucleus with A = 100. In this numerical\ne = 0.006 GeV2 which was fitted to the HERMES experimental data [12].\nevaluation, we have taken C\n\nThe dashed curve is for the modified fragmentation function in the helicity amplitude approximation\nand the solid curve is obtained with the new correction term. Apparently, the new correction term\nreduces the nuclear modification, though the reduction is not very significant.\n1.2\n1\n0.8\n0.6\n0.4\n0.2\n0\n\n0\n\n0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9\n\n1\n\nFIG. 3. Calculated nuclear modification factor for the quark fragmentation in a nucleus (A=100). The\nsolid line is the current calculation with the new correction term. The dashed line is the previous result with\nhelicity amplitude approximation.\n\nSimilarly, we can also calculate the effective quark energy loss, which is defined as the energy\ncarried away by the radiated gluon,\nZ\n\nZ\ndl2T 1 αs\ndz z ∆γq→gq (z, xB , xL , l2T )\n2\nl\n2π\n0\n0\nT\n2\nZ\nZ\nA(m)\nμ\n(xB , xL )\ndl2T 1\nCA α2s\n2 Tqg\n.\ndz[1\n+\n(1\n−\nz)\n]\n=\n4\nNc\nlT 0\nfeqA (xB , μ2I )\n0\n\nh∆zg i(xB , μ2 ) =\n\nμ2\n\n(37)\n\nWe separate the parton energy loss as two parts\n\nh∆zg i(xB , μ2 ) = h∆zg iheli (xB , μ2 ) + h∆zg icorr (xB , μ2 ),\n\n(38)\n\nwhere h∆zg iheli (xB , μ2 ) is the leading quark energy loss with helicity amplitude approximation [13],\nand h∆zg icorr (xB , μ2 ) is the new correction to the quark energy loss in this calculation. Using the\n\napproximation for the modified twist-four parton matrix elements in Eq. (36), we have\n\n11\n\n\fe\nh∆zg iheli (xB , μ2 ) = C\n\nCA α2s xB\nNc xA Q2\n\n2\ne CA αs xB\nh∆zg icorr (xB , μ ) = C\nNc xA Q2\n2\n\nZ\n\n1\n\ndz\n\n0\n\nZ\n\n0\n\n1\n\n1 + (1 − z)2\nz(1 − z)\n\n1 + (1 − z)2\ndz\nz(1 − z)\n\nZ\n\nxμ\n\n0\n\nZ\n\n0\n\nxμ\n\n2\n2\ndxL\n(1 − e−xL /xA );\nx2L\n\n(39)\n\n2\n2\ndxL z\n(− )(1 − e−xL /xA ) ,\nx2L\n2\n\n(40)\n(41)\n\nwhere xμ = μ2 /2p+ q − z(1 − z) = xB /z(1 − z) if we choose the factorization scale as μ2 = Q2 . When\nxA ≪ xB ≪ 1 we can estimate the leading quark energy loss roughly as\n\nCA α2s xB √\n1 − 2xB\n− 1] ,\n2 π[3 ln\nNc Q2 x2A\nxB\n2\n√\n1 − 2xB\n1\ne CA αs xB\nπ[ln\n+ ].\nh∆zg icorr (xB , μ2 ) ≈ −C\nNc Q2 x2A\nxB\n2\ne\nh∆zg iheli (xB , μ2 ) ≈ C\n\n(42)\n(43)\n\nSince xA = 1/M RA , both of the energy loss h∆zg iheli and h∆zg icorr depend quadratically on the\nnuclear size. Adding them together, we have\n\n1 − 2xB\n5\nC̃α2s xB √\n− ]\nπ[5 ln\nNc Q2 x2A\nxB\n2\n5\n≈ h∆zg iheli (xB , μ2 ), (xA ≪ xB ≪ 1) .\n6\n\nh∆zg i(xB , μ2 ) ≈\n\n(44)\n(45)\n\nThe new correction thus reduces the effective quark energy loss by approximately a factor of 5/6\nfrom the result with helicity amplitude approximation.\nV. SUMMARY\n\nWe have extended an earlier study [13] on gluon radiation induced by multiple parton scattering\nin DIS off a nuclear target with a complete calculation beyond the helicity amplitude (or soft radiation) approximation. Working within the framework of the generalized factorization of twist-four\nprocesses, we obtained a new correction to the modified parton fragmentation functions. Such a new\ncorrection essentially results in a new term in the modified splitting function which is proportional\nto (1 − z). In the limit of helicity amplitude approximation (1 − z) → 0, this term vanishes and we\nrecover the early results [13].\n\nThe new correction we obtained in this paper comes from the gluon radiation process (residual\nfinal state radiation from a quark after incomplete cancellation by the initial state radiation) that is\nactually responsible for the photon radiation in QED. However, the leading correction beyond the\nhelicity amplitude approximation does not come from this process itself. Rather, it comes from the\ninterference between this process and the other gluon radiation processes that are responsible for\nthe result in the helicity amplitude approximation. Though it is not dominant for induced gluon\nradiation in QCD, it still make a finite contribution to the modified fragmentation function for a\nquark propagating inside a nuclear medium and to the effective quark energy loss. We found that\nit reduces the effective quark energy loss by a factor of 5/6.\n\n12\n\n\fACKNOWLEDGEMENTS\n\nWe would like to thank Enke Wang for numerous discussions throughout this work. This work\nwas supported by NSFC under project Nos. 19928511 and 10135030, and by the Director, Office of\nEnergy Research, Office of High Energy and Nuclear Physics, Divisions of Nuclear Physics, of the\nU.S. Department of Energy under Contract No. DE-AC03-76SF00098.\nAPPENDIX\n\nIn this Appendix we will list our complete calculation of quark-gluon double scattering in detail.\nThere are total 23 cut diagrams which are illustrated in Figs. 4-14.\n\nq\n\nxp\n\nq\n\nl\n\nlq\n\nx3p+kT\n\nx2p+kT\n\nx1p\n\nAp\n\nAp\n\nFIG. 4.\n\nIn Fig. 4 there are three possible cuts(central cut, left cut and right cut). We get\nZ\ndl2T αs\n1 + z2\nD\nH Ap−1 (y − , y1− , y2− , kT , x, p, q, z) =\nCF\n2\nlT 2π\n1−z\n2παs\nI Ap−1 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\n×\nNc\n\n(46)\n\nwhere\n+ −\n\nI Ap−1,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\ny +ixD p+ (y1− −y2− )\n+ −\ny2\n\n× (1 − e−ixL p\nI Ap−1,L (y\n\n−\n\n, y1− , y2− , lT , kT , x, p, q, z)\n\n= −e\n\nθ(−y2− )θ(y − − y1− )\n+\n\n)(1 − e−ixL p\n\n(y − −y1− )\n\ni(x+xL )p+ y − +ixD p+ (y1− −y2− )\n+\n\n× (1 − e−ixL p\n\n(y\n\n−\n\n−y1− )\n\n+ −\n\nI Ap−1,R (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n\n+ −\ny2\n\n× (1 − e−ixL p\n\n13\n\n).\n\n−\n\n).\ny2− )θ(y −\n\n(47)\n−\n\n),\n\n+\n\ny +ixD p\n\nθ(y1−\n\n(y1− −y2− )\n\ny1− )\n(48)\n\nθ(−y2− )θ(y2− − y1− )\n(49)\n\n\fq\n\nq\n\nl\nlq\nx3p+kT\n\nxp\n\nx2p+kT\n\nx1p\n\nAp\n\nAp\n\nFIG. 5.\n\nIn Fig. 5, there are two different cuts, central or left. So we obtain,\nD\n\nH Ap−2 (y − , y1− , y2− , kT , x, p, q, z) =\n×\n\nZ\n\nCA 1 + z 2\nl~T * (l~T − (1 − z)k~T ) αs\n(CF −\n)\n2 1−z\nl2T (l~T − (1 − z)k~T )2 2π\n\ndl2T\n\n2παs\nI Ap−2 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\ny +ixD p+ (y1− −y2− )\n\nI Ap−2,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n+\n\n× [e−ixL p\nI Ap−2,L (y\n\n−\n\n, y1− , y2− , lT , kT , x, p, q, z)\n\n=e\n\n(y − −y1− )\n\n+\n\n− e−ixL p\n\n+\n\n× [e−ixL p\n\n(y\n\n−\n\nθ(−y2− )θ(y − − y1− )\n\n(y − −y1− +y2− )\n\ni(x+xL )p+ y − +ixD p+ (y1− −y2− )\n\n(50)\n\n−\n\nθ(y −\n\n],\n\ny1− )θ(y1−\n\n−y2− )+i(x0D −xD )p+ (y1− −y2− )\n\n(51)\n−\n\ny2− )\n\n+\n\n− e−ixL p\n\n(y − −y1− )\n\n] , (52)\n\nwhere x0D = kT /2p+ q − .\n\nq\n\nxp\n\nl\n\nq\nlq\n\nx3p+kT\n\nx2p+kT\n\nx1p\n\nAp\n\nAp\n\nFIG. 6.\n\nAs for the central cut and right cut of Fig. 6, we obtain\nD\n\nH Ap−3 (y − , y1− , y2− , kT , x, p, q, z) =\n×\n\nZ\n\ndl2T\n\nl~T * (l~T − (1 − z)k~T ) αs\nCA 1 + z 2\n(CF −\n)\n2\n2 1−z\nlT (l~T − (1 − z)k~T )2 2π\n\n2παs\nI Ap−3 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nI Ap−3,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\ny +ixD p+ (y1− −y2− )\n\n+ −\ny2\n\n× [e−ixL p\nI Ap−3,R (y\n\n−\n\n, y1− , y2− , lT , kT , x, p, q, z)\n\n=e\n\n+\n\n− e−ixL p\n\n× [e\n\nθ(−y2− )θ(y − − y1− )\n\n(y − −y1− +y2− )\n\ni(x+xL )p+ y − +ixD p+ (y1− −y2− )\n\n],\n\n(54)\n\nθ(−y2− )θ(y2−\n\n−i(x0D −xD )p+ (y1− −y2− )−ixL p+ y1−\n\n14\n\n(53)\n\n−e\n\n−\n\ny1− )\n\n−ixL p+ y2−\n\n].\n\n(55)\n\n\fq\n\nl\n\nq\nlq\n\nxp\n\nx3p+kT\n\nx2p+kT\n\nx1p\n\nAp\n\nAp\n\nFIG. 7.\n\nThere is only one cut (left cut) in Fig. 7 with the contribution,\nZ\ndl2T αs\n1 + z2\nD\n− − −\nH Ap−4 (y , y1 , y2 , kT , x, p, q, z) =\nC\nF\nl2T 2π\n1−z\n2παs\n×\nI Ap−4 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\ny +ixD p+ (y1− −y2− )\n\nI Ap−4,L (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n0\n\n+\n\n× ei(xD −xD )p\n\nθ(y − − y1− )θ(y1− − y2− )\n\n(y1− −y2− ) −ixL p+ (y − −y2− )\n\ne\n\nq\n\n(56)\n\n.\n\n(57)\n\nq\nl\nlq\n\nxp\n\nx3p+kT\n\nx2p+kT\n\nx1p\n\nAp\n\nAp\n\nFIG. 8.\n\nAs for Fig. 8, we get\nD\n\nZ\n\n1 + z2\nαs\nCF\n1−z\n(l~T − (1 − z)k~T )2 2π\n2παs\nI Ap−5 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\n×\nNc\n\nH Ap−5 (y − , y1− , y2− , kT , x, p, q, z) =\n\ndl2T\n\n+ −\n\nI Ap−5,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n+\n\n× e−ixL p\n\n15\n\n+\n\ny +ixD p\n\n(y1− −y2− )\n\n(y − −y1− ) −ixL p+ y2−\n\ne\n\n.\n\n(58)\n\nθ(−y2− )θ(y − − y1− )\n(59)\n\n\fq\n\nq\nl\nlq\n\nxp\n\nx3p+kT\n\nx2p+kT\n\nx1p\n\nAp\n\nAp\n\nFIG. 9.\n\nThe contribution from Fig. 9 is\nZ\n\ndl2T αs\n1 + z2\nC\nF\nl2T 2π\n1−z\n2παs\nI Ap−6 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\n×\nNc\n\nD\n\nH Ap−6 (y − , y1− , y2− , kT , x, p, q, z) =\n\n+ −\n\nI Ap−6,R (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n0\n\n+\n\n× ei(xD −xD )p\n\ny +ixD p+ (y1− −y2− )\n\nθ(−y2− )θ(y2− − y1− )\n\n(y1− −y2− ) −ixL p+ y1−\n\ne\n\nq\n\nq\n\nxp\n\nx1p\n\nAp\n\n(60)\n\n.\n\n(61)\n\nAp\n\nFIG. 10.\n\nAs for the processes in Fig. 10 we have three possible cuts. Thus the contributions can be written\nas\nD\n\nZ\n\ndl2T\nαs\n1 + z2\nCA\n1−z\n(l~T − k~T )2 2π\n2παs\nI Ap−7,C (y − , y1− , y2− , lT , kT , x, p, q, z) ,\n×\nNc\n\nH Ap−7,C (y − , y1− , y2− , kT , x, p, q, z) =\n\n+ −\n\nI Ap−7,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\ny +ixD p+ (y1− −y2− )\n\n+ −\ny2 /(1−z)\n\n× [eixD p\n\nixD p+ (y − −y1− )/(1−z)\n\nθ(−y2− )θ(y − − y1− )\n\n+ −\ny2\n\n− e−ixL p\n\n]\n\n−ixL p+ (y − −y1− )\n\n× [e\n−e\n],\nZ\n2\n2\n1+z\ndlT αs\nD\nCA\nH Ap−7,L(R) (y − , y1− , y2− , kT , x, p, q, z) =\nl2T 2π\n1−z\n2παs\n×\nI Ap−7,L(R) (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nI Ap−7,L (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n16\n\n(62)\n\ny +ixD p+ (y1− −y2− )\n\nθ(y − − y1− )θ(y1− − y2− )\n\n(63)\n\n(64)\n\n\f+\n\n× e−i(1−z/(1−z))xD p\n+\n\n× [1 − e−ixL p\nI Ap−7,R (y − , y1− , y2− , lT , kT , x, p, q, z)\n\n(y1− −y2− )\n\n(y − −y1− )\n\n+ −\n\n= −ei(x+xL )p\n\n×e\n\n],\n\n+\n\ny +ixD p\n\n(65)\n\n(y1− −y2− )\n\n−i(1−z/(1−z))xD p+ (y1− −y2− )\n\nq\n\nq\n\nxp\n\nx1p\n\nAp\n\nθ(−y2− )θ(y2−\n\n[1 − e\n\n−ixL p+ y2−\n\n−\n\ny1− )\n\n],\n\n(66)\n\nAp\n\nFIG. 11.\n\nThere are three cuts in Fig. 11 and we have\nD\n\nH Ap−8 (y − , y1− , y2− , kT , x, p, q, z) =\n×\n\nZ\n\ndl2T\n\nl~T * (l~T − k~T ) αs CA 1 + z 2\nl2T (l~T − k~T )2 2π 2 1 − z\n\n2παs\nI Ap−8 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\ny +ixD p+ (y1− −y2− )\n\nI Ap−8,C (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n\n+ −\ny2 /(1−z)\n\n× [eixD p\n\n+\n\n× [1 − e−ixL p\nI Ap−8,L (y\n\n−\n\n, y1− , y2− , lT , kT , x, p, q, z)\n\n= −e\n\n(y\n\n−\n\n+ −\ny2\n\n− e−ixL p\n\n−y1− )\n\n× e−i(1−z/(1−z))xD p\n+\n\n× [e−ixL p\nI Ap−8,R (y\n\n−\n\n, y1− , y2− , lT , kT , x, p, q, z)\n\n= −e\n× [e\n\n(y − −y1− )\n\n],\n\n(68)\n\n−e\n\n+\n\n− eixD p\n\nq\n\nxp\n\nx1p\n\nAp\n\nFIG. 12.\n\n17\n\nθ(y −\n\ny1− )θ(y1−\n\n(y − −y1− )/(1−z)\n\nixD p+ y2− /(1−z)\n\nq\n\nAp\n\n−\n\n−\n\ny2− )\n\n(y1− −y2− )\n\ni(x+xL )p+ y − +ixD p+ (y1− −y2− )\n\n−ixL p+ y2−\n\nθ(−y2− )θ(y − − y1− )\n\n]\n\ni(x+xL )p+ y − +ixD p+ (y1− −y2− )\n+\n\n(67)\n\n],\n\nθ(−y2− )θ(y2−\n\n],\n\n(69)\n−\n\ny1− )\n(70)\n\n\fThe contributions from the three cuts in Fig. 12 can be read as\nD\n\nH Ap−9 (y − , y1− , y2− , kT , x, p, q, z) =\n×\n\nZ\n\ndl2T\n\nl~T * (l~T − k~T ) αs CA 1 + z 2\nl2T (l~T − k~T )2 2π 2 1 − z\n\n2παs\nI Ap−9 (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nI Ap−9,C (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n+\n\n× [eixD p\n× [1 − e\nI Ap−9,L (y\n\n−\n\n, y1− , y2− , lT , kT , x, p, q, z)\n\n= −e\n\ny +ixD p+ (y1− −y2− )\n\n−ixL p+ y2−\n\n− e−ixL p\n\n× [e−ixL p\n\n(y\n\n−\n\n−y1− )\n\n+ −\n\nI Ap−9,R (y − , y1− , y2− , lT , kT , x, p, q, z) = −ei(x+xL )p\n+ −\ny2\n\n]\n(72)\n\n+\n\n− eixD p\n+\n\ny +ixD p\n+\n\n× e−i(1−z/(1−z))xD p\n\n× [e−ixL p\n\n(y − −y1− )\n\n],\n\ni(x+xL )p+ y − +ixD p+ (y1− −y2− )\n+\n\nθ(−y2− )θ(y − − y1− )\n+\n\n(y − −y1− )/(1−z)\n\n(71)\n\n(y\n\n−\n\n+ −\ny2 /(1−z)\n\n− eixD p\n\nq\n\nq\n\nxp\n\nx1p\n\nAp\n\nθ(y −\n\ny1− )θ(y1−\n\n−y1− )/(1−z)\n\n(y1− −y2− )\n\n(y1− −y2− )\n\n−\n\n−\n\ny2− )\n\n],\n\n(73)\n\nθ(−y2− )θ(y2− − y1− )\n\n],\n\n(74)\n\nAp\n\nFIG. 13.\n\nIn Fig. 13 there are two possible cuts (central or left). We have\nD\n\nH Ap−10,C (y − , y1− , y2− , kT , x, p, q, z) =\n×\n\nZ\n\ndl2T\n\n(l~T − k~T ) * (l~T − (1 − z)k~T ) αs CA 1 + z 2\n(l~T − k~T )2 (l~T − (1 − z)k~T )2 2π 2 1 − z\n\n2παs\nI Ap−10,C (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nI Ap−10,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\ny +ixD p+ (y1− −y2− )\n\n+ −\n\n+\n\n(75)\n\nθ(−y2− )θ(y − − y1− )\n+\n\n× e−ixL p y2 [eixD p (y −y1 )/(1−z) − e−ixL p (y −y1 ) ] ,\nZ\nl~T * (l~T − z k~T ) αs CA 1 + z 2\nD\n− − −\nH Ap−10,R (y , y1 , y2 , kT , x, p, q, z) = dl2T\nl2T (l~T − z k~T )2 2π 2 1 − z\n2παs\n×\nI Ap−10,R (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n−\n\n+ −\n\nI Ap−10,R (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n× [e\n\n−\n\ny +ixD p+ (y1− −y2− )\n\n−\n\n−\n\n(76)\n\n(77)\n\nθ(−y2− )θ(y2− − y1− )\n\n−i(xD −x0D )p+ (y1− −y2− )−ixL p+ y1−\n+\n\n−e−i(1−z/(1−z))xD p\n\n18\n\n(y1− −y2− )−ixL p+ y2−\n\n].\n\n(78)\n\n\fq\n\nq\n\nxp\n\nx1p\n\nAp\n\nAp\n\nFIG. 14.\n\nIn Fig. 14 we can make the central cut or the left cut and we obtain\nD\n\nH Ap−11,C (y − , y1− , y2− , kT , x, p, q, z) =\n×\n\nZ\n\ndl2T\n\n(l~T − k~T ) * (l~T − (1 − z)k~T ) αs CA 1 + z 2\n(l~T − k~T )2 (l~T − (1 − z)k~T )2 2π 2 1 − z\n\n2παs\nI Ap−11,C (y − , y1− , y2− , lT , kT , x, p, q, z) ,\nNc\n+ −\n\nI Ap−11,C (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n+\n\ny +ixD p+ (y1− −y2− )\n+ −\n\nθ(−y2− )θ(y − − y1− )\n+ −\n\n× e−ixL p (y −y1 ) [eixD p y2 /(1−z) − e−ixL p y2 ] ,\nZ\nl~T * (l~T − z k~T ) αs CA 1 + z 2\nD\nH Ap−11,R (y − , y1− , y2− , kT , x, p, q, z) = dl2T\nl2T (l~T − z k~T )2 2π 2 1 − z\n2παs\nI Ap−11,L (y − , y1− , y2− , lT , kT , x, p, q, z) ,\n×\nNc\n−\n\n−\n\n+ −\n\nI Ap−11,L (y − , y1− , y2− , lT , kT , x, p, q, z) = ei(x+xL )p\n\ny +ixD p+ (y1− −y2− )\n\n0\n\n+\n\n× [e−i(xD −xD )p\n\n(79)\n\n(80)\n\n(81)\n\nθ(y − − y1− )θ(y1− − y2− )\n\n(y1− −y2− )−ixL p+ (y − −y2− )\n+\n\n−e−i(1−z/(1−z))xD p\n\n(y1− −y2− )−ixL p+ (y − −y1− )\n\n].\n\n(82)\n\n[1] M. Gyulassy and M. Plümer, Phys. Lett. B243, 432 (1990).\n[2] X.-N. Wang and M. Gyulassy, Phys. Rev. Lett. 68, 1480 (1992).\n[3] X. N. Wang, Z. Huang and I. Sarcevic, Phys. Rev. Lett. 77, 231 (1996) [arXiv:hep-ph/9605213];\nX. N. Wang and Z. Huang, Phys. Rev. C 55, 3047 (1997) [arXiv:hep-ph/9701227].\n[4] C. A. Salgado and U. A. Wiedemann, Phys. Rev. Lett. 89, 092303 (2002) [arXiv:hep-ph/0204221].\n[5] M. Gyulassy and X.-N. Wang, Nucl. Phys. B420, 583 (1994) [arXiv:nucl-th/9306003]; X.-N. Wang, M.\nGyulassy and M. Plümer, Phys. Rev. D 51, 3436 (1995) [arXiv:hep-ph/9408344].\n[6] R. Baier et al., Nucl. Phys. B483, 291 (1997) [arXiv:hep-ph/9607355]; Nucl. Phys. B484, 265 (1997)\n[arXiv:hep-ph/9608322]; Phys. Rev. C 58, 1706 (1998) [arXiv:hep-ph/9803473].\n[7] B. G. Zhakharov, JETP letters 63, 952 (1996) [arXiv:hep-ph/9607440].\n[8] M. Gyulassy, P. Lévai and I. Vitev, Nucl. Phys. B594, 371 (2001) [arXiv:nucl-th/0006010]; Phys. Rev.\nLett. 85, 5535 (2000) [arXiv:nucl-th/0005032].\n[9] U. Wiedemann, Nucl. Phys. B588, 303 (2000) [arXiv:hep-ph/0005129]; Nucl. Phys. A 690, 731 (2001)\n[arXiv:hep-ph/0008241].\n[10] K. Adcox et al. [PHENIX Collaboration], Phys. Rev. Lett. 88, 022301 (2002) [arXiv:nucl-ex/0109003].\n[11] C. Adler et al. [STAR Collaboration], Phys. Rev. Lett. 89, 202301 (2002) [arXiv:nucl-ex/0206011].\n[12] E. Wang and X.-N. Wang, Phys. Rev. Lett. 89, 162301 (2002) [arXiv:hep-ph/0202105].\n\n19\n\n\f[13] X.-N. Wang and X. F. Guo, Nucl. Phys. A 696, 788 (2001) [arXiv:hep-ph/0102230]; X. F. Guo and\nX.-N. Wang, Phys. Rev. Lett. 85, 3591 (2000) [arXiv:hep-ph/0005044].\n[14] M. Luo, J. Qiu and G. Sterman, Phys. Lett. B279, 377 (1992); M. Luo, J. Qiu and G. Sterman, Phys.\nRev. D50, 1951 (1994); M. Luo, J. Qiu and G. Sterman, Phys. Rev. D49, 4493 (1994).\n[15] L. D. Landau and I. J. Pomeranchuk, Dolk. Akad. Nauk. SSSR 92, 92(1953); A. B. Migdal, Phys. Rev.\n103, 1811 (1956).\n[16] V. N. Gribov and L. N. Lipatov, Sov. J. Nucl. Phys. 15, 438 (1972); Yu. L. Dokshitzer, Sov. Phys.\nJETP 46, 641 (1977); G. Altarelli and G. Parisi, Nucl. Phys. B126, 298 (1977);\n[17] J. Osborne and X.-N. Wang, Nucl. Phys. A 710, 281 (2002) [arXiv:hep-ph/0204046].\n[18] A. H. Mueller and J. Qiu, Nucl. Phys. B268, 427 (1986).\n\n20\n\n\f"}