{"id": "http://arxiv.org/abs/hep-ph/0207175v1", "guidislink": true, "updated": "2002-07-14T22:21:52Z", "updated_parsed": [2002, 7, 14, 22, 21, 52, 6, 195, 0], "published": "2002-07-14T22:21:52Z", "published_parsed": [2002, 7, 14, 22, 21, 52, 6, 195, 0], "title": "Does mirror matter exist?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0207334%2Chep-ph%2F0207044%2Chep-ph%2F0207057%2Chep-ph%2F0207125%2Chep-ph%2F0207112%2Chep-ph%2F0207272%2Chep-ph%2F0207004%2Chep-ph%2F0207012%2Chep-ph%2F0207069%2Chep-ph%2F0207343%2Chep-ph%2F0207371%2Chep-ph%2F0207084%2Chep-ph%2F0207255%2Chep-ph%2F0207286%2Chep-ph%2F0207367%2Chep-ph%2F0207137%2Chep-ph%2F0207358%2Chep-ph%2F0207175%2Chep-ph%2F0207131%2Chep-ph%2F0207109%2Chep-ph%2F0207311%2Chep-ph%2F0207252%2Chep-ph%2F0207081%2Chep-ph%2F0207256%2Chep-ph%2F0207206%2Chep-ph%2F0207076%2Chep-ph%2F0207202%2Chep-ph%2F0207307%2Chep-ph%2F0207036%2Chep-ph%2F0207028%2Chep-ph%2F0207276%2Chep-ph%2F0207171%2Chep-ph%2F0207194%2Chep-ph%2F0207354%2Chep-ph%2F0207092%2Chep-ph%2F0207178%2Chep-ph%2F0207216%2Chep-ph%2F0207155%2Chep-ph%2F0207020%2Chep-ph%2F0207250%2Chep-ph%2F0207257%2Chep-ph%2F0207144%2Chep-ph%2F0207041%2Chep-ph%2F0207345%2Chep-ph%2F0207293%2Chep-ph%2F0207145%2Chep-ph%2F0207196%2Chep-ph%2F0207135%2Chep-ph%2F0207346%2Chep-ph%2F0207331%2Chep-ph%2F0207207%2Chep-ph%2F0207033%2Chep-ph%2F0207229%2Chep-ph%2F0207154%2Chep-ph%2F0207353%2Chep-ph%2F0207281%2Chep-ph%2F0207186%2Chep-ph%2F0207359%2Chep-ph%2F0207225%2Chep-ph%2F0207261%2Chep-ph%2F0207231%2Chep-ph%2F0207136%2Chep-ph%2F0207266%2Chep-ph%2F0207096%2Chep-ph%2F0207200%2Chep-ph%2F0207088%2Chep-ph%2F0207369%2Chep-ph%2F0207055%2Chep-ph%2F0207116%2Chep-ph%2F0207121%2Chep-ph%2F0207034%2Chep-ph%2F0207314%2Chep-ph%2F0207258%2Chep-ph%2F0207357%2Chep-ph%2F0207158%2Chep-ph%2F0207106%2Chep-ph%2F0207118%2Chep-ph%2F0207072%2Chep-ph%2F0207080%2Chep-ph%2F0207077%2Chep-ph%2F0207222%2Chep-ph%2F0207267%2Chep-ph%2F0207152%2Chep-ph%2F0207292%2Chep-ph%2F0207351%2Chep-ph%2F0207157%2Chep-ph%2F0207074%2Chep-ph%2F0207133%2Chep-ph%2F0207163%2Chep-ph%2F0207130%2Chep-ph%2F0207335%2Chep-ph%2F0207232%2Chep-ph%2F0207326%2Chep-ph%2F0207085%2Chep-ph%2F0207210%2Chep-ph%2F0207193%2Chep-ph%2F0207325%2Chep-ph%2F0207048%2Chep-ph%2F0207282%2Chep-ph%2F0207228%2Chep-ph%2F0207368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Does mirror matter exist?"}, "summary": "One of the most fascinating ideas coming from particle physics is the concept\nof mirror matter. Mirror matter is a new form of matter which is predicted to\nexist if mirror symmetry is respected by nature. At the preset time evidence\nthat mirror matter actually exists is in abundance, coming from a range of\nobservations and experiments in astronomy, particle physics, meteoritics and\nplanetary science.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0207334%2Chep-ph%2F0207044%2Chep-ph%2F0207057%2Chep-ph%2F0207125%2Chep-ph%2F0207112%2Chep-ph%2F0207272%2Chep-ph%2F0207004%2Chep-ph%2F0207012%2Chep-ph%2F0207069%2Chep-ph%2F0207343%2Chep-ph%2F0207371%2Chep-ph%2F0207084%2Chep-ph%2F0207255%2Chep-ph%2F0207286%2Chep-ph%2F0207367%2Chep-ph%2F0207137%2Chep-ph%2F0207358%2Chep-ph%2F0207175%2Chep-ph%2F0207131%2Chep-ph%2F0207109%2Chep-ph%2F0207311%2Chep-ph%2F0207252%2Chep-ph%2F0207081%2Chep-ph%2F0207256%2Chep-ph%2F0207206%2Chep-ph%2F0207076%2Chep-ph%2F0207202%2Chep-ph%2F0207307%2Chep-ph%2F0207036%2Chep-ph%2F0207028%2Chep-ph%2F0207276%2Chep-ph%2F0207171%2Chep-ph%2F0207194%2Chep-ph%2F0207354%2Chep-ph%2F0207092%2Chep-ph%2F0207178%2Chep-ph%2F0207216%2Chep-ph%2F0207155%2Chep-ph%2F0207020%2Chep-ph%2F0207250%2Chep-ph%2F0207257%2Chep-ph%2F0207144%2Chep-ph%2F0207041%2Chep-ph%2F0207345%2Chep-ph%2F0207293%2Chep-ph%2F0207145%2Chep-ph%2F0207196%2Chep-ph%2F0207135%2Chep-ph%2F0207346%2Chep-ph%2F0207331%2Chep-ph%2F0207207%2Chep-ph%2F0207033%2Chep-ph%2F0207229%2Chep-ph%2F0207154%2Chep-ph%2F0207353%2Chep-ph%2F0207281%2Chep-ph%2F0207186%2Chep-ph%2F0207359%2Chep-ph%2F0207225%2Chep-ph%2F0207261%2Chep-ph%2F0207231%2Chep-ph%2F0207136%2Chep-ph%2F0207266%2Chep-ph%2F0207096%2Chep-ph%2F0207200%2Chep-ph%2F0207088%2Chep-ph%2F0207369%2Chep-ph%2F0207055%2Chep-ph%2F0207116%2Chep-ph%2F0207121%2Chep-ph%2F0207034%2Chep-ph%2F0207314%2Chep-ph%2F0207258%2Chep-ph%2F0207357%2Chep-ph%2F0207158%2Chep-ph%2F0207106%2Chep-ph%2F0207118%2Chep-ph%2F0207072%2Chep-ph%2F0207080%2Chep-ph%2F0207077%2Chep-ph%2F0207222%2Chep-ph%2F0207267%2Chep-ph%2F0207152%2Chep-ph%2F0207292%2Chep-ph%2F0207351%2Chep-ph%2F0207157%2Chep-ph%2F0207074%2Chep-ph%2F0207133%2Chep-ph%2F0207163%2Chep-ph%2F0207130%2Chep-ph%2F0207335%2Chep-ph%2F0207232%2Chep-ph%2F0207326%2Chep-ph%2F0207085%2Chep-ph%2F0207210%2Chep-ph%2F0207193%2Chep-ph%2F0207325%2Chep-ph%2F0207048%2Chep-ph%2F0207282%2Chep-ph%2F0207228%2Chep-ph%2F0207368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "One of the most fascinating ideas coming from particle physics is the concept\nof mirror matter. Mirror matter is a new form of matter which is predicted to\nexist if mirror symmetry is respected by nature. At the preset time evidence\nthat mirror matter actually exists is in abundance, coming from a range of\nobservations and experiments in astronomy, particle physics, meteoritics and\nplanetary science."}, "authors": ["Robert Foot"], "author_detail": {"name": "Robert Foot"}, "author": "Robert Foot", "arxiv_comment": "very non-technical", "links": [{"href": "http://arxiv.org/abs/hep-ph/0207175v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0207175v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.space-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0207175v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0207175v1", "journal_reference": null, "doi": null, "fulltext": "July 2002\n\narXiv:hep-ph/0207175v1 14 Jul 2002\n\nDoes mirror matter exist?∗\n\nRobert Foot\nSchool of Physics, The University of Melbourne\nVictoria 3010 Australia\nE-mail: foot@physics.unimelb.edu.au\n\nAbstract\nOne of the most fascinating ideas coming from particle physics is the concept of mirror\nmatter. Mirror matter is a new form of matter which is predicted to exist if mirror\nsymmetry is respected by nature. At the present time evidence that mirror matter actually\nexists is in abundance, coming from a range of observations and experiments in astronomy,\nparticle physics, meteoritics and planetary science.\n\n∗\n\nFor a postscript version containing all figures see http : //www.ph.unimelb.edu.au/∼f oot/rev.ps\n\n0\n\n\f1\n\nIntroduction\n\nPrior ∗ to 1957 scientists believed that mirror reflection symmetry was respected by the\ninteractions of the fundamental particles. Why? Perhaps because the other geometrical\nsymmetries such as rotations and translations in space and time were observed to be good\nsymmetries, it seemed natural that mirror reflection symmetry should be a good symmetry\ntoo. Furthermore, no experiment up until 1957 had indicated that these symmetries were\nanything but good symmetries of nature.\nIn 1956 Lee and Yang[2] proposed that the interactions of the fundamental particles\nwere not mirror reflection invariant. They suggested that this could explain some known\npuzzles and proposed some new experiments to directly test the idea. Subsequently\nMadam C.S.Wu and collaborators dramatically confirmed that the interactions of the\nknown particles were not mirror symmetric, just as Lee and Yang had suspected.\nToday, it is widely believed that mirror symmetry is in fact violated in nature. God\n– it is believed – is left-handed. Actually, though, things are not so clear. What the\nexperiments in 1957 and subsequent experiments have conclusively demonstrated is that\nthe known elementary particles behave in a way which is not mirror symmetric. The weak\nnuclear interaction is the culprit, with the asymmetry being particularly striking for the\nweakly interacting neutrinos. For example, today we know that neutrinos only spin with\none orientation. If one was coming towards you it would be spinning like a left-handed\ncorkscrew. Nobody has ever seen a right-handed neutrino.\nThe basic geometric point is illustrated in the following diagram:\n\nNature's Mirror\n\nThe left-hand side of this figure represents the interactions of the known elementary\nparticles. The forces are mirror symmetric like a perfect sphere, except for the weak\ninteraction, which is represented as a left hand. Also shown is nature's mirror - the\nvertical line down the middle. Clearly, the reflection is not the same as the original,\nsignifying the fact that the interactions of the known particles are not mirror symmetric.\nIf there were a right hand as well as a left hand then mirror symmetry would be unbroken.\n\nThe aim of this article is to provide a fairly non-technical and up to date review of the motivations\nfor mirror matter and the evidence for its existence. For a more detailed and (hopefully) entertaining\nexposition see the recent book[1].\n∗\n\n1\n\n\fHowever, this doesn't correspond to nature since no right-handed weak interactions are\nseen in experiments (this is precisely what the experiments in 1957 and subsequently have\nproven).\nThere are two remaining possibilities: We can either chop the hand off – but this is\ntoo drastic and is therefore not shown. It corresponds to having no weak interactions at\nall, again in disagreement with observations. This last possibility is the most subtle and\nconsists of adding an entire new figure with the hand on the other side. Everything is\ndoubled even the symmetric part, which is clearly mirror symmetric as indicated in the\nfollowing diagram:\n\nWhat this figure corresponds to is a complete doubling of the number of particles. For\neach type of particle, such as electron, proton and photon, there is a mirror twin. Where\nthe ordinary particles favor the left hand, the mirror particles favor the right hand. If such\nparticles exist in nature, then mirror symmetry would be exactly conserved (we denote\nthe mirror particles with a prime).\n\nn\n\nn\n\nn\n\nn\n\nW, Z\n\nW, Z\n\nAs will be discussed, the mirror particles can exist without violating any known experiment. Thus, the correct statement is that the experiments in 1957 and subsequently have\nonly shown that the interactions of the known particles are not mirror symmetric, they\nhave not demonstrated that mirror symmetry is broken in nature.\nWhile many people regard the possible existence of mirror particles as highly speculative, it could also be argued that the assumption of broken mirror symmetry is equally\n2\n\n\fspeculative. Clearly, it is not possible to figure out which path is chosen by nature on the\nbasis of pure thought. What really needs to be done is to understand the experimental\nimplications of the existence of mirror particles and find out whether such things could\ndescribe our Universe.\nThe mirror partners have the same mass as their ordinary counterparts, which is\nreminisant of anti-particles. However, there is a crucial difference. Unlike anti-particles,\nthe mirror particles interact with ordinary particles predominately by gravity only. The\nthree non-gravitational forces act on ordinary and mirror particles completely separately\n[and with opposite handedness: where the ordinary particles are left-handed, the mirror\nparticles are right-handed]. For example, while ordinary photons interact with ordinary\nmatter (which is just the microscopic picture of the electromagnetic force), they do not\ninteract with mirror matter∗ . Similarly, the 'mirror image' of this statement must also\nhold, that is, the mirror photon interacts with mirror matter but does not interact with\nordinary matter. The upshot is that we cannot see mirror photons because we are made\nof ordinary matter. The mirror photons would simply pass right through us without\ninteracting at all!\nThe mirror symmetry does require though that the mirror photons interact with mirror\nelectrons and mirror protons in exactly the same way in which ordinary photons interact\nwith ordinary electrons and ordinary protons. A direct consequence of this is that a mirror\natom made from mirror electrons and a mirror nucleus, composed of mirror protons and\nmirror neutrons can exist. In fact, mirror matter made from mirror atoms would also exist\nwith exactly the same internal properties as ordinary matter, but would be completely\ninvisible to us! Clearly, if there was a negligible amount of mirror matter in our solar\nsystem, we might hardly be aware of its existence at all. Thus, the apparent left-right\nasymmetry of the laws of nature may be due to the preponderance of ordinary matter in\nour solar system rather than due to a fundamental asymmetry in the laws themselves.\nWhile this is all very interesting, the most remarkable thing of all is that there is now\na range of evidence actually supporting the mirror matter theory:\n1) It predicts the existence of mirror matter in the Universe. Mirror matter would be\ninvisible, making its presence felt by its gravitational effects. Remarkably, there is a large\nbody of evidence for such invisible 'dark' matter. There is also specific evidence that\nmirror stars have been observed from their gravitational effects on the bending of light\nfrom background stars.\nOn the quantum level, small new fundamental interactions connecting ordinary and mirror\nmatter are possible. Various theoretical constraints suggest only a few possible types of\ninteractions: photon-mirror photon kinetic mixing and neutrino-mirror neutrino mass\nmixing[3, 4]. Such non-gravitational forces are extremely important and open up new\nways in which to test the theory:\n2) Orthopositronium should have a shorter effective lifetime (in a \"vacuum\" experiment)\nthan predicted due to the effects of photon - mirror photon kinetic mixing[5, 6].\n3) If there are small mirror matter bodies in our solar system then this would lead to\nActually, as will be explained in a moment, it is possible for small new forces to exist which connect the\nordinary and mirror particles together. For the purposes of this introductory paragraph, this possibility\nis temporarily ignored.\n∗\n\n3\n\n\fa new class of cosmic impact events when such bodies strike the Earth. Characteristics\nof such impacts will be the lack of ordinary fragments and other anomalous features.\nSuch impacts will leave mirror matter embedded in the ground which could potentially\nbe extracted and purified (assuming that the small photon-mirror photon kinetic mixing\nforce exists, which is strong enough to oppose the Earth's feeble gravity).\n4) If there is some remnant mirror hydrogen gas in our solar system, then spacecraft will\nexperience a drag force and slow down.\n5) If neutrinos have mass then oscillations between ordinary and mirror neutrinos can\noccur. Such effects could show up in neutrino physics experiments.\nAt the present time there is interesting experimental/observational evidence supporting all five of these predictions. We now describe this evidence in more detail.\n\n2\n\nImplications of the mirror world for cosmology\n\nThere is strong evidence for a large amount of dark matter in the Universe. Flat rotation\ncurves of stars in spiral galaxies imply that there must exist invisible halos in galaxies\nsuch as our own Milky Way.\n\nThe observed orbiting velocities of stars in the spiral galaxy M33 superimposed on\nits optical image. The horizontal axis is the distance from the center of the galaxy\nin kiloparsecs. The poor agreement between the expected velocities and the actual\nones provides strong evidence for invisible 'dark matter'. [Credit for this figure\nbelongs to Ref.[7]].\n\nThere is also strong evidence that this dark matter must be something exotic: ordinary\nbaryons simply cannot account for it[8]. Mirror baryons are necessarily stable and dark\n4\n\n\f(because the coupling of mirror matter to ordinary photons is necessarily very small)\nand are a very natural candidate for the inferred dark matter in the Universe∗ . This\nhas been argued for some time by Sergei Blinnikov and Maxim Khlopov[9]. In fact\ndark matter made of mirror matter would have the property of clumping into compact\nbodies such as mirror stars. This leads naturally to an explanation for the mysterious\nMassive Astrophysical Compact Halo Objects (or MACHO's) inferred by the MACHO\ncollaboration.\nThis collaboration has been studying the nature of halo dark matter by using the\ngravitational microlensing technique. This Australian-American experiment has collected\n5.7 years of data and provided statistically strong evidence for dark matter in the form\nof invisible star sized objects which is what you would expect if there was a significant\namount of mirror matter in our galaxy. The MACHO collaboration [10] have done a\nmaximum likelihood analysis which implies a MACHO halo fraction of 20% for a typical\nhalo model with a 95% confidence interval of 8% to 50%. Their most likely MACHO\nmass is between 0.15M⊙ and 0.9M⊙ depending on the halo model. These observations\nare consistent with a mirror matter halo because the entire halo would not be expected\nto be in the form of mirror stars. Mirror gas and dust would also be expected because\nthey are a necessary consequence of stellar evolution and should therefore significantly\npopulate the halo.\nIf mirror matter exists in our galaxy, then binary systems consisting of ordinary and\nmirror matter should also exist. While systems containing approximately equal amounts\nof ordinary and mirror matter are unlikely due to e.g. differing rates of collapse for\nordinary and mirror matter (due to different initial conditions such as chemical composition, temperature distribution etc), systems containing predominately ordinary matter\nwith a small amount of mirror matter (and vice versa) should exist. Remarkably, there\nis interesting evidence for the existence of such systems coming from extra-solar planet\nastronomy.\nIn the past few years more than 100 \"extrasolar\" planets have been discovered orbiting\nnearby stars[11]. They reveal their presence because their gravity tugs periodically on their\nparent stars leading to observable Doppler shifts. In one case, the planet HD209458b, has\nbeen observed to transit its star allowing for an accurate determination of its size and\nmass. One of the surprising characteristics of the extrasolar planets is that there are a\nclass of large (∼ MJupiter ) close-in planets (with a typical orbital radius of ∼ 0.05 A.U.,\nthat is, about 8 times closer than the orbital radius of Mercury). Ordinary (gas giant)\nplanets are not expected to form close to stars because the high temperatures do not allow\nthem to form. Theories have been invented where they form far from the star where the\ntemperature is much lower, and migrate towards the star.\nA fascinating alternative possibility presents itself in the mirror world hypothesis. The\nclose-in planets may be mirror worlds composed predominately of mirror matter[12]. They\ndo not migrate significantly, but actually formed close to the star which is not a problem\nNote that various observations indicate that the amount of dark matter is more than 10 times the\namount of ordinary matter in the Universe. This is not a problem for the mirror matter theory because a\nmirror symmetric microscopic theory does not actually imply equal numbers of ordinary and mirror atoms\nin the Universe. The point is that the initial conditions need not be mirror symmetric. The Universe\ncould have been created with more mirror matter than ordinary matter; alternatively it is possible that\nthe macroscopic asymmetry was generated during the early evolution of the Universe.\n∗\n\n5\n\n\ffor mirror worlds because they are not significantly heated by the radiation from the star.\nThis hypothesis can explain the opacity of the transiting planet HD209458b because\nmirror worlds would accrete ordinary matter from the solar wind which accumulates in\nthe gravitational potential of the mirror world. It turns out that the effective radius of\nordinary matter depends relatively sensitively on the mass of the planet, so that this\nmirror world hypothesis can be tested when more transiting planets are discovered.\nIf this mirror world interpretation of the close-in planets is correct then it is very\nnatural that the dynamical mirror image system of a mirror star with an ordinary planet\nwill also exist. Such a system would appear to ordinary observers as an \"isolated\" ordinary\nplanet. Remarkably, such \"isolated\" planets have recently been identified in the σ Orionis\nstar cluster[13]. These planets have estimated mass of 5 − 15MJupiter (planets lighter than\nthis mass range would be too faint to have been detected at present) and appear to be gas\ngiants which do not seem to be associated with any visible star. Given that the σ Orionis\ncluster is estimated to be less than 5 million years old, the formation of these \"isolated\"\nplanets must have occurred within this time (which means they can't orbit faint stellar\nbodies such as old white dwarfs). Zapatero Osorio et al[13] argue that these findings pose\na challenge to conventional theories of planet formation which are unable to explain the\nexistence of numerous isolated planetary mass objects. Thus the existence of these planets\nis surprising if they are made of ordinary matter, however there existence is natural from\nthe mirror world perspective[14]. Furthermore, if the isolated planets are not isolated but\norbit mirror stars then there must exist a periodic Doppler shift detectable on the spectral\nlines from these planets. This represents a simple way of testing this hypothesis[14].\n\n3\n\nImplications of the mirror world for positronium\n\nThere are only a few possible ways in which ordinary and mirror matter can interact with\neach other besides gravity, including: photon - mirror photon kinetic mixing and neutrino\n- mirror neutrino mass mixing (if neutrinos have mass).\nPhoton - mirror photon kinetic mixing is described in quantum field theory by the\nLagrangian term:\n′\nLint = ǫF μν Fμν\n(1)\n\nwhere F μν ≡ ∂ μ Aν −∂ ν Aμ is the usual Field strength tensor, and the F ′ is the corresponding quantity for mirror photons. It corresponds to a small coupling between ordinary and\nmirror photons. In the language of Feynman diagrams it is represented by:\n\nIn the absence of any photon-mirror photon kinetic mixing interaction, an ordinary elec6\n\n\ftron cannot interact with a mirror electron because ordinary photons do not interact with\nmirror electrons (and mirror photons do not interact with ordinary electrons). However,\nif there is a photon-mirror photon kinetic mixing interaction, then an ordinary electron\ncan interact with a mirror electron:\n\nThe net effect of the photon-mirror photon mixing is to make mirror electrons interact\nslightly with ordinary electrons (and similarly for other charged particles). That is, mirror\nelectrons behave as if they have a tiny ordinary electric charge. The size of the effect\ndepends on the strength of the photon-mirror photon kinetic mixing interaction – which\nis characterised by the parameter ǫ.\nIt turns out that the most important experimental implication of photon - mirror\nphoton kinetic mixing is a rather subtle modification of the orthopositronium lifetime[5].\nOrthopositronium is the bound state composed of an electron and positron where the\nspins of both particles are aligned so that the bound state has spin 1. The ground state of\northopositronium (o-Ps) decays predominately into 3 photons. The decay rate has been\ncomputed in QED leading to a discrepancy with some of the experimental measurements.\nSome of the measurements find a faster decay rate than theoretically predicted. This\ndiscrepancy has led to a number of experimental searches for exotic decay modes, including\na stringent limit on invisible decay modes[15].\nThe modification of the lifetime predicted in the mirror matter theory occurs because\nthe kinetic mixing of the photon with the mirror photon generates a small off-diagonal\northopositronium mass leading to oscillations between orthopositronium and mirror orthopositronium. The orthopositronium produced in the experiment oscillates into its\nmirror partner, whose decays into three mirror photons are undetected. This effect only\noccurs in a vacuum experiment where collisions of the orthopositronium with background\nparticles can be neglected. Collisions with background particles will destroy the quantum\ncoherence necessary for oscillations to occur. Thus, experiments with large collisions rates\nremain unaffected by kinetic mixing and the lifetime of orthopositronium will be the same\nas predicted by QED. Experiments in vacuum on the other hand, should show a slight increase in the decay rate, as oscillations into mirror orthopositronium and their subsequent\n7\n\n\finvisible decays effectively reduce the number of orthopositronium states faster than QED\npredicts.\nThe two most accurate experimental results, normalized to the theoretical QED\nprediction[16] are given in the table below ∗\nReference\nΓoP s (exp)/ΓoP s (theory)\nAnn Arbor[20] 1.0012 ± 0.0002\nTokyo[19]\n1.0000 ± 0.0004\n\nMethod\nVacuum Cavity\nPowder\n\nΓcoll\n∼ (3 − 10)ΓoP s\n∼ 104 ΓoP s\n\nThus, we see that the Tokyo experiment agrees with the QED prediction while the Ann\nArbor vacuum experiment disagrees at about 5 sigma. These results can be explained in\nthe mirror matter model by observing that the large collision rate of the orthopositronium in the Tokyo experiment will render oscillations of orthopositronium with its mirror\ncounterpart ineffective∗∗ , while the larger decay rate obtained in the vacuum cavity experiment can be explained because of the much lower collision rate of orthopositronium\nin this experiment allows the oscillations of ordinary to mirror orthopositronium to take\neffect[6]. Clearly, an experiment with a larger cavity should have an even larger effect.\nSeveral new experiments are now being done which will test for this effect and either\nconfirm (or refute) the mirror world explanation.\n\n4\n\nAnomalous Earth impact events\n\nThere is not much room for a large amount of mirror matter in our solar system. For\nexample, the amount of mirror matter within the Earth has been constrained to be less\nthan 10−3 MEarth [21]. However, we don't know enough about the formation of the solar\nsystem to be able to exclude the existence of a large number of Space Bodies (SB) made\nof mirror matter if they are small like comets and asteroids. The total mass of asteroids\nin the asteroid belt is estimated to be only about 0.05% of the mass of the Earth. A\nsimilar or even greater number of mirror bodies, perhaps orbiting in a different plane or\neven spherically distributed like the Oort cloud is a fascinating possibility∗∗∗ . [Maybe the\nOort cloud itself is composed predominately of mirror matter bodies, see section 5].\nIf such small mirror matter bodies exist and happen to collide with the Earth, what\nwould be the consequences? If the only force connecting mirror matter with ordinary\nmatter is gravity, then the consequences would be minimal. The mirror matter spacebody would simply pass through the Earth and nobody would know about it unless the\nbody was so heavy as to gravitationally affect the motion of the Earth. However, if\nthere is a photon-mirror photon transition force as suggested by the orthopositronium\nexperiments, then the mirror nuclei can interact with the ordinary nuclei, as illustrated\non the following page.\nA third experiment with gas[17] also has an anomalously high decay rate, however there appears to be\nlarge systematic uncertainties because the orthopositronium is not thermalized in this experiment[18, 19].\n∗∗\nThe experimental limit[15] for invisible decay modes also does not exclude this mirror world oscillation\nmechanism because the collision rate of the orthopositronium was very high in those experiments.\n∗∗∗\nLarge planetary sized bodies are also possible if they are in distant orbits[22] or masquerade as\nordinary planets or moons by accreting ordinary matter onto their surfaces.\n∗\n\n8\n\n\fp\np\n\np\np\nMirror proton from a mirror\natom in the space-body\n\nProton from an\nair molecule\n\nScattering of air as it passes though the mirror matter space-body.\n\nIn other words, the nuclei of the mirror atoms of the space-body will undergo Rutherford\nscattering with the nuclei of the atmospheric nitrogen and oxygen atoms. In addition,\nionizing interactions can occur (where electrons are removed from the atoms) which can\nionize both the mirror atoms of the space-body and also the (ordinary) atmospheric atoms.\nThis would make the mirror matter space-body effectively visible as it plummets to the\nsurface of our planet.\nThe rate at which the kinetic energy of a space-body composed of mirror matter loses\nenergy through the air depends on a number of factors, including, the strength of the\nphoton-mirror photon transition force (ǫ), the chemical composition of the space-body,\nits initial velocity and its size and shape. We could estimate the initial velocity of the\nspace-body by observing that the velocity of the Earth around the Sun is about 30 km/s.\nThe space-body should have a similar velocity so that depending on its direction, the\nrelative velocity of the space-body when viewed from Earth would be expected to be\nbetween about 11 and 70 km/s ∗ .\n>\nIt turns out that for ǫ ∼ 10−8 (which includes the value ǫ ≃ 10−6 suggested by the\northopositronium experiments) the air molecules typically undergo many collisions within\nthe mirror matter space-body. One important consequence of this is that the air resistance\n(or atmospheric 'drag force') of the mirror matter space-body is actually roughly the same\nas if it were made of ordinary matter. The air resistance will 'stop' a space-body in the\natmosphere if it is small in size (roughly less than 10 meters in diameter) leaving it with\na free fall velocity of ∼ 0.3 km/s. On the other hand, for a large body, much bigger than\n10 meters in diameter, it will not lose much of its comic velocity in the atmosphere if it\nremains intact.\nThere are important differences between impacting ordinary and mirror matter spaceThe minimum velocity of a space-body as viewed from Earth is not zero because of the effect of the\nlocal gravity of the Earth. It turns out that the minimum velocity of a space-body is about 11 km/s, for\na body in an independent orbit around the sun (and a little less if there happened to be a body in orbit\naround the Earth).\n∗\n\n9\n\n\fbodies. A mirror body would heat up internally from the interactions of the atmospheric\natoms which would penetrate within the space-body. This is quite unlike that of an\nordinary body which would heat up only from the friction on the surface. This means that\nsmall mirror matter bodies can have initially low rates of ablation (i.e. surface melting)\nand therefore be quite dim at high altitudes. If they are made of non-volatile mirror\nmaterial (such as mirror iron) they can reach the ground without melting and vaporizing\nin the atmosphere. Remarkably such types of events are actually seen in nature.\n\nSome examples of anomalous small fireballs\nThere are many reported examples of atmospheric phenomena resembling fireballs,\nwhich cannot be due to the penetration of an ordinary meteoroid into the atmosphere\n(for a review of bolides, including discussion of these anomalous events, see Ref.[23]).\nBelow we discuss several examples of this strange class of phenomena.\n(i) The Spanish event – January 18, 1994.\nOn the early morning of 1994 January 18, a very bright luminous object crossed the sky\nof Santiago de Compostela, Spain. This event has been investigated in detail in Ref.[24].\nThe eye witnesses observed the object to be low in altitude and velocity (1 to 3 km/s).\nYet, an ordinary body penetrating deep into the atmosphere should have been quite large\nand luminous when it first entered the atmosphere at high altitudes with large cosmic\nvelocity (between 11 and 70 km/s). An ordinary body entering the Earth's atmosphere\nat these velocities always undergoes significant ablation as the surface of the body melts\nand vapourises, leading to a rapid diminishing of the bodies size and also high luminosity\nas the ablated material is heated to high temperature as it dumps its kinetic energy\ninto the surrounding atmosphere. Such a large luminous object would have an estimated\nbrightness which would supersede the brightness of the Sun, observable at distances of\nat least 500 km. Sound phenomena consisting of sonic booms should also have occurred.\nRemarkably neither of these two expected phenomena were observed for this event. The\nauthors of Ref.[24] concluded that the object could not be a meteoric fireball.\nIn addition, within a kilometer of the projected end point of the \"object's\" trajectory\na \"crater\" was later discovered. The \"crater\" had dimensions 29 m ×13 m and 1.5\nm deep. At the crater site, full-grown pine trees were thrown downhill over a nearby\nroad. Unfortunately, due to a faulty telephone line on the 17th and 18th of January (the\nfireball was seen on the 18th ) the seismic sensor at the nearby geophysical observatory of\nSantiago de Compostela was inoperative at the crucial time. After a careful investigation,\nthe authors of Ref.[24] concluded that the crater was most likely associated with the\nfireball event, but could not definitely exclude the possibility of a landslide. No meteorite\nfragments or any other unusual material was discovered at the crater site.\n(ii) The Jordan event – April 18, 2001.\nOn Wednesday 18th April 2001, more than 100 people attending a funeral procession\nsaw a low altitude and low velocity fireball. In fact, the object was observed to break up\ninto two pieces and each piece was observed to hit the ground. The two impact sites were\nlater examined by members of the Jordan Astronomical Society. The impact sites showed\nevidence of energy release (broken tree, half burnt tree, sheared rocks and burnt ground)\n\n10\n\n\f.\n\nFigure Jordan1.jpg\n\nFigure Jordan2.jpg\nPictures of the Jordan impact site[25]\n\nbut no ordinary crater. [This may have been due, in part, to the hardness of the ground\nat the impact sites]. No meteorite fragments were recovered despite the highly localized\nnature of the impact sites and low velocity of impact. For more of the remarkable pictures\nand more details, see the Jordan Astronomical Society's report[25]. As with the 1994\nSpanish event (i), the body was apparently not observed by anyone when it was at high\naltitudes where it should have been very bright. Overall, this event seems to be broadly\nsimilar to the 1994 spanish event (i). For the same reasons discussed in (i) (above) it\ncould not be due to an ordinary meteoric fireball.\nIf these anomalous events are due to the impact of a mirror matter space-body, then\nthe implications are extremely important. In particular there should be large pieces of\nmirror matter still lodged in the ground at the impact sites. The important point is that\nthe small photon-mirror photon transition force should be large enough to oppose the\nforce of gravity∗ . Clearly an important issue is to develop ways of testing for the presence\nof mirror matter at these sites. Several ideas have been proposed:\n∗\nTechnically, there are two quite distinct cases, depending on the sign of ǫ. (The orthopositronium\nexperiments do not provide any information on the sign of ǫ). Either the photon-mirror photon mixing\ninduces a small ordinary electric charge for the mirror electrons (ǫe) of the same sign as the ordinary\nelectrons, or the sign is opposite. In the first case, the photon-mirror photon mixing force leads to\nelectrostatic repulsion between the mirror atoms (of the mirror matter fragment) and the ordinary atoms\nin the earth. In the alternative case of negative ǫ, there is actually electrostatic attraction between\nordinary and mirror atoms. In both cases though, the interactions should be strong enough to stop a\npiece of mirror matter from falling through the Earth. However an important difference between the two\ncases is that in the first case (ǫ > 0) the repulsion will cause mirror matter fragments to remain on or near\nthe surface, largely unmixed with ordinary matter, while in the second case (ǫ < 0) the mirror matter\nwill penetrate the earth (a few metres perhaps) becoming completely mixed in with ordinary matter, and\nreleasing energy in the process. Maybe this was the cause of the energy release evident at the Jordan\nimpact sites (c.f. above figures).\n\n11\n\n\f• Thermal effects of the mirror matter. Mirror matter can absorb heat from the\nsurrounding ordinary matter (through the photon-mirror photon kinetic mixing interaction) and radiate it away into invisible mirror photons. This will effectively\ncool the ordinary matter, an effect which could be measured.\n• The presence of mirror matter fragments embedded in ordinary matter. Mirror\nmatter, although essentially chemically inert, still has mass. In principle it could\nbe extracted and purified, although the most efficient way of doing this is not yet\nknown.\n• Heavy element bound-states. Heavy mirror elements can actually form bound-states\nwith ordinary heavy elements (e.g. F e − F e′ , F e − P b′ etc)[26]. These would appear\nas anomalously heavy elements which could show up in careful mass spectrometer\nstudies.\nFinally, let me also mention that a large mirror matter body may have been responsible\nfor the Tunguska event. For more details of this mirror matter interpretation of the\nanomalous small meteoritic events and also application to the Tunguska event, See Ref.[27,\n1].\n\nFigure tunguska.jpg\nFelled trees as seen by Kulik during his 1928 Tunguska expedition.\n\n5\n\nComets, atmospheric anomalies and pioneer spacecraft\n\nIf mirror matter space-bodes do exist in our solar system, then one might expect other\nscientific implications. In order not to bore the reader too much, I will mention only a\nfew of these things – and only very briefly.\n\n5.1\n\nAre comets made of mirror matter?\n\nComets are believed to originate from an approximately spherically symmetric cloud extending out about half way to the nearest star. This comet cloud, called the Oort cloud,\nis reminisant of the dark halo of our galaxy. Both are largely invisible, are distributed\ndifferently to the 'visible' matter, and are also hypothetical. Of course, this anology is\nvery simplistic and should not be taken very seriously. Nevertheless, it is also true that\nComets seem to have a number of puzzling features and are not altogether well understood. One interesting feature of comets is that they seem to contain a very dark nucleus,\nas shown in the picture of comet Halley.\n12\n\n\f.\n\nFigure halley.gif\nComet Halley's Nucleus. This picture was taken by the spacecraft Giotto. Contrary\nto prior expectations, Halley's nucleus is very dark – one of the darkest objects in\nthe solar system. Credit: Halley Multicolour Camera Team, ESA.\n\nIts nucleus has an albedo of only 0.03 making it one of the darkest objects in the solar\nsystem – darker even than coal! This has led me to wonder whether the nucleus could\nbe composed predominately of mirror matter. Of course, pure mirror matter would be\ntransparent, but if it contained a small admixture of ordinary matter embedded within, it\ncould appear opaque and dark. If the ordinary matter had a volatile component such as\nwater ice, then this would explain the large head and tail observed when the comet passed\nclose to the sun. Such a picture would also be consistent with observations suggesting\nthat many comets lose a large factor (100-1000) in average brightness after approaching\nthe sun for the first time. If this interpretation is correct, then comets may simply\nbecome dimmer and dimmer over time eventually losing all of their volatile ordinary\nmatter component. They may effectively become invisible. Of course, the rate that this\noccurs may depend on many things such as the proportion of ordinary to mirror matter,\nthe chemical composition, details of the orbit etc.\nInterestingly, a recent study[28] has concluded that many old comets must have either\nbecome invisible or have somehow disintegrated. The number of cometary remnants\n(asteroid-like objects) is 100 times less abundant than theoretically expected![28]. Clearly,\nthis seems to support (or at least, encourage) the mirror matter interpretation of the\ncomets. Of course, if many comets are predominately made of mirror matter then this\nfits in nicely with the mirror matter interpretation of the anomalous small fireballs (and\nTunguska event), which was discussed in section 4. It might also be connected with\natmospheric anomalies, as will now be discussed.\n\n5.2\n\nAtmospheric anomalies caused by small mirror matter spacebodies?\n\nTo explain the anomalous small fireball events we require the mirror matter space-body\nto survive and hit the ground without completely melting and vaporizing. Detailed\nstudies[27] have shown that this is possible for initial velocities near the minimum (∼\n11 km/s) and also for non-volatile mirror matter (such as mirror iron). A mirror spacebody composed of volatile material such as mirror water ice would be expected to heat up\n13\n\n\f>\n\nenough to completely vaporize in the atmosphere (unless it was very large ∼ 10 meters in\ndiameter). After vaporizing, the mirror atoms interact with the air atoms by Rutherford\nscattering. Although initially the mirror matter will heat up the ordinary matter because\nof its large kinetic energy (since its initial velocity is at least 11 km/s), after a short time,\nthe mirror matter will cool the atmosphere. The mirror atoms will draw in heat from the\nsurrounding ordinary atoms and radiate it away into mirror photons. Since the mirror\natoms are not absorbing mirror photons from the environment, heat will be lost from the\nsystem. The net effect is a localized rapid cooling of the atmosphere which might lead to\nthe formation of unusual clouds and other strange atmospheric phenomena. Perhaps this\nmight explain the remarkable observations of falling ice blocks[29] and maybe even the\nobservations of atmospheric 'holes'[30].\n\n5.3\n\nAnomalous acceleration of the Pioneer spacecraft explained?\n\nAnother indication for mirror matter in our solar system comes from the Pioneer\n10 and 11 spacecraft anomalies. These spacecraft, which are identical in design, were\nlaunched in the early 1970's with Pioneer 10 going to Jupiter and Pioneer 11 going to\nSaturn. After these planetary rendezvous, the two spacecraft followed orbits to opposite\nends of the solar system with roughly the same speed, which is now about 12 km/s.\nThe trajectories of these spacecraft were carefully monitored by a team of scientists from\nthe Jet Propulsion Laboratory and other institutions[31]. The dominant force on the\nspacecraft is, of course, the gravitational force, but there is also another much smaller\nforce coming from the solar radiation pressure – that is, a force arising from the light\nstriking the surface of the spacecraft. However, the radiation pressure decreases quickly\nwith distance from the sun, and for distances greater than 20 AU it is low enough to allow\nfor a sensitive test for anomalous forces in the solar system. The Pioneer 11 radio system\nfailed in 1990 when it was about 30 AU away from the Sun, while Pioneer 10 is in better\nshape and is about 70 AU away from the Sun (and still transmitting!).\nThe Pioneer 10/11 spacecrafts are very sensitive probes of mirror gas and dust in\nour solar system if the photon-mirror photon transition force exists as suggested by the\northopositronium experiments. Collisions of the spacecraft with mirror particles will lead\nto a drag force which will slow the spacecraft down. This situation of an ordinary matter\nbody (the spacecraft) propagating though a gas of mirror particles is a sort of 'mirror\nimage' of a mirror matter space-body propagating through the atmosphere which was\nconsidered in the previous section.\nInterestingly, careful and detailed studies[31] of the motion of Pioneer 10 and 11 have\nrevealed that the accelerations of both spacecrafts are anomalous and directed roughly\ntowards the Sun, with magnitude, ap = (8.7 ± 1.3) × 10−8 cm/s2 . In other words, the\nspacecrafts are inexplicably slowing down! Many explanations have been proposed, but\nall have been found wanting so far. For example, ordinary gas and dust cannot explain\nit because there are rather stringent constraints on the density of ordinary matter in our\nsolar system coming from its interactions with the sun's light. However, the constraints\non mirror matter in our solar system are much weaker because of its invisibility as far as\nits interactions with ordinary light is concerned.\nIf this anomalous acceleration of the spacecraft is due to remnant mirror matter gas or\n14\n\n\fdust in our solar system, then calculations of Ray Volkas and myself[32] suggest a density\nof mirror matter in our solar system of about ≈ 4 × 10−19 g/cm3 . It corresponds to\nabout 200,000 mirror hydrogen atoms (or equivalent) per cubic centimetre. If the mirror\ngas/dust is spherically distributed with a radius of order 100 AU, then the total mass\nof mirror matter would be about that of a small planet (≈ 10−6 Msun ) with only about\n10−8 Msun within the orbit of Uranus, which is about two orders of magnitude within\npresent limits. If the configuration is disk-like rather than spherical, then the total mass\nof mirror matter would obviously be even less. The requirement that the mirror gas/dust\nbe denser than its ordinary counterpart at these distances could be due to the ordinary\nmaterial having been expelled by solar pressure...\n\n6\n\nImplications of the mirror world for neutrino physics\n\nIf neutrinos have mass, then it is possible for ordinary and mirror neutrinos to oscillate\ninto each other. Neutrino oscillations are a well known quantum mechanical effect which\narise when the flavour eigenstates are linear combinations of 2 or more mass eigenstates.\nFor example, if the electron and muon neutrinos have mass which mixes the flavour\neigenstates, then in general the weak eigenstates are orthogonal combinations of mass\neigenstates, i.e.\nνe = sin θν1 + cos θν2 , νμ = cos θν1 − sin θν2 .\n(2)\nA standard result is that the oscillation probability for a neutrino of energy E is then\nP (νμ → νe ) = sin2 2θ sin2 L/Losc ,\n\n(3)\n\nwhere L is the distance from the source and Losc ≡ 4E/δm2 is the oscillation length (and\nnatural units have been used, i.e. c = h/2π = 1). If sin2 2θ = 1 then the oscillations have\nthe greatest effect and this is called maximal oscillations.\nAnyway, in 1992 Henry Lew, Ray Volkas and I[4] found the remarkable result that\nthe oscillations between ordinary and mirror neutrinos are necessarily maximal which is a\ndirect consequence of the mirror symmetry. One way to see this is to note that if neutrinos\nmix then the mass eigenstates are non-degenerate and necessarily parity eigenstates if\nparity is unbroken. Considering the first generation electron\n√ neutrino, νe and its mirror\n′\n±\n′\npartner, νe , the parity eigenstates are simply ν = (νe ±νe )/ 2 (since parity interchanges\nthe ordinary and the mirror particles) and hence\nνe =\n\nν+ + ν− ′\nν+ − ν−\n√\n, νe = √\n.\n2\n2\n\n(4)\n\nComparing this with Eq.(2) we see that θ = π/4 i.e. sin 2θ = 1 and hence maximal\nmixing! Thus, if neutrinos and mirror neutrinos have mass and mix together then the\noscillations between the ordinary and mirror neutrinos are necessarily maximal.\nThis result is extremely interesting in view of the accumulated evidence for neutrino\noscillations (for a recent summary, see Ref.[33] and references there-in). Three types\nof experiments suggest the existence of neutrino oscillations and actually require the\nexistence of at least one new 'sterile neutrino' (i.e. non-interacting neutrino such as a\n15\n\n\fmirror neutrino) maximally mixed with one of the known neutrinos. However, more\nexperimental studies need to be done and are being done, so the situation in neutrino\nphysics will become clearer. Of course, it is possible that there is no detectable mirror\nworld effect for neutrinos, even if mirror matter exists. While the mixing is maximal, the\noscillation lengths depend on the details of the neutrino mass physics. In particular, in\nthe limit that the mass mixing between ordinary and mirror neutrinos goes to zero, the\neffect of the mirror world must also vanish.\n\n7\n\nConclusion\n\nIt is a known fact that almost every plausible symmetry (such as rotational invariance,\ntranslational invariance etc) are found to be exact symmetries of the particle interactions.\nThus, it would be very strange if the fundamental interactions were not mirror symmetric.\nIt is a very interesting observation that mirror symmetry requires the existence of a new\nform of matter called 'mirror matter', otherwise there is nothing to balance the left-handed\nnature of the weak force. Even more interesting, is the remarkable evidence that mirror\nmatter actually exists. But, does mirror matter really exist? I'm not sure, but I would\nvery much like to find out. Maybe the answer lies in Jordan or maybe it is blowing in the\nwind[34]...\n\nAcknowledgements\nIt is a pleasure to thank my collaborators, Sergei Gninenko, Sasha Ignatiev, Henry Lew,\nSaibal Mitra, Zurab Silagadze, Ray Volkas and T. L. Yoon. I would also like to acknowledge very useful correspondence from Sergei Blinnikov, Zdenek Ceplecha, Carl Feynman,\nLuigi Foschini, John Learned, Jesus Martinez-Friaz and Andrei Ol'khovatov.\n\nReferences\n[1] Shadowlands, quest for mirror matter in the Universe, R. Foot, Universal Publishers (2002). For other information and useful links, see also the mirror matter\nwebpage: http://www.ph.unimelb.edu.au/ foot/ (or the mirror matter mirror site,\nhttp://www.geocities.com/mirrorplanets).\n[2] T. D. Lee and C. N. Yang, Phys. Rev. 104, 256 (1956).\n[3] R. Foot, H. Lew and R. R. Volkas, Phys. Lett. B272, 67 (1991). The idea was earlier\nknown to Lee and Yang, see the last two paragraphs of Ref.[2] and a very useful\ncontribution was also made in I . Kobzarev, L. Okun and I. Pomeranchuk, Sov. J.\nNucl. Phys. 3, 837 (1966).\n[4] R. Foot, H. Lew and R. R. Volkas, Mod. Phys. Lett. A7, 2567 (1992).\n[5] S. L. Glashow, Phys. Lett. B167, 35 (1986).\n[6] R. Foot and S. N. Gninenko, Phys. Lett. B480, 171 (2000) [hep-ph/0003278].\n[7] D. Roy, physics/0007025.\n\n16\n\n\f[8] See e.g. K. Freese, B. Fields and D. Graff, astro-ph/9904401.\n[9] S. I. Blinnikov and M. Yu. Khlopov, Sov. J. Nucl. Phys. 36, 472 (1982); Sov. Astron.\n27, 371 (1983); E. W. Kolb, D. Seckel and M. S. Turner, Nature 514, 415 (1985);\nM. Yu. Khlopov et al., Soviet Astronomy 35, 21 (1991); H. M. Hodges, Phys. Rev.\nD47, 456 (1993); N. F. Bell and R. R. Volkas, Phys. Rev. D59, 107301 (1999) [astroph/9812301]; Z. K. Silagadze, Phys. At. Nucl. 60, 272 (1997) [hep-ph/953481]; S.\nBlinnikov, astro-ph/9801015; astro-ph/9902305; R. Foot, Phys. Lett. B452, 83 (1999)\n[astro-ph/9902065]; Z. Berezhiani, D. Comelli and F. Villante, Phys. Lett. B503, 362\n(2001) [hep-ph/0008105].\n[10] C. Alcock et al (Macho Collab), Ap.J.542, 281 (2000) [astro-ph/0001272].\n[11] For a review and references on extrasolar planets, see the extrasolar planet encyclopaedia: http://cfa-www.harvard.edu/planets/encycl.html\n[12] R. Foot, Phys. Lett. B471, 191 (1999) [astro-ph/9908276]; B505, 1 (2001) [astroph/0101055].\n[13] M. R. Zapatero Osorio et al., Science 290, 103 (2000). See also M. Tamura et al.,\nScience 282, 1095 (1998); P. W. Lucas and P. F. Roche, Mon. Not. R. Astron. Soc.\n314, 858 (2000).\n[14] R. Foot, A. Yu. Ignatiev and R. R. Volkas, Astropart. Phys. 17, 195 (2002) [astroph/0010502].\n[15] G. S. Atojan, S. N. Gninenko, V. I. Razin and Yu. V. Ryabov, Phys. Lett. B220, 317\n(1989); T. Mitsui et al., Phys. Rev. Lett. 70, 2265 (1993).\n[16] G. S. Adkins, R. N. Fell and J. Sapirstein, Phys. Rev. Lett. 84, 5086 (2000).\n[17] C. I. Westbrook et al., Phys. Rev. A40, 5489 (1989).\n[18] M. Skalsey et al., Phys. Rev. Lett. 80, 3727 (1998).\n[19] S. Asai, S. Orito and N. Shinohara, Phys. Lett. B357, 475 (1995).\n[20] J. S. Nico et al, Phys. Rev. Lett. 65, 1344 (1990).\n[21] A. Yu. Ignatiev and R. R. Volkas, Phys. Rev. D62, 023508 (2000) [hep-ph/0005125].\n[22] Z. K. Silagadze, Acta. Phys. Pol. B32, 99 (2001) [hep-ph/0002255]; R. Foot and Z.\nK. Silagadze, Acta. Phys. Pol. B32, 2271 (2001) [astro-ph/0104251]; Z. K. Silagadze,\nastro-ph/0110161.\n[23] Z. Ceplecha et al., Meteoroids 1998, Astron. Inst., Slovak. Acad. Sci., Bratislava,\n1999, pp 37-54.\n[24] J. A. Docobo, R. E. Spalding, Z. Ceplecha, F. Diaz-Fierros, V. Tamazian and Y.\nOnda, Meteoritics & Planetary Science 33, 57 (1998).\n[25] http://www.jas.org.jo/mett.html\n[26] R. Foot and S. Mitra, hep-ph/0204256.\n17\n\n\f[27] R. Foot, Acta Phys. Pol. B32, 3133 (2001) [hep-ph/0107132]; R. Foot and T. L. Yoon,\nActa Phys. Pol. B33, 1979 (2002) [astro-ph/0203152].\n[28] H. Levison et al, Science 296 (2002).\n[29] http://tierra.rediris.es/megacryometeors/index2.html and J. Martinez-Frias et al,\nCompositional Heterogeneity of Hailstones: Atmospheric Conditions and Possible\nEnvironmental Implications, Ambio Vol. 30 (2001). See also\nhttp://www.geocities.com/olkhov/gr1997.htm where an interesting catalogue of\nmany strange atmospheric events (of unknown origin) is given.\n[30] http://smallcomets.physics.uiowa.edu/\nNote that the idea that mirror matter might be responsible for these atmospheric\nholes was suggested to me by Stephen Heyer.\n[31] J. D. Anderson et al., Phys. Rev. D65, 082004 (2002) [gr-qc/0104064].\n[32] R. Foot and R. R. Volkas, Phys. Lett. B517, 13 (2001) [hep-ph/0108051].\n[33] R. Foot and R. R. Volkas, hep-ph/0204265.\n[34] B. Dylan, Public communication.\n\n18\n\n\fThis figure \"halley.gif\" is available in \"gif\" format from:\nhttp://arxiv.org/ps/hep-ph/0207175v1\n\n\fThis figure \"jordan1.jpg\" is available in \"jpg\" format from:\nhttp://arxiv.org/ps/hep-ph/0207175v1\n\n\fThis figure \"jordan2.jpg\" is available in \"jpg\" format from:\nhttp://arxiv.org/ps/hep-ph/0207175v1\n\n\fThis figure \"tunguska.jpg\" is available in \"jpg\" format from:\nhttp://arxiv.org/ps/hep-ph/0207175v1\n\n\f"}