{"id": "http://arxiv.org/abs/hep-ph/0610107v2", "guidislink": true, "updated": "2007-02-26T06:36:41Z", "updated_parsed": [2007, 2, 26, 6, 36, 41, 0, 57, 0], "published": "2006-10-10T06:58:40Z", "published_parsed": [2006, 10, 10, 6, 58, 40, 1, 283, 0], "title": "Light Cone Quantization and Savvidy Instability in Dense Quark Matter", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0610087%2Chep-ph%2F0610204%2Chep-ph%2F0610062%2Chep-ph%2F0610251%2Chep-ph%2F0610092%2Chep-ph%2F0610423%2Chep-ph%2F0610066%2Chep-ph%2F0610267%2Chep-ph%2F0610296%2Chep-ph%2F0610284%2Chep-ph%2F0610264%2Chep-ph%2F0610362%2Chep-ph%2F0610231%2Chep-ph%2F0610157%2Chep-ph%2F0610312%2Chep-ph%2F0610039%2Chep-ph%2F0610324%2Chep-ph%2F0610334%2Chep-ph%2F0610021%2Chep-ph%2F0610261%2Chep-ph%2F0610295%2Chep-ph%2F0610142%2Chep-ph%2F0610375%2Chep-ph%2F0610413%2Chep-ph%2F0610051%2Chep-ph%2F0610118%2Chep-ph%2F0610031%2Chep-ph%2F0610239%2Chep-ph%2F0610205%2Chep-ph%2F0610072%2Chep-ph%2F0610190%2Chep-ph%2F0610278%2Chep-ph%2F0610056%2Chep-ph%2F0610319%2Chep-ph%2F0610183%2Chep-ph%2F0610079%2Chep-ph%2F0610365%2Chep-ph%2F0610045%2Chep-ph%2F0610071%2Chep-ph%2F0610088%2Chep-ph%2F0610269%2Chep-ph%2F0610098%2Chep-ph%2F0610058%2Chep-ph%2F0610297%2Chep-ph%2F0610433%2Chep-ph%2F0610016%2Chep-ph%2F0610318%2Chep-ph%2F0610286%2Chep-ph%2F0610143%2Chep-ph%2F0610203%2Chep-ph%2F0610276%2Chep-ph%2F0610015%2Chep-ph%2F0610232%2Chep-ph%2F0610189%2Chep-ph%2F0610227%2Chep-ph%2F0610061%2Chep-ph%2F0610137%2Chep-ph%2F0610182%2Chep-ph%2F0610294%2Chep-ph%2F0610427%2Chep-ph%2F0610373%2Chep-ph%2F0610070%2Chep-ph%2F0610415%2Chep-ph%2F0610107%2Chep-ph%2F0610147%2Chep-ph%2F0610411%2Chep-ph%2F0610273%2Chep-ph%2F0610096%2Chep-ph%2F0610195%2Chep-ph%2F0610103%2Chep-ph%2F0610120%2Chep-ph%2F0610068%2Chep-ph%2F0610011%2Chep-ph%2F0610200%2Chep-ph%2F0610110%2Chep-ph%2F0610141%2Chep-ph%2F0610349%2Chep-ph%2F0610078%2Chep-ph%2F0610274%2Chep-ph%2F0610288%2Chep-ph%2F0610150%2Chep-ph%2F0610174%2Chep-ph%2F0610001%2Chep-ph%2F0610185%2Chep-ph%2F0610397%2Chep-ph%2F0610024%2Chep-ph%2F0610161%2Chep-ph%2F0610117%2Chep-ph%2F0610372%2Chep-ph%2F0610442%2Chep-ph%2F0610353%2Chep-ph%2F0610063%2Chep-ph%2F0610054%2Chep-ph%2F0610046%2Chep-ph%2F0610271%2Chep-ph%2F0610265%2Chep-ph%2F0610121%2Chep-ph%2F0610059%2Chep-ph%2F0610084%2Chep-ph%2F0610082%2Chep-ph%2F0610146&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Light Cone Quantization and Savvidy Instability in Dense Quark Matter"}, "summary": "Solving instability of Savvidy vacuum in QCD is a longstanding problem. Using\nlight cone quantization we analyze the problem not in the real confining vacuum\nbut in dense quark matter where gluons interact weakly with each other. We find\na stable ferromagnetic ground state of gluons which carry a single longitudinal\nmomentum. Their states are composed as if they are confined in a two\ndimensional quantum well. This supports our previous result that gluons form a\nquantum Hall state in dense quark matter.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0610087%2Chep-ph%2F0610204%2Chep-ph%2F0610062%2Chep-ph%2F0610251%2Chep-ph%2F0610092%2Chep-ph%2F0610423%2Chep-ph%2F0610066%2Chep-ph%2F0610267%2Chep-ph%2F0610296%2Chep-ph%2F0610284%2Chep-ph%2F0610264%2Chep-ph%2F0610362%2Chep-ph%2F0610231%2Chep-ph%2F0610157%2Chep-ph%2F0610312%2Chep-ph%2F0610039%2Chep-ph%2F0610324%2Chep-ph%2F0610334%2Chep-ph%2F0610021%2Chep-ph%2F0610261%2Chep-ph%2F0610295%2Chep-ph%2F0610142%2Chep-ph%2F0610375%2Chep-ph%2F0610413%2Chep-ph%2F0610051%2Chep-ph%2F0610118%2Chep-ph%2F0610031%2Chep-ph%2F0610239%2Chep-ph%2F0610205%2Chep-ph%2F0610072%2Chep-ph%2F0610190%2Chep-ph%2F0610278%2Chep-ph%2F0610056%2Chep-ph%2F0610319%2Chep-ph%2F0610183%2Chep-ph%2F0610079%2Chep-ph%2F0610365%2Chep-ph%2F0610045%2Chep-ph%2F0610071%2Chep-ph%2F0610088%2Chep-ph%2F0610269%2Chep-ph%2F0610098%2Chep-ph%2F0610058%2Chep-ph%2F0610297%2Chep-ph%2F0610433%2Chep-ph%2F0610016%2Chep-ph%2F0610318%2Chep-ph%2F0610286%2Chep-ph%2F0610143%2Chep-ph%2F0610203%2Chep-ph%2F0610276%2Chep-ph%2F0610015%2Chep-ph%2F0610232%2Chep-ph%2F0610189%2Chep-ph%2F0610227%2Chep-ph%2F0610061%2Chep-ph%2F0610137%2Chep-ph%2F0610182%2Chep-ph%2F0610294%2Chep-ph%2F0610427%2Chep-ph%2F0610373%2Chep-ph%2F0610070%2Chep-ph%2F0610415%2Chep-ph%2F0610107%2Chep-ph%2F0610147%2Chep-ph%2F0610411%2Chep-ph%2F0610273%2Chep-ph%2F0610096%2Chep-ph%2F0610195%2Chep-ph%2F0610103%2Chep-ph%2F0610120%2Chep-ph%2F0610068%2Chep-ph%2F0610011%2Chep-ph%2F0610200%2Chep-ph%2F0610110%2Chep-ph%2F0610141%2Chep-ph%2F0610349%2Chep-ph%2F0610078%2Chep-ph%2F0610274%2Chep-ph%2F0610288%2Chep-ph%2F0610150%2Chep-ph%2F0610174%2Chep-ph%2F0610001%2Chep-ph%2F0610185%2Chep-ph%2F0610397%2Chep-ph%2F0610024%2Chep-ph%2F0610161%2Chep-ph%2F0610117%2Chep-ph%2F0610372%2Chep-ph%2F0610442%2Chep-ph%2F0610353%2Chep-ph%2F0610063%2Chep-ph%2F0610054%2Chep-ph%2F0610046%2Chep-ph%2F0610271%2Chep-ph%2F0610265%2Chep-ph%2F0610121%2Chep-ph%2F0610059%2Chep-ph%2F0610084%2Chep-ph%2F0610082%2Chep-ph%2F0610146&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Solving instability of Savvidy vacuum in QCD is a longstanding problem. Using\nlight cone quantization we analyze the problem not in the real confining vacuum\nbut in dense quark matter where gluons interact weakly with each other. We find\na stable ferromagnetic ground state of gluons which carry a single longitudinal\nmomentum. Their states are composed as if they are confined in a two\ndimensional quantum well. This supports our previous result that gluons form a\nquantum Hall state in dense quark matter."}, "authors": ["Aiichi Iwazaki"], "author_detail": {"name": "Aiichi Iwazaki"}, "author": "Aiichi Iwazaki", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.75.034020", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0610107v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0610107v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0610107v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0610107v2", "journal_reference": "Phys.Rev.D75:034020,2007", "doi": "10.1103/PhysRevD.75.034020", "fulltext": "Light Cone Quantization and Savvidy Instability\nin Dense Quark Matter\nAiichi Iwazaki\n\narXiv:hep-ph/0610107v2 26 Feb 2007\n\nDepartment of Physics, Nishogakusha University, Ohi Kashiwa Chiba 277-8585, Japan.\n(Dated: Oct. 5, 2006)\nSolving instability of Savvidy vacuum in QCD is a longstanding problem. Using light cone quantization we analyze the problem not in the real confining vacuum but in dense quark matter where\ngluons interact weakly with each other. We find a stable ferromagnetic ground state of gluons which\ncarry a single longitudinal momentum. Their states are composed as if they are confined in a two\ndimensional quantum well. This supports our previous result that gluons form a quantum Hall state\nin dense quark matter.\n\nAbout 30 years ago, Savvidy[1] showed that a color magnetic field is generated spontaneously in the Yang-Mills\ngauge theory. Namely, when one calculates an effective potential of the color magnetic field using the one loop\napproximation, it is found that the nontrivial color magnetic field is generated spontaneously. But, soon after it has\nbeen shown[2] that some of gluons have imaginary energies under the color magnetic field and produce an imaginary\npart in the effective potential. The existence of the nontrivial imaginary part in the effective potential implies the\ninstability of the vacuum with the color magnetic field. Some of gluons are unstable in the vacuum. We call it as\nSavvidy instability. This magnetic instability of the vacuum in the Yang-Mills gauge theory was expected by many\nauthors to lead to a confining vacuum. Namely, it was expected that the confining vacuum would be realized by the\ncondensation of the unstable gluons. The subsequent analysis[3] of the gluons has revealed the complication of the\ncolor magnetic flux due to the production of additional magnetic field generated by the unstable gluons. Although the\nformation of a lattice of the flux tube has been argued[3], any other clear pictures of such complicate states formed\nby the unstable gluons have not been presented. Eventually, a confining vacuum could not be obtained.\nWe have recently investigated the Savvidy instability in dense quark matter and shown[4] that the instability is\nsolved by the formation of a stable quantum Hall state[5, 6] of the unstable gluons. Since perturbative arguments such\nas loop expansions are applicable in sufficiently dense quark matter, it is reliable that the spontaneous generation\nof the color magnetic field arises in the matter. Although the quantum Hall states is realized nonperturbatively\ndue to the effect of gluon's repulsive self interactions, this formation mechanism is well established in the physics of\nquantum Hall states of electrons. This is similar to the formation mechanism of BCS states; BCS states arise due\nto the effect of attractive forces between electrons on the Fermi surface, even if the forces are fairly weak. Hence,\nit is also reliable that the quantum Hall states of the gluons arise in the dense quark matter. Consequently, we\nmay understand that Savvidy instability is solved in the dense quark matter. It is composed of quarks, the color\nmagnetic field and the colored quantum Hall state of gluons. The phase of the quark matter is called as color\nferromagnetic phase. Although quarks occupy Landau levels, they do not form quantum Hall states in general. ( We\nhave shown[4] that the color ferromagnetic phase is realized in the quark matter with lower densities than ones with\nwhich color superconductivity[7] is realized. Thus, the phase is phenomenologically more important than the color\nsuperconducting phase. We have discussed an astrophysical implication of the phase[8] and also have pointed out the\nsimilarity[9] between the gluons in the dense quark matter and color glass condensate in nucleons. )\nQuantum Hall states arise only in two dimensional space. For example, quantum Hall states of electrons are realized\nin quantum wells of semiconductors, which are effectively two dimensional. Excitations with nontrivial momenta\nperpendicular to the two dimensional well are forbidden energetically as far as we are concerned with smaller energies\n( or lower temperature ) than a finite gap. Thus, only excitations with smaller energies than the gap are allowed and\nthey are excitations in the two dimensional well. This is a feature of the two dimensional quantum well. Then, it is\nnatural to ask how two dimensional quantum Hall states of gluons are formed in the three dimensional dense quark\nmatter. In this paper we analyze the problem as well as Savvidy instability, using the light cone quantization[10, 11].\nSince QCD Hamiltonian with color magnetic field can be well defined in the quantization, it is easy to analyze ground\nstates of the gluons with the use of an approximation valid at small couplings. As a result we find that the gluons in the\nlowest Landau level form a ground state in which all of the gluons have a single longitudinal momentum. Furthermore,\nthe energies of excitations with the same longitudinal momentum as the momentum of the gluons in the ground state,\nare much smaller than the energies of excitations with nontrivial longitudinal momenta. Such excitations arise in the\ntwo dimensional transverse space. Thus, the gluons are two dimensional since their excitations are only allowed in\nthe transverse directions as far as we are concerned with much small energies. In this way two dimensional gluonic\nstates arise effectively in the three dimensional quark matter. All of them carry the single longitudinal momentum.\nThese gluons may form quantum Hall states, but we do not discuss in this paper how the two dimensional gluons\n\n\f2\nform a quantum Hall state. Hereafter we analyze SU(2) gauge theory.\nFirst of all, we will give a brief review of our previous result[4, 6] obtained with the use of equal-time quantization,\nthat is, how the two dimensional states of gluons arise in a ground state. We assume the presence of a color magnetic\nfield, Bia ∝ δi,3 δ a,3 , generated spontaneously; indices of a and i denote a coordinate of color and space, respectively.\nThen, some of gluons under a spatially uniform color magnetic field, B = ǫ3ij ∂i A3j , have imaginary energies such\nthat E 2 = k 2 − gB. These gluons ( A1l + iA2l ∝ e−iEt perpendicular to magnetic field, B, in color space ) occupy\nthe lowest Landau level and have color magnetic moments parallel to B. Here g is gauge coupling constant and k\n~ = (0, 0, B). Indices, j of Aj denote colors of SU(2). The other\nis a momentum parallel to the magnetic field B\nl\nstable gluons occupy higher Landau levels and their energies are given by E 2 = k 2 + gBn with integer n ≥ 0. Thus,\nthe unstable gluons with small momentum such as k 2 < gB, have imaginary energies and their amplitudes grow up\nrapidly in time. Among them, the most unstable gluons are the ones with vanishing momentum k = 0. ( There are\ninfinitely many degenerate states with k = 0 in the lowest Landau level. ) Hence, their wave functions are uniform\nin the direction parallel to the magnetic field. These most unstable gluons with k = 0 are expected to form a new\nstable ground state similar to the case in Higgs model with a negative mass term −m2 |φ|2 . In the model, unstable\nHiggs modes with energies such as E 2 = ~k 2 − m2 < 0, are present in a naive vacuum hφi = 0. Among them, the\nmost unstable modes with ~k = 0 form a new ground state, hφi =\n6 0 with the condensation of the field φ. Similarly,\nwe expect that the gluons only with k = 0 form a stable ground state. They are two dimensional objects since they\n~ In this way the two dimensionality of gluonic ground state arises since the most\nare uniform in the direction of B.\nunstable gluons only with k = 0 make a stable ground state. It is reasonable to assume that any gluons with k 6= 0 do\nnot contribute to the formation of the ground state. This is because the similar phenomena arise in the Higgs model.\nThis is our previous result derived with the use of the equal-time quantization. ( It is well known that bosons as well\nas fermions in two dimensional space can form a quantum Hall state if repulsive interaction between them is present.\nHence, the two dimensional gluons may make a quantum Hall state due to the repulsive self-interaction[5, 12]. )\nIn such a circumstance, we wish to examine in detail whether ground state of gluons are two dimensional or not,\nby using the light cone quantization. In the formulation, the states with imaginary light cone energy never appear.\nInstead, a naive Fock vacuum is not the lowest energy state. The real ground state with the lowest energy is formed\nas a composite state of gluons in the lowest Landau level. In this paper we do not investigate the real confining\nvacuum which is a complicated composite of strongly interacting gluons; the problem of obtaining such a real QCD\nvacuum is beyond our scope[13]. Instead, we investigate a ground state of gluons in dense quark matter, in which\ngluons are weakly interacting with each other. We assume the presence of a color magnetic field, which is generated\nspontaneously. Here, we do not address a question of spontaneous generation of color magnetic field in the light cone\nquantization.\nNow, we show that a ground state of gluons is two dimensional, that is, it depends\n√ trivially on a longitudinal\n+\n0\n3\nmomentum p+ . We\nuse\nthe\nnotations\nof\nthe\nlight\ncone\ntime\ncoordinate,\nx\n=\n(x\n+x\n)/\n2 and longitudinal coordinate,\n√\n−\n0\n3\ni\nx = (x − x )/ 2. Transverse coordinates are denoted by x , or ~x. We assume a finite length, −L ≤ x− ≤ L, in\nthe longitudinal space and impose a periodic boundary condition such that Aaj (x− = L) = Aaj (x− = −L). Then,\ncorresponding momentum becomes discrete denoted by p+\nn = nπ/L with integer n. Light cone components of gauge\nfields, A+ , A− , Ai , are defined similarly. Then, the Hamiltonian, H, with the light cone gauge, A+ = 0 is given by\n\nH=\n\n1 a a g2 a 1\na\nF F + ρ\n2) ρ ,\n4 ij ij\n2\n(−∂−\n\n(1)\n\nwith field strength, Fija = ∂i Aaj − ∂j Aai + gǫabc Abi Acj , where color indices a run from 1 to 3 and space indices, i, j run\nfrom 1 to 2. ρa is defined by\nb\nρa ≡ (Di Ai )a = (∂i δ ab + gǫa3b AB\ni )Ai\n\n(2)\n\nwhere AB\ni denotes the gauge potential of color magnetic field, which is assumed to direct into σ3 in color SU(2);\nB\na=3\nB = ∂1 AB\naside from the classical one, AB\n2 − ∂2 A1 . We have neglected a dynamical gauge potential, Ai\ni since it\na=1,2\nB\ndoes not couple directly with Ai . We have only taken dynamical gauge fields, Ai\nperpendicular in color space\nto the color magnetic field. They form Landau levels under B. We treat only the quantum effects of the gluons, but\ntreat quarks classically for simplicity. Their color charge neutralize the color charge of the gluons.\nWe make a comment that our treatment of \"zero mode\"[14, 15] in the light cone quantization is similar to the\none used by Thorn[16]: We quantize gauge fields in the finite volume, −L ≤ x− ≤ L, and neglect zero modes of the\nfields. Consequently, Hamiltonian becomes a simple form involving at most quartic terms of creation or annihilation\noperators in addition to quadratic ones. As has been shown[16] in a two dimensional model of scalar field, the true\n\n\f3\nground state can be gripped even if we neglect the zero mode of the field, at least in the limit of L → ∞. We assume\nthat it also holds in the gauge theory. We may justify neglecting the zero mode in the analysis of dense quark matter\nas follows. That is, our concern is not the real vacuum, but a ground state of gluons in dense quark matter. The\nzero mode may play an important role in the real vacuum of strongly interacting gluons. But, it may not play such\na role in a ground state of gluons weakly interacting with each other in the dense quark matter. Typical energy scale\nof quarks and gluons in the quark matter is given by the chemical potential of the quarks and is much larger than\nΛQCD . In such dense quark matter the zero mode does not play an important role for realizing the ground state. It\nis similar to the case of QCD at high energy scattering[17] where the typical energy scale is much higher than ΛQCD .\nHence, the zero mode does not play an important role for realizing so-called color glass condensation. Therefore, it is\nreasonable to neglect the zero modes of the gluons in the quark matter.\nWe assume the spontaneous generation of the color magnetic field, B, in the light cone quantization. The condition\nof neglecting the zero mode requires the coherent length of B in x− being shorter than L, but becoming infinite as\nL → ∞. Thus, our discussion below is limited for the case such that momentum scale, p+ of gluons is larger than the\ninverse of the coherent length of B.\nIn the light cone gauge only dynamical variables are transverse components, Aai of gauge fields. This can be\nexpressed in terms of creation and annihilation operators,\nAbi\n\n=\n\nr\n\n+ −\n+ −\nπ X\n1\n+\np\n(abi,p (x+ , ~x)e−ip x + ab†\nx)eip x ),\ni,p (x , ~\n+\nL +\n2πp\np >0\n\n(3)\n\n+\nwith p+ = πn/L ( integer, n ≥ 1 ), where operators, ali,p , satisfy the commutation relations, [abi,p (x+ , ~x), a†c\ny)] =\nj,k (x , ~\nbc\nδij δ δpk δ(~x − ~y), with other commutation relations being trivial. As we have mentioned before, we have neglected\nthe zero modes, p+ = 0, of the gauge fields.\nThen, the gauge fields satisfy the equal time, x+ , commutation relation,\n\n\u0010\n1 \u0011\n,\n[∂− Aai (x+ , x− , ~x), Abj (x+ , y − , ~y )] = −iδij δ ab δ(~x − ~y ) δ(x− − y − ) −\n2L\n\n(4)\n\nwhere the last factor, 1/2L, in the right hand side of the equation comes from neglecting the zero modes of the gauge\nfields.\nWe should mention that the second term in H represent a Coulomb interaction. It is derived by solving a constraint\n2 −,a\nequation, ∂−\nA\n= ρa , that is, Gauss law associated with the light cone gauge condition, A+ = 0. In order to assure\nP\n−\nthat the gauge field, A− is periodic in x− , the zero mode of ρ ( ρ ∝ n=integer ρn eiπnx /L ) must vanish; ρn=0 = 0.\n2\nThen, the operation of 1/(−∂−\n) is well defined. The condition of ρn=0 = 0 implies that the total color charge,\nRL\n−\ndx\nρ\n,\nvanishes.\nHere\nwe\nshould\ninclude background classical color charge of quarks in ρtot . ρ in eq(1) should\ntot\n−L\nbe replaced by ρtot = ρ − ρquark with ρtot,n=0 = 0. This requirement of ρtot,n=0 = 0, is consistent with the condition,\nA−\nn=0 = 0.\n√\nWe now rewrite the Hamiltonian in terms of \"charged vector fields\",\nΦi = (A1i +iA2i )/√ 2, which may be decomposed\n√\ninto spin parallel ( anti-parallel ) component, Φp = (Φ1 + Φ2 )/ 2 ( Φap = (Φ1 − Φ2 )/ 2 ). These fields transform as\nAbelian charged fields under the U (1) gauge transformation, Ai → U † Ai U with U = exp(iθσ3 ).\nThen, using the fields, Φp ( Φap ), we obtain the following Hamiltonian,\nH=\n\n1 2\n~ 2 − 2gB)Φp + Φ† (−D\n~ 2 + 2gB)Φap\nB + Φ†p (−D\nap\n2\ng2\n1\ng2\n(|Φp |2 − |Φap |2 )2 + ρ\n+\n2) ρ ,\n2\n2 (−∂−\n\n(5)\n\n~ = ∂~ + ig A~B , where ρ is given by\nwith D\nρ = i(Φ†p ∂− Φp − ∂− Φ†p Φp + Φ†ap ∂− Φap − ∂− Φ†ap Φap ) − ρquark .\n\n(6)\n\nThe first term in eq(5) represents the classical energy of the color magnetic field, and second ( third ) term does the\nkinetic energy of the charged gluons with spin parallel ( anti-parallel ) under the color magnetic field, B. The forth\nterm represents the energy of the repulsive self-interactions. The last term represents the Coulomb energy coming\nfrom the second term with ρa=3 component in eq(1).\n\n\f4\n~ 2 are classified by Landau levels, the second and the third terms can be rewritten\nSince eigenstates of the operator D\nas,\nX\n\nn=0,1,2,,,\n\n\u0010\n\u0011\nΦ†p, n (2n − 1)gBΦp, n + Φ†ap, n (2n + 3)gBΦap, n ,\n\n(7)\n\nwhere the fields, Φp, n ( Φap, n ) denote operators in the Landau level specified by integer n. ( We have implicitly\nassumed integration over the transverse directions in the above equation. )\nNow, we take only the field, Φp, n=0 in the lowest Landau level, n = 0, that is, the component having negative\nkinetic energy. It is most important, among others, for realizing the ground state of the Hamiltonian in the limit of\nstrong magnetic field, B. The field corresponds to the unstable gluon in our previous discussions[4] with the use of\nthe time-like quantization. Therefore, we obtain the following reduced Hamiltonian for analyzing the ground state of\nthe system,\n\nHr = −gB|Φ|2 +\n\n1\ng2 4 g2\n|Φ| + ρr\n2 ) ρr ,\n2\n2\n(−∂−\n\n(8)\n\nwith ρr ≡ i(Φ† ∂− Φ − ∂− Φ† Φ) − ρquark , where we have put Φ ≡ Φp, n=0 for simplicity. The field, Φ, can be expressed\nby using creation and annihilation operators,\nr\n\nΦ=\n\nX\nπ\n1\n√\n(ap,m φm (~x)e−ipx + b†p,m φ†m (~x)eipx ),\nL p>0,m=0,1,2,, 2πp\n\n(9)\n\nwhere simplified notation such as x = x− and p = p+ is exploited and will be used below. φm (~x) = gm z m exp(−|z|2 /4l2 )\nR\n~ 2 with angular momentum, m, in the lowest Landau level, d2 ~xφ† φn = δm,n ;\nrepresents normalized eigenfunction of D\nm\nz = x1 + ix2 and gm ≡ πm!(2l12 )m+1 with l2 ≡ 1/gB. ap,m and bp,m satisfy the commutation relations; [ap,m , a†k,n ] =\nδp,k δm,n , [bp,m , b†k,n ] = δp,k δm,n , others = 0.\nWhen we express the first term in eq(8) in terms of the operators, ap,m and bp,m ,\nZ\n\nL\n\n−L\n\ndx d2 ~x : −gB|Φ|2 := −gB\n\nX 1\n(a†p,m ap,m + b†p,m bp,m ),\np\np>0,m\n\n(10)\n\nwe find that there exist states with lower energies than a trivial Fock vacuum, |vac >; ap,m |vac >= bp,m |vac >= 0.\nNamely, gluons in the lowest Landau level are produced spontaneously to form a state with lower energy than that\nof the vacuum. The production of the gluons is limited by the second term in eq(8) representing repulsion among the\ngluons. This is similar to the case of Higgs model. Contrary to the model, the gluons do not condense. Thus, we\npostulate hΦi = 0. ( This is consistent with neglecting zero mode. ) In order to find the ground state of the gluons,\nwe will express approximately the energy, hHr i, of the state in terms of the distribution functions, ha†p,m ap,m i and\nhb†p,m bp,m i. Then, by minimizing the energy we will find the momentum, p, and angular momentum, m, distribution\nof gluons. The state of the gluons may carry non vanishing color charge density, in general. The fact that quarks\nand gluons are weakly interacting in the dense quark matter certificates that our approximation gives rise to reliable\nresults; any quantum corrections to the results are small.\nBefore finding the ground state of the Hamiltonian, Hr , we should note that there are two conserved quantities\nsuch as total color charge and momentum,\n\nQ =\n\nZ\n\nL\n\ndx d2 ~x ρr =\n\n−L\n\nPtotal =\n\nX\n\nX\n\np>0,m\n\np(a†p,m ap,m\n\n(a†p,m ap,m − b†p,m bp,m ) −\n\n+ b†p,m bp,m ),\n\nZ\n\nL\n\ndx d2 ~xρquark = 0\n\n−L\n\n(11)\n\np>0,m\n\nwhere we have required that the total color charge of gluons and quarks must vanish. The ground state must be\nfound under the condition of the conserved quantities being given. Since our concern is the ground state of gluons in\n\n\f5\ndense quark matter, not real vacuum, the total color charge of the gluons can be nonzero and is neutralized by the\ncolor charge of quarks.\nIn order to evaluate the expectation value of Hr with the ground state, |gi, we assume the following approximation,\nha†α a†β aγ aδ i ≃ ha†α aγ iha†β aδ i + ha†α aδ iha†β aγ i, for α 6= β,\nha†α b†β aγ bδ i\n\n≃\n\nha†α aγ ihb†β bδ i,\n\nha†α aβ i ∝ δα,β ,\n\n† † †\n\n† † †\n\nsimilar for bα\n\n†\n\n†\n\nha a b ai = ha b b bi = ha aabi = hb bbai = 0,\n\nhb†α bβ i ∝ δα,β\n\n(12)\n(13)\n(14)\n\nwhere indices, α, β, , , denote a set of p and m. Namely, we assume no mixing among states with different p and\nm in eq(12). Furthermore, we assume no pair creations and annihilations in eq(13) so that the numbers of particle\nand antiparticle are conserved, respectively. We also postulate momentum and angular momentum conservation in\neq(14). These formulae are satisfied by eigenstates of the number operators, a†α aα and b†α bα . Hence, we minimize the\nHamiltonian by using the eigenstates of the number operators in our approximation.\nUsing the approximation, we evaluate an expectation value, h: Hr :i, of normal ordered Hamiltonian, : Hr : and\nfind the ground state minimizing the expectation value,\nh: Hr :i = − gB\n\n\u0011\nX \u0010\na(p, m) + b(p, m) +\n\np>0,m\n\n\u0011\nX \u0010\ng2\na(p, m)a(q, n) + b(p, m)b(q, n) + 2a(p, m)b(q, n) Nm,n\n2L p,q>0,m,n\n\u00132 X\u0010\n\u0012\n\u0011\ng2 X p + q\n+\na(p, m)a(q, n) + b(p, m)b(q, n) Nm,n\n2L\np−q\nm,n\np6=q>0\n\u0012\n\u0013\n2\nX\ng2 X p − q\n+\n2a(p, m)b(q, n)Nm,n ,\n2L p,q>0 p + q\nm,n\n\n+\n\n(15)\n\nwith Nm,n = (m + n)! (πm! n! 2m+n+2 l2 )−1 , where a(p, m) and b(p, m) are defined by\nha†p,m aq,n i = δp,q δm,n p a(p, m),\n\nhb†p,m bq,n i = δp,q δm,n p b(p, m),\n\n(16)\n\nwhere a(p, m) and b(p, m) represent distributions of p and m in the ground state, respectively. We have used the color\nneutrality condition, ρr,n=0 = 0 in the derivation of eq(15); the condition is imposed as a constraint such as p 6= q in\nthe third term.\nIt is easy to see that the expectation value of the color charge density becomes uniform in longitudinal direction,\nx = x− ,\n\nhρr i =\n\n\u0011\n1 X \u0010\np a(p, m) − b(p, m) |φm (~x)|2 − ρquark ,\nL p>0,m\n\n(17)\n\nwhich may depend on transverse coordinate, ~x.\nIn eq(15) the first term represents the kinetic energy in the Landau level and the second term does the energy of\nthe repulsion between gluons. These two terms are denoted by E1 . The third and forth terms represent the Coulomb\nenergy between gluons and are denoted by E2 . Obviously, these terms are non negative except for the first one.\nTherefore, we can find a ground state with the lowest energy, h: H :i ≡ E1 + E2 , by minimizing the first two terms,\nE1 and the last two terms, E2 of the Coulomb energy, respectively. Simultaneously, we need to take into account the\ncondition that the state carries a given total momentum and vanishing total color charge. We may assume that the\ncolor charge of quarks, ρquark is spatially uniform.\nP\nIt is easy to minimize the first two terms, i.e. E1 , which is given by a set of values, c(m) ≡ p>0 (a(p, m) + b(p, m)).\nP\nP\nThis is because E1 can be rewritten such that E1 = −gB m c(m) + g 2 /(2L) m,n c(m)Hm,n c(n). Thus, minimizing\nthe energy, E1 , does not determine the dependence of a(p, m) or b(p, m) on the longitudinal momentum, p = p+ . It\nsimply gives the summation over the momentum, p, namely, c(m) ∝ gBL/g 2. The dependence on p is determined\nonly by minimizing the Coulomb energy, E2 . The energy, E2 ≥ 0, can be minimized easily by assuming that\n\n\f6\nthe ground state depends only on a single momentum, p = p0 , that is, a(p, m) ∝ δp,p0 and b(q, n) ∝ δq,p0 . This\ndistribution of the momentum leads to the minimum, E2 = 0. ( Any other distributions with the dependence on\nvarious momenta give rise to higher\nenergies ( > 0 ). \u0011) It follows from the distribution that the color charge density\nP \u0010\nis given such that hρr i = p0 m a(p0 , m) − b(p0 , m) |φm (~x)|2 /L − ρquark . For the color charge density to vanish,\n\na(p0 , m) − b(p0 , m) should be independent of m.\ncolor charge density of the gluons becomes uniform in\nP Then, the\n2\n|φ\n(~\nx\n)|\n=\n1/(2l2π). On the other hand, the total momentum is\n~x, and can cancel\nthat\nof\nquarks,\nρ\nsince\nm\nquark\nm\nP\nP 2\n2\ngiven by Ptot = m p0 (a(p0 , m) + b(p0 , m)) = p0 m c(m).\nTherefore, the ground state minimizing the energy in eq(15) is characterized by the trivial distribution of the\nlongitudinal momentum; ha†p,m ap,m i ∝ δp,p0 and hb†p,m bp,m i ∝ δp,p0 . The Coulomb energy, E2 , of the state vanishes.\nAll of gluons in the lowest Landau level occupy the states with a single momentum, e.g. p = p0 . It implies that the\nground state is composed of two dimensional gluons occupying the lowest Landau level. It is also important to note\nthat the displacement of a gluon with the momentum, p0 in the ground state to a state with a momentum k 6= p0 gives\nrise to an energy gap, ∆Ek ; hk| : Hr : |ki = h: Hr :i + ∆Ek ( ∆Ek > 0 for any k ) where |ki ≡ a†k,m ap0 ,m |gi. We note\nthat ∆k → ∞ as k → p0 . This simple argument suggests the existence of a finite gap energy needed to excite modes\nwith longitudinal momenta different with p0 . On the other hand, we can show that there exist gapless excitations\nwith the momentum, p0 , which have different distributions in m with a(p0 , m) and b(p0 , m) in the ground state. The\nfact implies that gluons are confined in a two dimensional quantum well extending in the transverse directions. Only\nmotions are allowed in the well as far as we are concerned with smaller energies than the gap energy. Motions in the\nlongitudinal direction are visible only when we are concerned with higher energies than the gap energy. On this point,\nmore detail analysis is necessary to demonstrate the conclusion.\nHere, we wish to mention that for Ptotal to be finite in the limit \u0010\nof L → ∞, p0 goes\u0011to 0 in the limit because\nc(m) ∝ L. On the other hand, the color charge density of gluons, ∝ p0 a(p0 , m) − b(p0 , m) , can take any finite value\neven in the limit. Hence, all of gluons occupy the states with a vanishingly small longitudinal momentum. In the\nterminology used in high energy scattering of hadrons or nuclei, parton ( gluons ) distribution behaves such as δ(x)\nsince x = p0 /Ptot → 0. ( The distribution contains only contributions of charged vector field, Φ± or Aa=1,2\n. If we\ni\ntake into account momentum distribution of the gauge field, Aa=3\nneglected in our argument, it would give a parton\ni\ndistribution with a finite support in x. )\nWe have not yet shown that the gluons forms quantum Hall states, but have only shown that they form two\ndimensional states. It is a necessary condition for the realization of quantum Hall states of the gluons. Whether\nor not the quantum Hall states of the gluons are made, depends on the color charge density of the gluons. If a\nspecific condition\nof \"filling factor\",\n\u0011 ν = 2πρr L/gB is satisfied, the quantum Hall state can be realized, that is,\nP \u0010\nν = 2πp0 m a(p0 , m) − b(p0 , m) |φm (~x)|2 /gB = 1/2, 1/4, , , . Otherwise, gluons simply form a two dimensional\ncompressible state, i.e. gapless state.\nAs we have shown, the two dimensionality of the ground state of gluons arises from the Coulomb interaction, ρ −∂1 2 ρ\n−\n\nin the longitudinal direction, x− . In our approximation, the Coulomb energy, E2 is a positive semi definite. Thus, the\nground state is given by the state with E2 = 0. When we apply the similar approximation to quarks coupled with the\nmagnetic field, we obtain a negative semi definite Coulomb energy. Thus, we do not obtain the two dimensionality in\nthe quarks. In the ground state of the quarks, the distribution of the longitudinal momentum does not take a form of\na delta function. The result in the quarks or fermions is natural physically. Electrons in metals never take a form of\ntwo dimensional gases under external magnetic field except for ones confined in two dimensional space, e.g. quantum\nwells.\nThe difference between the case of gluons and that of quarks comes from their difference in statistics. In order to\nsee this point more explicitly, we take a following simple model of a Coulomb interaction,\nVc =\n\ng2\n1\n:ρ\n2) ρ:\n2\n(−∂−\n\nρ(x) = ψ † (x)ψ(x) − hψ † ψi\n\n(18)\n\nwith −L ≤ x ≤ L, where the field, ψ represents boson or fermion with an appropriate boundary condition at x = ±L.\nSuppose that we have two states with momentum, p > 0 and q(6= p) > 0, whose wave functions are denoted as\nf (p, x) and f (q, x) ∝ e−iqx . We define the field operator such that\nψ(x) = ap f (p, x) + aq f (q, x),\n\n(19)\n\nwith annihilation operators, ap and aq satisfying commutation relations, [ap , a†q ]± = δp,q , , . As in the previous case,\n2\nwe extract zero modes of ρ for 1/(−∂−\n) to be well defined. Thus, ψ † ψ = a†p aq f † (p, x)f (q, x) + h.c. When we evaluate\nthe expectation value of Vc with the use of a state, a†p a†q |0i,\n\n\f7\n\nhVc i± = ±2|f (p, x)|2 |f (q, x)|2\n\n1\n,\n(p − q)2\n\n(20)\n\nwe find that the Coulomb energy is positive semi definite in the bosonic case, hVc i+ ≥ 0, and negative semi definite\nin the fermionic case, hVc i− ≤ 0. If we allow additional internal states with an identical momentum, i.e. fi (p, x)\nwith i = 1, 2 and evaluate hVc i with the use of a state, a†p,i=1 a†p,i=2 |0i, we find hVc i = 0. Therefore, it turns out that\nin the case of bosons, the state of two particles with an identical momentum is more stable than the state of two\nparticles with different momentum. On the other hand, in the case of fermions, the situation is reverse; the state of\ntwo particles with different momentum is more stable than the state of two particles with an identical momentum.\nTo summarize, we have shown using light cone quantization that Savvidy instability is solved in sufficiently dense\nquark matter where quarks and gluons couple weakly with each others. In the quark matter the color magnetic field\nis generated spontaneously and gluons in the lowest Landau level are also produced spontaneously to form a ground\nstate of gluons. All of gluons in the ground state carry a vanishingly small longitudinal momentum. Thus, they form\na nontrivial two dimensional state with finite color charge. The state arises due to the effect of Coulomb interaction\namong gluons in the longitudinal direction. We need further analysis to see whether or not these gluons form quantum\nHall states.\nWe would like to express thanks to Prof. O. Morimatsu, Dr. T. Nishikawa and Dr. M. Ohtani for useful discussion.\nThis work was supported by Grants-in-Aid of the Japanese Ministry of Education, Science, Sports, Culture and\nTechnology (No. 13135218).\n\n[1] G.K. Savvidy, Phys. Lett. B 71 (1977) 133.\n[2] N.K. Nielsen and P. Olesen, Nucl. Phys. B 144 (1978) 376; Phys. Lett. B 79 (1978) 304.\n[3] J. Ambjørn, N.K. Nielsen and P. Olesen, Nucl. Phys. B152,75 (1979).\n\n[4]\n\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n\nH.B. Nielsen and M. Ninomiya, Nucl. Phys. B156, 1 (1979).\nH. B. Nielsen and P. Olesen, Nucl. Phys. B160, 330 (1979).\nA. Iwazaki and O. Morimatsu, Phys. Lett. B 571 (2003) 61.\nA. Iwazaki, O. Morimatsu, T. Nishikawa and M. Ohtani.\nPhys. Lett. B 579 (2004) 347. A. Iwazaki, O. Morimatsu, T. Nishikawa and M. Ohtani, Phys. Rev. D 71 (2005) 034014.\nThe Quantum Hall Effect, 2nd Ed., edited by R.E. Prange and S.M. Girvan ( Springer-Verlag, New York, 1990 ).\nS. Das Sarma and A. Pinczuk (Eds.), Perspectives in Quantum Hall Effects, (Wiley, New York, 1997).\nZ.F. Ezawa, M. Hotta and A. Iwazaki, Phys. Rev. B46, 7765 (1992); Z.F. Ezawa and A. Iwazaki, J. Phys. Soc. Jpn. 61,\n4133 (1992).\nK. Rajagopal and F. Wilczek, hep-ph/0011333.\nA. Iwazaki, Phys. Rev. D72 (2005) 114003.\nA. Iwazaki, hep-ph/0604222.\nP.A.M. Dirac, Rev. Mod. Phys. 21 (1949) 392.\nfor a review, see A. Harindranath, hep-ph/9612244, T. Heintl, hep-th/0008096.\nT. Nakajima and M. Ueda, Phys. Rev. Lett. 91 140401 (2003).\nK. Kondo, Phys. Lett. B600, 287 (2004).\nT. Maskawa and K. Yamawaki, Prog. Theor. Phys. 56 (1976) 270.\nS. Tsujimaru and K. Yamawaki, Phys. Rev. D57 (1998) 4942.\nJ.S. Rozowsky and C.B. Thorn, Phys. Rev. Lett. 85 (2000) 1614.\nE. Iancu and R. Venugopalan, hep-ph/0303204.\n\n\f"}