{"id": "http://arxiv.org/abs/hep-ex/0106002v1", "guidislink": true, "updated": "2001-06-01T00:09:25Z", "updated_parsed": [2001, 6, 1, 0, 9, 25, 4, 152, 0], "published": "2001-06-01T00:09:25Z", "published_parsed": [2001, 6, 1, 0, 9, 25, 4, 152, 0], "title": "School Cosmic Ray Outreach Detector (SCROD)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ex%2F0106055%2Chep-ex%2F0106063%2Chep-ex%2F0106016%2Chep-ex%2F0106073%2Chep-ex%2F0106045%2Chep-ex%2F0106015%2Chep-ex%2F0106023%2Chep-ex%2F0106079%2Chep-ex%2F0106021%2Chep-ex%2F0106088%2Chep-ex%2F0106005%2Chep-ex%2F0106046%2Chep-ex%2F0106050%2Chep-ex%2F0106032%2Chep-ex%2F0106028%2Chep-ex%2F0106026%2Chep-ex%2F0106042%2Chep-ex%2F0106040%2Chep-ex%2F0106044%2Chep-ex%2F0106083%2Chep-ex%2F0106091%2Chep-ex%2F0106007%2Chep-ex%2F0106089%2Chep-ex%2F0106052%2Chep-ex%2F0106043%2Chep-ex%2F0106090%2Chep-ex%2F0106039%2Chep-ex%2F0106068%2Chep-ex%2F0106004%2Chep-ex%2F0106048%2Chep-ex%2F0106062%2Chep-ex%2F0106076%2Chep-ex%2F0106103%2Chep-ex%2F0106024%2Chep-ex%2F0106031%2Chep-ex%2F0106071%2Chep-ex%2F0106059%2Chep-ex%2F0106036%2Chep-ex%2F0106101%2Chep-ex%2F0106041%2Chep-ex%2F0106100%2Chep-ex%2F0106080%2Chep-ex%2F0106072%2Chep-ex%2F0106097%2Chep-ex%2F0106102%2Chep-ex%2F0106002%2Chep-ex%2F0106093%2Chep-ex%2F0106019%2Chep-ex%2F0106017%2Chep-ex%2F0003019%2Chep-ex%2F0003032%2Chep-ex%2F0003024%2Chep-ex%2F0003001%2Chep-ex%2F0003033%2Chep-ex%2F0003023%2Chep-ex%2F0003031%2Chep-ex%2F0003005%2Chep-ex%2F0003010%2Chep-ex%2F0003012%2Chep-ex%2F0003007%2Chep-ex%2F0003003%2Chep-ex%2F0003015%2Chep-ex%2F0003034%2Chep-ex%2F0003028%2Chep-ex%2F0003002%2Chep-ex%2F0003027%2Chep-ex%2F0003009%2Chep-ex%2F0003014%2Chep-ex%2F0003016%2Chep-ex%2F0003026%2Chep-ex%2F0003020%2Chep-ex%2F0003022%2Chep-ex%2F0003011%2Chep-ex%2F0003006%2Chep-ex%2F0003025%2Chep-ex%2F0003004%2Chep-ex%2F0003030%2Chep-ex%2F0003017%2Chep-ex%2F0003021%2Chep-ex%2F0003018%2Chep-ex%2F0003013%2Chep-ex%2F0003029%2Chep-ex%2F0003008%2Chep-ex%2F0011030%2Chep-ex%2F0011069%2Chep-ex%2F0011084%2Chep-ex%2F0011040%2Chep-ex%2F0011089%2Chep-ex%2F0011087%2Chep-ex%2F0011088%2Chep-ex%2F0011038%2Chep-ex%2F0011027%2Chep-ex%2F0011004%2Chep-ex%2F0011064%2Chep-ex%2F0011003%2Chep-ex%2F0011015%2Chep-ex%2F0011016%2Chep-ex%2F0011021%2Chep-ex%2F0011042%2Chep-ex%2F0011041%2Chep-ex%2F0011074&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "School Cosmic Ray Outreach Detector (SCROD)"}, "summary": "We report on our studies of applying novel detector technologies developed\nfor LHC-era experiments to cosmic ray detection. In particular, we are\ninvestigating usage of scintillating tiles with embedded wavelength-shifting\nfibers and avalanche photodiode readout as part of a robust, inexpensive cosmic\nair shower detector. In the near future, we are planning to deploy detector\nstations based on this technology at area high schools and colleges as part of\nan outreach and education effort, known as SCROD.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ex%2F0106055%2Chep-ex%2F0106063%2Chep-ex%2F0106016%2Chep-ex%2F0106073%2Chep-ex%2F0106045%2Chep-ex%2F0106015%2Chep-ex%2F0106023%2Chep-ex%2F0106079%2Chep-ex%2F0106021%2Chep-ex%2F0106088%2Chep-ex%2F0106005%2Chep-ex%2F0106046%2Chep-ex%2F0106050%2Chep-ex%2F0106032%2Chep-ex%2F0106028%2Chep-ex%2F0106026%2Chep-ex%2F0106042%2Chep-ex%2F0106040%2Chep-ex%2F0106044%2Chep-ex%2F0106083%2Chep-ex%2F0106091%2Chep-ex%2F0106007%2Chep-ex%2F0106089%2Chep-ex%2F0106052%2Chep-ex%2F0106043%2Chep-ex%2F0106090%2Chep-ex%2F0106039%2Chep-ex%2F0106068%2Chep-ex%2F0106004%2Chep-ex%2F0106048%2Chep-ex%2F0106062%2Chep-ex%2F0106076%2Chep-ex%2F0106103%2Chep-ex%2F0106024%2Chep-ex%2F0106031%2Chep-ex%2F0106071%2Chep-ex%2F0106059%2Chep-ex%2F0106036%2Chep-ex%2F0106101%2Chep-ex%2F0106041%2Chep-ex%2F0106100%2Chep-ex%2F0106080%2Chep-ex%2F0106072%2Chep-ex%2F0106097%2Chep-ex%2F0106102%2Chep-ex%2F0106002%2Chep-ex%2F0106093%2Chep-ex%2F0106019%2Chep-ex%2F0106017%2Chep-ex%2F0003019%2Chep-ex%2F0003032%2Chep-ex%2F0003024%2Chep-ex%2F0003001%2Chep-ex%2F0003033%2Chep-ex%2F0003023%2Chep-ex%2F0003031%2Chep-ex%2F0003005%2Chep-ex%2F0003010%2Chep-ex%2F0003012%2Chep-ex%2F0003007%2Chep-ex%2F0003003%2Chep-ex%2F0003015%2Chep-ex%2F0003034%2Chep-ex%2F0003028%2Chep-ex%2F0003002%2Chep-ex%2F0003027%2Chep-ex%2F0003009%2Chep-ex%2F0003014%2Chep-ex%2F0003016%2Chep-ex%2F0003026%2Chep-ex%2F0003020%2Chep-ex%2F0003022%2Chep-ex%2F0003011%2Chep-ex%2F0003006%2Chep-ex%2F0003025%2Chep-ex%2F0003004%2Chep-ex%2F0003030%2Chep-ex%2F0003017%2Chep-ex%2F0003021%2Chep-ex%2F0003018%2Chep-ex%2F0003013%2Chep-ex%2F0003029%2Chep-ex%2F0003008%2Chep-ex%2F0011030%2Chep-ex%2F0011069%2Chep-ex%2F0011084%2Chep-ex%2F0011040%2Chep-ex%2F0011089%2Chep-ex%2F0011087%2Chep-ex%2F0011088%2Chep-ex%2F0011038%2Chep-ex%2F0011027%2Chep-ex%2F0011004%2Chep-ex%2F0011064%2Chep-ex%2F0011003%2Chep-ex%2F0011015%2Chep-ex%2F0011016%2Chep-ex%2F0011021%2Chep-ex%2F0011042%2Chep-ex%2F0011041%2Chep-ex%2F0011074&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on our studies of applying novel detector technologies developed\nfor LHC-era experiments to cosmic ray detection. In particular, we are\ninvestigating usage of scintillating tiles with embedded wavelength-shifting\nfibers and avalanche photodiode readout as part of a robust, inexpensive cosmic\nair shower detector. In the near future, we are planning to deploy detector\nstations based on this technology at area high schools and colleges as part of\nan outreach and education effort, known as SCROD."}, "authors": ["L. A. Anchordoqui", "J. Cook", "M. Gabour", "N. Kirsch", "J. MacLeod", "T. P. McCauley", "Y. Musienko", "T. C. Paul", "S. Reucroft", "J. D. Swain", "R. Terry"], "author_detail": {"name": "R. Terry"}, "author": "R. Terry", "arxiv_comment": "Talk to be presented in the 27th International Cosmic Ray Conference,\n  07-15 August 2001, Hamburg, Germany", "links": [{"href": "http://arxiv.org/abs/hep-ex/0106002v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ex/0106002v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ex/0106002v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ex/0106002v1", "journal_reference": null, "doi": null, "fulltext": "Proceedings of ICRC 2001: 1 c Copernicus Gesellschaft 2001\n\nICRC 2001\n\narXiv:hep-ex/0106002v1 1 Jun 2001\n\nSchool Cosmic Ray Outreach Detector (SCROD)\nL.A. Anchordoqui1 , J. Cook2 , M. Gabour1 , N. Kirsch1 , J. MacLeod1 , T.P. McCauley1 , Y. Musienko1 , T.C. Paul1 , S.\nReucroft1 , J. D. Swain1 , and R. Terry1\n1\n2\n\nDepartment of Physics, Northeastern University, Boston, MA 02115 USA\nNortheastern University and Paige Academy, Boston, MA 02115 USA\n\nAbstract. We report on our studies of applying novel detector technologies developed for LHC-era experiments to cosmic ray detection. In particular, we are investigating usage of\nscintillating tiles with embedded wavelength-shifting fibers\nand avalanche photodiode readout as part of a robust, inexpensive cosmic air shower detector. In the near future, we are\nplanning to deploy detector stations based on this technology\nat area high schools and colleges as part of an outreach and\neducation effort, known as SCROD.\n\n1\n\nIntroduction\n\nThe project we describe here, known as SCROD for School\nCosmic Ray Outreach Detector, is based on a idea which\nis simple but has great potential: install cosmic ray detectors suitable for continuous muon counting and detection of\nbuilding-sized (or larger) extensive air showers in high schools\nand relay collected data via the internet to a central repository\nwhich is accessible to all participating schools. The principle\naim of the project is education, but there is potential for contribution to cosmic ray physics as well. Involving students\nin a project making real measurements in a living field appears to be more likely to spark an interest in physics than\nthe usual ritual of repeating century old experiments whose\nconclusions are foregone. A number of groups are pursuing\nsimilar programs (CROP, CHICOS, ALTA, WALTA) 1 using\nvarious approaches and recycling equipment to various degrees. Here we discuss our approach and the current status\nof the work.\nCorrespondence to: J. Swain (john.swain@cern.ch)\n1\nRelevant web pages are:\nhttp://www.unl.edu/physics/crop.html\nhttp://www.chicos.caltech.edu/\nhttp://csr.phys.ualberta.ca/ ̃ alta/\nhttp://www.phys.washington.edu/ ̃ walta/\nhttp://www.hep.physics.neu.edu/scrod/\n\n2 Physics Potential\nThere are a number of topics which can be addressed with\nan array of detectors of the type we are proposing, ranging\nfrom searches for long-range correlations among air showers\n(perhaps the primary goal) to other topics in astrophysics.\nOur pilot phase will take place in Boston, which, with its\ndense population of schools, is naturally conducive to a reasonably granular detector. In this phase, therefore, SCROD\nwill function somewhat like earlier experiments such as AGASA\nand CASA, sampling the shower front with scintillators.\nDepending on what the highest energy cosmic rays actually are, it is conceivable that there exist long-range correlations among the air showers they produce. Either observation or non-observation of such correlations would be an\nimportant result which cannot readily be obtained except by\ngeographically extensive experiments.\nSeveral processes could give rise to very long-range correlations. One is the Gerasimova-Zatsepin (GZ) effect (Gerasimova and Zatsepin, 1960; Medina-Tanco and Watson, 1999;\nEpele, Mollerach and Roulet, 1999), in which a high energy\natomic nucleus approaches the earth and dissociates on an\noptical photon from the sun. The (two or more) nuclear fragments can then reach the earth at distant locations, but close\ntogether in time. Since the composition of high energy cosmic rays is unknown, and its determination from single extensive air showers is complicated by sensitivities of observables to details of the hadronic interaction model chosen, it\nwould be interesting to search for such events.\nIn the GZ effect, the distance by which nuclear fragments\nare separated upon arrival at the earth depends on their deflection in the magnetic field of the solar system. Recent\nanalysis (Medina-Tanco and Watson, 1999) for iron nuclei\nhas indicated that very large separations are to be expected.\nFor iron nuclei with energy around 1 EeV, for example, most\nseparations wll be in excess of 100 km. Clearly, extensive detectors are required to observe such events. Figure 1 shows\nroughly the expected rate for various separations (see the appendix for more detail).\n\n\f2\ncurrent prototype phase, we are involving a few high school\nstudents and beginning undergraduates directly in the development efforts. Aside from its value to the students, this\nhelps us to ascertain which aspects of the project will have\nto be kneaded into a more pedagogically usable form.\n4 Detector Description\n\nFig. 1. Expected rates versus energy for correlated events due to\niron nuclei disintegrating on solar photons. This figure is for the\ncase of events arriving from a direction close to the sun. The three\nlines show approximate rates characteristic of the separations attainable in different geographical areas (the Boston area, the entire state of Massachusetts, and a separation of roughly the distance\nfrom Boston to Chicago.)\n\nThere are also other conceivable mechanisms to produce a\nsimilar effect. For example highly energetic dust grains could\ndissociate and give rise to widely-separated showers (Anchordoqui , 2000). One might also conceive of dramatic cosmic events that may also pepper the globe with many high\nenergy cosmic rays all at about the same time. With the GPS\ntiming information, it will be possible to compare and correlate data taken with SCROD with those taken at neutrino and\ngravitational radiation detectors. Finally we note that there is\nalready some suggestion of experimental evidence for long\nrange correlations in the literature (Wada et al., 1999; Carrel\nand Martin, 1993).\nThe primary background for genuine long-range correlations will arise from random coincidences of low energy showers. This can be controlled by detector spacing, which effectively sets an energy threshold, and possibly pulse-height\nanalysis of the scintillator signals.\n3\n\nEducation Goals\n\nThe goal is that students, under the advisement of professional physicists and their teachers, will be responsible for\nthe day-to-day running of the experiment, for the data analysis and search for time correlations, and will in some cases\ndevise unique projects using their station. We are also consulting with area teachers to begin developing ways to use\nthe apparatus to catalyze related classroom activities. At the\n\nThe hardware proposed for the detector sites consists of the\nfollowing main components: 1) a set of plastic scintillating tiles with wavelength-shifting fibers; 2) avalanche photodiodes to read out the fibers; 3) a GPS-based system to\ntime-stamp the signals; 4) a personal computer (PC) for local data acquisition and 5) the Internet to provide an inexpensive wide-area data acquisition system. A single station will\nbe equipped with 3–5 separate scintillators, arranged on the\nschool rooftop. We plan to procure new detector equipment\n(scintillators and fibers) while recycling computers, which\notherwise would be the single most expensive component of\nthe system. In this way we can deliver a quality detector at\nreasonable cost.\n4.1 Scintillating Tiles with APD Readout\nThe scintillator we use is adapted from technology developed for the LHC-b pad/preshower detector (LHC-b Collab.\n, 1998), and comprises a 30 × 30 cm plastic scintillator slab\nwith two circular grooves machined in it. Three wavelength–\nshifting fibers (Bicron BCF-91) are embedded in the grooves,\n1 in the inner grove, 2 in the outer, to shift the scintillation\nlight into the sensitive region of the readout apparatus and to\nserve as a light guide. The scheme is illustrated in Figure 2.\nThe entire assembly is wrapped in white Tyvek 2 paper to\nincrease light collection efficiency.\n300 mm\n\n280 mm\n140 mm\n\nA\nB\nA\nB\nA\nB\n\nC\nA,B\n\nC\n\nC\n\nA\nB\nA\nB\nA\nB\n\nC\n\nA,B\n\nFig. 2. Schematic representations of scintillators with embedded\nwavelength-shifting fibers.\n\nTo read out the fibers, we use an avalanche photodiode\n(APD). APDs are essentially photodiodes with an internal\ngain mechanism. They can have high quantum efficiencies,\nexceeding those of photomultiplier tubes. They are also mechanically robust (Baccaro, et al., 1999; Musienko, et al.,\n2\n\nTyvek is a trademark of DuPont.\n\n\f3\n2000; Marler, et al., 2000) and easy to use, requiring a supply\nof only a few hundred volts, a current-limiting resistor, and\na preamplifier. Furthermore, they require only a few hundred nanoamperes of current to function; an apparatus which\npresents no risk of electric shock is attractive for deployment\nat schools.\nUsing a low-noise amplifier we have designed together\nwith the scintillator-fiber-APD assembly yields a very clean\nsignal, as shown in Figure 3.\n\nGPS\nAntenna\nHV\n\nScintillator\nRoof\n\n00111100\n11001100\n\n1100\nevents/ADC count\n\nAmp\n\nScintillator\n\nInterface\nBoard\n\n111\n000\n\nTime\nBoard\n\n111000\n000\n111\n\n00111100\n1100\n\nAmp\n\n1100\n\nInterface\nBoard\n\n111\n000\n\nAmp\n\nScintillator\n\n1100\n\n11\n00\n00\n11\n\nInterface\nBoard\n\n1100\n\n111\n000\n\nData Acquisition\nComputer\n\nGPS\nReceiver\n\nFig. 4. Readout scheme for a SCROD station. The Time Board\nbroadcasts the time count, using the 1PPS signal from the GPS receiver to stay synchronized to universal time. The Interface Boards\nlatch the time upon receipt of a signal from a scintillator, then relay\nit to the computer.\n\n600\n\n400\n\n200\n\n0\n\n0\n\n100\n\n200\n\n300 400 500\nADC counts\n\nsoftware trigger; all hits are stored in their respective serial\nports and accessed by reader programs running as separate\nthreads on the PC. A triggering module can access the data\nfrom the different threads and apply trigger logic. This allows students to develop their own triggering schemes in a\nvery easy manner, and it also will facilitate future upgrades\nand uniformity among all the stations. Changing the trigger\nwill only entail uploading a new piece of code, instead of\naltering the hardware at numerous sites.\n5 Summary\n\nFig. 3. Signal due to single muons passing through the scintillator\nusing APD readout.\n\n4.2 GPS Timestamp and Data Acquisition\nIn the current prototype version, the amplifier signal is passed\nthrough a discriminator to generate a TTL pulse, which is\nused to latch the time of each hit. The time is broadcast from\na central board comprised of two sets of counters, one of\nwhich records the number of pulses delivered by the GPS receiver's 1 pulse per second (1PPS) line, while the other is\nclocked by an on-board 100 MHz oscillator and reset each\nsecond by the 1PPS line. The timing resolution offered by\nthe fast rising edge of the 1PPS signal is about 40 ns. Each\nscintillator has its own time latching circuitry which converts\nthe time to serial RS-232 signals and relays it to a serial port\nin the computer; there is one serial port for each scintillator. This design is reasonably modular so that a given site\ncan easily attach another scintillator, or in principle any other\npiece of hardware which records data that should be timestamped. The basic scheme is illustrated in Figure 4.\nThis design also allows for very simple electronics. Our\nprototypes were constructed by first-year undergraduate students using quite inexpensive off-the-shelf components.\nTo the extent possible, we are devising a purely offline\n\nWe are adapting detector technologies from our work on LHC\nexperiments to develop inexpensive cosmic air shower detectors suitable for deployment at high schools. The primary\ngoal is to interest students in physics by involving them directly in a project which has the potential to make some\nmeaningful measurements. The essential ingredients have\nbeen designed and tested (partly by students) and construction of a station for deployment is underway.\nAppendix A\nThe rate of occurrence of these kind of events is given by the\ncosmic ray flux, the fragmentation probability, and the fraction of GZ events with separation distance d < dmax , fdmax .\nThe rate of events above a given energy E for a surface detector of area S and solid angle Ω reads,\nRate(ECR > E) ∼ Φ(ECR > E) ηGZ (E) fdmax S Ω, (A1)\nFe\nwhere ηGZ\n(E) ∼ 10−5 − 10−4 is the fragmentation probability, and\n\u00132\n\u0012\nEeV\nkm−2 yr−1 sr−1 ,\n(A2)\nΦ(ECR > E) ∼ 47\nE\n\nis the measured cosmic ray flux above the knee (ECR > 3 ×\n1015 eV).\n\n\f4\nAcknowledgements. This work was supported in part by the National Science Foundation and CONICET.\n\nReferences\nAnchordoqui, L.A., Phys. Rev. D 61 (2000) 087302.\nBaccaro, S. et al., Nucl. Instr. Meth. A426 (1999) 206.\nCarrel, O. and Martin, M., Phys. Lett. B325 (1993) 221.\nEpele, L., Mollerach, S., Roulet, E., J. High Energy Phys. 03 (1999)\n17.\nGerasimova, N.M. and Zatsepin, G.T. Sov. Phys. JETP 11 (1960)\n899.\nLHC-b Collab. Technical Proposal is available at\nhttp://lhcb-tp.web.cern.ch/lhcb-tp/\nMarler, J. et al., Nucl. Instr. Meth. A449 (2000) 331.\nMedina Tanco, G. and Watson, A.A. Astropart. Phys. 10 (1999) 157.\nMusienko, Y. et al., Nucl. Instr. Meth. A447 (2000) 437.\nWada, T., Nucl. Phys. B (Proc. Suppl.) 75A (1999) 330.\n\n\f"}