{"id": "http://arxiv.org/abs/hep-th/0205317v1", "guidislink": true, "updated": "2002-05-30T23:05:34Z", "updated_parsed": [2002, 5, 30, 23, 5, 34, 3, 150, 0], "published": "2002-05-30T23:05:34Z", "published_parsed": [2002, 5, 30, 23, 5, 34, 3, 150, 0], "title": "Hagedorn Inflation: Open Strings on Branes Can Drive Inflation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0205010%2Chep-th%2F0205317%2Chep-th%2F0205266%2Chep-th%2F0205062%2Chep-th%2F0205002%2Chep-th%2F0205319%2Chep-th%2F0205145%2Chep-th%2F0205236%2Chep-th%2F0205153%2Chep-th%2F0205249%2Chep-th%2F0205168%2Chep-th%2F0205117%2Chep-th%2F0205047%2Chep-th%2F0205067%2Chep-th%2F0205190%2Chep-th%2F0205161%2Chep-th%2F0205144%2Chep-th%2F0205165%2Chep-th%2F0205180%2Chep-th%2F0205070%2Chep-th%2F0205283%2Chep-th%2F0205023%2Chep-th%2F0205233%2Chep-th%2F0205055%2Chep-th%2F0205038%2Chep-th%2F0205220%2Chep-th%2F0205099%2Chep-th%2F0205238%2Chep-th%2F0205264%2Chep-th%2F0205086%2Chep-th%2F0205077%2Chep-th%2F0205312%2Chep-th%2F0205136%2Chep-th%2F0205274%2Chep-th%2F0205001%2Chep-th%2F0205286%2Chep-th%2F0205058%2Chep-th%2F0205289%2Chep-th%2F0205288%2Chep-th%2F0205154%2Chep-th%2F0205040%2Chep-th%2F0205212%2Chep-th%2F0205045%2Chep-th%2F0205028%2Chep-th%2F0205299%2Chep-th%2F0205198%2Chep-th%2F0205204%2Chep-th%2F0205273%2Chep-th%2F0205226%2Chep-th%2F0205279%2Chep-th%2F0205291%2Chep-th%2F0205207%2Chep-th%2F0205260%2Chep-th%2F0205075%2Chep-th%2F0205011%2Chep-th%2F0205056%2Chep-th%2F0205082%2Chep-th%2F0205102%2Chep-th%2F0205295%2Chep-th%2F0205322%2Chep-th%2F0205308%2Chep-th%2F0205156%2Chep-th%2F0205009%2Chep-th%2F0205184%2Chep-th%2F0205016%2Chep-th%2F0205232%2Chep-th%2F0205174%2Chep-th%2F0205304%2Chep-th%2F0205052%2Chep-th%2F0205300%2Chep-th%2F0205315%2Chep-th%2F0205192%2Chep-th%2F0205298%2Chep-th%2F0205292%2Chep-th%2F0205042%2Chep-th%2F0205239%2Chep-th%2F0205275%2Chep-th%2F0205169%2Chep-th%2F0205189%2Chep-th%2F0205216%2Chep-th%2F0205229%2Chep-th%2F0205118%2Chep-th%2F0205284%2Chep-th%2F0205228%2Chep-th%2F0205146%2Chep-th%2F0205108%2Chep-th%2F0205026%2Chep-th%2F0205150%2Chep-th%2F0205242%2Chep-th%2F0205141%2Chep-th%2F0205258%2Chep-th%2F0205285%2Chep-th%2F0205167%2Chep-th%2F0205248%2Chep-th%2F0205122%2Chep-th%2F0205043%2Chep-th%2F0205143%2Chep-th%2F0205037%2Chep-th%2F0205048%2Chep-th%2F0205265%2Chep-th%2F0205107&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Hagedorn Inflation: Open Strings on Branes Can Drive Inflation"}, "summary": "We demonstrate an inflationary solution to the cosmological horizon problem\nduring the Hagedorn regime in the early universe. Here the observable universe\nis confined to three spatial dimensions (a three-brane) embedded in higher\ndimensions. The only ingredients required are open strings on D-branes at\ntemperatures close to the string scale. No potential is required. Winding modes\nof the strings provide a negative pressure that can drive inflation of our\nobservable universe. Hence the mere existence of open strings on branes in the\nearly hot phase of the universe drives Hagedorn inflation, which can be either\npower law or exponential. We note the amusing fact that, in the case of\nstationary extra dimensions, inflationary expansion takes place only for branes\nof three or less dimensions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0205010%2Chep-th%2F0205317%2Chep-th%2F0205266%2Chep-th%2F0205062%2Chep-th%2F0205002%2Chep-th%2F0205319%2Chep-th%2F0205145%2Chep-th%2F0205236%2Chep-th%2F0205153%2Chep-th%2F0205249%2Chep-th%2F0205168%2Chep-th%2F0205117%2Chep-th%2F0205047%2Chep-th%2F0205067%2Chep-th%2F0205190%2Chep-th%2F0205161%2Chep-th%2F0205144%2Chep-th%2F0205165%2Chep-th%2F0205180%2Chep-th%2F0205070%2Chep-th%2F0205283%2Chep-th%2F0205023%2Chep-th%2F0205233%2Chep-th%2F0205055%2Chep-th%2F0205038%2Chep-th%2F0205220%2Chep-th%2F0205099%2Chep-th%2F0205238%2Chep-th%2F0205264%2Chep-th%2F0205086%2Chep-th%2F0205077%2Chep-th%2F0205312%2Chep-th%2F0205136%2Chep-th%2F0205274%2Chep-th%2F0205001%2Chep-th%2F0205286%2Chep-th%2F0205058%2Chep-th%2F0205289%2Chep-th%2F0205288%2Chep-th%2F0205154%2Chep-th%2F0205040%2Chep-th%2F0205212%2Chep-th%2F0205045%2Chep-th%2F0205028%2Chep-th%2F0205299%2Chep-th%2F0205198%2Chep-th%2F0205204%2Chep-th%2F0205273%2Chep-th%2F0205226%2Chep-th%2F0205279%2Chep-th%2F0205291%2Chep-th%2F0205207%2Chep-th%2F0205260%2Chep-th%2F0205075%2Chep-th%2F0205011%2Chep-th%2F0205056%2Chep-th%2F0205082%2Chep-th%2F0205102%2Chep-th%2F0205295%2Chep-th%2F0205322%2Chep-th%2F0205308%2Chep-th%2F0205156%2Chep-th%2F0205009%2Chep-th%2F0205184%2Chep-th%2F0205016%2Chep-th%2F0205232%2Chep-th%2F0205174%2Chep-th%2F0205304%2Chep-th%2F0205052%2Chep-th%2F0205300%2Chep-th%2F0205315%2Chep-th%2F0205192%2Chep-th%2F0205298%2Chep-th%2F0205292%2Chep-th%2F0205042%2Chep-th%2F0205239%2Chep-th%2F0205275%2Chep-th%2F0205169%2Chep-th%2F0205189%2Chep-th%2F0205216%2Chep-th%2F0205229%2Chep-th%2F0205118%2Chep-th%2F0205284%2Chep-th%2F0205228%2Chep-th%2F0205146%2Chep-th%2F0205108%2Chep-th%2F0205026%2Chep-th%2F0205150%2Chep-th%2F0205242%2Chep-th%2F0205141%2Chep-th%2F0205258%2Chep-th%2F0205285%2Chep-th%2F0205167%2Chep-th%2F0205248%2Chep-th%2F0205122%2Chep-th%2F0205043%2Chep-th%2F0205143%2Chep-th%2F0205037%2Chep-th%2F0205048%2Chep-th%2F0205265%2Chep-th%2F0205107&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We demonstrate an inflationary solution to the cosmological horizon problem\nduring the Hagedorn regime in the early universe. Here the observable universe\nis confined to three spatial dimensions (a three-brane) embedded in higher\ndimensions. The only ingredients required are open strings on D-branes at\ntemperatures close to the string scale. No potential is required. Winding modes\nof the strings provide a negative pressure that can drive inflation of our\nobservable universe. Hence the mere existence of open strings on branes in the\nearly hot phase of the universe drives Hagedorn inflation, which can be either\npower law or exponential. We note the amusing fact that, in the case of\nstationary extra dimensions, inflationary expansion takes place only for branes\nof three or less dimensions."}, "authors": ["Steven Abel", "Katherine Freese", "Ian Kogan"], "author_detail": {"name": "Ian Kogan"}, "author": "Ian Kogan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0370-2693(03)00414-3", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0205317v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0205317v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Talk given by Katherine Freese", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0205317v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0205317v1", "journal_reference": "Phys.Lett.B561:1-9,2003", "doi": "10.1016/S0370-2693(03)00414-3", "fulltext": "MCTP-02-25\n\narXiv:hep-th/0205317v1 30 May 2002\n\nHagedorn Inflation: Open Strings on Branes Can Drive\nInflation\nSteven Abela,1 , Katherine Freese\n\nb,2\n\n, Ian I. Kogan\n\nc,3\n\na Dept. of Mathematical Sciences, University of Durham, Science Laboratories,\nSouth Rd., Durham DH1 3LE, United Kingdom\nb Michigan Center for Theoretical Physics, University of Michigan, Ann Arbor MI\n48109-1120, USA\nc Theoretical Physics, 1 Keble Rd, Oxford OX1 3NP, UK\n\nAbstract\n\nWe demonstrate an inflationary solution to the cosmological horizon problem during the\nHagedorn regime in the early universe. Here the observable universe is confined to three\nspatial dimensions (a three-brane) embedded in higher dimensions. The only ingredients\nrequired are open strings on D-branes at temperatures close to the string scale. No\npotential is required. Winding modes of the strings provide a negative pressure that can\ndrive inflation of our observable universe. Hence the mere existence of open strings on\nbranes in the early hot phase of the universe drives Hagedorn inflation, which can be either\npower law or exponential. We note the amusing fact that, in the case of stationary extra\ndimensions, inflationary expansion takes place only for branes of three or less dimensions.\n\n1\n\nS.A.Abel@durham.ac.uk\nktfreese@umich.edu\n3\ni.kogan@physics.ox.ac.uk\n2\n\n\f1\n\nIntroduction\n\nInflationary cosmology [1] was proposed as a solution to the horizon, flatness, and monopole\nproblems of the standard Hot Big Bang scenario. The cosmological horizon problem can\ndt\no\nbe stated as follows: The comoving size of our observable universe today is Lo = ttdec\n,\na(t)\nwhere a(t) is the scale factor, tdec is the time of radiation decoupling, and to is the age\nof the universe today. This lengthscale must fit inside the comoving size of the horizon\n\nR\n\ndt\n. To explain\n(a causal region) at some early time tn (before decoupling), Ln = otn a(t)\ncausal contact of all points of our observable universe at tn , we need Lo < Ln . For power\n\nR\n\nlaw expansion of the scale factor both before tn and after tdec , this condition becomes\n1\n≥ ao1Ho where the Hubble constant H = ȧ/a. Inflation solves this causality conan Hn\ndition with a period of accelerated expansion, ä > 0, corresponding to a superluminal\nexpansion of the scale factor. In the standard 3+1 dimensional universe, the Friedmann\n\n4π\nRobertson Walker (FRW) equations imply aä = − 3m\n2 (ρ + 3p). Hence accelerated expanpl\nsion is provided by a negative pressure. In standard inflationary models, this negative\npressure is provided by a vacuum energy (a potential) with p = −ρ.\n\nWe have found [2] an entirely different source of negative pressure: open strings on Dbranes at temperatures close to the string scale. Although Einstein's equations in higher\ndimensions take a different form than the FRW equation above, negative pressure can\nstill drive inflation. Note that there is no potential of any kind in our model; instead,\nopen strings on branes drive the inflation.\nAt sufficiently high temperatures and densities fundamental strings enter a curious\n'long string' Hagedorn phase [3, 4, 5, 6, 7, 8]. A classical random walk picture can be used\nto model the behaviour of the strings in cosmological backgrounds. The particular systems\nwe will focus on are D-branes in the weak coupling limit [9]. In particular, we consider\nthe scenario in which our observable universe is confined to three spatial dimensions (a\nthree-brane) embedded in higher dimensions. We will denote the rest of the universe\noutside of our 3-brane as the bulk. We can separate the energy momentum tensor into\ntwo components: a localized component corresponding to the D-brane tension, and a\ndiffuse component that spreads into the bulk corresponding to open string excitations of\nthe brane. We find an interesting type of cosmological effect of a primordial Hagedorn\nphase of open strings on branes:\n• Hagedorn inflation. The transverse 'bulk' components of the energy-momentum\ntensor can be negative. If all of the transverse dimensions have winding modes,\nthis negative 'pressure' causes the brane to power law inflate along its length with\na scale factor that varies as a ∼ t4/3 even in the absence of a nett cosmological\n\nconstant (as shown in eq.(19)). If there are transverse dimensions that are large (in\n1\n\n\fthe sense that the string modes are not space-filling in these directions), then we\ncan find exponential inflation (as shown in eq.(20)). No potential is required here.\nMerely the existence of open strings on D-branes drives the inflation.\nWe begin by discussing string thermodynamics of open strings on D-branes at high\ntemperatures near the string scale. We argue that the features relevant to this paper can\nbe derived by obtaining the density of states from a random walk picture. From the density\nof states one can derive a partition function. Then the partition function gives the energymomentum tensor, the principal ingredient of Einstein's equations. Winding modes of the\nstrings give rise to a negative 'pressure' in the bulk (the directions perpendicular to the\nthree-brane on which we live). This energy-momentum tensor, given in Eq.(13), is one of\nthe most important results of the paper. Armed with the energy-momentum tensor, we\nexamine the resultant cosmology. We can solve Einstein's equations with various ansätze\nin the presence of this negative bulk component. Our primary result is that we find\nHagedorn inflation of our observable universe due to the negative pressure in the bulk.\nIf one assumes adiabaticity, the inflationary growth period drives down the temperature of the system; eventually the temperature drop causes the universe to leave the\nHagedorn regime, and consequently inflation ends automatically. In fact our solutions are\nonly valid for small changes in the metric corresponding to small changes in the volumes,\ni.e., we can demonstrate instability to inflationary expansion but cannot follow the solutions further. If one uses the solutions beyond the region of their validity, the period of\nsuperluminal growth ends too quickly to solve cosmological problems. Hence we do also\ndiscuss how, in non-adiabatic systems, inflation can be sustained.\nAn amusing result is that power law inflation in the universal high energy system only\ntakes place if the number of large dimensions on the brane is p ≤ 3. In addition, branes\ntend to 'melt' unless p ≤ 4. Hence one can speculate on the role of these effects in the\nfact that our observable universe has three large dimensions.\n\n2\n\nThe Hagedorn phase and random walks\n\nPrevious work ref.[7] obtained the thermodynamic properties of D-branes in toroidal compactification using both microcanonical and canonical ensembles. The same results can\nbe obtained from a random walk argument, where the thermodynamic properties are\nindependent of the details of the compactification (e.g. nontoroidal) and the degree of\nsupersymmetry. Here we will derive an expression for the partition function based on a\nrandom walk argument. The reader interested only in the result for the energy-momentum\ntensor and the resultant cosmology should proceed directly to Eq.(13).\n\n2\n\n\f2.1\n\nString thermodynamics and the Hagedorn phase\n\nThe Hagedorn phase arises in theories containing fundamental strings because they have\na large number of internal degrees of freedom. Indeed, because of the existence of many\noscillator modes, the density of states grows exponentially with energy ε, ω(ε) ∼ ε−b eβH ε ,\n\nwhere the inverse Hagedorn temperature βH (where β = 1/T ) and the exponent b depend\non the particular theory in question (for example heterotic or type II) [3]. For type\n√\nI,IIA,IIB strings the numerical value of the inverse Hagedorn temperature is βH = 2 2π\nin string units. It is easy to see that thermodynamic quantities, such as the entropy, are\nliable to diverge at the Hagedorn temperature; obtaining the partition function Z with\nthe canonical ensemble and multiplying by the usual Boltzmann factor e−βε , one finds\nR\nan integral for the partition function (for large ε) Z ∝ dεε−be(βH −β)ε which diverges at\n\nβ = βH for b ≤ 2.\nIn the Hagedorn regime, fundamental strings can be described as 'long strings' in a\n\nrandom walk analogy. [In a one-dimensional random walk, with each step one has 2\nchoices of direction (right or left) leading after 'n' steps to the factor 2n = e(log2)n , which\nmimics the exponential behavior of ω(ε) above.] The size of the random walk (the distance\n√\ncovered by the string) is given by the length scale ε. The physical setup is shown in\nFigure 1.\n\nFigure 1: We consider a volume, portrayed by the box, containing a single brane embedded\nin the bulk. The quantity R|| indicates the size of the dimensions parallel to the brane\n(for cosmology, R|| → ∞) and R⊥ indicates the size of the dimensions perpendicular to\n√\nthe brane. The random walk√of strings attached to the brane traverses\n√ a distance ε.\nFigs. 1a represents the case ǫ << R⊥ . Fig. 1b represents the case ǫ >> R⊥ . This\nlatter case is our standard high energy case in which all modes are space-filling (effectively,\n\"winding modes\").\n\n3\n\n\fWe consider a volume, portrayed by the box, containing a single brane. The quantity\nR|| indicates the size of the dimensions parallel to the brane (for cosmology, R|| → ∞)\nand R⊥ indicates the size of the dimensions perpendicular to the brane. The random\n√\nwalk of strings attached to the brane traverses a distance ε. Figs. 1a and 1b show\n√\n√\nthe cases ǫ << R⊥ and ǫ >> R⊥ respectively. In this paper we are particularly\ninterested in the high energy case of fig. 1b, in which the strings fill all the space; for\nthe case of toroidal compactification this corresponds to winding modes. We will use the\nnomenclature 'winding modes' to encompass these space-filling modes regardless of the\ntype of compactification. We define do to be the number of dimensions transverse to the\nbrane in which there are no windings. As our standard 'high-energy' regime, we will take\nthe case of do = 0, so that all dimensions have windings; this is the system which is always\nreached provided that the the energy density is high enough.\nIn ref.[7], results for the entropy density for various limiting systems of different values\nof do were obtained in the microcanonical ensemble working in an approximation to the\nthermodynamic limit. In ref.[7] a random walk interpretation with the appropriate combinatorics was also used to obtain the distribution function ω(ε) for open strings attached\nto a brane:\nω(ε)open ∼\n\nVk\nd\nε ⊥ /2\n\nexp (βH ε)\n\nR⊥ ≫\n\n√\n\nε.\n\n(1)\n\nand\n\n√\nVk\n(2)\nexp (βH ε)\nR⊥ ≪ ε.\nV⊥\nOne can now adapt the random walk to a cosmological background. In the case of\na non-trivial metric the most natural interpretation of the parameter ε is that it is the\nω(ε)open ∼\n\nproper length of a string in the bulk and certainly we can always go to the local inertial\nframe in which a small portion of the string has the usual Euclidean energy ≡ length\nequivalence.\nWe first make the usual quasi-equilibrium approximation that equilibrium is established much more quickly than any change in the metric so that the metric may be taken\nto be approximately constant in time when evaluating properties such as density. In order to simplify matters, we also assume that the metric is expressed in terms of parallel\ndimensions x and transverse ones y\nds2 = −n2 dt2 + g||ij dxi dxj + g⊥nm dy n dy m,\n\n(3)\n\nwith the brane lying at y n = 0. We also define an averaging over the extra dimension\nwith an overbar,\nR\n√\ndy g⊥ O(y)\n.\n(4)\nO = R ′√\ndy g⊥\n4\n\n\fIn [2], we found the density of states for the limiting systems to be the same expression as\nin the flat space case of eq. (2) but with all volumes averaged over transverse dimensions\nas in eq.(4).\n\n2.2\n\nPartition Function\n\nNow that we have obtained a density of states of open strings attached to branes near\nthe Hagedorn temperature, we can find the partition function at temperature 1/β,\nlog Z(β, Vk , V⊥ ) ∼\n\nZ\n\ndε ω(ε) e−βε .\n\n(5)\n\nIn the standard do = 0 case,\n2\n\n2\nVk βH\n+ nonsingular cutoff terms\nlog Z(β, Vk, V⊥ ) = 2\n2\nV⊥ (β 2 − βH\n)\n\n(6)\n\nwhich are the successive terms in a saddle point approximation. In [2], we present the\ndensity of states and partition function for arbitrary values of do as well.\n\n3\n\nStress-energy tensor Tμν in a bulk Hagedorn phase\n\nWe now use these thermodynamic results to find the bulk energy momentum tensor during\nthe Hagedorn regime. We may find the energy momentum tensor from\ng μρ δ log Z(β, Vk , V⊥ )\n.\nhTνμ i = 2 √\ng\nδg ρν\n\n(7)\n\nWe will treat the functional derivative with respect to gμν in the following way. We assume\nthat small changes in the metric correspond to making small changes in the volumes in\nlog Z, e.g. for a single extra dimension\nδZ\n=\nδg55\n\nZ\n\ndx′\n\nδZ δV ⊥ (x′ )\n.\nδV ⊥ (x′ ) δg55\n\nThen, in the case of only one extra dimension, we can write\nR 5 √\nZ\nZ\nd x g55\n1\n√\n√\n=\nd5 x g55 ,\nV⊥ = dy g55 = R 4\ndx\nvβ\n\nand\n\nδV⊥\n1\n= √\n.\nδg55\n2 g55 Vk β\n\n(8)\n\n(9)\n\n(10)\n\nThen from eqs.(8–10) we can determine the functional derivative in eq.(7). Our ansatz\nautomatically means that T05 = 0 and hence G05 = 0; in other words we are not considering energy exchange between the brane and the bulk. (In general there might be energy\nflux between the two.)\n5\n\n\fWe now summarize the results for the energy-momentum tensor. We first drop the\noverline notation of the previous section and simply redefine V⊥ and Vk to be the transverse\nand parallel volumes covariantly averaged over the region of the transverse dimensions\ncovered by the strings. We define an energy density ρ of strings\nρ=\n\nE\nVk\n\n(11)\n\nand define\nγ = do /2 − 1\n\n(12)\n\nwhere do is the number of dimensions with no windings. We find that the 'bulk' components of the energy momentum tensor are given by\nT̂00 = −ρ̂\nT̂ii = p̂γ\n\nT̂mm\n\n≡ pbulk ≈\n\n(\n\n−p̂γ transverse with windings\n0\ntransverse without windings,\n\n(13)\n\nwhere ρ̂ = ρ/V⊥ and\n\np̂γ =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nγ\n\n1\nγ−1\n3/2 ρ\nV⊥\n\nif\n\nγ = −1, − 12 , 21\n\n1\n3/2\nV⊥\n\nif\n\nγ=0\n\nif\n\nγ = 1,\n\nlog ρ\n\n1\n−ρ\n3/2 e\nV⊥\n\n(14)\n\nwherever there are strings present, and zero otherwise. In particular, for our standard\nhigh energy case of γ = −1, the negative bulk pressure is:\n3/2\n\npbulk ∼ −ρ1/2 /V⊥ .\n\n(15)\n\nAs expected T̂00 resembles the local energy density of strings. The T̂ii represents a\nrelatively small pressure coming from Kaluza-Klein modes in the Neumann directions\nand T̂mm is a negative pressure coming from winding modes in the Dirichlet directions.\nIf we T-dualize the Dirichlet directions these 'winding modes' also become Kaluza-Klein\nmodes in Neumann-directions and Tmm becomes positive. Thus negative Tmm reflects the\nfact that we have T-dualized a dimension much smaller than the string scale thereby\nreversing the pressure. For this reason negative Tμμ is expected to be a general feature\nof space-filling excitations in transverse dimensions. The most important result of this\nsection is the negative bulk pressure found in Eqs.(13) and (15).\n\n6\n\n\f4\n\nCosmological Equations in D = 5\n\nWe now consider a D-brane configuration that has 3 large parallel dimensions (i.e. the\n'observable universe') and only one transverse dimension y that supports winding modes.\nFor now, we also assume adiabaticity.\nWe use the metric,\nds2 = −n2 dt2 + a2 dx2 + b2 dy 2,\n\n(16)\n\nwhich foliates the space into flat, homogeneous, and isotropic spatial 3-planes. Here\nx = x1 , x2 , x3 are the coordinates on the spatial 3-planes while y is the coordinate of the\nextra dimension. For simplicity, we make a further restriction by imposing Z2 symmetry\nunder y → −y. Without any loss of generality we choose the 3-brane of the 'observable\nuniverse' to be fixed at y = 0. We can associate a scale factor with the parallel dimensions\na(t, y) and one for the 'extra' transverse dimensions b(t, y). We define a0 (t(τ )) = a(t, 0)\nR\nas the scale factor describing the expansion of the 3-brane where t(τ ) ≡ dτ n(τ, y = 0)\nis the proper time of a comoving observer.\nSeveral authors [11] - [16] have presented the bulk Einstein equations. For illustrative\n\npurposes we restate the results for the 55 (yy) equation:\nĜ55\n\na′\n=3\na\n(\n\na′ n′\n+\na\nn\n\n!\n\nb2 ȧ\n− 2\nn a\n\"\n\n!\n\nä\nȧ ṅ\n+\n−\na n\na\n\n#)\n\n= κ̂2 T̂55 ,\n\n(17)\n\nwhere κ̂2 = 8π Ĝ = 8π/M53 , M5 is the five-dimensional Planck mass, and the dots and\nprimes denote differentiation with respect to t and y, respectively. As stated earlier, our\nansatz implies that T05 = 0 in the bulk. Shortly we will use the Tμν appropriate to the\nHagedorn regime on the right hand side of Einstein's equations.\nFrom Eqn.(17), one can see right away the importance of negative components of\nthe bulk energy momentum tensor. In the case\" where\ntime\nderivatives of a dominate on\n!\n#\n2\n\nthe left hand side of the equation, one has\n\nb2\nn2\n\nȧ\na\n\n+\n\nä\na\n\n= −κ̂2 T̂55 . One can see that\n\naccelerated expansion ä > 0, which is required for inflation, takes place with a negative\nT̂55 such as that found in Eqns.(13) and (15).\nIn addition to the bulk Einstein equations, we have boundary conditions (the Israel\njump conditions [11]-[16]) due to the fact that our observable brane is embedded in the\nbulk. We will assume that the energy momentum tensor on the boundary can be written\nin a perfect fluid form, t00 = ρbr and t11 = −pbr , where ρbr and pbr are the energy density\nand pressure, respectively, measured by a comoving observer. For the metric in eq.(16)\nand the brane at a Z2 symmetry fixed plane, the Israel conditions become\n3[a′ /a]0 = −κ̂2 b0 ρbr\n\n3[n′ /n]0 = κ̂2 b0 (2ρbr + 3pbr ) .\n7\n\n(18)\n\n\fIn the next section, we will solve Einstein's equations together with the constraints provided by the Israel conditions, using the energy momentum tensor we have obtained for\nthe primordial Hagedorn regime.\nBefore turning to our results, let us compare the relative contributions of the stringy\nexcitations and of the D-brane tension to the cosmology. Somewhat counterintuitively, we\nconclude that the diffuse stringy component can have a dominant effect on the cosmology\neven in the weak coupling limit (see the discussion in [2]). The intrinsic tension of the\nD-brane, TD ∼ 1/κ̂, with κ̂ ∼ gs , appears large for small coupling. However, using the\nIsrael conditions, we see that the contribution of the brane tension to terms in Einstein's\nequations is of the form κ̂4 TD2 ∼ κ̂2 while the contribution of the stringy components is\nκ̂2 ρ/V⊥ or κ̂2 pγ . Since we have assumed ρ ≤ TD in order for the perturbative treatment\nof the D=brane to be valid, we see that the stringy contribution to the cosmological\nequations can be O(κ̂) while that from the intrinsic tension is O(κ̂2 ); thus weak coupling\nis advantageous for string dominance in the cosmology. In addition, the Yang-Mills degrees\nof freedom on the brane are subdominant to the bulk degrees of freedom near TH .\n\n5\n\nResults: Behaviour of scale factors a(t) and b(t):\nInflation without Inflatons\n\nOur results are obtained by solving Einstein's equations together with the constraints\nprovided by the Israel conditions. We use the energy momentum tensor derived above\nin Eq.(13) appropriate to a primordial Hagedorn epoch. First we will consider the case\nwhere the brane is energy/pressureless and that ḃ = 0 (where b is the scale factor of the\nextra dimension). We then catalogue more general types of behaviour that can occur for\nḃ 6= 0.\n\n5.1\n\nCase I: Λbr = Λbulk = ḃ = 0\n\nLet us first impose ḃ = 0 simply as an external condition; i.e. the extra dimension is\nfixed in time. We also set the cosmological constants both on the brane and in the bulk\nto zero, Λbr = Λbulk = 0. All other contributions to the energy momentum localized on\nthe brane (for example massless Yang-Mills degrees of freedom) have an entropy that is\nsubdominant to the limiting bulk degrees of freedom as long as the string energy density\nρ > ρc (where ρc is a critical Hagedorn density of order 1 in string units). For the moment\nwe will therefore neglect the brane energy-momentum and set a′ (t, 0) = n′ (t, 0) = 0. In\nthis discussion the brane at y = 0 is playing no role in determining the evolution of the\ncosmology; the scale factor a0 changes purely as a result of the bulk equations. It is simple\nto solve the 55 equation for the scale factor a0 (t) ≡ a(t, 0) on our brane (at y = 0).\n8\n\n\fStandard case with do = 0: In the high energy case with windings in all transverse di√\nmensions we see from Eqs.(13) and (15) that T55 ∼ ρ ∼ a−3/2 (where, again, ρ is the\nlocal energy density measured with respect to the volume Vk ) and hence,\na0 (t) ∼ t4/3 ,\n\n(19)\n\ni.e. power law inflation. For the more general case of 'p' large parallel dimensions in\nany number of extra perpendicular dimensions, we find T55 ∼ a−p/2 and a ∼ t4/p . Here\n\nadiabaticity has been assumed in taking E ∼ S ∼ const. We note the amusing result that\ninflation requires p ≤ 3 (for our brane p = 3) and speculate on its role in our three large\n\nextra dimensions.\nCase with do = 2: In the case of 2 dimensions with no windings, we find a period of\nexponential inflation:\n\n\nv\n\n\n\nu 2\nt2 κ̂2\na0 (t)\nu κ̂\n= exp − 3 + tt 3 log(ρ(0)e3/4 )\na0 (0)\n8V 2\n6V 2\n⊥\n\n(20)\n\n⊥\n\nwhere ρ(0) is the initial density at t = 0. Initially the second term in the exponent\ndominates and there is exponential inflation. This solution has an automatic end to\ninflation when ρ(t) ∼ 1 (in string units), just as the system is dropping out of the Hagedorn\nphase.\nOther systems: We summarize the energy momentum tensors and cosmological behavior\nof a0 (t) for systems with do perpendicular dimensions without windings in Table 1, where\np = 3 in our 'toy-model'. Superluminal expansion is found for systems with do ≤ 2, i.e.,\nno more than two perpendicular dimensions without windings.\nIn adiabatic systems the Hagedorn regime and hence the inflationary behaviour we\n\nhave found eventually come to an end. For a system to be in the Hagedorn regime\nrequires an entropy density higher than the critical Hagedorn density (of order 1 in string\nunits). Below this density the energy momentum tensor and hence the cosmology is\ngoverned by the massless relativistic Yang-Mills gas (the gas is present on the brane even\nin the Hagedorn regime but is subdominant). Thus there is no problem exiting from the\ninflationary behaviour. In fact the main issue is how long inflation can last. We return\nto this question later when we discuss how inflation can be sustained.\nIn all cases, we have also found solutions to the T00 and Tii equations.\n\n5.2\n\nCase II:\n\nκ̂2 2\n12 Λbr\n\n− Λbulk = 0 and ḃ 6= 0\n\nWe also studied the case where the extra dimension is not stabilized but there is still no\nnett cosmological constant. By 'nett' we mean that the contribution from a′ and n′ in G55\n9\n\n\fregime\ndo\ndo\ndo\nd0\nd0\n\n=0\n=1\n=2\n=3\n=4\n\nρ(β) = E/Vk\n\n−pbulk\n\n− βH )−2\n3\n(β − βH )− 2\n(β − βH )−1\n1\n(β − βH )− 2\n− log(β − βH )\n\nρ2\n1\nρ3\nlog ρ\nρ−1\ne−ρ\n\na0 (t)/a0 (0)\n4\n\n1\n\n1\nV⊥ (β\n\ntp\n6\ntp\n\u0001\nexp −Ct2 + Dt\n2\nt− p\nconst\n\nTable 1: Cosmological regimes for open strings in the Hagedorn phase with p large parallel\ndimensions, where p = 3 for our observable universe as a 3-brane. Here d0 is the number\nof dimensions transverse to the brane in which there are no windings; in our standard\n\"high-energy\" regime we take d0 = 0. Here ρ is the energy density of strings, i.e. , the T00\ncomponent of the bulk energy-momentum tensor. In addition, T55 = pbulk is the negative\nbulk pressure that drives inflation of our scale factor a0 (t). Note inflationary expansion\nfor do ≤ 2, i.e., at most 2 directions without windings. The constants C and D are given\nfor p = 3 in eq.(20).\ncancels the bulk contribution on the RHS of the T55 equation. The condition for this is\nΛnett = −\n\nκ̂2 2\nΛ + Λbulk = 0.\n12 br\n\n(21)\n\nUsing the 55 equation, we catalogued some possible types of behavior for a with different\nansätze for b. Since α ≈ 1, for γ = −1, − 12 , 12 (γ = do/2 − 1), the pressure is\n−3γ\n\n− pbulk ∝ a γ−1 b\n\n−3\n2\n\n.\n\n(22)\n\nTaking Λnett = 0, we find a family of power law solutions for γ = −1, − 21 , 21 of the form\na0 (t) ≈ Atq\n\nb0 (t) ≈ Btr\n\n(23)\n\nwhere subscript-0 indicates values at y = 0,\nq=\n\nγ −1 4\n( − r),\n2γ 3\n\n(24)\n\nand r is arbitrary. For our standard γ = −1, we find superluminal solutions with q > 1\n\nfor r < 1/3. Hence one can have an inflating brane with a shrinking bulk (r < 0) or with\na growing bulk (0 < r < 1/3). We also find a family of hyperbolic solutions with\nao (t)\n=\nao (0)\n\nsinh2C(t + t1 )\nsinh2Ct1\n\n!1/2\n\n.\n\n(25)\n\nThese solutions can give an exponentially increasing scale factor on our brane. The proper\nchoice of solution in Case II depends on the initial value of ḃo .\n10\n\n\f5.3\n\nCase III:\n\nκ̂2 2\n12 Λbr\n\n− Λbulk 6= 0 and ḃ 6= 0\n\nIn [2] we also consider the case of additional cosmological constants in the brane and\nbulk. The results can be found in our longer paper. Not surprisingly we recover the usual\ncosmological constant driven inflation when we set ρ = 0.\n\n6\n\nSustaining inflation and solving the Horizon Problem\n\nIn the previous sections we have found the onset of inflation via superluminal growth of\nthe scale factor. We also know that eventually, once the temperature drops out of the\nHagedorn regime, inflation ends. This graceful exit from inflation is an appealing feature\nof this scenario. However, we cannot calculate in between. Once inflation begins, our\ncalculations break down; our interpretation of small changes in the metric corresponding\nto small changes in volume no longer holds. At this point we can only speculate what\nhappens in between. The following are three of the possibilities:\nFirst, previous authors have argued that strings in a de Sitter background are unstable\nto fluctuations and that this instability can sustain a period of de Sitter inflation [20, 21,\n22]. This phenomenon is well known for strings once they are in the de Sitter-like phase1 .\nHowever the missing ingredient that the present study adds is an explanation for how the\nuniverse enters a de Sitter like phase in the first place. Our mechanism gets the universe\ninto the locally de Sitter phase, whereupon the mechanism of refs.[20, 21, 22] keeps it\nthere without having to assume adiabaticity.\nSecond, our 3-brane sits in a bath of branes and bulk strings with ongoing dynamics\nsuch as branes smashing into each other and possibly annihilating. The dynamics is likely\nto keep the system hot. Hence high temperatures near the Hagedorn temperature may be\nsustained for a long period; inflation continues during this period. We note that the high\nentropy of our brane S ∼ 1088 may originate from the dynamics of this hot brane/string\nbath. Eventually the system cools, drops out of the Hagedorn regime, and inflation ends.\nWe are investigating this scenario in a future paper.\nThird, we suggest as a possible direction for future study, a metric in which each\n4 dimensional leaf of the foliated space is a de Sitter space. It is well established (see\nfor example ref.[23] and references therein) that the combined (geometric plus thermal)\nsystem obeys a generalized second law which is that the total entropy,\nS = Smatter + Shorizon = Smatter +\n1\n\n1\nAhorizon ,\n4κ̂2\n\n(26)\n\nWe qualify 'de Sitter' because the exponential solutions we have do not possess the full O(1,4) de\nSitter symmetry.\n\n11\n\n\fobeys δS > 0, where Ahorizon is the area of the horizon. The generalized second law\nindicates that fluctuations in the geometry tend to drive the universe even further into\nthe de Sitter phase provided that the Hubble constant is greater than the critical value.\nThe entropy that the horizon loses when the Hubble constant is increased is more than\noffset by the huge increase in string entropy. Moreover, since the specific heat of the\nstring gas becomes larger when the temperature increases, inevitably equilibrium is lost\nand energy flow to the strings becomes apparently limitless.\nThere is a slight difference between our study and the results of ref.[21] which we\nshould comment on. In ref.[21], the density never goes above a critical density, ρ′c , and\nindeed asymptotes to it from below as one goes back in time. In our case, on the other\nhand, we must have ρ > ρc ∼ 1 for the calculation to be valid (i.e. to be in the Hagedorn\nregime). Indeed in the present paper the energy density diverges as we approach the\nHagedorn temperature. The difference is because ref.[21] was concerned with stretched\nstrings and introduced a cut-off in the momentum integral in order to find the fractal\ndimension of the string. This 'coarse graining' put an artificial upper limit on the amount\nof string that can be packed into the volume. In fact they found the maximum fractal\ndimension (i.e. 2) only at the critical density ρ′c . A fractal dimension of 2 is typical of\nthe random walk behaviour which exists once Hagedorn behaviour sets in. So the coarse\ngraining in ref.[21] effectively removed the Hagedorn behaviour and consequently ref.[21]\nfound that ρ = ρ′c gave β = βH . Conversely, the present paper begins in the regime ρ > ρc\nwhere the calculations of ref.[21] end.\n\n7\n\nConclusion and discussion\n\nWe have studied the possible cosmological implications of the Hagedorn regime of open\nstrings on D-branes in the weak coupling limit. Our main result is that a gas of open\nstrings can exhibit negative pressure leading naturally to a period of power law or even\nexponential inflation. Hagedorn inflation also has a natural exit since any significant\ncooling can cause a change in the thermodynamics if winding modes become quenched\nor if the density drops below the critical density, ρc ∼ 1, needed for the entropy of the\n\nHagedorn phase to be dominant. To summarize, open strings on branes in the hot early\nHagedorn phase of the universe provide a mechanism to drive a period of inflation, even\nin the absence of any potential.\n\nAcknowledgements\nWe thank Dan Chung, Cedric Deffayet, Emilian Dudas, Keith Olive, Geraldine Servant\nand Carlos Savoy for discussions. S.A.A. and I.I.K. thank Jose Barbón and Eliezer Rabi12\n\n\fnovici for a previous collaboration and discussions concerning this work. S.A.A. thanks\nthe C.E.A. Saclay for support during this work. K.F. acknowledges support from the Department of Energy through a grant to the University of Michigan. K.F. thanks CERN\nin Geneva, Switzerland and the Max Planck Institut fuer Physik in Munich, Germany\nfor hospitality during her stay. I.I.K. was supported in part by PPARC rolling grant\nPPA/G/O/1998/00567, the EC TMR grant FMRX-CT-96-0090 and by the INTAS grant\nRFBR - 950567.\n\nReferences\n[1] A. Guth, Phys. Rev. D 23, 347 (1981)\n[2] S.A. Abel, K. Freese, and I.I Kogan, JHEP 0101 (2001) 039\n[3] R. Hagedorn, Suppl. Nuovo Cimento 3 (1965) 147; S. Frautschi, Phys. Rev. D 3, 2821\n(1971); R.D. Carlitz, Phys. Rev. D 5, 3231 (1972)\n[4] K. Huang and S. Weinberg, Phys. Rev. Lett. 25, 895 (1970); E. Alvarez, Phys. Rev.\nD 31, 418 (1985); Nucl. Phys. B269, 596 (1986); M. Bowick and L.C.R. Wijewardhana, Phys. Rev. Lett. 54, 2485 (1985); B. Sundborg, Nucl. Phys. B254, 883 (1985);\nS.N. Tye, Phys. Lett. 158B, 388 (1985); P. Salomonson and B. Skagerstam, Nucl.\nPhys. B268, 349 (1986); Physica A158 (1989) 499; E. Alvarez and M.A.R. Osorio,\nPhys. Rev. D 36, 1175 (1987); D. Mitchell and N. Turok, Phys. Rev. Lett. 58, 1577\n(1987); Nucl. Phys. B294, 1138 (1987); I. Antoniadis, J. Ellis and D.V. Nanopoulos, Phys. Lett. 199B, 402 (1987); M. Axenides, S.D. Ellis and C. Kounnas, Phys.\nRev. D 37, 2964; (1988); I.I. Kogan, JETP. Lett. 45 (1987) 709; B.Sathiapalan,\nPhys. Rev. D 35, 3277 (1987); J. Atick and E. Witten, Nucl. Phys. B310, 291\n(1988); A.A. Abrikosov Jr. and Ya. I. Kogan Int. J. Mod. Phys. A6 (1991) 1501\n(submitted 1989), Sov. Phys. JETP 69 (1989) 235; R. Brandenberger and C. Vafa,\nNucl. Phys. B316, 391 (1989); M.J. Bowick and S.B. Giddings, Nucl. Phys. B325,\n631 (1989); S.B. Giddings, Phys. Lett. 226B, 55. (1989); R. Brandenberger and C.\nVafa, Nucl. Phys. B316, 391. (1989); F. Englert and J. Orloff, Nucl. Phys. B334,\n472 (1990); B.A. Campbell, J. Ellis, S. Kalara, D.V. Nanopoulos, K.A. Olive, Phys.\nLett. 255B, 420 (1991); B.A. Campbell, N. Kaloper, K.A. Olive, Phys. Lett. 277B,\n265 (1992); S.A. Abel, Nucl. Phys. B372, 189 (1992); N. Kaloper, K.A. Olive, Astropart.Phys.1 (1995) 185; N. Kaloper, R. Madden, K.A. Olive, Phys. Lett. 371B, 34,\n(1996), hep-th/9510117; N. Kaloper, R. Madden, K.A. Olive, Nucl. Phys. B452, 677,\n(1995) hep-th/9506027; M.L. Meana, M.A.R. Osorio and J.P. Penalba, Phys. Lett.\n\n13\n\n\f400B, 275, (1997) hep-th/9701122; Phys. Lett. 408B, 183 (1997) hep-th/9705185;\nK.R. Dienes, E. Dudas, T. Gherghetta and A. Riotto, Nucl. Phys. B543, 387 (1999)\n[5] N. Deo, S. Jain and C.-I. Tan, Phys. Lett. 220B, 125 (1989); Phys. Rev. D 40, 2646\n(1989); N. Deo, S. Jain, O. Narayan and C.-I. Tan, Phys. Rev. D 45, 3641 (1992)\n[6] D.A. Lowe and L. Thorlacius, Phys. Rev. D 51, 665 (1995), hep-th/9408134; S. Lee\nand L. Thorlacius, Phys. Lett. 413B, 303 (1997), hep-th/9707167\n[7] J.L.F. Barbón, I.I. Kogan and E. Rabinovici, Nucl. Phys. B544, 1999 (104),\nhep-th/9809033; S.A. Abel, J.L.F. Barbón, I.I. Kogan, and E. Rabinovici, JHEP\n04 (1999) 015\n[8] M.L. Meana and J.P. Penalba, Nucl. Phys. B560, 154 (1999); Phys. Lett. 447B,\n59 (1999); M.A. Vazquez-Mozo, Phys. Rev. D 60, 106010 (1999); B. Sundborg, hep-th/9908001; S.A. Abel, J.L.F. Barbón, I.I. Kogan, and E. Rabinovici,\nhep-th/9911004\n[9] For reviews see: J. Polchinski, TASI lecturs on D-branes, hep-th/9611050; \"String\nTheory\", vols 1,2 (CUP) 1998; C. Bachas, \"Lectures on D-branes\", hep-th/9806199\n[10] S.A. Abel and E. Dudas, in preparation\n[11] P. Kanti, I. I. Kogan, K. A. Olive, M. Pospelov, Phys.Lett. B468 (1999) 31,\nhep-ph/9909481; hep-ph/9912266\n[12] K. Benakli, Int. J. Mod. Phys. D8 (1999) 153, hep-th/9804096; N. Arkani-Hamed,\nS. Dimopoulos and G. Dvali, Phys. Rev. D59, 086004 (1999), hep-ph/9807344;\nH.S. Reall, Phys. Rev. D 59, 103506, (1999) hep-th/9809195; N. Kaloper and\nA. Linde, Phys. Rev. D59 (1999) 101303, hep-ph/9811141; G. Dvali and S.H.H.\nTye, Phys. Lett. 450B, 72 (1999), hep-ph/9812483; A. Lukas, B.A. Ovrut and D.\nWaldram, hep-th/9902071; T. Banks, M. Dine and A. Nelson, hep-th/9903019;\nH.A. Chamblin and H.S. Reall, Nucl. Phys. B562, 133 (1999), hep-th/9903225; N.\nArkani-Hamed, S. Dimopoulos, N. Kaloper and J. March-Russell, hep-ph/9903224;\nhep-ph/9903239; P. Binétruy, C. Deffayet and D. Langlois, hep-th/9905012; N.\nKaloper, Phys. Rev. D60 (1999) 123506, hep-ph/9905210; T. Nihei, Phys. Lett.\nB465 (1999) 81, hep-ph/9905487; C. Csáki, M. Graesser, C. Kolda and J. Terning, Phys. Lett. B462 (1999) 34, hep-ph/9906513; J.M. Cline, C. Grojean and G.\nServant, Phys. Rev. Lett. 83 (1999) 4245, hep-ph/9906523\n[13] D. Chung and K.T. Freese, Phys. Rev. D 61, 023511 (2000), hep-ph/9906542\n14\n\n\f[14] W.D. Goldberger and M.B. Wise, Phys. Rev. D60 (1999) 107505, hep-ph/9907218;\nPhys. Rev. Lett. 83, 4922 (1999), hep-ph/9907447; H.B. Kim and H.D. Kim, Phys.\nRev. D 61, 064003 (2000), hep-th/9909053\n[15] U. Ellwanger, hep-th/9909103\n[16] T. Shiromizu, K. Maeda and M. Sasaki, gr-qc/9910076; C. Grojean, J. Cline and G.\nServant, hep-th/9910081; P. Kraus, hep-th/9910149; P. Binétruy, C. Deffayet, U.\nEllwanger and D. Langlois, hep-th/9910219; A. Kehagias and E. Kiritsis, JHEP 9911\n(1999) 022; E. Flanagan, S.H.H. Tye and I. Wasserman, hep-ph/9910498; D. Ida,\ngr-qc/9912002; C. Csáki, M. Graesser, L. Randall, and J. Terning, hep-ph/9911406;\nW.D. Goldberger and M.B. Wise, hep-ph/9911457\n[17] O. Aharony, S. S. Gubser, J. Maldacena, H. Ooguri and Y. Oz, hep-th/9905111\n[18] C. Deffayet, private communication\n[19] , D. Chung and K. Freese, Phys. Rev. D 62, 023511 (2000)\n[20] R. Brout, F. Englert and E. Gunzig, Ann. Phys. 115 (1978) 78; Gen. Rel. Grav. 10\n(1979) 1; R. Brout, F. Englert and P. Spindel, Phys. Rev. Lett. 43, 417 (1979); Y.\nAharanov and A. Casher, Phys. Lett. 166B, 289 (1986); Y. Aharonov, F. Englert\nand J. Orloff, Phys. Lett. 199B, 366 (1987)\n[21] N.Turok, Phys. Rev. Lett. 60, 549 (1988)\n[22] N. Sanchez and G. Veneziano, Nucl. Phys. B333 (1990) 253; M. Gasperini,\nN. Sanchez and G. Veneziano, Int. J. Mod. Phys. A6 (1991) 3853; Nucl. Phys. B364\n(1991) 365;\n[23] R. Brustein, S. Foffa and R. Sturani, Phys. Lett. B471 (2000) 352, hep-th/9907032;\nR. Brustein, gr-qc/9904061\n[24] A. Riotto, hep-ph/9904485\n[25] E. Alvarez, T. Ortin, Mod.Phys.Lett.A7 (1992) 2889; A. A. Bytsenko, K. Kirsten and\nS. Zerbini, Phys. Lett. B304 (1993) 235; A.A. Bytsenko and S.D. Odintsov, Prog.\nTheor. Phys. 98 (1997) 987; I.R. Klebanov and A.A. Tseytlin, Nucl. Phys. B479\n(1996) 319; J.P. Penalba, Nucl. Phys. B556, 152 (1999)\n\n15\n\n\f"}