{"id": "http://arxiv.org/abs/hep-ph/0001143v2", "guidislink": true, "updated": "2000-03-29T15:39:51Z", "updated_parsed": [2000, 3, 29, 15, 39, 51, 2, 89, 0], "published": "2000-01-15T17:58:02Z", "published_parsed": [2000, 1, 15, 17, 58, 2, 5, 15, 0], "title": "On gauge unification in Type I/I' models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0001281%2Chep-ph%2F0001299%2Chep-ph%2F0001279%2Chep-ph%2F0001309%2Chep-ph%2F0001063%2Chep-ph%2F0001086%2Chep-ph%2F0001059%2Chep-ph%2F0001197%2Chep-ph%2F0001064%2Chep-ph%2F0001055%2Chep-ph%2F0001326%2Chep-ph%2F0001014%2Chep-ph%2F0001175%2Chep-ph%2F0001301%2Chep-ph%2F0001096%2Chep-ph%2F0001246%2Chep-ph%2F0001163%2Chep-ph%2F0001249%2Chep-ph%2F0001074%2Chep-ph%2F0001145%2Chep-ph%2F0001036%2Chep-ph%2F0001223%2Chep-ph%2F0001066%2Chep-ph%2F0001125%2Chep-ph%2F0001073%2Chep-ph%2F0001005%2Chep-ph%2F0001088%2Chep-ph%2F0001143%2Chep-ph%2F0001085%2Chep-ph%2F0001172%2Chep-ph%2F0001147%2Chep-ph%2F0001305%2Chep-ph%2F0001333%2Chep-ph%2F0001061%2Chep-ph%2F0001100%2Chep-ph%2F0001169%2Chep-ph%2F0001288%2Chep-ph%2F0001227%2Chep-ph%2F0001137%2Chep-ph%2F0001057%2Chep-ph%2F0001244%2Chep-ph%2F0001157%2Chep-ph%2F0001026%2Chep-ph%2F0001307%2Chep-ph%2F0001184%2Chep-ph%2F0001044%2Chep-ph%2F0001164%2Chep-ph%2F0001193%2Chep-ph%2F0001192%2Chep-ph%2F0001256%2Chep-ph%2F0001320%2Chep-ph%2F0001331%2Chep-ph%2F0001089%2Chep-ph%2F0001195%2Chep-ph%2F0001119%2Chep-ph%2F0001282%2Chep-ph%2F0001070%2Chep-ph%2F0001273%2Chep-ph%2F0001202%2Chep-ph%2F0001091%2Chep-ph%2F0001216%2Chep-ph%2F0001290%2Chep-ph%2F0001310%2Chep-ph%2F0001261%2Chep-ph%2F0001224%2Chep-ph%2F0001182%2Chep-ph%2F0001311%2Chep-ph%2F0001094%2Chep-ph%2F0001037%2Chep-ph%2F0001321%2Chep-ph%2F0001046%2Chep-ph%2F0001083%2Chep-ph%2F0001113%2Chep-ph%2F0001012%2Chep-ph%2F0702167%2Chep-ph%2F0702178%2Chep-ph%2F0702085%2Chep-ph%2F0702039%2Chep-ph%2F0702005%2Chep-ph%2F0702179%2Chep-ph%2F0702138%2Chep-ph%2F0702030%2Chep-ph%2F0702012%2Chep-ph%2F0702125%2Chep-ph%2F0702059%2Chep-ph%2F0702134%2Chep-ph%2F0702253%2Chep-ph%2F0702171%2Chep-ph%2F0702227%2Chep-ph%2F0702112%2Chep-ph%2F0702192%2Chep-ph%2F0702127%2Chep-ph%2F0702226%2Chep-ph%2F0702232%2Chep-ph%2F0702088%2Chep-ph%2F0702175%2Chep-ph%2F0702145%2Chep-ph%2F0702258%2Chep-ph%2F0702010%2Chep-ph%2F0702082%2Chep-ph%2F0702293&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On gauge unification in Type I/I' models"}, "summary": "We discuss whether the (MSSM) unification of gauge couplings can be\naccommodated in string theories with a low (TeV) string scale. This requires\neither power law running of the couplings or logarithmic running extremely far\nabove the string scale. In both cases it is difficult to arrange for the\nmultiplet structure to give the MSSM result. For the case of power law running\nthere is also enhanced sensitivity to the spectrum at the unification scale.\nFor the case of logarithmic running there is a fine tuning problem associated\nwith the light closed string Kaluza Klein spectrum which requires gauge\nmediated supersymmetry breaking on the ``visible'' brane with a dangerously low\nscale of supersymmetry breaking. Evading these problems in low string scale\nmodels requires a departure from the MSSM structure, which would imply that the\nsuccess of gauge unification in the MSSM is just an accident.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0001281%2Chep-ph%2F0001299%2Chep-ph%2F0001279%2Chep-ph%2F0001309%2Chep-ph%2F0001063%2Chep-ph%2F0001086%2Chep-ph%2F0001059%2Chep-ph%2F0001197%2Chep-ph%2F0001064%2Chep-ph%2F0001055%2Chep-ph%2F0001326%2Chep-ph%2F0001014%2Chep-ph%2F0001175%2Chep-ph%2F0001301%2Chep-ph%2F0001096%2Chep-ph%2F0001246%2Chep-ph%2F0001163%2Chep-ph%2F0001249%2Chep-ph%2F0001074%2Chep-ph%2F0001145%2Chep-ph%2F0001036%2Chep-ph%2F0001223%2Chep-ph%2F0001066%2Chep-ph%2F0001125%2Chep-ph%2F0001073%2Chep-ph%2F0001005%2Chep-ph%2F0001088%2Chep-ph%2F0001143%2Chep-ph%2F0001085%2Chep-ph%2F0001172%2Chep-ph%2F0001147%2Chep-ph%2F0001305%2Chep-ph%2F0001333%2Chep-ph%2F0001061%2Chep-ph%2F0001100%2Chep-ph%2F0001169%2Chep-ph%2F0001288%2Chep-ph%2F0001227%2Chep-ph%2F0001137%2Chep-ph%2F0001057%2Chep-ph%2F0001244%2Chep-ph%2F0001157%2Chep-ph%2F0001026%2Chep-ph%2F0001307%2Chep-ph%2F0001184%2Chep-ph%2F0001044%2Chep-ph%2F0001164%2Chep-ph%2F0001193%2Chep-ph%2F0001192%2Chep-ph%2F0001256%2Chep-ph%2F0001320%2Chep-ph%2F0001331%2Chep-ph%2F0001089%2Chep-ph%2F0001195%2Chep-ph%2F0001119%2Chep-ph%2F0001282%2Chep-ph%2F0001070%2Chep-ph%2F0001273%2Chep-ph%2F0001202%2Chep-ph%2F0001091%2Chep-ph%2F0001216%2Chep-ph%2F0001290%2Chep-ph%2F0001310%2Chep-ph%2F0001261%2Chep-ph%2F0001224%2Chep-ph%2F0001182%2Chep-ph%2F0001311%2Chep-ph%2F0001094%2Chep-ph%2F0001037%2Chep-ph%2F0001321%2Chep-ph%2F0001046%2Chep-ph%2F0001083%2Chep-ph%2F0001113%2Chep-ph%2F0001012%2Chep-ph%2F0702167%2Chep-ph%2F0702178%2Chep-ph%2F0702085%2Chep-ph%2F0702039%2Chep-ph%2F0702005%2Chep-ph%2F0702179%2Chep-ph%2F0702138%2Chep-ph%2F0702030%2Chep-ph%2F0702012%2Chep-ph%2F0702125%2Chep-ph%2F0702059%2Chep-ph%2F0702134%2Chep-ph%2F0702253%2Chep-ph%2F0702171%2Chep-ph%2F0702227%2Chep-ph%2F0702112%2Chep-ph%2F0702192%2Chep-ph%2F0702127%2Chep-ph%2F0702226%2Chep-ph%2F0702232%2Chep-ph%2F0702088%2Chep-ph%2F0702175%2Chep-ph%2F0702145%2Chep-ph%2F0702258%2Chep-ph%2F0702010%2Chep-ph%2F0702082%2Chep-ph%2F0702293&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss whether the (MSSM) unification of gauge couplings can be\naccommodated in string theories with a low (TeV) string scale. This requires\neither power law running of the couplings or logarithmic running extremely far\nabove the string scale. In both cases it is difficult to arrange for the\nmultiplet structure to give the MSSM result. For the case of power law running\nthere is also enhanced sensitivity to the spectrum at the unification scale.\nFor the case of logarithmic running there is a fine tuning problem associated\nwith the light closed string Kaluza Klein spectrum which requires gauge\nmediated supersymmetry breaking on the ``visible'' brane with a dangerously low\nscale of supersymmetry breaking. Evading these problems in low string scale\nmodels requires a departure from the MSSM structure, which would imply that the\nsuccess of gauge unification in the MSSM is just an accident."}, "authors": ["Dumitru Ghilencea", "Graham Ross"], "author_detail": {"name": "Graham Ross"}, "author": "Graham Ross", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0370-2693(00)00387-7", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0001143v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0001143v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, LaTeX, 2 figures; minor changes", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0001143v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0001143v2", "journal_reference": "Phys.Lett. B480 (2000) 355-364", "doi": "10.1016/S0370-2693(00)00387-7", "fulltext": "OUTP-2000-01-P\n\nOn gauge unification in Type I/I′ models\n\narXiv:hep-ph/0001143v2 29 Mar 2000\n\nDumitru M. Ghilencea1 and Graham G. Ross2\nDepartment of Physics, Theoretical Physics, University of Oxford\n1 Keble Road, Oxford OX1 3NP, United Kingdom\n\nAbstract\nWe discuss whether the (MSSM) unification of gauge couplings can be accommodated in string theories\nwith a low (TeV) string scale. This requires either power law running of the couplings or logarithmic running\nextremely far above the string scale. In both cases it is difficult to arrange for the multiplet structure to\ngive the MSSM result. For the case of power law running there is also enhanced sensitivity to the spectrum\nat the unification scale. For the case of logarithmic running there is a fine tuning problem associated with\nthe light closed string Kaluza Klein spectrum which requires gauge mediated supersymmetry breaking on\nthe \"visible\" brane with a dangerously low scale of supersymmetry breaking. Evading these problems in low\nstring scale models requires a departure from the MSSM structure, which would imply that the success of\ngauge unification in the MSSM is just an accident.\n\n1\n2\n\nE-mail: D.Ghilencea1@physics.oxford.ac.uk\nE-mail: G.Ross1@physics.oxford.ac.uk\n\n1\n\n\f1\n\nIntroduction\n\nPerhaps the most persuasive indication of structure \"Beyond the Standard Model\" comes from the\nobservation that the strong, and electroweak gauge couplings unify in the simplest supersymmetric\nextension of the Standard Model. Computing the radiative corrections to the gauge couplings coming\nfrom the virtual states of the MSSM one finds the SU (3), SU (2) and U (1) couplings become very\nnearly equal at the scale (1 − 3).1016 GeV provided one adopts the SU (5) normalisation of the U (1)\nfactor. A measure of the accuracy of this prediction may be obtained by using the assumed unification\nto predict the value of the strong coupling given the weak and electromagnetic couplings. One finds\nα3 (Mz ) = 0.126±0.003 to be compared with the experimental value [1] α3 (Mz ) = 0.119±0.002. Only\nslightly less impressive is the fact that the SUSY radiative corrections, assuming the same unification\nscale, lead to a prediction of the bottom mass in the range 3.12 < mb (Mz ) < 3.76GeV to be compared\nto the range 2.72 < mb (Mz ) < 3.16GeV obtained from the pole mass Mb = 4.8 ± 0.2GeV [2]. Again\nthis prediction assumes the SU (5) prediction for the equality of the bottom to the tau mass at the\nunification scale. It is largely on the basis of these successes and the fact that supersymmetry is\nneeded to solve the mass hierarchy problem that there has been so much interest in supersymmetric\nmodels and in compactification schemes that preserve a low energy supersymmetry.\nWeakly coupled heterotic string compactifications accommodate these features in a very natural\nway. The string and gauge unification scales are predicted to be very large, of the order of the Planck\nscale. The SU (5) normalisation of the U (1) factor emerges for a wide variety of compactifications\neven without a stage of Grand Unification below the Planck scale. The relation of the bottom to\ntau masses is more model dependent but, because there is an underlying E6 symmetry above the\ncompactification scale, it is easy to find specific models which do predict equality even without a\nstage of Grand Unification.\nThis picture has been challenged by the realisation that it is possible to build (open) string\ntheories in which the string scale is much smaller [3]-[4], possibly no more than the TeV scale\nwhich might be small enough to avoid the gauge hierarchy problem. Associated with this is the\npossibility that there are new large dimensions, possibly as large as a millimetre. At first sight such\ntheories seem to be inconsistent with the MSSM unification of couplings which requires a very large\nunification scale. However there are several possible ways that gauge unification may be maintained.\nOne is that some, or all, of the Standard Model states may propagate in new large dimensions,\nleading to power law running of the gauge couplings and the possibility that unification is achieved\nat a much lower scale. A second possibility [5] is that the normal logarithmic running applies but\nthe ultraviolet cut-off scale is not the string scale but is associated with a very heavy Kaluza Klein\nor winding mode. This is a particularly interesting possibility because the cut-off scale is related to\nthe infra-red properties of the transverse (closed string) channel. The mass, mKK , of the lightest\nKaluza Klein states in this channel is inversely proportional to the new large compactification radius\nand is of O(10−4 eV ) for a compactification radius of O(1mm). A state of this mass corresponds to a\ncutoff scale in the open string channel of O(Ms2 /mKK ) and if one sets the string scale, Ms , to 1 TeV\none obtains 1017 GeV for the ultra violet cut-off. This is tantalisingly close to the gauge unification\nscale in the MSSM.\nIn this letter we will consider both these possibilities for the case of Type I/I′ string compactifications. We will concentrate on the question whether it is possible to maintain the remarkable success\nof the MSSM predictions in the sense that the running of the gauge couplings is governed by the\nMSSM beta functions. Our conclusion is somewhat pessimistic suggesting that MSSM unification\nwith a low string scale does not follow as nicely as it did in the heterotic string case. Of course it\nmay be that nature is perverse and that the success of unification in the MSSM could be just an\n1\n\n\faccident. As an illustration of this we also consider a promising Type I string compactification in\nwhich gauge unification can be made to work.\n\nType I/I′ models and unification with low string scale\n\n2\n\nIn Type I (Type I′ ) strings at weak coupling the Standard Model fields are described by open strings\nconfined to a Dp brane with Kaluza Klein modes with respect to (p − 3) compact dimensions in\nthe brane and winding modes with respect to (9 − p) dimensions orthogonal to the brane. Closed\nstrings mediate the gravitational interaction and are free to propagate in the full ten dimensional\nspace-time. Upon compactification to four dimensional space-time, the following relations emerge\nbetween the volume3 vp of the compact dimensions of the SM brane, the volume vo of the dimensions\northogonal to it and the string scale MI\n2\n\nMI ∼ g MP\n\n\u0012\n\nvp\nvo\n\n\u00131\n2\n\n(1)\n\nso the string scale may be reduced [6] and may be very low (\"TeV scale\") [4] if the transverse space\nis large [3]. It should however be noted that lowering the fundamental scale does not, by itself, solve\nthe hierarchy problem for now we must explain why vo ≫ vp . In addition to the relation of eq.(1)\nthe string coupling is related to the four dimensional gauge coupling\nλI ∼ g 2 vp\n\n(2)\n\nwhere vp should be of order unity to keep λI < 1.\nParticularly interesting is the case in which the MSSM is embedded in a D3 brane, for in this\nsituation one may have extra (transverse) dimensions as large as ≤ mm [3] (not ruled out by\nexperiment) while the Standard Model field has only winding modes corresponding to the large\ntransverse dimensions. In the case the MSSM is embedded in a Dp brane with p > 3 the p − 3\nadditional dimensions cannot be much larger than 1 T eV −1 due to the presence of Standard Model\nKaluza Klein modes. However in asymmetric compactifications some or all of the (9 − p) orthogonal\ndimensions may be much larger.\nUnlike Grand Unification, string theories predict the gauge unification scale. In the heterotic\nstring the Standard Model fields are closed string states and the ultraviolet cutoff scale is determined\nby the geometry of the string world sheet. At one loop this is the torus and one may readily verify\nthat the cutoff is at the string scale [7, 8]. In the case the Standard Model fields are described by\nopen strings however the world sheet geometry does not regulate the divergences the latter only\nbeing eliminated after summing over the possible geometries. After eliminating the divergences the\nUV behaviour in the open string channel is determined by the IR behaviour in the transverse open\nstring channel. This follows due to the closed string/open string duality and leads to alternative,\nbut equivalent, descriptions of the behaviour of the radiative corrections to gauge couplings. The\nalternative open and closed string descriptions are summarised in Table 1.\nLooking at the first two entries in Table 1 one may see that in the open string channel the running\nof the couplings is due to the familiar radiative corrections to the gauge couplings while in the closed\nstring channel it is due to the modification of the vacuum expectation value of the bulk field, φ, which\nis the coefficient of the gauge kinetic term. The latter running is due to the φ propagator in the\nbulk, emitted by distant branes, evaluated at the transverse position of the SM brane. This provides\n3\n\nin Type I/I′ string length units.\n\n2\n\n\fCoupling\nRunning\nLogarithmic; α−1 ∼ ln(ΛR)\nLinear: α−1 ∼ (ΛR)\nQuadratic α−1 ∼ (ΛR)2\nString cut-off\nCoupling constant ratios\n\nOpen string channel\nUsual gauge coupling\nPropagation of SM nonsinglet\nstates\nD=4 propagation\nD=5 propagation. Single KK\ntower.\nD=6 propagation. Double \"inbrane\" KK tower\nUV, Ms or Mwinding ≥ Ms\nGauge symmetry\n\nClosed string channel\nv.e.v. of bulk field φ at x⊥\nφ propagator in bulk\nd⊥ = 2 propagation\nd⊥ = 1 propagation\nd⊥ = 0\nIR, Lightest φ.\nGeometric symmetry in the\nbrane sector\n\nTable 1: Alternative description of gauge coupling running in open/closed string channels.\na classical interpretation of the quantum effects on the gauge couplings (UV behaviour) on the SM\nbrane. Logarithmic evolution in the direct channel is due to the radiative corrections involving the\npropagation of virtual Standard Model states in four dimensions. In the transverse channel this is\ndue to φ propagation in two transverse dimensions. If the open string states propagate in more than\nfour (\"in-brane\") dimensions the couplings will run like a power rather than a logarithm.\nFrom the four dimensional point of view an (\"in-brane\") extra dimension shows up as a Kaluza\nKlein (KK) tower of excitations which each contribute additional logarithmic running to the coupling\nwhich sum to a (linear) power once sufficient KK states can be excited. In the transverse closed\nstring channel this corresponds to φ propagation in one transverse dimension (the Green functions\nfall as r 2−d⊥ for d⊥ transverse dimensions). Similarly if there are two KK towers of excitations in the\ndirect channel the couplings evolve quadratically. In the closed string channel this corresponds to\nthe case d⊥ = 0. In the weakly coupled heterotic string with orbifold or Calabi Yau supersymmetric\ncompactifications from 10 to 4 dimensions it might seem there could be running proportional to\nr 6 . However, the massive KK modes giving rise to the extra dimensions fill out N = 2 and N = 4\nsupermultiplets. The latter do not contribute to radiative corrections and so the power law running\nis limited to r 2 . In the transverse channel this result follows simply from the observation that d⊥ = 0\nis the limiting case.\nThe prediction of gauge unification also requires that the tree level coupling constant ratios be\npredicted. The gauge couplings are related to the dilaton couplings to the various gauge kinetic\nterms. In the heterotic string the reason for unification is the presence of a single dilaton v.e.v.\nwhich is the string coupling at the unification scale. For level-1 Kac-Moody theories one has the\nusual SU (5) relations. More generally such a relation may come from an underlying Grand Unified\nsymmetry above the compactification scale. In Type I/I′ theories it has been suggested that in\nthe closed string channel [9] it is an underlying geometric symmetry of the brane sector that is\nresponsible for relating the couplings.\nFinally string theories predict the gauge unification scale. The prediction for the tree level ratios\napply at the scale at which the radiative corrections are cut-off. As discussed above this is determined\nby the lightest relevant state in the transverse channel. This turns out either to be the string scale\nor the lightest KK scale depending on which sector of the theory one is considering [11].\n\n3\n\n\f2.1\n\nPower-law unification\n\nThe first discussion [12] of the possibility of a low string and unification scale following from power law\nrunning employed an effective field theory approach. In this the individual logarithmic corrections\nof Kaluza Klein modes (with respect to δ = (p − 3) (p ≥ 3) \"in-brane\" dimensions) below the string\nscale are summed [13, 8]. This leads to the following (one-loop) RGE evolution [12]\nα−1\ni (μ)\n\n−1\n\n= α\n\n−1\n\n≈ α\n\nbi\n(Λ) +\n2π\nbi\n(Λ) +\n2π\n\n|m|≤Λ/μ\n~\n0\n\nX\nm\n~\n\n(\n\nln\n\nbi\nΛ\nΛ\n+\nln\nμ0 |m|\n~\n2π μ\n\nπ δ/2\nδ Γ(1 + δ/2)\n\n\"\u0012\n\nΛ\nμ0\n\n\u0013δ\n\n#\n\nΛ\n− 1 − ln\nμ0\n\n(3)\n)\n\n+\n\nΛ\nbi\nln\n2π μ\n\n(4)\n\nwhich shows explicitly [8] the origin of the \"power-law\" behaviour in the high degeneracy of KaluzaKlein modes. Here bi is the N = 2 beta function of KK sector and bi is the one loop contribution,\nδ is the effective number of (\"in-brane\") extra dimensions, Λ is the cut-off scale and μ0 is the mass\nof the lowest KK excitation. Although the number of extra dimensions may be as large as six, as\ndiscussed above, we expect at most quadratic running, δ = 1, 2. The constraint (2) restricts the\nin-brane volume to values close to unity in string length units. In general the power-law running\ntakes place over a very small range of energy and thus the radii (1/μ0 ) are close to the string scale\nand (2) may be satisfied by symmetric unifications with the remaining 6 − δ dimensions also of order\nthe string length scale. In the effective field theory approach unification occurs at the cutoff scale Λ\nand this scale must be identified. The usual assumption is to identify it with the string scale, MI .\nHowever, following the discussion above, in Type I′ theories it may be one should identify Λ with\nthe larger winding mode mass. The correct identification depends on the details of the string theory\n- in some cases the winding mode excitations fill out complete N = 4 multiplets and in this case the\nlower string scale is the appropriate choice [11]. In either case the power law running can lead to\nunification at a scale which may be smaller [12] than the ordinary MSSM unification scale.\nWhile power law running can reduce the unification scale there are two difficulties in obtaining the\nusual MSSM predictions. The first is the sensitivity power law running introduces to the thresholds\nat the unification scale [14]. This is readily seen from eqs.(3), (4) where, for a low (TeV) unification\n−1\n−1\nscale μ0 (∂α−1\ni /∂μ0 ) ≃ δ(αi (μ) − α (Λ)). This is to be compared to the case of normal logarithmic\n−1\n−1\nrunning in the MSSM where μ0 (∂α−1\ni /∂μ0 ) ≃ (αi (μ) − α (Λ))/ ln(Λ/μ). Thus the sensitivity to\nthe unification scale is roughly enhanced by a factor δ ln(Λ/μ) which is ≥ 32. A more careful analysis\ngives δμo /μo = 1/224 [14]. This means that in order to make a precision prediction for the gauge\ncoupling one must know the detailed spectrum of the states at the unification scale. Although this\ndoes not rule out the possibility of low scale unification through power law running, it does make\nthe success of the detailed prediction of the gauge couplings in the MSSM seem surprising.\nThe second difficulty one encounters in trying to duplicate the MSSM results via power law\nrunning comes from the fact that in eq.(3) the rate of running is controlled by the coefficients bi\nwhich are determined by the N = 2 sector of the theory. The difficulty is that these are not expected\nto be proportional to the N = 1 beta functions and thus we may expect substantial deviations from\nthe MSSM predictions. To see this note that if one has towers of KK states for the entire MSSM\nP\nSSM = −3T (G) + P T (ψ)\nspectrum, bi = −2Ti (G) + 2 ψ Ti (ψ) which is not proportional to bM\ni\nψ i\ni\nM\nSSM\nof the (N = 1) MSSM sector. Instead we have bi = 2bi\n+ 4Ti (G). To avoid this we should look\nfor a model for which\nSSM\nbi = KbM\n+C\n(5)\ni\n\n4\n\n\fwith K and C some gauge group independent constants. In this case eq.(3) gives the same value\nfor α3 (Mz ) as in the MSSM at one loop level (in such a case we would have an explanation for the\n\"accidental\" success of the MSSM gauge unification predictions).\nAttempts to obtain a spectrum satisfying this condition have been made by Kakushadze [15] by\nincluding further KK states which, together with the KK excitations of the MSSM, have one loop\ncoefficients which satisfy eq.(5). A simple example with K = 1[15] was given by a Z2 orbifold model\nwhich breaks an underlying N = 2 supersymmetry to N = 1. The N = 2 spectrum is that of the\nMSSM KK excitations together with those of additional superfields F± , SU (3) × SU (2) singlets with\nU (1)Y charge ±2 respectively. However the addition of the F± , while leading to a the N = 2 beta\nfunction which satisfies eq.(5), does not reproduce the N = 1 MSSM spectrum because it contains\nadditional light N = 1 fields with the quantum numbers of F± . As a result one finds\no−1\nα−1\n3 (Mz ) = α3 (Mz ) +\n\nMs\n1 6\nln\n2π 7 MF\n\n(6)\n\nHere α03 (Mz ) is the MSSM (one loop) value while the last term is the (one-loop) contribution of F±\nstates to the running of the gauge couplings. This term depends on the (unknown) ratio Ms /MF\nand thus eq.(6) makes no prediction for α3 (Mz ) following from the unification condition. A detailed\nmechanism or further input is needed to fix the value Ms /MF . Thus, although the model may\nallow the presence of a low (TeV) string scale, it does not predict α3 (Mz ). It may be that one\nmay construct models of this type which do not modify the N = 1 spectrum but one may see from\nthis example the difficulty in accommodating the MSSM predictions in the framework of power-law\nrunning.\n\n2.2\n\nLogarithmic unification\n\nWe turn now to the possibility that the gauge couplings unify with logarithmic running. A Type I/I′\nfull string calculation for the threshold corrections to the gauge couplings was performed for the case\nof an N = 2 orientifold based on the T 4 /Z2 orbifold [16, 17] and other N = 2 orientifolds obtained\nby toroidal compactification of six-dimensional vacua [11]. These results were also generalised [11]\nto four dimensional compactifications with N = 1 supersymmetry. In the latter case the cut-off\nfor N = 2 sector is not the string scale itself but the first winding mode above the string scale\nassociated with the (\"off-the-brane\") two-torus while for the light states N = 1 the cut-off is set by\nthe string scale itself. Two possibilities exist for the RGE behaviour [11, 5] at the high scale in this\ncase. One of these is the linear \"power-law\" regime, corresponding to an \"asymmetric\" two-torus\ncompactification, while the other has only logarithmic dependence on R (and ultimately on MP ) in\nthe RGE. We will now concentrate on the second case as the first one was discussed above.\nThe interest for phenomenology in these models is two-fold. Firstly, the large transverse volume\nand low string scale brings the possibility (e.g. for the case the MSSM is confined to a D3 brane)\nof new gravitons and their Kaluza Klein towers in the mm−1 range [3], a situation not ruled out by\nthe experiment. Secondly, the mild logarithmic dependence of the couplings on the high scale raises\nthe possibility [5] of gauge coupling unification at a large scale above MI given by the string cut-off\n(first winding mode). This may be just the original unification scale of the MSSM thus elegantly\nproviding an alternative (Type I) interpretation of the successful MSSM predictions.\nTurning to a more detailed discussion of the latter possibility note that the corrections to gauge\ncouplings come only from the N = 1 (massless) sector and from the N = 2 massive winding (Type\nI′ ) (or Kaluza Klein, Type I) sector. Let us consider the N = 2 sector first. The massive N = 2\nthreshold corrections to α−1 at the string scale MI have the form [11] (for both A (annulus) and M\n5\n\n\f(Möbius strip) geometries relevant at one loop)\n∆Ti ypeI = −\n\nn \u0010p\n\u0011o\n1 X\nbi,m ln\nGm ImUm MI2 |η(Um )|4\n4π m\n\n(7)\n\n√\nHere Gm is the metric on the torus4 T m , and G1 = R̃1 R̃2 (for a rectangular torus). The behaviour\nof the thresholds5 when ImU = R̃1 /R̃2 is of order one is indeed logarithmic, ∆a ∼ ln(R̃1 R̃2 ).\nWe note that unlike the weakly coupled heterotic case [7] where quadratic dependence on the\ncommon radius of the two torus (associated with the N = 2 sector) exists, in the present case\nthis does not happen. The condition of global tadpole cancellation ensures that after adding the\ncontributions (each regulated by an infrared cut-off) of massless closed string states emitted into the\ntransverse channel, the two R2 dependent results obtained for A and G cancel. Therefore there is\nno quadratic term present in (7). In this calculation the ultraviolet (would-be quadratic) behaviour\nin the open channel is regulated by the infra-red regime of the closed string channel (c.f. Table 1).\nFrom eq.(7), after adding the usual N = 1 one loop term proportional to bi we have\n−1\nα−1\ni (Mz ) = αI +\n\nMI\nμ̃\nbi\nbi\nln\nln\n+\n2π Mz\n2π MI\n\n(8)\n\nwhere we have taken R̃1 = R̃2 and μ̃ =1/(R̃1 |η(Um )|2 ). Here bi is the N = 2 one-loop beta function\ncoefficient.\nFrom this equation we can immediately identify a problem in obtaining the usual MSSM results\nwith a low string scale. As in the case of power law running, the dominant evolution is governed\nby the N = 2 sector. We therefore have a similar difficulty to that discussed above in obtaining the\nSSM . In ref.[9] an orbifold projection\nMSSM results because in general bi is not proportional to bM\ni\nwas used to break N = 2 supersymmetry to N = 1. In this case the running up to the unification\nscale (i.e. first winding mode scale μ̃) is indeed given by the N = 1 sector apparently solving\nthis problem. However the construction works only for modding by freely acting groups and this\nimplies the N = 1 matter fields giving rise to bi originate from the adjoint representation of the\nunderlying gauge group before modding. Although in the orbifolded model there are N = 1 matter\nfields transforming as the fundamental representations F under one of the group factors, there are\nalso fields transforming as F [18]. This does not allow for an identification of these fields with the\nMSSM matter fields. As a result we still have the problem of explaining why the bi should satisfy\neq.(5). If we assume however that this problem can be solved, eq.(8) together with eq.(5) reproduces\nthe MSSM unification at one loop level with (μ̃/MI )K MI ≈ 1016 GeV. For the case K = 1 the\nunification occurs at μ̃ ≈ 1016 GeV.\nSomewhat surprisingly logarithmic unification also has a fine tuning problem. Naively our previous discussion suggests logarithmic unification will be no more sensitive to threshold effects than the\nMSSM. However this is misleading because here the string cut-off scale μ̃ ≈ 1016 GeV corresponds\nto a cross channel exchange state with mass MI2 /μ̃. For a 1 TeV string scale this is 10−10 GeV and\ncorresponds to the lightest mass of Kaluza Klein modes in the closed string channel. However the\nstate controlling the UV behaviour of the open string channel has vacuum quantum numbers. Such\na state has no symmetry (local gauge symmetry etc) to protect it from receiving contributions to\nits mass at scales below the supersymmetry breaking scale. We therefore expect that such a state\nwill acquire mass from supersymmetry breaking effects. The magnitude of such a mass depends\non the supersymmetry breaking mechanism but has a lower bound governed by the supersymmetry\n4\n5\n\nWe consider in the following only compactification on a single torus, T 1 .\nFor Type I′ case we should take R = 1/R̃\n\n6\n\n\fbreaking communicated by gravitational effects. If supersymmetry is broken in a hidden sector (e.g.\non another brane) and communicated to the visible sector by gravitational effects then we know\nsuch effects must be of T eV scale otherwise some of the SUSY partners of the SM should have\nbeen seen. However the supersymmetry breaking in the bulk must be at least of T eV scale as well\nbecause, in this case, SUSY breaking is communicated to the visible sector via the bulk. As a result\nlogarithmic running is not a viable mechanism for gauge unification because now the closed string\nstate mass (MI2 /μ̃) ≈ 1T eV so with MI ≈ 1T eV we have μ̃ ≃ 1T eV instead of the 1016 GeV needed\nfor unification. If, to avoid this problem, one requires the closed string exchange state with mass\nMI2 /μ̃ be ≥ T eV scale, while maintaining high scale unification (μ̃ ≈ 1016 GeV ) one finds the string\nscale is bounded by MI ≥ 1010 GeV.\nThe only possibility to maintain logarithmic unification with a low string scale is that supersymmetry breaking in the visible sector is much larger than in the bulk. This happens in gauge mediated\nscenarios where the supersymmetry breaking is communicated to the visible sector by gauge interactions much stronger than gravity. Such a scheme requires that supersymmetry breaking occurs\non the SM brane itself. However, even in such a scheme there is a problem in keeping the string\nscale as low as 1T eV as gravitational effects still generate a supersymmetry breaking mass of order\n2\nthe gravitino mass for fields in the bulk. The gravitino mass is of order MSusy\n/MP where6 MSusy\nis the supersymmetry breaking scale on our brane. Demanding that the gravitino mass is less than\n10−10 GeV to avoid the fine tuning problem implies MSusy ≤ 104 GeV. Provided one remains in the\nperturbative domain this is probably too small for a viable gauge mediated scheme because SUSY\n2\nbreaking in the visible sector is given by γMSusy\n/M where γ is the effective coupling of the visible\nsector to the SUSY breaking sector and M is the messenger mass (M ≥ MSusy ). In viable models\nit occurs at one loop order for gauginos [19] suggesting γ is too small to generate acceptable masses\nfor the MSSM sparticle spectrum. Even if it proves to be possible one sees that the resulting model\nis heavily constrained requiring gauge mediated supersymmetry breaking with the gauge mediator\nmass, M , in the T eV range too. Gauge mediation with a light messenger sector (< 105 GeV ) is\nhowever unnatural [20].\nTo summarise, in both the case of power law and logarithmic running there are difficulties in\naccommodating the success of the MSSM unification predictions in models with a low string scale.\nIn the case of power law unification there is also an enhanced sensitivity to the details of the mass\nspectrum at the unification scale making the success of the detailed prediction of the gauge couplings\nin the MSSM quite surprising. In the case of logarithmic running there is a fine tuning problem\nwhich can be alleviated by raising the string scale significantly above the T eV scale. However in both\ncases it is difficult to generate the MSSM beta function via the N=2 sector. To avoid this difficulty\nin these models it is thus necessary to give up the MSSM structure. From this point of view, in\nthis case the MSSM remarkable success in predicting gauge unification appears to be accidental. To\nillustrate this last possibility we consider unification in a promising Type I which has a multiplet\nstructure close to that of the MSSM.\n\n2.3\n\nA Type I model with intermediate unification\n\nThe model we wish to consider is a specific example of a larger class of D = 4 Type I vacua obtained\nfrom a standard D = 4, N = 1 compact Type IIB orientifold with Dp branes and anti-Dp branes\nlocated at different points of the underlying orbifold [21]. We consider here the class of models of [21]\nwhich have gravity mediated supersymmetry breaking with the full Standard Model embedded in a\n9-brane sector and with an additional set of 5-branes trapped at the fixed points of the Z3 orientifold.\n6\n\nWe denote by MP the Planck scale.\n\n7\n\n\fThis model has no N = 2 sector and the UV cutoff scale for the N = 1 sector is the string scale [11].\nAs we shall discuss this model can give gauge unification via the radiative corrections of the N = 1\nsector with an intermediate string scale and without introducing significant threshold sensitivity.\nThe price to achieve this is to depart from the MSSM light matter content and to start with a nonMSSM relation between the gauge couplings. In particular the normalisation of the hypercharge\nof these states is αY /αs = 3/11 at the string scale (instead of the usual \"SU(5) factor\" 3/5). The\nmassless spectrum contains the spectrum of the MSSM. In addition there are five further pairs of\nHiggs doublets and three vector-like right handed colour triplets (dc + dc ). The remaining states of\nthe model may have mass of the order of string scale. In determining the unification prediction of\nthis model we follow [21] and assume that these additional states have a common bare mass7 , m̃,\nwhich must not be greatly different from the electroweak scale.\nIncluding the threshold effects at m̃, the two loop RGE equations are given by\n\u0014\n\u0014\n\u0015\n\u0015\n3\n3\nbi\nαg\nbij\nMs\nMs\nαs\nδbi\n1 X\n1 X\n−1\n−1\nαi (Mz ) = −δi + αs +\nYij ln\nln\nln\nln\n+\n+\n+\n2π\nMz\n2π\nm̃\n4π j=1\nαj (m̃)\n4π j=1 bj\nαj (Mz )\n\"\n\n\"\n\n#\n\n#\n\n(9)\n\nwhere\nYij =\n\nδbj\n[2bj Tj (G)δij − bij ]\nbj b′j\n\n(10)\n\nwith Tj (G) = {0, 2, 3}j , bij is the two loop beta function as in the MSSM but with 3/11 hypercharge\nnormalisation, bj = {11ξ, 1, −3}j , (ξ = 3/11), b′j = bj + δbj , with δbj = {7ξ, 5, 3} to account for the\nadditional five Higgs pairs and three pairs of right handed colour triplets. For the terms Yi3 equations\n(9) should be understood as limits of b′3 → 0 which indeed give the appropriate (finite) results when\nmultiplied by the term log(αg /α3 (m̃)). Finally one should include the low energy supersymmetric\nthresholds δi and regularisation scheme conversion factors (M S → DR). Usually δi 's are included as\nan overall effect on α3 (Mz ) through an effective (low-energy) supersymmetric threshold [22]. In this\ncase the different hypercharge normalisation of δ1 prevents us from using this approach, although\ntheir overall effect on α3 (Mz ) is not expected to change significantly from the \"normal\" hypercharge\ncase (when α3 (Mz ) is reduced by an amount of ≈ 2 − 4%).\nThe predictions for the string coupling and the string scale Ms can be read from the plots in\nFigure 1 to see that the model indeed allows for a logarithmic unification at about ≈ 1010 Mz GeV for\na strong coupling consistent with the experimental value [1] α3 (Mz ) = 0.119 ± 0.002. This requires\nan intermediate threshold at about8 m̃ ≈ (100 − 300)Mz .\nOne can also compute the bottom to tau mass ratio, taking account of the different normalisation\nof αY /αs . For the model with the above spectrum set-up, we find the following one loop level result\n(including only gauge effects)\nαs b′1 Ms\nR(Ms )\n= 1+\nln\nR(Mz )\n2π\nμo\n\u0012\n\n\u0013\n\n1 2N1 δb1\nb1\nb′\n1\n\n\u0012\n\nMs\nμo\n\n\u0013 αs\n2π\n\n2N3 δb3\nb3\n\n\u0012\n\nαs\nα1 (Mz )\n\n\u0013− 2N1 \u0012\nb1\n\nαs\nα3 (Mz )\n\n\u0013− 2N3\nb3\n\n(11)\n\nwhere N1 = −10/9ξ, N3 = 8/3 and R(Q) denotes the ratio bottom to tau mass at the scale Q. For\nαs ≈ 0.1 (needed to generate α3 (Mz )) we find that R(Mz ) ≈ 5R(Ms ). If we assume bottom-tau\nunification at the string scale, this implies mb (Mz ) ≈ 8.731GeV . To correct this, model dependent\nYukawa effects not considered here must be very significant, but then the MSSM result for the\nbottom-tau mass ratio should be regarded as yet another accident.\n7\n8\n\nFor the purpose of two loop RGE only the bare mass of the fields is needed.\nThe results are subject to additional thresholds at the string scale, which may change this picture significantly.\n\n8\n\n\fThis example shows that it is possible in a realistic model to obtain good results for gauge\nunification in a manner incompatible with the original MSSM, demonstrating that the latter's success\nmay indeed be an illusion. However it also illustrates the difficulties a non-MSSM scheme must\nsurmount in order to approach the accuracy of the MSSM prediction. Although the unification is\nlogarithmic the sensitivity to thresholds is considerably enhanced due to the light states additional\nto the MSSM. For example the uncertainty in the additional Higgs doublets mass translates to\nthe uncertainty δα−1\n2 = (5/2π)δMH /MH . If one is to predict α3 (Mz ) to the present experimental\naccuracy then one must know these masses to better than δMH /MH = 0.1. In the light of this the\nprecision of the MSSM prediction for the strong coupling seems even more remarkable and makes it\nharder for us to accept it is just an accident.\n\n3\n\nConclusions\n\nWe have considered the possibility that Type I string theories with a low (TeV) string scale may\naccommodate the successful MSSM predictions for the unification of the gauge couplings. Our\nconclusions are pessimistic. Models with power-law running have a significant sensitivity to the\nunification scale thresholds. Models with logarithmic running up to the string cut-off (winding)\nscale far above the string scale reduce the sensitivity to this scale but have a fine tuning problem\nassociated with the closed string spectrum which requires either a very special Supersymmetry\nbreaking sector or an intermediate string scale. In both cases it is difficult to generate the MSSM\nbeta function via the N=2 sector. Of course it may be that the success of the MSSM predictions\nis illusory and the existence of a realistic Type I theory which makes a non-MSSM prediction for\nthe gauge couplings consistent with the measured values demonstrates this possibility. However,\ndue to the threshold dependence on the non-MSSM states, it is not possible in this model to make\na prediction for the gauge couplings to the same accuracy as the MSSM result without a detailed\nknowledge of the masses at the unification scale. All this emphasizes the fact that if the MSSM result\nis regarded as an accident it is a surprisingly accurate accident! In the light of all this it seems to us\nthat the original heterotic string (possibly strongly coupled), being able naturally to accommodate\nthe MSSM results, still offers the best explanation of the unification of gauge couplings.\n\n4\n\nAcknowledgments\n\nWe would like to thank I. Antoniadis and L. Ibáñez for useful discussions. D.G. acknowledges the\nfinancial support from the part of the University of Oxford (Leverhulme Trust research grant). The\nresearch is supported in part by the EEC under TMR contract ERBFMRX-CT96-0090.\n\nReferences\n[1] Particle Data Group, The European Physical Journal C 3 (1998), 87.\n[2] S. Pokorski, Acta Phys. Polon. B30 (1999) 1759-1773, hep-ph/9901427 and references therein.\n[3] N. Arkani-Hamed, S. Dimopoulos and G. Dvali, Physics Letters B 429 (1998) 263;\nN. Arkani-Hamed, S. Dimopoulos and G. Dvali, hep-ph/9807344; I. Antoniadis, N. ArkaniHamed, S. Dimopoulos and G. Dvali, Phys Lett B436 (1998), hep-ph/9804398.\n[4] J. Lykken, Physical Review D 54 (1996) 3693.\n9\n\n\fFigure 1: The values of α3 (Mz ) (left) and log10 (Ms /Mz ) (right) as a function of the string coupling\nαs . In both cases the lower curve is a one loop approximation while the upper curve is the two loop\ncase. For α3 (Mz ) ≈ 0.12 we require αs ≈ 0.1. The overall picture for α3 (Mz ) is expected to be\nshifted downwards by about 2 − 4% after the inclusion of the low energy threshold corrections δi\nwith the appropriate hypercharge normalisation, while the remaining plot is not expected to change\nsignificantly.\n[5] C. Bachas, Journal of High Energy Physics 9811 (1998) 023, hep-ph/9807415\n[6] E. Witten, Nuclear Physics B 471 (1996) 135;\nP. Horava and E. Witten, Nuclear Physics B 475 (1996) 94.\n[7] L. Dixon, V. Kaplunovsky and J. Louis, Nuclear Physics B 355 (1991) 649.\n[8] D. Ghilencea, G.G. Ross, hep-ph/9908369.\n[9] N. Arkani-Hamed, S. Dimopoulos and J. March-Russell, hep-ph/9908146. See also [10].\n[10] I. Antoniadis, C. Bachas, hep-ph/9812093.\n[11] I. Antoniadis, C. Bachas and E. Dudas, preprint hep-th/9906039 and references therein.\n[12] K.R. Dienes, E. Dudas, T. Gherghetta, Nuclear Physics B 537 (1999) 47 and references therein;\nK.R. Dienes, E. Dudas and T. Gherghetta, Physics Letters B 436 (1998) 55.\n[13] T.R.Taylor and G.Veneziano, Physics Letters 212 B (1988) 147\n[14] D. Ghilencea and G.G. Ross, Physics Letters B 442 (1998) 165.\n[15] Z. Kakushadze, preprint HUTP-98/A073, hep-ph/9811193.\n[16] C. Bachas and C. Fabre, Nuclear Physics B476 (1996) 418.\n[17] I. Antoniadis, H. Partouche and T.R. Taylor, Nuclear Physics B499 (1997) 29.\n10\n\n\f[18] J. Lykken, E. Poppitz and S. Trivedi, Physics Letters B416 (1998) 286, hep-th/9708134\n[19] G.F. Giudice and R. Ratazzi, hep-ph/9801271.\n[20] A. Strumia, hep-ph/9904247.\n[21] G. Aldazabal, L.E. Ibáñez, F. Quevedo, preprint hep-ph/9909172.\n[22] P.Langacker and N. Polonsky, Phys.Rev.D47 (1993), 4028;\n\n11\n\n\f"}