{"id": "http://arxiv.org/abs/hep-ph/0112201v1", "guidislink": true, "updated": "2001-12-14T15:39:17Z", "updated_parsed": [2001, 12, 14, 15, 39, 17, 4, 348, 0], "published": "2001-12-14T15:39:17Z", "published_parsed": [2001, 12, 14, 15, 39, 17, 4, 348, 0], "title": "The Entropy of the Quark-Gluon Plasma", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0112040%2Chep-ph%2F0112269%2Chep-ph%2F0112335%2Chep-ph%2F0112141%2Chep-ph%2F0112054%2Chep-ph%2F0112232%2Chep-ph%2F0112245%2Chep-ph%2F0112236%2Chep-ph%2F0112012%2Chep-ph%2F0112161%2Chep-ph%2F0112323%2Chep-ph%2F0112280%2Chep-ph%2F0112089%2Chep-ph%2F0112234%2Chep-ph%2F0112361%2Chep-ph%2F0112146%2Chep-ph%2F0112070%2Chep-ph%2F0112139%2Chep-ph%2F0112298%2Chep-ph%2F0112184%2Chep-ph%2F0112267%2Chep-ph%2F0112206%2Chep-ph%2F0112083%2Chep-ph%2F0112010%2Chep-ph%2F0112257%2Chep-ph%2F0112026%2Chep-ph%2F0112239%2Chep-ph%2F0112293%2Chep-ph%2F0112207%2Chep-ph%2F0112262%2Chep-ph%2F0112307%2Chep-ph%2F0112180%2Chep-ph%2F0112324%2Chep-ph%2F0112056%2Chep-ph%2F0112188%2Chep-ph%2F0112050%2Chep-ph%2F0112344%2Chep-ph%2F0112162%2Chep-ph%2F0112202%2Chep-ph%2F0112116%2Chep-ph%2F0112118%2Chep-ph%2F0112129%2Chep-ph%2F0112163%2Chep-ph%2F0112013%2Chep-ph%2F0112286%2Chep-ph%2F0112259%2Chep-ph%2F0112155%2Chep-ph%2F0112024%2Chep-ph%2F0112274%2Chep-ph%2F0112021%2Chep-ph%2F0112227%2Chep-ph%2F0112136%2Chep-ph%2F0112246%2Chep-ph%2F0112299%2Chep-ph%2F0112028%2Chep-ph%2F0112079%2Chep-ph%2F0112284%2Chep-ph%2F0112059%2Chep-ph%2F0112077%2Chep-ph%2F0112038%2Chep-ph%2F0112201%2Chep-ph%2F0112126%2Chep-ph%2F0112328%2Chep-ph%2F0112096%2Chep-ph%2F0112106%2Chep-ph%2F0112266%2Chep-ph%2F0112279%2Chep-ph%2F0112061%2Chep-ph%2F0112039%2Chep-ph%2F0112243%2Chep-ph%2F0112289%2Chep-ph%2F0112233%2Chep-ph%2F0112205%2Chep-ph%2F0112181%2Chep-ph%2F0112288%2Chep-ph%2F0112278%2Chep-ph%2F0112247%2Chep-ph%2F0112088%2Chep-ph%2F0112166%2Chep-ph%2F0112316%2Chep-ph%2F0112064%2Chep-ph%2F0112228%2Chep-ph%2F0112193%2Chep-ph%2F0402229%2Chep-ph%2F0402139%2Chep-ph%2F0402148%2Chep-ph%2F0402123%2Chep-ph%2F0402146%2Chep-ph%2F0402212%2Chep-ph%2F0402244%2Chep-ph%2F0402233%2Chep-ph%2F0402224%2Chep-ph%2F0402186%2Chep-ph%2F0402168%2Chep-ph%2F0402024%2Chep-ph%2F0402001%2Chep-ph%2F0402010%2Chep-ph%2F0402032%2Chep-ph%2F0402045%2Chep-ph%2F0402171%2Chep-ph%2F0402073&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Entropy of the Quark-Gluon Plasma"}, "summary": "The entropy of the quark-gluon plasma can be calculated from QCD using\n(approximately) self-consistent approximations. Lattice results for pure gauge\ntheories are accurately reproduced down to temperatures of the order of\n2.5$T_c$. Comparisons with other approaches to the thermodynamics of the\nquark-gluon plasma are briefly discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0112040%2Chep-ph%2F0112269%2Chep-ph%2F0112335%2Chep-ph%2F0112141%2Chep-ph%2F0112054%2Chep-ph%2F0112232%2Chep-ph%2F0112245%2Chep-ph%2F0112236%2Chep-ph%2F0112012%2Chep-ph%2F0112161%2Chep-ph%2F0112323%2Chep-ph%2F0112280%2Chep-ph%2F0112089%2Chep-ph%2F0112234%2Chep-ph%2F0112361%2Chep-ph%2F0112146%2Chep-ph%2F0112070%2Chep-ph%2F0112139%2Chep-ph%2F0112298%2Chep-ph%2F0112184%2Chep-ph%2F0112267%2Chep-ph%2F0112206%2Chep-ph%2F0112083%2Chep-ph%2F0112010%2Chep-ph%2F0112257%2Chep-ph%2F0112026%2Chep-ph%2F0112239%2Chep-ph%2F0112293%2Chep-ph%2F0112207%2Chep-ph%2F0112262%2Chep-ph%2F0112307%2Chep-ph%2F0112180%2Chep-ph%2F0112324%2Chep-ph%2F0112056%2Chep-ph%2F0112188%2Chep-ph%2F0112050%2Chep-ph%2F0112344%2Chep-ph%2F0112162%2Chep-ph%2F0112202%2Chep-ph%2F0112116%2Chep-ph%2F0112118%2Chep-ph%2F0112129%2Chep-ph%2F0112163%2Chep-ph%2F0112013%2Chep-ph%2F0112286%2Chep-ph%2F0112259%2Chep-ph%2F0112155%2Chep-ph%2F0112024%2Chep-ph%2F0112274%2Chep-ph%2F0112021%2Chep-ph%2F0112227%2Chep-ph%2F0112136%2Chep-ph%2F0112246%2Chep-ph%2F0112299%2Chep-ph%2F0112028%2Chep-ph%2F0112079%2Chep-ph%2F0112284%2Chep-ph%2F0112059%2Chep-ph%2F0112077%2Chep-ph%2F0112038%2Chep-ph%2F0112201%2Chep-ph%2F0112126%2Chep-ph%2F0112328%2Chep-ph%2F0112096%2Chep-ph%2F0112106%2Chep-ph%2F0112266%2Chep-ph%2F0112279%2Chep-ph%2F0112061%2Chep-ph%2F0112039%2Chep-ph%2F0112243%2Chep-ph%2F0112289%2Chep-ph%2F0112233%2Chep-ph%2F0112205%2Chep-ph%2F0112181%2Chep-ph%2F0112288%2Chep-ph%2F0112278%2Chep-ph%2F0112247%2Chep-ph%2F0112088%2Chep-ph%2F0112166%2Chep-ph%2F0112316%2Chep-ph%2F0112064%2Chep-ph%2F0112228%2Chep-ph%2F0112193%2Chep-ph%2F0402229%2Chep-ph%2F0402139%2Chep-ph%2F0402148%2Chep-ph%2F0402123%2Chep-ph%2F0402146%2Chep-ph%2F0402212%2Chep-ph%2F0402244%2Chep-ph%2F0402233%2Chep-ph%2F0402224%2Chep-ph%2F0402186%2Chep-ph%2F0402168%2Chep-ph%2F0402024%2Chep-ph%2F0402001%2Chep-ph%2F0402010%2Chep-ph%2F0402032%2Chep-ph%2F0402045%2Chep-ph%2F0402171%2Chep-ph%2F0402073&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The entropy of the quark-gluon plasma can be calculated from QCD using\n(approximately) self-consistent approximations. Lattice results for pure gauge\ntheories are accurately reproduced down to temperatures of the order of\n2.5$T_c$. Comparisons with other approaches to the thermodynamics of the\nquark-gluon plasma are briefly discussed."}, "authors": ["Jean-Paul Blaizot"], "author_detail": {"name": "Jean-Paul Blaizot"}, "author": "Jean-Paul Blaizot", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0375-9474(02)00692-9", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0112201v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0112201v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Talk given at \"Statistical QCD\", Bielefeld, August 26-30, 2001, 12\n  pages, 3 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0112201v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0112201v1", "journal_reference": "Nucl.Phys.A702:99-110,2002", "doi": "10.1016/S0375-9474(02)00692-9", "fulltext": "arXiv:hep-ph/0112201v1 14 Dec 2001\n\n1\n\nThe Entropy of the Quark-Gluon Plasma\nJ.-P. Blaizota\na\n\nService de Physique Théorique, CEA Saclay\n91191 Gif-sur-Yvette cedex, France\nThe entropy of the quark-gluon plasma can be calculated from QCD using (approximately) self-consistent approximations. Lattice results for pure gauge theories are accurately reproduced down to temperatures of the order of 2.5Tc . Comparisons with other\napproaches to the thermodynamics of the quark-gluon plasma are briefly discussed.\n\n1. Introduction\nAs we were reminded, the Bielefeld meetings which took place in 1980 and 1982 have\nplayed a decisive role in our field. It should be added that, since then, the Bielefeld group\nhas played a leading role in the study of QCD thermodynamics with lattice calculations.\nThere is one particular result of that time that I wish to recall here because it is central\nto the topic of my talk. This result is that of the lattice calculation of the energy density\nof SU(2) pure gauge theory [1]. It is reproduced in Fig. 1 where one sees clearly the\nphase transition and the approach to the ideal gas limit at high temperature confirming\nexpectations based on asymptotic freedom.\nModern results for the SU(3) equation of state [2] are displayed in Fig. 2. The talk\nwill focus on the slow approach to the free gas limit of the thermodynamical functions at\nhigh T . The question that I wish to address is whether one can understand the deviation\nfrom the ideal gas behaviour with weak coupling calculations. Beyond this question is,\nas we shall see, another one related to the relevance of the notion of quasiparticles in the\ndescription of the quark-gluon plasma.\nThe motivation for considering the quark-gluon plasma as a weakly coupled system is\nof course asymptotic freedom, which leads us to expect that the effective coupling g to\nbe used in thermodynamical calculations should be small if the temperature T is high\nenough:\nαs (μ) ≡\n\ng2\n1\n∝\n,\n4π\nln(μ/ΛQCD )\n\n(1)\n\nwith typically μ ≃ 2πT . But we know that, even in cases where the coupling is small,\nstrict perturbation theory cannot be used. Technically, infrared divergences occur in high\norder calculations, and various resummations are needed to get meaningful results.\nSome of the difficulties of perturbation theory are already visible on the lowest orders\n\n\f2\n\nFigure 1. Energy density of a SU(2) gluon plasma normalized to that of an ideal gas of\ngluons, as a function of the temperature. From Ref. [1].\n\nwhich, for SU(3) gluons, read:\nP\n15 αs\nαs\n=1−\n+ 30\nP0\n4 π\nπ\n\u0012\n\n\u0013\n\n\u0012\n\n\u00133/2\n\n,\n\n(2)\n\nwith P0 the ideal gas pressure:\nP0 = 8\n\nπ2T 4\n.\n45\n\n(3)\n\nThe large coefficient of the g 3 term makes its contribution to the pressure comparable\nto that of the order g 2 when g >\n∼ 0.8, or αs >\n∼ 0.05; larger coupling makes the pressure\nlarger than that of the ideal gas. Now it is worth emphasizing that the term of order g 3\nemerges from an infinite resummation (strict perturbation theory at finite order would\nlead to a polynomial in g 2); it is the leading term of the resummed expression when g is\nsmall. We shall later argue that the underlying strategy (that of performing an infinite\nresummation which is then re-expanded in powers of g) may not be used to extrapolate to\nlarge coupling. Physically the need for resummation arises from the existence of collective\nexcitations in the system, whose properties are not well captured by perturbation theory.\nA lot of efforts have been devoted in the recent years to push perturbative calculations\nof the pressure to the highest calculable order, namely order g 5 [3–5]. The contributions\nof order g 4 and g 5 do not resolve the difficulties met at order g 3 : the values of the pressure\nobtained by adding successively these high order contributions oscillate wildly, and reveal\na strong dependence on the renormalization scale. Attempts have been made to construct\nsmooth extrapolations based on the first terms of the series, using Pade approximants\n[6,7] or Borel summation techniques [8,9]. The resulting expressions are indeed smooth\nfunctions of the coupling, better behaved than polynomial approximations truncated at\n\n\f3\n\nFigure 2. The thermodynamical functions in SU(3) gauge theories. From Ref. [2].\n\norder g 5 or lower, with a weak dependence on the renormalization scale. However these\ntechniques, which can be powerful, offer little physical insight.\nA more appealing physical picture is provided by quasiparticle models in which one\nassumes that the dominant effect of the interactions can be incorporated in the spectral\nproperties of suitably defined quasiparticles. It is useful to review briefly the simplest\nversion of such models, limiting ourselves here to bosonic quasiparticles [10]. One assumes\nthat the system is composed of non interacting massive quasiparticles with energies Ek :\nEk2 = k 2 + m2 (T )\n\n(4)\n\nwith the mass m some function of the temperature. The entropy density is that of the\nideal gas:\ns=\n\nZ\n\nd3 k\n[(1 + Nk ) log(1 + Nk ) − Nk log Nk ] ,\n(2π)3\n(5)\n\nwhere\nNk =\n\n1\neEk /T\n\n−1\n\n.\n\n(6)\n\nThe pressure P and the energy density ǫ are then given by the corresponding ideal gas expressions, to within a function B(T ) adjusted so as to satisfy thermodynamical identities.\nThat is, one sets:\nP = −T\n\nZ\n\n\u0011\n\u0010\nd3 k\n−Ek /T\n− B(T )\nlog\n1\n−\ne\n(2π)3\n\n(7)\n\n\f4\nǫ=\n\nZ\n\nd3 k\nNk Ek + B(T ).\n(2π)3\n\n(8)\n\nSuch a parametrization obviously fulfills the identity ǫ + P = T s. The function B(T ) is\nthen determined by requiring that\ns=\n\ndP\n.\ndT\n\n(9)\n\nSuch a model has been shown to provide a quite good basis for a fit to lattice results [11].\nRecent extensions of the model can be found in Ref. [12].\nFinding a microscopic justification for this quasiparticle picture is the main motivation\nof the work that I shall present, summarizing results obtained in collaboration with E.\nIancu and A. Rebhan [13–16]. Our analysis is based on the entropy, for which the simple\nformulae above already suggest why it is simpler than the other thermodynamical functions: in both the pressure and the energy density there are interaction contributions,\nwhich cancel out in the entropy, leaving an expression in which all interaction effects\nare summarized in the properties of quasiparticles (in the simple model, the temperature\ndependent mass m(T )). We shall see later under which conditions this simple picture is\nvalid.\nAt this stage, it is useful to have a more general characterization of the effects of weak\ninteractions in a quark-gluon plasma. Let me then go through a short digression about\nthe basic scales and degrees of freedom of such a system when the coupling is small [17].\n2. Scales and degrees of freedom. Hard thermal loops\nIn the absence of interactions, the quark-gluon plasma is a gas of massless particles\nwith energy Ek = k. Small interactions have little effects on most particles which have\nmomentum k ∼ T , but they strongly modify the propagation of low momentum modes.\nSince the coupling to gauge fields occurs typically through covariant derivatives, Dx =\n∂x +igA(x), the effect of interactions on particle motion depends indeed on the momentum\nof the excitation and the magnitude of the gauge field. A measure of the strength of\nthe gauge\nfields is obtained from the magnitude of their thermal fluctuations, that is\nq\n2\nĀ ≡ hA (t, x)i. In equilibrium hA2 (t, x)i is independent of t and x and given, in the\nnon interacting case, by:\nhA2 i ≈\n\nZ\n\nd3 k Nk\n.\n(2π)3 Ek\n\n(10)\n\nHere we shall use this formula also in the interacting case, assuming that the effects of the\ninteractions can be accounted for simply by a change of Ek (a more complete calculation\nis presented in Ref. [17]).\nFor the plasma particles Ek = k ∼ T and hA2 iT ∼ T 2 . The associated electric (or\nmagnetic) field fluctuations h(∂A)2 iT ∼ T 4 are a dominant contribution to the plasma\nenergy density. As already mentioned, these short wavelength, or hard, gauge field fluctuations produce a small perturbation on the motion of a plasma particle with momentum\nk ∼ T , since g ĀT ∼ gT ≪ k. However, this is not so for an excitation at the momentum\nscale k ∼ gT , since then the two terms in the covariant derivative ∂x and g ĀT become\n\n\f5\ncomparable. That is, an excitation with momentum gT is non perturbatively affected\nby the hard thermal fluctuations. And indeed, the scale gT is that at which collective\nphenomena develop. The emergence of the Debye screening mass mD ∼ gT is one of the\nsimplest examples of such phenomena.\nThe fluctuations at the soft scale gT ≪ T can be described by classical fields. In fact\nthe associated occupation numbers Nk are large, and accordingly one can replace Nk by\nT /Ek ∼ 1/g in eq. (10). Introducing an upper cut-off gT in the momentum integral, one\nthen gets:\nhA2 igT ∼\n\nZ\n\ngT\n\nd3 k\n\nT\n∼ gT 2.\nk2\n\n(11)\n\n√\nThus ĀgT ∼ gT so that g ĀgT ∼ g 3/2 T is still of higher order than the kinetic term\n∂x ∼ gT . In that sense the soft modes with k ∼ gT are still perturbative, i.e. their selfinteractions can be ignored in a first approximation. Note however that they generate\ncontributions to physical observables which are not analytic in g 2, as shown by the example\nof the order g 3 contribution to the pressure (or as in eq.(11) above).\nAt the lower momentum scale k ∼ g 2T , unscreened magnetic fluctuations play a dominant role. The contributions of such ultrasoft fluctuations is\n2\n\nhA ig2 T ∼ T\n\nZ\n\ng2 T\n\nd3 k\n\n0\n\n1\n∼ g 2T 2 ,\nk2\n\n(12)\n\nso that g Āg2 T ∼ g 2 T is now of the same order as the ultrasoft derivative ∂x ∼ g 2 T : the\nfluctuations are no longer perturbative. This is the origin of the breakdown of perturbation\ntheory in high temperature QCD. A more detailed analysis reveals that the fluctuations\nat scale g 2 T come from the zero Matsubara frequency and correspond therefore to those\nof a three dimensional theory of static fields.\nHaving identified these various scales, we note now that the thermodynamical functions\nat high temperature are dominated by hard degrees of freedom. The quasiparticle picture\nthat we shall develop takes into account consistently the contributions of the hard degrees\nof freedom together with those of the long wavelength collective excitations. We shall\ncomment later on the techniques based on dimensional reduction which allows a treatment\nof the ultrasoft contributions.\nThere exists a well developed effective theory for the soft collective excitations that\nwe briefly outline now. These soft excitations can be described in terms of average fields\nwhich obey classical equations of motion. In QED these equations are Maxwell equations:\nν\nν\n∂μ F μν = jind\n+ jext\n\n(13)\n\nν\nwith a source term composed of an external perturbation jext\n, and an extra contribution\nν\njind referred to as the induced current. The induced current, which summarizes the effects\nof the hard degrees of freedom, can be obtained using linear response theory. It is of the\nform:\n\njμind\n\n=\n\nZ\n\nν\nd4 y ΠR\nμν (x − y)A (y),\n\n(14)\n\nwhere Aν (y) is the total gauge field (including the induced potential) and the (retarded)\nresponse function ΠR\nμν (x − y) is also referred to as the polarization tensor. In leading\n\n\f6\norder in weak coupling, this polarization tensor is given by the one-loop approximation,\nand can be written as Π(ω, p) = g 2 T 2 f (ω/p, p/T ) with f a dimensionless function. Furthermore, the relevant kinematics is such that the incoming momentum is soft while the\nloop momentum is hard. Thus, in leading order in p/T ∼ g, Π is of the form g 2 T 2 f (ω/p).\nThis particular contribution of the one-loop polarization tensor is an example of what has\nbeen called a \"hard thermal loop\" [18].\nIn a non Abelian theory, linear response is not sufficient: constraints due to gauge symmetry force us to take into account specific non linear effects. The relevant generalization\nof the Yang-Mills equation reads [19,20] :\n1 abc ν ρ\nΓ A A + ...\n(15)\n2 μνρ b c\nwhere the induced current in the right hand side is non-linear: when expanded in powers of Aμa , it generates an infinite series of hard thermal loops (self-energy and vertex\ncorrections).\nIn the next section, we shall consider various reorganizations of the perturbative expansion inspired by the previous analysis and which try to accommodate the non perturbative\nfeatures associated with the various scales.\nν\nDν F νμ = Πab\nμν Ab +\n\n3. Reorganizing perturbative expansion\nAs we have seen, one of the main effects of the thermal fluctuations is to generate a\nmass for the soft modes. This is not peculiar to gauge theories, but occurs also in the\nsimpler case of a scalar field. In this case, the mass generation can be taken into account\nnon perturbatively by a very simple reorganization of the perturbative expansion, leading\nto the so-called \"screened perturbation theory\" [21]. One writes:\n1\n1\nL = L0 − m2 φ2 + m2 φ2 + Lint\n2\n2\n′\n′\n= L0 + Lint ,\n\n(16)\n\nwith L′0 = L0 − (1/2)m2 φ2 . The mass m ∼ gT which appears here is for instance that\nobtained in leading order from the hard thermal loop. A perturbative expansion in terms\nof screened propagators (that is keeping the screening mass as a parameter, i.e. not as\na perturbative correction to be expanded out) has been shown to be quite stable with\ngood convergence properties. However, m makes the propagators explicitly temperature\ndependent, and the ultraviolet divergences which occur in high order calculations become temperature dependent. Although we know that temperature dependent infinities\nshould eventually cancel out, the systematics of such cancellations is not immediately\ntransparent.\nIn the case of gauge theory, the effect of the interactions is more complicated than just\ngenerating a mass. But we know how to determine the dominant corrections to the selfenergies. When the momenta are soft, these are given by the hard thermal loops discussed\nabove. By adding these corrections to the tree level Lagrangian, and subtracting them\nfrom the interaction part, one generates the so-called hard thermal loop perturbation\ntheory [22–24]:\nL = L0 + LHT L − LHT L + Lint = L′0 + L′int .\n\n(17)\n\n\f7\nThe resulting perturbative expansion is made complicated however by the non local nature of the hard thermal loop action, and by the necessity of introducing temperature\ndependent counter terms. Also, in such a scheme, one is led to use the hard thermal loop\napproximation in kinematical regimes where it is not justified.\nAnother approach that I wish to mention at this stage is that based on dimensional\nreduction. This approach puts emphasis on the non perturbative, very long wavelength\nfluctuations. It has been shown in Refs. [25–27] how, in principle, an effective theory could\nbe constructed to deal with this particular problem by marrying analytical techniques\n(to determine the coefficients of the effective theory) and numerical ones (to solve the\nnon perturbative 3-dimensional effective theory). The resulting effective theory is a 3dimensional theory of static fields, with Lagrangian:\n1\n1\n1\nLef f = (Fija )2 + (Di Aa0 )2 + m2D (Aa0 )2 + λ(Aa0 )4 + δL,\n(18)\n4\n2\n2\n√\nwith Di = ∂i − ig T Ai . This strategy has been applied recently to the calculation\nof the free energy of the quark-gluon plasma a high temperature [28]. This technique\nof dimensional reduction puts a special weight on the static sector (it singles out the\ncontributions of the zero Matsubara frequency), and a major effort is devoted to the\ncalculation of the coefficients of the effective Lagrangian (which contain the dominant\ncontribution to the thermodynamical functions).\nIn contrast, the approach that we have developed keep the full spectral information\nthat one has about the plasma excitations. In a sense, it is close to the approach based on\nhard thermal loop perturbation theory. It differs in that we focus on the simplest of the\nthermodynamical function, namely the entropy, for which indeed interesting cancellations\noccur which allow us to bypass some of the difficulties of hard thermal loop perturbation\ntheory.\n4. Propagator renormalisation. Skeleton expansion\nAs already stated, we want to incorporate full spectral information about quasiparticles\nin thermodynamical calculations, and we are therefore led to carry out a propagator\nrenormalisation. Although in gauge theory vertex renormalisation should be carried along\nwith propagator renormalisation, we shall see here that special kinematical conditions\nallow us to develop useful approximations without having to do so.\nThe formalism that we shall rely on was developed long ago in the context of the\nnon relativistic many-body problem. It is based on an expression for the pressure as a\nfunctional of full propagators, first written out by Luttinger and Ward [29]. Systematic\ndevelopments using either functional Legendre transforms or diagrammatic formalisms\nwere presented later by De Dominicis and Martin [30]. In implementing these methods\nto field theory one meets extra difficulties related to ultraviolet divergences. I now briefly\noutline the general method, writing explicitly only formulae appropriate for a scalar field\n(similar ones hold for QCD).\nThe free energy F can be written as the following functional of the full propagator D:\n1\n1\nF [D] = Tr ln D −1 − TrΠD + Φ[D],\n2\n2\n\n(19)\n\n\f8\nwhere Φ is the sum of all the two-particle irreducible (skeletons) diagrams. The self-energy\nΠ is related to the propagator by Dyson's equation\nD −1 = D0−1 + Π,\n\n(20)\n\nand D0 is the bare propagator. A remarkable feature of the functional (19) is its stationarity property, i.e., δF [D]/δD = 0 when\nΠ[D] = 2\n\nδΦ\n.\nδD\n\n(21)\n\nTogether Eqs. (20) and (21) form a self-consistent set of equations which determine the\nfull propagator. A major observation by Baym is that self-consistent approximations can\nbe defined for any selection of skeleton diagrams in Φ; furthermore such \"Φ-derivable\"\napproximations have the property to respect the (global) symmetries of the hamiltonian\n[31].\nThe stationarity property of the free energy entails important simplifications in the\ncalculation of the entropy. Indeed we have\nS = −\n\n∂F\ndF\n= −\ndT\n∂T\n\n(22)\nD\n\nwhere the last step uses the fact that the temperature dependence of the propagator can\nbe ignored. Explicitly one gets:\nd4 k ∂N(ω)\nd4 k ∂N(ω)\n−1\nS=−\nIm log D (ω, k) +\nImΠ(ω, k)ReD(ω, k) + S ′\n4\n4\n(2π) ∂T\n(2π) ∂T\nZ\n\nZ\n\n(23)\n\nwhere N(ω) = 1/(eβω − 1), and\n∂(T Φ)\nS ≡−\n∂T\n′\n\nD\n\n+\n\nZ\n\nd4 k ∂N(ω)\nReΠ ImD.\n(2π)4 ∂T\n\nA further simplification occurs when one restricts the choice of skeletons to low order ones\n[32–34]. Thus, for the two-loop skeletons in QCD, S ′ = 0.\n5. The 2-loop entropy\nAt two loop in the skeleton expansion, the entropy takes then the simple form [34,13–\n15]:\nS = −\n\nZ\n\no\nd4 p ∂N n\n−1\nIm\nln\nD\n−\nImΠ\nReD\n(2π)4 ∂T\n\n(24)\n\nThe simplifications discussed above have led to important cancellations leaving for the\nentropy an expression which is effectively a one-loop expression, thus emphasizing the\ndirect relation between the entropy and the quasiparticle spectrum. Residual interactions\nstart contributing at order 3-loop. This expression is also manifestly ultraviolet-finite.\nAlbeit simple, the 2-loop expression for the entropy is nevertheless difficult to use as\nit stands. Recall that the propagator and self-energy in this equation are solution of a\n\n\f9\nself-consistent equation which is in general difficult to renormalize and to solve. Besides,\nin the case of gauge theories, the scheme does not fully respect gauge symmetry. We have\ntherefore looked for additional approximations which exploits the simplicity of the scheme\n(the one-loop feature of the entropy formula) and at the same time allows for practical\ncalculations. The main idea is to find gauge invariant approximations for the self-energy by\nexploiting kinematical approximations such as those which lead in particular to the hard\nthermal loops. The entropy is then calculated exactly with no further approximation. One\nconstraint that we impose on our approximate Π is that, once inserted in the formula (24),\nthe resulting value of S is perturbatively correct up to order g 3 (which is the maximum\nperturbative accuracy that one can achieve with 2-loop skeletons).\nIn the regime where the loop momenta are soft, we can use as an approximation for Π\nthe corresponding hard thermal loop (HTL), that is\nω, p ∼ gT\n\nΠsof t ≈ ΠHT L\n\nFor hard momenta on the other hand, the hard thermal loop is no longer valid: corrections\nto hard particle dispersion relations due to their coupling with soft modes need to be\ntaken into account. This can be estimated using usual HTL perturbation theory. A\nsimplification occurs however because we need such corrections only near the light cone:\nω, p ∼ T\n\nΠhard (ω 2 ∼ p2 )\n\nIn fact we shall find convenient to define two successive approximations. In the first\none, called the HTL approximation, we use Π = ΠHT L at all momenta. This is a fine\napproximation for soft momenta, but it is also a decent approximation at hard momenta\nbecause the self-energy is needed only in the vicinity of the light cone where the hard\nthermal loop approximation coincides with the full one-loop result. We call SHT L the\nresulting expression for the entropy. This expression fully accounts for the perturbative\ncontributions of order g 2 but for only 1/4 of that of order g 3 . In the next-to-leading\napproximation one uses Πsof t = ΠHT L and Πhard = ΠHT L + δΠ, where δΠ contains the\ncoupling to the soft modes (I should emphasize at this point that the construction of our\nnext-to-leading approximation involves several subtle steps which I am skipping here but\nwhich are detailed by A. Rebhan in his contribution [16]). We call SN LA the corresponding\nentropy; it takes fully into account all perturbative contributions of order g 2 and g 3 .\nAs an illustration of the quality of the results which we can obtain, I present in Fig. 3 the\nentropy of pure SU(3) gauge theory normalized to the ideal gas entropy. The agreement at\nlarge T (T >\n∼ 2.5Tc ) is quite good. Note also that in going from one level of approximation\nto the next (i.e. from SHT L to SN LA ), the changes are moderate, in contrast to what\nhappens in ordinary perturbation theory. This reflects the stability of the present scheme.\nIt also points to the fact that the contribution of the soft collective modes is indeed small:\nthe fact that they give a seemingly large contribution at order g 3 in perturbation theory\nis just an artifact of the truncation of a resummed expression at finite order.\n6. CONCLUSIONS\nOur results confirm that for temperatures larger than about 3Tc , the thermodynamical\nfunctions of the quark-gluon plasma, in particular its entropy, can indeed be interpreted\n\n\f10\n\nS =SSB\n1\n0.9\n0.8\n0.7\n0.6\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\n4.5\n\n5\n\nT =T\n\nFigure 3. The entropy of pure SU(3) gauge theory normalized to the ideal gas entropy\nSSB . Full lines: SHT L . Dashed-dotted lines: SN LA . For each approximation, the two lines\ncorrespond to the choices μ̄ = πT and μ̄ = 4πT of the running coupling constant αs (μ̄)\nin the MS renormalization scheme. The dark grey band represents the lattice results of\nRef. [2].\n\nas those of weakly interacting quasiparticles. The dominant effect of the interactions is\nto modify the spectrum of these quasiparticles. As the coupling grows the quasiparticle\nproperties are non perturbatively renormalized but their mutual interactions remain weak.\nThermodynamic functions are dominated by hard degrees of freedom. While long range\ncorrelations may survive in the quark-gluon plasma at very large temperature, the present\npicture suggests that such correlations do not contribute much to the thermodynamics.\nWe find explicitly that the soft contributions are indeed small. We argued in particular\nthat the contribution of collective modes is artificially amplified when the coupling is not\ntoo small by truncating this contribution at order g 3.\nThe approach that we have developed relies on a hierarchy of scales that emerges when\nthe coupling is small. It is an assumption that the structure identified at weak coupling\nsurvives when the coupling grows, e.g. as we lower the temperature. The fact that\nwe find approximations where such an extrapolation works supports the validity of this\nassumption. But of course a complete check of the method can only be done by comparing\nwith \"exact\" results, such as those provided by lattice techniques. Much can be learned\nalso from detailed comparisons with the other approaches discussed earlier, namely hard\nthermal loop perturbation theory or dimensional reduction. There is finally much to do\nalso within the present theory itself, to push for instance non perturbative renormalization\ntechniques (interesting progress in this direction has been reported recently [35]; see also\n[36]).\n\n\f11\nFurther tests involve the calculations of different observables. An example, advocated\nby Gavai [37] at this workshop, is that of quark susceptibilities. This is a calculation\nthat we have recently taken up, with interesting results [38]. The calculation of quark\nsusceptibilities represents a small incursion into the physics of finite chemical potentials\nwhich is of course readily available in our approach [16].\nAcknowledgements\nThe work presented here has been carried out in a most enjoyable collaboration with\nE. Iancu and A. Rebhan. I would also like to thank Frithjof Karsch and Helmut Satz, for\ntheir invitation to this very stimulating meeting.\nREFERENCES\n1. J. Engels, F. Karsch, H. Satz and I. Montvay, Nucl. Phys. B 205 (1982) 545.\n2. G. Boyd, J. Engels, F. Karsch, E. Laermann, C. Legeland, M. Lütgemeier, B. Petersson, Nucl. Phys. B469 (1996) 419–444.\n3. P. Arnold and C. Zhai, Phys. Rev. D 50, 7603 (1994), ibid. 51, 1906 (1995); C. Zhai\nand B. Kastening, ibid. 52, 7232 (1995).\n4. E. Braaten and A. Nieto, Phys. Rev. D 53, 3421 (1996).\n5. E. Braaten, these proceedings.\n6. T. Hatsuda, Phys. Rev. D 56 (1997) 8111 [hep-ph/9708257].\n7. S. Chiku and T. Hatsuda, Phys. Rev. D 58 (1998) 076001 [hep-ph/9803226].\n8. R. R. Parwani, Yang-Mills theory,\" Phys. Rev. D 63 (2001) 054014 [hep-ph/0010234].\n9. R. R. Parwani, Phys. Rev. D 64 (2001) 025002 [hep-ph/0010294].\n10. A. Peshier, B. Kämpfer, O. P. Pavlenko, and G. Soff, Phys. Rev. D 54, 2399 (1996);\nA. Peshier, hep-ph/9809379.\n11. P. Levai, U. Heinz, Phys. Rev. C57 (1998) 1879.\n12. R. A. Schneider and W. Weise, Phys. Rev. C 64 (2001) 055201 [arXiv:hepph/0105242].\n13. J. P. Blaizot, E. Iancu, A. Rebhan, Phys. Rev. Lett. 83 (1999) 2906–2909.\n14. J. P. Blaizot, E. Iancu, A. Rebhan, Phys. Lett. B470 (1999) 181–188.\n15. J. P. Blaizot, E. Iancu, A. Rebhan, Phys. Rev. D63 (2001) 065003.\n16. A. Rebhan, these proceedings.\n17. J. P. Blaizot and E. Iancu, arXiv:hep-ph/0101103.\n18. E. Braaten and R. D. Pisarski, Nucl. Phys. B337, 569 (1990); J. Frenkel and J. C.\nTaylor, Nucl. Phys. B334, 199 (1990).\n19. J.-P. Blaizot and E. Iancu, Nucl. Phys. B390, 589 (1993); Phys. Rev. Lett. 70, 3376\n(1993); Nucl. Phys. B417, 608 (1994).\n20. J.-P. Blaizot, E. Iancu and J.-Y. Ollitrault, in Quark-Gluon Plasma II, edited by R.C.\nHwa (World Scientific, Singapore, 1996).\n21. F. Karsch, A. Patkós, P. Petreczky, Phys. Lett. B401 (1997) 69–73.\n22. J. O. Andersen, E. Braaten, M. Strickland, Phys. Rev. D63 (2001) 105008.\n23. J. O. Andersen, E. Braaten, M. Strickland, Phys. Rev. Lett. 83 (1999) 2139–2142.\n24. J. O. Andersen, E. Braaten, M. Strickland, Phys. Rev. D61 (2000) 014017.\n25. E. Braaten, Phys. Rev. Lett. 74 (1995) 2164 [hep-ph/9409434].\n\n\f12\n26. E. Braaten and A. Nieto, Phys. Rev. Lett. 76 (1996) 1417 [hep-ph/9508406].\n27. E. Braaten and A. Nieto, Phys. Rev. D 53 (1996) 3421 [hep-ph/9510408].\n28. K. Kajantie, M. Laine, K. Rummukainen and Y. Schroder, Phys. Rev. Lett. 86 (2001)\n10 [hep-ph/0007109].\n29. J. M. Luttinger, J. C. Ward, Phys. Rev. 118 (1960) 1417.\n30. C. De Dominicis and P.C. Martin, J. Math. Phys. 5, 14, 31 (1964).\n31. G. Baym, Phys. Rev. 127 (1962) 1391.\n32. E. Riedel, Z. Phys. 210 (1968) 403–422.\n33. G. M. Carneiro and C. J. Pethick, Phys. Rev. B 11, 1106 (1975).\n34. B. Vanderheyden, G. Baym, J. Stat. Phys. 93 (1998) 843.\n35. H. van Hees, J. Knoll, Renormalization in self-consistent approximations schemes at\nfinite temperature. I: Theory, hep-ph/0107200 (2001).\n36. E. Braaten, E. Petitgirard, Solution to the 3-loop Φ-derivable approximation for massless scalar thermodynamics, hep-ph/0107118 (2001).\n37. R. Gavai, these proceedings.\n38. J. P. Blaizot, E. Iancu and A. Rebhan, arXiv:hep-ph/0110369.\n\n\f"}