{"id": "http://arxiv.org/abs/hep-ph/0006278v2", "guidislink": true, "updated": "2000-07-11T23:12:56Z", "updated_parsed": [2000, 7, 11, 23, 12, 56, 1, 193, 0], "published": "2000-06-23T21:50:13Z", "published_parsed": [2000, 6, 23, 21, 50, 13, 4, 175, 0], "title": "Three flavour neutrino oscillations in models with large extra\n  dimensions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0006148%2Chep-ph%2F0006270%2Chep-ph%2F0006119%2Chep-ph%2F0006151%2Chep-ph%2F0006102%2Chep-ph%2F0006081%2Chep-ph%2F0006238%2Chep-ph%2F0006104%2Chep-ph%2F0006092%2Chep-ph%2F0006288%2Chep-ph%2F0006246%2Chep-ph%2F0006300%2Chep-ph%2F0006060%2Chep-ph%2F0006120%2Chep-ph%2F0006155%2Chep-ph%2F0006019%2Chep-ph%2F0006122%2Chep-ph%2F0006143%2Chep-ph%2F0006094%2Chep-ph%2F0006278%2Chep-ph%2F0006206%2Chep-ph%2F0006342%2Chep-ph%2F0006266%2Chep-ph%2F0006135%2Chep-ph%2F0006252%2Chep-ph%2F0006198%2Chep-ph%2F0006234%2Chep-ph%2F0006244%2Chep-ph%2F0006063%2Chep-ph%2F0006195%2Chep-ph%2F0006280%2Chep-ph%2F0006036%2Chep-ph%2F0006106%2Chep-ph%2F0006046%2Chep-ph%2F0006157%2Chep-ph%2F0006219%2Chep-ph%2F0006086%2Chep-ph%2F0006190%2Chep-ph%2F0006133%2Chep-ph%2F0006354%2Chep-ph%2F0006267%2Chep-ph%2F0006326%2Chep-ph%2F0006320%2Chep-ph%2F0006348%2Chep-ph%2F0006260%2Chep-ph%2F0006294%2Chep-ph%2F0006321%2Chep-ph%2F0006249%2Chep-ph%2F0006057%2Chep-ph%2F0006316%2Chep-ph%2F0006312%2Chep-ph%2F0006220%2Chep-ph%2F0006115%2Chep-ph%2F0006013%2Chep-ph%2F0006351%2Chep-ph%2F0006228%2Chep-ph%2F0006027%2Chep-ph%2F0006128%2Chep-ph%2F0006188%2Chep-ph%2F0006237%2Chep-ph%2F0006178%2Chep-ph%2F0006043%2Chep-ph%2F0006340%2Chep-ph%2F0006290%2Chep-ph%2F0006072%2Chep-ph%2F0006344%2Chep-ph%2F0006112%2Chep-ph%2F0006221%2Chep-ph%2F0006175%2Chep-ph%2F0006225%2Chep-ph%2F0006276%2Chep-ph%2F0006179%2Chep-ph%2F0006049%2Chep-ph%2F0006082%2Chep-ph%2F0006132%2Chep-ph%2F0006131%2Chep-ph%2F0611010%2Chep-ph%2F0611302%2Chep-ph%2F0611223%2Chep-ph%2F0611110%2Chep-ph%2F0611226%2Chep-ph%2F0611136%2Chep-ph%2F0611243%2Chep-ph%2F0611337%2Chep-ph%2F0611299%2Chep-ph%2F0611200%2Chep-ph%2F0611238%2Chep-ph%2F0611331%2Chep-ph%2F0611372%2Chep-ph%2F0611191%2Chep-ph%2F0611390%2Chep-ph%2F0611252%2Chep-ph%2F0611040%2Chep-ph%2F0611326%2Chep-ph%2F0611245%2Chep-ph%2F0611172%2Chep-ph%2F0611055%2Chep-ph%2F0611211%2Chep-ph%2F0611092%2Chep-ph%2F0611291%2Chep-ph%2F0611064&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Three flavour neutrino oscillations in models with large extra\n  dimensions"}, "summary": "The key challenges for models with large extra dimensions, posed by neutrino\nphysics are: first to understand why neutrino masses are small and second,\nwhether one can have a simultaneous explanation of all observed oscillation\nphenomena. There exist models that answer the first challenge by using singlet\nbulk neutrinos coupled to the standard model in the brane. Our goal in this\npaper is to see to what extent the simplest versions of these models can answer\nthe second challenge. Our conclusion is that the minimal framework that has no\nnew physics beyond the above simple picture cannot simultaneously explain\nsolar, atmospheric and LSND data, whereas there are several ways that it can\naccommodate the first two. This would suggest that confirmation of LSND data\nwould indicate the existence of new physics either in the brane or in extra\ndimensions or both, if indeed it turns out that there are large extra\ndimensions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0006148%2Chep-ph%2F0006270%2Chep-ph%2F0006119%2Chep-ph%2F0006151%2Chep-ph%2F0006102%2Chep-ph%2F0006081%2Chep-ph%2F0006238%2Chep-ph%2F0006104%2Chep-ph%2F0006092%2Chep-ph%2F0006288%2Chep-ph%2F0006246%2Chep-ph%2F0006300%2Chep-ph%2F0006060%2Chep-ph%2F0006120%2Chep-ph%2F0006155%2Chep-ph%2F0006019%2Chep-ph%2F0006122%2Chep-ph%2F0006143%2Chep-ph%2F0006094%2Chep-ph%2F0006278%2Chep-ph%2F0006206%2Chep-ph%2F0006342%2Chep-ph%2F0006266%2Chep-ph%2F0006135%2Chep-ph%2F0006252%2Chep-ph%2F0006198%2Chep-ph%2F0006234%2Chep-ph%2F0006244%2Chep-ph%2F0006063%2Chep-ph%2F0006195%2Chep-ph%2F0006280%2Chep-ph%2F0006036%2Chep-ph%2F0006106%2Chep-ph%2F0006046%2Chep-ph%2F0006157%2Chep-ph%2F0006219%2Chep-ph%2F0006086%2Chep-ph%2F0006190%2Chep-ph%2F0006133%2Chep-ph%2F0006354%2Chep-ph%2F0006267%2Chep-ph%2F0006326%2Chep-ph%2F0006320%2Chep-ph%2F0006348%2Chep-ph%2F0006260%2Chep-ph%2F0006294%2Chep-ph%2F0006321%2Chep-ph%2F0006249%2Chep-ph%2F0006057%2Chep-ph%2F0006316%2Chep-ph%2F0006312%2Chep-ph%2F0006220%2Chep-ph%2F0006115%2Chep-ph%2F0006013%2Chep-ph%2F0006351%2Chep-ph%2F0006228%2Chep-ph%2F0006027%2Chep-ph%2F0006128%2Chep-ph%2F0006188%2Chep-ph%2F0006237%2Chep-ph%2F0006178%2Chep-ph%2F0006043%2Chep-ph%2F0006340%2Chep-ph%2F0006290%2Chep-ph%2F0006072%2Chep-ph%2F0006344%2Chep-ph%2F0006112%2Chep-ph%2F0006221%2Chep-ph%2F0006175%2Chep-ph%2F0006225%2Chep-ph%2F0006276%2Chep-ph%2F0006179%2Chep-ph%2F0006049%2Chep-ph%2F0006082%2Chep-ph%2F0006132%2Chep-ph%2F0006131%2Chep-ph%2F0611010%2Chep-ph%2F0611302%2Chep-ph%2F0611223%2Chep-ph%2F0611110%2Chep-ph%2F0611226%2Chep-ph%2F0611136%2Chep-ph%2F0611243%2Chep-ph%2F0611337%2Chep-ph%2F0611299%2Chep-ph%2F0611200%2Chep-ph%2F0611238%2Chep-ph%2F0611331%2Chep-ph%2F0611372%2Chep-ph%2F0611191%2Chep-ph%2F0611390%2Chep-ph%2F0611252%2Chep-ph%2F0611040%2Chep-ph%2F0611326%2Chep-ph%2F0611245%2Chep-ph%2F0611172%2Chep-ph%2F0611055%2Chep-ph%2F0611211%2Chep-ph%2F0611092%2Chep-ph%2F0611291%2Chep-ph%2F0611064&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The key challenges for models with large extra dimensions, posed by neutrino\nphysics are: first to understand why neutrino masses are small and second,\nwhether one can have a simultaneous explanation of all observed oscillation\nphenomena. There exist models that answer the first challenge by using singlet\nbulk neutrinos coupled to the standard model in the brane. Our goal in this\npaper is to see to what extent the simplest versions of these models can answer\nthe second challenge. Our conclusion is that the minimal framework that has no\nnew physics beyond the above simple picture cannot simultaneously explain\nsolar, atmospheric and LSND data, whereas there are several ways that it can\naccommodate the first two. This would suggest that confirmation of LSND data\nwould indicate the existence of new physics either in the brane or in extra\ndimensions or both, if indeed it turns out that there are large extra\ndimensions."}, "authors": ["R. N. Mohapatra", "A. Pérez-Lorenzana"], "author_detail": {"name": "A. Pérez-Lorenzana"}, "author": "A. Pérez-Lorenzana", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/S0550-3213(00)00634-9", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0006278v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0006278v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "LaTeX file, 20 pages, 7 figures included. Minor changes: One figure\n  added, typos corrected", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0006278v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0006278v2", "journal_reference": "Nucl.Phys.B593:451-470,2001", "doi": "10.1016/S0550-3213(00)00634-9", "fulltext": "UMD-PP-00-083\n\nThree flavour neutrino oscillations in models with large extra\ndimensions\nR. N. Mohapatra1∗ , and A. Pérez-Lorenzana1,2†\n1\n\narXiv:hep-ph/0006278v2 11 Jul 2000\n\n2\n\nDepartment of Physics, University of Maryland, College Park, MD, 20742, USA\nDepartamento de Fı́sica, Centro de Investigación y de Estudios Avanzados del I.P.N.\nApdo. Post. 14-740, 07000, México, D.F., México.\n(May, 2000)\n\nAbstract\nThe key challenges for models with large extra dimensions, posed by neutrino\nphysics are: first to understand why neutrino masses are small and second,\nwhether one can have a simultaneous explanation of all observed oscillation\nphenomena. There exist models that answer the first challenge by using singlet bulk neutrinos coupled to the standard model in the brane. Our goal in\nthis paper is to see to what extent the simplest versions of these models can\nanswer the second challenge. Our conclusion is that the minimal framework\nthat has no new physics beyond the above simple picture cannot simultaneously explain solar, atmospheric and LSND data, whereas there are several\nways that it can accommodate the first two. This would suggest that confirmation of LSND data would indicate the existence of new physics either in\nthe brane or in extra dimensions or both, if indeed it turns out that there are\nlarge extra dimensions.\nPACS: 14.60.Pq; 14.60.St; 11,10.Kk;\n\nI. INTRODUCTION\n\nParticle physics models where there are large hidden space dimensions beyond the three\nfamiliar ones have been the focus of intense activity during the past two years [1,2]. Beyond\nthe simple reason that such extra dimensions are predicted by string theories, a major point\nof interest in these models is that often these large extra dimensions come with a TeV scale\nfor the strings which leads to a plethora of new observable phenomena in collider as well in\nother arenas of particle physics and cosmology.\n\n∗ e-mail:rmohapat@physics.umd.edu\n† e-mail:aplorenz@Glue.umd.edu\n\n1\n\n\fIn order for these models to provide a satisfactory description of low energy particle\nphysics, they must handle some obvious problems that come with the existence of a fundamental scale in the multi-TeV range. One such problem has to do with understanding the\nsmall neutrino masses in a natural manner. The conventional seesaw [3] explanation which\nis believed to provide the most satisfactory way to understand this, requires that the new\nphysics scale (or the scale of SU(2)R × U(1)B−L ) be around 1012 GeV or higher. Clearly, low\nstring scale theories do not have any fundamental scale of that type. Moreover, the low value\nof the string scale leads to enhanced (and unacceptable) contributions to neutrino masses\nfrom higher dimensional operators. While there are suggestions involving thick branes with\npoint splitting [4] to remedy similar problems that arise from ∆B 6= 0 operators, they don't\nwork for neutrino mass operators. Therefore, a necessary ingredient to understand small\nneutrino masses in the low string scale models is to assume that theory have a B − L symmetry. This will forbid higher dimensional operators LHLH/M ∗ (M ∗ is the string scale),\nwhich are the source of the problem for neutrino masses.\nDepending on whether B − L is a global or local symmetry, one can have two ways to\nsolve the neutrino mass problem in models with large extra dimensions1 . In the former case,\ndiscussed in [6], one has to introduce singlet bulk neutrinos which then lead to small Dirac\nmasses for them. On the other hand, if B − L symmetry is chosen to be a local symmetry,\nanomaly cancellation requires that, right handed neutrinos be present in the brane as in the\nmodels discussed in Ref. [7,8]. Since local B − L must be broken to avoid massless gauge\nbosons, one again has to deal with the induced operators of the same type as above with\nM ∗ = MB−L . It was shown in Ref. [7,8] that to get neutrino masses in the desired eV range,\none must have string scale M ∗ ≃ MB−L ∼ 109 GeV range or higher. As a result, a class of\nexperimentally accessible phenomenological predictions are lost, although long range gravity\ntests are still possible. These models are similar to the ones discussed in [9].\nIn the context of models that have global U(1)B−L symmetry, one can maintain the TeV\nscale for the strings and still get small neutrino masses by introducing isosinglet neutrinos\nin the bulk as has already been discussed in Ref. [6]. These models are interesting because a\nvery minimal set of particles beyond the standard model are sufficient to get small neutrino\nmasses. Key reason for this result is the relation between the fundamental scale, M ∗ , the\nradius of the extra dimensions, R, and effective Planck scale, MP l ,\nM ∗2+n Rn = MP2 l ,\n\n(1)\n\nSince the singlet neutrino is a bulk field, the effective couplings of its Fourier modes to the\nstandard model fields are naturally suppressed by the ratio M ∗ /MP l , which for a TeV M ∗\nproduces the right order of magnitude for neutrino masses.\nAn analysis of the implications of the mixing profile in these models for solar neutrino\ndeficit was discussed in [10]. Also, implications for atmospheric neutrinos were discussed\nin [11], and some phenomenological bounds were given in [10–13]. Our goal in this paper is to\n\n1 It\n\nis generally believed that string theories do not have any global symmetries [5], which would\nseem to imply that B−L must be a local symmetry. In our discussion, however, we will consider that\nB −L is a global symmetry of the theory, as in Ref. [6] and see where it leads us phenomenologically.\n\n2\n\n\fattempt a unified explanation of all known neutrino oscillation data i.e. solar, atmospheric\nas well as LSND under different assumptions for the initial input parameters for the minimal\nbulk neutrino scenario.\nThe basic reason for embarking on such an ambitious program is the encouraging feature\nthat the masses of the lower KK modes of the bulk neutrinos are given by integral multiples\nof R−1 which is of order 10−3 eV when R ∼ millimeter. This is of the right order necessary to\nsolve the solar neutrino problem via small angle MSW mechanism using νe to νs oscillation.\nThus we see that there exists a natural way to understand the lightness of the sterile neutrino\n[8,10,14], a situation if realized would pose a major challenge to four dimensional theories.\nOnce the solar neutrino problem is understood, it would appear that all the necessary\ningredients are at hand to understand the atmospheric and LSND data using oscillations\namong the familiar neutrinos i.e. νe → νμ for LSND and νμ → ντ for atmospheric.\nThis program has already been undertaken in special parameter domains and it has\nalready been suspected [8,11] that it does not really work. Our goal is to extend these\ndiscussions to a somewhat larger parameter domain to see if there is chance for this program\nto succeed and unfortunately our answer is also in the negative. Our work complements the\nabove works and extends them. Specifically, we try to give analytical reasonings to see how\nthe different oscillation data can (or cannot) be understood. Since we do not take recourse to\na detailed numerical analysis, we cannot rule out the possibility that some small parameter\ndomain exists where all data can be accommodated; but we consider that unlikely.\nThe negative conclusion of our work, combined with the works of [8,11] implies with\nvirtual certainty that in the large extra dimension framework, understanding the neutrino\ndata does require new physics beyond the standard model in the brane or new physics in\nextra dimensions or both.\nOur basic strategy is as follows: we start by requiring that the parameters of the theory\nprovide an explanation for solar and atmospheric oscillations. Then we ask whether they\ncan account for the small LSND probability of νe appearance from the νμ beam.\nThis paper is organized as follows: in section II, we discuss neutrino oscillations with\na single flavour, which depends on two parameters, the bulk radius and a dimensionless\nparameter ξ related to the Dirac mass term in the theory. The latter defines the pattern of\nneutrino oscillations. This analysis sets the stage for the three flavour case, which we discuss\nin section III for various possible domains of the parameter space. We end the paper with\na concluding section that summarizes the results and discusses their implications.\nII. OSCILLATIONS WITH A SINGLE FLAVOUR\n\nLet us begin our discussion by focusing on the simplest case with one generation of\nfermions in the brane and one bulk neutrino, to understand the general profile of the neutrino\noscillations in models with large extra dimensions. We will discuss the necessary ingredients\nto understand the three flavour case that is explored in the next section. Obviously, the\nfields that could propagate in the extra dimensions are chosen to be gauge singlets. Let\nus denote bulk neutrino by νB (xμ , y). It has a five dimensional kinetic energy term and a\ncoupling to the brane field L(xμ ) given by\nL = κL̄HνBR (x, y = 0) +\n\nZ\n\ndy ν̄BL (x, y)∂5 νBR (x, y) + h.c.\n3\n\n(2)\n\n\fwhere from the five dimensional kinetic energy, we have only kept the 5th component that\ncontributes to the mass terms of the KK modes in the brane; H denotes the Higgs doublet,\nM∗\nand κ = h M\nthe suppressed Yukawa coupling. It is worth pointing out that this suppression\nPl\nis independent of the number and radius hierarchy of the extra dimensions, provided that\nour bulk neutrino propagates in the whole bulk. For simplicity, we will assume that there\nis only one extra dimension with radius of compactification as large as a millimiter, and the\nrest with much smaller compactification radii. The smaller dimensions will only contribute\nto the relationship (1) but its KK excitations will be very heavy and decouple from neutrino\nspectrum. Thus, all the analysis could be done as in five dimensions.\nThe first term in Eq. (2) will be responsible for the neutrino mass once the Higgs field\ndevelops its vacuum. The induced Dirac mass parameter will be given by m = κv, which\nfor M ∗ = 1 TeV is about h * 10−5 eV. Obviously this value depends only linearly on the\nfundamental scale. Larger values for M ∗ will increase m proportionally. After introducing\nthe expansion of the bulk field in terms of the KK modes, the Dirac mass terms in (2) could\nbe written as\n!\n!\n√\nν\nm\n2m\n0B\n′\n(ν̄eL ν̄BL\n)\n,\n(3)\n′\nνBR\n0 ∂5\nwhere\nour notation is as follows: νB′ represents the√KK excitations, the off diagonal term\n√\n2m is actually an infinite row vector of the form 2m(1, 1, * * *). The operator ∂5 stands\nfor the diagonal and infinite KK mass matrix whose n-th entrance is given by n/R. This\nnotation was introduced in [7] to represent the infinite mass matrix in a compact manner.\nUsing this short hand notation makes it easier to calculate the exact eigenvalues and the\neigenstates of this mass matrix [8]. Simple algebra yields the characteristic equation\n2λn = πξ 2 cot(πλn ),\n\n(4)\n\n√\nwith λn = mn R, ξ = 2mR, and where mn is the mass eigenvalue [6,10]. The eigenstates,\non the other hand are given symbolically by [8]\n√\n\"\n#\n2m∂5 ′\n1\nνL + 2\n,\n(5)\nν\nν̃nL =\nNn\nmn − ∂52 BL\nwhere the sum over the KK modes in the last term is implicit. Nn is the normalization\nfactor given by\nNn2 =\n\n\u0011\n1 \u0010 2\nλ\n+\nf\n(ξ)\n,\nξ2 n\n\n(6)\n\nwhere f (ξ) = ξ 2 /2 + π 2 ξ 4 /4. Figures 1 and 2 depict the exact numerical results of λn and\nNn for several choices for the value of the ξ parameter. Using the expression (5), we can\nwrite down the weak eigenstate νL in terms of the massive modes as\nνL =\n\n∞\nX\n\n1\nν̃nL .\nn=0 Nn\n\n(7)\n\nThus, the weak eigenstate is actually a coherent superposition of an infinite number of\nmassive modes. Therefore, even for this single flavour case, the time evolution of the mass\n4\n\n\feigenstates involves in principle all mass eigenstates and is very different from the simple\noscillatory behaviour familiar from the conventional two or three neutrino case. The time\ndependent survival probability is given by\nL\n\n2\n\nei 2ER2 λn\nPsurv (L) = |hνL (L)|νL (0)i|2 =\nNn2\nn=0\n∞\nX\n\n2\n\n= 1−2\n\n∞\nX\n\nsin2\n\nk,n=0\n\n\u0010\n\nL\n(λ2n\n4ER2\nNn2 Nk2\n\n− λ2k )\n\n\u0011\n\n.\n\n(8)\n\nIt is clear that the survival probability depends strongly on the parameter ξ, reflecting the\nuniversal coupling of all the KK components of νB with νL in (2). Figures 3 and 4 show the\nprofile of the survival probability obtained from the numerical solutions for three different\nvalues of ξ and is clearly very different from simple familiar oscillatory behaviour. However,\nto better understand these results, we will follow an analytical approach in what follows.\nIt is simpler to consider the two limiting cases. First let us assume that ξ ≪ 1. As already\nknown [8,10], the eigenvalues in this case are given by λ0 = mR, and λn = n otherwise.\nTherefore, to a good approximation, we may take the mixing parameters N0 = η, and\nNn = (n/ξ)η for non zero n. Where the extra factor η = (1 + π 2 ξ 2 /6)1/2 is introduced to\nkeep the proper normalization in the expansion (7). This approximation is confirmed by our\nfigures 1 and 2. The survival probability is now given as\nPsurv (L) = 1 −\n\n∞\nX\n\n4 2\nξ\nη 4 n=1\n\nsin2\n\n\u0010\n\nn2 L\n4ER2\nn2\n\n\u0011\n\n−\n\n∞\nX\n\n2 4\nξ\nη 4 k,n=1\n\nsin2\n\n(n2 −k 2 )L\n4ER2\n2\nn k2\n\nh\n\ni\n\n.\n\n(9)\n\nIt is simple to see from last expression that the probability has an oscillation length Losc =\n4πER2 . A typical profile in this case is depicted in figure 4. Also, the main contribution\nto the oscillation pattern comes from the lowest elements of the tower, which turns out to\nbe the main component of νL . Another way to see this result is to note that ξ could be\nmade small by making R small; but this makes the KK excitation masses large so that they\ndecouple from the light sector of the theory leaving only the right handed component of\nthe zero mode of the bulk neutrino, νBR to form a Dirac mass with νL and stay light. The\nleft-handed zero mode decouples and remains massless.\nIn the ξ ≪ 1 limit, the small mixing with the tower elements leads to an oscillation\npattern dominated by the lightest KK mode with a mass just about 1/R and more or less\nsimulate the familiar oscillatory one. This can happen, for instance, if R ∼ 0.2 mm, which\ngives 1/R2 ∼ 10−6 eV 2 , just about what it is needed to provide an explanation to the solar\nneutrino problem assuming a small MSW mixing angle [10]. To use this case to compare\nwith solar neutrino data, one needs to include the matter effect, which has already been\ndiscussed in Ref. [10] and we do not enter into this here.\nA more direct application of the formula in Eq. (9) can be made to discuss the atmospheric neutrino oscillations, which is a vacuum oscillation. However, to get the equivalent\nof large mixing angle we need to adjust ξ ∼ 1 and 1/R2 ∼ ∆m2atm , which means that Eq.\n(9) is not applicable and we must therefore use Eq. (8) and study its large ξ limit.\nTo discuss this, we start with the limit when ξ ≫ 1. First thing to note is that the\npattern of eigenvalues is very different in this case from the small ξ case. For small values\nof n the eigenvalues are well approximated by λn = 2n+1\n, while Nn becomes n independent\n2\nuntil certain cut off value that roughly speaking is given by nΛ = π 2 ξ 2/4. Beyond that\npoint λn ≈ n and we may no longer neglect the contribution of λn to (6). This results in\n5\n\n\fa suppression of Nn that goes like 1/n. It should therefore be reasonable to consider as a\nfirst approximation that the expansion (7) is cut off at nΛ , and that all the mass eigenstates\n√\ncontributing to νL are equally suppressed by 1/ nΛ . In this approximation, we obtain the\nsurvival probability to be\nPsurv (L) = 1 −\n\n\u0015\n\u0014\nnΛ\n2 X\nL\n2\n2\n2\n(λ\n−\nλ\n)\n.\nsin\nk\nnΛ 2 k,n=0\n4ER2 n\n\n(10)\n\nCertainly, this relation presents a oscillatory profile, however, the superposition of the equally\nsuppressed oscillations will result most of the time on a destructive interference, with the\nexception of the very sharp resonances that appear each time L reaches a multiple of the\noscillation length. In other words, νL is a superposition of a large number of mass eigenstates,\nwith masses covering a large range, from 1/2 to nΛ in units of 1/R, all of them contributing by\nthe same amount. As a result, once νL is released, one may surmise that the time evolution\nof the different components will most likely wash out the original coherent superposition\nand the initial νL will almost disappear. As fig. 3 shows, this conclusion is borne out by the\nthe numerical analysis. To get an analytical result that also supports this conclusion, note\nthat in the sum in Eq. (10), the dominant contributions come when n 6= k in which case\neach term in the sum averages to 1/2 and on performing the double sum it is easy to see\nthat one arrives at P̄surv ≈ 1/nΛ .\nIf nΛ is very large, it suppresses the survival probability too much and cannot help in\nthe understanding of the atmospheric data. So, clearly, if we wanted an understanding of\nthe atmospheric data, we must assume smaller ξ, perhaps values closer to one. In this case,\ntruncating the sum in the expression for the survival probability in Eq. (9), cannot be\njustified and we must seek an alternative way to deal with Eq. (8). An approach suggested\nin [11] is to use a continuous approximation to the sum in Eq. (8), which leads to\nPsurv (z) =\n\nZ\n\n∞\n\n0\n\n2\n\n2\n\nπ2ξ 4\n4f (ξ)\n\neizn\nξ4 =\ndn 2\nn + f (ξ)\n\n!\n\n1 − erf\n\n\u0012q\n\nizf (ξ)\n\n\u0013\n\n2\n\n,\n\n(11)\n\nwhere z = L/2ER2 . Clearly, for large ξ; f (ξ) ∼ π 2 ξ 4 /4, and last expression in Eq. (11)\nsimplifies. In order to study the dependence of Psurv (z) on ξ, we plot Psurv in Fig. 3 in\nthe continuous and discrete approximations. One thing that emerges is the non-oscillatory\nnature of the function as we exceed ξ = 1. We also see that the continuous limit gives a good\napproximation for the slope (see figure 3), even for cases where ξ ≤ 1 [11]. This expression,\nhowever, does not represent the survival probability in the limit ξ ≪ 1, since in this case\n(i.e. ξ ≪ 1), the Psurv has an oscillatory behaviour unlike the last term in Eq. (11) (see\nfigure 4). In the overlap region close to ξ ≃ 1, one may evaluate the second term in Eq. (11)\nin a slightly different way which leads to an expression for the survival probability as\nPsurv (ζ) = ρ2 (ζ) + θ2 (ζ),\n\n(12)\nq\n\nq\n\nwhere we have introduced the new variable ζ = zf (ξ) = (πξ 2 /2R) L/2E and the functions ρ(ζ) = 1 − C(ζ) − S(ζ); and θ(ζ) = C(ζ) − S(ζ) with S and C the sine and cosine\nFresnel integrals:\nC(ζ) =\n\ns\n\n2\nπ\n\nZ\n\n0\n\nζ\n\n2\n\ndt cos(t )\n\nand\n6\n\nS(ζ) =\n\ns\n\n2\nπ\n\nZ\n\n0\n\nζ\n\ndt sin(t2 ).\n\n\fWe draw attention to the fact that ζ involves not only the model parameters ξ and R but\nalso the experimental variable z. Thus for a given model, the variable ζ has different values\nfor different oscillation experiments; for instance, for the atmospheric neutrino case, a typical\n2\nvalue for ζ ∼ πξ\n1.2 × 102 eV−1 .\n2R\nThe expression (12) is valid just before Psurv (ζ) reaches the average, P̄surv = 4/π 2 ξ 2 . In\nfigure 5 we present the behaviour of ρ, θ and Psurv . Note the steep fall off of Psurv as ζ increases. For ζ = 1, Psurv has already dropped under 20%, which is smaller than the observed\ndeficit in solar and atmospheric data. Therefore, if we want to fit the overall suppression of\nthe atmospheric neutrinos, we must remain in a very narrow range of parameters. A rough\nestimate of these parameters may be obtained by expanding (12) to first order on ζ, which\nyields\ns\n\n√\n2\nξ2\nPsurv (ζ) ≈ 1 − 2\nζ =1−2 π\nπ\nR\n\n!\u0012\n\nL\n4E\n\n\u0013 21\n\n.\n\n(13)\n\nNow, we may invert the last equation to get\nξ2\n(1 − P̄exp ) L\n√\n≃\nR\n4E\n4π\n\u0012\n\n\u0013− 12\n\n.\n\n(14)\n\nexp\n\nUsing average values for the L, E and Pexp for atmospheric neutrinos, we find ξ 2 /R ≈\n10−2 eV . Note that this naive approximation gives just about the value obtained by the\nnumerical fitting of the data in [11]. For this value, as ξ > 1, we get R in the range\n10−3 eV < 1/R < 10−2 eV implying 1 < ξ 2 < 10. Thus a solution to the atmospheric\nneutrino puzzle using KK modes requires that R be in the sub-millimeter range. This in\nturn determines how large M ∗ should be to avoid any unwanted large fine tuning. We see\nthat for m ≥ 10−3 eV and Yukawa coupling h of order one, we need M ∗ ≥ 100 T eV .\nWe also point out that in the case of ξ ≥ 1, extra dimensions must be much larger than a\nmillimeter if we want to fit the solar neutrino data either via MSW or via vacuum oscillation.\nTo see this note that if we take ∆m2sol ∼ 10−6 eV2 , this would imply L/4E ∼ 1/∆m2sol ∼ 106\neV−2 . Putting this in Eq. (13), we get ξ 2 /R ≃ 10−4 eV. For ξ ≫ 1, this implies that R ≫ 0.2\nmm. Similar estimate for the case of vacuum oscillation yields R ≫ 2 cm. Therefore, in all\nour discussion of solar neutrino oscillations involving the bulk neutrinos, we will work in the\napproximation ξ ≪ 1.\nLet us now summarize our findings for a single neutrino case: for ξ ≪ 1, Psurv has an\noscillatory behaviour as given by (9). As ξ approaches 1, λn starts to deviate from the\ninteger value n, which in turn disturbs the periodic nature of Psurv and the maximum and\nminimum values of probability are not reached away from the source [6]. This picture gets\nworse as one approaches ξ ≫ 1 when a very sharp slope drives the probability near zero as\nwe move away from the source of the neutrinos and it remains around its average, 4/π 2ξ 2 ,\nmost of the time. For this reason, whenever we try to fit the atmospheric neutrino data\nwith bulk neutrinos, the value of ξ must be tuned to a very narrow range.\nLet us apply the discussions of this section to study how the oscillation of known neutrinos\nto bulk ones would effect the current experiments such as CHOOZ-PALOVERDE, LSND and\nthe atmospheric neutrinos. For this purpose, we first note that in contrast with the usual two\nneutrino oscillation case, where the pattern is determined by three parameters, the mixing\n7\n\n\fangle θ, the ∆m2 and L/4E for the experiment, in the case of bulk neutrino oscillation,\nwe have L/4E characterizing an experiment like before, bulk radius R, which replaces ∆m2\n(which we will assume to be in the milli-meter range) and model parameter ξ (which is\nthe analog of the mixing angle). For a given R, ξ is the only parameter characterizing the\noscillation pattern. In Fig. 6, we plot the variation of the survival probability Psurv against ξ\nfor the various cases mentioned above for a typical characteristic value of L/4E. We see from\nthis figure that to explain the observed overall deficit of atmospheric neutrinos by nearly\n50%, one needs to go to ξ ∼ 1.5 or so. This conclusion is in acoord with our conclusion\nbased on Eq. (14) above.\nIII. THREE FLAVOUR OSCILLATIONS\n\nLet us now apply the discussion of the previous section to the case of three standard\nmodel generations in the brane so that we have three brane neutrinos νe,μ,τ . To give masses\nto all of them in a minimal scenario, we will use three bulk neutrinos and allow arbitrary\nYukawa couplings between the bulk and the brane neutrinos. This leads to an arbitrary\nDirac mass matrix that involves the familiar left-handed neutrinos and the right handed\nKaluza-Klein modes of the bulk neutrinos. As already discussed in [8], the most general\nDirac mass terms with three flavours may be written, after a rotation of the bulk fields, as\nL = ν̄L * UMD * νBR (y = 0) +\n\nZ\n\ndy ν̄BL * ∂5 * νBR + h.c.,\n\n(15)\n\nwhere U is a unitary matrix and MD = Diag(m1 , m2 , m3 ), in the basis where νL =\n(νe , νμ , ντ )L ; and νB = (νB1 , νB2 , νB3 ). The mass parameters mα are just the eigenvalues of\nthe Yukawa coupling matrix multiplied by v, the vacuum expectation value of the standard\nmodel doublet field. They are of the order of eV or less since the couplings of the bulk modes\nto the brane fields are naturally suppressed, as already stated on the previous section.\nNow, to simplify the discussion, we rotate the weak eigenstate neutrinos νa to the ones\nrelated to the weak eigenstates by the rotation U i.e. νa = Uaα να , where a = e, μ, τ and\nα = 1, 2, 3. We then have\nL=\n\n3 \u0014\nX\n\nα\nmα ν̄αL νBR\n(y\n\n= 0) +\n\nα=1\n\nZ\n\ndy\n\nα\nα\nν̄BL\n∂5 νBR\n\n\u0015\n\n+ h.c. .\n\n(16)\n\nThis reduces the problem to a consideration of three KK towers mixing with three neutrinos\nwhich are related to the weak interaction eigenstates by the unitary matrix U defined above.\nEach tower is characterized by its ξα parameter defined in analogy with section II as ξα ≡\n√\n2mα R. After diagonalization of the mass matrices in each tower, each standard neutrino\ncan be written as a coherent superposition of the three different towers of mass eigenstates:\nνa =\n\n3\nX\n\nα=1\n\nUaα να =\n\n3 X\n∞\nX\n\nα=1 k=0\n\nUaα\n\n1\nν̃αk .\nNαk\n\n(17)\n\nThis expression generalizes Eq. (7). It is now clear that the three flavour oscillations will\ncorrespond to the oscillations among the three towers. In this regards, the explanation to\nneutrino puzzles is not any more described in terms of three single neutrinos, as in the usual\n8\n\n\fcase; instead all the KK modes can contribute (unless all the KK excitations decouple from\nthe spectrum).\nTo proceed further, let us define the partial transition probabilities\npαβ (L) ≡ hνα (L)|να (0)ihνβ (L)|νβ (0)i.\n\n(18)\n\nNotice that the diagonal component pαα may be interpreted as the survival probability of\nνα , and it takes the form of Eqs. (9) and (12) in that case. It of course involves the να 's and\nnot the flavor eigenstates as is obvious. The transition probability among standard flavours\ncan be written in terms of the pαβ 's as\nPab =\n\nX\n\n∗\n∗\nUaα\nUbα Ubβ\nUaβ pαβ .\n\n(19)\n\nαβ\n\nNeglecting all CP phases we may expand Eq. (18) to the form\npαβ = 1 − 2\n\n∞\nX\n\nsin2\n\nk,n=0\n\n\u0010\n\nz\n(λ2αn\n2\n\n− λ2βk )\n\n2 (ξ )N 2 (ξ )\nNαn\nα\nβk β\n\n\u0011\n\n.\n\n(20)\n\nNow, we are ready to address the oscillation problem. Our approach will be as follows:\nwe will first select the parameter range that provides overall reduction required to explain\nthe solar and atmospheric data, and then ask whether for the same range of parameters we\ncan explain the observed oscillation between ν̄μ to ν̄e reported by LSND. Without loss of\ngenerality, we can assume the hierarchy ξ1 < ξ2 < ξ3 . We consider three possible scenarios:\n(i) ξ1,2,3 ≪ 1;\n(ii) ξ1,2 ≪ 1 ≤ ξ3 and\n(iii) ξ1 ≪ 1 ≤ ξ2,3 .\nThe case where all ξa > 1 is already ruled out since, as we discussed earlier, it cannot\nexplain the solar neutrino data without implying that the extra dimensions be too large. We\ntherefore do not discuss this case. In the discussion of our results, the following expressions\nfor the partial transition probabilities will be very useful: If ξα,β ≪ 1, then\npαβ =\n\n\u0010\n\u0011\n\u0010\n\u0011\nL\n1\n2\n2\n2\n2 2\n2\n2\ncos\n∆m\n+\nξ\n+\nξ\nc(z)\n+\nξ\nξ\nc\n(z)\n+\ns\n(z)\n,\nαβ\nα\nβ\nα β\nηα2 ηβ2\n2E\n\u0014\n\n\u0012\n\n\u0013\n\n\u0015\n\n(21)\n\nwith ∆m2αβ = m2α − m2β ; ηα2 = 1 + π 2 ξα2 /6 and z = L/2ER2 as before, and where we have\nintroduced the functions\nc(z)\ns(z)\n\n!\n\n∞\nX\n\n1\n=\n2\nn=1 n\n\ncos(zn2 )\nsin(zn2 )\n\n!\n\n.\n\n(22)\n\nIt is simple to check that the diagonal term of Eq. (21) reduces to Eq. (9). For ξα ≪ 1 < ξβ\nwe get\npαβ\n\nξα2\n1\n= 2 cβ (z) + 2 (c(z) cβ (z) + s(z) sβ (z)) ;\nηα\nηα\n9\n\n(23)\n\n\fwhere we now used cβ√(z) = cos(ζβ2 )ρ(ζβ ) − sin(ζβ2 )θ(ζβ ) and sβ (z) = sin(ζβ2)ρ(ζβ ) +\ncos(ζβ2)θ(ζβ ) with ζβ = zπξβ2 /2, and ρ and θ as defined in the previous section, we should\nstress that all those functions have a similar deep behaviour. And, finally, for ξα,β > 1 we\nhave\npαβ = cα (z) cβ (z) + sα (z) sβ (z).\n\n(24)\n\nAgain, it is straightforward to check that the diagonal component of this equation reduces\nto Eq.(12).\nA. Case I: ξα ≪ 1\n\nSubstituting Eq. (21) into (19), we get, to leading order in ξα\nPab = δab − 2\n\nX\n\nUaα Ubα Ubβ Uaβ sin\n\nα,β\n\n2\n\n\u0012\n\nL\n∆m2αβ + O(ξα2 ).\n4E\n\u0013\n\n(25)\n\nTherefore, as expected, to this order, we obtain the standard expression for the transition\nprobability well known for the three neutrino case. It is clear that in this scenario, solar\nand atmospheric data can be explained as in the usual three flavour neutrino models by\nadjusting the spacing of the different ξα 's. For the solar neutrino puzzle, one may either use\nMSW or VO solution depending on how much fine tuning one is willing to tolerate.\nFor intermediate values where L/4E ≪ 1/∆m2αβ , the leading corrections in ξ become\nimportant. Expanding Pab up to order ξ 4 , by introducing Eq. (21) and neglecting the\nstandard oscillatory term we found\n\"\n\nPab ≈ δab 1 − 2\n\nξ2\n|Uaα |2 α2\nηα\nα\n\nX\n\nπ2\n− c(z)\n6\n\n!#\n\n+\n\nX\n\nUaα Ubα ξα2\n\nα\n\n!2\n\nI(z);\n\n(26)\n\nwhere we have denoted\nπ2\nπ4\n+ c2 (z) + s2 (z) − c(z) ,\nI(z) =\n36\n3\n#\n\n\"\n\n(27)\n\nNotice that the first term between parenthesis on Eq. (26) contains the lower order correction\nto the standard survival probability in Eq. (25), while the second term, of oder ξα4 will be\nonly relevant for flavour transitions. Taking the average on the last equations, and using\nthat c̄ = 0 and c2 + s2 = π 4 /90, we get\nP̄ab ≈ δab\n\n2\nπ2 X\n2 ξα\n1−\n|Uaα | 2\n3 α\nηα\n\n!\n\n7 4 X\n+\nπ\nUaα Ubα ξα2\n180\nα\n\n!2\n\n.\n\n(28)\n\nThis last expression generalizes that presented in Ref. [11], where only the contribution of\nξ3 was assumed.\nIt is clear that understanding LSND results in this case would require that νμ first undergo\na transition to the lower KK modes of the bulk neutrinos and then back to the νe . One\nmight hope that if we adjusted the extra dimension radius to be small enough R−1 ∼ 0.2 − 2\n10\n\n\feV, then one would get the right mass difference to fit LSND data. The key question then\nis to see whether the transition rate comes out right. For this purpose, we consider up to\nthe lowest non-vanishing order in ξα for Pμe given in (26), which after using the unitarity of\nU and the fact that ξ32 − ξ12 = 2∆m2atm R2 turns out to have the form\nPμe ≈ sin2 2θμe\n\n\u0010\n\n∆m2atm R2\n\n\u00112\n\nI(z)\n\n(29)\n\nwith sin2 2θμe ≡ 4(Uμ3 Ue3 )2 . It is straightforward to check that Pμe (L = 0) = 0 by using\nthe identities c(0) = π 2 /6 and s(0) = 0. From the limits obtained by the CHOOZ and\nPalo Verde collaboration, we know that |Ue3 |2 < 0.03 [15], and assuming |Uμ3 |2 = 0.5 for\nmaximal mixing, the largest optimistic value for the mixing angle we may take is about\nsin2 2θμe = 0.06. By fixing L/E as for LSND, I(z) becomes only a function of R (since\nz = L/2ER2 ). In figure 7 we have plotted I(R) versus R. From this figure we see that for\na reasonable large R (∼ 10 eV −1 ), the function I(R) has very small values already. The\ncombined effect with the factor ∆m2atm R2 < 1 will reduce Pμe even more. Clearly, Pμe will\nbe maximal for the larger possible value of R. However, the largest\nallowed radius that\nq\npermit us to still be confident in our approach is about 1/R ∼ ∆m2atm ∼ 0.06 eV . A\nnumerical calculation with these inputs gives for LSND Pμe = 3 × 10−4 , which is one order\nof magnitude smaller than the observed anomaly in the ν̄ beam of LSND. Since higher order\ncorrections in ξα to the probability are unlikely to introduce enough enhancement (a factor\nof 10 is needed), we conclude that this scenario yields a too small probability for νμ − νe\ntransition to explain the LSND observations.\nB. Case II: ξ1,2 ≪ 1 ≤ ξ3\n\nTo proceed with this case, it is convenient to write the survival probability Paa in the\nfollowing form:\nPaa =\n\nX\n\n2\n(Uaα Uaβ )2 pαβ + 2Ua3\n\nX\n\n2\n4\nUaα\npα3 + Ua3\np33 .\n\n(30)\n\nα=1,2\n\nα,β=1,2\n\nThe first term in the above equation can be written to leading order in the small ξ's as\nfollows:\nX\n\nα,β=1,2\n\n\u0010\n\n2\n(Uaα Uaβ )2 pαβ ≈ 1 − Ua3\n\n\u00112\n\n− sin2 2θaa sin2\n\n\u0012\n\nL\n∆m221\n4E\n\n\u0013\n\n+ O(ξ 2)\n\n(31)\n\nwhere sin2 2θaa = 4(Ua1 Ua2 )2 . This term by itself can explain the solar neutrino deficit.\nClearly, the standard two neutrino oscillation expression is recovered to this order if we\nset Ue3 ∼ 0 to satisfy the bounds imposed by the reactor data [15]. This will make the\ncontributions of the last two terms in the survival probability (30) negligible and the first\noscillatory term can then be used to solve the solar neutrino puzzle. One can of course use\nthe MSW mechanism to solve the solar neutrino problem or the vacuum oscillation. The\nconstraint on the parameter space is that the ∆m212 be appropriately adjusted. This does\nnot impose any condition on the bulk radius and can be satisfied by the initial choice of\nparameters (the Yukawa couplings) in the theory. For instance, M ∗ ∼ 10 TeV can lead to\n11\n\n\fthe MSW-type mass differences. Let us note that, if ∆m212 ∼ 10−5 eV2 , then, we will have\n|ξ12 − ξ22 | ∼ 10−5 R2 (eV cm)2 .\nNow let us consider Pμμ . From Eq (30), we see that there are several contributions to the\natmospheric neutrino deficit. First, there is the contribution of the towers labeled by ξ1,2 ,\nwhich is oscillatory, although it can not be identified as in the usual νμ → ντ oscillations.\nThen, there is also the contribution induced by the term p33 which is of the form of (12).\nFinally, there is also a mixed term, pα3 .\nTo proceed with the full discussion, let us consider two cases:\nCase (i): Uμ3 = 0\nIf Uμ3 = 0, the last two contributions are removed and we get the survival probability\nPμμ ≈ 1 − 4\n\n\u0010\n\n2\n2Uμ2\n∆m221 R2\n\n+\n\nξ12\n\n\u0011\n\nπ2\n− c(z)\n6\n\n!\n\n(32)\n\nOne might then hope that the oscillations into the lower KK\nq modes with mass differences\nof about 1/R will do the job provided we choose 1/R ∼ ∆m2atm to match the data. In\nthis case, the atmospheric muon neutrinos oscillate into the sterile neutrinos, a possibility\nwhich has its characteristic tests2 . For this solution to work, one needs to assume ξ1 ∼ 1\nso that one gets maximal mixing. This in turn means that, to explain both solar and\natmospheric neutrino data, an almost degeneracy ξ1 ∼ ξ2 must be maintained. This alters\nour explanation of the solar neutrino deficit since, now, these new contribution to it (see\nthe O(ξ 2) terms in Eq. (28)), become more and more important and in fact of order one,\nmaking it hard to understand the solar neutrino deficit, since c(z) ∼ 1. We will, therefore,\nconsider this case as an unfavorable one for understanding the neutrino puzzles.\nCase (ii): Uμ3 6= 0\nTurning to the case where Uμ3 6= 0, if we keep ξ1,2 ≪ 1 (to maintain our understanding\n2\nof the solar neutrino data) then, the corrections of order ξ1,2\nto the transition probability\nbecome almost negligible and the dominant contribution to Pab then must come from ξ3\ncorrections. This yields\nL\nPab ≈ (δab − Ua3 Ub3 ) − 4(Ua1 Ub2 ) sin\n∆m221\n4E\n+2Ua3 Ub3 (δab − Ua3 Ub3 ) c3 (z) + (Ua3 Ub3 )2 p33 .\n2\n\n2\n\n2\n\n\u0012\n\n\u0013\n\n(33)\n\nNotice that p33 in the last equation has the same form as Eq. (12), and the function c3 is\nthe one defined above with the same sharp behaviour as p33 . Then specializing Eq. (33) to\nthe νμ in the atmospheric case, we get\n\u0010\n\n2\nPμμ ≈ 1 − Uμ3\n\n\u00112\n\n2\n2\n4\n+ 2Uμ3\n(1 − Uμ3\n) c3 (z) + Uμ3\np33 .\n\n(34)\n\nFrom our naive analysis in the previous section we may expect that this equation can account\nfor the atmospheric data without too much trouble as long as ξ32 /R ∼ 10−2 eV or so to\n2 We\n\nrealize that from an experimental point of view, this looks less likely to be realized in\nnature [16]; we take a somewhat liberal view of the situation and still contemplate this as a viable\npossibility.\n\n12\n\n\fmake the width of the slope larger than the experimental parameters and to avoid the over\nwashing of the νμ flux. Indeed, it has been checked numerically in reference [11] that the\n2\natmospheric neutrino data can be fitted in this case if Uμ3\n≈ 0.4 and ξ32 /R ∼ 0.02 eV . It is\nworth mentioning that a mixed explanation could be also possible, where the three towers\ncontribute equally to provide atmospheric oscillations, but we will not discuss this case here.\nAn important point to note however is that due to the features of the function c3 (z), the\natmospheric neutrino data will not exhibit the oscillatory behaviour that one would expect\nin the conventional two neutrino models.\nLets turn now to LSND results. By taking that Ue3 ∼ 0 as suggested by solar neutrino\nP\nand reactor data [15], the transition probability reduces to Pμe = α,β=1,2 Uμα Ueα Uμβ Ueβ pαβ .\nThis reflects the fact that the same argument that suppresses the contribution of the third\nKK tower to Pee also does the same for Pμe . As Ue3 = 0 remove the contributions of the\nthird tower, we may expand Pμe to the lowest order by the same expression (26) used in the\nprevious case, which is now given as\nPμe ≈ sin2 2θμe\n\n\u0010\n\n∆m2sol R2\n\n\u00112\n\nI(z)\n\n(35)\n\nwhere now sin2 2θμe = 4(Uμ2 Ue2 )2 , and I(z) as given in Eq. (27). This resembles our former\nexpression in (29). In order to estimate the magnitude of this contribution, note that the\natmospheric neutrino fitting requires ξ32/R ∼ 10−2 eV. For ξ32 ∼ 1 − 10, this implies that\nR2 ∼ 104 −106 eV−2 . Thus if ∆m2sol corresponds to the MSW solution (large or small angle),\nthen ∆m2sol R2 ≃ 1 and one obtains Pμe = sin2 2θμe I(z). From Fig. 7, we see again that for\nrelevant values of R and L/E, the function I(z) takes very small values (∼ 10−4 ), making\nthe Peμ very small.\nNotice that this argument is independent of the way we get the atmospheric deficit. We\ncould also imagine, for instance, that a small value of Ue3 is allowed, and then calculate\nthe leading correction to the above expression. However, it turns out to be of the form\nP\n2\n(Uμ3 Ue3 ) α=1,2 Uμα Ueα ξα2 (c(z) − π6 ), where last term between parenthesis is already smaller\nthan 10−4 by itself.\nC. Case III: ξ1 ≪ 1 ≤ ξ2,3\n\nIn this case, the transition probability can be written as\nPab = (Ua1 Ub1 )2 p11 + 2Ua1 Ub1\n\nX\n\nUaα Ubα pα1 +\n\nα=2,3\n\nX\n\nUaα Ubα Ubβ Uaβ pαβ .\n\n(36)\n\nα,β=2,3\n\nThe simplest possibility is to let the first term in above equation is be responsible for solar\nneutrino oscillations into bulk neutrinos as explained by Eq. (9) [10]. This requires that the\nradius be fixed to be about 1/R ∼ 10−3 eV . In this case, to keep the νe from mixing too\nmuch with the other neutrinos and generate further reduction of the survival probability for\nthe solar neutrino, we choose Ue1 ∼ 1. This essentially decouples the first tower from the\nothers. As a simple approximation, if we assume that Ue,2,3 = 0, then clearly this suppresses\nthe oscillations from νμ into νe , making it difficult to understand the LSND results.\nMoreover, in this scenario, even the explanation for atmospheric data seems to run into\nsome trouble. As Ue1 ∼ 1, it is not unreasonable to conclude based on orthogonality that\nUμ1 ∼ 0. This implies that\n13\n\n\fPμμ =\n\nX\n\n(Uμα Uμβ )2 pαβ ,\n\n(37)\n\nα,β=2,3\n\nwhere all pαβ are given as in Eq. (24). As a rough approximation, if we assume that\nthe partial transition probabilities are all almost of the same order (as they seem to be\nnumerically), say p33 , and use orthogonality once more to get Pμμ ≈ p33 . Therefore, we\nget maximal contribution from the large deficit generated by p33 . A hierarchical pαβ will\nnot help with this, since either we get equal mixing among them or one of them has a\ndominant contribution. In any case, the leading order will combine both things, a large and\nfast developing slope, and a large mixing angle. Nevertheless, based on the results of [11],\nwhere they found some scenarios where those two ingredients come together (although for\nsmall ξ), it is still hard to rule out the scenario without a careful numerical analysis of the\ndata. In any case, the simplest requirement to get a deficit not too large compared with the\n2\nexperimental data, imposes a tuning of the main parameters ξ2,3\n/R ∼ 10−2 , which combined\n2\nwith the condition for R to understand the solar neutrino data fixes ξ2,3\n∼ 10.\nIn order to understand the LSND results, we must allow for small Ue2 and/or Uμ1 . Since,\nin the present scenario, the solar neutrino deficit is being explained purely by oscillation\ninto the bulk, so, we get the following picture: The first tower contributions are too small\nfor LSND, they are even smaller than the size of those considered on the previous cases,\nwhile the oscillations involving the other towers are mainly destructive due to large values\nof ξ involved. The conversion will not occur but for a small contribution related with the\nsmall part of those towers contained in νe . However, as one may suspect, the contributions\nare all proportional to the mixing angles (Uμα Ueα )2 , which can not be larger than 10−2 . So,\nthe question is whether the behaviour of pαβ can help. To analyze this point we notice that\nPμe ≈\n\nX\n\nα,β=2,3\n\nUμα Ueα Ueβ Uμβ (1 − pαβ ).\n\n(38)\n\nNote that one can estimate the value of (1 − pαβ ) from the the information on atmospheric\nneutrino deficit as follows. First point is that all pαβ 's are of same order and therefore,\none can write the Pμe ≈ (Uμ1 Ue1 )2 (1 − Psurv ), where Psurv (ζ) is the same function which\nfor ζ = ζatmos gives the survival probability of muon neutrinos in the atmospheric data.\nThus, Psurv (ζatm ) ≈ 0.5. The value of ζ corresponding to the LSND case is however much\nsmaller due to smaller oscillation distance; therefore to estimate Pμe we must use the value\nof ζ which is much smaller and find the corresponding Psurv . A numerical evaluation gives\n(1 − Psurv ) ∼ 10−2 . The next question is how large the mixing parameters are. In order\nnot to make Pee in atmospheric neutrino data different from one, Uμ2 must be much smaller\nthan 1. On the other hand to fit LSND observations, we need to have Uμ1 ∼ 0.5. It therefore\nappears difficult to accommodate the LSND observations in this case.\nIV. CONCLUDING REMARKS\n\nThe analysis of the present paper shows that in minimal models for neutrino masses in\ntheories with large extra dimensions, it is not possible to get a simultaneous explanation of\ngross overall oscillations needed to understand the solar, atmospheric and the LSND data.\nFitting the overall deficit in the atmospheric and solar neutrino data for various ranges of\n14\n\n\fthe input parameters, the largest conversion probability, Pμe , that we find, is around 10−4 .\nThis is too low to explain the LSND observations. One must therefore invoke new physics\nbeyond the standard model in the brane [8,17] or new physics outside the brane [14] for a\nsimultaneous understanding of all observed neutrino data.\nThe oscillation pattern is governed by the dimensionless parameters ξα . Three of them\narise in the models under consideration and we get the following picture:\n(i) ξ1,2,3 ≪ 1: in this case, solar and atmospheric neutrino data are understood as in the\ncase of four dimensional models and the hope that the presence of the bulk neutrinos\nwith an appropriate KK excitation scale could provide an understanding of the LSND\ndata is not realized.\n(ii) ξ1,2 ≪ 1 ≤ ξ3 : solar neutrino data is provided as in the four dimensional models but\natmospheric data is explained by νμ to νbulk oscillation onceqthe appropriate values of\nthe bulk radius is chosen i.e. either ξ1 ≈ ξ2 and 1/R ∼ ∆m2atm or ξ32 /R ∼ 10−2 .\nIn this case, the atmospheric neutrino flux does not oscillate as a function of L/E, a\nfeature distinct from the conventional two neutrino oscillation picture.\n(iii) ξ1 ≪ 1 ≤ ξ2,3 . Both, solar and atmospheric data are explained by ν → νbulk oscilla2\ntions. Therefore 1/R2 ∼ ∆m2sol ∼ 10−3 eV with matter effects for solar and ξ2,3\n∼ 10.\nAgain, the L/E behaviour of the atmospheric flux is not oscillatory.\n(iv) ξ1,2,3 ≫ 1. There is no explanation for solar neutrino data in this case. This parameter\nrange is therefore ruled out.\nAcknowledgements. The work of RNM is supported by a grant from the National Science\nFoundation under grant number PHY-9802551. The work of APL is supported in part by\nCONACyT (México).\n\n15\n\n\fREFERENCES\n[1] I. Antoniadis, Phys. Lett. B246 (1990) 377; I. Antoniadis, K. Benakli and M. Quirós,\nPhys. Lett. B331 (1994) 313; P. Horava and E. Witten, Nucl. Phys. B460 (1996) 506;\nidem B475(1996) 94; J. Lykken, Phys. Rev. D 54 (1996) 3693. K.R. Dienes, E. Dudas\nand T. Gherghetta, Nucl. Phys. B436 (1998) 55; N. Arkani-Hamed, S. Dimopoulos\nand G. Dvali, Phys. Lett. B429 (1998) 263; Phys. Rev. D 59 (1999) 086004; I. Antoniadis, S. Dimopoulos and G. Dvali, Nucl. Phys. B516 (1998) 70; N. Arkani-Hamed, S.\nDimopoulos and J. March-Russell, hep-th/9809124.\n[2] For early proposals see: V. A. Rubakov and M. E. Shaposhnikov, Phys. Lett. B152\n(1983) 136; K. Akama, in Lecture Notes in Physics, 176, Gauge Theory and Gravitation, Proceedings of the International Symposium on Gauge Theory and Gravitation,\nNara, Japan, August 20-24, 1982, edited by K. Kikkawa, N. Nakanishi and H. Nariai,\n(Springer-Verlag, 1983), 267; M. Visser, Phys. Lett B159 (1985) 22; E.J. Squires, Phys.\nLett B167 (1986) 286; G.W. Gibbons and D.L. Wiltshire, Nucl. Phys. B287 (1987)\n717.\n[3] M. Gell-Mann, P. Ramond and R. Slansky, in Supergravity, eds. P. van Niewenhuizen\nand D.Z. Freedman (North Holland 1979); T. Yanagida, in Proceedings of Workshop on\nUnified Theory and Baryon number in the Universe, eds. O. Sawada and A. Sugamoto\n(KEK 1979); R. N. Mohapatra and G. Senjanović, Phys. Rev. Lett. 44, 912 (1980).\n[4] N. Arkani-Hamed and M. Schmaltz, Phys. Rev. D 61 (2000) 033005.\n[5] E. Witten, Invited talk at the Neutrino2000 Conference, Sudbury, Canada (June, 2000).\n[6] K.R. Dienes, E. Dudas and T. Gherghetta, Nucl. Phys. B557 (1999) 25; N. ArkaniHamed, S. Dimopoulos, G. Dvali and J. March-Russell, hep-ph/9811448.\n[7] R. N. Mohapatra, S. Nandi and A. Pérez-Lorenzana, Phys. Lett B466 (1999) 115.\n[8] R. N. Mohapatra and A. Pérez-Lorenzana, Nucl. Phys. B576 (2000) 466.\n[9] C. Burgess, L. Ibanez and F. Quevedo, Phys. Lett. B447 (1999) 257.\n[10] G. Dvali and A.Yu. Smirnov, Nucl. Phys. B563 (1999) 63.\n[11] R. Barbieri, P. Creminelli and A. Strumia, hep-ph/0002199.\n[12] A. Faraggi and M. Pospelov, Phys. Lett. B458 (1999) 237; G. C. McLaughlin, J. N.\nNg, Phys. Lett. B470 (1999) 157; nucl-th/0003023. A. Ioannisian, A. Pilaftsis, hepph/9907522.\n[13] A. Das and O. C. W. Kong, Phys. Lett. B470 (1999) 149; Y. Grossman and M. Neubert,\nPhys. Lett. B474 (2000) 361; A. Lukas and A. Romanino, hep-ph/0004130; E. Ma, M.\nRaidal and U. Sarkar, hep-ph/0006046.\n[14] A. Ioannissian and J. W. F Valle, hep-ph/9911349.\n[15] CHOOZ collaboration, M. Apollonio et al., Phys. Lett. B466 (1999) 415; Palo Verde\ncollaboration, F. Boehm et al., hep-ex/0003022.\n[16] See the invited talk by T. Kajita, Neutrino2000 conference, Sudbury, Canada (2000).\n[17] D. Caldwell, R. N. Mohapatra and S. Yellin, to appear.\n\n16\n\n\fFIGURES\n0.5\n\n[ \u0014\u0013\n\nOn- n\n\n0.4\n\n0.3\n\n[ \u0018\n[ \u0016\n\n0.2\n\n0.1\n\n[ \u0014\n[ \u0013\u0011\u0014\n\n0.0\n0\n\n20\n\n40\n\nn\n\n60\n\n80\n\n100\n\nFIG. 1. Eigenvalues λn as calculated from Eq. (4) for various values of ξ. For comparison with\nthe low ξ limit discussed in the main text we show the deviation from the integer numbers. This\npicture depict how for large ξ the eigenvalues get shifted close to semi-integer numbers. Notice\nalso that for small ξ; λ0 is clearly the only non integer eigenvalue.\n\n1.0\n\n[ \u0014\u0013\n0.8\n\n[ \u0018\n\n1/N n\n\n0.6\n\n[ \u0016\n\n0.4\n\n[ \u0014\n\n0.2\n\n[ \u0013\u0011\u0014\n0.0\n0\n\n20\n\n40\n\nn\n\n60\n\n80\n\n100\n\nFIG. 2. Mixing factors for the expansion (7) for different values of the parameter ξ. To\nmake the effect for large ξ visible we have introduced an arbitrary normalization where N0 = 1.\nThis amplifies the value of 1/Nn by a constant scaling. Of course, the real values satisfy the\nnormalization condition. This figure shows how, for large ξ, the effective number of KK mass\neigenmodes contributing into the weak eigenstate νL gets larger and those modes become almost\nequally suppressed, while for small ξ the lightest mode (n = 0) become the main component, with\nthe decoupling of all other modes.\n\n17\n\n\f1\n\n[ \u0013\u0011\u0014\n\nPQ7Q\n\n0.8\n\n0.6\n\n[ \u0014\n\n0.4\n\n0.2\n\n[ \u0016\n0\n0\n\n1\n\n2\n\n3\n\nL / 2ER\n\n4\n\n5\n\n6\n\n2\n\nFIG. 3. Exact survival probability for νL versus L/2E in units of R2 (as it is explicit in\nthe argument) for three different values of ξ. Dotted lines represent the continuos approximation\ndiscused in the main text. Note that only the low ξ limit has a periodic behaviour.\n\n1\n0.99\n\nPQ7Q\n\n0.98\n0.97\n0.96\n0.95\n0.94\n0\n\n1\n\n2\n\n3\n\nL / 2ER\n\n4\n\n5\n\n6\n\n2\n\nFIG. 4. Here we show an amplification of the survival probability for the ξ = 0.1 case showed\nin figure 3. Note the large number of wiggles produced by the oscillation of consecutive levels in\nEq. (9). We also depict the continuos limit (dotted line) for comparison.\n\n18\n\n\f1\n0.8\n0.6\n\nP surv\n\n-\n\n0.4\n0.2\n0\n\nU\n-0.2\n-0.4\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n]\n\nFIG. 5. In this figure we plot the functions ρ(ζ) and θ(ζ) that describe the slope of the survival\nprobability Psurv (which we also show) in the continuos limit where ξ ≥ 1. The argument is the\np\ndimensionless parameter ζ = (πξ 2 /2R) L/2E defined in the main text.\n\n1\n\nLSN\n\n0.8\n\nD\n\nCHO\n\nOZ\n\nP surv\n\n0.6\n\nAT\nM\n\n0.4\n\n0.2\n\n0\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n[\n\nFIG. 6.\nDependance of the survival probability as a function of ξ for the characteristic\nexperimental values of L/4E, with R = 0.2 mm.\n\n19\n\n\f1\n0.002\n0.0015\n\n0.8\n\n0.001\n0.0005\n\n0.6\n\nI (R)\n\n0\n50\n\n75\n\n100\n\n0.4\n\n0.2\n\n0\n0\n\n20\n\n40\n\n-1\n\n60\n\n80\n\n100\n\nR (eV )\n\nFIG. 7. The function I(R) versus R for the experimental ratio L/2E as in LSND. The window\non the upper right shows an amplification of the region for large R, where I(R) ≤ 10−3 .\n\n20\n\n\f"}