{"id": "http://arxiv.org/abs/hep-th/0612068v1", "guidislink": true, "updated": "2006-12-08T01:09:27Z", "updated_parsed": [2006, 12, 8, 1, 9, 27, 4, 342, 0], "published": "2006-12-08T01:09:27Z", "published_parsed": [2006, 12, 8, 1, 9, 27, 4, 342, 0], "title": "Higher-dimensional AdS waves and pp-waves with conformally related\n  sources", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0612304%2Chep-th%2F0612279%2Chep-th%2F0612128%2Chep-th%2F0612305%2Chep-th%2F0612202%2Chep-th%2F0612088%2Chep-th%2F0612049%2Chep-th%2F0612237%2Chep-th%2F0612139%2Chep-th%2F0612100%2Chep-th%2F0612293%2Chep-th%2F0612048%2Chep-th%2F0612271%2Chep-th%2F0612127%2Chep-th%2F0612005%2Chep-th%2F0612308%2Chep-th%2F0612195%2Chep-th%2F0612175%2Chep-th%2F0612182%2Chep-th%2F0612251%2Chep-th%2F0612265%2Chep-th%2F0612167%2Chep-th%2F0612020%2Chep-th%2F0612104%2Chep-th%2F0612193%2Chep-th%2F0612168%2Chep-th%2F0612112%2Chep-th%2F0612164%2Chep-th%2F0612113%2Chep-th%2F0612030%2Chep-th%2F0612072%2Chep-th%2F0612115%2Chep-th%2F0612204%2Chep-th%2F0612187%2Chep-th%2F0612017%2Chep-th%2F0612107%2Chep-th%2F0612300%2Chep-th%2F0612058%2Chep-th%2F0612280%2Chep-th%2F0612051%2Chep-th%2F0612082%2Chep-th%2F0612160%2Chep-th%2F0612152%2Chep-th%2F0612295%2Chep-th%2F0612299%2Chep-th%2F0612022%2Chep-th%2F0612309%2Chep-th%2F0612306%2Chep-th%2F0612042%2Chep-th%2F0612033%2Chep-th%2F0612258%2Chep-th%2F0612267%2Chep-th%2F0612052%2Chep-th%2F0612083%2Chep-th%2F0612053%2Chep-th%2F0612211%2Chep-th%2F0612203%2Chep-th%2F0612144%2Chep-th%2F0612273%2Chep-th%2F0612068%2Chep-th%2F0612235%2Chep-th%2F0612207%2Chep-th%2F0612134%2Chep-th%2F0612220%2Chep-th%2F0612123%2Chep-th%2F0612077%2Chep-th%2F0612102%2Chep-th%2F0612021%2Chep-th%2F0612289%2Chep-th%2F0612143%2Chep-th%2F0612044%2Chep-th%2F0612210%2Chep-th%2F0612180%2Chep-th%2F0612249%2Chep-th%2F0612242%2Chep-th%2F0612225%2Chep-th%2F0612016%2Chep-th%2F0612133%2Chep-th%2F0612264%2Chep-th%2F0612125%2Chep-th%2F0612222%2Chep-th%2F0612206%2Chep-th%2F0612025%2Chep-th%2F0612186%2Chep-th%2F0612131%2Chep-th%2F0612028%2Chep-th%2F0612234%2Chep-th%2F0612282%2Chep-th%2F0612157%2Chep-th%2F0612062%2Chep-th%2F0612056%2Chep-th%2F0612129%2Chep-th%2F0612239%2Chep-th%2F0612050%2Chep-th%2F0612096%2Chep-th%2F0612035%2Chep-th%2F0612163%2Chep-th%2F0612191%2Chep-th%2F0612291%2Chep-th%2F0612146%2Chep-th%2F0612290&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Higher-dimensional AdS waves and pp-waves with conformally related\n  sources"}, "summary": "AdS waves and pp-waves can only be supported by pure radiation fields, for\nwhich the only nonvanishing component of the energy-momentum tensor is the\nenergy density along the retarded time. We show that the nonminimal coupling of\nself-gravitating scalar fields to the higher-dimensional versions of these\nexact gravitational waves can be done consistently. In both cases, the\nresulting pure radiation constraints completely fix the scalar field dependence\nand the form of the allowed self-interactions. More significantly, we establish\nthat the two sets of pure radiation constraints are conformally related for any\nnonminimal coupling, in spite of the fact that the involved gravitational\nfields are not necessarily related. In this correspondence, the potential\nsupporting the AdS waves emerges from the self-interaction associated to the\npp-waves and a self-dual condition naturally satisfied by the pp-wave scalar\nfields.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0612304%2Chep-th%2F0612279%2Chep-th%2F0612128%2Chep-th%2F0612305%2Chep-th%2F0612202%2Chep-th%2F0612088%2Chep-th%2F0612049%2Chep-th%2F0612237%2Chep-th%2F0612139%2Chep-th%2F0612100%2Chep-th%2F0612293%2Chep-th%2F0612048%2Chep-th%2F0612271%2Chep-th%2F0612127%2Chep-th%2F0612005%2Chep-th%2F0612308%2Chep-th%2F0612195%2Chep-th%2F0612175%2Chep-th%2F0612182%2Chep-th%2F0612251%2Chep-th%2F0612265%2Chep-th%2F0612167%2Chep-th%2F0612020%2Chep-th%2F0612104%2Chep-th%2F0612193%2Chep-th%2F0612168%2Chep-th%2F0612112%2Chep-th%2F0612164%2Chep-th%2F0612113%2Chep-th%2F0612030%2Chep-th%2F0612072%2Chep-th%2F0612115%2Chep-th%2F0612204%2Chep-th%2F0612187%2Chep-th%2F0612017%2Chep-th%2F0612107%2Chep-th%2F0612300%2Chep-th%2F0612058%2Chep-th%2F0612280%2Chep-th%2F0612051%2Chep-th%2F0612082%2Chep-th%2F0612160%2Chep-th%2F0612152%2Chep-th%2F0612295%2Chep-th%2F0612299%2Chep-th%2F0612022%2Chep-th%2F0612309%2Chep-th%2F0612306%2Chep-th%2F0612042%2Chep-th%2F0612033%2Chep-th%2F0612258%2Chep-th%2F0612267%2Chep-th%2F0612052%2Chep-th%2F0612083%2Chep-th%2F0612053%2Chep-th%2F0612211%2Chep-th%2F0612203%2Chep-th%2F0612144%2Chep-th%2F0612273%2Chep-th%2F0612068%2Chep-th%2F0612235%2Chep-th%2F0612207%2Chep-th%2F0612134%2Chep-th%2F0612220%2Chep-th%2F0612123%2Chep-th%2F0612077%2Chep-th%2F0612102%2Chep-th%2F0612021%2Chep-th%2F0612289%2Chep-th%2F0612143%2Chep-th%2F0612044%2Chep-th%2F0612210%2Chep-th%2F0612180%2Chep-th%2F0612249%2Chep-th%2F0612242%2Chep-th%2F0612225%2Chep-th%2F0612016%2Chep-th%2F0612133%2Chep-th%2F0612264%2Chep-th%2F0612125%2Chep-th%2F0612222%2Chep-th%2F0612206%2Chep-th%2F0612025%2Chep-th%2F0612186%2Chep-th%2F0612131%2Chep-th%2F0612028%2Chep-th%2F0612234%2Chep-th%2F0612282%2Chep-th%2F0612157%2Chep-th%2F0612062%2Chep-th%2F0612056%2Chep-th%2F0612129%2Chep-th%2F0612239%2Chep-th%2F0612050%2Chep-th%2F0612096%2Chep-th%2F0612035%2Chep-th%2F0612163%2Chep-th%2F0612191%2Chep-th%2F0612291%2Chep-th%2F0612146%2Chep-th%2F0612290&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "AdS waves and pp-waves can only be supported by pure radiation fields, for\nwhich the only nonvanishing component of the energy-momentum tensor is the\nenergy density along the retarded time. We show that the nonminimal coupling of\nself-gravitating scalar fields to the higher-dimensional versions of these\nexact gravitational waves can be done consistently. In both cases, the\nresulting pure radiation constraints completely fix the scalar field dependence\nand the form of the allowed self-interactions. More significantly, we establish\nthat the two sets of pure radiation constraints are conformally related for any\nnonminimal coupling, in spite of the fact that the involved gravitational\nfields are not necessarily related. In this correspondence, the potential\nsupporting the AdS waves emerges from the self-interaction associated to the\npp-waves and a self-dual condition naturally satisfied by the pp-wave scalar\nfields."}, "authors": ["Eloy Ayón-Beato", "Mokhtar Hassaïne"], "author_detail": {"name": "Mokhtar Hassaïne"}, "author": "Mokhtar Hassaïne", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.75.064025", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0612068v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0612068v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0612068v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0612068v1", "journal_reference": "Phys.Rev.D75:064025,2007", "doi": "10.1103/PhysRevD.75.064025", "fulltext": "CECS-PHY-06/26\nhep-th/0612068\n\nHigher-dimensional AdS waves and pp-waves with conformally\nrelated sources\nEloy Ayón-Beato1, 2, ∗ and Mokhtar Hassaı̈ne3, 1, †\n1 Centro\n\narXiv:hep-th/0612068v1 8 Dec 2006\n\nde Estudios Cientı́ficos (CECS), Casilla 1469, Valdivia, Chile.\n2 Departamento de Fı́sica, CINVESTAV–IPN,\nApdo. Postal 14–740, 07000, México D.F., México.\n3 Instituto de Matemática y Fı́sica, Universidad de Talca, Casilla 747, Talca, Chile.\nAdS waves and pp-waves can only be supported by pure radiation fields, for which\nthe only nonvanishing component of the energy-momentum tensor is the energy\ndensity along the retarded time. We show that the nonminimal coupling of selfgravitating scalar fields to the higher-dimensional versions of these exact gravitational waves can be done consistently. In both cases, the resulting pure radiation\nconstraints completely fix the scalar field dependence and the form of the allowed\nself-interactions. More significantly, we establish that the two sets of pure radiation constraints are conformally related for any nonminimal coupling, in spite of the\nfact that the involved gravitational fields are not necessarily related. In this correspondence, the potential supporting the AdS waves emerges from the self-interaction\nassociated to the pp-waves and a self-dual condition naturally satisfied by the ppwave scalar fields.\nPACS numbers: 04.50.+h, 04.30.Db\n\nI.\n\nINTRODUCTION\n\nIn the current literature, there exists a wide class of examples for which the use of\nconformal symmetries or techniques has been useful to understand and to solve very specific\nproblems. For example, conformal transformations of metrics can be used as a mathematical\ntool to map the equations of motion of physical systems into equivalently equations that are\nmore simple to analyze. From the physical perspective this transformation entails a change\nof frame, and in diverse contexts some quantities only acquire a clear physical interpretation\nin definite frames. In this spirit, the derivation of the Bekenstein black hole provided an\ninteresting illustration [1]. Certainly, in this case the mapping has been operated between a\nconformal scalar field and a minimally coupled one, and has permitted to generate a black\nhole solution for the conformal theory from the singular solution of the minimal scalar field\ntheory. It is also natural to ask wether spacetime metrics which are conformally related\nmay share some properties, beyond those generated from their common causal structure for\nregular conformal factors. For example, in arbitrary dimension D the Siklos spacetimes [2],\nwhich are exact gravitational waves traveling along AdSD [3],1 can be defined as a conformal\n∗\n\nElectronic address: ayon-at-cecs.cl\nElectronic address: hassaine-at-inst.mat.utalca.cl\n1\nSee Refs. [4, 5, 6, 7] for the pioneering works studying the propagation of exact gravitational waves in\npresence of a cosmological constant, for a review on this subject see Ref. [8].\n\n†\n\n\f2\ntransformation of a pp-wave background in the following way\nds2 =\n\n\u0003\nl2 \u0002\ni\n2\n2\ni\nj\n−F\n(u,\ny,\nx\n)du\n−\n2dudv\n+\ndy\n+\nδ\ndx\ndx\n,\nij\ny2\n\n(1)\n\nwhere i = 1, . . . , D − 3. In this case, the Einstein tensor of the above AdS wave metric\nGαβ and the one associated with the pp-wave metric inside of the square bracket, which we\ndenote by Ḡαβ , satisfy\nGαβ + Λgαβ ∝ kα kβ ,\n\nḠαβ ∝ kα kβ ,\n\n(2)\n\nwhere k μ ∂μ = ∂v is a common null Killing vector and Λ = −(D − 2)(D − 1)/(2l2 ). These\nproperties (2) imply interesting consequences if one considers the coupling of matter sources\nto these gravitational waves. Indeed, in both cases they indicate that the waves can only\nbe supported by sources behaving as pure radiation fields [9], i.e. configurations for which\nall the components of the energy-momentum tensor vanish except the energy density along\nthe retarded time u. For a generic matter field this condition imposes the fulfillment of\npure radiations constraints, consisting in demanding the vanishing of all the components\nof the energy-momentum tensor except the quoted energy density. These conditions are\nstrong requirements on the possible choices of matter sources to consider. Recently, we have\nbeen concerned by this problem in three dimensions as we were interested on the generation\nof exact gravitational waves propagating on flat space [10, 11, 12, 13] and AdS space [14],\nrespectively. We have shown that self-gravitating scalar fields nonminimally coupled to these\ngravitational waves do not yield to inconsistencies, instead the pure radiations constraints\nhave nontrivial solutions in these cases characterized by various interesting properties due\nto this particular coupling [14]. Among these curiosities, we have shown that the threedimensional scalar source supporting an AdS wave [14] and the one compatible with the\npp-wave [12] are conformally related in spite of the fact that their involved backgrounds are\nnot necessarily related. In other words, this means that in both situations, the source is\nindependent of the structural metric function F of Eq. (1), and in some sense is only sensitive\nto the general form of the spacetime metric. At our opinion, it seems interesting to explore\nwether the analysis performed in three dimensions is only due to the simplicity of 2 + 1\ngravity, or it is generic to any dimension. The main purpose of this paper is to carry out the\ncorrespondence mentioned above to higher dimensions by establishing a conformal mapping\nbetween the pure radiation constraints determining the scalar sources in each gravitational\nwave background.\nThe organization of the paper is the following. We first consider the problem of scalar\nfields nonminimally coupled to a pp-wave background in arbitrary dimension. The resulting\npure radiation constraints are solved in full generality and it is shown that their integration\nfixes uniquely the matter source without the explicit knowledge of the structural metric\nfunction. In particular, there exists a unique self-interaction, depending on a single coupling\nconstant, allowing the scalar field to act as a source of the pp-wave. In the third section,\nwe reproduce the same analysis in the context of scalar fields nonminimally coupled to AdS\nwaves. The pure radiation constraints are again integrable and the AdS wave scalar source\nis completely determined. In this case, the process singles out a unique self-interaction\npotential depending on two coupling constants. In the fourth section of the paper, we\nestablish a conformal correspondence between the pure radiation constraints of both systems\nassuming the scalar fields of both backgrounds are conformally related. In other words, this\nmeans that starting from a pp-wave scalar field configuration one is able to generate the\n\n\f3\nscalar field configuration supporting the AdS wave. In this correspondence, we emphasize\nthe problem of the mismatching of the coupling constants of the potentials, problem which\nis only specific to higher dimensions. We provide a recipe which permits to obtain the exact\npotential supporting the AdS wave, with its two coupling constants, starting from the ppwave one with its single coupling constant. In the last section, we summarize our results\nand leave some open questions related to this work. Two Appendixes are included at the\nend where the detailed higher-dimensional field equations on each background are explicitly\nwritten.\nII.\n\nPP -WAVES SUPPORTED BY NONMINIMALLY COUPLED SCALAR\nFIELDS\n\nIn this first part, we are concerned with scalar field nonminimally coupled to a pp-wave\nbackground in D dimensions defined by the line element\nds̄2 = −F̄ (u, xî )du2 − 2dudv + δîĵ dxî dxĵ ,\n\n= −F̄ (u, y, xi )du2 − 2dudv + dy 2 + δij dxi dxj ,\n\n(3)\n\nwhere the plane wave-fronts of the gravitational wave have coordinates xî = (y, xi ) with\ni = 1, . . . , D − 3, and its parallel rays are described by the null covariantly constant field\nk μ ∂μ = ∂v . The action we are concerned with is given by\n\u0012\n\u0013\nZ\n1\n1 αβ\n1\nD √\n2\nS̄(ḡαβ , Φ̄) = d x −ḡ\nR̄ − ḡ ∇α Φ̄∇β Φ̄ − ξ R̄ Φ̄ − Ū(Φ̄) ,\n(4)\n2κ\n2\n2\nwhere ξ is the parameter characterizing the nonminimal coupling to gravity of the scalar field\nΦ̄, whose self-interaction potential is described by Ū (Φ̄). For later convenience we have used\nthe convention that all the bared quantities are those relatives to the pp-wave background.\nThe field equations obtained by varying the action with respect to the metric and the scalar\nfield read\nḠαβ = κT̄αβ ,\n(5)\nand\n\n ̄ Φ̄ = ξ R̄ Φ̄ + dŪ (Φ̄) ,\n\u0003\ndΦ̄\nrespectively, where the energy-momentum tensor is given by\n\u0013\n\u0012\n\u0001\n1 μν\n ̄ α∇\n ̄ β + Ḡαβ Φ̄2 .\n ̄ −∇\nḡ ∇μ Φ̄∇ν Φ̄ + Ū (Φ̄) + ξ ḡαβ \u0003\nT̄αβ = ∇α Φ̄∇β Φ̄ − ḡαβ\n2\n\n(6)\n\n(7)\n\nIn order to study these configurations we assume that the null Killing field k μ ∂μ = ∂v is also\na symmetry of the scalar field, i.e. Φ̄ = Φ̄(u, xî ). The independent Einstein equations on the\npp-wave background are given in Appendix A. As it was stressed in the introduction, the\nstructure of the Einstein tensor for the geometry (3) is sketched as\nḠαβ ∝ kα kβ ,\n\n(8)\n\nwhich in the coordinates adapted to k μ means that the only nonvanishing component of the\nEinstein tensor is the one along the retarded time Ḡuu . Hence, all the components of the\n\n\f4\nenergy-momentum tensor except Tuu must vanish by virtue of the Einstein equations, and\nthis is interpreted as the scalar field must behave like a pure radiation field [9]. As we shall\nsee below the integration of the resulting pure radiation constraints uniquely determines the\nmatter source. Finally, the remaining independent Einstein equation, i.e. the one along the\ncomponent uu (see Appendix A), allows to derive the structural metric function F̄ in the\nexpression (3).\nThe independent pure radiation constraints are given by the following combinations, as\ncan be noticed from Appendix (A),\nT̄uî = 0,\nT̄îĵ + δîĵ T̄uv = 0,\n\n(9a)\n(9b)\n\nδ îĵ T̄îĵ + (D − 3)T̄uv = 0.\n\n(9c)\n\nAs it also occurs in three dimensions [12], it is useful to make the following redefinition of\nthe scalar field\n1\nΦ̄ = 2ξ/(1−4ξ) ,\n(10)\nσ̄\nwhere we are considered all the possible values of the nonminimal coupling parameter except\nξ = 0 and ξ = 1/4. These two cases can also be studied but their analysis is not essential for\nour main task. Using Eq. (A1) of Appendix A the first two equations (9a) and (9b) reduce\nto\n∂uî σ̄ = 0,\n∂îĵ σ̄ = 0,\n\n(11a)\n(11b)\n\nwhich imply that the general solution is separable in all the coordinates and is additionally\nlinear in the planar coordinates of the wave-front\nσ̄ = k̄î xî + f ̄(u)\n\n(12)\n\nwhere the k̄î are D−2 arbitrary constants and f ̄ is an arbitrary function of the retarded time.\nHence, the integration of the first two pure radiation constraints completely determines the\nscalar field. Inserting the obtained expression into the remaining pure radiation constraint\n(9c), the allowed potential is singled out as\nŪ (Φ̄) =\n\n2ξ 2 λ\nΦ̄(1−2ξ)/ξ ,\n2\n(1 − 4ξ)\n\n(13)\n\nwhere we have defined the coupling constant by\nλ = δ îĵ k̄î k̄ĵ .\n\n(14)\n\nThe emergence of such potential is interesting by itself for various reasons. Firstly, for the\nconformal coupling in D dimensions, ξ = ξD = (D − 2)/[4(D − 1)], the above potential\nreduces to the only potential compatible with the conformal invariance in higher dimensions\nŪ (Φ̄) ∝ Φ̄2D/(D−2) . We stress from now that the potential (13) depends on a single coupling\nconstant λ expressed in terms of the D − 2 integration constants of the scalar field. The\nsolution of the pure radiation constraints also allows the existence of nontrivial free massless\nconfigurations for λ = 0, as it can be noticed from Eqs. (14) and (12). In this case, the\n\n\f5\nfree scalar field depends only and arbitrarily on the retarded time. It is also interesting to\nnotice that for the particular value of the nonminimal parameter ξ = 1/2, the potential (13)\nreduces to a positive constant and hence, the original problem is equivalent to considering\nthe Einstein equations with a positive effective cosmological constant in presence of a free\nnonminimally coupled scalar field.\nFor later convenience, we record that some of the pure radiation constraints (11) can be\nreexpressed compactly in terms of the scalar field and its allowed self-interaction potential\n(13) as\n\n\n∂y Φ̄ \n∂α  q\n\u0001 = 0,\nŪ Φ̄\n\n(15)\n\nwhich in addition empathizes that the expression between the parenthesis is a constant.\nThis condition can be interpreted as a sort of Bogomolnyi self-dual condition for the system.\nIn sum, we have seen that the integration of the pure radiation constraints have completely\ndetermined the matter source. It is interesting to stress that this task have been achieved\nwithout using the structural metric function F̄ . In other words, this means that the matter\nsource is only sensitive to the form of the metric and not to the specific structural metric\nfunction. As we shall see below, this property is also present in the case of AdS waves.\nHence, in order to relate the matter sources of both backgrounds, it is not necessary to\nderive the structural metric functions.\nIII.\n\nADS WAVES SUPPORTED BY NONMINIMALLY COUPLED SCALAR\nFIELDS\n\nIn this section, we are concerned with scalar fields nonminimally coupled to an AdS wave\nds2 =\n\n\u0003\nl2 \u0002\n−F (u, y, xi )du2 − 2dudv + dy 2 + dxi dxi ,\n2\ny\n\n(16)\n\nwhere the wave fronts {u, v = const.} are now hyperboloids with curvature proportional to\n−1/l2 and coordinates xî = (y, xi ), i = 1, . . . , D − 3. The field equations are those arising\nfrom the following action\n\u0013\n\u0012\nZ\n1 αβ\n1\n1\n2\nD √\n(R + 2Λ) − g ∇α Φ∇β Φ − ξR Φ − U(Φ) ,\n(17)\nS = d x −g\n2κ\n2\n2\nwhere Λ = −(D − 2)(D − 1)/(2l2 ) is the negative cosmological constant, ξ is the nonminimal\ncoupling parameter, and U(Φ) is the self-interaction potential. The involved field equations\nare the Einstein and the nonlinear Klein–Gordon equations\nGαβ + Λgαβ = κTαβ ,\ndU(Φ)\n,\ndΦ\nwhere the corresponding energy-momentum tensor is defined by\n\u0013\n\u0012\n1 μν\ng ∇μ Φ∇ν Φ + U(Φ) + ξ (gαβ \u0003 − ∇α ∇β + Gαβ ) Φ2 .\nTαβ = ∇α Φ∇β Φ − gαβ\n2\n\u0003Φ = ξR Φ +\n\n(18)\n(19)\n\n(20)\n\n\f6\nWe now see that the strategy used in the case of the pp-wave background can be exactly\nreproduced here in order to determine the allowed matter source for an AdS wave background. The clue lies in the fact that the Einstein tensor for an AdS wave background has\nthe following structure\nGαβ + Λgαβ ∝ kα kβ ,\n(21)\n\nwith k μ ∂μ = ∂v , which implies that any self-gravitating source supporting the wave in the\npresence of the negative cosmological constant must behave effectively as a pure radiation\nfield [9]. As a consequence, in the coordinates of metric (16) the only component of the\nEinstein equations (18) with a nonvanishing left hand side is the uu one as it occurs in\nthe pp-wave background. The other Einstein equations reduce again to pure radiation\nconstraints.\nWe assume that the null Killing field k μ is also a symmetry of the scalar field which in\nturn implies that the independent field equations on the AdS wave background reduce to\nthe ones given in Appendix B. As before, the pure radiation constraints are expressed as\nTuî = 0,\nTîĵ + Tuv δîĵ = 0,\n\n(22a)\n(22b)\n\nδ îĵ Tîĵ + (D − 3)Tuv = 0.\n\n(22c)\n\nWe now consider the following redefinition for the scalar field\nΦ=\n\n1\nσ 2ξ/(1−4ξ)\n\n,\n\n(23)\n\nwhich presents the advantage that the pure radiation constraints (22a) and (22b), whose\nexplicit form can be found in the Eq. (B1) of Appendix B, are more simple to tackle\n∂y (y∂u σ)\n2\n∂ui\nσ\n\u0001\n2\n∂y y ∂y σ\n∂y (y∂i σ)\n∂ij2 σ\n\n=\n=\n=\n=\n=\n\n0,\n0,\n0,\n0,\n0.\n\n(24a)\n(24b)\n(24c)\n(24d)\n(24e)\n\n\u0003\nl\u0002\nky y + ki xi + f (u) ,\ny\n\n(25)\n\nThe general solution of (24) is given by\nσ(u, y, xi) =\n\nwhere ky and ki are D − 2 integration constants and f is a general function of the retarded\ntime. The remaining pure radiation constraint (22c) is the one that permits to obtain the\nallowed potential. After a tedious but straightforward calculation we conclude that the only\nself-interaction potential allowed by the system is given by\n\u0012\n2ξΦ2\nξλ1 Φ(1−4ξ)/ξ − 8(D − 1)ξ(ξ − ξD )λ2 Φ(1−4ξ)/(2ξ)\nU(Φ) =\n(1 − 4ξ)2\n\u0013\n4D(D − 1)\n(ξ − ξD )(ξ − ξD+1 ) ,\n(26)\n+\nl2\n\n\f7\nwhere ξD = (D − 2)/[4(D − 1)] is the conformal coupling in dimension D and the two\ncoupling constants of the potentials are defined by\nλ1 = ky 2 + δ ij ki kj ,\n\nλ2 =\n\nky\n.\nl\n\n(27)\n\nOnce again, the emergence of such potential is intriguing for various reasons. In contrast with\nthe allowed potential in the pp-wave situation (13), the AdS wave potential (26) depends\non two coupling constants (27). This subtlety is not present in three dimensions\n√ [14] since\nin this case ki = 0, and hence the coupling constants are related, i.e. λ2 = λ1 /l. This\nremark will be of importance in the next section where a correspondence between the two\nconfigurations previously analyzed will be presented. It is also interesting to note that for\nthe conformal value of the nonminimal coupling parameter, ξ = ξD , the expression (26)\nalso reduces to the conformally invariant potential as it occurs in the pp-wave case. In fact,\nat the vanishing cosmological constant limit (l → ∞), we recover the potential permitted\nby the pp-wave background (13). Finally, we also mention that this potential is exactly\nthe one arising in the context of scalar fields nonminimally coupled to special geometries\nwithout inducing backreaction (the static BTZ black hole [15, 16], flat space [17, 18], and\nthe generalized (A)dS spacetimes [19]). All these examples share a common feature, namely\nthe existence of nontrivial solutions with a vanishing energy-momentum tensor called stealth\nconfigurations.\nIV.\n\nTHE CORRESPONDENCE\n\nIn this section, we establish a correspondence between the two sets of pure radiations\nconstraints previously studied. The existence of a map between the involved sources was\nfirst noticed in three dimension [14]. Here, we prove that this equivalence is not a mere\nconsequence of the apparent simplicity of 2 + 1 gravity and in fact, it can be extended\nto higher dimensions. In a more precise set-up, assuming a conformal relation between the\nscalar fields generating the two gravitational waves, we first put in relation the pure radiation\nconstraints that determine the scalar field solution in both systems. The remaining pure\nradiation constraint is the one that fixes the allowed potential of each system. The relation\nbetween these last two constraints is studied in the second part because of the subtlety due\nto the mismatching of the coupling constants of both potentials.\nThe functional expressions for both scalar fields, on the one hand Eqs. (10) and (12),\nand on the other hand Eqs. (23) and (25), suggest to consider a conformal relation between\nthem in the following manner\n\u0012 \u0013s\nl\nΦ=\nΦ̄,\n(28)\ny\nwhere the conformal weight s is not fixed ab initio. Using this relation we intent to write\nthe pure radiation constraints resulting from an AdS wave (22) in terms of the ones implied\nby the existence of a pp-wave (9). Running down the components list of the first two sets\nof pure radiation constraints (the ones that fix the scalar field dependence) we obtain the\n\n\f8\nfollowing relations\nTuy =\nTui =\nTyy + Tuv =\nTyi =\nTij + δij Tuv =\n\n\u0013\n\u0012 \u00132s \u0012\n∂u Φ̄2\nl\nT̄uy − [s(1 − 4ξ) + 2ξ]\n,\ny\n2y\n\u0012 \u00132s\nl\nT̄ui ,\ny\n\u0012 2 \u0013\u0015\n\u0012 \u00132s \u0014\nΦ̄\nl\ns−1\nT̄yy + T̄uv − [s(1 − 4ξ) + 2ξ] y ∂y\n,\ny\nys\n\u0012 \u00132s \u0012\n\u0013\nl\n∂i Φ̄2\nT̄yi − [s(1 − 4ξ) + 2ξ]\n,\ny\n2y\n\u0012 \u00132s\n\u0001\nl\nT̄ij + δij T̄uv .\ny\n\n(29a)\n(29b)\n(29c)\n(29d)\n(29e)\n\nIt is clear from these relations that the particular value of the conformal weight\ns=−\n\n2ξ\n,\n1 − 4ξ\n\n(30)\n\nseems to play a crucial role, but since it remains to connect the pure radiation constraints\n(9c) and (22c), we prefer to keep the weight infixed for now. The possible relation between\nthese two remaining constraints is more subtle, since this would imply an interrelation among\nthe potentials (13) and (26). As it has been pointed out previously, on the pp-wave side\nthere is only one coupling constant λ, in contrast with the AdS wave case where two a\npriori independent coupling constants λ1 and λ2 are present. Hence, in order to establish\nthe correspondence we need to provide a recipe for choosing the two coupling constants of\nthe AdS wave source starting from the pp-wave one. This problem does not appear in 2 + 1\ndimensions where there is only one wave-front coordinate and only one related integration\nconstant, giving rise to a single coupling constant for both gravitational wave backgrounds\n[14]. In order to compensate this mismatch, our first election is simple and consists of\nchoosing λ1 coinciding with the single coupling constant of the potential supporting the\npp-wave. The second election is inspired by the self-dual condition (15) which implies that\nthe quantity (∂y Φ̄)/Ū(Φ̄)1/2 is constant for the pp-wave configuration, and hence this allows\nus to define the coupling constant λ2 as proportional to this constant. Using the following\ntwo definitions for the coupling constants\nλ1 = λ,\nλ2 = −\n\n(31a)\n1\nl\n\nr\n\nλ ∂y Φ̄\nq\n,\n2 Ū Φ̄\u0001\n\n(31b)\n\nwe conclude, after a tedious computation, that the remaining pure radiation constraints are\nrelated as follows\n\u0012 \u00132s \u0010\n\u0011\nl2\nl\nîĵ\nδ Tîĵ + (D − 3)Tuv + 2 [U(Φ) − Vs (Φ, y)] =\nδ îĵ T̄îĵ + (D − 3)T̄uv ,\n(32)\ny\ny\n\n\f9\nwhere the function Vs depends on the scalar field Φ and additionally on the wave-front\ncoordinate y by means of\n\u0012 \u0013[s(4ξ−1)−2ξ]/ξ\n\u0012 \u0013[s(4ξ−1)−2ξ]/(2ξ)\nq\nl\nλ2\nl\nλ1\nŪ (Φ)\n+ [s + 2ξ(D − 1)] √ Φ 2Ū(Φ)\nVs (Φ, y) =\nλ\ny\ny\nλ\n2\n[s + 4(D − 1)ξs + (D − 2)(D − 1)ξ] 2\nΦ,\n(33)\n+\n2l2\nwhere Ū (Φ) stands for the functional dependence of the pp-wave potential (13) evaluated\non the AdS wave scalar field.\nWe are now in position to derive some conclusions. Firstly, as it was previously mentioned it is clear from the relations (29) that the involved pure radiation constrains of both\ngravitational wave backgrounds are conformally related only if one choose the conformal\nweight (30). Secondly, for such weight the function Vs above becomes y-independent and\nreduces precisely to the functional expression of the scalar potential supporting the AdS\nwave (26). Hence, this process automatically select the indicated potentials as the only ones\nallowing the conformal mapping between the pure radiation constraints! It is also interesting to note that for the conformal coupling in D dimensions, ξ = ξD , the weight (30)\nbecomes s = (2 − D)/2 which is precisely the conformal weight associated to the conformal\nKlein–Gordon equation in D dimensions.\nIn summary, we have shown that the pure radiation constraints on a pp-wave and an AdS\nwave are conformally related if one suppose a conformal relation (28) between the involved\nscalar fields with a conformal weight (30), and additionally the respective potential (13) and\n(26) are taken in each side using the definitions (31) for the coupling constants, i.e.\n\u0012 \u0013−4ξ/(1−4ξ)\nl\nTuî =\nT̄uî ,\n(34a)\ny\n\u0012 \u0013−4ξ/(1−4ξ)\n\u0001\nl\nTîĵ + δîĵ Tuv =\nT̄îĵ + δîĵ T̄uv ,\n(34b)\ny\n\u0012 \u0013−4ξ/(1−4ξ) \u0010\n\u0011\nl\nîĵ\nîĵ\nδ Tîĵ + (D − 3)Tuv =\nδ T̄îĵ + (D − 3)T̄uv .\n(34c)\ny\nA similar conclusion can be achieved by studying the wave equation for the scalar field.\nUsing the conformal weight (30) and the relations (31) between the coupling constants\nof both potentials, a conformal relation between the Klein–Gordon equations can be also\nachieved for any generic nonminimal coupling ξ,\n\u0012 \u00132(2ξ−1)/(1−4ξ) \u0012\n\u0013\nd\nŪ\n(\nΦ̄)\nl\ndU(Φ)\n ̄ Φ̄ − ξ R̄ Φ̄ −\n\u0003\n=\n\u0003Φ − ξR Φ −\n.\n(35)\ndΦ\ny\ndΦ̄\nThis relation is far from obvious since it usually only works in the case of the conformal\ncoupling and taking in both sides of the equation the unique potential that does not spoil the\nconformal invariance. A fact which is straightforwardly recovered in the above expression\njust taking ξ = ξD .\nV.\n\nCONCLUSIONS\n\nHere, we have been concerned with the pp-wave and the AdS wave backgrounds in arbitrary dimension. These spacetimes share in common that their coupling to a matter source\n\n\f10\nis accompanied by a strong restriction, namely the source field must behave like a pure\nradiation field. The elaboration of this work through two concise examples in arbitrary\ndimensions has opened a number of questions that we would like to comment.\nIn this paper, we have shown that the nonminimal coupling of scalar fields to these particular spacetimes can be realized consistently, and the most general scalar field configurations\nconsistent with the only symmetry of the problem have been derived. In this first result\nthere is an interesting contrast between the strong restriction imposed by the spacetimes\nand the fact that the most general solution of an higher-dimensional problem with only one\nsymmetry can be obtained. Moreover, it is obvious form our study that not any matter\nfield can act as a source for these backgrounds. In view of this, it is legitimate to go into\nthoroughly and ask what are the characteristics that a matter action must possess in order\nto couple consistently with these peculiar spacetimes. For example, it is clear that since\nthe pp-wave and the AdS wave metrics possess a null Killing field together with the fact\nthat their Einstein tensors have the structure (2), automatically impose an on-shell traceless\ncondition on the energy-momentum tensor of the matter source.\nIn the analysis of the pure radiation constraints, we have put in evidence the analogies existing between both backgrounds. Indeed, in each case, the same combinations of\nthe energy-momentum tensor components give rise to the independent pure radiation constraints. Moreover, these combinations uniquely fix the scalar field source, that means not\nonly the local expression for the scalar field but also the unique self-interactions allowing the\nexistence of the whole configuration. Furthermore, this derivation has been done without\nthe explicit knowledge of the structural metric function, suggesting that the source is only\nsensitive to the general form of the metric. This property by itself is very intriguing and\nunusual in gravitational physics due to the strongly coupled behavior inherent to the matter/gravity interaction; as it is well known matter acts as the source of spacetime curvature\ngenerating the gravitational potential, but at the same time the spacetime geometry is the\narena where matter fields evolve, i.e. matter fields feel the fingerprints of the gravitational\nfield via its equation of motion. In the present cases the metric structural functions do\nnot participate in the Klein–Gordon equations. It is natural to ask first wether there exist\nother examples of such behavior in the current literature. To our knowledge the only similar\nexamples occur for the so-called stealth configurations for which both matter and gravity\nare completely decoupled [15, 16, 17, 19, 20]. The analogies with the stealth configurations\nalso concern the allowed potentials as it has been stressed in the present work. For all these\nreasons, it would be desirable to have a better understanding of these curiosities from a\nmathematical as well as physical point of view.\nAs said before, the pure radiation constraints impose and single out a unique form of the\npotential for each background. In the pp-wave case, the selected self-interaction depends on\na single coupling constant and follows a power-law dependence on the scalar field. In the\nAdS wave case, two coupling constants emerge from the integration of the pure radiation\nconstraints, each one associated to a different power-law term in the potential, additionally\na third contribution also appears consisting in a mass term whose mass scale is fixed by the\nAdS radius. In spite of being different potentials, in the case of the conformal coupling in\nD dimensions, both potentials reduce to the conformally invariant potential. It is appealing\nthat as the nonminimal coupling parameter takes the conformal value, the allowed potentials\nprecisely reduce to the conformally invariant one in D dimensions. This may be think as\nif for an arbitrary value of the nonminimal coupling parameter, the system would enjoy a\nsymmetry higher than the conformal symmetry and reduces to this later as the nonminimal\n\n\f11\ncoupling parameter becomes the conformal one. The conformal relations established in the\nprevious section brings evidence in favor of this view. An interesting work will then consist\nof studying the dynamical symmetries of the models we have considered in order to confirm\nthe existence or not of a higher symmetry including the conformal one.\nIn the last part, we have extended the analogies observed between the AdS wave and\nthe pp-wave sources by establishing a conformal correspondence between the pure radiation\nconstraints of each system. In some sense, this correspondence permits to derive the scalar\nfield configuration of the AdS wave background from the pp-wave one in a nontrivial way.\nIn this correspondence, the scalar fields are conformally related with a weight expressed\nin terms of the nonminimal coupling parameter independently of the precise dimension.\nFor the conformal value of the nonminimal coupling, this weight precisely becomes the\nconformal weight associated to the conformal Klein–Gordon equation. The pure radiation\nconstraints fixing the scalar field dependence are easily put in equivalence in contrast with\nthe radiation constraints that single out the self-interactions. Indeed, in this last case, there\nis a mismatching between the coupling constants of the respective potentials. The additional\ncoupling constant in the AdS wave potential has been shown to be associated to a constant\narising from a self-dual condition naturally satisfied by the pp-wave scalar fields. It is far\nfrom obvious that the self-gravitating matter sources generating each backgrounds are in\ncorrespondence even if these backgrounds can be viewed as conformally related. One may\nthink that the correspondence established here is a sort of residual conformal symmetry that\nhas its origin on the on-shell traceless condition of the energy-momentum tensor, a property\nusually associated to the conformal invariance of the source. Once again, it would be of\ninterest to understand the mathematical structures that are behind of the examples treated\nin this work.\nAcknowledgments\n\nWe thank Alberto Garcı́a for useful discussions. This work is partially supported by\ngrants 3020032, 1040921, 7040190, 1051064, 1051084, and 1060831 from FONDECYT, and\ngrants CO1-41639 and CO2-44598 from CONACyT. Institutional support to the Centro de\nEstudios Cientı́ficos (CECS) from Empresas CMPC is gratefully acknowledged. CECS is a\nMillennium Science Institute and is funded in part by grants from Fundación Andes and the\nTinker Foundation.\nAPPENDIX A: FIELD EQUATIONS FOR HIGHER DIMENSIONAL PP -WAVES\n\nThe independent Einstein equations (18) for the energy-momentum (20) on the background of a D-dimensional pp-wave (3) are given by the following combination\n0 = Ḡαβ − κT̄αβ + ḡαβ (Ḡuv − κT̄uv )\n\u0014\n\u0015\n\u0013\n\u0012\n1\n1 îĵ\n2\n2\n2 ˆ\n2\n2\n=\n(1 − κξ Φ̄ )△F̄ + κξ ∂uu Φ̄ − δ ∂î F̄ ∂ĵ Φ̄ − κ(∂u Φ̄) δαu δβu\n2\n2\n\u0011\n\u0010\n\u0001\n2 2\nu î\n2 2\n− 2κ ∂u Φ̄∂î Φ̄ − ξ∂uî Φ̄ δ(α δβ) − κ ∂î Φ̄∂ĵ Φ̄ − ξ∂îĵ Φ̄ δαî δβĵ ,\n\n(A1)\n\n\f12\nand the trace\n\u0013\n\u0012\n1 îĵ\n0 = ḡ (Ḡîĵ − κT̄îĵ ) + (D − 3)(Ḡuv − κT̄uv ) = κ Ū (Φ̄) − δ ∂î Φ̄∂ĵ Φ̄ ,\n2\nîĵ\n\n(A2)\n\nˆ = δ îĵ ∂ ∂ . It is straightforward to check that the\nwhere xî = (y, xi ), i = 1, . . . , D − 3, and △\nî ĵ\nabove equations reduce to its 2 + 1 dimensional versions solved in Ref. [12].\nAPPENDIX B: FIELD EQUATIONS FOR HIGHER DIMENSIONAL ADS WAVES\n\nAll the information following from Einstein equations (18) with energy-momentum (20)\non the background of a D-dimensional AdS wave (16) is encoded in the following combination\ny2\n0 = Gαβ + Λgαβ − κTαβ + 2 gαβ (Guv + Λguv − κTuv )\nl \u0012\n\u0014 2\n\u0015\n\u0013\n1l\n1 îĵ\n2\n2\n2\n2\n2\n=\n(1 − κξΦ )\u0003F + κξ ∂uu Φ − δ ∂î F ∂ĵ Φ − κ(∂u Φ) δαu δβu\n2\n2y\n2\n\u0013\n\u0012\n\u0001\n\u0001 u i\nξ\nu y\n2 2\nδβ) − 2κ ∂u Φ∂i Φ − ξ∂ui\nΦ δ(α\nδβ)\n− 2κ ∂u Φ∂y Φ − ∂y y∂u Φ2 δ(α\ny\n\u0012\n\u0013\n\u0012\n\u0013\n\u0001 y y\n\u0001 y i\nξ\nξ\n2\n2\n2\n2\n− κ (∂y Φ) − 2 ∂y y ∂y Φ\nδα δβ − 2κ ∂y Φ∂i Φ − ∂y y∂i Φ\nδ(α δβ)\ny\ny\n\u0001\n− κ ∂i Φ∂j Φ − ξ∂ij2 Φ2 δαi δβj ,\n(B1)\n\nand the trace\n\ny2\n0 = g îĵ (Gîĵ + Λgîĵ − κTîĵ ) + (D − 3) 2 (Guv + Λguv − κTuv )\nl\n\u0013\n\u0012\n1 y 2 îĵ\ny\n2\n2\n= κ U(Φ) + ξΛΦ + ξ(D − 1) 2 ∂y Φ − 2 δ ∂î Φ∂ĵ Φ ,\nl\n2l\nwhere xî = (y, xi ), i = 1, . . . , D − 3, Λ = −(D − 2)(D − 1)/(2l2 ), and\n\u0014\n\u0012\n\u0013\n\u0015\ny 2 D−2\n1\n\u0003F = 2 y\n∂y\n∂y F + △F ,\nl\ny D−2\n\n(B2)\n\n(B3)\n\nwith △ = δ ij ∂i ∂j . As before the above equations becomes the 2 + 1 dimensional ones studied\nin Ref. [14].\n\n[1] J. D. Bekenstein, Annals Phys. 82, 535 (1974); 91, 75 (1975).\n[2] S.T.C. Siklos, in: Galaxies, axisymmetric systems and relativity, ed. M.A.H. MacCallum\n(Cambridge Univ. Press, Cambridge 1985).\n[3] J. Podolsky, Class. Quant. Grav. 15, 719 (1998) [arXiv:gr-qc/9801052].\n[4] A. Garcı́a and J. Plebański, J. Math. Phys. 22, 2655 (1981).\n[5] H. Salazar, A. Garcı́a, and J. Plebański, J. Math. Phys. 24, 2191 (1983).\n\n\f13\n[6] A. Garcı́a, Nuovo Cim. B 78, 255 (1983).\n[7] I. Ozsvath, I. Robinson, and K. Rozga, J. Math. Phys. 26, 1755 (1985).\n[8] J. Bicak and J. Podolsky, J. Math. Phys. 40, 4495 (1999) [arXiv:gr-qc/9907048]; 4506 (1999)\n[arXiv:gr-qc/9907049].\n[9] H. Stephani, D. Kramer, M. MacCallum, C. Hoenselaers, and E. Herlt, Exact solutions of\nEinstein's field equations (Cambridge University Press, Cambridge 2003).\n[10] S. Deser, R. Jackiw, and S. Y. Pi, Acta Phys. Polon. B 36, 27 (2005) [arXiv:gr-qc/0409011].\n[11] E. Ayón–Beato and M. Hassaı̈ne, Annals Phys. 317, 175 (2005) [arXiv:hep-th/0409150].\n[12] E. Ayón–Beato and M. Hassaı̈ne, Phys. Rev. D 71, 084004 (2005) [arXiv:hep-th/0501040].\n[13] R. Jackiw, AIP Conf. Proc. 805, 283 (2006) [arXiv:gr-qc/0509035].\n[14] E. Ayón–Beato and M. Hassaı̈ne, Phys. Rev. D 73, 104001 (2006) [arXiv:hep-th/0512074].\n[15] E. Ayón–Beato, C. Martı́nez, and J. Zanelli, Gen. Rel. Grav. 38, 145 (2006)\n[arXiv:hep-th/0403228].\n[16] M. Hassaı̈ne, J. Phys. A 39, 8675 (2006) [arXiv:hep-th/0606159].\n[17] E. Ayón–Beato, C. Martı́nez, R. Troncoso, and J. Zanelli, Phys. Rev. D 71, 104037 (2005)\n[arXiv:hep-th/0505086].\n[18] D. A. Demir and B. Pulice, Phys. Lett. B 638, 1 (2006) [arXiv:hep-th/0605071].\n[19] E. Ayón–Beato, C. Martı́nez, R. Troncoso, and J. Zanelli, \"Stealths on AdS,\" in preparation.\n[20] M. Hassaine, J. Math. Phys. 47, 033101 (2006) [arXiv:hep-th/0511243].\n\n\f"}