{"id": "http://arxiv.org/abs/hep-th/0702105v1", "guidislink": true, "updated": "2007-02-13T20:59:55Z", "updated_parsed": [2007, 2, 13, 20, 59, 55, 1, 44, 0], "published": "2007-02-13T20:59:55Z", "published_parsed": [2007, 2, 13, 20, 59, 55, 1, 44, 0], "title": "Field/source duality in topological field theories", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0702171%2Chep-th%2F0702067%2Chep-th%2F0702202%2Chep-th%2F0702209%2Chep-th%2F0702200%2Chep-th%2F0702228%2Chep-th%2F0702179%2Chep-th%2F0702004%2Chep-th%2F0702192%2Chep-th%2F0702167%2Chep-th%2F0702177%2Chep-th%2F0702217%2Chep-th%2F0702197%2Chep-th%2F0702076%2Chep-th%2F0702068%2Chep-th%2F0702011%2Chep-th%2F0702030%2Chep-th%2F0702164%2Chep-th%2F0702153%2Chep-th%2F0702183%2Chep-th%2F0702014%2Chep-th%2F0702127%2Chep-th%2F0702199%2Chep-th%2F0702064%2Chep-th%2F0702091%2Chep-th%2F0702143%2Chep-th%2F0702161%2Chep-th%2F0702120%2Chep-th%2F0702225%2Chep-th%2F0702220%2Chep-th%2F0702007%2Chep-th%2F0702229%2Chep-th%2F0702114%2Chep-th%2F0702186%2Chep-th%2F0702212%2Chep-th%2F0702016%2Chep-th%2F0702050%2Chep-th%2F0702159%2Chep-th%2F0702013%2Chep-th%2F0702181%2Chep-th%2F0702058%2Chep-th%2F0702071%2Chep-th%2F0702227%2Chep-th%2F0702099%2Chep-th%2F0702121%2Chep-th%2F0702053%2Chep-th%2F0702034%2Chep-th%2F0702208%2Chep-th%2F0702086%2Chep-th%2F0702049%2Chep-th%2F0702083%2Chep-th%2F0702003%2Chep-th%2F0702180%2Chep-th%2F0702148%2Chep-th%2F0702005%2Chep-th%2F0702166%2Chep-th%2F0702070%2Chep-th%2F0702118%2Chep-th%2F0702026%2Chep-th%2F0702187%2Chep-th%2F0702100%2Chep-th%2F0702059%2Chep-th%2F0702146%2Chep-th%2F0702046%2Chep-th%2F0702010%2Chep-th%2F0702098%2Chep-th%2F0702168%2Chep-th%2F0702216%2Chep-th%2F0702062%2Chep-th%2F0702122%2Chep-th%2F0702207%2Chep-th%2F0702009%2Chep-th%2F0702072%2Chep-th%2F0702218%2Chep-th%2F0702223%2Chep-th%2F0702089%2Chep-th%2F0702129%2Chep-th%2F0702188%2Chep-th%2F0702040%2Chep-th%2F0702136%2Chep-th%2F0702157%2Chep-th%2F0702001%2Chep-th%2F0702110%2Chep-th%2F0702032%2Chep-th%2F0702169%2Chep-th%2F0702096%2Chep-th%2F0702172%2Chep-th%2F0702165%2Chep-th%2F0702173%2Chep-th%2F0702043%2Chep-th%2F0702185%2Chep-th%2F0702160%2Chep-th%2F0702154%2Chep-th%2F0702193%2Chep-th%2F0702105%2Chep-th%2F0702191%2Chep-th%2F0702025%2Chep-th%2F0702066%2Chep-th%2F0702204%2Chep-th%2F0702078%2Chep-th%2F0702222&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Field/source duality in topological field theories"}, "summary": "The relationship between the sources of physical fields and the fields\nthemselves is investigated with regard to the coupling of topological\ninformation between them. A class of field theories that we call topological\nfield theories is defined such that both the field and its source represent de\nRham cocycles in varying dimensions over complementary subspaces and the\ncoupling of one to the other is by way of an isomorphism of the those\ncohomology spaces, which we refer to as field/source duality. The deeper basis\nfor such an isomorphism is investigated and the process is described for\nvarious elementary physical examples of topological field theories.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0702171%2Chep-th%2F0702067%2Chep-th%2F0702202%2Chep-th%2F0702209%2Chep-th%2F0702200%2Chep-th%2F0702228%2Chep-th%2F0702179%2Chep-th%2F0702004%2Chep-th%2F0702192%2Chep-th%2F0702167%2Chep-th%2F0702177%2Chep-th%2F0702217%2Chep-th%2F0702197%2Chep-th%2F0702076%2Chep-th%2F0702068%2Chep-th%2F0702011%2Chep-th%2F0702030%2Chep-th%2F0702164%2Chep-th%2F0702153%2Chep-th%2F0702183%2Chep-th%2F0702014%2Chep-th%2F0702127%2Chep-th%2F0702199%2Chep-th%2F0702064%2Chep-th%2F0702091%2Chep-th%2F0702143%2Chep-th%2F0702161%2Chep-th%2F0702120%2Chep-th%2F0702225%2Chep-th%2F0702220%2Chep-th%2F0702007%2Chep-th%2F0702229%2Chep-th%2F0702114%2Chep-th%2F0702186%2Chep-th%2F0702212%2Chep-th%2F0702016%2Chep-th%2F0702050%2Chep-th%2F0702159%2Chep-th%2F0702013%2Chep-th%2F0702181%2Chep-th%2F0702058%2Chep-th%2F0702071%2Chep-th%2F0702227%2Chep-th%2F0702099%2Chep-th%2F0702121%2Chep-th%2F0702053%2Chep-th%2F0702034%2Chep-th%2F0702208%2Chep-th%2F0702086%2Chep-th%2F0702049%2Chep-th%2F0702083%2Chep-th%2F0702003%2Chep-th%2F0702180%2Chep-th%2F0702148%2Chep-th%2F0702005%2Chep-th%2F0702166%2Chep-th%2F0702070%2Chep-th%2F0702118%2Chep-th%2F0702026%2Chep-th%2F0702187%2Chep-th%2F0702100%2Chep-th%2F0702059%2Chep-th%2F0702146%2Chep-th%2F0702046%2Chep-th%2F0702010%2Chep-th%2F0702098%2Chep-th%2F0702168%2Chep-th%2F0702216%2Chep-th%2F0702062%2Chep-th%2F0702122%2Chep-th%2F0702207%2Chep-th%2F0702009%2Chep-th%2F0702072%2Chep-th%2F0702218%2Chep-th%2F0702223%2Chep-th%2F0702089%2Chep-th%2F0702129%2Chep-th%2F0702188%2Chep-th%2F0702040%2Chep-th%2F0702136%2Chep-th%2F0702157%2Chep-th%2F0702001%2Chep-th%2F0702110%2Chep-th%2F0702032%2Chep-th%2F0702169%2Chep-th%2F0702096%2Chep-th%2F0702172%2Chep-th%2F0702165%2Chep-th%2F0702173%2Chep-th%2F0702043%2Chep-th%2F0702185%2Chep-th%2F0702160%2Chep-th%2F0702154%2Chep-th%2F0702193%2Chep-th%2F0702105%2Chep-th%2F0702191%2Chep-th%2F0702025%2Chep-th%2F0702066%2Chep-th%2F0702204%2Chep-th%2F0702078%2Chep-th%2F0702222&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The relationship between the sources of physical fields and the fields\nthemselves is investigated with regard to the coupling of topological\ninformation between them. A class of field theories that we call topological\nfield theories is defined such that both the field and its source represent de\nRham cocycles in varying dimensions over complementary subspaces and the\ncoupling of one to the other is by way of an isomorphism of the those\ncohomology spaces, which we refer to as field/source duality. The deeper basis\nfor such an isomorphism is investigated and the process is described for\nvarious elementary physical examples of topological field theories."}, "authors": ["David Delphenich"], "author_detail": {"name": "David Delphenich"}, "author": "David Delphenich", "arxiv_comment": "32 pages, 4 figures", "links": [{"href": "http://arxiv.org/abs/hep-th/0702105v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0702105v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0702105v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0702105v1", "journal_reference": null, "doi": null, "fulltext": "Field/source duality in topological field theories\nD. H. Delphenich ∗\nPhysics Department, Bethany College, Lindsborg, KS USA 67456\nKey words Field singularities, topological electromagnetism, topological field theories\nPACS 02.40.Re, 03.50.De. 11.10-z\nThe relationship between the sources of physical fields and the fields themselves is investigated\nwith regard to the coupling of topological information between them. A class of field theories that\nwe call topological field theories is defined such that both the field and its source represent de\nRham cocycles in varying dimensions over complementary subspaces and the coupling of one to\nthe other is by way of an isomorphism of the those cohomology spaces, which we refer to as\nfield/source duality. The deeper basis for such an isomorphism is investigated and the process is\ndescribed for various elementary physical examples of topological field theories.\nContents\n1 Introduction\n\n2\n\n2 Topological preliminaries\n\n4\n\n2.1 Differentiable singular cubic homology.........................................................\n\n4\n\n2.2 Singular and de Rham cohomology..............................................................\n\n10\n\n2.3 Poincaré duality.....................................................................................\n\n11\n\n2.4 De Rham homology...............................................................................\n\n12\n\n3 Topological field theories\n\n13\n\n3.1 Charge, flux, and current...........................................................................\n\n13\n\n3.2 Charge and flux quantization.....................................................................\n\n16\n\n3.3 Topological field theories.........................................................................\n\n17\n\n3.4 Field/source duality................................................................................\n\n19\n\n3.5 Equivalent field/source configurations..........................................................\n\n21\n\n4 Physical examples\n\n23\n\n4.1 Static electric fields................................................................................\n\n23\n\n4.2 Static magnetic fields..............................................................................\n\n26\n\n4.3 Dynamic fields and inductive couplings.........................................................\n\n27\n\n4.4 Topological electromagnetism.....................................................................\n\n28\n\n4.5 Fluid flow............................................................................................\n\n29\n\n4.6 Weak-field gravitation..............................................................................\n\n30\n\n5 Discussion\n\n31\n\nReferences\n\n32\n\n∗\n\nE-mail: delphenichd@bethanylb.edu\n\n\f2\n\n1 Introduction\nOne of the most fundamental issues in physical field theories is how the information\nassociated with the field sources is coupled to the information in the field itself. For\ninstance, in the inverse-square case that describes either the field of a static point charge\nor the gravitational field of a static point mass, in the Newtonian approximation, this\ncoupling takes the form of associating a scalar – charge or mass, resp. – with the source\npoint and a vector field or 1-form at every other point of the space whose magnitude is\nproportional to that scalar, along with purely geometrical information that describes how\nthe field varies with distance from the source and the direction that it points in.\nA topologically significant issue regarding fields is whether the points that represent\nthe field source are points at which the field itself is actually defined or if the set of these\npoints should be properly the complement of the points at which the field is defined. For\ninstance, this is necessarily the case with an inverse-square field, which has a pole at the\nsource point.\nTo be sure, in physics, the source of a field does not always have to represent a\nsingularity. For instance, one sometimes regards a field as being \"driven by its boundary\nconditions,\" such as when one solves for a potential function in a region by specifying its\nvalue on the boundary of that region. Similarly, a disturbance in a medium that initiates\nthe propagation of a wave does not always have to be topologically distinct from the rest\nof the medium, such as the motion of the hand that sends a pulse down a bullwhip.\nContrast this with the case of a stone dropped into a pond, which momentarily creates a\nhole in the surface, and the hole can be regarded as either an example of a non-trivial\nhomology class in dimension one that serves as the source of the wave field or a\nboundary on which to define initial conditions (i.e., Cauchy data).\nHence, we see that the scope of our present discussion does not encompass all\npossible field/source relationships, but simply an important class that presents itself at the\nmost elementary level. A further restriction in scope is due to the fact that the fields that\nwe will be considering often take the form of \"external\" field solutions, as opposed to the\n\"internal\" field solutions, which are defined on the source points; by this, we generally\nmean the points of the support of the source distribution.\nWe then regard the space or spacetime manifold M as being decomposed into two\ntypes of points: a closed subset S of \"singular points\" at which the source distribution is\ndefined and its open complement G of \"generic points\" at which the field is defined.\nFurthermore, we shall assume that S represents the set of boundary points of G; i.e., limit\npoints that are not generic. This is simply to suggest that source points are not\ntopologically isolated from the fields that they generate. In order to justify the use of the\nterm \"duality\" in this situation as being indicative of some sort of fundamental\nisomorphism, we then concentrate on a class of field theories in which one can find the\nsame essential information contained in the source as in the field itself.\n\n\f3\n\nWe shall call a field theory a topological field theory 1 when the source points define\na homology class, in some choice of homology, and the field points define a cohomology\nclass in dimension k, in perhaps some other sense. Furthermore, the source points are\nassociated with a source distribution, such as a charge or current density, which we then\nregard as a cohomology class over S in some dimension m. Hence, we shall say that a\ntopological field theory exhibits field/source duality when there is an isomorphism of.\nHk(G; R) and Hm(S; R).\nOf course, to the pure mathematician this isomorphism would suggest that there is\nsomething redundant about describing both the cohomology of S and that of G. They are\nmore inclined to simply regard the fact that the cohomology of G is non-vanishing in\ndimension k as the \"source\" of the field. The reason that it is still physically non-trivial\nto discuss both cohomologies independently is that ultimately the nature of S is\nsomewhat enigmatic in the eyes of experimental physics. Hence, any attempt to\nmathematically model the topology of S is limited by the state of the art in\nphenomenology.\nThe homologies that we shall use in this study are the homology of differentiable\nsingular cubic chains with real coefficients and the de Rham homology of k-vector fields\non an orientable manifold, which is given a divergence operator that is Poincaré-dual to\nthe exterior derivative. The corresponding cohomology will be the de Rham\ncohomology, which is defined by exterior differential forms and the exterior derivative\noperator.\nOf course, the prototype for this sort of field theory is electromagnetism, in which the\nfield is a closed 2-form F and the source is a conserved – i.e., divergenceless – vector\nfield J. When one is given a linear electromagnetic constitutive law κ: Λ2(M) → Λ2(M)\nthat associates an excitation bivector field h to the field strength 2-form F the other\nMaxwell equation δh(F) = J then the operator δκ : Λ2(M) → Λ1(M) maps a de Rham\ncohomology class in dimension two, namely [F], to a de Rham homology class in\ndimension one, namely [J].\nAlthough one is taught to think of this association as coming from the various forms\nof Stokes's theorem, such as Gauss's law in electrostatics and Ampère's law in\nmagnetostatics, it is interesting that both of those laws are actually inapplicable in the\nmost elementary cases of point charges and line currents, since the fields diverge at those\npoints. Hence, the fields are defined only on the complements of points in R3 or lines in\nR3, and these complementary topological spaces have non-trivial cohomology in\ndimensions two and one, respectively. Thus, one finds that although the total flux of the\nelectric field strength E through any sphere S r2 of radius r and centered on a point charge\nQ at the origin is Q, just one expects, nevertheless, the divergence of E vanishes\neverywhere in the interior of the ball Br3 that S r2 bounds, except at the origin, where it is\nnot defined. Hence, since S r2 is a 2-cycle, but the punctured ball Br3 − {0} that it bounds is\nnot even a 3-chain in R3 – {0}, Gauss's law is inapplicable to the situation, and the only\n1\n\nWe should probably say topological classical field theories, to distinguish them from the topological\nquantum field theories of Witten, Atiyah, et al., but the author believes that if the scientists of antiquity\nwere not actually considering any such modern refinements as cohomology and fiber bundles then calling\nsuch theories \"classical\" is unnecessarily pejorative, as it suggests anachronism; perhaps \"neo-classical\"\nwould be a more appropriate descriptive.\n\n\f4\n\nway that one can associate the total flux of E through S r2 with Q is to make that a basic\npostulate of the field theory. This amounts to associating the essential information in the\nhomology class defined by the 0-cocycle Qδ0 with the cohomology class defined by the\n2-cocycle #E. (In this expression, the 0-cocycle δ0 ∈ H0(S; R) is a generator that takes\nthe 0-cycle {0} to 1 and all other 0-cycles to 0 and #: Λ*(M) → Λ*(M) is the Poincaré\nduality isomorphism).\nWe point out that there is a subtle chain of associations in the above example between\nthe surface integral of the 2-form #E over S r2 , the integral of δE over the volume Br3 − {0}\n(which is, a 3-chain in R3, but not in R3 – {0}), and the integral of the charge density 3form #ρ = Qδ0ε over the ball Br3 in R3 that S r2 bounds, where ε is the volume element on\nR3. Apparently, the weak link is in associating the volume integral of δE over Br3 – {0}\nwith the volume integral of #ρ over Br3 when Gauss's law was already shown to be\ninapplicable at the first step. We can express these three integrals concisely in terms of\nthe basic pairing of k-cochains and k-chains by integration as <#E, z2>, <#δE, c3>, and\n<#ρ, c3>. Since we see that these three expressions are connected by equalities only\nwhen the 2-cycle z2 = ∂c3, we also see that such an association must be introduced as a\nbasic assumption.\nNaturally, there is something both topologically and physically unsatisfying about\nanything that must be assumed rather than derived, so we shall investigate the extent to\nwhich the association of the information that <#E, z2> represents with the information\nthat <#ρ, c3> represents can be derived from more fundamental assumptions. For\ninstance, one notes that since Q is concentrated at a point, the 3-chain can be\nhomotopically contracted to a 0-chain {0}, the 3-cocycle #ρ to a 0-cocycle Qδ0 and the\ninformation in <#ρ, c3> is the same as in <Qδ0, {0}>. More generally, one often applies\ndeformation retractions to reduced tubes to curves and slabs to planes. Furthermore, in\norder to make actual homology classes out of the source points, one must often reduce the\ncurves and planes to points, at least when the curve is not a loop. Hence, we shall discuss\nthe notion of field theories that are topologically equivalent to topological field theories.\n\n2 Topological preliminaries\nAlthough the basic concepts of homology theory (see [1-4]) are assumed, some attempt is\nmade to make the presentation more self-contained, so these concepts are also defined for\nthe sake of discussion below.\nWe begin by briefly summarizing the basic concepts of the real homology of\ndifferentiable singular cubic chains.\n2.1 Differentiable singular cubic homology\nAlthough the basic building blocks of differentiable singular cubic homology are kdimensional cubes Ik in Rn, and are therefore not differentiable manifolds, strictly\nspeaking, this is not a serious limitation since differentiation is a local operator, so no\nmatter how one chooses to extend a function σk : Ik → M to a differentiable function on\n\n\f5\n\nan open neighborhood of Ik, the restriction of dσk to T(Ik) will remain the same. Hence,\nthis is the sense of the word \"differentiable\" we intend by defining a differentiable\nsingular cubic k-simplex to be such a map. A differentiable singular cubic k-chain with\ncoefficients in a ring R is then a finite formal sum 2 of the form:\nN\n\nck = ∑ α i (σ k )i ,\n\nαi ∈ R .\n\n(2.1)\n\ni =1\n\nThe most natural choice of ring is Z, the integers, since the multiplication by a integer\nevokes an intuitive picture of the repetition of a simplex in the sum, but eventually we\nshall be primarily concerned with the ring (field, really) of real numbers R. One can then\nthink of the coefficient of a simplex as essentially a \"total charge\" that is associated with\nthe object.\nThe simplest non-trivial coefficient ring is Z2 = {0, 1}, which plays an important role\nin the topology of orientability and the Stiefel-Whitney characteristic classes. In an\nexpression for a Z2 k-chain of the form (2.1), a basic simplex would either appear with a\n+ sign for its coefficient or not at all. This is to be distinguished from k-chains – in\nparticular, k-cycles, which we discuss below – that can have any integer for a coefficient,\nbut some of them vanish when multiplied by some integer p; these are referred to as kcycles with torsion. Fortunately, such complexities will be irrelevant to most of what\nfollows since we will be using real coefficients, which allow for no torsion factors in\nhomology or cohomology.\nFor the sake of brevity, we shall henceforth generally abbreviate the phrase\n\"differentiable singular cubic chain\" to simply \"chain\" when no confusion will arise.\nIt is important to point out that the inclusion of the word \"singular\" is not casual,\nsince the maps of the k-cubes into M are not required to be embeddings. Hence, one\nshould keep in mind that the dimension of the image could very well be less than k;\nindeed, a singular k-simplex can take Ik to just one point. (This is useful to keep in mind\nwhen one is considering homotopies of chains.)\nWe shall call a chain homogeneous if all of the cells or simplexes (3) are of the same\ndimension. More generally, an inhomogeneous chain can always be partitioned into\nhomogeneous subchains. Hence, if we denote the R-module of all differentiable singular\ncubic chains in M with coefficients in R by C*(M; R) then we see that this R-module is\nexpressible as a direct sum of homogeneous sub-modules:\nC*(M; R) = C0(M; R) ⊕ C1(M; R) ⊕ ... ⊕ Cn(M; R) .\n\n(2.2)\n\n2\n\nFor those who find formal sums vague and non-rigorous, it should suffice to say that one can actually\nmake this expression more rigorous, but it would distract from the immediate argument to do so.\n3\n\nThe author's justification for using this plural of the word \"simplex,\" as opposed to \"simplices\" is that\n\"simplexes\" is more consistent with the plural of \"complex\"; i.e., the plural of \"sim(ple com)plex.\" One\nwill note that this is the plural that was originally used by Eilenberg, Steenrod, Hilton, Wylie, and others.\nSometime back in the Sixties, the researchers in homologies seemed to have had second thoughts and\nswitched to \"simplices,\" apparently by analogy with \"vertices.\"\n\n\f6\n\nThis R-module is a real vector space in the case where the coefficient ring is R, and is\ngenerally infinite-dimensional, as long as M is not a finite point set.\nWhen k > 0, we define the ith zero face of Ik to be the k−1-cube defined by φi0 = (...,\n0, ...), with a 0 in the ith coordinate, and the ith unit face to be φi1 = (..., 1, ...). We define\nthe boundary of Ik to be the formal sum of its oriented k−1-faces:\n∂Ik = ∑ (φi1 − φi 0 ) .\n\n(2.3)\n\ni\n\nOne then defines the boundary of a k-simplex σk so that it equals the (k−1)-chain that is\ncomposed of the corresponding sum of the restrictions of the map σk to each of the faces\nφi0, φi1 of Ik:\n∂σk = ∑ [σ k (φi1 ) − σ k (φi 0 )] .\n\n(2.4)\n\ni\n\nOne could say that we require the boundary of σk to be the image of the boundary of Ik.\nOne then extends the boundary operator ∂ to all of C*(M; R) by demanding that it be\nlinear and that it agree with the boundary of any simplex in the formal sum. By\nconvention, the boundary of I0 = {0} is zero, as well as the boundary of any 0-simplex\nand thus, any 0-chain. We put all of this together into a linear operator on the Z-graded\nR-module C*(M; R):\n∂: C*(M; R) → C*(M; R),\n\n(2.5)\n\nthat we call the boundary operator. Since it takes k-chains to (k−1)-chains, one says that\nit has degree −1 relative to the Z-grading. It is a basic property of the boundary operator\nthat its square is zero:\n∂2 = 0,\n\n(2.6)\n\ni.e., the boundary of a boundary is always zero.\nAs a simple example of the foregoing, the boundary of a 1-simplex σ1: I → M – i.e., a\ncurve segment – is the oriented formal sum σ1(1) – σ1(0) of its endpoints.\nAlthough it might seems that the simplexes in M define basic building blocks for the\ntopology of M, at least to some extent, actually all of the topological information is\ncontained in the particular definition of ∂ that pertains to M. It is an algebraic\ngeneralization of the construction of compact surfaces by identifying boundary points. In\nFig. 1, we illustrate two simple examples of how the boundary operator defines the way\nthat the simplexes are connected into chains in M:\n\n\f7\n\nB\n\nσ1\nA\n\nB\n\nD\n\nσ1′\n\nσ1\n\nσ1′\n\nC\nA\n\n∂(σ1 + σ1′) =\nB–A+D−C\n\n∂(σ1 + σ1′) =\nB – A +A – B =0\n\nFig. 1. How the boundary operator defines the\nway that simplexes are connected into chains.\nWhen the boundary of a k-chain is zero one calls it a k-cycle, and we denote the Rmodule of all k-cycles by Zk(M; R). For instance, if one decomposes a loop in M into a\nfinite sum of curve segments then one can easily see how it has a vanishing boundary,\nsince all pairs of endpoints appear twice, and with opposite signs.\nSimilarly, when a k-chain is the boundary of some (k+1)-chain one calls it a kboundary and denotes the R-module of all k-boundaries by Bk(M; R). Clearly, from (2.6),\nany k-boundary is a k-cycle; i.e., Bk(M; R) is a sub-module of Zk(M; R).\nThe topology of M enters the discussion when one asks whether all k-cycles in M are\nk-boundaries, which bears heavily upon the idiosyncrasies of the operator ∂ for M in\nparticular. The quotient module Hk(M; R) = Zk(M; R) / Bk(M; R) is defined to the\nhomology R-module of M in dimension k. One can either think of its elements as the\ntranslates of Bk(M; R) by all non-bounding k-cycles, or equivalence classes of k-cycles\nunder the equivalence relation of homology. In particular, two k-cycles ck and ck′ are\ncalled homologous iff they differ by the boundary of a (k+1)-chain:\nck ~ ck′ iff\n\nck − ck′ = ∂ck+1\n\nfor some ck+1 ∈ Ck+1(M: R).\n\n(2.7)\n\nWhereas the R-modules Ck(M; R), Zk(M; R), and Bk(M; R) will generally be\nintractably high-dimensional, the homology module Hk(M; R) has a generator for each \"kdimensional hole\" in M, loosely speaking. When the coefficient ring is R (more\ngenerally: a principal ideal domain) there are no torsion factors in Hk(M; R) and it is a\nvector space with a basis element for each of the aforementioned k-holes. For example,\nthe punctured plane R2 – {0} has any loop that encircles the origin – or rather, its\nhomology class − as the generator of H1(M; R), which is then one-dimensional.\nSince modern physics occasionally considers the way that topologically inequivalent\nmanifolds can sometimes be interpolated by manifolds of one higher dimension – i.e.,\ncobordisms – it is illuminating to show that the constructions of cobordism merely\ngeneralize the constructions of homology to the case where the objects that are being\ninterpolated are not necessarily all contained in the same space. Hence, in Fig. 2, we\nillustrate the way that the widely discussed \"trouser manifold\" that connects a single loop\nto two disjoint loops by way of its boundary components can just as well represent a 2chain whose boundary is the difference between two 1-cycles. In other words, two kcycles are homologous if there is a k+1-chain that interpolates them as boundary\n\n\f8\n\ncomponents in essentially the same way that cobordism tries to do with closed manifolds,\ninstead of k-cycles. We leave it to the reader to elaborate on the details of labeling the\nfour vertices, eight edges, and four faces, and defining the boundary operator – i.e.,\ndefining the identifications of edges and vertices – that make this rigorous.\nz1′\n\nc2\n\nz1′′\nz1\n( z1′ + z1′′) − z1 = ∂c2\nFig. 2. The representation of the trouser manifold as a homology\n(i.e., a 2-chain c2) between the 1-cycles z1 and z1′ + z1′′ .\nSince we shall be making use of homotopies of chains, we make a few remarks\napropos of that objective. It is straightforward to see that when two k-chains are\nhomotopic they will also be homologous. We note that the homotopy of chains resolves\nto a formal linear combination of homotopies of simplexes and examine the way that a\nhomotopy of a two k-cycles produces a homology, namely, a k+1-chain whose boundary\nis the difference of the two k-cycles. One simply notes that if σk, σ′k : Ik → M are two ksimplexes then a homotopy from one to the other is a continuous map σk+1: I × Ik → M\nsuch that σk+1(0, x) = σk(x) and σk+1(1, x) = σ′k(x). Hence, σk+1 is a k+1-simplex whose\nboundary contains σ′k − σk, plus all of the lateral faces. What you have to convince\nyourself of (or simply look it up) is that when you put all of the k-simplexes together into\ntwo k-cycles the lateral faces of the connecting k+1-simplexes cancel out.\nThe converse statement that homologous k-cycles must be homotopic is not\nnecessarily true, since homology is essentially a \"coarser\" level of equivalence than\nhomotopy. In Fig. 3, we illustrate the manner by which a 1-cycle in the doubly punctured\nplane − namely, the sum z1 + z′1 of two circles that enclose one point, but not the other –\ncan be homologous to the 1-cycle z′′1 without being homotopic. The reason that this does\nnot contradict the Hurewicz isomorphism theorem is that the fundamental group π1(R2 –\n{a, b}) of the doubly punctured plane is the free group on two generators 4, which is nonAbelian. One must then use the Abelianization of π1(R2 – {a, b}), which is then a free\nAbelian group on two generators to obtain the isomorphism with H1(R2 – {a, b}). As an\nexample of a product in the free group that does not commute, consider the figure eight\nthat is composed of two circles that intersect at a point. The order in which one describes\none circle and then the other will determine two non-homotopic figure eights, but one can\nsee that they are still homologous to the sum z1 + z′1.\n4\n\nFor a discussion of these matters, see Massey [5].\n\n\f9\n\nIn general, R2 minus a finite set of points will have a fundamental group that is a free\ngroup with one generator for each point (i.e., some loop around it and none of the others)\nand the corresponding homology module in dimension one will be free Abelian with one\ngenerator for each point, as well. When one goes to Rn with n > 2 the difference is that\nremoving a point creates a \"hole\" in dimension n – 1.\n\nz′′1\nz1\na\n\nz′1\nb\n\nFig. 3. How non-homotopic cycles can still be homologous.\nThe particular case of a homotopy of chains that we shall be most concerned with is\nthat of a deformation retraction. If A is a subspace of a topological space X and i: A → X\nis the inclusion map then a deformation retraction of X to A is a map r: X → A such that\nthe composition i ⋅ r: X → X is homotopic to the identity on X. The subspace A is then\ncalled a deformation retract of X. If one prefers to think of homotopies as things that\ntake maps to maps then one must regard a deformation retraction as a homotopy from the\nidentity map of X to the inclusion of A in X; this is more useful when the spaces X and A\nare defined by the carriers of two simplexes, for instance.\nAlthough a deformation retraction is weaker than a homotopy equivalence, for which\nthe other map r ⋅ i : A → A would also have to be homotopic to the identity on A,\nnevertheless, the induced map in homotopy – hence, in homology − is an isomorphism in\neither case.\nIf A consists of a single point then the deformation retraction is a contraction of X\nonto A. In such a case the homotopy groups are all trivial, along with the homology\ngroups, except for dimension 0, which is cyclic with one generator.\nA simple example of a deformation retraction that we shall use is the retraction of R3\nonto the z-axis, which amounts to first factoring R3 into R2 × R1, and then contracting the\nR2 factor to the origin by the radial contraction that was described above. Similarly, one\ncan retract R3 onto the xy-plane by contracting the z-axis to the origin. Although the\nhomology is trivial in any of these cases, we shall generally be more concerned with the\nretraction of subspaces, anyway. For instance, one commonly retracts extended charge,\nmass, or current distributions on balls, tubes, and slabs or annuli, to distributions on\npoints, curves, and surfaces, respectively. Hence, we shall use deformation retraction as\na tool for eliminating the \"homologically superfluous\" dimensions in our field models.\n\n\f10\n\n2.2 Singular and de Rham cohomology\nSince R is a field, we can simply characterize Hk(M; R) as the dual space to the\nvector space Hk(M; R); for more general rings, such as Z, one must take the direct sum of\nthis R-module with a torsion summand.\nOne can first define a differentiable singular cubic k-cochain to be a linear functional\non k-chains. However, one must keep in mind that since the cardinality of any basis for\nCk(M; R) equals the cardinality of the set of k-simplexes – i.e., it is potentially\nuncountably infinite – defining an isomorphism of Ck(M; R) and Ck(M; R) = Ck(M; R) *\nwill not always be canonical. However, one can, at least define a useful linear injection\nby means of the map that takes any k-simplex σk to its corresponding characteristic\nfunctional σk, which is defined by:\n1 if σ k′ = σ k\n0 otherwise.\n\nσ k (σ k′ ) = \n\n(2.8)\n\nHence, any k-chain ck =∑ aiσk,i corresponds to the k-cochain ck =∑ aiσk,i .\nWe now introduce a common notation from homology theory, namely the bracket\nthat pairs a linear functional, such as ck, and a vector, such as ck, with the scalar that\nequals the value of the functional when applied to the vector:\n<.,.>: Ck(M; R) × Ck(M; R) → R,\n\n(ck, ck) ֏ < ck, ck> = ck(ck ).\n\n(2.9)\n\nOne can define the coboundary operator δ on cochains by a generalized \"Stokes\ntheorem\" construction:\n<δαk, ck+1> = <αk, ∂ck+1> ,\n\nfor all ck+1 ∈ Ck+1(M; R) .\n\n(2.10)\n\nGiven this coboundary operator, one immediately defines cocycles, coboundaries,\ncohomologous cocycles, and the cohomology vector spaces Hk(M; R) = Zk(M; R) / Bk(M;\nR), in the obvious way.\nIn order to make the transition to de Rham cohomology direct, note that since the\nspace M that we are dealing with is a differentiable manifold, on which we can integrate\nk-forms over k-chains, we can associate a linear functional on Ck(M; R) with every kform α, namely:\n<α, ck> = ∫ α .\nck\n\n(2.11)\n\nNot every linear functional on Ck(M; R) can be so represented, and, in particular, the\nevaluation functionals cannot. Of course, the non-existent kernel of the evaluation\nfunctional is what physics and mathematical analysis has always defined to be the Dirac\ndelta function, a fact that will clearly be useful to recall when we discuss charge and\ncharge densities.\n\n\f11\n\nIf Λk(M) represents the vector space of exterior differential k-forms on M then we call\nthe vector space Zk(M) of closed k-forms the space of de Rham k-cocycles and the vector\nspace Zk(M) of exact k-forms the space of de Rham k-coboundaries. The quotient vector\n*\nspace H dR\n( M ) = Zk(M) / Bk(M) is then called the de Rham cohomology vector space in\ndimension k. Its elements are equivalence classes of closed form that differ by an exact\nform. The gist of de Rham's theorem, at least in the present context of differential\n*\nsingular cubic homology, is then that H dR\n( M ) is isomorphic to Hk(M; R) – i.e., the\ndifferentiable singular cubic cohomology with real coefficients − for each dimension k.\nThe main steps in the proof come from Stokes's theorem, when given the form:\n<α, ∂ck+1> = <dα, ck+1> ,\n\n(2.12)\n\nand the Poincaré lemma. This shows that the operators d and ∂ are, in a sense, adjoint to\neach other with respect to the given bilinear pairing.\nFor the sake of completeness, we point out that the k-chain ck+1 also defines a linear\nfunctional on the vector space Λk(M) of k-forms on M by way of the pairing (2.11).\nThese linear functionals on Λk(M) are what de Rham [6] referred to as currents, although\nwe shall not use this approach in the present study. In effect, they represent elements of\nCk(M; R) by elements of the dual space to Λk(M), which is itself the dual space to Λk(M).\nIn a later section, we shall see that on an orientable manifold one can define a \"de Rham\nhomology\" over Λ*(M) more directly than by means of elements of the dual of a dual\nspace.\n2.3 Poincaré duality\nThe introduction of a volume element on M into the field theory is very immediately\nrelated to the homology of the source complex since one cannot define a divergence\noperator without one and the divergence plays a key role in the context of source\ncurrents. Since it is not universally acknowledged that one can define a divergence\noperator for k-vector fields on an orientable manifold without needing to introduce a\nmetric or that the resulting operator allows one to define a real homology that is\nessentially dual to the de Rham cohomology – minus the ring structure – we shall briefly\nsummarize those constructions.\nLet M be an orientable n-dimensional differentiable manifold and let ε ∈ Λn(M) be a\nunit-volume element on T*(M); i.e., a non-zero n-form. In a local coordinate chart (U,\nxμ) the component expression for ε takes the form:\n\nε = dx1 ^ ... ^ dxn =\n\n1\nεi...j dxi ^ ... ^ dxj ,\nn!\n\n(2.13)\n\nin which εi...j represents the completely anti-symmetric Levi-Civita symbol with n\nindices.\nThis unit-volume element on T*(M) is associated with a corresponding unit-volume\nelement ε ∈ Λn(M) on T(M), which is then a non-zero n-vector field on M that relates to ε\nby way of the defining property:\n\n\f12\n\nε(εε) = 1.\n\n(2.14)\n\nThe local component form of ε is then:\nε = ∂1 ^ ... ∂n =\n\n1 i...j\nε ∂i ^ ... ∂j .\nn!\n\n(2.15)\n\nAn immediate consequence of the existence of ε and ε is the existence of the\nisomorphisms of Poincaré duality:\n# : Λk(M) → Λn−k(M),\n#−1: Λk(M) → Λn−k(M),\n\na ֏ iaε,\nα ֏ iε α .\n\n(2.16a)\n(2.16b)\n\n(In these expressions, we intend that the combination of multivectors and differential\nforms is by the interior product.) The local expressions for the components are:\n1 κ...λ\na εκ...λμ...ν ,\nk!\n1\n(#-1α)μ...ν = ακ...λ εκ...λμ...ν .\nk!\n\n(#a)μ...ν =\n\n(2.17a)\n(2.17b)\n\nThese isomorphisms are actually of projective geometric origin since one can use\ndecomposable k-vector fields and decomposable k-forms to represent k-dimensional\nvector subspaces of Rn, either directly or by way of their annihilating subspaces. This\nsort of duality says essentially that the same k-plane in Rn can either be represented\ndirectly by a decomposable k-vector or indirectly by the annihilating subspace of an n−kform.\nIt is important to point out that although the # map is a linear isomorphism of vector\nspaces, it is not actually an isomorphism of exterior algebras since #(a ^ b) is an (n − k\n− l)-form, whereas #a ^ #b is a (2n – k – l)-form.\n2.4 De Rham homology\nWhen one has an orientable, oriented manifold M with a chosen unit-volume element\nε one can use Poincaré duality and the exterior derivative operator on differential forms\nto define a divergence operator on multivector fields that generalizes both the divergence\noperator on vector fields that one first encounters in vector calculus, as well as the\ncodifferential operator on differential forms that one defines by means of the Hodge\nduality operator. In particular, the divergence operator δ: Λ*(M) → Λ*−1(M) is defined\nby:\n\nδ = #−1d# .\nIt is a linear operator with the property:\n\n(2.18)\n\n\f13\n\nδ2 = 0 ,\n\n(2.19)\n\nand its local expression in terms of the components a vector field v = vμ ∂μ is the classical\none:\n\nδv =\n\n∂v μ\n.\n∂x μ\n\n(2.20)\n\nOne defines a k-vector a to be a de Rham k-cycle if it has zero divergence and a de\nRham k-boundary if it is the divergence of some (k + 1)-vector. If we denote the vector\nspace of de Rham k-cycles by Zk(M) and the vector space of de Rham k-boundaries by\nBk(M) then we can define the quotient vector space H *dR ( M ) = Zk(M) / Bk(M) to be the de\nRham homology vector space of M in dimension k. It follows from Poincaré duality and\nde Rham's theorem that this vector space is isomorphic to the kth differentiable singular\ncubic homology module when one uses the real numbers for one's coefficient ring. As an\naid to one's intuition, one might consider that if one regards a differentiable singular\ncubic k-chain σk as a restriction of a k-dimensional submanifold in M then the kdimensional tangent space to σk can be represented by an equivalence class of\ndecomposable k-vector fields with compact support under multiplication by a scalar\nfunction on M.\nUnlike the exterior derivative operator, the divergence operator is not an antiderivation; i.e., one does not have δ(a ^ b) = δa ^ b + (−1)p a ^ δb, since # is not an\nisomorphism of exterior algebras. Hence, the exterior product does not \"descend to\nhomology\" to define a ring structure on H *dR ( M ) , as one obtains for de Rham\ncohomology.\nHowever, one should keep in mind that the vector space X(M) of vector fields on M\nhas a Lie algebra defined over it, and the divergence operator does have the property that\nthe Lie bracket of two 1-cycles is a 1-cycle; i.e., if δv = 0 and δw = 0 then δ[v, w] = 0.\nHence, the 1-cycles − or conserved currents − on M form a Lie subalgebra of X(M).\nIndeed, such vector fields are simply the infinitesimal generators of local volumepreserving diffeomorphisms of M, and the global volume-preserving diffeomorphisms\nform a Lie group. Although the Lie algebra on X(M) can be extended to a non-trivial Lie\nalgebra on Λ *(M) 5, whether this Lie algebra descends to homology to define a Lie\nalgebra on H*(M; R) is not entirely clear to the author .\n\n3 Topological field theories\n3.1 Charge, flux, and current\nCustomarily, one associates charge with a region of space either by way of a charge\ndensity function that is defined on the region or a total charge that is contained in the\n5\n\nSee the paper of Tulczyjew [7], which draws upon the work of Schouten [8] and Nijenhuis [9] on bilinear\nconcomitants.\n\n\f14\n\nregion. If we restrict ourselves to regions of space that can be described by the carrier of\na differentiable singular k-chain ck then if the association of total charge Q with chains is\nassumed to be linear, we can characterize Q as a differentiable singular cubic k-cochain,\nand write its value when applied to a k-chain ck as either Q[ck] or <Q, ck>.\nIn order to resolve this linear functional on k-chains into an integral functional, one\nmust define a k-form ρ that serves as the charge density k-form for the functional Q\nbecause, by definition:\nQ[ck] = ∫ ρ .\n\n(3.1)\n\nck\n\nWhen the k-form ρ is closed, the cochain Q[] will be vanish on any k-boundary, which\nwill make it a cocycle. Furthermore, if ρ is exact then Q[] will vanish on any k-cycle,\nwhich will make it a coboundary.\nOne can use the total charge functional to define a total charge k-chain Qk that\ncorresponds to any ck = ∑ ai σk,i by way of:\nQk = ∑ ai Q[σk,i ] σk,i .\n\n(3.2)\n\nIn other words, we are multiplying each component k-simplex by the total charge that is\ndistributed over it.\nOne can even apply this construction in the case where the total charge functional\ndoes not have a differential form as a kernel, such as a linear combination of\ncharacteristic functions for a finite set of k-simplexes. In particular, a set of N point\ncharges Qi, i = 1, ..., N whose points are described by N corresponding 0-simplexes σ0,i ,\ni = 1, ..., N can be associated with either the total charge 0-chain ∑ Qiσ0,i , or the total\ncharge 0-cochain ∑ Qiσ 0,i , in which σ 0,i (σ0,j) = δij.\nSuppose M is orientable, oriented, and given a choice of unit volume element ε. If we\nagree to call a vector field v with vanishing divergence a conserved current then it is\nnatural to question the physical meaning of its Poincaré dual #v. Since it is an n−1-form,\nit can be integrated over a compact orientable n−1-dimensional submanifold of M; more\nto the point, it can be integrated over a differentiable singular cubic n−1-chain cn−1. In\nphysics, it is customary to identify the resulting number:\nΦv[cn−1] = <#v, cn−1> = ∫\n\ncn−1\n\n#v\n\n(3.3)\n\nwith the total flux of v through cn−1 . From the previous considerations, is natural to\nidentify the n−1-form #v with the flux density of the vector field v. Hence, the linear\nfunctional Φv[] is an n−1-cochain. Furthermore, if we assume that v has zero divergence,\nthen #v is closed, and one has that the resulting linear functional Φv[] is a cocycle, since\nit clearly vanishes when cn−1 is a boundary. When v is the divergence of a bivector, Φv[]\nwill vanish whenever cn−1 is a cycle, and Φv[] will be a coboundary.\nOne generally tends to think of a current, such as electric current, as something that is\nrepresented by a divergenceless vector field J of the form ρv on a spatial region S of\ncompact support, where ρ is a density function (e.g., mass, charge, etc.) on S and v is a\n\n\f15\n\nvelocity vector field that describes the motion of the quantity whose density is described\nby ρ. Furthermore, although there is nothing to say that the current is not flowing in an\ninhomogeneous region where the conductance varies from point to point in such a way\nthat J is not spatially constant, nevertheless, the case of a current whose magnitude does\nnot vary spatially is also very physically meaningful, if only as the ideal case of a perfect\nconductor.\nFurthermore, the support S of a current might takes the form of a network – often,\njust a loop − with a finite number of branches bi, i = 1, ..., N and vertices vj, j = 1, ...., M,\nand an incidence law that associates them; i.e., a 1-dimensional simplicial complex 6.\nIf the current Ii in the branch bi is constant along the branch then one can give\nphysical meaning to the formal product Iibi. Since stable currents flow only in loops, one\ncan also specify that this complex be closed. Hence, the set {zl, l = 1, ..., L} of all\nelementary loops (i.e., not the sum of simpler loops) that can be formed from the\nbranches of the network define a set of generators for Z1(S; R). Moreover, since one\ngenerally presumes that none of the loops bound any two-dimensional region of space\nthat can still be described as belonging to the source – i.e., = 0 – one then also has that\nthe set {zl, l = 1, ..., L} represents a set of generators for H1(S; R). One must notice that,\nfrom a physical standpoint, the assumption that the 2-chains of G that are bounded by\nloops in S do not contribute to the source current breaks down when there are timevarying magnetic fields present.\nPhysically, charge and current are related concepts, since current is a time rate of flow\nof charge. One associates a charge Qj(t) – which we regard as a differentiable timevarying function − with each vertex vj by defining the total charge 0-cocycle Qj vj, where\nvj is the jth member of the reciprocal basis for C0(S; R) that is defined by vj(vj) = δ ij . One\nassociates a current Ii – which need only be a constant real number, for the present\npurposes − with each branch bi by forming the total current 1-cochain Ii bi , where bi is\nthe reciprocal basis to bi , along with the total current 1-chain:\nItot = ∑ I j b j .\n\n(3.4)\n\nj\n\nOne notes that the (singular) coboundary δvj of the vertex vj is:\n\nδvj = ∑ aij b j ,\n\n(3.5)\n\nj\n\nwhere the \"incidence matrix\" aij is defined by:\n±1 if ∂b j = ± v i\na = v (∂bj) = \n.\n 0 otherwise\ni\nj\n\n6\n\ni\n\n(3.6)\n\nFor an illuminating application of 1-dimensional homology to electric circuit theory, see Lefschetz [10].\n\n\f16\n\nWith these notations, we see that Kirchhoff's law of currents, which is equivalent to the\nconservation of charge, takes the purely cohomological form:\ndQi\n= <δvi, Itot> = <vi, ∂Itot>,\ndt\n\n(3.7)\n\nwhich gives the signed sum of the currents from the branches that have vi as one\nendpoint, and when the charge at any vertex is constant in time, the statement that the\nsum of the currents at that vertex is zero takes the form:\n0 = <δvi, Itot> = <vi, ∂Itot> .\n\n(3.8)\n\nHence, since this is true for all i, the 1-chain Itot is a 1-cycle.\nWe note, in passing, that this methodology can be applied directly to a system of\nmasses coupled by forces. If linear momentum plays the role of charge and force the role\nof current then the analogue of Kirchhoff's law of current (3.7) is Newton's second law\nof motion, while (3.8) describes the equilibrium state of the system.\nFor the sake of completeness, we point out that if one associates a differentiable timevarying potential function V(t) to each vertex and a potential difference ∆Vj to each\nbranch in a similar way then Kirchhoff's law of voltages, which is equivalent to\nconservation of energy, takes the form:\ndVk\n= <∆Vtot , ∂ck> = <δ∆Vtot , ck>,\ndt\n\n(3.9)\n\nin which – by abuse of notation − ck is a 1-chain. When the total energy is conserved,\none sees that the sum of the potential differences around any loop is zero; i.e., ∆Vtot is a 1cocycle.\n3.2 Charge and flux quantization\nSo far, we have been concerned only with homology and cohomology with coefficients in\na field, namely R. Since the electrical charge that is found in Nature is known to be\nreducible to a (generally very large) sum of elementary charges of magnitude ± e (unless\none includes quarks), one might prefer to regard any charge Q as being of the form Ze,\nwhere Z ∈ Z . As we have been using Q as a coefficient in various chains or cochains,\nthis suggests that at a fundamental level we should properly be using coefficients in the\nring Z. This has advantages and disadvantages, since homology with integer coefficients\nis richer in structure, because it can include torsion factors that disappear in real\nhomology, but such richness cannot usually be represented in terms of de Rham cycles or\ncycles.\nThe fundamental question to both physics and topology is: \"In what sort of field\ntheory is a reduction from R to Z canonical, in some sense?\" One finds that generally the\nintegrality of charges originates in homotopy considerations, which then imply\ncorresponding consequences in homology or cohomology.\n\n\f17\n\nWhenever one is evaluating a k-cocycle over a k-cycle that represents a simplicial\ndecomposition of a (diffeomorphic image of a) k-sphere in a manifold M, one must\nalways keep in mind that there might very well be more than one homotopy class of kspheres in M; i.e., one might have πk(M) ≠ 0. In particular, one might have πk(M) ≅ Z,\nwhere one might think of the integer that gets associated with each homotopy class as the\nwinding number of the map that takes Sk to its image in M.\nIn such a situation – for instance, when M = R3 – {0}, which has the same homotopy\ntype as S2 – the charge Q = <ρ, zk> that is associated with the generator [zk] of πk(M),\nnamely, the homotopy class that is associated with 1, takes on the character of a\nfundamental charge, such that all of the other charges will be integer multiples of Q.\nSince πk(Sk) ≅ Z for any k > 0, this is the most common way of trying to introduce\nintegrality into modern field theories, such as gauge field theories.\nOne can even think in terms of quantized – i.e., discrete – currents in some cases,\nsuch as the current in a conducting loop that consists of N turns of a wire that carries a\ncurrent I; i.e., a Z-cycle Nz1 would represent N copies of a current loop z1 and the\ncorresponding current cocycle would take the form NI.\n3.3 Topological field theories\nUltimately, the objective of any field theory should be to account for the coupling of the\ninformation in a field source to the information in the field itself. When one examines\nthe motivating examples for the sort of field that we shall a \"topological field theory\",\nsuch as electrostatics, one finds that the field equation for the field does not actually\ninvolve the source distribution explicitly, and that the role of the charge that is associated\nwith the field source is introduced only by way of the association of the total flux through\na surface with the total charge \"contained\" in the surface. Although this usually seems to\nfollow from Gauss's law, one finds that on closer inspection of the Coulomb case, it does\nnot follow in this way because, for one thing, Gauss's law is inapplicable when the\nsurface does not bound, and for another, direct calculation shows that the divergence of\nthe field is zero. Hence, the step at which one sets the volume integral of the divergence\nequal to the total charge is incorrect. Since this is equivalent to the equation δE = ρ, one\nsees that this equation is itself misleading, even when one sets ρ = Qδ0. Hence, our\nobjective is to reconstruct the overall effect of the misapplication of Gauss's law while\npaying careful attention to the topological details.\nFor the time being, we simply assume that we have an n-dimensional space or\nspacetime manifold M, a closed subset S of M that we call the set of source points, and\nits open complement G, which we call the set of field points. This implies that G will be\na submanifold of M of dimension n. Furthermore, we assume that G is dense in M: i.e.,\nM = G . This, and the fact that S = M − G, imply that S represents all of the non-generic\nlimit points of the set G. Hence, every neighborhood of a source point will contain a\nfield point.\n\n\f18\n\nAlong with the decomposition of M into G and S, we associate two spaces 7: a field\nspace Γ(G) and a space of source distributions $(S). What we will be defining as\ntopological field theories are field theories in which:\na) The closed set S is the carrier of a differentiable singular cubic k-cycle zk.\nb) The space of source distributions is Hk(S; R).\nc) The field space is Hm(G, R) for some m ≥ k.\nd) The coupling of one to the other takes the form of a linear isomorphism:\nHk(S; R) → Hm(G, R).\n\n(3.10)\n\nFor the sake of physics, restricting oneself to source complexes that can be expressed\nas homogeneous closed chains is not a severe restriction, since it at least includes the\ncommon elementary examples. For instance, S may be as elementary as a finite set of\nisolated points, which represents a zero-dimensional cycle, or perhaps a finite set of nonintersecting closed curves, which then represents a one-dimensional cycle. In the latter\ncase, we are including the possibility that the curves close \"at infinity,\" so we are\nassuming that the space in which the fields are defined is either compact or compactified\nby a point at infinity or a hyperplane at infinity. This is simply a different form of the\nusual physical requirement that a physical field must vanish at infinity. Furthermore, one\nmight have two-dimensional source complexes, which can represent surface charge\ndistributions or wave discontinuity surfaces, and even three-dimensional source\ncomplexes.\nHowever, since finite chains can only describe compact subspaces of M, one must\neither confine all of ones attention to compact restrictions of non-compact global\nconstructions – such as infinitely-extended lines and planes – or use only compactified\nM's. In the case of line and plane sources, one must remember that regarding them as\ninfinitely extended was a simplifying assumption to begin with since such things as real\nworld wires and capacitor plates are always finite in their extent, so regarding them as\ninfinite is just a way of neglecting the inhomogeneities at their boundaries. We shall see\nin a later section that generally the non-compact sources can be treated as homologically\nequivalent to corresponding compact sources.\nIn any event, by definition, a closed source complex S defines a homology class [S]∈\nHk(S; R). Hence, the space of source distributions consists of all possible total charge\nfunctionals that can be applied to the points of S; i.e., to the k-simplexes that triangulate\nit by way of zk. When S is more than zero-dimensional, these functionals can be defined\nby the restrictions of corresponding closed k-forms to S, which then represent possible\ncharge densities.\nIt might seem that a topological field theory is devoid of field equations in the usual\nsense of systems of partial differential equations, since we seem to be more concerned\nwith algebraic relationships between source cycles or cocycles and field cocycles.\nHowever, one must remember that in order to find a field that represents a de Rham mcycle, one must find an m-vector field whose divergence vanishes and to find a field that\n7\n\nAt this point, we are being casual and heuristic in our usage of the word \"space\" since what we are\nthinking in terms of is a space of sections of some appropriate fiber bundle, which might not be a vector\nbundle, as in the case of some nonlinear field theories, but we will not use the spaces $(S) and Γ(G) any\nfurther in the present study, anyway.\n\n\f19\n\nrepresents a de Rham k-cocycle, one must find a k-form whose exterior derivative\nvanishes. Hence, the differential equations of our field theory might generally take either\nthe form:\n\nδJ = 0\n\n(3.11)\n\nor the form:\ndφ = 0.\n\n(3.12)\n\n3.4 Field/source duality\nIn this section, we deal with the fourth axiom that we introduced above, which has the\neffect of coupling the total charge cocycle for a given source to associated total flux\ncocycle for the field that it generates. This axiom generalizes the usual association that is\nsupposed to result from the misapplication of Gauss's law to cycles that do not bound.\nHence, we will have to reconstruct its basic effect – of equating topological information\nin the field to topological information in the source − \"by hand,\" so to speak.\nOne should observe that the association of cohomology classes with other such\nclasses is quite broad in its scope as far as physical interpretations is concerned. In\nparticular, one is not associating particular charge densities with particular fields, at all,\nbut only large equivalence classes. For instance, as we shall discuss later in more detail,\nin the case of a single point source in R3 any total charge cocycle takes the form Q[δP],\nwhere Q ∈ R and [δP] is a generator for the one-dimensional vector space H0(S; R), and\nthe total flux cocycle takes the form Φ[Σ], where Φ ∈ R and [Σ] is a generator for the\none-dimensional vector space H2(G; R). The field/source duality can then be defined by\nthe association of [δP] with [Σ].\nOf course, there would be something unsatisfying and unconvincing about our\nsubstitute for the usual association of total flux and total charge if it were merely an ad\nhoc prescription. Hence, we need to look into the possibility that the field/source duality\nisomorphism might have some deeper topological roots than a mere coincidence of\ngenerators.\nFirst, we observe that something topologically interesting can happen when one puts\nfields and sources into complementary subspaces: things that might have been elementary\nwhen the two subspaces were together can become non-trivial when the pieces are\nseparated. For instance, although R2 is a contractible topological space, hence, its\nhomotopy and homology groups are trivial, the punctured plane has a non-vanishing\nfundamental group, as well as non-vanishing one-dimensional homology and\ncohomology, just as removing the origin from R gives it non-trivial homotopy and\nhomology in dimension zero. In general, removing the origin from Rn (n > 2) produces a\nspace that has Sn−1 as a deformation retract, which means that its first non-trivial\nhomotopy group is in dimension n−1, and by the Hurewicz isomorphism theorem (see\n[1]), πn−1(Sn−1) will be isomorphic to Hn−1(Sn−1). Moreover, they are both isomorphic to\nZ, so they both have one generator. Note that since the point that we removed has non-\n\n\f20\n\nvanishing cohomology only in dimension zero, which is also isomorphic to Z, we could\nonly expect to couple the generator of H0({0}; Z) to Hn−1(Rn – {0}; Z).\nAt an elementary level, one can always define a k-cycle that does not bound a k+1chain by starting with a k+1-simplex and removing the interior. Similarly, when one\nremoves a k+1-simplex σk+1 from Rn one produces a topological space whose homology\nmodule in dimension k has a generating homology class that is represented by any ksphere in Rn that projects inward onto ∂σk+1 . Hence, although the generators of Hk(M)\nare often loosely referred to as \"k-dimensional holes in M\" they are really more like the\nboundaries of such things.\nFurthermore, since any simplex is contractible to a point the space that is obtained by\nremoving σk+1 from Rn is homologically equivalent (i.e., isomorphic) to the one that\nobtained by removing the origin from Rn. Note that one could just as well have removed\nthe interior of an n-simplex, since ultimately the effect on homology was to introduce a\ngenerator in dimension n−1. We shall see that this is related to the fact that the external\nfield of a spherically symmetric charge distribution is the same as the field of a point\ncharge.\nIn order relate the topological information in the source complex to the topological\ninformation in the field complex, what we need to find is a natural way of bridging the\ngap that we create by separating the source points from the field points. As a heuristic\nmotivation, consider that in the example of the punctured plane the unit circle can be\nrepresented by a 1-cycle either in H1(R2, R) or in H1(G, R), but since H1(R2, R) = 0, it is\na boundary in R2, namely, the boundary of the unit disc about the origin, though it is not\na boundary in G, the punctured plane, since the region inside the unit sphere is no longer\na 2-chain because it is not compact.\nSuppose G has non-vanishing homology in dimension k. We then define a k-cycle zk\n∈ Zk(G; R) to be a partial k-boundary if it is a boundary in M, but it is not a boundary in\nG. The partial boundaries define a vector subspace of Zk(G; R) that we denote by Zk*(G;\nR). Our ongoing example of the unit circle in the punctured plane would be an example\nof a partial 1-boundary.\nLet zk be a partial k-boundary in G that bounds a k+1-chain ck+1 ∈ Zk+1(M; R) that has\nan m-cycle zm ∈ Zm(S; R) as a deformation retract. If the deformation retraction that\ntakes ck+1 to zm is denoted by r then we can describe this scenario by the following set of\nmaps:\n∂\nr\nzk ←\n ck +1 \n→ zm\nFor example, zk could be the unit sphere in R3, ck+1, the closed unit ball that it bounds,\nand zm, the origin. We shall call a k+1-chain such as ck+1 a connecting k+1-chain.\nWhen such a connecting chain exists, one has an association of partial k-boundaries in\nZk*(G; R) with m-cycles in Zm(S; R). Since that induces a corresponding homomorphism\nof Hm(S; R) into Hk(G; R), the key issue to address next is when that homomorphism is\nan isomorphism. Clearly, this is the case only if every homology class in Hk(G; R)\ncontains a partial boundary. Moreover, there must be a connecting k+1-chain between\nevery generator of Hk(G; R) and some generator of Hm(S; R) in an invertible manner.\nSince the general problem of finding connecting chains appears quite open-ended at this\npoint, in this study, we shall content ourselves to describing them for specialized\nsituations.\n\n\f21\n\nGiven an isomorphism of f: Hm(S; R) → Hk(G; R), in order to define an isomorphism\nof Hm(S; R) with Hk(G; R), one need only pull back the linear functionals on Hk(G; R) to\nlinear functionals on Hm(S; R) by way of f; i.e., f*: Hk(G; R) → Hm(S; R) is the desired\nisomorphism.\nIf we wish to take a direct route from Hk(G; R) to Hm(S; R), we need to first define a\npartial coboundary to be a real k-cocycle zk in M such that it is a coboundary in Hk(M;\nR), but not in Hk(G; R). A connecting cochain for a partial boundary zk ∈ Hk(G; R) and\nan m-cocycle zm ∈ Hm(S; R) is a k−1-cochain ck−1 ∈ Hk-1(M; R) such that zk = δck−1 and\nthere is a deformation retraction from ck−1 to zm .\n3.5 Equivalent field/source configurations\nSince the fundamental level at which we are coupling sources to fields is the level at\nwhich we are coupling the total flux cocycle that is associated with a field with the total\ncharge cocycle that is associated with its source, it is reasonable to define two\nsource/field configurations as being equivalent when the total flux cocycle for an\nanalogous field is associated with the total charge cocycle for the analogous source. In\nother words, if φ is a closed flux density k-form on G whose total flux k-cocycle is Φφ [.]\nand ρ is a closed charge density m-form on S whose total charge m-cocycle is Qρ[.] then\nunder an association of φ with a closed k-form φ′ on G′ and ρ with a closed m-form ρ′ on\nS′, if Φ φ [.] is associated with Qρ[.] to begin with, one must have that Φφ′ [.] is associated\nwith Qρ′ [.] as a consequence.\nSome equivalences are automatic, as consequences of the use of cohomology. For\ninstance, two homeomorphic source cycles zm and zm′ − i.e., their carriers − will also be\nhomotopically and homologically equivalent. Hence, we are not really concerned with\nthe locations of the source points in M or the overall geometrical shape of the source\ncycle.\nFurthermore, since field/source duality only associates cohomology classes, and not\ntheir representative cocycles, another automatic equivalence is that cohomologous field\nk-forms will define the same cohomology class, and similarly for cohomologous charge\ndensities.\nPhysically, what we are introducing in the form of homologous source complexes\nincludes the freedom to translate and deform the source complex in a fairly general way\nwithout altering anything fundamental in the definition of the field theory. However, one\nmust keep in mind that, in reality, physical field theories eventually have to introduce\nmore rigid sort of geometrical considerations, and one finds that the solution of the\nelectrostatic potential for a spherical boundary is computationally simpler than the\nsolution of the same problem for an ellipsoidal boundary, even if the two boundaries are\nhomologous. However, looking at that same situation in the reverse order, one realizes\nthat homology classes of field theories might sometimes contain \"canonical\"\nrepresentatives that are more elementary, in some physically useful sense, as with the\ndiagonalization of matrices or the representation of germs of singularities by low degree\npolynomials. This would seem to be a fundamental problem of topological field theory:\nto find the canonical elementary field theory that represents a class of more elaborate\nones.\n\n\f22\n\nA form of topological equivalence that is less automatic than those implied by\nhomology is when the result of a transformation a space is to produce a space of lower\ndimension, such as a deformation retraction onto a subspace. Indeed, in some of the\nelementary cases of field sources, it is necessary to perform such a retraction – usually a\nprojection – in order for the source distribution to be defined by a cocycle. In such a\ncase, since the homotopy type of the space does not change, and thus, the homology type\nremains the same, as well, one is essentially eliminating homotopically and\nhomologically superfluous non-compact dimensions by such a transformation.\nSome common examples of extended source distributions that one encounters in\nelementary field theory are lines, planes, solid tubes, and balls, all of which are\ncontractible to a point. However, one should remember to also perform the same\ntransformation on the rest of the space M, as well. In particular, one needs to transform\nG and its cocycles.\nFor instance, if the source is a line in R3 (say, the z-axis) and the field it produces is a\nradial vector field, so its total flux cocycle would be a 2-form, then the projection of R3\nonto the xy-plane is a deformation retraction (in a trivial way) that takes the source line to\na point and all cylinders that are coaxial with the source line to concentric circles about\nthe origin. Note that it is essential that the field produced by the line source be\nprojectable onto the xy-plane, which is really a statement about its symmetry, namely, its\nradial projection on the z-axis must vanish. Hence, a line source and cylindrically\nsymmetric field in R3 are equivalent to a point source in the plane with a radially\nsymmetric field. The advantage of the latter representation is that by eliminating the\nnoncompact dimension, we have reduced our source to a cycle (in dimension zero) and\nour total flux functional to a cocycle (in dimension one). Indeed, before the reduction the\ntotal charge on the line and total flux through a coaxial cylinder diverged.\nWhen one has a plane source in R3 (say, yz-plane), one can contract it to the origin by\na projection onto the x-axis. As long as the vector field it produces is projectable – i.e., it\nis parallel to the x-axis at every point – this source/field configuration is equivalent to a\npoint source at the origin of the real line and a vector field on it.\nWe illustrate the equivalent configurations for line and plane sources in R3 in Figure\n4, in which the field is denoted by E.\nE(r)\nE(r)\n\nλ\n\nS r1\n\n≅\n\nλ{0}\n\nE(x)\n\nσ\n≅\n\nE(x)\n\nσ{0}\n\nFigure 4. Equivalent field/source configurations for line and plane sources in R3.\n\n4 Physical examples\n4.1 Static electric fields\n\n\f23\n\nOf course, this class of fields includes the canonical example that motivated a lot of the\nabstractions that were made above, namely, the central-force vector field on R3 :\nE(r, φ, θ) =\n\n1 Q\n∂r ,\n4π r 2\n\n(4.1)\n\nin which Q is a real number that we assume to represent a source charge or mass, r is the\nEuclidian distance of the chosen point (r, φ, θ) from the origin [= (x2 + y2 + z2)1/2], and ∂r\n= ∂/∂r is the radial unit vector field.\nThe first thing to observe is that the field is not defined at the origin, so the carrier of\nour singularity complex S is simply {0} and our generic point set G is R3 – {0}. Of\ncourse, S has non-trivial de Rham cohomology only in dimension zero, namely, H0(S; R)\n= R; we shall denote the 0-cocycle that generates H0(S; R) by δ0, and the general element\nof H0(S; R) then takes the form Qδ0, where Q ∈ R. As a linear functional on 0-cycles, δ0\ntakes the basic 0-cycle δ0, which takes 0 to {0}, to 1.\nSince G has S2 as a deformation retract, it will have non-trivial de Rham cohomology\nin dimension two, namely, H2(G; R) = R. We use the volume element on the unit sphere:\n\nε2 = sin θ dφ ^ dθ,\n\n(4.2)\n\nas a typical representative closed 2-form for the generating de Rham cohomology class in\nH2(G; R); i.e., a basis vector for the vector space. The associated linear functional on 2cycles takes a 2-cycle to its volume when one uses ε2:\n\nδ2[z2] = ∫ ε 2 .\nz2\n\n(4.3)\n\nIn order to define the source/field duality isomorphism between H0(S; R) and H2(G;\nR), we could simply associate δ0 with δ2 and extend by linearity, but we prefer to induce\nthe isomorphism by way of a connecting 3-chain in C3(R3; R).\nLet B(R) be the closed ball of radius R about the origin. It can be represented as a\ndifferentiable singular cubic 3-simplex in R3 whose boundary is a 2-cycle in H2(G; R),\nand which is contractible to the 0-cycle δ0. Hence, B(R) will serve as a connecting 3chain between the sphere of radius R centered at {0} and {0} itself. Next, we need to\nshow how that will imply the association of the total flux 2-cocycle ΦE ∈ H2(G; R) with\nthe total charge 0-cycle Qδ0 ∈ H0(S; R).\nIn order to compute the total flux of E over ∂B(R), we first specify the volume\nelement on R3 – {0} in spherical coordinates (r, φ, θ):\n\nε3 = r2 sin θ dr ^ dφ ^ dθ,\n\n(4.4)\n\nso we obtain, from Poincaré duality:\n#E = Q sin θ dφ ^ dθ ,\n\n(4.5)\n\n\f24\n\nand the total flux of E over the boundary sphere becomes:\nΦE[∂B(R)] = ∫\n\n∂B ( R )\n\n# E = Q.\n\n(4.6)\n\nSince we also have:\nQδ0(δ0) = Q,\n\n(4.7)\n\nwe clearly have the desired equality of total flux through the 2-sphere with the total\ncharge at the source point.\nWhen we take exterior derivative of #E, we get zero:\nd#E = Q cos θ dθ ^ dφ ^ dθ = 0 .\n\n(4.8)\n\nHence, #E is a closed 2-form on G; i.e., a de Rham 2-cocycle. One also has, as a\nconsequence:\n\nδE = 0 ,\n\n(4.9)\n\nwhich says that E is a de Rham homology 1-cycle.\nActually, equation (4.9) is not sufficient to define the vector E, since Helmholtz's\ntheorem, which is really a corollary to the Hodge decomposition theorem, says that any\nvector field on a Riemannian manifold can be decomposed into a solenoidal part, which\nwould satisfy (4.9), and an irrotational part. In order to make this last condition precise,\none must assume that the spatial manifold – R3, in this case – is given a Riemannian\nmetric g. Although relativistic electrodynamics would usually regard such a construction\na projected artifact of the assumption of a Lorentzian structure on the spacetime manifold\nM, if one takes the \"pre-metric\" view of electromagnetism, which we discuss below, the\nspatial Riemannian structure is the real part of a complex orthogonal structure on Λ2(M)\nthat is due to the electromagnetic constitutive properties of spacetime.\nSuch a metric gives one an isomorphism of T(R3) with T*(R3), which can also be\nregarded as an isomorphism of Λ1(R3) with Λ1(R3) that takes the vector field E to the 1form\nE = iEg,\n\n(4.10)\n\nwhich is assumed to satisfy:\ndE = 0 .\n\n(4.11)\n\nHence, one assumes that the isomorphism that g defines also takes the de Rham 1-cycle E\nto the de Rham 1-cocycle E.\nWhen one considers static electric fields that are due to line sources, plane sources,\nand solid sources, one must consider that often the sources, as defined, are not\nrepresentable as chains, much less cycles. For instance, a line in Rn or even an open line\n\n\f25\n\nsegment of finite length is not a 1-chain, and a plane or an open plane segment of finite\narea is not a 2-chain. Closing the finite regions with endpoints or boundaries would make\nthe regions expressible as chains, but not cycles. Hence, we must look for equivalent\nfield/source configurations for which the field is a cocycle and the source is a cycle;\nindeed, this is really what one is taught to do at the elementary level.\nFor the line source, one uses the cylindrical symmetry of the field/source\nconfiguration to define the predictable deformation retraction of R3 to R2 by projecting\nonto the xy-plane. (Of course, we assume that the line source is along the z-axis.) If we\ncall the projection r and refer to the inclusion of R2 in R3 as (x, y, 0) by i then the\nhomotopy that takes the identity map to i ⋅ r is contraction along the z-axis: (x, y, z) ֏\n(x, y, sz), s ∈ [0, 1]. The line source then contracts to a point source λ{0} at the origin –\ni.e., a 0-cycle – and the vector field E projects to its restriction on R2 – {0}. In these\nexpressions, λ is the linear charge density and we had to assume that E had the radial\nsymmetry about the z-axis that made it projectable onto the xy-plane.\nHence, the equivalent field source configuration is a point source of charge λ at the\norigin and a vector field E that is defined on G = R2 – {0}, so the situation is similar to\nthe point charge in R3, except for the dimension. The total charge 0-cocycle Q = λδ0 and\nthe total flux 1-cycle ΦE associated with E is represented by the closed 1-form:\n#E =\n\nλ\ndθ .\n2π\n\n(4.12)\n\nAny circle of radius r that is centered at the origin will serve as a partial 2-boundary\nz2 in G, such that the closed disc of radius r that it bounds in R3 is the connecting 3-chain\nin R3 that is contractible to the source 0-cycle. Equating the value of ΦE when evaluated\non z2 with the value of Q when evaluated on δ0 gives a 1/r dependency for the resulting E\nfield:\nλ ∂\nE(r, θ) =\n.\n(4.13)\n2π r ∂r\nIn the case of the plane source (we use the yz-plane for specificity) of constant surface\ncharge density σ, one uses symmetry to project r: R3 → R, (x, y, z) ֏ (x, 0, 0), so the\nhomotopy from the identity on R3 to i ⋅ r takes (x, y, z) to (x, sy, sz), s ∈ [0, 1].\nThe equivalent field/source configuration is then a source of charge σ at {0} on R and\nan E field that is defined on G = R – {0}. Hence, the total charge 0-cocycle is simply\nσδ0 and the total flux 1-cycle associated with E is represented by the closed 0-form:\n#E = σ .\n\n(4.14)\n\nThe partial boundaries in R – {0} that one uses are \"0-spheres of radius r centered at\n{0},\" namely the pairs of points at ± r. The connecting 1-chain in R is the closed interval\n[−r, +r]. Since there are two points in the partial boundary, the resulting E field is:\n\n\f26\n\nE(x) = ±\n\nσ ∂\n2 ∂x\n\n,\n\n+\nsgn(E) = \n−\n\nx>0\n,\nx<0\n\n(4.15)\n\nNote that in this case, the singularity at {0} takes the form of a finite jump\ndiscontinuity, instead of a pole.\n4.2 Static magnetic fields\nThere are some fundamental differences between static magnetic fields and static electric\nfields:\na. Although a transient magnetic field can have an \"open circuit\" for a circuit, a\nstable magnetic field must have a constant current for a source, which can only exist in a\nconducting loop; i.e., the source complex S must be a 1-cycle I1 = Iδ1, in which we are\nrepresenting the current in the loop by the real number I and δ1 ∈ H1(S; R), which is the\n\"fundamental 1-cycle\" that represents the orientation of the loop in singular homology,\njust as a choice of non-zero tangent vector field would in de Rham homology.\nb. The magnetic field strength is most directly represented as a covector field B; i.e.,\na 1-cochain B ∈ C1(G; R), instead of a vector field. This is due to the fact that the form\nof Stokes's theorem that one uses is the two-dimensional Ampèrian form, so the\nfundamental integral involves a 1-form on G and a 1-cycle z1 in G, namely:\n<B, z1> = ∫ B ,\n\n(4.16)\n\nz1\n\nwhich one calls the magnetomotive force 8 (mmf) around z1, instead of the total flux of a\nvector field through a surface.\nc. Since B is a 1-form, the conventional equation that couples B with I, namely, dB =\n4π #I, involves d directly, not δ, and also suggests that B does not define a cohomology\nclass when I ≠0. However, we are confronting a variation of the situation in the previous\nsection, because when one (naively) applies Ampère's law to B and I when z1 = ∂D2,\nwhere the 2-chain D2 is a disc of radius r in R3 that δ1 intersects transversely:\n<B, ∂D2> = <dB, D2> = <#I, D2> = <δ1, I1> = I ,\n\n(4.17)\n\none finds that the resulting magnetic field (when the source current loop has a sufficiently\nlarge radius compared to r) has the form:\nB(r) =\n\nI\n\n2π r\n\nds =\n\nI\ndθ ,\n2π\n\n(4.18)\n\nin which ds = r dθ is the arc-length 1-form. This gives:\ndB = 0.\n8\n\n(4.19)\n\nThe use of the word \"force\" is actually a misnomer, since the units of the quantity are work done per unit\nmagnetic \"charge.\"\n\n\f27\n\nHence, since B(r) is not defined at the center of D2 , Stokes's theorem is inapplicable,\nand the association of <B, ∂D2> with I in (4.17) is by definition, not by consequence.\nBasically, we are back to the previous situation for the electric field of a line source,\nexcept that the 1-cocycle B is tangent to the boundary of D2 , not normal, and the source\nis the 0-cycle that is defined by intersection of δ1 with D2 , not a contraction of δ1.\n4.3 Dynamic fields and inductive couplings\nIn this section, we are really addressing a situation for which the machinery that we have\nbeen developing for topological field theories is no longer applicable, because the source\nof one field does not have a cycle for its carrier, but a chain ck with boundary. In\nparticular, the source of one field αk−1 ∈ Λk−1(∂ck) defined on ∂ck will be a function of the\nother field βk ∈ Λk(ck) that is defined on ck . The level at which they are coupled is their\nevaluations:\n<αk−1, ∂ck > = F(<βk, ck >).\n\n(4.20)\n\nOf course, in this case Stokes's theorem applies, so we can also say that:\n<dαk−1, ck > = F(<βk, ck >).\n\n(4.21)\n\nand if this is true for all ck then we can say that:\ndαk−1 = F′(βk)\n\n(4.22)\n\nfor some other function F′. Hence, we see that the k−1-form αk−1 is generally not closed,\nand therefore will not define a de Rham cohomology class, but only a k−1-cochain.\nOf course, the motivating examples for the present situation are defined by\nelectromagnetic induction. Faraday's law couples the electromotive force around a\n(bounding) 1-cycle z1 = ∂c2 in R3 to the time derivative of the total magnetic flux through\nc2:\n<E, ∂c2> = <dE, c2> = −\n\nd\n<B, c2> .\ndt\n\n(4.23)\n\nConversely, Maxwell's law of induction couples the magnetomotive force around z1 to\nthe time derivative of the total electric flux through c2:\n<B, ∂c2> = <dB, c2> = +\n\nd\n<E, c2> .\ndt\n\n(4.24)\n\nNote the differing signs between (4.23) and (4.24); without this, there would be no\nelectromagnetic waves.\n\n\f28\n\n4.4 Topological electromagnetism\nSo far, we have considered three-or-less-dimensional spaces in which static electric and\nmagnetic fields were defined, and then suggested that topological methods broke down\nfor time-varying fields due to the non-conservation of energy in the loops; i.e., the fact\nthat they bounded 2-chains through which time-varying field fluxes were defined. This is\nnot entirely accurate, since the restriction to dimension three or less is a sign of\nincompleteness in the model, as far as relativistic electrodynamics is concerned.\nIf we go to the four-dimensional spacetime M that relativity suggests then we can\nreformulate the problem of source/field duality quite simply. Although the usual\nrelativistic formulation of electromagnetism uses a Lorentzian structure on the tangent\nbundle T(M), since we are discussing topological electromagnetism, we shall regard the\nreduction of the bundle of linear frames to the bundle of Lorentzian frames as a\nconsequence of the electromagnetic structure of spacetime, not a prerequisite for it.\nThis is in the spirit of pre-metric electromagnetism (see [11-13]), in which a more\nfundamental role is played by the introduction of a unit-volume element ε ∈ Λ4(M) on\nT(M), which we naturally assume to be orientable, and a linear electromagnetic\nconstitutive law κ: Λ2(M) → Λ2(M). This represents a field of isomorphisms from 2forms at each point of M to bivectors at the same point. When one composes these\nisomorphisms with the Poincaré duality isomorphism #: Λ2(M) → Λ2(M) that comes from\nε, one gets an automorphism of Λ2(M) that, by hypothesis, differs from an automorphism\n* of Λ2(M) that has the property *2 = − I only by a non-zero scalar multiple at each point.\nThe latter automorphism basically gives us what the Hodge duality isomorphism\nwould have given us if we had introduced a Lorentzian structure, but only for 2-forms. It\nalso defines an almost-complex structure on Λ2(M) that makes each fiber non-canonically\nC-isomorphic to C3. The group of linear transformations of fibers of Λ2(M) that preserve\nboth the linear electromagnetic structure and the unit-volume element – hence, the\nalmost-complex structure – is isomorphic to GL(3; C). The unit-volume element on T(M)\ncan be used to define a unit-volume element on Λ2(M), which then allows one to reduce\nthe group to SL(3; C). One can then use ε and * to define a complex orthogonal structure\non Λ2(M), which then allows a reduction to SO(3; C), which is isomorphic to the identity\ncomponent of the Lorentz group, viz., the proper orthochronous Lorentz group. Hence,\noriented, time-oriented Lorentzian frames in the tangent spaces to M are in one-to-one\ncorrespondence with oriented complex orthogonal 3-frames in the fibers of Λ2(M). This\nis basically the point at which pre-metric electromagnetism rejoins the metric version.\nHence, we assume that our four-dimensional spacetime M has a unit-volume element\nε on its tangent bundle and an almost-complex structure on its bundle of 2-forms. As far\nas topological things are concerned, it is more directly useful to define isomorphisms on\nthe exterior algebras over T(M) and T*(M) themselves, rather than start with\nisomorphisms on T(M) and T*(M) and then induce isomorphisms in the tensor algebra, as\nis usually done in metric differential geometry.\nThe kind of differential geometry that deals with the bundle of 2-forms as\nfundamental, rather the tangent bundle, is called line geometry [14], which is a special\ncase of projective differential geometry. This is because, under the Plücker embedding of\nRP5 in PΛ2(R4), a line in RP5 (which is also a 2-plane in R6) maps to an equivalence class\nof decomposable bivectors that differ by a non-zero real scalar. The set of all these\n\n\f29\n\ndecomposable bivectors defines a quadric hypersurface in PΛ2(R4) that is called the Klein\nquadric. However, considering the central role that is played by the almost-complex\nstructure *, one should also look at the complex version of this embedding, which takes a\npoint in CP2 to an equivalence class of non-zero decomposable bivectors that differ by a\nnon-zero complex scalar, which is just the projective equivalence of CP2 with complex\nlines through the origin in Λ2(R4), when it is given a complex structure.\nAs far as the topological considerations are concerned, we first formulate the premetric Maxwell equations as:\ndF = 0,\n\nδh = J,\n\nh = κ(F).\n\n(4.25)\n\nIn these equations, F ∈ Λ2(M) is the Minkowski 2-form of electromagnetic field\nstrengths, h ∈ Λ2(M) is the bivector field of electromagnetic excitations, and J is the\nsource current for the field h, and consequently F.\nAs a consequence of the field equations, J has the property that:\n\nδJ = 0.\n\n(4.26)\n\nHence, we see that J defines a de Rham 1-cycle.\nSince one of the Maxwell equations says explicitly that F is a de Rham 2-cocycle, we\nsee that we are indeed looking at the topological field theoretic situation that we have\nbeen discussing up till now.\n4.5 Fluid flow\nSince an incompressible fluid in steady-state flow is governed by the same equations as a\nstatic electric field – i.e., the vanishing of a divergence – we shall only summarize the\ndetails of the analogy in this section.\nThe fundamental field that one is concerned with is the fluid flow velocity vector\nfield v. Since we are assuming steady-state flow, it can be defined as a vector field with\ncompact support in R3. To say that the flow is incompressible is to say that the volume\nelement ε is constant along the flow of v. Hence, the Lie derivative of ε with respect to v\nvanishes:\n0 = Lvε = divε = d#v = #δv.\n\n(4.27)\n\nSince # is an isomorphism, Lvε = 0 iff δv = 0.\nHence, the flow velocity vector field behaves just like E for our present purposes.\nThe curves that have v for their tangent vectors are called streamlines, as opposed to the\nfield lines that one associates with E.\nThe analogues of charge distributions that represent the sources (and sinks) of v are\nregions of space, which will be the S of this scenario, in which fluid mass is being\nintroduced or taken away from the region in which v is defined, which is what G amounts\nto. Usually, this takes the form of a channel or tank in practical fluid flow models. A\npoint source/sink is really an approximation to a tube of small diameter when compared\nto the dimensions of the tank or channel.\n\n\f30\n\nOne also has a close analogy between the theory of steady-state fluid vortices and\nstatic magnetic fields. The flow velocity vector field v, or rather, its covelocity 1-form v\n= ivδ, plays the role of the magnetic vector potential field A and its vorticity 2-form Ω =\ndA plays the role of B. (Here, δ refers to the Euclidian scalar product on R3.) The\nanalogue of an electric source current along a curve is called a vortex filament. As with\nmagnetic fields, one often formulates the field theory as two-dimensional with a point\nsource.\nOne can even extend the analogy between fluid flow and electromagnetism to an\nanalogy between relativistic hydrodynamics (see [15, 16]) and Maxwell electrodynamics.\nOne starts with either the relativistic fluid flow covelocity 1-form u or the energymomentum 1-form p as the analogue of the electromagnetic potential 1-form, which\nimplies that the timelike component of covelocity or energy-momentum is analogous to\nthe electric charge density and the spacelike velocity or momentum 1-form is analogous\nto the magnetic vector potential 9. The 2-form du is referred to as the kinematical\nvorticity and the 2-form dp as the dynamical vorticity. In a 1+3 decomposition of these\n2-forms, the electric part of the 2-form describes a form of linear acceleration or force,\nrespectively, and the magnetic part describes either the angular velocity or the angular\nmomentum, respectively.\n4.6 Weak-field gravitation\nFor centuries, it has been accepted that there is a formal analogy between the theory of\nstatic weak-field (i.e., Newtonian) gravitational fields and static electric fields, although\nthe difference between the character of the respective forces (i.e., how the signs of the\ncharges/masses determine whether the force is one of attraction or repulsion) is\nperplexing considering that nobody has experimentally isolated any negative masses to\nestablish whether they actually attract or repel the more conventional positive masses.\nThe basis for the analogy is that the gravitational acceleration vector field g obeys\nequations of the same form as the field equations for the electric field strength vector\nfield E when the source charge distribution ρ is static, namely:\ndg = 0,\n\nδg = ρ .\n\n(4.28)\n\nIn these equations, g = igδ is the metric-dual gravitational co-acceleration 1-form, relative\nto the Euclidian scalar product δ on R3, and ρ is the mass density distribution.\nAs a result of this analogy, all of the discussion that related to electrostatics as a\ntopological field theory has a direct analogue in the static gravitational context. In\nparticular, when the source distribution is a point mass m the field g is defined only on G\n= R3 – {0} and one has that δg = 0, so g defines a de Rham 1-cycle on G and m defines a\nsingular 0-cycle. The Poincaré dual 2-form #g then defines a mass flux density whose\nintegral over a 2-cycle will equal m, despite the vanishing of the divergence of g.\n\n9\n\nThis suggests an interesting analogy between gauge invariance and the relativity of velocity. In effect, the\nkinematical or dynamical vorticity 2-form takes on the physically fundamental role and a choice of\ncovelocity or energy-momentum 1-form, resp., involves a choice of \"gauge\", which would be an\nirrotational covelocity or energy-momentum 1-form, resp.\n\n\f31\n\nAn intriguing possibility that has been investigated almost since the earliest days of\nMaxwellian electrodynamics is that the analogy between weak-field gravitation and\nelectrostatics actually extends to an analogy between dynamic gravitational fields and\nMaxwellian electrodynamics. The key to extending the analogy would the establishment\nof a \"gravito-magnetic\" field h that would be associated with a mass current vector field\np = ρv – i.e., a momentum density vector field – in the same way that the magnetic field\nB (or H) is associated with an electric charge current vector field. The main obstacle to\nestablishing \"gravito-electromagnetism\" (see [17] for a survey of the issues) is the fact\nthat even for the much more powerful electromagnetic interaction the forces that derive\nfrom the existence of a magnetic field induced by the motion of electric charges are\ngenerally much weaker than the electrostatic forces, and the gravitational analogue of the\nelectrostatic force is quite weak to begin with. A compelling direction of investigation\nfor exhibiting this force as something that occurs in Nature is the possibility that the\ngravito-magnetic field of a spiral galaxy might account for the anomalous behavior of its\nangular velocity versus distance from the center curve without the necessity of\nintroducing a new form of matter − viz., dark matter − that has not been observed in any\nother context 10. Similarly, it might play an important role in the dynamics of the Big\nBang. Indeed, it seems clear that a force as weak as the gravito-magnetic force would\nonly become noticeable for enormous mass currents of astrophysical proportions.\n5 Discussion\nOne of the differences between the role of singularities in physics and their role in\nmathematics is that mathematics has the freedom to postulate the character of its\npathologies, whereas physics is ultimately at the mercy of the limits of experimental\nresolution to document them. Hence, since the interior of a singular region of physical\nspace always has some element of enigma to it, one needs to have a compelling reason to\nextend one's theoretical model beyond the limits of experiment.\nCommonly, one reasons by analogy, but, it often helps to also have some sort of\n\"eversion\" principle that allows one to associate the phenomena that transpire inside the\nregion with the phenomena outside of it. For instance, one models the interior of the\nEarth on the basis of the way that it refracts, reflects, and disperses seismic waves that\noriginate on the surface. Field/source duality is an attempt at associating at least the\ntopological information inside of a singular region of space with corresponding\ninformation that is manifest in the exterior region.\nAlthough it may seem restricted to only those physical fields that have sources\nconsisting of points at which the field is undefined or discontinuous in one of its\nderivatives, this is not as severe a restriction as it may sound. Indeed, one suspects that\nthis is the nature of the most fundamental level of field sources.\nThere is more that must be learned about the purely mathematical problem of the\nstructure of manifolds that admit such a duality. From the examples given above, it is\ncertainly present whenever the generators of the homology or cohomology in some\ndimension were created by the simple act of removing a set of open disjoint balls of that\n\n10\n\nThis possibility was suggested by Lowell Cummings in unpublished work.\n\n\f32\n\ndimension. One naturally inquires whether this is the only way that the connecting\nchains come about.\nIn a subsequent study the further consequences of regarding field sources as being\nmore specifically topological obstructions to the integrability of the field equations will\nbe investigated.\n\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n\nR. Bott and L. Tu, Differential Forms in Algebraic Topology (Springer, Berlin, 1982).\nM. Greenberg, Lectures on Algebraic Topology (Benjamin-Cummings, Boston, (1967).\nJ. Rotman, An Introduction to Algebraic Topology (Springer Verlag, Berlin, 1988).\nJ. Vick, Homology Theory (Academic Press, New York, 1973).\nW.S. Massey, Algebraic Topology: An Introduction (Springer, Berlin, 1967).\nG. de Rham, Differentiable Manifolds (Springer, Berlin, 1984).\nW. Tulczyjew, Bull. Acad. Polon. Sci., 22, 937-942 (1974).\nJ. A. Schouten, Proc. Kon. Ned. Akad. Wet. Amsterdam 43, 449-452 (1940).\nA. Nijenhuis, Proc. Kon. Ned. Akad. Wet. Amsterdam A55, 449-452 (1955).\nS. Lefschetz, Applications of Algebraic Topology (Springer, Berlin, 1975).\nD.H. Delphenich, Ann. d. Phys. (Leipzig) 14 347 (2005), and hep-th/0311256.\nD.H. Delphenich, gr-qc/0412048.\nF. W. Hehl and Y. Obukhov, Foundations of Classical Electrodynamics (Birkhäuser, Boston, 2003).\nV. Hlavaty, Differential Line Geometry (Noordhoff, Groningen, 1953).\nA. Lichnerowicz, Théorie relativiste de la gravitational et de l'electromagnetisme (Masson and Co.,\nParis, 1955).\nB. Carter, gr-qc/9907039.\nB. Mashoon, gr-qc/0311030.\n\n\f"}