{"id": "http://arxiv.org/abs/hep-th/0208076v1", "guidislink": true, "updated": "2002-08-10T15:45:19Z", "updated_parsed": [2002, 8, 10, 15, 45, 19, 5, 222, 0], "published": "2002-08-10T15:45:19Z", "published_parsed": [2002, 8, 10, 15, 45, 19, 5, 222, 0], "title": "Supersymmetric Gauge Theories, Vortices and Equivariant Cohomology", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0208079%2Chep-th%2F0208086%2Chep-th%2F0208024%2Chep-th%2F0208100%2Chep-th%2F0208232%2Chep-th%2F0208026%2Chep-th%2F0208051%2Chep-th%2F0208046%2Chep-th%2F0208197%2Chep-th%2F0208084%2Chep-th%2F0208001%2Chep-th%2F0208151%2Chep-th%2F0208112%2Chep-th%2F0208216%2Chep-th%2F0208002%2Chep-th%2F0208142%2Chep-th%2F0208065%2Chep-th%2F0208167%2Chep-th%2F0208138%2Chep-th%2F0208088%2Chep-th%2F0208061%2Chep-th%2F0208231%2Chep-th%2F0208080%2Chep-th%2F0208163%2Chep-th%2F0208106%2Chep-th%2F0208164%2Chep-th%2F0208176%2Chep-th%2F0208168%2Chep-th%2F0208056%2Chep-th%2F0208119%2Chep-th%2F0208069%2Chep-th%2F0208093%2Chep-th%2F0208076%2Chep-th%2F0208092%2Chep-th%2F0208008%2Chep-th%2F0208107%2Chep-th%2F0208200%2Chep-th%2F0208184%2Chep-th%2F0208155%2Chep-th%2F0208006%2Chep-th%2F0208187%2Chep-th%2F0208095%2Chep-th%2F0208040%2Chep-th%2F0208156%2Chep-th%2F0208070%2Chep-th%2F0208157%2Chep-th%2F0208091%2Chep-th%2F0208117%2Chep-th%2F0208009%2Chep-th%2F0208169%2Chep-th%2F0208007%2Chep-th%2F0208010%2Chep-th%2F0208217%2Chep-th%2F0208212%2Chep-th%2F0208144%2Chep-th%2F0208220%2Chep-th%2F0208063%2Chep-th%2F0208013%2Chep-th%2F0208161%2Chep-th%2F0208099%2Chep-th%2F0208209%2Chep-th%2F0208036%2Chep-th%2F0208149%2Chep-th%2F0208125%2Chep-th%2F0208111%2Chep-th%2F0208074%2Chep-th%2F0208137%2Chep-th%2F0208071%2Chep-th%2F0208072%2Chep-th%2F0208020%2Chep-th%2F0208146%2Chep-th%2F0208145%2Chep-th%2F0208034%2Chep-th%2F0208204%2Chep-th%2F0208152%2Chep-th%2F0208098%2Chep-th%2F0208180%2Chep-th%2F0208207%2Chep-th%2F0208198%2Chep-th%2F0208096%2Chep-th%2F0208219%2Chep-th%2F0208230%2Chep-th%2F0208154%2Chep-th%2F0208032%2Chep-th%2F0208213%2Chep-th%2F0208027%2Chep-th%2F0208192%2Chep-th%2F0208183%2Chep-th%2F0208122%2Chep-th%2F0208179%2Chep-th%2F0208135%2Chep-th%2F0208075%2Chep-th%2F0208211%2Chep-th%2F0208014%2Chep-th%2F0208115%2Chep-th%2F0208174%2Chep-th%2F0208206%2Chep-th%2F0208067%2Chep-th%2F0208159%2Chep-th%2F0208218%2Chep-th%2F0208210&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Supersymmetric Gauge Theories, Vortices and Equivariant Cohomology"}, "summary": "We construct actions for (p,0)- and (p,1)- supersymmetric, 1 <= p <= 4,\ntwo-dimensional gauge theories coupled to non-linear sigma model matter with a\nWess-Zumino term. We derive the scalar potential for a large class of these\nmodels. We then show that the Euclidean actions of the (2,0) and\n(4,0)-supersymmetric models without Wess-Zumino terms are bounded by\ntopological charges which involve the equivariant extensions of the Kahler\nforms of the sigma model target spaces evaluated on the two-dimensional\nspacetime. We give similar bounds for Euclidean actions of appropriate gauge\ntheories coupled to non-linear sigma model matter in higher spacetime\ndimensions which now involve the equivariant extensions of the Kahler forms of\nthe sigma model target spaces and the second Chern character of gauge fields.\nThe BPS configurations are generalisations of abelian and non-abelian vortices.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-th%2F0208079%2Chep-th%2F0208086%2Chep-th%2F0208024%2Chep-th%2F0208100%2Chep-th%2F0208232%2Chep-th%2F0208026%2Chep-th%2F0208051%2Chep-th%2F0208046%2Chep-th%2F0208197%2Chep-th%2F0208084%2Chep-th%2F0208001%2Chep-th%2F0208151%2Chep-th%2F0208112%2Chep-th%2F0208216%2Chep-th%2F0208002%2Chep-th%2F0208142%2Chep-th%2F0208065%2Chep-th%2F0208167%2Chep-th%2F0208138%2Chep-th%2F0208088%2Chep-th%2F0208061%2Chep-th%2F0208231%2Chep-th%2F0208080%2Chep-th%2F0208163%2Chep-th%2F0208106%2Chep-th%2F0208164%2Chep-th%2F0208176%2Chep-th%2F0208168%2Chep-th%2F0208056%2Chep-th%2F0208119%2Chep-th%2F0208069%2Chep-th%2F0208093%2Chep-th%2F0208076%2Chep-th%2F0208092%2Chep-th%2F0208008%2Chep-th%2F0208107%2Chep-th%2F0208200%2Chep-th%2F0208184%2Chep-th%2F0208155%2Chep-th%2F0208006%2Chep-th%2F0208187%2Chep-th%2F0208095%2Chep-th%2F0208040%2Chep-th%2F0208156%2Chep-th%2F0208070%2Chep-th%2F0208157%2Chep-th%2F0208091%2Chep-th%2F0208117%2Chep-th%2F0208009%2Chep-th%2F0208169%2Chep-th%2F0208007%2Chep-th%2F0208010%2Chep-th%2F0208217%2Chep-th%2F0208212%2Chep-th%2F0208144%2Chep-th%2F0208220%2Chep-th%2F0208063%2Chep-th%2F0208013%2Chep-th%2F0208161%2Chep-th%2F0208099%2Chep-th%2F0208209%2Chep-th%2F0208036%2Chep-th%2F0208149%2Chep-th%2F0208125%2Chep-th%2F0208111%2Chep-th%2F0208074%2Chep-th%2F0208137%2Chep-th%2F0208071%2Chep-th%2F0208072%2Chep-th%2F0208020%2Chep-th%2F0208146%2Chep-th%2F0208145%2Chep-th%2F0208034%2Chep-th%2F0208204%2Chep-th%2F0208152%2Chep-th%2F0208098%2Chep-th%2F0208180%2Chep-th%2F0208207%2Chep-th%2F0208198%2Chep-th%2F0208096%2Chep-th%2F0208219%2Chep-th%2F0208230%2Chep-th%2F0208154%2Chep-th%2F0208032%2Chep-th%2F0208213%2Chep-th%2F0208027%2Chep-th%2F0208192%2Chep-th%2F0208183%2Chep-th%2F0208122%2Chep-th%2F0208179%2Chep-th%2F0208135%2Chep-th%2F0208075%2Chep-th%2F0208211%2Chep-th%2F0208014%2Chep-th%2F0208115%2Chep-th%2F0208174%2Chep-th%2F0208206%2Chep-th%2F0208067%2Chep-th%2F0208159%2Chep-th%2F0208218%2Chep-th%2F0208210&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We construct actions for (p,0)- and (p,1)- supersymmetric, 1 <= p <= 4,\ntwo-dimensional gauge theories coupled to non-linear sigma model matter with a\nWess-Zumino term. We derive the scalar potential for a large class of these\nmodels. We then show that the Euclidean actions of the (2,0) and\n(4,0)-supersymmetric models without Wess-Zumino terms are bounded by\ntopological charges which involve the equivariant extensions of the Kahler\nforms of the sigma model target spaces evaluated on the two-dimensional\nspacetime. We give similar bounds for Euclidean actions of appropriate gauge\ntheories coupled to non-linear sigma model matter in higher spacetime\ndimensions which now involve the equivariant extensions of the Kahler forms of\nthe sigma model target spaces and the second Chern character of gauge fields.\nThe BPS configurations are generalisations of abelian and non-abelian vortices."}, "authors": ["W. Machin", "G. Papadopoulos"], "author_detail": {"name": "G. Papadopoulos"}, "author": "G. Papadopoulos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/20/7/302", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-th/0208076v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-th/0208076v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "45 pages, Latex", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-th/0208076v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-th/0208076v1", "journal_reference": "Class.Quant.Grav.20:1233-1266,2003", "doi": "10.1088/0264-9381/20/7/302", "fulltext": "arXiv:hep-th/0208076v1 10 Aug 2002\n\nSupersymmetric Gauge Theories, Vortices and\nEquivariant Cohomology\n\nW. Machin and G. Papadopoulos\n\nDepartment of Mathematics\nKing's College London\nStrand\nLondon WC2R 2LS\n\nAbstract\nWe construct actions for (p, 0)- and (p, 1)- supersymmetric, 1 ≤ p ≤ 4,\ntwo-dimensional gauge theories coupled to non-linear sigma model matter\nwith a Wess-Zumino term. We derive the scalar potential for a large\nclass of these models. We then show that the Euclidean actions of the\n(2, 0) and (4, 0)-supersymmetric models without Wess-Zumino terms are\nbounded by topological charges which involve the equivariant extensions\nof the Kähler forms of the sigma model target spaces evaluated on the\ntwo-dimensional spacetime. We give similar bounds for Euclidean actions\nof appropriate gauge theories coupled to non-linear sigma model matter in\nhigher spacetime dimensions which now involve the equivariant extensions\nof the Kähler forms of the sigma model target spaces and the second Chern\ncharacter of gauge fields. The BPS configurations are generalisations of\nabelian and non-abelian vortices.\n\n\f1\n\nIntroduction\n\nTwo-dimensional field theories have found many applications in string theory.\nFor example, two-dimensional sigma models and some two-dimensional gauge\ntheories have been used to model the dynamics of fundamental and D-strings,\nrespectively. The small fluctuations of strings which arise as intersections in\nvarious brane configurations are described by two-dimensional gauge theories\ncoupled to scalars. Because of this, many of the properties and the various\nobjects that arise in gauge theories coupled to scalars have a brane interpretation [1, 2, 3, 4]. Supersymmetric gauge theories coupled to linear sigma models\nhave been constructed in [5] and they have been used to illuminate the relation between Landau-Ginzburg models and Calabi-Yau spaces. Recently a\ntwo-dimensional gauged theory coupled to a linear sigma model was used to\ninvestigate aspects of the dynamics of vortices using branes [6].\nIn two dimensions, the Wess-Zumino term has the same mass dimension as\nthe kinetic term of sigma model scalars. Therefore two-dimensional supersymmetric gauged theories can couple to non-linear sigma model matter which also\nhas a non-vanishing Wess-Zumino coupling. Such a theory is renormalizable.\nThe gauging of supersymmetric two-dimensional non-linear sigma models with\na Wess-Zumino term has been considered in [7, 8]. However in these papers the\npart of the action which involves the gauge field kinetic terms has not been given.\nIt has been found in [7] that the Wess-Zumino term of a non-linear sigma model\ncannot always be gauged. The conditions for gauging a Wess-Zumino term have\nbeen identified as the obstructions to the extension of the closed form associated with the Wess-Zumino term to an element of the equivariant cohomology\n[9] of the sigma model target space [10]. Scalar potentials for supersymmetric\ntwo-dimensional sigma models with Wess-Zumino term have been investigated\nin [11, 12, 13, 14].\nIn this paper we shall construct the actions of (p,0)- and (p,1)-supersymmetric,\n1 ≤ p ≤ 4, two-dimensional gauge theories coupled to non-linear sigma model\nmatter and with non-vanishing Wess-Zumino term. In addition we shall also\nconsider the scalar potentials that arise in these theories. This will generalise\nvarious partial results that have already appeared in the literature. To simplify\nthe description of the results from here on, we shall use the term 'sigma models'\ninstead of the term 'non-linear sigma models' unless otherwise explicitly stated.\nThe method we shall use to construct the various actions of supersymmetric\ntwo-dimensional gauged theories coupled to sigma models is based on the superfields found in the context of supersymmetric sigma models [15, 16] and later\nused in the context supersymmetric gauged sigma models [8]. One advantage\nof this method is that it keeps manifest the various geometric properties of the\ncouplings that appear in these theories. This will be used in the second part\nof the paper to construct of various bounds for vortices. Since the parts of the\nactions that we shall describe involving the kinetic term of the sigma model\nscalars, the Wess-Zumino term and their couplings to gauge fields are known,\nwe shall focus on the kinetic term of the gauge fields and the scalar potentials\nof these theories. We shall allow the gauge couplings to depend on the sigma\n2\n\n\fmodel scalars and we shall derive the various conditions on these couplings required by gauge invariance and supersymmetry. We shall find that the scalar\npotential of gauge theories coupled to sigma models in two dimensions, even\nin the presence of Wess-Zumino term, is the sum of a 'F' term or a 'D' term\nor both. The presence of a D-term, or Fayet-Iliopoulos term, may come as a\nsurprise. This is because in the presence of a Wess-Zumino term the geometry\nof the target space, say, of (2,0)-supersymmetric models where such a term is\nexpected, is not Kähler and but Kähler with torsion (KT). Thus the Kähler\nform is not closed and there are no obvious moment maps. However, it has\nbeen shown in [17] that KT geometries under certain conditions admit moment\nmaps and are those that appear in the Fayet-Iliopoulos term of these models.\nSimilar results hold for the (4,0)-supersymmetric models. We shall observe that\nthe gauged (p,1), p = 1, 2, 4, multiplets are associated with scalar superfields.\nFor the gauge theories with (2,1) and (4,1) supersymmetry, these scalar multiplets satisfy the same supersymmetry constraints as the associated sigma model\nmultiplets. Therefore these gauge theories can be thought of as sigma models\nwith target spaces LG ⊗ Rp , p = 1, 2, 4. This will allow us to combine the\n(p,1) gauge multiplet and the standard sigma model (p, 1) multiplet to a new\nsigma model multiplet. As a result, sigma model type of actions can be written\nfor these gauge theories coupled to matter for which the associated couplings\ndepend on the scalar fields of both the sigma model and gauge multiplets. This\ngeneralizes the results of [8].\nIn the second part of this paper, we shall show that the Euclidean actions\nof (2,0)- and (4,0)-supersymmetric two-dimensional gauge theories coupled to\nsigma models with a Fayet-Iliopoulos term but with vanishing Wess-Zumino\nterm admit bounds. In particular we shall find that the Euclidean action SE\nof the (2,0)-supersymmetric theory is bounded by the absolute value of a topological charge Q which is the integral over the two-dimensional spacetime of\nthe equivariant extension of the Kähler form of its sigma model target space,\nSE ≥ |Q|. The sigma model manifold in the (4,0)-supersymmetric theory is\nhyper-Kähler and so there are three Kähler forms each having an equivariant extension. The Euclidean action SE of the (4,0)-supersymmetric theory is bounded\nby the length of the three topological charges Q1 , Q2 , Q3 each associated with\nthe integral over the two-dimensional\np spacetime of the equivariant extensions\nof the three Kähler forms, SE ≥ Q21 + Q22 + Q23 . This is another application\nof the equivariant cohomology in the context of two-dimensional gauged sigma\nmodels which is distinct from that found in [10] and we have mentioned above.\n(For many other applications see for example [18].) The configurations that saturate these bounds are vortices and include the Nielsen-Olesen type of vortices\n[19] associated with gauge theories coupled to linear sigma models. In particular\nthe bounds above generalise that found by Bogomol'nyi in [20] for the abelian\nvortices of a gauge theory coupled to a single linear complex scalar field.\nWe also find that similar bounds exist in higher dimensions for action type\nof functionals that involve maps between Kähler manifolds of any dimension\ncoupled to gauge fields or maps from a Kähler manifold into a hyper-Kähler\nmanifold again coupled to gauge fields. The structure of these functionals is\n3\n\n\fsuch that it includes the Euclidean actions of some supersymmetric gauge theories in higher dimensions coupled to sigma models with Fayet-Iliopoulos terms.\nIn particular the first case, which involves maps between two-Kähler spaces, includes the Euclidean action of a four-dimensional N = 1 supersymmetric gauge\ntheory coupled to a sigma model. The latter case, which involved maps from a\nKähler manifold into a hyper-Kähler one, can be associated with the Euclidean\naction of a four-dimensional N = 2 supersymmetric gauge theory coupled to a\nsigma model. Note that in N = 1 theories in four dimensions the sigma model\ntarget space is Kähler while in the N = 2 theories in four dimensions the sigma\nmodel target space is hyper-Kähler. In all these cases the action functionals\nare bounded by topological charges which involve the equivariant extensions of\nthe Kähler forms of the sigma model target space as well as the second Chern\ncharacter of the gauge fields. Our results are different from those of [21, 22] for\nnon-abelian vortices which involve non-abelian gauge theories coupled to linear\nsigma model matter. Note that in the bound constructed in [21], the topological term involves the first class and second Chern character of the gauge\nfields instead of the equivariant extension of the Kähler form and the second\nChern character of the gauge field that we find. It turns out that in the case of\ngauge theories coupled to linear sigma models of [5] the two different topological\ncharges can be related, see also [23]. However this involves a partial integration\nprocedure in which various surface terms are taken to vanish. We remark that\nin the construction of the bounds that involve the equivariant extensions of the\nKähler forms, and also in [20], the topological terms are identified with what\nremains after writing the Euclidean actions of the theories as a sum of squares\nwithout the use of partial integrations. It is clear that our results can also be\nused to construct bounds for solitons in appropriate gauge theories coupled to\nsigma model matter in odd-spacetime dimensions. This is the usual situation\nwhere instantons in a n-dimensional theory can be thought of as static solitons\nof a (n+1)-dimensional theory. In particular, there is a bound for the energy of\nstatic configurations of a three-dimensional N = 2 supersymmetric gauge theory coupled to sigma model matter. This new bound is an extension to gauged\ntheories of the of bounds found in [24] and generalizes that of [25].\nThis paper is organised as follows: In section two, we shall describe nonsupersymmetric gauge theories coupled to sigma model matter to set up our\nnotation and give some universal conditions which appear in all such models.\nIn section three, we shall describe the (1,0)-supersymmetric gauge theories coupled to sigma model matter with a Wess-Zumino term. We shall also give the\nscalar potential of the system. In sections four and five, we shall describe the\n(2,0)- and (4,0)-supersymmetric gauge theories coupled to sigma model matter\nand give the scalar potentials of the systems. We shall find that these systems have Fayet-Iliopoulos terms constructed from the moment maps of KT\nand HKT geometries, respectively. In section six, we shall describe the (1,1)supersymmetric gauge theory coupled to sigma model matter. We shall find\nthat both the gauge multiplet and the sigma model multiplet are scalar superfields allowing for non-polynomial interactions between them. In sections seven\nand eight, we shall describe the (2,1)- and (4,1)-supersymmetric gauge theories\n4\n\n\fcoupled to sigma model matter and give the scalar potentials of the systems.\nIn both these theories the gauge multiplets and the sigma model multiplets are\nscalar superfields and therefore admit non-polynomial interactions. In section\nnine, we describe a bound for the Euclidean action of a (2,0)-supersymmetric\ngauge theory without Wess-Zumino term. We show that the equivariant extension of the Kähler class enters in the bound. The BPS configurations are\nvortices and the scalar fields take values in a curved manifold M . In section ten,\nwe describe a bound for the Euclidean action of a (4,0)-supersymmetric gauge\ntheory without Wess-Zumino term. We show that the topological term in the\nbound is a linear combination equivariant extensions of the Kähler classes of\nthe hyper-Kähler manifold which is the sigma model target space. In sections\neleven and twelve, we present a generalisation of the bounds we have described\nfor (2,0)- and (4,0)-supersymmetric models to a class of gauge theories coupled\nto scalars which are maps between Kähler manifolds or from a Kähler manifold\nto a hyper-Kähler, respectively. The topological term this time involves, apart\nfrom the equivariant extensions of Kähler forms, the second Chern character of\nthe gauge connection. Finally in section thirteen, we give our conclusions.\n\n2\n2.1\n\nTwo-dimensional gauged sigma models with\nWess-Zumino term\nGeometric Data and Action\n\nTo describe two-dimensional supersymmetric gauge theories coupled to sigma\nmodel matter with a Wess-Zumino term, it is instructive to begin with a\nnon-supersymmetric system as a toy example. Let Ξ be the two-dimensional\n+ , x= ). The fields of the\nMinkowski spacetime with light-cone coordinates (x+\nmodel that we shall consider here are the following: a gauge potential A with\ngauge group G, sigma model matter fields φ which are locally maps from Ξ into\na sigma model manifold or target space M and real fermions ψ− and λ+ on Ξ\nof opposite chirality.\nThe couplings of two-dimensional gauged sigma model are described by a\nRiemannian metric g on M and the Wess-Zumino term which is a locally-defined\ntwo-form b on M ; H = db is a globally defined closed three-form on M . In\naddition, the gauge group G acts on M leaving invariant both the metric and\nthe Wess-Zumino term, ie\nLa g = 0\n\nLa H = 0\n\n(2.1)\n\nwhere La is the Lie-derivative with respect to the vector fields {ξa : a =\n1, . . . , dim LG} generated by the action of the gauge group G on M ; LG is\nthe Lie algebra of G. Therefore, we have\n[ξa , ξb ]i = −fab c ξc i ,\n\n5\n\n(2.2)\n\n\fwhere f are the structure constants of G; a, b, c = 1, . . . , dim LG are gauge\nindices. The first condition in (2.1) implies that ξa are Killing vectors, ie\n∇i ξaj + ∇j ξai = 0\n\n(2.3)\n\nwhere ∇ is the Levi-Civita connection of g and i, j = 1, . . . , dim M . The second\ncondition in (2.1) together with dH = 0 imply that ia H is closed and so\nξa i Hijk = 2∂[j wk]a\n\n(2.4)\n\nfor some locally defined one-form wa .\nIt is useful to give a geometric interpretation for the gauge potential A of\nthe sigma model field φ. Let P be a principal bundle over the spacetime Ξ\nwith fibre the gauge group G. The gauge potential A is locally the pull-back\nof a connection one-form A of P onto a open set of the spacetime Ξ. The\nsigma model maps φ are sections of the bundle P ×G M . Locally they can be\nrepresented as maps from the spacetime Ξ into M .\nTo describe the couplings of the fermions, we consider two vector bundles\nE and F over M equipped with connections B and C and with fibre metrics\nh and k, respectively. The fermions ψ− and λ+ can be thought of as sections\nof S− ⊗ E and S+ ⊗ F , respectively, where S− and S+ are spin bundles over Ξ\nassociated to the two inequivalent real representation of Spin(1, 1). Note that\nin two dimensions there are Majorana-Weyl fermions and so two inequivalent\none-dimensional real spinor representations of Spin(1, 1). In addition we shall\nassume that the connections B and C as well as the fibre metrics h and k are\ninvariant under the action of the gauge group on M . These conditions imply\nthat\nLa Bi AB = −∇i Ua AB\nLa hAB = −Ua\n\nC\n\nA hCB\n\n(2.5)\n− Ua\n\nC\n\nB hAC\n\n,\n\n(2.6)\n\nwhere\n∇i Ua AB = ∂i Ua AB + Bi A C Ua C B − Ua A C Bi C B ,\n\n(2.7)\n\nand Ua are infinitesimal gauge transformations, A, B, C = 1, . . . , rank E, and\nsimilarly for the connection C and fibre metric k. The above conditions on the\nconnection B have appeared in [26]. An action for the fields A, φ, ψ− and λ+ is\nZ\n\u0001\ni\nj\na\nb\nS = d2 x uab F+\n+ φ ∇= φ − V (φ)\n+= F+\n+= + gij ∇+\nZ\n\u0001\nj\nk\ni a\n+ d2 xdt Hijk ∂t φi ∇+\n(2.8)\n+ φ ∇= φ − wia ∂t φ F+\n+=\nZ\nA ̃\nA′  ̃\nB′\nB\n+ d2 x (ihAB ψ−\n∇+\n+ ψ− − ikA′ B ′ λ+ ∇= λ+ )\nwhere uab = uab (φ) are the gauge couplings which in general depend on φ, V is\na scalar potential and\nF+\n+= = [∇+\n+ , ∇= ] ,\n6\n\n(2.9)\n\n\fwhere we have suppressed gauged indices. The covariant derivatives in the\naction above are defined as follows,\n∇μ φi = ∂μ φi + Aaμ ξai\n\n(2.10)\n\nA\nA\nB\n ̃ μ ψ−\n+ Aaμ Ua AB ψ B ,\n∇\n= ∂μ ψ−\n+ ∇μ φi Bi AB ψ−\n\n(2.11)\n\nand\n\n ̃ A′ . The latter can be rewritten as\nμ=+\n+, =, and similarly for ∇λ\n+\n ̃ μ ψ A = ∂μ ψ A + ∂μ φi B A ψ B + Aa μ A ψ B .\n∇\n−\n−\ni B −\nμ a B\n\n(2.12)\n\nμa A B = Ua A B + ξa i Bi A B .\n\n(2.13)\n\nwhere\n\nObserve that the part of the action involving the Wess-Zumino term has\nbeen written as an integral over a three-dimensional space. The conditions for\nthis term to be written in a two-dimensional form as well as the conditions for\nthe gauge invariance of the action will be investigated in the next section, see\nalso [7].\n\n2.2\n\nConditions for gauge invariance\n\nThe gauge transformations of the fields are\nδǫ Aaμ = −∇μ ǫa\nδǫ φi = ǫa ξai\n\n(2.14)\n\nA\nB\nδǫ ψ−\n= ǫa Ua AB ψ−\n′\n\n′\n\nB\na\nA\nδǫ λA\n+ = ǫ Va B ′ λ+\n\n′\n\nwhere ǫ is the parameter of infinitesimal gauge transformations. Some of the\nconditions required for the invariance of the action (2.8) have been incorporated\nas part of the geometric data of the sigma model in the previous section. In\nparticular, in addition to the conditions (2.1) and (2.5), we require that (i) wa\nis a globally defined one-form on M which (ii) satisfies\nLa wb = −fab c wc .\n\n(2.15)\n\nTo write the Wess-Zumino part of the action in a two-dimensional form, it\nis necessary for the relevant three form to be closed. This in addition requires\nthat\nξai wib + ξbi wia = 0 .\n\n7\n\n(2.16)\n\n\fThen the three-dimensional part of the action (2.8) can be written locally [7] as\nZ\ni\nj\na\ni\nS ′ = d2 x bij ∂+\n+ φ ∂= φ − A+\n+ wia ∇= φ\n(2.17)\n\u0001\ni\na b\ni\n.\n+ Aa= wia ∇+\nφ\n+\nA\nA\nξ\nw\nai\n+\n+\n+ = b\nThe conditions above that require (i) H to be invariant under the group action,\n(ii) wa to be globally defined on M , (iii) (2.15) and (iv) (2.16) are those for the\nclosed form H to have an extension, i.e. equivariant extension [9], as a closed\nform in M ×G EG [10].\nNext let us consider the conditions for gauge invariance of part of the action (2.8) involving the fermions. We find that this requires that\nLc uab + udb f dca + uad f dcb = 0\n\n(2.18)\n\nfor the gauge couplings uab ,\nLa Ub − Lb Ua = [Ua , Ub ] − fab c Uc\n\n(2.19)\n\nLa V = 0 .\n\n(2.20)\n\nand\n\nWe have not assumed that ∇i h = 0. However given a connection on a vector\nbundle with a fibre metric h, there always exist another connection ∇′ such\nthat ∇′i h = 0. Suppose that the ∇′ is used for the fermionic couplings. If this\nis the case, the gauge group is O(N ) and therefore the right-hand-side of (2.6)\nvanishes.\nObserve that the equation (2.5) can be written in a more covariant form as\nξaj Gij AB = ∇i μaAB .\n\n(2.21)\n\nIn what follows we shall assume that the conditions stated in this section\nby requiring gauge invariance of the non-supersymmetric model described by\nthe action (2.8) hold. We shall see that for supersymmetric sigma models more\nconditions are necessary.\n\n3\n\n(1, 0) supersymmetric gauged models\n\nThe (1,0)-supersymmetric gauged sigma model involves the coupling of three\ndifferent (1,0)-multiplets. To simplify the construction of this model we shall\ndescribe each multiplet and the conditions for supersymmetry and gauge invariance separately. There are different ways of approaching this problem. Here\nwe shall use 'standard' (1,0)-superfields. The action will be constructed using\n(1,0)-superspace methods.\n\n8\n\n\f3.1\n\nThe gauge multiplet\n\n+ , x= , θ + ), where (x+\n+ , x= ) are\nThe (1,0)-superspace Ξ1,0 has coordinates (x+\n+\nbosonic light-cone coordinates and θ is a Grassmann odd-coordinate. The\n(1,0)-supersymmetric Yang-Mills multiplet with gauge group G is described by\na connection A in superspace which has components (A+\n+ , A= , A+ ). In addition,\nit is required that these satisfy the supersymmetry constraints [8]\n\n[∇+ , ∇+ ] = 2i∇+\n[∇+\n+\n+ , ∇= ] = F+\n+=\n[∇+ , ∇= ] = W− ,\n\n(3.1)\n\nwhere F+\n+= , W− are the components of the curvature of the superspace connection A. (The gauge indices have been suppressed.) Jacobi identities imply\nthat\n∇+ W− = iF+\n+=\n\n(3.2)\n\nTherefore the independent components of the gauge multiplet are\nχa = W− |\n\na\na\nF+\n+= = −i∇+ W− |\n\n(3.3)\n\nwhere χa is the gaugino and F a is the two-form gauge field strength and the\nvertical line denotes evaluation of the associated superfield at θ+ = 0. This\nnotation for identifying the components of a superfield will also be used later\nfor other theories.\n\n3.2\n\nSigma model multiplets\n\nTo described the sigma model multiplet that couples to the above gauge field,\nwe introduce a Riemannian manifold M with metric g and a locally defined two\nform b. In addition we assume that M admits a vector bundle E with fibre\nmetric h, connection B and a section s. The data required for the description\nof the sigma model multiplet are the same as those given in section 2.1. In\naddition we take the section s to satisfy\nLa sA = −Ua BA sB .\n\n(3.4)\n\nThe (1, 0)-supersymmetric sigma model multiplet is described by a real scalar\nsuperfield φ and a fermionic superfield ψ− . The superfield φ is a map from the\nsuperspace Ξ1,0 into a sigma model manifold M and the fermionic superfield\nψ− is a section of the bundle φ∗ E ⊗ S− ; S− is a spin bundle over Ξ1,0 .\nThe components of the superfields φ, ψ− are\nφi = φi |\n\nλi+ = ∇+ φi |\n ̃ + ψA | ,\nlA = ∇\n−\n\nA\nA\nψ−\n= ψ−\n|\n\n(3.5)\n\nwhere the covariant derivatives are defined as\n∇+ φi = D+ φi + Aa+ ξai\n ̃ + ψ A = D+ ψ A + ∇+ φi B A ψ B + Aa U A ψ B ,\n∇\n−\n−\ni B −\n+ a B −\n2\nwhere D+ is the usual flat superspace derivative, D+\n= i∂+\n+.\n\n9\n\n(3.6)\n\n\f3.3\n\nSupersymmetric action\n\nIt is straightforward to couple the gauge multiplet to (1, 0)-supersymmetric\nsigma model matter. The full action is\nS = Sg + Sσ + Sf + Sp\n\n(3.7)\n\nwhere\nSg = −\n\nZ\n\n\u0001\nd2 xdθ+ uab W−a ∇+ W−b − iza W−a ,\n\n(3.8)\n\nwhere uab = uab (φ), uab is not necessarily symmetric in the gauge indices and\nza is a theta type of term which may depend on the scalar field φ, za = za (φ).\nThe gauge covariant supersymmetric action for the fields φ is [8]\nZ\nSσ = − i d2 xdθ+ gij ∇+ φi ∇= φj\nZ\n(3.9)\n\u0001\ni\nj\nk\ni\na\n2\n+\n− i d xdtdθ Hijk ∂t φ ∇+ φ ∇= φ − wia ∂t φ W−\nwhich as in section 2.1 can also be written as an integral over Ξ1,0 superspace\nprovided that H admits an equivariant extension. In particular we have\nZ\nSσ = −i d2 xdθ+ gij ∇+ φi ∇= φj + bij D+ φi ∂= φj\n(3.10)\n\u0001\ni\n− Aa+ wia ∂= φi + Aa= wia D+ φi + Aa+ Ab= ξ[b\nwa]i .\nThe action of the gauged fermionic multiplet is [26]\nZ\nA ̃\nB\nSf = d2 xdθ+ hAB ψ−\n∇+ ψ−\n.\n\n(3.11)\n\n ̃ + is similar to the one given in\nThe definition of the covariant derivative ∇\n ̃ +.\nsection (2.1) for the covariant derivative ∇\n+\nThe action for the potential term is\nZ\nA\nSp = d2 xdθ+ msA ψ−\n(3.12)\nwhich is similar to that of the ungauged model in [11].\nThe superfields transform under the gauge group G as\nδAμ = −∇μ ǫa\n\nδφi = ǫa ξa i (φ)\n\nA\nB\nδψ−\n= ǫa Ua AB ψ−\n.\n\n(3.13)\n\nwhere μ = +\n+, =, + is a Ξ1,0 superspace index and ǫa is an infinitesimal gauge\ntransformation parameter. Gauge invariance of the action (3.7) requires, in\naddition to the conditions given in section (2.2), the condition (3.4) and\nLa zb = −fab c zc .\n10\n\n(3.14)\n\n\f3.4\n\nThe action of (1,0)-model in components and scalar\npotential\n\nThe action of (1,0)-supersymmetric two-dimensional gauged sigma model described by the action (3.7) can be easily written in components by performing\nthe θ+ integration and using the definition of the various component fields of\nthe (1,0)-multiplets which we have described in the previous sections. In particular we find for the part of the action involving the kinetic term of the gauge\nmultiplet that\nZ\na\nb\na\nSg = d2 x uab F+\n+= F+\n+= + za F+\n+=\n(3.15)\n\u0001\ni a b\nb\ni a\n.\n− iuab χa− ∇+\nF\nχ\n+\ni∂\nu\nλ\nχ\n+\ni∂\nz\nλ\nχ\ni ab + − +\ni a + −\n+ −\n+=\nNext we find that\nZ\ni\nj\ni\nj\ni  ̃ (+) j\nSσ = d2 x gij ∇+\n+ φ ∇= φ + bij ∂+\n+ φ ∂= φ + iλ+ ∇= λ+\ni\na\ni\n+ iwia λi+ χa− − Aa+\n+φ\n+ wia ∂= φ + A= wia ∂+\n\u0001\ni\nb\n− Aa+\n+ A= ξ[b wa]i ,\n\n(3.16)\n\n ̃ (±) are the\nwhere ∇(±) are the usual metric connections with torsion ±H and ∇\nassociated connections involving also the gauge connection A. For the fermionic\nmultiplet we have\nZ\n\u0001\n1\nA ̃\nB\nA B\nA B i j\nSf = d2 x −ihAB ψ−\n∇+\n(3.17)\n+ ψ− + hAB l l − Gijab ψ− ψ− λ+ λ+\n2\nand\nSp =\n\nZ\n\n\u0001\nd2 x ∇i sA λi+ + sA lA .\n\n(3.18)\n\nThe scalar potential in these models is precisely that of the ungauged (1,0)\nsigma models in [11], ie.\nV =\n\n1 2 AB\nm h sA sB .\n4\n\n(3.19)\n\nSo we find that only 'F -terms' contribute to the potential. This is because the\ngauge multiplet does not have an auxiliary field. Therefore the classical vacua of\nthe theory are the points of the sigma model manifold M for which the section\ns vanishes modulo gauge transformations. Therefore the vacua of the theory\nare those orbits of the gauge group G in M for which the section s vanishes.\n\n4\n\n(2, 0) supersymmetry\n11\n\n\f4.1\n\nThe gauge multiplet\n\n+ , x= , θ + , θ + ) where (x+\n+ , x= ) are\nThe (2, 0) superspace Ξ2,0 has coordinates (x+\n0\n1\n+\nthe usual light-cone coordinates and {θp : p = 0, 1} are anticommuting coordinates. The (2,0)-supersymmetric Yang-Mills multiplet is described by a\nconnection A in Ξ2,0 superspace with components (A+\n+ , A= , Ap+ ), p = 0, 1. In\naddition it is required that these satisfy the supersymmetry constraints [8]\n\n[∇p+ , ∇q+ ] = 2iδpq ∇+\n+\n\n[∇+\n+ , ∇= ] = F+\n+=\n\n[∇p+ , ∇= ] = Wp− ,\n\n(4.1)\n\nwhere p, q = 0, 1. Jacobi identities imply that\n∇p+ Wq− + ∇q+ Wp− = 2iδpq F+\n+=\n\n(4.2)\n\nThe components of the gauge multiplet are\nχ0− = W0− |\n\nχ1− = W1− |\n\niF+\n+= = ∇0+ W0− |\n\nf = ∇0+ W1− | .\n\n(4.3)\n\nThe components, (χ0− , χ1− ), are the gaugini which are real chiral fermions in\ntwo dimensions, F+\n+= is the field strength and f is an auxiliary field. (We have\nsuppressed the gauge indices.)\n\n4.2\n\nThe sigma model multiplet\n\nIt is well known the target manifold M of (2,0)-supersymmetric ungauged sigma\nmodel is Kähler manifold with torsion (KT). Therefore M is a hermitian manifold with metric g and equipped with a complex structure J which is parallel\nwith respect to the ∇(+) connection. This connection is a metric connection\nwith torsion H, ie ∇(+) = ∇ + 12 H where ∇ is the Levi-Civita connection. (For\nthe definition of these geometries see [27, 28]). To gauge the model, we assume\nas in section 2.1 that the gauge group G acts on M and leaving invariant the\nmetric g and the Wess-Zumino term H. In addition we require that the action\nof the group G is holomorphic. This means that\nLa J = 0 ,\n\n(4.4)\n\nwhere the Lie derivative is along vector fields ξa generated by the group action\nof G. The sigma model fields are maps φ : Ξ2,0 → M into a complex manifold\nM which in addition satisfy\n∇1+ φi = J i j ∇0+ φj ,\n\n(4.5)\n\nwhere ∇p+ φ = Dp+ φi + Aap+ ξai , p = 0, 1. Note that the requirement for M to\nbe a complex manifold can be derived from the above condition.\nThe components of the sigma model multiplet φ are as follows:\nφi = φi |\n\nλi+ =∇0+ φi | .\n12\n\n(4.6)\n\n\f4.3\n\nThe fermionic multiplet\n\nLet E be a vector bundle over M equipped with a connection B and a fibre\n(almost) complex structure I. The fermionic multiplet ψ− is a section of φ∗ E ⊗\nS− over the Ξ2,0 , where S− is a spin bundle over Ξ2,0 . In addition we require\nthat the fermionic multiplet ψ− satisfies\n1\nB\nA\n ̃ 0+ ψ−\n ̃ 1+ ψ−\n+ mLA ,\n∇\n= I AB ∇\n2\nwhere L is a section of E and\n ̃ p+ ψ A = Dp+ ψ A + ∇p+ φi Bi A B ψ B + Aa Ua A B ,\n∇\n−\n−\np+\n\n(4.7)\n\n(4.8)\n\nfor p = 0, 1.\nCompatibility of the condition (4.7) with gauge transformations requires\nthat\nLa I A B = Ua A C I C B − I A C Ua C B\nLa LA = Ua A B LB .\n\n(4.9)\n\nThese are the conditions for the gauge transformations and the (2,0)-supersymmetry\ntransformations to commute.\nThe compatibility of the condition (4.7) with the algebra of covariant derivatives ∇ implies the following conditions:\nGklAB J i k J l j = Gij AB\nJ k i ∇k LA − I A B ∇i LB = 0\nk\n\nJ i ∇k I\n\nA\n\nB\n\n−I\n\nA\n\nC ∇i I\n\nC\n\nB\n\n(4.10)\n\n=0.\n\nThese are precisely the conditions required for the off-shell closure of (2,0) supersymmetry algebra.\nIt is always possible to find a connection B on the bundle E such that\n∇I = 0. In such case the last condition in (4.10) is satisfied. Decomposing E ⊗C\nas E ⊗ C = E ⊕ Ē using I, the first condition implies that E is a holomorphic\nvector bundle. Then the second condition in (4.10) implies that the section L\nis the real part of a holomorphic section of E.\nThe components of the fermionic multiplet are as follows:\n ̃ 0+ ψ A | ,\nlA =∇\n−\n\nA\nA\nψ−\n= ψ−\n|\n\n(4.11)\n\nwhere ψ− is a two-dimensional real chiral fermion and l is an auxiliary field.\n\n4.4\n\nAction\n\nThe action of the (2,0)-supersymmetric gauged sigma model can be written as\nS = Sg + Sσ + Sf ,\n\n(4.12)\n\nwhere Sg is the action of the gauge multiplet, Sσ is the action of the sigma-model\nmultiplet and Sf is the action of the fermionic multiplet. We shall describe each\nterm separately.\n13\n\n\f4.5\n\nThe gauge multiplet action\n\nThe most general action for the (2,0)-supersymmetric gauge multiplet up to\nterms quadratic in the field strength is\nZ\n\u0001\na\nb\na\nb\na\n,\nSg = d2 xdθ0+ −u0ab δ pq Wp−\n∇0+ Wq−\n+ u1ab δ pq Wp−\n∇1+ Wq−\n+ izap Wp−\n\n(4.13)\n\nwhere u0 and u1 are the gauge coupling constants which in general depend\non the superfield φ and similarly for the 'theta' terms z p . Both u0 and u1\nare not necessarily symmetric in the gauge indices. The above action can be\nwritten in different ways. However there are always field and coupling constant\nredefinitions which can bring the action to the above form.\nObserve that this action is not an integral over the full Ξ2,0 superspace.\nTherefore it is not manifestly (2,0)-supersymmetric. The requirement of invariance under (2,0) supersymmetry imposes the conditions\nJ j i ∂j u0 = −∂i u1\nJ j i ∂j z 1 = −∂i z 0 .\n\n(4.14)\n\nThis is most easily seen by verifying that the Lagrangian density is independent\n+ , x= -surface terms. The conditions (4.14) are the Cauchyof θ1+ up to θ0+ , x+\nRiemann equations which imply that u0 + iu1 and z 1 + iz 0 are holomorphic.\nIndeed provided that the holomorphicity conditions (4.14) hold, the action (4.13), apart from the theta terms, can be written as an integral over\nthe Ξ2,0 superspace as\nZ\na\nb\na\nb\nSg = d2 xdθ0+ dθ1+ αu0ab W0−\nW1−\n+ (α − 1)u1ab W0−\nW0−\n(4.15)\n\u0001\n1\na\nb\n0\na\nb\n− αuab W1− W1− + (α − 1)uab W1− W0−\nfor any constant α. After integrating over the odd coordinate θ1+ we recover the\naction (4.13). Observe that the action (4.15) simplifies if one takes u0 , u1 to be\nsymmetric matrices. In particular one finds that\nZ\na\nb\nSg = d2 xdθ0+ dθ1+ u0ab W0−\nW1−\n.\n(4.16)\nInvariance of the action (4.13) under gauge transformations requires that\nthe couplings u0 , u1 and z p satisfy\nLa u0bc = −f e ab u0ec − f e ac u0ae\nLa u1bc = −f e ab u1ec − f e ac u1ae\nLa zbp\n\n= −f\n\nc\n\np\nab zc\n\n(4.17)\n\n.\n\nThe gauge transformations of the gauge multiplet and the sigma model multiplet\nthat are required to derive the above result are as in the (1,0)-supersymmetric\nmodels studied in the previous sections.\n14\n\n\f4.6\n\nThe sigma model action\n\nThe part of the action which describes the coupling of the sigma model (2,0)multiplet to the gauge multiplet has already been given in [8]. This action\nis\nZ\n\u0001\na\nSσ = − i d2 xdθ0+ gij ∇0+ φi ∇= φj + νa W1−\nZ\n(4.18)\n\u0001\na\n− i d2 xdtdθ0+ Hijk ∂t φi ∇0+ φj ∇= φk − wia ∂t φi W0−\nwhere νa is a function on M , possibly locally defined, given by\nI ji (ξaj + waj ) = −∂i νa\n\n(4.19)\n\nUnder certain conditions the maps ν can be thought of as the moment maps of\nKT geometry [17].\nGauge invariance of the above part of action requires in addition to the\nconditions on w, which we have already mentioned in section 2.2, that νa is\nglobally defined on M and that\nLa νb = −fab c νc .\n\n4.7\n\n(4.20)\n\nThe action of the fermionic multiplet\n\nThis part of the action is\nZ\n\u0001\nA ̃\nB\nA\n∇0+ ψ−\n+ msA ψ−\nSf = d2 xdθ0+ hAB ψ−\n\n(4.21)\n\nGauge invariance of this part of the action requires the same conditions as\nthose appearing for the couplings of (1,0)-multiplet in (2.19).\nThe conditions required by (2,0)-supersymmetry on the couplings of the\nabove action are the same as those of the ungauged model and have been given\nin [29]. These can be easily derived by requiring that the Lagrangian density is\n+ , x= , θ + surface terms. In particular, we find that\nindependent from θ1+ up to x+\n0\nhCB I C A + hCA I C B = 0\nJ j i ∇j hAB + ∇i hAC I C B = 0\n1\nJ j i ∇j sA − ∇i (sB I B A ) − ∇i hAB LB = 0\n2\nsA LA = const .\n\n(4.22)\n\nThe first condition implies that the fibre metric is hermitian is respect to the\nfibre complex structure. It is always possible to choose such a fibre metric\ngiven a fibre complex structure on a bundle vector bundle E. In the context of\nsigma models this has been explained in [16]. The rest of the conditions can be\nconsiderably simplified if the connection B is chosen such that ∇I = ∇h = 0.\nSuch connection always exists on a hermitian vector bundle E. In such case, the\nthird equation in (4.22) implies that s is the real part of a holomorphic section\nof E ∗ .\n15\n\n\f4.8\n\nThe action in components\n\nIt is straightforward to write the action S of the (2,0)-supersymmetric gauge\nsigma model in components. In particular we find that the component action\nof the gauge multiplet (4.13) is\nZ\na\nb\n0 a\n0 a b\n1 a\nSg = d2 x u0ab F+\n+= F+\n+= + za F+\n+= − uab f f + iza f\nb\n0 a\nb\n+ iu0ab χa0− ∇+\n+ χ0− + iuab χ1− ∇+\n+ χ1−\na\nb\n1\na\nb\n− 2iu1[ab] F+\n+ χ1]−\n+= f + 2iu[ab] χ[0− ∇+\n\n(4.23)\n\n+ i∂i za0 λi+ χa0− + i∂i za1 λi+ χ1−\nb\na\nb\n− λi+ ∂i u0ab (iχa0− F+\n+= + χ1− f )\n\n\u0001\nb\n+ λi+ ∂i u1ab (−χa0− f b + iχa1− F+\n+= ) .\nThe component action of the sigma model part is\nZ\ni\nj\ni\nj\ni  ̃ (+) j\nSσ = d2 x gij ∇+\n+ φ ∇= φ + bij ∂+\n+ φ ∂= φ + iλ+ ∇= λ+\n− i∂i λi+ νa χa1− − iνa f a + igij λi+ χa0− ξa j + iwia λi+ χa0−\n\u0001\ni\ni\na\ni\na b\n− Aa+\n+ φ − A+\n+ wia ∂= φ + A= wia ∂+\n+ A= ξ[b wa]i\nand the component action of the fermionic multiplet is\nZ\nA ̃\nB\nA B\nSf = d2 x − ihAB ψ−\n∇+\n+ ψ− + hAB l l\n\u0001\n1\nA B i j\nA\n− hAB ψ−\nψ− λ+ λ+ GijAB + m∇i sA λi+ ψ−\n+ msA lA .\n2\n\n16\n\n(4.24)\n\n(4.25)\n\n\fEliminating the auxiliary fields of the gauge and fermionic multiplets, we find\nthat\nZ\ni\nj\ni\nj\n0\na\nb\nS = d2 x gij ∇+\n+ φ ∇= φ + bij ∂+\n+ φ ∂= φ + uab F+\n+= F+\n+=\nb\n0 a\nb\n+ iu0ab χa0− ∇+\n+ χ0− + iuab χ1− ∇+\n+ χ1−\nj\nA ̃\nB\n0 a\n ̃ (+)\n+ iλi+ ∇\n= λ+ − ihAB ψ− ∇+\n+ ψ− + za F+\n\n+=\n\n1\n1\n− m2 hAB sA sB − uab\n(νa − za1 )(νb − zb1 )\n4\n4 0\n1\nA B i j\nA\nψ− λ+ λ+ GijAB + m∇i sA λi+ ψ−\n− hAB ψ−\n2\ni\ni\na\ni\na b\n− Aa+\n+ φ − A+\n+ wia ∂= φ + A= wia ∂+\n+ A= ξ[b wa]i\nc\nd\n1\nc\nab 1\n1 1\n− uab\n0 (νa − za )u[cb] F+\n+= F+\n+=\n+= − u0 u[ac] u[bd] F+\n\n(4.26)\n\n+ i∂i za0 λi+ χa0− + i∂i za1 λi+ χ1−\nb\nb\n1 i a\n− i∂i u0ab λi+ χa0− F+\n+= + i∂i uab λ+ χ1− F+\n+=\n\n− i∂i νa λi+ χa1− + igij λi+ χa0− ξa j + iwia λi+ χa0−\n1\n(νa − za1 )(∂i u0cb χc1− + ∂i u1cb χc0− )\n+ iuab\n2 0\n1\n(∂i u0ca χc1− + ∂i u1cb χc0− )(∂i u0db χd1− + ∂i u1db χd0− )\n+ uab\n4 0\nc\n0 d\n1 d\n1\n− iuab\n0 u[ac] F+\n+= (∂i udb χ1− + ∂i udb χ0− )\n\u0001\nb\n+ 2iu1[ab] χa[0− ∇+\n+ χ1]−\n0\nwhere uab\n0 is the matrix inverse of u(ab) ,\na\n0\nuab\n0 u(bc) = δ c .\n\n(4.27)\n\nNote that we have assumed that u0 is invertible.\n\n4.9\n\nScalar potential and classical vacua\n\nThe scalar potential of the (2,0)-supersymmetric gauge theories coupled to sigma\nmodel matter is\nV =\n\n1 ab\n1\nu (νa − za1 )(νb − zb1 ) + mhAB sA sB .\n4 0\n4\n\n(4.28)\n\nThe scalar potential in these models is written as a sum of a 'D' and an 'F '\nterm. The classical supersymmetric vacua of the theory are those for which\nνa − za1 = 0\n\nsA = 0 .\n\n(4.29)\n\nThe inequivalent classical vacua are the space of orbits of the gauge group on\nthe zero set of the section s and ν − z 1 . If the section s and z 1 vanish, then\n17\n\n\fthe space of inequivalent vacua is the KT reduction M//G of the sigma model\ntarget space M . It has been shown in [17] that the space of vacua inherits the\nKT structure of the sigma model manifold M and under certain assumptions is\na smooth manifold. However the three-form of the Wess-Zumino term on M//G\nis not necessarily closed.\n\n5\n\n(4, 0) supersymmetry\n\n5.1\n\nThe gauge multiplet\n\n+ , x= , θ + ), where θ + , p = 0, 1, 2, 3,\nThe (4, 0) superspace Ξ4,0 has coordinates (x+\np\np\nare the odd coordinates. The (4,0)-supersymmetric Yang-Mills multiplet is\ndescribed by a connection A in superspace with components (A+\n+ , A= , Ap+ ),\np = 0, 1, 2, 3. In addition it is required that these satisfy the supersymmetry\nconstraints [8]\n\n[∇p+ , ∇q+ ] = 2iδpq ∇+\n+\n[∇+\n+ , ∇= ] = F+\n+=\n[∇p+ , ∇= ] = Wp−\n′ ′\n1\n∇p+ Wq− = ǫpq p q ∇p′ + Wq′ − ,\n2\n\n(5.1)\n\nwhere p, q, p′ q ′ = 0, . . . , 3 and p 6= q in the last condition. (We have suppressed\ngauge indices.) Jacobi identities imply that\n∇p+ Wq− + ∇q+ Wp− = 2iδpq F+\n+=\n\n(5.2)\n\nThe components of the gauge multiplet are\nχp− = Wp− |\nfr = ∇0+ Wr− |\n\niF+\n+= = ∇0+ W0− |\n(r = 1, 2, 3)\n\n(5.3)\n\nThe first four fields, (χp− : p = 0, 1, 2, 3), are the gaugini which are real chiral\nfermions in two dimensions, F+\n+= is the field strength and {fr : r = 1, 2, 3} are\nthe auxiliary fields.\n\n5.2\n\nThe sigma model multiplet\n\nLet M be a hyper-Kähler manifold with torsion (HKT). This implies that M\nadmits a hypercomplex structure {Jr : r = 1, 2, 3} the metric g on M is trihermitian and the hypercomplex structure is parallel with respect to a metric\nconnection with torsion the three-form H, ∇(+) Jr = 0; (see [27, 28] for more\ndetails). In addition we assume that the gauge group G acts on M preserving\nthe metric, three-form H and the hypercomplex structure. The latter condition\nimplies that\nLa Jr = 0 ,\n18\n\n(5.4)\n\n\fwhere the Lie derivative La is along vector field ξa generated by the action of G\non M . The sigma model fields are maps φ : Ξ4,0 → M into the HKT manifold\nM which in addition satisfy\n∇r+ φi = Jr i j ∇0+ φj ,\n\n(5.5)\n\nwhere ∇p+ φ = Dp+ φi + Aap+ ξai and r = 1, 2, 3. We remark that the algebra\nof (4,0) supersymmetry transformations closes as a consequence of the HKT\ncondition we imposed on M .\nThe components of the sigma model multiplet φ are as follows,\nφi = φi |\n\n5.3\n\nλi+ =∇0+ φi | .\n\n(5.6)\n\nThe fermionic multiplet\n\nLet E be a vector bundle over M equipped with a connection B and a fibre\n(almost) hypercomplex structure {Ir : r = 1, 2, 3}. The fermionic multiplet ψ−\nis a section of φ∗ E ⊗ S− over the Ξ4,0 , where S− is a spin bundle over Ξ4,0 . In\naddition the fermionic multiplet ψ− satisfies\n1\nB\nA\n ̃ 0+ ψ−\n ̃ r+ ψ−\n+ mLA\n∇\n= Ir A B ∇\nr\n2\n\n(5.7)\n\nwhere {Lr : r = 1, 2, 3} are sections of E and\n ̃ p+ ψ A = Dp+ ψ A + ∇p+ φi Bi A B ψ B + Aa Ua A B ,\n∇\n−\n−\np+\n\n(5.8)\n\np = 0, 1, 2, 3.\nCompatibility of the condition (5.7) with gauge transformations requires\nthat\nLa IrA B = Ua A C IrC B − IrA C Ua C B\nA\nB\nLa LA\nr = Ua B L r .\n\n(5.9)\n\nThese are the conditions for the gauge transformations and the (2,0)-supersymmetry\ntransformations to commute.\nThe conditions required for the closure of the (4,0) supersymmetry algebra\nare similar to those found for the ungauged (4,0) model in [11, 15]. Here to\nsimplify the analysis, we shall in addition assume that the fibre hypercomplex\nstructure is parallel with respect to ∇, ie ∇Ir = 0. (See [16] for a discussion on\nthe conditions required for the existence of such a connection ∇ on the vector\nbundle E.) The more general case can be easily derived but we shall not use\nthese results later. In this special case, we find that\nGkl A B Jr k i Js l j + Gkl A B Js k i Jr l j = 2δrs Gij A B\nJ\nA\nA\nB\nA\nB\nJr J i ∇j LA\ns + Js i ∇j Lr − Ir B ∇i Ls − Is B ∇i Lr = 0 .\n\n(5.10)\n\nThe first condition implies that the curvature G of the vector bundle E is an\n(1,1)-form with respect to all three complex structures Jr . Observe that the\n19\n\n\fdiagonal relation r = s implies all the rest. The diagonal part of the second\ncondition implies that each section Lr is a holomorphic section with respect to\nthe pair (Jr , Ir ).\nThe components of the fermionic multiplet are as follows:\nA\n ̃ 0+ ψ−\nlA =∇\n|,\n\nA\nA\nψ−\n= ψ−\n|\n\n(5.11)\n\nwhere ψ− is a two-dimensional real chiral fermion and l is an auxiliary field.\n\n5.4\n\nAction\n\nThe action of the (4,0)-supersymmetric gauged sigma model can be written as\nS = Sg + Sσ + Sf ,\n\n(5.12)\n\nwhere Sg is the action of the gauge multiplet, Sσ is the action of the sigma-model\nmultiplet and Sf is the action of the fermionic multiplet. We shall describe each\nterm separately.\n\n5.5\n\nThe gauge multiplet action\n\nThe most general action for the (4,0)-supersymmetric gauge multiplet up to\nterms quadratic in the field strength is\nSg =\n\nZ\n\na\nb\nd2 xdθ0+ −u0ab δ pq Wp−\n∇0+ Wq−\n+\n\n3\nX\n\na\nb\na\nurab δ pq Wp−\n∇r+ Wq−\n+ izap W−p\n\nr=1\n\n\u0001\n\n(5.13)\nwhere {up : p = 0, 1, 2, 3} and {z p : p = 0, 1, 2, 3} are the gauge coupling\nconstants which in general depend on the superfield φ and up are not necessarily\nsymmetric in the gauge indices. The above action can be written in different\nways. However there are always field and coupling constant redefinitions which\nbring the action to the above form.\nObserve that this action is not an integral over the full Ξ4,0 superspace.\nTherefore it is not manifestly (4,0)-supersymmetry. Define J0 ij = δ ij . The\nrequirement of invariance the action (5.13) under (4,0) supersymmetry imposes\nthe conditions\n1 p′ q′ j\nǫpq Jp′ i ∂j uq′ (p 6= q)\n2\n∂i u0 = J1 ji ∂j u1 = J2 ji ∂j u2 = J3 ji ∂j u3 ,\nJp ji ∂j uq =\n\n(5.14)\n\nand {ur : r = 1, 2, 3} are symmetric in the gauge indices. In addition, we have\nJr j i ∂j z r = −∂i z 0\n′ ′\n1\nJp j i ∂j zq = − ǫpq p q Jp′ k i ∂k zq′ .\n2\n20\n\n(5.15)\n\n\fThe conditions (5.14) and (5.15) imply that in fact {up : p = 0, . . . , 3} and {z p :\np = 0, . . . , 3} are constant, i.e. independent from the sigma model superfield φ.\nThe above conditions are most easily derived by verifying that the Lagrangian\n+ , x= and θ + . In addition\ndensity is independent of θr+ up to surface terms in x+\n0\ngauge invariance requires that the coupling constants up and z p satisfy the\ncondition\nf d ab updc + f d ac upbd = 0\n\n(5.16)\n\nf c ab zcp = 0 .\n\nIn particular ur should be proportional to an invariant quadratic form on the\nLie algebra of the gauge group G. If G semi-simple, the condition on z p implies\nthat z p = 0. If G is abelian, then the above conditions are satisfied for any\nconstants up and z p .\n\n5.6\n\nThe sigma model multiplet action\n\nThis part of the action has already been described in [8]. Here we shall summarise some of results relevant to this paper. The action of this multiplet is\nSσ = − i\n\nZ\n\n−i\n\nZ\n\nd2 xdθ0+ gij ∇0+ φi ∇= φj +\n\n3\nX\n\na\nνra Wr−\n\nr=1\n\n2\n\nd\n\nxdtdθ0+\n\ni\n\nj\n\n\u0001\n\nk\n\n(5.17)\ni\n\nHijk ∂t φ ∇0+ φ ∇= φ − wia ∂t φ\n\na\nW0−\n\n\u0001\n\n,\n\nwhere νa is a function on M , possibly locally defined, given by\nIr ji (ξaj + waj ) = −∂i νra .\n\n(5.18)\n\nIt has been shown in [17] that under certain conditions ν is a moment map of\nHKT geometry.\nThe gauge transformations of the superfield φ are\nδφi = λa ξa i (φ)\n\n(5.19)\n\nGauge invariance of the above action requires that w should satisfy the conditions mentioned in section 2.2, the moment maps should be globally defined on\nthe sigma model target space M and\nLa νra = −fab c νrc .\n\n5.7\n\n(5.20)\n\nThe action of the fermionic multiplet\n\nThis part of the action is\nZ\n\u0001\nA ̃\nB\nA\nSf = d2 xdθ0+ hAB ψ−\n∇0+ ψ−\n+ msA ψ−\n21\n\n(5.21)\n\n\fGauge invariance of this part of the action requires the same conditions as\nthose appearing for the couplings of (1,0)-multiplet in (2.19).\nThe conditions required by (4,0)-supersymmetry on the couplings of the\nabove action are the same as those of the ungauged model and have been given\nin [15]. These can be easily derived by requiring that the Lagrangian density is\n+ , x= , θ + surface terms. In particular, we find that\nindependent from θr+ up to x+\n0\nhCB Ir C A + hCA Ir C B = 0\nJr j i ∇j hAB + ∇i hAC Ir C B = 0\n1\nJr j i ∇j sA − ∇i sB Ir B A − ∇i hAB LB\nr =0\n2\nsA L A\nr = const .\n\n(5.22)\n\nTo derive the above conditions we have used that ∇Ir = 0 as we have assumed\nin the construction of the fermionic multiplet. The first condition implies that\nthe fibre metric is tri-hermitian. These conditions can be further simplified if\nthe connection B is chosen such that ∇h = 0. In such case, the third equation\nin (5.22) implies that s is the real part of three holomorphic sections of E ∗\neach with respect to the three doublets (Jr , Ir ) of complex structures, ie s is\ntriholomorphic.\n\n5.8\n\nThe action in components and scalar potential\n\nThe part of the action of the theory involving the kinetic term of the gauge\nmultiplets (5.13) can be easily expanded in components as follows:\nZ\na\nb\n0 pq a\nb\nSg = d2 x u0ab F+\n+ χq−\n+= F+\n+= + iuab δ χp− ∇+\nX\na\n+ za0 F+\n(u0ab fra frb + izar fra )\n+= −\n+\n\nr\nb\n1 a\n2iuab χ[0− ∇+\n+ χ1]−\n\n(5.23)\n\nb\n+ 2iu1ab χa[2− ∇+\n+ χ3]−\n\nb\n2 a\nb\n+ 2iu2ab χa[0− ∇+\n+ χ3]−\n+ χ2]− + 2iuab χ[1− ∇+\n\n\u0001\nb\n3 a\nb\n+ 2iu3ab χa[0− ∇+\n+ χ2]− .\n+ χ3]− + 2iuab χ[1− ∇+\n\nTo derive this we have used that {up : 0, . . . , 3} are constant and {ur : 1, 2, 3}\nsymmetric in the gauge indices.\nThe part of the action that contains the kinetic term and the Wess-Zumino\nterm of the sigma model fields in components is as follows,\nZ\ni\nj\ni\nj\ni  ̃ (+) j\nSσ = d2 x gij ∇+\n+ φ ∇= φ + bij ∂+\n+ φ ∂= φ + iλ+ ∇= λ+\nX\n−i\n(νra fra + ∂i νra λi+ χar− )\n(5.24)\nr\n+ igij λi+ χa0− ξa j + iwia λi+ χa0−\ni\n\ni\na\ni\na b\n− Aa+\n+ φ − A+\n+ wia ∂= φ + A= wia ∂+\n+ A= ξ[b wa]i\n\n22\n\n\u0001\n\n\fThe part of the action that contains the kinetic term the fermionic multiplet in\ncomponents is as follows:\nZ\n1\nA ̃\nB\nA B\nA B i j\nSf = d2 x − ihAB ψ−\n∇+\n+ ψ− + hAB l l − hAB ψ− ψ− λ+ λ+ GijAB\n2\n(5.25)\n\u0001\nA\n+ m∇i sA λi+ ψ−\n+ msA lA\n\nAfter eliminating the auxiliary fields of both the gauge multiplet and the\nfermionic multiplet, we find that the action of (4,0)-supersymmetric gauge theories coupled to sigma models is\nZ\na\nb\nA ̃\nB\nSg + Sf = d2 x u0ab F+\n+ ψ−\n+= F+\n+= − ihAB ψ− ∇+\nb\n+ iδ pq u0ab χap− ∇+\n+ χq−\nb\n1 a\nb\n+ 2iu1ab χa[0− ∇+\n+ χ3]−\n+ χ1]− + 2iuab χ[2− ∇+\nb\n2 a\nb\n+ 2iu2ab χa[0− ∇+\n+ χ3]−\n+ χ2]− + 2iuab χ[1− ∇+\nb\n3 a\nb\n+ 2iu3ab χa[0− ∇+\n+ χ2]−\n+ χ3]− + 2iuab χ[1− ∇+\n1\nA B i j\nA\n− hAB ψ−\nψ− λ+ λ+ GijAB + m∇i sA λi+ ψ−\n2\nX\n1\n1\n− uab\n(νra − zar )(νrb − zbr ) − m2 hAB sA sB\n0\n4\n4\nr\nX\n\u0001\na\n+ za0 F+\n∂i zap λi+ χar−\n+= +\n\n(5.26)\n\np\n\nIt is straightforward to write the action S of the (2,0)-supersymmetric gauge\nsigma model in components. In particular we find the following:\nZ\ni\nj\ni\nj\n0\na\nb\nS = d2 x gij ∇+\n+ φ ∇= φ + bij ∂+\n+ φ ∂= φ + uab F+\n+= F+\n+=\nb\n+ iu0ab δ pq χap− ∇+\n+ χq−\nj\nA ̃\nB\n0 a\n ̃ (+)\n+ iλi+ ∇\n+ ψ− + za F+\n= λ+ − ihAB ψ− ∇+\n+=\nX\n1\n1\n(νra − zar )(νrb − zbr )\n− m2 hAB sA sB − uab\n4\n4 0 r\n\n(5.27)\n\n1\nA B i j\nA\n− hAB ψ−\nψ− λ+ λ+ GijAB + m∇i sA λi+ ψ−\n2\ni\ni\na\ni\na b\n− Aa+\n+ φ − A+\n+ wia ∂= φ + A= wia ∂+\n+ A= ξ[b wa]i\n+ i∂i za0 λi+ χa0−\n+ igij λi+ χa0− ξa j + iwia λi+ χa0− + i\n\nX\nr\n\n23\n\n∂i (zar − νra )λi+ χar−\n\n\u0001\n\n\f5.9\n\nScalar Potential and Classical Vacua\n\nThe scalar potential of the (4,0)-supersymmetric gauged sigma models is\n3\n\nV =\n\n1 X ab\n1\nu νra νrb + mhAB sA sB ,\n4 r=1 0\n4\n\n(5.28)\n\nwhere we have absorbed the constants zar into the definition of the moment maps\nνra . The scalar potential in these models is written as a sum of a 'D' and an\n'F ' term. The classical supersymmetric vacua of the theory are those for which\nνra = 0\n\nsA = 0 .\n\n(5.29)\n\nThe inequivalent classical vacua are the space of orbits of the gauge group on\nthe zero set of the section s and the HKT moment maps νr . If the section s\nvanishes, then the space of inequivalent vacua is the theory is the HKT reduction\nM//G of the sigma model target space M . It has been shown in [17] that under\ncertain assumptions the space of vacua inherits the HKT structure of the sigma\nmodel manifold M and it is a smooth space. However the three-form of the\nWess-Zumino term on M//G is not necessarily closed.\n\n6\n6.1\n\n(1, 1) supersymmetry\nThe gauge multiplet\n\n+ , x= , θ + , θ − ), where θ ± are GrassThe (1, 1) superspace Ξ1,1 has coordinates (x+\nman valued odd coordinates. The (1,1)-supersymmetric Yang-Mills multiplet is\ndescribed by a connection A in superspace with components (A+\n+ , A= , A+ , A− ).\nIn addition it is required that these satisfy the supersymmetry constraints [8]\n\n[∇+ , ∇− ] = W\n\n[∇+\n+ , ∇= ] = F+\n+=\n\n[∇+ , ∇+ ] = 2i∇+\n+\n\n[∇− , ∇− ] = 2i∇=\n\n(6.1)\n\n(We have suppressed the gauge indices.) The Jacobi identities imply that\n[∇+ , ∇= ] = i∇− W\n\n[∇− , ∇+\n+ ] = i∇+ W\n\nF+\n+= = ∇+ ∇− W\n\n(6.2)\n\nIt is worth mentioning that the (1,1)-supersymmetric gauge multiplet can be\nconstructed from a scalar superfield. This allows for the possibility of nonpolynomial couplings between the sigma model multiplet and the gauge multiplet. The components of the gauge multiplet are\nW = W|\n\nF+\n+= = ∇+ ∇− W |\n\nχ+ = ∇+ W |\n\nχ− = ∇− W |\n\n(6.3)\n\nThe field, W , is a scalar, χ+ ,χ− are gaugini which are real chiral fermions in\ntwo dimensions, and F+\n+= is the (gauge) field strength.\n24\n\n\f6.2\n\nThe sigma model multiplet\n\nLet M be a Riemannian manifold with metric g and locally defined two-form b.\nWe take the gauge group G to act on M with isometries preserving the WessZumino three-form H = db and generating the vector fields ξa as in section 2.1.\nIn addition we assume that the one-form w satisfies the conditions of section\n2.2.\nThe sigma model (1,1) multiplet φ is a map from the (1,1) superspace Ξ1,1\ninto the Riemannian manifold M . The components of φ are as follows,\nφi = φi |\n\nli = ∇+ ∇− φi |\n\nλi+ = ∇+ φi |\n\nλi− = ∇− φi | ,\n\n(6.4)\n\nwhere ∇+ φi = D+ φi + Aa+ ξai and similarly for ∇− . Observe that the first two\ncomponents of (1, 1) superfield φ can be identified with the two components\nof a (1, 0) superfield φ while the latter two components can be identified with\nthose of a (1, 0) fermionic superfield ψ− . The vector bundle associated with this\nfermionic multiplet is the tangent bundle of M .\n\n6.3\n\nAction\n\nThe action of the (1,1)-supersymmetric gauged sigma model can be written as\nsum of three terms,\nS = Sg + Sσ + Sp ,\n\n(6.5)\n\nwhere Sg is the action of the gauge multiplet, Sσ is the action of the sigma-model\nmultiplet and Sp is a potential term. We shall describe each term separately.\n\n6.4\n\nThe gauge multiplet action\n\nAn action of the (1,1)-supersymmetric gauge multiplet is most easily written in\n(1,1) superspace. In particular we have\nZ\n\u0001\n1\nSg = d2 xdθ+ dθ− −uab ∇+ W a ∇− W b + vab W a W b + za W a ,\n(6.6)\n2\nwhere uab = uab (φ), u is not necessarily symmetric in the gauge indices, vab =\nvab (φ) and the theta term za = za (φ). Of course this action is manifestly (1,1)supersymmetric because it is an integral over full superspace. Gauge invariance\nimposes the additional conditions\nLa ubc = −f dab udc − f d ac ubd\nLa vbc = −f dab vdc − f d ac vbd\nLa zb = −f\n\nd\n\nab zd\n\non the couplings u,v and z.\n25\n\n(6.7)\n\n\fThe action (6.6) can be easily expanded in components to find\nZ\na\nb\na\nb\nSg = d2 x + uab F+\n+ W ∇= W\n+= F+\n+= − uab ∇+\na b\na\nb\n+ iuab ∇+\n+ χ− χ− − iuab χ+ ∇= χ+\na\ni b\ni a b\n+ ∂i uab F+\n+= λ+ χ− − ∂i uab λ− χ+ F+\n+=\nb\n+ i∂i uab λi+ χa+ ∇= W b + i∂i uab λi− ∇+\n+ Wa χ−\n\n+ uab f bcd χa+ χc− W d − ∇i ∂j uab λi+ λj− χa+ χb− − ∂i uab li χa+ χb−\nb\n+ vab χa+ χb− + vab W a F+\n+=\n\n(6.8)\n\n+ ∂i vab λi+ Wa χb− − ∂i vab λi− χa+ W b\n1\n1\n+ ∇i ∂j vab λi+ λj− W a W b + ∂i vab li W a W b\n2\n2\na\ni\ni\n+ za F+\n+= + ∂i za λ+ χ− − ∂i za λ− χ+\n\u0001\n+ li ∂i za W a + λi+ λj− ∇i ∂j za W a .\n\n6.5\n\nThe sigma model multiplet action and potential term\n\nA (1,1)-supersymmetric gauged sigma model action has been given in [8]. This\naction can be written as\nZ\nSσ = d2 xdθ+ dθ− gij ∇+ φi ∇− φj\nZ\n(6.9)\n\u0001\n+ d2 xdtdθ+ dθ− Hijk ∂t φi ∇+ φj ∇− φk − wia ∂t φi W−a\nThis can be rewritten without the t integration as\nZ\nSσ = d2 xdθ+ dθ− gij ∇+ φi ∇− φj + bij D+ φi D− φj\n\n(6.10)\n\u0001\ni\n− Aa+ wia D− φi − Aa− wia D+ φj + Aa− Ab+ ξ[b\nwa]i .\n\nIt is straightforward to add a potential term to the above actions as\nZ\nSp = d2 xdθ+ dθ− h\n(6.11)\nwhere h = h(φ) is a function of the superfield φ. Gauge invariance of the above\naction requires that w should satisfy the conditions stated in section 2.2.\n\n6.6\n\nA generalisation of the action\n\nThe action of (1,1)-supersymmetric gauge theory presented above can be generalized by allowing the various couplings of the theory to depend on the scalar\ncomponent of the gauge multiplet superfield. Supersymmetry then requires\n\n26\n\n\fadditional fermionic couplings. The new theory can be organised as a (1,1)supersymmetric sigma model which has target space L = M × L(G), where\nL(G) is the Lie algebra of the gauge group G. The various allowed couplings\nare restricted by two-dimensional Lorentz invariance, supersymmetry and gauge\ninvariance. The superfields of the (1,1)-supersymmetric gauge theory coupled\nto sigma model matter are maps Z = (φ, W ) from the (1,1) superspace Ξ1,1 into\nL, where φ is the usual (1,1) sigma model superfield and W is the (1,1) gauge\ntheory multiplet. We again allow the gauge group G to act on L with a group\naction on M and the adjoint action on L(G). The vector fields generated by\nsuch a group action are\nξa = ξaA ∂A = ξai ∂i + W b f c ab ∂c\n\n(6.12)\n\nwhere A = (i, a), the component ξ i is allowed to depend on both φ and W , and\nthe partial derivative with the gauge index denotes differential with respect to\nW.\nNext we introduce a metric g and a Wess-Zumino term H on L and assume\nthat the gauge group G acts on L with isometries leaving the Wess-Zumino\nterm H invariant. We also define w as iξa H = dwa , where ξa is the new Killing\nvector field (6.12). Then an action can be written for this new sigma model as\nZ\n\u0001\nSσ = d2 xdθ+ dθ− gAB ∇+ Z A ∇− Z B + h\nZ\n(6.13)\n\u0001\nA\nB\nC\nB\na\n2\n+\n−\n+ d xdtdθ dθ HABC ∂t Z ∇+ Z ∇− Z − wBa ∂t Z W−\nwhere h is a function which depends on Z. This action is clearly supersymmetric\nbecause it is a full (1,1) superspace integral. Gauge invariance requires that w\nabove satisfies all the conditions stated in section 2.2 but for the group action\nwith associated vector fields (6.12) and a Wess-Zumino term in L. In addition,\ngauge invariance requires that\nLa h = 0\n\n(6.14)\n\nwhere the Lie derivative is with respect to the vector field (6.12).\n\n6.7\n\nScalar Potential\n\nTo compute the scalar potential we express the action in components and eliminate the auxiliary field of the sigma model superfield φ from the action using\nthe field equations. The scalar potential is\n1\nV (W, φ) = g ij ∂i h∂j h ,\n(6.15)\n4\nwhere g ij is the inverse of the restriction of the metric of L on M . Observe that\nV depends on both the sigma model scalar φ and the gauge multiplet scalar\nW . The classical supersymmetric vacua of the theory are those values of (φ, W )\nfor which ∂i h = 0. For example, for the special (1,1)-supersymmetric model\ninvestigated in the beginning of the section, V = 41 g ij (∂i h + ∂i za W a )(∂j h +\n∂j zb W b ), where in this case h = h(φ).\n27\n\n\f7\n7.1\n\n(2, 1) supersymmetry\nThe gauge multiplet\n\n+ , x= , θ + , θ − ), where (x+\n+ , x= ) are\nThe (2, 1) superspace Ξ2,1 has coordinates (x+\np\n+\n+\n−\nthe even and (θ0 , θ1 , θ ) are odd coordinates. The (2,1)-supersymmetric YangMills multiplet is described by a connection A in superspace with components\n(A+\n+ , A= , Ap+ , A− ), p = 0, 1. In addition it is required that these satisfy the\nsupersymmetry constraints [8]\n\n[∇+\n+=\n+ , ∇= ] = F+\n\n[∇p+ , ∇− ] = Wp\n\n[∇− , ∇− ] = 2i∇= .\n\n[∇p+ , ∇q+ ] = 2iδpq ∇+\n+\n\n(7.1)\n\nWe have suppressed the gauge indices. We remark that Wp are scalar superfields.\nThe Jacobi identities imply that\n[∇− , ∇+\n+ ] = i∇0+ W0\n\n[∇p+ , ∇= ] = i∇− Wp\na\nF+\n+=\n\n=\n\n∇0+ ∇− W0a\n\n∇1+ W1 = ∇0+ W0\n\n(7.2)\n\n∇1+ W0 + ∇0+ W1 = 0 .\nThe two scalar superfields (W0 , W1 ) can be viewed as a map W from the (2,1)\nsuperspace Ξ2,1 into LG⊗ R2 , where LG is the Lie algebra of the group G. Next\nintroduce a complex structure I = Id ⊗ ǫ in LG ⊗ R2 where ǫ is the constant\ncomplex structure in R2 with ǫ0 1 = −1. The last two conditions in (7.1) can be\nexpressed as\n∇1+ W ap = ǫp q ∇0+ W aq .\n\n(7.3)\n\nIn fact this implies that W is a covariantly chiral superfield, (∇1+ + i∇0+ )(W1 +\niW0 ) = 0.\nThe components of the gauge superfields Wp are\nWp = Wp |\nχ0+ = ∇0+ W0 |\n\nF+\n+= = ∇0+ ∇− W0 |\nχ1+ = ∇0+ W1 |\n\nf = ∇0+ ∇− W1 |\nχp− = ∇− Wp | ,\n(7.4)\n\nwhere Wp are scalars, χp+ and χp− are the gaugini which are real chiral fermions\nin two dimensions, F+\n+= is the field strength and f is a real auxiliary field. As\nin the (1,1)-supersymmetric gauge theory, the gauge multiplet is determined by\nscalar superfields. This will lead again to non-polynomial interactions between\nthe gauge and sigma multiplets of the theory.\n\n7.2\n\nThe sigma model multiplet\n\nLet M be a KT manifold with metric g and complex structure J. We in addition\nassume that the gauge group G acts on M with isometries which furthermore\npreserve the complex structure J and the Wess-Zumino term H. These conditions are the same as those in the case of (2,0)-supersymmetric theory. The\n28\n\n\f(2,1) sigma model superfield φ is a map from the (2,1) superspace Ξ2,1 into the\nsigma model manifold M . In addition it is required that\n∇1+ φi = J i j ∇0+ φj ,\n\n(7.5)\n\nwhere ∇p+ φi = Dp+ φi + Aap+ ξai and ξa are the vector fields on M generated\nby the group action. As we have seen, the (2,1) gauge multiplet satisfies the\ncondition (7.3) similar to (7.5). The superfield φ is also covariantly chiral, as can\nbe seen by choosing complex coordinates on the sigma model manifold M . These\nresults will be used later for the construction of actions of (2,1)-supersymmetric\ngauge theories coupled to sigma models.\nThe components of the sigma model multiplet φ are as follows:\nφi = φi |\n\nli = ∇0+ ∇− φi |\nλi− =∇− φi | ,\n\nλi+ =∇0+ φi |\n\n(7.6)\n\nwhere φ is a scalar, λ+ and λ− are real fermions, and l is an auxiliary field.\n\n7.3\n\nAction\n\nAn action of a (2,1)-supersymmetric gauge theory coupled to sigma model matter can be written as\nS = Sg + Sσ + Sp ,\n\n(7.7)\n\nwhere Sg is the action of the gauge multiplet, Sσ is the action of the sigmamodel multiplet and Sp contains the potential term. We shall describe each\nterm separately.\n\n7.4\n\nThe gauge multiplet action\n\nAn action for the (2,1)-supersymmetric gauge multiplet is\nZ\nSg = d2 xdθ0+ dθ− − u0ab δ pq ∇0+ Wpa ∇− Wqb\n+ u1ab δ pq ∇1+ Wpa ∇− Wqb + zap Wpa\n\n(7.8)\n\u0001\n\nwhere u0 , u1 are the gauge coupling constants and z p are theta term type of\ncouplings. All the couplings are allowed to depend on the superfield φ. We shall\nassume that both u0 , u1 are symmetric in the gauge indices but this restriction\ncan be lifted.\nObserve that the action (7.8) is not an integral over the full Ξ2,1 superspace. Therefore it is not manifestly (2,1)-supersymmetric. The requirement of\ninvariance of the action under (2,1) supersymmetry imposes the conditions\nJ j i ∂j u0ab = −∂i u1ab\nJ j i ∂j za1 = −∂i za0 .\n29\n\n(7.9)\n\n\fTherefore the couplings u0 + iu1 and z 1 + iz 0 are holomorphic.\nIn addition gauge invariance of the action (7.8) implies that\nLa upbc = −f dab updc − f d ac upbd\n\n(7.10)\n\nLa zbp = −f dab zdp .\n\n7.5\n\nThe sigma model multiplet action and potential\n\nThe action of the (2,1)-supersymmetric gauged sigma model with Wess-Zumino\nterm has been given in [8]. Here we shall summarise some of results relevant to\nthis paper. The action of this multiplet is\nZ\n\u0001\nSσ = d2 xdθ0+ dθ− gij ∇0+ φi ∇− φj + νa W1a\nZ\n(7.11)\n\u0001\n+ d2 xdtdθ+ dθ− Hijk ∂t φi ∇0+ φj ∇− φk − wia ∂t φi W−a\nThis action can be written without the t integration as\nZ\nSσ = d2 xdθ+ dθ− gij ∇+ φi ∇− φj + bij D+ φi D− φj\ni\n− Aa+ wia D− φi − Aa− wia D+ φj + Aa− Ab+ ξ[b\nwa]i\n\n(7.12)\n\u0001\n\nGauge invariance of the above action requires that w should satisfy the\nconditions described in section 2.2. As in the case of (2,0)-supersymmetric\ngauged sigma model, it is also required that ν is globally defined and La νb =\n−fab c νc . In fact ν is a moment map associated with the action of the gauge\ngroup on the KT manifold M .\nThe part of the action involving the potential is\nZ\nSp = d2 xdθ0+ dθ− h ,\n(7.13)\nwhere h = h(φ) Invariance under (2,1) supersymmetry requires that\n∂i h = J k i ∂k h1\n\n(7.14)\n\nwhere h1 = h1 (φ). This implies that h is the real part of a holomorphic function\non M .\nThe scalar potential of (2,1)-supersymmetric gauge theories coupled to sigma\nmodels described above is\nV =\n\n1\n1 ab\nu0 (νa + za1 )(νb + zb1 ) + g ij (∂i h + ∂i zap Wpa )(∂j h + +∂j zap Wpa ) . (7.15)\n4\n4\n\n30\n\n\f7.6\n\nA generalisation\n\nAs we have shown both the (2,1) gauge multiplet and the (2,1) sigma model\nmultiplet are constructed from covariantly chiral scalar superfields, ie both satisfy the conditions (7.5) and (7.3). Because of this, these two superfields can\nbe combined to a single superfield Z = (W0 , W1 , φ) which is a map from the\n(2, 1) superspace Ξ2,1 into (LG ⊗ R2 ) × M . In addition we can take Z to satisfy\na chirality condition which is the combination of (7.3) and (7.5). Next we can\ntake the gauge group G to act on (LG ⊗ R2 ) × M with the adjoint action in\nthe first factor and a group action on M . The vector fields associated by such\na group action are\nξa =\n\nX\n\nf c ab Wpb\n\np\n\n∂\n+ ξ i ∂i .\n∂Wpc\n\n(7.16)\n\nTreating the (2,1)-supersymmetric gauge theory coupled to sigma model\nmatter as a sigma model with superfield Z, which satisfies (7.3) and (7.5), we\ncan write the action\nZ\n\u0001\nSσ = d2 xdθ0+ dθ− gAB ∇0+ Z A ∇− Z B + νa W1a + h\nZ\n\u0001 (7.17)\n+ d2 xdtdθ+ dθ− HABC ∂t Z A ∇0+ Z B ∇− Z C − wBa ∂t Z B W−a\nwhere now all the couplings are defined using the geometry of (LG ⊗ R2 ) × M .\nOf course (2,1)-supersymmetric requires that (LG ⊗ R2 ) × M is a KT manifold\nwith respect to the complex structure (J, id ⊗ ǫ). In particular the metric and\nthe rest of the couplings depend on the coordinates of (LG ⊗ R2 ) × M . The\nconditions for gauge invariance are easily determined from those of the (2,1)supersymmetric gauged sigma model. We remark that the couplings of (7.17)\ncan be arranged such that the SO(2) R-symmetry of the (2, 1)-supersymmetry\nalgebra is broken. In particular the SO(2) rotation that rotate the Wp scalar\ncomponents is not a symmetry of the action. However if one insists in preserving\nthe R-symmetry, then the KT manifold (LG ⊗ R2 ) × M should admit a SO(2)\naction preserving all the geometric data.\n\n8\n8.1\n\n(4, 1) supersymmetry\nThe gauge multiplet\n\n+ , x= , θ + , θ − ), where (x+\n+ , x= )\nThe (4, 1) superspace Ξ4,1 has coordinates (x+\np\n− +\nare the even and {θ , θp , p = 0, . . . , 3} are the odd coordinates. The (4,1)supersymmetric Yang-Mills multiplet is described by a connection A in Ξ4,1\nsuperspace with components (A+\n+ , A= , Ap+ , A− ) with p = 0, . . . 3. In addition\n\n31\n\n\fit is required that these satisfy the supersymmetry constraints [8]\n[∇p+ , ∇− ] = Wp\n[∇p+ , ∇q+ ] = 2iδpq ∇+\n+\n\n[∇+\n+ , ∇= ] = F+\n+=\n[∇− , ∇− ] = 2i∇=\n\n∇p+ Wq = ǫpq\n\np′ q′\n\n(8.1)\n\n∇p′ + Wq′ .\n\n(We have suppressed all the gauge indices.) The Jacobi identities imply that\n[∇p+ , ∇= ] = i∇− Wp\n[∇− , ∇+\n+ ] = i∇0+ W0\na\na\nF+\n+= = ∇0+ ∇− W0\n\n(8.2)\n\n∇p+ Wq + ∇q+ Wp = 0 (p 6= q)\n∇0+ W0 = ∇1+ W1 = ∇2+ W2 = ∇3+ W3\nThe (4,1) gauge multiplet is determined by four scalar superfields. Some\nof the conditions on these superfields given in (8.1), like in the (2,1) model\npreviously, can be expressed as conditions of a (4,1) sigma model multiplet.\nFor this, view the four-scalar superfields {Wp : p = 0, 1, 2, 3} as maps from\nthe superspace Ξ4,1 into LG ⊗ R4 , where LG is the Lie algebra of the gauge\ngroup G. Then introduce three constant complex structures {Ir } in R4 such\nthat (Ir )0 s = δrs and (Ir )s t = −ǫrst where r, s, t = 1, 2, 3. The conditions on\nWp in (8.1) and (8.1) can be expressed as\n∇r+ Wpa = Ir q p ∇0+ Wqa .\n\n(8.3)\n\nThe components of the gauge multiplet are\nWp = Wp |\n\nF+\n+= = ∇0+ ∇− W0 |\n\nχp− = ∇− Wp |\n\nχp+ = ∇0+ Wp |\n\n(8.4)\n\nfr = ∇0+ ∇− Wr | r = 1, 2, 3 ,\nwhere Wp are scalars, χp+ ,χp− are the gaugini which are real chiral fermions\nin two dimensions, F+\n+= is the field strength and {fr : r = 1, 2, 3} are auxiliary\nfields. The SO(4) R-symmetry of the (4,1)-supersymmetric gauge theory rotates\nboth the scalars and the fermions of the gauge multiplet.\n\n8.2\n\nThe sigma model multiplet\n\nLet M be a HKT manifold with metric g and hypercomplex structure {Jr ; r =\n1, 2, 3}. We in addition assume that the gauge group G acts on M with\nisometries which in addition preserve the hypercomplex structure Jr and the\nWess-Zumino term H. These conditions are the same as in the case of (4,0)supersymmetric model. The (4,1) sigma model superfield φ is a map from the\n(4,1) superspace Ξ4,1 into the sigma model manifold M . In addition it is required that\n∇r+ φi = Jr i j ∇0+ φj ,\n32\n\n(8.5)\n\n\fwhere ∇p+ φi = Dp+ φi +Aap+ ξai and ξ are the vector fields on M generated by the\ngroup action. As we have seen the (4,1) gauge multiplet satisfies the condition\n(8.3) similar to (8.5). These results will be used later for the construction of\nactions of (4,1)-supersymmetric gauge theories coupled to sigma models.\nThe components of the sigma model (4,1) multiplet φ are as follows,\nφi = φi |\n\nli = ∇0+ ∇− φi |\n\nλi+ = ∇0+ φi |\n\nλi− = ∇− φi | ,\n\n(8.6)\n\nwhere φ is a scalar, λ+ and λ− are real fermions, and l is an auxiliary field.\n\n8.3\n\nAction\n\nThe action of a (4,1)-supersymmetric gauged theory coupled to sigma model\nmatter can be written as\nS = Sg + Sσ + Sp ,\n\n(8.7)\n\nwhere Sg is the action of the gauge multiplet, Sσ is the action of the sigma-model\nmultiplet and Sp is the potential. We shall describe each term separately.\n\n8.4\n\nThe gauge multiplet action\n\nAn action for the (4,1)-supersymmetric gauge multiplet is\nZ\nSg = d2 xdθ0+ − u0ab δ pq ∇0+ Wpa ∇− Wqb\n+ urab δ pq ∇r+ Wpa ∇− Wqb + zap Wpa\n\n(8.8)\n\u0001\n\nwhere {up } = {u0 , ur } and z p are the gauge coupling constants and theta type\nof terms, respectively, which in general depend on the superfield φ. We shall\nassume that both up are symmetric in the gauge indices but this restriction can\nbe lifted.\nObserve that this action is not an integral over the full Ξ4,1 superspace.\nTherefore it is not manifestly (4,1)-supersymmetric. The requirement of invariance under (4,1) supersymmetry imposes the condition that up and z p are\nconstant. This is similar to the condition that arises in (4,0) supersymmetric\ngauge theories. In addition, gauge invariance of the action (8.8) requires that\nf d ab updc + f d ac upbd = 0\nf d ab zdp = 0 .\n\n(8.9)\n\nThus up must be invariant quadratic forms on the Lie algebra of the group G\nand z p must be invariant elements of the Lie algebra. Of course z p = 0, if G is\nsemi-simple.\n\n33\n\n\f8.5\n\nThe sigma model multiplet action and the potential\n\nAn action for the (4,1) sigma model multiplet coupled to gauge fields has been\ngiven in [8]. Here we shall summarise some of results relevant to this paper.\nThe action of the (4,1)-supersymmetric gauged sigma model is\nZ\nX\n\u0001\nSσ = d2 xdθ+ dθ− gij ∇+ φi ∇− φj +\nνar Wra\nr\n\n+\n\nZ\n\n2\n\n+\n\nd xdtdθ dθ\n\n−\n\ni\n\n(8.10)\n\nj\n\n\u0001\nHijk ∂t φ ∇+ φ ∇− φk − wia ∂t φi W−a .\n\nThe gauge transformations of φ are δφi = λa ξa i (φ). Gauge invariance of the\nabove action requires that w should satisfy the conditions described in section\n2.2. As in the case of (4,0)-supersymmetric gauged sigma model, ν r should\nsatisfy La νbr = −fab c νcr . In fact ν r is a moment map associated with the action\nof the gauge group G on the HKT manifold M .\nThe part of the action involving the potential is\nZ\nSp = d2 xdθ0+ dθ− h ,\n(8.11)\nwhere h = h(φ). Invariance under (4,1) supersymmetry requires that\n∂i h = Jr k i ∂k hr\n\n(8.12)\n\nwhere hr = hr (φ). This implies that h is the real part of three holomorphic\nfunctions on M , ie h is tri-holomorphic.\nThe scalar potential of (4,1)-supersymmetric gauge theories coupled to sigma\nmodels is\nV =\n\n3\n1 ab X r r 1 ij\nu0\nνa νb + g ∂i h∂j h ,\n4\n4\nr=1\n\n(8.13)\n\nwhere we have shifted the moment maps νr by a constant zr .\n\n8.6\n\nA generalisation\n\nAs we have shown both the (4,1) gauge multiplet and the (4,1) sigma model\nmultiplet are constructed from scalar superfields which satisfy the similar constraints (8.3) and (8.5), respectively. Because of this, these two superfields can\nbe combined to a single superfield Z = (W, φ) which is a map from the (4, 1)\nsuperspace Ξ4,1 into (LG ⊗ R4 ) × M . In addition we can take Z to satisfy a\ncondition which is the combination of (8.5) and (8.3). Next we can take the\ngauge group G to act on (LG ⊗ R4 ) × M with the adjoint action in the first\nfactor and a group action on M . The vector fields associated by such a group\naction are\nX\n∂\nξa =\nf c ab Wpb\n+ ξ i ∂i .\n(8.14)\nc\n∂W\np\np\n34\n\n\fTreating the (4,1)-supersymmetric gauge theory coupled to sigma model\nmatter as a sigma model with superfield Z, which satisfies (8.3) and (8.5), we\ncan write the action\nZ\nX\n\u0001\nSσ = d2 xdθ0+ dθ− gAB ∇0+ Z A ∇− Z B +\nνar Wra + h\nr\n\n+\n\nZ\n\n2\n\n+\n\nd xdtdθ dθ\n\n−\n\nA\n\nB\n\n(8.15)\n\nC\n\nHABC ∂t Z ∇0+ Z ∇− Z − wBa ∂t Z\n\nB\n\nW−a\n\n\u0001\n\nwhere now all the couplings are defined using the geometry of (LG ⊗ R4 ) × M .\nOf course (4,1)-supersymmetry requires that (LG ⊗ R4 ) × M is a HKT manifold\nwith respect to the hypercomplex structure (Jr , Ir ). In particular the metric\nand the rest of the couplings depend on the coordinates of (LG ⊗ R4 ) × M . The\nconditions for gauge invariance are easily determined from those of the (4,1)supersymmetric gauged sigma model. We remark that the couplings of (8.15)\ncan be arranged such that the SO(4) R-symmetry of the (4, 1)-supersymmetry\nalgebra is broken. In particular the SO(4) rotation that rotates the Wp scalar\ncomponents is not a symmetry of the action. However if one insists in preserving\nthe R-symmetry, then the HKT manifold (LG ⊗ R4 ) × M should admit a SO(4)\naction preserving all the geometric data.\n\n9\n\nA bound for vortices in the (2,0) model\n\nVortices are the instantons of two-dimensional gauge theories coupled to sigma\nmodels. Bogomol'nyi type of bounds for both abelian [20] and non-abelian\nvortices [21, 22] have been investigated in the context of linear sigma models.\nHere we shall establish bounds for vortices for non-linear sigma models. For\nthis we shall consider the Euclidean action of the (2,0)-supersymmetric gauge\nsigma model without Wess-Zumino term. The sigma model target space M\nis Kähler with metric g, complex structure J and associated Kähler form ΩJ\n((ΩJ )ij = gik J k j ). After a Wick rotation the two-dimensional spacetime is R2\nwith the standard Euclidean metric. The relevant part of the bosonic Euclidean\naction of a (2,0)-supersymmetric gauge theory coupled to a sigma model is\nZ\n\u0001\n1\n1\n1\na\nb μλ νρ\nd2 x gij δ μν ∇μ φi ∇ν φj + uab Fμν\nSE =\nFλρ\nδ δ + uab νa νb . (9.1)\n2\n2\n4\n2\nR\nNext we introduce I a constant complex structure on R2 such that R2 is a\nKähler manifold. The associated Kähler form ΩI is the volume form of R2 . In\nsuch a case the Euclidean action (9.1) can be rewritten as\nZ\n\u00021\n1\n1\nSE = d2 x uab (ΩI * F a ∓ ν a )(ΩI * F b ∓ ν b )\n4\n2\n2\n1\nμν ρ\ni\nk i\nσ\n(9.2)\n+ gij δ (I μ ∇ρ φ ∓ ∇μ φ J k )(I ν ∇σ φj ∓ ∇ν φl J j l )]\nZ4\n((ΩJ )ij ∇φi ∧ ∇φj + νa F a )\n\n±\n\nR2\n\n35\n\n\fwhere ΩI * F = (ΩI )μν Fμν , ν a = uab νb , uab = u0ab and uac ucb = δ a b (uab =\nu(ab) ). We remark that the above expression for the Euclidean action has been\nconstructed from (9.1) by completing squares and collecting all the remaining\nterms which organise themselves in the last term of (9.2).\nThe last term in (9.2),\nZ\nQ=\nωJ ,\n(9.3)\nR2\n\nis a topological charge, where the form\nωJ = (ΩJ )ij ∇φi ∧ ∇φj + νa F a\n\n(9.4)\n\nis the equivariant extension of the Kähler form ΩJ of the sigma model target\nspace M . The form ωJ is closed. Viewing ωJ as form on R2 , it is apparent. In\nfact ωJ is closed as a two-form on any manifold N for any map φ from N into\nthe sigma model manifold M and for any choice of connection A. This can be\neasily seen and we shall not demonstrate it here.\nThe Euclidean action of the (2,0)-supersymmetric two-dimensional gauge\ntheory coupled to a sigma model is bounded by the absolute value of the topological charge Q, SE ≥ |Q|. This is because it is always possible to choose the\nsigns in the Bogomol'nyi bound above such that the topological term is positive.\nIf the topological charge is positive, then the bound is attained whenever\nΩI * F a − ν a = 0\nJ i j ∇μ φj − ∇ν φi I ν μ = 0 .\n\n(9.5)\n\nIn two-dimensions, the curvature F is a (1,1)-form. Choosing complex coordinates (z, z̄) on R2 with respect to the complex structure I, it is always possible\nto arrange using a (complex) gauge transformation that Az̄ = 0. Choosing complex coordinates in the sigma model target space M as well, it is easy to see\nthat the second BPS condition implies that the map φ is holomorphic from the\nspacetime R2 into the sigma model manifold M .\nA special case of this bound arises for gauge theories couple to linear sigma\nmodels for which the sigma model manifold M = R2n with the Euclidean metric and equipped with a constant compatible complex structure J. This case\nincludes the Nielsen-Olesen vortices [19]. (For these, existence of a solution was\nshown in [23] and the moduli were studied in [30], [21] and more recently in [31],\nsee also [32]). The case with a single complex scalar has been analysed in [20].\nChoosing complex coordinates {q α ; α = 1, . . . , n} in R2n , we write\nX\nds2 =\ndq α dq ᾱ\nα\n\nΩJ = −i\n\nX\n\ndq α ∧ dq ᾱ .\n\nα\n\n36\n\n(9.6)\n\n\fNext consider the abelian group U (1)-action q α → eiQα t q α which generates the\nholomorphic Killing vector fields\nX\n∂\n∂\nξ=i\nQα (q α α − q ᾱ ᾱ ) .\n(9.7)\n∂q\n∂q\nα\nThe moment map is\nν=−\n\nX\n(Qα q α q ᾱ ) − Λ ,\n\n(9.8)\n\nα\n\nwhere Λ is a (cosmological) constant. This is an example of a (2, 0)-supersymmetric\ngauged linear sigma model with gauge group U (1) of the type considered in [5].\nThe topological charge is\nZ\nX\n\u0001\nQ=\nd2 z\nα(∇z q α ∇z̄ q ᾱ − ∇z̄ q α ∇z q ᾱ ) + νFzz̄\n(9.9)\nR2\n\nα\n\nwhere ∇z q = ∂z q + iAz Qα q α , ∇z q ᾱ = ∂z q ᾱ − iAz Qα q ᾱ , ∇z̄ q ᾱ = (∇z q α )∗ and\n∇z̄ q α = (∇z q ᾱ )∗ , and Fzz̄ = ∂z Az̄ − ∂z̄ Az . To compare the bound above (9.2)\nwith that of vortices in [5], we observe that after some integration by parts we\nhave\nZ\nX\n\u0001\n(9.10)\nQα (∂z q α ∂z̄ q ᾱ − ∂z̄ q α ∂z q ᾱ ) − ΛFzz̄ + surfaces\nd2 z\nQ=\nR2\n\nα\n\nα\n\nThe first term in the above expression is the topological charge expected for\nthe vortices (instantons) of ungauged two-dimensional sigma models. The same\ntopological charge also appears in the kink solitons of three-dimensional nonlinear sigma models. The last part in the above expression involving the cosmological constant and the Maxwell field is the usual degree of an abelian vortex.\nThe relation between the topological charge Q in (9.9) and the degree of an\nabelian vortex involves integration by parts. Under certain boundary conditions the two topological charges are the same. However as we have shown, the\nbound that involves the equivariant extension of the Kähler form generalizes in\nthe context of gauge theories coupled to non-linear sigma models.\n\n10\n\nA bound for vortices in the (4,0) model\n\nA bound similar to the one we have described in the previous section for the\nEuclidean action of (2,0)-supersymmetric gauge theory coupled to sigma model\nmatter can also be found for the Euclidean action of (4,0)-supersymmetric gauge\ntheory. The Euclidean action of a (4,0)-supersymmetric gauge theory coupled\nto sigma model matter with vanishing Wess-Zumino term is\nSE =\n\nZ\n\n3\n\nd2 x\n\nR2\n\n1\n1\n1 X ab X r r \u0001\na\nb μλ νρ\ngij δ μν ∇μ φi ∇ν φj + uab Fμν\nFλρ\nδ δ +\nu\nνa νb\n2\n2\n4 r=1\nr\n(10.1)\n37\n\n\fThe sigma model target space is hyper-Kähler with metric g, hypercomplex\nstructure {Jr : r = 1, 2, 3} and associated Kähler forms ΩJr . After the Wick\nrotation, the two-dimensional spacetime is R2 with the standard Euclidean metric. Let I be a compatible constant complex structure such that R2 is a Kähler\nmanifold with associated Kähler form ΩI . In such a case the Euclidean action\ncan be written as\nZ\n3\n1X\nSE = d2 x [\nuab (ar ΩI * F a ∓ νra )(ar ΩI * F b ∓ νrb )\n4 r=1\n3\n\n1 X μν\nδ gij (ar I ρ μ ∇ρ φi ∓ ∇μ φk Jri k )(ar I σ ν ∇σ φi ∓ ∇ν φl Jrj l )] (10.2)\n4 r=1\nZ X\n3\nar ω J r ,\n±\n\n+\n\nR2 r=1\n\nwhere {ar : r = 1, 2, 3} is a constant vector with length one,\nuab = u0ab = u0ba , νra = uac νrc , uac ucb = δ a b and\nωJr = (ΩJr )ij ∇φi ∧ ∇φj + νa F a\n\nP3\n\n2\nr=1 (ar )\n\n= 1,\n\n(10.3)\n\nis the equivariant extension of the Kähler form ΩJr .\nThe strictest bound is attained whenever the unit vector {ar : r = 1, 2, 3} is\nparallel to the vector of the topological charges Qr : r = 1, 2, 3}, where\nZ\n(10.4)\nω Jr\nQr =\nR2\n\nand the sign is chosen such that the topological term in the bound is positive. If\nthe inner product of {ar : r = 1, 2, 3} and {Qr : r = 1, 2, 3} in (10.2) is positive,\nwe have that\nq\nSE ≥ Q21 + Q22 + Q23 .\n(10.5)\nThis bound is attained whenever\nar ΩI * F a − νra = 0\nJr i j ∇μ φj − ar ∇ν φi I ν μ = 0 .\n\n(10.6)\n\nUsing a rotation in the space of three complex structures, we can arrange\nsuch that a1 = 1 and a2 = a3 = 0. In such case, the last equation in (10.6)\nimplies that\n∇μ φi = 0 .\n\n(10.7)\n\na i\nFμν\nξa = 0\n\n(10.8)\n\nThis in turn gives\n\n38\n\n\fTherefore either φ takes values in the fixed point set Mf of the group action of\nG in M or the curvature F of the connection A vanishes. In the latter case, the\nfirst equation in (10.6) implies that νr = 0 and these are the vacua of the theory.\nIf these are no non-trivial flat connections and Mf ∩ ν1−1 (0) ∩ ν2−1 (0) ∩ ν3−1 (0)\nis empty, then the space of solutions if the hyper-Kähler reduction M//G of M\nand it is a hyper-Kähler manifold. On the other hand if φ take values in Mf ,\nthen the second equation in (10.6) implies that φ are constant. Substituting\nthis in the first equation in (10.6) implies that φ are in Mf ∩ ν2−1 (0) ∩ ν3−1 (0).\nIn addition we have that\nΩI * F a − ν1a = 0 .\n\n(10.9)\n\nThis is the Hermitian-Einstein equation in two dimensions.\n\n11\n\nKähler manifolds and non-abelian vortices\n\nThe bounds that we have described in the previous sections can be easily generalized as follows. Consider two Kähler manifolds (N, h, I) and (M, g, J) of\ndimensions 2k and 2n, and Kähler forms ΩI and ΩJ , respectively. Next allow\nM to admit a holomorphic G-action with associated killing vector fields ξ and\nmoment map ν. In our conventions iξ ΩJ = −dν. Next consider the functional\nZ\n\u0001\n1\n1\n1\nSE =\ndvol(N ) |∇φ|2 + |F |2 + |ν|2 ,\n(11.1)\n2\n2\n4\nN\na\nb μρ νσ\nwhere |∇|2 = gij hμν ∇μ φi ∇ν φj , ∇μ φi = ∂μ φi + Aa ξai , |F |2 = uab Fμν\nFρσ\nh h ,\n2\nab\n|ν| = u νa νb and u is a fibre inner product on the gauge bundle which we can\nset uab = δab .\nThe functional SE can be rewritten as follows:\nZ\n\u00021\n\u0003\n1\nSE =\ndvol(N ) |ΩI * F ∓ ν|2 + |F 2,0 |2 + |I∇φ ∓ J∇φ|2\n4\n4\nN\nZ\nZ\n(11.2)\n1\n1\nωJ ∧ ΩIk−1 −\nuab F a ∧ F b ∧ ΩIk−2\n±\n(k − 1)! N\n(k − 2)! N\n\nwhere we have chosen the normalisation dvol(N ) =\nF 2,0 is the (2,0) part of the curvature F and\n\n1 k\nk! ΩI ,\n\nωJ = (ΩJ )ij ∇φi ∧ ∇φj + νa F a\n\nΩI * F = Ωμν\nI Fμν ,\n(11.3)\n\nis the equivariant extension of the Kähler form ΩJ . (The inner products are\ntaken with respect to the Riemannian metrics h and g.) The rest of the notation\nis self-explanatory. We remark that if ΩJ represents the first Chern class of a\nline bundle, i.e. the Kähler manifold is Hodge, then ωJ can be thought of as the\nequivariant extension of the first Chern class (see [9]).\nIf uab is a constant invariant quadratic form on the Lie algebra of the gauge\ngroup G, it is clear that the functional SE is bounded by a topological term\n39\n\n\fQ which involves the equivariant extension of the Kähler form and the second\nChern character of the bundle P ×G L(G), where P is a principal bundle of\nthe gauge group G and G acts on L(G) with the adjoint representation. In\nparticular we can write\nZ\n\u00021\n\u0003\n1\ndvol(N ) |ΩI * F ∓ ν|2 + |F 2,0 |2 + |I∇φ ∓ J∇φ|2\nSE =\n4\n4\nN\n(11.4)\nZ\nZ\n1\n8π 2\nk−1\nk−2\n±\nω J ∧ ΩI −\nch2 ∧ ΩI ,\n(k − 1)! N\nλ(k − 2)! N\nwhere λ is an appropriate normalisation factor involving the ratio between the\nfibre inner product on P ×G L(G) and u; where G is simple. It is worth pointing\nout that the term involving the second Chern character is not affected by the\nchoice of sign in writing (11.2). Therefore there are three cases to consider the\nfollowing: (i) there is no choice of sign such that the topological charge Q is\npositive. In such a case the bound cannot be attained. (ii) There is a critical\ncase in which for one choice of sign the topological charge is negative while for\nthe other choice is zero. This case implies that the Euclidean action vanishes\nand so every term should vanish. Solutions exist for F = ∇φ = ν = 0. (iii) For\none of the choice of signs the topological charge is positive. Suppose that Q is\npositive in (11.2) for the first choice of sign. In such case the bound is attained\nprovided that the equations\nF 2,0 = 0\nΩI * F a − ν a = 0\nI\n\nν\n\ni\n\nμ ∇ν φ\n\ni\n\n(11.5)\n\nj\n\n− J j ∇μ φ = 0\n\nhold. The first equation implies that F is a (1,1)-form. The last equation in\n(11.5) implies that the maps φ are holomorphic. Finally the middle equations\nare a generalization of non-abelian vortex equations. If the term involving the\nmoment map is constant, then the resulting equation is the Hermitian-Einstein\nequation.\n\n12\n\nHyper-Kähler manifolds and non-abelian vortices\n\nLet (N, h, I) be a Kähler manifold of dimension 2k with associated Kähler form\nΩI and (M, g, Jr ) be a hyper-Kähler manifold of dimension 4n with associated\nKähler forms ΩJr . Next allow M to admit a tri-holomorphic G-action with\nassociated killing vector fields ξ and moment maps νr . In our conventions\niξ ΩJr = −dνr . Next consider the functional\nSE =\n\nZ\n\nN\n\n3\n\ndvol(N )\n\n\u0001\n1\n1\n1X\n|∇φ|2 + |F |2 +\n|νr |2 ,\n2\n2\n4 r=1\n40\n\n(12.1)\n\n\fa\nb μρ νσ\nwhere |∇|2 = gij hμν ∇μ φi ∇ν φj , ∇μ φi = ∂μ φi + Aa ξai , |F |2 = uab Fμν\nFρσ\nh h ,\n2\nab\n|νr | = u νra νrb and u is a fibre inner product on the gauge bundle which we\ncan set uab = δab .\nThe functional SE can be rewritten as follows:\n\nSE =\n\n3\n3\n\u00021 X\n\u0003\n1X\ndvol(N )\n|ar ΩI * F ∓ νr |2 + |F 2,0 |2 +\n|ar I∇φ ∓ Jr ∇φ|2\n4\n4\nN\nr=1\nr=1\nZ X\nZ\n3\n1\n1\n±\nuab F a ∧ F b ∧ ΩIk−2\nar ωJr ∧ ΩIk−1 −\n(k − 1)! N r=1\n(k − 2)! N\n\nZ\n\n(12.2)\n1 k\nΩI , {ar : r = 1, 2, 3} is a constant vector of length one,\nwhere dvol(N ) = k!\nP3\nμν\n2\n2,0\nis the (2,0) part of the curvature F and\nr=1 (ar ) = 1, ΩI * F = ΩI Fμν , F\n\nωJr = (ΩJr )ij ∇φi ∧ ∇φj + νra F a\n\n(12.3)\n\nis the equivariant extension of the Kähler form ΩJr . (The inner products are\ntaken with respect to the Riemannian metrics h and g.) The rest of the notation\nis self-explanatory.\nIt is clear that the functional SE is bounded by a topological charge Q\nwhich involves the equivariant extensions of the Kähler forms ΩJr and, if u is a\nconstant invariant quadratic form on L(G), the second Chern character of the\ngauge bundle P ×G L(G). It is worth pointing out that the term involving the\nsecond Chern character is not affected by the choice of sign in writing (12.2).\nTherefore as in the Kähler case, there are several cases to consider but we shall\nnot repeat the analysis again. Suppose that both Q and that the inner product\nof the vector {ar : r = 1, 2, 3} with {Q̃r : r = 1, 2, 3} are positive in (12.2),\nwhere\nZ\n1\nQ̃r =\n(12.4)\nωJ ∧ ΩIk−1 .\n(k − 1)! N r\nThen the bound is attained provided that the equations\nF 2,0 = 0\na\n\nar ΩI F − νra = 0\n\n(12.5)\n\nar I ν μ ∇ν φi − Jr i j ∇μ φj = 0\nhold. The first equation implies that F is a (1,1)-form. It is always possible\nwith a rotation in the space of complex structures of the hyper-Kähler manifold\nM to set a1 = 1 and a2 = a3 = 0. Then last equation in (12.5) implies that\n∇μ φi = 0 .\n\n(12.6)\n\na i\nFμν\nξa = 0 .\n\n(12.7)\n\nThis in turn implies that\n\n41\n\n\fTherefore either the connection A is flat or the maps φ take values in the fixed\nset Mf of the G-group action on M . In the former case, in the absence of nontrivial flat connections, the moduli space of solutions to these equations is the\nhyper-Kähler reduction M//G of G and it is a smooth manifold provided that\nthe level set does not intersect Mf . In the latter case, the maps φ are constant\nand the two remaining equations in (12.5) are the Hermitian-Einstein equations\nfor the connection A.\nOne can also consider the case where (N, h, Ir ) is a hyper-Kähler manifold\nwhile (M, g, J) is a Kähler manifold which admits a G-holomorphic action of\nisometries. This case can be treated as that considered in the previous section involving only Kähler manifolds. A Kähler structure on N can chosen\nwith respect to any complex structure which lies in the two-sphere of complex\nstructures of N .\n\n13\n\nConcluding Remarks\n\nWe have constructed the actions of two-dimensional (p,0)- and (p,1)-supersymmetric\ngauge theories coupled to sigma model matter with Wess-Zumino term. We have\nalso given the scalar potentials of these theories. Our method of constructing\nthese theories relies on a superfield method. Then we have shown that the Euclidean actions these theories admit vortex type of bounds which generalise to\nhigher dimensions.\nThe gauge theories that we have constructed are not the most general ones.\nIt is known for example that the (1,1)-supersymmetric sigma model admits a\nscalar potential which is the length of a killing vector field [33]. Our superfield\nmethod cannot describe such a term. There are also other possibilities, for example the sigma models with almost complex manifolds as a target space as\nwell as those associated with (p, 0) fermionic multiplets for which the supersymmetry algebra closes on-shell [16, 29]. Other models of interest that we have not\ndescribed here are those with (p, 2), p = 2, 4, and (4,4) supersymmetry. All the\nabove models can be described using (1,0) superfields. This method has been\nused before, see [12, 13, 14]. This means that the action of such models can\nbe written in terms of (1,0) superfields and the additional supersymmetries can\nbe implemented by requiring invariance of the action under additional suitable\ntransformations. The (2,2) and (4,4) supersymmetric gauge theories have been\ndescribed using other methods in [5] and [34].\nThe gauge theories coupled to sigma models which we have described with\n(p, 1) supersymmetry have soliton type of bounds in addition to the vortex type\nof bounds that we have described. For the former bounds the energy of these\nmodels can be written as a sum of squares and a topological term. This is\nvery similar to bounds of (ungauged) sigma models [24] and so we have not\ndescribed them here. It would be of interest to investigate the solutions of the\nvortex equations we have presented for different types of moment maps. It may\nbe that for a suitable choice, the vortex equations can be solved exactly.\n\n42\n\n\fAcknowledgements We would like to thank D. Tong and P. Townsend for useful discussions. One of us GP thanks the theory group at CERN for hospitality.\nThis work is partly supported by the PPARC grant PPA/G/S/1998/00613. GP\nis supported by a University Research Fellowship from the Royal Society.\n\nReferences\n[1] A. Strominger, \"Open p-branes,\" Phys. Lett. B383 (1996) 44–47,\nhep-th/9512059.\n[2] G. Papadopoulos and P. K. Townsend, \"Intersecting M-branes,\" Phys.\nLett. B380 (1996) 273–279, hep-th/9603087.\n[3] A. Hanany and E. Witten, \"Type IIB superstrings, BPS monopoles, and\nthree-dimensional gauge dynamics,\" Nucl. Phys. B492 (1997) 152–190,\nhep-th/9611230.\n[4] E. Bergshoeff and P. K. Townsend, \"Solitons on the supermembrane,\"\nJHEP 05 (1999) 021, hep-th/9904020.\n[5] E. Witten, \"Phases of N = 2 theories in two dimensions,\" Nucl. Phys.\nB403 (1993) 159–222, hep-th/9301042.\n[6] D. Tong, \"NS5-branes, T-duality and worldsheet instantons,\" JHEP 07\n(2002) 013, hep-th/0204186.\n[7] C. M. Hull and B. Spence, \"The gauged nonlinear sigma model with\nWess-Zumino term,\" Phys. Lett. B232 (1989) 204.\n[8] C. M. Hull, G. Papadopoulos, and B. Spence, \"Gauge symmetries for\n(p, q) supersymmetric sigma models,\" Nucl. Phys. B363 (1991) 593–621.\n[9] M. F. Atiyah and R. Bott, \"The moment map and equivariant\ncohomology,\" Topology 23 (1984), no. 1, 1–28.\n[10] J. M. Figueroa-O'Farrill and S. Stanciu, \"Gauged Wess-Zumino term and\nequivariant cohomology\", Phys. Lett. B341 153, hep-th/9407196;\n\"Equivariant cohomology and gauged bosonic sigma models,\"\nhep-th/9407149.\n[11] C. M. Hull, G. Papadopoulos, and P. K. Townsend, \"Potentials for (p, 0)\nand (1, 1) supersymmetric sigma models with torsion,\" Phys. Lett. B316\n(1993) 291–297, hep-th/9307013.\n[12] G. Papadopoulos and P. K. Townsend, \"Massive sigma models with (p, q)\nsupersymmetry,\" Class. Quant. Grav. 11 (1994) 515–532,\nhep-th/9307066.\n\n43\n\n\f[13] G. Papadopoulos and P. K. Townsend, \"Massive (p, q) supersymmetric\nsigma models revisited,\" Class. Quant. Grav. 11 (1994) 2163–2180,\nhep-th/9406015.\n[14] G. Papadopoulos and P. K. Townsend, \"Solitons in supersymmetric sigma\nmodels with torsion,\" Nucl. Phys. B444 (1995) 245–264,\nhep-th/9501069.\n[15] P. S. Howe and G. Papadopoulos, \"Ultraviolet behavior of\ntwo-dimensional supersymmetric nonlinear sigma models,\" Nucl. Phys.\nB289 (1987) 264–276.\n[16] P. S. Howe and G. Papadopoulos, \"Further remarks on the geometry of\ntwo-dimensional nonlinear sigma models,\" Class. Quant. Grav. 5 (1988)\n1647–1661.\n[17] G. Grantcharov, G. Papadopoulos, and Y. S. Poon, \"Reduction of\nHKT-structures,\" J. Math. Phys. 43 (2002) 3766–3782,\nmath.dg/0201159.\n[18] S. Cordes, G. W. Moore, and S. Ramgoolam, \"Lectures on 2-d Yang-Mills\ntheory, equivariant cohomology and topological field theories,\" Nucl.\nPhys. Proc. Suppl. 41 (1995) 184–244, hep-th/9411210.\n[19] H. B. Nielsen and P. Olesen, \"Vortex-line models for dual strings,\" Nucl.\nPhys. B61 (1973) 45–61.\n[20] E. B. Bogomol'nyi, \"Stability of classical solutions,\" Sov. J. Nucl. Phys.\n24 (1976) 449.\n[21] S. B. Bradlow, \"Vortices in holomorphic line bundles over closed Kähler\nmanifolds,\" Commun. Math. Phys. 135 (1990) 1–17.\n[22] S. B. Bradlow and O. Garcia-Prada, \"Non-Abelian monopoles and\nvortices.\" Prepared for Conference on Geometry and Physics: Quantum\nInvariants and Low-Dimensional Topology, Aarhus, Denmark, 18-27 Jul\n1995, alg-geom/9602010.\n[23] C. H. Taubes, \"Arbitrary N -vortex solutions to the first order LandauGinzburg equations,\" Commun. Math. Phys. 72 (1980) 277.\n[24] E. R. C. Abraham and P. K. Townsend, \"Q kinks,\" Phys. Lett. B291\n(1992) 85–88.\n[25] L. Jacobs and C. Rebbi, \"Interaction energy of superconducting vortices,\"\nPhys. Rev. B19 (1979) 4486–4494.\n[26] C. M. Hull, \"Gauged heterotic sigma models,\" Mod. Phys. Lett. A9\n(1994) 161–168, hep-th/9310135.\n\n44\n\n\f[27] P. S. Howe and G. Papadopoulos, \"Twistor spaces for HKT manifolds,\"\nPhys. Lett. B379 (1996) 80–86, hep-th/9602108.\n[28] G. W. Gibbons, G. Papadopoulos, and K. S. Stelle, \"HKT and OKT\ngeometries on soliton black hole moduli spaces,\" Nucl. Phys. B508 (1997)\n623–658, hep-th/9706207.\n[29] C. M. Hull and E. Witten, \"Supersymmetric sigma models and the\nheterotic string,\" Phys. Lett. B160 (1985) 398–402.\n[30] E. J. Weinberg, \"Multivortex solutions of the Ginzburg-Landau\nequations,\" Phys. Rev. D19 (1979) 3008.\n[31] N. S. Manton and J. M. Speight, \"Asymptotic interactions of critically\ncoupled vortices,\" hep-th/0205307.\n[32] A. Losev, N. Nekrasov, and S. L. Shatashvili, \"Freckled instantons in two\nand four dimensions,\" Class. Quant. Grav. 17 (2000) 1181–1187,\nhep-th/9911099.\n[33] L. Alvarez-Gaume and D. Z. Freedman, \"Potentials for the\nsupersymmetric nonlinear sigma model,\" Commun. Math. Phys. 91\n(1983) 87.\n[34] S. J. Gates Jr., M. T. Grisaru, M. E. Knutt, S. Penati, and H. Suzuki,\n\"Supersymmetric gauge anomaly with general homotopic paths,\" Nucl.\nPhys. B596 (2001) 315–347, hep-th/0009192.\n\n45\n\n\f"}