{"id": "http://arxiv.org/abs/hep-ph/0004133v1", "guidislink": true, "updated": "2000-04-14T09:11:12Z", "updated_parsed": [2000, 4, 14, 9, 11, 12, 4, 105, 0], "published": "2000-04-14T09:11:12Z", "published_parsed": [2000, 4, 14, 9, 11, 12, 4, 105, 0], "title": "Models with Inverse Sfermion Mass Hierarchy and Decoupling of the SUSY\n  FCNC Effects", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0004201%2Chep-ph%2F0004249%2Chep-ph%2F0004180%2Chep-ph%2F0004077%2Chep-ph%2F0004021%2Chep-ph%2F0004269%2Chep-ph%2F0004178%2Chep-ph%2F0004267%2Chep-ph%2F0004116%2Chep-ph%2F0004206%2Chep-ph%2F0004204%2Chep-ph%2F0004066%2Chep-ph%2F0004003%2Chep-ph%2F0004200%2Chep-ph%2F0004105%2Chep-ph%2F0004002%2Chep-ph%2F0004013%2Chep-ph%2F0004231%2Chep-ph%2F0004047%2Chep-ph%2F0004143%2Chep-ph%2F0004170%2Chep-ph%2F0004071%2Chep-ph%2F0004076%2Chep-ph%2F0004230%2Chep-ph%2F0004041%2Chep-ph%2F0004037%2Chep-ph%2F0004232%2Chep-ph%2F0004089%2Chep-ph%2F0004100%2Chep-ph%2F0004260%2Chep-ph%2F0004242%2Chep-ph%2F0004227%2Chep-ph%2F0004015%2Chep-ph%2F0004224%2Chep-ph%2F0004194%2Chep-ph%2F0004036%2Chep-ph%2F0004012%2Chep-ph%2F0004247%2Chep-ph%2F0004010%2Chep-ph%2F0004130%2Chep-ph%2F0004261%2Chep-ph%2F0004093%2Chep-ph%2F0004141%2Chep-ph%2F0004083%2Chep-ph%2F0004193%2Chep-ph%2F0004074%2Chep-ph%2F0004038%2Chep-ph%2F0004133%2Chep-ph%2F0004122%2Chep-ph%2F0004138%2Chep-ph%2F0004121%2Chep-ph%2F0004104%2Chep-ph%2F0004058%2Chep-ph%2F0004225%2Chep-ph%2F0004016%2Chep-ph%2F0004060%2Chep-ph%2F0004027%2Chep-ph%2F0004176%2Chep-ph%2F0004167%2Chep-ph%2F0004161%2Chep-ph%2F0004022%2Chep-ph%2F0004258%2Chep-ph%2F0004265%2Chep-ph%2F0004046%2Chep-ph%2F0004181%2Chep-ph%2F0004082%2Chep-ph%2F0004175%2Chep-ph%2F0004099%2Chep-ph%2F0004216%2Chep-ph%2F0004055%2Chep-ph%2F0004154%2Chep-ph%2F0004196%2Chep-ph%2F0004098%2Chep-ph%2F0004251%2Chep-ph%2F0004086%2Chep-ph%2F0004195%2Chep-ph%2F0004050%2Chep-ph%2F0004177%2Chep-ph%2F0004209%2Chep-ph%2F0004182%2Chep-ph%2F0004174%2Chep-ph%2F0004256%2Chep-ph%2F0004153%2Chep-ph%2F0004111%2Chep-ph%2F0004223%2Chep-ph%2F0004160%2Chep-ph%2F0004155%2Chep-ph%2F0004189%2Chep-ph%2F0004190%2Chep-ph%2F0004129%2Chep-ph%2F0004183%2Chep-ph%2F0004075%2Chep-ph%2F0004163%2Chep-ph%2F0004095%2Chep-ph%2F0004142%2Chep-ph%2F0004191%2Chep-ph%2F0004165%2Chep-ph%2F0004084%2Chep-ph%2F0004007%2Chep-ph%2F0004131%2Chep-ph%2F0004117&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Models with Inverse Sfermion Mass Hierarchy and Decoupling of the SUSY\n  FCNC Effects"}, "summary": "We study the decoupling of the first two squark and slepton families in order\nto lower the flavour changing neutral current effects. Models with inverse\nsfermion mass hierarchy based upon gauged U(1) flavour symmetries provide a\nnatural framework where decoupling can be implemented. Decoupling requires a\nlarge gap between the Fermi scale and the supersymmetry breaking scale.\nMaintaining the electroweak symmetry breaking at the Fermi scale requires some\nfine-tuning that we investigate by solving the two-loop renormalization group\nequations. We show that the two-loop effects are governed by the anomaly\ncompensated by the Green-Schwarz mechanism and can be determined from the quark\nand lepton masses. The electroweak breaking constraints lead to a small $\\mu$\nscenario where the LSP is Higgsino-like.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0004201%2Chep-ph%2F0004249%2Chep-ph%2F0004180%2Chep-ph%2F0004077%2Chep-ph%2F0004021%2Chep-ph%2F0004269%2Chep-ph%2F0004178%2Chep-ph%2F0004267%2Chep-ph%2F0004116%2Chep-ph%2F0004206%2Chep-ph%2F0004204%2Chep-ph%2F0004066%2Chep-ph%2F0004003%2Chep-ph%2F0004200%2Chep-ph%2F0004105%2Chep-ph%2F0004002%2Chep-ph%2F0004013%2Chep-ph%2F0004231%2Chep-ph%2F0004047%2Chep-ph%2F0004143%2Chep-ph%2F0004170%2Chep-ph%2F0004071%2Chep-ph%2F0004076%2Chep-ph%2F0004230%2Chep-ph%2F0004041%2Chep-ph%2F0004037%2Chep-ph%2F0004232%2Chep-ph%2F0004089%2Chep-ph%2F0004100%2Chep-ph%2F0004260%2Chep-ph%2F0004242%2Chep-ph%2F0004227%2Chep-ph%2F0004015%2Chep-ph%2F0004224%2Chep-ph%2F0004194%2Chep-ph%2F0004036%2Chep-ph%2F0004012%2Chep-ph%2F0004247%2Chep-ph%2F0004010%2Chep-ph%2F0004130%2Chep-ph%2F0004261%2Chep-ph%2F0004093%2Chep-ph%2F0004141%2Chep-ph%2F0004083%2Chep-ph%2F0004193%2Chep-ph%2F0004074%2Chep-ph%2F0004038%2Chep-ph%2F0004133%2Chep-ph%2F0004122%2Chep-ph%2F0004138%2Chep-ph%2F0004121%2Chep-ph%2F0004104%2Chep-ph%2F0004058%2Chep-ph%2F0004225%2Chep-ph%2F0004016%2Chep-ph%2F0004060%2Chep-ph%2F0004027%2Chep-ph%2F0004176%2Chep-ph%2F0004167%2Chep-ph%2F0004161%2Chep-ph%2F0004022%2Chep-ph%2F0004258%2Chep-ph%2F0004265%2Chep-ph%2F0004046%2Chep-ph%2F0004181%2Chep-ph%2F0004082%2Chep-ph%2F0004175%2Chep-ph%2F0004099%2Chep-ph%2F0004216%2Chep-ph%2F0004055%2Chep-ph%2F0004154%2Chep-ph%2F0004196%2Chep-ph%2F0004098%2Chep-ph%2F0004251%2Chep-ph%2F0004086%2Chep-ph%2F0004195%2Chep-ph%2F0004050%2Chep-ph%2F0004177%2Chep-ph%2F0004209%2Chep-ph%2F0004182%2Chep-ph%2F0004174%2Chep-ph%2F0004256%2Chep-ph%2F0004153%2Chep-ph%2F0004111%2Chep-ph%2F0004223%2Chep-ph%2F0004160%2Chep-ph%2F0004155%2Chep-ph%2F0004189%2Chep-ph%2F0004190%2Chep-ph%2F0004129%2Chep-ph%2F0004183%2Chep-ph%2F0004075%2Chep-ph%2F0004163%2Chep-ph%2F0004095%2Chep-ph%2F0004142%2Chep-ph%2F0004191%2Chep-ph%2F0004165%2Chep-ph%2F0004084%2Chep-ph%2F0004007%2Chep-ph%2F0004131%2Chep-ph%2F0004117&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the decoupling of the first two squark and slepton families in order\nto lower the flavour changing neutral current effects. Models with inverse\nsfermion mass hierarchy based upon gauged U(1) flavour symmetries provide a\nnatural framework where decoupling can be implemented. Decoupling requires a\nlarge gap between the Fermi scale and the supersymmetry breaking scale.\nMaintaining the electroweak symmetry breaking at the Fermi scale requires some\nfine-tuning that we investigate by solving the two-loop renormalization group\nequations. We show that the two-loop effects are governed by the anomaly\ncompensated by the Green-Schwarz mechanism and can be determined from the quark\nand lepton masses. The electroweak breaking constraints lead to a small $\\mu$\nscenario where the LSP is Higgsino-like."}, "authors": ["Ph. Brax", "C. A. Savoy"], "author_detail": {"name": "C. A. Savoy"}, "author": "C. A. Savoy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1126-6708/2000/07/048", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/hep-ph/0004133v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0004133v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, Latex, 1 Postscript figure", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0004133v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/hep-ph/0004133v1", "journal_reference": "JHEP0007:048,2000", "doi": "10.1088/1126-6708/2000/07/048", "fulltext": "arXiv:hep-ph/0004133v1 14 Apr 2000\n\nCERN-TH/2000-111\nSPhT 00/46\nhep-ph/0004133\n\nModels with Inverse Sfermion Mass Hierarchy\nand Decoupling of the SUSY FCNC Effects\n\nPh. Brax12\nTheory Division, CERN, CH-1211, Geneva, 23, Switzerland\n\nC. A. Savoy3\nCEA-SACLAY, Service de Physique Théorique, F-91191 Gif-sur-Yvette, France\n\nKey Words: Beyond Standard Model, Supergravity Models\n\nAbstract\nWe study the decoupling of the first two squark and slepton families in\norder to lower the flavour changing neutral current effects. Models with\ninverse sfermion mass hierarchy based upon gauged U (1) flavour symmetries provide a natural framework where decoupling can be implemented.\nDecoupling requires a large gap between the Fermi scale and the supersymmetry breaking scale. Maintaining the electroweak symmetry breaking\nat the Fermi scale requires some fine-tuning that we investigate by solving\nthe two-loop renormalization group equations. We show that the two-loop\neffects are governed by the anomaly compensated by the Green-Schwarz\nmechanism and can be determined from the quark and lepton masses. The\nelectroweak breaking constraints lead to a small μ scenario where the LSP\nis Higgsino-like.\n\n1\n\nemail: philippe.brax@cern.ch\nOn leave from CEA-SACLAY, Service de Physique Théorique, F-91191 Gif-sur-Yvette,\nFrance\n3\nemail:savoy@spht.saclay.cea.fr\n2\n\n\f1\n\nIntroduction\n\nMany sfermion mass patterns have been suggested in order to alleviate\nthe effects of the flavour non-diagonal contributions in the supersymmetric\nFlavour Changing Neutral Current (FCNC) problems. Three main mecha ̇ degeneracy in the scalar masses;(ii)\n ̇ alignment\nnisms have been proposed:(i)\n ̇\nbetween fermion and sfermion mass matrices;(iii) decoupling of all virtual\nsupersymmetric effects by large scalar masses. Degeneracy seems natural\nin the context of gravity mediated sypersymmetry breaking although it\ncould also be pointed out that a generic flavour dependence of the Kähler\npotential tends to spoil this degeneracy in the presence of a spontaneously\nbroken flavour symmetry, if unprotected by this symmetry. In the framework of gauged flavour symmetries the induced D-type soft masses are\nespecially dangerous in that respect. Actually, gauge mediation of supersymmetry breaking at a relatively low scale would lead to negligible FCNC\neffects if the gravitino is light enough but it apparently faces inherent problems to induce the correct electroweak symmetry breaking.\nThe implementation of the alignment prescription via a rather ad hoc\nchoice of flavour symmetries has been advocated [1] to be the only natural\nsolution, although some of the arguments used have to be revised in the\nframework of broken supergravity theories. The examples of such symmetries are sufficiently contrived that one feels compelled to look for another\npossibility. On the other hand, decoupling has always served as a possible\nremedy for the inconsistencies of any model beyond the standard theory.\nHowever, third generation scalars together with the Higgs and gaugino\nsectors which control the electroweak symmetry breaking should be kept\nlight enough to avoid too much fine-tuning. Since FCNC effects are more\nstringent within the first two generations of quarks and leptons, it has been\nenvisaged that the first two generations could be considerably heavier than\nthe other supersymmetric particles[2] - actually, an efficient suppression of\nFCNC effects by decoupling alone would require very heavy masses. As a\nmatter of fact, the first and second families of sfermion masses do enter\nthe MSSM expression for the Z boson mass when one takes into account\nthe two loop effects . This has been used to put limits on the mass gap\nbetween generations of scalars, mostly by requiring the absence of an excessive fine-tuning. Other bounds have been obtained from the positivity\nof the stop masses[3]. We will comment on these generic bounds later on.\nOur main interest is to cast the decoupling approach within spontaneously broken supersymmetry scenarios. In this context a very large gap\nbetween families seems to be difficult to reach in the supergravity mediated framework due to the form of the scalar masses, assumed to be flavour\ndiagonal, for simplicity,\nm2i = m23/2 +\n\nhFa i F̄b̄\n∂a ∂b̄ ln(∂i ∂ī K) + Xi hDX i ,\nMP2\n\n(1)\n\nwhere K is the Kähler potential, Xi is the gauge charge of the state\n\n1\n\n\fwhilst hFa i and hDX i are the auxiliary fields √\nresponsible for supersymmetry breaking, which (vectorially) add up to 3m3/2 MP . This formula\ndisplays the dependence of the sfermion masses on :(i) flavour independent\nterms such as m23/2 ;(ii) hFa i along directions where there is a dependence\nof the Kähler metric in the matter field families; (iii) hDX i along flavour\nsymmetries. One easily realizes from (1) that scalars in different generations cannot be split by more than one order of magnitude, unless (i) is\ncompensated by (ii), like in no-scale supergravity.\nIn the presence of supersymmetry breaking and flavour symmetry breaking there are two sources of \"induced\" supersymmetry breaking capable to yield flavour dependent scalar mass splittings. Let us consider a\nsimple situation[4] in order to illustrate this point: an Abelian flavour\nsymmetry U (1)X broken by the value of a Frogatt-Nielsen field φ with\nm3/2 ≤ hφi ≤ MP . Assuming a vanishing cosmological constant, from\nthe supergravity Lagrangians one obtains[6, 7] the induced supersymmetry breaking hFφ i ∼ m3/2 hφi along the φ direction and hDX i ∼ m2φ where\nm23/2 is the total supersymmetry breaking and m2φ is the φ soft mass, of\nO(m23/2 ). In this case, the D-type splitting is always relevant, the F -type\none being proportional to hφi2 /MP2 .\n\n1.1\n\niMSSM\n\nDespite the strong motivations for models with very heavy scalars the only\nconcrete ones discussed so far are those coined \"inverse hierarchy models\"\n(iMSSM). They are based on the assumption that an anomalous U (1)X\ngauge symmetry is present in the flavour sector of the theory. The anomaly\nis fixed by the Green-Schwarz mechanism which then determines the scale\nof the flavour symmetry breaking hφi . The induced D-term produces a\nmass splitting, m2i − m2j = (Xi − Xj )m2φ . In models where the anomalous\nU (1)X is responsible for the fermion mass hierarchy the charge difference\nare roughly related to the fermions masses[6]\nm2i\n\n−\n\nm2j\n\n∝ ln\n\nmFj\nmFi\n\n!\n\n.\n\n(2)\n\nThis leads to an inverse hierarchy in the sfermion masses compared to the\nfermionic hierarchy (quarks and leptons).\nThis fact was first pointed out in the framework of general broken supergravity coupled to Abelian flavour gauge symmetry[6] and, subsequently,\nin models with dynamical supersymmetry breaking[7]. It has been noticed\nthat, because the top Yukawa coupling is of O(1), there is the relation\n(XtL + XtR + XH2 ) = 0, for the charges of the top-Higgs sector, implying\nthat the soft mass combination, (m2U3 + m2Q3 + m2H2 ) receives no contribution from the D−terms. Since this is the combination appearing in the\none-loop correction to the boson mass MZ2 , the radiative gauge symmetry\n\n2\n\n\fbreaking is automatically protected, at one-loop, against large D−terms\nthat are due to any gauge symmetry broken at scales below MP .\nIt goes without saying that the FCNC effects are particularly dangerous\nin the iMSSM framework. It has been suggested that this problem can be\nevaded by a suitable combination of degeneracy, alignment and, last but\nnot least, decoupling of the first two generations[6, 8]. The latter has\nprompted us to evaluate the two-loop corrections. This is done in Section\n2.\n\n1.2\n\nA limit on two-loop effects\n\nIn Section 3, we show that for inverse hierarchy models based on D-term\nsplitting the dominant contribution to the two loop terms in the renormalization evolution of the scalar masses is proportional to the anomalies of\nthe U (1)X group. For the most relevant case of gauged U (1)X symmetries\nthe anomalies must be cancelled by the Green-Schwarz mechanism. We\nwill concentrate on theories such as the weakly coupled heterotic string\nwith only one anomalous U (1)X and one dilaton-axion to implement the\nGreen-Schwarz mechanism.\nAn interesting aspect of this result is that despite the large variety of\nX charges and choice of symmetry to explain the fermion hierarchy the\nU (1)X anomaly can be fixed in a rather model independent way. Indeed\nby using the previously obtained relations between the anomaly A and the\nfermion masses one gets[5]\n3\n\n−2\n\nmu mc mt (me mμ mτ ) (md ms mb )\n\n2 A\ngX\n32π 2\n\n≈\n\n!A/2\n\nsin3 β cos3 β(174GeV)6 ,\n\n(3)\n√\nwhere the quark and lepton masses are taken at the scale gX AMP /4π,\ntan β is the ratio between the two Higgs vacuum expectation values (vev's),\ngX is the U (1)X gauge coupling and A is the U (1)X anomaly with respect\nto the standard model gauge groups.\nThe evaluation of (3) yields A ≈ 25±3. Remarquably enough this leads\nto a prediction of the Cabibbo angle θC ≈ 0.2 in these models.\nThis establishes a quite model independent estimate of the two loop\neffects in inverse hierarchy models. It turns out to be much smaller than\nvalues considered in previous discussions inspired by these models[2, 3].\n\n1.3\n\nMaximal hierarchy limit\n\nAs already stressed in the iMSSM context, the supersymmetric flavour\nproblem requires very heavy sfermions in the first two generations, hence a\nlarge supersymmetry breaking scale, m23/2 >> MZ2 . The fine-tuning problem becomes crucial. In the cMSSM, where the coefficient of the universal\nsoft scalar masses m20 in the expression for MZ2 is strongly suppressed –\n\n3\n\n\fa Nature fine-tuning of the top mass mt – for moderate and large values\n2\nof tan β, the necessary fine-tuning is mostly between M1/2\nand μ2 . This\nrequires relatively large values for μ, yielding gaugino-like LSP. Several\nstudies in the literature[10] have already discussed how the predictions are\nmodified by departing from the cMSSM scalar degeneracy. The main point\nis that, in this case, the scalar masses can also participate in cancelling the\n2 term in the expression for M 2 , allowing for relatively low values of\nM1/2\nZ\nμ. For these small μ solutions, the spectrum wiil consist of scalars heavier\nthan gauginos, which are also heavier than the higgsinos. The advantage\nof this class of models is that the fine-tuning now occurs mostly in the\n2 /m2 , which is more obviously related to the supersymmetry\nratio M1/2\n3/2\nbreaking mechanism, while the origin of the μ parameter, which could now\nbe of O(MZ ), remains more mysterious.\nIn Section 4, we investigate the possibility of large values of m23/2 together with small μ values. The two-loop correction, controlled by the\nanomaly, contributes in some cases. In this regime, the iMSSM does reveal an inversed mass spectrum as compared with the cMSSM. We discuss\napproximate constraints in the neighbourhood of the 'infinitely' fine-tuned\nsolution for large tan β, but this rough approximation turns out to be quite\nappropriate from our numerical analysis.\nThe iMSSM mass patterns are displayed in Section 5. We summarize\nour conclusions in the last section. The case of more than one U (1) flavour\nsymmetries is sketched in the Appendix.\n\n2\n\nTwo Loop Renormalization Effects\n\nLet us first treat the two loop renormalization group equations of the scalar\nmasses in the following approximation,\n\"\n\nCA m 2\ng2\ndm2i\n= −8π 2 CA (i) MA2 − A 2 tr\ndt\n16π\ndA\n\n!#\n\n\"\n\n#\n\ng2\nS + A2 tr(Y CA m2 )\n4π\n(4)\nwhere the indices A = 1, 2, 3 correspond to the gauge group factors U (1), SU (2), SU (3)\nrespectively, gA is the corresponding gauge coupling, dA the algebra dimensions, MA is the gaugino mass and CA (i) is the Casimir eigenvalue for the\nfermion/sfermion labelled by i. Finally,\nS = tr(Y m2 )\n\n+2g12 Yi\n\n(5)\n\nintroduces a Y −dependent term in the scalar masses.\nThe approximation (4) is appropriate for the class of models discussed\nherein and corresponds to neglecting the two-loop corrections proportional\n2 C (i)/16π 2 with respect to the\nto MA2 which are suppressed by a factor of gA\nA\none loop terms. As displayed, (4) is not valid for the stops. Including the\ntop Yukawa couplings to extend the calculation to the third family scalar\n\n4\n\n\fmasses and consistently neglecting the terms in MA2 which are higher order\n2 , yields the solution\nin gA\n\u0011\na(i) \u0010 2\n2\nρ 3m̄ + 8M1/2\n+ (1 − ρ)(AQ3 (0) + 2M1/2 )2 − δ\n12\n\u0013\n\u0013\n\u0012 \u0012\nYi\n1\n2\n2\n2\n2\n[S(t) − S(0)]\n(6)\nM1/2 − δ +\n+ |t|CA (i)gA 8 gA +\n2\n22\n\nm2i = m2i (0) −\n\nat the Fermi scale where the coefficients a(i) are a(U3 ) = 4, a(Q3 ) =\n2, a(H2 ) = 6 and zero otherwise, 3m̄2 = (m2U 3 + m2Q3 + m2H2 ), AQ3 is the\nsoft coupling associated to the top Yukawa coupling, and finally,\nρ=\n\n0.72\nht\n≈\n.\n(ht ) F.P. sin2 β\n\n(7)\n\nIn approximating the solutions for m2i we are anticipating and taking advantage of the fact that the two-loop term\n1\nδ = 2 tr\n4π\n\nCA m 2\ndA\n\n!\n\n|t=0\n\n(8)\n\nis almost independent of the index A in the classes of models discussed\nhere, that we now turn to discuss.\n\n2.1\n\nIn the cMSSM\n\nThe most important effect of the radiative corrections on the SU (2)× U (1)\nbreaking appears in the Higgs parameter\n2\nm2H2 ≈ m2H2 (0) + 0.52(M1/2\n− 0.15δ) − 0.014S0\n\u0012\n\u0013\n\u0013\n\u0012\n0.72\n0.36\n2\n2\n2\nm̄ + 8M1/2 + 1 −\n(A0 + 2M1/2 ) − δ .(9)\n−\nsin2 β\nsin2 β\n\nTherefore the two loop effects due to possible heavy scalars in the first two\n2 ). For instance assuming a\ngenerations become relevant for δ ∼ O(fewM1/2\ndegeneracy amongst the heavy scalars of mass m in the first two generations\nthis corresponds to m ∼ 5M1/2 .\nIt is well known that in the cMSSM with boundary conditions m2i (t =\n0) = m20 the coefficient of m20 in MZ2 is small for large values of tan β.\nIndeed the dependance of m2H2 on m20 in the tan β >> 1 limit is\n2\nm2H2 ≈ −0.1m20 + 0.3δ − 2.76M1/2\n.\n\n(10)\n\nTaking the traces over all the MSSM scalars one gets tr(C3 /8) = 6, tr(C2 /3) =\n7, trC1 = 6.6, so that\nm2\n(11)\nδ≈ 0 .\n2π\nThe possibility of obtaining a relatively large value of m20 without worsening\nthe fine-tuning in MZ2 remains at the two-loop level.\n\n5\n\n\f3\n\nAnomalous U(1) Models\n\nAs already emphasized in the introduction the natural realization of the\ninverse hierarchy for squarks and sleptons occurs in models where the\nfermion mass hierarchy is explained by a Frogatt-Nielsen mechanism with\nan anomalous U (1)X local flavour symmetry. Recently it has been advocated that in type IIB orientifold models of string theory one could expect\ndifferent anomalous U (1)X with their anomalies being cancelled by a corresponding number of moduli fields [11]. We shall ignore this possibility\nand remain within the more traditional heterotic-like picture with only\none anomalous U (1)X [12]. Of course one could postulate the existence\nof other anomaly-free U (1) flavour gauge symmetries in order to explain\nthe fermion mass hierarchy. As discussed in the Appendix the results are\nessentially similar in the multi-U (1) models.\nWe refer to the comprehensive literature on this subject for the details\nand quote the main results only. The anomaly cancellation is provided by\nthe Green-Schwarz mechanism. A necessary condition for the compensation of the anomalies with respect to the standard model gauge symmetries\nas well as the gravitational anomaly is the equality\nA1 = A2 = A3 =\n\ntr(X)\n,\n24\n\n(12)\n\nwhere AA = 2tr(XCA )/dA . The Kac-Moody levels kA have all been taken\nto be one to simplify the discussion. The coefficiient of the Fayet-Iliopoulos\nterm required by the U (1)X gauge invariance – which is nothing but the\ncontribution of the dilaton to DX – is given by\nξ2 =\n\n2 A\nkX gX\n.\n32π 2\n\n(13)\n\nIntroducing a Froggat-Nielsen field φ which is standard model gauge singlet with a charge X = −1 (by a suitable normalization of the U (1)X\ncharges), the U (1)X gauge symmetry is broken at the minimum of the\nscalar potential where\n|φ|2 = ξ 2 MP2 ,\n\nhFφ i ∼ m3/2 ξMP ,\n\nhDX i = m2φ ,\n\n(14)\n\nwhere m2φ is the soft mass given by the supersymmetry breaking mechanism. The hFφ i and hDX i vev's are the induced supersymmetry breaking\nterms. The former contributes to the scalar masses only as ξ 2 m23/2 and is\nneglected here4 . The latter gives an important D-term contribution to the\nscalar masses so that at the scale ξMP ,\n\n4\n\nm2i = m̂2i + Xi hDX i ,\n\n(15)\n\nThough, as discussed in [6], this contribution is relevant in the discussion of FCNC effects.\n\n6\n\n\fwhere m̂2i is the contribution from the supersymmetry breaking independent of the DX breaking and the charges Xi are model dependent.\n\n3.1\n\nTwo-loop Correction and Anomaly\n\nIn the inverse hierarchy models the two loop contributions of the heavy\nscalars to the renormalization group equations turns out to be quite independent of the choice of charges. Indeed, one gets from the definition (8)\nand the masses (15),\n4π 2 δ =\n\nX CA (i)\ni\n\ndA\n\n(m̂2i + Xi < DX >) ,\n\n(16)\n\nwhich yields\n\n1\nA hDX i .\n(17)\n8π 2\nIn obtaining this result we have used the equality of the anomalies (12).\nHence, the main two-loop contribution, coming from the D−terms in the\nscalar masses, is proportional to the anomaly A. Of course, the two-loop\ncorrections coming from D−terms corresponding to non-anomalous U (1)′ s\ncancel.\nInterestingly enough, the anomaly A can be calculated from its relation\nto the fermion masses. Indeed, even if the X−charges that control the\nfermion masses are model dependent, it is possible to display a combination\nof masses that only depends on the charges through A, as we now turn to\ndiscuss.\nδ = δ̂ +\n\n3.2\n\nCalculation of the Anomaly\n\nIn the anomalous U (1)X approach to the fermion hierarchy, with the\nabelian flavour symmetry breaking given by the small parameter ξ as discussed above, the quark and lepton Yukawa couplings to the Higgses are\ngiven by\nYfi ∼ ξ fLi +fRi +h ,\n(18)\nwhere the fermion name (e.g., qi ) also denotes its X−charge (resp., X(uLi ) =\nX(dLi )), and h is the X−charge of the appropriate Higgs field. In particular, one obtains, from the values of the third generation Yukawa couplings,\nthe relations:\nq3 + u3 + h2 ≈ 0 ,\nq3 + d3 + h1 ≈ l3 + e3 + h1 ≈\n\n4 − ln tan β\n,\nln ξ\n\n(19)\n\nand ξ is roughly the Cabibbo angle, θC ≈ ξ. The charges of the other\nfamily fermions are more or less fixed by their Yukawa couplings and the\nKobayashi-Maskawa mixings.\n\n7\n\n\fBecause of the condition (12) on the anomalies, A is related to the\nfermion masses as follows,\nmu mc mt (me mμ mτ )3 (md ms mb )−2 ≈ ξ A sin3 β cos3 β(174GeV)6 ,\nwhere ξ 2 =\n\n2 A\ngX\n,\n32π 2\n\n(20)\n\nwhile for the Higgs charges one obtains,\nmd ms mb\n(h1 + h2 ) ln ξ ≈ ln\nme mμ mτ\n\n!\n\n.\n\n(21)\n\nThe quark and lepton masses are defined at the scale ξMP . Putting the\nexperimental masses in (20) yields\nA ln(\n\n32π 2\n2 A ) ≈ (90 ± 3 ln sin 2β) ,\ngX\n\n(22)\n\nm2φ\n+ δ̂\nδ≈\nπ\n\n(23)\n\n2 = .5. This is\ngiving A ≈ 25 ± 3 and ξ ≈ 0.2, with the GUT value gX\nin reasonable agreement with the relation θC ≈ ξ. From (21) one gets\n(h1 + h2 ) ≈ 0, a result that we shall use later. In the Appendix we discuss\nthe model dependence of these relations.\nTherefore, as a typical result, the relevant two-loop contribution to the\nlow-energy scalar masses (6) is given by a relatively low value,\n\nwhere we have used (14).\n\n3.3\n\ni+cMSSM\n\nLet us first evaluate the impact of this two loop correction in a simple model\n(i+cMSSM) with universality assumed for the primordial supersymmetry\nbreaking, namely, a contribution m20 to all scalar soft masses, and with\nan anomalous U (1)X flavour symmetry as discussed above. In this case,\nhDX i = m20 , and the scalar masses at the flavour symmetry breaking scale\nare\nm2i = m20 (1 + Xi ) .\n(24)\nFrom (19), the parameter m̄2 of the one-loop correction in (6) is equal to\nm20 , and, from (23) and (11), the two-loop contribution depends on\nδ≈\n\nm20\n\n\u0012\n\n1\n1\n+\n2π π\n\n\u0013\n\n≈ 0.5m20\n\n(25)\n\nThe corresponding contribution to m2H2 is\n∆m2H2 ≈\n\n0.2m20\nsin2 β\n\n(26)\n\nwhich is about three times larger than the corresponding parameter in the\ncMSSM. As we shall discuss in the next section, contrarily to what happens\nin the cMSSM, this alone could be enough to allow for small μ models, in\nthe large tan β limit, even if X(H2 ) = 0.\n\n8\n\n\f3.4\n\niMSSM\n\nWe now turn to discuss a more elaborate model[6] exhibiting the inverse\nhierarchy for the scalar masses, where some flavour dependence is incorporated into the Kähler potential besides the anomalous U (1)X gauged\nflavour symmetry and the Green-Schwarz mechanism. The key assumption, which allows the model to be predictive, is that the fermion mass\nhierarchies are fixed solely by the abelian flavour symmetries, not by the\nmoduli dependence. Amazingly, this assumption turns out to imply that\nthe (mass)2 differences between sfermions with the same SM quantum numbers are proportional to the gravitino (mass)2 , m23/2 . Even without specifying the primordial supersymmetry breaking along the dilaton and moduli\ndirections in the iMSSM, the sfermion masses can be parameterized in a\nsimple and suggestive way, which we now turn to summarize.\nLet us denote by Φi the matter superfields and their scalars where\nΦ = Q, U, D, L, E refers to the standard model fields and i = 1, 2, 3 refers\nto the family index. We denote by φi the X charges. At the scale ξMP\nthe soft terms satisfy the relations\nm2Φi − m2Φj\n\n= (φi − φj )m23/2 ,\n\n2\nm2U3 + m2Q3 + m2H2 = M1/2\n,\n\n2\nm2D3 + m2Q3 + m2H1 = M1/2\n+ (d3 + q3 + h1 )m23/2 ,\n2\nm2E3 + m2L3 + m2H1 = M1/2\n+ (e3 + l3 + h1 )m23/2 ,\n\nm2H2 + m2H1 = (2 + h2 + h1 )m23/2 ,\nAUi = (ui + qi + h2 )m3/2 − M1/2\n\nADi = (di + qi + h1 )m3/2 − M1/2\nALi\n\n= (ei + li + h1 )m3/2 − M1/2\n\nB = (2 + (h2 + h1 )θ(h2 + h1 )) m3/2\n\n(27)\n\nActually, the terms proportional to the U (1)X charges come out as a particular combination of the hDX i induced breaking and the supersymmetry\nbreaking in the moduli sector, which give rise to this general form for the\nmass splitting between families. We have only considered the soft terms\nwhich are diagonal in the family indices, although the pattern of the offdiagonal terms give constraints on the U (1)X charges from the FCNC\nbound. Other relations for the soft terms will be spelt out later.\nThe fermion hierarchy requires a relatively strong family ordering of\nthe charges φ1 > φ2 > φ3 . We concentrate on this situation and even\nmore on the case where M1/2 < m3/2 . However we do not have to impose\nany particular choice for the charges φi , in many of the physical issues\ndiscussed below since the two loop corrections that are relevant to the\ninverse hierarchy scenario are controlled by the anomaly. This is fixed by\nthe fermion masses to\nm23/2\nAm23/2\n≈\n.\n(28)\nδ=\n8π 2\nπ\n\n9\n\n\fWith the relations in (27) one has for instance\nm2H2\n\n=\n\nm2H2 (t\n\n0.36\n= 0)− 2\nsin β\n\n0.72\n10 −\nsin2 β\n\n\u0012\u0012\n\n\u0013\n\n2\nM1/2\n\n\u0013\n\n− δ +0.52(M1/2 −0.15δ)\n\n(29)\nTherefore, the two-loop corrections are basically negligible in the iMSSM.\nNevertheless, the δ term is of some importance in the discussion of the\nnext section.\n\n4 Higgsino-like LSP and Electro-Weak Symmetry Breaking\nIt is well-known that by departing from the universality assumptions of\nthe cMSSM many of its striking predictions are dramatically affected. In\nparticular the nature of the LSP can change. This is mainly a matter\n2\nof competition between the μ2 and M1/2\nparameters that appear with\ndifferent signs in the supersymmetric expression for MZ2 . The cMSSM\ncoefficient of the universal soft scalar masses m20 is strongly suppressed for\n2 and\nrather large values of tan β. The necessary fine-tuning between M1/2\nμ2 then favours a lighter gaugino than the Higgsino. In this section we\nshow that in the iMSSM discussed in the previous sections, the Higgsino\nturns out to be a natural option for the LSP. Let us sketch the situation\nwithin an analytic approximation to the supersymmetric SU (2) × U (1)\nbreaking. In terms of t = tan β, the minimum equations read\n2\n1\n21−t\n)\n=\nM\nZ\nt2\n1 + t2\n1\n+ m2H2 + 2μ2 − Bμt(1 + 2 ) = 0\nt\n\nm2H1 − m2H2 − Bμt(1 −\nm2H1\n\n(30)\n\nat the classical level. The radiative corrections are important but the main\ncontributions can be included by redefining\nm̂1\n\n2\n\n=\n\nm2H1\n\nm̂2 2 = m2H2\n\nM2\n− Z\n2\nM2\n+ Z\n2\n\nmt̃1 mt̃2\n1 − t2\nh2t 2\n+\n3\nμ ln\n1 + t2\n16π 2\nm2t\n\u0012\n\u0013\n2\n2\nmt̃1 mt̃2\n1−t\nht\n2\n2\n+\n3\n(m\n+\nm\n)\nln\n. (31)\nt̃2\n1 + t2\n16π 2 t̃1\nm2t\n\u0012\n\n\u0013\n\nFrom the minimum equations we deduce that\nμ=\n\nBt\n(1 ±\n2\n\ns\n\n1−\n\n4m̂21\n),\nB 2 t2\n\n(32)\n\nso that the small μ solution leading to a Higgsino-like LSP corresponds\nto the minus sign in the previous equation. For large enough values of t\n\n10\n\n\f(to be discussed later) such that 0 < 4m̂21 << B 2 t2 one gets the following\nrelations\nμ ≈\nm̂22 ≈\n\nm̂21\n(1 +\nBt\nm̂21\n(1 −\nt2\n\nm̂21\n)\nB 2 t2\nm̂21\n)\nB2\n\n(33)\n\nNamely the small μ regime corresponds to μ2 ∝ t−2 and m2H2 ∝ t−2 . This\nsuggests to expand the solutions in powers of t−2 . This is quite unphysical\nbut mathematically sound. Let us start with an approximation to the low\nenergy masses parameterized as follows\n1\n2\n− 0.15δ)\nm2H1 = m20 (1 − σH ) + (M1/2\n2\n\u0013\n\u0012\n\u0011\n1 \u0010 2\n2\nm̄ + 8M1/2\n+ ∆ − δ (34)\nm2H2 = m2H1 + 2σH m20 − 0.36 1 + 2\nt\nwhere\n\u0012\n\n∆ = 0.28 −\n\n\u0013\n\u00112\n0.72 \u0010\nA\n+\n2M\nU\n1/2\n3\nt2\n\n(35)\n\nis model dependent. In (34), m0 is the universal scalar mass in the cMSSM\nand m0 = m3/2 in the iMSSM, as discussed before, and we have assumed\nm2H1 + m2H2 = 2m20 as consistent with h1 + h2 = 0.\n2 /m2 by taking the large\nAs a first approximation we determine M1/2\n0\n2\n2\nfine-tuning limit, MZ << m0 . We also neglect the radiative corrections\nand we keep only the relevant powers of tan β. Then, one can solve (33) for\nM1/2 in each of the models discussed in the previous sections. For the sake\nof illustration, we take the values predicted by the iMSSM, AU3 = −M1/2\nand B = 2m0 , but the latter only enters into the term ∝ t−2 .\na) cMSSM\nIn this model, σH = 0, m̄2 = m20 , δ ≈ m20 /(2π). One gets\n2\nM1/2\n\nm20\n\n≈ −0.02 −\n\n0.7\nt2\n\n(36)\n\nwhich excludes the small μ solution in the limit m20 >> MZ2 as well-known.\nb) i+cMSSM\nIn this case, the universality is only broken by the U (1)X D−terms, so\nthat m̄2 = m20 from (19), δ ≈ 3m20 /(2π) from (25), σH = h2 , yielding,\nM1/2\n0.7 + 0.3σH\n≈ 0.04 + 0.4σH −\n2\nm0\nt2\n\n(37)\n\nThe existence of this solution, especially for h2 = 0, is due to the larger\ntwo-loop contributions. The gauginos are much lighter than the sfermions\n\n11\n\n\ffor these small μ solutions. In this example, a cancellation must occur\n2 and the two-loop term in m2 for large\nbetween the one-loop term in M1/2\n0\nvalues of the soft masses.\nc) iMSSM\n2 , from (27), and δ ≈ m2 /π, from\nIt is characterized by m̄2 = M1/2\n3/2\n(28). This leads to\n2\nM1/2\n\nm23/2\n\n≈ 0.36(1 + σH ) + .05 −\n\n0.7 + 0.3σH\nt2\n\n(38)\n\nRoughly, the parameter σH can take values in the range [-1,0]. E.g., if we\ntake the value σH = −0.25 and t = 2, we get 0.17 for the ratio (38), which\nis close to the values obtained in a scanning of the parameter space. Notice\nthat the two-loop (anomaly) term contributes by about one-third to this\nresult. The ratio in (38) means a real fine-tuning, and in our numerical\nanalysis (after reintroduction of the radiative corrections and MZ in the\nexpressions) the deviations from this 'infinite fine-tuning' limit are rather\nsmall. In order to allow for a big hierarchy in the sfermion masses, one has\nto take rather small values of M1/2 /m3/2 , by increasing |σH |. This ratio\n√\nis related to the Goldstino angle sin θG = M1/2 / 3m3/2 . In a sense this\nis a better variable to be tuned than μ/m3/2 since it is simply related to\nthe nature of the supersymmetry breaking. Still it has to be fine-tuned\nto match a quantity which, in the iMSSM, depends on the parameter σH ,\nrelated to the properties of the Higgs fields under the U (1)X and modular\nsymmetries.\n2 /6, is\nNotice that the condition for a Higgsino-like LSP, μ2 < M1/2\nfulfilled with tan β > 3, for σH > −.75. Otherwise, the LSP can be gauginolike, while the lightest chargino remains Higgsino-like. Therefore, the small\nμ solution of the iMSSM is generically characterized by (i) large values of\nm3/2 , i.e., very heavy sfermions of the two first generations; (ii) smaller\nvalues of M1/2 , i.e., moderate gaugino masses; and (iii) μ as low as O(MZ ),\ni.e., a Higgsino as the LSP.\nRadiative corrections have been neglected in this discussion, but the\nmain effect of their inclusion is to increase the value of tan β for a given\nset of parameters.\n\n5\n\nThe iMass Spectrum\n\nIn this section we shall discuss the typical mass spectrum that one can\nderive from inverse hierarchy models. We will also comment briefly on the\npredictions for the FCNC effects, a main issue in these models because of\nthe large mass splitting between the families.\nThe mass spectrum of the iMSSM version[6] depends on three parameters σH , σL and σQ which measure the departure from scalar mass universality between the two Higgs doublets, the leptons and the quarks of the\n\n12\n\n\fthird family, respectively. These parameters define the solutions of (27)\nand so include the dependence on the corresponding X−charges and, in\nthis model, on their flavour dependent Kähler geometry. They are family\nindependent. Then, the family dependent mass terms, accordingly to (27),\ndepend only on the X−charge differences, e.g., q1 −q3 . Such charges can be\nchosen to get a good agreement with fermionic mass patterns and mixing\nangles. The choice of charges plays also a role in the S term in the masses\n(at the Fermi scale). The correction to the masses due to this term is\nδm2i =\n\nYi\n(S − S0 ) ,\n22\n\n(39)\n\nwhere S0 comprises a term like tr(XY )m23/2 . From the renormalization\ngroup equations one finds that the evolution of S is given in first approximation by\ng2\n(40)\nS − S0 = ( 12 − 1)S0 ≈ −0.6S0 .\ng0\nThe effect of this contribution has been often overestimated in the literature. In any instance, the term (39) can be consistently included in the\ndefinition of σH , σL and σQ , without loss of generality. This is understood\nin what follows.\nThe masses of the third family sleptons are then given by (κ = MZ2 cos 2β)\nm2τ̃L\n\n2\n= (1 + σl )m23/2 + 0.5(M1/2\n− 0.15δ) + 0.4κ\n\n2\n− 0.15δ) + −0.5κ\nm2ν̃L = (1 + σl )m23/2 + 0.5(M1/2\n\nmτ̃2R\n\n2\n= 1.16M1/2\n− (σl − σH )m23/2 − 0.03δ + 0.23κ\n\n(41)\n\nand the third family squark masses are given by\nρ\n2\n2\n− 0.5δ − ((10 − ρ)M1/2\nm2b̃ = (1 + σq )m23/2 + 6.9M1/2\n− δ) + 0.42κ\nL\n6\n2\nm2b̃\n= −(σq − σH )m23/2 + 7.4M1/2\n− 0.43δ + 0.75κ\nR\nρ\n2\n2\n− 0.5δ − ((10 − ρ)M1/2\n− δ) − 0.35κ\n(42)\nm2t̃L = (1 + σq )m23/2 + 6.9M1/2\n6\nρ\n2\n2\n− 0.44δ − ((10 − ρ)M1/2\nm2t̃R = −(2 + σq + σH )m23/2 + 7.4M1/2\n− δ) − 0.15κ\n3\nSince we are interested in the case M1/2 << m3/2 , the allowed range\nfor the parameters σH , σL and σQ , is strongly constrained, and σH has\nalso to be consistent with the electroweak break conditions (33).\nLet us now present some generic features of the spectrum. The differences in the charges between the first two generations and the third one\nare model dependent to some extent. However, one can minimize these uncertainties by considering the combinations that are more directly related\nto the fermion masses, as given by (18). For the first family sfermions, as\ncompared to the third family ones, one finds,\nmẽ2L + m2ẽR − m2τ̃L − mτ̃2R\n\n13\n\n≈\n\nln(me /mτ ) 2\nm3/2\nln ξ\n\n\fln(md /mb ) 2\nm3/2\nln ξ\nln(mu /mt ) 2\nm2ũL + m2ũR − m2t̃L − m2t̃R ≈\nm3/2 .\n(43)\nln ξ\nThese are high energy relations that remain valid at low energies as far as\nthe masses of the third generation are taken from (41) and (42) without\nthe terms proportional to ρ. Analogous expressions hold for the second\ngeneration of sfermions. Of course, parity conjugated sfermions are usually\nsplitted by a large amount with respect to the above averages. If we take,\nas an example, σH ≈ σL ≈ σQ ≈ −1, which leads to relatively light\ncharginos (without further motivation for this particular choice), all the\nthird family sfermions are as light as the gauginos, the first and second\nfamilies are much heavier. The two-loop contributions are important in\nthis case where the fine-tuning between M1/2 and m3/2 is large.\nIn the numerical analysis, the radiative corrections are included, and\nthe parameter space is scanned around the maximal fine-tuning values. As\nexpected we find Higgsino-like LSP's degenerate with the lightest chargino.\nThe chargino masses can be as low as 100 GeV. We have explicitly cut the\nspectrum by (arbitrarily) imposing that the MSSM Higgs mass is greater\nthan 100 GeV. We do find Higgses within the 100 − 109 GeV slot corresponding to a value of tan β which does not exceed 18. Among the squarks\nthe left sbottoms are the lightest. We present in fig. 1 the mass spectrum\nas a function of σH . We have rescaled the masses and display them in\nunits of m3/2 . As expected the hierarchy between families is not destroyed\nby the evolution down to the Fermi scale. The values of m3/2 chosen in\nthe figure are below 2 TeV. Higher values of m3/2 would not modify the\npicture, only the fine-tuning would be more severe.\nLet us come back to one of the issues which prompted our study: the\nFCNC effects and the decoupling of the first two families. The mass insertions that are usually used to evaluate the FCNC contributions[13] are\nroughly given in terms of the X charges of the particles by\nm2d ̃ + m2d ̃ − m2b̃ − m2b̃\nL\n\nR\n\nL\n\nδij ∼ 2\n\nR\n\n≈\n\n|Xi − Xj | |Xi −Xj |\nξ\nXi + Xj\n\n(44)\n\nThe strong constraints on the mass insertions with i = 1 and j = 2,\nsuggests[6] a choice of some degeneracy and some alignment in the diagonal soft masses by choosing d1 = d2 and e1 = e2 . However, this is\nnot enough and we still need large values of the supersymmetry breaking\nparameter, m3/2 ∼ 2TeV for a sufficient FCNC decoupling. Indeed, as\nnoticed before, the flavour dependence of the soft terms coming from the\nhF i supersymmetry breaking have also to be taken into account. They\nare reduced by at least a factor ξ 2 , as follows from (14), and more model\ndependent, but still dangerous enough for the K − K̄ system. Fortunately\nwe do get such high values of m3/2 in our numerical scanning without\nfurther effort. Yet, the contribution to ǫK comes out close to the phenomenological bounds in this model, in spite of the combined use of all\n\n14\n\n\fmass spectrum\n3\nu\nd\n2.5\n\ne\ns\n\n2\n\nc\n\nb\n\n1.5\n\nnu\n\ntau\n\n1\n\n0.5\n\nchargino\n\n0\n-0.5\n\n0\n\nt\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\nFigure 1: The mass spectrum in units of m3/2 . We have displayed the lightest\nchargino mass and the left-right average masses for the U squarks, the D squarks\nand the sleptons as a function of σH appropriately shifted.\n\n15\n\n3\n\n\fthree anti-FCNC mechanisms, degeneracy and alignment from the equality of some charges, together with decoupling through a relatively large\nsupersymmetry breaking scale in the scalar sector. This is the price to pay\nfor the inverse sfermion mass hierarchy.\nIt is worth noticing that the small M1/2 /m3/2 and A/m3/2 ratios that\ncharacterize these models are what is needed[14] to avoid charge and colour\nbreaking vacua without need for further cosmological assumptions. In the\nlarge μ version of the model, one can reduce the hierarchy and increase\nthe degeneracy by increasing the M1/2 /m3/2 ratio. Besides the fact that it\nwould bring back the issue of a fine-tuning of the μ/M1/2 ratio, this would\nbe strongly constrained by the wrong vacuum problems.\n\n6\n\nSummary and Concluding Remarks\n\nWe have studied the decoupling of the first two squark families in order\nto lower the FCNC effects. This has been done using the gauged U (1)\nflavour symmetries which had already been utilised to explain the fermion\nmasses and the mixing angles. Within this framework we have focused\non more model-independent results. In particular as soon as one tries\nto induce large mass hierarchies one faces the fine tuning problem in the\nelectroweak sector. Indeed the Fermi scale has to be maintained although\nthe supersymmetry breaking scale is pushed up beyond the TeV limit. This\nforces to study carefully the diverse compensations in the MZ2 equation.\nAs a result one has to resort to a two-loop analysis of the Higgs sector.\nFortunately we have shown that the two-loop effects are solely governed by\nthe Green-Schwarz anomaly which is determined from the fermion masses.\nThis allows a thorough study of the minimum equations, and the possibility\nof a scenario where the fine-tuning appears in the (M1/2 , m3/2 ) sector with\na small value for μ. This differs from the usual cMSSM where μ is large.\nThis leads to a Higgsino-like LSP and a characteristic mass spectrum. In\nparticular we find light charginos. On the contrary, the sfermions of the\nfirst and second families should be of order a few TeV, a nice experimental\nsignature, indeed.\nOf course, the inverse hierarchy models based on abelian flavour symmetries are especially affected by the FCNC problems. The supersymmetry breaking scale required to get an efficient decoupling would be very\nhigh. Therefore, it is not clear whether they are a good choice to escape\nthe flavour changing effects in spite of the natural prediction of heavy\nsfermions in the first two families. On the other hand they also possess\nsome other nice features: a natural small scale from the Fayet-Iliopoulos\nterm, the presence of anomalous abelian symmetries in superstring solutions, the simplicity of the fitting to the puzzling fermion hierarchy and,\nlast but not least, the relation between the fermion and sfermion spectrum.\nA compromise could be obtained with additional flavour symmetries, for\ninstance non-abelian ones, to reduce the splitting between the sfermion in\n\n16\n\n\fthe first two families. More speculatively, one could hope that the more recent developments in string theory – see for instance [11, 15] and references\ntherein – would provide new insights into the old quarrel of supersymmetry\nwith flavour.\n\n17\n\n\f7\n\nAppendix\n\nIn the case of more than one abelian flavour charges, Xi , (i = 1, ...., n), we\nintroduce an equal number of scalars, Φi , so that all the U (1)'s are broken.\nFor the consistency of the model, we make the following assumptions:\nA) Only one U (1) symmetry is anomalous, which we call X1 , and only\nthe corresponding D−term has a Fayet-Iliopoulos term with coefficient ξ.\nThis is related to the anomaly A through the Green-Schwarz mechanism\nby (13). It is mandatory that the other abelian charges fulfil the analogous\nof (12) and that they do not introduce any other anomaly.\nB) Let us denote by −φij the charge Xi of the scalar Φj . They are chosen so\nthat there is no term in the superpotential with the Φ′ s alone. These U (1)\ncharges are normalized so that all the corresponding coupling constants\nare equal.\nThe relevant soft-terms are the masses mi of the scalars Φi . Let φ−1\nij\nbe the inverse of the charge matrix φ defined above, which has an inverse\nbecause of our assumption B). The equivalent of (14) is now,\n2\n2\n|φi |2 = φ−1\ni1 ξ MP ,\n\nhDXi i = m2j φ−1\nji\n\n(45)\n\nThen, (20) is modified by the replacement,\nξ A −→\n\nY\u0010\n\n2\nφ−1\ni1 ξ\n\n\u0011Ai /2\n\n,\n\n(46)\n\nwhere Ai = φ−1\ni1 A. Therefore, in the pluri-U (1) case, the resulting value\nfor the anomaly can be slightly different from the value in section 3.\nFinally, the contributions to the sfermion masses from the hDXi i terms\nare m2j φ−1\nji Xi (a), where Xi (a) is the corresponding fermion charge. The\ncontribution to the two-loop scalar masses becomes,\nδ = δ̂ +\n\n1\nm2 φ−1 A\n8π 2 j j1\n\n(47)\n\nwhere δ is defined in (8). This allows for some variation with respect to\nthe values discussed in section 3, but the two-loop contributions generically\nremain as small.\n\nReferences\n[1] M. Leurer, Y. Nir, N. Seiberg, Nucl. Phys. B398 (1993) 319; B420\n(1994) 468; Y. Nir and N. Seiberg, Phys. Lett. B309 (1993) 337.\n[2] S. Dimopoulos; G.F. Giudice, Phys. Lett. 357B (1995) 573; A. G.\nCohen, D. B. Kaplan, A. E. Nelson, Phys. Lett.388B 588 (1996); A.\nPomarol, D. Tommasini, Nucl. Phys. B466 (1987) 3.\n\n18\n\n\f[3] N. Arkani-Hamed, H. Murayama, Phys. Rev.D56 (1997) 6733; K.\nAgache, M. Graesser, Phys. Rev.D59 (1999) 015007.\n[4] C. D. Froggatt and H. B. Nielsen, Nucl. Phys. B147 (1979) 277; J.\nBijnens and C. Wetterich, Nucl. Phys. B283 (1987) 237. P. Ramond,\nR.G. Roberts and G. G. Ross, Nucl. Phys. B406 (1993) 19.\n[5] L. E. Ibáñez and G. G. Ross, Phys. Lett. B332 (1994) 100; P.\nBinétruy and P. Ramond, Phys. Lett. B350 (1995) 49; V. Jain and\nR. Shrock, Phys. Lett. B352 (1995) 83; E. Dudas, S. Pokorski and\nC. A. Savoy, hep-ph/9504292, Phys. Lett. B356 (1995) 45; Y. Nir,\nhep-ph/9504312, Phys. Lett. B354 (1995) 107.\n[6] E. Dudas, S. Pokorski and C. A. Savoy, Phys. Lett. B369 (1996)\n255; E. Dudas, C. Grojean, S. Pokorski and C. A. Savoy, Nucl. Phys.\nB481 (1996) 85.\n[7] P. Binétruy and E. Dudas, Phys. Lett. B389 (1996) 503; G. Dvali, A.\nPomarol, Phys. Rev. Lett. 77 (1996) 3728.\n[8] S. Ambrosiano, A. E. Nelson, Phys. Lett. B411 (1997) 283; A. E.\nNelson, D. Wright, Phys. Rev.D56 (1997) 1598\n[9] I. Jack, D. R. T. Jones, S. P. Martin, M. T. Vaughn and Y. Yamada\nPhys. Rev. D50 (1994) 5481.\n[10] M. Olechowski, S. Pokorski, Phys. Lett. B344 (1995) 201; N. Polonski,\nA. Pomarol, Phys. Rev. Lett. 73 (1994) 2292; D. Matalliotakis, H. P.\nNilles, Nucl. Phys. B435 (1995) 115. P. H. Chankowski, J. Ellis, S.\nPokorski, Phys. Lett. B423 (1998), 327; G. L. Kane, S. F. King,\n[11] L. E. Ibáñez, C. Munoz, S. Rigolin, Nucl. Phys. B553 (1999) 43; L.E.\nIbáñez, R. Rabadan , A.M. Uranga, Nucl. Phys. B542 (1999) 112.\n[12] M. Dine, N. Seiberg and E. Witten, Nucl. Phys. B289 (1987) 585; J.\nAtick, L. Dixon and A. Sen, Nucl. Phys. B292 (1987) 109; M. Dine,\nI. Ichinose and N. Seiberg, Nucl. Phys. B293 (1987) 253.\n[13] F. Gabbiani, E. Gabrielli, A. Masiero, L. Silvestrini, Nucl. Phys. B447\n(1996) 321.\n[14] J.A. Casas, A. Lleyda, C. Munoz, Phys. Lett. B380 (1996) 59. S.A.\nAbel, C.A. Savoy, Nucl. Phys. B532 (1998) 3. S.A. Abel, C.A. Savoy,\nPhys. Lett. B444 (1998) 119.\n[15] G. Aldazabal, L.E. Ibanez, F. Quevedo, JHEP 0001:031 (2000).\n\n19\n\n\f"}