{"id": "http://arxiv.org/abs/hep-ph/0110042v1", "guidislink": true, "updated": "2001-10-03T09:56:28Z", "updated_parsed": [2001, 10, 3, 9, 56, 28, 2, 276, 0], "published": "2001-10-03T09:56:28Z", "published_parsed": [2001, 10, 3, 9, 56, 28, 2, 276, 0], "title": "Some questions concerning Bose-Einstein correlations in multiple\n  particle production processes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0110010%2Chep-ph%2F0110148%2Chep-ph%2F0110269%2Chep-ph%2F0110383%2Chep-ph%2F0110413%2Chep-ph%2F0110155%2Chep-ph%2F0110377%2Chep-ph%2F0110213%2Chep-ph%2F0110255%2Chep-ph%2F0110271%2Chep-ph%2F0110259%2Chep-ph%2F0110284%2Chep-ph%2F0110042%2Chep-ph%2F0110079%2Chep-ph%2F0110315%2Chep-ph%2F0110384%2Chep-ph%2F0110264%2Chep-ph%2F0110072%2Chep-ph%2F0110216%2Chep-ph%2F0110127%2Chep-ph%2F0110143%2Chep-ph%2F0110381%2Chep-ph%2F0110200%2Chep-ph%2F0110388%2Chep-ph%2F0110353%2Chep-ph%2F0110379%2Chep-ph%2F0110266%2Chep-ph%2F0110201%2Chep-ph%2F0110020%2Chep-ph%2F0110402%2Chep-ph%2F0110398%2Chep-ph%2F0110218%2Chep-ph%2F0110392%2Chep-ph%2F0110021%2Chep-ph%2F0110311%2Chep-ph%2F0110025%2Chep-ph%2F0110165%2Chep-ph%2F0110251%2Chep-ph%2F0110049%2Chep-ph%2F0110110%2Chep-ph%2F0110236%2Chep-ph%2F0110355%2Chep-ph%2F0110206%2Chep-ph%2F0110274%2Chep-ph%2F0110292%2Chep-ph%2F0110349%2Chep-ph%2F0110163%2Chep-ph%2F0110281%2Chep-ph%2F0110301%2Chep-ph%2F0110131%2Chep-ph%2F0110345%2Chep-ph%2F0110302%2Chep-ph%2F0110229%2Chep-ph%2F0110157%2Chep-ph%2F0110080%2Chep-ph%2F0110387%2Chep-ph%2F0110310%2Chep-ph%2F0110308%2Chep-ph%2F0110128%2Chep-ph%2F0110193%2Chep-ph%2F0110412%2Chep-ph%2F0110344%2Chep-ph%2F0110332%2Chep-ph%2F0110207%2Chep-ph%2F0110406%2Chep-ph%2F0110223%2Chep-ph%2F0110084%2Chep-ph%2F0110118%2Chep-ph%2F0110185%2Chep-ph%2F0110222%2Chep-ph%2F0110209%2Chep-ph%2F0110286%2Chep-ph%2F0110394%2Chep-ph%2F0110316%2Chep-ph%2F0110168%2Chep-ph%2F0110129%2Chep-ph%2F0110309%2Chep-ph%2F0110144%2Chep-ph%2F0110161%2Chep-ph%2F0110024%2Chep-ph%2F0110300%2Chep-ph%2F0110282%2Chep-ph%2F0110033%2Chep-ph%2F0110273%2Chep-ph%2F0110015%2Chep-ph%2F0110391%2Chep-ph%2F0110314%2Chep-ph%2F0110146%2Chep-ph%2F0110307%2Chep-ph%2F0110056%2Chep-ph%2F0110034%2Chep-ph%2F0110231%2Chep-ph%2F0110342%2Chep-ph%2F0110174%2Chep-ph%2F0110317%2Chep-ph%2F0110112%2Chep-ph%2F0110263%2Chep-ph%2F0110359%2Chep-ph%2F0110003%2Chep-ph%2F0110202%2Chep-ph%2F0110140&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Some questions concerning Bose-Einstein correlations in multiple\n  particle production processes"}, "summary": "Most models of Bose-Einstein correlations in multiple particle production\nprocesses can be ascribed to one of the following three broad classes: models\nbased on the original idea of the Goldhabers, Lee nad Pais, hydrodynamic models\nand string models. We present for discussion some basic questions concerning\neach of these classes of models.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=hep-ph%2F0110010%2Chep-ph%2F0110148%2Chep-ph%2F0110269%2Chep-ph%2F0110383%2Chep-ph%2F0110413%2Chep-ph%2F0110155%2Chep-ph%2F0110377%2Chep-ph%2F0110213%2Chep-ph%2F0110255%2Chep-ph%2F0110271%2Chep-ph%2F0110259%2Chep-ph%2F0110284%2Chep-ph%2F0110042%2Chep-ph%2F0110079%2Chep-ph%2F0110315%2Chep-ph%2F0110384%2Chep-ph%2F0110264%2Chep-ph%2F0110072%2Chep-ph%2F0110216%2Chep-ph%2F0110127%2Chep-ph%2F0110143%2Chep-ph%2F0110381%2Chep-ph%2F0110200%2Chep-ph%2F0110388%2Chep-ph%2F0110353%2Chep-ph%2F0110379%2Chep-ph%2F0110266%2Chep-ph%2F0110201%2Chep-ph%2F0110020%2Chep-ph%2F0110402%2Chep-ph%2F0110398%2Chep-ph%2F0110218%2Chep-ph%2F0110392%2Chep-ph%2F0110021%2Chep-ph%2F0110311%2Chep-ph%2F0110025%2Chep-ph%2F0110165%2Chep-ph%2F0110251%2Chep-ph%2F0110049%2Chep-ph%2F0110110%2Chep-ph%2F0110236%2Chep-ph%2F0110355%2Chep-ph%2F0110206%2Chep-ph%2F0110274%2Chep-ph%2F0110292%2Chep-ph%2F0110349%2Chep-ph%2F0110163%2Chep-ph%2F0110281%2Chep-ph%2F0110301%2Chep-ph%2F0110131%2Chep-ph%2F0110345%2Chep-ph%2F0110302%2Chep-ph%2F0110229%2Chep-ph%2F0110157%2Chep-ph%2F0110080%2Chep-ph%2F0110387%2Chep-ph%2F0110310%2Chep-ph%2F0110308%2Chep-ph%2F0110128%2Chep-ph%2F0110193%2Chep-ph%2F0110412%2Chep-ph%2F0110344%2Chep-ph%2F0110332%2Chep-ph%2F0110207%2Chep-ph%2F0110406%2Chep-ph%2F0110223%2Chep-ph%2F0110084%2Chep-ph%2F0110118%2Chep-ph%2F0110185%2Chep-ph%2F0110222%2Chep-ph%2F0110209%2Chep-ph%2F0110286%2Chep-ph%2F0110394%2Chep-ph%2F0110316%2Chep-ph%2F0110168%2Chep-ph%2F0110129%2Chep-ph%2F0110309%2Chep-ph%2F0110144%2Chep-ph%2F0110161%2Chep-ph%2F0110024%2Chep-ph%2F0110300%2Chep-ph%2F0110282%2Chep-ph%2F0110033%2Chep-ph%2F0110273%2Chep-ph%2F0110015%2Chep-ph%2F0110391%2Chep-ph%2F0110314%2Chep-ph%2F0110146%2Chep-ph%2F0110307%2Chep-ph%2F0110056%2Chep-ph%2F0110034%2Chep-ph%2F0110231%2Chep-ph%2F0110342%2Chep-ph%2F0110174%2Chep-ph%2F0110317%2Chep-ph%2F0110112%2Chep-ph%2F0110263%2Chep-ph%2F0110359%2Chep-ph%2F0110003%2Chep-ph%2F0110202%2Chep-ph%2F0110140&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Most models of Bose-Einstein correlations in multiple particle production\nprocesses can be ascribed to one of the following three broad classes: models\nbased on the original idea of the Goldhabers, Lee nad Pais, hydrodynamic models\nand string models. We present for discussion some basic questions concerning\neach of these classes of models."}, "authors": ["K. Zalewski"], "author_detail": {"name": "K. Zalewski"}, "author": "K. Zalewski", "arxiv_comment": "Talk at the 41-st Cracow Summer School of Theoretical Physics,\n  Zakopane, June 2001. Latex2e, 8 pages, no figures", "links": [{"href": "http://arxiv.org/abs/hep-ph/0110042v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/hep-ph/0110042v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/hep-ph/0110042v1", "affiliation": "M. Smoluchowski Institute of Physics, Jagellonian University, Cracow, Poland", "arxiv_url": "http://arxiv.org/abs/hep-ph/0110042v1", "journal_reference": "Acta Phys.Polon. B32 (2001) 3983-3992", "doi": null, "fulltext": "arXiv:hep-ph/0110042v1 3 Oct 2001\n\nSome questions concerning Bose-Einstein\ncorrelations in multiple particle production\nprocesses.\nK.Zalewski\nM.Smoluchowski Institute of Physics\nJagellonian University, Cracow\nand\nInstitute of Nuclear Physics, Cracow\nNovember 3, 2018\nAbstract\nMost models of Bose-Einstein correlations in multiple particle production processes can be ascribed to one of the following three broad classes:\nmodels based on the original idea of the Goldhabers, Lee and Pais, hydrodynamic models and string models. We present for discussion some basic\nquestions concerning each of these classes of models.\n\n1\n\nIntroduction\n\nSince the pioneering work of G. Goldhaber, S. Goldhaber, W. Lee and A. Pais,\npublished over forty years ago [1] and known as the GGLP model, Bose-Einstein\ncorrelations in multiple particle production processes have been studied in hundreds of papers. Many references can be found in the recent review articles\n[2] and [3]. These correlations have been popular in particular for two reasons.\nThey give impressive bumps in two-particle and many particle distributions\nand, if the regime of Einstein's condensation can be reached, there are even\nmore spectacular phenomena waiting to be discovered [4], [5], [6], [7]. What is\nmore, Bose-Einstein correlations are believed to yield important information,\nwhich seems hard, if not impossible, to obtain by other means. They have been\nused to find the sizes and shapes of the regions where hadrons are produced, as\nwell as to obtain detailed information about the evolution in time of the hadron\nproduction processes (see the reviews [2], [3]).\nThere is little, doubt, however, that the problem is hard. As an example of\na sceptical opinion let me quote one of the creators of this field of research, G.\nGoldhaber, who said at the Marburg conference in 1990: \"What is clear is that\nwe have been working on this effect for thirty years. What is not as clear is\nthat we have come much closer to a precise understanding of the effect\". Everybody agrees that the GGLP paper was very important and various extensions\nof the model proposed there are still being used. There are, however, other\napproaches. The GGLP model contains static sources of particles. In the more\n1\n\n\frecent \"hydrodynamic\" models the flow of the sources is of great importance.\nAnother very promising approach are string models, where the random phase\nassumption used in previous models is not necessary and the description looks\ncloser to QCD.\nIn the present paper we will characterize the GGLP models, the hydrodynamic models and the string models, stressing in each case open and potentially\nimportant problems.\n\n2\n\nGGLP models\n\nLet us consider two identical bosons, e.g. two π + mesons, created: one at point\n~r1 and the other at point ~r2 . If the two bosons were distinguishable, a crude\napproximation for the probability amplitude of observing both of them at point\n~r could be\nAD = eiφ1 +i~p1 *(~r−~r1 ) eiφ1 +i~p2 *(~r−~r2 ) .\n\n(1)\n\nHere the interaction between the two bosons is neglected, so that the two-particle\namplitude is a product of single particle amplitudes. Only the phase factors are\nkept and each phase is the sum of the phase obtained by the boson at birth and\nof the phase acquired while propagating with given momentum from the birth\npoint to point ~r.\nFor identical bosons, however, this amplitude has not the right symmetry\nwith respect to the exchange of the two bosons and the least one must do is to\nsymmetrize it. Thus for identical bosons the corresponding approximation is\n\u0011\n\u0010\n1\nA = √ ei(φ1 +φ2 )+i(~p1 +~p2 )*~r e−i(~p1 *~r1 +~p2 *~r2 ) + e−i(~p2 *~r1 +~p1 *~r2 ) .\n2\n\n(2)\n\nThe probability distribution for momenta is proportional to\n|A|2 = 1 + cos ((~\np1 − p~2 ) * (~r1 − ~r2 )) .\n\n(3)\n\nIn order to make use of this expression it is necessary to average it over the non\nmeasured production points ~r1 , ~r2 . In the GGLP paper the averaging was over\nthe space distribution of sources ρ(~r1 ; R)ρ(~r2 ; R), where R is a parameter with\ndimension length, which was interpreted as the radius of the production region.\nVarious generalizations, modifications and extensions followed, but let us use\nthis simple variant to make some general remarks.\nIn the GGLP model the distribution for pairs of particle momenta depends\nonly on the momentum difference ~q = p~1 − ~p2 . This is in violent contradiction\nwith the data, but GGLP found a clever way out. The distribution for the\nunsymmetrized amplitude is flat. Therefore, the result can be just as well\ninterpreted as a prediction for the ratio of the actual momentum distribution\nto the distribution for distinguishable bosons. Further we denote this ratio by\nR(~\np1 , p~2 ):\nR(~\np1 , ~p2 ) =\n\n|A(~\np1 , p~2 )|2\n|AD (~\np1 , p~2 )|2\n\n(4)\n\nNow, the momentum distribution is not assumed to be independent of the sum\nof the momenta. It is enough to make the much weaker and more reasonable\n2\n\n\fassumption that the dependence on this sum can be factored out and cancels in\nthe ratio. A well known difficulty with this approach is that the distribution for\ndistinguishable π + -s, say, cannot be obtained from experimental data without\nfurther assumptions. GGLP assumed that the distribution for π + π − pairs can\nbe used instead. There have been many other proposals (cf. e.g. [8] and\nreferences contained there), but none is fully satisfactory.\nFor any nonsingular averaging process the average cosine must be close to\none for |~\nq | ≈ 0 and very small for large values of |~q|. Therefore, the ratio\nR(~\np1 , p~2 ) decreases, though not necessarily monotonically, from values close to\ntwo for small values of |~\nq | to values close to one for large values of |~q|. This\ngives the characteristic bump in R(~\np1 , p~2 ) for small values of ~q2 . If R is the\nonly dimensional parameter available, the width of this bump must, for simple\ndimensional reasons, be proportional to R−2 . Thus, the main qualitative results of GGLP are much more general than their specific choices of the weight\nfunctions ρ(~r; R). Nevertheless, they are not quite general.\nIt is well known from optics that, whether photons bunch or not, depends\non the type of source and not only on the fact that they are bosons. Photons\ncan antibunch just as well. In order to illustrate this point within the GGLP\ntype models, let us assume that the amplitude A has an additional factor, which\nequals one, if the product (~r1 − ~r2 )(~\np1 − p~2 ) > 0 and minus one otherwise. This\nfactor changes sign, when the momenta of the two bosons are exchanged. Therefore, the squared modulus of the properly symmetrized production amplitude\nis\n|A|2 = 1 − cos ((~\np1 − p~2 ) * (~r1 − ~r2 )) .\n\n(5)\n\nand we get a hole instead of the bump in the small ~q2 region. Admittedly this\nmodel is not realistic. Its purpose is only to indicate a possibility. This may\nbe interesting in view of the LEP results concerning Bose-Einstein correlations\nin e+ e− annihilations, where two W bosons are simultaneously produced. It\nseems that identical pions originating from the decay of a single W exhibit the\nusual bump attributed to Bose-Einstein correlations, while these correlations\nare absent, or very weak, for pairs of identical pions, when each pion originates\nfrom a different W [9], [10], [11]. In the GGLP model the bump results from\nthe assumptions that pion pairs produced in different pairs of points add incoherently. Mild modifications of this assumption [2], [3] can affect the size of the\nbump, but do not eliminate it. It would be interesting to check, whether the\nGGLP assumptions could be modified so as to predict the bump for some, but\nnot for all pairs of identical mesons produced in a multiple particle production\nevent.\n\n3\n\nHydrodynamic models\n\nIt is not possible to express the ratio R(~\np, ~p′ ) in terms of the single particle\nmomentum distributions. In the hydrodynamic models, as well as in GGLP\nmodels, one makes, however, an assumption, which makes it possible to express this ratio in terms of the diagonal and off-diagonal terms of the single\nparticle density matrix in the momentum representation. It is convenient to\nformulate the hydrodynamic models in terms of source functions S(X, K). The\n\n3\n\n\fsource function [12], [13] is related to the single particle density matrix in the\nmomentum representation by the formula\nZ\nρ(~\np, ~\np′ ) = eiqX S(X, K)d4 X.\n(6)\nIn this formula\n1\n(p + p′ );\nq = p − p′ .\n(7)\n2\nHere K, q, p, p′ are fourvectors, but in order to calculate the density matrix, we\nneed only their values corresponding to the momenta p, p′ being on their mass\nshells. X is an integration variable, which is associated with the position of the\nsources in space-time. The physical interpretation of X may be helpful, when\ntrying to find the source function. It is irrelevant for the calculation of the\ndensity matrix, once the source function is known.\nThere is an infinity of different source functions, which all give the same\ndensity matrix and consequently the same predictions for the ratio R(~\np, p~′ ). For\ninstance, one could put\nK=\n\n~ K)δ(X\n~\nS(X, K) = W (X,\n0 ),\n~ K)\n~ is the well-know Wigner function satisfying the relation\nwhere W (X,\nZ\n~\n′\n~ K)d\n~ 3X\nρ(~\np, ~\np ) = e−i~q*X W (X,\n\n(8)\n\n(9)\n\nand\n~ = 1 (~x + ~x′ ).\nX\n(10)\n2\nThis source function gives the correct density matrix by construction, but it\ncorresponds to a most unlikely scenario, where all the particles are created simultaneously at X0 = 0. Since our aim is to find the correct density matrix, this\nsource function would be fine, in spite of the unlikely physical picture attached\nto it. The problem is, however, that finding the Wigner function is not any\neasier than finding the density matrix in the momentum representation. The\nhope is that using a source function, which corresponds to a plausible scenario\nfor the production process, we will be able to use more efficiently what we know\nabout particle production in order to find the source function.\nAs an example of this approach let us consider the model reviewed in [2].\nThe source function is postulated in the form\n\u0015\nmT cosh y cosh ηt − rT−1 XKT sinh ηt\n∗\nS(X, K) = CmT cosh(y − η) exp\nT\n\u0014\n\u0015\nr2\nη2\n(τ − τ0 )2\nexp − T 2 −\n. (11)\n−\n2R\n2(∆η)2\n2(∆τ )2\n\u0014\n\nIn this formula\n\n4\n\n\fη=\n\n1\nt+z\nlog\n;\n2\nt−z\n\np\nrT\n;\nτ = t2 − z 2 ;\nR\n~ 2;\nm2T = m2 + K\nrT2 = ~x2T ;\n\nηt = ηf\n\n(12)\n\n~ The source function depends on\nz is parallel to xk and ~x is parallel to K.\nsix free parameters (R, T, ηf , ∆η, τ0 , ∆τ ) and, moreover, contains the normalization constant C, but each piece of the source function has a clear physical\ninterpretation. Therefore, fixing these parameters from the data yields directly\ninteresting physical information. We will illustrate this important point using\na fit to the NA49 data on Pb-Pb scattering at 158 GeV/c per nucleon [2]. The\nparameter R is the transverse radius of the tube, from which the final hadrons\nare emitted. The result R ≈ 7fm is about twice the radius resulting from from\nthe known radii of the lead nuclei. This is evidence for a significant transverse expansion, before most of the hadrons are produced. The parameter ηf\ngoverns the transverse rapidity of the sources. The value obtained ηf ≈ 0.35\ncorresponds to transverse velocities reaching the velocity of sound in the plasma\n(1/3), which looks very reasonable. The parameter T occurs as the temperature\nin a Boltzmann type factor. Its fitted value T ≈ 130fm is significantly lower\nthan the temperatures obtained, when fitting the chemical composition of the\nfinal state hadrons, which indicates that during the expansion the stuff cools\ndown. Another interesting comparison is that of the fitted values τ0 ≈ 9fm\nand ∆τ ≈ 1.5fm. The parameter τ0 is the typical time between the moment of\ncollision and the moment, when a hadron is produced. The parameter ∆τ is the\nduration of the time, when hadrons are produced. The fact that τ0 ≫ ∆τ means\nthat all the hadrons are produced in a short time interval after a relatively long\nincubation time. Unfortunately, as stated by the authors [2], the parameter ∆τ\nis poorly constrained by the data, so that this conclusion is not as solid as the\nothers.\nAs seen from this example, given a model one can obtain from the data\nmuch important information. An open problem is, however, how stable are\nthese conclusions when models change. As seen from the expression of the\nsource function in terms of the Wigner function, one can fit perfectly the data\nassuming that all the particles are produced exactly simultaneously. It is just\nas easy to get a perfect fit assuming that the particles are produced only on\nthe surface of a sphere, or only on the surface of a cube. These alternative\nmodels are so implausible physically that there is little doubt they should be\ndiscarded. The question is, however, how many physically plausible models can\nfit the data, while giving completely different descriptions of the hadronization\nprocess?\n\n4\n\nString picture\n\nThe string model for Bose-Einstein correlations [14],[15],[16] has not yet been\ndeveloped to the point, where it could be compared quantitatively with the data.\nIt is, however, much more ambitious than the models described above. Instead\nof phenomenological assumptions about sources and incoherence, it gives a well\ndefined amplitude for the production of particles with momenta p~1 , . . . , ~pn . This\namplitude is a plausible approximation to QCD. We will consider only the 1+1\n5\n\n\fdimensional version of the string model, which seems to contain all the main\ningredients of this approach, while it is much simpler than the 3+1 dimensional\nversion. In fact the 1+1 dimensional model has been recently analytically diagonalized [17], though in the version without the Bose-Einstein correlations.\nLet us consider a final state consisting of hadrons with momenta p1 , . . . pn .\nTo this final state the model ascribes a polygon in the (z, t) plane. The sides\nof this polygon are the trajectories of the various partons existing between the\nmoment of e+ e− annihilation and the moments, when the hadrons are formed.\nThe partons are considered massless and moving with the velocity of light,\ntherefore the sides of the the polygon form angles ±45◦ with the t and z axes.\nLet us put the e+ e− annihilation point at the origin of the coordinate system.\nAt this point two partons, a quark and an antiquark, are formed flying along\nthe z axis, away from each other. Their trajectories form the first two sides of\nthe polygon, both starting at the origin, one going to the right and upwards,\nthe other going to the left and upwards. The partons are end points of a colourstring. Thus the string sweeps the surface of the polygon. The energy of the\nstring E is connected to its length L by the formula E = κL, where κ is a\nconstant known as the string tension. Thus, while the quark and the antiquark\nfly away from each other and the string expands, there is a force reducing the\nenergy of the two partons and finally the directions of their motions get reversed\nstarting another pair of the sides of the polygon. In the meantime the string at\nany point between the endpoints can break producing a quark and an antiquark,\nwhich form another pair of sides of the polygon. Since any segment of the string\nhas a quark at one end and an antiquark at the other, it is easily checked that,\nexcept for the original two partons, all the quarks fly in one direction and all\nthe antiquarks in the other. From time to time a quark meets and antiquark.\nThen the two form a hadron with two-momentum equal to the sum of the twomomenta of the two meeting partons. Thus the polygon contains the following\nelements: the vertex at the origin, two turning points of the original partons, n\nvertices, where the n hadrons were formed and n − 1 vertices, where the string\nbroke. One finds that the two-momentum of a hadron is determined by and\ndetermines the lengths of the two sides of the polygon adjacent to the vertex\nwhere the hadron was formed.\nThe probability amplitude for producing the state (p1 , . . . , pn ) depends on\nthe area A of the polygon\nM (p1 , . . . , pn ) ∼ eiξA .\n\n(13)\n\nThe imaginary part of ξ, ib, gives the probability distribution well-known from\nthe LUND model\n|M (p1 , . . . , pn )|2 ∼ e−bA .\n\n(14)\n\nThe imaginary part, believed to be close to the string tension κ, is important\nfor the description of the Bose-Einstein correlations. In order to describe these\nBose-Einstein correlations the amplitude (13) is symmetrized very much like in\nthe GGLP approach and a qualitatively satisfactory description of the correlations is obtained. Since, however, the amplitude being symmetrized is not the\nGGLP one, there are some significant new points.\nSymmetrization means summing over all the permutations of identical hadrons.\nLet us concentrate on an exchange of two π + mesons. Each of them is produced\n6\n\n\fat some hadronization vertex of the polygon. In order to perform the exchange,\none has to cut off the two pionic vertices together with their adjacent sides of\nthe polygon and to glue them back, pion one in the position of pion two and\npion two in the position of pion one, so as to obtain again a closed polygon. The\nnew polygon has in general a different area A′ 6= A. If the new area is much\nlarger than the area before the exchange, the contribution from the interference\nwith the permuted amplitude is negligible. One reason, familiar from the GGLP\nmodel, is that the relative phase is a rapidly varying function of momentum.\nThe new fact is, however, that the modulus of the permuted amplitude is addi′\nb\ntionally suppressed by the factor e− 2 (A−A ) . In order to obtain small changes\nof the area, it is advantageous to exchange pions, which are close to each other\ncounting along the perimeter of the polygon, or equivalently, which have similar\nmomenta. This is the reason for the familiar bump for p1 ≈ p2\nLet us quote two interesting qualitative predictions of this model. There\nshould be a difference between the Bose-Einstein correlations for pairs of charged\npions, say π + π + , and corresponding correlations for pairs of neutral pions. The\nreason is that two π 0 -s can be formed at two adjacent hadronisation vertices of\nthe polygon, while two π + -s cannot. There should also be a difference between\nthe Bose-Einstein correlations for pairs of mesons originating from the same\nstring and pairs of mesons originating from different strings. For the latter\nsituation the present model is clearly not applicable. It has been suggested ([18]\nand references quoted there) that perhaps there are no correlations between\nmesons from different strings, which would explain the observations of BoseEinstein correlations for pions from decays of pairs of W bosons.\nAn interesting question raised by Bowler is the relation of the string model\nto the GGLP model. Bowler proposed [19] a model closely related to the GGLP\nmodel, which looks very similar to the string model and, according to Bowler,\ngives also very similar predictions. The model used by Bowler contains a distribution of sources, which depends not only on space-time points, as in the\nGGLP paper, but also on the momenta of the produced particles. Such models\nhave become popular after the work Yano and Koonin [20] and are sometimes\ncalled Yano Koonin models. It is not clear, however, what constraints must\nbe imposed on the distributions, in order to make them consistent with quantum mechanics. Therefore, occasionally this approach gives inconsistent results\n[21]. Bowler's model deviates in two ways from the string model. It yields the\nprobability amplitude as an exponential in the area, but this is a modified area,\nwhere certain regions are counted more than once. Moreover, in both models,\nin order to get the inclusive k-particle distribution it is necessary to integrate\nout the momenta of the remaining particles, but in Bowler's model the integration region is different from that used in the string model. According to some\nunpublished numerical calculations by Bowler the two deviations nearly cancel.\n\nReferences\n[1] G. Goldhaber, S. Goldhaber, W. Lee and A. Pais, Phys. Rev. 120(1960)300.\n[2] U.A. Wiedemann and U. Heinz,Phys. Rep. 319(1999)145.\n[3] R.M. Weiner, Phys. Rep. 327(2000)250.\n\n7\n\n\f[4] S. Pratt, Phys. Letters B301(1993)159.\n[5] S. Pratt, Phys. Rev. C50(1994)469.\n[6] A. Bialas and K. Zalewski, Eur. Phys. J. C6(1999)349.\n[7] A. Bialas and K. Zalewski, Phys. Rev. D59(1999)097502.\n[8] S. Haywood, Where are we going with Bose-Einstein – a mini review RAL\nreport January 6-th 1995.\n[9] G. Abbiendi et al., Eur. Phys. J. C8(1999)559.\n[10] R. Barate et al., Phys. Letters B478(2000)50.\n[11] M. Acciarri et al., Phys. Letters B493(2000)233.\n[12] M. Gyulassy, S.K.\nC20(1979)2267.\n\nKauffmann\n\nand\n\nL.W.\n\nWilson,\n\nPhys.\n\nRev.\n\n[13] S. Pratt, Phys. Rev. Letters 53(1984)1219.\n[14] B. Andersson and W. Hofmann, Phys. Letters 169B(1986)364.\n[15] B. Andersson, Acta Phys. Pol. B29(1998)1885.\n[16] B. Andersson and M. Ringnèr, Nucl. Phys B513(1998)627.\n[17] B. Andersson and F. Södergerg, Eur. Phys. J. C162000.\n[18] B. Andersson, Moriond 2000.\n[19] M.G. Bowler, Phys. Letters B185(1987)205.\n[20] F. Yano and S. Koonin, Phys. Letters B78(1978)556.\n[21] M. Martin, H. Kalechofsky, P. Foka and U.A. Wiedemann, Eur. Phys. J\nC2(1998)359.\n\n8\n\n\f"}